{"word":"boi","summary":{"en":"“Boi” is a slang spelling of “boy,” used online to sound playful or emphatic.","zh":"“boi”是“boy”的网络俚语拼写，用来显得更戏谑或更强调。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, internet) A playful or emphatic spelling of “boy,” often used to address someone or react strongly (surprise, excitement, warning, etc.).","zh":"（俚语/网络用语）“boy”的戏谑或强调拼写，常用来称呼对方或表达强烈反应（惊讶、兴奋、提醒等）。"},"examples":[{"en":"Boi, that game was amazing!","zh":"兄弟/老铁，那游戏太爽了！"},{"en":"Oh boi, here we go again.","zh":"哎呀/糟了，又来了。"},{"en":"Listen, boi—don’t do that.","zh":"听着，小子/哥们——别那样做。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang) A boy; a young male person (nonstandard spelling, often for style).","zh":"（俚语）男孩；年轻男性（非标准拼写，多为风格/玩梗用）。"},"examples":[{"en":"He was just a boi when he started playing music.","zh":"他开始玩音乐时还是个小男孩。"}]}],"synonyms":["boy","dude","bro","guy"],"phonetic":"/bɔɪ/","extraExplanation":["“boi”多见于网络口语、弹幕、聊天和梗图里，带有幽默、夸张或“戏精式”强调的感觉（如“Oh boi…”）。","有时它与非裔美国英语（AAVE）及网络迷因的表达方式相关；在正式写作、简历、邮件中一般不使用，建议用标准拼写“boy”。","称呼别人为“boi”可能显得轻佻或带挑衅意味，是否合适取决于语气、关系和场景。"]}
{"word":"boia","summary":{"en":"“Boia” is mainly a Portuguese word meaning “buoy,” and in Brazilian informal speech it can also mean “food.”","zh":"“boia”主要是葡萄牙语，意思是“浮标”；在巴西的口语里也可指“食物/吃的东西”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(mainly Portuguese; sometimes used in English contexts) a buoy—an object floating on water to mark a place, guide boats, or warn of danger.","zh":"（主要为葡萄牙语；英语语境中偶见）浮标——漂浮在水面上的标记物，用来标示位置、引导航行或警示危险。"},"examples":[{"en":"The diver followed the boia back to the boat.","zh":"潜水员沿着浮标（boia）回到了船边。"},{"en":"Keep away from the boia—it marks shallow water.","zh":"远离那个浮标（boia）——它标示着浅水区。"}]},{"partOfSpeech":"n.","definition":{"en":"(Brazilian Portuguese, informal) food; something to eat.","zh":"（巴西葡萄牙语，非正式）食物；吃的东西。"},"examples":[{"en":"Do we have any boia for dinner?","zh":"晚饭有吃的吗（boia）？"},{"en":"After work, they grabbed some boia at a small restaurant.","zh":"下班后，他们在一家小餐馆随便吃了点东西（boia）。"}]}],"synonyms":["buoy","float","marker buoy","food (informal, Br. Portuguese)","meal (informal, Br. Portuguese)"],"phonetic":"ˈbɔɪ.ə","extraExplanation":["“boia”不是常见英语词，多见于葡萄牙语/巴西葡萄牙语语境（如潜水、航海、旅行对话）中被直接借用。若在正式英语写作里，通常用“buoy”。","发音在不同地区会有差异：葡萄牙语里更接近“两音节”，而英语使用者可能会按英语习惯读成类似“BOY-uh”。"]}
{"word":"Boiardo","summary":{"en":"Boiardo usually refers to the Italian Renaissance poet Matteo Maria Boiardo, author of *Orlando innamorato*.","zh":"Boiardo通常指意大利文艺复兴诗人博亚尔多，《恋爱的奥兰多》作者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Matteo Maria Boiardo (1441–1494), an Italian Renaissance nobleman and poet, best known for the chivalric epic poem *Orlando innamorato* (“Orlando in Love”).","zh":"博亚尔多（Matteo Maria Boiardo，1441–1494），意大利文艺复兴时期的贵族与诗人，最著名作品是骑士史诗《恋爱的奥兰多》（*Orlando innamorato*）。"},"examples":[{"en":"Boiardo’s *Orlando innamorato* helped shape later Italian epic poetry.","zh":"博亚尔多的《恋爱的奥兰多》影响了后来的意大利史诗传统。"},{"en":"In our literature class, we compared Boiardo with Ariosto.","zh":"在文学课上，我们把博亚尔多和阿里奥斯托作了比较。"}]},{"partOfSpeech":"n.","definition":{"en":"The surname “Boiardo,” used to refer to someone with that family name.","zh":"姓氏“Boiardo（博亚尔多）”，用于指代拥有该姓的人。"},"examples":[{"en":"The article was written by a researcher named Boiardo.","zh":"这篇文章由一位姓博亚尔多的研究者撰写。"}]}],"synonyms":["Matteo Maria Boiardo"],"phonetic":"/boʊˈjɑrdoʊ/","extraExplanation":["“Boiardo”在英语语境中通常指这位诗人本人；读到他时常会连到阿里奥斯托（Ariosto）的《疯狂的奥兰多》（*Orlando furioso*），因为后者在某种意义上是对博亚尔多叙事世界的继承与发展。","英文里这是外来姓名，发音常按英语习惯近似处理；如果你在意大利语课或意大利文学课里，可能会听到更接近意大利语的读法。"]}
{"word":"Boice","summary":{"en":"Boice is mainly a surname (family name), sometimes a spelling variant of Boyce.","zh":"Boice 主要是英文姓氏，有时是 Boyce 的拼写变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), used to refer to a person or family with the last name Boice","zh":"（姓氏）Boice，用作人的姓或家族姓"},"examples":[{"en":"Dr. Boice will see you at 3 p.m.","zh":"Boice 医生会在下午三点见你。"},{"en":"I met Ms. Boice at the conference.","zh":"我在会议上见到了 Boice 女士。"}]},{"partOfSpeech":"n.","definition":{"en":"a less common spelling variant of the surname “Boyce” (same pronunciation in many accents)","zh":"姓氏“Boyce”的一种较少见的拼写变体（在很多口音中读音相同）"},"examples":[{"en":"Some records list the name as Boyce, while others use Boice.","zh":"有些记录写作 Boyce，也有些写作 Boice。"}]}],"synonyms":["Boyce (variant spelling)"],"phonetic":"/bɔɪs/","extraExplanation":["“Boice”通常是英文姓氏，在美国较常见。遇到人名/姓氏时，首字母要大写。","它常被认为与“Boyce”有关（历史拼写不统一、移民登记或手写记录导致的变体较多）。在查族谱或旧档案时，常需要同时搜索 Boice 与 Boyce。"]}
{"word":"Boiceville","summary":{"en":"Boiceville is a hamlet in Ulster County, New York, in the Catskills region.","zh":"Boiceville 是美国纽约州阿尔斯特县卡茨基尔地区的一个小村落（非建制社区）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A small hamlet (unincorporated community) in Ulster County, in the Catskill Mountains region of New York State, USA.","zh":"美国纽约州阿尔斯特县卡茨基尔山区的一座小村落（非建制社区/小聚居地），名为博伊斯维尔。"},"examples":[{"en":"We stopped for lunch in Boiceville on our way to Phoenicia.","zh":"我们去菲尼西亚（Phoenicia）的路上在博伊斯维尔（Boiceville）停下来吃午饭。"},{"en":"Boiceville is a quiet place near the Catskills, popular for weekend drives.","zh":"博伊斯维尔靠近卡茨基尔山区，是周末自驾常去的安静地方。"}]}],"synonyms":["Boiceville, NY"],"phonetic":"ˈbɔɪsˌvɪl","extraExplanation":["“Boiceville”是地名（专有名词），通常不翻译，只做音译或直接使用英文拼写。","它位于纽约州哈德逊河谷/卡茨基尔（Catskills）一带，常见于旅行路线、地图、地址与当地新闻中。"]}
{"word":"boid","summary":{"en":"Boid can mean “bird” in a NYC-style slang spelling, or a simulated flocking agent in computing.","zh":"Boid 既可指模仿纽约口音的“bird（鸟）”的写法，也可指计算机群集模拟中的单个“代理/个体”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, dialect) A pronunciation/spelling of “bird,” especially associated with a New York City accent; sometimes used humorously or to imitate that accent.","zh":"（俚语/方言）“bird（鸟）”的发音/拼写变体，常与纽约市口音联系在一起；有时用于搞笑或模仿这种口音。"},"examples":[{"en":"In the old movie, the character says, “Look at that boid!”","zh":"在那部老电影里，角色说：“看那只 boid（鸟）！”"},{"en":"The comedian used “boid” to imitate a classic New York accent.","zh":"那位喜剧演员用“boid”来模仿经典的纽约口音。"}]},{"partOfSpeech":"n.","definition":{"en":"(computing, robotics) An individual simulated agent in a flocking model, used to study group movement like birds or fish.","zh":"（计算机/机器人）群集（flooding/flocking）模型中的单个模拟“个体/代理”，用于研究像鸟群或鱼群那样的群体运动。"},"examples":[{"en":"Each boid follows simple rules, and together they form a realistic flock.","zh":"每个 boid 遵循简单规则，组合起来就形成逼真的鸟群效果。"},{"en":"The game engine updates thousands of boids to animate crowd-like motion.","zh":"游戏引擎更新成千上万个 boid 来制作类似人群/群体的运动动画。"}]}],"synonyms":["bird (slang sense)","flocking agent","agent (simulation)"],"phonetic":"/bɔɪd/","extraExplanation":["“boid”作为“bird”的口音拼写，常见于对纽约（尤其是布鲁克林等）口音的刻板化模仿，在影视或段子里多用于制造喜剧效果；现实中使用时注意场合，避免带有嘲讽或冒犯。","计算机领域的“boid”源自 Craig Reynolds（1987）的群集模拟模型：通过“分离（避免碰撞）/对齐（方向一致）/聚合（靠近群体）”等简单规则，产生复杂的群体行为。"]}
{"word":"Boidae","summary":{"en":"Boidae is the scientific name for the boa family—mostly nonvenomous constrictor snakes such as boas and anacondas.","zh":"Boidae是“蟒科”的学名，指多为无毒、以缠绕绞杀为主的蛇类家族，如蚺与森蚺等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of mostly nonvenomous snakes (the boa family) that kill prey by squeezing (constricting) it; it includes boas and anacondas","zh":"蟒科（蛇类的一科，多为无毒蛇），常通过缠绕挤压（绞杀）猎物；包括森蚺和多种蚺类"},"examples":[{"en":"Anacondas belong to the family Boidae.","zh":"森蚺属于蟒科（Boidae）。"},{"en":"Many Boidae are powerful constrictors rather than venomous snakes.","zh":"许多蟒科蛇类依靠强力缠绕绞杀，而不是依靠毒液。"}]}],"synonyms":["boa family","boas (general)","constrictor snakes (general)"],"phonetic":"/ˈboʊ.ɪ.di/","extraExplanation":["“Boidae”是拉丁化的学名用法，常见于科普、动物学与自然纪录片中；日常英语里也常用更口语的说法：the boa family（“蚺/蟒这一类”）。","词源与命名：来自“boa”（蚺/蟒一类蛇的俗名）+ 科名常见后缀“-idae”（表示“……科”）。","分类提示：不同资料在分类上可能会有调整（例如某些传统上归入Boidae的类群在现代分类中可能被拆分/重新归类），但在一般科普语境中，“Boidae = boa family（含森蚺等）”的理解通常足够。"]}
{"word":"boidae","summary":{"en":"Boidae is the snake family that includes boas and anacondas, typically nonvenomous constrictors.","zh":"Boidae 指蟒科，包含蚺与森蚺等，通常为无毒、以缠绕勒杀为主的蛇类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of mostly nonvenomous snakes that kill prey by constriction, including boas and anacondas","zh":"（蛇类）蟒科：一类多为无毒、以缠绕勒杀猎物为主的蛇，包含蚺（boa）与森蚺（anaconda）等"},"examples":[{"en":"Boidae includes well-known snakes such as boas and anacondas.","zh":"蟒科包含一些很有名的蛇类，比如蚺和森蚺。"},{"en":"Many Boidae snakes overpower prey by constriction rather than venom.","zh":"许多蟒科蛇类是靠缠绕勒杀猎物，而不是靠毒液。"}]}],"synonyms":["boa family","boas (informal, not exact)"],"phonetic":"/ˈboʊ.aɪ.di/","extraExplanation":["“Boidae”是生物分类学中的拉丁化名称，常用于科普、动物学与学术写作中；日常英语里更常直接说“boa(s)”或“anaconda(s)”。","发音上常见读法为 /ˈboʊ.i.di/（美式），重音在第一个音节。"]}
{"word":"Boieldieu","summary":{"en":"Boieldieu is the name of a French composer famous for opéra comique, especially “La dame blanche.”","zh":"Boieldieu 指法国作曲家布瓦尔迪厄，以喜歌剧闻名，代表作是《白衣女郎》。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"François-Adrien Boieldieu (1775–1834), a French composer best known for comic operas (opéra comique), especially the opera “La dame blanche” (“The White Lady”).","zh":"弗朗索瓦-阿德里安·布瓦尔迪厄（1775–1834），法国作曲家，以喜歌剧（opéra comique）最为著名，代表作包括歌剧《白衣女郎》（La dame blanche）。"},"examples":[{"en":"Boieldieu’s opera “La dame blanche” was very popular in 19th-century Paris.","zh":"布瓦尔迪厄的歌剧《白衣女郎》在19世纪的巴黎非常受欢迎。"},{"en":"In music history class, we studied Boieldieu as an important figure in French opéra comique.","zh":"在音乐史课上，我们学习了布瓦尔迪厄，他是法国喜歌剧的重要人物。"}]}],"synonyms":["François-Adrien Boieldieu"],"phonetic":"/ˈbɔɪlˌdjuː/","extraExplanation":["“Boieldieu”是法语姓氏，英语里通常直接用作人名（专有名词）。在音乐语境中提到他，多半与法国“opéra comique（喜歌剧/对白歌剧）”传统有关：这种歌剧常包含唱段与对白（不一定都是“搞笑”，更像“带对白的歌剧”这一体裁名称）。","《La dame blanche（白衣女郎）》改编自苏格兰题材的故事，在19世纪影响很大，也体现了当时欧洲对“浪漫主义+民间传说/幽灵传说”题材的兴趣。"]}
{"word":"boiette","summary":{"en":"“boiette” is not a common English word; it is likely a surname or a nonstandard spelling.","zh":"“boiette”不是常见英语词；很可能是姓氏或非标准拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English vocabulary word; most often seen as a family name (surname) or a misspelling/variant spelling in names, usernames, or local terms.","zh":"不是标准英语词汇；更常见于姓氏（家族名）或作为名字、用户名、地方用语中的变体拼写/拼写错误。"},"examples":[{"en":"I couldn’t find “boiette” in an English dictionary; it may be a surname.","zh":"我在英语词典里找不到“boiette”；它可能是一个姓氏。"},{"en":"Is “Boiette” the spelling of a person’s last name in your text?","zh":"你文中的“Boiette”是某个人的姓氏拼写吗？"}]}],"phonetic":"/bɔɪˈɛt/","extraExplanation":["“boiette”很可能不是英语单词，而是：①姓氏（常见于人名/家谱/地名相关文本）；②来自法语的拼写变体或转写（例如某些法语词含有类似 -ette 的结尾）；③你想查的其实是一个拼写相近的英语词。","如果你告诉我它出现的句子或你想表达的意思（比如“一个小盒子/收纳盒”“某种物品/服装”“人名”），我可以帮你判断最可能的正确拼写，并给出对应词条与例句。","你也可以确认是否想查这些相近拼写：boîte（法语“盒子/箱子”）、boater（草帽/划船的人）、bootie/bootee（短靴/婴儿软靴）、bouquet（花束）。"]}
{"word":"boigid","summary":{"en":"“Boigid” isn’t a recognized English word; it’s probably a misspelling or a name.","zh":"“boigid”不是常见英语词；更可能是拼写错误或名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a name/handle.","zh":"不是标准英语单词，可能是拼写错误，或是人名/账号名。"},"examples":[{"en":"I can’t find “boigid” in major English dictionaries—did you mean “bogged” or “boiled”?","zh":"我在主要英语词典里找不到“boigid”——你是想写“bogged（陷入困境/被拖住）”还是“boiled（煮沸/煮熟）”？"}]}],"synonyms":["(no direct synonyms—please confirm the intended word)"],"extraExplanation":["“boigid”看起来像是键盘误触或拼写颠倒/缺字导致的形式。你可以告诉我：1）它出现的句子；2）你想表达的大概意思（例如“累坏了/卡住了/煮了”等）；3）是否来自人名、地名、游戏ID或某种缩写。我就能更准确地帮你确认正确单词并解释用法。"]}
{"word":"Boigie","summary":{"en":"“Boogie” usually means lively dance music (or the dance), or to dance energetically.","zh":"“boogie”通常指有强烈节奏的舞曲（或舞蹈），也可作动词表示尽情跳舞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lively style of dance music (and the dance) with a strong, swinging rhythm, often linked to blues or early rock","zh":"一种节奏强烈、带摇摆感的舞曲音乐（以及相应的舞蹈），常与布鲁斯或早期摇滚相关"},"examples":[{"en":"They played boogie music all night at the club.","zh":"俱乐部整晚都在放布吉舞曲。"},{"en":"He taught us a simple boogie step.","zh":"他教了我们一个简单的布吉舞步。"}]},{"partOfSpeech":"v.","definition":{"en":"to dance in a lively, energetic way (often to boogie music)","zh":"（常指随着布吉音乐）活力十足地跳舞"},"examples":[{"en":"Everyone boogied when the band started playing.","zh":"乐队一开演，大家就开始尽情跳舞。"},{"en":"Let’s boogie after dinner.","zh":"晚饭后我们去跳一会儿舞吧。"}]}],"synonyms":["dance","groove","jive"],"phonetic":"/ˈbuːɡi/","extraExplanation":["“Boigie”本身不是常见的标准拼写。你可能想查的是 **boogie**（/ˈbuːɡi/，布吉：音乐/舞蹈）。\n另外一个容易混淆的词是 **bogey**（/ˈboʊɡi/），意思可以是“高尔夫超过标准杆的一杆（柏忌）”或“可怕的东西/妖怪（英式较常见）”。如果你告诉我语境（句子或场景），我可以帮你确认到底是哪一个词。"]}
{"word":"boiguacu","summary":{"en":"Boiguacu means “big snake” in Brazilian (Tupi-based) usage, often referring to a giant snake in nature or folklore.","zh":"Boiguacu 在巴西（源自图皮语）中意为“巨蛇”，常指自然界或民俗传说中的大蛇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Brazil, from Tupi) a “big snake”; often used as a local/folkloric name for a giant snake (sometimes associated with an anaconda) or a mythical serpent.","zh":"（巴西用语，源自图皮语）“大蛇”；常用作巨蛇的地方/民俗称呼（有时指类似森蚺的巨蟒），也可指传说中的大蛇。"},"examples":[{"en":"In some Brazilian folk stories, the boiguacu is a huge snake that lives near rivers.","zh":"在一些巴西民间故事里，boiguacu 是住在河边的巨蛇。"},{"en":"The guide said locals sometimes call a very large snake “boiguacu.”","zh":"导游说，当地人有时会把特别大的蛇叫作 “boiguacu”。"}]}],"synonyms":["boi-guaçu","giant snake","mythic serpent"],"phonetic":"/ˌbɔɪɡwɑˈsu/","extraExplanation":["“boiguacu”常见写法也会写成“boi-guaçu / boi guaçu”。其中“boi”在图皮语系中可指“蛇”，而“guaçu (açu)”表示“大”。因此整体意思接近“巨蛇”。","它并不是标准英语词汇，更像是来自巴西原住民语言/葡语拼写的借词或专名；在不同地区可能指真实的大型蛇类，也可能指神话传说中的蛇形怪物。"]}
{"word":"Boii","summary":{"en":"“Boii” is informal internet slang for “boy!” used for emphasis or as a playful way to refer to a guy/friend.","zh":"“Boii” 是非正式网络俚语，相当于夸张的 “boy!”：可用来加强语气，也可轻松地指代男生/朋友。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(Internet slang) A playful or emphatic spelling of “boy!” used to address someone or react strongly (surprise, excitement, disbelief).","zh":"（网络俚语）“boy!” 的夸张/搞笑写法，用来称呼某人或表达强烈情绪（惊讶、兴奋、不敢相信等）。"},"examples":[{"en":"Boii, that game was harder than I expected.","zh":"Boii，那游戏比我想的难多了。"},{"en":"Boii, you scared me—don’t do that!","zh":"Boii，你吓到我了——别那样！"}]},{"partOfSpeech":"n.","definition":{"en":"(Internet slang) A casual way to refer to a guy or friend, similar to “boy/dude,” often for humor.","zh":"（网络俚语）随意指一个男生/朋友，类似 “boy / dude”，常带搞笑或轻松语气。"},"examples":[{"en":"That boii always shows up late, but we still like him.","zh":"那 boii 总是迟到，但我们还是喜欢他。"},{"en":"I’m hanging out with the bois/boiis tonight.","zh":"我今晚要跟兄弟们（bois/boiis）出去玩。"}]}],"synonyms":["boy","boi","dude","bro","guy"],"phonetic":"/bɔɪ/","extraExplanation":["“boii”常见于表情包、短视频和游戏聊天，属于非正式拼写：用双写元音/字母来拉长语气，表示更强的情绪或更搞怪的风格。","写作时注意场合：适合朋友间、社媒或聊天；不适合正式邮件、作业或职场沟通。"]}
{"word":"boii","summary":{"en":"“boii” is an informal internet spelling of “boy,” often used playfully as a noun or as an exclamation for emphasis.","zh":"“boii”是“boy”的非正式网络拼写，常用作戏谑称呼或感叹词，用来加强语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Internet slang) A playful spelling of “boy,” used to refer to a boy/man or to address someone in a joking, casual way. Often written “boi” or stretched as “boii/boiii” for extra emphasis.","zh":"（网络俚语）“boy”的戏谑拼写，用来指代男孩/男人，或以开玩笑、随意的语气称呼某人。常写作“boi”，拉长成“boii/boiii”表示更强的语气。"},"examples":[{"en":"Boii, you scared me—don’t do that again.","zh":"兄弟/你这家伙，你吓到我了——别再这样了。"},{"en":"That boii can really dance.","zh":"那小子/那家伙真的很会跳舞。"}]},{"partOfSpeech":"int.","definition":{"en":"Used as an exclamation to show surprise, excitement, or emphasis (similar to “dude!” or “yo!”).","zh":"作感叹用，表示惊讶、兴奋或强调（类似“哥们儿！”“哟！”）。"},"examples":[{"en":"Boiii, that was close!","zh":"哎哟，太险了！"},{"en":"Boii, this food is amazing.","zh":"哇，这吃的太好吃了。"}]}],"synonyms":["boy","boi","dude","bro","yo"],"phonetic":"/bɔɪ/","extraExplanation":["“boi/boii”常见于社交媒体、梗图与口语化聊天。拼写拉长（boii/boiii）通常表示语气更强：更惊讶、更激动、或更吐槽。","它在不同社群里语感可能不同：有时偏搞笑、撒娇或夸张；也可能带一点调侃。对不熟的人使用时，注意场合与关系，避免显得不礼貌。"]}
{"word":"Boiko","summary":{"en":"Boiko is usually a Slavic surname; it can also refer to the Boyko people of western Ukraine (often spelled Boyko).","zh":"Boiko 通常是斯拉夫姓氏；也可指乌克兰西部的博伊科人（英语常拼作 Boyko）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname, especially in Ukrainian and other Slavic contexts (a family name).","zh":"姓氏（尤其见于乌克兰及其他斯拉夫语境中的家族姓）。"},"examples":[{"en":"Mr. Boiko lives in Toronto now, but his family is originally from Ukraine.","zh":"博伊科先生现在住在多伦多，但他的家族最初来自乌克兰。"},{"en":"I saw the name Boiko on the author list of the research paper.","zh":"我在那篇论文的作者名单里看到了 Boiko 这个名字。"}]},{"partOfSpeech":"n.","definition":{"en":"(often spelled Boyko) a member of the Boyko people, an ethnographic group from the Carpathian region of western Ukraine.","zh":"（常拼作 Boyko）博伊科人：乌克兰西部喀尔巴阡地区的一个民族志群体成员。"},"examples":[{"en":"Her grandparents identify as Boyko (Boiko) from the Carpathians.","zh":"她的祖父母自认为是来自喀尔巴阡山区的博伊科人（Boyko/Boiko）。"},{"en":"The museum exhibit includes traditional Boyko (Boiko) clothing and wooden churches.","zh":"博物馆展览包括博伊科人的传统服饰和木制教堂。"}]}],"synonyms":["Boyko","Boykos"],"phonetic":"/ˈbɔɪkoʊ/","extraExplanation":["“Boiko”在英文里更常见于姓名（姓）。如果你指的是民族/族群，英语里更常见的拼法是“Boyko”。","发音会因地区与个人而变化；在英语环境中通常按拼写读作“BOY-koh”。"]}
{"word":"boiko","summary":{"en":"Boyko (also spelled Boiko) refers to an ethnographic group of Ukrainians from the Carpathian region, and it can also mean “related to their culture or dialect.”","zh":"Boyko（也拼作 Boiko）指喀尔巴阡地区的乌克兰民族志群体“博伊科人”，也可作形容词表示与其文化或方言相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Boyko people, an ethnographic group of Ukrainians traditionally living in the Carpathian Mountains (especially in western Ukraine).","zh":"博伊科人：乌克兰人的一个民族志群体，传统上居住在喀尔巴阡山脉地区（尤指乌克兰西部）。"},"examples":[{"en":"The museum has exhibits about the Boyko and other Carpathian highlander groups.","zh":"这家博物馆有关于博伊科人以及其他喀尔巴阡山地群体的展览。"},{"en":"Boyko wooden churches are known for their distinctive layered roofs.","zh":"博伊科人的木制教堂以其独特的层叠屋顶而闻名。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Boyko people, their culture, dialect, or traditional style.","zh":"博伊科人的；与博伊科文化、方言或传统风格有关的。"},"examples":[{"en":"She is researching Boyko folk songs and storytelling.","zh":"她正在研究博伊科民歌和口述故事。"},{"en":"The village hosts a Boyko cultural festival every summer.","zh":"这个村庄每年夏天都会举办博伊科文化节。"}]}],"synonyms":["Boyko"],"phonetic":"/ˈbɔɪkoʊ/","extraExplanation":["“Boyko/Boiko（博伊科）”在英语里多见于历史、人类学、民俗学语境，也常作为姓氏（尤其在乌克兰及其侨民中）。","该群体属于乌克兰喀尔巴阡山区的“高地人（highlanders）”文化圈之一，常与 Lemko（莱姆科）和 Hutsul（胡楚尔）并列提及。"]}
{"word":"boil","summary":{"en":"Boil means to heat a liquid until it bubbles strongly, to cook food in boiling water, or (figuratively) to become intensely angry/excited.","zh":"boil 指把液体加热到沸腾、用沸水煮食物，也可比喻情绪或局势变得非常激烈、接近爆发。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to heat a liquid until it reaches the boiling point and bubbles strongly (about 100°C/212°F for water)","zh":"把液体加热到沸点并剧烈冒泡（如水约100°C/212°F）"},"examples":[{"en":"Boil the water before you add the noodles.","zh":"先把水煮开，再下面条。"},{"en":"The soup is boiling—turn the heat down.","zh":"汤在沸腾——把火调小一点。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cook food in boiling water","zh":"用沸水煮（食物）"},"examples":[{"en":"She boiled eggs for breakfast.","zh":"她早餐煮了鸡蛋。"},{"en":"Boil the potatoes until they are soft.","zh":"把土豆煮到变软为止。"}]},{"partOfSpeech":"v.","definition":{"en":"(of emotions or situations) to become very angry or excited; to be close to an outbreak","zh":"（情绪或局势）激化、变得非常愤怒或紧张；一触即发"},"examples":[{"en":"He was boiling with anger after the meeting.","zh":"开完会后他气得冒火。"},{"en":"Tensions are boiling over in the neighborhood.","zh":"社区里的紧张情绪正在爆发。"}]},{"partOfSpeech":"n.","definition":{"en":"a period or the act of boiling; the state of bubbling heat","zh":"沸腾；煮沸的过程（或状态）"},"examples":[{"en":"Bring the kettle to a boil.","zh":"把水壶里的水烧开。"},{"en":"Keep it at a gentle boil for five minutes.","zh":"用小火保持微沸五分钟。"}]}],"synonyms":["cook","simmer (gentle boil)","seethe (figurative)"],"phonetic":"/bɔɪl/","extraExplanation":["常见搭配：bring (water) to a boil（把水烧开）；boil over（沸腾溢出；情绪/局势“爆发”）；boil down to...（归结为……）；at a rolling boil（剧烈沸腾）。","区分：boil（沸腾） vs. simmer（微沸，小火咕嘟）；做菜时常说“simmer for 20 minutes（小火炖/煨20分钟）”。","文化用法：英语里常用“boiling”来形容强烈情绪，如 boiling mad（非常生气）、boiling with rage（怒火中烧），语气通常比“angry”更强。"]}
{"word":"boil down","summary":{"en":"to simplify to the essential point; to be the main issue","zh":"把内容提炼到要点；归根结底是关键因素"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"To reduce something to a simpler or shorter form by focusing on the main points; to summarize.","zh":"把（内容）浓缩成更简单或更短的形式；概括要点。"},"examples":[{"en":"Can you boil down this article into three key points?","zh":"你能把这篇文章浓缩成三个关键点吗？"},{"en":"The report boils down to one message: costs are rising.","zh":"这份报告归结起来就是一句话：成本在上升。"}]},{"partOfSpeech":"phrase","definition":{"en":"To be the essential reason or main issue; to come down to something basic.","zh":"归根结底是；本质上取决于（某个关键因素）。"},"examples":[{"en":"It all boils down to trust.","zh":"归根结底就是信任。"},{"en":"Choosing a school often boils down to location and budget.","zh":"选学校往往归结为地点和预算。"}]},{"partOfSpeech":"phrase","definition":{"en":"To make a liquid cook away until it becomes thicker or more concentrated.","zh":"（把液体）煮到水分减少，从而变稠或更浓。"},"examples":[{"en":"Boil down the sauce for five minutes to thicken it.","zh":"把酱汁再煮五分钟，让它变稠。"},{"en":"The soup needs to boil down a bit before serving.","zh":"这汤上桌前还需要再收一会儿。"}]}],"synonyms":["summarize","condense","simplify","reduce","distill","come down to","amount to"],"phonetic":"/bɔɪl daʊn/","extraExplanation":["常见结构：boil down to + 名词/动名词（It boils down to… / It all boils down to…）。","语气较口语也可用于正式写作，表示“最终原因/核心点”。","与“sum up”相比更强调“提炼到本质”；与“reduce”相比更口语、更形象。"],"etymology":"来自字面意思“把液体煮到减少（boil + down）”。后来引申为“把信息/问题浓缩到核心”，常用于写作、会议和决策语境。","mnemonic":["把“down”理解成“往下收、往下压”：把一锅汤“收汁”→内容也“收成精华”。","联想中文“浓缩/提炼/归根结底”：都是把东西变少但更“精”。"]}
{"word":"boil down A to B","summary":{"en":"reduce to essentials; be essentially about one main point","zh":"提炼成要点；归结为关键点"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to reduce something to a simpler, shorter, or more essential form (often from many details to a few key points)","zh":"把……提炼/简化成更短、更核心的内容（常指从很多细节缩减为关键点）"},"examples":[{"en":"Can you boil down the report to three bullet points?","zh":"你能把这份报告提炼成三条要点吗？"},{"en":"She boiled down the lecture notes to one page for revision.","zh":"她把课堂笔记浓缩成一页用来复习。"},{"en":"Let’s boil down our plan to two steps: prepare and execute.","zh":"我们把计划简化成两步：准备和执行。"}]},{"partOfSpeech":"phrase","definition":{"en":"to show that a situation or problem is essentially the same as, or can be understood as, one main thing (the real point)","zh":"归根结底就是……；本质上等同于（一个关键点/原因）"},"examples":[{"en":"It boils down to trust.","zh":"归根结底就是信任。"},{"en":"The disagreement boiled down to money and time.","zh":"这场分歧本质上就是钱和时间的问题。"},{"en":"What it boils down to is whether we’re willing to change.","zh":"说到底就是我们是否愿意改变。"}]}],"synonyms":["condense","summarize","simplify","reduce","distill","pare down","boil down to","come down to","amount to"],"phonetic":"/bɔɪl daʊn/","extraExplanation":["常见结构：\n1) boil down A to B（把A提炼成B）\n2) boil down to + 名词/从句（归结为……）\n口语和写作都很常用，语气中性。"],"etymology":"来自烹饪：把液体“煮沸并继续加热”让水分蒸发，最后“浓缩/剩下精华”。后来引申为“把信息或问题浓缩到核心”。","mnemonic":["联想做汤：一直“boil”到最后只剩“down（变少、变浓）”，也就是“浓缩出精华”。","把 down 想成“往下压缩”：信息被“压下去”只留下核心。"]}
{"word":"boil down to","summary":{"en":"to summarize into essentials; to be essentially about one main point","zh":"提炼成要点；归根结底是某个核心点"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to reduce something to its most important parts; to summarize by removing details","zh":"把（内容）提炼到最关键的部分；概括、浓缩（去掉细节）"},"examples":[{"en":"Can you boil the report down to three key points?","zh":"你能把这份报告提炼成三个要点吗？"},{"en":"We boiled the instructions down to a simple checklist.","zh":"我们把说明浓缩成一份简单的清单。"}]},{"partOfSpeech":"phrase","definition":{"en":"to be essentially about something; to come down to one main cause or fact","zh":"归根结底是；本质上取决于（某个原因或事实）"},"examples":[{"en":"In the end, it boils down to trust.","zh":"说到底，这归根结底是信任问题。"},{"en":"Success often boils down to preparation and consistency.","zh":"成功往往归结为准备和坚持。"},{"en":"It boils down to whether we have enough time.","zh":"归根结底取决于我们有没有足够的时间。"}]}],"synonyms":["reduce to","sum up","condense","distill","come down to","amount to","be about","hinge on"],"phonetic":"/bɔɪl daʊn tu/","extraExplanation":["常见搭配：boil something down to + 名词/短语（把……浓缩为……）；boil down to + 名词/从句（归根结底是……/取决于……）。","语气通常中性，常用于讨论、写作、会议总结，把复杂问题说得更清楚。"],"etymology":"源自烹饪意象：把液体“煮沸并收汁”，水分蒸发后剩下更浓缩的部分；比喻把信息或原因“浓缩到核心”。","mnemonic":["联想“煮汤收汁”：水分（细节）蒸发掉，锅里留下“精华（核心）”，所以就是“提炼/归结为”。","把 down 理解为“往下压缩”：把内容压缩到最底层的核心点。"]}
{"word":"boil down to sth.","summary":{"en":"reduce something to its essential point","zh":"把……归结为要点；精炼概括"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to reduce something to its most important or basic points; to summarize","zh":"把……归结为最重要/最基本的要点；概括"},"examples":[{"en":"His advice boils down to one thing: practice every day.","zh":"他的建议归结为一点：每天练习。"},{"en":"The argument boils down to whether we can afford it.","zh":"争论归结为我们是否负担得起。"},{"en":"Boil your presentation down to three key messages.","zh":"把你的演讲内容概括为三个关键信息。"}]},{"partOfSpeech":"phrase","definition":{"en":"(cooking) to make a liquid reduce by boiling so it becomes thicker or more concentrated","zh":"（烹饪）通过煮沸把液体熬浓/收汁"},"examples":[{"en":"Boil the sauce down to half its original volume.","zh":"把酱汁收至原来的一半。"},{"en":"Let the soup boil down until it thickens.","zh":"让汤煮到变浓为止。"}]}],"synonyms":["amount to","come down to","reduce to","sum up","condense","distill"],"phonetic":"/bɔɪl daʊn tu/","extraExplanation":["常见结构：boil down to + 名词/从句，表示“归根结底是……”。例如：It boils down to money/time/trust.","也可用于祈使句：Boil it down. / Boil it down to one sentence. 表示“再精简一点”。","语气偏口语但也常见于写作与职场表达，强调“核心原因/本质”。"],"etymology":"来自烹饪用法：把液体“煮到变少、变浓”（boil down）。后来引申为把信息“提炼、浓缩”到核心要点。","mnemonic":["联想“熬汤收汁”：越煮越少、味道越浓——信息也能“收汁”，只剩精华。","把“down”理解为“减少/变少”，boil down=煮到变少→引申为内容变精简。"]}
{"word":"boil over","summary":{"en":"spill out while boiling; suddenly burst out (of emotions or conflict)","zh":"沸腾溢出；（情绪/矛盾）突然爆发"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Of a liquid in a pot) to rise and spill out because it is boiling too strongly.","zh":"（锅里的液体）沸腾得太厉害而溢出（漫出来）。"},"examples":[{"en":"The milk boiled over and made a mess on the stove.","zh":"牛奶煮沸溢出来，把炉子弄得一团糟。"},{"en":"Turn the heat down so the soup doesn’t boil over.","zh":"把火调小一点，免得汤溢出来。"}]},{"partOfSpeech":"phrase","definition":{"en":"(Of emotions or conflict) to suddenly become uncontrollable or show openly.","zh":"（情绪或矛盾）突然失控；爆发；公开显露。"},"examples":[{"en":"His anger boiled over when he heard the news.","zh":"他听到这个消息后，怒火一下子爆发了。"},{"en":"Tensions boiled over into a shouting match.","zh":"紧张情绪升级，最后演变成一场争吵。"}]}],"synonyms":["overflow","spill over","bubble over","erupt","burst out","flare up"],"phonetic":"/bɔɪl ˈoʊvɚ/","extraExplanation":["常见搭配：boil over with anger/resentment（怒火/怨气翻涌）。","对比：boil down to 表示“归结为”；boil up 更偏“逐渐冒起/涌现（情绪、麻烦）”。"],"etymology":"来自字面意思“煮到沸腾并溢出”。后来引申为情绪像沸水一样“翻涌到溢出来”，表示突然爆发。","mnemonic":["把它想成“水开了(over)就溢出来”：既能记住“锅里溢出”，也能联想到“情绪溢出＝爆发”。","over 有“越过、溢出”的感觉：boil + over → 煮到越界。"]}
{"word":"boil up","summary":{"en":"to start boiling; or to surge up suddenly (especially emotions).","zh":"开始沸腾；（尤指情绪）突然涌起、爆发。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Of a liquid) to begin to boil; to heat something until it starts boiling.","zh":"（液体）开始沸腾；把……加热到沸腾。"},"examples":[{"en":"Bring the soup to a boil, then let it boil up for one minute.","zh":"把汤煮开，然后让它再沸腾一分钟。"},{"en":"When the water boils up, turn the heat down.","zh":"水一沸腾就把火调小。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Of feelings or trouble) to rise strongly and suddenly, often in an uncontrollable way.","zh":"（情绪或问题）突然涌起、爆发（常带有难以控制的感觉）。"},"examples":[{"en":"Anger boiled up in him when he heard the unfair decision.","zh":"听到那个不公平的决定，他的怒火一下子涌了上来。"},{"en":"Old memories can boil up when you go back to your hometown.","zh":"回到家乡时，旧回忆可能会一下子涌上心头。"}]},{"partOfSpeech":"vt.","definition":{"en":"To cause strong feelings or conflict to rise; to stir up.","zh":"使（情绪/矛盾）激化、被挑起；煽动。"},"examples":[{"en":"The rumor boiled up fear in the community.","zh":"那条谣言在社区里煽起了恐慌。"},{"en":"Don’t boil up drama over a small misunderstanding.","zh":"别为一点小误会就把矛盾闹大。"}]}],"synonyms":["boil","come to a boil","bubble up","flare up","well up","surge","rise","stir up"],"phonetic":"/ˈbɔɪl ʌp/","extraExplanation":["boil up 常用于比喻情绪：像水开时气泡往上冲一样，愤怒、焦虑、回忆等“往上翻”。","和 bring (something) to a boil（把……煮开）相比，boil up 更强调“开始翻滚/突然涌起”的感觉，语气更形象。"],"etymology":"源自基础动词 boil（沸腾，来自拉丁语 bullire“冒泡、沸腾”）。up 在短语动词里常表示“向上、涌起、增强”，所以 boil up 既可指液体“沸起来”，也可比喻情绪“翻涌上来”。","mnemonic":["想象“水开了泡泡往上(up)冒”：液体 boil up；情绪也像泡泡一样往上涌。","联想中文“火气上来了/怒火上涌”：= anger boils up。"]}
{"word":"boil water","summary":{"en":"heat water until it bubbles at the boiling point","zh":"把水加热到沸腾"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to heat water until it reaches the boiling point and bubbles strongly (about 100°C / 212°F at sea level)","zh":"把水加热到沸点并剧烈冒泡（海平面约100°C/212°F）"},"examples":[{"en":"Boil water before you drink it if the tap water isn’t safe.","zh":"如果自来水不安全，喝之前要把水烧开。"},{"en":"She boiled water for tea.","zh":"她烧水泡茶。"},{"en":"Bring the water to a boil, then turn down the heat.","zh":"先把水煮开，然后把火调小。"}]},{"partOfSpeech":"phrase","definition":{"en":"(cooking) to cook food in boiling water","zh":"（烹饪）用沸水把食物煮熟"},"examples":[{"en":"Boil water and add the noodles.","zh":"把水煮开，然后下面条。"},{"en":"We need to boil water for the eggs.","zh":"我们需要烧水煮鸡蛋。"}]}],"synonyms":["bring water to a boil","heat water","boil some water","bring to the boil"],"phonetic":"/bɔɪl ˈwɔtɚ/","extraExplanation":["口语里常说 “boil some water / boil the water”。“boil water”更像动作或步骤标题（例如菜谱里的一步）。","常见替换表达：\"bring water to a boil\"（把水烧开，偏步骤/说明书用语）；\"heat water\" 只是加热，不一定烧开。"],"etymology":"“boil”源自中古英语，来自古法语 “boillir”，再追溯到拉丁语 “bullire”（意为“冒泡、沸腾”）。因此 “boil water” 字面就是“让水冒泡沸腾”。","mnemonic":["把 boil 想成 “bubble（气泡）” 的感觉：水一沸腾就全是泡泡。","联想中文“煮/烧开”：看到 boil 就想到“把水煮到冒泡”。"]}
{"word":"boil-covered","summary":{"en":"Boil-covered means ‘covered with boils’—many painful infected bumps on the skin.","zh":"boil-covered 指“布满疖子/疮”，强调皮肤上有许多感染导致的疼痛脓包。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with boils (painful, swollen spots on the skin caused by infection).","zh":"布满疖子（皮肤上因感染而产生的疼痛、肿胀的脓包）。"},"examples":[{"en":"The stray dog was thin and boil-covered, so the volunteers took it to a vet.","zh":"那只流浪狗很瘦，身上布满疖子，所以志愿者把它送去看兽医。"},{"en":"In the novel, the villain is described as boil-covered to show how sick and neglected he is.","zh":"在小说里，反派被描写为“满身疖子”，用来表现他的病态与被忽视。"}]}],"synonyms":["covered in boils","covered with boils","boil-ridden","pustule-covered"],"phonetic":"/ˈbɔɪl ˌkʌvɚd/","extraExplanation":["“boil”在这里不是“煮沸”，而是名词“疖子/疮”。因此“boil-covered”是由名词 + 过去分词构成的复合形容词，表示“被……覆盖/布满……”。","这种表达多见于描写性、文学性或较强烈的叙述语境（如小说、新闻、医学/动物救助描述）；日常口语里更常说“covered in boils”或“covered with boils”。"]}
{"word":"boil-like","summary":{"en":"“Boil-like” means looking like a skin boil—a swollen, painful bump.","zh":"“boil-like”表示外观看起来像疖子一样的红肿疼痛突起。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a boil (a painful, swollen, pus-filled bump on the skin); having the appearance of a boil.","zh":"像疖子一样的；外观类似疖子（皮肤上疼痛、红肿、可能有脓的突起）。"},"examples":[{"en":"He showed the doctor a boil-like lump on his neck.","zh":"他给医生看了他脖子上一个像疖子一样的肿块。"},{"en":"The rash formed several boil-like bumps that became tender.","zh":"皮疹形成了几个像疖子一样的疙瘩，后来变得很疼。"}]}],"synonyms":["boil-shaped","pustule-like","blister-like","pimple-like"],"phonetic":"/ˈbɔɪlˌlaɪk/","extraExplanation":["“boil-like”通常用于医学或日常描述皮肤外观，并不等于真正的“boil（疖子）”。真正的疖子多与毛囊感染有关；如果出现红肿、疼痛、发热或持续变大，应考虑就医。","注意不要与动词“boil（煮沸）”混淆：这里的boil是名词，指皮肤上的“疖子/疮”。"]}
{"word":"boil-related","summary":{"en":"“Boil-related” means connected with boiling (water/cooking) or, less commonly, connected with a skin boil.","zh":"“boil-related”表示与煮沸/烧开（多见于水与烹饪）有关；较少见时也可指与皮肤疖子有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with boiling (heating a liquid until it bubbles) or with the effects of boiling, such as safety, time, or cooking steps.","zh":"与“煮沸”（把液体加热到冒泡）或煮沸带来的影响有关的，如安全、时间或烹饪步骤等。"},"examples":[{"en":"Follow the boil-related safety rules when using a large pot of water.","zh":"用大锅烧水时要遵守与煮沸相关的安全规则。"},{"en":"The recipe includes several boil-related steps, like timing and temperature control.","zh":"这个食谱包含几个与煮沸相关的步骤，比如计时和控温。"}]},{"partOfSpeech":"adj.","definition":{"en":"connected with a boil (a painful skin infection or swelling).","zh":"与“疖子/疮”（皮肤上的疼痛性感染或肿块）有关的。"},"examples":[{"en":"See a doctor if you have boil-related pain, fever, or spreading redness.","zh":"如果你有与疖子相关的疼痛、发烧或红肿扩散，请就医。"},{"en":"He missed work because of a boil-related infection on his leg.","zh":"他因为腿上与疖子相关的感染而没去上班。"}]}],"synonyms":["boiling-related","boiling-associated","boil-associated","related to boiling","associated with boiling"],"phonetic":"/ˈbɔɪl rɪˌleɪtɪd/","extraExplanation":["“boil-related”是由名词/动词“boil”加“related”构成的复合形容词，常用连字符表示它作为一个整体来修饰后面的名词（如：boil-related steps / boil-related issues）。在正式写作中，若放在名词前更常加连字符；若放在系动词后作表语，有时可写作“related to boiling / related to a boil”以避免歧义。"]}
{"word":"boilable","summary":{"en":"“Boilable” means something can be boiled, often for cooking or sterilizing.","zh":"“boilable”表示某物“可以煮（煮沸）”，常用于烹饪或消毒。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be boiled (heated in boiling water), usually to cook it or to make it safe/sterile.","zh":"可煮的；可用沸水煮（来烹饪或消毒）的。"},"examples":[{"en":"These noodles are boilable in just three minutes.","zh":"这些面条三分钟就能煮熟。"},{"en":"Make sure the bottle is boilable before you sterilize it in hot water.","zh":"在用热水消毒之前，要确认这个奶瓶是可以煮的。"}]}],"synonyms":["can be boiled","suitable for boiling","boiling-safe"],"phonetic":"/ˈbɔɪləbəl/","extraExplanation":["“boilable”由动词 boil（煮沸、煮）+ 形容词后缀 -able（能够……的）构成，意思是“能够被……的”。日常英语里更常见的说法是“can be boiled”或在食品上写“boil for X minutes”。如果用于材质/用品（如婴儿奶瓶、医用器具），也常搭配“sterilize by boiling（通过煮沸消毒）”。"]}
{"word":"boildown","summary":{"en":"“Boil down” means to simplify or summarize, or (boil down to) to be essentially about one main thing.","zh":"“boil down”表示“提炼、概括”，也可用“boil down to”表示“归根结底是……”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to reduce something to its most important points; to simplify or summarize","zh":"把（内容）浓缩成要点；简化；概括"},"examples":[{"en":"Can you boil this report down to three key points?","zh":"你能把这份报告浓缩成三个要点吗？"},{"en":"We boiled the instructions down so everyone could follow them.","zh":"我们把说明简化了，这样大家都能照着做。"}]},{"partOfSpeech":"vi.","definition":{"en":"(boil down to) to have one main or essential meaning or reason","zh":"（boil down to）归根结底是；本质上是"},"examples":[{"en":"It all boils down to trust.","zh":"归根结底就是信任。"},{"en":"The problem boils down to a lack of communication.","zh":"问题本质上是沟通不足。"}]}],"synonyms":["summarize","condense","simplify","reduce","come down to"],"phonetic":"/bɔɪl daʊn/","extraExplanation":["“boil down”原意是把液体继续煮，让水分蒸发、味道更浓；因此引申为“把信息/想法提炼成精华”。","常见结构：boil something down (to sth)（可接宾语，如 boil the report down）；以及 it boils down to…（主语常用 it，表示“说到底是……”）。"]}
{"word":"Boileau","summary":{"en":"Boileau usually refers to the French poet and critic Nicolas Boileau-Despréaux, a major influence on French Neoclassicism; it can also be a surname.","zh":"Boileau 通常指法国诗人兼文学批评家尼古拉·布瓦洛-德普雷奥（法国新古典主义的重要影响者）；也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Nicolas Boileau-Despréaux (1636–1711), a French poet and literary critic known for promoting clear, rule-based classical writing and for influencing French Neoclassicism.","zh":"尼古拉·布瓦洛-德普雷奥（1636–1711），法国诗人兼文学批评家，以提倡清晰、遵循古典规范的写作而闻名，对法国新古典主义影响很大。"},"examples":[{"en":"In many literature courses, Boileau is discussed as a key voice of French Neoclassicism.","zh":"在许多文学课程中，布瓦洛常被作为法国新古典主义的重要代表来讨论。"},{"en":"Boileau argued that good writing should be clear, balanced, and disciplined.","zh":"布瓦洛主张好的写作应当清晰、均衡且有节制。"}]},{"partOfSpeech":"n.","definition":{"en":"A French surname; also used as a family name in other places.","zh":"法语姓氏；在其他地区也可作为家族姓氏使用。"},"examples":[{"en":"Her last name is Boileau, so people often ask if she has French roots.","zh":"她的姓是 Boileau，所以人们常会问她是否有法国血统。"}]}],"synonyms":["Nicolas Boileau-Despréaux","Boileau-Despréaux"],"phonetic":"/ˈbwɑːloʊ/","extraExplanation":["“Boileau”在英语语境里多指这位作家本人；他的代表性批评作品常被提到的是《诗艺》（L’Art poétique），强调写作的理性、规范与表达的准确。","英语里这个名字的读法会因地区与习惯略有不同；在课堂或学术讨论中，通常按英语习惯读即可。"]}
{"word":"boiled","summary":{"en":"“Boiled” usually means cooked in boiling liquid (like boiled eggs) or water/liquid that has been heated until it boils; it’s also the past form of “boil.”","zh":"“boiled”通常表示“水煮的/煮熟的”，也可指“煮沸过的（水）”，同时还是“boil”的过去式和过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Cooked in boiling water or another liquid until done.","zh":"用沸水或其他液体煮熟的。"},"examples":[{"en":"I had boiled eggs for breakfast.","zh":"我早餐吃了水煮蛋。"},{"en":"Boiled potatoes are common in many home-style meals.","zh":"水煮土豆在很多家常菜里很常见。"}]},{"partOfSpeech":"adj.","definition":{"en":"Heated until it reaches the boiling point; made to boil.","zh":"加热到沸点的；煮沸过的。"},"examples":[{"en":"Use boiled water if the tap water isn’t safe to drink.","zh":"如果自来水不适合直接饮用，就用煮沸过的水。"},{"en":"Let the boiled milk cool before adding it to the mixture.","zh":"把煮沸过的牛奶先放凉，再加入混合物。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense and past participle of “boil” (to cook in boiling liquid or to heat until bubbling).","zh":"“boil”的过去式和过去分词（用沸水煮；加热至沸腾）。"},"examples":[{"en":"She boiled the noodles for eight minutes.","zh":"她把面条煮了八分钟。"},{"en":"The soup has boiled for too long and tastes salty now.","zh":"汤煮太久了，现在尝起来有点咸。"}]}],"synonyms":["cooked (in water)","simmered (often gentler, not always boiling)","parboiled (partly boiled)"],"phonetic":"/bɔɪld/","extraExplanation":["在食物语境中，boiled 常常表示“水煮/白煮”，强调用水（或清汤）直接煮，味道比较清淡；与 fried（油炸/煎）、roasted（烤）、steamed（蒸）形成对比。","常见搭配：boiled egg(s)（水煮蛋）、boiled water（开水/煮沸过的水）、hard-boiled / soft-boiled（全熟/半熟水煮蛋）。"]}
{"word":"boiled dumpling","summary":{"en":"Dumplings cooked in boiling water.","zh":"用开水煮熟的饺子。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A dumpling cooked in boiling water until the wrapper and filling are cooked through.","zh":"用沸水煮熟的饺子（皮和馅都煮透）。"},"examples":[{"en":"For Lunar New Year, many families eat boiled dumplings for good luck.","zh":"春节时，很多家庭会吃水煮饺子，寓意吉利。"},{"en":"Boiled dumplings are usually served with vinegar, soy sauce, or chili oil.","zh":"水煮饺子常配醋、酱油或辣椒油一起吃。"},{"en":"Don’t overcrowd the pot, or the boiled dumplings may stick together.","zh":"锅里别下太多，不然煮饺子容易粘在一起。"}]}],"synonyms":["water-boiled dumplings","boiled jiaozi","jiaozi"],"phonetic":"/bɔɪld ˈdʌmplɪŋ/","extraExplanation":["在中式语境里，“boiled dumpling”通常对应“水饺”（水煮的饺子）。与之常见对比：\"pan-fried dumpling\"（煎饺/锅贴），“steamed dumpling”（蒸饺）。","在西方语境中，“dumpling”也可能指不包馅的面团（例如汤里的小面团），所以如果你想明确是中式饺子，可以说 “boiled jiaozi” 或 “boiled Chinese dumplings”。"],"etymology":"“Dumpling”最早在英语里指小块面团或包馅的面食（词源与“dump（丢下、扔下）”有关，像把面团“团”进锅里）。 “Boiled”表示烹饪方式：用水煮熟。","mnemonic":["联想：boil = 水开冒泡；boiled dumpling = “在开水里冒泡的饺子”→ 水饺。","把它拆开记：boiled（煮的）+ dumpling（饺子/面团团）= 煮饺子。"]}
{"word":"boiled egg","summary":{"en":"an egg cooked in boiling water","zh":"用沸水煮熟的鸡蛋；水煮蛋"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An egg cooked in its shell in boiling water until the white (and sometimes the yolk) becomes firm.","zh":"（连壳）用沸水煮熟的鸡蛋；水煮蛋。"},"examples":[{"en":"I usually have a boiled egg for breakfast.","zh":"我早餐通常会吃一个水煮蛋。"},{"en":"She peeled a boiled egg and sprinkled a little salt on it.","zh":"她剥了一个水煮蛋，撒了点盐。"},{"en":"For the salad, add two sliced boiled eggs.","zh":"做沙拉时，加入两颗切片的水煮蛋。"}]},{"partOfSpeech":"vt.","definition":{"en":"Cook (an egg) in boiling water, usually in its shell.","zh":"把（鸡蛋）用沸水煮（通常带壳）。"},"examples":[{"en":"Boil two eggs for about eight minutes.","zh":"把两个鸡蛋煮大约八分钟。"},{"en":"He boiled an egg and made a quick sandwich.","zh":"他煮了个鸡蛋，做了个简易三明治。"}]}],"synonyms":["hard-boiled egg","soft-boiled egg"],"phonetic":"/ˌbɔɪld ˈɛɡ/","extraExplanation":["口感与时间有关：soft-boiled（溏心/半熟）通常煮约6分钟；hard-boiled（全熟）通常煮约10–12分钟（时间会因蛋大小和火力略有变化）。","常见搭配：boiled egg with salt（加盐的水煮蛋）；boiled egg and soldiers（英式吃法：溏心蛋配条状烤面包蘸着吃）。"],"etymology":"“boiled”来自古英语，意为“用热水/沸水烹煮”；“egg”来自古英语“æg”。合起来就是“煮过的蛋”。","mnemonic":["boil≈“煮”；egg=“蛋”，合起来就是“煮蛋”。","记搭配：hard-boiled=硬（全熟）+煮；soft-boiled=软（溏心）+煮。"]}
{"word":"boiled water","summary":{"en":"water that has been boiled","zh":"煮沸过的水；开水"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Water that has been heated until it boils (or has just finished boiling), often used for drinking or sterilizing.","zh":"煮沸过的水（或刚煮开不久的水），常用于饮用或消毒。"},"examples":[{"en":"Let the boiled water cool before you drink it.","zh":"喝之前先让开水凉一凉。"},{"en":"Use boiled water to clean the baby bottle if you don’t have a sterilizer.","zh":"如果没有消毒器，可以用煮沸过的水清洗/消毒婴儿奶瓶。"},{"en":"She made tea with boiled water from the kettle.","zh":"她用水壶里煮开的水泡茶。"}]}],"synonyms":["boiling water","hot water","heated water"],"phonetic":"/bɔɪld ˈwɔtər/","extraExplanation":["常见区别：boiled water 强调“已经煮过”的结果；boiling water 强调“正在沸腾、很烫”的状态。例如：Be careful—this is boiling water!（小心，这是正在沸腾的水！）","文化语境：在一些英语语境中，人们更常说 hot water（热水）或 boiled water for drinking（用于饮用的开水）。在中国“喝开水”很常见，英文里可以说 drink boiled water / drink warm water。"],"etymology":"由动词 boil（“煮沸”）的过去分词 boiled + water 组成，用来描述“已经被煮沸过的水”。","mnemonic":["boil=“煮”；-ed=“已经…过”：boil + ed → boiled（煮过的）→ boiled water（开水/煮沸过的水）。"]}
{"word":"boilen","summary":{"en":"“Boil” means to heat a liquid until it bubbles, or to cook in boiling water; it can also mean to feel very angry. As a noun, it means bubbling boiling or a skin infection.","zh":"“boil”指把液体加热到沸腾或用沸水煮；也可指非常生气。作名词可指沸腾状态或皮肤的疖子。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to heat a liquid until it reaches the boiling point and forms bubbles; to cook something in boiling water","zh":"把液体加热到沸点并产生气泡；用沸水煮（食物）"},"examples":[{"en":"Boil the water before you drink it.","zh":"喝之前把水煮沸。"},{"en":"She boiled eggs for breakfast.","zh":"她早餐煮了鸡蛋。"}]},{"partOfSpeech":"v.","definition":{"en":"to be extremely hot, active, or emotional (used for liquids, weather, or feelings)","zh":"（液体/天气/情绪）沸腾般地翻滚；非常炎热；情绪非常激动"},"examples":[{"en":"The soup is boiling—turn down the heat.","zh":"汤正在沸腾——把火调小。"},{"en":"I was boiling with anger.","zh":"我气得“快沸腾”了（非常生气）。"}]},{"partOfSpeech":"n.","definition":{"en":"a state of bubbling at the boiling point; a brief period of boiling","zh":"沸腾状态；煮沸的一段时间"},"examples":[{"en":"Bring the sauce to a boil, then simmer for 10 minutes.","zh":"把酱汁煮沸，然后小火炖10分钟。"},{"en":"Let it boil for two minutes.","zh":"让它沸腾两分钟。"}]},{"partOfSpeech":"n.","definition":{"en":"a painful, swollen skin infection (a bump filled with pus)","zh":"疖子（皮肤的疼痛肿块，常含脓）"},"examples":[{"en":"He went to the clinic because of a boil on his neck.","zh":"他因为脖子上的疖子去了诊所。"}]}],"synonyms":["cook","seethe","simmer","bubble"],"phonetic":"/bɔɪl/","extraExplanation":["“boilen”不是常见英语单词，最可能是拼写错误。你可能想写的是：\n1) boil（动词/名词）：boil water（烧开水）；bring to a boil（煮到沸腾）\n2) boiling（形容词/现在分词）：boiling water（沸水）；It’s boiling today.（今天热死了）","常见搭配：boil down to（归结为）；boil over（沸溢；情绪爆发）；at a boil（在沸腾状态）。"]}
{"word":"boiler","summary":{"en":"A boiler is usually a machine that heats water to make hot water or steam (for heating or power); it can also mean a large container for boiling liquids.","zh":"boiler 通常指加热水产生热水或蒸汽的“锅炉”（供暖或动力用）；也可指用于煮沸液体的大型容器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A machine that heats water to produce hot water or steam, often used for heating buildings or powering engines.","zh":"锅炉；一种把水加热产生热水或蒸汽的设备，常用于供暖或为机器提供动力。"},"examples":[{"en":"The boiler provides hot water for the radiators in winter.","zh":"冬天锅炉为暖气片提供热水。"},{"en":"A steam boiler powered early factories and trains.","zh":"蒸汽锅炉曾为早期工厂和火车提供动力。"}]},{"partOfSpeech":"n.","definition":{"en":"A large covered container used for boiling liquids, especially in brewing or industrial work.","zh":"（尤指酿造或工业用的）大煮锅；用于煮沸液体的大型带盖容器。"},"examples":[{"en":"They poured the mixture into the boiler and let it boil.","zh":"他们把混合液倒进大煮锅里，让它煮沸。"}]}],"synonyms":["steam generator","water-heating unit","kettle (container sense)"],"phonetic":"/ˈbɔɪlər/","extraExplanation":["在英式英语里，boiler 很常见地指家里的“供暖/热水锅炉”（比如壁挂炉），而在美式英语里，很多家庭更常说 furnace（暖炉/供暖设备）或 water heater（热水器）。不过在大型建筑、工厂的供热系统里，boiler 在美式英语同样非常常见。","词源上，boiler 来自动词 boil（沸腾、煮沸），本义就是“用来煮沸的装置”。在工业革命时期，蒸汽锅炉是关键技术之一，因此在历史、文学与科普文章中也常出现，象征工业化与机器动力。"]}
{"word":"boiler-related","summary":{"en":"“Boiler-related” means connected with or caused by a boiler.","zh":"“boiler-related”表示“与锅炉有关的/由锅炉引起的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with, caused by, or used for a boiler (a machine that heats water to produce hot water or steam).","zh":"与锅炉有关的；由锅炉引起的；用于锅炉的（锅炉：用来加热水以产生热水或蒸汽的设备）。"},"examples":[{"en":"The inspector found a boiler-related safety problem in the basement.","zh":"检查员在地下室发现了一个与锅炉有关的安全问题。"},{"en":"She was hospitalized for boiler-related burns after a steam leak.","zh":"蒸汽泄漏后，她因与锅炉相关的烧伤住院。"},{"en":"We scheduled boiler-related maintenance before winter starts.","zh":"我们在冬季开始前安排了锅炉相关的维护。"}]}],"synonyms":["boiler-associated","boiler-connected","boiler-linked","related to the boiler"],"phonetic":"/ˈbɔɪlɚ rɪˌleɪtɪd/","extraExplanation":["“boiler-related”是一个用连字符连接的复合形容词，常见于报告、新闻和技术/安全语境，用来把某个问题或事件明确归因到“锅炉”这一设备（例如事故、维修、费用、故障）。在名词前作定语时更常用：boiler-related incidents / costs / repairs。也可改写为：related to the boiler（更口语）。"]}
{"word":"boiler-room","summary":{"en":"A boiler room is either (1) a building’s heating-equipment room, or (2) an informal term for a high-pressure (sometimes dishonest) sales/scam office.","zh":"boiler-room既可指（1）锅炉房/供暖设备间，也可口语指（2）高压式销售办公室，甚至非法投资诈骗窝点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A room in a building where the boiler and heating equipment are kept (often hot, noisy, and not meant for visitors).","zh":"（建筑物内放置锅炉和供暖设备的）锅炉房；供暖设备间（通常很热、很吵，不适合闲逛）"},"examples":[{"en":"The maintenance worker went down to the boiler room to check the pressure.","zh":"维修人员下到锅炉房检查压力。"},{"en":"It was so warm in the boiler room that we stepped outside to cool off.","zh":"锅炉房里太热了，我们走到外面凉快一下。"}]},{"partOfSpeech":"n.","definition":{"en":"(Business, informal) A high-pressure workplace—especially a sales office—where workers are pushed to make quick deals, sometimes using aggressive or dishonest tactics; also used for illegal “boiler-room” investment scams.","zh":"（商业/口语）高压式“冲业绩”的办公室（常指电话销售等），员工被逼着快速成交，有时会用强硬甚至不诚实手段；也可指非法“锅炉房”式投资诈骗窝点"},"examples":[{"en":"He quit the boiler-room sales job after two weeks because the pressure was intense.","zh":"他做了两周那种“锅炉房式”的销售工作就辞职了，因为压力太大。"},{"en":"The police shut down a boiler-room operation that tricked people into buying fake investments.","zh":"警方捣毁了一个“锅炉房”诈骗团伙，专门诱骗人购买虚假投资产品。"}]}],"synonyms":["boiler house","plant room","mechanical room","high-pressure sales office","scam call center"],"phonetic":"/ˈbɔɪlər ruːm/","extraExplanation":["“boiler-room”作比喻义时，来自“锅炉房又热又吵、节奏紧张”的联想，用来形容那种让人喘不过气的高压工作环境。","在金融语境中，boiler-room常与cold calling（陌生电话推销）、pump-and-dump（拉高出货）等骗局相关。","常见搭配：boiler-room tactics（高压/强推策略）、boiler-room operation（诈骗/强推团队）。","文化提示：有些英文作品会用“boiler room”来暗示社会底层或隐秘空间的压迫感；电影《Boiler Room》（2000）就以非法股票推销为主题。"]}
{"word":"boilerful","summary":{"en":"Boilerful means a full boiler’s worth (a quantity equal to what a boiler can hold), and is a rare word.","zh":"Boilerful 指“一锅炉那么多的量”（相当于锅炉的容量），属于比较罕用的词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) The amount that a boiler can hold; a boiler-full quantity.","zh":"（罕用）一锅炉的量；锅炉能装下的满满一份。"},"examples":[{"en":"They needed a boilerful of hot water before the laundry could start.","zh":"他们需要先烧出一锅炉的热水，洗衣才开始。"},{"en":"He poured in a boilerful of water to test the old heating system.","zh":"他倒入满满一锅炉的水，来测试那套旧供暖系统。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) Filled to the capacity of a boiler; as full as a boiler.","zh":"（罕用）装到锅炉容量极限的；像锅炉一样满的。"},"examples":[{"en":"The tank was boilerful and couldn’t take any more water.","zh":"水箱已经满到“锅炉满”的程度了，再也装不下了。"}]}],"synonyms":["a boiler full (of)","full capacity (of a boiler)","a boilerload"],"phonetic":"ˈbɔɪlərˌfʊl","extraExplanation":["这个词很少见，属于“名词 + -ful”的构词方式（像 spoonful, handful），表示“……那么多的一份/满满的量”。日常英语里更常说 a boiler full of water 或 the boiler’s full capacity，而不是 boilerful。","boiler 一般指“锅炉”（供暖/蒸汽用），所以 boilerful 多出现在描述热水、蒸汽系统或工业场景的文字里。"]}
{"word":"boilerhouse","summary":{"en":"A boilerhouse is a place that contains boilers to generate steam or hot water for heat or power.","zh":"boilerhouse 指放置锅炉、产生蒸汽或热水以供供暖或动力的锅炉房。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A building or room where boilers and related equipment are kept to produce steam or hot water for heating or industrial use.","zh":"锅炉房；放置锅炉及相关设备的建筑或房间，用于产生蒸汽或热水以供供暖或工业用途。"},"examples":[{"en":"The technician inspected the boilerhouse before turning the heating system on.","zh":"技术员在开启供暖系统前检查了锅炉房。"},{"en":"Steam from the boilerhouse powered the old factory machines.","zh":"锅炉房产生的蒸汽为老工厂的机器提供动力。"}]}],"synonyms":["boiler room","boiler house","plant room"],"phonetic":"/ˈbɔɪlərˌhaʊs/","extraExplanation":["在英式英语中更常写作 boiler house；在美式英语里也能见到 boiler room，意思非常接近，但 boiler room 也可能指“电话诈骗/推销中心”（俚语），而 boilerhouse 通常只指真正的锅炉设备间。","在工厂、学校、医院、船舶或大型建筑中，boilerhouse 往往是受限空间，可能有高温、高压、噪音等风险；英语里常见搭配有 boilerhouse operator（锅炉房操作员）、boilerhouse maintenance（锅炉房维护）。"]}
{"word":"boilerless","summary":{"en":"“Boilerless” means “without a boiler,” usually used for heating or hot-water systems that don’t require a boiler.","zh":"“boilerless”意为“无锅炉的”，多用于描述不需要锅炉的供暖或热水系统。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no boiler; designed to work without a boiler (often describing heating or hot-water systems).","zh":"无锅炉的；不需要锅炉即可运行的（常用于描述供暖或热水系统）。"},"examples":[{"en":"A boilerless water heater can heat water directly without storing it in a tank.","zh":"无锅炉式热水器可以直接加热水，而不需要水箱储水。"},{"en":"They upgraded to a boilerless heating system to save space in the utility room.","zh":"他们把供暖系统升级为无锅炉方案，以节省设备间的空间。"}]}],"synonyms":["without a boiler","no-boiler","tankless (for water heaters, depending on context)"],"phonetic":"/ˈbɔɪlɚləs/","extraExplanation":["“boilerless”更常见于工程、暖通（HVAC）或产品说明语境，并不是日常高频词。日常交流中更常说“without a boiler / no boiler needed”，或用更具体的技术词：如“tankless (water heater)（即热式热水器）”。","构词法：boiler（锅炉）+ -less（无……的）。类似的还有：wireless（无线的）、sugarless（无糖的）。"]}
{"word":"Boilermaker","summary":{"en":"Boilermaker can mean a worker who builds/repairs industrial boilers, or a drink combining beer with a shot of whiskey.","zh":"Boilermaker 可指“锅炉工”，也可指“啤酒配一口威士忌”的酒类组合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A skilled worker who builds, installs, or repairs large metal containers (boilers) and related industrial equipment, often in factories, ships, or power plants.","zh":"（锅炉工）制造、安装或修理大型金属锅炉及相关工业设备的技工，常见于工厂、船舶或发电厂。"},"examples":[{"en":"My uncle is a boilermaker at the shipyard.","zh":"我叔叔在造船厂当锅炉工。"},{"en":"Boilermakers must follow strict safety rules when working with high pressure.","zh":"锅炉工在高压环境下工作必须遵守严格的安全规定。"}]},{"partOfSpeech":"n.","definition":{"en":"A drink (or drinking combo) that pairs a shot of whiskey with a beer, often dropped into the beer or taken side by side.","zh":"（酒类）“一口威士忌配一杯啤酒”的喝法/组合，常见做法是把威士忌小杯投入啤酒中，或两者并饮。"},"examples":[{"en":"He ordered a boilermaker: a beer and a shot of whiskey.","zh":"他点了一杯 boilermaker：一杯啤酒加一小杯威士忌。"},{"en":"Some bars serve the boilermaker with the shot on the side.","zh":"有些酒吧会把那一小杯烈酒单独放在旁边搭配啤酒。"}]}],"synonyms":["boiler mechanic","boiler worker","fabricator","(drink) beer-and-a-shot"],"phonetic":"/ˈbɔɪlərˌmeɪkər/","extraExplanation":["“Boilermaker”原本是职业名词：早期工业时代需要专门工人制作与铆接大型锅炉（boiler）。后来在酒吧文化中，这个词也被用来指“啤酒+威士忌”的组合，带有较强的英美酒吧语境。","在美国，Purdue University（普渡大学）的体育队昵称是“Boilermakers”，与当地早期铁路/工业工人形象有关；在体育新闻里看到大写 Boilermakers 往往指球队。"]}
{"word":"boilermaker","summary":{"en":"Boilermaker means either a boiler-building/repair worker, or (in the U.S.) a beer-and-whiskey drink.","zh":"boilermaker 可指锅炉制造/维修工，也可（在美国）指“啤酒+威士忌”搭配的酒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A worker who builds, repairs, or maintains large boilers and related equipment (often in factories, ships, or power plants).","zh":"锅炉制造工；锅炉安装/维修工（在工厂、船舶或电厂等维护大型锅炉及相关设备的人）。"},"examples":[{"en":"My uncle worked as a boilermaker at the shipyard for twenty years.","zh":"我叔叔在船厂当了二十年锅炉工。"},{"en":"Boilermakers must follow strict safety rules because they work with high pressure and heat.","zh":"锅炉工必须遵守严格的安全规定，因为他们要接触高压和高温。"}]},{"partOfSpeech":"n.","definition":{"en":"(Especially in the U.S.) A drink made by dropping a shot of whiskey into a glass of beer, or a beer served with a whiskey shot on the side.","zh":"（尤指美国）“深水炸弹”式的酒：把一小杯威士忌倒入啤酒中，或啤酒配一杯威士忌旁边一起喝。"},"examples":[{"en":"He ordered a boilermaker: a lager with a shot of whiskey.","zh":"他点了一杯 boilermaker：一杯拉格啤酒配一杯威士忌。"},{"en":"Some bars serve a boilermaker with the shot on the side instead of dropping it in.","zh":"有些酒吧的 boilermaker 是把烈酒小杯放在旁边，而不是直接倒进啤酒里。"}]}],"synonyms":["boiler technician","boiler mechanic","welder (related)","beer-and-a-shot (informal)"],"phonetic":"/ˈbɔɪlərˌmeɪkər/","extraExplanation":["“Boilermaker”这个词最早指职业：制造/安装蒸汽锅炉的人。后来在美国酒吧文化中，因工人下班后常用“啤酒+烈酒”快速提神解乏，这种喝法也被称为 boilermaker。","在美国校园与体育语境里，Purdue University 的队名是“Boilermakers（普渡锅炉工队）”，来自该校早期与工程、铁路相关的历史绰号；看到大写 Boilermakers 往往指球队而不是饮料或职业。"]}
{"word":"boilermakers","summary":{"en":"“Boilermakers” most commonly means workers in the boiler-making trade; it can also refer to a beer-and-whiskey drink.","zh":"“boilermakers”最常指锅炉制造/维修等行业的工人；也可指“啤酒配威士忌”的一种喝法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who make, install, or repair boilers and large industrial metal tanks (a skilled trade)","zh":"制造、安装或维修锅炉及大型工业金属容器的工人（技术工种）"},"examples":[{"en":"Boilermakers repaired the steam system at the power plant.","zh":"锅炉工修理了发电厂的蒸汽系统。"},{"en":"He joined the boilermakers’ union after finishing his apprenticeship.","zh":"完成学徒训练后，他加入了锅炉工工会。"}]},{"partOfSpeech":"n.","definition":{"en":"a drink made by combining beer and a shot of whiskey (often dropped into the beer or served side by side)","zh":"“啤酒配威士忌”的混合喝法（常见为把威士忌倒入啤酒中，或啤酒与威士忌并杯同饮）"},"examples":[{"en":"At the bar, he ordered a boilermaker: a beer with a shot of whiskey.","zh":"在酒吧里，他点了一杯 boilermaker：一杯啤酒配一杯威士忌。"}]}],"synonyms":["boiler workers","metalworkers","welders","boilermaker (cocktail)"],"phonetic":"/ˈbɔɪlərˌmeɪkərz/","extraExplanation":["“Boilermakers”在美国也常指普渡大学（Purdue University）体育队的昵称（The Purdue Boilermakers），源于该校与工程/工业传统的关联。","作为酒名时，boilermaker 带有较强的酒吧文化色彩；不同地区做法不一：有的把威士忌“投进”啤酒里（drop shot），有的则分开上。"]}
{"word":"boilermaking","summary":{"en":"Boilermaking is the craft/industry or process of making and repairing boilers and heavy metal pressure vessels.","zh":"Boilermaking 指锅炉及重型金属压力容器的制造与维修行业，或其制作过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The craft or industry of designing, manufacturing, assembling, and repairing boilers and other heavy metal pressure vessels (often as part of industrial construction).","zh":"锅炉制造（业）：设计、制造、组装与修理锅炉及其他重型金属压力容器的工艺或行业（常见于工业建设）。"},"examples":[{"en":"He works in boilermaking at a shipyard, building large steel boilers.","zh":"他在船厂从事锅炉制造工作，建造大型钢制锅炉。"},{"en":"Boilermaking requires careful welding and strict safety inspections.","zh":"锅炉制造需要精细的焊接和严格的安全检测。"},{"en":"She studied boilermaking in a vocational program and became a certified welder.","zh":"她在职业项目中学习锅炉制造，后来成了持证焊工。"}]},{"partOfSpeech":"n.","definition":{"en":"The activity of making or producing boilers (the process itself).","zh":"制造锅炉的过程（指具体的制作活动）。"},"examples":[{"en":"Modern boilermaking uses computer-guided cutting and precision welding.","zh":"现代锅炉制造会使用计算机引导的切割与精密焊接。"},{"en":"During boilermaking, workers test the vessel to ensure it can handle high pressure.","zh":"在锅炉制造过程中，工人会测试容器以确保能承受高压。"}]}],"synonyms":["boiler fabrication","boiler manufacturing","pressure-vessel fabrication","heavy fabrication"],"phonetic":"/ˈbɔɪlərˌmeɪkɪŋ/","extraExplanation":["“boilermaking”常和“heavy fabrication（重型金属加工）”“pressure vessel（压力容器）”“welding（焊接）”一起出现，属于偏工业/工程领域的词。","在英语语境里更常见的职业名词是“boilermaker（锅炉工/锅炉制造工）”；“boilermaking”强调行业或制作过程。"]}
{"word":"boilerman","summary":{"en":"A boilerman is usually a worker who runs and maintains boilers; in the US it can also mean a Purdue Boilermakers player or fan.","zh":"boilerman 通常指锅炉工（操作和维护锅炉）；在美国也可指普渡大学“Boilermakers”校队的队员或球迷。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A worker who operates, maintains, or repairs boilers and steam/heat equipment (often in factories, ships, or building heating systems).","zh":"锅炉工；负责操作、维护或修理锅炉及蒸汽/供热设备的工人（常见于工厂、船舶或建筑供暖系统）。"},"examples":[{"en":"The boilerman checked the pressure gauge before starting the shift.","zh":"锅炉工在开工前检查了压力表。"},{"en":"A skilled boilerman can prevent dangerous steam leaks by doing regular inspections.","zh":"熟练的锅炉工通过定期检查可以预防危险的蒸汽泄漏。"},{"en":"The hospital hired a new boilerman to help maintain the heating system.","zh":"医院雇了一位新锅炉工来协助维护供暖系统。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, US) A member or fan of the Purdue University sports teams, the Boilermakers.","zh":"（美国非正式）普渡大学（Purdue University）校队“Boilermakers”的队员或球迷。"},"examples":[{"en":"He’s a proud Boilerman who never misses a basketball game.","zh":"他是个自豪的普渡球迷，从不错过一场篮球赛。"},{"en":"The Boilermen cheered loudly during the rivalry match.","zh":"普渡球迷在对抗赛中大声助威。"}]}],"synonyms":["boiler operator","boiler technician","steamfitter","Boilermaker (Purdue)"],"phonetic":"/ˈbɔɪlərmæn/","extraExplanation":["“boilerman”在日常工作语境里最常指“锅炉工/锅炉操作员”。在美国大学体育语境中，有时会与普渡大学的昵称“Boilermakers（锅炉工）”相关联；这来自印第安纳州早期铁路与工业背景，强调“动手技能”和“工匠精神”。","拼写提示：工作职业更常见的写法是“boilerman”或“boiler operator/boiler technician”；指普渡队时通常写作“Boilermaker”，且首字母大写。"]}
{"word":"boilerplate","summary":{"en":"Boilerplate means standard, reusable wording—especially in legal or official writing—and can also describe language that feels generic or formulaic.","zh":"Boilerplate 指可重复使用的标准措辞（尤指法律或正式文件中的固定条款），也可形容语言很模板化、泛泛而谈。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"standard, reusable text or language that is used repeatedly (often in contracts, forms, or official documents)","zh":"（常用于合同、表格或官方文件中的）固定套话；可重复使用的标准文本"},"examples":[{"en":"Most of the contract was boilerplate, but we negotiated the payment terms.","zh":"合同的大部分是固定条款，但我们就付款条款进行了协商。"},{"en":"Please don’t copy boilerplate into your personal statement—write in your own voice.","zh":"个人陈述请不要照搬套话，要用你自己的表达。"}]},{"partOfSpeech":"adj.","definition":{"en":"used to describe language or content that is routine, formulaic, and not customized","zh":"（形容用语/内容）程式化的；套话式的；缺乏个性化的"},"examples":[{"en":"The email felt boilerplate and didn’t answer my specific question.","zh":"这封邮件很像模板回复，并没有回答我具体的问题。"},{"en":"Their apology sounded boilerplate rather than sincere.","zh":"他们的道歉听起来像套话，而不是真诚的。"}]}],"synonyms":["standard wording","stock language","template text","formulaic language","canned response","fine print"],"phonetic":"/ˈbɔɪlərˌpleɪt/","extraExplanation":["“boilerplate”最初指印刷行业里可重复使用的金属印版（常由熔化金属浇铸而成），后来引申为“可反复套用的固定文本”。如今在法律、商业和客服语境中很常见，带有“缺少针对性/显得敷衍”的语气。"]}
{"word":"boilers","summary":{"en":"“Boilers” is the plural of “boiler,” usually meaning heating/hot-water equipment, and sometimes a large pot for boiling liquids.","zh":"“boilers”是“boiler”的复数，通常指供暖/热水设备中的锅炉，也可指用于煮液体的大锅。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a machine or container that heats water to make steam or hot water, often for heating buildings or running engines","zh":"锅炉；（用于供暖或动力的）热水/蒸汽发生器"},"examples":[{"en":"The apartment building has a central boiler in the basement.","zh":"这栋公寓楼在地下室有一台中央锅炉。"},{"en":"Old boilers can waste energy if they aren’t maintained.","zh":"老旧锅炉如果不维护，可能会浪费能源。"}]},{"partOfSpeech":"n.","definition":{"en":"a large metal pot used for boiling liquids, especially in cooking or making beer","zh":"大锅；煮锅（尤指用于煮液体、酿啤酒等）"},"examples":[{"en":"They used two large boilers to cook soup for the event.","zh":"他们用两口大锅为活动煮汤。"},{"en":"The brewery cleaned the boilers after each batch.","zh":"啤酒厂每做完一批都会清洗煮锅。"}]}],"synonyms":["water heater","steam generator","furnace","kettle","cauldron"],"phonetic":"/ˈbɔɪlər/","extraExplanation":["“boilers”是“boiler”的复数形式：在日常生活里更常指供暖/热水系统里的“锅炉”；在烹饪或酿造语境中也可指“大锅、煮锅”。","相关表达：on the back burner（暂时搁置）；bring something to the boil（把……煮沸）。"]}
{"word":"boilersmith","summary":{"en":"A boilersmith is a skilled tradesperson who makes, installs, or repairs industrial boilers and related metal systems.","zh":"boilersmith 指从事工业锅炉及相关金属系统制造、安装或维修的熟练技工。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A skilled worker who builds, installs, maintains, or repairs boilers (large tanks and systems that heat water or produce steam), often in power plants, factories, and ships.","zh":"锅炉工；锅炉制造与维修技师：负责建造、安装、维护或修理锅炉（用于加热水或产生蒸汽的大型设备与系统）的熟练工人，常见于电厂、工厂和船舶等场所。"},"examples":[{"en":"The boilersmith inspected the steam pipes before the plant restarted.","zh":"锅炉工在工厂重新启动前检查了蒸汽管道。"},{"en":"After years as a boilersmith, she moved into industrial safety training.","zh":"做了多年锅炉工后，她转向工业安全培训工作。"},{"en":"Boilersmiths often work in tight spaces and follow strict safety rules.","zh":"锅炉工经常在狭小空间作业，并遵守严格的安全规定。"}]}],"synonyms":["boilermaker","boiler mechanic","industrial pipefitter (related)"],"phonetic":"/ˈbɔɪlərˌsmɪθ/","extraExplanation":["“boilersmith”由“boiler（锅炉）+ smith（铁匠/工匠）”构成；这里的“smith”指擅长金属加工的技工（类似 blacksmith）。","在北美语境中，boilersmith 常与“boilermaker（锅炉制造工）”意义接近；不同地区或行业可能更常用其中一个词。","这是一个传统工种名称，常与工会、学徒制培训（apprenticeship）和工业现场安全文化相关。"]}
{"word":"boilerworks","summary":{"en":"Boilerworks means a place (or, less commonly, the trade) where boilers are made or repaired.","zh":"Boilerworks 指制造或修理锅炉的工厂/车间（较少情况下也可指锅炉制造这一行业）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a factory or workshop where boilers are made, repaired, or maintained; a boiler plant.","zh":"制造、修理或维护锅炉的工厂/车间；锅炉设备厂。"},"examples":[{"en":"He found a job at the local boilerworks repairing industrial boilers.","zh":"他在当地的锅炉厂找到了一份工作，负责修理工业锅炉。"},{"en":"The old boilerworks once supplied steam boilers to ships and factories.","zh":"这家老锅炉厂曾为轮船和工厂提供蒸汽锅炉。"}]},{"partOfSpeech":"n.","definition":{"en":"the trade or work of making and working with boilers and related heavy metal equipment (less common).","zh":"锅炉制造与加工的行业/工作（较少见）。"},"examples":[{"en":"He trained in boilerworks before moving into general metalwork.","zh":"他先接受了锅炉制造方面的培训，后来转做普通金工。"}]}],"synonyms":["boiler factory","boiler shop","boiler plant","ironworks","foundry"],"phonetic":"ˈbɔɪlərˌwɝks","extraExplanation":["“boilerworks”常见于工业与历史语境，尤其是19—20世纪的造船、铁路与工厂蒸汽系统。现代更常见的说法包括“boiler plant / boiler shop / boiler factory”。有时也会写作两词：boiler works。"]}
{"word":"boilery","summary":{"en":"“Boilery” is a rare adjective meaning “related to a boiler or boiler room.”","zh":"“boilery”是个罕用形容词，意思是“与锅炉或锅炉房有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Relating to a boiler or a place where boilers are used (such as a boiler room).","zh":"（罕用）与锅炉有关的；指使用锅炉的地方（如锅炉房）的。"},"examples":[{"en":"The boilery equipment needs regular safety checks.","zh":"锅炉相关设备需要定期进行安全检查。"},{"en":"He works nights in the boilery section of the factory.","zh":"他在工厂的锅炉区上夜班。"}]}],"synonyms":["boiler-related","boiler-room","industrial (context-dependent)"],"phonetic":"/ˈbɔɪləri/","extraExplanation":["“boilery”在现代英语中非常少见，更多时候人们会用更常见的说法，如“boiler (锅炉) / boiler room (锅炉房) / boiler-related (与锅炉相关的)”。如果你是在写作或考试中遇到它，通常可理解为“锅炉的、锅炉房的”。","拼写提醒：它不是常见词，很多情况下可能是把“boiler（锅炉）”误写成“boilery”。可根据上下文判断。"]}
{"word":"boiling","summary":{"en":"“Boiling” most often means a liquid is bubbling at its boiling point; it can also mean very hot or extremely angry.","zh":"“boiling”最常指液体达到沸点、冒泡沸腾；也可表示“很热”或“怒火中烧”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a liquid) at the temperature where it turns into vapor; bubbling with heat.","zh":"（液体）达到沸点、开始汽化的；沸腾的。"},"examples":[{"en":"The water is boiling—turn off the stove.","zh":"水正在沸腾——把炉子关掉。"},{"en":"Add the noodles to boiling water.","zh":"把面条放进沸水里。"}]},{"partOfSpeech":"adj.","definition":{"en":"Very hot; extremely warm.","zh":"非常热的；滚烫的。"},"examples":[{"en":"It was boiling outside in the afternoon sun.","zh":"下午太阳下，外面热得要命。"}]},{"partOfSpeech":"adj.","definition":{"en":"Extremely angry or emotionally heated (often in “boiling with anger”).","zh":"（情绪）极其愤怒、火冒三丈的（常见于“boiling with anger”）。"},"examples":[{"en":"He was boiling with anger after the unfair comment.","zh":"听到那句不公平的评论后，他气得发抖。"},{"en":"Try not to speak when you’re boiling; you might regret it later.","zh":"你在气头上尽量别说话，之后可能会后悔。"}]},{"partOfSpeech":"n.","definition":{"en":"The process of bringing a liquid to the boil; cooking by boiling.","zh":"煮沸的过程；用水煮的烹饪方式。"},"examples":[{"en":"Boiling is a simple way to cook potatoes.","zh":"水煮是烹饪土豆的简单方法。"}]}],"synonyms":["seething","scalding","simmering (less strong)","furious (emotion)"],"phonetic":"/ˈbɔɪlɪŋ/","extraExplanation":["“boiling”来自动词“boil（沸腾；煮）”。日常表达中，“boiling hot”比“very hot”更强调“热得烫/热得难受”。","比喻用法常把情绪当作“在锅里翻滚”：例如“boiling with anger（怒火中烧）”。语气比“angry”更强，但又不如某些粗鲁词汇直接攻击他人。"]}
{"word":"boiling point","summary":{"en":"a temperature where a liquid boils; also a critical moment when emotions or conflict may erupt","zh":"液体沸腾的温度；也指情绪或矛盾将要爆发的临界时刻"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the temperature at which a liquid starts to boil and turns into gas (under a stated pressure)","zh":"（在一定压力下）液体开始沸腾并转变为气体的温度；沸点"},"examples":[{"en":"Water’s boiling point is 100°C at sea level.","zh":"在海平面上，水的沸点是100°C。"},{"en":"At higher altitudes, the boiling point of water is lower.","zh":"在海拔更高的地方，水的沸点更低。"},{"en":"The lab report must include the boiling point and melting point of the substance.","zh":"实验报告必须包含该物质的沸点和熔点。"}]},{"partOfSpeech":"n.","definition":{"en":"the moment when a situation becomes so tense or emotional that it is likely to explode into action, anger, or conflict; a tipping point","zh":"（局势或情绪）到达临界点、爆发点；一触即发的时刻"},"examples":[{"en":"After weeks of stress, a small mistake pushed him to his boiling point.","zh":"在连续几周的压力后，一个小错误把他逼到了爆发点。"},{"en":"The debate reached a boiling point when they started insulting each other.","zh":"当他们开始互相辱骂时，辩论达到了爆发点。"}]}],"synonyms":["boiling temperature","tipping point","breaking point","flashpoint","critical point"],"phonetic":"/ˈbɔɪlɪŋ pɔɪnt/","extraExplanation":["科学语境里，沸点会随外界压力改变：标准大气压下水的沸点约为100°C；在高原气压更低，水更早沸腾但温度更低。","比喻义常用于描述情绪或冲突“积累到顶点”的状态，英语里也常说“reach/get to a boiling point（到达爆发点）”。"],"etymology":"由“boiling（沸腾的）+ point（点、临界点）”组成；最初指物理化学中的温度点，后来引申为“情绪/矛盾的爆发点”。","mnemonic":["把它想成“水烧开那一刻的点”→“情绪也烧到要‘开锅’的点”。","point=临界点：中文“爆发点/临界点”里的“点”就对应 point。"]}
{"word":"boiling water","summary":{"en":"water heated to the point of bubbling.","zh":"加热到沸点并持续冒泡的水。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Water that has been heated until it reaches the boiling point and is bubbling (about 100°C / 212°F at sea level).","zh":"煮沸的水；沸水（通常指加热到沸点并持续冒泡的水，海平面约100°C）。"},"examples":[{"en":"Pour boiling water over the noodles and cover the bowl for three minutes.","zh":"把沸水倒在面条上，盖上碗三分钟。"},{"en":"Be careful—boiling water can cause serious burns.","zh":"小心——沸水会造成严重烫伤。"},{"en":"Add the dumplings to boiling water, then stir gently so they don’t stick.","zh":"把饺子下到沸水里，然后轻轻搅拌，防止粘锅。"}]},{"partOfSpeech":"phrase","definition":{"en":"(Figurative, less common) Intense anger or strong emotion, often in expressions like “someone’s blood is boiling.”","zh":"（引申义，较少直接用作该短语）极度愤怒或强烈情绪，常见于“blood is boiling”等表达中。"},"examples":[{"en":"After reading the rude comment, her blood felt like boiling water.","zh":"看到那条无礼的评论后，她感觉血都像沸水一样在翻腾。"},{"en":"His anger rose like boiling water in a pot.","zh":"他的怒火像锅里的沸水一样往上冒。"}]}],"synonyms":["boiled water","hot water","scalding water","rolling boil"],"phonetic":"/ˈbɔɪlɪŋ ˈwɔtɚ/","extraExplanation":["日常英语里更常说“boiling water”表示“刚烧开的水/正在沸腾的水”；如果只是“热水”，通常用“hot water”。","在烹饪说明中，“add to boiling water”通常指水已经在锅里持续冒泡后再下食材，而不是刚开始变热。"],"etymology":"由 boil（“沸腾、煮沸”）+ water（“水”）组成的常用搭配；boil 源自古法语 boillir，意为“冒泡、沸腾”。","mnemonic":["把 boiling 想成“冒泡的”（像“波”在翻），boiling water 就是“水在冒泡的沸水”。","联想中文“沸”字：三点水+“弗”，记作“水在翻滚不止”→ 沸水=boiling water。"]}
{"word":"boiling-hot","summary":{"en":"Boiling-hot means extremely hot—either literally near boiling temperature or informally very hot and uncomfortable.","zh":"Boiling-hot 表示“滚烫/极热”，既可指接近沸点的温度，也可口语指天气或环境热得难受。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Extremely hot; at or near the temperature where a liquid (especially water) boils.","zh":"滚烫的；极热的；接近（尤指水）沸点的温度。"},"examples":[{"en":"Be careful—the soup is boiling-hot.","zh":"小心——这汤滚烫。"},{"en":"She poured boiling-hot water into the cup to make tea.","zh":"她把滚烫的水倒进杯子里泡茶。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal) Very hot in weather or in a room, causing discomfort.","zh":"（口语）炎热难耐的（天气或室内温度很高）。"},"examples":[{"en":"It was boiling-hot on the subway platform in July.","zh":"七月地铁站台上热得要命。"},{"en":"My apartment gets boiling-hot in the afternoon sun.","zh":"我家下午被太阳晒得特别热。"}]}],"synonyms":["scalding","piping hot","searing","blazing hot","scorching"],"phonetic":"/ˈbɔɪlɪŋ hɑt/","extraExplanation":["“boiling-hot”是由动词现在分词“boiling（沸腾的）”+形容词“hot（热的）”组成的复合形容词，常用连字符强调“非常非常热”。","口语里，尤其在英式英语中，人们也常直接说“It’s boiling!”表示“热死了/太热了”。在美式英语中也能听到，但更常见的说法还有“it’s scorching”或“it’s blazing hot”。"]}
{"word":"boiling-point","summary":{"en":"“Boiling point” means the temperature where a liquid boils, and figuratively, a moment when tension or anger is about to explode.","zh":"“Boiling point”既指液体沸腾的温度（沸点），也可比喻情绪或矛盾即将爆发的临界时刻。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the temperature at which a liquid turns into a gas (boils), usually stated for a specific pressure (often 1 atmosphere)","zh":"沸点：液体变成气体（沸腾）时的温度，通常需在特定压力下说明（常以1个标准大气压为准）"},"examples":[{"en":"Water has a boiling point of 100°C (212°F) at sea level.","zh":"在海平面上，水的沸点是100°C（212°F）。"},{"en":"At higher altitudes, the boiling point of water is lower.","zh":"在海拔更高的地方，水的沸点会更低。"}]},{"partOfSpeech":"n.","definition":{"en":"a situation or moment when anger, tension, or emotion becomes extreme and may lead to conflict or action","zh":"（情绪/矛盾的）爆发点；临界点：愤怒、紧张或情绪升至极端、可能引发冲突或行动的时刻"},"examples":[{"en":"After weeks of stress, the argument pushed him to the boiling point.","zh":"在连续几周的压力后，那场争吵把他逼到了爆发点。"},{"en":"Public frustration reached a boiling point after the new policy was announced.","zh":"新政策宣布后，公众的不满情绪达到了爆发点。"}]}],"synonyms":["(literal) boiling temperature","(figurative) breaking point","flashpoint","tipping point"],"phonetic":"/ˈbɔɪlɪŋ pɔɪnt/","extraExplanation":["写作与用法提示：字面义常用于科学语境（boiling point of water/ethanol），比喻义常搭配 reach/hit/get to + the boiling point，强调“情绪或矛盾积累到顶点”。"]}
{"word":"boiling-safe","summary":{"en":"“Boiling-safe” describes something that can be safely boiled in water (often for sterilizing).","zh":"boiling-safe 指物品可以安全地用沸水煮（常用于消毒）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to safely withstand being boiled in water without melting, breaking, or releasing harmful substances.","zh":"可安全经受水煮（沸水加热）而不融化、不破裂、也不释放有害物质的。"},"examples":[{"en":"Make sure the baby bottle is boiling-safe before you sterilize it.","zh":"在用水煮消毒之前，先确认奶瓶是否耐煮（可水煮消毒）。"},{"en":"This silicone spoon is boiling-safe, so you can disinfect it in hot water.","zh":"这把硅胶勺耐煮，所以可以用热水消毒。"},{"en":"Not all plastics are boiling-safe; some can warp or leach chemicals.","zh":"并非所有塑料都耐煮；有些会变形或析出化学物质。"}]}],"synonyms":["boil-safe","safe to boil","suitable for boiling","sterilizer-safe"],"phonetic":"/ˈbɔɪlɪŋ seɪf/","extraExplanation":["“boiling-safe”多见于产品说明/标签（如奶瓶、安抚奶嘴、餐具、厨房工具），意思接近“可用沸水消毒/可煮沸消毒”。不同品牌可能还会用：boil-safe, safe to boil, boilable, sterilizer-safe。","实际使用时仍要看具体条件：有的只允许短时间煮沸（如3–5分钟），或只适用于某些部件；也可能区分“dishwasher-safe（洗碗机可用）”“microwave-safe（微波炉可用）”“heat-resistant（耐热）”，它们不完全等同。"]}
{"word":"boilinglike","summary":{"en":"“Boilinglike” means “like boiling”—very hot, bubbling, or intensely turbulent (sometimes about emotions or situations).","zh":"“boilinglike”表示“像沸腾一样”——非常热、冒泡或剧烈翻涌（也可形容情绪或局势）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling boiling; extremely hot, bubbling, or violently swirling (often used to describe liquid, heat, emotions, or activity).","zh":"像在沸腾一样的；极热、冒泡或剧烈翻涌的（也常形容情绪或局势的激烈起伏）。"},"examples":[{"en":"The soup had a boilinglike surface, with bubbles rising nonstop.","zh":"汤的表面像在沸腾一样，气泡不停地冒上来。"},{"en":"A boilinglike anger rose in him when he heard the lie.","zh":"当他听到那个谎言时，一股沸腾般的怒火在心里升起。"},{"en":"The street felt boilinglike at noon in summer.","zh":"夏天中午的街道热得像要沸腾一样。"}]}],"synonyms":["boiling-hot","seething","bubbling","churning","simmering"],"phonetic":"/ˈbɔɪlɪŋˌlaɪk/","extraExplanation":["“boilinglike”由“boiling + -like”构成，意思是“像……一样”。它不是非常常见的固定词，更常见的表达有：boiling-hot（滚烫的）、seething（翻腾的/怒火中烧的）、simmering（暗涌的/酝酿中的）、at a boiling point（达到爆发点）。在写作中用它能制造强烈的画面感，但口语里通常会换成更常用的形容词。"]}
{"word":"boilingly","summary":{"en":"“Boilingly” means either literally ‘in a boiling-hot way’ or (less commonly) ‘with intense anger or emotion.’","zh":"“boilingly”可指字面上“滚烫/沸腾地”，也可较少见地指“带着强烈愤怒或情绪地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is boiling (very hot and bubbling).","zh":"以沸腾的方式；滚烫并冒泡地。"},"examples":[{"en":"The soup was boilingly hot, so I waited before tasting it.","zh":"汤滚烫得像在沸腾，所以我等了一会儿才尝。"},{"en":"Steam rose boilingly from the kettle.","zh":"水壶里冒出的蒸汽热气腾腾。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Figurative, less common) In an intensely emotional way, especially with anger or impatience.","zh":"（比喻，较少用）情绪极其强烈地，尤指愤怒或不耐烦地。"},"examples":[{"en":"He spoke boilingly about the unfair decision.","zh":"他谈到那个不公的决定时语气愤愤不平。"},{"en":"She wrote boilingly in her journal after the argument.","zh":"争吵后她在日记里带着强烈怒气写下了感受。"}]}],"synonyms":["scaldingly","hotly","furiously","angrily","intensely"],"phonetic":"/ˈbɔɪlɪŋli/","extraExplanation":["“boilingly”由形容词/现在分词“boiling”（沸腾的、滚烫的）+ 副词后缀“-ly”构成，表示“以……的方式”。","这个词在日常口语里不算常见；更自然的表达常用“boiling hot（滚烫）”“furiously/angrily（愤怒地）”“with boiling anger（怒火中烧地）”。"]}
{"word":"boiloff","summary":{"en":"Boiloff is the loss of liquid as it turns into gas, especially in cryogenic storage like LNG or rocket fuels.","zh":"Boiloff指液体（尤指低温液体）因受热汽化成气体造成的蒸发损耗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the loss of a liquid (especially a cryogenic liquid like LNG or liquid oxygen) as it turns into gas because of heat","zh":"（尤指液化天然气、液氧等低温液体因受热）蒸发成气体而造成的损失；蒸发损耗"},"examples":[{"en":"Engineers try to reduce boiloff in LNG storage tanks.","zh":"工程师会尽量减少液化天然气储罐中的蒸发损耗。"},{"en":"The spacecraft must manage boiloff from its cryogenic fuel.","zh":"航天器必须管理其低温燃料的蒸发损耗。"}]},{"partOfSpeech":"n.","definition":{"en":"(more general) the amount of liquid that boils away during heating","zh":"（更一般）加热过程中被煮沸蒸发掉的液体量"},"examples":[{"en":"Because the lid was off, there was a lot of boiloff while the soup simmered.","zh":"因为没盖锅盖，汤小火煮的时候蒸发掉了很多水分。"}]}],"synonyms":["evaporation loss","vaporization loss","losses from evaporation"],"phonetic":"/ˈbɔɪlˌɔf/","extraExplanation":["“boiloff”在工程与能源领域很常见，尤其指低温储存与运输（如LNG、液氢、液氧）中不可避免的“热泄漏→汽化”。很多系统会把产生的气体回收再利用（例如回输、发电或作为燃料），以减少浪费与安全风险。"]}
{"word":"boiloffs","summary":{"en":"“Boiloffs” is the plural of “boil-off”: liquid lost (often cryogenic liquid) as it warms and becomes gas, or the gas produced; more generally, liquid that evaporates during heating.","zh":"“boiloffs”是“boil-off”的复数：指液体（常见为低温液体）因升温汽化造成的损失或产生的气体；也可泛指加热过程中蒸发掉的液体量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Loss of liquid (especially a cryogenic liquid) as it warms and turns into gas; the gas produced by that evaporation.","zh":"（尤指低温液体）因升温而蒸发并变成气体所造成的液体损失；也可指蒸发产生的气体。"},"examples":[{"en":"Engineers measured the LNG tank’s boil-off to estimate daily losses.","zh":"工程师测量液化天然气储罐的汽化损失，以估算每日损耗。"},{"en":"The ship used boil-off gas to help power its engines.","zh":"这艘船利用蒸发产生的气体来辅助驱动发动机。"}]},{"partOfSpeech":"n.","definition":{"en":"In general use, the amount of liquid that “boils off” (evaporates) from a container during heating or cooking.","zh":"在一般用法中，指加热或烹饪时从容器中“煮干/蒸发掉”的液体量。"},"examples":[{"en":"Add more water if there’s too much boil-off while the soup simmers.","zh":"如果汤小火炖时蒸发得太多，就再加点水。"},{"en":"Covering the pot reduces boil-off and keeps the sauce from getting too thick.","zh":"盖上锅盖能减少蒸发，让酱汁不至于变得太浓。"}]}],"synonyms":["evaporation loss","vaporization loss","boil-off gas","evaporation"],"phonetic":"/ˈbɔɪlˌɔf/","extraExplanation":["“boil-off / boiloff”常见于工程与能源领域（如LNG液化天然气、液氢、液氮、航天推进剂储存）。严格来说不一定真的“沸腾”，而是因热量进入导致的蒸发与汽化，所以中文常译为“汽化损失/蒸发损失”。","拼写上可见 boil-off（更常见、较规范）与 boiloff（更口语或行业简写）。你给的“boiloffs”是复数形式，表示多次/多处的损失量或不同系统的蒸发量。"]}
{"word":"boilover","summary":{"en":"A boilover is either (1) liquid spilling out while boiling or (2) a sudden emotional outburst.","zh":"boilover指（1）液体沸腾溢出，（2）（比喻）情绪或矛盾的突然爆发。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A situation when a liquid boils and spills out over the sides of a pot or container.","zh":"（液体）沸腾后溢出、从锅或容器边缘漫出来的情况。"},"examples":[{"en":"Turn the heat down to prevent a boilover.","zh":"把火调小，避免汤沸溢出来。"},{"en":"The milk had a boilover and made a mess on the stove.","zh":"牛奶沸溢出来，把炉灶弄得一团糟。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) A sudden release of strong emotion, anger, or tension; an outburst.","zh":"（比喻）情绪、愤怒或紧张的突然爆发；失控的爆发。"},"examples":[{"en":"After weeks of pressure at work, he finally had a boilover during the meeting.","zh":"在工作压力累积了好几周后，他终于在会议上情绪爆发了。"},{"en":"The argument was a boilover of long-standing family conflicts.","zh":"那场争吵是多年家庭矛盾的一次集中爆发。"}]}],"synonyms":["overflow","spillover","outburst","flare-up","eruption"],"phonetic":"/ˈbɔɪlˌoʊvɚ/","extraExplanation":["“boilover”也常写作两词“boil over”（作动词短语）：The soup boiled over.（汤沸出来了。）比喻用法也很常见：Tempers boiled over.（火气上来了/情绪失控了。）","字面意思来自“沸腾时溢出”，因此比喻意义强调“积累到临界点后突然爆发”，语气比普通的“angry”更有“压抑已久”的感觉。"]}
{"word":"boils","summary":{"en":"“Boils” most often means “he/she/it boils” (heats or cooks in boiling water), and it can also mean the plural noun “boils” (painful skin bumps).","zh":"“boils”最常见是动词第三人称单数（把水烧开/用水煮）；也可作名词复数，表示“疖子、脓包”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"third-person singular of “boil”: to heat a liquid until it reaches the boiling point and bubbles; or to cook something in boiling water","zh":"“boil”的第三人称单数：把液体加热至沸点产生气泡；或用沸水煮（食物）"},"examples":[{"en":"She boils water for tea every morning.","zh":"她每天早上都会把水烧开来泡茶。"},{"en":"The recipe says he boils the eggs for eight minutes.","zh":"食谱说他把鸡蛋煮八分钟。"}]},{"partOfSpeech":"v.","definition":{"en":"third-person singular of “boil”: to be extremely hot or to be filled with strong emotion (especially anger)","zh":"“boil”的第三人称单数：热得厉害；或情绪（尤指愤怒）强烈翻涌"},"examples":[{"en":"In the summer, the city boils under the sun.","zh":"夏天，这座城市在烈日下热得像要沸腾。"},{"en":"He boils with anger when he hears the rumor.","zh":"他听到谣言时气得火冒三丈。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of “boil”: a painful, swollen skin infection (a pus-filled bump), often caused by bacteria","zh":"“boil”的复数：疖子（皮肤疼痛的肿块/脓包），常由细菌感染引起"},"examples":[{"en":"The doctor said the boils should heal with proper treatment.","zh":"医生说这些疖子在正确治疗下会痊愈。"},{"en":"He got repeated boils on his neck after sweating a lot.","zh":"他大量出汗后脖子上反复长疖子。"}]}],"synonyms":["heats","cooks","simmers","seethes","furuncles"],"phonetic":"/bɔɪlz/","extraExplanation":["“boils”在日常文本里最常见的是动词形式（第三人称单数）：She boils water（她把水烧开）。当你看到“painful boils / skin boils”这类搭配时，通常指名词“疖子”。","与烹饪相关的常见固定搭配：boils over（沸腾溢出）；bring to a boil（把……煮开）；boil down to（归结为，关键在于）。"]}
{"word":"boily","summary":{"en":"Boily means “bubbling/boiling,” and informally it can also mean “having boils on the skin.”","zh":"boily 表示“冒泡沸腾的”，非正式用法也可表示“长疖子的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having bubbles; boiling or bubbling.","zh":"起泡的；沸腾的；冒泡的。"},"examples":[{"en":"The soup looked boily, so I turned down the heat.","zh":"汤看起来在冒泡沸腾，所以我把火调小了。"},{"en":"Don’t touch the water while it’s boily.","zh":"水在冒泡沸腾的时候别碰。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal) Having boils on the skin; covered with boils.","zh":"（非正式）长疖子的；布满疖子的。"},"examples":[{"en":"After the infection, his arm became red and boily.","zh":"感染之后，他的手臂变得发红并起了疖子。"},{"en":"If a bump becomes boily and painful, see a doctor.","zh":"如果肿块变得像疖子一样又痛，去看医生。"}]}],"synonyms":["bubbly","boiling","simmering","blistered","pustular"],"phonetic":"/ˈbɔɪli/","extraExplanation":["“boily”是由“boil”（沸腾；疖子）加上形容词后缀“-y”构成，意思会根据语境在“冒泡的”和“长疖子的”两种含义之间切换。口语里更常见的是“boiling / bubbly”（形容液体冒泡）或“covered in boils”（形容皮肤长疖子），因此“boily”整体偏少见、偏口语。"]}
{"word":"Boiney","summary":{"en":"“Boiney” is usually a nonstandard spelling of “bony” (very thin; bones showing).","zh":"“Boiney”通常是“bony”的非标准拼写（很瘦、骨头突出的）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Nonstandard or misspelled form of “bony,” meaning having a lot of bones showing; very thin, with bones easily seen or felt.","zh":"“bony”的非标准拼写或拼写错误，意思是“骨头突出的；很瘦的（骨头容易看见或摸到）”。"},"examples":[{"en":"The stray dog looked boiney and hungry.","zh":"那只流浪狗看起来瘦骨嶙峋，还很饿。"},{"en":"After the long hike, my shoulders felt boiney under the backpack straps.","zh":"走了很久的徒步后，我的肩膀在背包带下感觉骨头都突出来了。"}]}],"synonyms":["bony","skinny","thin","gaunt"],"phonetic":"/ˈboʊni/","extraExplanation":["“Boiney”一般不是标准英语单词；在日常写作里更常见的是“bony”。如果你是在歌词、网名、方言或某个作品里看到“Boiney”，也可能是刻意的拼写（用来表达口音/俏皮语气）或专有名词。你可以告诉我它出现的句子，我可以帮你判断具体含义。"]}
{"word":"boing","summary":{"en":"“Boing” is an informal sound word for bouncing, and it can also mean “to bounce/spring up.”","zh":"“boing”是非正式的拟声词，表示“弹跳的声音”；也可作动词表示“弹起/回弹”。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"a bouncing sound or the action of springing back up, often used in cartoons or to describe something elastic or playful","zh":"（常用于拟声）“蹦/弹”的声音；也可指弹起、回弹的动作，常见于卡通或形容有弹性、很俏皮的感觉"},"examples":[{"en":"The ball hit the floor—boing!—and bounced right back into my hand.","zh":"球砸到地上——boing！——又弹回到我手里。"},{"en":"In the cartoon, the character’s hair went boing when he got surprised.","zh":"在卡通里，角色一受惊，头发就“boing”地一下弹起来。"}]},{"partOfSpeech":"v.","definition":{"en":"to bounce or spring up suddenly","zh":"（突然）弹起；蹦起"},"examples":[{"en":"The toy boinged off the couch and onto the rug.","zh":"玩具从沙发上弹下来，落到地毯上。"},{"en":"My chair cushion boinged back after I stood up.","zh":"我站起来后，椅垫又弹回原状。"}]}],"synonyms":["bounce","spring","rebound","sproing"],"phonetic":"/bɔɪŋ/","extraExplanation":["“boing”多用于口语和拟声，带有轻松、幽默的卡通感。在正式写作中较少用，常见替代词有 bounce、spring back、rebound。"]}
{"word":"Boiotia","summary":{"en":"Boiotia is an ancient region in central Greece (also spelled Boeotia), best known for Thebes and its role in Greek myth and history.","zh":"Boiotia（亦作 Boeotia）是古希腊中部的地区，以底比斯及其在希腊神话与历史中的重要性最为著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) An ancient region in central Greece, northwest of Athens, historically known for cities such as Thebes.","zh":"（专有名词）古希腊中部的一个地区，位于雅典西北，历史上以底比斯（Thebes）等城邦闻名。"},"examples":[{"en":"Thebes was one of the most powerful cities in ancient Boiotia.","zh":"底比斯曾是古代玻俄提亚（Boiotia）最强大的城市之一。"},{"en":"Many Greek myths and tragedies are set in Boiotia, especially around Thebes.","zh":"许多希腊神话与悲剧的故事背景在玻俄提亚（Boiotia），尤其围绕底比斯展开。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common; literary/historical) A spelling of “Boeotia,” sometimes used in academic or transliterated contexts.","zh":"（较少见；文学/历史语境）“Boeotia”的一种拼写形式，常见于学术写作或音译体系中。"},"examples":[{"en":"Some textbooks write the region as Boeotia, while others use Boiotia.","zh":"有些教材写作 Boeotia，也有的写作 Boiotia。"}]}],"synonyms":["Boeotia"],"phonetic":"/bɔɪˈoʊʃə/","extraExplanation":["“Boiotia / Boeotia”源自希腊语“Βοιωτία”。英文里常见拼写是 Boeotia；Boiotia 多见于更贴近希腊语转写的写法。","在古典雅典人的刻板印象中，“Boeotian（玻俄提亚人）”有时被用来讽刺“迟钝、缺乏文化修养”，属于历史语境下的地域偏见；现代写作中使用这层含义要注意语气与场合。","玻俄提亚最著名的城邦是底比斯（Thebes），与俄狄浦斯（Oedipus）、安提戈涅（Antigone）等悲剧传统密切相关。"]}
{"word":"Bois","summary":{"en":"“Bois” most commonly means “boys” in playful internet slang; it can also be French for “woods/wood” in certain contexts.","zh":"“Bois”最常见是网络俚语里“boys（男生/哥们儿）”的调侃拼写；在特定语境中也可能是法语里的“树林/木材”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, internet slang) A playful or ironic spelling of “boys,” often used to refer to a group of male friends or guys.","zh":"（非正式/网络俚语）“boys”的戏谑或调侃拼写，常用来指一群男生、哥们儿。"},"examples":[{"en":"Game night with the bois.","zh":"和哥们儿们的游戏之夜。"},{"en":"The bois are coming over later.","zh":"哥们儿们晚点会过来。"},{"en":"We did it, bois!","zh":"我们成功了，兄弟们！"}]},{"partOfSpeech":"n.","definition":{"en":"(French, plural noun) “Woods” or “timber”; the plural of French “bois” (wood). In English texts, it may appear in names or French phrases.","zh":"（法语，复数名词）“树林/木材”；法语“bois”（木头/树林）的复数。在英语中多见于法语短语或专有名词中。"},"examples":[{"en":"The menu mentions sauce made with mushrooms from the bois nearby.","zh":"菜单提到酱汁用到了附近树林里的蘑菇。"},{"en":"They studied French place names like Bois de Boulogne.","zh":"他们学习了像“布洛涅森林（Bois de Boulogne）”这样的法语地名。"}]}],"synonyms":["boys","guys","dudes"],"phonetic":"/bɔɪz/","extraExplanation":["在英语网络文化里，bois常带一点“中二/搞笑”的语气（类似自嘲或热血喊话），常见于梗图、游戏语境和社交媒体。","注意场合：正式写作或正式对话里一般不用bois，改用boys或guys更自然。","拼写上也常见变体如boi（单数）/da bois（更口语、更梗）。"]}
{"word":"bois","summary":{"en":"“Bois” usually means “boys” in playful internet slang; it can also be French for “wood.”","zh":"“bois”通常是网络俚语，幽默地写作“boys（哥们儿/男孩们）”；也可能是法语“木头/木材”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Slang spelling of “boys,” used humorously or casually (often online) to refer to a group of male friends.","zh":"“boys（男孩们/哥们儿）”的网络俚语拼写，常带幽默或随意语气，用来指一群男性朋友。"},"examples":[{"en":"Game night with the bois.","zh":"和哥们儿一起游戏之夜。"},{"en":"The bois are coming over later.","zh":"哥们儿一会儿要过来。"},{"en":"We did it, bois!","zh":"我们成功了，兄弟们！"}]},{"partOfSpeech":"n.","definition":{"en":"“Wood” in French; sometimes seen in English in names or labels (e.g., “bois” on a product meaning it’s made of wood).","zh":"法语里的“木头/木材”；在英语语境中有时会出现在名称或标签上（比如商品写“bois”表示木质）。"},"examples":[{"en":"The label says “bois,” meaning the handle is wooden.","zh":"标签写着“bois”，意思是把手是木制的。"},{"en":"It’s a French term: “bois” = wood.","zh":"这是个法语词：“bois”= 木头。"}]}],"synonyms":["boys","guys","friends","wood (French meaning)"],"phonetic":"/bɔɪz/","extraExplanation":["“the bois”常见于网络梗和口语，语气更像“哥几个/兄弟们”，带一点调侃或亲密感。正式写作中一般不要用，用“boys/guys/friends”更合适。","在部分语境里，“bois”也可能是人名/地名的一部分（如法语姓氏或地名），此时不一定表示“男孩们”或“木头”，要看上下文。"]}
{"word":"Bois-le-Duc","summary":{"en":"Bois-le-Duc is the French historical name for the Dutch city ’s‑Hertogenbosch (Den Bosch).","zh":"Bois-le-Duc 是荷兰城市 ’s‑Hertogenbosch（Den Bosch）的法语旧称/别称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historic French name for the Dutch city of ’s‑Hertogenbosch (also commonly called Den Bosch), in the province of North Brabant, Netherlands.","zh":"荷兰北布拉班特省城市“斯海尔托亨博斯”（常称 Den Bosch）的法语旧称/别称。"},"examples":[{"en":"The painter Hieronymus Bosch was born in Bois-le-Duc, now called ’s‑Hertogenbosch (Den Bosch).","zh":"画家耶罗尼米斯·博斯出生在 Bois-le-Duc（今称 ’s‑Hertogenbosch / Den Bosch）。"},{"en":"Some older English and French texts refer to the city as Bois-le-Duc.","zh":"一些较早的英文或法文资料会把这座城市写作 Bois-le-Duc。"}]}],"synonyms":["’s‑Hertogenbosch","Den Bosch"],"phonetic":"/ˌbwɑ lə ˈdʊk/","extraExplanation":["“Bois-le-Duc”字面意思接近“公爵的森林”，对应荷兰语地名 ’s‑Hertogenbosch（意为“公爵的树林/森林”）。","在现代用法中，这个法语名称较少见；旅行、地图与荷兰本地更常用 ’s‑Hertogenbosch 或 Den Bosch。"]}
{"word":"Boisdarc","summary":{"en":"“Bois d’arc” is a regional U.S. name for the Osage orange tree, or for its very hard wood used for bows and fence posts.","zh":"“Bois d’arc”是美国部分地区对奥塞奇橙（刺果桑）及其坚硬木材的称呼，常与制弓和做栅栏柱有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tree (Osage orange) whose very hard wood was traditionally used to make bows; also used for strong fence posts","zh":"一种树（奥塞奇橙/刺果桑），木材非常坚硬，传统上用来做弓；也常用来做结实的栅栏柱"},"examples":[{"en":"In Texas, people sometimes call the Osage orange tree “bois d’arc.”","zh":"在德州，人们有时把奥塞奇橙这棵树叫作“bois d’arc”。"},{"en":"Bois d’arc wood is prized because it’s tough and long-lasting.","zh":"人们看重bois d’arc木材，因为它结实耐用。"}]},{"partOfSpeech":"n.","definition":{"en":"the wood from that tree, especially when used for making bows or durable outdoor posts","zh":"指这种树的木材，尤指用来制弓或制作耐用的户外柱材"},"examples":[{"en":"He carved a bow from bois d’arc.","zh":"他用bois d’arc木材雕刻了一把弓。"}]}],"synonyms":["Osage orange","hedge apple (fruit)","bodark (variant spelling)"],"phonetic":"/ˌbɔɪˈdɑrk/","extraExplanation":["“Bois d’arc”来自法语，字面意思是“弓木”（bois=木；arc=弓）。在美国南部（尤其德州、路易斯安那、俄克拉荷马一带）常作为地方称呼使用。","这种树的果实外形像绿色的“脑纹球”，在口语里也常被叫作“hedge apple（篱笆苹果）”。虽然果实不常作为食物，但树木常被种作防风篱或围栏用。","英文书写常见多种形式：bois d’arc / bois d’arc tree / bodark / bowdark；你写的“Boisdarc”也可能是把空格和撇号省略后的拼法。"]}
{"word":"Boise","summary":{"en":"Boise is the capital and largest city of Idaho, USA.","zh":"Boise 指美国爱达荷州的首府及最大城市（博伊西）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The capital and largest city of Idaho, in the northwestern United States.","zh":"（美国）博伊西：爱达荷州首府及最大城市，位于美国西北部地区。"},"examples":[{"en":"Boise is the capital city of Idaho.","zh":"博伊西是爱达荷州的首府。"},{"en":"She moved to Boise for a new job.","zh":"她为了新工作搬到了博伊西。"},{"en":"We flew into Boise and drove to the mountains.","zh":"我们飞到博伊西，然后开车去山区。"}]}],"synonyms":["Boise, Idaho"],"phonetic":"/ˈbɔɪsi/","extraExplanation":["“Boise”在英语里通常读作 /ˈbɔɪsi/（听起来像“BOY-see”），不要读成“boy-z”。","地名“Boise”来自法语词根（与 boisé“多树的、林木繁茂的”有关），因此有“树木茂盛的地方”之意；这也和当地著名的树木成荫、河谷景观相呼应。","写作时通常大写（Boise），因为它是专有名词（地名）。"]}
{"word":"boise","summary":{"en":"Boise is the capital and largest city of Idaho, USA.","zh":"Boise 指美国爱达荷州的首府兼最大城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The capital and largest city of the U.S. state of Idaho, in the northwestern United States.","zh":"美国爱达荷州的首府兼最大城市，位于美国西北部。"},"examples":[{"en":"Boise is the capital of Idaho.","zh":"博伊西是爱达荷州的首府。"},{"en":"She moved to Boise for a new job.","zh":"她为了新工作搬到了博伊西。"}]}],"phonetic":"/ˈbɔɪsi/","extraExplanation":["读音提示：虽然拼写以 -se 结尾，但 Boise 常读作“BOY-see”（/ˈbɔɪsi/）。","词源小知识：地名常被认为与法语 boisé（意为“多树的、林木茂密的”）有关，反映早期探险者对当地河谷树木繁盛的印象。"]}
{"word":"boiserie","summary":{"en":"Boiserie means decorative wooden wall paneling, especially in a French classic style.","zh":"boiserie 指装饰性的木护墙板/雕花木墙板，常带法式古典风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Decorative wood paneling or carved wooden wall coverings used in interior design, often in a classic French style.","zh":"（室内设计中的）木护墙板；雕花木墙板（常见于法式古典风格装饰）。"},"examples":[{"en":"The living room felt elegant with white boiserie framing the walls.","zh":"客厅的墙面用白色木护墙板装饰，看起来很优雅。"},{"en":"The hotel restored the original boiserie to match the 18th-century décor.","zh":"酒店修复了原有的木墙板，以符合18世纪的装饰风格。"}]}],"synonyms":["wood paneling","wainscoting","wall paneling"],"phonetic":"/ˌbwɑːzəˈriː/","extraExplanation":["“boiserie”源自法语，和“bois（木材）”有关，常用于描述法式古典室内的墙面木作装饰（尤其是精细的线条、雕刻与分框）。英语里多用于设计、建筑与艺术史语境。","在英语写作中它常带有“精致、古典、宫廷感”的文化联想；现代室内设计也会用它来指仿古的墙面木作造型（不一定是真实古董）。"]}
{"word":"boiseries","summary":{"en":"Boiseries are decorative wooden wall panels used to ornament interiors, often in classic European styles.","zh":"Boiseries指用于装饰室内墙面的木质护墙板/墙板，常见于欧式古典风格空间。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"decorative wood paneling (often carved or molded) used to cover and ornament interior walls, especially in elegant or historic rooms.","zh":"（室内的）装饰性木质护墙板；（常带雕刻或线脚的）墙面木饰板，多见于优雅或历史建筑的室内。"},"examples":[{"en":"The museum restored the room’s boiseries to match the 18th-century style.","zh":"博物馆修复了房间里的木饰护墙板，使其符合18世纪的风格。"},{"en":"The apartment has white-painted boiseries that make the walls look more formal.","zh":"这套公寓有刷成白色的木饰护墙板，让墙面看起来更正式。"},{"en":"In the palace, gilded boiseries frame the mirrors and doors.","zh":"在宫殿里，鎏金的木饰护墙板勾勒出镜子和门的边框。"}]}],"synonyms":["wood paneling","wainscoting","wall paneling"],"phonetic":"/ˌbwɑːzəˈriː/","extraExplanation":["“Boiseries”是法语借词（源自bois“木材”），常用于谈论法式或欧式古典室内设计。英语里它多以复数形式出现（boiseries），即使指一整套木饰墙板。","在艺术史与建筑语境中，你常会在描述凡尔赛风格、洛可可（Rococo）或新古典主义（Neoclassical）室内时看到这个词。相关搭配：carved/molded/painted/gilded boiseries。"]}
{"word":"Boishakh","summary":{"en":"Boishakh is the first month of the Bengali calendar, linked to the Bengali New Year (Pohela Boishakh).","zh":"Boishakh 是孟加拉历的第一个月，并与孟加拉新年（Pohela Boishakh）相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the first month of the Bengali calendar (often spelled Baishakh/Baisakh), usually falling around mid-April to mid-May; closely associated with the Bengali New Year celebration (Pohela Boishakh).","zh":"孟加拉历的第一个月（也常拼作 Baishakh/Baisakh），大致对应公历4月中旬到5月中旬；与孟加拉新年（Pohela Boishakh）密切相关。"},"examples":[{"en":"Pohela Boishakh is celebrated on the first day of Boishakh.","zh":"孟加拉新年在 Boishakh 的第一天庆祝。"},{"en":"In Bangladesh, many people wear traditional clothes during Boishakh festivities.","zh":"在孟加拉国，许多人在 Boishakh 的庆祝活动中穿传统服饰。"},{"en":"My friend invited me to a Boishakh parade and street fair.","zh":"朋友邀请我去参加 Boishakh 的游行和街头市集。"}]}],"synonyms":["Baishakh","Baisakh"],"phonetic":"/ˈbɔɪʃɑːk/","extraExplanation":["“Boishakh/Baishakh/Baisakh”是从孟加拉语转写到英语的不同拼法，指同一个月份。","在文化语境中，Boishakh 常让人联想到“Pohela Boishakh（孟加拉新年）”，包括游行、音乐、传统美食与节庆装饰等。"]}
{"word":"boisseau","summary":{"en":"Boisseau is a French term meaning a traditional dry measure, roughly like a bushel; it can also refer to a bushel-shaped symbol in heraldry.","zh":"Boisseau 是法语词，指一种传统干量单位（大致相当于蒲式耳）；也可指纹章学中“蒲式耳量器”形状的图案符号。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a French unit of dry measure (historically for grain, salt, etc.), roughly comparable to a bushel; in modern contexts it may refer generally to a “bushel” in French-speaking regions.","zh":"（法语）一种传统的干量单位（常用于谷物、盐等），大致相当于“蒲式耳”；在现代语境中也可泛指法语地区所说的“bushel（蒲式耳）”。"},"examples":[{"en":"The contract listed the harvest in boisseaux of wheat.","zh":"合同用“小麦的 boisseaux（蒲式耳）”来标注收成。"},{"en":"In old market records, prices were sometimes given per boisseau.","zh":"在旧市场记录里，价格有时按每 boisseau 来计算。"}]},{"partOfSpeech":"n.","definition":{"en":"(heraldry) a stylized container shaped like a bushel measure, used as a symbol on coats of arms.","zh":"（纹章学）一种被图案化的“蒲式耳量器”形状的容器，用作纹章（家族徽章）上的符号。"},"examples":[{"en":"The shield features a boisseau as part of the family’s crest.","zh":"这面盾徽把 boisseau 作为家族徽章元素之一。"}]}],"synonyms":["bushel"],"phonetic":"/bwɑˈsoʊ/","extraExplanation":["“boisseau”是法语词，来源与“箱/量器”有关，最常见的学习方式是把它理解为法语里的“bushel（蒲式耳）”。不同地区和不同时期的boisseau容量可能不完全一致，因此在历史文本或贸易记录中常需结合上下文（地点、年代、商品）判断具体大小。"]}
{"word":"boisseaux","summary":{"en":"Boisseaux is the French plural of boisseau, a historical dry-volume unit roughly comparable to “bushels.”","zh":"Boisseaux 是法语中 boisseau 的复数，指一种历史上的干货容量单位，英文常按“蒲式耳”来理解。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of French *boisseau*; a historical French measure of dry volume, often translated as “bushels” in English (used for grain and other dry goods).","zh":"法语 *boisseau* 的复数；一种历史上的法国干货容量单位，常在英文中译作“蒲式耳”（多用于谷物等干货）。"},"examples":[{"en":"The record lists 30 boisseaux of wheat paid as rent.","zh":"记录中写道：以30个boisseaux（约合若干“蒲式耳”）的小麦作为租金。"},{"en":"In older texts, boisseaux may appear when describing harvest yields in France.","zh":"在较早的文本中，提到法国的收成产量时可能会出现 boisseaux 这个单位。"}]}],"synonyms":["bushels (approx.)","boisseau (singular)"],"phonetic":"/bwɑˈsoʊ/","extraExplanation":["“boisseaux”主要见于法语或涉及法国历史/农业/税契的英文材料里；现代英语更常直接写 *bushels*。","不同地区与时期的 *boisseau* 实际容量可能不完全一致，所以在翻译或换算时常需要参考具体年代与地区的标准。"]}
{"word":"Boissevain","summary":{"en":"Boissevain is mainly used as a surname and as the name of a small town in Manitoba, Canada.","zh":"Boissevain 主要用作姓氏，也指加拿大马尼托巴省的一个小镇/社区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), often found in Dutch- and French-influenced communities; used to refer to people with this last name.","zh":"（姓氏）博伊斯凡（Boissevain），常见于受荷兰语与法语影响的地区；用来指姓“Boissevain”的人。"},"examples":[{"en":"Dr. Boissevain presented the research at the conference.","zh":"Boissevain 博士在会议上展示了这项研究。"},{"en":"She signed the email as ‘A. Boissevain.’","zh":"她在邮件末尾署名为 “A. Boissevain”。"}]},{"partOfSpeech":"n.","definition":{"en":"Boissevain: a small town/community in southwestern Manitoba, Canada, near the U.S. border (often mentioned with local prairie history and rail-era settlement).","zh":"（地名）加拿大马尼托巴省西南部的小镇/社区 Boissevain，靠近美国边境（常与草原地区历史、铁路时代的定居发展相关）。"},"examples":[{"en":"They drove to Boissevain for the weekend festival.","zh":"他们开车去 Boissevain 参加周末的节庆活动。"},{"en":"Boissevain is known for its prairie scenery and small-town feel.","zh":"Boissevain 以草原风光和小镇氛围而闻名。"}]}],"phonetic":"/ˈbɔɪsveɪn/","extraExplanation":["“Boissevain”多被当作专有名词使用：要么是姓氏，要么是地名。作为姓氏时，常被认为与欧洲（尤其是法语/荷兰语文化圈）有关；在英语语境里通常不翻译，只音译或直接保留拼写。","作为加拿大地名时，常见于旅游介绍、地方新闻或历史资料中；读写时注意首字母大写。"]}
{"word":"boist","summary":{"en":"“Boist” is a rare word: it can mean “to boast” (archaic), or in Scottish dialect it can mean “a box/container.”","zh":"“boist”是个罕见词：可作古语表示“自夸”，也可在苏格兰方言中表示“盒子/容器”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(rare/archaic) To boast; to talk with too much pride about yourself or what you have done.","zh":"（罕见/古语）夸口；自夸；过分自豪地谈论自己或自己的成就。"},"examples":[{"en":"He would boist about his victories, even when no one asked.","zh":"即使没人问，他也会夸口自己的胜利。"},{"en":"Try not to boist—let your work speak for itself.","zh":"尽量别自夸——让你的成果自己说话。"}]},{"partOfSpeech":"n.","definition":{"en":"(Scotland, dialect) A box or small container (similar to “box”).","zh":"（苏格兰方言）盒子；小箱子；小容器。"},"examples":[{"en":"She kept the letters in a small boist.","zh":"她把信件放在一个小盒子里保存。"}]}],"synonyms":["boast","brag","show off","box","container"],"phonetic":"/bɔɪst/","extraExplanation":["“boist”在现代标准英语里非常少见。很多情况下，它是“boast”（/boʊst/，意为“自夸”）的拼写错误或旧式拼写。","方言名词义“盒子”常见于苏格兰英语（Scots），来源与法语 boîte（盒子）有关。学习时更常用的标准词是“box”。"]}
{"word":"boisterous","summary":{"en":"Boisterous describes people or situations that are loudly energetic, and it can also describe rough, stormy weather or seas.","zh":"Boisterous形容人或场面喧闹而充满活力；也可形容天气或海面狂风汹涌。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Noisy, energetic, and cheerful; full of lively activity.","zh":"喧闹而充满活力的；热闹欢快的。"},"examples":[{"en":"The children were boisterous after the birthday cake.","zh":"孩子们吃完生日蛋糕后变得又吵又兴奋。"},{"en":"A boisterous crowd filled the street after the game.","zh":"比赛结束后，一群喧闹的人挤满了街道。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of weather or the sea) Rough and stormy; strongly agitated.","zh":"（指天气或海面）狂风大作的；汹涌的。"},"examples":[{"en":"Boisterous winds shook the windows all night.","zh":"狂风整夜摇晃着窗户。"},{"en":"The fishermen stayed in port because of the boisterous sea.","zh":"由于海面汹涌，渔民们留在港口不出海。"}]}],"synonyms":["lively","noisy","rowdy","high-spirited","clamorous","uproarious","stormy","rough"],"phonetic":"/ˈbɔɪstərəs/","extraExplanation":["“boisterous”常用来形容“吵闹但不一定令人讨厌”的热闹场面（常带一点正面或中性语气），但若用于正式场合也可能暗示“太吵、太失控”。","近义词细微差别：loud偏“声音大”；rowdy偏“粗野、闹事”；uproarious偏“哄堂大笑、极其热闹”。"]}
{"word":"boisterously","summary":{"en":"Boisterously means ‘in a loud, energetic, noisy way.’","zh":"boisterously 表示“喧闹地、热闹地、大声而有活力地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a very loud, energetic, and noisy way (often cheerful, but sometimes a bit rough or rowdy).","zh":"喧闹地；热闹地；大声而精力充沛地（常带愉快感，但有时也显得粗鲁或吵闹）。"},"examples":[{"en":"The children boisterously ran around the playground.","zh":"孩子们在操场上喧闹地跑来跑去。"},{"en":"They laughed boisterously at his joke.","zh":"他们听了他的笑话后放声大笑。"},{"en":"Fans cheered boisterously when the team scored.","zh":"球队得分时，球迷们热烈喧闹地欢呼。"}]}],"synonyms":["loudly","noisily","rowdily","uproariously","energetically"],"phonetic":"/ˈbɔɪstərəsli/","extraExplanation":["“boisterously”来自形容词“boisterous”（喧闹的、活力十足的、吵嚷的）。它通常形容气氛或行为很有劲、声音很大；在正式场合可能带一点“太吵、失礼”的负面含义。","常见搭配：laugh/cheer/sing boisterously（放声大笑/喧闹地欢呼/高声唱歌）。在写作里，它能快速营造“热烈、吵闹、人多”的场景。"]}
{"word":"boisterousness","summary":{"en":"Boisterousness means noisy, high-energy liveliness—sometimes cheerful, sometimes overly rowdy and disruptive.","zh":"Boisterousness 指喧闹而充满活力的状态；可表示热闹欢快，也可指过度吵闹、扰人的闹腾。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being very loud, energetic, and noisy (often in a cheerful or playful way).","zh":"喧闹（常带有兴奋、欢快或顽皮）的特质；吵闹活跃的状态。"},"examples":[{"en":"The boisterousness of the crowd made it hard to hear the announcements.","zh":"人群的喧闹让人很难听清广播通知。"},{"en":"Their boisterousness filled the room as they sang and laughed together.","zh":"他们一起唱歌大笑，喧闹的气氛充满了整个房间。"}]},{"partOfSpeech":"n.","definition":{"en":"Rough, overly rowdy behavior that may be disruptive or out of control.","zh":"过于吵闹、粗鲁的闹腾行为（可能造成打扰或失控）。"},"examples":[{"en":"The teacher warned them that their boisterousness was disturbing the class next door.","zh":"老师警告他们：他们的吵闹已经影响到隔壁班上课了。"},{"en":"The restaurant asked the group to quiet down because of their boisterousness.","zh":"餐厅请那群人小声点，因为他们太闹腾了。"}]}],"synonyms":["rowdiness","liveliness","high spirits","uproar","noisiness"],"phonetic":"/ˈbɔɪstərəsnəs/","extraExplanation":["“boisterousness”来自形容词“boisterous”（喧闹的、活跃的），后缀“-ness”表示“性质/状态”。在语气上，它既可中性（热闹、欢快），也可偏负面（太吵、影响他人），通常要看上下文。","近义词区分：\"loudness\"更偏“音量大”；\"rowdiness\"更偏“吵闹+失序/惹事”；\"high spirits\"更偏“情绪高涨”（更正面）。"]}
{"word":"boistous","summary":{"en":"Boisterous describes something loud, energetic, and lively; it can also mean rough and stormy (especially weather or seas).","zh":"boisterous 指“喧闹、精力充沛、热闹的”；也可指（天气/海况）“狂暴、汹涌的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Noisy, energetic, and cheerful; full of loud activity.","zh":"喧闹而精力充沛的；热闹欢快的（常带有“声音很大、很兴奋”的感觉）。"},"examples":[{"en":"The children were boisterous at the birthday party.","zh":"孩子们在生日派对上闹哄哄、特别兴奋。"},{"en":"A boisterous crowd filled the stadium after the win.","zh":"球队获胜后，一群喧闹的观众挤满了体育场。"},{"en":"Her boisterous laugh made everyone smile.","zh":"她那爽朗又响亮的笑声让大家都笑了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Rough, strong, and noisy (often used for weather or seas).","zh":"（多形容天气/海况）狂暴的；猛烈且喧响的。"},"examples":[{"en":"Boisterous winds knocked over a few small trees.","zh":"狂风把几棵小树刮倒了。"},{"en":"The boat struggled in the boisterous sea.","zh":"小船在汹涌的海面上艰难前行。"}]}],"synonyms":["lively","noisy","rowdy","high-spirited","stormy","turbulent"],"phonetic":"/ˈbɔɪstərəs/","extraExplanation":["你输入的“boistous”常见拼写错误；正确拼写是 **boisterous**。","词语常带轻微语气：形容人群/孩子时多为“热闹、吵闹但不一定坏”；形容风浪时则偏“猛烈、难以控制”。"]}
{"word":"boistously","summary":{"en":"Boisterously means “in a loud, energetic, sometimes unruly way.”","zh":"boisterously 指“喧闹地、精力充沛地（有时有点失控）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a noisy, energetic, and sometimes rough or uncontrolled way.","zh":"喧闹地；精力充沛地（有时带点粗鲁或失控的感觉）。"},"examples":[{"en":"The kids laughed boisterously at the party.","zh":"孩子们在派对上喧闹地大笑。"},{"en":"The crowd cheered boisterously when the team scored.","zh":"球队进球时，人群喧闹地欢呼。"},{"en":"He spoke boisterously, filling the whole room with his voice.","zh":"他说话很喧闹，声音几乎充满了整个房间。"}]}],"synonyms":["loudly","noisily","rowdily","uproariously","energetically"],"phonetic":"/ˈbɔɪstərəsli/","extraExplanation":["你输入的“boistously”常见为拼写错误，正确拼写是 **boisterously**（来自形容词 **boisterous**）。","**boisterously** 通常是“热闹、有活力”的中性或偏正面描述；但如果场合需要安静（课堂、图书馆、会议），它也可能带有“太吵、太闹”的负面评价。"]}
{"word":"boistousness","summary":{"en":"Boisterousness means noisy, high-spirited liveliness, sometimes to the point of being rough or unruly.","zh":"Boisterousness 指喧闹又充满活力的热闹劲儿；有时也暗示吵闹、粗鲁或失控。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Noisy, energetic, and cheerful behavior; high-spirited liveliness that can be a bit loud.","zh":"喧闹而充满活力的举动；热闹、兴高采烈但可能有点吵的气氛/行为。"},"examples":[{"en":"The boisterousness of the children made the classroom feel lively but hard to manage.","zh":"孩子们的喧闹让教室很有活力，但也很难管理。"},{"en":"Her boisterousness at the party drew attention, and some guests loved it.","zh":"她在派对上的热闹劲儿很吸睛，有些客人很喜欢。"}]},{"partOfSpeech":"n.","definition":{"en":"Rough or unruly loudness, sometimes suggesting a lack of control or manners.","zh":"粗鲁或失控的喧哗（有时带有“没礼貌/不受约束”的含义）。"},"examples":[{"en":"The restaurant asked the group to quiet down because their boisterousness was disturbing other diners.","zh":"餐厅请那群人小声点，因为他们的喧哗打扰了其他食客。"},{"en":"What started as laughter turned into boisterousness and a minor argument.","zh":"一开始是笑声，后来变成喧闹，甚至引发了一点争执。"}]}],"synonyms":["liveliness","rowdiness","noisiness","high spirits","uproar","ruckus"],"phonetic":"/ˈbɔɪstərəsnəs/","extraExplanation":["你输入的 **boistousness** 常见拼写应为 **boisterousness**（来自形容词 *boisterous* “喧闹的、活泼的” + 名词后缀 *-ness*）。","语气上，*boisterousness* 可以是褒义（热闹、有活力），也可以是略带贬义（吵闹、失控）；看上下文和说话人的态度。"]}
{"word":"boite","summary":{"en":"Boite usually means a small, stylish restaurant or nightclub; more rarely, it can mean a box (from French).","zh":"Boite 通常指小而时髦的餐馆或夜总会；较少见时也可指“盒子”（源自法语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, fashionable restaurant or nightclub (a French loanword)","zh":"（法语借词）小而时髦的餐馆或夜总会"},"examples":[{"en":"They went to a little boite downtown after the show.","zh":"演出结束后，他们去市中心一家小而时髦的夜店。"},{"en":"The singer got her start performing in boites and bars.","zh":"那位歌手最初是在小夜店和酒吧演出起步的。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare in English) a box or small container","zh":"（英语中较少见）盒子；小容器"},"examples":[{"en":"He kept the letters in a small boite.","zh":"他把信件收在一个小盒子里。"}]}],"synonyms":["nightclub","club","bistro","cafe","lounge"],"phonetic":"/bwɑt/","extraExplanation":["“boite”常见于写作中，源自法语“boîte”（意为“盒子”）。在英文语境里，它更常指“时髦的小餐馆/夜总会”，带一点法式、复古或文艺气息。","有时会写作带变音符的“boîte”。英语里很多场合会省略变音符，写成“boite”。"]}
{"word":"boites","summary":{"en":"“Boites” means small, fashionable nightclubs/cabarets or restaurants (plural of “boîte”).","zh":"“boites”指小型、时髦的夜总会/歌舞酒吧或餐馆，是“boîte”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of \"boîte\": a small, fashionable nightclub, cabaret, or restaurant (often with music and dancing).","zh":"“boîte”的复数：指小型、时髦的夜总会/歌舞表演场所或餐馆（常有音乐与舞池）。"},"examples":[{"en":"The city is full of trendy boites where you can hear live jazz.","zh":"这座城市到处都是时髦的小夜店，你可以在那里听现场爵士乐。"},{"en":"They went from one boite to another until late at night.","zh":"他们一家接一家地跑夜店，一直玩到深夜。"}]}],"synonyms":["nightclubs","cabarets","clubs","lounges"],"phonetic":"/bwɑt/","extraExplanation":["“boîte”是法语借词，原意是“盒子”，在英语里常用来指“小而时髦的夜生活场所”。复数写作 boites（有时也写作 boîtes）。","在英文文本里，这个词带一点“欧陆风情/文艺氛围”的感觉，常见于旅行写作、娱乐新闻或较有格调的描述。"]}
{"word":"boithrin","summary":{"en":"Boithrin means a small, narrow country road or lane (Irish origin).","zh":"boithrin 指狭窄的乡间小路（源自爱尔兰语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Irish, often used in Ireland/Irish English) a small road; a narrow country lane.","zh":"（爱尔兰语词，常见于爱尔兰/爱尔兰英语）小路；狭窄的乡间小道。"},"examples":[{"en":"We turned off the main road and followed a quiet boithrin through the fields.","zh":"我们离开大路，沿着一条穿过田野的安静小路走。"},{"en":"The cottage is at the end of a boithrin, so drive slowly.","zh":"那间小屋在一条小路尽头，所以开车要慢点。"},{"en":"Locals call it a boithrin, but on the map it looks like just a thin line.","zh":"当地人叫它“小路”，但在地图上看起来只是一条细线。"}]}],"synonyms":["lane","country lane","byway","narrow road"],"phonetic":"/boʊˈriːn/","extraExplanation":["“boithrin”多见于对爱尔兰语“bóithrín”（更常见的拼写）的一种不带重音符号的写法；其中“-ín”是爱尔兰语常见的“小、可爱”的指小后缀，所以整体有“小路/小径”的感觉。","在爱尔兰的地名、乡村语境或文学描写里常出现，用来营造乡间、田野、石墙与小径的氛围。英语里也常把它拼作“boreen”。"]}
{"word":"Boito","summary":{"en":"Boito usually refers to Arrigo Boito, the Italian librettist of Verdi’s *Otello* and *Falstaff*; it can also be a surname.","zh":"Boito 通常指意大利歌剧剧本作者阿里戈·博伊托（威尔第《奥赛罗》《法尔斯塔夫》的剧作者）；也可作为姓氏使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) Arrigo Boito (1842–1918), an Italian poet, composer, and—most famously—opera librettist. He wrote the librettos for Verdi’s operas *Otello* and *Falstaff*.","zh":"（专有名词）阿里戈·博伊托（1842–1918），意大利诗人、作曲家，最著名的身份是歌剧剧本作者（写歌剧唱词/脚本）。他为威尔第的歌剧《奥赛罗》和《法尔斯塔夫》撰写剧本。"},"examples":[{"en":"Boito wrote the libretto for Verdi’s *Otello*.","zh":"博伊托为威尔第的《奥赛罗》撰写了歌剧剧本。"},{"en":"In music history class, we learned how Boito helped shape late Verdi’s operas.","zh":"在音乐史课上，我们学习了博伊托如何影响威尔第晚期歌剧的创作。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname: someone may be named “Boito.”","zh":"一个姓氏：有人可能姓“Boito/博伊托”。"},"examples":[{"en":"Mr. Boito will speak at the concert tonight.","zh":"博伊托先生将于今晚的音乐会上发言。"}]}],"phonetic":"/ˈbɔɪtoʊ/","extraExplanation":["“Boito”在英语语境里通常指阿里戈·博伊托（Arrigo Boito）。他不只是写词的人：在歌剧传统中，librettist（剧本作者）会深刻影响作品的戏剧结构与语言风格。","如果你在乐评或节目单看到“Boito”，多半是在“Verdi–Boito”这样的搭配中，强调作曲家与剧作家的合作关系。"]}

