{"word":"Bojardo","summary":{"en":"Bojardo usually refers to the Italian Renaissance poet Matteo Maria Boiardo, or is a spelling variant of the surname Boiardo.","zh":"Bojardo通常指意大利文艺复兴诗人马泰奥·玛丽亚·博亚尔多，或是姓氏Boiardo的一种拼写变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Matteo Maria Boiardo (1441–1494), an Italian Renaissance poet and nobleman, best known for the chivalric epic poem *Orlando Innamorato* (“Orlando in Love”).","zh":"马泰奥·玛丽亚·博亚尔多（1441–1494），意大利文艺复兴时期的诗人和贵族，最著名的作品是骑士史诗《恋爱的奥兰多》（*Orlando Innamorato*）。"},"examples":[{"en":"Boiardo’s *Orlando Innamorato* helped shape the later tradition of Italian romantic epics.","zh":"博亚尔多的《恋爱的奥兰多》推动了后来意大利浪漫史诗传统的发展。"},{"en":"In literature class, we compared Boiardo with Ariosto to see how the Orlando stories evolved.","zh":"在文学课上，我们把博亚尔多和阿里奥斯托作比较，看看奥兰多故事是如何演变的。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname (family name), especially associated with the Italian name “Boiardo”; “Bojardo” is sometimes seen as a spelling variant in other languages or transliterations.","zh":"姓氏（家族名），通常与意大利姓“Boiardo”相关；“Bojardo”有时会作为其他语言或转写体系中的拼写变体出现。"},"examples":[{"en":"The museum label listed the artist as Bojardo, but the catalog used Boiardo.","zh":"博物馆标签写的是Bojardo，但图录里用的是Boiardo。"}]}],"synonyms":["Boiardo","Matteo Maria Boiardo"],"phonetic":"/bɔɪˈɑrdoʊ/","extraExplanation":["“Bojardo”更常见于非意大利语语境下的拼写（例如某些斯拉夫语言或旧式转写），而意大利原拼通常是“Boiardo”。检索资料时可以两种拼写都试。","博亚尔多的《恋爱的奥兰多》在题材与人物上影响了阿里奥斯托的《疯狂的奥兰多》（*Orlando Furioso*），后者在英语世界更常被阅读与引用。"]}
{"word":"Bojer","summary":{"en":"“Bojer” is usually a surname; it can also refer to the Norwegian writer Johan Bojer.","zh":"“Bojer”通常是姓氏；也可指挪威作家约翰·博耶（Johan Bojer）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A surname (family name). In English contexts it is often pronounced similarly to “Boyer.”","zh":"姓氏（家族名）。在英语语境中常被读得类似于“Boyer”。"},"examples":[{"en":"Dr. Bojer will give a talk on Friday.","zh":"Bojer 医生将于周五做报告。"},{"en":"I’m emailing Ms. Bojer about the schedule.","zh":"我正在给 Bojer 女士发邮件询问日程。"}]},{"partOfSpeech":"other","definition":{"en":"Johan Bojer (1872–1959), a Norwegian novelist and playwright known for writing about Norwegian coastal and working-class life.","zh":"约翰·博耶（Johan Bojer，1872–1959），挪威小说家与剧作家，以描写挪威沿海与劳动阶层生活闻名。"},"examples":[{"en":"Our class read a short excerpt from Johan Bojer.","zh":"我们班读了一段约翰·博耶的节选。"},{"en":"Bojer’s stories often focus on ordinary people and hard work.","zh":"博耶的故事常聚焦普通人和艰辛的劳动。"}]}],"phonetic":"/ˈbɔɪər/","extraExplanation":["“Bojer”多见于人名（尤其是姓氏）。如果你其实想查的是英语单词“buoy”（浮标）或更常见的姓“Boyer”，告诉我上下文（在哪句话/哪本书里看到），我可以给出更准确的词条与发音。"]}
{"word":"Bojig-ngiji","summary":{"en":"“Bojig-ngiji” is not a recognized English word; it’s likely a transliteration or a proper name, and its meaning depends on context.","zh":"“Bojig-ngiji”不是常见英语词；更可能是音译词或专有名词，具体含义需要语境确认。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It looks like a transliterated term (possibly from an Indigenous language) or a proper name (person/place). Meaning can’t be confirmed without context.","zh":"不是标准英语词汇。看起来像是其他语言的音译词（可能来自某种原住民语言），或是专有名词（人名/地名）。在缺少语境的情况下无法确认含义。"},"examples":[{"en":"I saw “Bojig-ngiji” in a text—what language is it from, and what does it mean?","zh":"我在一段文字里看到“Bojig-ngiji”——它来自哪种语言，是什么意思？"},{"en":"Could you share the sentence where “Bojig-ngiji” appears so I can help interpret it?","zh":"你能把“Bojig-ngiji”出现的句子贴出来吗？这样我才能更准确地帮你解释。"}]}],"phonetic":"/ˌboʊdʒɪɡ ˈŋiːdʒi/","extraExplanation":["从拼写看，这个词不像英语构词，更像是“音译/转写”（不同资料可能有不同拼法），中间的连字符也提示它可能由两个部分组成。","如果你能提供：①出现的完整句子/段落；②它来自的书名、歌曲、视频或网站；③是否是人名/地名；④原文是否还有变体拼写（如 Bojig ngiji / Bojigngiji），我可以更准确地帮你判断语言来源与含义。"]}
{"word":"bojite","summary":{"en":"“bojite” is not a standard English word; it likely needs context or is a misspelling/proper name.","zh":"“bojite”不是标准英语词；需要上下文判断，可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling, a username/brand name, or a word from another language.","zh":"不是标准英语单词。更可能是拼写错误、用户名/品牌名，或来自其他语言的词。"},"examples":[{"en":"I can’t find “bojite” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里找不到“bojite”——你能把它出现的句子发我吗？"},{"en":"Do you mean “bite” or “boil”? The spelling “bojite” looks unusual in English.","zh":"你是想说“bite”还是“boil”？“bojite”这个拼写在英语里不常见。"}]}],"phonetic":"/ˈboʊdʒiːt/","extraExplanation":["“bojite”看起来不像英语常用拼写。如果你提供：1）原句/上下文；2）你想表达的中文意思；3）它是人名、地名还是产品名；我就能更准确判断你可能想查的英文词（例如 bite/boil/budget 等）。"]}
{"word":"bojo","summary":{"en":"“BoJo” is a media nickname for Boris Johnson, former UK Prime Minister.","zh":"“BoJo”是英国前首相鲍里斯·约翰逊的媒体式绰号。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a nickname for Boris Johnson (born 1964), a British politician who served as Prime Minister of the United Kingdom (2019–2022).","zh":"英国政治人物鲍里斯·约翰逊（Boris Johnson，1964年生）的绰号；他曾任英国首相（2019–2022）。"},"examples":[{"en":"BoJo said the government would review the policy.","zh":"BoJo 表示政府将审查这项政策。"},{"en":"Many newspapers used “BoJo” as a short, catchy name for Boris Johnson.","zh":"许多报纸用“BoJo”作为鲍里斯·约翰逊的简短、好记的称呼。"}]}],"synonyms":["Boris Johnson","Mr Johnson"],"phonetic":"ˈboʊdʒoʊ","extraExplanation":["“BoJo”主要见于英国媒体标题、评论和社交媒体中，是把“Boris Johnson”前两部分缩写并拼成一个更顺口的昵称（类似把名字变成品牌化的叫法）。","在正式写作中，更常用“Boris Johnson”或“Mr Johnson”；“BoJo”语气更口语化、媒体化，有时也带一点戏谑或讽刺色彩，取决于上下文。"]}

