{"word":"Bok","summary":{"en":"“Bok” is most often either an Afrikaans-based word meaning a buck/antelope (as in “springbok”), or a Croatian casual greeting meaning “hi/bye.”","zh":"“Bok” 常见两种用法：源自南非荷兰语，表示“雄鹿/羚羊”（如 springbok）；或在克罗地亚语中作随意问候语，表示“你好/再见”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Africa) an antelope or buck; often seen in names like “springbok.”","zh":"（南非）羚羊/雄鹿；常见于如 springbok（跳羚）这类名称中。"},"examples":[{"en":"The springbok is a famous national symbol of South Africa.","zh":"跳羚是南非著名的国家象征。"},{"en":"In Afrikaans, “bok” can refer to a buck or antelope.","zh":"在南非荷兰语中，bok 可以指雄鹿或羚羊。"}]},{"partOfSpeech":"int.","definition":{"en":"a casual greeting meaning “hi” or “bye” (used in Croatian and some nearby regions).","zh":"一种随意的问候语，意思是“你好/再见”（用于克罗地亚及周边地区）。"},"examples":[{"en":"Bok! How are you?","zh":"Bok！你好吗？"},{"en":"Ok, bok—see you tomorrow.","zh":"好，那 bok——明天见。"}]}],"synonyms":["buck","antelope","hi","bye"],"phonetic":"/bɑk/","extraExplanation":["“Bok” 不是常见英语单词，但在英语语境里你可能会在地名、人名、或动物名称（如 springbok）中看到它。","作为问候语的 “bok” 主要来自克罗地亚语（日常口语里很常用），相当于英语的 “Hi/Bye”。","作为名词的 “bok” 来自南非荷兰语（Afrikaans），英语在谈到南部非洲动物或文化时会借用。"]}
{"word":"bok","summary":{"en":"“Bok” commonly means an antelope in South African English, often as a short form in “springbok.”","zh":"“bok”常指（南非英语中的）羚羊，常见于“springbok（跳羚）”等词中的简写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in South African English) A kind of antelope; often used as a short form in names like “springbok.”","zh":"（尤指南非英语）一种羚羊；常作为“springbok（跳羚）”等名称中的简写。"},"examples":[{"en":"We saw a bok grazing near the road in South Africa.","zh":"我们在南非看到一只羚羊在路边吃草。"},{"en":"The springbok is a famous bok known for its jumping.","zh":"跳羚是一种著名的羚羊，以善于跳跃闻名。"}]}],"synonyms":["springbok","antelope"],"phonetic":"/bɑk/","extraExplanation":["“bok”来自南非的南非荷兰语（Afrikaans），原意与“雄山羊/公羊”有关，在当地英语里常用来指羚羊，尤其出现在动物名称或口语简称中。","在体育文化中，“Springboks（跳羚队）”是南非国家橄榄球队的昵称，因此你也可能在体育新闻里看到“Boks”指这支球队。"]}
{"word":"bokadam","summary":{"en":"“Bokadam” isn’t a recognized English word; it likely needs context or corrected spelling.","zh":"“bokadam”不是常见英语词；需要语境或确认是否拼错。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it may be a misspelling, a name, or a word from another language written in English letters.","zh":"不是标准英语单词；可能是拼写错误、人名/地名，或其他语言的音译/转写。"},"examples":[{"en":"I couldn’t find “bokadam” in an English dictionary—could you share a sentence with it?","zh":"我在英语词典里找不到“bokadam”，你能给我一个包含它的句子吗？"},{"en":"Did you mean “bokeh” (background blur in photos) or “Bok Adam” as a name?","zh":"你是不是想写“bokeh”（照片的背景虚化）或把“Bok Adam”当作一个名字？"}]}],"phonetic":"ˈboʊkəˌdæm","extraExplanation":["“bokadam”看起来更像是：①拼写误差（少/多了字母）；②专有名词（用户名、姓氏、地名、作品名）；③其他语言的转写。你可以告诉我它出现的场景（社交媒体、游戏、歌曲、聊天、作业等）以及原句，我就能更准确判断含义。","如果你是想查发音：非标准词一般按读音拼读，但更建议先确认正确拼写。"]}
{"word":"bokard","summary":{"en":"“Bokard” is not a standard English word; it’s likely a name or a misspelling.","zh":"“Bokard”不是标准英语词；更可能是名字/专有名词或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a proper name (e.g., a surname, username, or brand), or a misspelling of another word.","zh":"不是标准英语单词。更可能是专有名词（如姓氏、用户名、品牌），或是其他单词的拼写错误。"},"examples":[{"en":"I tried to look up “bokard,” but I couldn’t find it in an English dictionary.","zh":"我查了“bokard”，但在英语词典里找不到。"},{"en":"Is “Bokard” a person’s name or a brand name?","zh":"“Bokard”是人名还是品牌名？"}]}],"phonetic":"/ˈboʊkɑrd/","extraExplanation":["“bokard”在常见英语语料与词典中并不常见，因此很难给出可靠的词义与固定用法。","如果你是想输入某个更常见的词，可能的近似拼写包括：\n- board（木板；董事会）\n- brocard（较少见：逻辑/哲学中指“格言式命题/法律格言”；也见于法语语境）\n你可以告诉我它出现的句子或语境，我可以帮你判断最可能的目标词。"]}
{"word":"bokark","summary":{"en":"A bookmark is something that marks your place in a book, or (as a verb) it means saving a webpage to revisit later.","zh":"bookmark 指“书签”，也可作动词表示“在浏览器中收藏/添加书签”，方便以后再打开。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A piece of paper or other object used to mark your place in a book so you can return to it easily.","zh":"书签；用来夹在书里标记阅读位置的小纸片或其他物品。"},"examples":[{"en":"I left a bookmark on page 50.","zh":"我在第50页夹了一个书签。"},{"en":"Do you have a bookmark, or should I fold the corner?","zh":"你有书签吗？还是我把书角折一下？"}]},{"partOfSpeech":"vt.","definition":{"en":"To save a web page (or location in a document) so you can easily find it again later.","zh":"（在浏览器中）收藏/添加书签；把网页（或文档位置）保存起来以便以后快速找到。"},"examples":[{"en":"Bookmark this page so you can come back later.","zh":"把这个页面加入书签，方便你之后再回来。"},{"en":"I bookmarked the article for my research.","zh":"我把那篇文章收藏了，留作研究用。"}]}],"synonyms":["favorite (web)","save (a link)","mark (a page)"],"phonetic":"/ˈbʊkˌmɑrk/","extraExplanation":["“bokark” 不是常见的英语单词；它很可能是 “bookmark” 的拼写错误（少了一个 o 和 m）。如果你想查的是别的词（比如 bark 或 book），告诉我正确拼写或给个例句，我可以再帮你确认。"]}
{"word":"Bokchito","summary":{"en":"Bokchito is a town in southeastern Oklahoma; the name likely comes from Choctaw meaning “big creek.”","zh":"Bokchito 是美国俄克拉荷马州东南部的一个小镇；其名称可能源自乔克托语，意为“大溪流”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A small town in southeastern Oklahoma, USA (in Bryan County).","zh":"美国俄克拉荷马州东南部（布赖恩县）的一个小镇。"},"examples":[{"en":"She grew up in Bokchito, Oklahoma, before moving to Dallas.","zh":"她在俄克拉荷马州的博克奇托长大，后来搬到了达拉斯。"},{"en":"Bokchito is a quiet place with a strong sense of community.","zh":"博克奇托是个安静的地方，社区氛围很浓。"}]}],"synonyms":["Bok Chito"],"phonetic":"/ˈbɑkˌtʃɪtoʊ/","extraExplanation":["“Bokchito”常被认为来自乔克托语（Choctaw），写作“bok chito”，意思是“big creek（大溪流/大河沟）”。这类地名在美国南部较常见，反映了当地原住民语言对地名的影响。","英语里它通常作为地名使用，首字母大写；如果你在地图、地址或新闻里看到它，基本就是指俄克拉荷马州的这个城镇。"]}
{"word":"boke","summary":{"en":"“Boke” is usually a misspelling of “bokeh,” meaning the pleasing out-of-focus blur in photos.","zh":"“boke”多半是“bokeh”的误拼，指照片里好看的背景虚化（散景）效果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly written as “bokeh”) the soft, out-of-focus areas in a photo, especially the pleasing blur of lights or the background.","zh":"（常写作 bokeh）照片中虚化的失焦区域，尤指背景或灯光形成的“好看”的模糊效果（背景虚化）。"},"examples":[{"en":"This portrait has beautiful bokeh in the background.","zh":"这张人像的背景虚化很漂亮。"},{"en":"Use a wide aperture to get more bokeh.","zh":"用更大的光圈可以获得更多的虚化效果。"},{"en":"The city lights turn into circular bokeh at night.","zh":"夜里城市灯光会变成一圈圈的散景光斑。"}]}],"synonyms":["background blur","soft focus","blur","defocus"],"phonetic":"/ˈboʊkeɪ/","extraExplanation":["“bokeh”来自日语“ボケ (boke)”，意思接近“模糊、虚、发呆”。在摄影语境里通常指“散景/背景虚化的质感”，不是单纯的“对焦不准”。英文里最常见拼法是 bokeh，读音一般为 /ˈboʊkeɪ/（boh-kay）。"]}
{"word":"Bokeelia","summary":{"en":"Bokeelia is a place name: a small community on Pine Island in Lee County, Florida.","zh":"Bokeelia 是一个地名：位于美国佛罗里达州李县松岛北端的小社区。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A small unincorporated community at the north end of Pine Island in Lee County, Florida, USA; often used as a place name in addresses and local references.","zh":"美国佛罗里达州李县松岛（Pine Island）北端的一个非建制社区（地名）；常用于地址与当地指称。"},"examples":[{"en":"We rented a cottage in Bokeelia for the weekend.","zh":"我们周末在博基利亚（Bokeelia）租了一间小屋。"},{"en":"The package was shipped to Bokeelia, Florida.","zh":"包裹寄到了佛罗里达州的博基利亚。"},{"en":"Bokeelia is known for its quiet, coastal island feel.","zh":"博基利亚以宁静的海岛氛围而闻名。"}]}],"synonyms":["(no direct synonyms; it is a proper place name)"],"phonetic":"/ˌboʊkəˈliːə/","extraExplanation":["“Bokeelia”是专有名词（地名），在英语里通常首字母大写；读音重音在倒数第二个音节（-LEE-）。","作为美国地名，它更多出现在旅行、房产、邮寄地址、以及与松岛（Pine Island）相关的本地信息中。"]}
{"word":"Bokhara","summary":{"en":"Bokhara is an older spelling of Bukhara, a historic Silk Road city in Uzbekistan; it can also refer to rugs/textiles from that region.","zh":"Bokhara是Bukhara（布哈拉）的旧式英文拼写，指乌兹别克斯坦的丝绸之路历史名城；也可指该地区相关的地毯/织物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional English spelling of Bukhara, a historic city in present-day Uzbekistan (famous as a Silk Road center).","zh":"“Bukhara（布哈拉）”的传统英文拼写法；指今乌兹别克斯坦的一座历史名城（以丝绸之路重镇闻名）。"},"examples":[{"en":"Bokhara (Bukhara) was an important stop on the Silk Road.","zh":"Bokhara（Bukhara，布哈拉）曾是丝绸之路上的重要驿站。"},{"en":"The travel book describes the markets of Bokhara in vivid detail.","zh":"那本游记生动描写了Bokhara的集市。"}]},{"partOfSpeech":"n.","definition":{"en":"(in some contexts) a type of carpet/rug or textile associated with the Bukhara region, often used in phrases like “Bokhara rug.”","zh":"（某些语境中）与布哈拉地区相关的一类地毯或织物，常见于“Bokhara rug（布哈拉地毯）”等说法。"},"examples":[{"en":"They bought a Bokhara rug with deep red patterns.","zh":"他们买了一张带深红色纹样的Bokhara地毯。"},{"en":"The shop specializes in Bokhara-style textiles and rugs.","zh":"这家店专营Bokhara风格的纺织品和地毯。"}]}],"synonyms":["Bukhara","Buhara"],"phonetic":"/buːˈkɑːrə/","extraExplanation":["“Bokhara”多见于较旧的英文资料或文学作品中；现代英语里更常用标准转写“Bukhara”。","布哈拉在历史上属于中亚重要的伊斯兰文化与商贸中心，因此在英语语境里也常与“Silk Road（丝绸之路）”“caravan（商队）”等词一起出现。"]}
{"word":"bokhara","summary":{"en":"Bokhara usually means the city of Bukhara in Uzbekistan, and it can also refer to a Bokhara-style rug.","zh":"Bokhara 通常指乌兹别克斯坦的布哈拉城，也可指“博卡拉风格”的地毯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(also spelled Bukhara) A historic city in Central Asia, now in Uzbekistan, famous for its Silk Road history and Islamic architecture.","zh":"（亦作 Bukhara）中亚的历史名城，位于今乌兹别克斯坦，以丝绸之路历史和伊斯兰建筑闻名。"},"examples":[{"en":"She traveled to Bokhara to visit its old mosques and madrasas.","zh":"她去了博卡拉参观古老的清真寺和伊斯兰学校。"},{"en":"In the novel, merchants carry spices from Samarkand to Bokhara.","zh":"小说里，商人把香料从撒马尔罕运到博卡拉。"}]},{"partOfSpeech":"n.","definition":{"en":"A type of Central Asian-style carpet/rug (often called a “Bokhara rug”), traditionally associated with designs from the Bukhara region and nearby Turkoman weaving traditions.","zh":"一种中亚风格的地毯（常称“博卡拉地毯/Bokhara rug”），传统上与布哈拉地区及周边土库曼织毯纹样相关。"},"examples":[{"en":"They decorated the living room with a Bokhara rug.","zh":"他们用一张博卡拉地毯装饰客厅。"},{"en":"The shop sells wool Bokhara rugs in deep red patterns.","zh":"那家店卖羊毛博卡拉地毯，常见深红色图案。"}]}],"synonyms":["Bukhara","Bokhara rug (as a related term)"],"phonetic":"/boʊˈkɑːrə/","extraExplanation":["“Bokhara”是英语里较旧或较常见于贸易语境的拼写；学术与现代地名多用“Bukhara”（布哈拉）。","“Bokhara rug”在英语市场上常作为一种商业名称使用，并不一定严格指产自布哈拉城本身；很多与土库曼（Turkmen/Turkoman）传统图案有关的地毯也会被归入这一名称。"]}
{"word":"Bokharan","summary":{"en":"Bokharan means “from Bukhara” (also spelled Bukharan), and can refer to the people/culture of Bukhara or to a person from there (sometimes specifically a Bukharan Jew).","zh":"Bokharan（也作 Bukharan）表示“来自布哈拉的”，可指布哈拉的人民/文化，或指布哈拉人（有时特指布哈拉犹太人）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(also spelled **Bukharan**) relating to **Bukhara** (a historic city in Central Asia, now in Uzbekistan) or to its people and culture.","zh":"（也拼作 **Bukharan**）与**布哈拉**（中亚历史名城，今属乌兹别克斯坦）或其人民、文化有关的。"},"examples":[{"en":"Bokharan architecture is known for its intricate tilework.","zh":"布哈拉的建筑（Bokharan）以精美的瓷砖装饰闻名。"},{"en":"She studies Bokharan history and trade along the Silk Road.","zh":"她研究布哈拉（Bokharan）的历史以及丝绸之路上的贸易。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Bukhara; sometimes used especially for a **Bukharan Jew** (a member of the historic Jewish community from Bukhara and nearby regions).","zh":"布哈拉人；有时也特指**布哈拉犹太人**（来自布哈拉及周边地区的历史犹太社群成员）。"},"examples":[{"en":"He is a Bokharan who grew up in Bukhara before moving abroad.","zh":"他是布哈拉人（Bokharan），在布哈拉长大后移居海外。"},{"en":"Many Bokharans maintain strong community traditions through music and cuisine.","zh":"许多布哈拉人（Bokharans）通过音乐和饮食延续浓厚的社群传统。"}]}],"synonyms":["Bukharan","from Bukhara"],"phonetic":"/buˈkɑrən/","extraExplanation":["“Bokharan”来自旧式/不同转写体系：Bokhara = Bukhara（布哈拉）的另一种拼写。现代英语更常见的是“Bukhara / Bukharan”。","在英语语境中，若指“布哈拉犹太人”，更常见写法是“Bukharan Jews”。使用时可根据对方社群的自称与常用拼法选择更尊重、更清晰的表达。"]}
{"word":"bokharan","summary":{"en":"Bokharan means “of Bukhara” or “a person from Bukhara.”","zh":"Bokharan 指“布哈拉的”，也可指“布哈拉人/来自布哈拉的人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"from or relating to Bukhara (a historic city/region in Central Asia, in present-day Uzbekistan).","zh":"（与）布哈拉（中亚历史名城/地区，今乌兹别克斯坦境内）有关的；布哈拉的。"},"examples":[{"en":"They visited Bokharan monuments along the Silk Road.","zh":"他们沿着丝绸之路参观了布哈拉的古迹。"},{"en":"The museum has a small collection of Bokharan textiles.","zh":"这家博物馆收藏了一小批布哈拉的纺织品。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Bukhara; someone belonging to the Bokharan (Bukharan) community.","zh":"布哈拉人；布哈拉（布哈拉犹太人等）社群成员。"},"examples":[{"en":"His grandparents were Bokharans who later moved abroad.","zh":"他的祖父母是布哈拉人，后来移居海外。"},{"en":"A Bokharan family shared traditional dishes with the guests.","zh":"一户布哈拉人家与客人分享了传统菜肴。"}]}],"synonyms":["Bukharan","Bukhara (adj./n.)"],"phonetic":"/buːˈkɑːrən/","extraExplanation":["“Bokharan”也常见拼写为“Bukharan”。英语里两种拼写都用来指“布哈拉的/布哈拉人”。","在文化语境中，“Bukharan Jews / Bokharan Jews（布哈拉犹太人）”指中亚地区一个历史悠久的犹太社群，常与丝绸之路的商贸与文化交流联系在一起。"]}
{"word":"Bokm","summary":{"en":"“Bokm” is not a standard English word; it may be a typo or an acronym and needs context.","zh":"“Bokm”不是标准英文单词，可能是拼写错误或缩写，需要上下文确认。"},"extraExplanation":["“Bokm” 不是常见或标准的英文单词，我无法给出可靠的发音与释义。你可能想输入的是以下之一：","1) **book**（书；预订）：最常见的近似拼写。","2) **bokeh**（摄影术语：背景虚化效果）：常被误拼。","3) **BOKM / bokm**（缩写/人名/用户名/专有名词）：需要具体上下文才能判断。","请告诉我：你是在什么句子里看到/想表达“Bokm”的？或你想查的是 **book** 还是 **bokeh**？我可以据此给出准确释义、例句与用法。"]}
{"word":"bokmakierie","summary":{"en":"A southern African bushshrike (songbird) famous for its loud, dueting call.","zh":"南部非洲的一种灌丛伯劳类鸣禽，以洪亮的对唱鸣声著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brightly colored bushshrike (a kind of songbird) found in southern Africa, known for its loud, dueting call; also called the bokmakierie bushshrike","zh":"博克马基里（南部非洲的一种伯劳科灌丛伯劳/灌丛伯劳属鸟类），羽色鲜明，以洪亮的“对唱”鸣声著称；也常称“bokmakierie bushshrike”"},"examples":[{"en":"Early in the morning, we heard a bokmakierie dueting from the thorn bushes.","zh":"清晨，我们听到一只博克马基里在荆棘灌木里对唱鸣叫。"},{"en":"The guide pointed out the bokmakierie by its yellow belly and bold black-and-white head.","zh":"向导根据它黄色的腹部和醒目的黑白头部特征指给我们看那只博克马基里。"}]}],"synonyms":["bokmakierie bushshrike","bushshrike"],"phonetic":"/ˌbɑk mɑː ˈkɪr.i/","extraExplanation":["“bokmakierie”一词来自南非荷兰语（Afrikaans），常被认为与这种鸟的叫声有关，带有拟声色彩。在南部非洲的观鸟语境里很常见。"]}
{"word":"boko","summary":{"en":"“Boko” is a West African (Hausa) word most often meaning Western-style/modern schooling or formal education; globally it’s also known from the name “Boko Haram.”","zh":"“boko”多见于西非（豪萨语）语境，常指“西式/现代学校教育、正规教育”；在全球也因“Boko Haram（博科圣地）”这一名称而被熟知。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(West Africa, especially Hausa/Nigeria) Western-style education or schooling; sometimes used more broadly to mean “book learning” or formal (modern) education.","zh":"（西非，尤指豪萨语/尼日利亚语境）“西式教育/现代学校教育”；有时也泛指“书本知识/正规教育”。"},"examples":[{"en":"Some families want boko for their children, so they send them to city schools.","zh":"一些家庭希望孩子接受boko（现代学校教育），所以把他们送到城市学校。"},{"en":"He speaks Hausa at home but studied boko in English at school.","zh":"他在家说豪萨语，但在学校用英语接受boko（正规教育）。"}]},{"partOfSpeech":"n.","definition":{"en":"A word widely recognized through the name “Boko Haram,” a Nigerian Islamist militant group; in this context, “boko” is often understood as “Western education.”","zh":"因“Boko Haram（博科圣地）”这一尼日利亚伊斯兰武装组织名称而广为人知的词；在该语境中，boko 常被理解为“西式教育”。"},"examples":[{"en":"News reports often explain that “boko” is linked to the idea of Western education in the group’s name.","zh":"新闻报道常会解释：该组织名称中的“boko”与“西式教育”的概念有关。"},{"en":"Be careful using the word boko in conversation, because many people may immediately think of Boko Haram.","zh":"在对话中使用 boko 要注意，因为很多人会立刻联想到 Boko Haram。"}]}],"synonyms":["Western education","modern schooling","formal education"],"phonetic":"/ˈboʊkoʊ/","extraExplanation":["“boko”来自豪萨语，在尼日利亚北部等地的历史语境里，常与殖民时期及其后的“现代学校教育/西式教育体系”联系在一起。","在国际媒体中，这个词常因“Boko Haram”而被政治化、标签化；日常语言环境里它也可能只是指“上学、读书、受教育”。"]}
{"word":"bokom","summary":{"en":"“bokom” is not standard English; it’s usually a misspelling of “become” (to start to be/turn into).","zh":"“bokom”不是标准英语，通常是“become”的拼写错误（表示“变得/成为”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard) A misspelling of “become.” It is not a standard English word.","zh":"（非标准）“become”的拼写错误；不是标准英语单词。"},"examples":[{"en":"I think you meant “become,” not “bokom.”","zh":"我想你想写的是“become”，不是“bokom”。"}]},{"partOfSpeech":"v.","definition":{"en":"To start to be; to turn into; to develop into a new state or condition.","zh":"变得；成为；逐渐发展成某种状态。"},"examples":[{"en":"She became a doctor after years of study.","zh":"她经过多年学习后成为了医生。"},{"en":"It’s becoming colder every day.","zh":"天气一天比一天冷了。"},{"en":"He became more confident with practice.","zh":"他通过练习变得更自信了。"}]},{"partOfSpeech":"v.","definition":{"en":"To be suitable for; to look good on (often used in formal or literary style).","zh":"适合；衬托（较正式/文学用法）。"},"examples":[{"en":"That color becomes you.","zh":"那个颜色很衬你。"},{"en":"Such behavior does not become a leader.","zh":"那种行为不符合领导者的身份。"}]}],"synonyms":["turn into","grow","get","become"],"phonetic":"/bɪˈkʌm/","extraExplanation":["“bokom”通常只是打字错误，最常见的目标词是“become”。如果你是在看某段文字里出现“bokom”，可以把上下文发我，我也能帮你判断是否是专有名词（人名/地名/品牌名等）。"]}
{"word":"bokos","summary":{"en":"“Bokos” is not standard English; it’s usually a misspelling of “books,” or a context-specific name.","zh":"“bokos”不是标准英语；通常是“books”的拼写错误，或是在特定语境里的名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling of “books” (plural of book).","zh":"不是标准英语单词；最常见是把“books”（book 的复数）拼错了。"},"examples":[{"en":"I think you meant “books,” not “bokos.”","zh":"我想你想写的是“books”，不是“bokos”。"},{"en":"She borrowed three books from the library.","zh":"她从图书馆借了三本书。"}]},{"partOfSpeech":"other","definition":{"en":"(Rare/Context-dependent) Could be a name or a plural form of a coined word “Boko” (e.g., a brand, username, or place name). Meaning depends on context.","zh":"（较少见/取决于语境）也可能是专有名词或自造词“Boko”的复数形式（如品牌名、用户名或地名等），具体含义要看上下文。"},"examples":[{"en":"Do you mean Boko’s shops, or the group called Bokos?","zh":"你是指Boko的商店，还是叫“Bokos”的那个团体？"}]}],"synonyms":["books (if that’s what you meant)"],"phonetic":"ˈboʊkoʊz","extraExplanation":["“bokos”在常见英语词典里一般查不到。如果你是在打字时想表达“书”，正确拼写是 books（book + s）。","如果你是在某个游戏/社交平台/小说里看到“Bokos”，它可能是专有名词（人名、组织名、地名、品牌名等）。你可以把完整句子或出处发我，我能帮你判断具体意思。"]}
{"word":"Bokoshe","summary":{"en":"Bokoshe is a town name in southeastern Oklahoma, USA.","zh":"Bokoshe 是美国俄克拉荷马州东南部的一个城镇地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small town in Le Flore County, in southeastern Oklahoma, USA.","zh":"美国俄克拉荷马州东南部勒弗洛尔县（Le Flore County）的一个小镇。"},"examples":[{"en":"Bokoshe is located in southeastern Oklahoma, not far from Fort Smith, Arkansas.","zh":"Bokoshe 位于俄克拉荷马州东南部，离阿肯色州的史密斯堡不远。"},{"en":"She grew up in Bokoshe before moving to Tulsa for college.","zh":"她在 Bokoshe 长大，后来去塔尔萨上大学。"}]}],"synonyms":["(no true synonyms; it is a proper place name)"],"phonetic":"/boʊˈkoʊʃi/","extraExplanation":["“Bokoshe”是专有名词（地名），通常不翻译，只音译或直接使用原拼写。","该地名常被认为可能与当地原住民语言（如乔克托语 Choctaw）有关，但具体词源在一般词典中不一定有一致、权威的解释；如果你需要严谨来源，建议查阅俄克拉荷马州地名学资料或当地历史档案。"]}
{"word":"Bokoto","summary":{"en":"“Bokoto” is usually a proper name in English contexts; it may also be read as Japanese “boku to” (“with me / me and …”).","zh":"“Bokoto”在英语语境中通常是专有名词；也可能对应日语“boku to（僕と）”，意思是“和我一起/我和……”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (surname, place name, or brand). It is not a standard English word, so the exact meaning depends on who/what it refers to.","zh":"一个专有名词（可能是姓氏、地名或品牌名）。它不是标准英语词，因此具体含义取决于指代对象。"},"examples":[{"en":"I saw the name “Bokoto” on a map, but I’m not sure what region it belongs to.","zh":"我在地图上看到了“Bokoto”这个名字，但不确定它属于哪个地区。"},{"en":"Could you tell me who Bokoto is in this story?","zh":"你能告诉我这个故事里的Bokoto是谁吗？"}]},{"partOfSpeech":"phrase","definition":{"en":"In Japanese romanization, it may represent “boku to” (僕と), meaning “with me” or “me and …” in casual speech.","zh":"在日语罗马字写法中，它可能对应“boku to”（僕と），口语里表示“和我一起”或“我和……”。"},"examples":[{"en":"Come with me—“boku to” in Japanese.","zh":"和我一起——日语可以说“boku to”。"},{"en":"In a casual line, “boku to kimi” means “you and me.”","zh":"在口语台词里，“boku to kimi”表示“你和我”。"}]}],"synonyms":["(proper name) N/A","(Japanese) boku to"],"phonetic":"/boʊˈkoʊtoʊ/","extraExplanation":["如果你是在英文文本里遇到“Bokoto”，先判断它是不是人名/地名/品牌名：这种情况下通常不翻译，只需要确认指代对象即可。","如果你是想写日语“僕と（boku to）”，常见写法是分开写成“boku to”，连写成“bokoto”也能看懂，但更不标准；而且大写“Bokoto”看起来更像专有名词。"]}
