{"word":"BOM","summary":{"en":"BOM is an abbreviation most commonly meaning Bill of Materials, and it can also mean Byte Order Mark or Browser Object Model depending on context.","zh":"BOM 是缩写，最常见指“物料清单”，也可根据语境表示“字节顺序标记”或“浏览器对象模型”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bill of Materials: a detailed list of all the parts, materials, and quantities needed to make a product or build something.","zh":"物料清单（BOM）：用于制造产品或建造项目的所有零件/材料及其数量的详细清单。"},"examples":[{"en":"Before production starts, the engineer updates the BOM.","zh":"在开始生产之前，工程师会更新物料清单（BOM）。"},{"en":"The factory can’t assemble the device because the BOM is missing a key component.","zh":"工厂无法组装该设备，因为物料清单（BOM）里缺少一个关键零件。"}]},{"partOfSpeech":"n.","definition":{"en":"Byte Order Mark: a special character at the start of a text file that can indicate the file’s text encoding (often related to Unicode).","zh":"字节顺序标记（BOM）：位于文本文件开头的特殊字符，可用于指示文本编码（常与 Unicode 相关）。"},"examples":[{"en":"The CSV won’t import correctly because it has a UTF-8 BOM.","zh":"这个 CSV 因为带有 UTF-8 的 BOM，导致无法正确导入。"},{"en":"Remove the BOM to prevent the first column name from showing strange characters.","zh":"去掉 BOM，避免第一列字段名出现奇怪的字符。"}]},{"partOfSpeech":"n.","definition":{"en":"Browser Object Model: a way to refer to the objects a web browser provides for interacting with the window, history, location, and more.","zh":"浏览器对象模型（BOM）：指浏览器提供的一组对象，用于操作窗口、历史记录、地址等。"},"examples":[{"en":"In JavaScript, window.location is part of the BOM.","zh":"在 JavaScript 里，window.location 属于浏览器对象模型（BOM）。"},{"en":"The tutorial explains DOM first, then BOM.","zh":"教程先讲 DOM，再讲 BOM。"}]}],"synonyms":["bill of materials","parts list","byte order mark"],"phonetic":"/ˌbiː oʊ ˈɛm/","extraExplanation":["BOM 是缩写，常见于不同领域：制造业/供应链里几乎默认指“物料清单”；软件与数据处理里常指“字节顺序标记”；前端开发语境里则指“浏览器对象模型”。阅读时可通过上下文判断。","在文件编码里，UTF-8 的 BOM 往往不是必须的，但某些软件（尤其表格/导入工具）会因 BOM 出现或缺失而产生兼容性问题。"]}
{"word":"bom","summary":{"en":"“BOM” most commonly means “bill of materials” (a parts/materials list) or “byte order mark” (a file-encoding marker).","zh":"“BOM”最常见指“物料清单”（bill of materials）或“字节顺序标记”（byte order mark）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(manufacturing/engineering) An abbreviation for “bill of materials”: a complete list of parts, materials, and quantities needed to make a product.","zh":"（制造/工程）“Bill of Materials”的缩写：生产某个产品所需的零部件/材料及其数量的完整清单。"},"examples":[{"en":"Before we start production, we need to finalize the BOM.","zh":"在开始生产之前，我们需要敲定BOM（物料清单）。"},{"en":"The BOM shows we’re short two screws per unit.","zh":"BOM显示每台产品少两颗螺丝。"}]},{"partOfSpeech":"n.","definition":{"en":"(computing) An abbreviation for “byte order mark”: a special character at the start of a text file that can indicate its encoding (often UTF-8/UTF-16).","zh":"（计算机）“Byte Order Mark”的缩写：文本文件开头的特殊标记，用来提示文件编码（常见于UTF-8/UTF-16）。"},"examples":[{"en":"The file won’t parse because it has a BOM at the beginning.","zh":"这个文件因为开头有BOM，导致无法正确解析。"},{"en":"Try saving the CSV without a BOM.","zh":"试着把CSV保存为不带BOM的格式。"}]},{"partOfSpeech":"other","definition":{"en":"A sound word like “boom,” used informally to imitate a dull bang or thump (less common spelling).","zh":"拟声词，类似“boom”，非正式用法，用来模仿沉闷的撞击声（这种拼法不太常见）。"},"examples":[{"en":"He dropped the box—bom!—and everyone turned around.","zh":"他把箱子一摔——“bom！”——大家都回头看。"}]}],"synonyms":["bill of materials","materials list","parts list","byte order mark"],"phonetic":"/ˌbiː oʊ ˈɛm/","extraExplanation":["在英语里，“bom”最常见其实是缩写BOM（常按字母读）。如果你是在葡萄牙语/西班牙语语境里看到“bom”，它常表示葡语“good（好）”，但这不属于标准英语词义。"]}
{"word":"Boma","summary":{"en":"A boma is a fenced enclosure for livestock (and sometimes a homestead area) in East Africa; it can also mean a small fort in historical contexts.","zh":"boma多指东非用于夜间保护牲畜的围栏/畜栏（有时也指院落）；在历史语境中也可指小型堡垒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(East Africa) A fenced enclosure, usually made of thorn bushes or wooden stakes, used to keep livestock safe at night; sometimes the fenced area around a family homestead.","zh":"（东非）用荆棘灌木或木桩围成的围栏/畜栏，用来在夜间保护牲畜；有时也指围起来的家庭院落或住家周围的防护圈。"},"examples":[{"en":"At dusk, the herders brought the cattle back into the boma.","zh":"黄昏时，牧民把牛群赶回了boma（畜栏）。"},{"en":"They built a stronger boma after a leopard attacked the goats.","zh":"豹子袭击山羊后，他们把boma加固了。"},{"en":"The visitors were welcomed inside the boma for tea and conversation.","zh":"来访者被欢迎进入boma院落里喝茶聊天。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) A small fort or fortified post, especially in historical colonial contexts in East Africa.","zh":"（较少见）小型堡垒或设防哨站（多见于东非殖民历史语境）。"},"examples":[{"en":"The old boma near the river is now a museum.","zh":"河边那座旧boma（堡垒）如今成了博物馆。"},{"en":"Records describe a boma built to guard the trade route.","zh":"史料记载曾修建一座boma来守卫商路。"}]}],"synonyms":["enclosure","corral","pen","stockade","kraal"],"phonetic":"/ˈboʊmə/","extraExplanation":["“boma”一词常见于斯瓦希里语及东非英语语境，尤其与马赛（Maasai）等牧民文化相关；在旅行写作与野生动物保护领域也常出现（例如“predator-proof boma”指“防捕食者畜栏”）。","在现代保护项目中，人们会改良传统boma（用铁丝网、木柱、照明等）以减少狮子、豹子等捕食者与家畜的冲突。"]}
{"word":"boma","summary":{"en":"Boma most commonly means a traditional East African livestock enclosure or fortified homestead/camp; capitalized, it can also be a place name.","zh":"Boma最常指东非传统的牲畜围栏或防护性住处/营地；首字母大写时也可能是地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(East Africa) a fenced enclosure—often made of thorn bushes or wood—used to keep cattle or other livestock safe, especially at night; by extension, a small fortified homestead or camp.","zh":"（东非）用荆棘、木头等围成的牲畜围栏（常用于夜间防护）；引申为小型防护性住处或营地。"},"examples":[{"en":"At night, the herders brought the cattle into the boma to protect them from predators.","zh":"晚上，牧民把牛赶进boma里，以防捕食者。"},{"en":"The safari lodge sits beside a traditional boma built from thorn branches.","zh":"这家野生动物观光旅馆旁边有一个用荆棘枝搭成的传统boma。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name for several towns/areas in Africa (for example, Boma in the Democratic Republic of the Congo).","zh":"非洲一些城镇或地区的地名（例如刚果民主共和国的博马 Boma）。"},"examples":[{"en":"The ship docked near Boma before continuing upriver.","zh":"船在博马附近靠岸后继续逆流而上。"}]}],"synonyms":["kraal","corral","enclosure","pen"],"phonetic":"/ˈboʊmə/","extraExplanation":["“boma”常被认为来自东非语言（如斯瓦希里语中的用法），与放牧文化密切相关：把牲畜围起来既能防野兽也能防盗。英语中多见于关于肯尼亚、坦桑尼亚等地的旅行、自然纪录片和人类学描述。","在英语里它通常不翻成某个固定专有名词，而是按语境译为“牲畜围栏/围寨/营地”。若首字母大写（Boma），更可能是地名。"]}
{"word":"Bomarc","summary":{"en":"BOMARC refers to a Cold War-era long-range surface-to-air missile system (and the missile itself) used in North American air defense.","zh":"BOMARC 指冷战时期北美防空使用的一种远程地对空导弹系统（也可指该型导弹本身）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a U.S.-Canadian long-range surface-to-air missile system developed during the Cold War (the CIM-10 BOMARC), designed to intercept enemy bombers.","zh":"（冷战时期）美国与加拿大部署的一种远程地对空导弹系统（CIM-10 “BOMARC”），用于拦截敌方轰炸机。"},"examples":[{"en":"The BOMARC missile was part of North American air defense during the Cold War.","zh":"BOMARC 导弹是冷战时期北美防空体系的一部分。"},{"en":"Canada’s decision to host BOMARC missiles became politically controversial.","zh":"加拿大是否部署 BOMARC 导弹曾引发政治争议。"}]},{"partOfSpeech":"n.","definition":{"en":"the name of the missile itself: a BOMARC missile.","zh":"（也可指）BOMARC 型导弹本身。"},"examples":[{"en":"A BOMARC was launched in a test flight over the Atlantic.","zh":"一枚 BOMARC 在大西洋上空进行试射发射。"},{"en":"The museum display includes a retired BOMARC.","zh":"博物馆展品中有一枚退役的 BOMARC 导弹。"}]}],"synonyms":["CIM-10 BOMARC","surface-to-air missile (SAM) system","air-defense missile"],"phonetic":"/ˈboʊmɑrk/","extraExplanation":["“BOMARC”是缩写，来自 Boeing 与 Michigan Aeronautical Research Center（密歇根航空研究中心），因此读起来像一个词而不是逐字母拼读。","在历史语境中，它常与冷战防空、北美防空司令部（NORAD）以及核弹头部署争议联系在一起。"]}
{"word":"Bomarea","summary":{"en":"Bomarea is a plant genus of climbing, ornamental flowering vines from the Americas.","zh":"Bomarea 指一种原产美洲的攀援开花植物属名，部分可作观赏藤本。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of climbing or twining flowering plants (family Alstroemeriaceae), native mainly to Central and South America; some species are grown as ornamental vines with showy, lily-like flowers","zh":"波马瑞亚属（一类开花植物属名，属六出花科），主要原产于中美洲与南美洲；部分种类可作观赏藤本，花朵艳丽、形似百合"},"examples":[{"en":"Bomarea is often grown on trellises because it climbs as it grows.","zh":"波马瑞亚常被种在花架上，因为它会随着生长攀援。"},{"en":"The garden label said “Bomarea,” a relative of Alstroemeria.","zh":"花园的标签写着“Bomarea（波马瑞亚）”，它和六出花（Alstroemeria）是近亲。"}]}],"synonyms":["Bomarea vine","(related) Alstroemeria (not a true synonym)"],"phonetic":"/boʊˈmɛəriə/","extraExplanation":["“Bomarea”是植物学拉丁化名称，通常在园艺或科普语境中出现；日常英语里不常用。","该属名常被认为源自对法国人Jacques-Christophe Valmont de Bomare（博马尔）的纪念命名；在植物命名中，用人名来命名属名很常见。"]}
{"word":"bomarea","summary":{"en":"Bomarea is a genus of climbing flowering plants, mainly from Central and South America, known for showy lily-like blooms.","zh":"Bomarea 是一個主要原產於中南美洲的攀援性開花植物屬，以鮮豔、似百合的花著稱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of climbing or twining flowering plants in the Alstroemeriaceae (Peruvian-lily) family, native mainly to Central and South America and often grown for their showy, lily-like flowers","zh":"（植物）吊鐘花屬／波馬瑞亞屬：一類主要原產於中南美洲的攀援或纏繞性開花植物，屬於六出花科（秘魯百合科），常因花朵鮮豔、形似百合而被栽培觀賞"},"examples":[{"en":"The greenhouse has a Bomarea vine trained up a trellis.","zh":"溫室裡有一株吊鐘花屬（Bomarea）的藤本，被牽引著攀在棚架上。"},{"en":"In botanical gardens, Bomarea is sometimes labeled as a relative of Alstroemeria.","zh":"在植物園裡，Bomarea 有時會被標示為六出花（Alstroemeria）的近親。"}]}],"synonyms":["(no exact common-English synonym; related genus: Alstroemeria)"],"phonetic":"/boʊˈmɛriə/","extraExplanation":["「Bomarea」是植物學拉丁學名（屬名），英語日常對話中較少出現，多見於園藝、植物學文章或植物標籤。","有些 Bomarea 物種為攀藤，葉片可纏繞支撐物；花常成簇、色彩鮮明。常見的英文搭配有：Bomarea vine（吊鐘花藤）、Bomarea flower（吊鐘花）。"]}
{"word":"bomb","summary":{"en":"“Bomb” most commonly means an explosive weapon; as a verb it can mean to attack with bombs, and informally it can mean to fail badly or (in “the bomb”) to be excellent.","zh":"“bomb”最常见指“炸弹”；作动词可指“轰炸”；口语里还可表示“惨败/砸了”，以及短语“the bomb”表示“超棒”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A weapon that explodes and can cause serious damage and injury.","zh":"炸弹；会爆炸并造成严重破坏与伤害的武器。"},"examples":[{"en":"The police searched the building after a bomb threat.","zh":"警方在收到炸弹威胁后搜查了这栋大楼。"},{"en":"The movie shows how dangerous a bomb can be.","zh":"这部电影展示了炸弹有多危险。"}]},{"partOfSpeech":"vt.","definition":{"en":"To attack or hit a place with bombs; to drop bombs from aircraft.","zh":"轰炸；用炸弹攻击某地（尤指从飞机投弹）。"},"examples":[{"en":"The city was bombed during the war.","zh":"战争期间这座城市遭到轰炸。"},{"en":"They bombed the bridge to stop the enemy.","zh":"他们炸毁了桥梁以阻止敌人。"}]},{"partOfSpeech":"v.","definition":{"en":"(Informal) To fail badly, especially in a test, performance, or at the box office.","zh":"（非正式）惨败；考砸/演出砸/票房惨淡。"},"examples":[{"en":"I studied hard, but I totally bombed the exam.","zh":"我很努力复习了，但考试还是考砸了。"},{"en":"The new show bombed on its first night.","zh":"这部新节目首演就砸了。"}]},{"partOfSpeech":"phrase","definition":{"en":"(Slang, usually positive) Something extremely good or impressive: “the bomb.”","zh":"（俚语，常为褒义）非常棒的东西：“the bomb”（超赞、顶级）。"},"examples":[{"en":"Her homemade cookies are the bomb.","zh":"她自制的饼干超好吃。"}]}],"synonyms":["explosive","bombing","airstrike","fail (informal sense)","flop (informal sense)"],"phonetic":"/bɑm/","extraExplanation":["“bomb”有强烈的暴力与安全含义，在真实事件或公共场合讨论时要谨慎使用（例如在机场、车站等说“bomb”可能引起误会）。","俚语用法“the bomb”在口语里表示“很棒”，但在正式写作或严肃语境中通常不建议使用，以免产生不合时宜的联想。","文学与文化中，“bomb”常被用作战争与毁灭的象征；例如在反战题材作品里，它不仅指武器，也象征恐惧、创伤与社会动荡。"]}
{"word":"bomb alert","summary":{"en":"A warning or heightened caution about a possible bomb threat.","zh":"关于可能存在炸弹威胁的警报或高度戒备。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A warning or official notice that a bomb may be present, often causing security checks or evacuation.","zh":"“可能有炸弹”的警报或官方通知，常导致安检加强或疏散。"},"examples":[{"en":"The airport issued a bomb alert and cleared the terminal.","zh":"机场发布了炸弹警报并疏散了航站楼。"},{"en":"Classes were canceled after a bomb alert at the school.","zh":"学校出现炸弹警报后，课程被取消。"}]},{"partOfSpeech":"phrase","definition":{"en":"A heightened state of readiness and caution because of a suspected bomb threat.","zh":"因疑似炸弹威胁而进入的高度戒备状态。"},"examples":[{"en":"Police remained on bomb alert during the event.","zh":"活动期间警方一直处于炸弹戒备状态。"},{"en":"The building stayed on bomb alert until the area was declared safe.","zh":"大楼一直处于炸弹警戒，直到确认安全。"}]}],"synonyms":["bomb threat","security alert","evacuation alert","threat alert"],"phonetic":"/bɑm əˈlɝt/","extraExplanation":["在英语新闻里，bomb alert 通常指“疑似炸弹或炸弹威胁引发的警报”。更常见也更直接的表达是 bomb threat（炸弹威胁）。","很多国家/地区对“虚假炸弹警报/谎报警情”处罚很重；日常写作中如需更中性，可用 security alert（安全警报）或 evacuation（疏散）来描述后果。"],"etymology":"由 bomb（“炸弹”，源自法语/拉丁语系词根，表示“爆炸物”）+ alert（“警戒；警报”，来自意大利语 all’erta，意为“在高处/站岗”，引申为“警惕”）组成。现代新闻与公共安全语境中常用来指“疑似炸弹”相关警报。","mnemonic":["把它拆开记：bomb=“爆”，alert=“警”。合起来就是“爆（炸）警（报）”。","alert 听起来像“啊，警！”——看到 bomb 当然要“啊，警戒起来”。"]}
{"word":"bomb out","summary":{"en":"fail very badly; sometimes be eliminated after failing to meet a standard","zh":"惨败；（有时）因不达标而被淘汰"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to fail badly (often in a performance, test, plan, or project)","zh":"惨败；彻底失败（常指表演、考试、计划或项目）"},"examples":[{"en":"I studied all week, but I still bombed out on the math test.","zh":"我学了一整周，但数学考试还是考砸了。"},{"en":"The new product bombed out because nobody understood what it did.","zh":"这款新产品惨败了，因为没人明白它到底有什么用。"},{"en":"He bombed out during the interview and couldn’t answer the basic questions.","zh":"他在面试中表现得一塌糊涂，连基本问题都答不上来。"}]},{"partOfSpeech":"phrase","definition":{"en":"to be forced to leave a program or position after failing to meet a standard (often military training or a course)","zh":"因不达标而被淘汰/被迫退出（常见于军训、训练项目或课程）"},"examples":[{"en":"Two trainees bombed out of the program after the final evaluation.","zh":"最终考核后有两名学员被项目淘汰了。"},{"en":"She almost bombed out of pilot training, but she improved and passed.","zh":"她差点在飞行员训练中被淘汰，但后来进步并通过了。"}]}],"synonyms":["fail","flop","mess up","blow it","crash and burn","wash out"],"phonetic":"/bɑm aʊt/","extraExplanation":["语气偏口语，常用于自嘲或评价结果很差：The show bombed（演出扑街）。","和 bomb 的暴力含义不同，bomb out 在多数日常语境里通常只是“失败/搞砸”，不涉及真实爆炸。"],"etymology":"源自口语动词 bomb（像“炸弹”一样把事情“炸毁”→搞砸）+ out（强调彻底、出局）。20世纪后在美式英语中常用来形容“彻底失败/出局”。","mnemonic":["联想“炸弹把事情炸没了”→结果一团糟＝惨败。","out 有“出局/被淘汰”的感觉：bomb + out → 一炸就出局。"]}
{"word":"bomb shelter","summary":{"en":"A reinforced place for protection during attacks.","zh":"用于在袭击中避难的加固场所。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A protected underground or reinforced room/building designed to keep people safe during bombing or other attacks.","zh":"防空洞；防爆掩体（用于在轰炸或其他袭击中保护人们的加固或地下避难处）"},"examples":[{"en":"When the sirens sounded, the family ran to the bomb shelter.","zh":"警报响起时，这家人跑向防空洞。"},{"en":"The school has a bomb shelter in the basement for emergencies.","zh":"学校在地下室有一个应急掩体。"},{"en":"Many older buildings still have signs pointing to the bomb shelter.","zh":"许多老建筑里仍然有指向防空洞的标识。"}]}],"synonyms":["air-raid shelter","bunker","shelter"],"phonetic":"/bɑm ˈʃɛltɚ/","extraExplanation":["在英语语境中，bomb shelter 常让人联想到二战空袭（如伦敦“闪电战”时期）以及冷战时期的民防建设。与 fallout shelter（防核辐射避难所）相关，但后者更强调核爆后的放射性尘埃防护。","常见搭配：take shelter in a bomb shelter（躲进防空洞）、head for the bomb shelter（赶往防空洞）、build/construct a bomb shelter（建造防空洞）。"],"etymology":"由 bomb（炸弹）+ shelter（避难处/庇护所）构成的复合名词；在二战及冷战时期因空袭与核威胁而广泛使用并固定下来。","mnemonic":["把它拆开记：bomb=炸弹，shelter=避难所 → “炸弹来时躲的地方”。","联想中文“防空洞/地下掩体”：通常在地下、门很厚、能抵御冲击。"]}
{"word":"bomb squad","summary":{"en":"A specialized team that handles and disables explosives.","zh":"专门处理并拆除爆炸物的队伍。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A police or military team specially trained to find, examine, and safely remove or disable explosive devices.","zh":"（警察或军队的）拆弹小组；爆炸物处理小组，专门负责发现、检查并安全移除或拆除爆炸装置。"},"examples":[{"en":"The bomb squad evacuated the building and inspected the suspicious package.","zh":"拆弹小组疏散了大楼人员，并检查了可疑包裹。"},{"en":"After the call, the bomb squad arrived within minutes.","zh":"接到电话后，拆弹小组几分钟内就赶到了。"}]}],"synonyms":["bomb disposal unit","explosive ordnance disposal","EOD unit","bomb disposal team"],"phonetic":"/bɑm skwɑd/","extraExplanation":["在新闻语境里常与“evacuate（疏散）”“suspicious package（可疑包裹）”“controlled detonation（可控引爆）”“disarm（拆除/解除）”等词一起出现。","也可写作 Bomb Squad（专有名词用大写，指某个具体城市/部门的拆弹队）。","口语或媒体里有时会比喻为“专门处理棘手危机的人/团队”，但这种用法偏修辞，需要看语境。"],"etymology":"源自 bomb（炸弹）+ squad（小队）。在20世纪随着城市治安与反恐需求增加，这种专门处理爆炸物的队伍名称逐渐固定为常用说法。","mnemonic":["把 squad 联想成“球队/小队”，bomb 是“炸弹”，合起来就是“负责炸弹的小队”→拆弹小组。"]}
{"word":"bomb-maker","summary":{"en":"“Bomb-maker” means a person who makes bombs or explosive devices, usually in a criminal context, though it can also refer to military manufacturing.","zh":"bomb-maker 指制作炸弹或爆炸装置的人，常用于犯罪语境；也可指军事生产中的炸弹制造者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who makes bombs or explosive devices, often illegally or for harmful purposes.","zh":"制炸弹者；制作爆炸装置的人（通常指非法或有害目的）。"},"examples":[{"en":"Police arrested a suspected bomb-maker after finding explosives in a garage.","zh":"警方在一间车库里发现爆炸物后，逮捕了一名疑似制炸弹者。"},{"en":"The movie focuses on a bomb-maker and the investigators trying to stop him.","zh":"这部电影聚焦一名制炸弹者以及试图阻止他的调查人员。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who designs or manufactures bombs or explosive devices for a military or government program (more formal terms are often used).","zh":"（军事或政府项目中）设计或制造炸弹/爆炸装置的人（更正式的说法常用其他词）。"},"examples":[{"en":"During the war, he worked as a bomb-maker in a munitions factory.","zh":"战争期间，他在军火工厂从事炸弹制造工作。"},{"en":"In official reports, they avoided the label “bomb-maker” and used “weapons engineer” instead.","zh":"在官方报告中，他们避免使用“bomb-maker”这个标签，而改用“weapons engineer（武器工程师）”。"}]}],"synonyms":["bomb builder","explosives maker","weapons engineer (formal)","munitions worker (formal)"],"phonetic":"/ˈbɑm ˌmeɪkɚ/","extraExplanation":["“bomb-maker”是复合名词（bomb + maker）。在新闻语境里，它常带强烈负面含义，容易与恐怖主义、犯罪联系在一起；在历史/军事工业语境中可能较中性，但仍不如“weapons engineer”“munitions worker（军火工人）”正式。","写作或讨论敏感话题时，注意避免把群体与暴力行为简单关联；更清晰的表达方式是说明具体背景（例如“suspected”“in a munitions factory”等）。"]}
{"word":"bomb-makers","summary":{"en":"Bomb-makers are people who make bombs (explosive devices), usually in a security, crime, or military context.","zh":"bomb-makers指制作炸弹（爆炸装置）的人，常见于治安、犯罪或军事语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who make bombs (explosive devices), often for military, criminal, or terrorist purposes.","zh":"制作炸弹（爆炸装置）的人，常与军事、犯罪或恐怖活动有关。"},"examples":[{"en":"Police arrested two suspected bomb-makers after finding explosives in the garage.","zh":"警方在车库发现爆炸物后，逮捕了两名疑似炸弹制造者。"},{"en":"The report warned that online manuals can help inexperienced bomb-makers.","zh":"报告警告说，网络教程可能会帮助缺乏经验的炸弹制造者。"}]}],"synonyms":["bomb builders","explosives makers","bomb constructors"],"phonetic":"/ˈbɑmˌmeɪkɚz/","extraExplanation":["“bomb-makers”是复合名词“bomb-maker”的复数形式，常用连字符把“bomb”和“maker”连接起来，强调“制作炸弹的人”。在新闻与安全语境中很常见，语气通常偏负面、带危险或违法的含义。","在正式写作中也可写作“bomb makers”（不加连字符），但作定语时更常见连字符：例如“bomb-maker materials（制弹材料）”。"]}
{"word":"bomb-thrower","summary":{"en":"A bomb-thrower is literally someone who throws bombs, and figuratively a disruptive person who attacks others with extreme remarks.","zh":"bomb-thrower字面指投掷炸弹的人；比喻指靠极端言论搅局、攻击他人的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who throws bombs; in modern speech, someone who uses violence or explosives, or who supports such actions.","zh":"投掷炸弹的人；（现代用法）使用或支持使用暴力/爆炸物的人。"},"examples":[{"en":"The police searched for the bomb-thrower after the explosion.","zh":"爆炸后，警方搜寻那名投掷炸弹的人。"},{"en":"The headline called the attacker a bomb-thrower.","zh":"标题把袭击者称为“投掷炸弹者”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, informal) A person who tries to cause trouble by making extreme, hostile, or disruptive comments—especially in politics or arguments.","zh":"（比喻，非正式）爱“扔炸弹”的搅局者：靠极端、敌对或破坏性的言论制造麻烦的人，尤见于政治或争论场合。"},"examples":[{"en":"In the debate, he acted like a bomb-thrower, attacking everyone instead of offering solutions.","zh":"在辩论中他像个“扔炸弹的人”，只攻击所有人，却不提解决办法。"},{"en":"Online bomb-throwers often post insults just to start fights.","zh":"网上的“扔炸弹者”常常只是发侮辱言论来挑事。"},{"en":"The group wanted calm discussion, not bomb-throwers.","zh":"这个团体想要冷静讨论，而不是搅局的人。"}]}],"synonyms":["terrorist","attacker","provocateur","agitator","troublemaker"],"phonetic":"/ˈbɑm ˌθroʊ.ɚ/","extraExplanation":["“bomb-thrower”是由bomb + thrower构成的复合名词。字面义比较直白；比喻义常用于政治评论或媒体语境，带有强烈贬义，暗示对方“煽动”“破坏”“不讲理”。","更中性或礼貌的替代说法可以用：provocateur（煽动者）、agitator（鼓动者）、troublemaker（捣乱者）。如果要强调言语上的“放狠话”，也可说: someone who lobs verbal grenades（口头扔手榴弹的人，口语比喻）。"]}
{"word":"bombable","summary":{"en":"Bombable means “able to be bombed” or “likely to be targeted for bombing.”","zh":"bombable 指“可被轰炸的”或“容易成为轰炸目标的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to be bombed; vulnerable or suitable as a target for bombing","zh":"可被轰炸的；容易成为轰炸目标的"},"examples":[{"en":"The factory was considered bombable because it produced weapons.","zh":"这家工厂因为生产武器而被认为是可被轰炸的目标。"},{"en":"Some areas were more bombable than others due to their open terrain.","zh":"由于地形开阔，一些地区比其他地区更容易成为轰炸目标。"},{"en":"The report described key bridges as highly bombable targets.","zh":"报告把一些关键桥梁描述为非常容易被轰炸的目标。"}]}],"synonyms":["vulnerable (to bombing)","targetable","susceptible (to attack)","at risk"],"phonetic":"/ˈbɑːməbəl/","extraExplanation":["“bombable”常见于军事、战略分析或新闻语境，强调“在技术上能被轰炸”或“在战术上适合作为轰炸目标”。在日常口语中较少使用，更常见的表达是 “can be bombed / vulnerable to bombing”。","这个词涉及暴力与战争语境；在写作或交流时可根据场合选择更中性、以安全为导向的说法，例如讨论“风险”“脆弱性”“防护不足”等。"]}
{"word":"Bombacaceae","summary":{"en":"Bombacaceae is an older botanical family name for kapok/bombax-related tropical trees, now mostly treated as part of Malvaceae.","zh":"Bombacaceae（木棉科）是旧的植物科名，多指与木棉/吉贝等相关的热带乔木类群；现代多并入锦葵科（Malvaceae）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former plant family (the bombax/kapok family) of tropical trees, known for large showy flowers and often for cottony fiber; in modern classification, most members are placed within the mallow family (Malvaceae).","zh":"木棉科（旧分类单位）：一类热带乔木的科名，以花大而显眼、部分种类可产棉絮状纤维著称；现代植物分类中，多数成员已并入锦葵科（Malvaceae）。"},"examples":[{"en":"Kapok trees were once classified in Bombacaceae in many older botany books.","zh":"在许多较早的植物学书籍里，木棉（kapok）曾被归入木棉科（Bombacaceae）。"},{"en":"The label ‘Bombacaceae’ may still appear in herbarium records and older field guides.","zh":"“Bombacaceae（木棉科）”这个名称仍可能出现在植物标本馆记录和旧版野外图鉴中。"}]}],"synonyms":["bombax family","kapok family"],"phonetic":"/ˌbɑmbəˈkeɪsi.aɪ/","extraExplanation":["“Bombacaceae”是拉丁化的植物科名，常见于较旧的分类系统。近年来基于DNA与形态证据的APG系统多将其并入锦葵科（Malvaceae）中的若干亚科/族，因此你可能会看到“旧名/同物异名”的说明。","与该类群相关的常见植物包括：木棉（Bombax）、吉贝/木棉树（Ceiba，如kapok纤维来源之一）、猴面包树（Adansonia，常也被并入更广义的锦葵科）。在阅读不同年代的资料时，注意分类单位可能不同。"]}
{"word":"bombacaceae","summary":{"en":"Bombacaceae is an older name for the kapok/baobab-related group of tropical trees, now usually included in Malvaceae (as Bombacoideae).","zh":"Bombacaceae 是木棉科的旧名称，多指与吉贝/木棉等相关的热带树木类群；现代多并入锦葵科（Malvaceae），常作木棉亚科（Bombacoideae）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former plant family (the kapok family) of mostly tropical trees, including the kapok tree, now usually treated as part of the mallow family (Malvaceae) as the subfamily Bombacoideae","zh":"（旧分类）木棉科：多为热带树木的一类（如木棉、吉贝/kapok 等）；现代分类中通常并入锦葵科（Malvaceae），多作为木棉亚科（Bombacoideae）处理"},"examples":[{"en":"In older botany books, the kapok tree was placed in the family Bombacaceae.","zh":"在较早的植物学书籍里，吉贝树（kapok tree）被归入木棉科（Bombacaceae）。"},{"en":"Some references still mention Bombacaceae, but many modern sources classify these plants under Malvaceae.","zh":"有些资料仍会提到木棉科（Bombacaceae），但许多现代资料把这些植物归入锦葵科（Malvaceae）。"}]}],"synonyms":["kapok family","Bombacoideae","(historical) Bombax family"],"phonetic":"/ˌbɑm.bəˈkeɪ.si.i/","extraExplanation":["“Bombacaceae”是较常见的旧式分类名称。随着植物系统学（尤其是基于DNA的研究）发展，很多传统“科”被重新合并或拆分；木棉科常被并入锦葵科（Malvaceae），在不少系统中对应“木棉亚科 Bombacoideae”。","词源提示：名称来自属名 Bombax（木棉属）。在学习或查资料时，看到 Bombacaceae 与 Bombacoideae/Malvaceae 的对应关系会很有帮助。"]}
{"word":"Bombacaceae-related","summary":{"en":"Associated with the plant group traditionally called Bombacaceae (kapok/silk-cotton trees).","zh":"与传统所称“木棉科”（木棉/丝棉类树木）有关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with or characteristic of the plant family Bombacaceae (the kapok or silk-cotton group), or plants traditionally placed in that family.","zh":"与木棉科（传统上包括木棉/吉贝、象牙棉等“丝棉类”植物类群）有关的；具有该科植物特征的。"},"examples":[{"en":"Researchers compared Bombacaceae-related traits such as large showy flowers and cottony seed fibers.","zh":"研究人员比较了与木棉科相关的特征，例如硕大醒目的花和种子上的棉絮状纤维。"},{"en":"The museum label mentions a Bombacaceae-related tree once used for stuffing pillows (kapok).","zh":"博物馆标签提到一种与木棉科相关的树，过去常用来填充枕头（木棉/kapok）。"}]}],"synonyms":["Bombacaceae-associated","kapok-related","silk-cotton-related","Bombacoideae-related"],"phonetic":"/bɑmˌbækˈeɪsiˌi rɪˈleɪtɪd/","extraExplanation":["“Bombacaceae-related”多见于植物分类学或科普文章中，表示“与木棉科有关”。需要注意：在较新的系统分类中，传统的木棉科（Bombacaceae）常被并入锦葵科（Malvaceae），作为其中的一个类群（如Bombacoideae亚科）。因此有些文献会同时写作“Malvaceae (Bombacoideae)-related”。","构词：Bombacaceae（木棉科名）+ related（相关的）。日常英语里较少单独使用，更常见于学术写作、标本标签或分类描述。"]}
{"word":"bombacaceous","summary":{"en":"“Bombacaceous” means “of or relating to the Bombacaceae (kapok/baobab-type) plants,” a term most common in older botanical classification.","zh":"bombacaceous 意为“木棉科的/与木棉科有关的（如木棉、猴面包树等）”，多见于较旧的植物分类语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the plant family Bombacaceae (or, in modern classification, the bombacoid group within the mallow family), which includes trees like kapok and baobab.","zh":"（植物）与木棉科（Bombacaceae；现代分类多并入锦葵科的木棉亚科/类群）有关的；木棉科的。"},"examples":[{"en":"Kapok trees are sometimes described as bombacaceous plants in older botany books.","zh":"在较早的植物学书籍里，木棉树（kapok）有时会被描述为“木棉科的（bombacaceous）植物”。"},{"en":"The garden label mentioned a bombacaceous relative of the baobab.","zh":"花园的标签提到这是一种与猴面包树（baobab）同类群的“木棉科相关（bombacaceous）”植物。"}]}],"synonyms":["Bombacaceae-related","bombacoid","mallow-family (Malvaceae) (modern classification context)"],"phonetic":"/ˌbɑːm.bəˈkeɪ.ʃəs/","extraExplanation":["“bombacaceous”源自拉丁化的家族名 Bombacaceae（与 Bombax“木棉属”有关）+ 形容词后缀 -aceous（表示“……类的/……性质的”，如 “rosaceous 蔷薇科的”）。","在现代植物分类中，传统的 Bombacaceae 常被并入锦葵科（Malvaceae），因此该词多见于旧式分类、植物志、或学术语境中。"]}
{"word":"bombace","summary":{"en":"“Bombace” is a rare, old word meaning cotton (or cotton wool/fabric), and can also mean “made of cotton.”","zh":"Bombace 是一个罕见的古词，指“棉/棉絮/棉布”，也可作形容词表示“棉制的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) cotton; cotton fiber or cotton wool, sometimes used as stuffing (wadding) or as a cotton fabric.","zh":"（古义/罕用）棉；棉纤维或棉絮（有时指填充用的絮料），也可指棉布。"},"examples":[{"en":"In older texts, “bombace” can mean cotton wool used for stuffing pillows.","zh":"在较早的文本里，bombace 可指用来填充枕头的棉絮。"},{"en":"The merchant traded in silk and bombace.","zh":"那位商人经营丝绸与棉布。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Archaic) made of cotton; cottony.","zh":"（古义/罕用）棉制的；像棉的。"},"examples":[{"en":"They described the lining as bombace rather than linen.","zh":"他们把内衬描述为棉质的，而不是亚麻的。"}]}],"synonyms":["cotton","cotton wool","wadding","cotton fabric"],"phonetic":"/bɑmˈbeɪs/","extraExplanation":["这个词在现代英语里非常少见，多见于中古或早期近代英语文献。","词源上与 Latin “bombax”（棉花）有关，进一步可追溯到希腊语相关词根，和“silk/cotton”这类纤维材料的历史贸易语境有关。","如果你是在姓名（如 Bombace 作为姓氏）或品牌名中看到它，那通常不作为普通英语词汇使用，含义需要结合具体语境。"]}
{"word":"bombacoid","summary":{"en":"Bombacoid describes plants related to or resembling kapok/ Bombax-type trees (historically Bombacaceae).","zh":"bombacoid 指与木棉科（传统 Bombacaceae）及其近缘类群相关或相似的植物特征。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Relating to, resembling, or characteristic of the kapok family and its relatives (plants once grouped in the family Bombacaceae), such as Bombax or Ceiba trees.","zh":"（植物学）与木棉科及其近缘类群有关的；或形态、特征上类似木棉科植物（如木棉属 Bombax、吉贝/美洲木棉属 Ceiba 等）的。"},"examples":[{"en":"The field guide notes bombacoid trees by their large flowers and silky seed fibers.","zh":"野外图鉴提到，木棉科类群的树常因花朵很大、种子带丝状纤维而容易辨认。"},{"en":"In some classifications, certain species once called “bombacoid” are now placed within the broader mallow family (Malvaceae).","zh":"在一些分类体系中，过去被称为“木棉科类群”的某些物种，如今被归入更广义的锦葵科（Malvaceae）。"}]}],"synonyms":["bombaceous","kapok-like"],"phonetic":"/bɑmˈbeɪkɔɪd/","extraExplanation":["“bombacoid”由属名 Bombax（木棉属）+ 后缀 -oid（“……样的/类似的”）构成，常见于植物分类与形态描述中。","现代分类学里，传统的“木棉科（Bombacaceae）”常被并入更大的锦葵科（Malvaceae），因此你会在较新的资料里看到“bombacoid clade/木棉类群”这类表述，用来指锦葵科内部与木棉科相近的一支。"]}
{"word":"Bombacoideae","summary":{"en":"Bombacoideae is a botanical subfamily in Malvaceae that includes baobab- and kapok-type trees.","zh":"Bombacoideae 是锦葵科中的一个植物亚科，包含猴面包树与木棉（kapok）等类群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a subfamily of the mallow family (Malvaceae) that includes trees such as baobabs and kapok; many members have large showy flowers and fluffy, fiber-filled fruits.","zh":"锦葵科（Malvaceae）中的一个亚科，包含如猴面包树、木棉（kapok）等树木；许多成员花朵大而醒目，果实常含絮状纤维。"},"examples":[{"en":"Baobabs are often classified in the subfamily Bombacoideae.","zh":"猴面包树常被归入锦葵科的Bombacoideae（木棉亚科）。"},{"en":"Some Bombacoideae species produce silky fibers that were once used for stuffing pillows.","zh":"一些Bombacoideae物种会产生丝状絮纤维，过去常用来填充枕头。"}]}],"synonyms":["Bombax subfamily","subfamily Bombacoideae"],"phonetic":"/ˌbɑːmˌbeɪˈkɔɪdiˌiː/","extraExplanation":["这是一个植物分类学术语（亚科名）。常见属群包括 Adansonia（猴面包树/baobab）与 Ceiba（美洲木棉/kapok）。","词源上与拉丁化的属名 Bombax（木棉属）有关；现代分类多基于形态与分子证据，将相关属群归入锦葵科下的 Bombacoideae。"]}
{"word":"bombard","summary":{"en":"Bombard means to attack repeatedly (often with bombs or shells), or to overwhelm someone with many messages, questions, or requests.","zh":"bombard 指（用炸弹、炮弹等）连续轰炸/猛烈攻击，也可指用大量信息、问题或要求“轮番轰炸”，让人应接不暇。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to attack or hit a place repeatedly with bombs, shells, or other weapons","zh":"（用炸弹、炮弹等）连续轰炸；猛烈攻击"},"examples":[{"en":"The city was bombarded for days during the war.","zh":"战争期间，这座城市被连续轰炸了好几天。"},{"en":"The army bombarded enemy positions before sending in troops.","zh":"军队在派兵前先对敌方阵地进行了炮击。"}]},{"partOfSpeech":"vt.","definition":{"en":"to overwhelm someone with a large number of questions, messages, or requests","zh":"（用大量问题、信息或要求）轮番轰炸；使应接不暇"},"examples":[{"en":"After the announcement, the company was bombarded with emails.","zh":"发布消息后，公司收到了大量邮件，简直被“邮件轰炸”。"},{"en":"Reporters bombarded the actor with questions about the scandal.","zh":"记者们就丑闻轮番向那位演员抛出问题。"}]}],"synonyms":["shell","bomb","pelt","assault","deluge","flood","inundate"],"phonetic":"/bɑmˈbɑrd/","extraExplanation":["“bombard”最早与“bomber（投弹者/轰炸机）”“bomb（炸弹）”相关，核心含义是“连续、密集地攻击”。因此它很自然地被引申到日常语境，表示“信息/问题/请求像炮火一样密集”，常见搭配有：be bombarded with + 名词（emails/questions/ads）。"]}
{"word":"bombard ... with","summary":{"en":"to overwhelm by repeated attacks or a large number of things","zh":"以连续攻击或大量事物使人应接不暇"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to attack or hit someone or something repeatedly with a lot of things (questions, messages, criticism, etc.)","zh":"用大量事物（问题、信息、批评等）不断“轰炸”某人/某物；接连不断地抛给（某人）"},"examples":[{"en":"After the announcement, the company was bombarded with emails from customers.","zh":"公告发布后，公司收到了客户接连不断的邮件。"},{"en":"The reporter bombarded the mayor with questions about the budget.","zh":"记者就预算问题连珠炮似地向市长提问。"},{"en":"Online, teenagers can be bombarded with ads all day.","zh":"在网上，青少年可能整天都会被广告“轰炸”。"}]},{"partOfSpeech":"vt.","definition":{"en":"to attack a place with bombs, shells, or gunfire (often in war)","zh":"（战争中）轰炸；炮击"},"examples":[{"en":"The city was bombarded for days before the troops moved in.","zh":"部队进入之前，这座城市被连续轰炸了好几天。"},{"en":"The navy bombarded the fort from the sea.","zh":"海军从海上炮击了要塞。"}]}],"synonyms":["assault","pelt","barrage","deluge","inundate","flood","pepper","shell"],"phonetic":"/bɑmˈbɑrd/","extraExplanation":["固定搭配：be bombarded with + 名词（emails/questions/requests/complaints/ads 等）。语气较强，带“数量多、来得猛、让人招架不住”的感觉。","与 be flooded with 很像，但 bombarded with 更强调“攻击性/压力感”，而 flooded with 更中性地强调“数量多”。"],"etymology":"源自法语 bombard（“用炮轰击”），与 bombard（古代一种火炮名）相关；后来引申出比喻义：用信息/问题/批评“狂轰滥炸”。","mnemonic":["联想“bomb（炸弹）+ -ard（像不断地…）”：bombard 就像不停扔“炸弹”，比喻里就是不停丢问题/信息。","把 with 记成“用……来轰炸”：bombard someone with questions = 用问题轰炸某人。"]}
{"word":"bombard with","summary":{"en":"to overwhelm by sending many attacks, questions, or messages repeatedly","zh":"用大量攻击/问题/信息反复冲击，使人应接不暇"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to attack or hit someone/something repeatedly with many things (such as questions, messages, or criticism)","zh":"用大量事物（如问题、消息、批评等）不断“轰炸”某人/某事"},"examples":[{"en":"Reporters bombarded the mayor with questions after the meeting.","zh":"会后，记者们用一连串问题不断追问市长。"},{"en":"My inbox was bombarded with notifications all morning.","zh":"我整个上午邮箱都被通知消息“轰炸”了。"},{"en":"She was bombarded with criticism online.","zh":"她在网上遭到铺天盖地的批评。"}]},{"partOfSpeech":"phrase","definition":{"en":"to attack a place or enemy continuously with bombs or gunfire (literal meaning)","zh":"（字面）用炸弹或炮火持续轰炸（某地/敌方）"},"examples":[{"en":"The planes bombarded the coastal defenses with bombs.","zh":"飞机用炸弹轰炸了海岸防御工事。"},{"en":"The city was bombarded with artillery for days.","zh":"这座城市遭到炮火轰炸好几天。"}]}],"synonyms":["pelt","barrage","deluge","inundate","assail","overwhelm","besiege","pepper","hit with","shower with"],"phonetic":"/bɑmˈbɑrd wɪð/","extraExplanation":["常见结构：bombard someone with something（用大量某物不断“轰炸”某人）；或 be bombarded with something（被大量某物“轰炸”）。","语气与搭配：多用于强调“数量多、来得快、让人应接不暇”，常搭配 questions, emails, messages, calls, requests, criticism, ads, notifications。"],"etymology":"源自“bombard”（轰炸），来自法语 bombardier（投弹、炮击），与 bomb（炸弹）同源；“bombard with + 名词”常用于比喻：用大量信息/问题/批评持续冲击。","mnemonic":["把它想成“bomb（炸弹）+ -ard（连续动作的感觉）”：不是一颗炸弹，而是一连串地扔——就像问题/消息一波接一波。","中文联想：=“信息轰炸/问题轰炸”，与中文说法几乎一一对应。"]}
{"word":"bombarde","summary":{"en":"Bombarde most commonly refers to a loud medieval double‑reed instrument (especially in Breton music), and less commonly to an early large cannon (often spelled “bombard”).","zh":"Bombarde 最常指一种声音高亢的中世纪双簧木管乐器（尤见于法国布列塔尼音乐）；也可指早期大型火炮（常拼作 bombard）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medieval double‑reed wind instrument (similar to a shawm), with a loud, piercing sound; a historical ancestor of the oboe family.","zh":"（中世纪的）双簧管类木管乐器，音色高亢响亮；可视为双簧管家族的早期祖先之一。"},"examples":[{"en":"The musician played a bombarde during the traditional Breton dance.","zh":"音乐家在布列塔尼传统舞蹈中演奏了 bombarde。"},{"en":"Its bright, penetrating tone can carry over a crowd outdoors.","zh":"它明亮、穿透力强的音色在户外人群中也能传得很远。"}]},{"partOfSpeech":"n.","definition":{"en":"an early type of large cannon used in the late Middle Ages (also spelled “bombard”).","zh":"（中世纪晚期的）早期大型火炮（也可拼作 bombard）。"},"examples":[{"en":"The castle walls were damaged by a bombarde during the siege.","zh":"城堡的城墙在围城中被 bombarde 轰击而受损。"},{"en":"Historians describe the bombarde as one of the first heavy artillery weapons in Europe.","zh":"历史学家把 bombarde 描述为欧洲最早的重型火炮之一。"}]}],"synonyms":["shawm","bombard"],"phonetic":"/bɑmˈbɑrd/","extraExplanation":["“Bombarde”常见于法国文化语境，尤其是布列塔尼（Brittany）传统音乐中，经常与风笛（如 biniou）搭配演奏，用于舞曲与节庆。","词源与法语/中古拉丁语中表示“轰鸣、爆裂”的词有关，因此既可指“乐器”（声音响亮）也可指“火炮”（爆炸轰鸣）；在英语中作“火炮”义时更常见拼写为“bombard”。"]}
{"word":"bombarded","summary":{"en":"Bombarded means repeatedly attacked (literally) or overwhelmed by a flood of messages, questions, or information.","zh":"bombarded 表示“被反复轰炸/连续攻击”（字面义），也常指“被大量信息、问题或请求不断冲击而不堪应付”（引申义）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"attacked repeatedly with bombs, bullets, or other weapons; hit again and again.","zh":"（遭到）反复轰炸的；连续攻击的。"},"examples":[{"en":"The city was bombarded during the war.","zh":"这座城市在战争期间遭到反复轰炸。"},{"en":"The base was bombarded for hours before the troops moved in.","zh":"部队进入前，基地被连续轰击了好几个小时。"}]},{"partOfSpeech":"adj.","definition":{"en":"overwhelmed by a large number of things (especially questions, requests, ads, or information) arriving quickly.","zh":"（被大量信息/问题/请求等）不断涌来而不堪应付的。"},"examples":[{"en":"I was bombarded with emails after the announcement.","zh":"公告发布后，我被邮件轰炸得应接不暇。"},{"en":"Celebrities are bombarded by reporters’ questions.","zh":"名人常常被记者的问题连珠炮似地追问。"},{"en":"Kids are bombarded with ads on social media.","zh":"孩子们在社交媒体上不断受到广告轰炸。"}]},{"partOfSpeech":"v.","definition":{"en":"simple past and past participle of “bombard”: to attack or to overwhelm with many things.","zh":"“bombard”的过去式和过去分词：轰炸；（用大量事物）不断冲击/淹没。"},"examples":[{"en":"They bombarded the area with rockets.","zh":"他们用火箭弹轰击该地区。"},{"en":"The interviewer bombarded him with questions.","zh":"采访者连珠炮似地向他提问。"}]}],"synonyms":["attacked","pelted","assailed","targeted","besieged","overwhelmed","flooded"],"phonetic":"/bɑmˈbɑrdɪd/","extraExplanation":["“bombard”最早和一种早期火炮“bombard（轰击炮）”有关，因此本义偏军事；现代英语里非常常见的引申义是“信息/提问/广告轰炸”，语气较形象，表示数量多、来得快，让人压力很大。"]}
{"word":"bombardelle","summary":{"en":"A bombardelle is a small, high‑pitched Renaissance double‑reed instrument (a small bombard/shawm).","zh":"bombardelle 指一种文艺复兴时期的小型高音双簧乐器（小型 bombard/肖姆）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, high‑pitched double‑reed woodwind instrument from Renaissance/early Baroque Europe; essentially a smaller member of the bombard (shawm) family.","zh":"一种文艺复兴至巴洛克早期欧洲的小型高音双簧木管乐器；本质上是“bombard（肖姆/沙姆）”家族中更小的一员。"},"examples":[{"en":"In an early‑music ensemble, the bombardelle often plays bright, piercing melody lines.","zh":"在古乐合奏中，bombardelle 常常演奏明亮、穿透力强的旋律声部。"},{"en":"The museum displayed a bombardelle next to larger shawms to show how the family evolved.","zh":"博物馆把 bombardelle 和更大的肖姆类乐器并排展示，用来说明这一乐器家族的演变。"}]}],"synonyms":["bombard","shawm"],"phonetic":"ˌbɑm.bɑrˈdɛl","extraExplanation":["“Bombardelle”在英语里相对少见，多见于古乐（early music）领域的资料或乐器名录中。它与“bombard / shawm（肖姆）”同属双簧乐器，音色通常比现代双簧管更尖亮、音量更大，适合户外或仪式性演奏。","拼写上也可能遇到变体如“bombardella”。如果你是在某篇文章/曲目说明里看到它，通常指的就是这一类历史乐器，而不是现代管弦乐常用的乐器。"]}
{"word":"bombarder","summary":{"en":"A bombarder is someone or something that bombards—attacks or hits repeatedly, often by bombing.","zh":"bombarder 指“轰炸者/连续猛烈攻击者”，常与轰炸或反复攻击有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or thing that bombards (attacks or hits repeatedly), especially by dropping bombs or firing many projectiles.","zh":"进行轰炸/连续猛烈攻击的人或物（尤指投掷炸弹或密集射击）。"},"examples":[{"en":"During the war, the town feared nightly attacks from bombarder aircraft.","zh":"战争期间，这座城镇害怕轰炸机夜间来袭。"},{"en":"Online, a few users acted as “bombarders,” flooding the comments with repeated messages.","zh":"在网上，有些用户像“轰炸者”一样，用重复信息刷屏评论区。"}]}],"synonyms":["bomber","attacker","assailant","aggressor","bombardier"],"phonetic":"/bɑmˈbɑrdər/","extraExplanation":["“bombarder”在现代英语中不常用，更常见的说法是“bomber”（轰炸机/轰炸者）或“attacker”（攻击者）。在一些语境里也可用来比喻“用信息/问题/批评连续轰炸的人”。"]}
{"word":"bombardier","summary":{"en":"A bombardier is usually an aircraft crew member who aims and releases bombs; more generally, it can mean someone who carries out bombardment.","zh":"bombardier通常指飞机上的投弹员；广义上也可指实施轰炸或炮击的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A member of an aircraft crew whose job is to aim and release bombs (especially in older military aircraft).","zh":"（尤指早期军用飞机上的）投弹员；负责瞄准并投放炸弹的机组成员。"},"examples":[{"en":"In World War II movies, the bombardier often lies in the nose of the plane to guide the bomb drop.","zh":"在二战题材电影里，投弹员常常趴在机头位置，负责引导投弹。"},{"en":"The pilot flew the plane while the bombardier watched the target through a sighting device.","zh":"飞行员驾驶飞机，而投弹员通过瞄准装置观察目标。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who launches bombs or shellfire; a bomber or artillery attacker.","zh":"投掷炸弹或进行炮击的人；轰炸者；炮击者。"},"examples":[{"en":"The city was under attack by artillery bombardiers.","zh":"这座城市遭到炮击者的攻击。"},{"en":"The report described the bombardiers moving into position at night.","zh":"报告描述轰炸/炮击人员在夜间进入阵地。"}]}],"synonyms":["bomb aimer","bomber","attacker","artilleryman"],"phonetic":"/ˌbɑm.bɚˈdɪr/","extraExplanation":["“bombardier”来自“bombard”（轰炸、炮击）。在英语里最常见、也最具体的用法是指旧式轰炸机上的“投弹员”（如二战时期）。现代军机多由电子系统与飞行员/武器官共同完成投放，因此该职位在现实军语中相对少见，但在历史叙述与影视作品中很常出现。","不要与加拿大交通工具/装备品牌“Bombardier（庞巴迪）”混淆：品牌名源自姓氏，书写相同但语境完全不同。"]}
{"word":"bombardiers","summary":{"en":"Bombardiers are people who aim and drop bombs from aircraft; the word can also mean an artillery rank in some armies.","zh":"bombardiers 指投弹员（负责瞄准并投放炸弹的人）；也可指某些军队炮兵部队中的军衔/职务“炮兵下士”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A member of an aircraft crew who aims and releases bombs (a “bomb aimer”); also, by extension, someone who drops bombs.","zh":"（空军）投弹员；在飞机上负责瞄准并投放炸弹的人；也可泛指投放炸弹的人。"},"examples":[{"en":"During World War II, the bombardier lay in the nose of the plane to guide the bomb drop.","zh":"在二战时期，投弹员常趴在机头位置引导投弹。"},{"en":"The film follows a young bombardier on his first mission.","zh":"这部电影讲述了一位年轻投弹员的首次任务。"}]},{"partOfSpeech":"n.","definition":{"en":"A military rank/role in some artillery units (especially in British/Commonwealth traditions), roughly associated with a junior non-commissioned officer.","zh":"（某些炮兵部队中的）军衔/职务“炮兵下士（Bombardier）”；在英联邦传统中常见，约相当于初级士官。"},"examples":[{"en":"He served as a bombardier in an artillery regiment before becoming a sergeant.","zh":"他在晋升为中士之前，曾在炮兵团担任炮兵下士。"},{"en":"The unit promoted two gunners to bombardier last month.","zh":"该部队上个月将两名炮手晋升为炮兵下士。"}]}],"synonyms":["bomb aimer","bomber crewman","gunner (artillery)"],"phonetic":"ˌbɑm.bɚˈdɪr","extraExplanation":["“bombardier”来自“bombard（轰炸）”，在早期航空作战中是非常明确的机组分工：投弹员负责计算、瞄准与投放。现代战机中这一职能常由飞行员或武器系统军官（WSO）以及电子系统辅助完成，因此日常新闻里不如过去常见。","复数“bombardiers”常见于历史叙述、军事回忆录或编制描述中；如果你是在体育或公司名称里看到（如加拿大的Bombardier公司），那是专有名词，不一定与“投弹员”直接相关。"]}
{"word":"bombarding","summary":{"en":"“Bombarding” means repeatedly attacking with bombs, or (more commonly in daily speech) overwhelming someone with many questions/messages at once.","zh":"“bombarding”既可指反复轰炸，也常比喻在短时间内用大量问题/信息让人应接不暇。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"attacking a place repeatedly with bombs or heavy weapons","zh":"用炸弹或重型武器反复轰炸（某地）"},"examples":[{"en":"The city was bombarding the enemy’s positions day and night.","zh":"这座城市日夜轰炸敌方阵地。"},{"en":"News reports showed aircraft bombarding targets near the border.","zh":"新闻报道显示飞机在边境附近轰炸目标。"}]},{"partOfSpeech":"v.","definition":{"en":"sending someone a large number of questions, requests, or messages in a short time","zh":"在短时间内向某人连珠炮式地提问/要求/发消息"},"examples":[{"en":"After the announcement, reporters kept bombarding her with questions.","zh":"宣布之后，记者不断向她抛出一连串问题。"},{"en":"My phone was bombarding me with notifications all morning.","zh":"我的手机整个上午都在用通知“轰炸”我。"}]}],"synonyms":["attack","shell","pelt","deluge","inundate"],"phonetic":"/bɑmˈbɑrdɪŋ/","extraExplanation":["“bombarding”通常是动词 bombard 的现在分词/动名词形式。既可用于字面上的军事“轰炸”，也常用于比喻，表示信息、问题、广告等“铺天盖地”地涌来。","常见搭配：bombard someone with questions/messages/requests（用问题/信息/请求轰炸某人）；bombard a city/area/position（轰炸城市/地区/阵地）。"]}
{"word":"bombardman","summary":{"en":"“Bombardment” means repeated bombing/shelling, or (figuratively) a continuous flood of questions, messages, or criticism.","zh":"“bombardment”指反复轰炸/炮击；也可比喻为持续不断的大量提问、信息或批评。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a military attack in which bombs or shells are repeatedly dropped or fired at a place","zh":"（军事）轰炸；炮击（对某地反复投弹或开炮的攻击）"},"examples":[{"en":"The city endured three days of heavy bombardment.","zh":"这座城市经受了三天的猛烈轰炸。"},{"en":"During the bombardment, many people took shelter underground.","zh":"轰炸期间，许多人在地下避难。"}]},{"partOfSpeech":"n.","definition":{"en":"a large number of questions, messages, or criticisms given to someone continuously (often in a stressful way)","zh":"（比喻）连珠炮式的提问/信息轰炸/批评（常带来压力）"},"examples":[{"en":"After the announcement, the company faced a bombardment of emails.","zh":"公告发布后，公司收到了大量邮件“轰炸”。"},{"en":"The athlete received a bombardment of questions from reporters.","zh":"这位运动员遭到记者连珠炮式的提问。"}]}],"synonyms":["attack","shelling","airstrike","barrage","onslaught","flood (of messages)"],"phonetic":"/bɑmˈbɑrdmənt/","extraExplanation":["“bombardman”本身不是常见或标准英语单词。你可能想查的是 **bombardment**（名词：轰炸/密集攻击）或 **bombard**（动词：轰炸；用大量问题/信息轰炸）。如果你告诉我你看到它的句子或上下文，我也可以帮你确认具体意思。"]}
{"word":"bombardmen","summary":{"en":"Bombardment means a heavy, repeated attack with bombs or shells, or (figuratively) a continuous flood of things like questions or messages.","zh":"Bombardment 指持续猛烈的轰炸/炮击，也可引申为问题、信息等“连番涌来”的冲击。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of attacking a place with bombs, shells, or other weapons, usually repeatedly and heavily.","zh":"（通常指持续、猛烈的）轰炸；炮击。"},"examples":[{"en":"The city was under heavy bombardment for three days.","zh":"这座城市遭受了三天的猛烈轰炸。"},{"en":"Many families fled during the bombardment.","zh":"许多家庭在轰炸期间逃离了。"},{"en":"After the bombardment ended, rescue teams entered the area.","zh":"轰炸结束后，救援队进入了该地区。"}]},{"partOfSpeech":"n.","definition":{"en":"A large amount of something arriving quickly and continuously (often information, questions, or criticism).","zh":"（信息、问题、批评等的）连番而来；大量涌来。"},"examples":[{"en":"After the announcement, the office received a bombardment of emails.","zh":"公告发布后，办公室收到了大量邮件。"},{"en":"The politician faced a bombardment of questions from reporters.","zh":"这位政治人物面对记者连珠炮般的提问。"}]}],"synonyms":["shelling","air raid","attack","barrage","onslaught","flood"],"phonetic":"/bɑmˈbɑrdmənt/","extraExplanation":["你输入的“bombardmen”很可能是拼写错误；常见正确拼写是 **bombardment**（名词）。对应的动词是 **bombard**（轰炸；连番攻击）。","在新闻报道中，**bombardment** 常用于战争语境（如 *air bombardment* 空袭轰炸、*artillery bombardment* 炮击）。在日常语境里，它也可比喻“信息轰炸/问题轰炸”。"]}
{"word":"bombardment","summary":{"en":"Bombardment means a sustained attack with bombs/shells, or (figuratively) an overwhelming stream of messages or questions.","zh":"bombardment 指持续的轰炸/炮击；也可比喻信息、问题等接连不断地涌来，使人应接不暇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A continuous or repeated attack with bombs, shells, or gunfire, especially in war.","zh":"（尤指战争中的）连续或反复的轰炸；炮击。"},"examples":[{"en":"The city endured a heavy bombardment for three days.","zh":"这座城市遭受了三天的猛烈轰炸。"},{"en":"Civilians took shelter during the bombardment.","zh":"轰炸期间，平民躲进了避难所。"}]},{"partOfSpeech":"n.","definition":{"en":"A large number of things (questions, messages, advertisements, etc.) aimed at someone continuously; an overwhelming stream.","zh":"（问题、信息、广告等）接连不断的“轰炸”；大量涌来，使人应接不暇。"},"examples":[{"en":"After the announcement, the company faced a bombardment of emails.","zh":"公告发布后，公司收到了大量邮件的“轰炸”。"},{"en":"Students often feel a bombardment of information during exam week.","zh":"考试周学生常常感觉信息量像“轰炸”一样涌来。"}]}],"synonyms":["shelling","airstrike","barrage","onslaught","deluge"],"phonetic":"/bɑmˈbɑrdmənt/","extraExplanation":["“bombardment”来自动词 bombard（轰炸），常见于新闻与历史叙述。除了字面军事含义，它也很常用于比喻：把密集的问题、消息、营销内容比作“轰炸”，语气通常带有压力感或抱怨意味。","搭配提示：heavy/intense bombardment（猛烈轰炸）；under bombardment（在轰炸之下）；a bombardment of questions/emails/ads（大量问题/邮件/广告）。"]}
{"word":"bombardments","summary":{"en":"“Bombardments” means repeated heavy attacks with bombs or shells; it can also mean a flood of repeated questions, criticism, or messages.","zh":"“Bombardments”指持续密集的轰炸/炮击；也可比喻为连番不断的提问、批评或信息轰炸。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the acts of attacking a place with many bombs or shells over a period of time (plural of “bombardment”)","zh":"（bombardment 的复数）指在一段时间内用大量炸弹或炮弹对某地进行持续轰炸/炮击的行为"},"examples":[{"en":"The city suffered heavy bombardments during the war.","zh":"战争期间，这座城市遭受了猛烈的轰炸。"},{"en":"After days of bombardments, many families fled the area.","zh":"连续几天的轰炸后，许多家庭逃离了该地区。"}]},{"partOfSpeech":"n.","definition":{"en":"a large number of repeated attacks, criticisms, questions, or messages (used figuratively)","zh":"（比喻）指接连不断的大量“攻击”，如批评、质问、信息轰炸等"},"examples":[{"en":"The spokesperson faced bombardments of questions from reporters.","zh":"发言人面对记者接连不断的提问。"},{"en":"I turned off notifications to avoid constant bombardments of messages.","zh":"我关闭了通知，以避免消息不断轰炸。"}]}],"synonyms":["shellings","airstrikes","attacks","barrages","onslaughts"],"phonetic":"/bɑmˈbɑrdmənts/","extraExplanation":["“bombardment”最常见于战争语境，强调“持续、密集”的炮击/轰炸，而不仅仅是一次爆炸（explosion）。","在日常英语里，常用比喻义表示“信息或问题的连番冲击”，语气比“a lot of messages/questions”更强烈，带有压力感。"]}
{"word":"bombardo","summary":{"en":"Bombardo is a loud Renaissance-era double-reed woodwind (a kind of shawm), historically used outdoors and related to early bassoon-type instruments.","zh":"Bombardo 是文艺复兴时期一种声音很响的双簧木管乐器（肖姆管的一种），常用于户外演奏，并与早期巴松管类乐器有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Renaissance and early Baroque double-reed woodwind instrument (a type of very loud shawm), often used outdoors; related to the modern bassoon family","zh":"（文艺复兴及早期巴洛克时期的）一种双簧木管乐器，属“肖姆管（shawm）”家族，声音很响，常用于户外演奏；与现代巴松管家族有渊源"},"examples":[{"en":"The ensemble used a bombardo to add a powerful, outdoor sound.","zh":"乐团使用 bombardo 来增加一种强劲、适合户外的音色。"},{"en":"In Renaissance festivals, the bombardo often played alongside drums and shawms.","zh":"在文艺复兴主题的节庆中，bombardo 常与鼓和肖姆管一同演奏。"}]}],"synonyms":["bombard","shawm"],"phonetic":"/bɑmˈbɑrdoʊ/","extraExplanation":["“Bombardo”在英语里属于较少见、偏音乐史/古乐（early music）的词，常见于乐器学、古乐演出介绍或博物馆说明。","它与“bombard（也可指一种古老的低音肖姆管）”在词源与指称上有关；不同资料里拼写和分类可能会有差异，但核心概念是“响亮的双簧管类古乐器”。"]}
{"word":"bombardon","summary":{"en":"A bombardon is an old term for a very large, low brass instrument—essentially an early kind of tuba.","zh":"bombardon 是一种早期的大型低音铜管乐器的旧称，基本相当于早期形态的“大号”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very large low-pitched brass instrument, especially an early form of the tuba used in 19th‑century bands","zh":"一种体积很大的低音乐器（铜管乐器），尤指19世纪乐队中使用的早期“大号”形式"},"examples":[{"en":"The march was anchored by a deep bombardon line.","zh":"这首进行曲由浑厚的bombardon低音声部支撑着。"},{"en":"In the museum, you can see a bombardon that predates the modern tuba.","zh":"在博物馆里，你可以看到一件早于现代大号的bombardon。"}]}],"synonyms":["tuba","bass tuba","helicon"],"phonetic":"/ˈbɑm.bɑr.dən/","extraExplanation":["词源与背景：bombardon 来自法语 bombardon，与 bombard（轰击）同源，暗示其声音“厚重、有冲击力”。在19世纪的军乐队/行进乐队里，它常指早期的低音铜管乐器（接近或等同于低音大号）。随着乐器标准化，“tuba（大号）”逐渐成为更常用的名称。","用法提示：在现代英语中 bombardon 很少见，多出现在历史音乐文献、乐器收藏/博物馆介绍或复古语境里。"]}
{"word":"bombards","summary":{"en":"“Bombards” is usually the third-person singular of “bombard,” meaning to attack repeatedly or overwhelm with many messages/questions; it can also mean large historical cannons (plural).","zh":"“bombards”通常是动词“bombard”的第三人称单数，表示连续猛烈攻击或用大量信息/问题让人应接不暇；也可作名词，指（复数）历史上的大型火炮。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(verb) third-person singular of “bombard”: to attack or hit someone/something with many shots, bombs, or other weapons; or to overwhelm someone with a large amount of information, questions, or requests.","zh":"（动词）“bombard”的第三人称单数：用大量炮火/炸弹等猛烈攻击；也可指用大量信息、问题或请求让人应接不暇。"},"examples":[{"en":"The army bombards the area at night.","zh":"军队在夜间猛烈炮击该地区。"},{"en":"During the sale, customers bombard the store with questions online.","zh":"促销期间，顾客在网上用大量问题“轰炸”店铺。"}]},{"partOfSpeech":"n.","definition":{"en":"(noun) plural of “bombard”: large cannons (especially in historical contexts).","zh":"（名词）“bombard”的复数：大型火炮（多用于历史语境）。"},"examples":[{"en":"The museum displays bombards used in medieval sieges.","zh":"博物馆展出了中世纪攻城时使用的大型火炮。"}]}],"synonyms":["attacks","shells","pummels","assails","barrages","overwhelms"],"phonetic":"/bɑmˈbɑrdz/","extraExplanation":["“bombard”源自法语，和“bomb（炸弹）”同源，核心意象是“连续不断地猛攻”。现代英语里很常见的比喻用法是“信息轰炸/问题轰炸”（be bombarded with emails/questions）。","作为动词时，原形是 bombard；bombards 常见于一般现在时（He/She/It bombards...）。在新闻报道中也常出现被动结构：be bombarded (with/by...)."]}
{"word":"bombasine","summary":{"en":"Bombasine is a traditional twilled fabric (often wool-and-silk) and can also mean clothing made from it, commonly linked to mourning wear in older texts.","zh":"Bombasine指一种传统斜纹混织布（常为毛丝混纺），也可作形容词指用这种布做的衣物；在旧文本中常与丧服/哀悼服饰相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a twilled fabric (often silk and worsted, or wool with silk), traditionally used for dress clothes and especially for mourning clothes","zh":"一种斜纹布料（常由丝与精纺毛混织，或以羊毛为主夹丝），传统上用于制作衣物，尤常用于丧服"},"examples":[{"en":"In the 1800s, people often wore bombasine during periods of mourning.","zh":"在19世纪，人们在守丧期间常穿bombasine（这种布料制成的衣服）。"},{"en":"The tailor suggested a darker bombasine for a formal coat.","zh":"裁缝建议用更深色的bombasine做一件正式外套。"}]},{"partOfSpeech":"adj.","definition":{"en":"made of bombasine fabric","zh":"由bombasine（斜纹混织布）制成的"},"examples":[{"en":"She kept an old bombasine dress in a trunk.","zh":"她在箱子里保存着一件旧的bombasine连衣裙。"},{"en":"The character appears in a bombasine gown to show grief.","zh":"角色穿着bombasine长裙出场，以表现哀悼。"}]}],"synonyms":["bombazine","twill (general)","woolen cloth (general)"],"phonetic":"/ˈbɑm.bəˌzin/","extraExplanation":["“bombasine”常见拼写也有“bombazine”。在英语文学与历史语境里，它常与维多利亚时代的丧葬礼仪、守丧服饰相关，通常指深色、质地较厚且带斜纹的布料。","在阅读旧小说或历史文本时，如果看到人物穿“bombasine”，往往暗示身份较端庄、场合正式，或正处于哀悼期。"]}
{"word":"bombast","summary":{"en":"Bombast is exaggerated, high-sounding language that seems impressive but is often empty or unnatural.","zh":"bombast 指听起来很宏大却浮夸、空洞或不自然的夸张言辞/文风。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Language or writing that sounds impressive but is too exaggerated, inflated, or over-the-top, often hiding a lack of real meaning.","zh":"（语言/写作）浮夸的辞藻；言过其实、听起来很“宏大”但内容空洞的表达。"},"examples":[{"en":"His speech was full of bombast, but it didn’t explain how he would solve the problem.","zh":"他的演讲满是浮夸的辞藻，但并没有说明他要如何解决问题。"},{"en":"The movie trailer used lots of bombast to make a simple story seem epic.","zh":"电影预告片用了很多夸张的渲染，让一个简单的故事看起来很史诗。"}]},{"partOfSpeech":"n.","definition":{"en":"A style of speaking or writing that uses grand, high-sounding words in a way that feels unnatural or ridiculous.","zh":"一种（说话/写作）文风：用高大上的词堆砌，显得不自然，甚至可笑。"},"examples":[{"en":"She prefers clear, direct language and avoids bombast in her essays.","zh":"她更喜欢清晰直接的表达，在作文里会避免浮夸文风。"},{"en":"The review criticized the politician’s bombast as a way to distract the public.","zh":"评论批评那位政客用浮夸言辞来转移公众注意力。"}]}],"synonyms":["pompous language","grandiloquence","inflated language","hot air","bluster"],"phonetic":"/ˈbɑmˌbæst/","extraExplanation":["“bombast”常带有批评意味，暗示“气势很足但缺乏实质内容”。比起“confident / persuasive（自信/有说服力）”，bombast更强调“夸大、虚张声势”。","词源上，bombast原指“棉花填充物（padding）”，后来引申为“用辞藻把内容‘填得很鼓’”，也就是语言上的“加厚垫高”。","常见搭配：empty bombast（空洞的夸夸其谈）、political bombast（政治夸张言辞）、full of bombast（充满浮夸）。相关词：bombastic（adj. 浮夸的）、grandiose（adj. 夸大的）、pompous（adj. 自大而做作的）。"]}
{"word":"bombaster","summary":{"en":"A bombaster is someone who speaks or writes in an overly exaggerated, showy way.","zh":"bombaster 指说话或写作浮夸、夸张、爱摆排场的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who uses bombast; someone who speaks or writes in an overly loud, fancy, or exaggerated way to impress others","zh":"使用夸夸其谈（浮夸语言）的人；说话或写作过分华丽、夸张以博取注意或显得厉害的人"},"examples":[{"en":"The audience quickly realized the speaker was just a bombaster with no clear plan.","zh":"观众很快意识到，这位演讲者只是个夸夸其谈的人，根本没有清晰的计划。"},{"en":"Her essay sounded confident, but the teacher marked it down for being the work of a bombaster rather than a careful thinker.","zh":"她的文章听起来很自信，但老师认为它更像是浮夸之人的作品，而不是严谨思考的结果。"}]}],"synonyms":["blowhard","braggart","boaster","ranter","gasbag"],"phonetic":"/bɑmˈbæstər/","extraExplanation":["“bombaster”来自动词/名词“bombast”（浮夸之辞）。有趣的是，“bombast”更早的含义指衣服里用来填充、让外形更夸张的棉絮或填料；后来这个“外形被填得很夸张”的意象，转为比喻语言也被“填得很夸张”。在文学评论里，有时会用来批评过度华丽却缺乏内容的文风（例如谈到莎士比亚时代某些夸张的戏剧语言时）。"]}
{"word":"bombastic","summary":{"en":"Bombastic describes speech or writing that is overly grand, wordy, and meant to impress rather than communicate clearly.","zh":"bombastic 形容言辞过分宏大、冗长、华而不实，常用于批评为了“显得厉害”而不够清晰的表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Using language that sounds important but is too long, too fancy, or too emotional, often to impress people rather than to be clear.","zh":"（语言/表达）浮夸的；夸夸其谈的；华而不实的（常指为了显得厉害而不够清晰、过度煽情）。"},"examples":[{"en":"His speech was so bombastic that many listeners stopped paying attention.","zh":"他的演讲太浮夸，很多听众后来都不再专心听了。"},{"en":"The advertisement uses bombastic claims but gives no real details.","zh":"这则广告用很多夸张的说法，但没有给出真正的细节。"},{"en":"Try to avoid bombastic words in academic writing; be clear and specific.","zh":"学术写作尽量避免浮夸用词，要清晰、具体。"}]},{"partOfSpeech":"adj.","definition":{"en":"Showing exaggerated confidence or importance in a way that feels arrogant or theatrical.","zh":"（态度/表现）自大张扬的；夸张做作的。"},"examples":[{"en":"He made a bombastic entrance, acting like a movie star.","zh":"他以一种夸张做作的方式登场，像电影明星一样。"},{"en":"Her bombastic tone didn’t match the simple situation.","zh":"她那种自大夸张的语气与简单的情境并不相称。"}]}],"synonyms":["pompous","grandiloquent","inflated","overblown","pretentious"],"phonetic":"/bɑmˈbæs.tɪk/","extraExplanation":["“bombastic”常用于批评演讲、文章、广告或政治言论：词很多、气势很大，但信息不够具体或显得空洞。","词源与“bomb（炸弹）”无关。它来自“bombast”，原指用来填充衣服的棉絮，引申为“用华丽辞藻把内容‘塞得鼓鼓的’”，但实际可能不充实。","近义词细微区别：pompous（自命不凡、摆架子）、grandiloquent（用大词、文风夸饰）、verbose（啰嗦、过多）、pretentious（装腔作势）。bombastic更强调“夸张+华而不实”的语言效果。"]}
{"word":"bombastical","summary":{"en":"Bombastical means overly grand or inflated in language, often sounding insincere or ridiculous.","zh":"bombastical 指语言过分夸张华丽、空洞浮夸，常让人觉得不真诚或可笑。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Using language that is too fancy, long, or dramatic in a way that sounds insincere or silly; pompous and inflated.","zh":"（语言）夸夸其谈的；浮夸的；华而不实的（听起来不真诚或可笑）。"},"examples":[{"en":"His bombastical speech was full of big words but had no clear point.","zh":"他的演讲很浮夸，堆满大词，却没有明确重点。"},{"en":"The review called the novel's dialogue bombastical and hard to take seriously.","zh":"评论说这部小说的对白很夸张浮夸，让人难以认真对待。"},{"en":"Try to avoid bombastical phrases in a job application—be direct and specific.","zh":"求职信里尽量避免浮夸的措辞——要直接、具体。"}]}],"synonyms":["bombastic","pompous","pretentious","grandiloquent","inflated"],"phonetic":"/bɑmˈbæstɪkəl/","extraExplanation":["“bombastical”来自名词“bombast”（夸大的言辞）。bombast最早指用来填充衣服的棉絮之类的“填充物”，后来引申为“用华丽空洞的语言把内容‘填得很鼓’”。因此它常带有批评语气。","日常英语里更常见的是“bombastic”。“bombastical”意思相同，但更少用，语气上有时显得更强烈或更带嘲讽。"]}
{"word":"bombastically","summary":{"en":"“Bombastically” means speaking or acting in an overly grand, showy way, often sounding impressive but not saying much.","zh":"“bombastically”指说话或表现得过于浮夸、夸张，听起来很厉害但往往内容空洞。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a pompous, overblown, or overly dramatic way, often using language that sounds impressive but lacks real substance.","zh":"以夸夸其谈、浮夸、过度戏剧化的方式（常指语言听起来很厉害，但内容空洞或不实在）。"},"examples":[{"en":"He spoke bombastically about his “revolutionary” plan, but he never explained the details.","zh":"他浮夸地谈论自己的“革命性”计划，但从不解释细节。"},{"en":"The ad described a simple product bombastically, as if it would change your life.","zh":"这则广告把一个普通产品说得天花乱坠，好像能改变你的人生。"}]}],"synonyms":["pompously","grandiosely","pretentiously","inflatedly"],"phonetic":"/bɑmˈbæs.tɪ.kli/","extraExplanation":["“bombastically”来自形容词“bombastic”（浮夸的、夸张的），常用来批评演讲、宣传文案或写作风格：听起来很宏大、很正式，但信息量不高。","语气通常是负面的，暗含“装腔作势/虚张声势”。在正式写作中，它常与“speech, rhetoric, language, tone”搭配。","相关词：bombastic（adj. 浮夸的）；bombast（n. 浮夸的言辞）。相近表达：pompously（自负地、摆架子地），grandiosely（夸大地）。"]}
{"word":"bombasticness","summary":{"en":"“Bombasticness” means exaggerated, overblown language or the degree to which something sounds grand but not truly meaningful.","zh":"bombasticness 指语言的“浮夸/夸大”程度：听起来很宏大有气势，但往往不够实在或缺乏内容。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or degree of being bombastic—using language that sounds impressive but is often too long, exaggerated, or insincere.","zh":"浮夸（或夸张）辞藻的程度；指语言听起来很有气势，但往往冗长、夸大或不真诚的特质。"},"examples":[{"en":"The speech had a lot of bombasticness, but very few clear ideas.","zh":"这篇演讲很浮夸，但清晰的观点却很少。"},{"en":"She tried to reduce the bombasticness of her essay by using simpler words.","zh":"她用更简单的词来降低文章的浮夸感。"},{"en":"Fans liked his confidence, but critics complained about the bombasticness of his interviews.","zh":"粉丝喜欢他的自信，但评论家抱怨他采访时言辞浮夸。"}]}],"synonyms":["bombast","grandiloquence","pompousness","overblown rhetoric","verbosity"],"phonetic":"/bɑmˈbæs.tɪk.nəs/","extraExplanation":["“bombasticness”是由形容词“bombastic（夸张的、浮夸的）”加名词后缀“-ness”构成，表示“……的状态/性质”。","语体上较少见、偏书面；日常表达更常用“bombast”（n. 浮夸的言辞）或直接说“bombastic language/tone（浮夸的语言/语气）”。","常见搭配：reduce/cut down on the bombasticness（减少浮夸）、the bombasticness of his rhetoric（他修辞的浮夸程度）。"]}
{"word":"bombastry","summary":{"en":"“Bombastry” means overly grand, empty-sounding language (rare/nonstandard; usually “bombast”).","zh":"“bombastry”指浮夸空洞的言辞（少见/非标准，通常用 bombast）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Pompous, inflated language; speech or writing that sounds impressive but has little real meaning (a nonstandard/rare form of “bombast”).","zh":"浮夸、夸大的语言；听起来很厉害但实际内容空洞的言辞（非标准/少见形式，常见词为 bombast）。"},"examples":[{"en":"The article was full of bombastry, but it didn’t explain the problem clearly.","zh":"那篇文章充满了浮夸辞藻，却没有把问题讲清楚。"},{"en":"Voters were tired of bombastry and wanted practical plans.","zh":"选民厌倦了夸夸其谈，更想要切实可行的方案。"}]}],"synonyms":["bombast","pompous language","grandiloquence","bluster"],"phonetic":"/ˈbɑm.bæs.tri/","extraExplanation":["“bombastry”并不是常见或标准拼写。你更可能想写的是 **bombast**（n. 浮夸言辞）或 **bombastic**（adj. 浮夸的）。在正式写作或考试中建议用 bombast / bombastic。","词源上，bombast 原指“用来填充衣物的棉絮/填充物”，后来引申为“语言被过度‘填充’而显得虚浮夸张”。"]}
{"word":"bombasts","summary":{"en":"“Bombasts” usually means exaggerated, pompous language (plural uses), and historically it can mean clothing stuffing.","zh":"“bombasts”通常指（复数）夸张空洞的华丽言辞；在历史用法中也可指衣物的填充物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of bombast: language or writing that sounds important but is too long, too emotional, or too exaggerated.","zh":"bombast 的复数：华而不实、夸张空洞的语言或文风。"},"examples":[{"en":"The speech was full of bombasts, but it offered no clear plan.","zh":"这篇演讲满是夸夸其谈，却没有任何明确方案。"},{"en":"Don’t be fooled by political bombasts; check the facts.","zh":"别被政治上的夸张空话迷惑；要核实事实。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical) Plural of bombast: cotton or other stuffing used to pad clothing and make it look bigger.","zh":"（历史用法）bombast 的复数：用于把衣服垫得更鼓、更显大的棉花等填充物。"},"examples":[{"en":"In old plays, costumes sometimes used bombasts to create huge shoulders.","zh":"在一些老戏剧里，服装有时会用填充物把肩膀做得很夸张。"}]}],"synonyms":["pompous language","grandiloquence","purple prose","hot air","ranting"],"phonetic":"/ˈbɑmˌbæst/","extraExplanation":["“bombast”最早并不是“夸夸其谈”的意思，而是指“棉花填充物”。因为这种填充物让衣服看起来更大、更“有分量”，后来这个词就被借用来形容“语言听起来很厉害、却空洞浮夸”。","现代英语中更常用单数形式 bombast（不可数名词用法很常见）；写作里用 bombasts 多半是在强调“很多段夸张言辞/很多次夸张表述”。"]}
{"word":"Bombax","summary":{"en":"Bombax is a scientific name for a genus of tropical silk-cotton trees.","zh":"Bombax 是热带“丝棉树/木棉”一类树木的属名（科学名称）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical trees (family Malvaceae) known for large showy flowers and seed pods filled with silky cotton-like fibers; some species are called silk-cotton trees.","zh":"木棉属（锦葵科）的一类热带树木，以花大醒目、种荚内有丝状“棉絮”纤维而闻名；其中一些种也被称为“木棉树/丝棉树”。"},"examples":[{"en":"The botanist identified the tree as Bombax after examining its flower and seed pod.","zh":"植物学家检查了花和种荚后，将这棵树鉴定为木棉属（Bombax）。"},{"en":"In some regions, Bombax trees are valued for the silky fiber inside their pods.","zh":"在一些地区，木棉属（Bombax）树的种荚内丝状纤维很有价值。"}]}],"synonyms":["silk-cotton tree (common name)","kapok tree (often used for related plants)"],"phonetic":"/ˈbɑːm.bæks/","extraExplanation":["“Bombax”来自拉丁语/新拉丁语的植物学命名，常见于学术写作（如植物志、分类检索表）而较少用于日常英语。日常表达更常说 silk-cotton tree（丝棉树）或直接用具体物种名（如 Bombax ceiba）。","注意不要和“bombyx”（家蚕属）混淆：两者拼写相近但含义完全不同。"]}
{"word":"bombax","summary":{"en":"Bombax is a genus of tropical silk-cotton trees with big flowers and cotton-like seed fiber.","zh":"Bombax 指木棉属的热带丝棉树类植物，花大，种子周围常有棉絮状纤维。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical tree in the genus Bombax (mallow family), often called the silk-cotton tree, known for its large flowers and fluffy, cotton-like fiber around its seeds.","zh":"木棉属（Bombax，锦葵科）的一类热带树木，常被称为“木棉/丝棉树”，以大型花朵和包裹种子的絮状棉纤维而闻名。"},"examples":[{"en":"In spring, the bombax tree can fill a street with bright red flowers.","zh":"春天里，木棉（bombax）树可能会用鲜红的花朵点亮整条街。"},{"en":"Some bombax species produce a fluffy fiber that looks like cotton around the seeds.","zh":"一些木棉属植物的种子周围会长出看起来像棉花的蓬松纤维。"}]}],"synonyms":["silk-cotton tree","bombax tree"],"phonetic":"/ˈbɑmˌbæks/","extraExplanation":["“Bombax”是植物学上的属名，日常英语里更常见的说法是“silk-cotton tree（丝棉树/木棉树）”。在不同地区，人们也可能把相似会产絮的树与“kapok（木棉絮）”混用，但“kapok”常特指另一属（Ceiba）产生的纤维；因此在写作或学习中，区分具体树种/属名会更准确。"]}
{"word":"Bombay","summary":{"en":"Bombay is the former English name of Mumbai, a major city in western India; it can also describe things related to that city.","zh":"Bombay 是印度西部大城市 Mumbai（孟买）的旧英文名；也可用作形容词表示“与孟买有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Former name) a major city on India’s west coast, now officially called Mumbai.","zh":"（旧称）印度西海岸的重要城市，官方名称现为孟买（Mumbai）。"},"examples":[{"en":"Bombay is now officially called Mumbai.","zh":"Bombay 现在的官方名称是 Mumbai（孟买）。"},{"en":"My grandparents still say “Bombay,” but younger people usually say “Mumbai.”","zh":"我祖父母仍会说“Bombay”，但年轻人通常说“Mumbai（孟买）”。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the city formerly called Bombay (now Mumbai).","zh":"与旧称 Bombay（现 Mumbai/孟买）的城市有关的；孟买的。"},"examples":[{"en":"Bombay street food is famous across India.","zh":"孟买的街头小吃在全印度都很有名。"},{"en":"She collects old Bombay postcards.","zh":"她收集老孟买（Bombay）明信片。"}]}],"synonyms":["Mumbai"],"phonetic":"/bɑmˈbeɪ/","extraExplanation":["“Bombay”是殖民时期的英文名称，来源与葡萄牙语/英语的历史拼写有关。1995年，城市在印度官方层面更名为“Mumbai（孟买）”，更贴近当地语言（马拉地语）的称呼。","在当代语境中，使用“Mumbai”通常更符合当地与正式用法；“Bombay”仍常见于老牌机构名称、历史资料、品牌（如部分老公司名）、以及怀旧或特定文化语境中。"]}
{"word":"bombay","summary":{"en":"“Bombay” most commonly refers to Mumbai, India (the city’s former English name). It can also appear in food names like “Bombay mango chutney.”","zh":"“Bombay”最常指印度城市孟买（Mumbai）的旧英文名；也常见于一些菜品名称中，如“Bombay 芒果酸辣酱”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Mumbai (formerly called Bombay): a major coastal city in western India, famous for finance, Bollywood, and a busy port.","zh":"孟买（现名 Mumbai）：印度西部沿海的重要城市，以金融业、宝莱坞电影业和繁忙港口著名。"},"examples":[{"en":"My friend lives in Mumbai, which used to be called Bombay.","zh":"我朋友住在孟买（Mumbai），以前叫 Bombay。"},{"en":"Bombay is a common name in older books and films.","zh":"在较早的书籍和电影里，Bombay 是一个常见称呼。"}]},{"partOfSpeech":"adj.","definition":{"en":"(old-fashioned) A kind of sweet mango chutney or curry-style dish associated with Indian cuisine, often labeled “Bombay.”","zh":"（较旧/常见于菜单）一种与印度风味相关的芒果酸辣酱或咖喱风味菜品，常被标为“Bombay”。"},"examples":[{"en":"The menu has Bombay mango chutney.","zh":"菜单上有“Bombay 芒果酸辣酱”。"},{"en":"She ordered a Bombay-style curry.","zh":"她点了一份孟买风味的咖喱。"}]}],"synonyms":["Mumbai"],"phonetic":"/mʊmˈbaɪ/","extraExplanation":["“Bombay”是英语中长期使用的城市名，源自殖民时期的拼写与用法。1995年，官方更名为“Mumbai”（孟买），来自当地语言中女神“Mumbā”相关的名称。","在现代正式语境（新闻、政府、学术写作）通常用“Mumbai”。“Bombay”仍常见于老作品、品牌名（如 Bombay Sapphire）、以及“Bombay Stock Exchange（孟买证券交易所）”等历史保留名称中。"]}
{"word":"bombazeen","summary":{"en":"Bombazeen is an old spelling of “bombazine,” a twilled cloth often black and historically used for mourning clothes.","zh":"bombazeen 是 bombazine 的旧式拼写，指一种常染黑的斜纹布，历史上常用于丧服。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a twilled fabric (traditionally silk or silk-and-wool, later often cotton/worsted) commonly dyed black and used especially for mourning clothes in past centuries; a variant spelling of “bombazine.”","zh":"一种斜纹织物（早期多为丝或丝毛混纺，后来也常见棉/精纺毛），传统上常染成黑色，过去常用于丧服；是“bombazine”的一种变体拼写。"},"examples":[{"en":"In the 19th century, many widows wore bombazeen as part of mourning dress.","zh":"在19世纪，许多寡妇会穿bombazeen（黑色斜纹布）作为丧服的一部分。"},{"en":"The costume designer chose bombazeen to give the scene a period-authentic look.","zh":"服装设计师选用bombazeen来让场景更有时代真实感。"}]}],"synonyms":["bombazine","mourning cloth (contextual)"],"phonetic":"/ˌbɑmbəˈzin/","extraExplanation":["“bombazeen / bombazine”多见于18—19世纪英语文本，常与“mourning（守丧/丧服）”搭配出现。如今在日常英语里很少用，更多见于历史、文学、服装史、戏剧与古籍语境。","词源上与意大利语 *bombasina* 等形式有关，历史上指一种结实的斜纹布；在英国文化语境中，它常让人联想到维多利亚时代的守丧礼仪与黑色服饰。"]}
{"word":"bombazet","summary":{"en":"“bombazet” is not a standard English word; it’s likely a misspelling or a proper name.","zh":"“bombazet”不是标准英语词，可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in major dictionaries; it may be a misspelling or a proper name (e.g., a username, brand, or surname).","zh":"不是主流英语词典中的标准词；可能是拼写错误，或是专有名词（如用户名、品牌名、姓氏）。"},"examples":[{"en":"I can’t find “bombazet” in an English dictionary—did you mean “bombastic” or “bombazine”?","zh":"我在英语词典里找不到“bombazet”——你是不是想写“bombastic”或“bombazine”？"},{"en":"If “Bombazet” is a brand or name, please share the sentence you saw it in.","zh":"如果“Bombazet”是品牌名或人名，请把你看到它的句子发我。"}]}],"phonetic":"/ˌbɑːm.bəˈzɛt/","extraExplanation":["“bombazet”看起来更像拼写变体或专名，而不是常见英语单词。最接近的可能词：\n1) bombastic（adj. 夸张浮夸的、言过其实的，用来形容说话/写作风格）\n2) bombazine（n. 一种织物名，较少见，多见于历史语境）\n3) bombast（n. 浮夸的言辞）\n如果你告诉我它出现的上下文（句子、领域、国家/地区），我可以更准确判断你要查的词。"]}
{"word":"bombazette","summary":{"en":"Bombazette is a rare, old-fashioned word for a twilled cloth, often wool-based, historically used for clothing (especially mourning wear).","zh":"Bombazette 是一个较古老且少见的词，指一种多为羊毛基底的斜纹布料，历史上用于做衣物，尤其常见于丧服。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of cloth (a twilled/crosswise-woven fabric), traditionally made from worsted (wool) and sometimes mixed with silk or cotton; historically used for dresses and often for mourning clothes","zh":"一种斜纹织物（横向斜纹布料），传统上以精纺羊毛为主，有时混纺丝或棉；历史上用于做衣裙，也常用于丧服"},"examples":[{"en":"In the 19th century, bombazette was sometimes chosen for mourning dresses because it looked plain and dignified.","zh":"在19世纪，bombazette 有时会被用来做丧服裙，因为它看起来朴素而庄重。"},{"en":"The tailor recommended bombazette for a warm, sturdy skirt.","zh":"裁缝推荐用 bombazette 来做一条保暖且结实的裙子。"}]}],"synonyms":["bombazine","twilled cloth","worsted fabric"],"phonetic":"/ˌbɑːm.bəˈzɛt/","extraExplanation":["这个词现在非常少见，多见于18—19世纪的服装、纺织品清单或文学作品中。与 bombazine（也译作“邦巴辛”）相关：两者都指用于衣物的布料，且常与“丧服/素服”的语境一起出现。拼写与具体纤维配比在不同地区与年代会有差异。"]}
{"word":"bombazine","summary":{"en":"Bombazine is an old-fashioned twilled fabric, often black, historically used for mourning clothes.","zh":"Bombazine 是一种较古老的斜纹织物，常见为黑色，历史上常用于丧服。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a twilled fabric (a type of woven cloth) traditionally made from silk mixed with worsted wool, or sometimes cotton; often used for durable clothing, especially mourning clothes in the past","zh":"一种斜纹织物（带有斜向纹路的布料），传统上由丝与精纺羊毛混织（有时也用棉混纺）；过去常用于耐穿衣物，尤指丧服"},"examples":[{"en":"In the 1800s, many widows wore black bombazine as mourning dress.","zh":"在19世纪，许多寡妇会穿黑色的 bombazine（邦巴辛布）作为丧服。"},{"en":"The costume designer chose bombazine because it looks matte and formal on stage.","zh":"服装设计师选用 bombazine，因为它在舞台上看起来偏哑光、很庄重。"}]}],"synonyms":["bombazeen","mourning cloth"],"phonetic":"/ˈbɑːm.bə.ziːn/","extraExplanation":["Bombazine 在英语文学与历史语境里常和“丧服（mourning）”联系在一起，尤其是维多利亚时代的英国：黑色、低调、不反光的面料被认为更符合哀悼礼仪。","拼写上也会见到变体 bombazeen；在现代日常英语中较少使用，更常出现在历史小说、戏剧服装、博物馆/服饰史讨论中。"]}
{"word":"bombe","summary":{"en":"Bombe most commonly means a dome-shaped frozen dessert; less commonly, it can mean an explosive device (French for “bomb”).","zh":"Bombe最常指圆顶形的冰冻甜点；较少情况下也可指爆炸装置（法语中相当于“bomb/炸弹”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a dome-shaped frozen dessert, usually made with ice cream or sorbet and often layered around a filling (for example, cake or fruit).","zh":"（圆顶形的）冰冻甜点，通常由冰淇淋或雪葩制成，常做成分层并包裹蛋糕、水果等内馅。"},"examples":[{"en":"For dessert, we ordered a chocolate bombe with a raspberry center.","zh":"甜点我们点了巧克力bombe，里面是覆盆子夹心。"},{"en":"The chef sliced the bombe to show the layers of ice cream and sponge cake.","zh":"主厨把bombe切开，展示冰淇淋和海绵蛋糕的分层。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) an explosive device; a bomb (often used in French or in specialized/historical contexts).","zh":"（较少见）爆炸装置；炸弹（常见于法语语境或较专业/历史语境中）。"},"examples":[{"en":"The report mentioned a small bombe found near the building.","zh":"报告提到在大楼附近发现了一枚小型bombe。"},{"en":"In some French-language news, “bombe” simply means “bomb.”","zh":"在一些法语新闻里，“bombe”就等于“bomb（炸弹）”。"}]}],"synonyms":["ice-cream bombe","frozen dessert","bomb (French usage)"],"phonetic":"/bɑm/","extraExplanation":["“bombe”来自法语，字面意思与“炸弹”有关；在甜点里用这个词，多半是因为成品外形像圆形的“炸弹/炮弹”。","甜点语境中常见搭配：ice-cream bombe（冰淇淋bombe）、chocolate bombe（巧克力bombe）。有时也会看到相近的法式甜点名，如“bombe glacée”（冰冻bombe）。"]}
{"word":"bombed","summary":{"en":"“Bombed” can mean “attacked with bombs,” or (informally) “failed badly,” or “very drunk.”","zh":"“bombed”可指“遭轰炸/被炸毁”，也可（口语）指“惨败/考砸/演砸”，或“喝得烂醉”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “bomb”: attacked a place with bombs; also, destroyed or damaged by bombs.","zh":"“bomb”的过去式/过去分词：用炸弹攻击某地；也可指被炸弹摧毁或破坏。"},"examples":[{"en":"The city was bombed during the war.","zh":"战争期间这座城市遭到轰炸。"},{"en":"Several buildings were bombed overnight.","zh":"有几栋建筑在夜间遭到炸弹袭击。"}]},{"partOfSpeech":"v.","definition":{"en":"(Informal) Failed very badly, especially in a performance, test, or project.","zh":"（非正式）惨败；表现很糟，尤指考试、演出或项目。"},"examples":[{"en":"I studied, but I still bombed the math test.","zh":"我复习了，但数学考试还是考砸了。"},{"en":"The comedian bombed and the audience stayed silent.","zh":"那位喜剧演员演砸了，观众一片沉默。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal) Very drunk or strongly affected by alcohol/drugs.","zh":"（非正式）烂醉；（因酒精/药物）严重醉或嗨。"},"examples":[{"en":"He got bombed at the party and couldn’t find his phone.","zh":"他在派对上喝得烂醉，连手机都找不到了。"},{"en":"They were bombed, so we called them a cab.","zh":"他们醉得不行，我们就帮他们叫了出租车。"}]}],"synonyms":["attacked","destroyed","failed","flopped","did badly","intoxicated","drunk"],"phonetic":"/bɑmd/","extraExplanation":["“bombed”有中性/正式的“被轰炸”，也有很口语的用法（“考砸/演砸”“喝到烂醉”）。在正式写作或工作场合，建议用更中性的表达：failed badly（惨败）、performed poorly（表现很差）、very drunk/intoxicated（很醉/醉酒）。","在英语里，“bomb”作动词表示“失败”常用于演出、笑话、考试等；和“a bomb”（名词，常指“失败的作品/电影”）相关，比如：The movie was a bomb（电影票房惨败）。"]}
{"word":"bombee","summary":{"en":"Bombee (often written bombé) describes a smooth, rounded outward bulge, especially in furniture and decorative design.","zh":"bombee（常写作 bombé）指平滑圆鼓、向外凸起的形状，常用于家具与装饰设计。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of furniture or a surface) bulging outward in a smooth, rounded, convex shape.","zh":"（指家具或表面）向外鼓起的；圆鼓鼓的；凸面的。"},"examples":[{"en":"The antique shop had a bombé chest with curved drawers.","zh":"古董店里有一只鼓肚式（圆鼓）抽屉柜。"},{"en":"The designer chose a bombé front to make the cabinet look softer.","zh":"设计师选用外鼓的柜面，让柜子看起来更柔和。"}]},{"partOfSpeech":"n.","definition":{"en":"a rounded, outward-curving form or profile, especially in decorative arts.","zh":"（尤用于装饰艺术中的）外鼓的弧形轮廓；凸起的造型。"},"examples":[{"en":"You can see the bombé of the drawer fronts in the side view.","zh":"从侧面看得到抽屉正面的外鼓弧度。"}]}],"synonyms":["convex","bulging","rounded","curved-out","swollen"],"phonetic":"/bɑːmˈbeɪ/","extraExplanation":["“bombée / bombé”源自法语，原意与“拱起、鼓起”有关，常见于家具史与装饰艺术领域（如“bombé chest”指柜体侧面或正面呈鼓肚弧形的柜子）。","你输入的“bombee”多半是在英语里对法语拼写“bombé(e)”的常见写法之一；正式写法里常带重音符号“é”。"]}
{"word":"bomber","summary":{"en":"A “bomber” is most commonly a military aircraft that drops bombs; it can also mean a person who uses bombs, or an informal term for a bomber jacket.","zh":"“bomber”最常指军用轰炸机；也可指使用炸弹进行袭击的人；在非正式语境中还可指飞行夹克（bomber jacket）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A military aircraft designed to carry and drop bombs on targets.","zh":"（军用）轰炸机：用于携带并投放炸弹攻击目标的飞机。"},"examples":[{"en":"The bomber flew at night to avoid enemy radar.","zh":"轰炸机在夜间飞行以躲避敌方雷达。"},{"en":"During World War II, bombers were used in large formations.","zh":"在第二次世界大战期间，轰炸机常以大型编队出动。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who uses bombs, especially in an attack.","zh":"投弹者；炸弹袭击者：使用炸弹进行攻击的人。"},"examples":[{"en":"Police arrested a suspected bomber after the explosion.","zh":"爆炸后警方逮捕了一名疑似炸弹袭击者。"},{"en":"The news reported that the bomber acted alone.","zh":"新闻报道称该炸弹袭击者是单独行动的。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) A jacket or style of jacket with a short waist and gathered (elastic) cuffs and hem, originally linked to pilot/military clothing.","zh":"（非正式）飞行夹克；棒球夹克：短款、袖口和下摆常有松紧设计的一种夹克。"},"examples":[{"en":"He wore a black bomber with jeans.","zh":"他穿了一件黑色飞行夹克，搭配牛仔裤。"},{"en":"Bomber jackets became popular in street fashion.","zh":"飞行夹克在街头潮流中变得很流行。"}]}],"synonyms":["bombing aircraft","bombardment aircraft","terrorist (context-dependent)","attacker (context-dependent)","bomber jacket","flight jacket"],"phonetic":"/ˈbɑːmər/","extraExplanation":["“bomber”有时会引发敏感联想：在新闻语境里常指“实施爆炸袭击的人”，而在军事语境里则是“轰炸机”。阅读时可通过上下文（police/suspect vs. aircraft/mission）判断含义。","服饰里的“bomber jacket”源自飞行员夹克（如MA-1等），因此常被简称为“bomber”。在购物或时尚语境中一般指夹克，不涉及暴力含义。"]}
{"word":"bombernickel","summary":{"en":"Pumpernickel is a dark, dense rye bread.","zh":"Pumpernickel 指一种深色、扎实的黑麦面包。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a dark, dense bread made mostly from rye flour, often slightly sweet and usually baked for a long time","zh":"（通常指）黑麦粗面包：以黑麦为主制成的深色、扎实的面包，常带一点甜味，通常需要长时间烘烤"},"examples":[{"en":"I ordered a smoked salmon sandwich on pumpernickel.","zh":"我点了一份用黑麦粗面包夹的烟熏三文鱼三明治。"},{"en":"Pumpernickel bread tastes earthy and a little sweet.","zh":"黑麦粗面包的味道很朴实，带一点甜。"}]}],"synonyms":["rye bread","dark rye"],"phonetic":"/ˈpʌmpərˌnɪkəl/","extraExplanation":["你输入的 **bombernickel** 很可能是 **pumpernickel** 的拼写误差；在英语里常用且标准的词是 *pumpernickel*。","*Pumpernickel* 源自德语，常与德国或中欧风格的黑麦面包联系在一起。英语中提到它时，多强调“深色、口感紧实”的面包类型。"]}
{"word":"bombers","summary":{"en":"“Bombers” most commonly means people who use bombs, or military aircraft that drop bombs; informally in sports it can mean powerful hitters/scorers.","zh":"“bombers”最常见指使用炸弹袭击的人，或投弹的军用轰炸机；在体育口语中也可指火力很猛的重炮手/强力得分者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or group that uses bombs (explosives) to attack people or places.","zh":"投弹者；放炸弹者；使用爆炸物袭击他人或地点的人（或团体）。"},"examples":[{"en":"The police searched for the bombers after the attack.","zh":"袭击后，警方搜寻投弹者。"},{"en":"News reports said the bombers targeted a crowded area.","zh":"新闻报道说，袭击者把拥挤区域作为目标。"}]},{"partOfSpeech":"n.","definition":{"en":"A military aircraft designed to carry and drop bombs.","zh":"（军用）轰炸机。"},"examples":[{"en":"The bomber flew over the city at night.","zh":"那架轰炸机在夜间飞越城市。"},{"en":"During the war, bombers were used to destroy bridges and factories.","zh":"在战争期间，轰炸机被用来摧毁桥梁和工厂。"}]},{"partOfSpeech":"n.","definition":{"en":"(Sports, informal) Players or a team known for hitting many home runs or scoring very heavily.","zh":"（体育，非正式）重炮手；以大量全垒打或高得分著称的球员或球队。"},"examples":[{"en":"The lineup is full of bombers this season.","zh":"这赛季的打线里全是重炮手。"},{"en":"They’re bombers at home, but less effective away.","zh":"他们主场火力很猛，但客场没那么有效。"}]}],"synonyms":["attackers","terrorists","aircraft","warplanes","sluggers"],"phonetic":"/ˈbɑmərz/","extraExplanation":["“bomber(s)”在新闻语境里常指“使用炸弹发动袭击的人”，属于敏感话题；写作或讨论时，注意避免把暴力与某个族群或宗教简单关联，以免造成刻板印象。","词源上来自“bomb（炸弹）+ -er（做……的人/物）”。因此它既可以指“人”，也可以指“机器/飞机”。"]}
{"word":"bombes","summary":{"en":"“Bombes” most commonly means molded, dome-shaped frozen desserts; it is the plural of “bombe.”","zh":"“bombes”最常指用模具做成的半球形/碗形冰冻甜点；是“bombe”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a molded frozen dessert (often ice cream, mousse, or semifreddo) that is shaped in a bowl or dome and sometimes has layers or a filling","zh":"（常指用模具做成的）冰冻甜点；炸弹冰淇淋（常为冰淇淋、慕斯或半冷冻甜点，呈碗形/半球形，可能分层或有夹心）"},"examples":[{"en":"For dessert, they served a raspberry bombe with a chocolate center.","zh":"甜点他们上了覆盆子炸弹冰淇淋，中间是巧克力夹心。"},{"en":"The chef unmolded the bombe and topped it with warm sauce.","zh":"厨师把甜点从模具里倒扣出来，再淋上热酱。"}]},{"partOfSpeech":"other","definition":{"en":"the plural form of “bombe”","zh":"“bombe”的复数形式"},"examples":[{"en":"The menu lists three different bombes this week.","zh":"这周菜单上列了三种不同的炸弹冰淇淋。"}]}],"synonyms":["molded ice cream","frozen dessert","semifreddo (type)","mousse (related)"],"phonetic":"/bɑːm/","extraExplanation":["在英语里，这个词多用于西餐甜点语境，常见搭配有：ice-cream bombe（冰淇淋炸弹）、chocolate/raspberry bombe（巧克力/覆盆子炸弹）。虽然拼写像法语，但在甜点意义上通常按“bomb（炸弹）”的读法来读。"]}
{"word":"bombesin","summary":{"en":"Bombesin is a peptide signaling molecule studied for its effects on digestion and nerve-related signaling.","zh":"Bombesin 是一种肽类信号分子，常用于研究消化与神经相关的信号作用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a peptide (small protein) that acts like a signaling molecule in the body, especially in the digestive system and nervous system; it can stimulate the release of certain hormones and affect smooth muscle activity.","zh":"一种肽类（小蛋白）信号分子，主要与消化系统和神经系统有关；可刺激某些激素释放，并影响平滑肌活动。"},"examples":[{"en":"Bombesin is often studied in labs to understand how the gut and brain communicate.","zh":"研究人员常在实验室研究 bombesin，以了解肠道与大脑如何沟通。"},{"en":"In some experiments, bombesin can trigger the release of digestive hormones.","zh":"在一些实验中，bombesin 会触发消化相关激素的释放。"}]}],"synonyms":["gastrin-releasing peptide (GRP) (related)","bombesin-like peptide (BLP)"],"phonetic":"/bɑmˈbiːsɪn/","extraExplanation":["Bombesin 最早从青蛙皮肤中分离出来，因此在生物医学文献里常被提到。","在人体内，与 bombesin 功能相似的一类肽叫做“胃泌素释放肽（GRP, gastrin-releasing peptide）”；研究中常用 bombesin 作为模型物质来探讨相关受体与信号通路。","该词多见于生物学、医学和药理学语境，日常英语交流中很少使用。"]}
{"word":"bombesins","summary":{"en":"Bombesins are peptide hormones (first found in frog skin) that influence digestion and are widely used in biomedical research.","zh":"Bombesins 指一类最早在青蛙皮肤中发现的肽类激素，可影响消化并常用于生物医学研究。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"any of a group of small peptide hormones (first found in frog skin) that act in the body to affect digestion and the release of other hormones; also used in medical research","zh":"一类小分子肽类激素（最早在青蛙皮肤中发现），在人体内可影响消化功能并促进某些激素释放；也常用于医学研究"},"examples":[{"en":"Researchers studied bombesins to understand how the gut signals the brain.","zh":"研究人员研究了 bombesins，以了解肠道如何向大脑传递信号。"},{"en":"In lab experiments, bombesins can stimulate the release of certain digestive hormones.","zh":"在实验室实验中，bombesins 可能刺激某些消化激素的释放。"}]}],"synonyms":["bombesin-like peptides","BLPs","bombesin peptides"],"phonetic":"/ˌbɑm.bəˈsɪn/","extraExplanation":["“bombesin”最早来源于一种青蛙（Bombina 属，俗称铃蟾）的皮肤分泌物，因此名字与拉丁学名相关。","在医学/生理学语境中，你常会看到“bombesin-like peptides（类 bombesin 肽）”或“bombesin receptor（bombesin 受体）”。它们与胃肠道活动、食欲调节、以及某些肿瘤研究有关。","这个词多用于生物医学论文或课堂，不是日常英语高频词。写作中常见复数 bombesins，表示“多种此类肽”。"]}
{"word":"bombic","summary":{"en":"A rare adjective meaning “related to silkworms (Bombyx) or silk moths,” mostly used in scientific contexts.","zh":"一个较少见的形容词，意为“与蚕（Bombyx）或蚕蛾类相关”，多用于科学/学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to silkworms (especially the genus *Bombyx*) or to silk moths.","zh":"与蚕（尤其是家蚕属 *Bombyx*）或蚕蛾类相关的；蚕科相关的。"},"examples":[{"en":"Researchers studied bombic insects to understand how silk is produced.","zh":"研究人员研究与蚕相关的昆虫，以了解丝是如何产生的。"},{"en":"The paper mentions bombic larvae as a key model in silk research.","zh":"论文提到蚕的幼虫是丝绸研究中的关键模型。"}]}],"synonyms":["bombycid","bombycine","silkworm-related"],"phonetic":"/ˈbɑːm.bɪk/","extraExplanation":["“bombic”是一个非常少见的词，更多时候你会在学术写作里看到更常用的形式，如 **Bombyx**（家蚕属的拉丁学名）、**bombycid**（蚕科的/蚕科昆虫），或 **bombycine**（与蚕/丝相关的）。如果你是在生物或昆虫学语境里看到它，通常就是“与蚕或蚕蛾相关”的意思。","词根来自希腊语 *bombyx*，与“丝、蚕”有关，因此常出现在丝绸、蚕的发育、吐丝机制等研究语境中。"]}
{"word":"bombiccite","summary":{"en":"“bombiccite” is not a standard English word; it’s likely a misspelling or a niche/informal coinage.","zh":"“bombiccite”不是标准英文词，可能是拼写错误或非常小众/非正式的自造词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it may be a misspelling, a very rare technical term, or a made-up/meme spelling.","zh":"这不是常见英文词典里的标准词；可能是拼写错误、非常冷门的专业词，或是网络/自造拼写。"},"examples":[{"en":"I searched for “bombiccite,” but I couldn’t find a reliable definition in standard English sources.","zh":"我搜索了“bombiccite”，但在常见英文资料里找不到可靠释义。"},{"en":"If you meant “bombastic,” the spelling is different and the meaning is not the same.","zh":"如果你想写的是“bombastic”，拼写不同，意思也不一样。"}]}],"phonetic":"/bɑmˈbɪk.saɪt/","extraExplanation":["“bombiccite”看起来像把某个已存在的词拼错了。你可以检查：\n1) 你看到它的上下文句子（贴出来最有用）；\n2) 是否来自游戏/梗图/用户名（这类词常没有固定词典释义）；\n3) 你是否想表达类似的常见词：\n- bombastic（夸张的；浮夸的）\n- bombing（轰炸；也可指“考试考砸/表演失败”）\n- biocide（杀生剂/杀生物剂，专业术语）\n把原句发我，我可以根据语境判断你真正想找的词。"]}
{"word":"Bombidae","summary":{"en":"Bombidae: the bee family commonly associated with bumblebees.","zh":"Bombidae：通常指与熊蜂相关的蜜蜂“科”（熊蜂科）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of bees that includes bumblebees, known for their stout, fuzzy bodies and important role in pollination.","zh":"熊蜂科（蜜蜂的一科），包括熊蜂；以体形粗壮、毛茸茸以及在授粉中的重要作用而闻名。"},"examples":[{"en":"Many species in the Bombidae are key pollinators for wildflowers and crops.","zh":"熊蜂科的许多物种是野花和农作物的重要传粉者。"},{"en":"Scientists study Bombidae to understand how climate change affects pollination.","zh":"科学家研究熊蜂科，以了解气候变化如何影响传粉。"}]}],"synonyms":["bumblebee family"],"phonetic":"ˈbɑmbɪdi","extraExplanation":["“Bombidae”是动物分类学用语，常见于科普与学术写作；日常英语里更常说“bumblebees”（熊蜂）。","词源与拉丁语有关：与“Bombus”（熊蜂属）同源，带有“嗡嗡声”的联想（类似英文的拟声感）。","注意：不同资料在较新的分类系统中可能会把熊蜂归入蜜蜂科（Apidae）下的一个族/亚科；但在一些文献或旧分类中仍会看到“Bombidae”作为一个科名。"]}
{"word":"bombidae","summary":{"en":"Bombidae is the bee family that includes bumblebees, important fuzzy pollinators.","zh":"Bombidae 指“熊蜂科”，包含熊蜂等重要的毛茸茸授粉昆虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of bees that includes bumblebees (genus Bombus), known for their fuzzy bodies and important role in pollination","zh":"熊蜂科（包含熊蜂属 Bombus 等），以毛茸茸的外形和重要的授粉作用而闻名"},"examples":[{"en":"Many Bombidae can fly in cool weather, so they are valuable pollinators in early spring.","zh":"许多熊蜂科的昆虫在凉爽天气也能飞行，因此在早春是很重要的授粉者。"},{"en":"The researcher compared the tongue length of different Bombidae to see which flowers they could reach.","zh":"研究者比较了不同熊蜂科昆虫的口器长度，以了解它们能取食哪些花。"}]}],"synonyms":["bumblebee family","bumblebees (common term)"],"phonetic":"/bɑmˈbɪdi/","extraExplanation":["“Bombidae”是昆虫分类学里的科名（family），常见成员就是我们熟悉的“bumblebees（熊蜂）”。日常英语里更常说“bumblebees”而不是“Bombidae”。","词源上与拉丁/希腊词根有关，和“Bombus（熊蜂属）”同源；“bomb-”在古典语言里有“嗡嗡作响”的拟声意味，和熊蜂的振翅声有关。"]}
{"word":"bombilate","summary":{"en":"Bombilate means to hum or buzz (rare/old-fashioned).","zh":"bombilate 指“嗡嗡作响、发出低沉的嗡鸣声”（非常少见/略古旧）。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to make a low humming or buzzing sound; to drone","zh":"发出低沉的嗡嗡声；嗡鸣、嗡响"},"examples":[{"en":"The old refrigerator seemed to bombilate all night.","zh":"那台旧冰箱好像整夜都在嗡嗡作响。"},{"en":"In the garden, bees bombilated around the lavender.","zh":"花园里，蜜蜂在薰衣草周围嗡嗡飞。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative, rare) to speak or sing in a dull, droning way","zh":"（比喻义，罕见）用单调的声音说话或唱歌；絮絮叨叨地低声吟诵"},"examples":[{"en":"He bombilated through the report, and everyone struggled to stay awake.","zh":"他单调地念完报告，大家都努力不打瞌睡。"},{"en":"She bombilated a tune under her breath while working.","zh":"她一边干活一边低声哼着曲子。"}]}],"synonyms":["hum","buzz","drone","whirr"],"phonetic":"/ˈbɑːmbəleɪt/","extraExplanation":["“bombilate”非常罕见，带有古旧/书面甚至俏皮的感觉；日常英语里更常用 hum、buzz、drone。","词源可追溯到拉丁语 bombilare（模仿“嗡嗡”声的拟声词）。在文学或修辞中偶尔用来营造声音氛围。"]}
{"word":"bombilation","summary":{"en":"Bombilation means the buzzing or humming sound of insects, especially bees.","zh":"bombilation 指昆虫（尤指蜜蜂）的嗡嗡/嗡鸣声。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a humming or buzzing sound, especially the sound made by bees or other insects","zh":"嗡嗡声；（尤指）蜜蜂等昆虫发出的嗡鸣声"},"examples":[{"en":"In the garden, the bombilation of bees filled the air.","zh":"在花园里，蜜蜂的嗡嗡声充满了空气。"},{"en":"I heard a soft bombilation near the window and saw a beetle flying outside.","zh":"我在窗边听到轻微的嗡嗡声，看到外面有只甲虫在飞。"}]}],"synonyms":["buzzing","humming","drone","whirring"],"phonetic":"/ˌbɑm.bəˈleɪ.ʃən/","extraExplanation":["这是一个比较少见、带点文学色彩的词，常用来描写“像昆虫一样的嗡鸣”。日常英语里更常用的是 *buzzing* 或 *humming*。","词源与“模仿声音”的表达有关，来自拉丁语系中表示“嗡嗡作响”的词根（类似 *bomb-* 这种拟声感），所以读起来也有“嗡”的感觉。"]}
{"word":"bombilla","summary":{"en":"Bombilla usually means the filtered metal straw used to drink yerba mate (and less commonly can mean a light bulb in Spanish contexts).","zh":"Bombilla 通常指喝马黛茶用的带滤嘴金属吸管（较少情况下，在西语语境中也可指灯泡）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a metal straw (often with a small filter) used for drinking yerba mate.","zh":"（常带滤嘴的）金属吸管，用来喝马黛茶（yerba mate）。"},"examples":[{"en":"In Argentina, people often drink yerba mate through a bombilla.","zh":"在阿根廷，人们常用 bombilla 来喝马黛茶。"},{"en":"Don’t stir the mate with the bombilla; it can clog the filter.","zh":"不要用 bombilla 去搅动马黛茶，否则可能把滤嘴堵住。"}]},{"partOfSpeech":"n.","definition":{"en":"(in some varieties of Spanish, and occasionally in English contexts) a light bulb.","zh":"（在部分西班牙语用法中；英语语境里偶见）灯泡。"},"examples":[{"en":"The sign in Spanish said “cambiar la bombilla” (change the light bulb).","zh":"那块西语标牌写着“cambiar la bombilla”（更换灯泡）。"}]}],"synonyms":["mate straw","filtered straw"],"phonetic":"/bɑmˈbiːjə/","extraExplanation":["“bombilla”是西班牙语借词。在英语里最常见的是与南美“马黛茶（mate）”文化相关的用法，尤其在阿根廷、乌拉圭、巴拉圭和巴西南部等地。","马黛茶通常用一个小杯/葫芦状容器（mate 或 gourd）和 bombilla 一起饮用；bombilla 末端常有滤孔或滤网，用来挡住茶叶碎末。","发音与拼写在英语材料中一般保留西语形式；如果你在英语文章里看到它，多半是在旅行、美食或拉美文化语境中。"]}
{"word":"bombillas","summary":{"en":"Bombillas are filtered metal straws used to drink yerba mate.","zh":"Bombillas 指喝马黛茶用的带滤嘴金属吸管（西语复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(loanword from Spanish) A metal drinking straw with a filter at the end, used for drinking yerba mate.","zh":"（西班牙语外来词）马黛茶吸管：末端带滤嘴的金属吸管，用来喝南美的马黛茶（yerba mate）。"},"examples":[{"en":"In Argentina, people often share yerba mate using a gourd and a bombilla.","zh":"在阿根廷，人们常用葫芦杯和 bombilla 一起分享马黛茶。"},{"en":"Rinse the bombilla after each use so the filter doesn’t clog.","zh":"每次用完都要冲洗 bombilla，这样滤嘴才不容易堵。"}]}],"synonyms":["mate straw","filtered straw"],"phonetic":"/bɑmˈbiːjəz/","extraExplanation":["“Bombillas”是西班牙语复数，单数是“bombilla”。在英语里，这个词主要出现在谈到马黛茶（mate）文化时，通常直接借用西班牙语。","注意：在很多西语地区，bombilla 也常指“灯泡”。但在英语语境中，如果你在咖啡馆/南美饮品/马黛茶话题里看到 bombilla，几乎都是指“马黛茶吸管”。"]}
{"word":"Bombinae","summary":{"en":"Bombinae is a zoological term for the subfamily that includes fire-bellied toads (Bombina).","zh":"Bombinae 是动物学名词，指包含火腹蟾（Bombina 属）在内的一个亚科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a subfamily of amphibians (true toads) that includes the fire-bellied toads (genus Bombina), known for their brightly colored bellies used as a warning signal.","zh":"蟾蜍科中的一个亚科，包含火腹蟾（Bombina 属）等两栖动物，以鲜艳的腹部颜色作为警戒信号而闻名。"},"examples":[{"en":"Bombinae includes the well-known fire-bellied toads kept by some amphibian hobbyists.","zh":"Bombinae（火腹蟾亚科）包括一些很有名的火腹蟾，有些两栖爱好者会饲养它们。"},{"en":"In a field guide, Bombinae is listed under true toads rather than frogs.","zh":"在野外图鉴中，Bombinae 常被归在“蟾蜍”而不是“青蛙”之下。"}]}],"synonyms":["fire-bellied toads (common name, not the formal rank)"],"phonetic":"/bɑmˈbɪni.i/","extraExplanation":["“Bombinae”是动物分类学（taxonomy）中的拉丁化名称：后缀 -inae 常用于表示“亚科”。","火腹蟾的腹部常呈红色或橙色并带黑斑，这种醒目颜色与“警戒色”有关，遇到威胁时它们会露出腹部来吓退捕食者。","在日常英语里，人们更常说“fire-bellied toads（火腹蟾）”，而“Bombinae”多见于学术文章、图鉴或博物学语境。"]}
{"word":"bombinae","summary":{"en":"Bombinae is the scientific name for a subfamily of toads, especially the fire-bellied toads.","zh":"Bombinae 是蟾蜍类两栖动物的一个亚科的学名，尤其指火腹蟾这一类群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a taxonomic subfamily of amphibians (toads), commonly called fire-bellied toads, known for their bright warning colors on the belly","zh":"（生物分类）蟾蜍类两栖动物的一个亚科，常称“火腹蟾/火腹蟾蜍”，以腹部鲜艳的警戒色著称"},"examples":[{"en":"Some species in Bombinae display bright red or orange bellies to warn predators.","zh":"Bombinae 亚科的一些物种腹部呈鲜红或橙色，用来警告捕食者。"},{"en":"In a field guide, Bombinae may be listed under the broader group of toads and other amphibians.","zh":"在野外图鉴中，Bombinae 可能会被列在更大的“蟾蜍及其他两栖类”分类之下。"}]}],"synonyms":["fire-bellied toads (common name)"],"phonetic":"/bɑmˈbɪni/","extraExplanation":["“Bombinae”来自拉丁化的学名体系：词根与“Bombina（火腹蟾属）”相关；后缀“-ae”常用于表示某一“亚科/科”层级的分类名称。不同资料在分类层级上可能有差异（例如把相关类群放在不同科或亚科中），但学习时可先抓住核心：它指与火腹蟾相关的一群两栖动物。"]}
{"word":"bombinate","summary":{"en":"Bombinate means to buzz or hum in a droning way, like a bee.","zh":"bombinate 指像蜜蜂一样嗡嗡作响或低沉地嗡鸣（较罕见、偏文艺用法）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make a humming or buzzing sound, like a bee; to drone.","zh":"（像蜜蜂一样）嗡嗡作响；发出低沉的嗡鸣声。"},"examples":[{"en":"Bees bombinated around the lavender in the afternoon sun.","zh":"下午的阳光下，蜜蜂在薰衣草周围嗡嗡飞鸣。"},{"en":"The old ceiling fan bombinated all night and kept me awake.","zh":"那台旧吊扇整晚嗡嗡作响，让我睡不着。"}]}],"synonyms":["buzz","hum","drone","whir"],"phonetic":"/ˈbɑːm.bə.neɪt/","extraExplanation":["这是一个非常罕见、带点幽默感或文艺气息的词，日常英语里更常用 buzz / hum / drone。","词源来自拉丁语 bombinare，模仿“嗡嗡”的声音（和 bombus“熊蜂”同源）。","有时也被用来“故意用夸张冷僻词”的写作风格来制造喜感或古典味道。"]}
{"word":"bombinating","summary":{"en":"Bombinating means making a buzzing/humming sound; more rarely, it can mean droning on while speaking.","zh":"bombinating 指“嗡嗡作响/发出持续的嗡鸣声”；较少见时也可指“说话单调絮叨、像嗡嗡声一样没完没了”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"making a low, continuous buzzing or humming sound (like a bee or a machine).","zh":"发出低沉、持续的嗡嗡声（像蜜蜂或机器的声音）。"},"examples":[{"en":"Bees were bombinating around the lavender bushes.","zh":"蜜蜂在薰衣草丛周围嗡嗡作响。"},{"en":"The old refrigerator sat in the corner, bombinating all night.","zh":"那台旧冰箱在角落里整晚嗡嗡响。"}]},{"partOfSpeech":"vi.","definition":{"en":"(figurative, rare) speaking in a dull, droning way; going on and on.","zh":"（引申义，较少见）以单调、嗡嗡般的方式说个不停；絮絮叨叨。"},"examples":[{"en":"He kept bombinating about the same complaint for an hour.","zh":"他围绕同一个抱怨絮絮叨叨讲了一个小时。"},{"en":"The lecturer bombinated through the slides, and half the room looked sleepy.","zh":"讲师单调地念着幻灯片，半个教室的人都显得昏昏欲睡。"}]}],"synonyms":["buzzing","humming","droning","whirring"],"phonetic":"/ˈbɑːm.bəˌneɪ.tɪŋ/","extraExplanation":["“bombinating”是动词“bombinate”的现在分词/动名词形式，整体语气偏文学、偏罕见，日常英语更常用“buzz / hum”。","词源与拉丁语“bombus（嗡嗡声）”有关，带有拟声色彩，所以读起来也有“嗡”的感觉。","在文学或修辞中，用它会显得俏皮、夸张或带一点“刻意用冷僻词”的幽默效果。"]}
{"word":"bombination","summary":{"en":"Bombination means a steady buzzing or humming sound, often from bees or insects.","zh":"Bombination 指持续的嗡嗡/嗡鸣声，常用于形容蜜蜂或昆虫的声音。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a deep, continuous humming or buzzing sound (especially the sound made by bees or insects)","zh":"（尤指蜜蜂或昆虫发出的）低沉、持续的嗡嗡声"},"examples":[{"en":"On a hot afternoon, the garden was filled with the bombination of bees.","zh":"在炎热的午后，花园里充满了蜜蜂的嗡嗡声。"},{"en":"The quiet field had only the bombination of insects and the rustle of grass.","zh":"寂静的田野里只有昆虫的嗡嗡声和草叶的沙沙声。"}]}],"synonyms":["buzzing","humming","drone","whirring","burring"],"phonetic":"/ˌbɑːmbəˈneɪʃən/","extraExplanation":["“Bombination” 是比较少见、偏文学/书面化的词，多用来营造氛围感（比如夏日花园、乡野安静背景中的虫鸣）。","词源与拉丁语有关，和表示“嗡嗡声/蜂类”的词根相连，因此带有拟声色彩。"]}
{"word":"bombing","summary":{"en":"“Bombing” usually means an attack using bombs; informally, it can mean failing badly.","zh":"“bombing”通常指用炸弹进行的轰炸/爆炸袭击；在口语中也可指表现很差、彻底失败。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an attack in which bombs are dropped or exploded (often from aircraft, missiles, or planted explosives)","zh":"轰炸；爆炸袭击（通常指从飞机/导弹投放，或安放爆炸物引爆的攻击）"},"examples":[{"en":"The city suffered heavy bombing during the war.","zh":"战争期间，这座城市遭受了猛烈轰炸。"},{"en":"The bombing caused serious damage to the station.","zh":"这次爆炸袭击对车站造成了严重破坏。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of throwing bombs or dropping them from the air; the process of attacking with bombs","zh":"投弹；轰炸行为（指用炸弹实施攻击的过程）"},"examples":[{"en":"The bombing continued through the night.","zh":"轰炸持续了一整夜。"},{"en":"They discussed banning the bombing of civilian areas.","zh":"他们讨论禁止轰炸平民地区。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal) doing very badly or failing, especially on a test, performance, or project","zh":"（非正式）搞砸；表现很差；失败（尤指考试、表演或项目）"},"examples":[{"en":"I’m bombing this math test—I don’t understand anything.","zh":"这次数学考试我肯定考砸了——我什么都不懂。"},{"en":"His jokes were bombing, so he ended the speech early.","zh":"他的笑话反响很差，所以他提前结束了演讲。"}]}],"synonyms":["airstrike","bombardment","attack","explosion","failure","flopping"],"phonetic":"/ˈbɑmɪŋ/","extraExplanation":["“bombing”既可以指军事/恐怖袭击语境中的“轰炸、爆炸袭击”，也可以出现在口语里表示“彻底失败/表现很糟”。在新闻里常见搭配：air bombing（空袭）、car bombing（汽车炸弹袭击）、suicide bombing（自杀式爆炸袭击）。","语体提示：谈到现实暴力事件时用词要谨慎、尊重受害者；如果只是表达考试或表演“失败”，用口语义的“bombing”更轻松，但在正式写作中可用“fail badly / perform poorly”。"]}
{"word":"bombings","summary":{"en":"“Bombings” means bomb attacks or bomb-caused explosions, usually referring to multiple incidents.","zh":"“bombings”指炸弹袭击或由炸弹引发的爆炸事件，通常指多起事件。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"acts of using bombs to attack a place or people; explosions caused by bombs (often plural).","zh":"爆炸袭击；用炸弹攻击的行为（常用复数）。"},"examples":[{"en":"The news reported several bombings in the capital last week.","zh":"新闻报道说上周首都发生了数起爆炸袭击。"},{"en":"The police increased security after the bombings.","zh":"爆炸袭击发生后，警方加强了安保。"}]}],"synonyms":["bomb attacks","explosions","attacks"],"phonetic":"/ˈbɑmɪŋz/","extraExplanation":["“bombing”既可指“轰炸/投弹”（多用于战争语境，如 aerial bombing），也可指“爆炸袭击”（多用于恐袭或犯罪语境，如 a bombing in the subway）。复数“bombings”常用来概括一段时间内多起事件。","新闻写作中常见搭配：a series/wave of bombings（一连串/一波爆炸袭击），deadly bombings（致命的爆炸袭击），suspect in the bombings（爆炸案嫌疑人）。使用时注意语境的严肃性与敏感性。"]}
{"word":"bomble","summary":{"en":"“Bomble” is not a standard English word; it’s usually a misspelling of “bobble” or confusion with “bomblet.”","zh":"“bomble”不是标准英语词；多半是把“bobble”拼错，或与“bomblet”混淆。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“Bomble” is not a standard modern English word. It is most often a misspelling of “bobble” (to move up and down) or a mistaken shortening of “bomblet” (a small bomb).","zh":"“bomble”不是现代英语中的标准单词。它最常见是把“bobble”（上下晃动）拼错了，或把“bomblet”（小型炸弹/子炸弹）误写成更短的形式。"},"examples":[{"en":"Did you mean “bobble”? The car bobbled over the rough road.","zh":"你是想写“bobble”吗？车在颠簸的路上上下晃动。"},{"en":"If you mean a small bomb, the usual word is “bomblet,” not “bomble.”","zh":"如果你想表达“小型炸弹”，常用词是“bomblet”，而不是“bomble”。"}]}],"synonyms":["bobble","bomblet","bomb"],"phonetic":"/ˈbɑmbəl/","extraExplanation":["在英语里，名词“bomb（炸弹）”加上常见的“小东西/小规模”后缀时，更常见的是“-let”（如：booklet 小册子、piglet 小猪）。所以“小炸弹”通常说“bomblet”。","而“bobble”来自表示“摇晃、颠动”的用法，常用于描述物体（或人的头）上下晃动，也可指“（运动中）失手没接住球”。如果你告诉我你的句子原文，我可以帮你确认你想用的是哪个词。"]}
{"word":"bomblet","summary":{"en":"A bomblet is a small bomb, often one of many released from a cluster munition.","zh":"bomblet 指小型炸弹，常指集束弹药散布出的子炸弹/子弹药。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small bomb, especially one released in large numbers from a larger container (a cluster munition)","zh":"小型炸弹；（尤指）从更大的容器中成群散布的子炸弹/子弹药（集束弹药的一部分）"},"examples":[{"en":"The report described hundreds of unexploded bomblets left in the area after the attack.","zh":"报告称袭击后该地区留下了数百枚未爆的子炸弹。"},{"en":"Civilians were warned to avoid fields where bomblets might still be buried.","zh":"人们警告平民避免进入可能仍埋有子炸弹的田地。"}]}],"synonyms":["submunition","small bomb","cluster bomblet"],"phonetic":"/ˈbɑm.lət/","extraExplanation":["“bomblet”常见于新闻报道、军事分析与人道救援语境，指“集束弹药”释放出的许多小型爆炸物。由于可能出现“未爆弹”（UXO），在战后对平民造成长期风险，因此在国际人道议题中也经常被提及。","构词上是 bomb + -let（表示“小”的后缀），意思直译为“小炸弹”。在正式写作中也可能看到 cluster bomblet（集束子炸弹）或 submunition（子弹药/子弹药单元）等相关词。"]}
{"word":"bombline","summary":{"en":"Bombline (often written “bomb line”) is a military term for a marked boundary or line related to planned bombing operations.","zh":"Bombline（常写作 bomb line）是军事用语，指与计划轰炸行动有关的标记边界线或线条。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a (usually military) line or boundary marking the intended area or limit for bombing, often used in planning maps or operations","zh":"（多用于军事）“投弹线/轰炸线”：在作战计划或地图上标出的线，用来表示计划轰炸的区域或轰炸范围的边界"},"examples":[{"en":"The pilots were told not to cross the bombline until they received final clearance.","zh":"飞行员被告知在收到最终许可前不要越过轰炸线。"},{"en":"On the map, the bombline showed where the strike was supposed to begin.","zh":"在地图上，轰炸线标出了打击行动应从哪里开始。"}]}],"synonyms":["bombing line","strike boundary","target line"],"phonetic":"/ˈbɑmˌlaɪn/","extraExplanation":["“bombline”并不是日常英语里的常用词，更常见的写法是分开的“bomb line”。它多出现在军事历史、战术讨论、作战地图标注等语境中。","很多学习者会把“bombline”误看成“bottom line”（关键点/最终结论/利润底线）。如果你想表达“关键结论”，通常应使用“bottom line”。"]}
{"word":"bombload","summary":{"en":"Bombload means the total amount of bombs an aircraft carries.","zh":"bombload 指飞机携带的炸弹总量（重量或数量），即“载弹量”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the total weight or number of bombs that an aircraft (or drone) carries on a mission","zh":"（飞机/无人机一次任务中）携带的炸弹总重量或总数量；载弹量"},"examples":[{"en":"The bomber’s bombload was reduced to carry extra fuel.","zh":"这架轰炸机为了携带更多燃油而减少了载弹量。"},{"en":"With a heavier bombload, the plane could not fly as far.","zh":"载弹量更重时，飞机的航程会变短。"}]}],"synonyms":["bomb load","payload","weapons load","ordnance load"],"phonetic":"/ˈbɑmˌloʊd/","extraExplanation":["这是军事航空语境中常见的复合词：bomb（炸弹）+ load（载荷/装载量）。在新闻或军事分析里常与“payload（有效载荷）”“ordnance（军械/弹药）”一起出现。","在更准确的技术写法中，有时会用“bomb load”（分开写）或用“payload”来涵盖炸弹、导弹等所有武器载荷；而“bombload”更强调“炸弹”本身。"]}
{"word":"bombloads","summary":{"en":"Bombloads are the amounts of bombs carried and dropped by aircraft (plural of bombload).","zh":"bombloads 指飞机携带并投下的炸弹载量（bombload 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quantities of bombs carried and dropped by aircraft (plural of bombload); also used more generally for very large amounts of explosives delivered in an attack","zh":"（bombload 的复数）飞机携带并投下的炸弹载量；也可泛指一次攻击中投放的巨大爆炸物数量"},"examples":[{"en":"The planes returned after dropping their bombloads on military targets.","zh":"飞机在军事目标上投下炸弹载量后返航。"},{"en":"Historians compared bombloads across different aircraft models.","zh":"历史学家比较了不同机型的炸弹载量。"}]}],"synonyms":["payloads (in aviation/military contexts)","bomb payloads","ordnance loads"],"phonetic":"/ˈbɑmˌloʊd/","extraExplanation":["“bombload”是由 bomb（炸弹）+ load（载荷/载量）构成的复合名词，常见于军事和航空语境。复数“bombloads”通常指多架飞机各自携带的载量，或多次出击的投放量。","它也可被借用为夸张说法（较口语），如“a bombload of paperwork”（一大堆文书工作），但这种用法更常见的是“a truckload/ton of…”，因此“bombload of…”在日常英语里相对少见，且可能带有更强烈、冲击性的语气。"]}
{"word":"bombo","summary":{"en":"“Bombo” is a large bass drum associated with Latin American music, producing a deep, steady beat.","zh":"“Bombo”指拉丁美洲音乐中常见的大低音鼓，声音低沉，用来提供稳定的节拍。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large bass drum used in Latin American music (especially Andean and other folk traditions), played with a mallet to make a deep beat","zh":"（拉丁美洲音乐中常见的）大低音鼓；用鼓槌敲击，发出低沉节拍"},"examples":[{"en":"The bombo keeps a steady, deep rhythm in the folk band.","zh":"在这支民谣乐队里，bombo 用稳定而低沉的节奏打底。"},{"en":"You can hear the bombo clearly during the dance section.","zh":"在舞蹈段落中你能清楚听到 bombo 的声音。"}]},{"partOfSpeech":"n.","definition":{"en":"(sometimes) a large drum used in marching bands or carnival-style parades in some Spanish-speaking regions","zh":"（在部分西语地区）游行或嘉年华队伍中使用的大鼓"},"examples":[{"en":"Drummers carried a bombo at the front of the parade.","zh":"鼓手们在游行队伍前方抬着一面 bombo。"}]}],"synonyms":["bass drum","big drum"],"phonetic":"/ˈbɑmboʊ/","extraExplanation":["“Bombo”是西班牙语借词，字面上常指“大鼓/低音鼓”。不同国家与曲风里，它的形制和演奏方式可能略有差异：例如安第斯（Andean）音乐中的bombo多用来提供厚重、规律的低音脉动。","在英语语境中，bombo常出现在音乐介绍、民族音乐（world music）或拉美文化相关文本里；如果是一般西方管弦乐或摇滚语境，通常会直接说“bass drum”。"]}
{"word":"bombola","summary":{"en":"Bombola means a (usually Italian-referenced) gas cylinder or tank, sometimes specifically a diving air cylinder.","zh":"bombola 指（多见于意大利语语境的）气瓶/钢瓶/气罐，有时特指潜水用的空气瓶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Italian loanword) A cylinder or tank, especially a gas cylinder used for oxygen, propane, CO₂, etc.","zh":"（意大利语借词）钢瓶；气瓶；（尤指）装氧气、丙烷、二氧化碳等的气体钢瓶/气罐。"},"examples":[{"en":"The technician replaced the empty oxygen bombola.","zh":"技术员更换了空的氧气钢瓶。"},{"en":"Make sure the CO₂ bombola is tightly connected before you start the machine.","zh":"启动机器前，确保二氧化碳气瓶连接牢固。"}]},{"partOfSpeech":"n.","definition":{"en":"By extension, a compressed-air cylinder used for diving or industrial work.","zh":"引申：潜水或工业作业用的压缩空气气瓶。"},"examples":[{"en":"He checked his bombola and regulator before the dive.","zh":"下水前他检查了气瓶和调节器。"}]}],"synonyms":["gas cylinder","gas tank","oxygen cylinder","canister","air tank"],"phonetic":"/bɑmˈboʊlə/","extraExplanation":["“bombola”在英语里多见于意大利语影响较强的语境（如欧洲潜水、设备说明、意大利品牌/说明书）。在更通用的英语中，通常说“gas cylinder / tank / canister”。","词源上与意大利语“bomba（泵/气罐）”有关；在意大利语里常用“bombola del gas（煤气罐）”“bombola d’ossigeno（氧气瓶）”等搭配。"]}
{"word":"bombonne","summary":{"en":"Bombonne is a Canadian term (from French) meaning either a candy jar/dish or, especially in Quebec, a large bottle/gas cylinder.","zh":"Bombonne 是加拿大用语（源自法语），可指糖果罐／糖果碟，也可（尤在魁北克）指大瓶或气瓶／钢瓶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Canada, from French) A candy jar or dish, often used for holding small sweets (bonbons).","zh":"（加拿大用法，源自法语）糖果罐／糖果碟，常用来装小糖果（bonbons）。"},"examples":[{"en":"My grandmother kept a bombonne of hard candies on the coffee table.","zh":"我祖母在茶几上放着一只装硬糖的糖果罐。"},{"en":"The kids ran to the bombonne after dinner.","zh":"孩子们晚饭后就跑去拿糖果罐里的糖。"}]},{"partOfSpeech":"n.","definition":{"en":"(Canada, especially Quebec) A large bottle or cylinder, especially a gas cylinder (e.g., for welding or medical oxygen).","zh":"（加拿大，尤其魁北克）大瓶／钢瓶，尤指气瓶（如焊接用气瓶或医用氧气瓶）。"},"examples":[{"en":"He swapped the empty bombonne for a full oxygen cylinder.","zh":"他把空氧气瓶换成了满的。"},{"en":"The shop stores the welding bombonnes in a separate room.","zh":"那家店把焊接用气瓶存放在单独的房间里。"}]}],"synonyms":["candy jar","candy dish","bonbon dish","gas cylinder","tank"],"phonetic":"/bɑmˈbɑn/","extraExplanation":["“bombonne”主要是加拿大英语（尤其受魁北克法语影响）里会见到的词，源自法语用法。不同地区可能更常用更标准的说法：装糖的常说“candy jar / candy dish”，装气的常说“gas cylinder / tank”。","在魁北克的日常口语或本地英语语境中，“bombonne”常被直接借用来指“气瓶/钢瓶”，属于地域色彩较强的词。"]}
{"word":"bombora","summary":{"en":"An offshore submerged reef/sandbar where waves break hard; the breaking waves there.","zh":"指外海水下暗礁/沙洲造成的强烈破碎浪地带，也可指那里的礁浪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Australian English) A submerged reef, rock shelf, or sandbar offshore that makes waves break strongly; the heavy breaking waves formed there are also called a “bombora.”","zh":"（澳大利亚英语）近海水下的暗礁、岩架或沙洲，会使海浪在此猛烈破碎；由此形成的强烈破碎浪也可称为 bombora（礁浪/险浪）。"},"examples":[{"en":"The surfers paddled out toward the bombora to catch bigger waves.","zh":"冲浪者划向外海的 bombora，想追更大的浪。"},{"en":"A hidden bombora can be dangerous for boats at low tide.","zh":"隐藏的 bombora 在低潮时对船只可能很危险。"},{"en":"The forecast said the bombora would be firing this afternoon.","zh":"预报说今天下午外海礁浪（bombora）会很猛。"}]}],"synonyms":["reef break","shoal","sandbar","offshore reef"],"phonetic":"/bɑmˈbɔrə/","extraExplanation":["这是典型的澳大利亚冲浪文化用语，常见于海滩对话、冲浪预报和海事提醒中。它强调“外海暗礁/沙洲导致浪在远离岸边处突然炸裂”的地形与浪况。"]}
{"word":"bombos","summary":{"en":"“Bombos” usually means large bass drums (especially in Latin music) or lottery mixing drums.","zh":"“Bombos”通常指（拉丁音乐中的）大鼓/低音大鼓，或抽奖用的摇号转筒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “bombo”: a large drum (often a bass drum) used especially in Latin American music, or a rotating drum used to mix/choose lottery numbers.","zh":"“bombo”的复数：一种大鼓（常指低音大鼓），尤用于拉丁美洲音乐；也可指用于搅拌/抽取号码的抽奖转筒。"},"examples":[{"en":"The parade band carried bombos that you could feel in your chest.","zh":"游行乐队抬着大鼓，低音震得胸口都能感觉到。"},{"en":"They put the tickets in the bombos and spun them to pick a winner.","zh":"他们把票放进抽奖转筒里，转动它来选出中奖者。"}]}],"synonyms":["bass drums","big drums","lottery drum"],"phonetic":"ˈbɑmboʊ","extraExplanation":["“bombo”主要来自西班牙语，在英语中多见于描述拉丁音乐/民俗场景或抽奖装置；日常英语里更常说 bass drum（低音大鼓）。","在一些拉丁美洲国家，“bombo”也可指抽奖用的选号滚筒（类似“摇号机”），语境通常会说明是抽奖还是乐器。"]}
{"word":"bombous","summary":{"en":"“Bombus” is the scientific genus name for bumblebees.","zh":"“Bombus”是熊蜂（大黄蜂）在分类学中的属名（学名）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Biology) A genus of bumblebees; the scientific (Latin) name used in taxonomy. Often seen in species names like *Bombus terrestris*.","zh":"（生物）熊蜂属；用于分类学的拉丁学名。常见于物种学名中，如 *Bombus terrestris*（大地熊蜂）。"},"examples":[{"en":"Scientists studied *Bombus* species to understand pollination in cold climates.","zh":"科学家研究熊蜂属（*Bombus*）的物种，以了解寒冷气候下的授粉。"},{"en":"*Bombus terrestris* is a well-known bumblebee used in greenhouse pollination.","zh":"*Bombus terrestris*（大地熊蜂）是一种常用于温室授粉的知名熊蜂。"}]}],"synonyms":["bumblebee (common name)","bumblebee genus"],"phonetic":"/ˈbɑmbəs/","extraExplanation":["你输入的 **bombous** 很可能是拼写误差，更常见的是 **Bombus**（熊蜂属）。在英语文章里它通常首字母大写、斜体用于学名（如 *Bombus impatiens*）。如果你想表达普通名“熊蜂/大黄蜂”，更常用的词是 **bumblebee**。"]}
{"word":"bombproof","summary":{"en":"“Bombproof” means extremely strong, safe, or reliable; it can also mean to make something that strong or secure.","zh":"“bombproof”指极其坚固/安全/可靠；也可作动词，表示把某物加固或做得万无一失。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Extremely strong or safe; designed to resist damage or failure, even under heavy stress.","zh":"非常坚固或安全的；即使在巨大压力下也不容易损坏或出问题的。"},"examples":[{"en":"The company built a bombproof data backup system.","zh":"这家公司建立了一个极其可靠的数据备份系统。"},{"en":"Her argument was bombproof, with clear evidence and logic.","zh":"她的论证滴水不漏，证据和逻辑都很清晰。"}]},{"partOfSpeech":"vt.","definition":{"en":"To make something very strong, reliable, or protected against damage or problems.","zh":"使某物变得非常牢固、可靠，或更能抵御破坏与风险。"},"examples":[{"en":"We need to bombproof the plan before the launch.","zh":"我们需要在上线前把计划打磨得万无一失。"},{"en":"They bombproofed the building’s entrances with stronger doors.","zh":"他们用更坚固的门把大楼入口加固了。"}]}],"synonyms":["robust","durable","secure","fail-safe","unbreakable"],"phonetic":"/ˈbɑmˌpruf/","extraExplanation":["“bombproof”原意与军事/防爆有关，指能承受爆炸冲击的结构或掩体。现代口语里常被引申为“非常可靠、几乎不可能出错”，用于系统、计划、论点等。","语气上通常偏强调与夸张；在正式写作里可用更中性的词替换，如 “robust”（健壮的）、“fail-safe”（防故障的）、“well-protected”（保护良好的）。"]}
{"word":"bombs","summary":{"en":"“Bombs” most commonly means multiple explosive weapons; it can also mean “fails badly” in informal speech.","zh":"“bombs”通常指多枚炸弹；口语里也可指“惨败/表现很糟”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “bomb”: explosive weapons that can be dropped, thrown, or planted and that can cause serious damage.","zh":"“bomb”的复数：炸弹；可投放、投掷或安放的爆炸武器，会造成严重破坏。"},"examples":[{"en":"The police evacuated the area after two bombs were found near the station.","zh":"在车站附近发现两枚炸弹后，警方疏散了该区域。"},{"en":"During the war, bombs destroyed many buildings in the city.","zh":"战争期间，炸弹摧毁了城市里的许多建筑。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular of “bomb”: to fail badly (informal), especially in a test, performance, or at the box office.","zh":"“bomb”的第三人称单数：惨败；（尤指考试、表演或票房）表现很糟（非正式）。"},"examples":[{"en":"He bombs every time he tries to tell that joke.","zh":"他每次讲那个笑话都会冷场。"},{"en":"The movie bombs despite a famous cast.","zh":"尽管演员阵容很强，这部电影还是票房惨败。"}]}],"synonyms":["explosives","bombshells","fails","flops"],"phonetic":"/bɑmz/","extraExplanation":["“bomb”在口语里表示“惨败/砸锅”，常用于表演（a comedian bombs）、考试（I bombed the test）或票房（The film bombed）。注意：这个用法是比喻意义，与真实的爆炸事件无关，正式场合可用“fail badly / be unsuccessful”更稳妥。"]}
{"word":"bombshell","summary":{"en":"Bombshell usually means shocking news; it can also mean a very attractive woman (informal and potentially objectifying).","zh":"Bombshell 通常指“爆炸性、震撼性的消息”；也可指“性感美女”（非正式且可能带物化色彩）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surprising and shocking piece of news or event.","zh":"爆炸性新闻；令人震惊的消息或事件。"},"examples":[{"en":"The report dropped a bombshell: the company had been hiding debt for years.","zh":"这份报告抛出一颗“重磅炸弹”：公司多年来一直在隐瞒债务。"},{"en":"Her resignation was a bombshell that changed the whole election.","zh":"她的辞职是一条爆炸性消息，彻底改变了整个选举局势。"}]},{"partOfSpeech":"n.","definition":{"en":"A very attractive woman (informal; can sound old-fashioned or objectifying, so use with care).","zh":"性感美女（非正式；可能显得过时或带有物化意味，使用需谨慎）。"},"examples":[{"en":"The tabloid called her a “blonde bombshell,” but she preferred to be known for her acting.","zh":"小报称她为“金发性感女神”，但她更希望人们记住她的演技。"},{"en":"That term can be disrespectful in professional settings.","zh":"在职场等正式场合，这个说法可能不够尊重。"}]}],"synonyms":["shock","stunner","sensation","revelation","blockbuster (news)"],"phonetic":"/ˈbɑmˌʃɛl/","extraExplanation":["“Drop a bombshell”是常见搭配，意思是“突然抛出震撼消息/放出重磅消息”。新闻、职场、八卦语境里都很常见。","“Bombshell”原义与“炸弹/炮弹”有关，借喻为“像爆炸一样震撼”的信息。形容女性的用法在20世纪中期（好莱坞宣传、杂志标题）尤其流行，如形容玛丽莲·梦露（Marilyn Monroe）一类的形象；现代语境中更建议用更中性、尊重的表达（如 attractive / stunning / charismatic）。"]}
{"word":"bombshells","summary":{"en":"“Bombshells” is the plural of “bombshell”: it can mean powerful bombs or, more commonly in modern English, shocking news; it can also mean an attractive woman (informal, sometimes objectifying).","zh":"bombshells 是 bombshell 的复数：可指威力很大的炸弹；更常见的引申义是“爆炸性消息”；也可口语指“美女”（有时带物化意味）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large bomb, especially one that causes serious damage when it explodes.","zh":"（尤指爆炸威力很大的）炸弹、重磅炸弹。"},"examples":[{"en":"The documentary showed footage of bombshells falling during the war.","zh":"纪录片展示了战争中重磅炸弹投下的画面。"},{"en":"Workers found an old bombshell buried near the construction site.","zh":"工人们在工地附近发现了一枚埋在地下的旧炸弹。"}]},{"partOfSpeech":"n.","definition":{"en":"A shocking and surprising piece of news, event, or revelation (often: “drop a bombshell”).","zh":"（令人震惊的）爆炸性消息；突如其来的重大揭露（常用：drop a bombshell）。"},"examples":[{"en":"She dropped a bombshell at dinner: she was moving abroad next month.","zh":"她在晚餐时抛出爆炸性消息：下个月要搬去国外。"},{"en":"The report contained bombshells about how the company hid its losses.","zh":"这份报告曝出爆料，揭示公司如何隐瞒亏损。"},{"en":"His resignation came as a bombshell to the whole team.","zh":"他的辞职让整个团队都很震惊。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, sometimes objectifying) A very attractive woman.","zh":"（非正式；有时带物化意味）美女、性感女性。"},"examples":[{"en":"The movie treated the actress as a “bombshell,” focusing more on her looks than her talent.","zh":"这部电影把女演员当作“性感美女”来塑造，更强调外貌而不是才华。"}]}],"synonyms":["explosive","shell","shock","stunner","revelation","headline","sensation"],"phonetic":"/ˈbɑmˌʃɛl/","extraExplanation":["“Bombshell”本义是“炸弹/炮弹”，后来被引申为“像爆炸一样震撼的消息”。常见搭配：drop a bombshell（抛出重磅消息）、a political bombshell（政治爆料）。","表示“美女”的用法在英语里较口语、也可能带性别刻板印象；正式写作中可用更中性的表达，如 “a very attractive person / a glamorous star”。"]}
{"word":"bombsight","summary":{"en":"A bombsight is an aircraft aiming device used to help drop bombs accurately; it can also be used figuratively for precise targeting.","zh":"bombsight 指飞机上的投弹瞄准器，用来帮助更准确地投弹；也可比喻“精准瞄准/精确定位”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device on an aircraft used to aim bombs and calculate where they will land when released.","zh":"（飞机上的）投弹瞄准器；用于瞄准投弹并计算炸弹投放后落点的装置。"},"examples":[{"en":"The bomber crew relied on the bombsight to line up the target.","zh":"轰炸机机组依靠投弹瞄准器来对准目标。"},{"en":"In the museum, you can see an old bombsight from World War II.","zh":"在博物馆里，你可以看到一台二战时期的旧投弹瞄准器。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) A way of aiming very precisely at a target or goal.","zh":"（比喻）精确瞄准的方法；对准目标的精准手段。"},"examples":[{"en":"Good data acts like a bombsight, helping the team focus on the real problem.","zh":"好的数据就像投弹瞄准器，帮助团队把注意力集中在真正的问题上。"}]}],"synonyms":["bomb aimer","bombing sight","sight"],"phonetic":"/ˈbɑmˌsaɪt/","extraExplanation":["“Bombsight”在20世纪军事史中很常见，尤其与二战战略轰炸相关。著名的“Norden bombsight（诺登投弹瞄准器）”曾被宣传为能大幅提高投弹精度，但实际效果会受到天气、敌方防空、飞行高度与速度等因素影响。这个词也常出现在战争回忆录、历史纪录片和军事博物馆的展品说明中。"]}
{"word":"bombsights","summary":{"en":"Bombsights are devices on aircraft used to aim bombs accurately (plural of “bombsight”).","zh":"Bombsights 指飞机上的投弹瞄准器，用于帮助更准确地瞄准并投放炸弹（bombsight 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an aiming device on an aircraft used to help a bombardier/crew aim and release bombs accurately (plural of “bombsight”)","zh":"（飞机上的）投弹瞄准器；用于帮助投弹人员/机组瞄准并更准确投放炸弹的装置（bombsight 的复数）"},"examples":[{"en":"During World War II, many bombers carried mechanical bombsights to improve accuracy.","zh":"在第二次世界大战期间，许多轰炸机都配备了机械式投弹瞄准器来提高命中率。"},{"en":"The museum displays bombsights alongside other navigation instruments.","zh":"博物馆把投弹瞄准器与其他导航仪器一起展出。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative, less common) methods or tools used to target something precisely, especially in attacks or criticism","zh":"（比喻，较少见）用于“精准打击/精准针对”的手段或工具，尤指攻击或批评时的精准指向"},"examples":[{"en":"The report was written like a bombsight, locking onto every weakness in the plan.","zh":"这份报告像投弹瞄准器一样，精准锁定了计划中的每个弱点。"}]}],"synonyms":["bomb-aiming device","bombing sight","sight","aiming apparatus","bombing instrument"],"phonetic":"/ˈbɑmˌsaɪts/","extraExplanation":["“Bombsight”在军事史中常与二战联系紧密，尤其是著名的“Norden bombsight（诺登投弹瞄准器）”。当时它被宣传为能大幅提高高空轰炸精度，但在真实作战环境中会受天气、风速、机动、能见度与敌方防空等因素影响，精度并不总如宣传。","词形上，bombsights 是复数：one bombsight / two bombsights。现代军机更常用电子/雷达/计算机化的火控与制导系统，传统机械式 bombsight 多见于历史语境。"]}
{"word":"Bombus","summary":{"en":"Bombus is the scientific genus name for bumblebees.","zh":"Bombus 是“熊蜂”的学名属名（熊蜂属）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of bumblebees (large, hairy bees) that live in colonies and are important pollinators; often used in scientific names.","zh":"熊蜂属：一种大型、多毛、群居的蜂类，是重要的传粉昆虫；常用于生物学（学名）中。"},"examples":[{"en":"Bombus terrestris is a common bumblebee species in Europe.","zh":"Bombus terrestris（地熊蜂）是欧洲常见的一种熊蜂。"},{"en":"The study compared pollen carried by Bombus and honeybees.","zh":"这项研究比较了熊蜂属（Bombus）与蜜蜂携带的花粉。"}]}],"synonyms":["bumblebee","bumblebees (general term)"],"phonetic":"/ˈbɑmbəs/","extraExplanation":["“Bombus”是拉丁化的学名（属名），在英文里多出现在科学写作、自然纪录片或昆虫学语境中；日常英语更常说“bumblebee（熊蜂/大黄蜂）”。","在生物分类中写法通常首字母大写并斜体：Bombus；具体物种名由“属名 + 种加词”构成，如 Bombus impatiens。注意它不同于“hornet（胡蜂）”，也不同于“honeybee（蜜蜂）”。"]}
{"word":"bombus","summary":{"en":"Bombus is the scientific genus name for bumblebees.","zh":"Bombus 是“熊蜂（大黄蜂）”的属级学名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of bees commonly known as bumblebees (large, fuzzy bees that often live in small colonies and are important pollinators)","zh":"熊蜂属（通常称为“大黄蜂/熊蜂”，体型较大、毛茸茸的蜜蜂，常形成小群落，是重要的传粉昆虫）"},"examples":[{"en":"Bombus species are important pollinators for many wildflowers and crops.","zh":"熊蜂属（Bombus）的物种为许多野花和农作物提供重要的传粉服务。"},{"en":"The researcher identified the bee as Bombus by its round body and dense hairs.","zh":"研究人员根据它圆胖的身体和浓密的绒毛将这只蜜蜂鉴定为熊蜂属（Bombus）。"}]}],"synonyms":["bumblebee (genus)"],"phonetic":"/ˈbɑm.bəs/","extraExplanation":["“Bombus”是拉丁化的学名（属名），在科普或学术语境里常用斜体书写：*Bombus*。日常英语更常说“bumblebee”。","在生物分类中，属名首字母大写（Bombus），而具体物种名会写成“Bombus + 小写种加词”，例如 *Bombus terrestris*。"]}
{"word":"bombycid","summary":{"en":"Bombycid means “related to or belonging to the silkworm moth family (Bombycidae).”","zh":"bombycid 指“与蚕蛾科（Bombycidae）有关的；或蚕蛾科成员”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Adj.) Relating to the silkworm moth family (Bombycidae), which includes the domesticated silkworm used to produce silk.","zh":"（形容词）与蚕蛾科（Bombycidae）有关的；该科包含用于产丝的家蚕等。"},"examples":[{"en":"Scientists compared bombycid moths with other moth families to study how silk production evolved.","zh":"科学家把蚕蛾科的蛾类与其他蛾科比较，以研究产丝能力如何演化。"},{"en":"The bombycid larva is best known for spinning silk to form a cocoon.","zh":"蚕蛾科的幼虫最为人熟知的是会吐丝结茧。"}]},{"partOfSpeech":"n.","definition":{"en":"(N.) A moth that belongs to the family Bombycidae; a member of the silkworm-moth group.","zh":"（名词）蚕蛾科的蛾；蚕蛾类群的一员。"},"examples":[{"en":"In the lab, the students observed a bombycid emerging from its cocoon.","zh":"在实验室里，学生观察到一只蚕蛾科的蛾从茧中羽化出来。"}]}],"synonyms":["silkworm moth (general)","Bombycidae (technical)"],"phonetic":"/bɑmˈbaɪsɪd/","extraExplanation":["“bombycid”来自拉丁化的新拉丁词根，关联到希腊语 bombyx（意为“蚕/丝”）。在生物学写作中它多用于学术语境，用来指“蚕蛾科的”或“蚕蛾科成员”。"]}
{"word":"Bombycidae","summary":{"en":"Bombycidae is the moth family that includes the silkworm moth and related silk-producing moths.","zh":"Bombycidae 指蚕蛾科，即包含家蚕蛾等与产丝相关的蛾类的一科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of moths that includes the domesticated silkworm moth and related species; many are known for producing silk.","zh":"蚕蛾科（鳞翅目的一科），包括家蚕蛾及其近缘种；其中许多与产丝有关。"},"examples":[{"en":"The domesticated silkworm moth belongs to the family Bombycidae.","zh":"家蚕蛾属于蚕蛾科（Bombycidae）。"},{"en":"Researchers compared wing patterns across several Bombycidae species.","zh":"研究人员比较了多种蚕蛾科物种的翅纹。"}]}],"synonyms":["silkworm moth family"],"phonetic":"/bɑmˈbɪsɪdi/","extraExplanation":["“Bombycidae”是生物分类学名称：科名常以“-idae”结尾；“Bombyx”（家蚕属）来自希腊语词根，和“丝/蚕”有关。","日常英语中更常见的说法是“silkworm moth(s)”（蚕蛾）或直接说“silkworm”指蚕的幼虫；“Bombycidae”多用于学术、昆虫学或科普语境。"]}
{"word":"bombycidae","summary":{"en":"Bombycidae is the moth family that includes the silkworm moth, associated with silk production.","zh":"Bombycidae 指“蚕蛾科”，包含家蚕蛾等与产丝相关的蛾类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of moths that includes the domesticated silkworm moth and related species, known for producing silk.","zh":"（昆虫）蚕蛾科：一类蛾的科，包括家蚕蛾及其近缘种，以能产丝而闻名。"},"examples":[{"en":"The silkworm moth belongs to the family Bombycidae.","zh":"家蚕蛾属于蚕蛾科（Bombycidae）。"},{"en":"Researchers compared Bombycidae with other moth families to study silk production.","zh":"研究人员将蚕蛾科与其他蛾类科进行比较，以研究产丝机制。"}]}],"synonyms":["silkworm moth family"],"phonetic":"/bɑmˈbɪsəˌdi/","extraExplanation":["词源提示：Bombycidae 来自拉丁化的学名体系，其中词根 bombyx 与“蚕/丝”有关；后缀 -idae 表示动物分类学中的“科”。","学习提示：这是一种生物分类学术语，常见于生物学、昆虫学或科普文章中；日常英语里更常说 silkworm moth（蚕蛾）或 silkworm（蚕）。"]}
{"word":"bombycids","summary":{"en":"Bombycids are silk-moth family moths (Bombycidae), including the silkworm moth.","zh":"bombycids 指天蚕蛾科的蛾类，包括家蚕蛾等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"moths of the family Bombycidae (especially the silkworm moth and its close relatives).","zh":"天蚕蛾科（Bombycidae）的蛾类（尤其指家蚕蛾及其近缘种）。"},"examples":[{"en":"Bombycids include the silkworm moth, which is important in silk production.","zh":"天蚕蛾科包括家蚕蛾，它在丝绸生产中很重要。"},{"en":"In the field guide, bombycids are grouped with other moth families by wing shape and patterns.","zh":"在野外图鉴里，天蚕蛾科常按翅形和花纹与其他蛾类家族一起分类。"}]}],"synonyms":["silk moths","Bombycidae"],"phonetic":"/bɑmˈbɪsɪdz/","extraExplanation":["“Bombycids”是复数形式；单数可说“a bombycid”。该词来自拉丁化的科名“Bombycidae”，而“Bombyx”与“silkworm（蚕）”相关，常见于生物学/昆虫学语境。"]}
{"word":"bombyciform","summary":{"en":"“Bombyciform” means moth-like, especially like silk moths.","zh":"“bombyciform”指“似蛾的”，尤指像蚕蛾（蚕蛾科）那样的形态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of an insect) Moth-like, especially resembling silk moths (family Bombycidae).","zh":"（指昆虫）似蛾的；尤指外形像蚕蛾（蚕蛾科 Bombycidae）的。"},"examples":[{"en":"The specimen has bombyciform wings and a thick, furry body.","zh":"这只标本有典型的蛾形（bombyciform）翅膀和粗壮、毛绒绒的身体。"},{"en":"Some moths in this group are described as bombyciform because they resemble the silkworm moth.","zh":"这一类中的一些蛾被称为 bombyciform，因为它们外形像家蚕蛾。"}]}],"synonyms":["moth-like","bombycine"],"phonetic":"/bɑmˈbɪsəˌfɔrm/","extraExplanation":["词源上来自拉丁化的 bombyx（“蚕、蚕蛾/丝”相关），加上形容词后缀 -form（“……形状的”），整体就是“呈蚕蛾那样形态的”。","这是偏生物学/昆虫学的描述性词汇，日常英语中很少用；在论文、野外记录或鉴定描述里更常见。"]}
{"word":"Bombycilla","summary":{"en":"Bombycilla is the scientific genus name for waxwings.","zh":"Bombycilla 是“太平鸟/蜡翼鸟（waxwing）”的属名（学名分类）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of birds (waxwings) known for silky plumage and small red, wax-like tips on some wing feathers","zh":"太平鸟属（蜡翼鸟属）：一类鸟（太平鸟/蜡翼鸟）的属名，常以柔滑羽毛和翅羽上像红蜡滴一样的小红色斑点而闻名"},"examples":[{"en":"Bombycilla includes the Bohemian waxwing and the cedar waxwing.","zh":"Bombycilla 属包括北太平鸟（Bohemian waxwing）和雪松太平鸟（cedar waxwing）。"},{"en":"In winter, birds of the genus Bombycilla often travel in flocks to find fruit.","zh":"冬季时，Bombycilla 属的鸟常成群迁移寻找果实。"}]}],"synonyms":["waxwing (common name)","genus Bombycilla"],"phonetic":"/bɑmˈbɪsɪlə/","extraExplanation":["“Bombycilla”来自拉丁语构词：bombyx（意为“丝/蚕丝”，引申为“如丝般光滑”）+ cilla（与“尾巴”相关的成分），整体用来描写太平鸟羽毛细腻、柔滑的外观。","在英文写作中它多见于鸟类学、分类学或自然史文本；日常英语更常用“waxwing（太平鸟）”。"]}
{"word":"bombycilla","summary":{"en":"Bombycilla is the scientific genus name for waxwings.","zh":"Bombycilla 是“太平鸟（waxwings）”的属名（学名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of birds (waxwings) known for silky plumage and small, wax-like red tips on some wing feathers; includes the Bohemian Waxwing and Cedar Waxwing","zh":"太平鸟属（waxwings）的鸟类属名；以丝滑羽毛和部分翅羽末端像“蜡滴”一样的红色小斑为特征，代表种有太平鸟与雪松太平鸟"},"examples":[{"en":"The Cedar Waxwing belongs to the genus Bombycilla.","zh":"雪松太平鸟属于太平鸟属（Bombycilla）。"},{"en":"In winter, Bombycilla species often travel in flocks to find berries.","zh":"冬季时，太平鸟属（Bombycilla）的鸟常常成群结队寻找浆果。"}]}],"synonyms":["waxwing","waxwings (genus)"],"phonetic":"/bɑmˈbɪsɪlə/","extraExplanation":["这是一个拉丁化的学名（属名），日常英语里更常用“waxwing（太平鸟）”来称呼这种鸟。","太平鸟的英文名 waxwing 来自它们翅膀上一些羽毛末端呈现“像蜡封/蜡滴”的红色小突起，看起来像被蜡点过。","常见物种：Bohemian Waxwing（太平鸟，Bombycilla garrulus）与 Cedar Waxwing（雪松太平鸟，Bombycilla cedrorum）。"]}
{"word":"Bombycillidae","summary":{"en":"Bombycillidae is the bird family that includes waxwings.","zh":"Bombycillidae 指“太平鸟科”，即包括太平鸟在内的一类鸟。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of birds that includes the waxwings (soft-plumaged, fruit-eating songbirds).","zh":"太平鸟科（鸟类的一科），包括太平鸟等以果实为主食、羽毛柔软的鸣禽。"},"examples":[{"en":"Waxwings belong to the family Bombycillidae.","zh":"太平鸟属于太平鸟科（Bombycillidae）。"},{"en":"Scientists recorded a Bombycillidae species feeding on winter berries.","zh":"科学家记录到一只太平鸟科的鸟在冬季吃浆果。"}]}],"synonyms":["waxwing family"],"phonetic":"/bɑm.bəˈsɪl.ɪ.di/","extraExplanation":["“Bombycillidae”是生物分类学中的“科名”，常用于学术写作与鸟类图鉴中；日常英语里更常说“waxwings”（太平鸟）。","词源上来自拉丁化的科学命名：Bombycilla（太平鸟属）+ -idae（动物“科”的常见后缀）。在英文中读写时常按“科学名”处理，首字母通常大写，斜体多用于属、种名；科名一般不必斜体。"]}
{"word":"bombycillidae","summary":{"en":"Bombycillidae is the bird family known as the waxwings.","zh":"Bombycillidae 指“太平鸟科”，也就是常说的太平鸟（waxwings）这一类鸟。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of small songbirds called waxwings, known for smooth plumage, a small crest, and (in some species) wax-like red tips on the wing feathers","zh":"太平鸟科（鸟类的一个科），俗称太平鸟；体型较小的鸣禽，羽毛细腻、常有小羽冠，部分种类翅羽末端有像蜡滴一样的红色“蜡状”羽尖"},"examples":[{"en":"Bombycillidae includes the Bohemian Waxwing and the Cedar Waxwing.","zh":"太平鸟科包括太平鸟（Bohemian Waxwing）和雪松太平鸟（Cedar Waxwing）。"},{"en":"In winter, birds in the family Bombycillidae often gather to eat berries.","zh":"冬天，太平鸟科的鸟常常成群结队地吃浆果。"}]}],"synonyms":["waxwings (common name)"],"phonetic":"/boʊm.bɪˈsɪl.ɪˌdiː/","extraExplanation":["“Bombycillidae”是鸟类分类学（科名）的拉丁化拼写，日常英语里更常用的说法是“waxwings（太平鸟）”。","词形提示：以“-idae”结尾通常表示“某某科”（family）的学名。"]}
{"word":"Bombycina","summary":{"en":"Bombycina is a rare word meaning “silky” or “made of silk,” and it can also mean “related to silkworms (Bombyx)” in scientific contexts.","zh":"Bombycina 是个少见词，表示“丝质的/如丝般柔滑的”；在科学语境中也可指“与蚕（Bombyx）或产丝昆虫有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, formal) Made of silk; silky in texture or appearance.","zh":"（罕见/正式）丝质的；像丝一样柔滑的。"},"examples":[{"en":"She wore a bombycina scarf that felt cool and smooth against the skin.","zh":"她围着一条丝质围巾，贴在皮肤上凉凉的、很柔滑。"},{"en":"The poet described the river mist as bombycina, soft and shining at dawn.","zh":"诗人把河上的薄雾写得如丝一般柔软，在黎明时闪着微光。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Scientific) Relating to silkworms, especially the genus Bombyx, or to silk-producing insects.","zh":"（科学用语）与蚕（尤指家蚕属 Bombyx）或产丝昆虫有关的。"},"examples":[{"en":"The paper discusses bombycina species used in traditional silk production.","zh":"这篇论文讨论了传统丝绸生产中使用的与蚕相关的物种。"},{"en":"Some museum labels use bombycina to indicate a connection with silkworm-derived materials.","zh":"一些博物馆标签会用 bombycina 来表示与蚕丝材料有关。"}]}],"synonyms":["silky","silken","satiny"],"phonetic":"/bɑmˈbɪsɪnə/","extraExplanation":["“bombycina”来自拉丁语，和“Bombyx（家蚕属）”同源；在英语中非常少见，多见于学术写作、博物学或较文学化的描写，用来表达“丝一般的质感/与蚕丝有关”。","日常英语里更常用的表达是“silky”“silken”“made of silk”。"]}
{"word":"bombycina","summary":{"en":"Bombycina means “silk-like” or “made of silk,” and in rarer scientific/Latin-style writing it can mean “related to silkworms or silk moths.”","zh":"bombycina 指“像丝绸的/由丝制成的”；在较少见的科学或拉丁式表达中，也可指“与蚕或蚕蛾类有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Silk-like; made of silk; having a smooth, soft, lustrous texture.","zh":"丝绸般的；由丝制成的；质感光滑柔软、有光泽的。"},"examples":[{"en":"She wore a bombycina scarf that caught the light like real silk.","zh":"她围着一条 bombycina（丝绸般的）围巾，光线一照就像真丝一样闪亮。"},{"en":"The fabric felt bombycina against the skin—cool, smooth, and gentle.","zh":"这种布料贴在皮肤上有 bombycina 的触感——凉爽、顺滑、柔和。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common, scientific/Latin-based use) Relating to silkworms or silk moths (Bombyx and related groups).","zh":"（较少见，偏科学/拉丁语用法）与蚕或天蚕蛾等“蚕蛾类”（Bombyx 及相关类群）有关的。"},"examples":[{"en":"Some older texts use bombycina in Latin-style descriptions of silk moth species.","zh":"一些较早的文献会用 bombycina 这种拉丁式词汇来描述蚕蛾类物种。"}]}],"synonyms":["silky","silken","satin-like"],"phonetic":"/ˌbɑmbɪˈsaɪnə/","extraExplanation":["“bombycina”源自拉丁语体系中的词形，和 Bombyx（家蚕/家蚕蛾属名）同源；根源可追溯到希腊语 bombyx，历史上与“丝、蚕、丝绸”相关。现代英语里更常见的对应词是 bombycine（同义、但更像英语形容词形式），以及直接说 silken / silky。"]}
{"word":"bombycine","summary":{"en":"Bombycine means “silky” or “made of silk,” and more rarely “related to silkworms or silk production.”","zh":"Bombycine 指“如丝般的/丝绸制的”，更少见地也指“与蚕或制丝相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) made of silk; silky in texture or appearance.","zh":"（较少用）丝绸制的；如丝般的、丝滑的（质地或外观）。"},"examples":[{"en":"She wore a bombycine scarf that felt cool and smooth on her skin.","zh":"她围着一条丝滑的丝巾，贴在皮肤上凉凉的、很顺滑。"},{"en":"The artist painted the fabric with a bombycine shine.","zh":"画家把布料的光泽画得像丝绸一样。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Technical/Rare) relating to silkworms (the genus Bombyx) or to silk production.","zh":"（技术/较少用）与蚕（家蚕属 Bombyx）或养蚕、制丝有关的。"},"examples":[{"en":"The museum displayed bombycine artifacts from early silk-making.","zh":"博物馆展出了早期制丝相关的蚕丝文物。"},{"en":"Researchers described the bombycine cycle of the silkworm in simple terms.","zh":"研究人员用通俗的话描述了家蚕的生长周期。"}]}],"synonyms":["silky","silken","seric","satiny"],"phonetic":"/ˈbɑːm.bə.saɪn/","extraExplanation":["词源上与拉丁语 *bombycinus* 有关，来自 *bombyx*（蚕、蚕蛾）。因此它既可以形容“像丝一样的质感”，也可指“与蚕/丝绸生产相关”。","这是一个偏文学或专业语境的词；日常英语更常用 **silky / silken / silk** 来表达同样意思。"]}
{"word":"bombycinous","summary":{"en":"Bombycinous means “silky; like silk,” often used in literary description.","zh":"bombycinous 意为“丝绸般的、柔滑有光泽的”，多见于文学描写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Silky or like silk in texture, sheen, or softness.","zh":"丝绸般的；柔滑有光泽的（形容质地、光泽或触感像丝绸）。"},"examples":[{"en":"She wore a bombycinous scarf that caught the light as she moved.","zh":"她围着一条丝绸般有光泽的围巾，走动时泛着光。"},{"en":"The poem describes a bombycinous dusk, soft and smooth like fabric.","zh":"那首诗把黄昏写得像丝绸一样柔和顺滑。"}]}],"synonyms":["silky","silken","satin-like","smooth","lustrous"],"phonetic":"/bɑmˈbɪsənəs/","extraExplanation":["这个词非常少见，偏文学/修辞用法，常用于描写“光泽、柔软、细腻”的触感或视觉效果。日常英语里通常用 silky / silken / satin-like 更自然。","词源与拉丁语有关，来自与“蚕/丝”相关的词根（如 Bombyx 指“蚕”），所以 bombycinous 本义就带有“像丝一样”的联想。"]}
{"word":"Bombyliidae","summary":{"en":"Bombyliidae: the bee-fly family—fuzzy flies that often resemble bees and hover near flowers.","zh":"Bombyliidae：蜂虻科——外形常像蜜蜂、常在花边悬停的绒毛状蝇类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of flies known as bee flies; they are often fuzzy and may look like bees, and many species hover near flowers.","zh":"蜂虻科（一类被称为“蜂虻/蜂蝇”的苍蝇）；外形常带绒毛、像蜜蜂，许多种类会在花朵附近悬停。"},"examples":[{"en":"Bombyliidae are often seen hovering over flowers and sipping nectar.","zh":"蜂虻科的昆虫常常在花朵上方悬停，并吸食花蜜。"},{"en":"At first I thought it was a bee, but it was a bee fly in the family Bombyliidae.","zh":"我起初以为那是蜜蜂，但其实是蜂虻科的一种蜂虻。"}]}],"synonyms":["bee-fly family","bee flies"],"phonetic":"/ˌbɑm.bəˈlaɪ.ə.di/","extraExplanation":["“Bombyliidae”是昆虫分类学中的“科”名，英文常用俗名是“bee flies（蜂虻/蜂蝇）”。在科名用法中通常视为复数概念（指一个类群），但作主语时单复数在写作里都能见到：例如“The Bombyliidae are…”或“This family (Bombyliidae) is…”。","名称来源与词根：BOMBYL-与希腊语相关，常与“嗡嗡声/类似蜜蜂的感觉”联系；因此这种昆虫虽然是“蝇”，但常通过拟态（外形像蜜蜂）来减少被捕食。","生态上，成虫多访花取食花蜜与花粉；许多幼虫阶段为寄生或捕食性，常寄主于其他昆虫（如某些蜂类或甲虫幼虫），因此在自然生态系统中既可能参与传粉，也可能影响其他昆虫种群。"]}
{"word":"bombyliidae","summary":{"en":"Bombyliidae: the bee-fly family, a group of often fuzzy, bee-like flies.","zh":"Bombyliidae：虻科（蜂虻/蜂蝇），一类常毛茸茸、外形像蜜蜂的苍蝇类昆虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of flies known as bee flies; they are often fuzzy and bee-like, and many species hover while feeding on nectar.","zh":"（昆虫）虻科；俗称“蜂虻/蜂蝇（bee flies）”，外形常毛茸茸、像蜜蜂，许多种类会悬停取食花蜜。"},"examples":[{"en":"Bombyliidae are often seen hovering in front of flowers on sunny days.","zh":"晴天时，人们常能看到虻科昆虫在花前悬停。"},{"en":"The researcher photographed a Bombyliidae species because it mimics a bee’s fuzzy body.","zh":"研究者拍摄了一种虻科昆虫，因为它会拟态成蜜蜂那种毛茸茸的身体。"}]}],"synonyms":["bee flies","bee-fly family"],"phonetic":"/ˌbɑm.bəˈlɪ.iˌdi/","extraExplanation":["“Bombyliidae”是拉丁化的科名，常用于生物分类学与科学写作；日常英语里更常说“bee fly/bee flies（蜂虻/蜂蝇）”。","这类昆虫成虫多访花吸食花蜜，幼虫阶段有些种类会寄生或捕食其他昆虫（不同物种差异很大）。"]}
{"word":"bombylious","summary":{"en":"A very rare adjective meaning “bee-fly-like” or “bumblebee-like.”","zh":"一个非常罕用的形容词，表示“像蜂虻/像大黄蜂一样的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Resembling or relating to a bee fly (genus *Bombylius*) or a bumblebee-like insect.","zh":"（罕用）像蜂虻（*Bombylius* 属）或像大黄蜂般的昆虫；与其有关的。"},"examples":[{"en":"In the sunlight, the garden had a bombylious shimmer as bee flies hovered over the flowers.","zh":"在阳光下，花园里蜂虻在花上悬停，呈现出一种“蜂虻般”的闪动。"},{"en":"The artist added a bombylious figure—round, fuzzy, and quick—to the illustration.","zh":"画家在插画里加了一个“像蜂虻的”形象：圆滚滚、毛茸茸、动作很快。"}]}],"synonyms":["bee-fly-like","bumblebee-like","buzzing"],"phonetic":"/bɑmˈbɪliəs/","extraExplanation":["这个词非常少见，更多时候你会在生物学语境里见到 *Bombylius*（蜂虻属，英文常叫 bee fly）。","词根来自希腊语，和表示“嗡嗡声/像蜂一样”的词源有关，因此带有“像蜂类昆虫、毛茸茸、悬停飞行”的联想。写作时如果担心读者不认识，可改用更常见的表达：bee-fly-like / bumblebee-like / buzzing."]}
{"word":"Bombyx","summary":{"en":"Bombyx is a scientific genus name for moths, especially linked to the silkworm used to make silk.","zh":"Bombyx 是蛾类的一个科学属名，尤其常指与产丝有关的家蚕（Bombyx mori）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of moths that includes the domestic silkworm (Bombyx mori), known for producing silk.","zh":"一种蛾类的属名（家蚕/家蚕蛾即为其中之一：Bombyx mori），以能产丝而闻名。"},"examples":[{"en":"Bombyx mori has been raised by humans for thousands of years to produce silk.","zh":"人类饲养家蚕（Bombyx mori）已有数千年历史，用来生产丝绸。"},{"en":"In biology class, we learned that Bombyx is the genus name, while mori is the species name.","zh":"在生物课上，我们学到 Bombyx 是属名，而 mori 是种名。"}]}],"synonyms":["silkworm moth (general term)","Bombyx mori (a specific species)"],"phonetic":"/ˈbɑm.bɪks/","extraExplanation":["“Bombyx”来自希腊语，原意与“丝/丝织品”相关，因此常与“蚕、丝绸”联系在一起。","在英文科普或学术写作中，属名 Bombyx 常与种加词一起出现，如 Bombyx mori（家蚕）。书写时通常用斜体，属名首字母大写。"]}
{"word":"bombyx","summary":{"en":"Bombyx is the scientific genus name for silk moths, especially the domesticated silkworm (Bombyx mori).","zh":"Bombyx 是蚕蛾属的学名，尤其指家蚕/桑蚕（Bombyx mori），与丝绸生产密切相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of moths best known for the domesticated silkworm, which produces silk","zh":"蚕蛾属（最有名的是家蚕/桑蚕，即产丝的蚕）"},"examples":[{"en":"Bombyx mori is the species used to make most commercial silk.","zh":"Bombyx mori（家蚕/桑蚕）是生产大多数商业丝绸的物种。"},{"en":"In biology class, we learned that Bombyx is closely linked to the history of silk production.","zh":"在生物课上，我们了解到 Bombyx 与丝绸生产的历史密切相关。"}]}],"synonyms":["silk moth (general)","silkworm (for Bombyx mori)"],"phonetic":"/ˈbɑm.bɪks/","extraExplanation":["“Bombyx”常出现在学术/科普语境中，尤其是拉丁学名“Bombyx mori”（家蚕、桑蚕）。日常英语里更常说“silkworm”（蚕）或“silk moth”（蚕蛾）。","词源来自希腊语 *bombux*，与“丝、蚕茧/蚕”相关。英语里这一类属名通常首字母大写（Bombyx），斜体书写。"]}
{"word":"bombyxes","summary":{"en":"“Bombyxes” means members of the moth genus Bombyx (especially silkworm moths), in plural form.","zh":"“Bombyxes”是 Bombyx（蚕蛾属） 的复数，常指与养蚕产丝相关的蚕蛾。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of Bombyx: a genus of moths, especially the domesticated silkworm moth (Bombyx mori) used to produce silk.","zh":"Bombyx 的复数：指一种飞蛾属，尤指家蚕蛾（Bombyx mori），用来产丝。"},"examples":[{"en":"In the lab, students observed bombyxes at different stages of the life cycle.","zh":"在实验室里，学生观察了不同生命周期阶段的 Bombyx（蚕蛾属昆虫）。"},{"en":"Silk production traditionally depends on domesticated bombyxes.","zh":"传统的丝绸生产依赖家养的 Bombyx（家蚕蛾）。"}]}],"synonyms":["silkworm moths","silkworms (common term)","Bombyx moths"],"phonetic":"/ˈbɑm.bɪks.ɪz/","extraExplanation":["“Bombyx”源自希腊语 *bombux*，与“丝/蚕”相关；在英文里常见于生物学、昆虫学与丝绸生产的语境。","日常英语里更常用的词是 **silkworm**（蚕）或 **silkworm moth**（蚕蛾）；“bombyxes”属于较学术的复数表达。"]}
{"word":"BOMFOG","summary":{"en":"“BOMFOG” is not a standard English word; it’s likely an acronym or code that needs context to interpret.","zh":"“BOMFOG”不是标准英语单词；更可能是缩写或代号，需要上下文才能解释。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; usually seen as an acronym, username, code, or a misspelling in specific communities. The meaning depends on context.","zh":"不是标准英语单词；通常作为缩写、用户名、代号或拼写错误出现在特定场景中，具体含义需结合上下文判断。"},"examples":[{"en":"I saw “BOMFOG” in the chat, but it wasn’t clear what it stood for.","zh":"我在聊天里看到“BOMFOG”，但不清楚它代表什么。"},{"en":"Could you share the sentence or where you found “BOMFOG”? That would help identify its meaning.","zh":"你能提供包含“BOMFOG”的句子或来源吗？这样更容易判断它的意思。"}]}],"phonetic":"/ˈbiː oʊ ɛm ɛf oʊ dʒiː/","extraExplanation":["“BOMFOG”更像是“首字母缩写（acronym）/缩略语（abbreviation）”或某个圈子里的代号。由于它不属于常见词典词条，我无法在不猜测的情况下给出唯一、可靠的释义。","如果你把它出现的场景发我（例如一整句、平台/游戏/课程/文件名、是否全大写、是否和其他词连用），我可以帮你推断最可能的展开形式和含义。"]}
{"word":"bomi","summary":{"en":"“Bomi” is usually a proper noun—most often a personal name, and sometimes a place name (e.g., Bomi County in Liberia).","zh":"“Bomi”通常是专有名词——最常见是人名，有时也是地名（如利比里亚的博米县）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A personal name (used in several cultures; most commonly seen as a Korean given name).","zh":"人名（在多种文化中使用；最常见的是韩语名字）。"},"examples":[{"en":"Bomi is a common given name in Korea, and it can be written in different hanja (Chinese characters) depending on the meaning.","zh":"Bomi 在韩国是常见的名字，并且可以用不同的汉字来书写，含义也会随之变化。"},{"en":"I met someone named Bomi at the language exchange.","zh":"我在语言交换活动中认识了一个叫 Bomi 的人。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name (proper noun), used for some locations (for example, Bomi County in Liberia).","zh":"地名（专有名词），用于一些地点（例如利比里亚的博米县 Bomi County）。"},"examples":[{"en":"Bomi County is one of the counties in Liberia.","zh":"Bomi County（博米县）是利比里亚的一个县。"},{"en":"They worked on a public health project in Bomi.","zh":"他们在博米地区做了一个公共卫生项目。"}]}],"synonyms":["(name)","(proper noun)"],"phonetic":"/ˈboʊmi/","extraExplanation":["“Bomi”在英文里通常不是普通词汇，而是专有名词（人名或地名）。如果你是在某个具体语境（例如韩剧人物、K-pop艺名、地理名词、缩写）看到它，我可以根据上下文帮你确认最准确的含义与用法。","韩语名字“Bomi”常被解释为与“春天/看见/美”等意象相关，但具体含义取决于所选汉字；没有汉字信息时，英文里一般把它当作音译姓名来使用。"]}
{"word":"Bomke","summary":{"en":"“Bomke” is mainly used as a surname (a proper name), not a standard English word.","zh":"“Bomke”主要用作姓氏（专有名词），不是常见的英语单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname), most often seen as a German-origin last name; not a common English vocabulary word.","zh":"一个姓氏（常见于德语/德国来源的姓），不是常见的英语词汇。"},"examples":[{"en":"Dr. Bomke will speak at the conference today.","zh":"Bomke 博士今天将在会议上发言。"},{"en":"Her last name is Bomke, spelled B-O-M-K-E.","zh":"她的姓是 Bomke，拼作 B-O-M-K-E。"}]}],"phonetic":"/ˈbɑmki/","extraExplanation":["“Bomke”通常作为专有名词使用，因此英语里一般要首字母大写（Bomke）。","发音在英语语境中常被读作“BOM-kee”（重音在前一部分），但具体读音可能会因家族/地区而不同；如果你指的是某位特定人物或品牌，读音可能需要以当事人/官方为准。","如果你是在问某个特定的“Bomke”（例如公司名、地名、作品名），告诉我上下文（在哪看到的、属于什么领域），我可以给出更准确的解释。"]}
{"word":"Bomont","summary":{"en":"“Bomont” is a proper name, often encountered in Turkish-related contexts tied to the historic Bomonti brewery/brand or associated place names.","zh":"“Bomont”是专有名词，常见于与土耳其相关的语境，多与历史上的 Bomonti 啤酒厂/品牌或相关地名有关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (surname or brand/place name). In modern usage it is most often seen in Turkish contexts connected to the historic Bomonti brewery and related names (e.g., “Bomonti” beer or the Bomonti neighborhood in Istanbul).","zh":"专有名词（姓氏，或品牌/地名）。现代用法中更常见于土耳其语境，和历史上的 Bomonti 啤酒厂及相关名称有关（如“Bomonti”啤酒或伊斯坦布尔的 Bomonti 社区）。"},"examples":[{"en":"I tried Bomonti beer, which is linked to the old Bomonti brewery name.","zh":"我喝过 Bomonti 啤酒，它和旧时的 Bomonti 啤酒厂名称有关。"},{"en":"Some cafes in Istanbul are located around the Bomonti area, a name connected to the Bomont/Bomonti family.","zh":"伊斯坦布尔有些咖啡馆在 Bomonti 一带，这个名字与 Bomont/Bomonti 家族有关。"}]}],"phonetic":"/boʊˈmɑːnt/","extraExplanation":["“Bomont / Bomonti”常被认为与19世纪末在奥斯曼帝国（今土耳其）经营啤酒厂的兄弟有关（常见说法为来自瑞士/法国背景的 Bomonti 兄弟）。后来“Bomonti”成为伊斯坦布尔一处街区与啤酒品牌的名称，因此在英语材料里你可能会把它当作品牌名或地名来理解。","如果你是在某篇文章、地图、品牌包装或人名列表里看到“Bomont”，把原句/上下文发我，我可以更准确判断它指的是人名、地名还是品牌。"]}
{"word":"bomos","summary":{"en":"“Bomos” isn’t a standard English word; it’s likely a typo or an acronym. Share the context sentence for an exact meaning.","zh":"“bomos”不是标准英语词，通常是拼写错误或缩写。把上下文句子发来可确定准确含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. In most cases, “bomos” is a misspelling or typing error (for example, people may mean “bombs,” “BOMs” = bills of materials, or Spanish “bombos” = drums).","zh":"不是标准英语单词。多数情况下，“bomos”是拼写或输入错误（例如可能想写“bombs（炸弹）”、 “BOMs（物料清单）”，或西班牙语“bombos（大鼓/鼓）”。"},"examples":[{"en":"I can’t find “bomos” in an English dictionary—did you mean “bombs” or “BOMs”?","zh":"我在英语词典里找不到“bomos”——你是想写“bombs”还是“BOMs”吗？"},{"en":"If you tell me the sentence you saw it in, I can help identify the correct word.","zh":"如果你把它出现的句子发给我，我可以帮你判断到底是哪一个词。"}]}],"phonetic":"/ˈboʊmoʊz/","extraExplanation":["在英语学习里，遇到词典查不到的“单词”，最常见的原因是：拼写错误、缩写/首字母词（acronym）、人名/地名、或来自其他语言（如西班牙语）的外来词。","如果你提供：1）它出现的完整句子；2）它来自哪里（游戏、聊天、技术文档等）；3）是否需要大写（BOMOS vs bomos），我就能更准确地给出释义与用法。"]}
{"word":"Bomoseen","summary":{"en":"Bomoseen is a Vermont place name, best known for Lake Bomoseen.","zh":"Bomoseen 是佛蒙特州的地名，最有名的是博莫辛湖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name in Vermont, USA; most commonly refers to Lake Bomoseen and the nearby village/area in Rutland County.","zh":"美国佛蒙特州的地名；最常指博莫辛湖（Lake Bomoseen）及其附近的村落/地区（位于拉特兰县一带）。"},"examples":[{"en":"We spent the weekend swimming at Lake Bomoseen.","zh":"我们周末在博莫辛湖游泳。"},{"en":"Bomoseen is a quiet area that gets busier in summer.","zh":"博莫辛是个安静的地方，但夏天会热闹一些。"}]}],"phonetic":"/ˌboʊməˈsiːn/","extraExplanation":["“Bomoseen”主要作为专有名词使用（地名），在日常英语里通常不会当作普通词汇。","常见搭配：Lake Bomoseen（博莫辛湖）、Bomoseen State Park（博莫辛州立公园）。","此类新英格兰地区地名常源自美洲原住民语言（如阿尔冈昆语系/阿贝纳基相关语言）的音译；具体词源在不同资料中可能有差异。"]}
{"word":"Bomu","summary":{"en":"“Bomu” is usually the romanized Japanese form of ボム, meaning “bomb,” mainly seen in gaming/anime contexts; otherwise it may be a proper name.","zh":"“Bomu”多半是日语ボム的罗马音，意为“炸弹”，常见于游戏/动漫语境；也可能只是人名/地名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A romanized Japanese loanword (ボム, bomu) meaning “bomb,” often used in gaming/anime contexts to refer to a bomb item or a special “bomb” attack.","zh":"日语外来词的罗马音（ボム，bomu），意思是“炸弹”，常见于游戏/动漫语境中，指炸弹道具或“炸弹”类的特殊攻击。"},"examples":[{"en":"In some Japanese games, players say “use a bomu” to mean “use a bomb item.”","zh":"在一些日系游戏里，玩家会说“use a bomu”，意思是“使用炸弹道具”。"},{"en":"The character activated a bomu and cleared the screen.","zh":"角色发动了“bomu”（炸弹技），清掉了满屏敌人。"}]},{"partOfSpeech":"other","definition":{"en":"A personal or place name in some languages (a proper noun), not a standard English vocabulary word by itself.","zh":"在某些语言中可能是人名或地名（专有名词），本身并不是标准英语词汇。"},"examples":[{"en":"Bomu is the name of the artist credited on the poster.","zh":"海报上署名的艺术家叫 Bomu。"},{"en":"They traveled through Bomu during their trip.","zh":"他们旅行时经过了 Bomu 这个地方。"}]}],"synonyms":["bomb"],"phonetic":"/ˈboʊ.muː/","extraExplanation":["“bomu（ボム）”来自英语 bomb 的日语音译：英语 /bɑːm/（美式常读 /bɑːm/ 或 /bɑːmb/ 的拼写影响），进入日语后变成两拍左右的发音（bo-mu）。在英文语境里通常直接说 “bomb”，只有在强调日系作品风格、引用原作术语、或玩家圈子里才会见到 “bomu”。","如果你是在某个具体作品、歌词、游戏道具说明里看到 Bomu，告诉我上下文句子，我可以帮你判断是“炸弹”的用法还是人名/地名。"]}

