{"word":"BOP","summary":{"en":"“Bop” can mean a catchy, upbeat song; bebop-style jazz; to dance/move to music; or to hit lightly. “BOP” is also a common abbreviation for “Balance of Payments.”","zh":"“bop” 可指节奏明快的好听歌曲、（bebop）比博普爵士、随音乐摇摆跳舞，或轻轻敲/打；“BOP” 也常作“国际收支（Balance of Payments）”的缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lively, rhythmic popular song (often used in titles, reviews, or casual speech).","zh":"一首节奏明快、适合跟着摇摆的流行歌曲（常见于口语或乐评中）。"},"examples":[{"en":"That new track is a total bop—I can’t stop replaying it.","zh":"那首新歌简直太上头了，我一直循环播放。"},{"en":"Her latest single is a bop with a catchy chorus.","zh":"她最新的单曲节奏很带感，副歌很洗脑。"}]},{"partOfSpeech":"n.","definition":{"en":"a style of jazz (bebop) and the jazz scene associated with it, especially in the mid-20th century.","zh":"（bebop 的简称）比博普爵士乐；也可指相关的爵士乐圈子（尤指20世纪中期）。"},"examples":[{"en":"He got into bop after listening to Charlie Parker.","zh":"他听了查理·帕克之后开始迷上比博普。"},{"en":"The club was known for late-night bop sessions.","zh":"那家俱乐部以深夜比博普即兴演奏闻名。"}]},{"partOfSpeech":"vi.","definition":{"en":"to dance or move in a lively way to music.","zh":"（随着音乐）欢快地跳舞/摇摆。"},"examples":[{"en":"Everyone was bopping along to the beat.","zh":"大家都跟着节拍一起摇摆。"},{"en":"They bopped around the kitchen while cooking.","zh":"他们做饭时在厨房里跟着音乐扭来扭去。"}]},{"partOfSpeech":"vt.","definition":{"en":"to hit someone or something lightly, often with a quick motion.","zh":"轻打；轻敲（通常是快速的一下）。"},"examples":[{"en":"He bopped me on the shoulder to get my attention.","zh":"他轻拍了我的肩膀引起我的注意。"},{"en":"The ball bopped him on the nose.","zh":"球轻轻撞到了他的鼻子。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Balance of Payments” in economics (often written as BOP).","zh":"（经济学）“国际收支”的缩写（常写作 BOP）。"},"examples":[{"en":"The report discusses the country’s BOP deficit.","zh":"报告讨论了该国的国际收支逆差。"},{"en":"Oil prices can affect the BOP through import costs.","zh":"油价会通过进口成本影响国际收支。"}]}],"synonyms":["catchy song","tune","track","bebop","dance","groove","tap","bonk"],"phonetic":"/bɑp/","extraExplanation":["“a bop” 作为“很好听/很带感的一首歌”的用法，在当代英语口语、社交媒体与流行乐评论中非常常见，语气偏随意、正面。","“bop” 在爵士语境里常指 “bebop”（比博普），是一种节奏复杂、即兴成分很强的爵士风格，常与 1940–50 年代的美国爵士发展相关。","大写 “BOP” 更常被理解为缩写（如 Balance of Payments）。在正式写作里，遇到大写缩写通常需要结合上下文判断。"]}
{"word":"Bop","summary":{"en":"“Bop” is an informal word meaning a catchy, upbeat song; it can also mean to lightly hit/bump something or to move rhythmically to music.","zh":"“bop”是非正式用语：可指一首很带感的好听歌曲；也可指轻轻地碰/打一下，或随着音乐有节奏地摇摆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A lively beat or song that’s fun to listen to and makes you want to move.","zh":"（非正式）节奏感很强、很好听、让人想跟着动起来的歌（或旋律）。"},"examples":[{"en":"This song is such a bop—I can’t stop listening to it.","zh":"这首歌太“上头”了，我停不下来一直听。"},{"en":"They played a few summer bops at the party.","zh":"派对上放了几首很适合夏天的动感歌。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal) To hit something lightly and quickly, often by accident or in a casual way.","zh":"（非正式）轻轻地、快速地碰一下/打一下（常常是无意或随意的）。"},"examples":[{"en":"I bopped my head on the low doorway.","zh":"我不小心把头撞到低门框上了。"},{"en":"She bopped him on the arm to get his attention.","zh":"她轻轻拍了拍他的胳膊引起注意。"}]},{"partOfSpeech":"vi.","definition":{"en":"(informal) To move or dance with small, rhythmic motions, especially to music.","zh":"（非正式）随着音乐小幅度、有节奏地动/跳（点头、摇摆等）。"},"examples":[{"en":"Everyone was bopping along to the music.","zh":"大家都跟着音乐摇摆点头。"},{"en":"He bopped around the kitchen while cooking.","zh":"他做饭时在厨房里跟着节奏小步扭动。"}]}],"synonyms":["catchy song","hit (song)","jam","bump","tap"],"phonetic":"/bɑp/","extraExplanation":["作为名词的“bop”在当代口语里很常见，尤其在社交媒体上，表示“特别好听、很带感的一首歌”。更早时“bebop（比博普）”是20世纪40年代的爵士乐流派名称，“bop”也与那种快节奏、强律动的音乐氛围有关。","注意区分：名词“a bop”多指“好听的歌”；动词“to bop”多指“轻轻撞/打一下”或“跟着音乐点头摇摆”。语气都偏口语、轻松。"]}
{"word":"bop","summary":{"en":"“Bop” can mean to hit/tap lightly, to dance to upbeat music, a light hit, a catchy song (slang), or bebop jazz.","zh":"“bop”可指轻轻打/敲，随动感音乐跳舞，一下轻击；也可指“很上头的歌”（俚语）或波普爵士（bebop）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to hit or tap someone or something, often lightly","zh":"（常指轻轻地）打一下、敲一下"},"examples":[{"en":"He bopped me on the shoulder to get my attention.","zh":"他轻轻拍了拍我的肩膀来引起我的注意。"},{"en":"Be careful—don’t bop your head on the shelf.","zh":"小心点——别把头撞到架子上。"}]},{"partOfSpeech":"vi.","definition":{"en":"to dance, especially to pop/hip-hop or upbeat music (informal)","zh":"（非正式）随着（动感）音乐跳舞"},"examples":[{"en":"Everyone was bopping to the music at the party.","zh":"派对上大家都随着音乐摇摆跳舞。"},{"en":"She started bopping in her seat when her favorite song came on.","zh":"她最喜欢的歌一响起，就在座位上跟着节奏扭动起来。"}]},{"partOfSpeech":"n.","definition":{"en":"a light hit or tap","zh":"轻轻的一击；轻拍"},"examples":[{"en":"He gave the ball a gentle bop and it rolled forward.","zh":"他轻轻一碰球，球就向前滚了。"}]},{"partOfSpeech":"n.","definition":{"en":"a song that is very catchy and enjoyable (informal)","zh":"（非正式）很好听、很上头的一首歌"},"examples":[{"en":"This new track is a total bop.","zh":"这首新歌真的太上头了。"},{"en":"I need a feel-good bop for my workout playlist.","zh":"我需要一首让人心情变好的动感歌曲放进健身歌单。"}]},{"partOfSpeech":"n.","definition":{"en":"a style of jazz called bebop; also music in that style","zh":"波普爵士（bebop）；该风格的音乐"},"examples":[{"en":"They played bop with fast, complex melodies.","zh":"他们演奏的是节奏快、旋律复杂的波普爵士。"}]}],"synonyms":["hit","tap","bonk","dance","groove","catchy song","tune"],"phonetic":"/bɑp/","extraExplanation":["“a bop”（一首很棒/很上头的歌）是近年流行语，常见于社交媒体与口语，语气偏轻松；正式写作中更常用 “catchy song / great track”。","爵士乐里的“bop”通常是“bebop”的简称，兴起于20世纪40年代，特点是速度快、即兴复杂，代表人物包括 Charlie Parker 和 Dizzy Gillespie。"]}
{"word":"Bopeep","summary":{"en":"Bo-Peep (Little Bo-Peep) is a well-known nursery-rhyme shepherdess; by extension it can mean a Bo-Peep-style shepherdess, and in the old phrase “play bo-peep” it means to play peekaboo.","zh":"Bo-Peep（Little Bo-Peep）是著名英国童谣里的小牧羊女；引申可指“波·皮普式”的牧羊女形象；旧式短语 play bo-peep 指玩类似 peekaboo 的躲猫猫游戏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often “Little Bo-Peep”) a famous character in an English nursery rhyme: a young shepherdess who loses her sheep.","zh":"（常作 Little Bo-Peep）英国传统童谣中的著名人物：一位丢了羊的小牧羊女。"},"examples":[{"en":"My niece loves the nursery rhyme “Little Bo-Peep.”","zh":"我外甥女很喜欢童谣《小牧羊女波·皮普》。"},{"en":"The costume looks like Little Bo-Peep, with a bonnet and a shepherd’s crook.","zh":"这套服装看起来像“小牧羊女波·皮普”，有帽子和牧羊杖。"}]},{"partOfSpeech":"n.","definition":{"en":"a shepherdess character type (used in stories, costumes, or descriptions) inspired by the nursery rhyme.","zh":"（引申）受该童谣影响的“牧羊女”形象（用于故事、装扮或描写）。"},"examples":[{"en":"She dressed up as a Bo-Peep-style shepherdess for the play.","zh":"她在戏里打扮成“波·皮普”风格的牧羊女。"}]},{"partOfSpeech":"phrase","definition":{"en":"(old-fashioned, in “play bo-peep”) to play a hiding-and-showing game like peekaboo, often with a baby.","zh":"（旧式用法，见 play bo-peep）玩“躲猫猫/躲一下再出现”的游戏，类似 peekaboo（常和婴儿玩）。"},"examples":[{"en":"The dad played bo-peep with the baby behind the curtain.","zh":"爸爸躲在窗帘后面和宝宝玩“躲一下再出现”的游戏。"}]}],"synonyms":["Little Bo-Peep","shepherdess","peekaboo (for “play bo-peep”)"],"phonetic":"/ˈboʊ ˌpiːp/","extraExplanation":["“Little Bo-Peep”是英语世界很经典的童谣形象。童谣里她“丢了羊”，被劝“先别找，让它们自己回来”（并提到羊尾巴可能被卡在篱笆上）。因此在英美文化中，Bo-Peep常让人联想到“天真、童话式的牧羊女”形象。","在现代流行文化中，这个名字也常被借用（例如玩具与动画角色的命名），所以你可能在儿歌以外的语境里看到 Bo Peep。"]}
{"word":"bopeep","summary":{"en":"Bo Peep most commonly refers to the nursery-rhyme character “Little Bo-Peep,” and by extension a shepherdess-style figure or the Toy Story character.","zh":"Bo Peep 最常指童谣角色“小波·皮普（Little Bo-Peep）”，也可泛指牧羊女形象，或指《玩具总动员》中的同名角色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Little Bo-Peep: a famous character in an English nursery rhyme, a young shepherdess who loses her sheep and is told to “leave them alone and they’ll come home.”","zh":"小波·皮普（Little Bo-Peep）：英文童谣中的著名角色，一位小牧羊女弄丢了羊，被告知“别去管它们，它们会自己回家”。"},"examples":[{"en":"My niece loves the nursery rhyme “Little Bo-Peep.”","zh":"我外甥女很喜欢童谣《Little Bo-Peep》。"},{"en":"The story of Bo-Peep is often used to talk about someone who has “lost” something important.","zh":"Bo-Peep 的故事常被用来比喻某人“弄丢了”重要的东西。"}]},{"partOfSpeech":"n.","definition":{"en":"Bo Peep: a popular name for a shepherdess-style figure or costume, especially in children’s stories or events (often inspired by the nursery rhyme).","zh":"Bo Peep：常用来指“牧羊女”风格的人物形象或服装，尤其在儿童故事、活动中（多受童谣形象影响）。"},"examples":[{"en":"She dressed up as Bo Peep for the school play.","zh":"她在学校话剧里扮演/装扮成 Bo Peep。"}]},{"partOfSpeech":"n.","definition":{"en":"Bo Peep: the name of a character in Pixar’s Toy Story films (a porcelain shepherdess), based on the nursery-rhyme figure.","zh":"Bo Peep：《玩具总动员》系列中的角色名（瓷制牧羊女玩具），形象来源于童谣人物。"},"examples":[{"en":"Bo Peep appears in several Toy Story movies.","zh":"Bo Peep 在几部《玩具总动员》电影里都有出现。"}]}],"synonyms":["Little Bo-Peep","shepherdess","nursery-rhyme character"],"phonetic":"/boʊ pip/","extraExplanation":["“Bo-peep”在早期英语里也曾用来指一种“捉迷藏/躲猫猫”式的儿童游戏，类似现在的 peekaboo（躲猫猫）。不过现代最常见的联想还是童谣角色 Little Bo-Peep。","童谣《Little Bo-Peep》常被用来传达一种安慰式的想法：有些事情越追越乱，先放下反而会自然好转。"]}
{"word":"Bophuthatswana","summary":{"en":"Bophuthatswana: a former apartheid-era “homeland” for Tswana people in South Africa (1977–1994).","zh":"博普塔茨瓦纳：南非种族隔离时期为茨瓦纳人设立的前“家园/班图斯坦”（1977—1994）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former self-governing “homeland” (Bantustan) created under apartheid in South Africa, intended for Tswana-speaking people; it existed from 1977 to 1994 and was later reabsorbed into South Africa (mainly into today’s North West province).","zh":"博普塔茨瓦纳：南非种族隔离时期设立的前“班图斯坦/家园”（名义上的自治地区），主要面向讲茨瓦纳语的人群；1977—1994年存在，后并入南非（主要归入今西北省）。"},"examples":[{"en":"Bophuthatswana was one of several “homelands” established during apartheid.","zh":"博普塔茨瓦纳是种族隔离时期建立的若干“家园”之一。"},{"en":"After 1994, the territory of Bophuthatswana was reintegrated into South Africa.","zh":"1994年之后，博普塔茨瓦纳的领土重新并入南非。"}]}],"synonyms":["Bophuthatswana homeland","Bantustan (historical context)"],"phonetic":"/boʊˌpʊtɑːtˈswɑːnə/","extraExplanation":["“Bophuthatswana”常被中文译作“博普塔茨瓦纳”。它曾被南非白人政权宣布为“独立国家”，但国际社会普遍不承认，这一安排被广泛视为种族隔离政策的一部分，用来剥夺黑人公民权并进行族群隔离。","词源上与“Tswana（茨瓦纳）”相关；在阅读历史或新闻文本时，它通常出现在讨论“apartheid（种族隔离）”“Bantustan/ homeland（班图斯坦/家园）”“reintegration（重新并入）”等主题的语境中。"]}
{"word":"Bopp","summary":{"en":"“Bopp” is most commonly a proper name, especially the linguist Franz Bopp, or it can simply be a family name.","zh":"“Bopp”最常见是专有名词（尤其指语言学家弗朗茨·博普），也可作为姓氏使用。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper name) Franz Bopp (1791–1867), a German linguist often called a founder of comparative Indo-European linguistics.","zh":"（专有名词）弗朗茨·博普（1791–1867），德国语言学家，常被认为是印欧语比较语言学的奠基人物之一。"},"examples":[{"en":"Franz Bopp helped show systematic connections among Indo-European languages.","zh":"弗朗茨·博普帮助人们证明了印欧语系语言之间存在系统性的联系。"},{"en":"In many textbooks, Bopp is mentioned alongside scholars like Rask and Grimm.","zh":"在许多教材中，博普常与拉斯克和格林等学者一起被提及。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname (family name).","zh":"一个姓氏（家族姓）。"},"examples":[{"en":"Dr. Bopp will present the research at the conference.","zh":"博普博士将会在会议上展示这项研究。"}]}],"synonyms":["(as a surname) —"],"phonetic":"/bɑp/","extraExplanation":["“Bopp”最常见的文化语境来自语言学史：他以比较法研究梵语、拉丁语、希腊语、德语等语言的词形变化与语法结构，推动了“语言有亲缘关系、变化有规律”的观点。你如果是在语言学或历史语言学课本里看到这个词，通常指的就是这位学者。","拼写上要注意：Bopp（双 p）是专名；而“bop”（单 p）是常见英文词，意思更偏口语，如“轻敲”“（随音乐）跳舞/点头”等。"]}
{"word":"bopped","summary":{"en":"“Bopped” is the past tense of “bop,” meaning either a light hit or dancing/moving to a rhythm (informal).","zh":"“bopped”是“bop”的过去式，可表示“轻轻敲/打一下”，也可表示“随节奏跳舞或摇摆”（非正式）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “bop”: to hit someone or something lightly (often on the head), usually in a quick, casual way.","zh":"“bop”的过去式/过去分词：轻轻地、快速地击打（常指敲一下头），语气较随意。"},"examples":[{"en":"He bopped his little brother on the head with a pillow.","zh":"他用枕头轻轻敲了弟弟一下头。"},{"en":"I bopped the table to get everyone’s attention.","zh":"我轻敲桌子来吸引大家注意。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “bop”: to dance or move with a lively rhythm (informal).","zh":"“bop”的过去式/过去分词：跟着节奏轻快地跳舞或摇摆（非正式）。"},"examples":[{"en":"They bopped around to the music at the party.","zh":"他们在派对上跟着音乐轻快地跳来跳去。"},{"en":"She bopped her head to the beat while studying.","zh":"她学习时随着节拍点头摇摆。"}]}],"synonyms":["hit","tap","bonk","dance","groove","bob"],"phonetic":"/bɑpt/","extraExplanation":["“bop”在口语里很常见：既可以指“轻敲一下”，也可以指“随着音乐摇摆/跳舞”。语境通常能帮助判断意思。","在美式英语里，“bop”也可指一种爵士乐风格（bebop 的简称），但“bopped”更多还是作为动词的过去式出现。"]}
{"word":"bopper","summary":{"en":"“Bopper” usually means a young person into lively pop music/dancing (especially in mid-20th-century youth culture). It can also mean someone who hits, or a small club/baton.","zh":"“bopper”通常指爱听节奏明快的流行音乐、爱跳舞的年轻人（多与20世纪中期青年文化相关）；也可指打人者或短棍/警棍。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang) A young person, especially one who enjoys lively pop music and dancing (often linked to 1950s–1960s youth culture).","zh":"（俚语）年轻人；尤指喜欢热闹流行音乐、跳舞的人（常与20世纪50—60年代的青年文化相关）。"},"examples":[{"en":"My grandpa said he was a bopper who went dancing every weekend.","zh":"我爷爷说他年轻时是个 bopper，每个周末都去跳舞。"},{"en":"The movie shows boppers in bright clothes at a crowded dance hall.","zh":"电影里展现了一群穿着鲜艳的 boppers 在拥挤的舞厅里跳舞。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who hits or strikes something; in some contexts, a small club/baton used for hitting.","zh":"打人者；（在某些语境中）用来敲打的小棍、警棍。"},"examples":[{"en":"The toy bopper makes a funny sound when you tap it.","zh":"这个玩具小棒（bopper）一敲就会发出滑稽的声音。"},{"en":"In old crime stories, a thief might carry a bopper.","zh":"在老派犯罪故事里，小偷可能会带一根短棍（bopper）。"}]}],"synonyms":["dancer","teen","youth","club","baton"],"phonetic":"/ˈbɑpɚ/","extraExplanation":["“bopper”常与“bop”有关：bop原本可指一种节奏强的音乐/舞蹈（也让人联想到jazz里的bebop），所以bopper可用来指爱听这种音乐、爱跳舞的年轻人。","在英国语境里，Bopper也可能指20世纪50年代末到60年代初的一种青年亚文化（服装、发型、舞厅文化等），用法带有怀旧色彩。","第二个义项（短棍/打人的人）更偏口语或特定语境；实际交流中更常见的是“bopper = 爱跳舞、爱流行音乐的年轻人”。"]}
{"word":"boppers","summary":{"en":"“Boppers” most commonly means people associated with lively bop/early rock ’n’ roll dancing and youth culture; more generally, it can mean people who bop (move/dance energetically), and in boxing it can refer to quick light punches.","zh":"“boppers”最常指与活泼的bop/早期摇滚舞蹈及其青年文化相关的人；更泛指轻快走动或跳舞的人；在拳击语境中也可指轻快的短拳。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) People who like or take part in a lively style of music and dancing, especially 1950s–1960s “bop”/early rock ’n’ roll youth culture.","zh":"（复数）指喜欢或参与一种活泼音乐与舞蹈风格的人，尤指20世纪50–60年代与“bop/早期摇滚”相关的青年文化群体。"},"examples":[{"en":"At the retro dance night, the boppers filled the floor in leather jackets and bright skirts.","zh":"在复古舞会之夜，穿着皮夹克和彩色裙子的boppers把舞池挤满了。"},{"en":"The movie shows boppers hanging out at diners and listening to fast music.","zh":"电影里，boppers在小餐馆聚会，听节奏很快的音乐。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) People who bop—move, dance, or go around in a light, energetic way.","zh":"（非正式）指“bop”的人：轻快地走动、跳舞或到处活动的人。"},"examples":[{"en":"A few boppers were dancing by the stage even before the singer came out.","zh":"歌手还没上场，就有几个boppers在舞台旁跳起来了。"},{"en":"We were happy boppers, wandering from booth to booth at the street fair.","zh":"我们兴致勃勃地在人行集市的摊位间逛来逛去。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, boxing) Quick, light punches; people known for throwing these punches.","zh":"（非正式，拳击）轻快的短拳；也可指以这种短拳著称的人。"},"examples":[{"en":"The coach told him to use boppers to set up a stronger punch.","zh":"教练让他先用轻快的短拳铺垫，再打更重的一拳。"}]}],"synonyms":["dancers","rock ’n’ roll fans","club-goers","movers","light punchers"],"phonetic":"/ˈbɑpɚ/","extraExplanation":["“bopper”与动词“bop”（轻快地跳舞/走动）有关。英国语境里，20世纪50年代末到60年代初常把喜欢摇滚、穿时髦服装、爱跳舞的年轻人叫作boppers（类似一种青年亚文化称呼）。在不同地区，这个词的“年代感”强，用于复古或怀旧场景更常见。"]}
{"word":"bopping","summary":{"en":"“Bopping” usually means dancing or moving around in a lively, casual way; in slang it can describe a song as catchy and fun.","zh":"“bopping”通常指活力地跳舞或轻松地到处走走；作俚语时也可形容歌曲“很带感、很抓耳”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “bop”) dancing in a lively way, often to pop/hip-hop music.","zh":"（动词 bop 的现在分词）跟着音乐活力十足地跳舞，常指随流行/嘻哈音乐摇摆起舞。"},"examples":[{"en":"Everyone was bopping to the beat at the club.","zh":"大家在夜店里都跟着节拍跳得很嗨。"},{"en":"She put on her headphones and started bopping around the room.","zh":"她戴上耳机，在房间里跟着音乐摇摆起来。"}]},{"partOfSpeech":"v.","definition":{"en":"moving along in a casual, lighthearted way; going somewhere briefly (informal).","zh":"（非正式）轻松地到处走走；顺路/短暂地去某个地方。"},"examples":[{"en":"I’m just bopping over to the store—want anything?","zh":"我就顺路去趟商店，你要带什么吗？"},{"en":"We spent the afternoon bopping around downtown.","zh":"我们一下午都在市中心随便逛逛。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal) hitting or tapping something lightly.","zh":"（非正式）轻轻敲打；轻轻碰一下。"},"examples":[{"en":"He kept bopping the table with his pen while thinking.","zh":"他一边思考一边用笔轻轻敲桌子。"},{"en":"The ball bopped him on the head, but he wasn’t hurt.","zh":"球轻轻砸到他头上，但没受伤。"}]},{"partOfSpeech":"adj.","definition":{"en":"(slang, informal) very good, catchy, or fun—especially about a song or beat.","zh":"（俚语，非正式）很好听/很带感/很有趣（尤指歌曲或节奏）。"},"examples":[{"en":"This song is bopping—I can’t stop replaying it.","zh":"这首歌太上头了，我停不下来一直循环。"},{"en":"The beat is bopping, but the lyrics are simple.","zh":"节奏很带感，但歌词比较简单。"}]}],"synonyms":["dancing","grooving","moving around","hanging out","catchy","upbeat"],"phonetic":"/ˈbɑpɪŋ/","extraExplanation":["“Bop”最常见的联想是“跳舞/跟着节拍摇摆”，所以“bopping”在口语里经常指“随着音乐点头、摇身体”。","“This song is bopping”属于近年网络与口语中常见的说法，强调“很抓耳、很带劲”。在更正式的写作里可以改成“catchy / upbeat / great”。"]}
{"word":"boppist","summary":{"en":"A boppist is someone who is into bebop jazz—often a fan or performer.","zh":"boppist 指喜欢、演奏或支持波普爵士（bebop）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who likes, performs, or strongly supports bebop (a style of jazz).","zh":"波普爵士（bebop）的爱好者、演奏者或拥护者。"},"examples":[{"en":"He was a devoted boppist who collected Charlie Parker records.","zh":"他是个狂热的波普爵士迷，收藏了很多查理·帕克的唱片。"},{"en":"The club attracted boppists who wanted fast tempos and complex solos.","zh":"这家俱乐部吸引了喜欢快速节奏和复杂即兴独奏的波普爵士拥趸。"}]}],"synonyms":["bebop fan","bopper","bebop musician","jazz enthusiast"],"phonetic":"/ˈbɑpɪst/","extraExplanation":["“boppist”来自“bebop / bop”（一种20世纪40年代兴起的现代爵士风格）+ “-ist”（表示“从事者/支持者”的后缀，如 artist, pianist）。","“boppist”在现代英语里不算常用；更常见的说法是“bebop musician / bebop fan / bopper”。"]}
{"word":"bops","summary":{"en":"“Bops” most commonly means catchy, fun songs (informal). It can also be the third-person singular of “bop” (to dance/move or hit lightly).","zh":"“bops”最常见指（非正式）好听抓耳的歌曲；也可以是动词“bop”的第三人称单数（摇摆跳舞或轻轻碰/敲）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) Catchy, enjoyable songs—often pop or dance tracks (informal).","zh":"（复数名词，非正式）好听、抓耳的歌曲，常指流行或舞曲。"},"examples":[{"en":"This playlist is full of bops—I can’t stop listening.","zh":"这个歌单全是神曲/好歌，我停不下来。"},{"en":"She played a few summer bops at the party.","zh":"她在派对上放了几首夏日热歌。"}]},{"partOfSpeech":"v.","definition":{"en":"(third-person singular of “bop”) To dance, move, or hit lightly in a quick, rhythmic way.","zh":"（动词 bop 的第三人称单数）轻快地跳舞/摇摆；或轻轻地、快速地碰一下（敲一下）。"},"examples":[{"en":"He bops his head to the beat when he studies.","zh":"他学习时会跟着节拍点头摇摆。"},{"en":"The ball bops off the wall and rolls back.","zh":"球轻轻撞到墙上又滚了回来。"}]}],"synonyms":["catchy songs","hits","tunes","jams","bangers"],"phonetic":"/bɑps/","extraExplanation":["“a bop”在近年的网络英语里很常见，尤其在音乐圈，意思接近“神曲/很上头的歌”。常见搭配：This song is a bop. / Such a bop! 也可说：bop(s), boppy（形容歌很欢快）。","注意语境：在正式写作里不太用“bop(s)”来指歌曲；更正式可以用 catchy song / hit song。"]}
{"word":"bopster","summary":{"en":"A “bopster” is mainly a bebop jazz fan or participant; more loosely, it can mean a trendy, hip person.","zh":"“bopster”主要指喜欢或参与比博普（bop）爵士乐的人；引申也可指很潮、赶时髦的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who likes or is involved in bebop (“bop”) jazz; a jazz fan, especially of the bebop style","zh":"（尤指）喜欢或参与比博普（bop）爵士乐的人；比博普爵士乐迷"},"examples":[{"en":"My grandpa was a real bopster who collected Charlie Parker records.","zh":"我爷爷是真正的“bopster”，收藏了很多查理·帕克的唱片。"},{"en":"In the 1950s, bopsters often hung out in small jazz clubs downtown.","zh":"在20世纪50年代，很多“bopster”常常在市中心的小爵士俱乐部聚会。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) a trendy, “hip” person; someone who follows cool styles or scenes (less common today)","zh":"（非正式）赶时髦、很“潮”的人；追随酷炫风格或圈子的人（如今较少用）"},"examples":[{"en":"He talks like a bopster, but he’s actually pretty shy.","zh":"他说话像个很潮的人，但其实挺害羞的。"}]}],"synonyms":["bebop fan","jazz enthusiast","jazz lover","hipster (loose)"],"phonetic":"/ˈbɑp.stɚ/","extraExplanation":["“bopster”来自“bop / bebop”（比博普爵士乐），这种风格在20世纪40年代兴起，节奏快、和声更复杂，代表人物包括 Charlie Parker、Dizzy Gillespie。","这个词带有一点年代感，现代英语里更常说“jazz fan / jazz lover”或更具体的“bebop fan”。"]}
{"word":"bopyrid","summary":{"en":"“bopyrid” is not a recognized English word; it’s likely a misspelling or a technical name.","zh":"“bopyrid”不是常见英文词；更可能是拼写错误或技术/化学名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling or a specialized term (often seen in chemistry/drug names).","zh":"不是标准英语单词；可能是拼写错误或某个专业术语（常见于化学/药物名称）。"},"examples":[{"en":"I can’t find “bopyrid” in a dictionary—could you check the spelling?","zh":"我在词典里找不到“bopyrid”——你能确认一下拼写吗？"},{"en":"If you meant a chemical name, please share the full sentence or the context.","zh":"如果你指的是化学名称，请提供完整句子或使用场景。"}]}],"extraExplanation":["“bopyrid”很可能是拼写误差。你可以检查是否想写：\n- pyridine（吡啶，一种有机化学常见结构）\n- bipyridine / bipyridyl（二吡啶/联吡啶，化学术语）\n- bupropion（安非他酮，一种药名；拼写接近但不相同）\n\n如果你把它放在一句话里（或发截图/标签/说明书上的原文），我可以更准确判断并给出释义与例句。"]}
{"word":"Bopyridae","summary":{"en":"Bopyridae: a family of parasitic isopods that infect shrimps and crabs.","zh":"Bopyridae：寄生在虾、蟹等十足目甲壳动物上的等足目寄生虫一科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of parasitic isopod crustaceans (bopyrid isopods) that live on or inside shrimps, crabs, and related decapods, often causing visible swelling and affecting the host’s growth or reproduction","zh":"鱼虱科（等足目寄生甲壳类的一科）：寄生在虾、蟹等十足目甲壳动物体表或体内，常导致宿主体表隆起、影响生长或繁殖"},"examples":[{"en":"Some crabs show a bulge under the shell caused by a Bopyridae parasite.","zh":"有些螃蟹壳下的隆起是由鱼虱科寄生虫造成的。"},{"en":"Researchers recorded Bopyridae infection rates in local shrimp populations.","zh":"研究人员记录了当地虾类种群的鱼虱科寄生率。"}]}],"synonyms":["bopyrids","bopyrid isopods"],"phonetic":"/ˌboʊpəˈraɪdiː/","extraExplanation":["“Bopyridae”是生物分类学中的“科名”（family），在英文里常当作单数使用（例如：Bopyridae is a family…）；个体成员常说“a bopyrid”或“bopyrid isopod”。","这类寄生等足目常寄生在宿主鳃腔或腹部附近，因此在野外观察时常以“壳下/体侧鼓包”作为线索。","词源来自属名Bopyrus（鱼虱属一类早期命名的代表），后缀 -idae 表示“科”。"]}
{"word":"bopyridae","summary":{"en":"Bopyridae: a family of parasitic isopods that infect shrimp, crabs, and other crustaceans.","zh":"Bopyridae：一种寄生等足类甲壳动物的科，常感染虾、蟹等甲壳类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of parasitic isopod crustaceans that live on or inside other crustaceans (especially shrimp and crabs), often causing swelling or deformation of the host.","zh":"（生物）寄生等足类甲壳动物的一个科，常寄生在其他甲壳类（尤其是虾和蟹）体表或体内，常导致宿主体表肿胀或畸形。"},"examples":[{"en":"Bopyridae often parasitize shrimp and can make one side of the host’s body look swollen.","zh":"Bopyridae 常寄生在虾体上，可能让宿主体侧看起来肿胀。"},{"en":"The researcher recorded a crab infected by a bopyrid (Bopyridae) in the gill chamber.","zh":"研究者记录到一只蟹的鳃腔内感染了拟寄生虫（Bopyridae 科）。"},{"en":"In some coastal surveys, Bopyridae are used as indicators of host–parasite interactions in crustacean communities.","zh":"在一些海岸调查中，Bopyridae 可用于观察甲壳类群落中的宿主—寄生关系。"}]}],"synonyms":["bopyrids"],"phonetic":"/ˌboʊpɪˈraɪdi/","extraExplanation":["这是一个“科名”（taxonomy: family），属于等足目（Isopoda）的寄生类群。很多种类会寄生在宿主的鳃腔或腹部，常见特征是让宿主一侧出现明显隆起。","英语中以 -idae 结尾的词通常表示“科”（如 Hominidae 人科）。因此 Bopyridae 读起来像一个拉丁化的科学分类名称，常出现在生物学论文或野外调查报告里。"]}
{"word":"bopyridian","summary":{"en":"An adjective meaning “related to bopyrid isopod parasites (family Bopyridae).”","zh":"形容词：指与拟寄居等足类寄生虫（拟寄居等足虫科 Bopyridae）有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Bopyridae (bopyrid isopods), a family of parasitic crustaceans that live on or inside other crustaceans (especially shrimp and crabs).","zh":"与拟寄居等足虫科（Bopyridae，常称 bopyrid 等足类寄生虫）有关的；指一种寄生在其他甲壳类（尤其是虾、蟹）体表或体内的等足类。"},"examples":[{"en":"Bopyridian parasites can cause a visible swelling on a shrimp’s body.","zh":"Bopyridian（拟寄居等足类）寄生虫可能会让虾的身体出现明显的肿胀。"},{"en":"The researchers recorded bopyridian infestation rates in coastal crab populations.","zh":"研究人员记录了沿海蟹类种群中 bopyridian 寄生的发生率。"}]}],"synonyms":["bopyrid","bopyrid isopod"],"phonetic":"/ˌboʊpəˈrɪdiən/","extraExplanation":["“bopyridian”是非常少见的学术用词，更常见的形容词是“bopyrid”（指拟寄居等足类或其寄生现象）。","Bopyridae 属于等足目（Isopoda），其寄生常会造成宿主甲壳变形、能量消耗增加，甚至影响繁殖能力。"]}
{"word":"bopyrids","summary":{"en":"Bopyrids are parasitic isopod crustaceans (Bopyridae) that infect shrimp and other crustaceans.","zh":"Bopyrids 指瘤寄生虫科的寄生等足类，常寄生在虾等甲壳类上或体内。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"parasitic isopod crustaceans (family Bopyridae) that live on or inside shrimp and other crustaceans, often causing swelling or deformity.","zh":"寄生等足类甲壳动物（瘤寄生虫科 Bopyridae），常寄生在虾等甲壳类的体表或体内，常导致宿主肿胀或畸形。"},"examples":[{"en":"Some shrimp have a swollen gill chamber because of bopyrids living inside.","zh":"有些虾的鳃室会肿胀，因为里面寄生着瘤寄生虫科的等足类。"},{"en":"The researchers recorded bopyrids on several crab and shrimp species in the estuary.","zh":"研究人员在河口的多种蟹类和虾类身上记录到了瘤寄生虫科等足类。"}]}],"synonyms":["bopyrid isopods","Bopyridae (family)","parasitic isopods"],"phonetic":"/ˈbɑpɪrɪdz/","extraExplanation":["“bopyrids”是复数形式；单数是“bopyrid”。在生物学写作中也常写作“bopyrid isopods”（瘤寄生虫科等足类）。","它们常寄生在宿主的鳃室（gill chamber）或腹部附近，可能影响宿主生长与繁殖，因此在渔业与生态调查中会被特别关注。","词源来自其科名 Bopyridae（瘤寄生虫科），属于等足目（Isopoda）的寄生类群。"]}
{"word":"Bopyrus","summary":{"en":"Bopyrus is a scientific genus name for parasitic isopods that infest shrimp (often in the gills).","zh":"Bopyrus是一个科学属名，指寄生在虾等动物（常在鳃部）的寄生等足类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of parasitic isopod crustaceans (family Bopyridae) that live on or in the gill chambers of shrimp and other decapods, often causing visible swelling and reduced growth in the host.","zh":"（动物学）一种寄生等足类甲壳动物属（属名：Bopyrus，属：鳃寄生虫科Bopyridae），常寄生在虾等十足目动物的鳃腔内或鳃部附近，常导致宿主外观肿胀、发育变慢等影响。"},"examples":[{"en":"The shrimp’s gill cover looked swollen because a Bopyrus parasite was living inside.","zh":"这只虾的鳃盖看起来肿胀，因为里面寄生着一只Bopyrus。"},{"en":"Researchers recorded Bopyrus infections to understand how parasites affect shrimp populations.","zh":"研究人员记录Bopyrus感染情况，以了解寄生虫如何影响虾类种群。"}]}],"synonyms":["bopyrid isopod","parasitic isopod"],"phonetic":"/ˈbɑːpɪrəs/","extraExplanation":["“Bopyrus”是生物分类学中的拉丁化属名，通常在科研、海洋生物学或水产养殖相关文本中出现。日常英语里不常用，更常见的是更泛的说法，如“parasitic isopod（寄生等足类）”或“bopyrid isopod（鳃寄生虫科等足类）”。","这类寄生虫常寄生在虾的鳃腔，可能造成“单侧鼓起/肿胀”的外观，有时会影响宿主的生殖与生长，因此在生态与养殖监测中有一定重要性。"]}
{"word":"bopyrus","summary":{"en":"Bopyrus is a scientific genus name for parasitic isopods that infect other crustaceans, often causing swelling.","zh":"Bopyrus 是一种寄生等足类的科学属名，寄生于其他甲壳动物，常引起宿主肿胀。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of parasitic isopod crustaceans (family Bopyridae) that live on or inside other crustaceans (such as shrimp), often causing a visible swelling on the host.","zh":"一种寄生等足类甲壳动物的属名（隶属拟寄生虫科 Bopyridae），常寄生在其他甲壳动物（如虾）体表或体内，常导致宿主体表出现明显肿胀。"},"examples":[{"en":"The shrimp’s enlarged gill area suggested infection by a Bopyrus parasite.","zh":"虾鳃区的肿大提示可能感染了拟寄生虫属（Bopyrus）的寄生虫。"},{"en":"In some coastal surveys, Bopyrus species are recorded as common parasites of small prawns.","zh":"在一些沿海调查中，拟寄生虫属（Bopyrus）的物种被记录为小型对虾的常见寄生者。"}]}],"synonyms":["bopyrid (related term)","parasitic isopod (broader term)"],"phonetic":"/ˈbɑːpɪrəs/","extraExplanation":["“Bopyrus”是生物分类学中的拉丁化属名，常见于动物学、海洋生物学或寄生虫学的学术语境中，日常英语里很少使用。","这类寄生等足类通常附着在宿主的鳃腔或体侧，可能影响宿主生长与繁殖，因此在渔业与生态研究中会被关注。","相关词：bopyrid（拟寄生虫科成员/拟寄生虫类寄生者），isopod（等足目动物），parasitic isopod（寄生等足类）。"]}

