{"word":"BOQ","summary":{"en":"BOQ most commonly means “Bill of Quantities,” a construction document listing measured work items for pricing and bidding.","zh":"BOQ最常见指“Bill of Quantities（工程量清单）”，用于列出并计量工程项目以便报价与招标。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) Bill of Quantities: a detailed document in construction/engineering that lists and measures the materials, labor, and tasks needed for a project, often used for pricing and tendering (bidding).","zh":"（缩写）工程量清单：在建筑/工程中使用的详细文件，列出并计量项目所需的材料、人工与工作内容，常用于报价与招标。"},"examples":[{"en":"The contractor used the BOQ to prepare an accurate bid.","zh":"承包商用工程量清单（BOQ）来准备准确的投标报价。"},{"en":"Please check the BOQ for any missing items before we submit the tender.","zh":"在提交标书之前，请检查工程量清单（BOQ）是否有遗漏项目。"},{"en":"Changes to the design may require updates to the BOQ.","zh":"设计变更可能需要更新工程量清单（BOQ）。"}]}],"synonyms":["Bill of Quantities","quantity schedule","schedule of quantities"],"phonetic":"/bi oʊ kju/","extraExplanation":["BOQ常见于英联邦与国际工程项目文件中（如招标、合同、造价管理）。它通常由“项目名称+单位+工程量”构成，便于各投标方按同一口径报价。","发音上英语里通常按字母读“B-O-Q”，在口语或会议中也可能直接说“the BOQ”。"]}
{"word":"Boqueron","summary":{"en":"“Boqueron/Boquerón” is most commonly a Spanish place name; it can also mean “anchovy” in Spanish food contexts.","zh":"“Boqueron/Boquerón”最常见是西语地名；在西班牙饮食语境中也可指“凤尾鱼（鱼片）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A place name used in several Spanish-speaking regions (often written “Boquerón” with an accent), referring to towns, bays, parks, or landmarks (for example, Boquerón in Puerto Rico; El Boquerón in El Salvador).","zh":"一个在多处西语地区使用的地名（常写作带重音的“Boquerón”），可指城镇、海湾、公园或地标（如波多黎各的Boquerón；萨尔瓦多的El Boquerón）。"},"examples":[{"en":"We spent the afternoon in Boquerón, Cabo Rojo, eating seafood by the bay.","zh":"我们在卡沃罗霍（Cabo Rojo）的Boquerón待了一下午，在海湾边吃海鲜。"},{"en":"Hikers often visit El Boquerón National Park near San Salvador.","zh":"徒步者常去圣萨尔瓦多附近的El Boquerón国家公园。"}]},{"partOfSpeech":"n.","definition":{"en":"(From Spanish, especially in Spain) An anchovy, often served fresh, marinated, or fried; also used to mean “anchovy fillet” in food contexts.","zh":"（源自西班牙语，尤指西班牙）凤尾鱼（也常指“凤尾鱼鱼片”），在饮食语境中常见，可鲜食、腌制或油炸。"},"examples":[{"en":"In Spain, boquerones are often marinated in vinegar and served as a tapa.","zh":"在西班牙，boquerones常用醋腌制，作为小吃（tapa）端上桌。"},{"en":"I ordered boquerones and olives to share.","zh":"我点了凤尾鱼和橄榄一起分享。"}]}],"phonetic":"/ˌboʊkɛˈroʊn/","extraExplanation":["“Boquerón”在西语里来自“boca”（嘴、入口）这一词根，常带有“缺口、隘口、入口、峡口”的地形含义，所以容易被用作地名。","如果你指的是某个具体地点（例如波多黎各的Boquerón、萨尔瓦多的El Boquerón等），可以告诉我国家/地区，我可以补充更准确的背景与常见说法。","英文中有时省略重音写成“Boqueron”，但在西班牙语里标准拼法通常是“Boquerón”。"]}
