{"word":"BOS","summary":{"en":"“BOS” is an abbreviation most commonly meaning Boston’s airport code, but it can also refer to Bank of Scotland or a medical term in certain contexts.","zh":"“BOS”是缩写，最常见指波士顿机场代码；在特定语境中也可能指苏格兰银行或某些医学术语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation that can mean different things depending on context; commonly read as the letters “B-O-S.”","zh":"一个缩写，具体含义取决于语境；通常读作字母“B-O-S”。"},"examples":[{"en":"What does “BOS” stand for in this document?","zh":"在这份文件里，“BOS”代表什么？"}]},{"partOfSpeech":"other","definition":{"en":"(travel/airports) Boston Logan International Airport, the airport code “BOS.”","zh":"（旅行/机场）波士顿洛根国际机场的机场代码“BOS”。"},"examples":[{"en":"My flight lands at BOS at 7 p.m.","zh":"我的航班晚上7点降落在BOS（波士顿）。"},{"en":"We’re flying from LAX to BOS.","zh":"我们要从LAX（洛杉矶）飞到BOS（波士顿）。"}]},{"partOfSpeech":"other","definition":{"en":"(business/finance) Bank of Scotland (often written as BoS).","zh":"（商业/金融）苏格兰银行（常写作 BoS）。"},"examples":[{"en":"She opened an account with BoS while studying in the UK.","zh":"她在英国留学时在苏格兰银行（BoS）开了账户。"}]},{"partOfSpeech":"other","definition":{"en":"(medicine) bronchiolitis obliterans syndrome, a complication often discussed after lung transplantation (usually written as BOS).","zh":"（医学）闭塞性细支气管炎综合征（BOS），常在肺移植后并发症讨论中出现。"},"examples":[{"en":"The doctor monitored him for signs of BOS after the transplant.","zh":"移植后，医生监测他是否出现BOS的迹象。"}]}],"synonyms":["BoS (common variant for Bank of Scotland)"],"phonetic":"/bi oʊ ɛs/","extraExplanation":["“BOS”最常见的公众用法是机场代码（Boston）。在专业领域里也可能指银行或医学术语，所以最好结合你看到它的场景（机票/行程、金融文件、医学论文等）来判断。","如果你能提供一句原文或所属领域（旅行/金融/医学/游戏/编程等），我可以帮你锁定最准确的意思。"]}
{"word":"BoS","summary":{"en":"BoS is a context-dependent abbreviation, most often read as the letters “B-O-S.”","zh":"BoS 是一个依语境变化的缩写，通常按字母读作“B-O-S”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation that can mean different things depending on context (e.g., an organization name, a government office, or a game title). It’s often read as the letters “B-O-S.”","zh":"一个缩写，具体含义取决于语境（例如机构名称、政府部门或游戏名称等）。通常按字母读作“B-O-S”。"},"examples":[{"en":"What does BoS stand for in this report?","zh":"在这份报告里，BoS 代表什么？"},{"en":"In this email, BoS refers to the Board of Supervisors.","zh":"在这封邮件里，BoS 指的是监督委员会（Board of Supervisors）。"}]},{"partOfSpeech":"other","definition":{"en":"(in some gaming contexts) “Brotherhood of Steel,” a faction name in the Fallout series.","zh":"（在一些游戏语境中）“Brotherhood of Steel（钢铁兄弟会）”，指《辐射》（Fallout）系列中的一个派系名称。"},"examples":[{"en":"I joined the BoS quest line in Fallout.","zh":"我在《辐射》里走了 BoS 的任务线。"},{"en":"The BoS has a strict hierarchy.","zh":"BoS 的等级制度很严格。"}]},{"partOfSpeech":"other","definition":{"en":"(less common, region- or field-specific) an abbreviation for names like “Bank of Scotland” or “Bureau/Board of Statistics,” depending on the country and topic.","zh":"（较不常见，依地区/领域而定）也可能是某些名称的缩写，如 “Bank of Scotland（苏格兰银行）” 或 “Bureau/Board of Statistics（统计局/统计委员会）”。"},"examples":[{"en":"The document mentions BoS alongside other banks.","zh":"文件里把 BoS 和其他银行并列提到。"},{"en":"The BoS released updated population figures.","zh":"BoS 发布了更新的人口数据。"}]}],"synonyms":["abbrev.","initialism","acronym"],"phonetic":"/biː oʊ ɛs/","extraExplanation":["“BoS”不是一个固定单词，而是缩写；最关键的是看上下文：它出现在哪个领域（政府/商业/游戏/学校等）、前后有哪些关键词。","发音上常见两种：按字母读“B-O-S”（更常见、更正式）；少数情况下也有人直接读成类似“boss”，但通常需要明确语境才不会误解。","如果你把原句/截图发来（BoS 前后的一整句），我可以帮你精确判断这里的 BoS 具体指什么。"]}
{"word":"Bos","summary":{"en":"Bos is mainly used as a scientific genus name for cattle; BOS (all caps) is often the airport code for Boston.","zh":"Bos主要是牛属的学名；全大写BOS常指波士顿机场代码。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology) a scientific genus name for wild and domestic cattle, including cows and oxen.","zh":"（生物）牛属：野牛与家牛等牛类的属名（包括奶牛、公牛、阉牛等）。"},"examples":[{"en":"The domestic cow is classified in the genus Bos.","zh":"家牛在分类学上属于牛属（Bos）。"},{"en":"Scientists compared DNA from several Bos species.","zh":"科学家比较了几种牛属（Bos）物种的DNA。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation or code written as BOS, most commonly referring to Boston Logan International Airport (airport code: BOS).","zh":"缩写/代码（常写作BOS）：最常见指美国波士顿洛根国际机场（机场代码：BOS）。"},"examples":[{"en":"My flight arrives at BOS at 6 p.m.","zh":"我的航班下午6点到BOS（波士顿机场）。"},{"en":"We connected through BOS because it had the cheapest ticket.","zh":"我们经由BOS转机，因为那张票最便宜。"}]}],"synonyms":["cattle (general)","cow (everyday term)"],"phonetic":"/bɑs/","extraExplanation":["“Bos”来自拉丁语，意思是“牛”。在英语里它多出现在科学写作（如生物分类、学术文章）中；日常英语里一般直接说 cow / cattle。","注意大小写：写成“Bos”通常指牛属；写成全大写“BOS”更像代码或缩写（如机场代码）。"]}
{"word":"bos","summary":{"en":"“BOS” most commonly means the airport code for Boston Logan (Boston). Less commonly, “bos” can be a casual short form of “boss.”","zh":"“BOS”最常见指波士顿洛根机场代码（波士顿）。较少情况下，“bos”可作非正式的“boss”简写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Abbrev.) The IATA airport code for Boston Logan International Airport (Boston, Massachusetts, USA). Often written as “BOS” and said as the letters “B-O-S.”","zh":"（缩写）美国马萨诸塞州波士顿洛根国际机场的三字机场代码。常写作 “BOS”，口语中多读作字母 “B-O-S”。"},"examples":[{"en":"My flight lands in BOS at 6 p.m.","zh":"我的航班下午六点降落在 BOS（波士顿）。"},{"en":"Is your connection through BOS or JFK?","zh":"你是经由 BOS（波士顿）还是 JFK（纽约肯尼迪）转机？"}]},{"partOfSpeech":"other","definition":{"en":"(Informal, uncommon) A shortened spelling of “boss,” especially in casual texting or gaming contexts.","zh":"（非正式，不太常见）“boss”的缩写拼写，常见于随意聊天或游戏语境。"},"examples":[{"en":"Nice job, bos—thanks for the help.","zh":"干得好，bos——谢谢帮忙。"},{"en":"We can’t beat the bos without better gear.","zh":"没有更好的装备我们打不过那个 bos（首领）。"}]}],"synonyms":["Boston Logan (airport code: BOS)","boss (informal meaning)"],"phonetic":"/ˌbiːoʊˈɛs/","extraExplanation":["在英语里，“BOS”作为机场代码非常常见，通常要大写；这类三字代码属于 IATA（国际航空运输协会）机场代码系统。","如果你在对话里看到小写 “bos”，更多可能是个人打字习惯，或在特定圈子里把 “boss” 简写；正式写作中不建议这样用。"]}
{"word":"bos'n","summary":{"en":"A ship’s deck-crew supervisor.","zh":"船上甲板部门的主管。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A ship’s officer in charge of the deck crew and the maintenance of the hull, rigging, anchors, and other deck equipment.","zh":"（船上的）水手长；负责甲板船员及船体、索具、锚等甲板设备维护的军士/主管。"},"examples":[{"en":"The bos'n inspected the rigging before the ship left port.","zh":"水手长在船离港前检查了索具。"},{"en":"Ask the bos'n where to store the ropes.","zh":"去问水手长绳索放哪里。"}]}],"synonyms":["boatswain","bosun","deck officer","deck boss"],"phonetic":"/ˈboʊsən/","extraExplanation":["bos'n 是一种传统缩写写法，常见于航海文学、海军口令或对话中；正式写法多为 boatswain。","在不同国家的海军/商船体系里，水手长的具体职责和军衔对应可能略有差异，但核心是“甲板部门的现场主管”。"],"etymology":"源自 boatswain（“船+侍从/年轻人”），boatswain 是 boat + swain 的组合；口语和航海传统中常写作 bosun / bos'n，发音通常为“BOH-sən”。","mnemonic":["把它记成“boat 的 swain（随从/助手）”：在船上负责甲板杂务和带队的人。","看到 bos'n 就联想到发音像“波森 /bō sēn/”，更容易记住读作 /ˈboʊsən/。"]}
{"word":"bosal","summary":{"en":"“Bosal” can mean (1) a historical term in colonial records for a newly arrived African (often enslaved), or (2) a Western-riding horse noseband (hackamore).","zh":"“Bosal”可指（1）殖民时期史料中对新到非洲人（常为被奴役者）的历史称呼，或（2）西部骑术里的一种控马鼻带（无衔笼头部件）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A person (especially an enslaved person in the Americas) who was newly arrived from Africa and not yet fluent in the colonizers’ language or culture.","zh":"（历史用语）指在美洲（尤指被奴役的）新近从非洲被带来、尚未熟悉殖民者语言与文化的人。"},"examples":[{"en":"The archive uses “bosal” to distinguish newly arrived Africans from those born in the colony.","zh":"档案用“bosal”来区分新到的非洲人和在殖民地出生的人。"},{"en":"In some records, “bosal” describes someone who did not yet speak Spanish well.","zh":"在一些记录中，“bosal”用来形容某人当时还不太会说西班牙语。"}]},{"partOfSpeech":"n.","definition":{"en":"A type of braided rawhide or leather noseband (a hackamore) used to control a horse, especially in Western riding traditions.","zh":"一种用于控马的编织生皮/皮革鼻带（无衔笼头的一部分），常见于西部骑术传统。"},"examples":[{"en":"The trainer started the young horse in a bosal before moving to a bit.","zh":"训练师先用bosal调教年轻的马，之后再过渡到衔铁。"},{"en":"A well-made bosal should sit correctly on the horse’s nose.","zh":"做工好的bosal应当正确贴合在马的鼻梁位置。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) Mute, awkward, or lacking speech; also used historically for “uncultured” or “unrefined.”","zh":"（少见）哑口、笨拙或不善言辞；历史上也曾被用来指“未开化/粗鄙”。"},"examples":[{"en":"Older texts may use “bosal” to mean someone who is tongue-tied.","zh":"较旧的文本里，“bosal”有时指一个人说不出话、嘴笨。"}]}],"synonyms":["(horse tack) hackamore","(horse tack) noseband","(historical) bozales (Spanish, plural form in some texts)"],"phonetic":"/boʊˈsɑl/","extraExplanation":["“bosal”源自西班牙语：在殖民时期的文书里，它常被用作对新近被贩运到美洲的非洲人的分类标签。这个用法带有强烈的历史压迫背景，现代写作中应谨慎：最好只在讨论史料、引用原文或进行学术说明时使用，并明确其历史语境。","马具义的“bosal”也来自西班牙语（与“bozal”相关），在北美西部骑术与加州传统（vaquero）中较常见。不同语境下含义差别很大：历史/族群语境与马术语境不要混用。"]}
{"word":"Bosanquet","summary":{"en":"Bosanquet is mainly a last name (proper noun), and it can also refer to famous people with that surname (e.g., philosopher Bernard Bosanquet).","zh":"Bosanquet 主要是一个姓氏（专有名词），也可用来指姓这个姓的知名人物（如哲学家伯纳德·博桑奎特）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name), originally associated especially with Britain; used to refer to a person who has this last name.","zh":"博桑奎特（Bosanquet）：姓氏（家族姓），尤其常见于英国；用于指姓这个姓的人。"},"examples":[{"en":"Dr. Bosanquet will lead today’s discussion.","zh":"博桑奎特博士将主持今天的讨论。"},{"en":"Have you met anyone with the last name Bosanquet?","zh":"你见过姓博桑奎特的人吗？"}]},{"partOfSpeech":"n.","definition":{"en":"(by extension) the name of notable people, most famously the British philosopher Bernard Bosanquet (1848–1923).","zh":"（引申）一些知名人物的名字，最常被提到的是英国哲学家伯纳德·博桑奎特（1848–1923）。"},"examples":[{"en":"In class we briefly mentioned Bernard Bosanquet’s ideas about the state and society.","zh":"课上我们简要提到了伯纳德·博桑奎特关于国家与社会的观点。"}]}],"synonyms":["(no direct synonyms; it is a proper name)"],"phonetic":"/ˈboʊzənkeɪ/","extraExplanation":["Bosanquet 通常作为专有名词出现（首字母大写）。读到学术文章或历史资料时，它往往指“某位姓 Bosanquet 的人”，需要结合上下文判断具体是谁。","在少数科技/工程语境里，你可能会看到以该姓氏命名的术语（如某些流体力学或光学相关的“Bosanquet …”），这类用法一般属于“以科学家姓名命名”。"]}
{"word":"bosbok","summary":{"en":"Bosbok is a southern African word meaning “bushbuck,” a shy antelope that lives in thick bush or forest.","zh":"Bosbok是南部非洲常用词，意思是“bushbuck（林羚/灌木羚）”，一种常住在灌木丛或森林里的胆小羚羊。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bushbuck; a medium-sized African antelope (especially in southern Africa), known for living in dense bush or forest.","zh":"（南部非洲常用语）林羚／灌木羚；一种生活在灌木丛或森林中的中型非洲羚羊。"},"examples":[{"en":"We spotted a bosbok grazing near the edge of the thicket.","zh":"我们看到一只bosbok在灌木丛边缘吃草。"},{"en":"The guide explained that the bosbok is shy and usually stays in dense cover.","zh":"向导解释说，bosbok很胆小，通常躲在茂密的植被里。"}]}],"synonyms":["bushbuck","antelope"],"phonetic":"/ˈbɔsˌbɑk/","extraExplanation":["“Bosbok”主要见于南非语境（阿非利堪斯语 Afrikaans），字面由“bos（灌木/树林）+ bok（羊/羚羊）”组成；在英语资料中更常用的对应词是“bushbuck”。","有些地区也会把不同的“bushbuck（林羚）/nyala（高角羚）”等混叫；在正式英文写作里建议优先用更通用、学名更清晰的“bushbuck (Tragelaphus sylvaticus)”。"]}
{"word":"Bosc","summary":{"en":"Bosc is a pear variety with brown russet skin and firm, sweet flesh, popular for eating fresh and for baking.","zh":"Bosc 指波士克梨：褐色粗皮、果肉紧实香甜，适合生吃也很常用于烘焙。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a variety of pear with a long neck and brownish russet skin, known for a firm texture and sweet, spicy flavor (often eaten fresh or used in baking).","zh":"一种梨的品种（波士克梨），果形细长、表皮呈褐色粗皮（锈皮），口感较硬脆，味道甜并带一点香料感；常用来生吃或烘焙。"},"examples":[{"en":"I bought two Bosc pears for a tart.","zh":"我买了两个波士克梨来做水果挞。"},{"en":"Bosc pears hold their shape well when baked.","zh":"波士克梨烤过后不容易煮烂，形状保持得很好。"},{"en":"This salad tastes great with sliced Bosc pear and walnuts.","zh":"这份沙拉加上切片波士克梨和核桃很好吃。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to this pear variety (often used before another noun).","zh":"与波士克梨这种品种有关的（常作定语使用）。"},"examples":[{"en":"Try a Bosc pear salad with blue cheese.","zh":"可以试试波士克梨蓝纹奶酪沙拉。"},{"en":"The recipe calls for Bosc pear slices.","zh":"食谱需要波士克梨切片。"}]}],"synonyms":["Bosc pear","European pear (type)"],"phonetic":"/bɑsk/","extraExplanation":["“Bosc”常见于北美超市的梨类标签中，也常写作“Bosc pear”。它的特点是外皮粗糙偏褐色、果肉相对紧实，因此很适合烘烤、煎烤或做派/挞；如果想要更软更多汁的口感，人们有时会选择Bartlett或Anjou等品种作对比。","名称来源通常与法国博物学家 Louis Augustin Guillaume Bosc（路易·博斯克）有关，因此首字母常大写。日常口语里也有人直接说“a Bosc”。"]}
{"word":"bosc","summary":{"en":"Bosc is a pear variety known for its brown russet skin and sweet, slightly spicy flavor.","zh":"Bosc 指一种梨的品种（博斯克梨），以褐色锈皮和甜中带微辛香的风味著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of pear with a brown, russeted skin and a sweet, spicy flavor; often called a “Bosc pear.”","zh":"一种梨（波斯克梨/博斯克梨），外皮呈褐色带粗糙“锈皮”，风味甜中带微微辛香，常称为“Bosc pear（博斯克梨）”。"},"examples":[{"en":"I bought two Bosc pears to bake in the oven.","zh":"我买了两个博斯克梨，准备放进烤箱烤。"},{"en":"Bosc pears stay fairly firm, so they’re great for poaching.","zh":"博斯克梨比较耐煮、口感更能保持，所以很适合做红酒煮梨。"}]}],"synonyms":["Bosc pear"],"phonetic":"/bɑsk/","extraExplanation":["“Bosc”多见于食品、菜谱和超市标签，通常指“Bosc pear（博斯克梨）”。在英语里它常被当作专有名称使用，因此首字母常大写。","这种梨常见特点是褐色粗糙的表皮（russeted skin）和较坚实的果肉；相比更软的 Bartlett 等品种，Bosc 更适合烘烤、炖煮、糖水煮制等做法。","名称与欧洲（法国/比利时一带）有关；在美式英语的日常语境中，直接说 “Bosc” 通常也能被理解为 “Bosc pear”。"]}
{"word":"boscage","summary":{"en":"Boscage means a small wooded area or a cluster of trees and shrubs, often used in literary or artistic descriptions.","zh":"boscage 指“小树林/灌木丛”，多用于文学或艺术性的风景描写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small wooded area; a cluster of trees and shrubs, often used as a picturesque background in art or writing","zh":"小树林；灌木丛（常用于描写风景画面，带有诗意/田园色彩）"},"examples":[{"en":"We stopped for lunch in a quiet boscage near the stream.","zh":"我们在小溪旁一片安静的小树林里停下来吃午饭。"},{"en":"In the novel, the lovers hide in a boscage to avoid being seen.","zh":"在小说里，恋人躲进一片灌木小林中以免被人看见。"},{"en":"The painter placed a boscage behind the house to make the scene feel peaceful.","zh":"画家在房子后面画了一片小树林，让画面显得宁静。"}]}],"synonyms":["grove","thicket","copse","woodland"],"phonetic":"/ˈbɑːs.kɪdʒ/","extraExplanation":["“boscage”较为文学化、偏书面，现代日常英语里更常用“grove”（小树林）、“thicket”（灌木丛，偏密）、或“woodland”（林地，范围更大）。","词源来自法语 *boscage*（与“bosk/wood”相关），因此常见于诗歌、小说、园林与艺术评论中，用来营造“田园、隐蔽、葱郁”的意象。","在文学里它常作为“可躲藏的树丛/绿荫背景”的意象，带有浪漫或静谧的氛围（类似中文里“林荫深处”“灌木丛中”的感觉）。"]}
{"word":"boscages","summary":{"en":"Boscages means thick wooded thickets or (less commonly) wooded scenery, often in literary style.","zh":"boscages 指茂密的树丛/灌木林，也可指带林地的小景致；多见于文学语体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Thick groups of trees or shrubs; wooded thickets (often used in poetic or literary writing).","zh":"茂密的树丛/灌木丛；林间灌丛（常见于诗歌或文学用语）。"},"examples":[{"en":"The deer slipped quietly into the boscages at the edge of the field.","zh":"鹿悄悄溜进了田野边缘的灌木林中。"},{"en":"In the poem, boscages hide lovers from the eyes of the court.","zh":"在诗里，树丛为恋人遮蔽宫廷的目光。"}]},{"partOfSpeech":"n.","definition":{"en":"Wooded scenery or a landscape marked by small woods (less common).","zh":"带有小片树林的景致/风景（较少见）。"},"examples":[{"en":"The painting shows soft hills, streams, and boscages in the distance.","zh":"画中远处是柔和的山丘、溪流与林地景致。"}]}],"synonyms":["thickets","brushwood","groves","woodland","copse"],"phonetic":"/ˈbɑs.kɪdʒɪz/","extraExplanation":["“boscages”是“boscage”的复数形式，语气偏古典/文学，现代日常英语更常用“thickets”“woodland”“groves”。","词源与法语相关（与 bosquet“树丛、小树林”同源），因此常带有“风景画般的林间景致”这种审美色彩。"]}
{"word":"Bosch","summary":{"en":"Bosch commonly refers to the German technology brand, and it can also refer to the painter Hieronymus Bosch.","zh":"Bosch 通常指德国“博世”品牌，也可指画家耶罗尼米斯·博施。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a German engineering and technology company (brand name) known for car parts, power tools, and home appliances.","zh":"博世（品牌名）：德国工程与科技公司，以汽车零部件、电动工具和家用电器等闻名。"},"examples":[{"en":"We replaced the car’s spark plugs with Bosch ones.","zh":"我们把车的火花塞换成了博世的。"},{"en":"She bought a Bosch dishwasher for her new apartment.","zh":"她给新公寓买了一台博世洗碗机。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name; especially referring to the Dutch painter Hieronymus Bosch (c. 1450–1516), famous for imaginative, surreal religious scenes.","zh":"博施/博斯（姓氏）：尤其指荷兰画家耶罗尼米斯·博施（约1450–1516），以富于想象、近似超现实的宗教题材画作著称。"},"examples":[{"en":"The museum has a room dedicated to Bosch and his followers.","zh":"博物馆有一个展厅专门展示博施及其追随者的作品。"},{"en":"His strange, dreamlike style reminded critics of Bosch.","zh":"他怪诞、梦境般的风格让评论家想起博施。"}]}],"synonyms":["Robert Bosch (company)","Hieronymus Bosch (painter)"],"phonetic":"/bɑʃ/","extraExplanation":["“Bosch”作为品牌通常指 Robert Bosch GmbH（罗伯特·博世有限公司），由罗伯特·博世在19世纪末于德国创立。在英语里，人们常直接用“Bosch”来代指其产品（如 Bosch tools / Bosch parts）。","画家“Hieronymus Bosch”的“Bosch”来自他家乡荷兰城市 ’s‑Hertogenbosch（常简称 Den Bosch），因此这个名字带有地名来源的色彩。"]}
{"word":"bosch","summary":{"en":"“Bosch” most commonly refers to the German company/brand, and it can also refer to the painter Hieronymus Bosch.","zh":"“Bosch”最常指德国博世公司/品牌，也可指画家希罗尼穆斯·博斯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a German engineering and technology company best known for auto parts, home appliances, and industrial technology (often seen as a brand name on products).","zh":"博世：德国工程与科技公司（常作为品牌名出现在产品上），以汽车零部件、家电和工业技术闻名。"},"examples":[{"en":"My car has Bosch spark plugs.","zh":"我的车装的是博世火花塞。"},{"en":"We bought a Bosch dishwasher last year.","zh":"我们去年买了一台博世洗碗机。"}]},{"partOfSpeech":"n.","definition":{"en":"a Dutch painter from the late Middle Ages, famous for imaginative and symbolic paintings; his full name is Hieronymus Bosch.","zh":"博斯（博许）：中世纪晚期的荷兰画家，以充满想象力与象征意味的作品著称；全名为希罗尼穆斯·博斯。"},"examples":[{"en":"The museum has a painting attributed to Bosch.","zh":"这家博物馆有一幅被认为出自博斯之手的画。"},{"en":"Bosch’s works are full of strange creatures and moral symbols.","zh":"博斯的作品里充满奇异生物和道德象征。"}]}],"synonyms":["Robert Bosch (company)","Hieronymus Bosch (painter)"],"phonetic":"/bɑʃ/","extraExplanation":["在英语里，Bosch常见于两种语境：①作为品牌/公司名（通常与电动工具、汽车零件、家电相关）；②作为画家姓名（Hieronymus Bosch），艺术史与博物馆语境中更常见。","发音上英语里通常读作 /bɑʃ/（结尾像“sh”音）。在中文里常译作“博世”（公司）与“博斯/博许”（画家），不同译名对应不同对象。"]}
{"word":"boschbok","summary":{"en":"Boschbok is a South African word for the bushbuck, a forest antelope.","zh":"boschbok 是南非用语，指林羚（bushbuck），一种栖息于林地的羚羊。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a South African antelope, the bushbuck (a shy, forest-dwelling antelope).","zh":"南非的一种羚羊：林羚（bushbuck，一种害羞、常栖息于林地的羚羊）。"},"examples":[{"en":"We spotted a boschbok moving quietly at the edge of the forest.","zh":"我们看见一只林羚在森林边缘安静地移动。"},{"en":"In some South African writing, “boschbok” is used as another name for the bushbuck.","zh":"在一些南非的文字中，“boschbok”被用作“bushbuck（林羚）”的另一种称呼。"}]}],"synonyms":["bushbuck"],"phonetic":"/ˈbɔʃˌbɑk/","extraExplanation":["“boschbok”来自南非荷兰语（Afrikaans）：bosch/bos 意为“灌木丛、树林”，bok 意为“羚羊/山羊”。因此它字面意思接近“林中的羚羊”。","这个词多见于南非语境的英语文本（如自然观察、狩猎或地方叙述）中；在更通用的国际英语里更常用的词是“bushbuck”。"]}
{"word":"boschboks","summary":{"en":"Boschboks is a South African (Afrikaans-derived) word referring to a bushbuck, a forest-and-thicket antelope.","zh":"Boschboks 是南非（源自 Afrikaans）的说法，通常指林羚/灌丛羚（bushbuck），一种生活在林地与灌木丛的羚羊。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A South African term (from Afrikaans) for a bushbuck, a shy, medium-sized African antelope that lives in dense vegetation; sometimes used loosely for similar “bush” antelopes.","zh":"南非用语（源自南非荷兰语 Afrikaans），指“林羚 / 灌丛羚”（bushbuck），一种喜欢在灌木丛、林地活动、较为胆怯的中型非洲羚羊；有时也被泛指类似的“丛林羚羊”。"},"examples":[{"en":"We spotted a boschboks near the river, half-hidden in the reeds.","zh":"我们在河边看到一只 boschboks，半藏在芦苇里。"},{"en":"In older South African writing, “boschbok” is often used for the bushbuck.","zh":"在较早的南非作品里，“boschbok”常用来指 bushbuck（林羚）。"}]}],"synonyms":["bushbuck","boschbok"],"phonetic":"/ˈbɔʃbɑks/","extraExplanation":["“boschboks”更常见的拼写是“boschbok”，复数有时写作“boschbokke”（Afrikaans 的复数形式）；英语语境里也常直接用“bushbuck”。","词源上，Afrikaans 的“bosch”≈“bush/灌木丛”，“bok”≈“buck/公羚羊、雄鹿”。因此这个词直译接近“灌木丛里的羚羊”。","如果你是在某篇文章或对话里看到“boschboks”，它可能是：①把 Afrikaans 复数英语化（加 -s）；②拼写变体；③指不特定的“丛林羚羊”。"]}
{"word":"Boschneger","summary":{"en":"A historical Dutch colonial word for Surinamese Maroons; now widely considered offensive.","zh":"一个荷兰殖民时期对苏里南马龙人的称呼；如今普遍被认为具有冒犯性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Offensive, historical) A Dutch colonial term for a Maroon person in Suriname—descendants of enslaved Africans who escaped plantations and formed independent communities in the interior rainforest.","zh":"（冒犯性、历史用语）荷兰殖民时期对苏里南“马龙人/雨林社群”的称呼：指逃离种植园奴役并在内陆雨林建立独立社区的非洲裔后代。"},"examples":[{"en":"In older colonial records, the word “Boschneger” was used to label Maroon communities in Suriname.","zh":"在较早的殖民档案中，“Boschneger”常被用来给苏里南的马龙社群贴标签。"},{"en":"Today many people avoid this term because it is widely considered disrespectful and racist.","zh":"如今很多人会避免使用这个词，因为它普遍被认为不尊重且带有种族歧视。"}]}],"synonyms":["Maroon (Suriname)","Surinamese Maroons","Saramaka","Ndyuka"],"phonetic":"/ˈbɑʃˌneɪɡər/","extraExplanation":["这个词来自荷兰语：bosch（森林/灌木丛）+ neger（历史上指“黑人”，但在现代语境里常被视为冒犯性词汇）。合在一起相当于“丛林里的黑人/雨林黑人”的殖民式称呼。","在当代写作中，建议用更尊重、更准确的说法，例如：Maroon people（马龙人/逃奴后裔社群）、Surinamese Maroons，或具体族群名称（如 Saramaka、Ndyuka 等）。如果必须引用该词，最好加引号并说明其历史与冒犯性。"]}
{"word":"boschneger","summary":{"en":"“Boschneger” is a historical, often offensive colonial term for Maroon people in Suriname; modern usage generally avoids it.","zh":"“Boschneger”是殖民时期对苏里南马龙人的旧称，常被视为冒犯；现代通常应避免使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical, often offensive) A Dutch-based colonial term for a Maroon person in Suriname—someone descended from Africans who escaped slavery and formed independent communities in the interior.","zh":"（历史用语，常被视为冒犯）荷兰殖民语境中对苏里南马龙人（逃离奴役并在内陆建立独立社群的非洲裔后代）的称呼。"},"examples":[{"en":"Some older colonial records use the word “boschneger” for Maroon communities in Suriname.","zh":"一些较早的殖民档案会用“boschneger”来指称苏里南的马龙社群。"},{"en":"Today, many writers avoid this term and prefer “Maroon” or the community’s own name (for example, Ndyuka or Saramaka).","zh":"如今，许多写作者会避免使用这个词，而改用“Maroon（马龙人）”或社群自称（如 Ndyuka 或 Saramaka）。"}]}],"synonyms":["Maroon (preferred)","Ndyuka (specific group)","Saramaka (specific group)"],"phonetic":"/ˈbɑʃˌneɪɡər/","extraExplanation":["这个词来自荷兰语：bosch（森林/灌木丛）+ neger（旧称“黑人”，在现代语境中常被视为冒犯）。直译接近“丛林黑人/森林黑人”，带有殖民时代的种族化与贬抑色彩。","在学习或研究历史文本时可能会遇到，但在当代英语/荷兰语交流中通常不建议使用；更尊重的说法是 Maroon，或直接用具体族群名称（如 Ndyuka、Saramaka 等）。"]}
{"word":"boschvark","summary":{"en":"Boschvark means a bushpig (a wild African pig), especially in South African English.","zh":"boschvark 指“灌木猪/林猪”（一种非洲野猪），多见于南非英语语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South African English, from Afrikaans) a bushpig—a wild African pig that lives in forests and dense bush.","zh":"（南非英语，源自南非荷兰语 Afrikaans）灌木猪／林猪：一种生活在森林和灌木丛中的非洲野猪。"},"examples":[{"en":"We saw a boschvark crossing the road at dusk near the game reserve.","zh":"我们在野生动物保护区附近的黄昏时分看到一只“boschvark”横穿马路。"},{"en":"Farmers sometimes fence crops to keep boschvarks out.","zh":"农民有时会把庄稼围起来，防止灌木猪（boschvark）闯入。"}]}],"synonyms":["bushpig","wild pig"],"phonetic":"/ˈbɔʃˌvɑrk/","extraExplanation":["“boschvark”来自南非荷兰语（Afrikaans）：bosch/bos- 表示“树林、灌木丛（bush/forest）”，vark 表示“猪（pig）”。因此字面意思就是“林中的猪／灌木丛里的猪”。","在南部非洲语境中，它通常指“bushpig（灌木猪/林猪）”，而不是“warthog（疣猪）”。不过在口语或非正式写作里，有时会被不严谨地拿来泛指野猪。拼写上也常见 bosvark（更接近原来的 Afrikaans 拼法）。"]}
{"word":"boschveld","summary":{"en":"Boschveld is a South African term for bushy open grassland/woodland (bushveld).","zh":"Boschveld 是南非常用词，指带灌木的开阔草地/稀树草原地带（类似 bushveld）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Africa) Open, scrubby woodland/grassland—similar to “bushveld”—typical of parts of Southern Africa.","zh":"（南非用语）一种开阔、灌木丛与草地/稀树草原交错的地貌与植被类型，类似“bushveld（灌木稀树草原）”，常见于非洲南部部分地区。"},"examples":[{"en":"They went hiking through the boschveld and saw antelope near a small waterhole.","zh":"他们穿越博施费尔德（boschveld）徒步旅行，在小水坑附近看到了羚羊。"},{"en":"In the dry season, the boschveld can look brown and dusty, but it’s full of life.","zh":"旱季时，boschveld 可能看起来枯黄多尘，但那里依然生机勃勃。"}]}],"synonyms":["bushveld","savanna","scrubland"],"phonetic":"/ˈbɑːʃvɛlt/","extraExplanation":["“boschveld”多见于南非英语或受南非荷兰语（Afrikaans）影响的写法；更常见的对应词是“bushveld”。","词源上可拆解为 Afrikaans 的“bosch（灌木/树林）+ veld（原野/草原）”，合起来就是“有灌木的原野/草地”。在南部非洲文化与自然写作中常用来描绘乡野、狩猎区或野生动物栖息地的景象。"]}
{"word":"Boscobel","summary":{"en":"Boscobel is a proper name used mainly for places, notably a town in Wisconsin (USA) and the historic Boscobel House in England.","zh":"Boscobel主要是专有地名，用于多个地点，最常见的是美国威斯康星州的小镇，以及英国与查理二世逃亡故事相关的博斯科贝尔庄园。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name, especially a town in southwestern Wisconsin, USA.","zh":"地名，尤指美国威斯康星州西南部的一个小镇（博斯科贝尔）。"},"examples":[{"en":"She grew up in Boscobel, Wisconsin, and later moved to Madison for college.","zh":"她在威斯康星州的博斯科贝尔长大，后来去麦迪逊上大学。"},{"en":"The road trip stops included Boscobel and a few small towns along the river.","zh":"这次公路旅行的停靠点包括博斯科贝尔以及河边的几个小镇。"}]},{"partOfSpeech":"n.","definition":{"en":"a historic place name in England, most famously Boscobel House (Shropshire), connected with King Charles II’s escape and hiding after the Battle of Worcester (1651).","zh":"英国的历史地名，最著名的是什罗普郡的“博斯科贝尔庄园”（Boscobel House），与查理二世在1651年伍斯特战役后逃亡并藏身的故事相关。"},"examples":[{"en":"They visited Boscobel House to learn about Charles II and the ‘Royal Oak’ story.","zh":"他们参观了博斯科贝尔庄园，了解查理二世和“皇家橡树”的故事。"},{"en":"In some histories, Boscobel is mentioned as a key stop in the king’s escape route.","zh":"在一些史书中，博斯科贝尔被提到是国王逃亡路线中的关键一站。"}]}],"phonetic":"/ˈbɑskəˌbɛl/","extraExplanation":["“Boscobel”常被认为来自意大利语/中古用法“bosco bello”（意为“美丽的树林/林地”），因此带有一种“林中隐居地”的意象。","英国语境里它最出名的文化联想是“Royal Oak（皇家橡树）”：传说查理二世为躲避追捕曾藏在橡树上/附近，后来“Royal Oak”也成为英国文化中的一个象征（在地名、酒馆名、船名等处可见）。"]}
{"word":"Boscovich","summary":{"en":"Boscovich is the name of an 18th-century Jesuit scientist known for influential ideas in astronomy and early atomic theory.","zh":"Boscovich 指18世纪一位耶稣会科学家，以天文学研究和早期原子理论思想而知名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Ruđer (Ruggiero) Josip Bošković (1711–1787), a Croatian-born Jesuit scientist and philosopher known for work in astronomy, mathematics, physics, and an early atomic theory (often called “Boscovich’s theory”).","zh":"鲁杰尔（鲁杰罗）·约瑟夫·博斯科维奇（1711–1787），克罗地亚裔耶稣会科学家与哲学家，以天文学、数学、物理学及早期原子理论（常称“博斯科维奇理论”）闻名。"},"examples":[{"en":"Boscovich proposed an early model of matter made of point-like particles and forces between them.","zh":"博斯科维奇提出了一种早期的物质模型：由点状粒子及其之间的作用力构成。"},{"en":"In a history of science class, we read about Boscovich’s influence on later ideas in physics.","zh":"在科学史课上，我们读到博斯科维奇对后世物理学思想的影响。"}]}],"synonyms":["Ruđer Bošković","Ruggiero Boscovich","Bošković"],"phonetic":"/ˈbɔs.kə.vɪtʃ/","extraExplanation":["“Boscovich”常见于学术语境（科学史、物理学思想史、天文学史）。他的名字也常以所有格形式出现：Boscovich’s theory（博斯科维奇理论）、Boscovich’s model（博斯科维奇模型）。","他的重要观点之一是：物质可被理解为“点”以及点之间随距离变化的吸引/排斥力，这在后来一些关于力场与原子结构的讨论中常被提及。","拼写提示：原姓为Bošković（含特殊字符š、ć），英语文本里常写作Boscovich。"]}
{"word":"Bose","summary":{"en":"“Bose” usually refers to the audio brand, and in science it often refers to physicist S. N. Bose.","zh":"“Bose”通常指音响品牌；在科学语境中常指物理学家玻色（S. N. Bose）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a well-known American brand that makes audio equipment (such as speakers, headphones, and sound systems).","zh":"Bose（博士）是一家知名的美国音响品牌，生产扬声器、耳机和音响系统等产品。"},"examples":[{"en":"I bought a pair of Bose headphones for commuting.","zh":"我买了一副 Bose 耳机用来通勤。"},{"en":"The store is demonstrating a Bose speaker system.","zh":"这家店正在演示一套 Bose 音响系统。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name, especially referring to Satyendra Nath Bose, an Indian physicist whose work helped develop quantum statistics.","zh":"Bose（玻色）是一个姓氏，常指印度物理学家萨特延德拉·纳特·玻色，他的研究推动了量子统计的发展。"},"examples":[{"en":"Bose’s work is closely connected to Einstein’s in physics history.","zh":"在物理学史上，Bose 的工作与爱因斯坦的研究密切相关。"},{"en":"In class we learned how Bose’s ideas led to new ways of describing particles.","zh":"课堂上我们学到，Bose 的思想带来了描述粒子的全新方式。"}]}],"phonetic":"/boʊz/","extraExplanation":["“Bose”在日常英语里最常见的用法是音响品牌名（通常首字母大写）。在科学语境中，它常出现在“Bose–Einstein”（玻色—爱因斯坦）这样的术语里，比如“Bose–Einstein condensate（玻色—爱因斯坦凝聚态）”。","物理学里常见的“boson（玻色子）”这个词也源自Bose的姓氏，用来纪念他对量子统计的贡献。"]}
{"word":"bose","summary":{"en":"“Bose” usually refers to the audio brand, or the physicist’s surname seen in terms like “Bose–Einstein.”","zh":"“Bose”通常指音频品牌 Bose，也可指物理学家玻色（Bose）这一姓氏，如“玻色—爱因斯坦”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a well-known American brand that makes speakers, headphones, and other audio equipment.","zh":"（Bose）一家知名的美国音频品牌，生产音箱、耳机等音响设备。"},"examples":[{"en":"I bought a pair of Bose headphones for traveling.","zh":"我买了一副 Bose 耳机用来旅行。"},{"en":"The store was playing music through Bose speakers.","zh":"商店用 Bose 音箱在播放音乐。"}]},{"partOfSpeech":"other","definition":{"en":"a family name, especially in science: Satyendra Nath Bose, a physicist whose name appears in terms like “Bose–Einstein.”","zh":"（Bose）一个姓氏，尤其常见于科学领域：物理学家萨特延德拉·纳特·玻色，其姓出现在“Bose–Einstein（玻色—爱因斯坦）”等术语中。"},"examples":[{"en":"In physics class, we learned about Bose–Einstein condensates.","zh":"在物理课上，我们学习了玻色—爱因斯坦凝聚。"},{"en":"Bose worked on ideas related to quantum statistics.","zh":"玻色研究了与量子统计相关的思想。"}]}],"phonetic":"/boʊz/","extraExplanation":["“Bose”通常需要大写，因为多指品牌名或人名。发音为 /boʊz/，与动词“bows”（/baʊz/，鞠躬/弓的复数）不同，注意别读混。","品牌 Bose 的名字来自创始人 Amar Bose（阿玛尔·玻色）的姓氏；在科学语境里，Bose 指的是印度物理学家 S. N. Bose（玻色）。"]}
{"word":"bosel","summary":{"en":"Bosel is usually a proper name (surname/place), not a common English word; meaning depends on context.","zh":"Bosel 通常是专有名词（姓氏/地名），不是常见英语单词；含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (surname or place name). It is not a common standard English vocabulary word, so its meaning depends on the specific person, brand, or location you mean.","zh":"专有名词（姓氏或地名）。它不是常见的标准英语词汇，因此含义取决于你指的是具体的人名、品牌或地点。"},"examples":[{"en":"I saw the name Bosel on a list of authors.","zh":"我在作者名单上看到了 Bosel 这个名字。"},{"en":"Bosel is listed as a family name in some records.","zh":"在一些记录里，Bosel 被列为姓氏。"}]}],"phonetic":"ˈboʊzəl","extraExplanation":["“bosel”在主流英语词典中通常不是常用词条，更常见的是作为姓氏/地名/品牌名出现，因此很难给出唯一的“词义”。","如果你是想查一个英文单词，可能是拼写接近的词：boast（夸耀）、bowel（肠）、bosom（胸怀/亲密的）、vessel（容器/船只）等。你可以提供一句包含它的原句或说明语境，我可以帮你确认你要找的词。"]}
{"word":"Boselaphus","summary":{"en":"Boselaphus is the scientific genus name for the nilgai, a large Asian antelope.","zh":"Boselaphus 是蓝牛（印度大羚羊）所属的科学属名，指一种大型亚洲羚羊。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of large Asian antelopes; it includes the nilgai (Boselaphus tragocamelus), the largest antelope in Asia.","zh":"一种亚洲大型羚羊的属名；现存代表为蓝牛／印度大羚羊（Boselaphus tragocamelus），也是亚洲体型最大的羚羊。"},"examples":[{"en":"The nilgai is classified in the genus Boselaphus.","zh":"蓝牛（印度大羚羊）被归入 Boselaphus（蓝牛属）。"},{"en":"Boselaphus tragocamelus is widespread across parts of India.","zh":"Boselaphus tragocamelus（蓝牛）在印度部分地区分布广泛。"}]}],"synonyms":["nilgai","blue bull"],"phonetic":"/ˌboʊsəˈlæfəs/","extraExplanation":["词源提示：Boselaphus 来自希腊语词根，bos-（牛）+ elaphos（鹿），用来形容这种动物外形上兼具“像牛又像鹿”的特征，因此中文常称“蓝牛”。","使用场景：这个词主要出现在动物学、生态学与自然纪录片中；日常英语更常用 nilgai（指该属最常见的物种）。"]}
{"word":"boselaphus","summary":{"en":"Boselaphus is the scientific genus name for certain large Asian antelopes, especially the nilgai.","zh":"Boselaphus 是某些亚洲大型羚羊（尤其是蓝牛羚/印度羚 nilgai）的科学属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of large Asian antelopes, best known for the nilgai (Boselaphus tragocamelus).","zh":"牛羚属（Boselaphus）：一种亚洲大型羚羊的属，其中最著名的是蓝牛羚/印度羚（nilgai，Boselaphus tragocamelus）。"},"examples":[{"en":"Boselaphus tragocamelus is commonly called the nilgai.","zh":"Boselaphus tragocamelus 通常被称为 nilgai（蓝牛羚/印度羚）。"},{"en":"In older wildlife books, you may see Boselaphus listed under antelopes of India.","zh":"在较早的野生动物书籍里，你可能会看到 Boselaphus 被列在“印度的羚羊”之下。"}]}],"synonyms":["nilgai (common name; for Boselaphus tragocamelus)"],"phonetic":"/ˌboʊsəˈlæfəs/","extraExplanation":["这是一个动物分类学（生物学）里的拉丁化属名，日常英语对话中很少使用；更常见的叫法是 nilgai（蓝牛羚/印度羚）。","词源来自希腊语：bous（牛）+ elaphos（鹿），大意是“像牛又像鹿的动物”，反映了这种动物在外形上的联想。","作为属名，Boselaphus 通常首字母大写并用斜体书写（Boselaphus），物种名则是两部分（如 Boselaphus tragocamelus）。"]}
{"word":"Boser","summary":{"en":"“Boser” is not a common standard English word; it’s usually an informal/misspelled form meaning someone who bosses others around, or it may be a surname (Boser).","zh":"“Boser”不是常见的标准英语词；多为口语/拼写变体，指爱指挥他人的人，也可能是姓氏（Boser）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, nonstandard spelling) A person who bosses others around; someone who acts like a “boss” or supervisor.","zh":"（非标准拼写/口语）爱指挥他人的人；像“老板/主管”一样发号施令的人。"},"examples":[{"en":"He’s a real boser—he keeps telling everyone what to do.","zh":"他真是个“boser”——总是指挥大家该做什么。"},{"en":"Our team needs a leader, not a boser.","zh":"我们团队需要的是领导者，而不是爱使唤人的“boser”。"}]},{"partOfSpeech":"other","definition":{"en":"A family name (surname) used by some people (capitalized: Boser).","zh":"人名姓氏（首字母大写：Boser）。"},"examples":[{"en":"Ms. Boser will speak at the meeting tomorrow.","zh":"Boser 女士明天会在会上发言。"}]}],"synonyms":["bossy person","bosser","controller","supervisor"],"phonetic":"/ˈbɔsɚ/","extraExplanation":["“Boser”在标准英语里不常见，很多时候是把“bosser”（/ˈbɔsɚ/，意为“爱使唤人的人/管事的人”）或“bossy”（形容词：爱指挥人的）拼错了。","如果你想表达“监督/工头”，更自然的说法是“supervisor”“manager”或“foreman”（更偏工地/工厂）。","如果你指的是某个专有名词（比如公司名、品牌、地名或人名），请给我一句上下文，我可以帮你判断具体含义。"]}
{"word":"boser","summary":{"en":"“boser” is usually a misspelling; most often it means “bosser” (a bossy person).","zh":"“boser”通常是拼写错误；最常见想表达的是“bosser”（爱指挥人的人）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard spelling: “boser” is not a common standard English word. It is most often a misspelling of “bosser” (a person who bosses others around) or “Bowser” (a proper name).","zh":"非标准拼写：“boser”不是常见的标准英语单词。它最常见的是把“bosser”（爱指挥/使唤别人的人）或专有名词“Bowser”拼错了。"},"examples":[{"en":"Did you mean “bosser”? He’s such a bosser at work.","zh":"你是不是想说“bosser”？他在工作中很爱指挥别人。"},{"en":"If you mean the Mario character, the spelling is “Bowser.”","zh":"如果你指的是马力欧里的角色，拼写是“Bowser”。"}]},{"partOfSpeech":"n.","definition":{"en":"bosser (noun): someone who gives orders in an unpleasant way; a bossy person.","zh":"bosser（名词）：以让人不舒服的方式发号施令的人；爱摆架子、爱使唤人的人。"},"examples":[{"en":"Stop being a bosser and let everyone share ideas.","zh":"别那么爱指挥，让大家都能提出想法。"},{"en":"She isn’t the manager, but she acts like a bosser.","zh":"她不是经理，但她表现得像个爱使唤人的人。"}]}],"synonyms":["bossy person","bully (informal)","backseat driver (in some contexts)"],"phonetic":"/ˈbɔsɚ/","extraExplanation":["“bosser”来自名词/动词“boss”（老板；指挥）。口语里更常见的形容词是“bossy”（爱指挥人的），例如：He’s so bossy.（他太爱指挥人了。）","如果你告诉我你看到“boser”的句子/语境（或是哪种语言环境），我可以更准确判断它到底想表达哪个词。"]}
{"word":"bosey","summary":{"en":"“Bosey” isn’t standard; it’s usually a misspelling of “boozy,” meaning slightly drunk or alcohol-related.","zh":"“bosey”不是标准用词，通常是“boozy”的拼写错误；“boozy”表示“微醺的”或“与酒有关的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling of “boozy.”","zh":"不是标准英文单词；最常见情况是把“boozy（微醉的／酒气重的）”拼错了。"},"examples":[{"en":"I couldn’t find “bosey” in a dictionary—did you mean “boozy”?","zh":"我在词典里找不到“bosey”——你是不是想写“boozy”？"}]},{"partOfSpeech":"adj.","definition":{"en":"(of a person) slightly drunk; having had alcohol.","zh":"（指人）微醺的；喝了酒有点醉的。"},"examples":[{"en":"He was a little boozy after the party, so he took a taxi home.","zh":"聚会后他有点微醺，所以打车回家了。"},{"en":"She sounded boozy on the phone and kept repeating herself.","zh":"她在电话里听起来像喝多了，一直在重复同样的话。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to alcohol; with the smell or atmosphere of drinking.","zh":"与酒精有关的；带酒味的／有喝酒氛围的。"},"examples":[{"en":"It’s a boozy comedy about friends who get into trouble on a night out.","zh":"这是一部带点“酒局”氛围的喜剧，讲朋友们夜生活惹出麻烦。"},{"en":"The bar had a warm, boozy feel.","zh":"那家酒吧有一种温暖又酒气弥漫的感觉。"}]}],"synonyms":["tipsy","buzzed","intoxicated","drunk"],"phonetic":"/ˈbuːzi/","extraExplanation":["“boozy”来自口语词“booze”（酒；喝酒）。日常表达里比“drunk”更轻一些，常带“有点醉/微醺”的意思，但也可能暗示“喝得不少”。","拼写小提示：boozy = boo + zy（两个 o），常见错误拼成 *bosey / boosey*。"]}
{"word":"bosh","summary":{"en":"“Bosh” means nonsense or foolish talk; it’s informal and often sounds a bit old-fashioned.","zh":"“bosh”表示“胡说、废话”，属于非正式表达，语感略显老派且带轻蔑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"nonsense; foolish talk or ideas that are not true or not useful.","zh":"胡说；废话；不切实际或不真实的说法。"},"examples":[{"en":"That’s a load of bosh—there’s no evidence for it.","zh":"那纯属胡说——根本没有证据。"},{"en":"Ignore his bosh and focus on the facts.","zh":"别理他的废话，专注于事实。"}]},{"partOfSpeech":"v.","definition":{"en":"to speak in a silly or untrue way; to talk nonsense (informal, less common).","zh":"胡扯；说胡话（非正式，用得较少）。"},"examples":[{"en":"He kept boshing about secret plans that didn’t exist.","zh":"他一直胡扯什么根本不存在的秘密计划。"}]}],"synonyms":["nonsense","rubbish","baloney","hogwash","bull"],"phonetic":"/bɑʃ/","extraExplanation":["“bosh”在英式英语里更常见，语气有点老派、带轻蔑，意思接近“nonsense / rubbish / baloney（美式更口语）”。","常见搭配：a load of bosh（满嘴胡说）、talk bosh（说废话）。在正式写作中较少用，更适合对话或带评价的表达。"]}
{"word":"Boshas","summary":{"en":"“Bosh” means “nonsense,” and it can also mean “to talk nonsense.”","zh":"“bosh”表示“胡说/废话”，也可作动词表示“胡说八道”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"nonsense; empty talk; something not true or not worth taking seriously.","zh":"胡说；废话；不可信或不值得当真的话/事。"},"examples":[{"en":"That’s bosh—show me some evidence.","zh":"那是胡扯——给我看点证据。"},{"en":"I’m tired of all the political bosh on TV.","zh":"我厌倦了电视上那些政治废话。"}]},{"partOfSpeech":"v.","definition":{"en":"to talk nonsense; to speak in a silly or untrue way.","zh":"胡说八道；说蠢话/不实的话。"},"examples":[{"en":"Stop boshing and tell me what really happened.","zh":"别胡扯了，告诉我到底发生了什么。"}]}],"synonyms":["nonsense","rubbish","baloney","hogwash","bull"],"phonetic":"/bɑʃ/","extraExplanation":["“bosh”是较口语、略老派的英式用法，语气通常带不耐烦或轻蔑，意思接近“nonsense / rubbish”。","词源来自土耳其语 boş（意为“空的、无用的”），经由19世纪英语传播。","你输入的“Boshas”并不是常见标准拼写；更常见的是“bosh”。如果你想表达复数，一般写作“boshes”也较少见，通常直接用“bosh”作不可数名词。"]}
{"word":"boshas","summary":{"en":"“Boshas” is likely a misspelling of “bosh,” meaning nonsense or foolish talk.","zh":"“boshas”很可能是“bosh”的误拼，意思是“胡说/废话”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(common spelling: “bosh”) nonsense; foolish talk or ideas.","zh":"（常见拼写：bosh）胡说；废话；无稽之谈。"},"examples":[{"en":"That’s pure bosh—there’s no evidence.","zh":"那纯属胡说——没有证据。"},{"en":"Ignore his bosh and focus on the facts.","zh":"别理他的废话，专注于事实。"}]},{"partOfSpeech":"v.","definition":{"en":"To talk nonsense; to dismiss something as nonsense.","zh":"胡说八道；把某事斥为无稽之谈。"},"examples":[{"en":"He kept boshing about how he could win easily.","zh":"他一直在胡吹自己能轻松获胜。"},{"en":"Don’t bosh my concerns—I’m serious.","zh":"别把我的担忧当成胡说——我是认真的。"}]},{"partOfSpeech":"int.","definition":{"en":"An exclamation meaning “nonsense!” (old-fashioned).","zh":"（较老派用法）表示“胡说！”“荒唐！”的感叹词。"},"examples":[{"en":"“Bosh!” she said, and walked away.","zh":"“胡说！”她说完就走开了。"}]}],"synonyms":["nonsense","rubbish","baloney","hogwash","claptrap"],"phonetic":"/bɑʃ/","extraExplanation":["“boshas”不是常见英文拼写。你可能想查的是“bosh”（意为“胡说/废话”）。其复数通常写作“boshes”。","“bosh”带一点老派、书面或带讽刺的语气；日常口语里更常用“nonsense”“rubbish”“BS”（后者较粗口，注意场合）。"]}
{"word":"boshbok","summary":{"en":"“Boshbok” usually refers to the bushbuck (also called bosbok), a southern African antelope; the standard English word is “bushbuck.”","zh":"“boshbok”通常指灌木羚（也称bosbok），是一种南部非洲羚羊；标准英语更常用“bushbuck”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a southern African antelope (the bushbuck); “boshbok” is a misspelling/variant sometimes seen for Afrikaans “bosbok.”","zh":"（南部非洲的一种羚羊）灌木羚（bushbuck）；“boshbok”常见为南非荷兰语“bosbok”的误拼/变体。"},"examples":[{"en":"We spotted a bushbuck (bosbok) near the edge of the forest.","zh":"我们在森林边缘看见了一只灌木羚（bosbok）。"},{"en":"The guide said “bosbok” is the local word for bushbuck.","zh":"导游说“bosbok”是当地对灌木羚的称呼。"}]}],"synonyms":["bushbuck","bosbok"],"phonetic":"ˈbʊʃˌbʌk","extraExplanation":["“bosbok”来自南非荷兰语（Afrikaans）：bos=灌木/林地，bok=羚羊/山羊一类的动物，因此字面意思接近“灌木里的羚羊”。英语里更常用的标准词是“bushbuck”。","如果你想查的其实是英语单词“bosh”（意思是“胡说、废话”），请告诉我上下文句子，我可以帮你确认。"]}
{"word":"boshboks","summary":{"en":"A boombox is a portable stereo, often associated with loud street music culture.","zh":"boombox 指便携式立体声音响，常与大声外放的街头音乐文化相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large portable stereo (radio + cassette/CD/other player), often played loudly in public","zh":"（常指声音很大、可携带的）手提音响/便携式立体声音响（可含收音机与磁带/CD等播放功能）"},"examples":[{"en":"He carried a boombox on his shoulder and played hip-hop in the park.","zh":"他把手提音响扛在肩上，在公园里放嘻哈音乐。"},{"en":"In the 1980s, boomboxes were a popular symbol of street music culture.","zh":"在20世纪80年代，手提音响是街头音乐文化的常见象征。"}]}],"synonyms":["portable stereo","portable radio","ghetto blaster (BrE, informal)"],"phonetic":"/ˈbuːmˌbɑːks/","extraExplanation":["“boshboks”通常不是标准英语拼写；你可能想写的是 **boombox**。","**Boombox** 与 1970s–1990s 的城市街头文化关系密切，常出现在关于嘻哈（hip-hop）、霹雳舞（breakdancing）等题材的电影与音乐叙述里。","语体提醒：boombox 带有复古、口语色彩；更中性/现代的说法可以用 **portable speaker**（便携音箱）或 **portable stereo**（便携立体声）。"]}
{"word":"bosher","summary":{"en":"“Bosher” is mainly UK slang for a big, strong person; less commonly it can mean something excellent.","zh":"“bosher”主要是英式俚语，指强壮魁梧的人；较少情况下也可表示“很棒”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, chiefly UK) A big, strong person—especially someone who uses physical strength in sport or work.","zh":"（非正式，主要英式）强壮魁梧的人；常指在运动或体力工作中靠力量的人。"},"examples":[{"en":"They needed a couple of big boshers in the scrum.","zh":"他们在争球堆里需要几个强壮的“硬汉”。"},{"en":"He’s a real bosher—great at moving heavy furniture.","zh":"他真是个壮汉——搬重家具特别在行。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal, less common, chiefly UK) Something or someone excellent; very good.","zh":"（非正式，较少见，主要英式）很棒的事物或人；非常好。"},"examples":[{"en":"That new track is a bosher.","zh":"那首新歌太棒了。"},{"en":"Your presentation was a bosher—really clear.","zh":"你的展示很棒——非常清晰。"}]},{"partOfSpeech":"other","definition":{"en":"A family name (surname).","zh":"姓氏。"},"examples":[{"en":"Ms. Bosher will lead the meeting today.","zh":"Bosher 女士今天将主持会议。"}]}],"synonyms":["bruiser","big guy","strongman","heavyweight"],"phonetic":"/ˈbɑːʃər/","extraExplanation":["“bosher”多见于英国口语，尤其在体育语境里（例如橄榄球）形容“块头大、对抗强”的人。在美式英语里不常用，换成更常见的说法可以用 big guy, bruiser, strongman 等。"]}
{"word":"boshes","summary":{"en":"“Boshes” is the plural of “bosh” (nonsense) or the third-person singular of the verb “bosh” (to talk/dismiss as nonsense).","zh":"“boshes”是“bosh（废话/胡说）”的复数，或动词“bosh（胡扯/斥为胡说）”的第三人称单数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"nonsense; empty or silly talk or ideas","zh":"胡说八道；废话；无稽之谈"},"examples":[{"en":"That’s bosh—show me the evidence.","zh":"那是胡说——把证据拿出来。"},{"en":"Don’t fill the report with bosh; keep it clear and factual.","zh":"报告别写满废话；要清晰、基于事实。"}]},{"partOfSpeech":"v.","definition":{"en":"to talk nonsense; to dismiss something as nonsense (often used informally or as “bosh!”)","zh":"说胡话；（常口语）把某事斥为胡说（也可用作感叹“胡扯！”）"},"examples":[{"en":"He kept boshing on about secret plots.","zh":"他一直在胡扯什么秘密阴谋。"},{"en":"“Bosh!” she said, refusing to believe the rumor.","zh":"“胡扯！”她说，不肯相信那个谣言。"}]}],"synonyms":["nonsense","rubbish","baloney","hogwash","twaddle"],"phonetic":"/bɑʃ/","extraExplanation":["“boshes”通常是名词bosh的复数（很多“废话/胡说”），或动词bosh的第三人称单数（he/she/it boshes）。","词源上，bosh来自土耳其语“boş”，意思是“空的、无价值的”。在英语里常带一点老派/文学感，用来有力地否定某种说法。","在较老的英语写作中你可能会看到类似表达，如“Bosh!”用来表示强烈的“不可能/别胡扯”。"]}
{"word":"Boshongo","summary":{"en":"Boshongo refers mainly to a people within the Kuba Kingdom of the D.R. Congo, and sometimes to their language variety.","zh":"Boshongo 主要指刚果（金）库巴王国中的博尚戈族群，有时也指其相关语言。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Boshongo (also spelled Bushongo), a Central African people who are a major group within the Kuba Kingdom in what is now the Democratic Republic of the Congo.","zh":"博尚戈人（也常拼作 Bushongo），中非民族之一，是刚果民主共和国库巴王国（Kuba Kingdom）中的主要族群。"},"examples":[{"en":"The museum’s collection includes Boshongo textiles from the Kuba Kingdom.","zh":"这家博物馆的藏品包括来自库巴王国的博尚戈纺织品。"},{"en":"The Boshongo are often discussed in studies of Central African art and kingship.","zh":"在关于中非艺术与王权的研究中，人们常会讨论博尚戈人。"}]},{"partOfSpeech":"n.","definition":{"en":"the variety of language associated with the Boshongo people (often described within the broader cluster of Kuba languages).","zh":"与博尚戈人相关的语言（通常被视为更广义“库巴诸语言”中的一种/一支）。"},"examples":[{"en":"Some sources mention Boshongo when describing Kuba languages in the region.","zh":"有些资料在介绍当地的库巴诸语言时会提到“Boshongo”。"}]}],"synonyms":["Bushongo"],"phonetic":"/boʊˈʃɑːŋɡoʊ/","extraExplanation":["“Boshongo”多见于人类学、非洲史与艺术史语境，常与“Kuba Kingdom（库巴王国）”一起出现；库巴以精美的织物、面具与宫廷艺术闻名。","拼写上常见变体为“Bushongo”。不同学术资料对其作为“族群名称”或“语言名称”的范围划分可能略有差异，阅读资料时可留意作者的定义。"]}
{"word":"boshvark","summary":{"en":"“Boshvark” means a bushpig (a wild pig), mainly used in South African contexts.","zh":"“boshvark”指丛林猪（一种野猪），主要用于南非相关语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South African English, from Afrikaans) a bushpig; a wild pig found in parts of sub-Saharan Africa.","zh":"（南非英语，源自南非荷兰语 Afrikaans）丛林猪；分布于撒哈拉以南非洲部分地区的一种野猪。"},"examples":[{"en":"We spotted a boshvark near the river at dusk.","zh":"黄昏时我们在河边看到一只丛林猪（boshvark）。"},{"en":"The farmer put up stronger fencing to keep boshvarks out of the crops.","zh":"农夫加固了围栏，防止丛林猪（boshvark）破坏庄稼。"}]}],"synonyms":["bushpig","wild pig"],"phonetic":"/ˈbɑʃvɑrk/","extraExplanation":["“boshvark”常见于南部非洲语境，来自南非荷兰语：bosh（灌木丛/丛林）+ vark（猪）。在更通用的英语里，通常说“bushpig”。","拼写上有时也会见到“boschvark/bošvark”等变体；在旅行、狩猎或自然纪录片语境里更常出现。"]}
{"word":"boshvarks","summary":{"en":"“boshvarks” isn’t a standard English word; it most likely refers to “aardvarks” (plural of aardvark), an African ant-eating mammal.","zh":"“boshvarks”不是标准英文单词；最可能是指“aardvarks”（aardvark 的复数），一种生活在非洲、以蚂蚁/白蚁为食的哺乳动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended) an aardvark: a nocturnal African mammal with a long snout that eats ants and termites.","zh":"（可能想表达的词）土豚：一种生活在非洲、夜行性的哺乳动物，口鼻部很长，主要吃蚂蚁和白蚁。"},"examples":[{"en":"An aardvark uses its long tongue to eat termites.","zh":"土豚用它的长舌头吃白蚁。"},{"en":"Aardvarks are mostly active at night.","zh":"土豚大多在夜间活动。"}]}],"synonyms":["anteater (similar idea, but a different animal)"],"phonetic":"/ˈɑrdˌvɑrk/","extraExplanation":["“boshvarks”不是常见英文单词，也不像标准拼写。最接近、最常见的可能是 **aardvarks**（aardvark 的复数），中文常译为“土豚”。","**aardvark** 来自南非荷兰语/南非语，意思大致是“土猪”（aard = 土；vark = 猪），因此中文译名“土豚”也带有“土里生活的动物”的感觉。","如果你本来想查的是别的词（比如人名、游戏/作品里的专有名词），告诉我它出现的句子或上下文，我可以更准确判断。"]}
{"word":"BOSIX","summary":{"en":"BOSIX is a UNIX-like interface standard meant to improve cross-system compatibility.","zh":"BOSIX 指类 UNIX 的接口标准，用来提升跨系统兼容性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a set of UNIX-like operating system interface standards (system calls, commands, and utilities), used to improve software compatibility across different systems","zh":"一套类 UNIX 操作系统接口标准（如系统调用、命令与工具），用于提高软件在不同系统之间的兼容性"},"examples":[{"en":"This tool targets BOSIX compliance so it can run on several UNIX variants.","zh":"这个工具以符合 BOSIX 为目标，因此可以在多种 UNIX 变体上运行。"},{"en":"The documentation lists which functions are BOSIX/POSIX compatible.","zh":"文档列出了哪些函数与 BOSIX/POSIX 兼容。"}]}],"synonyms":["POSIX","UNIX standard","UNIX-like interface standard"],"phonetic":"/ˈboʊsɪks/","extraExplanation":["BOSIX 常被视为与 POSIX 相关的一类“类 UNIX 接口规范”表述；在实际工程与文档中，更常见、更正式的名称通常是 POSIX（由 IEEE 制定）。","读到“BOSIX compliant / compatible”时，一般是在强调：程序尽量只使用标准化的系统调用与命令，从而减少对某个特定 UNIX 发行版或厂商扩展的依赖。","发音上很多人把它当作一个词读作“BOH-siks”（见下方音标），也有人逐字母读；两种在口语里都可能出现。"]}
{"word":"Bosjesman","summary":{"en":"“Bosjesman” is an older term for the San people of southern Africa and can be considered offensive today; “San” is usually preferred.","zh":"“Bosjesman”是对非洲南部桑人（San）的旧称，现今可能带冒犯性；通常更建议用“San”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person belonging to the San indigenous peoples of southern Africa; an older term (from Afrikaans/Dutch) that is often considered outdated or offensive today.","zh":"（指非洲南部的）桑人/桑族（San）成员；源自南非荷兰语/荷兰语的旧称，现今常被认为过时或带冒犯性。"},"examples":[{"en":"Some older books use the word “Bosjesman,” but many writers today prefer “San.”","zh":"一些较旧的书会用“Bosjesman”，但如今很多作者更倾向用“San（桑人）”。"},{"en":"The museum updated its labels to use respectful names for the San people.","zh":"博物馆更新了说明牌，改用对桑人更尊重的称呼。"}]}],"synonyms":["San","Bushman (often considered outdated/offensive)"],"phonetic":"/ˈbɑs.yəs.mən/","extraExplanation":["“Bosjesman”来自南非荷兰语/荷兰语，字面与“森林/灌木丛里的人”相关，历史上在殖民语境中常带有刻板印象与贬义色彩。","在当代英语写作中，谈到该族群通常更建议使用他们更常见、较中性的自称/通称：San（或更具体的族群名称）。如果在引用旧文献或历史材料时必须出现该词，常会加引号并说明其历史性与可能的冒犯性。"]}
{"word":"bosjesman","summary":{"en":"“Bosjesman” is a Dutch/Afrikaans term for the San people; it is often considered outdated and may be offensive today.","zh":"“bosjesman”是荷兰语/南非荷兰语中对桑人（San）的旧称；如今常被视为过时，且可能带有冒犯性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Africa; Dutch/Afrikaans) an older term for the San, Indigenous hunter-gatherer peoples of southern Africa; today it is often considered outdated and can be offensive in some contexts.","zh":"（南部非洲；荷兰语/南非荷兰语）对南部非洲桑人（San，南部非洲原住民狩猎采集群体）的旧称；如今常被视为过时，在某些语境中可能带有冒犯性。"},"examples":[{"en":"Some older books use the word “bosjesman,” but many people now prefer “San people.”","zh":"一些旧书会用“bosjesman”，但如今很多人更倾向于说“San people（桑人）”。"},{"en":"The museum updated its labels to use more respectful wording when describing the San.","zh":"博物馆更新了说明牌，用更尊重的措辞来介绍桑人。"}]}],"synonyms":["San (preferred)","Bushman (dated)"],"phonetic":"/ˈbɑʃjəzˌmɑn/","extraExplanation":["“bosjesman”字面含义接近“灌木丛里的人/森林里的人”，对应英语旧称“Bushman”。在现代学术与公共语境中，更常用且更尊重的说法是“San（people）”。","是否冒犯取决于地区、语气和使用者身份：有时在历史文本或引用旧称时出现，但在当代日常描述中建议避免使用，以免带来贬义或刻板印象。"]}
{"word":"bosk","summary":{"en":"“Bosk” means “wooded” and is mostly literary or old-fashioned.","zh":"“bosk”意为“林木茂密的”，多用于文学或较古雅的表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Wooded; covered with trees or shrubs (often used in poetic or literary descriptions).","zh":"林木茂密的；长满树木或灌木的（常见于诗歌或文学描写）。"},"examples":[{"en":"They walked through the bosk hillside just before sunset.","zh":"日落前，他们走过那片林木葱郁的山坡。"},{"en":"A small cottage sat beside a bosk lane.","zh":"一间小屋坐落在一条树木繁茂的小路旁。"}]}],"synonyms":["wooded","forested","leafy","tree-covered"],"phonetic":"/bɑsk/","extraExplanation":["“bosk”在现代英语中较少见，带有古雅、文学/诗意的色彩，常用来营造“幽林、密林”的氛围。","它与“boscage”（树丛、林地景色）有关；在描写自然风光、田园或浪漫主义风格文本中更可能出现。"]}
{"word":"boskage","summary":{"en":"Boskage means a wooded thicket or, in art, a dense cluster of trees—mainly used in literary or old-fashioned contexts.","zh":"Boskage 指林地/灌木丛，也可指绘画中的成片树丛背景；多见于文学或较古典的语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wooded area; a thicket or group of trees and bushes (often used in literary or old-fashioned style).","zh":"林地；灌木丛；一片树木与灌木（常见于文学或较古典的用法）。"},"examples":[{"en":"We picnicked near the boskage where the air felt cooler and damp.","zh":"我们在那片林地旁野餐，那里的空气更凉爽也更潮湿。"},{"en":"In the poem, birds sing from the boskage at dawn.","zh":"在诗里，黎明时分鸟儿从林间鸣唱。"}]},{"partOfSpeech":"n.","definition":{"en":"in art (especially landscape painting), a mass or cluster of trees and foliage forming a shaded background.","zh":"（尤指风景画中的）树丛景；成片树木与枝叶构成的阴影背景。"},"examples":[{"en":"The painter placed a dark boskage behind the figures to make them stand out.","zh":"画家在人物背后画上一片深色树丛背景，使人物更突出。"},{"en":"The landscape’s distant boskage creates a sense of depth.","zh":"远处的树丛景让画面更有纵深感。"}]}],"synonyms":["thicket","woodland","copse","grove","brushwood"],"phonetic":"/ˈbɑskɪdʒ/","extraExplanation":["“boskage”较少用于日常口语，更常出现在诗歌、古典散文或对自然景色的描写中，带有一种“林间幽深、葱郁”的审美氛围。","词源上与法语/意大利语中表示“树林、灌木丛”的词有关；在英语里常让人联想到田园文学（pastoral）或浪漫主义自然描写。"]}
{"word":"boskages","summary":{"en":"“Boskages” means wooded thickets or small groves, usually in literary or old-fashioned writing.","zh":"“boskages”指林地、灌木丛或小树林，常见于文学或较古旧的写法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Wooded areas; thickets or small groves (a literary or old-fashioned plural of “boskage”).","zh":"林地；灌木丛或小树林（“boskage”的复数，偏文学/古旧用法）。"},"examples":[{"en":"Deer slipped quietly through the boskages at dawn.","zh":"黎明时分，鹿悄悄穿过那片片林丛。"},{"en":"The poem describes birdsong rising from shadowy boskages.","zh":"诗中写到鸟鸣从幽暗的林间灌丛里升起。"}]},{"partOfSpeech":"n.","definition":{"en":"In art or landscape description: masses of trees or shrubbery used as scenic background (plural).","zh":"（艺术/景观描写）成片的树木或灌木背景（复数）。"},"examples":[{"en":"The painter framed the distant castle with dark boskages.","zh":"画家用深色的树丛把远处的城堡框了起来。"}]}],"synonyms":["woods","woodland","thickets","groves","brush"],"phonetic":"/ˈbɑːskɪdʒ/","extraExplanation":["“boskages”来自“boskage”，多见于诗歌、古典散文或风景描写里，日常英语更常说“woods / woodland / thicket / grove”。","词源可追溯到古法语（与表示“树林/灌木丛”的词根相关），因此带有一种古雅、田园或浪漫的文学气息。"]}
{"word":"bosker","summary":{"en":"Bosker is an informal Irish-English word meaning “very good/excellent,” and it can also be a surname.","zh":"Bosker在爱尔兰英语口语中表示“很棒/极好”，也可作姓氏。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Irish English, informal) very good; excellent; fine.","zh":"（爱尔兰英语，非正式）很棒的；极好的；不错的。"},"examples":[{"en":"That new café is bosker—let’s go again this weekend.","zh":"那家新咖啡馆很bosker（很棒）——这周末我们再去吧。"},{"en":"The weather’s bosker today compared with yesterday.","zh":"跟昨天比，今天的天气真不错。"}]},{"partOfSpeech":"n.","definition":{"en":"a person’s surname (family name).","zh":"人名：姓氏（Bosker）。"},"examples":[{"en":"Dr. Bosker will see you at 3 p.m.","zh":"Bosker医生会在下午三点见你。"}]}],"synonyms":["great","excellent","brilliant","lovely","grand"],"phonetic":"/ˈbɑskɚ/","extraExplanation":["“bosker”多见于爱尔兰口语/方言（Hiberno-English），在日常对话里相当于“great / brilliant / lovely / grand（都挺好、很棒）”。在美国或英国主流英语中不算常见，使用时带有明显的地域色彩。","它常用于评价事物或状态（天气、食物、体验），“That’s bosker.”≈“That’s great.”；通常不用于正式写作。"]}
{"word":"bosket","summary":{"en":"Bosket means a small grove or thicket, especially in literary or formal garden descriptions.","zh":"Bosket 指小树林或灌木丛，常见于文学描写或正式园林语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small wooded area; a grove or thicket (often used in literary or old-fashioned writing).","zh":"（多为文学或旧式用法）小树林；灌木丛；林地小块"},"examples":[{"en":"They rested in a bosket to escape the afternoon heat.","zh":"他们在一片小树林里休息，躲避午后的炎热。"},{"en":"In the poem, lovers meet in a quiet bosket beside the river.","zh":"在这首诗里，恋人们在河边安静的小树林中相会。"}]},{"partOfSpeech":"n.","definition":{"en":"in formal gardening, a carefully planted small grove or cluster of trees (a designed landscape feature).","zh":"（园林用语）人工规划种植的一小片树丛；景观林丛"},"examples":[{"en":"The path leads to a bosket arranged to frame the view of the fountain.","zh":"小径通向一片经过设计的树丛，用来衬托喷泉的景致。"},{"en":"The estate’s boskets were trimmed to create a sense of order.","zh":"庄园里的景观林丛被修剪得很整齐，营造出秩序感。"}]}],"synonyms":["grove","thicket","small wood","copse","woodlot"],"phonetic":"/ˈbɑskɪt/","extraExplanation":["“bosket”主要见于较老的英语或诗歌、园林描写中；现代英语更常用“grove / thicket / small wood”。","词源来自法语“bosquet”（小树林），在欧洲古典园林语境里常指“经过规划的树丛/林丛”，带有审美与设计意味。"]}
{"word":"boskets","summary":{"en":"“Boskets” means small groves or planted wooded areas, often in gardens or parks (plural).","zh":"“boskets”指小树林/树丛（复数），常见于花园或公园等景观描写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of bosket) a small grove or thicket of trees, especially one planted as a decorative feature in a garden or park.","zh":"（bosket 的复数）小树林、树丛；尤指花园或公园里为装饰而栽种的一片林地。"},"examples":[{"en":"The mansion’s gardens had several boskets where visitors could walk in the shade.","zh":"庄园的花园里有几处小树林，游客可以在树荫下散步。"},{"en":"They met at the edge of the boskets, away from the noisy fountain.","zh":"他们在小树林边缘见面，远离喧闹的喷泉。"}]}],"synonyms":["groves","thickets","copses","woodlots (small)"],"phonetic":"/ˈbɑs.kɪts/","extraExplanation":["“bosket”是较古雅/文学色彩的词，常见于描写园林或古典景观的英文中；更常用的日常说法是“small grove”“wooded grove”或“thicket”。","它与法语“bosquet”（常指修剪成形的花园林荫区）有关，因此在谈到欧洲古典园林时更容易看到这个词。"]}
{"word":"boskier","summary":{"en":"“Boskier” means “more wooded or more shaded by trees” (comparative of bosky).","zh":"“boskier”意为“更林木葱郁/更有树荫的”，是“bosky”的比较级。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"More bosky; more thickly wooded, leafy, or shaded by trees.","zh":"更树木繁茂的；更林木葱郁/更阴凉的（比较级）。"},"examples":[{"en":"We took the boskier path along the river, where the trees blocked the sun.","zh":"我们走了河边更林荫的那条路，树木把阳光都挡住了。"},{"en":"As we climbed higher, the valley looked greener and boskier.","zh":"我们爬得更高时，山谷看起来更绿、更林木葱郁。"}]}],"synonyms":["more wooded","leafier","shadier","more tree-covered"],"phonetic":"/ˈbɑskiər/","extraExplanation":["“boskier”是形容词“bosky”的比较级，意思是“更像树林一样阴凉/多树的”。“bosky”在文学描写自然风景时较常见，日常英语里更常用“wooded / leafy / shady”。","词源上与“boscage/bosque”（树林、林地）有关，在诗歌或带古典色彩的散文中能营造“幽静林荫”的画面感。"]}
{"word":"boskiest","summary":{"en":"“Boskiest” means the most wooded or shadiest (a literary way to describe a place full of trees).","zh":"“boskiest”指“最林木茂密/最阴凉的”（较文学化的说法，用来描写树木很多的地方）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Superlative of “bosky”) most wooded or covered with trees; shadiest in a pleasantly natural way.","zh":"（bosky 的最高级）最林木茂密的；最阴凉、带有自然野趣的。"},"examples":[{"en":"We picnicked in the boskiest part of the park, where the trees blocked the sun.","zh":"我们在公园里最林木葱郁的地方野餐，那儿树荫把太阳挡住了。"},{"en":"The trail gets cooler as you move into the boskiest section of the valley.","zh":"当你走进山谷里最阴凉茂密的那一段时，小径会变得更凉快。"}]}],"synonyms":["most wooded","leafiest","shadiest","most tree-covered"],"phonetic":"/ˈbɑskiɪst/","extraExplanation":["“bosky”比较偏文学、诗意用法，现代日常英语更常说“wooded / leafy / shady”。“boskiest”因此也多见于描写风景的写作或较文艺的语境中。","在文学里，“bosky”常用来营造一种清凉、幽深、树木遮蔽的氛围（比如描写林间小径、山谷、溪边树林等）。"]}
{"word":"boskiness","summary":{"en":"Boskiness means a pleasantly wooded, shady quality—being full of trees (often poetic).","zh":"Boskiness 指“林木葱郁、绿荫成林”的特质，常用于带诗意的自然描写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being covered with trees; pleasantly wooded and shady (often in a poetic or literary style)","zh":"树木繁茂、林木葱郁的特质；（常带诗意/文学色彩的）绿荫成林、阴凉宜人的感觉"},"examples":[{"en":"The boskiness of the valley made it feel cool even at noon.","zh":"山谷里林木葱郁，即使正午也让人觉得凉爽。"},{"en":"She loved the boskiness around the lake, where tall trees shaded the path.","zh":"她喜欢湖边的树荫繁盛，高大的树木遮蔽着小路。"}]}],"synonyms":["woodedness","leafiness","tree cover","shadiness"],"phonetic":"/ˈbɑskinəs/","extraExplanation":["“boskiness”来自形容词“bosky”，意思是“树木繁茂的、林地般的”。这个词带有明显的文学/诗歌气质，在日常口语里更常用“wooded / leafy / tree-covered”。","在描写自然风景的文学语境中，“boskiness”常用来强调一种“幽深、清凉、被树荫包裹”的氛围，而不仅仅是“有树”。"]}
{"word":"Boskop","summary":{"en":"Boskop is a South African place name best known from a 1913 skull discovery; “Boskop (Man)” is a historical label now generally avoided.","zh":"Boskop是南非地名，因1913年头骨发现而知名；“Boskop（人）”是较旧的称呼，如今多被避免使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place in South Africa (near Pretoria) known in archaeology/paleoanthropology as the site where an early modern human skull was found in 1913.","zh":"南非的一个地名（靠近比勒陀利亚），在考古学/古人类学中因1913年发现一具早期现代人类头骨而知名。"},"examples":[{"en":"Researchers refer to Boskop when discussing early 20th-century skull discoveries in South Africa.","zh":"研究者在讨论南非20世纪早期的头骨发现时会提到Boskop。"},{"en":"The Boskop site became famous after a skull was uncovered there in 1913.","zh":"Boskop遗址因1913年出土头骨而出名。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical, often avoided today) shorthand for “Boskop Man,” a name once used for human remains found at Boskop; now generally treated as early modern Homo sapiens rather than a separate “type.”","zh":"（历史用法，现多避免）“Boskop人”的简称，曾用于指代在Boskop发现的人类遗骸；现通常视为早期现代智人，而非独立“类型”。"},"examples":[{"en":"Older books sometimes mention “Boskop” as if it were a distinct human group.","zh":"较早的书籍有时会把“Boskop”当作一个独立的人类群体来提及。"},{"en":"Modern sources usually avoid the term “Boskop Man” and describe the remains more neutrally.","zh":"现代资料通常避免使用“Boskop人”这一说法，而用更中性的方式描述这些遗骸。"}]}],"synonyms":["Boskop site","Boskop skull","Boskop Man (historical)"],"phonetic":"ˈbɔsˌkɑp","extraExplanation":["“Boskop Man（Boskop人）”这一说法在20世纪早期曾被用来进行带有推测性的分类，有时还被牵扯到不严谨甚至带偏见的论述。如今学界更倾向于用可检验的解剖学描述与年代信息来讨论这些遗骸，而不是把它们当作一个独立的“人种/类型”。"]}
{"word":"boskopoid","summary":{"en":"“Boskopoid” is a dated anthropology term for the supposed “Boskop” human type; it’s now considered scientifically outdated and often avoided.","zh":"“Boskopoid”是人类学里对所谓“博斯科普型”的旧称；如今被认为缺乏科学依据且常被避免使用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anthropology, dated) Relating to or describing the “Boskop” type—an old, now-discredited racial/physical classification based on human skull remains found in South Africa.","zh":"（人类学，旧称）与“博斯科普型（Boskop）”有关的；一种已被否定的旧式人种/体质分类说法，源自南非发现的人类头骨遗骸。"},"examples":[{"en":"Older anthropology books sometimes used the word “Boskopoid,” but modern research avoids it.","zh":"一些早期的人类学书里会用“Boskopoid”，但现代研究通常避免使用。"},{"en":"The article was criticized for describing people with outdated terms like “Boskopoid.”","zh":"那篇文章因使用“Boskopoid”等过时用语来描述人群而受到批评。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare; dated) A person claimed to belong to the “Boskop” type (an outdated classification).","zh":"（罕见；旧称）被认为属于“博斯科普型”的人（过时分类）。"},"examples":[{"en":"In that early 20th-century text, the author speculated about “Boskopoids” in southern Africa.","zh":"在那本20世纪早期的著作里，作者推测南部非洲存在所谓的“Boskopoids”。"}]}],"synonyms":["Boskop (dated)","Boskop Man (historical term)","(neutral alternatives) early Homo sapiens remains","human remains from South Africa"],"phonetic":"ˈbɑs.kəˌpɔɪd","extraExplanation":["“Boskopoid”来自旧式体质人类学（把人按头骨、身高等外形特征分“类型”）。这种分法与当代人类遗传学、考古学观点不一致，也容易被用于种族主义叙事，因此在学术写作中通常被视为过时甚至不当。","如果你是在现代语境中写作，通常更合适的说法是具体指“南非某遗址发现的早期智人（early Homo sapiens）遗骸/头骨”，或直接提到“Boskop Man（博斯科普人，历史称呼）”并说明该术语已不再被接受。"]}
{"word":"bosks","summary":{"en":"“Bosks” is the literary plural of “bosk,” meaning small wooded areas or thickets.","zh":"“bosks”是文学用语中“bosk”的复数，指小片林地或灌木丛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of “bosk”) wooded areas; thickets; small groves (literary/old-fashioned).","zh":"（“bosk”的复数）林地；灌木丛；小树林（文学用语/较古老）。"},"examples":[{"en":"In the old poem, travelers rest in the cool bosks beside the river.","zh":"在那首旧诗里，旅人们在河边清凉的林地里歇息。"},{"en":"Birdsong rose from the shadowy bosks at dawn.","zh":"黎明时，鸟鸣从幽暗的树林里传来。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) wooded; covered with trees (used like “bosky”).","zh":"（罕见）多树的；树林覆盖的（用法类似“bosky”）。"},"examples":[{"en":"They walked along a bosk hillside in the late afternoon light.","zh":"他们在傍晚的光里沿着一座林木葱郁的山坡行走。"}]}],"synonyms":["woods","woodland","groves","thickets","copse"],"phonetic":"/bɑsk/","extraExplanation":["“bosk / bosks”比较少见，常出现在诗歌、浪漫主义或仿古风格的描写里，用来营造“幽静、自然、带点古典气息的树林”意象。日常英语更常用：woods, woodland, grove, thicket。","相关词：bosky（更常见的形容词，意为“树木繁茂的/林阴浓密的”）。"]}
{"word":"bosky","summary":{"en":"Bosky is a literary adjective meaning wooded, bushy, and pleasantly shady.","zh":"Bosky 是一个偏文学的形容词，意思是“树木/灌木繁茂、阴凉的（林地般的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Literary) covered with bushes or trees; wooded and pleasantly shady.","zh":"（文学用语）灌木丛生的；树木繁茂的；阴凉幽暗的（多指林地/小径等）。"},"examples":[{"en":"They walked along a bosky path beside the stream.","zh":"他们沿着溪边一条树木繁茂、阴凉的小路散步。"},{"en":"The cottage was hidden in a bosky corner of the valley.","zh":"小屋藏在山谷里一处林木葱郁的角落。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Literary) having a rustic, woodland feel; suggestive of the countryside.","zh":"（文学用语）带有乡野林地气息的；有自然、田园意味的。"},"examples":[{"en":"The poem describes a bosky landscape far from the city.","zh":"这首诗描写了远离城市的田园林地风光。"}]}],"synonyms":["wooded","leafy","shady","brushy","verdant"],"phonetic":"/ˈbɑski/","extraExplanation":["“bosky”较为少见，常见于诗歌、小说等文学描写中，用来营造“树荫浓密、带点神秘与清凉”的氛围。","词源上与法语/拉丁语中表示“树林（wood）”的词有关；在现代日常英语里更常用的替代说法有“wooded”“leafy”“shady”。"]}
{"word":"Bosler","summary":{"en":"“Bosler” is most commonly a family name; it can also be a U.S. place name.","zh":"“Bosler”最常见是英文姓氏；也可能是美国的地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name).","zh":"姓氏（家族姓）。"},"examples":[{"en":"Ms. Bosler will lead today’s meeting.","zh":"Bosler 女士将主持今天的会议。"},{"en":"My professor’s last name is Bosler.","zh":"我教授的姓是 Bosler。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name (e.g., a small community called Bosler in the U.S.).","zh":"地名（例如美国有名为 Bosler 的小社区）。"},"examples":[{"en":"They drove through Bosler on their way across Wyoming.","zh":"他们穿过 Bosler，继续横穿怀俄明州。"}]}],"phonetic":"/ˈbɑzlər/","extraExplanation":["“Bosler”更常见于英语语境中的姓氏，因此在写作里通常首字母大写。","作为姓氏时，一般不翻译成固定中文词义，而是按音译或保留原拼写，取决于个人或家族的偏好。"]}
{"word":"bosm","summary":{"en":"“Bosom” means the chest (literary/old-fashioned), and it can also mean a very close friend or an intimate/private relationship.","zh":"“Bosom”指（文学/较古旧用法的）胸膛，也可指知心朋友或亲密、私密的关系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the chest (the front of the body between the neck and the stomach), often used in a literary or old-fashioned way","zh":"（常用于文学或较古旧用法）胸部；胸膛（指颈部与腹部之间的身体前部）"},"examples":[{"en":"She held the child close to her bosom.","zh":"她把孩子紧紧抱在胸前。"},{"en":"He pressed the letter to his bosom and sighed.","zh":"他把信按在胸口，叹了口气。"}]},{"partOfSpeech":"n.","definition":{"en":"a very close, trusted relationship or friend (especially in older/literary English)","zh":"（尤指较古旧/文学用法）知心朋友；亲密关系"},"examples":[{"en":"They were bosom friends in college.","zh":"他们在大学里是知心好友。"},{"en":"She shared the news only with her bosom companion.","zh":"她只把这个消息告诉了最亲密的同伴。"}]},{"partOfSpeech":"adj.","definition":{"en":"very close and private; intimate (often used before a noun)","zh":"亲密的；私人的（常作定语）"},"examples":[{"en":"They had a bosom talk about their worries.","zh":"他们进行了一次推心置腹的谈话。"},{"en":"He was invited into the bosom circle of the family.","zh":"他被邀请进入这个家庭最亲近的圈子。"}]},{"partOfSpeech":"vt.","definition":{"en":"to hold someone/something close; to keep close in one’s heart (rare, literary)","zh":"（罕见，文学用法）怀抱；把……珍藏于心"},"examples":[{"en":"She bosomed the secret for years.","zh":"她把这个秘密珍藏在心里多年。"}]}],"synonyms":["chest","breast","close","intimate","confidant","close friend"],"phonetic":"/ˈbʊzəm/","extraExplanation":["“bosm”本身不是常见英语单词，最可能是拼写简写或打字错误，通常你想查的是 **bosom**。","在现代英语里，表示“胸部”更常用 **chest**；**bosom** 更带有文学色彩或强调“亲密/温柔”的情感。"]}
{"word":"bosn","summary":{"en":"“bosn” is an informal spelling of **bosun/boatswain**, the officer who supervises deck crew and ship maintenance.","zh":"“bosn”多为 **bosun/boatswain（水手长）** 的非正式写法，指负责甲板船员与船上设备维护的船员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(also spelled **bosun**, **bo’s’n**, **boatswain**) A ship’s officer in charge of the deck crew and the maintenance of the ship’s equipment (ropes, anchors, rigging, etc.).","zh":"（也拼作 **bosun / bo’s’n / boatswain**）水手长：船上的高级船员，负责甲板水手的管理以及绳索、锚、索具等设备的维护。"},"examples":[{"en":"The **bosun** assigned the crew to clean the deck before sunrise.","zh":"水手长在日出前分配船员去清洗甲板。"},{"en":"Ask the **bosun** if the ropes have been checked for wear.","zh":"问问水手长绳索是否检查过磨损。"}]}],"synonyms":["boatswain","bosun","deck boss"],"phonetic":"ˈboʊsən","extraExplanation":["“bosn”常见为“bosun/boatswain”的非正式拼写或缩写，源自早期海事用语的口语发音，写法逐渐简化成 bo’s’n / bosun。","在文学与航海题材作品里（如海盗、远洋航行故事）常见该角色：他通常负责实际的甲板工作安排，而船长与大副更多负责整体指挥。"]}
{"word":"Bosnia","summary":{"en":"Bosnia is commonly used to refer to Bosnia and Herzegovina (a Balkan country) or to the Bosnia region within that country.","zh":"Bosnia 常用作“波斯尼亚和黑塞哥维那”的简称，也可指该国境内的“波斯尼亚”地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A country in Southeast Europe on the Balkan Peninsula (officially part of Bosnia and Herzegovina).","zh":"东南欧巴尔干半岛上的一个国家（正式国名为“波斯尼亚和黑塞哥维那”，Bosnia 通常指其中的“波斯尼亚”地区或作为简称使用）。"},"examples":[{"en":"She traveled to Bosnia and Herzegovina to visit Sarajevo.","zh":"她去波斯尼亚和黑塞哥维那旅行，参观了萨拉热窝。"},{"en":"Bosnia has a rich mix of cultures and traditions.","zh":"波斯尼亚有多元的文化与传统。"}]},{"partOfSpeech":"n.","definition":{"en":"The larger historical/geographical region within the country of Bosnia and Herzegovina (often contrasted with Herzegovina).","zh":"波斯尼亚和黑塞哥维那国内较大的历史/地理区域（常与“黑塞哥维那”Herzegovina 对比）。"},"examples":[{"en":"Most of northern Bosnia is more mountainous and forested.","zh":"波斯尼亚北部大多是多山、森林覆盖的地区。"},{"en":"Her family is from Bosnia, not Herzegovina.","zh":"她家来自波斯尼亚，不是黑塞哥维那。"}]}],"synonyms":["Bosnia and Herzegovina (formal country name)","BiH (common abbreviation in writing)"],"phonetic":"/ˈbɑːzniə/","extraExplanation":["在英语里，人们口语中常把整个国家简称为“Bosnia”，但正式场合更常写全称“Bosnia and Herzegovina”。","发音中“Bos-”重读，结尾“-nia”听起来像“nee-uh”。","在新闻与历史语境中常会提到“the Bosnian War（波斯尼亚战争，1992–1995）”“Bosnian（波斯尼亚的/波斯尼亚人）”等词；“Bosniak”特指波斯尼亚的一个民族群体（主要为穆斯林），不要与“Bosnian”（更宽泛的国籍/地区形容词）混淆。"]}
{"word":"Bosnia and Herzegovina","summary":{"en":"a Balkan country in southeastern Europe (capital: Sarajevo)","zh":"东南欧巴尔干半岛国家（首都：萨拉热窝）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A country in southeastern Europe on the Balkan Peninsula, made up of the regions Bosnia and Herzegovina; its capital is Sarajevo.","zh":"位于东南欧巴尔干半岛的国家，由“波斯尼亚”和“黑塞哥维那”两大地区组成；首都是萨拉热窝。"},"examples":[{"en":"She studied postwar recovery in Bosnia and Herzegovina.","zh":"她研究了波斯尼亚和黑塞哥维那的战后复苏。"},{"en":"Sarajevo is the capital of Bosnia and Herzegovina.","zh":"萨拉热窝是波斯尼亚和黑塞哥维那的首都。"}]}],"synonyms":["Bosnia-Herzegovina","BiH"],"phonetic":"/ˈbɑːzniə ənd ˌhɛrtsəɡoʊˈviːnə/","extraExplanation":["常见缩写是 BiH（来自本地语言首字母），在新闻、体育赛事与官方文件中很常见。","该国官方语言通常被称为波斯尼亚语、克罗地亚语、塞尔维亚语（彼此高度相近），日常交流中也常统称为“波黑语区语言”。","地理与历史语境里常被归入“巴尔干地区”；首都萨拉热窝在20世纪欧洲历史叙述中也经常出现。"],"etymology":"名称由两部分组成：Bosnia（波斯尼亚）可能源自当地河流名 Bosna；Herzegovina（黑塞哥维那）来自斯拉夫语对“公爵/领主”（德语 Herzog）的称号含义，意为“公爵之地/领地”。","mnemonic":["把名字拆成两段记：Bosnia（波）+ Herzegovina（黑）≈“波黑”，中文里常用简称“波黑”。","Herzegovina 里有 Herz-（联想到德语 Herzog“公爵”）→ 记成“公爵的地方”。"]}
{"word":"Bosniac","summary":{"en":"Bosniac is an uncommon spelling for Bosniak, meaning a Bosniak person or something related to Bosniaks.","zh":"Bosniac 是 Bosniak 的较少见拼写，指波什尼亚克人或与波什尼亚克相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Bosniak (a South Slavic Muslim people, mainly from Bosnia and Herzegovina); this spelling is now uncommon in English","zh":"波什尼亚克人（主要来自波斯尼亚和黑塞哥维那的南斯拉夫穆斯林族群）；这种拼写在英语中较少见"},"examples":[{"en":"Many Bosniacs (Bosniaks) live in Bosnia and Herzegovina and in diaspora communities abroad.","zh":"许多波什尼亚克人（Bosniaks）生活在波斯尼亚和黑塞哥维那，也分布在海外侨民社区。"},{"en":"The museum includes exhibits on Bosniac cultural and religious traditions.","zh":"这座博物馆包含有关波什尼亚克文化与宗教传统的展品。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Bosniaks, their culture, or their language varieties","zh":"与波什尼亚克人及其文化或语言变体有关的"},"examples":[{"en":"They served Bosniac dishes such as burek and ćevapi.","zh":"他们提供波什尼亚克风味的菜肴，比如 burek 和 ćevapi。"},{"en":"She studies Bosniac history in the 20th century.","zh":"她研究20世纪的波什尼亚克历史。"}]}],"synonyms":["Bosniak (preferred)"],"phonetic":"/ˈbɑzniæk/","extraExplanation":["当代英语里更常见、也更推荐使用的拼写是 **Bosniak**（指族群/身份），而 **Bosnian** 往往更常用来表示“波黑的/来自波黑的”（国籍或更广义的地区相关）。在写作时，如果你指的是特定族群身份，用 **Bosniak** 更清晰。","“Bosniac”在一些旧资料或特定作者中会出现，但在现代语境可能显得过时；涉及民族与身份时，最好采用当事群体普遍接受的用词，并在需要时区分民族（Bosniak）与国籍（Bosnian）。"]}
{"word":"bosniac","summary":{"en":"Bosniac means a Bosniak person, or something related to Bosniaks and their culture.","zh":"Bosniac 指波什尼亚克人，或与波什尼亚克民族及其文化相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Bosniak person (a South Slavic Muslim people mainly from Bosnia and Herzegovina)","zh":"波什尼亚克人（主要来自波斯尼亚和黑塞哥维那的南斯拉夫穆斯林民族）"},"examples":[{"en":"Many Bosniacs (Bosniaks) live in Bosnia and Herzegovina, as well as in nearby countries and the diaspora.","zh":"许多波什尼亚克人生活在波斯尼亚和黑塞哥维那，也分布在周边国家和海外侨居地。"},{"en":"She is a Bosniac writer whose novels describe life in Sarajevo.","zh":"她是一位波什尼亚克作家，小说描写了萨拉热窝的生活。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Bosniaks or to their language, culture, or community","zh":"与波什尼亚克人及其语言、文化或社群有关的"},"examples":[{"en":"Bosniac cultural associations organize language classes and community events.","zh":"波什尼亚克文化协会会组织语言课程和社区活动。"},{"en":"He studies Bosniac history in the context of the former Yugoslavia.","zh":"他在前南斯拉夫的背景下研究波什尼亚克历史。"}]}],"synonyms":["Bosniak","Bosnian (broader, not the same)"],"phonetic":"/ˈbɑzniˌæk/","extraExplanation":["“Bosniac”在英语中较少见，更常见的现代用法是“Bosniak”。在当代语境里，“Bosniak”通常特指波黑的波什尼亚克民族（多为穆斯林传统），而“Bosnian”更常指波黑公民/与波黑有关的人或事（不限定族群）。在正式或尊重身份认同的表达中，优先使用对方或资料所使用的称呼。"]}
{"word":"Bosniak","summary":{"en":"Bosniak refers to the Bosniak ethnic group (and their culture), mainly associated with Bosnia and Herzegovina.","zh":"Bosniak指波什尼亚克族（及其文化），主要与波斯尼亚和黑塞哥维那相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person (or relating to people) who is part of the Bosniak ethnic group, traditionally associated with Bosnia and Herzegovina and culturally linked to Islam","zh":"波什尼亚克人；波什尼亚克族的（指波黑的一个民族群体，传统上与伊斯兰文化有关）"},"examples":[{"en":"Many Bosniaks live in Bosnia and Herzegovina, but there are also large communities abroad.","zh":"许多波什尼亚克人居住在波斯尼亚和黑塞哥维那，但海外也有很大的社群。"},{"en":"Bosniak culture includes traditions in music, food, and family life.","zh":"波什尼亚克文化包含音乐、饮食和家庭生活等传统。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Bosniak people, their language variety, or their culture","zh":"波什尼亚克人的；与波什尼亚克族（或其语言/文化）相关的"},"examples":[{"en":"She is studying Bosniak literature and modern poetry.","zh":"她在学习波什尼亚克文学和现代诗歌。"},{"en":"The museum has a Bosniak exhibit on everyday life in Sarajevo.","zh":"博物馆有一个波什尼亚克主题展览，介绍萨拉热窝的日常生活。"}]}],"synonyms":["Bosniac (variant spelling)"],"phonetic":"/ˈbɑz.ni.æk/","extraExplanation":["“Bosniak”是英语中对一个“民族（ethnic group）”的称呼，不等同于“Bosnian（波斯尼亚的/波黑的）”。“Bosnian”更常指国籍或地区身份（来自波黑的人，不分族群），而“Bosniak”特指波黑境内主要族群之一（与Bosnian Serb、Bosnian Croat等并列的族群概念）。","在国际新闻语境中，该词常出现在讨论1990年代巴尔干战争、难民与人权等话题时。使用时要注意尊重当事人的自我认同。"]}
{"word":"bosniak","summary":{"en":"Bosniak means a person from the Bosniak ethnic group, or something related to Bosniak people and culture.","zh":"Bosniak 指波什尼亚克族群的人，或与波什尼亚克人及其文化相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Bosniak people (a South Slavic ethnic group), historically associated mainly with Bosnia and Herzegovina; many Bosniaks are traditionally Muslim","zh":"波什尼亚克人（南斯拉夫族群之一），主要与波斯尼亚和黑塞哥维那有关；许多波什尼亚克人传统上信奉伊斯兰教"},"examples":[{"en":"Many Bosniaks live in Bosnia and Herzegovina, as well as in neighboring countries and abroad.","zh":"许多波什尼亚克人生活在波斯尼亚和黑塞哥维那，也分布在周边国家和海外。"},{"en":"He is a Bosniak writer whose novels explore life in Sarajevo.","zh":"他是一位波什尼亚克作家，小说探讨萨拉热窝的生活。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Bosniak people, their culture, or their language variety","zh":"与波什尼亚克人及其文化或语言变体有关的；波什尼亚克人的"},"examples":[{"en":"Bosniak cultural traditions include distinctive music, food, and clothing.","zh":"波什尼亚克文化传统包括独特的音乐、饮食和服饰。"},{"en":"She is studying Bosniak history in the 20th century.","zh":"她在学习20世纪的波什尼亚克历史。"}]}],"synonyms":["Bosnian Muslim (older/less preferred in many contexts)"],"phonetic":"/ˈbɑzniˌæk/","extraExplanation":["“Bosniak”通常指一个“族群/民族认同”（ethnic group），而“Bosnian”更常指“国籍/地区身份”（来自波斯尼亚和黑塞哥维那的任何人，可能包括波什尼亚克人、塞尔维亚人、克罗地亚人等）。因此在写作或新闻语境中，区分这两个词很重要。","拼写与大小写：作名词或形容词时一般首字母大写（Bosniak）。"]}
{"word":"Bosnian","summary":{"en":"Bosnian means “from Bosnia and Herzegovina,” a person from there, or the Bosnian language.","zh":"Bosnian 指“与波斯尼亚和黑塞哥维那有关的”，也可指波黑人或波斯尼亚语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Bosnia and Herzegovina (especially someone from the region of Bosnia).","zh":"波斯尼亚人；来自波斯尼亚和黑塞哥维那的人（尤指来自波斯尼亚地区的人）。"},"examples":[{"en":"She is a Bosnian who moved to the U.S. when she was a child.","zh":"她是一位波斯尼亚人，小时候搬到了美国。"},{"en":"Many Bosnians speak more than one language.","zh":"许多波斯尼亚人会说不止一种语言。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Bosnia and Herzegovina, its people, or its culture.","zh":"波斯尼亚（和黑塞哥维那）的；与该国、其人民或文化有关的。"},"examples":[{"en":"They served Bosnian food at the festival.","zh":"他们在节日上提供了波斯尼亚美食。"},{"en":"I’m reading a Bosnian novel in translation.","zh":"我在读一本波斯尼亚小说的译本。"}]},{"partOfSpeech":"n.","definition":{"en":"the standard variety of the South Slavic language spoken mainly by Bosniaks in Bosnia and Herzegovina.","zh":"波斯尼亚语（南斯拉夫语支的一种标准语，主要由波黑的波什尼亚克人使用）。"},"examples":[{"en":"He can speak Bosnian and English.","zh":"他会说波斯尼亚语和英语。"},{"en":"This app has lessons in Bosnian.","zh":"这个应用有波斯尼亚语课程。"}]}],"synonyms":["Bosnia and Herzegovina (adj. use: from Bosnia and Herzegovina)","Bosniak (ethnic-group-specific, not always interchangeable)"],"phonetic":"/ˈbɑzniən/","extraExplanation":["在英语里，“Bosnian”既可以指“波黑的人/事物”（国籍或国家层面），也常用来指“波斯尼亚语”。如果要强调族群身份，英语里还常见“Bosniak（波什尼亚克人）”，它更偏向特定族群；而“Bosnian”更宽泛，可能指任何来自波黑的人。","语言方面，Bosnian、Croatian、Serbian在日常交流中高度互通（很多场合彼此能听懂），但在标准化、用词偏好与书写体系（如塞尔维亚语也常用西里尔字母）等方面可能有差异。"]}
{"word":"bosnian","summary":{"en":"Bosnian means “from Bosnia and Herzegovina,” a person from there, or the Bosnian language.","zh":"Bosnian 可指“波黑的”，也可指“波黑人”或“波斯尼亚语”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Bosnia and Herzegovina, its people, or its culture.","zh":"与波斯尼亚和黑塞哥维那（波黑）、其人民或文化有关的。"},"examples":[{"en":"Bosnian cuisine often includes grilled meats and hearty stews.","zh":"波斯尼亚菜常见烤肉和浓郁的炖菜。"},{"en":"They visited a Bosnian museum to learn more about the country’s history.","zh":"他们参观了波斯尼亚的博物馆，想更多了解这个国家的历史。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Bosnia and Herzegovina.","zh":"波斯尼亚和黑塞哥维那人（波黑人）。"},"examples":[{"en":"She is a Bosnian who moved to the U.S. for college.","zh":"她是一位波黑人，为了上大学搬到美国。"},{"en":"Many Bosnians speak more than one language.","zh":"许多波黑人会说不止一种语言。"}]},{"partOfSpeech":"n.","definition":{"en":"The standard variety of the Serbo-Croatian language mainly used by Bosniaks in Bosnia and Herzegovina.","zh":"波斯尼亚语（主要由波黑境内的波什尼亚克人使用的塞尔维亚-克罗地亚语标准变体）。"},"examples":[{"en":"He can speak Bosnian and English.","zh":"他会说波斯尼亚语和英语。"},{"en":"I’m learning Bosnian to talk with my grandparents.","zh":"我在学波斯尼亚语，好和祖父母交流。"}]}],"synonyms":["from Bosnia and Herzegovina","Bosnia and Herzegovina (as a modifier)"],"phonetic":"/ˈbɑzniən/","extraExplanation":["“Bosnian”在英语里既可指“波黑的/波黑人”，也可指“波斯尼亚语”。在语言语境中，日常也会看到与其并列的说法：Serbian（塞尔维亚语）和 Croatian（克罗地亚语）；三者非常接近，但在标准用词、拼写与身份认同上有所区别。"]}
{"word":"Bosnisch","summary":{"en":"Bosnian means “from Bosnia and Herzegovina,” the Bosnian language, or a person from Bosnia and Herzegovina.","zh":"Bosnian 表示“波斯尼亚和黑塞哥维那的”，也可指“波斯尼亚语”或“波斯尼亚和黑塞哥维那人（有时特指波什尼亚克人）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Bosnia and Herzegovina, or to the Bosniaks (a South Slavic people) and their culture","zh":"（形容词）与波斯尼亚和黑塞哥维那有关的；或与波什尼亚克人及其文化有关的"},"examples":[{"en":"Bosnian food often includes grilled meats and rich stews.","zh":"波斯尼亚的食物常包括烤肉和浓郁的炖菜。"},{"en":"She studied Bosnian history in college.","zh":"她在大学里学习了波斯尼亚历史。"}]},{"partOfSpeech":"n.","definition":{"en":"the Bosnian language","zh":"（名词）波斯尼亚语"},"examples":[{"en":"He can speak Bosnian and English.","zh":"他会说波斯尼亚语和英语。"},{"en":"This book is translated into Bosnian.","zh":"这本书被翻译成了波斯尼亚语。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Bosnia and Herzegovina (often specifically a Bosniak person)","zh":"（名词）波斯尼亚和黑塞哥维那人（有时也特指波什尼亚克人）"},"examples":[{"en":"Many Bosnians moved abroad during the 1990s.","zh":"许多波斯尼亚人在20世纪90年代期间移居海外。"},{"en":"He is a Bosnian living in the U.S.","zh":"他是一位住在美国的波斯尼亚人。"}]}],"synonyms":["Bosnia and Herzegovina (adj. form: Bosnia-Herzegovinian)","Bosniak (for the ethnic group, context-dependent)"],"phonetic":"/ˈbɑzniən/","extraExplanation":["你输入的 **Bosnisch** 是德语，通常对应英语 **Bosnian**（“波斯尼亚的/波斯尼亚语/波斯尼亚人”）。","语言背景：很多情况下“Bosnian / Croatian / Serbian / Montenegrin”在语言学上互相非常接近（常被合称为 **BCMS**），但在日常与文化认同上，人们会根据国家与族群选择更合适的名称。"]}
{"word":"bosnisch","summary":{"en":"Bosnian: relating to Bosnia and Herzegovina; a person from there; or the Bosnian language.","zh":"Bosnian：与波黑有关的；波黑人；或波斯尼亚语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Bosnia and Herzegovina, its people, or its culture","zh":"与波斯尼亚和黑塞哥维那（波黑）、其人民或文化有关的"},"examples":[{"en":"Bosnian coffee is often served in a small cup with a sweet treat.","zh":"波斯尼亚咖啡常用小杯盛装，并配上一点甜点。"},{"en":"She studies Bosnian history at university.","zh":"她在大学里学习波斯尼亚历史。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Bosnia and Herzegovina","zh":"波黑人；来自波斯尼亚和黑塞哥维那的人"},"examples":[{"en":"Many Bosnians speak more than one language.","zh":"许多波黑人会说不止一种语言。"}]},{"partOfSpeech":"n.","definition":{"en":"the Bosnian language","zh":"波斯尼亚语"},"examples":[{"en":"He can read and write Bosnian well.","zh":"他波斯尼亚语读写都很好。"},{"en":"This book is translated into Bosnian.","zh":"这本书被翻译成了波斯尼亚语。"}]}],"synonyms":["from Bosnia and Herzegovina"],"phonetic":"/ˈbɑzniən/","extraExplanation":["你输入的“bosnisch”是德语，英语最常用对应词是 **Bosnian**。","在英语里，**Bosnian** 既可以作形容词（Bosnian culture），也可以作名词（a Bosnian；the Bosnian language）。","语言与身份表达上，更中性且常见的说法是：**Bosnian**（波斯尼亚语/波黑人）。需要强调国家时可说：**from Bosnia and Herzegovina**（来自波黑）。"]}
{"word":"bosom","summary":{"en":"Bosom most commonly means the chest (especially a woman’s breasts in older/formal usage), and it can also describe a very close relationship, as in “bosom friend.”","zh":"Bosom 常指胸前/胸部（旧式或正式语境中也可特指女性乳房），也可表示亲密关系，如“bosom friend（知心朋友）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A woman’s chest, especially the breasts (common in older or more formal writing).","zh":"（尤指女性的）胸部、乳房（较为旧式或较正式的用法）。"},"examples":[{"en":"In the novel, she held the letter close to her bosom.","zh":"在小说里，她把信紧紧贴在胸前。"},{"en":"The child fell asleep with his head against his mother’s bosom.","zh":"孩子把头靠在母亲胸前睡着了。"}]},{"partOfSpeech":"n.","definition":{"en":"The front part of a person’s chest (not necessarily sexual), often used in literature.","zh":"胸前（不一定带性意味），常见于文学语境。"},"examples":[{"en":"He pressed his hand to his bosom and took a deep breath.","zh":"他把手按在胸前，深吸了一口气。"}]},{"partOfSpeech":"adj.","definition":{"en":"A very close, trusted relationship; “bosom friend” means a best or intimate friend.","zh":"亲密而信任的关系；“bosom friend” 指知心好友、挚友。"},"examples":[{"en":"They were bosom friends in college and stayed close for years.","zh":"他们大学时是知心好友，多年来一直很亲近。"},{"en":"She told the secret only to her bosom friend.","zh":"她只把这个秘密告诉了她的知心朋友。"}]}],"synonyms":["chest","breast","close (friend)","intimate (friend)"],"phonetic":"/ˈbʊzəm/","extraExplanation":["“bosom”在现代口语里单独使用时，常显得文学化、旧式或略带暧昧，因此日常更常说“chest”（胸部）或“breasts”（乳房）。但在固定搭配里很常见：hold/keep something close to your bosom（把某物贴身珍藏、很在意），bosom friend（知心朋友）。","文学中“bosom”常被用来表达情感与内心：把东西贴在胸前象征珍视；“in one’s bosom”也可引申为“在心里、在内心深处”。"]}
{"word":"bosom buddies","summary":{"en":"very close friends","zh":"非常亲密的朋友"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Very close friends, often implying deep trust and a warm, long-term bond.","zh":"知心好友；非常亲密的朋友（常含彼此信任、关系长期且亲近之意）。"},"examples":[{"en":"They’ve been bosom buddies since middle school.","zh":"他们从初中起就是知心好友。"},{"en":"After working together for years, the two became bosom buddies.","zh":"一起共事多年后，两人变成了非常要好的朋友。"},{"en":"She invited her bosom buddies to celebrate her birthday at home.","zh":"她邀请了几位闺蜜/铁哥们到家里庆生。"}]}],"synonyms":["best friends","close friends","inseparable friends","pals","companions","kindred spirits"],"phonetic":"/ˈbʊzəm ˈbʌdiz/","extraExplanation":["“bosom”在现代口语里单独使用时容易让人联想到“胸部”，但在这个固定搭配里主要表达“亲密、知心”，语气通常友好、略带复古感。","也常见单数形式“bosom buddy”，意思相同。"],"etymology":"“bosom”原意是“胸口、怀抱”，在英语里也引申为“亲密的、贴近内心的”（如 bosom friend）。与“buddy（伙伴、哥们）”搭配后，强调“特别亲密的朋友”。","mnemonic":["把 bosom 理解成“怀里/心口”：能进“怀里”的朋友=最亲密的朋友。","联想中文“知心”：bosom≈贴近心口，buddy=朋友→知心好友。"]}
{"word":"bosom friend","summary":{"en":"a very close and trusted friend","zh":"非常亲密且值得信任的朋友"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A very close, trusted friend; someone you share private thoughts and feelings with.","zh":"知心朋友；挚友；可以分享秘密与心事的人。"},"examples":[{"en":"She’s been my bosom friend since high school.","zh":"她从高中起就是我的知心朋友。"},{"en":"He talked to his bosom friend about his worries.","zh":"他把自己的担忧告诉了他的挚友。"},{"en":"A bosom friend will tell you the truth kindly.","zh":"知心朋友会用温和的方式告诉你真相。"}]}],"synonyms":["close friend","best friend","intimate friend","trusted friend","confidant","chum","pal"],"phonetic":"/ˈbʊzəm frɛnd/","extraExplanation":["带有一点文学/传统色彩，常见于书面语或较正式的表达；日常口语里更常说 “close friend / best friend”。","“bosom”在现代英语里单独使用时也可表示“女性胸部”，因此有时人们会避免在随意场合频繁使用这个词；但“bosom friend”作为固定搭配通常不会引起误解。"],"etymology":"“bosom”原义是“胸口、怀里”，引申为“内心、私密处”；“bosom friend”字面是“贴近胸怀的朋友”，因此表示关系亲密、能交心的人。","mnemonic":["把“bosom”想成“胸口/怀里”：能“放在心口里”的朋友＝知心朋友。","联想中文“掏心掏肺”：能把心里话掏出来说的朋友，就是 bosom friend。"]}
{"word":"bosom friends","summary":{"en":"very close, trusting friends","zh":"非常亲密、彼此信任的朋友"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Very close friends who share trust, personal feelings, and private thoughts.","zh":"知心好友；挚友（彼此非常亲密、信任，能分享私密心事）"},"examples":[{"en":"They’ve been bosom friends since middle school.","zh":"他们从初中起就是知心好友。"},{"en":"She told her secret only to her bosom friends.","zh":"她只把秘密告诉了她的知心好友。"}]}],"synonyms":["close friends","best friends","intimate friends","chums","pals","confidants"],"phonetic":"/ˈbʊzəm frɛndz/","extraExplanation":["语感与使用：在日常口语里，人们更常说 “close friends / best friends / good friends”。“bosom friends”带一点文学色彩，也可能用于较正式或叙述性的写作。","注意避免误解：因为“bosom”也可指女性胸部，在少数语境里会让人联想到身体含义；不过在“bosom friends”中通常就是“知心”的比喻意思。"],"etymology":"“Bosom”原指“胸膛、怀里”，引申为“内心、心事”。“Bosom friend(s)”字面是“贴近胸口的朋友”，因此表示关系亲密、能交心的朋友。这个表达较传统，在现代英语里仍能理解，但有时会显得稍文学或偏旧。","mnemonic":["把 bosom 想成“抱在怀里/贴在胸口（心口）”，能“贴心说心事”的朋友就是知心好友。","联想中文“掏心窝子的话只跟TA说”→ bosom friends。"]}
{"word":"bosomed","summary":{"en":"“Bosomed” is a literary word meaning “intimate/close (as in a bosomed friend),” or the past form of “bosom,” meaning “held close” or “kept hidden in one’s heart.”","zh":"“bosomed”偏文学用法，可指“亲密的/知心的（如bosomed friend）”，也可作“bosom”的过去式/过去分词，表示“紧抱在怀里”或“把……藏在心中”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(literary) Held close to the heart; intimate, trusted, and very close (often in “bosomed friend”).","zh":"（文学/较古）贴近心口的；亲密的、知心的（常见于“bosomed friend/知心朋友”）。"},"examples":[{"en":"She shared the secret only with her bosomed friend.","zh":"她只把这个秘密告诉了她的知心朋友。"},{"en":"In the novel, the hero speaks to his bosomed companion before the final battle.","zh":"在小说里，主人公在决战前与他的知己交谈。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of “bosom”: to hold someone/something close; to keep (a feeling or secret) hidden in your heart.","zh":"“bosom”的过去式/过去分词：把……紧抱在怀里；把（情感或秘密）藏在心中。"},"examples":[{"en":"He bosomed the child to his chest to keep her warm.","zh":"他把孩子紧紧抱在胸前给她取暖。"},{"en":"She had bosomed her doubts for years and never spoke of them.","zh":"她把疑虑藏在心里多年，从未说出口。"}]}],"synonyms":["intimate","close","trusted","cherished","confided"],"phonetic":"ˈbʊzəmd","extraExplanation":["“bosomed”带有明显的文学色彩，现代口语中更常用 close/intimate 或 confide in（向……倾诉）。","常见搭配：bosomed friend（知己/知心朋友）。在古典或诗歌语境里，bosom 也常与“heart（心）”的意象相连。"]}
{"word":"bosomer","summary":{"en":"Bosomer is an old-fashioned noun meaning a very close, trusted friend.","zh":"Bosomer 是个较古旧的名词，指非常亲密、可信赖的知心朋友。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(old-fashioned) A close, trusted friend; someone very dear and intimate.","zh":"（古旧）知心朋友；挚友；亲密无间的人。"},"examples":[{"en":"In the novel, she confides her secret only to her bosomer.","zh":"在小说里，她只把秘密告诉她的知心朋友。"},{"en":"He was once called the king’s bosomer, meaning a trusted companion at court.","zh":"他曾被称为国王的“挚友”，意思是在宫廷里深受信任的伙伴。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) Someone who holds or keeps something close (in one’s “bosom,” i.e., close to the heart).","zh":"（罕见）把某物“藏在心里/贴身珍藏”的人；把某物紧紧保留在心中的人。"},"examples":[{"en":"She became a bosomer of old letters, keeping them hidden for years.","zh":"她成了旧信件的珍藏者，把它们藏了很多年。"}]}],"synonyms":["close friend","bosom friend","confidant","intimate","trusted companion"],"phonetic":"/ˈbʊzəmɚ/","extraExplanation":["“bosomer”来自“bosom（胸怀；怀抱；内心）+ -er（表人）”。在现代英语里非常少见，更多会用“close friend / intimate friend / confidant（知己）”。","常见相关表达是“bosom friend（知心朋友）”。因此你在阅读旧文学或历史文本时遇到“bosomer”，通常就是在强调非常亲密、可以托付秘密的关系。"]}
{"word":"bosominess","summary":{"en":"Bosominess means warm, intimate friendliness and an openly affectionate manner.","zh":"Bosominess 指亲密热情的友好氛围或坦率亲切的态度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Warm, close friendliness; the quality of being openly affectionate and companionable.","zh":"亲密而热情的友好；坦率亲切、让人感到温暖的相处方式。"},"examples":[{"en":"Her bosominess made new employees feel welcome on their first day.","zh":"她那种亲切热情让新员工第一天就感到被欢迎。"},{"en":"The café’s small tables and soft lighting added to the bosominess of the place.","zh":"咖啡馆的小桌子和柔和的灯光增添了这里的温馨亲密感。"}]}],"synonyms":["warmth","friendliness","affability","cordiality","camaraderie"],"phonetic":"/ˈbʊzəminəs/","extraExplanation":["“bosominess”来自形容词“bosomy / bosom”（亲密的、贴心的），而“bosom friend”是常见搭配，表示“知心朋友/挚友”。这里的“bosom”原义与“胸怀、怀抱”有关，引申为“把人抱在怀里那样亲近、信任”的感觉。现代用法多偏书面或略带幽默色彩：当你想表达“过于热情、很爱套近乎”时也可能用它，但要看语境。"]}
{"word":"bosoming","summary":{"en":"“Bosoming” usually means “flourishing/growing,” and more rarely is the poetic form of “bosom” meaning “hold close” or “keep in one’s heart.”","zh":"“bosoming”通常指“蓬勃生长/繁盛”，较少见时是动词“bosom”的现在分词，带诗意地表示“紧拥/藏在心里”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"growing, flourishing, or becoming more full and developed (often used in writing, especially about nature or a community).","zh":"生长茂盛的；蓬勃发展的；逐渐丰盈成熟的（常见于文学或描写自然、社群的语境）。"},"examples":[{"en":"In spring, the fields turn green with bosoming plants.","zh":"春天里，田野变绿，植物蓬勃生长。"},{"en":"The once-quiet town became a bosoming tourist destination.","zh":"这个曾经安静的小镇变成了一个蓬勃发展的旅游目的地。"}]},{"partOfSpeech":"v.","definition":{"en":"the present participle of “bosom”: to hold someone/something close to your chest or to keep something in your heart (poetic).","zh":"“bosom”的现在分词：把某人/某物紧拥在胸前；把某事藏在心中、铭记于心（偏诗意用法）。"},"examples":[{"en":"She sat by the window, bosoming a letter she couldn’t bring herself to throw away.","zh":"她坐在窗边，把一封舍不得丢掉的信紧紧贴在胸前。"},{"en":"He walked on, bosoming his grief in silence.","zh":"他继续走着，把悲伤默默藏在心里。"}]}],"synonyms":["flourishing","blooming","thriving","burgeoning","developing"],"phonetic":"/ˈbʊsəmɪŋ/","extraExplanation":["“bosoming”更常见于描写性文字里，带有一种“正在舒展、变得丰盛”的画面感，常搭配spring、flowers、fields、garden等自然意象。","作为动词“bosom”的形式时语气更文艺/诗意，日常口语里通常会用hold close、hug、keep in one’s heart等更常见的表达。"]}
{"word":"bosoms","summary":{"en":"“Bosoms” means the chest area; in literary/old-fashioned use it can also mean a woman’s breasts or a person’s inner feelings.","zh":"“bosoms”是“bosom”的复数：指胸部/胸膛；在文学或较古旧用法中也可指女性乳房或人的内心情感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the chest area of a person; the front of the body between the neck and the stomach","zh":"（人的）胸部；胸膛（从脖子到腹部之间的前侧）"},"examples":[{"en":"He held the child close to his bosom.","zh":"他把孩子紧紧抱在胸前。"},{"en":"She felt her heart pounding in her bosom.","zh":"她感到心在胸膛里怦怦直跳。"}]},{"partOfSpeech":"n.","definition":{"en":"a woman’s breasts (often used in literature or in an old-fashioned style; can sound awkward in modern casual speech)","zh":"（女性的）乳房（多见于文学或较古旧的表达；现代日常口语中可能显得别扭）"},"examples":[{"en":"The dress was cut low at the bosom.","zh":"这条裙子在胸部开口较低。"},{"en":"In the novel, she pressed the letter to her bosom.","zh":"在小说里，她把信按在胸前。"}]},{"partOfSpeech":"n.","definition":{"en":"the inner feelings or thoughts of a person (common in formal or literary writing)","zh":"内心；心中情感或想法（常见于正式或文学语体）"},"examples":[{"en":"He carried a secret in his bosom for years.","zh":"他多年把一个秘密藏在心里。"},{"en":"Fear rose in his bosom when he heard the news.","zh":"他听到消息时，恐惧在心中涌起。"}]}],"synonyms":["chest","breast","heart (figurative)","inner self (figurative)"],"phonetic":"/ˈbʊzəm/","extraExplanation":["“bosoms”是“bosom”的复数形式。现代英语里，“chest”（胸膛）更常用、更中性；“bosom”更偏文学、古典或宗教语体。","在英语文学中，“bosom”常用来表达“贴近胸口＝亲密/珍爱/隐藏”的意象，比如“press something to one’s bosom”（把某物紧贴胸前，含珍惜之意）或“a secret in one’s bosom”（把秘密藏在心里）。","与“bosom”相关的固定搭配：\"bosom friend\"（知心朋友、密友）在现代仍可用，但语气略带书面或老派。"]}
{"word":"bosomy","summary":{"en":"“Bosomy” usually means (of a woman) full-breasted, and it can also mean deep, rounded, and ample in a figurative, old-fashioned way.","zh":"“bosomy”通常指（女性）胸部丰满的；也可作较老派的比喻，指又深又圆润、饱满宽大的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a woman) having a large, full bust; full-breasted.","zh":"（形容女性）胸部丰满的；（乳房）丰满的。"},"examples":[{"en":"In the novel, the heroine is described as a bosomy barmaid with a loud laugh.","zh":"小说里，女主角被描写成一位胸部丰满、笑声爽朗的酒吧女招待。"},{"en":"The old painting shows a bosomy figure in a flowing dress.","zh":"那幅旧画里是一位身着飘逸长裙、胸部丰满的女子。"}]},{"partOfSpeech":"adj.","definition":{"en":"(often humorous or old-fashioned) having a deep, rounded shape like a bosom; full and ample.","zh":"（常带幽默或较老派用法）形状像胸怀一样鼓起、圆润的；饱满的。"},"examples":[{"en":"He sat in a bosomy armchair that seemed to swallow him.","zh":"他坐在一把又深又软、把人“吞”进去的宽大扶手椅里。"},{"en":"A bosomy valley opened up below the ridge.","zh":"山脊下方展开了一片圆润起伏的山谷。"}]}],"synonyms":["buxom","full-breasted","curvy","ample"],"phonetic":"/ˈbʊzəmi/","extraExplanation":["“bosomy”来自名词“bosom”（胸部；怀抱）。现代英语中，直接用“bosomy”形容女性身体往往带有凝视或物化色彩，容易显得不礼貌；更中性的表达可用“curvy”（曲线玲珑的）、“full-busted”（胸围较大，偏中性但仍较直白）或干脆不提外貌。","在文学里，“bosomy”常见于较早期或带戏谑的描写；用于家具/地形等（如“bosomy armchair/valley”）则更偏比喻，语气通常更轻松、老派。"]}
{"word":"boson","summary":{"en":"A boson is a subatomic particle (like a photon) that can share quantum states and often carries fundamental forces.","zh":"玻色子是一类亚原子粒子（如光子），可共享量子态，且常用于传递基本相互作用力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of subatomic particle that can share the same quantum state with other identical particles; many bosons help carry forces in nature (like light particles).","zh":"一种亚原子粒子，可以与其他相同粒子处于同一量子态；许多玻色子在自然界中起到“传递力”的作用（例如光子）。"},"examples":[{"en":"A photon is a boson that carries electromagnetic energy.","zh":"光子是一种玻色子，携带电磁能量。"},{"en":"Physicists searched for the Higgs boson to better understand how particles get mass.","zh":"物理学家寻找希格斯玻色子，以更好理解粒子如何获得质量。"}]}],"synonyms":["subatomic particle","force carrier"],"phonetic":"/ˈboʊsɑn/","extraExplanation":["“Boson（玻色子）”来自印度物理学家 Satyendra Nath Bose（玻色）的姓氏。","在基础物理里常把粒子分为两大类：玻色子（bosons）和费米子（fermions）。简单理解：玻色子更容易“聚在一起”（比如激光、玻色–爱因斯坦凝聚），而费米子更倾向于“彼此避开”（构成电子、质子等物质的主要成分）。","常见玻色子：photon（光子）、gluon（胶子）、W/Z bosons（W/Z 玻色子）、Higgs boson（希格斯玻色子）。其中一些被称为“力的媒介粒子（force carriers）”。"]}
{"word":"boson-related","summary":{"en":"“Boson-related” means connected with or involving bosons (particles in physics).","zh":"“boson-related”表示“与玻色子有关的/涉及玻色子的”（物理学用语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with, involving, or describing bosons (a class of particles in physics).","zh":"与玻色子有关的；涉及或描述玻色子的（物理学术语）。"},"examples":[{"en":"The paper discusses boson-related effects in ultracold atoms.","zh":"这篇论文讨论了超冷原子中的玻色子相关效应。"},{"en":"Boson-related measurements helped confirm the model.","zh":"玻色子相关的测量帮助证实了该模型。"}]}],"synonyms":["bosonic","boson-associated","boson-linked"],"phonetic":"/ˈboʊ.sɑn rɪˈleɪ.tɪd/","extraExplanation":["“boson-related”是由名词“boson（玻色子）”+“related（相关的）”构成的复合形容词，常见于学术写作，用来把“玻色子”作为限定信息加在名词前（如 boson-related phenomena / interactions / signatures）。","在更专业的物理语境中，人们也常用“bosonic（玻色的/玻色子性质的）”来表达类似含义；“boson-related”更偏向“与玻色子有关”，而“bosonic”更强调“具有玻色子特性”。","“boson”一词来自物理学家 Satyendra Nath Bose（玻色），并常与“Higgs boson（希格斯玻色子）”等概念一起出现。"]}
{"word":"Bosone","summary":{"en":"“Bosone” is most likely a misspelling of “boson,” a subatomic particle type in physics.","zh":"“Bosone”很可能是“boson（玻色子）”的拼写误差；“boson”是物理学中的一种亚原子粒子类型。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of subatomic particle that can share the same quantum state with other identical particles; many force-carrying particles are bosons.","zh":"一种亚原子粒子，可以与其他同类粒子共享同一量子态；许多传递基本相互作用（力）的粒子属于玻色子。"},"examples":[{"en":"Photons are bosons, which is why many of them can occupy the same state in a laser.","zh":"光子是玻色子，这也是为什么激光中可以有许多光子占据同一状态。"},{"en":"The Higgs boson helped scientists explain why some particles have mass.","zh":"希格斯玻色子帮助科学家解释为什么一些粒子具有质量。"}]}],"phonetic":"/ˈboʊzɑːn/","extraExplanation":["你输入的“Bosone”在英语里不算常见词形，更常见的是“boson”（玻色子）。如果“Bosone”是人名/姓氏（如意大利语姓名），在英语中通常按专有名词处理，含义取决于具体人物或地名背景。","“boson”一词来自物理学家 Satyendra Nath Bose（萨特延德拉·纳特·玻色）的姓氏；与之相对的是“fermion”（费米子），以 Enrico Fermi（恩里科·费米）命名。"]}
{"word":"bosonic","summary":{"en":"Bosonic means “related to bosons” or “having boson-like quantum properties.”","zh":"bosonic 指“与玻色子有关”或“具有玻色子那样的量子性质”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a boson (a type of particle in physics that can share the same quantum state with other bosons).","zh":"与“玻色子”（物理学中一种粒子，可与其他玻色子共享同一量子态）有关的。"},"examples":[{"en":"Photons are bosonic particles, so many photons can occupy the same state in a laser beam.","zh":"光子是玻色子，因此在激光束中许多光子可以占据同一个量子态。"},{"en":"The Higgs field is associated with a bosonic particle called the Higgs boson.","zh":"希格斯场与一种称为“希格斯玻色子”的玻色子有关。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having properties typical of bosons, such as following Bose–Einstein statistics.","zh":"具有玻色子的典型性质，例如遵循玻色—爱因斯坦统计规律的。"},"examples":[{"en":"At extremely low temperatures, some atoms show bosonic behavior and can form a Bose–Einstein condensate.","zh":"在极低温下，一些原子会表现出玻色性，并可能形成玻色—爱因斯坦凝聚态。"},{"en":"Researchers studied bosonic excitations in the material to understand its unusual conductivity.","zh":"研究人员研究该材料中的玻色型激发，以理解其异常导电性。"}]}],"synonyms":["boson-related","Bose–Einstein (in context)"],"phonetic":"/boʊˈzɑːnɪk/","extraExplanation":["“bosonic”来自名词“boson（玻色子）”，而“boson”是为纪念印度物理学家玻色（Satyendra Nath Bose）而命名。","学习时可对比“fermionic（费米子相关的）”：费米子遵循泡利不相容原理（同一量子态不能被两个相同费米子同时占据），而玻色子不受此限制，因此会出现激光、超流、玻色—爱因斯坦凝聚等现象。"]}
{"word":"bosons","summary":{"en":"Bosons are particles (plural of boson) that can share the same quantum state; some bosons carry fundamental forces.","zh":"bosons 是“boson（玻色子）”的复数：可共享同一量子态的一类粒子；其中一些用于传递基本相互作用力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of \"boson\": a type of particle in physics that can share the same quantum state with other identical particles.","zh":"“boson”的复数：物理学中的一种粒子，同类粒子可以共享同一个量子态。"},"examples":[{"en":"Photons are bosons, which is why many light particles can occupy the same state in a laser.","zh":"光子是玻色子，这也是为什么在激光中许多光粒子可以处在同一状态。"},{"en":"In the Standard Model, some bosons carry forces, like the W and Z bosons.","zh":"在标准模型中，有些玻色子负责传递力，比如 W 与 Z 玻色子。"}]}],"synonyms":["force-carrying particles (in some contexts)"],"phonetic":"/ˈboʊzɑn/","extraExplanation":["“boson/玻色子”得名于印度物理学家萨特延德拉·纳特·玻色（Satyendra Nath Bose）。与“fermions/费米子”不同，玻色子遵循玻色–爱因斯坦统计，因此更容易出现“许多个体表现得像一个整体”的现象，例如玻色–爱因斯坦凝聚。","日常英语里更常见的是单数形式“boson”，尤其在特定名称中：the Higgs boson（希格斯玻色子）。复数“bosons”多用于泛指一类粒子或讨论多个不同的玻色子。"]}
{"word":"Bosphoran","summary":{"en":"Bosphoran means “connected to the Bosporus or (in history) the Bosporan Kingdom,” but the spelling Bosporan is more common.","zh":"Bosphoran意为“与博斯普鲁斯海峡或（历史上）博斯普鲁斯王国有关”，但更常见的拼写是Bosporan。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Bosporus (the strait in Turkey between Europe and Asia), or to the region around it; also spelled more commonly as “Bosporan.”","zh":"（形容词）与博斯普鲁斯海峡（位于土耳其、连接欧亚大陆的海峡）或其周边地区有关的；更常见拼写为“Bosporan”。"},"examples":[{"en":"The museum displayed Bosphoran artifacts connected to trade across the Bosporus.","zh":"博物馆展出了与穿越博斯普鲁斯海峡贸易有关的博斯普鲁斯地区文物。"},{"en":"In his lecture, the historian mentioned Bosphoran influence on Black Sea commerce.","zh":"在讲座中，历史学家提到博斯普鲁斯地区对黑海商业的影响。"}]},{"partOfSpeech":"adj.","definition":{"en":"of or connected to the ancient Bosporan Kingdom (a Greek-influenced state near the Black Sea), often used in historical writing; more common spelling: “Bosporan.”","zh":"（形容词）与古代“博斯普鲁斯王国/博斯普鲁斯地区王国”（靠近黑海、受希腊文化影响的政权）有关；历史写作中常见，更常用拼写为“Bosporan”。"},"examples":[{"en":"Coins from the Bosphoran Kingdom show a mix of Greek and local styles.","zh":"博斯普鲁斯王国的硬币呈现出希腊与本地风格的融合。"},{"en":"The article analyzes Bosphoran rulers and their alliances.","zh":"这篇文章分析了博斯普鲁斯王国统治者及其同盟关系。"}]}],"synonyms":["Bosporan"],"phonetic":"/ˈbɑs.fə.rən/","extraExplanation":["“Bosphoran”在英语里较少见，标准、更常用的形式通常是“Bosporan”。两者都来自“Bosporus（博斯普鲁斯海峡）”。","历史语境中的“Bosporan Kingdom（博斯普鲁斯王国）”多指位于克里米亚与刻赤海峡一带的古国，与今天土耳其的博斯普鲁斯海峡并非同一地点；学习时可用“Black Sea（黑海）—Crimea（克里米亚）—Kerch Strait（刻赤海峡）”来帮助区分。"]}
{"word":"Bosphorous","summary":{"en":"The Bosporus is the strait in Turkey between Europe and Asia, linking the Black Sea and the Sea of Marmara.","zh":"博斯普鲁斯海峡是土耳其连接黑海与马尔马拉海、分隔欧亚两洲的重要海峡。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) The Bosporus: a narrow strait in Turkey that separates Europe and Asia and connects the Black Sea to the Sea of Marmara (and, through it, to the Mediterranean).","zh":"（专有名词）博斯普鲁斯海峡：位于土耳其的一条狭窄海峡，分隔欧洲与亚洲，连接黑海与马尔马拉海（并间接通往地中海）。"},"examples":[{"en":"Istanbul sits on both sides of the Bosporus.","zh":"伊斯坦布尔横跨博斯普鲁斯海峡两岸。"},{"en":"Ships pass through the Bosporus to travel between the Black Sea and the Mediterranean.","zh":"船只通过博斯普鲁斯海峡在黑海与地中海之间航行。"},{"en":"We took a ferry tour across the Bosporus at sunset.","zh":"我们在日落时分乘渡轮游览博斯普鲁斯海峡。"}]}],"synonyms":["Istanbul Strait","Strait of Bosporus"],"phonetic":"/ˈbɑspərəs/","extraExplanation":["常见拼写是 **Bosporus**；你写的 **Bosphorous** 在英文里更常被视为拼写错误。","词源来自希腊语，常被解释为“牛渡口”（与希腊神话故事有关）。","它在历史与国际政治中很重要：因为它是黑海国家通往外海的重要航道，长期具有战略与经济意义。"]}
{"word":"Bosphorus","summary":{"en":"The Bosphorus is the strait in Turkey linking the Black Sea and the Sea of Marmara, dividing Europe and Asia (at Istanbul).","zh":"博斯普鲁斯海峡是土耳其的一条海峡，连接黑海与马尔马拉海，并在伊斯坦布尔一带分隔欧亚两洲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a narrow sea passage (strait) in Turkey that connects the Black Sea with the Sea of Marmara and divides Europe and Asia; also called the Istanbul Strait","zh":"博斯普鲁斯海峡（土耳其）：连接黑海与马尔马拉海，并分隔欧洲与亚洲的狭窄海峡；也称“伊斯坦布尔海峡”"},"examples":[{"en":"The Bosphorus separates the European and Asian sides of Istanbul.","zh":"博斯普鲁斯海峡把伊斯坦布尔分成欧洲岸和亚洲岸。"},{"en":"Ships passing through the Bosphorus must follow strict navigation rules.","zh":"通过博斯普鲁斯海峡的船只必须遵守严格的航行规定。"},{"en":"At sunset, the lights along the Bosphorus make the city look magical.","zh":"日落时分，博斯普鲁斯海峡沿岸的灯光让这座城市显得格外迷人。"}]}],"synonyms":["the Istanbul Strait","the Strait of Istanbul"],"phonetic":"/ˈbɑːsfərəs/","extraExplanation":["“Bosphorus”来自希腊语（意为“牛渡口”），与希腊神话中伊娥（Io）化为母牛渡海的故事有关。","在英语里它通常作为专有名词首字母大写：the Bosphorus；也常见拼写变体“Bosporus”（较少用）。","在文化与历史语境中，它常被用来象征“欧亚交汇处”的地理与文明连接。"]}
{"word":"Bosphorus-related","summary":{"en":"Connected with the Bosphorus strait in Turkey.","zh":"与土耳其的博斯普鲁斯海峡有关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with the Bosphorus (the strait in Turkey that separates Europe and Asia, linking the Black Sea and the Sea of Marmara).","zh":"与博斯普鲁斯海峡有关的（博斯普鲁斯海峡位于土耳其，分隔欧亚两洲，连接黑海与马尔马拉海）。"},"examples":[{"en":"The book explores Bosphorus-related trade routes in the Ottoman period.","zh":"这本书探讨了奥斯曼时期与博斯普鲁斯海峡相关的贸易路线。"},{"en":"Bosphorus-related traffic is often heavy during rush hour in Istanbul.","zh":"伊斯坦布尔在高峰期与博斯普鲁斯海峡相关的交通通常很拥堵。"},{"en":"They joined a Bosphorus-related research project on marine ecosystems.","zh":"他们参加了一个关于海洋生态系统的博斯普鲁斯海峡相关研究项目。"}]}],"synonyms":["related to the Bosphorus","Bosphorus-connected","Bosphoric (rare)"],"phonetic":"/ˈbɑs.fə.rəs rɪˈleɪ.tɪd/","extraExplanation":["“Bosphorus-related”常用于新闻、学术写作或说明性文本中，表示“与博斯普鲁斯海峡有关的”。日常口语里也可以说“related to the Bosphorus”或直接用“Bosphorus”作定语（如“Bosphorus traffic / Bosphorus bridge”）。","“Bosphorus”在英语里常见搭配包括：Bosphorus Strait（博斯普鲁斯海峡）、Bosphorus Bridge/Bridges（博斯普鲁斯大桥/跨海大桥）、Bosphorus cruise（博斯普鲁斯游船）。在文化语境中，它常象征“欧亚交汇点”和伊斯坦布尔的城市景观。"]}
{"word":"Bosporan","summary":{"en":"Bosporan means “connected to the Bosporus strait” or, in historical contexts, “connected to the ancient Bosporan Kingdom.”","zh":"Bosporan 指“与博斯普鲁斯海峡有关的”，或在历史语境中指“与古代博斯普鲁斯王国有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Bosporus (the narrow strait in Turkey that connects the Black Sea and the Sea of Marmara) or the area around it.","zh":"与博斯普鲁斯海峡（位于土耳其、连接黑海与马尔马拉海的狭窄海峡）或其周边地区有关的。"},"examples":[{"en":"The Bosporan shoreline is lined with historic forts and neighborhoods.","zh":"博斯普鲁斯海峡的海岸线分布着历史悠久的要塞和社区。"},{"en":"They took a Bosporan ferry to see Istanbul from the water.","zh":"他们乘坐博斯普鲁斯海峡的渡轮，从水上欣赏伊斯坦布尔。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the ancient Bosporan Kingdom (a Greek-influenced state around the Cimmerian Bosporus, near today’s Crimea and the Kerch Strait).","zh":"与古代“博斯普鲁斯王国”（受希腊文化影响、位于“辛梅里安博斯普鲁斯”一带，靠近今日克里米亚与刻赤海峡）的有关的。"},"examples":[{"en":"The museum displayed Bosporan coins with Greek inscriptions.","zh":"博物馆展出了带有希腊文铭文的博斯普鲁斯王国钱币。"},{"en":"Archaeologists study Bosporan tombs to learn about trade in the Black Sea.","zh":"考古学家研究博斯普鲁斯王国的墓葬，以了解黑海地区的贸易。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from the Bosporus region (rare in everyday use).","zh":"博斯普鲁斯海峡地区的人（日常用法较少见）。"},"examples":[{"en":"A Bosporan might describe the city’s life as shaped by the waterway.","zh":"一位博斯普鲁斯海峡地区的人可能会说，这座城市的生活方式由这条水道所塑造。"}]}],"synonyms":["Bosphoran (variant spelling)","Bosphorus-related"],"phonetic":"/bɑˈspɔrən/","extraExplanation":["“Bosporan”在学术写作里常见两种指向：一是现代地理上的博斯普鲁斯海峡（Istanbul 一带）；二是历史上的“Bosporan Kingdom”，但该王国指的是更北边的“辛梅里安博斯普鲁斯”（靠近刻赤海峡），并不是伊斯坦布尔的那条海峡。阅读历史或考古文章时要特别留意语境。","词源上来自“Bosporus/Bosporan”，与希腊语中表示“（牛）渡口”的说法有关，常用于地名与历史称谓。"]}
{"word":"bosporan","summary":{"en":"Bosporan means “connected with the Bosporus strait” or, in historical contexts, “connected with the ancient Bosporan Kingdom.”","zh":"Bosporan 指“与博斯普鲁斯海峡有关的”，或在历史语境中指“与古代博斯普鲁斯王国有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Bosporus, the narrow strait in Turkey that connects the Black Sea and the Sea of Marmara (and divides Europe and Asia).","zh":"与博斯普鲁斯海峡有关的；博斯普鲁斯海峡位于土耳其，连接黑海与马尔马拉海，并分隔欧亚两洲。"},"examples":[{"en":"Istanbul’s Bosporan shoreline is famous for its bridges and waterfront mansions.","zh":"伊斯坦布尔的博斯普鲁斯海峡沿岸以桥梁和海滨豪宅闻名。"},{"en":"The guide explained how Bosporan currents affect ship traffic.","zh":"导游解释了博斯普鲁斯海峡的洋流如何影响船只通行。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Bosporan Kingdom, an ancient Greek-influenced state around the Cimmerian Bosporus (near today’s Crimea and the Kerch Strait).","zh":"与博斯普鲁斯王国有关的；该王国是古代一个受希腊文化影响的国家，位于“基默里亚博斯普鲁斯”（大致在今克里米亚与刻赤海峡一带）。"},"examples":[{"en":"The museum displayed Bosporan coins with Greek inscriptions.","zh":"博物馆展出了带有希腊文铭文的博斯普鲁斯王国硬币。"},{"en":"She wrote a paper on Bosporan trade between Greek cities and steppe peoples.","zh":"她写了一篇论文，研究博斯普鲁斯王国在希腊城邦与草原民族之间的贸易。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from the Bosporus region or (in historical writing) from the Bosporan Kingdom.","zh":"博斯普鲁斯地区的人；（历史语境中）博斯普鲁斯王国的人。"},"examples":[{"en":"In the novel, a Bosporan sailor describes life in a busy port.","zh":"在小说中，一位博斯普鲁斯地区的水手描写了繁忙港口的生活。"}]}],"synonyms":["Bosphoran"],"phonetic":"/bɑˈspɔrən/","extraExplanation":["“Bosporan”在英语里相对少见，学术或历史语境中更常见。更常用的形容词也可能写作“Bosphoran”，意思相近。","“Bosporan Kingdom”（博斯普鲁斯王国）通常指古典时期至罗马时期，黑海北岸一带的希腊化王国；因此在考古、钱币学、古代史文章中更容易见到“Bosporan”。"]}
{"word":"Bosporanic","summary":{"en":"Bosporanic means “connected with the Bosporus (Istanbul)”; more rarely, it can refer to the ancient Bosporan Kingdom.","zh":"Bosporanic 表示“与博斯普鲁斯海峡（伊斯坦布尔）有关”；较少见时也可指“与古代博斯普鲁斯王国有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Bosporus Strait (in Istanbul, Turkey) or to the region around it.","zh":"与博斯普鲁斯海峡（位于土耳其伊斯坦布尔）或其周边地区有关的。"},"examples":[{"en":"Bosporanic winds can change quickly, affecting ferry schedules in Istanbul.","zh":"博斯普鲁斯海峡一带的风向变化很快，会影响伊斯坦布尔的渡轮班次。"},{"en":"The author describes the city’s Bosporanic shoreline at sunset.","zh":"作者描写了这座城市在日落时分的博斯普鲁斯海峡海岸线。"}]},{"partOfSpeech":"adj.","definition":{"en":"Less commonly, relating to the ancient Bosporan Kingdom (around the Crimean Peninsula and the Sea of Azov).","zh":"较少见：与古代博斯普鲁斯王国（大致位于克里米亚半岛及亚速海一带）有关的。"},"examples":[{"en":"The museum has coins from the Bosporanic rulers of the Black Sea region.","zh":"博物馆里有黑海地区博斯普鲁斯王国统治者的硬币。"},{"en":"She wrote a paper on Bosporanic trade routes in antiquity.","zh":"她写了一篇关于古代博斯普鲁斯王国贸易路线的论文。"}]}],"synonyms":["Bosphoran","Bosporan","Bosphorus-related"],"phonetic":"/ˌbɑːspəˈrænɪk/","extraExplanation":["“Bosporanic”在现代英语里非常少见；更常用的形容词是“Bosphoran”（与博斯普鲁斯海峡有关）或“Bosporan”（与博斯普鲁斯王国有关）。","词根来自“Bosporus”（博斯普鲁斯海峡）。在旅游、地理写作里通常直接说“the Bosporus”或“Bosphorus Strait”。"]}
{"word":"bosporanic","summary":{"en":"Bosporanic means “connected with the Bosporus or, in historical contexts, the Bosporan Kingdom.”","zh":"Bosporanic 指“与博斯普鲁斯海峡有关的”，或在历史语境中指“与博斯普鲁斯王国有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Bosporus (the strait in Turkey that connects the Black Sea and the Sea of Marmara), or to the region around it.","zh":"与博斯普鲁斯海峡（位于土耳其，连接黑海与马尔马拉海）或其周边地区有关的。"},"examples":[{"en":"Istanbul’s Bosporanic shores are lined with old wooden mansions and modern apartments.","zh":"伊斯坦布尔的博斯普鲁斯沿岸既有老木屋宅邸，也有现代公寓。"},{"en":"The novel’s atmosphere feels distinctly Bosporanic, with ferries crossing between Europe and Asia.","zh":"这部小说的氛围很“博斯普鲁斯式”，渡轮在欧亚两岸来回穿梭。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the ancient Bosporan Kingdom (around the Crimea and the Kerch Strait area), especially in history or archaeology.","zh":"（历史或考古语境）与古代博斯普鲁斯王国（大致在克里米亚及刻赤海峡一带）有关的。"},"examples":[{"en":"The museum displayed Bosporanic coins and pottery from Greek colonies near the Black Sea.","zh":"博物馆展出了黑海附近希腊殖民地的博斯普鲁斯王国钱币与陶器。"},{"en":"She wrote a paper on Bosporanic trade routes and their links to the Mediterranean world.","zh":"她写了一篇论文，研究博斯普鲁斯王国的贸易路线及其与地中海世界的联系。"}]}],"synonyms":["Bosphoran","Bosporus-related","of the Bosporus","Bosporan (historical)"],"phonetic":"/ˌbɑːspəˈrænɪk/","extraExplanation":["“Bosporanic”并不是日常高频词，更常见的表达是“Bosphoran / Bosporus-related（与博斯普鲁斯有关的）”。不过在学术写作、历史地理或文学描写中，有时会用“Bosporanic”来营造地域色彩。","词源上来自“Bosporus / Bosporan（博斯普鲁斯/博斯普鲁斯王国）+ -ic（……的）”。使用时通常出现在较正式或描写性语境中。"]}
{"word":"Bosporian","summary":{"en":"Bosporian means “related to the Bosporus” (most often the Istanbul strait) or, in historical writing, “related to the ancient Bosporan Kingdom” near today’s Kerch Strait.","zh":"Bosporian 指“与博斯普鲁斯（多指伊斯坦布尔的博斯普鲁斯海峡）有关的”，也可在历史语境中指“与古代博斯普鲁斯/博斯波兰王国（刻赤海峡附近）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Bosporus, the narrow strait in Istanbul, Turkey, that connects the Black Sea and the Sea of Marmara.","zh":"（形容词）与博斯普鲁斯海峡有关的；博斯普鲁斯海峡位于土耳其伊斯坦布尔，连接黑海与马尔马拉海。"},"examples":[{"en":"Bosporian waters have long been important for trade and military routes.","zh":"博斯普鲁斯海峡的水域长期以来对贸易和军事航线都很重要。"},{"en":"They took a Bosporian ferry across the strait to the other side of Istanbul.","zh":"他们坐博斯普鲁斯海峡的渡轮穿过海峡到伊斯坦布尔的另一侧。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the ancient Bosporan Kingdom, a Greek-influenced state that existed around the Cimmerian Bosporus (near today’s Kerch Strait, between the Black Sea and the Sea of Azov).","zh":"（形容词）与古代“博斯普鲁斯王国/博斯波兰王国”（Bosporan Kingdom）有关的；该王国位于“克里米亚博斯普鲁斯”（今刻赤海峡一带，连接黑海与亚速海），受希腊文化影响。"},"examples":[{"en":"The museum displays Bosporian coins from the Hellenistic period.","zh":"博物馆展出了希腊化时期的博斯普鲁斯王国钱币。"},{"en":"Bosporian inscriptions show a mix of Greek and local cultural elements.","zh":"博斯普鲁斯王国的铭文显示出希腊与本地文化元素的混合。"}]}],"synonyms":["Bosphoran","Bosporan"],"phonetic":"/bɑːˈspɔːriən/","extraExplanation":["“Bosporian”在学术与历史语境里常有两种指向：一是伊斯坦布尔的博斯普鲁斯海峡（英语更常见的形容词也可用“Bosphorus/Bosphoran”；日常表达常说“on the Bosphorus”）；二是古代“Bosporan Kingdom”（更常见写法是“Bosporan”，但“Bosporian”也会出现，尤其在较旧或特定学术写作中）。","词源上与希腊语有关，含义大致与“通道/渡口”相关，因此会出现在多个地理名称中：同名的“Bosporus”不只一个，最常被提到的是伊斯坦布尔那一处。"]}
{"word":"bosporian","summary":{"en":"Bosporian means “connected to the Bosporus” (modern Turkey/Istanbul) or “connected to the ancient Bosporan Kingdom” near the Black Sea; it can also mean a person from those contexts.","zh":"Bosporian 指“与博斯普鲁斯海峡（今土耳其/伊斯坦布尔）有关的”，或“与黑海周边的古代博斯波罗斯王国有关的”；也可指相关地区/语境中的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Bosporus (the narrow strait in Turkey that connects the Black Sea and the Sea of Marmara) or the region around it.","zh":"与博斯普鲁斯海峡（位于土耳其、连接黑海与马尔马拉海的狭窄海峡）或其周边地区有关的。"},"examples":[{"en":"The Bosporian skyline is famous for mosques, bridges, and busy ferry routes.","zh":"博斯普鲁斯海峡一带的天际线以清真寺、桥梁和繁忙的渡轮航线闻名。"},{"en":"We took a Bosporian cruise to see Istanbul from the water.","zh":"我们乘坐博斯普鲁斯海峡游船，从水上欣赏伊斯坦布尔。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the Bosporan Kingdom (also called the Bosporan Kingdom), an ancient Greek-influenced state around the Cimmerian Bosporus near today’s Crimea and the Kerch Strait.","zh":"与博斯波罗斯王国（又称博斯波罗斯王国/博斯普鲁斯王国）有关的；该国是古代受希腊文化影响的国家，位于今克里米亚及刻赤海峡附近的“辛梅里安博斯波罗斯”。"},"examples":[{"en":"The museum displayed Bosporian coins with Greek inscriptions.","zh":"博物馆展出了带有希腊文铭文的博斯波罗斯王国钱币。"},{"en":"She wrote a paper on Bosporian trade across the Black Sea.","zh":"她写了一篇关于博斯波罗斯王国跨黑海贸易的论文。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from the Bosporus area, or (in historical writing) a person connected to the Bosporan Kingdom.","zh":"博斯普鲁斯海峡地区的人；（史学语境中）与博斯波罗斯王国有关的人。"},"examples":[{"en":"In the novel, a Bosporian guides the traveler through the city’s waterfront streets.","zh":"在小说里，一位博斯普鲁斯海峡一带的当地人带着旅人穿过临海街区。"}]}],"synonyms":["Bosporus-related","Istanbul-area (contextual)","Bosporan (historical)"],"phonetic":"/bɑˈspɔriən/","extraExplanation":["“Bosporian”在英文里有两条常见指向：一是现代地理上的 Bosporus（博斯普鲁斯海峡，常与伊斯坦布尔语境连用）；二是历史上的 Bosporan Kingdom（博斯波罗斯王国，常见于古希腊—黑海史、钱币学与考古文章）。阅读时可通过上下文（Istanbul/strait vs. Crimea/Kerch/ancient coins）判断具体含义。","词源上与 Greek “Bosporos”有关，意思大致为“牛渡”（传说与神话意象相关），所以在学术或文学文本中常带有古典色彩。"]}
{"word":"Bosporus","summary":{"en":"The Bosporus is the famous strait in Turkey dividing Europe and Asia and linking the Black Sea to the Sea of Marmara.","zh":"Bosporus 指土耳其著名的博斯普鲁斯海峡，连接黑海与马尔马拉海，并分隔欧亚两洲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a narrow strait in Turkey that connects the Black Sea with the Sea of Marmara and separates Europe from Asia (also spelled “Bosphorus”).","zh":"（博斯普鲁斯海峡；也拼作 Bosphorus）土耳其的一条狭窄海峡，连接黑海与马尔马拉海，并分隔欧洲与亚洲。"},"examples":[{"en":"Istanbul sits on both sides of the Bosporus.","zh":"伊斯坦布尔横跨博斯普鲁斯海峡两岸。"},{"en":"Ships pass through the Bosporus to travel between the Black Sea and the Mediterranean region.","zh":"船只通过博斯普鲁斯海峡在黑海与地中海地区之间航行。"}]}],"synonyms":["Bosphorus","Bosphorus Strait"],"phonetic":"/ˈbɑspərəs/","extraExplanation":["“Bosporus”常见于国际新闻与历史/地缘政治语境，因为它是重要的航运通道与战略要地。英文里常与定冠词连用：the Bosporus。","词源来自古希腊语，常被解释为“牛渡”（与希腊神话相关的民间解释）。现代英语中 Bosporus 与 Bosphorus 两种拼写都可见，Bosphorus更常见。"]}
{"word":"Bosporus-related","summary":{"en":"“Bosporus-related” means connected with the Bosporus strait in Istanbul, Turkey.","zh":"“Bosporus-related”指与土耳其伊斯坦布尔的博斯普鲁斯海峡有关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with the Bosporus, a narrow strait in Istanbul, Turkey, linking the Black Sea and the Sea of Marmara (and separating Europe and Asia).","zh":"与博斯普鲁斯海峡有关的；涉及土耳其伊斯坦布尔的博斯普鲁斯海峡（连接黑海与马尔马拉海，并分隔欧亚两洲）。"},"examples":[{"en":"The report focused on Bosporus-related shipping delays.","zh":"这份报告重点讨论了与博斯普鲁斯海峡有关的航运延误。"},{"en":"Bosporus-related history often highlights Istanbul’s role as a bridge between Europe and Asia.","zh":"与博斯普鲁斯海峡相关的历史常常强调伊斯坦布尔作为连接欧亚的桥梁作用。"},{"en":"They planned a Bosporus-related walking tour along the waterfront.","zh":"他们计划了一场与博斯普鲁斯海峡相关的海滨步行之旅。"}]}],"synonyms":["Bosphorus-related","connected to the Bosporus","about the Bosporus"],"phonetic":"/ˈbɑspərəs rɪˈleɪtɪd/","extraExplanation":["“Bosporus”常见也写作“Bosphorus”。两种拼写都能见到；在现代英文里“Bosphorus”更常用，但“Bosporus”也被视为可接受变体。","“Bosporus-related”是常见的新闻/学术写法，用连字符表示“与……有关的”。在较口语的表达中，也可以说“related to the Bosporus / about the Bosporus”。","博斯普鲁斯海峡在文化与文学中常被当作“分界与连接”的象征：一座城市、一条水道把两个大陆同时分开又连接起来。"]}
{"word":"Bosque","summary":{"en":"Bosque means a grove or small woodland, especially a river-side tree belt in dry regions; it’s also used in place names.","zh":"Bosque 指小片树林/林丛，尤指干旱地区河流沿岸的树带；也常用作地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small woodland or grove of trees, especially one growing near a river in a dry region (common in the U.S. Southwest).","zh":"（尤指美国西南干旱地区河流附近的）小片树林；林丛"},"examples":[{"en":"We walked through a cottonwood bosque along the river.","zh":"我们沿着河边的棉白杨林丛散步。"},{"en":"The birds nest in the bosque because it offers shade and water nearby.","zh":"鸟类在这片林丛里筑巢，因为这里有阴凉，而且附近有水源。"}]},{"partOfSpeech":"n.","definition":{"en":"a wooded area or grove used as a place name (e.g., parks, neighborhoods, or towns).","zh":"作为地名使用的“树林/林地”（如公园、社区或城镇名）"},"examples":[{"en":"They live near the Bosque in the middle of town.","zh":"他们住在城镇中心那片名为“Bosque”的林地附近。"}]}],"synonyms":["grove","woodland","copse","thicket","riverine forest"],"phonetic":"/ˈbɑːskeɪ/","extraExplanation":["“Bosque”源自西班牙语，原意是“树林/森林”。在英语里它常出现在美国西南部的自然与生态语境中，尤其指河岸带（riparian）的林地，例如里奥格兰德河（Rio Grande）沿岸的棉白杨林。","在文学或地理写作中，bosque 常用来营造“干旱地带中一条河流带来的绿色走廊”的意象：周围荒凉，但河边树木成带，形成明显对比。"]}
{"word":"bosque","summary":{"en":"A riverside woodland or grove, especially in the U.S. Southwest.","zh":"沿河的林地/林带（尤指美国西南地区）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of woodland or scrubland (often in the U.S. Southwest) along a river, typically with cottonwoods, willows, and dense undergrowth; a riverside grove.","zh":"（常指美国西南部）河岸林地/灌丛带；沿河的树林或林带（常见棉白杨、柳树及茂密灌木）。"},"examples":[{"en":"We hiked through the bosque along the Rio Grande at sunrise.","zh":"我们在日出时沿着格兰德河的河岸林地（bosque）徒步。"},{"en":"Restoring the cottonwood bosque helps protect wildlife and reduce erosion.","zh":"修复棉白杨河岸林地（bosque）有助于保护野生动物并减少水土流失。"}]}],"synonyms":["riparian woodland","riverine forest","grove","thicket","scrubland"],"phonetic":"/ˈboʊskeɪ/","extraExplanation":["“Bosque”是从西班牙语借入英语的词，原意与“树林、林地”有关。在英语里它多用于生态学、地理或美国西南地区语境，特指河流附近的林带（尤其与Rio Grande等河谷相关）。","在美国地名中也常见，如新墨西哥州的“Bosque del Apache”（一处著名的野生动物保护区），这里的bosque强调“沿河的林地生态系统”。"]}
{"word":"bosques","summary":{"en":"“Bosques” usually means “forests/wooded areas” (Spanish plural of “bosque”), and it can also be a Spanish-language surname.","zh":"“Bosques”通常指“森林/林地”（西班牙语“bosque”的复数），也可用作西语姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) plural of “bosque”: forests; wooded areas.","zh":"（西班牙语）“bosque”的复数：森林；林地。"},"examples":[{"en":"The report mentions protected bosques in the mountain region.","zh":"报告提到了山区受保护的“bosques”（森林）。"},{"en":"Many birds live in the bosques along the river.","zh":"许多鸟类生活在河边的“bosques”（林地）里。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname (family name) found in Spanish-speaking communities.","zh":"（姓氏）在西语社群中常见的家族姓。"},"examples":[{"en":"Dr. Bosques will speak at the conference tomorrow.","zh":"Bosques 医生将于明天在会议上发言。"}]}],"synonyms":["forests","woods","woodlands"],"phonetic":"ˈbɔs.keɪz","extraExplanation":["“bosques”常见于关于拉丁美洲或西班牙的地理、生态与保护议题的英文文本中，通常会保留西语原词来强调当地语境；读者可直接理解为“forests/woods（森林/林地）”。"]}
{"word":"bosquet","summary":{"en":"A bosquet is a small, often deliberately planted grove of trees, especially in a landscaped garden or park.","zh":"Bosquet 指一片小树林或树丛，常指园林景观中有意栽植、布置的树木区域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small grove or group of trees, especially one planted or arranged as part of a garden or landscaped park (a French loanword used in English mainly in literature and landscape design).","zh":"小树林；（尤指园林/景观设计中）成片栽植或布置的一簇树木（法语外来词，在英语中多见于文学或景观语境）。"},"examples":[{"en":"We walked through a shaded bosquet of oaks behind the mansion.","zh":"我们穿过豪宅后方一片阴凉的橡树林。"},{"en":"The designer added a bosquet to create a quiet, enclosed corner in the garden.","zh":"设计师增设了一片树丛，让花园里形成一个安静、半封闭的角落。"},{"en":"In the novel, lovers meet in a bosquet at dusk, hidden from the crowd.","zh":"小说里，恋人们在黄昏时分于一片小树林里相会，避开人群的目光。"}]}],"synonyms":["grove","small wood","copse","clump of trees"],"phonetic":"/bɔˈskeɪ/","extraExplanation":["“Bosquet”来自法语，字面与“树林/树丛”相关。在欧洲古典园林（尤其是法式花园）里，bosquet 常指经过修剪、成块种植、像“绿色房间”一样的树木区域，用来营造私密小径、阴影与空间层次。","英语里它相对少见，常用于描写性写作、园林艺术或历史语境；日常口语更常说 grove / small wood / clump of trees。"]}
{"word":"bosquets","summary":{"en":"“Bosquets” means formal garden groves (the plural of “bosquet”).","zh":"“bosquets”指园林中的成片规划树丛/小树林（为“bosquet”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of “bosquet”) a small, formal grove or group of trees/shrubs planted in a designed garden, often arranged in a geometric pattern.","zh":"（“bosquet”的复数）指在园林设计中有意栽植、常呈几何布局的小树林或树丛（常见于正式花园）。"},"examples":[{"en":"The palace gardens were divided into paths, fountains, and bosquets of clipped trees.","zh":"宫殿花园被分成小径、喷泉，以及一片片修剪整齐的树丛（bosquets）。"},{"en":"We rested in the shade of the bosquets after walking under the hot sun.","zh":"我们在烈日下走了一阵后，便在那一片片小树林的树荫里休息。"}]}],"synonyms":["groves","thickets","tree clusters","copses"],"phonetic":"/boʊsˈkeɪ/","extraExplanation":["“bosquet”是从法语借来的词，在英语里多用于园林、艺术史与建筑史语境，尤其常用来描述法式古典园林（例如凡尔赛宫花园）中“有规划的树丛空间”。","在日常英语里，人们更常说“groves / thickets / clumps of trees”。用“bosquet(s)”会显得更文学、更专业。"]}
{"word":"Bosra","summary":{"en":"Bosra is an ancient city in southern Syria, best known for its Roman ruins, especially a large Roman theater.","zh":"Bosra（博斯拉）是叙利亚南部的一座古城，最著名的是罗马遗址，尤其是大型罗马剧场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient city in southern Syria, famous for well-preserved Roman ruins (especially its Roman theater) and long history as a trading and religious center.","zh":"叙利亚南部的一座古城，以保存良好的罗马遗址（尤其是罗马剧场）和作为历史上的贸易与宗教中心而闻名。"},"examples":[{"en":"Bosra is known for its impressive Roman theater.","zh":"博斯拉以其壮观的罗马剧场而闻名。"},{"en":"Many travelers visit Bosra to see ancient stone streets and ruins.","zh":"许多旅行者去博斯拉参观古老的石头街道和遗址。"}]}],"synonyms":["Busra"],"phonetic":"ˈboʊsrə","extraExplanation":["“Bosra”常见于历史、考古与旅行语境；英文里也可见拼写变体“Busra”。","博斯拉在罗马时期具有重要地位，城中罗马剧场保存较好，常被用作介绍罗马建筑与城市生活的例子。","它也出现在伊斯兰早期历史相关叙述中（多为地名背景），因此在宗教与历史读物里可能会遇到。"]}
{"word":"BOSS","summary":{"en":"“Boss” most commonly means a manager or the person in charge. Informally, it can also mean “excellent,” and as a verb it often means “to boss someone around.”","zh":"“boss”最常指“老板/上司”。口语中也可表示“很棒/很厉害”，作动词时常指“对人颐指气使（boss someone around）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the person in charge at work; a manager or supervisor","zh":"老板；上司；主管"},"examples":[{"en":"My boss asked me to finish the report by Friday.","zh":"老板让我周五前完成报告。"},{"en":"She’s a great boss who listens to her team.","zh":"她是个很好的老板，会倾听团队意见。"}]},{"partOfSpeech":"n.","definition":{"en":"someone or something that is very good or impressive (informal)","zh":"很棒的人/事；很厉害（非正式）"},"examples":[{"en":"You fixed it? You’re the boss!","zh":"你修好了？你太厉害了！"},{"en":"That new game is boss.","zh":"那款新游戏太棒了。"}]},{"partOfSpeech":"v.","definition":{"en":"to tell people what to do in an unpleasant or controlling way","zh":"对人颐指气使；摆出老板架子（常带负面）"},"examples":[{"en":"Stop bossing me around.","zh":"别对我呼来喝去。"},{"en":"He likes to boss people around even when he isn’t the manager.","zh":"他即使不是主管也喜欢指挥别人。"}]},{"partOfSpeech":"adj.","definition":{"en":"excellent; very good (informal, less common today)","zh":"极好的；很棒的（非正式，如今较少用）"},"examples":[{"en":"That’s a boss idea.","zh":"那真是个很棒的主意。"}]}],"synonyms":["manager","supervisor","employer","chief","lead","control","order around"],"phonetic":"/bɔs/","extraExplanation":["“boss”常见于职场语境，语气中性：the boss / my boss。若要更礼貌或更正式，可以用“manager”“supervisor”。","固定搭配“boss someone around”表示“对某人发号施令”，通常带抱怨或不满的情绪。","口语里“You’re the boss!”有时表示称赞或感谢（“你太牛了/你说了算”），但具体含义取决于语境和语气：可能是真夸，也可能是让步式地说“行，都听你的”。"]}
{"word":"boss","summary":{"en":"“Boss” most commonly means your supervisor at work; it can also mean the owner of a business, and as a verb it means to order people around. In slang, it can mean “excellent.”","zh":"“Boss”最常指工作中的上司/老板；也可指店主。作动词常表示“对人呼来喝去”。在俚语中还可表示“很棒”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person in charge at work; the person who supervises employees and makes decisions.","zh":"老板；上司：在工作中负责管理、监督员工并做决定的人。"},"examples":[{"en":"My boss asked me to finish the report by Friday.","zh":"我的老板让我在周五前完成报告。"},{"en":"She’s a fair boss who listens to her team.","zh":"她是个很公正的上司，会倾听团队意见。"}]},{"partOfSpeech":"n.","definition":{"en":"The owner or manager of a business (often used in small shops or informal situations).","zh":"店主；经营者：企业或店铺的拥有者/管理者（常用于小店或较口语的场景）。"},"examples":[{"en":"The boss of the café makes the best coffee.","zh":"那家咖啡馆的老板做的咖啡最好喝。"}]},{"partOfSpeech":"v.","definition":{"en":"To tell someone what to do in an annoying or overly controlling way.","zh":"颐指气使；对人指手画脚：用让人反感的方式命令或控制别人。"},"examples":[{"en":"Stop bossing me around—I'll do it my way.","zh":"别对我呼来喝去的——我会按自己的方式做。"},{"en":"He tends to boss people around when he’s stressed.","zh":"他压力大时容易对别人指手画脚。"}]},{"partOfSpeech":"adj.","definition":{"en":"Excellent; very impressive (informal slang).","zh":"很棒的；很厉害的（非正式俚语）。"},"examples":[{"en":"That new game is boss!","zh":"那个新游戏太牛了！"}]}],"synonyms":["manager","supervisor","employer","chief","owner"],"phonetic":"/bɔs/","extraExplanation":["在英语里，\"boss\"既可以是中性的“上司/老板”，也可能带一点强势或权力感。若想更礼貌、更正式地称呼工作中的上司，可以用 \"manager\"（经理）、\"supervisor\"（主管）或 \"director\"（总监）等具体职位名。","动词用法常见于短语 \"boss (someone) around\"，语气通常是负面的，表示“对人发号施令”。如果只是“带领/协调”，更中性可用 \"lead\" 或 \"manage\"。"]}
{"word":"boss around sb.","summary":{"en":"to give someone rude, controlling orders","zh":"粗暴地指挥或支配别人"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to keep telling someone what to do in a rude or controlling way; to order someone around","zh":"粗暴或控制欲很强地指挥/支配某人；对某人呼来喝去"},"examples":[{"en":"Stop bossing me around—I'll do it my way.","zh":"别对我呼来喝去——我会按自己的方式做。"},{"en":"He bosses his younger brother around all the time.","zh":"他总是对弟弟指手画脚。"},{"en":"Even though she isn’t the manager, she tries to boss everyone around.","zh":"虽然她不是经理，但她总想指挥所有人。"}]}],"synonyms":["order around","push around","push about","throw one's weight around","dominate","bully","control","command"],"phonetic":"/bɔs əˈraʊnd/","extraExplanation":["语气通常偏负面，表示“爱管人、爱摆架子”。对上级也能用，但往往带抱怨意味：My boss is always bossing me around.","常见结构：boss + 人 + around；也可用被动：I got bossed around all day."],"etymology":"来自名词 boss（老板/头儿）转为动词“发号施令”，再加上副词 around 表示“到处、来回”，合起来强调“把人当手下来使唤、到处差遣”。","mnemonic":["把 boss 想成“老板”，around 想成“到处”，合起来就是“老板一样到处指挥你”。","联想中文“呼来喝去/指手画脚”，一看到 around 就想到“差来差去”。"]}
{"word":"boss sb. around","summary":{"en":"order someone around rudely or annoyingly","zh":"粗鲁或令人厌烦地指挥别人、呼来喝去"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to keep telling someone what to do in an annoying or rude way; to treat someone as if you are their boss","zh":"对某人颐指气使；把某人呼来喝去；以老板/上司的口气指挥某人"},"examples":[{"en":"Stop bossing me around—I know how to do my job.","zh":"别对我呼来喝去的——我知道怎么做我的工作。"},{"en":"He hates being bossed around by people who don’t listen.","zh":"他讨厌被那些不倾听的人指挥来指挥去。"},{"en":"She felt her older brother was always bossing her around at home.","zh":"她觉得哥哥在家总是对她指手画脚。"}]}],"synonyms":["order around","push around","give orders","domineer","bully","control","lord it over"],"phonetic":"/bɔs əˈraʊnd/","extraExplanation":["常见搭配：boss someone around（最常用），也可说 boss someone about（英式英语里更常见一些）。","语气通常偏负面，暗示对方爱管人、态度不尊重。需要中性表达时可用 “tell/ask someone what to do” 或 “give instructions”.","时态用法：bossed around（过去式/过去分词），bossing around（进行）。"],"etymology":"“boss”原意为“老板/头儿”，19世纪在美式英语中常用；“boss around”字面就是“像老板一样把人支来使去”，后来固定成口语搭配，表示“颐指气使地指挥别人”。","mnemonic":["把 boss 想成“老板”，around 想成“到处（使唤你跑来跑去）”：老板让你到处跑＝对你呼来喝去。","联想中文“指挥/摆谱”：boss 的“谱”很大，所以总爱 boss people around。"]}
{"word":"boss somebody about","summary":{"en":"give someone orders too much in a controlling way","zh":"对某人过度发号施令、指手画脚"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to keep telling someone what to do (often in an annoying, controlling way)","zh":"对某人指手画脚；老是命令某人做这做那（常带烦人、控制欲强的语气）"},"examples":[{"en":"Stop bossing me about—I can do it myself.","zh":"别再对我指手画脚了——我自己会做。"},{"en":"He kept bossing her about during the project, and she got upset.","zh":"项目期间他一直对她指手画脚，她就不高兴了。"},{"en":"Parents should guide kids, not boss them about all the time.","zh":"父母应该引导孩子，而不是总对孩子呼来喝去。"}]}],"synonyms":["order around","push around","domineer","command","dictate","micro-manage"],"phonetic":"/bɔs ˈsʌmbədi əˈbaʊt/","extraExplanation":["更常见的说法是 “boss someone around”。英式英语里 “boss someone about” 也常用，意思相同。","语气通常偏负面：暗示不尊重对方、过度控制。若只是正常“安排工作”，更中性可用 “manage”, “direct”, “supervise”。"],"etymology":"“boss”最早来自荷兰语 baas（老板、主管），后来在英语里既可作名词“老板”，也可作动词表示“当…的老板/发号施令”。短语里强调“用老板的口气支配别人”。","mnemonic":["把 boss 记成“老板”：像老板一样对别人下命令 → 就是 boss somebody about/around。","联想中文“指手画脚/呼来喝去”，基本就是这个短语的情绪色彩。"]}
{"word":"boss somebody around","summary":{"en":"to order someone around in a controlling, often rude way","zh":"以控制欲强、常带无礼的方式指挥别人"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to keep telling someone what to do in a rude or controlling way; to treat someone as if you are their boss","zh":"以粗鲁或控制欲很强的方式不断指挥某人；把别人当成下属使唤"},"examples":[{"en":"Stop bossing me around—I know what to do.","zh":"别再对我呼来喝去了——我知道该做什么。"},{"en":"He keeps bossing his little sister around.","zh":"他老是对妹妹颐指气使。"},{"en":"I don’t mind advice, but I hate being bossed around.","zh":"我不介意别人给建议，但我讨厌被人呼来喝去。"}]}],"synonyms":["order around","push around","give someone orders","throw one’s weight around","domineer"],"phonetic":"/bɔs ˈsʌmˌbɑdi əˈraʊnd/","extraExplanation":["语气通常偏负面，常暗示“爱控制、没礼貌、把人当工具”。","常见结构：boss someone around（主动）；be bossed around（被动）。","与“give instructions（下指示）”不同，这个短语更强调态度让人不舒服。"],"etymology":"源自名词 boss（老板、上司），后来口语中作动词表示“像老板一样指挥”。around 在这里表示“到处、来来回回地”，强化“不断地使唤/指挥”的感觉。","mnemonic":["把 boss 想成“老板”，around 想成“到处/不停地”：老板在你周围到处指挥你＝“对你呼来喝去”。","联想中文：颐指气使、呼来喝去、使唤人。"]}
{"word":"boss-board","summary":{"en":"a top-management decision-making board","zh":"高层管理决策委员会"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A board or committee made up of top managers or bosses, especially one that makes major decisions in a company or organization.","zh":"（非正式）由高层管理者/老板组成的董事会或决策委员会，负责做重大决定。"},"examples":[{"en":"The proposal has to be approved by the boss-board before we can launch the product.","zh":"这个提案必须先得到“老板董事会”批准，我们才能发布产品。"},{"en":"She presented the budget to the boss-board on Monday.","zh":"她周一把预算方案汇报给了高层决策委员会。"},{"en":"The boss-board asked for a clearer timeline and risk plan.","zh":"高层决策层要求更清晰的时间表和风险预案。"}]}],"synonyms":["board of directors","executive board","management board","senior leadership","top management"],"phonetic":"/bɔs bɔrd/","extraExplanation":["这个说法不算标准固定词，在正式场合更常用 board of directors（董事会）、executive board（执行董事会）、senior management（高层管理）。","如果你在某个行业、游戏、论坛或作品里看到它，可能是特定圈子的用法；需要结合上下文确认具体指哪种“board”。"],"etymology":"由 boss（老板）+ board（委员会/董事会）组合而成的非正式说法；用连字符强调“由老板组成的委员会”。","mnemonic":["把它拆开记：boss（老板）+ board（董事会/委员会）= “老板们坐在一起开会做决定的那块板/那群人”。","联想中文“老板组/高层会”，看到 board 就想到“委员会/董事会”。"]}
{"word":"boss-man","summary":{"en":"An informal term for a boss or a friendly way to address someone as “boss.”","zh":"非正式地指“老板/主管”，也可作对人的友好称呼（类似“老板/哥们儿”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, slang) A boss; a man who is in charge at work or in a group, especially an employer or supervisor.","zh":"（非正式，俚语）老板；在工作或团体中掌权的人，尤指雇主或主管。"},"examples":[{"en":"I need to ask the boss-man for a day off.","zh":"我得跟老板请一天假。"},{"en":"The boss-man wants the report by Friday.","zh":"老板要周五前交报告。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, slang) A way to address someone (often a man) to show friendliness or respect, similar to “boss.”","zh":"（非正式，俚语）对某人（常为男性）的称呼，表示友好或尊重，类似“老板/哥们儿”。"},"examples":[{"en":"Thanks, boss-man. I appreciate it.","zh":"谢了，老板/哥们儿，真是感激。"},{"en":"Morning, boss-man—how’s it going?","zh":"早啊，老板/哥们儿，最近怎么样？"}]}],"synonyms":["boss","supervisor","manager","chief","foreman","employer","head honcho"],"phonetic":"ˈbɔs ˌmæn","extraExplanation":["语气与场合：非常口语，适合熟人或轻松氛围。对陌生人或正式场合可能显得不够得体。","人际含义：有时带一点“讨好/套近乎”的感觉；在某些语境中也可能被理解为居高临下或带戏谑，具体取决于语气和关系。","拼写与形式：常见写法有 boss man、boss-man、bossman；含义基本相同。"],"etymology":"由 boss（老板、管事的人）+ man（男人/人）组合而成的口语表达；在英语口语中常作昵称式称呼，也可指“主管/雇主”。","mnemonic":["把它拆开记：boss（老板）+ man（人）→“管事的那个人”。","联想中文口语称呼“老板/老板哥”，多用于套近乎或表示客气。"]}
{"word":"bossa","summary":{"en":"“Bossa” usually refers to the Brazilian music style known as bossa nova; less commonly, it means a distinctive style or knack.","zh":"“bossa”通常指巴萨诺瓦（bossa nova）这种巴西音乐风格；较少见时也可指独特风格或诀窍。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in music) a Brazilian jazz-influenced style, especially as part of the term “bossa nova.”","zh":"（音乐）巴西的一种受爵士影响的风格，常见于短语“bossa nova（巴萨诺瓦）”。"},"examples":[{"en":"She loves listening to bossa in the evening because it feels calm and warm.","zh":"她喜欢晚上听bossa（巴萨诺瓦风格）的音乐，因为感觉平静又温暖。"},{"en":"The guitarist added a light bossa rhythm to the song.","zh":"吉他手给这首歌加入了轻柔的bossa节奏。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a special style, flair, or knack; a unique way of doing something.","zh":"（较少见）风格、魅力或诀窍；做事的独特方式。"},"examples":[{"en":"He has a natural bossa for telling stories.","zh":"他讲故事很有天生的“bossa”（独特的味道/诀窍）。"}]}],"synonyms":["bossa nova","Brazilian jazz","groove","flair"],"phonetic":"/ˈbɑːsə/","extraExplanation":["“Bossa”来自葡萄牙语，在巴西口语里可指“风格、门道、诀窍”。“Bossa nova”字面意思接近“新风格”。这种音乐在20世纪50—60年代的里约热内卢兴起，代表人物常被提到的有João Gilberto、Antônio Carlos Jobim等。英语里单独说“bossa”多半是简写，实际还是在指bossa nova的感觉与节奏。"]}
{"word":"bossage","summary":{"en":"Bossage is projecting, often rough-faced stonework on a building, used for a strong decorative effect.","zh":"Bossage 指建筑表面凸出的（常带粗糙质感的）石作处理，用于装饰并营造厚重坚固的效果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Architecture) Rough or raised stonework left projecting on a building’s surface, often used for decoration or to make the wall look strong and solid.","zh":"（建筑）凸出的、带粗糙质感的石砌表面（常用于装饰或营造坚固厚重的视觉效果）。"},"examples":[{"en":"The palace entrance is framed by heavy bossage to emphasize power and stability.","zh":"宫殿入口用厚重的凸石装饰来强调权力感与稳固感。"},{"en":"Architects used bossage on the lower floors to make the building look more grounded.","zh":"建筑师在底层使用凸石处理，让建筑看起来更稳、更“扎根”。"},{"en":"The old city gate still shows bossage blocks with rough, unfinished faces.","zh":"古城门仍能看到表面粗糙、未精修的凸石块。"}]}],"synonyms":["rustication","rough-faced masonry","projecting stonework"],"phonetic":"/ˈbɑsɪdʒ/","extraExplanation":["“bossage”常出现在描述古典或文艺复兴风格建筑的文章里，和“rustication（粗面石作/锈石）”相关但不完全相同：rustication更强调石块之间的深缝与粗面效果；bossage更强调石块（或其表面）“凸出”的体量感。","词源来自法语 bossage，与“boss（凸起、结节）”同源，因此它核心的画面感就是“凸出来的一块”。"]}
{"word":"bossboy","summary":{"en":"“Bossboy” is an informal slang term for a boy/young man who acts like a boss—either playfully (a capable leader) or negatively (bossy and controlling).","zh":"“Bossboy”是非正式俚语，指像“老板/小领导”一样的男孩或年轻男子；可褒可贬，取决于语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an informal term for a boy or young man who acts like a boss (bossy, controlling, or trying to lead others); sometimes used playfully, sometimes as a mild insult","zh":"非正式用语：指表现得像“老板/领导”的男孩或年轻男子（爱指挥、很强势、总想带头）；有时是开玩笑，有时带点贬义"},"examples":[{"en":"Stop telling everyone what to do, bossboy—let them decide.","zh":"别老指挥大家了，bossboy——让他们自己决定。"},{"en":"He’s a bit of a bossboy in group projects, but he gets things organized.","zh":"小组作业里他有点“bossboy”的样子，不过确实能把事情组织起来。"},{"en":"Nice work, bossboy! You handled that like a pro.","zh":"干得漂亮，bossboy！你处理得很专业。"}]}],"synonyms":["bossy kid","little boss","control freak (informal, stronger)","young leader"],"phonetic":"/ˈbɔsˌbɔɪ/","extraExplanation":["“bossboy”并不是非常标准或常见的词，更像是口语里的临时组合（boss + boy）。在不同语气下可能是调侃、夸赞（像小领导一样能干），也可能是讽刺（太爱当家作主）。正式写作中建议用更清晰的表达，例如：“bossy kid / controlling guy / young leader”。","如果用于陌生人或在严肃场合，可能显得不礼貌；对熟人用作玩笑更常见。"]}
{"word":"bossdom","summary":{"en":"Bossdom means the dominance or controlling influence of bosses, often in a critical way.","zh":"Bossdom 指老板/上司的支配与控制影响，常带批评意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the power, influence, or controlling culture of bosses (especially in a workplace); boss rule or domination","zh":"（尤指职场中）老板/上司的权力、影响力或控制文化；“老板统治/上司支配”"},"examples":[{"en":"People complained that bossdom was stifling creativity in the office.","zh":"人们抱怨办公室里的“上司支配”扼杀了创造力。"},{"en":"Under bossdom, employees may feel they can’t speak up.","zh":"在“老板统治”的氛围下，员工可能会觉得不敢开口表达。"},{"en":"The new policy was meant to reduce bossdom and encourage teamwork.","zh":"这项新政策旨在减少“上司支配”，鼓励团队合作。"}]}],"synonyms":["management domination","boss rule","top-down control","micromanagement (related)","authoritarian management"],"phonetic":"/ˈbɔs.dəm/","extraExplanation":["“bossdom”不是非常常见的标准词，更常见的表达是“bossy culture / micromanagement / management domination”。它常用来带一点批评意味，强调“老板说了算”的氛围。","词尾“-dom”表示“……的领域/状态/统治”，类似：“kingdom（王国）”“officialdom（官僚集团/官场）”。因此“bossdom”字面意思就是“boss 的统治/势力范围”。"]}
{"word":"bossdoms","summary":{"en":"Bossdoms means areas or situations ruled by a boss, often with a critical or joking tone.","zh":"bossdoms 指“老板/上司的地盘或统治范围”，常带调侃或批评意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of bossdom: a place, organization, or situation controlled by a boss (often used humorously or critically).","zh":"bossdom 的复数：由“老板/上司”掌控的地方、组织或局面（常带调侃或批评语气）。"},"examples":[{"en":"After the merger, the company felt like two competing bossdoms.","zh":"合并之后，公司感觉像两个互相较劲的“老板地盘”。"},{"en":"In these bossdoms, decisions come from the top and rarely get questioned.","zh":"在这些“老板王国”里，决定都来自上层，几乎没人质疑。"}]},{"partOfSpeech":"n.","definition":{"en":"areas of excessive bossy authority; environments where people are controlled in an overly strict way (informal).","zh":"（非正式）指过度“官威/老板气”的掌控范围；对人管得过严的环境。"},"examples":[{"en":"Some teams turn into little bossdoms where creativity disappears.","zh":"有些团队会变成小小的“老板统治圈”，创意就消失了。"},{"en":"She left because she was tired of working in bossdoms.","zh":"她离开了，因为她厌倦在那种“老板一言堂”的环境里工作。"}]}],"synonyms":["fiefdoms","domains","turfs","empires","power bases"],"phonetic":"/ˈbɔs.dəm/","extraExplanation":["“bossdom”不是最常见的标准词，更像是创造性/口语化的用法。后缀“-dom”常表示“领域、统治范围、状态”，比如 kingdom（王国）、freedom（自由的状态）。因此 bossdom 大致就是“老板的地盘/老板统治的范围”。","语气上常带讽刺或批评，暗示权力过度集中、等级森严、下属缺少话语权。"]}
{"word":"bossed","summary":{"en":"“Bossed” means “gave orders to; controlled” (past of “boss”), often with a pushy tone.","zh":"“bossed”是“boss”的过去式，表示“发号施令、支使、管控”，常带强势/爱管人的语气。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of “boss”: to give someone orders; to be in charge and tell people what to do (often implying a pushy or controlling tone).","zh":"“boss”的过去式/过去分词：指挥、支使某人；当“老板/上司”一样发号施令（常带有强势、爱管人的语气）。"},"examples":[{"en":"She bossed her younger brother to clean the room.","zh":"她命令弟弟去打扫房间。"},{"en":"He bossed the team around instead of listening to their ideas.","zh":"他只会对团队发号施令，而不听他们的想法。"},{"en":"I’ve been bossed by people who weren’t even my manager.","zh":"我被一些甚至不是我上司的人指使过。"}]}],"synonyms":["ordered","commanded","directed","pushed around","ran"],"phonetic":"/bɔst/","extraExplanation":["“bossed”在口语里经常带负面评价，暗示说话者觉得对方“爱管人、控制欲强”。如果只是中性表达“负责/管理”，更常用 managed, supervised, led。","常见搭配是 bossed around（到处支使/颐指气使），比单独的 boss 更强调“被人摆布”的感觉。"]}
{"word":"bosselated","summary":{"en":"Bosselated means having a surface with rounded bumps or raised knobs, especially in art, architecture, or descriptive writing.","zh":"bosselated 指表面有圆形隆起或凸饰，常用于艺术、建筑或描写性文字。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with rounded bumps or raised knobs (called “bosses”); having a knobby, lumpy surface.","zh":"表面布满圆形突起（称为“boss/隆起”）；呈结节状、凸起状。"},"examples":[{"en":"The bosselated surface of the rock showed years of wind erosion.","zh":"岩石表面布满圆形突起，显示出多年风蚀的痕迹。"},{"en":"In the museum, a bosselated bronze shield caught the light in small highlights.","zh":"博物馆里一面表面凸起的青铜盾牌在灯光下闪着点点高光。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Architecture/Art) Decorated with raised, rounded projections, often used for a rugged, sculpted look.","zh":"（建筑/艺术）以圆形凸饰装饰；常用于营造粗犷、雕塑感的外观。"},"examples":[{"en":"The doorway was framed by bosselated stonework.","zh":"门口由带圆形凸饰的石作框起。"},{"en":"The sculptor used a bosselated texture to make the armor look heavier.","zh":"雕塑家用凸起的纹理让盔甲看起来更厚重。"}]}],"synonyms":["knobby","bumpy","lumpy","bossy (architectural)","embossed"],"phonetic":"ˈbɑsəˌleɪtɪd","extraExplanation":["“bosselated”来自名词“boss”（凸起、圆形装饰/隆起），常见于艺术史、建筑史与地质/材料描述中，语气偏书面与专业。","在建筑里，boss（凸饰）常用于石砌立面或门框等部位，形成一种“粗凿、厚重、有雕刻感”的视觉效果；因此 bosselated 常用来形容表面“结实、隆起、起伏”的质感。"]}
{"word":"bosselation","summary":{"en":"Bosselation means raised, boss-like decorative relief, often seen in architecture or metalwork.","zh":"Bosselation 指由“凸起装饰（boss）”形成的浮雕式装饰，常见于建筑或金属工艺。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Ornamentation made of raised, rounded projections (bosses), especially in architecture, metalwork, or decorative carving; embossed decoration.","zh":"（尤指建筑、金属工艺或雕刻中的）凸起的圆形装饰（boss）所形成的装饰；浮雕式装饰。"},"examples":[{"en":"The cathedral’s doorway was framed with rich bosselation carved into the stone.","zh":"大教堂的门廊边框上雕着丰富的凸起装饰。"},{"en":"The shield showed bosselation that caught the light like small domes.","zh":"盾牌上有凸起装饰，像小圆顶一样在光线下闪亮。"}]}],"synonyms":["embossing","raised ornamentation","bossed decoration","relief work"],"phonetic":"/ˌbɑsəˈleɪʃən/","extraExplanation":["这是一个偏文学/专业的词，日常英语很少用。更常见的说法是“bossed decoration / embossed decoration / raised ornament”。","词源上与“boss”（凸起的圆形饰钉/饰块；也可泛指隆起）同源，常用于描述哥特式或罗曼式建筑的石雕装饰、金属器上的凸纹等。"]}
{"word":"bosser","summary":{"en":"“Bosser” is an informal noun for someone who likes ordering others around.","zh":"“bosser”是非正式名词，指喜欢对别人发号施令、爱指挥的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who bosses other people around; someone who likes giving orders (informal).","zh":"爱指挥别人的人；爱发号施令的人（非正式）。"},"examples":[{"en":"He’s not the manager—he’s just a bosser who likes telling everyone what to do.","zh":"他不是经理——他只是个爱指挥人的家伙，总喜欢告诉大家该做什么。"},{"en":"Try not to sound like a bosser when you give feedback.","zh":"你提反馈时尽量别让自己听起来像在发号施令。"}]}],"synonyms":["bossy person","pushy person","backseat driver","control freak"],"phonetic":"/ˈbɔsɚ/","extraExplanation":["“bosser”= boss（指挥、支配）+ -er（做某事的人）。常见于口语或非正式写作，用来带一点负面评价，意思接近 “pushy person / bossy person”。","注意区分：boss（老板/上司）是正式中性；bossy（爱摆架子、爱指挥）是形容词；bosser（爱指挥的人）更像对人的标签，语气通常不太友好。"]}
{"word":"bosses","summary":{"en":"“Bosses” means multiple bosses (managers/supervisors), or it can mean “orders people around” as a verb.","zh":"“bosses”可表示“多个老板/上司”，也可作动词表示“对人发号施令（常带贬义）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “boss”: people who manage or supervise other workers; the person in charge","zh":"“boss”的复数：老板；上司；主管；负责人"},"examples":[{"en":"All the bosses agreed to raise wages next year.","zh":"所有老板都同意明年加薪。"},{"en":"My bosses want the report by Friday.","zh":"我的上司希望周五前拿到报告。"}]},{"partOfSpeech":"v.","definition":{"en":"third-person singular of “boss”: to give orders to someone in a controlling way (often used with “around”)","zh":"“boss”的第三人称单数：以命令式、控制欲强的方式指挥/支配（常与“around”连用）"},"examples":[{"en":"He bosses everyone around, even when it’s not his job.","zh":"他老是对所有人呼来喝去，即使那不是他的工作。"},{"en":"She bosses the team too much instead of listening.","zh":"她对团队管得太多，而不是倾听。"}]}],"synonyms":["managers","supervisors","heads","leaders","directors","boss around"],"phonetic":"/ˈbɔsɪz/","extraExplanation":["“bosses”既可以是名词复数（多个老板/上司），也可以是动词第三人称单数（he/she/it bosses）。","拼写规则：以 -s/-ss/-sh/-ch/-x/-z 结尾的名词或动词加 -es 构成复数或第三人称单数：boss → bosses。","口语里“boss someone around”带贬义，表示“摆架子、颐指气使”。如果想表达中性“管理”，更常用“manage/lead/supervise”。"]}
{"word":"bosset","summary":{"en":"“Bosset” is a rare/old adjective meaning “having raised bumps or studs; bulging.”","zh":"“bosset”是一个罕见的古义形容词，表示“有凸起（如铆钉/圆凸饰）的；鼓起的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare, archaic) Having a raised bump or knob; bulging or studded with small rounded projections.","zh":"（罕见/古义）有凸起的圆疙瘩；鼓起的；布满小圆凸饰的。"},"examples":[{"en":"The old shield was bosset with small metal studs.","zh":"那面旧盾牌上布满了小金属铆钉凸起。"},{"en":"In the stonework, you can see bosset details around the arch.","zh":"在石雕上，你能看到拱门周围的凸饰细节。"}]}],"synonyms":["bossed","knobbed","studded","embossed"],"phonetic":"/ˈbɑsət/","extraExplanation":["“bosset”在现代英语里非常少见，多出现在较老的文学、建筑/纹章（heraldry）描述中。它和名词“boss”（凸起的圆饰、铆钉状装饰）同源，因此可理解为“带有boss状凸起的”。","如果你原本想查的是更常见的词，可能是拼写接近的：bossed（有凸起装饰的/被凸起装饰的）、bosom（胸怀）、或bossy（爱指挥人的）。你也可以告诉我你看到它的句子，我能更准确判断意思。"]}
{"word":"bosseyed","summary":{"en":"Bosseyed means cross-eyed or squint-eyed (a dialect, informal word).","zh":"bosseyed 指“斜视、斗鸡眼”（较少见的方言/非正式用法）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Dialect, informal) Having eyes that look in different directions; cross-eyed; squint-eyed.","zh":"（方言，非正式）斜视的；斗鸡眼的；两眼不对准的。"},"examples":[{"en":"The old sailor in the story was described as bosseyed and weather-beaten.","zh":"故事里把那位老水手描写得斜着眼、饱经风霜。"},{"en":"He’s not mocking you—he’s bosseyed, so his gaze can look confusing.","zh":"他不是在取笑你——他有点斜视，所以目光看起来可能会让人误会。"}]}],"synonyms":["cross-eyed","squint-eyed","wall-eyed (regional)"],"phonetic":"ˈbɑsˌaɪd","extraExplanation":["“bosseyed”（也常写作 boss-eyed）是比较少见的地区性用词，在苏格兰英语、爱尔兰英语以及部分英国方言中更常见；在现代标准美式英语里不常用。","使用时要注意礼貌与敏感度：描述他人的身体特征（如斜视）可能显得冒犯。更中性、医学或日常更常用的表达是 “cross-eyed” 或 “have strabismus（斜视）”。"]}
{"word":"bossier","summary":{"en":"“Bossier” usually means “more bossy,” the comparative form of “bossy.”","zh":"“bossier”通常表示“更爱指挥人的”，是“bossy”的比较级。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"more bossy; more inclined to give orders or control other people (often in an annoying way).","zh":"更爱发号施令的；更爱控制别人的（常含贬义：更讨人厌的指挥型）。"},"examples":[{"en":"Since he got promoted, he’s become even bossier with his teammates.","zh":"自从他升职以后，他对队友变得更爱指挥了。"},{"en":"Don’t get bossier just because you’re older.","zh":"别因为你年纪大就变得更爱摆架子、指挥人。"},{"en":"Her tone sounded bossier than usual during the meeting.","zh":"她在会议上的语气听起来比平时更强势、更爱指挥。"}]}],"synonyms":["more domineering","more controlling","more pushy","more overbearing"],"phonetic":"/ˈbɔsiər/","extraExplanation":["“bossier”是形容词“bossy（爱指挥人的）”的比较级，常用于口语中表达“比……更爱管人/更爱下命令”。","注意：在美国还有地名/专有名词“Bossier”（如路易斯安那州的 Bossier City）。作为地名时通常不按“更bossy”来理解，而是专名。"]}
{"word":"bossies","summary":{"en":"\"Bossies\" can mean (1) people who are bossy (informal plural noun), or (2) small bushes/shrubs in South African English.","zh":"“bossies”可以指（1）爱指挥别人的人（非正式复数名词），也可在南非英语中指（2）小灌木/灌木丛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of \"bossy\" when used as a noun: people (often children) who like to tell others what to do.","zh":"“bossy”作名词时的复数：爱指挥别人、喜欢发号施令的人（常指孩子）。"},"examples":[{"en":"Stop being bossies and let everyone choose the game together.","zh":"别当“指挥怪”了，让大家一起决定玩什么游戏。"},{"en":"The teacher separated the bossies so the group could work calmly.","zh":"老师把那些爱指挥的人分开了，这样小组才能平静地合作。"}]},{"partOfSpeech":"n.","definition":{"en":"(South African English, from Afrikaans) Small bushes or shrubs; little clumps of bush.","zh":"（南非英语，源自南非荷兰语）小灌木；一丛丛的小树林/小枝丛。"},"examples":[{"en":"We rested in the shade of the bossies along the path.","zh":"我们在小路旁的灌木丛阴影里休息。"},{"en":"The birds hid in the bossies near the fence.","zh":"鸟儿躲在栅栏旁的灌木丛里。"}]}],"synonyms":["bossy people","little bosses","backseat drivers","shrubs","bushes"],"phonetic":"ˈbɔsiz","extraExplanation":["“bossies”在标准美式/英式英语里不算常见：如果你在普通对话或写作中看到它，多半是把“bossy”当作名词后加复数 -ies（类似 puppy → puppies）。","在南非语境中，“bossies”常被当作地貌/自然环境词使用，来自南非荷兰语（Afrikaans）里与“bos（灌木/树林）”相关的说法，因此在旅行文学、户外描述或当地口语中更常见。"]}
{"word":"bossiest","summary":{"en":"“Bossiest” means the most bossy—most controlling or telling others what to do.","zh":"“bossiest”表示“最爱指挥人的/最霸道的”，是bossy的最高级。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Always trying to tell other people what to do in a controlling way; acting like the boss too much.","zh":"爱指挥人的；最爱摆架子、对别人发号施令的。"},"examples":[{"en":"My little brother is bossiest when we play games—he makes all the rules.","zh":"我弟弟玩游戏时最爱指挥人——规则都要他来定。"},{"en":"She can sound bossiest in group chats, but she usually just wants things to run smoothly.","zh":"她在群聊里听起来可能最爱发号施令，但她通常只是想让事情顺利进行。"}]}],"synonyms":["most bossy","most controlling","most domineering","pushiest"],"phonetic":"/ˈbɔsiəst/","extraExplanation":["“bossiest”是形容词“bossy”的最高级（bossy → bossier → bossiest）。常用来带点批评地说某人太爱指挥、太强势。","语气上比“confident（自信）/decisive（果断）”更负面；在礼貌表达中也可用更软的说法，如“a bit controlling（有点控制欲）”或“very directive（指令性很强）”。"]}
{"word":"bossily","summary":{"en":"“Bossily” means speaking or acting in a controlling, bossy way.","zh":"“bossily”表示说话或做事很专横、爱指挥，带有负面语气。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a bossy or domineering way; in a manner that tries to control other people.","zh":"专横地；爱指挥地；以命令人的方式。"},"examples":[{"en":"She spoke bossily to the new employee, as if he had done everything wrong.","zh":"她对新员工说话很专横，好像他什么都做错了一样。"},{"en":"He bossily told everyone where to sit, even though it wasn’t his event.","zh":"他很爱指挥地告诉大家该坐哪里，尽管那并不是他主办的活动。"}]}],"synonyms":["domineeringly","imperiously","authoritatively","commandingly"],"phonetic":"/ˈbɔsəli/","extraExplanation":["“bossily”来自形容词“bossy”（爱指挥人的、颐指气使的）+ 副词后缀“-ly”。语气通常带负面评价，暗示说话者不礼貌、爱控制他人。","近义词细微差别：domineering（更强调强势控制）、authoritatively（更偏“以权威口吻”，不一定负面）、commandingly（用命令的语气）。使用时可根据语境选择更中性或更强烈的词。"]}
{"word":"bossiness","summary":{"en":"Bossiness means an overly controlling, order-giving attitude toward others.","zh":"Bossiness 指对他人过度控制、爱发号施令的态度（多为贬义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the habit or quality of always telling other people what to do in a rude or controlling way","zh":"爱指挥（他人）的习气或特质；喜欢用粗鲁或强势的方式支配别人"},"examples":[{"en":"Her bossiness at work made teamwork difficult.","zh":"她在工作中的爱指挥让团队合作变得困难。"},{"en":"He confused leadership with bossiness and annoyed his classmates.","zh":"他把领导力误当成爱指挥，惹恼了同学。"},{"en":"Try to give feedback without bossiness—ask questions instead of giving orders.","zh":"尽量在给建议时别显得爱指挥——用提问代替下命令。"}]}],"synonyms":["pushiness","domineering behavior","authoritarianism"],"phonetic":"/ˈbɔsɪnəs/","extraExplanation":["“bossiness”通常是贬义，强调“爱管人、爱发号施令”的感觉；而“leadership”更中性/褒义，强调带领团队、做决定并承担责任。","常见搭配：bossiness + at work/in class/at home；criticize/complain about someone’s bossiness（批评/抱怨某人的爱指挥）；a touch of bossiness（有点强势）。","相关词对比：bossy（爱指挥的，形容词）；boss（老板/上司，名词）；to boss someone around（把某人呼来喝去，短语动词，偏口语且多为贬义）。"]}
{"word":"bossing","summary":{"en":"“Bossing” usually means acting bossy—ordering people around; it can also mean managing/directing something.","zh":"“Bossing”通常指摆出老板架子、支使别人；也可指管理/主导某事。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Present participle of “boss”) giving orders in a controlling way; acting like someone’s boss, often in an annoying or unfair manner.","zh":"（“boss”的现在分词）以控制的方式发号施令；像老板一样支使别人，常带贬义（令人反感/不公平）。"},"examples":[{"en":"Stop bossing me around—I can do it myself.","zh":"别老对我颐指气使——我自己会做。"},{"en":"She was bossing everyone during the group project.","zh":"小组项目时她一直在指挥/支使所有人。"},{"en":"He apologized for bossing his younger brother.","zh":"他为自己对弟弟颐指气使而道歉。"}]},{"partOfSpeech":"v.","definition":{"en":"managing or directing something (neutral or positive, less common in everyday speech).","zh":"管理或主导某事（语气较中性或正面；日常口语中相对少见）。"},"examples":[{"en":"He’s been bossing the kitchen since the head chef left.","zh":"主厨离开后，他一直在主理厨房的工作。"},{"en":"She’s bossing the team today while the manager is away.","zh":"经理不在时，她今天负责带领团队。"}]}],"synonyms":["ordering around","pushing around","domineering","managing","directing"],"phonetic":"/ˈbɔsɪŋ/","extraExplanation":["“bossing (someone) around”是最常见搭配，强调“命令、支使、摆架子”。如果想表达更中性的“管理/带领”，更常用“managing / leading / running (the team)”等。"]}
{"word":"bossism","summary":{"en":"Bossism means domineering, bossy behavior, and can also mean political control by party “bosses.”","zh":"Bossism 指专横、爱指挥的作风；也可指党内“大佬”对政治的操控。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Domineering behavior; the habit of trying to control other people (bossiness).","zh":"专横作风；爱指挥、爱控制他人的习气（“很会当老板/很霸道”的样子）。"},"examples":[{"en":"Her bossism made group projects stressful because she refused to listen to others.","zh":"她的专横让小组作业变得很有压力，因为她拒绝听取别人的意见。"},{"en":"People grew tired of his bossism and stopped volunteering to help him.","zh":"大家厌倦了他的专横，后来都不再自愿帮他了。"}]},{"partOfSpeech":"n.","definition":{"en":"Control of politics or government by powerful party “bosses,” often through political machines and patronage.","zh":"（政治）党派“领袖/大佬”对政治或政府的操控，常与政治机器、任人唯亲（分赃）有关。"},"examples":[{"en":"Reformers criticized city hall for bossism and demanded cleaner elections.","zh":"改革派批评市政厅受“政治大佬”操控，要求更干净的选举。"},{"en":"The article describes bossism as a barrier to fair hiring in local government.","zh":"这篇文章把“大佬政治”的操控视为地方政府公平招聘的障碍。"}]}],"synonyms":["bossiness","domineering behavior","authoritarianism","political machine (sense 2)","party-boss rule"],"phonetic":"/ˈbɔsɪzəm/","extraExplanation":["“bossism”在现代日常口语中不算常用，更常见的说法是“bossiness / being bossy”。但在美国历史与政治语境里，它常用来批评19—20世纪一些城市中的“政治机器”（political machine）现象：少数党内大佬通过人事任命、资源分配、拉票网络等方式长期掌控地方权力。"]}
{"word":"bossisms","summary":{"en":"“Bossisms” are the typical phrases or catchphrases a boss often says, usually in a cliché or corporate style.","zh":"“Bossisms”指老板/主管常挂在嘴边的口头禅或职场套话，常带俗套或企业腔。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a saying, catchphrase, or habitual expression used by a boss or manager (often humorous, cliché, or corporate-sounding)","zh":"老板/主管常说的口头禅、固定用语或管理话术（常带幽默、俗套或职场腔）"},"examples":[{"en":"Our manager’s favorite bossism is “Let’s circle back after lunch.”","zh":"我们经理最爱说的老板口头禅是“午饭后我们再回头讨论一下。”"},{"en":"She collected bossisms from different departments and turned them into a joke list.","zh":"她收集了各部门的“老板语录”，做成了一份搞笑清单。"}]}],"synonyms":["manager-speak","corporate jargon","buzzwords","clichés","office speak"],"phonetic":"/ˈbɔsɪzəm/","extraExplanation":["“bossism”比较口语、带调侃色彩的用法，常见于社交媒体或办公室闲聊中，用来吐槽上司爱用的套话（如“think outside the box”“touch base”“low-hanging fruit”）。","构词上是 boss + -ism；“-ism”常表示一种“风格/习惯/主义”，所以“bossism”强调“像老板那样说话的风格或典型句式”。"]}
{"word":"bosslet","summary":{"en":"A bosslet is a small rounded raised projection, often decorative; rarely, it can mean a minor boss.","zh":"bosslet 指小型圆钉状凸起（多为装饰）；少见情况下也可指“小头目”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small boss (a rounded knob or raised projection), especially as a decorative feature in metalwork, architecture, or armor.","zh":"小凸饰；小圆钉状突起（尤指金属工艺、建筑或盔甲上的装饰性凸起）。"},"examples":[{"en":"The shield was decorated with rows of tiny bosslets around the rim.","zh":"盾牌边缘装饰着一圈圈小凸饰。"},{"en":"You can see a bosslet at each corner of the carved panel.","zh":"你可以在雕刻板的每个角上看到一个小凸起装饰。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, rare) A minor or junior “boss”; someone with limited authority.","zh":"（非正式，用得少）小头目；权限不大的主管。"},"examples":[{"en":"He acted like a bosslet, giving orders without real responsibility.","zh":"他像个小头目一样发号施令，却没什么真正的责任。"}]}],"synonyms":["small boss","knob","stud","protuberance","ornament"],"phonetic":"/ˈbɑslət/","extraExplanation":["“bosslet”由“boss（凸起/圆钉状装饰）+ -let（表示‘小的’的后缀）”构成，因此字面意思就是“较小的凸起/凸饰”。在艺术史或古物、盔甲、建筑描述中更可能见到。"]}
{"word":"Bosson","summary":{"en":"“Bosson” is most commonly a proper name, especially the stage name of a Swedish pop singer.","zh":"“Bosson”最常见的是专有名词，尤其指一位瑞典流行歌手的艺名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Swedish pop singer and songwriter; his stage name is “Bosson.”","zh":"瑞典流行歌手与词曲作者；艺名为“Bosson”。"},"examples":[{"en":"Bosson became known internationally with the song “One in a Million.”","zh":"Bosson 因歌曲《One in a Million》在国际上获得关注。"},{"en":"I used to listen to Bosson’s early-2000s pop songs.","zh":"我以前常听 Bosson 在 2000 年代初的流行歌曲。"}]},{"partOfSpeech":"n.","definition":{"en":"a surname or name used by some people or brands, depending on context (not a common English vocabulary word).","zh":"一个姓氏或名称，可能被个人或品牌使用；并非常见英语词汇，含义取决于语境。"},"examples":[{"en":"The email was signed “Bosson,” so I’m not sure if it’s a person or a company name.","zh":"邮件落款是“Bosson”，所以我不确定这是人名还是公司名。"}]}],"phonetic":"/ˈbɔsən/","extraExplanation":["“Bosson”在英语里通常被当作专有名词（人名/艺名）来用，而不是一个有固定词义的普通单词。提到歌手时，常见搭配是“Bosson’s songs / Bosson’s album / a song by Bosson”。"]}
{"word":"bossship","summary":{"en":"“Bossship” is an uncommon informal noun meaning the status or role of being a boss.","zh":"“bossship”是一个不常见的非正式名词，指“当老板”的身份或角色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, uncommon) The position, authority, or status of being a boss; leadership or management as a role.","zh":"（非正式、少见）“当老板”的职位、权力或身份；领导/管理这一角色。"},"examples":[{"en":"After years as an employee, she finally stepped into bossship and ran the team.","zh":"当了多年员工后，她终于进入“老板身份”，带领整个团队。"},{"en":"His idea of bossship is giving orders without listening.","zh":"他对“当老板”的理解就是只下命令、不听别人说。"}]}],"synonyms":["leadership","management","authority","being the boss","boss role"],"phonetic":"/ˈbɔsˌʃɪp/","extraExplanation":["“bossship”不是常见标准词，更像是把 boss（老板）+ -ship（表示“身份/职位/状态”的后缀，如 friendship 友谊、leadership 领导力）临时组合出来的创词，用来强调“老板的身份/地位”。在正式写作中更常用：leadership, management, being the boss, boss role/position。"]}
{"word":"Bossuet","summary":{"en":"Bossuet is the name of a famous 17th‑century French bishop and preacher known for brilliant rhetoric.","zh":"Bossuet 指17世纪著名法国主教与讲道者博絮埃，以卓越雄辩与修辞闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) Jacques-Bénigne Bossuet (1627–1704), a French Catholic bishop (Bishop of Meaux), famous preacher, and master of French classical prose and rhetoric.","zh":"（专有名词）雅克-贝尼涅·博絮埃（1627–1704），法国天主教主教（莫城主教），以雄辩的讲道、演说和法语古典散文与修辞风格著称。"},"examples":[{"en":"In French literature classes, Bossuet is often studied for his powerful funeral orations.","zh":"在法国文学课上，人们常通过博絮埃的悼亡演说来学习他有力的文风。"},{"en":"The speaker’s style was compared to Bossuet—formal, moral, and highly rhetorical.","zh":"这位演讲者的风格被拿来和博絮埃相比——庄重、强调道德、修辞性很强。"}]}],"synonyms":["Jacques-Bénigne Bossuet","Bishop of Meaux"],"phonetic":"/bɑːˈsweɪ/","extraExplanation":["“Bossuet”在英语里通常作为历史人物的姓来使用，最常见的语境是法国历史、宗教史与文学史。","他最著名的作品类型之一是“funeral orations（悼亡演说）”，常被视为法语雄辩术与古典散文的典范。","如果你在阅读中看到“a Bossuet-like style”，一般是在比喻一种庄严、宏大、带道德劝诫意味、句式讲究的演说/散文风格。"]}
{"word":"bossy","summary":{"en":"Bossy describes someone who is too controlling and likes to tell others what to do.","zh":"bossy 用来形容一个人太爱控制、喜欢指挥别人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Always telling people what to do in a way that feels too controlling or too confident; pushy and commanding.","zh":"总爱指挥别人、控制欲强的；爱发号施令的。"},"examples":[{"en":"Stop being so bossy—let everyone choose their own seat.","zh":"别这么爱指挥了——让大家自己选座位吧。"},{"en":"My little brother can be bossy when we play games.","zh":"我们玩游戏时，我弟弟有时候很爱发号施令。"},{"en":"She sounded bossy on the call, even though she didn’t mean to.","zh":"电话里她听起来有点强势爱指挥，虽然她并不是故意的。"}]}],"synonyms":["pushy","controlling","overbearing","domineering"],"phonetic":"/ˈbɔsi/","extraExplanation":["“bossy”通常带有负面评价，表示说话方式让人不舒服；如果想表达更中性的“有领导力/果断”，可用“confident, decisive, assertive”。","在亲密关系或家庭里，直接说“You’re bossy”可能显得指责；更委婉的说法有：“Could you be a bit less controlling?” 或 “Can we decide together?”"]}
{"word":"bost","summary":{"en":"“Bost” is a rare/Scots form meaning “boast” (to brag) and sometimes a noun meaning “a boast.”","zh":"“bost”是少见/苏格兰英语形式，意思多为“boast（吹嘘、自夸）”，也可作名词表示“自夸的话”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Scots/archaic) to boast; to speak with too much pride about yourself or what you have done.","zh":"（苏格兰英语/古用）吹嘘；自夸；夸耀自己或自己的成就。"},"examples":[{"en":"He bost of his wins, but everyone knew he had help.","zh":"他吹嘘自己的胜利，但大家都知道他得到了帮助。"},{"en":"In old stories, warriors often bost about their strength before a fight.","zh":"在古老的故事里，战士常在战斗前夸耀自己的力量。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) a boast; proud talk.","zh":"（罕见）自夸之词；吹嘘的话。"},"examples":[{"en":"His bost sounded impressive, but it wasn’t true.","zh":"他的自夸听起来很厉害，但并不真实。"}]}],"synonyms":["boast","brag","show off"],"phonetic":"/boʊst/","extraExplanation":["“bost”在现代标准英语里非常少见，更多见于苏格兰英语或旧文本中，通常相当于标准英语的“boast”。","如果你想表达“提高、增强（速度、音量、信心等）”，你可能想查的是“boost”；如果你想表达“吹嘘”，标准拼写是“boast”。"]}
{"word":"bostal","summary":{"en":"A (British) youth detention center for young offenders; usually spelled “borstal.”","zh":"（英式）少年犯感化院/青年拘留所；通常拼作“borstal”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually spelled “borstal” in British English) a type of youth detention center for young offenders; by extension, a juvenile prison.","zh":"（通常拼作英式英语“borstal”）青年罪犯的感化院/少年拘留所；引申为少年监狱。"},"examples":[{"en":"He was sent to a borstal for car theft when he was sixteen.","zh":"他十六岁时因偷车被送进感化院。"},{"en":"The film shows how life in a borstal could be harsh and violent.","zh":"这部电影展现了感化院里的生活可能很艰难、充满暴力。"}]}],"synonyms":["juvenile detention center","youth detention center","reformatory","young offenders institution"],"phonetic":"/ˈbɔːr.stəl/","extraExplanation":["“Bostal”更常见的是拼写错误；标准拼写是“borstal”。该词源自英格兰肯特郡的Borstal村，英国曾在20世纪用“Borstal system”指对青少年犯罪者的矫治体系。后来英国法律与制度变化，“borstal”逐渐成为历史/文学/影视中出现的用语。","在文学与文化中，“borstal”常用来营造较为阴暗、压迫的社会现实氛围，强调青少年在制度与环境中的挣扎。相关表达：juvenile detention（少年拘留）、young offenders institution（青年罪犯机构，英）。"]}
{"word":"bostangi","summary":{"en":"“Bostangi” is not standard English; it’s likely a proper name or a transliterated foreign word.","zh":"“Bostangi”不是标准英语词；更可能是专有名词或外来语音译。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often seen as a proper name (e.g., a surname, place name, brand/restaurant name) or a transliteration from another language.","zh":"不是标准英语词；最常见作专有名词（如姓氏、地名、品牌/餐馆名），或是其他语言的音译。"},"examples":[{"en":"I couldn’t find “Bostangi” in an English dictionary; it may be a name or a transliteration.","zh":"我在英语词典里找不到“Bostangi”；它可能是名字或音译词。"},{"en":"Do you mean Bostangi as a person’s name, a place, or a business?","zh":"你说的 Bostangi 是人名、地名，还是商家名称？"}]}],"phonetic":"/boʊˈstɑːŋɡi/","extraExplanation":["“bostangi”很可能来自中亚/伊朗相关语言的音译：例如波斯语里 **bostān** 有“花园/果园”的意思，因此一些以“花园、果园、园艺”为主题的店名或地名可能会出现类似拼写。但不同语言（乌兹别克语、塔吉克语等）与不同转写系统会造成拼写差异。","如果你能提供一句原文（它出现的句子/网站/国家/语言），我可以更准确判断它是：人名、地名、品牌，还是你想查的英语单词（可能拼错）。"]}
{"word":"bostanji","summary":{"en":"Bostanji: an Ottoman palace corps member who served as a guard/policeman and caretaker of the sultan’s gardens.","zh":"Bostanji：奥斯曼宫廷卫队成员，兼任警卫/治安与宫苑花园管理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Bostancı (often spelled “Bostanji” in English), an Ottoman palace corps that served as imperial guards, policemen, and caretakers of the sultan’s gardens—especially around Istanbul and the Bosporus.","zh":"（英语中常写作 Bostanji，也作 Bostancı）奥斯曼帝国宫廷的一支“博斯坦哲/博斯坦吉”卫队成员，既负责苏丹宫廷的警卫与治安，也管理宫苑与花园，主要活动于伊斯坦布尔及博斯普鲁斯一带。"},"examples":[{"en":"In the Ottoman period, the Bostanji helped keep order near the palace and along the waterfront.","zh":"在奥斯曼时期，Bostanji 负责在宫殿附近和沿海岸线维持秩序。"},{"en":"The novel mentions a Bostanji boat on the Bosporus, reminding readers of Istanbul’s imperial past.","zh":"小说里提到一艘在博斯普鲁斯海峡上的 Bostanji 船，让人想起伊斯坦布尔的帝国往事。"}]}],"synonyms":["Bostancı","Ottoman palace guard","imperial guard (Ottoman context)"],"phonetic":"/boʊˈstɑːndʒi/","extraExplanation":["“Bostanji”来自土耳其语“bostancı”，词根与“bostan（菜园/果园）”有关，所以这支部队最初带有“园丁/园林守护者”的意味，后来职责扩展到宫廷警卫与执法。","英语里常见多种拼写：Bostancı（更接近现代土耳其语拼写，含“ı”这个字母）、Bostanji（较常见的英文转写）。阅读历史资料时把它们视为同一概念通常更方便。"]}
{"word":"bosthoon","summary":{"en":"“bosthoon” is not a standard English word; it most likely means “Boston.”","zh":"“bosthoon”不是标准英语词；最可能指“Boston（波士顿）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Likely a misspelling of “Boston,” the capital city of Massachusetts in the northeastern United States.","zh":"很可能是“Boston（波士顿）”的拼写错误；Boston 是美国东北部马萨诸塞州的首府城市。"},"examples":[{"en":"Boston is known for its universities and hospitals.","zh":"波士顿以大学和医院闻名。"},{"en":"I’m flying to Boston for a conference.","zh":"我要飞去波士顿参加会议。"},{"en":"The Boston Marathon is one of the world’s most famous races.","zh":"波士顿马拉松是世界上最著名的比赛之一。"}]}],"synonyms":["Boston","Beantown (nickname)","The Hub (nickname)"],"phonetic":"ˈbɔstən","extraExplanation":["“bosthoon”不是常见或标准英语单词，最常见的对应应为专有名词“Boston”。标准拼写是 Boston（不是 *bosthoon*）。","Boston 常被昵称为 “Beantown”（豆城）或 “The Hub”（中心城，偏老派说法）。它在美国历史中很重要，如“波士顿倾茶事件（Boston Tea Party）”。"]}
{"word":"Bostic","summary":{"en":"“Bostic” is mainly used as a surname, and it can also be a U.S. place name (especially a town in North Carolina).","zh":"“Bostic”主要用作姓氏，也可作美国地名（尤指北卡罗来纳州的一个小镇）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"姓氏（家族姓）。"},"examples":[{"en":"Raphael Bostic is an American economist and a Federal Reserve Bank president.","zh":"拉斐尔·博斯蒂克（Raphael Bostic）是美国经济学家，也是美国联邦储备银行行长之一。"},{"en":"My teacher’s last name is Bostic.","zh":"我老师的姓是 Bostic。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name, most commonly referring to Bostic, a small town in North Carolina, USA.","zh":"地名，最常见指美国北卡罗来纳州的小镇 Bostic。"},"examples":[{"en":"She grew up in Bostic, North Carolina.","zh":"她在北卡罗来纳州的 Bostic 小镇长大。"},{"en":"We drove through Bostic on the way to the mountains.","zh":"我们去山里的路上开车经过了 Bostic。"}]}],"phonetic":"/ˈbɑstɪk/","extraExplanation":["“Bostic”通常不是普通词汇，而是专有名词（人名/地名），因此在一般英语词典里可能不会像常用词那样有很多义项。","读音在日常英语中多按“BOSS-tick”的节奏来读。拼写和发音固定，常用于姓氏或地名场景。"]}
{"word":"Boston","summary":{"en":"Boston is the capital city of Massachusetts in the northeastern U.S., widely known for education, healthcare, and early American history.","zh":"波士顿是美国东北部马萨诸塞州的首府，以教育、医疗以及美国早期历史而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The capital and largest city of the U.S. state of Massachusetts, in the northeastern United States.","zh":"美国马萨诸塞州的首府和最大城市，位于美国东北部。"},"examples":[{"en":"Boston is known for its universities and hospitals.","zh":"波士顿以大学和医院闻名。"},{"en":"I’m flying to Boston for a conference next week.","zh":"我下周要飞去波士顿参加一个会议。"}]},{"partOfSpeech":"n.","definition":{"en":"A place strongly associated with early U.S. history, especially events leading up to the American Revolution.","zh":"与美国早期历史密切相关的地方，尤其常指与美国独立战争（革命）前夕事件有关的背景。"},"examples":[{"en":"Boston played a major role in the start of the American Revolution.","zh":"波士顿在美国独立战争的开端中扮演了重要角色。"},{"en":"They visited Boston to learn more about colonial American history.","zh":"他们去波士顿参观，以更多了解美国殖民时期的历史。"}]}],"synonyms":["Boston, Massachusetts","the city of Boston","Beantown (nickname)","The Hub (nickname)"],"phonetic":"/ˈbɔstən/","extraExplanation":["“Boston”常见昵称：The Hub（“枢纽”，强调城市在新英格兰地区的中心地位）、Beantown（“豆城”，源自传统食物 baked beans 的文化联想；在当地有时被认为略带旅游宣传味）。","历史文化背景：波士顿茶党事件（Boston Tea Party, 1773）常被用作美国历史课本中的标志性事件；“Freedom Trail（自由之路）”是一条串联多处历史遗址的步行路线。","在体育文化中，“Boston”也常让人联想到职业球队与球迷文化（如 Red Sox、Celtics、Bruins），因此在新闻里可能代表“波士顿队/波士顿球迷”这种泛指。"]}
{"word":"boston","summary":{"en":"Boston is the capital of Massachusetts, a major historic and educational city in the northeastern United States.","zh":"Boston 是马萨诸塞州首府，是美国东北部重要的历史与教育名城。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the capital city of Massachusetts in the northeastern U.S., known for its universities, colonial and Revolutionary War history, and strong local culture","zh":"美国东北部马萨诸塞州的首府城市，以大学资源、殖民地与美国独立战争历史，以及鲜明的地方文化而闻名"},"examples":[{"en":"Boston is famous for universities like Harvard and MIT (nearby in Cambridge).","zh":"波士顿以哈佛、麻省理工等大学闻名（它们在附近的剑桥市）。"},{"en":"We walked the Freedom Trail to learn about Boston’s Revolutionary history.","zh":"我们沿着“自由之路”步行，了解波士顿的独立战争历史。"},{"en":"She moved to Boston for a new job in healthcare.","zh":"她搬到波士顿从事医疗行业的新工作。"}]}],"synonyms":["Massachusetts capital","Beantown (nickname)","The Hub (nickname)"],"phonetic":"ˈbɔstən","extraExplanation":["“Boston”常被简称为“Beantown”（豆城，带点昵称/调侃色彩）或“The Hub”（意为“中心”，源自19世纪对波士顿文化地位的称呼）。","在美国文化中，Boston常与“新英格兰（New England）”形象相连：红砖建筑、历史街区、秋季风景、海鲜（如龙虾与蛤蜊浓汤clam chowder）等。","发音上，一些波士顿本地口音里可能会出现“r”音弱化的现象（如把“car”说得更像“cah”），但学习标准美式发音即可。","文学与历史语境中，Boston常出现在与美国建国史相关的叙述里（如茶党事件 Boston Tea Party、自由之路 Freedom Trail 等）。"]}
{"word":"Boston Celtics","summary":{"en":"An NBA basketball team from Boston.","zh":"来自波士顿的NBA篮球队。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A professional basketball team based in Boston, Massachusetts, that plays in the NBA’s Eastern Conference.","zh":"一支位于美国马萨诸塞州波士顿的职业篮球队，参加NBA东部联盟比赛。"},"examples":[{"en":"The Boston Celtics play their home games at TD Garden.","zh":"波士顿凯尔特人队在TD花园球馆进行主场比赛。"},{"en":"He’s been a Boston Celtics fan since he was a kid.","zh":"他从小就是波士顿凯尔特人队的球迷。"}]}],"synonyms":["Celtics","the C's"],"phonetic":"/ˈbɔstən ˈsɛltɪks/","extraExplanation":["常见简称：Celtics、the C’s（口语/媒体中常见）。中文里常译为“波士顿凯尔特人（队）”。","“Celtic”在英语里既可指凯尔特民族/文化，也常与爱尔兰、苏格兰等地区的文化符号相关；球队的标志与配色（如绿色）也与这种文化联想有关。"],"etymology":"“Boston”指美国城市波士顿；“Celtics”原指“凯尔特人”，与波士顿及周边地区较强的爱尔兰裔文化关联。球队创建于1946年，采用这一名称以呼应该城市的历史与族裔文化背景。","mnemonic":["把“Celtics”联想到“凯尔特文化=爱尔兰联想=绿色”，而凯尔特人队的主色就是绿色。"]}
{"word":"Bostonese","summary":{"en":"Bostonese is the Boston-area accent/dialect of English, and sometimes the Boston-associated way of speaking in general.","zh":"Bostonese指波士顿地区的英语口音/方言，也可泛指带有波士顿特色的说话方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the local accent and dialect of English spoken in Boston and parts of eastern Massachusetts, known for features like dropping or changing the “r” sound in some positions","zh":"波士顿口音／波士顿方言：波士顿及马萨诸塞州东部常见的英语口音与方言，常见特征包括在某些位置弱化或省略“r”音等"},"examples":[{"en":"He has a strong Bostonese accent, so “car” can sound like “cah.”","zh":"他有很重的波士顿口音，所以“car”听起来可能像“cah”。"},{"en":"The movie used Bostonese to make the characters feel more local and authentic.","zh":"这部电影用波士顿口音让角色更有本地感、更真实。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) words, expressions, and speech style associated with Boston, especially in jokes, media, or local identity","zh":"（非正式）与波士顿相关的用词、表达方式和说话风格，常见于玩笑、影视作品或本地身份认同中"},"examples":[{"en":"The comedian sprinkled a little Bostonese into his story.","zh":"那位喜剧演员在故事里掺了一点波士顿式的说法。"},{"en":"You’ll hear some Bostonese in sports talk radio around Fenway.","zh":"在芬威球场附近的体育电台里，你会听到一些波士顿式的说法。"}]}],"synonyms":["Boston accent","Boston dialect","New England accent"],"phonetic":"/ˌbɔːstənˈiːz/","extraExplanation":["“Bostonese”常用来指口音特征，其中最典型的是“非卷舌 r”（在词尾或辅音前的 r 可能不读），比如 car→cah，park→pahk。也常见把 /ɑ/ 读得更靠前，使某些词听起来很“波士顿”。","它是一个文化标签：在美国影视与脱口秀里，Bostonese常用来快速暗示人物来自波士顿/新英格兰地区，以及一种“本地、硬朗、直来直去”的形象（属于刻板印象，现实中差异很大）。","相关表达：Boston accent（波士顿口音，更中性常用）、New England accent（新英格兰口音，更宽泛）。在流行文化中你可能听到调侃式句子“Pahk the cah in Hahvahd Yahd”（把车停在哈佛院子里），常用于展示口音，并非真正的常用日常句。"]}
{"word":"bostonese","summary":{"en":"Bostonese is the Boston-area English accent/dialect, often noted for dropping or weakening the “r” sound.","zh":"Bostonese 指波士顿地区的英语口音/方言，常被认为有弱化或省略“r”音的特点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the English accent and dialect associated with Boston and the surrounding area in Massachusetts, U.S.A.","zh":"（美国）波士顿及马萨诸塞州周边地区的英语口音和方言；常称“波士顿腔”"},"examples":[{"en":"Some people find Bostonese hard to understand at first, especially the pronunciation of “r.”","zh":"有些人一开始觉得波士顿腔很难懂，尤其是对“r”的发音。"},{"en":"In movies, Bostonese is often used to signal that a character is from Boston or nearby.","zh":"在电影里，波士顿腔常用来暗示角色来自波士顿或附近地区。"}]}],"synonyms":["Boston accent","Boston dialect","New England accent"],"phonetic":"/ˌbɔstənˈiːz/","extraExplanation":["“Bostonese”是较口语、带点幽默色彩的说法，用来指波士顿地区的口音/方言特征。最常被提到的特点之一是“非卷舌”（non-rhotic）：词尾或辅音前的 r 往往不明显，例如 car 听起来更像“cah”。","常见刻板印象里，它常与“新英格兰”（New England）的本地身份、工薪阶层或“波士顿本地人”形象联系在一起；但现实中口音差异很大，会因年龄、阶层、社区而不同。","相关说法：Boston accent（更中性、更常用），New England accent（范围更大）。"]}
{"word":"Bostonian","summary":{"en":"Bostonian = someone from Boston, or something related to Boston.","zh":"Bostonian 指“波士顿人”，也可作形容词表示“波士顿的/与波士顿有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Boston, Massachusetts (USA)","zh":"波士顿人；来自美国马萨诸塞州波士顿的人"},"examples":[{"en":"She’s a Bostonian who moved to California for work.","zh":"她是个波士顿人，为了工作搬去了加州。"},{"en":"Many Bostonians follow the Red Sox closely.","zh":"很多波士顿人都很关注红袜队（Red Sox）。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Boston or its people","zh":"波士顿的；与波士顿（或波士顿人）有关的"},"examples":[{"en":"He has a strong Bostonian accent.","zh":"他有很明显的波士顿口音。"},{"en":"We tried some Bostonian seafood dishes.","zh":"我们尝了几道波士顿风味的海鲜菜。"}]}],"synonyms":["Boston resident","Boston native","from Boston"],"phonetic":"/bɑˈstoʊniən/","extraExplanation":["“Bostonian”也常让人联想到“Boston accent”（波士顿口音），在美国文化里很有辨识度：比如把“car”读得更像“cah”。不过不同阶层、不同社区的口音差异也很大，不是所有波士顿人都这样说话。","在文学与文化中，“Bostonian”有时带有“新英格兰（New England）传统、教育氛围浓、历史感强”的联想；Henry James 的小说《The Bostonians》（《波士顿人》）就以波士顿的社会与文化环境为背景。"]}
{"word":"bostonian","summary":{"en":"Bostonian means a person from Boston, or something connected to Boston.","zh":"Bostonian 指“波士顿人”，也可指“与波士顿相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Boston, Massachusetts (or the Boston area) in the U.S.","zh":"波士顿人；来自美国马萨诸塞州波士顿（或大波士顿地区）的人"},"examples":[{"en":"She’s a Bostonian who still loves walking along the Charles River.","zh":"她是个波士顿人，依然很喜欢沿着查尔斯河散步。"},{"en":"Many Bostonians take pride in the city’s history and universities.","zh":"许多波士顿人为这座城市的历史和大学感到自豪。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Boston or its people, culture, or accent","zh":"波士顿的；与波士顿人、文化或口音有关的"},"examples":[{"en":"He speaks with a strong Bostonian accent.","zh":"他说话带着很重的波士顿口音。"},{"en":"We tried a classic Bostonian seafood meal.","zh":"我们尝了一顿经典的波士顿风味海鲜餐。"}]}],"synonyms":["Boston resident","person from Boston"],"phonetic":"/bɑˈstoʊniən/","extraExplanation":["“Bostonian”常让人联想到美国新英格兰地区（New England）的文化与历史。波士顿以美国独立战争相关地标、哈佛大学与麻省理工学院（MIT）等学府闻名。","语言上，“Bostonian accent”在流行印象里常被描述为某些场景下不明显发 /r/ 音（例如把“car”说得更像“cah”）。实际口音因人、阶层与地区而差异很大。","文学中较有名的是亨利·詹姆斯（Henry James）的小说《The Bostonians》（《波士顿人》），讲述19世纪后期与社会思潮相关的人物与冲突。"]}
{"word":"Bostonians","summary":{"en":"“Bostonians” usually means people from Boston; it can also describe things associated with Boston.","zh":"“Bostonians”通常指波士顿人；也可形容与波士顿相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who live in or come from Boston, Massachusetts (USA).","zh":"波士顿人；来自或居住在美国马萨诸塞州波士顿的人。"},"examples":[{"en":"Many Bostonians take the subway (the “T”) to work.","zh":"很多波士顿人会坐地铁（“T”）去上班。"},{"en":"Bostonians are proud of their city’s history.","zh":"波士顿人对这座城市的历史很自豪。"}]},{"partOfSpeech":"adj.","definition":{"en":"Things (especially customs, speech, or attitudes) associated with Boston.","zh":"与波士顿有关的事物（尤指风俗、口音/用语或态度）。"},"examples":[{"en":"The book is full of Bostonians details—old neighborhoods, local food, and the city’s humor.","zh":"这本书充满了“波士顿风”的细节——老街区、本地食物和这座城市的幽默感。"}]}],"synonyms":["Boston residents","people from Boston","Bostonian (singular)"],"phonetic":"/bɑˈstoʊniənz/","extraExplanation":["“Bostonians”最常见是名词复数，指“波士顿人”。在英语里，城市/地区的人常用这种词形：Boston → Bostonian（单数）→ Bostonians（复数）。","文化提示：在美国语境中，Boston常与美国独立史、著名大学（如哈佛、MIT在附近的剑桥）、以及当地口音联系在一起。用词时通常不带褒贬，但语境可能表达“典型波士顿风格”。"]}
{"word":"bostonians","summary":{"en":"“Bostonians” most commonly means people from Boston; informally it can also refer to the Boston accent/dialect.","zh":"“Bostonians”最常指波士顿人；非正式用法下也可指波士顿口音/方言。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who live in or come from Boston, Massachusetts (USA)","zh":"波士顿人；来自或居住在美国马萨诸塞州波士顿的人"},"examples":[{"en":"Many Bostonians commute by subway, called the “T.”","zh":"许多波士顿人通勤会坐地铁，当地叫“the T”。"},{"en":"Bostonians are proud of their city’s history and universities.","zh":"波士顿人很为这座城市的历史和大学感到自豪。"}]},{"partOfSpeech":"n.","definition":{"en":"the dialect or accent associated with Boston and the surrounding area (informal)","zh":"（非正式）波士顿口音；波士顿地区的方言/口音"},"examples":[{"en":"Some actors practice Bostonians to sound more authentic in the movie.","zh":"有些演员会练习波士顿口音，让电影里的声音更地道。"},{"en":"He can switch between standard American English and Bostonians depending on who he’s talking to.","zh":"他会根据谈话对象在标准美式英语和波士顿口音之间切换。"}]}],"synonyms":["Boston residents","Boston people","Boston accent (informal)"],"phonetic":"/bɑˈstoʊniənz/","extraExplanation":["“Bostonian”原指波士顿人，复数是“Bostonians”。有时也可指与波士顿相关的事物或风格（如 Bostonian culture）。","波士顿口音的常见印象是某些词里“r”音较弱（如把 car 说得更像 “cah”），但实际口音差异也会因社区与代际而不同。","文学与文化里，“The Bostonian(s)”也可能让人联想到亨利·詹姆斯的小说《The Bostonians》（1886），背景与波士顿社会文化相关。"]}
{"word":"bostonite","summary":{"en":"“Bostonite” means a person from Boston, or something related to Boston.","zh":"“Bostonite”指波士顿人，或指与波士顿有关的事物/特点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Boston, Massachusetts (or strongly connected to Boston)","zh":"波士顿人；来自（或与）美国马萨诸塞州波士顿密切相关的人"},"examples":[{"en":"She’s a proud Bostonite who never misses a Red Sox game.","zh":"她是个自豪的波士顿人，从不错过红袜队的比赛。"},{"en":"Many Bostonites commute by subway, which locals call “the T.”","zh":"很多波士顿人坐地铁通勤，当地人把地铁叫作“T”。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Boston; typical of Boston","zh":"波士顿的；具有波士顿特色的"},"examples":[{"en":"We tried a Bostonite seafood spot near the harbor.","zh":"我们在海港附近尝了一家很有波士顿特色的海鲜店。"},{"en":"His Bostonite accent is easy to notice.","zh":"他的波士顿口音很容易听出来。"}]}],"synonyms":["Bostonian"],"phonetic":"/ˈbɔstənˌaɪt/","extraExplanation":["“Bostonite”常见于媒体、旅游介绍、体育语境（如Red Sox红袜队、Celtics凯尔特人队）等，用来表达对波士顿身份的认同。","波士顿因历史与教育资源闻名（如美国独立战争相关遗址、哈佛与MIT在大波士顿地区），所以“Bostonite”有时也会带有“历史城市/学术城市居民”的联想。"]}
{"word":"bostons","summary":{"en":"“Bostons” usually means more than one place or thing called Boston.","zh":"“Bostons”通常指多个名为 Boston（波士顿）的地方或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural form of “Boston,” used when talking about more than one place or thing named Boston (for example, different towns called Boston).","zh":"“Boston”的复数形式，用来指不止一个名为 Boston 的地方或事物（例如不同地区都叫 Boston 的城镇）。"},"examples":[{"en":"There are several Bostons in the United States, not just the one in Massachusetts.","zh":"美国有好几个叫 Boston 的地方，不只是马萨诸塞州的那个。"},{"en":"The guidebook compares the histories of two Bostons.","zh":"这本旅游指南对比了两个“波士顿”的历史。"}]}],"synonyms":["multiple places named Boston","Bostonians (people from Boston)"],"phonetic":"/ˈbɔstən/","extraExplanation":["“Bostons”并不常见；大多数时候人们说“Boston”（单数）指马萨诸塞州的波士顿。","如果你想表达“波士顿的……”，通常写作“Boston’s”（带撇号 s）；如果你想说“波士顿人”，更常用“Bostonians”。","大小写很重要：作为专有名词一般要大写 Boston；只有在特定语境下才会看到复数 Bostons（例如地名列表、比较不同同名城镇时）。"]}
{"word":"Bostow","summary":{"en":"Bestow means to give something, especially an honor or gift, in a formal way.","zh":"bestow 指（尤指正式地）授予、赠予某物，如荣誉或礼物。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to give something (such as an honor, gift, or right) to someone, usually in a formal or official way","zh":"（通常正式地）授予、赠予（荣誉、礼物、权利等）"},"examples":[{"en":"The university will bestow an honorary degree on her.","zh":"这所大学将授予她一个荣誉学位。"},{"en":"The award is bestowed each year on a young scientist.","zh":"这个奖项每年授予一位年轻科学家。"},{"en":"They bestowed praise on the volunteers for their hard work.","zh":"他们对志愿者的辛勤工作给予了称赞。"}]}],"synonyms":["grant","confer","award","give","present"],"phonetic":"/bɪˈstoʊ/","extraExplanation":["你输入的 “Bostow” 很可能是拼写错误，常见正确拼写是 **bestow**（授予、赠予）。","**bestow** 语气偏正式，常用于搭配：bestow + an honor/award/title/degree + on/upon + someone（授予某人荣誉/奖项/头衔/学位）。"]}
{"word":"bostrychid","summary":{"en":"A bostrychid is a wood-boring beetle in the family Bostrichidae.","zh":"bostrychid 指粉蠹甲科（Bostrichidae）的蛀木甲虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a beetle belonging to the family Bostrichidae (often wood-boring; some species can damage lumber, furniture, or stored wood).","zh":"天牛甲科/粉蠹甲科（Bostrichidae）的一种甲虫；常蛀食木材，有些种类会危害木料、家具或木制品。"},"examples":[{"en":"The inspector found bostrychid exit holes in the wooden beam.","zh":"检查员在木梁上发现了粉蠹甲科甲虫（bostrychid）羽化孔。"},{"en":"To prevent bostrychid damage, the wood was kiln-dried and properly sealed.","zh":"为防止粉蠹甲科甲虫危害，木材进行了窑干处理并妥善封闭。"}]}],"synonyms":["bostrichid beetle","Bostrichidae beetle"],"phonetic":"/bɑˈstrɪkɪd/","extraExplanation":["“Bostrychid”是分类学用语，指“粉蠹甲科（Bostrichidae）”的成员。它们的幼虫常在木材内部取食，外表可能只看到细小圆孔和粉末状木屑，因此在木材检疫、害虫防治、博物馆藏品保护等语境中常见。","注意与更泛用的“powderpost beetle（粉蠹/粉蠹甲）”区分：日常英语里这个词有时也指其他会蛀木的甲虫家族（如Lyctidae），而“bostrychid”更精确地限定在Bostrichidae。"]}
{"word":"Bostrychidae","summary":{"en":"Bostrychidae: a beetle family whose larvae bore into dry wood and plant materials, sometimes causing damage.","zh":"Bostrychidae：一类幼虫会蛀食干木材与植物材料、可能造成危害的甲虫科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of wood-boring beetles (the false powder-post beetles) whose larvae tunnel in dry wood, bamboo, or stored plant materials, sometimes damaging furniture, timber, and crops.","zh":"一种蛀木甲虫科（常称“伪粉蠹”或“粉蠹类甲虫”），其幼虫会在干木材、竹子或储存的植物材料中钻蛀取食，可能危害家具、木材与农作物。"},"examples":[{"en":"The museum checked its wooden displays for Bostrychidae because the larvae can bore into dry timber.","zh":"博物馆检查了木质展柜是否有Bostrychidae（粉蠹类甲虫），因为它们的幼虫会钻蛀干木材。"},{"en":"Some Bostrychidae species are serious pests in bamboo products and stored grains.","zh":"一些Bostrychidae物种会严重危害竹制品和储藏谷物。"}]}],"synonyms":["false powderpost beetles","powder-post beetles (broad/common name)"],"phonetic":"/bɑˈstrɪkɪˌdi/","extraExplanation":["Bostrychidae 是昆虫分类学中的“科”名，来源于其代表属名 Bostrichus；在英文资料里常见俗名是 false powderpost beetles（“伪粉蠹”）。","日常英语中更常听到的是 powderpost beetles（粉蠹/粉蠹甲虫），但这个俗称有时也会泛指其他近似的蛀木甲虫科（不一定都属于 Bostrychidae）。"]}
{"word":"bostrychidae","summary":{"en":"Bostrychidae are horned powder-post beetles—a beetle family whose members often bore into wood and may cause damage.","zh":"Bostrychidae 指角粉蠹科（角粉蠹甲虫），常蛀食木材，可能造成木材与木制品损害。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of beetles commonly called horned powder-post beetles; many species bore into wood and can damage timber, bamboo, and stored wooden products.","zh":"一种甲虫科，常称“角粉蠹科/角粉蠹（甲虫）”；许多种会钻蛀木材，可危害木料、竹材及木制品。"},"examples":[{"en":"Some Bostrychidae species can infest dried timber and leave fine powdery frass.","zh":"一些角粉蠹科的物种会侵染干燥木材，并留下细粉状的虫粪。"},{"en":"The museum checked wooden frames for signs of Bostrychidae damage.","zh":"博物馆检查木质画框是否有角粉蠹科甲虫危害的迹象。"}]}],"synonyms":["horned powder-post beetles","powder-post beetles (general term)"],"phonetic":"/bɑˈstrɪkəˌdi/","extraExplanation":["“Bostrychidae”是昆虫分类学里的科名（family name），在日常英语里更常见的说法是“powder-post beetles（粉蠹）”或更具体的“horned powder-post beetles（角粉蠹）”。","词源来自拉丁化的希腊语：bostrukh-（意为“卷曲/扭曲”，常用来描述形态特征）+ -idae（动物学科名后缀，表示“……科”）。","学习提示：在学术写作中，这类科名通常首字母大写且用斜体与否取决于期刊格式；读到时可把它理解为“某一类甲虫的总称”，而不是单个物种名。"]}
{"word":"bostrychoid","summary":{"en":"Bostrychoid means spiral-shaped or curled like a lock of hair.","zh":"bostrychoid 指“螺旋状的；像发缕一样卷曲的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Spiral-shaped or curled like a lock of hair; coiled in a way that resembles a corkscrew.","zh":"螺旋状的；像卷发或发缕一样卷曲的；呈盘旋卷绕形的。"},"examples":[{"en":"Under the microscope, the fibers formed a bostrychoid pattern.","zh":"在显微镜下，这些纤维呈现出螺旋卷曲（bostrychoid）的形态。"},{"en":"The vine’s tendrils grew in a bostrychoid twist as they climbed the fence.","zh":"藤蔓的卷须沿着篱笆攀爬时呈螺旋式（bostrychoid）扭曲生长。"}]}],"synonyms":["spiral","coiled","curly","helical","corkscrew-like"],"phonetic":"/bɑˈstrɪkɔɪd/","extraExplanation":["词源来自希腊语 *bostrychos*，意为“发卷、发缕”。因此这个词多用于较正式或学术的描述（如生物学、医学、材料学），强调“像卷发一样的螺旋卷曲形态”。"]}
{"word":"bostrychoidal","summary":{"en":"An adjective (mainly in geology/mineralogy) meaning “worm-like or tightly curled ridged in texture.”","zh":"一个主要用于地质/矿物学的形容词，意为“呈蠕虫状或紧密卷曲的脊状纹理”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a surface pattern made of tight, curved, worm-like ridges or clusters (often used to describe mineral or rock textures).","zh":"（尤指矿物或岩石表面）呈“蠕虫状/卷曲虫迹状”纹理的；由紧密弯曲、像虫子一样的脊状纹或团簇组成的。"},"examples":[{"en":"The mineral shows a bostrychoidal texture under reflected light.","zh":"在反射光下，这种矿物呈现出 bostrychoidal（蠕虫状）纹理。"},{"en":"Geologists described the coating as bostrychoidal, with curled, ridged growth lines.","zh":"地质学家将这层覆盖物描述为 bostrychoidal：生长纹卷曲并呈脊状。"}]}],"synonyms":["vermicular","worm-like","curled","ridged (textured)"],"phonetic":"/ˌbɑː.strɪˈkɔɪ.dəl/","extraExplanation":["词源提示：bostrychoidal 来自希腊语 bostrychos（意为“卷发的一缕、卷曲”）。在地质/矿物学里，它常与 botryoidal（葡萄状）等形态学术语并列，用来更精细地区分表面结核或沉积生长的外观。"]}
{"word":"bostryx","summary":{"en":"Bostryx means a curl or ringlet of hair, used mainly in literary/poetic contexts.","zh":"bostryx 指“一绺卷发/发卷”，主要用于文学或诗歌式描写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A curl or ringlet of hair; a single lock, often used in poetic or literary writing.","zh":"一绺卷发；一圈发卷（常用于诗歌或文学语境，带有文雅色彩）。"},"examples":[{"en":"A loose bostryx fell across her forehead.","zh":"一绺卷发松松地垂在她的额前。"},{"en":"The portrait shows him with dark bostryxes framing his face.","zh":"画像里他留着深色的卷发束，衬托着脸庞。"}]}],"synonyms":["curl","ringlet","lock (of hair)"],"phonetic":"/ˈbɑːstrɪks/","extraExplanation":["bostryx 是一个非常少见、偏文学的词，来自希腊语 bostrukh-（意为“卷发、发卷”）。现代英语里更常用 curl、ringlet、lock of hair；bostryx 多见于古典风格描写（例如描写雕像、肖像或诗歌中的人物形象）。","复数形式常写作 bostryxes（也可能见到 bostrychs 这类更古典的拼写，但不常见）。"]}
{"word":"Bostwick","summary":{"en":"Bostwick is mainly used as a proper noun: a surname, and sometimes a U.S. place name.","zh":"Bostwick 主要是专有名词：常作英语姓氏，也可作美国地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name).","zh":"（姓氏）博斯特威克（常见英语姓氏）。"},"examples":[{"en":"Dr. Bostwick will see you at 3 p.m.","zh":"博斯特威克医生下午三点见你。"},{"en":"My teacher’s last name is Bostwick.","zh":"我老师的姓是博斯特威克。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name in the United States (used for some towns/areas).","zh":"（地名）美国的一些城镇或地区名也叫 Bostwick。"},"examples":[{"en":"They drove through Bostwick on their way to the coast.","zh":"他们去海边的路上开车经过博斯特威克。"},{"en":"Bostwick appears on the map as a small community.","zh":"地图上博斯特威克是一个小社区。"}]}],"synonyms":["(surname)","(place name)"],"phonetic":"/ˈbɑstwɪk/","extraExplanation":["Bostwick 通常不是普通词汇，而是专有名词（姓氏或地名）。在写作中首字母要大写：Bostwick。","作为姓氏时，它常见于英语国家的姓名体系里：given name（名）+ family name（姓）。在正式场合可用 Mr./Ms./Dr. + Bostwick 来称呼。"]}
{"word":"bosun","summary":{"en":"A bosun is the crew leader responsible for a ship’s deck work and equipment.","zh":"bosun 指船上负责甲板作业与设备维护的“水手长”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a ship’s officer in charge of the deck crew, ship’s equipment, and maintenance (also called a boatswain)","zh":"（船上的）水手长；甲板部领班（也叫 boatswain）"},"examples":[{"en":"The bosun assigned jobs to the deck crew before sunrise.","zh":"天还没亮，水手长就给甲板船员分配了工作。"},{"en":"If a rope is damaged, report it to the bosun immediately.","zh":"如果绳索损坏了，立刻向水手长报告。"}]}],"synonyms":["boatswain","deck boss","petty officer (nautical)"],"phonetic":"/ˈboʊsən/","extraExplanation":["“bosun”是“boatswain”的常见口语/书写变体（尤其在航海语境里）。在现代英语里两者意思相同，但“boatswain”更接近正式拼写。","词源来自中古英语，和“boat（船）+ swain（青年/仆从）”有关，后来在航海行业里固定为管理甲板事务的职位。","在文学与海洋题材作品中常见（如海盗、捕鲸、远洋航行故事），用来营造“航海职务体系”的真实感。"]}
{"word":"bosuns","summary":{"en":"“Bosuns” is the plural of “bosun/boatswain,” the deck officer who supervises crew and ship’s gear like ropes and anchors.","zh":"“bosuns”是“bosun/boatswain”的复数，指负责管理甲板船员并维护缆绳、锚等船上设备的甲板长/主管。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plural of “bosun” (boatswain): a ship’s officer in charge of the crew and the ship’s equipment, especially the hull, anchors, and ropes.","zh":"“bosun”（也作 boatswain）的复数：船上的高级水手/军官，负责管理甲板船员与船体、锚、缆绳等设备的维护与日常工作。"},"examples":[{"en":"The bosuns checked the ropes before the storm arrived.","zh":"暴风雨来临前，几位甲板长检查了缆绳。"},{"en":"On large ships, bosuns may supervise different teams on deck.","zh":"在大型船只上，甲板长可能分别管理甲板上的不同小组。"}]}],"synonyms":["boatswains","deck boss","deck supervisor"],"phonetic":"/ˈboʊsən/","extraExplanation":["“bosun”来自“boatswain”的口语缩写，虽然拼写常见 boatswain，但现代英语中通常读作 /ˈboʊsən/（听起来像“BOH-sun”）。","在海军或商船语境里，bosun 往往是“最资深的甲板水手/主管”，负责把船长或大副的指令落实到具体的甲板工作。","文学与影视中（如海盗、航海题材作品）常用 bosun 来营造“传统航海/水手文化”的氛围。"]}
{"word":"Boswall","summary":{"en":"“Boswall” is usually a proper name: a Scottish surname and sometimes a Scottish place name (seen in Edinburgh).","zh":"“Boswall”通常是专有名词：苏格兰姓氏，也可作苏格兰地名（在爱丁堡较常见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), most often found in Scotland and in Scottish-descended communities.","zh":"姓氏（家族姓），较常见于苏格兰及具有苏格兰血统的社群。"},"examples":[{"en":"Mr. Boswall sent an email confirming the appointment.","zh":"Boswall 先生发邮件确认了预约。"},{"en":"She traced the Boswall family history back to Scotland.","zh":"她把 Boswall 家族史追溯到了苏格兰。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name used in Scotland (for example, in Edinburgh you may see it in street or neighborhood names such as “Boswall Parkway”).","zh":"苏格兰的一类地名用法（例如在爱丁堡，你可能在街道或社区名称中看到它，如“Boswall Parkway / Boswall 大道”）。"},"examples":[{"en":"We took the bus to Boswall Parkway.","zh":"我们坐公交去了 Boswall Parkway（Boswall 大道）。"},{"en":"The flat is near Boswall, in north Edinburgh.","zh":"这套公寓在爱丁堡北部的 Boswall 附近。"}]}],"phonetic":"/ˈbɑz.wɔl/","extraExplanation":["“Boswall”并不是常见的通用英语词汇，更多作为专有名词出现（人名/地名）。在阅读或听力里遇到时，通常需要结合上下文判断是“某人的姓”还是“某个地点”。","发音在不同家庭或地区可能略有差异；如果你能提供句子或出处（例如书名、地图位置、人物全名），我可以更精确地解释其指代与用法。"]}
{"word":"Boswell","summary":{"en":"Boswell is the name of a famous Scottish biographer; it can also mean a devoted follower who records a notable person’s life in detail.","zh":"Boswell 既指著名的苏格兰传记作家鲍斯韦尔，也可指紧随名人并详细记录其生活言行的忠实随从/传记式记录者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"James Boswell (1740–1795), a Scottish writer best known for writing the famous biography of Dr. Samuel Johnson.","zh":"詹姆斯·鲍斯韦尔（1740–1795），苏格兰作家，最著名的作品是为塞缪尔·约翰逊博士撰写的经典传记。"},"examples":[{"en":"Boswell is best known for The Life of Samuel Johnson.","zh":"鲍斯韦尔最为人熟知的是《塞缪尔·约翰逊传》。"},{"en":"In class we read Boswell’s interviews and notes about Johnson’s conversations.","zh":"课堂上我们读了鲍斯韦尔记录的采访内容和约翰逊的谈话笔记。"}]},{"partOfSpeech":"n.","definition":{"en":"A devoted companion who closely follows someone important and records details about them, often in an admiring way.","zh":"（常带敬仰意味的）忠实随从/密友，紧跟某位重要人物并记录其言行细节的人。"},"examples":[{"en":"The reporter acted like a Boswell, noting every comment the actor made.","zh":"那位记者像个“鲍斯韦尔”一样，把演员说的每句话都记了下来。"},{"en":"He became her Boswell, documenting her career from the beginning.","zh":"他成了她的“鲍斯韦尔”，从一开始就记录她的职业生涯。"}]}],"synonyms":["biographer","chronicler","admirer","companion"],"phonetic":"/ˈbɑz.wɛl/","extraExplanation":["“Boswell”之所以能变成普通名词（a Boswell），主要来自他对18世纪英国文学巨匠塞缪尔·约翰逊（Samuel Johnson）的长期陪伴与细致记录。《塞缪尔·约翰逊传》以大量对话、轶事和日常细节著称，因此“Boswell”在英语里常用来指那种紧随名人、认真记录、甚至略带崇拜的随行记者或传记作者。","语感上，“a Boswell”有时是中性（勤奋记录者），有时带一点讽刺（过度跟随、像“迷弟/迷妹”一样）。具体褒贬通常看上下文。"]}
{"word":"Boswellia","summary":{"en":"Boswellia is a genus of trees famous for producing frankincense resin.","zh":"Boswellia 指乳香属树木，以分泌乳香（frankincense）树脂而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of tree that produces aromatic resin (frankincense), especially used in incense and traditional medicine.","zh":"乳香属（树木的一类），能分泌芳香树脂（乳香/熏香用乳香），常用于焚香和传统医药。"},"examples":[{"en":"Boswellia trees are tapped to collect the resin used to make frankincense.","zh":"人们会在乳香属树上割口取脂，用来制作乳香（frankincense）。"},{"en":"Some supplements contain Boswellia extract for joint comfort.","zh":"一些保健品含有乳香属植物提取物，用于关节舒适度方面。"}]}],"synonyms":["frankincense tree","Boswellia serrata (a species name)"],"phonetic":"/bɑːzˈwɛliə/","extraExplanation":["“Boswellia”是一个植物学属名（拉丁学名），常见相关树脂叫“frankincense”（乳香）。在宗教与香料文化中，乳香在中东、北非一带非常有代表性；在保健品语境里常见表达是“Boswellia extract / Boswellia serrata”。"]}
{"word":"boswellia","summary":{"en":"Boswellia is a type of frankincense-producing tree, or its aromatic resin used in incense and traditional medicine.","zh":"Boswellia 指产乳香的乳香树（或其芳香树脂），常用于熏香与传统医药。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tree (or resin from the tree) that produces frankincense, used for incense, perfume, and traditional medicine","zh":"乳香树（或其树脂）；可产出乳香（frankincense），用于熏香、香水与传统医药"},"examples":[{"en":"Boswellia resin is commonly burned as frankincense in religious ceremonies.","zh":"乳香树的树脂常被当作乳香在宗教仪式中焚烧。"},{"en":"Some people take boswellia supplements to support joint comfort.","zh":"有些人会服用乳香树（boswellia）补充剂来帮助关节舒适。"}]}],"synonyms":["frankincense (resin)","olibanum","boswellia resin"],"phonetic":"/bɑzˈwɛliə/","extraExplanation":["“Boswellia”是一个植物属名，常见相关物种包括Boswellia sacra（阿拉伯乳香树）、Boswellia serrata（印度乳香树）。它们分泌的树脂干燥后就是“乳香（frankincense）”。","在保健品语境中，“boswellia”通常指B. serrata的提取物；它在传统阿育吠陀医学中使用较多。购买或使用补充剂时，注意成分标注、剂量与潜在相互作用，最好咨询专业人士。"]}
{"word":"Boswellian","summary":{"en":"Boswellian describes devoted, detail-rich recording of a person’s life, like a biographer following closely.","zh":"Boswellian 指像传记作者般忠实追随并细致记录某人言行与生活的风格或态度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like James Boswell (the famous biographer of Samuel Johnson): showing devoted admiration and recording someone’s life, words, or habits in careful detail.","zh":"（像詹姆斯·鲍斯韦尔那样）对某人怀有仰慕并细致记录其言行与生活细节的；如传记作者般忠实追随、详尽记述的。"},"examples":[{"en":"The reporter’s Boswellian notes captured every joke and gesture of the candidate.","zh":"这位记者用近乎“鲍斯韦尔式”的笔记，把候选人的每个笑话和手势都记了下来。"},{"en":"She took a Boswellian interest in the director’s daily routine and conversations.","zh":"她对导演的日常作息和谈话表现出一种“鲍斯韦尔式”的浓厚兴趣。"},{"en":"His Boswellian memoir is full of small details that make the writer feel alive.","zh":"他的“鲍斯韦尔式”回忆录充满细节，让那位作家仿佛活在读者面前。"}]}],"synonyms":["biographical","adulating","devoted","detail-oriented","hero-worshipping"],"phonetic":"/bɑzˈwɛliən/","extraExplanation":["“Boswellian”来自苏格兰作家 James Boswell（詹姆斯·鲍斯韦尔），他以《The Life of Samuel Johnson》（《塞缪尔·约翰逊传》）闻名，擅长记录对话与生活细节。","这个词常用来形容一种“忠实追随＋细节控式记录”的写法或态度，语气多为中性到褒义；但在某些语境下也可能暗示过度崇拜或过度跟随。"]}
{"word":"boswellian","summary":{"en":"Boswellian means ‘in the detailed, intimate style of James Boswell’s biographies.’","zh":"Boswellian 指“具有博韦尔式传记风格：细节极多、亲密贴近、记录日常”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) Related to James Boswell or his style of biography; especially very detailed, chatty, and full of everyday facts about a famous person.","zh":"（形容词）与詹姆斯·博斯韦尔或其传记风格有关的；尤指对名人生活细节记录得非常细致、带有闲谈式口吻、充满日常琐事的。"},"examples":[{"en":"Her memoir is almost Boswellian, recording tiny conversations and habits day by day.","zh":"她的回忆录几乎是博韦尔式的，把细小的对话和习惯按日记录下来。"},{"en":"The reporter kept a Boswellian notebook of the actor’s routines behind the scenes.","zh":"那位记者用一本“博韦尔式”的笔记本记录了演员幕后的一举一动。"},{"en":"He offered a Boswellian portrait of his mentor—warm, intimate, and packed with detail.","zh":"他对导师做了一个博韦尔式的描写：温暖、亲密、细节密集。"}]}],"synonyms":["detailed","biographical","intimate","anecdotal","minute"],"phonetic":"/bɑzˈwɛliən/","extraExplanation":["“Boswellian”源自18世纪苏格兰作家James Boswell（詹姆斯·博斯韦尔），他写的《塞缪尔·约翰逊传》（The Life of Samuel Johnson）以大量对话、日常琐事与近距离观察而闻名。","这个词常带赞赏意味（生动、真实、细节丰富），但也可能含轻微批评（过分琐碎、像跟拍记录）。","在文学评论里，你可能会看到“Boswellian detail/portrait/biography”等搭配，用来形容传记或人物描写的“贴身记录感”。"]}
{"word":"Boswelliana","summary":{"en":"Boswelliana means collected writings, anecdotes, or memorabilia related to James Boswell (often connected to his biography of Samuel Johnson), and by extension can mean a person’s or subject’s related “-iana” materials.","zh":"Boswelliana 指与詹姆斯·鲍斯韦尔有关的资料、轶事或纪念物（常与其《约翰逊传》相关），也可引申为某人或某主题的“—iana”式相关材料汇编。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"things (such as books, articles, anecdotes, letters, or memorabilia) connected with James Boswell—especially material about Boswell and his famous biography of Samuel Johnson.","zh":"与詹姆斯·鲍斯韦尔（James Boswell）有关的资料或物品（如书籍、文章、轶事、书信、纪念品等），尤指围绕他及其《约翰逊传》相关的内容。"},"examples":[{"en":"The library’s special collection includes rare Boswelliana, such as early editions and private letters.","zh":"这家图书馆的特藏包括珍贵的“鲍斯韦尔相关资料”，例如早期版本和私人书信。"},{"en":"Her lecture used Boswelliana to show how readers shaped Johnson’s public image.","zh":"她在讲座中引用“鲍斯韦尔相关资料”，说明读者如何塑造约翰逊的公众形象。"}]},{"partOfSpeech":"n.","definition":{"en":"more broadly, collections of information, writings, or memorabilia related to a particular person or subject (modeled on the suffix “-iana”).","zh":"更广义地：指与某位名人或某个主题相关的资料、著作或纪念物的汇编（仿照后缀“-iana”的构词方式）。"},"examples":[{"en":"The museum shop sold local-history “iana” and other souvenirs, though not true Boswelliana.","zh":"博物馆商店出售本地史相关的“某某资料集”和纪念品，但当然不算真正的“鲍斯韦尔相关资料”。"}]}],"synonyms":["memorabilia","anecdotes","papers","archives","collectanea"],"phonetic":"/ˌbɑːzˌwɛliˈænə/","extraExplanation":["“Boswelliana”来自18世纪苏格兰作家詹姆斯·鲍斯韦尔（James Boswell）。他写的《约翰逊传》（The Life of Samuel Johnson）常被认为是英语世界最经典的传记之一，因此学界与读书圈里逐渐出现专门收集“与鲍斯韦尔/约翰逊相关材料”的用法。","“-iana”是英语里一个常见的构词后缀，用来表示“与某人/某事有关的一切材料或逸事的汇集”。例如：Shakespeareana（莎士比亚相关资料）、Johnsoniana（约翰逊相关资料）。因此“Boswelliana”也带有一种“可供研究与赏玩的小材料合集”的文雅语感。"]}
{"word":"boswelliana","summary":{"en":"A collective term for materials related to James Boswell, especially writings and items connected to his work on Samuel Johnson.","zh":"指与詹姆斯·鲍斯韦尔相关的一类资料/收藏，尤其是与他记录和书写塞缪尔·约翰逊有关的文献与物品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"books, letters, anecdotes, quotations, or other materials connected with (or collected by) James Boswell, especially relating to Samuel Johnson and Boswell’s famous biography of him","zh":"与詹姆斯·鲍斯韦尔（James Boswell）有关的书籍、书信、轶事、引语或其他资料，尤指与塞缪尔·约翰逊（Samuel Johnson）及鲍斯韦尔的著名传记相关的材料（也可指这类收藏品的总称）"},"examples":[{"en":"The library has a small collection of Boswelliana, including early editions of Boswell’s journals.","zh":"这家图书馆收藏了一小批 Boswelliana，包括鲍斯韦尔日记的早期版本。"},{"en":"Scholars studying Johnson often consult Boswelliana for firsthand details about his life and conversation.","zh":"研究约翰逊的学者常会查阅 Boswelliana，以获得关于他生活与谈话的一手细节。"}]}],"synonyms":["Boswell materials","Boswell collection","Johnsoniana (related term)"],"phonetic":"ˌbɑzwiˈliːənə","extraExplanation":["“Boswelliana”属于带有学术/收藏语气的词，常见于文学研究、传记研究或古籍收藏领域。后缀“-iana”在英语里常用来表示“与某人/某主题有关的一组材料或收藏”（如 Shakespeareana 指与莎士比亚有关的资料）。","詹姆斯·鲍斯韦尔以《约翰逊传》（The Life of Samuel Johnson）闻名，这部作品常被视为英语传记写作的经典，因此与其相关的文献与轶闻被统称为 Boswelliana。"]}
{"word":"Boswellism","summary":{"en":"Boswellism means an admiring, detail-heavy way of writing about a famous person’s everyday life and talk.","zh":"Boswellism 指一种带仰慕色彩、重细节的名人传记/描写风格，尤其爱记录日常谈话与琐事。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A style of biography or writing that records a famous person’s everyday conversations and small details in a lively, admiring way (often like a devoted fan).","zh":"一种传记或写作风格：以生动、带欣赏甚至“追星”式的口吻，记录名人的日常谈话与琐碎细节。"},"examples":[{"en":"The article is full of Boswellism, reporting the actor’s casual jokes as if they were historic events.","zh":"这篇文章充满了“博斯韦尔式”笔法，把那位演员随口的玩笑写得像历史大事一样。"},{"en":"Her biography avoids Boswellism and focuses instead on the writer’s work and ideas.","zh":"她的传记避免了“博斯韦尔式”做法，而是聚焦于作家的作品与思想。"}]}],"synonyms":["hero-worship (in biography)","hagiography (often stronger/more religious)","idolization","fan-like biography"],"phonetic":"/ˈbɑz.wɛlˌɪz.əm/","extraExplanation":["该词来自James Boswell（詹姆斯·博斯韦尔），他以《The Life of Samuel Johnson》（《塞缪尔·约翰逊传》）闻名，书中大量记录约翰逊的谈话、日常细节与社交场景，因此“Boswellism”常用来形容对名人生活细节的细密记录与略带崇拜的描写。","语感上，“Boswellism”有时带轻微贬义：暗示作者过度关注八卦式细节、或过分仰慕对象，而忽略更重要的成就、思想与历史背景。"]}
{"word":"boswellism","summary":{"en":"Boswellism means detailed, Boswell-like recording of a famous person’s life and talk, often implying overly admiring, uncritical attention.","zh":"Boswellism 指像博斯韦尔那样细致记录名人言行与日常的做法，常暗示过度崇拜、缺乏批判的追随。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The practice of carefully recording a famous person’s daily life, conversations, and small details (like a biographer or devoted observer).","zh":"（像传记作者或忠实观察者那样）细致记录名人日常生活、谈话与琐事的做法。"},"examples":[{"en":"Her notebooks were full of Boswellism—every joke and comment from the director was written down.","zh":"她的笔记本充满了“博斯韦尔式记录”——导演说的每个笑话和评论都被记了下来。"},{"en":"Some journalists are criticized for Boswellism when they follow celebrities too closely.","zh":"有些记者因过度追随明星、进行“博斯韦尔式记录”而受到批评。"}]},{"partOfSpeech":"n.","definition":{"en":"Excessive admiration or hero-worship of an important person, often shown through flattering attention and detailed reporting.","zh":"对重要人物的过度崇拜或“粉饰式”追随，常表现为奉承与事无巨细的报道。"},"examples":[{"en":"The article slipped into Boswellism, praising the politician without questioning him.","zh":"这篇文章滑向了“博斯韦尔式吹捧”，一味赞美那位政客而不加追问。"},{"en":"Fans loved the biography, but critics called it Boswellism.","zh":"粉丝很喜欢这本传记，但评论家称它是“博斯韦尔式崇拜”。"}]}],"synonyms":["hero-worship","adulation","fawning","flattery","hagiography"],"phonetic":"ˈbɑzwəlˌɪzəm","extraExplanation":["“Boswellism”源自苏格兰作家詹姆斯·博斯韦尔（James Boswell）。他以《约翰逊传》（The Life of Samuel Johnson）闻名，擅长记录名人谈话与生活细节，因此这个词常带一点“跟拍式记录/过度亲近名人”的意味。","在语气上，“Boswellism”往往略带贬义：强调记录或赞美得太过头，缺少距离感与批判性。"]}
{"word":"Boswellize","summary":{"en":"Boswellize means to describe someone’s life in rich, close-up detail, especially by recording everyday events and conversations.","zh":"Boswellize 指以非常细致贴身的方式描写某人的生活，尤其是记录日常事件与对话。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to write about someone’s life in a very detailed, intimate way (often by recording daily events, conversations, and personal habits), like the biographer James Boswell did","zh":"以非常细致、贴身的方式记录并写作某人的生活（常包含日常琐事、对话与习惯），仿效詹姆斯·鲍斯韦尔的传记写法"},"examples":[{"en":"The journalist seemed to boswellize the actor, noting every meal, mood, and remark.","zh":"这位记者像在“鲍斯韦尔式”写作那样记录这位演员，连每一顿饭、每一种情绪和每一句话都不放过。"},{"en":"She kept a notebook to boswellize her mentor’s ideas and conversations.","zh":"她随身带着笔记本，用来“鲍斯韦尔式”记录导师的想法与谈话。"}]}],"synonyms":["chronicle","document","biographize","portray","profile"],"phonetic":"/ˈbɑz.wəl.aɪz/","extraExplanation":["“Boswellize”来自18世纪苏格兰作家詹姆斯·鲍斯韦尔（James Boswell）。他写的《约翰逊传》（The Life of Samuel Johnson）以大量对话、细节与日常观察著称，因此这个动词常带有“把某人生活细节写得过于全面、甚至有点窥私”的语感。","用法上多见于文学评论、新闻批评或传记写作讨论中，属于较少见、偏书面/文化语汇。"]}
{"word":"boswellize","summary":{"en":"“Boswellize” means to describe someone in extremely detailed, often biographical detail—sometimes admiring, sometimes a bit intrusive.","zh":"“boswellize”指像博斯韦尔那样极其细致（常带传记式）的描写或记录某人；有时含赞赏，有时也暗示过度窥探。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to record or write about someone’s life, words, or behavior in very detailed, often admiring or intimate detail (like a devoted biographer)","zh":"（像博斯韦尔那样）以非常细致、常带欣赏甚至亲密的方式记录或撰写某人的生活、言行或细节（多指传记式描写）"},"examples":[{"en":"The reporter seemed to boswellize the actor, noting every habit, joke, and gesture.","zh":"那位记者简直在“博斯韦尔式”地记录那位演员，把每个习惯、玩笑和手势都写了下来。"},{"en":"She didn’t want her colleagues to boswellize her private life in the office gossip.","zh":"她不希望同事在办公室八卦里把她的私生活“博斯韦尔式”地细细记录。"}]},{"partOfSpeech":"v.","definition":{"en":"to attach yourself to a famous or powerful person in order to observe them closely and then describe them (sometimes with a slightly critical tone)","zh":"（有时略带贬义）依附或紧跟名人/权势者以便近距离观察并加以描写、传播"},"examples":[{"en":"Some critics said he was boswellizing the senator just to gain access and attention.","zh":"一些评论者说他跟着那位参议员是在“博斯韦尔式”追随，只为获得接触机会和关注。"},{"en":"Don’t boswellize your boss—do your job and respect boundaries.","zh":"别去“博斯韦尔式”紧盯老板——做好本职工作，也要尊重界限。"}]}],"synonyms":["chronicle","document","profile","biographize","shadow","trail"],"phonetic":"/ˈbɑz.wəl.aɪz/","extraExplanation":["“boswellize”来自18世纪苏格兰作家詹姆斯·博斯韦尔（James Boswell）。他以《约翰逊传》（The Life of Samuel Johnson）闻名，因记录细节极多、对人物言行观察入微而成为“传记写得很细、像随身记录”的典型。","这个词在现代英语里比较少见，常用于评论写作、传记写作或媒体报道风格：强调“把一个人写得非常细”，有时也暗含“过度关注私生活/像跟拍一样”的批评意味。"]}
{"word":"boswellized","summary":{"en":"Boswellized means recorded or portrayed in extremely detailed, often admiring (or intrusive) biographical style; it can also mean to do that kind of detailed documenting.","zh":"boswellized 指以极其细致、带传记式（常含崇拜或侵入感）的方式被记录/描写；也可指进行这种“事无巨细”的记录。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(often humorous) Described, recorded, or followed in very detailed notes—especially in the way an admiring biographer might document someone’s life.","zh":"（常带幽默）被非常详细地记录、描写或“跟拍式”记述；尤指像崇拜的传记作者那样把一个人的生活写得极细。"},"examples":[{"en":"The celebrity felt boswellized—every lunch and phone call ended up online.","zh":"那位名人觉得自己被“博斯韦尔化”了——连每次午餐和电话都被发到网上。"},{"en":"In the memoir, the professor’s habits are boswellized down to the brand of tea he drank.","zh":"在那本回忆录里，教授的习惯被写得细到他喝哪种品牌的茶。"}]},{"partOfSpeech":"vt.","definition":{"en":"To record or portray someone’s life and sayings in an extremely detailed (sometimes admiring or intrusive) way.","zh":"以极其细致（有时带崇拜或侵入感）的方式记录或描写某人的生活与言行。"},"examples":[{"en":"He boswellized his roommate for a year, filling notebooks with daily conversations.","zh":"他“博斯韦尔化”地记录室友整整一年，把每天的对话都写满了笔记本。"},{"en":"The journalist was accused of boswellizing the politician instead of keeping professional distance.","zh":"那位记者被指责对那名政客进行“博斯韦尔化”式的贴身记录，而不是保持职业距离。"}]}],"synonyms":["minutely documented","chronicled","closely observed","over-documented","biographized"],"phonetic":"ˈbɑz.wə.laɪzd","extraExplanation":["“boswellized”来自英国作家詹姆斯·博斯韦尔（James Boswell）。他因《塞缪尔·约翰逊传》（The Life of Samuel Johnson）而闻名，书中用大量对话、细节与日常片段呈现约翰逊的生活。","因此这个词常带两层语气：一是“细致到惊人、很生动”；二是“过度关注、像被跟踪一样”。在现代语境里也常用来形容被媒体/社交平台过度记录。"]}
{"word":"boswellizing","summary":{"en":"“Boswellizing” means excessively flattering or admiring someone, often to the point of toadying or writing an overly praising profile.","zh":"“boswellizing”指对某人过度崇拜式奉承/吹捧，常带讨好或夸到失真的意味（也可指写出过度赞美的传记或人物报道）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to flatter or follow someone in an overly admiring, almost “fan-like” way; to toady.","zh":"（对某人）过度崇拜式地奉承、追随；拍马屁（带“粉丝式吹捧”的感觉）。"},"examples":[{"en":"Stop boswellizing the manager—just give your honest opinion.","zh":"别再对经理粉丝式吹捧了——直接说出你的真实看法。"},{"en":"The article isn’t a review; it’s boswellizing disguised as journalism.","zh":"那篇文章根本不是评论，而是披着新闻外衣的吹捧。"}]},{"partOfSpeech":"v.","definition":{"en":"to write or speak about someone in an extremely admiring way, especially in a biography or profile.","zh":"（尤指在传记/人物特写中）以极度仰慕的口吻写/说某人；把对方写得过于完美。"},"examples":[{"en":"The biography spends pages boswellizing its subject and ignores his faults.","zh":"那本传记用好几页来吹捧主人公，却对他的缺点避而不谈。"},{"en":"She worries that praising her mentor too much will sound like boswellizing.","zh":"她担心把导师夸得太多会显得像在吹捧。"}]}],"synonyms":["fawn over","toady","suck up to","flatter","idolize","hero-worship"],"phonetic":"/ˈbɑz.wəˌlaɪ.zɪŋ/","extraExplanation":["“boswellize / boswellizing”源自英国作家詹姆斯·鲍斯韦尔（James Boswell），他写的《塞缪尔·约翰逊传》（Life of Samuel Johnson）非常生动、充满崇敬之情。后来这个名字被引申为“像鲍斯韦尔那样过度崇拜式记录/吹捧他人”。","语气通常偏负面：强调“夸到失真、带讨好意味”。正式写作里偶尔出现，日常口语更常用“flatter / fawn over / suck up to”。"]}
{"word":"Bosworth","summary":{"en":"Bosworth is usually a proper noun: a surname, a place in England, or a reference to the Battle of Bosworth Field (1485).","zh":"Bosworth通常是专有名词：可指姓氏、英国地名，或指1485年的“博斯沃思原野之战”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname) of English origin","zh":"（英裔常见）姓氏：博斯沃思"},"examples":[{"en":"My professor’s last name is Bosworth.","zh":"我教授的姓是博斯沃思。"},{"en":"She traced the Bosworth family history back to the 1800s.","zh":"她把博斯沃思家族史追溯到19世纪。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name in England, especially Market Bosworth in Leicestershire","zh":"英国地名，尤指莱斯特郡的“博斯沃思集镇（Market Bosworth）”"},"examples":[{"en":"They stayed in Market Bosworth while visiting the countryside.","zh":"他们游览乡村时住在博斯沃思集镇。"},{"en":"Bosworth is a quiet town with a lot of history nearby.","zh":"博斯沃思是个安静的小镇，附近有很多历史遗迹。"}]},{"partOfSpeech":"n.","definition":{"en":"short for the Battle of Bosworth Field (1485), a famous battle that ended the Wars of the Roses in England","zh":"“博斯沃思原野之战”（1485）的简称：英格兰著名战役，标志着玫瑰战争的结束"},"examples":[{"en":"In British history class, we learned about Bosworth and the rise of the Tudor dynasty.","zh":"在英国历史课上，我们学习了博斯沃思之战以及都铎王朝的兴起。"},{"en":"Richard III was defeated at Bosworth Field in 1485.","zh":"理查三世于1485年在博斯沃思原野战役中战败。"}]}],"phonetic":"/ˈbɑz.wɝθ/","extraExplanation":["“Bosworth”在英语里多见于专有名词：人名/姓氏、地名、以及历史事件名。写作时通常首字母大写。","历史上常说的“Bosworth（博斯沃思）”多指1485年的“博斯沃思原野之战”，它常被视为中世纪英格兰政治格局转折点：理查三世阵亡，亨利·都铎成为亨利七世，开启都铎王朝。"]}

