{"word":"Bovard","summary":{"en":"Bovard is most commonly a surname, and it can also be the name of a place or building named after someone.","zh":"Bovard 通常是姓氏，也可用作地名或建筑名（多为纪念某位 Bovard）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name).","zh":"姓氏（家族姓）。"},"examples":[{"en":"Her last name is Bovard.","zh":"她的姓是 Bovard。"},{"en":"James Bovard is an American writer and commentator.","zh":"James Bovard 是一位美国作家和评论员。"}]},{"partOfSpeech":"n.","definition":{"en":"a proper name used for places or buildings (often named after a person with the surname Bovard).","zh":"专有名词：用于地名或建筑名（常因纪念姓 Bovard 的人物而命名）。"},"examples":[{"en":"We met in front of Bovard Auditorium.","zh":"我们在 Bovard 礼堂前见面。"},{"en":"The event will be held at Bovard.","zh":"活动将在 Bovard（某建筑/地点）举行。"}]}],"phonetic":"ˈboʊvərd","extraExplanation":["“Bovard”多见于英语语境中的姓氏；作为建筑或地点名时，通常来自捐赠者、校方领导或重要人物的姓氏（例如美国南加州大学的 Bovard Auditorium）。","词源方面，它可能与法语姓氏拼写变体有关（如 Bouvard），但具体家族来源需结合个人/家谱资料确认。"]}
{"word":"Bovarism","summary":{"en":"Bovarism is escapist self-deception—imagining a more ideal life so strongly that real life feels disappointing.","zh":"鲍瓦里主义指用强烈的理想化幻想来逃避现实，进而觉得现实生活令人失望。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tendency to escape reality by imagining a more exciting, romantic, or glamorous life, often leading to dissatisfaction with one’s real life.","zh":"（鲍瓦里主义）通过幻想更刺激、浪漫或更光鲜的生活来逃避现实的倾向，常导致对真实生活的不满。"},"examples":[{"en":"Her constant daydreams about a perfect romance began to feel like bovarism, making her unhappy with ordinary relationships.","zh":"她总幻想完美爱情，渐渐像是鲍瓦里主义，让她对普通的恋爱关系感到不满足。"},{"en":"The novel criticizes bovarism—the belief that life should look like the stories we consume.","zh":"这部小说批评了鲍瓦里主义——认为生活应该像我们读到或看到的故事那样。"}]}],"synonyms":["escapism","daydreaming","self-deception","romantic idealism","wishful thinking"],"phonetic":"/ˈboʊvəˌrɪzəm/","extraExplanation":["词源与文化背景：Bovarism 来自法国作家福楼拜（Gustave Flaubert）的小说《包法利夫人》（Madame Bovary）。女主角艾玛·包法利沉迷于浪漫小说式的想象，把现实婚姻与生活看得乏味，从而不断追逐“更理想”的人生。后来人们用 bovarism 来概括这种“以幻想替代现实、因此更不满足”的心理倾向。","用法提示：这个词较书面、偏文学与心理/文化评论语境；常用于讨论“被影视/社媒塑造的过高期待”与现实落差。"]}
{"word":"bovarism","summary":{"en":"Bovarism is the habit of escaping reality by imagining a more ideal, romantic life, often causing dissatisfaction with real life.","zh":"包法利主义指用对更理想、更浪漫人生的幻想来逃避现实，常因此对真实生活感到不满。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tendency to escape from reality by imagining a more exciting, romantic, or “better” life for yourself (often leading to dissatisfaction with real life)","zh":"（常译）包法利主义：通过幻想更精彩、更浪漫或“更理想”的人生来逃避现实的倾向，常导致对真实生活的不满"},"examples":[{"en":"Her constant daydreaming about a glamorous life in another city felt like bovarism.","zh":"她总是幻想在另一个城市过奢华生活，这种状态很像包法利主义。"},{"en":"The novel explores bovarism—the gap between what we imagine and what life really offers.","zh":"这部小说探讨了包法利主义：想象与现实之间的落差。"},{"en":"Social media can intensify bovarism by making ordinary life seem disappointing.","zh":"社交媒体可能会加剧包法利主义，让普通生活显得更令人失望。"}]}],"synonyms":["escapism","romantic idealism","fantasy-proneness"],"phonetic":"/ˈboʊvəˌrɪzəm/","extraExplanation":["“bovarism”源自法国作家福楼拜的小说《包法利夫人》（Madame Bovary）。女主角艾玛沉迷浪漫幻想、厌倦平凡现实，因此该词常用于文学评论、心理与文化讨论中，描述“用幻想替代现实”的心理倾向。","这个词通常带有批判色彩（暗示不切实际、过度理想化），但在更中性的语境里也可用来讨论“理想自我与现实自我”的张力。"]}
{"word":"bovarist","summary":{"en":"A “bovarist” is someone (or something) marked by bovarism: unrealistic romantic fantasy and dissatisfaction with ordinary reality, from Madame Bovary.","zh":"“bovarist（包法利式的人/特质）”指沉溺浪漫幻想、对平凡现实长期不满的心态或人，源自《包法利夫人》。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who escapes reality through romantic fantasies and is chronically dissatisfied with ordinary life (someone who shows “bovarism”).","zh":"沉溺于浪漫幻想、用想象逃避现实而对平凡生活长期不满的人（表现出“包法利主义”的人）。"},"examples":[{"en":"He’s a bit of a bovarist—always dreaming of a grand life while ignoring what he has now.","zh":"他有点“包法利式”的人——总梦想轰轰烈烈的人生，却忽视眼前拥有的东西。"},{"en":"The novel’s main character is a bovarist who mistakes daydreams for a plan.","zh":"这部小说的主角是个“包法利式”的人，把白日梦当成了人生计划。"}]},{"partOfSpeech":"adj.","definition":{"en":"showing unrealistic romantic expectations and dissatisfaction with real life; characterized by bovarism.","zh":"（性格/态度）不切实际地浪漫化期待、对现实生活不满足的；带有包法利主义特征的。"},"examples":[{"en":"Her bovarist hopes kept her from appreciating small, real joys.","zh":"她那种包法利式的期待，让她难以珍惜那些细小而真实的快乐。"}]}],"synonyms":["dreamer","romantic idealist","escapist","fantasist"],"phonetic":"/ˈboʊvəˌrɪst/","extraExplanation":["“bovarist / bovarism（包法利主义）”源自法国作家福楼拜的小说《包法利夫人》（Madame Bovary, 1857）。女主角艾玛·包法利沉迷浪漫小说与想象中的“更好生活”，因此对现实婚姻与日常不断失望。后来评论界用“包法利主义”来指一种把幻想当现实、永远觉得现实不够美好的心理倾向。","这个词多见于文学评论、心理/文化讨论与较正式的写作中；日常口语里更常用的表达是“unrealistic romantic,” “daydreamer,” 或 “escapist.”"]}
{"word":"bovaristic","summary":{"en":"Bovaristic describes someone who escapes into romantic fantasies and feels dissatisfied with ordinary reality.","zh":"bovaristic 指沉溺浪漫幻想、因此对平凡现实不满的“包法利式”心态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Showing “bovarism”: a habit of escaping into romantic fantasies and being dissatisfied with ordinary life, often by imagining oneself as more exciting or important than reality.","zh":"带有“包法利主义”的：习惯沉溺于浪漫幻想、对平凡现实不满，常通过想象更精彩或更重要的自我来逃避现实。"},"examples":[{"en":"Her bovaristic daydreams made her bored with a stable, ordinary job.","zh":"她带有包法利式的白日梦，让她对稳定而普通的工作感到厌倦。"},{"en":"The novel portrays a bovaristic heroine who expects life to feel like a love story.","zh":"这部小说刻画了一位包法利式的女主角，她期待人生像爱情故事一样。"},{"en":"Scrolling through luxury lifestyles online can feed bovaristic expectations.","zh":"在网上刷奢华生活可能会助长包法利式的期待。"}]}],"synonyms":["fantasy-prone","romanticized","idealistic","escapist"],"phonetic":"/ˌboʊvəˈrɪstɪk/","extraExplanation":["“bovaristic”来自法语/文学批评中的“Bovary”（包法利），源头是福楼拜的小说《包法利夫人》（Madame Bovary）。主人公艾玛·包法利沉迷于浪漫小说式的爱情与上流生活想象，因而不断对现实失望。","在现代语境里，这个词不只指爱情幻想，也可指被广告、社交媒体或消费文化激发的“理想人生幻觉”，从而对日常生活产生强烈落差感。"]}
{"word":"bovarysm","summary":{"en":"Bovarysm (also spelled Bovarism) is the tendency to escape into romantic or idealized fantasies and feel dissatisfied with ordinary reality.","zh":"Bovarysm（也写作 Bovarism）指沉迷于浪漫化/理想化幻想，从而对平凡现实感到不满的倾向。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a habit of imagining your life as more exciting, romantic, or important than it really is, often leading to dissatisfaction with ordinary reality","zh":"（鲍瓦里主义）把现实生活想象得比实际更浪漫、更精彩或更重要的倾向，常导致对日常现实的不满"},"examples":[{"en":"Her constant complaints about her “boring” life sounded like bovarysm rather than real hardship.","zh":"她总抱怨自己的生活“无聊”，听起来更像鲍瓦里主义，而不是真正的困苦。"},{"en":"Social media can fuel bovarysm by making other people’s lives look perfect.","zh":"社交媒体可能会助长鲍瓦里主义，因为它让别人的生活看起来完美无缺。"}]},{"partOfSpeech":"n.","definition":{"en":"(literary/psychology) unrealistic self-idealization—building an imaginary identity that conflicts with one’s real situation","zh":"（文学/心理语境）不切实际的自我理想化——塑造与真实处境相冲突的“想象身份”"},"examples":[{"en":"The novel explores bovarysm: the character invents a glamorous self to escape daily routine.","zh":"这部小说探讨了鲍瓦里主义：主人公为了逃避日常琐碎，虚构了一个光鲜的自我。"}]}],"synonyms":["Bovarism","escapism","romantic idealism","fantasy-proneness"],"phonetic":"ˈboʊvəˌrɪzəm","extraExplanation":["词源来自福楼拜（Gustave Flaubert）的小说《包法利夫人》（Madame Bovary）。女主角艾玛·包法利沉迷浪漫幻想，觉得现实婚姻与乡镇生活乏味，于是不断追求“理想人生”，最终走向悲剧。","英语里也常见拼写 Bovarism（更常用），bovarysm 属于变体拼写。这个词多用于文学评论、文化批评或心理讨论中，日常口语不算常见。"]}
{"word":"bovate","summary":{"en":"A historical medieval land unit based on what one ox could plow, roughly one-eighth of a hide.","zh":"一种历史上的中世纪土地单位，以一头牛的耕作能力为基础，约为一海德的八分之一。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A medieval unit of land area: the amount of land considered workable by one ox in a plowing season or roughly one-eighth of a “hide” (often similar to an oxgang).","zh":"（历史用语）中世纪的一种土地面积单位：指一头牛在一个耕作季节被认为能耕作的土地量，约等于“一海德（hide）”的八分之一（常与“牛耕地 oxgang”接近）。"},"examples":[{"en":"The charter granted the abbey two bovates of land near the village.","zh":"这份契约把村庄附近的两“bovate”土地授予了修道院。"},{"en":"Records list rents by the bovate, not by modern acres.","zh":"记录按“bovate”而不是按现代的英亩来记租金。"}]}],"synonyms":["oxgang"],"phonetic":"/ˈboʊveɪt/","extraExplanation":["“bovate”主要见于英格兰中世纪文献、地产契约与赋税记录中，属于历史土地计量单位，并非现代英语常用词。","它与农业生产能力相关：用“几头牛能耕多少地”来估算土地，而不是用固定的几何面积；不同地区与土质条件会导致实际面积差异。","常见相关词：hide（海德，较大的土地单位）、oxgang（牛耕地，常被视为与 bovate 接近或同义）。"]}
{"word":"Bove","summary":{"en":"“Bove” is rare in modern English: it can mean an ox in archaic/literary use, and it is also a surname/place name.","zh":"“Bove”在现代英语中较少见：可作古体/文学用语表示“牛”，也常见作姓氏或地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(archaic/literary) An ox; a bovine animal.","zh":"（古/文学用语）牛；公牛；牛科动物。"},"examples":[{"en":"In older poems, you may see “bove” used to mean an ox.","zh":"在较早的诗歌里，你可能会看到用“bove”来表示“公牛/牛”。"},{"en":"The farmer drove the bove slowly across the field. (literary)","zh":"农夫慢慢赶着那头牛穿过田野。（文学用法）"}]},{"partOfSpeech":"other","definition":{"en":"A surname or place name (a proper noun).","zh":"人名或地名（专有名词）。"},"examples":[{"en":"She interviewed Dr. Bove about the new research.","zh":"她采访了Bove博士，讨论这项新研究。"}]}],"synonyms":["ox","bull","bovine"],"phonetic":"/boʊv/","extraExplanation":["“bove”作为普通名词在现代英语里很少见，多出现在古体/诗歌语境中；现代更常用的是“ox”（公牛/阉牛）或“bovine”（形容词：牛的）。","词源上与拉丁语“bos”（牛）有关；你也可能在意大利语里见到“bove”，意为“公牛/牛”。"]}
{"word":"bove","summary":{"en":"Bove is a poetic/old-fashioned form of “above,” often written as ’bove.","zh":"bove 是“above”的诗歌/古语形式，常写作 ’bove。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(poetic/archaic) above; in or to a higher place.","zh":"（诗歌/古语）在……上方；向更高处；相当于 above。"},"examples":[{"en":"The moon shone bright ’bove the silent hills.","zh":"月光明亮地照在寂静的群山上方。"},{"en":"Look bove, and you’ll see the first stars.","zh":"往上看，你会看到第一批星星。"}]},{"partOfSpeech":"prep.","definition":{"en":"(poetic/archaic) above (used like a preposition).","zh":"（诗歌/古语）在……之上（作介词用）。"},"examples":[{"en":"Birds circled bove the lake.","zh":"鸟群在湖面上方盘旋。"},{"en":"A soft light hung bove the doorway.","zh":"门口上方挂着一盏柔和的灯。"}]}],"synonyms":["above","overhead","over"],"phonetic":"/bʌv/","extraExplanation":["“bove”多见于诗歌或旧式英语里，常写作“’bove”，是把“above”前面的 a- 省略（省音/省略）以配合韵律或押韵。现代日常英语通常用“above”。","在经典歌词和诗句中常见，如“the stars ’bove”（天上的星星）。"]}
{"word":"bovenland","summary":{"en":"Bovenland is a rare Dutch/Afrikaans term meaning “uplands/inland,” and it can also appear as a place or brand name.","zh":"Bovenland 是罕见的荷兰语/南非荷兰语词，意为“高地/内陆”，也可用作地名或品牌名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare; from Dutch/Afrikaans) the uplands or inland/highland area (literally “upper land”).","zh":"（罕见；源自荷兰语/南非荷兰语）高地、内陆（字面义为“上方的土地”）。"},"examples":[{"en":"They drove from the coast into the bovenland, where the air was cooler and drier.","zh":"他们从海岸开车进入高地（bovenland），那里的空气更凉爽也更干燥。"},{"en":"Older place descriptions sometimes contrast the lowlands with the bovenland.","zh":"较早的地理描述有时会把低地与高地（bovenland）作对比。"}]},{"partOfSpeech":"n.","definition":{"en":"(Proper name) a place name or brand name used in Dutch-speaking contexts (for example, as a farm, district, or winery name).","zh":"（专有名词）在荷兰语地区常见的地名或品牌名（例如农场、区域或酒庄名称）。"},"examples":[{"en":"The label says Bovenland, but it’s the winery name rather than a common English word.","zh":"酒标上写着 Bovenland，但那是酒庄名，并不是常见英语词。"}]}],"synonyms":["uplands","highlands","inland","interior"],"phonetic":"/ˈboʊvənˌlænd/","extraExplanation":["“Bovenland”由荷兰语/南非荷兰语 boven（上方的）+ land（土地）组成，含义接近英语 uplands / highlands / inland。","它不是标准现代英语词汇；在英文材料中通常作为外来词（尤其在南部非洲或荷兰相关语境）或专有名词出现。写作时若面向英语读者，常用 uplands / highlands，并可在首次出现时括号注明 bovenland。"]}
{"word":"Bovensmilde","summary":{"en":"Bovensmilde is a village in Drenthe, the Netherlands.","zh":"Bovensmilde 是荷兰德伦特省的一个村庄。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A village in the province of Drenthe, in the northeastern Netherlands.","zh":"荷兰东北部德伦特省（Drenthe）的一个村庄。"},"examples":[{"en":"Bovensmilde is a small village in Drenthe, not far from Assen.","zh":"Bovensmilde 是德伦特省的一个小村庄，离阿森（Assen）不远。"},{"en":"They biked through Bovensmilde on their way to the countryside.","zh":"他们骑车经过 Bovensmilde，前往乡间。"}]}],"synonyms":["(No true synonyms; it is a proper place name.)"],"phonetic":"ˌboʊvənˈsmɪldə","extraExplanation":["Bovensmilde 是地名，常见于地图、新闻或旅游语境；在英文中一般保持荷兰语拼写不变。","词源上可拆为 boven-（意为“上方/上部”）+ Smilde（历史地名/区域名），整体可理解为“上斯米尔德（相对下游或下部的 Smilde）”。","它在历史新闻中偶尔出现：1977 年发生过与摩鹿加（Moluccan）激进分子相关的“Bovensmilde 学校人质事件（Bovensmilde hostage crisis）”，因此在历史或社会研究语境里可能被提及。"]}
{"word":"Bovet","summary":{"en":"Bovet is usually a surname; it can also refer to the remote Norwegian territory “Bovet/Bouvet Island.”","zh":"Bovet通常是姓氏；也可指挪威属地的偏远无人岛“布韦岛”（Bovet/Bouvet Island）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname), used for people named Bovet.","zh":"（姓氏）博韦（Bovet），用于人名的姓。"},"examples":[{"en":"Dr. Bovet will speak at the conference tomorrow.","zh":"博韦博士将于明天在会议上发言。"},{"en":"I’m reading a paper by Bovet on decision-making.","zh":"我正在读一篇博韦写的关于决策的论文。"}]},{"partOfSpeech":"other","definition":{"en":"in geography, “Bovet Island”: a remote, uninhabited Norwegian island in the South Atlantic Ocean.","zh":"（地理）布韦岛（Bovet Island）：位于南大西洋的挪威属偏远无人岛。"},"examples":[{"en":"Bovet Island is known for its harsh weather and isolation.","zh":"布韦岛以恶劣天气和与世隔绝而闻名。"},{"en":"Few people ever visit Bovet Island.","zh":"几乎没人会去布韦岛。"}]}],"synonyms":["Bouvet (Island)"],"phonetic":"/boʊˈvɛt/","extraExplanation":["“Bovet”常见于法语背景的姓氏（也可见于瑞士等地区），英语里通常当作专有名词使用。","“Bovet Island”在英语里更常写作“Bouvet Island”（布韦岛），两者指同一地点；媒体或资料中偶尔会出现拼写差异。"]}
{"word":"Bovey","summary":{"en":"Bovey is mainly used as a surname or as a place name in Devon, England.","zh":"Bovey 主要用作姓氏，或英国英格兰德文郡的一些地名/地理名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a surname (family name), originally from English place names connected with the River Bovey in Devon, England","zh":"一个姓氏（家族名），源自英国英格兰德文郡与“博维河（River Bovey）”相关的地名"},"examples":[{"en":"Ms. Bovey will lead the meeting today.","zh":"Bovey 女士今天将主持会议。"},{"en":"I read an article by Daniel Bovey.","zh":"我读了一篇 Daniel Bovey 写的文章。"}]},{"partOfSpeech":"other","definition":{"en":"a geographic name used for places and features in England, especially in Devon (e.g., River Bovey; Bovey Tracey)","zh":"一个地名用法，指英国（尤其是德文郡）的一些地点或地理要素（如：博维河 River Bovey；博维特雷西 Bovey Tracey）"},"examples":[{"en":"They walked along the River Bovey in Devon.","zh":"他们在德文郡沿着博维河散步。"},{"en":"We stopped in Bovey Tracey on the way to the national park.","zh":"去国家公园的路上，我们在博维特雷西停了一下。"}]}],"synonyms":["(no direct synonyms; proper name)"],"phonetic":"/ˈboʊvi/","extraExplanation":["“Bovey”在现代英语里通常作为专有名词出现（姓氏或地名），不太会当作普通词汇使用。","发音上常见读法为两音节“BOH-vee”。如果它是人名，具体读法有时也会随家族或地区习惯略有差异。","与它相关的德文郡（Devon）地名中，Bovey Tracey 是达特穆尔国家公园（Dartmoor）附近的小镇；River Bovey 则是一条当地河流。"]}
{"word":"bovey","summary":{"en":"“Bovey” is usually a surname or an English place-name element (Devon); less commonly it refers to historical “Bovey coal.”","zh":"“Bovey”通常是姓氏或英国（德文郡）地名成分；较少情况下指历史上的“Bovey 褐煤”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), used for people (e.g., Mr./Ms. Bovey).","zh":"姓氏（人名），用于称呼或指某个家族的人（如 Bovey 先生/女士）。"},"examples":[{"en":"Ms. Bovey will lead the meeting tomorrow.","zh":"Bovey 女士明天将主持会议。"},{"en":"I found an article written by Dr. Bovey.","zh":"我找到一篇由 Bovey 博士写的文章。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name in England, used in names like the River Bovey or the town Bovey Tracey (Devon).","zh":"英国的地名成分，常见于如 Bovey 河（River Bovey）或 Bovey Tracey 镇（德文郡）等名称中。"},"examples":[{"en":"We walked along the River Bovey in Devon.","zh":"我们沿着德文郡的 Bovey 河散步。"},{"en":"They stayed near Bovey Tracey during their trip.","zh":"他们旅行时住在 Bovey Tracey 附近。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical, less common) a type of brown coal (lignite) once found near Bovey Tracey, sometimes called “Bovey coal.”","zh":"（历史用法，较少见）一种褐煤（lignite），过去在 Bovey Tracey 附近出产，有时称为 “Bovey coal”（Bovey 褐煤）。"},"examples":[{"en":"The report mentions Bovey coal used as a local fuel in the past.","zh":"报告提到过去 Bovey 褐煤曾作为当地燃料使用。"}]}],"phonetic":"/ˈboʊvi/","extraExplanation":["“Bovey”在日常英语中最常见的身份是姓氏或英国西南部（德文郡 Devon）相关的地名成分。遇到它时，优先判断语境：是否在“Mr./Ms.”后面（多半是人名），或是否出现在“River/Town/Tracey”等地理词旁（多半是地名）。","在文学或新闻中，像“River Bovey”“Bovey Tracey”这种专有名词通常不翻译其音，只在中文里用音译（如“博维河/博维特雷西”）或直接保留英文。"]}
{"word":"Bovgazk","summary":{"en":"“Bovgazk” doesn’t appear to be a standard English word; it likely needs context or correction.","zh":"“Bovgazk”不像标准英语词汇；很可能需要语境或更正拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a recognized English word. It may be a misspelling, a name, a username, or a term from another language. If you share the sentence or where you saw it, I can help identify the intended word.","zh":"不是常见或标准的英语单词。它可能是拼写错误、人名/用户名，或来自其他语言的词。如果你提供出现它的句子或来源，我可以帮你判断原本想表达的词。"},"examples":[{"en":"I couldn’t find “Bovgazk” in an English dictionary—could it be a typo?","zh":"我在英语词典里找不到“Bovgazk”——它会不会是拼写错误？"},{"en":"Can you paste the sentence where you saw “Bovgazk”?","zh":"你能把看到“Bovgazk”的那句话贴出来吗？"}]}],"extraExplanation":["它看起来像随机字母组合，常见情况包括：①拼写打错（少/多了字母）；②专有名词（人名、地名、品牌、游戏ID）；③其他语言的转写。","你可以做个快速排查：\n- 检查大小写与是否漏了元音字母（a/e/i/o/u）。\n- 回想它是否来自某个游戏/软件/社群（那往往是ID或梗）。\n- 把它前后各一两句发给我，我可以根据语境猜测最可能的目标词，并解释含义与用法。"]}
{"word":"bovicide","summary":{"en":"Bovicide is a rare word meaning the killing of cattle, or (less commonly) something that kills cattle.","zh":"bovicide 是较少见的词，指“杀牛/致死牛只的行为”，较少也可指“致死牛只的药剂或物质”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the killing of cattle; an act or practice of killing cows or other bovines","zh":"杀牛（牛科动物）的行为；宰杀或致死牛只的做法"},"examples":[{"en":"The investigator looked into whether the herd’s deaths were accidental or a case of bovicide.","zh":"调查人员在查明牛群死亡是意外还是一起杀牛事件。"},{"en":"Some reports used the word “bovicide” to describe deliberate poisoning of cattle.","zh":"一些报告用“bovicide”来描述蓄意毒杀牛只的行为。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a substance or agent that kills cattle","zh":"（罕见）能杀死牛只的物质或药剂"},"examples":[{"en":"The lab tested the feed for any possible bovicide.","zh":"实验室检测饲料中是否含有可能致死牛只的物质。"}]}],"synonyms":["cattle killing","slaughter (of cattle)","poisoning (of cattle)"],"phonetic":"/ˈboʊvɪˌsaɪd/","extraExplanation":["这个词很少见，更多见于法医/动物检疫/新闻报道等语境。","构词：bovi-（与牛有关，源自拉丁语 bos/bovis “牛”）+ -cide（“杀、致死”，如 pesticide 杀虫剂、homicide 杀人）。"]}
{"word":"boviculture","summary":{"en":"Boviculture means cattle farming or cattle husbandry.","zh":"boviculture 指“养牛业/牛只畜牧（牛的饲养与管理）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the practice or industry of raising and managing cattle (bovine animals), especially for milk, meat, or breeding; cattle husbandry","zh":"牛的饲养与管理（牛类畜牧业），尤指为获取牛奶、牛肉或进行繁育的养牛业"},"examples":[{"en":"Boviculture is a key part of rural economies in many dairy-producing regions.","zh":"在许多乳制品产区，养牛业是农村经济的重要组成部分。"},{"en":"The workshop introduced basic boviculture skills such as feeding, housing, and disease prevention.","zh":"该培训介绍了养牛的基础技能，如饲喂、圈舍管理和疾病预防。"},{"en":"Improving boviculture often involves better pasture management and veterinary care.","zh":"提升养牛水平往往需要更好的牧场管理和兽医护理。"}]}],"synonyms":["cattle farming","cattle raising","cattle husbandry","bovine husbandry","dairy farming (for milk cows)"],"phonetic":"/ˈboʊvɪˌkʌltʃər/","extraExplanation":["“boviculture”较少见，更常用的表达是“cattle farming / cattle raising / cattle husbandry”（养牛/牛只畜牧）。","词源构成：bovi- 来自拉丁语 *bos*（牛），-culture 来自“cultivate”（培育/耕作/养殖）。因此字面意思就是“牛的养殖”。","语域提示：在学术或农业技术语境中可能见到该词；日常英语里用更常见的搭配会更自然。"]}
{"word":"bovid","summary":{"en":"A bovid is any animal in the cattle family (Bovidae), including cows, sheep, goats, and antelopes.","zh":"bovid 指牛科动物（牛科 Bovidae）中的任何一种动物，包括牛、羊、山羊和羚羊等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mammal in the cattle family (Bovidae), such as a cow, buffalo, bison, sheep, goat, or antelope","zh":"牛科（Bovidae）的哺乳动物，例如牛、水牛、野牛、绵羊、山羊或羚羊"},"examples":[{"en":"Cows and goats are common bovids raised on farms.","zh":"牛和山羊是农场里常见的牛科动物。"},{"en":"Antelopes are wild bovids adapted to life on open grasslands.","zh":"羚羊是适应开阔草原生活的野生牛科动物。"}]}],"synonyms":["bovine (broader/related term)","Bovidae (scientific family name)"],"phonetic":"/ˈboʊ.vɪd/","extraExplanation":["“bovid”常用于生物学、动物学和自然纪录片中，比“cow / cattle”更学术、更广义；它不是指“牛”这一种，而是指“牛科动物”这一大类。","词源来自拉丁语系的“bos / bov-”（牛），同根词还有：bovine（牛的/似牛的）、beef（牛肉，法语来源但同语义领域）。"]}
{"word":"Bovidae","summary":{"en":"Bovidae is the animal family that includes cattle, sheep, goats, antelope, and similar hoofed mammals.","zh":"Bovidae 指“牛科”，包括牛、羊、山羊、羚羊等相近的有蹄哺乳动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of hoofed mammals that includes cattle, sheep, goats, buffalo, antelope, and related animals (most have hollow, unbranched horns).","zh":"牛科（偶蹄类哺乳动物的一科），包括牛、羊、山羊、水牛、羚羊等（多具有中空、不分叉的角）。"},"examples":[{"en":"Cows and goats both belong to the family Bovidae.","zh":"牛和山羊都属于牛科（Bovidae）。"},{"en":"Many Bovidae species live in grasslands and are important grazers.","zh":"许多牛科动物生活在草原上，是重要的食草动物。"}]}],"synonyms":["the bovid family","bovids"],"phonetic":"/ˈbɑːvədiː/","extraExplanation":["“Bovidae”是生物分类学（拉丁化的科学命名）用语：-idae 表示“科”，因此它指“牛科”，不是单个动物。","读音上常见误区：词尾 -dae 常读作 /diː/（类似“dee”），所以整体读起来更顺口。"]}
{"word":"bovidae","summary":{"en":"Bovidae is the animal family that includes cattle, sheep, goats, and antelopes.","zh":"Bovidae 指“牛科”，包括牛、羊、山羊、羚羊等动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a biological family of hoofed, usually grass-eating mammals that includes cattle, sheep, goats, antelopes, and related animals","zh":"牛科（生物分类）：一类有蹄、通常以草为食的哺乳动物家族，包括牛、羊、山羊、羚羊等及其近缘动物"},"examples":[{"en":"Cows, goats, and sheep all belong to the family Bovidae.","zh":"牛、山羊和绵羊都属于牛科（Bovidae）。"},{"en":"Many African antelopes are bovids, so they are part of Bovidae.","zh":"许多非洲羚羊都是牛科动物，因此属于 Bovidae。"}]}],"synonyms":["bovids (informal/common term)"],"phonetic":"/ˈbɑːvədiː/","extraExplanation":["Bovidae 是拉丁化的科学名称，常用于动物学、生态学和科普文章中；日常英语里更常说 bovid（牛科动物）来指“某一只/某一类牛科动物”。","在生物分类中，Bovidae 属于“科”（family）。在阅读英文科普时，family 往往对应中文的“科”，genus 对应“属”，species 对应“种”。"]}
{"word":"bovids","summary":{"en":"Bovids are animals in the cattle-and-antelope family (Bovidae), such as cows, sheep, and goats.","zh":"bovids 指牛科（Bovidae）动物，如牛、羊、山羊和许多羚羊。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Members of the family Bovidae: hoofed mammals such as cattle, goats, sheep, and many antelopes.","zh":"牛科动物：指偶蹄、有角的一类哺乳动物，包括牛、羊、山羊以及许多羚羊等。"},"examples":[{"en":"Cattle, sheep, and goats are all bovids.","zh":"牛、羊和山羊都属于牛科动物。"},{"en":"Many African antelopes are bovids adapted to open grasslands.","zh":"许多非洲羚羊属于牛科动物，适应了开阔的草原环境。"}]}],"synonyms":["Bovidae (technical family name)"],"phonetic":"/ˈboʊvɪdz/","extraExplanation":["“bovids”是复数形式，单数是“bovid”。它来自拉丁语词根 *bos*（牛），常见于生物学、动物学或自然纪录片中。","牛科（Bovidae）通常具有不分叉的永久性角（不像鹿科每年脱落再长的角），这是区分它们的一个重要特征。"]}
{"word":"boviform","summary":{"en":"Boviform means cow-like in shape or related to cattle.","zh":"boviform 指“像牛的（形状）”或“与牛有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling or related to cattle (a cow or ox); cow-shaped.","zh":"像牛的；与牛有关的；牛形的。"},"examples":[{"en":"The artist made a boviform sculpture with wide horns and a heavy body.","zh":"艺术家做了一座牛形雕塑，有宽大的角和厚重的身体。"},{"en":"Some bacteria have a boviform (cow-like) shape under the microscope.","zh":"在显微镜下，有些细菌呈牛状（类似牛的形状）。"}]}],"synonyms":["cow-shaped","cowlike","bovine"],"phonetic":"/ˈboʊvɪfɔːrm/","extraExplanation":["词源提示：bovi- 来自拉丁语 *bos / bovis*（牛），-form 表示“形状”。所以 boviform 字面意思就是“牛的形状”。","使用场景：这个词较少见，更多出现在艺术描述、比较生物形态（例如显微镜下形状）或较正式的写作中。日常英语里通常会用更简单的表达，如 *cow-shaped* 或 *cow-like*。"]}
{"word":"Bovill","summary":{"en":"“Bovill” is most commonly a surname (and sometimes a place name).","zh":"“Bovill”最常见是姓氏（有时也可作地名）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A surname (family name), used for people; it may also appear as a place name in some regions.","zh":"一个姓氏（家族姓）；在某些地区也可作为地名出现。"},"examples":[{"en":"Dr. Bovill will present the research at the conference.","zh":"Bovill 博士将在会议上介绍这项研究。"},{"en":"I met someone named Bovill in my English class.","zh":"我在英语课上认识了一个姓 Bovill 的人。"}]}],"synonyms":["(no direct synonyms; proper name)"],"phonetic":"/ˈboʊvɪl/","extraExplanation":["“Bovill”主要见于英语世界的人名（姓氏）。在英文里，姓氏通常首字母大写，用于正式称呼（如 Mr./Ms./Dr. Bovill）。","作为地名时，它的用法与其他专有名词一致：首字母大写，常与介词连用（如 in/near Bovill）。如果你提供上下文（一本书、地图或句子），我可以更精确判断它指的是人名还是地名。"]}
{"word":"Bovina","summary":{"en":"“Bovina” is most commonly a place name in New York; as an adjective, it’s a rare form meaning “bovine,” but English usually uses “bovine.”","zh":"“Bovina”最常见是纽约州的地名；作形容词时很少见，意思接近“bovine（牛的）”，但英语通常用“bovine”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a small town in Delaware County, New York, USA (a proper place name).","zh":"（专有名词）美国纽约州特拉华县的一个小镇名：Bovina（博维纳/博维娜）。"},"examples":[{"en":"She grew up in Bovina, New York, before moving to the city.","zh":"她在纽约州的Bovina长大，后来搬去了城市。"},{"en":"We drove through Bovina on our way to the Catskills.","zh":"我们去卡茨基尔山的路上开车经过了Bovina。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) relating to cattle; the same idea as “bovine.”","zh":"（罕见用法）与牛有关的；相当于“bovine（牛的）”。"},"examples":[{"en":"The writer used bovina imagery to emphasize the rural, farm setting.","zh":"作者用“牛的意象”来强调乡村农场的氛围。"},{"en":"In English, you’ll almost always see “bovine,” not “bovina.”","zh":"在英语里你几乎总会看到“bovine”，而不是“bovina”。"}]}],"synonyms":["(adj.) bovine","(adj.) cattle-related","(adj.) of cattle"],"phonetic":"/boʊˈvaɪnə/","extraExplanation":["“Bovina”在英语里最常见是地名（纽约州小镇）。如果你想表达“牛的/与牛有关的”，标准、常用的英文词是 **bovine**（形容词）。","地名Bovina源自拉丁语 *bovinus*（“牛的”），与英语里的 *bovine* 同源，因此容易让学习者误以为“bovina”是常见英语形容词。"]}
{"word":"bovine","summary":{"en":"Bovine means “related to cattle” (formal/scientific). Informally, it can describe someone as dull or expressionless; as a noun, it can mean a cow/cattle animal (less common).","zh":"bovine 表示“牛的、与牛有关的”（正式/科学用语）。非正式时可形容人“迟钝或神情木然”；作名词可指牛/牛科动物（较少用）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to cows (cattle), especially in a scientific or formal way.","zh":"（较正式/科学用语）牛的；与牛（牛科家畜）有关的。"},"examples":[{"en":"Bovine diseases can spread quickly in crowded farms.","zh":"在拥挤的农场里，牛类疾病可能传播得很快。"},{"en":"The vet specializes in bovine medicine.","zh":"那位兽医专攻牛科医疗。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal) Slow, dull, or not showing much emotion, like a cow’s calm stare.","zh":"（非正式）迟缓的；呆滞的；神情木然的（类似牛那种平静但缺少表情的注视）。"},"examples":[{"en":"He gave me a bovine look and didn’t respond.","zh":"他木然地看了我一眼，没有回应。"},{"en":"She sat there with a bovine calm, ignoring the noise.","zh":"她一脸木然的平静坐在那里，无视周围的吵闹。"}]},{"partOfSpeech":"n.","definition":{"en":"A cow or other animal of the cattle family (less common; more often we say “cattle” or “cow”).","zh":"牛；牛科动物（较少用；更常说 cattle 或 cow）。"},"examples":[{"en":"The farmer keeps several bovines in the pasture.","zh":"农民在牧场里养了几头牛。"}]}],"synonyms":["cattle-related","cow-like","bovinian","dull","stolid"],"phonetic":"/ˈboʊvaɪn/","extraExplanation":["“bovine”来自拉丁语 bovinus（牛的），常见于较正式的语境，如：bovine tuberculosis（牛结核）、bovine serum（牛血清）。","形容人“bovine”通常带有轻微贬义，强调“迟钝、呆呆的神情”，用在描述外貌或反应时要注意礼貌与场合。"]}
{"word":"bovinelike","summary":{"en":"Bovine-like means cow-like, literally or (often) figuratively describing a dull or blank expression.","zh":"bovine-like 意为“像牛的”，可指外貌/特征，也常用作比喻，形容表情呆滞或反应迟缓。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a cow (bovine) in appearance or characteristics.","zh":"像牛的；具有牛类特征的（外貌或特性）。"},"examples":[{"en":"The statue has a bovine-like head with wide, calm eyes.","zh":"那座雕像有一个牛似的头，眼睛又大又平静。"},{"en":"They designed a bovine-like creature for the fantasy film.","zh":"他们为那部奇幻电影设计了一种牛似的生物。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Often figurative) Showing a dull, slow, or blank expression, like the stereotype of a cow’s calm stare.","zh":"（常为比喻）表情迟钝、呆滞或反应慢，像人们刻板印象里牛那样“木然”的凝视。"},"examples":[{"en":"He gave a bovine-like look and didn’t respond to the joke.","zh":"他露出一副呆滞的表情，对那个玩笑毫无反应。"},{"en":"The critic described the character’s bovine-like calm as unsettling.","zh":"评论家形容这个角色牛般的平静令人不安。"}]}],"synonyms":["cow-like","oxlike","cattle-like","vacant-looking","stolid"],"phonetic":"/ˈboʊvaɪn laɪk/","extraExplanation":["“bovine-like”由“bovine（牛的）+ like（像……的）”构成，常见写法也可加连字符：bovine-like。","用来形容人时，第二义可能带有贬义色彩（暗示“迟钝/木然”）。描述外貌或动物设定时通常较中性。"]}
{"word":"bovinely","summary":{"en":"Bovinely means “in a cow-like way,” often suggesting calm slowness or, more critically, dullness.","zh":"bovinely 意为“像牛一样地”，可指平静缓慢，也常带贬义指呆滞迟钝。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a cow-like way; with the calm, slow, or placid manner associated with cattle.","zh":"像牛一样地；带有牛常见的平静、迟缓或温顺的样子。"},"examples":[{"en":"He listened bovinely, blinking slowly as if nothing could hurry him.","zh":"他像牛一样慢吞吞地听着，缓慢地眨眼，仿佛什么都催不动他。"},{"en":"The tourist stared bovinely at the map, unsure which street to take.","zh":"游客像牛一样呆呆地盯着地图，不知道该走哪条街。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Often critical) In a dull, expressionless, or unthinking way.","zh":"（常含贬义）呆滞地、木然地、缺乏思考地。"},"examples":[{"en":"The student answered bovinely, repeating the memorized line without understanding.","zh":"那位学生木然地回答，只是重复背过的句子，并不理解。"},{"en":"She smiled bovinely at the joke, even though it wasn’t funny.","zh":"她对那个笑话露出呆呆的笑容，尽管一点也不好笑。"}]}],"synonyms":["blankly","dully","placidly","slowly","stolidly"],"phonetic":"/boʊˈvaɪnli/","extraExplanation":["“bovinely”来自形容词“bovine”（牛的、似牛的）。它既可以是中性描写（慢、安静、温顺），也常用于讽刺某人“呆、迟钝、没反应”。在写作中比较文学化，不算日常口语。更口语的表达有：blankly（茫然地）、dully（迟钝地）、slowly（慢慢地）。"]}
{"word":"bovines","summary":{"en":"“Bovines” usually means cattle (cows and related animals) and is also the plural of the adjective “bovine.”","zh":"“bovines”通常指“牛（牛群/牛科动物）”，也可以是形容词“bovine（牛的）”的复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Cows, bulls, and related animals (cattle), especially when talking generally or scientifically.","zh":"牛科动物；泛指牛（包括奶牛、公牛等家牛及其近亲），常用于较正式或科学的语境。"},"examples":[{"en":"The farm keeps bovines for milk and beef.","zh":"这家农场养牛，用来产奶和提供牛肉。"},{"en":"Veterinarians tested the bovines for disease.","zh":"兽医给这些牛做了疾病检测。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to cows or cattle; having characteristics of cattle.","zh":"与牛有关的；像牛的（常为较正式用法）。"},"examples":[{"en":"Bovine milk is commonly used to make cheese.","zh":"牛奶常被用来做奶酪。"},{"en":"She gave a bovine stare, calm and unhurried.","zh":"她露出一种“牛一般”的凝视，平静而不慌不忙。"}]}],"synonyms":["cattle","cows (informal/general)","bovine animals"],"phonetic":"/ˈboʊvaɪnz/","extraExplanation":["“bovine”源自拉丁语 bovinus（与牛有关的）。日常英语里更常说“cows / cattle”。“bovine”多见于科学、医学、新闻（如 bovine tuberculosis 牛结核）或较文学化的描写（如 bovine stare 指一种迟缓、呆呆的神情）。","用法提示：当你说“bovines”作名词复数时，通常等于“cattle”。如果特指“牛肉牛/奶牛”等类别，英语里也会更常用“beef cattle / dairy cattle”。"]}
{"word":"bovinian","summary":{"en":"Bovinian is a rare word meaning “related to cattle” or “cow-like,” and it can also mean a cow-like person/creature.","zh":"bovinian 是个较罕见的词，意思是“与牛有关的/像牛的”，也可指“像牛的人或生物”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Related to cattle (bovine animals), or having the qualities of a cow or ox.","zh":"（罕用）与牛（牛科家畜）有关的；像牛的；具有牛的特征（如迟缓、温顺等）。"},"examples":[{"en":"The writer mocked the politician’s bovinian calm during the debate.","zh":"作家嘲讽那位政治人物在辩论中“牛一般”的镇定。"},{"en":"A bovinian figure stood in the pasture, barely moving in the heat.","zh":"牧场里有个像牛一样的身影，在酷热中几乎一动不动。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) A cow-like person or creature; someone compared to cattle.","zh":"（罕用）像牛的人（或生物）；被比作牛的人。"},"examples":[{"en":"In the satire, the city is full of bovinians who follow the herd.","zh":"在这部讽刺作品里，城市充满了随大流的“牛群式人物”。"}]}],"synonyms":["bovine","cattle-like","ox-like"],"phonetic":"/boʊˈvɪniən/","extraExplanation":["“bovinian”来源于拉丁语 bovinus（意为“牛的”）。在现代英语里更常见、更自然的词是 “bovine”。“bovinian”多见于文学、讽刺或刻意用词的语境，用来营造书面、戏谑或贬义的效果。"]}
{"word":"bovinities","summary":{"en":"Bovinities means “cow-like qualities,” often humorously implying dullness or sluggishness; it can also mean foolish actions or remarks.","zh":"bovinities 指“像牛一样的特质”，常带幽默或讽刺，暗示迟钝或慢吞吞；也可指愚蠢的言行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) qualities or behaviors that are like a cow or cattle; sometimes used humorously to suggest dullness or slow, placid behavior.","zh":"（复数）像牛（或牛群）的特质或行为；有时带幽默或贬义，暗示迟钝、慢吞吞或温吞的样子。"},"examples":[{"en":"The comedian exaggerated the character’s bovinities—slow steps, blank stares, and a calm chew.","zh":"喜剧演员夸张了这个角色的“牛性”——慢吞吞的步伐、茫然的眼神和淡定地咀嚼。"},{"en":"The novel pokes fun at the townspeople’s bovinities when they refuse to change their habits.","zh":"小说在镇民拒绝改变习惯时，讽刺他们的“牛性”（迟钝保守）。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural, informal) stupid or clumsy ideas or actions; foolishness.","zh":"（复数，非正式）愚蠢或笨拙的想法/行为；蠢事。"},"examples":[{"en":"He apologized for the bovinities he’d said during the argument.","zh":"他为争吵中说出的蠢话道了歉。"},{"en":"Let’s not repeat yesterday’s bovinities—check the details before we send it.","zh":"我们别重蹈昨天的蠢事——发出去前先核对细节。"}]}],"synonyms":["cow-like qualities","stolidity","dullness","sluggishness","foolishness","clumsiness"],"phonetic":"/boʊˈvɪnətiz/","extraExplanation":["“bovinities”来自“bovinity”（牛性、牛一般的特质），而“bovinity”又来自“bovine”（牛的）。这个词在日常英语里比较少见，更多见于幽默、讽刺或较文艺的写法。","语气上可能带轻微贬义：形容人时常暗示“迟钝、呆、慢、没反应”，使用时注意场合，避免冒犯。"]}
{"word":"bovinity","summary":{"en":"Bovinity means the qualities of a cow/cattle, often suggesting calm heaviness or (sometimes) dullness.","zh":"Bovinity 指“牛的特性/牛性”，常暗示沉静、笨重；在某些语境也可讽刺迟钝。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or qualities of a cow or cattle; cow-like nature.","zh":"牛的特性；牛一样的气质或性质。"},"examples":[{"en":"There was a calm bovinity in her expression, like a cow resting in the shade.","zh":"她的表情里有一种平静的“牛性”，像牛在树荫下休息一样。"},{"en":"The writer uses bovinity to suggest slow, gentle steadiness.","zh":"作者用 bovinity 来暗示缓慢、温和而稳定的感觉。"}]},{"partOfSpeech":"n.","definition":{"en":"(Humorous or critical) A dull, heavy, or unimaginative manner, compared to a cow.","zh":"（带幽默或批评）像牛一样迟钝、笨重或缺乏想象力的样子。"},"examples":[{"en":"He answered with a kind of bovinity, missing the joke completely.","zh":"他带着一种“牛般的迟钝”回答，完全没听懂笑点。"},{"en":"Don’t confuse quietness with bovinity—she’s thoughtful, not slow.","zh":"别把安静当成“牛性”——她是在思考，不是迟钝。"}]}],"synonyms":["bovine nature","cattleness","stolidity (context-dependent)"],"phonetic":"/boʊˈvɪnɪti/","extraExplanation":["“bovinity”来自拉丁语 bov-（牛）这一词根，相关词还有 bovine（adj./n. 牛的；牛科动物）。在文学描写中，它常用来营造一种“温顺、迟缓、沉稳”的意象；但在讽刺语境里也可能带贬义。","用法提示：更常见的词是形容词 bovine（如 a bovine stare “牛般的凝视”）。bovinity 比较少见，带一点书面或文学色彩。"]}
{"word":"Bovista","summary":{"en":"Bovista is a genus of puffball fungi that release spores in a puff when mature.","zh":"Bovista 指马勃属，是一类成熟后会“喷出”孢子的马勃真菌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of puffball fungi (round mushrooms that release spores in a “puff” when mature).","zh":"马勃属（一类“马勃”真菌；成熟时受触动会像“喷烟”一样释放孢子）。"},"examples":[{"en":"We found a Bovista puffball in the grass after the rain.","zh":"雨后我们在草地里发现了一颗马勃属的马勃。"},{"en":"When the Bovista was tapped, it released a small cloud of spores.","zh":"轻轻一拍那颗马勃属马勃，就喷出一小团孢子。"}]}],"synonyms":["puffball","puffball fungus"],"phonetic":"/boʊˈvɪstə/","extraExplanation":["“Bovista”是拉丁化的学名，常见于自然观察、真菌图鉴和生物分类学中；日常英语里更常说“puffball”。","有些马勃在幼嫩、内部仍为白色时在某些地区被视为可食，但也存在与有毒蘑菇幼体混淆的风险；不要仅凭外观自行食用。"]}
{"word":"bovista","summary":{"en":"Bovista is a puffball mushroom, especially one from the genus *Bovista*.","zh":"bovista 指一种马勃（会喷孢子的圆球状真菌），尤指马勃属（*Bovista*）的马勃。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of puffball mushroom (a round fungus that releases spores in a “puff” when pressed), especially one in the genus *Bovista*","zh":"一种马勃（受压会“噗”地喷出孢子的圆球状真菌），尤指马勃属（*Bovista*）的种类"},"examples":[{"en":"We found a bovista in the grass; when we touched it, a little cloud of spores came out.","zh":"我们在草地里发现了一个马勃；轻轻一碰，就喷出一小团孢子云。"},{"en":"Some bovista species grow in lawns and open fields after rain.","zh":"有些马勃属的种类会在雨后出现在草坪或开阔地。"}]}],"synonyms":["puffball","puffball mushroom"],"phonetic":"/boʊˈvɪstə/","extraExplanation":["“Bovista”既可指“马勃属”这一类群名（拉丁学名，常见于科普或分类学语境），也可在较宽泛的语境中用来指某种马勃（puffball）。","词源上与拉丁语中表示“牛”的词根有关，传统上可能与其外形或体积联想有关；日常英语里更常用的普通词是“puffball”。"]}
{"word":"bovld","summary":{"en":"“Bold” most commonly means brave and confident; it can also mean strong/noticeable in style or flavor, and it can refer to bold type in printing.","zh":"“bold”常指“大胆、勇敢自信”；也可指“醒目、浓烈”；在排版中还可指“粗体字”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Showing courage and confidence; not afraid to take risks or speak directly.","zh":"大胆的；勇敢自信的；敢于冒险或直言的。"},"examples":[{"en":"She made a bold decision to change careers.","zh":"她大胆决定转行。"},{"en":"It was bold of him to disagree with the boss in the meeting.","zh":"他在会议上当面反对老板很大胆。"}]},{"partOfSpeech":"adj.","definition":{"en":"Dark and easy to notice; strong in color, taste, or style.","zh":"醒目的；浓烈的（颜色、味道或风格很强）。"},"examples":[{"en":"He wore a bold red jacket.","zh":"他穿了一件很醒目的红色夹克。"},{"en":"This coffee has a bold flavor.","zh":"这款咖啡味道很浓烈。"}]},{"partOfSpeech":"n.","definition":{"en":"A bold style of printing (boldface) used to make words stand out.","zh":"（排版）粗体字（用于强调、让文字更显眼）。"},"examples":[{"en":"Please put the title in bold.","zh":"请把标题加粗。"},{"en":"Important words are often shown in bold type.","zh":"重要词语常常用粗体显示。"}]}],"synonyms":["brave","courageous","daring","confident","audacious"],"phonetic":"/boʊld/","extraExplanation":["你输入的“bovld”看起来像是拼写错误；英语里常见的单词是“bold”。如果你本来想查的是别的词（比如 bovid/boulevard 等），也可以告诉我上下文，我可以帮你确认。"]}
{"word":"bovoid","summary":{"en":"Bovoid means an animal in the Bovidae family (a bovid), or something related to that family.","zh":"bovoid 指牛科动物（牛科成员），或指与牛科有关的。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"any animal in the family Bovidae (such as cattle, goats, sheep, or many antelopes); a bovid","zh":"牛科动物（如牛、山羊、绵羊以及许多羚羊等）；牛科成员"},"examples":[{"en":"Goats and sheep are bovoid animals.","zh":"山羊和绵羊都是牛科动物。"},{"en":"The museum display compared the horns of several bovoid species.","zh":"博物馆展览比较了几种牛科动物的角。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or characteristic of the Bovidae family","zh":"与牛科有关的；具有牛科特征的"},"examples":[{"en":"Researchers recorded bovoid behavior around the watering hole.","zh":"研究人员记录了水坑附近牛科动物的行为。"},{"en":"The guide pointed out bovoid tracks along the trail.","zh":"向导指出了小路上的牛科动物足迹。"}]}],"synonyms":["bovid","bovine (more general/less exact)"],"phonetic":"/ˈboʊvɔɪd/","extraExplanation":["“bovoid”多见于动物学、生态学、博物馆解说等较正式语境。日常英语里更常用的是“bovid”（名词：牛科动物）或更具体的“cow/goat/sheep/antelope”等。","注意区分：bovine 通常更偏向“牛的/与牛有关的”（多指家牛或牛属），而 bovoid/bovid 涵盖整个牛科（Bovidae），范围更广。"]}
{"word":"bovovaccination","summary":{"en":"“Bovovaccination” is a rare term meaning vaccination of cattle; in normal English, people usually say “bovine vaccination” or “cattle vaccination.”","zh":"“bovovaccination”较少见，意为“牛的疫苗接种”；更常用的说法是“bovine vaccination”或“cattle vaccination”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/nonstandard) Vaccination of cattle (bovines); the act of giving vaccines to cows or other cattle, or a vaccination program for cattle.","zh":"（罕见/非标准用法）牛（牛科动物）的疫苗接种；给牛注射疫苗的行为，或牛群的免疫接种计划。"},"examples":[{"en":"The farm started a bovovaccination program to prevent foot-and-mouth disease.","zh":"农场启动了牛群疫苗接种计划，以预防口蹄疫。"},{"en":"Good records help you track each calf’s bovovaccination schedule.","zh":"良好的记录能帮助你追踪每头小牛的免疫接种时间表。"}]}],"synonyms":["bovine vaccination","cattle vaccination","vaccination of cattle","vaccinating cattle","livestock vaccination"],"phonetic":"/ˌboʊvoʊˌvæksəˈneɪʃən/","extraExplanation":["“bovovaccination”并不是常见英语词汇，更多时候会写成 **bovine vaccination**（牛的疫苗接种）或 **cattle vaccination**（牛群免疫）。如果这是来自某篇论文、表格或品牌/项目名，也可能是作者自造词或拼写变体。","词形上可理解为 **bovo-**（与牛有关，源自拉丁语 *bos/bovis*）+ **vaccination**（疫苗接种）。在兽医学语境中更自然的表达还包括 **vaccination of cattle** / **vaccinating cattle**。"]}
{"word":"bovovaccine","summary":{"en":"“Bovovaccine” means a vaccine for cattle (bovines).","zh":"“bovovaccine”指用于牛等牛科动物的疫苗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a vaccine intended for cattle (bovines), used to prevent specific diseases in cows or other bovine animals","zh":"牛用疫苗（用于牛等牛科动物的疫苗），用于预防特定疾病"},"examples":[{"en":"The farm ordered a bovovaccine to protect the herd from respiratory disease.","zh":"农场订购了牛用疫苗，用来保护牛群免受呼吸道疾病影响。"},{"en":"Ask a veterinarian which bovovaccine schedule is recommended for calves.","zh":"请咨询兽医，小牛应接种哪种牛用疫苗以及推荐的接种时间表。"}]}],"synonyms":["bovine vaccine","cattle vaccine","veterinary vaccine (for cattle)"],"phonetic":"/ˌboʊvoʊˈvækˌsin/","extraExplanation":["“bovovaccine”不是日常英语里的常见词，更常见的说法是“bovine vaccine”或“cattle vaccine”。它多出现在兽医、畜牧业或产品标签/说明书等专业语境中。","词源上，“bovo-”与拉丁语 bov-（牛）相关；在英语里更常见的词根形式是“bovin-”（如 bovine）。如果你是在资料中看到该词，也可能是品牌名、行业用语或拼写变体。"]}
{"word":"Bovril","summary":{"en":"Bovril is a concentrated beef extract (brand) used as a hot drink or as a beef-flavoring in cooking.","zh":"Bovril（博福瑞尔）是一种牛肉浓缩精（品牌），可冲热饮，也常用于烹饪增鲜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand of concentrated beef extract used to make a hot, savory drink or to add beef flavor to soups, stews, and gravies; it can also be spread thinly on toast.","zh":"（博福瑞尔）一种牛肉浓缩精（品牌名），可冲成热的咸鲜饮料，也可用于给汤、炖菜、肉汁等增添牛肉风味；也可薄薄涂抹在吐司上。"},"examples":[{"en":"On a cold day, some people in the UK drink Bovril to warm up.","zh":"在寒冷的日子里，英国有些人会喝博福瑞尔来暖身。"},{"en":"Add a spoon of Bovril to the soup for a deeper beef flavor.","zh":"在汤里加一勺博福瑞尔，牛肉味会更浓。"},{"en":"He spread a little Bovril on toast instead of butter.","zh":"他用少量博福瑞尔涂在吐司上，代替黄油。"}]}],"synonyms":["beef extract","meat extract","beef bouillon concentrate"],"phonetic":"/ˈbɑːv.rəl/","extraExplanation":["Bovril在英国文化里很有辨识度：它常被当作“暖身热饮”，尤其在冬天、看球赛或户外活动时出现。","它本质上类似“牛肉风味浓缩膏/精”，用法介于“浓缩高汤（bouillon concentrate）”和“抹酱（spread）”之间；味道偏咸鲜（umami）。","词源上是品牌名，通常当作不可数名词使用：some Bovril / a spoonful of Bovril。"]}
{"word":"bovver","summary":{"en":"“Bovver” is British slang for trouble or violence, and it can also mean to cause trouble or fight.","zh":"“bovver”是英式俚语，指麻烦/暴力，也可作动词表示找麻烦或打架。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(British slang) Trouble, violence, or aggressive behavior—often linked to street fights or hooliganism.","zh":"（英式俚语）麻烦、暴力或好斗行为；常与街头打架、流氓文化相关。"},"examples":[{"en":"The police were called because there was bovver outside the pub.","zh":"因为酒吧外面发生了打架闹事，警察被叫来了。"},{"en":"He’s always looking for bovver when he’s been drinking.","zh":"他一喝酒就总爱找麻烦。"}]},{"partOfSpeech":"v.","definition":{"en":"(British slang, informal) To cause trouble or fight; to harass or attack.","zh":"（英式俚语，非正式）找麻烦；打架；骚扰或攻击。"},"examples":[{"en":"Don’t bovver people just to show off.","zh":"别为了逞能就去招惹别人。"},{"en":"He got arrested for bovvering a stranger on the train.","zh":"他因为在火车上骚扰陌生人而被逮捕了。"}]}],"synonyms":["trouble","violence","fighting","harassment","roughness"],"phonetic":"/ˈbɑvər/","extraExplanation":["“bovver”多见于英国口语/俚语，带有工人阶级或“街头”语气；在正式英语里通常用 trouble, violence, harassment 等。","常见搭配：bovver boots（厚重的工装/军靴，常被用来暗示爱打架的形象）、bovver boy（爱惹事的年轻人）。该词也因英国流行文化（如电视剧、音乐与街头亚文化）而被更多人熟知。"]}

