{"word":"box","summary":{"en":"“Box” most commonly means a container; it can also mean a square/rectangular section on a form or screen, and as a verb it means to package or to fight with fists.","zh":"“box”最常见意思是“盒子/箱子”；也可指表格或屏幕上的“方框/输入框”；作动词可表示“装箱打包”或“拳击/打拳”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a container with a flat base and sides, usually square or rectangular, often with a lid","zh":"盒子；箱子（通常为方形或长方形的容器，常带盖）"},"examples":[{"en":"She opened the box and found an old photo inside.","zh":"她打开盒子，发现里面有一张老照片。"},{"en":"Could you put these books in a box for moving?","zh":"你能把这些书装进箱子里搬家吗？"}]},{"partOfSpeech":"n.","definition":{"en":"a separate section or area on a page or screen, usually surrounded by a border","zh":"（页面/屏幕上的）方框；框内栏目"},"examples":[{"en":"Please tick the box next to your answer.","zh":"请勾选答案旁边的方框。"},{"en":"Type your name in the box below.","zh":"在下面的框里输入你的名字。"}]},{"partOfSpeech":"vt.","definition":{"en":"to put something into a box; to package","zh":"把……装箱；把……装盒；包装"},"examples":[{"en":"They boxed the gifts carefully.","zh":"他们把礼物仔细装盒。"},{"en":"Box up the leftovers and put them in the fridge.","zh":"把剩菜装盒放进冰箱。"}]},{"partOfSpeech":"vi.","definition":{"en":"to fight using fists, especially in the sport of boxing","zh":"（尤指作为拳击运动）用拳击打；打拳"},"examples":[{"en":"He boxed for years when he was younger.","zh":"他年轻时打了很多年拳击。"},{"en":"Two athletes will box in the ring tonight.","zh":"今晚两名运动员将在擂台上进行拳击比赛。"}]}],"synonyms":["case","container","carton","package","square","frame","pack","box up","fight","spar"],"phonetic":"/bɑks/","extraExplanation":["“box”在英语里很常见，除了“盒子/箱子”，也常指页面上的“方框/输入框”，所以在表格、网页、应用里会频繁出现。","动词短语“box up”常用来表示“装箱、收拾打包”，尤其是搬家或整理时。","与“boxing（拳击）”有关的用法来自“用拳头像拳击手一样打”，因此动词box = 打拳/拳击。"]}
{"word":"box office","summary":{"en":"“Box office” means either the ticket-selling place or a movie/show’s ticket-sales earnings.","zh":"“box office”既可指售票处，也可指电影/演出的票房收入或票房成绩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The place or counter where tickets are sold for a movie theater, concert, or other live event.","zh":"（影院、剧院、演唱会等的）售票处；票房窗口。"},"examples":[{"en":"You can buy tickets at the box office or online.","zh":"你可以在售票处或网上买票。"},{"en":"The box office opens one hour before the show.","zh":"售票处在演出前一小时开放。"}]},{"partOfSpeech":"n.","definition":{"en":"The total amount of money a movie or show earns from ticket sales (often used in phrases like “box office success”).","zh":"（电影/演出）票房收入；票房成绩（常用于“票房大卖”等表达）。"},"examples":[{"en":"The film did well at the box office.","zh":"这部电影票房表现很好。"},{"en":"It became a box office hit in its first weekend.","zh":"它在首个周末就成了票房大片。"},{"en":"The studio is hoping for strong box office numbers.","zh":"片方希望票房数据强劲。"}]}],"synonyms":["ticket office","ticket window","ticket sales","revenue"],"phonetic":"/ˈbɑks ˌɔfɪs/","extraExplanation":["“box office”原指剧院里售票的小窗口（像一个小盒子/小隔间），后来引申为“票房收入/票房成绩”。在新闻里常见搭配：box office hit（票房大片）、box office flop/bomb（票房惨败）、opening weekend box office（首周末票房）、domestic box office（本土票房）、worldwide/global box office（全球票房）。"]}
{"word":"box-jellyfish","summary":{"en":"A box jellyfish is a dangerous, highly venomous jellyfish with a box-shaped body.","zh":"box jellyfish 指“箱形水母”，一种身体呈盒状、毒性很强的水母。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a highly venomous type of jellyfish (class Cubozoa) with a box-shaped body; some species can cause severe injury or death","zh":"箱形水母（立方水母纲）：身体呈“盒状”的水母类群，毒性很强；部分种类可造成严重伤害甚至死亡"},"examples":[{"en":"In northern Australia, swimmers watch for box jellyfish warnings during the summer.","zh":"在澳大利亚北部，夏季游泳的人会留意箱形水母的警告。"},{"en":"A box jellyfish sting can be extremely painful and requires immediate first aid.","zh":"被箱形水母蜇到会非常疼痛，需要立刻急救。"}]}],"synonyms":["cubozoan","sea wasp"],"phonetic":"/bɑks ˈdʒɛlifɪʃ/","extraExplanation":["“box jellyfish”常见写法有两种：box jellyfish（分开）和 box-jellyfish（用连字符）。连字符多用于把它当作一个整体名词时，或出现在复合形容词结构中（如 box-jellyfish sting）。","语境提示：新闻、旅游安全提示和科普文章中常见。中文里也常称“箱水母”“立方水母”。","学习搭配：box jellyfish sting（箱形水母蜇伤）、venomous jellyfish（有毒水母）、marine envenomation（海洋毒伤/被海洋生物注毒）。"]}
{"word":"box-making","summary":{"en":"Box-making means making boxes as a skill or industry, and it can also describe tools or processes related to making boxes.","zh":"box-making 指“制盒/做盒子”的技能或行业，也可作定语表示“与制盒有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity or business of making boxes (especially cardboard or packaging boxes)","zh":"制盒；做盒子（尤指纸箱或包装盒）的活动或行业"},"examples":[{"en":"She works in box-making at a packaging factory.","zh":"她在一家包装厂从事制盒工作。"},{"en":"The workshop teaches basic box-making skills using recycled paper.","zh":"这个工作坊教授用再生纸制作盒子的基础技能。"},{"en":"Box-making is an important step in getting products ready to ship.","zh":"制盒是让产品准备好运输的重要步骤。"}]},{"partOfSpeech":"adj.","definition":{"en":"used as an adjective to describe something related to making boxes","zh":"（作定语）与制盒有关的；用于制盒的"},"examples":[{"en":"We bought a box-making machine to increase production.","zh":"我们买了一台制盒机来提高产量。"},{"en":"He learned box-making techniques from his grandfather.","zh":"他从祖父那里学到了制盒技巧。"}]}],"synonyms":["box production","carton making","packaging production"],"phonetic":"/ˈbɑksˌmeɪkɪŋ/","extraExplanation":["“box-making”常见于书面语或行业语境（如包装、印刷、物流）。口语里也可说“making boxes”。\n\n拼写上常用连字符（box-making）来强调它作为一个整体概念（行业/技能）。作定语时也常见不加连字符的写法（box making machine），但加连字符更清晰。"]}
{"word":"box-shaped","summary":{"en":"“Box-shaped” means shaped like a box, with flat sides and a rectangular form.","zh":"“box-shaped”指“像盒子一样的形状”，通常是平面、直线、长方体感的外观。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape of a box; roughly rectangular with flat sides.","zh":"盒子形状的；大致呈长方体、四边平直的。"},"examples":[{"en":"The box-shaped building looks simple but very practical.","zh":"这栋盒子形状的建筑看起来简单，但很实用。"},{"en":"She packed the gifts into a box-shaped container.","zh":"她把礼物装进一个盒子形状的容器里。"},{"en":"The car has a box-shaped design, with straight lines and sharp corners.","zh":"这辆车是盒子形设计，线条笔直、棱角分明。"}]}],"synonyms":["boxy","rectangular","cuboid","blocky"],"phonetic":"/ˈbɑːks ˌʃeɪpt/","extraExplanation":["“box-shaped”是复合形容词，常用来描述建筑、车身、家具或容器的外形。它通常表示“像盒子一样”，强调直线、平面和较明显的棱角。","近义表达包括：boxy（更口语，常形容车或衣服“方方的”）、rectangular（强调二维“长方形”）、cuboid（更偏书面/技术，强调三维“长方体”）。"]}
{"word":"box-ticking","summary":{"en":"“Box-ticking” means doing something just to meet formal requirements, not to achieve real value.","zh":"“box-ticking”指为了满足形式要求而做事，重流程不重实效。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Doing tasks in a way that only meets the formal requirements (like filling forms or following rules) without real care for the purpose or quality.","zh":"（做事）只为满足形式要求、完成流程（如填表、按规定走程序），而不真正关心目的或质量；“走过场”。"},"examples":[{"en":"The training felt like box-ticking—everyone signed the sheet, but no one learned much.","zh":"这次培训感觉只是走过场——大家签了到，但没学到多少。"},{"en":"We don’t want box-ticking compliance; we want real safety improvements.","zh":"我们不想要只是形式上的合规；我们要真正提升安全。"},{"en":"She criticized the policy review as box-ticking rather than meaningful evaluation.","zh":"她批评这次政策审查只是走流程，而不是有意义的评估。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing an action or process that is done mechanically to satisfy rules, without real thought or value.","zh":"形容（行为/流程）机械地为满足规定而做，缺乏实际思考或价值的。"},"examples":[{"en":"They made a box-ticking gesture of consulting residents after decisions were already made.","zh":"他们在决定都已做完后才象征性地征询居民意见，完全是走过场。"},{"en":"The paperwork is box-ticking and doesn’t help the team do better work.","zh":"这些文件工作只是形式主义，帮不了团队把工作做得更好。"}]}],"synonyms":["bureaucratic","token","perfunctory","rubber-stamp","check-the-box"],"phonetic":"/ˈbɑks ˌtɪkɪŋ/","extraExplanation":["“box-ticking”源自在清单或表格上“打勾”的动作（tick a box）。在英国英语里特别常见，常用来批评官僚主义、形式主义或为了“看起来合规”而做的流程。","常见搭配：box-ticking exercise（走过场的活动/流程）、box-ticking culture（形式主义文化）、box-ticking compliance（形式上的合规）。语气通常偏负面。"]}
{"word":"boxa","summary":{"en":"“Boxa” is not standard English; it’s usually a misspelling of “box,” or a rare proper name (brand/username).","zh":"“Boxa”不是标准英语；通常是“box”的拼写错误，或少见的专有名词（品牌/用户名）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or informal spelling of “box” or a related phrase (e.g., “box up”).","zh":"不是标准英语单词。它很可能是“box（盒子/把…装箱）”或相关表达（如“box up”）的拼写错误或非正式拼写。"},"examples":[{"en":"Did you mean “box” (a container) or “to box” (to put something in a box)?","zh":"你想表达的是“box”（盒子）还是“to box”（把东西装进盒子里）？"},{"en":"Please check the spelling—“boxa” doesn’t appear in most English dictionaries.","zh":"请检查拼写——“boxa”在大多数英语词典里找不到。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare/proper name) “Boxa” can be used as a brand name, username, or place/company name. In that case, it functions like a proper noun.","zh":"（少见/专有名词）“Boxa”也可能是品牌名、用户名或地名/公司名，此时相当于专有名词来使用。"},"examples":[{"en":"I saw Boxa listed as a username in the forum.","zh":"我在论坛里看到有人用 Boxa 作为用户名。"},{"en":"Boxa is the name of their product line.","zh":"Boxa 是他们的产品线名称。"}]}],"synonyms":["box","package","carton"],"phonetic":"ˈbɑksə","extraExplanation":["“box”这个词很常用：作名词是“盒子、箱子”；作动词可以是“把……装箱”，也可以指拳击运动里的“打拳/参加拳击”。如果你告诉我你看到“boxa”的上下文句子，我可以更准确判断你想表达哪个词。"]}
{"word":"boxball","summary":{"en":"Boxball most commonly refers to a boxing reflex ball on an elastic string used for coordination training; it can also be a brand or informal name for a game/product.","zh":"Boxball 最常指拳击训练用的弹力反应球；也可能是某种游戏或产品的品牌/非正式名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small ball attached to an elastic string (often worn with a headband) used for boxing-style reflex and coordination training","zh":"一种用于拳击反应训练的小球装置（小球用弹力绳连接，常与头带一起佩戴），用来练习反应、协调与节奏"},"examples":[{"en":"He practices with a boxball for ten minutes to improve his reflexes.","zh":"他用 boxball 练十分钟来提升反应速度。"},{"en":"The coach gave her a boxball to work on timing and hand–eye coordination.","zh":"教练给她一个 boxball，用来练习节奏感和手眼协调。"}]},{"partOfSpeech":"n.","definition":{"en":"any ball-related game or product name that combines “box” and “ball” (often a brand or informal name rather than a standard dictionary word)","zh":"泛指名称中结合 “box” 与 “ball” 的球类游戏或产品名（多为品牌名或非正式说法，不一定是标准词条）"},"examples":[{"en":"The app lists ‘Boxball’ as a game mode, but it doesn’t explain the rules.","zh":"这个应用把“Boxball”列为一种游戏模式，但没说明规则。"}]}],"synonyms":["reflex ball","boxing reflex ball","ball on a string"],"phonetic":"/ˈbɑksˌbɔl/","extraExplanation":["“boxball”并不是非常固定的标准英语词汇，现实中最常见的指的是拳击训练用的“反应球/弹力反应球”（reflex ball）。在购物网站、健身视频里更常看到这种用法。","如果你是在某个特定语境（比如学校游戏、App 模式、品牌名）看到的“Boxball”，它的具体含义可能需要结合所在地区或产品说明来确认。"]}
{"word":"boxberries","summary":{"en":"Boxberries are the red berries of a small North American creeping evergreen plant (also called partridgeberry).","zh":"Boxberries 指北美一种蔓生常绿植物结的红色浆果（也常叫 partridgeberry）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small creeping evergreen plant (Mitchella repens) found in eastern North America, with paired white flowers and bright red berries; the berries are sometimes eaten and the plant is also called partridgeberry.","zh":"（北美东部的）蔓生常绿小植物（学名 Mitchella repens），开成对的白花，结鲜红色小浆果；果实有时可食用，也常叫“partridgeberry（鹿鹑莓/山鹑莓）”。"},"examples":[{"en":"We saw boxberries tucked under the pine needles along the trail.","zh":"我们在小路旁的松针下面看到了箱莓（boxberries）。"},{"en":"Some foragers taste boxberries, though they’re more often admired than eaten.","zh":"有些采集者会尝一点箱莓，但更多时候人们只是欣赏它们。"}]}],"synonyms":["partridgeberry","twinberry","squaw vine"],"phonetic":"ˈbɑksˌbɛri","extraExplanation":["“boxberry”在日常英语里比较少见，多用于北美的自然观察、植物百科或地方性用法；复数是 boxberries。","不同地区可能把不同植物也叫作 boxberry，最常见的对应是 Mitchella repens（更常用名：partridgeberry）。阅读自然类文章时，最好结合图片或拉丁学名确认。"]}
{"word":"boxberry","summary":{"en":"Boxberry is a creeping evergreen plant with red berries, also known as partridgeberry.","zh":"Boxberry 指一种贴地匍匐的常绿植物，会结红色浆果，也称 partridgeberry（鹧鸪莓）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small North American evergreen plant (Mitchella repens) that creeps along the ground and produces paired white flowers and bright red berries; also called partridgeberry.","zh":"一种北美常见的常绿匍匐植物（学名 Mitchella repens），贴地生长，开成对的白花并结红色浆果；也叫“partridgeberry（鹧鸪莓）”。"},"examples":[{"en":"We spotted boxberry growing under the pines, with red berries close to the ground.","zh":"我们在松树下看到箱莓（boxberry）贴地生长，红色果实就在地面附近。"},{"en":"Some hikers know boxberry as partridgeberry and use it as a trail-side identification practice.","zh":"有些徒步者知道 boxberry 也叫 partridgeberry，并把它当作路边辨识植物的练习对象。"}]}],"synonyms":["partridgeberry","Mitchella repens"],"phonetic":"ˈbɑksˌbɛri","extraExplanation":["“boxberry”在日常英语里不算高频词，多见于植物学、自然观察、野外指南等语境；更常见的名字是“partridgeberry”。","这种植物常作地被植物（groundcover），在林地阴凉处形成低矮的绿色“地毯”。其红色浆果有时会留到冬季，因此在自然写作中也常被用来描写“林地里的冬日红点”。","民俗与传统草药语境里，partridgeberry 有时会被提到用于女性健康相关的传统用法，但不同地区做法差异大，且不应替代医疗建议。"]}
{"word":"boxboard","summary":{"en":"Boxboard is stiff paperboard used to make boxes and cartons, especially for packaging.","zh":"Boxboard 指用于制作盒子和纸盒包装的硬挺纸板。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a thick, stiff type of paperboard used to make boxes and cartons (often for packaging).","zh":"（用于包装的）盒纸板；硬纸板（常用来做盒子、纸箱或纸盒）。"},"examples":[{"en":"The cereal comes in a box made of boxboard.","zh":"麦片装在一个用盒纸板做的纸盒里。"},{"en":"Many cosmetics use printed boxboard packaging.","zh":"很多化妆品使用印刷精美的盒纸板包装。"}]}],"synonyms":["paperboard","cardboard","carton board","chipboard"],"phonetic":"/ˈbɑksˌbɔrd/","extraExplanation":["在包装行业里，boxboard 常指“折叠纸盒用纸板”（folding carton board），比普通纸更厚、更挺，但一般不如瓦楞纸板（corrugated cardboard）那么厚。日常口语里人们更常说 cardboard 或 paperboard。"]}
{"word":"boxboards","summary":{"en":"Boxboards are thick paperboard sheets used to make boxes and cartons (often called boxboard in singular).","zh":"Boxboards 指用于制作盒子和纸箱的厚纸板（单数常写作 boxboard）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Thick paperboard used to make boxes and cartons; cardboard sheets for packaging.","zh":"（复数）用于制作盒子、纸箱的厚纸板；包装用硬纸板。"},"examples":[{"en":"The factory buys boxboards in large rolls for cereal boxes.","zh":"这家工厂大量采购用于制作麦片盒的箱用纸板（boxboards），通常是成卷的。"},{"en":"Please store the boxboards in a dry place so they don’t warp.","zh":"请把箱用纸板放在干燥处，以免受潮变形。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) Wooden or rigid boards cut and used as parts of a box or crate.","zh":"（较少见）切割后用于制作木箱或板条箱的木板/硬板。"},"examples":[{"en":"They replaced the broken boxboards on the shipping crate.","zh":"他们把运输木箱上破损的箱板（boxboards）换掉了。"}]}],"synonyms":["boxboard","paperboard","cardboard","chipboard"],"phonetic":"/ˈbɑksˌbɔrdz/","extraExplanation":["在包装行业里更常见的单数形式是 boxboard，指“箱纸板/盒纸板”（一种纸板材料）。boxboards 是其复数，用来泛指多张/多批纸板。","boxboard 通常比普通 writing paper 厚，但比 corrugated cardboard（瓦楞纸板）更薄、更平整，常用于食品盒、药盒等印刷包装。"]}
{"word":"boxbush","summary":{"en":"Boxbush is a shrub name (often a hedge plant), but it can refer to different species depending on the region.","zh":"Boxbush 指一种常做绿篱的灌木的俗称，但在不同地区可能对应不同物种。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a shrub called a “box bush,” often used as a hedge plant; in different regions it can refer to different species (commonly shrubs that resemble boxwood).","zh":"黄杨状灌木；“box bush（箱木灌木）”的俗称，常用于绿篱植物；在不同地区可指不同物种（通常指外形像黄杨的灌木）。"},"examples":[{"en":"They planted boxbush along the fence to make a low hedge.","zh":"他们沿着篱笆种了些 boxbush 做矮绿篱。"},{"en":"In this garden, the boxbush is trimmed into neat shapes.","zh":"在这个花园里，boxbush 被修剪成整齐的造型。"}]}],"synonyms":["box bush","boxwood (sometimes, loosely)"],"phonetic":"/ˈbɑːksˌbʊʃ/","extraExplanation":["“boxbush / box bush”是俗名，不是严格的单一学名：在英语国家不同地区，可能指不同的灌木（例如某些与“boxwood（黄杨）”外观相似的植物，或某些本地灌木）。如果你是在园艺、植物学或特定国家（如澳大利亚）的语境里看到这个词，最好结合上下文或拉丁学名确认具体是哪一种植物。","拼写上也常见分开写作“box bush”。在园艺写作里，含义通常更偏“可修剪、适合做绿篱的灌木”。"]}
{"word":"boxcar","summary":{"en":"A boxcar is a covered railroad freight car; in some historical US contexts, it can also refer to a car used to transport prisoners.","zh":"boxcar 指有顶的铁路货运车厢（棚车）；在某些美国历史语境中也可指押送囚犯的车厢。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A covered railroad freight car used to carry goods (often called a “freight car” or, in the UK, a “goods van”).","zh":"（铁路）棚车；有顶的货运车厢（常称 freight car；英式英语中有时称 goods van）。"},"examples":[{"en":"The grain was loaded into a boxcar at the rural station.","zh":"谷物在乡村车站装进了棚车。"},{"en":"Several boxcars were waiting on the siding.","zh":"几节棚车停在侧线等待。"}]},{"partOfSpeech":"n.","definition":{"en":"(US) A railroad car used to transport prisoners or detainees, especially in historical contexts.","zh":"（美式）押送囚犯/被拘留者的列车车厢（多见于历史语境）。"},"examples":[{"en":"The novel describes prisoners packed into boxcars during the war.","zh":"这部小说描写了战时囚犯被塞进棚车押送的情景。"}]}],"synonyms":["freight car","railroad car","goods car"],"phonetic":"/ˈbɑksˌkɑr/","extraExplanation":["“boxcar”字面意思是“像盒子一样的车厢”，强调它是封闭、有顶的铁路车厢。日常英语里也常直接说“freight car”。","在美国历史与文学中，“boxcar”有时会出现在较沉重的叙述里（例如战争或强制迁移的押运），因此在阅读时要留意上下文语气。"]}
{"word":"boxcars","summary":{"en":"Boxcars are enclosed railroad freight cars; informally, it can also mean rolling double sixes in dice.","zh":"Boxcars 指封闭式铁路货运车厢；在俚语中也可指掷骰子掷出“双六”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Enclosed railroad freight cars with sliding doors, used for carrying goods; a single one is a boxcar.","zh":"（复数）箱式货车：带有封闭车厢和侧滑门的铁路货运车厢，用来运输货物；单数是 boxcar（箱式货车）。"},"examples":[{"en":"The grain was shipped across the country in boxcars.","zh":"谷物用箱式货车运往全国各地。"},{"en":"We watched a long line of boxcars pass by the station.","zh":"我们看着一长列箱式货车从车站旁驶过。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, dice games) A roll of double sixes (6–6).","zh":"（非正式，用于掷骰子游戏）“双六”（6–6）的点数。"},"examples":[{"en":"He rolled boxcars and won the round.","zh":"他掷出了“双六”，赢了这一局。"},{"en":"In craps, boxcars means you rolled a 12.","zh":"在花旗骰（craps）里，boxcars 表示你掷出了 12 点。"}]}],"synonyms":["freight cars","railroad cars","covered freight cars","double sixes"],"phonetic":"/ˈbɑːksˌkɑːrz/","extraExplanation":["在北美铁路文化里，boxcar 是很常见的货运车厢类型；早期因车厢外形像“箱子”而得名。","“boxcars=双六”来自赌场与掷骰子俚语：两个六并排像两节箱式货车。"]}
{"word":"boxed","summary":{"en":"“Boxed” usually means “put into a box” or “packaged in a box,” and it can also mean “boxed in” (trapped/limited).","zh":"“boxed”常指“装进盒子里/盒装的”，也可指“boxed in”（被困住、受限制、进退两难）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense/past participle of box) to put something into a box or container.","zh":"（box 的过去式/过去分词）把某物装进盒子或箱子里。"},"examples":[{"en":"She boxed the books and labeled the cartons.","zh":"她把书装箱并给纸箱贴上标签。"},{"en":"The gift was carefully boxed before shipping.","zh":"礼物在寄出前被仔细装盒。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adj.) packaged in a box; contained in a box.","zh":"（形容词）盒装的；装在盒子里的。"},"examples":[{"en":"I prefer boxed pasta because it’s easy to store.","zh":"我更喜欢盒装意大利面，因为容易储存。"},{"en":"The boxed set includes all five seasons.","zh":"这套盒装合集包含五季全部内容。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adj.) trapped or limited because there is no room to move or no good options (often used with “in”).","zh":"（形容词）被困住的；进退两难的（常与“in”连用）。"},"examples":[{"en":"With deadlines and budget cuts, the team felt boxed in.","zh":"面对截止日期和预算削减，团队感觉被逼得进退两难。"},{"en":"The small desk area made me feel boxed in.","zh":"狭小的桌面空间让我觉得很受局限。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adj.) (sports) beaten by a boxer, especially by a knockout.","zh":"（形容词）（体育）被拳击手击败的，尤指被击倒（KO）。"},"examples":[{"en":"He was boxed out in the third round.","zh":"他在第三回合被击败出局。"}]}],"synonyms":["packed","packaged","encased","contained","trapped (boxed in)","hemmed in (boxed in)"],"phonetic":"/bɑkst/","extraExplanation":["“boxed set（盒装合集）”常用于影视/音乐/书籍：把整季电视剧、专辑或系列图书集中包装销售。","“boxed in”既可字面表示“被箱子/墙等围住”，也常比喻“被形势限制、选择很少”。"]}
{"word":"boxed-in","summary":{"en":"Boxed-in means trapped or restricted—either emotionally (few options) or physically (unable to move).","zh":"Boxed-in 指被困住、受限制：既可指处境选择很少，也可指空间上被堵住无法移动。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person or group) Feeling trapped, restricted, or with very few options; unable to change a situation easily.","zh":"（指人或团体）感到被困住、受限制、选择很少；难以轻易改变处境。"},"examples":[{"en":"After taking on too many responsibilities, she felt boxed-in at work.","zh":"承担了太多责任后，她在工作中感到被困住了。"},{"en":"With no savings and rising rent, many families feel boxed-in.","zh":"没有存款、房租又上涨，许多家庭觉得进退两难。"},{"en":"Don’t box yourself in—there are more paths than you think.","zh":"别把自己困住——你能走的路比你想的更多。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of a vehicle or object) Surrounded so it cannot move freely.","zh":"（指车辆或物体）被包围、被堵住，无法自由移动。"},"examples":[{"en":"My car was boxed-in by two trucks, so I couldn’t back out.","zh":"我的车被两辆卡车夹住了，所以倒不出来。"},{"en":"The delivery van got boxed-in during the traffic jam.","zh":"送货车在堵车时被困住了。"}]}],"synonyms":["trapped","restricted","hemmed in","stuck","cornered"],"phonetic":"/ˌbɑkst ˈɪn/","extraExplanation":["“boxed-in”来自“box（盒子）+ in（在里面）”的形象比喻：像被装进盒子里一样，活动空间很小、很难脱身。常用于情绪/处境（boxed-in)；也可用于实际空间（车被堵住）。","写法上可见“boxed in / boxed-in”。作形容词放在名词前时更常用连字符：a boxed-in feeling；作表语时两种都常见：I feel boxed in.","相关表达：“boxed into a corner（被逼到墙角/走投无路）”、“hemmed in（被围困）”、“trapped（被困）”。其中 boxed-in 更强调“选择受限、难以转身”的感觉。"]}
{"word":"boxelder","summary":{"en":"Boxelder is a North American maple tree (and its wood); it can also mean the boxelder bug.","zh":"boxelder 指一种北美枫树（梣叶槭/复叶槭）及其木材；也可指梣叶槭蝽。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a North American maple tree (Acer negundo) with compound leaves, often planted for shade and known for being hardy and fast-growing","zh":"一种北美的枫树（梣叶槭/复叶槭，Acer negundo），叶子呈复叶，常作行道树或遮荫树，耐性强、生长快"},"examples":[{"en":"A boxelder grows quickly and can handle poor soil.","zh":"梣叶槭生长很快，也能适应贫瘠的土壤。"},{"en":"The street was lined with boxelders that turned pale yellow in fall.","zh":"街道两旁种着梣叶槭，秋天会变成淡黄色。"}]},{"partOfSpeech":"n.","definition":{"en":"the wood of the boxelder tree, used for light woodworking and carving","zh":"梣叶槭的木材，可用于轻型木工或雕刻"},"examples":[{"en":"The artist carved small bowls from boxelder wood.","zh":"艺术家用梣叶槭木雕刻小碗。"}]},{"partOfSpeech":"n.","definition":{"en":"short for boxelder bug, a common insect that often gathers on boxelder trees and sometimes enters houses","zh":"“梣叶槭蝽”的简称；一种常聚集在梣叶槭上的昆虫，有时会跑进屋里"},"examples":[{"en":"When the weather cooled, boxelders started clustering on the sunny wall.","zh":"天气变凉时，梣叶槭蝽开始聚在向阳的墙面上。"},{"en":"We sealed the window frames to keep boxelders from getting inside.","zh":"我们把窗框缝隙封好，防止梣叶槭蝽进屋。"}]}],"synonyms":["ash-leaved maple","Acer negundo","box elder"],"phonetic":"/bɑkˈsɛldɚ/","extraExplanation":["“boxelder”这个名字来自它的叶子有点像“elder”（接骨木），而木材曾被用来制作小箱子（box）等轻便物件；因此得名。","在北美日常语境里，如果有人说“boxelders are everywhere”，有时指的是“boxelder bugs（梣叶槭蝽）到处都是”，需要结合上下文判断是树还是虫。"]}
{"word":"boxen","summary":{"en":"“Boxen” is a playful, nonstandard plural of “box” (standard: “boxes”); it can also rarely mean “made of/related to boxwood.”","zh":"“boxen”是“box”的俏皮/非标准复数（标准为“boxes”）；也可在少见用法中表示“与黄杨木有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Playful or nonstandard) plural of “box” (more commonly: “boxes”).","zh":"（俏皮/非标准用法）“box（盒子/箱子）”的复数；标准说法通常是“boxes”。"},"examples":[{"en":"How many boxen do we need to pack the books?","zh":"我们需要多少个箱子来装书？"},{"en":"The delivery came with three big boxen on the porch.","zh":"快递送来三大箱，放在门廊上。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare, dialectal/poetic) relating to the box tree/boxwood.","zh":"（罕见；方言/诗歌用法）与黄杨（box tree/boxwood）有关的；黄杨木的。"},"examples":[{"en":"A boxen hedge lined the old garden path.","zh":"一排黄杨树篱沿着老花园的小路排列。"}]}],"synonyms":["boxes"],"phonetic":"/ˈbɑksən/","extraExplanation":["“boxen”这种复数带有一种开玩笑、装可爱或故意“复古”的味道：英语里少数名词曾用 -en 结尾变复数（如 ox→oxen）。现代英语通常不用这个规则，所以“boxen”常见于口语玩笑、网络梗或特定社群的幽默表达。","网络文化里，“boxen”曾因漫画/技术圈的玩笑用法而流行，用来刻意替代更正常的“boxes”。"]}
{"word":"Boxer","summary":{"en":"A boxer is usually a person who fights in boxing; it can also mean the Boxer dog breed or (usually plural) loose underwear shorts.","zh":"boxer 通常指拳击手；也可指拳师犬；还可指（多用复数）平角内裤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who fights in the sport of boxing (as a professional or amateur).","zh":"拳击运动员；拳手（从事拳击这项运动的人，职业或业余皆可）。"},"examples":[{"en":"My uncle was a boxer when he was young.","zh":"我叔叔年轻时是个拳击手。"},{"en":"She trains every day to become a professional boxer.","zh":"她每天训练，想成为职业拳击运动员。"}]},{"partOfSpeech":"n.","definition":{"en":"a medium-sized dog breed (the Boxer), known for a strong body and a short, square-shaped head.","zh":"拳师犬（Boxer 犬种；中型犬，体格强壮，头部短而方）。"},"examples":[{"en":"Their boxer is friendly but very energetic.","zh":"他们家的拳师犬很友好，但精力非常旺盛。"},{"en":"A boxer needs daily exercise and training.","zh":"拳师犬需要每天运动和训练。"}]},{"partOfSpeech":"n.","definition":{"en":"a type of loose shorts worn for sports or as underwear (boxers).","zh":"平角内裤；（运动）短裤（常用复数 boxers）。"},"examples":[{"en":"He prefers boxers to briefs.","zh":"他更喜欢平角内裤而不是三角裤。"},{"en":"Pack an extra pair of boxers for the trip.","zh":"旅行时多带一条平角内裤。"}]}],"synonyms":["fighter","pugilist","Boxer (dog)","boxer shorts"],"phonetic":"/ˈbɑːksɚ/","extraExplanation":["“Boxer” 作“拳击手”时，来自动词“box”（拳击、用拳打）。作“拳师犬”时，因该犬种外形与动作让人联想到拳击姿势而得名。","日常口语里，“boxers”几乎总是指平角内裤（复数），单数“a boxer”一般不会被理解为“内裤”，更可能指“拳击手”或“拳师犬”。"]}
{"word":"boxer","summary":{"en":"A “boxer” is most commonly a person who fights in boxing; it can also mean the Boxer dog breed or a person who packs boxes.","zh":"“boxer”最常指拳击手；也可指拳师犬（犬种）或装箱工。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who fights in boxing (as a sport or profession).","zh":"拳击手；从事拳击运动的人（业余或职业）。"},"examples":[{"en":"She trains every morning to become a professional boxer.","zh":"她每天早上训练，想成为一名职业拳击手。"},{"en":"The boxer won the match by knockout in the third round.","zh":"这位拳击手在第三回合以击倒获胜。"}]},{"partOfSpeech":"n.","definition":{"en":"a dog of a medium-to-large breed with a short coat and a square-looking head (the Boxer).","zh":"拳师犬（Boxer）：一种中大型短毛犬，头部较方。"},"examples":[{"en":"Their boxer is playful but needs plenty of exercise.","zh":"他们的拳师犬很爱玩，但需要大量运动。"},{"en":"A boxer can be gentle with families when well trained.","zh":"训练得当的拳师犬对家庭很温和。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who packs things into boxes, especially as a job.","zh":"装箱工；把物品装进箱子里的人（尤指工作）。"},"examples":[{"en":"The factory hired a boxer to pack the products for shipping.","zh":"工厂雇了一名装箱工来把产品打包发货。"}]}],"synonyms":["fighter","pugilist","Boxer (dog breed)","packer"],"phonetic":"/ˈbɑksɚ/","extraExplanation":["“boxer”最常见的意思是“拳击手”。英语里很多表示“做某种事的人”的词会用 -er 结尾：box（拳击/打拳）+ -er → boxer。","注意大小写：Boxer（首字母大写）常指“拳师犬”这个犬种；boxer（小写）更常指“拳击手”。","相关词：boxing（拳击运动），boxer shorts（男式平角内裤/拳击短裤，日常口语常说 boxers）。"]}
{"word":"boxer-puncher","summary":{"en":"A well-rounded boxer with both strong technique and strong punching power.","zh":"兼具技术与力量的全能型拳手（技术型重炮手）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A boxer who combines good boxing skills (movement, timing, defense) with strong punching power; a well-rounded fighter who can both outbox and hurt opponents.","zh":"（拳击）兼具技术与重拳力量的拳手；既能打技术又能以重拳造成伤害的全能型选手。"},"examples":[{"en":"He’s a classic boxer-puncher: he can win on points, but he can also stop you with one clean shot.","zh":"他是典型的技术型重炮手：既能靠点数取胜，也可能一记干净的重拳就把你终结。"},{"en":"Against a pure boxer, a boxer-puncher often looks for the moment to counter with power.","zh":"面对纯技术型拳手时，技术型重炮手常常寻找时机用有力的迎击反击。"}]}],"synonyms":["all-around fighter","well-rounded boxer","power boxer","boxer with power"],"phonetic":"/ˈbɑːksɚ ˈpʌntʃɚ/","extraExplanation":["在拳击风格分类里，常见的对比有：pure boxer（纯技术型/以速度与脚步为主）、puncher（重炮手/以力量为主）、boxer-puncher（技术与力量兼备）、pressure fighter/swarmer（压迫型/蜂拥近身）、counterpuncher（防反型/以反击为主）。boxer-puncher通常意味着“更均衡”，但具体风格仍会因选手而异。"]}
{"word":"boxerism","summary":{"en":"Boxerism means boxing—either the sport itself or a boxer’s characteristic style/techniques.","zh":"Boxerism 指“拳击”，既可指拳击运动本身，也可指拳击手的风格与技法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the sport or practice of boxing; pugilism","zh":"拳击运动；拳击（的实践）"},"examples":[{"en":"In the early 1900s, boxerism was often discussed in newspapers alongside baseball and horse racing.","zh":"在20世纪初，报纸常把拳击运动与棒球、赛马一起讨论。"},{"en":"He studied boxerism not only for fitness, but also for its discipline and footwork.","zh":"他学习拳击不仅为了健身，也为了其中的纪律性和步法。"}]},{"partOfSpeech":"n.","definition":{"en":"a boxer’s style, methods, or techniques","zh":"拳击手的风格、打法或技术特点"},"examples":[{"en":"Her boxerism is built on quick jabs and constant movement.","zh":"她的拳击风格建立在快速刺拳和持续移动之上。"},{"en":"The coach tried to modernize his boxerism by improving defense.","zh":"教练试图通过加强防守来让他的打法更现代。"}]}],"synonyms":["boxing","pugilism","the sweet science (informal)"],"phonetic":"/ˈbɑk.səˌrɪ.zəm/","extraExplanation":["“boxerism”是相对少见的词，更常见的说法是“boxing”（拳击）或“pugilism”（较正式/较旧的“拳击”说法）。在较旧的英文文本或报刊中，你更可能看到“boxerism”。","词形来源上，“-ism”常用来表示“某种做法/体系/风格”（如“realism”“tourism”），所以“boxerism”可以理解为“拳击这一套（运动或打法）”。"]}
{"word":"boxers","summary":{"en":"“Boxers” usually means either boxing fighters (plural of boxer) or loose shorts/underwear called boxer shorts.","zh":"“boxers”通常指两种：拳击手（复数）或叫作 boxer shorts 的宽松短裤/平角内裤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Loose shorts worn for sports (especially boxing) or as underwear; usually plural.","zh":"（常用复数）宽松的短裤：可指拳击运动短裤，也可指平角内裤。"},"examples":[{"en":"He bought new boxers for training.","zh":"他买了新的拳击短裤来训练。"},{"en":"I prefer boxers to briefs because they feel looser.","zh":"我比起三角内裤更喜欢平角内裤，因为更宽松。"}]},{"partOfSpeech":"n.","definition":{"en":"People who fight in the sport of boxing; plural of “boxer.”","zh":"拳击手（boxer 的复数）。"},"examples":[{"en":"Many famous boxers trained in this gym.","zh":"很多著名拳击手都在这家健身房训练过。"},{"en":"The boxers touched gloves before the match.","zh":"比赛前，拳击手们碰拳致意。"}]}],"synonyms":["boxer shorts","underwear","fighters","pugilists"],"phonetic":"/ˈbɑk.sɚz/","extraExplanation":["“boxers”在日常生活里很常见的歧义是：既可能指“拳击手们”，也可能指“平角内裤/拳击短裤”。通常看上下文判断：talk about a match/gym/training 多半是拳击手；talk about clothing/size/comfort 多半是内裤。","与衣物相关的常见搭配：a pair of boxers（一条平角裤），boxer shorts（平角短裤/宽松内裤）。与拳击相关的搭配：professional boxers（职业拳击手），lightweight boxers（轻量级拳击手）。"]}
{"word":"boxes","summary":{"en":"“Boxes” usually means multiple containers (“box” + -es). It can also be the verb form meaning “puts into a box” or “does boxing.”","zh":"“Boxes”最常见是“box”的复数，表示多个盒子/箱子；也可以作动词第三人称单数，表示“把……装箱”或“进行拳击运动”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “box”: containers (often made of cardboard, wood, or plastic) used to hold or store things","zh":"“box”的复数：盒子/箱子（常见为纸板、木头或塑料制），用来装或存放物品"},"examples":[{"en":"We packed the books into three boxes.","zh":"我们把书装进了三个箱子里。"},{"en":"The boxes are stacked in the corner.","zh":"这些箱子堆在角落里。"}]},{"partOfSpeech":"v.","definition":{"en":"third-person singular of “box”: to put something into a box or container","zh":"“box”的第三人称单数：把某物装进盒子/箱子里"},"examples":[{"en":"She boxes the gifts before wrapping them.","zh":"她先把礼物装进盒子再包装。"},{"en":"He boxes up old photos to keep them safe.","zh":"他把旧照片装箱保存，确保安全。"}]},{"partOfSpeech":"v.","definition":{"en":"third-person singular of “box”: to fight using boxing gloves (the sport of boxing)","zh":"“box”的第三人称单数：进行拳击运动（戴拳套比赛/训练）"},"examples":[{"en":"He boxes twice a week at the local gym.","zh":"他每周在本地健身房练两次拳击。"}]}],"synonyms":["cartons","containers","cases","packages"],"phonetic":"/ˈbɑksɪz/","extraExplanation":["“boxes”读音以 /ɪz/ 结尾，是因为“box”以 /s/ 音结尾；英语里很多以 s、x、z、ch、sh 结尾的名词变复数时会加 -es（如 buses, watches, dishes）。"]}
{"word":"boxfish","summary":{"en":"A boxfish is a tropical reef fish with a box-like body protected by a hard shell.","zh":"boxfish 指一种热带珊瑚礁鱼类，身体像盒子一样，并有坚硬外壳保护。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical sea fish (family Ostraciidae) with a box-shaped body covered by a hard, bony shell; often seen on coral reefs and sometimes kept in aquariums","zh":"箱鲀（热带海鱼，箱鲀科）；身体呈“盒子”形，外有坚硬的骨质外壳，常见于珊瑚礁，也有人饲养为观赏鱼"},"examples":[{"en":"We saw a bright yellow boxfish swimming slowly near the coral.","zh":"我们看到一条亮黄色的箱鲀在珊瑚附近慢慢游动。"},{"en":"Because of its hard shell, a boxfish looks very different from most other fish.","zh":"因为有坚硬的外壳，箱鲀看起来和大多数鱼都很不一样。"},{"en":"Some boxfish release toxins when stressed, so they are not ideal for beginner aquariums.","zh":"有些箱鲀在受惊或压力大时会释放毒素，所以不太适合新手水族箱。"}]}],"synonyms":["cowfish (related fish)","trunkfish (related fish)"],"phonetic":"/ˈbɑksˌfɪʃ/","extraExplanation":["“boxfish”这个名字很直观：box（盒子）+ fish（鱼），指它们像盒子一样的体型和坚硬的外壳（装甲）。","在英语里也常把某些幼年箱鲀叫作“yellow boxfish”（黄色箱鲀/黄箱鲀），外形可爱，经常出现在纪录片和水族馆科普里。"]}
{"word":"boxfish-like","summary":{"en":"“Boxfish-like” means shaped like a boxfish—boxy, angular, and rigid-looking.","zh":"“boxfish-like”指外形像箱鲀：较方正、棱角分明、带硬壳般的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a boxfish in shape or appearance (often meaning boxy, angular, or with a rigid “box-like” body).","zh":"外形像箱鲀（boxfish）的；（常指）方正、棱角分明、像“盒子”一样有硬壳感的。"},"examples":[{"en":"The underwater robot has a boxfish-like body to help it stay stable in the current.","zh":"这台水下机器人采用箱鲀般的机身，有助于在水流中保持稳定。"},{"en":"The car’s boxfish-like silhouette looks unusual but improves airflow in some designs.","zh":"这辆车箱鲀般的轮廓看起来很特别，但在某些设计中能改善气流表现。"}]}],"synonyms":["boxy","angular","cuboid","boxfish-shaped"],"phonetic":"/ˈbɑksˌfɪʃ laɪk/","extraExplanation":["“boxfish-like”是由名词“boxfish（箱鲀）+ -like（像……一样的）”构成的复合形容词，常见于科技、工业设计或科普写作中，用来形容“外形方正但可能具备良好流体/空气动力学特性”的造型。","在工程与设计语境里，人们有时会借用箱鲀的外形来做“仿生”说明：看似方盒子，但可能更稳定或更省力（取决于具体设计与测试）。"]}
{"word":"boxfish-related","summary":{"en":"“Boxfish-related” means connected to boxfish or inspired by their features, especially in research, nature topics, or design.","zh":"“Boxfish-related”表示与箱鲀/箱鱼有关，或受其特征启发（常见于研究、自然话题或设计领域）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with, about, or involving boxfish (a tropical fish with a boxy, armored body).","zh":"与箱鲀（箱鱼，一种身体呈盒状、带硬甲的热带鱼）有关的；涉及箱鲀的。"},"examples":[{"en":"The documentary includes boxfish-related footage from coral reefs.","zh":"这部纪录片包含来自珊瑚礁的箱鲀相关影像。"},{"en":"Researchers shared boxfish-related data on how the fish swims efficiently.","zh":"研究人员分享了箱鲀相关数据，说明这种鱼如何高效游动。"}]},{"partOfSpeech":"adj.","definition":{"en":"Inspired by the shape or features of a boxfish, especially in design or engineering (often referring to streamlined yet boxy forms).","zh":"受箱鲀外形或特征启发的（尤指设计或工程领域，常指“方盒状但具流线感”的造型）。"},"examples":[{"en":"The team tested a boxfish-related car concept in a wind tunnel.","zh":"团队在风洞里测试了一款箱鲀启发的汽车概念。"},{"en":"The robot’s shell uses a boxfish-related structure for protection.","zh":"这个机器人的外壳采用了箱鲀式结构来增强防护。"}]}],"synonyms":["boxfish-associated","boxfish-linked","boxfish-inspired"],"phonetic":"/ˈbɑːksˌfɪʃ rɪˈleɪtɪd/","extraExplanation":["“boxfish-related”是一个带连字符的复合形容词：名词 boxfish + related（“相关的”）。在学术写作、新闻标题或需要修饰名词时常用连字符（如 boxfish-related research / boxfish-related design）。如果放在名词后作表语，连字符有时可省略：The research is boxfish related（但更常见仍保留连字符以保持清晰）。","boxfish 常译为“箱鲀/箱鱼”，属于热带海洋鱼类。它的“盒状外形+硬甲”在仿生设计里偶尔会被提到，因此“boxfish-related”既可能是“关于这种鱼本身”，也可能是“受其外形启发的设计”。"]}
{"word":"boxfishes","summary":{"en":"“Boxfishes” means more than one boxfish—tropical reef fish with a hard, box-like body covering.","zh":"“boxfishes”是boxfish的复数，指多条箱鲀/箱鱼——热带珊瑚礁鱼类，身体有坚硬的盒状外壳。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plural form of boxfish: a tropical reef fish with a hard, box-shaped bony shell (carapace) around its body","zh":"boxfish（箱鲀/箱鱼）的复数：一种生活在热带珊瑚礁的鱼，身体外有坚硬的“盒状”骨质外壳（甲壳）"},"examples":[{"en":"Boxfishes move slowly but can be surprisingly agile among coral reefs.","zh":"箱鲀游得不快，但在珊瑚礁之间却能出奇地灵活。"},{"en":"We spotted several boxfishes near the shallow reef at low tide.","zh":"退潮时，我们在浅礁附近看到好几条箱鲀。"},{"en":"Some boxfishes release toxins when stressed, so they should not be handled.","zh":"有些箱鲀在受压时会释放毒素，所以不应随意抓碰。"}]}],"synonyms":["boxfish","cowfish"],"phonetic":"/ˈbɑkˌfɪʃ/","extraExplanation":["“boxfishes”常见于科普文章或水族/潜水语境，是普通名词复数；单数是“boxfish”。","箱鲀多属于箱鲀科（Ostraciidae），外形像“方盒子”，靠背鳍和臀鳍摆动推进。","相关常见名词：cowfish（牛角箱鲀，部分物种头部有“角”状突起）。"]}
{"word":"Boxford","summary":{"en":"Boxford is a proper noun used as a place name, most often a town in Massachusetts (USA) or a village in Suffolk (England).","zh":"Boxford 是地名专有名词，最常指美国马萨诸塞州的城镇，或英国萨福克郡的村庄。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a place name (proper noun). It most commonly refers to a town in Essex County, Massachusetts, USA; it can also refer to a village in Suffolk, England.","zh":"地名（专有名词）。最常见指美国马萨诸塞州埃塞克斯县的 Boxford 镇；也可指英国萨福克郡的 Boxford 村。"},"examples":[{"en":"She lives in Boxford, Massachusetts, about an hour north of Boston.","zh":"她住在马萨诸塞州的 Boxford，离波士顿北边大约一小时车程。"},{"en":"We stopped in Boxford, Suffolk, on our way through the English countryside.","zh":"我们穿行英国乡间时在萨福克郡的 Boxford 停了一下。"}]}],"synonyms":["(no direct synonym; related: town, village, place name)"],"phonetic":"/ˈbɑksfərd/","extraExplanation":["“Boxford”是典型的英语地名，写作时首字母大写。实际指向哪个地方要看语境（例如后面是否跟着 Massachusetts / Suffolk 等）。","在美国语境中，提到“Boxford”时更常默认是马萨诸塞州的城镇；在英国语境中则可能是萨福克郡的村庄。"]}
{"word":"boxful","summary":{"en":"“Boxful” means a box-sized amount—what a box can hold.","zh":"“boxful”指“一盒的量”，即一盒能装下的数量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A quantity that fills a box; as much as a box can hold.","zh":"一盒的量；装满一盒的数量。"},"examples":[{"en":"She bought a boxful of apples at the market.","zh":"她在市场买了一盒苹果。"},{"en":"We received a boxful of letters from friends.","zh":"我们收到了来自朋友的一盒信。"}]}],"synonyms":["boxload","a box of","a full box"],"phonetic":"/ˈbɑksˌfʊl/","extraExplanation":["“boxful”由“box + -ful”构成，-ful 表示“……的量/充满……的”。类似的词还有：handful（一把）、cupful（一杯）、bagful（一袋）。","在口语里常用来强调“数量不少”，不一定要求真的“刚好装满一盒”，更像是一个形象的说法。"]}
{"word":"boxfuls","summary":{"en":"“Boxfuls” means several boxfuls—amounts that can fit into a box, counted by boxes.","zh":"“boxfuls”指“好几箱的量”，按“装满一箱的容量”来计数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “boxful”: the amount that can be held in one box, counted in multiple boxes.","zh":"“boxful”的复数：一箱的容量/装得满满一箱的量；多个箱子的量。"},"examples":[{"en":"They donated three boxfuls of books to the school library.","zh":"他们向学校图书馆捐了三箱书。"},{"en":"She carried two boxfuls of old clothes to the recycling center.","zh":"她把两箱旧衣服搬到回收站。"},{"en":"We found boxfuls of letters in the attic.","zh":"我们在阁楼里发现了好几箱信。"}]}],"synonyms":["boxes of","cartons of (if carton is meant)","loads (informal)"],"phonetic":"ˈbɑksˌfʊlz","extraExplanation":["“boxful”由 box + 后缀 -ful（表示“装满……的量”）构成，意思是“满满一箱的量”。复数通常写作 boxfuls（在 -ful 后面加 -s），用于强调“数量按箱来数”。","类似结构：handful(s)（一把/几把）、cupful(s)（一杯/几杯）、bagful(s)（一袋/几袋）。日常表达中也常说 “three boxes of …”（三箱……），语气更中性；“three boxfuls of …”更强调“容量/装满的量”。"]}
{"word":"boxhaul","summary":{"en":"Boxhaul means either transporting goods in a box truck/container (common in logistics) or a sailing maneuver to turn a ship by backing the sails (traditional nautical use).","zh":"boxhaul 可以指物流中用箱式货车/集装箱运货，也可指航海中通过倒帆使船短暂倒退来完成掉头的操船动作。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to transport goods in a large box-shaped vehicle or container (such as a box truck or shipping container)","zh":"用箱式货车或集装箱等运送货物；“箱货运输”"},"examples":[{"en":"The carrier specializes in boxhauling for small businesses.","zh":"这家承运商专门为小企业提供箱货运输服务。"},{"en":"We boxhaul our products from the warehouse to local stores twice a week.","zh":"我们每周两次把产品从仓库用箱式运输送到本地门店。"}]},{"partOfSpeech":"n.","definition":{"en":"a job or trip that involves transporting goods in a box truck or container","zh":"用箱式货车或集装箱进行的一次运输任务/行程"},"examples":[{"en":"He picked up a boxhaul from the port to the distribution center.","zh":"他接了一单从港口到配送中心的箱货运输。"},{"en":"It’s a short boxhaul, but the traffic can be heavy downtown.","zh":"这趟箱货运输不远，但市中心可能很堵。"}]},{"partOfSpeech":"v.","definition":{"en":"to turn a sailing ship around by backing the sails so the ship briefly moves backward (a sailing maneuver)","zh":"（航海）通过倒帆使船短暂倒退，从而让船掉头的一种操船动作"},"examples":[{"en":"In strong winds, the crew boxhauled the ship to avoid the shoals.","zh":"在大风中，船员用“倒帆掉头”来避开浅滩。"},{"en":"The captain ordered a boxhaul when there wasn’t enough room to tack normally.","zh":"当没有足够空间正常抢风调向时，船长下令进行倒帆掉头。"}]}],"synonyms":["haul","transport","truck (informal)","ship","boxhauling (gerund)"],"phonetic":"/ˈbɑkˌhɔl/","extraExplanation":["“boxhaul / boxhauling”在现代更常见于物流口语或行业用语，指“用箱式车/集装箱进行运输”。在更传统的航海语境里，它指一种操船技术：通过让船短暂“倒退”（sternway）来完成掉头，多用于空间受限或风浪条件复杂时。","拼写上常见变体有 box-haul、box haul、boxhaul；具体含义通常由上下文（物流/航海）决定。"]}
{"word":"boxhauled","summary":{"en":"Boxhauled means a ship was forced to make a sharp, difficult turn by backing and hauling the sails; figuratively, it can mean being forced into an abrupt change of direction.","zh":"boxhauled 指船只通过倒帆并牵引完成急而困难的转向；也可引申为被迫突然改变方向或计划。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(nautical) Past tense/past participle of “boxhaul”: to force a sailing ship to change direction (often in a tight space) by backing the sails and hauling the ship’s head through the wind.","zh":"（航海）“boxhaul”的过去式/过去分词：通过让帆反向受风并牵引船头顶风转向，使帆船在狭小空间内被迫急转改变航向。"},"examples":[{"en":"In the narrow channel, the captain boxhauled the ship to avoid the rocks.","zh":"在狭窄的航道里，船长让船boxhaul（急转向）以避开礁石。"},{"en":"The schooner was boxhauled in a sudden squall and lost speed.","zh":"那艘纵帆船在突来的狂风中被迫boxhaul（急转向），速度一下子降了下来。"}]},{"partOfSpeech":"adj.","definition":{"en":"(by extension) Forced into a sudden change of plan or direction.","zh":"（引申）被迫突然改变计划或方向；被“急转弯”。"},"examples":[{"en":"The new regulations boxhauled the project, and we had to rewrite the proposal.","zh":"新规让项目被迫“急转弯”，我们只好重写提案。"},{"en":"A surprise budget cut boxhauled their strategy midyear.","zh":"年中突如其来的预算削减让他们的策略被迫大改。"}]}],"synonyms":["(nautical) tacked (general)","(figurative) forced to pivot","(figurative) turned abruptly"],"phonetic":"/ˈbɑksˌhɔld/","extraExplanation":["“boxhaul”是航海术语，常见于帆船时代的记述。它描述一种在空间受限或情况紧急时的转向方式：让前帆短暂“倒帆”（back the sails），再把船头拉过迎风方向完成换舷。","词形上是 box + haul（拉、拖），形象地表达“把船硬拉着转过去”的感觉。现代日常英语里很少用，多出现在航海史、海事小说或比喻写法中。"]}
{"word":"boxhauling","summary":{"en":"Boxhauling means transporting boxes—often shipping containers—as a logistics job.","zh":"Boxhauling 指运送箱装货物，常特指集装箱运输（物流工作）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the job or activity of transporting boxes, especially shipping containers (\"boxes\") or packaged freight, usually by truck, rail, or ship","zh":"运箱运输；（尤指）集装箱（“箱”）或打包货物的运输工作（常见于卡车、铁路或船运）"},"examples":[{"en":"He works in box hauling, moving containers from the port to inland warehouses.","zh":"他做运箱运输，把集装箱从港口运到内陆仓库。"},{"en":"Boxhauling rates went up during the holiday shipping season.","zh":"节日运输旺季期间，运箱运输的运价上涨了。"}]},{"partOfSpeech":"v.","definition":{"en":"to transport boxes or container freight as part of logistics work","zh":"运送箱装货物；（尤指）运输集装箱货物"},"examples":[{"en":"They boxhaul refrigerated goods to supermarkets overnight.","zh":"他们夜间运输冷藏货物到各大超市。"},{"en":"Our company boxhauls for several importers.","zh":"我们公司为几家进口商做集装箱运输。"}]}],"synonyms":["container hauling","freight hauling","drayage (port trucking)","haulage"],"phonetic":"/ˈbɑːksˌhɔːlɪŋ/","extraExplanation":["在物流行业里，box 常口语指“集装箱”（container）。因此 boxhauling 往往和港口（port）、堆场（yard）、仓库（warehouse）等场景一起出现。也常见写法：box hauling / box-hauling。"]}
{"word":"boxhauls","summary":{"en":"“Box hauls” usually means shipments or loads carried in boxes, or (online) big boxed purchases someone shows or moves.","zh":"“box hauls”通常指“一批批箱装货/成箱搬运的货”，也可指网络上展示的“成箱囤货/战利品”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"shipments or loads of goods carried in boxes (often used in logistics, moving, or online reselling to describe a delivery or a large purchase you bring home).","zh":"装在箱子里的货物运输/一批箱装货（常用于物流、搬家或网购/转卖语境，指一次送达或带回家的大批货）。"},"examples":[{"en":"The store received three box hauls this morning, so the shelves will be restocked soon.","zh":"店里今天早上收到了三批箱装货，所以货架很快会补满。"},{"en":"After the sale, we had two box hauls to carry up to the apartment.","zh":"打折结束后，我们有两批箱子要搬上公寓。"},{"en":"She posts weekly box hauls on her channel to show what she bought in bulk.","zh":"她在频道里每周发“箱装战利品/囤货开箱”，展示自己批量买了什么。"}]}],"synonyms":["boxed shipments","loads of boxes","bulk delivery","haul"],"phonetic":"/bɑks hɔl/","extraExplanation":["“box haul(s)”不是特别固定的标准词条，更常见于口语或小众行业用法。根据语境，它可能指：①搬运/运输的“几箱货”；②网络内容里的“haul”（战利品展示）+ box（成箱/盲盒/整箱购）。如果你是在某个平台或某个行业看到的，我也可以帮你更精准地解释。"]}
{"word":"boxhead","summary":{"en":"“Boxhead” is an informal noun meaning a “square-headed” person or, more commonly, an insulting way to call someone an idiot.","zh":"“boxhead”是非正式名词，可指“方头/方脸”的人，更常见的是带侮辱性的“蠢货/笨蛋”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, often offensive) A stupid or annoying person; an insult meaning “idiot.”","zh":"（非正式，常带冒犯）笨蛋、讨厌的人；用来骂人的“蠢货”。"},"examples":[{"en":"Stop calling him a boxhead—talk about the problem instead.","zh":"别再骂他是“蠢货”了——专注讨论问题。"},{"en":"He gets angry when people use insults like “boxhead.”","zh":"别人用“boxhead”这种侮辱性词语时，他会生气。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) Someone with a square-shaped head or a “blocky” look; often a teasing nickname.","zh":"（非正式）头型很方、看起来“方块脸”的人；常作取笑的外号。"},"examples":[{"en":"In school, he was teased as a “boxhead” because of his haircut.","zh":"在学校里，他因为发型被取笑叫“方头”。"},{"en":"The cartoon character is a boxhead with a big square helmet.","zh":"那个卡通角色是个“方头”，戴着很大的方形头盔。"}]}],"synonyms":["idiot","fool","dummy","blockhead","squarehead"],"phonetic":"/ˈbɑkˌhɛd/","extraExplanation":["“boxhead”在很多语境里属于贬义或侮辱性用语，尤其表示“笨蛋”时容易冒犯他人。更安全的表达可以用：\"silly\"（有点傻、较轻）、\"foolish\"（不明智）、\"rude\"（无礼）等，或直接描述行为而不贴标签。","在不同地区，“boxhead”可能还有特定群体绰号的历史用法；如果不确定当地语境，建议避免使用。"]}
{"word":"boxholder","summary":{"en":"A boxholder is usually a person who has the right to use a private theater box; less commonly, it can mean a device that holds boxes in place.","zh":"boxholder通常指有权使用剧院包厢的人；较少情况下也可指固定盒子/纸箱的装置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who rents, owns, or has the right to use a private box (a small separate seating area) in a theater or opera house.","zh":"（剧院/歌剧院的）包厢持有人；包厢租用者/拥有者"},"examples":[{"en":"The boxholder arrived early and greeted guests before the performance began.","zh":"包厢持有人提前到达，在演出开始前迎接客人。"},{"en":"As a boxholder, she could reserve the same box for the entire season.","zh":"作为包厢持有人，她可以整季预订同一个包厢。"}]},{"partOfSpeech":"n.","definition":{"en":"Someone or something that holds a box or keeps boxes in place (less common; usually used in specific contexts like packaging or storage).","zh":"（较少用）盒子/箱子的固定器；用于放置或固定盒子的装置/物品"},"examples":[{"en":"The warehouse added a simple boxholder to keep the cartons from sliding.","zh":"仓库加了一个简单的固定器，防止纸箱滑动。"},{"en":"Use a boxholder on the shelf to organize small boxes.","zh":"在架子上用盒子固定器来整理小盒子。"}]}],"synonyms":["box seat holder","season ticket holder","subscriber","patron"],"phonetic":"/ˈbɑksˌhoʊldɚ/","extraExplanation":["“boxholder”在英美语境里更常见于传统剧院文化：私人包厢（box）通常用于社交与招待宾客，拥有包厢或季票曾是一种社会身份的象征。现代场馆仍可能使用这一说法，但日常口语中也常直接说“someone with a box/box seats”或“season box holder”。"]}
{"word":"Boxholm","summary":{"en":"Boxholm is a town in Sweden, often mentioned in connection with Boxholm cheese.","zh":"Boxholm 是瑞典的一个小镇，常与博克斯霍尔姆奶酪联系在一起。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small town (locality) in Östergötland County, Sweden, known as the home of Boxholm cheese (Boxholms ost).","zh":"瑞典厄斯特约特兰省（Östergötland）的一个小镇，以“博克斯霍尔姆奶酪（Boxholms ost）”而知名。"},"examples":[{"en":"Boxholm is a quiet Swedish town that many people know because of its cheese.","zh":"Boxholm 是一个安静的瑞典小镇，许多人因为它的奶酪而知道它。"},{"en":"We passed through Boxholm on our way to Linköping.","zh":"我们去林雪平（Linköping）的路上经过了 Boxholm。"}]}],"phonetic":"/ˈbɑːks.hoʊlm/","extraExplanation":["Boxholm 常被当作专有名词使用（地名）。在英语文本里可能出现在旅行、地理或美食语境中，尤其是提到瑞典的“Boxholm cheese/Boxholms ost（博克斯霍尔姆奶酪）”。","发音上，英语使用者有时会用近似读法；在瑞典语中重音与元音可能与英语略有不同。"]}
{"word":"boxiana","summary":{"en":"Boxiana is the title of Pierce Egan’s classic early-1800s book series about British bare-knuckle boxing; it can also loosely mean boxing writing in that style (rare).","zh":"Boxiana 指皮尔斯·伊根在19世纪初写的英国徒手拳击题材经典系列书名；也可泛指类似风格的拳击记述（较少见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a famous early-19th-century series of books by Pierce Egan (1812–1829) describing and celebrating bare-knuckle boxing, boxers, and boxing culture in Britain","zh":"《Boxiana》：皮尔斯·伊根（Pierce Egan）于19世纪初（1812–1829）出版的一套著名书籍，记录并描写英国徒手拳击、拳手与拳击文化"},"examples":[{"en":"Pierce Egan’s Boxiana helped shape the public image of boxing in the 1800s.","zh":"皮尔斯·伊根的《Boxiana》在19世纪帮助塑造了大众对拳击的印象。"},{"en":"Historians still cite Boxiana when studying early British prizefighting.","zh":"研究英国早期“奖金拳击”（职业拳赛）时，历史学者至今仍会引用《Boxiana》。"}]},{"partOfSpeech":"n.","definition":{"en":"by extension, writing or information about boxing in the style of that series (rare)","zh":"引申义：指模仿《Boxiana》那种风格的拳击记述或资料（较少见）"},"examples":[{"en":"The article reads like modern Boxiana—full of colorful detail about fighters and fans.","zh":"这篇文章读起来像现代版的“Boxiana”——充满对拳手与观众的生动细节。"}]}],"synonyms":["Egan’s Boxiana","prizefighting chronicles (near meaning)"],"phonetic":"/bɑk.siˈæn.ə/","extraExplanation":["“Boxiana”这个词是由“boxing（拳击）”加上类似书名/系列名的后缀构成，用作书名时通常首字母大写：Boxiana。","《Boxiana》记录的是19世纪早期英国的“prizefighting”（奖金拳赛，常为徒手拳击）时期，因此常被视为了解当时体育、娱乐与社会风俗的重要材料。","在文学与文化史研究中，人们有时会把它当作“拳击世界的编年史/人物志”来引用；不过在日常英语里，这个词很罕见，多出现在历史或体育史语境。"]}
{"word":"boxier","summary":{"en":"“Boxier” means more box-shaped or square in appearance (the comparative form of “boxy”).","zh":"“boxier”表示“更方正/更像盒子”，是“boxy（方盒状的）”的比较级。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"More box-shaped or square; having a more rectangular, bulky look than something else.","zh":"更像盒子/更方正的；比另一件东西更显得四四方方、棱角分明或略显笨重。"},"examples":[{"en":"This year’s SUV looks boxier than last year’s model.","zh":"今年这款SUV看起来比去年的型号更方正。"},{"en":"The new packaging is boxier, so it takes up more space on the shelf.","zh":"新包装更像盒子，所以在货架上更占地方。"},{"en":"Her jacket is boxier in the shoulders, giving it a structured style.","zh":"她的夹克肩部更方正，整体风格更挺括。"}]}],"synonyms":["more boxy","squarer","more rectangular","chunkier"],"phonetic":"/ˈbɑksiər/","extraExplanation":["“boxier”是形容词“boxy（方盒状的、四四方方的）”的比较级，常用于比较两种设计、外形或剪裁：A is boxier than B。","在时尚与产品设计里，“boxy/boxier”常带有“轮廓更硬朗、更有棱角/更宽松直筒”的感觉；语气通常中性，但也可能暗示“不够流线、略显笨重”，要看语境。"]}
{"word":"boxiest","summary":{"en":"“Boxiest” means the most box-shaped or most square-looking.","zh":"“Boxiest”表示“最像盒子、最方正”的外形特征。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Most box-shaped; having the most square, block-like shape compared with others.","zh":"最像盒子的；最方正、最呈方块状的（与其他相比）。"},"examples":[{"en":"Of all the cars in the parking lot, that van is the boxiest.","zh":"在停车场所有车里，那辆厢式车最方正。"},{"en":"This design is the boxiest version of the phone so far, with sharp corners and flat sides.","zh":"到目前为止，这个设计是这款手机最“方”的版本，棱角分明、侧面平直。"}]}],"synonyms":["most box-shaped","most square","most blocky"],"phonetic":"/ˈbɑksiɪst/","extraExplanation":["“boxiest”是形容词“boxy”的最高级形式（boxy → boxier → boxiest），常用来描述汽车、建筑、家具、电子产品等外形很“方”、像盒子一样。口语中也可带一点评价意味：可能是在称赞“实用、空间大”，也可能是在吐槽“笨重、不够流线”。"]}
{"word":"boxiness","summary":{"en":"Boxiness means a box-like shape, or (in audio) a slightly hollow, closed-in sound quality.","zh":"Boxiness 指外形很方正、像盒子；也可指（音频里）略显空洞、发闷、不够开阔的音质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being shaped like a box—having a square or rectangular form with straight sides and clear corners.","zh":"“方方正正、像盒子一样”的特征；指形状呈方形/长方形，边直、角明显。"},"examples":[{"en":"The car’s boxiness makes it look more like a small van than a sedan.","zh":"这辆车的方正外形让它看起来更像小型厢式车，而不是轿车。"},{"en":"Some people love the boxiness of old computers and TVs.","zh":"有些人很喜欢老式电脑和电视那种方方正正的外观。"}]},{"partOfSpeech":"n.","definition":{"en":"In sound, the quality of being “boxy”: somewhat closed-in, hollow, or as if coming from a small room or box.","zh":"（声音）“发闷、空洞、像在盒子/小房间里”的音质；听起来不够开阔。"},"examples":[{"en":"The recording has a bit of boxiness because the microphone was too close to the wall.","zh":"这段录音有点发闷，因为麦克风离墙太近了。"},{"en":"Try reducing the boxiness in your voice by speaking in a more open, relaxed way.","zh":"想减少声音的“闷盒感”，可以用更打开、更放松的方式说话。"}]}],"synonyms":["squareness","rectangularity","box-like shape","hollowness (sound)","closed-in quality (sound)"],"phonetic":"/ˈbɑk.si.nəs/","extraExplanation":["“boxiness”来自形容词“boxy”（方方的；发闷的）+ 名词后缀“-ness”（表示“……的性质/状态”），因此它常用于设计评测（外形是否方正）和音频评测（声音是否发闷）。","相关形容词：boxy（方方的；闷的）。在音频语境中，类似表达还有 “hollow”（空洞的）、“closed-in”（不够开阔的）。"]}
{"word":"boxinesses","summary":{"en":"“Boxinesses” means multiple instances or aspects of a boxy, square appearance.","zh":"“boxinesses”指多个“方正/盒状外观”的特征或不同对象的方正感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being boxy; a square, block-like shape or appearance (plural form of “boxiness”)","zh":"（boxiness 的复数）方正感；盒状/方盒般的外观或形状；块状感"},"examples":[{"en":"The car’s design has a few boxinesses that make it look more rugged than sporty.","zh":"这辆车的设计有几处方正感，让它看起来更偏硬朗而不是运动。"},{"en":"In the sketch, reduce the boxinesses of the shoulders to make the character look friendlier.","zh":"在草图里，把肩部的几处方正感弱化一些，让角色看起来更亲和。"}]}],"synonyms":["squareness","blockiness","angularity"],"phonetic":"/ˈbɑksinəsɪz/","extraExplanation":["“boxinesses”是名词“boxiness”的复数形式。词根来自形容词“boxy（方盒状的）”，加上“-ness（……的性质/状态）”变成名词；再加“-es”构成复数。通常“boxiness”多用作不可数名词（表示整体的方正感），只有在强调“多处不同的方正特征/多个对象的方正感”时，才会用复数“boxinesses”。"]}
{"word":"boxing","summary":{"en":"Boxing most commonly means the sport of fighting with fists wearing gloves; it can also mean packing items into boxes.","zh":"boxing最常指“拳击（运动）”，也可以指“装箱/打包”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sport in which two people fight with their fists (hands) wearing padded gloves, usually in a ring and under rules","zh":"拳击（运动）：两人戴拳套，用拳头在擂台上按规则对打的运动"},"examples":[{"en":"She started boxing to get stronger and more confident.","zh":"她开始练拳击是为了变得更强壮、更自信。"},{"en":"We watched a boxing match on TV last night.","zh":"我们昨晚在电视上看了一场拳击比赛。"}]},{"partOfSpeech":"n.","definition":{"en":"the activity of fighting with fists in the sport of boxing; practicing boxing","zh":"拳击训练/打拳：进行拳击运动的活动或练习"},"examples":[{"en":"Boxing requires speed, balance, and good footwork.","zh":"拳击需要速度、平衡和良好的步法。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of putting things into boxes; packing","zh":"装箱；装盒；打包"},"examples":[{"en":"The boxing of the products is done by machine.","zh":"产品装箱由机器完成。"},{"en":"We spent the afternoon boxing books for the move.","zh":"我们花了一下午把书装箱准备搬家。"}]}],"synonyms":["pugilism","packing"],"phonetic":"/ˈbɑːksɪŋ/","extraExplanation":["“boxing”最常见是“拳击”。在日常语境里如果你说“I do boxing.” 通常指练拳击/上拳击课；如果是包装语境，多会配合“boxing of…”或出现在物流、工厂说明里。","文化提示：英语里“boxing”既指奥运等业余拳击，也可指职业拳击（professional boxing）。语气中性，但谈到比赛时也常和“match / bout / fight”搭配。","相关词：boxer（拳击手）；boxing gloves（拳套）；boxing ring（拳击擂台）；shadowboxing（空击/对空练习）。"]}
{"word":"boxings","summary":{"en":"“Boxings” most often refers to multiple instances of boxing (the sport) or of boxing/packing items; it can also be an old-fashioned word for a light beating.","zh":"“boxings”多指拳击（这项运动）的多次/多场，或多次装箱打包；也可作较旧用法，表示轻微的拍打/挨打。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the sport of fighting with the fists, usually while wearing padded gloves (often in a ring)","zh":"拳击运动（通常戴拳套、在拳台上用拳头对打的运动）"},"examples":[{"en":"He started boxing when he was twelve.","zh":"他十二岁就开始练拳击了。"},{"en":"She watches boxing matches on TV.","zh":"她在电视上看拳击比赛。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of putting something into a box; packaging (often used as “boxing” or “boxing up,” and “boxings” can mean repeated/various instances of this)","zh":"装箱；打包（常说 boxing / boxing up；boxings 可指多次或不同批次的装箱）"},"examples":[{"en":"The boxing of the books took all afternoon.","zh":"把这些书装箱花了一下午。"},{"en":"We scheduled the boxings for Friday and Saturday.","zh":"我们把装箱安排在周五和周六。"}]},{"partOfSpeech":"n.","definition":{"en":"(old-fashioned) a blow or a light beating with the hand; a “boxing” (often as in “a boxing on the ears”)","zh":"（较旧用法）用手打一下；轻微的拍打（如 a boxing on the ears 指“打耳光/扇耳朵”）"},"examples":[{"en":"In old stories, a rude child might get a boxing on the ears.","zh":"在旧故事里，没礼貌的孩子可能会被扇耳光。"}]}],"synonyms":["boxing matches","pugilism","packing","boxing up"],"phonetic":"/ˈbɑksɪŋ/","extraExplanation":["“boxings”通常不是最常见的形式；多数情况下人们会用“boxing”来指拳击运动，或用“boxing/boxing up”来指装箱打包。","“a boxing”表示“挨一顿打/被扇几下”的用法偏老式，现代英语里更常说“a slap”或“a beating”（语气更强）。"]}
{"word":"boxkeeper","summary":{"en":"A boxkeeper is someone who looks after or manages a box, often in older contexts like a cash box or a theater box.","zh":"boxkeeper 指看管或管理“箱子/钱箱/剧院包厢”的人，多见于较旧或特定语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person whose job is to look after, manage, or guard a box (especially in older usage, a money box or a theater “box” for reserved seats)","zh":"看管或管理箱子的人（多为较旧用法，常指钱箱的保管人，或剧院包厢/座位区的管理人员）"},"examples":[{"en":"In the old theater, the boxkeeper checked the names for the reserved box.","zh":"在那家老剧院里，包厢管理员核对预订包厢的名单。"},{"en":"The boxkeeper kept the donations safe until they were counted.","zh":"保管钱箱的人会把捐款妥善保存，直到清点为止。"}]}],"synonyms":["keeper","attendant","cashier","box office clerk"],"phonetic":"/ˈbɑːksˌkiːpər/","extraExplanation":["“boxkeeper/box-keeper”在现代英语里很少见，更多时候会用更具体的说法，比如 theatre box office clerk（售票员/票房工作人员）、ticket seller（售票员）、cashier（收银员）、attendant（服务人员）。","这里的 box 不一定是“纸箱”，也可能指“钱箱（cash box）”或“剧院包厢（a box at a theatre）”，要靠上下文判断。"]}
{"word":"boxless","summary":{"en":"“Boxless” means without a box, especially referring to packaging or shipping.","zh":"“boxless”表示“无盒的”，多用于包装或运输场景。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without a box; not packaged, stored, or shaped in a box (often used for products, shipping, or storage).","zh":"无盒的；不装在盒子里的（常用于商品包装、运输或收纳语境）。"},"examples":[{"en":"The headphones arrived boxless to reduce packaging waste.","zh":"这副耳机是无盒寄达的，以减少包装浪费。"},{"en":"I bought a boxless set, so it was cheaper but had no retail packaging.","zh":"我买的是无盒装套装，所以更便宜，但没有零售包装。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not enclosed or confined; lacking a “boxed-in” structure (less common, more figurative).","zh":"（较少见、偏比喻）不被“框住/圈住”的；不受箱体式结构限制的。"},"examples":[{"en":"Some modern furniture designs aim for a boxless, open look.","zh":"一些现代家具设计追求无“盒感”、更开放的外观。"}]}],"synonyms":["unboxed","not boxed","without packaging","package-free"],"phonetic":"/ˈbɑksləs/","extraExplanation":["“boxless”多见于电商与物流语境：如“boxless shipping（无盒配送）”“boxless return（无盒退货）”，通常指不使用原厂零售盒或减少外层纸箱包装。它不是最常见的日常词，但在环保包装、仓储与二手交易描述中很实用。"]}
{"word":"boxlike","summary":{"en":"“Boxlike” means having the shape or appearance of a box (square/rectangular and often a bit boxy).","zh":"“boxlike”指外形像盒子一样，通常方方正正（有时暗含略显“方/笨重”的感觉）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Shaped like a box; having a square or rectangular, boxy form.","zh":"盒状的；像盒子一样的（通常指方方正正、略显“笨重”的外形）。"},"examples":[{"en":"The old TV had a boxlike shape compared with modern flat screens.","zh":"老式电视的外形很盒状，和现代平板屏幕相比更明显。"},{"en":"The building looks boxlike from far away, with straight lines and sharp corners.","zh":"这栋楼远看很像一个盒子，线条笔直、棱角分明。"},{"en":"She chose a boxlike backpack that could fit her laptop easily.","zh":"她选了一个盒状的背包，能轻松装下笔记本电脑。"}]}],"synonyms":["boxy","rectangular","square","cuboid","blocky"],"phonetic":"/ˈbɑːksˌlaɪk/","extraExplanation":["“boxlike”由 box + -like 构成，-like 表示“像……一样”。它常带有“方正、略显笨拙/不够流线”的感觉，尤其用于形容汽车、建筑、电子产品等外观。","近义表达：boxy（更口语、更常见，也更带“方方的、不太美观”的语气）；rectangular（更中性、更几何）；cuboid（更偏技术/数学）。"]}
{"word":"boxload","summary":{"en":"Boxload means “a boxful” or, informally, “a lot.”","zh":"boxload 指“一箱的量”，口语里也可表示“很多”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large amount that would fill a box or carton; by extension, a lot of something (often informal).","zh":"一箱的量；引申为“很多、相当多”（常为口语）。"},"examples":[{"en":"We ordered a boxload of books for the new class.","zh":"我们为新班级订了一箱书。"},{"en":"She has a boxload of questions about the homework.","zh":"她对作业有一大堆问题。"}]},{"partOfSpeech":"n.","definition":{"en":"A quantity that fills a shipping container, crate, or boxcar; a full load for transport (less common, logistics context).","zh":"（运输/物流语境）装满一个集装箱、木箱或货运车厢的一整批货。"},"examples":[{"en":"The warehouse received a boxload of spare parts this morning.","zh":"仓库今天上午收到了整整一批（装满一箱/一柜）的备件。"},{"en":"They shipped a boxload of produce to the city markets.","zh":"他们把一整批（装满运输箱的）农产品运到城市市场。"}]}],"synonyms":["boxful","a lot","a large amount","a ton (informal)","a truckload (informal)"],"phonetic":"/ˈbɑksˌloʊd/","extraExplanation":["“boxload”由 box（箱子）+ load（载量/一批货）构成，强调“多到可以装满一箱”。日常口语里常用来夸张表达“很多”，不一定真的是“一个箱子的体积”。","在美式英语中更常见的类似说法有“a truckload of … / a carload of … / a boatload of …”，都是用运输工具来表示“很多”。"]}
{"word":"boxmaker","summary":{"en":"A boxmaker is someone whose work is making boxes, especially for packaging or shipping.","zh":"boxmaker 指制作箱子的人，尤指从事包装或运输用箱子制作的工人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who makes boxes, especially as a job (for shipping, storage, or packaging)","zh":"做箱子的人；制箱工（尤指以制作运输、储存或包装用箱子为职业的人）"},"examples":[{"en":"The boxmaker built sturdy wooden crates for the winery.","zh":"这位制箱工为酒庄制作了结实的木箱。"},{"en":"They hired a local boxmaker to create custom gift boxes.","zh":"他们雇了一位本地制箱工来制作定制礼盒。"}]}],"synonyms":["box maker","carton maker","crate maker","packaging worker"],"phonetic":"/ˈbɑːksˌmeɪkər/","extraExplanation":["“boxmaker”是由“box（箱子）+ maker（制造者）”构成的复合名词。现代语境中，这个职业常与“packaging worker（包装工）”“carton maker（纸箱制作工）”“crate maker（木箱制作工）”等更具体的说法互换使用；材料不同（纸板/木材/塑料）时，常会用更明确的词来描述。"]}
{"word":"boxmaking","summary":{"en":"Boxmaking means making boxes, either as a craft or as an industry.","zh":"Boxmaking 指“制作盒子”，可指手工技艺/活动，也可指盒子制造行业。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity or craft of making boxes (especially cardboard or wooden boxes), often as a job or hobby","zh":"制盒；做盒子的工艺或工作（尤指纸盒或木盒）"},"examples":[{"en":"She learned boxmaking to create custom gift boxes for her small business.","zh":"她学会了制盒，好为她的小生意制作定制礼品盒。"},{"en":"The museum ran a weekend workshop on traditional boxmaking techniques.","zh":"博物馆在周末开设了传统制盒技法的工作坊。"}]},{"partOfSpeech":"n.","definition":{"en":"the business or industry of producing boxes and packaging","zh":"盒子制造业；包装盒生产行业"},"examples":[{"en":"Boxmaking is closely tied to the growth of e-commerce and shipping.","zh":"制盒行业与电商和物流的发展密切相关。"},{"en":"He works in boxmaking, designing packaging for electronics.","zh":"他在盒子制造行业工作，为电子产品设计包装。"}]}],"synonyms":["box-making","making boxes","box manufacture","packaging production"],"phonetic":"/ˈbɑksˌmeɪkɪŋ/","extraExplanation":["“boxmaking”通常写作一个复合名词（box + making），表示“做盒子”这类活动或行业。日常口语中也常用更具体的说法，如“making boxes / box-making”。","在工艺语境里，boxmaking常与装帧、纸艺（paper craft）、木工（woodworking）、包装设计（packaging design）等领域相关。"]}
{"word":"boxman","summary":{"en":"A boxman is most commonly a casino supervisor at table games; it can also mean (informally) a boxer, or less commonly someone who works with boxes.","zh":"boxman 最常指赌场桌上游戏的监台/主管；也可非正式指拳击手，较少见时指从事装箱、搬运或处理箱子的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a casino employee who supervises one or more table games (especially blackjack), watches the dealers, and helps handle disputes or big payouts","zh":"（赌场）台桌主管/监台：负责监督一张或多张桌上游戏（尤指二十一点），观察荷官操作，并协助处理争议或大额赔付"},"examples":[{"en":"If you have a question about the rules, ask the boxman at the blackjack table.","zh":"如果你对规则有疑问，可以问二十一点桌的监台（boxman）。"},{"en":"The dealer called the boxman to confirm the payout.","zh":"荷官叫来监台确认赔付金额。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) a man who boxes; a boxer","zh":"（非正式）拳击手；打拳的人"},"examples":[{"en":"He trained like a pro boxman, running every morning.","zh":"他像职业拳击手一样训练，每天早上跑步。"},{"en":"That young boxman has quick footwork.","zh":"那个年轻拳击手步伐很快。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a man whose job involves making, carrying, or handling boxes (for shipping or storage)","zh":"（较少见）做箱子的人；搬运/处理包装箱的人（运输或仓储相关）"},"examples":[{"en":"At the warehouse, the boxman labeled and stacked the cartons.","zh":"在仓库里，负责装箱的人给纸箱贴标签并码放。"}]}],"synonyms":["floor supervisor","pit boss","table-game supervisor","boxer"],"phonetic":"/ˈbɑksmæn/","extraExplanation":["在赌场语境里，box 指的是桌上游戏的“钱箱/筹码箱”（装筹码与现金的安全盒子），boxman 原本就是“看管钱箱的人”，后来引申为负责监督桌面运营的主管职位。不同赌场也可能称为 floor supervisor、pit boss（更高层或更大范围）。"]}
{"word":"boxplot","summary":{"en":"A statistical chart that summarizes data with quartiles, a median, and spread, often highlighting outliers.","zh":"用四分位数、中位数和离散程度来概括数据、并常标出离群值的统计图表。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of chart used in statistics that summarizes a dataset using the median, quartiles, and spread, often showing outliers.","zh":"一种统计图表，用中位数、四分位数和离散程度来概括一组数据，常用于显示离群值。"},"examples":[{"en":"The boxplot shows that most scores are between 70 and 85, with one high outlier.","zh":"箱线图显示大多数分数在70到85之间，并且有一个偏高的离群值。"},{"en":"Use a boxplot to compare the distribution of heights for two different classes.","zh":"用箱线图比较两个不同班级身高数据的分布。"}]}],"synonyms":["box plot","box-and-whisker plot","box-and-whisker diagram"],"phonetic":"/ˈbɑksˌplɑt/","extraExplanation":["“boxplot”也常写作“box plot”，中文常叫“箱线图”或“盒须图”。","箱线图的基本组成：箱体通常表示从第一四分位数(Q1)到第三四分位数(Q3)；箱体中的线表示中位数(median)；“须”(whiskers)常延伸到非离群值范围内的最小/最大值；超出范围的点常被标为离群值(outliers)。","它特别适合用来快速比较不同组数据的分布（例如两家店的等待时间、不同班级的考试成绩），比只看平均值更能体现“分散程度”和“偏态”。"]}
{"word":"boxroom","summary":{"en":"A boxroom is a small room used for storage; it can also mean a very small bedroom (mainly British English).","zh":"boxroom 指小型储物间；也可指很小的卧室（主要为英式英语用法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small room used for storing things; a storage room (especially in British English).","zh":"（尤英式英语）杂物间；储物间；小仓房"},"examples":[{"en":"We keep the suitcases and winter coats in the boxroom.","zh":"我们把行李箱和冬季外套放在杂物间里。"},{"en":"The apartment is tiny, but it has a boxroom for extra storage.","zh":"这套公寓很小，但有一个杂物间可以额外储物。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, especially British English) a very small bedroom, often only big enough for a single bed.","zh":"（非正式，尤英式英语）很小的卧室（通常只放得下一张单人床）"},"examples":[{"en":"They turned the boxroom into a child’s bedroom.","zh":"他们把那间小卧室改成了儿童房。"},{"en":"I had the boxroom when I first moved in—small, but quiet.","zh":"我刚搬进来时住的是那间小卧室——很小，但很安静。"}]}],"synonyms":["storage room","storeroom","closet","utility room","small bedroom"],"phonetic":"/ˈbɑːksˌruːm/","extraExplanation":["“boxroom”更常见于英式英语；在美式英语里，人们更常说storage room / closet / utility room。","这个词通常让人联想到“放盒子（boxes）的房间”，强调空间小、功能偏储物；当指卧室时，常带一点“将就、很挤”的语气。"]}
{"word":"boxship","summary":{"en":"A boxship is a container ship built to carry large stacks of shipping containers.","zh":"boxship 指用于运输大量集装箱的集装箱船。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cargo ship designed to carry standard shipping containers (a container ship).","zh":"（装运集装箱的）箱式货船；集装箱船。"},"examples":[{"en":"The port expanded its terminals to handle more boxships.","zh":"该港口扩建了码头，以处理更多的集装箱船。"},{"en":"A boxship arrived overnight, bringing containers from Asia.","zh":"一艘集装箱船在夜间抵港，运来了来自亚洲的集装箱。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) any large, boxy-looking ship or vehicle, especially in casual talk.","zh":"（非正式）外形方方正正的大型船只或交通工具（口语用法）。"},"examples":[{"en":"From far away, the freighter looked like a slow-moving boxship.","zh":"从远处看，那艘货轮像一艘缓慢移动的“方盒子船”。"}]}],"synonyms":["container ship","containership","cargo ship (broader)"],"phonetic":"ˈbɑkˌʃɪp","extraExplanation":["“boxship”主要是口语/新闻语境里对“container ship（集装箱船）”的称呼，强调船体甲板上堆叠的集装箱像一排排盒子（boxes）。","与普通“cargo ship”相比，集装箱船通常按标准化集装箱尺寸装卸，常见于全球供应链、港口物流、海运新闻等话题。"]}
{"word":"boxships","summary":{"en":"Boxships are large container cargo ships (plural).","zh":"boxships 指大型集装箱货轮（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Large cargo ships with a box-like shape, especially container ships that carry goods in standard metal containers (the plural of “boxship”).","zh":"箱式货船；（尤指）集装箱货轮（“boxship”的复数，指外形方正、用集装箱运输货物的大型货船）。"},"examples":[{"en":"After the storm, several boxships waited offshore until the port reopened.","zh":"暴风雨过后，几艘集装箱货轮在近海等待港口重新开放。"},{"en":"These boxships move everything from clothes to electronics across the Pacific.","zh":"这些集装箱货轮把从衣服到电子产品的各种货物运过太平洋。"}]}],"synonyms":["container ships","cargo ships","freighters"],"phonetic":"/ˈbɑkʃɪps/","extraExplanation":["“boxship”在新闻与航运语境里常用来指“集装箱船/集装箱货轮”，因为船体与甲板上堆叠的集装箱看起来像一排排大盒子。日常口语里更常见的说法是“container ship”。","这是可数名词：one boxship / two boxships。拼写上一般写作一个词“boxship”，复数加 -s。"]}
{"word":"boxthorn","summary":{"en":"Boxthorn is a thorny Lycium shrub, often used as a hedge and sometimes producing goji (wolfberry) fruit.","zh":"Boxthorn 指枸杞属的多刺灌木，常作树篱，有些会结出枸杞（wolfberry/goji）果实。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a thorny shrub (Lycium), especially one that produces goji/wolfberries; often planted as a hedge.","zh":"枸杞属的多刺灌木；尤指会结出枸杞/狼莓（goji, wolfberry）的品种，常被用作树篱植物。"},"examples":[{"en":"A boxthorn hedge grows quickly but can be very prickly.","zh":"枸杞灌木做的树篱长得很快，但刺很多。"},{"en":"In some regions, boxthorn produces small red berries known as goji or wolfberries.","zh":"在一些地区，枸杞灌木会结出被称为枸杞或狼莓的小红果。"}]}],"synonyms":["goji","wolfberry","Lycium"],"phonetic":"/ˈbɑkstɔrn/","extraExplanation":["“boxthorn”常见于植物学或园艺语境，指Lycium（枸杞属）的一类带刺灌木。日常英语里更常听到的是“goji (berry)”或“wolfberry”。在中文语境中，人们通常直接说“枸杞/枸杞子”。","词里“box-”不是指“盒子”，而是来自“box (tree)”（黄杨）这种常用作树篱的植物；“boxthorn”大意是“像黄杨树篱一样可做篱笆的带刺灌木”。"]}
{"word":"boxthorns","summary":{"en":"Boxthorns are thorny *Lycium* shrubs, often used for hedges and sometimes bearing small red berries.","zh":"Boxthorns 指枸杞属的带刺灌木，常作篱笆，有时结小红果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a thorny shrub in the genus *Lycium* (nightshade family), often grown as a hedge; some kinds produce small red berries (related to goji/wolfberry).","zh":"枸杞属（茄科）的一种多刺灌木，常被种作篱笆；有些种类会结小红果（与“枸杞/狼莓”相关）。"},"examples":[{"en":"In some dry regions, boxthorns are planted as living fences to keep animals out.","zh":"在一些干旱地区，人们把枸杞属的带刺灌木种成“活篱笆”，用来挡住动物。"},{"en":"The path was lined with boxthorns, so we walked carefully to avoid the thorns.","zh":"小路两旁长着带刺的枸杞属灌木，我们只好小心走，免得被刺扎到。"}]}],"synonyms":["boxthorn","Lycium","wolfberry","goji"],"phonetic":"/ˈbɑksˌθɔrnz/","extraExplanation":["“boxthorn”通常指枸杞属（*Lycium*）的灌木；在不同国家可能对应不同物种，例如南非常见的 *Lycium ferocissimum*（常作篱笆且可能成为入侵植物），而与食用“枸杞（goji）”相关的多是 *Lycium barbarum* / *Lycium chinense*。日常阅读中见到 boxthorn(s) 时，多半强调“带刺灌木/篱笆植物”的用途与环境适应性，而不一定特指可食用枸杞。"]}
{"word":"boxtop","summary":{"en":"Boxtop means the top of a box, or (in the U.S.) a packaging label/coupon used for school fundraising.","zh":"Boxtop 指盒子的顶部/盒盖；在美国也可指用于学校筹款的包装标签/优惠标识（如 Box Tops 项目）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the top lid or upper flap of a box (especially a product package)","zh":"盒子的顶部；（尤指商品包装的）盒盖/上盖"},"examples":[{"en":"Please open the box top carefully so you don’t tear it.","zh":"请小心打开盒盖，别把它撕破。"},{"en":"The instructions are printed on the box top.","zh":"说明印在盒子的顶部。"}]},{"partOfSpeech":"n.","definition":{"en":"(U.S.) a label or coupon cut from product packaging, especially for the “Box Tops for Education” school-fundraising program","zh":"（美国）从商品包装上剪下的标签/优惠标识（常指用于“Box Tops for Education”学校募捐项目的盒顶标识）"},"examples":[{"en":"Our school collects Box Tops to raise money for supplies.","zh":"我们学校收集 Box Tops 来为学习用品筹款。"},{"en":"Don’t throw that away—the boxtop can be scanned for points.","zh":"别扔掉——这个 boxtop 可以扫码积分。"}]}],"synonyms":["box top","lid","top flap","package label","coupon"],"phonetic":"/ˈbɑks ˌtɑp/","extraExplanation":["“boxtop”也常写作“box top”（分开写更常见）。在美国文化里，Box Tops for Education 是一个面向学校的筹款项目：家长从食品等包装上剪下标识或用手机扫码，学校可换取资金/积分。"]}
{"word":"boxtops","summary":{"en":"“Boxtops/box tops” can mean the tops of boxes, or (in the US) the Box Tops fundraising labels/codes collected to help schools.","zh":"“boxtops/box tops”可以指盒子的顶部；也可指（美国）为学校筹款而收集的 Box Tops 商品标签/兑换码。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the top part (lid or upper surface) of a box; the top flaps of a cardboard box","zh":"盒子的顶部（盖子或上表面）；纸箱的上盖/上方折页"},"examples":[{"en":"Close the box tops tightly so nothing falls out.","zh":"把箱子的上盖盖紧，这样东西就不会掉出来。"},{"en":"The box tops were damaged during shipping.","zh":"运输过程中箱子的顶部被压坏了。"}]},{"partOfSpeech":"n.","definition":{"en":"(US) product labels or codes from the “Box Tops” fundraising program, collected to earn money for schools","zh":"（美国）“Box Tops”校园募捐项目的商品标签或兑换码，用来为学校筹款"},"examples":[{"en":"Our class collects Box Tops to support the school library.","zh":"我们班收集 Box Tops 来支持学校图书馆。"},{"en":"Don’t throw that away—the Box Tops code is still on it.","zh":"别扔掉——上面还有 Box Tops 的兑换码。"}]}],"synonyms":["box lids","package tops","(fundraising) Box Tops labels","(fundraising) Box Tops codes"],"phonetic":"/bɑks tɑps/","extraExplanation":["在美国，“Box Tops for Education”曾经常见于零食、麦片等包装上：家长剪下包装上的小标识交给学校，学校再兑换成现金或物资。近年来很多产品改为在App里扫码/输入兑换码，不一定真的“剪盒子顶部”。"]}
{"word":"boxtree","summary":{"en":"A box tree is an evergreen shrub (Buxus) commonly used for hedges and topiary.","zh":"boxtree（更常写作box tree）指黄杨，一种常用于绿篱和造型修剪的常绿灌木。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an evergreen shrub (genus Buxus) with small glossy leaves, often used for hedges and shaping into topiary","zh":"黄杨（黄杨属植物），常绿灌木，叶小而有光泽，常用于绿篱或修剪成造型（绿雕）"},"examples":[{"en":"They planted box trees along the walkway to form a neat hedge.","zh":"他们沿着小路种了黄杨，做成整齐的绿篱。"},{"en":"A box tree can be clipped into balls, cones, or other topiary shapes.","zh":"黄杨可以修剪成球形、圆锥形或其他造型。"},{"en":"In the old garden, the box trees stayed green even in winter.","zh":"在那座老花园里，黄杨即使到冬天也依然常绿。"}]}],"synonyms":["box tree","boxwood","buxus"],"phonetic":"/ˈbɑkˌstri/","extraExplanation":["“boxtree”更常见的拼写是“box tree”（分开写）；也有人写作“boxtree”，含义相同。","黄杨在英美园林里很常见，尤其用于做边界绿篱（hedge）和造型修剪（topiary）。在文学或描写花园的语境中，box tree常带有“传统、整洁、古典庭园”的感觉。","注意区分：box（盒子）是普通名词，但box tree指植物。某些黄杨品种对宠物可能有毒，园艺种植时可留意安全提示。"]}
{"word":"boxty","summary":{"en":"Boxty is a traditional Irish potato pancake or dumpling made with potatoes and flour.","zh":"Boxty 是爱尔兰传统的土豆饼或土豆团子，用土豆和面粉制作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Irish potato pancake or dumpling, usually made from grated raw potato mixed with mashed potato and flour, then fried or baked","zh":"爱尔兰传统土豆饼/土豆团子（常用生土豆丝与土豆泥、面粉混合后煎或烤）"},"examples":[{"en":"We ordered boxty with smoked salmon for brunch.","zh":"我们早午餐点了烟熏三文鱼配波克斯提土豆饼。"},{"en":"Boxty is often served with butter or sour cream.","zh":"波克斯提土豆饼常配黄油或酸奶油一起吃。"},{"en":"She learned to make boxty from her grandmother’s recipe.","zh":"她跟着外祖母的食谱学会了做波克斯提。"}]}],"synonyms":["Irish potato pancake","potato cake"],"phonetic":"/ˈbɑksti/","extraExplanation":["Boxty（也写作 bacstaí）与爱尔兰部分地区（尤其是北中部，如 Leitrim、Cavan、Donegal 一带）的家常饮食传统有关。常见做法有：煎成薄饼（类似 potato pancake）、做成较厚的面饼、或做成“土豆团子/饺子状”的水煮版本（不同家庭做法差异很大）。","它和 latke（犹太土豆饼）或 hash brown（美式薯饼）在“用土豆做煎饼”这一点上相似，但 boxty 常把生土豆与熟土豆混合，因此口感更有弹性、也更湿润。"]}
{"word":"boxwallah","summary":{"en":"A boxwallah is an old South Asian term for a merchant or traveling salesman.","zh":"boxwallah 是一个较旧的南亚用语，指商人或走街串巷的推销员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in South Asia, especially in colonial-era English) a merchant or traveling salesman, often one who sells goods carried in boxes or cases.","zh":"（南亚用语，尤指殖民时期英语）商人／推销员，常指携带箱子或货箱走街串巷卖货的人。"},"examples":[{"en":"In the old novel, a boxwallah visits the village to sell cloth and small household goods.","zh":"在那部旧小说里，一个boxwallah来到村里卖布料和一些小日用品。"},{"en":"His grandfather worked as a boxwallah, traveling by train from town to town.","zh":"他祖父曾是个boxwallah，坐火车在城镇之间奔波做买卖。"}]}],"synonyms":["merchant","trader","salesman","peddler"],"phonetic":"/ˈbɑːksˌwɑːlə/","extraExplanation":["这是一个带有历史色彩的词，常见于英属印度时期的英语（Anglo-Indian English）或描写该时期的文学作品中。现代日常英语里很少用，通常带有“旧时代/殖民地语境”的风格。","词尾“-wallah/ -wala”来自印地语/乌尔都语，表示“从事某事的人/卖某种东西的人”（类似“卖……的人/……从业者”）。例如：chaiwallah（卖茶的人）、rickshaw-wallah（黄包车夫/三轮车夫）。","有时它也可更宽泛地指“做生意的人/商行职员”，但最典型的画面是携货上门兜售的推销员。"]}
{"word":"boxwood","summary":{"en":"Boxwood is a common evergreen hedge plant, and it can also mean the hard wood used for fine carving.","zh":"Boxwood 指常见的常绿绿篱植物“黄杨”，也可指用于精细雕刻的“黄杨木”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An evergreen shrub or small tree (genus Buxus) with small, glossy leaves, often planted as hedges and shaped into topiary.","zh":"黄杨（属名 Buxus）；一种常绿灌木或小乔木，叶子小而有光泽，常用作绿篱或修剪成造型（绿雕/立体造景）。"},"examples":[{"en":"They planted boxwood along the walkway to form a neat hedge.","zh":"他们在人行道旁种了黄杨，做成整齐的绿篱。"},{"en":"The gardener trimmed the boxwood into round shapes.","zh":"园丁把黄杨修剪成圆球形。"}]},{"partOfSpeech":"n.","definition":{"en":"The hard, pale wood from the boxwood tree, traditionally used for fine carving and wood engraving.","zh":"黄杨木；质地坚硬、颜色较浅，传统上用于精细雕刻或木刻版画。"},"examples":[{"en":"The artist used boxwood for detailed carving because it holds fine lines.","zh":"艺术家用黄杨木做精细雕刻，因为它能保留细致的线条。"},{"en":"Old printing blocks were often made from boxwood.","zh":"旧时的印刷木版常用黄杨木制作。"}]}],"synonyms":["buxus","hedge plant","evergreen shrub"],"phonetic":"/ˈbɑkˌswʊd/","extraExplanation":["园艺语境里，boxwood 常让人联想到“正式花园”（formal garden）和“修剪艺术”（topiary）。在英语文化中，它常被用来营造整洁、传统、甚至有点“庄园风”的景观氛围。","注意：boxwood 在部分地区与“黄杨枯枝病”（boxwood blight）等病害相关；如果你在阅读园艺文章，可能会看到相关的养护与防治建议。"]}
{"word":"boxwoods","summary":{"en":"Boxwoods are boxwood shrubs/trees commonly used as hedges; the word can also mean the hard wood from the boxwood tree.","zh":"Boxwoods 指黄杨（常用作绿篱的常绿灌木/小乔木）；也可指黄杨木这种坚硬木材。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"evergreen shrubs or small trees (boxwood plants) often used for hedges and garden borders","zh":"黄杨（常绿灌木或小乔木），常用于绿篱、花园边界"},"examples":[{"en":"They planted boxwoods along the walkway to create a neat border.","zh":"他们在人行道旁种了黄杨，做出整齐的边界。"},{"en":"The old house is surrounded by tall boxwoods.","zh":"那栋老房子四周围着高高的黄杨。"}]},{"partOfSpeech":"n.","definition":{"en":"the hard, fine-grained wood of the boxwood tree, valued for carving and small tools","zh":"黄杨木（质地坚硬、纹理细密），常用于雕刻和制作小器具"},"examples":[{"en":"The handle was made from boxwood for a smooth, durable finish.","zh":"手柄用黄杨木制成，手感光滑且耐用。"}]}],"synonyms":["boxwood","box","hedge (context)","shrub (general)"],"phonetic":"/ˈbɑksˌwʊd/","extraExplanation":["“boxwood/boxwoods”在园艺语境里很常见，尤其指修剪成整齐形状的绿篱（hedge）或造型树（topiary）。在英美传统庭园里，黄杨常用来做规则、对称的边界线条，给人“整洁、经典、老派庭院”的感觉。","日常口语里更常说“boxwood hedge / boxwood bushes”。“boxwoods”多见于描述一片或一排黄杨（复数）。"]}
{"word":"boxwork","summary":{"en":"Boxwork is usually a honeycomb-like mineral lattice found on cave walls; less commonly it can mean a box-like support framework in mining/construction.","zh":"Boxwork 通常指洞穴墙面上的蜂窝状矿物网格结构；较少见时也可指采矿/施工中的箱形支撑框架。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a honeycomb-like pattern of thin mineral “ribs” (often calcite or dolomite) that sticks out from a cave wall or ceiling after the softer rock around it has worn away","zh":"（洞穴中）由细薄矿物“肋条”组成的蜂窝状/网格状结构（常为方解石或白云石）；周围较软岩石被侵蚀后，这些较硬的脉状部分凸显出来"},"examples":[{"en":"The cave walls were covered with boxwork that looked like a natural lattice.","zh":"洞壁上布满了箱形网格状的结构，看起来像天然格栅。"},{"en":"Our guide pointed out boxwork formations near the ceiling.","zh":"向导指给我们看天花板附近的箱状网格（boxwork）结构。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a framework of box-like supports, especially timbering used in mining or construction","zh":"（较少见）箱形支撑框架；尤指采矿或施工中使用的木支护结构"},"examples":[{"en":"Old records describe boxwork used to support the mine passages.","zh":"旧档案记载曾用箱形支架支撑矿道。"}]}],"synonyms":["honeycomb structure","mineral lattice","cave boxwork","framework","timbering"],"phonetic":"/ˈbɑksˌwɝk/","extraExplanation":["在洞穴地质里，boxwork 通常指“脉状矿物先沉积→周围岩石后被溶蚀/风化→只剩较硬的脉体形成网格”的结果。它常出现在石灰岩洞穴中，外观像盒子边框或蜂巢的骨架。作为旅游洞穴解说词时，常与 cave formations（洞穴沉积/地貌）一起出现。"]}
{"word":"boxy","summary":{"en":"Boxy means shaped like a box—square and angular; it can also describe clothes that fit loosely and look rectangular.","zh":"boxy 指“像盒子一样方正、有棱角的”；也可指衣服版型宽直、不贴身、呈长方形。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a shape like a box, with straight sides and right angles; square-looking rather than rounded.","zh":"呈盒状的；四四方方的；线条硬朗、棱角分明的。"},"examples":[{"en":"The car has a boxy design from the 1980s.","zh":"这辆车有一种80年代常见的方正外形。"},{"en":"She prefers boxy jackets because they look structured.","zh":"她更喜欢版型方正的夹克，因为看起来更挺括。"},{"en":"The room felt boxy and cramped with so much furniture.","zh":"家具太多，让房间显得方方正正又拥挤。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of a person’s body shape or clothing fit) Broad and rectangular, not shaped closely to the body.","zh":"（指身形或衣服版型）宽直、像长方形，不贴身、不显曲线。"},"examples":[{"en":"This sweater is warm, but it looks a bit boxy on me.","zh":"这件毛衣很暖和，但穿在我身上看起来有点宽直、没腰身。"},{"en":"A boxy cut can feel comfortable and casual.","zh":"方直的剪裁会让人感觉舒适随性。"}]}],"synonyms":["square","angular","blocky","rectangular","squared-off"],"phonetic":"/ˈbɑksi/","extraExplanation":["“boxy”来自名词“box（盒子）+ -y（表示具有……特征的）”，常用来描述汽车外观、房间布局、建筑轮廓或服装版型。","语气通常是中性；在审美语境里有时带一点“过于方正、不够流线”的暗示，但也可能是“复古、硬朗、结构感强”的褒义。"]}

