{"word":"boy","summary":{"en":"“Boy” most commonly means a male child, and it can also mean a son or, informally, a group of male friends (“the boys”).","zh":"“boy”最常指“男孩”，也可指“儿子”，或在非正式语境中指一群男性朋友（如“the boys”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male child; a young male person","zh":"男孩；小男生"},"examples":[{"en":"The boy is playing soccer in the park.","zh":"那个男孩正在公园里踢足球。"},{"en":"She has two boys and one girl.","zh":"她有两个儿子和一个女儿。"}]},{"partOfSpeech":"n.","definition":{"en":"a son (used by parents or family)","zh":"儿子（家人称呼用）"},"examples":[{"en":"My boy is starting school this year.","zh":"我儿子今年要开始上学了。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) a man; a male friend (often used in phrases like “the boys”)","zh":"（非正式）男人；男性朋友（常用于“the boys”等说法）"},"examples":[{"en":"I’m going out with the boys tonight.","zh":"我今晚要和哥们儿出去。"},{"en":"He’s one of the boys at work.","zh":"他在公司里跟大家（男同事们）很合得来。"}]}],"synonyms":["male child","lad","son","kid (informal)"],"phonetic":"/bɔɪ/","extraExplanation":["“boy”既可以指年龄上的“男孩”，也常被用来亲昵地称呼“儿子”。但在某些语境里用“boy”称呼成年男性可能显得不礼貌或带有轻视意味，尤其对陌生人或在正式场合。","固定搭配：boyfriend（男朋友）；boyhood（童年/少年时代）；the boys（哥们儿/男同事们）。"]}
{"word":"boyang","summary":{"en":"“Boyang” is usually the romanized spelling of a Chinese proper name; its exact meaning depends on the Chinese characters.","zh":"“Boyang”通常是中文专有名词（多为姓名等）的罗马拼写，确切含义取决于对应汉字。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a romanized (pinyin-style) spelling of a Chinese name, often used as a personal name (given name or surname + given name), a brand name, or a place name depending on context.","zh":"“boyang”常见为中文姓名/地名/品牌名的罗马拼写（类似拼音的写法），具体指代需结合上下文判断。"},"examples":[{"en":"Boyang is my classmate’s Chinese name, written in English letters.","zh":"Boyang 是我同学的中文名字，用英文拼写出来。"},{"en":"Please ask Boyang to email the document to the team.","zh":"请让 Boyang 把文件发邮件给团队。"},{"en":"I’m not sure which Boyang you mean—can you share the Chinese characters?","zh":"我不确定你指的是哪个 Boyang——可以提供汉字吗？"}]}],"phonetic":"/boʊˈjɑːŋ/","extraExplanation":["“Boyang”本身不是常见的英语词汇，更像是中文转写。不同汉字会对应不同含义与读音细节，例如：柏杨（著名作家笔名）、博洋（常见人名/品牌用字）、伯阳（古风人名用字）等。若你告诉我对应的汉字或语境（人名/地名/公司名），我可以给出更准确的解释与用法建议。"]}
{"word":"boyar","summary":{"en":"A high-ranking noble in historical Russia, often a powerful landowner and adviser to the ruler.","zh":"俄国历史上地位很高的贵族（大地主与重臣/顾问）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A member of the highest-ranking noble class in medieval and early modern Russia (and some neighboring Eastern European regions), serving as a powerful landowning aristocrat and adviser to the ruler.","zh":"（中世纪至近代早期俄罗斯及部分东欧地区的）波雅尔/博亚尔贵族：最高等级的贵族阶层成员，通常是大地主，并担任统治者的重臣与顾问。"},"examples":[{"en":"The boyars held large estates and often influenced the tsar’s decisions.","zh":"波雅尔贵族拥有大片领地，常常影响沙皇的决策。"},{"en":"In historical novels, a boyar may appear as a wealthy noble in fur-trimmed robes.","zh":"在历史小说里，波雅尔贵族常被描写成穿着镶毛皮长袍的富有贵族。"}]}],"synonyms":["noble","aristocrat","lord"],"phonetic":"/ˈbɔɪ.ɑr/","extraExplanation":["“boyar”常见于俄国史语境，尤其是莫斯科大公国与早期沙皇俄国。彼得大帝（Peter the Great）推行改革后，传统“boyar”阶层的政治地位逐渐被新式官僚与“官阶表”（Table of Ranks）体系取代。","词源上与斯拉夫语族中表示“贵族/显贵”的词有关；英文里多用于历史叙述、学术写作或历史题材文学。"]}
{"word":"boyard","summary":{"en":"Boyard (also spelled boyar) means a high-ranking noble in old Russia and nearby regions.","zh":"boyard（也写作 boyar）指旧俄罗斯及周边地区的高级贵族。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Historical) A member of the high-ranking noble class in medieval Russia and some Eastern European regions, especially before the rise of the Russian tsars’ centralized power.","zh":"（历史）博雅尔贵族；中世纪俄罗斯及部分东欧地区的高级贵族阶层成员，尤指沙皇集权加强之前。"},"examples":[{"en":"The boyards advised the ruler and controlled large estates.","zh":"博雅尔贵族会向统治者进言，并掌控大片领地。"},{"en":"In some stories, a boyard appears as a powerful landowner with political influence.","zh":"在一些故事里，博雅尔贵族常被描写成有政治影响力的大地主。"}]}],"synonyms":["boyar","noble","aristocrat"],"phonetic":"/ˈbɔɪɑr/","extraExplanation":["“boyard”常被视为“boyar”的较少见拼写（或旧译）。最常见的英语形式是 boyar。","博雅尔贵族在俄语历史语境中常与“贵族会议/杜马（Duma）”等制度相关；彼得大帝时期改革后，其传统势力逐渐被削弱。"]}
{"word":"boyardism","summary":{"en":"Boyardism means the dominance or political influence of boyars (Eastern European nobles).","zh":"Boyardism 指波雅尔贵族（东欧高级贵族）的主导影响或贵族寡头式统治。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the influence, power, or political system dominated by boyars (high-ranking nobles), especially in Eastern Europe (such as medieval Russia or Romania).","zh":"由“波雅尔”（东欧的高级贵族）主导的影响力、权力或政治体制，尤指中世纪俄罗斯或罗马尼亚等地的贵族寡头统治。"},"examples":[{"en":"Some historians describe the period as one of boyardism, when noble families controlled key decisions.","zh":"一些历史学者把这一时期描述为“波雅尔贵族统治”，因为贵族家族掌控了关键决策。"},{"en":"Reforms were introduced to reduce boyardism and strengthen central authority.","zh":"当时推行改革以削弱贵族寡头势力，并加强中央集权。"}]}],"synonyms":["aristocratic rule","oligarchy","noble domination"],"phonetic":"/ˈbɔɪ.ɑr.dɪ.zəm/","extraExplanation":["“Boyar/波雅尔”是东欧历史中的贵族阶层称谓，常见于基辅罗斯、莫斯科公国以及罗马尼亚的瓦拉几亚/摩尔达维亚等地区。因此“boyardism”多出现在历史写作里，用来概括“贵族集团政治”“寡头式的贵族把持”。","拼写与构词：boyar + -ism（表示“主义/制度/倾向”）。在现代英语中较少用于日常表达，更多见于学术或历史语境。"]}
{"word":"boyardom","summary":{"en":"Boyardom means the rank or collective class of boyars—high nobles in historical Russia and nearby regions.","zh":"boyardom 指历史上俄罗斯及周边地区波雅尔（高级贵族）的阶层、地位或整体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The social rank, class, or collective body of boyars (high-ranking nobles), especially in medieval and early modern Russia and Eastern Europe.","zh":"波雅尔阶层；波雅尔贵族的地位、阶级或整体（尤指中世纪及近代早期的俄罗斯与东欧）。"},"examples":[{"en":"The tsar tried to limit the power of the boyardom.","zh":"沙皇试图限制波雅尔贵族阶层的权力。"},{"en":"Conflicts between the monarchy and the boyardom shaped early Russian politics.","zh":"君主制与波雅尔阶层之间的冲突塑造了早期俄罗斯的政治。"}]}],"synonyms":["the boyar class","nobility","aristocracy"],"phonetic":"/ˈbɔɪərdəm/","extraExplanation":["“Boyar”源自斯拉夫语系，通常指俄罗斯、保加利亚、瓦拉几亚等地区的世袭大贵族或高级封建领主；“-dom”表示“领域/状态/群体”（如 kingdom, freedom）。因此 boyardom 常指“波雅尔这一群体/制度/阶层”。","这个词多用于历史叙述与学术写作，带有明确的时代与地域色彩；现代日常英语里很少用到。"]}
{"word":"boyards","summary":{"en":"“Boyards” means high-ranking nobles in old Russia (plural of “boyard/boyar”).","zh":"“Boyards”指旧俄国的高级贵族（“boyard/boyar”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A member of the old Russian (and sometimes Romanian/Moldavian) nobility, especially a high-ranking noble who advised the ruler before modern reforms.","zh":"（旧俄国，亦可指罗马尼亚/摩尔多瓦）贵族阶层成员，尤指在近代改革前辅佐统治者的高级贵族、权贵。"},"examples":[{"en":"The tsar relied on the boyards for advice and military support.","zh":"沙皇依靠这些旧贵族（boyards）提供建议和军事支持。"},{"en":"In many historical novels, boyards appear as powerful landowners.","zh":"在许多历史小说中，boyards 常被描写为有权势的大地主。"}]}],"synonyms":["boyars","nobles","aristocrats"],"phonetic":"/ˈbɔɪ.ɑrd/","extraExplanation":["“boyards”是“boyard”的复数形式。英语里更常见的拼写是“boyar / boyars”，指中世纪到近代早期俄国的显贵阶层。","在俄国历史中，boyars（常译“波雅尔”）曾在政治上影响很大；后来随着国家权力集中与改革（如彼得大帝时期的改革），这一传统贵族阶层的地位逐渐被削弱。","读历史或文学时常见搭配：the boyars, a council of boyars（贵族会议/贵族顾问团）。"]}
{"word":"boyarism","summary":{"en":"Boyarism means the power or influence of boyars, or support for their aristocratic privileges.","zh":"boyarism 指波雅尔贵族的势力/体制，或支持其贵族特权的倾向。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The political power, influence, or social system associated with boyars (the high-ranking aristocrats of medieval and early modern Russia and some neighboring regions).","zh":"与“波雅尔”（中世纪至近代早期俄罗斯等地的高级贵族）相关的政治势力、影响力或社会体制。"},"examples":[{"en":"The reforms were meant to weaken boyarism and strengthen the central government.","zh":"这些改革旨在削弱波雅尔势力（boyarism），加强中央政府。"},{"en":"Some historians describe the period as a struggle between monarchy and boyarism.","zh":"一些历史学家把这一时期描述为君主制与波雅尔贵族势力之间的斗争。"}]},{"partOfSpeech":"n.","definition":{"en":"Support for, or attitudes favoring, boyars and their privileges.","zh":"支持波雅尔阶层及其特权的立场或倾向。"},"examples":[{"en":"The minister was accused of boyarism because he protected noble privileges.","zh":"那位大臣因维护贵族特权而被指责为“亲波雅尔主义”（boyarism）。"}]}],"synonyms":["boyardom","aristocratic rule","feudal aristocracy"],"phonetic":"/ˈbɔɪ.ərˌɪzəm/","extraExplanation":["“Boyar”（波雅尔）是古罗斯与沙俄早期的贵族阶层，常拥有大片土地与政治影响力。理解“boyarism”时，可以把它看作“波雅尔阶层的势力/制度/价值观”。","该词多见于历史写作与学术语境，日常英语中很少使用；阅读俄罗斯历史（如沙皇集权、贵族政治）时更常遇到。"]}
{"word":"boyarisms","summary":{"en":"Boyarism means the power or influence of the old Russian boyar nobility, or the typical attitudes and lifestyle associated with them. “Boyarisms” is the plural form.","zh":"Boyarism 指旧俄波雅尔贵族的势力/政治影响，或与其相关的观念与生活方式；“boyarisms”是其复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the power, system, or political influence of the boyars (the old Russian nobility), especially when they control government or resist central reforms","zh":"波雅尔（旧俄贵族阶层）的势力、体制或政治影响力，尤指其把持政权或抵制中央改革的现象"},"examples":[{"en":"Some historians argue that boyarism weakened the tsar’s ability to centralize power.","zh":"一些历史学家认为，波雅尔势力削弱了沙皇集中权力的能力。"},{"en":"The reforms were designed to curb boyarism and strengthen the state.","zh":"这些改革旨在遏制波雅尔势力并强化国家。"}]},{"partOfSpeech":"n.","definition":{"en":"the attitudes, customs, or lifestyle associated with boyars (as a social class)","zh":"与波雅尔贵族阶层相关的观念、习俗或生活方式"},"examples":[{"en":"In the novel, boyarism is shown through lavish clothing and strict court etiquette.","zh":"在小说中，波雅尔式的贵族气派通过奢华服饰与严格宫廷礼仪表现出来。"}]}],"synonyms":["aristocratic rule","oligarchy","noble dominance","feudalism (context-dependent)"],"phonetic":"/ˈbɔɪəˌrɪzəm/","extraExplanation":["“boyarism”来自“boyar（波雅尔）”+ “-ism（……主义/现象/作风）”。波雅尔是中世纪到近代早期俄罗斯及周边地区的高阶贵族。历史语境中，这个词常带批评意味，指贵族寡头式的把持与保守倾向。","你输入的“boyarisms”是复数形式，通常表示“多种波雅尔式作风/现象”或在不同地区、时期出现的多种类似现象。"]}
{"word":"boyars","summary":{"en":"Boyars are high-ranking nobles in old Russia; it’s the plural of boyar.","zh":"boyars 指旧俄罗斯的高级贵族，是 boyar 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A plural form of boyar: a member of the highest-ranking nobility in medieval and early modern Russia (and also in some other Eastern European regions).","zh":"boyar 的复数：指中世纪至近代早期俄罗斯（以及部分东欧地区）的最高等级贵族成员。"},"examples":[{"en":"The boyars advised the tsar and controlled large estates.","zh":"波雅尔贵族会向沙皇进言，并掌控大片庄园。"},{"en":"In the novel, the boyars resist the ruler’s reforms.","zh":"在小说中，波雅尔贵族反对统治者的改革。"}]}],"synonyms":["nobles","aristocrats","landed gentry"],"phonetic":"/ˈbɔɪ.ɑrz/","extraExplanation":["“boyar/波雅尔”常出现在俄罗斯历史语境中，尤其与“沙皇（tsar）”“贵族会议”“封建领地”等概念相关。彼得大帝时期的改革削弱了旧贵族（包括boyars）的传统权力。","读历史或文学时，boyars 往往象征“保守的旧贵族阶层”，与“改革、中央集权、现代化”形成对比。"]}
{"word":"boyau","summary":{"en":"“Boyau” is a French loanword meaning a natural sausage casing (intestine), and historically a narrow connecting trench in WWI.","zh":"“boyau”是法语借词，常指天然香肠肠衣（肠），历史上也指一战中狭窄的连接交通壕。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from French) an animal intestine used as a casing for sausages; also the casing itself (natural sausage casing).","zh":"（源自法语）动物肠衣；用动物肠做的香肠外皮（天然肠衣）。"},"examples":[{"en":"This salami is traditionally made in a natural boyau, which lets it dry evenly.","zh":"这种萨拉米传统上用天然肠衣制作，这样干燥更均匀。"},{"en":"The butcher rinsed the boyau carefully before stuffing it with seasoned meat.","zh":"肉铺老板把肠衣仔细冲洗后，再把调味肉灌进去。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) a narrow connecting trench or passage, especially in World War I (a communication trench).","zh":"（历史用法）狭窄的连接壕沟或通道，尤指第一次世界大战中的交通壕。"},"examples":[{"en":"The soldiers moved through the boyau to reach the front line without being seen.","zh":"士兵们沿着交通壕（boyau）移动，以避免暴露在前线视野中。"},{"en":"Maps of the battlefield showed a network of trenches and boyaux linking the positions.","zh":"战场地图上标出一张由壕沟和交通壕（boyaux）连接各阵地的网络。"}]}],"synonyms":["natural casing","sausage casing","intestine","communication trench"],"phonetic":"/bɔɪˈoʊ/","extraExplanation":["“boyau”是法语词，本义与“肠”有关，所以在食品语境里常指“肠衣”。英语里偶尔借用，多见于美食写作或传统工艺介绍。","第一次世界大战的壕沟战中，法语里把连接主壕沟与前沿阵地的狭窄通道称为“boyau”（形象地比喻成“肠道/管道”一样的通路）。英语史料中也会直接用这个词。"]}
{"word":"boyaus","summary":{"en":"“boyaus” isn’t a standard English word; it likely means “buoyant.”","zh":"“boyaus”不是标准英语词；很可能你想写的是“buoyant”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling of “buoyant” (able to float; cheerful and confident).","zh":"不是标准英语单词；很可能是“buoyant”的拼写错误（能漂浮的；乐观自信的）。"},"examples":[{"en":"I think you meant “buoyant”: The life jacket keeps you buoyant in the water.","zh":"我想你想写的是“buoyant”：救生衣能让你在水里保持漂浮。"},{"en":"She stayed buoyant even after the bad news.","zh":"即使听到坏消息，她仍然保持乐观。"}]}],"synonyms":["buoyant","cheerful","upbeat"],"phonetic":"/ˈbɔɪ.ənt/","extraExplanation":["“boyaus”在常见英语词典中一般查不到，通常是拼写错误或非正式写法。最接近的常用词有：buoyant（/ˈbɔɪ.ənt/，可指“漂浮的/乐观的”）以及 boisterous（“吵闹的、活跃的”）。如果你告诉我你想表达的中文意思（比如“浮起来”“很吵很闹”“很乐观”），我可以帮你确认正确单词。"]}
{"word":"boyaux","summary":{"en":"Boyaux (usually plural) refers to narrow connecting trenches or passageways in military contexts; it can also mean intestines (rare in English).","zh":"Boyaux（多用复数）指军事语境中的狭窄交通壕/通道；也可指“肠”（英语中较少用此义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually plural) narrow communication trenches or passageways, especially in older military writing (from French).","zh":"（通常用复数）狭窄的交通壕或通道，尤用于较早的军事语境（源自法语）。"},"examples":[{"en":"The soldiers moved through the boyaux to reach the front line without being seen.","zh":"士兵们沿着boyaux（交通壕）前进，以免被发现而抵达前线。"},{"en":"In World War I accounts, “boyaux” often refers to the zigzag trenches connecting larger trenches.","zh":"在第一次世界大战的记载中，“boyaux”常指连接主要战壕的之字形交通壕。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare in English) intestines; gut.","zh":"（英语中较少见）肠；内脏。"},"examples":[{"en":"The term originally meant “intestines” in French.","zh":"这个词在法语里原本的意思是“肠”。"}]}],"synonyms":["communication trench","connecting trench","passageway","trench"],"phonetic":"/bɔɪˈoʊ/","extraExplanation":["“Boyaux”是法语复数，单数是boyau。英语里借用时常直接用法语复数形式，尤其在一战或军事历史文本中很常见。","法语boyau本义是“肠子”，因为交通壕往往狭窄、弯曲、像肠道一样蜿蜒，所以被用来形容连接战壕的通道。"]}
{"word":"Boyce","summary":{"en":"Boyce is most commonly a surname (and sometimes a given name). It can also be a U.S. place name, and it appears in the database term “Boyce–Codd Normal Form (BCNF).”","zh":"Boyce 最常见是姓氏（也可作英文名）。它也可能是美国地名，并常见于数据库术语“Boyce–Codd 范式（BCNF）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname); also used as a given name in English-speaking cultures","zh":"姓氏；也可作英文名（名字）使用"},"examples":[{"en":"Mr. Boyce will lead the meeting this afternoon.","zh":"博伊斯先生将主持今天下午的会议。"},{"en":"Her last name is Boyce, spelled B-O-Y-C-E.","zh":"她的姓是 Boyce，拼作 B-O-Y-C-E。"}]},{"partOfSpeech":"other","definition":{"en":"a place name (a town/community name) found in the U.S.","zh":"（美国）地名；可指一些城镇/社区名"},"examples":[{"en":"They drove through Boyce on their way to Alexandria.","zh":"他们在去亚历山德里亚的路上经过了博伊斯（Boyce）。"}]},{"partOfSpeech":"other","definition":{"en":"in computing/database theory, “Boyce” is best known from Boyce–Codd Normal Form (BCNF), a rule for organizing database tables to reduce errors and duplication","zh":"在计算机/数据库理论中，“Boyce”最常见于 Boyce–Codd 范式（BCNF），一种用于组织数据表、减少冗余与异常的规则"},"examples":[{"en":"Our schema isn’t in BCNF yet, so we may get update anomalies.","zh":"我们的数据库结构还没达到 BCNF，所以可能会出现更新异常。"}]}],"phonetic":"/bɔɪs/","extraExplanation":["“Boyce”常读作 /bɔɪs/，发音类似“boys”去掉结尾的 /z/ 音。","作为姓氏，Boyce 在英语世界较常见；词源可能与法语/古英语中表示“树林、林地”的词根有关，也可能与爱尔兰/苏格兰家族姓氏的英语拼写变体有关（不同家族来源不完全相同）。","在学术语境里提到 Boyce，常与数据库规范化的“BCNF（Boyce–Codd Normal Form）”相关，其中的 Boyce 指数据库研究者 Raymond F. Boyce。"]}
{"word":"boyce","summary":{"en":"Boyce is usually a proper noun: a person’s name (surname or given name), a U.S. place name, or part of the database term Boyce–Codd Normal Form (BCNF).","zh":"Boyce 通常是专有名词：人名（姓或名）、美国地名，或数据库术语 Boyce–Codd 范式（BCNF）的一部分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname or given name (male) in English; used to refer to a specific person named Boyce","zh":"英语中的姓氏或（男性）名字；用于指名为 Boyce 的某个人"},"examples":[{"en":"She emailed Dr. Boyce to ask about the research.","zh":"她给 Boyce 博士发邮件询问研究情况。"},{"en":"Boyce is a common family name in some English-speaking countries.","zh":"Boyce 在一些英语国家是较常见的姓氏。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name in the U.S. (e.g., Boyce, Louisiana / Boyce, Virginia)","zh":"美国的地名（如路易斯安那州的 Boyce 或弗吉尼亚州的 Boyce）"},"examples":[{"en":"They drove through Boyce on the way to the lake.","zh":"他们去湖边的路上开车经过了 Boyce。"}]},{"partOfSpeech":"n.","definition":{"en":"in database design, used in the term “Boyce–Codd Normal Form (BCNF),” a standard for organizing relational databases to reduce redundancy","zh":"在数据库设计中，出现在“Boyce–Codd 范式（BCNF）”这一术语里；指一种组织关系型数据库以减少冗余的规范"},"examples":[{"en":"Our instructor introduced BCNF after we learned Third Normal Form.","zh":"我们学完第三范式后，老师介绍了 BCNF。"},{"en":"BCNF is named after Boyce and Codd.","zh":"BCNF 以 Boyce 和 Codd 的名字命名。"}]}],"synonyms":["(name) Raymond F. Boyce","(term) BCNF","(term) Boyce–Codd Normal Form"],"phonetic":"/bɔɪs/","extraExplanation":["“Boyce”多源自盖尔语姓氏的英语化拼写，与“胜利/得胜（victory）”等含义有关（不同家族来源略有差异）。在日常英语里，它通常作为专有名词（人名/地名）使用，因此一般不用于复数或加冠词来表示“一个boyce”。","数据库里的 BCNF（Boyce–Codd Normal Form）是计算机科学与信息系统课程中的常见概念；这里的 Boyce 指的是计算机科学家 Raymond F. Boyce。"]}
{"word":"Boyceville","summary":{"en":"Boyceville is the name of a village in Wisconsin, USA.","zh":"Boyceville 是美国威斯康星州的一个村庄名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A village in Dunn County, Wisconsin, United States.","zh":"美国威斯康星州邓恩县的一个村庄（地名）。"},"examples":[{"en":"Boyceville is a small village in western Wisconsin.","zh":"Boyceville 是威斯康星州西部的一个小村庄。"},{"en":"She drove through Boyceville on her way to Eau Claire.","zh":"她去欧克莱尔（Eau Claire）的路上开车经过 Boyceville。"}]}],"synonyms":["the village of Boyceville"],"phonetic":"/ˈbɔɪsˌvɪl/","extraExplanation":["Boyceville 是专有名词（地名），一般不翻译，中文常用音译或直接保留英文拼写。","在口语和写作中，地名通常不加冠词（不说 *the Boyceville*），但可以说 *the village of Boyceville*（Boyceville 这个村庄）。"]}
{"word":"boychick","summary":{"en":"Boychick (also spelled boychik) is an informal, affectionate term for a boy or young man.","zh":"boychick（也写作 boychik）是对小男孩或年轻人的非正式亲昵称呼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a friendly, informal way to address a young boy; “kiddo,” “little guy.”","zh":"对小男孩的亲昵称呼；相当于“孩子/小家伙”。"},"examples":[{"en":"Hey, boychick, how was school today?","zh":"嘿，小家伙，今天上学怎么样？"},{"en":"Come here, boychick—let me fix your hat.","zh":"过来，小家伙——我给你把帽子弄好。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) a young man spoken to in a warm, familiar way.","zh":"（非正式）对年轻人的亲昵称呼（带熟稔、关照的语气）。"},"examples":[{"en":"Listen, boychick, you’ve got to be on time tomorrow.","zh":"听着，小伙子，明天你得准时。"},{"en":"Don’t worry, boychick—everything will work out.","zh":"别担心，小伙子——都会好起来的。"}]}],"synonyms":["kiddo","buddy","little guy","young man"],"phonetic":"ˈbɔɪtʃɪk","extraExplanation":["“boychick”常见的原拼法是“boychik / boychick”，来自意第绪语（Yiddish）中带亲昵意味的后缀 -chik，常用于称呼孩子或年轻人，语气像英语里的“kiddo”。","使用场景多为口语、带长辈式关照或玩笑的语气；对陌生人使用可能显得过于随意，甚至有点居高临下，和对方关系不熟时建议避免。"]}
{"word":"boychicks","summary":{"en":"“Boychicks” is the plural of “boychik,” a Yiddish-influenced slang term meaning “boys/kids,” often affectionate but sometimes slightly patronizing.","zh":"“boychicks”是“boychik”的复数（受意第绪语影响的俚语），意思是“男孩们/孩子们”，通常亲昵，但有时略显居高临下。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) A slang term (from Yiddish) for young boys or “kids,” often used in a warm, familiar, sometimes slightly teasing way.","zh":"（复数）俚语（源自意第绪语），指“男孩们/小伙子们/孩子们”，常带亲昵、熟络的语气，有时也略带调侃或居高临下的味道。"},"examples":[{"en":"The coach called the team “my boychicks” and told them to focus.","zh":"教练把队员们叫作“my boychicks（小伙子们）”，让他们专心。"},{"en":"Come on, boychicks—clean up after yourselves.","zh":"好了，小伙子们——把你们弄乱的地方收拾干净。"}]}],"synonyms":["boys","kids","lads","youngsters"],"phonetic":"/ˈbɔɪtʃɪk/","extraExplanation":["“boychicks”多见于口语拼写变体；更常见的拼法是boychiks / boychik（单数）。它来自意第绪语的亲昵称呼，常见于美国犹太文化语境中。对不熟的人使用时，可能显得有点“把对方当小孩”或不够正式。"]}
{"word":"boychik","summary":{"en":"“Boychik” means “a boy/young man,” said in an affectionate or playful way (often with a Jewish/Yiddish cultural feel).","zh":"“boychik”指“男孩/小伙子”，多为亲昵或带点打趣的称呼（常带有犹太/意第绪语文化色彩）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Yiddish) an affectionate or playful term for a boy or young man; sometimes used especially for a Jewish boy.","zh":"（源自意第绪语）对男孩或年轻男子的亲昵称呼；有时特指（或暗示）犹太男孩。"},"examples":[{"en":"Come here, boychik—tell me how school was today.","zh":"过来呀，小男孩——跟我说说你今天上学怎么样。"},{"en":"He’s a smart boychik, always asking good questions.","zh":"他是个聪明的小伙子，总爱问好问题。"},{"en":"In some families, “boychik” is used the way someone might say “kiddo.”","zh":"在一些家庭里，“boychik”的用法有点像说“乖孩子/小家伙（kiddo）”。"}]}],"synonyms":["kiddo","buddy","little guy","lad"],"phonetic":"/ˈbɔɪtʃɪk/","extraExplanation":["“boychik”常见于美国英语中的犹太社群语境，是从意第绪语借来的亲昵说法，语气多为温和、疼爱或带点打趣。","词尾“-chik”带有“小、可爱”的指小意味，类似英语里加“-y/-ie”（如“dog”→“doggie”）的感觉。","使用时要注意场合：对陌生人这样称呼可能显得过于亲密或带刻板印象；更适合家人、熟人之间或在明确的文化语境中使用。"]}
{"word":"boychiks","summary":{"en":"Boychiks is an affectionate, informal plural term for boys/young men, from Yiddish.","zh":"boychiks 是源自意第绪语的复数称呼，用来亲昵、非正式地称呼男孩/年轻男性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of boychik) an affectionate, informal word for boys or young men (often said in a warm, joking, or friendly way).","zh":"（boychik 的复数）对男孩或年轻男性的亲昵称呼，语气多为热情、打趣或友好。"},"examples":[{"en":"Come on, boychiks—let’s get moving!","zh":"快点，伙计们——我们出发吧！"},{"en":"The coach called his players “boychiks” to lighten the mood.","zh":"教练用“boychiks”称呼队员，让气氛轻松一点。"},{"en":"In that deli, the older man greeted the teenagers: “How’re you doing, boychiks?”","zh":"在那家熟食店里，那位年长的男士跟几个青少年打招呼：“你们怎么样啊，小伙子们？”"}]}],"synonyms":["boys","guys","fellas","kids (informal)","young men"],"phonetic":"/ˈbɔɪtʃɪks/","extraExplanation":["“boychik”来自意第绪语（Yiddish），在美式英语中常见于犹太文化语境（例如纽约的犹太熟食店、家庭对话等）。通常带有长辈式的亲昵或调侃，不是正式用语。","使用时要注意场合：对陌生人或正式环境可能显得过于随便；对女性一般不用这个词。"]}
{"word":"Boycott","summary":{"en":"A boycott is a protest action: people refuse to buy, use, or join something to pressure for change.","zh":"boycott 指一种抗议方式：人们通过拒买、拒用或拒绝参与来施压推动改变。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to refuse to buy, use, or take part in something as a way to protest or pressure for change","zh":"为抗议或施压而抵制（拒买、拒用或拒绝参与某事）"},"examples":[{"en":"Many customers decided to boycott the company after the scandal.","zh":"丑闻曝光后，许多顾客决定抵制这家公司。"},{"en":"The students boycotted the exam to demand fairer rules.","zh":"学生们抵制考试，以要求更公平的规则。"}]},{"partOfSpeech":"n.","definition":{"en":"an organized refusal to buy, use, or participate in something as a form of protest","zh":"（有组织的）抵制行动；拒绝购买、使用或参与，以示抗议"},"examples":[{"en":"A boycott of the brand spread quickly on social media.","zh":"对该品牌的抵制在社交媒体上迅速扩散。"},{"en":"The boycott lasted for months and hurt sales.","zh":"抵制持续了数月，影响了销量。"}]}],"synonyms":["refuse","shun","avoid","blacklist (context-dependent)"],"phonetic":"/ˈbɔɪ.kɑːt/","extraExplanation":["“boycott”来自19世纪爱尔兰：人们为抗议而集体孤立一位地主代理人Charles Boycott（不与他交易、不雇佣、甚至不与其来往）。后来这个专有名词演变为普通词，表示“通过集体拒绝来施压”。","常见搭配：boycott a product/company/event（抵制产品/公司/活动）；call for a boycott（呼吁抵制）；a consumer boycott（消费者抵制）。","语气与用法提示：boycott 通常指“有目的的抵制/抗议”，不同于一般的“避免/不去”（avoid）或“制裁”（sanction，通常由政府实施）。"]}
{"word":"boycott","summary":{"en":"A boycott is a protest action: people refuse to buy, use, or join something to show disagreement or force change.","zh":"boycott 指以抗议或施压为目的的“抵制”：拒绝购买、使用或参与某事，以表达反对或推动改变。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to refuse to buy, use, or take part in something as a protest (often to pressure a company, government, or person)","zh":"（为抗议或施压而）抵制；拒绝购买、使用或参与"},"examples":[{"en":"Many customers decided to boycott the brand after the scandal.","zh":"丑闻曝光后，许多顾客决定抵制这个品牌。"},{"en":"Students are boycotting the event to demand fair policies.","zh":"学生们抵制这场活动，以要求更公平的政策。"}]},{"partOfSpeech":"n.","definition":{"en":"an organized refusal to buy, use, or take part in something as a protest","zh":"（有组织的）抵制行动；拒买/拒用/拒绝参与"},"examples":[{"en":"The boycott lasted for three months and hurt sales.","zh":"这次抵制持续了三个月，并影响了销售。"},{"en":"They called for a boycott of the company’s products.","zh":"他们呼吁抵制该公司的产品。"}]}],"synonyms":["refuse","shun","protest","blacklist"],"phonetic":"/ˈbɔɪkɑt/","extraExplanation":["“boycott”来自19世纪爱尔兰的一个真实事件：土地代理人Charles Boycott因对佃农不公，被当地人集体拒绝与其交易或往来，这种做法后来就以他的姓氏命名。","在英语里，boycott通常强调“有目的的集体拒绝”，常见搭配有：boycott a brand/product/event，call for a boycott（呼吁抵制），a consumer boycott（消费者抵制）。","区分相关词：boycott（抵制，带抗议目的）≠ ban（禁令，通常由权力机构发布）≠ avoid（回避，不一定出于抗议）。"]}
{"word":"boycottage","summary":{"en":"“Boycott” means to refuse to buy, use, or join something as a form of protest; it can be a verb or a noun.","zh":"“boycott”表示“为抗议而抵制”，既可作动词也可作名词。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to refuse to buy, use, or take part in something as a way to protest","zh":"（为抗议而）抵制：拒绝购买、使用或参与某事"},"examples":[{"en":"Many people decided to boycott the company after the scandal.","zh":"丑闻发生后，许多人决定抵制这家公司。"},{"en":"Students boycotted the event to protest the new rules.","zh":"学生抵制了这场活动，以抗议新规定。"}]},{"partOfSpeech":"n.","definition":{"en":"an organized refusal to buy, use, or take part in something as a protest","zh":"抵制（行动）：以抗议为目的的有组织拒绝购买、使用或参与"},"examples":[{"en":"The boycott lasted for three months.","zh":"这场抵制持续了三个月。"},{"en":"They called for a boycott of the product.","zh":"他们呼吁抵制该产品。"}]}],"synonyms":["refuse","shun","reject","ban (context-dependent)"],"phonetic":"/ˈbɔɪkɑt/","extraExplanation":["你输入的“boycottage”并不是常见英文单词；最可能是想写“boycott”（抵制）。正确拼写是 boycott（没有 -age 结尾）。","词源小故事：boycott 来自19世纪爱尔兰地主代理人 Charles Boycott 的姓。当时当地人集体拒绝与他做生意、与他往来，这种做法后来就用他的姓来命名。","常见搭配：boycott a company/product/event（抵制公司/产品/活动）；call for a boycott（呼吁抵制）；consumer boycott（消费者抵制）。"]}
{"word":"boycotted","summary":{"en":"“Boycotted” is the past tense/participle of “boycott,” meaning to refuse to buy, use, or participate in something (or to avoid someone) as a protest.","zh":"boycotted 是 boycott 的过去式/过去分词，表示出于抗议或施压而抵制某事（或刻意回避某人/活动）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Refused to buy, use, or take part in something as a form of protest or pressure.","zh":"（以抗议或施压为目的）抵制；拒绝购买、使用或参与。"},"examples":[{"en":"Many customers boycotted the brand after the scandal.","zh":"丑闻之后，许多顾客抵制了这个品牌。"},{"en":"Students boycotted the cafeteria to demand better food.","zh":"学生抵制了食堂，以要求更好的食物。"}]},{"partOfSpeech":"v.","definition":{"en":"Intentionally avoided a person, group, event, or activity.","zh":"刻意回避（某人/某群体/活动/事件）；不与来往。"},"examples":[{"en":"He felt his coworkers had boycotted him after the argument.","zh":"争吵之后，他觉得同事们在刻意孤立他。"},{"en":"The team boycotted the meeting to show they disagreed with the new rules.","zh":"团队抵制了会议，以表明他们不同意新规定。"}]}],"synonyms":["shunned","avoided","rejected","protested","blacklisted"],"phonetic":"/ˈbɔɪˌkɑtɪd/","extraExplanation":["“boycott”源自19世纪爱尔兰的一个历史事件：地主代理人Charles Boycott因对佃农强硬而遭到当地人集体不与往来、拒绝服务与交易，这种做法后来就被称为“boycott（抵制）”。","拼写提示：boycotted 是 boycott 的过去式/过去分词；英式拼写也常见 boycotting（双写t）。"]}
{"word":"boycotter","summary":{"en":"A boycotter is someone who refuses to buy, use, or support something as a protest.","zh":"boycotter 指为表达抗议而抵制某商品、服务或活动的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who refuses to buy, use, or support something as a form of protest","zh":"（为抗议而）抵制某事物的人；拒买/拒用/拒支持者"},"examples":[{"en":"The boycotter stopped buying the brand after the company’s scandal.","zh":"公司爆出丑闻后，这位抵制者就不再购买这个品牌了。"},{"en":"Boycotters asked others to avoid the movie until the studio changed its policy.","zh":"抵制者呼吁大家在片方改变政策前不要去看这部电影。"}]}],"synonyms":["protester","dissenter","activist"],"phonetic":"/ˈbɔɪˌkɑtɚ/","extraExplanation":["“boycott”一词来自19世纪爱尔兰土地运动中的人物 Charles Boycott（查尔斯·博伊科特）。当地人通过集体不与他往来、不给他提供服务来抗议，后来这种做法就被称为“boycott（抵制）”。“boycotter”就是参与这种抵制行动的人。","在公共讨论中，“boycotter”常见于消费者运动、政治抗议或社会议题（如环保、劳工权益）。语气通常较中性，强调行为方式而非立场对错。"]}
{"word":"boycotting","summary":{"en":"Boycotting means refusing to buy, use, or join something to protest or apply pressure.","zh":"Boycotting 指为了抗议或施压而拒绝购买、使用或参与某事（抵制）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to refuse to buy, use, or take part in something as a form of protest or pressure","zh":"（以抗议或施压为目的）抵制，不购买/不使用/不参与"},"examples":[{"en":"Many customers are boycotting the brand after the scandal.","zh":"丑闻之后，许多顾客正在抵制这个品牌。"},{"en":"Students are boycotting the event to demand safer campuses.","zh":"学生们抵制这场活动，以要求更安全的校园。"},{"en":"She is boycotting the restaurant because of its unfair labor practices.","zh":"她正在抵制那家餐厅，因为其用工不公。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of refusing to buy, use, or participate in something as a protest","zh":"抵制行为（作为抗议而拒绝购买、使用或参与）"},"examples":[{"en":"Boycotting can be a peaceful way to show disagreement.","zh":"抵制可以是一种和平表达反对的方式。"},{"en":"The online boycotting spread quickly after the video went viral.","zh":"视频走红后，网络抵制迅速扩散。"}]}],"synonyms":["protesting","refusing to support","shunning","blacklisting","withholding support"],"phonetic":"/ˈbɔɪˌkɑtɪŋ/","extraExplanation":["“boycott”一词源自19世纪爱尔兰的查尔斯·博伊科特（Charles Boycott）。当地人为了反对他对佃农的做法，集体拒绝与他做生意、与他往来；后来这种“集体拒绝合作”的做法就以他的姓氏命名。","在英语里，“boycotting”常指持续进行中的抵制（现在分词），也可当作名词表示“抵制这件事/这种行为”。"]}
{"word":"boycottism","summary":{"en":"Boycottism means the practice or policy of using boycotts as a form of protest.","zh":"Boycottism 指把“抵制（boycott）”作为抗议手段的一种做法或政策。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the practice or policy of boycotting (refusing to buy from, work with, or support a person, company, or country to show protest or pressure for change)","zh":"“抵制”的做法或政策（为表达抗议或施压促成改变，而拒绝购买、合作或支持某个人、公司或国家）"},"examples":[{"en":"Some activists argued that boycottism was the only peaceful way to pressure the company.","zh":"一些活动人士认为，抵制主义是向该公司施压的唯一和平方式。"},{"en":"The newspaper criticized boycottism as harmful to ordinary workers.","zh":"这家报纸批评抵制主义会伤害普通工人。"},{"en":"There was a debate about whether boycottism actually changes government policy.","zh":"人们就“抵制主义”是否真的能改变政府政策展开了讨论。"}]}],"synonyms":["boycotting","boycott policy","economic protest","noncooperation"],"phonetic":"/ˈbɔɪkɑˌtɪzəm/","extraExplanation":["“boycottism”较正式、也相对少见，更常用的词是“boycott”（名词/动词：抵制）或“the practice of boycotting”（抵制的做法）。","词源与历史：boycott 来自19世纪爱尔兰的 Charles Boycott（查尔斯·博伊科特），当时当地人以集体拒绝与他交易、合作来抗议，后来他的姓氏变成了英语里的“boycott”。“boycottism”是在此基础上加上 -ism，表示一种“做法/主义/倾向”。","语体提示：-ism 结尾的词常带“思想或方法”的意味，有时在评论文章中可能带一点批评或评价色彩（例如暗示过度依赖抵制）。"]}
{"word":"boycotts","summary":{"en":"Boycotts are organized refusals to buy or participate as a form of protest; to boycott means to do this.","zh":"boycotts 指有组织的抵制行为；to boycott 指通过拒买或拒绝参与来进行抗议或施压。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Refusals to buy, use, or take part in something (such as a product, company, or event) in order to protest or pressure for change.","zh":"（为抗议或施压而进行的）抵制；拒买、拒用或拒绝参与（某产品、公司或活动）。"},"examples":[{"en":"The group organized boycotts of the company’s products until it changed its policy.","zh":"该团体组织抵制这家公司的产品，直到它改变政策。"},{"en":"Calls for boycotts grew after the controversial decision.","zh":"在那项有争议的决定之后，呼吁抵制的声音增多了。"}]},{"partOfSpeech":"v.","definition":{"en":"To refuse to buy, use, or take part in something as a way to protest or pressure for change.","zh":"抵制；（通过拒买、拒用或拒绝参与来）抗议或施压。"},"examples":[{"en":"Many customers boycott the brand because of its labor practices.","zh":"因为劳工做法问题，许多顾客抵制这个品牌。"},{"en":"He boycotts the event every year to show disagreement.","zh":"他每年都抵制这个活动，以表达反对。"}]}],"synonyms":["refusal","protest","ban","withdrawal","shun"],"phonetic":"/ˈbɔɪkɑt/","extraExplanation":["“boycott”这个词来自19世纪爱尔兰的一个真实人物：查尔斯·博伊科特（Charles Boycott）。当时当地人以“集体不与他做生意、不与他来往”的方式抗议他，后来这种做法就用他的姓来命名，逐渐成为英语里的常用词。"]}
{"word":"Boyd","summary":{"en":"Boyd is mainly a surname, and it can also be a male given name or a U.S. place name.","zh":"Boyd 主要是姓氏，也可作男性名字或美国地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name), common in English-speaking countries, especially of Scottish/Irish origin","zh":"姓氏（家族姓），在英语国家常见，尤以苏格兰/爱尔兰渊源较多"},"examples":[{"en":"Her last name is Boyd.","zh":"她的姓是 Boyd（博伊德）。"},{"en":"Dr. Boyd will see you now.","zh":"Boyd 医生现在会见你。"}]},{"partOfSpeech":"n.","definition":{"en":"a given name (first name), usually for males","zh":"名字（名），通常用于男性"},"examples":[{"en":"Boyd moved to Chicago after college.","zh":"Boyd 大学毕业后搬去了芝加哥。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name in the U.S. (for example, Boyd, Texas, or places like Boyd County)","zh":"美国的地名（例如德克萨斯州的 Boyd 镇，或 Boyd County 等地）"},"examples":[{"en":"They drove through Boyd on the way to the lake.","zh":"他们去湖边的路上开车经过了 Boyd。"}]}],"synonyms":["(no direct synonyms; related: the name “Floyd” is sometimes confused in sound)"],"phonetic":"/bɔɪd/","extraExplanation":["“Boyd”常被认为源自苏格兰盖尔语相关词根，可能与“金黄/浅色（头发或肤色）”之意有关，因此在历史上可能最初用于描述外貌特征的人。","作为专有名词，Boyd 在不同语境里不需要翻译含义，中文通常音译为“博伊德”；在正式文件中常保持原拼写。"]}
{"word":"boyd","summary":{"en":"Boyd is most commonly a Scottish-origin surname, and it can also be a male given name or part of place names.","zh":"Boyd 最常见是源自苏格兰的姓氏，也可作男性名字，或出现在地名中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname) of Scottish origin, used by many English-speaking people","zh":"（姓氏）Boyd，源自苏格兰的姓，在英语国家较常见"},"examples":[{"en":"Dr. Boyd will see you now.","zh":"Boyd 医生现在要见你。"},{"en":"My last name is Boyd.","zh":"我姓 Boyd。"}]},{"partOfSpeech":"other","definition":{"en":"a given name (first name), usually for boys or men","zh":"（名字）Boyd（名字），多用于男孩或男性"},"examples":[{"en":"Boyd joined the team last year.","zh":"Boyd 去年加入了团队。"}]},{"partOfSpeech":"other","definition":{"en":"a name found in some place names (e.g., towns, counties, streets) in the United States and other English-speaking regions","zh":"（地名用法）Boyd 也常见于一些地名（如城镇、郡县、街道名），尤其在美国等英语地区"},"examples":[{"en":"They live on Boyd Street.","zh":"他们住在 Boyd 街。"},{"en":"The accident happened near Boyd County.","zh":"事故发生在 Boyd County 附近。"}]}],"phonetic":"/bɔɪd/","extraExplanation":["Boyd 常被认为是苏格兰姓氏，与苏格兰的 Boyd 氏族（Clan Boyd）有关。部分词源解释认为它可能与盖尔语有关，含义与“金黄/浅色（头发或肤色）”之类的描述相关；不过不同资料对具体来源说法不一。","在英文里，像 Boyd 这样的专有名词通常不翻译，只在中文里按音译或直接保留原拼写；用于称呼时常与头衔连用（Mr. Boyd, Dr. Boyd）。"]}
{"word":"boydekyn","summary":{"en":"“Boydekyn” is a very rare, archaic spelling meaning a small dagger or a pointed tool (like a bodkin).","zh":"“boydekyn”是极罕见的古语拼写，意思多为小匕首，或尖状工具（同bodkin）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(archaic) A small dagger or stabbing knife; a variant spelling of “bodkin.”","zh":"（古语）小匕首/短刺刀；相当于“bodkin”的一种旧拼法。"},"examples":[{"en":"In some older texts, a “boydekyn” refers to a small weapon used for stabbing.","zh":"在一些较早的文献中，“boydekyn”指一种用于刺击的小型武器。"},{"en":"The word is rare today; most modern English uses “bodkin” instead.","zh":"这个词在现代英语中很少见；多数情况下会用“bodkin”。"}]},{"partOfSpeech":"n.","definition":{"en":"(archaic) A pointed tool like a thick needle or pin, used for piercing or making holes (also covered by “bodkin”).","zh":"（古语）一种尖状工具，类似粗针或锥，用于穿刺或打孔（也可用“bodkin”表示）。"},"examples":[{"en":"A bodkin (sometimes spelled “boydekyn”) could be used to pierce leather or cloth.","zh":"Bodkin（有时拼作“boydekyn”）可用于穿透皮革或布料。"}]}],"synonyms":["bodkin","dagger","stiletto","awl"],"phonetic":"/ˈbɔɪdəkɪn/","extraExplanation":["“boydekyn”属于非常罕见的旧式拼写（variant spelling），常见于中世纪/早期现代英语的抄本或旧印刷品中。现代查词时，通常应优先查“bodkin”。","在文学语境里，“bodkin”较为人熟知的一处是莎士比亚《哈姆雷特》中“with a bare bodkin”（用一把裸露的匕首/短刃）这一句；“boydekyn”可视作同词不同拼法。"]}
{"word":"Boyden","summary":{"en":"Boyden is usually a proper noun: most often a surname, sometimes a place name, and it also appears in the scientific term “Boyden chamber.”","zh":"Boyden 通常是专有名词：多为姓氏，有时是地名，也常见于科学术语“Boyden chamber（博伊登小室）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"一个姓氏（家族姓）。"},"examples":[{"en":"Dr. Boyden will lead the meeting today.","zh":"Boyden 医生今天将主持会议。"},{"en":"My neighbor’s last name is Boyden.","zh":"我邻居的姓是 Boyden。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name used for some towns/areas (a proper noun).","zh":"一些城镇或地区的地名（专有名词）。"},"examples":[{"en":"They drove through Boyden on their way to the lake.","zh":"他们去湖边的路上开车经过了 Boyden。"},{"en":"Boyden is small, but the community is friendly.","zh":"Boyden 虽然不大，但社区很友好。"}]},{"partOfSpeech":"phrase","definition":{"en":"in biology/medicine, “Boyden chamber” refers to a lab device used to study cell movement (cell migration).","zh":"在生物/医学中，“Boyden chamber（博伊登小室）”是一种用于研究细胞移动（细胞迁移）的实验装置。"},"examples":[{"en":"The researchers measured cell migration using a Boyden chamber assay.","zh":"研究人员用 Boyden chamber 实验来测量细胞迁移。"}]}],"synonyms":["(proper noun) family name","(place name) town name"],"phonetic":"/ˈbɔɪdən/","extraExplanation":["“Boyden”更常见的是英文世界里的姓氏（源于人名/家族名传统），也会出现在一些地名中。作为术语时，多见于“Boyden chamber”，来自提出该实验装置/方法的研究者姓名（以人名命名在科学领域很常见）。","大写 Boyden 通常提示它是专有名词（人名或地名）。如果你是在文章里看到它，结合上下文（人物、地点、实验方法）最容易判断具体含义。"]}
{"word":"boydom","summary":{"en":"Boydom means the time or state of being a boy; it’s a rarer, more literary word for “boyhood.”","zh":"boydom 指“男孩时期/少年时代”，较少见，带一点文学或怀旧语气，相当于更常用的 boyhood。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The time or stage of life when someone is a boy; boyhood.","zh":"男孩时期；少年时代。"},"examples":[{"en":"He wrote a memoir about his boydom in a small town.","zh":"他写了一本回忆录，讲述自己在小镇的少年时代。"},{"en":"In boydom, he dreamed of becoming a pilot.","zh":"在少年时代，他梦想成为一名飞行员。"}]},{"partOfSpeech":"n.","definition":{"en":"The state or experience of being a boy (often used in a reflective or literary tone).","zh":"作为男孩的状态或体验（常带回忆性或文学色彩）。"},"examples":[{"en":"The novel captures the freedom and confusion of boydom.","zh":"这部小说捕捉了少年时期的自由与困惑。"},{"en":"He spoke of boydom as a time of scraped knees and big imaginations.","zh":"他把少年时代说成是“膝盖擦伤、想象力很大”的时光。"}]}],"synonyms":["boyhood","youth","childhood (for earlier years)"],"phonetic":"/ˈbɔɪdəm/","extraExplanation":["“boydom”比较少见，更常用的词是“boyhood”。它常出现在带有怀旧或文学风格的写作中。","后缀“-dom”表示“状态/领域/时期”（如 freedom 自由、kingdom 王国），所以 boy + dom 字面意思就是“男孩的状态/时期”。"]}
{"word":"Boyds","summary":{"en":"“Boyds” usually refers either to multiple people named Boyd (the Boyd family) or to a place called Boyds (such as in Maryland).","zh":"“Boyds”通常指多个姓 Boyd 的人/ Boyd一家，或指名为 Boyds 的地名（如美国马里兰州）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plural form of the surname “Boyd,” referring to people or families with the last name Boyd","zh":"姓氏“Boyd”的复数形式，用来指多个姓 Boyd 的人或家族"},"examples":[{"en":"The Boyds are hosting dinner this weekend.","zh":"Boyd 一家这周末请客吃饭。"},{"en":"Several Boyds signed the guest book at the reunion.","zh":"好几位姓 Boyd 的人在聚会上留言签到。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name (e.g., Boyds, a community in Maryland, USA)","zh":"地名（例如美国马里兰州的 Boyds，是一个社区名）"},"examples":[{"en":"She lives near Boyds, Maryland.","zh":"她住在马里兰州 Boyds 附近。"},{"en":"We drove through Boyds on the way to the park.","zh":"我们去公园的路上经过了 Boyds。"}]}],"synonyms":["the Boyd family","Boyd family","Boyd (plural)"],"phonetic":"/bɔɪdz/","extraExplanation":["“Boyd”常见为苏格兰来源的姓氏；写成复数“the Boyds”时，通常表示“Boyd一家/ Boyd家族”。","注意拼写差异：如果你想表达“Boyd的（某物）”，通常写作“Boyd’s”（单数所有格）或“the Boyds’”（复数所有格）。例如：“Boyd’s car”（Boyd的车）；“the Boyds’ house”（Boyd一家的房子）。"]}
{"word":"Boydton","summary":{"en":"Boydton is most commonly the name of a small town in Virginia; it can also be a surname.","zh":"Boydton 通常指弗吉尼亚州的一个小镇；也可作英文姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small town in Mecklenburg County, Virginia, in the United States.","zh":"（美国）弗吉尼亚州梅克伦堡县的一个小镇。"},"examples":[{"en":"Boydton is a quiet town in southern Virginia.","zh":"Boydton 是弗吉尼亚州南部一个安静的小镇。"},{"en":"We stopped in Boydton for gas on the way to North Carolina.","zh":"我们去北卡罗来纳的路上在 Boydton 停下来加油。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname (family name).","zh":"博伊顿（一个英文姓氏）。"},"examples":[{"en":"Ms. Boydton will join the meeting at 3 p.m.","zh":"Boydton 女士将在下午三点参加会议。"}]}],"synonyms":["Mecklenburg County (context)","Virginia (context)"],"phonetic":"/ˈbɔɪd.tən/","extraExplanation":["“Boydton”作为地名时，通常指弗吉尼亚州的 Boydton。英语中很多美国小镇名字来自早期定居者或当地重要人物的姓氏，因此也会同时作为姓氏出现。","地名读音里常见的“-ton”表示“城镇/村庄”（类似于“town”），在美国和英国地名中很常见。"]}
{"word":"Boyer","summary":{"en":"Boyer is mainly used as a surname (family name).","zh":"Boyer主要用作姓氏（家族姓）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname); also used as a given name in some contexts","zh":"博耶（姓氏；在某些情况下也可作名字）"},"examples":[{"en":"My professor’s last name is Boyer.","zh":"我教授的姓是Boyer（博耶）。"},{"en":"The article was written by Dr. Boyer.","zh":"这篇文章是由Boyer博士撰写的。"},{"en":"In the credits, you can see Charles Boyer listed as an actor.","zh":"在演职员表里，你可以看到演员查尔斯·博耶（Charles Boyer）的名字。"}]}],"synonyms":["(no direct synonyms; it is a proper name)"],"phonetic":"/ˈbɔɪər/","extraExplanation":["“Boyer”常见于英语世界的人名，多源自法语姓氏；在读写时一般当作专有名词处理（首字母大写）。","有些著名人物包括法国演员 Charles Boyer（查尔斯·博耶）等；在学术或科技领域也可能出现在专有名词/术语中（如以人名命名的概念或公式）。"]}
{"word":"boyer","summary":{"en":"Boyer is usually a surname; it can also refer to terms named after people, such as the Boyer–Moore algorithm.","zh":"Boyer 通常是一个姓氏；也可能指以人名命名的术语，例如 Boyer–Moore 算法。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname) of French origin, used by many people; it can also appear as a place or brand name.","zh":"Boyer：一个法语来源的姓氏（家族姓），许多人使用；也可能作为地名或品牌名出现。"},"examples":[{"en":"Her last name is Boyer, so it’s spelled B-O-Y-E-R.","zh":"她的姓是 Boyer，拼写是 B-O-Y-E-R。"},{"en":"I found an article written by Dr. Boyer.","zh":"我找到一篇由 Boyer 博士撰写的文章。"}]},{"partOfSpeech":"other","definition":{"en":"(in computing) used in names like the Boyer–Moore algorithm, a well-known method for searching text efficiently.","zh":"（计算机领域）用于一些专有名词中，如 Boyer–Moore 算法：一种著名的高效文本搜索方法。"},"examples":[{"en":"The Boyer–Moore algorithm is fast for many real-world searches.","zh":"Boyer–Moore 算法在很多实际搜索中速度很快。"},{"en":"Our library uses Boyer–Moore for substring matching.","zh":"我们的库用 Boyer–Moore 来做子串匹配。"}]}],"phonetic":"/ˈbɔɪər/","extraExplanation":["“Boyer”常见于法国及法语文化影响地区，也常见于英语国家的移民后裔姓氏中。","如果你是在阅读科技文章中看到“Boyer”，很可能指与 Robert S. Boyer 相关的术语（例如 Boyer–Moore 字符串搜索算法），属于“人名→术语名”的常见命名方式。"]}
{"word":"Boyers","summary":{"en":"“Boyers” usually means people with the last name Boyer; less commonly, it can mean multiple “boyer” sailing boats in historical nautical contexts.","zh":"“Boyers”通常指姓Boyer的人/博耶一家；较少见时也可指多艘历史语境中的“boyer”小帆船。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) People with the surname “Boyer.”","zh":"（复数）姓“Boyer”的人；博耶一家/博耶们。"},"examples":[{"en":"The Boyers have lived in this town for three generations.","zh":"博耶一家在这个镇上住了三代。"},{"en":"Two Boyers are listed in the school directory.","zh":"学校名录里有两位姓博耶的人。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) “Boyer” boats: small sailing vessels (especially historical, used in some North American coastal/river areas).","zh":"（复数）“boyer”型帆船：一种小型帆船（多为历史用法，曾见于北美沿海或河道）。"},"examples":[{"en":"Old records mention boyers carrying goods along the river.","zh":"旧档案提到boyer小帆船沿河运货。"},{"en":"The museum has a model of two boyers from the colonial period.","zh":"博物馆里有两个殖民时期boyer帆船的模型。"}]}],"synonyms":["the Boyer family","people named Boyer","sloops (approx.)","small sailing vessels (approx.)"],"phonetic":"/ˈbɔɪərz/","extraExplanation":["“Boyers”最常见是专有名词复数：指姓Boyer的一家人或多人。英语里用复数姓氏表示“某某一家/某某们”，如：the Smiths, the Boyers。","作为普通名词的“boyer”较少见，属于历史/航海语境；不同地区文献对这种小帆船的拼写与具体船型可能略有差异。"]}
{"word":"Boyertown","summary":{"en":"Boyertown is mainly a place name: a small town (borough) in Pennsylvania, USA; it can also be used as a surname.","zh":"Boyertown 主要是地名：美国宾夕法尼亚州的一个小镇（自治市）；也可作为姓氏使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A borough (small town) in Berks County, Pennsylvania, USA.","zh":"美国宾夕法尼亚州伯克斯县的一个自治市（小镇）：博耶敦。"},"examples":[{"en":"Boyertown is about an hour from Philadelphia by car, depending on traffic.","zh":"从博耶敦开车到费城大约一小时左右，具体看路况。"},{"en":"She grew up in Boyertown and later moved to New York for work.","zh":"她在博耶敦长大，后来去纽约工作。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname, often connected historically to families from (or associated with) the place name.","zh":"一个姓氏；历史上常与来自（或与）该地名相关的家族有关。"},"examples":[{"en":"The author’s last name is Boyertown.","zh":"那位作者的姓是 Boyertown。"}]}],"synonyms":["(place name) borough","(general) town","(place name) municipality"],"phonetic":"/ˈbɔɪ.ər.taʊn/","extraExplanation":["“Boyertown”是专有名词，书写时通常首字母大写；在口语里也可能被简化为“in/near Boyertown”来表示在该镇或附近地区。","作为地名时，它常出现在地址、学校名称（如 Boyertown Area School District）或本地新闻中；理解为“一个宾州小镇”即可应对大多数语境。"]}
{"word":"Boyes","summary":{"en":"“Boyes” is most commonly a surname; it can also appear as a rare variant spelling of “boys.”","zh":"“Boyes”最常见用法是姓氏；也可能作为“boys（男孩们）”的少见变体拼写出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"（人名）博伊斯（姓氏）。"},"examples":[{"en":"Ms. Boyes will lead the meeting today.","zh":"博伊斯女士今天将主持会议。"},{"en":"I found a paper by Boyes in the library database.","zh":"我在图书馆数据库里找到了一篇署名 Boyes 的论文。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common spelling) the plural of “boy”; used mainly in names or as a variant/older spelling.","zh":"（较少见的拼写）“boy”的复数“boys”；多见于姓名、专名或较旧/变体拼写。"},"examples":[{"en":"The boyes ran across the field after school.","zh":"放学后，那些男孩跑过了田野。（此拼写较少见）"},{"en":"In some older records, you may see “boyes” where modern English writes “boys.”","zh":"在一些较旧的记录中，你可能会看到用“boyes”来写现代英语的“boys”。"}]}],"synonyms":["boys","lads","guys"],"phonetic":"/bɔɪz/","extraExplanation":["“Boyes”首字母大写时通常是姓氏；如果你想表达“男孩们”，更常见、标准的拼写是“boys”。","发音与“boys”相同：/bɔɪz/。姓氏“Boyes”在英语世界里可能源自不同地区的家族拼写差异（例如英格兰或苏格兰的姓氏传统）。"]}
{"word":"boyfriend","summary":{"en":"A boyfriend is a male romantic partner; rarely, it can mean a male friend in older informal usage.","zh":"boyfriend 常指“男朋友/恋爱对象”；较少见的旧用法可指“男性朋友”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A male romantic partner in a relationship (someone you date).","zh":"男朋友；交往中的男性恋人。"},"examples":[{"en":"She introduced him as her boyfriend.","zh":"她介绍他是她的男朋友。"},{"en":"My boyfriend and I have been dating for six months.","zh":"我和我的男朋友交往六个月了。"},{"en":"He wants to meet his girlfriend’s boyfriend? (This sounds wrong—usually you’d say “her boyfriend.”)","zh":"他想见他女朋友的男朋友？（这听起来不对——通常应说“她的男朋友”。）"}]},{"partOfSpeech":"n.","definition":{"en":"A male friend or companion (older or informal usage; less common today).","zh":"（较旧或较口语的用法）男性朋友、伙伴（现在较少用）。"},"examples":[{"en":"He went fishing with a couple of his boyfriends from work.","zh":"他和几个公司里的男性朋友去钓鱼了。"}]}],"synonyms":["partner","significant other","boyfriend (informal: bf)"],"phonetic":"/ˈbɔɪˌfrɛnd/","extraExplanation":["“boyfriend”通常用于未婚的恋爱关系；如果已结婚，一般用“husband（丈夫）”。但在现实中，也有人在长期同居或伴侣关系中仍用“boyfriend”，语气更口语、亲近。","第二个“男性朋友”的用法在当代英语里可能引起误解，因为大多数人会优先理解为“男朋友”。想表达“男性朋友”，更清晰的说法是“a male friend”或“a friend (from work/school)”。"]}
{"word":"boyfriends","summary":{"en":"“Boyfriends” means more than one boyfriend (male romantic partner).","zh":"“Boyfriends”表示不止一个男朋友（男性恋人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of “boyfriend”: male romantic partners (for one person or for different people)","zh":"“boyfriend”的复数：男朋友/男性恋人（可指同一个人的多个男友，或不同人的男友）"},"examples":[{"en":"She’s meeting her friends and their boyfriends at the cafe.","zh":"她要在咖啡馆见她的朋友们和她们的男朋友。"},{"en":"In the movie, the main character’s ex-boyfriends all show up at the wedding.","zh":"在那部电影里，女主角的前男友们都出现在婚礼上。"}]}],"synonyms":["male partners","boyfriends (plural form of boyfriend)"],"phonetic":"/ˈbɔɪˌfrɛndz/","extraExplanation":["英语里“boyfriend”是单数，“boyfriends”是复数（通常加 -s）。如果你只想说“有一个男朋友”，用“a boyfriend / my boyfriend”。如果说“两个或更多男朋友”，用“two/three boyfriends / her boyfriends”。在某些语境里用复数可能会让人以为同一个人同时有多个男友，所以常见于“不同人的男友”或“前男友们”等情境。"]}
{"word":"boyg","summary":{"en":"“boyg” isn’t a standard English word; it’s likely a typo or a name/ID.","zh":"“boyg”不是标准英语单词；多半是拼写错误或昵称/ID。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling or a made-up/username-style form.","zh":"不是标准英语单词；很可能是拼写错误，或是自造词/用户名之类的写法。"},"examples":[{"en":"I can’t find “boyg” in a dictionary—did you mean “boy” or “bog”?","zh":"我在词典里找不到“boyg”——你是不是想写“boy（男孩）”或“bog（沼泽）”？"},{"en":"If “boyg” is a name or gamer tag, it may not have a dictionary meaning.","zh":"如果“boyg”是名字或游戏ID，它可能没有词典义。"}]}],"phonetic":"/bɔɪɡ/","extraExplanation":["“boyg”在常见英语词典与主流语料中不属于标准词条。最常见的情况是：\n1）把“boy（男孩）”多打了一个g；\n2）想写“bog（沼泽）”但多打了y；\n3）它是专有名词（ID、昵称、品牌名）或内部缩写。\n如果你能提供一句包含“boyg”的原句或你想表达的中文意思，我可以帮你判断最可能的正确单词与用法。"]}
{"word":"boyhood","summary":{"en":"Boyhood means the time when someone is a boy, often talked about as a period of childhood memories and experiences.","zh":"boyhood 指“男孩时期/少年时代”，常用于回忆或叙述童年经历与成长阶段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The period of a male person’s life when he is a boy; childhood years (often focusing on experiences and memories).","zh":"男孩时期；童年（强调作为男孩时的经历与回忆）。"},"examples":[{"en":"He spent his boyhood in a small town by the sea.","zh":"他的男孩时代是在一个海边小镇度过的。"},{"en":"She wrote a novel based on her brother’s boyhood adventures.","zh":"她写了一部小说，灵感来自她哥哥童年时的冒险经历。"},{"en":"In his boyhood, he dreamed of becoming a pilot.","zh":"在他的少年时代，他梦想成为一名飞行员。"}]}],"synonyms":["childhood","youth","early years","adolescence"],"phonetic":"/ˈbɔɪˌhʊd/","extraExplanation":["“boyhood”常带有一种回忆和叙事色彩，常见于传记、回忆录或文学作品中，用来概括一个人成长早期的生活与性格形成。","它并不严格等同于“childhood”（童年，性别中性），而是更聚焦“作为男孩的阶段与体验”。在现代写作中，如果需要更性别包容的表达，可以用“childhood”或更具体的“early years”。"]}
{"word":"boyhoods","summary":{"en":"“Boyhoods” is the plural of “boyhood,” meaning the time of being a boy or the experiences connected to it.","zh":"“boyhoods”是“boyhood”的复数，指男孩时期，或与男孩成长相关的经历与回忆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the period of being a boy; childhood years as a male child (plural form)","zh":"男孩时期；童年（作为男孩的成长阶段，复数形式）"},"examples":[{"en":"They spent their boyhoods in a small fishing town.","zh":"他们的少年时代是在一个小渔镇度过的。"},{"en":"The book compares the boyhoods of two famous athletes.","zh":"这本书比较了两位著名运动员的少年时期。"}]},{"partOfSpeech":"n.","definition":{"en":"experiences, memories, or characteristics associated with being a boy (plural)","zh":"与男孩成长相关的经历、回忆或特质（复数）"},"examples":[{"en":"Their boyhoods were full of outdoor adventures and scraped knees.","zh":"他们的童年充满了户外冒险和摔破的膝盖。"},{"en":"Different cultures shape boyhoods in different ways.","zh":"不同文化以不同方式塑造男孩的成长经历。"}]}],"synonyms":["childhoods","youths","early years","growing-up years"],"phonetic":"/ˈbɔɪˌhʊdz/","extraExplanation":["“boyhood”由 boy + 后缀 -hood 构成，-hood 表示“……的状态/时期/身份”（如 childhood, adulthood, neighborhood）。因此 boyhood 强调“作为男孩的那段时期或状态”，复数 boyhoods 常用于对比多个人的成长经历。"]}
{"word":"boyish","summary":{"en":"Boyish describes a style or personality that feels youthful and traditionally associated with boys (e.g., a short haircut, playful energy).","zh":"Boyish 指带有男孩子气的风格或气质，常含“清爽中性、显年轻、活泼顽皮”的意思。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Usually of a girl or young woman) having a youthful, simple style that is traditionally associated with boys; not very feminine in appearance or manner.","zh":"（常形容女孩/年轻女性）带有男孩子气的；风格清爽、偏中性、不太女性化的。"},"examples":[{"en":"She has a boyish haircut and usually wears sneakers.","zh":"她留着男孩般的短发，平时常穿运动鞋。"},{"en":"Her boyish charm makes her seem younger than she is.","zh":"她那种男孩子气的魅力让她看起来比实际年龄更年轻。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having the energy, playfulness, or behavior typical of a boy.","zh":"像男孩一样精力旺盛、爱闹、带点顽皮的。"},"examples":[{"en":"He laughed with a boyish excitement when he saw the snow.","zh":"看到下雪，他兴奋得像个男孩一样笑起来。"},{"en":"There was a boyish honesty in the way he answered.","zh":"他回答的方式里有一种少年般的坦率。"}]}],"synonyms":["youthful","tomboyish","laddish","androgynous"],"phonetic":"/ˈbɔɪ.ɪʃ/","extraExplanation":["“boyish”在英语里既可描述外表（如短发、宽松穿搭），也可描述气质（活力、顽皮、坦率）。用于形容女性时，语气多为中性或赞赏（清爽、率真），但在某些语境也可能被解读为“不够女性化”，使用时可结合语境与对方偏好。","相关近义表达：tomboyish（更偏“假小子”、爱做传统上男孩喜欢的活动）；youthful（更中性，强调“显年轻”）；androgynous（更正式，强调“雌雄同体/中性风格”）。"]}
{"word":"boyishly","summary":{"en":"“Boyishly” means “in a boy-like, youthful, innocent way.”","zh":"“boyishly”表示“像男孩一样、带着少年气/天真调皮地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is typical of a boy, especially in an innocent, playful, or youthful manner.","zh":"以男孩子般的方式；尤指天真、爱玩或带着少年气的样子。"},"examples":[{"en":"He smiled boyishly when he won the game.","zh":"他赢了比赛时露出男孩般天真的笑容。"},{"en":"She spoke boyishly, full of excitement and curiosity.","zh":"她说话带着男孩般的兴奋和好奇。"}]}],"synonyms":["youthfully","playfully","innocently","childishly"],"phonetic":"/ˈbɔɪɪʃli/","extraExplanation":["“boyishly”常用来形容一种“少年感/孩子气”的气质，更多是指天真、活泼、带点害羞或调皮的感觉，不一定真的和性别有关。在现代语境中，有时也会被理解为带有性别刻板印象；如果想更中性，可以用“youthfully（充满青春气息地）”“playfully（调皮地）”“innocently（天真地）”。"]}
{"word":"boyishness","summary":{"en":"Boyishness means the quality of being boyish—youthful, playful energy or a boy-like style.","zh":"boyishness 指“男孩子气/少年气”，既可指年轻俏皮的气质，也可指偏男孩风的外表与穿搭。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being boyish: having a youthful, playful, or energetic style or behavior (often used positively).","zh":"男孩子气；少年般的气质：带有年轻、顽皮或充满活力的风格或举止（常为褒义）。"},"examples":[{"en":"Her boyishness made her seem cheerful and approachable.","zh":"她的男孩子气让她看起来开朗又好接近。"},{"en":"He still has a kind of boyishness, even in his forties.","zh":"即使四十多岁了，他身上仍有一种少年气。"}]},{"partOfSpeech":"n.","definition":{"en":"A style or appearance associated with a boy, such as short hair, simple clothes, or a less traditionally feminine look.","zh":"男孩式的外表或风格：如短发、简洁的穿着，或不那么“传统女性化”的打扮。"},"examples":[{"en":"The designer leaned into boyishness with a crisp shirt and cropped haircut.","zh":"设计师用挺括的衬衫和短发强调了男孩风的造型。"},{"en":"She liked the boyishness of the outfit because it felt comfortable.","zh":"她喜欢这套衣服的男孩风，因为穿着很舒服。"}]}],"synonyms":["youthfulness","playfulness","tomboyishness","boyish charm"],"phonetic":"/ˈbɔɪɪʃnəs/","extraExplanation":["“boyishness”由形容词“boyish（男孩般的）”加名词后缀“-ness（……的性质/状态）”构成，表示一种“气质/特质”。","在现代语境中，“boyishness”多指“青春感、俏皮感、活力”，不一定与性别或身份绑定，也可用于形容任何人的气质或穿搭风格。表达时注意语境：对外貌的评论有时可能被理解为刻板印象，若不确定，可用“youthful（有青春感的）”“playful（俏皮的）”等更中性的词。"]}
{"word":"boyishnesses","summary":{"en":"“Boyishnesses” means multiple instances or aspects of boyishness—youthful, playful, boy-like qualities.","zh":"“boyishnesses”指“男孩子气”的复数：多种/多个方面的少年感、顽皮感或像男孩的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the qualities of being boyish; playful, youthful, or like a boy in appearance or behavior (plural form)","zh":"男孩子气；少年般的特质（如顽皮、青春、像男孩的外表或举止）（复数形式）"},"examples":[{"en":"In the photos, her boyishnesses—short hair, loose clothes, and an easy smile—stand out.","zh":"在这些照片里，她的几种“男孩子气”——短发、宽松的衣服和轻松的笑容——特别显眼。"},{"en":"The novel describes his boyishnesses as charming rather than immature.","zh":"小说把他的那些少年气写得很讨喜，而不是幼稚。"}]}],"synonyms":["youthfulness","playfulness","tomboyishness","ladishness"],"phonetic":"/ˈbɔɪɪʃnəsɪz/","extraExplanation":["“boyishnesses”是“boyishness”的复数，但在实际英语里不算常见；更常用不可数形式“boyishness”来泛指整体气质。用复数时，通常是在强调“多种具体表现/方面”的男孩子气（例如穿着、神态、说话方式等）。","词形结构：boy（男孩）+ -ish（……似的）→ boyish（像男孩的）+ -ness（名词后缀，表示特质）→ boyishness（男孩子气）。"]}
{"word":"boyism","summary":{"en":"Boyism means boyish behavior or attitudes, often implying immaturity.","zh":"boyism 指“男孩式的行为或态度”，常带“幼稚、不成熟”的含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The qualities, behavior, or attitudes typical of a boy; boyishness (often suggesting immaturity).","zh":"男孩式的特质、行为或态度；男孩气（常含“不够成熟”的意思）。"},"examples":[{"en":"His constant joking in meetings felt like boyism rather than professionalism.","zh":"他在会议上不停开玩笑，让人觉得是“男孩气/幼稚”而不是专业。"},{"en":"The novel criticizes the hero’s boyism before he learns responsibility.","zh":"这部小说批判主人公的“男孩式幼稚”，直到他学会承担责任。"}]}],"synonyms":["boyishness","immaturity","juvenility","childishness"],"phonetic":"/ˈbɔɪˌɪzəm/","extraExplanation":["“boyism”不是常用词，更常见的表达是“boyishness”（男孩气、稚气）或“immaturity”（不成熟）。","构词上是“boy + -ism”。“-ism”常用来表示一种特质、倾向或风格（如“heroism”“racism”）。因此“boyism”在语感上更像带一点评论或批评色彩的说法。","在写作中使用“boyism”时，通常出现在评论性文字（批评、文学分析、社会观察）里；日常口语更建议用更常见的词。"]}
{"word":"Boykin","summary":{"en":"Boykin is usually a surname, and it can also refer to the dog breed Boykin Spaniel.","zh":"Boykin 通常是姓氏；也可指犬种“博伊金猎犬（Boykin Spaniel）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname).","zh":"（人名）姓；博伊金（常见作姓氏）。"},"examples":[{"en":"Ms. Boykin will lead today’s meeting.","zh":"博伊金女士将主持今天的会议。"},{"en":"I met someone named Boykin at the conference.","zh":"我在会议上认识了一个姓博伊金的人。"}]},{"partOfSpeech":"n.","definition":{"en":"(often in \"Boykin Spaniel\") a medium-sized dog breed originally developed for hunting, known for being friendly and energetic.","zh":"（常见于“Boykin Spaniel”）博伊金猎犬：一种中等体型的犬种，最初用于狩猎，性格友好、精力充沛。"},"examples":[{"en":"They adopted a Boykin Spaniel because it’s good with families.","zh":"他们领养了一只博伊金猎犬，因为它很适合家庭。"},{"en":"Boykin Spaniels are often trained to retrieve birds during hunts.","zh":"博伊金猎犬常被训练在狩猎时叼回猎鸟。"}]}],"synonyms":["(surname)","Boykin Spaniel"],"phonetic":"/ˈbɔɪkɪn/","extraExplanation":["“Boykin”作为犬种名称通常与美国南卡罗来纳州有关：相传该犬种在当地为水鸟狩猎与寻回工作而发展起来，因此在美国南方较常见。","作为姓氏时，英语里常见的读法是重音在第一音节（BOY-kin）。"]}
{"word":"Boykins","summary":{"en":"“Boykins” is usually a surname, and it can also refer to a place in Virginia, USA.","zh":"“Boykins”通常是英文姓氏，也可指美国弗吉尼亚州的地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), most often used as a last name in English-speaking countries","zh":"姓氏（家族姓），常见于英语国家，通常用作英文姓"},"examples":[{"en":"Ms. Boykins will lead the meeting today.","zh":"Boykins 女士今天将主持会议。"},{"en":"I saw Boykins listed as the author on the report.","zh":"我看到报告的作者署名是 Boykins。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name: Boykins, a small town/community in Virginia, USA","zh":"地名：Boykins，美国弗吉尼亚州的一个小镇/社区名"},"examples":[{"en":"They drove through Boykins on their way to North Carolina.","zh":"他们去北卡罗来纳州的路上开车经过了 Boykins。"}]}],"phonetic":"/ˈbɔɪkɪnz/","extraExplanation":["“Boykins”多见于专有名词（人名/地名），不属于常见可翻译的普通词汇。遇到它时，可以根据上下文判断：前面有Mr./Ms.或作为作者署名通常是姓氏；出现在地址、路线、州名旁边通常是地名。","发音会因家庭或地区而略有差异；如果是具体人物的姓氏，最好尊重本人或当地的读法。"]}
{"word":"boyla","summary":{"en":"“Boyla” isn’t a standard English word; it is often a misspelling of “bylaw,” meaning a local rule or an organization’s written rules.","zh":"“boyla”不是标准英语单词；常见情况是把“bylaw”拼错了，指地方法规或组织/公司的章程细则。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly intended word) a local rule made by an organization or local government; also, the written rules for how a group (especially a company or club) is run.","zh":"（常见想表达的词）附则；（地方政府或组织制定的）地方法规；（公司/社团的）章程细则。"},"examples":[{"en":"The city passed a bylaw banning smoking in parks.","zh":"市政府通过了一项禁止在公园吸烟的地方法规。"},{"en":"According to the company bylaws, the board must meet four times a year.","zh":"根据公司章程细则，董事会每年必须开四次会。"}]}],"synonyms":["rule","regulation","ordinance","statute","charter","articles (of association)"],"phonetic":"ˈbaɪˌlɔ","extraExplanation":["“boyla”在标准英语里不是常见单词。很多学习者输入“boyla”时，实际想写的是 **bylaw**（附则/地方法规/章程细则）。如果你想表达的是别的意思（比如人名、地名，或其他语言的词），告诉我你看到它的句子，我可以按语境解释。","用法提示：**bylaw** 常见于法律、公司治理或社团规则语境；在美国英语里更常见写作 **bylaw**（复数 **bylaws**）。"]}
{"word":"Boylan","summary":{"en":"Boylan is mainly a surname, and it is also well known as a character name in Joyce’s *Ulysses*.","zh":"Boylan 主要是一个姓氏，也因乔伊斯《尤利西斯》中的人物而知名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A family name (surname), often Irish in origin.","zh":"一个姓氏（家族姓），常见于爱尔兰裔人名中。"},"examples":[{"en":"Her last name is Boylan, and her grandparents came from Ireland.","zh":"她姓 Boylan，她的祖父母来自爱尔兰。"},{"en":"Mr. Boylan will speak at the meeting tomorrow.","zh":"Boylan 先生明天将在会议上发言。"}]},{"partOfSpeech":"n.","definition":{"en":"A notable fictional surname, especially referring to Blazes Boylan, a character in James Joyce’s novel *Ulysses*.","zh":"一个知名的文学虚构姓氏，尤指詹姆斯·乔伊斯小说《尤利西斯》（*Ulysses*）中的人物 Blazes Boylan。"},"examples":[{"en":"In *Ulysses*, Boylan is linked to Molly Bloom’s affair.","zh":"在《尤利西斯》中，Boylan 与莫莉·布鲁姆的婚外情有关。"},{"en":"The name Boylan can carry a Joycean literary reference in discussion.","zh":"在讨论乔伊斯作品时，Boylan 这个名字可能带有“乔伊斯式”的文学指涉。"}]}],"phonetic":"/ˈbɔɪlən/","extraExplanation":["“Boylan”通常被认为有爱尔兰盖尔语背景，在英语世界里多作为姓氏使用。看到它首字母大写时，往往是人名或作品中的角色名。","在美国也能见到以 Boylan 命名的品牌/地名（如汽水品牌 Boylan Bottling 等）；是否特指这些，需要结合上下文判断。"]}
{"word":"boylas","summary":{"en":"“boylas” is not a standard English word; it’s probably a misspelling (often of “Boyle’s”) or a proper name.","zh":"“boylas”不是标准英语词；更可能是拼写错误（常见为“Boyle’s”）或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a name (for example, “Boyle’s” in “Boyle’s law”).","zh":"不是标准英语单词。更可能是拼写错误或专有名词（例如出现在“Boyle’s law/波义耳定律”里的“Boyle’s”）。"},"examples":[{"en":"I couldn’t find “boylas” in a dictionary—did you mean “Boyle’s law”?","zh":"我在词典里找不到“boylas”——你是不是想写“Boyle’s law（波义耳定律）”？﻿"},{"en":"Could you share the full sentence with “boylas” so I can identify it?","zh":"你能把包含“boylas”的完整句子发我吗？这样我更容易判断它的意思。"}]}],"phonetic":"/ˈbɔɪləz/","extraExplanation":["“boylas”很可能是把“Boyle’s”（/ˈbɔɪlz/，表示“Boyle 的”）误拼出来的形式，例如：Boyle’s law（波义耳定律）。","也可能是某个名字、网名、地名或其他语言的词（不是英语常用词）。如果你提供：1）出现它的句子；2）主题（化学/物理/游戏/社交媒体等）；3）是否要查“Boyle’s”，我可以给出准确释义与用法。"]}
{"word":"Boyle","summary":{"en":"Boyle is mainly a surname, best known from Robert Boyle and “Boyle’s law” in science.","zh":"Boyle 主要是姓氏，最知名的关联是科学家罗伯特·波义耳以及科学术语“波义耳定律”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), especially known from the scientist Robert Boyle.","zh":"（常见）姓氏，尤其因科学家罗伯特·波义耳（Robert Boyle）而广为人知。"},"examples":[{"en":"Robert Boyle is often called one of the founders of modern chemistry.","zh":"罗伯特·波义耳常被称为现代化学的奠基者之一。"},{"en":"My professor mentioned Boyle when explaining how gases behave.","zh":"老师在讲解气体性质时提到了“波义耳”。"}]},{"partOfSpeech":"n.","definition":{"en":"in science, used in names like “Boyle’s law,” a rule describing the relationship between a gas’s pressure and volume (at constant temperature).","zh":"（科学中）用于“Boyle’s law（波义耳定律）”等名称，指在温度不变时气体压强与体积之间的关系规律。"},"examples":[{"en":"According to Boyle’s law, if the volume decreases, the pressure increases.","zh":"根据波义耳定律，体积减小，压强会增大。"},{"en":"We used Boyle’s law to solve the gas problem in class.","zh":"我们在课上用波义耳定律解这道气体题。"}]}],"synonyms":["(as a surname) no true synonyms"],"phonetic":"/bɔɪl/","extraExplanation":["“Boyle”最常见的文化/学术关联来自17世纪爱尔兰裔科学家 Robert Boyle（罗伯特·波义耳）。他在《The Sceptical Chymist》（常译《怀疑的化学家》）中推动了化学从“炼金术式”的传统走向更现代的实验科学。","“Boyle’s law（波义耳定律）”通常表述为：在温度不变时，气体压强 P 与体积 V 成反比（P×V 为常数）。在日常语境里，人们提到“Boyle”常常就是在指这条定律或这位科学家。"]}
{"word":"boylike","summary":{"en":"Boylike means having a boyish, youthful look or manner.","zh":"boylike 指具有男孩般的外表或举止，带有少年感/稚气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the qualities or appearance typically associated with a boy; youthful, boyish.","zh":"像男孩的；带有典型“男孩气质/外表”的；稚气的、男孩子般的。"},"examples":[{"en":"She had a boylike haircut and wore a simple T-shirt and jeans.","zh":"她留着男孩般的短发，穿着简单的T恤和牛仔裤。"},{"en":"His boylike excitement made everyone smile.","zh":"他那种男孩子般的兴奋让大家都笑了。"}]}],"synonyms":["boyish","youthful","childlike","tomboyish"],"phonetic":"/ˈbɔɪˌlaɪk/","extraExplanation":["“boylike”和“boyish”意思很接近，都表示“像男孩的”。“boylike”更偏向中性描述（外表或气质像男孩）；“boyish”有时更强调淘气、活泼、少年感。","现代语境中，描述他人外表或气质时要注意对方的感受：有些人会喜欢“boylike”带来的中性/率性风格，有些人可能不希望被用性别刻板印象来形容。也可以用更具体的词，如“short haircut（短发）”“youthful（年轻的）”“playful（爱玩、活泼的）”。"]}
{"word":"boylikeness","summary":{"en":"Boylikeness means the quality of being boylike—often youthful, playful, and energetic.","zh":"Boylikeness 指“像男孩一样的特质”，常带有年轻、活泼、充满精力的意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being like a boy; a boyish character (youthful, playful, or innocent behavior)","zh":"男孩气质；像男孩的特质（如天真、活泼、顽皮或带点稚气的行为）"},"examples":[{"en":"Her boylikeness showed in the way she laughed loudly and ran everywhere.","zh":"她身上的男孩气质体现在她大声笑、到处跑的样子里。"},{"en":"The story celebrates a child’s boylikeness—curious, fearless, and full of energy.","zh":"这个故事赞美孩子的男孩气质：好奇、无畏、精力充沛。"}]}],"synonyms":["boyishness","youthfulness","playfulness","childlikeness"],"phonetic":"/ˈbɔɪk.laɪk.nəs/","extraExplanation":["“boylikeness”非常少见，日常英语里更常用的是“boyishness”。两者意思接近，都指“像男孩一样的气质/举止”。","使用时要注意语境：它通常是中性或褒义（活泼、天真），但也可能被理解为“不够成熟”。如果描述成年人，最好搭配具体特质（playful, youthful, energetic）以避免误解。"]}
{"word":"Boylston","summary":{"en":"Boylston is a place name (especially in Boston) most often seen in Boylston Street or Boylston station.","zh":"Boylston 是地名（尤指波士顿），最常见于“博伊尔斯顿街”和“博伊尔斯顿站”等名称中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a name used for places (especially in Boston, Massachusetts), most commonly referring to Boylston Street or locations named after the Boylston family.","zh":"一个用于地名的人名/姓氏（尤指美国马萨诸塞州波士顿），最常见指“博伊尔斯顿街（Boylston Street）”或以博伊尔斯顿家族命名的地点。"},"examples":[{"en":"We met outside the store on Boylston Street.","zh":"我们在博伊尔斯顿街那家店外碰面。"},{"en":"Take the Green Line to Boylston station.","zh":"坐绿线到博伊尔斯顿站。"},{"en":"The hotel is near Boylston and Copley Square.","zh":"那家酒店在博伊尔斯顿街和科普利广场附近。"}]}],"phonetic":"/ˈbɔɪlstən/","extraExplanation":["“Boylston”常见于波士顿市中心：Boylston Street 是一条很有名的街，靠近波士顿公共花园（Boston Common / Public Garden）、科普利广场（Copley Square）等地标，也是波士顿马拉松终点区域附近的重要道路。","读音通常重音在第一音节：BOY-lston。日常口语里中间的“l”音会变得很轻，听起来接近“BOY-stən”。","它来源于英语姓氏（Boylston family）。在美国，一些街道、学校、城镇会以捐赠者或历史人物的姓氏命名，因此你会在地图、地铁站名、地址里经常看到这个词。"]}
{"word":"Boyne","summary":{"en":"Boyne usually refers to the River Boyne in Ireland, and it can also refer to the Battle of the Boyne (1690).","zh":"Boyne通常指爱尔兰的博因河，也可指1690年的博因河战役。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The River Boyne, a river in eastern Ireland (County Meath) that flows into the Irish Sea at Drogheda; known for its historical and archaeological sites.","zh":"博因河：爱尔兰东部的一条河流（主要流经米斯郡），在德罗赫达注入爱尔兰海；以丰富的历史与考古遗址而闻名。"},"examples":[{"en":"We drove along the River Boyne and visited ancient sites nearby.","zh":"我们沿着博因河开车，并参观了附近的古代遗址。"},{"en":"The Boyne Valley is famous for its prehistoric monuments.","zh":"博因河谷以史前遗迹闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"In the phrase “the Boyne,” a shorthand reference to the Battle of the Boyne (1690), a major event in Irish and British history.","zh":"在短语“the Boyne（博因河之战）”中，指1690年的博因河战役，是爱尔兰与英国历史上的重要事件。"},"examples":[{"en":"The museum has an exhibit about the Battle of the Boyne.","zh":"那座博物馆有一个关于博因河战役的展览。"},{"en":"He studied how ‘the Boyne’ is remembered in different communities.","zh":"他研究不同社群如何记忆与讲述“博因河之战”。"}]}],"phonetic":"/bɔɪn/","extraExplanation":["“Boyne”是专有名词，通常首字母大写。提到地理时多指博因河（River Boyne）或博因河谷（Boyne Valley）。","博因河谷附近有新格兰奇（Newgrange）等史前遗址，具有很高的考古与文化价值。","“Battle of the Boyne（博因河战役）”在部分群体的历史记忆与身份认同中意义突出（例如北爱尔兰一些传统纪念活动），在使用相关话题时需注意语境与文化敏感性。"]}
{"word":"Boynton","summary":{"en":"Boynton is most commonly a surname, and it can also be a place name (notably in the U.S.).","zh":"Boynton 最常见的是姓氏，也可作地名（在美国较常见）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A family name (surname).","zh":"一个姓氏（家族姓）。"},"examples":[{"en":"Ms. Boynton will lead the meeting today.","zh":"Boynton 女士今天将主持会议。"},{"en":"My teacher’s last name is Boynton.","zh":"我老师的姓是 Boynton。"}]},{"partOfSpeech":"other","definition":{"en":"A place name used for some towns/communities, especially in the United States (e.g., Boynton Beach in Florida).","zh":"一些城镇/社区的地名，尤其常见于美国（例如佛罗里达州的 Boynton Beach）。"},"examples":[{"en":"They moved to Boynton Beach for the warm weather.","zh":"他们搬到 Boynton Beach 是因为那里天气温暖。"},{"en":"Our hotel is near Boynton.","zh":"我们的酒店在 Boynton 附近。"}]}],"phonetic":"/ˈbɔɪntən/","extraExplanation":["“Boynton”多见于英语世界的姓氏和地名。作为姓氏时，常与英格兰的地名来源有关（很多英文姓氏来自“某地的人/来自某地”的传统）。在阅读或听到它时，通常把它当作专有名词处理：首字母大写，不加冠词（例如：Boynton said…, not *the Boynton*）。"]}
{"word":"boyo","summary":{"en":"“Boyo” is an informal UK term (often Welsh) used to address a boy/young man, like “mate.”","zh":"“boyo”是英式（常见于威尔士）非正式称呼，用来叫男孩或年轻男子，类似“老兄/伙计”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, chiefly UK—especially Wales) A friendly form of address to a boy or young man; similar to “buddy” or “mate.”","zh":"（非正式，主要用于英国，尤指威尔士）对男孩或年轻男子的亲昵称呼，类似“老兄/哥们/伙计”。"},"examples":[{"en":"All right, boyo, are you coming to the match?","zh":"好啦，老兄，你来不来去看比赛？"},{"en":"Thanks for your help, boyo.","zh":"谢啦，伙计。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, sometimes) A boy; a young male person.","zh":"（非正式，有时）男孩；小伙子。"},"examples":[{"en":"When I was a boyo, I spent summers by the sea.","zh":"我还是小男孩的时候，夏天都在海边过。"}]}],"synonyms":["mate","buddy","pal","laddie"],"phonetic":"/ˈbɔɪoʊ/","extraExplanation":["“boyo”带有明显的地域色彩，常见于威尔士英语以及一些英式口语里。语气通常友好，但在某些场合也可能显得居高临下或带点调侃，取决于说话者关系、语境和语气。"]}
{"word":"boyology","summary":{"en":"“Boyology” is an informal, humorous word meaning the know-how or “study” of boys, often used when talking about dating or relationships.","zh":"“boyology”是非正式、带玩笑语气的词，指“男孩学/研究男生”的经验与技巧，常用于恋爱或相处话题。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, humorous) The “study” or know-how of boys—how they think, act, or how to deal with them, especially in dating or friendship contexts.","zh":"（非正式，幽默）“男孩学/研究男生”：指了解男生的想法、行为，或如何与男生相处（尤其在恋爱或友情语境中）的经验或技巧。"},"examples":[{"en":"My friends think I’m an expert in boyology because I always give relationship advice.","zh":"朋友们觉得我是“男孩学”专家，因为我总给人恋爱建议。"},{"en":"She read a bunch of teen articles on boyology before going on her first date.","zh":"她第一次约会前看了好多青少年杂志里的“男孩学”文章。"}]}],"synonyms":["(informal) boy advice","relationship advice","dating tips"],"phonetic":"/bɔɪˈɑlədʒi/","extraExplanation":["这是一个幽默造词：boy + -ology（表示“……学/……研究”，常见于biology, psychology）。在口语或青少年文化里，它通常不是真的学科，而是半开玩笑地指“懂男生、会处理与男生有关的事”。","语气常带轻松调侃，有时也可能显得刻板化（把男生当成“一个类型”来研究）。正式写作中一般不用。"]}
{"word":"boyos","summary":{"en":"“Boyos” is an informal plural term meaning “guys/lads,” or a playful spelling of “boys.”","zh":"“boyos”是非正式的复数称呼，意思接近“伙计们/小伙子们”，也常作为“boys”的俏皮拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of “boyo”) an informal, friendly (sometimes slightly teasing) way to refer to boys or young men; like “guys,” “lads,” or “buddy/buddies.”","zh":"（“boyo”的复数）非正式、带亲昵（有时略带调侃）的称呼，用来指男孩或年轻男子；类似“guys / lads / buddy(ies)”（伙计们/小子们）。"},"examples":[{"en":"All right, boyos, let’s get to work.","zh":"好了，伙计们，开始干活吧。"},{"en":"The boyos went down to the field after school.","zh":"放学后，那帮小伙子去球场了。"}]},{"partOfSpeech":"n.","definition":{"en":"A stylized spelling of “boys,” used to sound more casual, regional, or humorous online.","zh":"“boys”的一种风格化拼写，常用于网络语境，营造更随意、带地域或搞笑的语气。"},"examples":[{"en":"Pizza night with the boyos.","zh":"和兄弟们的披萨之夜。"},{"en":"The boyos are back in town.","zh":"兄弟们回城啦。"}]}],"synonyms":["guys","lads","buddies","boys","fellows"],"phonetic":"/ˈbɔɪoʊz/","extraExplanation":["“boyo”在英式英语里常见于威尔士、爱尔兰等语境，像是一种随口的称呼（类似“mate/lad”）。在美式语境中更常见于网络用法或模仿某种口音的幽默表达。","语气取决于关系和场合：对朋友可能很亲切；对陌生人用可能显得冒昧或带点居高临下，建议谨慎。"]}
{"word":"boys","summary":{"en":"“Boys” most commonly means male children/young men, and informally it can mean a group of male friends (“the boys”). Avoid using “boy” to address adult men in formal situations, and be aware it can be offensive in certain historical/racial contexts.","zh":"“boys”最常见指“男孩/少年（或年轻男子）”，口语中也可指“一群男性朋友（the boys）”。正式场合不要用“boy”称呼成年男性；在某些历史/种族语境下可能带冒犯意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “boy”: a male child or young man.","zh":"“boy”的复数：男孩；少年（或年轻男子）。"},"examples":[{"en":"The boys are playing soccer in the park.","zh":"男孩们正在公园里踢足球。"},{"en":"Two boys from my class helped me carry the books.","zh":"我班里的两个男生帮我搬书。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) A group of male friends or teammates; sometimes used to mean “the guys.”","zh":"（非正式）一群男性朋友/队友；有时相当于“哥们儿/伙计们”。"},"examples":[{"en":"I’m going out with the boys tonight.","zh":"我今晚要和哥们儿出去。"},{"en":"The boys on the team practiced after school.","zh":"队里的小伙子们放学后训练。"}]},{"partOfSpeech":"n.","definition":{"en":"(Dated or offensive in some contexts) A term used by some people to address a man, especially a Black man, in a disrespectful way.","zh":"（语境中可能过时或带冒犯）某些人用来称呼男性（尤其是对黑人男性）的一种不尊重说法。"},"examples":[{"en":"He told them not to call him “boy” because it was disrespectful.","zh":"他告诉他们别叫他“boy”，因为那是不尊重的。"}]}],"synonyms":["lads","guys","boys (the group)","young men"],"phonetic":"/bɔɪz/","extraExplanation":["语用提醒：在朋友之间说“the boys”通常很自然、亲近；但用“boy”直接称呼不熟的成年男性可能显得居高临下。在美国语境里，把黑人成年男性叫“boy”有历史上的种族歧视含义，容易被视为冒犯，应避免。"]}
{"word":"Boyse","summary":{"en":"“Boyse” is most commonly a surname; rarely, it appears as an archaic spelling of “boys.”","zh":"“Boyse”最常见是姓氏；较少见时可作为“boys”的古旧拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname), found especially in Ireland and in English-speaking countries","zh":"姓氏（家族姓），在爱尔兰及英语国家中较常见"},"examples":[{"en":"Professor Boyse will speak at the conference tomorrow.","zh":"Boyse 教授将在明天的会议上发言。"},{"en":"Her last name is Boyse.","zh":"她的姓是 Boyse。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare/archaic) an old spelling of “boys,” the plural of “boy”","zh":"（罕见/古旧拼写）“boys”（boy 的复数）的旧式拼写"},"examples":[{"en":"In some older texts, you may see “boyse” used where we would write “boys” today.","zh":"在一些较早的文本里，你可能会看到用 “boyse” 表示我们今天写的 “boys”。"}]}],"synonyms":["(archaic spelling) boys"],"phonetic":"/bɔɪz/","extraExplanation":["“Boyse”最常见的用法是专有名词（姓）。在现代英语写作中，如果你想表达“男孩们”，通常应写 boys；写成 boyse 往往会被视为拼写错误，除非是在引用古文、旧版文献或特定的姓名。"]}
{"word":"boysenberries","summary":{"en":"Boysenberries are dark purple bramble berries, related to raspberries and blackberries, often used in desserts and jams.","zh":"波森莓是一种深紫色的悬钩子类浆果，与覆盆子和黑莓有亲缘关系，常用于甜点和果酱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a dark reddish-purple berry (a type of bramble fruit) that is a hybrid related to raspberries and blackberries, often used in jams, pies, and desserts","zh":"波森莓；一种深红紫色的浆果，属于悬钩子类水果，是与覆盆子、黑莓有亲缘关系的杂交品种，常用于果酱、派和甜点"},"examples":[{"en":"We bought boysenberries at the farmers’ market and made jam.","zh":"我们在农夫市集买了波森莓，做了果酱。"},{"en":"Boysenberry pie is sweet and slightly tart.","zh":"波森莓派甜中带一点酸。"},{"en":"This yogurt is flavored with boysenberries.","zh":"这款酸奶是波森莓口味的。"}]}],"synonyms":["bramble berry","berry"],"phonetic":"/ˈbɔɪzənˌbɛriz/","extraExplanation":["“Boysenberry”源自栽培者Rudolph Boysen的姓氏。它在美国加州被进一步推广并商业化，因此在北美甜点与果酱文化中很常见。","发音与拼写提示：boysenberries是复数；单数为boysenberry。英语中常把它当作一种具体水果名，也可作“boysenberry jam / boysenberry pie”等名词短语。","口感理解：常被描述为介于覆盆子与黑莓之间，颜色深、香气浓，味道通常“甜而微酸（sweet-tart）”。"]}
{"word":"boysenberry","summary":{"en":"A boysenberry is a dark purple hybrid berry often used in desserts and jams.","zh":"boysenberry指一种深紫色的杂交莓果，常用于甜点和果酱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a dark purple berry that is a hybrid (a cross) of raspberry, blackberry, and related berries, often used in jams, pies, and syrups","zh":"波森莓（深紫色的杂交莓果，源自树莓、黑莓及相关莓类的杂交），常用于果酱、派和糖浆"},"examples":[{"en":"I ordered a slice of boysenberry pie for dessert.","zh":"我点了一块波森莓派当甜点。"},{"en":"Boysenberry jam tastes sweet and slightly tart.","zh":"波森莓果酱尝起来甜中带一点酸。"},{"en":"This yogurt is flavored with boysenberry and vanilla.","zh":"这款酸奶是波森莓和香草口味的。"}]}],"synonyms":["hybrid berry","berry (general)"],"phonetic":"/ˈbɔɪzənˌbɛri/","extraExplanation":["“boysenberry”来自培育者Rudolph Boysen的姓氏；后来在美国加州由农学家与种植者推广，逐渐成为常见的果酱与甜点口味。","在北美语境里，boysenberry常让人联想到“深色莓果风味”（比树莓更浓、比黑莓更香），常见于派、奶昔、冰淇淋、果酱等。"]}
{"word":"boyship","summary":{"en":"“Boyship” means the state or time of being a boy (a rarer word for “boyhood”).","zh":"“boyship”指“作为男孩的状态或那段男孩时期”，是较少见的“boyhood”的说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or period of being a boy; boyhood","zh":"男孩时期；童年（男孩阶段）；男孩身份"},"examples":[{"en":"In his boyship, he spent long summers by the river.","zh":"在他的男孩时期，他常常在河边度过漫长的夏天。"},{"en":"The novel traces the hero from boyship to adulthood.","zh":"这部小说描写主人公从男孩时期走向成年。"}]}],"synonyms":["boyhood","childhood","youth"],"phonetic":"/ˈbɔɪʃɪp/","extraExplanation":["“boyship”比较少见，更常用的是“boyhood”。它由“boy + -ship”构成，后缀“-ship”常表示“身份/状态/时期”（如 friendship 友谊、hardship 困苦、leadership 领导力），所以 boyship 字面意思就是“作为男孩的状态/阶段”。","在文学语境中，boyship 有时带一点怀旧或抒情的色彩，用来强调“那段作为男孩的时光”。"]}
{"word":"Boystown","summary":{"en":"Boystown can refer to the Boys Town nonprofit/community in Nebraska or (informally) a well-known LGBTQ+ neighborhood nickname, especially in Chicago.","zh":"Boystown 既可指内布拉斯加州的 Boys Town 非营利机构/社区，也可（非正式）指以 LGBTQ+ 文化著称的街区昵称，尤其在芝加哥。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a nonprofit organization and campus community in Nebraska (USA) founded to care for and educate children and families in need; often written as “Boys Town.”","zh":"美国内布拉斯加州的一个非营利机构及校园式社区，最初为照顾与教育需要帮助的儿童和家庭而建立；常写作“Boys Town”。"},"examples":[{"en":"Boys Town provides counseling and education services for children and families.","zh":"Boys Town 为儿童和家庭提供咨询与教育服务。"},{"en":"He donated to Boys Town after learning about its youth programs.","zh":"他了解该机构的青少年项目后，向 Boys Town 捐款。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) a nickname for a neighborhood known for its LGBTQ+ community and nightlife—especially the Northalsted area in Chicago.","zh":"（非正式）指以 LGBTQ+ 社群与夜生活闻名的街区的昵称——尤其常指芝加哥的 Northalsted 一带。"},"examples":[{"en":"We met friends in Boystown before the show.","zh":"演出前我们在 Boystown 和朋友碰面。"},{"en":"Boystown is known for its Pride events and bars.","zh":"Boystown 以骄傲月活动和酒吧闻名。"}]}],"synonyms":["Boys Town","Northalsted","(Chicago) LGBTQ+ neighborhood"],"phonetic":"ˈbɔɪz.taʊn","extraExplanation":["“Boys Town”最初由天主教神父 Edward J. Flanagan 于 1917 年创立，后来发展为提供教育、心理与家庭支持的全国性机构。","芝加哥的“Boystown”这一称呼在当代更常与 LGBTQ+ 文化空间相关；近年来也常用更正式的地名 “Northalsted” 来指代该区域。"]}
{"word":"Boyt","summary":{"en":"“Boyt” is usually a proper name (surname/brand), not a common everyday English word; it may also be a misspelling of “bought,” “bout,” etc.","zh":"“Boyt”通常是专有名词（姓氏/品牌），不是常见日常英语词；也可能是 “bought”“bout”等的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (surname) and sometimes a brand/company name (e.g., in outdoor gear or firearm accessories). It is not a common English vocabulary word in everyday writing.","zh":"专有名词：人名（姓氏），有时也用作品牌或公司名（例如户外装备、枪械配件等）。它不是日常英语里常见的普通词汇。"},"examples":[{"en":"Boyt is a family name, so you may see it in a list of surnames.","zh":"Boyt 是一个姓氏，所以你可能会在姓氏名单里看到它。"},{"en":"I bought a Boyt rifle case online.","zh":"我在网上买了一个 Boyt 的步枪枪套/枪包。"}]},{"partOfSpeech":"other","definition":{"en":"Often a misspelling of other words, depending on context (commonly: “bout,” “boy,” or “bought”).","zh":"常见拼写错误：可能想写的是其他词，具体要看上下文（常见为 bout、boy 或 bought）。"},"examples":[{"en":"Did you mean “bought” (past tense of buy)?","zh":"你是不是想写 “bought”（buy 的过去式）？"},{"en":"Did you mean “bout,” as in “a boxing bout”?","zh":"你是不是想写 “bout”，比如 “a boxing bout（拳击比赛）”？"}]}],"synonyms":["(proper noun) no direct synonyms"],"phonetic":"/bɔɪt/","extraExplanation":["“Boyt”作为普通词几乎不使用；更常见的是作为姓氏或品牌名称出现。如果你能提供一句完整的句子或你看到它的场景（聊天、文章、商品名等），我可以帮你判断它到底指什么，或是不是拼写错误。"]}
{"word":"boyuna","summary":{"en":"“Boyuna” is a Turkish word most commonly meaning “constantly / nonstop,” and it can also literally mean “to the neck.”","zh":"“boyuna”是土耳其语，最常见意思是“一直/不停地”，也可作字面义“到脖子/朝脖子”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"continuously; all the time; nonstop (used in Turkish in everyday speech).","zh":"一直；总是；不停地（土耳其语日常用法）。"},"examples":[{"en":"He keeps talking boyuna, and I can’t get a word in.","zh":"他一直（boyuna）在说话，我根本插不上话。"},{"en":"It rained boyuna all weekend.","zh":"整个周末一直（boyuna）在下雨。"}]},{"partOfSpeech":"prep.","definition":{"en":"(literal, from Turkish) to the neck; toward the neck.","zh":"（字面义，源自土耳其语）到脖子；朝脖子方向。"},"examples":[{"en":"The scarf came up boyuna and kept his neck warm.","zh":"围巾拉到脖子（boyuna），把他的脖子保暖住了。"}]}],"synonyms":["constantly","all the time","nonstop","continuously","without stopping"],"phonetic":"/boʊˈjuːnɑ/","extraExplanation":["“boyuna”来自土耳其语名词“boyun”（脖子）的变形：-a 是表示“到/向”的格尾，所以字面意思是“到脖子”。在口语里它常被引申为“持续不断地、一直”，相当于英语的 “constantly / all the time / nonstop”。"]}
