{"word":"Boz","summary":{"en":"“Boz” is best known as Charles Dickens’s early pen name.","zh":"“Boz”最常见的意思是狄更斯早期使用的笔名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The pen name used by the English novelist Charles Dickens, especially for his early writings (for example, his newspaper and magazine sketches).","zh":"英国小说家查尔斯·狄更斯（Charles Dickens）早期作品常用的笔名（尤其用于报刊杂文与小品）。"},"examples":[{"en":"The sketches were first published under the name Boz.","zh":"这些小品最初以“Boz”的名字发表。"},{"en":"Dickens became famous quickly, even before many readers knew who “Boz” really was.","zh":"狄更斯很快成名，甚至在许多读者还不知道“Boz”究竟是谁之前。"}]}],"synonyms":["Charles Dickens","Dickens"],"phonetic":"/bɑz/","extraExplanation":["“Boz”最有名的出处是狄更斯早期作品《Sketches by Boz》（常译《博兹札记/博兹素描》）。","据常见说法，这个笔名与狄更斯家中对弟弟“摩西（Moses）”的昵称有关：先叫“Boses”，后来简化成“Boz”。因此它带有家庭玩笑式的亲昵称呼色彩。","写作与阅读语境中，你常会在19世纪英国文学史、期刊文化或狄更斯研究里看到“Boz”，一般不把它当作普通词汇使用。"]}
{"word":"boza","summary":{"en":"Boza is a traditional fermented grain drink from Turkey and the Balkans, often sweet, thick, and slightly tangy.","zh":"Boza 是一种来自土耳其和巴尔干地区的传统发酵谷物饮料，常见特点是偏甜、较浓稠、带微酸。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional fermented drink (usually mildly alcoholic) made from grains such as millet, wheat, or corn, popular in Turkey and parts of the Balkans","zh":"一种传统发酵谷物饮料（通常酒精度很低或几乎没有），多用小米、小麦或玉米制作，在土耳其和巴尔干地区很常见"},"examples":[{"en":"In Istanbul, people often drink boza in winter, topped with cinnamon.","zh":"在伊斯坦布尔，人们冬天常喝 boza，上面会撒肉桂粉。"},{"en":"She tried boza for the first time and said it tasted sweet and slightly tangy.","zh":"她第一次喝 boza，说味道偏甜，带一点点酸。"},{"en":"The vendor sold boza from a large container on the street.","zh":"小贩在街头从一个大容器里舀着卖 boza。"}]}],"synonyms":["fermented grain drink","traditional fermented beverage"],"phonetic":"/ˈboʊzə/","extraExplanation":["Boza 常被形容为“浓稠、微甜、带点酸”的口感，有点像较稀的谷物酸奶或发酵粥饮料。不同地区配方差异很大，酒精含量也可能从几乎为零到略有酒精。","在土耳其文化里，boza 常与冬季夜晚、街头叫卖联系在一起，常见搭配是肉桂粉（cinnamon）与烤鹰嘴豆（roasted chickpeas）。","英语里 boza 属于外来词（loanword），主要用于介绍土耳其/巴尔干饮食文化的语境中；日常英语对话里不算常见。"]}
{"word":"bozal","summary":{"en":"Bozal most commonly means “muzzle” in Spanish contexts; historically it can also refer to an African-born enslaved person in Spanish colonies (a dated, potentially offensive sense).","zh":"Bozal 最常见义是（西语语境中的）“口套”；在历史语境中也可指西班牙殖民地“非洲出生的奴隶”（较陈旧且可能冒犯）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in Spanish) a muzzle; a strap or device put over an animal’s mouth to stop it from biting or eating.","zh":"（尤指西班牙语语境）口套；给动物嘴部套上的装置，用来防止咬人或进食。"},"examples":[{"en":"The dog wore a bozal during the vet visit.","zh":"去看兽医时，那只狗戴着口套（bozal）。"},{"en":"In some training guides, “bozal” simply means a muzzle.","zh":"在一些训练指南里，bozal 就是指“口套”。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical, Caribbean/Latin American Spanish; sometimes seen in English academic writing) an African-born enslaved person in Spanish colonies; by extension, speech or culture seen as strongly African-influenced. This usage is dated and can be offensive depending on context.","zh":"（历史用语，加勒比/拉美西语；英语学术语境中偶见）指西班牙殖民地中“非洲出生的奴隶”；引申为被视为带有强烈非洲影响的语言或文化。这一用法带有时代色彩，视语境可能冒犯。"},"examples":[{"en":"The article discusses the difference between “bozal” and “creole” populations in colonial records.","zh":"那篇文章讨论了殖民记录中 “bozal” 与 “creole” 人群的区别。"},{"en":"Some researchers study “bozal Spanish” in early Caribbean texts.","zh":"一些研究者会研究早期加勒比文本中的 “bozal Spanish（博萨尔西班牙语）”。"}]}],"synonyms":["muzzle","mouthpiece","halter (related)"],"phonetic":"/boʊˈzɑːl/","extraExplanation":["“Bozal”源自西班牙语，字面常见义是“口套/笼头”。历史上它也被用来标记殖民社会中的身份差异（如“非洲出生”与“本地出生”），因此在谈论奴隶制与种族史时需谨慎使用并明确学术语境。若只是指动物口套，通常不会引起敏感联想。"]}
{"word":"Bozcaada","summary":{"en":"Bozcaada is a Turkish Aegean island (also known historically as Tenedos), famous for wine, beaches, and a historic castle.","zh":"Bozcaada 是土耳其爱琴海的一座岛（历史上也称 Tenedos），以葡萄酒、海滩和古堡闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Turkish island in the Aegean Sea (in Çanakkale Province), known for its vineyards, wine culture, beaches, and historic castle; historically called Tenedos.","zh":"土耳其爱琴海的一座岛屿（属恰纳卡莱省），以葡萄园与葡萄酒文化、海滩和古堡闻名；历史上也称“特内多斯”（Tenedos）。"},"examples":[{"en":"We spent a quiet weekend on Bozcaada, biking between vineyards and small coves.","zh":"我们在博兹贾阿达度过了一个安静的周末，骑车穿梭在葡萄园和小海湾之间。"},{"en":"Bozcaada Castle is one of the island’s main landmarks.","zh":"博兹贾阿达城堡是这座岛的主要地标之一。"}]}],"synonyms":["Tenedos"],"phonetic":"/boʊzˈdʒɑːdə/","extraExplanation":["“Bozcaada”是土耳其语地名，常被称为土耳其第三大岛（按面积）；英文旅行文章里也会用其古名“Tenedos”。","该岛在古希腊与奥斯曼时期都很重要，位置靠近达达尼尔海峡入口，因此在历史与战争叙事中偶尔会被提及。"]}
{"word":"Bozeman","summary":{"en":"Bozeman is most commonly a city in Montana, USA; it can also be a surname.","zh":"Bozeman最常指美国蒙大拿州的城市；也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a city in southwestern Montana, U.S., known for Montana State University and as a gateway to outdoor recreation near Yellowstone National Park.","zh":"美国蒙大拿州西南部的一座城市，以蒙大拿州立大学闻名，也常被视为前往黄石国家公园及周边户外活动的门户。"},"examples":[{"en":"I’m flying into Bozeman to visit Yellowstone.","zh":"我要飞到博兹曼，然后去黄石公园。"},{"en":"Bozeman is a college town with great access to hiking and skiing.","zh":"博兹曼是一座大学城，徒步和滑雪都很方便。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"（较少见）姓氏。"},"examples":[{"en":"Ms. Bozeman will lead today’s meeting.","zh":"博兹曼女士将主持今天的会议。"}]}],"phonetic":"/ˈboʊzmæn/","extraExplanation":["“Bozeman”是专有名词，作为地名时通常大写；在口语里常说“Bozeman, Montana”以避免与姓氏或不熟悉该地的人混淆。","该地名来自19世纪的拓荒者/探路人John Bozeman；如今也常与“Gallatin Valley（加拉廷山谷）”“Big Sky（大天空滑雪度假区）”等周边地名一起出现。"]}
{"word":"Bozen","summary":{"en":"Bozen is the German name for the Italian city Bolzano in South Tyrol.","zh":"Bozen 是意大利南蒂罗尔城市博尔扎诺（Bolzano）的德语名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bozen: the German name for Bolzano, a city in South Tyrol (northern Italy). It is known for its strong German- and Italian-speaking culture, Alpine setting, and role as a regional center.","zh":"Bozen：意大利北部南蒂罗尔（South Tyrol）地区城市博尔扎诺（Bolzano）的德语名称。该城以德语与意大利语并存的文化、阿尔卑斯山地风光，以及区域中心地位而闻名。"},"examples":[{"en":"We stayed overnight in Bozen before taking the train into the Dolomites.","zh":"我们在博岑（Bozen）住了一晚，然后坐火车前往多洛米蒂山脉。"},{"en":"In Bozen, you’ll often see street signs in both German and Italian.","zh":"在博岑，你经常会看到德语和意大利语双语路牌。"}]}],"synonyms":["Bolzano"],"phonetic":"/ˈboʊtsən/","extraExplanation":["“Bozen / Bolzano”这对双名体现了南蒂罗尔的历史与语言现状：当地德语使用者比例很高，官方与公共服务常见德语、意大利语并用。","在英文语境中更常见的城市名是“Bolzano”，但在讨论德语文化、德语资料或当地德语环境时会用“Bozen”。"]}
{"word":"bozine","summary":{"en":"“Bozine” is not a standard English word; it is most likely a misspelling of “bovine,” meaning “related to cows” or “a cow/bull” in formal use.","zh":"“bozine”不是标准英语词；最可能是把“bovine”拼错了，意思是“牛的/似牛的”，或在正式用法中指“一头牛/公牛”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely intended: “bovine”) relating to cows; cow-like.","zh":"（多半是想写：bovine）牛的；似牛的。"},"examples":[{"en":"Bovine animals include cows, bulls, and calves.","zh":"牛科动物包括母牛、公牛和小牛。"},{"en":"The vet specializes in bovine medicine.","zh":"这位兽医专攻牛的疾病治疗。"}]},{"partOfSpeech":"n.","definition":{"en":"(Likely intended: “bovine”) a cow or bull (used especially in formal/scientific contexts).","zh":"（多半是想写：bovine）牛（较正式/科学用法）。"},"examples":[{"en":"The farmer keeps several bovines on this land.","zh":"这位农民在这片土地上养了几头牛。"},{"en":"The report discusses the health of local bovines.","zh":"报告讨论了当地牛群的健康状况。"}]}],"synonyms":["cow-like","cattle-related","cow","cattle"],"phonetic":"/ˈboʊvaɪn/","extraExplanation":["“bozine”在常见英语词典中不是标准单词拼写；最接近、也最常见的可能是“bovine”。","“bovine”源自拉丁语“bos”（牛），因此常用于较正式的语境，如农业、兽医学、动物学等。","如果你是在特定品牌、地名、人名或科技术语里看到“Bozine/bozine”，告诉我原句，我可以帮你判断它的确切含义。"]}
{"word":"Bozman","summary":{"en":"Bozman is usually a surname; it can also be a spelling variant of Bozeman (a city in Montana).","zh":"Bozman 通常是姓氏；也可能是 Bozeman（美国蒙大拿州城市名）的拼写变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a proper name (most commonly a surname) and sometimes a misspelling or variant of “Bozeman” (a city in Montana, USA).","zh":"专有名词（最常见作姓氏），有时也被用作“Bozeman”（美国蒙大拿州城市）的误拼或变体。"},"examples":[{"en":"My professor’s last name is Bozman.","zh":"我教授的姓是 Bozman。"},{"en":"Did you mean Bozeman, Montana—not Bozman?","zh":"你想说的是蒙大拿州的 Bozeman，而不是 Bozman 吗？"}]}],"synonyms":["Bozeman (common intended spelling)"],"phonetic":"/ˈboʊzmæn/","extraExplanation":["“Bozeman”是蒙大拿州著名城市名，靠近黄石国家公园与多所高校；在英文里人名/地名的拼写差一两个字母很常见，正式写作（证件、论文、机票/酒店预订）时最好核对原始拼写。"]}
{"word":"bozo","summary":{"en":"“Bozo” is informal slang for a foolish or annoying person, and it’s usually insulting.","zh":"“bozo”是非正式俚语，指愚蠢或讨厌的人，通常带侮辱意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rude slang word for a foolish, annoying, or incompetent person; an idiot or clown (often used as an insult).","zh":"（俚语、粗鲁）指愚蠢、讨厌或不称职的人；笨蛋、小丑（常作骂人用语）。"},"examples":[{"en":"Don’t be a bozo—read the instructions first.","zh":"别当笨蛋——先把说明书读一遍。"},{"en":"He called the other driver a bozo after the near accident.","zh":"差点出事故后，他骂对方司机是个“蠢货”。"}]},{"partOfSpeech":"adj.","definition":{"en":"Used as an adjective before a noun to mean “stupid” or “clownish.”","zh":"作定语放在名词前，表示“蠢的/像小丑一样的”。"},"examples":[{"en":"That was a bozo move.","zh":"那真是个蠢操作。"},{"en":"We’re stuck with this bozo plan again.","zh":"我们又得照这个蠢计划来做。"}]}],"synonyms":["idiot","fool","clown","dope","jerk"],"phonetic":"/ˈboʊzoʊ/","extraExplanation":["“bozo”在美国口语里语气通常比较侮辱、带嘲讽。对不熟的人使用容易引发冲突；更委婉的替代说法有“silly,” “goof,” “jerk”（语气也不太友好）等。","它在美国文化里也和“Bozo the Clown（波佐小丑）”这个电视小丑形象有关，因此带有“像小丑一样可笑/不靠谱”的联想。"]}
{"word":"Bozoo","summary":{"en":"“Bozoo” is usually a variant spelling of “bozo,” meaning a foolish/incompetent person, sometimes used jokingly like “clown.”","zh":"“Bozoo”通常是“bozo”的变体拼写，常指“笨蛋/无能的人”，有时也可半开玩笑地指“像小丑一样爱搞怪的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a foolish or incompetent person (informal; often insulting)","zh":"笨蛋；蠢人；无能的人（非正式用语，常带侮辱）"},"examples":[{"en":"Don’t be a bozo—read the instructions first.","zh":"别当笨蛋——先把说明书读一遍。"},{"en":"He parked in the middle of the road like a total bozo.","zh":"他把车停在路中间，真是蠢到家了。"}]},{"partOfSpeech":"n.","definition":{"en":"a silly clown-like person (sometimes used more playfully than as an insult)","zh":"小丑般的人；爱搞怪的人（有时偏开玩笑，不一定是骂人）"},"examples":[{"en":"Quit being a bozo and come help me.","zh":"别闹了，过来帮我一下。"}]}],"synonyms":["idiot","fool","clown","jerk"],"phonetic":"/ˈboʊzoʊ/","extraExplanation":["“Bozoo”常被当作“bozo”的变体拼写。英语里“bozo”在20世纪因电视形象“Bozo the Clown（波佐小丑）”而广为人知，后来逐渐引申为“蠢人/不靠谱的人”。","语气提示：在陌生人或正式场合使用可能显得粗鲁；对朋友可能是半开玩笑，但仍要注意关系和语境。"]}
{"word":"bozos","summary":{"en":"“Bozos” is the plural of “bozo,” a slang insult for foolish or incompetent people.","zh":"“bozos”是“bozo”的复数，指愚蠢或不称职的人（俚语、带侮辱性）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of “bozo”) a foolish, rude, or incompetent person; a slang insult meaning “idiot” or “clown.”","zh":"（“bozo”的复数）蠢人；不靠谱的人；带侮辱性的俚语，类似“傻瓜/小丑”。"},"examples":[{"en":"Ignore those bozos in the comments—they’re just trying to provoke people.","zh":"别理评论区那些蠢人——他们只是想挑事。"},{"en":"We can’t trust them with this job; they’re a bunch of bozos.","zh":"这活儿不能交给他们；他们一群不靠谱的人。"}]}],"synonyms":["idiots","morons","jerks","clowns","fools"],"phonetic":"/ˈboʊzoʊ/","extraExplanation":["“bozo”在美式英语里常用作带贬义的口语侮辱，语气从“有点刻薄的吐槽”到“明显骂人”不等；在正式场合、工作邮件或对陌生人当面使用，通常会显得很无礼。","它也常带有“像马戏团小丑一样滑稽/笨拙”的形象色彩，因此有时用于强调对方做事不专业、闹笑话。"]}
{"word":"Bozovich","summary":{"en":"“Bozovich” is most commonly a surname (last name), and it can also be used as a brand or account name derived from that surname.","zh":"“Bozovich”最常见是一个姓氏，也可能作为由该姓氏衍生的品牌名或账号名使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), likely of Slavic origin; used to refer to a person or family with this last name.","zh":"一个姓氏（家族姓），可能源自斯拉夫语系；用来指代拥有该姓的人或家族。"},"examples":[{"en":"Dr. Bozovich will lead today’s seminar.","zh":"Bozovich 博士将主持今天的研讨会。"},{"en":"I emailed Ms. Bozovich to confirm the appointment.","zh":"我给 Bozovich 女士发了邮件确认预约。"}]},{"partOfSpeech":"n.","definition":{"en":"a name that may appear as a brand, company name, or username based on the surname “Bozovich,” depending on context.","zh":"基于“Bozovich”这个姓氏形成的名称；在不同语境中可能是品牌名、公司名或用户名。"},"examples":[{"en":"I saw “Bozovich” listed as the vendor on the invoice.","zh":"我在发票上看到供应商写的是“Bozovich”。"},{"en":"Their account name is Bozovich on the forum.","zh":"他们在论坛上的账号名是 Bozovich。"}]}],"synonyms":["(no true synonyms; proper name)"],"phonetic":"/bəˈzɑvɪtʃ/","extraExplanation":["“Bozovich”看起来像斯拉夫地区的姓氏拼写变体。很多斯拉夫姓氏常见结尾如 -ić / -ovich / -vich，含义常与“某人的儿子/后代”有关（不同语言与地区用法会有差异）。","作为专有名词（人名/姓氏），英语里通常不翻译含义，只保留拼写；需要时可在中文里音译为“博佐维奇/博佐维奇”。实际译法常取决于本人偏好或既有官方译名。"]}
{"word":"Bozrah","summary":{"en":"Bozrah is a proper place name, best known as an ancient city of Edom mentioned in the Bible.","zh":"Bozrah 是一个地名，最常见指《圣经》中提到的以东古城“波斯拉/博兹拉”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A place name (proper noun), most commonly referring to an ancient city in Edom mentioned in the Bible, traditionally associated with the region south of the Dead Sea (in or near modern-day Jordan).","zh":"地名（专有名词）：最常见指《圣经》中提到的以东（Edom）古城“波斯拉/博兹拉”（Bozrah），传统上被认为位于死海南部一带（今约旦境内或附近）。"},"examples":[{"en":"In the Bible, Bozrah is listed as an important city of Edom.","zh":"在《圣经》中，Bozrah 被列为以东的重要城市之一。"},{"en":"Some commentaries connect Bozrah with later sites in the region of modern Jordan.","zh":"一些注释书把 Bozrah 与今约旦一带的后期遗址联系起来。"}]},{"partOfSpeech":"n.","definition":{"en":"A less common place name for other locations that share the same spelling (for example, a settlement in New South Wales, Australia).","zh":"较少见的地名：也可能指其他同名地点（例如澳大利亚新南威尔士州的一个地方名）。"},"examples":[{"en":"Bozrah also appears as a locality name in Australia.","zh":"Bozrah 也曾作为澳大利亚的一个地名出现。"}]}],"phonetic":"/ˈbɑːzrɑː/","extraExplanation":["“Bozrah”主要以《圣经》语境出现，常见于旧约中关于以东的地理与历史叙述，也出现在一些先知书的象征性描写里。中文译名常见“波斯拉”或“博兹拉”，不同版本翻译会略有差异。","在现代研究中，Bozrah 的具体遗址位置并非完全一致定论；不同学者可能将其与约旦南部若干古址作比较或推测。"]}
{"word":"Bozuwa","summary":{"en":"“Bozuwa” is most likely used as a name or identifier, not a common English word with a fixed meaning.","zh":"“Bozuwa”更可能是姓名或标识符，而不是有固定词义的常见英语词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (e.g., a person’s name, username, or place name). It is not a standard English vocabulary word with a widely agreed dictionary meaning.","zh":"专有名词（例如人名、网名或地名）。它不是一个在英语中有公认词典释义的常见词汇。"},"examples":[{"en":"Bozuwa posted a new video today.","zh":"Bozuwa 今天发了一个新视频。"},{"en":"I met someone named Bozuwa at the conference.","zh":"我在会议上遇到一个叫 Bozuwa 的人。"}]}],"phonetic":"/boʊˈzuːwə/","extraExplanation":["“Bozuwa”更像是外语词的罗马字转写、个人昵称/ID、或特定文化语境中的姓名拼写。由于缺少上下文（来自哪种语言、出现场景、是否是人名/地名/品牌名），无法给出可靠的“英语词义”。如果你告诉我它出现在哪句话里、或来自哪种语言/地区，我可以进一步帮你判断含义与更自然的英文用法。"]}
{"word":"Bozzaris","summary":{"en":"Bozzaris usually refers to Markos (Marco) Bozzaris, a Greek independence hero often remembered in English poetry.","zh":"Bozzaris通常指希腊独立战争英雄马科斯（马尔科）·博扎里斯，常见于英语诗歌等文本中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) Markos (Marco) Bozzaris (c. 1788–1823), a Greek military leader and national hero of the Greek War of Independence, often mentioned in English literature (especially in the poem “Marco Bozzaris” by Fitz-Greene Halleck).","zh":"（专有名词）马科斯（马尔科）·博扎里斯（约1788–1823），希腊独立战争时期的军事领袖与民族英雄；在英语文学中常被提及（尤其见于费兹-格林·哈莱克的诗《Marco Bozzaris》）。"},"examples":[{"en":"In American literature classes, students sometimes read Halleck’s poem about Bozzaris.","zh":"在美国文学课上，学生有时会读哈莱克写博扎里斯的诗。"},{"en":"The name Bozzaris is associated with bravery during the Greek War of Independence.","zh":"“Bozzaris”这个名字常与希腊独立战争中的英勇联系在一起。"}]}],"synonyms":["Markos Botsaris","Marco Bozzaris"],"phonetic":"boʊˈzɑrɪs","extraExplanation":["“Bozzaris”是英语里常见的拼写方式；在现代学术或希腊语转写中也常见“Botsaris”。英语中提到他，多与19世纪的浪漫主义/爱国主义写作传统有关。"]}
{"word":"bozze","summary":{"en":"“Bozze” is an Italian word meaning either drafts (rough versions) or proof copies in publishing.","zh":"“Bozze”是意大利语，常指“草稿”，在出版语境中也指“校样”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Italian) drafts; rough versions of a text or plan before the final version.","zh":"（意大利语）草稿；在最终定稿前的文本或计划的初稿、粗稿。"},"examples":[{"en":"I’ll send you the bozze tonight so you can review the structure.","zh":"我今晚把bozze（草稿）发给你，你可以看看结构。"},{"en":"These bozze still need a clearer introduction and fewer repetitions.","zh":"这些bozze（草稿）还需要更清晰的引言并减少重复。"}]},{"partOfSpeech":"n.","definition":{"en":"(Italian, publishing) proof copies; pre-publication versions used to check for errors.","zh":"（意大利语，出版）校样；出版前用来检查错误的样稿。"},"examples":[{"en":"The editor marked typos directly on the bozze.","zh":"编辑直接在bozze（校样）上标出了错别字。"},{"en":"We must approve the bozze before printing the book.","zh":"在印刷这本书之前，我们必须确认bozze（校样）。"}]}],"synonyms":["drafts","rough copies","proofs","page proofs"],"phonetic":"/ˈbɔtse/","extraExplanation":["“Bozze”是意大利语复数形式，单数是“bozza”。在出版语境中很常见，接近英语里的 “proofs / page proofs”（校样），而在更一般的写作语境里则接近 “drafts”（草稿）。","在意大利的编辑流程里，你可能会看到“prima bozza / seconda bozza”（第一/第二版校样或草稿），表示不同轮次的修改版本。"]}
{"word":"bozzetto","summary":{"en":"Bozzetto means a small preliminary sketch or model used to plan a larger artwork.","zh":"Bozzetto 指为大型艺术作品准备的初步小稿或草模。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small preliminary sketch or model made as a plan for a larger artwork (such as a painting, fresco, or sculpture).","zh":"（艺术）“小稿/草模”：为更大的作品（如绘画、湿壁画或雕塑）而做的初步草图或小模型。"},"examples":[{"en":"The museum displayed the bozzetto beside the finished sculpture to show the artist’s process.","zh":"博物馆把草模（bozzetto）和成品雕塑并排展出，以展示艺术家的创作过程。"},{"en":"Before painting the ceiling, she made a quick bozzetto to test the composition.","zh":"在画天花板之前，她先画了一张小稿（bozzetto）来测试构图。"}]}],"synonyms":["sketch","study","draft","maquette","preliminary model"],"phonetic":"/boʊˈzɛtoʊ/","extraExplanation":["这是意大利语借词，复数常写作 bozzetti（意大利语复数形式），在英语艺术史与博物馆语境中较常见；日常英语里更常用 sketch（草图）或 maquette（小型立体模型/缩样）。","在巴洛克与文艺复兴艺术研究中，你可能会看到 bozzetto 指油画小稿（为大型祭坛画或天顶画做准备）或为雕塑/建筑做的泥塑、蜡模等“草模”。"]}

