{"word":"BP","summary":{"en":"BP most commonly means blood pressure; it can also refer to the energy company BP, or “Before Present” in archaeology.","zh":"BP最常见指“血压”；也可指能源公司BP（英国石油），或考古学中的“距今（Before Present）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"blood pressure (medical abbreviation).","zh":"血压（医学缩写）。"},"examples":[{"en":"My BP is a little high, so my doctor asked me to cut down on salt.","zh":"我的BP（血压）有点高，所以医生让我少吃盐。"},{"en":"The nurse checked his BP before giving the medicine.","zh":"护士在给药前测了他的BP（血压）。"}]},{"partOfSpeech":"other","definition":{"en":"BP (an international oil and gas company; originally British Petroleum).","zh":"英国石油公司BP（一家国际石油与天然气公司，原名British Petroleum）。"},"examples":[{"en":"BP announced a new energy investment plan.","zh":"BP公布了一项新的能源投资计划。"},{"en":"He used to work for BP as an engineer.","zh":"他以前在BP做工程师。"}]},{"partOfSpeech":"other","definition":{"en":"Before Present (a dating system used in archaeology; “present” is defined as the year 1950).","zh":"距今（考古学常用的年代表示法，“现在”通常定义为公元1950年）。"},"examples":[{"en":"The site was dated to about 12,000 years BP.","zh":"该遗址被测年为大约距今1.2万年（BP）。"},{"en":"In the report, BP is used instead of BC/AD.","zh":"在报告里，用BP而不是BC/AD来表示年代。"}]}],"synonyms":["blood pressure (for medical BP)","British Petroleum (for company BP)","Before Present (for dating BP)"],"phonetic":"/ˌbiːˈpiː/","extraExplanation":["“BP”是缩写/首字母缩略词，读作字母音“B-P”。具体含义非常依赖语境：医疗记录里多指血压；新闻商业语境里常指英国石油公司；考古与地质文献里常指“距今（以1950年为基准）”。","写作中第一次出现时，正式场合建议先写全称再写缩写：blood pressure (BP)。"]}
{"word":"BPA","summary":{"en":"BPA most commonly means Bisphenol A (a chemical used in plastics/resins). In business/IT, it can also mean Business Process Automation.","zh":"BPA最常指“双酚A”（用于塑料/树脂的化学物质）；在商业/IT语境中也可指“业务流程自动化”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bisphenol A: an industrial chemical used to make certain plastics and epoxy resins (often discussed in relation to food containers and possible health concerns).","zh":"双酚A：一种工业化学物质，用于制造某些塑料和环氧树脂（常见于食品容器相关话题，常被讨论其潜在健康影响）。"},"examples":[{"en":"Many reusable water bottles are labeled “BPA-free.”","zh":"很多可重复使用的水瓶会标注“无BPA（BPA-free）”。"},{"en":"Some countries restrict BPA in baby bottles and food packaging.","zh":"一些国家限制在婴儿奶瓶和食品包装中使用BPA。"}]},{"partOfSpeech":"n.","definition":{"en":"Business Process Automation: the use of software to automate routine business tasks and workflows.","zh":"业务流程自动化：使用软件把日常的业务任务和流程自动化。"},"examples":[{"en":"The company invested in BPA to speed up invoice processing.","zh":"公司投资业务流程自动化（BPA）来加快发票处理。"},{"en":"BPA can reduce errors in repetitive tasks.","zh":"BPA可以减少重复性任务中的错误。"}]}],"synonyms":["bisphenol A","BPA-free (label term)","business process automation","workflow automation"],"phonetic":"/ˌbiː piː ˈeɪ/","extraExplanation":["在日常消费语境里，BPA最常指“双酚A”。它常见于某些硬质塑料（如聚碳酸酯）及金属罐头内壁的环氧树脂涂层中，因此常被讨论与“是否会迁移到食物/饮料”有关。","“BPA-free（无BPA）”表示产品未使用双酚A，但不一定代表完全没有所有类似化学物质（有时会改用BPS、BPF等替代物）。阅读产品材料说明与合规标准会更可靠。","在职场或IT语境中看到BPA，常是“业务流程自动化”。判断方法：如果上下文谈流程、系统、审批、发票、工单等，多半是Business Process Automation。"]}
{"word":"BPA-free","summary":{"en":"BPA-free means a product is made without BPA (bisphenol A).","zh":"BPA-free 指产品不含BPA（双酚A）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a product, especially plastic containers) made without BPA (bisphenol A), a chemical that some people try to avoid because of possible health concerns.","zh":"（常指塑料容器等产品）不含BPA（双酚A）的；由于可能的健康疑虑，一些人会尽量避免接触BPA。"},"examples":[{"en":"This water bottle is BPA-free, so many people feel more comfortable using it every day.","zh":"这个水瓶是BPA-free（不含双酚A）的，所以很多人每天用起来更安心。"},{"en":"Look for “BPA-free” on the label when buying baby bottles.","zh":"买奶瓶时可以在标签上找“BPA-free（不含双酚A）”。"}]}],"synonyms":["without BPA","no BPA"],"phonetic":"/ˌbiː piː ˈeɪ friː/","extraExplanation":["BPA 是 “bisphenol A（双酚A）” 的缩写，常见于部分塑料和树脂中。“BPA-free” 是包装上的常见标示，用来表达“未添加/不含BPA”。","日常语境里它更像是“产品属性标签”，常与 bottle、container、plastic、food storage 等词连用。","注意：有些产品会标 “BPA-free” 但可能使用其他替代化学物质；如果你很在意材质，可以进一步查看成分或选择玻璃、不锈钢等材料。"]}
{"word":"BPC","summary":{"en":"BPC is a context-dependent abbreviation; common meanings include Business Process Continuity, Bits per Character, and Battery Protection Circuit.","zh":"BPC 是一个依语境而定的缩写；常见含义包括业务流程连续性（Business Process Continuity）、每字符比特数（Bits per Character）和电池保护电路（Battery Protection Circuit）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation for several different phrases; the exact meaning depends on the context (business, computing, electronics, etc.).","zh":"一个缩写，可能代表多种不同含义；具体意思取决于语境（商业、计算机、电子等）。"},"examples":[{"en":"What does BPC stand for in this document?","zh":"这份文件里的 BPC 是什么意思（代表什么）？"},{"en":"In tech, BPC can mean different things in different teams.","zh":"在科技行业里，不同团队说的 BPC 可能不是同一个意思。"}]},{"partOfSpeech":"other","definition":{"en":"Business Process Continuity: the ability of a company to keep key operations running during disruptions.","zh":"Business Process Continuity（业务流程连续性）：公司在中断或突发事件中维持关键业务运作的能力。"},"examples":[{"en":"Our BPC plan covers power outages and cyberattacks.","zh":"我们的 BPC 方案涵盖停电和网络攻击。"},{"en":"The audit checked whether the team’s BPC procedures were up to date.","zh":"审计检查了团队的 BPC 流程是否更新到位。"}]},{"partOfSpeech":"other","definition":{"en":"Bits per character: a measure used in computing to describe how many bits are used to represent one character in an encoding system.","zh":"Bits per character（每字符比特数）：计算机中用于描述一种编码里表示一个字符需要多少比特的指标。"},"examples":[{"en":"ASCII is often described as 7-bit, so its BPC is about 7.","zh":"ASCII 常被描述为 7 位编码，所以它的 BPC 大约是 7。"},{"en":"Higher BPC can support more characters but may increase storage size.","zh":"更高的 BPC 能支持更多字符，但可能增加存储占用。"}]},{"partOfSpeech":"other","definition":{"en":"Battery protection circuit: an electronic circuit that helps prevent a battery from overcharging, over-discharging, or short-circuiting.","zh":"Battery protection circuit（电池保护电路）：用于防止电池过充、过放或短路的电子电路。"},"examples":[{"en":"This lithium battery includes a BPC for safety.","zh":"这块锂电池带有 BPC 用于安全保护。"},{"en":"If the BPC fails, the device may shut down unexpectedly.","zh":"如果 BPC 出故障，设备可能会意外关机。"}]}],"synonyms":["acronym","abbreviation"],"phonetic":"/ˌbiː piː ˈsiː/","extraExplanation":["BPC 通常读作三个字母（B-P-C）。由于它是缩写，在邮件、报告、技术讨论中很常见，但也最容易产生歧义。","想确认含义时，可以直接问：\"Do you mean BPC as in Business Process Continuity or something else?\"（你说的 BPC 是业务连续性还是别的？）","如果你告诉我它出现的行业/句子（例如金融合规、软件开发、电池/硬件），我可以给出更准确的释义与更贴合的例句。"]}
{"word":"BPDPA","summary":{"en":"BPDPA is an acronym with meaning that depends on context; it’s usually read as letters.","zh":"BPDPA 是一个需依语境判断含义的缩写，通常按字母逐个读出。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbrev.) An unclear acronym; without context, it may refer to different organizations or technical terms. It is often written in all caps and pronounced as individual letters.","zh":"（缩写）一个含义不明确的首字母缩写词；缺少上下文时可能指代不同的组织或技术术语。通常全大写书写，按字母逐个读出。"},"examples":[{"en":"What does BPDPA stand for in this document?","zh":"这份文件里的 BPDPA 代表什么？"},{"en":"I saw “BPDPA” on the form, but there was no explanation.","zh":"我在表格上看到“BPDPA”，但没有解释。"}]},{"partOfSpeech":"n.","definition":{"en":"(abbrev., possible meaning) A name or title for a specific association/agency/program whose initials are BPDPA (the exact expansion depends on the field, such as business, government, or healthcare).","zh":"（缩写，可能含义）某个协会/机构/项目的名称缩写为 BPDPA（具体全称取决于领域，例如商业、政府或医疗）。"},"examples":[{"en":"Please contact BPDPA for the latest policy update.","zh":"请联系 BPDPA 获取最新政策更新。"},{"en":"Our company joined BPDPA last year.","zh":"我们公司去年加入了 BPDPA。"}]}],"synonyms":["initialism","acronym"],"phonetic":"/ˌbiː piː diː piː ˈeɪ/","extraExplanation":["BPDPA 不是一个像 “NASA” 那样广为人知、单一固定含义的缩写。最可靠的方法是看它出现的语境：例如它是在心理健康、化学/材料、政府部门、还是某个公司/学校的文件里出现的。","如果你把它所在的完整句子、行业领域（例如医疗/化工/行政/教育）、或它第一次出现时附近的文字发我，我可以帮你判断最可能的全称与中文译法。"]}
{"word":"BPE","summary":{"en":"BPE most commonly means Byte Pair Encoding in NLP (subword tokenization). It can also mean Boiling Point Elevation in chemistry.","zh":"BPE 最常指 NLP 中的 Byte Pair Encoding（子词切分方法）；也可指化学中的沸点升高（Boiling Point Elevation）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(acronym) Byte Pair Encoding: a data-compression-based method widely used in NLP to split words into frequent subword units (tokens).","zh":"（缩写）Byte Pair Encoding（字节对编码）：一种源于数据压缩、在自然语言处理中常用的分词/切分方法，把词拆成常见的“子词”单位（token）。"},"examples":[{"en":"Many language models use BPE to build a vocabulary of subword tokens.","zh":"许多语言模型使用 BPE 来构建由子词 token 组成的词表。"},{"en":"With BPE, rare words can be represented as smaller pieces instead of becoming “unknown.”","zh":"使用 BPE 时，生僻词可以被表示为更小的片段，而不是变成“未知词”。"}]},{"partOfSpeech":"n.","definition":{"en":"(acronym, chemistry) Boiling Point Elevation: the increase in a liquid’s boiling point when a solute is dissolved in it.","zh":"（缩写，化学）Boiling Point Elevation（沸点升高）：溶质溶解在溶剂中后，使溶液沸点上升的现象。"},"examples":[{"en":"Adding salt to water causes a small BPE.","zh":"在水里加盐会导致轻微的沸点升高（BPE）。"},{"en":"BPE is one of the colligative properties studied in chemistry.","zh":"沸点升高（BPE）是化学中研究的一类依数性性质。"}]}],"synonyms":["Byte Pair Encoding","subword tokenization","BPE tokenization"],"phonetic":"/bi pi i/","extraExplanation":["在 NLP 里，BPE 的核心直觉是“把最常一起出现的字符/子串不断合并”，直到达到设定的词表大小，因此能在“词表不至于太大”和“能覆盖生僻词”之间取得平衡。它常与“subword tokenization（子词切分）”一起出现。"]}
{"word":"BPetE","summary":{"en":"BPetE is usually an acronym used in energy contexts, often meaning “billion barrels of petroleum equivalent.”","zh":"BPetE 通常是能源语境中的缩写，常指“十亿桶石油当量”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An acronym (not a common everyday English word). In some energy/economics writing, it is used to mean “billion barrels of petroleum equivalent,” a unit for comparing energy amounts (oil, gas, etc.) on an oil-equivalent basis.","zh":"一个缩写（不是常见日常英语单词）。在一些能源/经济类文本中，它被用来表示“十亿桶石油当量”，用于把天然气等不同能源按“相当于多少桶石油”的方式进行比较。"},"examples":[{"en":"The report estimates proven reserves at 3.2 BPetE.","zh":"报告估计已探明储量为 3.2 BPetE。"},{"en":"Energy outputs are converted to BPetE for easier comparison across fuels.","zh":"为了更方便地跨燃料比较，能源产出被换算成 BPetE。"}]}],"synonyms":["bboe","boe (related)"],"phonetic":"/ˌbiːˌpiːˌtiːˈiː/","extraExplanation":["“BPetE”并不是国际上最统一的标准写法；更常见的相关单位包括 boe（barrel of oil equivalent，桶油当量）、bboe（billion barrels of oil equivalent，十亿桶油当量）等。","由于不同机构可能用同一缩写表示不同含义（例如不同的“oil/petroleum equivalent”口径），如果你能提供它出现的句子/报告领域（能源、化工、金融等），我可以更准确地确认它在该语境下的定义。"]}
{"word":"BPH","summary":{"en":"BPH is a medical abbreviation for benign prostatic hyperplasia (non-cancerous prostate enlargement).","zh":"BPH是“良性前列腺增生”的医学缩写，指前列腺非癌性增大。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medicine) Benign prostatic hyperplasia: a non-cancerous enlargement of the prostate gland that can cause urinary symptoms, especially in older men.","zh":"（医学）良性前列腺增生：前列腺的非癌性增大，常见于年长男性，可能引起排尿相关症状。"},"examples":[{"en":"My doctor said my urinary problems were caused by BPH, not prostate cancer.","zh":"医生说我的排尿问题是由BPH（良性前列腺增生）引起的，不是前列腺癌。"},{"en":"Common signs of BPH include a weak urine stream and frequent urination at night.","zh":"BPH的常见表现包括尿流变弱和夜间频繁排尿。"},{"en":"He takes medication to manage BPH symptoms.","zh":"他服药来控制BPH的症状。"}]}],"synonyms":["benign prostatic hyperplasia","benign prostatic enlargement (BPE)","prostate enlargement"],"phonetic":"/bi pi eɪtʃ/","extraExplanation":["BPH是医疗语境里的缩写，正式写法常见为“benign prostatic hyperplasia”。“benign”表示“良性的、非癌性的”；但症状仍可能影响生活质量。","在日常交流中一般不会用BPH，更多见于病历、体检报告、医学科普或医生沟通中。","相关说法：BPE（benign prostatic enlargement，良性前列腺增大）有时用于强调“增大”本身；但很多场合BPH仍被广泛使用。"]}
{"word":"BPharm","summary":{"en":"BPharm = Bachelor of Pharmacy (a pharmacy bachelor’s degree).","zh":"BPharm = 药学学士（Bachelor of Pharmacy）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a university degree in pharmacy (Bachelor of Pharmacy), often the first professional qualification for pharmacists in some countries.","zh":"药学学士学位（Bachelor of Pharmacy），在一些国家常作为药师/药剂师的入门专业学位。"},"examples":[{"en":"She earned her BPharm and then completed a hospital internship.","zh":"她取得了药学学士学位（BPharm），之后完成了医院实习。"},{"en":"The job requires a BPharm or an equivalent pharmacy qualification.","zh":"这份工作要求具备药学学士（BPharm）或同等药学资格。"}]}],"synonyms":["Bachelor of Pharmacy","B.Pharm","B Pharm","Pharm.B."],"phonetic":"/biː fɑrm/","extraExplanation":["BPharm 是缩写，常写作 BPharm、B.Pharm 或 B Pharm。不同国家对药学教育路径不同：例如有些地区把 BPharm 作为主要本科专业学位，而在美国更常见的是 PharmD（药学博士）作为执业药师的主流学位。具体是否能直接执业，还取决于当地的执照考试与监管要求。"]}
{"word":"BPhil","summary":{"en":"BPhil is an abbreviation for Bachelor of Philosophy, a degree title whose level and focus can vary by university (often postgraduate in the Oxford context).","zh":"BPhil 是 Bachelor of Philosophy（哲学学士/哲学学位）的缩写；其层级与培养方式因学校而异（在牛津语境中常指研究生阶段的学位）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a university degree abbreviation for “Bachelor of Philosophy,” used at some institutions (often for a postgraduate research degree, depending on the university).","zh":"“哲学学士（Bachelor of Philosophy）”的学位缩写；在一些学校中使用（具体层级因学校而异，常见于研究型学位）。"},"examples":[{"en":"She completed a BPhil at Oxford in Philosophy.","zh":"她在牛津大学完成了哲学的 BPhil 学位。"},{"en":"His CV lists a BPhil and a PhD in the same field.","zh":"他的简历上列出了同一领域的 BPhil 和 PhD。"}]},{"partOfSpeech":"n.","definition":{"en":"a degree abbreviation used in some fields outside philosophy (rare), meaning “Bachelor of Philosophy” in name but not always strictly a philosophy-only program.","zh":"在哲学以外的少数领域中也可能见到的学位缩写（较少见）；名称是“哲学学士”，但项目不一定只学哲学。"},"examples":[{"en":"At that university, the BPhil is a research-focused program in humanities.","zh":"在那所大学，BPhil 是一个以研究为导向的人文学科项目。"}]}],"synonyms":["Bachelor of Philosophy","B.Phil."],"phonetic":"/ˌbiːˈfɪl/","extraExplanation":["BPhil 通常写作 “B.Phil.” 或 “BPhil”。在英国（尤其是牛津大学）语境里，BPhil 常指一种高强度的研究生阶段哲学课程，地位上更接近硕士层级（例如与 MPhil、MLitt 之类研究型学位并列），因此不要仅凭 “B” 就默认一定是本科。","不同国家和学校对 BPhil 的定位差异较大：有的是真正的本科“哲学学士”，有的则是研究生学位名称传统沿用。遇到不确定时，最好结合学校官网的学位说明或课程结构来判断。"]}
{"word":"BPI","summary":{"en":"BPI is an acronym with several common meanings; its exact meaning depends on context (music industry, banking, data density, or business management).","zh":"BPI 是一个多义缩写，具体含义取决于语境（音乐行业、银行、数据密度或企业管理）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) British Phonographic Industry—the UK’s recorded-music industry body, known for certifications like Gold/Platinum.","zh":"（缩写）British Phonographic Industry：英国唱片业协会/机构，以金唱片、白金唱片等销量认证而闻名。"},"examples":[{"en":"The album received a BPI Gold certification in the UK.","zh":"这张专辑在英国获得了 BPI 金唱片认证。"},{"en":"BPI publishes annual reports on the UK music market.","zh":"BPI 会发布英国音乐市场的年度报告。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev.) Bank of the Philippine Islands—a major bank in the Philippines.","zh":"（缩写）Bank of the Philippine Islands：菲律宾群岛银行，菲律宾主要银行之一。"},"examples":[{"en":"I opened a savings account at BPI while I was in Manila.","zh":"我在马尼拉时在 BPI 开了一个储蓄账户。"},{"en":"You can pay the bill through BPI online banking.","zh":"你可以通过 BPI 网银缴费。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev.) bits per inch—a measure of data density, especially in storage or imaging.","zh":"（缩写）bits per inch：每英寸比特数，用来表示数据密度（常见于存储、成像等领域）。"},"examples":[{"en":"Higher BPI generally means more data can be stored in the same space.","zh":"更高的 BPI 通常意味着同样空间能存更多数据。"},{"en":"The engineer compared tape formats by their BPI.","zh":"工程师用 BPI 来比较不同磁带格式。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev.) business process improvement—methods for making a company’s workflows more efficient.","zh":"（缩写）business process improvement：业务流程改进，用于提升组织流程效率的方法。"},"examples":[{"en":"Our team is leading a BPI project to reduce delivery time.","zh":"我们团队正在推进一个 BPI 项目来缩短交付时间。"},{"en":"They used BPI to simplify approvals and cut costs.","zh":"他们用 BPI 简化审批并降低成本。"}]}],"synonyms":["acronym","initialism"],"phonetic":"/ˌbiː piː ˈaɪ/","extraExplanation":["“BPI”是高度依赖语境的缩写：在音乐新闻里常指英国唱片业机构；在菲律宾生活/金融语境里常指菲律宾群岛银行；在工程与计算领域可能是“每英寸比特数”；在职场管理语境里常指“业务流程改进”。如果你告诉我你看到它的句子或领域（音乐/银行/科技/管理），我可以帮你锁定最准确的含义。"]}
{"word":"BPin","summary":{"en":"BPin (–Bpin) is a chemistry abbreviation for a pinacol boronate (boronic ester) group used in organic synthesis.","zh":"BPin（–Bpin）是化学中的缩写，指频哪醇硼酸酯（硼酸酯）基团，常用于有机合成。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Chemistry) A common shorthand for a pinacol boronate (pinacol boronic ester) group, written as –Bpin or BPin; widely used in organic synthesis (especially Suzuki–Miyaura coupling).","zh":"（化学）“BPin / –Bpin”常用作“频哪醇硼酸酯（pinacol boronate）”基团的简写，常见于有机合成（尤其是Suzuki–Miyaura偶联）。"},"examples":[{"en":"The aryl–Bpin compound was coupled with an aryl bromide in a Suzuki reaction.","zh":"该芳基–Bpin化合物在Suzuki反应中与芳基溴化物发生偶联。"},{"en":"We converted the alkene into a boronate ester (BPin) to enable later cross-coupling.","zh":"我们把烯烃转化为硼酸酯（BPin），以便后续进行交叉偶联。"},{"en":"The product is often labeled as R–Bpin in the scheme.","zh":"在反应示意图里，产物常标注为R–Bpin。"}]}],"synonyms":["–Bpin","pinacol boronate","pinacol boronic ester"],"phonetic":"/ˈbiː pɪn/","extraExplanation":["“Bpin”里的“pin”指的是pinacol（频哪醇，一种二醇）。把硼做成pinacol硼酸酯通常能提高化合物的稳定性与可操作性，所以论文与实验步骤里常用“–Bpin”来简洁表示该基团。","在有机化学文献中，“Bpin”更像是结构标记/缩写，而不是日常英语单词；读法通常按字母与音节读作“B + pin”。"]}
{"word":"BPMs","summary":{"en":"“BPMs” usually means plural of BPM: beats per minute (tempo) in music; in business it can mean business process management (systems/tools).","zh":"“BPMs”通常是BPM的复数：音乐里指每分钟拍数（节奏速度）；在商业语境也可指业务流程管理（系统/工具）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(music) Beats per minute; a unit for measuring tempo (how fast a song or rhythm is).","zh":"（音乐）每分钟拍数；用来表示速度/节奏快慢的单位。"},"examples":[{"en":"This song is 120 BPM, so it feels upbeat and easy to dance to.","zh":"这首歌是每分钟120拍，所以听起来很有活力，也很适合跳舞。"},{"en":"Can you slow it down to around 90 BPM?","zh":"你能把速度放慢到大约每分钟90拍吗？"}]},{"partOfSpeech":"n.","definition":{"en":"(business/IT) Business Process Management (often: BPM software/systems); methods or tools for designing and improving business workflows.","zh":"（商业/IT）业务流程管理（常指BPM软件/系统）；用于设计、优化工作流程的方法或工具。"},"examples":[{"en":"They use BPM software to track approvals and reduce paperwork.","zh":"他们用BPM软件来跟踪审批流程、减少纸质工作。"},{"en":"BPMs help teams standardize how tasks move from request to completion.","zh":"BPM系统能帮助团队把任务从申请到完成的流程标准化。"}]}],"synonyms":["tempo (music)","beats per minute","workflow management (business)","process management"],"phonetic":"/ˌbiː.piːˈɛm/","extraExplanation":["“BPMs”是复数写法：在音乐里表示“多个BPM数值/不同歌曲的速度”；在职场语境里常指“多套BPM系统/多种BPM方案”。","书写时常见全大写BPM；口语里通常逐字母读（B-P-M）。"]}
{"word":"BPO","summary":{"en":"BPO means “Business Process Outsourcing”—outsourcing specific business tasks to another company.","zh":"BPO指“业务流程外包”，即把特定业务工作交由外部公司处理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(acronym) Business Process Outsourcing: hiring another company to handle certain business tasks (often back-office work like customer service, payroll, or data entry).","zh":"（缩写）业务流程外包：把某些业务工作（常见为客服、薪资、数据录入等后台流程）交给外部公司来做。"},"examples":[{"en":"Many startups use BPO services for customer support to save costs.","zh":"很多初创公司会用BPO服务来做客服，以降低成本。"},{"en":"The company moved its accounting tasks to a BPO provider.","zh":"这家公司把会计工作交给了BPO服务商。"},{"en":"BPO can improve efficiency, but it may also create communication challenges.","zh":"BPO可能提高效率，但也可能带来沟通上的挑战。"}]}],"synonyms":["business process outsourcing","outsourcing"],"phonetic":"/ˌbiː piː ˈoʊ/","extraExplanation":["BPO通常在商业新闻、公司介绍、招聘信息中出现，读作字母：B-P-O。","常见搭配：BPO provider（外包服务商）、BPO services（外包服务）、BPO industry（外包行业）。","相关但不完全等同：outsourcing（外包，范围更广）；offshoring（离岸外包/把工作转到国外，强调地点）；shared services（共享服务中心，通常是企业内部集中处理，不一定外包）。"]}
{"word":"BPOC","summary":{"en":"BPOC usually refers to a Business Process Outsourcing Company/Center—an outsourcing provider for tasks like customer support or back-office work.","zh":"BPOC 通常指业务流程外包公司/中心，即为他人企业提供客服或后台等外包服务的机构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abbreviation (mainly in business) for “Business Process Outsourcing Company/Center”: a company or office that provides outsourced services such as customer support, data entry, payroll, or IT help for other companies.","zh":"（主要用于商业）“Business Process Outsourcing Company/Center”的缩写：指提供业务流程外包服务的公司或中心，例如客服、数据录入、薪资处理或IT支持等。"},"examples":[{"en":"She works at a BPOC handling customer service calls for a U.S. retailer.","zh":"她在一家BPOC工作，负责为一家美国零售商接听客服来电。"},{"en":"The bank outsourced its back-office work to a BPOC to reduce costs.","zh":"这家银行把后台业务外包给一家BPOC以降低成本。"}]}],"synonyms":["outsourcing provider","BPO provider","shared services center (similar)"],"phonetic":"/ˌbiː piː oʊ ˈsiː/","extraExplanation":["“BPOC”不是一个非常固定、全球通用的标准缩写；更常见的是“BPO（业务流程外包）”。在不同公司/地区，BPOC 可能被用来指“外包公司（company）”或“外包中心（center）”。正式写作中，第一次出现建议写全称并在括号中标注缩写。","在医学领域里，你可能也会看到接近的缩写（例如与慢阻肺 COPD 容易混淆），所以在阅读材料时最好结合上下文确认具体含义。"]}
{"word":"BPOE","summary":{"en":"BPOE is an abbreviation for the Benevolent and Protective Order of Elks (“the Elks”), a U.S. fraternal organization with local lodges and community service.","zh":"BPOE 是 “Benevolent and Protective Order of Elks（麋鹿会）”的缩写，指美国一个以地方会所与社区公益活动为主的社团组织。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abbreviation for the Benevolent and Protective Order of Elks, a U.S. fraternal organization (often called “the Elks”) known for community service and local lodges","zh":"“Benevolent and Protective Order of Elks（仁慈与保护麋鹿会）”的缩写；美国的一个兄弟会/社团组织（常称“The Elks/麋鹿会”），以地方会所（lodge）与社区公益活动著称"},"examples":[{"en":"The fundraiser will be held at the local BPOE lodge.","zh":"这场募捐活动将在当地的BPOE会所举行。"},{"en":"Her grandfather was a member of the BPOE for many years.","zh":"她的祖父加入BPOE很多年。"}]}],"synonyms":["the Elks","Elks"],"phonetic":"/ˌbiː piː oʊ ˈiː/","extraExplanation":["BPOE 通常读作逐字母拼读（B-P-O-E），在美国常见于会所招牌、活动海报、慈善募款公告等语境。","“Elks（麋鹿会）”在美国属于历史较久的民间社团之一：以地方分会（lodge）为中心，举办社交活动并参与慈善与社区服务。不同地区的分会活动风格可能差异很大。"]}
{"word":"bpp","summary":{"en":"BPP is usually an abbreviation. In tech it often means “bits per pixel”; in business it can be a company-specific term for a business process platform/system.","zh":"BPP 通常是缩写。在技术领域常指“每像素位数”；在商务领域也可能是公司内部对业务流程平台/系统的简称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) bits per pixel: a measure of how many bits are used to represent one pixel in an image; higher BPP usually means better color detail but larger files.","zh":"（缩写）每像素位数：表示图像中每个像素用多少“位”（bit）来存储；BPP 越高通常画质/色彩细节越好，但文件也更大。"},"examples":[{"en":"This image is saved at 24 bpp, so it can show millions of colors.","zh":"这张图以 24 bpp 保存，所以能显示数百万种颜色。"},{"en":"Lowering bpp can reduce file size, but the picture may look less smooth.","zh":"降低 bpp 可以减小文件体积，但画面可能会不够细腻。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev., business) Business Process Platform/Programming: used by some companies or documents to refer to software or systems for managing business workflows (meaning varies by organization).","zh":"（缩写，商务）业务流程平台/流程系统：一些公司或文件用来指管理业务流程的软件/系统（具体含义会因组织而异）。"},"examples":[{"en":"Our team is migrating approvals to the BPP next quarter.","zh":"我们团队计划在下个季度把审批流程迁移到 BPP 上。"},{"en":"Check the document to see what BPP refers to in this company.","zh":"查看文件确认在这家公司里 BPP 具体指什么。"}]}],"synonyms":["bits per pixel (tech)","workflow platform (business, similar idea)"],"phonetic":"/bi pi pi/","extraExplanation":["“BPP”最常见是作为缩写使用，通常全部大写，并按字母逐个读作 /bi pi pi/（类似“B-P-P”）。","遇到缩写时要特别依赖上下文：在图像/显示/编码话题里多半是 bits per pixel；在公司内部系统/流程语境里则可能是某个产品或平台名称。"]}
{"word":"BPPS","summary":{"en":"BPPS most commonly means “bits per pixel” in imaging; it can also be an organization-specific abbreviation.","zh":"BPPS 最常见指图像领域的“每像素比特数”；也可能是特定机构/文件中的自定义缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation meaning “bits per pixel,” used in digital imaging to describe how much color/detail a picture can store per pixel (higher BPPS usually means better image quality but larger files).","zh":"“每像素比特数（bits per pixel）”的缩写，用于数字图像，表示每个像素用多少比特来存储颜色/细节（BPPS 越高通常画质越好，但文件也更大）。"},"examples":[{"en":"This image is saved at 8 BPPS, so it can show 256 levels of gray.","zh":"这张图以 8 BPPS 保存，因此可以显示 256 个灰度级。"},{"en":"If you increase BPPS, the video may look smoother but take more storage.","zh":"如果提高 BPPS，视频可能更细腻，但会占用更多存储空间。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation that can stand for different things depending on the field or organization (commonly used as a name/title abbreviation).","zh":"一个在不同领域/机构中可能代表不同含义的缩写（常见于名称或头衔的缩写）。"},"examples":[{"en":"BPPS can mean different things in different departments—check the document’s glossary.","zh":"BPPS 在不同部门可能含义不同——请查看文件的术语表。"},{"en":"What does BPPS stand for in your company’s report?","zh":"在你们公司的报告里，BPPS 代表什么？"}]}],"synonyms":["bpp"],"phonetic":"biː piː piː ɛs","extraExplanation":["“BPPS”最常见、最明确的用法之一是图像/视频领域的“bits per pixel”。但在企业、政府或学校文件里，它也可能是某个项目、部门或系统名称的缩写。","如果你把 BPPS 是在哪个场景看到的（例如：相机参数、医学/教育文件、公司报告），我可以帮你锁定最准确的释义。"]}
{"word":"BPS","summary":{"en":"BPS most commonly means “basis points” in finance (1 bps = 0.01%), but it can also mean “bits per second” in tech or “biopsychosocial” in healthcare/academics.","zh":"BPS最常见的意思是金融里的“基点”（1 bps = 0.01%），也可能指科技里的“每秒比特数”，或医学/学术中的“生物-心理-社会”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Basis points (finance): a unit used to describe small changes in interest rates or percentages; 1 basis point = 0.01% (one hundredth of a percent).","zh":"（金融）基点：用来表示利率或百分比的微小变动；1 个基点 = 0.01%（百分之一的百分之一）。"},"examples":[{"en":"The central bank raised rates by 25 bps.","zh":"央行把利率上调了 25 个基点。"},{"en":"Mortgage rates fell 10 bps this week.","zh":"本周房贷利率下降了 10 个基点。"},{"en":"The bond’s yield moved up by 5 bps after the news.","zh":"消息发布后，这只债券的收益率上升了 5 个基点。"}]},{"partOfSpeech":"other","definition":{"en":"BPS (telecommunications): bits per second, a unit for data transfer speed.","zh":"（通信/网络）BPS：bits per second（每秒比特数），表示数据传输速度的单位。"},"examples":[{"en":"This modem supports 56,000 bps.","zh":"这款调制解调器支持 56,000 bps。"},{"en":"The connection is only running at a few thousand bps.","zh":"这个连接速度只有几千 bps。"}]},{"partOfSpeech":"other","definition":{"en":"BPS (medical/academic): abbreviation for “biopsychosocial,” describing an approach that considers biological, psychological, and social factors.","zh":"（医学/学术）BPS：biopsychosocial（生物-心理-社会） 的缩写，指同时考虑生物、心理与社会因素的观点/模型。"},"examples":[{"en":"The therapist used a BPS model to understand the patient’s pain.","zh":"治疗师用 BPS 模型来理解患者的疼痛问题。"},{"en":"In this course, we take a BPS approach to health.","zh":"在这门课里，我们用 BPS 视角看待健康。"}]}],"synonyms":["basis points","bits per second"],"phonetic":"/ˌbiː piː ˈɛs/","extraExplanation":["“bps”在金融新闻里最常见，通常默认指“basis points（基点）”。把基点换算成百分比：25 bps = 0.25%，100 bps = 1%。","在科技语境里更常写作“bps”，并常与“kbps / Mbps / Gbps”一起出现（k=千，M=百万，G=十亿）。","如果你是在某个具体句子/行业里看到BPS，可以把原句发我，我可以帮你判断最可能的含义。"]}
{"word":"BPSS","summary":{"en":"BPSS is an acronym; most commonly in the UK it means Baseline Personnel Security Standard (basic pre-employment security checks).","zh":"BPSS 是缩写；在英国最常见的含义是“基础人员安全审查标准”，指入职前的基础安全背景审查。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(UK, government/workplace) Baseline Personnel Security Standard: a basic set of background checks used to confirm a person’s identity and suitability before they start certain jobs, especially in government or sensitive roles.","zh":"（英国，政府/职场）基础人员安全审查标准：在入职某些岗位（尤其政府或敏感岗位）前，用于核验身份并进行基本背景审查的一套标准。"},"examples":[{"en":"All new contractors must pass BPSS before getting a building pass.","zh":"所有新承包商在拿到通行证之前都必须通过 BPSS 审查。"},{"en":"BPSS checks usually include identity, employment history, and right-to-work verification.","zh":"BPSS 通常包括身份核验、工作经历核查以及工作资格（合法工作权）确认。"}]},{"partOfSpeech":"other","definition":{"en":"(General business/IT) A shorthand acronym that can mean different things depending on the field (for example, a “Business Process Support System”). Always check the document or industry context.","zh":"（通用商用/IT）一个在不同行业可能代表不同含义的缩写（例如“业务流程支持系统”）。具体含义需结合文件或行业语境确认。"},"examples":[{"en":"In our IT documentation, BPSS refers to the Business Process Support System.","zh":"在我们的 IT 文档里，BPSS 指“业务流程支持系统”。"},{"en":"Before you use the term BPSS in a report, define what it stands for.","zh":"在报告里使用 BPSS 之前，先写清楚它的全称。"}]}],"synonyms":["Baseline Personnel Security Standard","pre-employment screening","background checks"],"phonetic":"/ˌbiː piː ɛs ɛs/","extraExplanation":["在英国招聘语境里，BPSS 最常见，尤其是涉及政府部门、国防相关承包商、或需要接触敏感信息/场所的岗位。它通常是“入门级”的人员审查标准，不等同于更高等级的安全许可（例如 SC、DV）。","如果你是在某份简历、招聘广告、合规/审计文件里看到 BPSS，十有八九与人员背景审查有关；若出现在软件、流程、系统架构文档中，则更可能是某个系统名称的缩写。你可以把原句发我，我可以帮你判断具体指哪一个。"]}

