{"word":"BRC","summary":{"en":"BRC is an abbreviation most commonly meaning the British Retail Consortium/BRCGS standards (retail and food-safety audits), and sometimes Business Reply Card (a prepaid mail reply card).","zh":"BRC 是缩写，最常见指英国零售商协会/ BRCGS 的标准与审核认证（零售与食品安全），有时也指 Business Reply Card（免邮费回邮卡）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for the British Retail Consortium (now often called BRCGS), a UK-based organization known for setting standards for retail and food-safety audits","zh":"British Retail Consortium（英国零售商协会）的缩写；如今常与 BRCGS（品牌与声誉合规标准组织）相关，因其零售与食品安全审核标准而知名"},"examples":[{"en":"Our factory needs a BRC audit to supply this supermarket chain.","zh":"我们的工厂需要通过 BRC 审核，才能给这家连锁超市供货。"},{"en":"The packaging must meet BRC standards for food safety.","zh":"食品包装必须符合 BRC 的食品安全标准。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation used in mailing for Business Reply Card, a prepaid card that lets customers reply by mail without paying postage","zh":"邮政用语缩写，指 Business Reply Card（商业回邮信/回邮卡）；收件人可免邮费寄回的预付回邮卡"},"examples":[{"en":"Fill out the BRC and drop it in the mailbox.","zh":"填好这张 BRC 回邮卡，然后投入邮筒。"},{"en":"The brochure includes a BRC for requesting more information.","zh":"这份宣传册里附了一张 BRC 回邮卡，用来索取更多信息。"}]}],"synonyms":["BRCGS (in food-safety/standards context)"],"phonetic":"ˌbiː ɑːr ˈsiː","extraExplanation":["“BRC”在不同领域含义差别很大。最常见的两类语境是：\n1）供应链/食品行业：通常指BRC（或BRCGS）标准与认证（如食品安全、包装材料、仓储与物流）。\n2）邮政/直邮营销：指Business Reply Card回邮卡。\n如果你告诉我你看到“BRC”的句子或行业（食品、零售、物流、邮政等），我可以帮你确定最准确的意思。"]}
{"word":"BRCA","summary":{"en":"BRCA refers to the BRCA1/BRCA2 genes; certain mutations can greatly raise the risk of hereditary breast, ovarian, and some other cancers.","zh":"BRCA 指 BRCA1/BRCA2 基因；某些突变会显著提高遗传性乳腺癌、卵巢癌及部分其他癌症的风险。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(biology/medicine) A shortened name for the BRCA1 and BRCA2 genes (“breast cancer susceptibility genes”); variants (mutations) in these genes can greatly increase a person’s risk of certain cancers, especially breast and ovarian cancer.","zh":"（生物/医学）BRCA1 与 BRCA2 基因的简称（常译“乳腺癌易感基因”）；这些基因的某些变异/突变可能显著提高某些癌症风险，尤其是乳腺癌与卵巢癌。"},"examples":[{"en":"She tested positive for a BRCA mutation and decided to talk with a genetic counselor.","zh":"她检测出携带 BRCA 突变，于是决定咨询遗传咨询师。"},{"en":"BRCA1 and BRCA2 are linked to hereditary breast and ovarian cancer.","zh":"BRCA1 和 BRCA2 与遗传性乳腺癌和卵巢癌有关。"},{"en":"My doctor recommended BRCA testing because of my family history.","zh":"因为家族史，我的医生建议做 BRCA 检测。"}]}],"synonyms":["BRCA1","BRCA2","breast cancer susceptibility gene","BRCA mutation","BRCA testing"],"phonetic":"ˌbiː ɑːr siː ˈeɪ","extraExplanation":["BRCA 是缩写，来自 “BReast CAncer”（乳腺癌）+ 研究命名习惯。日常口语里常把它当作字母逐个念（B-R-C-A）。","“有 BRCA”通常不完整；更常见说法是 “have a BRCA mutation / carry a BRCA variant”（携带 BRCA 基因变异/突变）。","医学语境中，BRCA 检测属于遗传检测的一种，通常会结合家族史、个人病史与遗传咨询来解读结果。"]}
{"word":"BRCS","summary":{"en":"BRCS usually refers to the Brief Resilient Coping Scale, a short measure of resilient coping; it can also be a field-specific acronym.","zh":"BRCS通常指“简式复原力应对量表”，用于衡量复原性应对；也可能是某个领域的专用缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abbreviation most commonly used for the Brief Resilient Coping Scale, a short questionnaire used in psychology/health research to measure how well someone tends to cope with stress in a resilient way","zh":"常见缩写，指“简式复原力应对量表（Brief Resilient Coping Scale）”，用于心理学/健康研究的简短问卷，衡量一个人面对压力时的复原性应对倾向"},"examples":[{"en":"Participants completed the BRCS before and after the stress-management program.","zh":"参与者在压力管理课程前后填写了BRCS量表。"},{"en":"Higher BRCS scores are often interpreted as stronger resilient coping.","zh":"BRCS得分越高通常被解读为复原性应对能力越强。"}]},{"partOfSpeech":"other","definition":{"en":"(general use) the initials “B-R-C-S,” whose meaning depends on the field (e.g., an organization, a school program, a technical system)","zh":"（泛用）字母缩写“B-R-C-S”，具体含义取决于使用领域（如机构名称、学校项目、技术系统等）"},"examples":[{"en":"What does BRCS stand for in your report? Different departments use it differently.","zh":"在你的报告里BRCS代表什么？不同部门的用法可能不一样。"},{"en":"Please define BRCS the first time you use it in an email.","zh":"请在邮件中第一次出现BRCS时先写出全称并解释。"}]}],"synonyms":["Brief Resilient Coping Scale","resilience scale (general term)"],"phonetic":"/biː ɑːr siː ɛs/","extraExplanation":["在学术写作里，第一次出现BRCS通常会写成“Brief Resilient Coping Scale (BRCS)”，后面才只用缩写。","如果你告诉我你看到BRCS的具体句子/领域（心理学、医疗、学校、公司、工程等），我可以帮你确定它最准确的全称与中文译法。"]}
