{"word":"BRN","summary":{"en":"BRN is most commonly an abbreviation for “brown.” In some informal texting, it may also stand for “burn” (a sharp insult), depending on context.","zh":"BRN 最常见是 “brown（棕色）”的缩写；在少数非正式聊天中也可能指 “burn（嘲讽/怼人）”，具体看语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “brown,” used in product names, clothing sizes, makeup shades, maps, or technical color codes.","zh":"“brown（棕色）”的缩写，常见于商品名称、服装/彩妆色号、地图或一些技术性色彩标注中。"},"examples":[{"en":"The jacket comes in BLK and BRN.","zh":"这件夹克有黑色（BLK）和棕色（BRN）。"},{"en":"Choose BRN if you want a warmer, darker shade.","zh":"如果你想要更暖、更深的色调，就选 BRN。"}]},{"partOfSpeech":"other","definition":{"en":"(informal, texting) a shorthand for “burn,” meaning to insult someone or make a sharp joke at their expense.","zh":"（非正式/短信用语）“burn（嘲讽、挖苦）”的简写，表示对别人说了很损的话或“怼”了对方。"},"examples":[{"en":"That comment was a BRN.","zh":"那句评论简直是“暴击式嘲讽”。"},{"en":"He BRN’d his friend in the group chat.","zh":"他在群聊里把朋友怼了一下。"}]}],"synonyms":["brown (abbr.)"],"phonetic":"/ˌbiː ɑr ˈɛn/","extraExplanation":["BRN 作为缩写没有一个放之四海皆准的固定意思，强烈依赖语境：在商品/颜色表里多指“棕色”，在聊天语境里有时被当作“burn”的简写，但这种用法不如完整拼写常见。","如果你是在某个特定句子、游戏、社交媒体或文件里看到 BRN，把原句发来我可以帮你更准确判断它指什么。"]}
{"word":"Brnaba","summary":{"en":"Brnaba is typically used as a proper name (surname), most often seen in international contexts related to Serbia.","zh":"Brnaba 通常作为专有名词（姓氏）使用，多见于与塞尔维亚相关的国际语境中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A surname or proper name; most commonly recognized in English in connection with Serbian politician Ana Brnabić (often discussed in international news).","zh":"一个姓氏或专有名词；在英文语境中最常见的联想是与塞尔维亚政治人物安娜·布尔纳比奇（Ana Brnabić）相关（国际新闻中常见）。"},"examples":[{"en":"Brnaba is a name you may see in articles about Serbian politics.","zh":"你可能会在关于塞尔维亚政治的文章中看到“Brnaba”这个名字。"},{"en":"Some English sources mention Brnaba when discussing government leadership in Serbia.","zh":"一些英文资料在讨论塞尔维亚政府领导层时会提到“Brnaba”。"}]}],"synonyms":["(no direct synonyms; proper name)"],"phonetic":"/brəˈnɑːbə/","extraExplanation":["“Brnaba”本身不是常见英语词汇，更像是人名/姓氏的拼写形式。国际媒体里更常见的是“Brnabić”（带重音符号 ć），有时在不便输入特殊字符时会被简化或误拼成类似“Brnaba”。","发音会因说话者和原语言（塞尔维亚语）影响而变化；英语新闻播报里通常会按英语读音规则近似读。"]}
{"word":"Brnaby","summary":{"en":"Brnaby is most likely a misspelling of Burnaby (a city in British Columbia, Canada). It can also be a surname.","zh":"Brnaby 多半是 Burnaby（加拿大 BC 省本拿比市）的拼写错误；也可作姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Likely) a misspelling of **Burnaby**: a city in Metro Vancouver, British Columbia, Canada.","zh":"（很可能是）**Burnaby** 的拼写错误：加拿大不列颠哥伦比亚省（BC）大温哥华地区的一座城市。"},"examples":[{"en":"I live in Burnaby, near Vancouver.","zh":"我住在本拿比，靠近温哥华。"},{"en":"She takes the SkyTrain from Burnaby to downtown Vancouver.","zh":"她从本拿比坐天车去温哥华市中心。"}]},{"partOfSpeech":"other","definition":{"en":"A family name (surname) spelled **Burnaby**.","zh":"姓氏：**Burnaby**。"},"examples":[{"en":"Mr. Burnaby will join the meeting later.","zh":"Burnaby 先生稍后会加入会议。"}]}],"synonyms":["Burnaby","Metro Vancouver"],"phonetic":"/ˈbɝːnəbi/","extraExplanation":["“Brnaby”常见于打字漏了字母 **u** 的情况：**Burnaby**。英语里常读作 /ˈbɝːnəbi/，重音在第一个音节。","地名 Burnaby 通常被中文译为“本拿比”，是大温地区的重要城市之一（如 Metrotown、Burnaby Mountain 等地点常见于本地生活与出行语境）。"]}
{"word":"Brno","summary":{"en":"Brno is a major city in the Czech Republic (Moravia), often described as the country’s second-largest city.","zh":"Brno 指捷克共和国（摩拉维亚地区）的重要城市，常被称为捷克第二大城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A major city in the Czech Republic, in the region of Moravia; the country’s second-largest city (after Prague).","zh":"布尔诺：捷克共和国摩拉维亚地区的重要城市，通常被认为是捷克第二大城市（仅次于布拉格）。"},"examples":[{"en":"Brno is known for its universities and research centers.","zh":"布尔诺以大学和研究机构闻名。"},{"en":"We took a train from Prague to Brno in the afternoon.","zh":"我们下午从布拉格坐火车去布尔诺。"},{"en":"She’s attending a conference in Brno next week.","zh":"她下周要去布尔诺参加会议。"}]}],"synonyms":["Brünn (historical German name)"],"phonetic":"/ˈbɝːnoʊ/","extraExplanation":["英语里“Brno”通常直接沿用捷克语地名；在历史资料中，你可能会看到它的德语旧称“Brünn”（与奥匈帝国历史有关）。","英文写作中常用介词：in Brno（在布尔诺），from/to Brno（从/去布尔诺）。"]}
