{"word":"bry","summary":{"en":"“Bry” is most commonly a nickname for Bryan/Brian; it isn’t a standard English word with one fixed meaning.","zh":"“Bry”最常见是 Bryan/Brian 的昵称；它不是一个有固定标准词义的英文单词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a nickname or short form of the given name Bryan/Brian (and sometimes Bryce or Bryson).","zh":"（人名）Bry，常作 Bryan/Brian 的昵称或缩写（有时也指 Bryce/Bryson）。"},"examples":[{"en":"Bry, are you coming to the meeting later?","zh":"Bry，你等下要来开会吗？"},{"en":"His friends call him Bry instead of Bryan.","zh":"他的朋友不叫他 Bryan，而是叫他 Bry。"}]},{"partOfSpeech":"other","definition":{"en":"(rare, informal) a written abbreviation used as a personal handle/username; not a standard English word with a widely accepted meaning.","zh":"（少见，非正式）常见于网名/用户名的写法；不是一个有公认固定词义的标准英文单词。"},"examples":[{"en":"My username is bry_92.","zh":"我的用户名是 bry_92。"},{"en":"If you mean something else by “bry,” please share the full sentence.","zh":"如果你说的“bry”是别的意思，请把完整句子发我。"}]}],"synonyms":["Bryan","Brian","Bryce","Bryson"],"phonetic":"/braɪ/","extraExplanation":["“Bry”更多出现在名字/昵称里（例如短信、社交媒体、游戏ID）。它通常读作 /braɪ/，和“bri-”开头的名字发音接近。","如果你是在聊天里看到“bry”，有时可能是拼写错误或特定圈子里的缩写；提供上下文句子会更容易准确判断。"]}
{"word":"Bryaceae","summary":{"en":"Bryaceae is a scientific term for a family of mosses, especially including the genus *Bryum*.","zh":"Bryaceae 是“真藓科”的学名，指一类藓类植物的科，尤其包含真藓属（*Bryum*）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of mosses (plants without flowers or seeds), including the common genus *Bryum*; often found in moist or disturbed places such as soil, rocks, and pavement cracks.","zh":"藓类植物中的一个科（无花无种子植物），包含常见的真藓属（*Bryum*）；常见于潮湿或受扰动的环境，如土壤、岩石及路缝等处。"},"examples":[{"en":"In our field survey, we recorded several Bryaceae species growing on damp soil near the stream.","zh":"在我们的野外调查中，我们记录到溪流附近潮湿土壤上生长着几种真藓科（Bryaceae）物种。"},{"en":"The lab used a microscope to compare leaf shapes in Bryaceae specimens.","zh":"实验室用显微镜比较了真藓科标本的叶形差异。"}]}],"synonyms":["the Bryum family"],"phonetic":"/braɪˈeɪsi.i/","extraExplanation":["“Bryaceae”是植物分类学（taxonomy）中的科名，常见于学术论文、植物志、物种名录与生态调查报告中，日常英语对话里不常用。","科名通常来自代表性属名：Bryaceae 来自 Bryum（真藓属）。在植物命名中，很多“科”以 -aceae 结尾，如 Rosaceae（蔷薇科）、Poaceae（禾本科）。"]}
{"word":"bryaceae","summary":{"en":"Bryaceae is a scientific name for a family of mosses.","zh":"Bryaceae 是“苔藓科”的学名，指一类苔藓植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of mosses (plants) that includes the genus Bryum and many small, tuft-forming moss species; often found in moist soil, rocks, or disturbed ground.","zh":"苔藓植物中的一个科（苔藓科）；包含真藓属（Bryum）等许多小型、常成丛生长的苔藓，常见于潮湿土壤、岩石或受扰动的地面。"},"examples":[{"en":"Scientists recorded several Bryaceae species growing on damp soil near the stream.","zh":"科学家记录到溪流附近的潮湿土壤上生长着几种苔藓科植物。"},{"en":"In the lab, we compared leaf shapes to identify whether a sample belonged to Bryaceae.","zh":"在实验室里，我们比较叶片形状来判断样本是否属于苔藓科。"}]}],"synonyms":["the moss family Bryaceae","bryum moss family"],"phonetic":"/braɪˈeɪsi.iː/","extraExplanation":["“Bryaceae”是拉丁化的植物分类名称，常用于学术写作与物种检索；日常英语里更常说“a moss family / the moss family Bryaceae（一个苔藓科）”。","词尾“-aceae”是植物科名常见后缀（如 Rosaceae 蔷薇科、Poaceae 禾本科），看到这个后缀通常可以判断它是“某某科”。"]}
{"word":"bryaceous","summary":{"en":"Bryaceous means “moss-related” or “moss-like,” mainly used in botanical or literary descriptions.","zh":"Bryaceous 意为“与苔藓有关的/像苔藓的”，多用于植物学或文学性的自然描写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Relating to mosses, or resembling moss in appearance or texture.","zh":"（植物学）与苔藓有关的；像苔藓的（外观或质地）。"},"examples":[{"en":"The forest floor was covered with a bryaceous carpet of green growth.","zh":"森林地面铺着一层苔藓般的绿色“地毯”。"},{"en":"In the humid shade, bryaceous plants thrive on rocks and tree bark.","zh":"在潮湿的阴处，苔藓类植物在岩石和树皮上茂盛生长。"}]}],"synonyms":["mossy","bryophytic","moss-like"],"phonetic":"/braɪˈeɪʃəs/","extraExplanation":["“bryaceous”是较少见、偏学术/文学的形容词，常出现在植物学描述或描写自然景观的文字中。","词根bry-来自希腊语，和“moss（苔藓）”相关；在写作里用它能让描写更精确、也更有“自然观察”的味道。","相关常见表达：mossy（长满苔藓的，更口语常用）、bryophyte（苔藓植物，名词，学术用语）。"]}
{"word":"Bryales","summary":{"en":"Bryales is the scientific name for an order of true mosses.","zh":"Bryales 是“真藓目”的学名，指苔藓植物中的一个分类单位（目）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific name for an order of true mosses (plants) in biological classification","zh":"生物分类学中“真藓类”的一个“目”（苔藓植物的一类）"},"examples":[{"en":"In our lab, we compared moss samples from the Bryales and the Hypnales.","zh":"在我们的实验室里，我们比较了来自真藓目（Bryales）和灰藓目（Hypnales）的苔藓样本。"},{"en":"Many common lawn and forest mosses belong to Bryales.","zh":"许多常见的草坪和森林苔藓属于真藓目（Bryales）。"}]}],"synonyms":["moss order (informal)"],"phonetic":"/ˈbraɪ.eɪliːz/","extraExplanation":["“Bryales”是拉丁化的分类名称，常见于植物学/生态学论文与标本标签中；日常英语里很少使用。","在分类层级里，“order（目）”通常高于“family（科）”、低于“class（纲）”。因此看到Bryales时，可以理解为“某一大类苔藓的集合”。"]}
{"word":"bryales","summary":{"en":"Bryales is a biology term for an order of “true mosses.”","zh":"Bryales 是生物学术语，指“真藓目”，即苔藓的一类分类单元。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an order of mosses (plants without flowers or seeds), often called “true mosses,” including many common moss species found on soil, rocks, and tree bark","zh":"苔藓植物的一个“目”（分类等级），常被称为“真藓目”，包含许多常见的藓类，常生长在土壤、岩石和树皮上"},"examples":[{"en":"In biology class, we learned that many garden mosses belong to Bryales.","zh":"在生物课上，我们学到许多花园里常见的藓类属于真藓目（Bryales）。"},{"en":"Researchers compared Bryales species in wet and dry habitats.","zh":"研究人员比较了潮湿与干燥环境中的真藓目（Bryales）物种。"}]}],"synonyms":["true mosses (informal)","moss order (general)"],"phonetic":"/ˈbraɪˌeɪliːz/","extraExplanation":["“Bryales”是植物分类学里的术语：从大到小常见层级可理解为“界—门—纲—目—科—属—种”。Bryales属于“目”，主要归在藓类植物（mosses）中。","词根“bry-”来自希腊语 bryon，意思是“苔藓”。","如果你原本想查的是人名、品牌名或拼写不同的词（例如 brawls, brambles, or bryales 的某种专名），可以告诉我上下文（句子/领域），我可以帮你确认。"]}
{"word":"Bryan","summary":{"en":"Bryan is most commonly a male first name (a spelling variant of Brian) and can also be a surname.","zh":"Bryan 最常见是男性名字（Brian 的一种拼写），也可以作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (first name), common in English-speaking countries; a spelling variant of “Brian.”","zh":"男性名字（名），在英语国家常见；是“Brian”的一种拼写变体。"},"examples":[{"en":"Bryan is my classmate.","zh":"Bryan 是我的同学。"},{"en":"My brother’s name is Bryan.","zh":"我哥哥叫 Bryan。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname/last name).","zh":"姓氏（家族名/姓）。"},"examples":[{"en":"Ms. Bryan will lead the meeting today.","zh":"Bryan 女士今天将主持会议。"},{"en":"I saw Dr. Bryan at the hospital.","zh":"我在医院见到了 Bryan 医生。"}]}],"synonyms":["Brian","Ryan"],"phonetic":"/ˈbraɪən/","extraExplanation":["“Bryan”最常见的用法是英文名，也常见作姓。它通常读作 /ˈbraɪən/，重音在第一个音节，听起来像“BRY-uhn”。","“Bryan”和“Brian”在英语里通常发音相同，差别主要是拼写选择；在不同地区、家庭或年代里偏好不同。","作为姓氏时，你可能会在历史或新闻里见到：William Jennings Bryan（美国政治人物，常出现在美国历史/公民课阅读材料中）。"]}
{"word":"bryan","summary":{"en":"Bryan is most commonly used as a male first name, and it can also be a last name.","zh":"Bryan 最常见是男性名字，也可以作为姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (first name).","zh":"（男性）名字、名。"},"examples":[{"en":"Bryan is starting a new job next week.","zh":"Bryan 下周开始一份新工作。"},{"en":"I met Bryan at a language exchange event.","zh":"我在一次语言交换活动上认识了 Bryan。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname/last name).","zh":"姓氏、家族姓（英文姓/姓氏）。"},"examples":[{"en":"Her last name is Bryan.","zh":"她的姓是 Bryan。"},{"en":"Dr. Bryan will see you now.","zh":"Bryan 医生现在会见你。"}]}],"synonyms":["Brian (spelling variant)"],"phonetic":"/ˈbraɪən/","extraExplanation":["“Bryan”在英语里常见作人名，也可作姓。它常被认为是“Brian”的一种拼写变体；在不同地区与家庭里，拼写与发音可能略有差别，但通常都读作 /ˈbraɪən/。","作为姓氏时，“Bryan”也出现在一些历史与文化语境中，例如美国政治人物 William Jennings Bryan（威廉·詹宁斯·布莱恩）。"]}
{"word":"Bryana","summary":{"en":"Bryana is a female first name, a variant of Briana/Bryanna, related to Brian.","zh":"Bryana 是一个女性名字，是 Briana/Bryanna 的变体，与 Brian 相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feminine given name (a variant of Briana/Bryanna), often understood as “strong” or “noble,” related to the name Brian.","zh":"女性名字（Briana/Bryanna 的变体），常被理解为“坚强的 / 高贵的”，与 Brian 这个名字相关。"},"examples":[{"en":"Bryana is my classmate, and she loves reading mystery novels.","zh":"Bryana 是我的同学，她很喜欢读推理小说。"},{"en":"Please welcome Bryana to the team.","zh":"请欢迎 Bryana 加入团队。"}]}],"synonyms":["Briana","Brianna","Bryanna"],"phonetic":"/braɪˈænə/","extraExplanation":["“Bryana”多见于英语国家的人名用法，拼写变体包括 Briana、Brianna、Bryanna 等。","其常见来源是男性名 Brian 的女性化形式；Brian 常被认为与古凯尔特语有关，在流行文化中也常被解释为“高贵、强壮”等积极含义。","作为人名时，首字母通常大写：Bryana。不同家庭对发音可能略有差异，但常见读法接近 “bry-AN-uh”。"]}
{"word":"Bryanism","summary":{"en":"A term for ideas linked to William Jennings Bryan, especially populist politics and, later, anti-evolution education views.","zh":"指与威廉·詹宁斯·布赖恩相关的思想/立场，常指民粹政治；后来也常指反对教授进化论的观点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a political or social view associated with William Jennings Bryan, especially populist, anti-elite politics and (in later usage) opposition to teaching evolution in schools.","zh":"“布赖恩主义”：与威廉·詹宁斯·布赖恩相关的政治/社会主张，尤指民粹、反精英的政治立场；在后来的用法中也常指反对在学校教授进化论等观点。"},"examples":[{"en":"Some historians use “Bryanism” to describe a kind of rural populism in early 20th-century America.","zh":"一些历史学家用“Bryanism（布赖恩主义）”来描述20世纪初美国一种乡村民粹主义。"},{"en":"In discussions of the Scopes Trial, “Bryanism” often refers to the movement against teaching evolution.","zh":"在讨论“斯科普斯审判”时，“Bryanism”常用来指反对教授进化论的运动。"}]}],"synonyms":["populism (in some contexts)","anti-evolution movement (in some contexts)"],"phonetic":"/ˈbraɪənɪzəm/","extraExplanation":["“Bryanism”源自美国政治人物 William Jennings Bryan（1860–1925）。他以为普通民众发声、批评金融与政治精英而闻名；同时他在1925年参与“斯科普斯审判”（Scopes Trial），反对在公立学校教授进化论，因此该词在不同语境下可能强调“民粹政治”或“反进化论/宗教保守主义”的一面。","这是一个带历史语境的专有名词式用法（常见于历史、政治评论）。使用时通常需要说明你指的是哪一层含义。"]}
{"word":"bryanism","summary":{"en":"Bryanism means the ideas linked to William Jennings Bryan—often American populist economic reform, and sometimes specifically anti-evolution activism connected to the Scopes Trial.","zh":"“布莱恩主义”指与威廉·詹宁斯·布莱恩相关的思想：常指民粹主义式的经济改革主张；有时特指与斯科普斯审判相关的反进化论立场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The political ideas and style associated with William Jennings Bryan, especially American populism: support for farmers and workers, distrust of big business and banks, and calls for economic reform.","zh":"“布莱恩主义”：指与威廉·詹宁斯·布莱恩（William Jennings Bryan）相关的政治理念与风格，尤指美国民粹主义取向——支持农民与工人、警惕大企业与银行，并主张经济改革。"},"examples":[{"en":"Some historians describe his speeches as a classic example of Bryanism in American populist politics.","zh":"一些历史学家把他的演讲视为美国民粹政治中“布莱恩主义”的典型例子。"},{"en":"Bryanism appealed to voters who felt ignored by powerful financial interests.","zh":"“布莱恩主义”吸引了那些觉得自己被强势金融利益忽视的选民。"}]},{"partOfSpeech":"n.","definition":{"en":"More narrowly, a conservative religious stance in early-20th-century America that opposed teaching evolution in public schools, associated with Bryan’s role in the Scopes Trial.","zh":"更狭义地说：指20世纪初美国一种保守宗教立场，反对在公立学校教授进化论；与布莱恩在“斯科普斯审判”（Scopes Trial）中的角色相关。"},"examples":[{"en":"In discussions of the Scopes Trial, Bryanism is sometimes used to mean anti-evolution activism.","zh":"在讨论“斯科普斯审判”时，“布莱恩主义”有时被用来指反进化论的行动与运动。"},{"en":"The article contrasts scientific modernism with Bryanism in 1920s America.","zh":"这篇文章对比了20世纪20年代美国的科学现代主义与“布莱恩主义”。"}]}],"synonyms":["populism","agrarian populism","anti-evolutionism"],"phonetic":"/ˈbraɪənɪzəm/","extraExplanation":["词源：Bryanism 来自美国政治家 William Jennings Bryan（1860–1925）的姓氏 + -ism（表示“主义/思潮”）。","使用场景提示：这个词主要出现在美国历史、政治史、宗教与教育史的学术或评论性写作中，日常口语里不常用。","语感提醒：不同作者可能强调不同侧面——有的侧重“经济民粹改革”，有的侧重“反进化论/宗教保守”。阅读时可结合上下文判断。"]}
{"word":"Bryanite","summary":{"en":"Bryanite most commonly means a person from a place called Bryan; historically, it can also mean a supporter of William Jennings Bryan.","zh":"Bryanite 通常指来自名为 Bryan 的地方（尤其是德州 Bryan 市）的人；在历史语境中也可指威廉·詹宁斯·布莱恩的支持者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Bryan (a place name, especially Bryan, Texas); an informal demonym.","zh":"来自“Bryan”（地名，尤其指美国德州 Bryan 市）的人；一种非正式的居民称呼。"},"examples":[{"en":"Many Bryanites go to College Station for football games.","zh":"很多 Bryan 的居民会去 College Station 看橄榄球比赛。"},{"en":"She’s a proud Bryanite and volunteers at local events.","zh":"她以自己是 Bryan 人为荣，并在本地活动中做志愿者。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) a supporter or follower of William Jennings Bryan, a prominent U.S. politician in the late 19th and early 20th centuries.","zh":"（历史用法）威廉·詹宁斯·布莱恩（William Jennings Bryan，19—20世纪之交的美国重要政治人物）的支持者/追随者。"},"examples":[{"en":"Some newspapers called his most loyal voters Bryanites.","zh":"一些报纸把他最忠诚的选民称为 Bryanites。"},{"en":"The Bryanites favored reforms that challenged big business influence.","zh":"这些“Bryan 派”倾向支持挑战大企业影响力的改革。"}]}],"synonyms":["resident of Bryan","Bryan resident","supporter of William Jennings Bryan"],"phonetic":"/ˈbraɪənaɪt/","extraExplanation":["“-ite”在英语里常用来表示“某地的人/某派别的人/某种追随者”（如 New York + -er → New Yorker；但很多地名或人名也会用 -ite：Brooklynite, Jacobite）。因此 Bryanite 多半是由 Bryan + -ite 构成的称呼。","Bryanite 并不是非常常见、固定的标准词条；在实际使用中，它更多出现在本地语境（社区、媒体、学校）或历史政治讨论中。写作时若担心读者不熟悉，可改写为 “a resident of Bryan” 或 “a supporter of William Jennings Bryan”。"]}
{"word":"bryanite","summary":{"en":"A Bryanite is usually a supporter of William Jennings Bryan; less commonly, it can mean someone from a place named Bryan.","zh":"Bryanite 通常指威廉·詹宁斯·布莱恩的支持者；较少见时也可指来自名为 Bryan 的地方的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a supporter or follower of William Jennings Bryan (an American politician), especially in late-19th/early-20th-century U.S. politics; a “Bryan Democrat.”","zh":"（尤指19世纪末至20世纪初美国政治中）威廉·詹宁斯·布莱恩的支持者、追随者；“布莱恩派民主党人”。"},"examples":[{"en":"In the 1896 campaign, many Bryanites argued for “free silver” to help farmers and workers.","zh":"在1896年的竞选中，许多布莱恩派主张“自由铸银”，以帮助农民和工人。"},{"en":"The newspaper described him as a Bryanite who opposed Wall Street influence.","zh":"报纸称他为布莱恩派，反对华尔街的影响。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a person from a place named Bryan (used like a local nickname or demonym).","zh":"（较少见）来自名为Bryan的地方的人（用作当地称呼/居民称谓）。"},"examples":[{"en":"As a Bryanite, she knew every shortcut across town.","zh":"作为Bryan本地人，她熟悉城里每一条近路。"}]}],"synonyms":["Bryan supporter","Bryan follower","Bryan Democrat"],"phonetic":"/ˈbraɪənaɪt/","extraExplanation":["“-ite”在英语里常用来表示“某人的追随者/某派别的人”（如 Marxist/Marxite 的类似用法）或“来自某地的人”。因此 Bryan + -ite 形成 Bryanite。","威廉·詹宁斯·布莱恩（William Jennings Bryan）以民粹主义色彩、反大资本、以及1896年著名的“金十字演说（Cross of Gold speech）”而闻名；历史语境里出现 Bryanite 多与当时党派与经济议题相关。"]}
{"word":"Bryanna","summary":{"en":"Bryanna is a female first name, a variant spelling of Brianna.","zh":"Bryanna 是女性英文名，常被视为 Brianna 的变体拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (a variant spelling of Brianna), used as a person’s first name.","zh":"女性名字（Brianna 的变体拼写），用作人的名字。"},"examples":[{"en":"Bryanna is starting a new job next week.","zh":"Bryanna 下周要开始一份新工作。"},{"en":"I met Bryanna at the library.","zh":"我在图书馆认识了 Bryanna。"},{"en":"Could you ask Bryanna to call me back?","zh":"你能请 Bryanna 给我回个电话吗？"}]}],"synonyms":["Brianna","Briana","Breanna","Brianne"],"phonetic":"/briˈænə/","extraExplanation":["Bryanna 通常被看作 Brianna 的另一种拼写（把 i 换成 y），读音一般不变。","Brianna 这个名字在英语语境中常与 Brian / Bryan（源自凯尔特语系姓名）相关联，现代用法里多被理解为“女性化的 Brian/Bryan”。","在正式场合，英文名字的拼写很重要：填写表格、邮箱、证件时要按本人惯用拼写 Bryanna（而不是 Brianna）。"]}
{"word":"Bryansk","summary":{"en":"Bryansk is a city in western Russia and the capital of Bryansk Oblast.","zh":"Bryansk（布良斯克）是俄罗斯西部的城市，也是布良斯克州的首府。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in western Russia, near the borders with Belarus and Ukraine; it is the administrative center of Bryansk Oblast.","zh":"布良斯克（Bryansk）：俄罗斯西部的一座城市，靠近白俄罗斯和乌克兰边境，是布良斯克州的行政中心。"},"examples":[{"en":"Bryansk is a regional center in western Russia.","zh":"布良斯克是俄罗斯西部的一个地区中心城市。"},{"en":"The train route passes through Bryansk on the way to Moscow.","zh":"这条火车线路去莫斯科的路上会经过布良斯克。"}]}],"phonetic":"/briˈænsk/","extraExplanation":["“Bryansk”是地名专有名词，写作首字母大写。作形容词时常用“Bryansk + 名词”（如Bryansk region/forest/oblast）。","布良斯克一带以“Bryansk Forest（布良斯克森林）”闻名，二战时期曾是游击队活动的重要区域。"]}
{"word":"Bryant","summary":{"en":"Bryant is mainly a surname and sometimes a first name; it can also be a U.S. place name.","zh":"Bryant主要是英文姓氏，也可作名字；此外也可能是美国地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname) of English origin.","zh":"布莱恩特：一个英语来源的姓氏。"},"examples":[{"en":"Ms. Bryant will lead the meeting today.","zh":"布莱恩特女士今天将主持会议。"},{"en":"I met Professor Bryant at the conference.","zh":"我在会议上见到了布莱恩特教授。"}]},{"partOfSpeech":"n.","definition":{"en":"a given name (first name), used for any gender but more common for boys in modern usage.","zh":"布莱恩特：一个名字（名），可用于任何性别，但现代用法中更常见于男孩。"},"examples":[{"en":"Bryant is starting his new job next week.","zh":"布莱恩特下周开始新工作。"},{"en":"Bryant and I are in the same class.","zh":"布莱恩特和我在同一个班。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name in the U.S. (for example, a city in Arkansas) and also used in names of schools, streets, and buildings.","zh":"布莱恩特：美国的一些地名（例如阿肯色州的一个城市），也常用于学校、街道或建筑物的名称。"},"examples":[{"en":"They moved to Bryant, Arkansas, last year.","zh":"他们去年搬到了阿肯色州的布莱恩特市。"},{"en":"The event is at Bryant Park.","zh":"活动在布莱恩特公园举行。"}]}],"phonetic":"/ˈbraɪənt/","extraExplanation":["“Bryant”常见于英语国家的人名与地名。作为姓氏时，多用于正式称呼（如Mr./Ms. Bryant）；作为名字时，通常直接称呼Bryant。","文化语境里，“Bryant”也可能让人联想到一些知名人物（如篮球运动员Kobe Bryant、诗人William Cullen Bryant），但在日常对话中是否特指要看上下文。"]}
{"word":"bryant","summary":{"en":"Bryant is most commonly a surname, and sometimes a first name.","zh":"Bryant 最常见是英文姓氏，也可用作名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A family name (surname). Many well-known people have this surname.","zh":"姓氏（家族姓）。许多知名人物使用这个姓。"},"examples":[{"en":"Kobe Bryant was a famous American basketball player.","zh":"科比·布莱恩特是一位著名的美国篮球运动员。"},{"en":"Ms. Bryant will lead today’s meeting.","zh":"布莱恩特女士将主持今天的会议。"}]},{"partOfSpeech":"n.","definition":{"en":"A given name (first name), less common than the surname.","zh":"名字（名），但不如作为姓氏常见。"},"examples":[{"en":"Bryant is his first name, not his last name.","zh":"Bryant 是他的名字，不是姓氏。"}]}],"phonetic":"/ˈbraɪənt/","extraExplanation":["“Bryant”常被当作英文姓氏使用，源自更早的名字形式（与 Brian / Bryan 有关），大意与“高贵、强壮”等含义相关的传统解释有关，但现代英语里通常把它当作姓名而不强调字面意义。","文学/文化中：William Cullen Bryant（威廉·卡伦·布莱恩特）是19世纪美国诗人和编辑；在美国地名与机构名中也能见到“Bryant”，例如 Bryant University（布莱恩特大学）等。"]}
{"word":"Bryanthus","summary":{"en":"Bryanthus is the scientific name of a genus of small flowering shrubs in the heather family.","zh":"Bryanthus 是苔花属的学名，指石南科的一属小型开花灌木。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small, heath-like flowering shrubs in the heather family (Ericaceae), found mainly in cold or mountainous regions.","zh":"（植物）苔花属：杜鹃花科（石南科，Ericaceae）的一属小型、类似石南的开花灌木，多见于寒冷或高山地区。"},"examples":[{"en":"Bryanthus is a genus in the heather family, adapted to alpine environments.","zh":"苔花属（Bryanthus）属于石南科，适应高山环境。"},{"en":"In some field guides, Bryanthus species are described as low shrubs with pink, bell-shaped flowers.","zh":"在一些野外植物图鉴中，苔花属植物常被描述为低矮灌木，开粉色钟形花。"}]}],"synonyms":["(no common everyday synonym; usually referred to by its scientific name)"],"phonetic":"/ˈbraɪænθəs/","extraExplanation":["词源提示：Bryanthus 来自希腊语 bryon（苔藓）+ anthos（花），字面有“苔藓之花/苔花”的感觉，常用于植物分类学的拉丁化命名。","使用场景：主要见于植物学、自然观察、植物图鉴等语境；日常英语里不常用。"]}
{"word":"bryanthus","summary":{"en":"Bryanthus is a botanical genus name for arctic heather-like shrubs in the heather family.","zh":"Bryanthus 是一个植物学属名，指石南科中分布于寒冷地区、类似“北极石南”的小灌木。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small flowering shrubs in the heather family (Ericaceae), found mainly in cold northern regions; often called “arctic heather.”","zh":"（植物）Bryanthus：杜鹃花科（Ericaceae，石南科）的一属小型开花灌木，主要分布在寒冷的北方地区，常被称为“北极石南/北极石楠”。"},"examples":[{"en":"Bryanthus grows in cold, wet tundra environments.","zh":"Bryanthus 多生长在寒冷、潮湿的苔原环境中。"},{"en":"Some field guides list Bryanthus as an arctic heather.","zh":"一些野外植物图鉴会把 Bryanthus 标注为“北极石南”。"}]}],"synonyms":["arctic heather"],"phonetic":"/braɪˈænθəs/","extraExplanation":["“Bryanthus”多见于植物学/生态学语境，一般不作为日常英语词汇使用。它通常是拉丁学名（属名），写作时首字母常大写：Bryanthus。","如果你是在名字、用户名或品牌里看到“bryanthus”，也可能是自造词或拼写变体；若你能提供上下文句子，我可以帮你判断具体含义。"]}
{"word":"Bryantown","summary":{"en":"Bryantown is a place name: a small community in Charles County, Maryland, USA.","zh":"Bryantown 是一个地名：位于美国马里兰州查尔斯县的小社区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small unincorporated community in Charles County, Maryland, USA.","zh":"美国马里兰州查尔斯县的一个非建制社区（未设市镇政府的聚居地）。"},"examples":[{"en":"Bryantown is a quiet community in southern Maryland.","zh":"Bryantown 是马里兰州南部一个安静的社区。"},{"en":"They drove through Bryantown on the way to La Plata.","zh":"他们去拉普拉塔（La Plata）的路上经过了 Bryantown。"}]}],"synonyms":["Bryantown, Maryland"],"phonetic":"/ˈbraɪəntˌtaʊn/","extraExplanation":["“Bryantown”是专有名词（地名），通常不翻译，中文里多写作“布赖恩敦/布莱恩敦”（音译）或直接保留英文拼写。","它属于“unincorporated community（非建制社区）”，意思是该地区不作为独立城市/城镇设立市政政府，行政服务一般由县（county）提供。","英语地名里“-town”很常见，常表示“城镇/聚落”，很多此类地名源自早期定居者的姓氏（如 Bryant + town）。"]}
{"word":"Bryantsville","summary":{"en":"Bryantsville is a U.S. place name, usually referring to a small town/community.","zh":"Bryantsville 是美国的地名，通常指某个小城镇或社区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A place name (proper noun) used for small towns/communities in the United States (for example, Bryantsville, Kentucky).","zh":"（专有名词）美国的一些小城镇/社区的地名（例如肯塔基州的 Bryantsville）。"},"examples":[{"en":"She grew up in Bryantsville, Kentucky, before moving to the city.","zh":"她在肯塔基州的 Bryantsville 长大，后来搬去了城市。"},{"en":"Bryantsville is a small community, so everyone seems to know each other.","zh":"Bryantsville 是个小地方，所以大家好像彼此都认识。"}]}],"synonyms":["Bryantsville, KY","Bryantsville (place name)"],"phonetic":"ˈbraɪəntsˌvɪl","extraExplanation":["“Bryantsville”属于美国常见的地名构词：人名（Bryant）+ “-ville”（意为“城镇/聚居地”）。不同州可能都有同名地名，因此在写作或查地图时，常需要加上州名（如 Bryantsville, KY）来避免混淆。"]}
{"word":"Bryantville","summary":{"en":"Bryantville is a place name, most often a small village/area in Pembroke, Massachusetts.","zh":"Bryantville 是一个地名，最常见指美国马萨诸塞州彭布罗克的一个社区/村落。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A village/area name, most commonly referring to Bryantville in Pembroke, Massachusetts, USA.","zh":"一个地名，最常见指美国马萨诸塞州彭布罗克（Pembroke）境内的 Bryantville（布赖恩特维尔）社区/村落。"},"examples":[{"en":"Bryantville is a small community within the town of Pembroke, Massachusetts.","zh":"Bryantville 是马萨诸塞州彭布罗克镇里的一个小社区。"},{"en":"We drove through Bryantville on the way to the South Shore.","zh":"我们去南岸（South Shore）的路上开车经过了 Bryantville。"}]}],"phonetic":"/ˈbraɪəntˌvɪl/","extraExplanation":["“Bryantville”是专有名词（地名），通常不翻译，只做音译或直接使用英文拼写。常见写法是“Bryantville, MA”。","在英语里，很多地名以“-ville”结尾，源自法语“ville”（城镇/村庄），在美国地名中很常见，常表示“某人的城镇/聚落”（如以姓氏 Bryant 命名）。"]}
{"word":"Bryce","summary":{"en":"Bryce is most commonly a person’s name (first name or surname), and it can also refer to Bryce Canyon in the U.S.","zh":"Bryce 最常见是人名（名字或姓氏），也可指美国的 Bryce Canyon（布莱斯峡谷）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (first name), used for people of any gender but more common for boys in modern English-speaking countries","zh":"人名（名字），可用于任何性别，但在现代英语国家更常见于男孩名"},"examples":[{"en":"Bryce is new to our class.","zh":"Bryce 是我们班的新同学。"},{"en":"I met Bryce at the library yesterday.","zh":"我昨天在图书馆遇到了 Bryce。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname)","zh":"姓氏"},"examples":[{"en":"Her last name is Bryce.","zh":"她的姓是 Bryce。"},{"en":"The article was written by Dr. Bryce.","zh":"这篇文章是 Bryce 博士写的。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name, most famously in “Bryce Canyon” (a national park area in Utah, USA)","zh":"地名，最常见于 “Bryce Canyon（布莱斯峡谷）”（美国犹他州的国家公园区域）"},"examples":[{"en":"We visited Bryce Canyon during our trip to Utah.","zh":"我们去犹他州旅行时参观了布莱斯峡谷。"},{"en":"The sunset at Bryce was unforgettable.","zh":"布莱斯（峡谷）的日落令人难忘。"}]}],"synonyms":["Brice (variant spelling)","Bruce (similar-sounding name)"],"phonetic":"/braɪs/","extraExplanation":["“Bryce” 常见来源之一是苏格兰/爱尔兰的姓氏与名字传统；在英语里作为专有名词，首字母通常大写。","“Bryce Canyon” 的名称来自早期定居者 Ebenezer Bryce；日常口语中有人会把 Bryce Canyon 简称为 “Bryce”。"]}
{"word":"Bryceland","summary":{"en":"Bryceland is mainly used as a surname or other proper name.","zh":"Bryceland 主要用作姓氏或其他专名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a surname (family name).","zh":"姓氏（家族姓）。"},"examples":[{"en":"Ms. Bryceland will lead the meeting today.","zh":"Bryceland 女士今天将主持会议。"},{"en":"I found an email from Dr. Bryceland in my inbox.","zh":"我在收件箱里看到一封来自 Bryceland 医生的邮件。"}]},{"partOfSpeech":"other","definition":{"en":"a proper name that may also be used as a place name or institution name in some contexts.","zh":"专有名词；在某些语境中也可能作为地名或机构名使用。"},"examples":[{"en":"The report mentions Bryceland as the project’s local partner.","zh":"报告提到 Bryceland 是该项目的本地合作方。"},{"en":"They traced the family history back to a place called Bryceland.","zh":"他们把家族历史追溯到一个名为 Bryceland 的地方。"}]}],"phonetic":"ˈbraɪslənd","extraExplanation":["“Bryceland”不是常见的普通词汇，更多见作英语世界里的姓氏或专名。","从构词直觉看，它可能与人名/地名来源有关：常见的地名后缀 -land 表示“土地、地区”，前半部分可能与人名（如 Bryce）或古地名元素相关。实际来源需结合具体家族/地区档案确认。","学习与使用建议：在写作中通常首字母大写（Bryceland）；作为称呼时可搭配 Mr./Ms./Dr.（如 “Dr. Bryceland”）。"]}
{"word":"Bryceville","summary":{"en":"Bryceville is a place name: an unincorporated community in Nassau County, Florida.","zh":"Bryceville 是一个地名：美国佛罗里达州拿骚县的非建制社区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An unincorporated community (small place name) in Nassau County, Florida, USA.","zh":"美国佛罗里达州拿骚县的一个“非建制社区”（一种小型聚居地/地名）。"},"examples":[{"en":"Bryceville is a quiet community in northeastern Florida.","zh":"Bryceville 是佛罗里达州东北部一个安静的小社区。"},{"en":"They drove through Bryceville on the way to Jacksonville.","zh":"他们去杰克逊维尔的路上开车经过了 Bryceville。"}]}],"synonyms":["(No direct synonyms; it’s a proper place name.)"],"phonetic":"/ˈbraɪsˌvɪl/","extraExplanation":["在美国，像 Bryceville 这样的地名常被标注为“unincorporated community（非建制社区）”，意思是它不是一个独立建制的城市/镇，没有自己的市政府，通常由县（county）层级提供公共服务。","Bryceville 位于佛罗里达州东北部、靠近杰克逊维尔（Jacksonville）一带。拼写中常见的后缀 -ville 表示“城镇/聚落”，在美国地名里很常见。"]}
{"word":"brycg","summary":{"en":"“brycg” is the Old English form of the modern word “bridge.”","zh":"“brycg”是现代英语“bridge（桥）”的古英语形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An Old English spelling of “bridge,” meaning a structure built to carry people or vehicles across a river, road, etc.","zh":"“bridge（桥）”的古英语拼写形式，指建造用来跨越河流、道路等的桥梁。"},"examples":[{"en":"In Old English texts, “brycg” is the word that later became “bridge.”","zh":"在古英语文本中，“brycg”就是后来演变成“bridge”的词。"},{"en":"The village built a brycg over the stream to reach the market.","zh":"村庄在小溪上建了一座桥（brycg），以便去集市。"}]}],"synonyms":["bridge","crossing"],"phonetic":"/brɪdʒ/","extraExplanation":["“brycg”来自古英语；在现代英语中对应的形式是“bridge”。","古英语里常见的拼写“cg”在历史演变中发展为现代英语的“dg”发音/拼写（听起来接近 /dʒ/），所以“brycg”读起来大致像今天的“bridge”。","如果你是在手稿、纹身、或古英语学习资料里看到“brycg”，通常就是在用一种更“中古/古风”的方式写“bridge”。"]}
{"word":"bryd","summary":{"en":"“bryd” isn’t standard English; it’s usually a typo for “bird” or “bride,” but it can be a Welsh word meaning “mind/intention.”","zh":"“bryd” 不是标准英语；多半是把 “bird” 或 “bride” 拼错了，但在威尔士语中可表示“心思/意图”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most commonly a misspelling of “bird” or “bride.”","zh":"不是标准英语单词；最常见是把 “bird（鸟）” 或 “bride（新娘）” 拼错了。"},"examples":[{"en":"Did you mean “bird”? (A bryd is not an English word.)","zh":"你是想写 “bird” 吗？（bryd 不是英语单词。）"},{"en":"If you meant “bride,” it refers to a woman on her wedding day.","zh":"如果你想写的是 “bride”，意思是“新娘（结婚当天的女性）”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Welsh) mind; intention; a sense of “being inclined/ready” (often seen in phrases).","zh":"（威尔士语）心思；意图；也可表示“有…的打算/正想…（常见于固定搭配）”。"},"examples":[{"en":"(Welsh) ar bryd","zh":"（威尔士语）ar bryd：此刻、目前"},{"en":"(Welsh) Mae hi ar bryd mynd.","zh":"（威尔士语）她正打算/正要走。"}]}],"synonyms":["mind","intention","inclination"],"phonetic":"/brɪd/","extraExplanation":["在英语学习语境里，输入 “bryd” 通常是拼写错误：最常见的目标词是 **bird** /bɝd/（鸟）或 **bride** /braɪd/（新娘）。","如果你是在读威尔士语材料，**bryd** 常出现在固定搭配里，例如 **ar bryd** 表示“此刻、目前”，或表示“正想做某事/准备做某事”的语气。"]}
{"word":"brydguma","summary":{"en":"“Brydguma” is an Old English word meaning “bridegroom” (the groom).","zh":"“brydguma”是古英语词，意思是“新郎（bridegroom）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Old English) a bridegroom; the man who is getting married or has just been married.","zh":"（古英语）新郎；正在结婚或刚结婚的男子。"},"examples":[{"en":"In Old English texts, “brydguma” refers to the groom at a wedding.","zh":"在古英语文本中，“brydguma”指婚礼中的新郎。"},{"en":"The word “bridegroom” comes from “bryd” (bride) + “guma” (man).","zh":"“bridegroom（新郎）”一词来自“bryd（新娘）”+“guma（男子）”。"}]}],"synonyms":["bridegroom","groom"],"phonetic":"/ˈbraɪdˌɡruːm/","extraExplanation":["“brydguma”是古英语拼写，现代英语对应词是 bridegroom（新郎）。其中 guma 在古英语里是“男人”的意思，但这个词后来在英语里基本消失了，所以人们逐渐把不熟悉的 -guma 误联想成 groom，形成了现代拼写 bridegroom（这属于“民间词源”现象）。"]}
{"word":"brymme","summary":{"en":"“Brymme” is not standard English; it likely means “brim” (the edge/top rim).","zh":"“brymme”不是标准英语；多半是“brim”的误拼（指边缘/杯沿）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard modern English word. It is most likely a misspelling of “brim.”","zh":"不是现代英语里的标准拼写；很可能是把“brim”拼错了。"},"examples":[{"en":"I couldn’t find “brymme” in an English dictionary—did you mean “brim”?","zh":"我在英语词典里找不到“brymme”——你是不是想写“brim”？"},{"en":"The water filled the cup to the brim.","zh":"水把杯子装到了杯沿。"}]}],"synonyms":["brim","edge","rim"],"phonetic":"brɪm","extraExplanation":["“brim”常见意思是“边缘/杯沿”，也可指“帽檐”。如果你告诉我你看到“brymme”的句子或来源（书名、截图、哪国语言环境），我也可以帮你判断它是否是人名、地名，或是其他语言（例如北欧语言）的词。"]}
{"word":"Bryn","summary":{"en":"Bryn is a Welsh-origin name meaning “hill,” and it also refers to “hill” as a Welsh word/place-name element.","zh":"Bryn 是源自威尔士语、意为“山丘”的人名；它本身也可指“山丘”，并常作为威尔士地名的组成部分。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A given name of Welsh origin meaning “hill” (from Welsh bryn). It can be used for any gender, though it is often seen as masculine in Wales and sometimes unisex elsewhere.","zh":"一个源自威尔士语的人名，意为“山丘”（来自威尔士语 bryn）。可用于任何性别；在威尔士较常见为男性名，在其他地区也常被当作中性名使用。"},"examples":[{"en":"Bryn is starting a new job next week.","zh":"Bryn 下周要开始一份新工作。"},{"en":"We named our son Bryn to honor our Welsh roots.","zh":"我们给儿子取名 Bryn，是为了纪念我们的威尔士血统。"}]},{"partOfSpeech":"n.","definition":{"en":"A Welsh word and common place-name element meaning “hill,” often found in Welsh geography and in names of places.","zh":"一个威尔士语词/常见地名构成成分，意为“山丘”，常出现在威尔士的地理描述与地名中。"},"examples":[{"en":"In Wales, you may see “bryn” in many place names.","zh":"在威尔士，你可能会在许多地名里看到 “bryn”。"},{"en":"The cottage sits on a bryn above the village.","zh":"那间小屋坐落在村庄上方的山丘上。"}]}],"synonyms":["Brynn","Brin"],"phonetic":"/brɪn/","extraExplanation":["“Bryn”源自威尔士语 bryn（山丘）。作为名字时，英语世界里也常见拼写变体如 Brynn（更常用于女性名）或 Brin（较少见）。","在威尔士地名中，bryn 很常见，类似英语里的 hill；有时会与其他威尔士语元素组合形成地名，体现当地地形特征。"]}
{"word":"Bryna","summary":{"en":"Bryna is a female first name.","zh":"Bryna 是一个女性英文名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (first name), used in English-speaking contexts.","zh":"（人名）女性名字（常见于英语环境中的名）。"},"examples":[{"en":"Bryna starts her new job on Monday.","zh":"Bryna 星期一开始她的新工作。"},{"en":"My friend Bryna lives in Seattle.","zh":"我的朋友 Bryna 住在西雅图。"}]}],"synonyms":["Brynn","Bryn","Brina","Bruna"],"phonetic":"/ˈbraɪnə/","extraExplanation":["“Bryna”主要作为人名使用，含义会因文化来源不同而有差异：\n1）在一些用法中被视为与 Brynn/Bryn 等名字相关，Bryn 在威尔士语里常与“山丘”之意联系。\n2）在犹太/意第绪语姓名体系里，Bryna 也常被解释为与“Bruna/Bruno”同源的女性形式，常被理解为“棕色的（brown）”。\n实际取名时多看家族传统、地区习惯或个人偏好。"]}
{"word":"Brynathyn","summary":{"en":"Brynathyn is most likely a rare or invented proper name rather than a standard English word.","zh":"Brynathyn 很可能是一个罕见或自创的专有名称，而不是标准英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare or nonstandard proper name (likely a person’s name, character name, or invented/fantasy name). It does not appear as a common English dictionary word.","zh":"一个较罕见或非标准的专有名词（很可能是人名、角色名或自创/奇幻名字），并非常见英文词典词汇。"},"examples":[{"en":"Brynathyn is the name of a character in my story.","zh":"Brynathyn 是我故事里一个角色的名字。"},{"en":"I’m not sure how to pronounce Brynathyn—could you say it aloud?","zh":"我不确定 Brynathyn 怎么读——你能念一下吗？"},{"en":"Brynathyn doesn’t have a standard meaning in English; it may be a made-up name.","zh":"Brynathyn 在英语里没有固定含义；它可能是自创的名字。"}]}],"phonetic":"/ˈbrɪnəθɪn/","extraExplanation":["这个词看起来更像“名字”而不是英语常用词，所以没有稳定、权威的词典释义是正常的。如果你能告诉我它来自哪里（书名、游戏、家族姓氏、地名、你想取的名字等），我可以更准确地解释含义与读音来源。","从拼写上看，它有一点“威尔士语/凯尔特风格”的感觉：例如威尔士语里 bryn 常见作“山丘”（也常出现在地名/人名中）。不过 Brynathyn 整体并不是一个我能确认的标准威尔士语词或常见名字，因此更可能是借用了这种风格的自创构词。","读音方面，如果按英语拼读习惯，可以暂时读作 /ˈbrɪnəθɪn/（BRIN-uh-thin）。但专有名词的标准读音最终还是要以作者/本人偏好或原出处为准。"]}
{"word":"bryndza","summary":{"en":"Bryndza is a soft, tangy sheep’s-milk cheese popular in Slovakia and nearby regions.","zh":"Bryndza 是一种柔软、带酸香的羊奶奶酪，常见于斯洛伐克及周边地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a soft, tangy cheese (often made from sheep’s milk), popular in Slovakia and nearby regions of Central/Eastern Europe","zh":"（常由羊奶制成的）一种柔软、带酸香的奶酪，流行于斯洛伐克及中东欧周边地区"},"examples":[{"en":"In Slovakia, bryndza is often served with potatoes and dumplings.","zh":"在斯洛伐克，bryndza 常配土豆和面疙瘩/饺子类食物一起吃。"},{"en":"This spread tastes like bryndza—salty, creamy, and slightly sour.","zh":"这种抹酱的味道像 bryndza——咸香、奶油般顺滑，还带一点酸味。"},{"en":"The recipe calls for bryndza, but feta is sometimes used as a substitute.","zh":"这道菜需要用 bryndza，不过有时也会用菲达奶酪（feta）代替。"}]}],"synonyms":["sheep’s-milk cheese","sheep cheese"],"phonetic":"/ˈbrɪndzə/","extraExplanation":["“Bryndza”在英语里多见于菜单、旅游介绍或中东欧饮食语境中。它在斯洛伐克非常有代表性，常用于传统菜“bryndzové halušky”（拌羊奶酪的小面团/土豆团）。","发音里的“dz”类似英语中“kids”里的 /dz/ 连读音。拼写看起来不太像英语单词，但在借词中很常见。"]}
{"word":"Bryner","summary":{"en":"Bryner is most commonly a surname (family name), and more rarely a first name.","zh":"Bryner 最常见作姓氏（家族姓），也较少见作名字（名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), used as someone’s last name","zh":"姓氏（家族姓），用作人的英文姓/家族名"},"examples":[{"en":"Ms. Bryner will lead today’s meeting.","zh":"Bryner 女士将主持今天的会议。"},{"en":"My teacher’s last name is Bryner.","zh":"我老师的姓是 Bryner。"}]},{"partOfSpeech":"n.","definition":{"en":"a given name (first name), less common; used for some people as a personal name","zh":"人名（名字/名），较少见；有些人会用作英文名/名字"},"examples":[{"en":"Bryner is a unique first name in this class.","zh":"Bryner 在这个班里是个很特别的名字。"}]}],"phonetic":"/ˈbraɪnər/","extraExplanation":["“Bryner”通常出现在英语语境里作为姓氏。拼写上也有人会看到更常见的近似形式“Brynner”（双 n），例如演员 Yul Brynner（尤·伯连纳）。不过“Bryner”和“Brynner”不一定是同一个姓，实际写法以本人证件/署名为准。","作为专有名词（人名/姓氏），一般不翻译含义；在正式写作中首字母要大写：Bryner。"]}
{"word":"Brynhild","summary":{"en":"Brynhild is a famous Valkyrie in Norse legend, often linked to the hero Sigurd and later known in German tradition as Brünnhilde.","zh":"Brynhild 是北欧传说中著名的女武神，常与英雄西格尔德相关；在德语传统中也常见作 Brünnhilde。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A Valkyrie (shield-maiden) in Norse mythology, famous from the legends of the Volsungs and later retellings (including Wagner’s operas). She is often portrayed as a powerful warrior woman whose fate is tied to the hero Sigurd (Siegfried).","zh":"北欧神话中的女武神（战场上选择战死者的女战士）。她在《沃尔松格萨迦》等传说及后世改编（如瓦格纳歌剧）中非常著名，常被塑造为强大的女战士，并与英雄西格尔德（齐格弗里德）的命运紧密相连。"},"examples":[{"en":"In Norse mythology, Brynhild is remembered as a fierce Valkyrie with a tragic story.","zh":"在北欧神话中，Brynhild 以勇猛的女武神形象和悲剧性的故事而被人记住。"},{"en":"Some English retellings spell her name as Brünnhilde or Brunhild.","zh":"一些英文改写中会把她的名字拼作 Brünnhilde 或 Brunhild。"}]}],"synonyms":["Brünnhilde","Brunhild","Brynhildr"],"phonetic":"ˈbrɪn.hɪld","extraExplanation":["“Brynhild”来自古诺尔斯语 Brynhildr：bryn- 与“盔甲/铠甲”有关，-hildr 与“战斗”有关，因此常被解释为“披甲的战士/战斗中的女子”。","在英语语境中，她常通过两条传统被认识：一是北欧史诗与冰岛萨迦；二是德国史诗《尼伯龙根之歌》以及瓦格纳《尼伯龙根的指环》中更常见的拼写“Brünnhilde”。","这是专名而非普通词汇；写作时通常大写，且不同作品对她的性格与剧情细节可能有差异。"]}
{"word":"brynhild","summary":{"en":"Brynhild is a well-known Valkyrie in Norse mythology and a variant form of the name Brünnhilde in later Germanic tradition.","zh":"Brynhild 指北欧神话中著名的女武神，也可作为 Brünnhilde（布伦希尔德）在后世日耳曼传统中的英文写法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A famous Valkyrie (a warrior maiden who chooses who dies in battle) in Norse mythology, often linked with the hero Sigurd (Siegfried).","zh":"北欧神话中的著名女武神（战场上选择生死的女战士），常与英雄西格尔德/齐格弗里德的故事相连。"},"examples":[{"en":"In Norse myths, Brynhild is a powerful Valkyrie with a tragic fate.","zh":"在北欧神话中，布伦希尔德是一位强大的女武神，命运悲剧。"},{"en":"The story of Sigurd and Brynhild appears in several medieval legends.","zh":"西格尔德与布伦希尔德的故事出现在多部中世纪传说中。"}]},{"partOfSpeech":"n.","definition":{"en":"A variant English form of the name Brünnhilde, used in Germanic legends and later works such as Wagner’s opera cycle.","zh":"名字“Brünnhilde（布伦希尔德）”的英文变体形式，常见于日耳曼传说及后来的作品（如瓦格纳的歌剧组曲）。"},"examples":[{"en":"Some translations use Brynhild, while others use Brünnhilde.","zh":"有些译本用 Brynhild，也有些用 Brünnhilde。"},{"en":"In discussions of Wagner, Brynhild is often spelled Brünnhilde.","zh":"在谈论瓦格纳时，Brynhild 常被拼作 Brünnhilde。"}]}],"synonyms":["Brünnhilde","Valkyrie"],"phonetic":"/ˈbrɪn.hɪld/","extraExplanation":["“Brynhild / Brünnhilde”在不同语言与译本中的拼写差异很常见：古诺尔斯语常见形式接近 Brynhildr；德语与瓦格纳作品里更常见 Brünnhilde。","她的故事常与“被惩罚沉睡、被火环/障壁围绕、被英雄唤醒或迎娶”之类的母题相连，但不同版本细节差异很大。"]}
{"word":"Brynhildr","summary":{"en":"Brynhildr is the Old Norse–style name of a famous valkyrie in Norse legend; it’s also used today as a character name inspired by that myth.","zh":"Brynhildr 是北欧传说中著名女武神的（较贴近古诺尔斯语的）名字；如今也常作为受该神话启发的角色名使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Norse mythology) A famous valkyrie (warrior maiden) whose story appears in Old Norse legends, especially the Völsunga Saga and poems of the Poetic Edda.","zh":"（北欧神话）著名的女武神（战斗女神/战斗少女）之一，她的故事见于古诺尔斯传说，尤其是《沃尔松格萨迦》和《诗体埃达》。"},"examples":[{"en":"In the saga, Brynhildr is a valkyrie connected to the hero Sigurd.","zh":"在传说中，布伦希尔德（Brynhildr）是一位与英雄西格尔德（Sigurd）有关的女武神。"},{"en":"Many modern fantasy stories borrow characters inspired by Brynhildr.","zh":"许多现代奇幻作品会借用受布伦希尔德（Brynhildr）启发的角色。"}]},{"partOfSpeech":"n.","definition":{"en":"A given name used in modern contexts (literature, games, and popular culture), based on the mythological figure.","zh":"（现代用法）源自神话人物的名字，常见于文学、游戏与流行文化中的人物命名。"},"examples":[{"en":"The novel names its warrior princess Brynhildr to signal a Nordic theme.","zh":"这部小说把女战士公主命名为 Brynhildr，以强调北欧风格。"},{"en":"Brynhildr appears as a character name in some anime and video games.","zh":"Brynhildr 也会作为角色名出现在一些动漫和电子游戏中。"}]}],"synonyms":["Brunhild","Brynhild","Brünnhilde","valkyrie (related)"],"phonetic":"ˈbrɪn.hɪl.dɚ","extraExplanation":["“Brynhildr”是较贴近古诺尔斯语拼写的写法；英语里更常见的变体包括“Brunhild”“Brynhild”。不同作品会因语言与译法而选用不同拼写。","词源常被解释为古诺尔斯语中与“盔甲/战甲（bryn）”和“战斗（hildr）”相关的成分，因此常被理解为带有“披甲而战/战斗之女”的意象。","在德语文化圈中，她与瓦格纳歌剧《尼伯龙根的指环》中的“Brünnhilde（布伦希尔德）”密切相关；这是同一传说传统在不同语言与改编中的重要版本。"]}
{"word":"Brynmawr","summary":{"en":"Brynmawr (more commonly written “Bryn Mawr”) is a proper name, especially referring to Bryn Mawr College and a nearby community in Pennsylvania, USA.","zh":"Brynmawr（更常写作“Bryn Mawr”）是专有名词，常指美国宾夕法尼亚州的布林茅尔学院及其附近同名社区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A proper name used mainly for places and institutions, especially Bryn Mawr College (a women’s liberal arts college near Philadelphia, Pennsylvania) and the community of Bryn Mawr in the same area.","zh":"专有名词，主要指地名或机构名，尤其是美国宾夕法尼亚州费城附近的布林茅尔学院（Bryn Mawr College，女子文理学院）以及同地区的布林茅尔社区（Bryn Mawr）。"},"examples":[{"en":"She studied at Bryn Mawr College and later went to graduate school.","zh":"她在布林茅尔学院读书，后来去读研究生。"},{"en":"The train stops at Bryn Mawr on the way to Philadelphia.","zh":"火车去费城的路上会停靠布林茅尔站。"}]}],"phonetic":"/ˌbrɪn ˈmɑr/","extraExplanation":["“Bryn Mawr”源自威尔士语：bryn（山丘）+ mawr（大的），字面意思是“高/大山丘”。美国的该地名与学院名称都借用了这一威尔士语拼写。","英文书写中常见两种形式：合写“Brynmawr”（较少见）与分写“Bryn Mawr”（更常见，尤其在美国指学院或费城近郊地名时）。"]}
{"word":"Brynn","summary":{"en":"Brynn is a given name, commonly used for girls in the U.S., with Welsh roots often linked to the meaning “hill.”","zh":"Brynn 是一个英文名，在美国常见于女孩名；源自威尔士语，常被解读为“山丘/小山”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (first name), used mostly for girls in the U.S., though it can be gender-neutral","zh":"一个名字（名），在美国多用于女孩名，但也可作中性名"},"examples":[{"en":"Brynn is starting a new job next week.","zh":"Brynn 下周要开始一份新工作。"},{"en":"I met Brynn in my English class.","zh":"我在英语课上认识了 Brynn。"}]},{"partOfSpeech":"n.","definition":{"en":"a name of Welsh origin, often explained as meaning “hill” (from Welsh)","zh":"一个源自威尔士语的名字，常被解释为“山丘/小山”（来自威尔士语）"},"examples":[{"en":"Her parents chose the name Brynn because they liked its Welsh meaning.","zh":"她的父母选了 Brynn 这个名字，因为他们喜欢它的威尔士语含义。"}]}],"synonyms":["Bryn","Brin","Brynne"],"phonetic":"/brɪn/","extraExplanation":["“Brynn”在英语世界里常被看作现代感较强、简洁的名字；也常见拼写变体如“Bryn”（在威尔士语里更常见）。","发音上，Brynn 的元音是短音 /ɪ/（像“sit”里的 i），末尾是 /n/，整体读作一拍“brin”。"]}
{"word":"Brynna","summary":{"en":"Brynna is a feminine first name, common in North America and often associated with a Welsh/Celtic feel.","zh":"Brynna 是一个女性英文名，在北美较常见，常给人威尔士／凯尔特风格的感觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feminine given name (first name), used especially in North America; often chosen for its Celtic/Welsh-sounding style","zh":"女性名字（名），在北美较常见；常因其带有凯尔特／威尔士风格的音感而被选用"},"examples":[{"en":"Brynna is starting a new job next Monday.","zh":"Brynna 下周一要开始新工作。"},{"en":"Please welcome our speaker, Brynna Lee.","zh":"请欢迎我们的演讲者 Brynna Lee。"},{"en":"How do you spell Brynna?","zh":"Brynna 怎么拼写？"}]}],"synonyms":["Brenna","Brianna","Brynn"],"phonetic":"/ˈbrɪnə/","extraExplanation":["Brynna 通常被认为与威尔士语元素有关：bryn 在威尔士语里有“山丘”的意思，因此有些人会把 Brynna 理解为带有“山丘、山地气息”的名字。不过在现代英语世界里，它更多是作为一个好听、现代感的名字使用，具体含义往往因家庭取名动机而异。","常见昵称（非固定）：Bryn、Bry、Bree、Anna（取决于本人偏好）。"]}
{"word":"Brynne","summary":{"en":"Brynne is a female first name, commonly seen as a variant of Bryn/Brynn.","zh":"Brynne 是女性名字，常被视为 Bryn/Brynn 的变体拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feminine given name (first name), often used in English-speaking countries.","zh":"女性名字（常见于英语国家的名/名字）。"},"examples":[{"en":"Brynne is starting a new job next Monday.","zh":"Brynne 下周一开始一份新工作。"},{"en":"I met Brynne at a coffee shop in Seattle.","zh":"我在西雅图的一家咖啡店认识了 Brynne。"}]}],"synonyms":["Bryn","Brynn","Brin (similar sound)"],"phonetic":"/ˈbrɪn/","extraExplanation":["“Brynne”常被视为“Bryn/Brynn”的变体拼写，带有更明显的女性化/名字感。","“Bryn”源自威尔士语，原意与“hill（山丘）”相关；因此有时人们会把 Brynne 联想到“山丘、自然”的意象。","作为专有名词（人名），它通常不翻译意义，中文多采用音译，例如“布琳/布林”等；具体译法常按个人偏好或护照/官方拼写来定。"]}
{"word":"Brynza","summary":{"en":"Brynza is a salty white brined cheese, traditionally made from sheep’s milk, popular in Eastern and Central Europe.","zh":"Brynza（布林扎奶酪）是一种咸味白色盐水腌制奶酪，传统上以羊奶制成，流行于东欧和中欧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a salty, white brined cheese made from sheep’s milk (sometimes mixed with cow’s milk), common in Eastern and Central Europe","zh":"一种咸味白色盐水腌制奶酪，主要用羊奶制成（有时混合牛奶），常见于东欧和中欧地区"},"examples":[{"en":"We bought brynza at the market and ate it with tomatoes and bread.","zh":"我们在集市买了布林扎奶酪，配番茄和面包一起吃。"},{"en":"The soup was topped with crumbled brynza for a salty finish.","zh":"这道汤上面撒了碎布林扎奶酪，咸香收尾。"}]}],"synonyms":["brined cheese","sheep’s-milk cheese","feta (similar, not identical)"],"phonetic":"/ˈbrɪnzə/","extraExplanation":["“Brynza”常见于斯洛伐克、乌克兰、波兰、罗马尼亚等地的饮食语境；在英语里多作为外来词使用，通常指一种带明显咸味、易捏碎的盐水奶酪。","在菜单或食谱中，你也可能看到拼写变体（如 bryndza）；不同地区的拼写和发音会略有差异，但在英语语境里通常都指同类传统奶酪。"]}
{"word":"brynza","summary":{"en":"Brynza is a salty brined cheese from Eastern Europe, often made from sheep’s milk.","zh":"Brynza（布林扎）是东欧常见的咸味盐渍奶酪，通常以羊奶制成。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brined cheese (often made from sheep’s milk, sometimes cow or goat) common in Eastern Europe, especially the Carpathian region; it is salty and crumbly, somewhat similar to feta.","zh":"一种盐渍奶酪（多用羊奶制成，也可能用牛奶或山羊奶），常见于东欧，尤其是喀尔巴阡山区；口感偏咸、易碎，和菲达奶酪有些相似。"},"examples":[{"en":"We bought brynza at the market and ate it with tomatoes and bread.","zh":"我们在集市买了布林扎奶酪，配番茄和面包一起吃。"},{"en":"The soup is topped with crumbled brynza for a salty finish.","zh":"这道汤上面撒了碎布林扎奶酪，收尾带一点咸香。"},{"en":"If you can’t find brynza, feta is a common substitute in recipes.","zh":"如果买不到布林扎奶酪，食谱里常用菲达奶酪来替代。"}]}],"synonyms":["brined cheese","sheep’s milk cheese","feta (similar, not identical)"],"phonetic":"/ˈbrɪnzə/","extraExplanation":["“brynza”是从斯拉夫语系（如乌克兰语/斯洛伐克语/波兰语等）进入英语的外来词，指喀尔巴阡及周边地区传统的盐渍奶酪。","它通常比很多“feta”更咸、更有乳酸发酵的风味；常用于沙拉、土豆、饺子/面食馅料或撒在汤和粥上。"]}
{"word":"bryogenin","summary":{"en":"Bryogenin is a rare technical noun referring to a plant-derived chemical compound, mainly used in specialized scientific writing.","zh":"Bryogenin 是一个少见的技术性名词，通常指植物来源的某种化学化合物，主要出现在专业科学文献中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare scientific term for a plant-derived chemical compound (reported in some sources as a type of sapogenin/aglycone found in certain plants, especially in botanical or pharmacological contexts).","zh":"一个较少见的科学术语，指植物来源的化学化合物（有资料将其描述为某些植物中的皂苷元/配基类物质，常见于植物学或药理学语境）。"},"examples":[{"en":"The paper mentions bryogenin as one of the compounds isolated from the plant extract.","zh":"论文提到 bryogenin 是从该植物提取物中分离出的化合物之一。"},{"en":"Bryogenin is not a common word outside specialized chemistry or botany texts.","zh":"除专业化学或植物学文献外，bryogenin 这个词并不常见。"}]}],"phonetic":"/braɪˈɑːdʒənɪn/","extraExplanation":["这是一个非常冷门的术语，不同资料对其具体化学指认可能不完全一致；如果你是在某篇论文、药典或数据库里看到它，建议同时提供上下文（来源植物名、CAS/结构式、同义名），这样更容易确认它到底指哪一种具体化合物。","词形上常见的 -genin 往往用于表示“苷（glycoside）的非糖部分/配基（aglycone）”，例如某些皂苷元名称会以 -genin 结尾。"]}
{"word":"bryologic","summary":{"en":"Brought to moss science: “bryologic” means related to bryology, the study of mosses and other bryophytes.","zh":"“bryologic”指“与苔藓学有关的”，即研究苔藓及其他苔藓植物（苔藓类植物）的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to bryology (the scientific study of mosses and other bryophytes).","zh":"与苔藓学有关的；研究苔藓及其他苔藓植物（苔藓类植物）的。"},"examples":[{"en":"She wrote a bryologic report on moss diversity in a local forest.","zh":"她写了一份关于本地森林苔藓多样性的苔藓学报告。"},{"en":"The museum has a small bryologic collection of preserved moss specimens.","zh":"这家博物馆有一小批保存完好的苔藓标本苔藓学收藏。"}]}],"synonyms":["bryological","moss-related"],"phonetic":"/ˌbraɪəˈlɑːdʒɪk/","extraExplanation":["“bryo-”来自希腊语，常指“苔藓/苔藓植物”。“bryology”是“苔藓学”，而“bryologic”就是“苔藓学的/与苔藓学有关的”。","日常英语里更常见的是“bryological”（同义），用于学术写作、标本馆藏、生态调查等语境。","“bryophytes（苔藓植物）”一般包括mosses（藓类）、liverworts（苔类）和hornworts（角苔类）；如果你看到“bryologic study”，通常是在研究这些小型无维管植物的分类、生态或分布。"]}
{"word":"bryological","summary":{"en":"“Bryological” means related to bryology—the study of mosses and other bryophytes.","zh":"“bryological”指与苔藓学有关，即研究苔藓及其他苔藓植物的学科。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to bryology (the scientific study of mosses and other bryophytes).","zh":"与苔藓学有关的；与研究苔藓类植物（苔藓植物）有关的。"},"examples":[{"en":"She wrote a bryological survey of the local mountains, focusing on moss diversity.","zh":"她写了一份当地山地的苔藓学调查报告，重点研究苔藓的多样性。"},{"en":"The museum has a small bryological collection, including preserved moss specimens.","zh":"这家博物馆有一小批苔藓学藏品，包括保存下来的苔藓标本。"}]}],"synonyms":["bryologic","moss-related","bryophyte-related"],"phonetic":"ˌbraɪəˈlɑːdʒɪkəl","extraExplanation":["“bryological”来自“bryology（苔藓学）”。苔藓学通常研究“苔藓植物（bryophytes）”，主要包括苔藓（mosses）、地钱/苔类（liverworts）和角苔（hornworts）。在学术写作中更常见的搭配是：bryological study/survey/collection。"]}
{"word":"bryologies","summary":{"en":"Bryology is the branch of botany that studies mosses and other bryophytes.","zh":"Bryology（苔藓学）是植物学中研究藓类及其他苔藓植物的分支。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the scientific study of bryophytes—small, non-vascular plants such as mosses, liverworts, and hornworts","zh":"苔藓学；研究苔藓植物（如藓类、苔类、角苔类等小型非维管植物）的学科"},"examples":[{"en":"She took a university course in bryology and learned how to identify different moss species.","zh":"她在大学选修了苔藓学课程，学习如何鉴定不同的藓类物种。"},{"en":"Bryology is important for understanding forest ecosystems because mosses help hold moisture.","zh":"苔藓学对理解森林生态系统很重要，因为藓类有助于保持水分。"}]}],"synonyms":["botany (broader)","bryophyte study"],"phonetic":"/braɪˈɑlədʒi/","extraExplanation":["“bryologies” 是 “bryology” 的复数形式，通常用于谈论不同的研究传统、学派或不同主题方向的苔藓学研究（例如：不同地区的 bryologies）。","词根小提示：bryo- 来自希腊语，和“苔藓/藓类植物”有关；-logy 表示“学科、研究”。"]}
{"word":"bryologist","summary":{"en":"A bryologist is a scientist who studies mosses and related plants (bryophytes).","zh":"bryologist 指研究苔藓及其相关植物（苔藓植物）的科学家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A scientist who studies bryology—the study of mosses, liverworts, and hornworts (small non‑vascular plants).","zh":"苔藓植物学家；研究苔藓学（苔藓、地钱、角苔等非维管植物）的科学家。"},"examples":[{"en":"The bryologist identified several rare moss species in the wetland.","zh":"这位苔藓植物学家在湿地里鉴定出了几种稀有的苔藓。"},{"en":"As a bryologist, she spends a lot of time examining tiny plants under a microscope.","zh":"作为苔藓植物学家，她常常在显微镜下观察这些微小的植物。"}]}],"synonyms":["bryology researcher","moss specialist","botanist (specializing in bryophytes)"],"phonetic":"/braɪˈɑːlədʒɪst/","extraExplanation":["词根提示：bryo- 来自希腊语，和“苔藓/苔藓类植物”有关；-logist 表示“研究者/专家”。因此 bryologist 字面意思就是“研究苔藓的人”。","学科范围：bryology 主要研究苔藓、地钱（liverworts）和角苔（hornworts）；这些植物通常体型很小，常见于潮湿环境，对生态指标与环境监测也很重要。"]}
{"word":"bryologists","summary":{"en":"Bryologists are scientists who study mosses and related small plants (bryophytes).","zh":"Bryologists 指研究藓类及相关苔藓植物（苔藓植物门）的科学家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Scientists who study bryophytes (non‑vascular plants such as mosses, liverworts, and hornworts).","zh":"研究苔藓植物（如藓类、苔类与角苔类等无维管植物）的科学家。"},"examples":[{"en":"Bryologists often survey mosses to assess ecosystem health.","zh":"苔藓学家常调查藓类植物，用来评估生态系统的健康状况。"},{"en":"The museum invited bryologists to identify rare liverworts found on the mountain.","zh":"博物馆邀请苔藓学家鉴定在山上发现的稀有苔类植物。"}]}],"synonyms":["bryology researchers","moss scientists","botanists (specialists in bryophytes)"],"phonetic":"/braɪˈɑlədʒɪsts/","extraExplanation":["“bryologists”是“bryologist”的复数形式；学科名叫“bryology”（苔藓学）。","词根“bryo-”来自希腊语，意为“苔藓/芽”；因此与moss（藓类）等概念有关。","在生态研究中，苔藓植物对湿度与空气质量很敏感，所以苔藓学家有时会参与环境监测与保护工作。"]}
{"word":"bryology","summary":{"en":"Bryology is the study of mosses and their close relatives (liverworts and hornworts).","zh":"bryology 指“苔藓植物学”，研究藓类及其近缘的苔类、角苔类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The scientific study of bryophytes (non-vascular plants such as mosses, liverworts, and hornworts).","zh":"苔藓植物学：研究苔藓植物（无维管植物，如藓类、苔类和角苔类）的科学。"},"examples":[{"en":"She became interested in bryology after learning how mosses help retain moisture in forests.","zh":"她在了解藓类如何帮助森林保持水分后，对苔藓植物学产生了兴趣。"},{"en":"Bryology is important for studying ecosystems because bryophytes can indicate air and water quality.","zh":"苔藓植物学对研究生态系统很重要，因为苔藓植物能指示空气和水质状况。"}]}],"synonyms":["study of bryophytes","bryophyte science"],"phonetic":"/braɪˈɑlədʒi/","extraExplanation":["词源：bryology 来自希腊语 bryon（“苔藓”）+ -logy（“……学/学科”）。","学科范围：苔藓植物（bryophytes）不同于蕨类或种子植物，它们没有真正的木质部/韧皮部（维管组织），通常体型小、依赖潮湿环境繁殖。","相关词：bryologist（苔藓植物学家）；bryophyte（苔藓植物）。","文化与自然观察：在温带地区，苔藓常见于林地、石头与树干表面；很多自然写作者会用苔藓描写“静谧、潮湿、阴凉”的森林氛围。"]}
{"word":"Bryon","summary":{"en":"Bryon is a personal name, usually a less common spelling of Byron.","zh":"Bryon是人名，通常是Byron的较少见拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (male), a less common spelling of “Byron.”","zh":"男子名，“Byron”的较少见拼写。"},"examples":[{"en":"Bryon moved to Chicago for a new job.","zh":"Bryon为了新工作搬到了芝加哥。"},{"en":"Is your name spelled Bryon or Byron?","zh":"你的名字拼作Bryon还是Byron？"}]},{"partOfSpeech":"n.","definition":{"en":"a surname; sometimes a variant of “Byron.”","zh":"姓氏；有时是“Byron”的变体拼写。"},"examples":[{"en":"Ms. Bryon will lead today’s meeting.","zh":"Bryon女士将主持今天的会议。"}]}],"synonyms":["Byron"],"phonetic":"/ˈbaɪrən/","extraExplanation":["“Bryon”在英语里通常被当作“Byron”的变体或拼写差异；更常见的拼法是“Byron”。","如果你指的是著名诗人Lord Byron（拜伦），标准拼写是“Byron”，常见于文学与历史语境。"]}
{"word":"bryon","summary":{"en":"“Bryon” is usually a variant or misspelling of “Byron,” which is a personal name/surname and can also refer to the poet Lord Byron or place names.","zh":"“Bryon”通常是“Byron”的变体拼写或常见误拼；“Byron”可作人名/姓氏，也可指诗人拜伦或一些地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a personal name or surname (usually spelled “Byron”); “Bryon” is a less common variant spelling","zh":"人名或姓氏（更常见的拼写是“Byron”），“Bryon”是较少见的变体拼写"},"examples":[{"en":"His name is Byron, but some people misspell it as Bryon.","zh":"他叫Byron，但有些人会把它拼错成Bryon。"},{"en":"Byron is used as both a first name and a family name.","zh":"Byron既可作名也可作姓。"}]},{"partOfSpeech":"n.","definition":{"en":"Lord Byron (George Gordon Byron), a famous British Romantic poet (1788–1824)","zh":"拜伦勋爵（乔治·戈登·拜伦，1788–1824），著名英国浪漫主义诗人"},"examples":[{"en":"We read a poem by Lord Byron in class.","zh":"我们在课堂上读了一首拜伦的诗。"},{"en":"Lord Byron wrote “She Walks in Beauty.”","zh":"拜伦写过《她走在美丽中》。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name in several English-speaking countries (often spelled “Byron,” e.g., Byron Bay)","zh":"若干英语国家的地名（常拼作“Byron”，如Byron Bay）"},"examples":[{"en":"They traveled to Byron Bay during the summer.","zh":"他们夏天去拜伦湾旅行。"}]}],"synonyms":["Byron"],"phonetic":"/ˈbaɪrən/","extraExplanation":["“bryon”在英语里更常见的情况是把“Byron”拼错了。最常见的读音是/ˈbaɪrən/（像“BY-rən”）。","如果你指的是诗人“Lord Byron”，中文通常译作“拜伦”。如果你指的是人名“Bryon/Byron”，在正式文件里最好确认对方的实际拼写。"]}
{"word":"Bryonia","summary":{"en":"Bryonia is a genus of climbing gourd-family plants (often called bryony), and it can also refer to a homeopathic remedy made from these plants.","zh":"Bryonia 指葫芦科的一类攀缘植物属（常见普通名为 bryony），也可指用其制成的顺势疗法制剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a climbing plant (genus Bryonia) in the gourd family, known for its tendrils and often poisonous berries and roots; in English, it commonly refers to “bryony” such as white bryony","zh":"葫芦科的攀缘植物属名（Bryonia，常译作“葫芦藤属/泻根属”，常见对应词为 bryony，如“白葫芦藤”）；以卷须攀爬、浆果与根部多具毒性而闻名"},"examples":[{"en":"Bryonia is a climbing vine with tendrils, often found growing along hedges.","zh":"Bryonia 是一种带卷须的攀缘藤本，常沿着树篱生长。"},{"en":"Some Bryonia species have berries that look tempting but are poisonous.","zh":"有些 Bryonia 物种的浆果看起来诱人，但其实有毒。"}]},{"partOfSpeech":"n.","definition":{"en":"a homeopathic remedy made from Bryonia (especially Bryonia alba), used in alternative medicine contexts","zh":"由 Bryonia（尤其 Bryonia alba）制成的顺势疗法“药剂”，常见于替代医学语境"},"examples":[{"en":"The label says the homeopathic product contains Bryonia alba.","zh":"标签上写着这款顺势疗法产品含有 Bryonia alba（白葫芦藤）。"},{"en":"She asked about Bryonia, but her doctor recommended evidence-based treatment instead.","zh":"她询问了 Bryonia，但医生建议优先采用循证治疗。"}]}],"synonyms":["bryony","wild vine (context-dependent)"],"phonetic":"/braɪˈoʊniə/","extraExplanation":["词形与拼写：Bryonia 是拉丁学名（属名），在日常英语里更常见的普通名是 bryony（英式拼写常见）。学术写作中属名通常首字母大写并斜体（Bryonia）。","安全提示：许多 Bryonia 物种的根和浆果可能有毒；野外识别不确定时不要采食或让儿童接触。","文化语境：在一些地区的传统草药与顺势疗法中会提到 Bryonia alba；但“顺势疗法”产品的效果与科学证据常存在争议，阅读标签与咨询专业人士很重要。"]}
{"word":"bryonia","summary":{"en":"Bryonia is a climbing vine (a type of bryony) whose root was used in traditional medicine but can be poisonous.","zh":"Bryonia 指一种攀缘藤本（葫芦属/葫芦藤类），其根曾用于传统药用，但可能有毒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a climbing vine in the gourd family (genus *Bryonia*), especially *Bryonia alba* or *Bryonia dioica*; its root has been used in traditional medicine but the plant can be poisonous","zh":"葫芦科的攀缘藤本植物（葫芦属 *Bryonia*），常指白葫芦属藤或红葫芦属藤；其根曾用于传统药用，但植株有毒"},"examples":[{"en":"In the hedgerow, bryonia climbed over the fence with curling tendrils.","zh":"在树篱旁，bryonia 用卷曲的卷须攀上了篱笆。"},{"en":"The herbal text warns that bryonia root should not be taken without expert guidance.","zh":"这本草药书警告：未经专业人士指导不要服用 b y o n i a 的根。"}]}],"synonyms":["bryony","wild bryony","white bryony","red bryony"],"phonetic":"/braɪˈoʊniə/","extraExplanation":["“Bryonia”常见于欧洲植物与草药传统中，英语里也常用更普遍的名称“bryony”来指同类植物。","历史上其根部曾被用于“泻下、祛痰”等民间用途，但现代资料通常强调其可能有毒性与副作用；阅读草药相关内容时要注意这是植物学/历史语境，并不等于安全可用。"]}
{"word":"bryonidin","summary":{"en":"Brimonidine is a medication used mostly as eye drops to lower eye pressure, and sometimes on the skin to reduce rosacea-related redness.","zh":"布里莫尼定是一种药物，主要用于滴眼降眼压；有时也用于皮肤以减轻酒糟鼻相关的潮红。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medicine (an alpha-2 adrenergic agonist) used mainly as eye drops to lower pressure in the eye (for glaucoma/ocular hypertension), and sometimes as a gel/cream to reduce facial redness in rosacea","zh":"一种药物（α2-肾上腺素能受体激动剂），主要以滴眼液形式用于降低眼内压（治疗青光眼/眼压升高），有时也以凝胶/乳膏形式用于减轻酒糟鼻引起的面部潮红"},"examples":[{"en":"The doctor prescribed brimonidine eye drops to help lower her eye pressure.","zh":"医生开了布里莫尼定滴眼液，帮助降低她的眼压。"},{"en":"If brimonidine makes your eyes sting or feel dry, tell your pharmacist.","zh":"如果布里莫尼定让你眼睛刺痛或干涩，告诉你的药剂师。"},{"en":"Some people use brimonidine gel to reduce facial redness from rosacea.","zh":"有些人会用布里莫尼定凝胶来减轻酒糟鼻导致的面部发红。"}]}],"synonyms":["Alphagan","Mirvaso"],"phonetic":"/braɪˈmɑːnɪdiːn/","extraExplanation":["“bryonidin”很可能是拼写误差；常见的医学词是 **brimonidine**（布里莫尼定）。如果你指的是植物色素/化学名（例如某些 *-idin* 结尾的花青素相关词），可以把上下文或来源（药品说明书/论文/图片）发我，我再帮你确认。"]}
{"word":"bryonies","summary":{"en":"“Bryonies” means more than one bryony—climbing vines of the genus Bryonia, often mentioned in nature writing and sometimes considered poisonous.","zh":"“bryonies”是 bryony 的复数，指多株葫芦属（Bryonia）的攀缘藤本植物，常见于自然/文学描写，部分种类有毒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of bryony: a climbing vine (genus Bryonia) with tendrils and berries; some types have roots used in traditional medicine but can be poisonous.","zh":"bryony 的复数：一种攀缘藤本植物（葫芦科/葫芦属 Bryonia），有卷须和浆果；部分种类的根曾用于传统药用，但可能有毒。"},"examples":[{"en":"Bryonies climb over hedges and fences in late spring and summer.","zh":"bryonies 在晚春到夏季会攀爬在树篱和篱笆上。"},{"en":"The hikers were warned not to eat the berries from wild bryonies.","zh":"徒步者被提醒不要吃野生 bryonies 的浆果。"}]}],"synonyms":["bryony (plural)","wild vine","climbing vine"],"phonetic":"/ˈbraɪəni/","extraExplanation":["“bryony”多见于英式英语与文学描写，常用来营造“篱笆、林缘、乡野花园”的意象。","民俗与历史上，欧洲一些地区把 bryony 的粗大根误当作曼德拉草（mandrake）来售卖或用于巫术传说，因此它也带有一点“神秘/民间药草”的文化色彩。","注意：不同语言和地区对“bryony”所指植物可能略有差异；在自然观察或园艺语境里，最好结合图片或学名 Bryonia 来确认。"]}
{"word":"bryonin","summary":{"en":"Bryonin is a bitter substance from bryony plants, seen mostly in older herbal or scientific texts.","zh":"Bryonin 指泻根（bryony）植物中的一种苦味成分，主要见于早期草药学或植物化学资料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bitter chemical substance (a glycoside/resin) found in bryony plants, traditionally used in older herbal medicine but potentially harmful","zh":"（药用植物）泻根属/葫芦科“bryony（泻根、野葫芦）”中含有的一种苦味化学成分（常指糖苷/树脂类物质）；旧时草药中用过，但可能有毒、有刺激性"},"examples":[{"en":"Older herbals mentioned bryonin as a very bitter compound extracted from bryony roots.","zh":"早期的草药书会提到 bryonin，是从泻根（bryony）的根部提取的强烈苦味成分。"},{"en":"Because it can be irritating and unsafe, bryonin is not used in modern self-care remedies.","zh":"由于可能刺激且不安全，bryonin 并不用于现代的家庭自我用药。"}]}],"synonyms":["bryony resin (context-dependent)","bryony extract (general)"],"phonetic":"/ˈbraɪənɪn/","extraExplanation":["bryonin 属于比较少见的旧式药理/植物化学词汇，更多出现在早期草药学、药典或植物化学资料中，而不是日常英语。","bryony（常见译名：泻根、野葫芦）在欧洲民间药用史上曾被用作泻药/催吐等，但该类植物可能有毒性；阅读到相关词时，通常带有“历史上的用法”或“研究语境”的意味。","拼写上常见相关词有 bryony（植物名）与 bryonine/bryonin（其成分名称，资料中偶有拼写差异）。"]}
{"word":"bryonine","summary":{"en":"Bryonine is a bitter plant compound found in bryony, mainly discussed in botanical or medicinal contexts.","zh":"Bryonine 指葫芦藤（bryony）中的一种苦味植物成分，主要用于植物化学或药用相关语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bitter chemical compound (a plant glycoside) found in bryony plants, traditionally noted for strong medicinal effects but also potential toxicity","zh":"一种极苦的植物化合物（配糖体），存在于葫芦科“葫芦藤/泻根”（bryony）等植物中；传统上曾被用于药用，但可能有毒性"},"examples":[{"en":"Researchers identified bryonine as one of the bitter compounds in bryony.","zh":"研究人员确认 bryonine 是葫芦藤（bryony）中的一种苦味成分。"},{"en":"Historical herbals sometimes mentioned bryonine when describing the strong action of bryony root.","zh":"一些历史草药书在描述葫芦藤根的强烈药效时会提到 bryonine。"}]}],"synonyms":["bryonin","bitter principle (in bryony)"],"phonetic":"/ˈbraɪənaɪn/","extraExplanation":["词源提示：bryonine 来自植物名 bryony（学名 Bryonia 属）+ 化学后缀 -ine（常用于命名生物碱或植物提取物中的成分）。","学习提醒：这是较少见的专业词，多出现在植物化学、药理或历史草药学语境中；日常英语里更常见的是 bryony（植物本身）。"]}
{"word":"bryony","summary":{"en":"Bryony is a climbing vine known for its berries; it can also refer to a traditional herbal medicine made from its root.","zh":"Bryony 指一种会攀爬的藤本植物，以浆果著名；也可指用其根制作的传统草药。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a climbing vine (especially in Europe) with small flowers and red or black berries; some types are poisonous","zh":"（多见于欧洲的）一种攀援藤本植物，开小花，结红色或黑色浆果；某些品种有毒"},"examples":[{"en":"Bryony climbed up the old stone wall beside the garden.","zh":"葫芦藤沿着花园旁的旧石墙往上爬。"},{"en":"Be careful—some bryony berries can be poisonous if eaten.","zh":"要小心——有些葫芦藤的浆果吃了可能有毒。"}]},{"partOfSpeech":"n.","definition":{"en":"a medicine made from the root of bryony, used historically in herbal remedies","zh":"（历史上）用葫芦藤根制作的草药/药剂，用于民间疗法"},"examples":[{"en":"In older herbal books, bryony was sometimes listed as a traditional remedy.","zh":"在较早的草药书中，葫芦藤有时被列为传统疗法用药。"}]}],"synonyms":["bryonia","wild vine"],"phonetic":"/ˈbraɪəni/","extraExplanation":["“bryony”在英式语境里更常指欧洲的Bryonia属植物（如white bryony、black bryony）。注意：black bryony有时并不属于Bryonia属，但日常名称仍会这样叫，容易混淆。","在欧洲民俗与旧草药传统中，bryony根曾被用作药材，但现代观点强调其毒性风险，不应自行采食或入药。"]}
{"word":"bryophilous","summary":{"en":"Bryophilous means “moss-loving,” describing organisms that prefer mossy habitats.","zh":"bryophilous 表示“嗜苔藓的/喜生于苔藓环境的”，常用于学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a plant, fungus, or animal) preferring to live among mosses or in moss-rich habitats; moss-loving.","zh":"（指植物、真菌或动物）喜生于苔藓之间或苔藓丰富的环境；嗜苔藓的。"},"examples":[{"en":"Some bryophilous insects spend most of their lives hidden in damp moss.","zh":"有些嗜苔藓的昆虫一生大多时间都藏在潮湿的苔藓里。"},{"en":"The researcher recorded several bryophilous fungi on fallen logs covered with moss.","zh":"研究者在长满苔藓的倒木上记录到几种嗜苔藓的真菌。"}]}],"synonyms":["moss-loving","moss-associated","bryophyte-associated"],"phonetic":"/braɪˈɑːfələs/","extraExplanation":["词源：bryo- 来自希腊语 bryon（苔藓），-philous 表示“喜爱……的/偏好……的”（如 hydrophilous 嗜水的）。因此 bryophilous 字面意思就是“喜爱苔藓的”。","使用场景：多见于生态学、真菌学、昆虫学等学术写作，用来描述与苔藓微环境（阴湿、保水、遮光）关系密切的物种。日常英语中很少用。"]}
{"word":"Bryophyllum","summary":{"en":"Bryophyllum is a type of succulent plant, famous for making tiny plantlets on its leaves.","zh":"Bryophyllum 指一种多肉植物，以叶片上会长出小植株而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of succulent plants (often treated as part of the genus *Kalanchoe*) known for producing small plantlets along the edges of their leaves.","zh":"一种多肉植物属（常被归入伽蓝菜属 *Kalanchoe*），以叶缘会长出小植株（芽苗）而著名。"},"examples":[{"en":"Bryophyllum can grow new baby plants along the leaf margins.","zh":"Bryophyllum 的叶缘可以长出新的小苗。"},{"en":"Some people keep bryophyllum as a hardy houseplant because it needs little water.","zh":"有些人把 bryophyllum 当作耐养的室内植物，因为它不太需要浇水。"},{"en":"In some books, bryophyllum is listed under the name *Kalanchoe*.","zh":"在一些书里，bryophyllum 会以 *Kalanchoe*（伽蓝菜属）的名字出现。"}]}],"synonyms":["Kalanchoe","mother of thousands","life plant"],"phonetic":"/ˌbraɪoʊˈfɪləm/","extraExplanation":["词源：来自希腊语 *bryon*（“苔藓”）+ *phyllon*（“叶子”），指这种植物常在叶片边缘长出像“苔藓般”密集的小苗。","常见相关种：*Bryophyllum pinnatum*（常见英文名“life plant / miracle leaf”等），在一些民间传统中会被用于草药用途；但药用相关说法因地区与研究而异，如要内服应先咨询专业人士。"]}
{"word":"bryophyllum","summary":{"en":"Bryophyllum is a succulent plant group known for thick leaves and easy reproduction from leaf edges.","zh":"Bryophyllum 指一类多肉植物，以叶片肥厚、叶缘易长小芽繁殖而著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group (genus) of succulent plants in the stonecrop family, known for thick leaves and for easily producing new plantlets from the leaf edges (often grown as houseplants).","zh":"一种多肉植物类群（属名），属于景天科，以叶片肥厚、叶缘容易长出小植株（小芽）而闻名，常作室内观赏植物。"},"examples":[{"en":"Bryophyllum can grow tiny plantlets along the edges of its leaves.","zh":"Bryophyllum 的叶缘会长出小植株。"},{"en":"Some people keep bryophyllum as an easy-to-care-for houseplant.","zh":"有些人把 bryophyllum 当作好养的室内盆栽。"}]}],"synonyms":["kalanchoe","mother of thousands (common name)","leaf of life (common name)"],"phonetic":"/ˌbraɪəˈfɪləm/","extraExplanation":["Bryophyllum 常见中文名会被称作“落地生根”等（不同地区叫法不一）。它之所以容易繁殖，是因为叶片边缘能产生小芽，掉到土里就能生根。","在现代分类上，Bryophyllum 常被并入 Kalanchoe（伽蓝菜属）的一部分；园艺和日常用法中仍常见 bryophyllum 这个名字。","一些民间传统会把它用于外敷或草药用途，但不同种类可能含有对人或宠物不友好的成分；若涉及食用或药用，应谨慎并咨询专业人士。"]}
{"word":"Bryophyta","summary":{"en":"Bryophyta is a traditional scientific name for bryophytes—especially mosses—small non-vascular plants that often grow in damp places.","zh":"Bryophyta 是苔藓植物的传统学名用法，常特指苔藓类；它们是常见于潮湿环境的小型无维管植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional plant group name for bryophytes (non-vascular land plants), especially mosses; in older or some textbook usage, it may include mosses, liverworts, and hornworts.","zh":"“苔藓植物门/苔藓门”的传统名称（常指苔藓类等无维管束的陆生植物）；在较旧或部分教材用法中，可能包括苔类、地钱类和角苔类。"},"examples":[{"en":"In some older biology textbooks, Bryophyta is used to refer to mosses and related plants.","zh":"在一些较旧的生物教材里，Bryophyta 用来指苔藓及其相关植物。"},{"en":"Because Bryophyta plants lack vascular tissue, they usually stay small and grow in moist places.","zh":"由于 Bryophyta 植物没有维管组织，它们通常体型较小，并生长在潮湿环境中。"}]}],"synonyms":["bryophytes","mosses"],"phonetic":"/braɪˈɑːfɪtə/","extraExplanation":["在现代分类中，“Bryophyta”常被更精确地使用为“苔藓门（mosses）”；而“bryophytes（苔藓植物）”作为更宽泛的统称，通常包括苔藓（mosses）、地钱（liverworts）和角苔（hornworts）。不同教材与数据库可能采用不同体系，因此遇到时最好查看其具体定义范围。","学习记忆点：bryo- 来自希腊语，意为“苔藓”；-phyta 表示“植物”。看到 Bryophyta 往往可以联想到“苔藓类植物”。"]}
{"word":"bryophyta","summary":{"en":"Bryophyta is the plant division that includes mosses and other small, non-vascular, spore-producing land plants.","zh":"Bryophyta 指苔藓植物门：包括苔藓等小型、非维管束、以孢子繁殖的陆生植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group (division) of small, non-vascular land plants that reproduce by spores, including mosses, liverworts, and hornworts","zh":"苔藓植物门：一类小型的非维管束陆生植物，以孢子繁殖，包括苔藓、地钱（苔类/肝苔）和角苔"},"examples":[{"en":"Mosses are members of Bryophyta and often grow well in moist, shaded areas.","zh":"苔藓属于苔藓植物门，常在潮湿、阴凉的地方生长得很好。"},{"en":"In Bryophyta, the plant you usually see is the gametophyte stage.","zh":"在苔藓植物门中，我们通常看到的“植物体”多是配子体阶段。"},{"en":"Because Bryophyta lack true vascular tissues, they stay relatively small.","zh":"由于苔藓植物门缺乏真正的维管组织，它们通常长得比较矮小。"}]}],"synonyms":["bryophytes","mosses (in common speech)"],"phonetic":"/braɪˈɑːfəˌtɑː/","extraExplanation":["“Bryophyta”常见于生物学/植物学教材与论文中，属于较正式的分类学术语；日常英语里更常直接说 mosses（苔藓）或 bryophytes（苔藓植物，泛称）。","词源：bryo- 来自希腊语，和“苔藓”相关；-phyta 表示“植物”。读写时注意它是分类名称，通常首字母大写（Bryophyta）。","学习提示：在现代分类中，不同教材可能把苔藓、肝苔、角苔分成不同的“门”；因此你也可能看到更宽泛的 bryophytes（苔藓植物）作为总称。"]}
{"word":"bryophyte","summary":{"en":"A bryophyte is a small non-vascular plant (like moss) that usually lives in moist places and reproduces by spores.","zh":"bryophyte 指苔藓植物（如苔藓等非维管植物），多生于潮湿环境，以孢子繁殖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of small, non-vascular plant (it has no true roots, stems, or leaves, and no tubes to carry water), such as mosses and liverworts. Bryophytes usually grow in damp, shady places and reproduce by spores (not seeds).","zh":"苔藓植物（非维管植物）的一类：没有真正的根、茎、叶，也没有输导组织（运水、养分的管道），常见代表有苔藓和地钱等。多生长在潮湿阴凉处，以孢子（不是种子）繁殖。"},"examples":[{"en":"Moss is a common bryophyte that grows on rocks and tree trunks.","zh":"苔藓是一种常见的苔藓植物，常长在岩石和树干上。"},{"en":"Because bryophytes lack vascular tissue, they depend on moisture to survive.","zh":"因为苔藓植物没有输导组织，它们很依赖潮湿环境才能生存。"},{"en":"In biology class, we compared bryophytes with ferns and flowering plants.","zh":"在生物课上，我们把苔藓植物与蕨类和开花植物作比较。"}]}],"synonyms":["moss (informal/general)","non-vascular plant (broader category)"],"phonetic":"/ˈbraɪəˌfaɪt/","extraExplanation":["词源提示：bryo- 来自希腊语，意为“苔藓”；-phyte 意为“植物”。合起来就是“苔藓类植物”。","学习对比：bryophyte（苔藓植物）vs. fern（蕨类植物，通常有维管组织）vs. flowering plant（被子植物，有花和种子）。把它放进植物进化与结构差异里记更牢。","常见搭配：bryophyte diversity（苔藓植物多样性）、bryophyte communities（苔藓植物群落）、non-vascular plants（非维管植物）。"]}
{"word":"bryophyte-related","summary":{"en":"“Bryophyte-related” means connected with bryophytes—mosses and similar small, non-vascular plants.","zh":"“bryophyte-related”表示“与苔藓植物有关的”，即与藓类等小型无维管植物相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with, about, or involving bryophytes (non-vascular plants such as mosses, liverworts, and hornworts).","zh":"与苔藓植物有关的；涉及苔藓植物（如藓类、苔类与角苔类等无维管植物）的。"},"examples":[{"en":"The lab focuses on bryophyte-related research, especially how mosses survive drought.","zh":"这个实验室专注于与苔藓植物相关的研究，尤其是藓类如何在干旱中存活。"},{"en":"We collected bryophyte-related samples from shaded rocks near the stream.","zh":"我们在溪流旁的阴湿岩石上采集了与苔藓植物相关的样本。"}]}],"synonyms":["related to bryophytes","moss-related","bryological"],"phonetic":"/ˈbraɪəˌfaɪt rɪˈleɪtɪd/","extraExplanation":["“bryophyte”指“苔藓植物”，包括三大类：mosses（藓类）、liverworts（苔类/地钱类）、hornworts（角苔类）。它们的典型特征是没有真正的维管组织（xylem/phloem），通常体型小，常见于潮湿、阴凉环境。","“bryophyte-related”是由名词 bryophyte + related 构成的形容词，常用于学术写作（如 bryophyte-related traits / genes / habitats），口语中更常直接说 “about mosses” 或 “related to mosses”。"]}
{"word":"bryophytes","summary":{"en":"Bryophytes are small, non-vascular, spore-producing plants such as mosses and liverworts.","zh":"Bryophytes 指苔藓植物：体小、无维管束、以孢子繁殖的植物，如藓类和苔类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small, non-vascular plants (plants without true roots, stems, and leaves) that reproduce by spores; this group mainly includes mosses, liverworts, and hornworts.","zh":"苔藓植物：一类体型小、无维管束（没有真正的根、茎、叶）的植物，用孢子繁殖；主要包括藓类、苔类和角苔类。"},"examples":[{"en":"Bryophytes often grow in damp, shady places like forests and near streams.","zh":"苔藓植物常生长在潮湿、阴凉的地方，比如森林里和溪流附近。"},{"en":"Because bryophytes have no vascular system, they absorb water directly through their surfaces.","zh":"由于苔藓植物没有维管系统，它们会直接通过表面吸收水分。"}]}],"synonyms":["mosses (informal, not exact)","non-vascular plants (broader category)"],"phonetic":"/ˈbraɪəˌfaɪts/","extraExplanation":["“Bryophytes”是复数名词（单数很少用，通常指整个类群）。常见成员：mosses（藓类/苔藓）、liverworts（苔类）、hornworts（角苔类）。","学习提示：别把“moss（苔藓）”和“bryophytes（苔藓植物类群）”混用——moss只是其中一种。","词源：bryo- 来自希腊语，意思与“苔藓/植物”相关；-phyte 表示“植物”。"]}
{"word":"bryophytic","summary":{"en":"“Bryophytic” means “related to bryophytes (moss-like, non-vascular plants).”","zh":"bryophytic 指“与苔藓植物（如苔藓等非维管植物）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to bryophytes: small, non-vascular plants such as mosses, liverworts, and hornworts.","zh":"与苔藓植物（苔类植物）有关的：指苔藓、地钱（苔类的一种）、角苔等没有维管组织的小型植物。"},"examples":[{"en":"Mosses are bryophytic plants that often grow in damp, shady places.","zh":"苔藓属于苔藓植物，常生长在潮湿、阴凉的地方。"},{"en":"Scientists studied bryophytic communities to understand how forests retain moisture.","zh":"科学家研究苔藓植物群落，以了解森林如何保持水分。"}]}],"synonyms":["bryophyte-related","moss-related"],"phonetic":"/ˌbraɪ.oʊˈfɪtɪk/","extraExplanation":["词源提示：bryo- 来自希腊语，意为“苔藓”；-phytic 来自 phyton（植物）。因此 bryophytic 字面意思就是“苔藓植物的/像苔藓植物的”。","学习对比：bryophytic（苔藓植物的）常见于生物/生态学写作；bryophyte（苔藓植物）是名词；非维管植物（non-vascular plants）是更广的分类说法。"]}
{"word":"Bryozoa","summary":{"en":"Bryozoa are tiny aquatic animals that usually live in colonies, often forming lace-like growths on surfaces; they are also called moss animals.","zh":"Bryozoa（苔藓动物门）是微小的水生群体动物，常在物体表面形成蕾丝状或分枝状群落，也叫“苔藓动物/苔藓虫”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a phylum of tiny aquatic invertebrate animals that usually live in colonies and often form lace-like or branching structures on rocks, seaweed, or other surfaces; also called “moss animals.”","zh":"（动物）苔藓动物门：一类微小的水生无脊椎动物，常群体（群落）生活，常在岩石、海藻或其他表面形成蕾丝状或分枝状的群体结构；俗称“苔藓动物/苔藓虫（moss animals）”。"},"examples":[{"en":"Bryozoa are often found as small crusty patches on seaside rocks.","zh":"在海边岩石上常能看到苔藓动物门生物形成的小片壳状附着物。"},{"en":"A bryozoan colony can look like delicate lace under a microscope.","zh":"在显微镜下，一个苔藓动物群体可能看起来像精致的蕾丝。"},{"en":"Scientists study Bryozoa to learn how colonial animals build their skeleton-like structures.","zh":"科学家研究苔藓动物门，以了解群体动物如何构建类似骨骼的结构。"}]}],"synonyms":["moss animals"],"phonetic":"/ˌbraɪəˈzoʊə/","extraExplanation":["词源：Bryozoa 来自希腊语 bryon（“苔藓”）+ zōion（“动物”），因此常见英文俗名是 moss animals（苔藓动物）。","生境与特征：多数种类生活在海水中，少数在淡水中；它们由许多个体（zooids）组成群体，常附着在硬质表面，有的会形成钙质“骨架”，在海洋生态中可为小型生物提供栖息地。","容易混淆：苔藓动物门的群体外观有时会像海藻、珊瑚或水螅类（如一些“海毛虫/羽状生物”外观），但它们属于不同类群。"]}
{"word":"bryozoa","summary":{"en":"Bryozoa are tiny aquatic “moss animals” that usually live in colonies and form crusty or lace-like growths on surfaces.","zh":"Bryozoa 指苔藓虫：微小的水生群体动物，常在物体表面形成薄壳或蕾丝状的附着结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Tiny aquatic animals that usually live in colonies and build lace-like or crusty structures on rocks, shells, and other surfaces; also called “moss animals.”","zh":"（常用复数）苔藓虫：微小的水生动物，通常群体生活，会在岩石、贝壳等表面形成像蕾丝或薄壳一样的群体结构；又称“苔藓动物”。"},"examples":[{"en":"Bryozoa often form crusty patches on seaweed and rocks in coastal waters.","zh":"在沿海水域，苔藓虫常常在海藻和岩石上形成一片片薄壳状的附着群体。"},{"en":"Scientists study Bryozoa to learn how colonial animals build complex structures.","zh":"科学家研究苔藓虫，以了解群体动物如何建造复杂结构。"}]}],"synonyms":["moss animals","bryozoans"],"phonetic":"/ˌbraɪəˈzoʊə/","extraExplanation":["“Bryozoa”是一个动物门（门级分类）的名称，课堂和科普文章里常直接用这个拉丁化名称。口语或科普中也常说“bryozoans”（苔藓虫类）。","它们常被误认为是海藻、珊瑚或海绵，因为外观看起来像植物或硬壳；但实际上是由许多微小个体（zooids）组成的动物群体。","词源：bryo-（像苔藓的）+ -zoa（动物）。在英美自然写作里有时会把它们称为“moss animals”来帮助读者想象外观。"]}
{"word":"bryozoan","summary":{"en":"A bryozoan is a tiny aquatic animal that usually lives in colonies and may form crusty or branching growths on underwater surfaces.","zh":"bryozoan 指苔藓虫：一种微小的水生动物，通常群体生活，常在水下表面形成结壳或分枝状结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tiny aquatic animal (an invertebrate) that usually lives in a colony; many species build branching or crust-like structures on rocks, seaweed, or shells","zh":"苔藓虫（苔藓动物）：一种微小的水生无脊椎动物，通常群体生活；许多种类会在岩石、海藻或贝壳上形成分枝状或结壳状结构"},"examples":[{"en":"Bryozoans often form lace-like patches on underwater surfaces.","zh":"苔藓虫常在水下表面形成像蕾丝一样的斑块。"},{"en":"The researcher collected a bryozoan colony from a pier piling.","zh":"研究人员从码头桩上采集了一团苔藓虫群体。"}]}],"synonyms":["moss animal"],"phonetic":"/ˌbraɪəˈzoʊən/","extraExplanation":["词源小提示：bryozoan 来自希腊语词根 bryon（“苔藓”）+ zōion（“小动物”）。它们看起来像苔藓一样铺在表面上，所以得名。","学习者常见误区：bryozoans 不是植物或藻类，而是动物；很多时候你看到的是“群体外形”，单个个体非常小。","相关词：bryozoan colony（苔藓虫群体），bryozoans /briəˈzoʊənz/（复数）。在生态学里它们常被拿来和 corals（珊瑚）等“群体构造生物”比较，但分类并不相同。"]}
{"word":"bryozoan-like","summary":{"en":"“Bryozoan-like” means resembling a bryozoan, especially in texture or branching/colonial structure.","zh":"“bryozoan-like”指“类似苔藓虫的”，常强调质地或分枝/群体结构的相似。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a bryozoan (a tiny aquatic animal that often lives in colonies, sometimes forming branching or lace-like structures).","zh":"类似苔藓虫的（苔藓虫是一类微小的水生动物，常群体生活，外形有时呈分枝状或蕾丝/网状结构）。"},"examples":[{"en":"Under the microscope, the growth looked bryozoan-like, forming delicate branching patterns.","zh":"在显微镜下，这种生长物看起来像苔藓虫一样，形成精细的分枝状纹理。"},{"en":"The rock surface had a bryozoan-like texture, suggesting it was shaped by colonial organisms.","zh":"岩石表面呈现类似苔藓虫的质地，暗示它可能受群体生物的作用而形成。"}]}],"synonyms":["bryozoan-shaped","bryozoan-textured","branching","lace-like","reticulate"],"phonetic":"/ˌbraɪəˈzoʊən laɪk/","extraExplanation":["“bryozoan-like”常见于生物学、古生物学与材料/纹理描述中，用来说明“外观或结构像苔藓虫群体”。苔藓虫在海洋环境很常见，也有淡水种类；一些化石苔藓虫会在岩石中留下网状、枝状或孔洞状的纹理，因此该词也用于描述化石或岩石表面的形态。","词形结构：bryozoan（苔藓虫）+ -like（像……一样）。在学术写作里常用连字符，表示“具有……的特征”。"]}
{"word":"bryozoan-related","summary":{"en":"“Bryozoan-related” means connected with bryozoans (moss animals), often used in scientific contexts.","zh":"“bryozoan-related”指“与苔藓动物（苔藓虫）有关的”，多用于科学/学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with, describing, or caused by bryozoans (tiny aquatic animals that often form colonies and look like moss or lace).","zh":"与苔藓动物（bryozoans；一种常群体生活、外观像苔藓或蕾丝的微小水生动物）有关的；描述苔藓动物的；由苔藓动物引起的。"},"examples":[{"en":"The researchers recorded several bryozoan-related changes in water clarity.","zh":"研究人员记录了与苔藓动物有关的多项水体清澈度变化。"},{"en":"These bryozoan-related structures can cover rocks like a thin, lace-like layer.","zh":"这些与苔藓动物有关的结构会像一层薄薄的蕾丝一样覆盖在岩石上。"}]}],"synonyms":["bryozoan-associated","bryozoan-linked","related to bryozoans"],"phonetic":"/ˌbraɪəˈzoʊən rɪˈleɪtɪd/","extraExplanation":["“bryozoan”常见于生物学/生态学语境，中文也常译作“苔藓虫”或“苔藓动物”。它们是水生无脊椎动物，常形成群体（colony），因此在文章里经常出现“bryozoan-related growth/bloom/colony”等搭配。","构词上是“bryozoan + related”的复合形容词，多用于学术写作（如论文、报告、科普文章）来精确限定“与……相关的”。"]}
{"word":"bryozoans","summary":{"en":"Bryozoans are tiny colony-forming aquatic animals, mainly marine, often seen as lace-like growths on surfaces.","zh":"bryozoans 指苔藓动物：多为海洋微小群体动物，常在表面形成蕾丝状或薄壳状附着物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Tiny aquatic animals (usually marine) that live in colonies and often build lace-like or crusty structures on rocks, shells, seaweed, or boat surfaces; also called “moss animals.”","zh":"苔藓动物（通常生活在海洋中的微小水生动物），常群体生活，形成像蕾丝或薄壳一样的附着结构，常见于岩石、贝壳、海藻或船体表面。"},"examples":[{"en":"Bryozoans often form delicate, lace-like patches on seaweed and rocks.","zh":"苔藓动物常在海藻和岩石上形成精细的“蕾丝状”斑块。"},{"en":"Scientists study bryozoans to learn how marine colonies grow and protect themselves.","zh":"科学家研究苔藓动物，以了解海洋群体如何生长并保护自己。"}]}],"synonyms":["moss animals","ectoprocts"],"phonetic":"/ˌbraɪ.əˈzoʊ.ənz/","extraExplanation":["“Bryozoans”是复数形式；单数是“bryozoan”。在科普或海洋生态语境里更常见复数，因为人们通常在自然界看到的是“群体（colonies）”。","它们不是植物，虽然中文常译为“苔藓动物”、英文俗称“moss animals”，是因为外观像苔藓一样覆盖在物体表面。","常见附着位置包括码头、船底、养殖网箱等；有些种类会造成“生物污损（biofouling）”，影响船只阻力或养殖设施清洁。"]}
{"word":"bryozoon","summary":{"en":"A bryozoon is a tiny water-dwelling invertebrate that usually lives in colonies and filters food from the water.","zh":"bryozoon 指一种微小的水生无脊椎动物，通常群体生活，并通过过滤水中的微粒取食。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small aquatic invertebrate (a kind of “moss animal”) that usually lives in a colony; many bryozoans form branching or crust-like growths on rocks, shells, or plants in fresh or salt water.","zh":"苔藓动物（个体）：一种小型水生无脊椎动物，常以群体（群落）方式生活；许多苔藓动物会在岩石、贝壳或水生植物表面形成分枝状或结壳状的附着生长，可见于淡水或海水环境。"},"examples":[{"en":"A bryozoon filters tiny food particles from the water with its tentacles.","zh":"苔藓动物会用触手从水中过滤微小的食物颗粒。"},{"en":"We found a bryozoon colony growing on a shell near the shore.","zh":"我们在岸边发现贝壳上长着一片苔藓动物群落。"}]}],"synonyms":["moss animal"],"phonetic":"/ˌbraɪ.əˈzoʊ.ən/","extraExplanation":["词源：来自希腊语 bryon（苔藓）+ zoon（动物），所以英文里有时也叫 “moss animal”。","用法提示：bryozoon 常指“单个个体”，而 bryozoans / Bryozoa 常指“多个个体或整个类群（门）”。在科普文章中更常见的是 bryozoans 或 Bryozoa。"]}
{"word":"bryozoum","summary":{"en":"Bryozoan: a tiny aquatic “moss animal,” often living in colonies; also used as an adjective meaning “related to bryozoans.”","zh":"bryozoan：苔藓虫（苔藓动物），微小水生群体动物；也可作形容词表示“与苔藓虫有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tiny aquatic animal, usually living in colonies that form crusty or branching shapes on rocks, seaweed, or ship hulls; also called a “moss animal.”","zh":"苔藓虫（苔藓动物）：一种微小的水生动物，常群体（群落）生活，在岩石、海藻或船体等表面形成壳状或枝状附着物；也常称“苔藓动物”。"},"examples":[{"en":"Bryozoans often form small, lace-like colonies on underwater surfaces.","zh":"苔藓虫常在水下表面形成小型、像蕾丝一样的群落。"},{"en":"Scientists studied bryozoans to understand how marine colonies grow.","zh":"科学家研究苔藓虫，以了解海洋群体生物如何生长。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to bryozoans.","zh":"与苔藓虫有关的；苔藓虫的。"},"examples":[{"en":"The museum has a display of bryozoan fossils.","zh":"博物馆有一组苔藓虫化石展品。"}]}],"synonyms":["moss animal","ectoproct"],"phonetic":"/ˌbraɪoʊˈzoʊən/","extraExplanation":["你输入的“bryozoum”更像是拼写误差；常见正确拼写是 **bryozoan**（单数/形容词），复数是 **bryozoans**。","词源上来自希腊语：**bryon**（苔藓）+ **zoon**（动物），因此有“moss animal（苔藓动物）”的别称。它们常以群体方式附着生长，所以在海边岩石、码头、船底等处会看到一层层的“壳状/网状”结构。"]}
{"word":"brys","summary":{"en":"“brys” is not a common English word; it is usually a name or a misspelling of another word.","zh":"“brys”不是常见英语词，通常是人名/姓氏，或是其他词的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often seen as a proper name (a surname or given name) or a misspelling/typo of another word.","zh":"不是标准英语单词；最常见是作为专有名词（姓氏或名字）出现，或是其他单词的拼写错误/输入错误。"},"examples":[{"en":"Brys is my classmate’s last name.","zh":"Brys 是我同学的姓。"},{"en":"I think “brys” might be a typo—did you mean “bries” or “Bryce”?","zh":"我觉得“brys”可能是拼写错误——你是想写“bries”还是“Bryce”吗？"}]}],"phonetic":"/brɪs/","extraExplanation":["“brys”在常见英语词典里一般查不到，可能有几种情况：\n1）人名/姓氏（专有名词），发音会因个人或语言背景不同而变化；\n2）拼写误差：常见可能是“bries”（brie 的复数，用于表示多块布里奶酪）、“Bryce”（常见人名），或其他你想输入的词；\n3）缩写：少数情况下可能是某个组织/课程/系统的缩写。\n如果你告诉我它出现的句子或你想表达的意思，我可以帮你锁定最可能的词。"]}
{"word":"brysan","summary":{"en":"“Brysan” isn’t a standard English word; it’s most likely the name “Bryson” spelled differently.","zh":"“brysan” 不是标准英语单词；最可能是人名 “Bryson” 的另一种拼写/误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Likely a misspelling of “Bryson,” a personal name (surname or given name).","zh":"很可能是 “Bryson” 的拼写错误，是一个人名（可作姓氏或名字）。"},"examples":[{"en":"I think you meant Bryson—Brysan isn’t a common spelling in English.","zh":"我觉得你想写的是 Bryson——Brysan 在英语里不是常见拼法。"},{"en":"Bryson is his last name.","zh":"Bryson 是他的姓。"}]},{"partOfSpeech":"other","definition":{"en":"(Rare/unclear) “Brysan” is not a standard English word; it may be a brand name, username, or a name from another language.","zh":"（很少见/不明确）“brysan” 不是标准英语单词；可能是品牌名、用户名，或来自其他语言的名字。"},"examples":[{"en":"Could you share the sentence or context where you saw “brysan” so I can identify it?","zh":"你能提供你看到 “brysan” 的句子或上下文吗？我可以帮你确认它的意思。"}]}],"synonyms":["Bryson"],"phonetic":"/ˈbraɪsən/","extraExplanation":["在英语里，很多以 -son 结尾的姓氏原意是“某人的儿子”（例如 Johnson, Jackson）。Bryson 通常被解释为“Brice 的儿子”或与古英语/凯尔特语地名、姓氏演变有关。","如果你指的是某个专有名词（公司、产品、游戏角色、用户名等），请告诉我来源（链接/图片/句子），我可以给出更准确的释义与用法。"]}
{"word":"Bryson","summary":{"en":"Bryson is a surname and also a given name; in some contexts it refers to the writer Bill Bryson.","zh":"Bryson 既可作姓氏也可作名字；在某些语境中也常指作家 Bill Bryson（比尔·布莱森）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), especially in English-speaking countries","zh":"（常见于英语国家的）姓氏：Bryson"},"examples":[{"en":"My English teacher’s last name is Bryson.","zh":"我英语老师的姓是 Bryson。"},{"en":"The email was signed, “Sincerely, Jordan Bryson.”","zh":"邮件末尾署名：“此致，Jordan Bryson。”"}]},{"partOfSpeech":"n.","definition":{"en":"a given name (first name), more common for boys in the U.S.","zh":"（美国更常见的）名字：Bryson（多用于男孩）"},"examples":[{"en":"Bryson joined our class this semester.","zh":"Bryson 这学期加入了我们班。"},{"en":"They named their son Bryson.","zh":"他们给儿子取名叫 Bryson。"}]},{"partOfSpeech":"n.","definition":{"en":"often used to refer to Bill Bryson, a popular American-British travel and nonfiction writer","zh":"常用来指比尔·布莱森（Bill Bryson）：知名的美籍英裔旅行与非虚构作家"},"examples":[{"en":"I’m reading Bryson’s book about science.","zh":"我在读布莱森写的科普书。"},{"en":"Our book club chose Bryson for an easy, funny travel read.","zh":"我们读书会选了布莱森的书，作为轻松幽默的旅行读物。"}]}],"phonetic":"/ˈbraɪsən/","extraExplanation":["“Bryson”传统上是英语姓氏，常被解释为“Brice 的儿子”（-son 表示“……之子”）。后来也逐渐作为名字使用，尤其在美国较常见。","文化提示：提到 “Bryson” 时，如果语境是读书、旅行写作或科普类书籍，很多人会默认指作家 Bill Bryson。"]}
{"word":"Brython","summary":{"en":"Brython is a tool that allows Python code to run in a web browser, often by converting it to JavaScript.","zh":"Brython 是一种让 Python 代码能在浏览器中运行的工具，通常通过将其转换为 JavaScript 来实现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Python implementation for the web that lets you write Python code to run in a browser (often by translating it into JavaScript).","zh":"一种用于网页的 Python 实现，让你可以在浏览器中运行 Python 代码（通常通过把代码转换成 JavaScript 来实现）。"},"examples":[{"en":"We used Brython to build a simple web page using Python instead of JavaScript.","zh":"我们用 Brython 做了一个简单网页，用 Python 代替 JavaScript。"},{"en":"With Brython, you can handle button clicks in Python right inside the browser.","zh":"用 Brython，你可以直接在浏览器里用 Python 处理按钮点击。"}]}],"synonyms":["browser-based Python","Python in the browser","Python-to-JavaScript"],"phonetic":"ˈbraɪθɑn","extraExplanation":["Brython 这个名字常被理解为 “Browser + Python”（浏览器里的 Python）。它主要面向前端/网页交互：你把 Brython 的库引入页面后，就能在 HTML 里写/引用 Python 脚本来操作 DOM。","学习上可以把它当作：如果你熟悉 Python，但又想做一些网页交互的小项目，Brython 是一种降低门槛的选择。","对比常被提到的 Pyodide：Pyodide 通常是把 Python 运行时编译到 WebAssembly，在浏览器里更“像真正跑 Python”；而 Brython 常见做法是把 Python 语法映射/转换到 JavaScript 生态，和浏览器 API 的结合方式也不同。"]}
{"word":"brython","summary":{"en":"Brython is a tool that runs Python in the browser by converting it to JavaScript.","zh":"Brython 是一种让 Python 在浏览器中运行（通过转换为 JavaScript）的工具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A programming project that lets you run Python code in a web browser by translating it to JavaScript, so you can write Python for web pages without a traditional server setup.","zh":"一个编程项目，让你在网页浏览器中运行 Python 代码：它会把 Python 转换成 JavaScript，因此可以在网页端用 Python 编写交互逻辑，而不必依赖传统服务器运行环境。"},"examples":[{"en":"I used Brython to build a small interactive demo directly in the browser.","zh":"我用 Brython 直接在浏览器里做了一个小型交互演示。"},{"en":"With Brython, students can practice Python on a web page without installing anything.","zh":"用 Brython，学生可以在网页上练习 Python，不用安装任何东西。"},{"en":"The site loads Brython, then executes the Python script to update the page.","zh":"网站先加载 Brython，然后执行 Python 脚本来更新页面。"}]}],"synonyms":["browser-based Python","Python in the browser","Python-to-JavaScript (tool)"],"phonetic":"/ˈbraɪθɑn/","extraExplanation":["“Brython”通常被理解为“Browser + Python”的合成词（浏览器里的 Python）。它常用于教学、小型前端交互、原型演示等场景。","实际项目中，它与 JavaScript 生态（如 DOM、事件、网页 API）会有交互；学习者常把它视为“用 Python 写前端逻辑”的一种方式，但在性能与兼容性上仍需权衡。"]}
{"word":"Brythonic","summary":{"en":"Brythonic refers to the Brittonic branch of Celtic languages, especially Welsh, Cornish, and Breton.","zh":"Brythonic 指凯尔特语族中的布立吞语支，主要包括威尔士语、康沃尔语和布列塔尼语等。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Brittonic (Brythonic) branch of the Celtic languages, historically spoken in Britain and still reflected in Welsh, Cornish, and Breton.","zh":"与布立吞语支（Brythonic / Brittonic）有关的；指凯尔特语族中历史上在不列颠使用、并延续到威尔士语、康沃尔语和布列塔尼语等语言的语支。"},"examples":[{"en":"Welsh is a Brythonic language.","zh":"威尔士语是一种布立吞语支（Brythonic）的语言。"},{"en":"Some place names in Britain have Brythonic origins.","zh":"英国的一些地名源自布立吞语支（Brythonic）。"}]},{"partOfSpeech":"n.","definition":{"en":"the Brittonic (Brythonic) branch of Celtic languages (including Welsh, Cornish, and Breton).","zh":"布立吞语支（Brythonic）：凯尔特语族的一支（包括威尔士语、康沃尔语、布列塔尼语等）。"},"examples":[{"en":"Researchers compare Brythonic with Goidelic to reconstruct early Celtic history.","zh":"研究者会将布立吞语支（Brythonic）与戈伊德尔语支（Goidelic）对比，以重建早期凯尔特历史。"}]}],"synonyms":["Brittonic","Brittonic Celtic"],"phonetic":"/brɪˈθɑːnɪk/","extraExplanation":["“Brythonic”常与“Brittonic”互换使用，学术写作里“Brittonic”更常见；“Brythonic”也常见于历史、考古或文化语境。","它与“Goidelic（戈伊德尔语支）”相对：后者包括爱尔兰语（Irish）、苏格兰盖尔语（Scottish Gaelic）和马恩岛语（Manx）。","文化与历史背景中，Brythonic常被用来讨论罗马时期后不列颠原住民语言的延续，以及这些语言对地名、人名的影响。"]}
{"word":"brythonic","summary":{"en":"Brythonic means “connected to the Welsh/Breton/Cornish branch of Celtic languages or the peoples who spoke them.”","zh":"Brythonic 指“与威尔士语/布列塔尼语/康沃尔语等不列颠语支（凯尔特语族）或其使用者相关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Brythonic branch of the Celtic languages (such as Welsh, Breton, and Cornish), or to the peoples who spoke them in ancient and medieval Britain.","zh":"与凯尔特语族中“不列颠语支”（如威尔士语、布列塔尼语、康沃尔语）有关的；或与古代/中世纪不列颠地区使用这些语言的民族有关的。"},"examples":[{"en":"Welsh is a Brythonic language.","zh":"威尔士语是一种不列颠语支语言。"},{"en":"Some place-names in Britain have Brythonic origins.","zh":"英国的一些地名源自不列颠语支。"},{"en":"Researchers study Brythonic influences on early English vocabulary.","zh":"研究者会研究不列颠语支对早期英语词汇的影响。"}]}],"synonyms":["Brittonic","Brythonic Celtic"],"phonetic":"/brɪˈθɑːnɪk/","extraExplanation":["“Brythonic”常与“Goidelic（盖尔语支）”对比：不列颠语支包括 Welsh（威尔士语）、Breton（布列塔尼语）、Cornish（康沃尔语）；盖尔语支包括 Irish（爱尔兰语）、Scottish Gaelic（苏格兰盖尔语）、Manx（马恩岛语）。","拼写提示：Brythonic 里的“y”较多，来自对古不列颠相关词根（Brit-/Bryth-）的学术拼写传统；在语言学/历史学语境中更常见。"]}
{"word":"Bryum","summary":{"en":"Bryum is the scientific genus name for a widely distributed group of mosses.","zh":"Bryum 是一种分布广泛的苔藓植物的科学属名（真藓属）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of mosses (small non-flowering plants) found in many parts of the world, often growing on soil, rocks, or walls","zh":"（植物）真藓属：一种苔藓植物的属名，分布广，常生长在土壤、岩石或墙面等处"},"examples":[{"en":"We found Bryum growing in a thin layer of soil on the rock.","zh":"我们在岩石上薄薄的一层土里发现了真藓属（Bryum）在生长。"},{"en":"In the lab, the sample was identified as Bryum based on its leaf shape.","zh":"在实验室里，研究人员根据叶片形状将样本鉴定为真藓属（Bryum）。"}]}],"synonyms":["Bryum (moss genus)","true mosses (general category)"],"phonetic":"/ˈbraɪ.əm/","extraExplanation":["Bryum 是拉丁化的科学属名，写作时通常首字母大写、斜体（Bryum）。在日常英语里不常见，多出现在生物学、生态学或野外调查报告中。","词源与希腊语 bryon（意为“苔藓”）有关，因此你也会在一些学术词里看到 bryo- 这个词根（如 bryology“苔藓学”）。"]}
{"word":"bryum","summary":{"en":"Bryum is the scientific genus name for certain mosses.","zh":"Bryum 是某些苔藓的科学属名（真藓属）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small mosses (family Bryaceae), often found in damp soil, rocks, or disturbed ground.","zh":"（植物）真藓属：一种小型苔藓植物的属名（真藓科），常见于潮湿土壤、岩石或受扰动的地面。"},"examples":[{"en":"In the wet corner of the garden, a Bryum moss formed a soft green patch.","zh":"在花园潮湿的角落里，一片真藓属的苔藓形成了柔软的绿色斑块。"},{"en":"The report listed Bryum among the moss genera observed at the site.","zh":"报告将真藓属列为该地点观察到的苔藓属之一。"}]}],"synonyms":["moss (genus Bryum)"],"phonetic":"/ˈbraɪ.əm/","extraExplanation":["“Bryum”多用于科学写作与物种鉴定中，通常首字母大写表示属名；若指某个具体物种，会写成两段式拉丁学名，例如 *Bryum argenteum*。","词源与“bryophyte（苔藓植物）”同源，来自希腊语 *bryon*，意为“苔藓”。"]}

