{"word":"BS","summary":{"en":"“BS” most commonly means “nonsense” (slang) or “Bachelor of Science” (a degree).","zh":"“BS”最常见的意思是俚语“胡说八道”，也可指学位“理学学士”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, informal) Nonsense; something untrue or unfairly exaggerated. Often a shorter, less explicit way to say “bullshit.”","zh":"（俚语，非正式）胡说八道；不真实或被夸大、不公平的说法。常用作“bullshit”的缩写（更含蓄但仍带粗口色彩）。"},"examples":[{"en":"That claim is BS—there’s no evidence for it.","zh":"那个说法是 BS——根本没有证据。"},{"en":"Don’t give me BS; tell me what really happened.","zh":"别跟我扯 BS；告诉我到底发生了什么。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal) To deceive, exaggerate, or talk nonsense to someone.","zh":"（非正式）糊弄；夸大其词；对某人胡扯。"},"examples":[{"en":"He tried to BS his way out of trouble.","zh":"他想靠胡扯来脱身。"},{"en":"Stop BS-ing and answer the question.","zh":"别再瞎扯了，回答问题。"}]},{"partOfSpeech":"n.","definition":{"en":"Bachelor of Science (an undergraduate degree in science/engineering-related fields).","zh":"理学学士（Bachelor of Science，常见于理工科相关本科专业的学位）。"},"examples":[{"en":"She earned a BS in Computer Science.","zh":"她获得了计算机科学的理学学士学位。"},{"en":"My resume lists a BS from UCLA.","zh":"我的简历上写着我在加州大学洛杉矶分校获得了理学学士。"}]}],"synonyms":["nonsense","garbage","lies","rubbish","bullshit"],"phonetic":"/biː ɛs/","extraExplanation":["“BS”在口语和网络上很常见，但在正式写作、职场邮件、对老师/长辈讲话时通常不合适；即使写成缩写，也往往仍被视为带粗口意味。","发音通常按字母读“B-S”。当表示学位时，语气中性、很正式；当表示“胡说”时，语气较冲、带情绪。"]}
{"word":"Bs","summary":{"en":"“BS” most often means a Bachelor of Science degree, or (informally, rude) nonsense/“bullshit”; “Bs” can also mean multiple letter B’s.","zh":"“BS”最常见指理学学士学位；口语里也可（较粗俗）表示“胡扯/扯淡”；“Bs”还可表示多个字母B。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Bachelor of Science degree (a university degree in science/technology-related fields).","zh":"理学学士（Bachelor of Science，偏理工科等领域的大学学位）。"},"examples":[{"en":"She earned a BS in Computer Science.","zh":"她获得了计算机科学的理学学士学位。"},{"en":"I have a BS, but I’m considering a master’s degree next.","zh":"我有理学学士学位，但我在考虑接下来读硕士。"}]},{"partOfSpeech":"n.","definition":{"en":"nonsense; something untrue or unfair (a rude slang meaning of “bullshit”).","zh":"胡说八道；扯淡；不真实或不公平的事（粗口俚语，源自“bullshit”）。"},"examples":[{"en":"That excuse is BS.","zh":"那个借口就是扯淡。"},{"en":"Don’t give me any BS—tell me what really happened.","zh":"别跟我扯这些——说说到底发生了什么。"}]},{"partOfSpeech":"n.","definition":{"en":"the plural of the letter “B” (often written as “Bs” or “B’s”).","zh":"字母B的复数（常写作“Bs”或“B’s”）。"},"examples":[{"en":"There are two Bs in the word “hobby.”","zh":"“hobby”这个词里有两个字母B。"},{"en":"Try to avoid too many B’s in your report card.","zh":"尽量别让成绩单上有太多B。"}]}],"synonyms":["Bachelor of Science","nonsense","baloney","bullshit (vulgar)"],"phonetic":"/ˌbiːˈɛs/","extraExplanation":["“BS”在书面语里常指学位（Bachelor of Science），在口语里也常用作粗俗俚语表示“胡扯/扯淡”。如果你在正式场合（邮件、面试、课堂）不确定语境，建议避免用“BS”表示“bullshit”。","关于复数写法：表示字母复数时，“Bs”更常见；加撇号的“B’s”也有人用来避免看起来像单词，但在现代写作里通常不必加撇号。"]}
{"word":"bs","summary":{"en":"“BS” most commonly means either Bachelor of Science (degree) or, in slang, “bullshit” (nonsense/lie).","zh":"“BS”最常见两种意思：理学学士学位；以及俚语“胡说/鬼话”（源自粗口“bullshit”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bachelor of Science (an undergraduate university degree in science or technical fields).","zh":"理学学士（大学本科常见学位，多见于理工科等专业）。"},"examples":[{"en":"She earned a BS in Computer Science.","zh":"她获得了计算机科学的理学学士学位。"},{"en":"My BS degree helped me qualify for the job.","zh":"我的理学学士学位帮助我符合这份工作的要求。"}]},{"partOfSpeech":"n.","definition":{"en":"Slang for nonsense, lies, or something you strongly disagree with (short for “bullshit,” often considered rude).","zh":"俚语：胡说、鬼话、谎言，或对某事强烈不认同（源自“bullshit”的缩写，常被认为粗鲁）。"},"examples":[{"en":"That’s BS—you never told me about the meeting.","zh":"那是胡说——你从来没跟我说过开会的事。"},{"en":"Don’t give me BS. Just tell me the truth.","zh":"别跟我扯那些鬼话。直接说实话。"}]},{"partOfSpeech":"v.","definition":{"en":"To say things that are not true or are meant to mislead (informal; often rude).","zh":"（动词）胡扯、忽悠、说不实的话（非正式；常带粗鲁语气）。"},"examples":[{"en":"He was just BS-ing to sound confident.","zh":"他只是为了显得自信在那儿胡扯。"},{"en":"Stop BS-ing and answer the question.","zh":"别再胡扯了，回答问题。"}]}],"synonyms":["Bachelor of Science","nonsense","lies","rubbish"],"phonetic":"/ˌbiːˈɛs/","extraExplanation":["写作与口语里常见两种形式：BS、B.S.。在学校/简历语境里通常指“Bachelor of Science”，比较正式；在聊天或吐槽语境里多指“bullshit”的缩写，语气可能冒犯。","如果想表达“胡说/不靠谱”但更礼貌，可以用：nonsense、not true、ridiculous、that’s not right。"]}
{"word":"BS-ing","summary":{"en":"“BS-ing” is informal slang for talking nonsense/lying or wasting time instead of doing something serious.","zh":"“BS-ing”是非正式俚语，常指胡扯/骗人，或指磨洋工、闲扯不做正事。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(informal, slang) Talking in a way that is not honest or not serious; saying things that are exaggerated, untrue, or meant to impress.","zh":"（非正式/俚语）胡扯；瞎编；说不靠谱或不认真的话（常带夸大、骗人或装懂的意味）。"},"examples":[{"en":"Stop BS-ing and tell me what really happened.","zh":"别再胡扯了，告诉我到底发生了什么。"},{"en":"He was BS-ing in the interview, trying to sound more experienced than he was.","zh":"他在面试时一直在瞎编，想让自己听起来更有经验。"},{"en":"I’m not mad—just don’t BS me.","zh":"我不生气——只是别骗我。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal, slang) Wasting time or avoiding work by chatting or doing unimportant things.","zh":"（非正式/俚语）磨洋工；闲扯打发时间（不干正事）。"},"examples":[{"en":"We BS-ed for an hour instead of starting the project.","zh":"我们闲扯了一个小时，结果项目都没开始。"},{"en":"Quit BS-ing around and get back to work.","zh":"别再磨蹭瞎混了，回去干活。"}]}],"synonyms":["lying","talking nonsense","making stuff up","exaggerating","messing around","goofing off"],"phonetic":"/ˌbiːˈɛsɪŋ/","extraExplanation":["“BS”通常是“bullshit”的缩写；“BS-ing”是把缩写当动词用的现在分词形式（也写作“BSing/BS-ing”），口语里很常见。","语体提醒：带粗俗来源的俚语，在正式场合、写作或对不熟的人使用可能显得不礼貌；更中性的说法有“joking/lying/exaggerating/messing around”。"]}
{"word":"Bs/L","summary":{"en":"blood glucose level","zh":"血糖水平"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) blood sugar level; the amount of glucose in the blood (often reported in mmol/L or mg/dL).","zh":"（缩写）血糖水平；血液中葡萄糖的含量（常用 mmol/L 或 mg/dL 表示）。"},"examples":[{"en":"The nurse checked his BS/L before breakfast.","zh":"护士在早餐前测了他的血糖水平。"},{"en":"Her BS/L was high, so the doctor adjusted her diet plan.","zh":"她的血糖水平偏高，所以医生调整了她的饮食方案。"}]}],"synonyms":["blood glucose","glucose level","blood sugar","glycemia"],"phonetic":"/bi ɛs ɛl/","extraExplanation":["如果你是在化验单或临床记录里看到的，通常指“血糖水平”。正式写法更常见的是 BSL 或直接写 blood glucose。","如果你是在其他领域（如工程、物流、游戏聊天）看到的，可能另有含义；给我一句原文或所在领域，我可以帮你精准确认。"],"etymology":"主要来自医学记录中的缩写：BS = blood sugar（血糖），L = level（水平）。不同机构写法可能为 BSL、BS level。","mnemonic":["把它当作三个字母读：B-S-L ≈ Blood Sugar Level（血糖水平）。","联想：BS（blood sugar 血糖）+ L（level 水平）= 血糖水平。"]}
{"word":"BSA","summary":{"en":"BSA is an abbreviation most commonly meaning “Boy Scouts of America,” and in finance/legal contexts it often means the “Bank Secrecy Act.”","zh":"BSA 是一个缩写，最常见指“美国童子军”；在金融/法律语境中常指《银行保密法》。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Boy Scouts of America (a U.S. youth organization focused on outdoor skills, leadership, and community service).","zh":"美国童子军（一个美国青少年组织，强调户外技能、领导力与社区服务）。"},"examples":[{"en":"My uncle volunteered with the BSA when he was in college.","zh":"我叔叔上大学时在美国童子军（BSA）做过志愿者。"},{"en":"She earned several merit badges through the BSA program.","zh":"她通过美国童子军（BSA）的项目获得了好几枚专长徽章。"}]},{"partOfSpeech":"n.","definition":{"en":"Bank Secrecy Act (a U.S. law requiring banks and other financial institutions to help prevent money laundering by keeping records and reporting certain transactions).","zh":"《银行保密法》（美国一项法律，要求银行等金融机构保存记录并报告特定交易，以协助防止洗钱）。"},"examples":[{"en":"The bank updated its procedures to meet BSA requirements.","zh":"这家银行更新了流程以符合《银行保密法》（BSA）的要求。"},{"en":"BSA reporting helps investigators track suspicious transactions.","zh":"BSA 的报告制度有助于调查人员追踪可疑交易。"}]},{"partOfSpeech":"n.","definition":{"en":"Bachelor of Science in Accounting (a university degree abbreviation used by some schools).","zh":"会计学理学学士（一些学校使用的学位缩写）。"},"examples":[{"en":"He listed a BSA on his résumé and applied for an auditing job.","zh":"他在简历上写了 BSA（会计学理学学士），并申请了一份审计工作。"}]}],"synonyms":["Boy Scouts of America","Bank Secrecy Act"],"phonetic":"ˌbiː ɛs ˈeɪ","extraExplanation":["“BSA”是缩写，具体含义要看语境：在日常美国文化中最常见的是 Boy Scouts of America；在金融/合规领域常指 Bank Secrecy Act。看它出现的场景（童子军、徽章、露营 vs. 银行、合规、反洗钱）通常就能判断。"]}
{"word":"BSAA","summary":{"en":"BSAA most commonly refers to the (fictional) Bioterrorism Security Assessment Alliance in Resident Evil; it can also mean the historical airline British South American Airways.","zh":"BSAA最常见指《生化危机》中的（虚构）“生化恐怖主义安全评估联盟”；也可指历史上的航空公司“英国南美航空公司”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bioterrorism Security Assessment Alliance: a fictional international organization in the Resident Evil (Biohazard) series that investigates and responds to bioterrorism threats.","zh":"（生化危机/恶灵古堡系列中的）“生化恐怖主义安全评估联盟”：一个虚构的国际组织，负责调查并应对生化恐怖主义威胁。"},"examples":[{"en":"Chris Redfield works for the BSAA in Resident Evil 5.","zh":"克里斯·雷德菲尔德在《生化危机5》中为BSAA工作。"},{"en":"The BSAA was created to fight outbreaks caused by bio-organic weapons.","zh":"BSAA的成立是为了对抗由生物有机武器引发的爆发事件。"}]},{"partOfSpeech":"n.","definition":{"en":"British South American Airways: a former British airline (mid-20th century) that operated routes to South America.","zh":"英国南美航空公司：一家已停运的英国航空公司（20世纪中期），曾运营前往南美的航线。"},"examples":[{"en":"BSAA operated long-distance flights before the modern jet age.","zh":"在现代喷气式飞机时代之前，BSAA曾运营远程航班。"},{"en":"Some historical records mention accidents involving BSAA aircraft.","zh":"一些历史资料会提到与BSAA飞机相关的事故。"}]}],"synonyms":["B-S-A-A"],"phonetic":"/ˌbiː ɛs eɪ eɪ/","extraExplanation":["“BSAA”在日常英文里通常被当作缩写直接用字母读出（B-S-A-A）。在游戏社区中，多数情况下特指《生化危机》里的组织。","如果你是在某篇文章/对话里看到“BSAA”，可以根据语境判断：谈到Chris、Jill、bioterrorism、outbreak等，多半是游戏设定；谈到航空史、航线、20世纪航空公司等，则更可能是英国南美航空公司。"]}
{"word":"BSAdv","summary":{"en":"BSAdv usually refers to the degree “Bachelor of Science in Advertising.”","zh":"BSAdv 通常指“广告学理学学士（Bachelor of Science in Advertising）”这一学位。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an academic abbreviation meaning “Bachelor of Science in Advertising,” a degree focused on marketing, advertising strategy, media planning, and consumer communication","zh":"学术缩写，通常指“广告学理学学士（Bachelor of Science in Advertising）”，侧重市场营销、广告策略、媒介投放与消费者传播"},"examples":[{"en":"She earned a BSAdv and now works as a media planner.","zh":"她获得了广告学理学学士学位，现在做媒介策划。"},{"en":"The BSAdv program includes courses in copywriting and campaign strategy.","zh":"该广告学理学学士项目包含文案写作和整合营销传播策略等课程。"}]}],"synonyms":["B.S. in Advertising","Bachelor of Science (Advertising)","Advertising major (B.S.)"],"phonetic":"/ˌbiːˌɛs ˈædˌv/","extraExplanation":["“BSAdv”并不是非常通用、固定的英文词典词条，更常见的写法是 “B.S. in Advertising” 或在简历上写 “Bachelor of Science (Advertising)”。不同学校也可能用不同缩写。若你是在某个学校的课程表/系统里看到该缩写，它几乎肯定是某个专业学位名称。"]}
{"word":"BSAE","summary":{"en":"BSAE most commonly means “Bachelor of Science in Agricultural Engineering,” but in other contexts it can refer to different phrases.","zh":"BSAE最常见指“农业工程理学学士”，但在其他语境中也可能有不同含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Bachelor of Science in Agricultural Engineering,” an undergraduate degree in agricultural engineering.","zh":"“农业工程理学学士”（Bachelor of Science in Agricultural Engineering）的缩写，指农业工程方向的本科学位。"},"examples":[{"en":"She earned a BSAE and now designs irrigation systems.","zh":"她获得了BSAE学位，现在从事灌溉系统设计。"},{"en":"BSAE is listed under Education on his résumé.","zh":"他的简历在“教育背景”一栏写着BSAE。"}]},{"partOfSpeech":"other","definition":{"en":"(less common) an abbreviation used in some organizations for other phrases (the exact meaning depends on the field), so it may need context to interpret correctly.","zh":"（较少见）在不同机构/领域里也可能代表其他短语，具体含义取决于语境，通常需要上下文才能准确理解。"},"examples":[{"en":"What does BSAE stand for in your department?","zh":"在你们部门里，BSAE代表什么？"},{"en":"The report uses several acronyms like BSAE—check the glossary.","zh":"这份报告用了很多缩写如BSAE——可以查看术语表。"}]}],"synonyms":["B.S. in Agricultural Engineering","Bachelor of Science in Agricultural Engineering"],"phonetic":"/ˌbiː ɛs eɪ ˈiː/","extraExplanation":["在英文简历、LinkedIn或学校成绩单中，学位类缩写很常见。若写BSAE，最好在第一次出现时写全称（Bachelor of Science in Agricultural Engineering），或在括号里补充学校/专业，避免不同领域的读者误解。"]}
{"word":"BSAeE","summary":{"en":"“BSAeE” is not a standard English word; it’s likely a context-specific acronym, code, or typo.","zh":"“BSAeE”不是标准英语单词；更可能是与上下文相关的缩写、代号或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An unknown or unclear term; it is not a standard English word. It may be a typo, a username/code, or an acronym specific to a school, company, or document.","zh":"不明或不常见的词；它不是标准英语单词。可能是拼写错误、用户名/代码，或某个学校/公司/文件中的缩写。"},"examples":[{"en":"I couldn’t find “BSAeE” in a dictionary—can you tell me where you saw it?","zh":"我在词典里找不到“BSAeE”——你是在哪里看到它的？"},{"en":"If “BSAeE” is an acronym, please share the full sentence so we can guess what it stands for.","zh":"如果“BSAeE”是缩写，请把完整句子发我，这样我才能推测它代表什么。"}]}],"synonyms":["acronym","abbreviation","code","typo"],"phonetic":"/biː ɛs eɪ iː iː/","extraExplanation":["从字母组合来看，“BSAeE”很像某种缩写或内部代号，而不是日常英语单词。常见做法是：你把它出现的上下文（前后各一两句）贴出来，我就能判断它更像是课程/学位名称、组织名、技术名词，还是单纯的拼写错误。","如果你想确认是否为缩写：注意大小写（BSAeE 中的 e/E）、是否有点号（如 B.S.A.E.E.）、以及它是否出现在简历、证书、文件标题或产品型号中；这些线索都会明显改变含义。"]}
{"word":"BSAgE","summary":{"en":"BSAgE is usually a degree abbreviation meaning “B.S. in Agricultural Engineering,” though the exact expansion can vary by institution.","zh":"BSAgE通常是学位缩写，常指“农业工程理学学士（B.S. in Agricultural Engineering）”，但不同机构的全称可能不同。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation that most commonly refers to a degree title, often read as “B.S. in Agricultural Engineering” (the exact expansion can vary by school or country).","zh":"一个缩写，最常见指一种学位名称，常被理解为“农业工程理学学士（B.S. in Agricultural Engineering）”（不同学校或国家的全称可能不同）。"},"examples":[{"en":"She earned her BSAgE and then started working in irrigation design.","zh":"她拿到BSAgE学位后，就开始从事灌溉系统设计工作。"},{"en":"The job posting says BSAgE or a related engineering degree is required.","zh":"招聘信息写明需要BSAgE或相关工程类学位。"}]}],"synonyms":["B.S. AgE","BS in Agricultural Engineering","BSAE (sometimes used)"],"phonetic":"/ˌbiː ɛs eɪ dʒiː iː/","extraExplanation":["这是“首字母缩写”（acronym/initialism）一类写法，通常出现在简历、学历证明、招聘信息或学校课程目录中。","由于不同机构对专业名称的英文缩写不完全统一，遇到BSAgE时，最稳妥的做法是查看它出现的上下文（学校名称、专业全称、课程描述）来确认具体含义。"]}
{"word":"BSAgr","summary":{"en":"BSAgr is an abbreviation for “Bachelor of Science in Agriculture.”","zh":"BSAgr是“Bachelor of Science in Agriculture（农业理学学士）”的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) Bachelor of Science in Agriculture; an undergraduate degree program focused on farming, crops, livestock, soil, and agricultural business/science.","zh":"（缩写）农业理学学士；以农业相关的科学与管理为核心的本科（学士）学位，如作物、畜牧、土壤与农业经营等。"},"examples":[{"en":"She earned a BSAgr and now works as an agricultural extension officer.","zh":"她取得了BSAgr（农业理学学士）学位，现在担任农业推广员。"},{"en":"The university offers a BSAgr with majors in Crop Science and Animal Science.","zh":"这所大学提供BSAgr（农业理学学士）课程，并设有作物科学与动物科学等方向。"}]}],"synonyms":["BS Agriculture","B.S. in Agriculture","BS Agri"],"phonetic":"/ˌbiːˈɛs ˈæɡr/","extraExplanation":["“BSAgr”常见于学校课程表、成绩单、简历或招生简章中，是“Bachelor of Science in Agriculture”的非正式缩写。不同学校也可能写作“BS Agri”或“B.S. in Agriculture”。","读法通常按字母读（B-S），后面的“agr”有时被读成“agri”的简略音；正式写作时建议使用全称或学校官方缩写，以避免误解。"]}
{"word":"BSArch","summary":{"en":"BSArch is short for Bachelor of Science in Architecture.","zh":"BSArch 是“建筑学理学学士”的缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbr.) Bachelor of Science in Architecture—a university degree focused on architectural studies, often a pre-professional program that may require further study to become a licensed architect.","zh":"（缩写）建筑学理学学士——以建筑相关课程为主的大学学位，常为“预专业”路径，通常还需继续深造才能走向建筑师执业资格。"},"examples":[{"en":"She earned a BSArch and then applied to a Master of Architecture program.","zh":"她拿到 BSArch 之后申请了建筑学硕士（M.Arch）项目。"},{"en":"The job listing says: BSArch or equivalent degree required.","zh":"招聘信息写明：需要 BSArch 或同等学历。"}]}],"synonyms":["Bachelor of Science in Architecture","B.S. in Architecture","B.S.Arch."],"phonetic":"/ˌbiːˈɛs ɑrtʃ/","extraExplanation":["在北美语境里，BSArch 常见于高校项目名称或简历中。它通常强调“科学/技术与建筑基础”的训练，但在很多州（或国家/地区）并不等同于可直接申请执照的“专业学位”。","容易与 B.Arch（Bachelor of Architecture，建筑学学士）混淆：B.Arch 在一些体系中更常被视为“专业学位”，而 BSArch 往往需要再读 M.Arch 才更符合执业教育要求（具体以学校与地区规定为准）。","书写上常见变体：BSArch、B.S.Arch.、BS Arch；读法多为逐字母读 “B-S-arch”。"]}
{"word":"BSArchE","summary":{"en":"BSArchE is an abbreviation for the undergraduate degree Bachelor of Science in Architectural Engineering.","zh":"BSArchE 是“建筑工程理学学士”（Bachelor of Science in Architectural Engineering）这一本科毕业学位的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Bachelor of Science in Architectural Engineering (an undergraduate degree focused on engineering aspects of building design, such as structures, construction systems, lighting, acoustics, and building performance).","zh":"建筑工程理学学士（本科专业学位，侧重建筑设计中的工程部分，如结构、建造系统、照明、声学与建筑性能等）。"},"examples":[{"en":"She earned a BSArchE and now designs high-rise structural systems.","zh":"她获得了BSArchE学位，现在从事高层建筑结构系统设计。"},{"en":"The job posting says BSArchE or equivalent engineering degree required.","zh":"招聘信息写明需要BSArchE或同等工程类学位。"}]}],"synonyms":["B.S. in Architectural Engineering","Bachelor of Science in Architectural Engineering","BSAE (varies by school)"],"phonetic":"ˌbiːˈɛs ɑrk ˈiː","extraExplanation":["在美国的学历体系里，B.S. 表示 Bachelor of Science（理学学士）。BSArchE 通常出现在简历、LinkedIn、名片或学校项目名称中。不同学校也可能用相近写法，如 BSAE（Architectural Engineering）或直接写 B.S. in Architectural Engineering。"]}
{"word":"BSArchEng","summary":{"en":"BSArchEng is a degree abbreviation, most often meaning Bachelor of Science in Architectural Engineering.","zh":"BSArchEng 是学位缩写，最常见指“建筑工程学理学学士”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation (used in school documents, résumés, or email signatures) that usually means “Bachelor of Science in Architectural Engineering” or a very similar degree title.","zh":"一个缩写（常见于学校文件、简历或邮件签名中），通常表示“建筑工程学理学学士（Bachelor of Science in Architectural Engineering）”或非常接近的学位名称。"},"examples":[{"en":"Education: BSArchEng, University of Illinois, 2025.","zh":"教育背景：BSArchEng，伊利诺伊大学，2025。"},{"en":"She listed her BSArchEng on her résumé when applying for a structural engineering job.","zh":"她在申请结构工程岗位时在简历上写了自己的BSArchEng学位。"}]}],"synonyms":["BS in Architectural Engineering","BSAE (Architectural Engineering)","BS ArchE"],"phonetic":"/ˌbiː ˌɛs ˈɑːrtʃ ɛndʒ/","extraExplanation":["BSArchEng 不是一个完全标准化的全球通用缩写，不同学校可能用 BSAE、BSAE (Architectural Engineering)、BS in ArchE、或直接写全称。正式场合（简历/证书翻译/申请材料）建议第一次出现写全称，后面再用缩写。","“Architectural Engineering（建筑工程）”通常更偏工程方向（结构、机电、建筑物系统等），而“Architecture（建筑学）”更偏建筑设计与空间艺术；两者在英文里是不同专业。"]}
{"word":"BSBA","summary":{"en":"BSBA is a common abbreviation for the undergraduate business degree “Bachelor of Science in Business Administration.”","zh":"BSBA通常是“Bachelor of Science in Business Administration（工商管理理学学士）”的缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bachelor of Science in Business Administration (an undergraduate degree in business, often focused on management, finance, marketing, or related areas).","zh":"工商管理理学学士（商科本科学位，常见方向包括管理、金融、市场营销等）。"},"examples":[{"en":"She earned a BSBA in Finance and now works at a bank.","zh":"她拿到了金融方向的BSBA学位，现在在银行工作。"},{"en":"The job listing says a BSBA or equivalent degree is preferred.","zh":"招聘信息写着：优先考虑BSBA或同等学历。"},{"en":"I’m applying to the university’s BSBA program next fall.","zh":"我打算明年秋季申请这所大学的BSBA项目。"}]}],"synonyms":["BBA","Bachelor of Science in Business Administration"],"phonetic":"/ˌbiː ɛs biː ˈeɪ/","extraExplanation":["BSBA是美国高校里常见的学位缩写，但不同学校的具体名称与课程设置可能略有差异。有些学校用BBA（Bachelor of Business Administration，工商管理学士）更常见；也有学校把商科归在BS（理学学士）或BA（文学学士）之下。写简历时通常会写全称+缩写：“Bachelor of Science in Business Administration (BSBA)”。"]}
{"word":"BSBH","summary":{"en":"BSBH is not a standard English word; it’s an abbreviation that needs context to interpret.","zh":"BSBH 不是标准英语单词；它是一个需要结合语境才能确定含义的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation whose meaning is not fixed in standard English; it depends on the community or context (e.g., a school course code, a company/team name, or internet shorthand).","zh":"一个在标准英语里没有固定含义的缩写；它的意思通常取决于具体语境（例如课程代码、公司/团队名称、或网络缩写）。"},"examples":[{"en":"What does BSBH mean in this message? Can you share the full sentence?","zh":"这条信息里的 BSBH 是什么意思？你能把完整句子发我吗？"},{"en":"BSBH might be a course code or an internal project name at work.","zh":"BSBH 可能是课程代码，或公司内部的项目名称。"}]}],"synonyms":["abbrev.","initialism","acronym"],"phonetic":"/ˌbiː ˌɛs ˌbiː ˌeɪtʃ/","extraExplanation":["“BSBH”不是常见、通用的英语缩写（不像 ASAP、DIY、LOL 那样有稳定含义）。如果你告诉我它出现的场景（聊天、课程、公司文件、游戏、社交媒体等）以及前后文，我可以帮你判断最可能的意思。","有些缩写会在特定圈子里约定俗成，但在圈外就难以理解；因此最可靠的方式是看上下文或直接问对方：What does BSBH stand for?"]}
{"word":"BSBus","summary":{"en":"“BS bus” is slang for a situation or message full of nonsense; “get on/off the BS bus” means to go along with it or stop doing so.","zh":"“BS bus”是俚语，指一堆胡扯/空话；“get on/off the BS bus”表示跟着起哄或停止跟着。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(slang, informal) “BS bus” (often “the BS bus”) means a situation, story, or group that is full of nonsense, exaggeration, or empty promises; “to get on/off the BS bus” means to start/stop going along with it.","zh":"（俚语/非正式）“BS bus”（常见为“the BS bus”）指充满胡扯、夸大或空头承诺的事情/说法/圈子；“get on/off the BS bus”表示开始/停止跟着瞎起哄、相信或参与这些胡扯。"},"examples":[{"en":"I’m not getting on the BS bus—show me the data first.","zh":"我才不跟着胡扯起哄——先把数据拿出来。"},{"en":"After hearing the details, she got off the BS bus and asked real questions.","zh":"听完细节后，她不再被带节奏，开始问真正的问题。"},{"en":"That sales pitch feels like the BS bus to me.","zh":"那套推销说辞在我看来就是满嘴跑火车。"}]}],"synonyms":["nonsense","baloney","hogwash","hot air"],"phonetic":"/ˈbiːˌɛs bʌs/","extraExplanation":["“BS”常被理解为“bullshit”的缩写，带粗口色彩，日常交流中要注意场合与对象，避免冒犯。","也有人把“BS”理解为别的缩写（如Bachelor of Science，理学学士）。如果你看到的是“BSBus”（连写/驼峰写法），很可能是把“BS bus”写在一起；若你提供上下文（出现场景、句子或领域），我可以给出更准确的解释。"]}
{"word":"BSBusMgt","summary":{"en":"BSBusMgt is usually shorthand for a B.S. (Bachelor of Science) in Business Management.","zh":"BSBusMgt通常是“商业管理理学学士（B.S. in Business Management）”的缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abbreviation often used to mean “B.S. Business Management,” i.e., a Bachelor of Science degree in Business Management (commonly seen in resumes, school documents, or course lists).","zh":"常见缩写，通常指“B.S. Business Management”，即“工商/商业管理理学学士”（多见于简历、学校文件或课程列表）。"},"examples":[{"en":"Education: BSBusMgt, ABC University (2022).","zh":"教育背景：BSBusMgt，ABC大学（2022年）。"},{"en":"She’s applying for jobs after finishing her BSBusMgt.","zh":"她完成BSBusMgt学位后正在申请工作。"}]}],"synonyms":["B.S. in Business Management","Bachelor of Science in Business Management","BSBA (sometimes used in some schools)"],"phonetic":"/ˌbiː ˈɛs ˈbɪznəs ˈmænɪdʒmənt/","extraExplanation":["这是一个非标准、场景化很强的缩写：不同学校/地区可能写法不同，也可能代表其他项目（例如某些机构把它用作“Business Management”的内部代码）。如果你是在课程表、成绩单或简历里看到它，最稳妥的做法是对照该文件的“专业全称/项目名称”栏目，或向学校/发件人确认。","简历里更常见、更清晰的写法包括：“B.S. in Business Management”或“Bachelor of Science (Business Management)”。"]}
{"word":"BSC","summary":{"en":"BSC is most commonly used to mean Bachelor of Science; it can also be an acronym for specific organizations depending on context.","zh":"BSC 最常见指理学学士（Bachelor of Science）；也可能是某些机构名称的缩写，需结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Bachelor of Science (an undergraduate university degree, especially in science, engineering, or related fields).","zh":"理学学士（常见于科学、工程等相关专业的本科学位）。"},"examples":[{"en":"She earned a BSc in Computer Science.","zh":"她获得了计算机科学的理学学士学位（BSc）。"},{"en":"The job posting requires a BSc or equivalent experience.","zh":"该职位要求理学学士（BSc）或同等经验。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation used as part of organization names or titles (meaning depends on the context), e.g., British Society of Cinematographers.","zh":"用于机构名称/头衔中的缩写（含义取决于语境），例如 British Society of Cinematographers（英国电影摄影师协会）。"},"examples":[{"en":"His name was followed by the letters BSC, indicating a professional society title.","zh":"他名字后面跟着 BSC，表示一个专业协会的头衔/称号。"},{"en":"Check the full name to see what BSC stands for in this document.","zh":"在这份文件里要看全称，才能知道 BSC 具体代表什么。"}]}],"synonyms":["BSc","BS (Bachelor of Science)"],"phonetic":"/biː ɛs siː/","extraExplanation":["BSc 和 BS 常被当作同一种学位（理学学士），拼写差异多与国家/学校习惯有关：英国、英联邦更常见 BSc，美国更常见 BS。","BSC 也可能出现在公司/机构缩写或职位头衔里，因此读到时最好结合上下文（学校、行业、国家）确认全称。"]}
{"word":"BSc","summary":{"en":"BSc means Bachelor of Science, an undergraduate degree in science-related fields.","zh":"BSc 指理学学士，是科学及相关领域的本科学位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bachelor of Science: an undergraduate academic degree in science or science-related subjects (e.g., biology, chemistry, engineering, computer science).","zh":"理学学士：以科学或相关专业（如生物、化学、工程、计算机等）为主的本科学位。"},"examples":[{"en":"She earned a BSc in Computer Science from the University of Toronto.","zh":"她在多伦多大学获得了计算机科学理学学士（BSc）学位。"},{"en":"A BSc often includes more math and lab-based courses than a BA.","zh":"BSc 往往比 BA 包含更多数学与实验课程。"}]}],"synonyms":["BS","B.S.","Bachelor of Science"],"phonetic":"/ˌbiː ɛs ˈsiː/","extraExplanation":["BSc 是英联邦国家（如英国、加拿大、澳大利亚、印度等）常见的写法；在美国更常见的是 BS 或 B.S.，含义基本相同。","写在姓名后表示学位时常见格式如：“Alex Chen, BSc”（更正式的写法可写全称 Bachelor of Science）。","不同学校对 BSc/BS 的课程要求差异很大：有些偏理论数学与科研训练，有些偏应用与工程实践，因此最好结合具体专业和学校来理解。"]}
{"word":"bsc","summary":{"en":"BSc means “Bachelor of Science,” a science-related undergraduate degree.","zh":"BSc 指“理学学士”，即理科或科学相关专业的本科毕业学位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bachelor of Science: an undergraduate university degree in science or science-related subjects (e.g., biology, computer science, engineering).","zh":"理学学士：大学本科阶段的学位名称，常见于理科或与科学相关专业（如生物、计算机、工程等）。"},"examples":[{"en":"She earned a BSc in Computer Science.","zh":"她获得了计算机科学的理学学士（BSc）学位。"},{"en":"A BSc usually takes three to four years, depending on the country.","zh":"BSc 通常需要三到四年完成，具体取决于国家/地区。"},{"en":"The job posting requires a BSc or equivalent experience.","zh":"该职位要求具备理学学士（BSc）或同等经验。"}]}],"synonyms":["Bachelor of Science","BS","B.Sc."],"phonetic":"/ˌbiː ˌɛs ˈsiː/","extraExplanation":["BSc 是缩写，常见于英国、加拿大、印度等国家的学校与简历中；在美国更常写作 BS（Bachelor of Science）。","写法上常见 BSc、B.Sc.、BS（地区与学校风格不同，但含义通常相同）。","有些学校会用 BSc（Hons）表示“荣誉学位”（Honours），通常意味着课程更深入或有更高的学术要求。"]}
{"word":"BSCE","summary":{"en":"BSCE = Bachelor of Science in Civil Engineering (a civil engineering bachelor’s degree).","zh":"BSCE = 土木工程理学学士（本科）学位的常见缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abbreviation for “Bachelor of Science in Civil Engineering,” an undergraduate degree in civil engineering.","zh":"“Bachelor of Science in Civil Engineering”的缩写，指“土木工程理学学士（本科）”学位。"},"examples":[{"en":"She earned her BSCE and started working as a site engineer.","zh":"她获得了土木工程理学学士（BSCE）学位，然后开始做现场工程师。"},{"en":"BSCE is listed under his education section on the resume.","zh":"在他的简历教育背景一栏写着 BSCE。"},{"en":"After my BSCE, I plan to take the civil engineering licensure exam.","zh":"完成 BSCE 之后，我打算参加土木工程师执照考试。"}]}],"synonyms":["B.S.C.E.","BScE","BSc in Civil Engineering"],"phonetic":"/ˌbiː ɛs siː ˈiː/","extraExplanation":["BSCE 通常出现在简历、学校成绩单、名片或校友资料里，属于“学位名称缩写”。在正式写作中，第一次出现常会写全称（Bachelor of Science in Civil Engineering），后面再用 BSCE。","不同国家/学校的写法可能不同：也常见 B.S.C.E.、BSc Civil Engineering、BEng (Civil)（偏英式体系）等；具体含义以学校官方学位名称为准。"]}
{"word":"BScE","summary":{"en":"BScE is an abbreviation for a Bachelor of Science in Engineering degree (sometimes a specific engineering major).","zh":"BScE是工程学理学学士学位的缩写（有时指特定工程专业）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(degree abbreviation) Bachelor of Science in Engineering (sometimes used for specific fields such as Civil Engineering).","zh":"（学位缩写）工程学理学学士（有时也指具体专业，如土木工程理学学士）。"},"examples":[{"en":"She earned a BScE and then worked as a project engineer.","zh":"她获得了BScE学位，之后做了项目工程师。"},{"en":"On his resume, he lists: BScE, University of Toronto.","zh":"在他的简历上，他写着：BScE，多伦多大学。"}]}],"synonyms":["BSE","BEng","BSc Eng"],"phonetic":"/ˌbiː ɛs ˌsiː ˈiː/","extraExplanation":["BScE是学位缩写，常见于简历、名片、LinkedIn或学术材料中；口头表达时通常会按字母念“B-S-C-E”。","不同国家/学校的写法可能不同：有的用BSE、BSc Eng、BEng（工程学学士）。具体含义最好以学校官方学位名称为准。","在一些语境里BScE也可能特指“Bachelor of Science in Civil Engineering（土木工程理学学士）”，但并非通用；遇到不清楚时可写全称以避免误解。"]}
{"word":"BSCh","summary":{"en":"BSc(H) = Bachelor of Science (Honours), an honours-level science bachelor’s degree.","zh":"BSc(H)=理学学士（荣誉学位），比普通理学学士通常要求更高。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(abbr.) Bachelor of Science (Honours): an undergraduate university degree in science with an additional “honours” component (often more advanced coursework, a higher academic standard, and/or a research thesis).","zh":"（缩写）理学学士（荣誉学位）：一种理科本科大学学位，带有“荣誉”要求（通常意味着更高难度/更高成绩要求，和/或需要完成研究项目或论文）。"},"examples":[{"en":"She graduated with a BSc(H) in Chemistry.","zh":"她以化学理学学士（荣誉）学位毕业。"},{"en":"The job posting says a BSc(H) or equivalent is preferred.","zh":"招聘信息写明优先考虑理学学士（荣誉）或同等学历。"}]}],"synonyms":["BSc (Hons)","BSc Honours","Bachelor of Science (Honours)"],"phonetic":"/ˌbiː ɛs ˈsiː eɪtʃ/","extraExplanation":["“BSc(H) / BSc (Hons) / BSc Honours”常见于英国、加拿大、澳大利亚、印度等教育体系的简历与成绩单中。不同学校对“Honours”的要求差异很大：有的需要写毕业论文/做研究项目，有的主要是更高阶课程与更高GPA门槛。","在美国语境里通常直接写“B.S. in ___”，未必单独标注“Honours”；如果需要表达更高学术等级，可能用“honors program / with honors”或拉丁荣誉（cum laude等）。"]}
{"word":"BSChE","summary":{"en":"BSChE = Bachelor of Science in Chemical Engineering (an undergraduate degree).","zh":"BSChE＝化学工程理学学士（本科）学位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abbreviation for “Bachelor of Science in Chemical Engineering,” an undergraduate university degree in chemical engineering","zh":"“化学工程理学学士”的缩写，指化学工程专业的本科理学学士学位"},"examples":[{"en":"She earned a BSChE and now works in process design.","zh":"她取得了BSChE学位，现在从事工艺设计工作。"},{"en":"Minimum requirement: BSChE or equivalent degree.","zh":"最低要求：BSChE或同等学位。"},{"en":"He listed “BSChE, University of X” on his résumé.","zh":"他在简历上写了“BSChE，X大学”。"}]}],"synonyms":["B.S. in Chemical Engineering","BS in ChE","BSc (Chemical Engineering)","chemical engineering bachelor’s degree"],"phonetic":"/ˌbiːˌɛsˌsiːˌeɪtʃˈiː/","extraExplanation":["BSChE通常出现在英文简历、招聘启事或学术/专业资料中，是由各个字母读出来的缩写（initialism）。","不同学校/国家写法可能不同：也常见B.S. in Chemical Engineering、BS in ChE、BSc (Chemical Engineering)等；含义通常相近，但学制与课程设置可能因地区而异。","“ChE”在工程领域常用来指Chemical Engineering（化学工程），所以也有人直接写“BS in ChE”。"]}
{"word":"BSchMusic","summary":{"en":"BSchMusic is an abbreviation for a bachelor’s degree in school music, typically music education.","zh":"BSchMusic 是“学校音乐”方向的本科学位缩写，通常指音乐教育类学位。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) a university degree title meaning “Bachelor of School Music,” usually a bachelor’s program focused on music education (training to teach music in schools).","zh":"（缩写）大学学位名称，意为“学校音乐学士”，通常指以音乐教育为重点的本科项目（培养学校音乐教师）。"},"examples":[{"en":"She completed a BSchMusic and now teaches music at a middle school.","zh":"她读完学校音乐学士（BSchMusic），现在在一所中学教音乐。"},{"en":"The job listing says a BSchMusic or equivalent qualification is preferred.","zh":"招聘信息写明优先考虑拥有BSchMusic或同等资格的人选。"}]}],"synonyms":["BMus (often related)","BME (often related)"],"phonetic":"/ˌbiː ɛs ˌsiː eɪtʃ ˈmjuːzɪk/","extraExplanation":["BSchMusic 不是全球通用的统一缩写，不同国家或学校可能用它表示不同的音乐相关学位。更常见的写法包括 BMus（Bachelor of Music，音乐学士）或 BME/B.M.E.（Bachelor of Music Education，音乐教育学士）。如果你是在简历或学校官网看到该缩写，最好对照该校的学位列表（degree abbreviations/qualification abbreviations）确认官方全称。"]}
{"word":"BSCM","summary":{"en":"BSCM is an abbreviation most commonly meaning a degree in Construction Management, but it can also label Business/Supply Chain Management depending on context.","zh":"BSCM是一个缩写，最常见指“施工/建筑管理理学学士”，也可能在不同语境下指“商务/供应链管理”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(education) Bachelor of Science in Construction Management; an undergraduate degree focused on managing construction projects, budgets, schedules, and job-site operations.","zh":"（教育）建筑/工程施工管理理学学士；侧重于施工项目管理、预算、进度与工地运营的本科学位。"},"examples":[{"en":"She earned a BSCM and now works as an assistant project manager.","zh":"她读了BSCM学位，现在做助理项目经理。"},{"en":"Many universities list the BSCM as a four-year program.","zh":"很多大学把BSCM列为四年制项目。"}]},{"partOfSpeech":"other","definition":{"en":"(business) Business / Supply Chain Management (used as a short label in companies, documents, or course names); managing the flow of goods, information, and services from suppliers to customers.","zh":"（商业）商务/供应链管理（常见于公司或课程的缩写标签）；管理从供应商到客户的货物流、信息流与服务流程。"},"examples":[{"en":"I’m in BSCM, so I coordinate purchasing and inventory.","zh":"我在BSCM部门，所以我负责采购和库存协调。"},{"en":"This report is for the BSCM team to review.","zh":"这份报告给BSCM团队审阅。"}]}],"synonyms":["Construction Management (degree)","Supply Chain Management (SCM)","Business Management"],"phonetic":"/biː ɛs siː ɛm/","extraExplanation":["“BSCM”是缩写，在不同学校/公司里含义可能不同。最常见的是学位名称（Bachelor of Science in Construction Management），也有人用来指部门或领域（Business/Supply Chain Management）。如果你能告诉我它出现的场景（学校专业、公司部门、课程名、文件标题等），我可以给出更准确的释义与用法。"]}
{"word":"BSCom","summary":{"en":"BSCom is an abbreviation commonly used (especially in South Asia) for a bachelor’s degree in Commerce, though in some places it can mean other majors—check the official degree title.","zh":"BSCom常见于（尤其是南亚）指“商科/商业相关”的本科学位缩写，但在不同地区也可能代表其他专业，需以官方学位名称为准。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(education, mainly South Asia) Abbreviation for “B.S.Com” / “BSCom,” often used to mean a Bachelor’s degree in Commerce (a business-related undergraduate degree).","zh":"（教育用语，主要见于南亚）“B.S.Com / BSCom”的缩写，常用来指“商科学士/商业学学士”（与商业相关的本科文凭）。"},"examples":[{"en":"She completed her BSCom and then started working in accounting.","zh":"她读完了BSCom（商科本科）后，就开始做会计工作。"},{"en":"The job requires a BSCom or a similar business degree.","zh":"这份工作要求BSCom或类似的商科文凭。"}]},{"partOfSpeech":"n.","definition":{"en":"In some schools or countries, “BSCom” may be used for other majors (for example, Computer Science). Always check the institution’s official name for the degree.","zh":"在某些学校或国家，“BSCom”也可能指其他专业（例如计算机科学）。务必以学校/机构的官方学位名称为准。"},"examples":[{"en":"His BSCom was listed as “Computer Science” on the university transcript.","zh":"他的BSCom在大学成绩单上写的是“Computer Science（计算机科学）”。"},{"en":"To avoid confusion, write the full degree name instead of just “BSCom.”","zh":"为了避免误解，最好写出完整的学位名称，而不只写“BSCom”。"}]}],"synonyms":["Bachelor of Science in Commerce","BSc (Commerce)","B.Com (in some contexts)"],"phonetic":"/ˌbiːˌɛsˈkɑm/","extraExplanation":["“BSCom”不是全球统一的标准缩写：在巴基斯坦、印度、孟加拉等地更常见，用来指与“Commerce（商科/商业）”相关的本科学位；但在其他地区可能不常用，或被理解为别的专业。写简历/申请材料时，建议写成“Bachelor of Science in Commerce (BSCom)”或直接写完整校方官方学位名，以减少歧义。"]}
{"word":"BSCP","summary":{"en":"“BSCP” is an initialism with multiple possible meanings; its correct expansion depends on context.","zh":"“BSCP” 是一个可能有多种含义的首字母缩略词；正确全称取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An initialism (letter-by-letter abbreviation) that can stand for different organizations or programs, depending on the field (e.g., education, science, government, business). Without more context, its exact meaning is unclear.","zh":"一个首字母缩略词（按字母逐个读），在不同领域可能代表不同的机构或项目（如教育、科学、政府、商业等）。如果没有更多语境，无法确定它的具体含义。"},"examples":[{"en":"What does BSCP stand for in this document?","zh":"在这份文件里，BSCP 代表什么？"},{"en":"BSCP can mean different things, so please share the full sentence or the field.","zh":"BSCP 可能有不同含义，请提供完整句子或所属领域。"}]}],"phonetic":"/ˌbiː ɛs siː ˈpiː/","extraExplanation":["很多缩略词在不同国家/行业会对应不同全称。你可以把它出现的“句子/段落”、相关领域（例如：医学、教育、公司制度、课程项目等）发给我，我就能更准确地给出对应全称与用法。"]}
{"word":"BSCS","summary":{"en":"BSCS most commonly means “Bachelor of Science in Computer Science.”","zh":"BSCS最常见的意思是“计算机科学理学学士（Bachelor of Science in Computer Science）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbr.) Bachelor of Science in Computer Science; an undergraduate university degree focused on computer science.","zh":"（缩写）计算机科学理学学士；以计算机科学为主要学习内容的本科学位。"},"examples":[{"en":"She earned a BSCS and now works as a software engineer.","zh":"她取得了BSCS学位，现在是一名软件工程师。"},{"en":"The job posting says a BSCS or equivalent experience is preferred.","zh":"招聘信息写明优先考虑BSCS或同等经验。"},{"en":"On his resume, he listed “BSCS, University of Texas.”","zh":"在他的简历上，他写了“BSCS，德克萨斯大学”。"}]}],"synonyms":["BS in CS","B.S. in Computer Science","BSc Computer Science","BSc CS"],"phonetic":"/ˌbiː ɛs siː ɛs/","extraExplanation":["在不同学校或国家，类似写法还可能见到“BS in CS”“BSc Computer Science”“BSc CS”。含义通常相近，但学制与课程要求可能不同。","在正式文件里，首次出现时常写全称（Bachelor of Science in Computer Science），之后再用缩写BSCS，能更清楚、也更专业。"]}
{"word":"BSD","summary":{"en":"BSD most commonly means Berkeley Software Distribution (a Unix-like OS family). Informally, it can also mean “bullshit detector.”","zh":"BSD 最常指伯克利软件发行版（类 Unix 系统家族）；在口语里也可指“识破鬼话/忽悠的能力”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Berkeley Software Distribution: a family of Unix-like operating systems originally developed at the University of California, Berkeley (often referring to systems like FreeBSD, OpenBSD, and NetBSD).","zh":"伯克利软件发行版：起源于美国加州大学伯克利分校的一系列类 Unix 操作系统（常指 FreeBSD、OpenBSD、NetBSD 等）。"},"examples":[{"en":"Our server runs BSD instead of Linux.","zh":"我们的服务器运行的是 BSD，而不是 Linux。"},{"en":"FreeBSD is one of the most widely used BSD systems today.","zh":"FreeBSD 是当今最常用的 BSD 系统之一。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) “bullshit detector”: a person’s ability to notice when something is untrue, exaggerated, or manipulative.","zh":"（非正式）“识破鬼话的能力”：指一个人能看出别人是否在撒谎、夸大或操纵信息的能力。"},"examples":[{"en":"My BSD went off the moment he started making big promises.","zh":"他一开始做出夸张承诺，我的“识破鬼话雷达”就响了。"},{"en":"Good journalists need a strong BSD.","zh":"优秀的记者需要很强的“识破忽悠能力”。"}]}],"synonyms":["Berkeley Unix","BSD Unix","FreeBSD (related)","OpenBSD (related)","NetBSD (related)"],"phonetic":"/ˌbiː ɛs ˈdiː/","extraExplanation":["在科技语境里，BSD 通常特指“伯克利 Unix 系统谱系”。常见的分支有 FreeBSD（通用服务器/性能）、OpenBSD（安全导向）、NetBSD（可移植性强）。","BSD 也常出现在“BSD license（BSD 许可证）”中：这是一类相对宽松的开源许可证，允许在保留版权声明等条件下进行再发布与商业使用。"]}
{"word":"BSDes","summary":{"en":"BSDes is an abbreviation most commonly meaning “Bachelor of Science in Design.”","zh":"BSDes 通常是“设计理学学士（Bachelor of Science in Design）”的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) Bachelor of Science in Design; an undergraduate degree focused on design (often combining creative skills with science/technology or practical training).","zh":"（缩写）设计理学学士；一种以“设计”为主的本科学位，常结合创意能力与科学/技术或实践训练。"},"examples":[{"en":"She earned a BSDes in Product Design and now works as a UX designer.","zh":"她拿到了产品设计方向的 BSDes 学位，现在做用户体验设计师。"},{"en":"The university offers a BSDes program with courses in design thinking and prototyping.","zh":"这所大学开设 BSDes 项目，课程包括设计思维与原型制作。"}]}],"synonyms":["BDes","B.S. in Design","BS (Design)","Bachelor of Design"],"phonetic":"/ˌbiː ˌɛs ˌdiː ˌiː ˈɛs/","extraExplanation":["“BSDes”并不是全球统一的标准缩写，具体含义会因国家、学校与专业设置而不同。常见写法也可能是 “B.S. in Design”“BS (Design)” 或 “BDes”。如果你是在简历、学校官网或招生简章里看到它，通常指某种“设计类本科（理学）学位”。"]}
{"word":"BSDH","summary":{"en":"BSDH most commonly means “Bachelor of Science in Dental Hygiene.”","zh":"BSDH最常见的意思是“牙科卫生学理学学士”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Bachelor of Science in Dental Hygiene (a university degree for training as a dental hygienist).","zh":"牙科卫生学理学学士（培养牙科保健师/口腔卫生师的大学学位）。"},"examples":[{"en":"She earned her BSDH and started working at a dental clinic.","zh":"她拿到BSDH学位后，开始在牙科诊所工作。"},{"en":"The program offers a BSDH with courses in periodontal care and patient education.","zh":"该项目提供BSDH学位，课程包括牙周护理与患者健康教育。"}]}],"synonyms":["Bachelor of Science in Dental Hygiene","BS in Dental Hygiene","B.S. in Dental Hygiene"],"phonetic":"/ˌbiː ɛs diː eɪtʃ/","extraExplanation":["“BSDH”通常作为缩写在简历、学校项目介绍、执照/继续教育信息中出现；正式写作时常先写全称“Bachelor of Science in Dental Hygiene”，后面再括号标注“(BSDH)”。","读法一般按字母拼读：B-S-D-H。不同学校也可能用“BS in Dental Hygiene”等相近写法。"]}
{"word":"BSDHyg","summary":{"en":"BSDHyg is an abbreviation for the degree “Bachelor of Science in Dental Hygiene.”","zh":"BSDHyg是“牙科／口腔卫生学理学学士”这一学位名称的缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbr.) Bachelor of Science in Dental Hygiene (a university degree in dental hygiene).","zh":"（缩写）牙科／口腔卫生学理学学士（大学学位，主修牙科卫生/口腔预防与保健相关课程）。"},"examples":[{"en":"She earned her BSDHyg and now works as a dental hygienist.","zh":"她取得了BSDHyg学位，现在担任牙科（口腔）卫生师。"},{"en":"The job posting says applicants must have a BSDHyg or an equivalent qualification.","zh":"招聘信息写明应聘者必须具备BSDHyg学位或同等资格。"}]}],"synonyms":["BSDH","B.S.D.H."],"phonetic":"/ˌbiː ɛs diː eɪtʃ waɪ dʒiː/","extraExplanation":["BSDHyg通常出现在学历/证照栏（education/credentials）里，是较正式的学位缩写。不同学校或国家可能也会写作BSDH、B.S.D.H.、BSDH (Dental Hygiene) 等，具体以发证学校的写法为准。","“dental hygienist”在北美通常是受过专门训练、提供洁牙、牙周基础护理、口腔健康教育等服务的专业人员；是否需要执照（license）与执业范围会因地区法规而异。"]}
{"word":"BSE","summary":{"en":"BSE is an abbreviation most commonly meaning a cattle brain disease (bovine spongiform encephalopathy), the Bombay Stock Exchange, or a Bachelor of Science in Engineering degree.","zh":"BSE是一个缩写，最常见可指牛海绵状脑病、孟买证券交易所，或工程理学学士学位。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) bovine spongiform encephalopathy; a fatal brain disease in cattle, linked to “mad cow disease.”","zh":"（缩写）牛海绵状脑病；一种发生在牛身上的致命脑部疾病，常与“疯牛病”相关。"},"examples":[{"en":"The government tightened beef-import rules after reports of BSE.","zh":"在出现BSE的报告后，政府收紧了牛肉进口规定。"},{"en":"Scientists studied how BSE can spread through contaminated feed.","zh":"科学家研究了BSE如何通过受污染的饲料传播。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) Bombay Stock Exchange; a major stock exchange in India.","zh":"（缩写）孟买证券交易所；印度主要证券交易所之一。"},"examples":[{"en":"Shares rose on the BSE after the policy announcement.","zh":"政策公布后，BSE上的股票上涨。"},{"en":"The company plans to list on the BSE next year.","zh":"该公司计划明年在BSE上市。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) Bachelor of Science in Engineering; an undergraduate engineering degree (usage varies by school/country).","zh":"（缩写）工程理学学士；一种本科工程学位（不同学校/国家用法可能不同）。"},"examples":[{"en":"She earned a BSE in mechanical engineering.","zh":"她获得了机械工程方向的BSE学位。"},{"en":"His résumé lists a BSE from a U.S. university.","zh":"他的简历上写着毕业于一所美国大学，学位是BSE。"}]}],"synonyms":["mad cow disease (contextual)","Bombay Stock Exchange (full name)","Bachelor of Science in Engineering (full name)"],"phonetic":"/ˌbiː ɛs ˈiː/","extraExplanation":["“BSE”在新闻里最常见的两种含义是“牛海绵状脑病（mad cow disease相关）”和“孟买证券交易所”。看语境判断：如果附近出现cattle/beef/feed/disease等词，多半是疾病；如果出现shares/index/market/stock等词，多半是交易所。","读作字母：B-S-E。正式写作中首次出现通常会先写全称，再括号写BSE。"]}
{"word":"BSEc","summary":{"en":"BSEc is an abbreviation; it often refers to a degree (e.g., Bachelor of Science in Economics), but its exact meaning depends on context.","zh":"BSEc是一个缩写；常见可指某种学位（如经济学理学学士），但准确含义需要结合语境确定。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) A written abbreviation that can refer to a degree such as “Bachelor of Science in Economics.” (Meaning depends on the school or context.)","zh":"（缩写）书面缩写，常见可指“经济学理学学士”（Bachelor of Science in Economics）等学位名称；具体含义取决于学校或语境。"},"examples":[{"en":"She listed “BSEc” under Education on her résumé.","zh":"她在简历的“教育背景”一栏写了“BSEc”。"},{"en":"The program brochure says applicants need a BSEc or a related degree.","zh":"项目简介写明申请者需要BSEc或相关学位。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) In some contexts, it may simply be a short label/code (for a course, department, document type, etc.).","zh":"（缩写）在某些语境中也可能只是一个简称/编码（如课程、部门、文件类型等）。"},"examples":[{"en":"Please upload the BSEc form before Friday.","zh":"请在周五前上传BSEc表格。"},{"en":"Ask the office what “BSEc” stands for in this system.","zh":"问一下办公室在这个系统里“BSEc”代表什么。"}]}],"synonyms":["BSc Econ","B.S. in Economics"],"phonetic":"/biː ɛs iː siː/","extraExplanation":["“BSEc”不是一个全球统一的标准缩写，最稳妥的做法是结合上下文确认：它出现在简历/学历证书里，多半是某种学位名称；出现在表格、系统或文件名里，则可能只是内部代码。","更常见的写法是“BSc Econ”（Bachelor of Science in Economics）。如果你愿意提供一句原文或它出现的场景，我可以帮你更准确判断。"]}
{"word":"BSEd","summary":{"en":"BSEd = Bachelor of Science in Education, a teaching-focused undergraduate degree.","zh":"BSEd指教育理学学士（Bachelor of Science in Education），以教师培养为主的本科学位。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Bachelor of Science in Education; an undergraduate degree focused on teaching, learning, and educational methods (often preparing you to become a teacher).","zh":"教育理学学士；以教学、学习与教育方法为核心的本科学位（常用于培养教师）。"},"examples":[{"en":"She earned a BSEd in elementary education and now teaches third grade.","zh":"她取得了小学教育方向的教育理学学士（BSEd），现在教三年级。"},{"en":"The job posting says applicants must have a BSEd or a related degree.","zh":"招聘信息写明申请者必须拥有BSEd或相关学位。"},{"en":"I’m applying to the BSEd program because I want to be a licensed teacher.","zh":"我申请BSEd项目，因为我想成为持证教师。"}]}],"synonyms":["B.S.Ed.","Bachelor of Science in Education","BS in Education"],"phonetic":"/ˌbiː ɛs ˈɛd/","extraExplanation":["BSEd是学位缩写，常写作“B.S.Ed.”或“BS Ed.”；不同国家/学校命名可能不同，有的用“BEd（教育学学士）”或“BS in Education”。","具体培养方向可能标注在后面，例如“BSEd in Secondary Education（中学教育方向）”。是否能直接获得教师资格/执照取决于所在地区的认证要求。"]}
{"word":"BSEE","summary":{"en":"BSEE = Bachelor of Science in Electrical Engineering (an undergraduate electrical engineering degree).","zh":"BSEE = 电气工程理学学士（电气工程方向的本科学位）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abbreviation for “Bachelor of Science in Electrical Engineering,” an undergraduate degree focused on electronics, circuits, power systems, signals, and related engineering topics","zh":"“电气工程理学学士”的缩写（Bachelor of Science in Electrical Engineering），指以电子、电路、电力系统、信号等方向为主的本科工程学位"},"examples":[{"en":"She earned a BSEE and now works in power systems engineering.","zh":"她拿到了BSEE学位，现在从事电力系统工程工作。"},{"en":"Job requirements: BSEE or equivalent degree in electrical engineering.","zh":"岗位要求：BSEE或同等电气工程相关学位。"},{"en":"On his resume, he listed “BSEE, University of Michigan, 2022.”","zh":"在他的简历上，他写了“BSEE，密歇根大学，2022”。"}]}],"synonyms":["B.S. in Electrical Engineering","BS in Electrical Engineering","BS EE","Bachelor’s in Electrical Engineering"],"phonetic":"/ˌbiː ˌɛs ˌiː ˌiː/","extraExplanation":["BSEE常见于英文简历、招聘信息、领英（LinkedIn）和学校项目介绍中，用来快速说明学历背景。写作时也常见“B.S. in Electrical Engineering”或“BS EE”，含义基本相同。","发音上通常按字母逐个读（B-S-E-E），而不是当作一个单词来读。"]}
{"word":"BSEEngr","summary":{"en":"BSEEngr is a résumé-style abbreviation meaning “Bachelor of Science in Engineering.”","zh":"BSEEngr 是简历常见缩写，表示“工程理学学士（Bachelor of Science in Engineering）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Bachelor of Science in Engineering,” a university degree in engineering (often seen on résumés, transcripts, or email signatures).","zh":"“工程理学学士（Bachelor of Science in Engineering）”的缩写，指工程类本科（常见于简历、成绩单或邮件签名）。"},"examples":[{"en":"She earned a BSEEngr in Mechanical Engineering in 2022.","zh":"她于2022年获得机械工程方向的工程理学学士（BSEEngr）。"},{"en":"Degree: BSEEngr, Civil Engineering; University of Illinois.","zh":"学历：工程理学学士（BSEEngr），土木工程；伊利诺伊大学。"}]}],"synonyms":["B.S.E.","BSE","BS Eng","Bachelor of Science in Engineering"],"phonetic":"/ˌbiː ɛs iː ˈɛn dʒɪnɪr/","extraExplanation":["“BSEEngr”不是非常标准统一的写法，不同学校/地区可能写作 B.S.E., BSE, BS Eng, 或直接写 Bachelor of Science in Engineering。正式文件里建议优先用学校官方给出的英文全称或常见缩写（如 B.S.E.）。","注意“BSE”在医学/新闻里也可能指 bovine spongiform encephalopathy（牛海绵状脑病，俗称“疯牛病”）。在工程/学历语境中一般不会混淆，但单独写“BSE”时最好配上 Engineering 或专业名称。"]}
{"word":"BSElE","summary":{"en":"BSElE is an abbreviation or program code, most commonly referring to a Bachelor of Science in Electrical Engineering, though exact meaning can vary by institution.","zh":"BSElE 通常是缩写或专业代码，多指“电气工程理学学士”，但具体含义可能因学校而异。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation used (especially in school documents or resumes) to refer to a Bachelor of Science degree in an engineering field—most often Electrical Engineering.","zh":"一种缩写（常见于学校文件或简历），指工程类的理学学士学位——最常见是“电气工程（Electrical Engineering）”方向。"},"examples":[{"en":"She listed “BSElE” on her resume under Education.","zh":"她在简历的“教育背景”里写了“BSElE”。"},{"en":"The form asks for your program, e.g., BSElE, BSCE, or BSME.","zh":"表格要求填写你的专业，例如 BSElE、BSCE（土木）、或 BSME（机械）。"}]},{"partOfSpeech":"other","definition":{"en":"More generally, a school/program code that can vary by country or university; it may also be used for closely related majors (like Electronics Engineering) depending on local naming.","zh":"更广义地说，它可能是学校/专业代码，会因国家或学校而不同；在某些地区也可能被用来指相近专业（如电子工程），取决于当地命名习惯。"},"examples":[{"en":"At that university, BSElE is the code for their Electrical Engineering program.","zh":"在那所大学，BSElE 是电气工程专业的代码。"},{"en":"If you’re unsure what BSElE means, check the school’s official program list.","zh":"如果你不确定 BSElE 的含义，最好查学校官方的专业列表。"}]}],"synonyms":["BSEE","BS in Electrical Engineering","Electrical Engineering (program code)"],"phonetic":"ˌbiː ɛs ˈɛl iː","extraExplanation":["“BSElE”不是全球统一的标准缩写；在不同学校可能写作 BSEE（Bachelor of Science in Electrical Engineering）或用其他代码。填写申请/简历时，建议第一次出现时写全称：Bachelor of Science in Electrical Engineering (BSElE)。","如果你告诉我它出现的国家/学校或上下文（例如课程表、毕业证、招生简章），我可以更准确判断它在你那里的具体含义。"]}
{"word":"BSEM","summary":{"en":"BSEM is an acronym most commonly meaning a bachelor’s degree in engineering management (varies by school) or Bayesian Structural Equation Modeling in statistics; the correct meaning depends on context.","zh":"BSEM是一个缩写，常见含义包括某些学校的工程管理类本科项目/学位，以及统计中的“贝叶斯结构方程建模”；具体含义需结合上下文判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(education, degree) An abbreviation used by some schools for a bachelor’s degree program in engineering management or engineering & management (the exact wording varies by institution).","zh":"（教育/学位）一些学校用来指“工程管理”或“工程与管理”相关本科项目的缩写（不同学校全称可能不同）。"},"examples":[{"en":"She earned a BSEM and now works as a project engineer.","zh":"她拿到了BSEM学位，现在做项目工程师。"},{"en":"The university offers a BSEM program focused on leadership and operations.","zh":"这所大学提供BSEM项目，侧重领导力与运营。"}]},{"partOfSpeech":"other","definition":{"en":"(research, statistics) Abbreviation for Bayesian Structural Equation Modeling, a method that uses Bayesian statistics in structural equation models (SEM).","zh":"（研究/统计）Bayesian Structural Equation Modeling 的缩写，指“贝叶斯结构方程建模”（在结构方程模型SEM中采用贝叶斯统计的方法）。"},"examples":[{"en":"The paper applies BSEM to test the measurement model.","zh":"这篇论文使用BSEM来检验测量模型。"},{"en":"BSEM can be useful when sample sizes are small.","zh":"当样本量较小时，BSEM可能很有用。"}]},{"partOfSpeech":"other","definition":{"en":"(general) A set of initials that can refer to different organizations, programs, or internal codes; the intended meaning depends on context.","zh":"（通用）一组首字母缩写，可能代表不同机构、项目或内部代码；具体含义取决于语境。"},"examples":[{"en":"What does BSEM stand for in this document?","zh":"在这份文件里，BSEM代表什么？"}]}],"synonyms":["B.S. in Engineering Management","Engineering Management (degree)","Bayesian SEM"],"phonetic":"/biː ɛs iː ɛm/","extraExplanation":["BSEM不是像“NASA”那样全球统一的常见缩写，最可靠的做法是看它出现的领域：如果在学校/简历里，多半是某种本科工程管理类学位；如果在论文统计方法里，常指“贝叶斯结构方程建模”。","读缩写时通常逐字母读：B-S-E-M。写作时第一次出现建议给出全称，例如：Bayesian Structural Equation Modeling (BSEM)。"]}
{"word":"BSEng","summary":{"en":"BSEng = Bachelor of Science in Engineering (an undergraduate engineering degree).","zh":"BSEng = 工程理学学士（工程类本科/学士学位）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abbreviation for “Bachelor of Science in Engineering,” an undergraduate degree in engineering (similar to “BEng” or “BS in Engineering”).","zh":"“Bachelor of Science in Engineering（工程理学学士）”的缩写，指工程类本科（学士）学位（类似于 BEng 或 “BS in Engineering”）。"},"examples":[{"en":"She earned her BSEng in Mechanical Engineering and now works in automotive design.","zh":"她获得了机械工程的 BSEng 学位，现在从事汽车设计工作。"},{"en":"The job posting says a BSEng or equivalent degree is required.","zh":"招聘信息写明需要 BSEng 或同等学历。"},{"en":"On his résumé, he listed: BSEng, Electrical Engineering, 2024.","zh":"在他的简历上，他写道：BSEng，电气工程，2024 年。"}]}],"synonyms":["BEng","B.S. Eng.","BS in Engineering","Bachelor of Science in Engineering"],"phonetic":"/ˌbiː ɛs ˈɛndʒ/","extraExplanation":["在不同国家/学校里，这个缩写不算特别统一：常见写法包括 **BSEng**、**B.S. Eng.**、**BS in Engineering**、**BEng**。具体含义以学校官方学位名称为准。","写简历或领英（LinkedIn）时，首次出现可以写全称加缩写：**Bachelor of Science in Engineering (BSEng)**，之后再用缩写更清晰。"]}
{"word":"BSEP","summary":{"en":"BSEP usually means the bile salt export pump, a liver transporter that moves bile acids into bile.","zh":"BSEP 通常指胆汁酸外排泵，是肝脏中将胆汁酸转运到胆汁里的转运蛋白。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"BSEP: the bile salt export pump, a protein in liver cells that transports bile acids (bile salts) out of the cell into bile.","zh":"BSEP：胆汁酸外排泵（胆盐输出泵），一种位于肝细胞的蛋白质，负责把胆汁酸（胆盐）从细胞内转运到胆汁中。"},"examples":[{"en":"Mutations in BSEP can cause serious cholestasis (poor bile flow).","zh":"BSEP 的基因突变可能导致严重的胆汁淤积（胆汁流动受阻）。"},{"en":"Doctors may test for BSEP function when a patient has unexplained jaundice.","zh":"当病人出现原因不明的黄疸时，医生可能会评估 BSEP 的功能。"},{"en":"Some drugs can inhibit BSEP and increase the risk of liver injury.","zh":"某些药物会抑制 BSEP，从而增加肝损伤的风险。"}]}],"synonyms":["bile salt export pump","ABCB11"],"phonetic":"/ˌbiː ɛs iː ˈpiː/","extraExplanation":["BSEP 常见于医学与生物学文献中，对应基因/蛋白名称为 ABCB11（ATP-binding cassette sub-family B member 11）。","当 BSEP 功能受损时，胆汁酸难以排出，可能造成胆汁酸在肝细胞内累积，引发胆汁淤积、瘙痒、黄疸等症状；一些遗传病如 PFIC2（进行性家族性肝内胆汁淤积 2 型）与 BSEP 缺陷有关。","在药物研发与用药安全评估中，“BSEP 抑制”是判断潜在药物性肝损伤风险的一个重要指标。"]}
{"word":"BSES","summary":{"en":"BSES is an abbreviation whose meaning depends on context—often an education board or (in Delhi, India) an electricity distribution company group.","zh":"BSES 是一个依语境而定的缩写，常见含义包括教育考试机构或（印度德里）电力配电公司（集团）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation used for different organizations depending on context, especially in India (commonly referring to a school/education board or a power distribution company group).","zh":"一个缩写，具体含义取决于语境；在印度语境中较常见，常指教育考试机构或电力配电公司（集团）。"},"examples":[{"en":"Please check your results on the BSES website.","zh":"请在 BSES 官网查询你的成绩。"},{"en":"The bill was issued by BSES Rajdhani Power Limited.","zh":"这张账单由 BSES Rajdhani Power Limited（BSES 拉吉达尼电力公司）开具。"}]},{"partOfSpeech":"other","definition":{"en":"(Education) Short for “Board of Secondary Education” in some regions; it refers to an institution that administers secondary school exams and certifications.","zh":"（教育）在一些地区是 “Board of Secondary Education（中等教育委员会）” 的缩写，指负责中学考试与证书管理的机构。"},"examples":[{"en":"She is preparing for the BSES final examinations.","zh":"她正在准备 BSES 的期末考试。"},{"en":"The school follows the BSES syllabus.","zh":"这所学校采用 BSES 的课程大纲。"}]},{"partOfSpeech":"other","definition":{"en":"(Utilities, India) A common abbreviation for “BSES” electricity distribution companies in Delhi, such as BSES Rajdhani Power Limited (BRPL) and BSES Yamuna Power Limited (BYPL).","zh":"（公用事业/印度）常用来指德里地区的 BSES 配电公司，例如 BSES Rajdhani Power Limited（BRPL）和 BSES Yamuna Power Limited（BYPL）。"},"examples":[{"en":"You can register a complaint through the BSES customer care number.","zh":"你可以通过 BSES 客服电话登记投诉。"},{"en":"Power restoration updates were posted by BSES.","zh":"BSES 发布了恢复供电的更新信息。"}]}],"phonetic":"/ˌbiː ɛs iː ˈɛs/","extraExplanation":["“BSES”属于强依赖语境的缩写：在不同国家、城市或文件类型里可能代表不同机构。你如果告诉我你在哪里看到它（例如：成绩单、电费单、公司名、新闻标题），我可以帮你锁定最准确的扩展全称与中文译法。","在阅读英文缩写时，可以留意它周围的关键词：例如和“exam / syllabus / certificate”一起出现时，多半与教育机构有关；和“bill / electricity / power cut / customer care”一起出现时，多半与电力公司有关。"]}
{"word":"BSF","summary":{"en":"“BSF” is an abbreviation with multiple possible meanings; its meaning depends on context.","zh":"“BSF”是一个有多种可能含义的缩写，具体意思取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation used for several organizations or terms; the exact meaning depends on context (for example, “Bible Study Fellowship” or “Border Security Force”).","zh":"一个缩写，可代表多个机构或术语；具体含义取决于上下文（例如“Bible Study Fellowship／圣经学习团契”或“Border Security Force／边境安全部队〔印度〕”）。"},"examples":[{"en":"I joined BSF this year to study the Bible with a small group.","zh":"我今年加入了 BSF，和小组一起学习圣经。"},{"en":"He served in the BSF on the India–Pakistan border.","zh":"他曾在 BSF 服役，驻守印巴边境。"},{"en":"What does “BSF” stand for in this document?","zh":"这份文件里的“BSF”代表什么？"}]}],"synonyms":["abbrev.","acronym","initialism"],"phonetic":"/bi ɛs ɛf/","extraExplanation":["“BSF”在英文里通常按字母逐个读：B-S-F。因为它不是一个固定单词，而是缩写，所以阅读时要看领域与场景：宗教团体（Bible Study Fellowship）常见于教会/查经语境；安全机构（Border Security Force）常见于印度相关的新闻与军事语境。若不确定，最自然的问法是：What does BSF stand for here?（这里的BSF是什么意思/全称是什么？）"]}
{"word":"bsf","summary":{"en":"BSF is an abbreviation most commonly meaning “best friend” in texting; in science/agriculture it can mean “black soldier fly.”","zh":"BSF 是缩写：聊天里最常指“best friend（最好的朋友）”；在科学/农业语境里也可指“black soldier fly（黑水虻）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(texting, informal) “best friend.”","zh":"（短信/网络用语，非正式）“最好的朋友；闺蜜/死党”。"},"examples":[{"en":"Happy birthday, BSF! Thanks for always being there.","zh":"生日快乐，BSF！谢谢你一直都在。"},{"en":"I’m going to the concert with my BSF this weekend.","zh":"这周末我和我的BSF一起去看演唱会。"}]},{"partOfSpeech":"other","definition":{"en":"(informal, often online) “best friend(s) forever,” similar to “BFF.”","zh":"（非正式，常见于网络）“永远的好朋友”，类似于 BFF。"},"examples":[{"en":"We’ve been BSF since middle school.","zh":"我们从初中开始就是BSF了。"},{"en":"They call each other BSF because they do everything together.","zh":"他们互称BSF，因为做什么都在一起。"}]},{"partOfSpeech":"other","definition":{"en":"(science/agriculture) “black soldier fly,” an insect often discussed in composting and animal feed.","zh":"（科学/农业）“黑水虻”，常用于堆肥与饲料相关话题。"},"examples":[{"en":"BSF larvae can help reduce food waste in compost systems.","zh":"黑水虻幼虫可以帮助在堆肥系统中减少厨余垃圾。"},{"en":"Some farms use BSF as a sustainable protein source for animal feed.","zh":"一些农场用黑水虻作为更可持续的动物饲料蛋白来源。"}]}],"synonyms":["BFF","bestie","best friend"],"phonetic":"/ˌbiː ɛs ˈɛf/","extraExplanation":["在聊天语境里，BSF更常被理解为“best friend（最好的朋友）”，有时也被写作“best friend(s) forever”。如果是环保、养殖、堆肥等话题里出现的BSF，则更可能指“black soldier fly（黑水虻）”。","因为BSF是缩写，具体含义强烈依赖上下文；如果你把原句发我，我可以帮你判断是哪一种。"]}
{"word":"BSFM","summary":{"en":"BSFM is an abbreviation; a common use is “Bachelor of Science in Financial Management,” but it can mean other things depending on context.","zh":"BSFM 是缩写；常见用法之一是“金融管理理学学士”，但在不同语境中也可能有其他含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation that can mean “Bachelor of Science in Financial Management” (a university degree program) in some schools.","zh":"在一些学校里可指“金融管理理学学士”（一种大学学位/专业）。"},"examples":[{"en":"She is applying for a BSFM program to study budgeting and corporate finance.","zh":"她正在申请 BSFM 项目，学习预算与公司金融。"},{"en":"The university lists BSFM under its business degrees.","zh":"这所大学在商科类学位中列出了 BSFM。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation that can also stand for different terms depending on the field (e.g., an organization, a process, or a technical label). The exact meaning depends on context.","zh":"也可能在不同领域代表不同术语（如机构名、流程名或技术标签等）；具体含义取决于上下文。"},"examples":[{"en":"What does BSFM mean in this report?","zh":"在这份报告里，BSFM 是什么意思？"},{"en":"BSFM isn’t a common everyday word, so check the document’s glossary or ask the writer.","zh":"BSFM 不是日常常见词，建议查看文档术语表或询问作者。"}]}],"synonyms":["B.S. in Financial Management","Bachelor of Science in Financial Management","acronym","initialism"],"phonetic":"/ˌbiː ɛs ɛf ˈɛm/","extraExplanation":["“BSFM”更像是缩写而不是一个固定单词。不同学校/行业可能给出不同展开形式。你如果把它出现的句子或领域（学校、工作、技术文档等）发我，我可以帮你确定最准确的含义并给出更贴切的例句。"]}
{"word":"BSFMgt","summary":{"en":"“BSFMgt” is a context-dependent abbreviation; “Mgt” means management, and the full expansion must be confirmed from the source.","zh":"“BSFMgt”是依语境而定的缩写；其中“Mgt”表示“管理”，其全称需根据原始来源确认。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation (acronym) that usually refers to a management-related program or department; the exact meaning depends on the organization or document (for example, it may expand to something like “B.S. … Management” or “... Management”).","zh":"一个缩写（首字母缩略词），通常与“管理”相关的学位、专业、部门或岗位有关；具体含义取决于使用它的学校/机构/文件语境（例如可能展开为“理学学士……管理”或“……管理”）。"},"examples":[{"en":"My transcript lists my major as “BSFMgt,” but the portal doesn’t explain what it stands for.","zh":"我的成绩单上把专业写成“BSFMgt”，但系统没有说明它的全称。"},{"en":"Please clarify the abbreviation “BSFMgt” in your resume so recruiters understand your degree.","zh":"请在简历里把“BSFMgt”这个缩写写清楚全称，方便招聘方理解你的学历。"}]}],"synonyms":["abbrev.","acronym"],"phonetic":"/biː ɛs ɛf ɛm dʒiː tiː/","extraExplanation":["这个缩写信息不足，无法唯一确定全称。常见写法里“BS”可能表示 Bachelor of Science（理学学士），“Mgt”几乎肯定是 Management（管理）。中间的“F”可能与 Finance（金融）、Facility（设施）、Forestry/Forest（林业/森林）或其他领域相关，但需要上下文才能判断。","如果你把它出现的场景发我（例如学校名称、专业列表截图、整句原文、所在国家/地区），我可以更准确地给出最可能的展开形式与中文译法。","发正式文件时，建议首次出现写“全称（BSFMgt）”，之后再用缩写。"]}
{"word":"BSFS","summary":{"en":"BSFS most commonly means “Bachelor of Science in Foreign Service,” a degree in international affairs; other meanings exist online but require context.","zh":"BSFS最常见指“外交事务理学学士”（国际事务相关学位）；在网络上也可能有其他含义，但需结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Bachelor of Science in Foreign Service,” an undergraduate degree (especially at Georgetown University) focused on international relations, diplomacy, economics, and regional studies.","zh":"“Bachelor of Science in Foreign Service”的缩写，意为“外交事务理学学士”（尤其常指乔治城大学的本科项目），主要学习国际关系、外交、经济与区域研究等。"},"examples":[{"en":"She’s studying for a BSFS at Georgetown and wants to work in diplomacy.","zh":"她在乔治城大学读 BSFS，想从事外交工作。"},{"en":"His resume lists a BSFS and internship experience at an embassy.","zh":"他的简历上写着 BSFS 学位，并有在使馆实习的经历。"}]},{"partOfSpeech":"other","definition":{"en":"(less common, informal) used online as a casual acronym with other meanings depending on the community; the intended meaning often needs context.","zh":"（较少见，非正式）在网络语境中可能被当作其他含义的缩写使用；具体意思通常需要结合上下文判断。"},"examples":[{"en":"I saw “BSFS” in a comment, but it wasn’t clear what it stood for.","zh":"我在评论里看到“BSFS”，但不清楚它代表什么。"}]}],"synonyms":["Bachelor of Science in Foreign Service","international relations degree","foreign service program"],"phonetic":"/ˌbiː ɛs ɛf ˈɛs/","extraExplanation":["在美国高校语境里，BSFS最常见的指向是乔治城大学外交学院（School of Foreign Service, SFS）的本科学位名称；写简历、LinkedIn或校友介绍时常见。","读字母时通常逐个念：B-S-F-S。若你是在特定论坛/游戏/社群里看到它，也可能是该圈子的内部缩写，需要查看上下文或直接询问对方。"]}
{"word":"BSFT","summary":{"en":"BSFT is an abbreviation, most commonly meaning Brief Strategic Family Therapy; in older medical contexts it can mean the bromosulfophthalein test.","zh":"BSFT 是一个缩写，最常见指“简短策略性家庭治疗”；在较旧的医学语境中也可能指“溴磺酞酞试验”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation that most commonly refers to Brief Strategic Family Therapy (a family-based therapy model used to help adolescents and families, often for behavior problems or substance use).","zh":"一个缩写，最常见指“简短策略性家庭治疗”（Brief Strategic Family Therapy，一种以家庭为核心的治疗模式，常用于帮助青少年及其家庭处理行为问题或物质使用等）。"},"examples":[{"en":"The clinic offers BSFT for teens who are struggling with substance use.","zh":"这家诊所为有物质使用困扰的青少年提供 BSFT（简短策略性家庭治疗）。"},{"en":"BSFT focuses on changing family interaction patterns to support healthier behavior.","zh":"BSFT 侧重于改变家庭互动模式，以支持更健康的行为。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation in medical contexts for the bromosulfophthalein test (an older liver function test).","zh":"医学语境中的缩写，可指“溴磺酞酞试验”（bromosulfophthalein test，一种较早期的肝功能检测方法）。"},"examples":[{"en":"The paper mentions BSFT as a historical liver function test.","zh":"论文把 BSFT 提到为一种历史上的肝功能检测。"}]}],"synonyms":["Brief Strategic Family Therapy","bromosulfophthalein test"],"phonetic":"/biː ɛs ɛf tiː/","extraExplanation":["“BSFT”是缩写，不同领域含义可能不同。最常见的当代用法是在心理健康/家庭治疗领域指 Brief Strategic Family Therapy。若你是在医学文献里看到，可能指 bromosulfophthalein test（较旧的肝功能检查）。","如果你告诉我它出现的句子或领域（例如：心理咨询、医学论文、聊天/社交媒体），我可以帮你锁定最准确的含义。"]}
{"word":"BSGE","summary":{"en":"BSGE is an acronym; its meaning depends on context.","zh":"BSGE 是一个缩写，具体含义取决于上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation/acronym. Its exact meaning depends on the field (e.g., school names, organizations, technical terms), so you usually need surrounding context to know what it stands for.","zh":"一个缩写/首字母缩略词。具体含义取决于使用领域（如学校名称、机构、技术术语等），通常需要上下文才能确定它代表什么。"},"examples":[{"en":"What does BSGE stand for in this document?","zh":"在这份文件里，BSGE 代表什么？"},{"en":"I saw “BSGE” on the form, but there was no explanation.","zh":"我在表格上看到“BSGE”，但没有任何说明。"},{"en":"Could you spell out BSGE the first time you use it?","zh":"你第一次使用 BSGE 的时候可以把全称写出来吗？"}]}],"phonetic":"/ˌbiː ɛs dʒiː ˈiː/","extraExplanation":["“BSGE”不是常见的英语单词，更像是某个领域里的缩写。不同领域可能有不同全称。你可以告诉我它出现的句子、行业（如医学、教育、商业、游戏等）或完整文本片段，我就能更准确地解释。"]}
{"word":"BSGeNEd","summary":{"en":"BSGenEd is usually a school-specific abbreviation for a Bachelor’s degree program related to General Education.","zh":"BSGenEd通常是学校内部使用的缩写，指与“普通/综合教育（通识/师范方向）”相关的本科学位项目。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation for a degree program: “Bachelor of Science in General Education” (wording can vary by school).","zh":"一个学位项目的缩写：“理学学士（普通/综合教育方向）”（不同学校的全称可能略有差异）。"},"examples":[{"en":"She listed “BSGenEd” on her résumé under Education.","zh":"她在简历的“教育背景”一栏写了“BSGenEd”。"},{"en":"The university offers a BSGenEd program for future teachers.","zh":"这所大学提供BSGenEd项目，面向未来的教师。"}]},{"partOfSpeech":"other","definition":{"en":"By extension, it can refer to a department, track, or major related to general education or teacher preparation, depending on the institution’s naming system.","zh":"引申用法：在某些学校里，它也可能指与通识教育或师范培养相关的院系、方向或专业，取决于校方命名方式。"},"examples":[{"en":"Ask the registrar whether BSGenEd and BSEd are considered the same track at your school.","zh":"可以问教务处：在你们学校BSGenEd和BSEd是否算同一培养方向。"},{"en":"He transferred from BSGenEd to a subject-specific education major.","zh":"他从BSGenEd转到了某个学科的师范专业。"}]}],"synonyms":["Bachelor of Science in General Education","GenEd (general education)","BSEd (varies by school)"],"phonetic":"/ˌbiː ˌɛs dʒiː ˌdʒiː ɛn ˈɛd/","extraExplanation":["这是高度“校本化（institution-specific）”的缩写：不同国家、不同学校可能用它指不同的项目（例如通识教育、基础教育、师范培养等）。正式写法建议在第一次出现时写全称（例如 Bachelor of Science in General Education），后面再用缩写。","如果你是在成绩单、招生简章或学校官网看到它，最可靠的做法是对照该校的课程目录（catalog）或向教务处/招生办确认全称与对应培养目标。"]}
{"word":"BSGeolE","summary":{"en":"BSGeolE is an abbreviation for a B.S.-level geology-related degree, most often “B.S. in Geological Engineering.”","zh":"BSGeolE是与地质相关的理学学士学位缩写，最常指“地质工程理学学士”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation used on résumés or academic records for a Bachelor of Science (B.S.) degree related to geology—most commonly meaning “B.S. in Geological Engineering” (sometimes used loosely for “B.S. in Geology,” depending on the school).","zh":"在简历或学术记录中使用的缩写，表示与地质相关的理学学士（B.S.）学位——最常见指“地质工程理学学士”（但在不同学校也可能被宽泛地用来指“地质学理学学士”）。"},"examples":[{"en":"Education: BSGeolE, University of X, 2024.","zh":"教育背景：BSGeolE，X大学，2024年。"},{"en":"She earned a BSGeolE and now works in site investigation and slope stability.","zh":"她获得了BSGeolE学位，现在从事场地勘察与边坡稳定分析工作。"}]}],"synonyms":["B.S. in Geological Engineering","BSc Geological Engineering","BS GeoE","Bachelor of Science in Geological Engineering"],"phonetic":"/ˌbiː ˈɛs ɪn ˌdʒiəˈlɑːdʒɪkəl ˌɛn(d)ʒəˈnɪrɪŋ/","extraExplanation":["这种缩写并不是全球统一标准：有的学校会写成“B.S. in Geological Engineering”“BSc Geological Engineering”“BS GeoE”等。正式写作（申请、论文、官方材料）建议第一次出现时写全称，后面再用缩写。","如果你指的是“B.S. in Geology（地质学理学学士）”，更常见的写法是“BS Geology”或“B.S. Geology”。"]}
{"word":"BSGMgt","summary":{"en":"“BSGMgt” is an abbreviation, typically meaning “BSG Management,” where “Mgt” stands for “management.”","zh":"“BSGMgt”通常是一个缩写，表示“BSG 的管理/经营管理”，其中“Mgt”指“management（管理）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation (often used in course names, file labels, or schedules) meaning “BSG Management” or “Business Strategy Game: Management,” with “Mgt” = “management.” The exact meaning depends on the school/company context.","zh":"一个缩写（常见于课程名、文件名或日程表中），通常表示“BSG 管理/经营管理”或“商业战略模拟（Business Strategy Game）的管理/经营部分”；其中 “Mgt”=“management（管理）”。具体含义取决于所在学校/公司语境。"},"examples":[{"en":"The assignment is under the folder named “BSGMgt.”","zh":"作业在名为“BSGMgt”的文件夹里。"},{"en":"BSGMgt meets on Wednesdays at 2 p.m.","zh":"BSGMgt 这门课每周三下午两点上课。"}]}],"synonyms":["Mgt (abbr.)","management (full form)"],"phonetic":"/ˌbiː ɛs ˌdʒiː ˈɛm dʒiː tiː/","extraExplanation":["“Mgt”是英语里很常见的“management（管理）”缩写，常用于课程代码、部门名称、文件名（如：HR Mgt 人力资源管理、Ops Mgt 运营管理）。","“BSG”在不同环境里可能指不同东西；在商学院语境中常见的是 Business Strategy Game（商业战略模拟）。如果你告诉我它出现在哪（课程表/公司系统/文件名/证书），我可以给出更准确的释义。"]}
{"word":"BSGph","summary":{"en":"“BSGph” is not a standard English word; it’s likely a context-specific abbreviation.","zh":"“BSGph”不是标准英语词汇，更可能是依语境而定的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation or username-like string with no widely accepted dictionary meaning in standard English; it is most likely shorthand for a specific group, project, or community name.","zh":"一个缩写或类似用户名的字符串，在标准英语中没有公认的词典释义；更可能是某个团体、项目或社群名称的简写。"},"examples":[{"en":"I saw “BSGph” in a forum, but I couldn’t tell what it stood for without context.","zh":"我在论坛里看到“BSGph”，但没有上下文就不知道它代表什么。"},{"en":"Can you explain what BSGph means in your company’s documents?","zh":"你能解释一下在你们公司的文件里 BSGph 是什么意思吗？"}]}],"synonyms":["abbreviation","acronym","shorthand"],"phonetic":"/biː ɛs dʒiː piː eɪtʃ/","extraExplanation":["“BSGph”看起来像“BSG + ph”的组合：BSG 常见于粉丝圈/社群（例如 Battlestar Galactica 的缩写）或组织名缩写；ph 可能表示 Philippines（菲律宾）、phone（电话）、pharmacy（药学/药房）或某个项目代号。由于缺少语境，无法给出唯一确定的释义。","如果你把它出现的句子或截图发来（或说明领域：公司文件/游戏/社交媒体/学术/医疗等），我可以更准确地判断它的含义与合适的中文翻译。"]}
{"word":"bsh","summary":{"en":"“bsh” usually means a (vulgar) texting abbreviation for “bullsh*t,” or it can be initials with a specific meaning in context.","zh":"“bsh”通常是“bullsh*t”（较粗俗）的短信缩写；也可能是某些词组的首字母缩写，具体含义看上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(informal, texting) An abbreviation for “bullsh*t” (a vulgar word), meaning nonsense, lies, or something you strongly disagree with.","zh":"（非正式/短信用语）“bullsh*t”的缩写（较粗俗），表示“胡说、瞎扯、谎话”，或用来强烈否定对方的话。"},"examples":[{"en":"That’s bsh—you said you finished the work, but you didn’t.","zh":"那是 bsh——你说你完成了工作，但其实没有。"},{"en":"Stop sending me bsh and show me the proof.","zh":"别再跟我扯 bsh 了，拿出证据来。"}]},{"partOfSpeech":"other","definition":{"en":"A set of initials that can stand for different things depending on context (e.g., a company name or organization).","zh":"在特定语境中可能代表不同事物的一组首字母缩写（例如公司或机构名称）。"},"examples":[{"en":"BSH is also the name of a home-appliances company in some contexts.","zh":"在一些语境里，BSH 也是一家家电公司的名称。"},{"en":"What does BSH stand for in this document?","zh":"在这份文件里，BSH 代表什么？"}]}],"synonyms":["nonsense","lies","not true","BS"],"phonetic":"/ˌbiː ɛs ˈeɪtʃ/","extraExplanation":["“bsh”作为“bullsh*t”的缩写带有粗口色彩，口语里常用来表达强烈不满或否定。更礼貌的替代说法有：“nonsense / not true / that’s not right / that doesn’t make sense”。","如果你是在正式场合（邮件、作业、职场沟通）看到“BSH”，更可能是某个机构/公司/术语的首字母缩写；需要结合上下文确认。"]}
{"word":"BSHA","summary":{"en":"BSHA is an acronym with multiple possible meanings; common ones include a healthcare-administration bachelor’s degree and the British Safety & Hygiene Association.","zh":"BSHA 是一个多义缩写；常见含义包括“健康管理理学学士”等学位名称，以及“英国安全与卫生协会”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation used for several organizations or degree programs; the exact meaning depends on the context (industry, country, and document).","zh":"一个有多种含义的缩写；具体指什么取决于语境（行业、国家、文件来源）。"},"examples":[{"en":"On his résumé, BSHA appeared under Education, so I assumed it was a degree.","zh":"在他的简历里，BSHA 出现在“教育背景”下，所以我猜它是一个学位。"},{"en":"The email said “per BSHA guidelines,” but it didn’t explain which BSHA.","zh":"邮件写着“根据 BSHA 指南”，但没有说明是哪一个 BSHA。"}]},{"partOfSpeech":"other","definition":{"en":"(common use in education, especially in the U.S.) Bachelor of Science in Health Administration (or a very similar program name) — an undergraduate degree focused on managing healthcare organizations.","zh":"（教育领域常见，尤其在美国）健康管理理学学士（或非常相近的专业名称）——侧重医疗机构管理的本科学位。"},"examples":[{"en":"She earned a BSHA and now works in hospital operations.","zh":"她拿到 BSHA 学位，现在做医院运营管理。"},{"en":"The BSHA program includes courses in healthcare finance and policy.","zh":"BSHA 项目通常包含医疗财务与政策等课程。"}]},{"partOfSpeech":"other","definition":{"en":"(U.K. and international workplace context) British Safety & Hygiene Association — an organization related to workplace health, safety, and hygiene.","zh":"（英国及国际职场语境）英国安全与卫生协会——与职业健康、安全与卫生相关的机构。"},"examples":[{"en":"We bought the cleaning products through a supplier listed by BSHA.","zh":"我们通过 BSHA 列出的供应商购买清洁用品。"},{"en":"The report referenced BSHA resources on safe chemical handling.","zh":"报告引用了 BSHA 关于安全处理化学品的资料。"}]}],"synonyms":["acronym","initialism"],"phonetic":"/ˌbiː ɛs eɪtʃ ˈeɪ/","extraExplanation":["“BSHA”本身不是一个单一固定的英文单词，而是首字母缩写。最稳妥的理解方法是看它出现在什么栏目（Education/Organization/Guidelines）、哪个国家/行业，以及它前后有没有全称（full name）。","如果你告诉我：它出现在哪句话里、属于哪个领域（比如学校、医疗、职业安全）、或截图上下文，我可以帮你确定最可能的含义并给更贴切的例句。"]}
{"word":"BSHE","summary":{"en":"BSHE is an acronym, usually a bachelor’s degree title; its exact meaning depends on the institution (often Health Education, sometimes Home Economics-related).","zh":"BSHE是一个缩写，通常指某种学士学位名称；具体含义取决于学校（常见为健康教育，也可能与家政/家政教育相关）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation used in education and job titles; it most commonly refers to a specific bachelor’s degree (the exact meaning depends on the school or country).","zh":"一个用于教育或职位名称中的缩写；最常见指某种“理学学士”学位（具体含义取决于学校或国家/地区）。"},"examples":[{"en":"She listed “BSHE” on her resume under Education.","zh":"她在简历的“教育背景”里写了“BSHE”。"},{"en":"The program requires BSHE graduates to complete a practicum.","zh":"该项目要求BSHE毕业生完成实习（practicum）。"}]},{"partOfSpeech":"other","definition":{"en":"(Common in some universities) Bachelor of Science in Health Education.","zh":"（一些大学常见）健康教育理学学士。"},"examples":[{"en":"He earned a BSHE and now works in public health education.","zh":"他取得了BSHE学位，现在从事公共健康教育工作。"}]},{"partOfSpeech":"other","definition":{"en":"(Less common) Bachelor of Science in Home Economics / Home Economics Education (older or region-specific usage).","zh":"（较少见）家政学理学学士／家政教育理学学士（偏旧或地区性用法）。"},"examples":[{"en":"Her aunt completed a BSHE decades ago and became a teacher.","zh":"她的姑妈几十年前读了BSHE，后来当了老师。"}]}],"synonyms":["B.S.","bachelor’s degree","undergraduate degree"],"phonetic":"/ˌbiː ɛs eɪtʃ ˈiː/","extraExplanation":["“BSHE”不是一个全球统一的缩写：不同学校可能把它解释为不同专业方向的学士学位（例如健康教育、家政/家政教育等）。最可靠的做法是查看它出现的学校官网、课程目录（catalog）或证书上的全称。","读法通常是逐字母读：B-S-H-E。写作场景多见于简历、成绩单、项目招生信息等正式文本。"]}
{"word":"BSHEc","summary":{"en":"“BSHEc” is not a common English word; it’s likely an abbreviation that needs context to interpret.","zh":"“BSHEc”不是常见英语词汇；更可能是需要结合上下文才能解释的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An unclear abbreviation or code. “BSHEc” is not a standard English word, and its meaning depends on the context (e.g., a course name, degree title, company code, or model number).","zh":"一个不明确的缩写或代码。“BSHEc”不是常见英语单词，具体含义取决于上下文（如课程名、学位名称、公司内部代码或型号等）。"},"examples":[{"en":"What does “BSHEc” stand for in this document?","zh":"在这份文件里，“BSHEc”代表什么？"},{"en":"I saw “BSHEc” on the form, but there was no explanation.","zh":"我在表格上看到“BSHEc”，但没有任何说明。"}]}],"phonetic":"/ˌbiːɛsˌeɪtʃˌiːˈsiː/","extraExplanation":["这个缩写可能是某个专业/学位的写法（例如 B.S. + 某领域）、学校课程代码、组织或证书名称的一部分，也可能只是随机的用户名/编号。为了准确释义，请你补充：它出现在哪（学校、简历、论文、产品标签、聊天）以及完整句子/截图。"]}
{"word":"BSHEd","summary":{"en":"BSHEd usually means “Bachelor of Science in Home Economics Education.”","zh":"BSHEd 通常指“家政教育理学学士（Bachelor of Science in Home Economics Education）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Bachelor of Science in Home Economics Education,” an undergraduate degree focused on teaching home economics (e.g., cooking, nutrition, family life, clothing/textiles, basic livelihood skills).","zh":"“Bachelor of Science in Home Economics Education”的缩写，意为“家政教育理学学士”本科专业，重点是学习并教授家政相关课程（如烹饪、营养、家庭生活、服装/纺织与基础生计技能等）。"},"examples":[{"en":"She graduated with a BSHEd and now teaches home economics in high school.","zh":"她取得了 BSHEd 学位，现在在高中教家政课。"},{"en":"The BSHEd program includes teaching practice and lesson planning.","zh":"BSHEd 课程通常包含教育实习和教案设计。"}]}],"synonyms":["Bachelor of Science in Home Economics Education","BS in Home Economics Education","Home Economics Education degree"],"phonetic":"/ˌbiːˌɛsˌeɪtʃˈiːˌɛd/","extraExplanation":["BSHEd 常见于部分国家/地区（例如菲律宾）高校的专业名称与简历写法；不同学校可能会把它解释为“Home Economics Education（家政教育）”方向的理学学士。","注意不要和 BSEd（Bachelor of Secondary Education，常指中学教育学士）混淆；缩写在不同学校体系里可能含义不同。"]}
{"word":"BSHyg","summary":{"en":"“BSHyg” is not a common English word; it’s likely an acronym or username whose meaning depends on context.","zh":"“BSHyg”不是常见英语词；更可能是缩写或用户名，具体含义需看语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely an acronym, a username, or a shortened form used in a specific community or context, so its meaning depends on where you saw it.","zh":"不是标准英语单词。更可能是缩写、用户名，或某个圈子里的简写，因此含义取决于你看到它的语境。"},"examples":[{"en":"I saw “BSHyg” in a chat—do you know what it stands for?","zh":"我在聊天里看到“BSHyg”——你知道它代表什么吗？"},{"en":"Without context, “BSHyg” is hard to define.","zh":"没有语境的话，很难给“BSHyg”下定义。"}]}],"synonyms":["acronym","initialism","username","handle"],"phonetic":"/biː ɛs eɪtʃ waɪ dʒiː/","extraExplanation":["这种由大小写字母混合组成的字符串，常见来源包括：姓名/组织名首字母缩写、游戏公会/服务器代号、课程或项目代号、随机生成的账号名等。","如果你愿意，把它出现的完整句子或截图发来（并遮住隐私信息），我可以根据上下文更准确地推测含义。"]}
{"word":"BSI","summary":{"en":"BSI is most commonly the abbreviation for the British Standards Institution (UK standards body). It can also mean other things depending on context.","zh":"BSI最常见是“英国标准协会”的缩写；也可能在不同语境中代表其他含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"British Standards Institution: the UK’s national standards body that creates and publishes standards (rules) for products, services, and management systems.","zh":"英国标准协会：英国的国家标准机构，负责制定与发布产品、服务与管理体系等方面的标准。"},"examples":[{"en":"Our supplier is certified by BSI for quality management.","zh":"我们的供应商通过了BSI的质量管理认证。"},{"en":"The company used BSI standards to improve workplace safety.","zh":"这家公司使用BSI标准来提升职场安全。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation used for different organizations or terms depending on the field (for example, a company name, an institute, or a technical term). You usually need context to know the exact meaning.","zh":"在不同领域中可能代表不同机构或术语的缩写（例如公司名、研究机构或技术名词）；通常需要结合上下文才能确定具体含义。"},"examples":[{"en":"What does BSI stand for in this document?","zh":"在这份文件里，BSI代表什么？"},{"en":"In medical notes, BSI can mean something different from the BSI you see in business.","zh":"在医学记录中，BSI可能和商业场景里的BSI不是一个意思。"}]}],"synonyms":["British Standards Institution (when referring to the UK body)"],"phonetic":"/ˌbiː ɛs ˈaɪ/","extraExplanation":["在国际贸易、质量管理与合规（compliance）语境里，BSI最常见指“British Standards Institution（英国标准协会）”。它与ISO标准体系关系密切：许多组织会通过BSI进行ISO 9001（质量）、ISO 27001（信息安全）等体系认证。","遇到缩写BSI时，建议看上下文线索：是否出现“standard(s)”“certification”“ISO”“UK”等词；若有，很可能就是英国标准协会。也可以在文档首次出现处寻找括号释义（例如：BSI (British Standards Institution)）。"]}
{"word":"BSIE","summary":{"en":"BSIE is most commonly an abbreviation for “Bachelor of Science in Industrial Engineering,” though its exact expansion may vary by institution.","zh":"BSIE最常见是“工业工程理学学士”的缩写，但在不同机构中全称可能略有不同。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) Bachelor of Science in Industrial Engineering (a university degree).","zh":"（缩写）工业工程理学学士（大学学位）。"},"examples":[{"en":"She earned a BSIE and now works in manufacturing optimization.","zh":"她获得了工业工程理学学士（BSIE）学位，现在从事制造优化工作。"},{"en":"The job posting says “BSIE or related degree preferred.”","zh":"招聘信息写着“优先考虑BSIE或相关专业学位”。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) Used by some schools/companies to mean a degree or program related to industrial engineering or engineering systems (the exact words can vary by institution).","zh":"（缩写）有些学校或公司用它指与工业工程或工程系统相关的学位/项目（不同机构全称可能不同）。"},"examples":[{"en":"At our university, BSIE refers to the Industrial Engineering undergraduate program.","zh":"在我们学校，BSIE指工业工程本科项目。"},{"en":"Check the transcript to confirm what BSIE stands for in your department.","zh":"查看成绩单/证明文件，确认你们院系里BSIE的具体全称。"}]}],"synonyms":["B.S. in Industrial Engineering","BS Industrial Engineering","BSIE degree"],"phonetic":"/ˌbiːˌɛsˌaɪˈiː/","extraExplanation":["“BSIE”通常作为字母缩写（initialism）使用，读作每个字母的名称。最常见的含义是“Bachelor of Science in Industrial Engineering”。但不同学校、国家或组织可能会用同一缩写代表不同名称；正式场合（简历、申请材料、证书翻译）最好写出全称，或在首次出现时标注全称（例如：Bachelor of Science in Industrial Engineering (BSIE)）。"]}
{"word":"BSIndEd","summary":{"en":"BSIndEd = Bachelor of Science in Industrial Education (a degree for teaching/training industrial or technical subjects).","zh":"BSIndEd＝工业/产业教育理学士（面向工业或技术类课程教学与培训的本科学位）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Bachelor of Science in Industrial Education,” an undergraduate degree focused on teaching technical/industrial subjects (e.g., drafting, electronics, woodworking, manufacturing basics) and often preparing graduates to become technology/industrial education teachers or trainers","zh":"“Bachelor of Science in Industrial Education（工业/产业教育理学士）”的缩写；一种本科专业，侧重技术与工业类课程的教学与培训（如制图、电子、木工、制造基础等），常用于培养技术/工业教育教师或企业培训人员"},"examples":[{"en":"She earned a BSIndEd and now teaches industrial arts at a public high school.","zh":"她取得了BSIndEd学位，现在在公立高中教授工业/工艺类课程。"},{"en":"The job posting says a BSIndEd or related education degree is preferred.","zh":"招聘信息写明：优先考虑BSIndEd或相关教育类学位。"}]}],"synonyms":["B.S. in Industrial Education","Bachelor of Science in Industrial Education","BS Industrial Education"],"phonetic":"/ˌbiː ˌɛs ˌɪnd ˈɛd/","extraExplanation":["这个缩写多见于学校简历、成绩单、校内文件或招聘广告中；正式写法通常是“B.S. in Industrial Education”或完整拼写“Bachelor of Science in Industrial Education”。","在不同国家/学校，专业名称可能略有差异，课程也会从“职业技术教育（TVET）/技术教育（Technology Education）”到“工业培训（Industrial Training）”不等；建议在正式场合同时写出全称以避免误解。"]}
{"word":"BSIndEngr","summary":{"en":"BSIndEngr = B.S. in Industrial Engineering (Bachelor of Science).","zh":"BSIndEngr = 工业工程理学学士（B.S. in Industrial Engineering）的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation for “B.S. in Industrial Engineering,” meaning a Bachelor of Science degree focused on improving systems and processes in areas like manufacturing, services, logistics, and operations.","zh":"“B.S. in Industrial Engineering（工业工程理学学士）”的缩写，指以制造、服务、物流与运营等领域的系统与流程改进为核心的本科理学学位。"},"examples":[{"en":"She earned a BSIndEngr and now works in supply chain analytics.","zh":"她获得了BSIndEngr（工业工程理学学士），现在从事供应链数据分析工作。"},{"en":"The job posting says a BSIndEngr or a related engineering degree is preferred.","zh":"招聘信息写明优先考虑BSIndEngr（工业工程理学学士）或相关工程专业学历。"}]}],"synonyms":["BSIE","B.S. in Industrial Engineering","Bachelor of Science in Industrial Engineering"],"phonetic":"/ˌbiːˈɛs ɪn ɪnˈdʌstriəl ˌɛnʤəˈnɪrɪŋ/","extraExplanation":["“BSIndEngr”属于非标准缩写，更常见的写法是“BSIE”或直接写全称“B.S. in Industrial Engineering / Bachelor of Science in Industrial Engineering”。在简历、学校系统或证书上，缩写形式可能因机构而不同。","Industrial Engineering（工业工程）通常强调：流程优化、效率提升、质量管理、运筹/数据分析、人因工程等；和机械/电机等偏“设备与硬件设计”的方向有所不同。"]}
{"word":"BSIndMgt","summary":{"en":"BSIndMgt = B.S. in Industrial Management (a science bachelor’s degree in industrial/operations management).","zh":"BSIndMgt = 工业管理理学学士（偏运营/生产与管理的本科理学学位）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Abbreviation for “B.S. in Industrial Management”: a Bachelor of Science degree focused on managing operations, production, logistics, quality, and people in industrial or business settings.","zh":"“理学学士（工业管理）”的缩写：一种以工厂/运营管理为核心的学士学位，常涵盖生产、物流、质量管理与人员管理等内容。"},"examples":[{"en":"She earned a BS in Industrial Management and now works in supply chain operations.","zh":"她取得了工业管理理学学士学位，现在在供应链运营领域工作。"},{"en":"On his résumé, he wrote: BSIndMgt, 2024, State University.","zh":"在他的简历上，他写道：BSIndMgt，2024，州立大学。"}]}],"synonyms":["B.S. in Industrial Management","BS in Industrial Management","Industrial Management (degree)","Operations Management (related field)"],"phonetic":"/ˌbiːˈɛs ɪn ɪnˈdʌstriəl ˈmænɪdʒmənt/","extraExplanation":["“BSIndMgt”这种写法更像个人笔记或简历里的自定义缩写；正式场合更常见的写法是 “B.S. in Industrial Management” 或 “BS in Industrial Management”。","不同学校对专业名称可能略有差异：有的叫 Industrial Management，有的叫 Industrial Engineering Management、Operations Management 等；填写申请/简历时最好以毕业证或学校官方英文名为准。"]}
{"word":"BSIR","summary":{"en":"“BSIR” is an initialism, and its exact meaning depends on context.","zh":"“BSIR”是字母缩写，确切含义需要结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation (initialism) for several different terms; its meaning depends on the field or document where you saw it.","zh":"一个缩写（字母缩略词）；具体含义取决于你看到它的领域或文件语境。"},"examples":[{"en":"In the email, “BSIR” is used as a project name, so you need the full title to know what it stands for.","zh":"在邮件里，“BSIR”被当作项目名使用，所以需要全称才能确定它代表什么。"},{"en":"Can you tell me what “BSIR” stands for in your report?","zh":"你能告诉我在你的报告里“BSIR”代表什么全称吗？"}]}],"synonyms":["initialism","abbreviation","acronym"],"phonetic":"/ˌbiː ɛs aɪ ˈɑr/","extraExplanation":["“BSIR”不是一个单一、全球通用的固定缩写，在不同组织/行业里可能代表不同词组（例如某些报告名称、机构名称、项目代号等）。如果你把它出现的句子、行业（如金融/医疗/教育/政府文件）或截图发来，我可以根据语境帮你锁定最可能的全称与准确译法。"]}
{"word":"BSIT","summary":{"en":"BSIT usually means “Bachelor of Science in Information Technology.”","zh":"BSIT通常指“信息技术理学学士（Bachelor of Science in Information Technology）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Bachelor of Science in Information Technology (an undergraduate degree focused on computers, networks, software systems, and practical IT skills).","zh":"信息技术理学学士（本科专业/学位，侧重计算机、网络、软件系统与实用IT技能）。"},"examples":[{"en":"She is studying for a BSIT to become a network administrator.","zh":"她在读BSIT（信息技术理学学士），想成为网络管理员。"},{"en":"Many schools offer BSIT programs with courses in programming, databases, and cybersecurity.","zh":"很多学校开设BSIT项目，课程包括编程、数据库和网络安全。"}]}],"synonyms":["Bachelor of Science in Information Technology","IT degree","Information Technology (major)"],"phonetic":"/ˌbiː ɛs aɪ ˈtiː/","extraExplanation":["BSIT通常写在简历或学历栏里，表示“学位名称”，常见于菲律宾等国家/地区的高校；在不同学校可能细分方向（如网络、软件开发、信息安全等）。","读作字母：B-S-I-T。也有人会把它当作一个整体简称来快速念。"]}
{"word":"BSJ","summary":{"en":"BSJ is an acronym/initialism with multiple possible meanings; you need context to know what it stands for.","zh":"BSJ 是一个可能有多种含义的缩写；需要结合上下文才能确定具体指什么。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation (initialism) for several different phrases; its meaning depends on the context (organization, school, online community, etc.).","zh":"一个缩写（首字母缩略词），可能对应多种不同含义；具体意思取决于使用场景（机构、学校、网络社群等）。"},"examples":[{"en":"What does BSJ stand for in this email?","zh":"这封邮件里的 BSJ 是什么意思？"},{"en":"In our company, BSJ refers to an internal project name.","zh":"在我们公司，BSJ 指的是一个内部项目代号。"}]},{"partOfSpeech":"other","definition":{"en":"BSJ can refer to a publication name, such as a journal or magazine whose title is abbreviated as BSJ (the exact title varies).","zh":"BSJ 也可能指某本刊物（期刊/杂志）的简称（具体全称因场景而异）。"},"examples":[{"en":"I found the article in BSJ, but I need the journal’s full name for my citation.","zh":"我在 BSJ 里找到了那篇文章，但引用时需要写出期刊全称。"}]},{"partOfSpeech":"other","definition":{"en":"In online chat, BSJ may be used as a community-specific shorthand (for example, a forum name or group label).","zh":"在网络聊天中，BSJ 可能是某个圈子内部的简写（例如论坛名或群组标签）。"},"examples":[{"en":"Are you in the BSJ group on Discord?","zh":"你在 Discord 的 BSJ 群里吗？"}]}],"synonyms":["acronym","initialism","abbreviation"],"phonetic":"/ˌbiː ɛs ˈdʒeɪ/","extraExplanation":["“BSJ”属于首字母缩写（initialism），通常需要靠上下文确定：它出现在哪里（学校/公司/论文/社交媒体）以及周围的词（比如 journal, project, club）很关键。","如果你把它当作“拼读字母”来读，常见读法是逐个字母读：B-S-J（而不是当作一个单词连读）。","如果你告诉我 BSJ 出现的句子或领域（例如医学、商业、游戏、学校），我可以更准确地判断它最可能的全称。"]}
{"word":"bskt","summary":{"en":"“bskt” is a nonstandard abbreviation for “basket,” sometimes used in notes, labels, or finance to mean a group of items.","zh":"“bskt”是“basket”的非标准缩写，常用于笔记/标签等；在金融语境中也可指“一组打包处理的项目”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an informal abbreviation (often in notes, labels, or product codes) for “basket.”","zh":"“basket（篮子/筐）”的非正式缩写，常见于笔记、标签或产品编码中。"},"examples":[{"en":"Put the clean towels in the bskt.","zh":"把干净的毛巾放进篮子（bskt）里。"},{"en":"The file name says “laundry_bskt.”","zh":"文件名写着“laundry_bskt（洗衣篮）”。"}]},{"partOfSpeech":"other","definition":{"en":"(finance/business) short for “basket,” meaning a group of items treated together (for example, a basket of stocks).","zh":"（金融/商业）“basket”的缩写，指“打包在一起处理的一组东西”（如“一篮子股票”）。"},"examples":[{"en":"This ETF tracks a bskt of technology companies.","zh":"这只ETF跟踪一篮子（bskt）科技公司。"},{"en":"They priced the product as a bskt rather than item by item.","zh":"他们把产品按“组合（bskt）”定价，而不是逐件定价。"}]}],"synonyms":["basket","hamper (for laundry)","bin","crate (context-dependent)"],"phonetic":"/ˈbæskɪt/","extraExplanation":["“bskt”不是标准拼写，更像是速记/缩写。正式写作、考试或公开场合建议写完整的“basket”。","在零售、仓储、文件命名里，人们常用去掉元音的方式做缩写（如“bskt”“bkst”），目的是省空间和加快记录。"]}
{"word":"BSL","summary":{"en":"BSL most commonly means British Sign Language or biosafety level, depending on context.","zh":"BSL 最常见的意思是“英国手语”或“生物安全等级”，需根据语境判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"British Sign Language; the main sign language used in the United Kingdom.","zh":"英国手语；英国最主要的手语语言。"},"examples":[{"en":"She is learning BSL to communicate with her deaf classmates.","zh":"她正在学习 BSL，以便和聋人同学交流。"},{"en":"The museum offers tours in BSL on weekends.","zh":"这家博物馆周末提供 BSL 手语导览。"}]},{"partOfSpeech":"n.","definition":{"en":"biosafety level; a ranking (BSL-1 to BSL-4) that describes how strictly a laboratory must control biological hazards.","zh":"生物安全等级；用于描述实验室需要多严格地管控生物危害的分级（BSL-1 到 BSL-4）。"},"examples":[{"en":"They handle this virus in a BSL-3 laboratory.","zh":"他们在 BSL-3 实验室处理这种病毒。"},{"en":"BSL-2 requires specific safety training and protective equipment.","zh":"BSL-2 要求特定的安全培训和防护装备。"}]}],"synonyms":["British Sign Language","biosafety level","BSL-1","BSL-2","BSL-3","BSL-4"],"phonetic":"/ˌbiː ɛs ˈɛl/","extraExplanation":["“BSL”在不同领域含义差异很大：在英国语境或无障碍沟通话题里，最常指 British Sign Language；在生物/医学研究与公共卫生语境里，常指 biosafety level，并常写作“BSL-2 / BSL-3”等。","书写时通常用全大写“BSL”。如果在对话或文章里不确定含义，最好根据上下文（英国/手语 vs. 实验室/病原体/安全规范）判断或直接问清楚。"]}
{"word":"BSLabRel","summary":{"en":"“BSLabRel” is likely a specialized acronym/label rather than a common English word; its meaning depends on context.","zh":"“BSLabRel”更可能是特定场景下的缩写/标签，而不是常见英语单词；具体含义取决于上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An unclear term or acronym; it is not a standard English word in common dictionaries. It may be a project name, file/folder label, software module, or an abbreviation used within a specific organization or class.","zh":"一个不明确的词或缩写；它不是常见词典里的标准英语词。它可能是项目名称、文件/文件夹标签、软件模块名，或某个组织/课程内部使用的缩写。"},"examples":[{"en":"I found “BSLabRel” in the codebase, but I can’t tell what it stands for without more context.","zh":"我在代码库里看到“BSLabRel”，但没有更多上下文就无法判断它代表什么。"},{"en":"Could you share the sentence or screenshot where “BSLabRel” appears?","zh":"你能把“BSLabRel”出现的句子或截图发我吗？"}]}],"phonetic":"/ˌbiː ɛs ˌlæb ˈrɛl/","extraExplanation":["从构词看，它像是由多个缩写拼在一起：BS + Lab + Rel。Lab 常见含义是“实验室”，Rel 常见含义是“关系/关联（relation）”或“发布版（release）”。BS 可能有很多来源（如 Bachelor of Science 理学学士、业务/部门缩写等）。如果你提供：它出现的完整句子、所属领域（课程/实验室/软件/公司）、以及它附近的其他缩写或文件名，我可以更准确地还原其含义并给出更贴近场景的用法。"]}
{"word":"BSLArch","summary":{"en":"“BSLArch” is a context-dependent abbreviation, often meaning “BSL architecture,” but it isn’t a standard word.","zh":"“BSLArch”是依语境而定的缩写，常指“BSL 架构”，但并非标准单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An informal abbreviation (not a standard dictionary word). It usually appears as a project name, file/folder label, or username; its exact meaning depends on the field or community using it.","zh":"一种非标准词典词汇的缩写/命名，常见于项目名、文件/文件夹名或用户名；具体含义高度依赖使用场景。"},"examples":[{"en":"I found a folder called “BSLArch” in the codebase, but the README doesn’t explain what it stands for.","zh":"我在代码库里发现一个叫“BSLArch”的文件夹，但 README 没有说明它代表什么。"},{"en":"Ask the author what “BSLArch” means in this project before renaming it.","zh":"在重命名之前，先问清楚作者在这个项目里“BSLArch”是什么意思。"}]},{"partOfSpeech":"other","definition":{"en":"In some technical contexts, it may be shorthand for something like “BSL architecture” (i.e., the architecture/design of a system whose name starts with BSL).","zh":"在某些技术语境中，它可能是“BSL architecture（BSL 架构/体系结构）”的简写，即某个名为 BSL 的系统/模块的架构设计。"},"examples":[{"en":"The document describes the BSLArch used for authentication and logging.","zh":"这份文档描述了用于身份验证和日志记录的 BSLArch（BSL 架构）。"},{"en":"We need to review the BSLArch diagram before the release.","zh":"发布前我们需要评审 BSLArch 架构图。"}]}],"synonyms":["abbreviation","acronym","project name","label"],"phonetic":"/bi ɛs ɛl ɑrtʃ/","extraExplanation":["“BSLArch”本身不是常见英文单词，更像是缩写/项目命名。BSL 可能在不同领域代表不同事物（例如 British Sign Language、某个库/模块名等），而 Arch 常见含义是 architecture（架构）或 archive（档案/存档）。如果你能提供它出现的上下文（行业、句子、文件名/仓库链接、全称线索），我可以更准确地解释。"]}
{"word":"BSLM","summary":{"en":"BSLM is a context-dependent abbreviation, often a degree title (e.g., Bachelor of Science in Leadership and Management).","zh":"BSLM是一个依语境而定的缩写，常见用法是某种学位名称（如领导力与管理理学学士）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation used for different things depending on context (most commonly a degree title such as “Bachelor of Science in Leadership and Management”).","zh":"一个缩写，具体含义取决于语境（最常见的是学位名称，如“领导力与管理理学学士”）。"},"examples":[{"en":"She completed a BSLM and then applied for management roles.","zh":"她完成了BSLM学位，之后申请了管理岗位。"},{"en":"BSLM appears on his résumé under Education.","zh":"在他的简历“教育背景”一栏里出现了BSLM。"}]},{"partOfSpeech":"other","definition":{"en":"In business/IT contexts, sometimes used as shorthand for a program, department, or process name; the exact meaning must be confirmed from the organization’s documents.","zh":"在商业/IT语境中，有时用作某个项目、部门或流程名称的简称；具体含义需要根据组织文件确认。"},"examples":[{"en":"Ask the team what BSLM stands for in this project.","zh":"问问团队在这个项目里BSLM代表什么。"},{"en":"The report references BSLM, but it doesn’t define the acronym.","zh":"报告提到了BSLM，但没有解释这个缩写。"}]}],"synonyms":["acronym","abbreviation"],"phonetic":"/ˌbiː ɛs ɛl ˈɛm/","extraExplanation":["“BSLM”不是一个在英语里人人都懂的固定缩写，最稳妥的做法是结合场景判断：如果出现在简历/学历里，常见是某种学位名称；如果出现在公司文档/项目说明里，可能是内部缩写。","如果你告诉我它出现的场景（例如学校、行业、句子），我可以帮你锁定最可能的全称与用法。"]}
{"word":"BSLS","summary":{"en":"BSLS is an abbreviation; its exact meaning depends on context.","zh":"BSLS 是一个缩写；确切含义需要结合上下文判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation (acronym/initialism). Depending on the field, it can mean different things (for example, a school degree/program name, an organization name, or a technical term).","zh":"一个缩写（首字母缩略词/字母缩写）。具体含义取决于使用领域（例如学位/专业名称、机构名称或技术术语）。"},"examples":[{"en":"What does BSLS stand for in this document?","zh":"在这份文件里，BSLS 代表什么？"},{"en":"Please write the full name the first time you use “BSLS.”","zh":"第一次使用“BSLS”时请先写出全称。"}]}],"synonyms":["abbreviation","initialism","acronym"],"phonetic":"/biː ɛs ɛl ɛs/","extraExplanation":["“BSLS”在不同场景里可能对应不同全称；如果你能提供一句原文（例如邮件、课程名称、报告标题、聊天内容），我可以帮你锁定最可能的意思并给出更准确的解释与用法。"]}
{"word":"BSM","summary":{"en":"“BSM” is an initialism with different meanings depending on context, commonly “beats me,” “big smile,” or the finance term “Black–Scholes–Merton model.”","zh":"“BSM”是首字母缩写，含义因语境而异，常见为“beats me（我不知道）”“big smile（大大的微笑）”，或金融术语“Black–Scholes–Merton模型”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an initialism used online to mean “beats me” (I don’t know).","zh":"网络缩写，表示“我也不知道 / 不清楚”。"},"examples":[{"en":"A: Who took my charger? B: BSM.","zh":"A：谁拿了我的充电器？B：BSM（我也不知道）。"},{"en":"BSM—no one told me what time the meeting starts.","zh":"BSM——没人告诉我会议几点开始。"}]},{"partOfSpeech":"other","definition":{"en":"an initialism used online to mean “big smile.”","zh":"网络缩写，表示“灿烂的笑 / 大大的微笑”。"},"examples":[{"en":"Thanks for helping today, BSM!","zh":"谢谢你今天帮忙，BSM！（大大的微笑）"},{"en":"I got the job offer—BSM!","zh":"我拿到工作offer了——BSM！（笑得很开心）"}]},{"partOfSpeech":"other","definition":{"en":"short for the “Black–Scholes–Merton model,” a well-known finance model used to estimate option prices.","zh":"“Black–Scholes–Merton（布莱克–斯科尔斯–默顿）期权定价模型”的缩写，用于估算期权价格。"},"examples":[{"en":"We used the BSM model to price the call option.","zh":"我们用BSM模型来给看涨期权定价。"},{"en":"The BSM model assumes constant volatility and interest rates.","zh":"BSM模型通常假设波动率和利率是恒定的。"}]}],"synonyms":["IDK","beats me","big smile","Black–Scholes–Merton model"],"phonetic":"biː ɛs ɛm","extraExplanation":["“BSM”是首字母缩写（initialism），常见于聊天、社交媒体和专业领域。因为可能有多种含义，最好结合上下文判断：\n- 出现在对“谁/什么时候/怎么回事？”这类问题的回答里，常是“beats me（我不知道）”。\n- 出现在表达开心、友好语气的句末，可能是“big smile（大大的微笑）”。\n- 出现在金融、期权、定价、volatility（波动率）等语境里，通常指“Black–Scholes–Merton model”。\n如果你告诉我它出现的句子/场景，我可以帮你确定最可能的意思。"]}
{"word":"BSME","summary":{"en":"BSME usually means Bachelor of Science in Mechanical Engineering.","zh":"BSME 通常指“机械工程理学学士”（Bachelor of Science in Mechanical Engineering）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bachelor of Science in Mechanical Engineering (an undergraduate degree in mechanical engineering).","zh":"机械工程理学学士（机械工程专业的本科学位）。"},"examples":[{"en":"She earned her BSME and then started working at an automotive company.","zh":"她获得了机械工程理学学士学位（BSME），随后进入一家汽车公司工作。"},{"en":"The job posting says a BSME or equivalent degree is required.","zh":"招聘信息写明需要机械工程理学学士（BSME）或同等学历。"}]}],"synonyms":["B.S. in Mechanical Engineering","BS Mechanical Engineering","Bachelor of Science in Mechanical Engineering"],"phonetic":"/ˌbiː ɛs ˌɛm ˈiː/","extraExplanation":["BSME 常见于英文简历（resume/CV）、LinkedIn 个人资料和学校项目介绍中，用来简写学位名称；正式写作或第一次出现时，通常写全称 Bachelor of Science in Mechanical Engineering，后面括号注明（BSME）。","在不同学校或国家，类似写法还可能见到 B.S. in Mechanical Engineering 或 BS Mechanical Engineering；含义基本相同。"]}
{"word":"BSMedTech","summary":{"en":"BSMedTech = B.S. MedTech, a Bachelor of Science program in Medical Technology/Medical Laboratory Science.","zh":"BSMedTech = 医学检验技术/医学检验科学方向的理学学士项目（B.S. MedTech）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation for “B.S. MedTech,” meaning a Bachelor of Science degree program in Medical Technology (often also called Medical Laboratory Science).","zh":"“B.S. MedTech”的缩写，指“医学检验技术/医学检验科学”方向的理学学士学位课程（在一些地区也常称为“医学实验室科学”）。"},"examples":[{"en":"She finished BSMedTech and now works in a hospital laboratory.","zh":"她读完了BSMedTech，现在在医院检验科工作。"},{"en":"I’m applying to the BSMedTech program next semester.","zh":"我打算下学期申请BSMedTech项目。"}]}],"synonyms":["BS MedTech","BSMT","B.S. in Medical Technology","Medical Laboratory Science (MLS)"],"phonetic":"/ˌbiːˈɛs mɛd tɛk/","extraExplanation":["“BSMedTech”在不同国家/学校的写法可能不同：常见还有“BS MedTech”“BSMT”“B.S. in Medical Technology”。有些学校把该专业更名或对应为“Medical Laboratory Science (MLS)”。","该专业通常学习临床检验相关课程（如血液学、临床化学、微生物学、免疫学等），毕业后常在医院或诊断实验室从事检验工作；具体执业资格与证照要求因国家/地区而异。"]}
{"word":"BSMET","summary":{"en":"BSMET = Bachelor of Science in Marine Engineering Technology.","zh":"BSMET＝海事/船舶工程技术理学士（学位/专业）的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Bachelor of Science in Marine Engineering Technology,” a college degree program focused on marine engines, ship machinery, and shipboard engineering systems.","zh":"“Bachelor of Science in Marine Engineering Technology”的缩写，指“海事/船舶工程技术理学士”学位课程，主要学习船舶发动机、轮机与船舶工程系统等内容。"},"examples":[{"en":"He is taking BSMET and hopes to work as a marine engineer after graduation.","zh":"他在读BSMET，希望毕业后当一名轮机/海事工程师。"},{"en":"The school offers BSMET with onboard training as part of the program.","zh":"这所学校开设BSMET，并把上船实习纳入课程的一部分。"}]}],"synonyms":["B.S. in Marine Engineering Technology","Marine Engineering Technology (degree program)"],"phonetic":"/ˌbiː ɛs ɛm iː ˈtiː/","extraExplanation":["BSMET在一些国家与地区（例如菲律宾）较常见，常出现在大学专业、简历、证书与海事培训相关文件中。","注意：不同学校或国家可能把BSMET解释为其他相近专业名称；遇到不确定时，最好查看学校官网的全称（full form）。"]}
{"word":"BSMet","summary":{"en":"BSMet is most commonly an abbreviation for a Bachelor of Science in Mechanical Engineering Technology, but its exact meaning can vary by institution.","zh":"BSMet最常见是“机械工程技术理学士”的缩写，但具体含义可能因学校或语境而异。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbreviation) Bachelor of Science in Mechanical Engineering Technology (a university degree focused on applied mechanical engineering and hands-on technical skills).","zh":"（缩写）机械工程技术理学士（一个偏应用、强调实践与工程技术技能的大学学位）。"},"examples":[{"en":"She earned a BSMet and now works as a manufacturing engineer.","zh":"她取得了BSMet学位，现在担任制造工程师。"},{"en":"The job posting said a BSMet or similar engineering degree was preferred.","zh":"招聘信息写明优先考虑BSMet或类似的工程类学位。"}]},{"partOfSpeech":"other","definition":{"en":"(abbreviation, less common/varies by school) Used in some contexts as a short form for other ‘B.S. in …’ majors (for example, meteorology or metallurgy), depending on the institution’s naming system.","zh":"（缩写；较少见/因学校而异）在某些语境中也可能被用作其他“理学士（B.S.）专业”的简写（例如气象学或冶金学等），取决于学校的命名方式。"},"examples":[{"en":"On his résumé, BSMet referred to his meteorology degree from that university.","zh":"在他的简历里，BSMet指的是他在那所大学获得的气象学学位。"},{"en":"If you’re unsure what BSMet means, ask which major the abbreviation stands for.","zh":"如果不确定BSMet是什么意思，可以问清它具体代表哪个专业。"}]}],"synonyms":["BSMET","B.S. in Mechanical Engineering Technology","Bachelor of Science (abbr.)"],"phonetic":"ˌbiːˈes mɛt","extraExplanation":["“BSMet”不是一个固定、全球通用的标准缩写，更像是学校、行业或个人在简历/课程表里使用的简写。最稳妥的做法是结合上下文（学校名称、院系、职位描述）来判断。","写简历或证书信息时，如果担心别人看不懂，建议第一次出现写全称（如 Bachelor of Science in Mechanical Engineering Technology），后面再用缩写。"]}
{"word":"BSMetE","summary":{"en":"BSMetE = Bachelor of Science in Metallurgical Engineering.","zh":"BSMetE = 冶金工程理学士。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abbreviation for “Bachelor of Science in Metallurgical Engineering,” an undergraduate degree focused on metals and materials (how they are made, processed, and used).","zh":"“冶金工程理学士”（Bachelor of Science in Metallurgical Engineering）的缩写，指以金属与材料为核心的本科理工学位（研究金属材料的制备、加工与应用等）。"},"examples":[{"en":"She earned a BSMetE and now works in steel production.","zh":"她获得了冶金工程理学士学位（BSMetE），现在在钢铁生产行业工作。"},{"en":"BSMetE (2019), University of Arizona","zh":"BSMetE（2019），亚利桑那大学"}]}],"synonyms":["B.S. in Metallurgical Engineering","Bachelor’s in Metallurgical Engineering","BS in Metallurgical Engineering"],"phonetic":"/ˌbiː ˌɛs ˈmɛt ˌiː/","extraExplanation":["BSMetE 多见于英文简历、领英（LinkedIn）、毕业证书列表或学校项目名称中；在正式写作里也常写作 “B.S. in Metallurgical Engineering”。","Metallurgical Engineering（冶金工程）常与 Materials Science/Engineering（材料科学与工程）有交叉；有些学校会把专业名称设为 “Metallurgical and Materials Engineering”。"]}
{"word":"BSMin","summary":{"en":"BSMin is usually an academic abbreviation meaning “Bachelor of Science in Mining,” though the exact expansion can vary by institution.","zh":"BSMin通常是学位缩写，常指“采矿相关的理学学士（Bachelor of Science in Mining）”，但各机构的具体写法可能不同。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation used by some schools/programs for “Bachelor of Science in Mining” (an undergraduate degree focused on mining engineering and mineral resource extraction)","zh":"（部分学校/项目使用的）“采矿学理学学士/采矿相关理学学士”的缩写（本科阶段，侧重采矿工程与矿产资源开采）"},"examples":[{"en":"He earned a BSMin and then joined a mining company as a graduate trainee.","zh":"他拿到了BSMin学位，之后以管培生身份进入了一家矿业公司。"},{"en":"The department lists BSMin, MS, and PhD programs on its website.","zh":"该系官网列出了BSMin、硕士和博士项目。"}]},{"partOfSpeech":"other","definition":{"en":"(less common) a program- or institution-specific abbreviation that may refer to a Bachelor of Science with a “mining/mineral(s)” specialization; exact meaning depends on context","zh":"（较不常见）某些机构自定义的缩写，可能指“理学学士（采矿/矿物方向）”；具体含义需结合语境确认"},"examples":[{"en":"On some transcripts, BSMin appears as a shortened label for the major.","zh":"在一些成绩单上，BSMin会作为专业名称的缩写出现。"}]}],"synonyms":["B.S. in Mining","Bachelor of Science (Mining)","BSc Mining"],"phonetic":"/ˌbiː ɛs ˈmɪn/","extraExplanation":["“BS”常见于英美学位缩写中，表示Bachelor of Science（理学学士）。后面的“Min”在某些学校语境里可能指Mining（采矿）或Mineral(s)（矿物/矿产）方向。不同学校缩写规则不完全一致；如果你是在简历、成绩单或课程目录里看到BSMin，最好同时核对该校的专业全称或项目说明。"]}
{"word":"BSMT","summary":{"en":"BSMT is an abbreviation most commonly meaning Bachelor of Science in Marine Transportation; in some contexts it can also mean Bachelor of Science in Medical Technology.","zh":"BSMT是一个缩写，最常见指海事运输理学学士；在某些语境下也可指医学检验（医学技术）理学学士。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) Bachelor of Science in Marine Transportation (an undergraduate degree focused on navigation, ship operations, and maritime management).","zh":"（缩写）海事运输理学学士（本科专业，侧重航海、船舶运营与海事管理）。"},"examples":[{"en":"She earned her BSMT and became a deck officer after passing the required exams.","zh":"她获得了BSMT学位，并在通过相关考试后成为甲板官。"},{"en":"The academy offers BSMT with courses in navigation, cargo handling, and seamanship.","zh":"这所学院开设BSMT，课程包括航海、货物装卸与船艺等。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev., less common) Bachelor of Science in Medical Technology (an undergraduate degree related to clinical laboratory science).","zh":"（缩写，较少见）医学检验（或医学技术）理学学士（与临床实验室科学相关的本科专业）。"},"examples":[{"en":"He listed BSMT on his resume and applied for hospital lab positions.","zh":"他在简历上写了BSMT，并申请了医院检验科的岗位。"},{"en":"After completing her BSMT, she trained in blood testing and microbiology.","zh":"完成BSMT后，她接受了血液检测和微生物学方面的培训。"}]}],"synonyms":["B.S. in Marine Transportation","B.S. Marine Transportation","B.S. in Medical Technology","B.S. Medical Technology"],"phonetic":"/ˌbiːˌɛsˌɛmˌtiː/","extraExplanation":["“BSMT”通常作为缩写出现在学校项目名称、简历、证书或招生简章中。不同国家/学校可能指不同专业：在海事院校里多指Marine Transportation；在医疗相关院校里也可能指Medical Technology。阅读时最好结合上下文（如“academy/ship/navigation”或“hospital/lab/clinical”）判断。","读法一般是逐个字母读：B-S-M-T。"]}
{"word":"BSMTP","summary":{"en":"BSMTP means Batch Simple Mail Transfer Protocol—SMTP done via batch/file processing rather than a live connection.","zh":"BSMTP 指“批处理简单邮件传输协议”——用批处理/文件方式执行 SMTP，而非实时连接传输。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Batch Simple Mail Transfer Protocol: a way to send email by writing SMTP commands into a batch/file (often for store-and-forward systems) instead of using a live network connection.","zh":"批处理简单邮件传输协议：把 SMTP 命令写进批处理/文件中（常用于“存储-转发”式系统），而不是通过实时网络连接来发送邮件。"},"examples":[{"en":"In early mail gateways, BSMTP files were exchanged and then processed to deliver messages.","zh":"在早期的邮件网关中，人们会交换 BSMTP 文件，然后再处理这些文件来投递邮件。"},{"en":"This tool can export messages as BSMTP for offline transfer to another server.","zh":"这个工具可以把邮件导出为 BSMTP，用于离线传输到另一台服务器。"}]}],"synonyms":["SMTP","ESMTP","LMTP","UUCP"],"phonetic":"bi ɛs ɛm ti pi","extraExplanation":["BSMTP 通常按字母读（B-S-M-T-P），在今天的互联网邮件系统里不常见；现代邮件多用在线的 SMTP/ESMTP 直接投递。","它常和早期的拨号、UUCP 等“间歇性连接”环境相关：先把要发送的邮件“排队写成文件”，等到有机会连接时再统一传输/处理。"]}
{"word":"BSMusEd","summary":{"en":"BSMusEd is an abbreviation for “Bachelor of Science in Music Education.”","zh":"BSMusEd是“Bachelor of Science in Music Education（音乐教育理学学士）”的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Bachelor of Science in Music Education (an academic degree focused on training students to become music teachers, usually for K–12 schools).","zh":"音乐教育理学学士（一个以培养音乐教师为主的学位，通常面向中小学K–12教学）。"},"examples":[{"en":"She is applying to a BSMusEd program because she wants to teach choir in high school.","zh":"她正在申请BSMusEd项目，因为她想在高中教合唱。"},{"en":"After finishing his BSMusEd, he completed student teaching and earned his teaching license.","zh":"他完成BSMusEd后，参加了教育实习并获得了教师资格证。"}]}],"synonyms":["Bachelor of Science in Music Education","B.S. in Music Education","BME (varies by school)"],"phonetic":"/ˌbiː ɛs ˈmjuːz ɛd/","extraExplanation":["在美国高校里，BSMusEd常见于“音乐教育”本科项目名称中：B.S. 强调“理学”取向，但课程通常仍会包含大量音乐技能训练（如主修乐器/声乐、乐理、视唱练耳、合奏）以及教育学课程（如教学法、课堂管理、教育心理）。","不同学校缩写可能不同：有的写作 B.M.E.（Bachelor of Music Education）或 B.M. in Music Education。是否属于 B.S. 或 B.M. 多与学校学位设置传统有关，实际培养目标常相近。"]}
{"word":"BSN","summary":{"en":"BSN most commonly means “Bachelor of Science in Nursing,” a nursing bachelor’s degree.","zh":"BSN最常见的意思是“护理学理学士”，即护理专业的本科学位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bachelor of Science in Nursing (a university degree that prepares someone to become a registered nurse).","zh":"护理学理学士（大学本科学位，培养成为注册护士的专业学位）。"},"examples":[{"en":"She earned her BSN and then started working in a hospital ICU.","zh":"她拿到护理学理学士（BSN）后，就去医院重症监护室工作了。"},{"en":"Many hospitals prefer to hire nurses with a BSN.","zh":"许多医院更倾向于招聘拥有BSN学位的护士。"},{"en":"After my BSN, I’m planning to take the NCLEX-RN exam.","zh":"我完成BSN后，计划参加NCLEX-RN注册护士考试。"}]},{"partOfSpeech":"other","definition":{"en":"(Less common) An abbreviation used in some fields for other phrases (its meaning depends on the context).","zh":"（不太常见）在不同领域中可能代表其他短语的缩写（具体含义取决于语境）。"},"examples":[{"en":"In this document, BSN refers to the company’s internal system name, not a nursing degree.","zh":"在这份文件里，BSN指的是公司内部系统名称，而不是护理学位。"}]}],"synonyms":["Bachelor of Science in Nursing","nursing bachelor’s degree","nursing degree (bachelor’s)"],"phonetic":"/ˌbiː ɛs ˈɛn/","extraExplanation":["BSN在美国医疗体系里非常常见，通常与RN（registered nurse，注册护士）一起出现：很多人先读BSN，再通过NCLEX-RN考试成为RN。","不同国家/地区的护理学位名称不完全一样：有的地方也会用BSN或类似的本科护理学位缩写，但具体要求和学制可能不同。"]}
{"word":"BSNA","summary":{"en":"BSNA is an initialism whose meaning depends on context; it may refer to a specific school/organization or a student nurses’ association.","zh":"BSNA 是一个首字母缩写，具体含义取决于语境；可能指某所学校/机构，或某地的学生护士协会。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation that most commonly refers to the British School of New York (often written as “BSNY”); in some contexts “BSNA” may be used informally to mean the school’s New York campus/association—check the organization’s official name in your document.","zh":"一个缩写，常见与“纽约英国学校”（更常写作 BSNY）相关；在某些语境里也可能有人非正式地用“BSNA”指该校在纽约的校区/相关机构——具体含义需以文件或机构官方写法为准。"},"examples":[{"en":"She transferred to BSNA for her final year in New York.","zh":"她最后一年转到 BSNA（纽约的那所英国学校/相关机构）就读。"},{"en":"The email signature says “BSNA Admissions,” so it likely refers to a school office.","zh":"邮件落款写着“BSNA 招生办公室”，所以很可能指学校部门。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation used in some countries for a student nursing organization (e.g., “Student Nurses’ Association” with a country name), depending on local naming conventions.","zh":"在一些国家里可用作“学生护士协会”（Student Nurses’ Association，通常再加国家/地区名）的缩写，具体取决于当地命名习惯。"},"examples":[{"en":"BSNA is hosting a workshop on clinical skills this weekend.","zh":"BSNA 这周末要举办一次临床技能工作坊。"},{"en":"I joined BSNA to meet other nursing students and find volunteer opportunities.","zh":"我加入了 BSNA，想认识更多护理学生并寻找志愿机会。"}]},{"partOfSpeech":"other","definition":{"en":"a less common abbreviation in academic or workplace contexts that can vary by field (for example, it may be used for specific programs, departments, or internal project names).","zh":"在学术或职场语境中较不常见、且会因领域而异的缩写（例如某些特定项目、部门或内部项目代号）。"},"examples":[{"en":"In this report, BSNA is defined on the first page, so follow that meaning throughout.","zh":"这份报告第一页已经定义了 BSNA，所以全文都应按那个含义来理解。"}]}],"synonyms":["initialism","abbreviation","acronym (general term)"],"phonetic":"/ˌbiː ɛs ˌɛn ˈeɪ/","extraExplanation":["“BSNA”是典型的首字母缩写（initialism），不同机构/行业可能会重复使用同一组字母，因此最可靠的方法是：看它是否在正文第一次出现时被括号解释（例如：BSNA = …），或查看名片/邮件签名/官网上的全称。","读法通常按字母逐个读：B-S-N-A。"]}
{"word":"BSO","summary":{"en":"“BSO” is an abbreviation with several meanings; most commonly it refers to the Boston Symphony Orchestra, but it can also mean a broadcasting standards office or a business services organization depending on context.","zh":"“BSO”是一个多义缩写；最常见指波士顿交响乐团，也可能指广播标准机构或业务服务组织，需结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) Boston Symphony Orchestra: a major professional orchestra based in Boston, Massachusetts.","zh":"（缩写）波士顿交响乐团：美国马萨诸塞州波士顿的著名职业交响乐团。"},"examples":[{"en":"I’m going to a BSO concert this weekend.","zh":"我这周末要去听波士顿交响乐团（BSO）的音乐会。"},{"en":"The BSO is well known for its performances at Symphony Hall.","zh":"BSO 以在交响音乐厅（Symphony Hall）的演出而闻名。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev.) Broadcasting Standards Office: an organization (name used in some regions) that handles complaints and standards for broadcasting content.","zh":"（缩写）广播标准办公室：在一些地区使用的机构名称，负责处理广播内容的规范与投诉。"},"examples":[{"en":"The complaint was sent to the BSO for review.","zh":"这项投诉已提交给 BSO 进行审查。"},{"en":"The station said it follows BSO guidelines.","zh":"该电台表示它遵循 BSO 的相关规范。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev., business) Business Service(s) Organization: a company/department that provides shared services such as HR, IT, or finance.","zh":"（缩写，商业）业务服务组织：为人力、信息技术或财务等提供共享服务的公司或部门。"},"examples":[{"en":"Our BSO supports payroll and IT for all offices.","zh":"我们的 BSO 为所有办公室提供薪资与 IT 支持。"},{"en":"They moved customer support into the BSO to reduce costs.","zh":"他们把客服并入 BSO 以降低成本。"}]}],"phonetic":"/ˌbiː ɛs ˈoʊ/","extraExplanation":["“BSO”是缩写，具体含义高度依赖语境。最常见的一种用法是在音乐领域指 Boston Symphony Orchestra（波士顿交响乐团）。","如果你能告诉我它出现的场景（音乐会海报、新闻、公司文件、聊天内容等），我可以帮你确定最准确的释义与对应表达。"]}
{"word":"BSOC","summary":{"en":"BSOC is an abbreviation; it most often refers to a Basic Safety Orientation Course, but it can also mean an operations center in business contexts.","zh":"BSOC 是缩写；最常见指“基础安全入门课程”，也可能在企业语境中指某种“运营中心/共享服务中心”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation that can mean different things depending on the field; commonly used for “Basic Safety Orientation Course” (a safety training course, especially in maritime/industrial contexts).","zh":"一个在不同领域含义不同的缩写；常见用法是指“Basic Safety Orientation Course（基础安全入门课程）”，多见于海事或工业安全培训语境。"},"examples":[{"en":"I need to complete the BSOC before I can start work on the vessel.","zh":"我需要完成 BSOC 才能开始在船上工作。"},{"en":"The company requires BSOC training for all new hires in high-risk areas.","zh":"公司要求所有在高风险岗位的新员工完成 BSOC 安全培训。"}]},{"partOfSpeech":"other","definition":{"en":"less commonly, an abbreviation for “Business/Shared Services Operations Center” (a centralized team that handles operations or support services).","zh":"较少见的含义：指“Business/Shared Services Operations Center（业务/共享服务运营中心）”，即集中处理运营或支持服务的团队/部门。"},"examples":[{"en":"Payroll issues are handled by the BSOC, not the local office.","zh":"工资相关问题由 BSOC 处理，不是由当地办公室处理。"}]}],"synonyms":["Basic Safety Orientation Course (when used in training contexts)","Operations center (when used in business contexts)"],"phonetic":"/ˌbiː ɛs oʊ ˈsiː/","extraExplanation":["“BSOC”不是一个只有单一标准含义的词，通常需要结合行业（海事/安全培训/企业运营等）来判断。你如果告诉我你在哪个场景看到（邮件、课程名称、公司部门、证书等），我可以帮你锁定最准确的解释。"]}
{"word":"BSocSc","summary":{"en":"BSocSc is an abbreviation for a Bachelor of Social Science(s), an undergraduate degree in social science subjects.","zh":"BSocSc 是 Bachelor of Social Science(s)（社会科学学士）的缩写，指社会科学相关领域的本科学位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bachelor of Social Science(s): an undergraduate (bachelor’s) degree focused on social sciences such as sociology, political science, anthropology, economics, human geography, or related fields.","zh":"社会科学学士（学位）：以社会科学领域为主的本科（学士）学位，常涵盖社会学、政治学、人类学、经济学、人文地理等相关学科。"},"examples":[{"en":"She earned a BSocSc in Sociology and now works in community development.","zh":"她获得了社会学方向的 BSocSc（社会科学学士）学位，现在在社区发展领域工作。"},{"en":"The job posting says a BSocSc or a related bachelor’s degree is required.","zh":"招聘信息写明需要 BSocSc（社会科学学士）或相关的本科学历。"}]}],"synonyms":["Bachelor of Social Science","Bachelor of Social Sciences","BSS (varies by school)"],"phonetic":"/ˈbætʃələr əv ˈsoʊʃəl ˈsaɪəns/","extraExplanation":["BSocSc 是学位缩写，常见于英联邦国家和一些高校的学位命名体系中；不同学校对课程设置与专业方向的划分可能不同。","在简历、申请材料里通常写作 “BSocSc (Major)” 或 “Bachelor of Social Sciences (Major)”。如不确定对方是否熟悉该缩写，首次出现可写全称，后面再用缩写。"]}
{"word":"BSOrNHort","summary":{"en":"“BSOrNHort” doesn’t match a standard English word or idiom; it may be an acronym, a typo, or a name/code.","zh":"“BSOrNHort”不像标准英文单词或习语，可能是缩写、拼写错误，或专有名词/代码。"},"extraExplanation":["你输入的“BSOrNHort”看起来不像常见英文单词或固定短语，可能是：\n1）大小写混在一起的缩写（如 BS / NH / ort），\n2）拼写错误，\n3）某个专有名词、用户名或代码。\n\n为了帮你准确解释，请你补充一下：\n- 你是在什么语境里看到它的？（句子/截图/网页链接也可以）\n- 你想查的是不是“BS or N(…)”或“short/shorten”等相关表达？\n- 需要我按“缩写”来猜测并列出可能含义吗？"]}
{"word":"BSOT","summary":{"en":"BSOT is an initialism that most often means “back side of the …” in notes, or (slang) “bullshit on toast”; it can also be context-specific.","zh":"BSOT 是一个首字母缩写，常见含义是“……的背面/背页”，也可能是俚语“bullshit on toast”；具体还需看语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An initialism used in notes or informal writing to mean “back side of the …” (the reverse of a page, sign, document, etc.).","zh":"一个首字母缩写，在笔记或非正式书写中可表示“……的背面/背页”（例如纸张、标牌、文件的反面）。"},"examples":[{"en":"The diagram is on the BSOT of this handout.","zh":"图示在这份讲义的背面。"},{"en":"Please sign on the front, then write your address on the BSOT.","zh":"请先在正面签名，然后把地址写在背面。"}]},{"partOfSpeech":"other","definition":{"en":"(Slang, usually joking or rude) “bullshit on toast,” used to complain that something is nonsense or low-quality.","zh":"（俚语，常带玩笑或粗俗语气）“bullshit on toast”的缩写，用来抱怨某事很扯、很烂、很不靠谱。"},"examples":[{"en":"That excuse is total BSOT.","zh":"那个借口完全是胡扯。"},{"en":"This update is BSOT—nothing works now.","zh":"这次更新太烂了——现在什么都用不了。"}]},{"partOfSpeech":"other","definition":{"en":"A context-specific acronym that can stand for different organizations, projects, or terms depending on the field (e.g., school, company, tech).","zh":"一个高度依赖语境的缩写，可能在不同领域代表不同机构、项目或术语（如学校、公司、科技等）。"},"examples":[{"en":"In this document, BSOT refers to our internal tool name.","zh":"在这份文件里，BSOT指的是我们内部工具的名称。"},{"en":"What does BSOT mean in your class notes?","zh":"在你的课堂笔记里，BSOT是什么意思？"}]}],"synonyms":["back side","reverse side","nonsense (for the slang sense)"],"phonetic":"ˌbiː ɛs oʊ ˈtiː","extraExplanation":["英文缩写往往“同形多义”，尤其是像 BSOT 这种不算特别常见的缩写；最稳妥的做法是看它出现的场景（聊天、办公室文件、课程资料、技术文档等）。如果你把原句或上下文贴出来，我可以帮你判断这里最可能是哪一种意思。"]}
{"word":"BSP","summary":{"en":"BSP is a common abbreviation. It often means the Central Bank of the Philippines, IATA’s Billing and Settlement Plan, or British Standard Pipe, depending on context.","zh":"BSP 是常见缩写，常指菲律宾中央银行、国际航协的开票与结算计划，或英制管螺纹标准，需结合语境理解。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for several different things; the meaning depends on the field or country (often read aloud as the letters “B-S-P”).","zh":"一个有多种含义的缩写；具体意思取决于领域或国家（常按字母读作“B-S-P”）。"},"examples":[{"en":"In this email, BSP refers to a payment system, not a company.","zh":"在这封邮件里，BSP 指的是一个支付结算系统，不是公司。"},{"en":"Before using BSP in a report, define what it stands for.","zh":"在报告里使用 BSP 之前，先说明它的全称是什么。"}]},{"partOfSpeech":"n.","definition":{"en":"Bangko Sentral ng Pilipinas (the Central Bank of the Philippines).","zh":"Bangko Sentral ng Pilipinas（菲律宾中央银行）。"},"examples":[{"en":"The BSP raised interest rates to control inflation.","zh":"菲律宾央行（BSP）提高利率以控制通货膨胀。"},{"en":"The BSP regulates banks in the Philippines.","zh":"菲律宾央行（BSP）监管菲律宾的银行。"}]},{"partOfSpeech":"n.","definition":{"en":"Billing and Settlement Plan (IATA): a system that handles ticket sales, billing, and payments between travel agencies and airlines.","zh":"（国际航协 IATA）Billing and Settlement Plan：处理旅行社与航空公司之间机票销售、对账与结算的系统。"},"examples":[{"en":"Our agency reports ticket sales through the IATA BSP.","zh":"我们旅行社通过 IATA 的 BSP 上报机票销售。"},{"en":"BSP settlement is usually done on a fixed schedule.","zh":"BSP 的结算通常按固定周期进行。"}]},{"partOfSpeech":"n.","definition":{"en":"British Standard Pipe: a standard for screw threads used in pipes and fittings (common in plumbing/engineering).","zh":"British Standard Pipe：管道与接头常用的一种螺纹标准（常见于管道/工程领域）。"},"examples":[{"en":"This fitting uses BSP threads, not NPT.","zh":"这个接头用的是 BSP 螺纹，不是 NPT。"},{"en":"Check whether the pipe is BSP before buying the adapter.","zh":"买转接头前先确认管子是不是 BSP 标准。"}]}],"synonyms":["abbreviation","initialism","acronym"],"phonetic":"/biː ɛs piː/","extraExplanation":["“BSP”非常依赖语境。写作时最好第一次出现就写全称（例如：Bangko Sentral ng Pilipinas (BSP)），之后再用缩写，避免读者误解。"]}
{"word":"BSPA","summary":{"en":"BSPA is an abbreviation whose meaning depends on context; it’s usually read as the letters “B-S-P-A.”","zh":"BSPA 是一个需要语境才能确定含义的缩写，通常按字母读作 “B‑S‑P‑A”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation (acronym/initialism) made from the first letters of a longer name; its exact meaning depends on the field and context","zh":"由更长名称首字母组成的缩写；具体含义取决于所在领域与语境"},"examples":[{"en":"What does BSPA stand for in this document?","zh":"在这份文件里，BSPA 代表什么？"},{"en":"BSPA can mean different things, so please give a little context (medicine, business, school, etc.).","zh":"BSPA 可能有不同含义，请提供一点语境（医疗、商业、学校等）。"}]},{"partOfSpeech":"other","definition":{"en":"(common use) the letters “B‑S‑P‑A” said one by one when reading an abbreviation","zh":"（常见读法）把 “B‑S‑P‑A” 按字母逐个读出来的读法"},"examples":[{"en":"It’s pronounced “B-S-P-A,” not as a single word.","zh":"它读作“B‑S‑P‑A”，而不是当作一个完整单词来读。"},{"en":"Please write BSPA in all caps to show it’s an abbreviation.","zh":"请用全大写写 BSPA，表示它是缩写。"}]}],"synonyms":["abbreviation","initialism","acronym"],"phonetic":"/ˌbiː ɛs piː ˈeɪ/","extraExplanation":["“BSPA”本身不是一个固定含义的英语单词，更像是“首字母缩写”。不同机构/文件里它可能代表完全不同的全称（例如某个协会、项目、协议或公司名）。如果你把它出现的句子或所属领域发我，我可以帮你确定最可能的全称与正确翻译。","英语里许多缩写是“initialism（按字母读）”，比如 FBI /ˌɛf biː ˈaɪ/；也有少数是“acronym（当作词读）”，比如 NASA /ˈnæsə/。BSPA通常更像前者。"]}
{"word":"BSPE","summary":{"en":"BSPE is an abbreviation, most commonly “Bachelor of Science in Petroleum Engineering,” but its exact meaning can vary by context.","zh":"BSPE 是一个缩写，最常见指“石油工程理学学士”，但具体含义可能因语境而异。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation that often stands for “Bachelor of Science in Petroleum Engineering,” a university degree focused on finding and producing oil and gas","zh":"常见缩写之一，常指“石油工程理学学士”，即以油气勘探与开采为主要内容的大学本科学位"},"examples":[{"en":"She earned a BSPE and now works as a drilling engineer.","zh":"她取得了石油工程理学学士（BSPE）学位，现在做钻井工程师。"},{"en":"The job posting says “BSPE or related degree required.”","zh":"招聘信息写着“需要石油工程学士（BSPE）或相关专业学位”。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation used by some organizations and communities; depending on context, it may refer to a specific professional group or program name","zh":"在一些机构/圈子里使用的缩写；具体含义取决于语境，可能指某个专业组织或项目名称"},"examples":[{"en":"In this email, BSPE refers to an organization, not a college degree.","zh":"在这封邮件里，BSPE指的是一个机构，而不是学位。"},{"en":"Could you tell me what BSPE stands for in your department?","zh":"你能告诉我在你们部门里BSPE代表什么吗？"}]}],"synonyms":["B.S. in Petroleum Engineering","Petroleum Engineering degree"],"phonetic":"/ˌbiː ɛs piː ˈiː/","extraExplanation":["BSPE 是“首字母缩写词”，通常按字母逐个读（B-S-P-E）。","常见的一种释义是学位名称 Bachelor of Science in Petroleum Engineering，但在不同国家、学校或行业里也可能被用作某个协会/项目的简称。遇到不确定时，最好看上下文（学校、职位、机构全称）或直接询问对方“BSPE stands for what?”。"]}
{"word":"BSPH","summary":{"en":"BSPH most commonly means “Bachelor of Science in Public Health.”","zh":"BSPH 最常见的意思是“公共卫生理学学士”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bachelor of Science in Public Health (an undergraduate degree focused on population health, disease prevention, health policy, and community health).","zh":"公共卫生理学学士（本科专业学位，侧重人群健康、疾病预防、卫生政策与社区健康）。"},"examples":[{"en":"She earned a BSPH and now works in community health outreach.","zh":"她获得了公共卫生理学学士（BSPH），现在从事社区健康外展工作。"},{"en":"The BSPH program includes courses in epidemiology and biostatistics.","zh":"BSPH 项目通常包含流行病学和生物统计学等课程。"}]}],"synonyms":["B.S.P.H.","Bachelor of Science in Public Health","public health bachelor’s degree"],"phonetic":"/ˌbiː ɛs piː ˈeɪtʃ/","extraExplanation":["BSPH 通常写作 B.S.P.H.，常见于美国高校的学位名称与简历/LinkedIn 上。","不同学校对 BSPH 的课程设置可能不同，但一般会覆盖健康促进、环境健康、卫生管理/政策、流行病学等方向。","有些地区或学校也可能用 BSPH 指代其他含义；如果你是在特定场景（如医疗记录、公司内部缩写）看到它，可以告诉我上下文，我可以帮你确认。"]}
{"word":"BSPhar","summary":{"en":"BSPhar = B.S. Pharm., a Bachelor of Science in Pharmacy (often an older/earlier pharmacy degree label).","zh":"BSPhar = B.S. Pharm.，指药学理学士学位（在一些地区属于较早期/旧学制的称呼）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “B.S. Pharm.”, a Bachelor of Science degree in Pharmacy (an older-style undergraduate professional pharmacy degree in some countries).","zh":"“B.S. Pharm.” 的缩写，指“药学理学士/药剂学理学士”学位（在一些国家属于较早期的本科层级药学专业学位称呼）。"},"examples":[{"en":"Her résumé lists BSPhar (University of Santo Tomas) and a pharmacy license.","zh":"她的简历写着 BSPhar（圣托马斯大学）以及药师执照。"},{"en":"Some schools replaced the BSPhar program with the PharmD.","zh":"一些学校用 PharmD 取代了 BSPhar 项目。"}]}],"synonyms":["B.S. Pharm.","Bachelor of Science in Pharmacy"],"phonetic":"/ˌbiːˈɛs ˈfɑrm/","extraExplanation":["“BSPhar”常见于简历、名片、学校成绩单或社交媒体简介中，属于学位缩写写法；更正式的写法通常是“B.S. Pharm.”或直接写“Bachelor of Science in Pharmacy”。","在美国与部分地区，入门执业药师的主流学位如今多为“PharmD（Doctor of Pharmacy）”，因此“BSPhar/B.S. Pharm.”在某些语境里带有“较早一代/旧学制”的意味；但在其他国家/地区它仍可能是常见或有效的药学本科学位。","不要把“BSPhar”误读为“Pharmaceutical Sciences（药物科学）”的学位缩写；后者更常见写法是“BS in Pharmaceutical Sciences”或“BS PharmSci”等，具体以学校官方名称为准。"]}
{"word":"BSPharm","summary":{"en":"BSPharm = Bachelor of Science in Pharmacy, an undergraduate pharmacy degree.","zh":"BSPharm 指药学理学士（药学本科）学位的缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbreviation) Bachelor of Science in Pharmacy; an undergraduate degree program in pharmacy/pharmaceutical sciences.","zh":"（缩写）药学理学士；药学/制药相关的本科（学士）学位或专业项目。"},"examples":[{"en":"She finished her BSPharm and then prepared for the pharmacist licensure exam.","zh":"她读完药学理学士后，开始准备药师执照考试。"},{"en":"The hospital prefers applicants with a BSPharm or a PharmD.","zh":"医院更倾向于招聘具有药学理学士或药学博士（PharmD）背景的应聘者。"}]}],"synonyms":["B.S. in Pharmacy","Bachelor of Science in Pharmacy"],"phonetic":"/biː ɛs fɑrm/","extraExplanation":["BSPharm 常见于一些国家和地区的教育体系（如菲律宾、印度等）作为“药学本科”的学位名称；在美国语境中更常见的是 PharmD（Doctor of Pharmacy，药学博士）作为执业药师的主流学位。","写简历或表格时，BSPharm 通常作为学历缩写出现，可在首次出现时写全称：Bachelor of Science in Pharmacy (BSPharm)。"]}
{"word":"BSPHN","summary":{"en":"BSPHN is an uncommon degree/program abbreviation, usually meaning a Bachelor of Science related to Public Health with an “N” specialization (often Nursing or Nutrition), depending on the school.","zh":"BSPHN 是不太常见的学位/项目缩写，通常指与公共卫生相关的理学学士，并带有以 N 开头的方向（常见为护理或营养等），具体以学校为准。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation (not a standard everyday English word) that is most often used in school/degree contexts; it usually refers to a Bachelor of Science–level program related to Public Health plus an “N” field (commonly interpreted as Nursing or Nutrition, depending on the institution).","zh":"一个缩写（不是日常英语单词），多见于学校/学位语境；通常表示“公共卫生（Public Health）的理学学士（Bachelor of Science）+ 以 N 开头的专业方向”（不同学校可能指 Nursing 护理或 Nutrition 营养等）。"},"examples":[{"en":"She listed “BSPHN” on her resume, but the employer asked what it stood for.","zh":"她在简历上写了“BSPHN”，但雇主问它的全称是什么。"},{"en":"Different universities may use BSPHN differently, so check the program’s official name.","zh":"不同大学对 BSPHN 的用法可能不同，所以要查看项目的官方名称。"}]}],"synonyms":["BSPH","BS in Public Health","Bachelor of Science (Public Health)"],"phonetic":"/biː ˌɛs ˌpiː ˌeɪtʃ ˈɛn/","extraExplanation":["在英语里，学位缩写常因学校或国家而不同；“BSPH”比较常见（Bachelor of Science in Public Health，公共卫生理学学士），但“BSPHN”不是一个全球统一的标准写法。看到这种缩写时，最稳妥的做法是到学校官网、课程手册或证书上核对全称。","读法通常是逐个字母读：B-S-P-H-N。正式写作（例如求职或申请）中，第一次出现最好写全称并在括号里标注缩写。"]}
{"word":"BSPhTh","summary":{"en":"BSPhTh is an academic abbreviation, most often referring to a Bachelor of Science in Philosophy and Theology.","zh":"BSPhTh 是学术缩写，多指“理学学士（哲学与神学）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbreviation) A degree title used by some schools, usually meaning “Bachelor of Science in Philosophy and Theology.”","zh":"（缩写）一些学校使用的学位名称，通常指“理学学士（哲学与神学）”。"},"examples":[{"en":"She earned a BSPhTh before entering graduate studies in theology.","zh":"她在攻读神学研究生之前获得了 BSPhTh 学位。"},{"en":"On his résumé, BSPhTh appears under Education.","zh":"在他的简历里，BSPhTh 出现在“教育背景”一栏。"}]}],"synonyms":["B.S. (Philosophy and Theology)","Bachelor of Science in Philosophy and Theology"],"phonetic":"/ˌbiːˌɛsˌpiːˌeɪtʃˌtiːˌeɪtʃ/","extraExplanation":["这个缩写并不是英语里的常见词汇，更像是特定学校/宗教院校使用的学位简称；不同机构可能会把它解释成不同全称。","写作时若面向不熟悉该体系的读者，建议第一次出现时写全称并在括号中标注缩写，例如：Bachelor of Science in Philosophy and Theology (BSPhTh)。"]}
{"word":"BSPT","summary":{"en":"BSPT is an abbreviation; often “Bachelor of Science in Physical Therapy,” but its meaning depends on context.","zh":"BSPT是缩写；常指“物理治疗学理学士”，但具体含义需看语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation with multiple possible meanings; most commonly used in education/health contexts for “Bachelor of Science in Physical Therapy,” or in business/tech as an internal acronym for a specific program/team. Meaning depends on context.","zh":"一个可能有多种含义的缩写；最常见于教育/医疗领域，表示“物理治疗学理学士（Bachelor of Science in Physical Therapy）”，也可能在公司或技术场景中是某个项目/团队的内部简称。具体含义取决于语境。"},"examples":[{"en":"She earned a BSPT before pursuing a master’s degree in rehabilitation.","zh":"她先获得了BSPT（物理治疗学理学士），之后又攻读了康复方向的硕士。"},{"en":"The email says “BSPT meeting at 3,” but I need to ask what BSPT stands for here.","zh":"邮件写着“3点BSPT会议”，但我得问清楚这里的BSPT具体指什么。"}]}],"synonyms":["initialism","abbreviation","acronym"],"phonetic":"/ˌbiː ɛs piː ˈtiː/","extraExplanation":["“BSPT”是典型的缩写（acronym/initialism）。在不同国家、学校或公司里，它可能指完全不同的东西。最稳妥的方法是：看它出现的领域（医疗教育/公司部门/项目名）、附近的关键词，或直接问对方“Here, what does BSPT stand for?”。","如果你告诉我它出现在哪个句子/行业/国家（比如菲律宾的学校、美国的简历、公司内部邮件等），我可以帮你锁定最可能的释义，并给出更贴近语境的例句与相关词。"]}
{"word":"BSRec","summary":{"en":"BSRec is usually an abbreviation, most commonly meaning “balance sheet reconciliation” in accounting; in other contexts it may be an internal code whose meaning depends on the organization.","zh":"BSRec通常是缩写，最常见指会计中的“资产负债表对账”；在其他语境里也可能是组织内部代码，含义需看具体背景。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(business/accounting, abbreviation) balance sheet reconciliation; the process of checking and matching balance sheet account balances to supporting documents to ensure accuracy.","zh":"（商业/会计缩写）资产负债表对账；将资产负债表科目余额与支持性凭证核对匹配，以确保数据准确的流程。"},"examples":[{"en":"Please finish the BSRec for the prepaid expenses account by Friday.","zh":"请在周五前完成“预付费用”科目的BSRec（资产负债表对账）。"},{"en":"The auditor asked for BSRec files for all major balance sheet accounts.","zh":"审计要求提供所有主要资产负债表科目的BSRec对账文件。"}]},{"partOfSpeech":"other","definition":{"en":"(general, abbreviation) a shorthand label used in internal systems or project names; meaning depends on the organization or context.","zh":"（一般缩写）内部系统标签或项目名的简写；具体含义取决于组织或语境。"},"examples":[{"en":"I saw “BSRec” in the ticket title, but the description didn’t explain what it stands for.","zh":"我在工单标题里看到“BSRec”，但描述没有说明它代表什么。"},{"en":"Ask your team what BSRec means in your workflow—it may be an internal code.","zh":"在你们的流程里最好问问团队BSRec是什么意思——它可能是内部代号。"}]}],"synonyms":["BS rec","B/S rec","balance sheet reconciliation","account reconciliation"],"phonetic":"/ˌbiː ˌɛs ˈrɛk/","extraExplanation":["“BSRec”不是通用英语单词，更常见于公司内部的缩写/命名。会计语境里常写作“BS rec”或“B/S rec”，指 balance sheet reconciliation（资产负债表对账）。不同公司也可能把它用作系统模块名、报表名或项目代号。","如果你能提供一句包含BSRec的原句（例如邮件标题、工单内容、软件界面），我可以帮你更准确地判定它的含义与更自然的英文用法。"]}
{"word":"BSRet","summary":{"en":"“BSRet” is not a common English word; it’s usually an acronym/label whose meaning depends on context.","zh":"“BSRet”不是常见英语单词；通常是缩写/标签，含义需要结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An acronym/variable name (not a standard English dictionary word). Its meaning depends on the specific field or document where it appears.","zh":"一个缩写/变量名（不是标准英语词典词）。具体含义取决于它出现的领域或文件语境。"},"examples":[{"en":"In this spreadsheet, “BSRet” is a column label, so you need the data dictionary to know what it means.","zh":"在这份表格里，“BSRet”是一个列名，所以需要查看数据字典才能知道它的含义。"},{"en":"I saw “BSRet” in the code comments, but the author didn’t define the acronym.","zh":"我在代码注释里看到了“BSRet”，但作者没有解释这个缩写。"}]}],"phonetic":"/ˌbi ˌɛs ˈrɛt/","extraExplanation":["“BSRet”很像是把几个英文单词的首字母拼在一起（例如某个部门名、指标名、函数名、课程/学位名等），不同组织/行业的含义可能完全不同。","如果你把它出现的完整句子、表格标题、文件类型（例如财务报表/数据集/程序代码/医学或生物论文）发我，我可以更准确地帮你还原它可能代表的词组，并解释用法。"]}
{"word":"BSRFS","summary":{"en":"“BSRFS” is not a common standard English word; it’s most likely a context-specific abbreviation.","zh":"“BSRFS”不是常见的标准英语单词，更可能是特定语境下的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation/acrony m that does not have a widely recognized standard meaning in general English; its meaning depends on the specific field or context (e.g., a company name, a project code, a school program, or an online username).","zh":"一个在通用英语中没有广泛公认固定含义的缩写/首字母缩略词；其含义取决于具体领域或语境（如公司名、项目代号、学校项目或网名等）。"},"examples":[{"en":"I saw “BSRFS” in the document, but it wasn’t defined—what does it stand for?","zh":"我在文件里看到“BSRFS”，但没有给出释义——它代表什么？"},{"en":"Different teams may use BSRFS to mean different things, so check the glossary or ask the author.","zh":"不同团队可能会用BSRFS表示不同意思，所以最好查术语表或问作者。"}]}],"synonyms":["abbreviation","acronym","initialism"],"phonetic":"/biː ɛs ɑːr ɛf ɛs/","extraExplanation":["像“BSRFS”这种全大写字母串，常见于：机构/部门名称首字母、课程或项目缩写、内部系统代码、账号ID等。没有上下文时很难准确解释。","如果你能提供它出现的场景（例如：哪份文件/哪个行业、前后句、是否与IT/医疗/金融/学校相关），我可以帮你更可能地推断它的全称与含义。","英语里读不出来的缩写通常按字母逐个读（initialism），例如 B-S-R-F-S。"]}
{"word":"BSRT","summary":{"en":"BSRT is an initialism with multiple possible meanings; its exact meaning depends on context (often read as “B-S-R-T”).","zh":"BSRT 是一个可能有多种含义的缩写，具体代表什么取决于语境（通常按字母读作“B-S-R-T”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation/initialism for several different terms (meaning depends on context). It is usually read as the letters “B-S-R-T.”","zh":"一个缩写/首字母词，可能代表多个不同的词组（具体含义取决于语境），通常按字母读作“B-S-R-T”。"},"examples":[{"en":"What does BSRT stand for in this document?","zh":"在这份文件里，BSRT 代表什么？"},{"en":"I saw “BSRT” on the form, but there wasn’t any explanation.","zh":"我在表格上看到“BSRT”，但没有任何说明。"}]},{"partOfSpeech":"other","definition":{"en":"(Common in education/health contexts) Bachelor of Science in Respiratory Therapy / Respiratory Therapy program (usage varies by school/country).","zh":"（常见于教育/医疗语境）呼吸治疗相关的理学学士学位或“呼吸治疗”专业/项目（不同学校或国家用法不一）。"},"examples":[{"en":"She’s applying to a BSRT program next fall.","zh":"她计划明年秋季申请 BSRT（呼吸治疗相关）项目。"},{"en":"He completed his BSRT and started working at a hospital.","zh":"他完成了 BSRT 学位后开始在医院工作。"}]},{"partOfSpeech":"other","definition":{"en":"(Less common; depends on field) A short label used by an organization, course, system, or test name. You’ll need the surrounding text to confirm the exact meaning.","zh":"（较不常见；取决于领域）某个机构、课程、系统或测试名称的简写标签；需要结合上下文才能确定准确含义。"},"examples":[{"en":"In IT tickets, “BSRT” might be an internal team code.","zh":"在 IT 工单里，“BSRT” 可能是内部团队代号。"},{"en":"Different companies can use BSRT to mean different things.","zh":"不同公司可能用 BSRT 表示不同意思。"}]}],"synonyms":["initialism","abbreviation","acronym (general)"],"phonetic":"/ˌbiː ɛs ɑːr ˈtiː/","extraExplanation":["“BSRT”不是一个固定含义的常用单词，更像是“缩写代码”。最可靠的方法是看它出现的场景：比如学校专业、医院科室、公司内部系统、文件标题等。","如果你把它出现的整句话/段落（去掉隐私信息）发我，我可以帮你判断在该语境下最可能的全称与含义。"]}
{"word":"BSS","summary":{"en":"BSS most often means Business Support System(s) in business/telecom IT, or Base Station Subsystem in mobile network engineering; the meaning depends on context.","zh":"BSS常见含义为“业务支撑系统”（企业/电信IT）或“基站子系统”（移动通信工程）；具体意思取决于语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbr.) Business Support System(s): software and processes a company uses to manage customers, billing, orders, and services (common in telecom and IT).","zh":"（缩写）业务支撑系统：公司用于管理客户、计费、订单与服务的软件与流程（电信与IT领域常见）。"},"examples":[{"en":"Our BSS handles customer sign-ups and monthly billing.","zh":"我们的BSS负责客户开户和每月计费。"},{"en":"The telecom company is upgrading its BSS to improve customer service.","zh":"这家电信公司正在升级BSS以提升客户服务。"}]},{"partOfSpeech":"n.","definition":{"en":"(abbr.) Base Station Subsystem: the part of a mobile network that connects cell towers (base stations) to the rest of the system (common in GSM networks).","zh":"（缩写）基站子系统：移动通信网络中连接基站（信号塔）与其他网络部分的系统（GSM网络常见术语）。"},"examples":[{"en":"Engineers tested the BSS to reduce dropped calls.","zh":"工程师测试BSS以减少掉线。"},{"en":"In GSM architecture, the BSS links base stations to the core network.","zh":"在GSM架构中，BSS把基站连接到核心网。"}]}],"synonyms":["Business Support Systems","Base Station Subsystem","OSS/BSS (related term)"],"phonetic":"/biː ɛs ɛs/","extraExplanation":["“BSS”是缩写，在不同领域含义不同。阅读或听到时可以根据上下文判断：谈到计费、订单、客户管理，多半是Business Support Systems；谈到基站、GSM、无线接入，多半是Base Station Subsystem。","英语里字母缩写通常按字母逐个读音（B-S-S），而不是当作一个单词读。"]}
{"word":"BSSA","summary":{"en":"BSSA is an abbreviation; its meaning depends on context (often an organization name or a job title).","zh":"BSSA 是缩写；具体含义取决于语境（常见为组织名称或职位名称）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) A set of initials used as an abbreviation; the exact meaning depends on the context (for example, the name of an organization, a job title, or a technical term).","zh":"（缩写）一组首字母缩写；具体含义取决于语境（例如组织名称、职位名称或技术术语）。"},"examples":[{"en":"What does BSSA stand for in this report?","zh":"在这份报告里，BSSA 代表什么？"},{"en":"BSSA is used as a short name for an organization in the document.","zh":"在文件中，BSSA 被用作某个组织的简称。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev., business/IT) Sometimes used to mean “Business Systems Support Analyst” (a person who helps maintain and support business software systems).","zh":"（缩写，商业/IT）有时指“Business Systems Support Analyst（业务系统支持分析师）”，负责维护与支持企业软件系统的人。"},"examples":[{"en":"She works as a BSSA on the finance software team.","zh":"她在财务软件团队担任 BSSA。"},{"en":"Please contact the BSSA if the system login fails.","zh":"如果系统登录失败，请联系 BSSA。"}]}],"synonyms":["initialism","abbreviation"],"phonetic":"ˌbiː ɛs ɛs ˈeɪ","extraExplanation":["“BSSA”并不是一个单一、全球统一的词条，更常见的是在特定公司、学校或行业文件里作为缩写出现。为了准确解释，请提供：它出现的句子/段落、所属领域（如教育、医学、IT、金融、机构名称）或国家地区。"]}
{"word":"BSSc","summary":{"en":"BSSc = Bachelor of Social Science, an undergraduate degree in social sciences.","zh":"BSSc=社会科学学士（Bachelor of Social Science），社会科学领域的本科学位。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Bachelor of Social Science,” an undergraduate university degree in social science subjects (such as sociology, political science, economics, or anthropology).","zh":"“Bachelor of Social Science（社会科学学士）”的缩写，指以社会科学（如社会学、政治学、经济学、人类学等）为主的本科大学学位。"},"examples":[{"en":"She earned a BSSc in Sociology and now works in community development.","zh":"她获得了社会学方向的BSSc（社会科学学士），现在从事社区发展工作。"},{"en":"The job posting requires a BSSc or a related degree.","zh":"招聘信息要求BSSc（社会科学学士）或相关专业学位。"}]}],"synonyms":["Bachelor of Social Science","B.S.Sc.","BSocSc","BSS"],"phonetic":"/ˌbiː ɛs ɛs ˈsiː/","extraExplanation":["BSSc在一些国家和地区（如英联邦体系的部分高校）较常见；在美国院校里，更常见的写法可能是BA（文学学士）或BS（理学学士），具体取决于学校对社会科学学位的设置。","写作中有时也会写作B.S.Sc. 或 BSocSc；放在姓名后通常表示学历（如：Alex Chen, BSSc）。"]}
{"word":"BSSE","summary":{"en":"BSSE is an abbreviation; it often means Bachelor of Science in Software Engineering, and in statistics it can mean bootstrap standard error.","zh":"BSSE 是缩写；常指“软件工程理学学士”，在统计领域也可能指“自助法标准误”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation commonly used for “Bachelor of Science in Software Engineering,” a university degree focused on building and maintaining software systems.","zh":"常见缩写，指“软件工程理学学士”（Bachelor of Science in Software Engineering），一类以软件系统开发与维护为重点的大学学位。"},"examples":[{"en":"She earned a BSSE and now works as a software engineer.","zh":"她取得了 BSSE 学位，现在是一名软件工程师。"},{"en":"The job posting says a BSSE or related degree is preferred.","zh":"招聘信息写着更偏好 BSSE 或相关专业学位。"}]},{"partOfSpeech":"other","definition":{"en":"in statistics/econometrics, an abbreviation for “bootstrap standard error,” an estimate of uncertainty calculated using resampling (bootstrap) methods.","zh":"在统计/计量领域，常用作“bootstrap standard error（自助法标准误）”的缩写，指用重抽样（bootstrap）方法计算的不确定性估计。"},"examples":[{"en":"We report the coefficient along with the BSSE in parentheses.","zh":"我们报告系数，并在括号里给出 BSSE（标准误）。"},{"en":"The BSSE is smaller after increasing the sample size.","zh":"样本量增加后，BSSE 变小了。"}]}],"synonyms":["B.S. in Software Engineering","bootstrap SE","standard error (SE)"],"phonetic":"/biː ɛs ɛs iː/","extraExplanation":["“BSSE”不是一个只有单一含义的常用英语单词，而是缩写；具体意思强烈依赖语境（教育、招聘、统计论文等）。","如果你能告诉我它出现的场景（例如学校专业、简历、论文表格、聊天内容），我可以给出最准确的释义与更贴切的例句。"]}
{"word":"BSSS","summary":{"en":"“BSSS” is an ambiguous abbreviation; its meaning depends on where you saw it.","zh":"“BSSS”是含义不固定的缩写，需要结合你看到它的具体场景来确定意思。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An initialism (abbreviation) that can stand for different phrases or organization names depending on context; it does not have one widely agreed, single meaning in general English.","zh":"一个首字母缩略词（缩写），在不同语境下可能代表不同短语或机构名称；在一般英语里没有唯一、通用的固定含义。"},"examples":[{"en":"I saw “BSSS” in the email signature, but I need more context to know what it stands for.","zh":"我在邮件落款里看到“BSSS”，但需要更多语境才能知道它代表什么。"},{"en":"In our school, BSSS refers to a specific program, so students understand it locally.","zh":"在我们学校里，BSSS指某个特定项目，所以学生在本地语境下都懂。"}]}],"synonyms":["acronym","initialism","abbreviation"],"phonetic":"/ˌbiː.ɛs.ɛsˈɛs/","extraExplanation":["“BSSS”这类全大写缩写通常要靠场景来解读：比如出现在公司名、学校项目、社群/游戏公会、聊天记录或文件标题里，含义都可能不同。","如果你把它出现的句子（或它属于哪个领域：学校/公司/医学/游戏/社交媒体等）发我，我可以帮你确定最可能的展开形式与准确意思。"]}
{"word":"BST","summary":{"en":"BST most commonly means Binary Search Tree in computing, or British Summer Time in time zones.","zh":"BST 最常见指计算机里的二叉搜索树，或时区里的英国夏令时。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(computing) Abbreviation for “Binary Search Tree,” a data structure where each node has a value, and values in the left subtree are smaller while values in the right subtree are larger (by a chosen ordering).","zh":"（计算机）“Binary Search Tree（二叉搜索树）”的缩写：一种数据结构，每个节点有一个值，左子树的值更小、右子树的值更大（按约定的比较规则）。"},"examples":[{"en":"In a BST, searching for a number is usually fast because you can discard half the tree at each step.","zh":"在 BST 里查找数字通常很快，因为每一步都可以排除一半的树。"},{"en":"We used a BST to keep the data sorted while allowing quick insertions and lookups.","zh":"我们用 BST 来保持数据有序，同时支持快速插入和查询。"}]},{"partOfSpeech":"n.","definition":{"en":"(time) Abbreviation for “British Summer Time,” the daylight saving time used in the UK (typically UTC+1 during summer).","zh":"（时间）“British Summer Time（英国夏令时）”的缩写：英国夏季使用的夏令时（通常为 UTC+1）。"},"examples":[{"en":"The meeting starts at 2:00 p.m. BST, which is 9:00 a.m. in New York (EDT).","zh":"会议在英国夏令时下午 2 点开始，也就是纽约（EDT）上午 9 点。"},{"en":"Flights may list departure times in BST during the summer months.","zh":"夏季航班信息可能会用 BST 标注起飞时间。"}]}],"synonyms":["Binary Search Tree","British Summer Time"],"phonetic":"/ˌbiː ɛs ˈtiː/","extraExplanation":["“BST”在不同领域含义差异很大：在技术面试、算法课、编程讨论中，几乎默认指“二叉搜索树”；在国际协作、会议日程、航空/铁路时刻表中，更可能指“英国夏令时”。看上下文（代码/数据结构 vs. 时间/时区）通常就能判断。"]}
{"word":"BSTIE","summary":{"en":"Bestie is informal slang meaning “best friend,” and it can also be used as a friendly form of address.","zh":"Bestie 是非正式俚语，意思是“最好的朋友”，也可作亲昵称呼来叫对方。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal slang) A best friend; someone you are very close to and trust.","zh":"（非正式俚语）最好的朋友；非常亲密、信任的人。"},"examples":[{"en":"She’s my bestie—we tell each other everything.","zh":"她是我的闺蜜/死党——我们什么都互相说。"},{"en":"Hey bestie, do you want to grab coffee after class?","zh":"嗨，闺蜜/兄弟，下课后想去喝咖啡吗？"},{"en":"I met my bestie in middle school.","zh":"我在初中认识了我最好的朋友。"}]},{"partOfSpeech":"phrase","definition":{"en":"(informal) Used as a friendly way to address someone, sometimes playfully—even if they aren’t actually your best friend.","zh":"（非正式）用作亲昵称呼，有时带玩笑语气——即使对方不一定真的是“最好的朋友”。"},"examples":[{"en":"Bestie, you are not going out in that rain without an umbrella.","zh":"闺蜜/兄弟，你可不能不带伞就出去淋雨。"},{"en":"Okay bestie, tell me what happened.","zh":"好啦闺蜜/兄弟，跟我说发生什么了。"}]}],"synonyms":["best friend","close friend","BFF","pal","buddy"],"phonetic":"/ˈbɛsti/","extraExplanation":["“bestie”来自“best friend”的缩写/昵称化说法，常见于社交媒体、短信聊天和口语。语气通常亲密、轻松；在不熟的人之间使用可能显得过于随意。","你输入的“BSTIE”很可能是“bestie”的拼写变体或打字误差；标准拼写是 bestie。"]}
{"word":"BSTJ","summary":{"en":"“BSTJ” is not a standard term; it’s an ambiguous abbreviation whose meaning depends on context.","zh":"“BSTJ”不是标准固定词义的词；它是语境决定含义的模糊缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An uncommon abbreviation with no single widely accepted meaning; it is usually read as the letters “B-S-T-J.” Its meaning depends heavily on context (for example, it may be a typo for an MBTI type like “ISTJ/ESTJ,” or a tech shorthand like “BST (binary search tree) + J (Java)”).","zh":"一个不常见、没有统一公认含义的缩写；通常按字母读作“B-S-T-J”。它的意思很依赖语境（例如可能是把 MBTI 人格类型“ISTJ/ESTJ”打错了，或是技术语境里“BST（二叉搜索树）+ J（Java）”之类的简写）。"},"examples":[{"en":"I saw “BSTJ” in the chat—what does it stand for in your project?","zh":"我在聊天里看到“BSTJ”——在你们项目里它代表什么？"},{"en":"Do you mean ISTJ/ESTJ (MBTI), or BST in Java?","zh":"你是指 MBTI 的 ISTJ/ESTJ，还是 Java 里的 BST？"}]}],"phonetic":"/ˌbiː ɛs ˌtiː ˈdʒeɪ/","extraExplanation":["“BSTJ”不是像“USA”“CEO”那样有固定含义的通用缩写，所以最稳妥的做法是请你提供出现的场景（例如：心理测评/社交媒体/数据库/编程/公司内部代号）。我可以据此给出准确释义与用法。","读法通常按字母拼读：B-S-T-J（不是当作一个单词去读）。"]}
{"word":"BSTrans","summary":{"en":"A context-dependent name/abbreviation rather than a standard English word.","zh":"更像是依赖语境的名称/缩写，而非标准英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"BSTrans is not a standard English dictionary word. It is most commonly used as a name, username, project title, or abbreviation; its exact meaning depends on the specific context (e.g., a software/tool name, a company/internal system, or a file/module label).","zh":"BSTrans 不是标准的英语词典词汇。它更常见的是名称、用户名、项目名或缩写；具体含义取决于使用场景（例如某个软件/工具名、公司内部系统名，或文件/模块标签）。"},"examples":[{"en":"Our team uses BSTrans to handle internal data transfers.","zh":"我们团队用 BSTrans 来处理内部数据传输。"},{"en":"Please check the BSTrans documentation for setup steps.","zh":"请查看 BSTrans 的文档了解安装步骤。"}]}],"phonetic":"/ˌbiː ˈɛs trænz/","extraExplanation":["从拼写看，BSTrans 很可能是“BS + Trans(transfer/translate/transport/transaction 等)”的组合式命名：BS 表示的内容（例如部门名、系统名、产品名）不同，整体含义就会不同。","如果你能提供它出现的句子、所属领域（编程/物流/金融/翻译工具等）或全称，我可以给出更准确的释义、常见搭配与更自然的例句。"]}
{"word":"bsurd","summary":{"en":"“Absurd” means very unreasonable or silly; it can also mean an absurd thing or idea.","zh":"“Absurd”表示“荒谬的、不合理的、离谱的”；也可作名词指“荒谬的事/观点”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Completely unreasonable or silly; hard to believe because it makes no sense.","zh":"荒谬的；不合理的；可笑的（因为不合逻辑而难以置信）。"},"examples":[{"en":"It’s absurd to think you can learn a language in one day.","zh":"认为你能在一天内学会一门语言是荒谬的。"},{"en":"The price is absurd for such a small product.","zh":"这么小的产品卖这个价钱太离谱了。"},{"en":"Their argument became so absurd that no one took it seriously.","zh":"他们的论点荒谬到没人把它当回事。"}]},{"partOfSpeech":"n.","definition":{"en":"An absurd thing, idea, or situation (something that is ridiculous or illogical).","zh":"荒谬的事物/观点/处境（可笑或不合逻辑的东西）。"},"examples":[{"en":"What started as a small mistake turned into an absurd.","zh":"原本只是一个小错误，最后变成了一场荒谬的闹剧。"},{"en":"He tried to explain the absurd of the rules.","zh":"他试图说明这些规则的荒谬之处。"}]}],"synonyms":["ridiculous","nonsensical","illogical","unreasonable"],"phonetic":"/əbˈsɝːd/","extraExplanation":["你输入的“bsurd”很可能是拼写错误，常见正确拼写是 **absurd**。","词源与用法小贴士：**absurd** 常用于表达“逻辑上说不通/完全不合理”，语气比 “silly（傻的）” 更强调“不合逻辑”。常见搭配有 **absurd idea / absurd claim / absurd amount / sound absurd**。","文化/文学背景：在哲学与文学里有“**the Absurd（荒诞）**”的概念（如加缪 Camus），指人类在追寻意义时与世界的“无意义”之间的冲突。日常英语里通常只是“荒谬、离谱”的意思。"]}
{"word":"BSW","summary":{"en":"BSW most commonly means Bachelor of Social Work; in engineering it can also mean British Standard Whitworth (a screw thread standard).","zh":"BSW最常见指“社会工作学士”；在工程领域也可指“英制惠氏螺纹标准”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Bachelor of Social Work (an undergraduate university degree in social work).","zh":"社会工作学士（社会工作专业的本科学位）。"},"examples":[{"en":"She earned her BSW and now works with families in the community.","zh":"她取得了社会工作学士学位（BSW），现在在社区为家庭提供服务。"},{"en":"Many entry-level social work jobs accept applicants with a BSW.","zh":"许多社会工作入门岗位接受拥有BSW学位的申请者。"}]},{"partOfSpeech":"other","definition":{"en":"British Standard Whitworth (a traditional British screw thread standard, often seen in engineering contexts).","zh":"英制惠氏螺纹标准（英国传统的螺纹规格，常见于工程领域）。"},"examples":[{"en":"This old motorcycle uses BSW bolts, so metric tools won’t fit well.","zh":"这辆老摩托车用的是BSW螺栓，所以公制工具不太合适。"},{"en":"The manual lists the fastener size as 1/4 BSW.","zh":"说明书把紧固件尺寸标为 1/4 BSW。"}]}],"synonyms":["Bachelor of Social Work","British Standard Whitworth"],"phonetic":"/ˌbiː ɛs ˈdʌbəl.juː/","extraExplanation":["在教育语境里，BSW通常指社会工作专业的本科学位。不同地区对“社会工作者”是否需要执照/注册要求不同：有些地方BSW可从事部分岗位，但临床/心理治疗等更常需要MSW（社会工作硕士）及相关执照。","在工程语境里，BSW（惠氏螺纹）多见于较老的英国产设备、车辆与工具；与常见的公制螺纹（Metric）或英制UNC/UNF并不通用。"]}

