{"word":"BU","summary":{"en":"BU is commonly an abbreviation for Boston University or business unit; the meaning depends on context.","zh":"BU常见为Boston University（波士顿大学）或business unit（事业部/业务单元）的缩写，具体含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) Boston University, a private university in Boston, Massachusetts, USA.","zh":"（缩写）波士顿大学，美国马萨诸塞州波士顿的一所私立大学。"},"examples":[{"en":"She got accepted to BU and will study economics there.","zh":"她被BU录取了，将在那儿学经济学。"},{"en":"BU’s campus is close to the Charles River.","zh":"BU的校园靠近查尔斯河。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) business unit: a division of a company responsible for a product line, region, or function.","zh":"（缩写）业务单元/事业部：公司内负责某条产品线、某个地区或某项职能的部门。"},"examples":[{"en":"Our BU focuses on mobile apps in Asia.","zh":"我们的BU主要负责亚洲的移动应用业务。"},{"en":"The company merged two BUs to reduce costs.","zh":"公司合并了两个BU以降低成本。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) bed unit: a measure of hospital capacity (number of available beds).","zh":"（缩写）床位单位：衡量医院容量的指标（可用床位数量）。"},"examples":[{"en":"The report shows an increase in BU after the new wing opened.","zh":"报告显示新病区启用后，BU（床位数）增加了。"},{"en":"They’re short on BU during the winter peak.","zh":"冬季高峰期他们床位（BU）紧张。"}]}],"synonyms":["Boston University (for meaning 1)","business unit (for meaning 2)"],"phonetic":"/biː ˈjuː/","extraExplanation":["“BU”在口语里通常读作字母音“B-U”。具体含义高度依赖语境：在美国校园语境里常指Boston University；在职场邮件、PPT里常指business unit（事业部/业务单元）。","缩写在正式写作中首次出现时，通常建议先写全称再括号标注缩写（如：Boston University (BU)）。"]}
{"word":"bu","summary":{"en":"“BU” most commonly means “business unit” in companies; it can also stand for “Boston University.”","zh":"“BU”最常指公司里的“事业部/业务单元（business unit）”，也可指“波士顿大学（Boston University）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) business unit: a division or department within a company, often responsible for a product line or region.","zh":"（缩写）BU：事业部/业务单元；公司内部负责某一产品线或区域的部门。"},"examples":[{"en":"She leads the mobile BU in Asia.","zh":"她负责亚洲的移动业务BU（事业部）。"},{"en":"Our BU will report quarterly results to headquarters.","zh":"我们的BU将按季度向总部汇报业绩。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) Boston University: a private university in Boston, Massachusetts.","zh":"（缩写）BU：波士顿大学（美国马萨诸塞州波士顿的一所私立大学）。"},"examples":[{"en":"He studied economics at BU.","zh":"他在BU（波士顿大学）学习经济学。"}]}],"synonyms":["division","department","unit"],"phonetic":"/ˌbiːˈjuː/","extraExplanation":["在英文里“bu”常见于大写“BU”，作为缩写使用；写邮件或报告时，首次出现通常会先写全称（business unit）再在括号里注明（BU）。","如果你想问的是中文拼音“bù（不）”或日语里的“bu（ぶ）”，告诉我语境，我可以按对应语言解释。"]}
{"word":"Buñol","summary":{"en":"a town in eastern Spain known for the La Tomatina festival","zh":"西班牙东部以“番茄大战”闻名的小镇"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A town (municipality) in the province of Valencia, eastern Spain, famous for the annual tomato-throwing festival La Tomatina.","zh":"西班牙东部巴伦西亚省的一个城镇（市镇），因一年一度的“番茄大战”（La Tomatina）而闻名。"},"examples":[{"en":"Buñol is a small town near Valencia that hosts La Tomatina every August.","zh":"布尼奥尔是巴伦西亚附近的一个小镇，每年八月举办番茄大战。"},{"en":"We took a train from Valencia to Buñol for the festival.","zh":"我们从巴伦西亚坐火车去布尼奥尔参加节日。"}]}],"phonetic":"/buˈnjol/","extraExplanation":["La Tomatina（番茄大战）是布尼奥尔最广为人知的文化符号之一：参与者在街头互掷熟番茄，属于庆典性质的活动。","英文语境中常把 Buñol 作为旅游/节庆目的地提到；书写时注意字母 ñ（带波浪号的 n）。"],"etymology":"这是一个西班牙地名（当地也受巴伦西亚语影响）。其更早的词源在常见英语学习资料中不够确定；学习中可把它当作专有名词（地名）记忆即可。","mnemonic":["把 ñ 想成“n+轻微 y 音”（类似“纽/ny”的感觉）：Buñol 读起来接近“boo-NYOL”。","联想“番茄大战 La Tomatina 在这个镇举办”，用节日来记地名更牢。"]}

