{"word":"Bub","summary":{"en":"“Bub” most often means a baby, or a slang way to address someone (sometimes friendly, often patronizing). It can also mean a bubble in liquid.","zh":"“bub”最常指“婴儿/小宝宝”，也可作俚语称呼（有时友好，但常带居高临下）。此外还可指液体中的“气泡”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A baby or very young child.","zh":"（非正式）婴儿；小宝宝。"},"examples":[{"en":"The bub finally fell asleep after the bottle.","zh":"小宝宝喝完奶后终于睡着了。"},{"en":"They brought the new bub to meet the grandparents.","zh":"他们带新生宝宝去见祖父母。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, slang) A way to address someone (like “buddy”), sometimes friendly but often patronizing or dismissive, especially from an older person to a younger man.","zh":"（非正式，俚语）对人的称呼（类似“哥们/老弟”），有时友好，但常带居高临下或不耐烦的语气，尤其常见于年长者对年轻男性。"},"examples":[{"en":"Listen, bub, that’s not how we do it here.","zh":"听着，小子/老弟，我们这儿不是这么做的。"},{"en":"Thanks, bub—appreciate the help.","zh":"谢了，哥们——多亏你帮忙。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) A bubble (or bubbles), especially in liquids; also used in the phrase “bub up.”","zh":"（非正式）气泡；泡沫（尤指液体里的气泡）；也常见于短语“bub up”。"},"examples":[{"en":"You can see little bubs rising in the soda.","zh":"你能看到汽水里有小气泡往上冒。"},{"en":"The soup started to bub up as it heated.","zh":"汤加热后开始冒泡。"}]}],"synonyms":["baby","kiddo","buddy","pal","child","bubble"],"phonetic":"/bʌb/","extraExplanation":["“bub”在美式英语里最常见的两种用法是：①指婴儿；②当作称呼用（类似“buddy”），语气非常依场景而定：朋友之间可能轻松友好，但在争执或训话时常带“你小子/少来这套”的轻蔑感。","作为称呼时要注意文化语境：对陌生人使用“bub”在一些地区可能显得冒犯或挑衅，除非你很确定语境是开玩笑或彼此熟悉。"]}
{"word":"bub","summary":{"en":"“Bub” is an informal word meaning a baby/young child, or a familiar (sometimes slightly rude) way to address someone like “buddy.”","zh":"“bub”是口语词，可指“宝宝/小孩”，也可像“哥们/小子”一样称呼别人（有时略显不客气，取决于语气）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A baby or young child; a little one.","zh":"（非正式）宝宝；小孩；幼儿。"},"examples":[{"en":"How’s the bub sleeping tonight?","zh":"宝宝今晚睡得怎么样？"},{"en":"They brought their bub to the park.","zh":"他们带宝宝去公园了。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) A way to address someone (often a boy/man) in a familiar or slightly teasing way; similar to “buddy.”","zh":"（非正式）对某人（常指男孩/男人）的称呼，带熟络或轻微调侃的语气；类似“哥们/老兄”。"},"examples":[{"en":"Hey, bub, you dropped your wallet.","zh":"喂，老兄，你钱包掉了。"},{"en":"Listen, bub—don’t cut in line.","zh":"听着，小子——别插队。"}]},{"partOfSpeech":"n.","definition":{"en":"A bubble; also used to imitate a bubbling sound (rare in everyday writing).","zh":"气泡；也可用来模仿“咕嘟咕嘟”的冒泡声（书写中较少见）。"},"examples":[{"en":"A few bubs rose to the surface of the soup.","zh":"汤里冒上来几个气泡。"},{"en":"The pot went bub-bub-bub as it boiled.","zh":"锅开的时候咕嘟咕嘟响。"}]}],"synonyms":["baby","kid","little one","buddy","pal"],"phonetic":"/bʌb/","extraExplanation":["“bub”在英语里很口语化：在澳大利亚英语中更常用来指“宝宝/小孩”；在美式英语里，用来叫人“bub”有时带一点不耐烦或挑衅的感觉，是否礼貌取决于语气和关系。","在流行文化里（如漫画、电影台词），“Listen, bub”常用来表现强硬或警告的语气，因此对陌生人使用要谨慎。"]}
{"word":"buba","summary":{"en":"Buba most commonly means a traditional loose robe/tunic from West Africa; it can also be a person’s name.","zh":"buba最常指西非（尤尼日利亚）传统宽松长袍/罩衫；也可用作人名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a loose, flowing robe or tunic worn in parts of West Africa (especially Nigeria), often by men, and sometimes as part of a matching outfit.","zh":"（西非，尤指尼日利亚常见的）宽松长袍/罩衫；常为男性穿着，也可作为成套传统服饰的一部分。"},"examples":[{"en":"He wore a white buba with embroidered details for the celebration.","zh":"他在庆典上穿了一件带刺绣细节的白色buba长袍。"},{"en":"In the market, you can find buba made from brightly colored fabric.","zh":"在市场里，你能买到用鲜艳布料制作的buba。"}]},{"partOfSpeech":"n.","definition":{"en":"a given name or nickname in some cultures (spelling and usage vary).","zh":"人名或昵称（在不同文化中用法与拼写可能不同）。"},"examples":[{"en":"Buba introduced himself and asked where the meeting room was.","zh":"Buba自我介绍后，问会议室在哪里。"}]}],"synonyms":["robe","tunic","kaftan","traditional garment"],"phonetic":"/ˈbuːbə/","extraExplanation":["“buba”常见于尼日利亚等西非地区的传统服饰语境；在不同语言与族群中，具体款式与搭配会有差异（例如可与裤装、帽饰等一起穿）。","英语中该词多作为外来文化词汇使用；阅读或写作时可在首次出现处加上简短说明（如“a traditional West African robe”）以帮助不熟悉的读者理解。"]}
{"word":"bubal","summary":{"en":"“Bubal” is a rare word meaning a water buffalo (genus *Bubalus*).","zh":"“bubal”是一个较少见的词，意思是“水牛”（水牛属 *Bubalus*）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a water buffalo, especially one of the genus *Bubalus* (common in South and Southeast Asia).","zh":"水牛（尤指水牛属 *Bubalus* 的动物，常见于南亚与东南亚）。"},"examples":[{"en":"Farmers used a bubal to pull the plow through the wet rice fields.","zh":"农民用水牛在湿润的稻田里拉犁。"},{"en":"The bubal is well adapted to hot, humid climates.","zh":"水牛很适应炎热潮湿的气候。"}]}],"synonyms":["water buffalo","buffalo (in context)"],"phonetic":"/ˈbuːbəl/","extraExplanation":["“bubal”在现代日常英语里很少用，更常见的说法是“water buffalo”。它多出现在动物学、农业或较旧的书面语中。","词源上与拉丁化的动物分类名称 *Bubalus* 有关；在一些旧资料里，“bubal”也曾被用来指某些羚羊类（如“bubal hartebeest”），但这种用法现在较少见。"]}
{"word":"bubale","summary":{"en":"“Bubale” is a Yiddish affectionate name meaning “sweetheart/dear,” used for someone you love.","zh":"“bubale”是意第绪语的亲昵称呼，意思类似“宝贝/亲爱的”，用于称呼所爱之人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Yiddish, informal) A term of endearment meaning “sweetheart,” “dear,” or “darling,” often said to a child or loved one.","zh":"（意第绪语，非正式）亲昵称呼，意为“宝贝/亲爱的/小甜心”，常对孩子或亲近的人说。"},"examples":[{"en":"Come here, bubale—let me fix your scarf.","zh":"过来，宝贝——我帮你把围巾弄好。"},{"en":"Don’t worry, bubale. Everything will be okay.","zh":"别担心，亲爱的。一切都会好的。"},{"en":"His grandma still calls him bubale, even though he’s an adult.","zh":"虽然他已经是成年人了，但他奶奶仍然叫他“宝贝”。"}]}],"synonyms":["sweetheart","dear","darling","honey"],"phonetic":"/ˈbʊbələ/","extraExplanation":["“bubale”（也常拼作 bubele / bubeleh）来自意第绪语，是犹太（尤其东欧犹太）家庭里很常见的亲昵叫法，带有温柔、照顾、安抚的语气。","在英语语境中使用时，多见于美式犹太文化相关的家庭对话、影视作品或文学描写；通常用于亲近关系，不适合对陌生人使用，以免显得冒犯或不自然。"]}
{"word":"bubales","summary":{"en":"“Bubales” is an uncommon plural noun in older English meaning hartebeests (large African antelopes).","zh":"“bubales”是不常见的复数名词，多见于旧式英语，指狷羚（哈氏狷羚等大型非洲羚羊）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) hartebeests; large African antelopes (especially the species once called the “bubale”).","zh":"（复数）狷羚/哈氏狷羚等大型非洲羚羊；旧称“bubale”的那类羚羊。"},"examples":[{"en":"In older travel books, hunters sometimes wrote about seeing bubales on the savanna.","zh":"在较早的游记里，猎人有时会写到在稀树草原上看到成群的 bubales。"},{"en":"The guide explained that the “bubale” in the text refers to a kind of hartebeest, so “bubales” means more than one.","zh":"向导解释说，文中“bubale”指一种狷羚，所以“bubales”就是复数，表示不止一只。"}]}],"synonyms":["hartebeests","antelopes"],"phonetic":"/ˈbjuːbeɪlz/","extraExplanation":["“bubales”在现代英语中很少见，多出现在旧式资料或文学/博物学语境里。如今更常用的词是“hartebeest(s)”来指这类非洲羚羊。","词源上与拉丁语/希腊语中表示“野牛/水牛”的词根有关，因此在不同语言与旧分类里可能出现含义或指代动物的变化。"]}
{"word":"bubaline","summary":{"en":"Bubaline means “related to buffalo,” especially the water buffalo, and is mostly used in scientific contexts.","zh":"bubaline 指“与水牛/野牛相关的（尤指水牛）”，多用于学术或科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(biology, zoology) Relating to buffalo, especially the water buffalo.","zh":"（生物/动物学）与水牛或野牛相关的；牛属水牛类的。"},"examples":[{"en":"The museum has a bubaline skull from a water buffalo.","zh":"博物馆里有一具来自水牛的水牛类头骨。"},{"en":"Researchers compared bubaline and bovine immune responses.","zh":"研究人员比较了水牛类与牛类的免疫反应。"}]}],"synonyms":["buffalo","buffalo-related","bovine (related term)"],"phonetic":"ˈbjuːbəlaɪn","extraExplanation":["“bubaline”是较偏学术/技术的词，常见于动物学、比较解剖学、兽医学或科研语境；日常英语里更常直接说“buffalo (water buffalo)”或用“buffalo-related”。","词源来自拉丁语 *bubalus*（水牛/野牛），因此它与“bovine（牛的）”类似，都是用来表示“属于某一类动物的”形容词。注意“bubaline”特指水牛/野牛这一支，而“bovine”通常指家牛（cattle）。"]}
{"word":"Bubalis","summary":{"en":"Bubalis is an older/scientific word for an African antelope, especially the hartebeest.","zh":"Bubalis 是较旧/偏科学的用词，指非洲的一类羚羊，常特指哈氏角马羚（hartebeest）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an African antelope; in older or scientific usage, especially the hartebeest (and related animals).","zh":"（非洲）羚羊；在较旧或科学语境中常特指角马羚一类（如哈氏角马羚，hartebeest）"},"examples":[{"en":"In older books, “bubalis” often refers to the hartebeest.","zh":"在较旧的书里，“bubalis”常用来指哈氏角马羚（hartebeest）。"},{"en":"The museum label listed the specimen as Bubalis, an antelope from North Africa.","zh":"博物馆的标签把这件标本标为Bubalis，一种来自北非的羚羊。"}]}],"synonyms":["hartebeest","antelope"],"phonetic":"/ˈbjuːbəˌlɪs/","extraExplanation":["“Bubalis”多见于较旧的英文自然史写作或拉丁化的动物学名称中。现代科普英语里更常直接说“hartebeest（哈氏角马羚）”或更具体的属/种名。","词源来自希腊语/拉丁语中表示“野牛/大型有蹄类动物”的词根，历史上在不同作者那里指代范围不完全一致。","你可能会看到“Bubalis bubalis”这一旧名，用来指一种已灭绝的北非角马羚（有时称“bubal hartebeest”）。"]}
{"word":"bubalis","summary":{"en":"“Bubalis” is a rare, old-fashioned term used in some texts for an antelope (often associated with the hartebeest).","zh":"“bubalis”是一个较少见、偏古典的词，在部分旧文献中指羚羊类动物（常与牛羚相关）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an archaic or scholarly word for a kind of antelope (often linked to the hartebeest) in older zoological writing.","zh":"（较古老/学术用语）指一种羚羊类动物；在旧式动物学文献中常与“牛羚（hartebeest）”相关。"},"examples":[{"en":"In older natural history books, “bubalis” may appear as a name for an antelope-like animal.","zh":"在较早的博物学书籍里，“bubalis”有时会被用作一种类似羚羊的动物名称。"},{"en":"The term is rare in modern English; writers today usually say “antelope” or “hartebeest.”","zh":"这个词在现代英语中很少见；如今多用“antelope（羚羊）”或“hartebeest（牛羚）”。"}]}],"synonyms":["antelope","hartebeest"],"phonetic":"/ˈbjuːbəlɪs/","extraExplanation":["“Bubalis”主要见于较早的拉丁化动物命名与英文博物学写作中；现代科学分类里更常见的是更精确的属名/种名（例如与牛羚相关的分类）。因此在当代阅读与写作中，它更像是“历史用词”或“文献用词”。","注意不要与“Bubalus”（水牛属，如亚洲水牛）混淆；两者拼写相近，但指代并不相同，具体含义要看文本时代与语境。"]}
{"word":"bubalises","summary":{"en":"“Bubalises” is the plural of “bubalis,” a rare/older term for hartebeests (large African antelopes).","zh":"“Bubalises”是“bubalis”的复数，是一个较少见/较旧的词，指哈特贝斯特（牛羚）这类大型非洲羚羊。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of bubalis: hartebeests (a kind of large African antelope), especially in older or scientific writing.","zh":"bubalis 的复数：指角马类/狷羚类中的一种大型非洲羚羊（常译作“牛羚/哈特贝斯特”），多见于旧式或科学语境。"},"examples":[{"en":"Early explorers wrote about herds of bubalises on the savanna.","zh":"早期的探险者写到稀树草原上成群的 bubalises（牛羚）。"},{"en":"In older zoology books, the term “bubalis” may refer to animals we now call hartebeests.","zh":"在较旧的动物学书里，“bubalis”有时指的就是我们现在称为 hartebeest（哈特贝斯特/牛羚）的动物。"}]}],"synonyms":["hartebeests"],"phonetic":"/ˈbjuːbəlɪsiz/","extraExplanation":["这个词很少出现在日常英语里，更多见于旧文献或分类学语境。现代常用词是 hartebeest（哈特贝斯特/牛羚），而 “Bubalis” 也曾作为分类名称使用（如今分类多已调整）。","拼写上加 -es 是英语里把外来词当作普通名词处理的一种方式；你也可能在资料里看到拉丁/希腊式的复数变化，但在英语文章里未必统一。"]}
{"word":"Bubalo","summary":{"en":"“Bubalo” is usually a surname; in English contexts it may also be a misspelling of “buffalo.”","zh":"“Bubalo”通常是一个姓氏；在英语语境中也可能是把“buffalo”误拼成的写法。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper name) A family name (surname), found in some Slavic/Croatian contexts. Examples: “Ms. Bubalo spoke at the meeting.” / “I met Mr. Bubalo in Chicago.”","zh":"（专有名词）一个姓氏，在一些斯拉夫语/克罗地亚语背景中可见。例句：\"Bubalo 女士在会上发言。\" / \"我在芝加哥见到了 Bubalo 先生。\""},"examples":[{"en":"Ms. Bubalo spoke at the meeting.","zh":"Bubalo 女士在会上发言。"},{"en":"I met Mr. Bubalo in Chicago.","zh":"我在芝加哥见到了 Bubalo 先生。"}]},{"partOfSpeech":"other","definition":{"en":"(Likely a misspelling) Often written by mistake for “buffalo” (a large animal, or the city Buffalo in New York). Examples: “I meant ‘buffalo,’ not ‘Bubalo.’” / “Buffalo is a city in New York.”","zh":"（可能是拼写错误）常被误写为 “buffalo”（一种大型动物；或纽约州的布法罗市）。例句：\"我想写的是 buffalo，不是 Bubalo。\" / \"Buffalo 是纽约州的一座城市。\""},"examples":[{"en":"I meant “buffalo,” not “Bubalo.”","zh":"我想写的是 buffalo，不是 Bubalo。"},{"en":"Buffalo is a city in New York.","zh":"Buffalo 是纽约州的一座城市。"}]}],"synonyms":["(surname) none","(misspelling) buffalo"],"phonetic":"/buˈbɑloʊ/","extraExplanation":["“Bubalo”在英语里不是常见词汇，因此最常见的两种情况是：1）它是人名/姓氏；2）它是把“buffalo”误拼成了“Bubalo”。如果你告诉我你看到它的句子或语境（比如在哪本书、哪条信息里），我可以更准确判断意思与读音。"]}
{"word":"bubals","summary":{"en":"“Bubals” is the plural of “bubal,” meaning buffaloes, especially water buffalo, usually in formal/scientific or older writing.","zh":"“bubals”是“bubal”的复数，指水牛/野牛（尤指水牛），多见于较正式、科学或较旧的用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “bubal”: a buffalo, especially a water buffalo; sometimes used in scientific or historical writing.","zh":"“bubal”的复数：指水牛或（广义）野牛；常见于科学或较正式/历史性的语境。"},"examples":[{"en":"In some older texts, Asian water buffalo are called bubals.","zh":"在一些较早的文本中，亚洲水牛会被称为 bubals。"},{"en":"The researcher compared the horns of cattle and bubals.","zh":"研究人员比较了黄牛和水牛（bubals）的角。"}]}],"synonyms":["buffaloes","water buffalo","Asian water buffalo"],"phonetic":"/ˈbjuːbəlz/","extraExplanation":["“bubal”这个词比较少见，日常英语里更常说 buffalo 或 water buffalo。","词源可追溯到拉丁语 bubalus（与“牛/水牛”相关）。在生物学里也会看到属名 Bubalus（如水牛属），但日常写作一般不这么用。"]}
{"word":"bubas","summary":{"en":"“Bubas” is usually an outdated term for syphilis, or the plural of “buba” (a West African tunic).","zh":"“bubas”通常指过时用语“梅毒”，也可作“buba”（西非长衫）的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(archaic/medical) Syphilis; sometimes used broadly for venereal disease (now considered outdated and offensive in many contexts).","zh":"（古旧/医学用语）梅毒；有时也泛指性病（现多被视为过时，且在许多语境中不礼貌）。"},"examples":[{"en":"In some old texts, “the bubas” refers to syphilis.","zh":"在一些旧文献中，“the bubas”指梅毒。"},{"en":"Modern medical writing does not use “bubas.”","zh":"现代医学写作不会使用“bubas”。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “buba”: a loose, long tunic or robe worn in parts of West Africa (spelling and use vary by region).","zh":"“buba”的复数：西非部分地区穿的一种宽松的长上衣/长袍（不同地区拼写和用法可能不同）。"},"examples":[{"en":"They wore colorful bubas for the celebration.","zh":"他们在庆典上穿了色彩鲜艳的buba长衫。"},{"en":"Some shops sell matching bubas and trousers.","zh":"有些店会卖成套的buba上衣和长裤。"}]}],"synonyms":["syphilis (modern term)","the pox (old/ambiguous)","buba (singular, clothing)"],"phonetic":"/ˈbuːbəz/","extraExplanation":["“bubas”作为“梅毒”的意思主要见于早期英文/医学史资料，来源与法语/拉丁语的旧称相关。现代英语里几乎不用，日常表达应说“syphilis”。","如果你想表达的是名字所有格“Bubba’s”（例如“Bubba’s BBQ”），拼写需要加撇号：Bubba’s。也可能是人名/网名的复数或误拼。"]}
{"word":"Bubastid","summary":{"en":"Bubastid means “connected with the ancient Egyptian city Bubastis,” especially its Bastet (cat-goddess) worship; rarely, it can mean a person from Bubastis.","zh":"Bubastid 指“与古埃及城市布巴斯提斯有关的”，尤与猫神巴斯特及其崇拜相关；少见时也可指“布巴斯提斯的居民”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Bubastis (an ancient Egyptian city), especially to the goddess Bastet whose main cult center was there","zh":"与布巴斯提斯（古埃及城市）有关的；尤指与猫神巴斯特（Bastet）及其在该城的崇拜中心有关的"},"examples":[{"en":"Archaeologists uncovered Bubastid artifacts connected with the worship of Bastet.","zh":"考古学家发现了与巴斯特崇拜有关的布巴斯提斯出土文物。"},{"en":"The museum has a small display of Bubastid religious objects, including cat-shaped amulets.","zh":"博物馆有一小部分展品是布巴斯提斯相关的宗教器物，包括猫形护身符。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Bubastis; an inhabitant of Bubastis (rare)","zh":"布巴斯提斯人；布巴斯提斯的居民（较少见）"},"examples":[{"en":"In the story, a Bubastid guides the travelers through the festival streets.","zh":"在故事里，一位布巴斯提斯人带着旅人穿过节日的街道。"}]}],"synonyms":["Bubastite (more common)","of Bubastis"],"phonetic":"/buˈbæs.tɪd/","extraExplanation":["“Bubastid”来自城市名“Bubastis”（希腊文拼写；埃及语原名常写作 Per-Bastet，意为“巴斯特之屋/神庙”）。在英文里更常见的相关形容词是 “Bubastite”。","如果你是在读奇幻/历史题材作品时遇到该词，它通常用来营造“古埃及—猫神—祭典”的文化氛围，而不一定是日常英语词汇。"]}
{"word":"bubastid","summary":{"en":"Bubastid means connected to Bubastis in ancient Egypt (and often to the cult of the goddess Bastet there).","zh":"Bubastid 指与古埃及的布巴斯提斯有关（常也指与当地对猫神巴斯特的崇拜相关）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(often capitalized) Relating to Bubastis, an ancient city in Egypt, or to the goddess Bastet whose major temple was there.","zh":"（常大写）与布巴斯提斯（古埃及城市）有关的；或与猫神巴斯特（Bastet，主要神庙位于布巴斯提斯）有关的。"},"examples":[{"en":"Archaeologists found Bubastid-style amulets near the ruins of the temple.","zh":"考古学家在神庙遗址附近发现了布巴斯提斯风格的护身符。"},{"en":"The lecture compared Bubastid worship of Bastet with other Egyptian cults.","zh":"讲座将布巴斯提斯地区对巴斯特的崇拜与其他埃及宗教崇拜作了比较。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Bubastis (rare), or something originating from Bubastis.","zh":"（罕见）布巴斯提斯人；或来自布巴斯提斯的事物。"},"examples":[{"en":"The inscription names a Bubastid who served in the royal administration.","zh":"铭文提到一位在王室行政机构任职的布巴斯提斯人。"}]}],"synonyms":["Bubastite","of Bubastis","Bastet-related"],"phonetic":"/bjuːˈbæs.tɪd/","extraExplanation":["“Bubastid”源自希腊化形式的地名 Bubastis（布巴斯提斯）。在英语学术写作中，更常见的相关形容词是 “Bubastite”（如 Bubastite festival）。两者都可指与该城及其著名的巴斯特崇拜相关的文化与遗物。"]}
{"word":"Bubastis-related","summary":{"en":"“Bubastis-related” means connected to the ancient Egyptian city Bubastis and especially to traditions linked to the goddess Bastet.","zh":"“Bubastis-related”指与古埃及城市布巴斯提斯相关的，尤指与猫女神巴斯特信仰及其文化传统相关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with Bubastis (an ancient city in Egypt) or with the religious/cultural traditions linked to it, especially the worship of the cat goddess Bastet.","zh":"与布巴斯提斯（古埃及城市）有关的；或与其相关的宗教/文化传统有关的，尤指与猫女神巴斯特（Bastet）的崇拜相关。"},"examples":[{"en":"The museum has a small room of Bubastis-related artifacts, including cat-shaped amulets.","zh":"博物馆里有一间小展室展示与布巴斯提斯相关的文物，包括猫形护身符。"},{"en":"She wrote a paper on Bubastis-related festivals and what they reveal about daily life in ancient Egypt.","zh":"她写了一篇论文，研究与布巴斯提斯相关的节庆，以及这些节庆如何反映古埃及的日常生活。"}]}],"synonyms":["connected to Bubastis","Bubastis-associated","Bubastis-linked","Bastet-related"],"phonetic":"/buˈbæs.tɪs rɪˈleɪ.tɪd/","extraExplanation":["“Bubastis”是希腊化形式的地名（古埃及语名常转写为Per-Bastet，意为“巴斯特之屋/神庙”）。因此在学术写作中，Bubastis-related常用于指与该城遗址、出土物、宗教仪式或巴斯特信仰体系相关的内容。","这种“专名 + -related”的结构在英语里很常见，用来表示“与……相关的”，语气比“Bubastite/Bubastian”（较少见、偏专门的形容词形式）更通用、更易读。"]}
{"word":"Bubastite","summary":{"en":"Bubastite means “related to Bubastis (ancient Egypt)” or “a person from Bubastis.”","zh":"Bubastite 指“与古埃及城市布巴斯提斯有关的”，也可指“布巴斯提斯人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"of or relating to Bubastis (an ancient Egyptian city in the Nile Delta) or its culture, especially the cult of the goddess Bastet","zh":"与布巴斯提斯（古埃及尼罗河三角洲的一座城市）或其文化有关的；尤指与猫神巴斯特（Bastet）的崇拜有关的"},"examples":[{"en":"Archaeologists found Bubastite-style cat figurines at the site.","zh":"考古学家在遗址发现了布巴斯提斯风格的猫雕像。"},{"en":"The temple has reliefs with Bubastite influences.","zh":"这座神庙的浮雕带有布巴斯提斯的影响。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Bubastis; an inhabitant or native of ancient Bubastis","zh":"布巴斯提斯人；布巴斯提斯的居民或本地人（古代用法）"},"examples":[{"en":"The inscription mentions a Bubastite who served in the royal court.","zh":"铭文提到一位在王室任职的布巴斯提斯人。"}]}],"synonyms":["Bubastis-related","of Bubastis"],"phonetic":"/ˈbjuːbəˌstaɪt/","extraExplanation":["“Bubastite”来自城市名Bubastis（希腊化写法；现代遗址常称Tell Basta）。这座城市以猫神巴斯特（Bastet）的崇拜闻名，因此在艺术与宗教语境中，你会看到“Bubastite”与猫形象、护符、祭祀传统等一起出现。","在埃及学中，相关专名有时会出现，例如“Karnak的Bubastite Portal（布巴斯提斯门廊）”，与古埃及第二十二王朝法老Shoshenq一世的战功浮雕有关。"]}
{"word":"bubastite","summary":{"en":"Bubastite means a person from Bubastis or something connected to the ancient Egyptian city of Bubastis.","zh":"Bubastite 指“布巴斯提斯（古埃及城市）的居民”，或“与布巴斯提斯有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Bubastis (an ancient Egyptian city), or something relating to Bubastis","zh":"布巴斯提斯（古埃及城市）的居民；或与布巴斯提斯有关的人/事物"},"examples":[{"en":"A Bubastite might have traveled to other cities during major religious festivals.","zh":"布巴斯提斯的居民可能会在重要宗教节日期间前往其他城市。"},{"en":"The text describes a Bubastite celebration honoring the goddess Bastet.","zh":"这段文字描述了一场布巴斯提斯的庆典，用以敬奉女神巴斯特（Bastet）。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Bubastis, especially its culture, religion, or historical period","zh":"与布巴斯提斯有关的（尤指其文化、宗教或历史时期的）"},"examples":[{"en":"Archaeologists study Bubastite artifacts to understand local worship practices.","zh":"考古学家研究布巴斯提斯的文物，以了解当地的祭祀方式。"},{"en":"The museum has a small Bubastite-style amulet on display.","zh":"博物馆展出了一枚小型的布巴斯提斯风格护身符。"}]}],"synonyms":["of Bubastis","from Bubastis"],"phonetic":"/bjuːˈbæs.taɪt/","extraExplanation":["“Bubastite”来自古埃及城市名 Bubastis（希腊化拼写；古埃及语名常见转写为 Per-Bastet，意为“巴斯特的家/神庙”）。这座城市与猫神/母神 Bastet 的崇拜密切相关，因此在历史与考古语境中常出现。","在英文写作里，它多用于学术或历史叙述（如“Bubastite festival/temple/artifacts”），日常英语中非常少见。"]}
{"word":"Bubb","summary":{"en":"“Bub” is an informal word meaning a baby/child or a casual way to address someone (like “buddy”); as a verb it can rarely mean “to bubble.” “Bubb” is often a surname.","zh":"“bub”是非正式用语，可指“宝宝/小孩”，也可作对人的随意称呼（类似“哥们”）；作动词时较少见，可表示“冒泡”。“Bubb”常见为姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A baby or small child; a cute way to address a young child.","zh":"（非正式）婴儿；小孩；对小朋友的亲昵称呼。"},"examples":[{"en":"Come here, bub—let me help you with your shoes.","zh":"过来，小宝贝——我帮你穿鞋。"},{"en":"The doctor says the bub is healthy.","zh":"医生说宝宝很健康。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, especially in American English) A casual way to address a man or boy, like “buddy” (can sound friendly or rude depending on tone).","zh":"（非正式，尤指美式英语）对男性的随意称呼，类似“哥们/伙计”；语气可友好也可带挑衅，取决于语境。"},"examples":[{"en":"Hey, bub, you dropped your wallet.","zh":"嘿，哥们，你钱包掉了。"},{"en":"Listen, bub, that’s not how we do things here.","zh":"听着，伙计，我们这儿不是这么做的。（可能带点不客气）"}]},{"partOfSpeech":"vi.","definition":{"en":"(rare) To bubble up; to make a bubbling sound.","zh":"（少见）冒泡；发出咕嘟咕嘟的声音。"},"examples":[{"en":"The water began to bub gently in the pot.","zh":"锅里的水开始轻轻咕嘟冒泡。"}]}],"synonyms":["baby","kiddo","buddy","pal"],"phonetic":"/bʌb/","extraExplanation":["“Bubb”常见为姓氏（如作人名/品牌时通常不按普通词义解释）。如果你指的是人名、店名或游戏ID里的“Bubb”，可以告诉我上下文，我可以按专名用法帮你理解。","口语称呼“bub”有时会出现在电影/小说对白里：对孩子多为亲昵；对成年人则很看语气，可能是友好的“buddy”，也可能带有居高临下或挑衅的感觉。"]}
{"word":"Bubba","summary":{"en":"“Bubba” is an informal American nickname for a brother or male friend; it can also mean a stereotypical “regular/rural guy” (sometimes insulting) or be used as a person’s name.","zh":"“Bubba”是美式非正式昵称，可指兄弟或男性朋友；也可指刻板印象中的“普通/乡村老哥”（有时带贬义）；还可作为人名使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A friendly nickname for a brother, male child, or close male friend; common in the U.S., especially in the South.","zh":"（非正式）对兄弟、男孩或亲近男性朋友的昵称；在美国（尤其南方）较常见。"},"examples":[{"en":"Come on, Bubba, let’s go home.","zh":"走吧，Bubba，我们回家。"},{"en":"My little brother has been “Bubba” since he was a baby.","zh":"我弟弟从小婴儿起就一直被叫作“Bubba”。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, sometimes derogatory) A stereotypical “regular guy,” often implying someone is uneducated, unsophisticated, or rural.","zh":"（非正式，有时带贬义）对“普通老哥/大老粗”的刻板称呼，常暗示没受教育、不够精致或偏乡村。"},"examples":[{"en":"The ad tried to sound like it was made for the average Bubba.","zh":"这则广告想营造一种“给普通老哥看的”口吻。"},{"en":"Be careful—calling someone “a Bubba” can sound insulting.","zh":"要注意：把别人称作“a Bubba”可能听起来很冒犯。"}]},{"partOfSpeech":"n.","definition":{"en":"A male given name or nickname (used as a proper name).","zh":"男性名字或绰号（作为专有名使用）。"},"examples":[{"en":"Bubba said he’d pick us up at six.","zh":"Bubba 说他六点来接我们。"}]}],"synonyms":["buddy","pal","bro","dude"],"phonetic":"/ˈbʌbə/","extraExplanation":["“Bubba”常被认为来自小孩说“brother”的童语变体，后来演变为对男性亲友的昵称。","在大众文化中，“Bubba”常让人联想到美国南方或“老派、朴实”的形象；例如电影《阿甘正传》(Forrest Gump) 里的角色“Bubba”。","作为称呼时语气差异很大：对家人朋友可能很亲切，但用来指“某一类人”（a Bubba / the Bubbas）可能带刻板印象甚至贬义。"]}
{"word":"bubba","summary":{"en":"“Bubba” is an informal nickname for a brother or a friendly term for a guy, often with Southern U.S. flavor; it can also be a person’s nickname/name.","zh":"“Bubba”常作对兄弟/男孩的亲昵称呼，也可泛指“某个老哥/男人”（常带美国南方色彩），还可作为人的昵称/名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A nickname or friendly way to address a brother, close male relative, or a boy/young man, especially in the Southern U.S.","zh":"（非正式）对兄弟、亲近的男性亲属，或男孩/年轻男子的昵称或亲昵称呼，尤见于美国南方。"},"examples":[{"en":"Come here, Bubba—dinner’s ready.","zh":"过来，Bubba——晚饭好了。"},{"en":"I used to call my little brother Bubba when we were kids.","zh":"我们小时候我常叫我弟弟Bubba。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, sometimes humorous) A man—often suggesting a “regular guy,” and sometimes a stereotype of a rural or working-class Southern white man.","zh":"（非正式，有时带幽默）一个男人——常表示“普通老哥/一般人”，有时也会带有对美国南方乡村或工人阶层白人男性的刻板印象。"},"examples":[{"en":"Some bubba at the garage helped me change the tire.","zh":"修车铺里有个老哥帮我换了轮胎。"},{"en":"That movie leans on the ‘good ol’ bubba’ stereotype.","zh":"那部电影很依赖“南方老哥”的刻板印象。"}]},{"partOfSpeech":"n.","definition":{"en":"A male given name or nickname (often used as a childhood nickname that can continue into adulthood).","zh":"男性名字或昵称（常是童年昵称，也可能沿用到成年）。"},"examples":[{"en":"Bubba Wallace is a NASCAR driver.","zh":"Bubba Wallace 是一位 NASCAR 车手。"}]}],"synonyms":["bro","buddy","pal","fella","guy"],"phonetic":"/ˈbʌbə/","extraExplanation":["“Bubba”常被认为来自“brother”的儿语/童语发音（小孩子把 brother 说成 bubba），所以带有亲昵、家庭感。","当用来泛指“某个男人”时，语气可能是随意、搞笑，也可能带点贬义或刻板印象；在正式写作或不熟悉的场合使用要谨慎，避免冒犯。"]}
{"word":"bubbe","summary":{"en":"“Bubbe” means “grandmother,” commonly used in Jewish/Yiddish cultural contexts.","zh":"“bubbe”指“奶奶/外婆”，常见于犹太与意第绪语文化语境，带亲昵语感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A grandmother, especially in Jewish (Yiddish-speaking) families.","zh":"奶奶/外婆（多用于犹太家庭与意第绪语文化语境中）。"},"examples":[{"en":"My bubbe taught me how to make chicken soup.","zh":"我的bubbe教我怎么做鸡汤。"},{"en":"We visit Bubbe every Friday night for dinner.","zh":"我们每周五晚上都会去看Bubbe一起吃晚饭。"}]}],"synonyms":["grandmother","grandma","granny"],"phonetic":"/ˈbʌbi/","extraExplanation":["“bubbe”（也常拼作“bubbie”）来自意第绪语，是北美英语中常见的犹太文化借词。它通常带有亲昵、温暖的家庭情感色彩，类似英语里的“grandma / granny”。","用法上既可以小写（泛指：my bubbe），也可以大写当作称呼或家人给奶奶的“名字”（专指：Bubbe）。","相关词：zayde / zaide（爷爷/外公，意第绪语来源）；nana、grandma（更通用、文化中性）。"]}
{"word":"bubber","summary":{"en":"“Bubber” is an uncommon word meaning “to drink (especially alcohol)” or “a heavy drinker,” often with an old-fashioned or dialect feel.","zh":"“bubber”较少见，可指“喝（尤指酒）”，也可指“嗜酒者/酒客”，带有方言或较古旧的语感。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to drink (especially alcohol), often in a noisy or casual way; to gulp down drinks","zh":"喝（尤指酒）；常指随意地、咕嘟咕嘟地喝"},"examples":[{"en":"They sat by the fire, bubbering beer and telling stories.","zh":"他们坐在火炉旁，咕嘟咕嘟地喝着啤酒，讲着故事。"},{"en":"He went out to bubber with his friends after work.","zh":"他下班后出去和朋友喝酒去了。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who drinks a lot; a drinker","zh":"酒鬼；嗜酒者；爱喝酒的人"},"examples":[{"en":"In the old tale, the inn was full of bubbers and travelers.","zh":"在那个老故事里，旅店里挤满了酒客和旅人。"}]}],"synonyms":["drink","booze","gulp","chug","drinker"],"phonetic":"/ˈbʌbɚ/","extraExplanation":["“bubber”比较少见，多见于方言/文学式用法（常见于苏格兰英语或古旧表达）。日常英语里更常用 drink, booze, gulp, chug（口语）等。","容易和更常见的词混淆：blubber（鲸脂/哭哭啼啼）或 bubbler（喷泉式饮水器，在美国部分地区用法）。如果你想查的是其中一个，告诉我拼写或语境我可以换成正确词条。"]}
{"word":"bubbes","summary":{"en":"“Bubbes” means “grandmothers,” the plural of “bubbe,” a warm Yiddish-based term often used in American Jewish families.","zh":"“bubbes”指“外婆/奶奶们”，是“bubbe”的复数；源自意第绪语，在美国犹太家庭中常用，语气亲昵温暖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Yiddish/English, informal) Grandmothers; plural of “bubbe” (a grandma, especially in Jewish/Yiddish-speaking families).","zh":"（意第绪语/英语口语）外婆/奶奶们；“bubbe”（祖母、外婆，常见于犹太/意第绪语家庭）的复数。"},"examples":[{"en":"My bubbes always insist I eat more, even when I’m full.","zh":"我的外婆/奶奶们总是坚持要我多吃点，即使我已经很饱了。"},{"en":"We visited our bubbes for Shabbat dinner.","zh":"我们去看望外婆/奶奶们，一起吃安息日晚餐。"}]},{"partOfSpeech":"n.","definition":{"en":"(By extension, humorous/informal) Older women, especially in a warm, grandma-like way.","zh":"（引申，幽默/口语）年长的女士们，带有亲切、像“奶奶/外婆”一样的感觉。"},"examples":[{"en":"The neighborhood bubbes were chatting on the stoop like they do every afternoon.","zh":"附近的“奶奶们”像每天下午一样坐在门阶上聊天。"}]}],"synonyms":["grandmothers","grandmas","grannies"],"phonetic":"/ˈbʌbiz/","extraExplanation":["“bubbe/bubbes”来自意第绪语（Yiddish），在美国英语里常出现在犹太文化语境中，语气通常亲昵、温暖。","拼写有时也会见到“bubbies / bubbies”（不同家庭或转写习惯），但“bubbe(s)”最常见。","在非犹太语境使用时，可能带有文化借用色彩；如果不确定对方是否熟悉这个词，用“grandma/grandmother(s)”更稳妥。"]}
{"word":"bubbies","summary":{"en":"“Bubbies” most commonly means “grandmothers” (plural of bubbe/bubbie) in Jewish American English; it can also be slang for breasts.","zh":"“bubbies”最常见指“（复数）外婆/奶奶”（bubbe/bubbie 的复数），在美国犹太语境中常用；也可作俚语指胸部。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in Jewish American English) a grandmother; an affectionate term for an older woman.","zh":"（尤指美国犹太英语）外婆/奶奶；对年长女性的亲昵称呼。"},"examples":[{"en":"My bubbies always made chicken soup when we were sick.","zh":"我外婆（/奶奶们）在我们生病时总会做鸡汤。"},{"en":"We’re visiting my bubbies for the holidays.","zh":"假期我们要去看望我的外婆/奶奶们。"},{"en":"She spoke about her bubbies with a lot of love and respect.","zh":"她谈起自己的外婆/奶奶时充满爱与尊敬。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, slang) breasts.","zh":"（非正式俚语）胸部/乳房。"},"examples":[{"en":"That word can sound rude, so be careful with it in public.","zh":"这个说法可能显得粗鲁，所以在公共场合要谨慎使用。"}]}],"synonyms":["grandmas","grandmothers","nanas","bubbes"],"phonetic":"/ˈbʌbiz/","extraExplanation":["“bubbies”通常是单词“bubbe / bubbie”的复数形式，来自意第绪语（Yiddish），在许多犹太家庭里是孩子对“奶奶/外婆”的亲昵称呼。拼写不固定：bubbe、bubbie、bubbi 等都可能见到。","第二个含义（指胸部）属于俚语，用法更口语、也更容易冒犯他人；如果你是英语学习者，建议优先掌握“祖母”的家庭称呼用法。"]}
{"word":"bubble","summary":{"en":"“Bubble” most often means a small ball of air/gas in liquid (or a soap bubble), and it can also mean a fragile boom that may suddenly collapse (a “bubble”). It can be a verb meaning “to form bubbles.”","zh":"“bubble”最常指液体中的气泡或肥皂泡；也可指可能突然破裂的“泡沫”（如经济泡沫）。作动词时表示“冒泡/起泡”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small ball of air or gas in a liquid, or a thin ball of air/gas with a surface film (like soap).","zh":"（液体中的）气泡；（肥皂水吹出的）泡泡。"},"examples":[{"en":"Bubbles rose to the surface of the boiling water.","zh":"气泡从沸水里冒到水面。"},{"en":"The kids blew soap bubbles in the park.","zh":"孩子们在公园里吹泡泡。"}]},{"partOfSpeech":"n.","definition":{"en":"A situation that seems successful or exciting but is fragile and may suddenly end or fail.","zh":"（看似繁荣却脆弱的）泡沫；（可能突然破裂的）虚假繁荣。"},"examples":[{"en":"Many people worried the housing market was a bubble.","zh":"很多人担心房地产市场是个泡沫。"},{"en":"Their perfect image turned out to be a bubble.","zh":"他们看似完美的形象最终被证明只是泡影。"}]},{"partOfSpeech":"vi.","definition":{"en":"To form bubbles or to move up in bubbles (often in liquid); to foam gently.","zh":"冒泡；起泡；（液体）咕嘟咕嘟地翻滚。"},"examples":[{"en":"The soup began to bubble on the stove.","zh":"汤在炉子上开始咕嘟咕嘟地冒泡。"},{"en":"The chemical mixture bubbled and gave off heat.","zh":"化学混合物冒泡并放出热量。"}]},{"partOfSpeech":"vt.","definition":{"en":"To make something form bubbles; to fill something with bubbles (often with “up”).","zh":"使起泡；使冒泡（常与 up 连用）。"},"examples":[{"en":"She bubbled up some sparkling water for the guests.","zh":"她为客人倒了些气泡水。"},{"en":"The machine bubbles air into the tank.","zh":"机器把空气打进水箱里产生气泡。"}]},{"partOfSpeech":"n.","definition":{"en":"A light, lively, and cheerful quality (often “bubbles” as a noun).","zh":"活泼开朗的特质；（性格）很有朝气。"},"examples":[{"en":"Her laughter and bubbles made everyone feel relaxed.","zh":"她的笑声和活力让大家都放松下来。"},{"en":"He’s full of bubbles in the morning.","zh":"他早上特别有精神、很活跃。"}]}],"synonyms":["(n.) air bubble","(n.) soap bubble","(n.) foam","(n., figurative) boom","(n., figurative) hype","(vi.) fizz","(vi.) gurgle","(vi.) simmer","(vt.) aerate"],"phonetic":"/ˈbʌbəl/","extraExplanation":["“bubble”作“泡沫（经济泡沫）”时很常见：a stock/tech/housing bubble，意思是价格被炒得过高、脱离实际价值，最后可能“burst（破裂）”。","常见搭配：bubble up（突然涌现/情绪上涌，如 Memories bubbled up）、in a bubble（与现实隔绝，如 living in a bubble）、burst someone’s bubble（戳破某人的幻想）。","文学/文化中常用“bubble”象征短暂与易碎：beautiful but temporary（美丽却短暂）。"]}
{"word":"bubble bath","summary":{"en":"A bath with lots of soapy bubbles, or the liquid used to make them.","zh":"带大量泡沫的洗澡方式，或用于起泡的沐浴产品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A bath with soap or liquid added to make lots of bubbles (foam) in the water; also the product used to create those bubbles.","zh":"在洗澡水里加入起泡的沐浴液/泡泡浴露，使水面产生大量泡沫的洗澡方式；也可指用来起泡的产品。"},"examples":[{"en":"After a long day, she took a warm bubble bath to relax.","zh":"忙了一整天后，她泡了个温暖的泡泡浴来放松。"},{"en":"This bubble bath smells like lavender.","zh":"这款泡泡浴露闻起来像薰衣草。"},{"en":"Don’t use too much bubble bath, or the tub will overflow with foam.","zh":"别倒太多泡泡浴露，不然浴缸会被泡沫溢满。"}]},{"partOfSpeech":"n.","definition":{"en":"A tub or container filled with bubbly water (often for children) for washing or play.","zh":"装满起泡洗澡水的浴缸/浴盆（常用于给孩子洗澡或玩水）。"},"examples":[{"en":"The kids begged for a bubble bath tonight.","zh":"孩子们今晚央求要泡泡浴。"},{"en":"He poured in the soap and the bubble bath grew bigger and bigger.","zh":"他倒入沐浴液，泡泡越起越多。"}]}],"synonyms":["foam bath","bubbly bath","bath foam","bath bubbles","bath soak"],"phonetic":"/ˈbʌbəl bæθ/","extraExplanation":["日常口语里，bubble bath 既可以指“泡泡浴（这件事）”，也可以指“泡泡浴露（产品）”。如果想明确是产品，可以说 bubble bath liquid / bubble bath soap。","在英美文化中，泡泡浴常和“放松、居家护理（self-care）”联系在一起；广告里常见薰衣草、洋甘菊等“助眠/放松”的香味。"],"etymology":"由“bubble（泡泡）+ bath（洗澡）”构成的复合名词；20世纪起在英语中常用来指加入起泡清洁剂的洗澡方式，也逐渐延伸为指相关产品。","mnemonic":["把它拆开记：bubble=泡泡，bath=洗澡 → “泡泡+洗澡”就是“泡泡浴”。","联想中文“泡泡浴”：读起来和英文含义一一对应，几乎不用翻译记忆。"]}
{"word":"bubble economy","summary":{"en":"An asset-price boom driven by speculation that later collapses.","zh":"由投机推动、资产价格虚高并最终可能崩盘的经济状态。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"An economy in which prices of assets (such as real estate or stocks) rise far above their real value, driven by speculation and easy credit, often followed by a sudden crash.","zh":"指资产（如房地产、股票）价格在投机和宽松信贷推动下远高于其真实价值、随后往往突然崩盘的经济状态（泡沫经济）。"},"examples":[{"en":"Japan’s bubble economy burst in the early 1990s, and growth slowed for years afterward.","zh":"日本的泡沫经济在20世纪90年代初破裂，此后多年增长放缓。"},{"en":"During a bubble economy, people may buy houses mainly to resell them at a higher price.","zh":"在泡沫经济时期，人们可能买房主要是为了更高价转卖。"},{"en":"Cheap loans and high expectations can help create a bubble economy.","zh":"廉价贷款和过高预期可能促成泡沫经济。"}]}],"synonyms":["asset bubble","economic bubble","speculative bubble","housing bubble","stock market bubble"],"phonetic":"/ˈbʌbəl ɪˈkɑnəmi/","extraExplanation":["常见搭配：the bubble economy burst（泡沫经济破裂）；a bubble economy fueled by speculation（被投机推动的泡沫经济）；asset bubble（资产泡沫）。","“bubble economy”和“boom economy”不同：boom强调真实增长与繁荣；bubble强调价格脱离价值、风险累积。"],"etymology":"“bubble”本义是“气泡”，引申为“看似很大但不稳、容易破裂的繁荣”。“bubble economy”在英语中常用来指日本1980年代末的资产泡沫及其破裂，后来也用于其他国家类似的资产泡沫周期。","mnemonic":["把经济想成“肥皂泡”：越吹越大（价格暴涨），但很脆（随时会破）。","联想中文“泡沫”：表面热闹、内部空，容易“破”。"]}
{"word":"bubble up","summary":{"en":"to rise to notice or to the surface; to emerge gradually","zh":"逐渐浮现/传开；（像气泡一样）冒到表面"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"To become known, noticeable, or important gradually (often from a lower level to wider attention).","zh":"（信息/问题/情绪等）逐渐浮现、传开、变得引人注意（常指从小范围到更广泛关注）。"},"examples":[{"en":"Complaints started to bubble up online after the update.","zh":"更新后，网上开始逐渐冒出很多投诉。"},{"en":"A serious safety issue bubbled up during the inspection.","zh":"检查过程中，一个严重的安全问题浮现出来。"},{"en":"Rumors bubbled up in the office, but no one had facts.","zh":"办公室里谣言渐渐传开，但没人掌握事实。"}]},{"partOfSpeech":"phrase","definition":{"en":"To rise to the surface, like bubbles in liquid; to bring something up to the surface or top level.","zh":"（像气泡一样）冒到表面；也可指把某物“顶”到上面/表层。"},"examples":[{"en":"Oil began to bubble up on the water.","zh":"油开始在水面上冒出来。"},{"en":"When the soup heats up, small bubbles bubble up along the edge.","zh":"汤加热后，锅边会冒出小气泡。"},{"en":"Stress bubbled up and finally showed in his voice.","zh":"压力一点点涌上来，最后在他的声音里显露出来。"}]},{"partOfSpeech":"phrase","definition":{"en":"To suddenly come into your mind or feelings, often without warning.","zh":"（想法/记忆/情绪）突然冒出来、涌上心头。"},"examples":[{"en":"An old memory bubbled up when I heard that song.","zh":"听到那首歌时，一段旧回忆突然涌上心头。"},{"en":"Anger bubbled up, but she stayed calm.","zh":"怒气涌上来，但她仍保持冷静。"}]}],"synonyms":["emerge","surface","come up","arise","crop up","well up","rise","appear"],"phonetic":"/ˈbʌbəl ʌp/","extraExplanation":["常见搭配：bubble up to the surface（浮到表面/浮出水面）；bubble up into the public eye（进入公众视野）。","语气多为口语/新闻报道常用，比“appear/emerge”更有“慢慢冒出来、从底层上升”的画面感。"],"etymology":"源自“bubble（气泡）+ up（向上）”的字面意象：气泡从液体底部往上升到表面。后来比喻用来描述消息、问题、情绪“浮出水面/传开”。","mnemonic":["把它想成“开水冒泡往上”：事情不是一下子出现，而是像气泡一样一颗颗往上冒。","“up=往上”，联想到中文“冒上来/浮上来/涌上来”。"]}
{"word":"bubblebow","summary":{"en":"“Bubblebow” is not a standard dictionary word; it’s usually a name. Literally, it can mean a puffy, bubble-like ribbon bow.","zh":"“Bubblebow”不是常见词，多为名称；按字面可理解为“泡泡状、蓬蓬的蝴蝶结”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A nonstandard or uncommon word. It most often appears as a made-up name (e.g., a username, product name, or character name). If used literally, it can mean “a bow (ribbon) with a bubbly/rounded look.”","zh":"一个不标准或不常见的词。多见于自创名称（如用户名、商品名、角色名）。若按字面理解，可指“看起来圆鼓鼓、像泡泡一样的蝴蝶结”。"},"examples":[{"en":"Her handle online is “Bubblebow.”","zh":"她的网名是“Bubblebow”。"},{"en":"The dress has a bubblebow on the back—like a puffy ribbon bow.","zh":"那条裙子背后有一个“bubblebow”——像鼓起的丝带蝴蝶结。"}]},{"partOfSpeech":"adj.","definition":{"en":"Used informally as an adjective before a noun to describe something shaped like a puffy/bubbly bow.","zh":"非正式用作形容词，放在名词前，表示“泡泡状/蓬蓬的蝴蝶结样”的。"},"examples":[{"en":"She wore a bubblebow clip in her hair.","zh":"她头发上夹了一个泡泡蝴蝶结发夹。"}]}],"synonyms":["hair bow","ribbon bow","bowknot","puffy bow"],"phonetic":"/ˈbʌbəlˌboʊ/","extraExplanation":["“bubblebow”不是常见英语词典词条，更像是由 bubble（泡泡、圆鼓鼓的）+ bow（蝴蝶结/弓形）拼出的自造复合词。若你是在某个品牌、游戏、漫画或社群里看到它，它的具体含义可能以该作品/社区的设定为准。","如果你愿意，把你看到“bubblebow”的完整句子或截图发来，我可以根据语境帮你确定最准确的意思和对应翻译。"]}
{"word":"bubbled","summary":{"en":"“Bubbled” means something formed bubbles, rose up like bubbles, or (figuratively) someone spoke in an excited, lively way.","zh":"“bubbled”表示起泡、像气泡一样涌出/浮上来，也可比喻兴奋地说个不停。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Past tense/past participle of “bubble”) To form bubbles in a liquid, or to make something produce bubbles.","zh":"（bubble 的过去式/过去分词）在液体中形成气泡；使……起泡。"},"examples":[{"en":"The soup bubbled gently on the stove.","zh":"汤在炉子上咕嘟咕嘟地轻轻冒泡。"},{"en":"She bubbled the air through the water to add oxygen.","zh":"她让空气穿过水来增加氧气。"}]},{"partOfSpeech":"v.","definition":{"en":"To rise and move like bubbles; to come up to the surface in a lively way (often figurative).","zh":"像气泡一样上升、涌出；（常指情绪、想法等）涌上心头、自然流露。"},"examples":[{"en":"Laughter bubbled up from the crowd.","zh":"人群中爆发出笑声。"},{"en":"Old memories bubbled to the surface when I heard that song.","zh":"听到那首歌时，往事涌上心头。"}]},{"partOfSpeech":"v.","definition":{"en":"To talk in an excited, cheerful, or nonstop way.","zh":"兴奋地、愉快地（或停不下来地）说个不停。"},"examples":[{"en":"She bubbled about her trip for an hour.","zh":"她兴致勃勃地讲了一个小时的旅行见闻。"},{"en":"The kids bubbled with excitement before the show.","zh":"演出前孩子们兴奋得叽叽喳喳。"}]}],"synonyms":["foamed","fizzed","gurgled","boiled","effervesced","chattered"],"phonetic":"/ˈbʌbəld/","extraExplanation":["“bubble”既可描述真实的液体起泡（bubbled water/soap), 也常用于比喻：情绪、笑声、记忆“涌出”（bubbled up）。在叙事写作里，用 bubbled 往往带有轻快、活泼、带点童真或兴奋的语气。"]}
{"word":"bubbleless","summary":{"en":"“Bubbleless” means without bubbles, often referring to drinks that aren’t carbonated.","zh":"“bubbleless”表示“无气泡的”，常指不含碳酸气泡的饮料。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"without bubbles; not containing or producing bubbles (especially of carbonated drinks).","zh":"无气泡的；不起泡的（尤指饮料不含二氧化碳气泡）。"},"examples":[{"en":"Could I get bubbleless water, please?","zh":"请给我一杯无气泡的水，好吗？"},{"en":"This soda tastes bubbleless because it’s been open all day.","zh":"这瓶汽水喝起来没气了，因为它开了一整天。"},{"en":"Some people prefer bubbleless drinks because they’re gentler on the stomach.","zh":"有些人更喜欢无气泡的饮料，因为对胃更温和。"}]}],"synonyms":["still","non-carbonated","flat (for drinks)","unfizzy"],"phonetic":"/ˈbʌbələs/","extraExplanation":["“bubbleless”在日常英语中不算很常见，更常用的表达是 still water（无气泡水）或 non-carbonated（非碳酸的）。在点饮料时，sparkling water=有气泡水，still water=无气泡水。"]}
{"word":"bubblelike","summary":{"en":"“Bubblelike” means having the look or feel of a bubble—rounded, puffy, or foamy.","zh":"“bubblelike”表示“像气泡一样的”，常指圆鼓、蓬松或泡沫状的外观/质感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a bubble in shape, texture, or appearance; round, swollen, or airy-looking.","zh":"像气泡的；呈泡状的；看起来圆鼓鼓或轻飘飘的。"},"examples":[{"en":"The foam formed a bubblelike layer on top of the coffee.","zh":"泡沫在咖啡上方形成了一层泡泡状的薄层。"},{"en":"Her bubblelike dress had a rounded skirt that puffed out.","zh":"她那件泡泡裙的裙摆圆鼓鼓地蓬起来。"},{"en":"The rock had a bubblelike surface from trapped gas.","zh":"这块岩石因为气体被困住而呈现泡泡状的表面。"}]}],"synonyms":["bubbly","puffy","foamy","bulbous"],"phonetic":"/ˈbʌbəlˌlaɪk/","extraExplanation":["“bubblelike”= bubble + like（像……一样）。常见拼写也有“bubble-like”（带连字符），两者意思相同。","常用于描述外观或质感：如泡沫/泡泡膜（bubblelike foam/film）、圆鼓的造型（bubblelike skirt）、材料表面因气体产生的孔洞（bubblelike texture/surface）。在科学语境里也可形容细胞、气泡结构或多孔材料的形态。"]}
{"word":"bubblement","summary":{"en":"“Bubblement” is a rare/coinage meaning a bubbly feeling or the process of bubbling; it’s not standard English.","zh":"“Bubblement”是罕见/自造词，可能指“活泼轻快的感觉”或“冒泡过程”，并非标准英语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard/rare) A coined word that can mean “a state or feeling of being bubbly/lively,” or “the act/process of bubbling.” It is not a common dictionary word in modern English.","zh":"（非标准/罕见）一种自造词，可能表示“活泼、轻快、充满泡泡感的状态/感觉”，也可能指“起泡、冒泡的过程”。现代英语中并非常见词典词汇。"},"examples":[{"en":"After the good news, there was a real bubblement in the room—everyone felt lighter.","zh":"好消息之后，房间里出现了一种“bubblement”的氛围——大家都觉得轻松了。"},{"en":"You can hear the bubblement of the soup as it starts to boil.","zh":"汤开始沸腾时，你能听到它“bubblement”的咕嘟冒泡声。"}]}],"synonyms":["excitement","cheerfulness","liveliness","bubbling","effervescence"],"phonetic":"/ˈbʌbəlmənt/","extraExplanation":["“bubblement”很可能是拼写错误、品牌名/网名，或把 bubble（泡泡、活泼）+ -ment（名词后缀，表示“状态/过程”，如 excitement, movement）临时组合出来的创意词。正式写作中不建议使用，除非你是在写诗、广告文案或角色台词。","如果你想表达常见意思，可以改用更标准的词：\n- 表示“兴奋/振奋”：excitement, cheerfulness, liveliness\n- 表示“冒泡/起泡过程”：bubbling, effervescence\n你也可以告诉我你想表达的语境（饮料冒泡？心情雀跃？），我可以帮你选最自然的表达。"]}
{"word":"bubbler","summary":{"en":"A “bubbler” is either a drinking fountain (regional U.S. term) or a device that makes bubbles in water.","zh":"“bubbler”既可指（美式地域用法的）饮水台，也可指让水产生气泡的冒泡装置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A drinking fountain (a public device that provides water to drink).","zh":"饮水台；公共饮水器（提供饮用水的公共装置）。"},"examples":[{"en":"There’s a bubbler next to the restroom—let’s get some water.","zh":"洗手间旁边有个饮水台——我们去喝点水吧。"},{"en":"In some parts of the U.S., people say “bubbler” instead of “drinking fountain.”","zh":"在美国的一些地区，人们会用“bubbler”来代替“drinking fountain（饮水台）”。"}]},{"partOfSpeech":"n.","definition":{"en":"A device that makes bubbles in a liquid, especially an aquarium air stone/pump or a decorative bubble maker.","zh":"起泡装置；冒泡器（使液体产生气泡的设备，如鱼缸增氧泵/气泡石等）。"},"examples":[{"en":"We added a bubbler to the fish tank to give the water more oxygen.","zh":"我们给鱼缸装了个冒泡器，让水里有更多氧气。"},{"en":"The garden pond has a small bubbler that keeps the water moving.","zh":"花园池塘里有个小冒泡器，让水保持流动。"}]}],"synonyms":["drinking fountain","water fountain","fountain","aerator","air stone"],"phonetic":"/ˈbʌb.lɚ/","extraExplanation":["“bubbler=饮水台”是一种很有地域色彩的美式英语说法，尤其常见于威斯康星州、罗德岛州以及马萨诸塞州部分地区；在美国其他很多地方更常说“drinking fountain”。旅行或看美剧时遇到这个词，往往指的就是公共饮水台。","这个词来自“bubble（冒泡）”，早期某些饮水装置出水方式像“冒泡”一样，因此得名。"]}
{"word":"bubblers","summary":{"en":"“Bubblers” is the plural of “bubbler,” meaning (1) a regional term for a drinking fountain, (2) a device that makes bubbles in liquid, or (informally) (3) a drug-smoking pipe.","zh":"“Bubblers”是“bubbler”的复数，常指（1）地区用语的“饮水机/饮水喷泉”，（2）液体起泡装置，或（非正式）（3）吸毒用烟斗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Regional US, especially Wisconsin/parts of New England) a drinking fountain; a public device that provides water to drink.","zh":"（美国地区用法，尤指威斯康星州/新英格兰部分地区）饮水机；公共饮水喷泉。"},"examples":[{"en":"There’s a bubbler in the hallway outside the gym.","zh":"体育馆外走廊里有一台饮水机。"},{"en":"In Wisconsin, many people call a drinking fountain a “bubbler.”","zh":"在威斯康星州，很多人把饮水机叫作“bubbler”。"}]},{"partOfSpeech":"n.","definition":{"en":"a device or part of a machine that makes bubbles in a liquid (for example, in an aquarium, spa, or lab equipment).","zh":"起泡装置；（如水族箱、按摩浴缸或实验设备中的）气泡发生器。"},"examples":[{"en":"The aquarium bubbler keeps the water moving and adds oxygen.","zh":"水族箱的气泡器让水流动并增加含氧量。"},{"en":"Turn on the bubbler to make the bath more relaxing.","zh":"打开起泡装置，让泡澡更放松。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, slang) a pipe used to smoke drugs; usage often refers to illegal drug use.","zh":"（非正式/俚语）吸毒用的烟斗；常与非法毒品相关。"},"examples":[{"en":"The report mentioned a “bubbler” found at the scene.","zh":"报告提到现场发现了一个“bubbler”（吸毒用具）。"}]}],"synonyms":["drinking fountain","water fountain","fountain","aerator","air stone"],"phonetic":"/ˈbʌblɚ/","extraExplanation":["“Bubbler”作“饮水机”的地区用法很有名：常被认为起源于20世纪初威斯康星州的饮水器品牌与设计（出水像“冒泡”一样），后来在当地口语里固定下来。因为是地域词，在美国其他地区更常说 drinking fountain / water fountain。"]}
{"word":"bubbles","summary":{"en":"“Bubbles” most commonly means small gas balls in liquid (or soap bubbles). It can also mean a market “bubble,” and “to bubble” means to form or rise in bubbles (or, informally, to talk excitedly).","zh":"“bubbles”最常指液体中的气泡（或肥皂泡泡）；也可指市场“泡沫”。动词“bubble”表示起泡/冒泡，口语中也可表示兴奋地滔滔不绝。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small round ball of air or gas trapped in a liquid (or sometimes in a solid), often seen in water, soda, or soap foam.","zh":"（液体中，或有时固体中）被困住的空气或气体形成的圆形小泡；常见于水、汽水或肥皂泡沫中。"},"examples":[{"en":"Bubbles rose to the surface of the soda.","zh":"汽水的气泡冒到了表面。"},{"en":"There were bubbles in the paint, so the wall looked uneven.","zh":"油漆里有气泡，所以墙面看起来不平整。"}]},{"partOfSpeech":"n.","definition":{"en":"Soap bubbles: thin balls of soap film filled with air, often used as a toy or for decoration.","zh":"（肥皂）泡泡：由肥皂水薄膜形成、里面充满空气的泡泡，常用于玩耍或装饰。"},"examples":[{"en":"The kids chased the bubbles in the park.","zh":"孩子们在公园里追着泡泡跑。"}]},{"partOfSpeech":"v.","definition":{"en":"To form bubbles, or to move with bubbles rising (as a liquid heats or becomes fizzy).","zh":"起泡；冒泡（液体受热或变得含气时出现气泡上升的现象）。"},"examples":[{"en":"The water began to bubble as it heated.","zh":"水加热后开始冒泡。"},{"en":"The soup bubbled gently on the stove.","zh":"汤在炉子上轻轻地咕嘟冒泡。"}]},{"partOfSpeech":"v.","definition":{"en":"To speak excitedly and quickly; to overflow with cheerful talk (informal).","zh":"（非正式）兴奋地滔滔不绝；话很多、很雀跃地说。"},"examples":[{"en":"She bubbled about her trip for hours.","zh":"她兴奋地聊了好几个小时的旅行。"}]},{"partOfSpeech":"n.","definition":{"en":"A temporary situation of rapid growth and high prices that may suddenly collapse (e.g., a housing bubble).","zh":"（经济/市场）泡沫：短期内快速膨胀、价格虚高且可能突然崩溃的状态（如房市泡沫）。"},"examples":[{"en":"Some economists warned that the housing market was a bubble.","zh":"一些经济学家警告房市存在泡沫。"}]}],"synonyms":["foam","fizz","froth","blister","market bubble"],"phonetic":"/ˈbʌbəlz/","extraExplanation":["“bubble”除了字面“气泡”，在英语里很常见的引申义是“泡沫/圈子”。比如“in a bubble”表示生活在与现实隔绝的环境或信息圈里（如：They live in a bubble. / 他们活在自己的小圈子里）。","与“bubbles”相关的拟声表达：形容水开时常用“bubble”或更口语的“gurgle/boil”。“The pot is bubbling.”更像“咕嘟咕嘟冒泡”，而“boiling”更强调已经沸腾。"]}
{"word":"bubblest","summary":{"en":"“Bubblest” is an archaic/poetic form meaning “you bubble,” used with “thou.”","zh":"“bubblest”是古用/诗歌体，意思是“你在冒泡/翻腾”，常与 thou 连用。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Archaic, poetic) “you bubble”: second-person singular present form of “bubble,” used with “thou.” It means liquid or air moves up in small round balls, or something is lively and full of excited talk/feeling.","zh":"（古用/诗歌用法）“你在冒泡/翻腾”：动词 bubble 的第二人称单数现在时，常与 thou 连用。表示液体或空气冒出小泡；也可引申为情绪/谈话很活跃、兴奋地涌现。"},"examples":[{"en":"Thou bubblest like a spring after the rain.","zh":"雨后，你像泉水一样汩汩冒泡。"},{"en":"In her letters, thou bubblest with hope and laughter.","zh":"在她的信里，你满是希望与笑声，情绪像气泡般涌出。"}]}],"synonyms":["(modern form) you bubble","(similar idea) fizz","gurgle","effervesce"],"phonetic":"/ˈbʌbəlɛst/","extraExplanation":["“bubblest”主要出现在较早的英语或仿古/诗歌语体中，因为古英语/早期现代英语里，动词常用 -est 来配合主语 thou（你）。现代英语通常说 “you bubble” 或 “you are bubbling”。","文学中有时会用这种形式营造古典、抒情或圣经式的语感。"]}
{"word":"bubbletop","summary":{"en":"Bubbletop most commonly means a bubble-shaped aircraft canopy; it can also describe anything with a bubble-like top.","zh":"bubbletop 常指飞机上泡泡式的透明座舱盖；也可形容任何顶部呈气泡状的物体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rounded, transparent canopy (especially on an aircraft) that bulges outward like a bubble, giving the pilot a wider view","zh":"（尤指飞机上的）“泡泡式座舱盖/泡泡舱盖”：外凸、透明、像气泡一样的舱盖，可提供更广的视野"},"examples":[{"en":"The fighter’s bubbletop canopy gives the pilot excellent all‑around visibility.","zh":"这架战斗机的泡泡式座舱盖让飞行员拥有很好的全向视野。"},{"en":"Some later models replaced the framed canopy with a bubbletop design.","zh":"一些后期型号把有框座舱盖改成了泡泡式设计。"}]},{"partOfSpeech":"adj.","definition":{"en":"having a bubble-shaped top or cover","zh":"顶部呈气泡状的；带泡泡形顶盖的"},"examples":[{"en":"It’s a bubbletop helmet with a clear, domed visor.","zh":"这是一款泡泡顶头盔，带透明的拱形面罩。"}]}],"synonyms":["bubble canopy","canopy","domed canopy"],"phonetic":"/ˈbʌbəlˌtɑp/","extraExplanation":["“Bubbletop”常见于航空语境，尤其用来描述二战及其后期部分战斗机采用的“泡泡式座舱盖”（bubble canopy）。这种设计相比早期带金属框架的舱盖，遮挡更少、视野更开阔，有利于观察空战环境。","在日常英语里，这个词并不算高频；更常见、通用的说法是“bubble canopy”。“Bubbletop”有时也会出现在模型、军迷文章或特定机型的昵称中。"]}
{"word":"bubbletops","summary":{"en":"“Bubbletops” usually means bubble-shaped transparent canopies (especially aircraft cockpits), and more generally dome-like covers or tops.","zh":"“Bubbletops”通常指泡泡状的透明罩（尤指飞机座舱盖），也可泛指圆拱形的盖子或顶部。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of bubble-top) a clear, dome-shaped cover—especially the transparent canopy over a cockpit (common in fighter planes).","zh":"（bubble-top 的复数）圆拱形的透明罩；尤指飞机驾驶舱上方的透明座舱盖（战斗机上常见）。"},"examples":[{"en":"The restored fighter jet still has its original bubbletops, so the pilot’s view is wide and clear.","zh":"这架修复的战斗机仍保留原来的 bubbletops（泡泡式座舱盖），因此飞行员视野又宽又清晰。"},{"en":"From the ground, the bubbletops glinted in the sun as the planes taxied.","zh":"飞机滑行时，从地面看它们的 bubbletops 在阳光下闪闪发亮。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) rounded, dome-like tops or lids on objects (for example, protective covers or domed roofs).","zh":"（较少见）指物体上圆拱形的顶部或盖子（例如保护罩、拱形顶盖等）。"},"examples":[{"en":"The display cases have bubbletops to protect the models from dust.","zh":"这些展示柜有圆拱形盖子（bubbletops），用来防止模型落灰。"},{"en":"Some vintage signs were designed with small bubbletops that caught the light.","zh":"一些复古招牌设计了小小的圆拱顶（bubbletops），能反光吸引目光。"}]}],"synonyms":["bubble canopies","cockpit canopies","domes","covers","lids"],"phonetic":"ˈbʌbəl ˌtɑp","extraExplanation":["“Bubble-top / bubble canopy”常用于航空语境，强调座舱盖像“泡泡”一样向外鼓起，提供更好的全向视野。二战后期到冷战时期的许多战斗机都以这种座舱盖为特点。拼写上常见 bubble-top、bubble top、bubble canopy；复数可写 bubble-tops 或 bubbletops。"]}
{"word":"bubblier","summary":{"en":"Bubblier is the comparative form of bubbly: more cheerful/energetic, or having more bubbles (especially in drinks).","zh":"bubblier 是 bubbly 的比较级：更开朗更有活力，或（尤指饮料）气泡更多。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"More cheerful, lively, and full of energy (often describing someone’s personality or mood).","zh":"更开朗的；更活泼有朝气的（常形容人的性格或情绪）。"},"examples":[{"en":"She’s been bubblier since she started her new job.","zh":"自从开始新工作后，她变得更开朗了。"},{"en":"Try to sound a little bubblier when you greet the customers.","zh":"你跟顾客打招呼时尽量表现得更活泼一点。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having more bubbles or fizz (often describing drinks).","zh":"气泡更多的；更起泡的（常形容饮料）。"},"examples":[{"en":"This soda is bubblier than the one we bought last week.","zh":"这瓶汽水比我们上周买的那瓶气泡更多。"},{"en":"If you want it bubblier, add sparkling water.","zh":"如果你想要更有气泡感，就加点苏打水。"}]}],"synonyms":["more cheerful","more lively","more energetic","fizzier","more sparkling"],"phonetic":"/ˈbʌbliər/","extraExplanation":["“bubbly”的本义和“bubble（气泡）”有关，所以既能形容“有很多气泡的饮料”，也常比喻“人像气泡一样轻快、活力十足”。在口语里，“bubbly”还可以指“起泡酒/香槟（champagne）”，例如：Let’s get some bubbly.（来点香槟/起泡酒吧。）"]}
{"word":"bubblies","summary":{"en":"“Bubblies” is an informal plural word for sparkling wine (often champagne) or, more broadly, fizzy drinks.","zh":"“bubblies”是非正式复数说法，常指起泡酒（多指香槟），也可泛指含气饮料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"sparkling wine (often champagne), especially used in casual speech.","zh":"起泡酒（常指香槟），口语说法。"},"examples":[{"en":"Let’s open some bubblies to celebrate your new job.","zh":"我们开点起泡酒来庆祝你找到新工作吧。"},{"en":"They brought bubblies for the wedding toast.","zh":"他们带了起泡酒来用于婚礼祝酒。"}]},{"partOfSpeech":"n.","definition":{"en":"carbonated drinks in general; fizzy beverages.","zh":"（泛指）含气饮料、汽水等起泡饮品。"},"examples":[{"en":"We packed water and a few bubblies for the picnic.","zh":"我们为野餐带了水和几瓶汽水。"},{"en":"Too many bubblies can make you feel bloated.","zh":"喝太多含气饮料可能会让你胀气。"}]}],"synonyms":["sparkling wine","champagne","bubbly","fizzy drinks","soda"],"phonetic":"/ˈbʌbliz/","extraExplanation":["“bubblies”来自形容词/名词“bubbly”（有气泡的、起泡的）。在英语文化里，它常用来轻松、带点庆祝气氛地指代香槟或起泡酒，语气比“champagne”更随意。","日常对话中，“the bubbly / some bubbly / bubblies”都可能出现：有时特指起泡酒，有时泛指汽水等含气饮料，需结合语境判断。"]}
{"word":"bubbliest","summary":{"en":"“Bubbliest” means “the most bubbly,” either with the most bubbles (fizzy drinks) or the most cheerful, lively personality.","zh":"“bubbliest”表示“最有气泡的/最起泡的”，也可指“最开朗活泼的（性格）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative of “bubbly”: having the most bubbles; the most fizzy or sparkling (of a drink or liquid).","zh":"“bubbly”的最高级：气泡最多的；最起泡、最有汽的（指饮料或液体）。"},"examples":[{"en":"This is the bubbliest soda I’ve ever tasted.","zh":"这是我喝过气泡最多的汽水。"},{"en":"Pour it slowly if you want to keep it the bubbliest.","zh":"如果你想让它气泡最多，倒的时候要慢一点。"}]},{"partOfSpeech":"adj.","definition":{"en":"Superlative of “bubbly”: the most cheerful, lively, and friendly (of a person’s personality).","zh":"“bubbly”的最高级：最开朗活泼、最爱笑、最友善的（形容人的性格）。"},"examples":[{"en":"She’s the bubbliest person in our class—she always smiles and talks to everyone.","zh":"她是我们班最开朗的人——总是微笑，和每个人聊天。"},{"en":"At the party, his sister was the bubbliest, making everyone feel welcome.","zh":"在派对上，他妹妹最活跃热情，让大家都感到受欢迎。"}]}],"synonyms":["fizziest","sparkliest","most effervescent","cheeriest","liveliest","most outgoing"],"phonetic":"/ˈbʌbliɪst/","extraExplanation":["“bubbliest”是形容词“bubbly”的最高级，常见比较级/最高级变化：bubbly → bubblier → bubbliest。这里的 y 变成 i 再加 -er/-est。"]}
{"word":"bubblily","summary":{"en":"“Bubblily” means “in a cheerful, lively way,” and less commonly “with bubbling motion/sound.”","zh":"“bubblily”主要表示“兴高采烈地、活泼地”，较少见时也可表示“冒泡地/起泡地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a cheerful, lively way; with an energetic, friendly mood (as if “bubbling” with happiness).","zh":"兴高采烈地；活泼地；带着充满活力、友好的情绪（像快乐在“冒泡”一样）。"},"examples":[{"en":"She laughed bubblily and waved at everyone.","zh":"她活泼地笑着，向大家挥手。"},{"en":"He greeted the guests bubblily, making the room feel warm.","zh":"他热情活泼地招呼客人，让房间里感觉很温暖。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that produces bubbles; with bubbling motion or sound (less common).","zh":"起泡地；冒泡地；以冒泡的动作或声音（较少见）。"},"examples":[{"en":"The soup simmered bubblily on the stove.","zh":"汤在炉子上咕嘟咕嘟地煮着。"}]}],"synonyms":["cheerfully","brightly","gaily","vivaciously","effusively"],"phonetic":"/ˈbʌbəli/","extraExplanation":["“bubblily”来自形容词“bubbly”（活泼的／起泡的）+ 副词后缀“-ly”。日常更常用的是“bubbly”（形容人）或“bubbling”（形容液体/气泡的状态）。描述人时，“bubblily”常带有可爱、开朗的语感。"]}
{"word":"bubbliness","summary":{"en":"Bubbliness means a lively, cheerful personality or the fizzy, bubbly quality of a drink.","zh":"bubbliness 指“活泼开朗的特质”，也可指饮料“有气泡、很有汽”的特性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being cheerful, lively, and full of energy; a bright, friendly personality.","zh":"活泼开朗、充满朝气的特质；热情友好的性格。"},"examples":[{"en":"Her bubbliness made everyone feel welcome at the party.","zh":"她的活泼开朗让派对上的每个人都感到被欢迎。"},{"en":"The interview went well because her bubbliness felt natural, not forced.","zh":"面试很顺利，因为她的开朗表现很自然，不是刻意装出来的。"}]},{"partOfSpeech":"n.","definition":{"en":"The quality of having bubbles, especially the fizzy character of a drink.","zh":"起泡的特性；（尤指饮料的）气泡感、汽感。"},"examples":[{"en":"People like the bubbliness of sparkling water.","zh":"很多人喜欢气泡水的汽感。"},{"en":"The soda lost its bubbliness after sitting open for an hour.","zh":"汽水开着放了一小时后就没气了。"}]}],"synonyms":["cheerfulness","liveliness","brightness","effervescence","fizz"],"phonetic":"/ˈbʌb.linəs/","extraExplanation":["“bubbliness”来自形容词“bubbly”（既可指“有气泡的”，也常指“性格活泼的”）加名词后缀“-ness”。在描述人的性格时语气偏口语、偏正面。","在职场语境中，形容一个人“bubbly / full of bubbliness”通常表示亲和、外向；但在某些正式或严肃场合，也可能被理解为“不够沉稳”，需看语境。"]}
{"word":"bubbling","summary":{"en":"Bubbling describes liquid making bubbles, a gentle burbling sound, or (figuratively) lively, excited energy; it’s also the -ing form of “bubble.”","zh":"bubbling 可指液体冒泡/沸腾、汩汩作响的声音，也可比喻人充满活力或兴奋；同时它也是 bubble 的 -ing 形式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"producing bubbles; boiling or making a liquid move with many small bubbles","zh":"冒泡的；起泡的；（液体）沸腾的、咕嘟作响的"},"examples":[{"en":"The soup is bubbling on the stove.","zh":"汤正在炉子上咕嘟咕嘟地冒泡。"},{"en":"Add the pasta when the water is bubbling strongly.","zh":"水猛烈冒泡时再下意大利面。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of a sound) making a light, continuous, water-like “burbling” noise","zh":"（声音）汩汩作响的；像水流一样咕噜咕噜的"},"examples":[{"en":"We heard a bubbling sound from the stream.","zh":"我们听到小溪传来汩汩的水声。"},{"en":"The fountain makes a gentle bubbling noise.","zh":"喷泉发出轻柔的咕噜声。"}]},{"partOfSpeech":"adj.","definition":{"en":"(figurative) full of lively, cheerful energy; excited and talkative","zh":"（比喻）充满活力的、欢快的；兴奋得停不下来的"},"examples":[{"en":"She was bubbling with excitement before the trip.","zh":"出发前她兴奋得停不下来。"},{"en":"His bubbling personality makes people feel welcome.","zh":"他活泼开朗的性格让人感到受欢迎。"}]},{"partOfSpeech":"v.","definition":{"en":"the -ing form of “bubble”: to form or rise in bubbles","zh":"“bubble”的现在分词/动名词：冒泡；起泡；（液体）翻腾"},"examples":[{"en":"Gas is bubbling up through the mud.","zh":"气体正从泥里冒泡往上升。"},{"en":"The pot kept bubbling over.","zh":"锅一直沸得溢出来。"}]}],"synonyms":["foaming","boiling","gurgling","burbling","effervescent","lively"],"phonetic":"/ˈbʌbəlɪŋ/","extraExplanation":["“bubbling”既可描写真实的液体（冒泡、沸腾），也常用于情绪与性格的比喻（bubbling with excitement 表示兴奋得快要“溢出来”）。","常见搭配：bubbling water（沸水/冒泡的水）、bubbling sound（汩汩声）、bubbling with + 情绪名词（充满……的兴奋/喜悦）。"]}
{"word":"bubblingly","summary":{"en":"“Bubblingly” means “in a cheerful, lively way,” and less commonly “with bubbles (in liquid).”","zh":"“bubblingly”多指“活泼愉快地、热情洋溢地”，较少指“冒泡地（液体）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a lively, cheerful, and energetic way; with an upbeat, friendly spirit (often describing how someone speaks or behaves).","zh":"活泼愉快地；热情洋溢地（常形容说话或举止）。"},"examples":[{"en":"She greeted everyone bubblingly, as if the whole day were a celebration.","zh":"她热情洋溢地跟大家打招呼，仿佛整天都在庆祝。"},{"en":"He spoke bubblingly about his new job, barely pausing for breath.","zh":"他兴高采烈地谈起新工作，几乎不喘口气。"}]},{"partOfSpeech":"adv.","definition":{"en":"With bubbling sounds or motion, as liquid bubbles up; effervescently (less common in everyday writing).","zh":"冒泡地；起泡地（指液体咕嘟咕嘟或气泡上涌；日常写作中较少见）。"},"examples":[{"en":"The soup simmered bubblingly on the stove.","zh":"汤在炉子上咕嘟咕嘟地煮着。"},{"en":"Mineral water rose bubblingly in the glass.","zh":"矿泉水在杯中咕噜咕噜地冒着气泡。"}]}],"synonyms":["cheerfully","brightly","enthusiastically","vivaciously","effusively","effervescently"],"phonetic":"/ˈbʌb(ə)lɪŋli/","extraExplanation":["“bubblingly”来自形容词“bubbly”（活泼的/起泡的）+ 副词后缀“-ly”。常用于描写人的性格与语气：bubbly personality（开朗的性格）、bubbly voice（轻快的声音）。","语体上偏描写性（narrative/creative writing）而不太正式；正式场合更常用“cheerfully / enthusiastically”。"]}
{"word":"bubblish","summary":{"en":"Bubblish means “somewhat bubbly,” used for slightly fizzy drinks or a slightly bubbly personality.","zh":"bubblish 指“有点起泡/有点活泼”，可形容微起泡的饮料或略带开朗外向的性格。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Somewhat bubbly or full of small bubbles; slightly fizzy or effervescent.","zh":"有点起泡的；带些小气泡的；微微起泡（微带汽）。"},"examples":[{"en":"The drink tasted bubblish, like soda that has been left open for a while.","zh":"这饮料喝起来有点起泡，像开封放久了的汽水。"},{"en":"I prefer a bubblish wine rather than a fully sparkling one.","zh":"我更喜欢微起泡的葡萄酒，而不是那种气泡很足的起泡酒。"}]},{"partOfSpeech":"adj.","definition":{"en":"Lively, cheerful, and talkative in a way that feels a little “bubbly.”","zh":"有点“活泼外向”的；带点开朗健谈的（略带 bubbly 的感觉）。"},"examples":[{"en":"She’s usually calm, but she was bubblish at the party.","zh":"她平时很冷静，但在聚会上显得有点活泼。"},{"en":"His bubblish energy made the meeting feel less tense.","zh":"他那种略带活力的劲儿让会议没那么紧张了。"}]}],"synonyms":["bubbly","fizzy","effervescent","lively"],"phonetic":"/ˈbʌbəlɪʃ/","extraExplanation":["“bubblish”不是非常常见的标准用词，更常见的是“bubbly”（形容饮料有气泡，或形容人开朗外向）。加上后缀“-ish”通常表示“有点……、带点……、不完全是……”，所以“bubblish”=“有点起泡/有点活泼”。","在描述饮料时，“bubblish”常带有“气泡不够足、轻微起泡”的暗示；而“sparkling”更像“气泡很足、正式的起泡（酒/水）”。"]}
{"word":"bubbly","summary":{"en":"“Bubbly” most commonly means fizzy with bubbles, or cheerful and lively; informally it can also mean champagne or sparkling wine.","zh":"“bubbly”常指“有气泡的（起泡的）”，也可形容人“开朗活泼”；口语中还可指“香槟/起泡酒”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Full of bubbles; fizzy (especially of drinks).","zh":"充满气泡的；起泡的；（尤指饮料）有汽的。"},"examples":[{"en":"I’d like a glass of bubbly water, please.","zh":"我想要一杯有气的水。"},{"en":"Champagne is a popular bubbly drink for celebrations.","zh":"香槟是一种常用于庆祝场合的起泡酒。"}]},{"partOfSpeech":"adj.","definition":{"en":"Cheerful, lively, and talkative; having a bright, energetic personality.","zh":"开朗的；活泼健谈的；充满活力的（性格）。"},"examples":[{"en":"She has a bubbly personality and makes everyone feel welcome.","zh":"她性格开朗，让每个人都觉得很受欢迎。"},{"en":"His bubbly mood lifted the whole team.","zh":"他活泼的情绪让整个团队都振作起来。"}]},{"partOfSpeech":"n.","definition":{"en":"A sparkling wine, especially champagne (informal).","zh":"起泡酒；（尤指）香槟（非正式）。"},"examples":[{"en":"They brought some bubbly to toast the new job.","zh":"他们带了些香槟来庆祝新工作。"},{"en":"Let’s open the bubbly after dinner.","zh":"晚饭后我们把香槟打开吧。"}]}],"synonyms":["fizzy","sparkling","effervescent","cheerful","lively"],"phonetic":"/ˈbʌbli/","extraExplanation":["“bubbly”作名词时常见于轻松口语场合，带有“庆祝、举杯”的氛围。","形容人“bubbly”通常是褒义，但在少数语境里也可能暗示“过于热情/话太多”，是否合适取决于语气和关系。","相关表达：sparkling water（气泡水）、sparkling wine（起泡酒）、fizzy（有气的；起泡的，口语更常用）、effervescent（更书面：起泡的；生机勃勃的）。"]}
{"word":"bubbly water","summary":{"en":"carbonated water with bubbles","zh":"带气泡的碳酸水"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Carbonated water with bubbles (often sold in cans or bottles); it may be plain or lightly flavored.","zh":"起泡水；含二氧化碳的水（常见于罐装/瓶装，可无味或带淡淡风味）。"},"examples":[{"en":"I drink bubbly water instead of soda.","zh":"我用起泡水代替汽水喝。"},{"en":"Do you want still water or bubbly water?","zh":"你想要矿泉水（不含气）还是起泡水？"},{"en":"She ordered bubbly water with lemon.","zh":"她点了柠檬味的起泡水。"}]}],"synonyms":["sparkling water","carbonated water","seltzer","fizzy water"],"phonetic":"/ˈbʌb.li ˈwɔt̬ɚ/","extraExplanation":["常见近义说法：sparkling water（更常见于包装/菜单）、carbonated water（更偏技术/成分说法）、seltzer（美式常用，多指无糖无味）、club soda（通常含矿物盐）、tonic water（含奎宁，味偏苦，常用于调酒）。","注意区分：bubbly water ≠ soda。soda/soft drink通常含糖或甜味剂与香精；bubbly water通常不甜。","在美式英语里，点餐时说“sparkling”更普遍；“bubbly”更口语、更轻松。"],"etymology":"“bubbly”本意是“起泡的、冒泡的”，来自“bubble（泡泡）”。“bubbly water”字面就是“有泡泡的水”，在英语口语和商品描述里很常见。","mnemonic":["把“bubbly”联想成中文“啵啵/泡泡”，一想到水里冒“泡泡”就是起泡水。","记忆搭配：bubbly + water = 有气的水；still + water = 没气的水（still=静止、不冒泡）。"]}
{"word":"bubby","summary":{"en":"“Bubby” most commonly means “grandmother” (from Yiddish), used affectionately; it can also be slang for “breast,” which may sound crude.","zh":"“bubby”最常见的意思是（源自意第绪语的）“奶奶/外婆”的亲昵称呼；也可作俚语指“乳房”，且可能显得粗俗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in Jewish families, from Yiddish) grandmother; a warm, familiar way to say “grandma.”","zh":"（尤指犹太家庭用语，源自意第绪语）外婆/奶奶；对“祖母/奶奶”的亲昵称呼。"},"examples":[{"en":"My bubby makes chicken soup whenever someone is sick.","zh":"每当有人生病，我的奶奶就会煮鸡汤。"},{"en":"We went to visit my bubby for Passover.","zh":"逾越节我们去看望了奶奶。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, slang; often considered crude) a breast.","zh":"（非正式俚语；常被认为粗俗）乳房。"},"examples":[{"en":"That word can sound rude, so it’s better to avoid it in polite conversation.","zh":"这个词听起来可能很粗俗，所以在正式场合最好避免使用。"}]}],"synonyms":["grandma","grandmother","granny","nana","bubbe"],"phonetic":"/ˈbʌbi/","extraExplanation":["“bubby”也常拼作“bubbe”。它来自意第绪语（Yiddish），在美国英语语境里经常出现在犹太家庭或描写犹太社区生活的影视/文学作品中，用来表达亲昵与家庭温度。","如果你是在对话或社交媒体里看到“bubby”，多数情况下指“奶奶/外婆”；但在少数语境里可能是粗俗俚语（指乳房），需要结合上下文判断。"]}
{"word":"bubbybush","summary":{"en":"“bubbybush” isn’t a standard English word; it’s likely a misspelling, a name, or niche slang.","zh":"“bubbybush”不是标准英语词；更可能是拼写错误、人名/网名，或小众俚语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A very rare or nonstandard term; not found in major English dictionaries. It may be a misspelling or a made-up word (nonce word).","zh":"非常罕见或非标准用语；在主要英文词典中查不到。可能是拼写错误或临时造出来的词（临造词）。"},"examples":[{"en":"I couldn’t find “bubbybush” in a dictionary—could it be spelled differently?","zh":"我在词典里找不到“bubbybush”——会不会是拼写不一样？"},{"en":"If you saw it in a book or online, sharing the sentence can help identify what it means.","zh":"如果你是在书里或网上看到的，把原句发出来会更容易判断它的意思。"}]}],"synonyms":["(no direct standard synonym)"],"phonetic":"ˈbʌbiˌbʊʃ","extraExplanation":["“bubbybush”看起来像两个词拼在一起（bubby + bush），但作为固定词在常见英语里并不成立。可能的情况：1）人名/网名/地名；2）某个方言或小众圈子用语；3）把别的词打错了。","你可以提供你看到它的原句/上下文（前后各一两句），我就能更准确判断它到底是哪个词或应该怎么解释。也可以确认是否想查：bubby（口语：兄弟/小孩昵称；在意第绪语语境中也可指“奶奶”）或 bush（灌木/草丛/丛林；也可指“灌木状的东西”）。"]}
{"word":"Bube","summary":{"en":"Bube is a German word sometimes used in English to mean the playing-card “jack,” and less commonly “boy,” or it can be a surname.","zh":"Bube 是一个德语词，英语中偶尔借用来指纸牌的“J（杰克/侍从）”，较少也可指“男孩”，也可能作为姓氏出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from German) a “jack” (the playing card) in some card games or German-speaking contexts.","zh":"（源自德语）在某些纸牌游戏或德语语境中指“J”（杰克/侍从）这张牌。"},"examples":[{"en":"In some German decks, the Bube ranks above the 10.","zh":"在一些德式牌组里，Bube 的牌位在 10 之上。"},{"en":"He drew the Bube and smiled—it completed his set.","zh":"他抽到了一张 Bube，笑了——这让他凑齐了一套。"}]},{"partOfSpeech":"n.","definition":{"en":"(from German, less common in English) a boy; a lad.","zh":"（源自德语，在英语中较少见）男孩；小伙子。"},"examples":[{"en":"In the story, the old man speaks fondly of the village Bube.","zh":"在故事里，老人亲切地提到村里的那个小男孩（Bube）。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname) in some cultures.","zh":"（某些文化中的）姓氏。"},"examples":[{"en":"Dr. Bube will present the research findings today.","zh":"Bube 博士今天将展示研究结果。"}]}],"synonyms":["jack (card)","lad","boy"],"phonetic":"/ˈbuːbə/","extraExplanation":["“Bube”是德语词，在现代德语里最常见的意思是纸牌里的“J”（英语Jack）。在很多英文学术或卡牌爱好者的讨论中，可能会直接借用Bube来指代该牌位。","如果你是在英文聊天里看到“Bube”，也有可能是拼写错误（比如把“boob/boobie”等词打错），需要结合上下文判断。"]}
{"word":"bube","summary":{"en":"Bube is a rare/old word meaning a fool (sometimes a knave). In German, Bube can mean a jack (playing card) or a boy.","zh":"bube 是较少见/偏古语的词，主要指傻瓜（有时也指无赖）。在德语中，Bube 可指纸牌的 J（Jack）或男孩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(archaic) A foolish or stupid person; sometimes also a dishonest person (a knave).","zh":"（古语）傻瓜；也可指不诚实的人（无赖、骗子）。"},"examples":[{"en":"Don’t be a bube—read the instructions first.","zh":"别当傻瓜——先把说明读清楚。"},{"en":"In old stories, the bube is often the one who gets tricked easily.","zh":"在一些老故事里，“bube”常常是那个很容易被骗的人。"}]},{"partOfSpeech":"n.","definition":{"en":"(in German contexts) A ‘jack’ (playing card), or a young man/boy (depending on context).","zh":"（德语语境）纸牌里的“J”（Jack）；也可指男孩/年轻男子（视语境而定）。"},"examples":[{"en":"In German, Bube can mean the jack in a deck of cards.","zh":"在德语里，Bube 可以指一副牌中的 J（Jack）。"},{"en":"The word appears in older German texts meaning “boy.”","zh":"这个词在较老的德语文本中可表示“男孩”。"}]}],"synonyms":["fool","simpleton","knave","dupe"],"phonetic":"/ˈbuːbə/","extraExplanation":["“bube”在现代英语里非常少见，多出现在旧文学/历史文本中。日常英语更常用 fool、idiot、jerk（语气更口语）等。","注意拼写：很多人想找的是意第绪语/犹太英语里的“bubbe”（常指“外婆/奶奶”，一种亲昵称呼）。bube ≠ bubbe。","如果你是在德语里看到“Bube”，它在纸牌语境常对应英语 jack。"]}
{"word":"Buber","summary":{"en":"Buber usually refers to the philosopher Martin Buber, known for the “I–Thou” idea about genuine human relationships.","zh":"Buber 通常指哲学家马丁·布伯，以“我—你”理念（强调真实的人际相遇）而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) Martin Buber (1878–1965), an Austrian-Israeli Jewish philosopher best known for the idea of “I–Thou” relationships in which people meet each other as whole persons, not as objects.","zh":"（专有名词）马丁·布伯（1878–1965），奥地利裔以色列犹太哲学家，以“I–Thou（我—你）”关系著称，强调人与人应以完整的人格相遇，而非把对方当作对象。"},"examples":[{"en":"In class we read Buber’s book I and Thou.","zh":"课堂上我们读了布伯的《我与你》。"},{"en":"Buber argues that real dialogue requires seeing the other person as a “Thou,” not an “It.”","zh":"布伯认为真正的对话需要把对方视为“你”，而不是“它”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A German/Jewish surname; someone with the family name Buber.","zh":"（专有名词）德语/犹太姓氏；姓“布伯”的人。"},"examples":[{"en":"Dr. Buber will speak at the conference tomorrow.","zh":"布伯博士将于明天在会议上发言。"}]}],"synonyms":["Martin Buber"],"phonetic":"/ˈbuːbər/","extraExplanation":["“我—你（I–Thou）”与“我—它（I–It）”是布伯思想的核心：前者指平等、尊重、真实的相遇；后者指把人或事物当成可利用、可分析的对象。这个概念常被用来讨论亲密关系、教育、心理咨询与宗教体验中的“真实对话”。","布伯也与犹太神秘传统（哈西德派故事与灵修传统）研究有关；在英语学术写作里，常直接写作 Buber，并用斜体标出书名 I and Thou。"]}
{"word":"bubinga","summary":{"en":"Bubinga is a heavy, attractive African hardwood used in high-quality woodworking and sometimes instruments.","zh":"Bubinga（布宾加木）是一种沉重而美观的非洲硬木，常用于高档木作，有时也用于乐器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hard, decorative hardwood from several West and Central African trees (genus Guibourtia), used for fine furniture, flooring, veneers, and sometimes musical instruments","zh":"（布宾加木）一种来自西非和中非多种树（Guibourtia 属）的坚硬装饰性硬木，常用于高档家具、地板、木皮贴面，有时也用于乐器制作"},"examples":[{"en":"The table is made of bubinga, so it’s heavy and very durable.","zh":"这张桌子是用布宾加木做的，所以很重也很耐用。"},{"en":"He chose a bubinga veneer for the cabinet because of its rich reddish color.","zh":"他给橱柜选了布宾加木贴面，因为它带有浓郁的红褐色。"},{"en":"Some bass guitars use bubinga for the body to add a warm, strong tone.","zh":"有些贝斯会用布宾加木做琴身，让音色更温暖、更有力量。"}]}],"synonyms":["African hardwood","(trade name) African rosewood"],"phonetic":"/buˈbɪŋɡə/","extraExplanation":["“bubinga”常被当作材料名使用，讨论重点通常在它的纹理（常见为红褐色、带条纹或“水波纹”）、硬度与稳定性。","在木材贸易中它有时会被称为“African rosewood（非洲玫瑰木）”，但这个称呼并不严格，可能指向不同木种；更准确的说法是“bubinga（Guibourtia 属）”。","由于部分相关树种在某些地区面临过度采伐，购买时可留意来源与可持续认证信息。"]}
{"word":"bubingas","summary":{"en":"Bubinga is a valuable African hardwood used for high-end wood products; “bubingas” is the plural form.","zh":"Bubinga 是一种常用于高档木制品的非洲硬木；“bubingas” 是其复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a reddish-brown tropical hardwood (from African trees of the genus *Guibourtia*), valued for fine furniture, flooring, and musical instruments","zh":"一种红褐色的非洲热带硬木（多来自古夷苏木属 *Guibourtia* 的树种），常用于高档家具、地板和乐器制作"},"examples":[{"en":"The guitar has a bubinga top, which gives it a warm, rich look.","zh":"这把吉他的面板用了巴宾加木（bubinga），看起来温暖而有质感。"},{"en":"Bubinga is dense and strong, so it’s often used for durable flooring.","zh":"巴宾加木密度高、很结实，所以常被用来做耐用的地板。"},{"en":"Because bubinga can be expensive, many buyers ask for proof of legal sourcing.","zh":"由于巴宾加木可能价格较高，很多买家会要求提供合法来源的证明。"}]}],"synonyms":["African rosewood","Guibourtia wood"],"phonetic":"/buˈbɪŋɡə/","extraExplanation":["你输入的 “bubingas” 通常是复数形式；单数是 “bubinga”。在木材贸易语境里，人们也常把它当作不可数名词使用（例如：Some bubinga was used）。","“Bubinga” 常被称为 African rosewood（非洲玫瑰木），但它不一定属于真正的玫瑰木（Dalbergia 属）。购买或进出口相关木制品时，可能会涉及 CITES（濒危野生动植物种国际贸易公约）等合规与可持续来源问题。"]}
{"word":"Bubo","summary":{"en":"A medical term for a swollen, inflamed lymph node, historically linked to bubonic plague.","zh":"医学名词：肿大、发炎的淋巴结；历史上常与腺鼠疫（黑死病）相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a swollen and inflamed lymph node, especially in the groin or armpit, often associated with infections such as bubonic plague (historically).","zh":"（医学）腹股沟或腋下等处肿大、发炎的淋巴结；尤指（历史上）与黑死病/腺鼠疫相关的“腺肿”。"},"examples":[{"en":"The doctor examined the painful swelling and noted it was a bubo in the patient’s groin.","zh":"医生检查了疼痛的肿块，指出那是患者腹股沟处的腺肿（bubo）。"},{"en":"In accounts of the Black Death, people often described fever followed by buboes.","zh":"在关于黑死病的记载中，人们常描述先发烧，随后出现腺肿（buboes）。"}]}],"synonyms":["swollen lymph node","lymph node swelling","gland swelling"],"phonetic":"/ˈbjuːboʊ/","extraExplanation":["词源来自希腊语 boubon，原意与“腹股沟”有关，因此 bubo 常指腹股沟处肿大的淋巴结。","在历史与文学语境中，bubo 常与“腺鼠疫（bubonic plague）/黑死病”并列出现，用来强调当时典型且令人恐惧的外在症状。现代医学描述中也会用，但更常见的说法是“swollen lymph node（肿大的淋巴结）”。"]}
{"word":"bubo","summary":{"en":"A bubo is a painful, swollen lymph node, often linked to infection (especially bubonic plague).","zh":"bubo指疼痛性淋巴结肿大，常由感染引起（尤与腺鼠疫相关）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a painful swelling of a lymph node, especially in the groin or armpit, usually caused by infection (classically associated with bubonic plague).","zh":"（医学）腹股沟或腋下等处淋巴结的疼痛性肿大，通常由感染引起（典型与腺鼠疫相关）。"},"examples":[{"en":"During the outbreak, doctors looked for fever and a bubo in the groin.","zh":"在疫情暴发期间，医生会查看是否有发烧以及腹股沟处的淋巴结肿大（bubo）。"},{"en":"The patient had a tender bubo under the arm, suggesting a serious infection.","zh":"病人腋下有触痛性的淋巴结肿大（bubo），提示可能存在严重感染。"}]}],"synonyms":["swollen lymph node","lymph node swelling"],"phonetic":"/ˈbjuːboʊ/","extraExplanation":["“bubo”常见于医学语境，指特定部位的淋巴结明显肿胀并伴疼痛；日常英语里更常说“swollen lymph node（肿大的淋巴结）”。","词源来自希腊语，意为“腹股沟”。复数形式常写作“buboes”。","与“bubonic plague（腺鼠疫）”关系密切：历史记载中，腹股沟或腋下出现bubo是其典型体征之一。"]}
{"word":"buboed","summary":{"en":"“Buboed” means having buboes (swollen lymph nodes), often linked to bubonic plague; it is rare and mostly seen in historical or older medical writing.","zh":"“buboed”指“长有腺肿/淋巴结肿大”，常与腺鼠疫相关；用法较少，多见于历史叙述或较旧的医学文本。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical, rare) Having a bubo (a swollen lymph node), especially as a symptom of bubonic plague.","zh":"（医学/较少用）长有“腹股沟腺肿/淋巴结肿大”（bubo），尤指腺鼠疫（bubonic plague）的症状之一。"},"examples":[{"en":"Historical accounts describe plague victims as feverish and buboed.","zh":"历史记载常把鼠疫患者描述为发烧并且“长有腺肿”。"},{"en":"The doctor isolated anyone who appeared buboed or seriously ill.","zh":"医生把任何看起来长有腺肿或病情严重的人隔离起来。"}]},{"partOfSpeech":"v.","definition":{"en":"(Past form, rare) Past tense/past participle of “bubo” (to develop buboes).","zh":"（过去式/过去分词，较少用）“bubo”的过去式/过去分词：长出腺肿。"},"examples":[{"en":"In older medical writing, a patient might be described as having “buboed” overnight.","zh":"在较旧的医学写作中，可能会写“病人一夜之间长出了腺肿”。"}]}],"synonyms":["swollen-glanded","having swollen lymph nodes","plague-stricken"],"phonetic":"/ˈbjuːboʊd/","extraExplanation":["“bubo”来自希腊语 *boubon*（腹股沟）。在中世纪欧洲关于黑死病（Black Death）的描述中常见这个词，因此带有明显的历史/文学色彩。","现代英语里更常用的表达是：*swollen lymph nodes*（淋巴结肿大）或 *a bubo*；“buboed”本身非常少见，多见于历史叙述或仿古写作。"]}
{"word":"buboes","summary":{"en":"Buboes are swollen, painful lymph-node lumps, often linked with severe infections like bubonic plague.","zh":"Buboes 指淋巴结肿大疼痛的肿块，常与腺鼠疫等严重感染相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a swollen, painful lump in a lymph node (especially in the groin or armpit), often caused by an infection such as bubonic plague","zh":"（尤指腹股沟或腋下的）淋巴结肿大、疼痛的肿块，常由感染引起，如腺鼠疫"},"examples":[{"en":"Doctors noticed buboes in the patient’s groin and suspected a serious infection.","zh":"医生发现病人腹股沟有鼠蹊腺肿（buboes），怀疑是严重感染。"},{"en":"In history books, buboes are often mentioned as a key sign of the Black Death.","zh":"在历史书中，鼠蹊腺肿常被提到是“黑死病”的重要症状之一。"}]}],"synonyms":["swollen lymph nodes","lymph-node swelling"],"phonetic":"/ˈbjuːboʊz/","extraExplanation":["“buboes”是“bubo”的复数形式。这个词常见于医学或历史语境，尤其与“bubonic plague（腺鼠疫）/ the Black Death（黑死病）”相关。日常英语中不常用，多用于描述特定疾病体征。","发音与拼写提示：重音在第一个音节（BU-），复数 -es 读作 /z/。"]}
{"word":"Bubona","summary":{"en":"“Bubona” is usually a proper name, not a common English word; its meaning depends on context.","zh":"“Bubona”通常是专有名词，并非常见英语词；含义取决于具体语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English vocabulary word. Most often, “Bubona” appears as a proper name (e.g., a person’s name, surname, place name, or brand name), so its meaning depends on the specific context.","zh":"不是标准英语词汇。“Bubona”更常见为专有名词（如人名、姓氏、地名或品牌名），具体含义取决于出现的语境。"},"examples":[{"en":"I saw the name Bubona on a shop sign, but it didn’t explain what it meant.","zh":"我在店招上看到“Bubona”这个名字，但招牌并没有说明它的含义。"},{"en":"Bubona is listed as the author’s surname on the article.","zh":"“Bubona”在文章里被列为作者的姓。"}]}],"phonetic":"/buːˈboʊnə/","extraExplanation":["“Bubona”可能是拼写或听写误差。常见相近词包括：\n- bubo /ˈbjuːboʊ/：医学名词，指腺体（尤其腹股沟）肿大。\n- bubonic /bjuːˈbɑːnɪk/：形容词，常见于“bubonic plague（腺鼠疫/黑死病）”。\n如果你能提供它出现的句子、语言环境（书名/游戏/品牌/人名等）或截图，我可以更准确地判断。"]}
{"word":"bubonalgia","summary":{"en":"Bubonalgia means pain in a swollen lymph node (a bubo), usually in the groin or armpit.","zh":"Bubonalgia 指腺肿（肿大的淋巴结，常在腹股沟或腋下）引起的疼痛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Pain in a bubo (a swollen, inflamed lymph node, often in the groin or armpit).","zh":"腹股沟/腋下等处“腺肿”（肿大、发炎的淋巴结）所引起的疼痛。"},"examples":[{"en":"The patient reported bubonalgia along with a tender swelling in the groin.","zh":"病人除了腹股沟有压痛性肿块外，还主诉有腺肿痛（bubonalgia）。"},{"en":"Doctors assessed the fever and bubonalgia to rule out a serious infection.","zh":"医生评估发烧与腺肿痛，以排除严重感染。"}]}],"synonyms":["bubo pain","lymph node pain","inguinal pain (when in the groin)"],"phonetic":"ˌbjuːbənˈældʒə","extraExplanation":["“bubonalgia”属于医学术语，词根来自希腊语：boubōn（腹股沟、腺肿）+ algia（疼痛）。在英语医学语境中，bubo 常指因感染导致的淋巴结肿大，典型部位是腹股沟或腋下。","历史上“bubo”常与黑死病（腺鼠疫，bubonic plague）相关，因为该病经典体征之一就是出现疼痛性腺肿；不过在现代临床里，bubo 也可见于其他细菌感染或性传播相关感染等情境。"]}
{"word":"bubonic","summary":{"en":"Bubonic means related to buboes (swollen lymph nodes), especially in bubonic plague.","zh":"bubonic 指与“淋巴结肿块（buboes）”有关，尤常指“腺鼠疫（bubonic plague）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to swollen lymph nodes (“buboes”), especially in the disease called bubonic plague.","zh":"与“腹股沟/腋下等处肿大的淋巴结肿块（buboes）”有关的；尤指“腺鼠疫（bubonic plague）”这种疾病。"},"examples":[{"en":"The museum had a section on the bubonic plague in medieval Europe.","zh":"博物馆有一个展区讲中世纪欧洲的腺鼠疫。"},{"en":"Doctors recognized bubonic symptoms like painful swelling in the groin or armpit.","zh":"医生识别出腺鼠疫的症状，例如腹股沟或腋下出现疼痛性肿胀。"}]}],"synonyms":["plague-related","glandular (in context)"],"phonetic":"/bjuːˈbɑːnɪk/","extraExplanation":["“bubonic”来自希腊语 *boubon*（腹股沟肿块），英语里常与“plague（鼠疫）”搭配成固定说法 *bubonic plague*。","日常英语中单独用“bubonic”不多见，多出现在历史、医学或科普语境。","常见相关词：*bubo*（n. 肿大的淋巴结/腺肿块）、*plague*（n. 瘟疫）、*Black Death*（黑死病，历史上与鼠疫相关的疫情称呼）。"]}
{"word":"Bubonidae","summary":{"en":"Bubonidae is an older/alternative taxonomic family name for some large owls (especially *Bubo*), often treated today as part of Strigidae.","zh":"Bubonidae 是一个较旧/替代的分类科名，指某些大型猫头鹰（尤指雕鸮属 *Bubo*），现代多并入鸱鸮科 Strigidae。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology, taxonomy) A former or alternative family name used for some large owls (especially the eagle-owls in the genus *Bubo*); in many modern classifications these birds are included in the family *Strigidae* (true owls).","zh":"（动物学/分类学）一个较旧或替代性的科名，用来指一些大型猫头鹰（尤指雕鸮属 *Bubo* 的“雕鸮/大角鸮”等）；在许多现代分类中通常并入鸱鸮科 *Strigidae*（“真猫头鹰”）。"},"examples":[{"en":"In older books, the eagle-owls were sometimes placed in the family Bubonidae.","zh":"在一些较旧的书里，雕鸮类有时被归入“雕鸮科（Bubonidae）”。"},{"en":"Today, many scientists classify *Bubo* species under Strigidae rather than using Bubonidae.","zh":"如今，许多科学家把雕鸮属（*Bubo*）的物种归在鸱鸮科（Strigidae）里，而不再使用 Bubonidae。"}]}],"synonyms":["eagle-owl family","(often now) Strigidae"],"phonetic":"/ˌbjuːbɑˈnaɪdiː/","extraExplanation":["“Bubonidae”来自拉丁化的属名 *Bubo*（常译作“雕鸮属”）+ 科名后缀 -idae（表示“……科”）。\n由于不同年代的分类标准会变化，你在论文或资料中看到这个词时，最好查看该来源使用的是哪一种分类体系。"]}
{"word":"bubonidae","summary":{"en":"Bubonidae is a rare/older taxonomic family name for some owls (genus *Bubo*), now usually treated under *Strigidae*.","zh":"Bubonidae 是一个较旧/少见的分类学科名，指部分猫头鹰（角鸮属 *Bubo*），现代多并入鸱鸮科 *Strigidae*。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology, taxonomy) An old/rare scientific family name used for certain owls, especially the eagle-owls in the genus *Bubo* (now generally classified within the family *Strigidae*).","zh":"（动物学·分类学）一个较旧/少见的科学科名，用来指某些猫头鹰，尤其是角鸮属（*Bubo*）的“雕鸮/角鸮类”；现代多不再单独用此科名，通常归入鸱鸮科（*Strigidae*）。"},"examples":[{"en":"In older zoological texts, *Bubonidae* may appear as a separate family of owls.","zh":"在较早的动物学文献中，*Bubonidae* 可能会被写成猫头鹰的一个独立科。"},{"en":"Many modern sources place *Bubo* species within *Strigidae* rather than using *Bubonidae*.","zh":"许多现代资料将角鸮属（*Bubo*）的物种归入鸱鸮科（*Strigidae*），而不使用 *Bubonidae* 这个科名。"}]}],"synonyms":["Strigidae (modern broader family)","Bubo (genus name)"],"phonetic":"/ˌbjuːbəˈnaɪdiː/","extraExplanation":["这是一个比较“文献型”的词：通常只在旧的分类系统、历史性论文或特定数据库里出现。日常英语几乎不用。","作为科名常首字母大写（*Bubonidae*），并且通常用斜体表示拉丁学名；在写作中最好同时给出当前更通行的分类（如 *Strigidae*）以避免歧义。"]}
{"word":"bubonocele","summary":{"en":"Bubonocele is a medical term for an inguinal (groin) hernia.","zh":"bubonocele 是“腹股沟疝”的医学术语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hernia (a swelling caused by an organ or tissue pushing out) that occurs in the groin area; an inguinal hernia.","zh":"腹股沟疝；发生在腹股沟部位的疝（组织或器官从正常位置突出造成的肿胀）。"},"examples":[{"en":"The doctor diagnosed him with a bubonocele after examining the lump in his groin.","zh":"医生检查他腹股沟的肿块后，诊断为腹股沟疝（bubonocele）。"},{"en":"Heavy lifting can worsen a bubonocele and increase discomfort.","zh":"搬重物可能会加重腹股沟疝，并增加不适。"}]}],"synonyms":["inguinal hernia","groin hernia"],"phonetic":"/ˌbjuːbəˈnoʊsiːl/","extraExplanation":["这个词比较少见，常见的现代医学用语更常说 inguinal hernia（腹股沟疝）。","词源可拆解理解：bubono- 来自希腊语 boubōn（腹股沟），-cele 表示“疝/囊肿/肿胀”（也见于 hydrocele、varicocele 等词）。"]}
{"word":"bubonoceze","summary":{"en":"“bubonoceze” isn’t a standard English word; it’s probably a misspelling or a name/handle.","zh":"“bubonoceze”不是标准英语单词；更可能是拼写错误或专有名称/网名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a recognized English word. It is likely a misspelling, a made-up word (nonsense word), or a name/handle.","zh":"不是常见或可查到的英语单词。很可能是拼写错误、随意造的词（无意义词），或是人名/网名。"},"examples":[{"en":"I can’t find “bubonoceze” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里查不到“bubonoceze”——你能把它出现的句子发给我吗？"},{"en":"Maybe “bubonoceze” is a username or a brand name, not an English vocabulary word.","zh":"“bubonoceze”可能是用户名或品牌名，而不是英语词汇。"}]}],"phonetic":"/ˌbuːboʊnoʊˈsiːz/","extraExplanation":["如果你告诉我它的来源（例如：网页链接、歌曲歌词、聊天记录、图片截图）或提供前后句，我可以帮你判断它是不是：拼写错误（并猜测可能的正确单词）、某种语言的音译、专有名词（人名/地名/品牌）、或是刻意创造的“拟声/搞笑”词。"]}
{"word":"bubos","summary":{"en":"Bubos are swollen lymph nodes, often associated with serious infection—historically, bubonic plague.","zh":"Bubos 指肿大的淋巴结，常与感染相关；历史上尤其与鼠疫联系紧密。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Swollen lymph nodes, especially in the groin or armpit, often caused by infection (historically linked to bubonic plague).","zh":"（复数）腹股沟或腋下等处肿大的淋巴结（常由感染引起；历史上常与鼠疫相关）。"},"examples":[{"en":"Doctors checked the patient for bubos in the groin.","zh":"医生检查病人腹股沟是否有肿大的淋巴结（bubos）。"},{"en":"In history books about the Black Death, bubos are described as a common sign.","zh":"在关于“黑死病”的历史书里，bubos 常被描述为一种常见症状。"}]}],"synonyms":["swollen lymph nodes","lymph node swelling","gland swelling"],"phonetic":"ˈbjuːboʊz","extraExplanation":["“bubos”是“bubo”的复数形式。这个词来自希腊语 *boubon*（腹股沟），因此常见位置是腹股沟、腋下等淋巴结丰富的区域。","在现代医学语境里更常用的说法是“swollen lymph nodes（淋巴结肿大）”。“bubo/bubos”带有较强的历史/传染病（尤其是鼠疫）色彩。"]}
{"word":"bubs","summary":{"en":"“Bubs” is an informal word meaning “a baby/young child,” and it can also be a friendly way to address someone (common in some regions like Australia).","zh":"“bubs”是口语用法，常指“宝宝/小婴儿”，也可作亲昵的称呼（在澳大利亚等地区较常见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A baby or very young child; also used as a friendly nickname for a child.","zh":"（非正式）婴儿、小宝宝；也可作对孩子的亲昵称呼。"},"examples":[{"en":"How’s bubs doing—sleeping any better?","zh":"宝宝最近怎么样——睡得好些了吗？"},{"en":"We’re bringing bubs to the park this afternoon.","zh":"我们今天下午要带宝宝去公园。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, friendly) A way to address someone you feel close to (like “buddy”), especially in some varieties of English (e.g., Australia).","zh":"（非正式、亲昵）对亲近的人（如“哥们/老友”）的称呼；在某些英语地区（如澳大利亚）更常见。"},"examples":[{"en":"You all good, bubs?","zh":"你还好吗，老友？"},{"en":"Thanks for the help, bubs.","zh":"谢啦，老友。"}]}],"synonyms":["baby","bub","little one","kiddo","buddy"],"phonetic":"/bʌbz/","extraExplanation":["“bubs”常见于口语，多作为复数形式来泛指“宝宝/小家伙”（尤其在家庭对话里），也可当作称呼语使用。语气通常亲昵、随意；正式场合不建议用。"]}
{"word":"bubukle","summary":{"en":"Buckle means to fasten with a clasp (like a seat belt), or to bend/collapse under pressure; it can also mean the clasp itself.","zh":"Buckle 指用扣子系紧（如安全带），也可指在压力下弯曲/塌陷；还可以指“扣子/带扣”本身。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to fasten (something) with a buckle; to attach and secure by closing a clasp","zh":"用带扣扣住（某物）；用扣子系紧、固定"},"examples":[{"en":"Please buckle your seat belt before the plane takes off.","zh":"飞机起飞前请系好安全带。"},{"en":"He buckled his shoes and hurried outside.","zh":"他扣好鞋带扣，急忙跑到外面。"}]},{"partOfSpeech":"vi.","definition":{"en":"to bend, collapse, or give way under pressure (physically or mentally)","zh":"（因压力）弯曲、塌陷；（精神上）撑不住、崩溃"},"examples":[{"en":"The bridge buckled during the earthquake.","zh":"地震时那座桥发生了变形。"},{"en":"She didn’t buckle under pressure during the exam.","zh":"考试时她没有被压力压垮。"}]},{"partOfSpeech":"n.","definition":{"en":"a clasp or metal frame used to fasten a belt, strap, or shoe","zh":"扣子；（皮带、背带、鞋等的）带扣"},"examples":[{"en":"His belt buckle is made of silver.","zh":"他的皮带扣是银制的。"},{"en":"This backpack has a strong buckle.","zh":"这个背包有很结实的扣子。"}]}],"synonyms":["fasten","clasp","collapse","bend","give way"],"phonetic":"/ˈbʌkəl/","extraExplanation":["你输入的“bubukle”看起来像是拼写错误，最常见的对应词是“buckle”。如果你原本想找的是“bubble（泡泡）”或别的词，可以告诉我语境（句子/场景），我可以帮你确认。","“buckle”在交通安全提示里非常常见：Buckle up! 表示“系好安全带！”（更口语、更像命令/提醒）。"]}

