{"word":"BUD","summary":{"en":"Bud means a young unopened flower/leaf, and informally it can mean a friend; as a verb, it means to begin to grow or develop.","zh":"Bud 常指（花或叶的）芽/花苞；口语中也可指朋友；作动词表示发芽或开始发展。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small unopened flower or leaf that will grow into a flower or new leaves","zh":"（花或叶的）芽；花苞"},"examples":[{"en":"The rose bush is full of buds in spring.","zh":"春天玫瑰灌木上长满了花苞。"},{"en":"These buds will open in a few days.","zh":"这些花苞过几天就会开。"}]},{"partOfSpeech":"n.","definition":{"en":"a friend (informal)","zh":"朋友；哥们（非正式）"},"examples":[{"en":"Hey, bud, can you help me for a second?","zh":"嘿，哥们，能帮我一下吗？"},{"en":"We’ve been buds since high school.","zh":"我们从高中起就是好朋友了。"}]},{"partOfSpeech":"vi.","definition":{"en":"to start to grow buds; to begin developing","zh":"发芽；长出花苞；开始萌发/发展"},"examples":[{"en":"The trees begin to bud in early April.","zh":"树木在四月初开始发芽。"},{"en":"New ideas are budding in our team.","zh":"我们团队里正在萌生新的想法。"}]},{"partOfSpeech":"n.","definition":{"en":"the dried flower of cannabis (informal; legal status varies by place)","zh":"大麻花（俗称；各地法律规定不同）"},"examples":[{"en":"In some places, people talk about buying cannabis buds.","zh":"在一些地方，人们会谈到购买大麻花。"}]}],"synonyms":["sprout","shoot","blossom (as a verb: develop)","pal (informal)","buddy (informal)"],"phonetic":"/bʌd/","extraExplanation":["“bud”表示“哥们/朋友”时，常用于男性之间的随意称呼（类似“buddy”）。在某些语境里，对陌生人说“bud”可能显得有点居高临下或带点不耐烦，语气要注意。","“bud”指“大麻花”属于口语用法，是否合适取决于场合与当地法律文化背景。"]}
{"word":"Bud","summary":{"en":"“Bud” most commonly means a flower/leaf bud, and it can also mean “friend” in informal speech or marijuana flower in slang. As a verb, it means to start growing or forming buds.","zh":"“bud”最常见指（植物的）芽/花苞；口语里也可指“朋友/哥们”，俚语中还可指“大麻花”。作动词表示“发芽、长出花苞”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, tight flower or leaf that has not opened yet.","zh":"（植物的）芽；花苞；未开放的叶芽"},"examples":[{"en":"The rose buds will open in a few days.","zh":"玫瑰花苞几天后就会开放。"},{"en":"In early spring, tiny buds appear on the branches.","zh":"早春时，树枝上会冒出小小的嫩芽。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) A friendly way to address someone; a friend.","zh":"（非正式）朋友；哥们/老兄（称呼用语）"},"examples":[{"en":"Hey, bud, can you help me for a second?","zh":"嘿，哥们，能帮我一下吗？"},{"en":"She’s not just a teammate—she’s a bud.","zh":"她不只是队友——也是朋友。"}]},{"partOfSpeech":"n.","definition":{"en":"A part of the marijuana plant, especially the dried flower used for smoking.","zh":"（大麻的）花；大麻花（常指晒干后用于吸食的部分）"},"examples":[{"en":"The police found several bags of marijuana buds.","zh":"警方发现了几袋大麻花。"},{"en":"In many places, selling cannabis bud is still illegal.","zh":"在很多地方，出售大麻花仍然是违法的。"}]},{"partOfSpeech":"v.","definition":{"en":"To begin to grow; to form buds (flowers or leaves).","zh":"发芽；长出花苞/嫩芽"},"examples":[{"en":"The trees are budding after the warm weather.","zh":"天气转暖后，树开始发芽了。"},{"en":"The plant buds in late winter.","zh":"这种植物在冬末开始长出花苞。"}]}],"synonyms":["sprout","shoot","blossom bud","pal (informal)","buddy (informal)"],"phonetic":"/bʌd/","extraExplanation":["“bud”作称呼（= friend）在美式口语里很常见，语气通常友好，但也可能带一点居高临下或不耐烦的感觉，具体取决于语境和语气。","与大麻相关的“bud”属于口语用法，涉及法律与文化差异：不同国家/地区对大麻的合法性规定不同，使用时注意场合。"]}
{"word":"bud","summary":{"en":"Bud most commonly means a plant’s young growth (a flower/leaf bud), and informally it can mean a friend; as a verb, it means to begin to grow or develop.","zh":"Bud最常见指植物的“芽/花苞”，口语中也可指“朋友/哥们”；作动词表示“发芽、萌芽、开始发展”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, undeveloped growth on a plant that can open into a leaf or flower.","zh":"（植物的）芽；花苞（尚未展开、未来会长成叶子或花的部分）。"},"examples":[{"en":"In spring, the buds on the trees begin to open.","zh":"春天里，树上的芽开始绽开。"},{"en":"The rose bud hasn’t bloomed yet.","zh":"玫瑰花苞还没有开。"}]},{"partOfSpeech":"n.","definition":{"en":"A close friend (informal).","zh":"朋友；哥们（非正式用法）。"},"examples":[{"en":"Hey, bud, are you free this weekend?","zh":"嘿，哥们，这周末你有空吗？"},{"en":"Thanks for helping me out, bud.","zh":"谢谢你帮我一把，朋友。"}]},{"partOfSpeech":"v.","definition":{"en":"To begin to grow; to form a bud; to start developing.","zh":"发芽；萌芽；开始发展、形成（新的事物）。"},"examples":[{"en":"The trees are budding after the rain.","zh":"雨后树木开始发芽。"},{"en":"A new idea is budding in her mind.","zh":"一个新想法正在她脑中萌生。"}]}],"synonyms":["sprout","blossom","pal (informal)","buddy (informal)"],"phonetic":"/bʌd/","extraExplanation":["“Bud”用来称呼别人（尤其是男性或孩子）时，语气取决于情境：在朋友之间通常很亲切；但陌生人之间有时会显得居高临下或带一点不耐烦（类似“兄弟/小子”的语感），说话时要注意语境与语气。"]}
{"word":"bud of promise","summary":{"en":"an early hopeful sign of future success","zh":"未来成功的早期希望迹象"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"An early sign that something good is likely to happen or develop in the future; a hopeful beginning.","zh":"（某事将会变好或成功的）初现端倪；希望的开端。"},"examples":[{"en":"Her first confident speech was a bud of promise for her future as a leader.","zh":"她第一次自信的演讲，是她未来成为领导者的希望开端。"},{"en":"The small improvements in sales are a bud of promise after a difficult year.","zh":"销量的小幅回升，是艰难一年后的希望苗头。"}]}],"synonyms":["sign of promise","early promise","hopeful sign","good omen","glimmer of hope","green shoot"],"phonetic":"/ˈbʌd əv ˈprɑːmɪs/","extraExplanation":["常用于较正式或文学性的表达（writing/speeches），强调“还很早，但看得出潜力”。","相关表达：\"a bud of promise\"侧重“刚开始的迹象”；\"show promise\"更口语、更常见，表示“显露潜力”。"],"etymology":"源自“bud（花苞/嫩芽）”的比喻用法：花苞尚未开放，但预示将开花结果；因此引申为“未来可期的早期迹象”。","mnemonic":["把它想成“希望的花苞”：现在只是小小花苞（bud），但暗示以后会开花（promise）。","联想中文“萌芽/苗头”：bud≈萌芽，promise≈希望/前景。"]}
{"word":"BUD-DHA","summary":{"en":"Buddha means an enlightened person in Buddhism, especially Siddhartha Gautama; it can also mean a statue or image of the Buddha.","zh":"Buddha 指佛教中的觉悟者，尤指释迦牟尼；也可指佛像或佛陀形象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Buddhism) the title for an enlightened person, especially Siddhartha Gautama, the founder of Buddhism.","zh":"（佛教中）“佛陀”的称号，指觉悟者；尤指释迦牟尼（佛教创始人）。"},"examples":[{"en":"Many Buddhists respect the Buddha as a teacher who showed the path to awakening.","zh":"许多佛教徒尊敬佛陀为指引觉悟之道的老师。"},{"en":"In art, the Buddha is often shown sitting in meditation.","zh":"在艺术作品中，佛陀常被描绘为打坐冥想的姿态。"}]},{"partOfSpeech":"n.","definition":{"en":"A statue, image, or representation of the Buddha (often used in everyday speech).","zh":"佛像；佛陀的雕像或形象（口语中常这样说）。"},"examples":[{"en":"She placed a small Buddha on the shelf as a decoration.","zh":"她把一尊小佛像放在架子上作装饰。"},{"en":"Please handle the Buddha carefully; it’s made of porcelain.","zh":"请小心拿佛像；它是瓷做的。"}]}],"synonyms":["the Enlightened One","Gautama (Buddha)","Siddhartha Gautama"],"phonetic":"/ˈbuːdə/","extraExplanation":["“Bud-dha”这种写法是按音节拆分（Bud + dha），方便发音或标注；标准拼写是 Buddha。","英语里常用大写 Buddha 表示“佛陀/释迦牟尼”这一专称；小写 a buddha 可泛指“觉悟者”。","在跨文化语境中，把佛像当作纯装饰可能会让部分信众感到不敬；更稳妥的表达是说明它具有宗教或文化意义。"]}
{"word":"bud-forming","summary":{"en":"Bud-forming describes a plant or part of a plant that is producing buds or starting new growth.","zh":"bud-forming 用來形容植物（或其部位）正在形成花苞／芽、開始新生長。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) producing buds; beginning to develop new growth.","zh":"（植物學）正在形成花苞／芽；開始長出新芽、進入生長初期的。"},"examples":[{"en":"In early spring, the bud-forming branches are very sensitive to frost.","zh":"早春時，正在形成花苞的枝條對霜凍非常敏感。"},{"en":"Researchers measured how temperature affects bud-forming in young trees.","zh":"研究人員測量溫度如何影響幼樹的芽形成。"},{"en":"Choose a fertilizer that supports bud-forming plants without burning the roots.","zh":"選擇能支持正在長芽的植物、又不會傷根的肥料。"}]}],"synonyms":["budding","sprouting","developing buds"],"phonetic":"/ˈbʌd ˌfɔrmɪŋ/","extraExplanation":["這是一個由「bud（芽、花苞）」+「forming（形成）」組成的複合形容詞，常用連字號（bud-forming）放在名詞前面修飾，如：bud-forming stage（芽形成期）、bud-forming shoots（正在長芽的嫩枝）。在園藝與植物科學文章中較常見。"]}
{"word":"bud-fruiting","summary":{"en":"Bud-fruiting describes plants that bear fruit from buds, and it can also mean the fruiting habit/process in horticulture.","zh":"bud-fruiting 指植物从芽上结果（芽结果的），也可指这种结果习性/过程。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany/Horticulture) Producing fruit from buds; bearing fruit on buds (often referring to where on the plant the fruit forms).","zh":"（植物学/园艺）芽结果的；从芽上结出果实的（常用来说明果实在植物的哪个部位形成）。"},"examples":[{"en":"Some grape varieties are bud-fruiting, so pruning methods strongly affect the harvest.","zh":"有些葡萄品种是芽结果型，因此修剪方式会强烈影响产量。"},{"en":"In bud-fruiting plants, fruit can develop from buds that formed during the previous season.","zh":"在芽结果植物中，果实可能由上一季形成的芽发育而来。"}]},{"partOfSpeech":"n.","definition":{"en":"The habit or process of forming fruit from buds (used in plant science writing).","zh":"（植物学写作中）芽结果的习性；从芽形成果实的过程。"},"examples":[{"en":"Researchers compared bud-fruiting in two cultivars under different temperatures.","zh":"研究人员比较了两种栽培品种在不同温度下的芽结果情况。"},{"en":"Bud-fruiting is often discussed together with pruning and bud fertility.","zh":"芽结果常与修剪和芽的结实性（芽的结果能力）一起讨论。"}]}],"synonyms":["bud-bearing","fruiting from buds","bud-set fruiting"],"phonetic":"/bʌd ˈfruːtɪŋ/","extraExplanation":["“bud-fruiting”多见于园艺与果树/葡萄栽培语境，用来描述“果实从哪里长出来”。理解它时可以联想到修剪：如果果实主要来自某些位置的芽（例如一年生枝条上的芽），修剪时保留哪些芽就会直接影响来年的产量。","写作中也常搭配术语“bud fertility”（芽的结实性/结果能力），指某个芽未来能不能、以及能结多少果。"]}
{"word":"bud-grafted","summary":{"en":"Bud-grafted describes a plant grown by attaching a single bud of one variety onto another plant’s rootstock.","zh":"bud-grafted 指通过“芽接”把某品种的一枚芽接到砧木上繁殖出来的植物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a plant or tree) propagated by bud grafting: a single bud from one plant is inserted onto the rootstock (base plant) of another so it grows as the desired variety.","zh":"（指植物/树木）用“芽接法”繁殖的：把某一品种的一枚芽接到另一株作砧木（根部/基部）的植物上，使其长成所需品种。"},"examples":[{"en":"The nursery sells bud-grafted citrus trees that fruit earlier than seedlings.","zh":"这家苗圃出售芽接的柑橘树，比实生苗更早结果。"},{"en":"Bud-grafted roses often combine strong roots with showy flowers.","zh":"芽接玫瑰常把强健的根系与艳丽的花朵结合起来。"}]}],"synonyms":["budded","grafted"],"phonetic":"/ˈbʌd ˌɡræf.tɪd/","extraExplanation":["“Bud-grafted”常见于园艺、果树栽培说明书或苗圃标签，属于较专业的形容词。","芽接（bud grafting）是嫁接（grafting）的一种：不是接一段枝条（scion），而是接“一个芽”（bud）。常见方法有“T字芽接（T-budding）”等。","选择芽接的原因通常是：保持品种性状一致、提高成活率、利用砧木的抗病/耐寒/耐旱能力、并可能缩短结果时间。"]}
{"word":"bud-grafts","summary":{"en":"Bud-grafts are grafts made by inserting a single bud onto a rootstock, or the act of doing this.","zh":"bud-grafts 指“芽接（法）”或“进行芽接”的行为：把一个芽接到砧木上让其长成新枝。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of plant graft in which a single bud (with a small piece of bark) is inserted into another plant (the rootstock) so the bud grows into a new shoot","zh":"（园艺）芽接法：把一个芽（通常带一小片树皮）接到另一株植物（砧木）上，让这个芽长成新枝"},"examples":[{"en":"Many fruit trees are propagated by bud-grafts to keep the variety true.","zh":"许多果树会用芽接来繁殖，以保持品种性状稳定。"},{"en":"The gardener made bud-grafts in late summer when the bark was easy to lift.","zh":"园丁在夏末进行芽接，因为那时树皮更容易剥离。"}]},{"partOfSpeech":"v.","definition":{"en":"to join a bud from one plant onto another plant so it can grow there","zh":"（动词）进行芽接：把一株植物的芽接到另一株植物上，使其在砧木上生长"},"examples":[{"en":"They bud-graft roses to combine strong roots with beautiful flowers.","zh":"他们用芽接繁殖玫瑰，把强壮的根系和漂亮的花结合起来。"},{"en":"You can bud-graft a desired variety onto a hardy rootstock.","zh":"你可以把想要的品种芽接到更耐寒的砧木上。"}]}],"synonyms":["bud grafts","budding","T-budding","grafts"],"phonetic":"/ˈbʌdˌɡræfts/","extraExplanation":["“bud-graft(s)”多用于园艺/农业语境，也常写作 **bud graft(s)** 或更常见的术语 **budding**（芽接）。常见做法包括 **T-budding（T形芽接）** 等。","复数 **bud-grafts** 通常指“多次芽接操作/多个芽接部位/多个芽接苗”。"]}
{"word":"bud-producing","summary":{"en":"Bud-producing describes something (usually a plant or branch) that produces buds.","zh":"bud-producing 指（通常是植物或枝条）会产生芽、长出芽的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a plant or branch) producing buds (small growth points that can develop into leaves, flowers, or new shoots).","zh":"（指植物或枝条）产生芽的；长出芽的（芽是可发育成叶、花或新枝的生长点）。"},"examples":[{"en":"In early spring, the bud-producing branches are the first sign that winter is ending.","zh":"在早春，长出芽的枝条是冬天结束的第一个迹象。"},{"en":"Choose a bud-producing stem if you want more flowers later in the season.","zh":"如果你想在季节后期开更多花，就选择会长芽的茎。"}]},{"partOfSpeech":"adj.","definition":{"en":"(biology, less common) producing buds as a way of reproducing (for example, some yeast cells).","zh":"（生物学，较少用）通过出芽进行繁殖的（例如某些酵母细胞）。"},"examples":[{"en":"Under the microscope, you can see bud-producing yeast cells dividing.","zh":"在显微镜下，你可以看到通过出芽分裂的酵母细胞。"}]}],"synonyms":["budding","sprouting","bud-forming"],"phonetic":"/ˈbʌd prəˌdusɪŋ/","extraExplanation":["“bud-producing”是由名词“bud（芽）”+ 现在分词“producing（产生的）”构成的复合形容词，常用于植物学或园艺说明文字。","与“budding（长出芽的/萌芽的）”相比，“bud-producing”更强调“产生芽的能力或过程”，语气更偏描述功能或特征。"]}
{"word":"bud-shaped","summary":{"en":"“Bud-shaped” describes something that looks like a closed flower bud—rounded and not yet open.","zh":"“bud-shaped”指“芽状的、像花苞一样的”，形状圆润且尚未展开。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Shaped like a bud (a small, unopened flower or leaf); resembling the rounded, closed form of a flower bud.","zh":"芽状的；像花苞一样的（形状圆润、未开放的）。"},"examples":[{"en":"The lamp has a bud-shaped glass shade that looks like a flower about to bloom.","zh":"这盏灯有一个芽状的玻璃灯罩，看起来像一朵即将开放的花。"},{"en":"The artist carved a series of bud-shaped ornaments along the frame.","zh":"艺术家在画框边缘雕刻了一排芽状装饰。"},{"en":"In early spring, the buds are small and bud-shaped, tightly wrapped against the cold.","zh":"早春时节，芽很小，呈芽状，为了抵御寒冷而紧紧包裹着。"}]}],"synonyms":["budlike","bud-form","bud-shaped (hyphenated)"],"phonetic":"/ˈbʌd ˌʃeɪpt/","extraExplanation":["“bud-shaped”是一个带连字符的复合形容词（名词 bud + 过去分词 shaped），常见于植物学描述、艺术设计、珠宝与建筑装饰等语境，用来强调“像花苞/嫩芽那样的轮廓”。写作中也可见同义表达“budlike”。"]}
{"word":"bud-surrounding","summary":{"en":"Bud-surrounding describes something (usually a plant structure) that encloses or lies around a bud.","zh":"Bud-surrounding 指（通常为植物结构）包围或位于芽周围的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Surrounding, enclosing, or occurring around a plant bud.","zh":"（植物学）围绕花芽/叶芽的；包围芽的；发生在芽周围的。"},"examples":[{"en":"In some plants, bud-surrounding scales protect the bud during winter.","zh":"在一些植物中，围绕芽的鳞片在冬季保护花芽。"},{"en":"The bud-surrounding leaves are often smaller and tougher than the outer leaves.","zh":"芽周围的叶子通常比外层叶子更小、更坚韧。"}]}],"synonyms":["bud-enclosing","bud-covering","around the bud","surrounding the bud"],"phonetic":"/bʌd səˈraʊndɪŋ/","extraExplanation":["这是一个较少见的组合形容词（bud + surrounding），常见于植物学或园艺写作中，用来精确描述“围绕芽的”结构，例如 bud-surrounding scales（芽周鳞片）、bud-surrounding leaves（芽周叶）。在日常英语里更常用 around the bud / surrounding the bud 来表达同样意思。"]}
{"word":"Buda","summary":{"en":"Buda is the western, hilly part of Budapest and also the name of the historic city that merged into modern Budapest; it’s sometimes a nonstandard misspelling of “Buddha.”","zh":"Buda 指布达佩斯西岸的丘陵地区，也可指并入现代布达佩斯的历史城市“布达”；有时也会被用作对“Buddha（佛陀）”的不规范误拼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The hilly, western part of Budapest, Hungary (on the west bank of the Danube River).","zh":"匈牙利首都布达佩斯的西岸丘陵区（多瑙河西岸），称为“布达”。"},"examples":[{"en":"We stayed in Buda because it’s quieter and has great views.","zh":"我们住在布达，因为那里更安静，而且景色很好。"},{"en":"Buda Castle is one of the most famous sights in Budapest.","zh":"布达城堡是布达佩斯最著名的景点之一。"}]},{"partOfSpeech":"n.","definition":{"en":"A historic city that later joined with Pest (and Óbuda) to form modern Budapest.","zh":"历史上的“布达城”，后来与“佩斯”（以及“旧布达”）合并，形成今天的布达佩斯。"},"examples":[{"en":"In 1873, Buda and Pest were officially united.","zh":"1873年，布达与佩斯正式合并。"}]},{"partOfSpeech":"n.","definition":{"en":"An informal misspelling of “Buddha” in English (less standard).","zh":"英语里对“Buddha（佛陀）”的非正式误拼（不规范）。"},"examples":[{"en":"Some people type “Buda,” but the standard spelling is “Buddha.”","zh":"有些人会打成“Buda”，但规范拼法是“Buddha（佛陀）”。"}]}],"synonyms":["Budapest (related)","Pest (related)"],"phonetic":"/ˈbuːdə/","extraExplanation":["“Buda”常见于旅游与历史语境：布达以山丘、城堡区（Castle District）著名；“Pest”则更平坦、更繁华。两岸以多瑙河分隔，合称“Budapest（布达佩斯）”。","英语中提到地点时通常大写“Buda”；如果你想表达“佛陀”，标准拼写是“Buddha”，发音也不同。"]}
{"word":"buda","summary":{"en":"Buda is most commonly the western part of Budapest (Hungary), across the Danube from Pest.","zh":"Buda 最常指匈牙利首都布达佩斯的西岸区域“布达”，与“佩斯”隔多瑙河相对。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the western (hilly) part of Budapest, the capital of Hungary, separated from Pest by the Danube River","zh":"（匈牙利首都）布达佩斯的西岸丘陵区域“布达”，与“佩斯”隔多瑙河相望"},"examples":[{"en":"We stayed on the Buda side of Budapest for a quieter neighborhood.","zh":"我们住在布达佩斯的布达一侧，那里更安静。"},{"en":"From Buda Castle, you can see the Parliament building across the river.","zh":"从布达城堡可以看到河对岸的国会大厦。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name or given name in some cultures","zh":"在某些文化中用作姓氏或名字"},"examples":[{"en":"Buda is his last name, not a nickname.","zh":"Buda 是他的姓，不是外号。"}]}],"synonyms":["Budapest (Buda side)","Buda district"],"phonetic":"/ˈbuːdə/","extraExplanation":["“Buda”最常见的含义是“布达佩斯（Budapest）”中“布达（Buda）”这一部分：历史上布达与佩斯曾是两个城市，后来与奥布达（Óbuda）合并成今天的布达佩斯。","容易混淆：英语里的“Buddha（佛陀）”有时在其他语言或非正式拼写中会被写成“Buda”，但标准英语写法通常是“Buddha”。如果你想查的是“佛陀”，告诉我我可以给你“Buddha”的词条。"]}
{"word":"Budapest","summary":{"en":"Budapest: the capital city of Hungary on the Danube River.","zh":"布达佩斯：匈牙利首都，位于多瑙河畔。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The capital city of Hungary, located on the Danube River in Central Europe.","zh":"布达佩斯：匈牙利的首都，位于中欧多瑙河畔。"},"examples":[{"en":"Budapest is the capital of Hungary.","zh":"布达佩斯是匈牙利的首都。"},{"en":"We took a night cruise on the Danube in Budapest.","zh":"我们在布达佩斯乘船夜游多瑙河。"},{"en":"Budapest is famous for its thermal baths and historic architecture.","zh":"布达佩斯以温泉浴场和历史建筑闻名。"}]}],"synonyms":["Hungarian capital","Buda and Pest (historical parts)"],"phonetic":"ˈbuːdəˌpɛst","extraExplanation":["布达佩斯由“布达（Buda）”和“佩斯（Pest）”两部分组成，分别位于多瑙河两岸；历史上它们是独立城市，1873年合并后形成今天的布达佩斯。","在英语中它是专有名词，通常不加冠词：说“in Budapest”“to Budapest”，而不是“the Budapest”。","常见文化联想包括：链子桥（Chain Bridge）、渔人堡（Fisherman’s Bastion）、国会大厦（Hungarian Parliament Building）以及温泉浴场（thermal baths）。"]}
{"word":"budbreak","summary":{"en":"Budbreak is the stage when plant buds open and new growth begins, especially in spring.","zh":"Budbreak 指植物芽开放并开始新生长的阶段，尤多发生在春季。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the time when buds on plants (especially grapevines or fruit trees) open and new leaves or shoots start to grow","zh":"（植物，尤指葡萄藤或果树的）萌芽期；芽开放、新叶或新梢开始生长的阶段"},"examples":[{"en":"Budbreak usually happens in early spring when temperatures begin to rise.","zh":"萌芽期通常发生在早春，气温开始回升的时候。"},{"en":"A late frost after budbreak can damage young shoots in the vineyard.","zh":"葡萄园在萌芽期之后如果遇到晚霜，可能会伤害幼嫩的新梢。"},{"en":"Growers track budbreak to plan irrigation and pest control.","zh":"种植者会记录萌芽期，以便安排灌溉和病虫害防治。"}]}],"synonyms":["budburst","bud break"],"phonetic":"/ˈbʌdˌbreɪk/","extraExplanation":["“budbreak”常见于农业与园艺（尤其是葡萄栽培与果树管理）。它是一个关键物候指标：从“休眠（dormancy）”转入“生长季（growing season）”的起点。","在葡萄酒行业里，budbreak 的早晚会影响后续开花（flowering）、转色（veraison）和采收（harvest）的时间，也与霜冻风险评估密切相关。"]}
{"word":"budburst","summary":{"en":"Budburst is when plant buds open and new leaves or flowers begin to grow.","zh":"Budburst 指植物芽苞萌发、开始长叶或开花的时期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the moment when a plant’s buds open and begin to produce new leaves or flowers (an early sign of spring growth)","zh":"（植物）芽苞萌发、开始长出新叶或开花的时期（春季生长的早期标志）"},"examples":[{"en":"Scientists track budburst dates to study how climate change affects spring.","zh":"科学家追踪萌芽日期，以研究气候变化如何影响春季。"},{"en":"After a warm week, the cherry trees reached budburst earlier than usual.","zh":"暖和了一周后，樱花树比往年更早进入萌芽期。"}]}],"synonyms":["bud break","leaf-out","spring flush"],"phonetic":"/ˈbʌdˌbɝst/","extraExplanation":["“Budburst”常见于植物学、生态学与气候研究语境，用来记录春季物候（phenology）事件。不同树种的budburst时间差异很大，也会受温度、日照长度与冬季休眠等因素影响。"]}
{"word":"Budd","summary":{"en":"Budd is mainly used as a surname, and more rarely as a first name.","zh":"Budd 主要用作英文姓氏，也较少用作名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname); used as a person’s last name.","zh":"（姓氏）Budd，用作人的英文姓。"},"examples":[{"en":"Ms. Budd will lead today’s meeting.","zh":"Budd 女士将主持今天的会议。"},{"en":"His last name is Budd.","zh":"他姓 Budd。"}]},{"partOfSpeech":"n.","definition":{"en":"a given name (first name), though uncommon.","zh":"（不常见）用作英文名字（名）。"},"examples":[{"en":"Budd Johnson is my neighbor.","zh":"Budd Johnson 是我的邻居。"}]}],"phonetic":"/bʌd/","extraExplanation":["“Budd”最常见是姓氏。它也可能让人联想到文学作品《Billy Budd》（赫尔曼·梅尔维尔的中篇小说），其中“Budd”是主角的姓。注意它与“Buddha（佛陀）”拼写不同，意思也无关。"]}
{"word":"budda","summary":{"en":"“Buddha” most commonly refers to Siddhartha Gautama, and more broadly to any fully enlightened being; it can also mean a statue or image of the Buddha.","zh":"“Buddha”（常被误拼为 budda）最常指释迦牟尼，也可泛指成就圆满觉悟者；还可指佛像。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually written “Buddha”) the title given to Siddhartha Gautama, the founder of Buddhism; it means an “enlightened one.”","zh":"（通常写作“Buddha”）释迦牟尼的称号，也是佛教的创立者之一；意思是“觉悟者/觉者”。"},"examples":[{"en":"Many people visit temples to learn about the Buddha’s teachings.","zh":"许多人去寺庙了解佛陀的教导。"},{"en":"The story of the Buddha is often told as a journey toward enlightenment.","zh":"佛陀的故事常被讲述为一段走向觉悟的旅程。"}]},{"partOfSpeech":"n.","definition":{"en":"In Buddhism, any person who has reached full enlightenment (there can be more than one Buddha).","zh":"在佛教中，泛指任何达到圆满觉悟的人（可以不止一位佛）。"},"examples":[{"en":"Some traditions speak of past and future Buddhas.","zh":"一些传统会谈到过去佛与未来佛。"}]},{"partOfSpeech":"n.","definition":{"en":"A statue, image, or representation of the Buddha.","zh":"佛像；佛陀的雕像或形象。"},"examples":[{"en":"A small Buddha sits on the shelf by the window.","zh":"窗边的架子上放着一尊小佛像。"}]}],"synonyms":["the Enlightened One","Gautama","Siddhartha Gautama","the Awakened One"],"phonetic":"/ˈbuːdə/","extraExplanation":["“budda”常见为拼写错误；标准拼写是“Buddha”。英文里通常要大写（Buddha），因为它是称号/专名。","在英语文化语境中，提到宗教人物或宗教象征时，保持尊重的表达（避免戏谑用法）会更得体。"]}
{"word":"buddage","summary":{"en":"“Buddage” is not a common standard English word; it’s usually a misspelling (often of “baggage” or “bondage”) or a surname.","zh":"“Buddage”不是常见的标准英文词；通常是拼写错误（常见为“baggage”或“bondage”）或姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; most often a misspelling or a proper name (surname).","zh":"不是常见词典中的标准英文单词；更常见的情况是拼写错误，或作为专有名词（姓氏）。"},"examples":[{"en":"I couldn’t find “buddage” in a dictionary—did you mean “baggage”?","zh":"我在词典里找不到“buddage”——你是不是想写“baggage（行李）”？"},{"en":"“Buddage” may appear as a family name in some contexts.","zh":"在某些语境中，“Buddage”可能作为姓氏出现。"}]}],"phonetic":"/ˈbʌdɪdʒ/","extraExplanation":["“buddage”很可能是拼写混淆。最常见的相近词有：","1) baggage /ˈbæɡɪdʒ/：行李；（比喻）心理包袱、过往负担。例：emotional baggage（情感包袱）。","2) bondage /ˈbɑndɪdʒ/：束缚；奴役；（BDSM语境）捆绑玩法（注意场合与语体）。","如果你能给我一句包含“buddage”的原句或你想表达的中文意思，我可以帮你确认到底是哪一个词。"]}
{"word":"buddah","summary":{"en":"“Buddha” most commonly refers to Siddhartha Gautama (the Buddha), and it can also mean any fully enlightened being in Buddhism.","zh":"“Buddha”最常指释迦牟尼佛（佛陀），也可泛指佛教中任何已圆满觉悟的人成佛者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Buddha: the title given to Siddhartha Gautama, the founder of Buddhism, meaning an “enlightened one.”","zh":"佛陀：对释迦牟尼（Siddhartha Gautama）的称号，意为“觉悟者/觉者”，即佛教的创立者。"},"examples":[{"en":"Many Buddhists honor the Buddha as a great teacher of compassion and wisdom.","zh":"许多佛教徒尊崇佛陀为慈悲与智慧的伟大导师。"},{"en":"Images of the Buddha are common in temples across Asia.","zh":"在亚洲各地的寺庙里，佛陀的塑像和画像很常见。"}]},{"partOfSpeech":"n.","definition":{"en":"a buddha (lowercase): any person who has reached complete enlightenment in Buddhist tradition.","zh":"（小写）budha：在佛教传统中，指任何已达到圆满觉悟的人（成佛者）。"},"examples":[{"en":"In some stories, there were buddhas before Gautama.","zh":"在一些故事中，释迦牟尼之前也有其他佛。"},{"en":"The text describes the qualities of a buddha: wisdom, compassion, and clarity.","zh":"经文描述了成佛者的特质：智慧、慈悲与清明。"}]}],"synonyms":["the Buddha","Gautama Buddha","Siddhartha Gautama","the Enlightened One"],"phonetic":"/ˈbuːdə/","extraExplanation":["你输入的 **buddah** 常见为拼写错误；标准拼写是 **Buddha**（更常见）或 **Buddah** 仅在少数非标准用法中出现。写作时建议用 **Buddha**。","文化上建议避免把“Buddha/佛陀”当作玩笑或随意的称呼；在许多语境中它是庄重的宗教与文化名词。"]}
{"word":"Budde","summary":{"en":"“Budde” is usually a proper name—most commonly a surname (and sometimes a place name).","zh":"“Budde”通常是专有名词——最常见为姓氏（有时也可作地名）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname), most often of German or Scandinavian origin","zh":"姓氏（家族姓），常见于德语或斯堪的纳维亚语背景的人名中"},"examples":[{"en":"Dr. Budde will speak at the conference this afternoon.","zh":"Budde 医生今天下午将在会议上发言。"},{"en":"I met someone named Budde in my economics class.","zh":"我在经济学课上认识了一个姓 Budde 的同学。"}]},{"partOfSpeech":"other","definition":{"en":"a place name in some contexts (used as a proper noun, depending on the country/region)","zh":"在某些语境中也可作地名使用（专有名词，因国家/地区而异）"},"examples":[{"en":"They drove through Budde on their way to the coast.","zh":"他们去海岸的路上经过了 Budde。"}]}],"phonetic":"/ˈbʌdi/","extraExplanation":["“Budde”在英语里通常不是普通词汇，而是专有名词（多为姓）。在美国语境中常按英语读音习惯读作 /ˈbʌdi/（类似“buddy”的读法）；但在德语背景中也可能有不同读法与重音。","如果你是在某段文本、简历、地址或书名里看到“Budde”，最好结合上下文判断是“人名（姓）”还是“地名/机构名”，并在需要时询问对方偏好的发音。"]}
{"word":"budded","summary":{"en":"“Budded” means “grew buds” or “began to develop,” and can also describe something that has buds.","zh":"“budded”表示“长出花蕾/芽、开始萌发或发展”，也可作形容词指“有花蕾/带芽的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Past tense/past participle of bud) To begin to grow buds; to start developing or showing early signs of growth or change.","zh":"（bud 的过去式/过去分词）长出花蕾/芽；开始萌发、显露出早期发展迹象。"},"examples":[{"en":"By early spring, the cherry trees had budded.","zh":"到了早春，樱花树已经长出花蕾了。"},{"en":"A new idea budded in her mind during the meeting.","zh":"开会时，她脑海里萌生了一个新想法。"},{"en":"Their friendship budded into something deeper over time.","zh":"随着时间推移，他们的友谊逐渐发展成更深的感情。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having buds (small undeveloped shoots or flowers).","zh":"有花蕾的；带芽的（指尚未开放的花或新芽）。"},"examples":[{"en":"The budded branches looked ready to bloom.","zh":"那些带花蕾的树枝看起来快要开花了。"},{"en":"We walked past budded roses in the garden.","zh":"我们走过花园里带花蕾的玫瑰。"}]}],"synonyms":["sprouted","began","developed","emerged","germinated"],"phonetic":"/ˈbʌdɪd/","extraExplanation":["“bud”本义是“芽/花蕾”，所以 budded 常用来比喻“刚开始出现、尚在早期阶段”的事物（想法、关系、趋势等）。","常见相关表达：nip something in the bud（把……扼杀在萌芽状态），强调在问题刚出现时就及时制止。"]}
{"word":"Buddenbrooks","summary":{"en":"Buddenbrooks is a classic German novel by Thomas Mann about a merchant family’s multi‑generation rise and decline; it can also refer to the family name in the story.","zh":"Buddenbrooks 指托马斯·曼的经典德国小说《布登勃洛克一家》，讲述商人家族几代人的兴衰；也可指书中家族的姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a famous German novel (1901) by Thomas Mann about the rise and decline of a wealthy merchant family in the city of Lübeck over several generations","zh":"《布登勃洛克一家》（1901），托马斯·曼的著名德国小说，描写吕贝克一户富裕商人家族跨越几代人的兴衰"},"examples":[{"en":"I’m reading Buddenbrooks for my German literature class.","zh":"我正在为德国文学课读《布登勃洛克一家》。"},{"en":"Buddenbrooks shows how family duty can clash with personal dreams.","zh":"《布登勃洛克一家》展现了家族责任如何与个人梦想发生冲突。"},{"en":"The novel traces the Buddenbrooks’ decline across generations.","zh":"这部小说追踪了布登勃洛克家族几代人的衰落。"}]},{"partOfSpeech":"n.","definition":{"en":"the surname of the fictional family at the center of the novel Buddenbrooks","zh":"（小说中）布登勃洛克家族的姓氏，即《布登勃洛克一家》的核心人物家族"},"examples":[{"en":"In Buddenbrooks, the Buddenbrooks are respected merchants at the start.","zh":"在《布登勃洛克一家》中，布登勃洛克家族在故事开端是受人尊敬的商人。"},{"en":"Each Buddenbrooks generation faces different pressures from society.","zh":"布登勃洛克家族的每一代都面临来自社会的不同压力。"}]}],"synonyms":["Thomas Mann","German literature","family saga"],"phonetic":"/ˈbʊdənˌbrʊks/","extraExplanation":["这部作品常被归类为“家族史诗/家族小说（family saga）”，也可视为对19世纪德国市民阶级（资产阶级）价值观的观察与批判。","托马斯·曼后来因其文学成就获得诺贝尔文学奖（1929），评奖时特别提到《布登勃洛克一家》对其声誉的重要性。","阅读时可留意它反复出现的主题：商业与艺术/精神追求的拉扯、社会地位与体面（respectability）的压力、以及时代变化对家族命运的影响。"]}
{"word":"budder","summary":{"en":"“Budder” most commonly refers to a creamy cannabis concentrate; it can also be a playful spelling of “butter.”","zh":"“Budder”最常指一种奶油状的大麻浓缩物；也可作“butter（黄油）”的戏谑拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A soft, whipped-looking form of cannabis concentrate (a type of hash oil) that’s high in cannabinoids and used for dabbing or vaping (where legal).","zh":"一种质地柔软、像打发奶油的“大麻浓缩物”（哈希油的一种形态），通常含较高大麻素，用于“dabbing（热钉吸入）”或电子雾化等用途（在合法地区）。"},"examples":[{"en":"The dispensary labeled it as budder because of its creamy texture.","zh":"药房把它标成 budder，是因为它的质地很像奶油。"},{"en":"He asked for budder, but the staff explained the potency and suggested starting with a smaller amount.","zh":"他想买 budder，但店员解释了它的强度，并建议从更小的用量开始。"}]},{"partOfSpeech":"n.","definition":{"en":"A playful spelling of “butter,” sometimes used in brand names, jokes, or casual writing to imitate pronunciation.","zh":"“butter（黄油）”的戏谑/拟音拼写，有时用于品牌名、玩笑或随意写法来模仿发音。"},"examples":[{"en":"This recipe says “budder,” but it just means butter.","zh":"这个食谱写的是“budder”，其实就是指黄油。"},{"en":"Some cafes sell “Budder Coffee” as a catchy name.","zh":"有些咖啡馆用“Budder Coffee”当作吸睛的名字。"}]}],"synonyms":["butter (playful spelling sense)","cannabis concentrate","wax (related)","hash oil (related)"],"phonetic":"ˈbʌdɚ","extraExplanation":["在英语里更常见的是 butter；budder 作为“黄油”的拼写通常是玩笑式或营销用法，不属于标准拼写。","在大麻相关语境中，budder 是一种常见“形态名”（texture name），类似还有 shatter（脆片）、wax（蜡状）、crumble（碎状）等；不同地区法律不同，阅读或使用时要注意合规与安全。"]}
{"word":"budders","summary":{"en":"“Budders” usually means cannabis concentrates called “budder” (plural), and it can also be the verb form meaning to process extract into that texture.","zh":"“budders”通常指一种叫“budder”的浓缩大麻制品（复数），也可作动词表示把提取物加工成这种柔软质地。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang) A type of cannabis concentrate with a soft, butter-like texture; plural form of “budder.”","zh":"（俚语）一种质地像黄油一样柔软的浓缩大麻制品；“budder”的复数形式。"},"examples":[{"en":"Some dispensaries sell shatter, wax, and budders.","zh":"一些药房会出售 shatter、wax 和 budder（复数 budders）。"},{"en":"Budders are usually used for dabbing, not for smoking like dried flower.","zh":"Budder（复数 budders）通常用来 dab（点吸/热吸），而不是像干花那样直接抽。"}]},{"partOfSpeech":"v.","definition":{"en":"(slang) Third-person singular of “budder”: to make or process cannabis concentrate into a budder-like texture.","zh":"（俚语）“budder”的第三人称单数：把浓缩大麻加工成类似 budder 的柔软质地。"},"examples":[{"en":"This technique budders the extract into a smoother, creamier form.","zh":"这种工艺会把提取物处理成更顺滑、更像奶油的形态。"}]}],"synonyms":["wax","crumble","shatter (related type)","hash oil (broader)"],"phonetic":"/ˈbʌdər/","extraExplanation":["“budder”多见于北美大麻相关语境，和 wax（蜡）、shatter（脆片）等并列，指不同质地/形态的浓缩物。由于各地法律不同，这类词在日常场合使用要注意场景与合规性。","如果你其实想写的是“buddies”（朋友们、哥们儿们），那是完全不同的词：buddies = friends。"]}
{"word":"Buddh","summary":{"en":"Buddha refers to Siddhartha Gautama (the founder of Buddhism) and can also mean an enlightened being.","zh":"Buddha 指释迦牟尼（佛教创始人），也可泛指已证得觉悟的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the founder of Buddhism (Siddhartha Gautama), or any person believed to have reached full enlightenment","zh":"佛陀（释迦牟尼，佛教创始人）；也可泛指已证得圆满觉悟的人"},"examples":[{"en":"In many stories, the Buddha teaches through simple everyday examples.","zh":"在许多故事中，佛陀会用日常生活中的简单例子来教导人。"},{"en":"Some Buddhist traditions believe there were many Buddhas in the past.","zh":"一些佛教传统认为过去曾有许多佛陀。"}]}],"synonyms":["the Enlightened One","the Awakened One"],"phonetic":"/ˈbuːdə/","extraExplanation":["你输入的“Buddh”在英文里通常不是完整单词，更常见的拼法是“Buddha”。“Buddh-”也可能作为词根/构词成分出现（源自梵语），常见于“Buddhist（佛教徒/佛教的）”“Buddhism（佛教）”等词。","“Buddha”的字面含义与“觉醒、觉悟”相关，因此在英语里有时也会用来强调“开悟者/觉者”的身份，而不只是一个姓名。"]}
{"word":"buddh","summary":{"en":"“Buddh” is usually an incomplete form; the common English word is “Buddha,” meaning the Buddha or an enlightened being in Buddhism.","zh":"“buddh”通常是未写完整；常见英语词是“Buddha”，指佛陀或佛教中觉悟者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Buddha; the title for Siddhartha Gautama and, more generally, an enlightened person in Buddhism","zh":"佛陀；对释迦牟尼的尊称；也可泛指佛教中觉悟（成佛）的人"},"examples":[{"en":"Many people visit temples to honor the Buddha.","zh":"很多人会去寺庙礼敬佛陀。"},{"en":"In Buddhism, the Buddha is seen as a teacher who showed a path to end suffering.","zh":"在佛教中，佛陀被视为指出止息苦的方法的导师。"}]}],"synonyms":["the Enlightened One","Siddhartha Gautama"],"phonetic":"/ˈbuːdə/","extraExplanation":["你输入的“buddh”通常不是英语里完整的单词，更常见的是“Buddha”（佛陀）或“Buddhist / Buddhism”（佛教徒 / 佛教）。","“Buddha”来自梵语/巴利语词根，意为“觉醒的人/觉悟者”。英语里常用作专有名词（the Buddha）指释迦牟尼，也可作为普通名词指“佛/觉者”，但这种用法更偏宗教语境。","常见搭配：the Buddha（佛陀）、Buddha statue（佛像）、Buddhist teachings（佛教教义）。"]}
{"word":"BUDDHA","summary":{"en":"Buddha most commonly refers to Siddhartha Gautama, the enlightened founder of Buddhism; it can also mean a Buddha statue or (informally) a very calm, wise person.","zh":"Buddha最常指佛教创立者释迦牟尼（觉悟者）；也可指佛像，或（口语）形容非常冷静、睿智的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Buddha: the founder and central figure of Buddhism, especially Siddhartha Gautama, who attained enlightenment","zh":"佛陀：佛教的创立者与核心人物，尤指释迦牟尼（悉达多·乔达摩），据说已证悟成佛"},"examples":[{"en":"Many Buddhists honor the Buddha as an awakened teacher.","zh":"许多佛教徒尊敬佛陀为觉悟的导师。"},{"en":"The story of the Buddha’s life is often told to explain the path to enlightenment.","zh":"人们常讲述佛陀的一生，用来说明通往觉悟的道路。"}]},{"partOfSpeech":"n.","definition":{"en":"(in some contexts) a statue, image, or representation of the Buddha","zh":"（在某些语境中）佛像：佛陀的雕像、画像或其他形象"},"examples":[{"en":"A small Buddha sits on the shelf.","zh":"架子上摆着一尊小佛像。"},{"en":"Please be respectful around the Buddha in the temple.","zh":"在寺庙里请对佛像保持尊重。"}]},{"partOfSpeech":"n.","definition":{"en":"(more generally) a person who is very calm, wise, or spiritually enlightened (often used informally)","zh":"（更泛指，常为口语）非常冷静、睿智或很有“开悟”气质的人"},"examples":[{"en":"In stressful meetings, she’s like a Buddha—always calm.","zh":"在压力很大的会议里，她就像佛一样，总是很冷静。"}]}],"synonyms":["the Enlightened One","the Awakened One","Gautama","Siddhartha Gautama"],"phonetic":"/ˈbuːdə/","extraExplanation":["“Buddha”来自梵语/巴利语 *Buddha*，意为“觉者/觉醒者”（the awakened one），强调“觉悟”的状态，而不只是一个名字。","英语里常写作 *the Buddha*（特指释迦牟尼）或 *a buddha*（泛指“觉者”或某种“佛”）。注意：把别人叫作“a Buddha”通常是夸对方沉稳睿智，但在宗教语境中应避免轻率使用，以示尊重。","复数形式多见 *Buddhas*（也有人用不变形的 *Buddha*，但较少）。相关词：*Buddhism*（佛教）、*Buddhist*（佛教徒/佛教的）。"]}
{"word":"Buddha","summary":{"en":"Buddha means the Enlightened One—especially Siddhartha Gautama, the founder of Buddhism; more broadly, any being who has achieved enlightenment.","zh":"Buddha 指“觉者/佛陀”，通常特指佛教创始人释迦牟尼；也可泛指任何已证得觉悟的成佛者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often “the Buddha”) Siddhartha Gautama, the historical founder of Buddhism, believed to have reached complete awakening (enlightenment).","zh":"（常写作 the Buddha）释迦牟尼佛：佛教的历史创始人释迦牟尼（悉达多·乔达摩），被认为已证得圆满觉悟（成佛/开悟）。"},"examples":[{"en":"Many people study the Buddha’s teachings on suffering and compassion.","zh":"许多人学习佛陀关于苦与慈悲的教导。"},{"en":"In art, the Buddha is often shown sitting in meditation.","zh":"在艺术作品中，佛陀常被描绘为静坐禅定的姿态。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who has achieved enlightenment; in Buddhism, an awakened being.","zh":"觉者；成佛者：在佛教中指已经觉悟、证得解脱与智慧的众生。"},"examples":[{"en":"In some traditions, many Buddhas exist across different times and worlds.","zh":"在一些传统中，认为不同时代与世界有许多佛陀。"},{"en":"She read stories about past Buddhas and their vows.","zh":"她读了关于过去诸佛及其誓愿的故事。"}]}],"synonyms":["the Buddha","the Enlightened One","Siddhartha Gautama","Gautama Buddha"],"phonetic":"/ˈbuːdə/","extraExplanation":["“Buddha”来自梵语/巴利语，意思是“觉醒者”。英文里常把历史上的释迦牟尼称为“the Buddha”，而把“Buddha”泛指成佛者。","大写与小写有时能表达区别：the Buddha（特指释迦牟尼）；a buddha/Buddha（泛指觉悟者）。但实际写作中不同媒体与宗派习惯可能不同。","文化使用上，“Buddha”既是宗教人物称谓，也常出现在艺术、历史与哲学语境中；提及时通常保持尊重，例如避免把它当作随意的装饰或玩笑用语。"]}
{"word":"buddha","summary":{"en":"“Buddha” usually refers to Siddhartha Gautama, the founder of Buddhism; it can also mean any enlightened being in Buddhism, or a statue/image of the Buddha.","zh":"“Buddha”通常指佛教创始人释迦牟尼佛；也可指佛教中任何成佛的觉者，或指佛像/佛陀形象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Buddha: the title for Siddhartha Gautama (c. 5th century BCE), the founder of Buddhism, believed to have reached enlightenment","zh":"佛陀：对乔达摩·悉达多（约公元前5世纪）的称号，他是佛教的创立者，被认为已证悟（觉悟）"},"examples":[{"en":"Many Buddhists honor the Buddha as an awakened teacher.","zh":"许多佛教徒尊敬佛陀为觉悟的导师。"},{"en":"The story of the Buddha is often told as a journey from privilege to compassion.","zh":"佛陀的故事常被讲述为从优渥到慈悲的旅程。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who has achieved perfect spiritual understanding in Buddhism; an enlightened being","zh":"（佛教中）成佛者；觉者；已证悟的众生"},"examples":[{"en":"In some traditions, there are many buddhas across different ages.","zh":"在一些传统中，不同时代有许多佛陀。"},{"en":"The text describes qualities of a buddha, such as wisdom and compassion.","zh":"经典描述了佛陀的特质，如智慧与慈悲。"}]},{"partOfSpeech":"n.","definition":{"en":"a statue, painting, or image of the Buddha","zh":"佛像；佛陀的画像/形象"},"examples":[{"en":"A small Buddha sat on the shelf beside a candle.","zh":"架子上蜡烛旁放着一尊小佛像。"},{"en":"Please don’t touch the Buddha on the altar.","zh":"请不要触碰供桌上的佛像。"}]}],"synonyms":["the Enlightened One","the Awakened One","Gautama Buddha","Shakyamuni","Buddha image"],"phonetic":"/ˈbuːdə/","extraExplanation":["“Buddha”来自梵语/巴利语词根 *budh-*，意思是“醒来、觉悟”。因此它更像一个“称号”（觉者），而不仅是名字。","英文里常写作 the Buddha（特指释迦牟尼）与 a buddha（泛指任何成佛者）。首字母大写通常表示特指历史上的佛陀。","在跨文化语境中谈到佛像（an image of the Buddha）时，很多地区认为应保持尊重：避免把佛像随意放在地上、脚边或不洁处。"]}
{"word":"Buddha statue","summary":{"en":"a sculpture representing the Buddha","zh":"代表佛陀的雕像"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sculpture or figure representing the Buddha, used for religious devotion, meditation, or decoration.","zh":"佛陀（释迦牟尼）的雕像或塑像，可用于宗教礼拜、冥想或装饰。"},"examples":[{"en":"They lit incense in front of the Buddha statue at the temple.","zh":"他们在寺庙的佛像前点了香。"},{"en":"A small Buddha statue sat on the shelf as a reminder to stay calm.","zh":"架子上摆着一尊小佛像，提醒自己保持平静。"},{"en":"Please don’t touch the Buddha statue without permission.","zh":"请不要未经允许触碰佛像。"}]}],"synonyms":["statue of the Buddha","Buddha figure","Buddhist statue","Buddha sculpture"],"phonetic":"/ˈbuːdə ˈstætʃuː/","extraExplanation":["在英语里，日常说法常用 “Buddha statue”。在正式或宗教语境中，也会说 “a statue of the Buddha”。","跨文化场合中，佛像对许多佛教徒具有神圣意义：在寺庙或家庭佛龛处，通常应避免触摸、把佛像放在地上或低处、以及用不尊重的姿势拍照。"],"etymology":"“Buddha”源自梵语 Buddha，意为“觉悟者/觉者”；“statue”源自拉丁语 statua，指“立起的形象、雕像”。合起来就是“佛的雕像”。","mnemonic":["把它拆开记：Buddha（佛）+ statue（雕像）= 佛像。","“statue”里有“stat-（站立）”的感觉：站着/坐着的一尊“佛的雕像”。"]}
{"word":"Buddha-field","summary":{"en":"A “Buddha-field” is a Buddha’s realm (often called a Pure Land) where conditions are especially supportive for spiritual practice and awakening.","zh":"“Buddha-field（佛土/佛刹）”指某位佛所摄持的清净世界（常译“净土”），其中环境更有利于修行与觉悟。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Buddhism) a realm or world influenced by a particular Buddha, where conditions support spiritual practice and awakening; often translated as “Pure Land.”","zh":"（佛教）佛土／佛刹：由某位佛的愿力与功德所摄持的世界或境界，具足有利于修行与觉悟的条件；常译作“净土”。"},"examples":[{"en":"In Mahayana texts, a Buddha-field is described as a place where beings can practice with fewer obstacles.","zh":"在大乘经典中，佛土常被描述为众生较少障碍、容易修行的所在。"},{"en":"Pure Land Buddhism focuses on rebirth in Amitabha’s Buddha-field, Sukhavati.","zh":"净土宗强调往生阿弥陀佛的佛土——极乐世界。"},{"en":"The idea of a Buddha-field helps explain why different Buddhas are linked to different sacred realms.","zh":"“佛土”的观念有助于理解为何不同的佛会对应不同的清净世界。"}]}],"synonyms":["Pure Land","buddha realm","buddhakṣetra"],"phonetic":"/ˈbʊdə fiːld/","extraExplanation":["“Buddha-field”常对应梵语 *buddhakṣetra*（佛刹、佛国土）。英语里也会写作 **buddhafield** 或 **Buddha field**。","在大乘语境中，佛土不一定被理解为“物理空间”，也可被解释为由佛的慈悲、智慧与愿力所成就的清净“境界/世界系统”。不同传统对其“究竟是外在世界还是心性所现”有不同诠释。","与“佛土”相关的常见表达：**Pure Land**（净土）、**Sukhavati**（极乐）、**buddha realm**（佛界/佛国）。在文学与宗教研究写作中，这些词往往按作者立场（信仰/学术）交替使用。"]}
{"word":"Buddha-like","summary":{"en":"“Buddha-like” means resembling the Buddha in appearance, or having a calm, peaceful, wise manner associated with the Buddha.","zh":"“Buddha-like”指外表像佛陀，或指具有人们联想到佛陀的沉静、平和、睿智气质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling the Buddha in appearance (often describing a statue, image, or facial features).","zh":"（外表）像佛陀的；（常用于形容）佛像、图像或面容特征。"},"examples":[{"en":"The garden has a Buddha-like statue near the pond.","zh":"花园池塘边有一尊佛陀般的雕像。"},{"en":"He wore a robe that gave him a Buddha-like look in the photo.","zh":"他穿着长袍，照片里看起来有点像佛陀。"}]},{"partOfSpeech":"adj.","definition":{"en":"Calm, peaceful, and wise in a way people commonly associate with the Buddha.","zh":"（气质）沉静、安宁、睿智的（人们常与佛陀联系在一起的那种感觉）。"},"examples":[{"en":"She stayed Buddha-like during the argument and spoke gently.","zh":"争论时她依然很沉静，语气很温和。"},{"en":"His Buddha-like patience helped the team through a stressful week.","zh":"他佛一般的耐心帮助团队熬过了压力很大的一周。"},{"en":"The teacher had a Buddha-like calm that made the class feel safe.","zh":"老师有一种佛系般的平和，让全班都感到安心。"}]}],"synonyms":["serene","peaceful","calm","tranquil","zen-like","sage-like"],"phonetic":"ˈbʊdəˌlaɪk","extraExplanation":["“Buddha-like”常用连字符（hyphen），多用于作定语：a Buddha-like calm / a Buddha-like smile。作表语时也可见：He was Buddha-like in his composure。","使用时要注意文化敏感性：在英语里它通常是赞美（平和、慈悲、智慧），但如果用来调侃外貌（例如“肚子大所以像佛”）可能显得冒犯，建议避免或换更中性的表达（calm, serene, peaceful）。"]}
{"word":"Buddha-nature","summary":{"en":"Buddha-nature means the inborn potential for awakening in all beings (and sometimes, more loosely, a compassionate and wise inner quality).","zh":"Buddha-nature 指众生与生俱来的觉悟/成佛潜能（也可宽泛指内在的慈悲与智慧气质）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Buddhism) the innate potential or basic capacity in all beings to awaken and become a Buddha; the true, enlightened nature that can be realized through practice and insight.","zh":"（佛教）众生本具的成佛潜能或根本能力；通过修行与觉悟可被体认的真实觉性/佛性。"},"examples":[{"en":"Many Mahayana teachings say that all beings have Buddha-nature.","zh":"许多大乘教义认为一切众生都有佛性（Buddha-nature）。"},{"en":"Meditation is often described as a way to recognize Buddha-nature rather than to create it.","zh":"禅修常被描述为：不是“制造”佛性，而是“认出/体认”佛性。"}]},{"partOfSpeech":"n.","definition":{"en":"A quality in a person’s mind or behavior that suggests compassion, wisdom, calmness, or awakening (often used in a broad or non-technical way).","zh":"（较宽泛、非严格术语用法）指一个人心性或行为中体现出的慈悲、智慧、安定或觉醒气质。"},"examples":[{"en":"She treated everyone with kindness, and people said her Buddha-nature was shining through.","zh":"她待人温和，大家说她的佛性在自然流露。"},{"en":"In modern writing, “Buddha-nature” is sometimes used to mean our capacity for goodness and clarity.","zh":"在现代写作中，“Buddha-nature”有时被用来指我们向善与清明的能力。"}]}],"synonyms":["Buddhahood (potential)","Buddha essence","tathāgatagarbha (technical)","inner awakening"],"phonetic":"/ˈbʊdə ˌneɪtʃɚ/","extraExplanation":["“Buddha-nature”常译为“佛性”“觉性”“如来藏”。不同传统对其理解不完全相同：有的强调“本具的清净觉性”，有的强调“成佛的可能性/种子”。在英语语境里，它既可作为宗教学术概念，也可能被较通俗地用来表达“内在的善与清明”。","连字符写法（Buddha-nature）常见于学术或规范写法；不加连字符（Buddha nature）也能见到，但连字符更清楚地表明这是一个复合名词。"]}
{"word":"Buddha-related","summary":{"en":"“Buddha-related” means connected with the Buddha or Buddhism.","zh":"“Buddha-related”意为“与佛陀或佛教有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with the Buddha (Siddhartha Gautama) or with Buddhism; about Buddhist teachings, images, history, or practices.","zh":"与佛陀（释迦牟尼）或佛教有关的；关于佛教教义、形象、历史或修行的。"},"examples":[{"en":"The museum has a Buddha-related collection of statues and manuscripts.","zh":"这家博物馆收藏了一批与佛陀相关的雕像和手稿。"},{"en":"She’s writing a Buddha-related essay on compassion in early Buddhism.","zh":"她在写一篇与佛陀相关的文章，主题是早期佛教中的慈悲。"},{"en":"Please avoid casual jokes in Buddha-related spaces such as temples.","zh":"在寺庙等与佛陀相关的场所，请避免随意开玩笑。"}]}],"synonyms":["Buddhist-related","Buddhist","Buddha-associated","Buddha-connected"],"phonetic":"/ˈbuːdə rɪˌleɪtɪd/","extraExplanation":["“Buddha-related”是常见的英语构词方式：用连字符把名词+related连在一起，表示“与……有关的”。在正式写作中也可写作“Buddha-related topics/imagery/teachings”。","文化语境：在英语语境里谈论与佛陀或佛教有关的内容时，常强调尊重（respectful language），尤其涉及佛像、寺院礼仪、宗教实践等。"]}
{"word":"Buddhahood","summary":{"en":"Buddhahood means the state of being a Buddha—full enlightenment in Buddhism—and can also refer to Buddha-like awakened qualities in writing.","zh":"Buddhahood 指“成佛”的境界（佛教中的圆满觉悟），也可引申为具有佛陀般觉醒品质的理想状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being a Buddha; complete enlightenment and perfect wisdom in Buddhism","zh":"（佛教）成佛的境界；圆满觉悟与智慧的状态"},"examples":[{"en":"In Mahayana Buddhism, many practitioners aspire to Buddhahood for the benefit of all beings.","zh":"在大乘佛教中，许多修行者以利益一切众生为目标，追求成佛。"},{"en":"The text describes the long path of practice leading to Buddhahood.","zh":"这部经典描述了通往成佛的漫长修行之路。"}]},{"partOfSpeech":"n.","definition":{"en":"a quality or idealized way of being associated with a Buddha, such as compassion, calm, and awakened understanding (often used in religious or philosophical writing)","zh":"（常用于宗教/哲学语境）佛陀所体现的品质或理想境界，如慈悲、宁静与觉醒的理解"},"examples":[{"en":"She spoke of Buddhahood as a symbol of awakened compassion, not just a distant goal.","zh":"她把“佛性/成佛的境界”说成是觉醒的慈悲象征，而不只是遥远的目标。"},{"en":"The poem uses Buddhahood to suggest a mind free from fear and anger.","zh":"这首诗用“成佛的境界”来暗示一种摆脱恐惧与愤怒的心境。"}]}],"synonyms":["enlightenment","awakening","nirvana (related, not identical)","Buddha-nature (related concept)"],"phonetic":"/ˈbʊdəˌhʊd/","extraExplanation":["“Buddhahood”通常翻译为“成佛”或“佛果”。在不同佛教传统中，对“成佛”的解释可能不同：有的强调经过长期修行最终证得圆满觉悟；也有语境会把它作为一种理想状态或象征（如慈悲与觉醒）。","词形上，Buddha（佛陀）+ -hood（表示“身份/状态”，如 childhood, adulthood）→ “成为/处于佛的状态”。"]}
{"word":"buddhahood","summary":{"en":"Buddhahood means the state of being a Buddha—complete enlightenment.","zh":"buddhahood 指“成佛的境界”，即圆满觉悟的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being a Buddha; complete enlightenment in Buddhism","zh":"成佛的境界；佛果；（佛教中）圆满觉悟的状态"},"examples":[{"en":"In Mahayana Buddhism, many teachings describe how all beings can eventually attain buddhahood.","zh":"在大乘佛教中，许多教义描述众生最终都能成就佛果（成佛）。"},{"en":"The story focuses on the long path from suffering to buddhahood.","zh":"这个故事聚焦从痛苦走向成佛境界的漫长道路。"}]}],"synonyms":["enlightenment","Buddha-nature (related)","awakening (related)"],"phonetic":"/ˈbʊdəˌhʊd/","extraExplanation":["“buddhahood”由“Buddha（佛陀）+ -hood（……的状态/身份）”构成，字面意思是“佛陀的状态”。在不同佛教传统中，它常与“enlightenment（觉悟）”“nirvana（涅槃）”相关，但具体内涵可能因宗派（如大乘、上座部、密宗）而有所侧重。","在英文宗教与哲学写作中，buddhahood通常是较正式、学术或宗教语境的词；日常英语里更常用“enlightenment”来表达“觉悟/开悟”。"]}
{"word":"Buddhas","summary":{"en":"“Buddhas” means more than one Buddha—enlightened beings, especially in Buddhism.","zh":"“Buddhas”是 Buddha 的复数，指多位佛陀/觉者（佛教语境中尤常见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of Buddha: enlightened beings, especially Siddhartha Gautama and others considered to have reached full awakening in Buddhism.","zh":"Buddha 的复数：佛陀；指已觉悟的圣者，尤指释迦牟尼佛，也可泛指其他被认为已成佛者。"},"examples":[{"en":"Many temples have statues of Buddhas and bodhisattvas.","zh":"许多寺庙里有佛陀和菩萨的塑像。"},{"en":"In some Buddhist traditions, Buddhas are described as teachers who show the path to liberation.","zh":"在一些佛教传统中，佛陀被描述为指引解脱之道的导师。"}]}],"synonyms":["enlightened beings","Awakened Ones"],"phonetic":"/ˈbuːdəz/","extraExplanation":["“Buddha”来自梵语/巴利语，意为“觉者、醒悟的人”。英文里首字母大写的 Buddha 常特指释迦牟尼（历史上的佛陀）；小写的 buddha 可更泛指“已觉悟者”。","在不同佛教传统中，“Buddhas”可能不仅指历史佛陀，也可能指过去佛、未来佛（如弥勒佛）或多佛世界的诸佛概念。使用时通常依语境而定。","常见相关词：Buddhist（佛教徒/佛教的），Buddhism（佛教），bodhisattva（菩萨）。"]}
{"word":"Buddhaship","summary":{"en":"Buddhaship means the state of being a Buddha—complete enlightenment in Buddhism.","zh":"Buddhaship 指“成佛”的状态，即佛教中圆满觉悟的境界。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being a Buddha; complete enlightenment in Buddhism.","zh":"成佛；佛果；在佛教中达到圆满觉悟的境界。"},"examples":[{"en":"In Mahayana Buddhism, Buddhahood (Buddhaship) is often described as the full awakening of wisdom and compassion.","zh":"在大乘佛教中，Buddhahood（Buddhaship）常被描述为智慧与慈悲的圆满觉醒。"},{"en":"Some texts discuss the path that leads from ordinary life to Buddhahip through practice and insight.","zh":"一些经典讨论了通过修行与观照，从凡夫走向成佛（Buddhaship）的道路。"}]}],"synonyms":["Buddhahood","enlightenment (Buddhist context)","Buddha-nature (related concept)"],"phonetic":"/ˈbuːdəˌʃɪp/","extraExplanation":["“Buddhaship”是较少见的英文形式，更常见的是“Buddhahood”。两者通常可互换，指“成佛/佛果”。","在不同传统中，对“成佛”的理解与修行路径会有差异：例如南传佛教多强调成为阿罗汉或佛陀的不同路线；大乘与金刚乘则常谈菩萨道、佛性（Buddha-nature）与即身成佛等思想（视宗派与经典而定）。","词尾“-ship”在英语中常表示“状态/身份/性质”（如 friendship 友谊、leadership 领导力），所以 Buddhahip 字面上就是“佛的状态/身份”。"]}
{"word":"buddhaship","summary":{"en":"Buddhaship means the state of being a Buddha—full enlightenment in Buddhism.","zh":"buddhaship 指成佛的状态，即佛教中圆满觉悟的境界。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being a Buddha; complete enlightenment in Buddhism","zh":"佛果；成佛的境界；（佛教中）圆满觉悟的状态"},"examples":[{"en":"In Mahayana Buddhism, the goal is often described as attaining buddhahood or buddhahip for the benefit of all beings.","zh":"在大乘佛教中，目标常被描述为为利益一切众生而成佛，达到佛果。"},{"en":"Some texts say that buddhahip includes perfect wisdom and boundless compassion.","zh":"一些经典说，佛果包含圆满的智慧与无量的慈悲。"}]}],"synonyms":["buddhahood","full enlightenment","awakening"],"phonetic":"/ˈbʊdəˌʃɪp/","extraExplanation":["“buddhaship”是英语里较少见的拼写形式，更常见的是“buddhahood”。两者意思基本相同，常用于宗教学、佛学或翻译语境。","在不同佛教传统中，对“成佛/佛果”的路径与解释可能不同（如上座部与大乘对于修行目标与时间尺度的理解），使用时可根据语境选用更具体的词（如 enlightenment, awakening, buddhahood）。"]}
{"word":"buddhi","summary":{"en":"Buddhi means the intellect or wise discriminating understanding in Hindu philosophy; in some modern spiritual contexts, it can mean higher spiritual intelligence.","zh":"buddhi 指印度哲学中的“觉智/理智”（强调分辨与明智判断）；在一些现代灵性语境中也可指更高层次的灵性智慧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Hindu philosophy) the intellect; the inner faculty that understands, judges, and makes wise decisions—often described as the power of discrimination between what is true/lasting and what is not.","zh":"（印度教哲学）“觉智/理智”；内在的理解与判断能力，能做出更有智慧的决定，常被描述为分辨真实与不真实、恒常与短暂的能力。"},"examples":[{"en":"In Yoga philosophy, buddhi helps you choose a calm response instead of reacting in anger.","zh":"在瑜伽哲学中，buddhi 帮助你选择冷静回应，而不是愤怒反应。"},{"en":"Meditation is said to clarify the buddhi, making your decisions more steady.","zh":"有人说冥想能澄清 buddhi，让你的决定更稳定。"},{"en":"The text describes buddhi as the part of the mind that can recognize the difference between right and wrong.","zh":"这部经典把 buddhi 描述为心识中能辨别是非的部分。"}]},{"partOfSpeech":"n.","definition":{"en":"(In Theosophy and some modern spiritual writing) a higher mind or spiritual intelligence, contrasted with everyday thinking.","zh":"（神智学及一些现代灵性写作中）较高层次的心智或灵性智慧，与日常的“想法/思绪”相对。"},"examples":[{"en":"In Theosophy, buddhi is sometimes described as a bridge between the soul and the personality.","zh":"在神智学中，buddhi 有时被说成连接灵魂与人格自我的桥梁。"},{"en":"The author uses buddhi to mean intuitive spiritual understanding, not just logic.","zh":"作者用 buddhi 指直觉式的灵性理解，而不只是逻辑推理。"}]}],"synonyms":["intellect","discernment","wisdom","higher mind"],"phonetic":"/ˈbʊdi/","extraExplanation":["buddhi 源自梵语 बुद्धि（buddhi），常译为“觉智、理智、慧”。与英语里的 intelligence/intuition 有重叠，但更强调“分辨力”（discrimination）：能看清什么更真实、更重要。","在印度哲学（如《数论》《瑜伽经》）里，buddhi 常与 manas（意、思绪/心念的运作）以及 ahamkara（我执/自我感）一起出现：manas 负责接收与处理想法，ahamkara 负责“这是我”，而 buddhi 更像做判断与抉择的“明智裁决者”。"]}
{"word":"Buddhic","summary":{"en":"Buddhic means “related to Buddha-like enlightenment or spiritual wisdom,” and it’s also used in Theosophy for a high level of consciousness.","zh":"Buddhic 指“与成佛的觉悟/佛智相关”，也常在通神论中指一种更高层次的意识（buddhic 层面）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the (future) state of being a Buddha, or to the wisdom/enlightenment associated with Buddhas in Buddhist thought.","zh":"与“成佛”的境界有关；或与佛陀的智慧、觉悟（佛性/佛智）相关。"},"examples":[{"en":"In some Buddhist writings, Buddhic wisdom is described as compassion guided by deep insight.","zh":"在一些佛教著作中，“Buddhic 智慧”被描述为以深刻洞见引导的慈悲。"},{"en":"The teacher used the term Buddhic to point to an awakened quality of mind rather than ordinary intelligence.","zh":"老师用“Buddhic”来指一种觉醒的心灵品质，而不是一般的聪明。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Often in Theosophy and related spiritual writings) Referring to a “buddhic plane” or “buddhi,” a level of consciousness associated with intuition and spiritual understanding.","zh":"（常见于通神论等灵修写作）指“buddhic 层面/界”或“buddhi（觉性）”，一种与直觉和灵性理解相关的意识层次。"},"examples":[{"en":"The book claims that Buddhic awareness is beyond everyday emotion and thought.","zh":"这本书声称“Buddhic 觉知”超越日常情绪与思维。"},{"en":"In Theosophical terms, the Buddhic plane is linked to intuitive knowledge.","zh":"在通神论术语中，“Buddhic 层面”与直觉性的认知相关。"}]}],"synonyms":["enlightened","spiritual","transcendent","Buddha-like"],"phonetic":"/ˈbuːdɪk/","extraExplanation":["“Buddhic”在现代英语里不算常用词，更多见于宗教学术、翻译语境，或通神论（Theosophy）等新兴灵修传统。日常英语里更常见的是“Buddhist（佛教的）”“Buddha（佛陀）”“enlightened（开悟的）”。","词形来源：Buddha（佛陀）+ -ic（形容词后缀，表示“……的/与……有关的”）。不要与“Buddhistic（佛教的；带佛教色彩的）”混淆；“Buddhistic”更偏“佛教风格/佛教化”，而“Buddhic”更偏“觉悟/佛智层面”。"]}
{"word":"buddhic","summary":{"en":"Buddhic means “related to buddhi (spiritual intellect/intuition),” mainly used in Theosophy and some Indian-philosophy contexts; it is only rarely used to mean “Buddhist.”","zh":"buddhic 主要指与 buddhi（灵性智慧/直觉心智）相关，多见于通神论或印度哲学语境；偶尔也被用作“佛教的”，但一般更常用 Buddhist。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the spiritual intellect or higher consciousness (buddhi), especially in Hindu philosophy and Theosophy.","zh":"与“buddhi（灵性智慧/高层心智）”相关的，尤指在印度哲学或通神论体系中所说的更高层次的意识与直觉智慧。"},"examples":[{"en":"In Theosophy, the buddhic level is described as a stage of intuitive wisdom.","zh":"在通神论中，“buddhic（佛智/灵性智慧）层面”被描述为直觉智慧的阶段。"},{"en":"Meditation was said to awaken buddhic insight rather than ordinary reasoning.","zh":"有人认为冥想能唤起 buddhic 的洞见，而不是普通的推理能力。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Related to Buddhism or to the Buddha; often replaced by “Buddhist.”","zh":"（较少见）与佛教或佛陀有关；通常用 “Buddhist（佛教的）” 更自然。"},"examples":[{"en":"The author used buddhic imagery, though “Buddhist imagery” would be more standard.","zh":"作者使用了 buddhic 意象，不过更常见的说法是 “Buddhist imagery（佛教意象）”。"}]}],"synonyms":["spiritual","intuitive","transcendent","Buddhist (in the religion sense)"],"phonetic":"/ˈbʊdɪk/","extraExplanation":["“Buddhic”源自梵语 *buddhi*（ बुद्धि ），常译为“觉知、智慧、灵智”。在通神论（Theosophy）等近现代灵修体系里，它常被用来指一种高于理性分析的“直觉智慧”层面，因此和日常英语里的“Buddhist（佛教的）”不完全等同。","在一般学术或新闻英语中，如果你想表达“佛教的/属于佛教”，通常优先用 **Buddhist**；“buddhic”更像是特定哲学/灵修语境下的术语。"]}
{"word":"Buddhism","summary":{"en":"Buddhism is a religion and philosophy based on the Buddha’s teachings, focusing on reducing suffering through ethical living, meditation, and wisdom.","zh":"佛教是一种以佛陀教导为基础的宗教与哲学，强调通过持戒行善、禅修与智慧来减少痛苦。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a major religion and philosophy that began in India and teaches a path to reduce suffering through understanding, ethical living, meditation, and wisdom (often linked with the teachings of the Buddha)","zh":"佛教：起源于印度的重要宗教与思想体系，强调通过理解、持戒行善、禅修与智慧来减轻痛苦（通常与佛陀的教导相关）"},"examples":[{"en":"Buddhism teaches that understanding desire and attachment can help reduce suffering.","zh":"佛教认为，理解欲望与执著能帮助减少痛苦。"},{"en":"She started practicing meditation after reading about Buddhism.","zh":"她在阅读佛教相关内容后开始练习冥想。"},{"en":"Many temples in Asia are connected with Buddhism.","zh":"亚洲许多寺庙与佛教有关。"}]}],"synonyms":["the Buddhist religion"],"phonetic":"/ˈbuːdɪzəm/","extraExplanation":["“Buddhism”来自“Buddha（佛陀）+ -ism（主义/学说）”。“Buddha”在梵语/巴利语中意为“觉悟者”。","现代英语里常把Buddhism分为Theravada（上座部）、Mahayana（大乘）和Vajrayana（金刚乘/藏传）等传统；不同地区的仪式与文化表现差异很大，但核心主题常围绕“苦与解脱”。","常见相关词：meditation（冥想/禅修）、karma（业/因果）、nirvana（涅槃）、mindfulness（正念）。在英语语境中，这些词有时也被用于日常生活或心理健康话题中。"]}
{"word":"buddhism","summary":{"en":"Buddhism is a major religion and philosophy based on the Buddha’s teachings, emphasizing ending suffering through wisdom, ethics, and meditation.","zh":"佛教是以佛陀教导为基础的重要宗教与思想传统，强调以智慧、戒行与禅修来止息痛苦。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a major religion and philosophy that began in ancient India, based on the teachings of the Buddha, focusing on ending suffering through wisdom, ethical living, and mental training (such as meditation).","zh":"佛教：起源于古代印度的重要宗教与思想传统，以佛陀的教导为基础，强调通过智慧、戒行与心性修习（如禅修/冥想）来止息痛苦。"},"examples":[{"en":"Buddhism teaches that understanding suffering is the first step toward reducing it.","zh":"佛教认为，理解痛苦是减少痛苦的第一步。"},{"en":"She began studying Buddhism and started meditating every morning.","zh":"她开始学习佛教，并每天早晨打坐/冥想。"},{"en":"Buddhism spread from India to many parts of Asia over centuries.","zh":"几个世纪以来，佛教从印度传播到亚洲许多地区。"}]}],"synonyms":["the Buddhist religion"],"phonetic":"/ˈbuːdɪzəm/","extraExplanation":["“Buddhism”来自“Buddha”（佛陀，意为“觉悟者/觉醒者”）加上“-ism”（表示学说、主义）。英文里宗教名称通常大写：Buddhism。","常见相关词：Buddhist（n./adj. 佛教徒；佛教的），temple（寺庙），monk（僧人），nun（尼师），meditation（冥想/禅修）。","文化常识：佛教有多种传统与流派（如Theravada、Mahayana、Vajrayana），不同地区的仪式与用语可能不同，但核心主题常与慈悲、智慧、修行相关。"]}
{"word":"Buddhism-related","summary":{"en":"“Buddhism-related” means connected with or about Buddhism.","zh":"“Buddhism-related”意为“与佛教有关的；关于佛教的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with, about, or involving Buddhism (its teachings, practices, history, or culture).","zh":"与佛教有关的；关于佛教的；涉及佛教教义、修行、历史或文化的。"},"examples":[{"en":"The museum has a small room for Buddhism-related art from Thailand.","zh":"这家博物馆有一个小展厅，陈列来自泰国的佛教相关艺术品。"},{"en":"She is doing Buddhism-related research on meditation and compassion.","zh":"她正在做与冥想和慈悲有关的佛教研究。"},{"en":"Please avoid making jokes in Buddhism-related spaces like temples.","zh":"在寺庙等与佛教有关的场所，请避免开玩笑。"}]}],"synonyms":["Buddhist","Buddhist-related","Buddhistic (less common)"],"phonetic":"/ˈbʊdɪzəm rɪˌleɪtɪd/","extraExplanation":["“Buddhism-related”是由名词“Buddhism”和形容词“related”构成的复合形容词，常用连字符连接，用来修饰名词（如：Buddhism-related practice / Buddhism-related texts）。","在较正式写作中，也常写作“Buddhist-related”（更强调“佛教徒/佛教传统的”），或直接用“Buddhist”作定语（如：Buddhist art）。选择哪种形式取决于你想强调“宗教体系Buddhism”还是“佛教传统/佛教徒Buddhist”。"]}
{"word":"Buddhisms","summary":{"en":"“Buddhisms” means the different traditions or schools within Buddhism; it’s mainly used in academic contexts to highlight diversity.","zh":"“Buddhisms”指佛教内部的不同传统或宗派，主要用于学术语境以强调多样性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"different forms, schools, or traditions of Buddhism (used especially in academic or comparative discussions)","zh":"（尤用于学术或比较语境）佛教的不同形态／宗派／传统"},"examples":[{"en":"The course compares early Buddhisms in India with later traditions in East Asia.","zh":"这门课比较印度早期的诸种佛教形态与东亚后期的传统。"},{"en":"Scholars sometimes speak of “Buddhisms” to emphasize diversity within the religion.","zh":"学者有时用“Buddhisms（诸种佛教）”来强调这一宗教内部的多样性。"}]},{"partOfSpeech":"n.","definition":{"en":"the plural form of Buddhism (though in everyday English, “Buddhism” is usually treated as uncountable)","zh":"Buddhism 的复数形式（但在日常英语里，Buddhism 通常作不可数名词）"},"examples":[{"en":"Several Buddhisms have developed in response to local cultures and languages.","zh":"若干佛教传统随着不同地方的文化与语言而发展。"}]}],"synonyms":["forms of Buddhism","Buddhist traditions","schools of Buddhism"],"phonetic":"/ˈbʊdɪzəmz/","extraExplanation":["“Buddhisms”在日常对话中不常用，更常见的是不可数名词“Buddhism”（佛教）来泛指这一宗教。用复数时，往往是在强调内部差异，比如Theravada（上座部）、Mahayana（大乘）、Vajrayana（金刚乘）等传统，或不同地区的佛教实践。"]}
{"word":"Buddhist","summary":{"en":"Buddhist means “connected to Buddhism” or “a person who follows Buddhism.”","zh":"Buddhist 意为“佛教的；与佛教有关的”，也可指“佛教徒”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"related to Buddhism (the religion and philosophy based on the teachings of the Buddha)","zh":"与佛教有关的；佛教的（指源自佛陀教导的宗教与思想体系）"},"examples":[{"en":"She studies Buddhist philosophy and meditation.","zh":"她学习佛教哲学和禅修（冥想）。"},{"en":"Buddhist temples are important cultural sites in many Asian countries.","zh":"在许多亚洲国家，佛教寺庙是重要的文化遗址。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who follows Buddhism","zh":"佛教徒；信奉佛教的人"},"examples":[{"en":"He became a Buddhist in college.","zh":"他在大学时成为佛教徒。"},{"en":"Many Buddhists practice mindfulness in daily life.","zh":"许多佛教徒在日常生活中练习正念。"}]}],"synonyms":["follower of Buddhism","Buddhism-related"],"phonetic":"/ˈbuːdɪst/","extraExplanation":["“Buddhist”来自“Buddha”（佛陀）+ “-ist”（表示“……主义者/信奉者”）。拼写上常大写（Buddhist/Buddhism），尤其在指宗教、群体或正式名称时。","注意区分：Buddhist（形容词/名词） vs. Buddhism（名词：佛教）。例如：Buddhist teachings（佛教教义），the spread of Buddhism（佛教的传播）。","文化使用上，“Buddhist”通常是中性、尊重的称呼；谈论宗教实践时可用常见搭配：Buddhist monk（僧侣/和尚）、Buddhist nun（比丘尼/尼姑）、Buddhist meditation（佛教禅修/冥想）。"]}
{"word":"buddhist","summary":{"en":"Buddhist describes Buddhism or its followers; it can also mean a person who practices Buddhism.","zh":"Buddhist 可作形容词，表示“与佛教有关/佛教徒的”；也可作名词，表示“佛教徒”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Buddhism (the religion and philosophy based on the teachings of the Buddha), or belonging to a person who follows Buddhism","zh":"与佛教（以佛陀教导为基础的宗教与思想体系）有关的；佛教徒的"},"examples":[{"en":"She studies Buddhist philosophy and meditation.","zh":"她学习佛教哲学与禅修。"},{"en":"There is a small Buddhist temple near my neighborhood.","zh":"我家附近有一座小佛寺。"},{"en":"He comes from a Buddhist family.","zh":"他来自一个佛教家庭。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who practices Buddhism","zh":"佛教徒；信奉佛教的人"},"examples":[{"en":"Many Buddhists meditate every day.","zh":"许多佛教徒每天都会打坐/冥想。"},{"en":"He is a Buddhist, but he also enjoys learning about other religions.","zh":"他是佛教徒，但也喜欢了解其他宗教。"}]}],"synonyms":["Buddhism-related","Buddhist practitioner"],"phonetic":"/ˈbuːdɪst/","extraExplanation":["“Buddhist”来自“Buddha（佛陀）”，意思是“觉悟者”。在英语里，形容词用法很常见（如 Buddhist temple / Buddhist teachings），名词用法指“佛教徒”。","在跨文化语境中，英语里常把“Buddhist meditation”泛指多种佛教传统中的禅修/修行方式；不同地区（如上座部、汉传、藏传）实践与术语可能不完全相同。"]}
{"word":"Buddhist monk","summary":{"en":"a male Buddhist religious renunciant living under monastic rules","zh":"遵守戒律、出家修行的佛教僧人"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a man who has chosen a religious life in Buddhism, usually living under monastic rules (often in a monastery or temple)","zh":"佛教出家男众；遵守戒律、过僧团生活的僧人"},"examples":[{"en":"A Buddhist monk offered a short blessing before the ceremony.","zh":"一位佛教僧人在仪式开始前做了简短的祝福。"},{"en":"Many Buddhist monks shave their heads as a sign of renunciation.","zh":"许多佛教僧人剃发，以示出离与舍弃。"},{"en":"The traveler stayed near a temple and spoke with a Buddhist monk about meditation.","zh":"那位旅行者住在寺庙附近，并与一位僧人聊了冥想。"}]}],"synonyms":["monk","bhikkhu","lama","monastic"],"phonetic":"/ˈbʊdɪst mʌŋk/","extraExplanation":["在不同佛教传统里，对“僧人”的称呼可能不同：上座部常见 bhikkhu（比丘）；藏传佛教中 lama（喇嘛）常指有资格的上师或僧人；英语里也会用 monk 泛指。","“Buddhist monk”通常指男性；女性一般说 Buddhist nun（佛教尼众/尼姑）。更中性也可说 monastic（出家众）。"],"etymology":"“Buddhist”来自“Buddha（佛陀）”，表示与佛教相关；“monk”源自希腊语 monachos，原意与“独居、隐修”有关，后来指修道者。合起来就是“佛教的僧人”。","mnemonic":["monk 听起来像“蒙克”，联想“蒙克剃光头在寺院修行”→僧人。","Buddhist = Buddha（佛陀）+ -ist（…的人/信奉者），Buddhist monk = 信佛陀教法的僧人。"]}
{"word":"Buddhist sacred land","summary":{"en":"a holy place in Buddhism; sometimes an ideal pure realm described in Buddhist teachings","zh":"佛教中的圣地；有时也指佛教教义中的清净国土（净土）"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a place that Buddhists consider holy, especially a site connected with the Buddha, important temples, or pilgrimage traditions","zh":"佛教中被视为神圣的地方，尤指与佛陀、重要寺院或朝圣传统相关的圣地"},"examples":[{"en":"Many Buddhists travel to sacred lands to visit ancient temples and pay respect.","zh":"许多佛教徒会前往佛教圣地参访古寺并礼敬。"},{"en":"Lumbini is often described as a Buddhist sacred land because it is linked to the Buddha’s birth.","zh":"蓝毗尼常被称为佛教圣地，因为它与佛陀诞生有关。"}]},{"partOfSpeech":"phrase","definition":{"en":"in some contexts, the ideal realm of purity described in Buddhism (often called the Pure Land), where beings can be reborn and practice toward enlightenment","zh":"在某些语境中，指佛教所说的清净国土（常称“净土”），众生可往生并继续修行趋向觉悟的理想世界"},"examples":[{"en":"In Pure Land traditions, people may pray to be reborn in a sacred land of peace and clarity.","zh":"在净土传统中，人们可能祈愿往生到清净安乐的净土。"},{"en":"Some texts describe Amitabha’s realm as a sacred land created to support practice.","zh":"一些经典将阿弥陀佛的世界描述为为修行而成就的清净国土。"}]}],"synonyms":["holy land","sacred ground","sacred site","pilgrimage site","Pure Land"],"phonetic":"/ˈbʊdɪst ˈseɪkrəd lænd/","extraExplanation":["“佛教圣地”在现实地理上常指与释迦牟尼生平相关的朝圣地点（如蓝毗尼、菩提伽耶、鹿野苑、拘尸那罗等），也可泛指重要寺院与修行中心。","“净土/清净国土（Pure Land）”更多是宗教与经典语境中的“理想世界/修行之地”，不一定是地理位置；翻译或写作时要看上下文是“现实圣地”还是“教义概念”。"],"etymology":"由“Buddhist（佛教的）+ sacred（神圣的）+ land（土地/地域）”组合而成，用来概括“佛教圣地”或“神圣国土”的概念；在特定语境下也会与“净土（Pure Land）”的宗教术语相呼应。","mnemonic":["把它拆开记：Buddhist=佛教的，sacred=神圣的，land=地方 → 合起来就是“佛教的神圣之地”。","联想中文固定说法“圣地/净土”：看到 sacred land 就想到“圣地”，遇到经文语境再对应“净土”。"]}
{"word":"Buddhist scripture","summary":{"en":"sacred Buddhist religious text(s)","zh":"佛教经典；佛教圣典"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a sacred text or set of religious writings in Buddhism, such as sutras and other canonical works","zh":"佛教的经典或宗教圣典（如经、律、论等正典文献）"},"examples":[{"en":"The monk recited a Buddhist scripture every morning.","zh":"这位僧人每天早晨都会诵读一部佛教经典。"},{"en":"She is studying Buddhist scriptures in translation.","zh":"她正在阅读佛教经典的译本。"},{"en":"Many Buddhist scriptures were passed down through careful memorization and copying.","zh":"许多佛教经典通过严谨的背诵与抄写得以流传。"}]}],"synonyms":["sutra","Buddhist texts","Buddhist canon","Tripitaka"],"phonetic":"/ˈbʊdɪst ˈskrɪptʃɚ/","extraExplanation":["英语里“Buddhist scripture(s)”既可以说单数（a Buddhist scripture=一部经典），也常用复数（Buddhist scriptures=多部经典/经典总称）。","在佛教语境中，“scripture”常涵盖不同类型文本：sutras（经）、Vinaya（律）、Abhidharma（论）；更宏观的说法还有 “the Buddhist canon”（佛教正典）或 “Tripitaka/Tipitaka”（三藏）。"],"etymology":"“scripture”源自拉丁语 scriptura，意为“书写之物/文字”；搭配“Buddhist”后，泛指佛教传统中的神圣文本与经典文献。英语里常用作集合名词，既可指单部经典，也可指一类经典。若指具体体裁，常见词有 sutra（经）。","mnemonic":["script + -ure：script=“写下来的文字/稿”，想成“写成的东西”→宗教里就成了“圣典”。","把 “scripture” 联想成中文“经典/经文”；看到 Buddhist scripture 就直接对应“佛教经典”。"]}
{"word":"Buddhist scriptures","summary":{"en":"sacred texts of Buddhism","zh":"佛教经典；佛经"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"holy writings (texts) of Buddhism, such as sutras and other canonical works","zh":"佛教的神圣经典（经文），如“经”（sutra）及其他被承认为正典的文献"},"examples":[{"en":"She studies Buddhist scriptures in both Chinese and Sanskrit.","zh":"她用中文和梵文研读佛教经典。"},{"en":"Many Buddhist scriptures were translated into Chinese over many centuries.","zh":"许多佛教经典在数百年间被译成中文。"},{"en":"The museum displays early printed copies of Buddhist scriptures.","zh":"博物馆展出了早期印刷的佛教经典。"}]}],"synonyms":["Buddhist texts","Buddhist canon","sutras","Buddhist sutras","Tripitaka","Dharma texts","sacred texts"],"phonetic":"/ˈbʊdɪst ˈskrɪptʃɚz/","extraExplanation":["英语里“Buddhist scriptures”是比较宽泛的说法，可指不同传统的经典：上座部常见巴利三藏（Tipiṭaka），汉传常说“大藏经”，藏传常说“甘珠尔/丹珠尔”。","“scripture”在英语文化中常与《圣经》这类“权威经典”联想在一起；用于佛教时，一般是中性表达，指被传统重视、用于诵读与学习的经典文本。"],"etymology":"“Buddhist”来自“Buddha（佛陀）”，源于梵语/巴利语词根，意为“觉悟者”；“scripture(s)”来自拉丁语传统，原意为“书写之物、文字”，在英语里常指宗教经典。合起来即“佛教经典/经文”。","mnemonic":["把它记成“Buddhist + scriptures = 佛教 + 经典/经文”：script- 像“script（文字稿）”，-ure 像“东西”，合起来就是“写下来的宗教文字”。","联想中文“佛经”：scripture ≈ 经文（可直接对应记忆）。"]}
{"word":"Buddhist temple","summary":{"en":"a place of Buddhist worship and practice","zh":"佛教礼拜与修行的场所"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a place of worship for Buddhists, where people pray, meditate, and take part in religious ceremonies","zh":"佛教的礼拜场所，人们在这里礼佛、禅修并参加宗教仪式"},"examples":[{"en":"We visited a Buddhist temple and listened to the evening chanting.","zh":"我们参观了一座佛教寺庙，听了晚课诵经。"},{"en":"Please speak quietly inside the Buddhist temple.","zh":"在佛教寺庙里请轻声说话。"},{"en":"Many Buddhist temples offer short meditation sessions for visitors.","zh":"许多佛教寺庙会为访客提供短时间的禅修体验。"}]}],"synonyms":["temple","monastery","pagoda","shrine"],"phonetic":"/ˈbʊdɪst ˈtɛmpəl/","extraExplanation":["英语里“Buddhist temple”是最通用说法；在不同地区也常见更具体的称呼，如“monastery（寺院/僧院）”“pagoda（塔/佛塔，常指带塔形建筑）”“shrine（神社/小型圣祠）”。实际用哪个词取决于建筑类型与当地习惯。","文化礼仪提示：进入寺庙常见做法包括保持安静、衣着得体、拍照前先确认是否允许、不要随意触摸佛像或法器。不同国家/寺庙规定可能不同。"],"etymology":"由“Buddhist（佛教的）+ temple（寺庙/庙宇）”构成；temple 源自拉丁语 templum，原指“神圣的空间/礼拜场所”。","mnemonic":["拆开记：Buddhist = 佛教的；temple = 寺庙。合起来就是“佛教寺庙”。","联想：去寺庙会“听诵经（chanting）+ 打坐（meditate）”，这两件事常出现在 Buddhist temple 的语境里。"]}
{"word":"Buddhistic","summary":{"en":"Buddhistic means ‘related to Buddhism’; it is a less common alternative to ‘Buddhist.’","zh":"Buddhistic 意为“与佛教有关的”，但现代英语中不如 Buddhist 常用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Buddhism or its teachings, practices, and traditions; Buddhist.","zh":"与佛教有关的；佛教的；佛法教义与修行相关的。"},"examples":[{"en":"The museum has a Buddhistic statue from the 8th century.","zh":"这家博物馆收藏着一尊8世纪的佛教雕像。"},{"en":"She became interested in Buddhistic ideas like compassion and mindfulness.","zh":"她开始对慈悲、正念等佛教思想感兴趣。"}]}],"synonyms":["Buddhist","Buddha-related","Buddhism-related"],"phonetic":"/buˈdɪstɪk/","extraExplanation":["“Buddhistic”在现代英语中相对少见，日常表达更常用“Buddhist”（如：Buddhist temple/monk/teachings）。在一些较正式、学术或偏旧式的语境里，作者可能用“Buddhistic”来强调“带有佛教色彩/倾向”。","在跨文化表达中，描述人物或作品时，用“Buddhistic”可能暗示“受佛教影响的风格或精神气质”，但不一定表示当事人正式信奉佛教；如果要表达“信徒/僧人/宗教身份”，通常用“Buddhist”更准确。"]}
{"word":"buddhistic","summary":{"en":"“Buddhistic” means “related to Buddhism,” similar to “Buddhist,” but it’s less common in modern English.","zh":"“Buddhistic”意为“与佛教有关”，与“Buddhist”近义，但在现代英语中不太常用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Buddhism (its teachings, practices, or culture); essentially the same meaning as “Buddhist,” but less common.","zh":"与佛教有关的（教义、修行或文化）；含义基本等同于“Buddhist（佛教的）”，但更不常用。"},"examples":[{"en":"The museum has a small collection of Buddhistic art from Nepal.","zh":"这家博物馆收藏了一小批来自尼泊尔的佛教艺术品。"},{"en":"Her paper compares Buddhistic meditation with modern mindfulness practices.","zh":"她的论文比较了佛教禅修与现代正念练习。"}]}],"synonyms":["Buddhist","Buddhism-related"],"phonetic":"/buˈdɪstɪk/","extraExplanation":["“Buddhistic”在现代英语中相对少见，日常与学术写作里更常用“Buddhist”作形容词（如 Buddhist temple / Buddhist philosophy）。","在较旧或较正式的文本中可能会看到“Buddhistic”，用来强调“具有佛教色彩/风格的”，但大多数情况下用“Buddhist”更自然。"]}
{"word":"Buddhistical","summary":{"en":"“Buddhistical” means “related to Buddhism,” but it’s uncommon; “Buddhist” is usually preferred.","zh":"“Buddhistical”意为“与佛教有关的”，但较少见；一般更常用“Buddhist”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to Buddhism; characteristic of Buddhist teachings, practices, or culture.","zh":"与佛教有关的；具有佛教教义、修行方式或文化特征的。"},"examples":[{"en":"The museum displayed Buddhistical art from different parts of Asia.","zh":"博物馆展出了来自亚洲不同地区的佛教艺术品。"},{"en":"Her paper explores Buddhistical ideas about compassion and suffering.","zh":"她的论文探讨了佛教关于慈悲与苦的思想。"}]}],"synonyms":["Buddhist","Buddhistic","Buddhism-related"],"phonetic":"/buˈdɪstɪkəl/","extraExplanation":["“Buddhistical”在现代英语里比较少见；更常用、更自然的形容词是“Buddhist”（如 Buddhist temple / Buddhist philosophy）或“Buddhistic”（较书面，用来强调“带有佛教色彩/风格”）。","拼写与构词：Buddha（佛陀）→ Buddhism（佛教）→ Buddhist（佛教的/佛教徒）→ Buddhistical（佛教的；带佛教特征的，较少用）。写作时若不确定，优先选用“Buddhist”。"]}
{"word":"buddhistical","summary":{"en":"“Buddhistical” means “related to Buddhism,” but it is uncommon; “Buddhist” is usually preferred.","zh":"“buddhistical”意为“与佛教有关的”，但用得较少；通常更推荐用“Buddhist”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Buddhism (its teachings, practices, culture, or followers).","zh":"与佛教有关的；佛教的（指其教义、修行、文化或信众）。"},"examples":[{"en":"The museum has a Buddhistical section with statues and manuscripts.","zh":"博物馆里有一个佛教相关的展区，展出佛像和手抄本。"},{"en":"He wrote a paper comparing Buddhistical ideas of compassion with other traditions.","zh":"他写了一篇论文，把佛教的慈悲观与其他传统作比较。"}]}],"synonyms":["Buddhist","Buddhistic","Buddhism-related"],"phonetic":"/buˈdɪstɪkəl/","extraExplanation":["“buddhistical”较少见；现代英语里更常用、更自然的是 **Buddhist**（最常见）或 **Buddhistic**。在学术写作中也常直接用 **Buddhist** 作形容词，如 “Buddhist art/temple/teachings”。","注意大写：说宗教或传统时通常写 **Buddhist/Buddhism**（首字母大写）；泛指风格或特征时有时会小写，但多数情况下仍保持大写更稳妥。"]}
{"word":"Buddhistically","summary":{"en":"“Buddhistically” means “in a Buddhist way” or “from a Buddhist perspective.”","zh":"“Buddhistically”表示“以佛教的方式”或“从佛教的角度来看”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a Buddhist way; according to Buddhist teachings, values, or practices.","zh":"以佛教的方式；按照佛教的教义、价值观或修行方法。"},"examples":[{"en":"She tried to respond Buddhistically, with calm and compassion instead of anger.","zh":"她尽量以佛教的方式回应，用平静与慈悲而不是愤怒。"},{"en":"Buddhistically speaking, attachment is a major source of suffering.","zh":"从佛教的角度来说，执着是痛苦的重要来源。"}]},{"partOfSpeech":"adv.","definition":{"en":"From the viewpoint of Buddhism; in terms of Buddhist philosophy or doctrine.","zh":"从佛教立场出发；就佛教哲学或教义而言。"},"examples":[{"en":"The question is difficult politically, but Buddhistically it’s about intention.","zh":"这个问题在政治上很棘手，但从佛教角度看关键在于动机。"},{"en":"Buddhistically, the self is not fixed or permanent.","zh":"从佛教观点看，“自我”并非固定或永恒。"}]}],"synonyms":["from a Buddhist perspective","in Buddhist terms","according to Buddhist teachings","in a Buddhist way"],"phonetic":"/ˈbuːdɪstɪkli/","extraExplanation":["“Buddhistically”在日常英语里比较少见，更常见的表达是“from a Buddhist perspective / in Buddhist terms / according to Buddhist teachings”。写作或学术语境中使用会更自然。","构词上是Buddhist（佛教徒/佛教的）+ -ically（表示“以……方式、就……而言”的副词后缀），语气偏正式。"]}
{"word":"buddhists","summary":{"en":"“Buddhists” means people who follow Buddhism.","zh":"“buddhists”指“佛教徒”，即信奉佛教的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who follows Buddhism (a religion and philosophy based on the teachings of the Buddha).","zh":"佛教徒；信奉佛教的人（佛教是一种基于释迦牟尼教导的宗教与思想体系）。"},"examples":[{"en":"Many Buddhists meditate every day to calm the mind.","zh":"许多佛教徒每天都会禅修/冥想来让心安定。"},{"en":"She was raised as a Buddhist but also studied other religions.","zh":"她从小在佛教环境中长大，但也学习了其他宗教。"},{"en":"In some countries, Buddhists celebrate Vesak to honor the Buddha’s life.","zh":"在一些国家，佛教徒会庆祝卫塞节（佛诞节）来纪念佛陀的一生。"}]}],"synonyms":["followers of Buddhism","Buddhist believers"],"phonetic":"/ˈbuːdɪsts/","extraExplanation":["“Buddhist”既可以做名词（a Buddhist/ Buddhists），也可以做形容词（Buddhist teachings 佛教教义；Buddhist temple 佛寺）。本词条里你的输入“buddhists”是复数名词。","注意大小写：谈宗教身份时常写作Buddhist/Buddhists；泛指或作形容词时也常大写，尤其在正式写作中。"]}
{"word":"Buddhological","summary":{"en":"Buddhological means “connected to the academic study of Buddhism (Buddhology).”","zh":"Buddhological 指“与佛教学/佛教研究这一学术研究相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Buddhology: the academic study of Buddhism, especially its history, languages, texts, doctrines, and cultural development.","zh":"与“佛教学/佛教研究（Buddhology）”相关的；指对佛教（尤其是其历史、语言、经典、教义与文化发展）进行的学术研究。"},"examples":[{"en":"She is writing a Buddhological study of early Mahāyāna scriptures.","zh":"她正在撰写一篇关于早期大乘经典的佛教学研究。"},{"en":"The conference included Buddhological panels on Sanskrit manuscripts and Chinese translations.","zh":"会议设置了佛教学专题讨论，内容涉及梵文手稿与中文译本。"}]}],"synonyms":["Buddhology-related","Buddhist studies (as an adjective phrase)","scholarly Buddhist"],"phonetic":"/ˌbuːdəˈlɑːdʒɪkəl/","extraExplanation":["“Buddhological”常见于学术语境（大学课程、论文、书评、研究会议），日常英语中不太常用。","“Buddhology”通常指研究佛教的学科视角（文本、思想史、语文学、考古与艺术史等），与个人信仰或修行实践（如“Buddhist practice”）有所区分，但两者也可能在研究中交叉。","词形：Buddha + -logy（学科/研究）→ Buddhology；加形容词后缀 -ical 形成 Buddhological。"]}
{"word":"Buddhology","summary":{"en":"Buddhology is the academic study of Buddhism.","zh":"Buddhology 指对佛教进行的学术研究。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the academic study of Buddhism, including its history, texts, languages, practices, and philosophies","zh":"佛教学；佛教研究（对佛教的历史、经典、语言、修行与思想等进行学术研究的领域）"},"examples":[{"en":"She majored in Buddhology and focused on early Buddhist texts.","zh":"她主修佛教学，研究方向是早期佛教经典。"},{"en":"The university’s Buddhology program includes Sanskrit and Pali courses.","zh":"这所大学的佛教学项目包含梵语和巴利语课程。"}]}],"synonyms":["Buddhist studies","Buddhist scholarship"],"phonetic":"/buˈdɑlədʒi/","extraExplanation":["“Buddhology”多用于学术语境，强调对佛教进行系统的研究；在英语里也常见更通用的说法“Buddhist studies（佛教研究）”。","构词上由“Buddha（佛陀）+ -logy（学科/研究）”组成，类似于“biology（生物学）”“theology（神学）”。","在实际写作中，若谈的是大学学科或研究领域，用“Buddhology / Buddhist studies”；若谈个人的信仰或修行，更常用“Buddhism（佛教）”而不是“Buddhology”。"]}
{"word":"buddhology","summary":{"en":"Buddhology means the scholarly study of Buddhism.","zh":"buddhology 指对佛教进行学术研究的学科/领域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the academic study of Buddhism—its history, texts, doctrines, languages, art, and practices (often within religious studies or Asian studies)","zh":"佛教学；佛教研究（对佛教的历史、经典、教义、语言、艺术与修行等进行学术研究的领域）"},"examples":[{"en":"She is writing a dissertation in Buddhology on early Mahāyāna texts.","zh":"她正在撰写一篇佛教学（佛教研究）方向的博士论文，研究早期大乘经典。"},{"en":"The department offers courses in Buddhology and other Asian religions.","zh":"该系开设佛教学以及其他亚洲宗教的课程。"}]}],"synonyms":["Buddhist studies","the study of Buddhism"],"phonetic":"/buːˈdɑːlədʒi/","extraExplanation":["“Buddhology”常用于学术语境，强调以研究方法（如文献校勘、历史分析、语言学等）来探讨佛教，而不一定表示个人的宗教信仰或修行立场。","词形来源：Buddha（佛陀）+ -logy（……学/……研究）。类似构词还有 theology（神学）、philology（语言文献学）。","在中文里常见对应说法有“佛教学”“佛教研究”“佛学研究”。其中“佛学”有时也可指传统义理学习或修学体系，语境不同会略有差别。"]}
{"word":"Buddhology-related","summary":{"en":"“Buddhology-related” means connected with the academic study of Buddhism.","zh":"“Buddhology-related”指与佛教学/佛教研究这一学术领域有关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with Buddhology (the academic study of Buddhism, Buddhist texts, history, and ideas)","zh":"与“佛教学/佛教研究（Buddhology）”（对佛教、佛典、历史与思想的学术研究）有关的"},"examples":[{"en":"She presented a Buddhology-related paper on early Mahayana texts.","zh":"她发表了一篇与佛教学相关的论文，主题是早期大乘佛典。"},{"en":"The library has a special collection of Buddhology-related journals and manuscripts.","zh":"这家图书馆有一批佛教学相关的期刊与手稿特藏。"}]}],"synonyms":["Buddhology-associated","Buddhology-connected","related to Buddhology","Buddhist-studies-related"],"phonetic":"/ˌbuːdəˈlɑːdʒi rɪˈleɪtɪd/","extraExplanation":["“Buddhology”常译为“佛教学”或“佛教研究”，偏学术语境；“Buddhism”则是“佛教”（宗教与文化传统）本身。","“Buddhology-related”是由名词+Buddhology+related构成的复合形容词，常见于论文、课程介绍、馆藏分类等正式场合；口语里也可说“related to Buddhology / related to Buddhist studies”。","相关学术领域常与“Buddhist studies（佛教研究）”“Indology（印度学）”“Sinology（汉学）”“Tibetan studies（藏学）”等并列出现。"]}
{"word":"Buddie","summary":{"en":"“Buddie” usually means “buddy”: an informal word for a friend or a partner.","zh":"“Buddie”通常指“buddy”：非正式用语，表示朋友或搭档。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Informal) A friend; someone you like and feel comfortable with.","zh":"（非正式）朋友；哥们儿；你喜欢并相处自在的人。"},"examples":[{"en":"Hey, buddy, how’s it going?","zh":"嗨，哥们儿，最近怎么样？"},{"en":"She’s been my buddy since middle school.","zh":"她从初中起就是我的好朋友。"}]},{"partOfSpeech":"n.","definition":{"en":"A partner you do something with (work, sports, travel, etc.).","zh":"搭档；一起做某事的人（工作、运动、旅行等）。"},"examples":[{"en":"I need a study buddy for this class.","zh":"这门课我需要一个学习搭档。"},{"en":"He’s my gym buddy on weekends.","zh":"他是我周末一起健身的搭档。"}]}],"synonyms":["friend","pal","mate","partner","companion"],"phonetic":"/ˈbʌdi/","extraExplanation":["“Buddie”更常见是“buddy”的拼写变体或误拼。标准拼写是 **buddy**。","“buddy”语气很口语、亲切，适合朋友之间；对陌生人用有时也表示友好，但在某些语境里可能显得过于随便或带一点不耐烦（如：*Listen, buddy…* 表示“喂，你听我说”）。","常见搭配：**buddy up**（结伴/两人一组），**buddy system**（伙伴制度：两人互相照应，常见于露营、潜水、学校活动等）。"]}
{"word":"buddie","summary":{"en":"“Buddie” is usually a misspelling of “buddy,” meaning a friend or an informal way to address someone.","zh":"“buddie”通常是“buddy”的误拼，意思是“朋友”，也可作对人的非正式称呼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A close friend; a pal.","zh":"（非正式）朋友；好哥们儿。"},"examples":[{"en":"He’s my buddy from college.","zh":"他是我大学时期的朋友。"},{"en":"I met a new buddy at the gym.","zh":"我在健身房认识了一个新朋友。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) A friendly way to address someone, sometimes used to sound casual or to show mild annoyance depending on tone.","zh":"（非正式）对某人的称呼“哥们/朋友”；语气可友好，也可能带点不耐烦（取决于语气）。"},"examples":[{"en":"Hey buddy, do you know what time it is?","zh":"嘿，朋友，你知道现在几点吗？"},{"en":"Listen, buddy, that’s not your seat.","zh":"听着，哥们儿，那不是你的座位。"}]}],"synonyms":["friend","pal","mate","buddy"],"phonetic":"/ˈbʌdi/","extraExplanation":["“buddie”通常是“buddy”的拼写错误。标准拼写是 buddy，复数是 buddies。","“buddy”很口语，适合朋友之间或轻松场合；对陌生人使用时要注意语气和场合（有时会显得唐突或带挑衅）。"]}
{"word":"buddied","summary":{"en":"“Buddied” is the past form of “buddy,” meaning became friends with someone or paired up as partners (often “buddy up”).","zh":"“buddied”是“buddy”的过去式/过去分词，常指与某人成为朋友或结成搭档（常用“buddy up”）。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(past tense/past participle of “buddy”) to become friendly with someone; to team up or pair up with someone (often in “buddy up”).","zh":"（“buddy”的过去式/过去分词）与某人变得要好；与某人结成搭档、结伴（常见于“buddy up”）。"},"examples":[{"en":"She buddied with a classmate during the first week of school.","zh":"开学第一周，她就和一位同学成了好朋友。"},{"en":"We buddied up for the hiking trip so no one had to walk alone.","zh":"我们为徒步旅行结成搭档，这样就没人需要独自走。"},{"en":"He buddied with the new employee to help him learn the job.","zh":"他和新员工结成“伙伴”，帮助他熟悉工作。"}]},{"partOfSpeech":"vt.","definition":{"en":"(less common) to make someone your buddy; to assign someone as a partner.","zh":"（较少见）把某人当作伙伴；把某人分配为搭档。"},"examples":[{"en":"The coach buddied the younger players with experienced teammates.","zh":"教练把年纪小的队员与经验丰富的队友配成搭档。"}]}],"synonyms":["befriended","teamed up","paired up","partnered up"],"phonetic":"/ˈbʌdid/","extraExplanation":["“buddy”是非常口语、友好的说法，相当于“朋友/哥们”。“buddy up”常用于学校、军队、培训、户外活动中的“结对制度（buddy system）”，强调互相照应与安全。","拼写规则：以辅音字母 + y 结尾的动词变过去式时，y 变 i 再加 -ed：buddy → buddied。"]}
{"word":"buddies","summary":{"en":"“Buddies” is the plural of “buddy,” meaning friends or paired partners who help each other, in informal English.","zh":"“buddies”是“buddy”的复数，常指（非正式的）朋友/伙伴，或结对互相照应的搭档。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Friends; close companions (informal).","zh":"朋友；伙伴（非正式）"},"examples":[{"en":"We’ve been buddies since middle school.","zh":"我们从初中起就是朋友了。"},{"en":"He and his buddy went hiking on the weekend.","zh":"他和他的伙伴周末去徒步了。"}]},{"partOfSpeech":"n.","definition":{"en":"People who are paired or assigned to help each other (e.g., a “buddy system”).","zh":"互相结对、互相照应的人（如“伙伴制度”）"},"examples":[{"en":"Find a buddy for the lab so you can work safely.","zh":"为实验找一个搭档，这样更安全。"},{"en":"New students are given buddies to help them adjust.","zh":"新生会分配到学长学姐伙伴，帮助他们适应。"}]}],"synonyms":["friends","pals","mates","companions"],"phonetic":"/ˈbʌdiz/","extraExplanation":["“buddy”很口语，语气通常比“friend”更随意、亲近；也常用来称呼不太熟的人（带一点友好感），比如在美式英语里对陌生人说“Hey, buddy.” 但在某些语境也可能带不耐烦或挑衅，语气要注意。","常见搭配：best buddies（死党/好哥们儿），buddy up（结伴），buddy system（伙伴制度，常用于游泳、露营、军队训练等强调安全的场景）。"]}
{"word":"Budding","summary":{"en":"“Budding” most often means “starting to develop” (a budding artist). It can also refer to plants forming new buds in early growth.","zh":"“Budding”最常指“开始发展、初露头角”（如 budding artist）。也可指植物开始长芽/结蕾的过程。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"beginning to develop; starting to show signs of future growth or success","zh":"萌芽的；初露头角的；开始发展并显示出成长或成功迹象的"},"examples":[{"en":"She is a budding writer who publishes short stories online.","zh":"她是一位崭露头角的作家，在网上发表短篇小说。"},{"en":"The city has a budding music scene.","zh":"这座城市正在形成一个新兴的音乐圈。"}]},{"partOfSpeech":"n.","definition":{"en":"the process of forming a bud (a small new growth) on a plant; starting to produce buds","zh":"（植物）长出花蕾/芽的过程；开始抽芽或结蕾"},"examples":[{"en":"In early spring, the trees are budding.","zh":"初春时，树木开始抽芽。"},{"en":"Budding usually happens when the weather gets warmer.","zh":"天气转暖时通常会开始长芽/结蕾。"}]},{"partOfSpeech":"vi.","definition":{"en":"to form buds; to begin to develop","zh":"（植物）长芽/结蕾；（事物）开始发展"},"examples":[{"en":"The roses are budding in the garden.","zh":"花园里的玫瑰正在打花苞。"},{"en":"A friendship was budding between them.","zh":"他们之间的友谊正在萌芽。"}]}],"synonyms":["emerging","up-and-coming","developing","nascent","sprouting"],"phonetic":"/ˈbʌdɪŋ/","extraExplanation":["“budding”常用作比喻，表示“刚开始、有潜力但仍在成长阶段”，语气通常积极（如 budding artist / budding scientist）。","在植物语境里，bud 指“芽/花蕾”。因此 budding 最直观的画面就是“长出新芽”，引申为“新事物的开始”。"]}
{"word":"budding","summary":{"en":"Budding means “starting to develop,” especially with promising potential; it can also describe plants forming buds.","zh":"budding 指“正在萌芽、开始发展（且有前景）”，也可指植物“长出花蕾/发芽”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"beginning to develop; showing early signs of future growth or success","zh":"萌芽中的；初露头角的；正在发展中的"},"examples":[{"en":"She is a budding artist with a lot of potential.","zh":"她是一位初露头角的艺术家，很有潜力。"},{"en":"The club supports budding writers by offering workshops.","zh":"这个社团通过开设工作坊来支持新晋/萌芽中的写作者。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of a plant) forming a new bud; starting to produce flowers or leaves","zh":"（植物）长出花蕾/芽；正在发芽的"},"examples":[{"en":"In early spring, the trees are budding.","zh":"早春时节，树木开始发芽。"},{"en":"We saw budding roses in the garden.","zh":"我们在花园里看到了含苞待放的玫瑰。"}]},{"partOfSpeech":"n.","definition":{"en":"the process of forming buds or starting new growth","zh":"萌芽；发芽（的过程）"},"examples":[{"en":"The budding of the trees is a sign that winter is ending.","zh":"树木的萌芽是冬天将尽的信号。"}]}],"synonyms":["emerging","developing","up-and-coming","nascent","sprouting"],"phonetic":"/ˈbʌdɪŋ/","extraExplanation":["“budding”既可以用于自然界（植物“发芽/含苞”），也常用于比喻（能力、事业、关系“开始发展”）。在英语里它常带有积极色彩，强调“刚起步但很有希望”。","常见搭配：a budding musician/actor/scientist（初露头角的音乐家/演员/科学家）；a budding romance（萌芽中的恋情）。"]}
{"word":"buddings","summary":{"en":"“Budding(s)” refers to something beginning to grow—literally (plants forming buds) or figuratively (a person/idea showing early promise).","zh":"“budding(s)”表示“开始生长”的事物：可以指植物萌芽，也常比喻人或想法刚起步、初露头角。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"beginning to develop; showing promise of growth or success","zh":"开始发展中的；初露头角的；有发展潜力的"},"examples":[{"en":"She is a budding writer with a strong voice.","zh":"她是一位初露头角、很有个人风格的作家。"},{"en":"The city has a budding tech scene.","zh":"这座城市的科技圈正在兴起。"}]},{"partOfSpeech":"n.","definition":{"en":"the process in which a plant forms new buds (or a similar kind of early growth)","zh":"（植物）萌芽、长出花苞/芽的过程；（类似的）初期生长"},"examples":[{"en":"In spring, budding happens quickly after the first warm days.","zh":"春天里，天气一转暖，植物很快就开始萌芽。"},{"en":"The garden is entering its budding stage.","zh":"花园正在进入萌芽期。"}]},{"partOfSpeech":"n.","definition":{"en":"a small bud, especially one that is just starting to open (often used in the plural: buddings)","zh":"（刚开始展开的）嫩芽；花苞（常用复数：buddings）"},"examples":[{"en":"We noticed the buddings on the branches after the rain.","zh":"雨后，我们注意到枝头冒出了嫩芽。"}]}],"synonyms":["developing","emerging","up-and-coming","promising","sprouting"],"phonetic":"ˈbʌdɪŋ","extraExplanation":["“budding”常用作比喻，形容人或事物“刚起步但很有潜力”，例如：a budding musician（崭露头角的音乐人）。这种用法强调“还在早期阶段”，语气通常积极。","词源与“bud（芽）”有关：植物长出“芽”→引申为才能、事业、潮流等开始显现。"]}
{"word":"buddle","summary":{"en":"A mining tool (and verb) for washing crushed ore so heavier minerals can be separated.","zh":"一种（及其动词用法）采矿设备，用于淘洗碎矿石以分离较重矿物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a shallow trough or sloping box used in mining to wash crushed ore (especially tin) so that heavier minerals separate from lighter waste","zh":"（采矿中）洗矿槽；淘洗矿石的浅槽/斜槽（尤指用于分离锡矿等较重矿物与废石）"},"examples":[{"en":"In the old mine, workers used a buddle to separate heavy ore from sand and mud.","zh":"在那座老矿山里，工人用洗矿槽把较重的矿石与沙泥分开。"},{"en":"The museum displays a wooden buddle from a 19th‑century tin mine.","zh":"博物馆展出了一件19世纪锡矿使用过的木制洗矿槽。"}]},{"partOfSpeech":"v.","definition":{"en":"to wash or separate ore using a buddle","zh":"用洗矿槽淘洗（矿石）；用洗矿槽分离矿物"},"examples":[{"en":"They buddled the crushed rock to recover the heavier minerals.","zh":"他们把碎矿石放进洗矿槽淘洗，以回收较重的矿物。"}]}],"synonyms":["ore washer","washing trough","sluice"],"phonetic":"/ˈbʌdəl/","extraExplanation":["“buddle”是比较少见的采矿术语，常见于历史矿业（如英国锡矿）相关的文章、博物馆说明或旧技术记录里。现代工业更多会用更通用的说法，如“ore washing / mineral separation”。"]}
{"word":"buddled","summary":{"en":"“Buddled” is a rare past form of “buddle,” meaning to wash and separate ore in mining.","zh":"“buddled”是罕见的“buddle”的过去式，指在采矿中淘洗并分离矿石。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense and past participle of buddle (a rare verb): to wash and separate crushed ore (especially tin ore) using a sloping tray or pit so the heavier mineral settles.","zh":"buddle 的过去式/过去分词（罕见动词）：用“buddle”（一种倾斜的槽/池）淘洗并分离碎矿石（尤指锡矿），让较重的矿物沉淀下来。"},"examples":[{"en":"The miners buddled the crushed ore to concentrate the tin.","zh":"矿工们淘洗碎矿石来富集锡。"},{"en":"After the ore was buddled, the heavier particles were collected.","zh":"矿石淘洗后，较重的颗粒被收集起来。"}]}],"synonyms":["washed (ore)","concentrated (ore)"],"phonetic":"ˈbʌd(ə)ld","extraExplanation":["“buddled”在现代英语里非常少见，主要出现在矿业/历史文本中。日常写作里更常见的是拼写相近的 **bundled**（bundle 的过去式），意思是“捆起来、打包、（把人）裹紧/裹成一团”。如果你想表达“打包/捆绑”，很可能你要找的是 **bundled**。"]}
{"word":"Buddleia","summary":{"en":"Buddleia is a flowering shrub, often called butterfly bush, known for attracting butterflies.","zh":"Buddleia 指一种开花灌木，常叫“蝴蝶灌木”，因花蜜丰富而吸引蝴蝶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a flowering shrub (also called “butterfly bush”) with long spikes of small, fragrant flowers that attract butterflies","zh":"一种开花灌木（也叫“醉鱼草 / 蝶恋花灌木”，常称“蝴蝶灌木”），花序多为长穗状，小花密集且常带香味，容易吸引蝴蝶"},"examples":[{"en":"We planted buddleia in the garden to attract butterflies in summer.","zh":"我们在花园里种了醉鱼草，想在夏天吸引蝴蝶。"},{"en":"A buddleia bush by the fence was covered in purple flowers.","zh":"篱笆旁的那丛醉鱼草开满了紫色花。"}]}],"synonyms":["butterfly bush"],"phonetic":"/ˈbʌdliə/","extraExplanation":["“Buddleia”常见读音在英语里有两种拼法传统：Buddleia（较学术/植物学）与 Buddleja（较符合拉丁化拼写）。日常园艺里更常叫它“butterfly bush（蝴蝶灌木）”，因为花蜜丰富、很招蝶。","它在不少地区属于外来园艺植物，有些地方会把某些品种视为“可能具入侵性”的植物；是否适合种植常取决于当地生态与法规。"]}
{"word":"buddleia","summary":{"en":"Buddleia is a fragrant flowering shrub, often called butterfly bush, known for attracting butterflies.","zh":"buddleia 指一种芳香开花的灌木，常叫“蝴蝶灌木/醉鱼草”，以吸引蝴蝶闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a flowering shrub (also called “butterfly bush”) with long, fragrant flower spikes that attract butterflies and other pollinators","zh":"一种开花灌木（也叫“醉鱼草”或“蝶恋花/蝴蝶灌木”），花序细长且芳香，常吸引蝴蝶等传粉昆虫"},"examples":[{"en":"We planted buddleia by the fence to attract butterflies.","zh":"我们在篱笆旁种了醉鱼草来吸引蝴蝶。"},{"en":"In late summer, the buddleia is covered in purple flower spikes.","zh":"在夏末，醉鱼草会开满紫色的穗状花。"}]}],"synonyms":["butterfly bush","summer lilac"],"phonetic":"/ˈbʌdliə/","extraExplanation":["“buddleia”来自英国植物学家 Adam Buddle（亚当·巴德尔）的姓氏；常见拼写也有“Buddleja”（更偏学名/植物学写法）。","在一些地区，buddleia 生长很快、易自播，可能被视为入侵植物；如果你在户外种植，最好了解当地的园艺建议与生态规定。"]}
{"word":"buddleias","summary":{"en":"“Buddleias” means more than one buddleia (butterfly bush), a flowering shrub that attracts butterflies.","zh":"“Buddleias”指多株 b u d d l e i a（蝴蝶灌木），一种会吸引蝴蝶的开花灌木。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of buddleia: a flowering shrub (also called “butterfly bush”) known for long clusters of small flowers that attract butterflies.","zh":"buddleia 的复数：一种开花灌木（也叫“butterfly bush / 蝴蝶花灌木”），以成串的小花著称，常吸引蝴蝶。"},"examples":[{"en":"The garden is full of buddleias that attract butterflies in late summer.","zh":"花园里种满了 b u d d l e i a（复数 buddleias），在夏末会吸引很多蝴蝶。"},{"en":"She planted buddleias along the fence for color and fragrance.","zh":"她沿着篱笆种了几丛 buddleias，用来增加色彩和香味。"}]}],"synonyms":["butterfly bushes","butterfly bush (common name)"],"phonetic":"/ˈbʌdliə/","extraExplanation":["“buddleia”也常写作“buddleja”（植物学中更常见），都指同一类植物。","名称来自17世纪英国植物学家 Adam Buddle；日常英语里常叫“butterfly bush（蝴蝶灌木）”，因为它很能吸引蝴蝶。","在一些地区，buddleia 属的某些品种可能被视为外来入侵植物；园艺种植时可留意当地建议与管理方式。"]}
{"word":"buddleman","summary":{"en":"A buddleman is a historical mining worker who washed and separated ore using a buddle.","zh":"Buddleman 指旧时采矿中使用 buddle 设备淘洗、分离矿砂的工人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a worker who operates a buddle (a sloping device used to wash and separate metal ore from waste material), especially in older mining.","zh":"（旧时采矿中）操作“buddle（淘洗台/选矿溜槽）”来淘洗并分离金属矿砂与废渣的工人；选矿淘洗工。"},"examples":[{"en":"In the 1800s, a buddleman might spend hours washing crushed ore to recover tin or lead.","zh":"在19世纪，buddleman 可能会花好几个小时淘洗碎矿石来回收锡或铅。"},{"en":"The report notes that buddlemen worked near the stream where the ore could be washed.","zh":"报告指出，buddleman 常在靠近溪流的地方工作，便于用水淘洗矿砂。"}]}],"synonyms":["ore washer","buddler"],"phonetic":"/ˈbʌdəlmən/","extraExplanation":["“Buddle”是一种传统选矿设备，多见于英国等地的金属矿业史（如锡矿、铅矿）。它利用水流与坡面让较重的矿物颗粒沉降、较轻的杂质被冲走。随着现代选矿技术发展，这类职业名称在当代英语里较少见，多出现在历史资料或矿业史写作中。"]}
{"word":"buddler","summary":{"en":"“Buddler” is not standard English; it’s usually a misspelling of “butler.” Very rarely, it may be used as a made-up noun meaning “one that buds.”","zh":"“buddler”不是标准英语；通常是把 “butler（管家）”拼错。极少数情况下，它可能被当作自造名词，表示“发芽者/萌发的东西”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard spelling; most often a misspelling of “butler” (a servant in charge of a household’s dining room, wine, and staff, especially in British settings).","zh":"非标准拼写；最常见是把 “butler”（管家；负责餐饮、酒窖与家务人员管理的仆役，常见于英式语境）拼错成 “buddler”。"},"examples":[{"en":"I think you mean “butler,” not “buddler.”","zh":"我觉得你想写的是 “butler”，不是 “buddler”。"},{"en":"In the novel, the butler serves tea and manages the household staff.","zh":"在小说里，管家负责端茶并管理家仆。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare/created word) Someone or something that buds (starts to grow new shoots or develop).","zh":"（罕见/自造词）指“发芽者/萌发的东西”（开始长出新芽或逐渐发展）。"},"examples":[{"en":"In spring, every branch becomes a buddler in the garden.","zh":"春天里，花园的每根枝条都像在“发芽”。"},{"en":"The idea was a buddler—small at first, but growing quickly.","zh":"这个想法起初很小，但很快发展起来。"}]}],"synonyms":["butler","house steward","attendant"],"phonetic":"/ˈbʌdlər/","extraExplanation":["“buddler”不是常见英语词，标准词典里通常查不到。日常写作中，如果你想表达“管家”，请用 butler（/ˈbʌtlər/，注意中间的 t 发音较轻）。","如果你是从某本书、游戏或网名里看到 “buddler”，它也可能是专有名词（人名/品牌/角色名）。这种情况下要结合具体句子才能确定意思。"]}
{"word":"buddles","summary":{"en":"Buddles is the plural of buddle, an uncommon mining term for equipment used to wash and separate ore.","zh":"Buddles 是 buddle 的复数，是较少见的采矿术语，指用于清洗并分离矿石的选矿装置/矿泥槽。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device (or pit) used in mining to wash and separate crushed ore; also, the ore/slurry being processed in it","zh":"（采矿）用于清洗并分离粉碎矿石的装置/矿泥槽；也可指其中正在处理的矿浆/矿泥"},"examples":[{"en":"In the old mine, workers used buddles to separate heavy minerals from lighter waste.","zh":"在老矿场里，工人用矿泥槽把较重的矿物和较轻的废料分开。"},{"en":"The ore was washed and then sent through a series of buddles.","zh":"矿石被清洗后，又通过一系列的选矿槽处理。"}]}],"synonyms":["ore-washing trough","concentrating table"],"phonetic":"/ˈbʌdəlz/","extraExplanation":["“buddles”是名词“buddle”的复数形式，属于较少见的采矿/选矿术语，日常英语里很少用到。","如果你想表达日常含义，你可能是想写：bubbles（气泡）或 buddies（朋友、伙伴）。我也可以帮你对比这三个词的发音和用法。"]}
{"word":"buddling","summary":{"en":"“Buddling” is usually a misspelling of “budding,” meaning ‘starting to develop’ or ‘forming buds.’","zh":"“buddling”通常是把“budding”拼错了，意思是“正在发展/萌芽中”或“（植物）长芽、结苞”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Commonly spelled “budding”) beginning to develop; showing signs of future growth or success.","zh":"（常见拼写为 budding）开始发展、萌芽中的；崭露头角的。"},"examples":[{"en":"She’s a budding writer with a lot of promise.","zh":"她是一位很有潜力、正在崭露头角的作家。"},{"en":"The company is a budding startup in the clean-energy field.","zh":"这家公司是清洁能源领域一间正在起步发展的新创企业。"}]},{"partOfSpeech":"v.","definition":{"en":"(Commonly spelled “budding”) forming buds or starting to grow (the process of a plant producing buds).","zh":"（常见拼写为 budding）（植物）长出花苞/芽；开始发芽、生长。"},"examples":[{"en":"The roses are budding early this year.","zh":"今年玫瑰很早就开始长花苞了。"},{"en":"We saw budding leaves on the trees in early spring.","zh":"早春时我们看到树上长出了嫩芽。"}]}],"synonyms":["developing","emerging","promising","sprouting"],"phonetic":"/ˈbʌdɪŋ/","extraExplanation":["“buddling”在标准英语里非常少见，多数情况下是把“budding（萌芽中的）”拼错了。","“budding”常用来形容人或事物“刚起步、很有潜力”（budding artist/writer/scientist），语气通常是积极的。","如果你原本想表达“和朋友靠近/黏在一起”，英语更常说“buddying up (with someone)”或“snuggling up”，而不是“buddling”。"]}
{"word":"Buddy","summary":{"en":"“Buddy” usually means a close, casual friend, and it can also be used as a familiar form of address.","zh":"“buddy”通常指关系亲近、语气随意的朋友，也可用作对人的熟人式称呼（语气决定友好或不耐烦）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a friend; a person you like and feel comfortable with (often used in a friendly, casual way)","zh":"朋友；哥们儿（常用于轻松、友好的称呼）"},"examples":[{"en":"Jake is my buddy from college.","zh":"杰克是我大学里的哥们儿。"},{"en":"Can you help me, buddy?","zh":"你能帮我一下吗，哥们儿？"}]},{"partOfSpeech":"v.","definition":{"en":"to become friends with someone; to do something together as partners","zh":"和某人成为朋友；结伴做某事"},"examples":[{"en":"The new students quickly buddied up on the first day.","zh":"新同学第一天很快就结成了伙伴。"}]},{"partOfSpeech":"other","definition":{"en":"used when speaking to someone in a familiar way, sometimes friendly and sometimes slightly annoyed (depending on tone)","zh":"（称呼用语）“哥们儿/老兄”（语气可友好也可带点不耐烦，取决于语调）"},"examples":[{"en":"Buddy, you can’t park here.","zh":"老兄，你不能停在这儿。"},{"en":"Listen, buddy, I’m not trying to argue.","zh":"听着，老兄，我不想吵架。"}]}],"synonyms":["friend","pal","mate","buddy (informal address)"],"phonetic":"/ˈbʌdi/","extraExplanation":["“buddy”在美式英语里很常见，语气通常比“friend”更随意、更亲近，常用于男性朋友之间，但也可用于任何人。","作为称呼时要注意语气：温和时表示亲切；语气硬或带讽刺时可能显得不礼貌，尤其对陌生人。","常见搭配：buddy system（结伴制度/伙伴互助制度，常用于游泳、潜水、露营等活动强调安全）；buddy up（结成伙伴）。"]}
{"word":"buddy","summary":{"en":"“Buddy” usually means a friendly companion or a casual way to address someone; the tone can be warm or, sometimes, annoyed.","zh":"“Buddy”通常指朋友/伙伴，也可作对人的随口称呼；语气可亲切，也可能（视语境）带不耐烦或挑衅。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A friend; a close companion (often casual and friendly).","zh":"朋友；伙伴（语气随意、亲切）。"},"examples":[{"en":"He’s my buddy from high school.","zh":"他是我高中时的好朋友。"},{"en":"I went hiking with a few buddies this weekend.","zh":"我这周末和几个朋友去徒步了。"}]},{"partOfSpeech":"n.","definition":{"en":"A friendly way to address someone, sometimes used to show closeness, and sometimes used with irritation depending on tone.","zh":"对别人的友好称呼；也可能因语气而带点不耐烦或挑衅。"},"examples":[{"en":"Hey buddy, can you help me for a second?","zh":"嘿，哥们儿，能帮我一下吗？"},{"en":"Listen, buddy, that’s not how we do things here.","zh":"听着，老兄，这儿不是这么办事的。（语气可能不太友好）"}]},{"partOfSpeech":"v.","definition":{"en":"To become friends with someone; to pair up or work closely together (less common).","zh":"和某人成为伙伴；结伴/搭档合作（较少见）。"},"examples":[{"en":"New employees are buddied with a mentor for the first month.","zh":"新员工第一个月会被安排与导师结对。"}]}],"synonyms":["friend","pal","mate","companion"],"phonetic":"/ˈbʌdi/","extraExplanation":["“Buddy”在美式英语里很口语、很常见，语感比“friend”更随意、更亲近，类似中文的“哥们儿/朋友/搭子”。但在争执或命令式语境中（如“Listen, buddy…”），可能带有警告或不爽的感觉，主要取决于语气和场合。","常见搭配：buddy system（结伴互助制度/两人一组互相照应），study buddy（学习搭子/学习伙伴），workout buddy（健身搭子）。"]}
{"word":"buddy-buddy","summary":{"en":"“Buddy-buddy” describes acting overly friendly—often in a way that seems strategic or insincere.","zh":"“buddy-buddy”指过分亲热、套近乎，常暗示这种友好是刻意的或不真诚的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal, sometimes disapproving) Overly friendly or too close in a way that seems fake, strategic, or inappropriate.","zh":"（非正式，常含贬义）过分亲热、套近乎；关系好得让人觉得不真诚或别有用心。"},"examples":[{"en":"He got buddy-buddy with the boss right before promotion decisions were made.","zh":"就在决定升职之前，他突然跟老板变得特别“套近乎”。"},{"en":"The reporter stayed professional and didn’t get buddy-buddy with politicians.","zh":"那位记者保持专业，没有和政客们过分亲近。"}]},{"partOfSpeech":"v.","definition":{"en":"To act overly friendly with someone, often to gain an advantage.","zh":"（与某人）装熟、拉关系；用过分友好的方式接近，常为谋取好处。"},"examples":[{"en":"Don’t buddy-buddy the referee—just play the game.","zh":"别去跟裁判套近乎——好好比赛就行。"},{"en":"They tried to buddy-buddy their way into the VIP area.","zh":"他们想靠套近乎混进贵宾区。"}]}],"synonyms":["overfriendly","chummy","pally","thick (with)","cozy (with)"],"phonetic":"/ˈbʌdi ˌbʌdi/","extraExplanation":["“buddy-buddy”是重复词（reduplication），用来加强语气，常带“太亲热、让人起疑”的感觉。","语气通常不如“close friends”中性：说“buddy-buddy”往往暗示这种亲近是刻意的、策略性的，或在当下不合适。","常见搭配：get buddy-buddy with…（和……套近乎）、become buddy-buddy（变得很熟）、buddy up（更中性：结伴/成为搭档）。"]}
{"word":"buddy-like","summary":{"en":"“Buddy-like” means friendly and informal, like a buddy.","zh":"“Buddy-like”表示像朋友/哥们一样友好随和、带点不正式的亲切感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Friendly, informal, and warm in the way a buddy (close friend) would be; like a friend.","zh":"像“哥们/朋友”一样的；友好、随和、亲切的。"},"examples":[{"en":"He has a buddy-like way of talking that puts people at ease.","zh":"他说话很有一种哥们式的随和感，让人放松。"},{"en":"The manager kept a buddy-like tone, even when giving feedback.","zh":"经理即使在给反馈时，也保持一种朋友式的语气。"}]}],"synonyms":["friendly","informal","matey","chummy","buddy-buddy"],"phonetic":"/ˈbʌdiˌlaɪk/","extraExplanation":["“buddy-like”是由“buddy + like”组成的复合形容词，常用连字符强调“像……一样”的感觉。","语气提示：在职场里用“buddy-like”通常表示亲近、好相处，但也可能暗示“不够正式”或“过于熟络”，具体看语境。"]}
{"word":"buddying","summary":{"en":"Buddying means becoming friendly with someone or pairing people as buddies for support and safety.","zh":"Buddying 指和某人变亲近、做朋友，或把人配对成搭档以互相支持与保证安全。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"becoming friendly with someone; spending time together as friends (often: “buddying up”).","zh":"和某人变得亲近、做朋友；一起玩、相处（常用：buddying up）。"},"examples":[{"en":"He’s been buddying up with his new classmates.","zh":"他一直在和新同学打成一片。"},{"en":"Don’t start buddying with people just to get favors.","zh":"别为了占便宜才去跟人套近乎。"}]},{"partOfSpeech":"v.","definition":{"en":"pairing people together as “buddies” for support, safety, or learning (the “buddy system”).","zh":"把人两两配对成为“伙伴/搭档”，用于互相支持、安全或学习（伙伴制度/搭档制度）。"},"examples":[{"en":"The teacher is buddying the new student with a helpful partner.","zh":"老师把新同学和一位乐于助人的同伴配对。"},{"en":"On the hike, we’re buddying everyone so no one walks alone.","zh":"徒步时我们让大家两两结伴，这样没人会单独走。"}]}],"synonyms":["befriending","hanging out (with)","teaming up","pairing up","palling around"],"phonetic":"/ˈbʌdiɪŋ/","extraExplanation":["“buddy”在美式英语里很口语，意思是“朋友/哥们/伙伴”。“buddying (up)”有时带一点“刻意拉关系、套近乎”的感觉，尤其在职场或有利益动机的语境中。","“buddy system（伙伴制度）”常见于学校、新员工培训、军队/户外活动等场景：两人一组互相照应，强调安全与支持。"]}
{"word":"buddyship","summary":{"en":"Buddyship means an informal friendship—the warm relationship between buddies.","zh":"Buddyship 指非正式的友谊，强调“哥们/伙伴”之间亲近的关系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A friendly relationship between buddies; informal friendship or companionship.","zh":"（非正式）“哥们/好友”之间的友谊；伙伴关系。"},"examples":[{"en":"Their buddyship grew stronger after they worked on the project together.","zh":"他们一起做项目后，哥们情谊更深了。"},{"en":"The movie is really about buddyship—two people learning to trust each other.","zh":"这部电影讲的其实是“伙伴情谊”——两个人学会彼此信任。"},{"en":"In our team, we try to build buddyship so new members feel welcome.","zh":"在我们团队里，我们努力建立伙伴情谊，让新成员感到被欢迎。"}]}],"synonyms":["friendship","companionship","camaraderie","mate-ship","bond"],"phonetic":"/ˈbʌdiˌʃɪp/","extraExplanation":["“buddyship”不是非常常见的标准词，更常见的说法是“friendship”（友谊）、“companionship”（陪伴/伙伴关系）或“camaraderie”（战友情/团队情谊）。在口语或写作中用“buddyship”会显得更随意、带点幽默或强调“哥们式”的亲近。","它由“buddy（哥们/伙伴）+ -ship（表示状态/关系的后缀，如 friendship, partnership）”构成；因此语气比“friendship”更轻松，常用于描写“两人搭档”的感觉（例如公路电影、警探搭档故事等）。"]}
{"word":"Bude","summary":{"en":"Bude: a seaside town in Cornwall, England.","zh":"Bude：英国康沃尔郡的一个海滨小镇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a seaside town in Cornwall, England, known for its beaches and coastal scenery (a place name).","zh":"英国英格兰康沃尔郡的一个海滨小镇，以海滩与海岸风光闻名（地名）。"},"examples":[{"en":"We spent a weekend in Bude and walked along the coastal path.","zh":"我们在Bude度过了一个周末，沿着海岸步道散步。"},{"en":"Bude is a popular spot for surfing in southwest England.","zh":"Bude是英格兰西南部很受欢迎的冲浪地点。"}]}],"phonetic":"/bjud/","extraExplanation":["“Bude”是专有名词（地名），日常英语里不会当作普通词汇使用。发音在英式英语里常接近“byood”（类似 /bjuːd/）；不同地区口音可能略有差异。"]}
{"word":"bude","summary":{"en":"Bude is most commonly a proper noun: a seaside town in Cornwall, England.","zh":"Bude 最常见的用法是专有名词：英国康沃尔郡的海滨小镇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a seaside town in Cornwall, southwest England, known for beaches and a canal.","zh":"（专有名词）英国英格兰西南部康沃尔郡的海滨小镇，以海滩和运河闻名。"},"examples":[{"en":"We spent the weekend in Bude and walked along the beach.","zh":"我们周末去了Bude，在海滩边散步。"},{"en":"Bude is a popular stop for travelers exploring Cornwall.","zh":"Bude 是探索康沃尔的旅行者常去的一站。"}]}],"phonetic":"/bjud/","extraExplanation":["“Bude”在英语里通常作为地名使用，首字母大写。它位于英国康沃尔郡北部海岸，旅游业比较发达。","如果你是在其他语境看到“bude”（小写），它也可能来自其他语言（如捷克语里可表示“将会/会是”），但这不属于英语词汇本身。"]}
{"word":"Budennovsk","summary":{"en":"Budennovsk is a town in southern Russia; it is also known internationally due to the 1995 hospital hostage crisis that took place there.","zh":"Budennovsk（布登诺夫斯克）是俄罗斯南部的一座城镇；它也因1995年发生在当地的医院人质危机而为国际社会所知。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A town in Stavropol Krai, southern Russia.","zh":"俄罗斯南部斯塔夫罗波尔边疆区的一座城镇（布登诺夫斯克）。"},"examples":[{"en":"Budennovsk is located in southern Russia.","zh":"布登诺夫斯克位于俄罗斯南部。"},{"en":"The report mentioned a visit to Budennovsk in Stavropol Krai.","zh":"报道提到曾访问斯塔夫罗波尔边疆区的布登诺夫斯克。"}]},{"partOfSpeech":"other","definition":{"en":"A place name often seen in news/history because of the 1995 Budennovsk hospital hostage crisis.","zh":"因“1995年布登诺夫斯克医院人质危机”而常出现在新闻与历史资料中的地名。"},"examples":[{"en":"The documentary covered the 1995 Budennovsk hostage crisis.","zh":"这部纪录片讲述了1995年的布登诺夫斯克人质危机。"}]}],"synonyms":["Budyonnovsk"],"phonetic":"/ˌbuːdɛˈnɑːvsk/","extraExplanation":["英语里“Budennovsk”是俄语地名的转写（transliteration），常见拼写为 Budyonnovsk 或 Budennovsk；不同拼写来自不同的转写体系。","该地名与苏联骑兵将领谢苗·布琼尼（Semyon Budyonny）有关：城镇在苏联时期曾以他的名字命名，因此英文中会出现以 -yonn- / -enn- 等不同方式表现俄语发音的拼写差异。"]}
{"word":"Budenny","summary":{"en":"Budenny usually refers to the Soviet commander Semyon Budyonny; it can also refer to the Budyonny horse breed.","zh":"Budenny 通常指苏联将领谢苗恩·布琼尼；也可指与其相关的布琼尼马（Budyonny）品种。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Semyon (Semen) Budyonny (1883–1973), a Soviet military commander known for leading cavalry forces during the Russian Civil War and later holding high positions in the Red Army.","zh":"谢苗恩·布琼尼（Semyon/Semen Budyonny，1883–1973），苏联军事将领，以在俄国内战中指挥骑兵部队闻名，后来在红军担任高级职务。"},"examples":[{"en":"Budenny became one of the most famous cavalry commanders of the early Soviet period.","zh":"布琼尼成为苏联早期最著名的骑兵指挥官之一。"},{"en":"In some histories of the Russian Civil War, Budenny is mentioned alongside other major Red Army leaders.","zh":"在一些关于俄国内战的历史著作中，布琼尼常与其他红军重要将领一起被提及。"}]},{"partOfSpeech":"n.","definition":{"en":"(also written Budyonny) A breed/type of Russian sport horse developed in the Soviet era, associated with Budyonny’s cavalry traditions.","zh":"（也拼作 Budyonny）一种苏联时期培育的俄罗斯运动马品种/类型，与布琼尼及其骑兵传统相关。"},"examples":[{"en":"The Budenny (Budyonny) horse is often described as athletic and suitable for riding sports.","zh":"布琼尼马（Budyonny）常被形容为体能好，适合骑乘运动。"}]}],"synonyms":["Budyonny","Budyonnyi"],"phonetic":"/buˈdɛn.i/","extraExplanation":["“Budenny”更常见的英文转写是“Budyonny / Budyonnyi”，来源于俄语 фамилия（姓氏）“Будённый”。不同拼写主要是因为不同的转写体系（把俄语字母“ё”写成 yo 或省略成 e）。","在历史与文化语境里，布琼尼常与“骑兵”“苏联早期军事宣传形象”联系在一起；如果你在书里看到“Budenny’s cavalry”，通常指他所领导或代表的骑兵部队传统。"]}
{"word":"Buderus","summary":{"en":"Buderus is a German heating-technology brand, often referring to its boilers or heating systems.","zh":"Buderus（博德鲁斯）是德国供暖技术品牌，常指其锅炉或供暖系统。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a German brand (and former company) best known for heating technology such as boilers, radiators, and HVAC systems; often used to refer to a Buderus boiler/heating system.","zh":"德国的一个品牌（及其前身公司），以供暖技术产品闻名，如锅炉、暖气片和暖通空调系统；日常中也常用来指“博德鲁斯锅炉/供暖系统”。"},"examples":[{"en":"We replaced the old unit with a Buderus boiler to improve efficiency.","zh":"我们把旧设备换成了博德鲁斯锅炉，以提高能效。"},{"en":"The technician said the Buderus system needs a new circulation pump.","zh":"技术人员说这套博德鲁斯供暖系统需要更换新的循环泵。"}]}],"synonyms":["Buderus boiler","Buderus heating system"],"phonetic":"/buˈdɛrʊs/","extraExplanation":["“Buderus”是专有名词，书写通常首字母大写。英语里多在家装、工程、暖通（HVAC）语境中出现。","发音在英语中常被读作近似“boo-DARE-us”（不同地区会有轻微差异）。","品牌历史上与德国工业和供暖设备制造相关；如今常与Bosch（博世）旗下的供暖产品线联系在一起（具体归属会随地区与业务调整而变化）。"]}
{"word":"budesonide","summary":{"en":"Budesonide is an anti-inflammatory corticosteroid medicine used for asthma, allergies (nasal spray), and some IBD conditions.","zh":"布地奈德是一种抗炎的糖皮质激素药物，常用于哮喘、鼻过敏（鼻喷剂）及部分炎症性肠病。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a corticosteroid medicine that reduces inflammation (swelling and irritation), used especially for asthma, nasal allergies, and inflammatory bowel disease (IBD).","zh":"布地奈德：一种糖皮质激素类药物，用于减轻炎症（肿胀与刺激），常用于哮喘、鼻过敏，以及炎症性肠病（IBD）。"},"examples":[{"en":"My doctor prescribed budesonide to help control my asthma symptoms.","zh":"医生给我开了布地奈德来帮助控制哮喘症状。"},{"en":"She uses a budesonide nasal spray during allergy season.","zh":"过敏季她会用布地奈德鼻喷剂。"},{"en":"Budesonide can be used to treat some forms of inflammatory bowel disease.","zh":"布地奈德可用于治疗某些类型的炎症性肠病。"}]}],"synonyms":["corticosteroid","glucocorticoid","Pulmicort"],"phonetic":"/bjuːˈdɛsəˌnaɪd/","extraExplanation":["布地奈德常见剂型包括：吸入剂（哮喘/慢阻肺的长期控制）、鼻喷剂（过敏性鼻炎）、口服缓释胶囊或泡沫/灌肠剂（部分肠道炎症）。不同剂型作用部位不同，不能随意互换。","作为激素类药物之一，它在“局部用药”时（如吸入/鼻喷/肠道局部）全身副作用通常较小，但仍可能出现口腔念珠菌感染（吸入后更常见），通常建议吸入后漱口。","用药与停药应遵医嘱；若正在使用其他激素药物、免疫抑制药，或有感染风险、怀孕哺乳等情况，最好先与医生/药师确认。"]}
{"word":"Budge","summary":{"en":"Budge means to move slightly (often with difficulty) or to change your position/opinion; it’s common in phrases like “won’t budge.”","zh":"budge 表示“（费力地）挪动一点点”或“改变态度/让步”，常见于 won’t budge（怎么也不动/不让步）等表达。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to move a little, usually with difficulty; to shift position slightly","zh":"（通常费力地）挪动一点点；稍微移动"},"examples":[{"en":"The stuck window wouldn’t budge.","zh":"卡住的窗户怎么也推不动。"},{"en":"I pushed the box, but it didn’t budge an inch.","zh":"我推了箱子，但它一寸都没动。"}]},{"partOfSpeech":"vi.","definition":{"en":"to change your opinion or decision, especially after pressure or debate","zh":"（尤指在压力或争论后）改变主意/决定；让步"},"examples":[{"en":"She wouldn’t budge on the price.","zh":"她在价格上寸步不让。"},{"en":"Even after hours of discussion, he refused to budge.","zh":"即使讨论了好几个小时，他还是不肯让步。"}]},{"partOfSpeech":"vt.","definition":{"en":"to move something slightly","zh":"把某物稍微挪动一下"},"examples":[{"en":"Can you budge the chair a little closer to the table?","zh":"你能把椅子往桌子那边挪近一点吗？"}]}],"synonyms":["move","shift","give way","yield","relent"],"phonetic":"/bʌdʒ/","extraExplanation":["最常见的用法是否定句：won’t/didn’t budge，表示“怎么也不动/怎么也不让步”。","常见搭配：budge an inch（一点都不动/不让步）、budge on sth（在某事上让步）、budge up（往旁边挪一挪，给别人腾地方）。"]}
{"word":"budge","summary":{"en":"Budge means to move slightly (or make something move), and it also means to change your position or opinion—often after pressure.","zh":"Budge 指（使）稍微移动；也可指在压力下改变立场或让步，常用于否定表示“纹丝不动”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to move a little, or to make someone/something move a little (often used in negatives to mean “not move at all”)","zh":"（使）稍微移动；（常用于否定）一点也不动"},"examples":[{"en":"The door wouldn’t budge, no matter how hard I pushed.","zh":"不管我怎么用力推，那扇门就是纹丝不动。"},{"en":"I tried to budge the heavy box, but it was too much for me.","zh":"我试着挪动那个沉箱子，但对我来说太重了。"},{"en":"She wouldn’t budge from her decision.","zh":"她对自己的决定寸步不让。"}]},{"partOfSpeech":"v.","definition":{"en":"to change your opinion or position; to give in a little","zh":"改变立场/想法；让步（一点）"},"examples":[{"en":"The manager refused to budge on the price.","zh":"经理在价格上拒不让步。"},{"en":"After long talks, both sides finally budged a little.","zh":"经过长期谈判，双方终于各自让了一点步。"}]}],"synonyms":["move","shift","stir","yield","give in"],"phonetic":"/bʌdʒ/","extraExplanation":["“budge”常和否定搭配（won’t/didn’t budge），语气比“not move”更形象，强调“怎么弄都不动”。","也常用于抽象意义：budge on/from sth（在某事上让步/改变立场）。与“move”相比，“budge”更暗示阻力、僵持或固执。"]}
{"word":"budge-proof","summary":{"en":"Budge-proof means “not able to be moved or changed.”","zh":"Budge-proof 指“无法被移动或改变的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed so it cannot be moved, changed, or influenced; immovable or resistant to change.","zh":"设计成无法移动、无法改变或难以被影响的；稳固不动的／不易改变的。"},"examples":[{"en":"The safe has a budge-proof lock, so you can’t pry it open easily.","zh":"这个保险箱有防撬的锁，所以不容易被撬开。"},{"en":"She kept a budge-proof schedule and refused to add another meeting.","zh":"她的日程安排非常固定，拒绝再加一场会议。"},{"en":"The company’s rules seemed budge-proof, even after many complaints.","zh":"即使有很多投诉，这家公司的规定看起来也丝毫不动摇。"}]}],"synonyms":["immovable","fixed","unyielding","inflexible","unmovable"],"phonetic":"/ˈbʌdʒˌpruːf/","extraExplanation":["“budge-proof”是由动词“budge（挪动；让步）”加上“-proof（防…的；不受…影响的）”构成的复合形容词。常见于口语或营销/说明文字，强调“怎么弄都不动/不改”。","近义表达可根据语境选择：\n- 物理上不动：immovable, fixed, bolted down\n- 态度/决定不改：unyielding, inflexible, set in stone","常见搭配：budge-proof door/lock/safe（防撬/难以移动的门/锁/保险箱）；budge-proof plan/schedule/decision（很难改变的计划/日程/决定）。"]}
{"word":"budged","summary":{"en":"“Budged” means “moved slightly” or (figuratively) “gave way/changed a little,” often used in negatives like “wouldn’t budge.”","zh":"“budged”是“budge”的过去式/过去分词，表示“稍微移动”，也可引申为“略微让步/改变”，常见于“wouldn’t budge（怎么也不动/不让步）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “budge”: moved a little (often used in negatives, meaning “did not move at all”).","zh":"“budge”的过去式/过去分词：稍微移动（常用于否定，表示“完全不动/不让步”）。"},"examples":[{"en":"The door was stuck, and it didn’t budge.","zh":"门卡住了，怎么也不动。"},{"en":"I pushed the box, but it barely budged.","zh":"我推了推箱子，但几乎没动。"},{"en":"She refused to change her mind—she wouldn’t budge.","zh":"她拒绝改变主意——一点也不让步。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative) changed position or opinion slightly; gave way a little.","zh":"（引申）稍微改变立场/观点；略微让步。"},"examples":[{"en":"After long talks, the company finally budged on the price.","zh":"经过长时间谈判，公司终于在价格上让步了。"},{"en":"He budged a little and agreed to meet halfway.","zh":"他稍微让步，同意各退一步。"}]}],"synonyms":["moved","shifted","gave way","yielded","relented"],"phonetic":"/bʌdʒ/","extraExplanation":["“budge”在日常英语里很常出现在否定句：won’t budge / wouldn’t budge，意思是“怎么也不动”或“死活不让步”。具体含义要看语境：物体不动（门、车、箱子），或人不改变想法（立场、决定）。"]}
{"word":"budger","summary":{"en":"“Budger” usually means a budgerigar (a pet parakeet), especially in Australian/UK English.","zh":"“budger”通常指“虎皮鹦鹉”，多见于澳大利亚/英国英语的口语用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a budgerigar; a small, colorful pet parakeet (common in Australia/UK usage)","zh":"虎皮鹦鹉；一种体型小、颜色鲜艳、常见的家养小鹦鹉（多见于澳大利亚/英国用法）"},"examples":[{"en":"My sister has a blue budger that can whistle.","zh":"我妹妹养了一只蓝色的虎皮鹦鹉，它会吹口哨。"},{"en":"They bought a budger and a small cage at the pet shop.","zh":"他们在宠物店买了一只虎皮鹦鹉和一个小笼子。"}]},{"partOfSpeech":"n.","definition":{"en":"someone or something that budges (moves) a little (rare)","zh":"能挪动（或推动）一点的人或事物（较少见）"},"examples":[{"en":"After a long debate, he was finally a budger on the issue.","zh":"经过长时间辩论后，他在这个问题上终于松口（愿意让步）了。"}]}],"synonyms":["budgie","budgerigar","parakeet"],"phonetic":"/ˈbʌdʒər/","extraExplanation":["“budger”更常见的是口语里对“budgerigar（虎皮鹦鹉）”的简称，尤其在澳大利亚和英国英语中常听到。美式英语里更常用“budgie”或直接说“parakeet”。","“budgerigar”一词来自澳大利亚原住民语言（常被认为源自Gamilaraay语），原意大致与“好吃/美味”相关；因此这种鸟和澳大利亚文化联系很深。"]}
{"word":"budgeree","summary":{"en":"Budgeree means “good” or “well” in old-fashioned Australian informal English.","zh":"budgeree 是较旧的澳大利亚非正式用法，意思是“好/不错”或“很好地/顺利地”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Australian English, informal/old-fashioned) Good; fine; satisfactory.","zh":"（澳大利亚英语，非正式/较旧用法）好的；不错的；令人满意的。"},"examples":[{"en":"The weather’s budgeree today—perfect for a picnic.","zh":"今天天气很budgeree——很适合野餐。"},{"en":"Don’t worry, everything will be budgeree.","zh":"别担心，一切都会好的。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Australian English, informal/old-fashioned) Well; in a good or satisfactory way.","zh":"（澳大利亚英语，非正式/较旧用法）很好地；顺利地。"},"examples":[{"en":"The plan worked out budgeree in the end.","zh":"这个计划最终进展得很顺利。"},{"en":"If you follow the steps, it should go budgeree.","zh":"如果你按步骤来，应该会进行得很好。"}]}],"synonyms":["good","fine","OK","all right","well"],"phonetic":"/ˈbʌdʒəɹiː/","extraExplanation":["这个词多见于较早期的澳大利亚口语与书面记录，带一点“殖民地时期/旧澳洲味儿”，现在日常英语里不算常用，更可能在历史材料、地方叙述或为了营造澳洲风格的对话中看到。","常见拼写变体有 **budgery**；两者含义基本相同。","来源通常被认为与早期澳大利亚的皮钦语（特别是与原住民语言接触后的英语变体）有关，用来表示“好/没问题”。"]}
{"word":"budgereegah","summary":{"en":"A budgerigar (budgie) is a small Australian parakeet often kept as a pet.","zh":"budgerigar（budgie）指原产澳大利亚、常见的宠物鸟“虎皮鹦鹉”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly spelled “budgerigar” or “budgie”) a small, brightly colored parakeet originally from Australia, often kept as a pet.","zh":"（常拼作 budgerigar 或 budgie）虎皮鹦鹉：一种原产澳大利亚、色彩鲜艳的小型鹦鹉，常被当作宠物饲养。"},"examples":[{"en":"We bought a budgerigar for my sister, and it learned to mimic a few sounds.","zh":"我们给我妹妹买了一只虎皮鹦鹉，它学会了模仿几个声音。"},{"en":"Budgies are social birds, so they usually do better with attention and interaction.","zh":"虎皮鹦鹉是群居鸟类，所以通常在得到陪伴和互动时会更适应。"}]}],"synonyms":["budgie","parakeet","pet parakeet"],"phonetic":"/ˈbʌdʒərɪˌɡɑr/","extraExplanation":["“budgereegah”不是常见拼写；你可能想查的是 **budgerigar**（正式写法）或 **budgie**（更口语、更常用）。","Budgerigar 这个词来自澳大利亚原住民语言（常见说法指向 Gamilaraay/Yuwaalaraay 一类语言），大意与“好/美味的食物”有关；后来被英语借用来指这种鸟。","在美式英语里，人们更常说 **budgie** 或 **parakeet**；在英式英语里 **budgie** 特别常见。"]}
{"word":"budgerigah","summary":{"en":"“Budgerigah” is likely a misspelling of “budgerigar” (budgie): a small Australian pet parakeet.","zh":"“budgerigah”很可能是“budgerigar”（budgie，虎皮鹦鹉）的误拼：一种常见的澳大利亚宠物小鹦鹉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly spelled “budgerigar”; also called a “budgie”) A small, usually green-and-yellow parakeet from Australia that is often kept as a pet.","zh":"（常拼作 budgerigar，也叫 budgie）一种原产澳大利亚的小型长尾小鹦鹉（常见绿黄配色），常被当作宠物饲养。"},"examples":[{"en":"We bought a budgerigar as a pet for our daughter.","zh":"我们给女儿买了一只虎皮鹦鹉当宠物。"},{"en":"Budgerigars are social birds and often enjoy living in pairs.","zh":"虎皮鹦鹉很合群，通常喜欢成对生活。"},{"en":"The budgie learned to mimic a few simple words.","zh":"这只虎皮鹦鹉学会模仿几个简单的词。"}]}],"synonyms":["budgie","parakeet"],"phonetic":"/ˈbʌdʒərɪˌɡɑr/","extraExplanation":["“budgerigah”看起来是对“budgerigar”的拼写误差；在日常英语里更常用口语名“budgie”。","词源与澳大利亚有关：budgerigar 一词来自澳大利亚原住民语言（常被解释为与“好吃的食物/好吃”相关的含义），后来进入英语。","在不同地区称呼会不同：英式英语里“budgie”非常常见；美式英语里也能用，但有时会更泛称为“parakeet”（长尾小鹦鹉）。"]}
{"word":"budgerigar","summary":{"en":"A budgerigar is a small pet parrot, commonly called a budgie.","zh":"budgerigar 指虎皮鹦鹉，是常见的宠物小鹦鹉（也叫 budgie）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, long-tailed parrot (often kept as a pet) that is usually green and yellow, but can be many colors when bred in captivity; also called a budgie","zh":"一种小型长尾鹦鹉，常被当作宠物饲养；野外常见为黄绿色，但人工繁育后有多种颜色；也叫“虎皮鹦鹉 / budgie”"},"examples":[{"en":"We bought a budgerigar for my sister, and it learned to copy short whistles.","zh":"我们给我妹妹买了一只虎皮鹦鹉，它学会了模仿短口哨声。"},{"en":"Budgerigars are social birds, so they often do better with company and daily interaction.","zh":"虎皮鹦鹉是群居鸟类，所以有同伴和每天互动通常会更适应。"}]}],"synonyms":["budgie","parakeet"],"phonetic":"/ˈbʌdʒəˌrɪɡɑɹ/","extraExplanation":["“Budgerigar”常被简化为“budgie”，在日常英语里“budgie”更常见、更口语；“budgerigar”更正式或在书面语、科普语境中更常出现。","词源来自澳大利亚原住民语言（常解释为与“好的食物/好吃”相关的含义），因为这种鸟原产澳大利亚。"]}
{"word":"budgerigars","summary":{"en":"Budgerigars are small pet parrots, commonly called budgies.","zh":"Budgerigars 指虎皮鹦鹉，一种常见的小型宠物鹦鹉（也叫 budgie）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, colorful parrot (also called a “budgie”) often kept as a pet, originally from Australia.","zh":"一种小型、色彩鲜艳的鹦鹉（也叫“虎皮鹦鹉 / budgie”），常作为宠物饲养，原产澳大利亚。"},"examples":[{"en":"My sister keeps two budgerigars in a large cage by the window.","zh":"我姐姐在窗边的大笼子里养了两只虎皮鹦鹉。"},{"en":"Budgerigars can learn to mimic simple words with patient training.","zh":"虎皮鹦鹉在耐心训练下能学会模仿一些简单的词。"}]}],"synonyms":["budgies","budgie","parakeets (broader term)"],"phonetic":"/ˈbʌdʒəɹɪˌɡɑɹz/","extraExplanation":["“Budgerigar”在日常英语里更常用非正式说法“budgie”，尤其在英式英语中非常普遍；美式英语里也有人用，但在宠物语境中有时会直接说“parakeet（长尾小鹦鹉）”，其中budgerigar是最常见的一种。","词源来自澳大利亚原住民语言（常被解释为“好吃的食物”之类的意思），反映了它的澳洲背景与文化来源。"]}
{"word":"budgero","summary":{"en":"“budgero” is probably a misspelling of “budgerigar/budgie,” meaning a small pet parrot.","zh":"“budgero” 很可能是 “budgerigar/budgie” 的拼写错误，意思是虎皮鹦鹉（常见宠物小鹦鹉）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended) a budgerigar (also called a budgie): a small, colorful parrot often kept as a pet.","zh":"（可能想写）虎皮鹦鹉（也叫 budgie）：一种体型小、颜色鲜艳、常被当作宠物饲养的鹦鹉。"},"examples":[{"en":"My sister keeps a budgerigar in a cage near the window.","zh":"我妹妹在窗边的笼子里养了一只虎皮鹦鹉。"},{"en":"Budgies are social birds, so they often enjoy company.","zh":"虎皮鹦鹉很喜欢社交，所以它们通常喜欢有同伴。"}]}],"synonyms":["budgie","budgerigar","parakeet"],"phonetic":"/ˈbʌdʒi/","extraExplanation":["“budgero” 不是常见英语单词，最接近的常用词是 **budgerigar**（较正式）或 **budgie**（更口语、更常见）。","词源小贴士：**budgerigar** 来自澳大利亚原住民语言（常被认为与 Gamilaraay 相关），后来进入英语；在日常交流中，人们更常说 **budgie**。"]}
{"word":"budgerow","summary":{"en":"“Budgerow” is not standard English; it likely refers to “budgerigar/budgie,” a small pet parrot.","zh":"“budgerow”不是标准英语词；很可能指“budgerigar/budgie”（虎皮鹦鹉），一种常见的宠物小鹦鹉。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it is most likely a misspelling or variant spelling of “budgerigar” (also called a “budgie”), a small pet parrot.","zh":"不是常见词典中的标准英语词；最可能是 “budgerigar”（也叫 “budgie”）的拼写错误或变体，指一种常见的宠物小鹦鹉（虎皮鹦鹉）。"},"examples":[{"en":"I think you may mean “budgerigar” (budgie), a small parrot often kept as a pet.","zh":"我猜你想写的是 “budgerigar”（budgie），一种常被当作宠物饲养的小鹦鹉。"},{"en":"Her budgie learned to whistle a short tune.","zh":"她的虎皮鹦鹉学会了吹一段短短的口哨曲。"}]}],"synonyms":["budgerigar","budgie"],"phonetic":"ˈbʌdʒəˌroʊ","extraExplanation":["“Budgerigar / budgie”源自澳大利亚英语，原词来自澳大利亚原住民语言（常被认为与Gamilaraay有关）。在日常英语中，人们更常说“budgie”。","如果你指的不是虎皮鹦鹉，而是某个地名、人名、品牌名或方言拼写，请告诉我上下文句子，我可以按你的语境准确解释。"]}
{"word":"budgers","summary":{"en":"“Budgers” means budgerigars (budgies)—small pet parakeets.","zh":"“budgers”指虎皮鹦鹉（budgerigar/budgie）的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of budger (short for budgerigar): small, colorful parakeets often kept as pets.","zh":"budger 的复数（budgerigar 的简称）：一种体型小、颜色鲜艳、常被当作宠物饲养的长尾小鹦鹉（虎皮鹦鹉）。"},"examples":[{"en":"They keep two budgers in a cage by the window.","zh":"他们在窗边的笼子里养了两只虎皮鹦鹉。"},{"en":"Budgers can learn to mimic simple sounds and words.","zh":"虎皮鹦鹉能学会模仿一些简单的声音和词。"}]}],"synonyms":["budgies","budgerigars","parakeets"],"phonetic":"/ˈbʌdʒɚz/","extraExplanation":["“budger”多见于英式英语/澳式英语，是“budgerigar”的口语简称；在美式英语里更常说“parakeet”（长尾小鹦鹉，常指宠物店里常见的虎皮鹦鹉）。","“budgerigar”一词源自澳大利亚原住民语言（常被解释为“好吃的食物”之类的意思），因为这种鸟原产澳大利亚。"]}
{"word":"budgerygah","summary":{"en":"Budgerigar = a small pet parrot (budgie), originally from Australia.","zh":"Budgerigar 指一种来自澳大利亚、常见的宠物小鹦鹉（budgie/虎皮鹦鹉）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, colorful Australian parrot often kept as a pet; also called a budgie.","zh":"一种体型小、颜色鲜艳的澳大利亚鹦鹉，常被当作宠物饲养；也叫虎皮鹦鹉/“budgie”（虎皮）。"},"examples":[{"en":"My sister has a budgerigar that can mimic simple words.","zh":"我妹妹养了一只虎皮鹦鹉，会模仿一些简单的词。"},{"en":"Budgerigars are social birds and usually do better with company.","zh":"虎皮鹦鹉是群居鸟类，通常有同伴会更适应。"}]}],"synonyms":["budgie","parakeet"],"phonetic":"/ˈbʌdʒəˌrɪɡər/","extraExplanation":["你输入的“budgerygah”很可能是拼写误差；标准拼写是 **budgerigar**，口语里更常说 **budgie**（英式英语尤其常见）。","“Budgerigar”一词来自澳大利亚原住民语言（常被认为与 Gamilaraay/Yuwaalaraay 等语言有关），后来进入英语，用来指这种常见的宠物鹦鹉。"]}
{"word":"budges","summary":{"en":"“Budges” means “moves slightly” or “changes position/opinion,” but it’s often used in negatives like “won’t budge.”","zh":"“Budges”是“budge”的三单形式，表示“稍微移动”或“改变立场/意见”，但更常见于否定表达如“won’t budge（纹丝不动/不肯让步）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to move a little; to change position, opinion, or decision (often used in negatives)","zh":"稍微移动；改变立场、意见或决定（常用于否定句）"},"examples":[{"en":"The door won’t budge, even when I push hard.","zh":"门怎么推都纹丝不动。"},{"en":"She wouldn’t budge on the price.","zh":"她在价格上不肯让步。"},{"en":"Can you budge over a bit so I can sit down?","zh":"你能挪一挪，让我坐下吗？"}]},{"partOfSpeech":"n.","definition":{"en":"a kind of soft fur (historical usage, especially in British English)","zh":"（旧用法，尤英式）一种软毛皮（毛皮材料）"},"examples":[{"en":"The coat was trimmed with budge.","zh":"这件外套用一种软毛皮做了镶边。"}]}],"synonyms":["move","shift","nudge","yield","give in"],"phonetic":"/bʌdʒ/","extraExplanation":["“budges”是动词“budge”的第三人称单数形式：He/She/It budges。","日常更常见的固定用法是否定式：won’t budge / wouldn’t budge，表示“怎么也不动”或“死活不让步”。","口语里“budge over”很常用，表示“往旁边挪一点（给人让座/让空间）”。"]}
{"word":"Budget","summary":{"en":"A budget is a plan for spending money, the money available for a purpose, and it can also mean low-cost.","zh":"Budget 指支出计划或某项用途的可用资金，也可作形容词表示“经济实惠的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plan for how you will spend money during a certain period of time (and how much you expect to earn)","zh":"（在一段时间内）如何花钱与预计收入的计划；预算"},"examples":[{"en":"I made a monthly budget to control my spending.","zh":"我做了一个月度预算来控制开支。"},{"en":"We need to stick to our budget this semester.","zh":"这学期我们得按预算来花钱。"}]},{"partOfSpeech":"n.","definition":{"en":"the total amount of money available for a particular purpose or organization","zh":"（用于某项用途或机构的）可用资金总额；预算金额"},"examples":[{"en":"The school’s budget was cut this year.","zh":"学校今年的预算被削减了。"},{"en":"This project is over budget.","zh":"这个项目超预算了。"}]},{"partOfSpeech":"v.","definition":{"en":"to plan and control how much money you spend; to set limits on spending","zh":"做预算；规划并控制开支；限定花费"},"examples":[{"en":"If you budget carefully, you can save for a trip.","zh":"如果你认真做预算，就能为旅行存钱。"},{"en":"We budgeted $200 for groceries each week.","zh":"我们每周为买菜预留了200美元的预算。"}]},{"partOfSpeech":"adj.","definition":{"en":"designed to be low-cost; inexpensive","zh":"经济型的；省钱的；低价的"},"examples":[{"en":"They stayed at a budget hotel near the station.","zh":"他们住在车站附近一家经济型酒店。"},{"en":"This is a good budget option for students.","zh":"这对学生来说是个不错的省钱选择。"}]}],"synonyms":["spending plan","financial plan","allocation","allowance","cost limit","economical","inexpensive"],"phonetic":"/ˈbʌdʒɪt/","extraExplanation":["“Budget”源自法语（与“装钱的小袋子”有关），后来引申为“钱袋里的内容”，再发展为“收入与支出的计划”。","常见搭配：on a tight budget（预算紧/手头紧）、under budget（低于预算）、over budget（超预算）、budget-friendly（预算友好/不贵）。"]}
{"word":"budget","summary":{"en":"Budget most commonly means a money plan (or the money available), and it can also mean to plan spending or describe a low-cost option.","zh":"budget 常指“预算/收支计划”或“可用经费”，也可作动词表示“做预算”，作形容词表示“经济型的/低价的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A plan for how much money you will earn, spend, and save over a period of time.","zh":"（一段时间内的）预算；收支计划（规划收入、支出与储蓄）。"},"examples":[{"en":"We made a monthly budget to control our spending.","zh":"我们做了月度预算来控制开销。"},{"en":"The project is over budget, so we need to cut costs.","zh":"项目超出预算了，所以我们需要削减成本。"}]},{"partOfSpeech":"n.","definition":{"en":"The amount of money available to spend for a particular purpose.","zh":"（用于特定用途的）预算金额；经费。"},"examples":[{"en":"Our travel budget is $1,000 for the whole week.","zh":"我们一整周的旅行预算是1000美元。"},{"en":"The school’s budget for new computers was increased.","zh":"学校购买新电脑的经费增加了。"}]},{"partOfSpeech":"v.","definition":{"en":"To plan how you will spend a certain amount of money.","zh":"做预算；为（支出）制定计划。"},"examples":[{"en":"You should budget for rent, food, and transportation first.","zh":"你应该先为房租、食物和交通做预算。"},{"en":"I budget carefully so I can save more each month.","zh":"我仔细做预算，这样每个月能存更多钱。"}]},{"partOfSpeech":"adj.","definition":{"en":"Low-cost; not expensive (often used before a noun).","zh":"低价的；经济实惠的（常作定语）。"},"examples":[{"en":"They chose a budget hotel near the station.","zh":"他们选了车站附近一家经济型酒店。"},{"en":"This is a budget option for students.","zh":"这是适合学生的省钱选择。"}]}],"synonyms":["financial plan","spending plan","funds","allowance","economical"],"phonetic":"/ˈbʌdʒɪt/","extraExplanation":["常见搭配：on a budget（手头紧/按预算行事）、within budget（在预算内）、over budget（超出预算）、tight budget（预算紧张）、budget cut（预算削减）。","词源小知识：budget 源自法语 *bougette*（小袋子/钱袋）。后来引申为“钱袋里的钱”和“财政计划”。","文化语境：在新闻里说 “the federal budget” 通常指政府的年度财政方案（税收与支出计划）；在日常生活里更常指个人/家庭的收支规划。"]}
{"word":"budget activity","summary":{"en":"a low-cost activity or an activity item in a spending plan","zh":"省钱的活动；或预算表中列出的活动项目"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"An activity that costs little money; something you do when you want to spend as little as possible.","zh":"预算内（省钱、低花费）的活动；不怎么花钱的活动。"},"examples":[{"en":"Picnicking in the park is a great budget activity for weekends.","zh":"去公园野餐是周末很棒的省钱活动。"},{"en":"We chose budget activities like free museum days and walking tours.","zh":"我们选择了省钱的活动，比如博物馆免费日和徒步游。"}]},{"partOfSpeech":"phrase","definition":{"en":"A specific activity listed in a budget or spending plan, often with an estimated cost (common in workplaces, schools, and projects).","zh":"预算表/经费计划中列出的某项活动（通常带有预计费用），常见于工作、学校和项目场景。"},"examples":[{"en":"Travel is a separate budget activity with its own estimated cost.","zh":"差旅是一项单独的预算活动，有自己的预计费用。"},{"en":"Please explain why this budget activity went over the limit.","zh":"请说明为什么这项预算活动超支了。"}]}],"synonyms":["budget-friendly activity","low-cost activity","cheap activity","free activity","cost-effective activity","planned activity","budget item"],"phonetic":"/ˈbʌdʒɪt ækˈtɪvɪti/","extraExplanation":["口语里更常说：a budget-friendly activity（更明确是“省钱的活动”）、an activity on a budget（在有限预算下的活动）。","在公司/学校语境中，“budget activity”更像术语，意思接近“预算科目/预算项目中的活动项”。"],"etymology":"“budget”源自法语 bougette（小皮袋），引申为“钱袋/财务计划”；“activity”源自拉丁语 activus（主动的）与 act（行动）。合在一起常用来指“预算中的活动”或“省钱可做的活动”。","mnemonic":["把它拆开记：budget=预算（钱），activity=活动（做的事）→“预算里的活动/不超预算的活动”。","联想中文“预算活动经费”：一听就像“活动+经费”要写进预算表。"]}
{"word":"budget advice","summary":{"en":"guidance on planning and managing spending and saving.","zh":"关于规划开支与储蓄、管理预算的建议。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"guidance or suggestions on how to plan, control, and spend money wisely (often for personal or household finances).","zh":"关于如何规划、控制并合理花钱的建议（常用于个人或家庭理财）。"},"examples":[{"en":"I’m looking for budget advice so I can save more each month.","zh":"我在找预算建议，这样我每个月能多存点钱。"},{"en":"Her budget advice helped me pay off my credit card debt faster.","zh":"她的预算建议帮我更快还清了信用卡债务。"}]},{"partOfSpeech":"phrase","definition":{"en":"professional recommendations about creating and managing a budget for an organization, project, or event.","zh":"为组织、项目或活动制定和管理预算的专业建议。"},"examples":[{"en":"We hired a consultant for budget advice before launching the project.","zh":"项目启动前，我们请了顾问提供预算建议。"},{"en":"The finance team gave budget advice to each department.","zh":"财务团队给各部门提供预算建议。"}]}],"synonyms":["financial advice","money management tips","budgeting tips","spending advice","savings advice","financial guidance"],"phonetic":"/ˈbʌdʒɪt ədˈvaɪs/","extraExplanation":["常见搭配：personal budget advice（个人预算建议）、budget advice for students（学生预算建议）、get/seek budget advice（获取/寻求预算建议）。","在英语里“advice”是不可数名词：说“一条建议”用 a piece of advice，而不是 an advice。"],"etymology":"“budget”源自法语，原意与“装钱的袋子/钱包”有关，后来引申为“财务计划”；“advice”源自古法语与拉丁语词根，意为“看法、劝告”。合起来就是“关于预算的建议”。","mnemonic":["把“budget”联想成“钱要不急（不急花）”，提醒先做计划再消费；“advice”联想“爱德（德）味丝”=有人给你“支招”。","记搭配：budget + advice = 预算 + 建议；看到 advice 就想“不可数”，用 some/a piece of advice。"]}
{"word":"budget air lines","summary":{"en":"low-cost air travel companies with fewer included extras","zh":"提供较少包含服务、以低票价为特点的航空公司"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Low-cost airlines that offer cheaper tickets by keeping services and extras simple (often charging separately for things like checked bags, seat selection, or meals).","zh":"廉价航空（通过减少服务、把行李/选座/餐食等作为额外付费项目来降低票价的航空公司）。"},"examples":[{"en":"Budget airlines often charge extra for checked bags and seat selection.","zh":"廉价航空通常会对托运行李和选座额外收费。"},{"en":"We flew a budget airline to save money, but we packed light to avoid baggage fees.","zh":"我们坐廉价航空省钱，但我们轻装出行以避免行李费。"},{"en":"Budget airlines can be a great option for short flights if you don’t need many extras.","zh":"如果不需要太多额外服务，短途航班选择廉价航空会很划算。"}]}],"synonyms":["low-cost airlines","discount airlines","no-frills airlines","low-cost carriers","cheap flights"],"phonetic":"/ˈbʌdʒɪt ˈɛrˌlaɪnz/","extraExplanation":["常见相关词：low-cost carrier（LCC，低成本航空公司）、ultra-low-cost carrier（ULCC，超低成本航空）。","语境提示：在英式英语中更常说“budget airline(s)”，在美式英语里“low-cost airline(s)”也很常见；两者意思基本相同。","出行小贴士：订票时重点看“总价”（含行李、选座、登机方式等），因为基础票价可能不包含这些。"],"etymology":"“budget”原意是“预算/经费”，引申为“省钱的、低成本的”；“airline(s)”是“航空公司”。“budget airlines”用于指20世纪后期兴起的“低成本航空”商业模式（以更低票价吸引乘客，靠附加收费和高周转率盈利）。","mnemonic":["把budget联想成“预算（预算=要省）”，所以budget airline就是“预算友好/省钱的航空”。","记搭配：budget + 名词（budget hotel 经济型酒店；budget airline 廉价航空）。"]}
{"word":"budget airlines","summary":{"en":"low-fare airlines with extra fees for optional services","zh":"低票价、许多服务需另收费的航空公司"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"airlines that offer low fares by keeping costs down, often charging extra for services like checked bags, seat selection, or meals","zh":"以低票价为主、通过控制成本运营的航空公司；常对托运行李、选座、餐食等服务另收费"},"examples":[{"en":"Budget airlines are often cheaper, but you may pay extra for luggage.","zh":"廉价航空通常更便宜，但行李可能需要额外付费。"},{"en":"We flew a budget airline and brought only a carry-on to save money.","zh":"我们坐了廉价航空，只带随身行李来省钱。"},{"en":"Some budget airlines use smaller airports to reduce costs.","zh":"一些廉价航空会使用较小的机场来降低成本。"}]}],"synonyms":["low-cost airlines","discount airlines","no-frills airlines"],"phonetic":"/ˈbʌdʒɪt ˈerˌlaɪnz/","extraExplanation":["常见搭配：budget airline / low-cost airline / no-frills airline（强调“少附加服务”）。","语用提示：买票前常需要确认是否包含随身行李尺寸、托运行李、选座、改签退票规则等，否则总价可能不如想象便宜。"],"etymology":"“budget”原指“预算、经费”，后来也用作形容词表示“省钱的、低成本的”。与“airlines（航空公司）”搭配后，形成常用短语，指“廉价航空”。","mnemonic":["把 budget 理解成“预算（预算有限）”，预算有限就更可能选择“budget airlines（廉价航空）”。","联想“控成本=砍服务”：票价低，但很多项目要另付费。"]}
{"word":"budget committee","summary":{"en":"a committee that plans and reviews spending and funding","zh":"负责制定与审查支出和资金安排的委员会"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a group of people responsible for discussing, planning, and overseeing an organization’s budget (how money will be collected and spent)","zh":"负责讨论、规划并监督组织预算（资金如何筹集与支出）的一组人员/委员会"},"examples":[{"en":"The budget committee will review each department’s spending request next week.","zh":"预算委员会将于下周审查各部门的支出申请。"},{"en":"She serves on the budget committee and helps decide funding priorities.","zh":"她在预算委员会任职，帮助决定资金优先顺序。"},{"en":"The city council’s budget committee held a public hearing on the proposed budget.","zh":"市议会的预算委员会就拟议预算举行了公开听证会。"}]}],"synonyms":["finance committee","budget panel","appropriations committee","fiscal committee"],"phonetic":"/ˈbʌdʒɪt kəˈmɪti/","extraExplanation":["常见于政府、学校、公司、非营利组织等：该委员会通常负责审阅预算草案、评估支出合理性、提出削减或增加经费建议，并向董事会/议会/管理层提交报告。","在一些机构里它也可能叫“finance committee（财务委员会）”，但后者范围可能更广（不只预算，还包括投资、审计、现金流等）。"],"etymology":"“budget”源自法语，原意与“袋子/钱袋”有关，后来引申为“财务计划”；“committee”源自拉丁语词根，意为“受托去做某事的一群人”。合起来表示“负责预算事务的委员会”。","mnemonic":["把它拆开记：budget=预算（可联想“布置钱的用途”），committee=委员会（“委”字就是委员会的“委”）。合起来就是“管预算的委员会”。","联想场景：一群人开会“算钱、分钱、控钱”——这就是预算委员会的工作。"]}
{"word":"budget cut","summary":{"en":"a reduction in available funding","zh":"可用经费减少"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a reduction in the amount of money available to a department, project, or organization","zh":"预算削减；经费缩减（指某个部门、项目或机构可用资金减少）"},"examples":[{"en":"The library reduced its opening hours after a budget cut.","zh":"图书馆在预算削减后缩短了开放时间。"},{"en":"Teachers worry that budget cuts will affect after-school programs.","zh":"老师们担心预算削减会影响课后项目。"}]}],"synonyms":["funding cut","spending cut","budget reduction","cutback","austerity measure"],"phonetic":"/ˈbʌdʒɪt kʌt/","extraExplanation":["常见搭配：make/announce/impose a budget cut（做出/宣布/实施预算削减）；face/suffer budget cuts（面临/遭受预算削减）。","和 budget trim 相比，budget cut 通常更“硬”、更明显；也常与 layoffs（裁员）、service reductions（服务减少）一起出现。"],"etymology":"由 budget（预算）+ cut（削减）构成的名词短语；cut 原义是“切割”，引申为“削减（数量、经费等）”。在政府、学校、公司等语境中常用。","mnemonic":["把预算想成一块“蛋糕”（budget），cut 就是“切掉一块”——可用的钱变少了。"]}
{"word":"budget cutback","summary":{"en":"a reduction in planned spending","zh":"计划支出的减少；预算削减"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a reduction in planned spending; an amount of money removed from a budget","zh":"预算削减；预算中被砍掉的开支（或金额）"},"examples":[{"en":"Because of budget cutbacks, the library shortened its opening hours.","zh":"由于预算削减，图书馆缩短了开放时间。"},{"en":"The school canceled some programs after a budget cutback.","zh":"学校在一次预算削减后取消了一些项目。"},{"en":"The department is preparing for another budget cutback next year.","zh":"该部门正在为明年的又一次预算削减做准备。"}]}],"synonyms":["spending cut","budget reduction","budget cut","funding cut","cutback","austerity measure"],"phonetic":"/ˈbʌdʒɪt ˈkʌtˌbæk/","extraExplanation":["在新闻和职场语境中很常见，通常指政府、学校、公司等因资金压力而减少支出。","语气偏正式，常与 public services（公共服务）、staffing（人员配置）、funding（资金）等搭配。"],"etymology":"由 budget（预算）+ cutback（削减、缩减）组成。cutback 源自动词 cut back（“往回砍、缩减”），后来名词化表示“削减的行为/额度”。","mnemonic":["把它拆开记：budget（预算）+ cutback（砍回去）=“把预算砍回去”。","联想“cut=砍，back=往回”，钱被“砍回去”了，所以就是预算削减。"]}
{"word":"budget cutbacks","summary":{"en":"reductions in spending plans due to limited funds","zh":"因资金紧张而减少预算开支的措施"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"reductions in planned spending (often by a government, school, or company) because there is less money available","zh":"（由于资金不足而进行的）预算削减；开支缩减（常见于政府、学校或公司）"},"examples":[{"en":"The library reduced its hours because of budget cutbacks.","zh":"由于预算削减，图书馆缩短了开放时间。"},{"en":"After the recession, many departments faced budget cutbacks.","zh":"经济衰退之后，许多部门都面临预算缩减。"},{"en":"Teachers worried that budget cutbacks would increase class sizes.","zh":"老师们担心预算削减会导致班级人数增加。"}]}],"synonyms":["budget cuts","spending cuts","cuts","austerity measures","belt-tightening","cost cutting","reductions"],"phonetic":"/ˈbʌdʒɪt ˈkʌtˌbæks/","extraExplanation":["常用于新闻或正式语境，强调“被迫减少支出”的结果：budget cutbacks in education/healthcare/defense（教育/医疗/国防领域的预算削减）。","语气上比 cuts 更正式一些；也可写作 budget cuts，意思接近。"],"etymology":"由 budget（预算）+ cutback（削减、缩减）组合而成。cutback 原意是“把某物剪短/切回去”，引申为“减少（开支、产量等）”。","mnemonic":["把它拆开记：budget=预算；cutbacks=“往回砍”的削减 → “预算往回砍”。","联想中文常说的“过紧日子”=预算削减带来的开支缩减。"]}
{"word":"budget deficit","summary":{"en":"spending that exceeds income in a budget period","zh":"某一预算期内支出超过收入的赤字"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a situation where spending is greater than income in a budget (often for a government) during a certain period","zh":"（某一时期内）预算支出大于收入的情况；（常指政府）预算赤字"},"examples":[{"en":"The country’s budget deficit grew after tax revenues fell.","zh":"税收减少后，这个国家的预算赤字扩大了。"},{"en":"To reduce the budget deficit, the government cut some programs and raised certain taxes.","zh":"为减少预算赤字，政府削减了一些项目并提高了部分税种。"},{"en":"A large budget deficit can increase government debt over time.","zh":"长期来看，较大的预算赤字可能会增加政府债务。"}]}],"synonyms":["fiscal deficit","deficit","budget shortfall"],"phonetic":"/ˈbʌdʒɪt ˈdɛfəsɪt/","extraExplanation":["区分：budget deficit（预算赤字）是“某一期收支的差额”；debt（债务）是“累积欠下的总额”。赤字长期持续，通常会推高债务。","常见搭配：run a budget deficit（出现预算赤字）；reduce/cut the budget deficit（减少赤字）；widen/expand the budget deficit（赤字扩大）；budget deficit as a percentage of GDP（赤字占GDP比重）。"],"etymology":"budget 来自法语 bougette（“小皮袋”），早期指装财政文件的袋子，后来引申为“财政计划/预算”；deficit 来自拉丁语 deficit（“缺少、不足”）。合起来表示“预算出现不足”。","mnemonic":["deficit 含有 de-（向下/减少）+ -ficit（做/产生的结果），可以联想“钱往下掉，出现缺口”。","把 deficit 记成“弟(迪)费(s) it（花费它）→ 花费太多就赤字”。"]}
{"word":"budget for","summary":{"en":"to set aside money or resources in advance for an expected cost or situation","zh":"提前为预期支出或情况预留预算/资源"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to plan and set aside money (or resources/time) to pay for something","zh":"为某事预留预算（或资源/时间），提前把钱/资源安排进去"},"examples":[{"en":"We need to budget for rent, utilities, and groceries each month.","zh":"我们每个月都需要为房租、水电费和日常买菜预留预算。"},{"en":"Did you budget for taxes and shipping when you calculated the total cost?","zh":"你算总价时把税费和运费也预算进去了吗？"},{"en":"The team budgeted for two extra weeks in case of delays.","zh":"团队为可能的延期多预留了两周时间。"}]},{"partOfSpeech":"phrase","definition":{"en":"to allow for something likely to happen, especially an extra cost or problem","zh":"把可能发生的情况（尤其是额外费用/问题）考虑在内"},"examples":[{"en":"Budget for unexpected repairs when you buy an older car.","zh":"买旧车时要把意外维修的费用考虑在内。"},{"en":"Always budget for some mistakes when you’re learning a new skill.","zh":"学习新技能时要预留犯错的空间。"}]}],"synonyms":["allow for","plan for","set aside","provide for","account for","make provision for"],"phonetic":"/ˈbʌdʒɪt fɔr/","extraExplanation":["常见搭配：budget for rent/food/travel; budget for inflation; budget for contingencies（为突发情况预留）。","不仅是钱：也可指时间、人力等资源（如：budget for two extra days）。","语气提醒：budget for 通常强调“提前预留”，比 plan for 更偏“算进成本/资源分配”。"],"etymology":"“budget”原意与“装钱的袋子/皮包”有关，后来引申为“财务计划、预算”，再发展出动词“做预算”。“budget for”就是“把某项支出（或资源）纳入预算/计划之中”。","mnemonic":["把它拆开记：budget（预算）+ for（为了）→“为了某事做预算/把它算进去”。","联想中文说法“预算进去/算上这笔钱”，就是 budget for 的感觉。"]}
{"word":"budget husband","summary":{"en":"a joking way to describe a very frugal husband or a “low-cost” spouse option","zh":"指很节俭的丈夫；也可玩笑说“经济型/低成本”的结婚对象"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Humorous, informal) A husband who is very frugal, or someone joked about as a “low-cost” option for a spouse.","zh":"（幽默/非正式）指很节俭的丈夫；也可开玩笑指“经济型/低成本”的结婚对象。"},"examples":[{"en":"He’s a real budget husband—he compares prices before buying anything.","zh":"他真是个“节俭型老公”——买什么都先比价。"},{"en":"She joked that she didn’t need a rich husband, just a budget husband who saves and plans.","zh":"她开玩笑说不需要有钱老公，只要一个会存钱、会规划的“经济型老公”。"},{"en":"The phrase can sound objectifying, so use it carefully and only in clearly playful contexts.","zh":"这个说法可能让人觉得把人“物化”，所以要谨慎使用，最好只在明确玩笑的语境里用。"}]}],"synonyms":["frugal husband","thrifty husband","penny-pincher","tightwad","economical partner"],"phonetic":"ˈbʌdʒɪt ˈhʌzbənd","extraExplanation":["语感提示：budget 作形容词很常见，如 budget hotel（经济型酒店）、budget airline（廉价航空）。放在 husband 前面时通常是玩笑说法；正式场合更自然说 frugal husband（节俭的丈夫）或 someone who’s good with money（很会理财的人）。","文化提醒：在亲密关系里用“budget”修饰人，可能让对方觉得被当成“选项/商品”。如果不确定对方是否接受，换成更中性的表达会更礼貌。"],"etymology":"“budget”来自法语 bougette（小皮袋），后来引申为“财务计划/预算”；“budget husband”是现代英语里把 budget 当作形容词用来表示“省钱的/经济型的”的口语搭配，常带调侃意味。","mnemonic":["把它当作“budget（预算）+ husband（老公）”：有预算意识的老公＝节俭型老公。","联想 budget hotel（经济型酒店）：budget husband＝“经济型配置”的老公（偏玩笑）。"]}
{"word":"budget management","summary":{"en":"Planning and controlling spending to meet financial goals.","zh":"为实现财务目标而对支出进行规划与控制。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"The process of planning, tracking, and controlling how money is earned, spent, and saved to meet financial goals.","zh":"对收入与支出进行规划、记录与控制，以实现财务目标的过程。"},"examples":[{"en":"Good budget management helps you avoid debt and build savings.","zh":"良好的预算管理能帮助你避免负债并积累储蓄。"},{"en":"She uses an app for daily budget management.","zh":"她用一个应用来做日常预算管理。"},{"en":"The company improved budget management by reviewing expenses every month.","zh":"公司通过每月审查开支来改进预算管理。"}]},{"partOfSpeech":"phrase","definition":{"en":"In organizations or projects, the practice of allocating funds and monitoring costs so a plan stays within its financial limits.","zh":"在组织或项目中，为各项工作分配资金并监控成本，确保计划不超出财务上限的做法。"},"examples":[{"en":"Strong budget management kept the project from running out of money.","zh":"强有力的预算管理让项目没有出现资金耗尽。"},{"en":"Budget management is a key skill for project managers.","zh":"预算管理是项目经理的一项关键技能。"}]}],"synonyms":["financial management","expense control","cost management","spending control","money management","budgeting","fiscal management"],"phonetic":"/ˈbʌdʒɪt ˈmænɪdʒmənt/","extraExplanation":["常见搭配：budget management skills（预算管理能力）、budget management plan（预算管理计划）、budget management system（预算管理系统）。","区别提示：budgeting 更偏“制定预算”；budget management 更强调“制定+执行+跟踪+调整”的全过程。"],"etymology":"“budget”源自法语 bougette（“小皮袋”），引申为“钱袋里的金额、预算”；“management”来自 manage（经营、管理）。合起来指“对预算的管理”。","mnemonic":["把它拆开记：budget=预算（钱的计划），management=管理；合起来就是“预算的管理”。","联想“预算像方向盘”：budget 决定方向，management 负责一路修正，避免“超支”跑偏。"]}
{"word":"budget one's time","summary":{"en":"plan time use carefully","zh":"精心规划与分配时间"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to plan and control how you use your time carefully, so you have enough time for each task","zh":"仔细规划并控制时间的使用，以确保每项任务都有足够时间"},"examples":[{"en":"If you budget your time, you can finish the report and still make it to the meeting.","zh":"如果你把时间安排好，就能写完报告，还能赶上会议。"},{"en":"She budgets her time by studying for one hour and then taking a short break.","zh":"她通过学习一小时再休息一会儿来规划时间。"},{"en":"We need to budget our time wisely during the exam.","zh":"考试时我们需要明智地分配时间。"}]}],"synonyms":["manage your time","plan your time","allocate time","schedule","set aside time"],"phonetic":"/ˈbʌdʒɪt wʌnz taɪm/","extraExplanation":["常见搭配：budget your time (wisely/carefully), budget time for sth（为某事留出时间）。","语气偏正式/书面，也常用于学习、项目管理、考试策略等场景。","和 manage your time 相近，但 budget 更强调“提前分配额度/留出余量”，像做预算一样。"],"etymology":"budget 原指“皮包/钱袋”（中古法语），后来引申为“财务计划、预算”；再进一步比喻到“时间预算”，意思是像花钱一样分配时间。","mnemonic":["把时间当“钱”来花：budget=做预算→“给每件事分配时间额度”。","联想中文“时间预算/时间分配”：预算（钱）→预算（时间）。"]}
{"word":"budget performance management","summary":{"en":"Managing and evaluating results through budgets and budget-linked targets.","zh":"通过预算及其目标来管理并评估绩效。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A management approach that plans, monitors, and evaluates performance using budgets (money plans) and budget-related targets to guide decisions and accountability.","zh":"一种以预算（资金计划）及其目标为核心来规划、监控并评估绩效的管理方法，用于指导决策与问责。"},"examples":[{"en":"The company adopted budget performance management to track each department’s spending and results every quarter.","zh":"公司采用预算绩效管理来按季度跟踪各部门的支出和成果。"},{"en":"Under budget performance management, managers must explain why costs rose without improving outcomes.","zh":"在预算绩效管理下，管理者必须解释为什么成本上升却没有带来更好的结果。"},{"en":"Good budget performance management links funding to measurable goals, not just last year’s numbers.","zh":"良好的预算绩效管理会把资金与可衡量的目标挂钩，而不只是照搬去年的数字。"}]},{"partOfSpeech":"phrase","definition":{"en":"(Public sector/common policy use) A system in government or public organizations that ties budget allocation to program performance indicators, outcomes, and evaluations.","zh":"（公共部门常用）政府或公共机构将预算分配与项目绩效指标、结果和评估相挂钩的一套制度。"},"examples":[{"en":"The city introduced budget performance management to decide which programs should receive more funding.","zh":"该市推行预算绩效管理，以决定哪些项目应获得更多资金。"},{"en":"Budget performance management requires agencies to report performance indicators along with financial statements.","zh":"预算绩效管理要求各机构在提交财务报表的同时报告绩效指标。"}]}],"synonyms":["performance budgeting","performance-based budgeting","budgeting for results","results-based management","financial performance management"],"phonetic":"/ˈbʌdʒɪt pɚˈfɔrməns ˈmænɪdʒmənt/","extraExplanation":["常见搭配：performance-based budgeting（绩效预算）、budget accountability（预算问责）、KPI/indicator（绩效指标）、outcome（结果）、cost-effectiveness（成本效益）。","学习提示：中文里常对应“预算绩效管理/预算与绩效管理/绩效预算管理”，具体译法取决于组织是否强调“预算分配与绩效挂钩”。"],"etymology":"由“budget（预算）+ performance（绩效）+ management（管理）”组合而成的现代管理术语；含义从“管钱”扩展为“以钱促效、以效定钱”，在企业管理与公共财政改革语境中广泛使用。","mnemonic":["把它拆成三段记：budget（钱的计划）+ performance（做得怎么样）+ management（怎么管）→“用预算来管绩效”。","联想“先定钱→定目标→看结果→再给钱”，就是它的核心逻辑。"]}
{"word":"budget price","summary":{"en":"an affordable, low cost level","zh":"价格实惠、低成本的价位"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a low or affordable price, especially one suitable for people who want to save money","zh":"预算友好价；实惠的价格（尤指适合想省钱的人）"},"examples":[{"en":"We found a hotel at a budget price near the station.","zh":"我们在车站附近找到了一家价格实惠的酒店。"},{"en":"This phone offers good performance at a budget price.","zh":"这款手机在实惠的价位上提供了不错的性能。"},{"en":"They sell basic furniture at budget prices.","zh":"他们以实惠的价格出售基础款家具。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of a product or service) sold cheaply; intended to be affordable","zh":"（产品/服务）廉价的；面向大众、价格亲民的"},"examples":[{"en":"It’s a budget-price airline, so you pay extra for luggage.","zh":"这是一家廉价航空，所以托运行李要另外收费。"},{"en":"She chose the budget-price option to keep costs down.","zh":"她选择了亲民的选项来控制成本。"}]}],"synonyms":["affordable price","low price","low cost","economy price","reasonable price","cheap price"],"phonetic":"ˈbʌdʒɪt praɪs","extraExplanation":["常见搭配：at a budget price（以实惠的价格）、budget-price option/item（亲民价选项/商品）、budget pricing（主打低价的定价策略）。","英式与美式都能用，但口语里也常直接说：affordable / low-priced / cheap（注意 cheap 有时带“质量差”的语气）。"],"etymology":"由 budget（预算）+ price（价格）组合而成，用来强调“符合预算、不会太贵”的价格；也常见作定语形式 budget-price（多用连字符）。","mnemonic":["把 budget 记成“预算本”，budget price 就是“预算本能承受的价格”。","联想中文“预算价/亲民价”：看到 budget 就想到“预算”，自然推出“预算友好”。"]}
{"word":"budget price range","summary":{"en":"an affordable cost range you can spend within","zh":"可负担的预算价格区间"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a low-cost range of prices; the amount you can afford to spend (especially when shopping or planning).","zh":"预算价位范围；可承受的价格区间（尤用于购物或做计划时）。"},"examples":[{"en":"I’m looking for a laptop in the budget price range—under $500.","zh":"我在找预算价位范围内的笔记本电脑——500美元以下。"},{"en":"This hotel is clean and comfortable, even though it’s in the budget price range.","zh":"这家酒店虽然属于预算价位，但很干净也很舒适。"},{"en":"Before choosing a venue, decide your budget price range for the event.","zh":"在选场地之前，先确定活动的预算价格区间。"}]}],"synonyms":["affordable price range","budget range","low price range","economy range","price bracket"],"phonetic":"/ˈbʌdʒɪt praɪs reɪndʒ/","extraExplanation":["常见近义说法：budget range, affordable price range, low price range。","口语里也常说：I’m on a budget（我预算有限）。","注意：budget 在这里是“预算/经济型”的意思，不等于“便宜没好货”，更偏“性价比、能负担”。"],"etymology":"这是由“budget（预算）+ price range（价格区间）”组成的名词短语，用来表达“偏便宜/可负担的价格范围”。在商业、零售和日常消费语境中很常见。","mnemonic":["把它拆开记：budget=预算；price range=价格区间；合起来就是“预算内的价位区间”。","联想中文购物常说的“预算价位/预算区间”，几乎是直译，容易记。"]}
{"word":"budget proposal","summary":{"en":"a formal plan requesting approval for spending money","zh":"请求批准资金支出的正式方案"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A formal document or presentation that explains a planned budget (estimated income and expenses) and asks for approval or funding.","zh":"预算提案：一份正式文件或汇报，说明拟定的预算（预计收入与支出），并请求批准或拨款。"},"examples":[{"en":"The team submitted a budget proposal for the new marketing campaign.","zh":"团队为新的市场营销活动提交了一份预算提案。"},{"en":"Your budget proposal should include staffing costs, equipment, and a timeline.","zh":"你的预算提案应包含人员成本、设备费用以及时间表。"},{"en":"The committee rejected the budget proposal because the numbers were unclear.","zh":"委员会否决了这份预算提案，因为数据不够清晰。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of proposing how money should be allocated for a project, department, or period of time.","zh":"提出预算分配方案的行为（为某个项目、部门或一段时间安排资金）。"},"examples":[{"en":"Budget proposal begins in October, when each department estimates next year’s needs.","zh":"预算提案工作从十月开始，各部门会估算来年的需求。"},{"en":"During budget proposal, managers defend their requests with data.","zh":"在提出预算时，管理者会用数据为自己的申请做辩护。"}]}],"synonyms":["funding proposal","spending plan","budget plan","financial proposal","appropriation request"],"phonetic":"/ˈbʌdʒɪt prəˈpoʊzəl/","extraExplanation":["常见场景：公司项目立项、部门年度经费申请、政府财政/公共项目拨款等。","常见组成：目标与背景、关键假设、费用明细（人力/材料/差旅等）、收益或影响、风险与备选方案、时间表与审批人。","搭配动词：submit/prepare/draft a budget proposal（提交/准备/起草）；approve/reject a budget proposal（批准/否决）；revise a budget proposal（修改）。"],"etymology":"“budget”源自法语 bougette（小皮袋），引申为“资金计划/预算”；“proposal”来自拉丁语 pro-（向前）+ ponere（放置），原义为“提出”。合起来就是“提出预算的文件/方案”。","mnemonic":["把它拆开记：budget=预算，proposal=提案/建议；合起来就是“预算+提案”。","联想：你要“要钱做事”，先写一份“预算提案”去申请。"]}
{"word":"budget surplus","summary":{"en":"Money left over because income exceeds spending.","zh":"收入超过支出而剩下的钱；预算盈余。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The amount of money left when income is greater than spending in a given period (often used for governments, companies, or households).","zh":"（在一定时期内）收入大于支出后剩下的资金；（常指政府/企业/家庭的）预算盈余。"},"examples":[{"en":"The city reported a budget surplus after cutting costs and collecting more taxes.","zh":"在削减成本并增加税收后，这座城市报告出现了预算盈余。"},{"en":"A budget surplus can be used to pay down debt or invest in public services.","zh":"预算盈余可以用来偿还债务或投入公共服务。"},{"en":"Even with a budget surplus, officials warned that future expenses could rise.","zh":"即使出现预算盈余，官员仍警告未来支出可能会上升。"}]}],"synonyms":["fiscal surplus","budgetary surplus","surplus","excess","leftover funds"],"phonetic":"/ˈbʌdʒɪt ˈsɝːpləs/","extraExplanation":["对比：budget deficit（预算赤字）= 支出大于收入。","常见搭配：run a budget surplus（出现/实现预算盈余）；a large/small surplus（大/小盈余）；surplus revenue（盈余收入）。","经济新闻里常说“fiscal surplus”，其中 fiscal 更偏“政府财政”的语境。"],"etymology":"“budget”源自法语 bougette（小皮袋），后来引申为“收支计划”；“surplus”源自法语 surplus（剩余、超出）。合在一起表示“预算中超出支出的剩余部分”。","mnemonic":["把 surplus 记成“sur-（超过）+ plus（加）”：加出来还“超过了”，就是“多出来的盈余”。","联想中文“盈余=赢（多出来）”：收入“赢过”支出，就有 surplus。"]}
{"word":"budget system for managing state capital","summary":{"en":"A state-government framework for planning and controlling long-term investment spending.","zh":"用于规划和管控州政府长期投资支出的预算框架。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A government framework for planning, approving, tracking, and reporting how a state’s investment funds (especially for long-term projects like roads, schools, and public buildings) are allocated and spent.","zh":"一种政府预算框架，用于规划、审批、跟踪并报告州政府的资本性资金（尤其是用于道路、学校、公共建筑等长期项目）的分配与支出情况。"},"examples":[{"en":"The budget system for managing state capital helps lawmakers decide which infrastructure projects get funded first.","zh":"用于管理州资本性资金的预算体系能帮助立法者决定哪些基础设施项目优先获得资金。"},{"en":"A transparent budget system for managing state capital can reduce waste and improve public trust.","zh":"透明的州资本性资金管理预算体系可以减少浪费并提升公众信任。"},{"en":"The audit found weaknesses in the budget system for managing state capital, including poor cost tracking.","zh":"审计发现州资本性资金管理预算体系存在薄弱环节，包括成本跟踪不佳。"}]}],"synonyms":["state capital budgeting system","capital budgeting process","public capital management system","capital budget framework","capital planning and budgeting"],"phonetic":"/ˈbʌdʒɪt ˈsɪstəm fər ˈmænɪdʒɪŋ steɪt ˈkæpɪtəl/","extraExplanation":["在公共财政里，state capital 通常指 capital budget / capital expenditure（资本预算/资本性支出）：用于建设或购买能使用多年的资产（如桥梁、政府大楼、供水系统）。它一般不同于 operating budget（经常性预算/运营预算），后者用于日常运行支出（如工资、水电、日常维护）。","更常见、更地道的写法包括：state capital budgeting system（州资本预算体系）、capital budgeting process（资本预算流程）、public capital management system（公共资本管理体系）。"],"etymology":"这是一个现代公共财政/公共管理领域的组合表达：budget system（预算体系）+ managing（管理）+ state capital（州的资本性资金/资本支出）。其中 capital 在政府语境里多指“资本性支出（长期投资）”，不同于日常的“首都”。","mnemonic":["记 capital：联想“资本/长期资产”，不是“首都”。看到 roads, bridges, buildings 这些词时，capital 多半指“资本性支出”。","把短语拆开记：budget system（预算体系）+ manage（管理）+ state capital（州的资本性资金）= 管钱、管项目、管长期投资。"]}
{"word":"budget trip","summary":{"en":"a low-cost, money-saving kind of travel","zh":"省钱、低花费的旅行"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a trip planned to cost as little as possible by saving money on transport, lodging, food, and activities","zh":"以尽量少花钱为目标来安排的旅行（在交通、住宿、餐饮和活动上省钱）"},"examples":[{"en":"We’re planning a budget trip, so we’ll take the train and stay in hostels.","zh":"我们在计划一次穷游，所以会坐火车并住青年旅舍。"},{"en":"A budget trip doesn’t mean a bad trip—you just choose cheaper options.","zh":"穷游不等于体验差——只是选择更便宜的方案。"},{"en":"They did a budget trip across Southeast Asia with a small daily spending limit.","zh":"他们用较低的每日花费上限，完成了一次东南亚穷游。"}]}],"synonyms":["low-cost trip","cheap vacation","shoestring trip","economical travel","thrifty travel"],"phonetic":"/ˈbʌdʒɪt trɪp/","extraExplanation":["常见近义表达：“on a budget”（预算有限地）、“budget-friendly”（适合预算的/省钱的）。例如：We’re traveling on a budget. / This hotel is budget-friendly.","语气上“budget trip”偏中性、实用；更口语、更形象的说法是“shoestring trip”（像用鞋带一样紧巴巴的预算）。"],"etymology":"“budget”原指“钱袋/皮袋”，后来引申为“预算、经费计划”；“trip”来自“短途出行/旅行”的常用词。合起来就是“以预算为核心的旅行”。","mnemonic":["把 budget 记成“把钱扣紧（budge 不动）”，不轻易花钱；budget trip 就是“钱不轻易动的旅行”。","联想中文“预算（budget）+ 旅行（trip）= 预算旅行/穷游”。"]}
{"word":"budget update","summary":{"en":"the latest revision or report of budget figures and changes","zh":"预算数字与变动的最新更新/修订报告"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a report or revision that gives the newest numbers and changes in a budget (often for a project, team, or company)","zh":"（常用于项目/团队/公司）预算的最新更新或调整报告，包含最新数字与变动"},"examples":[{"en":"Can you send me a budget update before the meeting?","zh":"你能在开会前把预算更新发给我吗？"},{"en":"The budget update shows we’re over costs in travel and under in marketing.","zh":"预算更新显示我们差旅超支、市场费用低于预算。"}]},{"partOfSpeech":"phrase","definition":{"en":"a request to update the budget (often used as an email subject line or agenda item)","zh":"（常作邮件标题/议程事项）请求更新预算"},"examples":[{"en":"Subject: Budget update—please revise Q2 estimates by Friday.","zh":"主题：预算更新——请在周五前修改第二季度预估。"},{"en":"Next on the agenda is a budget update from Finance.","zh":"下一个议程是财务部门的预算更新。"}]}],"synonyms":["budget revision","budget refresh","budget review","updated budget","financial update"],"phonetic":"/ˈbʌdʒɪt ˌʌpˈdeɪt/","extraExplanation":["在职场里，“budget update”通常指：对比原预算与实际支出（budget vs. actuals）、解释偏差（variance）、并给出调整后的预测（forecast）。常见搭配：monthly budget update（每月预算更新）、budget update meeting（预算更新会议）、provide a budget update（提供预算更新）。"],"etymology":"“budget”源自法语 bougette（小皮袋），后来引申为“装钱的袋子→财务计划”；“update”表示“使变成最新”。合在一起就是“把预算信息更新到最新”。","mnemonic":["把它拆开记：budget=预算，update=更新；连起来就是“预算更新”。","联想中文工作场景：每月“报销+对账”后做一次“预算更新”。"]}
{"word":"budget wife","summary":{"en":"Informal phrase for someone seen as managing the household budget, or (more negatively) a “cheaper” substitute partner.","zh":"非正式说法：指负责家庭预算的人；也可作贬义，指“更便宜/次等的伴侣替代品”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(informal) A wife who plans and manages the household’s spending and savings.","zh":"（非正式）负责规划和管理家庭开支与储蓄的妻子（管家/管账的人）。"},"examples":[{"en":"In our family, my budget wife tracks every bill and sets monthly limits.","zh":"在我们家，我的“budget wife”会记录每一笔账单，并设定每月限额。"},{"en":"He thanked his wife for being the budget wife and keeping them out of debt.","zh":"他感谢妻子一直当“budget wife”，让他们避免负债。"}]},{"partOfSpeech":"phrase","definition":{"en":"(informal, often joking but can be offensive) A “cheaper” or lower-status substitute for a wife/partner; used to compare people in a hurtful way.","zh":"（非正式，常带玩笑但可能冒犯）把某人说成“更便宜/次一等的妻子/伴侣替代品”；一种容易伤人的比较说法。"},"examples":[{"en":"Calling someone a “budget wife” is disrespectful and can damage relationships.","zh":"把别人叫“budget wife”很不尊重，也会伤害关系。"},{"en":"The comment sounded like he was treating partners as products—like a ‘budget wife.’","zh":"这句话听起来像把伴侣当商品——说什么“budget wife”。"}]}],"synonyms":["money manager","handles the budget","manages the finances","financial planner","cheap substitute"],"phonetic":"ˈbʌdʒɪt waɪf","extraExplanation":["语用提醒：第二个用法容易带有性别刻板印象，把伴侣“商品化”，在英语语境中可能被认为轻蔑或物化。更中性表达可用：money manager（理财负责人）、handles the budget（负责预算）、financial planner（家庭财务规划者）。","如果你想表达“会过日子/精打细算的妻子”，英语里更自然的说法通常是：She’s good with money. / She manages our finances. 而不是直接说“budget wife”。"],"etymology":"现代英语复合短语，由 budget（预算）+ wife（妻子）组合而成；多见于口语或网络语境，并非固定、正式的词汇。","mnemonic":["把 budget 理解为“预算/省钱”，budget + wife = “管预算的妻子”。记成“预算+老婆=管账”。"]}
{"word":"budget-conscious","summary":{"en":"Budget-conscious means careful about spending and choosing good value within a budget.","zh":"budget-conscious 指在预算内理性消费、注重性价比、精打细算。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Careful to spend as little money as possible; thinking about price and value when buying things.","zh":"精打细算的；注重预算的；购买时会考虑价格与性价比的。"},"examples":[{"en":"We chose a budget-conscious hotel near the train station.","zh":"我们选了一家靠近火车站、比较注重预算的酒店。"},{"en":"A budget-conscious shopper compares prices before buying.","zh":"精打细算的消费者会在购买前比较价格。"},{"en":"The menu includes budget-conscious options like soup and rice.","zh":"菜单里有一些比较省钱的选择，比如汤和米饭。"}]}],"synonyms":["cost-conscious","thrifty","economical","frugal","money-saving"],"phonetic":"/ˈbʌdʒɪt ˈkɑnʃəs/","extraExplanation":["“budget-conscious”是由budget（预算）+ conscious（有意识的、注意到的）构成的复合形容词，常用于购物、旅行、生活方式和公司决策等场景，语气通常中性偏积极，强调“理性消费、重视价值”。","常见近义表达：cost-conscious（更强调成本）、money-saving（强调省钱结果）、thrifty（更偏“节俭”的性格特质）。"]}
{"word":"budget-cutting","summary":{"en":"Budget-cutting means reducing spending, either as a description (budget-cutting measures) or as the activity of cutting a budget.","zh":"budget-cutting 指“削减预算/减少开支”，既可作形容词（如削减预算的措施），也可指削减预算这一做法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adjective) Intended to reduce spending; done to save money by lowering a budget.","zh":"（形容词）旨在减少开支的；通过降低预算来省钱的。"},"examples":[{"en":"The company announced several budget-cutting measures, including a hiring freeze.","zh":"公司宣布了几项削减预算的措施，包括冻结招聘。"},{"en":"Budget-cutting plans can affect services that people rely on.","zh":"削减预算的计划可能会影响人们依赖的服务。"}]},{"partOfSpeech":"n.","definition":{"en":"(noun) The act or practice of reducing spending or lowering a budget.","zh":"（名词）削减开支；降低预算的做法。"},"examples":[{"en":"Budget-cutting is often discussed during economic downturns.","zh":"在经济不景气时期，人们经常讨论削减开支。"},{"en":"The budget-cutting focused on travel costs rather than salaries.","zh":"这次削减开支主要针对差旅费，而不是工资。"}]}],"synonyms":["cost-cutting","spending cuts","austerity","belt-tightening","cutbacks"],"phonetic":"ˈbʌdʒɪt ˌkʌtɪŋ","extraExplanation":["“budget-cutting”常作形容词放在名词前（budget-cutting measures/plan）。也可以写成不加连字符的“budget cutting”（更偏名词用法），但作定语时用连字符更清晰、更常见。","常见搭配：budget-cutting measures（削减预算的措施），budget-cutting plan（削减预算的计划），budget-cutting drive（削减预算的行动/运动）。在新闻语境里也常与“austerity（紧缩）”一起出现。"]}
{"word":"budget-friendliness","summary":{"en":"Budget-friendliness means affordability—being easy on the wallet.","zh":"Budget-friendliness 指“价格实惠、对钱包友好”的特性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being inexpensive or affordable; suitable for people who want to spend less money.","zh":"预算友好性；价格实惠、负担得起；适合想少花钱的人。"},"examples":[{"en":"The budget-friendliness of the hostel makes it popular with students.","zh":"这家青旅的预算友好性让它在学生中很受欢迎。"},{"en":"We chose this restaurant for its budget-friendliness and good reviews.","zh":"我们选这家餐厅是因为它价格实惠而且评价很好。"}]}],"synonyms":["affordability","low cost","value for money","cost-effectiveness"],"phonetic":"/ˈbʌdʒɪt ˈfrɛndlinəs/","extraExplanation":["“budget-friendly”是常见形容词（价格实惠的）；“budget-friendliness”是在其后加上名词后缀“-ness”，把“实惠/省钱”这种特征变成“特性/程度”。","写作中更常用的表达包括：affordability（负担能力/可负担性）、value for money（性价比高）、cost-effectiveness（成本效益高）。其中“affordability”更正式。"]}
{"word":"budget-friendly","summary":{"en":"“Budget-friendly” means affordable and not too expensive.","zh":"“budget-friendly”表示“价格亲民、不会太贵、对预算友好”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not too expensive; affordable and suitable for people who want to save money.","zh":"不太贵的；价格亲民的；适合想省钱的人。"},"examples":[{"en":"This restaurant is budget-friendly but still tasty.","zh":"这家餐厅价格亲民，但还是很好吃。"},{"en":"We chose a budget-friendly hotel near the subway.","zh":"我们选了一家地铁附近的经济型酒店。"},{"en":"Do you have any budget-friendly gift ideas?","zh":"你有什么不太贵的礼物点子吗？"}]}],"synonyms":["affordable","inexpensive","low-cost","reasonably priced","cost-effective"],"phonetic":"/ˈbʌdʒɪt ˌfrɛndli/","extraExplanation":["“Budget-friendly”是很常见的商业与日常用语，语气偏中性到正面，强调“对预算友好”。在广告、旅游攻略、购物推荐里特别常见。","常见搭配：budget-friendly options/choices/activities/meals/hotels。也可以用近义表达：affordable（更通用）、cost-effective（更强调“划算/性价比”）、wallet-friendly（更口语）。","写法上可连字符（budget-friendly）或不连字符（budget friendly）。放在名词前作定语时更常用连字符：a budget-friendly trip。"]}
{"word":"budget-planning","summary":{"en":"Budget-planning is the process of creating a plan for how money will be earned and spent over time.","zh":"Budget-planning 指制定一段时间内的收入与支出计划，即“预算规划”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of deciding how much money you have and how you will spend it over a period of time (for a person, family, business, or government)","zh":"预算规划：决定在一段时间内有多少钱、以及将如何花费这些钱的过程（个人/家庭/公司/政府都适用）"},"examples":[{"en":"Budget-planning helps you avoid overspending and save for emergencies.","zh":"预算规划能帮助你避免超支，并为紧急情况存钱。"},{"en":"Our team starts budget-planning in September for next year’s projects.","zh":"我们团队在九月开始为明年的项目做预算规划。"},{"en":"Good budget-planning includes tracking income, fixed costs, and variable expenses.","zh":"好的预算规划包括记录收入、固定支出和可变支出。"}]}],"synonyms":["budgeting","financial planning","spending plan","budget management"],"phonetic":"/ˈbʌdʒɪt ˌplænɪŋ/","extraExplanation":["“budget planning”更常见；写成“budget-planning”通常出现在名词前作定语时（如：a budget-planning meeting 预算规划会议）。在标题或表格栏目里也可能用连字符来强调它是一个整体概念。","常见搭配：budget-planning process（预算规划流程）、budget-planning meeting（预算规划会议）、budget-planning tool（预算规划工具）。","在商业语境里，budget-planning 常和 forecasting（预测）、cost control（成本控制）、cash flow（现金流）一起出现，表示更系统的财务管理。"]}
{"word":"budget-preview","summary":{"en":"“Budget preview” means an early look or briefing on a proposed budget before it becomes final.","zh":"“budget preview”指在预算最终确定前，对拟定预算的提前查看或说明会。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An early look at a proposed budget (a draft or overview shown before the final budget is approved).","zh":"预算预览；在最终预算通过前，对拟定预算的提前查看（草案或概览）。"},"examples":[{"en":"The finance team shared a budget preview with department heads before the final meeting.","zh":"财务团队在最终会议前向各部门主管分享了预算预览。"},{"en":"This budget preview highlights the biggest changes in spending for next year.","zh":"这份预算预览强调了明年支出方面最大的变化。"}]},{"partOfSpeech":"n.","definition":{"en":"A short presentation or event where an organization explains upcoming budget plans in advance.","zh":"预算前瞻会；在预算公布前，机构提前说明预算计划的简短发布/说明活动。"},"examples":[{"en":"City council will hold a budget preview on Tuesday to answer questions from residents.","zh":"市议会将于周二举行预算前瞻会，回答居民的问题。"},{"en":"The budget preview gave reporters a clearer sense of the government’s priorities.","zh":"预算前瞻会让记者更清楚地了解政府的优先事项。"}]}],"synonyms":["budget draft","budget outline","budget briefing","preliminary budget","budget overview"],"phonetic":"/ˈbʌdʒɪt ˈpriːvjuː/","extraExplanation":["“budget preview”更常见的不带连字符写法是 budget preview。带连字符的“budget-preview”多见于文件名、网页标题、标签（tag）或内部命名，用来把两个词当作一个整体标识。","在正式写作中，如果你把它当作名词短语使用，通常写作 budget preview；如果它用作复合形容词放在名词前（较少见），也可能写成 budget-preview document（预算预览文件）。"]}
{"word":"budget-related","summary":{"en":"Budget-related means connected to a budget, especially money limits, costs, or financial planning.","zh":"budget-related 指“与预算有关的”，常用于描述费用限制、削减或财务规划等。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with a budget (a plan for how much money can be spent), especially costs, limits, or financial planning.","zh":"与预算（花钱计划）有关的，尤指费用、支出限制或财务规划。"},"examples":[{"en":"We had to delay the project for budget-related reasons.","zh":"由于预算相关的原因，我们不得不推迟这个项目。"},{"en":"The company is making budget-related cuts this year.","zh":"公司今年正在进行与预算有关的削减。"}]}],"synonyms":["budgetary","financial","cost-related","fiscal"],"phonetic":"/ˈbʌdʒɪt rɪˌleɪtɪd/","extraExplanation":["“budget-related”是由名词budget + related构成的复合形容词，常用连字符（-）放在名词前作定语：budget-related problems。","放在名词后作表语时，有时也可不加连字符：The problems are budget related（但加连字符更常见、更清晰）。","常见搭配：budget-related issues/cuts/constraints/decisions/concerns。"]}
{"word":"budget-supporting","summary":{"en":"Budget-supporting means providing financial support or helping a budget plan succeed.","zh":"budget-supporting 指“在经济上提供支持/支撑预算”，也可指“有利于预算方案的措施”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"helping to pay for something or providing financial support (often used to describe a person, job, or income that covers expenses).","zh":"（常作定语）帮助支付开销、提供经济支持的；能负担费用的（用于形容人、工作或收入能支撑花销）。"},"examples":[{"en":"She took a budget-supporting part-time job to cover rent and groceries.","zh":"她找了一份能支撑预算的兼职工作来支付房租和日常采买。"},{"en":"The scholarship is budget-supporting, but it won’t pay for all travel costs.","zh":"这项奖学金能在预算上提供支持，但不能承担全部差旅费用。"}]},{"partOfSpeech":"adj.","definition":{"en":"designed to support a government/organizational budget plan (for example, actions that increase revenue or reduce spending).","zh":"用于支持政府或机构预算方案的（如增加收入或减少支出的措施）。"},"examples":[{"en":"The finance minister announced budget-supporting measures, including spending cuts.","zh":"财政部长宣布了一些支持预算的措施，包括削减开支。"},{"en":"They proposed budget-supporting reforms to stabilize public finances.","zh":"他们提出支持预算的改革，以稳定公共财政。"}]}],"synonyms":["financially supportive","income-supporting","cost-covering","budget-friendly (close in meaning)","fiscally supportive"],"phonetic":"/ˈbʌdʒɪt səˈpɔrtɪŋ/","extraExplanation":["“budget-supporting”是由名词budget + 现在分词supporting构成的复合形容词，通常需要连字符（hyphen）放在名词前作定语：a budget-supporting job/measures。放在系动词后作表语时，有时也可不加连字符，但加连字符更清晰。","语感上它比“affordable（负担得起的）”更强调“提供资金/支撑预算”，而不是“价格便宜”。"]}
{"word":"budget-wise","summary":{"en":"“Budget-wise” means “regarding money or the budget; in terms of expenses.”","zh":"“budget-wise”意思是“从预算/花费角度看；在预算方面”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in terms of money or expenses; regarding the budget","zh":"从预算/花费角度看；在预算方面"},"examples":[{"en":"Budget-wise, we can’t afford a new car this year.","zh":"从预算角度看，我们今年买不起新车。"},{"en":"The trip is great, but budget-wise it’s a bit tight for me.","zh":"这趟旅行很棒，但从预算来说对我有点吃紧。"},{"en":"Budget-wise, this option makes the most sense.","zh":"从预算方面看，这个选择最合理。"}]}],"synonyms":["financially","in terms of the budget","from a budget standpoint","money-wise"],"phonetic":"/ˈbʌdʒɪt waɪz/","extraExplanation":["“budget-wise”由“budget（预算）+ -wise（在……方面）”构成，口语和写作中都常用来表示“就……而言/从……角度”。类似表达还有“price-wise（就价格而言）”“time-wise（就时间而言）”“health-wise（就健康而言）”。在更正式的写法里，可以用“from a budget standpoint”或“in terms of the budget”。"]}
{"word":"budgetary","summary":{"en":"“Budgetary” means “related to a budget,” especially official planning and control of money.","zh":"“budgetary”意为“与预算有关的”，多指正式的资金规划与控制。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a budget—especially the planning, control, or allocation of money for a government, organization, or project.","zh":"与预算有关的；尤指政府、组织或项目在资金规划、控制或分配方面的。"},"examples":[{"en":"The committee discussed budgetary priorities for next year.","zh":"委员会讨论了明年的预算优先事项。"},{"en":"Budgetary constraints forced the school to delay repairs.","zh":"预算限制迫使学校推迟维修。"},{"en":"They made budgetary adjustments after costs increased.","zh":"成本上涨后，他们进行了预算调整。"}]}],"synonyms":["financial","fiscal","budget-related"],"phonetic":"/ˈbʌdʒəˌtɛri/","extraExplanation":["“budgetary”常用于较正式的语境，尤其是政府文件、新闻报道、公司报告中，强调“与预算制度/预算过程有关”，而不只是“便宜”或“省钱”。","常见搭配：budgetary constraints（预算限制）、budgetary planning（预算规划）、budgetary process（预算流程）、budgetary allocation（预算拨款/分配）、budgetary authority（预算权限）。","词源提示：来自 budget（预算）+ -ary（表示“……的/与……有关的”形容词后缀），类似的构词有 monetary（货币的）、literary（文学的）。"]}
{"word":"budgetary revenue","summary":{"en":"income recorded as part of an official budget","zh":"纳入预算核算的收入"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"money received by a government or organization that is counted as income in its official budget (often from taxes, fees, or other sources)","zh":"（政府或机构）纳入预算核算的收入；预算收入（常来自税收、收费等）"},"examples":[{"en":"The city’s budgetary revenue fell after local businesses closed.","zh":"当地企业关闭后，该市的预算收入下降了。"},{"en":"They plan to increase budgetary revenue by raising the sales tax.","zh":"他们计划通过提高销售税来增加预算收入。"}]},{"partOfSpeech":"phrase","definition":{"en":"relating to income items and amounts shown in a budget (used as an adjective before a noun)","zh":"与预算中的收入项目/收入金额有关的（作定语）"},"examples":[{"en":"The report includes budgetary revenue projections for next year.","zh":"报告包含明年的预算收入预测。"},{"en":"Budgetary revenue targets were not met in the first quarter.","zh":"第一季度未完成预算收入目标。"}]}],"synonyms":["fiscal revenue","budget income","government revenue","tax revenue","public revenue"],"phonetic":"/ˈbʌdʒəˌtɛri ˈrɛvəˌnu/","extraExplanation":["在公共财政里，“budgetary revenue（预算收入）”通常指“纳入一般预算/公共预算核算的收入”。不同国家口径可能不同，有时会与“extra-budgetary revenue（预算外收入）”“non-tax revenue（非税收入）”“fiscal revenue（财政收入）”等概念并列出现。"],"etymology":"“budgetary”来自 budget（预算）+ 形容词后缀 -ary（……的）；“revenue”来自法语/拉丁语，原意与“返回、回流”有关，后来引申为“收入”。合起来常见于财政与公共管理语境，指预算口径下的收入。","mnemonic":["把它拆开记：budget（预算）+ -ary（……的）→ budgetary（预算的）；revenue 联想“人（re）回（ven）来带钱”→ 收入。","中文直译就是“预算的收入”，常用于政府财政报告、审计与政策文件。"]}
{"word":"budgeted","summary":{"en":"“Budgeted” means planned in a budget or the past form of “budget” (to plan spending).","zh":"“Budgeted”表示“按预算计划的/预算内的”，也可作动词“budget（做预算）”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"planned for or limited by a budget (the money you expect to have and how you will use it).","zh":"按预算计划的；受预算限制的（指预计会有多少钱、如何使用）。"},"examples":[{"en":"We stayed within our budgeted amount for the trip.","zh":"我们旅行的花费没有超过预算金额。"},{"en":"The budgeted time for the project is three months.","zh":"这个项目的预算工期是三个月。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “budget”: to plan how much money to spend and save, or to set an amount for something.","zh":"“budget”的过去式/过去分词：做预算；规划花费与储蓄；为某项开支设定金额。"},"examples":[{"en":"They budgeted $500 for groceries each month.","zh":"他们每月为买菜预算了500美元。"},{"en":"I budgeted carefully so I could pay my rent on time.","zh":"我认真做了预算，这样就能按时交房租。"}]}],"synonyms":["planned","allocated","budget-conscious","costed"],"phonetic":"/ˈbʌdʒɪtɪd/","extraExplanation":["“Budgeted”常见于商业与财务语境，和“actual（实际）”对比：budgeted costs（预算成本）vs. actual costs（实际成本）。","在公司里，“budgeted”也常用于报表与预测：budgeted revenue（预算收入）、budgeted headcount（预算编制/预算人数）。"]}
{"word":"budgeted to the limits","summary":{"en":"planned to use the maximum allowed budget, with almost no spare money","zh":"预算已做到上限，几乎没有余钱或调整空间"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"planned or allocated so that the spending reaches the maximum allowed amount, leaving little or no extra money","zh":"预算分配已做到上限（花费已经按允许的最高额度来安排），几乎没有余钱或余地"},"examples":[{"en":"The project is budgeted to the limits, so any delay could cause extra costs.","zh":"这个项目的预算已经做到上限，所以任何延期都可能带来额外成本。"},{"en":"We’re budgeted to the limits this month, so we can’t add new expenses.","zh":"我们这个月的预算已经到极限了，所以不能再增加新开支。"},{"en":"Her wedding plan was budgeted to the limits, with no room for upgrades.","zh":"她的婚礼计划预算卡到上限，完全没有升级的空间。"}]}],"synonyms":["budgeted to the max","maxed out","at the limit","tight","stretched thin","no room in the budget"],"phonetic":"/ˈbʌdʒɪtɪd tə ðə ˈlɪmɪts/","extraExplanation":["常见于商业、项目管理、家庭理财语境，暗示“风险更大”：一点点意外开支就可能超支。","也可用更自然的说法替换：\"budgeted to the max\"、\"right up to the limit\"、\"no room in the budget\"。"],"etymology":"由“budget”（预算）+“to the limits”（到极限/上限）组合而成的表达，用来强调预算被用到最大允许额度，几乎没有余量。","mnemonic":["把它想成“预算（budget）已经贴着上限线（limit）走”，再多一点就“越线”＝超支。","联想中文“卡到上限/卡死预算”：强调没有余地。"]}
{"word":"budgeteer","summary":{"en":"Budgeteer means a person who prepares or manages budgets, or the act of planning and allocating money.","zh":"Budgeteer 指“预算编制/管理的人”，也可作动词表示“编制预算、分配资金”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who plans, manages, or argues for a budget (how money will be spent).","zh":"预算编制者；负责规划、管理或主张预算的人（决定钱如何花）。"},"examples":[{"en":"As the project’s budgeteer, Maya tracked every expense and reported it weekly.","zh":"作为项目的预算编制负责人，Maya 追踪每一笔开销并每周汇报。"},{"en":"City budgeteers debated how much funding schools should receive next year.","zh":"市政府的预算负责人们讨论明年学校该获得多少拨款。"}]},{"partOfSpeech":"v.","definition":{"en":"To plan or manage a budget; to allocate money for different purposes.","zh":"编制预算；做预算规划；把资金分配到不同用途。"},"examples":[{"en":"We need to budgeteer carefully if we want the trip to stay affordable.","zh":"如果想让旅行保持经济实惠，我们就得仔细做预算。"},{"en":"She budgeteered the department’s funds to cover rent, salaries, and equipment.","zh":"她为部门资金做预算分配，用于房租、工资和设备。"}]}],"synonyms":["budget planner","budget manager","financial planner","allocate","plan (a budget)"],"phonetic":"/ˌbʌdʒəˈtɪr/","extraExplanation":["“budgeteer”由“budget（预算）+ -eer（表示从事某事的人，如 engineer, volunteer）”构成，语气上偏正式，常见于政府、组织、项目管理等语境。日常口语里更常说“budget planner / budget manager”或动词“budget”。"]}
{"word":"budgeter","summary":{"en":"A budgeter is someone who makes and manages a budget.","zh":"budgeter指制定并管理预算的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who plans, manages, or keeps track of a budget (how money will be spent and saved).","zh":"预算制定者；做预算的人（规划、管理或记录钱如何花与存）。"},"examples":[{"en":"As the family budgeter, Maya tracks every bill and grocery expense.","zh":"作为家里的预算制定者，Maya会记录每一笔账单和买菜开销。"},{"en":"A good budgeter sets aside money for emergencies.","zh":"一个好的做预算的人会为紧急情况预留一笔钱。"}]}],"synonyms":["budget planner","financial planner","money manager"],"phonetic":"/ˈbʌdʒɪtər/","extraExplanation":["“budgeter”来自“budget（预算）+ -er（做……的人）”。日常英语里更常见的说法是“someone who budgets（做预算的人）”或“budget planner（预算规划者）”。在理财软件语境中也常见“budgeter”（例如：beginner budgeters 新手做预算的人）。"]}
{"word":"budgeters","summary":{"en":"“Budgeters” means people who plan and manage their spending using a budget.","zh":"“budgeters”指通过制定预算来规划并管理开支的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who make and follow a budget (a plan for how to spend and save money).","zh":"做预算的人；按预算安排收支的人（预算：计划如何花钱与存钱）。"},"examples":[{"en":"Many budgeters track every expense with an app to avoid overspending.","zh":"很多做预算的人会用应用程序记录每一笔开销，避免超支。"},{"en":"New budgeters often start by listing fixed costs like rent and utilities.","zh":"刚开始做预算的人通常会先列出房租、水电等固定支出。"},{"en":"Budgeters usually set aside some money for emergencies.","zh":"做预算的人通常会留一部分钱作为应急储备。"}]}],"synonyms":["people who budget","financial planners (informal/general)","savers (related)"],"phonetic":"/ˈbʌdʒɪtɚ/","extraExplanation":["“budgeters”是“budgeter”的复数形式；单数表示“一个做预算的人”，复数表示“一群/多位做预算的人”。在个人理财语境中很常见，比如“budgeters and savers（做预算的人和储蓄者）”。"]}
{"word":"budgetful","summary":{"en":"“Budgetful” is a rare/nonstandard word usually intended to mean “budget-friendly” or “budget-conscious.”","zh":"“budgetful”很少见、偏非标准，通常想表达“预算友好/注重预算、较省钱”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard) budget-friendly; careful about spending; designed to cost little.","zh":"（非标准用法）预算友好；省钱的；花费不高的。"},"examples":[{"en":"We chose a budgetful hotel so we could spend more on food and museums.","zh":"我们选了一家很省钱的酒店，这样就能把更多预算花在美食和博物馆上。"},{"en":"Do you have any budgetful ideas for a birthday party?","zh":"你有没有什么省预算的生日派对点子？"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare, literal) having a budget; containing budget information.","zh":"（少见，字面）有预算的；包含预算信息的。"},"examples":[{"en":"Please send me a budgetful plan before the meeting.","zh":"开会前请发给我一份带预算的方案。"}]}],"synonyms":["budget-friendly","budget-conscious","low-cost","affordable","economical"],"phonetic":"/ˈbʌdʒətfəl/","extraExplanation":["“budgetful”在英语里不常见，很多母语者会觉得不自然。更常用的表达是“budget-friendly（预算友好）”“budget-conscious（注重预算）”“low-cost（低成本）”“affordable（负担得起）”。","如果你想表达“很省钱的选择/方案”，优先用：a budget-friendly option / a budget-conscious plan。","“budgetful”这个构词看起来像“handful / spoonful”那种“-ful（充满/…的量）”，但“budget”通常不这么搭配，所以会显得别扭。"]}
{"word":"budgeting","summary":{"en":"Budgeting means making a plan for how money will be used, or the act of managing spending using a budget.","zh":"Budgeting 指制定用钱计划的过程，或通过预算来管理与控制开支的行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity or process of planning how to spend, save, and manage money over a period of time (for a person, family, business, or government)","zh":"预算编制；做预算：为个人、家庭、企业或政府在一段时间内如何花钱、存钱与管理资金做计划的过程"},"examples":[{"en":"Budgeting helps me make sure I can pay rent and still save some money.","zh":"做预算能帮助我确保能付房租，同时还能存下一些钱。"},{"en":"Our company is budgeting for next year’s marketing costs.","zh":"我们公司正在为明年的营销费用做预算。"},{"en":"Good budgeting often starts with tracking your spending for a month.","zh":"良好的预算通常从记录一个月的开销开始。"}]},{"partOfSpeech":"v.","definition":{"en":"planning and controlling spending by creating a budget","zh":"制定并控制开支：通过制作预算来规划与管理花费"},"examples":[{"en":"I’m budgeting more carefully this semester.","zh":"这学期我在更谨慎地做预算。"},{"en":"She budgeted $200 for groceries each month.","zh":"她为每月的杂货开支预留了200美元。"}]}],"synonyms":["budget planning","financial planning","money management","cost control"],"phonetic":"/ˈbʌdʒətɪŋ/","extraExplanation":["在日常英语里，budgeting 常指“持续性的理财习惯/流程”，而 a budget 更像“一份具体的预算表或预算方案”。","常见搭配：budgeting for X（为X做预算/预留资金）、budgeting tool/app（预算工具/应用）、budgeting skills（预算能力）、zero-based budgeting（零基预算：每一笔支出都要有明确用途）。"]}
{"word":"budgetize","summary":{"en":"“Budgetize” means to create a budget and manage spending according to it (a less common alternative to using “budget” as a verb).","zh":"“budgetize”意为编制预算并按预算管理开支（但不如把“budget”直接当动词常见）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to plan and control spending by creating a budget; to put something under budget limits","zh":"编制预算；按预算规划与控制开支；把……纳入预算限制"},"examples":[{"en":"We need to budgetize our monthly expenses so we don’t overspend.","zh":"我们需要把每月开支做成预算，这样才不会超支。"},{"en":"The department budgetized travel costs and reduced nonessential trips.","zh":"部门把差旅费用纳入预算管理，减少了不必要的出行。"}]}],"synonyms":["budget","allocate","earmark","plan","set aside"],"phonetic":"/ˈbʌdʒɪtaɪz/","extraExplanation":["“budgetize”在现代英语里不算常用，更自然的说法通常是用“budget”作动词（如：We budget $500 for rent. 我们为房租预算500美元）。","后缀“-ize”常表示“使……化/使成为……/使采取某种做法”（如 modernize 现代化、prioritize 设定优先级）。因此“budgetize”字面意思就是“使之预算化/用预算来管理”。","在正式写作或商业场景中，如果想表达“把某项费用分配到预算科目里”，也常用更明确的动词：allocate（分配）、earmark（专款专用/预留）、set aside（留出）。"]}
{"word":"budgetizing","summary":{"en":"“Budgetizing” means making and using a budget to manage spending.","zh":"“budgetizing”指制定并执行预算来管理支出。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to plan, control, or manage money by creating and using a budget (often for a business, project, or household)","zh":"通过制定并执行预算来规划、控制或管理资金（常用于公司、项目或家庭）"},"examples":[{"en":"We’re budgetizing the marketing campaign to keep costs under control.","zh":"我们正在为这次营销活动做预算规划，以便控制成本。"},{"en":"Budgetizing early helps you avoid running out of money halfway through the project.","zh":"尽早做预算规划有助于避免项目进行到一半就没钱。"},{"en":"She spends Sunday evenings budgetizing for the month ahead.","zh":"她周日晚上会为接下来的一个月做预算规划。"}]}],"synonyms":["budgeting","planning","costing","forecasting","allocating funds"],"phonetic":"/ˈbʌdʒɪˌtaɪzɪŋ/","extraExplanation":["“budgetizing”是动词“budgetize”的现在分词/动名词形式；更常见的表达包括“budgeting”（做预算）和“creating a budget”（制定预算）。","在英式拼写中常见“budgetise / budgetising”。在商业或项目管理语境里，“budgetize”带有“把……纳入预算体系、按预算来管理”的语气。"]}
{"word":"budgets","summary":{"en":"“Budgets” means multiple spending plans or money amounts set aside for different purposes; it can also be the verb “budgets” (manages spending).","zh":"“Budgets”指多份支出计划或为不同用途预留的资金额度；也可作动词“budgets”，表示管理并控制开支。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plans for how much money you can spend and what you will spend it on over a period of time (plural of “budget”).","zh":"在一段时间内，你能花多少钱以及将钱花在什么地方的计划（budget 的复数）。"},"examples":[{"en":"Our household budgets changed after rent increased.","zh":"房租上涨后，我们家的预算安排变了。"},{"en":"The school is preparing next year’s budgets for books and technology.","zh":"学校正在制定明年的图书和科技设备预算。"}]},{"partOfSpeech":"n.","definition":{"en":"The amounts of money available for specific purposes (often used in workplaces or government).","zh":"为特定用途可用的资金数额（常用于公司或政府语境）。"},"examples":[{"en":"The marketing budgets were cut this quarter.","zh":"本季度市场营销预算被削减了。"},{"en":"Departments must justify their travel budgets.","zh":"各部门必须说明出差预算的合理性。"}]},{"partOfSpeech":"v.","definition":{"en":"To plan and control spending; to manage money carefully (third-person singular: budgets).","zh":"制定并控制开支；精打细算地管理钱（第三人称单数：budgets）。"},"examples":[{"en":"She budgets carefully so she can save for college.","zh":"她精打细算，这样就能为上大学存钱。"},{"en":"The company budgets for training every year.","zh":"公司每年都会为培训做预算。"}]}],"synonyms":["spending plans","financial plans","allocations","funding limits"],"phonetic":"/ˈbʌdʒəts/","extraExplanation":["“budget”既可以指“预算计划”（a budget），也可以指“预算资金/额度”（the budget for X）。复数“budgets”常见于公司、学校、政府等场景，表示不同项目或部门的多份预算。","常见搭配：set a budget（设定预算）, stick to a budget（遵守预算）, go over budget（超支）, cut/reduce budgets（削减预算）, on a tight budget（预算紧张）。"]}
{"word":"budgetwise","summary":{"en":"“Budgetwise” means “regarding the budget” or “financially.” It’s common in speech and informal writing.","zh":"“budgetwise”表示“就预算而言/从财务角度看”，常用于口语和较非正式的表达。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In terms of budget; regarding how much money is available or can be spent.","zh":"就预算而言；从花费/可用资金的角度来看。"},"examples":[{"en":"Budgetwise, we can’t afford a new car this year.","zh":"就预算而言，我们今年买不起新车。"},{"en":"The trip looks great, but budgetwise it might be too expensive.","zh":"这趟旅行看起来很棒，但从预算角度可能太贵了。"},{"en":"Budgetwise, the cheaper option makes more sense.","zh":"就预算来说，便宜的选择更合理。"}]},{"partOfSpeech":"adv.","definition":{"en":"(More formal) In a way that manages money and spending carefully.","zh":"（较正式）以节制花费、管理预算的方式。"},"examples":[{"en":"They planned the event budgetwise to avoid overspending.","zh":"他们在经费安排上很节制，以避免超支。"}]}],"synonyms":["financially","in terms of the budget","from a budget perspective","money-wise"],"phonetic":"/ˈbʌdʒətˌwaɪz/","extraExplanation":["“budgetwise”是由 budget（预算）+ -wise 组成的口语/半正式表达，-wise 的意思是“从……方面来看”（如 timewise 就时间而言）。在正式写作中，常用替代表达：“in terms of the budget / from a budget perspective / financially”。","注意：有些人认为 -wise 造词偏口语或略显随意；在商务邮件、报告中，用更正式的说法会更稳妥。"]}
{"word":"budgie","summary":{"en":"A budgie is a small pet parakeet, often brightly colored.","zh":"budgie 指常见的宠物小鹦鹉（虎皮鹦鹉），通常颜色鲜艳。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, colorful pet bird (a kind of parakeet) originally from Australia.","zh":"（常作宠物的）虎皮鹦鹉；小鹦鹉（原产澳大利亚）。"},"examples":[{"en":"My budgie loves to sit on my finger.","zh":"我的虎皮鹦鹉喜欢站在我的手指上。"},{"en":"She keeps two budgies in a cage by the window.","zh":"她在窗边的笼子里养了两只虎皮鹦鹉。"}]}],"synonyms":["parakeet","budgerigar"],"phonetic":"/ˈbʌdʒi/","extraExplanation":["“Budgie”是英式英语里非常常见的说法（完整名称来自“budgerigar”），美式英语里也能听到，但在美国更常用的词是“parakeet”（小长尾鹦鹉/鹦鹉的一类）。","发音与拼写提示：budgie 里的 -gie 发 /dʒi/，读起来像“BUJ-ee”。"]}
{"word":"budgies","summary":{"en":"“Budgies” are small pet parrots (budgerigars), famous for chirping and sometimes copying speech.","zh":"“Budgies”指虎皮鹦鹉（budgerigar）的复数，是常见的小型宠物鹦鹉，以鸣叫和模仿声音著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small, colorful pet parrots (budgerigars), often kept in cages and known for chirping and mimicking sounds.","zh":"虎皮鹦鹉（budgerigar）的复数；一种体型小、色彩鲜艳、常被当作宠物饲养的鹦鹉，因爱鸣叫、会模仿声音而出名。"},"examples":[{"en":"My aunt keeps two budgies in the living room, and they sing every morning.","zh":"我阿姨在客厅养了两只虎皮鹦鹉，它们每天早上都会唱（叫）。"},{"en":"Budgies can learn simple words if you talk to them often.","zh":"如果你经常和它们说话，虎皮鹦鹉能学会一些简单的词。"},{"en":"We bought fresh seed mix and a cuttlebone for the budgies.","zh":"我们给虎皮鹦鹉买了新鲜的混合鸟食和墨鱼骨。"}]}],"synonyms":["budgerigars","budgies (plural form)","parakeets (broader category)"],"phonetic":"/ˈbʌdʒiz/","extraExplanation":["“budgie”是英式英语里很常用的口语说法，完整名称是“budgerigar”。在美式英语中也能用“budgie”，但有时会更常看到“parakeet（长尾小鹦鹉）”；不过“parakeet”是更大的类别，budgie只是其中最常见的一种。","词源来自澳大利亚原住民语言（如Gamilaraay语）中的“betcherrygah/ budgerigar”等形式，原意常被解释为“好吃的食物/好吃”等（不同资料说法略有差异）。","常见搭配：a pair of budgies（一对虎皮鹦鹉）、budgie cage（鸟笼）、budgie seed（鸟食）、teach a budgie to talk（教虎皮鹦鹉说话）。"]}
{"word":"budging","summary":{"en":"“Budging” means moving slightly (often with effort) or changing a decision/opinion, especially in “not budging.”","zh":"“Budging” 指（费力）稍微移动，或改变决定/观点，常见于 “not budging（不动/不让步）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"moving (or causing something to move) slightly from a position, often with effort; the -ing form of “budge.”","zh":"（使）稍微移动；常含“费力才动一点”的意思；是 budge 的 -ing 形式。"},"examples":[{"en":"The door is stuck and it isn’t budging.","zh":"门卡住了，怎么推都不动。"},{"en":"She kept budging the chair closer to the table.","zh":"她不停把椅子一点点往桌子那边挪。"}]},{"partOfSpeech":"v.","definition":{"en":"changing your opinion or decision; often used in negatives like “not budging.”","zh":"改变观点或决定（常用于否定，如 not budging，表示“寸步不让/不改主意”）。"},"examples":[{"en":"I asked again, but my parents weren’t budging on the curfew.","zh":"我又问了一次，但爸妈对宵禁时间一点也不让步。"},{"en":"He’s budging a little, so we might reach an agreement.","zh":"他稍微松口了，我们也许能达成协议。"}]}],"synonyms":["moving","shifting","nudging","yielding","giving in"],"phonetic":"/ˈbʌdʒɪŋ/","extraExplanation":["口语里 “won’t/isn’t budging” 很常见：既可以指东西“纹丝不动”，也可以指人“态度不变”。判断含义主要看宾语：door/box 多半是“移动”；rules/price/decision 多半是“让步/改变”。","“budge” 常带有“动一点都不容易”的语感，所以比 move 更强调阻力或僵持。"]}
{"word":"budgy","summary":{"en":"Budgy = an informal word for a budgerigar (budgie), a common pet parakeet.","zh":"budgy 是虎皮鹦鹉（budgerigar/budgie）的非正式说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, mainly Australian/British) A budgerigar; a small, brightly colored parakeet often kept as a pet.","zh":"（非正式，多用于澳大利亚/英式英语）虎皮鹦鹉；一种常见的家养小型、颜色鲜艳的长尾鹦鹉。"},"examples":[{"en":"We have a budgy that loves to mimic phone sounds.","zh":"我们养了一只虎皮鹦鹉，它很爱模仿手机的声音。"},{"en":"The kids named their budgy “Sunny.”","zh":"孩子们把他们的虎皮鹦鹉取名叫“Sunny”。"},{"en":"She grew up with a budgy in the living room.","zh":"她从小就在客厅里养着一只虎皮鹦鹉。"}]}],"synonyms":["budgie","budgerigar","parakeet"],"phonetic":"/ˈbʌdʒi/","extraExplanation":["“budgy”也常拼作“budgie”，是“budgerigar”的口语缩写；在美式英语里更常直接说“parakeet（长尾小鹦鹉）”。","“budgerigar”源自澳大利亚原住民语言（常被认为来自Gamilaraay语），意思与“好吃的食物/好吃”有关；这种鸟原产澳大利亚。"]}
{"word":"Budh","summary":{"en":"Budh is a South Asian term referring to Mercury (and its associated deity) and, in some languages, Wednesday.","zh":"Budh 是南亚语境中的词，主要指水星（及其相关神祇），在一些语言中也可指星期三。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(South Asian usage) In Hindu tradition and Indian astrology, Budh is the name of the planet Mercury and a deity associated with Mercury.","zh":"（南亚语境）在印度教传统与印度占星中，Budh 是“水星”的名称，也指与水星相关的神祇。"},"examples":[{"en":"In Vedic astrology, Budh is linked with communication and learning.","zh":"在吠陀占星中，Budh 常与沟通和学习相关。"},{"en":"The chart shows a strong Budh (Mercury) placement.","zh":"这张星盘显示 Budh（即水星）的位置很强。"}]},{"partOfSpeech":"other","definition":{"en":"In some Indian languages, Budh can refer to Wednesday (the day associated with Mercury).","zh":"在一些印度语言中，Budh 也可指“星期三”（与水星对应的一天）。"},"examples":[{"en":"Our appointment is on Budh (Wednesday).","zh":"我们的预约在 Budh（星期三）。"},{"en":"He fasts on Budh to honor Mercury.","zh":"他在 Budh（星期三）禁食以敬奉水星。"}]}],"synonyms":["Mercury","Budha"],"phonetic":"/bʊd/","extraExplanation":["英语里更常见的拼写是 **Budha**（也写作 **Budh**）来指“水星/水星神”，不要和 **Buddha**（佛陀，常见拼写与读音不同）混淆。","如果你想查的是英文常用词 **bud**（花蕾/发芽/伙伴）或 **Buddha**（佛陀），告诉我你想要的意思与语境，我可以给你对应的词条。"]}
{"word":"budh","summary":{"en":"Budh is a South Asian term/name most commonly referring to Mercury (the planet/deity), and it can also be used as a personal name.","zh":"Budh 多见于南亚语境，最常指“水星（及其神祇）”，也可用作人名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"In Indian astronomy and Hindu tradition, Budh is the name for the planet Mercury (and the deity associated with it).","zh":"在印度天文学与印度教传统中，Budh 指“水星”，也可指与水星相关的神祇（布陀/布德）。"},"examples":[{"en":"In Vedic astrology, Budh is linked with communication and learning.","zh":"在吠陀占星学中，Budh 常与沟通和学习能力相关。"},{"en":"Budh is the Sanskrit/Hindi name used for the planet Mercury.","zh":"Budh 是梵语/印地语里对“水星”的称呼。"}]},{"partOfSpeech":"other","definition":{"en":"A personal name (especially in South Asian contexts), often derived from the same root as the word for Mercury.","zh":"人名（常见于南亚语境），常与“水星”这一名称同源。"},"examples":[{"en":"His first name is Budh.","zh":"他的名字叫 Budh。"}]}],"synonyms":["Mercury"],"phonetic":"/bʊd/","extraExplanation":["“Budh”在英语里不算常见词，更多是对梵语/印地语“बुध / बुध (Budh)”的音译写法。不同英文写法（如 Budh / Budha / बुध）可能指向不同词：Budh 通常与“水星”相关；而 Buddha（佛陀）是另一个词，含义不同，不要混淆。","在印度文化里，Budh（Mercury）也常出现在占星与宗教叙事中；星期三在印地语里叫“Budhvar（Budh + var/waar，意为星期三）”，也与水星的传统对应有关。"]}
{"word":"Budha","summary":{"en":"“Buddha” usually means the Buddha (Siddhartha Gautama) or, in everyday speech, a statue/image of him.","zh":"“Buddha”通常指佛陀（释迦牟尼），也可在日常口语中指佛像/佛陀形象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Often capitalized) The Buddha: the title given to Siddhartha Gautama, the founder of Buddhism; also used for someone regarded as fully “awakened” or enlightened.","zh":"（常大写）佛陀：对释迦牟尼（悉达多·乔达摩）的尊称，佛教的创立者；也可泛指被认为已“觉悟/开悟”的人。"},"examples":[{"en":"Many Buddhists honor the Buddha as a teacher who showed the path to awakening.","zh":"许多佛教徒尊敬佛陀，认为他是一位指引觉悟之道的导师。"},{"en":"The statue represents the Buddha sitting in meditation.","zh":"这尊雕像表现的是佛陀结跏趺坐、入定禅修的形象。"}]},{"partOfSpeech":"n.","definition":{"en":"A statue, image, or depiction of the Buddha (common in everyday speech).","zh":"（口语常用）佛像；佛陀的雕像或图像。"},"examples":[{"en":"They placed a small Buddha on the shelf as decoration.","zh":"他们在架子上摆了一尊小佛像作装饰。"},{"en":"Please handle the Buddha carefully; it’s fragile.","zh":"请小心拿这尊佛像，它很脆。"}]}],"synonyms":["the Buddha","Buddha statue","Buddha image"],"phonetic":"/ˈbuːdə/","extraExplanation":["“Budha”更常见是拼写错误；标准拼写通常是“Buddha”。在英语里它既可以指历史人物（释迦牟尼），也可泛指“觉者/觉悟者”。","在谈论宗教与文化时，使用大写“the Buddha”通常更尊重且更明确；小写“a buddha”多用于泛指“觉者”。在描述佛像时，有些语境会直接说“a Buddha”（指佛像），但在正式写作中也可用“a Buddha statue/image”更清楚。"]}
{"word":"budless","summary":{"en":"“Budless” means having no buds, often describing plants in winter; it can also metaphorically mean lacking growth or promise.","zh":"“budless”指没有花芽/芽（常形容冬季植物），也可比喻缺乏成长、希望或新开端。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no buds (especially on a plant or tree); not producing buds.","zh":"（尤指植物或树）没有花芽/芽；不长芽的。"},"examples":[{"en":"The budless branches showed that spring hadn’t arrived yet.","zh":"光秃秃、没有芽的树枝说明春天还没到。"},{"en":"After the harsh winter, some shrubs stayed budless for weeks.","zh":"经历严冬后，有些灌木好几周都不发芽。"}]},{"partOfSpeech":"adj.","definition":{"en":"Figurative: lacking signs of growth, promise, or new beginnings.","zh":"（比喻）缺乏成长迹象、希望或新开端的；毫无生机的。"},"examples":[{"en":"The project felt budless—no new ideas, no progress.","zh":"这个项目感觉毫无生机——没有新点子，也没有进展。"},{"en":"He described the town as budless, stuck in the past.","zh":"他形容这座小镇毫无生气，被过去困住了。"}]}],"synonyms":["without buds","bare","leafless","barren","unproductive"],"phonetic":"/ˈbʌdləs/","extraExplanation":["“budless”由 bud（芽、花苞）+ -less（无……的）构成，常见于植物描写，也偶尔用于诗歌或文学中营造“尚未复苏、仍在冬季”的氛围。","和 bare（光秃的）、leafless（无叶的）语义接近：budless 强调“芽/花苞的缺失”，leafless 强调“叶子的缺失”。"]}
{"word":"budlet","summary":{"en":"“Budlet” means a small or tiny bud on a plant.","zh":"“budlet”指植物上的“小芽/嫩芽”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small bud; a tiny developing plant shoot (a diminutive of “bud”)","zh":"小芽；嫩芽（“bud”的指小形式）"},"examples":[{"en":"In early spring, each budlet on the branch begins to swell.","zh":"初春时，枝条上的每个小芽都开始膨大。"},{"en":"Look closely and you can see budlets forming at the tips of the stems.","zh":"仔细看，你会发现茎尖正在形成小芽。"}]}],"synonyms":["small bud","tiny bud","sprout (related)","shoot (related)"],"phonetic":"/ˈbʌdlət/","extraExplanation":["“budlet”属于较少见、偏文学或植物描写的用词。常见表达通常直接用“small bud / tiny bud”。","词尾“-let”在英语里常表示“较小的……”，如：booklet（小册子）、leaflet（传单/小叶）、piglet（小猪）。因此 bud + let = “小芽”。"]}
{"word":"budlike","summary":{"en":"“Budlike” describes something that looks like a bud—small, rounded, and not fully opened or developed.","zh":"“budlike”用来形容某物“像花蕾/嫩芽一样”——小而圆、尚未展开或发育完全。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a bud (a small, unopened flower or new plant growth); small, rounded, and not yet fully developed.","zh":"像花蕾的；像嫩芽的；小而圆、尚未完全发育的。"},"examples":[{"en":"The plant has budlike tips in early spring.","zh":"这株植物在早春会长出像花蕾一样的尖端。"},{"en":"She wore a ring with a budlike pearl design.","zh":"她戴着一枚戒指，上面的珍珠设计像小花蕾。"}]}],"synonyms":["bud-shaped","budlike","unopened","nascent","incipient"],"phonetic":"/ˈbʌdˌlaɪk/","extraExplanation":["“budlike”是由“bud（花蕾/嫩芽）+ -like（像……一样的）”构成的形容词，常见于植物学描述、园艺写作或形容小而圆、未展开的形状（也可用于艺术/设计语境）。","在文学或描写性写作中，它常带有“含苞待放、尚未成熟、充满潜力”的联想（既可指外形，也可暗示发展阶段）。"]}
{"word":"budling","summary":{"en":"“Building” most commonly means a structure (a building), and it can also mean the act of creating/developing something over time.","zh":"“building”最常见意思是“建筑物”，也可指“建立/培养某事物的过程”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A structure with walls and a roof, such as a house, school, or office.","zh":"建筑物；楼房（有墙和屋顶的结构，如房子、学校或办公室）"},"examples":[{"en":"That building is over 100 years old.","zh":"那栋建筑有一百多年历史了。"},{"en":"Our office is in the tall building next to the station.","zh":"我们的办公室在车站旁边那栋高楼里。"}]},{"partOfSpeech":"v.","definition":{"en":"The process of making or developing something over time (often used with an object, like skills or trust).","zh":"建立；培养；发展（常接宾语，如技能、信任等）"},"examples":[{"en":"She is building her confidence little by little.","zh":"她在一点一点建立自信。"},{"en":"They spent years building a strong team.","zh":"他们花了多年建立一支强大的团队。"}]},{"partOfSpeech":"adj.","definition":{"en":"Increasing or growing gradually (often used before a noun: building pressure/tension).","zh":"逐渐增强的；逐步累积的（常用于名词前：逐渐增大的压力/紧张）"},"examples":[{"en":"There was building tension in the room.","zh":"房间里的紧张气氛在逐渐加剧。"},{"en":"Building excitement spread through the crowd.","zh":"人群中的兴奋感逐渐蔓延开来。"}]}],"synonyms":["structure","construction","develop","create","establish"],"phonetic":"/ˈbɪldɪŋ/","extraExplanation":["“budling”通常不是标准英文拼写。最常见的可能是拼错了“building”（建筑物/建立）。如果你本来想表达“budding”（萌芽的；崭露头角的），告诉我语境我可以再为你解释。"]}
{"word":"budmash","summary":{"en":"“Budmash” means a ruffian/troublemaker, or (informally) mischievous and rowdy, mainly used in South Asian English.","zh":"“budmash”主要用于南亚英语，意思是“流氓/爱惹事的人”，也可口语指“顽皮、闹腾”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a ruffian or troublemaker; a person who behaves in a rough, lawless, or bullying way (Indian English; from Hindi/Urdu)","zh":"（印度英语；源自印地语/乌尔都语）流氓、混混；爱惹事、粗暴或带点欺凌气的人"},"examples":[{"en":"The shopkeeper chased away a group of budmash boys who were harassing customers.","zh":"店主把一群骚扰顾客的混混男孩赶走了。"},{"en":"He used to be a budmash in the neighborhood, but he changed after he got a steady job.","zh":"他以前在社区里是个爱惹事的混混，但有了稳定工作后就变了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) mischievous or rowdy; acting like a troublemaker","zh":"（非正式）顽皮的、闹腾的；带点“混混样”的"},"examples":[{"en":"Don’t be budmash—stop throwing stones at the dogs.","zh":"别这么顽皮捣乱——别再朝狗扔石头了。"},{"en":"The kids got a bit budmash after dinner and wouldn’t sit still.","zh":"孩子们晚饭后有点闹腾，怎么都坐不住。"}]}],"synonyms":["troublemaker","ruffian","hooligan","thug","bully"],"phonetic":"/ˈbʊd.mɑʃ/","extraExplanation":["“Budmash”常见于印度/巴基斯坦语境，语气从“顽皮捣蛋”到“地痞流氓”不等，取决于说话人的态度与场合；在正式英语里通常会用“thug / hooligan / troublemaker”等替代。","在跨文化交流中，这个词可能带有贬义或标签化色彩；若不确定对方感受，用更中性的表达（如“rowdy”或“troublesome”）会更稳妥。"]}
{"word":"Budorcas","summary":{"en":"Budorcas is the scientific genus name for takins.","zh":"Budorcas 是“羚牛（takin）”的科学属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific genus name for the takins—large, goat-antelope-like mammals found in the Himalayan and nearby regions.","zh":"鬣羚属（学名 Budorcas）：对“羚牛（takin）”这一类大型偶蹄类动物的属名，外形类似山羊与羚羊，分布于喜马拉雅及其周边地区。"},"examples":[{"en":"Budorcas taxicolor is the scientific name of the takin species most often discussed in wildlife books.","zh":"Budorcas taxicolor 是野生动物书籍中最常被提到的羚牛物种的学名。"},{"en":"In a museum label, you might see “Genus: Budorcas” next to a takin specimen.","zh":"在博物馆的标牌上，你可能会在羚牛标本旁看到“属：Budorcas”。"}]}],"synonyms":["takin (common name)"],"phonetic":"/buːˈdɔːrkəs/","extraExplanation":["Budorcas 属于生物分类学中的“拉丁学名”，常见于论文、图鉴、动物园/博物馆标注中；日常英语交流更常说 takin（羚牛）。","在科学写作里，属名 Budorcas 通常首字母大写并用斜体（如 *Budorcas*）；物种名则是“属名 + 种加词”（如 *Budorcas taxicolor*）。"]}
{"word":"budorcas","summary":{"en":"Budorcas is the scientific genus name for the takin, a large mountain-dwelling goat-antelope.","zh":"Budorcas 是羚牛（takin）的科学属名，指一种生活在山地的大型羊羚类动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of large, shaggy, goat-antelopes (the takins) native to the mountains of Asia.","zh":"鬣羚属（也称“羚牛属”）：一种生活在亚洲山地的大型、毛长的“羊羚类”动物属（羚牛/takin 所属的属）。"},"examples":[{"en":"The takin’s scientific genus is Budorcas.","zh":"羚牛的科学属名是 Budorcas。"},{"en":"Budorcas animals live in steep mountain forests and alpine areas.","zh":"Budorcas 属的动物生活在陡峭的山地森林和高山地区。"}]}],"synonyms":["takin","genus Budorcas"],"phonetic":"/bjuːˈdɔːrkəs/","extraExplanation":["Budorcas 是一个拉丁化的科学名称，常见于动物学/生物学语境；日常英语里更常说 takin（羚牛）。","分类上，Budorcas 通常被归入牛科（Bovidae），和山羊、绵羊、羚羊等有亲缘关系；外形像“牛+羊/山羊”的混合体，因此有时会被描述为 goat-antelope（羊羚类）。"]}
{"word":"buds","summary":{"en":"“Buds” most commonly means plant buds; it can also mean earbuds (headphones) or, informally, friends.","zh":"“buds”最常指植物的芽/花苞；也可指入耳式耳机；口语里还可指朋友们（哥们儿）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small undeveloped parts of a plant (especially flowers or leaves) that will grow into a flower, leaf, or branch.","zh":"（植物的）芽；（尤指）花苞、叶芽（尚未开放/长成的部分）。"},"examples":[{"en":"The roses are covered in buds, so they should bloom soon.","zh":"玫瑰上全是花苞，所以应该很快就会开花。"},{"en":"In early spring, the trees start to form new buds.","zh":"早春时，树开始长出新芽。"}]},{"partOfSpeech":"n.","definition":{"en":"Small headphone pieces (earbuds) that fit in your ears; also used for wireless earbuds.","zh":"（入耳式）耳机；（也常指）无线耳机。"},"examples":[{"en":"I forgot my earbuds, so I can’t listen to music on the train.","zh":"我忘了带耳机，所以在火车上没法听音乐。"},{"en":"Her buds connected automatically to her phone.","zh":"她的耳机自动连接上了手机。"}]},{"partOfSpeech":"n.","definition":{"en":"Informal: friends or close companions (plural of “bud”).","zh":"【非正式】朋友们；哥们儿（“bud”的复数）。"},"examples":[{"en":"I’m going camping this weekend with my buds.","zh":"这个周末我要和哥们儿去露营。"},{"en":"He met up with his old buds after work.","zh":"下班后他去和老朋友们聚了一下。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular form of “bud”: to start to grow (a bud forms on a plant).","zh":"“bud”的第三人称单数：发芽；长出花苞/新芽。"},"examples":[{"en":"In March, the branches bud and turn green again.","zh":"三月时，树枝开始发芽，又变绿了。"}]}],"synonyms":["flower buds","sprouts","shoots","earbuds","friends","pals","buddies"],"phonetic":"/bʌdz/","extraExplanation":["“bud”既可以指植物的“芽/花苞”，也可作称呼表示“朋友、哥们儿”。在口语里“my buds”通常指一群朋友。","“earbuds”本来特指入耳式耳机；日常对话里也常直接把耳机简称为“buds”（尤其在谈无线耳机时）。"]}
{"word":"budtime","summary":{"en":"Budtime usually means the season or period when plants form buds; informally it can also refer to a time connected with cannabis “buds.”","zh":"Budtime 通常指植物开始长出芽或花蕾的时期；在非正式用法中也可能指与大麻“花”相关的时间。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The time when a plant begins to form buds (early stage before flowers open).","zh":"（植物）开始长出花蕾/芽的时期（开花前的早期阶段）。"},"examples":[{"en":"In early spring, budtime arrives and the trees start to wake up.","zh":"早春到了发芽期，树木开始苏醒。"},{"en":"The gardener checked the roses at budtime to prevent pests.","zh":"园丁在玫瑰长花蕾的时候检查虫害。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) A time associated with cannabis “buds,” sometimes used in advertising or slang to mean a time to enjoy or buy cannabis flower.","zh":"（非正式/俚语）与大麻“花”（buds）相关的时间；有时用于广告或口语中，指适合购买或享用大麻花的时段。"},"examples":[{"en":"The shop posted a sign: “Budtime specials after 5 PM.”","zh":"店里贴了牌子：“下午五点后 Budtime 特价。”"},{"en":"He joked that it was budtime, meaning it was time to relax.","zh":"他开玩笑说到“budtime”了，意思是该放松一下。"}]}],"synonyms":["budding season","budding time","bud season","time when buds appear"],"phonetic":"/ˈbʌdtaɪm/","extraExplanation":["“budtime”不是非常常见的标准词，更常见的表达是 the budding season / the time when buds appear。园艺语境里通常直译为“发芽期/花蕾期”。","在部分地区（尤其北美），“bud”也可指大麻花，因此“budtime”在广告、店铺促销或俚语里可能带有大麻相关含义。使用时要注意场合与当地法律文化。"]}
{"word":"buduc","summary":{"en":"“buduc” isn’t a recognized English word; its meaning depends on context (often a typo or name).","zh":"“buduc”不是常见英语单词；含义需看上下文（多为拼写错误或名称）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a typo, a username, a brand name, or an acronym (so the meaning depends on context).","zh":"不是标准英语单词。可能是拼写错误、用户名、品牌名或缩写（含义取决于语境）。"},"examples":[{"en":"I can’t find “buduc” in an English dictionary—could you share the sentence it appears in?","zh":"我在英语词典里找不到“buduc”——你能把它出现的句子发我吗？"},{"en":"If you meant “buddha” or “bud,” the meaning will be different.","zh":"如果你想写的是“buddha（佛陀）”或“bud（花苞/朋友）”，意思会不一样。"}]}],"phonetic":"/ˈbuːdʌk/","extraExplanation":["“buduc”看起来更像是拼写误差或特定领域用语。你可以告诉我它来自哪里（聊天、游戏、论文、产品名等）或给我上下文句子，我就能更准确判断。","如果你是想查某个更常见的英文词，可能接近的拼写有：bud（花苞/朋友）、Buddhist（佛教的）、Buddha（佛陀）、budget（预算）、Bucharest（布加勒斯特，地名）等。"]}
{"word":"Budukh","summary":{"en":"Budukh refers to the Budukh people (an ethnic group), their language, or anything related to their culture.","zh":"Budukh 指布都赫人（一个民族）、布都赫语，或与其文化相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Budukh people, a small ethnic group traditionally living in northeastern Azerbaijan (especially around the village of Buduq).","zh":"布都赫人（Budukh people）：主要传统居住在阿塞拜疆东北部（尤其在布杜克村 Buduq 一带）的一个小型民族的成员。"},"examples":[{"en":"The Budukh have a long history in the mountains of northeastern Azerbaijan.","zh":"布都赫人在阿塞拜疆东北部的山地有着悠久的历史。"},{"en":"A researcher interviewed Budukh community members about local traditions.","zh":"一位研究者采访了布都赫社区成员，了解当地传统。"}]},{"partOfSpeech":"n.","definition":{"en":"the Budukh language, a Northeast Caucasian language spoken by the Budukh people.","zh":"布都赫语：由布都赫人使用的一种东北高加索语系语言。"},"examples":[{"en":"Some elders still speak Budukh at home.","zh":"一些年长者在家里仍然说布都赫语。"},{"en":"The Budukh language is considered endangered.","zh":"布都赫语被认为处于濒危状态。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Budukh people or their language and culture.","zh":"布都赫的；与布都赫人、其语言或文化有关的。"},"examples":[{"en":"They recorded Budukh folk songs for an archive.","zh":"他们为档案馆录制了布都赫民歌。"},{"en":"Budukh cultural practices are closely tied to local village life.","zh":"布都赫文化习俗与当地村落生活紧密相连。"}]}],"synonyms":["Buduq (variant spelling)"],"phonetic":"/buˈdʊk/","extraExplanation":["“Budukh”在英文里多作专有名词使用，也常见另一种拼写“Buduq”（对应阿塞拜疆的村名）。","布都赫语属于东北高加索语系（也常称纳赫-达吉斯坦语族的一部分）。在语言保护与田野调查的语境中，这个词会更常出现。"]}
{"word":"Budukha","summary":{"en":"“Budukha” isn’t a standard English word; it may be a misspelling/transliteration, often confused with “Buddha.”","zh":"“Budukha”不是标准英语词；可能是误拼或音译形式，常被误认为“Buddha（佛陀）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or rare spelling/transliteration that is not commonly recognized as an English word; it may be a misspelling of “Buddha.”","zh":"一种不常见的拼写或音译形式，在英语里并不常作为词使用；可能是对“Buddha（佛陀）”的误拼。"},"examples":[{"en":"I couldn’t find “Budukha” in an English dictionary—did you mean “Buddha”?","zh":"我在英语词典里找不到“Budukha”——你是不是想写“Buddha（佛陀）”？"},{"en":"If “Budukha” is a name from another language, please tell me the context or sentence.","zh":"如果“Budukha”是来自其他语言的人名/地名，请给我上下文或完整句子。"}]}],"synonyms":["Buddha (possible intended word)"],"phonetic":"/buːˈduːkə/","extraExplanation":["“Budukha”更像是拼写错误或某种语言的音译变体。英语中最接近、最常见的词是“Buddha”（佛陀），常指释迦牟尼佛，也可泛指“觉悟者”。","如果你能提供：1）它出现的句子；2）来源（书名/歌曲/游戏/地名等）；3）你想表达的意思（宗教人物、地名、人名），我可以帮你确定正确拼写与准确含义。"]}
{"word":"budukha","summary":{"en":"Budukha is an uncommon English term, usually a variant spelling of Budukh, referring to the Budukh people (and related language/culture) in northeastern Azerbaijan.","zh":"Budukha 在英语中不常见，通常是 Budukh（布杜赫）的另一种拼写，用来指阿塞拜疆东北部的布杜赫族及其相关语言与文化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person belonging to the Budukh (Budukha) ethnic group from northeastern Azerbaijan","zh":"布杜赫（Budukh/Budukha）族人；来自阿塞拜疆东北部布杜赫族的成员"},"examples":[{"en":"A Budukha elder shared stories about life in the Caucasus mountains.","zh":"一位布杜赫族长者分享了在高加索山区生活的故事。"},{"en":"Researchers recorded traditional songs sung by Budukha communities.","zh":"研究人员录制了布杜赫族社区传唱的传统歌曲。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Budukh (Budukha) people or their language and culture","zh":"与布杜赫族（Budukha）及其语言、文化有关的"},"examples":[{"en":"They studied Budukha vocabulary and pronunciation.","zh":"他们研究了布杜赫语的词汇和发音。"},{"en":"The museum displayed Budukha clothing and household items.","zh":"博物馆展出了布杜赫族的服饰和生活用品。"}]}],"synonyms":["Budukh","Budukh people","Budukh language"],"phonetic":"/buˈduːkə/","extraExplanation":["“Budukha”在英语里很少见，更多是对“Budukh（布杜赫）”的另一种拼写，用来指一个居住在阿塞拜疆东北部（靠近高加索山区）的少数族群及其语言。","如果你本来想查的是常见英语词，可能是拼写接近的“Buddha（佛陀）”。你可以告诉我你的语境（句子/主题），我可以帮你确认。"]}
{"word":"Buduma","summary":{"en":"Buduma refers to a people around Lake Chad and the language they speak.","zh":"Buduma 指乍得湖周边的布杜马民族，也可指他们使用的布杜马语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an ethnic group living mainly around Lake Chad (especially in Chad and northeastern Nigeria).","zh":"布杜马人：主要居住在乍得湖周边（尤其是乍得和尼日利亚东北部）的一个民族的成员。"},"examples":[{"en":"The Buduma traditionally lived on islands and along the shores of Lake Chad.","zh":"布杜马人传统上居住在乍得湖的岛屿上和湖岸附近。"},{"en":"A local guide explained Buduma fishing practices to visitors.","zh":"一位当地向导向游客讲解了布杜马人的捕鱼方式。"}]},{"partOfSpeech":"n.","definition":{"en":"the language traditionally spoken by the Buduma people.","zh":"布杜马语：布杜马人传统使用的语言。"},"examples":[{"en":"Some elders still speak Buduma at home.","zh":"一些长者在家里仍然说布杜马语。"},{"en":"The researcher collected a short word list in Buduma.","zh":"研究者采集了一份简短的布杜马语词表。"}]}],"synonyms":["Yedina","Buduma people","Buduma language"],"phonetic":"/buːˈduːmə/","extraExplanation":["“Buduma”是一个专名（proper noun），常见于人类学、地理与语言学语境；在新闻或学术写作中有时也会用其他名称（如“Yedina”）来指称同一群体，具体用法取决于地区与资料来源。","发音在不同英语资料里可能略有差异；读作类似“boo-DOO-muh”的重音节奏最常见。"]}
{"word":"buduma","summary":{"en":"Buduma refers to an ethnic group around Lake Chad and the language they speak.","zh":"Buduma 指乍得湖周边的布杜马民族，也可指他们所说的布杜马语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of an ethnic group living mainly around Lake Chad (in Chad, Nigeria, Niger, and Cameroon).","zh":"布杜马人：主要生活在乍得湖周边（乍得、尼日利亚、尼日尔、喀麦隆一带）的一个民族的成员。"},"examples":[{"en":"The Buduma have traditionally lived on the islands and shores of Lake Chad.","zh":"布杜马人传统上生活在乍得湖的岛屿和湖岸地带。"},{"en":"A local guide explained Buduma fishing practices to visitors.","zh":"一位当地向导向游客介绍了布杜马人的捕鱼方式。"}]},{"partOfSpeech":"n.","definition":{"en":"the language spoken by the Buduma people (often classified within the Saharan branch of the Nilo-Saharan languages).","zh":"布杜马语：布杜马人所说的语言（常被归入尼罗-撒哈拉语系中的撒哈拉语支）。"},"examples":[{"en":"She is learning Buduma to communicate with elders in the community.","zh":"她正在学习布杜马语，以便与社区里的长者交流。"},{"en":"The researcher recorded stories in Buduma and translated them into French.","zh":"研究者用布杜马语录下故事，并把它们翻译成法语。"}]}],"synonyms":["Yedina"],"phonetic":"/buˈduːmə/","extraExplanation":["“Buduma”在一些资料中也写作与之相关的称呼，如“Yedina”。由于不同语言与拼写系统的转写差异，你可能会在地图、学术文章或新闻中看到不同拼法。","在英语写作中通常首字母大写（Buduma），因为它是民族/语言名称。用于语言时也常写作“Buduma (language)”以避免歧义。"]}
{"word":"Budweis","summary":{"en":"Budweis is the German name for the Czech city České Budějovice, historically linked to brewing.","zh":"Budweis 是捷克城市「České Budějovice（捷克布傑約維采）」的德語名，歷史上與啤酒釀造密切相關。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A German name for the Czech city České Budějovice, in South Bohemia; known historically for brewing.","zh":"捷克南波希米亞城市「České Budějovice（捷克布傑約維采）」的德語名；歷史上以釀造啤酒聞名。"},"examples":[{"en":"Budweis (České Budějovice) is famous for its long brewing tradition.","zh":"Budweis（České Budějovice）以悠久的釀酒傳統聞名。"},{"en":"He took a train from Prague to Budweis for a weekend trip.","zh":"他從布拉格搭火車去 Budweis 週末旅行。"}]}],"synonyms":["České Budějovice"],"phonetic":"/ˈbʊdvaɪs/","extraExplanation":["「Budweis」多見於德語或英語的歷史／旅行語境中；在捷克語裡城市名是「České Budějovice」。","與啤酒相關的文化背景：形容詞「Budweiser」原意是「來自 Budweis 的」。因此它與「Budweiser」商標在歐洲與美國長期存在名稱／商標權爭議（美國的 Budweiser 與捷克 Budějovický Budvar 兩家品牌在不同市場使用不同名稱）。"]}
{"word":"Budweiser","summary":{"en":"Budweiser is a well-known American lager beer brand, commonly nicknamed “Bud.”","zh":"Budweiser（百威）是著名的美国拉格啤酒品牌，常被简称为“Bud”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A famous American brand of lager beer, often called “Bud.”","zh":"百威（Budweiser）：美国著名的拉格啤酒品牌，常被简称为“Bud（百威/巴德）”。"},"examples":[{"en":"He ordered a Budweiser at the bar.","zh":"他在酒吧点了一瓶百威。"},{"en":"Budweiser is often seen in sports ads and sponsorships in the U.S.","zh":"在美国，百威经常出现在体育广告和赞助中。"}]}],"synonyms":["Bud (nickname)","lager (type of beer)"],"phonetic":"/ˈbʌdˌwaɪzɚ/","extraExplanation":["“Budweiser”是专有名词（品牌名）。在日常口语里，美国人常说“a Bud”来指一瓶/一罐百威。","它与捷克的城市“Budweis”（现名České Budějovice）有关：历史上“Budweiser”有“来自Budweis的”之意，因此在不同国家曾出现商标与命名争议。"]}
{"word":"Budwig","summary":{"en":"Budwig most often refers to the “Budwig diet/protocol,” a nutrition plan associated with Johanna Budwig; it is also a German surname.","zh":"Budwig多指“布德维格饮食/方案”，与约翰娜·布德维格相关；也可作德国姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(usually in “Budwig diet/protocol”) A nutritional regimen popularized by German biochemist Johanna Budwig, typically emphasizing flaxseed oil mixed with cottage cheese or quark, along with other dietary rules.","zh":"（多用于“Budwig diet/protocol”）由德国生物化学家约翰娜·布德维格（Johanna Budwig）推广的一种饮食方案，常以亚麻籽油与茅屋奶酪/凝乳（quark）混合食用为核心，并配合其他饮食规则。"},"examples":[{"en":"Some wellness blogs recommend the Budwig diet for general health, though evidence varies.","zh":"一些健康博客推荐布德维格饮食用于日常保健，但证据强弱不一。"},{"en":"Before starting the Budwig protocol, she asked her doctor about possible risks and interactions.","zh":"在开始布德维格方案之前，她先咨询了医生是否有风险或与药物相互作用。"}]},{"partOfSpeech":"n.","definition":{"en":"A German surname, best known in English from Johanna Budwig’s name.","zh":"一个德国姓氏；在英语语境中最常见于“Johanna Budwig（约翰娜·布德维格）”这一人物姓名。"},"examples":[{"en":"Johanna Budwig is often cited in alternative nutrition discussions.","zh":"约翰娜·布德维格常被替代营养相关讨论引用。"}]}],"synonyms":["Budwig diet","Budwig protocol"],"phonetic":"/ˈbʊd.vɪɡ/","extraExplanation":["“Budwig”在英语里通常不是普通词汇，而是专有名词：一方面指人名（Johanna Budwig），另一方面借由“Budwig diet/protocol”指一种饮食流派。","关于健康功效的说法在不同来源中差异很大；如果涉及疾病治疗或与药物同用，通常建议以循证医学信息为主，并向合格医疗专业人士咨询。"]}
{"word":"budwood","summary":{"en":"Budwood is bud-bearing plant stem material used as scion wood for grafting.","zh":"Budwood 指用于嫁接的带芽枝条（芽木/接穗材料）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Wood (a small piece of stem) that carries buds and is cut from a plant to be used for grafting onto another plant (the rootstock).","zh":"芽接枝条（芽木）：从植物上剪下、带有芽的枝条（或小段茎），用于嫁接到另一株植物（砧木）上。"},"examples":[{"en":"The nursery collects budwood from disease-free trees to make new citrus plants.","zh":"苗圃会从无病害的树上采集芽木，用来繁殖新的柑橘苗。"},{"en":"Certified budwood helps prevent the spread of viruses during grafting.","zh":"使用认证芽木有助于在嫁接过程中防止病毒传播。"},{"en":"He wrapped the budwood tightly so the buds would stay moist until grafting day.","zh":"他把芽木包得很紧，让芽在嫁接当天之前保持湿润。"}]}],"synonyms":["scionwood","scion wood","graftwood"],"phonetic":"ˈbʌdˌwʊd","extraExplanation":["“budwood”常见于园艺与果树栽培语境，尤其是柑橘、苹果、葡萄等作物的无性繁殖。它与“rootstock（砧木）”配套使用：砧木提供根系与适应性，budwood提供想要的品种与果实特性。","在一些地区会强调“certified budwood（认证芽木）”，指经过检疫或检测、可降低病害（如病毒、黄龙病相关风险等）传播的繁殖材料。"]}
{"word":"budworm","summary":{"en":"A budworm is a plant-eating caterpillar that attacks buds and young growth, often harming crops or trees.","zh":"budworm 指吃植物花芽和嫩梢的毛虫类害虫，常危害农作物或树木。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a caterpillar (larva) that feeds on buds and young shoots of plants, often causing serious damage to crops or forests","zh":"芽虫；以植物花芽、嫩梢为食的毛虫（幼虫），常对农作物或森林造成严重危害"},"examples":[{"en":"Budworms can destroy a large part of a tobacco crop in a single season.","zh":"芽虫可能在一个生长季里毁掉烟草作物的大部分产量。"},{"en":"Foresters monitored budworm populations to protect the trees.","zh":"林业人员监测芽虫数量以保护树木。"}]}],"synonyms":["caterpillar","larva","plant pest"],"phonetic":"/ˈbʌdˌwɝm/","extraExplanation":["“budworm”不是单一物种的名字，而是一类害虫的俗称，常见的有“spruce budworm（云杉芽虫）”和“tobacco budworm（烟草芽虫）”。","构词很好理解：bud（花芽/芽）+ worm（虫）。这里的“worm”在日常英语里常被用来泛指“幼虫/毛虫”，不一定是真正的蠕虫。"]}
{"word":"budworms","summary":{"en":"Budworms are moth caterpillars that eat plant buds and flowers and can seriously damage crops and garden plants.","zh":"Budworms 指啃食植物花芽与花朵的蛾类幼虫，可能严重危害作物与园艺植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Caterpillars (larvae) of certain moths that feed on plant buds, flowers, and developing fruit, often damaging crops and garden plants.","zh":"（某些蛾类的）幼虫，啃食植物的花芽、花朵和幼果，常造成农作物或园艺植物受害。"},"examples":[{"en":"Budworms can ruin flower buds before they ever open.","zh":"芽虫会在花苞尚未开放前就把它们毁掉。"},{"en":"Farmers monitor budworms to protect cotton and tomatoes.","zh":"农民会监测芽虫，以保护棉花和番茄等作物。"},{"en":"If you see chewed buds and frass (insect droppings), budworms may be the cause.","zh":"如果你看到被啃坏的花苞和虫粪，罪魁祸首可能是芽虫。"}]}],"synonyms":["caterpillars","moth larvae","crop pests","garden pests"],"phonetic":"/ˈbʌdˌwɝːmz/","extraExplanation":["“budworm”在农业语境里是一个常用的统称，不一定指单一物种；不同地区可能指不同的蛾类幼虫。较常见的例子包括 tobacco budworm（烟草芽虫，Heliothis virescens）与 corn earworm（玉米穗虫，某些语境也会被归入“budworm”类害虫）。","园艺与农学资料中常把它们描述为“花芽/嫩果的咀嚼性害虫”，因为它们会钻入花苞或幼果内部取食，导致花苞不开、果实畸形或腐烂。"]}
{"word":"Budworth","summary":{"en":"“Budworth” is usually a British surname or an English place name (e.g., Great Budworth in Cheshire).","zh":"“Budworth”通常是英国姓氏，或英格兰的地名（如柴郡的 Great Budworth）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a British surname; also the name of places in England (most notably Great Budworth in Cheshire).","zh":"一个英国姓氏；也可作英格兰地名（最著名的是柴郡的 Great Budworth，“大巴德沃思”）。"},"examples":[{"en":"Dr. Budworth will see you now.","zh":"Budworth 医生现在会见你。"},{"en":"They visited Great Budworth while traveling in Cheshire.","zh":"他们在柴郡旅行时参观了 Great Budworth。"}]},{"partOfSpeech":"other","definition":{"en":"(by extension) something associated with the Budworth family or a Budworth-named place (e.g., a local business, estate, or event).","zh":"（引申）与 Budworth 家族或名为 Budworth 的地方相关的事物（如本地商铺、庄园或活动）。"},"examples":[{"en":"Budworth Hall hosts community meetings.","zh":"Budworth Hall 举办社区会议。"}]}],"synonyms":["(no direct synonyms; proper noun)"],"phonetic":"/ˈbʌdˌwɝθ/","extraExplanation":["“Budworth”在日常英语里不是常见词汇，多作为专有名词出现：要么是姓氏，要么是地名。读到它时，通常需要结合上下文判断是“某人”还是“某地”。","英国地名里常见“Great + 地名”（如 Great Budworth），其中“Great”常表示历史上较大/较重要的聚落，用来与附近较小的聚落区分（有时会出现与之对应的“Little ...”）。"]}
{"word":"Budyonnovsk","summary":{"en":"Budyonnovsk is a town in southern Russia (Stavropol Krai).","zh":"布琼诺夫斯克是俄罗斯南部（斯塔夫罗波尔边疆区）的一座城镇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A town in Stavropol Krai, southern Russia, known historically for its strategic location in the North Caucasus region.","zh":"布琼诺夫斯克：俄罗斯南部斯塔夫罗波尔边疆区的一座城镇，位于北高加索地区，因其地理位置而具有一定历史与战略意义。"},"examples":[{"en":"Budyonnovsk is located in Stavropol Krai in southern Russia.","zh":"布琼诺夫斯克位于俄罗斯南部的斯塔夫罗波尔边疆区。"},{"en":"The report mentioned Budyonnovsk as a stop along the regional route.","zh":"报道提到布琼诺夫斯克是这条地区路线上的一站。"}]}],"synonyms":["a town in Stavropol Krai","Budyonnovsk (place name)"],"phonetic":"/buːˈdjɑːnəfsk/","extraExplanation":["“Budyonnovsk”常见于历史与新闻语境，尤其与1995年的“布琼诺夫斯克人质事件”（Budyonnovsk hostage crisis）相关；在阅读英文报道时，你可能会看到它作为地名被提及。","英文中这类俄罗斯地名常有多种拼写（取决于转写体系），但“Budyonnovsk”是较常见的一种。"]}
{"word":"Budyonny","summary":{"en":"Budyonny is mainly a proper name: the Soviet cavalry marshal Semyon Budyonny, and it can also describe things related to him, especially the Budyonny horse breed.","zh":"Budyonny 主要指专有名词：苏联骑兵元帅谢苗恩·布琼尼；也可作形容词表示与其相关，尤指“布琼尼马”这一马种。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Semyon (Semen) Budyonny (1883–1973), a Soviet cavalry commander and Marshal of the Soviet Union, famous for leading the Red Army’s First Cavalry Army during the Russian Civil War.","zh":"布琼尼（谢苗恩·布琼尼，1883–1973），苏联骑兵统帅、苏联元帅，以在俄国内战中指挥红军“第一骑兵集团军”闻名。"},"examples":[{"en":"Budyonny became a symbol of Soviet cavalry in the early years of the USSR.","zh":"布琼尼在苏联早期成为“苏联骑兵”的象征人物。"},{"en":"In some histories of the Russian Civil War, Budyonny’s First Cavalry Army is described as highly mobile and decisive.","zh":"在一些关于俄国内战的史书里，布琼尼的第一骑兵集团军常被描述为机动性强、影响关键。"}]},{"partOfSpeech":"adj.","definition":{"en":"Used to describe things connected with Budyonny, especially the Budyonny horse (a Russian riding breed developed for cavalry).","zh":"用来形容与布琼尼相关的事物，尤指“布琼尼马”（为骑兵需求培育的俄罗斯骑乘马种）。"},"examples":[{"en":"The Budyonny horse is known for endurance and athleticism.","zh":"布琼尼马以耐力和运动能力见长。"},{"en":"She rode a Budyonny mare in the competition.","zh":"她在比赛中骑了一匹布琼尼母马。"}]}],"synonyms":["Semyon Budyonny","Semen Budyonny","Budenny (variant)"],"phonetic":"/buˈdyoʊni/","extraExplanation":["“Budyonny”来自俄语姓氏“Будённый”，英语里常见不同拼写与译名，如 Budenny / Budionny（中文常译“布琼尼”）。","布琼尼在苏联宣传中长期被塑造成革命骑兵英雄，但在二战时期对“骑兵/传统战法”的坚持也常被后人讨论与批评；在严肃写作中，最好用中性语气呈现其历史作用与争议。","“布琼尼马（Budyonny horse）”是20世纪为军事与运动用途培育的马种之一，因此在马术与育种语境中也会看到 Budyonny 作为形容词或名词使用。"]}
{"word":"Budyonnyi","summary":{"en":"Budyonnyi most often refers to the Soviet commander Semyon Budyonny, or to things associated with him (especially Red Army cavalry history).","zh":"Budyonnyi 通常指苏联指挥官谢苗·布琼尼，或指与他相关的事物（尤其是红军骑兵历史）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Semyon (Semen) Budyonny (1883–1973), a Soviet military commander, famous for leading cavalry forces in the Russian Civil War; his surname is often used in historical writing.","zh":"布琼尼（谢苗恩/谢苗·布琼尼，1883–1973），苏联军事指挥官，以在俄国内战时期指挥骑兵闻名；其姓氏常见于历史叙述中。"},"examples":[{"en":"Budyonnyi was celebrated in early Soviet propaganda as a heroic cavalry leader.","zh":"布琼尼在早期苏联宣传中被塑造成英雄式的骑兵领袖。"},{"en":"The film mentions Budyonnyi when describing the Red Army’s cavalry units.","zh":"影片在介绍红军骑兵部队时提到了布琼尼。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to Budyonny or associated with him (used attributively in phrases like “Budyonnyi cavalry” or “Budyonnyi’s army”).","zh":"与布琼尼有关的；以他命名或与其相关的（常作定语，如“布琼尼骑兵”“布琼尼的军队”）。"},"examples":[{"en":"They studied Budyonnyi cavalry tactics in the early 1920s.","zh":"他们研究了20世纪20年代初期的布琼尼骑兵战术。"},{"en":"A Budyonnyi-era poster hung on the museum wall.","zh":"博物馆墙上挂着一张布琼尼时代的海报。"}]}],"synonyms":["Budyonny","Semyon Budyonny","Semen Budyonny"],"phonetic":"/buˈdʲɔni/","extraExplanation":["“Budyonnyi/布琼尼”也常见拼写为 **Budyonny**（英语更常用）或 **Budyonnïy**（更接近俄语转写）。","与他相关的文化词汇之一是 **budenovka/布琼尼帽**（一种带尖顶的红军冬帽），在英语里多用这个名词而不是“Budyonnyi hat”。"]}
{"word":"budzart","summary":{"en":"“Budzart” is not a standard English word; it’s likely a name or a misspelling (often of “buzzard”).","zh":"“Budzart”不是标准英文单词；多半是专有名词或拼写错误（常见可能是“buzzard”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a proper name (e.g., a username, brand, or handle) or a misspelling of a similar-looking word (commonly “buzzard”).","zh":"不是标准英文单词。更可能是专有名词（如用户名、品牌名、网名等），或是把某个相近单词拼错了（常见可能是“buzzard”）。"},"examples":[{"en":"“Budzart” doesn’t appear in standard English dictionaries; it may be a username or brand name.","zh":"“Budzart”不见于常见英语词典；它可能是用户名或品牌名。"},{"en":"Did you mean “buzzard” (a large bird) instead of “budzart”?","zh":"你想写的是“buzzard”（一种大型鸟类）而不是“budzart”吗？"}]}],"phonetic":"/ˈbʌdzɑrt/","extraExplanation":["“budzart”在英语里没有固定、通行的词义，因此语境非常关键：它可能是人名/艺名/账号名，也可能是某个词的拼写错误。","如果你能提供一句完整的原句或截图（它出现在哪里、前后句是什么），我可以帮你判断更接近哪个词（例如 buzzard /bʌzərd/，或 other 类似拼写）。"]}
{"word":"budzat","summary":{"en":"“Budzat” isn’t a standard English word; it likely means “budget” or is a proper name.","zh":"“budzat” 不是标准英语词；多半是 “budget（预算）” 的拼写错误，或是专有名词（如人名/姓氏）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling of “budget,” or it may be a proper name (e.g., a surname).","zh":"不是标准英语单词。很可能是把 “budget（预算）” 拼错了，或可能是专有名词（如姓氏）。"},"examples":[{"en":"I can’t find “budzat” in an English dictionary—did you mean “budget”?","zh":"我在英语词典里找不到 “budzat”——你是不是想写 “budget（预算）”？"},{"en":"If “Budzat” is a person’s name, please share the sentence so I can help explain it.","zh":"如果 “Budzat” 是人名，请给我看完整句子，我就能更准确地解释。"}]},{"partOfSpeech":"n.","definition":{"en":"(If you meant “budget”) A plan for how much money you can spend, or the money available for a purpose.","zh":"（如果你想写的是 “budget”）预算：用于某个目的可花的钱，或对花多少钱的计划。"},"examples":[{"en":"We’re on a tight budget this month.","zh":"我们这个月预算很紧。"},{"en":"The project’s budget is $10,000.","zh":"这个项目的预算是 1 万美元。"}]},{"partOfSpeech":"v.","definition":{"en":"(If you meant “budget”) To plan or control spending; to allocate money for something.","zh":"（如果你想写的是 “budget”）做预算；控制开支；为某事分配资金。"},"examples":[{"en":"We need to budget for rent and food first.","zh":"我们需要先为房租和食物做预算。"},{"en":"She budgets carefully to save money.","zh":"她精打细算来存钱。"}]}],"synonyms":["spending plan","financial plan","allowance"],"phonetic":"/ˈbʌdʒɪt/","extraExplanation":["“budget” 的拼写里有 -dge-（/dʒ/ 的音），所以常见的拼写错误包括 *budjet*、*budzet* 等。如果你能提供 “budzat” 出现的上下文（例如一整句），我也可以判断它是不是人名、用户名、或其他语言的词。"]}

