{"word":"Buhara","summary":{"en":"Bukhara (Buhara) is a historic Silk Road city in Uzbekistan.","zh":"布哈拉（Buhara/ Bukhara）是乌兹别克斯坦著名的丝绸之路历史名城。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bukhara (also spelled Buhara) — a historic city in Uzbekistan, famous for its well-preserved Islamic architecture and its role as an important center on the Silk Road.","zh":"布哈拉（也拼作 Buhara）——乌兹别克斯坦的一座历史名城，以保存完好的伊斯兰建筑和作为“丝绸之路”重要中心而闻名。"},"examples":[{"en":"Bukhara is known for landmarks like the Kalyan Minaret and ancient madrasas.","zh":"布哈拉以卡扬宣礼塔和古老的伊斯兰学校等地标闻名。"},{"en":"Many travelers visited Bukhara on Silk Road routes connecting China, Central Asia, and Europe.","zh":"许多旅行者曾沿着连接中国、中亚与欧洲的丝绸之路路线到访布哈拉。"}]}],"synonyms":["Bukhoro","Buxoro"],"phonetic":"/buːˈkɑːrə/","extraExplanation":["“Bukhara”是英语中更常见的拼写；“Buhara”属于变体拼写（在不同语言的转写体系里会出现）。现代乌兹别克语常见写法为“Buxoro”（布霍罗）。","布哈拉在历史上长期是宗教、学术与贸易中心，因此在英语文章里常与“Silk Road（丝绸之路）”“oasis city（绿洲城市）”“Islamic architecture（伊斯兰建筑）”等词一起出现。"]}
{"word":"Buhl","summary":{"en":"Buhl most commonly refers to a brass-inlay furniture decoration style (Buhl work), and it can also be a surname or place name.","zh":"Buhl 最常见指黄铜等材料的家具镶嵌装饰风格（布尔镶嵌），也可作姓氏或地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a decorative technique (often used in fine furniture) that inlays brass and other materials into wood; also, furniture made with this technique","zh":"（常见于高档家具的）布尔镶嵌工艺：将黄铜等材料镶嵌进木材的装饰技法；也可指采用这种工艺制作的家具"},"examples":[{"en":"The museum displayed a cabinet decorated with Buhl work.","zh":"博物馆展出了一只用布尔镶嵌工艺装饰的柜子。"},{"en":"She collects antique desks with Buhl inlay.","zh":"她收藏带有布尔镶嵌装饰的古董书桌。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname) and also the name of several places (especially in the United States)","zh":"姓氏；也可作地名（尤其在美国有多个地方叫 Buhl）"},"examples":[{"en":"Dr. Buhl will speak at the conference.","zh":"Buhl 博士将在会议上发言。"},{"en":"He grew up in Buhl, Idaho.","zh":"他在爱达荷州的 Buhl 长大。"}]}],"synonyms":["Boulle work","inlay","marquetry"],"phonetic":"/buːl/","extraExplanation":["“Buhl work / Buhl inlay”常被认为是法国家具装饰大师 André-Charles Boulle（安德烈-夏尔·布勒）风格的英文写法变体，因此你也会看到拼作“Boulle work”。这种工艺在欧洲巴洛克时期的奢华家具上很常见。"]}
{"word":"buhl","summary":{"en":"Buhl most commonly refers to Boulle-style decorative inlay used on antique furniture; it can also be a proper name (surname/place).","zh":"Buhl 最常指布尔（Boulle）风格的古董家具装饰镶嵌工艺；也可作姓氏或地名等专有名词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of decorative furniture inlay (also written “Boulle work”), typically using brass (or other metal) and tortoiseshell/wood to form intricate patterns, often seen on French-style antique furniture","zh":"一种装饰性家具镶嵌工艺（也常写作“Boulle work”），通常把黄铜等金属与玳瑁/木材等材料拼镶成复杂花纹，常见于法式古董家具"},"examples":[{"en":"The cabinet is decorated with buhl and gilded bronze mounts.","zh":"这只柜子采用了布尔镶嵌工艺，并配有镀金铜饰件。"},{"en":"Collectors value buhl work for its intricate metal-and-wood patterns.","zh":"收藏家很看重布尔镶嵌那种金属与木材交织的精细纹样。"}]},{"partOfSpeech":"other","definition":{"en":"a surname or place name (e.g., Buhl), used as a proper name","zh":"姓氏或地名（如 Buhl），作为专有名词使用"},"examples":[{"en":"She works at the Buhl Foundation.","zh":"她在布尔基金会工作。"},{"en":"They drove through Buhl on the way to the lake.","zh":"他们去湖边的路上经过了布尔镇。"}]}],"synonyms":["Boulle work","marquetry","inlay"],"phonetic":"/bul/","extraExplanation":["“buhl”在艺术与古董语境里多指“Boulle（布尔）镶嵌”，与法国路易十四时期著名家具匠 André-Charles Boulle（安德烈-夏尔·布尔）的风格相关。英语里有时会把这种工艺简写或变体拼写为 buhl。现代语境中更常见的写法是 “Boulle work”。"]}
{"word":"buhlbuhl","summary":{"en":"“buhlbuhl” isn’t an English word; it’s probably a misspelling (often of “bulbul”).","zh":"“buhlbuhl”不是英语单词；多半是拼写错误（常见为“bulbul”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling or a made-up spelling.","zh":"不是标准英语单词；很可能是拼写错误或人为造词。"},"examples":[{"en":"I couldn’t find “buhlbuhl” in an English dictionary—did you mean “bulbul” or “Buhl”?","zh":"我在英语词典里找不到“buhlbuhl”——你是不是想写“bulbul”或“Buhl”？"},{"en":"Please check the spelling and tell me where you saw “buhlbuhl.”","zh":"请检查拼写，并告诉我你在哪里看到“buhlbuhl”。"}]}],"phonetic":"/ˈbʊl.bʊl/","extraExplanation":["“buhlbuhl”看起来最像两个可能来源：\n1) **bulbul**：一种鸣禽（在中东、南亚常见），英语里确实有这个词。\n2) **Buhl**：专有名词/姓氏，也可指“Boulle（布勒）镶嵌工艺”相关的写法变体，但更常见的拼写是 **Boulle**。\n如果你告诉我它出现的语境（歌曲、聊天、小说、地名、用户名等），我可以更准确判断你要查的词。"]}
{"word":"Buhler","summary":{"en":"“Buhler” is mainly a surname (often written “Bühler”), and it can also refer to the Swiss company Bühler or to place names like Buhler, Kansas.","zh":"“Buhler”主要是姓氏（也常写作“Bühler”），也可指瑞士的布勒公司或一些地名（如堪萨斯州的 Buhler）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), often of German/Swiss origin; also spelled “Bühler.”","zh":"姓氏（常见于德语区/瑞士等地）；也常拼作“Bühler”。"},"examples":[{"en":"Ms. Buhler will lead the meeting today.","zh":"Buhler 女士今天将主持会议。"},{"en":"I met a student named Buhler in my English class.","zh":"我在英语课上认识了一位叫 Buhler 的学生。"}]},{"partOfSpeech":"n.","definition":{"en":"Bühler (or Buhler): a well-known Swiss industrial company (Bühler Group), especially in food processing and advanced manufacturing equipment.","zh":"布勒（Bühler）：一家知名的瑞士工业公司（布勒集团），以食品加工与先进制造设备闻名。"},"examples":[{"en":"The factory installed new Bühler machines to improve production.","zh":"工厂安装了新的布勒设备来提升产量。"},{"en":"Bühler is a major supplier in grain and flour milling.","zh":"布勒是谷物与面粉加工领域的重要设备供应商。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name (proper noun), such as Buhler, Kansas in the United States.","zh":"地名（专有名词），例如美国堪萨斯州的 Buhler。"},"examples":[{"en":"They drove through Buhler, Kansas on their road trip.","zh":"他们自驾旅行时经过了堪萨斯州的 Buhler。"}]}],"phonetic":"/ˈbjuːlər/","extraExplanation":["“Bühler”中的“ü”是德语元音（类似中文“ü”的口型）。在不方便输入变音符号时，常写成“Buhler”。","作为姓氏时，它来自德语区，常见解释与“Bühl”（小山丘/隆起的地形）有关，因此可能带有“住在小山丘附近的人”这类地名姓氏来源。"]}
{"word":"buhls","summary":{"en":"“Buhls” is most often the plural of “buhl,” meaning decorative inlay work on fine furniture; it can also be a surname.","zh":"“Buhls”最常见是“buhl”的复数，指精美家具上的装饰性镶嵌工艺；也可能是姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of buhl: decorative inlay work (often metal and tortoiseshell or wood) used especially on fine furniture","zh":"buhl 的复数：一种装饰性镶嵌工艺（常见为金属与玳瑁或木材的拼嵌），尤用于精美家具上"},"examples":[{"en":"The museum displayed French cabinets decorated with buhls.","zh":"博物馆展出了带有 buhl 镶嵌装饰的法式橱柜。"},{"en":"Collectors pay a lot for antiques with original buhls.","zh":"收藏家会为带有原装 buhl 镶嵌的古董支付高价。"}]},{"partOfSpeech":"other","definition":{"en":"a surname or place name (used as a proper noun); “Buhls” can refer to people or families with that name","zh":"姓氏或地名（专有名词用法）；“Buhls”可指姓为该词的人或家族"},"examples":[{"en":"The Buhls donated the collection to the local library.","zh":"Buhls 家族把这批藏品捐给了当地图书馆。"}]}],"synonyms":["inlay","marquetry","Boulle work"],"phonetic":"/bul/","extraExplanation":["“buhl”常与法国家具装饰传统相关，尤其让人联想到17世纪的法国工艺风格（常被称为 Boulle work），以复杂的金属与其他材料的拼嵌闻名。","在一般日常英语中这个词不常见，多出现在艺术史、古董鉴定、家具工艺等语境。"]}
{"word":"buhlwork","summary":{"en":"“Bulwark” means a strong physical defense (like a wall) or an important protection/support against harm; it can also mean “to protect/strengthen.”","zh":"“Bulwark” 指坚固的防御设施（如城墙、堤坝）或抽象的保护屏障/支柱；也可作动词，表示“保护、加强以抵御”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wall or strong structure built to protect a place, especially from attack or the sea; more generally, something that gives strong protection against danger or harm","zh":"（尤指抵御攻击或海浪的）城墙/防波堤；引申为（对危险或不良影响的）坚强屏障、支柱"},"examples":[{"en":"The city built a bulwark along the river to reduce flooding.","zh":"这座城市沿河修建了防洪堤来减少洪水。"},{"en":"Free speech is often seen as a bulwark against tyranny.","zh":"言论自由常被视为对抗暴政的坚强屏障。"}]},{"partOfSpeech":"vt.","definition":{"en":"to protect or strengthen something so it can resist danger, attack, or pressure (often used with “against”)","zh":"保护；加强（常与 against 连用，表示“抵御/对抗”）"},"examples":[{"en":"They took steps to bulwark the economy against rising prices.","zh":"他们采取措施来加强经济，以抵御物价上涨。"},{"en":"New laws were introduced to bulwark consumers against fraud.","zh":"出台了新法律来保护消费者免受欺诈。"}]}],"synonyms":["barrier","defense","fortification","rampart","safeguard","shield","stronghold"],"phonetic":"/ˈbʊl.wɝːk/","extraExplanation":["你写的 “buhlwork” 很可能是拼写错误，常见正确拼写是 **bulwark**。这个词既可指实体的“防御工事/堤坝”，也常用于抽象意义，如“民主的堡垒”“抵御风险的屏障”。","词源与航海/城防有关：早期指船舷的防护结构或城墙之类的防御设施，因此在现代英语里常被用来比喻“可靠的保护力量”。"]}
{"word":"buhlworks","summary":{"en":"Buhlworks are ornate inlaid decorations on furniture, especially using brass and contrasting materials.","zh":"buhlworks 指家具等器物上用黄铜等材料与其他材质对比镶嵌形成的华丽装饰工艺。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"decorative marquetry (woodwork) made by inlaying brass or other metals and materials (such as tortoiseshell, ebony, or mother-of-pearl) into furniture or objects, often in elaborate patterns.","zh":"一种装饰性镶嵌细工（家具/木工装饰工艺）：把黄铜等金属与其他材料（如玳瑁、乌木、贝母等）镶嵌到家具或器物表面，形成复杂华丽的图案。"},"examples":[{"en":"The museum displayed a cabinet covered in buhlworks, with brass vines set into dark wood.","zh":"博物馆展出了一只柜子，表面是布尔镶嵌工艺：黄铜藤蔓图案嵌在深色木材里。"},{"en":"Antique dealers often describe French 17th‑century desks as featuring buhlworks.","zh":"古董商常把法国17世纪的书桌描述为带有布尔镶嵌工艺。"}]}],"synonyms":["Boulle work","Boullework","marquetry","inlay work"],"phonetic":"/ˈbuːl wɝːk/","extraExplanation":["“buhlworks”也常写作“buhl work”，更常见的同义拼写是“Boulle work / Boullework”，源自法国宫廷家具大师 André‑Charles Boulle（安德烈-夏尔·布尔）。这种工艺在欧洲巴洛克时期非常流行，常用于豪华家具（橱柜、写字台、钟座等）。","在阅读艺术史或古董说明时，你可能会看到“inlay（镶嵌）”“marquetry（木片镶嵌/细木镶嵌）”“ormolu（鎏金铜饰）”等相关词一起出现。"]}
{"word":"buhr","summary":{"en":"Buhr most commonly refers to a traditional porous millstone material; it can also be a surname.","zh":"Buhr 常指传统磨石用的多孔石材；也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hard, porous stone (often quartz) traditionally used to make millstones for grinding grain.","zh":"（传统磨坊用的）一种坚硬多孔的石材（常为石英质），用于制作磨石来研磨谷物。"},"examples":[{"en":"The old mill used buhr stones to grind wheat into flour.","zh":"那座老磨坊用 buhr 石来把小麦磨成面粉。"},{"en":"Buhr is valued because its rough, porous surface grips grain well.","zh":"buhr 之所以受重视，是因为它粗糙多孔的表面能很好地“咬住”谷物。"}]},{"partOfSpeech":"other","definition":{"en":"a family name (surname).","zh":"姓氏（人名）。"},"examples":[{"en":"Dr. Buhr will present the research at the conference.","zh":"Buhr 博士将在会议上报告这项研究。"}]}],"synonyms":["buhrstone","burrstone","millstone"],"phonetic":"/bʊr/","extraExplanation":["“buhr”在现代英语里比较少见，常见于历史/工业语境，更多时候你会看到更明确的形式：buhrstone / burrstone（磨石材）。","拼写上容易与“burr”混淆；“burr”更常见，意思可指（植物的）刺果、金属毛刺，或含糊的卷舌声。若你想表达这些常见意思，通常应写 burr。"]}
{"word":"buhrmill","summary":{"en":"A buhrmill is an old-style stone mill that grinds grain into flour using very hard buhrstones.","zh":"buhrmill 指一种传统的石磨磨坊/磨机，用硬质石磨盘把谷物磨成面粉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of grinding mill that uses very hard stone wheels (buhrstones) to grind grain into flour","zh":"一种用非常坚硬的石磨盘（buhrstone）把谷物磨成面粉的磨坊/磨机"},"examples":[{"en":"Before roller mills became common, many communities used a buhrmill to grind wheat into flour.","zh":"在滚筒磨普及之前，许多社区用石磨式磨坊把小麦磨成面粉。"},{"en":"The museum restored an old buhrmill so visitors could see how flour was made.","zh":"博物馆修复了一座旧式石磨磨坊，让游客看到面粉是如何制作的。"}]}],"synonyms":["stone mill","gristmill (often, though not exact)","flour mill (general)"],"phonetic":"/ˈbɝː mɪl/","extraExplanation":["“Buhrmill”也常写作“buhr mill”。其中“buhr”来自“buhrstone（硬质石磨石）”，传统上指一种非常坚硬、适合磨粉的石材（历史上常与欧洲的磨石产地相关）。","这种磨坊在19世纪及更早的农业与乡村生活中更常见；后来逐渐被效率更高的滚筒磨（roller mill）取代。阅读历史、农业或老式工坊相关文本时更容易遇到这个词。"]}
{"word":"buhrs","summary":{"en":"“Buhrs” is usually a surname (a family name), not a common English word.","zh":"“Buhrs”通常是姓氏（人名），不是常见英语词汇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name); a proper name rather than a common English vocabulary word","zh":"姓氏（家族名字）；属于专有名词，而不是常见英文词汇"},"examples":[{"en":"Ms. Buhrs will lead the meeting today.","zh":"Buhrs 女士今天将主持会议。"},{"en":"I saw Buhrs listed on the class roster.","zh":"我在班级名单上看到了 Buhrs 这个姓。"}]}],"synonyms":["family name","surname","last name"],"phonetic":"/bʊrz/","extraExplanation":["“Buhrs”在英语语境中通常作为姓氏出现，并不属于标准词典里常见的普通名词/动词。","它可能与德语或荷兰语背景的姓氏有关；有时也会看到带变体拼写（例如添加变音符号或不同字母组合）。","如果你是在某段文字里看到“buhrs”并且它不是人名，可能是拼写错误；你可以把原句发我，我能帮你判断是否应为其他单词。"]}
{"word":"buhrstone","summary":{"en":"Buhrstone is a hard stone used for making millstones to grind grain.","zh":"Buhrstone 指用于制作磨盘、研磨谷物的坚硬石材。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very hard, gritty type of stone traditionally used to make millstones for grinding grain (also spelled “burrstone”).","zh":"一种非常坚硬、粗糙的石材，传统上用来制作磨盘以研磨谷物（也拼作 burrstone）。"},"examples":[{"en":"The old mill displayed a buhrstone wheel that once ground wheat into flour.","zh":"那座老磨坊展示了一块曾经用来把小麦磨成面粉的磨盘石（buhrstone）。"},{"en":"Buhrstone was valued because its rough surface helped crush grain efficiently.","zh":"磨盘石（buhrstone）很受重视，因为它粗糙的表面能更有效地碾碎谷物。"}]}],"synonyms":["burrstone","millstone (general)","grindstone (near, not exact)"],"phonetic":"ˈbɝːˌstoʊn","extraExplanation":["“Buhrstone / burrstone”常指一种多孔、含硅的硬质岩石，历史上以法国某些产地的磨石闻名，用来制作磨盘（millstone）。","在英语里它属于较老或专业的词汇，多见于历史、矿物/地质、传统制粉工艺等语境。"]}

