{"word":"Bui","summary":{"en":"“Bui” is most commonly a Vietnamese surname (often written “Bùi” in Vietnamese).","zh":"“Bui”最常见是越南姓氏（越南语常写作“Bùi”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Vietnamese family name (surname), often written with a tone mark in Vietnamese as “Bùi.”","zh":"一个越南姓氏（家族姓），在越南语中常写作带声调的“Bùi”。"},"examples":[{"en":"Ms. Bui will lead the meeting today.","zh":"Bui 女士今天将主持会议。"},{"en":"In Vietnamese, the name is often written as Bùi.","zh":"在越南语里，这个姓常写作 Bùi。"}]},{"partOfSpeech":"other","definition":{"en":"a personal name used in English-language contexts as a surname or part of a full name (e.g., “Anh Bui,” “Minh Bui”).","zh":"在英语语境中作为姓或全名的一部分使用的人名（如“Anh Bui”“Minh Bui”）。"},"examples":[{"en":"I met Dr. Minh Bui at the conference.","zh":"我在会议上见到了 Minh Bui 博士。"},{"en":"How do you pronounce Bui?","zh":"Bui 怎么读？"}]}],"phonetic":"/bwiː/","extraExplanation":["“Bui”在英语里通常不是常见词汇，更常见的是作为越南姓氏的拼写。越南语原写法“Bùi”包含声调与元音标记；进入英文文本时常省略变音符号，写作“Bui”。","发音在英语中常被读作接近“bwee”（/bwiː/）；但具体读法也可能因个人偏好或家庭习惯而不同。正式场合可以直接询问对方希望的读法。"]}
{"word":"Buia","summary":{"en":"“Buia” is usually a name (not a common English word).","zh":"“Buia”通常是名字（并非常见英文词汇）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (place/person name). In English, “Buia” is not a common vocabulary word; it is most often seen as a name (for example, a place name).","zh":"专有名词（地名/人名）。“Buia”在英语里不是常见词汇，更多时候作为名字出现（例如地名）。"},"examples":[{"en":"She grew up in Buia before moving to the capital.","zh":"她在Buia长大，后来搬到了首都。"},{"en":"Buia appears on the map as a small town.","zh":"Buia在地图上显示为一个小镇。"}]}],"phonetic":"/ˈbuːiə/","extraExplanation":["如果你想查的是英文单词，“Buia”很可能是拼写错误。最常见的相近词是 **buoy**（浮标；使漂浮/鼓舞），发音 /bɔɪ/。你也可以告诉我你想表达的中文意思或给我一个例句，我可以帮你确认正确单词。"]}
{"word":"buibui","summary":{"en":"“buibui” is nonstandard internet slang meaning a cute “bye-bye.”","zh":"“buibui”是非标准的网络说法，意思类似可爱的“拜拜/再见”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Internet slang; nonstandard English) A cute or playful way to say “bye-bye,” often used in chats or comments.","zh":"（网络俚语；非标准英语）一种可爱/撒娇式的“拜拜”，常用于聊天或评论区告别。"},"examples":[{"en":"I have to go now—buibui!","zh":"我得走啦——buibui（拜拜）！"},{"en":"Thanks for the help, buibui everyone!","zh":"谢谢大家的帮助，buibui（拜拜）！"}]}],"synonyms":["bye","bye-bye","see you","later"],"phonetic":"/ˈbwiːˌbwiː/","extraExplanation":["“buibui”并不是标准英语单词，更常见于中文网络语境里对“bye-bye / 拜拜”的可爱写法或谐音写法（有时也写作“bui bui”）。在正式英文写作中建议直接用“bye / bye-bye / see you”。"]}
{"word":"Buick","summary":{"en":"Buick is an American car brand under General Motors; it can also mean a Buick car.","zh":"Buick 是通用汽车旗下的美国汽车品牌；也可指“一辆别克车”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand of American cars made by General Motors (GM), often associated with comfortable, mid-to-upscale vehicles","zh":"别克（Buick）：美国通用汽车（GM）旗下的汽车品牌，常给人“舒适、偏中高端”的印象"},"examples":[{"en":"My uncle drives a Buick because he likes a smooth, quiet ride.","zh":"我叔叔开别克，因为他喜欢平稳、安静的驾乘体验。"},{"en":"Buick is one of the long-running American car brands.","zh":"别克是历史悠久的美国汽车品牌之一。"}]}],"synonyms":["GM brand","car brand"],"phonetic":"/ˈbjuːɪk/","extraExplanation":["“Buick”既可以指“别克这个品牌”，也常用来指“一辆别克车”（a Buick）。在口语或新闻里，你会看到类似：He bought a Buick（他买了一辆别克）。","在北美文化里，Buick 常被视为比大众品牌更“舒适、稳重”的选择；在不同国家/地区，这种品牌形象可能会有差异。"]}
{"word":"buick","summary":{"en":"Buick is an American car brand (a GM brand) and can also mean a Buick vehicle.","zh":"Buick是美国汽车品牌（通用旗下），也可指一辆别克车。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand of American cars made by General Motors (GM), known for comfortable, mid-range to near-luxury vehicles","zh":"别克（Buick）：美国通用汽车（GM）旗下的汽车品牌，以舒适、偏中高端（接近豪华）的车型著称"},"examples":[{"en":"My grandparents drove a Buick for years because it was comfortable.","zh":"我祖父母开了很多年的别克，因为坐起来很舒服。"},{"en":"Buick is a well-known American car brand under GM.","zh":"别克是通用汽车旗下知名的美国汽车品牌。"}]}],"synonyms":["car brand","GM brand"],"phonetic":"/ˈbjuːɪk/","extraExplanation":["在美式英语中，Buick通常指“别克品牌/别克车”，属于专有名词，首字母要大写：a Buick（ 一辆别克车）。","别克在北美常给人“稳重、舒适、偏成熟人群”的品牌印象；在中国市场也很常见，常被直接音译为“别克”。"]}
{"word":"buicks","summary":{"en":"“Buicks” means more than one car made by the Buick brand.","zh":"“Buicks”指多辆别克品牌的汽车。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Buicks (plural): cars made by Buick, an American automobile brand (a division of General Motors).","zh":"Buicks（复数）：别克品牌生产的汽车；别克是美国的汽车品牌（通用汽车旗下）。"},"examples":[{"en":"Two Buicks were parked outside the diner.","zh":"餐馆外面停着两辆别克车。"},{"en":"My grandparents used to drive Buicks because they were comfortable.","zh":"我祖父母以前常开别克车，因为坐起来很舒适。"},{"en":"In old movies, you sometimes see characters arriving in big Buicks.","zh":"在一些老电影里，你有时会看到人物坐着大大的别克车出场。"}]}],"synonyms":["Buick cars","cars","automobiles","sedans"],"phonetic":"ˈbjuːɪks","extraExplanation":["“Buick（别克）”是通用汽车（GM）旗下品牌之一，名字来自创始人 David Dunbar Buick。","在北美语境里，Buick 常给人“舒适、偏成熟、偏家用”的印象；在中国市场，别克也曾长期非常常见，因此中文里常直接说“别克（车）”。","书写上通常大写：Buick；复数为 Buicks。"]}
{"word":"build","summary":{"en":"Build means to construct something or to develop something gradually; as a noun, it can mean a person’s body type.","zh":"build 表示“建造/构建”或“逐渐建立/发展”；作名词时可指“体格、体型”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make or create something by putting parts together; to construct","zh":"建造；组装；构建"},"examples":[{"en":"They plan to build a new library next year.","zh":"他们计划明年建一座新图书馆。"},{"en":"He built a small table from old wood.","zh":"他用旧木头做了一张小桌子。"},{"en":"The course helps you build confidence in speaking English.","zh":"这门课程帮助你建立说英语的自信。"}]},{"partOfSpeech":"v.","definition":{"en":"to develop something over time (such as a relationship, habit, or reputation)","zh":"逐渐建立（关系、习惯或名声等）"},"examples":[{"en":"She built a strong friendship with her teammates.","zh":"她和队友们建立了深厚的友谊。"},{"en":"It takes time to build good study habits.","zh":"养成良好的学习习惯需要时间。"}]},{"partOfSpeech":"n.","definition":{"en":"the body shape or general physical structure of a person or animal","zh":"体格；体型"},"examples":[{"en":"He has a slim build.","zh":"他体型偏瘦。"},{"en":"This dog has a strong, muscular build.","zh":"这只狗体格强壮、肌肉发达。"}]}],"synonyms":["construct","make","create","develop","assemble"],"phonetic":"/bɪld/","extraExplanation":["“build”既可指“建造/组装”这种具体动作，也常用来表达“建立”抽象的东西（如信心、名声、关系）。学习时可以把它理解为“把小部分一点点累积起来，变成更大的整体”。","常见搭配：build a house（盖房子）、build a team（组建团队）、build confidence（建立自信）、build up（逐渐增强/积累）。其中 build up 更强调“逐步增加到更强/更多”的过程。"]}
{"word":"build ... into","summary":{"en":"to incorporate something as an integral part of something else","zh":"把某事物作为整体的内在部分纳入其中"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to make something a planned part of something else; to include it so it becomes part of the whole","zh":"把……纳入/并入……之中；把……作为整体的一部分来规划"},"examples":[{"en":"We built safety checks into the app from day one.","zh":"我们从第一天就把安全检查纳入了这个应用的设计中。"},{"en":"Try to build more vegetables into your meals.","zh":"尽量把更多蔬菜融入你的日常饮食中。"},{"en":"The contract builds penalties into the payment schedule.","zh":"合同把罚金机制写入了付款时间表。"}]},{"partOfSpeech":"phrase","definition":{"en":"to develop a feature, habit, or ability as an inherent part of something, so it feels natural and automatic","zh":"把（特性/习惯/能力）培养成内在组成部分；让……“自带”"},"examples":[{"en":"Good teachers build confidence into their lessons.","zh":"优秀的老师会在课堂中“自带”建立学生自信的设计。"},{"en":"Over time, she built discipline into her daily routine.","zh":"久而久之，她把自律培养成了日常习惯的一部分。"}]}],"synonyms":["incorporate","integrate","embed","include","build in","work into"],"phonetic":"/bɪld ˈɪntu/","extraExplanation":["常见搭配：build A into B（把A并入B）。也可用于被动：A is built into B（A被内置在B里）。","语气上常强调“从一开始就考虑进去/内置”，比 add ... to 更强调结构性与长期性。"],"etymology":"来自 build（“建造、构建”）的比喻用法：把某个元素“建进”一个系统/计划里，强调它不是后加的，而是设计之初就包含在内。","mnemonic":["把 into 理解成“进到……里面”：把某功能“建进系统里”= 设计时就内置。","联想“内置功能”：Built-in（内置的）≈ built into（被建进……里）。"]}
{"word":"build ... on","summary":{"en":"develop further from an existing base; or construct atop something","zh":"在既有基础上进一步发展；或在……上建造"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to use something as a starting point and develop it further; to add new ideas, details, or improvements based on it","zh":"以……为基础继续发展；在……之上补充、扩展或改进"},"examples":[{"en":"The new plan builds on last year’s success.","zh":"新计划以去年的成功为基础进一步发展。"},{"en":"In your essay, build on this argument with more evidence.","zh":"在你的文章里，用更多证据在这个论点基础上继续展开。"},{"en":"The app builds on existing technology but makes it easier to use.","zh":"这款应用基于现有技术，但让使用更方便。"}]},{"partOfSpeech":"phrase","definition":{"en":"to place one thing on top of another as part of construction","zh":"在……之上建造；把……建在……上"},"examples":[{"en":"They built a deck on the back of the house.","zh":"他们在房子后面建了一个露台。"},{"en":"The city plans to build apartments on the old factory site.","zh":"这座城市计划在旧工厂用地上建公寓。"}]}],"synonyms":["base on","build upon","develop from","expand on","extend","advance","elaborate on","rely on"],"phonetic":"/bɪld ɑn/","extraExplanation":["常见写法是 build on 或 build upon（更正式一些）。","用于写作/讨论时很常见：build on an idea / a theory / a result（在某个观点、理论、成果基础上继续推进）。","注意与 depend on / rely on 的区别：build on 更强调“在基础上进一步发展”，而不是单纯“依赖”。"],"etymology":"由“build（建造）+ on（在……之上）”构成；先是字面“建在……上”，后来引申为比喻用法“以……为基础继续发展”。","mnemonic":["把它想成“盖房子要先有地基”：on = 在……上面；build on = 在已有基础上再往上盖。","联想中文“在……基础上（再）建”：build（建）+ on（在……上）。"]}
{"word":"build ... up","summary":{"en":"to develop, increase, strengthen, or boost gradually","zh":"逐步建立、增加或增强；也可指鼓励称赞或炒热情绪"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to increase or develop something gradually over time","zh":"逐渐增加；逐步建立（规模、数量、实力等）"},"examples":[{"en":"She built up her savings little by little.","zh":"她一点一点地把存款攒起来。"},{"en":"The company is building up its customer base in Asia.","zh":"这家公司正在亚洲逐步扩大客户群。"},{"en":"They built the town up into a major port.","zh":"他们把这座小镇逐步建设成一个大港口。"}]},{"partOfSpeech":"phrase","definition":{"en":"to strengthen something, especially confidence, skills, or the body","zh":"增强；培养（信心、技能）；锻炼（身体）"},"examples":[{"en":"These exercises build up core strength.","zh":"这些训练能增强核心力量。"},{"en":"Good teachers build students up instead of tearing them down.","zh":"好老师会鼓励学生、帮他们建立信心，而不是打击他们。"}]},{"partOfSpeech":"phrase","definition":{"en":"to praise someone and make them feel more confident","zh":"称赞；捧（某人）；让某人更有自信"},"examples":[{"en":"Her coach always builds her up before a competition.","zh":"比赛前她的教练总会鼓励她、夸她，让她更有信心。"},{"en":"Don’t build him up too much, or he’ll get overconfident.","zh":"别把他捧得太高，不然他会过度自信。"}]},{"partOfSpeech":"phrase","definition":{"en":"to create a bigger version of a story, worry, or expectation over time","zh":"（情绪/期待/担忧）逐渐累积；把事情越想越严重；炒作"},"examples":[{"en":"She built the problem up in her mind until it felt huge.","zh":"她在心里把问题越想越严重，最后觉得特别大。"},{"en":"The media built up excitement before the match.","zh":"媒体在比赛前不断炒热气氛。"}]}],"synonyms":["develop","increase","accumulate","strengthen","boost","enhance","bolster","praise","encourage","hype up"],"phonetic":"/bɪld ʌp/","extraExplanation":["这是可分离短语动词：宾语是名词时可放中间或后面（build the team up / build up the team）；宾语是代词时通常必须放中间（build it up，不说 build up it）。","常见搭配：build up confidence/strength/savings/reputation/tension/excitement。"],"etymology":"“build”来自古英语，原意是“建造”；加上副词“up”（向上、往上、逐步完成）后，形成短语动词，含义从“向上建起”扩展为“逐步增加、加强、累积、捧高”。","mnemonic":["把“up”理解成“往上堆”：越堆越多＝逐渐增加（build up savings）。","联想“把人往上抬”：抬高=夸奖/捧（build someone up）。"]}
{"word":"build ... upon","summary":{"en":"develop further from an existing base","zh":"在已有基础上进一步发展"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to use something as a starting point and develop it further; to add to something that already exists","zh":"以……为基础进一步发展；在已有基础上加以扩展"},"examples":[{"en":"We will build upon the research from last year to improve the plan.","zh":"我们将以去年的研究为基础来改进这个计划。"},{"en":"The teacher asked students to build upon each other’s ideas during the discussion.","zh":"老师让学生在讨论中在彼此的想法上继续发展。"}]},{"partOfSpeech":"phrase","definition":{"en":"to create or strengthen something (such as trust or a relationship) gradually over time","zh":"逐步建立或加强（如信任、关系等）"},"examples":[{"en":"Good communication helps build upon trust between teammates.","zh":"良好的沟通有助于在队友之间逐步加强信任。"},{"en":"They built upon a friendship that started in college.","zh":"他们在大学开始的友谊基础上继续加深。"}]}],"synonyms":["build on","develop","expand on","extend","elaborate on","add to"],"phonetic":"/bɪld əˈpɑn/","extraExplanation":["build upon 比 build on 更正式一些，但意思几乎相同：都表示“在已有基础上继续”。写作中常用 build upon previous work / findings / experience。","注意与 depend on（依赖）不同：build upon 强调“在基础上进一步发展”，而不是“离不开”。"],"etymology":"源自动词 build（建造）+ 介词 upon（在……之上）。由字面“在……之上建造”引申为“在已有基础上继续发展、扩展”。","mnemonic":["把 upon 想成“在……上面”：在原来的东西“上面再盖一层”＝在原有基础上继续发展。","联想中文“在……基础上（更进一步）”，就是 build upon 的常见搭配。"]}
{"word":"build a case against sb.","summary":{"en":"gather evidence to accuse someone","zh":"收集证据以指控某人"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to collect and organize evidence to show that someone is guilty or responsible for something (often in a legal or formal investigation)","zh":"收集并整理证据以证明某人有罪或应对某事负责（常用于法律或正式调查）"},"examples":[{"en":"The police are building a case against the suspect.","zh":"警方正在收集证据来指控这名嫌疑人。"},{"en":"The journalist built a case against the company by interviewing former employees.","zh":"这位记者通过采访前员工来收集证据，提出对该公司的指控。"},{"en":"Without strong evidence, it’s hard to build a case against her.","zh":"没有有力证据，就很难指控她。"}]}],"synonyms":["prepare a case","compile evidence","make a case against","bring charges against","build an argument against"],"phonetic":"/bɪld ə keɪs əˈɡɛnst ˈsʌmbɑdi/","extraExplanation":["常见搭配：build a case against sb; build a case for sth（为某事建立论据/论证）。","语气偏正式，常用于警方、检方、律师、记者或调查报告等场景。"],"etymology":"“case”在法律语境里指“案件/案情/论证”，而“build”表示“逐步搭建”。合起来就是“把证据一点点搭起来，形成能站得住脚的指控或论证”。","mnemonic":["把它想成“搭积木”：一块块证据（证词、记录、监控）堆起来，最后搭成一个“案子（case）”。"]}
{"word":"build a clean energy future that is safer, healthier and more prosperous for all","summary":{"en":"Create a low-pollution energy future with shared benefits.","zh":"打造低污染的能源未来，并让收益惠及所有人。"},"definitions":[{"partOfSpeech":"sentense","definition":{"en":"To create and develop a future where energy comes from low-pollution sources, making society safer, public health better, and economic life better for everyone.","zh":"打造并发展一个以低污染能源为主的未来，让社会更安全、公众更健康、经济更繁荣，并惠及所有人。"},"examples":[{"en":"The new policy aims to build a clean energy future that is safer, healthier, and more prosperous for all.","zh":"这项新政策旨在打造一个更安全、更健康、更繁荣并惠及所有人的清洁能源未来。"},{"en":"Investing in wind and solar can help build a clean energy future for the next generation.","zh":"投资风能和太阳能可以帮助为下一代打造清洁能源未来。"}]}],"synonyms":["create a clean-energy future","build a sustainable future","advance a renewable energy future","promote a greener future","drive an energy transition"],"phonetic":"/bɪld ə klin ˈɛnɚdʒi ˈfjutʃɚ ðæt ɪz ˈseɪfɚ ˈhɛlθiɚ ænd mɔr ˈprɑspɚəs fɔr ɔl/","extraExplanation":["clean energy 通常指在使用过程中排放更少温室气体或空气污染物的能源（如风能、太阳能、水电、地热等）。不同机构有时也会把核能或带碳捕集的化石能源纳入更广义的“清洁”。","“safer, healthier, more prosperous” 是典型的政治修辞三连结构：安全（事故与气候风险更低）、健康（空气更干净）、繁荣（就业与产业发展）。","for all 强调“公平转型”（just transition）的价值取向：不只让部分人受益，而是兼顾弱势群体、地区与劳动者。"],"etymology":"这是现代公共政策与环保语境中常见的宣传/愿景句式：build（建设/打造）+ clean energy（清洁能源）+ future（未来）+ “safer, healthier, more prosperous”（用三个比较级并列，强调多重好处）+ for all（强调普惠与公平）。","mnemonic":["build=“建/造”；future=“未来”。整句可记成：建一个“清洁能源的未来”，带来“三更”：更安全、更健康、更繁荣。","把 clean energy 联想成“清洁=少烟少雾”，所以更健康；能源更分散（风、光）也常被说更安全。"]}
{"word":"build a close rapport between ...","summary":{"en":"develop a warm, trusting connection","zh":"建立亲近互信的关系"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to develop a warm, trusting relationship (often between two people or groups)","zh":"（在……之间）建立亲近、互信的关系"},"examples":[{"en":"Good teachers build a close rapport with their students.","zh":"好的老师会和学生建立亲近、互信的关系。"},{"en":"The manager tried to build a close rapport between the new team members.","zh":"经理努力在新团队成员之间建立亲近的默契与信任。"},{"en":"It takes time to build a close rapport between doctors and patients.","zh":"医生和病人之间建立亲近的信任关系需要时间。"}]}],"synonyms":["build trust","establish rapport","develop rapport","form a bond","build a relationship","connect with","get along well","hit it off"],"phonetic":"/bɪld ə kloʊs ræˈpɔr/","extraExplanation":["用法提示：rapport 常与 build / establish / develop 搭配；常见结构：build a (close/good) rapport with sb（和某人建立融洽关系）/ between A and B（在A与B之间建立融洽关系）。","语气与场景：多用于工作、教育、医疗、销售、跨文化沟通等较正式或中性语境，强调“信任+沟通顺畅”。"],"etymology":"“rapport”来自法语 rapport，原意有“带回、联系、关系”（与 bring back / relate 有关）。英语中逐渐固定为“融洽关系、默契、信任感”。“build”在这里是比喻用法：像“搭建”一样逐步建立关系。","mnemonic":["把 rapport 联想成“拉近关系的桥梁”：ra-PORT（港口/port）→有“连接点”，关系就更通。","close rapport = 关系 close（很近）+ rapport（默契/融洽）→“很近的默契”。"]}
{"word":"build a fire","summary":{"en":"make a fire and keep it burning","zh":"生火并让火持续燃烧"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to start and maintain a fire by arranging fuel (such as wood or charcoal) and lighting it","zh":"生火；把火点起来并让它持续燃烧（通过摆放木柴/木炭等燃料并点燃）"},"examples":[{"en":"We built a fire to stay warm at night.","zh":"我们生了一堆火，晚上取暖。"},{"en":"He built a fire using dry leaves and small sticks.","zh":"他用干树叶和小树枝生火。"},{"en":"Please build a fire in the fireplace before guests arrive.","zh":"客人到之前，请先在壁炉里生火。"}]},{"partOfSpeech":"phrase","definition":{"en":"(figurative) to create strong excitement, anger, or enthusiasm in people","zh":"（比喻）煽动情绪；激起强烈的兴奋、愤怒或热情"},"examples":[{"en":"The rumor built a fire of anger online.","zh":"这个谣言在网上激起了愤怒情绪。"},{"en":"Her speech built a fire in the crowd.","zh":"她的演讲点燃了人群的热情。"}]}],"synonyms":["make a fire","start a fire","light a fire","kindle a fire","set a fire"],"phonetic":"/bɪld ə ˈfaɪɚ/","extraExplanation":["常见搭配区别：","- build a fire：把柴/炭等摆放好并点燃，让火烧起来（更完整、常用）。","- light a fire：强调“点着火”的瞬间动作。","- start a fire：强调“开始有火”，可能是生火也可能是引发火灾。","安全与文化提示：在露营或壁炉场景里很常见；在户外需要遵守当地防火规定，用完要“put out the fire / extinguish the fire”（把火彻底熄灭）。"],"etymology":"“build”原意是“建造、搭建”；在“build a fire”里指把柴火“搭起来”以便点燃。这个表达在英语里很常见，强调准备火堆的动作，而不只是“点火”。","mnemonic":["把“build”想成“搭积木”：先把木柴像积木一样“搭”成火堆，再点燃，就能记住不是只“点火”。","联想中文“把火堆搭起来”：对应“build a fire”。"]}
{"word":"build a fire under sb.","summary":{"en":"to push or spur someone into action","zh":"促使某人立刻行动；强力催动"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to strongly motivate someone to act faster or more energetically, often by creating pressure or urgency","zh":"强烈激励某人更快或更有干劲地行动（常带有施压、制造紧迫感的意味）"},"examples":[{"en":"The deadline built a fire under the team, and they finished the project early.","zh":"截止日期给团队“加了把火”，他们提前完成了项目。"},{"en":"Her coach built a fire under her before the race, and she ran her best time.","zh":"比赛前教练给她“打了鸡血/加了把火”，她跑出了最佳成绩。"},{"en":"The poor sales numbers built a fire under management to change their strategy.","zh":"糟糕的销售数据让管理层不得不“火速”调整策略。"}]}],"synonyms":["spur","galvanize","motivate","prod","push","kick into gear","light a fire under someone"],"phonetic":"/bɪld ə ˈfaɪɚ ˈʌndɚ ˈsʌmbɑdi/","extraExplanation":["语气：通常是口语/商务口语，意思偏“催促、逼一把”，不一定是温和鼓励；如果对象是下属或孩子，说话时注意语境，避免显得粗暴。","常见搭配：build/light a fire under sb; build a fire under the team/department; something (a deadline, competition) builds a fire under someone."],"etymology":"源自“在某人身下生火”的形象比喻：让人感觉“烫得坐不住”，于是立刻行动。与“light a fire under someone”意思接近。","mnemonic":["想象“屁股底下有火（fire under）”，人就坐不住、马上动起来＝被强力催动。"]}
{"word":"build a harmonious world of enduring peace and common prosperity","summary":{"en":"create long-term peaceful coexistence and shared prosperity worldwide","zh":"构建长期和平共处与共同繁荣的世界"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"To create a world where countries and people live together peacefully for a long time, with shared wealth and development.","zh":"构建一个长期和平、共同富裕、各国人民和谐共处的世界。"},"examples":[{"en":"Leaders called on the international community to build a harmonious world of enduring peace and common prosperity.","zh":"领导人呼吁国际社会构建一个持久和平、共同繁荣的和谐世界。"},{"en":"Education, fair trade, and dialogue are often seen as ways to build a harmonious world of enduring peace and common prosperity.","zh":"教育、公平贸易与对话常被视为构建持久和平与共同繁荣和谐世界的方式。"}]}],"synonyms":["promote global peace and shared prosperity","build a peaceful and prosperous world","foster harmony and development","advance win-win cooperation","seek lasting peace and common development"],"phonetic":"/bɪld ə hɑrˈmoʊniəs wɝld əv ɪnˈdʊrɪŋ pis ænd ˈkɑmən prɑˈspɛrəti/","extraExplanation":["语体与场景：偏正式、宏大叙事（formal, diplomatic）。用于政策文件、演讲、声明；日常对话中不常用。","“common prosperity”在英语里通常指“共享发展成果、缩小贫富差距的共同富裕”，比单纯“everyone is rich”更强调公平与共享。","近似表达：a shared future for humankind（人类命运共同体）在外交语境中也常与类似愿景并用，但含义与侧重点不完全相同。"],"etymology":"这是一个政治与外交语境中的固定表达，常见于国际会议与政策讲话中；“harmonious world（和谐世界）”“enduring peace（持久和平）”“common prosperity（共同繁荣/共同富裕）”组合使用，以强调长期稳定、合作共赢的发展愿景。","mnemonic":["把它拆成三块记：harmonious（和谐）+ enduring peace（持久和平）+ common prosperity（共同富裕/共同繁荣），就是“三愿景合一”。","联想中文常见搭配“和谐、和平、繁荣”，按顺序对应英文三段结构，记忆更稳。"]}
{"word":"build a learning society","summary":{"en":"create a society focused on lifelong learning","zh":"建设以终身学习为核心的社会"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to develop a community or nation where people continually learn, improve skills, and share knowledge throughout life","zh":"建设一个人人持续学习、提升技能并共享知识的社会（学习型社会）"},"examples":[{"en":"The government launched new libraries and online courses to build a learning society.","zh":"政府通过新建图书馆和开设在线课程来建设学习型社会。"},{"en":"Companies can help build a learning society by offering training and internships.","zh":"企业可以通过提供培训和实习来促进学习型社会的建设。"},{"en":"Building a learning society requires equal access to education for rural and urban students.","zh":"建设学习型社会需要城乡学生都能平等获得教育资源。"}]}],"synonyms":["promote lifelong learning","create a culture of learning","develop an educated society","foster a learning culture","encourage continuous learning"],"phonetic":"/bɪld ə ˈlɝnɪŋ səˈsaɪəti/","extraExplanation":["“learning society”常与“lifelong learning（终身学习）”一起出现，强调学习不只发生在学校，也发生在工作场所、社区与线上平台。","中文常译为“学习型社会”，含义接近“全民学习、处处能学、时时可学”。使用时语气偏正式，多见于政策、教育与组织发展场景。"],"etymology":"这是现代教育与公共政策中的常用表达：build（建设）+ a learning society（学习型社会）。learning 在这里表示“以学习为核心、持续学习的”。常用于政府报告、教育改革与终身学习语境。","mnemonic":["把它当作固定搭配记：build（建设）+ learning society（学习型社会）=“建一个爱学习、会学习的社会”。","联想中文口号式表达“建设学习型社会”，英语就是直译结构。"]}
{"word":"build a moderately prosperous society in all respects","summary":{"en":"to achieve broad, nationwide moderate prosperity across all major areas of life","zh":"在各领域全面实现全民较为富足的发展目标"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(policy/government) To achieve a level of nationwide development where most people are reasonably well-off, with progress across major areas such as the economy, education, healthcare, culture, and the environment.","zh":"（政策/政府语境）在经济、教育、医疗、文化、环境等主要领域全面推进发展，使大多数人达到“比较富足、生活有保障”的水平。"},"examples":[{"en":"The plan aims to build a moderately prosperous society in all respects by improving public services and raising incomes.","zh":"该计划旨在通过改善公共服务、提高收入，全面建成小康社会。"},{"en":"Leaders said the country had made major progress toward building a moderately prosperous society in all respects.","zh":"领导人表示，全面建成小康社会取得了重大进展。"},{"en":"The slogan is often used in official reports to describe a national development goal.","zh":"这一表述常用于政府工作报告中，用来描述国家发展目标。"}]}],"synonyms":["achieve moderate prosperity","build a well-off society","improve living standards","promote all-round development"],"phonetic":"/bɪld ə ˈmɑdərətli ˈprɑspərəs səˈsaɪəti ɪn ɔl rɪˈspɛkts/","extraExplanation":["使用场景：多见于新闻报道、政策文件与正式演讲，语体非常正式。日常英语里更常说“build a well-off society / achieve moderate prosperity / improve living standards”。","翻译提示：若写作对象是国际读者，可在首次出现时加一句解释（如：a national goal of improving living standards across all major sectors）。","语法拆解：build（实现/建设）+ a moderately prosperous society（中等富裕社会）+ in all respects（在各方面/全面地）。其中“moderately”弱化绝对富裕，强调“适度、达到一定水平”。"],"etymology":"该表述常被视为中文政治话语“全面建成小康社会”的英译版本。“小康”源自儒家经典语境，现代多用于指“温饱以上、较为富足”的生活水平；“in all respects”对应“全面”，强调各领域整体推进。","mnemonic":["记忆法：把它当作“全面（in all respects）+ 小康（moderately prosperous）+ 建设（build）”。先抓住核心词“小康=moderate prosperity”。","联想：prosperous=“prosper（繁荣）+ -ous（……的）”，看到prosper就想到“繁荣/富起来”。"]}
{"word":"build a new model of major-country relationship","summary":{"en":"create a new framework for how major powers interact","zh":"构建大国互动与合作的新框架"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to create and develop a new framework for how major powers (leading countries) interact and cooperate with each other","zh":"构建一种新的“大国之间”交往与合作框架（即新的大国关系模式）"},"examples":[{"en":"Both sides agreed to build a new model of major-country relationship based on mutual respect and cooperation.","zh":"双方同意在相互尊重与合作的基础上构建新型大国关系。"},{"en":"The speech called for building a new model of major-country relationship to avoid conflict and manage differences.","zh":"讲话呼吁构建新型大国关系，以避免冲突并管控分歧。"}]}],"synonyms":["forge a new framework for major-power relations","develop a new model of major-power relations","build a new pattern of relations between major powers","create a new approach to major-power relations"],"phonetic":"/bɪld ə nu ˈmɑdəl əv ˈmeɪdʒər ˈkʌntri rɪˈleɪʃənʃɪp/","extraExplanation":["用法提示：在英语里更常见、更地道的搭配是 “build a new model for major-country relations” 或 “build a new model of relations between major powers”。“relationship” 用单数也可以，但在正式文本中 “relations” 更常见。","语域：多用于政府声明、联合公报、外交演讲等正式场合；日常口语中较少使用。"],"etymology":"这是一个常见于外交与政策语境的固定表述，主要由动词 build + 名词短语 a new model + 介词短语 of major-country relationship 组成；其中 model 表示“模式/框架”，major-country 指“主要国家/大国”。在英语新闻与外交文本中也常见更自然的写法 major-country relations（大国关系）。","mnemonic":["把 model 记成“模板/模式”：build a new model = “搭建一个新模板（新模式）”。","major = “大”，country = “国”，major-country = “大国”；relationship/relations = “关系”。整体就是“构建新型大国关系”。"]}
{"word":"build a resource conserving and environmentally friendly society","summary":{"en":"create a sustainable society by saving resources and protecting the environment","zh":"通过节约资源与保护环境来建设可持续社会"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to create a society that uses natural resources efficiently and reduces pollution and environmental harm","zh":"建设一个节约资源、保护环境、减少污染与生态破坏的社会"},"examples":[{"en":"The government aims to build a resource-conserving and environmentally friendly society through stricter energy standards.","zh":"政府希望通过更严格的能源标准来建设资源节约型、环境友好型社会。"},{"en":"Recycling and public transportation help build a resource-conserving and environmentally friendly society.","zh":"回收利用和公共交通有助于建设资源节约型、环境友好型社会。"},{"en":"Schools can support this goal by teaching students to save water and reduce waste.","zh":"学校可以通过教育学生节约用水、减少浪费来支持这一目标。"}]}],"synonyms":["build a sustainable society","promote sustainable development","create an eco-friendly society","build a green society","foster environmental sustainability"],"phonetic":"/bɪld ə rɪˈsɔrs kənˈsɝvɪŋ ænd ɪnˌvaɪrənˈmɛntəli ˈfrɛndli səˈsaɪəti/","extraExplanation":["在中文语境里常对应“资源节约型、环境友好型社会”。英语里也可用更通用的说法如“build a sustainable society”。","“environmentally friendly”也常简写为“eco-friendly”。在正式写作中，连字符写法“resource-conserving”更常见。"],"etymology":"这是一个现代政策与公共传播中常见的表达，通常由两个并列形容词短语“resource-conserving（节约资源的）”与“environmentally friendly（环境友好的）”共同修饰“society（社会）”，常用于描述可持续发展的社会目标。","mnemonic":["把它拆开记：resource（资源）+ conserving（节约）+ environmentally（环境方面）+ friendly（友好）+ society（社会）。","联想中文固定搭配“资源节约、环境友好”，英文就是两个并列目标一起说。"]}
{"word":"build a social safety net to improve people's livelihood","summary":{"en":"create or strengthen public protections that help people meet basic needs","zh":"建立或完善社会保障兜底机制，保障基本生活"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to create or strengthen a system of public support (such as welfare benefits, unemployment insurance, and healthcare) that helps people meet basic needs, especially during hardship","zh":"建立或完善社会保障体系（如福利、失业保险、医疗等），帮助人们在困难时期满足基本生活需求"},"examples":[{"en":"The government plans to build a stronger social safety net to protect low-income families.","zh":"政府计划建立更强大的社会保障网，以保护低收入家庭。"},{"en":"Building a social safety net can reduce poverty and make economic shocks less damaging.","zh":"建立社会保障网可以减少贫困，并降低经济冲击带来的伤害。"},{"en":"They argued that investing in healthcare is part of building a social safety net.","zh":"他们认为投入医疗是建立社会保障体系的一部分。"}]}],"synonyms":["strengthen the welfare system","expand social protection","create a welfare safety net","bolster the social safety net","improve social security"],"phonetic":"/bɪld ə ˈsoʊʃəl ˈseɪfti nɛt/","extraExplanation":["在公共政策语境中，social safety net 常包括：失业救济、最低生活保障/现金补助、食品援助、公共医疗、住房补贴、儿童福利等。","“build/strengthen/expand a social safety net”是常见搭配；在新闻与政府报告中也常写作“improve/bolster the social safety net”。","你给出的句子“build a social safety net to improve people's livelihood”更自然的表达可以是：“build a social safety net to improve people’s livelihoods”（livelihood 常用复数表示不同人的生计）。"],"etymology":"“safety net”原指杂技表演下方的“安全网”，用于防止坠落受伤；20世纪起被借喻为“在失败或危机时提供保护的制度/措施”。“social safety net”即“社会层面的保护网”。","mnemonic":["把 safety net 想成“安全网”：人掉下去会被网接住→生活遇到失业、生病等风险时，社会保障把人“托住”。","联想中文“兜底”：“社会安全网”就是给民生“兜底”的制度。"]}
{"word":"build a well-off society in an all-round way","summary":{"en":"to achieve broad-based prosperity and development in all respects","zh":"全面实现较为富足与均衡发展的社会"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Mainly in Chinese political and policy contexts) to develop a broadly prosperous society, improving living standards and social development across many areas (economy, education, healthcare, environment, etc.), not just for a small group.","zh":"（多用于中国政治与政策语境）指全面推进社会发展与民生改善，使大多数人共享较为富足的生活与公共服务，不仅仅是一部分人富裕。"},"examples":[{"en":"The report set the goal of building a well-off society in an all-round way by improving education, healthcare, and jobs.","zh":"报告提出通过改善教育、医疗和就业，全面建成小康社会的目标。"},{"en":"They emphasized that prosperity should be achieved across the board, including rural areas.","zh":"他们强调要实现全面共享的富裕，包括农村地区。"},{"en":"In many translations, “in an all-round way” can be rephrased as “in all respects” for smoother English.","zh":"在很多译文中，“in an all-round way”可改写为“in all respects”，英语更自然。"}]}],"synonyms":["build a moderately prosperous society in all respects","build a well-to-do society in all respects","achieve broad-based prosperity","promote shared prosperity","build a prosperous society across the board"],"phonetic":"/bɪld ə ˌwɛlˈɔf səˈsaɪəti ɪn ən ˌɔlˈraʊnd weɪ/","extraExplanation":["使用提示：在更自然的英文里，常用 “build a moderately prosperous society in all respects” 或 “achieve broad-based prosperity”。“all-round way”在日常英语中不太常见，更像官方文体。","文化背景：“小康”最早可追溯到中国古典语境中对“较为殷实、衣食无忧”的生活状态描述，现代语境中多指一个阶段性的社会发展目标。"],"etymology":"源自中文政治话语中“全面建成小康社会”的常见英译表达（well-off / well-to-do 对应“小康”，all-round 对应“全面”）。在英语中该结构带有明显“直译腔”，常见于政策文件与新闻报道。","mnemonic":["把 well-off 记成“小康/日子过得不错”；all-round 记成“全面/方方面面”。合起来就是“全面小康”。","联想：round=“圈/范围”，all-round=“整个圈都覆盖到”，即“覆盖各方面”。"]}
{"word":"build an advanced clean city","summary":{"en":"develop a modern, eco-friendly city","zh":"建设现代化、环保的城市"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to develop a modern, high-tech, and environmentally friendly city (often used as a planning goal or slogan)","zh":"建设一个现代化、科技先进且环境友好的城市（常作规划目标或口号）"},"examples":[{"en":"The mayor promised to build an advanced clean city with better public transit and greener energy.","zh":"市长承诺建设一个先进清洁的城市，发展更好的公共交通和更绿色的能源。"},{"en":"The project aims to build an advanced clean city that reduces pollution and improves quality of life.","zh":"该项目旨在建设一个先进清洁的城市，减少污染并提升生活质量。"}]}],"synonyms":["build a smart city","create a sustainable city","develop a green city","build an eco-friendly city","modernize the city"],"phonetic":"bɪld ən ədˈvænst klin ˈsɪti","extraExplanation":["在实际英文写作里，更自然的表达常见为：“build a smart, clean city”（智慧清洁城市）或“build a clean, sustainable city”（清洁可持续城市）。","“advanced”通常强调技术与基础设施升级；“clean city”更强调空气、水、垃圾处理、交通排放等环境指标。若用于政策文件，常会具体化为：可再生能源、公共交通、电动车充电网络、垃圾分类与回收、绿色建筑等。"],"etymology":"这是由常见词组组合而成的表达：build（建设）+ advanced（先进的）+ clean city（清洁城市）。在城市规划语境中常用来概括“现代化+低污染/可持续”的发展方向。","mnemonic":["把 advanced 想成“先进=更智能”，clean city 想成“干净城市=少污染”，合起来就是“智慧+环保的城市”。","build=“bui(不易)+ld(拉动)”→把城市一点点“拉起来”建设出来（联想记忆即可）。"]}
{"word":"build better road systems","summary":{"en":"improve a road network and related infrastructure","zh":"完善道路路网及相关交通基础设施"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to create or improve a network of roads so transportation becomes safer, faster, and more efficient","zh":"建设或改善道路网络，使交通更安全、更快捷、更高效"},"examples":[{"en":"The city plans to build better road systems to reduce traffic jams.","zh":"这座城市计划建设更好的道路系统来减少交通拥堵。"},{"en":"They want to build better road systems so ambulances can reach hospitals faster.","zh":"他们希望建设更好的道路系统，让救护车能更快到达医院。"},{"en":"After the floods, the government promised to build better road systems in rural areas.","zh":"洪水之后，政府承诺在农村地区建设更好的道路系统。"}]}],"synonyms":["improve the road network","upgrade roads","develop transportation infrastructure","modernize highways","expand road capacity"],"phonetic":"/bɪld ˈbɛtɚ roʊd ˈsɪstəmz/","extraExplanation":["“road systems”通常不只指“路面”，也包括路网规划、桥梁/隧道、交叉口设计、排水、路灯、标志标线、公交专用道、自行车道以及日常维护等。","在正式写作里，常见替换说法有“improve transportation infrastructure（改善交通基础设施）”或“upgrade the road network（升级路网）”。"],"etymology":"这是由动词短语“build”（建造、建设）+“better”（更好的）+名词短语“road systems”（道路系统/路网）组成的现代英语表达，常见于政府政策、城市规划与基础设施讨论中。","mnemonic":["把它分成三块记：build（建设）+ better（更好）+ road systems（道路系统）=“把路网建得更好”。","联想中文固定搭配“完善路网/升级路网”，意思几乎一一对应。"]}
{"word":"build brand awareness","summary":{"en":"increase public recognition of a brand","zh":"提升公众对品牌的认知与记忆"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to make more people know and recognize a brand, and to help them remember it","zh":"提升品牌知名度；让更多人认识并记住一个品牌"},"examples":[{"en":"The company used short videos to build brand awareness among young customers.","zh":"这家公司用短视频在年轻消费者中提升品牌知名度。"},{"en":"Free samples can help build brand awareness in a new market.","zh":"免费试用装可以帮助在新市场提升品牌知名度。"}]}],"synonyms":["increase brand awareness","raise brand awareness","boost brand awareness","improve brand awareness","grow brand awareness"],"phonetic":"/bɪld brænd əˈwɛrnəs/","extraExplanation":["常见近义表达：increase/raise brand awareness（提高品牌知名度）。","和“build a brand（打造品牌）”不同：build brand awareness更强调“被看见、被记住”；而build a brand更强调“品牌定位、形象、价值与长期资产”。","搭配建议：build brand awareness through social media/ads/events（通过社媒/广告/活动提升知名度）；brand awareness campaign（品牌认知活动/宣传战役）。"],"etymology":"“brand awareness”是市场营销术语：brand（品牌）+ awareness（认知、知道）。搭配动词build（建立、逐步提升）后，常用于表达“通过持续传播让人认识并记住品牌”。","mnemonic":["把awareness记成“a-ware-ness”：ware像“货”，awareness就是“对货/品牌的认知度”；build就是“搭积木”，一点点搭出知名度。"]}
{"word":"build castles in Spain","summary":{"en":"to daydream or make unrealistic plans","zh":"空想；做不切实际的计划"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to make unrealistic plans or daydream about things that are unlikely to happen","zh":"做不切实际的计划；空想不太可能实现的事"},"examples":[{"en":"We’re building castles in Spain if we think the project will finish in a week.","zh":"如果我们以为这个项目一周就能完成，那就是在空想。"},{"en":"He spent the whole evening building castles in Spain about becoming famous overnight.","zh":"他整个晚上都在幻想一夜成名。"}]}],"synonyms":["daydream","fantasize","pipe dream","build castles in the air","have your head in the clouds"],"phonetic":"/bɪld ˈkæsəlz ɪn speɪn/","extraExplanation":["这是一个偏英式/欧式色彩的习语。在现代英语里更常见的近义表达是“build castles in the air”或“daydream”。","语气通常带一点提醒或轻微的批评：不是完全否定梦想，而是说目前条件不够现实。"],"etymology":"源自欧洲多种语言中的相似说法（如法语“bâtir des châteaux en Espagne”），意思是“在并不属于自己的地方建城堡”，引申为“凭空设想、难以实现的计划”。英语中常见表达也包括“build castles in the air”。","mnemonic":["把西班牙想成“离自己很远、很难掌控的地方”：在那儿建城堡＝想得很美但不现实。","联想中文“空中楼阁/白日做梦”，含义几乎对应。"]}
{"word":"build castles in the air","summary":{"en":"to daydream or plan unrealistically","zh":"空想；做不切实际的计划"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to make unrealistic plans or daydream about an ideal future without taking practical steps","zh":"做不切实际的计划；空想美好未来而不付诸行动"},"examples":[{"en":"It’s fun to build castles in the air, but you still need a real plan.","zh":"空想当然有趣，但你仍然需要一个切实可行的计划。"},{"en":"He keeps building castles in the air about becoming rich overnight.","zh":"他总在空想一夜暴富。"},{"en":"Stop building castles in the air and start preparing for the exam.","zh":"别再空想了，开始为考试做准备吧。"}]}],"synonyms":["daydream","fantasize","pipe dream","wishful thinking","dream up","have one's head in the clouds"],"phonetic":"/bɪld ˈkæsəlz ɪn ði ˈer/","extraExplanation":["语气与使用：常带一点劝告或批评的意味，表示“想得很美但不落地”。在更中性的语境里也可表示“白日梦/幻想”。","常见搭配：build castles in the air about sth（就某事空想）；stop building castles in the air（别空想了）；be guilty of building castles in the air（爱空想）。"],"etymology":"源自英语里“空中建城堡”的比喻：城堡需要地基，在空气中建造不可能实现，因此用来形容不现实的幻想或计划。常见相关说法还有“castles in Spain”（同义的旧说法）。","mnemonic":["把“castle（城堡）”想成需要“地基”。“in the air（在空中）”就没有地基＝不现实的幻想。","联想中文“空中楼阁”，意思非常接近，看到就能对应起来。"]}
{"word":"build character","summary":{"en":"develop resilience and moral strength; or create a fictional persona","zh":"培养韧性与品格；或塑造虚构角色"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to develop good qualities such as discipline, resilience, patience, or moral strength through experience (often through difficulty)","zh":"通过经历（常常是困难）来培养纪律、自控、韧性、耐心或道德力量等品质"},"examples":[{"en":"Living away from home can build character and independence.","zh":"离家生活可以培养品格和独立性。"},{"en":"The coach said early morning practice would build character.","zh":"教练说清晨训练能磨炼意志、培养品格。"},{"en":"She believes volunteering builds character as well as skills.","zh":"她认为做志愿者既能培养品格，也能提升技能。"}]},{"partOfSpeech":"phrase","definition":{"en":"to create and develop a fictional character for a story, game, or screenplay (their background, personality, and motivations)","zh":"为故事、游戏或剧本塑造角色（设计其背景、性格与动机）"},"examples":[{"en":"The writer spent weeks building characters before starting the first chapter.","zh":"作者在写第一章之前花了几周时间塑造角色。"},{"en":"In role-playing games, you build your character by choosing skills and traits.","zh":"在角色扮演游戏里，你通过选择技能和特质来创建/培养角色。"}]}],"synonyms":["develop character","build resilience","strengthen character","shape character","toughen up","forge character","create a character","develop a character","craft a character"],"phonetic":"/bɪld ˈkærɪktɚ/","extraExplanation":["在口语里常见句子“It builds character.”（这能磨炼人/有助于成长），有时带一点调侃：比如面对不舒服或辛苦的事情，大人用这句话安慰或“合理化”困难。"],"etymology":"“build”来自古英语，意为“建造、构建”；“character”来自希腊语经拉丁语进入英语，既可指“人格/品质”，也可指“人物/角色”。两者组合后，既可指“培养品格”，也可指“塑造角色”。","mnemonic":["记忆法：build=“搭建”，character=“性格/品格/角色”；合起来就是“把性格搭起来”→培养品格。","联想：遇到苦事别人说“It builds character.” 可以理解为“吃点苦，长点本事/心性更坚强”。"]}
{"word":"build confidence","summary":{"en":"to develop self-assurance or increase trust in something","zh":"建立自信或增强对某事的信心/信任"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to develop or increase self-assurance (belief in your own ability)","zh":"建立或增强自信（对自己能力的信任）"},"examples":[{"en":"She joined the speaking club to build confidence.","zh":"她参加演讲社来建立自信。"},{"en":"Small wins can help you build confidence over time.","zh":"小的成功能帮助你随着时间建立自信。"},{"en":"The coach gave him simple drills to build his confidence before the match.","zh":"教练在比赛前给他安排了简单训练来增强他的自信。"}]},{"partOfSpeech":"phrase","definition":{"en":"to increase trust or certainty in something (a person, plan, system, or product)","zh":"增强对某事的信任或把握（对人、计划、系统或产品等）"},"examples":[{"en":"Clear data helps investors build confidence in the company.","zh":"清晰的数据能帮助投资者增强对这家公司的信心。"},{"en":"Regular updates built confidence in the project timeline.","zh":"定期更新增强了大家对项目时间表的信心。"}]}],"synonyms":["gain confidence","develop confidence","grow in confidence","boost confidence","build up confidence","increase confidence","strengthen confidence","foster confidence","instill confidence"],"phonetic":"bɪld ˈkɑnfɪdəns","extraExplanation":["常见搭配：build confidence in yourself（建立自信）；build confidence in someone/something（增强对某人/某事的信心）；build up confidence（更强调“逐步累积/把…提升起来”）。","区分：confidence 常指“自信”或“对结果有把握”；trust 更偏“信任（对人/品格/可靠性）”。但在商业语境里 build confidence in… 很常见，意思接近“增强信心/信任”。"],"etymology":"“build”原意是“建造”，英语里常用“建造”的隐喻来表示“逐步形成/培养”（如 build skills, build trust）。因此 build confidence 表示“像盖房子一样一点点把信心建立起来”。","mnemonic":["把 confidence 想成“信心大楼”：每天一块砖（小练习/小成功）= build confidence。"]}
{"word":"build consensus","summary":{"en":"create broad agreement in a group","zh":"促成群体的广泛一致意见"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to create general agreement among a group, often by discussing, listening, and adjusting plans so most people can support the same decision","zh":"在群体中促成（广泛）一致意见，通常通过讨论、倾听与调整方案，让大多数人都能支持同一决定"},"examples":[{"en":"The manager held short meetings to build consensus around the new schedule.","zh":"经理开了几次简短会议，来为新排班促成共识。"},{"en":"We need to build consensus before we announce any changes to customers.","zh":"在向客户宣布任何变更之前，我们需要先达成共识。"},{"en":"She built consensus by addressing everyone’s concerns one by one.","zh":"她通过逐一回应每个人的担忧来建立共识。"}]}],"synonyms":["reach agreement","forge agreement","create alignment","gain buy-in","find common ground","unify","reconcile","broker a deal"],"phonetic":"/bɪld kənˈsɛnsəs/","extraExplanation":["“build consensus”强调过程：通过沟通与妥协让大家愿意支持；不一定是100%同意，但通常意味着“足够多的人可以接受并愿意配合”。","与“take a vote（投票）”不同：投票可能出现明显分裂；“build consensus”更强调减少分歧、争取广泛支持，常用于团队协作、项目管理、政治与社区事务。"],"etymology":"“build”表示“建造/建立”，引申为“逐步形成”；“consensus”来自拉丁语 consensus（con- “共同” + sentire “感受/意见一致”），原义为“共同的看法/一致同意”。合起来就是“逐步建立共同一致的意见”。","mnemonic":["把它当成“搭积木”：一块块（讨论、让步、解释）堆起来，最后搭出“共识”这座楼。","consensus 里有 con-（共同）+ sense（想法/感觉），联想成“共同的想法”。"]}
{"word":"build consensus and pull together in times of trouble","summary":{"en":"reach agreement and cooperate during difficult situations","zh":"在困难局势下达成一致并协同行动"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"To get people to agree and cooperate, especially when a situation is difficult.","zh":"在困难时期促成共识、团结协作。"},"examples":[{"en":"In times of trouble, leaders must build consensus and pull together to protect the community.","zh":"在困难时期，领导者必须促成共识、团结协作，来保护社区。"},{"en":"After the accident, the whole team pulled together and agreed on a clear plan.","zh":"事故发生后，整个团队团结起来，并就清晰的方案达成一致。"},{"en":"It’s easier to build consensus when everyone shares the same goal.","zh":"当大家目标一致时，更容易促成共识。"}]}],"synonyms":["unite","come together","join forces","rally together","work as one","stand together","reach agreement","find common ground","forge consensus","band together"],"phonetic":"/bɪld kənˈsɛnsəs ən pʊl təˈɡɛðɚ ɪn taɪmz əv ˈtrʌbəl/","extraExplanation":["“build consensus”强调过程：通过讨论、妥协、沟通来“建立/凝聚共识”。","“pull together”更强调行动层面：大家放下分歧，实际一起做事、互相支持。","“in times of trouble”语气较正式，常指危机、灾难、经济困难、冲突等时期。"],"etymology":"“consensus”源自拉丁语 consensus，原意为“共同感受/一致意见”；“pull together”是英语习语，字面是“一起拉”，引申为“齐心协力、同舟共济”。组合起来常用于政治、组织管理与公共危机语境。","mnemonic":["把“consensus”记成“共同sense（感觉/想法）”→ 共同想法＝共识。","“pull together”联想中文“同心协力/众人拾柴火焰高”：一起拉就更有力。"]}
{"word":"build expertise","summary":{"en":"develop professional-level skill and knowledge over time","zh":"逐步培养并形成专业级的技能与知识"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to develop strong skill and deep knowledge in a subject over time through learning and practice","zh":"通过学习与实践在某个领域逐步培养扎实的技能和深入的知识"},"examples":[{"en":"She built expertise in data analysis by working on real projects.","zh":"她通过做真实项目逐步建立了数据分析方面的专业能力。"},{"en":"If you want to build expertise, focus on one area and practice every week.","zh":"如果你想培养专业能力，就专注一个方向并每周练习。"},{"en":"The company is building expertise in renewable energy to compete globally.","zh":"这家公司正在培养可再生能源领域的专业能力，以便参与全球竞争。"}]},{"partOfSpeech":"phrase","definition":{"en":"to increase an organization’s professional capability by hiring, training, and accumulating experience","zh":"（组织层面）通过招聘、培训和经验积累提升专业能力"},"examples":[{"en":"The hospital built expertise by training nurses in emergency care.","zh":"这家医院通过培训护士急救护理来提升专业能力。"},{"en":"We need to build expertise internally instead of always outsourcing.","zh":"我们需要在内部培养专业能力，而不是总外包。"}]}],"synonyms":["develop expertise","gain expertise","acquire expertise","cultivate expertise","build mastery","develop proficiency"],"phonetic":"/bɪld ˌɛkspərˈtiːz/","extraExplanation":["常见搭配：build expertise in + 领域（build expertise in marketing）。","语气更正式、职场常用；比“learn”更强调“长期积累”和“能力成形”。","近似表达区别：build skills（更偏具体技能）；build knowledge（更偏知识）；build expertise（知识+技能+经验，综合更强）。"],"etymology":"“build”来自古英语，原意是“建造”；后来常被引申为“逐步建立/培养”。“expertise”来自法语，源头与拉丁语“expertus（有经验的）”相关，指“专业知识与技能”。合起来强调“靠时间与实践积累出来的专业能力”。","mnemonic":["把它想成“建房子”：专业能力不是一天学会，而是一砖一瓦“build”出来的。","expertise 看起来像 expert（专家）+ -ise（名词后缀），联想“成为专家的能力”。"]}
{"word":"build good working relationships","summary":{"en":"create and maintain positive cooperation at work","zh":"在工作中建立并维持积极合作"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to create and maintain positive, effective relationships with people at work through trust, communication, and cooperation","zh":"通过信任、沟通与合作来建立并维持积极有效的职场人际关系"},"examples":[{"en":"Good managers build good working relationships by listening carefully and giving clear feedback.","zh":"优秀的管理者会通过认真倾听并给出清晰反馈来建立良好的工作关系。"},{"en":"To build good working relationships, she regularly checks in with teammates and follows through on promises.","zh":"为了建立良好的工作关系，她会定期和队友沟通，并兑现承诺。"},{"en":"The project succeeded because the partners built good working relationships across different departments.","zh":"项目之所以成功，是因为合作方在不同部门之间建立了良好的工作关系。"}]}],"synonyms":["build rapport","develop professional relationships","cultivate workplace relationships","foster collaboration","work well with others","strengthen ties"],"phonetic":"/bɪld ɡʊd ˈwɝkɪŋ rɪˈleɪʃənˌʃɪps/","extraExplanation":["常见搭配：build good working relationships with colleagues/clients/stakeholders（与同事/客户/相关方建立良好工作关系）。","语气与场景：多用于职场建议、绩效评价、面试与商务写作（如：He builds strong working relationships.）。","近义表达区别：work well with others 更口语、强调“相处融洽”；build rapport 强调“快速建立融洽感”；foster collaboration 强调“促进协作氛围”。"],"etymology":"由常用动词“build”（建立、打造）+ 名词短语“working relationships”（工作关系）组合而成；在商业与职场语境中常用来强调“建立并维护合作关系”，不仅是“认识”，更包含长期的信任与协作。","mnemonic":["把它想成“盖房子”：关系像房子，需要一砖一瓦（沟通、可靠、尊重）慢慢“build”。","working = 工作场景；relationships = 人际关系；合起来就是“工作中的关系”。"]}
{"word":"build in","summary":{"en":"include or integrate as a fixed part; sometimes, to gradually accumulate inside","zh":"纳入/内置为固定部分；也可指在内部逐渐积累"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to include something as a fixed part of a system, plan, product, or design (so it is there from the beginning)","zh":"把……作为固定组成部分加入（使其从一开始就内置/包含在内）"},"examples":[{"en":"The designers built in extra safety features.","zh":"设计师加入了额外的安全功能。"},{"en":"We need to build in enough time for testing.","zh":"我们需要把足够的测试时间预留进去（纳入计划）。"},{"en":"The contract builds in annual pay increases.","zh":"合同包含每年加薪的条款。"}]},{"partOfSpeech":"vi.","definition":{"en":"to develop or increase gradually within something (often about pressure, stress, or tension)","zh":"（在某事物内部）逐渐积累/增强（常指压力、紧张等）"},"examples":[{"en":"As deadlines got closer, tension built in the team.","zh":"随着截止日期临近，团队里的紧张情绪逐渐累积。"},{"en":"Over time, stress can build in a high-pressure job.","zh":"长期下来，高压工作中压力会逐渐积累。"}]}],"synonyms":["incorporate","integrate","include","embed","factor in","allow for"],"phonetic":"/bɪld ɪn/","extraExplanation":["学习提示：build in 常作动词短语，强调“把某功能/条款/时间等预先加入设计或计划里”。如果要描述“已经内置的”，更常用 built-in（形容词）：a built-in camera（内置摄像头）。","在项目管理语境里，build in time/buffer 常表示“预留时间/留缓冲”。中文可理解为“把……算进去/留出来”。"],"etymology":"由“build（建造/构建）+ in（在里面）”组合而成；引申为“把某物构建到内部”，即“纳入、内置”。常见对应形容词形式是 built-in（内置的）。","mnemonic":["把它想成“把东西建在里面”：build（建）+ in（里）→ “内置/纳入”。","联想 built-in（内置的）这个常见形容词：先 build in（把…内置进去），结果就是 built-in（已经内置的）。"]}
{"word":"build into","summary":{"en":"to incorporate as a built-in part, or to develop into something larger","zh":"把……纳入/内置到……；或逐渐发展成/演变成"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to include something as an essential part of a system, plan, or product (so it is there from the beginning)","zh":"把……作为组成部分加入（从一开始就内置/纳入）"},"examples":[{"en":"We built security into the app from day one.","zh":"我们从第一天起就把安全功能内置到这个应用里。"},{"en":"The designer built extra storage into the kitchen cabinets.","zh":"设计师把额外的收纳空间做进了厨房橱柜里。"}]},{"partOfSpeech":"phrase","definition":{"en":"to gradually develop so that it becomes something; to grow into","zh":"逐渐发展成/演变成（变得更……或成为……）"},"examples":[{"en":"Small habits can build into big changes over time.","zh":"小习惯久而久之会积累成大改变。"},{"en":"The disagreement built into a serious conflict.","zh":"这场分歧逐渐演变成了严重冲突。"}]}],"synonyms":["incorporate","integrate","embed","build in","work into","develop into","grow into","evolve into"],"phonetic":"/bɪld ˈɪntu/","extraExplanation":["常见结构：build A into B（把A纳入B/做进B里）；或 build into + 名词结果（逐渐发展成某种结果），如 build into a problem/conflict/crisis。","与 build in 区别：build in 更强调“内置（功能/部件）”；build into 强调“把某物纳入到更大的整体里”或“发展成……”。"],"etymology":"“build”原意是“建造”，引申为“构建、形成”；搭配介词“into（进入/成为）”，就表达“构建到……里面（纳入）”或“逐步变成……（演变成）”。","mnemonic":["把 into 理解成“进入/变成”：build + into = “建进去 / 建成……”。","联想：把功能“建到”产品里（纳入），或事情“建着建着”就“变成”更大结果（演变）。"]}
{"word":"build man-made forests and seal off mountainous areas to facilitate afforestation","summary":{"en":"Create artificial forests and restrict access to mountains to support tree planting.","zh":"建设人工林并限制进入山区，以支持造林。"},"definitions":[{"partOfSpeech":"sentense","definition":{"en":"To create artificial forests and restrict access to mountain regions so tree-planting and forest recovery can be carried out more effectively.","zh":"建设人工林，并封闭山区（限制进入），以便更有效地开展造林与森林恢复。"},"examples":[{"en":"The county plans to build man-made forests and seal off mountainous areas to facilitate afforestation.","zh":"该县计划建设人工林，并封闭山区，以促进造林工作。"},{"en":"Some hillsides were sealed off for several years so young trees could grow without disturbance.","zh":"一些山坡被封闭了好几年，让幼树在不受干扰的情况下生长。"}]}],"synonyms":["create artificial forests","establish plantations","close off mountain areas","restrict access to mountainous areas","support afforestation","promote tree planting"],"phonetic":"/bɪld mæn meɪd ˈfɔrɪsts ænd sil ɔf ˈmaʊntənəs ˈɛriəz tə fəˈsɪləˌteɪt əˌfɔrəˈsteɪʃən/","extraExplanation":["“seal off mountainous areas”在环保语境里通常指“封山育林/封山禁牧/封山管理”，即在一定时期内限制人员进入、放牧、采伐或采药等活动，以保护植被恢复。若用于正式文件，可更明确写成 “restrict access to mountainous areas” 或 “close off mountain areas for conservation”。","“afforestation”强调“在原本没有森林的土地上造林”；如果是“恢复曾经有森林的地方”，更常用“reforestation（再造林/复植）”。"],"etymology":"“man-made”意为“人为制造的”；“seal off”原指“密封、封住”，引申为“封闭、隔离（某区域）”；“facilitate”来自拉丁语词根，意为“使更容易”；“afforestation”由前缀 ad-（=to）+ forest（森林）+ -ation（名词后缀）构成，表示“造林、植树造林”。","mnemonic":["afforestation 里有 forest（森林）：a- + forest + -ation → “让土地变成森林”的过程 = 造林。","seal off 可以联想“把门封上（seal）不让进（off）”，引申为“封闭某区域”。"]}
{"word":"build muscles","summary":{"en":"increase muscle size and strength; also used metaphorically to strengthen ability","zh":"增加肌肉与力量；也可比喻锻炼能力、变得更强"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to increase muscle size and strength through exercise, training, and nutrition","zh":"通过锻炼、训练和饮食来增加肌肉体积与力量（增肌）"},"examples":[{"en":"He goes to the gym three times a week to build muscles.","zh":"他每周去健身房三次来增肌。"},{"en":"To build muscles, she focuses on protein and progressive strength training.","zh":"为了增肌，她注重蛋白质摄入和循序渐进的力量训练。"}]},{"partOfSpeech":"phrase","definition":{"en":"(figurative) to become stronger or more capable through practice or experience","zh":"（比喻）通过练习或经历变得更强、更有能力"},"examples":[{"en":"Presenting in class helped him build muscles for public speaking.","zh":"在课堂上做展示帮助他“练”出了公众演讲的能力。"},{"en":"Solving hard problems builds muscles for logical thinking.","zh":"解决难题能锻炼逻辑思维能力。"}]}],"synonyms":["build muscle","gain muscle","put on muscle","bulk up","strengthen","tone up","get stronger","train"],"phonetic":"/bɪld ˈmʌsəlz/","extraExplanation":["更自然的英语说法常见有：build muscle（把“muscle”当作不可数，较常用）、build muscles（强调多块肌肉或更口语）、gain muscle（强调结果）、put on muscle（口语，强调“长”出来）。","在健身语境里，build muscle(s) 通常暗示：力量训练 + 足够蛋白质 + 逐步加量（progressive overload）+ 休息恢复。"],"etymology":"“build”意为“建造/建立”，引申为“逐步形成”；“muscle(s)”来自拉丁语 musculus（“小老鼠”），古人觉得鼓起的肌肉像皮下跑动的小老鼠。合在一起就是“把肌肉一点点‘建立’起来”。","mnemonic":["把它想成“盖房子”：build=建，muscles=肌肉的“房子”，增肌就是慢慢把“肌肉大楼”盖起来。","muscle 词源有“小老鼠”的意象：锻炼后手臂鼓起来，像有小老鼠在皮下跑——更好记。"]}
{"word":"build nests","summary":{"en":"construct nests; sometimes used figuratively for settling or spreading","zh":"筑巢；有时引申为安顿或滋生"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to make or construct nests (usually said of birds or other animals)","zh":"（通常指鸟类或其他动物）筑巢、搭建巢穴"},"examples":[{"en":"In spring, many birds build nests to lay their eggs.","zh":"春天，许多鸟会筑巢来产卵。"},{"en":"Swallows often build nests under the eaves of houses.","zh":"燕子常常在屋檐下筑巢。"},{"en":"The pair returned to the same tree to build nests again this year.","zh":"这对鸟今年又回到同一棵树上筑巢。"}]},{"partOfSpeech":"phrase","definition":{"en":"to create a place where something can settle and develop, used in a more general or figurative sense","zh":"（引申）营造一个能“安顿并发展”的地方；建立“据点/温床”"},"examples":[{"en":"Dust can build nests in unused corners of the room.","zh":"灰尘会在房间不用的角落里“安家/堆积”。"},{"en":"If you don’t clean the pipes, bacteria can build nests there.","zh":"如果不清理管道，细菌可能会在那里面“滋生/扎根”。"}]}],"synonyms":["make nests","construct nests","nest","set up nests"],"phonetic":"/bɪld nɛsts/","extraExplanation":["这是一个固定搭配（collocation）：更自然的说法常是 birds build nests（鸟筑巢）。","用于比喻时，语气往往带一点“放任不管就会滋生”的感觉，如 dust/bacteria build nests。"],"etymology":"由 build（建造）+ nest（巢）组成的常见搭配；在自然记录与科普语境中尤为常见，也可引申表示“安顿、滋生”。","mnemonic":["把它想成中文“搭窝/筑巢”：build=搭/建，nests=窝/巢。","联想“nest（巢）≈‘窝’”：build nests 就是“建窝”。"]}
{"word":"build on","summary":{"en":"develop or expand something using what already exists as a base","zh":"在已有基础上发展、扩展或改进"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to develop or improve something by using earlier work, ideas, or success as a base","zh":"在已有基础上发展、改进（把之前的成果当作基础）"},"examples":[{"en":"The new plan builds on what we learned last year.","zh":"新计划是在我们去年学到的东西基础上制定的。"},{"en":"We want to build on our strengths, not start over.","zh":"我们想在自身优势上继续提升，而不是从头来过。"}]},{"partOfSpeech":"phrase","definition":{"en":"to add more details or information to an idea or statement","zh":"补充、扩展（观点/说法/内容）"},"examples":[{"en":"Could you build on that point with an example?","zh":"你能用一个例子来补充说明你的观点吗？"},{"en":"She built on his comments and made the argument clearer.","zh":"她在他的评论基础上进一步展开，让论点更清楚。"}]},{"partOfSpeech":"phrase","definition":{"en":"to construct something on top of or onto an existing structure or piece of land","zh":"在（原有建筑/土地）上加建或兴建"},"examples":[{"en":"They built on an extra room at the back of the house.","zh":"他们在房子后面加建了一间房。"},{"en":"The city plans to build on this empty lot.","zh":"市政府计划在这块空地上建造（建筑物）。"}]}],"synonyms":["develop","expand","extend","elaborate on","add to","advance","build upon","capitalize on"],"phonetic":"/bɪld ɑn/","extraExplanation":["常见于学习、工作语境：build on experience（在经验基础上提升）、build on success（乘胜追击/巩固成果）、build on an idea（完善一个想法）。","与 build up 区分：build on 强调“基于某个基础继续发展”；build up 更常强调“逐步积累/增强”（如 build up confidence）。"],"etymology":"源自动词 build（建造）+ 介词 on（在……之上）。先有“在……上建造”的字面义，后来引申为“在……基础上发展/扩展”。","mnemonic":["把 on 理解成“在……上面”：在旧地基上继续盖＝在旧成果上继续做大。","联想中文“在……基础上”：看到 on 就想到“在……之上”。"]}
{"word":"build on ...","summary":{"en":"develop further from an existing base; strengthen or expand by adding to it","zh":"以既有基础继续发展；在原有成果上增强或扩大"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to use an idea, plan, or situation as a base and develop it further","zh":"以（某想法/计划/现状）为基础进一步发展、深化"},"examples":[{"en":"We’ll build on what we learned last week in today’s lesson.","zh":"今天的课会在上周所学的基础上继续深化。"},{"en":"The new policy builds on earlier efforts to reduce waste.","zh":"这项新政策是在此前减少浪费的努力基础上进一步推进的。"}]},{"partOfSpeech":"phrase","definition":{"en":"to add to something and make it stronger, bigger, or more successful","zh":"在原有基础上增强、扩大或巩固（成果/优势）"},"examples":[{"en":"The team wants to build on last season’s success.","zh":"球队希望在上赛季成功的基础上再接再厉。"},{"en":"She built on her savings by investing regularly.","zh":"她通过定期投资让存款不断增加。"}]}],"synonyms":["develop","expand","extend","advance","improve","capitalize on","build upon"],"phonetic":"/bɪld ɑn/","extraExplanation":["常见搭配：build on an idea/experience/success/strength（在想法/经验/成功/优势的基础上继续发展）。","语气比“copy/imitate（照搬/模仿）”更积极，强调“继承并推进”。"],"etymology":"源自动词 build（建造）+ 介词 on（在……之上）。由“在某物上继续搭建”引申为“以……为基础继续发展/加强”。","mnemonic":["把它想成“在上面继续盖一层”：先有地基/成果（base），再往上加楼（progress）。","on = 在……之上；build on = 在……之上建 → 以……为基础深化。"]}
{"word":"build on sth.","summary":{"en":"develop further using something as a foundation; sometimes add an extension","zh":"以……为基础继续发展；也可指扩建"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to use an idea, situation, or achievement as a starting point and develop it further","zh":"以……为基础，在其上继续发展/改进"},"examples":[{"en":"Let’s build on what we learned last week and try a harder problem.","zh":"我们以这周学到的为基础，再来做一道更难的题。"},{"en":"The new policy builds on earlier efforts to reduce traffic.","zh":"这项新政策是在此前减少交通拥堵的努力基础上进一步推进的。"},{"en":"She built on her early success and became a leading researcher.","zh":"她在早期成功的基础上继续努力，后来成了一名顶尖研究员。"}]},{"partOfSpeech":"phrase","definition":{"en":"to increase something (often a feeling, relationship, or idea) gradually over time","zh":"逐步增强/积累（常指情感、信任、关系、想法等）"},"examples":[{"en":"They built on their friendship until it turned into trust.","zh":"他们在友谊的基础上逐步加深，直到建立起信任。"},{"en":"Small wins build on each other and create confidence.","zh":"小的胜利会相互累积，带来自信。"}]},{"partOfSpeech":"phrase","definition":{"en":"to add an extra part to a building or room (an extension)","zh":"在（房屋等）原有基础上加建/扩建"},"examples":[{"en":"They plan to build on a new bedroom next year.","zh":"他们计划明年加建一间新卧室。"},{"en":"We built on a small porch at the back of the house.","zh":"我们在房子后面加建了一个小门廊。"}]}],"synonyms":["develop","expand","extend","improve on","advance","elaborate on","add to","augment","build upon"],"phonetic":"bɪld ɑn","extraExplanation":["常见结构：build on + 名词/代词/动名词（doing）。如：build on your experience / build on the idea / build on learning English daily。","与 build upon 意思基本相同；build upon 更正式一些。","常见搭配：build on strengths（发挥优势）、build on success（乘胜追击/在成功基础上再发展）、build on evidence（基于证据进一步论证）。"],"etymology":"“build”源自古英语，意为“建造”。“build on”字面是“在……上建造”，引申为“以……为基础继续发展/推进”，也保留了“扩建”的本义。","mnemonic":["把 on 理解成“在……上面”：先有“地基/基础”，才能“在上面盖更高”。= 以……为基础继续发展。","联想中文“在……基础上继续推进/更上一层楼”。"]}
{"word":"build one's house","summary":{"en":"build a home for oneself; establish a stable life foundation","zh":"给自己建房；安家并建立稳固的人生基础"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to construct a home for oneself; to set up a settled place to live","zh":"给自己建造房屋；安家落户"},"examples":[{"en":"They decided to build their house near the river.","zh":"他们决定在河边建自己的房子。"},{"en":"After years of moving, she wanted to build her house in one place and stay.","zh":"漂泊多年后，她想在一个地方安家并留下来。"}]},{"partOfSpeech":"phrase","definition":{"en":"(figurative) to create a stable foundation for one’s life, family, or future","zh":"（比喻）为生活、家庭或未来打下稳固基础"},"examples":[{"en":"He worked hard to build his house—financially and emotionally—before getting married.","zh":"他在结婚前努力为自己打基础——无论是经济上还是情感上。"},{"en":"Good habits are how you build your house for the future.","zh":"好习惯就是为未来打基础。"}]}],"synonyms":["build a home","settle down","set up home","establish a home","put down roots","lay a foundation"],"phonetic":"/bɪld wʌnz haʊs/","extraExplanation":["常见搭配：build one’s house on/upon something（把人生/事业建立在某种基础上），尤其常用于“build one’s house on solid ground / on the rock（建立在坚实基础上）”。","注意：build one’s house 是较书面或带比喻色彩的说法；日常口语更常说 build a house, buy a house, settle down。"],"etymology":"字面由 build（建造）+ house（房屋）组成。也常见于宗教/文学语境，如《圣经》中“把房子建在磐石上/沙土上”的比喻，用“房子”象征人生与信念的基础。","mnemonic":["把 one’s house 想成“自己的家＝安身之所”，所以 build one’s house 不仅是“盖房”，也可联想到“建立人生根基”。","联想中文“安家”：build（建立）+ house（家）≈“建立一个家/安家落户”。"]}
{"word":"build quality","summary":{"en":"how well something is made and put together","zh":"做工与装配等体现出来的整体制造/施工水平"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"the overall standard of how well something (especially a product or building) is made, including materials, workmanship, and durability","zh":"（尤指产品或建筑的）做工与用料等综合水平；制造/施工质量；耐用度与精细程度"},"examples":[{"en":"This laptop has excellent build quality for the price.","zh":"以这个价格来说，这台笔记本的做工质量非常好。"},{"en":"We chose that contractor because of their consistent build quality.","zh":"我们选择那家承包商是因为他们的施工质量一直很稳定。"},{"en":"The car feels solid, but the interior build quality could be better.","zh":"这车开起来很扎实，但内饰的做工还有提升空间。"}]}],"synonyms":["workmanship","construction quality","fit and finish","craftsmanship","durability"],"phonetic":"/bɪld ˈkwɑləti/","extraExplanation":["常见搭配：high/poor build quality（做工好/差）；solid build quality（很扎实的做工）；build quality issues（做工问题）。","语境区别：build quality 更强调“做工/结构/装配”和“用料”，而 product quality/quality 一般更泛，可能包含性能、功能、服务等。"],"etymology":"由 build（建造/制造）+ quality（质量）组合而成的现代常用搭配，最早多见于工程、制造业与消费电子评测语境，用来概括“做工与用料的品质”。","mnemonic":["把 build 联想成“组装/搭建”，build quality 就是“搭得好不好、装得牢不牢”。","联想中文常说的“做工”“用料”“扎实”：看到 build quality 就想到这三个关键词。"]}
{"word":"build resilience","summary":{"en":"develop the ability to recover and adapt after difficulties","zh":"培养从困难中恢复并适应的能力"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to develop or strengthen the ability to recover quickly from stress, difficulties, or change","zh":"培养或增强从压力、困难或变化中迅速恢复的能力"},"examples":[{"en":"Regular exercise and enough sleep can help you build resilience during stressful times.","zh":"规律运动和充足睡眠能帮助你在压力时期建立韧性。"},{"en":"After failing the exam, she tried to build resilience by learning from her mistakes.","zh":"考试失败后，她通过从错误中学习来培养韧性。"},{"en":"The team built resilience by practicing how to respond when plans changed.","zh":"团队通过练习在计划变化时如何应对来增强韧性。"}]},{"partOfSpeech":"phrase","definition":{"en":"to improve a group’s or system’s capacity to withstand shocks and continue functioning (e.g., communities, businesses, networks)","zh":"提升群体或系统抵御冲击并持续运转的能力（如社区、企业、网络）"},"examples":[{"en":"The city is building resilience to floods by improving drainage and early-warning systems.","zh":"这座城市通过改善排水和预警系统来提升抗洪韧性。"},{"en":"The company built resilience in its supply chain by using multiple suppliers.","zh":"公司通过使用多个供应商来增强供应链韧性。"}]}],"synonyms":["develop resilience","cultivate resilience","strengthen resilience","become more resilient","bounce back","recover","adapt","toughen up"],"phonetic":"/bɪld rɪˈzɪliəns/","extraExplanation":["常见搭配：build resilience to stress/pressure/change（对压力/变化建立韧性）；build emotional/mental resilience（情绪/心理韧性）；build community resilience（社区韧性）。","学习提示：resilience 常表示“反弹力、复原力、韧性”，语气偏积极，强调“恢复并继续前进”，而不只是“忍耐”。"],"etymology":"“Resilience”来自拉丁语 resilire（意为“反弹、弹回”），后来引申为“从打击中恢复的能力”。“Build”在这里是比喻用法，表示“逐步培养/建立（能力或特质）”。","mnemonic":["把 resilience 想成“橡皮筋的回弹力”：拉伸（遇到挫折）→还能弹回（恢复）。build resilience=把“回弹力”练出来。","联想：re-（再次）+ sil/ sal（跳）→“再跳回来”≈“复原、反弹”。"]}
{"word":"build sales","summary":{"en":"increase revenue by steadily developing customers and selling channels","zh":"通过持续经营客户与渠道来逐步提升销售额"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to increase sales over time by developing customers, demand, and effective selling processes","zh":"通过开发客户、培养需求和改进销售流程来逐步提升销量/销售额"},"examples":[{"en":"The new marketing campaign helped build sales in the first quarter.","zh":"新的营销活动帮助公司在第一季度拉动了销量/销售额。"},{"en":"They’re focusing on customer support to build sales through repeat orders.","zh":"他们把重点放在客户支持上，通过复购来提升销售。"},{"en":"Training the team is a key step to build sales in a new region.","zh":"培训团队是在新地区打开市场、提升销售的关键一步。"}]},{"partOfSpeech":"phrase","definition":{"en":"to create or strengthen a sales channel or sales pipeline (leads → prospects → customers)","zh":"搭建或强化销售渠道/销售管道（线索→意向→成交）"},"examples":[{"en":"We need to build sales with local partners before launching nationwide.","zh":"在全国推广前，我们需要先通过本地合作伙伴建立销售渠道。"},{"en":"She built sales by networking at industry events and following up regularly.","zh":"她通过参加行业活动拓展人脉并持续跟进，逐步建立销售来源。"}]}],"synonyms":["increase sales","boost sales","grow sales","drive sales","expand sales","generate sales","develop sales","raise sales"],"phonetic":"/bɪld seɪlz/","extraExplanation":["常见搭配：build sales in a market（在某市场提升销售）、build sales momentum（积累销售势头）、build sales channels（建立销售渠道）、build sales pipeline（建立销售管道）。","语气与场景：多用于商业写作/会议中，比“increase sales”更强调“长期经营、打基础”。"],"etymology":"这是由动词 build（“建造、建立、逐步形成”）+ 名词 sales（“销售、销量、销售额”）组成的常见商务搭配。这里的 build 表示“从无到有、逐步累积”，强调过程而非一次性提升。","mnemonic":["把它想成“建销售大楼”：一层层打地基（客户、渠道、口碑），才能把销售“盖”起来。","build=建立/打造；sales=销售：合起来就是“打造销售”。"]}
{"word":"build sandcastles","summary":{"en":"make sand castles; also, make unrealistic plans","zh":"堆沙堡；也指做不切实际的计划/空想"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to make a small castle-shaped structure from wet sand, usually on a beach","zh":"用湿沙堆出城堡形状的小建筑（通常在海滩上）"},"examples":[{"en":"The kids love to build sandcastles near the water.","zh":"孩子们喜欢在水边堆沙堡。"},{"en":"We built sandcastles and then watched the tide wash them away.","zh":"我们堆了沙堡，然后看着潮水把它们冲走。"}]},{"partOfSpeech":"phrase","definition":{"en":"to make unrealistic plans or daydream about something unlikely to happen","zh":"做不切实际的计划；空想（不太可能实现的事）"},"examples":[{"en":"He’s building sandcastles if he thinks he can finish the project in one day.","zh":"如果他以为一天就能完成这个项目，那就是在做白日梦。"},{"en":"It’s easy to build sandcastles when you don’t look at the real costs.","zh":"不去看真实成本时，人很容易空想。"}]}],"synonyms":["make sandcastles","daydream","fantasize","dream","imagine","build castles in the air"],"phonetic":"/bɪld ˈsændˌkæsəlz/","extraExplanation":["更常见的固定说法是单数：build sandcastles（字面）和 build castles in the air（更偏“空想”）。不过在口语中，人们也会用 build sandcastles 来强调“像沙堡一样不牢靠的计划”。","搭配提示：build sandcastles on the beach（在海滩堆沙堡）；be building sandcastles（在空想/不切实际地计划）。"],"etymology":"字面义来自海滩活动：用湿沙“建造城堡”。引申义基于沙堡很容易被海浪冲毁，因此比喻“脆弱、难以实现的计划或幻想”。","mnemonic":["把 sandcastle 想成“沙子+城堡”，沙堡一冲就散＝不牢靠的计划。","联想中文：沙堡像“空中楼阁”，好看但不稳。"]}
{"word":"build sb up","summary":{"en":"encourage or strengthen; sometimes exaggerate someone’s importance","zh":"鼓励并增强；有时指吹捧夸大某人"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to encourage someone and increase their confidence, hope, or emotional strength","zh":"鼓励某人、增强其信心/希望/心理力量"},"examples":[{"en":"Her teacher built her up by praising her effort, not just her grades.","zh":"老师通过表扬她的努力（而不只是成绩）来增强她的信心。"},{"en":"Good friends build you up when you’re feeling down.","zh":"当你情绪低落时，好朋友会鼓励你、给你力量。"},{"en":"The coach’s speech really built the team up before the match.","zh":"教练的讲话在比赛前真的把全队的士气鼓了起来。"}]},{"partOfSpeech":"phrase","definition":{"en":"to make someone seem more important, skilled, or impressive than they really are (often for promotion)","zh":"把某人捧得很高、吹捧（常用于宣传或造势）"},"examples":[{"en":"The company built him up as a genius inventor in its ads.","zh":"公司在广告里把他捧成天才发明家。"},{"en":"The media built the singer up as the “next big thing.”","zh":"媒体把这位歌手吹捧成“下一个超级巨星”。"}]},{"partOfSpeech":"phrase","definition":{"en":"to gradually strengthen or develop something (such as a skill, habit, or strength)","zh":"逐步增强、培养（能力/习惯/体力等）"},"examples":[{"en":"She’s building up her stamina by running a little farther each week.","zh":"她通过每周多跑一点来逐步增强耐力。"},{"en":"It takes time to build up trust in a new relationship.","zh":"在一段新关系中建立信任需要时间。"}]}],"synonyms":["encourage","boost","uplift","embolden","strengthen","bolster","hype","talk up","promote","build confidence"],"phonetic":"/bɪld ʌp/","extraExplanation":["用法提示：作“鼓励/捧高”时通常接人作宾语（build someone up）。作“逐步增强”时既可接人也可接事物（build up confidence / build up stamina）。","常见反义表达：tear someone down（贬低、打击某人）。","语气：在“鼓励”义时偏正面；在“吹捧”义时可能带一点“夸大宣传”的意味，需看语境。"],"etymology":"“build”本义是“建造”，后来引申为“逐步增加/形成”。“build sb up”作为短语动词，把“up”加进去强调“向上、增强、累积”的结果。","mnemonic":["把“build”想成“盖房子”，“up”就是“往上盖”→把人的信心/形象/能力“垒高”。","联想中文“打气/捧起来/堆起来”：都带“向上增加”的感觉。"]}
{"word":"build sb. up","summary":{"en":"encourage or strengthen someone; sometimes exaggerate","zh":"鼓励或增强某人；有时指夸大吹捧"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to praise, encourage, or support someone so they feel more confident and valued","zh":"表扬、鼓励或支持某人，让对方更有自信、更被认可"},"examples":[{"en":"Good coaches build their players up instead of criticizing every mistake.","zh":"好教练会鼓励队员，而不是逮着每个错误就批评。"},{"en":"Her friends built her up after the interview.","zh":"面试后，她的朋友们鼓励了她。"},{"en":"Try to build your child up with specific praise.","zh":"尽量用具体的表扬来鼓励孩子。"}]},{"partOfSpeech":"phrase","definition":{"en":"to make someone stronger or healthier, often through training or practice","zh":"使某人变得更强壮/更健康（常指训练、锻炼或长期培养）"},"examples":[{"en":"He built himself up with a simple workout routine.","zh":"他通过一套简单的锻炼计划让自己强壮起来。"},{"en":"The program helps build students up through daily speaking practice.","zh":"这个项目通过每天的口语练习来提升学生能力。"}]},{"partOfSpeech":"phrase","definition":{"en":"to make someone or something seem more impressive than it really is; to exaggerate","zh":"把某人/某事吹得很厉害；夸大其词"},"examples":[{"en":"The ad built the product up as a life-changing invention.","zh":"广告把这个产品吹成了“改变人生”的发明。"},{"en":"Don’t build it up too much, or people will be disappointed.","zh":"别把它吹得太厉害，不然大家会失望。"}]}],"synonyms":["encourage","boost","support","praise","uplift","strengthen","bolster","inflate","exaggerate","talk up"],"phonetic":"/bɪld ˈsʌmwʌn ʌp/","extraExplanation":["常见搭配：build sb. up（鼓励某人）、build up confidence（建立自信）、build up strength（增强力量）。","注意对比：tear sb. down 表示“打击、贬低某人”，语气相反。","口语里 sb. = somebody；写作中通常用 someone/somebody。"],"etymology":"“build up”原意是“建造起来、逐步累积”。后来引申为“逐步增强（力量/信心）”，以及“把……渲染得更厉害（夸大）”。","mnemonic":["联想“盖楼”：一句句好话像“砖头”一样把一个人的自信“建起来”。","把 up 理解成“向上”：让情绪、能力、评价都“往上升”。"]}
{"word":"build self-confidence","summary":{"en":"develop lasting confidence in yourself","zh":"逐步建立对自己的持久信心"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to develop a stronger belief in your own abilities and value; to become more confident","zh":"建立（增强）自信；对自己的能力和价值更有信心"},"examples":[{"en":"Joining the debate club helped her build self-confidence.","zh":"参加辩论社团帮助她建立了自信。"},{"en":"Small daily wins can build self-confidence over time.","zh":"每天一点点的小胜利，久而久之能增强自信。"},{"en":"The coach tried to build the team’s self-confidence before the game.","zh":"教练在比赛前努力提升球队的自信心。"}]}],"synonyms":["develop confidence","gain confidence","grow in confidence","increase confidence","boost self-confidence","build confidence"],"phonetic":"/bɪld ˌsɛlfˈkɑnfɪdəns/","extraExplanation":["常见搭配：build self-confidence in someone（帮助某人建立自信）；build self-confidence through practice（通过练习建立自信）。","近义表达与细微差别：boost self-confidence 更强调“提升/提振”（可能更快、更短期）；build self-confidence 更强调“逐步培养”（长期、可持续）。","使用场景：面试/演讲训练、学习新技能、运动训练、心理成长等。"],"etymology":"“build”原意是“建造”，引申为“逐步建立/培养”；“self-confidence”由“self（自我）+ confidence（信心）”组成，表示“对自己的信心”。合起来常用于心理、教育、职场语境。","mnemonic":["把它想成“盖房子”：自信像房子，需要一块块砖（小目标、小行动）慢慢“build”起来。","self-confidence= self（自己）+ confidence（信心），直译就是“对自己有信心”。"]}
{"word":"build something on something","summary":{"en":"develop further from an existing base","zh":"在既有基础上进一步发展"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to use something as a base or starting point to create, improve, or develop something further","zh":"以某事为基础/起点，在其上继续建立、完善或发展"},"examples":[{"en":"We can build on your idea by adding a clearer timeline.","zh":"我们可以在你的想法基础上，加一个更清晰的时间表来完善它。"},{"en":"The new research builds on earlier studies.","zh":"这项新研究是在早期研究的基础上发展而来的。"},{"en":"She built on her experience to become a better leader.","zh":"她在自身经验的基础上提升，成为更好的领导者。"}]},{"partOfSpeech":"phrase","definition":{"en":"to add extra details or information to make something longer, richer, or more complete (often in writing or speaking)","zh":"补充细节/信息，使表达更完整、更丰富（常用于写作或口头表达）"},"examples":[{"en":"Could you build on that point with an example?","zh":"你能用一个例子来补充说明一下那个观点吗？"},{"en":"He built on the story to make it more interesting.","zh":"他在故事基础上添了些内容，让它更有趣。"}]}],"synonyms":["develop","expand on","elaborate on","extend","build upon","add to","advance","broaden"],"phonetic":"/bɪld ɑn/","extraExplanation":["常见结构：build on + 名词/代词（build on it/this/that; build on experience; build on research）。","与 build up 区分：build on 强调“以…为基础继续发展”；build up 更常强调“逐步积累/加强”（如 build up confidence, build up pressure）。"],"etymology":"“build”源自古英语，原意与“建造、修建”有关；搭配介词“on”后，从“在…上建造（实体）”引申为“在…基础上发展（抽象：观点、计划、研究、经验等）”。","mnemonic":["把 on 理解成“在…上”：像在地基上继续“盖楼”→ 引申为“在原有基础上继续发展”。","联想中文固定搭配“在……基础上”：build on = 在……基础上。"]}
{"word":"build sth. out of ...","summary":{"en":"make something using a particular material; also, create something from available resources","zh":"用某种材料搭建/制作；也指利用现有资源创造出某物"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to make or create something using a particular material","zh":"用某种材料制作/搭建某物"},"examples":[{"en":"They built a small shed out of wood.","zh":"他们用木头搭了一个小棚子。"},{"en":"The kids built a robot out of cardboard and tape.","zh":"孩子们用纸板和胶带做了一个机器人。"},{"en":"This table was built out of recycled plastic.","zh":"这张桌子是用回收塑料做的。"}]},{"partOfSpeech":"phrase","definition":{"en":"to create something by using what is available (such as time, skills, or resources)","zh":"利用现有的东西（时间/技能/资源等）创造出某物"},"examples":[{"en":"She built a successful business out of a small idea.","zh":"她从一个小点子发展出了成功的生意。"},{"en":"He built a career out of his love for cooking.","zh":"他把对烹饪的热爱发展成了一份职业。"}]}],"synonyms":["make from","construct from","create from","craft from","build with"],"phonetic":"/bɪld … aʊt əv/","extraExplanation":["和“be made of/from”相比：","- build sth. out of… 更强调“搭建/动手做”的过程（常见于房子、模型、手工）。","- be made of… 强调成品的材料，材料通常看得出来（The chair is made of wood. 椅子是木头的）。","- be made from… 强调材料经过加工后不易看出原样（Paper is made from wood. 纸由木材制成）。","常见搭配：build a house/shelter/bridge out of…, build a model out of…, build a business/career out of…（比喻用法）。"],"etymology":"“build”来自古英语，原意与“居住、建造”有关；“out of”表示“由……构成/从……中取材”，组合后常用来强调“材料来源”或“从无到有地打造”。","mnemonic":["把 out of 理解成“从……里面拿出来当材料”：从 wood 里“拿出来”做出 shed。","联想“搭积木”：用某种材料把东西“搭”出来（build…out of…）。"]}
{"word":"build sth. to order","summary":{"en":"custom-built based on a customer’s specifications","zh":"按客户要求定制建造"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to build something according to a specific customer’s request (custom-made, not standard).","zh":"按客户的具体要求来建造（定制的，不是标准款）。"},"examples":[{"en":"The company can build kitchens to order in any size and style.","zh":"这家公司可以按需定制建造各种尺寸和风格的厨房。"},{"en":"They built the house to order, so it took longer than a regular model.","zh":"他们的房子是按订单定制建造的，所以比普通户型花的时间更长。"}]}],"synonyms":["custom-build","build to specification","build to spec","build to requirements","make to order","made-to-order","bespoke","custom-made"],"phonetic":"/bɪld ˈsʌmθɪŋ tə ˈɔɹdɚ/","extraExplanation":["“to order”在商业语境里很常见，意思是“根据客户提出的规格来做”，强调：不是现货/不是统一规格。","常见搭配：made to order（按需定做/现做）；custom-built（定制建造）；built-to-order（定制生产，常用于工厂/汽车/电脑配置）。"],"etymology":"源自“to order”（按订单/按要求），本义是“根据订单来做”。类似表达有“made to order（按需定制）”，后来也常与 build / make / manufacture 等动词搭配。","mnemonic":["把它拆开记：order=“订单/点单”。build sth. to order=“按订单来建造/按你点的来做”。","联想餐厅“made to order（现点现做）”：换成 build 就是“按要求现建/定制建造”。"]}
{"word":"build strength","summary":{"en":"develop greater physical, mental, or practical power over time","zh":"通过时间与积累增强体力、心理韧性或事物的效力"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to become stronger, or to develop physical power through exercise and training","zh":"增强体力；通过锻炼和训练让身体更强壮"},"examples":[{"en":"She started lifting weights to build strength in her arms.","zh":"她开始举重来增强手臂力量。"},{"en":"Yoga can build strength as well as flexibility.","zh":"瑜伽既能增强力量，也能提高柔韧性。"}]},{"partOfSpeech":"phrase","definition":{"en":"to develop the ability to cope better with stress, setbacks, or difficult emotions; to become more resilient","zh":"增强心理韧性；提升面对压力、挫折或负面情绪的承受力"},"examples":[{"en":"Talking to a counselor helped him build strength after the loss.","zh":"在失去亲人之后，和心理咨询师谈话帮助他建立起心理力量。"},{"en":"Small daily routines can build strength during hard times.","zh":"在困难时期，小的日常习惯也能增强内在力量。"}]},{"partOfSpeech":"phrase","definition":{"en":"to increase the strength or effectiveness of something (for example, an argument, a team, or a relationship)","zh":"增强某事物的力量或效力（如论点、团队或关系）"},"examples":[{"en":"The new evidence helped build strength in her argument.","zh":"新证据增强了她论点的说服力。"},{"en":"Regular communication can build strength in a relationship.","zh":"规律沟通能增强一段关系的稳固性。"}]}],"synonyms":["get stronger","gain strength","increase strength","develop strength","build up strength","strengthen"],"phonetic":"/bɪld strɛŋkθ/","extraExplanation":["常见搭配：build strength in + 身体部位（build strength in your core/legs）。","与“gain strength”相比，“build strength”更强调“通过训练/时间逐步建立”的过程；“increase strength”更偏客观数值或强度提升。","在健身语境里，build strength常与“muscle, endurance, stability”一起出现：build muscle（增肌）、build endurance（提升耐力）、build stability（提升稳定性）。"],"etymology":"“build”原意是“建造、建立”，来自古英语；后来引申为“逐步培养/增强”。“strength”来自古英语，表示“力量、强度”。合在一起强调“通过积累把力量建立起来”。","mnemonic":["把它想成“建（build）一座力量（strength）的房子”：一块砖一块砖练出来，强调“循序渐进”。","strength 里有 strong（强壮）：build strength = 把 strong 的状态“建起来”。"]}
{"word":"build the habits of cooperation","summary":{"en":"develop cooperative habits through repeated practice","zh":"通过反复练习来培养协作习惯"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to develop and strengthen repeated behaviors that help people work together effectively","zh":"培养并强化有助于人们高效协作的习惯性行为"},"examples":[{"en":"Group projects can build the habits of cooperation if roles and goals are clear.","zh":"如果分工和目标清晰，小组项目可以培养合作的习惯。"},{"en":"Teachers use team games to build the habits of cooperation, not just competition.","zh":"老师用团队游戏来培养合作习惯，而不只是竞争。"},{"en":"In a new workplace, regular check-ins help build the habits of cooperation.","zh":"在新职场里，定期沟通有助于建立协作习惯。"}]}],"synonyms":["develop cooperative habits","cultivate cooperation","foster teamwork","encourage collaboration","promote cooperation","build teamwork","learn to work together"],"phonetic":"/bɪld ðə ˈhæbɪts əv koʊˌɑpəˈreɪʃən/","extraExplanation":["常见语境：学校（课堂规则、合作学习）、家庭（分担家务）、职场（跨部门协作）、社区（志愿服务）。","语气偏积极、建设性，强调“可训练、可养成”的合作能力。","也可换说：build cooperative habits / develop a cooperative mindset（更强调“心态”）。"],"etymology":"这是一个现代英语搭配：build（“建立/培养”）+ habits（“习惯”）+ of + cooperation（“合作”）。常见于教育、管理与团队建设语境中，用“build”来表达“通过反复练习逐渐形成”。","mnemonic":["把它当成“盖房子”来记：build=搭建；habits=一块块“砖”；cooperation=大家一起动手，房子才盖得快。","“co-”=“共同”，cooperation=共同操作；反复“共同做事”就会形成habits（习惯）。"]}
{"word":"build up","summary":{"en":"to increase, strengthen, praise, or accumulate gradually","zh":"逐渐增强、建立；（也可指）吹捧或逐渐积聚"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to develop or increase gradually over time","zh":"逐渐发展；逐步增强（数量、程度、势头等）"},"examples":[{"en":"Trust builds up slowly in a new team.","zh":"新团队里的信任会慢慢建立起来。"},{"en":"Pressure built up as the deadline got closer.","zh":"随着截止日期临近，压力逐渐增大。"}]},{"partOfSpeech":"phrase","definition":{"en":"to strengthen something through practice or repeated effort","zh":"通过训练或反复努力来增强（能力、体力等）"},"examples":[{"en":"She built up her stamina by running every morning.","zh":"她通过每天早晨跑步来增强耐力。"},{"en":"We need to build up our skills before the exam.","zh":"我们需要在考试前提升技能。"}]},{"partOfSpeech":"phrase","definition":{"en":"to praise someone a lot or make something seem better or more exciting than it really is","zh":"过度夸赞；吹捧；把某事渲染得很厉害"},"examples":[{"en":"Don’t build it up too much—it’s just a small event.","zh":"别把它吹得太厉害——只是个小活动。"},{"en":"The coach built up the players’ confidence before the game.","zh":"教练在比赛前增强了队员们的信心。"}]},{"partOfSpeech":"phrase","definition":{"en":"to form or collect in one place, often gradually","zh":"逐渐堆积；积聚（灰尘、污垢、气体等）"},"examples":[{"en":"Dust can build up under the bed.","zh":"床底下会逐渐积灰。"},{"en":"Ice built up on the road overnight.","zh":"夜里路面结冰并逐渐堆积。"}]}],"synonyms":["develop","increase","grow","accumulate","strengthen","boost","enhance","pile up","mount","hype up"],"phonetic":"/bɪld ʌp/","extraExplanation":["用法提示：build up 是常见可分离短语动词。宾语是名词时可说 build up the team 或 build the team up；宾语是代词时通常放中间：build it up（不说 build up it）。"],"etymology":"来自 build（“建造、建立”）+ up（“向上、累积”）。引申为“逐步建立/增强/累积”，也可指把某人或某事“捧起来”。","mnemonic":["把 up 理解成“往上堆”：能力/情绪/压力/灰尘都可以“往上堆起来”＝build up。","联想“盖楼”：一层一层往上加，结果就是“逐渐增强/积累”。"]}
{"word":"build up a network of contacts","summary":{"en":"gradually develop useful professional relationships","zh":"逐步积累并发展有用的人脉关系"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to gradually create and strengthen a group of people you know who can share information, help, or provide opportunities (often for work or business)","zh":"逐步建立并巩固人脉关系网（常用于工作或商业场景）"},"examples":[{"en":"She built up a network of contacts in the tech industry by attending meetups.","zh":"她通过参加线下聚会，在科技行业逐步建立了人脉网络。"},{"en":"If you want more job opportunities, start building up a network of contacts early.","zh":"如果你想获得更多工作机会，就要尽早开始建立人脉关系网。"},{"en":"He built up his contacts through internships and volunteer work.","zh":"他通过实习和志愿者工作积累了人脉。"}]}],"synonyms":["build a network","cultivate connections","develop contacts","expand your network","network","forge relationships","make connections"],"phonetic":"/bɪld ʌp ə ˈnɛtˌwɝk əv ˈkɑnˌtækts/","extraExplanation":["常见搭配：build up a network of contacts / build up contacts / build a professional network。","语气与用法：多用于正式或职业语境，强调“长期、持续的积累”，比“make friends”更偏向职业人脉。","近义表达：network (动词) 也可表示“拓展人脉”，如：You should network more at conferences.（你在会议上应该多社交拓展人脉。）"],"etymology":"“build up”原意是“建造、堆积、逐步增强”；引申到人际关系中，表示“逐步积累/培养”。“network of contacts”中network指“网络”，contacts指“认识的人/联系人”。","mnemonic":["把“build up”想成“盖楼/攒积分”：不是一下子完成，而是日积月累；人脉也是一点点“攒”出来的。","network=“网”，contacts=“联系人”：把联系人像结网一样连起来，就是“人脉网”。"]}
{"word":"build up a reputation","summary":{"en":"gradually earn public opinion over time","zh":"通过时间与行动逐渐赢得名声/口碑"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to gradually gain a good (or sometimes bad) opinion from other people through repeated actions over time","zh":"通过长期、反复的行为逐渐建立（好或有时是坏的）名声/口碑"},"examples":[{"en":"She built up a reputation as a reliable manager.","zh":"她逐渐建立起“可靠的经理人”的名声。"},{"en":"The restaurant built up a reputation for great noodles.","zh":"这家餐馆逐渐建立起“面很好吃”的口碑。"},{"en":"He built up a reputation for being late, so people stopped waiting for him.","zh":"他逐渐落下“总迟到”的名声，所以大家不再等他了。"}]}],"synonyms":["earn a reputation","establish a reputation","gain a reputation","make a name for oneself","become known for"],"phonetic":"/bɪld ʌp ə ˌrɛpjəˈteɪʃən/","extraExplanation":["常用搭配：build up a reputation for + 名词/动名词（因……而出名）。例如：build up a reputation for honesty（以诚实闻名）。","语气与用法：build up 强调“逐渐”，不像“make a reputation”那么中性；它更突出过程与累积。","可正可负：既可以是好口碑（for quality/service），也可以是坏名声（for being rude/late）。"],"etymology":"“build up”本义是“逐步建造/积累”，引申为“逐渐形成（力量、数量、影响等）”。与“reputation（名声/口碑）”搭配时，强调名声是靠时间与行为一点点累积出来的。","mnemonic":["把它想成“把砖一块块垒起来”：reputation（口碑）不是一天来的，而是行为长期“累积”出来的。","联想中文：口碑=“口口相传”，需要时间慢慢“build up”。"]}
{"word":"build up expertise","summary":{"en":"gradually develop strong professional knowledge and skill","zh":"逐步积累并形成扎实的专业知识与技能"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to gradually develop (knowledge, skill, or experience) over time through learning and practice","zh":"（通过学习与练习）逐步积累并形成（知识、技能或经验）"},"examples":[{"en":"She built up expertise in data analysis by working on real projects.","zh":"她通过做真实项目逐步积累了数据分析方面的专业能力。"},{"en":"It takes years to build up expertise in medicine.","zh":"在医学领域建立专业能力通常需要多年时间。"},{"en":"Try to build up expertise step by step instead of rushing.","zh":"尽量循序渐进地积累专业能力，不要急于求成。"}]},{"partOfSpeech":"phrase","definition":{"en":"to increase or strengthen something gradually (such as confidence, strength, or savings)","zh":"（数量或程度）逐步增加；逐渐增强（如自信、体力或储蓄）"},"examples":[{"en":"He built up his confidence after a few successful presentations.","zh":"几次成功的演讲后，他的自信逐渐增强。"},{"en":"I’m building up my savings for graduate school.","zh":"我在为读研逐步攒钱。"}]}],"synonyms":["develop expertise","gain expertise","acquire expertise","cultivate expertise","hone skills","build competence","strengthen proficiency"],"phonetic":"/bɪld ʌp ˌɛkspɚˈtiz/","extraExplanation":["常见搭配：build up expertise in + 领域（in finance / in teaching / in AI）。","语气上比“become an expert”更强调过程：从零到熟练，是长期积累，不是一夜之间。","也可替换为：develop expertise（更正式）、gain expertise（强调获得）、acquire expertise（更书面）。"],"etymology":"“build up”来自动词 build（建造）+ 副词 up（向上/增加），原义是“建起来、堆起来”，后来引申为“逐步累积、逐渐增强”。“expertise”来自法语 expertise，和 expert（专家）同源，表示“专业知识/能力”。","mnemonic":["把它想成“搭积木”：每天加一块（练习/项目/反馈），最后“搭起”专业能力。","expertise 可联想“expert（专家）+ -ise（名词后缀）”：专家的能力=专业能力。"]}
{"word":"build up in the atmosphere","summary":{"en":"accumulate or increase over time in the air","zh":"在大气中随时间逐渐积累或增多"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to accumulate or increase in the air over time (often used for gases, heat, moisture, smoke, or pollution)","zh":"（气体、热量、水汽、烟雾、污染等）在大气中逐渐积累/增多"},"examples":[{"en":"Carbon dioxide can build up in the atmosphere and trap heat.","zh":"二氧化碳会在大气中积累并困住热量。"},{"en":"If there is little wind, smog may build up in the atmosphere near the ground.","zh":"如果风很小，烟雾霾可能会在近地面的大气中积聚。"},{"en":"Over millions of years, oxygen built up in the atmosphere as early life evolved.","zh":"在数百万年里，随着早期生命的演化，氧气逐渐在大气中积累。"}]},{"partOfSpeech":"phrase","definition":{"en":"to gradually become stronger or more intense in the surrounding air or environment (often used more broadly for effects like pressure, tension, or excitement)","zh":"（更广义）在周围环境中逐渐增强/加剧（如压力、紧张感、期待等）"},"examples":[{"en":"Before the storm, humidity built up in the atmosphere and everyone felt uncomfortable.","zh":"暴风雨前，空气湿度逐渐升高，大家都觉得不舒服。"},{"en":"As the final match approached, excitement built up in the atmosphere at the stadium.","zh":"随着决赛临近，体育场里的气氛越来越热烈。"}]}],"synonyms":["accumulate in the atmosphere","increase in the atmosphere","collect in the air","gather in the air","pile up","mount up"],"phonetic":"/bɪld ʌp ɪn ði ˈætməsfɪr/","extraExplanation":["在环境与气候语境里，“build up in the atmosphere”常搭配：carbon dioxide/CO2, methane, greenhouse gases, pollutants, aerosols 等，强调“随着时间推移不断累积”，并可能带来温室效应、空气污染等后果。"],"etymology":"“build up”是动词“build（建造）+ up（向上/增加）”形成的常见短语动词，逐渐引申为“积累、增强”。“atmosphere”源自希腊语：atmo-（蒸汽）+ sphaira（球体），指包围地球的一层空气。","mnemonic":["把“build up”想成“越堆越高”：像把东西一层层堆起来→在大气里“越积越多”。","联想中文“积累/堆积”：pollution builds up（污染堆积），CO2 builds up（二氧化碳堆积）。"]}
{"word":"build up one's confidence","summary":{"en":"gradually increase self-assurance","zh":"逐步增强自信心"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to increase someone’s confidence gradually; to make someone feel more sure of themselves","zh":"逐渐增强某人的自信；让某人更相信自己"},"examples":[{"en":"Her coach tried to build up her confidence before the race.","zh":"比赛前，她的教练努力帮她增强自信。"},{"en":"Small successes can build up your confidence over time.","zh":"一次次小成功会随着时间逐渐建立你的自信。"},{"en":"He built up his confidence by practicing every day.","zh":"他通过每天练习来提升自信。"}]}],"synonyms":["build confidence","boost confidence","increase confidence","strengthen confidence","bolster confidence"],"phonetic":"/bɪld ʌp wʌnz ˈkɑnfɪdəns/","extraExplanation":["常见搭配：build up confidence / build up your confidence / build up someone’s confidence。","语气上通常强调“慢慢变强”的过程；如果想表达“马上让人有信心”，更常用“boost confidence”。","近义表达对比：build confidence（更常见、更简洁）；build up one’s confidence（更强调“逐步累积”）。"],"etymology":"“build up”字面意思是“建造、堆积起来”，后来引申为“逐步增强/积累（力量、信心、经验等）”。“one’s confidence”指“某人的自信”。","mnemonic":["把自信想成“砖块”：每天进步一点点，就在“把自信盖起来（build up）”。","联想中文“建立自信”：build≈建立，up≈往上提升。"]}
{"word":"build up stamina","summary":{"en":"gradually increase endurance and energy","zh":"逐步提升耐力与精力"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to gradually develop more strength and endurance so you can do an activity for longer without getting tired","zh":"逐步增强体力与耐力，使自己能更久地运动/工作而不易疲劳"},"examples":[{"en":"If you run three times a week, you’ll build up stamina in a month or two.","zh":"如果你每周跑三次步，一两个月就能逐步增强耐力。"},{"en":"Start with short workouts and slowly build up your stamina.","zh":"先从短时间训练开始，慢慢把耐力练起来。"},{"en":"She built up stamina by walking every day and taking the stairs.","zh":"她每天走路、爬楼梯，逐渐把体力和耐力练上来了。"}]}],"synonyms":["increase endurance","improve stamina","develop endurance","get fitter","gain endurance"],"phonetic":"/bɪld ʌp ˈstæmɪnə/","extraExplanation":["常见搭配：build up stamina（增强耐力）、build stamina（增强耐力）、improve endurance（提高耐力）。","语感提示：build up 强调“逐步、累计”；不是一次就变强。","近义表达区别：stamina偏“能持续做下去的体能/精力”；endurance更偏“扛得住、坚持得久”的能力（可用于体力或精神）。"],"etymology":"“build up”本义是“建造、堆积、逐渐增加”；“stamina”源自拉丁语，原指“经线/线头”，引申为“生命力、持续力、耐力”。合起来就是“把耐力一点点累积起来”。","mnemonic":["把 build up 想成“把砖一块块垒高”，stamina 就是“耐力墙”，只能靠长期累积。","stamina 听起来像“死他慢啊”→别急，慢慢练，耐力才会涨。"]}
{"word":"build up to sth.","summary":{"en":"gradually progress or prepare until reaching a key point","zh":"逐步推进或准备，直到达到关键点"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to gradually develop or increase until reaching a particular point","zh":"逐步发展/增强，直到达到某个程度或阶段"},"examples":[{"en":"The story builds up to a surprising ending.","zh":"故事逐步铺垫，直到一个令人惊讶的结局。"},{"en":"The music builds up to a powerful chorus.","zh":"音乐逐渐推进，直到强有力的副歌。"},{"en":"Tension built up to the moment the winner was announced.","zh":"紧张气氛逐渐累积，直到宣布获胜者的那一刻。"}]},{"partOfSpeech":"phrase","definition":{"en":"to prepare for something by doing small steps first","zh":"为某事做铺垫/做准备（先从小步骤开始）"},"examples":[{"en":"We’re building up to a full marathon by running longer distances each week.","zh":"我们每周逐步加长跑步距离，为全程马拉松做准备。"},{"en":"Start with simple conversations and build up to longer presentations.","zh":"先从简单对话开始，再逐步过渡到更长的演讲。"}]}],"synonyms":["lead up to","work up to","build toward","culminate in","develop into"],"phonetic":"/bɪld ʌp tu/","extraExplanation":["常见结构：build up to + 名词/动名词（N/doing）。表示“逐步走向/铺垫到……”。","语感对比：build up（积累、增强）强调过程；build up to sth. 强调“最后到达的那个点”（高潮、结果、关键时刻）。","常用于叙事与艺术：电影、小说、演讲、音乐常说 build up to a climax/ending。"],"etymology":"“build”本义是“建造”，后引申为“逐步建立、积累”。“up”强调“向上/增加”。“to”引出所达到的目标点或阶段。","mnemonic":["把它想成“搭积木往上搭”：一块一块加上去，最后“搭到”某个目标点（to sth.）。","up=越来越多、越来越强；to=到达终点：一步步增强→直到某个时刻。"]}
{"word":"build upon","summary":{"en":"develop further from an existing base; rely on as a foundation","zh":"在既有基础上进一步发展；以……为依据/支撑"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to use an idea, achievement, or situation as a starting point and develop it further","zh":"以某个想法/成果/基础为起点，在此基础上进一步发展、完善"},"examples":[{"en":"The new proposal builds upon last year’s research.","zh":"这份新提案是在去年的研究基础上发展出来的。"},{"en":"We can build upon what we learned in the first unit.","zh":"我们可以在第一单元所学的基础上继续深入。"},{"en":"The author builds upon earlier theories to explain modern problems.","zh":"作者在早期理论的基础上进一步解释现代问题。"}]},{"partOfSpeech":"phrase","definition":{"en":"to rely on something as support or a foundation (often abstract, like trust or experience)","zh":"以……作为支撑/依据（常指信任、经验等抽象基础）"},"examples":[{"en":"A strong relationship is built upon trust.","zh":"牢固的关系建立在信任之上。"},{"en":"Her confidence is built upon years of practice.","zh":"她的自信建立在多年的练习之上。"}]}],"synonyms":["build on","expand on","develop","extend","elaborate on","advance","draw on"],"phonetic":"/bɪld əˈpɑn/","extraExplanation":["常见搭配：build upon an idea / evidence / experience / success / foundation。","与 build on 基本同义；build upon 更正式一些，写作里更常见。","注意与 “build up” 区分：build up 更偏“逐步增强/积累（力量、信心、库存）”。"],"etymology":"“build”原意是“建造”，来自古英语 bealdan / byldan（使……建起来）。后来在学术、商业等语境中引申为“建立（观点、体系）”。“upon”表示“在……之上”，合起来就形成“在……基础上继续发展/建立”。","mnemonic":["把它想成“在……上面继续盖楼”：upon=在上面，build=建造 → 在基础上继续发展。","写作常用句型：This study builds upon…（本研究在……基础上拓展）。"]}
{"word":"build upon ...","summary":{"en":"to improve or develop something further using an existing base","zh":"在已有基础上进一步发展与完善"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to develop an idea, plan, or work further by adding more details or improvements, usually based on something that already exists","zh":"在已有基础上进一步发展（想法、计划或作品），通过补充细节或改进来完善"},"examples":[{"en":"In the next chapter, the author builds upon the themes introduced earlier.","zh":"在下一章里，作者在前面提出的主题基础上进一步展开。"},{"en":"We can build upon your proposal by adding a timeline and a budget.","zh":"我们可以在你的提案基础上补充时间表和预算，使它更完整。"},{"en":"The course builds upon what you learned in Level 1.","zh":"这门课程是在你一级所学内容的基础上继续加深的。"}]},{"partOfSpeech":"phrase","definition":{"en":"to use something as a foundation or starting point for progress or achievement","zh":"以某事为基础/起点继续取得进展或成就"},"examples":[{"en":"The team built upon last season’s success and reached the finals.","zh":"球队在上赛季成功的基础上更进一步，打进了决赛。"},{"en":"Scientists built upon earlier research to create a better vaccine.","zh":"科学家以早期研究为基础，研发出了更好的疫苗。"}]}],"synonyms":["build on","develop","expand","elaborate on","extend","enhance","advance"],"phonetic":"/bɪld əˈpɑn/","extraExplanation":["常见搭配：build upon an idea / a plan / a theory / research / experience / success。","语气通常偏正式，写作里也常用。口语里也可以说 build on（更常见、更简洁），意思基本相同：build on your idea。","不要直译成“建在……上面”的物理动作；多数情况下是比喻用法，指“在基础上改进/推进”。"],"etymology":"“build”原义为“建造”，引申为“建立（理论、计划等）”。“upon”表示“在……之上/基于……”。合起来强调“在已有东西之上继续加建、扩展”。","mnemonic":["把它想成“在……上面继续盖楼”：先有地基（已有成果），再一层层往上加（补充与提升）。","upon≈“在……之上/基于”，所以 build upon≈“基于……继续建立/完善”。"]}
{"word":"build upon mutual interests, and engage on the basis of mutual respect","summary":{"en":"cooperate by starting from shared interests and communicating with respect","zh":"以共同利益为起点并以相互尊重为原则开展合作与交流"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to strengthen cooperation or a relationship by focusing on shared interests and interacting with each other respectfully","zh":"以共同利益为基础推进合作/关系，并以相互尊重为原则进行交流互动"},"examples":[{"en":"The two teams built upon mutual interests and engaged on the basis of mutual respect to finish the project smoothly.","zh":"两个团队以共同利益为基础推进合作，并以相互尊重为原则进行沟通，顺利完成了项目。"},{"en":"In a diverse workplace, we can build upon mutual interests and engage on the basis of mutual respect.","zh":"在多元化的职场里，我们可以以共同兴趣为切入点开展合作，并以相互尊重为基础进行交流。"},{"en":"The negotiations moved forward when both sides built upon mutual interests and engaged on the basis of mutual respect.","zh":"当双方以共同利益为着力点、以相互尊重为基础进行对话时，谈判就向前推进了。"}]}],"synonyms":["find common ground","work from shared goals","cooperate respectfully","engage in good faith","build a constructive relationship","strengthen ties"],"phonetic":"/bɪld əˈpɑn ˈmjutʃuəl ˈɪntrəsts ænd ɪnˈɡeɪdʒ ɑn ðə ˈbeɪsɪs əv ˈmjutʃuəl rɪˈspɛkt/","extraExplanation":["语体偏正式，常用于合作倡议、谈判声明、组织价值观等场景。日常口语中可简化为：“focus on what we share and respect each other.”","build upon mutual interests 强调“共同利益/兴趣是合作的起点”；engage on the basis of mutual respect 强调“互动方式要尊重对方、平等沟通”。"],"etymology":"短语由两部分组成：build upon（在……基础上继续发展）+ mutual（相互的、共同的）+ engage on the basis of（以……为基础开展交流/交涉）+ mutual respect（相互尊重）。常见于外交、合作声明与正式沟通语境，强调“共同点+尊重”的合作框架。","mnemonic":["mutual＝“mut-”像“mutual/互相”，可联想中文“互”；mutual respect＝“互相尊重”。","build upon＝“在……上面继续盖楼”：先有共同兴趣/利益这块“地基”，再往上发展关系。"]}
{"word":"build-it-yourself","summary":{"en":"DIY; made to be assembled or done by the user.","zh":"DIY；需要自己动手组装或完成的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"made or done by the user, not bought ready-made or installed by professionals (DIY).","zh":"自己动手制作或完成的；非成品购买、非专业人员上门安装的（DIY）。"},"examples":[{"en":"We chose a build-it-yourself desk to save money.","zh":"我们选了一个需要自己组装的书桌来省钱。"},{"en":"The store sells build-it-yourself furniture with step-by-step instructions.","zh":"这家店卖需要自己组装的家具，并配有分步说明。"}]},{"partOfSpeech":"n.","definition":{"en":"a product kit intended for the user to assemble or complete on their own.","zh":"需要用户自行组装/完成的产品套件。"},"examples":[{"en":"This build-it-yourself comes with all the screws and a small tool.","zh":"这个自装套件附带所有螺丝和一把小工具。"},{"en":"They ordered a build-it-yourself for their new garden shed.","zh":"他们订了一个花园小棚屋的自装套件。"}]}],"synonyms":["do-it-yourself","DIY","self-assembled","self-built","homemade","ready-to-assemble"],"phonetic":"/ˌbɪld ɪt jərˈsɛlf/","extraExplanation":["常见同义表达是“DIY / do-it-yourself”。在英文里，作定语的复合形容词常用连字符：a build-it-yourself kit / build-it-yourself furniture。","有时也写作“build it yourself”（不加连字符），更像一句说明或口号；加连字符时更像一个固定属性（“自装型/自制型”）。"],"etymology":"由动词短语“build it yourself（自己把它建/装起来）”演变而来，20世纪后期在广告与包装文案中常用，作为复合形容词通常加连字符（build-it-yourself）。","mnemonic":["把它当成一句口令记：build + it + yourself = “自己把它装起来”。","联想中文“DIY/自己动手”：看到连字符就像“说明书里的步骤串起来”。"]}
{"word":"build-out","summary":{"en":"Build-out means the work (and often the cost) to finish or expand a space/project so it’s ready to use, especially in commercial real estate.","zh":"Build-out 指把空间/项目扩建或装修完善到可使用状态的工作（也常指相关费用），尤常见于商业地产。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Business/real estate) The process of expanding, adding, or completing something—especially the work and costs to finish an interior space (e.g., offices, shops) so it’s ready to use.","zh":"（商业/房地产）“扩建/完善/装修到可用状态”的过程；尤指把室内空间（如办公室、商铺）做完装修与配套，使其可以投入使用的工程与费用。"},"examples":[{"en":"The landlord paid for the build-out, and the tenant moved in a month later.","zh":"房东承担了装修完善（build-out）费用，租户一个月后就搬进去了。"},{"en":"Our retail build-out includes lighting, shelving, and a new checkout counter.","zh":"我们的零售店铺装修完善（build-out）包括照明、货架和新的收银台。"},{"en":"They delayed opening because the build-out took longer than expected.","zh":"他们推迟开业，因为装修完善（build-out）比预期更久。"}]},{"partOfSpeech":"n.","definition":{"en":"A set of finished features or components added to complete a space, system, or project (often used in project/tech talk).","zh":"为“完成”一个空间/系统/项目而新增的一套设施或组件（常见于项目管理/科技语境）。"},"examples":[{"en":"The next software build-out will add search and user profiles.","zh":"下一次软件功能扩展（build-out）会加入搜索和用户资料。"},{"en":"The build-out includes conference rooms, wiring, and security cameras.","zh":"这次配套完善（build-out）包括会议室、布线和监控摄像头。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing work that completes or equips a space or project (used before a noun).","zh":"（作定语）描述“完善/装修到可用状态”的（通常放在名词前）。"},"examples":[{"en":"We need a build-out budget before signing the lease.","zh":"在签租约前，我们需要一份装修完善（build-out）预算。"},{"en":"The build-out timeline depends on permits and contractors.","zh":"装修完善（build-out）的工期取决于许可审批和承包商。"}]}],"synonyms":["fit-out","renovation","buildout","tenant improvements (TI)","expansion"],"phonetic":"/ˈbɪld aʊt/","extraExplanation":["在北美商业地产里，build-out 常指“室内装修改造到可运营”的整套工程（也常叫 tenant improvements / TI）。不同租约可能规定由房东或租户承担费用，常见表达有 build-out costs（装修成本）、build-out allowance（装修补贴/额度）。","拼写上也常见 buildout（不加连字符），意思相同；口语/写作里以公司或行业习惯为准。"]}
{"word":"build-to-order","summary":{"en":"Build-to-order means a product is made after you order it, often with customization.","zh":"Build-to-order 指产品在你下单后才开始制造，通常可按需求定制。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"made only after a customer places an order (not kept in stock); customized as requested","zh":"按订单生产的；接单后才制造的（通常不囤货），可按客户需求定制"},"examples":[{"en":"These laptops are build-to-order, so delivery takes about two weeks.","zh":"这些笔记本电脑是按订单生产的，所以送达大约需要两周。"},{"en":"We chose a build-to-order sofa to get the exact fabric and size we wanted.","zh":"我们选择了按订单生产的沙发，这样能得到我们想要的面料和尺寸。"},{"en":"The company switched to a build-to-order model to reduce inventory costs.","zh":"这家公司改为按订单生产模式，以降低库存成本。"}]}],"synonyms":["made-to-order","custom-built","bespoke (BrE)","built-to-order"],"phonetic":"/ˌbɪld tə ˈɔɹdɚ/","extraExplanation":["“build-to-order”常见于制造业与零售供应链语境（如电脑、汽车、家具）。它强调先有订单再生产，通常意味着等待时间更长，但可定制程度更高、库存压力更小。","写法上常见为 build-to-order（带连字符，作定语：build-to-order system），也可写作 built-to-order（更强调“已按单建造好”的状态，如 a built-to-order PC）。"]}
{"word":"build-to-suit","summary":{"en":"“Build-to-suit” describes a property built specifically for one tenant or buyer’s needs.","zh":"“Build-to-suit”指为某个特定承租方或买方量身定制建设的房地产项目。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Real estate) designed and constructed specifically to meet the needs of a particular tenant or buyer, often as part of a lease or purchase agreement.","zh":"（房地产）按特定承租方或买方的需求量身定制并建设的（项目/建筑），常与租赁或购买协议配套。"},"examples":[{"en":"The retailer signed a build-to-suit lease for a new store near the highway.","zh":"这家零售商签了一份“按需定制建设”的租约，在高速公路旁建一家新店。"},{"en":"We chose a build-to-suit warehouse so the loading docks would match our workflow.","zh":"我们选择了按需定制建设的仓库，这样装卸月台能符合我们的流程。"},{"en":"Build-to-suit projects can take longer, but they fit the tenant’s operations better.","zh":"按需定制建设的项目可能耗时更久，但更契合承租方的运营需求。"}]}],"synonyms":["custom-built","made-to-order","tailor-made"],"phonetic":"/ˌbɪld tə ˈsut/","extraExplanation":["“build-to-suit”常用于商业地产语境（办公楼、仓库、零售店）。典型模式是开发商按租户要求建设，完工后租户长期租用；也可能是为某个买方定制建设后直接出售。","相关对比：现成可租/可买的房源常说“spec building（投机建造、未定租户）”或“move-in ready（可直接入驻）”；而build-to-suit强调“先有需求，再按需求建”。","书写上常见带连字符（build-to-suit）作形容词；也可写作不带连字符的名词用法“a build-to-suit (project/deal)”。"]}
{"word":"build-up","summary":{"en":"Build-up means a gradual increase/accumulation, or the preparation/lead-in before a main event.","zh":"Build-up 指逐渐累积/增加，也指事件或情节的铺垫与预热。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A gradual increase or accumulation over time (of something like tension, pressure, excitement, or material).","zh":"（随时间）逐渐增加或累积（如紧张、压力、兴奋、物质等）。"},"examples":[{"en":"There was a slow build-up of tension before the exam.","zh":"考试前紧张情绪慢慢累积起来。"},{"en":"A build-up of ice on the road can be dangerous.","zh":"路面结冰的堆积可能很危险。"}]},{"partOfSpeech":"n.","definition":{"en":"The preparatory development leading up to an event; the way a story, plan, or promotion creates interest before the main moment.","zh":"（事件前的）铺垫；为“高潮/重点”做的准备和营造（故事、计划或宣传等）。"},"examples":[{"en":"The movie’s build-up made the final scene even more powerful.","zh":"电影的铺垫让最后一幕更震撼。"},{"en":"The company did a big build-up to the product launch.","zh":"公司为新品发布做了很大的预热宣传。"}]},{"partOfSpeech":"n.","definition":{"en":"An increase in a person’s body size or muscle from training; bulking up.","zh":"（健身训练导致的）体格或肌肉增长；增肌。"},"examples":[{"en":"He noticed a build-up in his shoulders after months at the gym.","zh":"练了几个月健身房后，他发现肩膀更壮了。"}]}],"synonyms":["buildup","accumulation","increase","growth","rise","run-up","lead-up","preparation","anticipation"],"phonetic":"/ˈbɪldˌʌp/","extraExplanation":["“build-up”常写作连字符形式，尤其作名词时；也可写作“buildup”。在美式英语里两者都常见。","注意区分：名词 build-up（累积/铺垫） vs. 动词短语 build up（逐渐增加；加强；建立）。例如：“Stress can build up.”（压力会积累。）","在影视与文学评论中，build-up常与“payoff”（回报/高潮的兑现）一起出现：好的铺垫通常会带来令人满意的payoff。"]}
{"word":"build-ups","summary":{"en":"Build-ups are gradual increases, preparations leading to an event, or (in media) promotional hype.","zh":"build-ups 指逐渐累积/渐增、重大事件前的筹备期，或媒体上的宣传造势。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a gradual increase or development of something (such as tension, pressure, speed, or strength) over time","zh":"（紧张、压力、速度、力量等）逐渐累积、渐增的过程"},"examples":[{"en":"There was a slow build-up of tension before the final exam.","zh":"期末考试前，紧张情绪在慢慢累积。"},{"en":"A build-up of ice on the road made driving dangerous.","zh":"路面结冰逐渐堆积，使开车变得危险。"}]},{"partOfSpeech":"n.","definition":{"en":"preparation for an event; the period of activities leading up to something important","zh":"（重大事件前的）筹备期；前期准备活动"},"examples":[{"en":"In the build-up to the wedding, the family was extremely busy.","zh":"在婚礼筹备期间，家里人特别忙。"},{"en":"The build-ups before the product launch included weeks of testing.","zh":"产品发布前的筹备包括数周测试。"}]},{"partOfSpeech":"n.","definition":{"en":"(often in media) promotion or publicity designed to create interest and excitement","zh":"（常用于媒体）宣传造势；炒热气氛的推广"},"examples":[{"en":"The movie’s marketing build-up made everyone curious.","zh":"电影的宣传造势让大家都很好奇。"},{"en":"There was a big build-up in the press before the championship.","zh":"锦标赛前媒体做了大量宣传造势。"}]}],"synonyms":["increase","accumulation","buildup","preparation","run-up","lead-up","publicity","hype"],"phonetic":"/ˈbɪldˌʌp/","extraExplanation":["“build-ups”是名词复数，单数常写作 build-up（也可写作 buildup）。常用搭配：a build-up of + 名词（a build-up of stress/pressure/ice）；in the build-up to + 事件（in the build-up to the election）。","注意别和动词短语 build up 混淆：build up 是“逐渐增加/增强/建立”，而 build-up/buildup 更像是“累积的结果或过程/筹备期/造势”。"]}
{"word":"buildability","summary":{"en":"Buildability is the quality of a design being practical and easy to build.","zh":"Buildability 指设计在实际中是否容易、可行、便于建造（可建造性/易建性）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being easy and practical to build (especially in engineering, architecture, manufacturing, or construction).","zh":"（尤指工程、建筑、制造或施工中）“易建性/可建造性”：指某个设计或方案是否容易、可行、成本与工期上是否便于建造。"},"examples":[{"en":"The engineer improved the bridge’s buildability by simplifying the joints.","zh":"工程师通过简化连接节点，提高了这座桥的可建造性。"},{"en":"During design review, the team discussed cost, safety, and buildability.","zh":"在设计评审中，团队讨论了成本、安全性和可建造性。"},{"en":"Poor buildability can lead to delays and higher labor costs on site.","zh":"可建造性差可能导致工地延误并增加人工成本。"}]}],"synonyms":["constructability","feasibility (in building)","practicality","workability"],"phonetic":"/ˌbɪl.dəˈbɪl.ə.ti/","extraExplanation":["“buildability”常见于专业语境（construction/engineering）。它和“constructability（可施工性/可建造性）”意思很接近；一些行业更偏好用constructability，尤其在土木与施工管理领域。","构词：build + -ability（表示“……的能力/性质”）。因此它强调“设计是否便于建成”，常涉及可施工顺序、材料与设备可获得性、工人操作空间、现场安全与质量控制等。"]}
{"word":"buildable","summary":{"en":"“Buildable” means something can realistically be built or made.","zh":"“buildable”表示某物在现实条件下可以建造/制作出来，强调可落地、可实现。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be built or constructed; possible to make in a practical way.","zh":"可建造的；能建成的；可实现的（在实际操作上可做到）。"},"examples":[{"en":"The design looks exciting, but we need to check if it’s buildable with our budget.","zh":"这个设计看起来很棒，但我们得确认在预算内是否建得出来。"},{"en":"Engineers tested the model to prove the bridge was buildable.","zh":"工程师测试了模型，以证明这座桥是可建成的。"},{"en":"Some ideas sound great in theory but aren’t buildable in real life.","zh":"有些点子理论上很好，但在现实中并不可实现。"}]}],"synonyms":["constructible","feasible","workable","practical"],"phonetic":"/ˈbɪldəbəl/","extraExplanation":["“buildable”常见于建筑、工程、产品设计等语境，强调“从技术/材料/预算/法规角度能否真正做出来”。它也可引申到计划或想法，表示“可落地、可执行”。","近义表达会因语境变化：在工程里常用“constructible”（更正式，偏工程术语），在管理或产品语境里常见“feasible / workable”（更强调可行性而不一定是“建造”）。"]}
{"word":"builded","summary":{"en":"“Builded” is a nonstandard/archaic form of “built,” the past tense of “build.” Use “built” in modern English.","zh":"“builded”是“built”（build 的过去式/过去分词）的非标准或古旧形式；现代英语应使用“built”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Nonstandard or archaic past tense/past participle of “build.” In modern standard English, the correct form is “built.”","zh":"“build”的非标准或较古旧的过去式/过去分词。现代标准英语通常用“built”。"},"examples":[{"en":"He builded a house. (Nonstandard; standard: He built a house.)","zh":"He builded a house。（非标准；标准：He built a house.）"},{"en":"The bridge was builded quickly. (Nonstandard; standard: The bridge was built quickly.)","zh":"The bridge was builded quickly.（非标准；标准：The bridge was built quickly.）"}]}],"synonyms":["built","constructed","erected"],"phonetic":"/bɪld/","extraExplanation":["“build”是不规则动词：build–built–built。很多学习者或儿童会按规则加-ed 说成“builded”，但在正式写作、考试、工作邮件中应避免。","“builded”偶尔会出现在宗教或古风文体里（例如仿《圣经》风格）以营造古旧语气；现代日常英语几乎不用。"]}
{"word":"builder","summary":{"en":"A builder is someone who constructs buildings, or something that helps build/develop a skill or quality.","zh":"builder 指“建筑商/建造者”，也可指“帮助培养或建立某种能力/品质的事物”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or company that builds things, especially houses or other buildings","zh":"建造者；建筑商（尤指建房或建造建筑物的人或公司）"},"examples":[{"en":"The builder finished the house two weeks ahead of schedule.","zh":"建筑商提前两周完工了这栋房子。"},{"en":"We hired a local builder to add a new room.","zh":"我们雇了一家本地建筑商来加建一个房间。"},{"en":"Talk to your builder about costs before you sign the contract.","zh":"在签合同前先和建筑商谈清楚费用。"}]},{"partOfSpeech":"n.","definition":{"en":"a thing that helps create or develop something (often used as a compound noun, like “confidence builder”)","zh":"促成某事的事物；“建立/培养……的东西”（常用于复合名词，如 confidence builder）"},"examples":[{"en":"Reading every day is a great vocabulary builder.","zh":"每天阅读是很好的词汇“积累器”。"},{"en":"Small wins can be a real confidence builder.","zh":"小小的成功能很有效地建立自信。"}]}],"synonyms":["constructor","contractor","developer","homebuilder"],"phonetic":"/ˈbɪldɚ/","extraExplanation":["在美国英语里，builder 常指从事房屋建造的“承包商/建商”，不一定亲自砌砖，但负责组织施工、管理工人和进度。","作为复合名词的一部分时（如 team-builder / muscle builder / brand builder），builder 更接近“促进……形成/增长的东西”，中文常译为“……的建立者/促进因素/培养工具”，要根据语境灵活处理。"]}
{"word":"builders","summary":{"en":"“Builders” means people who build things—especially buildings—or people/things that help create or develop something.","zh":"“Builders”指建造房屋等工程的人，也可泛指促成建立或發展某事的人／事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who build or create structures such as houses, roads, or other projects; construction workers or contractors.","zh":"建造者；建築工人／承包商（建房子、道路等的人）。"},"examples":[{"en":"The builders finished the house in six months.","zh":"建造者在六個月內完成了這棟房子。"},{"en":"We hired local builders to renovate the kitchen.","zh":"我們雇了當地的建築工人來翻新廚房。"},{"en":"Safety rules are important for builders on a construction site.","zh":"在工地上，安全規定對建築工人很重要。"}]},{"partOfSpeech":"n.","definition":{"en":"People or things that help create or develop something (often used with another word, like “team builders” or “relationship builders”).","zh":"促成建立／發展某事的人或事物（常與其他詞搭配，如「團隊建立者」「關係建立者」）。"},"examples":[{"en":"Good listeners are relationship builders.","zh":"善於傾聽的人能建立關係。"},{"en":"Trust and respect are builders of a strong team.","zh":"信任與尊重是強大團隊的建立要素。"}]}],"synonyms":["construction workers","contractors","creators","developers"],"phonetic":"/ˈbɪldɚz/","extraExplanation":["“Builders”是複數形式，單數是“builder”。在英式英文裡也常用“builders”指「建築商／施工隊」（例如：The builders are coming tomorrow）。","常見搭配：builder’s market（建商主導的市場）、home builder（房屋建造商）、team builder（團隊建立者／團隊建立活動中的促進者）。"]}
{"word":"building","summary":{"en":"Building most commonly means a structure (like a house or office), and it can also mean the process of construction or gradual growth.","zh":"building 最常指“建筑物”，也可指“建造/建设过程”，还可作形容词表示“逐渐增强的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a structure with walls and a roof, such as a house, school, or office","zh":"建筑物；楼房（有墙和屋顶的结构，如房子、学校或办公楼）"},"examples":[{"en":"The library is the tallest building on campus.","zh":"图书馆是校园里最高的建筑。"},{"en":"Please wait in the main building.","zh":"请在主楼等候。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or process of constructing something; developing step by step","zh":"建造；建设过程；逐步发展（的过程）"},"examples":[{"en":"Road building takes time and careful planning.","zh":"修路需要时间和周密规划。"},{"en":"Trust is built through small actions; it’s a slow building process.","zh":"信任来自点滴行动；它是一个缓慢累积的过程。"}]},{"partOfSpeech":"adj.","definition":{"en":"increasing gradually; growing or becoming stronger (often used before a noun)","zh":"逐渐增长的；日益增强的（常用于名词前）"},"examples":[{"en":"There is building pressure to finish the project.","zh":"完成项目的压力正在不断增加。"},{"en":"We heard building excitement before the concert.","zh":"音乐会前，我们感到兴奋情绪不断升温。"}]}],"synonyms":["structure","construction","edifice"],"phonetic":"/ˈbɪldɪŋ/","extraExplanation":["“building”既可以指具体的“建筑物”，也可以指抽象的“建设/累积过程”。在表达抽象意义时，常见搭配有：building trust（建立信任）、building momentum（积累势头）、building pressure（压力逐渐加大）。","和“build”相比：build 是动词（建造/建立）；building 作名词可指结果（建筑物）或过程（建造），作形容词时常表示“正在增长的/逐渐增强的”。"]}
{"word":"building block","summary":{"en":"A building block is a basic part used to build something bigger—literally (toy blocks) or figuratively (key elements of an idea or skill).","zh":"building block 指用来搭建更大事物的基本单位，既可指“积木”等实物，也可比喻“关键要素/基础组成部分”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A basic unit or element used to create something larger or more complex (an idea, skill, system, etc.).","zh":"（概念、技能、体系等的）基础组成部分；构成要素"},"examples":[{"en":"Trust is a building block of a healthy relationship.","zh":"信任是健康关系的基础要素。"},{"en":"Learning the alphabet is a building block for reading.","zh":"学习字母表是阅读的基础。"}]},{"partOfSpeech":"n.","definition":{"en":"A literal block (such as a toy block) used for building or construction play.","zh":"（玩具）积木；（可用于搭建的）方块"},"examples":[{"en":"The child stacked building blocks into a tall tower.","zh":"孩子把积木叠成了一座高塔。"},{"en":"We bought wooden building blocks for the preschool classroom.","zh":"我们为幼儿园教室买了木制积木。"}]}],"synonyms":["basic element","foundation","component","cornerstone"],"phonetic":"/ˈbɪldɪŋ blɑk/","extraExplanation":["“building block(s)”常用作比喻，强调“从小单元一步步搭建更大成果”的思维方式，常见于教育、管理与科技语境：the building blocks of language / success / a program。","搭配提示：最常见结构是“a building block of + 名词”（某事的基础要素）或“the building blocks of + 名词”（……的基本构成）。复数形式更常见，因为通常不止一个要素。","相关近义表达（语气略有差别）：foundation（基础，更偏“地基/根基”）、cornerstone（基石，强调关键且不可缺）、fundamental / basic element（基本要素，更正式）、component（组成部分，更中性、技术化）。"]}
{"word":"building blocks","summary":{"en":"basic parts or fundamentals used to form something bigger","zh":"组成更大整体的基本要素或基础材料"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the basic parts or ideas that something is made from; fundamentals","zh":"构成某物的基础部分或基本概念；基础"},"examples":[{"en":"Trust is one of the building blocks of a strong relationship.","zh":"信任是稳固关系的基石之一。"},{"en":"Kids learn the building blocks of math before they solve harder problems.","zh":"孩子在解决更难的问题之前，会先学习数学的基础。"}]},{"partOfSpeech":"n.","definition":{"en":"basic materials used to build something, such as bricks or wood","zh":"建筑用的基础材料（如砖、木材等）"},"examples":[{"en":"The village used local stone as building blocks for houses.","zh":"这个村庄用当地的石头作房屋的建筑材料。"},{"en":"These foam building blocks are safe for toddlers.","zh":"这些泡沫积木对幼儿很安全。"}]}],"synonyms":["basics","fundamentals","foundation","cornerstone","core elements","essentials","components","ingredients","building materials","bricks"],"phonetic":"/ˈbɪldɪŋ blɑks/","extraExplanation":["常见抽象搭配：the building blocks of language/science/success（语言/科学/成功的基本要素）。","写作中它相当于“foundation/fundamentals”，比“pieces”更强调“搭起来就能形成整体”的感觉。"],"etymology":"来自“build（建造）+ block（块；砖块）”。先指“建筑用的砖块/积木”，后来在写作与演讲中常被引申为“组成某事的基本要素/基石”。","mnemonic":["把它想成“搭积木”：一块块小东西（blocks）搭起来（build）就成了大的结构——对应“基础要素”。","联想中文“基石/砖块”：既能真的盖房，也能比喻“构成某事的根基”。"]}
{"word":"building boom","summary":{"en":"a rapid increase in construction over a period of time","zh":"一段时间内建筑/施工活动迅速增加"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a period when many new buildings are being built, often because the economy is growing","zh":"（通常因经济增长而出现的）建筑热潮；建设高峰期"},"examples":[{"en":"The city experienced a building boom after the new subway line opened.","zh":"新地铁线开通后，这座城市经历了一轮建筑热潮。"},{"en":"During the building boom, rents rose quickly and older neighborhoods changed.","zh":"在建筑热潮期间，租金迅速上涨，老社区也发生了变化。"}]}],"synonyms":["construction boom","housing boom","building surge","construction surge"],"phonetic":"/ˈbɪldɪŋ buːm/","extraExplanation":["“boom”在新闻和经济语境中很常见，表示数量或活动“突然变多、发展很快”。类似搭配还有“population boom（人口激增）”“housing boom（住房热潮）”。","“building boom”偏口语和新闻写法；更正式的报告里也可能写成“a boom in construction（建筑业繁荣/施工激增）”。"],"etymology":"“boom”原意有“繁荣、激增”的意思，常用于“economic boom（经济繁荣）”。“building boom”把“boom”用于建筑领域，表示建筑活动在一段时期内迅速增加。","mnemonic":["把“boom”联想成“砰”的一声——像突然爆发一样，建筑项目一下子多起来。","“building（建造/建筑）+ boom（繁荣/激增）”= 建造活动的“暴增期”。"]}
{"word":"building complex","summary":{"en":"a group of buildings planned or used as one unit","zh":"作为一个整体规划或使用的一组建筑"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A group of connected or closely located buildings that function together (for housing, offices, a school, a hospital, etc.).","zh":"（用于居住、办公、学校、医院等的）建筑群；综合楼群。"},"examples":[{"en":"The company moved into a new building complex near the river.","zh":"公司搬进了河边的一处新建筑群。"},{"en":"Security is strict in the apartment building complex.","zh":"这片公寓建筑群的安保很严格。"},{"en":"The hospital building complex includes a clinic, labs, and a pharmacy.","zh":"这座医院建筑群包括门诊、实验室和药房。"}]},{"partOfSpeech":"phrase","definition":{"en":"A development project that involves constructing multiple buildings as one planned unit.","zh":"（作为整体规划的）多栋建筑开发项目。"},"examples":[{"en":"They are investing in a building complex that will include shops and apartments.","zh":"他们正在投资一个包含商店和公寓的综合开发项目。"},{"en":"The city approved the building complex plan last month.","zh":"市政府上个月批准了该综合开发项目的规划。"}]}],"synonyms":["complex","building compound","campus","housing complex","apartment complex","office complex","development","estate"],"phonetic":"/ˈbɪldɪŋ ˈkɑmplɛks/","extraExplanation":["发音与重音提示：complex 作名词时重音通常在第一音节（COM-plex）。若作形容词（complex = 复杂的），重音也多在第一音节，但含义不同。","语境区分：building complex 通常指“由多栋楼构成的区域/园区”；如果只是一栋大楼，更常说 office building / apartment building / complex（单独用）。"],"etymology":"由“building（建筑/建造）+ complex（综合体/建筑群）”组成的名词短语；其中 complex 作名词时常指“由多个部分构成的整体”。","mnemonic":["把它拆开记：building=建筑；complex=综合体/建筑群 → 合在一起就是“建筑群”。","complex 像“组合（com-一起 + plex-编织）”，联想到“很多部分织在一起的整体”。"]}
{"word":"building friendship and partnership with neighboring countries","summary":{"en":"developing friendly and cooperative relations with nearby countries","zh":"与周边国家发展友好与合作关系"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to develop friendly relationships and cooperative ties with nearby countries, often through diplomacy, trade, and mutual support","zh":"与周边国家建立友好关系与合作伙伴关系，通常通过外交、贸易与相互支持来实现"},"examples":[{"en":"The government focused on building friendship and partnership with neighboring countries to improve regional stability.","zh":"政府着力与周边国家建立友好关系与合作伙伴关系，以提升地区稳定。"},{"en":"Cultural exchanges are a practical way of building friendship and partnership with neighboring countries.","zh":"文化交流是与周边国家建立友好关系与合作伙伴关系的有效方式。"}]}],"synonyms":["forge ties with neighboring countries","strengthen relations with neighboring countries","build good-neighborly relations","promote regional cooperation","foster diplomatic ties"],"phonetic":"/ˈbɪldɪŋ ˈfrɛndʃɪp ænd ˈpɑrtnərʃɪp wɪð ˈneɪbərɪŋ ˈkʌntriz/","extraExplanation":["语气与场景：偏正式、官方，常用于外交政策表述；日常口语中更常说“be friendly with our neighbors / work closely with neighboring countries”。","搭配提示：常与“regional stability（地区稳定）”“mutual benefit（互利）”“win-win cooperation（合作共赢）”“good-neighborly relations（睦邻关系）”同现。"],"etymology":"属于现代英语政治与外交语境中的固定搭配：building（建立、打造）+ friendship（友谊）+ partnership（伙伴关系/合作关系）+ neighboring countries（邻国/周边国家）。常见于政策文件、新闻与外交讲话。","mnemonic":["把 building 理解成“搭建桥梁”：在邻国之间“搭桥”，就能收获 friendship（友谊）和 partnership（合作）。","friend + partner：先做朋友（friendship），再做伙伴（partnership），关系更稳固。"]}
{"word":"building industry","summary":{"en":"the sector that builds and maintains buildings","zh":"从事建筑物建造与维护的产业领域"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"The business sector involved in constructing, renovating, and maintaining buildings (such as houses, offices, and factories).","zh":"从事建筑物（如住宅、办公楼、工厂等）建造、翻新与维护的行业/产业。"},"examples":[{"en":"The building industry is facing higher material costs this year.","zh":"今年建筑业正面临更高的材料成本。"},{"en":"Many jobs in the building industry require safety training.","zh":"建筑行业的许多工作都需要安全培训。"},{"en":"New environmental rules are changing how the building industry uses concrete and steel.","zh":"新的环保法规正在改变建筑业使用混凝土和钢材的方式。"}]}],"synonyms":["construction industry","construction sector","building sector","construction business","the construction trade"],"phonetic":"/ˈbɪldɪŋ ˈɪndəstri/","extraExplanation":["building industry 常与 construction industry 接近；在英式/澳式英语里，building industry 更常见一些。","building industry 往往让人联想到“建筑物本身”（房屋、楼宇）的建造；construction industry 的范围有时更广，也可能包括道路、桥梁等“基础设施工程”。不过在实际新闻和口语中，两者经常互换使用。"],"etymology":"短语由 building（“建造/建筑”）+ industry（“产业/行业”）构成。building 源自古英语表示“建造”；industry 源自拉丁语，最初含“勤奋、努力”，后来引申为“产业、工业”。合起来表示“与建造建筑物相关的产业领域”。","mnemonic":["把它拆开记：building=“盖楼/建房”，industry=“行业”，合起来就是“盖楼的行业”。","联想中文固定搭配“建筑业”：building≈建筑，industry≈行业/产业。"]}
{"word":"building insurance","summary":{"en":"Insurance that protects a building’s structure.","zh":"保障建筑物结构本体的保险。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Insurance that covers a building (the structure and often fixed parts like walls, roof, and built-in fixtures) against risks such as fire, storms, or flooding, depending on the policy.","zh":"建筑物保险：为建筑本体（结构以及常见固定部分如墙体、屋顶、内置装置等）提供保障的保险，具体涵盖火灾、风暴、洪水等风险取决于保单条款。"},"examples":[{"en":"The landlord pays for building insurance, while the tenant buys contents insurance.","zh":"房东通常购买建筑物保险，而房客购买室内财产（家财）保险。"},{"en":"After the storm, they filed a claim through their building insurance policy.","zh":"风暴过后，他们通过建筑物保险保单提交了理赔申请。"},{"en":"Building insurance may be required by the mortgage lender.","zh":"贷款银行/机构可能要求必须购买建筑物保险。"}]}],"synonyms":["property insurance","home insurance","homeowners insurance","buildings cover"],"phonetic":"/ˈbɪldɪŋ ɪnˈʃʊrəns/","extraExplanation":["英美语境里，building insurance通常指“房屋结构险”，更接近中文的“房屋/建筑物（结构）保险”，不等同于只保室内物品的家财险。常见对比：building insurance（保房子本体） vs contents insurance（保家具、电器、个人物品）。","是否包含意外损坏、水管爆裂、洪水/地震等通常取决于附加条款（add-ons / riders）。签合同或租房前要看清“covered perils（承保风险）”“excess/deductible（免赔额）”“sum insured（保额）”。"],"etymology":"由“building（建筑物）+ insurance（保险）”构成的名词短语；在房地产与房贷语境中固定使用，用来区别于“contents insurance（家财/室内财产保险）”。","mnemonic":["把它拆开记：building=建筑物（房子本体），insurance=保险；合起来就是“给建筑本体买的保险”，不是给“东西（contents）”买的。","联想对照：building（楼） vs contents（物）——楼坏了找building insurance，物坏了看contents insurance。"]}
{"word":"building material","summary":{"en":"materials used for construction","zh":"用于建筑施工的材料"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A substance used to construct buildings and other structures, such as wood, concrete, steel, brick, or glass.","zh":"用于建造建筑物或其他结构的材料，如木材、混凝土、钢材、砖、玻璃等。"},"examples":[{"en":"Concrete is a common building material for bridges and apartments.","zh":"混凝土是桥梁和公寓常见的建筑材料。"},{"en":"They chose eco-friendly building materials to reduce pollution.","zh":"他们选择环保的建筑材料来减少污染。"},{"en":"The price of building materials has gone up this year.","zh":"今年建筑材料的价格上涨了。"}]}],"synonyms":["construction material","construction supplies","building supplies","materials","structural materials"],"phonetic":"/ˈbɪldɪŋ məˈtɪriəl/","extraExplanation":["常见搭配：building materials store（建材店/建材市场）, building materials costs（建材成本）, sustainable building materials（可持续建材）, raw building materials（原材料/基础建材）。","可数性：说“某种材料”时可用 a building material；泛指多种时更常说 building materials。"],"etymology":"短语组合：building（“建造的/用于建筑的”）+ material（“材料”）。在现代英语里常用于工程、建筑、装修与房地产语境，既可指“某一种材料”，也可作统称（常用复数 building materials）。","mnemonic":["把它拆开记：building=建筑/建造，material=材料，合起来就是“建造用的材料”。","联想中文“建材”：building materials≈建材。"]}
{"word":"building materials","summary":{"en":"materials used for construction","zh":"用于建筑施工的材料（建材）"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"materials used to construct or renovate buildings (such as wood, concrete, steel, brick, and glass)","zh":"用于建造或翻新建筑的材料（如木材、混凝土、钢材、砖、玻璃等）"},"examples":[{"en":"The contractor ordered building materials like cement, sand, and rebar.","zh":"承包商订购了水泥、沙子和钢筋等建筑材料。"},{"en":"Rising prices of building materials can delay construction projects.","zh":"建筑材料价格上涨可能会拖慢施工项目。"},{"en":"They chose eco-friendly building materials to reduce the home’s carbon footprint.","zh":"他们选择了环保建材来降低房子的碳足迹。"}]},{"partOfSpeech":"phrase","definition":{"en":"a category of products sold for construction (often used in business or retail contexts)","zh":"建材这一类商品（常用于商业或零售语境）"},"examples":[{"en":"This store sells paint, tools, and other building materials.","zh":"这家店卖油漆、工具和其他建材。"},{"en":"The company specializes in importing building materials.","zh":"这家公司专门进口建材。"}]}],"synonyms":["construction materials","construction supplies","building supplies","materials"],"phonetic":"/ˈbɪldɪŋ məˈtɪriəlz/","extraExplanation":["常见搭配：building materials supplier（建材供应商）、cost of building materials（建材成本）、sustainable/eco-friendly building materials（可持续/环保建材）。","在英美日常中也常直接说 materials 或 construction materials；construction materials 更偏工程/行业用语。"],"etymology":"由 building（建造的）+ materials（材料）组合而成，字面意思就是“用于建造的材料”。在现代英语里常作为行业与日常用语来统称“建材”。","mnemonic":["把它拆开记：building=建造 + materials=材料 → “建造用的材料”=建材。","联想中文“建材市场”：market for building materials（建材市场）。"]}
{"word":"building module","summary":{"en":"A standardized unit used to assemble a building or building system.","zh":"用于拼装建筑或建筑系统的标准化单元。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A standardized, self-contained unit used to construct a building, often made in a factory and then transported and assembled on site.","zh":"用于建造建筑的标准化、独立单元，常在工厂预制后运到现场拼装。"},"examples":[{"en":"The school was expanded using building modules that were assembled in just two weeks.","zh":"学校通过建筑模块扩建，现场拼装只用了两周。"},{"en":"Each building module includes walls, wiring, and plumbing to reduce on-site work.","zh":"每个建筑模块都包含墙体、布线和管道，以减少现场施工。"}]},{"partOfSpeech":"n.","definition":{"en":"A component (in engineering or design) that can be combined with other components to form a larger building system or structure.","zh":"（工程或设计中）可与其他部件组合，形成更大建筑系统或结构的组件。"},"examples":[{"en":"The design uses a building module that repeats across the façade for a consistent look.","zh":"该设计在立面上重复使用同一建筑模块，以保持一致的视觉效果。"},{"en":"Architects adjusted the size of the building module to fit the narrow site.","zh":"建筑师调整了建筑模块的尺寸以适应狭窄的用地。"}]}],"synonyms":["prefab unit","prefabricated module","modular unit","construction module","prefab module"],"phonetic":"/ˈbɪldɪŋ ˈmɑːdʒuːl/","extraExplanation":["“building module”常见于“模块化建筑/装配式建筑”语境：在工厂完成大量工序（结构、内装、机电等），到现场像“搭积木”一样吊装拼接，从而缩短工期、提高一致性并减少现场噪音与扬尘。","有时也会和“modular building / modular construction（模块化建筑/模块化施工）”连用；如果强调“预制”，也常写作 “prefabricated module”。"],"etymology":"由 building（“建筑/建造”）+ module（“模块/单元”）组合而成。module 源自拉丁语 modulus，原意为“尺度、度量的小单位”，在现代工程与制造语境中引申为“可组合的标准单元”。","mnemonic":["module ≈ “模块”：想象“模”=模具里做出来的标准件，“块”=一块一块拼起来；building module 就是“建筑的标准拼块”。","把它当成“建房积木”：building（建房）+ module（模块），像乐高一样组合成整栋建筑。"]}
{"word":"building ruins","summary":{"en":"the damaged remains of a destroyed structure","zh":"被毁建筑留下的遗迹或废墟"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"the remains of a building (or buildings) that has been badly damaged or destroyed, often by time, war, fire, or natural disasters","zh":"（一座或多座）建筑被严重破坏或毁坏后留下的遗迹/残骸，常因年代久远、战争、火灾或自然灾害造成"},"examples":[{"en":"After the earthquake, people searched the building ruins for survivors.","zh":"地震后，人们在建筑废墟中搜寻幸存者。"},{"en":"Tourists took photos of the building ruins at the ancient site.","zh":"游客在那处古遗址拍摄建筑遗迹。"},{"en":"Only building ruins remained after the fire spread through the block.","zh":"大火蔓延整条街区后，只剩下建筑残骸。"}]}],"synonyms":["ruins","rubble","wreckage","remains","remnants","debris"],"phonetic":"/ˈbɪldɪŋ ˈruːɪnz/","extraExplanation":["更地道的常见说法是 “the ruins of a building / the ruins of the buildings”。“building ruins”更像一个名词短语，常用于新闻报道或描述灾后场景。","注意区分：ruins（废墟/遗迹，强调“曾经是建筑”） vs. rubble（瓦砾，强调“碎石碎砖”） vs. debris（残骸/碎片，更广义）。"],"etymology":"“building”来自古英语 *byldan*（建造）；“ruins”来自拉丁语 *ruina*（倒塌、崩塌），后来引申为“废墟、遗迹”。","mnemonic":["ruins 听起来像“如阴似”，联想“阴森的遗迹/废墟”，画面感强。","记搭配：in the ruins（在废墟中）= 在一堆倒塌的建筑里。"]}
{"word":"building site","summary":{"en":"a place where construction work is happening","zh":"进行建筑施工的场地"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"an area of land where a building is being constructed or repaired; a construction site","zh":"正在建造或修缮建筑物的场地；施工现场"},"examples":[{"en":"There’s a building site next to our apartment, so it’s noisy in the morning.","zh":"我们公寓旁边有个施工现场，所以早上很吵。"},{"en":"Hard hats are required on the building site.","zh":"进入施工现场必须戴安全帽。"},{"en":"The road is closed because trucks are entering and leaving the building site.","zh":"因为卡车进出施工现场，道路被封闭了。"}]}],"synonyms":["construction site","worksite","job site","site"],"phonetic":"/ˈbɪldɪŋ saɪt/","extraExplanation":["英式英语更常说 building site；美式英语更常用 construction site。两者意思基本相同。","在安全标识中常见相关词：site office（工地办公室）、site entrance（工地入口）、site manager（工地负责人）。"],"etymology":"由 building（建造；建筑）+ site（地点；场地）组成，字面意思是“建造的场地”，在英式英语里非常常用来指“施工现场”。","mnemonic":["把它拆开记：building（在建的）+ site（地点）= “在建的地方”→ 施工现场。","联想中文“工地”：在 building site 里会看到脚手架、塔吊、卡车。"]}
{"word":"building society","summary":{"en":"“Building society” usually means the effort to create/improve a community; in UK English it can also mean a member-owned financial institution for savings and mortgages.","zh":"“building society”通常指建设与改善社会的努力；在英式英语中也可指一种会员共同拥有、主要做储蓄与房贷的金融机构（互助储蓄贷款机构）。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"the process or effort of creating and improving a community or nation (its institutions, relationships, and shared values)","zh":"建设社会；建立并改善一个社区或国家（其制度、人际关系与共同价值观）的过程或努力"},"examples":[{"en":"Education plays a key role in building society by helping people cooperate and solve problems.","zh":"教育在建设社会中起关键作用，因为它帮助人们合作并解决问题。"},{"en":"Volunteering is a simple way to take part in building society.","zh":"做志愿服务是参与建设社会的一种简单方式。"}]},{"partOfSpeech":"n.","definition":{"en":"(UK) a financial institution owned by its members that traditionally focuses on savings and home loans; often capitalized as “Building Society”","zh":"（英式）互助储蓄贷款机构（由会员共同拥有），传统上以储蓄与住房按揭为主；常写作 Building Society"},"examples":[{"en":"She opened a savings account at a local building society.","zh":"她在当地一家互助储蓄贷款机构开了一个储蓄账户。"},{"en":"In the UK, building societies are an alternative to banks for mortgages.","zh":"在英国，互助储蓄贷款机构是办理房贷时银行之外的另一种选择。"}]}],"synonyms":["social development","community building","nation-building","building and loan association (US, similar idea)"],"phonetic":"/ˈbɪldɪŋ səˈsaɪəti/","extraExplanation":["“Building society”在英国是一种很常见的金融机构类型，历史上起源于人们“互助攒钱买房”的社团（members’ mutual）。它们通常更强调“会员所有、服务会员”，与股份制银行在所有权结构上不同。","如果你想表达“建设社会/社会建设”，英语更自然的说法常见有：building a society, social development, nation-building（偏国家层面的建构）。在正式写作中，“building society”单独出现可能让英国读者联想到金融机构，所以最好用上下文或改写来避免歧义。"]}
{"word":"building technique","summary":{"en":"a method used to construct a structure or build something effectively","zh":"用于建造结构或有效构建某物的方法"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a method or way of constructing a building or structure (including materials and processes used)","zh":"（建造房屋或结构时使用的）施工方法；建造工艺"},"examples":[{"en":"Traditional building techniques in this region use wood and stone.","zh":"这个地区的传统建造工艺会使用木材和石材。"},{"en":"Modern building techniques can reduce energy use and waste.","zh":"现代施工方法可以减少能源消耗和浪费。"},{"en":"The museum highlights building techniques from ancient Rome.","zh":"这家博物馆重点介绍古罗马的建造技术。"}]},{"partOfSpeech":"phrase","definition":{"en":"a practical method used to create or develop something (used more broadly and metaphorically)","zh":"（引申）打造或构建某物的方式；建立的方法"},"examples":[{"en":"Clear feedback is an effective team-building technique.","zh":"清晰的反馈是一种有效的团队建设方法。"},{"en":"The author uses a simple story-building technique to keep readers engaged.","zh":"作者用一种简单的叙事构建方法来吸引读者。"}]}],"synonyms":["construction method","construction technique","building method","construction practice","building approach"],"phonetic":"/ˈbɪldɪŋ tɛkˈnik/","extraExplanation":["在建筑语境里，它常与具体系统搭配：如 steel-frame building techniques（钢结构施工技术）、earthquake-resistant building techniques（抗震建造技术）、green building techniques（绿色建筑技术）。","英语里更正式、更常见的说法还包括 construction method(s)（施工方法）或 construction technique(s)（施工技术）。"],"etymology":"“building”来自古英语 buildan（建造）；“technique”经法语 technique 进入英语，源自希腊语 technē（技艺、手艺）。合起来表示“建造时采用的技艺/方法”。","mnemonic":["把它拆开记：building（建造）+ technique（技巧/技术）= “建造的技巧/方法”。","technique 里的 tech- 很像 “technology（科技）” 的开头，联想到“技术手段”。"]}
{"word":"building wood","summary":{"en":"wood used for construction","zh":"用于建筑施工的木材"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"wood (timber/lumber) used for constructing buildings, such as framing, beams, and boards.","zh":"用于建造房屋等建筑的木材（如框架木、梁、木板等）。"},"examples":[{"en":"The contractor ordered building wood for the house frame.","zh":"承包商订购了用于房屋框架的建筑木材。"},{"en":"Make sure the building wood is dry, straight, and free of cracks.","zh":"要确保建筑木材干燥、笔直且没有裂缝。"}]},{"partOfSpeech":"phrase","definition":{"en":"(Less common) wood from buildings, especially recovered from old structures for reuse.","zh":"（较少见）来自建筑物的木材，尤其指从旧建筑中回收再利用的木料。"},"examples":[{"en":"They used building wood from an old barn to make furniture.","zh":"他们用旧谷仓回收的建筑木材做家具。"}]}],"synonyms":["construction lumber","timber","lumber","building timber","structural lumber"],"phonetic":"/ˈbɪldɪŋ wʊd/","extraExplanation":["在美式英语里，买来用于施工的木材常说 lumber（如 2x4 lumber）；英式英语更常用 timber。","如果你想表达“木结构建筑”，通常说 wooden building 或 timber building，而不是 building wood。"],"etymology":"这是由常见名词短语“building + wood”构成的直译式搭配：building 表示“建筑/建造”，wood 表示“木材”。更常见、更地道的说法是 construction lumber / timber。","mnemonic":["把它理解成“building（建造）+ wood（木头）= 用来建造的木头”，对应中文“建筑木材”。","联想常见工地材料：steel（钢）/ concrete（混凝土）/ building wood（建筑木材）。"]}
{"word":"building-related","summary":{"en":"Building-related means connected with buildings or construction.","zh":"building-related 指与建筑物或建筑工程有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with buildings, building work, or the construction industry.","zh":"与建筑物、建筑工程或建筑行业有关的。"},"examples":[{"en":"The city introduced new building-related safety rules.","zh":"这座城市出台了新的建筑相关安全规定。"},{"en":"She works on building-related projects like renovations and inspections.","zh":"她从事与建筑相关的项目，比如翻修和检查。"}]},{"partOfSpeech":"adj.","definition":{"en":"(in writing) used to label a category of topics, costs, or issues that are about buildings.","zh":"（写作中）用于标注“与建筑有关”的类别，如话题、费用或问题。"},"examples":[{"en":"Please submit all building-related expenses with receipts.","zh":"请提交所有与建筑相关的费用并附上收据。"},{"en":"The report includes building-related complaints from residents.","zh":"报告包含居民提出的与建筑相关的投诉。"}]}],"synonyms":["construction-related","architecture-related","property-related","building-associated"],"phonetic":"/ˈbɪldɪŋ rɪˌleɪtɪd/","extraExplanation":["“building-related”是复合形容词，常用连字符（hyphen）把两个部分连起来，尤其是放在名词前作定语时更常见：building-related issues。放在名词后作表语时，有时也会写成不加连字符的形式（building related），但加连字符更清晰、也更常见。","含义上它通常是“与建筑/楼房有关”，不一定指“和‘建立关系’有关”。如果要表达“与建立关系有关”，一般会说 relationship-related 或 related to building relationships。"]}
{"word":"building-related illness","summary":{"en":"Health problems linked to being in a specific building.","zh":"与待在某栋建筑物有关的健康问题。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A health problem (or set of symptoms) caused or made worse by being inside a particular building, usually because of poor indoor air quality, moisture, mold, chemicals, or inadequate ventilation.","zh":"因待在某栋建筑物内而引起或加重的健康问题（或一组症状），通常与室内空气质量差、潮湿/霉菌、化学物质或通风不足有关。"},"examples":[{"en":"Several employees reported building-related illness after moving into the newly renovated office.","zh":"搬进新翻修的办公室后，有几名员工报告出现与建筑物有关的疾病/不适。"},{"en":"The investigation linked the building-related illness to water damage and hidden mold behind the walls.","zh":"调查将这种与建筑物有关的疾病与渗水和墙体内隐藏的霉菌联系起来。"},{"en":"Improving ventilation and fixing leaks helped reduce building-related illness complaints.","zh":"改善通风并修复漏水后，与建筑物有关的不适投诉减少了。"}]}],"synonyms":["indoor air quality–related illness","environmental illness","occupational illness","sick building syndrome"],"phonetic":"/ˈbɪldɪŋ rɪˈleɪtɪd ˈɪlnəs/","extraExplanation":["常见症状包括：眼鼻喉刺激、咳嗽、喘、头痛、疲劳、皮疹等；不少人离开该建筑后会缓解。","它与“sick building syndrome（病态建筑综合征）”相关但不完全等同：前者通常更强调可识别的环境原因或可归因的健康问题；后者多指原因不易明确、但与在楼内时间相关的非特异性症状。","在职业/校园/租房场景中，这个表达常用于报告问题、申请检查（如通风、甲醛/VOC、霉菌、湿度）或推动维修。"],"etymology":"由“building（建筑物）+ related（相关的）+ illness（疾病/病症）”组成的现代公共卫生与职业健康用语，用来强调症状与特定建筑环境之间的关联。","mnemonic":["把它拆开记：building（楼）+ related（相关）+ illness（生病）＝“在这栋楼里更容易不舒服/生病”。","联想“楼里有味道/潮湿发霉→人不舒服”，就能快速把意义和常见原因连起来。"]}
{"word":"buildingless","summary":{"en":"“Buildingless” means “without buildings,” and it’s a rare, descriptive adjective often used for emphasis.","zh":"“buildingless”意为“没有建筑物的”，是较少见、偏描写性的形容词，常用于强调“无建筑”的状态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having no buildings; without buildings","zh":"没有建筑物的；无建筑的"},"examples":[{"en":"The storm left the coastline buildingless for miles.","zh":"暴风雨让海岸线绵延数英里都没有任何建筑物。"},{"en":"They imagined a buildingless future where nature could recover.","zh":"他们设想一个“无建筑”的未来，让自然得以恢复。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare, informal) lacking the usual buildings or built structures for a specific activity or community","zh":"（罕见/非正式）缺少某种活动或社区通常应有的建筑/设施的"},"examples":[{"en":"It’s a buildingless campus—most classes happen outdoors.","zh":"这是一个“没有教学楼”的校园——大多数课程在户外进行。"},{"en":"The festival is intentionally buildingless, using temporary tents instead.","zh":"这个节日刻意不设固定建筑，而是使用临时帐篷。"}]}],"synonyms":["unbuilt","undeveloped","empty","structureless","without buildings"],"phonetic":"/ˈbɪldɪŋləs/","extraExplanation":["“buildingless”不是非常常见的标准词，更多时候是为了强调“没有建筑物/建筑设施”而临时造出来的形容词（类似于 homeless, childless 里的 -less）。正式写作里更常见的表达是 “without buildings”, “free of buildings”, “undeveloped”, “unbuilt”, “with no structures”。","语感上，“buildingless”往往带有一种画面感或文学/描述性用途：强调视野里空旷、未开发、没有人为建造物的状态。"]}
{"word":"buildings","summary":{"en":"Buildings usually means more than one structure (houses, offices, etc.), and it can also refer to construction in phrases like “building safety.”","zh":"Buildings 通常指多栋建筑物；在某些搭配中也可表示“建造/施工”相关的概念，如 building safety（建筑安全）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of building: structures with walls and a roof, such as houses, schools, offices, or stores.","zh":"building 的复数：建筑物；有墙和屋顶的结构，如房子、学校、办公室或商店。"},"examples":[{"en":"There are many tall buildings in downtown Chicago.","zh":"芝加哥市中心有很多高楼。"},{"en":"The old brick buildings give the neighborhood a historic feel.","zh":"那些老砖房让这个街区有一种历史感。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or process of constructing something (used as a noun, often before another noun).","zh":"建造、施工的过程（作名词用，常用作定语）。"},"examples":[{"en":"Building safety is a top priority for the city.","zh":"建筑安全是这座城市的首要任务。"},{"en":"They discussed building codes and fire exits.","zh":"他们讨论了建筑规范和消防通道。"}]}],"synonyms":["structures","properties","premises"],"phonetic":"/ˈbɪldɪŋz/","extraExplanation":["“Buildings”通常指“多栋建筑/楼群”。如果你想表达“建筑物（泛指）”可以用单数 building，或用 the buildings 指特定的一组建筑。","在英语里，building 也常放在另一个名词前作定语（类似中文“建筑-”），如 building materials（建筑材料）、building design（建筑设计）、building regulations/codes（建筑法规/规范）。"]}
{"word":"buildings in different styles","summary":{"en":"structures that show a variety of architectural designs","zh":"呈现多种建筑设计风格的建筑"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"buildings that use different architectural styles (for example, Gothic, modern, traditional, etc.), especially when compared or shown together","zh":"不同建筑风格的建筑（例如哥特式、现代风、传统风等），尤指放在一起对比或展示时"},"examples":[{"en":"The city tour highlights buildings in different styles, from Victorian houses to glass skyscrapers.","zh":"这条城市游览路线会展示不同风格的建筑，从维多利亚式住宅到玻璃摩天楼。"},{"en":"The architect studied buildings in different styles to find ideas for a new museum.","zh":"这位建筑师研究了不同风格的建筑，为新博物馆寻找灵感。"},{"en":"The neighborhood has buildings in different styles because it developed over many decades.","zh":"这个社区有不同风格的建筑，因为它是在很多年里逐步发展起来的。"}]}],"synonyms":["varied architectural styles","a mix of architectural styles","eclectic architecture","architectural diversity"],"phonetic":"/ˈbɪldɪŋz ɪn ˈdɪfrənt staɪlz/","extraExplanation":["在英语里，style 在建筑语境中常指“architectural style（建筑风格）”。如果你想更自然、更具体，可以说：“buildings of different architectural styles”或“a mix of architectural styles”。","常见搭配：a mix of styles（风格混搭）、in a modern/traditional style（以现代/传统风格）、architectural heritage（建筑遗产）。"],"etymology":"这是一个描述性短语：buildings（建筑物）+ in different styles（以不同风格）。style 源自拉丁语 stylus，后来引申为“写作/艺术的风格”，也常用于“建筑风格”。","mnemonic":["把 in different styles 记成“在不同style里”，style≈“风格”，整句就是“不同风格的建筑”。","联想中文“风格各异的建筑”，对应英文 buildings + in different styles。"]}
{"word":"buildings of classical learning academies","summary":{"en":"academy buildings used for teaching classical subjects.","zh":"用于教授古典学科的学院建筑。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Buildings (or building complexes) belonging to academies where traditional “classical” subjects—especially Greek and Latin literature, philosophy, history, and rhetoric—are taught.","zh":"古典学术学院所属的建筑（或建筑群），用于教授传统“古典”学科，尤指希腊/拉丁文学、哲学、历史与修辞等。"},"examples":[{"en":"The campus tour highlighted the buildings of classical learning academies, with lecture halls designed for formal debates.","zh":"校园参观重点介绍了古典学术学院的建筑，其中的讲堂为正式辩论而设计。"},{"en":"Many museums preserve the buildings of classical learning academies as part of a city’s educational heritage.","zh":"许多博物馆会保留古典学术学院的建筑，把它们作为城市教育遗产的一部分。"}]}],"synonyms":["academic buildings","academy buildings","classical academy buildings","university buildings","educational buildings"],"phonetic":"/ˈbɪldɪŋz əv ˈklæsɪkəl ˈlɝnɪŋ əˈkædəmiz/","extraExplanation":["语义重点在“classical learning（古典学问）”：常与 liberal arts（博雅教育）/ humanities（人文学科）相关，尤其指希腊罗马经典传统；在建筑语境中也可能暗示新古典主义风格（如圆柱、三角楣、对称布局），但这取决于上下文。","如果你是在阅读建筑史或校园规划文本，这个短语可能更接近“用于古典教育的学院建筑群”；如果在翻译场景中，也可根据语境译为“古典书院建筑”“古典学术学院建筑”等。"],"etymology":"短语组合：building(s)（建筑）+ classical learning（古典学问/传统人文学科）+ academy（学院）。“classical learning”在英语里常指以希腊罗马经典为核心的传统人文教育；academy源自古希腊柏拉图的学园（Akadēmeia），后来泛指高等学术机构。","mnemonic":["把它拆开记：buildings=建筑；classical learning=古典学问（想成“古典=古希腊罗马”）；academies=学院/学园。合起来就是“教古典学问的学院的建筑”。","联想“academy=学园”，想到“柏拉图学园”，再想到“学园的建筑群”，更容易记住整句含义。"]}
{"word":"buildress","summary":{"en":"“Buildress” is a rare, old-fashioned word meaning a female builder.","zh":"“buildress”是个罕见且较旧的词，意思是“女建造者/女施工者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, old-fashioned) a female builder; a woman who builds or constructs things.","zh":"（罕见、旧式用法）女建造者；从事建造或施工的女性。"},"examples":[{"en":"In older writings, a “buildress” meant a woman who built or oversaw construction.","zh":"在较早的文字中，“buildress”指建造或监督施工的女性。"},{"en":"Today, people usually say “builder” for both men and women.","zh":"如今，人们通常用“builder”同时指男性和女性。"}]}],"synonyms":["builder","woman builder","female builder"],"phonetic":"/ˈbɪldrəs/","extraExplanation":["“buildress”属于带有性别标记的旧式词形：builder + 后缀 -ess（表示“女性”），类似 actress（女演员）、waitress（女服务员）。现代英语更倾向用不分性别的 builder，因此该词很少见，写作中可能显得过时或不自然。","如果你想表达“女性建筑工/施工人员”，更自然的说法是 woman builder、female builder，或直接用 builder 并在需要时补充说明。"]}
{"word":"builds","summary":{"en":"“Builds” most often means “creates/constructs/develops” (he/she/it builds). It can also be the plural noun for “body type/physique.”","zh":"“builds”最常见是动词“build”的第三人称单数：建造/制作/逐步建立；也可作名词复数，表示“体型/身材”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Third-person singular present of “build”: to make or create something by putting parts together; to develop or establish over time.","zh":"“build”的第三人称单数现在时：通过组装部件来建造/制作；也可指逐步建立、发展（关系、系统、习惯等）。"},"examples":[{"en":"She builds websites for small businesses.","zh":"她为小企业搭建网站。"},{"en":"Our team builds trust by keeping promises.","zh":"我们团队通过信守承诺来建立信任。"},{"en":"The company builds new houses outside the city.","zh":"这家公司在城外建造新房。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “build” (noun): body shape or physique; a person’s physical type.","zh":"“build”（名词）的复数：体型、身材；人的身体类型。"},"examples":[{"en":"Athletes often have strong, muscular builds.","zh":"运动员通常有强壮、肌肉发达的体型。"},{"en":"People of different builds may need different bicycle sizes.","zh":"不同体型的人可能需要不同尺寸的自行车。"}]}],"synonyms":["constructs","creates","develops","forms","establishes","assembles"],"phonetic":"/bɪldz/","extraExplanation":["“builds”最常见是动词形式（第三人称单数）：he/she/it builds。比如：He builds, she builds, it builds。","作名词时，“a build”指“体型/身材”，复数是“builds”。在描述身材时常与形容词搭配：a slim build（苗条体型）, a stocky build（敦实的体型）, a muscular build（肌肉型）。"]}
{"word":"buildup","summary":{"en":"Buildup means a gradual accumulation, or the lead-up development before a key moment.","zh":"buildup 指逐渐的累积，或在关键时刻之前的铺垫与发展。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A gradual increase or accumulation of something over time (often something noticeable, like tension, pressure, or dirt).","zh":"某事物随时间逐渐增加或累积（常指明显的东西，如紧张感、压力或污垢）。"},"examples":[{"en":"There was a slow buildup of tension before the meeting.","zh":"会议前紧张气氛慢慢累积。"},{"en":"Minerals can cause buildup in the kettle if you don’t clean it regularly.","zh":"如果不定期清洁，水壶里会有矿物质水垢堆积。"}]},{"partOfSpeech":"n.","definition":{"en":"The preparation and development that leads to an important moment in a story, speech, event, or piece of music (the “lead-up”).","zh":"为某个重要时刻做铺垫的准备与发展（如故事、演讲、事件或音乐中的“铺垫/递进”）。"},"examples":[{"en":"The movie’s buildup to the final scene was really effective.","zh":"这部电影对最后一幕的铺垫非常到位。"},{"en":"In the buildup to the election, the news cycle gets intense.","zh":"在大选临近之际，新闻节奏会变得很紧张。"}]}],"synonyms":["accumulation","increase","rise","build-up","lead-up","preparation"],"phonetic":"/ˈbɪldˌʌp/","extraExplanation":["“buildup”也常写作“build-up”，意思相同；在正式写作中两者都常见。","口语里常见搭配：a buildup of + 名词（a buildup of stress/pressure/anger）；以及 in the buildup to + 事件（in the buildup to the festival/election）。","发音上重音在第一个音节“BUILD-”，后面“up”弱读更自然。"]}
{"word":"buildups","summary":{"en":"“Buildups” is the plural of “buildup,” meaning accumulations or gradual increases, the run-up to an event, or unwanted deposits like dirt or ice.","zh":"“buildups”是“buildup”的复数，可指逐渐累积/增加、事件前的铺垫（预热），或污垢/冰等不受欢迎的沉积堆积。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A gradual increase or accumulation of something over time (such as pressure, tension, excitement, or problems).","zh":"（某事物）随着时间逐渐增加或累积（如压力、紧张、兴奋或问题）。"},"examples":[{"en":"There was a buildup of tension before the final exam.","zh":"期末考试前紧张情绪逐渐累积。"},{"en":"The buildup of traffic made everyone late.","zh":"车流量逐渐增加，导致大家都迟到了。"}]},{"partOfSpeech":"n.","definition":{"en":"The period of preparation and growing attention before an event, especially in media or sports (the “run-up”).","zh":"（尤指媒体或体育赛事中）重大事件前的铺垫期、预热期（声势逐渐升温）。"},"examples":[{"en":"The buildup to the championship game lasted for weeks.","zh":"决赛前的预热持续了好几个星期。"},{"en":"The movie’s marketing created a huge buildup before it premiered.","zh":"电影上映前的宣传造势带来了巨大的预热。"}]},{"partOfSpeech":"n.","definition":{"en":"A layer or deposit that forms gradually, especially something unwanted (like dirt, plaque, or ice).","zh":"逐渐形成的沉积物/堆积层（通常是不想要的，如污垢、牙菌斑或冰）。"},"examples":[{"en":"There was a buildup of ice on the windshield.","zh":"挡风玻璃上结了一层冰。"},{"en":"Regular brushing helps prevent plaque buildup.","zh":"规律刷牙有助于防止牙菌斑堆积。"}]}],"synonyms":["accumulations","increases","rises","build-ups","run-ups","deposits"],"phonetic":"/ˈbɪldʌp/","extraExplanation":["“buildups”是名词“buildup”的复数。美式英语里常写作一个词“buildup”，也常见拼写“build-up”（带连字符），意思通常相同。","常见搭配：a buildup of stress/tension/pressure（压力/紧张的累积），the buildup to + event（到某事件前的铺垫/预热），prevent buildup（防止堆积）。"]}
{"word":"built","summary":{"en":"“Built” most commonly means “made/constructed” as the past of build; it can also describe someone’s body type.","zh":"“Built”最常见是 build 的过去式/过去分词，表示“建造/建立”；也可作形容词描述人的体型。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “build”; made or created by putting parts together (often used for buildings, systems, or relationships).","zh":"build 的过去式和过去分词；通过把各部分组合起来而建造/创建（常用于建筑、系统或关系）。"},"examples":[{"en":"They built a bridge across the river last year.","zh":"他们去年在河上建了一座桥。"},{"en":"The house was built in 1998.","zh":"这栋房子建于1998年。"},{"en":"Over time, she built trust with her teammates.","zh":"随着时间推移，她与队友建立了信任。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of a person or body) having a particular physical shape; constructed in body type (often used with an adverb).","zh":"（指人或身体）具有某种体型；身材是……的（常与副词连用）。"},"examples":[{"en":"He is strongly built, with broad shoulders.","zh":"他身材健壮，肩膀很宽。"},{"en":"She’s lightly built, so the heavy backpack hurts her shoulders.","zh":"她身材偏瘦，所以重背包会压得肩膀疼。"}]}],"synonyms":["constructed","made","created","developed"],"phonetic":"/bɪlt/","extraExplanation":["“built”作形容词时，常见搭配有 strongly built（身材健壮）、well-built（体格结实）、lightly built（身材纤细）。","注意区分：built（过去分词/形容词） vs. build（动词原形/名词）。例如：a build-up（积累/增强）是另一个相关名词。"]}
{"word":"built up animal aggression","summary":{"en":"aggression that has accumulated over time in an animal","zh":"动物长期累积形成的攻击性"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"accumulated (stored-up) aggressive behavior or feelings in an animal, often because stress, fear, pain, frustration, or lack of stimulation has been building over time","zh":"（动物）长期积累起来的攻击性/攻击冲动，常因压力、恐惧、疼痛、挫败或缺乏刺激等因素日积月累而形成"},"examples":[{"en":"The trainer said the dog’s built-up animal aggression was likely caused by fear and poor socialization.","zh":"训犬师说这只狗积累起来的攻击性很可能是恐惧和社会化不足造成的。"},{"en":"Without enough exercise, some pets may show built-up animal aggression toward people or other animals.","zh":"如果运动不足，一些宠物可能会对人或其他动物表现出积累的攻击性。"},{"en":"The report warned that crowding can lead to built-up animal aggression in shelters.","zh":"报告警告说，收容所过度拥挤会导致动物攻击性逐渐积累。"}]}],"synonyms":["pent-up aggression","accumulated aggression","stored-up aggression","escalating aggression","latent aggression"],"phonetic":"/bɪlt ʌp ˈænəməl əˈɡrɛʃən/","extraExplanation":["常见搭配与近义表达：built-up stress（累积压力）、built-up frustration（累积挫败感）、pent-up aggression（被压抑的攻击性）。在动物行为学语境里，这类说法通常指“长期诱因+缺少出口”导致的行为风险。","语用提示：该短语多用于描述原因或风险（e.g., “built-up … can lead to …”）。若写作更正式，可用“accumulated aggression”或“escalating aggression”。"],"etymology":"“built up”来自动词短语“build up”，原义是“逐步建造/增强/堆积”，引申为“逐渐累积（情绪、压力、能量等）”。“aggression”源自拉丁语词根，表示“向前逼近/攻击”的行为。合在一起强调：攻击性不是突然出现，而是长期堆积后爆发。","mnemonic":["把“built up”想成“越堆越高的积木”：压力/情绪越堆越多，最后“爆”出来变成攻击。","“aggression”里有“gress”（走、迈步）感觉像“往前冲”，联想到“冲上来攻击”。"]}
{"word":"built-in","summary":{"en":"Built-in means included as an original, standard part of something (not added later).","zh":"built-in 指“内置的/自带的”，即在设计或制造时就作为标准部分包含在内（不是后来加的）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made as an original part of something; included as a standard feature (not added later).","zh":"内置的；原装的；作为标准功能自带的（不是后来加上的）。"},"examples":[{"en":"This laptop has a built-in webcam.","zh":"这台笔记本电脑有内置摄像头。"},{"en":"The app comes with built-in security tools.","zh":"这个应用自带内置的安全工具。"},{"en":"Our apartment has built-in shelves in the living room.","zh":"我们公寓的客厅有嵌入式（内置）书架。"}]},{"partOfSpeech":"n.","definition":{"en":"A feature that is built in; something included as a standard part of a product or system.","zh":"内置功能；自带部件（作为产品或系统的一部分）。"},"examples":[{"en":"Voice control is a built-in on this model.","zh":"语音控制是这个型号的内置功能。"}]}],"synonyms":["integrated","inbuilt","embedded","preinstalled"],"phonetic":"/ˌbɪlt ˈɪn/","extraExplanation":["“built-in”通常作形容词，后面直接接名词：built-in camera / built-in storage。也常写作“built in”（不加连字符）作后置或表语：The camera is built in. 在正式写作里，放在名词前更常用连字符。","常见近义表达：integrated（集成的，较正式/技术）、inbuilt（英式更常见）、preinstalled（预装的，尤其指软件）。注意 built-in 强调“设计时就包含”，而 not added on 表示“不是后来加装的”。"]}
{"word":"built-in camera","summary":{"en":"an integrated camera included inside a device","zh":"设备内自带的摄像头"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"already included as part of a device or system, not added separately","zh":"（设备或系统中）内置的；自带的（不是另外加装的）"},"examples":[{"en":"My laptop has a built-in camera for video calls.","zh":"我的笔记本电脑有一个内置摄像头，用来视频通话。"},{"en":"The app works with the phone’s built-in camera.","zh":"这个应用可以使用手机自带的摄像头。"},{"en":"If the built-in camera isn’t working, check the privacy settings.","zh":"如果内置摄像头不能用，检查一下隐私设置。"}]}],"synonyms":["integrated camera","inbuilt camera","embedded camera","webcam"],"phonetic":"/ˌbɪlt ˈɪn ˈkæm(ə)rə/","extraExplanation":["“built-in camera”在科技语境里非常常见，也可说“integrated camera”（集成摄像头）。在笔记本上常见同义表达还有“webcam”（摄像头/网络摄像头）。","连字符用法：放在名词前通常写作 built-in（built-in camera）；放在名词后可不加连字符：The camera is built in.（摄像头是内置的。）"],"etymology":"“built-in”源自英语短语“built in”（建在里面/装在里面），20世纪随着家电与电子产品普及而常用来表示“内置的”。","mnemonic":["built（建好）+ in（在里面）→“建在里面”= 内置/自带。","把它记成：不用外接（external），机器里已经有（in）。"]}
{"word":"built-in sensors","summary":{"en":"Integrated sensors inside a device or system.","zh":"设备或系统内部集成的传感器。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Sensors that are already integrated into a device or system (not added separately).","zh":"（设备或系统）内置的传感器；非外接、非另加的传感器。"},"examples":[{"en":"This phone uses built-in sensors to measure steps and screen rotation.","zh":"这部手机用内置传感器来测步数并自动旋转屏幕。"},{"en":"The drone relies on built-in sensors to keep its balance in the air.","zh":"这台无人机依靠内置传感器在空中保持平衡。"},{"en":"With built-in sensors, the watch can track your heart rate without extra equipment.","zh":"有了内置传感器，这块表无需额外设备就能监测心率。"}]}],"synonyms":["embedded sensors","integrated sensors","onboard sensors"],"phonetic":"ˈbɪlt ɪn ˈsɛn.sərz","extraExplanation":["常见的 built-in sensors 包括：accelerometer（加速度计）、gyroscope（陀螺仪）、GPS、microphone（麦克风）、light sensor（光线传感器）、temperature sensor（温度传感器）等。","对比：built-in（内置）强调“原厂就有、集成在内部”；external/plug-in（外接/插件）强调“后加、需连接或安装”。"],"etymology":"“built-in”由 built（build 的过去分词，“建好/做成”）+ in 组成，表示“做在里面、内置的”。“sensor”来自拉丁语 sentire（“感觉、察觉”），后来用于指“感测装置”。","mnemonic":["把 built-in 记成“built（造好）+ in（在里面）＝造在里面＝内置”。","sensor 联想“sense（感觉）+ -or（东西/器）”，就是“用来感知的器件＝传感器”。"]}
{"word":"built-in wardrobe","summary":{"en":"A closet fixed into the wall as part of the room.","zh":"固定在墙体中的嵌入式衣柜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A wardrobe (closet) that is fixed into the wall or built as part of the room, not a separate piece of furniture.","zh":"嵌入式衣柜；内置衣柜（固定在墙体里或作为房间结构的一部分，不是独立家具）。"},"examples":[{"en":"The bedroom has a built-in wardrobe with sliding doors.","zh":"卧室有一个带推拉门的嵌入式衣柜。"},{"en":"We chose a built-in wardrobe to save space in the small apartment.","zh":"我们选了内置衣柜来节省小公寓的空间。"},{"en":"Can we add shelves inside the built-in wardrobe?","zh":"我们可以在嵌入式衣柜里加隔板吗？"}]}],"synonyms":["fitted wardrobe","built-in closet","wardrobe closet","closet"],"phonetic":"/ˌbɪlt ˈɪn ˈwɔr.droʊb/","extraExplanation":["英式英语里更常说 fitted wardrobe 或 built-in wardrobe；美式英语日常更常用 closet（壁橱/衣橱）。在房产广告中，built-in wardrobe 强调“收纳已配好、不可移动”。","拼写提示：built-in 通常要用连字符（hyphen）来表示“内置的”这种形容词用法；作名词时也常保留连字符。"],"etymology":"由 built-in（内置的、嵌入式的）+ wardrobe（衣柜）组合而成；built-in 原意是“建造时就包含进去的”，用于描述房屋结构中固定安装的物件。","mnemonic":["把 built-in 理解成“built（建好）+ in（在里面）”：衣柜是“建在墙里面”的。","wardrobe 可联想成“wear（穿）+ robe（长袍）”：装衣服的地方。"]}
{"word":"built-ins","summary":{"en":"Built-ins are fixed items built into a room (like cabinets or shelves) or included features built into a product (like software tools).","zh":"built-ins 指房间里固定的嵌入式设施（如柜子、书架），也可指产品/软件自带的内建功能。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Things that are built into a place (especially a house), such as fixed furniture, shelves, cabinets, or appliances that cannot be easily moved.","zh":"（尤指房子里）内置的、固定在墙上或结构里的物件，如嵌入式家具、书架、橱柜或家电，不容易搬动。"},"examples":[{"en":"The apartment has great built-ins, including floor-to-ceiling bookshelves.","zh":"这套公寓有很棒的内置设施，包括从地板到天花板的书架。"},{"en":"We replaced the old built-ins with modern cabinets.","zh":"我们把旧的嵌入式柜体换成了现代橱柜。"}]},{"partOfSpeech":"n.","definition":{"en":"Ready-made features included as part of a product or system (often in software, apps, or devices).","zh":"（常指软件、应用或设备）自带的功能；内建功能。"},"examples":[{"en":"This photo app’s built-ins are good enough for basic editing.","zh":"这个修图应用自带的功能足够做基础编辑了。"},{"en":"The laptop comes with built-ins for security and backup.","zh":"这台笔记本自带安全和备份功能。"}]}],"synonyms":["fitted units","built-in features","preinstalled features","fixtures"],"phonetic":"/ˈbɪltˌɪnz/","extraExplanation":["“built-ins”通常是名词复数，用来指“一整套内置的东西”，尤其在房地产/室内设计语境很常见：built-ins = 固定在房屋结构上的柜体、书架等。","拼写上常带连字符（built-ins）。单数时可说 a built-in（一个内置物/内置功能），但在家装语境里更常用复数 built-ins。"]}
{"word":"built-up","summary":{"en":"Built-up describes places with many buildings (urbanized) or things that have accumulated over time (like stress or dust).","zh":"Built-up既可形容“建筑密集、已城市化的地区”，也可形容“逐渐积累起来的东西”（如压力、灰尘）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of an area) Having many buildings; developed and urbanized.","zh":"（地区）建筑密集的；已开发、城市化的。"},"examples":[{"en":"It’s a densely built-up neighborhood with narrow streets.","zh":"那是一个建筑很密集的社区，街道很窄。"},{"en":"Avoid driving through built-up areas during rush hour.","zh":"高峰期尽量避开在建筑密集区开车。"}]},{"partOfSpeech":"adj.","definition":{"en":"Gradually accumulated or increased over time (often describing tension, pressure, or substances).","zh":"（逐渐）积累起来的；不断增强的（常指紧张、压力或物质堆积）。"},"examples":[{"en":"He released the built-up stress by going for a long run.","zh":"他通过长跑释放了积累的压力。"},{"en":"Clean the filter to remove built-up dust.","zh":"清洁滤网以去除积累的灰尘。"}]}],"synonyms":["developed","urban","densely populated","congested","accumulated","collected"],"phonetic":"/ˈbɪlt ˌʌp/","extraExplanation":["“built-up”常作形容词，修饰名词：built-up area（建成区/市区）。注意别和名词“build-up”混淆：a build-up of pressure（压力的逐步积累）。","写作上是否加连字符常与位置有关：放在名词前更常见built-up area；放在名词后也可能写作built up（不加连字符）：The area is built up now（这里现在已开发起来了）。"]}
{"word":"built-up areas","summary":{"en":"densely developed city or town zones with many buildings","zh":"建筑密集的城市/城镇区域；建成区"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"parts of a town or city where there are many buildings (such as houses, shops, and offices), not open countryside","zh":"（城镇或城市中）建筑物密集的地区；建成区（相对乡村/空旷地带）"},"examples":[{"en":"Speed limits are lower in built-up areas.","zh":"在建成区内限速更低。"},{"en":"The map highlights built-up areas in gray.","zh":"地图用灰色标出了建成区。"},{"en":"Noise regulations are stricter near built-up areas.","zh":"靠近建成区的噪音管控更严格。"}]}],"synonyms":["urban areas","developed areas","city areas","town areas"],"phonetic":"/ˌbɪlt ˈʌp ˈeriəz/","extraExplanation":["常见搭配：in a built-up area（在建成区内）、built-up areas and open countryside（建成区与开阔乡野）。","用法提示：作定语时通常加连字符 built-up（built-up area）；复数为 built-up areas。也可见不加连字符的写法 built up areas，但在正式写作/标志语中 built-up 更常见。","语体与地域：这个短语在英国道路标志、交通法规、地理/规划文本里很常见；美式英语中也能用，但有时会改说 urban areas / developed areas。"],"etymology":"“built-up”原意是“已经建起来的、建筑密集的”。在英式/城市规划语境中常用来修饰“area(s)”，指与“open country / rural areas（乡村/郊外）”相对的“建成区”。","mnemonic":["把 built-up 想成“build（建）+ up（起来）”：建筑都“建起来了”，所以是“建筑密集/建成”的区域。","联想对比：built-up areas（建成区） vs. countryside（乡村）。看到这个对比就容易记住含义。"]}
{"word":"builtin","summary":{"en":"Built-in (often written builtin in tech) means included as part of the original system or product; not added later.","zh":"Built-in（科技语境里常写 builtin）指“内置的/自带的”，即原本就包含在系统或产品中，而非后来添加。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of something) included as part of the original system or product, not added later.","zh":"（某物）内置的；原本就包含在系统或产品中的，不是后来加上的。"},"examples":[{"en":"This laptop has a built-in camera.","zh":"这台笔记本电脑有内置摄像头。"},{"en":"The app includes a built-in translator.","zh":"这个应用自带（内置）翻译功能。"}]},{"partOfSpeech":"n.","definition":{"en":"a built-in feature, part, or device that is included as standard.","zh":"内置功能/部件；标准配置中自带的装置或功能。"},"examples":[{"en":"The car’s built-in keeps track of tire pressure.","zh":"这辆车的内置系统会监测胎压。"},{"en":"I prefer using the built-in instead of installing another tool.","zh":"我更喜欢用自带功能，而不是再装别的工具。"}]}],"synonyms":["integrated","inbuilt","included","preinstalled","embedded"],"phonetic":"/ˈbɪlt ɪn/","extraExplanation":["拼写上常见两种：**built-in**（最标准，尤其作形容词时）与 **builtin**（在计算机领域更常见，特别是当作“技术名词/属性名”或写在代码里时，如 *builtin function*）。写正式英文文章时一般用 **built-in**。","在编程语境里，*built-in* 常指“语言/系统自带的”，如 **built-in functions**（内置函数）、**built-in modules**（内置模块）。与之相对的常见说法是 **third-party**（第三方的）、**add-on/plugin**（插件/扩展）。"]}
{"word":"Buine","summary":{"en":"Bovine means “related to cows/cattle,” and it can also describe someone as calm but dull-looking.","zh":"bovine 指“与牛/牛类有关的”，也可形容人“像牛一样沉静但显得迟钝”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to cows (cattle); cow-like","zh":"与牛（牛类、牛群）有关的；像牛的"},"examples":[{"en":"The farmer raises bovine animals for milk and meat.","zh":"这位农民饲养牛类动物，用于产奶和产肉。"},{"en":"She gave him a bovine stare, calm and a little slow.","zh":"她用一种牛一般的目光看着他，平静但有点迟缓。"}]},{"partOfSpeech":"n.","definition":{"en":"a cow or bull; an animal in the cattle family","zh":"牛；牛科动物（如奶牛、公牛）"},"examples":[{"en":"The veterinarian treated two bovines on the farm.","zh":"兽医在农场治疗了两头牛。"}]}],"synonyms":["cattle-related","cow","cattle"],"phonetic":"/ˈboʊvaɪn/","extraExplanation":["你输入的“Buine”在英语里不常见，最可能是拼写想写“bovine”。“bovine”来自拉丁语 bōvīnus（与牛有关）。","“bovine”除了字面“牛的”，在文学或口语里也可带一点轻微贬义，形容人“木讷、反应慢、表情呆”。使用时注意语气与场合。"]}
{"word":"buirdly","summary":{"en":"“Buirdly” is a Scots adjective meaning strong and sturdy.","zh":"“buirdly”是苏格兰英语形容词，意思是“强壮结实”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Scots) strong, sturdy, and healthy-looking; robust or brawny.","zh":"（苏格兰英语）强壮的；结实健壮的；体格魁梧的。"},"examples":[{"en":"He was a buirdly farmer with broad shoulders and a steady gait.","zh":"他是个魁梧健壮的农夫，肩膀宽阔，走路沉稳。"},{"en":"The novel describes a buirdly young man ready for hard work.","zh":"小说描写了一位健壮的年轻人，随时能吃苦干活。"}]}],"synonyms":["sturdy","brawny","robust","strong"],"phonetic":"/ˈbɝːdli/","extraExplanation":["“buirdly”主要见于苏格兰方言/文学书写中，在现代日常英语里不常用；更常见的同义表达有 strong, sturdy, brawny, robust。","拼写上也常见作“burdly”。如果你本来想写的是“weirdly”（奇怪地/不寻常地），那是另一个常用词。"]}
{"word":"Buiron","summary":{"en":"“Buiron” is usually a proper name, not a common English word.","zh":"“Buiron”通常是专有名词（人名/地名），不是常见英语单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English vocabulary word; most often seen as a proper name (a surname or place name), likely of French origin.","zh":"不是标准英语词汇；更常见作专有名词（姓氏或地名），可能源自法语。"},"examples":[{"en":"Dr. Buiron will present the results tomorrow.","zh":"Buiron 医生将于明天汇报结果。"},{"en":"The email was signed “M. Buiron.”","zh":"这封邮件的落款是“M. Buiron”。"}]}],"phonetic":"/ˈbwɪrən/","extraExplanation":["“Buiron”在英语词典中通常不作为常用词条出现，因此更可能是人名/地名，或是拼写误差。","如果你是在阅读中遇到它：请告诉我上下文句子或你想表达的意思，我可以帮你判断它是否是某个词的误拼（例如法语/英语中的相近拼写），并给出正确词义与用法。"]}
{"word":"Buisson","summary":{"en":"Buisson is a French word/name meaning “bush” or “thicket,” also used as a surname or in place names.","zh":"Buisson 源自法语，意为“灌木（丛）”，也常作为姓氏或地名的一部分出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from French) a bush or thicket; used mainly when referring to French places, texts, or names.","zh":"（源自法语）灌木；灌木丛。多用于法语语境（地名、文本或专有名词）中。"},"examples":[{"en":"In French, *buisson* means a small bush or a patch of shrubs.","zh":"在法语里，*buisson* 指小灌木或一片灌木丛。"},{"en":"The cat hid behind a buisson near the garden wall (in a French-language story).","zh":"那只猫躲在花园墙边的灌木丛后面（法语故事语境）。"}]},{"partOfSpeech":"n.","definition":{"en":"a French surname or place-name element meaning “bush/thicket.”","zh":"法语姓氏或地名构成成分，字面意思为“灌木（丛）”。"},"examples":[{"en":"Buisson is a French family name.","zh":"Buisson 是一个法语姓氏。"},{"en":"You may see Buisson in French street or village names.","zh":"你可能会在法国的街道名或村庄名中看到 Buisson。"}]}],"synonyms":["bush","shrub","thicket"],"phonetic":"/bwiːˈsɔːn/","extraExplanation":["发音提示：法语 *buisson* 的鼻化元音在英语里不常见，英语里常用近似音来读。","词源与文化：*buisson* 在法语里很常见，既可作普通名词（“灌木丛”），也常出现在姓氏与地名中，暗示居住地附近有灌木或林缘地带。"]}
{"word":"buisson","summary":{"en":"“Buisson” is a French noun meaning a bush or shrub.","zh":"“Buisson”是法语名词，意思是“灌木；矮树丛”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(French) a bush or shrub; a small woody plant, often growing in a cluster.","zh":"（法语）灌木；矮树丛。"},"examples":[{"en":"The cat hid behind a buisson near the garden wall.","zh":"那只猫躲在花园墙边的一丛灌木后面。"},{"en":"In French, “buisson” usually means a bush rather than a tree.","zh":"在法语里，“buisson”通常指灌木而不是树。"}]}],"synonyms":["bush","shrub","thicket"],"phonetic":"/bwiːˈsɔːn/","extraExplanation":["“Buisson”是法语常用词，日常语境里多指“灌木、树丛”。英语里偶尔会在讨论法语文本、法式园林/生态描写，或作为人名/地名（如姓氏）时看到它。","常见相关法语表达：\"un buisson de roses\"（一丛玫瑰灌木）、\"se cacher dans les buissons\"（躲在灌木丛里）。"]}
{"word":"buist","summary":{"en":"Buist is most commonly used as a surname (family name).","zh":"Buist 最常见的用法是英文姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname) found in English-speaking countries; it is used to refer to a person or family with that name.","zh":"一个英文姓氏（家族姓），用于指代姓 Buist 的个人或家庭。"},"examples":[{"en":"Ms. Buist will lead today’s meeting.","zh":"Buist 女士将主持今天的会议。"},{"en":"I saw an article written by Buist in the local newspaper.","zh":"我在当地报纸上看到一篇由 Buist 撰写的文章。"}]}],"phonetic":"/bjuːst/","extraExplanation":["“Buist”通常作为专有名词（姓氏）使用，因此一般没有像普通词汇那样固定的“同义词”或常见动词/形容词用法。","在英文里，姓氏常用于正式称呼（如 Mr./Ms./Dr. Buist）或在写作中引用作者（如 Buist (2022) argues that ...）。"]}
{"word":"Buitenzorg","summary":{"en":"Buitenzorg is the historical Dutch name for Bogor, Indonesia, and it can also imply “without care” or “a worry-free place.”","zh":"Buitenzorg 是印尼茂物（Bogor）的荷兰殖民时期旧称，也可带有“无忧无虑、休憩之地”的含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Historical place name) The former Dutch colonial name for Bogor, a city in West Java, Indonesia.","zh":"（历史地名）印度尼西亚西爪哇省城市“茂物（Bogor）”在荷兰殖民时期的旧称。"},"examples":[{"en":"During the Dutch East Indies period, Bogor was widely called Buitenzorg.","zh":"在荷属东印度时期，茂物（Bogor）常被称为 Buitenzorg。"},{"en":"The Bogor Botanical Gardens were established when the area was known as Buitenzorg.","zh":"茂物植物园建立时，该地区仍被称为 Buitenzorg。"}]},{"partOfSpeech":"other","definition":{"en":"(From Dutch, literally “without care”) A word/name sometimes used to suggest a restful place or “a place free from worries.”","zh":"（源自荷兰语，字面意为“无忧无虑”）有时用作名称，带有“休憩之地、无忧之所”的含义。"},"examples":[{"en":"Some old writings explain the name Buitenzorg as meaning “without care.”","zh":"一些旧文献会解释 Buitenzorg 这个名字含有“无忧无虑”的意思。"}]}],"synonyms":["Bogor"],"phonetic":"/ˈbɔɪtənˌzɔrɡ/","extraExplanation":["Buitenzorg 是荷兰殖民时期对今天印尼“茂物（Bogor）”的称呼。该地因气候较凉爽、适合度假与行政驻地而知名，常与茂物总统府（Istana Bogor）和茂物植物园联系在一起。","现代日常使用中更常见的是 Bogor；Buitenzorg 多出现在历史资料、老地图、旅行/殖民史叙述或地名沿革讨论中。"]}

