{"word":"buonamani","summary":{"en":"“Buonamani” is most commonly an Italian surname used as a proper name, not a regular English word.","zh":"“Buonamani”最常见的是意大利姓氏，用作专有名词，不是常规英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (usually an Italian surname). It isn’t a standard English vocabulary word, so its meaning depends on the person, family, or brand it refers to.","zh":"专有名词（通常是意大利姓氏）。它不是常见的英语词汇，因此含义取决于它所指的人、家族或品牌。"},"examples":[{"en":"I met Professor Buonamani at the conference.","zh":"我在会议上见到了布奥纳马尼教授。"},{"en":"Buonamani is listed as the author on the article.","zh":"文章上作者署名是 Buonamani。"}]}],"phonetic":"ˌbwɔːnəˈmɑːni","extraExplanation":["从构词上看，它看起来像意大利语元素的组合：buona- 有“好的”的意思，mani 是“手”（复数）。但作为姓氏时通常不按字面翻译，而是当作家族名字使用。","如果你其实想输入的是意大利语短语（例如 buona mano / buone mani 等）或另一种拼写，请把原句或上下文发我，我可以按短语/习语来解释更准确的含义与用法。"]}
{"word":"buonamano","summary":{"en":"Buonamano is an Italian loanword meaning a tip (gratuity), and more literally “a good hand,” suggesting skillful help.","zh":"Buonamano 是源自意大利语的外来词，常指“小费/酬谢金”，字面也可理解为“好手”，引申为熟练的帮忙。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Italian) a tip; a gratuity given for good service.","zh":"（源自意大利语）小费；因服务好而给的酬谢金。"},"examples":[{"en":"We left a small buonamano for the waiter after dinner.","zh":"晚餐后我们给服务员留了一点小费（buonamano）。"},{"en":"In some travel guides, “buonamano” is mentioned as a polite extra payment for help.","zh":"在一些旅行指南里，“buonamano”被提到可作为对帮助的一种礼貌性额外酬谢。"}]},{"partOfSpeech":"n.","definition":{"en":"(literal meaning) a “good hand,” meaning skillful help or good workmanship.","zh":"（字面义）“好手/好手艺”，指熟练的帮忙或精湛的手艺。"},"examples":[{"en":"He did the repair with a buonamano, finishing it quickly and neatly.","zh":"他以一双“好手”（buonamano）把修理做得又快又整齐。"}]}],"synonyms":["tip","gratuity","service charge","handout"],"phonetic":"/ˌbwɑːnə ˈmɑːnoʊ/","extraExplanation":["“Buonamano”常见的意大利语写法是分开的：buona mano（字面“好手”）。在意大利语环境里更常指“给的小费/酬谢”，尤其是对临时帮忙、跑腿或服务人员的感谢。","它在英语里属于较少见的外来词，通常出现在旅行写作、历史文本或描写意大利语境的作品中；日常英语更常用 tip / gratuity。"]}
{"word":"Buonaparte","summary":{"en":"Buonaparte is an older spelling of Bonaparte, best known from Napoleon Bonaparte and his family.","zh":"Buonaparte 是 Bonaparte（波拿巴）的旧式拼写，最常见于指拿破仑·波拿巴及其家族。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an older spelling of **Bonaparte**, best known as the family name of **Napoleon Bonaparte** (Napoleon I), the French military and political leader.","zh":"**Bonaparte（波拿巴）**的旧式拼写，最常见于指**拿破仑·波拿巴**（拿破仑一世）及其家族的姓氏。"},"examples":[{"en":"In some English history books, you may see the spelling “Buonaparte” for Napoleon’s surname.","zh":"在一些英文历史书里，你可能会看到拿破仑的姓被拼作“Buonaparte”。"},{"en":"The letter was signed “N. Buonaparte,” reflecting an earlier form of the name.","zh":"这封信署名为“N. Buonaparte”，反映了这个姓氏较早的写法。"}]},{"partOfSpeech":"n.","definition":{"en":"(more broadly) the Bonaparte family, especially in historical writing about France and Europe in the late 1700s and early 1800s.","zh":"（更广义）波拿巴家族；常见于讨论18世纪末到19世纪初法国与欧洲历史的语境。"},"examples":[{"en":"The rise of the Buonapartes changed the balance of power in Europe.","zh":"波拿巴家族的崛起改变了欧洲的力量格局。"}]}],"synonyms":["Bonaparte","Napoleon Bonaparte","Napoleon I"],"phonetic":"/ˈboʊnəˌpɑrt/","extraExplanation":["“Buonaparte”带有更明显的意大利语拼写特征（如“buon-”），而英语与法语中更常见的是“Bonaparte”。在现代英文里，“Bonaparte”是标准写法；“Buonaparte”多出现在较早的文献、引文、书信或特定历史叙述中。","在文学与历史写作里，这个姓氏常被用来唤起“拿破仑时代”的联想：革命后的法国、帝国扩张、以及欧洲政治格局的剧烈变化。"]}
{"word":"Buonarroti","summary":{"en":"Buonarroti is best known as the surname of Michelangelo, the Renaissance master artist.","zh":"Buonarroti 最著名的是作为文艺复兴艺术大师米开朗琪罗的姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(A surname) Most famously, the Italian family name of Michelangelo (full name: Michelangelo Buonarroti), a major Renaissance artist known for sculpture, painting, and architecture.","zh":"（姓氏）最著名的用法是指意大利姓氏“布奥纳罗蒂”，尤指文艺复兴时期艺术巨匠米开朗琪罗（全名：Michelangelo Buonarroti），以雕塑、绘画与建筑闻名。"},"examples":[{"en":"Michelangelo Buonarroti sculpted the statue of David.","zh":"米开朗琪罗·布奥纳罗蒂雕刻了《大卫》雕像。"},{"en":"In art history class, we studied Buonarroti’s work on the Sistine Chapel ceiling.","zh":"在艺术史课上，我们学习了布奥纳罗蒂在西斯廷礼拜堂天顶画上的作品。"}]}],"synonyms":["Michelangelo (common reference)"],"phonetic":"/ˌbwɑːnəˈrɑːti/","extraExplanation":["“Buonarroti”是意大利姓氏，常见于艺术史语境中，很多英文资料会用“Michelangelo”直称，也会用“Buonarroti”来强调其家族姓或与同名人物区分。","米开朗琪罗·布奥纳罗蒂（1475–1564）是文艺复兴“三杰”之一（另外两位常被称为达·芬奇与拉斐尔）。他的重要作品包括《大卫》《哀悼基督》（Pietà）以及西斯廷礼拜堂天顶画等。","发音上，英语里常按意大利姓的拼写读成多音节；在写作中它通常作为专有名词首字母大写。"]}
{"word":"buono","summary":{"en":"“Buono” is an Italian word meaning “good,” often used to praise food, ideas, or quality.","zh":"“buono”是意大利语，意思是“好/不错”，常用来夸食物、想法或品质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Italian) good; nice; of good quality.","zh":"（意大利语）好的；不错的；高质量的。"},"examples":[{"en":"Questo pane è buono.","zh":"这面包很好吃／很好。"},{"en":"Ha avuto un’idea buona (or: buono, depending on context).","zh":"他／她有个好主意。"},{"en":"That restaurant is really buono.","zh":"那家餐厅真的很不错（口语里夹用意大利语）。"}]},{"partOfSpeech":"n.","definition":{"en":"(Italian) a good person; something good (often used with an article: il buono).","zh":"（意大利语）好人；好的事物（常与冠词连用：il buono）。"},"examples":[{"en":"Lui è un buono.","zh":"他是个好人。"},{"en":"Bisogna vedere il buono nelle persone.","zh":"要看到人身上的优点／善意。"}]}],"synonyms":["good","nice","great","bene (Italian)","bravo (Italian, for people)"],"phonetic":"/ˈbwoʊnoʊ/","extraExplanation":["“buono”是意大利语形容词，性数要配合名词变化：阳性单数 buono，阴性单数 buona，阳性复数 buoni，阴性复数 buone。比如：un buon caffè（一杯好咖啡，元音前常写作 buon），una buona idea（一个好主意）。","在美食语境里，“buono!”常用来表示“好吃！/真不错！”，带有很生活化、亲切的语气。","你可能在固定表达里见到它：buon giorno（早上好/你好）、buona sera（晚上好）、buon appetito（祝你用餐愉快）。"]}
{"word":"Buonomo","summary":{"en":"Buonomo is an Italian-origin surname, historically linked to the meaning “good man.”","zh":"Buonomo 是意大利语来源的姓氏，词源上与“好人/善良的人”有关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a surname of Italian origin; as a family name, it can be understood as “good man” (from Italian roots).","zh":"一个意大利语来源的姓氏；作为家族姓氏，其词源含义可理解为“好人/善良的人”。"},"examples":[{"en":"Dr. Buonomo will present the research results today.","zh":"Buonomo 医生今天将展示研究结果。"},{"en":"Her last name is Buonomo, and her family is from southern Italy.","zh":"她的姓是 Buonomo，她的家族来自意大利南部。"}]}],"synonyms":["(no true synonyms; it’s a proper name)"],"phonetic":"/ˌbwoʊˈnoʊmoʊ/","extraExplanation":["“Buonomo”多见于意大利姓氏。词源上可拆为意大利语 buono（好）+ uomo（男人/人），在较早的拼写中可能出现类似“buon’ uomo”的组合，后来逐渐固定为姓氏。实际使用时，它通常只表示家族姓，不一定表达对某人“是好人”的评价。"]}
{"word":"Buononcini","summary":{"en":"Buononcini/Bononcini is an Italian surname, best known for the Baroque composer Giovanni Battista Bononcini.","zh":"Buononcini/Bononcini 是一个意大利姓氏，最常指巴洛克作曲家乔瓦尼·巴蒂斯塔·博农奇尼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) An Italian surname, most famously referring to Giovanni Battista Bononcini (1670–1747), a Baroque-era Italian composer and cellist who worked in several European courts, including London.","zh":"（专有名词）一个意大利姓氏，最著名的指乔瓦尼·巴蒂斯塔·博农奇尼（1670–1747），巴洛克时期的意大利作曲家与大提琴家，曾在包括伦敦在内的多个欧洲宫廷活动。"},"examples":[{"en":"Bononcini was once a major musical rival to Handel in London.","zh":"博农奇尼曾在伦敦一度是亨德尔的重要音乐竞争者。"},{"en":"The program includes an aria by Bononcini alongside works by other Baroque composers.","zh":"这场音乐会的曲目包含博农奇尼的一首咏叹调，以及其他巴洛克作曲家的作品。"}]}],"synonyms":["Bononcini","Giovanni Battista Bononcini"],"phonetic":"ˌbwɑːnoʊnˈtʃiːni","extraExplanation":["“Buononcini”常见写法是“Bononcini”。意大利语里“buono-”有“好的”之意，但作为姓氏不必按字面翻译。","他在18世纪初的伦敦很受欢迎，曾与亨德尔形成“谁更好”的公众争论（当时的乐坛与社交圈话题）。"]}
{"word":"Buote","summary":{"en":"“Buote” is usually a surname (a proper name), not a standard English word.","zh":"“Buote”通常是姓氏（专有名词），而不是常规英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A surname (family name). It is not a common English vocabulary word, and it is usually seen as a person’s last name (e.g., in emails, articles, or citations).","zh":"一个姓氏（家族名）。它不是常见的英语词汇，通常作为人的姓出现在邮件、文章或参考文献中。"},"examples":[{"en":"I met Dr. Buote at the conference.","zh":"我在会议上认识了 Buote 博士。"},{"en":"The paper was written by Buote and colleagues.","zh":"这篇论文由 Buote 及其同事撰写。"}]}],"phonetic":"/buːˈoʊt/","extraExplanation":["“Buote”在英语里更常见为专有名词（人名/姓氏），而不是词典里的普通单词。","如果你其实想查的是拼写相近的词，常见可能包括：boat（船）、quote（引用/引语）、bought（buy 的过去式/过去分词，买了）。你可以告诉我你想表达的语境（一句话或所在句子），我可以帮你确认正确词。"]}
{"word":"buoy","summary":{"en":"A buoy is a floating marker in water; as a verb, it means to keep afloat or to encourage/support.","zh":"buoy 指水上的浮标；作动词表示使漂浮，或比喻“鼓舞、支撑（精神）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A floating object (often bright-colored) that marks a place in the water, warns of danger, or shows a safe route.","zh":"（水上的）浮标；浮筒（通常颜色醒目，用来标示位置、警示危险或指引航道）"},"examples":[{"en":"The boat followed the line of red and green buoys into the harbor.","zh":"船沿着红绿浮标的路线驶入港口。"},{"en":"Stay inside the buoys so you don’t swim into the boating area.","zh":"请在浮标内游泳，别游到船只活动区。"}]},{"partOfSpeech":"v.","definition":{"en":"To keep something floating, or to support and lift someone’s or something’s spirits.","zh":"使漂浮；（比喻）鼓舞、支撑（精神）"},"examples":[{"en":"A life jacket will buoy you up if you fall into the water.","zh":"如果你掉进水里，救生衣会把你托浮起来。"},{"en":"The good news buoyed her confidence before the interview.","zh":"好消息在面试前鼓舞了她的信心。"}]}],"synonyms":["float","marker","lifebuoy","keep afloat","uplift","encourage"],"phonetic":"/bui/","extraExplanation":["“buoy”在航海英语里很常见：不同颜色/形状的浮标代表不同信息（例如安全航道、危险区域、停泊点），各国标准略有差异。","发音提示：拼写里的“uoy”不按常见拼读规则，日常中常读作 /bui/（同“boo-ee”）。"]}
{"word":"buoyage","summary":{"en":"Buoyage means the arrangement or system of buoys that marks navigation routes and hazards.","zh":"Buoyage 指用浮标组成的布设/系统，用于标示航道与水域危险。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a system of buoys used to mark a safe navigation route, channel, or hazards in the water","zh":"（航海）浮标系统；用来标示航道、安全水域或危险区域的一系列浮标"},"examples":[{"en":"The harbor’s buoyage guides ships into the channel at night.","zh":"港口的浮标系统在夜间引导船只进入航道。"},{"en":"After the storm, the buoyage was checked to make sure the markers were still in the right places.","zh":"暴风雨过后，人们检查了浮标系统，确保标志仍在正确位置。"}]}],"synonyms":["buoy system","navigation marks","buoying (rare)","aids to navigation (broader)"],"phonetic":"/ˈbɔɪ.ɪdʒ/","extraExplanation":["“Buoyage”是航海与海事英语中较专业的名词，常见于海图、航海通告（Notice to Mariners）和港口管理文件里，日常口语更常说“buoys”或“buoy system”。","不同国家/海区可能采用不同的侧标体系（例如IALA A与IALA B），同样颜色与形状在不同体系中表示的“左/右舷航标”规则可能相反；出海时需要确认当地采用哪一套规则。"]}
{"word":"buoyages","summary":{"en":"Buoyage means the buoy system (or the practice of setting buoys) that helps boats navigate safely.","zh":"Buoyage 指用于航行引导的浮标系统，或布设与维护浮标的做法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the system or arrangement of buoys used to mark channels, hazards, or safe water for navigation","zh":"（航海）浮标系统；浮标的设置与布局（用于标示航道、危险区或安全水域）"},"examples":[{"en":"The harbor’s buoyage guides ships safely into the channel.","zh":"港口的浮标系统引导船只安全进入航道。"},{"en":"Local fishermen know the buoyage well and avoid the rocky area.","zh":"当地渔民很熟悉这片海域的浮标设置，会避开礁石区。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or practice of placing and maintaining buoys","zh":"设置并维护浮标的行为；布设浮标的做法"},"examples":[{"en":"Winter storms can damage buoyage, so repairs are common in spring.","zh":"冬季风暴可能损坏浮标设施，所以春季常需要维修。"}]}],"synonyms":["buoy system","navigation buoys","buoy marking","buoyage system"],"phonetic":"/ˈbuːiɪdʒ/","extraExplanation":["“buoyages”是名词“buoyage”的复数形式。这个词多用于航海与海图语境，常见搭配有“lateral buoyage system（侧面浮标系统）”“cardinal buoyage（方位浮标标示法）”。不同国家/海区可能采用不同的标示体系，阅读海图或航行通告时尤其常见。"]}
{"word":"buoyance","summary":{"en":"“Buoyance” is usually a misspelling of “buoyancy,” meaning floating ability, cheerful resilience, or economic strength.","zh":"“buoyance”通常是“buoyancy”的误拼，意思可指浮力、乐观振作的精神状态，或经济/市场的景气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually spelled “buoyancy”) the ability of something to float or rise in water or air.","zh":"（通常拼作“buoyancy”）浮力；漂浮/上浮的能力。"},"examples":[{"en":"A life jacket provides buoyancy so you can stay afloat.","zh":"救生衣提供浮力，让你能漂在水面上。"},{"en":"Ice has enough buoyancy to float on water.","zh":"冰的浮力足够大，所以能浮在水面上。"}]},{"partOfSpeech":"n.","definition":{"en":"A light, cheerful feeling; the ability to stay positive and recover quickly after difficulties.","zh":"轻快、乐观的精神状态；（经历困难后）迅速振作的能力。"},"examples":[{"en":"Her natural buoyancy helped the team through a tough week.","zh":"她天生的乐观与活力帮助团队熬过了艰难的一周。"},{"en":"He spoke with buoyancy despite the bad news.","zh":"尽管有坏消息，他说话仍带着轻快的劲头。"}]},{"partOfSpeech":"n.","definition":{"en":"(Business/economics) a strong, healthy condition of a market or economy; rising confidence and activity.","zh":"（商业/经济）景气；市场或经济的活跃与向好。"},"examples":[{"en":"There is buoyancy in the housing market this year.","zh":"今年房地产市场很景气。"},{"en":"Consumer spending added buoyancy to the economy.","zh":"消费支出为经济带来了活力。"}]}],"synonyms":["buoyancy","floatation","uplift","cheerfulness","resilience","optimism"],"phonetic":"/ˈbɔɪənsi/","extraExplanation":["“buoyance”常见于拼写错误；标准拼写是 **buoyancy**（以 -ancy 结尾）。","词源与“buoy（浮标）”相关，核心意象是“浮起来/被托起”，因此既能指物理上的“浮力”，也能引申为情绪上的“振奋、轻快”。","常见搭配：**provide buoyancy**（提供浮力）、**emotional buoyancy**（情绪韧性/振作力）、**market buoyancy**（市场景气）。"]}
{"word":"buoyances","summary":{"en":"Buoyancy (plural: buoyances) means floating ability in water/air, or a cheerful, optimistic spirit.","zh":"Buoyancy（复数：buoyances）指“浮力/漂浮能力”，也可指“乐观轻快、振奋的精神状态”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the ability of an object to float or rise in a liquid or gas (like water or air)","zh":"（物体在液体或气体中）漂浮或上升的能力；浮力"},"examples":[{"en":"A life jacket helps with buoyancy in the water.","zh":"救生衣能帮助人在水中保持浮力。"},{"en":"The boat’s buoyancy depends on its shape and the air inside it.","zh":"船的浮力取决于它的形状以及内部的空气。"}]},{"partOfSpeech":"n.","definition":{"en":"a light, cheerful, hopeful feeling; the quality of being energetic and positive","zh":"轻快、乐观、充满希望的心情；振奋感"},"examples":[{"en":"Her buoyancy helped the team stay calm under pressure.","zh":"她的乐观振奋让团队在压力下仍保持冷静。"},{"en":"After getting good news, he spoke with renewed buoyancy.","zh":"得到好消息后，他说话时又恢复了轻快与振奋。"}]}],"synonyms":["floatability","flotation","uplift","cheerfulness","optimism"],"phonetic":"/ˈbɔɪənsi/","extraExplanation":["你输入的“buoyances”是名词复数，通常单数更常用：buoyancy（更常见的拼写）或 buoyance（较少见的变体）。在科学语境（物理、工程）里几乎都用 buoyancy。","比喻用法很常见：buoyancy 可以指“情绪/市场/信心的回升”。例如：market buoyancy（市场活力/景气）。"]}
{"word":"buoyancies","summary":{"en":"“Buoyancies” is the plural of “buoyancy,” meaning (1) the ability to float and (2) a cheerful, resilient attitude.","zh":"“Buoyancies”是“buoyancy”的复数，意思是（1）浮力/浮性；（2）乐观开朗、富有韧性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the ability of something to float or rise in a liquid or gas (because it is lighter than what surrounds it)","zh":"（物体在液体或气体中的）浮力；浮性（因密度较小而能漂浮或上浮）"},"examples":[{"en":"A life jacket provides buoyancy in the water.","zh":"救生衣在水中提供浮力。"},{"en":"The boat’s buoyancies depend on its shape and how much weight it carries.","zh":"船的浮力取决于它的形状以及载重多少。"}]},{"partOfSpeech":"n.","definition":{"en":"a light, cheerful, and confident quality; the ability to stay positive and recover quickly","zh":"乐观开朗；（从挫折中）迅速恢复的韧性"},"examples":[{"en":"Her buoyancies helped the team stay calm during the crisis.","zh":"她的乐观与韧性帮助团队在危机中保持冷静。"},{"en":"Even after failure, he spoke with buoyancy.","zh":"即使失败后，他说话仍带着乐观的劲头。"}]}],"synonyms":["flotation","floatability","uplift","cheerfulness","optimism","resilience"],"phonetic":"/ˈbɔɪənsi/","extraExplanation":["“buoyancy”既可指物理学里的“浮力”，也常用作比喻，表示人“情绪轻快、很有韧性”。这种抽象用法来自“能浮起来”的形象：困难像水，人能“浮在上面”不被压垮。"]}
{"word":"buoyancy","summary":{"en":"Buoyancy means the power to float in a liquid, and it can also mean a cheerful, resilient spirit.","zh":"Buoyancy既指在液体中的浮力/漂浮性，也可指轻快乐观、很有韧性的精神状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The ability of an object to float or rise in a liquid (usually water) because the liquid pushes upward on it.","zh":"（通常指在水中）物体由于液体的向上托力而能够漂浮或上升的能力；浮力/漂浮性。"},"examples":[{"en":"Wood has natural buoyancy, so it floats on water.","zh":"木头有天然的浮力，所以会浮在水面上。"},{"en":"The boat’s buoyancy depends on its shape and how much weight it carries.","zh":"船的漂浮能力取决于它的形状以及载重多少。"},{"en":"Engineers test buoyancy to make sure a life jacket keeps a person afloat.","zh":"工程师会测试浮力，以确保救生衣能让人漂浮在水面上。"}]},{"partOfSpeech":"n.","definition":{"en":"A light, cheerful feeling that helps you stay confident and recover quickly from problems; an uplifting spirit.","zh":"轻快、乐观的心态；振作感（让人更有信心、从困难中更快恢复）。"},"examples":[{"en":"Her buoyancy helped the team stay calm under pressure.","zh":"她的乐观振作让团队在压力下仍保持冷静。"},{"en":"Despite the bad news, he spoke with surprising buoyancy.","zh":"尽管有坏消息，他说话时仍出奇地轻松乐观。"}]}],"synonyms":["floatability","flotation","uplift","cheerfulness","resilience"],"phonetic":"/ˈbɔɪənsi/","extraExplanation":["“buoyancy”来自“buoy”（浮标/浮筒）。物理意义上与阿基米德原理有关：物体在液体中会受到向上的浮力，大小等于它排开液体的重量。","比喻义（精神上的“振作、轻快”）常见于新闻、文学和演讲中，用来形容一种“被托起来”的积极心态。"]}
{"word":"buoyancy force","summary":{"en":"an upward push from a fluid that helps an object float or feel lighter","zh":"流体对物体的向上推力，使其漂浮或变轻"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The upward force a fluid (like water or air) exerts on an object placed in it, making the object feel lighter or float.","zh":"流体（如水或空气）对浸入其中的物体施加的向上作用力，使物体“变轻”或漂浮。"},"examples":[{"en":"A life jacket increases the buoyancy force on your body, helping you float.","zh":"救生衣会增大你身体受到的浮力，帮助你漂浮。"},{"en":"In water, the buoyancy force partly balances the weight of the object.","zh":"在水中，浮力会部分抵消物体的重力。"},{"en":"The buoyancy force depends on how much fluid the object displaces.","zh":"浮力取决于物体排开了多少流体。"}]}],"synonyms":["buoyant force","upthrust","lift"],"phonetic":"/ˈbɔɪənsi fɔrs/","extraExplanation":["物理要点（阿基米德原理）：浮力大小等于物体排开流体的重量，即 F = ρ·g·V（ρ为流体密度，g为重力加速度，V为排开体积）。","用词提醒：日常或教材里通常说“buoyant force”或直接说“buoyancy”；“buoyancy force”能被理解，但不如“buoyant force”地道。"],"etymology":"“buoyancy”来自“buoy（浮标）”，引申为“漂浮能力/浮性”；“force”来自拉丁语“fortis（强的）”相关词根，表示“力”。物理学里更常见的标准说法是“buoyant force（浮力）”。","mnemonic":["记“buoy（浮标）→ buoyant（能浮的）→ buoyancy（浮性）”，加上 force 就是“让你往上浮的力”。","把 buoy 读音联想成“博一（搏一）下就浮起来”，帮助记住“浮”的核心含义。"]}
{"word":"buoyancy-free","summary":{"en":"“Buoyancy-free” means not affected by buoyancy—designed to neither float up nor sink in water (often used in technical/engineering contexts).","zh":"“buoyancy-free”指不受浮力影响的——通常在水中被设计成既不明显上浮也不下沉（多用于技术/工程语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not affected by buoyancy (the upward force in a fluid); designed so it does not float up or sink down in water.","zh":"不受浮力影响的；（在水中）被设计成不往上浮也不往下沉的。"},"examples":[{"en":"The engineers used a buoyancy-free cable so it wouldn’t rise and tangle near the surface.","zh":"工程师使用了无浮力影响的电缆，这样它就不会上浮到水面附近而缠绕。"},{"en":"A buoyancy-free setup helps sensors stay at a stable depth underwater.","zh":"无浮力影响的配置能帮助传感器在水下保持稳定深度。"}]},{"partOfSpeech":"adj.","definition":{"en":"(More generally) Free from the need to deal with floating/sinking effects; not requiring buoyancy correction.","zh":"（更一般地）无需考虑漂浮/下沉影响的；不需要做浮力修正的。"},"examples":[{"en":"The lab chose a buoyancy-free reference method to reduce measurement error.","zh":"实验室选择了无需浮力修正的基准方法，以减少测量误差。"}]}],"synonyms":["neutrally buoyant","buoyancy-neutral","non-buoyant","neutral buoyancy"],"phonetic":"/ˈbɔɪənsi friː/","extraExplanation":["“buoyancy-free”常见于海洋工程、水下机器人（ROV/AUV）、潜水装备与水下布放系统等语境，描述电缆、软管、仪器外壳或整体系统通过配重、泡沫材料或结构设计实现“中性浮力/近似中性浮力”，从而在水中更稳定、可控。","日常口语里更常说“neutrally buoyant（中性浮力的）”。“buoyancy-free”偏技术写法，强调“浮力效应可忽略/被消除”。"]}
{"word":"buoyant","summary":{"en":"Buoyant means (1) able to float and (2) cheerful and optimistic.","zh":"Buoyant既可指“有浮力、能漂浮的”，也可指“乐观振奋的、积极的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to float; kept up by air or water.","zh":"有浮力的；能漂浮的（被空气或水支撑着）。"},"examples":[{"en":"Life jackets are made of buoyant material so you can float.","zh":"救生衣用有浮力的材料做成，这样你就能漂浮在水面上。"},{"en":"Oil is more buoyant than water, so it rises to the top.","zh":"油的浮力（相对更“轻”）比水大，所以会浮到上面。"}]},{"partOfSpeech":"adj.","definition":{"en":"Cheerful, confident, and able to stay positive even in difficulty.","zh":"乐观振奋的；有信心的；在困难中也能保持积极的。"},"examples":[{"en":"She stayed buoyant after the interview, even though she wasn’t sure about the result.","zh":"面试后她依然很乐观，尽管不确定结果如何。"},{"en":"His buoyant mood made the whole team feel hopeful.","zh":"他振奋的情绪让整个团队都更有希望。"}]}],"synonyms":["floating","able to float","cheerful","upbeat","optimistic","lighthearted"],"phonetic":"/ˈbɔɪənt/","extraExplanation":["“buoyant”常同时用于两种语境：一是“能漂浮”的物理意义（和 water、float、material 等词搭配）；二是比喻意义“精神振奋、情绪高涨”。英语里很常见用“上浮/被托起”的画面来比喻“情绪被鼓舞”。","常见搭配：buoyant foam（浮力泡沫）、buoyant economy/market（景气、强劲的经济/市场）、buoyant spirits（高昂的情绪）。注意：buoyant market 更偏“活跃、强势”，不一定表示“稳定”。"]}
{"word":"buoyantly","summary":{"en":"Buoyantly means either (1) in a cheerful, upbeat way, or (2) in a floating, rising way because of buoyancy.","zh":"buoyantly 可指（1）情绪上轻快乐观地；也可指（2）因浮力而轻盈地漂浮/上浮。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a cheerful, confident, and lively way; with high spirits.","zh":"以轻快、乐观、自信的方式；兴致勃勃地。"},"examples":[{"en":"She spoke buoyantly about her plans for the future.","zh":"她兴致勃勃地谈起自己未来的计划。"},{"en":"Despite the bad news, he remained buoyantly optimistic.","zh":"尽管有坏消息，他依然乐观积极。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that floats or rises easily on water or in the air; with buoyancy.","zh":"以有浮力、容易漂浮或上浮的方式。"},"examples":[{"en":"The cork moved buoyantly on the surface of the water.","zh":"软木塞轻盈地漂浮在水面上。"},{"en":"The inflatable raft bobbed buoyantly in the waves.","zh":"充气筏在浪里轻快地上下起伏。"}]}],"synonyms":["cheerfully","optimistically","lightly","floatily"],"phonetic":"/ˈbɔɪ.ənt.li/","extraExplanation":["“buoyant”的核心意象是“浮力”：能浮起来、不容易沉下去。引申到情绪时，就变成“精神不被压垮、很有朝气”。因此你会看到它既能形容物理上的“漂浮”，也常用来形容“情绪高涨/市场回暖”等抽象状态。","常见搭配：buoyantly optimistic（乐观向上）、buoyantly confident（信心十足）、buoyant mood（高涨的情绪）、a buoyant economy/market（景气、回暖的经济/市场）。"]}
{"word":"buoyantness","summary":{"en":"Buoyantness means the quality of floating easily, and less commonly a cheerful, upbeat spirit.","zh":"Buoyantness 指“易漂浮的性质/浮力”，较少见时也可指“轻快乐观的精神状态”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being buoyant; the ability to float or rise in a liquid or gas.","zh":"浮力；漂浮性；在液体或气体中能浮起或上升的性质。"},"examples":[{"en":"The buoyantness of the life jacket kept him above the water.","zh":"救生衣的浮力让他一直浮在水面上。"},{"en":"Scientists measured the buoyantness of different materials in salt water.","zh":"科学家测量了不同材料在盐水中的漂浮性。"}]},{"partOfSpeech":"n.","definition":{"en":"A light, cheerful, optimistic feeling or attitude (less common).","zh":"轻快乐观的情绪；振奋感（较不常用）。"},"examples":[{"en":"Her buoyantness helped the team stay hopeful during a difficult week.","zh":"她的乐观振奋让团队在艰难的一周里仍保持希望。"},{"en":"The novel has a buoyantness that makes even sad moments feel gentle.","zh":"这部小说有一种轻快的气质，让悲伤的时刻也显得温柔。"}]}],"synonyms":["buoyancy","floatability","lightness","cheerfulness","optimism"],"phonetic":"/ˈbɔɪəntnəs/","extraExplanation":["“buoyantness”来自形容词“buoyant”（有浮力的；乐观的）+ 名词后缀“-ness”。日常英语里更常用的名词是“buoyancy”，尤其在科学/工程语境（如：buoyancy force 浮力）。","在文学或评论里，用“buoyantness”描述作品气氛时，常强调“轻盈、明亮、向上”的感觉。"]}
{"word":"buoyed","summary":{"en":"“Buoyed” means supported—either kept floating on water or lifted in spirits (made more hopeful/confident).","zh":"“Buoyed”表示“被支撑”：既可指在水中被托起漂浮，也可指精神上被鼓舞、振作起来。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “buoy”: kept floating or held up on water","zh":"“buoy”的过去式/过去分词：使漂浮；让物体在水中浮起或支撑住"},"examples":[{"en":"The life jacket buoyed him up in the water.","zh":"救生衣让他在水里浮了起来。"},{"en":"Boats were buoyed by the calm sea.","zh":"平静的海面支撑着船只漂浮。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “buoy”: supported emotionally; made more confident or hopeful","zh":"“buoy”的过去式/过去分词：鼓舞；使振作；让人更有信心或希望"},"examples":[{"en":"She was buoyed by her friends’ encouragement.","zh":"朋友们的鼓励让她振作起来。"},{"en":"The team felt buoyed after the first win.","zh":"首战获胜后，全队士气大振。"},{"en":"Buoyed by good news, he decided to apply again.","zh":"受到好消息的鼓舞，他决定再申请一次。"}]}],"synonyms":["uplifted","encouraged","heartened","supported","sustained"],"phonetic":"/bɔɪd/","extraExplanation":["“buoyed”常用于被动结构：be buoyed by…（受到……的鼓舞/支撑）。这个比喻来自“浮在水面上”：就像水把东西托起一样，支持或好消息能“托住”人的情绪与信心。","拼写提示：buoy 发音接近 “boy”，因此 buoyed 读 /bɔɪd/。"]}
{"word":"buoying","summary":{"en":"“Buoying” means keeping something afloat or, figuratively, encouraging and lifting someone’s spirits.","zh":"“Buoying”指使某物漂浮、托起；也可引申为鼓舞、提振他人情绪。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “buoy”) to keep something floating or to lift/support it upward, especially on water.","zh":"（动词 buoy 的现在分词）使……浮起；（尤指在水中）支撑、托起。"},"examples":[{"en":"Air trapped in the life jacket is buoying the child above the waves.","zh":"救生衣里困住的空气正把孩子托在浪面上。"},{"en":"The corks are buoying the net so it doesn’t sink.","zh":"浮标（软木塞）在托着渔网，防止它下沉。"}]},{"partOfSpeech":"adj.","definition":{"en":"Giving emotional support or encouragement; uplifting.","zh":"（比喻）鼓舞人心的；令人振奋的；给人支持的。"},"examples":[{"en":"Her buoying words helped me stay calm before the interview.","zh":"她那些鼓励的话让我在面试前保持冷静。"},{"en":"The team drew energy from the buoying applause of the crowd.","zh":"观众振奋的掌声给了球队力量。"}]}],"synonyms":["uplifting","encouraging","supportive","heartening","keeping afloat"],"phonetic":"/ˈbuːiɪŋ/","extraExplanation":["“buoying”常被误读或误写成“buying”。发音里有一个很明显的 /buː/（像“boo”）开头。","字面意思和“浮力/漂浮”有关；引申义常用来表达“给人精神上的支撑”，类似“lift someone’s spirits（提振心情）”。"]}
{"word":"buoys","summary":{"en":"“Buoys” can mean floating water markers (plural noun), or it can be the verb form meaning “encourages/supports.”","zh":"“Buoys”既可指“浮标”（名词复数），也可作动词形式，表示“鼓舞/支撑（情绪或信心）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Floating markers anchored in water to show safe routes, warn of danger, or mark a location (plural of “buoy”).","zh":"（buoy 的复数）浮标；水上标志物：固定在水面上，用来指示航道、警示危险或标记位置。"},"examples":[{"en":"The sailors followed the buoys to stay in the safe channel.","zh":"水手沿着浮标航行，以保持在安全航道内。"},{"en":"After the storm, some buoys were missing or out of place.","zh":"暴风雨过后，一些浮标丢失了或移位了。"}]},{"partOfSpeech":"v.","definition":{"en":"To keep someone’s feelings, confidence, or spirits up; to support or encourage (third-person singular form of “buoy”).","zh":"鼓舞；使振作；支撑（动词 buoy 的第三人称单数形式）。"},"examples":[{"en":"Good news buoys her confidence before the exam.","zh":"好消息让她在考试前信心大增。"},{"en":"He buoys the team with calm advice.","zh":"他用冷静的建议鼓舞团队。"}]}],"synonyms":["(n.) floats","(n.) markers","(n.) beacons","(v.) encourage","(v.) uplift","(v.) support"],"phonetic":"/bɔɪ/","extraExplanation":["发音提示：buoy 常读作 /bɔɪ/，听起来很像 boys（男孩们），这是很多学习者容易混淆的点。","名词 buoy 多用于航海与水域安全场景，如 channel buoy（航道浮标）、warning buoy（警示浮标）。动词 buoy 常用于较正式的表达，表示“振奋/支撑情绪”，如 buoy up one’s spirits。"]}

