{"word":"BUP","summary":{"en":"BUP is usually an abbreviation. In chat it can mean “backup,” or it may simply be initials whose meaning depends on context.","zh":"BUP通常是缩写：在聊天中可指“备用/备选（backup）”，也可能只是首字母组合，含义取决于上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation used in messages to mean “backup,” especially when planning a second option.","zh":"在短信或聊天中常用的缩写，表示“备用/备选方案（backup）”，指第二选择或后备计划。"},"examples":[{"en":"If the restaurant is full, we have a BUP plan: we’ll grab pizza nearby.","zh":"如果那家餐厅满了，我们有个BUP备用方案：去附近吃披萨。"},{"en":"Bring a BUP charger in case your battery dies.","zh":"带一个备用（BUP）充电器，以防电量耗尽。"}]},{"partOfSpeech":"other","definition":{"en":"the spoken/written initials “B-U-P,” used for many different names (e.g., an organization, plan, program, or department). The meaning depends on the context.","zh":"字母缩写“B-U-P”，可代表许多不同的名称（如机构、计划、项目或部门）；具体含义取决于上下文。"},"examples":[{"en":"What does BUP stand for in this document?","zh":"这份文件里的BUP代表什么？"},{"en":"Please send the report to the BUP team by Friday.","zh":"请在周五前把报告发给BUP团队。"}]}],"synonyms":["backup (informal meaning)","Plan B"],"phonetic":"/biː juː piː/","extraExplanation":["“BUP”不是一个固定只对应一种意思的常用英语单词，更常见的是首字母缩写。阅读或写作时，最好在首次出现处写出全称（e.g., “Business Unit Plan (BUP)”）以避免误解。","口语中通常按字母读作“B-U-P”。在不同领域（公司、学校、医疗、政府等）可能有不同全称，因此需要结合上下文判断。"]}
{"word":"Buphaga","summary":{"en":"Buphaga is the scientific genus name for oxpeckers—African birds that feed on parasites on large mammals.","zh":"Buphaga 是牛椋鸟（oxpecker）的属名，指一类在非洲大型哺乳动物身上取食寄生虫的鸟类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of African birds known as oxpeckers, which often perch on large mammals (like cattle, buffalo, and rhinos) and feed on ticks and other parasites.","zh":"（生物学）牛椋鸟属：一种非洲鸟类的属名，俗称“牛椋鸟（oxpecker）”，常停在大型哺乳动物（如牛、水牛、犀牛）身上，取食蜱虫等寄生虫。"},"examples":[{"en":"Buphaga birds are often seen riding on buffalo and picking off ticks.","zh":"牛椋鸟属的鸟常被看到站在水牛背上啄食蜱虫。"},{"en":"In the field guide, Buphaga is listed under the common name “oxpecker.”","zh":"在野外图鉴里，Buphaga 通常以“牛椋鸟（oxpecker）”的俗名出现。"}]}],"synonyms":["oxpecker","African oxpecker"],"phonetic":"/buːˈfeɪɡə/","extraExplanation":["“Buphaga”是学名（属名），常见于科普文章、纪录片解说和学术写作；日常英语里更常说 oxpecker。","词源来自希腊语：bous（牛）+ phagein（吃），字面意思接近“吃牛身上东西的（鸟）”，呼应它们在大型动物身上觅食的行为。","关于它与宿主动物的关系，常被描述为“互利共生”（帮忙除寄生虫），但也有研究指出它们有时会啄食伤口或血液，因此语境中可能会提到“互利”与“争议”两面。"]}
{"word":"buphaga","summary":{"en":"Buphaga is the genus name for oxpeckers—African birds that feed on ticks and other parasites on large mammals.","zh":"Buphaga 指牛椋鸟属：非洲的一类鸟，常在大型哺乳动物身上吃蜱虫等寄生虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of African birds called oxpeckers, known for perching on large mammals (like cattle, buffalo, and rhinos) and feeding on ticks and other parasites.","zh":"牛椋鸟属（Buphaga）：一种生活在非洲的鸟类属，常停在大型哺乳动物（如牛、水牛、犀牛）身上，啄食蜱虫等寄生虫。"},"examples":[{"en":"The guide pointed out a Buphaga on the buffalo’s back, picking off ticks.","zh":"导游指着水牛背上的一只牛椋鸟属的鸟，正在啄食蜱虫。"},{"en":"Some researchers study how Buphaga affects the health of its host animals.","zh":"一些研究者会研究牛椋鸟属如何影响“宿主”动物的健康。"}]}],"synonyms":["oxpecker"],"phonetic":"/buːˈfeɪɡə/","extraExplanation":["“Buphaga”源自希腊语词根：bous（牛）+ phagein（吃），字面意思接近“吃牛的（东西）”，指它们常在牛等大型动物身上取食。","日常英语里更常用的不是拉丁学名“Buphaga”，而是普通名词 oxpecker（牛椋鸟）。在纪录片、科普文章或动物学语境中更容易见到 Buphaga。"]}
{"word":"Buphagus","summary":{"en":"Buphagus is the genus name for African oxpeckers—birds that often sit on large mammals and eat ticks and other parasites.","zh":"Buphagus 指牛椋鸟属：一种非洲牛背啄鸟，常停在大型哺乳动物身上，啄食蜱虫等寄生虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of African birds called oxpeckers, known for perching on large mammals and eating ticks and other parasites","zh":"牛椋鸟属（Buphagus）：一种非洲鸟类属，常停在大型哺乳动物身上，啄食蜱虫等寄生虫"},"examples":[{"en":"The genus Buphagus includes the red-billed and yellow-billed oxpeckers.","zh":"牛椋鸟属（Buphagus）包括红嘴牛椋鸟和黄嘴牛椋鸟。"},{"en":"Researchers observed a Buphagus bird riding on a buffalo and picking ticks from its skin.","zh":"研究人员观察到一只牛椋鸟属的鸟站在水牛背上，从皮肤上啄走蜱虫。"},{"en":"In African savannas, Buphagus species often appear alongside zebras, giraffes, and rhinos.","zh":"在非洲稀树草原上，牛椋鸟属的鸟常与斑马、长颈鹿和犀牛同框出现。"}]}],"synonyms":["oxpecker","tickbird"],"phonetic":"/ˈbjuːfəɡəs/","extraExplanation":["“Buphagus”来自希腊语词根：bous（牛）+ phagein（吃），字面意思是“吃牛的（东西）”，指它们常在牛等大型动物身上觅食。","常见英文俗名是“oxpecker”（牛背啄鸟）或“tickbird”（啄蜱鸟）。它们与大型哺乳动物的关系有时被描述为“互利共生”，但也有研究指出它们偶尔会啄食伤口处的组织或血液，因此关系并不总是完全互利。"]}
{"word":"Buphonia","summary":{"en":"Buphonia is the name of an ancient Athenian ritual involving the ceremonial killing of an ox and a symbolic process to deal with the act of killing.","zh":"Buphonia（布福尼亚祭仪）指古雅典一种宰牛祭祀的宗教仪式，并通过象征程序来处理对杀牛行为的责任与禁忌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an ancient Athenian religious ritual (festival) in which an ox was ceremonially killed as a sacrifice to Zeus, followed by a symbolic “trial” to shift blame for the killing.","zh":"（古雅典的）布福尼亚祭仪：一种宗教仪式/节庆，仪式中会象征性地宰杀一头公牛祭祀宙斯，随后还会进行“审判”等象征程序，用来转移或分散对杀牛行为的罪责感。"},"examples":[{"en":"In his paper, the historian mentions the Buphonia as an example of Greek sacrificial ritual.","zh":"在论文中，这位历史学家把布福尼亚祭仪当作希腊祭祀仪式的一个例子。"},{"en":"The Buphonia included a symbolic trial after the ox was killed.","zh":"布福尼亚祭仪在宰牛之后还包含一场象征性的“审判”。"}]}],"synonyms":["Bouphonia"],"phonetic":"/bjuˈfoʊniə/","extraExplanation":["词源来自古希腊语：bous（牛）+ phonos（杀戮），字面意思接近“杀牛”。在古雅典，该仪式常与宙斯“城邦守护者”（Zeus Polieus）相关。","它常被学者用来讨论：祭祀中的暴力如何被仪式化、社会如何通过象征步骤（如“审判”、转移责任）来处理杀生与禁忌之间的张力。","拼写上也常见变体 Bouphonia（更贴近希腊语转写），含义相同。"]}
{"word":"buphthalmia","summary":{"en":"Buphthalmia means an abnormally enlarged eyeball, often in infants and sometimes associated with congenital glaucoma.","zh":"Buphthalmia 指眼球异常增大，多见于婴幼儿，有时与先天性青光眼相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abnormal enlargement of the eyeball (often present from birth and sometimes linked to congenital glaucoma)","zh":"眼球异常增大（常为先天性；有时与先天性青光眼有关）"},"examples":[{"en":"The ophthalmologist noted buphthalmia in the infant’s left eye.","zh":"眼科医生发现这名婴儿的左眼有眼球增大（牛眼症）。"},{"en":"In some cases, buphthalmia can be a sign of congenital glaucoma and needs prompt evaluation.","zh":"在某些情况下，眼球增大可能提示先天性青光眼，需要尽快检查评估。"}]}],"synonyms":["enlarged eyeball","ox eye (literal/older term)","hydrophthalmos (related medical term)"],"phonetic":"/ˌbʌfˈθælmiə/","extraExplanation":["词源来自希腊语：bous（牛）+ ophthalmos（眼），字面意思是“牛眼”，因此中文里也常译作“牛眼症”。","这是医学用语，日常对话中更常用的说法是“眼球变大/眼球增大”。在临床语境里，它描述的是体征（外观或测量结果），并不直接等同于某一个具体病因。"]}
{"word":"buphthalmic","summary":{"en":"A medical adjective meaning “having abnormally enlarged, bulging eyes.”","zh":"医学形容词，表示“眼球异常增大、眼睛凸出”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having abnormally large, bulging eyes; relating to an enlarged eyeball (often due to a medical condition).","zh":"（眼球）异常增大、眼睛凸出；与眼球增大有关（常由疾病引起）。"},"examples":[{"en":"The doctor noted buphthalmic changes during the eye exam.","zh":"医生在眼科检查中注意到眼球增大（凸眼）的变化。"},{"en":"In some cases, infants with congenital glaucoma may appear buphthalmic.","zh":"在一些情况下，先天性青光眼的婴儿可能看起来有眼球增大（凸眼）的表现。"}]}],"synonyms":["bulging-eyed","protruding-eyed","exophthalmic"],"phonetic":"/ˌbʌfˈθælmɪk/","extraExplanation":["词源提示：buphthalmic 来自希腊语元素 bous（牛）+ ophthalmos（眼睛），原意类似“牛眼”，用来形容眼球异常变大、看起来很突出。属于医学/眼科学用语，日常英语中很少见，更常见的通俗表达是 “bulging eyes” 或 “protruding eyes”。"]}
{"word":"buphthalmos","summary":{"en":"Buphthalmos is an abnormally enlarged eyeball, most often in children, commonly linked to congenital glaucoma.","zh":"buphthalmos 指眼球异常增大，多见于儿童，常与先天性青光眼相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abnormal enlargement of the eyeball, usually seen in infants or young children, often caused by increased pressure inside the eye (commonly from congenital glaucoma)","zh":"眼球异常增大（多见于婴幼儿或儿童），常与眼内压升高有关（常见原因是先天性青光眼）"},"examples":[{"en":"The pediatric ophthalmologist noted buphthalmos and suspected congenital glaucoma.","zh":"儿科眼科医生发现了眼球增大，怀疑是先天性青光眼。"},{"en":"Early treatment is important because buphthalmos can affect vision development.","zh":"尽早治疗很重要，因为眼球增大可能影响视力发育。"}]}],"synonyms":["enlarged eyeball","ox-eye (medical/older term)"],"phonetic":"/bʌfˈθæl.məs/","extraExplanation":["词源提示：buphthalmos 来自希腊语，bous（牛）+ ophthalmos（眼），字面意思是“牛眼”，用来形容眼球看起来异常大。","使用场景：这是医学/眼科学术语，日常英语中很少用；在普通交流里更可能说 “an enlarged eyeball” 或直接谈 “congenital glaucoma”。","相关概念：在婴幼儿中，眼球组织更有弹性，眼内压升高时更容易被“撑大”，因此 buphthalmos 常提示需要尽快评估眼压与视神经状况。"]}
{"word":"Buphthalmum","summary":{"en":"Buphthalmum is a botanical genus name for yellow, daisy-like flowers, often known as “yellow oxeye.”","zh":"Buphthalmum 是牛眼菊属的植物学属名，指黄菊状花，常被称为“黄牛眼花/黄牛眼菊”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant name: a genus of yellow, daisy-like flowering plants in the aster (daisy) family, especially the garden plant often called “yellow oxeye.”","zh":"植物名：黄菊状花的菊科植物属名（牛眼菊属），常见园艺植物之一常被称为“黄牛眼菊/黄牛眼花”。"},"examples":[{"en":"Buphthalmum produces bright yellow, daisy-like flowers in summer.","zh":"牛眼菊属（Buphthalmum）的植物在夏季会开出明亮的黄色菊状花。"},{"en":"The gardener planted Buphthalmum in a sunny border to attract pollinators.","zh":"园丁把牛眼菊属植物种在向阳的花境里，用来吸引传粉昆虫。"}]}],"synonyms":["oxeye","yellow oxeye"],"phonetic":"/bʌpˈθæləm/","extraExplanation":["词源上常被解释为来自希腊语，意为“牛的眼睛/牛眼”，用来形容花朵圆形、像“眼睛”一样的外观。这也解释了它在英语里常见的俗名 oxeye（牛眼花）。","注意不要与 buphthalmos（眼球异常增大的一种医学术语）混淆：两者拼写相近，但含义不同。"]}
{"word":"buphthalmum","summary":{"en":"Buphthalmum is a botanical name for a daisy-family plant (and historically its herbal material), often connected with the common name “oxeye.”","zh":"Buphthalmum 是菊科植物的属名（历史上也可指其药用干燥材料），常与英文俗名“oxeye（牛眼菊）”相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of yellow-flowered plants in the daisy family (Asteraceae), especially the species known as willow-leaved oxeye.","zh":"一种菊科（Asteraceae）的黄色花植物属，尤指“柳叶牛眼菊”（willow-leaved oxeye）等物种。"},"examples":[{"en":"Buphthalmum salicifolium is sometimes grown in gardens for its bright yellow daisy-like flowers.","zh":"柳叶牛眼菊（Buphthalmum salicifolium）有时会因其明亮的黄色雏菊状花朵而被栽培在花园里。"},{"en":"In older herbal texts, buphthalmum was mentioned as a plant used in traditional remedies.","zh":"在较早的草药文献中，buphthalmum 被提到曾用于传统疗法。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) the dried flower heads or plant material of buphthalmum used in herbal medicine.","zh":"（历史用法）指用于草药治疗的 buphthalmum 干燥花头或植物材料。"},"examples":[{"en":"The apothecary listed buphthalmum among other dried herbs.","zh":"药剂师把 buphthalmum 和其他干燥草药一起列在清单上。"}]}],"synonyms":["willow-leaved oxeye","Buphthalmum salicifolium","oxeye (common name)"],"phonetic":"/bʌfˈθælməm/","extraExplanation":["词源上常被解释为来自希腊语成分：bous（牛）+ ophthalmos（眼睛）。这也解释了英文俗名里常见的“oxeye（牛眼）”，形容花的圆形花盘像眼睛一样。","注意不要和 buphthalmos 混淆：buphthalmos 是医学术语，指“眼球异常增大”。两者词形相近但含义不同。"]}
{"word":"bupleurol","summary":{"en":"Bupleurol is a scientific term for a natural compound associated with the Bupleurum (chai hu) plant.","zh":"Bupleurol 是一个偏科研用语，指与柴胡属（Bupleurum）植物相关的一种天然化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a natural chemical compound found in plants of the genus *Bupleurum* (a medicinal herb); the word is mainly used in scientific or herbal-product contexts, not in everyday English.","zh":"一种存在于柴胡属（*Bupleurum*，常用药草）植物中的天然化合物；该词多见于科研或草本产品语境，日常英语中较少使用。"},"examples":[{"en":"The lab report identified bupleurol in the Bupleurum extract.","zh":"实验报告在柴胡提取物中鉴定出了 bupleurol。"},{"en":"This supplement lists bupleurol as one of the plant-derived ingredients.","zh":"这款补充剂把 bupleurol 列为一种植物来源成分。"}]}],"synonyms":["Bupleurum compound","Bupleurum extract (related context)","chai hu (related herb name)"],"phonetic":"/ˈbjuːpləˌjʊrɔl/","extraExplanation":["“bupleurol”在一般词典里并不常见，更多像是科研论文/成分表中的术语；有时也可能是对“Bupleurum（柴胡）”相关成分的拼写或标注差异。","柴胡在中医语境中常见（如“柴胡/Chai Hu”），但“bupleurol”通常指更具体的化学成分而不是整味药材。若你是在产品标签上看到该词，建议同时核对拉丁学名（*Bupleurum*）与具体含量/来源。"]}
{"word":"Bupleurum","summary":{"en":"Bupleurum is a plant genus; its root is used as an herb, often known as “chai hu.”","zh":"Bupleurum 是柴胡属植物；其根常作草药使用，常称“柴胡”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering plants in the carrot family (Apiaceae), including species whose roots are used in some herbal medicine (especially in traditional Chinese medicine).","zh":"柴胡属（伞形科）的一类开花植物；其中一些种的根在草药疗法中有应用，尤以中医常见。"},"examples":[{"en":"Bupleurum is commonly used in herbal formulas, especially in East Asian traditions.","zh":"Bupleurum（柴胡）常见于草药复方中，尤其在东亚传统里更常用。"},{"en":"In traditional Chinese medicine, bupleurum root is often called “chai hu.”","zh":"在中医里，Bupleurum 的根常被称为“柴胡”。"}]}],"synonyms":["chai hu","bupleurum root","hare’s ear (common name for some species)"],"phonetic":"/ˌbjuːˈplʊrəm/","extraExplanation":["“Bupleurum”是植物学的拉丁学名，多见于药材或学术语境；日常英语里更常说“bupleurum root（柴胡根）”或直接说“chai hu”。","它在英文草药/中医相关内容中出现较多；如果是在食品、孕期、用药并用等情境下，通常需要专业人士指导以避免不适或相互作用。","词源上来自古典语言的植物命名传统（学名常用拉丁化形式），因此拼写看起来不太像常见英语词。"]}
{"word":"bupleurum","summary":{"en":"Bupleurum is a plant genus; in herbal contexts it may also mean the dried root used in traditional remedies.","zh":"Bupleurum 指柴胡属植物；在草药语境中也可能指用于传统疗法的干燥柴胡根。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of plants in the carrot family (Apiaceae), some species of which are used in herbal medicine.","zh":"柴胡属植物（伞形科/芹菜科）的统称；其中一些物种用于草药与传统医药。"},"examples":[{"en":"Bupleurum is sometimes grown as an ornamental plant, and some species are used for herbal preparations.","zh":"柴胡属有时作为观赏植物栽培，其中一些物种也会被用于草药制剂。"},{"en":"In some contexts, “bupleurum” refers to the dried root used in traditional remedies.","zh":"在某些语境中，“bupleurum”也指用于传统疗法的干燥根部药材。"}]}],"synonyms":["thoroughwax","hare’s ear"],"phonetic":"/ˌbjuːˈplʊrəm/","extraExplanation":["“Bupleurum”在中医语境里常对应“柴胡”（常见为北柴胡/南柴胡等来源植物的根），常见于方剂名称与中药材清单中。","英文里它既可指“柴胡属”这一植物分类（genus），也可能在草本/保健品语境里指某些柴胡根部产品；阅读时可根据上下文判断是“植物属”还是“药材”。","草药与补充剂可能与药物相互作用或不适合特定人群；若涉及健康用途，建议咨询专业医疗人员。"]}
{"word":"buplever","summary":{"en":"“buplever” is not a standard English word; it may be a typo (often of “believer”) or a name.","zh":"“buplever”不是标准英语单词；可能是拼写错误（常见是“believer”）或名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a made-up name (for example, a username or brand).","zh":"不是标准英语单词，可能是拼写错误或自造词（例如用户名或品牌名）。"},"examples":[{"en":"I couldn’t find “buplever” in an English dictionary—did you mean “believer”?","zh":"我在英语词典里找不到“buplever”——你是不是想写“believer（信徒/相信者）”？"},{"en":"If “buplever” is a product name, please share a sentence where you saw it.","zh":"如果“buplever”是产品名，请给我你看到它的句子。"}]}],"extraExplanation":["“buplever”在常见英语语料和词典中不存在，所以最有可能是拼写错误。最接近、最常见的目标词通常是：believer（相信者/信徒，/bɪˈliːvər/）。如果你提供上下文（整句、截图、或它出现的网页/游戏/歌曲），我可以更准确判断它实际想表达的词。"]}
{"word":"buprestid","summary":{"en":"A buprestid is a jewel beetle (family Buprestidae), often metallic-looking and sometimes harmful to trees.","zh":"buprestid 指吉丁虫科的“宝石甲虫”，常呈金属光泽，部分种类会危害树木。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of beetle in the family Buprestidae, often called a “jewel beetle,” usually with a shiny, metallic-colored body; many species live in or feed on wood and can harm trees","zh":"一种甲虫，属吉丁虫科（Buprestidae），常被称为“宝石甲虫/彩虹甲虫”，体表常呈金属光泽；许多种类与木材或树木有关，部分会危害树木"},"examples":[{"en":"The buprestid beetle’s metallic green wings shimmered in the sun.","zh":"那只吉丁虫的金属绿色翅鞘在阳光下闪闪发亮。"},{"en":"Some buprestids lay eggs under bark, and the larvae can damage the tree.","zh":"一些吉丁虫会在树皮下产卵，幼虫可能会破坏树木。"}]}],"synonyms":["jewel beetle","Buprestidae beetle"],"phonetic":"/bjuˈprɛstɪd/","extraExplanation":["“buprestid”来自昆虫学分类名 Buprestidae（吉丁虫科）。日常英语里更常见的说法是 “jewel beetle（宝石甲虫）”。","在北美语境中，人们有时会在谈论入侵害虫时提到某些吉丁虫（例如 emerald ash borer，白蜡树吉丁虫），它会严重危害白蜡树。"]}
{"word":"Buprestidae","summary":{"en":"Buprestidae = the beetle family of jewel beetles, many of which have metallic colors and wood-boring larvae.","zh":"Buprestidae 指“吉丁虫科/宝石甲虫科”，许多种类具金属光泽，幼虫常蛀食木材。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of beetles known as jewel beetles (metallic wood-boring beetles), often with shiny, iridescent bodies; many species’ larvae bore into wood.","zh":"鞘翅目中的一个科，称为吉丁虫科（宝石甲虫、金属木蠹甲虫）；成虫常具金属光泽，许多种类的幼虫会蛀食木材。"},"examples":[{"en":"The researcher identified the insect as a member of the Buprestidae.","zh":"研究人员确认这种昆虫属于吉丁虫科（Buprestidae）。"},{"en":"Some Buprestidae larvae tunnel under tree bark and can damage forests.","zh":"一些吉丁虫科的幼虫会在树皮下蛀道，可能危害森林。"},{"en":"Collectors admire Buprestidae for their bright, jewel-like colors.","zh":"收藏者很欣赏吉丁虫科甲虫那种宝石般明亮的色彩。"}]}],"synonyms":["jewel beetles","metallic wood-boring beetles","buprestids"],"phonetic":"/bjuːˈprɛstɪdiː/","extraExplanation":["“Buprestidae”是生物分类学名称，通常在学术写作中首字母大写、斜体可用于属名但科名一般不必斜体。它常被通俗地称为“jewel beetles（宝石甲虫）”或“metallic wood-boring beetles（金属木蠹甲虫）”。","词源上，科名来自模式属 *Buprestis*。古希腊语中该词与“牛（bous）”相关的民间说法有关，古人曾认为某些甲虫可能导致牲畜腹胀等症状；现代用法主要是分类学命名，并不表示真实医学作用。"]}
{"word":"buprestidae","summary":{"en":"Buprestidae: the beetle family known as jewel beetles, many with metallic colors and wood-boring larvae.","zh":"Buprestidae：吉丁虫科（珠宝甲虫），多具金属光泽，幼虫常蛀木。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of beetles commonly called jewel beetles (or metallic wood-boring beetles), often shiny and brightly colored; many species’ larvae bore into wood and can damage trees.","zh":"吉丁虫科（也叫“珠宝甲虫/金属木蠹甲虫”）的一类甲虫家族，常有金属光泽、色彩鲜艳；许多种类的幼虫会蛀食木材，可能危害树木。"},"examples":[{"en":"The emerald ash borer is a famous member of the family Buprestidae.","zh":"白蜡窄吉丁（绿灰蛀虫）是吉丁虫科（Buprestidae）中很有名的一种。"},{"en":"Some Buprestidae larvae tunnel under tree bark and can weaken the trunk.","zh":"一些吉丁虫科的幼虫会在树皮下钻蛀，可能削弱树干。"},{"en":"The museum displayed Buprestidae specimens because of their jewel-like colors.","zh":"博物馆展示了吉丁虫科标本，因为它们的色彩像宝石一样。"}]}],"synonyms":["jewel beetles","metallic wood-boring beetles"],"phonetic":"/bjuːˈprɛstɪdi/","extraExplanation":["“Buprestidae”是昆虫分类学里的“科”名（family），通常首字母大写并用斜体写（Buprestidae），但在一般英文文章里也常见非斜体写法。","常见英文俗名包括“jewel beetles（珠宝甲虫）”和“metallic wood-boring beetles（金属木蠹甲虫）”。如果你在阅读园艺、林业或入侵物种资料，这两个俗名很常出现。","词源上，“Buprestis”（该科名的来源属名）来自古希腊语中对一种甲虫的称呼，古人曾认为它会让牛肿胀（带有传说/误解色彩）；现代用法主要是科学分类名称。"]}
{"word":"buprestidan","summary":{"en":"A buprestidan is a jewel beetle (family Buprestidae), or something related to that family.","zh":"buprestidan 指金龟甲科（吉丁虫科）的甲虫（宝石甲虫），也可作形容词表示“与该科有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a beetle of the family Buprestidae, often called a “jewel beetle,” usually with a hard shell that looks shiny or metallic in color","zh":"金龟甲科（吉丁虫科）昆虫；常称“宝石甲虫/吉丁虫”，外壳坚硬，常呈金属光泽"},"examples":[{"en":"We found a bright green buprestidan on the old oak tree.","zh":"我们在那棵老橡树上发现了一只亮绿色的吉丁虫。"},{"en":"Some buprestidans can damage trees because their larvae live under the bark.","zh":"有些吉丁虫会危害树木，因为它们的幼虫生活在树皮下面。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the beetle family Buprestidae","zh":"与金龟甲科（吉丁虫科）有关的"},"examples":[{"en":"The museum has a buprestidan collection with many metallic specimens.","zh":"博物馆收藏了一批吉丁虫标本，其中很多都带有金属光泽。"}]}],"synonyms":["jewel beetle","buprestid","buprestid beetle"],"phonetic":"/bjuːˈprɛstɪdən/","extraExplanation":["“buprestidan”来自昆虫分类学用语：Buprestidae（吉丁虫科）/ Buprestis（吉丁虫属）。在日常英语里更常见的说法是“jewel beetle（宝石甲虫）”或“buprestid beetle”。"]}
{"word":"buprestids","summary":{"en":"“Buprestids” means jewel beetles (the beetle family Buprestidae), often metallic-looking and sometimes harmful to trees as larvae bore into wood.","zh":"“Buprestids”指吉丁虫（宝石甲虫，吉丁虫科），常有金属光泽；其幼虫常蛀木，可能危害树木。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Jewel beetles: a group (family) of beetles known for their shiny, metallic-looking bodies; many species’ larvae bore into wood or plant stems.","zh":"吉丁虫（又称宝石甲虫）：一类以金属光泽外壳著称的甲虫（一个“科”）；许多种类的幼虫会蛀食木材或植物茎干。"},"examples":[{"en":"Buprestids are often called jewel beetles because their wing covers can shine green, blue, or copper.","zh":"Buprestids 常被叫作“宝石甲虫”，因为它们的翅鞘可能闪着绿色、蓝色或铜色光泽。"},{"en":"Some buprestids damage trees when the larvae tunnel under the bark.","zh":"有些 buprestids 的幼虫会在树皮下钻蛀，从而危害树木。"}]}],"synonyms":["jewel beetles","Buprestidae (family name)"],"phonetic":"/bjuˈprɛstɪdz/","extraExplanation":["“Buprestids”是复数用法，单数为“buprestid”（指一只吉丁虫/一种吉丁虫）。在自然科普或园艺、林业语境里更常见。","它来自甲虫科名“Buprestidae”（吉丁虫科）。常见相关词：jewel beetle（宝石甲虫）、wood-boring beetle（蛀木甲虫）、larva/larvae（幼虫/复数）。"]}
{"word":"Buprestis","summary":{"en":"Buprestis is a scientific genus name for certain jewel beetles (metallic wood-boring beetles).","zh":"Buprestis 指吉丁虫属的学名，即一类常见的“宝石甲虫/金属木蠹甲虫”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of metallic, often brightly colored beetles (family Buprestidae), commonly called jewel beetles or metallic wood-boring beetles.","zh":"吉丁虫属（吉丁虫科的一属），多呈金属光泽、色彩鲜艳，常被称为“宝石甲虫/金属木蠹甲虫”。"},"examples":[{"en":"Researchers collected several Buprestis beetles from pine logs to study wood-boring damage.","zh":"研究人员从松木原木中采集了几只吉丁虫属甲虫，以研究蛀木危害。"},{"en":"The museum display highlights the shiny colors of Buprestis species.","zh":"博物馆展柜重点展示了吉丁虫属物种的闪亮金属色。"}]}],"synonyms":["jewel beetle","metallic wood-boring beetle","buprestid beetle"],"phonetic":"/bjuːˈprɛstɪs/","extraExplanation":["“Buprestis”是拉丁化的学名（属名），在生物学里属名首字母大写并斜体书写（*Buprestis*）。作为普通文本输入时，有时也会不严格使用斜体。","该词源自古希腊语中与“牛肿胀”相关的说法：古人曾认为某些甲虫被牛误食后会导致腹胀（古罗马博物学家老普林尼等文献中有类似记载）。现代昆虫学则把它固定为一类甲虫的学名。","这一类甲虫的幼虫常在木材中蛀食，因此英语里也常见相关描述，如“wood-boring beetles（蛀木甲虫）”“jewel beetles（宝石甲虫）”。"]}
{"word":"buprestis","summary":{"en":"Buprestis is a scientific name for a genus of metallic jewel beetles, many of which bore into wood.","zh":"Buprestis 是吉丁虫属的学名，指一类常具金属光泽、常蛀木的甲虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of jewel beetles (family Buprestidae), often metallic-looking and wood-boring; some species are pests of trees.","zh":"吉丁虫属（吉丁虫科）的甲虫，常呈金属光泽，多为蛀木性；部分种类会危害树木。"},"examples":[{"en":"The entomologist identified the shiny beetle as a Buprestis species.","zh":"昆虫学家把这只闪亮的甲虫鉴定为吉丁虫属的一种。"},{"en":"Larvae of some Buprestis beetles bore into dead or stressed wood.","zh":"某些吉丁虫属甲虫的幼虫会钻蛀枯死或受压的木材。"}]}],"synonyms":["jewel beetle","metallic wood-boring beetle","Buprestid beetle"],"phonetic":"/bjuːˈprɛstɪs/","extraExplanation":["“Buprestis”来自古希腊语（常见作 bouprestis），字面与“牛（bous）”和“肿胀/胀气（prestes）”有关：古人误以为某种甲虫被牛吞食后会使牛腹胀致死。后来该名称被用于一类金属光泽的甲虫（吉丁虫）。","在自然写作或科普语境里，你也会看到更常用的俗名：jewel beetle（“宝石甲虫/吉丁虫”）或 metallic wood-boring beetle（“金属蛀木甲虫”）。"]}

