{"word":"Buxaceae","summary":{"en":"Buxaceae is the botanical family of boxwood and related evergreen shrubs/trees.","zh":"Buxaceae 指黄杨科：包括黄杨（箱木）及其近缘的常绿灌木或小乔木。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant family (the box family) that includes boxwood (Buxus) and a few related shrubs or small trees, often grown as evergreen ornamental plants","zh":"黄杨科（盒树科）：包括黄杨属（Buxus，常见“黄杨/箱木”）及其近缘的一些灌木或小乔木，常作为常绿观赏植物栽培"},"examples":[{"en":"Boxwood shrubs belong to the plant family Buxaceae.","zh":"黄杨（箱木）灌木属于黄杨科（Buxaceae）。"},{"en":"Many formal hedges in gardens are made from Buxaceae species.","zh":"花园里很多规整的绿篱是用黄杨科植物做的。"}]}],"synonyms":["the box family","boxwood family"],"phonetic":"/bʌkˈseɪsi.iː/","extraExplanation":["“Buxaceae”是拉丁化的植物分类名称，常见于植物百科、园艺书和学术文章中；日常英语里更常说“boxwood”（箱木/黄杨）或“the box family”（黄杨科）。","词源上与拉丁语“buxus”（黄杨属/箱木）有关，因此拼写里的“x”与发音中的/k s/对应。"]}
{"word":"buxaceae","summary":{"en":"Buxaceae is the plant family that includes boxwood (Buxus).","zh":"Buxaceae 指黄杨科，即包括黄杨属（箱木/黄杨）的植物科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of evergreen shrubs and small trees, including boxwood (genus Buxus).","zh":"黄杨科；一类常绿灌木或小乔木的植物科，包括黄杨属（Buxus，常见的黄杨/箱木）。"},"examples":[{"en":"Boxwood belongs to the plant family Buxaceae.","zh":"黄杨（箱木）属于黄杨科（Buxaceae）。"},{"en":"Many garden hedges are made from Buxaceae species because they stay green year-round.","zh":"许多花园绿篱会用黄杨科植物，因为它们四季常绿。"}]}],"synonyms":["box family"],"phonetic":"/bʌkˈseɪsiː/","extraExplanation":["“Buxaceae”是植物分类学里的“科名”，常见于植物学、园艺和学术写作中；日常英语里更常说“boxwood（黄杨/箱木）”。","词源上来自拉丁化的属名“Buxus（黄杨属）”，后缀“-aceae”表示“某某科”（如 Rosaceae 蔷薇科、Fabaceae 豆科）。"]}
{"word":"Buxaceae-related","summary":{"en":"related to the Buxaceae (boxwood) plant family","zh":"与黄杨科（箱木/黄杨属）植物有关的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with the plant family Buxaceae (the boxwood family), or involving plants in this family.","zh":"与黄杨科（Buxaceae，黄杨属等植物的科）有关的；涉及黄杨科植物的。"},"examples":[{"en":"The study focuses on Buxaceae-related diseases affecting boxwood shrubs.","zh":"这项研究聚焦于影响黄杨灌木的黄杨科相关病害。"},{"en":"Gardeners often look for Buxaceae-related care tips when growing boxwood hedges.","zh":"种植黄杨绿篱时，园丁常会查找黄杨科相关的养护建议。"}]}],"synonyms":["boxwood-related","Buxus-related","Buxaceae-associated"],"phonetic":"/bʌkˈseɪsiː rɪˈleɪtɪd/","extraExplanation":["“Buxaceae”是植物分类学中的科名，常见成员包括黄杨（boxwood，Buxus）。在园艺与植物学写作中，人们会用“Buxaceae-related”来表示“与黄杨科有关的”，多见于学术论文、病虫害说明、园林植物管理等语境。"]}
{"word":"buxaceous","summary":{"en":"Buxaceous means “related to boxwood (the Buxaceae family).”","zh":"buxaceous 指“与黄杨（黄杨科 Buxaceae）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the boxwood family (Buxaceae) or having characteristics of boxwood plants.","zh":"与黄杨科（Buxaceae，黄杨科植物）有关的；具有黄杨类植物特征的。"},"examples":[{"en":"The garden’s design uses several buxaceous shrubs as low hedges.","zh":"这个花园的设计用了一些黄杨科灌木作为低矮的绿篱。"},{"en":"In the herbarium, the specimen was labeled as a buxaceous species.","zh":"在植物标本馆里，这份标本被标注为黄杨科的一种。"}]}],"synonyms":["boxwood","Buxaceae-related","buxus-related"],"phonetic":"/bʌkˈseɪʃəs/","extraExplanation":["“buxaceous”是一个植物学用语，来源于拉丁语“buxus”（黄杨、黄杨属），常见于植物分类学、园艺与学术写作中，日常口语里很少用。"]}
{"word":"Buxbaumia","summary":{"en":"Buxbaumia is a genus of mosses, notable for a tiny plant body and a relatively large spore capsule.","zh":"Buxbaumia 是一种藓类植物属，以植株本体很小但孢蒴较大、明显而著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of mosses known for having a very small, hard-to-see leafy plant body and a relatively large, noticeable spore capsule (often called “bug moss”)","zh":"一种藓类植物属（常被称为“虫藓/虫形藓”），特点是植株本体很小、不显眼，但孢蒴相对较大、容易被看到"},"examples":[{"en":"Buxbaumia is unusual because you often notice the capsule more than the plant itself.","zh":"Buxbaumia 的特殊之处在于，人们往往先看到孢蒴，而不是植株本体。"},{"en":"Some Buxbaumia species grow on decaying wood or disturbed soil in cool forests.","zh":"一些 Buxbaumia 的物种生长在凉爽森林中的腐木或受扰动的土壤上。"}]}],"synonyms":["bug moss (common name)"],"phonetic":"/bʌksˈbɔːmiə/","extraExplanation":["Buxbaumia 是拉丁学名（属名），常见于植物学/生态学语境；在日常英语里并不常用。","该属名源于人名（纪念德国植物学家 Johann Christian Buxbaum），因此首字母通常大写，写作斜体：Buxbaumia。"]}
{"word":"buxbaumia","summary":{"en":"Buxbaumia is a genus of mosses known for being tiny but having noticeable spore capsules.","zh":"Buxbaumia（布克斯鲍米藓属）是一个苔藓属，特点是植株很小，但孢蒴相对显眼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tiny mosses that often have a very small plant body but a relatively large spore capsule; some species are rare and grow on decaying wood or disturbed soil","zh":"【植物】布克斯鲍米藓属：一类体形很小、但孢蒴（产生孢子的“蒴”）相对明显的苔藓；部分物种较稀有，常生于腐木或受扰动的土壤上"},"examples":[{"en":"The researchers recorded a population of Buxbaumia on rotting logs after the storm.","zh":"研究人员在暴风雨后，在腐烂的原木上记录到一处布克斯鲍米藓属（Buxbaumia）的种群。"},{"en":"Because Buxbaumia can be hard to spot, surveys often focus on finding its spore capsules.","zh":"由于布克斯鲍米藓属（Buxbaumia）很难被发现，野外调查常把重点放在寻找它的孢蒴上。"}]}],"synonyms":["(no common synonyms; a scientific genus name)"],"phonetic":"ˌbʌksˈbɔmiə","extraExplanation":["“Buxbaumia”是拉丁化的属名，常见于生物学与生态学文章中；有时也会以物种名出现，如 *Buxbaumia aphylla*（无叶布克斯鲍米藓，意为“无叶的”）。","该属名来源于人名（Buxbaum），属于以科学家命名的分类学传统；在自然观察语境中，你可能更多会看到它被称为“moss（苔藓）”或直接用属名来指代。"]}
{"word":"Buxbaumiaceae","summary":{"en":"Buxbaumiaceae: the bug-moss family, a scientific name for a group of mosses.","zh":"Buxbaumiaceae：虫藓科/布克斯鲍氏藓科，苔藓植物的一个科名（科学分类名称）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant family (in moss taxonomy) known as the bug-moss family, including the genus Buxbaumia and related mosses.","zh":"（苔藓植物分类中的）布克斯鲍氏藓科／虫藓科：一个苔藓植物科，包含布克斯鲍藓属（Buxbaumia）等近缘苔藓。"},"examples":[{"en":"Buxbaumiaceae is a small family of mosses found in forest habitats.","zh":"Buxbaumiaceae 是一个较小的苔藓科，常见于森林生境。"},{"en":"In this study, we recorded several Buxbaumiaceae species on decaying logs.","zh":"在这项研究中，我们在腐木上记录到几种 Buxbaumiaceae 的物种。"}]}],"synonyms":["bug-moss family","Buxbaumia family (informal)"],"phonetic":"/ˌbʌksˌbɔːmiˈeɪsiːaɪ/","extraExplanation":["这是植物学里的“科名”（family name），常见于学术写作、植物志、自然观察记录中；日常英语里不常用。","科名通常以 -aceae 结尾（表示“……科”）。Buxbaumiaceae 这个名称来自代表属 Buxbaumia（布克斯鲍藓属），属名源于人名（Buxbaum）。","有时也会见到通俗名 bug-moss family（虫藓科/虫藓类群），用来帮助非专业读者理解。"]}
{"word":"buxbaumiaceae","summary":{"en":"Buxbaumiaceae: the moss family that includes Buxbaumia (bug moss).","zh":"Buxbaumiaceae：包含布克斯鲍米属（虫苔/虫藓）的苔藓植物科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of mosses that includes the genus Buxbaumia (often called “bug moss”), known for having very small plants but relatively large, noticeable spore capsules.","zh":"一种苔藓植物科（布克斯鲍米科），包含布克斯鲍米属（常被称为“虫苔/虫藓”）；其植株很小，但孢蒴（产生孢子的“蒴”）相对明显。"},"examples":[{"en":"Buxbaumiaceae is a small moss family found in cool, moist forests.","zh":"布克斯鲍米科是一类较小的苔藓科，常见于凉爽潮湿的森林中。"},{"en":"In this habitat survey, we recorded Buxbaumiaceae on decaying wood.","zh":"在这次生境调查中，我们在腐木上记录到了布克斯鲍米科的苔藓。"}]}],"synonyms":["the Buxbaumia family"],"phonetic":"/ˌbʌksˌbɔmiˈeɪsiˌi/","extraExplanation":["“Buxbaumiaceae”是植物分类学中的正式拉丁学名，常用于学术论文、野外调查记录和标本标签中；日常英语里一般不会用到。","词源来自属名“Buxbaumia”（纪念德国植物学家 Johann Christian Buxbaum），后缀“-aceae”表示“某某科”，是植物科名的常见构词方式。"]}
{"word":"buxeous","summary":{"en":"Buxeous is a rare adjective meaning “related to or resembling boxwood (Buxus).”","zh":"buxeous 是一个较罕见的形容词，意思是“与黄杨（boxwood/ Buxus）有关的或像黄杨的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Relating to, made from, or resembling boxwood (the plant genus *Buxus*).","zh":"（罕用）与黄杨（*Buxus* 属）有关的；由黄杨制成的；像黄杨的。"},"examples":[{"en":"The garden path was bordered with buxeous hedges trimmed into neat squares.","zh":"花园小径两旁是修剪成整齐方块的黄杨树篱。"},{"en":"Some traditional woodcuts used buxeous blocks because the wood is fine-grained.","zh":"一些传统木刻会用黄杨木雕版，因为这种木材纹理细密。"}]}],"synonyms":["boxwood","buxaceous"],"phonetic":"/ˈbʌk.si.əs/","extraExplanation":["“buxeous”在现代英语里非常少见，更常见的对应词是“buxaceous”（同样指“黄杨科/黄杨属相关的”）或直接说“boxwood”。","词源与拉丁语“buxus”（黄杨）有关；在园艺与植物学语境中更容易看到。"]}
{"word":"buxerries","summary":{"en":"“Buxerries” isn’t a standard English word; it’s likely a misspelling of “blueberries.”","zh":"“buxerries”不是标准英语词；很可能是“blueberries（蓝莓）”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “blueberries” (a small, sweet blue fruit).","zh":"不是标准英语单词。很可能是把“blueberries（蓝莓）”拼错了（指一种小而甜的蓝色水果）。"},"examples":[{"en":"Did you mean “blueberries”?","zh":"你是不是想写“blueberries（蓝莓）”？"},{"en":"I bought blueberries to make muffins.","zh":"我买了蓝莓来做松饼。"}]},{"partOfSpeech":"n.","definition":{"en":"(If you meant “blueberries”) a small, round, blue-purple berry often eaten fresh or used in desserts.","zh":"（如果你想写“blueberries”）蓝莓：一种小而圆、蓝紫色的浆果，常鲜食或用于甜点。"},"examples":[{"en":"Blueberries are great in yogurt.","zh":"蓝莓配酸奶很好吃。"},{"en":"She picked blueberries in the summer.","zh":"她在夏天去采蓝莓。"},{"en":"This pie is filled with blueberries.","zh":"这个派里装满了蓝莓。"}]}],"synonyms":["blueberries","berries"],"phonetic":"/ˈbluˌbɛriz/","extraExplanation":["“buxerries”在常见词典与语料里通常找不到；更像是键入错误或听写错误。最接近、也最常见的目标词是“blueberries”（b-l-u-e-b-e-r-r-i-e-s）。如果你原本想表达别的词（比如某个专有名词/品牌/方言词），告诉我上下文句子，我可以帮你准确判断。"]}
{"word":"buxerry","summary":{"en":"“buxerry” is not a standard English word; it most likely refers to the brand name Burberry.","zh":"“buxerry”不是标准英文词；最可能指品牌名 Burberry。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely a misspelling of) Burberry: a British luxury fashion brand, famous for trench coats and its classic checked pattern.","zh":"（很可能是拼写错误）Burberry：英国奢侈时尚品牌，以风衣和经典格纹最出名。"},"examples":[{"en":"She bought a Burberry trench coat for work.","zh":"她买了一件 Burberry 风衣上班穿。"},{"en":"You can recognize Burberry by its classic check pattern.","zh":"你可以通过它的经典格纹认出 Burberry。"}]}],"synonyms":["(no true synonyms; it is a brand name)"],"phonetic":"ˈbɝːbɛri","extraExplanation":["“buxerry”不是常见英文单词；最接近、最常见的可能是专有名词“Burberry”。如果你想查的是别的词，也可能是你想写“boxberry / buckberry”等植物名，但这些都不如“Burberry”常见。","Burberry 与“trench coat（风衣）”在英美文化里关联很强：它最初与防风雨的外套设计有关，后来成为经典时尚单品。"]}
{"word":"buxine","summary":{"en":"Buxine is a rare chemistry term for a bitter/alkaloid-like substance associated with boxwood (Buxus).","zh":"Buxine 是一个少见的化学术语，指与黄杨属（boxwood，Buxus）相关的一种苦味/类生物碱物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A chemical substance (historically described as an alkaloid or bitter principle) obtained from boxwood (the plant genus Buxus).","zh":"一种从黄杨属植物（boxwood，Buxus）中提取的化学物质（历史上常被描述为生物碱或苦味成分）。"},"examples":[{"en":"Early chemistry texts mentioned buxine as a bitter compound found in boxwood.","zh":"早期化学教材提到，buxine 是黄杨木中发现的一种苦味化合物。"},{"en":"The paper discussed several plant alkaloids, including buxine from Buxus species.","zh":"这篇论文讨论了多种植物生物碱，其中包括来自黄杨属（Buxus）的 buxine。"}]}],"synonyms":["boxwood alkaloid","Buxus alkaloid","bitter principle (in older texts)"],"phonetic":"/ˈbʌk.siːn/","extraExplanation":["buxine 是一个非常少见、偏历史性的术语，常出现在旧的药学/植物化学资料里。不同资料对它的化学性质与成分归类可能不完全一致；现代文献更常直接描述具体的黄杨属生物碱名称，而不一定使用 buxine 这个总称。","词源上来自拉丁化的植物属名 Buxus（黄杨属/boxwood），后缀 -ine 常用于化学物质命名（尤其是早期对生物碱等物质的命名）。"]}
{"word":"buxom","summary":{"en":"Buxom usually means a woman is full-bodied/curvy, often implying a large bust; it can also be an older word for plump and healthy-looking.","zh":"buxom 通常指女性身材丰腴、曲线饱满（常暗示胸部丰满）；旧式用法也可指圆润健康的外形。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a woman) having a full, curvy body, especially a large bust; sometimes used to suggest a cheerful, healthy look.","zh":"（常指女性）体态丰腴、曲线饱满，尤其指胸部丰满；有时也带有“健康、开朗”的感觉。"},"examples":[{"en":"The novel describes a buxom barmaid with a loud laugh and a friendly smile.","zh":"小说描写了一位胸部丰满的酒吧女侍，笑声爽朗、很友好。"},{"en":"The advertisement was criticized for using a buxom model to attract attention.","zh":"那则广告因用身材丰满的模特来博眼球而受到批评。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Old-fashioned) plump and healthy-looking; well-rounded in shape.","zh":"（较旧式用法）圆润、结实、看起来健康的；体态饱满的。"},"examples":[{"en":"In older stories, “buxom” could simply mean a healthy, well-fed appearance.","zh":"在较早的故事里，buxom 有时只是指看起来健康、吃得好的样子。"},{"en":"The painting shows a buxom figure in warm colors.","zh":"这幅画用暖色描绘了一个体态圆润的人物形象。"}]}],"synonyms":["curvy","full-figured","voluptuous","plump","busty"],"phonetic":"/ˈbʌksəm/","extraExplanation":["“buxom”现在最常见的含义和女性身材（尤其是胸部）有关，带有明显的性化色彩；在正式写作或不熟悉的场合使用可能显得冒犯或不礼貌。更中性的替代表达：“curvy（曲线优美的）”“full-figured（体态丰满的）”“well-built（身材结实的）”。","词源上它早期更接近“活泼、顺从/和善”的意思，后来才逐渐转向“体态丰腴”。因此在阅读老作品时，含义可能更偏“健康、圆润”而不一定强调胸部。"]}
{"word":"buxomer","summary":{"en":"“Buxomer” is not a standard English word; it’s likely a misspelling (often of “buxom” or “boxer”) or a proper name.","zh":"“buxomer”不是标准英语词；多半是拼写错误（常见可能是“buxom”或“boxer”）或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a name/brand.","zh":"不是标准英语单词；更可能是拼写错误，或是人名/品牌名。"},"examples":[{"en":"I can’t find “buxomer” in major English dictionaries—did you mean “buxom” or “boxer”?","zh":"在主要英语词典里查不到“buxomer”——你是不是想写“buxom”或“boxer”？"}]}],"phonetic":"/ˈbʌksəmər/","extraExplanation":["“buxomer”在常见英语语料与主流词典中没有固定词条。如果你告诉我它出现的句子/上下文（例如一整句话或截图），我可以更准确判断它指的是什么。","最可能的近似词：\n1) buxom /ˈbʌksəm/（adj.）常指“（女子）身材丰满的；健壮的；（脸色）红润的”。\n2) boxer /ˈbɑksər/（n.）“拳击手；拳师；（Boxer）拳师犬”。\n3) “-er”常见于构成“做某事的人/物”的后缀（如 teacher, runner）。如果你看到的是“buxom + -er”，那更像是非正式/创意用法，而不是标准词。"]}
{"word":"buxomest","summary":{"en":"“Buxomest” means “the most buxom,” usually describing a very full, curvy (often large-busted) figure; an older meaning is “the most cheerful and healthy-looking.”","zh":"“buxomest”意为“最buxom的/最丰满的”，现代多指（女性）最丰腴、曲线最明显（常暗指胸部丰满）；较旧用法可指“最开朗、最健康有精神的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative form of “buxom”: (of a woman) having a full, curvy figure, especially a large bust.","zh":"“buxom”的最高级：形容（女性）身材丰腴、曲线明显，尤其指胸部丰满。"},"examples":[{"en":"In the old movie, the buxomest character is styled with a fitted dress and bold jewelry.","zh":"在那部老电影里，身材最丰腴的角色穿着修身连衣裙，配着夸张的首饰。"},{"en":"The romance novel describes her as the buxomest barmaid in the tavern.","zh":"那本言情小说把她描写成酒馆里最丰满的女招待。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common, older use) Superlative form of “buxom”: cheerful, lively, and healthy-looking.","zh":"（较少见、较旧用法）“buxom”的最高级：开朗活泼、看起来健康有精神。"},"examples":[{"en":"In older writing, the buxomest villagers are portrayed as laughing easily and working hard.","zh":"在较早的作品中，最开朗健壮的村民被写成爱笑、也很勤快。"}]}],"synonyms":["the most buxom","curviest","fullest-figured","bustiest","most voluptuous"],"phonetic":"ˈbʌksəmɪst","extraExplanation":["“buxom”早期更偏“精神好、活泼健壮”的意思；现代英语里更常用来强调女性“丰满（尤其胸部）”。因此在当代语境中可能带有外貌评价甚至物化的感觉，用在现实生活中要注意礼貌与尊重。","“buxomest”多见于文学、戏仿、或夸张描写；日常口语里更常说“the most buxom”。"]}
{"word":"buxomly","summary":{"en":"Buxomly means “in a buxom way,” usually describing a full, curvy body shape; less commonly, it means “cheerfully.”","zh":"buxomly 指“以丰腴、曲线明显的方式（多用于外貌描写）”；较少见时也可指“愉快地、活泼地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a buxom way—having a full, curvy, pleasantly plump body shape (often used about women).","zh":"以“丰满、曲线明显（常指女性）”的方式；丰腴地。"},"examples":[{"en":"She laughed buxomly, her bright dress drawing attention in the crowd.","zh":"她丰腴地笑着，鲜艳的裙子在人群中格外显眼。"},{"en":"The character is described as walking buxomly across the room.","zh":"人物被描写为丰腴地走过房间。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Less common) In a cheerful, lively, good-humored way.","zh":"（较少见）以愉快、活泼、好脾气的方式。"},"examples":[{"en":"He greeted the guests buxomly, making everyone feel welcome.","zh":"他愉快地招呼客人，让每个人都感到受欢迎。"}]}],"synonyms":["curvily","voluptuously","plumply","cheerfully (less common)"],"phonetic":"/ˈbʌksəmli/","extraExplanation":["“buxom”一词早期更偏向“精神饱满、开朗、顺从（docile）”等含义，后来在近代英语里逐渐更常指“体态丰满、胸部/曲线明显”。因此“buxomly”在现代语境下多与外貌描写相关，带有一定性别化与审美色彩；在正式或需要避免物化的语境中，可用更中性的表达如“curvily / with a curvy figure / in a full-figured way”。"]}
{"word":"buxomness","summary":{"en":"Buxomness means the quality of being attractively full-bodied (often busty); in older use it can mean healthy, cheerful plumpness, and very rarely “obedience.”","zh":"buxomness 指“（常指女性）丰满性感”的特质；较老派可指“健康开朗的丰润感”；极少数旧义为“顺从”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being curvy and full-bodied in an attractive way (often implying a woman has a large bust); “voluptuousness.”","zh":"（常指女性）丰满、曲线感强并被认为有吸引力的特质；常含“胸部丰满”的暗示；“性感丰腴”。"},"examples":[{"en":"The novel describes the heroine’s buxomness in a way that fits the era’s beauty ideals.","zh":"小说以符合当时审美的方式描写女主的丰满性感。"},{"en":"Some ads used buxomness to sell products, which many people now see as objectifying.","zh":"一些广告曾用“丰满性感”来推销产品，但如今不少人认为这物化了女性。"}]},{"partOfSpeech":"n.","definition":{"en":"the quality of looking healthy, cheerful, and pleasantly plump (a more old-fashioned sense).","zh":"（较老派用法）健康、开朗、略微丰腴的气质或外貌特征。"},"examples":[{"en":"Her face had a country freshness and buxomness.","zh":"她的脸带着乡村般清新健康的丰润感。"},{"en":"In older writing, buxomness could suggest warmth and high spirits, not just body shape.","zh":"在较早的写作里，buxomness 可能强调热情与活力，不只是身材。"}]},{"partOfSpeech":"n.","definition":{"en":"the quality of being obedient or compliant (rare/obsolete).","zh":"（罕见/过时）顺从、听话的特质。"},"examples":[{"en":"In Middle English, buxomness once referred to obedience to authority.","zh":"在中古英语中，buxomness 曾指对权威的顺从。"}]}],"synonyms":["voluptuousness","curviness","full-figuredness","plumpness","buoyancy (older nuance)"],"phonetic":"/ˈbʌksəmnəs/","extraExplanation":["这个词在现代英语里常带有“以男性凝视评价女性身材”的语感，容易显得物化或冒犯，尤其在正式场合或描述现实人物时要谨慎。若想更中性，可以用 curvy（曲线型）、full-figured（丰满型）、voluptuous（性感丰腴但仍偏主观）或 simply “healthy-looking”（看起来很健康）。"]}
{"word":"Buxtehude","summary":{"en":"Buxtehude usually refers to the Baroque composer and organist, but it can also mean a town in northern Germany.","zh":"“Buxtehude”通常指巴洛克时期的作曲家与管风琴家，也可指德国北部的一座城镇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Danish-German Baroque composer and organist (c. 1637–1707), famous for organ works and sacred vocal music; an important influence on J. S. Bach.","zh":"布克斯特胡德（约1637–1707），丹麦裔德籍巴洛克时期作曲家与管风琴家，以管风琴作品与宗教声乐作品著名，对巴赫影响很大。"},"examples":[{"en":"Buxtehude’s organ preludes helped shape the North German Baroque style.","zh":"布克斯特胡德的管风琴前奏曲推动了北德巴洛克风格的发展。"},{"en":"Many musicians study Buxtehude to understand what influenced Bach’s early music.","zh":"许多音乐学习者研究布克斯特胡德，以了解影响巴赫早期音乐的因素。"}]},{"partOfSpeech":"n.","definition":{"en":"A town in Lower Saxony, northern Germany, near Hamburg.","zh":"布克斯特胡德：德国北部下萨克森州的一座城镇，靠近汉堡。"},"examples":[{"en":"Buxtehude is a small town not far from Hamburg.","zh":"布克斯特胡德是一座离汉堡不远的小城。"},{"en":"The name Buxtehude can refer either to the composer or to the town.","zh":"“Buxtehude”既可以指作曲家，也可以指那座城镇。"}]}],"synonyms":["Dieterich Buxtehude","Dietrich Buxtehude"],"phonetic":"/ˈbʊkstəˌhuːdə/","extraExplanation":["在音乐史里提到“Buxtehude”，多数情况下指作曲家Dieterich（也常拼作Dietrich）Buxtehude。他长期在吕贝克（Lübeck）的圣玛丽教堂任管风琴师，举办著名的“晚间音乐会（Abendmusiken）”。","有个常被提起的故事：年轻的巴赫曾步行长途去吕贝克听他演奏并学习（这体现了他在当时音乐界的声望）。"]}
{"word":"Buxton","summary":{"en":"Buxton is most commonly a town in Derbyshire, England (a historic spa town), but it can also be a surname or other place names.","zh":"Buxton 最常指英国德比郡的巴克斯顿（著名温泉城），也可作姓氏或其他地区的地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a town in Derbyshire, England, known as a spa town (famous for its mineral water) and as a gateway to the Peak District.","zh":"（英国）巴克斯顿：英格兰德比郡的一座城镇，以温泉矿泉水闻名，也是进入“峰区国家公园（Peak District）”的重要门户。"},"examples":[{"en":"We stopped in Buxton for the famous spring water and a walk in the hills.","zh":"我们在巴克斯顿停留，喝了著名的泉水，还去山里走了走。"},{"en":"Buxton Opera House is a popular place to see a show.","zh":"巴克斯顿歌剧院是看演出的热门地点。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"布克斯顿（姓氏）。"},"examples":[{"en":"Dr. Buxton will see you now.","zh":"布克斯顿医生现在会见你。"},{"en":"Her last name is Buxton.","zh":"她的姓是布克斯顿。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name used for several towns and areas in countries such as the United States, Canada, and Australia.","zh":"布克斯顿（地名）：在美国、加拿大、澳大利亚等国家也有同名城镇或地区。"},"examples":[{"en":"He grew up in Buxton, Maine.","zh":"他在缅因州的布克斯顿长大。"},{"en":"Buxton is a small community with a local school and park.","zh":"布克斯顿是一个小社区，有当地学校和公园。"}]}],"phonetic":"/ˈbʌkstən/","extraExplanation":["“Buxton（英国）”历史上以温泉疗养闻名，常见搭配有 Buxton water（巴克斯顿矿泉水）和 spa town（温泉城）。如果你在英美语境里看到 Buxton，需要结合上下文判断是英国德比郡的城镇、其他国家的地名，还是姓氏。"]}
{"word":"Buxus","summary":{"en":"Buxus means boxwood—a genus of evergreen shrubs/small trees often used for hedges and garden shaping.","zh":"Buxus 指黄杨（箱木）属植物，常绿灌木或小乔木，常用于绿篱与园林造型修剪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of evergreen shrubs or small trees known as boxwood, often used for hedges and topiary in gardens","zh":"黄杨属（常绿灌木或小乔木），即“黄杨/箱木”，常用于园林绿篱与造型修剪（拓扑花艺）"},"examples":[{"en":"The gardener trimmed the buxus hedge into a neat rectangle.","zh":"园丁把黄杨（buxus）绿篱修剪成整齐的长方形。"},{"en":"Buxus is popular in formal gardens because it keeps its shape well.","zh":"黄杨在规则式花园中很受欢迎，因为它很容易保持造型。"}]}],"synonyms":["boxwood","box"],"phonetic":"/ˈbʌksəs/","extraExplanation":["“Buxus”是植物学拉丁名，英语日常更常说“boxwood”。在园艺语境里，你可能会看到如“Buxus sempervirens”（欧洲黄杨/常绿黄杨）这样的学名写法。","黄杨常用于“hedge（绿篱）”“topiary（造型修剪）”等传统园林设计；在西方正式庭园（formal garden）里很常见。"]}
{"word":"buxus","summary":{"en":"Buxus is the botanical genus name for boxwood—evergreen shrubs or small trees commonly used for hedges and topiary.","zh":"Buxus 是黄杨属的植物学名称（即 boxwood），为常绿灌木或小乔木，常用于绿篱与造型修剪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of evergreen shrubs and small trees known as boxwood, often used for hedges and topiary","zh":"黄杨属（常绿灌木或小乔木的一个属），通常称为黄杨/箱木，常用于绿篱和造型修剪"},"examples":[{"en":"The garden’s formal hedges were planted with buxus.","zh":"花园里那些规整的绿篱是用黄杨（buxus）种的。"},{"en":"Buxus can be clipped into balls, cones, or other shapes.","zh":"黄杨（buxus）可以修剪成球形、圆锥形或其他造型。"},{"en":"Many parks use buxus because it stays green through winter in mild climates.","zh":"很多公园喜欢用黄杨（buxus），因为在温和气候里它冬天也常绿。"}]}],"synonyms":["boxwood"],"phonetic":"ˈbʌksəs","extraExplanation":["“Buxus”是拉丁语名称，也是植物学中的属名（genus）。日常英语里更常说“boxwood”，园艺语境中也会直接用“buxus”指代黄杨类植物。","在园艺文化中，黄杨常用于法式或英式的规则式庭园（formal garden），因为它叶子小、枝条密，耐修剪，适合做绿篱与“topiary”（造型树）。"]}
{"word":"buxus-related","summary":{"en":"“Buxus-related” means connected with boxwood (Buxus) plants, their products, or topics involving them.","zh":"“Buxus-related”指与黄杨属（boxwood，Buxus）植物、其制品或相关议题有关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with, made from, or involving buxus (boxwood) plants or materials.","zh":"与黄杨属（boxwood，Buxus）植物或其材料有关的；由黄杨制成的；涉及黄杨的。"},"examples":[{"en":"The garden redesign includes several buxus-related changes, such as new boxwood hedges.","zh":"花园改造包含一些与黄杨有关的改动，比如新种的黄杨绿篱。"},{"en":"Researchers discussed buxus-related pests that can damage ornamental shrubs.","zh":"研究人员讨论了与黄杨有关的害虫，它们会破坏观赏灌木。"}]}],"synonyms":["boxwood-related","Buxus-associated","Buxus-specific","related to boxwood"],"phonetic":"/ˈbʌk.səs rɪˈleɪ.tɪd/","extraExplanation":["“Buxus”是黄杨属的拉丁学名，在园艺里常指“boxwood（黄杨/黄杨木）”。因此“buxus-related”多见于园艺、植物学、林业或病虫害防治语境，例如：buxus-related diseases（黄杨相关病害）、buxus-related products（黄杨相关产品）。","在英语里，人们更常直接说“boxwood-related”。“buxus-related”更偏正式或学术，用于强调植物学分类（属名）而不是常见名称。"]}

