{"word":"BW","summary":{"en":"BW is a common abbreviation meaning “black and white,” “bandwidth,” or “body weight,” depending on context.","zh":"BW 是常见缩写，常指“黑白”“带宽”或“体重”，具体含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation meaning “black and white,” often used for photos, movies, or printing.","zh":"“黑白”的缩写，常用于照片、电影或印刷（黑白色调）。"},"examples":[{"en":"I prefer BW photos because they feel more classic.","zh":"我更喜欢黑白照片，因为它们更有经典感。"},{"en":"The document is printed in BW to save ink.","zh":"这份文件用黑白打印来节省墨水。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “bandwidth,” used in networking and technology to mean data capacity or speed.","zh":"“带宽”的缩写，用于网络与科技领域，指数据传输容量或速度。"},"examples":[{"en":"This video call needs more BW to run smoothly.","zh":"这次视频通话需要更高的带宽才能更流畅。"},{"en":"We upgraded our internet plan for higher BW.","zh":"我们升级了网络套餐以获得更高的带宽。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “body weight,” used in fitness or medicine.","zh":"“体重”的缩写，常用于健身或医疗语境。"},"examples":[{"en":"Do three sets using only BW exercises.","zh":"做三组只用自身体重的训练。"},{"en":"The doctor recorded her BW during the checkup.","zh":"体检时医生记录了她的体重。"}]}],"synonyms":["B&W","black-and-white","bandwidth","body weight"],"phonetic":"ˌbiːˈdʌbəl.juː","extraExplanation":["“BW”通常出现在书面语或聊天中，具体含义要看语境：摄影/打印多指 black and white；网络技术文档多指 bandwidth；健身计划里常指 body weight。","读音一般是把两个字母读出来（B + W）。在正式写作中，最好第一次出现时写全称（如 black-and-white / bandwidth / body weight），再用 BW。"]}
{"word":"bwana","summary":{"en":"“Bwana” is a Swahili-derived English noun meaning “sir/boss/master,” used mainly in East African or colonial-context writing.","zh":"“bwana”是源自斯瓦希里语的英语名词，意为“先生/老板/主人”，多见于东非或殖民语境的叙述中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(East Africa, from Swahili) a respectful term of address meaning “sir,” “boss,” or “master,” especially used when speaking to a man in Kenya, Tanzania, etc.","zh":"（东非用语，源自斯瓦希里语）对男性的尊称，意为“先生/老板/主人”，常见于肯尼亚、坦桑尼亚等地的语境中。"},"examples":[{"en":"The guide called the traveler “bwana” to show respect.","zh":"向导用“bwana”称呼那位旅客，以示尊重。"},{"en":"In older stories set in colonial East Africa, Europeans are sometimes addressed as “bwana.”","zh":"在一些以东非殖民时期为背景的旧故事里，欧洲人有时会被称作“bwana”。"}]}],"synonyms":["sir","boss","master"],"phonetic":"/ˈbwɑːnə/","extraExplanation":["“bwana”在现代英语里多出现在描写东非的旅行写作、历史叙事或文学作品中，带有明显的地域与文化标记。","因为它在殖民时期的语境里常被用来称呼欧洲殖民者或雇主，所以在某些场合可能让人联想到权力不平等；写作或交流时要注意语境与对方感受。","相关斯瓦希里语表达：更直接的“先生”也可用“bwana”搭配姓名（如 Bwana Smith），而“mabwana”是复数形式（多个“先生/主人”）。"]}
{"word":"bwanas","summary":{"en":"“Bwanas” is the plural of “bwana,” a Swahili-derived term meaning “sir/boss/master,” used especially in East African contexts.","zh":"“Bwanas”是“bwana”的复数，源自斯瓦希里语，意为“先生/老板/主人”，多见于与东非相关的语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “bwana”: a Swahili word used in East Africa meaning “sir,” “boss,” or “master,” especially when addressing a man with authority or higher status.","zh":"“bwana”的复数：源自斯瓦希里语，在东非常用，意思相当于“先生 / 老板 / 主人”，多用于称呼有权势或地位较高的男性。"},"examples":[{"en":"The workers called the manager “bwana,” and outsiders sometimes wrote it as “bwanas” in reports.","zh":"工人们称经理为“bwana”，而外来者有时在报告里把它写成复数“bwanas”。"},{"en":"In older novels set in Kenya or Tanzania, you may see characters addressed as “bwana.”","zh":"在一些以肯尼亚或坦桑尼亚为背景的旧小说里，你可能会看到人物被称为“bwana”。"}]}],"synonyms":["sirs","bosses","masters","misters"],"phonetic":"ˈbwɑːnə","extraExplanation":["“bwana”进入英语多与东非的殖民与旅行叙事有关：在一些旧式英语文本里，它可能带有不平等权力关系（如“主人/雇主”）的色彩。现代语境中若使用，最好留意场合与语气，避免让人感到冒犯或居高临下。","英语里写作“bwanas”通常只是把它当作可数名词复数来用，但在斯瓦希里语和当地使用中，更常直接用单数作称呼（类似英语里叫人“sir”）。"]}
{"word":"BWC","summary":{"en":"BWC is an abbreviation most commonly used in texting to mean “because,” but it can also stand for various organizations; it may have a vulgar slang meaning in some contexts.","zh":"BWC是一个缩写：在聊天中常用来表示“because（因为）”，也可能是不同机构/术语的首字母；在某些语境下还有粗俗俚语含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(internet/texting) Short for “because.”","zh":"（网络/短信）“because”的缩写，表示“因为/由于”。"},"examples":[{"en":"I stayed home BWC I was tired.","zh":"我待在家里BWC我很累。"},{"en":"BWC it’s raining, the game is canceled.","zh":"因为在下雨，比赛取消了。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation used as initials for many organizations or terms (meaning depends on context).","zh":"常见的首字母缩写，可能代表不同机构或术语（具体含义取决于语境）。"},"examples":[{"en":"Please contact the BWC office for your claim.","zh":"请联系BWC办公室处理你的申报。"},{"en":"She serves on the BWC committee at work.","zh":"她在公司担任BWC委员会成员。"}]},{"partOfSpeech":"other","definition":{"en":"(slang, vulgar) A sexual term; avoid in polite or professional contexts.","zh":"（俚语，粗俗）一种性相关用语；在正式或礼貌场合应避免使用。"},"examples":[{"en":"That meaning of “BWC” is explicit, so don’t use it at school or work.","zh":"“BWC”的那个意思很露骨，所以不要在学校或工作场合用。"}]}],"synonyms":["bc","because"],"phonetic":"/ˌbiː dʌbəl.juː ˈsiː/","extraExplanation":["“BWC”不是一个固定只对应一个意思的缩写：在聊天中有人用它代替“because”，但在不同圈子/行业也可能指某个机构（例如某些地区的工伤赔偿机构等）。最安全的做法是看上下文，或直接写出完整单词“because”。","需要注意：在英语网络语境里，BWC也可能被理解为粗俗的性暗语。为了避免尴尬，正式写作、职场邮件、课堂作业中不要用它。"]}
{"word":"BWG","summary":{"en":"“BWG” is an initialism with multiple meanings; common ones include “big white guy” (slang), “Bandwidth Group” (telecom/IT), or an organization’s “working group” label.","zh":"“BWG”是一个多义的首字母缩写；常见包括俚语“白人壮汉”、通信/IT 的“带宽组”，或组织内部某个“工作组”的简称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation/initialism used online; often means “big white guy” (informal slang).","zh":"网络缩写/首字母缩略词；常见含义之一是“白人壮汉/大个白人男性”（非正式俚语）。"},"examples":[{"en":"In the meme, BWG refers to a big white guy in the background.","zh":"在这个梗图里，BWG 指的是背景里一个白人壮汉。"},{"en":"He described the bouncer as a BWG with a shaved head.","zh":"他把那个保安形容成一个剃着光头的白人壮汉。"}]},{"partOfSpeech":"other","definition":{"en":"(telecom/IT) “Bandwidth Group,” a grouping/category related to network bandwidth (usage varies by company/standard).","zh":"（通信/IT）“带宽组”，与网络带宽分组/分类相关（不同公司或标准用法可能不同）。"},"examples":[{"en":"This service plan is limited to a specific BWG.","zh":"这个服务套餐被限制在某个带宽组（BWG）内。"},{"en":"Check which BWG your connection is assigned to.","zh":"查一下你的连接被分配到哪个带宽组（BWG）。"}]},{"partOfSpeech":"other","definition":{"en":"a shorthand for a “working group” name/title in organizations (e.g., a project group); exact meaning depends on the document or team.","zh":"在组织/项目里用于指某个“工作组”的简称（例如某项目小组）；具体含义取决于文件或团队语境。"},"examples":[{"en":"The BWG will meet on Thursday to finalize the draft.","zh":"BWG 将在周四开会敲定草案。"},{"en":"Please send your comments to the BWG chair.","zh":"请把你的意见发给 BWG 负责人。"}]}],"synonyms":["initialism","abbreviation"],"phonetic":"/ˌbiː dʌbəl.juː ˈdʒiː/","extraExplanation":["“BWG”通常读作字母：B-W-G。因为它是缩写，含义高度依赖语境（聊天、梗图、公司内部文件、通信/网络文档等）。如果你能提供一句原文或出现的场景，我可以帮你锁定最准确的意思。","在正式写作中，第一次出现缩写通常会先写全称再括号标注（Full Term (BWG)），以避免歧义。"]}
{"word":"BWI","summary":{"en":"BWI is the airport code for Baltimore/Washington International Thurgood Marshall Airport.","zh":"BWI 是巴尔的摩/华盛顿国际瑟古德·马歇尔机场的机场代码。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"The airport code for Baltimore/Washington International Thurgood Marshall Airport, a major airport serving Baltimore, Maryland and the Washington, D.C. area in the U.S.","zh":"巴尔的摩/华盛顿国际瑟古德·马歇尔机场的机场代码（BWI），是服务美国马里兰州巴尔的摩及华盛顿特区周边的重要机场。"},"examples":[{"en":"My flight arrives at BWI at 6:30 p.m.","zh":"我的航班下午6点30分到达BWI。"},{"en":"Is there a shuttle from BWI to downtown Washington, D.C.?","zh":"有从BWI到华盛顿特区市中心的接驳车吗？"},{"en":"We’re flying out of BWI instead of DCA because it’s cheaper.","zh":"我们从BWI出发而不是DCA，因为更便宜。"}]}],"synonyms":["Baltimore/Washington International Airport","BWI Airport"],"phonetic":"/ˌbiː ˌdʌbəl.juː ˈaɪ/","extraExplanation":["BWI 是美国机场常用的三字母代码（IATA code）。日常口语中通常读作字母：B-W-I（“bee double-u eye”）。","该机场全名里包含 Thurgood Marshall（瑟古德·马歇尔），他是美国最高法院首位非裔大法官；机场以他命名以示纪念。","在美国首都圈出行时，BWI 常与 DCA（里根国家机场，离市中心更近）和 IAD（杜勒斯国际机场，国际航班多）一起比较交通与价格。"]}
{"word":"BWM","summary":{"en":"BWM is an initialism whose meaning depends on context; it’s also often a typo for BMW.","zh":"BWM 是一个含义依语境而定的字母缩写；也常被当作 BMW 的误写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an initialism for the letters “B-W-M”; its meaning depends on context (it can refer to different organizations, phrases, or terms).","zh":"字母缩写“B-W-M”（读作三个字母）；具体含义取决于语境，可能指不同的组织、短语或专业术语。"},"examples":[{"en":"What does BWM stand for in this message?","zh":"这条信息里的 BWM 是什么意思？"},{"en":"I saw “BWM” in the notes, but there wasn’t enough context to understand it.","zh":"我在笔记里看到了“BWM”，但没有足够的语境看懂它。"}]},{"partOfSpeech":"other","definition":{"en":"(common confusion) a likely typo for “BMW,” the German car brand (Bayerische Motoren Werke).","zh":"（常见混淆）可能是把“BMW”（德国汽车品牌，Bayerische Motoren Werke）误写成“BWM”。"},"examples":[{"en":"Did you mean BMW instead of BWM?","zh":"你是想写 BMW 而不是 BWM 吗？"},{"en":"He drives a BMW, not a BWM.","zh":"他开的是 BMW，不是 BWM。"}]}],"synonyms":["initialism","abbreviation"],"phonetic":"/biː ˌdʌbəl.juː ˈɛm/","extraExplanation":["“BWM”不是一个像“USA”那样固定、人人都懂的通用缩写；在不同圈子可能代表不同东西。为了避免误解，最好提供你看到它的句子或领域（聊天、工作、医学、社群等），我就能帮你锁定最可能的含义。"]}
{"word":"BWR","summary":{"en":"BWR most commonly means “Boiling Water Reactor,” a nuclear reactor design that makes steam directly in the reactor vessel to generate electricity.","zh":"BWR 最常见的意思是“沸水反应堆”，一种在反应堆容器内直接产生蒸汽并用于发电的核反应堆设计。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Boiling Water Reactor: a type of nuclear reactor that boils water inside the reactor vessel to produce steam that drives a turbine to generate electricity.","zh":"沸水反应堆：一种核反应堆，在反应堆压力容器内直接将水煮沸产生蒸汽，用蒸汽驱动汽轮机发电。"},"examples":[{"en":"Japan operates several BWR nuclear power plants.","zh":"日本运营着多座 BWR（沸水反应堆）核电站。"},{"en":"In a BWR, the steam goes directly from the reactor to the turbine.","zh":"在 BWR 中，蒸汽会直接从反应堆进入汽轮机。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation that can mean different things depending on the field (for example, online it may be used as shorthand in chat or usernames).","zh":"一个缩写：在不同领域可能代表不同含义（例如在网络聊天或用户名中，可能只是简写）。"},"examples":[{"en":"What does BWR mean in this report? It might be a technical abbreviation.","zh":"这份报告里的 BWR 是什么意思？它可能是一个技术缩写。"}]}],"synonyms":["Boiling Water Reactor"],"phonetic":"/ˌbiː dʌbəl.juː ˈɑːr/","extraExplanation":["在能源与核工程语境里，BWR 最常指“沸水反应堆”，常与 PWR（压水反应堆）对比：BWR 在堆内直接产汽；PWR 则通过一次回路把热量传到二次回路再产汽。","如果你是在某个特定句子/领域里看到 BWR（例如医学、物流、社群用语），把原句发我，我可以根据上下文判断它具体代表什么。"]}
{"word":"BWT","summary":{"en":"BWT is a context-dependent abbreviation, most often meaning “by the way” (sometimes a typo for BTW), and it can also mean “black-and-white thinking” or “bodyweight training.”","zh":"BWT 是依语境而定的缩写，最常见是“by the way（顺便说一下）”（有时是把 BTW 打错），也可能指“非黑即白思维”或“自重训练”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation for “by the way” (often a typo for “BTW”), used in casual messages to add extra information or change the topic slightly.","zh":"“by the way（顺便说一下）”的缩写（常见为把 BTW 误打成 BWT），用于聊天中补充信息或轻微转题。"},"examples":[{"en":"BWT, did you see my last message?","zh":"BWT（顺便说一下），你看到我上一条消息了吗？"},{"en":"I’ll be there at 7. BWT, should I bring anything?","zh":"我7点到。BWT（顺便问一下），我需要带点什么吗？"}]},{"partOfSpeech":"other","definition":{"en":"Abbreviation for “black-and-white thinking” (also written as B&W thinking): seeing things as only completely good or completely bad, with no middle ground.","zh":"“black-and-white thinking（非黑即白思维）”的缩写：把事情看成只有完全好或完全坏，没有中间地带。"},"examples":[{"en":"Calling yourself a failure after one mistake is BWT.","zh":"犯一次错就说自己是失败者，这是一种BWT（非黑即白思维）。"},{"en":"Therapy helped me notice my BWT and think more flexibly.","zh":"心理咨询帮助我觉察到自己的BWT（非黑即白思维），思考更灵活。"}]},{"partOfSpeech":"other","definition":{"en":"In fitness contexts, an abbreviation for “bodyweight training” (more commonly written as BWT or BW training): exercise that uses your body as resistance.","zh":"在健身语境中，“bodyweight training（自重训练）”的缩写：用自身体重作为阻力的训练。"},"examples":[{"en":"My BWT routine includes push-ups, squats, and planks.","zh":"我的BWT（自重训练）计划包括俯卧撑、深蹲和平板支撑。"},{"en":"BWT is great when you don’t have gym equipment.","zh":"没有器械时，BWT（自重训练）很适合。"}]}],"synonyms":["by the way (BTW)","black-and-white thinking","bodyweight training"],"phonetic":"ˌbiː ˌdʌbəl.juː ˈtiː","extraExplanation":["“BWT”不是一个特别固定、唯一的英文缩写，具体含义高度依赖语境（聊天、心理学、健身等）。如果你告诉我它出现在哪句话里/哪个领域，我可以帮你确定最准确的意思与更自然的译法。"]}
{"word":"BWTS","summary":{"en":"BWTS is an initialism; in casual texting it can mean “but what the…?”, but most often its meaning depends on context.","zh":"BWTS 是一个首字母缩写；在口语/聊天里有时表示“but what the…?”，但更常见的是需要结合上下文才能确定具体含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(internet/texting, informal) An initialism sometimes used to mean “but what the…?”—a censored or softened way to show surprise, confusion, or disbelief (similar to “what the…?”).","zh":"（网络/短信，非正式）有时用来表示“but what the…?”（“但这到底……？”），一种省略或弱化的表达，用来表示惊讶、困惑或难以置信（类似“what the…?”）。"},"examples":[{"en":"BWTS—how did this happen so fast?","zh":"BWTS——怎么会这么快就发生了？"},{"en":"I opened the file and it was empty. BWTS?","zh":"我打开文件发现是空的。BWTS？"}]},{"partOfSpeech":"other","definition":{"en":"(general) An abbreviation with no single fixed meaning; it can stand for different phrases, names, or organizations depending on the context.","zh":"（通用）一个没有唯一固定含义的缩写；具体代表什么取决于上下文，可能是不同短语、项目名或机构名。"},"examples":[{"en":"What does BWTS stand for in your email?","zh":"你邮件里的 BWTS 是什么意思/代表什么？"},{"en":"In this document, BWTS refers to a system name used by the company.","zh":"在这份文件里，BWTS 指的是公司使用的某个系统名称。"}]}],"synonyms":["what the…","WTH","(depends on context)"],"phonetic":"/ˌbiːˌdʌbəl.juːˌtiːˈɛs/","extraExplanation":["BWTS 不是像 “NASA” 那样高度固定的缩写，更像是“看语境才知道”的字母组合。你可以告诉我它出现的场景（聊天、游戏、工作邮件、论文、设备型号等），我就能更准确地解释。","如果你是在聊天里看到的，也可能是打字误差（例如把 “BTS”“BTW” 等打错），可以对照上下文看看是否说得通。"]}
{"word":"BWV","summary":{"en":"BWV is the catalog number system used to identify J. S. Bach’s works.","zh":"BWV 是用于标识巴赫作品的标准目录编号系统。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for Bach-Werke-Verzeichnis, the standard catalog system that assigns numbers to works by the composer Johann Sebastian Bach (e.g., BWV 1043).","zh":"“Bach-Werke-Verzeichnis”的缩写，即约翰·塞巴斯蒂安·巴赫作品的标准编号目录体系（如 BWV 1043）。"},"examples":[{"en":"My favorite Bach piece is the Double Violin Concerto, BWV 1043.","zh":"我最喜欢的巴赫作品是《双小提琴协奏曲》，BWV 1043。"},{"en":"The program lists “Prelude and Fugue in C major, BWV 846.”","zh":"节目单上写着“C 大调前奏曲与赋格，BWV 846”。"},{"en":"If you search by BWV number, you can usually find the exact recording faster.","zh":"如果用 BWV 编号搜索，通常能更快找到准确的录音。"}]}],"synonyms":["Bach catalog number","Bach work number"],"phonetic":"/ˌbiː dʌbəl.juː ˈviː/","extraExplanation":["BWV 是古典音乐里非常常见的“作品编号”写法，主要用于巴赫。数字不一定按创作时间排序，而是更偏向按体裁/类型分组，因此同一时期作品的编号可能相差很大。","德语 Bach-Werke-Verzeichnis 直译为“巴赫作品目录”。在英文乐评、唱片信息、乐谱目录中经常只写 BWV + 数字。"]}
