{"word":"CAA","summary":{"en":"CAA is an acronym; common meanings include Civil Aviation Authority, India’s Citizenship Amendment Act, and a DNS security record called Certification Authority Authorization.","zh":"CAA是一个缩写；常见含义包括民航监管机构、印度《公民身份（修正）法》，以及DNS安全记录“证书颁发机构授权（CAA）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Acronym) Civil Aviation Authority: a government agency that regulates civil (non-military) aviation, such as flight safety, pilots, and airlines.","zh":"（缩写）民用航空管理机构／民航局：负责监管民用航空的政府机构，例如飞行安全、飞行员与航空公司等。"},"examples":[{"en":"The Civil Aviation Authority (CAA) investigated the safety incident.","zh":"民航管理机构（CAA）对这起安全事件进行了调查。"},{"en":"The airline must meet CAA standards before it can operate new routes.","zh":"航空公司在开通新航线前必须符合CAA的标准。"}]},{"partOfSpeech":"other","definition":{"en":"(Acronym) Citizenship Amendment Act (India): a law commonly referred to as “the CAA.”","zh":"（缩写）《公民身份（修正）法》（印度）：常被简称为“CAA”的一部法律。"},"examples":[{"en":"The article explains public debates around the CAA.","zh":"这篇文章解释了围绕CAA的公众争论。"},{"en":"Some protests in 2019–2020 focused on the CAA.","zh":"2019—2020年的一些抗议活动聚焦于CAA。"}]},{"partOfSpeech":"other","definition":{"en":"(Acronym, tech) CAA (Certification Authority Authorization): a DNS record that tells which certificate authorities are allowed to issue SSL/TLS certificates for a domain.","zh":"（缩写，技术）CAA（证书颁发机构授权）：一种DNS记录，用来指定哪些CA可以为某个域名签发SSL/TLS证书。"},"examples":[{"en":"We added a CAA record to prevent unauthorized certificate issuance.","zh":"我们添加了CAA记录，以防止未授权的证书签发。"},{"en":"Check the domain’s CAA settings before requesting a new certificate.","zh":"申请新证书前，先检查域名的CAA设置。"}]}],"phonetic":"/ˌsiː eɪ ˈeɪ/","extraExplanation":["“CAA”本身只是字母缩写，具体指什么高度依赖语境：航空新闻里常指民航监管机构；印度政治语境里常指《公民身份（修正）法》；网络安全/运维语境里常指DNS里的CAA记录。","如果你告诉我你看到“CAA”的句子或领域（航空/新闻/IT等），我可以帮你锁定最准确的含义与对应翻译。"]}
{"word":"Caaba","summary":{"en":"Caaba is another spelling of the Kaaba, Islam’s sacred building in Mecca.","zh":"Caaba 是 Kaaba（克尔白天房）的另一种拼写，指伊斯兰教在麦加的圣殿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Kaaba (also spelled Caaba): a cube-shaped holy building at the center of the Great Mosque in Mecca, Saudi Arabia, which Muslims face during prayer and circle during pilgrimage (Hajj/Umrah).","zh":"克尔白天房（亦拼作 Caaba）：位于沙特阿拉伯麦加禁寺中心的立方体圣殿；穆斯林礼拜时面向它，朝觐（哈吉/副朝）时绕行它。"},"examples":[{"en":"Muslims around the world face the Kaaba when they pray.","zh":"世界各地的穆斯林礼拜时都会面向克尔白天房。"},{"en":"During Hajj, pilgrims walk around the Kaaba as part of the rituals.","zh":"在哈吉朝觐期间，朝觐者会绕行克尔白天房，这是仪式的一部分。"}]}],"synonyms":["Kaaba","al-Kaaba"],"phonetic":"/ˈkɑːbə/","extraExplanation":["“Caaba”是较少见的拼写，现代英语中更常用“Kaaba”。在新闻报道、学术写作或旅行文化介绍中通常用“the Kaaba”。","由于这是宗教圣地名称，使用时建议保持尊重：避免随意比喻、玩笑式用法；谈到相关仪式（如绕行）时可用中性、描述性的表达。"]}
{"word":"caaba","summary":{"en":"Kaaba: Islam’s sacred building in Mecca that Muslims face during prayer.","zh":"Kaaba（克尔白）：伊斯兰教在麦加的神圣建筑，穆斯林礼拜时的朝向。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually written as Kaaba or Ka‘bah) the sacred cube-shaped building in Mecca, Saudi Arabia, inside the Grand Mosque; in Islam, it is the direction (qibla) Muslims face when they pray.","zh":"（通常拼作 Kaaba 或 Ka‘bah）位于沙特阿拉伯麦加禁寺内的神圣立方体建筑；在伊斯兰教中，它也是穆斯林礼拜时面向的方向（朝向，qibla）。"},"examples":[{"en":"Muslims around the world face the Kaaba during daily prayers.","zh":"全世界的穆斯林在每日礼拜时都面向克尔白。"},{"en":"During Hajj, pilgrims walk around the Kaaba as part of their worship.","zh":"在朝觐期间，朝觐者会绕行克尔白，以此作为崇拜的一部分。"}]}],"synonyms":["Ka‘bah","Kaaba"],"phonetic":"/ˈkɑːbə/","extraExplanation":["你输入的“caaba”在英语中更常见的拼写是 **Kaaba / Ka‘bah**（中文常译“克尔白”）。如果你是在查“caaba”这个特定拼写，它通常被视为对 Kaaba 的非标准拼写或拼写错误。","在英语语境里，提到 Kaaba 时通常会配合 **Mecca（麦加）**、**the Grand Mosque / Masjid al-Haram（禁寺）**、**Hajj（朝觐）**、**Umrah（副朝）** 等词一起出现。","这是高度宗教与文化相关的词汇；写作或对话中建议使用尊重性的表达，并注意大小写（Kaaba 通常首字母大写）。"]}
{"word":"caam","summary":{"en":"CAAM is usually an acronym; a common meaning is Center for Asian American Media. Its exact meaning depends on context.","zh":"CAAM 通常是缩写；常见含义之一是“亚裔美国人媒体中心”。具体指什么要看上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(acronym) Center for Asian American Media, a U.S. nonprofit that supports and presents films and media about Asian American experiences.","zh":"（缩写）美国“亚裔美国人媒体中心”（Center for Asian American Media），支持并推广与亚裔美国人经验相关的电影与媒体作品的非营利机构。"},"examples":[{"en":"CAAM presents Asian American films and documentaries each year.","zh":"CAAM 每年都会展映亚裔美国人的电影与纪录片。"},{"en":"She received a grant from CAAM to finish her documentary.","zh":"她获得了 CAAM 的资助来完成她的纪录片。"}]},{"partOfSpeech":"other","definition":{"en":"(general) An abbreviation used in different fields/organizations; its meaning depends on context (the company, school, country, or topic).","zh":"（泛指）在不同领域/机构中使用的缩写；具体含义取决于上下文（公司、学校、国家或话题）。"},"examples":[{"en":"In this email, CAAM refers to a department name, not a common English word.","zh":"在这封邮件里，CAAM 指的是一个部门名称，而不是常见英文单词。"},{"en":"If you tell me where you saw CAAM, I can identify what it stands for.","zh":"如果你告诉我 CAAM 出现在哪里，我可以帮你确定它代表什么。"}]}],"synonyms":["acronym","abbreviation"],"phonetic":"/ˌsiː.eɪ.eɪˈɛm/","extraExplanation":["“caam”本身不是常见英文单词，更多见于全大写“CAAM”的缩写用法。发音通常有两种：按字母读（C-A-A-M），或读成类似“cam”。","如果你原本想输入的是“calm”（平静的）或“cam”（摄像头/凸轮），也很常见会拼错；把句子发我，我可以按语境帮你纠正与解释。"]}
{"word":"caama","summary":{"en":"CAAMA is an Aboriginal-owned media organization in Central Australia (Alice Springs).","zh":"CAAMA 是位于澳大利亚中部（爱丽斯泉）的原住民媒体机构。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"CAAMA: the Central Australian Aboriginal Media Association, an Aboriginal-owned media organization based in Alice Springs (Northern Territory, Australia). It is known for radio, TV, and film work that supports Aboriginal languages and culture.","zh":"CAAMA：中澳大利亚原住民媒体协会（Central Australian Aboriginal Media Association），位于澳大利亚北领地爱丽斯泉的一家由原住民拥有的媒体机构，以广播、电视与影视制作闻名，致力于支持原住民语言与文化。"},"examples":[{"en":"CAAMA produces programs in Aboriginal languages as well as English.","zh":"CAAMA 制作原住民语言和英语的节目。"},{"en":"I watched a documentary supported by CAAMA in Alice Springs.","zh":"我看过一部在爱丽斯泉由 CAAMA 支持的纪录片。"}]}],"synonyms":["Central Australian Aboriginal Media Association"],"phonetic":"/ˈkɑmə/","extraExplanation":["“CAAMA”通常写作全大写，因为它是缩略词。日常口语里常读作类似“KAH-muh”的音。","在澳大利亚语境中，CAAMA 常与原住民媒体、自主叙事（self-representation）以及语言保护等话题一起出现。"]}
{"word":"caaming","summary":{"en":"“Caaming” is likely a misspelling of “calming,” meaning soothing or making someone feel less upset.","zh":"“caaming”很可能是“calming”的拼写错误，意思是“使人平静、安抚、舒缓”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"making someone feel more relaxed or less upset; soothing","zh":"使人平静的；安抚的；舒缓的"},"examples":[{"en":"Her voice was calming, even when she was giving bad news.","zh":"她的声音很安抚人，即使在讲坏消息的时候也是如此。"},{"en":"I find rain sounds calming when I’m trying to sleep.","zh":"我睡前听雨声会觉得很放松、很舒缓。"}]},{"partOfSpeech":"n.","definition":{"en":"the action of making someone or yourself feel calmer (the -ing form of “calm”)","zh":"让自己或他人变得更平静的行为（“calm”的 -ing 形式）"},"examples":[{"en":"Deep breathing is a simple way of calming your nerves before a test.","zh":"考试前深呼吸是安抚紧张情绪的简单方法。"},{"en":"She focused on calming the child down after the loud noise.","zh":"巨响之后，她专心让孩子平静下来。"}]}],"synonyms":["soothing","relaxing","comforting","tranquil","peaceful"],"phonetic":"/ˈkɑmɪŋ/","extraExplanation":["“caaming”不是常见的英文拼写。你很可能想写的是“calming”（少了字母 l）。也有人会把它和“camping（露营）”拼混，但意思完全不同。","“calming”来自动词“calm（使平静）”。常见搭配：calming music（舒缓的音乐）、calming effect（镇静效果）、calming down（冷静下来）。"]}
{"word":"Caanthus","summary":{"en":"Canthus means the corner of the eye where the eyelids meet.","zh":"Canthus 指眼角，即上下眼睑相接的部位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Either of the two corners (angles) of the eye where the upper and lower eyelids meet.","zh":"（眼睛的）内眦/外眦；上下眼睑相接的眼角。"},"examples":[{"en":"The doctor checked the canthus for swelling and redness.","zh":"医生检查了眼角是否有肿胀和发红。"},{"en":"Some people have a visible fold near the inner canthus.","zh":"有些人的内眼角附近会有明显的褶皱。"}]}],"synonyms":["corner of the eye","inner canthus","outer canthus"],"phonetic":"/ˈkænθəs/","extraExplanation":["你输入的“Caanthus”更常见的拼写是 **canthus**。这是解剖学用词，主要用于医疗、护肤或化妆相关语境。","常见搭配：**inner canthus（内眦）**、**outer canthus（外眦）**。在眼科或美容描述中会用这些说法来更精确地指位置。"]}
{"word":"caapeba","summary":{"en":"Caapeba is a local (Brazilian/Portuguese) name for a tropical American plant, seen mainly in botanical or herbal contexts.","zh":"Caapeba 是一种热带美洲植物的地方名（多见于巴西/葡语语境），主要出现在植物学或草药相关文本中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical American plant (often identified as Piper umbellatum) known in Brazil by the local name caapeba; sometimes mentioned in herbal-medicine contexts","zh":"（多指）一种热带美洲植物（常被认作伞形胡椒 Piper umbellatum），在巴西等地以“caapeba”这种地方名称出现；有时用于草药/民间药用语境"},"examples":[{"en":"Some Brazilian herbal guides mention caapeba leaves for traditional home remedies.","zh":"一些巴西的草药指南会提到用 caapeba 的叶子做传统家庭偏方。"},{"en":"Caapeba is not a common word in everyday English, so you’ll mostly see it in plant or ethnobotany writing.","zh":"“caapeba”在日常英语里并不常见，你多半会在植物学或民族植物学的文章里见到它。"}]}],"synonyms":["Piper umbellatum (scientific name)"],"phonetic":"/ˌkɑːəˈpeɪbə/","extraExplanation":["“caapeba”更像是葡萄牙语/巴西地区的俗名（地方名），而不是英语常用词；在英文资料里可能以植物拉丁学名（如 Piper umbellatum）出现。","不同地区或不同作者可能会把“caapeba”用于指称相近的植物，因此检索时建议同时查：caapeba + Latin name / scientific name。"]}
{"word":"caatinga","summary":{"en":"Caatinga is a dry, drought-adapted shrubland/forest biome in northeastern Brazil.","zh":"Caatinga 指巴西东北部的干旱灌木林/林地生态区，植被高度适应干旱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of dry shrubland/forest biome in northeastern Brazil, with thorny plants and trees that can lose their leaves in the dry season","zh":"（巴西东北部的）卡廷加干旱灌木林/林地生态区；以耐旱、带刺植物为主，旱季常落叶"},"examples":[{"en":"The caatinga has long dry seasons, so many plants store water or drop their leaves.","zh":"卡廷加地区旱季漫长，因此许多植物会储水或在旱季落叶。"},{"en":"Researchers study biodiversity in the caatinga to protect endangered species.","zh":"研究人员研究卡廷加的生物多样性，以保护濒危物种。"},{"en":"Unlike the Amazon rainforest, the caatinga is adapted to heat and drought.","zh":"与亚马孙雨林不同，卡廷加适应高温和干旱。"}]}],"synonyms":["dry shrubland","thorn scrub","semi-arid woodland"],"phonetic":"/kɑːəˈtɪŋɡə/","extraExplanation":["“caatinga”来自巴西原住民语言图皮语（Tupi），常被解释为“白色森林/白色植被”，指旱季时许多树木落叶、枝干呈浅色的景象。","它是南美重要的半干旱生态系统之一，具有很多特有（只在当地出现）的动植物；在巴西环境与地理相关话题中常见。","注意读写：词中“aa”是连续两个元音，发音上通常会有轻微停顿感。"]}
{"word":"caax","summary":{"en":"CAAX (CaaX) is a protein-end motif that often signals prenylation and membrane attachment.","zh":"CAAX（CaaX）是蛋白质末端的序列基序，常提示会发生异戊二烯化修饰并帮助蛋白与细胞膜结合。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A short protein sequence (motif) at the end (C-terminus) of some proteins, written as CaaX, where C = cysteine, “a” = an aliphatic amino acid, and X = a variable amino acid. It often signals a chemical modification (prenylation) that helps the protein attach to cell membranes.","zh":"一种位于某些蛋白质末端（C 端）的短序列基序，写作 CaaX，其中 C=半胱氨酸，a=脂肪族氨基酸，X=可变氨基酸。它常作为信号引导“异戊二烯化/烯丙基化”（prenylation）等修饰，帮助蛋白质与细胞膜结合。"},"examples":[{"en":"Ras proteins have a CaaX motif that helps them anchor to the cell membrane.","zh":"Ras 蛋白带有 CaaX 基序，帮助它们固定在细胞膜上。"},{"en":"Mutations in the CAAX box can change whether a protein gets prenylated.","zh":"CAAX 盒（CAAX box）的突变可能会改变蛋白是否发生异戊二烯化修饰。"}]}],"synonyms":["CaaX motif","CAAX box","CaaX box"],"phonetic":"/ˌsiː eɪ eɪ ˈɛks/","extraExplanation":["“CAAX”常见于生物化学/分子生物学文献里，也会写作“CaaX”，表示模式而不是固定的四个具体氨基酸。","读法上常把它当作字母串念“C-A-A-X”，而不是按普通英文单词发音。","与 CaaX 基序相关的修饰主要是 prenylation（如 farnesylation 或 geranylgeranylation），会影响蛋白定位、信号传导等功能。"]}

