{"word":"CAB","summary":{"en":"Cab usually means a taxi; it can also mean the driver’s compartment of a large vehicle, and it can be used as a verb meaning “to take a taxi.”","zh":"Cab 通常指“出租车”；也可指大型车辆的“驾驶室”；作动词时表示“乘出租车”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a taxi; a car you pay to take you somewhere (often called a “cab”)","zh":"出租车；计程车（常简称为 cab）"},"examples":[{"en":"We took a cab to the airport because it was raining.","zh":"因为下雨，我们打车去机场。"},{"en":"It’s hard to find a cab here late at night.","zh":"这里深夜很难打到出租车。"},{"en":"Can you call a cab for me, please?","zh":"你能帮我叫一辆出租车吗？"}]},{"partOfSpeech":"n.","definition":{"en":"the driver’s compartment of a truck, tractor, or other large vehicle","zh":"（卡车、拖拉机等大型车辆的）驾驶室"},"examples":[{"en":"He climbed into the cab of the truck.","zh":"他爬进了卡车驾驶室。"},{"en":"The cab is warm, but it’s freezing outside.","zh":"驾驶室里很暖和，但外面很冷。"}]},{"partOfSpeech":"v.","definition":{"en":"to travel somewhere by taxi","zh":"乘出租车去（某地）"},"examples":[{"en":"We cabbed home after the concert.","zh":"音乐会后我们打车回家。"},{"en":"If you’re tired, just cab it.","zh":"如果你累了，就打车吧。"}]}],"synonyms":["taxi","taxicab"],"phonetic":"/kæb/","extraExplanation":["“cab”来自更早的“cabriolet（轻便马车）”，后来也指用来载客的马车与汽车，所以现代英语里常用 cab 表示出租车。"]}
{"word":"cab","summary":{"en":"“Cab” most commonly means a taxi, and it can also mean the driver’s compartment of a large vehicle.","zh":"“Cab”最常指“出租车”，也可以指大型车辆的“驾驶室”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A taxi; a car you pay to take you somewhere.","zh":"出租车；付费载你到目的地的车辆。"},"examples":[{"en":"Let’s take a cab home—it's too late to walk.","zh":"我们坐出租车回家吧——走路太晚了。"},{"en":"I called a cab to the airport.","zh":"我叫了一辆出租车去机场。"}]},{"partOfSpeech":"n.","definition":{"en":"The driver’s compartment of a truck, tractor, or other large vehicle (where the driver sits).","zh":"（卡车、拖拉机等大型车辆的）驾驶室。"},"examples":[{"en":"The tools are stored behind the seat in the cab of the truck.","zh":"工具放在卡车驾驶室座位后面。"}]}],"synonyms":["taxi","taxicab"],"phonetic":"/kæb/","extraExplanation":["“Cab”通常是“taxicab”的口语缩写。在英式英语里也常说“taxi”，美式口语里“cab”很常见。","在交通或物流语境中，cab指车辆的“驾驶室”，不要和“cabinet（柜子）”混淆。"]}
{"word":"caba","summary":{"en":"CABA is an acronym for the Autonomous City of Buenos Aires (Argentina’s capital district).","zh":"CABA 是“布宜诺斯艾利斯自治市”（阿根廷首都直辖区）的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Argentina, acronym) The Autonomous City of Buenos Aires—the federal district that contains the city of Buenos Aires, Argentina’s capital.","zh":"（阿根廷，缩写）布宜诺斯艾利斯自治市——阿根廷首都布宜诺斯艾利斯所在的联邦直辖区。"},"examples":[{"en":"She lives in CABA but works in the suburbs.","zh":"她住在CABA（布宜诺斯艾利斯自治市），但在郊区上班。"},{"en":"Public transit in CABA is generally easy to use.","zh":"CABA 的公共交通一般很方便使用。"}]}],"synonyms":["Buenos Aires (city/district)","Autonomous City of Buenos Aires","Capital district of Buenos Aires"],"phonetic":"/ˌsiː eɪ biː ˈeɪ/","extraExplanation":["在阿根廷语境里，CABA 来自西班牙语全称 *Ciudad Autónoma de Buenos Aires*。当地人常用它来区分“自治市（市区/联邦区）”与“大布宜诺斯艾利斯都会区（provincia 的郊区，常被称为 *GBA*）”。","英语文章中出现 CABA 往往与旅行、移居、城市管理或统计数据（如犯罪率、房价、人口）有关。"]}
{"word":"cabaa","summary":{"en":"“cabaa” isn’t a standard English word; it’s likely a misspelling or a name, and the intended meaning depends on context.","zh":"“cabaa”不是标准英语单词；更可能是拼写错误或专有名称，含义需结合上下文判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; usually a misspelling or a name/brand. People often intend a similar-looking word (for example, “cabana” or “cabal”), so the meaning depends on context.","zh":"不是标准英语单词；通常是拼写错误，或是人名/品牌名。很多时候人们想写的是外形相近的词（例如 cabana 或 cabal），具体含义需看上下文。"},"examples":[{"en":"I couldn’t find “cabaa” in a dictionary—did you mean “cabana” (a small shelter by a beach/pool)?","zh":"我在词典里找不到“cabaa”——你是不是想写“cabana”（海滩/泳池边的小棚屋）？"},{"en":"If “cabaa” is a product or company name, please share the sentence so I can explain it accurately.","zh":"如果“cabaa”是产品名或公司名，请给我完整句子，我才能更准确地解释。"}]}],"synonyms":["(possible intended words) cabana","(possible intended words) cabal","(possible intended words) cab"],"phonetic":"/kəˈbɑː/","extraExplanation":["“cabaa”更像是打字时多按了一个字母（比如把 cabal / cabana 打成了 cabaa）。\n你可以把含有“cabaa”的整句话发给我，或告诉我是想表达：\n1) cabana（海边/泳池边的遮阳小棚）；\n2) cabal（秘密小团体/阴谋集团）；\n3) cab（出租车的口语）+ 其他拼写变化。"]}
{"word":"cabaan","summary":{"en":"“Cabaan” is usually a misspelling of **cabana**: a small beach/pool shelter, or a light beach cover-up.","zh":"“cabaan”通常是 **cabana** 的拼写错误：指海滩/泳池旁的小棚屋（更衣休息处），也可指轻薄的海边罩衫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely a misspelling of **cabana**) a small hut or shelter, especially one near a beach or swimming pool for changing clothes or relaxing.","zh":"（多半是 **cabana** 的拼写错误）小棚屋/更衣小屋，尤指海滩或泳池旁用于更衣、休息的遮蔽处。"},"examples":[{"en":"We rented a cabana by the pool for the afternoon.","zh":"我们租了一个泳池边的小棚屋用了一下午。"},{"en":"She changed into her swimsuit in a beach cabana.","zh":"她在海滩更衣小屋里换上了泳衣。"}]},{"partOfSpeech":"n.","definition":{"en":"A light, loose piece of clothing (often a coat or cover-up) worn at the beach or pool; also called a **cabana shirt/jacket** in some contexts.","zh":"（海边/泳池穿的）轻薄宽松外衣或罩衫；某些语境也说 cabana shirt/jacket。"},"examples":[{"en":"He threw on a cabana shirt after swimming.","zh":"游完泳后他套上了一件海边罩衫。"}]}],"synonyms":["hut","shelter","changing hut","beach hut"],"phonetic":"kəˈbænə","extraExplanation":["“cabana”来自西班牙语，常与度假文化相关（泳池、海滩、酒店）。在英文里更常见的拼写是 **cabana**；“cabaan”一般不算标准拼写，除非是品牌名或人名。"]}
{"word":"caback","summary":{"en":"Callback means a return call, the act of calling someone back, and (in programming) a function run later after an event.","zh":"Callback 可指回电/回拨，也可指（编程中的）回调函数；在求职语境中还可指复试通知。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a return call; a phone call made back to someone who called you first","zh":"回电；给先打来电话的人再打回去"},"examples":[{"en":"I missed your call—I'll give you a callback in a few minutes.","zh":"我错过了你的电话——我几分钟后给你回电。"},{"en":"Please leave your number and we’ll schedule a callback.","zh":"请留下你的号码，我们会安排回电。"}]},{"partOfSpeech":"v.","definition":{"en":"an act of calling someone back; to return a phone call","zh":"回拨（电话）；回电"},"examples":[{"en":"Can you callback after 3 p.m.?","zh":"你能下午三点后再回电话吗？"},{"en":"She said she would callback once she finished the meeting.","zh":"她说开完会就会回电话。"}]},{"partOfSpeech":"n.","definition":{"en":"in programming, a function that is passed into another function and run later (often after an event finishes)","zh":"（编程）回调函数：把一个函数作为参数传给另一个函数，之后在特定事件或操作完成时再执行"},"examples":[{"en":"Use a callback to run code after the file finishes downloading.","zh":"用回调在文件下载完成后运行代码。"},{"en":"The button click triggers a callback function.","zh":"点击按钮会触发一个回调函数。"}]}],"synonyms":["return call","call back","ring back","follow-up call"],"phonetic":"/ˈkɔlˌbæk/","extraExplanation":["你输入的“caback”很可能是拼写错误，常见目标词是“callback”（一个词）或“call back”（两个词）。日常写作里常用“call back”（动词短语），名词形式多写作“callback”。","在求职语境中，a callback 也常指“复试/第二轮面试的邀请”，例如：I got a callback after the first interview.（我一面后收到了复试通知。）"]}
{"word":"Cabaeus","summary":{"en":"Cabaeus is a lunar crater near the Moon’s south pole, often discussed in relation to shadowed areas and possible water ice (usually spelled “Cabeus”).","zh":"Cabaeus指月球南极附近的一座月坑，常与永久阴影区及可能存在的水冰相关（通常拼作“Cabeus”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lunar impact crater near the Moon’s south pole (more commonly spelled “Cabeus”); it is often mentioned in discussions of permanently shadowed regions and the search for water ice on the Moon.","zh":"月球南极附近的一座撞击坑（更常见拼写为“Cabeus”）；常出现在关于“永久阴影区”与月球水冰探测的讨论中。"},"examples":[{"en":"Scientists studied Cabaeus because its floor can stay in shadow for long periods.","zh":"科学家研究Cabaeus（卡巴厄斯撞击坑），因为它的坑底可能长期处于阴影中。"},{"en":"The mission targeted the Cabaeus region to look for signs of water ice.","zh":"该任务瞄准Cabaeus区域，以寻找水冰存在的迹象。"}]}],"synonyms":["Cabeus"],"phonetic":"/kəˈbiːəs/","extraExplanation":["“Cabaeus”常被视为“Cabeus”的变体拼写，源自拉丁化的命名传统。该月坑与月球南极的“永久阴影区（permanently shadowed regions）”相关：由于太阳高度角很低，某些坑底可能极少见到阳光，因此更可能保存挥发物（如水冰）。","在科普与航天新闻里，你更常看到拼写“Cabeus”，尤其是在提到NASA的LCROSS任务时；如果你在论文或资料中看到“Cabaeus”，通常可以理解为同一对象或非常接近的命名用法。"]}
{"word":"cabaho","summary":{"en":"“Cabaho” is not a standard English word; it likely needs context or a corrected spelling.","zh":"“cabaho”不是标准英语词；通常需要上下文或更正拼写才能确定意思。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a word from another language (for example, Spanish/Tagalog/Cebuano), so its meaning depends on the context.","zh":"不是标准英语单词。它很可能是拼写错误，或来自其他语言（例如西班牙语/他加禄语/宿务语等），具体含义需要结合上下文。"},"examples":[{"en":"“Cabaho” isn’t in most English dictionaries—could you share the sentence you saw it in?","zh":"“cabaho”通常不在英语词典里——你能把它出现的句子发我吗？"},{"en":"If you meant “caboose,” it refers to the last car of a train (especially in older usage).","zh":"如果你想写的是“caboose”，它指火车的最后一节车厢（尤其是较旧的用法）。"},{"en":"If you meant “cabana,” it means a small shelter near a pool or beach.","zh":"如果你想写的是“cabana”，它指泳池或海滩旁的小棚屋/遮阳小屋。"}]}],"phonetic":"/kəˈbɑhoʊ/","extraExplanation":["你可能想输入的是某个英语单词的拼写变体：\n- caboose（火车末节车厢）\n- cabana（海边/泳池边的小棚屋）\n- cabbie（口语：出租车司机）\n\n也有可能“cabaho”来自其他语言或人名/地名。把你看到它的完整句子、来源（书/歌词/聊天/游戏等）或你想表达的中文意思发我，我可以帮你准确定位。"]}
{"word":"cabal","summary":{"en":"A cabal is a small secret group that works together to influence events, especially in politics.","zh":"cabal 指暗中合谋影响局势的秘密小团体，常用于政治语境，带贬义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, secret group of people who work together to plan or influence events, often in a political way","zh":"（常指政治性的）阴谋集团；秘密小团体（暗中合谋影响局势）"},"examples":[{"en":"The journalist claimed a cabal inside the government was shaping policy in secret.","zh":"那位记者声称政府内部有一个阴谋集团在秘密左右政策。"},{"en":"Rumors spread that a cabal of executives decided the company’s future behind closed doors.","zh":"谣言四起，说有一小撮高管在闭门会议中决定了公司的未来。"}]}],"synonyms":["clique","conspiracy","faction","inner circle"],"phonetic":"/kəˈbæl/","extraExplanation":["“cabal”通常带强烈负面含义：强调“秘密、排他、操控”。在正式写作中，它比“group/committee”更尖锐，常用于指责或质疑权力运作透明度。","历史上“Cabal”也可指17世纪英国查理二世时期的“五人内阁”，其成员姓氏首字母拼成 C-A-B-A-L；这让该词与“宫廷密谋/小圈子政治”的印象更紧密。"]}
{"word":"Cabala","summary":{"en":"Cabala usually means Jewish mysticism (Kabbalah); less commonly, it means a secret plot or intrigue.","zh":"Cabala 通常指犹太神秘主义传统（Kabbalah/卡巴拉）；较少情况下也可指密谋或阴谋策划。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(also Kabbalah) Jewish mystical tradition and teachings, especially about the hidden meanings of the Bible and the nature of God and creation.","zh":"（也作 Kabbalah）犹太教的神秘主义传统与教义，强调《圣经》的隐秘含义以及上帝与宇宙创造的奥秘。"},"examples":[{"en":"She took a course on Cabala (Kabbalah) and Jewish mysticism.","zh":"她上了一门关于卡巴拉（Kabbalah）与犹太神秘主义的课程。"},{"en":"Some writers borrow images from the Cabala to talk about secrets and spiritual transformation.","zh":"一些作家会借用卡巴拉的意象来谈论秘密与精神转化。"}]},{"partOfSpeech":"n.","definition":{"en":"A secret plan or political/religious intrigue; hidden plotting by a small group (less common).","zh":"（较不常用）密谋；阴谋策划（通常指小团体的秘密筹划或政治/宗教上的暗中操作）。"},"examples":[{"en":"The journalist claimed there was a cabala behind the sudden resignation.","zh":"那位记者声称这次突然辞职背后有一场密谋。"},{"en":"Rumors of a cabala spread through the court.","zh":"关于密谋的传言在宫廷中流传开来。"}]}],"synonyms":["Kabbalah","Cabbala","cabal","intrigue","conspiracy"],"phonetic":"/kəˈbɑːlə/","extraExplanation":["“Cabala”常见于较旧的英文拼写，现代更常写作“Kabbalah”（也见“Cabbala”）。在学术或宗教语境中通常指犹太神秘主义传统；在政治语境中“cabala”可指“密谋”，与更常用的“cabal（阴谋集团）”相关。阅读时可以根据上下文判断是宗教意义还是“阴谋”意义。"]}
{"word":"cabala","summary":{"en":"Cabala can mean a secret plotting clique, or (less commonly) the Jewish mystical tradition Kabbalah.","zh":"cabala 可指暗中密谋的小集团，也可（较少见）指犹太神秘主义传统 Kabbalah（卡巴拉）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a secret group or clique that works together to influence decisions, often through intrigue or hidden plans","zh":"（常含贬义）秘密结社；小圈子；暗中操纵的集团"},"examples":[{"en":"A cabala of advisers tried to control who got access to the president.","zh":"一小撮顾问暗中操纵谁能接触到总统。"},{"en":"The novel describes a cabala plotting to overthrow the king.","zh":"这部小说描写了一个密谋推翻国王的秘密集团。"}]},{"partOfSpeech":"n.","definition":{"en":"the Kabbalah; Jewish mystical tradition (an older/less common spelling)","zh":"卡巴拉／卡巴拉学（犹太神秘主义传统；较旧或较少见的拼写）"},"examples":[{"en":"She studied cabala texts alongside philosophy.","zh":"她在学习哲学的同时也研读卡巴拉文献。"},{"en":"In older books, you may see “cabala” where modern writers use “Kabbalah.”","zh":"在较旧的书里，你可能会看到用“cabala”来指现代常写作“Kabbalah”的概念。"}]}],"synonyms":["clique","cabal","conspiracy","inner circle","Kabbalah"],"phonetic":"/kəˈbɑːlə/","extraExplanation":["“cabala”来自中世纪拉丁语，和希伯来语“Qabbalah/Kabbalah（传统、领受的教义）”有关。英语里它一方面可指犹太神秘主义传统（较旧拼写），另一方面也发展出“暗中结党、密谋集团”的世俗含义。","文学和历史叙述中，“cabala”常带有阴谋、宫廷权术的气氛；如果你想表达中性或学术语境下的犹太神秘主义，更常用拼写是“Kabbalah”。"]}
{"word":"cabalas","summary":{"en":"Cabalas usually means the plural of cabala: a secret political intrigue/group; less commonly, a spelling of Kabbalah (Jewish mysticism).","zh":"cabalas 通常是 cabala 的复数：指秘密阴谋/密谋集团；较少见时也可指 Kabbalah（犹太神秘主义传统）的一种拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a secret plan or the group of people who make secret political plans; an intrigue","zh":"秘密阴谋；密谋集团（尤指政治上的）"},"examples":[{"en":"The journalist claimed a cabala inside the party was working to remove the leader.","zh":"那位记者声称党内有一个密谋集团正试图拉下领导人。"},{"en":"Rumors of a cabala spread quickly, but no evidence appeared.","zh":"关于阴谋的传言迅速扩散，但一直没有证据。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) Jewish mystical tradition; another spelling of “Kabbalah”","zh":"（较少见）犹太神秘主义传统；“Kabbalah（卡巴拉）”的另一种拼写"},"examples":[{"en":"In some older texts, cabala is used as a spelling for Kabbalah.","zh":"在一些较旧的文本中，cabala 被用作 Kabbalah 的一种拼写。"},{"en":"She became interested in cabala after reading about Jewish mysticism.","zh":"她读到犹太神秘主义后开始对卡巴拉感兴趣。"}]}],"synonyms":["cabal","conspiracy","plot","clique","intrigue"],"phonetic":"/kəˈbɑːlə/","extraExplanation":["你输入的 **cabalas** 通常是 **cabala** 的复数形式（= “阴谋/密谋” 或 “卡巴拉”）。更常见的现代拼写是：阴谋集团用 **cabal**，犹太神秘主义传统多用 **Kabbalah**。","词源上，**cabala/cabal** 与希伯来语“接受的传统/秘传”有关，后来在英语里衍生出“秘密结社、阴谋”的含义；但日常英语里谈“阴谋集团”一般更自然说 **a cabal**。"]}
{"word":"cabalassou","summary":{"en":"“Cabalassou” is not standard English; it most often functions as a place name.","zh":"“Cabalassou” 不是标准英语词，更常见用作地名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (toponym). “Cabalassou” is not a standard English vocabulary word; it most commonly appears as the name of a place (e.g., a village/locality) in some Francophone West African contexts.","zh":"专有名词（地名）。“Cabalassou” 不是标准英语词汇；它更常见于某些法语区西非语境中作为地点（如村庄/聚落）的名称。"},"examples":[{"en":"The aid team traveled to Cabalassou to deliver medical supplies.","zh":"援助小组前往 Cabalassou 运送医疗物资。"},{"en":"Cabalassou appears on some regional maps, but it’s not an English dictionary word.","zh":"Cabalassou 出现在一些地区地图上，但它不是英语词典里的常用词。"}]}],"phonetic":"ˌkæbəˈlɑːsuː","extraExplanation":["这个词看起来不像英语单词，更像地名或人名的拼写。如果你是在文章、歌词、地图或聊天里看到的，发我一句原句/出处（或上传截图），我可以帮你判断：它具体指哪个地方、应不应该大写、以及更常见的拼写或语言来源。","也有可能你想查的是发音或拼写相近的英语词，比如：calabash（葫芦/瓢）、cabal（阴谋集团）、carabas/carabass（某些语言中的容器/葫芦相关词形）。给一点语境我就能更准确地对应。"]}
{"word":"cabaletta","summary":{"en":"A cabaletta is the fast, energetic ending section of an operatic aria, especially in Italian bel canto opera.","zh":"cabaletta指歌剧咏叹调中快速、有冲劲的结尾段，尤见于意大利美声歌剧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A short, lively concluding section of an operatic aria (especially in 19th-century Italian opera), often faster and more rhythmically energetic than the earlier part.","zh":"（歌剧咏叹调的）快板结尾段；常见于19世纪意大利歌剧，通常比前段更快、更有节奏感、情绪更高涨。"},"examples":[{"en":"In many bel canto operas, the aria moves from a slow, expressive opening into a brilliant cabaletta.","zh":"在许多美声歌剧中，咏叹调常从缓慢抒情的开头转入华丽的cabaletta（快板结尾段）。"},{"en":"The soprano saved her biggest high notes for the cabaletta at the end of the scene.","zh":"女高音把最亮的高音留到该场景结尾的cabaletta里。"}]}],"synonyms":["aria finale","fast concluding section (of an aria)","brisk closing section"],"phonetic":"/ˌkæbəˈlɛtə/","extraExplanation":["“Cabaletta”常与“cantabile（慢板/抒情段）”成对出现：先是较慢、歌唱性强的cantabile，再接更快、更炫技、情绪更激昂的cabaletta。","它多见于“bel canto（美声）”传统的意大利歌剧（如罗西尼、贝利尼、多尼采蒂等），常用于展示歌手的技巧（例如快速音阶、花腔、重复段的装饰变化）。","词源来自意大利语；在歌剧结构分析、音乐评论和节目册中很常见，但在日常英语对话中不算高频词。"]}
{"word":"cabalic","summary":{"en":"Cabalic means secretive and tied to a small group acting behind the scenes.","zh":"cabalic 指与小团体暗中运作有关的、带有“秘密操控”意味的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a cabal; secretive and involving a small group that plans or acts in a hidden way (often to gain power or influence).","zh":"与“阴谋小集团”有关的；秘密的、由少数人暗中策划或行动的（常带有争权夺利的含义）。"},"examples":[{"en":"The committee made a cabalic decision behind closed doors.","zh":"委员会在闭门会议中做出了一个带有小圈子操控色彩的决定。"},{"en":"Rumors spread that a cabalic group was steering the company’s strategy.","zh":"传言四起，说有个秘密小团体在左右公司的战略。"}]}],"synonyms":["secretive","cliquish","conspiratorial","behind-the-scenes"],"phonetic":"/kəˈbælɪk/","extraExplanation":["“cabalic”来自名词“cabal”（阴谋小集团、秘密小圈子）。它通常带有负面评价：强调不透明、排他、暗箱操作。","不要与“kabbalistic / cabalistic”（与犹太神秘主义传统“Kabbalah/卡巴拉”有关的）混淆；拼写相近，但含义不同。"]}
{"word":"cabalism","summary":{"en":"Cabalism usually means secret plotting by a small group; rarely, it can be an older spelling for Kabbalism (Kabbalah-related mysticism).","zh":"Cabalism通常指小团体的秘密策划或政治阴谋；少见情况下也可作为Kabbalism（卡巴拉相关神秘主义）的旧式拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Secret plotting or political intrigue by a small, private group (a cabal).","zh":"由少数私下结盟的小团体进行的秘密策划或政治阴谋活动。"},"examples":[{"en":"The journalist accused the officials of cabalism behind closed doors.","zh":"这位记者指责官员们在密室里搞小圈子的阴谋活动。"},{"en":"Rumors of cabalism spread after the sudden change in leadership.","zh":"领导层突然更迭后，关于小团体暗中操控的传言四起。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare/older) Another spelling of “Kabbalism,” referring to Jewish mystical traditions; often seen in historical texts.","zh":"（罕见/旧式拼写）“Kabbalism”（卡巴拉主义/犹太神秘主义传统）的另一种拼写，常见于历史文献。"},"examples":[{"en":"In some older books, “cabalism” is used when discussing Kabbalah.","zh":"在一些旧书里，讨论卡巴拉时会用“cabalism”这种拼写。"}]}],"synonyms":["intrigue","conspiracy","scheming","plotting","cabal"],"phonetic":"/ˈkæbəˌlɪzəm/","extraExplanation":["“cabalism”更常见的意思是“搞小圈子、暗中结盟并策划”的行为，带有明显的贬义色彩；相关名词“cabal”指“秘密小集团”。","它之所以容易引起误解，是因为历史上“cabalism”也曾被用作“Kabbalism”的变体拼写（与“Kabbalah/卡巴拉”相关），但在现代英语里谈宗教/神秘主义时通常用“Kabbalah/Kabbalism”，而不是“cabalism”。","使用时可根据语境判断：如果在政治、权力斗争、幕后操控的语境里，几乎一定是“阴谋/小集团活动”的意思。"]}
{"word":"cabalisms","summary":{"en":"Cabalisms means acts or beliefs involving secret group plotting, or (less commonly) mystical Cabala/Kabbalah traditions.","zh":"cabalisms 指秘密小集团的阴谋活动；较少见时也指与卡巴拉/卡巴拉学相关的神秘主义传统。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"secret plotting or political intrigue by a small group (a cabal), often to gain power","zh":"（小集团的）秘密阴谋、政治暗算（为夺取权力等）"},"examples":[{"en":"The journalist accused the minister’s inner circle of cabalism behind the new policy.","zh":"记者指责部长的核心圈子在新政策背后搞秘密阴谋。"},{"en":"Rumors of cabalism spread quickly, even though there was little evidence.","zh":"尽管证据不多，关于阴谋暗算的传言还是迅速传开了。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) belief in or practice of mystical interpretation associated with the Cabala/Kabbalah","zh":"（较少见）与卡巴拉/卡巴拉学（Kabbalah）相关的神秘解释传统；卡巴拉式神秘主义"},"examples":[{"en":"Some Renaissance writers mixed Christian theology with cabalism.","zh":"一些文艺复兴时期的作家把基督教神学与卡巴拉式神秘主义混合在一起。"},{"en":"The novel uses symbols drawn from cabalism and astrology.","zh":"这部小说使用了源自卡巴拉式神秘主义和占星术的象征。"}]}],"synonyms":["intrigue","conspiracy","plotting","scheming","cabal","kabbalism"],"phonetic":"/ˈkæbəˌlɪzəm/","extraExplanation":["“cabalisms”是复数形式；更常见的单数是“cabalism”。","词源上它与“cabal（密谋集团）”有关；在宗教/神秘主义语境中，也可能与“Cabala/Kabbalah（卡巴拉）”相关。实际阅读中可根据上下文判断：政治新闻里多指“阴谋暗算”，学术或文学讨论里才可能指“卡巴拉神秘主义”。","该词在现代英语中不算常用，日常表达里更常见的是“intrigue / conspiracy / plotting”。"]}
{"word":"cabalist","summary":{"en":"A cabalist is usually a secret plotter in a small group; less commonly, it can mean a scholar of Kabbalah.","zh":"cabalist 通常指阴谋小集团的密谋者；较少见时也可指卡巴拉（Kabbalah）学者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of a small secret group that tries to gain power or influence, often by plotting or working behind the scenes","zh":"阴谋集团（小圈子秘密团体）成员；密谋者（常指在幕后操控以获取权力或影响力的人）"},"examples":[{"en":"The novel portrays a cabalist who manipulates the court from the shadows.","zh":"小说刻画了一位在暗处操控宫廷的密谋者。"},{"en":"Some critics accused the leaders of being cabalists who made decisions in private.","zh":"一些批评者指责这些领导人像阴谋集团成员一样，在私下做决定。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a person who studies or practices Kabbalah (Jewish mysticism); a Kabbalist","zh":"（较少见）卡巴拉（犹太神秘主义）的研究者或修行者；卡巴拉学者"},"examples":[{"en":"In historical writings, the term cabalist sometimes refers to a Kabbalah scholar.","zh":"在历史著作中，cabalist 有时指卡巴拉学者。"}]}],"synonyms":["conspirator","plotter","schemer","cabal member","kabbalist"],"phonetic":"/ˈkæbəlɪst/","extraExplanation":["“cabalist”有两条常见来源与含义：一是来自“cabal（密谋小集团）”，因此常带贬义，强调“幕后结党、操控”。二是与“Kabbalah（卡巴拉）”相关，指研究犹太神秘主义的人；这种用法较少见，且在现代英语里更常用拼写“kabbalist”。阅读时可根据语境判断：谈政治权力斗争多为前者；谈宗教/神秘主义多为后者。"]}
{"word":"cabalistic","summary":{"en":"Cabalistic means related to the Kabbalah (Jewish mysticism) or, more generally, mysterious and hard to understand.","zh":"cabalistic 指与卡巴拉（犹太神秘主义）有关，也可泛指神秘晦涩、只有少数人懂的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to Jewish mysticism, especially the Kabbalah; having a mystical or secret spiritual meaning.","zh":"与犹太神秘主义（尤指卡巴拉/Kabbalah）有关的；带有神秘或隐秘的宗教含义的。"},"examples":[{"en":"Some readers find cabalistic symbols hidden in the novel’s imagery.","zh":"有些读者觉得小说的意象里藏着卡巴拉式的神秘符号。"},{"en":"The manuscript uses cabalistic references to angels and numbers.","zh":"这份手稿使用了与天使和数字有关的卡巴拉式典故。"}]},{"partOfSpeech":"adj.","definition":{"en":"Mysterious, obscure, or understood only by a small group; secretive.","zh":"晦涩难懂的；只有少数人明白的；神秘而带点小圈子性质的。"},"examples":[{"en":"His explanation was so cabalistic that no one in the meeting understood it.","zh":"他的解释太晦涩了，会议上没人听懂。"},{"en":"They spoke in a cabalistic way, as if sharing a private code.","zh":"他们说话神神秘秘的，好像在用私密暗号交流。"}]}],"synonyms":["kabbalistic","mystical","esoteric","occult","cryptic","arcane"],"phonetic":"/ˌkæbəˈlɪstɪk/","extraExplanation":["“cabalistic”源于“Kabbalah”（卡巴拉），指犹太教传统中的神秘思想体系，常与象征、数字（如“数秘学”）、隐喻式解读经文等联系在一起。","在英语里它既可用于宗教/文化语境（较准确），也常被泛化为“神秘难懂、像密语一样”的意思；使用时注意避免把真实宗教传统简单等同于“阴谋”或“怪力乱神”。"]}
{"word":"cabalistical","summary":{"en":"Cabalistical means “related to Kabbalah (mystical/hidden meanings)” or more generally “mysterious and secretive.”","zh":"cabalistical 意为“与卡巴拉神秘主义相关（强调隐藏含义）”，也可泛指“神秘隐晦、带秘密色彩的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Cabala/Kabbalah (a Jewish mystical tradition), especially involving hidden or symbolic meanings.","zh":"与卡巴拉/卡巴拉密教（犹太神秘主义传统）有关的，尤指包含隐秘或象征性含义的。"},"examples":[{"en":"Some medieval scholars used cabalistical methods to interpret religious texts.","zh":"一些中世纪学者用卡巴拉式的方法来解读宗教文本。"},{"en":"The poem is full of cabalistical symbols that suggest a deeper meaning.","zh":"这首诗充满卡巴拉式的象征，暗示更深层的含义。"}]},{"partOfSpeech":"adj.","definition":{"en":"Secret, mysterious, or (less commonly) suggesting a hidden plot or conspiracy.","zh":"神秘而隐晦的；（较少见）带有“暗中结社/密谋”意味的。"},"examples":[{"en":"The group’s cabalistical meetings made outsiders suspicious.","zh":"这个团体神秘的聚会让外人起疑。"},{"en":"He gave a cabalistical smile, as if he knew something he wouldn’t say.","zh":"他露出一个神秘的微笑，仿佛知道什么却不肯说。"}]}],"synonyms":["cabalistic","kabbalistic","mystical","esoteric","occult","enigmatic"],"phonetic":"ˌkæbəˈlɪstɪkəl","extraExplanation":["“cabalistical”是较少见的拼写，更常见的是“cabalistic”或“kabbalistic”。它源自“Cabala/Kabbalah”（卡巴拉），指犹太神秘主义传统中用数字、字母与象征来探究“隐藏意义”的思想体系。","注意区分：英语里“cabal”也指“秘密小集团/密谋”，因此“cabalistical”有时会被引申为“神秘兮兮、像在搞小圈子密谋”。语境不同，含义会偏向“宗教神秘”或“阴谋式秘密”。"]}
{"word":"cabalistically","summary":{"en":"Cabalistically means ‘in a mystical, secret, symbolic way,’ especially connected to Kabbalah; more broadly, ‘in a mysterious, cryptic way.’","zh":"cabalistically 表示“以神秘、隐秘、象征性的方式（尤与卡巴拉相关）”；更广义也可指“神秘兮兮、晦涩地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a cabalistic way; using secret, mystical, or symbolic interpretation (especially associated with Jewish Kabbalah).","zh":"以卡巴拉式（神秘主义）的方式；用隐秘、神秘或象征性的解读（尤指与犹太教卡巴拉传统相关）。"},"examples":[{"en":"Some readers interpret the poem cabalistically, looking for hidden meanings in every image.","zh":"有些读者用卡巴拉式的方式解读这首诗，在每个意象里寻找隐藏含义。"},{"en":"He described the numbers cabalistically, as if they contained a secret message.","zh":"他以神秘主义的方式解释这些数字，仿佛其中藏着秘密信息。"}]},{"partOfSpeech":"adv.","definition":{"en":"Secretly or in an occult, mysterious manner (more general use, not strictly religious).","zh":"以隐秘、带神秘色彩的方式（更一般的用法，不一定严格指宗教传统）。"},"examples":[{"en":"The group spoke cabalistically, hinting at things they refused to say directly.","zh":"那群人说话神秘兮兮，暗示一些他们拒绝直说的事。"},{"en":"The novel’s clues are arranged cabalistically, so the reader must piece them together.","zh":"小说的线索被神秘地安排在一起，读者必须自己拼凑起来。"}]}],"synonyms":["mystically","esoterically","cryptically","occultly"],"phonetic":"/ˌkæbəˈlɪstɪkli/","extraExplanation":["“cabalistically”来自形容词“cabalistic”，与“Cabala/Kabbalah（卡巴拉）”有关：这是一套犹太神秘主义传统，强调对经典的隐喻、字母与数字（如“gematria”）等象征性解读。","现代英语里它也可更宽泛地表示“带神秘色彩、像在打哑谜一样地表达或安排信息”。注意不要与“cabal（密谋小集团）”混淆：拼写相近，但“cabalistic”主要指神秘/隐秘的诠释风格。"]}
{"word":"cabalists","summary":{"en":"Cabalists are people who study/practice Kabbalah; less commonly, the word can mean members of a secret plotting group.","zh":"cabalists 指研究/修习卡巴拉的人；较少见时也可指阴谋小集团的成员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who studies or practices Kabbalah (Jewish mystical teachings); a Kabbalist","zh":"研究或修习卡巴拉（犹太神秘主义传统）的人；卡巴拉学者/修行者"},"examples":[{"en":"Some medieval cabalists wrote commentaries on sacred texts to explain hidden meanings.","zh":"一些中世纪的卡巴拉学者撰写圣典注释，用来解释其中的隐秘含义。"},{"en":"The novelist portrays cabalists meeting at night to debate symbols and numbers.","zh":"小说描写卡巴拉修行者夜晚聚会，讨论符号与数字。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a member of a secret political group; someone involved in a cabal","zh":"（较少见）秘密政治小集团的成员；参与阴谋小集团的人"},"examples":[{"en":"The minister was accused by opponents of being one of the cabalists behind the plot.","zh":"反对者指控这位部长是阴谋背后秘密小集团的成员之一。"},{"en":"In the play, the cabalists whisper in corridors to influence the king.","zh":"在这部戏中，阴谋小集团的成员在走廊里窃窃私语以影响国王。"}]}],"synonyms":["Kabbalists","mystics","conspirators","plotters"],"phonetic":"/ˈkæbəˌlɪsts/","extraExplanation":["“cabalists”是复数形式，单数是“cabalist”。在宗教文化语境里，它通常指“卡巴拉（Kabbalah）”传统的研究者或修习者。","不要把“cabalist”（卡巴拉学者）和“cabal”（阴谋小集团）混为一谈：两者在英语里拼写相近，因此“cabalist”偶尔也被引申为“阴谋集团成员”，但这一用法较少见，且语境通常偏政治或讽刺。"]}
{"word":"Caball","summary":{"en":"Cabal means a secret group working together, often for power or influence.","zh":"Cabal 指为权力或影响力而秘密勾结的小集团（常含贬义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small group of people who secretly plan or work together, often to gain power or influence","zh":"（常含贬义）秘密结社；（为获取权力或影响力而）暗中勾结的小集团"},"examples":[{"en":"Some critics accused the advisers of forming a cabal to control the policy behind the scenes.","zh":"一些批评者指责这些顾问组成了一个小集团，在幕后操控政策。"},{"en":"The rumor claimed a cabal of executives was trying to push the CEO out.","zh":"传言称一群高管在暗中联手，试图把首席执行官挤走。"}]},{"partOfSpeech":"v.","definition":{"en":"to form a secret group to plan or act together (less common)","zh":"（较少见）暗中结盟；秘密策划、串通"},"examples":[{"en":"A few members caballed together to block the proposal.","zh":"几名成员暗中串通，阻止该提案。"}]}],"synonyms":["clique","conspiracy","plot","faction"],"phonetic":"/kəˈbæl/","extraExplanation":["你输入的“Caball”更常见是拼写为 **cabal**。在新闻、政治评论、历史叙述里很常用，语气通常偏负面，强调“秘密”“小圈子”“操控”。","词源来自法语/中世纪拉丁语，核心含义是“密谋、秘密团体”。","搭配提示：常见说法有 **a cabal of + 人群**（a cabal of generals/officials）、**form a cabal**（组成小集团）、**a secret cabal**（秘密小集团）。"]}
{"word":"caball","summary":{"en":"A cabal is a secret, often political group that works together to gain power or influence.","zh":"cabal 指秘密（常带政治色彩）的结盟小集团，暗中合谋以获取权力或影响力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small group of people who secretly work together to plan or influence something, often for political power","zh":"（常指为争夺政治权力而）秘密结盟的小集团；阴谋团体"},"examples":[{"en":"The report claimed a cabal was trying to control the election behind the scenes.","zh":"报告称有一个阴谋集团正在幕后操纵选举。"},{"en":"She refused to join the cabal at work that spread rumors about others.","zh":"她拒绝加入办公室里那个散布谣言的小圈子。"}]},{"partOfSpeech":"v.","definition":{"en":"to form a secret group; to plot together in secret (less common)","zh":"秘密结社；暗中合谋（较少见）"},"examples":[{"en":"A few officials cabaled to remove the manager.","zh":"几名官员暗中合谋想把经理赶下台。"}]}],"synonyms":["conspiracy","plot","clique","faction","inner circle"],"phonetic":"/kəˈbæl/","extraExplanation":["“cabal”常带负面语气，强调“秘密、操控、阴谋”。日常更常用的中性表达有 “clique（小圈子）” 或 “inner circle（核心圈）”，但它们不一定有“阴谋”含义。","历史文化小知识：17世纪英国查理二世时期曾有“Cabal Ministry（卡巴尔内阁）”，因几位大臣姓名首字母拼成 C-A-B-A-L（Clifford, Arlington, Buckingham, Ashley, Lauderdale），使这个词在政治语境里更出名。","拼写提示：你输入的 “caball” 更常见的正确拼写是 “cabal”。“Caball”也可能是人名/姓氏，但作为英语词汇通常用 “cabal”。"]}
{"word":"caballed","summary":{"en":"“Caballed” means “secretly plotted/worked together as a cabal,” and is a rare, formal word often used in political or historical contexts.","zh":"“caballed”意为“像秘密小集团那样暗中合谋/结党”，较正式且少见，多用于政治或历史语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of “cabal”: to secretly plan or work together (often for political power or advantage).","zh":"“cabal”的过去式/过去分词：秘密结党、暗中策划（常指为政治权力或利益）。"},"examples":[{"en":"A small group of officials caballed to remove the minister.","zh":"一小群官员秘密结党，试图拉下那位部长。"},{"en":"They were accused of having caballed behind closed doors.","zh":"他们被指控在幕后密谋。"}]},{"partOfSpeech":"adj.","definition":{"en":"formed into a secret faction; acting as a cabal (rare, often used in historical writing).","zh":"结成小集团的；像“秘密小集团”那样行动的（较少见，多见于历史叙述）。"},"examples":[{"en":"The caballed courtiers pushed their own candidate.","zh":"那些结成小圈子的宫廷大臣推举他们自己的人选。"}]}],"synonyms":["conspired","plotted","schemed","intrigued"],"phonetic":"/kəˈbæld/","extraExplanation":["“cabal”常带有贬义，强调“少数人”“不公开”“为私利/权力”而合谋。英语里更常见的说法是：plot / conspire / scheme（比“cabal”更日常）。","词源上与法语 cabale 有关，历史上常用于描写宫廷或政治中的小集团密谋，因此在现代英语里显得偏书面、偏历史语境。"]}
{"word":"caballer","summary":{"en":"“Caballer” is not a common modern English word; it’s usually a rare variant influenced by Spanish “caballero,” or a misspelling of “cavalier.”","zh":"“caballer”不是常见的现代英语词；多见于受西语“caballero”影响的少见拼写，或是把“cavalier”拼错。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Not standard in modern English) A rare/variant spelling seen in names or in texts influenced by Spanish, related to “caballero,” meaning a gentleman, knight, or horseman.","zh":"（现代英语中不常用/非标准）一种少见的拼写或姓名用法，常受西班牙语影响，和“caballero”相关，指“绅士、骑士或骑马的人”。"},"examples":[{"en":"In some historical documents, you may see “caballer” used as a variant for “caballero.”","zh":"在一些历史文献里，你可能会看到“caballer”被当作“caballero”的变体。"},{"en":"If you mean “knight,” the more common English word is “knight,” not “caballer.”","zh":"如果你想表达“骑士”，更常见的英语是“knight”，而不是“caballer”。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Likely intended word) If you meant “cavalier,” it describes someone who seems careless or not serious about something important.","zh":"（可能想写的词）如果你想写的是“cavalier”，它形容一个人对重要的事情显得漫不经心或不够严肃。"},"examples":[{"en":"He was cavalier about the deadline and didn’t prepare.","zh":"他对截止日期很漫不经心，没有准备。"},{"en":"She apologized for her cavalier attitude toward their concerns.","zh":"她为自己对他们担忧不够重视的态度道歉。"}]}],"synonyms":["knight","gentleman","horseman","cavalier"],"phonetic":"/ˌkæbəˈlɛr/","extraExplanation":["“caballer”更常见于西班牙语相关的语境：西班牙语 caballero = “骑士/绅士”（字面与“马”有关）。在英语里对应更自然的表达通常是 knight（骑士）、gentleman（绅士）或 horseman（骑手）。","如果你能给我一句包含“caballer”的原句或说明你想表达的意思（人名？“骑士”？还是“漫不经心”那种语气？），我可以帮你确认最合适的英文词。"]}
{"word":"caballeria","summary":{"en":"Caballería is a Spanish word meaning either “cavalry” (mounted troops) or “chivalry” (knightly honor and manners).","zh":"Caballería 是西班牙语词，可指“骑兵（骑马作战的部队）”或“骑士精神（骑士式的荣誉与礼仪）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) cavalry; a group of soldiers who fight on horseback (or, historically, mounted troops).","zh":"（西语）骑兵；（历史上）骑马作战的部队。"},"examples":[{"en":"In the film, the caballería arrives just in time to protect the village.","zh":"在电影里，骑兵及时赶到保护了村庄。"},{"en":"The general ordered the caballería to ride around the enemy’s flank.","zh":"将军命令骑兵从敌军侧翼迂回。"}]},{"partOfSpeech":"n.","definition":{"en":"(Spanish) chivalry; the ideals and polite, honorable behavior traditionally associated with knights.","zh":"（西语）骑士精神；与骑士相关的礼貌、荣誉与高尚行为准则。"},"examples":[{"en":"He spoke about caballería as a code of honor: courage, respect, and loyalty.","zh":"他把骑士精神描述为一种荣誉准则：勇气、尊重与忠诚。"},{"en":"In classic literature, caballería often shapes how a hero treats others.","zh":"在经典文学中，骑士精神常常影响英雄如何对待他人。"}]}],"synonyms":["cavalry","mounted troops","chivalry","knighthood"],"phonetic":"/ˌkɑːbəˈlɛriə/","extraExplanation":["“caballería”来自西语“caballo”（马），因此最初与“骑马的人/骑兵”紧密相关；后来也引申出“骑士精神、绅士风度”的含义。","在英语里更常见的对应词是“cavalry”（骑兵）和“chivalry”（骑士精神）。在谈西班牙/拉美历史、文学（如骑士传奇）或原文引用时，可能会直接用“caballería”。"]}
{"word":"caballero","summary":{"en":"Caballero means a gentleman (especially in Spanish-speaking contexts), and historically a Spanish knight or horseman.","zh":"Caballero 指（西语文化中的）绅士；历史上也可指西班牙骑士或骑马的贵族/骑手。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Spanish-speaking cultures) a gentleman; a polite, chivalrous man.","zh":"（在西语文化中）绅士；彬彬有礼、讲骑士风度的男士。"},"examples":[{"en":"He opened the door for her like a true caballero.","zh":"他像真正的绅士一样为她开门。"},{"en":"In the story, the caballero treats everyone with respect.","zh":"在故事里，那位绅士对每个人都很尊重。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) a Spanish knight or mounted nobleman; a horseman.","zh":"（历史）西班牙骑士或骑马的贵族；骑手。"},"examples":[{"en":"The novel describes a caballero riding across the plains.","zh":"小说描写了一位骑士策马穿越平原。"},{"en":"The painting shows a caballero in traditional dress.","zh":"这幅画描绘了一位身着传统服饰的骑士。"}]}],"synonyms":["gentleman","knight","horseman"],"phonetic":"/ˌkæbəˈjɛroʊ/","extraExplanation":["“Caballero”是西班牙语外来词，在英语里多用于描写拉丁文化背景或带有浪漫、复古的叙事氛围。","词源与西班牙语“caballo”（马）有关，早期指“骑马的人”，后来引申为“骑士/绅士”，因此常带“礼貌、风度、骑士精神”的文化联想。","在现代日常英语中更常说“gentleman”。用“caballero”会显得更具文化色彩或文学感。"]}
{"word":"caballeros","summary":{"en":"Caballeros is a Spanish plural noun meaning “gentlemen,” and in historical/literary contexts, “knights/horsemen.”","zh":"Caballeros 是西班牙语复数名词，常指“先生们”，在历史/文学语境中也可指“骑士/骑兵”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) gentlemen; a polite way to address a group of men.","zh":"（西语）“先生们”；对一群男性的礼貌称呼。"},"examples":[{"en":"Caballeros, please take your seats.","zh":"先生们，请入座。"},{"en":"The host greeted them warmly: “Buenas noches, caballeros.”","zh":"主持人热情地问候他们：“晚上好，先生们。”"}]},{"partOfSpeech":"n.","definition":{"en":"(Spanish) knights or horsemen (especially in historical or literary contexts).","zh":"（西语）骑士／骑兵（尤用于历史或文学语境）。"},"examples":[{"en":"The story describes caballeros riding across the plain.","zh":"故事描写骑士们策马穿越平原。"},{"en":"In old ballads, caballeros defend their honor.","zh":"在古老的民谣中，骑士们捍卫自己的荣誉。"}]}],"synonyms":["gentlemen","sirs","knights","horsemen"],"phonetic":"/ˌkɑbəˈjɛroʊz/","extraExplanation":["“Caballeros”是西班牙语复数形式，单数是“caballero”。词源与“caballo（马）”有关，最早指“骑马的人”，后来引申为“骑士、绅士”。","在英语里，它多见于带有西语氛围的场景（电影、歌曲、旅游、餐厅招呼等），用来营造文化语境；正式英语中更常用“gentlemen”。","注意：在西班牙语里“caballeros”也可出现在公共标识中，表示“男士/男厕所”（对应“damas/女士”）。在英语环境中看到时要结合场景判断。"]}
{"word":"caballine","summary":{"en":"Caballine means “related to horses” and is a formal, literary or technical adjective.","zh":"caballine 意为“与马有关的；似马的”，语气较正式，常用于文学或专业语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to horses; horse-like.","zh":"与马有关的；似马的。"},"examples":[{"en":"She studied caballine anatomy to better understand racehorse injuries.","zh":"她研究马的解剖结构（caballine anatomy），以更好地了解赛马的伤病。"},{"en":"In the museum, the statue’s caballine features were especially realistic.","zh":"在博物馆里，那座雕像的马类特征（caballine features）尤其逼真。"}]}],"synonyms":["equine","horse-related","horse-like"],"phonetic":"/ˈkæbəˌlaɪn/","extraExplanation":["“caballine”是比较正式/书面、偏专业的词，多见于动物学、兽医学、艺术评论或文学描写中。日常英语里更常说“equine”（马的）或直接说“horse”。","词源上与拉丁语“caballus”（马）有关。在英语中常用来营造一种古典、文学或学术的语感。"]}
{"word":"caballing","summary":{"en":"“Caballing” means secretly plotting together as a small group (a cabal), often in politics or behind-the-scenes workplace situations.","zh":"“caballing”指小圈子秘密结党、暗中策划，常用于政治或职场“幕后操作”的语境，语气多偏负面。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"secretly meeting and plotting as a small group, usually for political power or some hidden purpose (present participle/gerund of “cabal”).","zh":"（一小群人）秘密结党、暗中策划（“cabal”的现在分词/动名词），常指为权力或某种不可告人的目的。"},"examples":[{"en":"Reporters accused the advisers of caballing to remove the minister.","zh":"记者指责这些顾问暗中结党，想把部长拉下台。"},{"en":"She felt her coworkers were caballing behind her back.","zh":"她觉得同事在背后暗中串联算计她。"},{"en":"The novel describes nobles caballing in dark corridors of the palace.","zh":"小说描写贵族在宫殿阴暗的走廊里秘密结党。"}]}],"synonyms":["plotting","scheming","intriguing","conspiring","cliquing"],"phonetic":"/kəˈbælɪŋ/","extraExplanation":["“caballing”是英式拼写；美式更常见“cabaling”。两者意思相同。","词根来自“cabal（阴谋集团/秘密小圈子）”。历史上英国有“Cabal Ministry（卡巴尔内阁）”的说法（17世纪），使这个词更常带有政治阴谋色彩。","语气通常偏负面，暗示“见不得人”的小圈子操作；中性场合更常用“meeting privately / coordinating”。"]}
{"word":"Caballo","summary":{"en":"“Caballo” is a Spanish word meaning “horse,” and in chess it can also mean “knight.”","zh":"“Caballo”是西班牙语，常指“马”，在国际象棋语境中也可指“马/骑士”棋子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) a horse.","zh":"（西班牙语）马；（泛指）马匹。"},"examples":[{"en":"In Spanish, “caballo” means “horse.”","zh":"在西班牙语中，“caballo”意思是“马”。"},{"en":"El caballo corre rápido. (The horse runs fast.)","zh":"El caballo corre rápido.（这匹马跑得很快。）"}]},{"partOfSpeech":"n.","definition":{"en":"(Spanish, chess) a knight (the chess piece).","zh":"（西班牙语，国际象棋）马（骑士棋子）。"},"examples":[{"en":"In chess Spanish, “caballo” refers to the knight.","zh":"在西班牙语的国际象棋用语里，“caballo”指“马（骑士棋子）”。"},{"en":"Mueve el caballo a f3. (Move the knight to f3.)","zh":"Mueve el caballo a f3.（把马走到f3。）"}]}],"synonyms":["horse","knight (chess)"],"phonetic":"/kəˈbɑːjoʊ/","extraExplanation":["“Caballo”在西班牙语里非常常用：在日常语境通常就是“马”，在国际象棋语境中专指“马/骑士”（因为棋子形象与马有关）。","相关词：yegua（母马）、potro（小马/幼马）、jinete（骑手）。"]}
{"word":"caballo","summary":{"en":"“Caballo” is Spanish for “horse,” and in chess it can mean “knight.”","zh":"“Caballo”是西班牙语“马”的意思；在国际象棋语境中也可指“骑士（马）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) a horse.","zh":"（西班牙语）马。"},"examples":[{"en":"In the picture, there is a caballo (horse) running.","zh":"图片里有一匹caballo（马）在奔跑。"},{"en":"“Caballo” is the Spanish word for “horse.”","zh":"“Caballo”是西班牙语里“马”的意思。"}]},{"partOfSpeech":"n.","definition":{"en":"(In chess, Spanish) a knight.","zh":"（国际象棋中，西班牙语）马（=骑士，knight）。"},"examples":[{"en":"In Spanish chess notation, caballo means “knight.”","zh":"在西班牙语的国际象棋记谱里，caballo表示“骑士（马）”。"}]}],"synonyms":["horse","steed","(chess) knight"],"phonetic":"/kəˈbɑjoʊ/","extraExplanation":["“Caballo”是西班牙语名词，常见搭配：un caballo（一匹马）。复数是caballos。","西班牙语里马的“阴性”说法是yegua（母马），小马驹常说potro或potrillo（地区用法不同）。","常见短语：a caballo（骑马/在马上），caballo de mar（海马）。"]}
{"word":"caballos","summary":{"en":"“caballos” is Spanish for “horses.”","zh":"“caballos”是西班牙语，意思是“马（复数）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) plural of “caballo”; means “horses.”","zh":"（西班牙语）“caballo”的复数，意思是“马；多匹马”。"},"examples":[{"en":"Veo caballos en el campo.","zh":"我在田野里看到马。"},{"en":"Los caballos corren muy rápido.","zh":"马跑得很快。"},{"en":"Montaron caballos durante el viaje.","zh":"他们在旅途中骑马。"}]}],"synonyms":["horses","steeds"],"phonetic":"/kɑˈbɑjoʊs/","extraExplanation":["“caballo”（马）是阳性名词，复数通常把 -o 变成 -os：caballo → caballos。","在西语里也常用“los caballos”表示“这些马/那群马”（定冠词 los + 复数名词）。"]}
{"word":"cabals","summary":{"en":"Cabals means secret groups that work together to influence events, often with political or suspicious intentions.","zh":"cabals 指暗中串通、试图影响局势的秘密小集团（常带政治或阴谋色彩）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A secret group of people working together (often in politics) to influence decisions in a hidden or unfair way; a clique with covert plans.","zh":"（常指政治中的）秘密小集团；暗中串通操纵决策的派系。"},"examples":[{"en":"Some journalists accused a cabal of advisers of controlling the president’s agenda behind the scenes.","zh":"一些记者指责一小撮顾问组成的秘密集团在幕后操控总统的议程。"},{"en":"She rejected the rumor that a cabal was trying to remove the principal.","zh":"她否认了“有个秘密小集团想把校长赶下台”的谣言。"}]}],"synonyms":["clique","faction","conspiracy","inner circle"],"phonetic":"/kəˈbæl/","extraExplanation":["“cabal”常带强烈负面语气，暗示“不透明、阴谋、操控”。在严肃新闻或历史写作中出现较多；日常口语里也会用来讽刺“某个小圈子在背后做主”。","词源常被认为与17世纪英国的“Cabal Ministry”有关：当时几位大臣姓氏首字母（C-A-B-A-L）被人巧合地拼成 cabal，因此这个词逐渐和“政治小集团”联系在一起。"]}
{"word":"caban","summary":{"en":"Caban means a short, heavy wool coat, often in a navy/pea-coat style.","zh":"caban指一种短款厚羊毛外套，常见为海军风、类似豌豆大衣的款式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a short, heavy coat (often navy-style), usually made of thick wool and worn for warmth","zh":"一种短款厚外套（常见于海军风/水手风），多用厚羊毛制成，用来保暖"},"examples":[{"en":"He wore a dark caban to stay warm on the windy pier.","zh":"他穿了一件深色的短厚外套，在多风的码头上保暖。"},{"en":"A caban is similar to a pea coat, with a sturdy, practical look.","zh":"caban和豌豆大衣（pea coat）很像，外观结实、实用。"}]}],"synonyms":["pea coat","wool coat","jacket"],"phonetic":"/kəˈbæn/","extraExplanation":["“caban”在英语里是一个相对少见的服装词，更常见的对应说法是“pea coat（豌豆大衣）”。它来自法语 caban，历史上与水手、海军穿着的厚呢外套有关，因此常带有“海军风/航海风”的联想。"]}
{"word":"cabana","summary":{"en":"A cabana is a small shelter—often by a pool or beach—used for shade, changing, or relaxing; it can also mean a private seating area in a venue.","zh":"Cabana 指海滩或泳池旁的小棚屋/遮阳小屋，用于遮阳、更衣或休息；也可指场所内更私密的包厢式座位区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, simple shelter or hut, especially near a beach or pool, used for changing clothes, relaxing, or getting shade.","zh":"（尤指海滩或泳池旁的）小棚屋/遮阳小屋，用来更衣、休息或遮阳。"},"examples":[{"en":"We rented a cabana by the pool for the afternoon.","zh":"我们租了一个泳池边的小棚屋，待了一个下午。"},{"en":"She changed into her swimsuit inside the cabana.","zh":"她在小棚屋里换上了泳衣。"}]},{"partOfSpeech":"n.","definition":{"en":"A private, tent-like seating area (often with curtains) in a restaurant, club, or hotel, offering more privacy and comfort.","zh":"（餐厅、俱乐部或酒店里的）包厢式座位/带帘的半封闭座位区，提供更私密和舒适的空间。"},"examples":[{"en":"They booked a cabana at the beach club for the group.","zh":"他们在海滩俱乐部订了一个包厢式休息区给大家用。"},{"en":"Let’s sit in a cabana so we can talk more quietly.","zh":"我们坐到包厢式座位区吧，这样可以更安静地聊天。"}]}],"synonyms":["hut","shelter","shade tent","booth (venue seating)"],"phonetic":"/kəˈbænə/","extraExplanation":["“Cabana”来自西班牙语/葡萄牙语体系（与表示“棚屋、茅屋”的词有关），在英语里常带有“度假、海边、泳池、休闲”的氛围。酒店广告里常见“pool cabana / beach cabana”，有时指配有躺椅、遮阳布、毛巾服务的高端休息区。"]}
{"word":"cabanas","summary":{"en":"Cabanas are small shelters/huts at resorts, beaches, or pools (plural of cabana).","zh":"Cabanas 指度假村、海滩或泳池旁的休息小屋／遮蔽棚，是 cabana 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small, simple shelters or huts, especially at a beach, pool, or resort, used for relaxing or changing clothes (plural of “cabana”).","zh":"（cabana 的复数）小木屋／遮蔽棚，尤指海滩、泳池或度假村里的休息小屋，可用于乘凉、休息或更衣。"},"examples":[{"en":"We rented one of the cabanas by the pool for the afternoon.","zh":"我们租了泳池边的一间小屋，待了一下午。"},{"en":"The resort has private cabanas with curtains for shade.","zh":"这家度假村有带帘子的私密小屋，可以遮阳。"},{"en":"Guests can leave their towels in the cabanas while they swim.","zh":"客人游泳时可以把毛巾放在这些小屋里。"}]}],"synonyms":["huts","shelters","cabanas","booths"],"phonetic":"/kəˈbænəz/","extraExplanation":["“Cabana”在美国英语里常见于度假与休闲场景，尤其是酒店宣传中：pool cabana（泳池小屋）、beach cabana（海滩小屋）。有时不一定是真正的“木屋”，也可能是带顶棚与帘子的遮蔽座位区。","词源与西班牙语有关，带有热带／海滨度假文化的联想；因此在语气上通常偏轻松、度假风。"]}
{"word":"Cabanatuan","summary":{"en":"Cabanatuan is a city in Nueva Ecija, Philippines.","zh":"Cabanatuan是菲律宾新怡诗夏省的一座城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in the province of Nueva Ecija on Luzon island, Philippines (often called Cabanatuan City).","zh":"卡巴纳图安（Cabanatuan）：菲律宾吕宋岛新怡诗夏省的一座城市（常称“卡巴纳图安市”）。"},"examples":[{"en":"Cabanatuan is known as a major commercial center in Nueva Ecija.","zh":"卡巴纳图安是新怡诗夏省重要的商业中心。"},{"en":"We took a bus from Manila to Cabanatuan for a family visit.","zh":"我们从马尼拉坐巴士去卡巴纳图安探亲。"}]}],"synonyms":["Cabanatuan City"],"phonetic":"/ˌkɑːbəˌnɑːtuˈɑːn/","extraExplanation":["在菲律宾语境中，Cabanatuan常被称为“稻米之都/粮仓地区的重要城市”之一，因为新怡诗夏省是全国重要的稻米产区。","二战历史里，“Cabanatuan战俘营”较为知名；相关事件常出现在历史读物与纪录片中。","当地也常被美食爱好者提到，例如Nueva Ecija一带的longganisa（本地香肠）等。"]}
{"word":"cabane","summary":{"en":"Cabane means a small, simple hut or cabin, often used in French-related contexts.","zh":"cabane 指简易小屋/小棚屋，常用于带法语文化背景的语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, simple shelter or hut; a cabin (often used in French-speaking contexts).","zh":"小棚屋；简易小屋；小木屋（常见于法语语境或带法语色彩的英语用法）。"},"examples":[{"en":"They spent the night in a cabane near the lake.","zh":"他们在湖边的一间小棚屋里过夜。"},{"en":"The trail leads to a cabane used by hikers as a basic shelter.","zh":"这条小径通往一间供徒步者使用的简易避难小屋。"}]}],"synonyms":["hut","cabin","shack","shelter"],"phonetic":"/kəˈbæn/","extraExplanation":["“cabane”是法语借词，原意接近“简易棚屋/小屋”。在英语里多见于与法语地区相关的语境（如法国、魁北克、阿尔卑斯山区徒步文化等），用来营造地方感或文化氛围。","在加拿大魁北克文化中常见“cabane à sucre”（枫糖屋/枫糖小屋），指春季煮枫树汁、吃枫糖相关餐点的地方；英语里有时也直接借用这个法语短语。"]}
{"word":"Cabanis","summary":{"en":"Cabanis is usually a proper name referring to the French physician-philosopher Pierre-Jean-Georges Cabanis (1757–1808).","zh":"Cabanis 通常是专有名词，指法国医生兼哲学家卡巴尼斯（1757–1808）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Pierre-Jean-Georges Cabanis (1757–1808), a French physician and philosopher known for writings on the relationship between the mind and the body (especially in the Enlightenment period).","zh":"卡巴尼斯（Pierre-Jean-Georges Cabanis，1757–1808），法国医生与哲学家，以探讨“心灵与身体关系”（启蒙时代思想背景下）而闻名。"},"examples":[{"en":"In some histories of psychology, Cabanis is mentioned for arguing that mental life is closely tied to bodily processes.","zh":"在一些心理学史著作中，卡巴尼斯常被提及，因为他主张精神活动与身体过程密切相关。"},{"en":"The professor assigned a short reading from Cabanis to show early debates about the brain and consciousness.","zh":"教授布置了卡巴尼斯的一段短文，用来展示早期关于大脑与意识的争论。"}]}],"synonyms":["Pierre-Jean-Georges Cabanis"],"phonetic":"/ˌkæbəˈniː/","extraExplanation":["“Cabanis”在英语里通常作为专有名词出现，常指这位法国思想家本人，而不是普通词汇。","他最常被引用的观点之一常被概括为：思想与生理（尤其是大脑与神经系统）密切相关。这一思路在后来的医学与心理学讨论中经常被拿来对照。"]}
{"word":"cabaret","summary":{"en":"Cabaret is live stage entertainment—songs, dance, and comedy—usually in a small club where people can eat or drink, and it can also mean the club itself.","zh":"cabaret 指在小型俱乐部里进行的歌舞与喜剧等现场表演（常可边吃喝边观看），也可指举办这种表演的场所本身。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of live entertainment in a small venue (often with tables), featuring singing, dancing, comedy, and sometimes short dramatic acts; people usually eat or drink while watching.","zh":"一种在小型场地（常有桌位）进行的现场表演形式，通常包括歌唱、舞蹈、喜剧，有时也有短剧；观众常边吃喝边观看。"},"examples":[{"en":"We went to a cabaret after dinner and watched singers and comedians perform.","zh":"我们晚饭后去看了卡巴莱表演，欣赏歌手和喜剧演员的演出。"},{"en":"She works as a performer in a cabaret club downtown.","zh":"她在市中心的一家卡巴莱俱乐部当表演者。"}]},{"partOfSpeech":"n.","definition":{"en":"A venue or club where this kind of entertainment is performed.","zh":"上演这种表演的场所或俱乐部。"},"examples":[{"en":"The cabaret is small but famous for its late-night shows.","zh":"这家卡巴莱场地不大，但以深夜演出闻名。"},{"en":"They opened a new cabaret near the theater district.","zh":"他们在剧院区附近开了一家新的卡巴莱。"}]}],"synonyms":["revue","variety show","music hall","nightclub (sometimes)"],"phonetic":"/ˌkæbəˈreɪ/","extraExplanation":["“cabaret”源自法语，原意与“小酒馆/小房间”有关，因此常带有“边吃喝边看表演”的氛围。","在英语文化中，“cabaret”常让人联想到20世纪欧洲夜生活与舞台表演传统；也常与音乐剧《Cabaret》相关（故事背景为1930年代柏林）。","与“nightclub”相比，cabaret更强调舞台节目（歌舞、喜剧、短剧等），而不只是喝酒跳舞。"]}
{"word":"cabaretier","summary":{"en":"A cabaretier is a cabaret/nightclub performer, often a singer, comedian, or host.","zh":"cabaretier 指在卡巴萊或夜總會表演的人，常見是歌手、喜劇演員或主持人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a performer (often a singer, comedian, or host) who works in a cabaret or nightclub show; sometimes, a person who runs or presents a cabaret program","zh":"卡巴萊（夜總會/歌舞表演）演員、歌手或主持人；有時也指經營或策劃卡巴萊節目的人"},"examples":[{"en":"The cabaretier welcomed the audience with a few jokes before the first song.","zh":"這位卡巴萊主持人在第一首歌開始前先用幾個笑話歡迎觀眾。"},{"en":"She became a famous cabaretier in Paris, known for her witty lyrics.","zh":"她在巴黎成為知名的卡巴萊表演者，以機智的歌詞聞名。"},{"en":"In the film, the cabaretier performs in a small club late at night.","zh":"在電影裡，這位卡巴萊表演者在深夜於一家小俱樂部登台。"}]}],"synonyms":["cabaret performer","cabaret singer","nightclub performer","emcee","entertainer"],"phonetic":"ˌkæbəˈreɪtiɚ","extraExplanation":["這個詞多見於較正式或帶歐陸風格的語境，源自法語 cabaret（小酒館式表演場所）加上表示「從事某行業的人」的詞尾 -ier。","在現代英語中，比起 cabaretier，更常見的說法是 cabaret performer、cabaret singer，或直接說 singer/comedian/host（依情境而定）。"]}
{"word":"cabarets","summary":{"en":"Cabarets are clubs/restaurants (or shows) with live entertainment, often in an intimate nightlife setting.","zh":"Cabarets 指提供現場娛樂的餐廳／俱樂部，或指這種歌舞秀表演形式，常見於較親密的夜生活場景。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A cabaret: a restaurant or club that offers live entertainment (especially singing, dancing, comedy) while people eat or drink.","zh":"卡巴萊（歌舞表演餐廳／夜總會）：一種提供現場娛樂（常見為歌唱、舞蹈、喜劇等）的餐廳或俱樂部，人們可一邊飲食一邊觀賞表演。"},"examples":[{"en":"We went to a cabaret after dinner to watch live music and comedy.","zh":"晚餐後我們去了一家卡巴萊，看現場音樂和喜劇表演。"},{"en":"Paris is famous for its cabarets, like the Moulin Rouge.","zh":"巴黎以卡巴萊聞名，例如紅磨坊。"}]},{"partOfSpeech":"n.","definition":{"en":"A type of live performance show (the style of music and acts), often in a small venue and sometimes more intimate or daring than a traditional theater show.","zh":"卡巴萊表演／歌舞秀（表演風格）：常在較小的場地演出，氛圍更親密，有時也比傳統劇院表演更前衛或性感。"},"examples":[{"en":"She performed a cabaret set with jazz songs and playful storytelling.","zh":"她演出了一段卡巴萊節目，用爵士歌曲搭配俏皮的說故事。"},{"en":"The theater is putting on a cabaret this weekend.","zh":"這家劇院這週末要上演一場卡巴萊歌舞秀。"}]}],"synonyms":["nightclub","music hall","revue","variety show","club"],"phonetic":"/ˌkæbəˈreɪ/","extraExplanation":["“cabaret”來自法語，常讓人聯想到19～20世紀初巴黎的夜生活文化。它通常不是大型歌劇或百老匯那種「正襟危坐」的演出，而更像邊喝酒吃點心邊看表演的娛樂形式。","拼寫提醒：你輸入的“cabarets”是複數形式；單數是“cabaret”。日常也可說“a cabaret club”（卡巴萊俱樂部）。"]}
{"word":"cabas","summary":{"en":"“Cabas” means a large shopping bag or tote, often with a market/French-style feel.","zh":"“cabas”指大号购物袋或托特包，常带有法式市集风格的联想。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large, sturdy shopping bag or tote (often made of straw, canvas, or other firm material)","zh":"（通常结实耐用的）大号购物袋；手提托特包（常见材质有草编、帆布等）"},"examples":[{"en":"She carried vegetables home in a straw cabas from the market.","zh":"她用一个草编的cabas从市场把蔬菜提回家。"},{"en":"I keep a foldable cabas in my backpack for groceries.","zh":"我在背包里放一个可折叠的cabas，方便买菜用。"},{"en":"The brand released a leather cabas for everyday use.","zh":"这个品牌推出了一款适合日常使用的皮质cabas。"}]}],"synonyms":["tote bag","shopping bag","market bag","carryall"],"phonetic":"/kəˈbɑː/","extraExplanation":["“cabas”是法语借词，在英语里多见于时尚、零售或描写“市场购物袋/托特包”的语境。法语里词尾的 s 通常不发音，所以在英语中也常被读作接近“ka-BAH”的感觉。","在现代用法里，它常和 tote bag（托特包）、shopping bag（购物袋）意义重叠；但“cabas”往往带一点“法式/度假/市集”的风格联想（比如草编、厚帆布、大容量）。"]}
{"word":"cabasa","summary":{"en":"A cabasa is a handheld percussion instrument with bead chains that makes a rattling sound when shaken or twisted.","zh":"cabasa是一种手持打击乐器，外圈串珠链，摇动或旋转会发出沙沙的响声。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small percussion instrument with a handle and a loop of beaded chains that you shake or twist to make a rattling sound.","zh":"一种小型打击乐器：带手柄，外圈有串珠链，摇动或旋转时会发出沙沙的响声。"},"examples":[{"en":"The percussionist added a cabasa to give the song a soft, sandy rhythm.","zh":"打击乐手加入了cabasa，让歌曲多了一种柔和、像沙粒一样的节奏感。"},{"en":"Shake the cabasa gently on the off-beats.","zh":"在弱拍上轻轻摇动cabasa。"}]}],"synonyms":["shaker","rattle (instrument)","percussion instrument"],"phonetic":"/kəˈbɑːsə/","extraExplanation":["Cabasa常见于拉丁音乐、流行乐与爵士乐的打击乐配置中，声音介于沙锤（maracas）和刮瓜（güiro）之间。","有时你会看到拼写为“kabasa”，但“cabasa”更常用。"]}
{"word":"cabasset","summary":{"en":"A cabasset is a light metal helmet used by European soldiers in the 16th–17th centuries.","zh":"cabasset 指16—17世纪欧洲士兵常用的一种较轻的金属头盔。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of light metal helmet (often with a rounded or slightly pointed crown), worn especially by soldiers in the 1500s–1600s in Europe.","zh":"一种较轻的金属头盔（顶部常为圆形或略尖），主要流行于16—17世纪欧洲士兵使用。"},"examples":[{"en":"The museum displayed a cabasset beside swords and other armor from the 1600s.","zh":"博物馆展出了一顶cabasset（铁盔），旁边还有17世纪的剑和其他盔甲。"},{"en":"In the historical film, the guards wear cabassets instead of modern-style helmets.","zh":"在那部历史电影里，卫兵戴的是cabasset，而不是现代样式的头盔。"}]}],"synonyms":["helmet","morion","headpiece"],"phonetic":"/ˌkæbəˈsɛt/","extraExplanation":["词源背景：cabasset 来自法语 cabasset，与西班牙语 capacete、意大利语 capacete 等词有关，整体都与“头盔/头部护具”这一概念相关。","文化与语境：这个词多见于历史写作、博物馆说明、角色扮演（re-enactment）、军事史或盔甲研究中；日常英语里更常用 helmet。"]}
{"word":"cabassou","summary":{"en":"A cabassou is a type of naked-tailed armadillo from Central and South America.","zh":"cabassou 指一种中南美洲的裸尾犰狳。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a naked-tailed armadillo (genus Cabassous) found in Central and South America; a small, burrowing mammal with a hard armored shell","zh":"（无尾）裸尾犰狳；分布于中南美洲的一类小型掘洞哺乳动物，背部有坚硬甲壳"},"examples":[{"en":"The cabassou spends much of its time underground, digging for insects.","zh":"裸尾犰狳大部分时间待在地下，挖掘寻找昆虫。"},{"en":"In some regions, people may confuse a cabassou with other armadillos.","zh":"在一些地区，人们可能会把裸尾犰狳和其他犰狳混淆。"}]}],"synonyms":["armadillo","naked-tailed armadillo","Cabassous"],"phonetic":"/ˌkæbəˈsuː/","extraExplanation":["“cabassou”在英语里比较少见，多用于动物学或自然纪录片语境；更常见的说法是用属名/学名“Cabassous”（裸尾犰狳属）或直接说“(naked-tailed) armadillo（裸尾）犰狳”。","发音上常见重音落在最后一部分，读起来像“cab-a-SOO”。"]}
{"word":"Cabassous","summary":{"en":"Cabassous is a genus of armadillos, commonly called naked-tailed armadillos.","zh":"Cabassous 指无尾甲（裸尾犰狳）属，是一类犰狳的属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of South and Central American armadillos known as naked-tailed armadillos.","zh":"（生物）无尾甲（也叫裸尾犰狳）属：一种生活在中美洲与南美洲的犰狳类动物属。"},"examples":[{"en":"Cabassous species are often called naked-tailed armadillos because their tails have fewer bony plates.","zh":"Cabassous 属的动物常被称为“裸尾犰狳”，因为它们的尾巴上骨质甲片较少。"},{"en":"The wildlife guide mentioned Cabassous as a nocturnal armadillo that digs for insects.","zh":"野生动物指南提到 Cabassous 是夜行性的犰狳，会挖掘寻找昆虫。"}]}],"synonyms":["naked-tailed armadillo (genus)","Cabassous (scientific genus name)"],"phonetic":"/ˌkæbəˈsuːs/","extraExplanation":["“Cabassous”是拉丁化的动物学属名，常见于科普书、动物志与学术文章中；日常英语里更常用的是“naked-tailed armadillo（裸尾犰狳）”。","分类上它属于贫齿总目（Xenarthra）中的犰狳类；不同物种分布在中美洲与南美洲的多种栖息地，行为上多为独居、善挖洞、以昆虫等为食。"]}
{"word":"Cabazon","summary":{"en":"Cabazon is a place name in Southern California, also used in the name of a local federally recognized tribe.","zh":"Cabazon 是美国南加州的地名，也常出现在当地一支联邦承认部族的名称中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small community (CDP) in Riverside County, Southern California, located along Interstate 10 between Palm Springs and Beaumont/Banning.","zh":"美国加利福尼亚州南部河滨县的一个小社区（人口普查指定地区），位于10号州际公路沿线，介于棕榈泉与博蒙特/班宁之间。"},"examples":[{"en":"We stopped in Cabazon for gas on our drive from Los Angeles to Palm Springs.","zh":"我们从洛杉矶开去棕榈泉的路上，在Cabazon停下来加油。"},{"en":"Cabazon is known for its roadside dinosaur statues near the freeway.","zh":"Cabazon因高速公路旁的恐龙雕像而出名。"}]},{"partOfSpeech":"n.","definition":{"en":"in Native American contexts, the name associated with the Cabazon Band of Mission Indians, a federally recognized tribe in the same area.","zh":"在美洲原住民语境中，指与当地“卡巴松传教印第安人部族”（Cabazon Band of Mission Indians，一支联邦承认的部族）相关的名称。"},"examples":[{"en":"The Cabazon Band of Mission Indians operates major businesses in the region.","zh":"Cabazon Band of Mission Indians在该地区经营着重要产业。"}]}],"phonetic":"/ˈkæbəˌzɑn/","extraExplanation":["Cabazon 常被旅行者记住的文化地标是“Cabazon Dinosaurs”（路边巨型恐龙雕像），常出现在美国公路文化与电影/音乐视频的取景中。","词形看起来像西班牙语；在西班牙语里 cabazón 可表示“（口语）大头/大脑袋”，但地名的实际来源通常与当地历史与族群（含原住民与早期定居者）相关，日常使用时一般直接当作地名专有名词。"]}
{"word":"cabbage","summary":{"en":"Cabbage is a leafy round vegetable; informally, it can also mean money.","zh":"cabbage 常指卷心菜/甘蓝；在非正式口语中也可指“钱”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a round vegetable with large green or purple leaves, often eaten raw in salads or cooked in soups and stir-fries","zh":"卷心菜；甘蓝（一种圆形蔬菜，叶片大，绿色或紫色，可生吃做沙拉，也可煮汤、炒食）"},"examples":[{"en":"We made coleslaw with shredded cabbage and carrots.","zh":"我们用切丝的卷心菜和胡萝卜做了凉拌卷心菜（coleslaw）。"},{"en":"Add the cabbage near the end so it stays a little crisp.","zh":"卷心菜快出锅时再放，这样还能保持一点脆感。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) money, especially cash","zh":"（非正式）钱；现金"},"examples":[{"en":"He made a lot of cabbage working weekends.","zh":"他周末加班赚了不少钱。"}]}],"synonyms":["green cabbage","red cabbage","cash (slang meaning)"],"phonetic":"/ˈkæb.ɪdʒ/","extraExplanation":["“Cabbage”作“钱”多见于口语和俚语场景，语气随意；正式写作中一般不用。","常见搭配：cabbage soup（卷心菜汤）、cabbage rolls（卷心菜卷）、red cabbage（紫甘蓝）、Napa cabbage（大白菜/白菜的一种，英文里常这样区分）。"]}
{"word":"cabbage-like","summary":{"en":"“Cabbage-like” means resembling a cabbage in appearance or smell.","zh":"“cabbage-like”表示“像卷心菜的”，可指外观相似或气味相似。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a cabbage in shape, color, texture, or smell (often describing plants, leaves, or sometimes a strong vegetable odor).","zh":"像卷心菜的；具有卷心菜的形状、颜色、质地或气味（常用于形容植物、叶片，有时也指明显的蔬菜气味）。"},"examples":[{"en":"The plant has cabbage-like leaves that form a tight rosette near the ground.","zh":"这种植物有卷心菜状的叶子，在地面附近形成紧密的莲座状。"},{"en":"A cabbage-like smell filled the kitchen after the vegetables were boiled too long.","zh":"蔬菜煮得太久后，厨房里弥漫着一股卷心菜似的味道。"},{"en":"In the market, we saw a cabbage-like green that cooks well in soups.","zh":"在市场上，我们看到一种像卷心菜的青菜，很适合煮汤。"}]}],"synonyms":["cabbagey","cabbage-scented","cabbage-shaped","cabbage-like in appearance"],"phonetic":"/ˈkæbɪdʒ laɪk/","extraExplanation":["英语里“-like”表示“像……一样/具有……特征”，常用来造形容词：childlike（孩子般的）、snake-like（像蛇的）、cabbage-like（像卷心菜的）。在写作中，这类词多用于外观描写（leaf/shape/color）或气味描写（smell/odor）。"]}
{"word":"cabbaged","summary":{"en":"“Cabbaged” is an informal adjective meaning extremely tired or mentally foggy; in UK slang it can also mean “stolen.”","zh":"“cabbaged”多作非正式形容词，表示累到发木/脑子不清醒；在英式俚语中也可指“被偷走的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) Very tired, mentally drained, or unable to think clearly.","zh":"（非正式）精疲力尽的；脑子发木、反应迟钝的。"},"examples":[{"en":"After the red-eye flight, I was completely cabbaged and could barely focus.","zh":"坐完红眼航班后，我整个人都累瘫了，几乎无法集中注意力。"},{"en":"I tried to study, but my brain felt cabbaged after a long shift.","zh":"我想学习，但上了很久的班后脑子发木，怎么也转不动。"}]},{"partOfSpeech":"adj.","definition":{"en":"(UK informal) Stolen; taken (from “to cabbage” = to steal).","zh":"（英式俚语）被偷走的；被顺手拿走的（源自动词 to cabbage＝偷）。"},"examples":[{"en":"My lunch went missing—someone’s cabbaged it again.","zh":"我的午饭不见了——又被人顺手拿走了。"},{"en":"He realized his phone had been cabbaged while he was on the bus.","zh":"他发现自己在公交车上手机被偷了。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “cabbage” (to make or form into a cabbage-like head; less common in everyday English).","zh":"“cabbage”的过去式/过去分词（使结成卷心菜状的球/叶球；日常中较少用）。"},"examples":[{"en":"By late summer, the leaves had cabbaged into tight heads.","zh":"到夏末时，叶子已经结成紧实的菜球。"}]}],"synonyms":["exhausted","wiped out","drained","burned out","foggy","stolen (UK slang)"],"phonetic":"/ˈkæbɪdʒd/","extraExplanation":["“cabbaged＝累到像‘卷心菜’一样瘫着”这种感觉在口语里比较形象，常见于英式/澳式英语的随意表达；在美式英语中更常说 exhausted, wiped out, drained。","英式俚语里 to cabbage 表示“顺手牵羊/偷拿”，可能和“把东西像菜一样抱走”这种形象联想有关；正式场合不建议使用。"]}
{"word":"cabbagehead","summary":{"en":"“Cabbagehead” is a slang insult meaning a very stupid person.","zh":"“cabbagehead”是俚语侮辱词，意思是“很蠢的人/笨蛋”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, insulting) A very stupid or foolish person; an idiot.","zh":"（俚语，侮辱性）很蠢的人；笨蛋；白痴。"},"examples":[{"en":"Stop acting like a cabbagehead and read the instructions first.","zh":"别像个笨蛋一样，先把说明书读清楚。"},{"en":"He forgot his keys again—what a cabbagehead.","zh":"他又忘带钥匙了——真是个笨蛋。"}]}],"synonyms":["idiot","moron","dumbass","blockhead","airhead"],"phonetic":"/ˈkæbɪdʒˌhɛd/","extraExplanation":["这是带有贬义的口语辱骂词，语气类似于“idiot / dumbass”。在正式场合、职场或不熟的人之间通常不建议使用。","构词很直观：cabbage（卷心菜）+ head（脑袋），暗示“脑子像菜一样”，属于形象化的侮辱说法。不同地区/人群使用频率不高，但含义容易被理解。"]}
{"word":"cabbageheaded","summary":{"en":"Cabbageheaded means “very stupid” (a rude, informal insult).","zh":"cabbageheaded 指“很蠢、很笨”（非正式且带侮辱性的说法）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal, insulting) Stupid; slow to understand; acting like you have an “empty head.”","zh":"（非正式，侮辱性）愚蠢的；反应迟钝的；像“脑子空空”一样。"},"examples":[{"en":"Stop being so cabbageheaded and listen to the instructions.","zh":"别这么蠢了，听清楚说明。"},{"en":"He made a cabbageheaded mistake on a very simple question.","zh":"他在一个很简单的问题上犯了个很蠢的错误。"}]}],"synonyms":["stupid","dumb","blockheaded","boneheaded","thickheaded"],"phonetic":"/ˈkæbɪdʒˌhɛdɪd/","extraExplanation":["这是一个带贬义的口语骂人词，语气粗鲁，最好避免对真人使用（尤其在正式场合、工作或学校里）。","构词上是“cabbage（卷心菜）+ headed（…脑袋的）”，用“像菜一样”的夸张比喻来表达“脑子不灵光”。在英语里类似的侮辱表达还有：\"blockheaded\"（木头脑袋）、\"boneheaded\"（蠢的）。"]}
{"word":"cabbageheadedness","summary":{"en":"A rare, humorous noun meaning extreme dullness or stupidity.","zh":"一个罕见、偏幽默的名词，表示“非常迟钝或愚蠢的状态”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state of being very dull, slow to understand, or foolish (often used humorously or as an insult).","zh":"（常带幽默或侮辱意味）愚钝、反应迟钝、傻乎乎的状态。"},"examples":[{"en":"He stared at the instructions with total cabbageheadedness and still couldn’t start the machine.","zh":"他一脸茫然地盯着说明书，愚钝得还是不知道怎么启动机器。"},{"en":"She apologized for her “cabbageheadedness” after forgetting the meeting time again.","zh":"她又一次忘了开会时间后，为自己的“犯傻/迟钝”道了歉。"}]}],"synonyms":["stupidity","dullness","slow-wittedness","boneheadedness","dim-wittedness"],"phonetic":"/ˈkæbɪdʒˌhɛdɪdnəs/","extraExplanation":["这是一个非常少见、带玩笑感的词，由辱称“cabbage-head”（像卷心菜一样的脑袋＝没脑子/木讷）+ 名词后缀“-ness”构成，表示“这种愚钝的状态”。","语气通常不正式，可能显得刻薄；若用于自嘲（比如“my cabbageheadedness”）会更柔和。"]}
{"word":"cabbagelike","summary":{"en":"“Cabbagelike” means “resembling a cabbage,” especially in a round, layered, tightly packed form.","zh":"“cabbagelike”表示“像卷心菜一样的”，常指圆团状、层层包裹、叶片紧密的形态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a cabbage in appearance, shape, texture, or layered structure.","zh":"像卷心菜（包菜）一样的；在外观、形状、质地或层层结构上类似卷心菜的。"},"examples":[{"en":"The plant forms a cabbagelike head of tightly packed leaves.","zh":"这种植物会长出一个像卷心菜一样、叶片紧密包裹的菜头。"},{"en":"Its cabbagelike layers help protect the inner leaves from cold weather.","zh":"它像卷心菜一样的层层叶片有助于保护里面的嫩叶免受寒冷影响。"}]}],"synonyms":["cabbage-like","cabbagey","layered","tightly packed"],"phonetic":"/ˈkæbɪdʒˌlaɪk/","extraExplanation":["“cabbagelike”由“cabbage（卷心菜/包菜）+ -like（像……一样）”组成，常见于园艺、植物学或烹饪描写中，用来形容外形或结构“像卷心菜那样一层层包裹、团状”的东西。","日常口语里更常说“like a cabbage”或用更具体的形容词（如“layered”“tightly packed”）来表达相同意思。"]}
{"word":"cabbages","summary":{"en":"“Cabbages” is the plural of “cabbage,” a round leafy vegetable often used in salads and cooked dishes.","zh":"“cabbages”是“cabbage”的复数，指卷心菜/甘蓝，一种常用于沙拉或烹饪的球形叶类蔬菜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A cabbage: a round, leafy vegetable with thick green or purple leaves, often eaten cooked or raw.","zh":"卷心菜；甘蓝：一种圆形的叶类蔬菜，叶片厚实，可绿色或紫色，常生吃或熟吃。"},"examples":[{"en":"We bought cabbages, carrots, and onions for soup.","zh":"我们买了卷心菜、胡萝卜和洋葱来做汤。"},{"en":"She sliced the cabbage thinly for coleslaw.","zh":"她把卷心菜切得很薄来做凉拌卷心菜（coleslaw）。"}]},{"partOfSpeech":"n.","definition":{"en":"The plant that produces cabbages (Brassica oleracea), grown as a crop.","zh":"甘蓝植物；卷心菜植株：可作为作物种植、结出卷心菜的植物。"},"examples":[{"en":"Cabbages grow best in cool weather.","zh":"卷心菜在凉爽的天气里长得最好。"}]}],"synonyms":["cabbage (plural form)","green cabbage","red cabbage"],"phonetic":"/ˈkæbɪdʒ/","extraExplanation":["“cabbage”在英式英语里也常指同科蔬菜的统称或某些“球形叶菜”，但在美式英语中最常见就是指卷心菜本身。","与饮食文化相关：美国常见做法有 coleslaw（凉拌卷心菜）、corned beef and cabbage（腌牛肉配卷心菜，常与圣帕特里克节相关）。"]}
{"word":"cabbagetown","summary":{"en":"Cabbagetown is a neighborhood name, especially a historic area in Toronto; the name is linked to working-class history.","zh":"Cabbagetown是一个社区地名，尤指多伦多的历史街区；其名称与早期工人阶层/贫困历史相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a neighborhood name; most commonly, Cabbagetown is a historic residential area in Toronto, Canada, known for its Victorian-era houses and its past as an immigrant, working-class district.","zh":"一个社区/街区名称；最常见的用法是指加拿大多伦多的“Cabbagetown（白菜镇）”，以维多利亚时期住宅闻名，也因早期移民与工人阶层历史而知名。"},"examples":[{"en":"We spent the afternoon walking through Cabbagetown to see the old Victorian homes.","zh":"我们下午在Cabbagetown散步，去看那些古老的维多利亚式房子。"},{"en":"She moved to Cabbagetown because it’s close to downtown Toronto but still feels quiet.","zh":"她搬到Cabbagetown，因为那里离多伦多市中心很近，但仍然很安静。"}]},{"partOfSpeech":"n.","definition":{"en":"(also used elsewhere) a place-name for a neighborhood that once had a poor or working-class reputation—linked to the idea of people being so poor they grew cabbage in their yards.","zh":"（也可指其他地方的同名社区）一种带有历史色彩的地名，常与“曾经贫穷/工人阶层聚居”的印象相关——据说源于人们在院子里种白菜以维持生活的说法。"},"examples":[{"en":"There’s also a Cabbagetown in Atlanta with its own history and community vibe.","zh":"亚特兰大也有一个叫Cabbagetown的社区，有自己独特的历史和社区氛围。"},{"en":"In some cities, a “Cabbagetown” label reflected an area’s working-class roots.","zh":"在一些城市里，“Cabbagetown”这个称呼反映了某个地区的工人阶层根源。"}]}],"synonyms":["(proper noun) Cabbagetown (Toronto)","(proper noun) Cabbagetown (Atlanta)"],"phonetic":"/ˈkæbɪdʒˌtaʊn/","extraExplanation":["“Cabbagetown”在英语里通常是专有名词（地名），写作要大写。不同城市可能都有同名社区，但最常被提到的是多伦多的Cabbagetown。","名称的由来常被解释为早期居民生活拮据，会在自家小院种卷心菜（cabbage）；因此这个地名带有历史与社会阶层记忆。如今许多叫Cabbagetown的地区已发展为更受欢迎的居住区，语气通常是中性或带一点怀旧感。"]}
{"word":"cabbagewood","summary":{"en":"Cabbagewood is a regional common name for certain trees with a cabbage-like smell, and it can also mean the wood from those trees.","zh":"Cabbagewood 是某些带“卷心菜味”树木的地方俗名，也可指这些树的木材。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tree with strong-smelling leaves (often described as cabbage-like), found in some tropical/subtropical regions; the name can refer to different species in different places.","zh":"（在一些热带/亚热带地区生长的）一种叶子有强烈气味、常被形容为“像卷心菜味”的树；不同地区可能指不同树种。"},"examples":[{"en":"In the coastal forest, cabbagewood trees grew in sandy soil.","zh":"在海岸森林里，cabbagewood 树生长在沙质土壤中。"},{"en":"Local guides pointed out a cabbagewood and explained its traditional uses.","zh":"当地向导指着一棵 cabbagewood，讲解它的传统用途。"}]},{"partOfSpeech":"n.","definition":{"en":"the timber (wood) obtained from a cabbagewood tree, used for building or woodworking in some regions.","zh":"cabbagewood 树的木材（木料）；在一些地区用于建造或木工制作。"},"examples":[{"en":"The fence posts were made from cabbagewood because it was easy to work with.","zh":"栅栏柱子用 cabbagewood 木材做的，因为它比较容易加工。"},{"en":"Older houses in the area sometimes used cabbagewood in framing.","zh":"该地区一些老房子有时会用 cabbagewood 做框架材料。"}]}],"synonyms":["cabbage tree (regional)","cabbagewood timber (contextual)"],"phonetic":"/ˈkæbɪdʒˌwʊd/","extraExplanation":["“cabbagewood”是地方性很强的俗名，不同国家/地区可能指不同树种（例如澳大利亚、加勒比地区等都有各自的“cabbagewood”）。阅读时如果涉及植物学或木材用途，最好结合上下文或查具体学名（Latin name）来确认。","它属于“常见名（common name）”的用法：名字来自气味、外观或用途，而不是严格的科学分类；所以同名异物的情况比较常见。"]}
{"word":"cabbageworm","summary":{"en":"A cabbageworm is a green caterpillar that eats cabbage-family plants and can damage gardens and crops.","zh":"cabbageworm 指啃食卷心菜等十字花科植物、会危害菜园和农作物的绿色毛虫（幼虫）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small green caterpillar (the larva of certain white butterflies or moths) that eats cabbage and other plants in the cabbage family, often damaging crops","zh":"菜青虫；甘蓝虫（某些粉蝶或蛾类的幼虫，常啃食卷心菜等十字花科植物，造成作物受害）"},"examples":[{"en":"Cabbageworms can quickly ruin a patch of kale if you don’t notice them early.","zh":"如果不及早发现，菜青虫很快就会把一片羽衣甘蓝啃坏。"},{"en":"The gardener picked cabbageworms off the leaves by hand.","zh":"园丁用手把叶子上的菜青虫摘掉。"}]}],"synonyms":["cabbage caterpillar","cabbage white larva"],"phonetic":"/ˈkæbɪdʒˌwɝm/","extraExplanation":["“cabbageworm”通常泛指会啃食十字花科蔬菜的绿色毛虫，日常园艺语境里最常见的是“菜粉蝶（cabbage white）”的幼虫。家庭菜园里常用防虫网、人工捉虫或生物防治（如Bt制剂）来减少危害。"]}
{"word":"cabbagey","summary":{"en":"Cabbagey means smelling, tasting, or being strongly like cabbage, or containing a lot of cabbage.","zh":"cabbagey 指“有卷心菜味/像卷心菜的”，也可指“含有很多卷心菜的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of food, smell, or taste) like cabbage; having a strong cabbage-like smell or flavor.","zh":"（食物、气味或味道）像卷心菜的；带有明显卷心菜气味或味道的。"},"examples":[{"en":"The kitchen smelled cabbagey after we boiled the vegetables.","zh":"我们把蔬菜煮过后，厨房闻起来有股卷心菜味。"},{"en":"These leftovers taste a bit cabbagey—maybe they’ve been in the fridge too long.","zh":"这些剩菜吃起来有点卷心菜味——可能在冰箱里放太久了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Made with cabbage, or containing a lot of cabbage.","zh":"用卷心菜做的；含有很多卷心菜的。"},"examples":[{"en":"I ordered a cabbagey salad with extra vinegar.","zh":"我点了一份卷心菜很多的沙拉，还加了醋。"},{"en":"The soup was simple and cabbagey, but comforting on a cold day.","zh":"这汤很简单，卷心菜味很重，但在冷天里很暖胃。"}]}],"synonyms":["cabbage-like","vegetal","sulfurous","brassica-like"],"phonetic":"/ˈkæbɪdʒi/","extraExplanation":["“cabbagey”来自名词“cabbage（卷心菜）”加形容词后缀“-y”，表示“有……的味道/特征”（类似“fishy”“garlicky”）。它常用于描述煮过的十字花科蔬菜（如卷心菜、花椰菜）产生的气味或味道，语气多为中性到略带吐槽。"]}
{"word":"cabbaging","summary":{"en":"Cabbaging is the act of secretly taking small things—especially leftover fabric scraps in tailoring contexts.","zh":"cabbaging 指偷偷拿走小东西，尤其可指在裁缝/服装行业拿走布料边角料的行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, usually disapproving) Stealing or secretly taking small items, money, or materials that don’t belong to you.","zh":"（非正式，常带贬义）顺手牵羊、偷偷拿走不属于自己的小东西/钱/材料。"},"examples":[{"en":"He got fired for cabbaging office supplies.","zh":"他因为顺手拿走办公用品而被解雇。"},{"en":"Stop cabbaging snacks from your roommate’s shelf.","zh":"别再从室友的架子上偷拿零食了。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially in clothing/textile work) Taking leftover fabric pieces (“cabbage”) from cutting or sewing—sometimes allowed as perks, sometimes treated as theft.","zh":"（尤指裁缝/服装纺织行业）拿走裁剪或缝制剩下的布料碎片（称为“cabbage/边角料”）——有时是福利，有时会被视为偷拿。"},"examples":[{"en":"The tailor was accused of cabbaging fabric scraps from the shop.","zh":"那位裁缝被指控从店里拿走布料边角料。"},{"en":"In some workshops, cabbaging used to be tolerated as a small benefit.","zh":"在一些作坊里，过去拿走边角料曾被默许当作小福利。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of taking or collecting something bit by bit; a “helping yourself” habit (less common).","zh":"一点点地拿走或收集东西的行为；有点“顺手就拿”的习惯（较少见）。"},"examples":[{"en":"Her cabbaging of freebies at events became a running joke.","zh":"她在活动上不停拿赠品的习惯成了大家的笑梗。"}]}],"synonyms":["pilfering","swiping","nicking","stealing","pinching"],"phonetic":"/ˈkæbɪdʒɪŋ/","extraExplanation":["“cabbaging”来自动词“to cabbage”，在英式英语里常与裁缝行业相关：过去有些裁缝会把裁剪后剩下的布料边角料带走，这些碎料就被叫作“cabbage”。因此“cabbaging”既可指行业里带走边角料的做法，也可引申为偷偷拿走小东西。语气通常不太正面。"]}
{"word":"cabbagy","summary":{"en":"Cabbagy means cabbage-like, especially in smell or taste (informal).","zh":"cabbagy 指“像卷心菜的”，尤指气味或味道像卷心菜（非正式）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Informal) Like cabbage in smell, taste, or appearance; having a strong cabbage-like odor.","zh":"（非正式）像卷心菜的；带有卷心菜般的气味/味道/外观，常指气味较重。"},"examples":[{"en":"After it sat in the fridge for a week, the soup tasted a bit cabbagy.","zh":"在冰箱里放了一周后，这汤尝起来有点卷心菜味。"},{"en":"The kitchen smelled cabbagy after we boiled cabbage.","zh":"我们煮了卷心菜以后，厨房里有一股卷心菜味。"},{"en":"This salad is fresh, but the dressing makes it slightly cabbagy.","zh":"这沙拉很新鲜，但这个酱汁让它带一点卷心菜味。"}]}],"synonyms":["cabbage-like","vegetal","cruciferous-like"],"phonetic":"/ˈkæbɪdʒi/","extraExplanation":["“cabbagy”是由“cabbage（卷心菜）+ -y”构成的形容词，-y 常表示“有……特征/味道/样子”（如 fishy、smoky）。","它多用于口语或轻松的语境，常带一点主观感受：可能只是“有点像卷心菜”，也可能暗示“气味比较冲”。"]}
{"word":"cabbala","summary":{"en":"Cabbala (more commonly spelled Kabbalah) refers to Jewish mystical teachings; more loosely, it can mean a secret system of knowledge.","zh":"cabbala（更常写作 Kabbalah）指犹太教的神秘主义教义；引申也可指一套秘传或神秘的知识体系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Jewish mysticism (also spelled “Kabbalah”): a tradition of spiritual teachings that tries to explain the nature of God, the universe, and the soul, often through symbolic interpretation of sacred texts.","zh":"（亦作 Kabbalah）卡巴拉：犹太教神秘主义传统，通过对经典的象征性解读来理解上帝、宇宙与灵魂等问题。"},"examples":[{"en":"She took a university course on the Cabbala and medieval Jewish thought.","zh":"她在大学里选修了关于卡巴拉与中世纪犹太思想的课程。"},{"en":"In some writings on the Cabbala, numbers and letters are treated as symbols with spiritual meaning.","zh":"在一些卡巴拉著作中，数字和字母被视为具有灵性意义的象征。"}]},{"partOfSpeech":"n.","definition":{"en":"A secret or mysterious body of teachings; hidden knowledge (used more broadly and sometimes loosely).","zh":"（引申义）神秘学说；秘传知识（更宽泛的用法，有时较为宽松或非严格）。"},"examples":[{"en":"To outsiders, the group’s rules felt like a kind of cabbala.","zh":"在外人看来，这个团体的规矩像是一套秘传学说。"},{"en":"The novel hints at a cabbala of symbols behind everyday events.","zh":"小说暗示日常事件背后存在一套象征体系的“秘传”。"}]}],"synonyms":["Kabbalah","Jewish mysticism","mysticism","esotericism","secret doctrine"],"phonetic":"/kəˈbɑːlə/","extraExplanation":["“Cabbala”是较旧或较少见的拼写；现代英语中更常写作“Kabbalah”。在学术语境里，两者通常指同一传统，但拼写选择可能反映年代、译法或出版习惯。","大写“Cabbala/Kabbalah”多指犹太教的卡巴拉传统；小写“cabbala/kabbalah”更容易被用来泛指“神秘的体系/暗号式的知识”。","文化提示：在流行文化中“Kabbalah”有时被简化成“神秘学/灵修课程”，但在犹太传统中它有明确的宗教与历史背景。使用时注意语境，避免把它当作泛泛的“魔法”或刻板印象。"]}
{"word":"cabbalah","summary":{"en":"Cabbalah (more commonly spelled Kabbalah) is Jewish mysticism; it can also refer to modern popularized versions of it.","zh":"Cabbalah（更常写作 Kabbalah）指犹太神秘主义传统；也可指其现代通俗化的版本。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a form of Jewish mysticism and spiritual teaching that interprets the Hebrew Bible in symbolic ways and explores the nature of God, creation, and the soul","zh":"犹太神秘主义与灵修传统的一种，常以象征方式解读《希伯来圣经》，探讨上帝、宇宙创造与灵魂等主题"},"examples":[{"en":"He took a class on Kabbalah to understand Jewish mystical traditions.","zh":"他上了一门卡巴拉课程，以了解犹太神秘传统。"},{"en":"Some medieval texts of Kabbalah describe a spiritual “tree of life.”","zh":"一些中世纪的卡巴拉文本描述了灵性的“生命之树”。"}]},{"partOfSpeech":"n.","definition":{"en":"a modern, popularized version of Kabbalah used in self-help or spiritual movements (often not strictly traditional)","zh":"卡巴拉的现代通俗化版本，常出现在自我成长或灵修潮流中（通常不完全等同于传统教义）"},"examples":[{"en":"She encountered Kabbalah through a contemporary spiritual community.","zh":"她通过一个当代灵修社群接触到卡巴拉。"},{"en":"Be careful: popular Kabbalah and traditional Jewish Kabbalah can differ a lot.","zh":"要注意：通俗卡巴拉与传统犹太卡巴拉可能差异很大。"}]}],"synonyms":["Kabbalah","Cabala","Jewish mysticism"],"phonetic":"/kəˈbɑːlə/","extraExplanation":["“cabbalah”是“kabbalah”的一种较少见的拼写。英语里更常见的写法是 Kabbalah（也可见 Cabala）。","词源来自希伯来语 קַבָּלָה（qabbālāh），大意为“接受、传承”。因此它也带有“口传/传统”的意味。","文化语境上，Kabbalah 属于犹太宗教与思想传统的一部分；在谈论或学习时，区分“传统犹太卡巴拉”与“现代流行化版本”，通常更准确也更尊重语境。"]}
{"word":"cabbalahs","summary":{"en":"“Cabbalahs” is the plural of cabbalah/Kabbalah, referring mainly to Jewish mystical traditions; sometimes it’s used more generally for different secret or esoteric systems.","zh":"“cabbalahs”是 cabbalah/Kabbalah 的复数，主要指犹太教的卡巴拉神秘传统；有时也可泛指不同的秘传/神秘教义体系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of cabbalah (also spelled Kabbalah): a Jewish mystical tradition that explores the hidden meaning of the Torah and the nature of God and the universe.","zh":"cabbalah 的复数（也写作 Kabbalah）：犹太教的神秘主义传统，探讨《妥拉》的隐秘意义以及上帝与宇宙的本质。"},"examples":[{"en":"The course introduced different cabbalahs and how they influenced Jewish spiritual life.","zh":"这门课程介绍了不同的卡巴拉传统，以及它们如何影响犹太人的灵性生活。"},{"en":"Some readers become interested in cabbalahs through modern books on Jewish mysticism.","zh":"一些读者通过关于犹太神秘主义的现代书籍开始对卡巴拉传统感兴趣。"}]},{"partOfSpeech":"n.","definition":{"en":"(By extension, less common) Different systems of secret or esoteric teachings within a group or movement.","zh":"（引申义，较少见）某个团体或运动内部不同的秘密学说/神秘教义体系。"},"examples":[{"en":"The novel imagines rival cabbalahs competing for influence in the city.","zh":"这部小说想象了互相竞争的不同“秘传教义体系”在城市中争夺影响力。"}]}],"synonyms":["Kabbalahs","Jewish mystic traditions","esoteric teachings"],"phonetic":"/kəˈbɑləz/","extraExplanation":["“Cabbalah”与更常见的拼写“Kabbalah”指同一传统；英语里“Kabbalah”更常用，尤其在学术与出版中。","使用该词时建议保持文化尊重：它与犹太宗教与历史密切相关，不仅仅是“神秘学”或“算命”。如果是在泛指“秘传学说”，语境最好明确，避免把宗教传统随意泛化。"]}
{"word":"cabbalas","summary":{"en":"“Cabbalas” is the plural of “cabbala,” an older spelling of Kabbalah—Jewish mystical traditions; it can also mean esoteric ‘hidden knowledge’ in older writing.","zh":"“cabbalas”是“cabbala”的复数，cabbala 是 Kabbalah（卡巴拉，犹太神秘主义传统）的较旧拼写；在较旧文本中也可泛指秘学中的“隐秘知识”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of cabbala: Jewish mystical teachings and traditions (often spelled Kabbalah).","zh":"cabbala 的复数：犹太教的神秘主义教义与传统（常见拼写为 Kabbalah / 卡巴拉）。"},"examples":[{"en":"She read introductions to the cabbalas of medieval Jewish mysticism.","zh":"她阅读了一些关于中世纪犹太神秘主义卡巴拉传统的入门书。"},{"en":"The course compared different cabbalas and their symbolic interpretations.","zh":"这门课比较了不同的卡巴拉体系及其象征性解读。"}]},{"partOfSpeech":"n.","definition":{"en":"Less commonly, plural of cabbala/cabala meaning secret or mystical knowledge used in esoteric study.","zh":"较少见：cabbala/cabala 的复数，可指用于秘学研究的“隐秘/神秘知识”。"},"examples":[{"en":"In some older texts, the author refers to “cabbalas” as hidden systems of meaning.","zh":"在一些较旧的文本中，作者把“cabbalas”称为隐藏的意义体系。"}]}],"synonyms":["Kabbalah","cabbala","cabala","Jewish mysticism","esoteric tradition"],"phonetic":"/kəˈbɑləz/","extraExplanation":["“cabbala / cabala / Kabbalah”是同源词的不同拼写；现代英语里谈犹太神秘主义传统时更常用 Kabbalah。读学术或历史材料时看到 cabbala/cabala 多半是较旧或变体拼写。","注意区分：cabala 还可能与 “cabal（政治阴谋小集团）” 在历史上有词源关联与意义扩展，但在现代用法里，谈宗教神秘主义通常写 Kabbalah，而谈政治密谋通常用 cabal。"]}
{"word":"cabbalism","summary":{"en":"Cabbalism mainly refers to Jewish mysticism connected to the Kabbalah, and more broadly to secret or symbolic mystical interpretation.","zh":"cabbalism主要指与卡巴拉（Kabbalah）相关的犹太神秘主义；广义也可指借助象征、数字等进行神秘的隐秘解读。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Jewish mysticism and related teachings, especially those connected to the Kabbalah (a traditional body of mystical interpretation in Judaism).","zh":"（尤指与“卡巴拉/Kabbalah”相关的）犹太神秘主义及其相关教义与思想体系。"},"examples":[{"en":"Some medieval Jewish writers discussed cabbalism as a way to interpret hidden meanings in scripture.","zh":"一些中世纪犹太作家讨论过卡巴拉主义，把它视为解读经文隐含意义的一种方式。"},{"en":"She studied cabbalism to better understand the history of Jewish mystical traditions.","zh":"她研究卡巴拉主义，以更好理解犹太神秘传统的历史。"}]},{"partOfSpeech":"n.","definition":{"en":"A belief in or practice of secret or mystical interpretations, often using symbols, numbers, or hidden codes (sometimes used more broadly outside Judaism).","zh":"（更广义用法）相信或实践“秘密/神秘”的阐释方式，常借助象征、数字或隐藏编码。"},"examples":[{"en":"The novel plays with cabbalism, using numbers and symbols to hint at a hidden message.","zh":"这部小说借用了卡巴拉式的神秘解读，用数字和象征来暗示隐藏信息。"},{"en":"Be careful not to confuse historical scholarship with mere cabbalism.","zh":"要注意别把严肃的历史研究和纯粹的神秘牵强附会混为一谈。"}]}],"synonyms":["Kabbalah","Jewish mysticism","mysticism","esotericism","occultism"],"phonetic":"/ˈkæbəˌlɪzəm/","extraExplanation":["“cabbalism”源自“Cabala/Kabbalah”的旧式拼写，常见于较老的英文著作；现代英语中更常用“Kabbalah”来指犹太传统中的卡巴拉思想。","在英语里，这个词有时会被泛化为“神秘数字学/隐秘象征解码”的意思，但在宗教语境中更准确的是指犹太神秘主义传统。使用时若涉及宗教文化，建议用更具体的“Kabbalah / Kabbalistic tradition”以避免误解。"]}
{"word":"cabbalist","summary":{"en":"A cabbalist is someone who studies or practices Kabbalah, focusing on hidden or symbolic meanings in sacred texts.","zh":"cabbalist 指研究或修习卡巴拉的人，常强调对经典文本的隐义与象征解读。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who studies or practices the Kabbalah (Jewish mysticism), especially someone who seeks hidden or symbolic meanings in sacred texts","zh":"卡巴拉学者；修习卡巴拉（犹太神秘主义）的人，尤指通过象征与隐义来解读经典的人"},"examples":[{"en":"In the novel, a cabbalist searches ancient writings for hidden meanings.","zh":"在小说里，一位卡巴拉学者在古老文献中寻找隐含的意义。"},{"en":"Some artists were inspired by cabbalist ideas about symbols and creation.","zh":"一些艺术家受到卡巴拉关于符号与创世的思想启发。"}]}],"synonyms":["Kabbalist","mystic","esoteric scholar"],"phonetic":"/ˈkæbəlɪst/","extraExplanation":["“cabbalist”来自“Cabala/Kabbalah”的变体拼写，指犹太传统中的神秘主义体系，常与对《圣经》及相关文本的象征性、隐秘性解读联系在一起。","注意区分：cabbalist（与Kabbalah相关）和 cabalist（更常指“阴谋集团的成员/策划者”，来自 cabal“密谋小集团”），两者拼写相近但来源与含义不同。"]}
{"word":"cabbalistic","summary":{"en":"Cabbalistic means connected to the Kabbalah (Jewish mysticism), or more generally something secretive and hard to understand.","zh":"cabbalistic 指与卡巴拉（犹太神秘主义）相关；也可泛指隐秘晦涩、难以理解的表达或符号。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to the Kabbalah (Jewish mysticism), especially its secret or symbolic teachings.","zh":"与卡巴拉（犹太神秘主义）有关的，尤指其隐秘或象征性的教义。"},"examples":[{"en":"The novel is full of cabbalistic symbols that hint at hidden meanings.","zh":"这部小说充满了卡巴拉式的象征，暗示着隐藏的含义。"},{"en":"He studied cabbalistic texts to understand traditional Jewish mysticism.","zh":"他研读卡巴拉相关的文本，以理解传统的犹太神秘主义。"}]},{"partOfSpeech":"adj.","definition":{"en":"Secretive, mysterious, or hard to understand; using codes or obscure references.","zh":"神秘隐晦的；难以理解的；像密码一样含有晦涩暗示的。"},"examples":[{"en":"Her instructions were so cabbalistic that no one knew what to do next.","zh":"她的指示太过隐晦，没人知道下一步该做什么。"},{"en":"The professor’s cabbalistic jokes confused the new students.","zh":"教授那些晦涩的玩笑把新生听懵了。"}]}],"synonyms":["kabbalistic","esoteric","mystical","cryptic","occult"],"phonetic":"/ˌkæbəˈlɪstɪk/","extraExplanation":["“cabbalistic”来自“Kabbalah/ Cabala（卡巴拉）”，指犹太教中的神秘主义传统，强调通过象征、数字（如字母与数字的对应）、隐喻等方式理解经文与宇宙秩序。","在英语里它既可较中性地表示“与卡巴拉有关”，也常被引申为“故弄玄虚、像暗号一样难懂”。使用时注意语境，谈宗教文化时更应避免把它简单等同于“神秘兮兮”。"]}
{"word":"cabbalistical","summary":{"en":"Cabbalistical means ‘related to Kabbalah’ or, more loosely, ‘mysterious and hard to understand.’","zh":"cabbalistical 指“与卡巴拉（犹太神秘主义）相关的”，也可泛指“神秘难懂的、晦涩的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to the Kabbalah (Jewish mysticism), or using its symbols and secret interpretations.","zh":"与卡巴拉（犹太神秘主义）有关的；使用其象征与隐秘解读方式的。"},"examples":[{"en":"Some Renaissance writers used cabbalistical number symbolism in their poems.","zh":"一些文艺复兴时期的作家在诗歌中使用了卡巴拉式的数字象征。"},{"en":"He gave a cabbalistical reading of the text, focusing on hidden meanings.","zh":"他对文本作了卡巴拉式的解读，强调隐藏的含义。"}]},{"partOfSpeech":"adj.","definition":{"en":"(More general) Very mysterious, obscure, or hard to understand, as if based on secret knowledge.","zh":"（更一般）神秘难懂的、晦涩的；仿佛基于秘密知识的。"},"examples":[{"en":"The instructions felt almost cabbalistical to new users.","zh":"对新用户来说，这些说明几乎像“神秘学”一样难懂。"},{"en":"She joked that his handwriting was cabbalistical.","zh":"她开玩笑说他的字迹像“神秘符号”一样难辨。"}]}],"synonyms":["kabbalistic","cabalistic","mystical","esoteric","occult","cryptic"],"phonetic":"/ˌkæbəˈlɪstɪkəl/","extraExplanation":["“cabbalistical”更常见的拼写是“kabbalistic / cabalistic”。它源自“Kabbalah（卡巴拉）”，指犹太传统中的神秘主义与经文的隐秘诠释体系。","注意不要和“cabal（小集团、阴谋集团）”混淆：虽然“cabalistic”在英语中有时也会被误用或联想为“阴谋式的”，但严格来说它主要指卡巴拉/神秘解读。"]}
{"word":"cabbalistically","summary":{"en":"Cabbalistically means “in a Kabbalah-based (mystical, symbolic) way,” and by extension “in an esoteric/occult, secret-symbolic way.”","zh":"cabbalistically 指“以卡巴拉（犹太神秘主义）的象征/隐秘方式”，也可泛指“以秘传、玄学式的隐秘象征方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to Kabbalah (Jewish mysticism) or uses its symbolic/secret interpretations (for example, of letters and numbers).","zh":"以（犹太神秘主义）卡巴拉为依据；用卡巴拉式的象征、隐秘方式（如对字母与数字的解读）来进行解释。"},"examples":[{"en":"Some writers interpret the poem cabbalistically, looking for hidden meanings in repeated letters and numbers.","zh":"有些作者以卡巴拉式的方法解读这首诗，从重复的字母和数字中寻找隐含意义。"},{"en":"The manuscript was read cabbalistically, as if every symbol carried a secret message.","zh":"这份手稿被以卡巴拉式方式阅读，仿佛每个符号都带着秘密讯息。"}]},{"partOfSpeech":"adv.","definition":{"en":"More generally: in a mystical, esoteric, or occult way; using secret symbolism.","zh":"（更广义）以神秘、秘传或玄学的方式；运用隐秘象征来表达或解释。"},"examples":[{"en":"He spoke cabbalistically about fate, hinting at meanings he wouldn’t explain directly.","zh":"他用近乎秘传的方式谈论命运，暗示一些不愿直接说明的含义。"},{"en":"The artist arranged the objects cabbalistically to suggest a hidden order.","zh":"艺术家以神秘象征的方式摆放物件，暗示一种隐藏的秩序。"}]}],"synonyms":["mystically","esoterically","occultly","symbolically"],"phonetic":"ˌkæbəˈlɪstɪkli","extraExplanation":["“cabbalistically”来自“cabbalistic / cabalistic”，与“Kabbalah（卡巴拉）”有关：这是犹太传统中的一套神秘思想与诠释方法，常涉及对《圣经》文本的象征解读，以及字母、数字与宇宙结构之间的对应关系。","英语里该词有时也被更宽泛地用来表示“带有秘义、只对圈内人可懂的暗示式表达”。在写作或评论中，常见搭配有 interpret/read/explain something cabbalistically。"]}
{"word":"cabbalize","summary":{"en":"Cabbalize means to interpret something mystically or symbolically, especially through Kabbalah-inspired ideas.","zh":"cabbalize 指用神秘或象征的方式（常借助卡巴拉思想）去解读事物。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to interpret something in a mystical or symbolic way, especially using ideas from the Jewish Kabbalah","zh":"（尤指借助犹太卡巴拉/Kabbalah 的观念）以神秘或象征的方式解读某事物"},"examples":[{"en":"Some writers cabbalize biblical passages to find hidden meanings.","zh":"有些作者会用卡巴拉式的方式解读《圣经》段落，以寻找隐藏含义。"},{"en":"He tried to cabbalize the numbers in the poem as secret codes.","zh":"他试图把诗中的数字用卡巴拉式的方式解读为秘密密码。"}]},{"partOfSpeech":"vi.","definition":{"en":"to engage in mystical interpretation or symbolic decoding","zh":"进行神秘主义式的诠释；做象征性的“解码”"},"examples":[{"en":"They spent the night cabbalizing over the strange pattern of letters.","zh":"他们整晚都在对那串奇怪的字母模式进行神秘式解读。"}]}],"synonyms":["kabbalize","mystify","interpret symbolically","allegorize"],"phonetic":"/ˈkæbəlaɪz/","extraExplanation":["“cabbalize”比较少见，更常见的拼写是“kabbalize”。两者都来自“Kabbalah（卡巴拉）”，指犹太神秘主义传统，常与象征解读、字母与数字的隐秘对应（如字母数值法）联系在一起。","在现代英语里，这个词有时也带一点文学/评论语气：强调“过度解读”“把普通文本读出秘密系统”的感觉，使用时要注意语境与语气。"]}
{"word":"cabbed","summary":{"en":"“Cabbed” means “took a taxi” (or less commonly, “rode/drove in a vehicle’s cab”).","zh":"“Cabbed”表示“打车/乘出租车”（较少见：在车辆驾驶室内乘坐或驾驶）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “cab”: to travel somewhere by taxi; to take a taxi.","zh":"“cab”的过去式/过去分词：乘出租车出行；打车。"},"examples":[{"en":"We cabbed to the airport because we were late.","zh":"我们因为快迟到了，就打车去机场。"},{"en":"After the show, they cabbed home instead of taking the bus.","zh":"演出结束后，他们没坐公交，而是打车回家了。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “cab”: to ride in or drive a vehicle’s cab (the driver’s compartment), especially in older or technical use.","zh":"“cab”的过去式/过去分词：（较旧或较专业用法）在（车辆的）驾驶室/司机座舱内乘坐或驾驶。"},"examples":[{"en":"The engineer cabbed the locomotive during the night shift.","zh":"那位工程师在夜班时在机车驾驶室里操作驾驶。"}]}],"synonyms":["took a cab","took a taxi","rode in a taxi"],"phonetic":"/kæbd/","extraExplanation":["“cab”是“taxi”的常见口语说法，尤其在英美都能用；动词用法（cabbed/cabbing）在口语里有时会被更常见的“took a cab”替代，但依然是正确的表达。"]}
{"word":"cabber","summary":{"en":"Cabber means a taxi driver (informal and uncommon).","zh":"cabber 指“出租车司机”，属于非正式且不太常见的说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, uncommon) A taxi driver; someone who drives a cab.","zh":"（非正式，较少见）出租车司机；开出租车的人。"},"examples":[{"en":"The cabber knew every shortcut in the city.","zh":"那位出租车司机知道城里每一条近路。"},{"en":"I asked the cabber to drop me off at the nearest subway station.","zh":"我让出租车司机把我送到最近的地铁站。"}]}],"synonyms":["cabbie","taxi driver","cabdriver"],"phonetic":"/ˈkæbər/","extraExplanation":["“cabber”在现代英语里并不常见，更常用的说法是 **cabbie**（口语）或 **taxi driver**（更中性、通用）。","词根来自 **cab**（出租车），后缀 **-er** 表示“做某事的人”（如 driver, worker）。在不同地区，这个词可能显得过时或不自然。"]}
{"word":"cabbie","summary":{"en":"A casual word for a taxi driver.","zh":"“cabbie”是“出租车司机”的口语说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a taxi driver","zh":"出租车司机（口语）"},"examples":[{"en":"The cabbie dropped me off at the airport right on time.","zh":"出租车司机准时把我送到了机场。"},{"en":"I asked the cabbie for a quick route to downtown.","zh":"我请出租车司机走一条去市中心的快路。"}]}],"synonyms":["taxi driver","cabdriver"],"phonetic":"/ˈkæbi/","extraExplanation":["“cabbie”是非常口语、偏北美/英式城市生活的说法，来自“cab”（出租车）+ “-ie”（常见的口语后缀，表示“做某事的人/某类人”）。","语气通常中性；在正式场合更常用“taxi driver”。在一些语境里称呼陌生人时，用“sir/ma’am”或直接说“the driver”可能更礼貌。"]}
{"word":"cabbies","summary":{"en":"“Cabbies” means taxi drivers (plural), a casual everyday word.","zh":"“cabbies”指“出租车司机们”，是比较口语、日常的说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Taxi drivers (plural of “cabbie”), especially in a city.","zh":"出租车司机（“cabbie”的复数），尤指城市里的出租车司机。"},"examples":[{"en":"New York cabbies often know the fastest route through traffic.","zh":"纽约的出租车司机通常很熟悉在拥堵中最快的路线。"},{"en":"We asked a couple of cabbies where to get late-night food.","zh":"我们问了几位出租车司机哪里能买到宵夜。"}]}],"synonyms":["taxi drivers","cab drivers"],"phonetic":"/ˈkæbiz/","extraExplanation":["“cabbie”是比较口语的说法，来自“cab（出租车）”。在英美语境里常见，但在正式写作中更常用“taxi driver”。","在一些城市文化里，“cabbies”常被描写成很懂路况、消息灵通、也很健谈的人，比如纽约、伦敦等地的城市题材作品中经常出现。"]}
{"word":"cabbing","summary":{"en":"“Cabbing” means taking a taxi, or (as a verb form) traveling by taxi / working as a taxi driver.","zh":"“cabbing”指“打车/乘出租车”，也可指“乘出租车出行”或“开出租车（赚外快）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity of taking a taxi (cab), or moving around by taxi","zh":"搭乘出租车（打车）的行为；乘出租车出行"},"examples":[{"en":"We did a lot of cabbing in New York because the subway was confusing at first.","zh":"我们在纽约经常打车，因为一开始地铁太让人迷糊了。"},{"en":"After midnight, cabbing felt safer than walking alone.","zh":"半夜以后，打车比一个人走路更安全。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “cab”: traveling by taxi or working/driving as a taxi driver","zh":"“cab”的现在分词：乘出租车出行；（非正式）当/开出租车"},"examples":[{"en":"We’re cabbing to the airport to save time.","zh":"我们打车去机场省时间。"},{"en":"He’s been cabbing at night to earn extra money.","zh":"他晚上开出租车赚点外快。"}]}],"synonyms":["taking a cab","getting a taxi","riding in a taxi","taxiing (BrE: often “taxiing”; AmE: “taking a cab”)"],"phonetic":"/ˈkæbɪŋ/","extraExplanation":["“cab”是“taxicab”的简称，最早与法语 cabriolet（一种轻便马车）有关，所以在英语里“cab”也有“马车/出租车”的历史来源。","日常口语中更常说“take a cab / get a taxi / take an Uber”，而“cabbing”更像是叙述一种出行方式（例如在城市里一直打车跑来跑去）。"]}
{"word":"cabble","summary":{"en":"Cabble means broken stones or quarry waste; it’s a rare word today.","zh":"cabble 指碎石或采石场的废石渣；如今较少使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"broken stones, small rock fragments, or quarry waste (especially rough pieces left after stone is cut)","zh":"碎石；石块碎屑；（尤指采石场切割后剩下的）废石渣"},"examples":[{"en":"The path was covered with cabble from the nearby quarry.","zh":"小路上铺着附近采石场运来的碎石渣。"},{"en":"Workers cleared away the cabble before laying the new paving stones.","zh":"工人先清走碎石废料，再铺新的铺路石。"}]}],"synonyms":["rubble","gravel","stone fragments","quarry waste","debris"],"phonetic":"/ˈkæbəl/","extraExplanation":["“cabble”在现代英语里非常少见，多见于较旧的用法或与采石/石材相关的语境。日常写作里更常用的词是“rubble”（瓦砾/碎石）、“gravel”（碎石子）或“quarry waste”（采石废料）。","它常被误拼或误读为“cobble”（鹅卵石；修补），如果你想表达“修补/拼凑”通常应使用“cobble (together)”或“cobble up”。"]}
{"word":"cabbled","summary":{"en":"“Cabbled” is a rare word, usually meaning “quarreled noisily” (past of cabble) or “cobble-like/covered with small stones.”","zh":"“cabbled”很少见，通常指“吵闹地争吵”（cabble的过去式）或“像鹅卵石铺面/由小石子铺成的”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(rare, Scots/Irish English) Past tense/past participle of “cabble”: to argue or chatter noisily; to quarrel.","zh":"（罕见，苏格兰/爱尔兰英语）“cabble”的过去式/过去分词：喧闹地争吵或吵嚷；大声争辩。"},"examples":[{"en":"The neighbors cabbled in the street until someone called them inside.","zh":"邻居们在街上吵吵嚷嚷，直到有人把他们叫回屋里。"},{"en":"They had cabbled all morning about whose turn it was to pay.","zh":"他们一早上都在争吵到底轮到谁付钱。"}]},{"partOfSpeech":"adj.","definition":{"en":"(architecture/stonework, rare) Made of or covered with small, rounded stones; cobble-like.","zh":"（建筑/石作，罕见）由小圆石铺成的；像鹅卵石路面那样的。"},"examples":[{"en":"We walked along a cabbled lane leading to the old church.","zh":"我们沿着通往老教堂的石子路走去。"},{"en":"The courtyard had a cabbled surface that became slippery in rain.","zh":"院子里是石子铺面，下雨时会变滑。"}]}],"synonyms":["quarreled","bickered","argued","cobbled (often intended)"],"phonetic":"/ˈkæbəl/","extraExplanation":["“cabbled”非常少见。很多情况下它可能是拼写误差，常见目标词包括：\n- “cobbled”（更常见）：①（路面）用鹅卵石铺的；②（临时）拼凑出来的。\n- “cabled”：用电缆连接的。\n如果你能提供一句原文语境（前后各5–10个词），我可以帮你判断最可能的词和意思。"]}
{"word":"cabbler","summary":{"en":"“Cabbler” is a rare spelling/word meaning a shoemaker (cobbler) or, negatively, someone who does rough, careless work.","zh":"“cabbler”是很少见的拼写/词，主要指修鞋匠（cobbler），也可贬义指做事粗糙马虎的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) A shoemaker, especially one who repairs shoes; a variant spelling of “cobbler.”","zh":"（罕见）修鞋匠；尤指修补鞋子的人；“cobbler”的异拼。"},"examples":[{"en":"In older texts, a “cabbler” might be the person who mends boots in the village.","zh":"在较旧的文本里，“cabbler”可能指村里修补靴子的人。"},{"en":"The traveler asked the cabbler to patch the torn sole.","zh":"旅人请修鞋匠把破掉的鞋底补一补。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, often negative) A person who does work in a rough, careless way; a bungler.","zh":"（罕见，常带贬义）做事粗糙马虎的人；拙劣的匠人；笨手笨脚的人。"},"examples":[{"en":"He called himself a cabbler, not an artist, because his work was quick and messy.","zh":"他说自己只是个粗糙的匠人，不是艺术家，因为他的活儿又快又乱。"},{"en":"Don’t be a cabbler—measure twice before you cut.","zh":"别做个粗心的家伙——下刀前量两次。"}]}],"synonyms":["cobbler","shoemaker","bootmaker","mender","bungler","botcher"],"phonetic":"/ˈkæblər/","extraExplanation":["“cabbler”在现代英语里非常少见，更多时候是“cobbler（修鞋匠）”的旧式或非标准拼写。如果你是在阅读古书、方言材料，或看到别人拼错时遇到这个词，这种情况很常见。","词义上也可能受动词“to cobble (together)”影响，带出“草草拼凑、做得粗糙”的评价色彩。"]}
{"word":"cabbling","summary":{"en":"Cabbling is a rare mining term meaning hand-sorting ore or coal to remove waste and keep the useful pieces.","zh":"Cabbling 是罕见的采矿术语，指用手挑拣矿石或煤，去除废料、保留有用部分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Mining) The act of sorting ore or coal by hand, picking out the valuable pieces from the waste.","zh":"（采矿）用手挑拣矿石或煤，把有价值的部分从废料中挑出来的过程。"},"examples":[{"en":"The workers spent the afternoon cabbling the ore before it went to the crusher.","zh":"工人们下午先把矿石进行手工挑拣，然后才送去破碎。"},{"en":"Cabbling was common in older mines before modern screening machines.","zh":"在现代筛分机器出现之前，手工挑拣（cabbling）在旧式矿场很常见。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “cabble”: to sort ore or coal by hand; to pick out what is usable.","zh":"“cabble”的现在分词：手工挑拣矿石或煤；拣出可用部分。"},"examples":[{"en":"They are cabbling the coal to remove stones and dirt.","zh":"他们正在手工挑拣煤，把石块和泥土去掉。"},{"en":"She learned cabbling from her father, who worked in the mine.","zh":"她从在矿场工作的父亲那里学会了手工挑拣。"}]}],"synonyms":["hand-sorting","handpicking","picking out","sorting"],"phonetic":"/ˈkæbəlɪŋ/","extraExplanation":["“cabbling”是非常少见、偏专业的词，多见于英国旧式矿业/工业语境。日常英语里更常用的说法是“sorting by hand / handpicking / picking out”。","它很容易被误看成“cabling”（铺设电缆）或“cobbling”（拼凑、修补）。如果你想表达“铺电缆”，通常应写“cabling”。"]}
{"word":"cabby","summary":{"en":"“Cabby” means a taxi driver (often in a traditional or old-fashioned sense).","zh":"“cabby”指出租车司机（常带有较传统或旧式的语感）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a taxi driver, especially one who drives a traditional cab (often used in British English)","zh":"出租车司机；（尤指）驾驶传统出租马车/出租车的人（常见于英式英语）"},"examples":[{"en":"We asked a cabby to take us to the train station.","zh":"我们请一位出租车司机送我们去火车站。"},{"en":"The cabby knew a faster route through the city.","zh":"这位司机知道一条穿城更快的路线。"}]}],"synonyms":["taxi driver","cabbie"],"phonetic":"/ˈkæbi/","extraExplanation":["“cabby”来自“cab”（出租车/出租马车）加上表示人的后缀“-y”。在现代英语里更常用“taxi driver”，而“cabby”带一点口语感和旧式城市氛围（比如伦敦、纽约老电影里常出现）。"]}
{"word":"cabda","summary":{"en":"“cabda” isn’t a recognized English word; it’s likely a misspelling or an acronym that needs context.","zh":"“cabda”不是常见英语单词；更可能是拼写错误或需要语境才能确定的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username, or an acronym in a specific field (so the meaning depends on context).","zh":"不是标准英语单词。可能是拼写错误、用户名，或某个领域的缩写（含义取决于上下文）。"},"examples":[{"en":"I couldn’t find a dictionary entry for “cabda”—could you share the sentence you saw it in?","zh":"我在词典里找不到“cabda”，你能把它出现的句子发我吗？"},{"en":"Did you mean “cabal” or “cabin” instead of “cabda”?","zh":"你想写的是“cabal”还是“cabin”，而不是“cabda”吗？"}]}],"phonetic":"ˈkæbdə","extraExplanation":["“cabda”很可能是拼写打错了。你可以检查是否想输入：\n- cab（出租车；或“驾驶室”）\n- cabal（秘密小集团/阴谋集团）\n- cabaña / cabana（小屋/海边更衣棚，常见拼写是 cabana）\n如果你把它所在的句子或主题（比如医学、计算机、游戏等）发来，我可以更准确判断它是不是某个缩写（acronym）。"]}
{"word":"cabdriver","summary":{"en":"A cabdriver is someone whose job is driving a taxi.","zh":"cabdriver 指以驾驶出租车为职业的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who drives a taxi as a job; a taxi driver.","zh":"以开出租车为职业的人；出租车司机。"},"examples":[{"en":"The cabdriver knew the quickest way to the airport.","zh":"那位出租车司机知道去机场最快的路线。"},{"en":"I asked the cabdriver to drop me off at the museum.","zh":"我请出租车司机在博物馆把我放下。"}]}],"synonyms":["taxi driver","cabbie"],"phonetic":"/ˈkæbˌdraɪvɚ/","extraExplanation":["在美式英语中，*cab* 是 *taxi* 的常见口语说法，所以 *cabdriver* 和 *taxi driver* 基本同义。","词形：*cab*（出租车）+ *driver*（司机）。也可见写法 *cab driver*（分开写），意思不变。"]}
{"word":"cabdrivers","summary":{"en":"Cabdrivers are people who drive taxis for a living.","zh":"cabdrivers 指以开出租车为职业的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People whose job is to drive a taxi (cab) and take passengers to different places for money.","zh":"以驾驶出租车（计程车）载客并收费为职业的人。"},"examples":[{"en":"Cabdrivers in New York often know the city streets very well.","zh":"纽约的出租车司机通常很熟悉城市道路。"},{"en":"The cabdrivers waited near the station to pick up passengers.","zh":"出租车司机在车站附近等着接客。"}]}],"synonyms":["taxi drivers","cabbies"],"phonetic":"/ˈkæbˌdraɪvərz/","extraExplanation":["“cabdriver(s)”=“taxi driver(s)”。在美式英语里两者都常见；“cab”更口语、传统，常让人联想到在街上招手拦车或打表计费。","书面表达中，如果你想更中性、更通用，也可以用“taxi drivers”；在一些地区还有“rideshare drivers”（网约车司机，如 Uber/Lyft）这一类不同概念。"]}
{"word":"cabdriving","summary":{"en":"Cab driving means driving a taxi as a job or activity.","zh":"cab driving 指以开出租车载客为工作或活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity or job of driving a taxi (cab) to take passengers to their destinations","zh":"（作为工作或活动的）开出租车、驾驶计程车载客"},"examples":[{"en":"He does cab driving at night to earn extra money.","zh":"他晚上开出租车来赚外快。"},{"en":"Cab driving in a big city can be stressful because of traffic.","zh":"在大城市开出租车可能会因为交通而很有压力。"},{"en":"She learned the streets quickly after a few months of cab driving.","zh":"开出租车几个月后，她很快就熟悉了街道。"}]},{"partOfSpeech":"v.","definition":{"en":"driving a taxi as an action happening now or as a regular habit","zh":"（动作/习惯）正在开出租车；经常开出租车"},"examples":[{"en":"I’m cab driving this weekend, so I can’t join the trip.","zh":"我这周末要开出租车，所以不能参加旅行。"},{"en":"He’s been cab driving since he lost his office job.","zh":"自从失去办公室工作后，他一直在开出租车。"}]}],"synonyms":["taxi driving","driving a taxi","driving a cab","rideshare driving (similar, but usually app-based)"],"phonetic":"/kæb ˌdraɪvɪŋ/","extraExplanation":["“cab”是“taxicab”的口语缩写，在美式英语里很常见；正式一点更常写作“taxi driving”或“driving a taxi”。","在很多城市，“cab driving”也会让人联想到传统出租车行业；如果是用网约车平台（如Uber/Lyft）载客，更常说“rideshare driving”或“driving for Uber/Lyft”。"]}
{"word":"Cabe","summary":{"en":"“Cabe” is not standard English; it’s commonly Indonesian/Malay for “chili pepper.”","zh":"“cabe”不是标准英语；常见于印尼语/马来语，意思是“辣椒”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Not a common English word.) In Indonesian/Malay, “cabe” means a chili pepper; in English you would usually say “chili pepper” or “hot pepper.”","zh":"（不是常见英语词。）在印尼语/马来语里，cabe 指“辣椒”；英语里通常说 chili pepper 或 hot pepper。"},"examples":[{"en":"In Indonesian recipes, “cabe” means chili peppers.","zh":"在印尼菜谱里，cabe 的意思是“辣椒”。"},{"en":"Add more cabe if you want it spicier (English: add more chili).","zh":"如果你想更辣，就多加一些 cabe（英语：多加一些辣椒）。"}]}],"synonyms":["chili pepper","chile pepper","hot pepper"],"phonetic":"/ˈtʃɑː.beɪ/","extraExplanation":["“cabe”常见于印尼语拼写（也常写作 cabai）。英语语境中一般不会用 cabe；如果你在英文菜单/食谱里看到，多半是保留原语言用词。"]}
{"word":"cabecera","summary":{"en":"Spanish “cabecera” most often means “headboard,” and more broadly can mean “header/heading,” “the head end,” or “headwaters,” depending on context.","zh":"西语“cabecera”最常见是“床头板”，也可指“页眉/标题栏”“上首/前端”或“河流源头”，需结合语境判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the headboard (the board at the head of a bed)","zh":"床头板（床头一端的板）"},"examples":[{"en":"The headboard is scratched, but the bed is still sturdy.","zh":"床头板被刮花了，但床还是很结实。"},{"en":"She leaned back against the headboard and read.","zh":"她靠在床头板上看书。"}]},{"partOfSpeech":"n.","definition":{"en":"the header or heading of a page, document, or newspaper (title area)","zh":"页眉／标题栏（文件或报纸的标题部分）"},"examples":[{"en":"Put the date in the header of the document.","zh":"把日期放在文件的页眉里。"},{"en":"The newspaper’s header is easy to recognize.","zh":"那份报纸的报头很容易辨认。"}]},{"partOfSpeech":"n.","definition":{"en":"the head or main end of something (for example, the head of a table or the front end of a line)","zh":"开头／主要端（如桌子的上首、队伍前端）"},"examples":[{"en":"He sat at the head of the table.","zh":"他坐在桌子的上首。"},{"en":"Please move to the front of the line.","zh":"请移到队伍前面。"}]},{"partOfSpeech":"n.","definition":{"en":"the headwaters or source area of a river","zh":"（河流的）源头／上游发源地"},"examples":[{"en":"They traveled to the river’s headwaters.","zh":"他们去到了那条河的源头。"}]}],"synonyms":["headboard","header","heading","head end","head","headwaters","source"],"phonetic":"/ˈhɛdˌbɔrd/","extraExplanation":["“cabecera”在西班牙语里是个很常用的名词，核心概念是“头/顶部/起始处”。因此它会延伸出多种意思：床的“床头”、文章或报纸的“报头/标题栏”、桌子或队伍的“上首/前端”，以及河流的“源头”。具体含义通常要靠后面的介词短语来判断，比如：cabecera de la cama（床头）、cabecera del documento（页眉/抬头）、cabecera del río（河源）。"]}
{"word":"cabecudo","summary":{"en":"cabecudo (cabeçudo) means “big-headed” and, informally, “stubborn/hard to convince.”","zh":"cabecudo（常写作 cabeçudo）意为“头很大”，口语中也常指“固执、难以说服”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Brazilian/Portuguese, informal) Having a big head; also used to mean stubborn or hard to convince.","zh":"（葡语/巴葡，非正式）“头很大”的；也可引申为固执、很难被说服的。"},"examples":[{"en":"He’s a bit cabecudo—once he decides something, it’s hard to change his mind.","zh":"他有点cabecudo——一旦决定了，就很难改变主意。"},{"en":"That kid looks cabecudo in that photo because of the camera angle.","zh":"因为拍摄角度，那孩子在那张照片里看起来头特别大。"}]},{"partOfSpeech":"n.","definition":{"en":"A stubborn person; sometimes jokingly, a big-headed person.","zh":"固执的人；有时也开玩笑指“头很大的人”。"},"examples":[{"en":"Don’t be a cabecudo—listen to what everyone is saying.","zh":"别那么cabecudo——听听大家怎么说。"}]}],"synonyms":["big-headed","stubborn","hard-headed","egghead (context-dependent)"],"phonetic":"/ˌkɑbəˈsuːdu/","extraExplanation":["更常见的拼写是 **cabeçudo**（带 ç），来自 **cabeça**（头）。在没有特殊字符的情况下，常被写成 **cabecudo**。","语气通常是口语、半开玩笑或轻微批评；在不同地区可能更偏向“固执”或更偏向“头大/外形”。使用时注意语境，避免对外貌的冒犯。"]}
{"word":"Cabeiri","summary":{"en":"Cabeiri: mysterious Greek deities worshiped in secret rites, linked to protection, fertility, and seafaring safety.","zh":"Cabeiri：希腊神话中在秘密仪式中崇拜的神秘神群，常与守护、丰饶与航海安全相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) a group of mysterious underworld deities worshiped in secret rites, especially on the islands of Samothrace and Lemnos; they were associated with protection, fertility, and safety at sea.","zh":"（希腊神话）卡比里神／卡比利神：一组神秘的冥界（或地下）神祇，常在秘密宗教仪式中受崇拜，尤以萨莫色雷斯岛和利姆诺斯岛著名；常与守护、丰饶与航海平安有关。"},"examples":[{"en":"In some ancient sources, sailors prayed to the Cabeiri for protection during storms.","zh":"在一些古代文献中，水手会向卡比里神祈求风暴中的庇护。"},{"en":"The mysteries of Samothrace included rites connected with the Cabeiri.","zh":"萨莫色雷斯秘仪中包含与卡比里神相关的仪式。"}]}],"synonyms":["Kabeiri","Kabeiroi","Cabeiroi"],"phonetic":"/kəˈbaɪəˌraɪ/","extraExplanation":["“Cabeiri”常见于英文学术写作中，更多也会写作“Kabeiri”（用K更贴近希腊语转写），复数形式也可见“Kabeiroi / Cabeiroi”。在很多语境里，它指“一群神”，因此常当作复数概念来理解。","卡比里神的形象与职能在不同地区与时代并不完全一致，相关信息多来自古代作家与铭文。它们与“萨莫色雷斯秘仪”（Samothracian Mysteries）关系密切，秘仪强调入会与保密，因此细节在史料中往往含混。","在文学或文化研究里，提到Cabeiri通常是在讨论古希腊的秘密宗教、海上保护神崇拜、或与赫淮斯托斯（Hephaestus）等神祇的地方性联系。"]}
{"word":"Cabeirian","summary":{"en":"An adjective meaning “connected with the Cabeiri (Kabiri), the mysterious Greek deities and their secret rites.”","zh":"形容词：指“与古希腊神秘神祇卡贝里神（Cabeiri／Kabiri）及其秘密仪式有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Cabeiri (also spelled Kabiri), a group of mysterious deities in ancient Greek religion, especially associated with secret rites and worship (notably on Samothrace and sometimes Lemnos).","zh":"与“卡贝里神”（Cabeiri／Kabiri，一组古希腊宗教中带有神秘色彩的神祇）有关的；尤指与其秘密仪式和崇拜（著名于萨莫色雷斯岛，有时也与莱姆诺斯岛相关）有关的。"},"examples":[{"en":"The museum label described the figure as part of a Cabeirian cult object.","zh":"博物馆的说明牌将这件雕像描述为卡贝里神崇拜的一部分祭祀物。"},{"en":"Some ancient writers mention Cabeirian rites alongside other mystery religions.","zh":"一些古代作者在提到其他神秘宗教时，也会提及卡贝里神的秘密仪式。"}]}],"synonyms":["Cabirian","Cabeiric","Kabirian"],"phonetic":"/kəˈbɪriən/","extraExplanation":["“Cabeirian”来自 Cabeiri（也常见拼写 Kabiri / Cabiri）。这些神祇的身份在古代就不完全清楚，常被认为与“神秘宗教（mystery cults）”相关：强调入会仪式、象征性的秘密传统，以及祈求保护（尤其与航海、旅途或安全相关的庇佑）。","在英语里这个词非常罕见，主要出现在古典学、神话研究、考古或博物馆说明中。日常英语一般不会用到。","常见相关词：Samothracian mysteries（萨莫色雷斯秘仪）、mystery cult（神秘崇拜/神秘宗教）、Kabiri/Cabiri（卡贝里神，异拼）。"]}
{"word":"Cabeiric","summary":{"en":"A rare adjective meaning “connected with the ancient Greek Cabeiri and their mystery rites.”","zh":"较少见的形容词，意为“与古希腊卡贝里神及其秘仪/密祭有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Cabeiri (also spelled Cabiri), mysterious deities worshiped in parts of the ancient Greek world, especially in secret religious rites (mystery cults).","zh":"与卡贝里神（亦拼作 Cabiri/Cabeiri）有关的；指古希腊世界（常见于秘仪/密祭宗教）中所崇拜的一组神祇及其仪式的。"},"examples":[{"en":"Archaeologists found objects that may have been used in Cabeiric rituals on the island of Samothrace.","zh":"考古学家发现了一些器物，可能曾用于萨莫色雷斯岛上的卡贝里秘仪。"},{"en":"The play uses Cabeiric imagery to create an atmosphere of secrecy and initiation.","zh":"这部戏剧借用卡贝里式意象，营造出秘密与入会仪式的氛围。"}]}],"synonyms":["Cabiric","Cabeirian"],"phonetic":"/kəˈbɪrɪk/","extraExplanation":["“Cabeiric”是非常少见的学术/文学用词，主要出现在古典学、宗教学、考古或讨论“神秘宗教（mystery cults）”的语境中。","Cabeiri（卡贝里神）与萨莫色雷斯（Samothrace）等地的“秘仪”传统相关；文本里用“Cabeiric”往往暗示：隐秘、入会、象征性仪式、神圣禁忌等气氛。","拼写上也可能见到“Cabiric / Cabeirian”等变体；不同作者可能偏好不同拼法，但指涉通常相近。"]}
{"word":"Cabeiroi","summary":{"en":"The Cabeiroi are mysterious gods in Greek mythology, worshiped in secret mystery rites, especially at Samothrace and Lemnos.","zh":"卡贝洛伊是希腊神话中的一组神秘神祇，常在秘密的秘仪中被崇拜，尤与萨莫色雷斯与利姆诺斯相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, a group of mysterious underworld or “chthonic” deities worshiped in secret rites, especially on the islands of Samothrace and Lemnos; often linked with protection (especially of sailors), fertility, and initiation ceremonies.","zh":"（希腊神话）卡贝洛伊（又译卡贝里/卡比里神），一组神秘的冥界（地下）神祇，常在秘密宗教仪式中被崇拜，尤以萨莫色雷斯岛与利姆诺斯岛著名；常与护佑（尤其海员）、丰产与入会/启蒙仪式相关。"},"examples":[{"en":"Some ancient writers connect the Cabeiroi with the mystery cult of Samothrace.","zh":"一些古代作者把卡贝洛伊与萨莫色雷斯的秘仪宗教联系起来。"},{"en":"Sailors sought protection through rites associated with the Cabeiroi.","zh":"水手们会通过与卡贝洛伊相关的仪式祈求庇护。"}]}],"synonyms":["Kabeiroi","Cabeiri"],"phonetic":"/kəˈbaɪrɔɪ/","extraExplanation":["“Cabeiroi”是复数形式，单数常写作“Cabeirus”（也见拼写差异如“Kabeiroi”）。中文译名不统一，常见“卡贝洛伊/卡比里神”等。","卡贝洛伊的身份在古代就颇为模糊：有时被视作与赫淮斯托斯（Hephaestus）或锻造、火有关的神灵；在秘仪传统中更强调“不可言说”的神圣体验，因此资料常带神秘与片段性。","文学与学术语境中，“the Cabeiroi”通常出现在讨论古希腊“mystery cults（秘仪宗教）”、入会仪式（initiation rites）或萨莫色雷斯秘仪（Samothracian Mysteries）的段落里。"]}
{"word":"cabeliau","summary":{"en":"An archaic word for codfish, especially salt cod.","zh":"一个较古旧的词，指鳕鱼，尤指咸鳕鱼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) codfish, especially salt cod (cod preserved by salting and drying).","zh":"（古义）鳕鱼；尤指腌制、风干保存的“咸鳕鱼”。"},"examples":[{"en":"In some older English texts, “cabeliau” refers to salt cod brought from the North Atlantic.","zh":"在一些较早的英文文本里，cabeliau 指从北大西洋运来的咸鳕鱼。"},{"en":"The sailors lived on hard bread and cabeliau during the long voyage.","zh":"水手在漫长航行中靠硬面包和咸鳕鱼度日。"}]}],"synonyms":["cod","codfish","salt cod","salted cod"],"phonetic":"/ˌkæbəˈljuː/","extraExplanation":["这是一个比较少见、偏古旧的词，主要出现在较早的英语书写中；现代英语通常直接用 cod / codfish，咸鳕鱼多说 salt cod。","词源上多被认为与法语 cabillaud（鳕鱼）有关，和北大西洋渔业、盐渍保存的鳕鱼贸易背景常有联系。"]}
{"word":"Cabell","summary":{"en":"Cabell is mainly used as a surname and as a U.S. place name (notably Cabell County, West Virginia).","zh":"Cabell 主要用作姓氏，也可作美国地名（尤指西弗吉吉尼亚州的卡贝尔县）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a surname (family name), found especially in English-speaking countries.","zh":"一个姓氏（家族姓），在英语国家较常见。"},"examples":[{"en":"James Branch Cabell is known for his fantasy novel *Jurgen*.","zh":"詹姆斯·布兰奇·卡贝尔（James Branch Cabell）以奇幻小说《尤尔根》（*Jurgen*）闻名。"},{"en":"I saw the name Cabell on the office door.","zh":"我在办公室门牌上看到了 Cabell 这个名字。"}]},{"partOfSpeech":"other","definition":{"en":"a place name in the U.S., most commonly referring to Cabell County in West Virginia.","zh":"美国的地名，最常见指西弗吉尼亚州的卡贝尔县（Cabell County）。"},"examples":[{"en":"She grew up in Cabell County, West Virginia.","zh":"她在西弗吉尼亚州的卡贝尔县长大。"},{"en":"The storm caused damage across Cabell.","zh":"暴风雨在卡贝尔县一带造成了破坏。"}]}],"phonetic":"/kəˈbɛl/","extraExplanation":["“Cabell”在文学语境中常指美国作家 James Branch Cabell（1879–1958）。他以讽刺、浪漫与幻想元素结合的作品著称，《Jurgen》曾因被认为“有伤风化”而引发争议与审查，这也让他的名声更广为人知。"]}
{"word":"cabellerote","summary":{"en":"A Spanish-style word meaning a big/burly “gentleman/knight,” often used playfully; not standard English.","zh":"西班牙语风格用词，指“高大魁梧的绅士/骑士”，多带玩笑语气；非标准英语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish loanword; not standard English) A “big” or “burly” gentleman/knight; often used humorously or as a playful, slightly ironic way to refer to a man acting very chivalrous.","zh":"（西班牙语借词；非标准英语）“高大/魁梧的绅士、骑士”；常带幽默或略带调侃地指一个很讲骑士风度的男人。"},"examples":[{"en":"In the story, the caballerote bowed dramatically and offered his cloak to the traveler.","zh":"在故事里，那位“caballerote”夸张地鞠躬，把斗篷递给旅人。"},{"en":"Don’t be such a caballerote—she can open the door herself.","zh":"别这么“caballerote”啦——她自己会开门。"}]}],"synonyms":["caballero","gentleman","knight","chivalrous man"],"phonetic":"/ˌkɑːbəˌjeɪˈroʊteɪ/","extraExplanation":["“caballerote”主要是西班牙语构词：caballero（绅士/骑士）+ -ote（增大词缀，表示“更大、更强壮”，有时带戏谑或夸张语气）。在英语语境里通常出现在双语文本、文学翻译、或作为风格化用语；日常英语中更常用 gentleman、knight、chivalrous man 等表达。"]}
{"word":"cabello","summary":{"en":"Cabello is a Spanish word meaning “hair (on the head).”","zh":"Cabello 是西班牙语，意思是“头发（头上的）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) hair on the head; a person’s head of hair (often used in a slightly more formal or polite way than “pelo”).","zh":"（西语）头发；（常比“pelo”更正式或更礼貌）人的一头头发。"},"examples":[{"en":"She has long, dark cabello.","zh":"她有又长又黑的头发。"},{"en":"In many salons, you may see “corte de cabello” on the price list.","zh":"在很多美发店的价目表上，你可能会看到“corte de cabello（剪发）”。"}]}],"synonyms":["hair","head of hair","locks","tresses"],"phonetic":"/kɑˈbeɪjoʊ/","extraExplanation":["“cabello”是西班牙语名词，常指“头发（头上的）”。相对地，“pelo”更口语，也可以泛指“毛发/体毛”。","常见搭配：corte de cabello（理发/剪发）、color de cabello（发色）、cabello rizado/lacio（卷发/直发）、cabello largo/corto（长发/短发）。"]}
{"word":"caber","summary":{"en":"A caber is a heavy wooden pole used in the Scottish sport of caber tossing.","zh":"caber 指苏格兰抛木柱比赛中使用的沉重木柱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long, heavy wooden pole used in the Scottish sport of caber tossing (throwing and flipping the pole end-over-end).","zh":"（苏格兰）“抛木柱”比赛用的长而沉的木柱（需要把木柱抛起并使其翻转落地）。"},"examples":[{"en":"He trained for months to lift and flip the caber.","zh":"他训练了好几个月，练习举起并翻转那根木柱。"},{"en":"At the Highland Games, the crowd cheered when the caber landed neatly after the toss.","zh":"在高地运动会上，当木柱抛掷后整齐落地时，人群欢呼起来。"}]}],"synonyms":["pole","log (in this sport context)"],"phonetic":"/ˈkeɪbər/","extraExplanation":["caber 常见于苏格兰“Highland Games（高地运动会）”语境；“caber toss（抛木柱）”比赛看重的是木柱翻转后落地的方向与姿态，而不只是抛得多远。"]}
{"word":"Cabernet","summary":{"en":"Cabernet is a red wine grape—and the wine made from it, usually meaning Cabernet Sauvignon.","zh":"Cabernet 指一种红葡萄品种及其酿成的红葡萄酒，通常默认是赤霞珠（Cabernet Sauvignon）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of red wine grape (and the red wine made from it), especially Cabernet Sauvignon, known for rich flavor and often higher tannins.","zh":"一种红葡萄品种（以及用它酿造的红葡萄酒），尤其常指赤霞珠（Cabernet Sauvignon），以风味浓郁、单宁感较明显著称。"},"examples":[{"en":"I ordered a glass of Cabernet with dinner.","zh":"我晚餐点了一杯赤霞珠红酒。"},{"en":"Cabernet wines often taste of dark berries and can feel a bit dry because of tannins.","zh":"赤霞珠常带有深色浆果的风味，并可能因单宁而让口感偏干。"}]}],"synonyms":["Cabernet Sauvignon","red wine"],"phonetic":"/ˌkæbɚˈnɛt/","extraExplanation":["在英语点酒时，“a Cabernet”通常是口语省略说法，多数指“Cabernet Sauvignon（赤霞珠）”。严格说“cabernet”还可能指其他“Cabernet”家族葡萄（如Cabernet Franc 品丽珠），但在餐厅或酒吧里不特别说明时，默认多为赤霞珠。","发音小提示：重音常落在最后一节：cab-er-NET。","文化语境：在美国餐饮语境中，Cabernet常被认为适合搭配牛排、烤肉等较油脂丰富的食物（因为单宁与脂肪的搭配很常见）。"]}
{"word":"cabernet","summary":{"en":"Cabernet is a red wine grape and the red wine made from it, often meaning Cabernet Sauvignon.","zh":"Cabernet 指一种红葡萄品种及其酿成的红葡萄酒，日常多指赤霞珠（Cabernet Sauvignon）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of red wine grape, and also a red wine made from it (most often Cabernet Sauvignon).","zh":"一种红葡萄品种；也指用这种葡萄（最常见为赤霞珠 Cabernet Sauvignon）酿成的红葡萄酒。"},"examples":[{"en":"I ordered a glass of cabernet with dinner.","zh":"我晚餐点了一杯赤霞珠红酒。"},{"en":"This cabernet has flavors of black cherry and a hint of oak.","zh":"这款赤霞珠有黑樱桃的风味，并带一点橡木气息。"},{"en":"They planted cabernet grapes on the sunny hillside.","zh":"他们在阳光充足的山坡上种了赤霞珠葡萄。"}]}],"synonyms":["Cabernet Sauvignon","red wine"],"phonetic":"/ˌkæbərˈneɪ/","extraExplanation":["“Cabernet”在日常点酒时常被当作“Cabernet Sauvignon（赤霞珠）”的简称，但严格说它也可能泛指“Cabernet family（卡本内/解百纳家族）”的葡萄品种（如Cabernet Franc 品丽珠）。在酒单或对话里若只写/说cabernet，多半默认是Cabernet Sauvignon。","赤霞珠常见口感词汇：tannins（单宁感更明显）、full-bodied（酒体饱满）、blackcurrant/black cherry（黑加仑/黑樱桃风味）、oak/vanilla（橡木/香草，常来自橡木桶陈酿）。"]}
{"word":"cabernets","summary":{"en":"“Cabernets” is the plural of “cabernet,” meaning Cabernet wines (especially Cabernet Sauvignon) or the grapes used to make them.","zh":"“cabernets”是“cabernet”的复数，指卡本内类葡萄酒（尤指赤霞珠）或用于酿造它们的葡萄。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural) Cabernet wines or grapes, especially Cabernet Sauvignon; a well-known type of red wine (and the grape used to make it).","zh":"（复数）卡本内（葡萄酒或葡萄），尤指赤霞珠；一种著名的红葡萄酒（及其酿酒葡萄品种）。"},"examples":[{"en":"The menu pairs best with full-bodied reds like cabernets.","zh":"这份菜单最适合搭配像卡本内这类酒体饱满的红酒。"},{"en":"They opened two cabernets—one from California and one from Chile.","zh":"他们开了两瓶卡本内红酒——一瓶来自加州，一瓶来自智利。"},{"en":"The vineyard grows cabernets and merlot.","zh":"这个葡萄园种植卡本内和梅洛。"}]}],"synonyms":["Cabernet Sauvignon (more specific)","red wine (broader)","cabernet (singular)"],"phonetic":"/ˌkæbɚˈneɪ/","extraExplanation":["“cabernets”常见于口语和餐饮语境，表示“多种/多瓶卡本内红酒”，而不是指单一品牌。单数通常说“a cabernet”或更具体的“Cabernet Sauvignon”。","在品鉴描述里，Cabernet类红酒常被形容为单宁（tannins）较明显、黑加仑/黑樱桃风味、适合搭配牛排等红肉；但具体风格会因产区与酿造方式而变化。","大写“Cabernet”多用于葡萄品种或酒款名称（如 Cabernet Sauvignon），小写“cabernet(s)”更像普通名词用法。"]}
{"word":"cabers","summary":{"en":"Cabers are heavy wooden poles (tree trunks) used mainly in the Scottish sport of caber tossing.","zh":"Cabers 指用于苏格兰传统“掷杆”运动的沉重木杆（多为树干）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of caber) A long, heavy wooden pole (often a tree trunk) used in the Scottish sport called the “caber toss.”","zh":"（caber 的复数）一种又长又重的木杆（常为树干），用于苏格兰传统运动“掷杆（caber toss）”。"},"examples":[{"en":"Athletes at the Highland Games trained for months to lift and flip the cabers.","zh":"高地运动会的选手为举起并翻转这些木杆训练了好几个月。"},{"en":"The judge inspected the cabers to make sure they were similar in size.","zh":"裁判检查这些木杆，确保它们大小相近。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) Large wooden beams or tree trunks, especially in Scottish English.","zh":"（较少见）大型木梁或粗大的树干，尤见于苏格兰英语。"},"examples":[{"en":"They dragged cabers from the hillside to build a simple bridge.","zh":"他们把山坡上的粗木拖下来，搭了一座简易桥。"}]}],"synonyms":["logs","poles","tree trunks","beams"],"phonetic":"/ˈkeɪbər/","extraExplanation":["“caber”最常与苏格兰的 Highland Games（高地运动会）相关。“掷杆”不是比谁扔得远，而是看选手把木杆立起后向前翻转，最终落地时的方向是否接近“12点钟”位置。","在日常英语里更常见的是单数 caber；复数 cabers 多出现在介绍比赛、器材检查或历史文化的语境中。"]}
{"word":"Cabery","summary":{"en":"Cabery is mainly used as a U.S. place name (a village in Illinois).","zh":"Cabery 主要用作美国地名（伊利诺伊州的一个村庄）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small village in Illinois, USA (a proper noun/place name)","zh":"美国伊利诺伊州的一个小村庄（专有名词/地名）"},"examples":[{"en":"Cabery is a small community in Illinois.","zh":"Cabery 是伊利诺伊州的一个小社区。"},{"en":"She drove through Cabery on her way to Chicago.","zh":"她去芝加哥的路上开车经过了 Cabery。"}]}],"phonetic":"/ˈkeɪbəri/","extraExplanation":["“Cabery”通常不作为普通英语单词使用，而是更常见于地名或姓氏等专有名词。如果你原本想查的是发音相近或拼写相似的词（例如 Cabernet /ˌkæbərˈneɪ/ 一种红葡萄酒，或 bribery /ˈbraɪbəri/ 贿赂），可以告诉我你的语境（句子或主题），我可以帮你确认。"]}
{"word":"cabestro","summary":{"en":"Cabestro is a Spanish word meaning an animal halter/lead rope, and it can also mean a figurative restraint.","zh":"cabestro 是西班牙语，常指牵牲畜的笼头/牵绳，也可引申为“束缚、羁绊”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a halter (a rope/strap) used to lead or restrain an animal, especially a horse or cattle","zh":"（牵引或拴住牲畜用的）笼头；缰绳（尤指马或牛）"},"examples":[{"en":"The farmer put a cabestro on the horse before leading it to the barn.","zh":"农夫先给马套上 cabestro（笼头/牵绳），再把它牵到谷仓。"},{"en":"Hold the cabestro tightly so the calf doesn’t run off.","zh":"把 cabestro 抓紧，免得小牛跑掉。"}]},{"partOfSpeech":"n.","definition":{"en":"figuratively, a restraint or control (something that “holds you back”)","zh":"（比喻）束缚；羁绊；控制（让人难以自由行动的东西）"},"examples":[{"en":"He spoke of fear as a cabestro that kept him from changing his life.","zh":"他把恐惧说成一种 cabestro（束缚），让他不敢改变人生。"}]}],"synonyms":["halter","lead rope","rein","restraint","constraint"],"phonetic":"/kəˈbɛstroʊ/","extraExplanation":["这是一个西班牙语词（cabestro）。在日常语境里多指“牵引牲畜的绳/笼头”，在乡村牧场、赶牛赶马等场景常见。","在某些西语文化语境（如牧牛、斗牛相关叙述）中，cabestro 也可指用来牵引或引导牛只移动的牵引用具；引申为“束缚、羁绊”的比喻用法也比较常见。"]}
{"word":"cabestros","summary":{"en":"Cabestros is a Spanish plural noun meaning halters/lead ropes, and by extension leader or decoy animals (or guides) used to control or guide other animals.","zh":"cabestros 是西语复数名词，主要指笼头/牵绳，也可引申指用来引导其他动物的“领头牲口”或“引导者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) plural of cabestro: a halter or lead rope used to control an animal (especially a horse, mule, or ox).","zh":"（西语）cabestro 的复数：用于牵引、控制动物（尤指马、骡或牛）的笼头或牵绳。"},"examples":[{"en":"The ranch hands tied the cabestros to the horses before moving the herd.","zh":"牧场工人先把牵绳（cabestros）系在马身上，然后才赶着牛群移动。"},{"en":"He grabbed the cabestros and led the mule out of the corral.","zh":"他抓起牵绳（cabestros），把骡子从围栏里牵出来。"}]},{"partOfSpeech":"n.","definition":{"en":"(Spanish) people/animals used as decoys or leaders to guide other animals (by leading them with a halter).","zh":"（西语）用来“带路/引导”的人或动物（借助牵绳带动其他动物前进），也可引申为“带头的、引导者”。"},"examples":[{"en":"They used trained cabestros to guide the bulls into the pen.","zh":"他们用训练过的“领头牲口”（cabestros）把公牛引进圈里。"},{"en":"In the story, the cabestros lead the rest without resistance.","zh":"在故事里，这些“带头者”（cabestros）毫不反抗地带着其余的跟随者前进。"}]}],"synonyms":["halter","lead rope","rein","tether","decoy animal","lead animal"],"phonetic":"kɑˈbɛstɹoʊs","extraExplanation":["“cabestros”来自西班牙语，常见于讲述西语文化背景的牧场、斗牛或边境题材文字中。日常英语里不算常用词，更多会直接用英语的 halter（笼头）、lead rope（牵绳）或 decoy/leader animal（引领用的动物）。","在一些语境里它也带有比喻色彩，指“被牵着走/带头引导他人”的角色；阅读时要根据上下文判断是在说器具（牵绳/笼头）还是“领头牲口/引导者”。"]}
{"word":"Cabet","summary":{"en":"Cabet is usually a proper noun referring to Étienne Cabet, a French utopian socialist linked to the Icarian movement.","zh":"Cabet 通常指法国空想社会主义者艾蒂安·卡贝，与“伊卡利亚派/伊卡利亚运动”相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Étienne Cabet (1788–1856), a French political thinker and utopian socialist best known for promoting an ideal community described in his novel *Voyage en Icarie* and for inspiring the “Icarians,” who attempted communal settlements (especially in the United States).","zh":"艾蒂安·卡贝（Étienne Cabet，1788–1856），法国政治思想家与空想社会主义者，以乌托邦小说《伊卡利亚之旅》（*Voyage en Icarie*）及其追随者“伊卡利亚派”（Icarians）在（尤其是）美国建立公社的实践而闻名。"},"examples":[{"en":"Cabet’s ideas influenced a group of followers who tried to build an Icarian community in America.","zh":"卡贝的思想影响了一批追随者，他们尝试在美国建立伊卡利亚公社。"},{"en":"In a history class, we read about Cabet alongside other utopian thinkers of the 1800s.","zh":"在历史课上，我们把卡贝与19世纪其他乌托邦思想家一起学习。"}]}],"synonyms":["Étienne Cabet","Icarian (related term)"],"phonetic":"/kəˈbeɪ/","extraExplanation":["“Cabet”在英语里通常作为专有名词出现（人名），不常用作普通词汇。阅读历史或社会思想类文本时可能会遇到。","他提出的“伊卡利亚”（Icarie/Icaria）是一种理想化的平等社会设想；“Icarian”常用来指与其相关的社群、成员或理念。"]}
{"word":"Cabeus","summary":{"en":"Cabeus is the name of a crater near the Moon’s south pole.","zh":"Cabeus 是月球南极附近一座陨石坑的名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a lunar impact crater near the Moon’s south pole, known for permanently shadowed regions where ice may exist.","zh":"月球南极附近的一座撞击坑（陨石坑）；因部分区域常年无阳光照射，被认为可能存在冰等挥发物。"},"examples":[{"en":"Scientists targeted Cabeus because its floor stays in permanent shadow.","zh":"科学家选择以 Cabeus 为目标，是因为它的坑底常年处在永久阴影中。"},{"en":"The LCROSS mission sent an impactor into Cabeus to study what was kicked up.","zh":"LCROSS 任务把撞击器撞入 Cabeus，以研究被溅起的物质。"}]}],"phonetic":"ˈkæbiəs","extraExplanation":["Cabeus 是一个“专有名词”，通常指月球地名（陨石坑名称），在日常英语里不常见，但在天文学与航天新闻中会出现。","该陨石坑以17世纪耶稣会学者/数学家 Nicolaus Cabeus 命名。","2009 年 NASA 的 LCROSS 任务曾选择在 Cabeus 附近进行撞击实验，并在喷射物中发现与水有关的信号，因此它常被提到与“月球水冰”研究相关。"]}
{"word":"cabeza","summary":{"en":"“Cabeza” is Spanish for “head,” and it can also mean the “top/front” of something or a “leader/head” of a group in common expressions.","zh":"“cabeza”是西班牙语的“头/头部”，也可指事物的顶端/前端，或在固定表达中表示“负责人/领导者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the head (the part of the body that contains the brain, face, eyes, etc.)","zh":"头；头部（包含大脑与脸部等的身体部位）"},"examples":[{"en":"Me duele la cabeza.","zh":"我头疼。"},{"en":"Lleva un sombrero en la cabeza.","zh":"他/她头上戴着一顶帽子。"}]},{"partOfSpeech":"n.","definition":{"en":"the top or front part of something; the “head” end","zh":"（事物的）顶端；前端；“头”部"},"examples":[{"en":"Está al pie de la cama, no a la cabeza.","zh":"它在床尾，不在床头。"},{"en":"Escriba su nombre en la cabeza de la página.","zh":"请把名字写在页眉（页面顶部）。"}]},{"partOfSpeech":"n.","definition":{"en":"a leader or main person in a group (common in set phrases)","zh":"领导者；负责人（常见于固定搭配）"},"examples":[{"en":"Ella está a la cabeza del proyecto.","zh":"她在负责这个项目／她带领这个项目。"},{"en":"El jefe de policía es la cabeza del departamento.","zh":"警察局长是该部门的负责人。"}]}],"synonyms":["head","leader","chief"],"phonetic":"/kaˈβe.sa/","extraExplanation":["“cabeza”是西班牙语中非常常见的词，来自拉丁语 *capitia*（与英语 *capital*、*captain* 等词同源，核心含义与“头/首/主”有关）。","在拉美饮食文化里你可能会见到 *tacos de cabeza*（“头肉塔可”，通常指牛头部位的肉）。在英语语境中它常作为菜名或地名的一部分出现。","常见搭配：*de cabeza*（头朝下/直接地，如 *tirarse de cabeza* 纵身一跳）、*tener buena/mala cabeza*（记性好/记性差或“脑子好/不太灵”）。"]}
{"word":"cabezon","summary":{"en":"Cabezon can mean a Pacific coast food fish, and (from Spanish) a stubborn “big-headed” person or “stubborn.”","zh":"cabezon 可指太平洋沿岸一种可食用海鱼；也可源自西语，表示“固执的大头”之人或“固执的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in English, especially in California) a marine fish, often a type of sculpin, used as seafood; “cabezon.”","zh":"（英语中，尤指加州）一种海鱼，常指一种杜父鱼（sculpin），可食用；“cabezon/大头鱼”。"},"examples":[{"en":"The restaurant’s special was grilled cabezon with lemon and herbs.","zh":"这家餐厅的特色菜是柠檬香草烤加州大头鱼（cabezon）。"},{"en":"Cabezon is a popular catch along the Pacific coast.","zh":"cabezon 是太平洋沿岸很受欢迎的渔获。"}]},{"partOfSpeech":"n.","definition":{"en":"(from Spanish) a stubborn or “big-headed” person; someone who won’t change their mind.","zh":"（源自西班牙语）固执的人；“大头症/自以为是”的人。"},"examples":[{"en":"Don’t be such a cabezon—listen to other people’s ideas.","zh":"别这么固执（cabezon）——听听别人的想法。"},{"en":"He’s kind, but a bit cabezon when it comes to plans.","zh":"他人很好，但在计划这件事上有点固执（cabezon）。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Spanish use) stubborn; big-headed; headstrong.","zh":"（西语用法）固执的；自以为是的；倔强的。"},"examples":[{"en":"She can be cabezon, but she usually means well.","zh":"她有时很倔（cabezon），但通常是出于好意。"},{"en":"Stop being cabezon and try a different approach.","zh":"别再固执（cabezon）了，换个方法试试。"}]}],"synonyms":["stubborn","hardheaded","headstrong","bullheaded","sculpin"],"phonetic":"ˌkɑːbəˈzoʊn","extraExplanation":["“cabezón”在西班牙语里本义与“cabeza（头）”有关，字面有“头很大”的意思，因此引申为“固执、自负”。英语里常见拼写为不带重音符号的“cabezon”。","在美国英语语境中，“cabezon”最常见的是指一种太平洋沿岸的可食用海鱼；在菜单或钓鱼/海鲜话题里出现的概率更高。","如果你在英语句子里用它表示“固执的人”，多半带有西语/拉美文化语境或口语化、带点玩笑的语气；正式写作中更常用“stubborn”或“hardheaded”。"]}
{"word":"cabezone","summary":{"en":"Cabezon most commonly refers to a big-headed Pacific fish; informally it can also mean a stubborn, big-headed person (from Spanish).","zh":"cabezon 最常指太平洋沿岸的一种“头大”的鱼；口语中也可指固执、逞强（“大头”）的人（源自西班牙语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large West Coast Pacific fish (also called the cabezon), known for a big head and bottom-dwelling habits","zh":"（北美西海岸常见的）加州大头鱼/石头鱼（cabezon），因头大、栖息于海底附近而得名"},"examples":[{"en":"We caught a cabezon near the rocky shore.","zh":"我们在岩石海岸附近钓到了一条cabezon（大头鱼）。"},{"en":"Cabezon is a popular fish for seafood stews on the West Coast.","zh":"在美国西海岸，cabezon常被用来做海鲜炖汤。"}]},{"partOfSpeech":"n.","definition":{"en":"a stubborn or “big-headed” person (informal; from Spanish)","zh":"固执的人；“大头症/自以为是的人”（非正式；源自西班牙语）"},"examples":[{"en":"Don’t be such a cabezon—listen to the feedback.","zh":"别这么固执（别当cabezon）——听听反馈。"},{"en":"He’s a bit of a cabezon, but he means well.","zh":"他有点固执，但本意是好的。"}]}],"synonyms":["cabezon fish","bullhead (informal, not exact)","stubborn person (informal)"],"phonetic":"/ˌkɑːbəˈzoʊn/","extraExplanation":["cabezon 源自西班牙语 cabezón（字面意思是“头很大的人/东西”）。英语里常把重音符号省略写成 cabezon，但含义仍与“头大”有关，因此既可指鱼名，也可用来形容人固执、逞强（语气偏口语）。","作为鱼名时，cabezon 在美国太平洋沿岸较常见；作为“固执的人”的用法更常出现在带有西语文化背景的语境中（例如美西南地区或双语社群）。"]}
{"word":"cabezones","summary":{"en":"“Cabezones” is Spanish for stubborn/big-headed people, and it can also mean the plural of “cabezon,” a Pacific Coast fish.","zh":"“Cabezones”是西语，常指“固执/自负的人们”，也可作鱼名“cabezon（加州拟鲉）”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish plural) People who are “big-headed” or stubborn; sometimes used jokingly or as an insult, depending on tone.","zh":"（西语复数）指“头很大的人 / 自负的人 / 很固执的人”；语气可开玩笑也可带贬义，取决于语境。"},"examples":[{"en":"Don’t be so stubborn—no seas tan cabezón; you guys are acting like cabezones.","zh":"别这么固执——别这么“cabezón”；你们这样简直像一群“cabezones”（固执鬼）。"},{"en":"He called himself a cabezón, laughing at how hard it is for him to change his mind.","zh":"他笑着说自己是个“cabezón”，调侃自己很难改变想法。"}]},{"partOfSpeech":"n.","definition":{"en":"(Also written in English as cabezon/cabezones) A large Pacific Coast fish: the cabezon.","zh":"（英语里也可写作 cabezon/cabezones）一种太平洋沿岸的大型鱼类：加州拟鲉（cabezon）。"},"examples":[{"en":"The menu listed grilled cabezon; the server said it was a local catch.","zh":"菜单上有烤 cabezon；服务员说这是本地捕捞的鱼。"},{"en":"Anglers sometimes talk about catching “cabezones” near rocky shorelines.","zh":"钓鱼人有时会说在岩石海岸附近钓到“cabezones”（cabezon 的复数）。"}]}],"synonyms":["stubborn people","hardheads","big-heads","cabezons"],"phonetic":"/ˌkɑbəˈzoʊnɛs/","extraExplanation":["“cabezones”来自西语单数“cabezón”，字面意思是“（大）头的”。在日常对话里既可以形容人“自负、爱逞强”，也常指“很固执、认死理”；是否冒犯主要看说话关系与语气。","作为鱼名时，英语里更常见单数拼写“cabezon”，复数多写“cabezons”（更英语化），但在保留西语风格的语境中也能见到“cabezones”。"]}
{"word":"cabezons","summary":{"en":"“cabezons” is an informal Spanish-borrowed word meaning stubborn or big-headed people.","zh":"“cabezons”是一个非正式的西语借词，指固执或自负（“大头”）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(borrowed from Spanish, informal) Stubborn or “big-headed” people; thickheads. (Plural of Spanish cabezón.)","zh":"（源自西班牙语，非正式）固执、自负（“大头”）的人；顽固的人。（西语 cabezón 的复数）"},"examples":[{"en":"Stop arguing with those cabezons—they won’t change their minds.","zh":"别再跟那些顽固的人争了——他们不会改主意的。"},{"en":"He’s a bit of a cabezón, but he’s loyal.","zh":"他有点固执，但很讲义气。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adj., rare/Spanish-influenced) Stubborn; pigheaded; big-headed.","zh":"（形容词，较少见/带西语影响）固执的；自以为是的；“大头”的。"},"examples":[{"en":"Don’t be so cabezón—listen for a minute.","zh":"别那么固执——先听我说一分钟。"}]}],"synonyms":["stubborn people","thickheads","hardheads","pigheads"],"phonetic":"/ˌkɑːbəˈzoʊnz/","extraExplanation":["“cabezón”在西班牙语里字面意思是“头很大的人”，常用来形容一个人顽固、爱逞强或自负。你写的“cabezons”很可能是英语语境里的简写拼法；更接近西语规范的复数是“cabezones”。在美国西南部等双语地区，偶尔会出现在口语或带地域色彩的写作中。"]}
{"word":"cabful","summary":{"en":"Cabful means a cab’s worth of something—an amount that fits in one cab.","zh":"Cabful 指“一出租车的量”，也就是一辆出租车能装下的数量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the amount that can fit in one cab (a “cab load”)","zh":"一出租车的载量；一车（出租车）能装下的量"},"examples":[{"en":"We hauled a cabful of boxes to the new apartment.","zh":"我们用出租车运了一车箱子到新公寓。"},{"en":"A cabful of tourists stopped in front of the museum.","zh":"一车游客在博物馆门前停了下来。"}]}],"synonyms":["cabload","taxi load","carload"],"phonetic":"/ˈkæb.fəl/","extraExplanation":["“cabful”是由“cab（出租车）+ -ful（表示‘满……的量’）”构成，和“handful（一把）”“cupful（一杯）”“carful（一车）”同类。","这是一个比较口语、临时造出来也能被理解的量词，用在描述“装满一辆出租车的数量”。在正式写作中更常见的是“a cabload of …”或“a taxi load of …”。"]}
{"word":"cabiai","summary":{"en":"“cabiai” isn’t a standard English word; you may mean “cabbie,” an informal term for a taxi driver.","zh":"“cabiai”不是标准英文单词；你可能想查的是“cabbie”，表示“出租车司机”的口语说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended) an informal word for a taxi driver.","zh":"（可能你想查的是）“出租车司机”的非正式说法。"},"examples":[{"en":"I asked the cabbie to take me to the train station.","zh":"我让出租车司机带我去火车站。"},{"en":"The cabbie knew a faster route through downtown.","zh":"那位出租车司机知道一条穿过市中心更快的路线。"}]}],"synonyms":["taxi driver","cab driver"],"phonetic":"/ˈkæbi/","extraExplanation":["你输入的“cabiai”不是常见的英文单词，可能是拼写误差。最接近、最常见的词是 **cabbie**（出租车司机，口语/非正式）。","**cabbie** 来自 **cab**（出租车）+ 口语后缀 **-ie**，语气比较随意；在正式场合更常说 **taxi driver**。"]}
{"word":"cabildo","summary":{"en":"Cabildo means a local municipal council in Spanish-speaking regions, especially in colonial history, and can also refer to the council’s meeting building.","zh":"Cabildo 指西班牙语地区的地方市政议会（尤其是殖民时期的治理机构），也可指该议会开会的市政厅建筑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Spanish-speaking regions, especially in Latin America) a municipal council or governing body, historically common in the Spanish colonial period.","zh":"（在西班牙语地区，尤指拉丁美洲）市政议会／地方自治机构；历史上常见于西班牙殖民时期。"},"examples":[{"en":"During the colonial era, the cabildo managed local taxes, markets, and public works.","zh":"在殖民时期，cabildo 负责管理地方税收、市场和公共工程。"},{"en":"The mayor met with the cabildo to discuss new rules for the town.","zh":"市长与 cabildo 会面，讨论城镇的新规定。"}]},{"partOfSpeech":"n.","definition":{"en":"A building where a cabildo meets; a town hall or council chamber (common in historical contexts).","zh":"cabildo 开会的建筑；市政厅／议事厅（多用于历史语境）。"},"examples":[{"en":"Tourists visited the old cabildo in the center of the city.","zh":"游客参观了市中心那座古老的 cabildo（市政厅）。"},{"en":"The documents were stored in the cabildo for centuries.","zh":"这些文件在 cabildo（市政厅）里保存了数百年。"}]}],"synonyms":["town council","municipal council","city council (approx.)","town hall (building sense)"],"phonetic":"/kəˈbɪl.doʊ/","extraExplanation":["cabildo 来自西班牙语，源头可追溯到拉丁语 *capitulum*（“小章节／会议”之意）。在西班牙帝国的殖民体系中，cabildo 往往是地方政治权力的核心，负责城市治理、治安、商业管理等。","在一些国家的历史叙述中（如阿根廷、墨西哥等），cabildo 也常与独立运动或地方精英政治联系在一起，因此在历史文章与博物馆介绍里很常见。"]}
{"word":"cabildos","summary":{"en":"Cabildos are local councils in Spanish-speaking regions (especially colonial Latin America); in some Caribbean contexts they can also mean Afro-Caribbean community organizations.","zh":"Cabildos 指西语地区的地方议会（尤指殖民时期拉丁美洲的市政议会）；在一些加勒比语境中也可指与非裔加勒比传统相关的社群组织。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of cabildo) Local governing councils or town councils in Spanish-speaking regions, especially in colonial Latin America.","zh":"（cabildo 的复数）西语地区的地方议会/市政议会，尤指拉丁美洲殖民时期的城镇议会。"},"examples":[{"en":"In colonial Mexico, cabildos managed local taxes and public works.","zh":"在殖民时期的墨西哥，cabildos 负责地方税收和公共工程。"},{"en":"The historian studied how cabildos influenced everyday life in the city.","zh":"这位历史学家研究了 cabildos 如何影响城市的日常生活。"}]},{"partOfSpeech":"n.","definition":{"en":"In some Caribbean contexts, community organizations—often linked to Afro-Caribbean religious and mutual-aid traditions—also called cabildos (e.g., in Cuba).","zh":"在一些加勒比语境中，也可指与非裔加勒比宗教与互助传统相关的社群组织（如古巴的 cabildos）。"},"examples":[{"en":"In Cuba, some cabildos helped preserve African languages and rituals.","zh":"在古巴，一些 cabildos 帮助保存非洲语言与仪式。"},{"en":"The museum exhibit explained the role of cabildos in community support networks.","zh":"博物馆展览解释了 cabildos 在社区互助网络中的作用。"}]}],"synonyms":["town councils","city councils","municipal councils","local councils"],"phonetic":"/kəˈbiːldoʊz/","extraExplanation":["“cabildo”来自西班牙语，最早可追溯到中世纪伊比利亚半岛的市政机构；在西班牙帝国扩张后，这套制度被带到美洲殖民地，用于管理地方行政与社会秩序。","在拉丁美洲独立运动前后，cabildos有时会召开“cabildo abierto”（公开议会/扩大会议），让更多地方精英参与讨论重大事件，这在政治史中常被提及。","英语写作中常保留西语形式cabildo/cabildos，多用于历史、政治或人类学语境；一般英语日常表达更常用“town council / city council”。"]}
{"word":"cabilliau","summary":{"en":"Cabilliau is most likely a surname (a proper name), not a standard English word.","zh":"Cabilliau 很可能是一个姓氏（专有名词），不是标准英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A family name (surname). It is not a common English vocabulary word and is most likely a French- or Belgian-origin last name used as a proper noun.","zh":"一个姓氏（家族姓）。它不是常见英语词汇，更可能是法语区或比利时来源的姓，用作专有名词。"},"examples":[{"en":"Ms. Cabilliau will lead the meeting today.","zh":"Cabilliau 女士今天将主持会议。"},{"en":"I saw the name Cabilliau on the conference program.","zh":"我在会议议程上看到了 Cabilliau 这个名字。"}]}],"phonetic":"/ˌkæbɪˈjoʊ/","extraExplanation":["“Cabilliau”作为专有名词通常不翻译；写作时要注意大小写（首字母大写）。","如果你是在找某个英语单词的意思，可能存在拼写差异。你可以告诉我它出现的句子/上下文，或确认是否想查相近拼写（例如 Cabiliau、Cabillau 等），我可以再帮你核对。"]}
{"word":"Cabimas","summary":{"en":"Cabimas is a city in western Venezuela near Lake Maracaibo, historically linked to oil production.","zh":"Cabimas（卡维马斯）是委内瑞拉西部靠近马拉开波湖的一座城市，历史上与石油产业密切相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in western Venezuela, in Zulia state near Lake Maracaibo, known historically for oil production.","zh":"委内瑞拉西部苏利亚州的一座城市，靠近马拉开波湖，历史上以石油产业闻名。"},"examples":[{"en":"Cabimas is located near Lake Maracaibo in western Venezuela.","zh":"卡维马斯（Cabimas）位于委内瑞拉西部，靠近马拉开波湖。"},{"en":"Many people associate Cabimas with Venezuela’s early oil boom.","zh":"许多人把卡维马斯与委内瑞拉早期的石油繁荣联系在一起。"}]}],"synonyms":["(proper noun; no true synonyms)"],"phonetic":"/kəˈbiːmɑs/","extraExplanation":["“Cabimas”是西班牙语地名；英语里通常当作专有名词使用（城市名），一般不加复数。","卡维马斯在20世纪因石油开采而快速发展，常出现在有关马拉开波湖盆地石油史的文章或纪录片中。"]}
{"word":"cabin","summary":{"en":"A cabin is a small simple house (often in nature) or a private compartment on a ship/train, and it can also mean the passenger area of an airplane.","zh":"cabin 可指乡间小木屋，也可指船/火车的舱室或飞机的客舱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, simple house, often made of wood and located in the countryside or mountains.","zh":"（通常为木制的）小屋；简朴的小房子（常在乡村或山林中）。"},"examples":[{"en":"They rented a cabin by the lake for the weekend.","zh":"他们周末租了一间湖边小木屋。"},{"en":"The old cabin had a fireplace and a porch.","zh":"那间旧小屋有壁炉和门廊。"}]},{"partOfSpeech":"n.","definition":{"en":"A private room or compartment on a ship or train for sleeping or staying.","zh":"（船或火车上的）客舱；卧舱；包厢。"},"examples":[{"en":"We booked a cabin on the overnight train.","zh":"我们订了夜行火车的卧舱。"},{"en":"The captain’s cabin was at the back of the ship.","zh":"船长的舱室在船尾。"}]},{"partOfSpeech":"n.","definition":{"en":"The passenger area inside an airplane; the main interior where seats are.","zh":"（飞机的）客舱；机舱（乘客坐的区域）。"},"examples":[{"en":"Please keep your voice low in the cabin during the night flight.","zh":"夜间航班期间请在客舱内降低音量。"},{"en":"Cabin crew will serve drinks after takeoff.","zh":"起飞后乘务员会提供饮料。"}]},{"partOfSpeech":"v.","definition":{"en":"To stay in a small, enclosed place; to live privately or away from others (often used with “up”).","zh":"把自己关在狭小封闭的地方；隐居（常与 up 连用）。"},"examples":[{"en":"He cabined up in the mountains to write his novel.","zh":"他躲到山里小屋闭关写小说。"},{"en":"After the storm, we cabined indoors and played cards.","zh":"暴风雨后，我们窝在屋里打牌。"}]}],"synonyms":["hut","cottage","lodge","compartment","stateroom"],"phonetic":"/ˈkæbɪn/","extraExplanation":["“cabin”在英语里既可以指“乡间小木屋”，也常见于旅行场景：船上的舱室、火车卧铺包厢、飞机客舱。搭配很实用：cabin crew（乘务员/空乘）、cabin fever（因长时间待在室内而烦躁）、log cabin（原木小屋）。","在北美文化中，“cabin”常带有度假、户外、亲近自然的感觉（例如去山里或湖边住 cabin），比“house”更强调小、简朴与自然环境。"]}
{"word":"cabin cruiser","summary":{"en":"A cabin cruiser is a pleasure motorboat with a small cabin for resting or sleeping.","zh":"cabin cruiser 指带小舱室、可休息或过夜的休闲机动游艇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a motorboat used for pleasure that has a small cabin where people can rest or sleep","zh":"（休闲用的）游艇式机动船；带小舱室可休息或过夜的游艇"},"examples":[{"en":"They rented a cabin cruiser for a weekend trip on the lake.","zh":"他们租了一艘带舱游艇，在湖上玩了一个周末。"},{"en":"A cabin cruiser usually has basic comforts like a berth and a small kitchen area.","zh":"带舱游艇通常有一些基本设施，比如铺位和小型料理区。"}]}],"synonyms":["cabin boat","motor cruiser","(small) motor yacht"],"phonetic":"/ˈkæbɪn ˈkruːzɚ/","extraExplanation":["“cabin cruiser”常用于北美语境，指介于小快艇与大型游艇之间的休闲船只：既能巡航（cruise），又有可遮风避雨、短住的舱室（cabin）。","相关近义表达：\"motor yacht\"（机动游艇，往往更大更豪华）、\"cruiser\"（更泛指巡航船/巡航摩托艇，未必有舱）、\"houseboat\"（船屋，更偏长期居住）。","在小说或旅行写作中，它常用来营造“水上度假/周末逃离城市”的画面，如：\"They drifted along the shore in a cabin cruiser.\"（他们乘着带舱游艇沿岸缓缓漂行。）"]}
{"word":"cabin-like","summary":{"en":"“Cabin-like” means having the cozy, rustic, or compact feel/style of a cabin.","zh":"“cabin-like”指“具有小木屋那种温馨、质朴或紧凑的风格/感觉”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Similar to a cabin (a small, simple wooden house), especially in being cozy, rustic, or compact.","zh":"像小木屋的；具有小木屋那种温馨、质朴或紧凑感觉的。"},"examples":[{"en":"The hotel room had a cabin-like warmth, with pine walls and soft lighting.","zh":"这间酒店房间有种小木屋般的温暖感，松木墙板配上柔和的灯光。"},{"en":"They built a cabin-like reading nook in the corner of the living room.","zh":"他们在客厅角落打造了一个小木屋风格的阅读角。"}]}],"synonyms":["rustic","cozy","cottage-like","log-cabin-style","woodsy"],"phonetic":"/ˈkæbɪn laɪk/","extraExplanation":["“cabin-like”是由名词“cabin（小木屋/船舱/机舱）+ -like（像……一样）”组成的复合形容词，常用来描述风格与氛围：偏“木质、乡村、简朴、舒适”。在不同语境里也可能指“像船舱/机舱那样狭小的”，需要看上下文。","近义表达（语感略有差别）：“rustic（乡村质朴的）”“cozy（温馨舒适的）”“cottage-like（像乡间小屋的）”“log-cabin-style（原木小屋风格的）”。"]}
{"word":"Cabinda","summary":{"en":"Cabinda is an Angolan province that is geographically separated from the rest of Angola; it can also refer to its capital city.","zh":"Cabinda 指安哥拉的卡宾达省（与本土分离的飞地），也可指该省省会城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A province and exclave of Angola on the Atlantic coast, separated from the rest of Angola by a strip of the Democratic Republic of the Congo.","zh":"安哥拉的一个省兼飞地（卡宾达省），位于大西洋沿岸，与安哥拉本土之间被刚果民主共和国的一条狭长地带隔开。"},"examples":[{"en":"Cabinda is an exclave of Angola, located north of the Congo River’s mouth.","zh":"卡宾达是安哥拉的一个飞地，位于刚果河入海口以北。"},{"en":"Many maps show Cabinda separated from the main part of Angola.","zh":"许多地图会把卡宾达标成与安哥拉本土分离的一块区域。"}]},{"partOfSpeech":"n.","definition":{"en":"The capital city of Cabinda Province (also called Cabinda).","zh":"卡宾达省的首府城市（也叫“卡宾达”）。"},"examples":[{"en":"She flew to Cabinda for a short business trip.","zh":"她飞到卡宾达出差了几天。"}]}],"phonetic":"/kəˈbɪndə/","extraExplanation":["“Cabinda”在新闻与国际关系语境中常与石油资源、边界与地方政治讨论相关；因为它与安哥拉本土不相连，所以常被特别说明为“exclave（飞地）”。","发音小提示：重音在第二个音节（-BIN-）。"]}
{"word":"cabinda","summary":{"en":"Cabinda is an Angolan province on the Atlantic coast that is geographically separated from the rest of Angola.","zh":"Cabinda（卡宾达）是安哥拉的一个省，位于大西洋沿岸，地理上与安哥拉本土分离。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a province of Angola that is separated from the rest of the country (an enclave), located on the Atlantic coast north of the Congo River","zh":"安哥拉的一个省（卡宾达省）；与安哥拉本土分离的“飞地/外飞地”，位于刚果河以北的大西洋沿岸"},"examples":[{"en":"Cabinda is an Angolan province on the Atlantic coast.","zh":"卡宾达是安哥拉在大西洋沿岸的一个省。"},{"en":"Many maps show Cabinda as separated from the rest of Angola.","zh":"很多地图会显示卡宾达与安哥拉其他地区是分开的。"}]}],"synonyms":["Cabinda Province","Angolan exclave","enclave"],"phonetic":"/kəˈbɪndə/","extraExplanation":["卡宾达常被称为“安哥拉的外飞地（exclave）”，因为它与安哥拉主体之间隔着刚果民主共和国的一小段海岸线。","历史上这里与葡萄牙的殖民条约与边界安排有关，因此在政治与身份认同上较复杂。","卡宾达以石油资源闻名，经济与能源话题中常会提到该地区。"]}
{"word":"cabined","summary":{"en":"“Cabined” means tightly confined or cramped, often in a literary style.","zh":"“cabined”常指被困在狭小空间或受局限、憋闷的状态，偏文学用法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Confined to a small space; cramped; shut in.","zh":"被限制在狭小空间里的；拥挤的；受束缚的。"},"examples":[{"en":"After hours in the tiny office, I felt cabined and restless.","zh":"在那间很小的办公室待了好几个小时后，我感到憋闷又烦躁。"},{"en":"They lived cabined lives, rarely traveling beyond their hometown.","zh":"他们的生活很受局限，很少离开家乡远行。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) Placed in or living in a cabin; cabin-like in setting.","zh":"（较少见）住在小屋里（的）；像小木屋环境的。"},"examples":[{"en":"The hikers found a cabined shelter near the lake.","zh":"徒步者在湖边找到了一处小木屋式的避难所。"}]}],"synonyms":["confined","cramped","boxed in","hemmed in","restricted"],"phonetic":"/ˈkæbɪnd/","extraExplanation":["“cabined”最有名的用法来自莎士比亚《麦克白》中的一句：“cabined, cribbed, confined”（被关住、被束缚、被限制）。这里的“cabined”强调空间或生活圈子很小，带有压抑、受困的感觉。现代英语里它比较文学化，日常更常用 cramped / confined / boxed in。"]}
{"word":"cabineer","summary":{"en":"Cabineer is a rare noun meaning a person who lives in a cabin, or (historically) someone responsible for cabins on a ship.","zh":"Cabineer 是个罕见名词，指住在小木屋里的人；或（历史/航海语境中）负责船上舱房事务的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A person who lives in or stays in a cabin (a small, simple house).","zh":"（罕见）住在小木屋里的人；住客（小而简朴的房子）。"},"examples":[{"en":"In the old diary, the writer calls himself a lonely cabineer in the mountains.","zh":"在那本旧日记里，作者称自己为山里的孤独“小木屋住客”。"},{"en":"A few cabineers spent the winter in remote cabins near the lake.","zh":"有几位住客在湖边偏远的小木屋里过冬。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical, nautical; rare) Someone who works in or is responsible for cabins on a ship (similar to a cabin attendant or steward).","zh":"（历史用法/航海；罕见）在船上负责舱房事务的人（类似客舱服务员/乘务员或管事）。"},"examples":[{"en":"The cabineer prepared the small cabin before the passengers boarded.","zh":"这名负责舱房的人在乘客登船前把小舱室整理好。"},{"en":"In older texts, a cabineer may be mentioned alongside stewards.","zh":"在较早的文本中，“cabineer”有时会和“steward（管事/乘务员）”一起出现。"}]}],"synonyms":["cabin dweller","cabin resident","lodger","steward","cabin attendant","cabin boy"],"phonetic":"/ˌkæbəˈnɪr/","extraExplanation":["“cabineer”在现代英语中非常少见，日常更常用的说法是：住在小木屋里的人用“cabin dweller / cabin resident”，船上的工作则常用“steward”或“cabin attendant”。","学习时要注意别和“cabinet”（内阁/橱柜）或“cabinetmaker”（橱柜匠）混淆；拼写相近但含义不同。"]}
{"word":"cabinet","summary":{"en":"Cabinet most commonly means either a storage cupboard (furniture) or a country’s top group of government ministers.","zh":"cabinet 最常见指“柜子/橱柜（家具）”或“内阁（政府最高级部长团队）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A piece of furniture with doors and shelves or drawers, used for storing things (often in a kitchen, bathroom, or office).","zh":"（通常有门与隔层/抽屉的）柜子；橱柜（常见于厨房、浴室或办公室，用于收纳物品）。"},"examples":[{"en":"Put the cups back in the kitchen cabinet.","zh":"把杯子放回厨房橱柜里。"},{"en":"The file cabinet is full of old documents.","zh":"文件柜里塞满了旧文件。"}]},{"partOfSpeech":"n.","definition":{"en":"A group of the highest-ranking government ministers who advise the leader (such as the President or Prime Minister).","zh":"（政府）内阁；最高级别部长的团队（为总统或首相等领导人提供建议并负责重要部门）。"},"examples":[{"en":"The President met with the Cabinet to discuss the economy.","zh":"总统与内阁开会讨论经济问题。"},{"en":"She was appointed to the Cabinet as Secretary of State.","zh":"她被任命进入内阁，担任国务卿。"}]}],"synonyms":["cupboard","storage cabinet","cabinet (government)","ministerial council"],"phonetic":"/ˈkæbənət/","extraExplanation":["在英语里，cabinet 有两个非常常用的意思：一种是“柜子/橱柜”（家居语境），另一种是“内阁”（政治语境）。判断方法很简单：如果前后出现 kitchen / bathroom / file / storage 等词，多半是家具；如果出现 President / Prime Minister / minister / Secretary 等词，多半是政府内阁。","美式政治语境中，the Cabinet 通常特指总统的主要部长级官员（如 Secretary of State, Secretary of Defense 等），常写成大写表示“内阁”这一机构。"]}
{"word":"cabinet-level","summary":{"en":"“Cabinet-level” describes something as being as important as a top government minister’s rank, or involving a Cabinet member.","zh":"“cabinet-level”指“内阁级的”，强调与最高层政府部长同等级/重要性，或由内阁成员参与。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"At the same rank or importance as members of a country’s Cabinet (top government ministers), or involving a Cabinet member.","zh":"内阁级的；与国家内阁成员（最高政府部长）同等等级/重要性的；涉及内阁成员的。"},"examples":[{"en":"The president appointed a cabinet-level adviser on climate policy.","zh":"总统任命了一位气候政策的内阁级顾问。"},{"en":"The issue was discussed at a cabinet-level meeting.","zh":"这个问题在内阁级会议上讨论。"}]}],"synonyms":["ministerial-level","top-level","senior-level"],"phonetic":"/ˈkæbənət ˌlɛvəl/","extraExplanation":["“cabinet-level”常见于新闻与正式写作，强调职位的“级别”很高（接近或等同于内阁部长）。在美国语境中，Cabinet通常指总统的主要部长（如Secretary of State, Secretary of Defense等）；其他国家也可能用来指最高层的政府内阁。","也会见到类似表达：“ministerial-level”（部长级）用于国际会议或政府合作场景；“senior-level”（高层级）更通用但不一定指内阁。"]}
{"word":"cabineted","summary":{"en":"“Cabineted” is a rare adjective meaning “having cabinets” or “kept/enclosed in a cabinet.”","zh":"“cabineted”是一个较罕见的形容词，表示“带柜子的”或“被放在柜中/被柜子收纳的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Having a cabinet; enclosed or stored in a cabinet.","zh":"（罕见）有柜子的；被放在柜中或收纳在柜里的。"},"examples":[{"en":"The cabineted shelves kept the medicines out of children’s reach.","zh":"带柜门的架子把药品收好，避免孩子拿到。"},{"en":"In the museum, the cabineted specimens were protected from dust and damage.","zh":"在博物馆里，放在玻璃柜中的标本能防尘、防损坏。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) Furnished with cabinets; built with cabinet-style compartments.","zh":"（罕见）配有柜橱的；带柜式隔间的。"},"examples":[{"en":"They chose a cabineted wall unit for extra storage.","zh":"他们选了带柜式收纳的墙面组合柜来增加储物空间。"}]}],"synonyms":["with cabinets","fitted with cabinets","built-in","enclosed","stored"],"phonetic":"/ˈkæbənɪtɪd/","extraExplanation":["“cabineted”在现代英语里不常见，更自然的表达通常是“with cabinets / fitted with cabinets / built-in cabinets”或“stored in a cabinet”。在文学或较旧的描述性文字中，它可能用来强调“被收纳、被保护或被隔离起来”的感觉。"]}
{"word":"cabineting","summary":{"en":"Cabineting usually means cabinetry (installed cabinets) or the craft of making cabinets; as a verb it can mean putting something in a cabinet, but that use is rare.","zh":"cabineting 通常指“橱柜/柜体木作（cabinetry）”或“橱柜制作这门手艺”；作动词时可指“把东西放进柜子/安装柜体”，但较少见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"built-in wooden furniture such as cupboards, shelves, or cabinets (especially in a kitchen or bathroom); cabinetry.","zh":"（尤指厨房、浴室的）橱柜、壁柜等成套木作/柜体；即 cabinetry。"},"examples":[{"en":"The apartment has new cabineting in the kitchen.","zh":"这套公寓的厨房装了新的橱柜。"},{"en":"White cabineting makes the small room look brighter.","zh":"白色橱柜让小房间看起来更明亮。"}]},{"partOfSpeech":"n.","definition":{"en":"the work or craft of making and installing cabinets; cabinetmaking.","zh":"制作与安装橱柜的工艺/工作；柜体制作（cabinetmaking）。"},"examples":[{"en":"He studied cabineting and learned how to build custom cupboards.","zh":"他学习橱柜制作，学会了做定制储物柜。"},{"en":"Cabineting requires careful measuring and solid joinery.","zh":"橱柜制作需要精确测量和扎实的榫接/连接工艺。"}]},{"partOfSpeech":"v.","definition":{"en":"the act of putting something into a cabinet, or fitting a space with cabinets (rare; present participle of “cabinet”).","zh":"把东西放入柜中，或给空间安装橱柜（较少见；为动词 cabinet 的现在分词）。"},"examples":[{"en":"They are cabineting the electronics to keep them dust-free.","zh":"他们正把电子设备放进柜子里，以防落灰。"},{"en":"The contractor is cabineting the entire wall for extra storage.","zh":"承包商正在给整面墙装柜体以增加收纳。"}]}],"synonyms":["cabinetry","cabinets","built-in cabinets","cabinetmaking","woodwork"],"phonetic":"/ˈkæbənɪtɪŋ/","extraExplanation":["“cabineting”在日常英语里不如“cabinetry”常见；很多时候人们会说：new cabinetry / kitchen cabinetry。","拼写上注意：cabinet（柜子）→ cabinetry（橱柜总称/柜体木作）→ cabinetmaking（柜体制作这门手艺）。"]}
{"word":"cabinetmake","summary":{"en":"Cabinetmake means to make cabinets or fine wooden furniture, usually as skilled woodworking.","zh":"cabinetmake 指制作橱柜或精细木制家具，通常强调熟练的木工制作。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make cabinets or other fine wooden furniture (often as skilled, custom woodworking)","zh":"制作橱柜或其他精细木制家具（常指有技术的定制木工）"},"examples":[{"en":"He learned to cabinetmake from his grandfather and now builds custom kitchen cabinets.","zh":"他跟祖父学会了做橱柜，现在做定制的厨房橱柜。"},{"en":"The workshop cabinetmakes with solid wood rather than particleboard.","zh":"这家作坊用实木做柜子，而不是用刨花板。"}]}],"synonyms":["make cabinets","do cabinetmaking","build cabinets","craft cabinets"],"phonetic":"/ˈkæbənətˌmeɪk/","extraExplanation":["“cabinetmake”在现代英语里不算常见拼写；更常见的是动词短语“make cabinets”，或名词“cabinetmaking”（橱柜制作这门手艺/行业）与“cabinetmaker”（橱柜木匠/家具木匠）。在正式写作中通常优先用这些形式。","相关形式：cabinetmaking（n. 行业/技艺），cabinetmaker（n. 工匠）。"]}
{"word":"cabinetmaker","summary":{"en":"A cabinetmaker makes or repairs cabinets and other fine wooden furniture.","zh":"cabinetmaker 指制作或修理橱柜及其他精细木家具的工匠。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person whose job is making or repairing cabinets and other fine wooden furniture","zh":"橱柜木工；细木家具匠（制作或修理橱柜及其他精细木家具的人）"},"examples":[{"en":"We hired a cabinetmaker to build custom kitchen cabinets.","zh":"我们请了一位橱柜木工来定制厨房橱柜。"},{"en":"The cabinetmaker measured the wall carefully before cutting the wood.","zh":"木工在切割木材前仔细测量了墙面尺寸。"},{"en":"She apprenticed with a cabinetmaker to learn traditional woodworking.","zh":"她跟一位家具木工当学徒，学习传统木工技艺。"}]}],"synonyms":["cabinet builder","woodworker","joiner"],"phonetic":"/ˈkæbənətˌmeɪkər/","extraExplanation":["“cabinetmaker”通常指从事“细木工（fine woodworking）”的人，尤其擅长制作橱柜、抽屉、桌柜等需要精准榫接、打磨与表面处理的家具；比更宽泛的“carpenter（木匠）”更偏向精细家具制作。","在北美语境里，cabinetmaker常见于住宅装修与木作定制行业；也可能在家具工坊或“cabinet shop（橱柜作坊/橱柜工厂）”工作。相关常见搭配有：custom cabinets（定制橱柜）、built-in cabinetry（嵌入式柜体）、finish/finishing（上漆/做表面处理）。"]}
{"word":"cabinetmakers","summary":{"en":"Cabinetmakers are craftspeople who make or repair wooden cabinets and fine furniture.","zh":"Cabinetmakers 指制作或修理木质橱柜及精细家具的工匠。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person whose job is making and repairing wooden furniture—especially cabinets, cupboards, and other built-in or fine furniture","zh":"木工家具匠；橱柜/柜子制作工（专门制作与修理木质家具，尤其是橱柜、壁柜或精细家具的人）"},"examples":[{"en":"Cabinetmakers often build custom kitchen cabinets to fit a specific space.","zh":"柜子制作工常常会定制厨房橱柜，让它适配特定空间。"},{"en":"The antique desk was restored by skilled cabinetmakers.","zh":"这张古董书桌由技艺娴熟的木工家具匠修复。"},{"en":"In the 18th century, cabinetmakers created elegant furniture for wealthy families.","zh":"在18世纪，木工家具匠为富裕家庭制作精美家具。"}]}],"synonyms":["woodworker","furniture maker","joiner","carpenter"],"phonetic":"ˈkæbənətˌmeɪkər","extraExplanation":["“cabinetmaker(s)”是一个职业名词：cabinet在这里指“柜子/橱柜/小型精细家具”，maker是“制作的人”。在英语里它常与carpenter（木匠）区分：carpenter更偏建筑结构与粗木工，而cabinetmaker更强调精细家具与定制柜体的制作（如榫卯、打磨、上漆等）。"]}
{"word":"cabinetmaking","summary":{"en":"Cabinetmaking is the craft or trade of making cabinets and fine wooden furniture.","zh":"Cabinetmaking 指制作橱柜及精细木制家具的工艺或行业。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the craft or trade of making cabinets and other fine wooden furniture (often involving careful measuring, cutting, and joining of wood).","zh":"橱柜制作（工艺/行业）：制作橱柜及其他精细木制家具的手艺或职业（常包括精确测量、切割与榫接等工序）。"},"examples":[{"en":"He studied cabinetmaking at a vocational school and now builds custom kitchen cabinets.","zh":"他在职业学校学习橱柜制作，现在为客户定制厨房橱柜。"},{"en":"Cabinetmaking requires patience and attention to detail.","zh":"橱柜制作需要耐心和对细节的关注。"},{"en":"She’s interested in cabinetmaking because she enjoys working with wood and tools.","zh":"她对橱柜制作感兴趣，因为她喜欢木工和工具操作。"}]}],"synonyms":["woodworking","furniture making","cabinetry","joinery"],"phonetic":"/ˈkæbənətˌmeɪkɪŋ/","extraExplanation":["“Cabinetmaking”在英语里常指更偏“精细木工”（fine woodworking）的方向，不仅做“柜子”，也强调做工精密、外观与结构质量。与更泛的“carpentry（木工/粗木工）”相比，cabinetmaking通常更注重家具、橱柜等室内成品。","相关词：cabinetmaker（橱柜木匠/家具木匠）；joinery（木作榫接工艺/细木作，英式用法更常见）；custom cabinetry（定制橱柜）。"]}
{"word":"cabinetmakings","summary":{"en":"Cabinetmaking is the craft or trade of building cabinets and fine wooden furniture; “cabinetmakings” is a rare plural usually referring to cabinet pieces or works.","zh":"cabinetmaking 指橱柜制作（也泛指精细木作家具的制作工艺/行业）；cabinetmakings 为少见的复数，多指橱柜作品/成品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the craft or trade of making cabinets and other fine wooden furniture (often involving careful joinery and finishing)","zh":"橱柜制作（也泛指精细木作家具的制作工艺/行业，常包含榫接与表面处理）"},"examples":[{"en":"She studied cabinetmaking to learn how to build durable kitchen cabinets.","zh":"她学习橱柜制作，想掌握如何打造耐用的厨房橱柜。"},{"en":"Cabinetmaking requires patience, accurate measuring, and good tools.","zh":"橱柜制作需要耐心、精确测量和好工具。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) cabinet pieces or cabinets being made; the products of cabinetmaking","zh":"（不常用）正在制作的橱柜作品；橱柜制作的成品/作品"},"examples":[{"en":"The workshop displayed several cabinetmakings from local apprentices.","zh":"这间工坊展示了几件本地学徒制作的橱柜作品。"},{"en":"His early cabinetmakings were simple, but his later work became more detailed.","zh":"他早期的橱柜作品比较朴素，但后期作品更精细。"}]}],"synonyms":["cabinetry","woodworking","joinery","cabinet work"],"phonetic":"/ˈkæbənətˌmeɪkɪŋ/","extraExplanation":["“cabinetmakings”这种复数形式在现代英语里很少见；更常用的是不可数名词“cabinetmaking”来指这门手艺/行业。若要表达“作品/成品”，更自然的说法通常是“cabinet work”“cabinets”“pieces (of furniture)”。"]}
{"word":"cabinetry","summary":{"en":"Cabinets as a whole, or the craft/work of making and installing cabinets.","zh":"橱柜的统称，或橱柜的制作与安装工艺/工程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Cabinets and the work or craft of designing, making, or installing them (especially built-in storage in kitchens, bathrooms, etc.).","zh":"橱柜（统称）以及橱柜的设计、制作或安装工艺（尤指厨房、浴室等的定制收纳）。"},"examples":[{"en":"They chose white cabinetry to make the small kitchen look brighter.","zh":"他们选了白色橱柜，让小厨房看起来更明亮。"},{"en":"Custom cabinetry can be expensive, but it uses space efficiently.","zh":"定制橱柜可能很贵，但能更高效地利用空间。"}]}],"synonyms":["cabinets","casework","millwork (in some contexts)"],"phonetic":"/ˈkæbənətri/","extraExplanation":["“cabinetry”多用于室内设计与装修语境，通常是不可数名词，强调“橱柜整体”或“橱柜工程/工艺”。","常见搭配：kitchen cabinetry（厨房橱柜）、bathroom cabinetry（浴室柜）、custom/built-in cabinetry（定制/嵌入式橱柜）、cabinetry work（橱柜工程）。","与近义词区别：cabinet（单个柜子/内阁）；cupboard（一般指带门的柜子，英式更常用）；furniture（家具统称，范围更大）。"]}
{"word":"cabinets","summary":{"en":"“Cabinets” usually means cupboards for storage (especially in kitchens), and it can also mean the top group of government ministers (plural).","zh":"“cabinets”通常指用于收纳的橱柜（尤指厨房橱柜）；也可指由高级部长组成的内阁（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “cabinet”: a set of cupboards (especially built-in ones) used for storing things, often in a kitchen or bathroom.","zh":"“cabinet”的复数：柜子、橱柜（尤指嵌入式的），用来存放物品，常见于厨房或浴室。"},"examples":[{"en":"We need new kitchen cabinets because the old ones are broken.","zh":"我们需要新的厨房橱柜，因为旧的已经坏了。"},{"en":"She keeps plates and cups in the upper cabinets.","zh":"她把盘子和杯子放在上面的橱柜里。"},{"en":"The bathroom cabinets are too small for all our towels.","zh":"浴室的柜子太小，放不下我们所有的毛巾。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “cabinet”: the group of top government ministers who advise a leader (such as a president or prime minister).","zh":"“cabinet”的复数：内阁；由高级政府部长组成、为国家领导人（如总统或总理）提供建议的团队。"},"examples":[{"en":"Several cabinets have tried to solve the housing problem.","zh":"好几届内阁都尝试解决住房问题。"},{"en":"The president met with his cabinet to discuss the new policy.","zh":"总统与内阁开会讨论新政策。"}]}],"synonyms":["cupboards","storage cabinets","kitchen cabinets","government cabinets","ministries"],"phonetic":"ˈkæbənəts","extraExplanation":["在美式英语里，谈家具时常说“kitchen cabinets（厨房橱柜）”。谈政治时说“the Cabinet（内阁）”，常特指美国总统的主要部长团队。","“cabinet”最初与“小房间/小柜子”相关，后来引申为“在私密房间里商议国事的一群人”，因此有“内阁”的意思。"]}
{"word":"cabinetted","summary":{"en":"“Cabinetted” means fitted with cabinets or stored/enclosed in a cabinet; it can also be the past participle of the rare verb “to cabinet.”","zh":"“cabinetted”意为“装有橱柜的”或“被收纳在柜中的”；也可作较少见动词“to cabinet”的过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) Fitted with one or more cabinets; enclosed or stored inside a cabinet.","zh":"（形容词）装有橱柜/柜子的；被放入柜中、收纳在柜里的。"},"examples":[{"en":"The kitchen was newly cabinetted, with extra storage under the counter.","zh":"这间厨房新装了橱柜，台面下多了很多储物空间。"},{"en":"The artifacts were kept in a cabinetted display to protect them from dust.","zh":"这些文物被放在带柜的展示柜里，以防灰尘。"}]},{"partOfSpeech":"v.","definition":{"en":"(v., past participle) Past form of “cabinet”: to put something into a cabinet, or (less commonly) to furnish a room with cabinets.","zh":"（动词，过去分词）“cabinet”的过去分词：把某物放进柜子里；（较少见）给房间装配橱柜。"},"examples":[{"en":"The documents were cabinetted and labeled for easy access.","zh":"文件被收进柜子并贴上标签，方便取用。"},{"en":"After the renovation, the pantry was cabinetted for better organization.","zh":"翻新后，食品储藏间装了柜子，更好整理。"}]}],"synonyms":["cabineted","fitted with cabinets","enclosed","stored","shelved"],"phonetic":"ˈkæbənɪtɪd","extraExplanation":["“cabinetted”在现代英语里比较少见，更常见的表达是“cabineted”（同义、拼写变体）或直接说“fitted with cabinets / stored in a cabinet”。","在英式与美式写法中都可能见到，但多出现在较正式、描述性（如家装、陈列、博物馆）语境。"]}
{"word":"cabinetwork","summary":{"en":"Cabinetwork means the craft or work of making cabinets and built-in wooden furniture.","zh":"Cabinetwork 指制作橱柜与内置木作的工艺、行业或相关产品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the craft, business, or products of making cabinets and other built-in wooden furniture (cabinetry), often for kitchens, bathrooms, and storage","zh":"细木橱柜制作（行业/工艺）；橱柜及内置木作（统称），常用于厨房、浴室与收纳空间"},"examples":[{"en":"The contractor hired a local shop to do the cabinetwork for the new kitchen.","zh":"承包商请了本地店铺来做新厨房的橱柜木作。"},{"en":"Good cabinetwork can raise the value of a home because it looks clean and lasts longer.","zh":"优质的橱柜木作能提升房屋价值，因为更美观也更耐用。"},{"en":"She studied traditional cabinetwork and learned how to cut joints by hand.","zh":"她学习传统橱柜木作，练习用手工开榫卯/接合结构。"}]}],"synonyms":["cabinetry","woodworking","joinery","custom cabinetmaking"],"phonetic":"/ˈkæbɪnətˌwɝk/","extraExplanation":["“cabinetwork”较偏书面或行业用法，日常更常说“cabinetry”或“custom cabinets”。","在室内装修语境里，它常指“内置柜体/固定木作”的整体工程，不只是单个柜子。","词源上与“cabinet（柜子）+ work（制作）”相关；在工艺语境中也可涵盖抽屉、门板、框架等细木作与接合工艺。"]}
{"word":"cabinetworker","summary":{"en":"A cabinetworker is a craftsperson who makes or repairs cabinets and fine wooden furniture.","zh":"cabinetworker 指制作或修理橱柜及精细木制家具的工匠。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A skilled craftsperson who makes, repairs, or installs cabinets and other fine wooden furniture, often working with precise measurements and detailed joinery.","zh":"橱柜木工；家具木工：制作、修理或安装橱柜及其他精细木制家具的熟练工匠，常需要精确测量与细致的榫接工艺。"},"examples":[{"en":"The cabinetworker built custom kitchen cabinets for the old house.","zh":"这位橱柜木工为那栋老房子定制了厨房橱柜。"},{"en":"She trained as a cabinetworker and now restores antique furniture.","zh":"她接受过橱柜木工训练，如今从事古董家具修复。"}]}],"synonyms":["cabinetmaker","woodworker","joiner","carpenter"],"phonetic":"/ˈkæbənətˌwɝkɚ/","extraExplanation":["“cabinetworker”常写作两词“cabinet worker”，也常见更通用的说法“cabinetmaker（橱柜/家具制作师）”。在北美语境里，做定制橱柜和细木作（如抽屉、门板、饰条）的工种往往会用这些词互换，但“cabinetmaker”更常见。"]}
{"word":"cabinetworking","summary":{"en":"“Cabinet networking” most often refers to organizing network cabling and equipment inside a network cabinet; less commonly, it can mean networking among cabinet-level leaders.","zh":"“Cabinet networking”通常指机柜内网络设备与线缆的规划整理；较少情况下也可指内阁/高层领导圈的人脉经营。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(IT) The design, installation, and organization of network equipment and cables inside a network cabinet (or rack), such as switches, patch panels, and structured cabling.","zh":"（IT）在网络机柜/机架内对网络设备与线缆（如交换机、配线架、结构化布线）进行规划、安装与整理的做法。"},"examples":[{"en":"Good cabinet networking makes it easy to trace cables and troubleshoot problems.","zh":"良好的机柜网络布置能让你更容易追线并排查故障。"},{"en":"They improved cabinet networking by labeling every port and using cable managers.","zh":"他们通过给每个端口贴标签并使用理线器来改进机柜布线。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) Building and maintaining connections within a cabinet-level group, especially in government or an organization’s top leadership.","zh":"（较少见）在“内阁/高层领导班子”内部建立并维持人脉与协作关系，常用于政府或组织高层语境。"},"examples":[{"en":"Cabinet networking helped her gain support for the new policy.","zh":"内阁层面的关系经营帮助她为新政策争取到支持。"}]}],"synonyms":["rack wiring","structured cabling","network cabinet setup","cable management"],"phonetic":"/ˈkæbɪnət ˈnɛtˌwɝkɪŋ/","extraExplanation":["这个词作为一个连写单词（cabinetworking）并不常见，更常见的写法是分开写：cabinet networking，或直接说 network cabinet / rack wiring / structured cabling。若你是在找某个品牌或公司名，也可能是专有名词。"]}
{"word":"cabinetworks","summary":{"en":"“Cabinetworks” can mean cabinet-making work/business, or a company/brand name in the cabinetry industry.","zh":"“Cabinetworks”可指“橱柜制作/橱柜工程（行业/作坊）”，也可能是橱柜行业的公司或品牌名。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Cabinet works; the making, installation, or business of building cabinets (especially kitchen or storage cabinets).","zh":"橱柜制作/橱柜工程；指制作、安装橱柜的工作或行业（常指厨房或收纳橱柜）。"},"examples":[{"en":"My uncle runs a small cabinet works that builds custom kitchen cabinets.","zh":"我叔叔经营一家小型橱柜作坊，专做定制厨房橱柜。"},{"en":"The contractor hired a cabinet works to install the new cabinetry.","zh":"承包商请了一家橱柜工程团队来安装新的橱柜。"}]},{"partOfSpeech":"other","definition":{"en":"A name/brand used by some companies in the cabinetry industry (often written as CabinetWorks or Cabinetworks).","zh":"一些橱柜行业公司使用的名称/品牌（常写作 CabinetWorks 或 Cabinetworks）。"},"examples":[{"en":"She works at Cabinetworks, a company that manufactures kitchen cabinets.","zh":"她在 Cabinetworks 工作，那是一家生产厨房橱柜的公司。"},{"en":"Please check the order number in the CabinetWorks system.","zh":"请在 CabinetWorks 系统里查一下订单号。"}]}],"synonyms":["cabinetry","cabinetmaking","cabinet shop","woodworking (cabinetry)"],"phonetic":"/ˈkæbənət wɝks/","extraExplanation":["“cabinet works”在英语里更像行业/作坊的说法，日常也常用“cabinet shop（橱柜店/橱柜作坊）”“cabinetry（橱柜/橱柜制作行业）”。","如果你看到“Cabinetworks / CabinetWorks”首字母大写，通常是在指公司或品牌名；小写时更可能是在泛指“橱柜制作/橱柜工程”。"]}
{"word":"cabining","summary":{"en":"“Cabining” usually means spending time at a cabin, or (more figuratively) being confined or restricted (“cabined in”).","zh":"“cabining”通常指去小木屋住/度假；也可引申为被限制、被困住（常见于“cabined in”）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"the act of living in, staying in, or moving into a cabin (a small simple house), or spending time at a cabin","zh":"住进/待在小木屋里；去小木屋度过一段时间（小木屋指简朴的小房子）"},"examples":[{"en":"We’re cabining this weekend by the lake.","zh":"我们这个周末要去湖边小木屋度假。"},{"en":"They went cabining in the mountains every summer.","zh":"他们每年夏天都会去山里住小木屋。"}]},{"partOfSpeech":"v.","definition":{"en":"restricting or confining someone’s freedom, choices, or movement (often used in phrases like “cabining in”)","zh":"限制；束缚（常见于短语“cabin in”，表示把……限制在狭小范围内）"},"examples":[{"en":"Too many rules are cabining in people’s creativity.","zh":"太多规则正在束缚人们的创造力。"},{"en":"She felt cabined in by the small apartment.","zh":"她觉得这间小公寓让人很憋屈、受限制。"}]},{"partOfSpeech":"adj.","definition":{"en":"having a cabin; enclosed like a cabin (rare in modern daily use, more literary)","zh":"有小室/舱室的；像小室那样封闭的（较少见，更偏文学用法）"},"examples":[{"en":"a cabining space on the boat","zh":"船上一个像小舱室一样的封闭空间"}]}],"synonyms":["staying at a cabin","renting a cabin","confining","restricting","hemming in"],"phonetic":"/ˈkæbɪnɪŋ/","extraExplanation":["“cabining / cabined in”在文学里常用来表达“被关在狭小空间、感到憋闷”的感觉，和“cabin fever（幽居/困在室内的烦躁感）”的语感相近。","当你想表达“去小木屋度假”，口语里更常说 go to a cabin / stay at a cabin / rent a cabin；“go cabining”也能用，但更偏北美口语、略带休闲度假语气。"]}
{"word":"cabinlike","summary":{"en":"“Cabinlike” means resembling a cabin—small, simple, and cozy, often with a rustic wooden feel.","zh":"“cabinlike”表示“像小木屋的”——小巧、朴素、温馨，常带有木质、乡村的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a cabin: small, simple, cozy, and often made with wood or rustic materials.","zh":"像小木屋的；具有小木屋风格的：通常指空间小、朴素、温馨，常带有木质或乡村质感。"},"examples":[{"en":"The hotel room felt cabinlike, with pine walls and a small fireplace.","zh":"这间酒店房间很有小木屋的感觉：松木墙面，还有一个小壁炉。"},{"en":"She decorated the reading corner in a cabinlike style to make it feel warm and quiet.","zh":"她把阅读角落布置成小木屋风格，让它更温暖、更安静。"}]}],"synonyms":["rustic","cozy","woodsy","cabin-like","log-cabin-like"],"phonetic":"/ˈkæbɪnˌlaɪk/","extraExplanation":["“cabinlike”更常见的写法是“cabin-like”（带连字符），尤其在正式写作中更常见；不带连字符的写法也能见到，但相对少一些。","这个词通常用来形容“氛围/风格”（cozy, rustic, woodsy），不一定真的像“船舱/机舱”（cabin的另一义）。如果想避免歧义，可以用“log-cabin-like”或“rustic”。"]}
{"word":"cabins","summary":{"en":"Cabins are small simple houses (often wooden) or private rooms/spaces on ships and airplanes; “cabins” is the plural of “cabin.”","zh":"cabins 是 cabin 的复数，指小木屋/简易小屋，也可指船舱房或飞机客舱等封闭空间。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, simple house, usually made of wood, often found in the countryside, mountains, or near a lake","zh":"小木屋；简易小屋（多在乡村、山里或湖边，常为木制）"},"examples":[{"en":"They rented a cabin by the lake for the weekend.","zh":"他们周末在湖边租了一间小木屋。"},{"en":"My grandparents have a small cabin in the mountains.","zh":"我祖父母在山里有一间小木屋。"}]},{"partOfSpeech":"n.","definition":{"en":"a private room or enclosed space on a ship, or the passenger area on an airplane","zh":"（船上的）舱房；（飞机的）客舱"},"examples":[{"en":"Our cabin on the cruise ship was small but comfortable.","zh":"我们邮轮上的舱房不大，但很舒适。"},{"en":"Please keep your seat belt fastened while in the cabin.","zh":"在客舱内请系好安全带。"}]},{"partOfSpeech":"v.","definition":{"en":"to stay in a cabin or to confine someone in a small space (less common)","zh":"住在小屋里；把（人）限制在狭小空间里（较少用）"},"examples":[{"en":"We cabined in the woods during the storm.","zh":"暴风雨时我们待在林中的小屋里。"},{"en":"He felt cabined by the tiny apartment.","zh":"他觉得那间小公寓让人很憋闷、受束缚。"}]}],"synonyms":["hut","cottage","lodge","room","compartment"],"phonetic":"/ˈkæbɪn/","extraExplanation":["“cabins”是“cabin”的复数形式：one cabin / two cabins。","常见相关表达：\n- log cabin（原木小屋，北美文化里很常见）\n- cabin fever（长时间待在室内引起的烦躁、憋闷感）\n- cabin crew（空乘人员）"]}
{"word":"cabio","summary":{"en":"“Cabio” is not a common English word; it’s likely a name or a misspelling.","zh":"“Cabio”不是常见英语词，更可能是名字或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a proper name (e.g., a username/brand/surname) or a misspelling of a similar word.","zh":"不是标准英语单词。更可能是专有名词（如用户名/品牌/姓氏），或是与某个相近单词拼写错误。"},"examples":[{"en":"“Cabio” isn’t in most English dictionaries; it may be a brand name.","zh":"“Cabio”在多数英语词典里找不到；它可能是一个品牌名。"},{"en":"I saw Cabio on the label, so I think it’s the company name.","zh":"我在标签上看到了Cabio，所以我认为它是公司名称。"}]}],"synonyms":["(no standard synonyms; likely a proper name)"],"phonetic":"/ˈkæbioʊ/","extraExplanation":["“cabio”在英语里不常见，也没有稳定的固定含义。你可能想写的是：\n1) cab（出租车）\n2) cable（电缆；连接线）\n3) combo（组合；套餐）\n4) 或者是西班牙语 cambio（改变/找零）之类的拼写。\n如果你告诉我它出现的句子/场景（聊天、游戏ID、产品名等），我可以更准确判断。"]}
{"word":"Cabirean","summary":{"en":"Cabirean means “connected with the ancient Greek Cabiri and their mystery rites.”","zh":"Cabirean 指“与古希腊卡比里神及其密仪崇拜相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Cabiri (also spelled Cabeiri), a group of mysterious ancient Greek deities worshiped especially in the northern Aegean (for example, Samothrace and Lemnos), often connected with secret religious rites (mystery cults).","zh":"（形容词）与卡比里神（Cabiri/Cabeiri，古希腊一组带神秘色彩的神祇）有关的；尤指与萨莫色雷斯、利姆诺斯等地的秘密宗教仪式（密仪）相关的。"},"examples":[{"en":"Some scholars discuss Cabirean rites as part of the wider tradition of Greek mystery religions.","zh":"一些学者把卡比里密仪作为希腊密教传统的一部分来讨论。"},{"en":"The inscription is sometimes interpreted as evidence of Cabirean worship on the island.","zh":"这段铭文有时被解读为该岛存在卡比里崇拜的证据。"}]},{"partOfSpeech":"n.","definition":{"en":"A person connected with the cult or worship of the Cabiri (rare).","zh":"（名词）与卡比里崇拜/密仪有关的人（较少见）。"},"examples":[{"en":"In older writings, initiates are occasionally described as Cabireans.","zh":"在较早的著作里，入会者偶尔被称为“卡比里信众/卡比里教徒”。"}]}],"synonyms":["Cabirian","Cabiric"],"phonetic":"/kəˈbɪriən/","extraExplanation":["“Cabirean”来自 Cabiri/Cabeiri（卡比里神），是古希腊宗教中的一组神秘神祇名称。相关文献常出现在考古、古典学与宗教学语境中，日常英语里很少用。","拼写上也可能见到 “Cabirian”。在学术写作里，有时会用 “Cabiric” 表示“与卡比里有关的”。"]}
{"word":"cabirean","summary":{"en":"Cabirean: connected with the ancient Greek Cabiri and their secret mystery rites (rare; often spelled Cabirian).","zh":"Cabirean：与古希腊“卡比里神”及其秘仪相关的（较罕见；常拼作 Cabirian）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Cabiri (also spelled Cabiri/Cabeiri), a group of mysterious deities worshiped in parts of the ancient Greek world, especially in Samothrace; often connected with secret religious rites (“mysteries”).","zh":"（古希腊）与“卡比里神”（Cabiri/Cabeiri，一组神秘的神祇）有关的；常与秘密宗教仪式（“秘仪”）相关，尤指萨摩色雷斯岛（Samothrace）的崇拜。"},"examples":[{"en":"Some ancient writers mention Cabirean rites held on Samothrace.","zh":"一些古代作者提到在萨摩色雷斯岛举行的卡比里秘仪。"},{"en":"Archaeologists study Cabirean cult sites to understand mystery religions in the Aegean world.","zh":"考古学家研究卡比里神崇拜遗址，以了解爱琴海世界的秘仪宗教。"}]},{"partOfSpeech":"n.","definition":{"en":"a person associated with the worship of the Cabiri; a participant in Cabirean mysteries (rare).","zh":"（罕见）卡比里神的崇拜者；参加卡比里秘仪的人。"},"examples":[{"en":"In the novel, a Cabirean is portrayed as someone initiated into secret ceremonies.","zh":"在小说中，一位“Cabirean”被描写为接受过秘密仪式入会的人。"}]}],"synonyms":["Cabirian","Samothracian (in some contexts)"],"phonetic":"/kəˈbɪriən/","extraExplanation":["“Cabirean”更常见的拼写是“Cabirian”。它源自古希腊对“Cabiri/Cabeiri”的称呼。这些神祇的具体身份在古代就很模糊，常与“秘仪宗教（mystery cults）”联系在一起：强调入会、誓言保密、象征性仪式与个人保护/救赎。","在英语里，这类词多出现在古典学、考古学、宗教学或文学中；日常英语里几乎不会用到。"]}
{"word":"Cabiri","summary":{"en":"Cabiri: mysterious deities (often plural) in Greek mystery religions, especially tied to Samothrace/Lemnos.","zh":"Cabiri：古希腊密仪信仰中的一组神秘神祇（常作复数），尤与萨莫色雷斯岛／利姆诺斯岛相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) A group of mysterious chthonic (underworld-related) deities worshiped in ancient Greek mystery religions, especially on the islands of Samothrace and Lemnos. The word is often used as a plural name for the group.","zh":"（希腊神话）“Cabiri”（常作复数）指一组神秘的冥界／地下相关神祇，属于古希腊的密仪信仰体系，尤与萨莫色雷斯岛和利姆诺斯岛的崇拜有关。该词常用作这一群神的统称。"},"examples":[{"en":"In some accounts, the Cabiri were honored through secret initiation rites on Samothrace.","zh":"在一些说法中，Cabiri 在萨莫色雷斯岛通过秘密的入会仪式受到崇敬。"},{"en":"The museum label mentions the Cabiri as part of a local mystery cult.","zh":"博物馆的说明牌提到 Cabiri，作为当地密仪崇拜的一部分。"}]},{"partOfSpeech":"n.","definition":{"en":"A related mystery cult (religious group) or its rites connected with the Cabiri.","zh":"与 Cabiri 相关的密仪崇拜（宗教团体）或其仪式（有时也可用该词指代）。"},"examples":[{"en":"Ancient writers linked the Cabiri cult with protection for sailors.","zh":"古代作者把 Cabiri 的崇拜与对航海者的守护联系起来。"}]}],"synonyms":["Cabeiri","Kabeiroi","Great Gods (Samothrace, related term)"],"phonetic":"/kəˈbaɪraɪ/","extraExplanation":["“Cabiri”在英文资料中常见的拼写还有“Cabeiri”，源自希腊语“Κάβειροι”（Kabeiroi）。不同文献对其身份与数量说法不一，因此常被称为“神秘的神祇群”。","它们常与火神赫淮斯托斯（Hephaestus）、锻造与地下力量联系在一起；萨莫色雷斯的密仪在古代被认为能带来庇护，尤其与航海安全有关。","这是偏学术与神话研究语境的词，日常英语中很少使用；写作时可在首次出现处用括号补充“Greek mystery gods”来帮助读者理解。"]}
{"word":"cabiri","summary":{"en":"Cabiri: mysterious Greek deities worshiped in ancient secret rites, especially linked to Samothrace.","zh":"Cabiri：希腊古代密仪中崇拜的一组神秘神祇，尤与萨莫色雷斯岛相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology and ancient religion, the Cabiri (also spelled Cabeiri) were a group of mysterious gods worshiped in secret religious rites (mystery cults), especially on the island of Samothrace.","zh":"在希腊神话与古代宗教中，Cabiri（亦作 Cabeiri）指一组神秘的神祇，常在秘密宗教仪式（密仪宗教）中被崇拜，尤其与萨莫色雷斯岛（Samothrace）的密仪相关。"},"examples":[{"en":"The ancient Greeks believed the Cabiri could offer protection to sailors.","zh":"古希腊人相信 Cabiri 能为水手提供庇护。"},{"en":"The mysteries of the Cabiri were performed on Samothrace.","zh":"Cabiri 的密仪在萨莫色雷斯岛上举行。"}]}],"synonyms":["Cabeiri"],"phonetic":"/kəˈbɪraɪ/","extraExplanation":["Cabiri 是比较少见的拼写形式，更常见的拼写是 Cabeiri。它通常用作专有名词（多为复数），指一群“身份与职能不完全明确”的神祇，与古代“密仪”（mystery rites）传统有关。","在英语阅读中，这个词多出现于古典学、神话学、宗教史语境；日常英语里几乎不用。"]}
{"word":"Cabiria","summary":{"en":"Cabiria is mainly used as a female name and as the title/name associated with notable Italian films (1914; and Fellini’s 1957 Nights of Cabiria).","zh":"Cabiria 主要作为女性名字使用，也常指与意大利重要电影相关的片名/人物名（1914 年《Cabiria》；以及费里尼 1957 年《卡比莉亚之夜》）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (used especially in Italian contexts), best known from classic Italian cinema.","zh":"女性名字（多见于意大利语境），因意大利经典电影而较为人熟知。"},"examples":[{"en":"Cabiria is the name of the heroine in an early Italian film.","zh":"Cabiria 是一部早期意大利电影中女主角的名字。"},{"en":"They named their daughter Cabiria after a favorite movie character.","zh":"他们以喜爱的电影角色为灵感，把女儿取名为 Cabiria。"}]},{"partOfSpeech":"n.","definition":{"en":"the title of a landmark Italian silent epic film (1914), directed by Giovanni Pastrone, featuring a character named Cabiria.","zh":"《卡比莉亚》（Cabiria），1914 年意大利里程碑式的史诗默片，由乔瓦尼·帕斯特罗内（Giovanni Pastrone）执导，片中主角名为 Cabiria。"},"examples":[{"en":"Cabiria (1914) is often discussed in film history classes.","zh":"《Cabiria》（1914）常在电影史课堂中被讨论。"},{"en":"The film Cabiria influenced later epic filmmaking.","zh":"电影《Cabiria》影响了后来的史诗电影创作。"}]},{"partOfSpeech":"n.","definition":{"en":"a reference point for Federico Fellini’s film Nights of Cabiria (1957), whose main character is named Cabiria.","zh":"也常指费德里科·费里尼（Federico Fellini）的电影《卡比莉亚之夜》（Nights of Cabiria，1957）的关联名称；该片女主角也叫 Cabiria。"},"examples":[{"en":"Nights of Cabiria shows Cabiria’s hopes and disappointments in Rome.","zh":"《卡比莉亚之夜》呈现了 Cabiria 在罗马的希望与失落。"}]}],"synonyms":["Nights of Cabiria","Cabiria (1914)"],"phonetic":"/kəˈbɪriə/","extraExplanation":["“Cabiria”更像是文化专名而不是普通词汇：在英语语境里，它最常作为电影片名或人物名出现。读到它时，可以先判断是在谈 1914 年的史诗默片，还是 1957 年费里尼的《卡比莉亚之夜》。","发音提示：英语里通常按四个音节读作 “kuh-BEER-ee-uh”（重音在第二音节）。"]}
{"word":"cabiria","summary":{"en":"Cabiria is mainly used as a proper name in film contexts: a character/name in Italian cinema and the title of notable Italian films.","zh":"Cabiria 主要作为电影语境中的专有名词使用：既可指意大利电影中的人物/名字，也可指几部知名意大利电影的片名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Cabiria: a female given name best known as the title/heroine name in Italian cinema (especially the film *Nights of Cabiria*).","zh":"Cabiria：女性名字；在意大利电影中最为人熟知，常指影片（尤其是《卡比莉亚之夜》）的标题/女主角名字。"},"examples":[{"en":"*Nights of Cabiria* is one of Federico Fellini’s most famous films.","zh":"《卡比莉亚之夜》是费德里科·费里尼最著名的电影之一。"},{"en":"In the movie, Cabiria keeps hoping for a better life despite setbacks.","zh":"在电影里，Cabiria 尽管屡遭挫折，仍然期待更好的生活。"}]},{"partOfSpeech":"n.","definition":{"en":"Cabiria: the title of a classic Italian silent epic film (*Cabiria*, 1914).","zh":"Cabiria：意大利经典默片史诗电影《卡比莉亚》（1914）的片名。"},"examples":[{"en":"The 1914 film *Cabiria* is often discussed in the history of early cinema.","zh":"1914年的《卡比莉亚》常在早期电影史研究中被讨论。"}]}],"synonyms":["(no direct synonyms; proper name)"],"phonetic":"/kəˈbɪriə/","extraExplanation":["“Cabiria”不是常见英语词汇，更多以专有名词出现：要么指电影片名，要么指影片中的人物名。","《卡比莉亚之夜》（*Nights of Cabiria*, 1957）由意大利导演费里尼执导，女主角由朱丽叶塔·马西娜（Giulietta Masina）饰演，影片以温柔又现实的方式描写社会边缘人的希望与尊严。","更早的《卡比莉亚》（*Cabiria*, 1914）是意大利无声电影的重要作品之一，常被拿来说明早期史诗电影的叙事与场面调度。"]}
{"word":"Cabirian","summary":{"en":"Cabirian means “connected with the ancient mystery cult of the Cabiri.”","zh":"Cabirian 指“与古代卡比里神及其神秘宗教仪式有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Cabiri (also spelled Kabiri), a group of mysterious deities worshiped in ancient Greek and related Mediterranean mystery religions.","zh":"与“卡比里神”（亦作 Kabiri）有关的；指古希腊及地中海地区神秘宗教中崇拜的一组神祇或其仪式的。"},"examples":[{"en":"Archaeologists found objects that may have been used in Cabirian rites on the island of Samothrace.","zh":"考古学家在萨莫色雷斯岛发现了一些物品，可能用于卡比里神的神秘仪式。"},{"en":"The temple’s inscriptions suggest a Cabirian connection rather than a public civic cult.","zh":"神庙铭文显示它与卡比里神信仰有关，而非公开的城邦祭祀。"}]}],"synonyms":["Kabirian","Cabiric","Samothracian (in some contexts)"],"phonetic":"/kəˈbɪriən/","extraExplanation":["“Cabirian”源自“Cabiri/Kabiri”（卡比里神）。他们常与“秘仪（mysteries）”相关，崇拜活动通常只对入会者开放，强调象征性仪式与个人宗教体验。萨莫色雷斯岛（Samothrace）的“大神秘仪”常被学者提到，与卡比里神或相近神祇体系有关。","在英语里，这个词多出现在古典学、考古学、宗教学研究语境中；日常英语很少使用。拼写上也可能见到“Cabiric/Cabirian”等变体，用法大致相同。"]}
{"word":"cabirian","summary":{"en":"Cabirian means “connected with the ancient Greek Cabiri mystery gods,” and rarely can mean a follower of their cult.","zh":"Cabirian 指“与古希腊卡比里神（秘仪神祇）相关的”，也可罕见地指其崇拜的参与者。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Cabiri (also spelled Cabiri/Cabeiri), a group of mysterious ancient gods worshiped in parts of the Greek world (especially Samothrace).","zh":"与卡比里神（Cabiri/Cabeiri）有关的；指古希腊世界（尤其萨摩色雷斯岛）崇拜的一组神秘神祇。"},"examples":[{"en":"Some scholars discuss Cabirian rites as part of the wider Greek mystery religions.","zh":"一些学者把卡比里神相关的仪式作为更广泛的希腊秘仪宗教的一部分来讨论。"},{"en":"Archaeologists found objects that may have been used in Cabirian ceremonies.","zh":"考古学家发现了一些物件，可能用于卡比里神的祭仪。"}]},{"partOfSpeech":"n.","definition":{"en":"A person associated with the cult or worship of the Cabiri; a follower or participant in Cabiri worship (rare).","zh":"与卡比里神崇拜相关的人；卡比里神崇拜的参与者或信徒（较少见）。"},"examples":[{"en":"In the inscription, the Cabirian is described as taking part in initiation rituals.","zh":"在那段铭文中，这位卡比里神崇拜者被描述为参加了入会仪式。"}]}],"synonyms":["Cabiric","Cabeirian"],"phonetic":"/kəˈbɪriən/","extraExplanation":["“Cabirian”在现代英语里非常少见，多出现在古典学、考古学或宗教学的学术写作中。更常见的相关形容词拼写是“Cabiric”。","Cabiri（卡比里神）的身份在古代就带有神秘色彩，不同地区与文献对他们的起源与职能描述不一；因此你在阅读时会看到学者用较谨慎的措辞（如“may have been”）来说明证据。"]}
{"word":"Cabiric","summary":{"en":"Cabiric means “connected with the Cabiri,” ancient Greek mystery deities and their secret rites.","zh":"Cabiric 指“与卡比里神及其神秘（秘密）宗教仪式有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Cabiri (also spelled Cabeiri), mysterious ancient Greek deities worshiped in secret rites, especially on islands like Samothrace.","zh":"与“卡比里神”（亦拼作 Cabeiri）有关的；指古希腊一组带有神秘色彩的神祇及其秘密宗教仪式（尤与萨莫色雷斯岛等地相关）。"},"examples":[{"en":"The museum label mentioned a Cabiric rite practiced on Samothrace.","zh":"博物馆的说明牌提到在萨莫色雷斯岛举行的卡比里神秘仪式。"},{"en":"The novel uses Cabiric imagery to suggest secrecy and initiation.","zh":"小说用卡比里相关的意象来暗示秘密与入会（启蒙）。"}]}],"synonyms":["Cabeiric","Samothracian (context-dependent)"],"phonetic":"/kəˈbɪrɪk/","extraExplanation":["“Cabiric”主要出现在古典学、考古、宗教史或文学批评里，日常英语中非常少见。它通常用来营造“神秘仪式、秘密结社、入会启蒙”的氛围。","Cabiri（卡比里）在古希腊宗教中带有强烈的神秘传统色彩，常与“萨莫色雷斯秘仪”（Samothracian Mysteries）等相关。不同文献对他们的身份与职能描述不一，因此带有“难以说清的神祇/仪式”的含义。"]}
{"word":"cabiric","summary":{"en":"Cabiric means “connected with the ancient Greek Cabiri (mystery deities) and their rites.”","zh":"Cabiric 指“与古希腊卡比里神及其神秘仪式相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Cabiri (also spelled Kabiri), mysterious deities worshiped in parts of the ancient Greek world, especially in secret religious rites.","zh":"与卡比里神（Cabiri/Kabiri）有关的；指古希腊某些地区崇拜、常与秘密宗教仪式相关的神祇。"},"examples":[{"en":"The museum label mentioned a Cabiric cult centered on initiation rituals.","zh":"博物馆的说明牌提到一个以入会仪式为中心的卡比里（Cabiric）崇拜。"},{"en":"Scholars debate the meaning of Cabiric symbols found on ancient pottery.","zh":"学者们争论古陶器上发现的卡比里（Cabiric）符号的含义。"}]}],"synonyms":["Cabirian","Kabeiric","of the Cabiri"],"phonetic":"/kəˈbɪrɪk/","extraExplanation":["“Cabiric”在现代英语中非常少见，多出现在古典学、神话学或考古学写作里。更常见的形式是“Cabirian /kəˈbɪriən/”（但你要求只给一个音标，这里不再单列）。","Cabiri（卡比里）常被描述为与丰饶、保护（尤其与航海者/铁匠等）或神秘仪式有关的神祇群体；不同地区与文献对其身份说法不一。","如果你是在阅读材料里见到“cabiric”，它很可能是专有名词派生形容词；若在日常语境看到，可能是拼写错误或罕见用法。你也可以告诉我原句，我可以帮你判断。"]}
{"word":"Cabiritic","summary":{"en":"“Cabiritic” means “related to the Cabiri,” ancient Greek mystery gods and their secret rites.","zh":"“Cabiritic”意为“与卡比里神及其神秘仪式有关的”，属于较罕见的学术用词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Cabiri (also spelled Cabeiri), ancient Greek mystery gods worshiped in secret religious rites, especially on islands like Samothrace.","zh":"与“卡比里神”（Cabiri/Cabeiri，古希腊的神秘神祇）有关的；尤指与其秘密宗教仪式（如萨莫色雷斯岛的密仪）有关的。"},"examples":[{"en":"Some scholars discuss Cabiritic rites alongside the better-known Eleusinian Mysteries.","zh":"一些学者会把卡比里密仪与更知名的厄琉西斯密仪并论。"},{"en":"The inscription is sometimes interpreted as evidence of Cabiritic worship in the region.","zh":"这段铭文有时被解读为该地区存在卡比里崇拜的证据。"}]}],"synonyms":["Cabirian","of the Cabiri","related to the Cabirian mysteries"],"phonetic":"/ˌkæbɪˈrɪtɪk/","extraExplanation":["“Cabiritic”是很少见的学术用词，主要出现在古典学、宗教学或考古学写作中，来源于 Cabiri/Cabeiri（卡比里神）。在一般英语里更常见的是直接用 “Cabiri” 或说 “the Cabirian mysteries/rites”（卡比里密仪/仪式）。","卡比里密仪常与萨莫色雷斯岛（Samothrace）的神秘宗教传统联系在一起，带有“入会、护佑、航海安全”等文化联想；但不同地区的记载并不完全一致。","如果你是在某本书或文章里看到这个词，也可能是拼写差异或误写。常被混淆的近形词包括：cabalistic/kabbalistic（与卡巴拉神秘主义相关），但两者指向的传统不同。"]}
{"word":"cabiritic","summary":{"en":"“cabiritic” does not appear to be a standard English word; it’s probably a misspelling.","zh":"“cabiritic”不像是标准英语单词，更可能是拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a very rare proper name/technical term.","zh":"不是标准英语单词，更可能是拼写错误，或非常罕见的专有名词/技术词。"},"examples":[{"en":"I couldn’t find “cabiritic” in a standard dictionary—could you share the sentence you saw it in?","zh":"我在常见词典里查不到“cabiritic”，你能把它出现的句子发我吗？"},{"en":"If you meant “cabalistic,” the spelling is different.","zh":"如果你想写的是“cabalistic”，拼写是不一样的。"}]}],"phonetic":"/ˌkæbəˈrɪtɪk/","extraExplanation":["“cabiritic”很可能是拼写误差。你可以检查是否想写：\n1) cabalistic /ˌkæbəˈlɪstɪk/（与神秘学、卡巴拉相关的；常见于文学/宗教语境）\n2) cabalistic 也常被误写成 *cabalitic*、*cabbalistic* 等。\n把原句或上下文贴出来，我可以帮你锁定最可能的正确词，并解释用法。"]}
{"word":"Cable","summary":{"en":"Cable most commonly means a thick wire (or bundle of wires) used to carry electricity or signals; it can also mean cable TV, a strong rope/steel wire, or (less commonly) to send a telegram.","zh":"cable 最常指用于传输电力或信号的电缆/线缆；也可指有线电视服务、承重用的粗绳/钢索，或（较少用）指发电报。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a thick wire or a group of wires in a protective covering, used to carry electricity or signals (TV, internet, phone)","zh":"电缆；（有保护层的）粗电线或一束电线，用来传输电力或信号（电视、网络、电话等）"},"examples":[{"en":"The internet cable was damaged, so we lost connection.","zh":"网线/网络电缆坏了，所以我们断网了。"},{"en":"Please don’t bend the charging cable too hard.","zh":"请不要把充电线折得太厉害。"}]},{"partOfSpeech":"n.","definition":{"en":"cable television (TV service delivered through a cable network)","zh":"有线电视（通过有线网络提供的电视服务）"},"examples":[{"en":"We don’t have cable; we just use streaming.","zh":"我们没有装有线电视，只用流媒体。"}]},{"partOfSpeech":"n.","definition":{"en":"a strong, thick rope or metal wire used to support, lift, or pull heavy things","zh":"（承重、牵引用的）粗绳；钢索；缆"},"examples":[{"en":"The bridge is supported by steel cables.","zh":"这座桥由钢缆支撑。"},{"en":"They used a cable to lift the engine.","zh":"他们用钢索把发动机吊起来。"}]},{"partOfSpeech":"vt.","definition":{"en":"to send a message (traditionally by telegram); also used for sending an official message","zh":"发电报；（旧式）电报通知；（正式）电讯告知"},"examples":[{"en":"He cabled the embassy with urgent news.","zh":"他给大使馆发电报，通报紧急消息。"}]}],"synonyms":["wire","cord","lead","line","steel wire","rope"],"phonetic":"/ˈkeɪbəl/","extraExplanation":["“cable”最初与航海有关，指“粗绳、缆绳”，后来引申到“钢缆”“电缆”。因此它既可以是“传输信号的线”，也可以是“承重的钢索”。","在美式英语里，日常说“cable”常指“有线电视服务”（cable TV），而具体那根线更常说“cable/cord/charger cable”（如：USB cable）。"]}
{"word":"cable","summary":{"en":"Cable most commonly means a strong thick rope or a protected wire that carries electricity/signals; it can also mean cable TV or (older) to send a telegram.","zh":"cable 常指粗缆绳或传输电力/信号的电缆（各种线）；也可指有线电视，旧用法还可表示“发电报”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A thick, strong rope made from twisted strands (often used on ships or for heavy lifting).","zh":"（由多股绳索拧成的）粗而结实的缆绳；常用于船只或重物牵引。"},"examples":[{"en":"The sailors pulled the cable to raise the anchor.","zh":"水手们拉动缆绳把锚升起来。"},{"en":"A steel cable held the load securely.","zh":"一根钢缆把货物牢牢固定住。"}]},{"partOfSpeech":"n.","definition":{"en":"A wire or group of wires inside a protective cover, used to carry electricity or signals (such as internet, TV, or phone).","zh":"电缆；（包有护套、传输电力或信号的）一根或多根电线，如网线、电视线或电话线。"},"examples":[{"en":"I replaced the charging cable because it stopped working.","zh":"我换了充电线，因为它坏了。"},{"en":"The technician ran a cable through the wall for the router.","zh":"技术人员把网线穿过墙壁连接路由器。"}]},{"partOfSpeech":"n.","definition":{"en":"Cable television as a service.","zh":"有线电视（服务）。"},"examples":[{"en":"We don’t have cable; we stream everything.","zh":"我们不装有线电视；所有节目都用流媒体看。"},{"en":"This show is on cable, not on public TV.","zh":"这个节目在有线频道播出，不在公共电视台。"}]},{"partOfSpeech":"vt.","definition":{"en":"To send a message by cable (historically, by telegram).","zh":"（旧用法）发电报；用电缆通信发送信息。"},"examples":[{"en":"They cabled the news to their office abroad.","zh":"他们把消息用电报发到海外办事处。"}]}],"synonyms":["wire","cord","lead","rope","line"],"phonetic":"/ˈkeɪbəl/","extraExplanation":["“cable”最早与航海有关，指船上的粗缆绳；后来随着电力与通信技术发展，词义扩展到“电缆/数据线”等“传输电或信号的线”。","在日常英语里，说“a cable”既可以指“网线/充电线/电源线”等各种线；如果要更明确，可说“charging cable（充电线）/power cable（电源线）/Ethernet cable（网线）”。","“cable”作“有线电视”时通常不可数：watch cable / have cable；而“a cable”作“线”或“缆绳”时一般可数。"]}
{"word":"cable car","summary":{"en":"A cable car is a passenger vehicle moved by a cable, either a street car (e.g., San Francisco) or an aerial car in tourist areas.","zh":"cable car 指由钢缆牵引运行的载客车辆，既可指路面缆车（如旧金山），也可指景区的空中缆车。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A passenger vehicle pulled by a continuously moving cable, used for public transport (especially on steep hills).","zh":"缆车；（尤其用于陡坡的）钢缆牵引公共交通车辆。"},"examples":[{"en":"We took the cable car up the hill to see the city view.","zh":"我们坐缆车上山看城市景色。"},{"en":"San Francisco’s cable cars are famous worldwide.","zh":"旧金山的缆车闻名世界。"}]},{"partOfSpeech":"n.","definition":{"en":"A car (small cabin) that moves along a cable, often in the air, used in ski resorts or tourist areas.","zh":"（沿钢索移动的）空中缆车车厢；常见于滑雪场或景区。"},"examples":[{"en":"The cable car crossed the valley in ten minutes.","zh":"空中缆车十分钟就穿过了山谷。"},{"en":"Hold on tight when the cable car starts moving.","zh":"缆车启动时抓稳。"}]}],"synonyms":["gondola","aerial tram","tram (context-dependent)","streetcar (context-dependent)"],"phonetic":"/ˈkeɪbəl kɑr/","extraExplanation":["英语里“cable car”在不同地区含义可能不同：\n- 在美国（尤其旧金山）常指“钢缆牵引、在路面行驶的有轨车辆”（street cable car）。\n- 在很多旅游语境里也常用来指“空中缆车”（aerial tram/gondola）。\n如果你要特别明确“空中缆车”，也可以说“gondola”或“aerial tram”。"]}
{"word":"cable-free","summary":{"en":"Cable-free means wireless—no cables needed.","zh":"cable-free 指“无线的”，不需要线缆。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not needing a cable or wire; working wirelessly.","zh":"不需要电缆或线缆的；无线的。"},"examples":[{"en":"I prefer a cable-free mouse because my desk looks cleaner.","zh":"我更喜欢无线鼠标，因为桌面看起来更整洁。"},{"en":"This cable-free speaker connects to your phone by Bluetooth.","zh":"这款无线音箱通过蓝牙连接你的手机。"}]}],"synonyms":["wireless","cordless"],"phonetic":"/ˈkeɪbəl friː/","extraExplanation":["“cable-free”常见于广告和产品说明，强调“无线/免线”的便利与整洁。日常英语里也常说 wireless（无线的）、cordless（无绳的），其中 wireless 更通用；cordless 常用于耳机、电话、吸尘器等。","写作上它通常作定语（a cable-free setup），有时也可作表语（The setup is cable-free）。也常写作 cable free（不加连字符）或 cableless（较少见）。"]}
{"word":"cablecast","summary":{"en":"Cablecast means to broadcast a program via cable TV, or the program shown on cable TV.","zh":"Cablecast 指通过有线电视播出（节目），也可指有线电视播出的节目本身。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to broadcast (a TV or video program) through a cable television system","zh":"（通过有线电视系统）播出、传送（电视节目或视频）"},"examples":[{"en":"The local news is cablecast every evening at 7 p.m.","zh":"本地新闻每天晚上7点通过有线电视播出。"},{"en":"The city council meeting will be cablecast live on Channel 12.","zh":"市议会会议将通过12频道进行有线电视直播。"}]},{"partOfSpeech":"n.","definition":{"en":"a program that is broadcast through cable television","zh":"有线电视播出的节目"},"examples":[{"en":"That concert cablecast drew a large audience.","zh":"那场音乐会的有线电视转播吸引了很多观众。"}]}],"synonyms":["broadcast on cable","telecast","air (on cable)"],"phonetic":"/ˈkeɪbəlˌkæst/","extraExplanation":["“cablecast”由“cable（有线电视）+ cast（播送）”构成，常见于北美语境。现在也常用更通用的说法如“broadcast on cable”或在网络时代用“stream”来表达线上直播/播放。","与“broadcast”相比，“cablecast”强调传播渠道是“有线电视（cable TV）”，而不是无线电波或更广义的媒体传播。"]}
{"word":"cabled","summary":{"en":"Cabled means either “sent by cable/telegram” (older usage) or “connected by cable” (modern tech usage).","zh":"cabled 可指“用电报/电缆线路发送（较旧用法）”，也可指“用电缆连接的/有线的（现代科技用法）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Past tense/past participle of cable) to send a message by cable (especially an old telegram or an official message sent through a cable network).","zh":"（cable 的过去式/过去分词）用电报/电缆通信线路发送信息（尤指过去的电报或通过电缆网络发送的正式消息）。"},"examples":[{"en":"They cabled the embassy with the latest instructions.","zh":"他们给大使馆拍电报/发电缆电报，传达最新指示。"},{"en":"She cabled her family to say she had arrived safely.","zh":"她给家人发电报，说自己已平安到达。"}]},{"partOfSpeech":"adj.","definition":{"en":"Connected or supplied by cables; using cable for power, data, or television (e.g., cabled internet / a cabled connection).","zh":"用电缆连接的；由电缆供电/传输数据/传输电视信号的（如有线网络/有线连接）。"},"examples":[{"en":"The office has a cabled network for faster, more reliable internet.","zh":"办公室使用有线网络，网速更快也更稳定。"},{"en":"A cabled connection is often more stable than Wi‑Fi.","zh":"有线连接通常比 Wi‑Fi 更稳定。"}]}],"synonyms":["wired","connected","sent by telegram","telegraphed"],"phonetic":"/ˈkeɪbəld/","extraExplanation":["“cable”作“发送电报”这一意思带有年代感：19世纪末到20世纪中期常见，尤其用于政府、外交、新闻等场景。现在更常说“email/text/message”，但在历史材料、新闻报道或文学作品中仍可能看到“cabled”。"]}
{"word":"cablegram","summary":{"en":"A cablegram is an old term for a telegram sent via telegraph cable, especially internationally.","zh":"cablegram 指通过电报电缆（多为国际/海底线路）发送的电报，是偏旧式的说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A telegram sent by an undersea or international telegraph cable (common before email and modern messaging).","zh":"（旧称）海底电缆或国际电报线路发送的电报；海缆电报。"},"examples":[{"en":"The company sent a cablegram to confirm the shipment date.","zh":"公司发了一份海缆电报来确认发货日期。"},{"en":"In the early 1900s, news often traveled by cablegram between continents.","zh":"在20世纪初，大洲之间的新闻常常通过海缆电报传递。"}]}],"synonyms":["telegram","cable (old-fashioned)"],"phonetic":"/ˈkeɪbəlɡræm/","extraExplanation":["“cablegram”是“cable（电报电缆）+ -gram（书写/讯息）”的组合，和“telegram”同一类词。如今多用于历史语境、老式商业信函或文学作品中。","近义表达常见有：telegram（电报，范围更广）、cable（作名词/动词时可指“电报/发电报”，较旧）。在现代英语里通常会说 email / message / text。"]}
{"word":"cablegrams","summary":{"en":"Cablegrams are old-fashioned telegrams sent via long-distance (often undersea) cables.","zh":"Cablegrams 指通过长距离（常为海底）电缆发送的老式电报。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Telegrams (short written messages) sent through long-distance cable networks, especially undersea telegraph cables; an older way to send urgent international messages.","zh":"通过长距离电缆网络（尤其是海底电报电缆）发送的电报；一种较早用于紧急国际通信的方式。"},"examples":[{"en":"The company sent cablegrams to its overseas offices during the crisis.","zh":"在危机期间，公司向海外办事处发送了电报（cablegrams）。"},{"en":"In the early 1900s, cablegrams were the fastest way to communicate across oceans.","zh":"在20世纪初，电报（cablegrams）是跨洋沟通最快的方式。"}]}],"synonyms":["telegrams","cables","wire messages"],"phonetic":"/ˈkeɪbəlˌɡræm/","extraExplanation":["“Cablegram”大多出现在历史语境或老式新闻/文学作品里，相当于“通过海底电缆发送的telegram（电报）”。如今已被email、即时通讯和电话取代。","词形：单数 cablegram，复数 cablegrams。常见搭配：send a cablegram（发电报）、receive a cablegram（收电报）。"]}
{"word":"cablelaid","summary":{"en":"Cable-laid describes a very strong rope made by twisting together several already-twisted strands, often used on ships.","zh":"Cable-laid 指一种非常结实的缆绳式绳索结构：把多股已捻好的绳股再拧合在一起，常用于船舶等场景。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made like a heavy rope by twisting together several already-twisted strands (a very strong rope construction, common in nautical contexts).","zh":"（绳索）“缆绳式”的：把多股已经捻好的绳股再拧合在一起制成的结构（非常结实，常见于航海/船用场景）。"},"examples":[{"en":"The ship used a cable-laid rope for the anchor because it was extremely strong.","zh":"这艘船的锚绳用的是缆绳式结构，因为它非常结实。"},{"en":"Cable-laid lines are heavier and more durable than many ordinary ropes.","zh":"缆绳式绳索通常比许多普通绳更重、更耐用。"}]}],"synonyms":["hawser-laid","strong-rope (informal)","heavy-duty (general)"],"phonetic":"/ˈkeɪbəl leɪd/","extraExplanation":["“Cable-laid”多用于航海/绳索工艺：通常指把三股“laid”（已捻合的绳股）再合成更粗的绳，强调强度与耐磨。它不是“cable”=电缆那种意思，而是“缆绳/粗缆”的结构概念。","写法上常见带连字符：cable-laid；也可能见到不带连字符的变体 cablelaid（较少见，多为技术资料或索引/标注用）。"]}
{"word":"cableless","summary":{"en":"“Cableless” means having no cables/wires; often used like “wireless” or “cordless.”","zh":"“cableless”意为“无缆/无导线”，常与“wireless（无线）”或“cordless（无绳）”意思相近。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without cables; not needing physical wires to connect or operate (often used for devices, accessories, or setups).","zh":"无缆的；不需要用电缆/导线连接或运行的（常用于设备、配件或安装方式）。"},"examples":[{"en":"I’m looking for a cableless headset so my desk stays tidy.","zh":"我在找一款无缆耳机，这样桌面会更整洁。"},{"en":"A cableless setup is safer in places where people might trip.","zh":"在有人可能绊倒的地方，无缆的布置更安全。"},{"en":"This mouse is cableless, so you can move it freely.","zh":"这款鼠标是无缆的，所以你可以自由移动。"}]}],"synonyms":["wireless","cordless","unwired"],"phonetic":"/ˈkeɪb(ə)lləs/","extraExplanation":["“cableless”在日常英语中不算最常见，更常见的说法是“wireless（无线的）”或“cordless（无绳的）”。一般区分是：wireless 强调通过无线信号连接；cordless 强调没有电源线/连接线（但未必有无线网络功能）；cableless 更泛指“没有线缆”，常见于产品宣传或技术描述。"]}
{"word":"cablelike","summary":{"en":"“Cablelike” means cable-shaped—thick, long, and often twisted or rope-like.","zh":"“cablelike”指“像电缆/粗绳一样”的：粗、长，常带扭绞或绳索般质感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a cable in shape or texture; long, thick, and often twisted or rope-like.","zh":"像电缆（或粗绳）一样的；形状或质地细长、较粗，常带有扭绞感。"},"examples":[{"en":"The cablelike vine wrapped around the tree trunk.","zh":"那条像粗绳一样的藤蔓缠绕在树干上。"},{"en":"She noticed cablelike muscles in his forearms from years of climbing.","zh":"她注意到他前臂有像电缆般结实的肌肉，这是多年攀岩练出来的。"},{"en":"A cablelike cord connected the sensor to the control box.","zh":"一根像电缆一样粗实的线连接着传感器和控制盒。"}]}],"synonyms":["rope-like","cordlike","sinewy","wiry"],"phonetic":"/ˈkeɪbəlˌlaɪk/","extraExplanation":["“cablelike”也常写作“cable-like”。用于描述外观或触感，常见搭配有：cablelike muscles（结实如绳索的肌肉）、cablelike vines（粗长藤蔓）、cablelike cords/wires（粗线/电线）。"]}
{"word":"cableman","summary":{"en":"A cableman is someone who installs or fixes cable services like TV and internet; less commonly, a worker in cable-based transport systems.","zh":"cableman 指安装或维修有线电视/网络等服务的人员；较少指缆索运输系统的工作人员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who installs, repairs, or maintains cable systems (such as cable TV, internet, or telephone lines).","zh":"安装、维修或维护有线系统（如有线电视、网络或电话线路）的人；有线技术员。"},"examples":[{"en":"The cableman came to install our internet connection.","zh":"有线技术员来给我们安装网络了。"},{"en":"Call the cableman if the TV signal keeps cutting out.","zh":"如果电视信号老是断，就叫有线维修人员来看看。"}]},{"partOfSpeech":"n.","definition":{"en":"Less commonly, a worker connected with cable operations in transport (for example, working on cable cars or cable railways).","zh":"（较少用）与缆索运输相关的工作人员（例如缆车或索道系统的工作人员）。"},"examples":[{"en":"A cableman checked the grip mechanism before the cable car left the station.","zh":"缆车出站前，一名工作人员检查了夹具装置。"}]}],"synonyms":["cable technician","cable installer","service technician","cable repairman"],"phonetic":"/ˈkeɪbəlmæn/","extraExplanation":["“cableman”在日常英语里比较口语、偏老派；更常见也更中性的说法是“cable technician / cable installer / service technician”。在某些公司或地区也会说“the cable guy”，但“guy”较口语，正式场合建议用“technician”。"]}
{"word":"cablemen","summary":{"en":"“Cablemen” is the plural of “cableman,” usually meaning cable installers/repair workers; in older contexts it can mean telegraph-cable news correspondents.","zh":"“cablemen”是“cableman”的复数，通常指电缆/通信线路安装维修工；在较旧语境中也可指通过电报海缆发回新闻的通讯员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of cableman: a worker who installs, repairs, or maintains cables (especially telephone, internet, or TV cables).","zh":"cableman 的复数：安装、维修或维护电缆/线缆的工人（尤指电话、网络或有线电视线路）。"},"examples":[{"en":"The cablemen arrived in the morning to fix our internet line.","zh":"电缆维修工一早就来修我们的网络线路。"},{"en":"Two cablemen climbed the pole and replaced the damaged cable.","zh":"两名电缆工爬上电线杆，更换了受损的线缆。"}]},{"partOfSpeech":"n.","definition":{"en":"(older use) plural of cableman: a news reporter or correspondent who sent stories by telegraph cable from another country.","zh":"（较旧用法）cableman 的复数：通过海底电报电缆从国外发回新闻的记者/通讯员。"},"examples":[{"en":"In the early 1900s, cablemen sent short reports from Europe to American newspapers.","zh":"在20世纪初，电报通讯员会把来自欧洲的简短报道发回美国报社。"},{"en":"The editor relied on cablemen for fast updates from overseas.","zh":"编辑依靠海外电报通讯员获取快速消息。"}]}],"synonyms":["cable technicians","lineworkers","installers","repair workers","correspondents"],"phonetic":"/ˈkeɪbəlmən/","extraExplanation":["“cableman”这个词在现代更常指有线/通信线路的安装维修人员。较旧的新闻语境里，它指“靠电报海缆发稿的通讯员”，因为当时跨洋信息主要通过海底电缆传输。如今这种职业说法多被“correspondent（通讯员）”“wire-service reporter（通讯社记者）”等替代。"]}
{"word":"cabler","summary":{"en":"A cabler is usually a person/company that installs or connects cables; less commonly, it can mean a cable-laying device.","zh":"cabler通常指安装或连接线缆的人/公司；较少情况下也可指铺缆设备。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or company that installs, lays, or connects cables (for internet, TV, electricity, or telecommunications)","zh":"铺设、安装或连接电缆/网线等的人；电缆安装公司"},"examples":[{"en":"The cabler finished running the fiber-optic line into our apartment.","zh":"电缆安装人员把光纤线路拉进了我们公寓。"},{"en":"We hired a local cabler to tidy up the network cables in the office.","zh":"我们雇了本地的布线人员来整理办公室的网线。"}]},{"partOfSpeech":"n.","definition":{"en":"a machine or device used for laying or handling cable (less common)","zh":"铺设或处理电缆的机器/装置（较少见）"},"examples":[{"en":"On the construction site, a cabler was used to feed cable through the trench.","zh":"在工地上，用一台铺缆设备把电缆送入沟槽中。"}]}],"synonyms":["cable installer","cable technician","cabling contractor","wireman","telecom installer"],"phonetic":"/ˈkeɪb(ə)lər/","extraExplanation":["“cabler”由“cable（电缆/线缆）+ -er（做某事的人/物）”构成，意思直观：做“铺线、布线、接线”的人或设备。","在日常英语中，更常见的说法包括“cable installer / cable technician / network cabling contractor”。“cabler”在某些行业语境或非正式表达里会出现，但并非最常用的标准称呼。"]}
{"word":"cables","summary":{"en":"“Cables” most often means strong wires for power or data; it can also mean thick steel ropes, and (older) the verb “to cable” means to send a telegram.","zh":"“cables”最常指用于电力或数据传输的电缆/连接线；也可指钢索；较旧用法中作动词表示“拍电报”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Thick, strong wires (often metal) used to carry electricity, signals, or data, or to connect devices.","zh":"电缆；（较粗的）电线：通常由金属制成，用来传输电力、信号或数据，或连接设备。"},"examples":[{"en":"The internet is down—please check the cables behind the router.","zh":"网络断了——请检查路由器后面的电缆。"},{"en":"Don’t touch exposed cables; they may be dangerous.","zh":"不要碰裸露的电缆；可能有危险。"},{"en":"I need a USB-C cable to charge my phone.","zh":"我需要一根 USB-C 数据线/充电线给手机充电。"}]},{"partOfSpeech":"n.","definition":{"en":"A thick steel rope used for lifting, pulling, or supporting heavy things (often on cranes, bridges, or elevators).","zh":"（钢）缆；钢索：用于起吊、牵引或支撑重物的粗钢绳（常见于起重机、桥梁或电梯）。"},"examples":[{"en":"Workers replaced the old bridge cables for safety.","zh":"工人为安全起见更换了旧的桥梁钢索。"},{"en":"The crane lifted the load using a heavy cable.","zh":"起重机用粗钢缆吊起了货物。"}]},{"partOfSpeech":"v.","definition":{"en":"To send a message by cable (historically, a telegram).","zh":"（旧用法）拍电报；用电缆发送信息（如电报）。"},"examples":[{"en":"They cabled the news to their office overseas.","zh":"他们把消息用电报发到海外办公室。"}]}],"synonyms":["wires","cords","leads","lines","steel ropes"],"phonetic":"/ˈkeɪbəlz/","extraExplanation":["“cables”通常是名词复数，单数是“cable”。在日常生活中，电子设备连接用的线（如充电线、网线、HDMI线）英语里常说 cable，也常见搭配：power cable（电源线）、Ethernet cable（网线）、charging cable（充电线）。","“cable”也可指钢索（steel cable），在工程/建筑语境很常见；不要和“rope”（普通绳子）混淆。","动词 cable（发电报）属于较旧的用法，现代更常用 email/text/message。"]}
{"word":"cablese","summary":{"en":"“Cablese” is likely a misspelling. The correct word is usually “cable” (a thick wire/cord) or “cables” (plural).","zh":"“cablese” 很可能是拼写错误；通常应为 “cable”（电缆/线缆）或复数 “cables”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“Cablese” is not a standard English word. You may mean “cable” (a thick wire/cord for power or signals) or “cables” (plural).","zh":"“cablese” 不是标准英语单词。你可能想写的是 “cable”（电缆/线缆）或其复数 “cables”。"},"examples":[{"en":"I think you meant “cable”—can you check the spelling?","zh":"我觉得你想写的是 “cable”——你能检查一下拼写吗？"}]},{"partOfSpeech":"n.","definition":{"en":"A thick wire or cord used to carry electricity or signals (like internet/TV).","zh":"电缆；线缆：用于传输电力或信号（如网络/电视）的粗线。"},"examples":[{"en":"This cable connects the monitor to the computer.","zh":"这根线缆把显示器连接到电脑。"},{"en":"Please don’t bend the charging cable too much.","zh":"请不要把充电线弯得太厉害。"}]},{"partOfSpeech":"v.","definition":{"en":"To send a message by cable (especially an official message in the past).","zh":"（旧时）拍电报；用电缆发送信息（多指较正式的信息）。"},"examples":[{"en":"They cabled the news to their office overseas.","zh":"他们把消息用电报发到海外办公室。"}]}],"synonyms":["wire","cord","lead"],"phonetic":"/ˈkeɪbəl/","extraExplanation":["“Cable” 常见于现代生活中的“充电线/数据线/网线（internet cable）/电视线（cable TV）”。当它表示“电报”相关动作（to cable）时，语感更偏历史或正式新闻报道。","如果你本来想表达“线缆的（……）”，英文通常用形容词 cable（如 cable connection 线缆连接），或用具体类型：USB cable、Ethernet cable、power cable。"]}
{"word":"cablet","summary":{"en":"A cablet is a small cable or thin, strong rope, often in nautical or fastening contexts.","zh":"cablet 指“小缆绳/细缆索”，多用于航海或固定捆绑等语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small cable or a thin, strong rope (often used on ships or for fastening)","zh":"小缆绳；细而结实的绳索（常用于船上或固定、捆绑）"},"examples":[{"en":"The crew replaced a worn cablet that secured the lifeboat.","zh":"船员更换了一条用来固定救生艇的旧小缆绳。"},{"en":"Tie the box with a cablet so it won’t slide.","zh":"用一条小缆绳把箱子绑好，这样它就不会滑动。"}]}],"synonyms":["small cable","rope","cord","line"],"phonetic":"/ˈkeɪblət/","extraExplanation":["“cablet”由“cable（缆索）+ -let（表示‘小的’的后缀）”构成，所以字面意思就是“较小的缆索/绳索”。","这个词在现代日常英语中不常见，更多出现在航海、绳缆或较正式/技术性的语境里。日常表达中更常用“rope”“cable”“cord”。"]}
{"word":"cablets","summary":{"en":"Cablets are small cables or short thin lengths of cable/rope used for fastening or reinforcement.","zh":"cablets 指小缆绳或细短的钢索/电缆，常用于固定或加固。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small cable or a short, thin length of cable/rope, often used to tie, fasten, or reinforce something","zh":"小缆绳；细短的钢索/电缆（常用于捆绑、固定或加固）"},"examples":[{"en":"The bridge’s railing is reinforced with steel cablets.","zh":"桥上的栏杆用细钢索加固。"},{"en":"Workers secured the load with several cablets before lifting it.","zh":"工人用几根小钢索固定好货物后才起吊。"}]}],"synonyms":["small cable","wire rope","cord","line"],"phonetic":"/ˈkeɪblət/","extraExplanation":["“cablet”通常是“cable（缆绳/电缆）+ -let（小……）”构成，字面意思就是“较小的缆”。在工程、航运、起重、舞台装置等语境中更常见。","你输入的是复数“cablets”；单数是“cablet”。日常英语里更常用的说法可能是“small cable”“thin cable”或“wire rope”（指钢丝绳）。"]}
{"word":"cableway","summary":{"en":"A cableway is an aerial cable transport system (like a gondola or cable car) used to carry people or goods, often in mountainous areas.","zh":"Cableway 指空中索道运输系统（如吊厢缆车/缆车），常用于山区运送人或货物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a system of cabins (or chairs) hanging from a moving cable, used to carry people or goods up and down mountains or across valleys","zh":"索道；缆车系统（用移动的钢缆悬挂车厢/吊椅，运送人或货物上下山或跨越山谷）"},"examples":[{"en":"We took the cableway to the top of the mountain to see the sunrise.","zh":"我们坐索道上山顶看日出。"},{"en":"The cableway was closed because of strong winds.","zh":"因为大风，索道停运了。"},{"en":"They use a cableway to move supplies to the remote village.","zh":"他们用索道把物资运到偏远的村庄。"}]}],"synonyms":["gondola","cable car","aerial tramway","ropeway"],"phonetic":"/ˈkeɪbəlˌweɪ/","extraExplanation":["“Cableway”常见于英式/欧陆语境（尤其在山区旅游说明里），在美式英语中更常说“cable car”（缆车）或“gondola”（封闭式吊厢缆车），滑雪场也常见“chairlift”（吊椅）。","在不同地区，“cable car”有时也指城市里的有轨缆索车（如旧金山的cable car），语境通常能区分：山里的多是空中索道，城市里的多在地面轨道上行驶。"]}
{"word":"cableways","summary":{"en":"“Cableways” means cable-based transport systems (plural), often used in mountains or ski resorts.","zh":"“Cableways”是“cableway”的复数，指利用钢缆运输的交通系统，常用于山区或滑雪场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a transport system that carries people or goods in cabins or on carriers moved by a cable (often up or across mountains)","zh":"缆车系统；索道（用钢缆牵引吊厢或载具运输人员或货物，常见于山区）"},"examples":[{"en":"Many ski resorts use cableways to take visitors up the mountain.","zh":"许多滑雪场用索道把游客送上山。"},{"en":"The cableway was closed because of strong winds.","zh":"由于强风，索道暂停运营。"},{"en":"They built a cableway to carry supplies across the valley.","zh":"他们修建了一条索道，把物资运过山谷。"}]}],"synonyms":["aerial tramway","ropeway","cable car system","gondola lift"],"phonetic":"/ˈkeɪbəlˌweɪ/","extraExplanation":["“Cableways”是“cableway”的复数形式。常见相关词还有：cable car（缆车/有轨缆索车，语境不同）、gondola（常指封闭式吊厢缆车）、chairlift（开放式吊椅索道）。在旅游或滑雪语境里，cableway通常是更泛的说法。"]}
{"word":"cabling","summary":{"en":"Cabling means a system of cables/wires, or the work of installing them, especially in buildings and networks.","zh":"Cabling 指线缆/电缆系统，或指铺设与安装线缆的工作，常用于建筑与网络布线语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"wires or cables (often in a building, machine, or network) viewed as a system; the installation of these cables","zh":"（建筑、机器或网络中的）电缆/线缆系统；（线缆的）铺设与安装"},"examples":[{"en":"The office needs new cabling for faster internet.","zh":"办公室需要更换新的网络布线来实现更快的网速。"},{"en":"Poor cabling can cause connection problems.","zh":"不良的布线会导致连接问题。"},{"en":"They hid the cabling behind the wall for a cleaner look.","zh":"他们把线缆藏在墙后，让外观看起来更整洁。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of putting in cables or wiring a place or device","zh":"铺设电缆/布线（把线缆装到某处或给设备接线）"},"examples":[{"en":"Cabling was completed before the cameras were installed.","zh":"布线在安装摄像头之前就完成了。"},{"en":"The technician is cabling the server room today.","zh":"技术人员今天在给机房布线。"}]},{"partOfSpeech":"n.","definition":{"en":"the cables used for a particular purpose (such as power, audio, or data)","zh":"用于某种用途的线缆（如电源线、音频线、数据线等）"},"examples":[{"en":"Check the audio cabling if the speakers sound quiet.","zh":"如果音箱声音很小，检查一下音频线缆。"},{"en":"Label the cabling so people don’t unplug the wrong thing.","zh":"给线缆贴标签，避免别人拔错。"}]}],"synonyms":["wiring","cables","wirework","installation (context-dependent)"],"phonetic":"/ˈkeɪblɪŋ/","extraExplanation":["“cabling”常见于IT与工程语境，尤其指“结构化布线”（structured cabling），例如网线（Ethernet）、光纤（fiber optic）等按标准规划、集中管理的布线系统。","在口语里也常直接说“cables/wires”；“cabling”更偏正式或更强调“整套线缆与布置方式”。"]}
{"word":"cablish","summary":{"en":"“Cablish” is not a standard English word; it’s likely a misspelling or a proper name. Provide context to identify the intended word.","zh":"“cablish”不是标准英语词，可能是拼写错误或专有名词；请提供上下文以确认你想表达的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or a name. If you meant a real English word, common possibilities include “cabalish” (rare: related to a cabal) or “cabbage” (the vegetable). Please share the sentence where you saw it so I can identify the intended word.","zh":"不是标准英语单词。很可能是拼写错误或人名/地名等专有名词。如果你想查的是正式英语词，常见可能是“cabalish”（罕见：与密谋小集团有关）或“cabbage”（卷心菜）。请提供它出现的句子，我可以帮你确认你想表达的词。"},"examples":[{"en":"I can’t find “cablish” in a dictionary—could it be a typo for “cabbage”?","zh":"我在词典里找不到“cablish”——会不会是把“cabbage（卷心菜）”拼错了？"},{"en":"Could you show me the sentence with “cablish” so I can tell what word you meant?","zh":"你能把含“cablish”的句子发我吗？这样我就能判断你想写的是什么词。"}]}],"phonetic":"/ˈkæb.lɪʃ/","extraExplanation":["“cablish”在主流英语词典中通常查不到，因此更像是：1）拼写错误；2）专有名词（人名/姓氏/网名/品牌等）；3）非标准拼写或方言写法。你给我上下文（前后各一句）或来源（书/文章/聊天）会更容易精准判断。","如果你想表达“密谋小集团相关的”，更常见的词是：cabal（n. 密谋集团），cabalistic（adj. 神秘的/卡巴拉的；也可指与密谋有关，较少见）。"]}
{"word":"cabload","summary":{"en":"Cabload means a large quantity, originally what fits in a cab.","zh":"Cabload 指大量，原意是一辆出租车能装下的量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large quantity of something—originally, the amount that fits in a cab (especially a taxi), and later used more generally to mean “a lot.”","zh":"大量（原指一辆车/出租车能装下的数量，后来更泛指“很多”）。"},"examples":[{"en":"We’ve got a cabload of luggage—can you help me carry it upstairs?","zh":"我们有一大堆行李——你能帮我搬上楼吗？"},{"en":"A cabload of reporters showed up outside the courthouse.","zh":"一大群记者出现在法院外面。"}]}],"synonyms":["a lot","a large amount","a large number","carload","truckload","boatload"],"phonetic":"/ˈkæbˌloʊd/","extraExplanation":["“cabload”是由cab（出租车/马车）+ load（装载量）构成的合成词，语气偏口语、略带夸张，强调“多”。在现代英语里也可泛指“一整车的人/东西”。类似表达还有“a truckload of / a carload of / a boatload of”。","它并不是非常正式的用词；写作或正式场合更常用“a large amount/number of …”。"]}
{"word":"cabman","summary":{"en":"A (dated) word for a man who drives a cab, especially a horse-drawn one.","zh":"较旧用法：指驾驶“cab”（尤指出租马车）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a man who drives a cab (especially a horse-drawn cab); an old-fashioned word","zh":"（尤指旧时）驾驶出租马车的人；出租车司机（较旧用法）"},"examples":[{"en":"In Dickens’s London, a cabman might wait outside a theater for customers.","zh":"在狄更斯笔下的伦敦，cabman 可能会在剧院外等客人。"},{"en":"The cabman called out to passengers as the carriage rolled by.","zh":"马车经过时，cabman 向乘客吆喝招揽生意。"}]}],"synonyms":["cab driver","taxi driver","coachman","hackney coachman"],"phonetic":"/ˈkæbmən/","extraExplanation":["“cabman”多见于19世纪到20世纪早期的英国英语，常指驾驶“hackney cab”（出租马车）的人。现代英语更常说“cab driver”或“taxi driver”。在文学作品中（如狄更斯描写的伦敦街景），cabman 常作为城市底层劳动者的典型人物出现。"]}
{"word":"cabmen","summary":{"en":"Cabmen are men who drive cabs, especially old-fashioned horse-drawn cabs; in older writing it can also mean taxi drivers.","zh":"cabmen 指驾驶出租车的人，尤指旧时的马车出租车司机；在较旧的文字里也可指出租车司机。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"men who drive a cab (especially a traditional horse-drawn cab; also used for taxi drivers, especially in older writing)","zh":"（尤指旧时）驾驶马车出租车的人；（较旧用法）出租车司机"},"examples":[{"en":"In the old photographs, cabmen wait outside the station for passengers.","zh":"在老照片里，马车出租车司机在车站外等乘客。"},{"en":"The novelist describes London streets filled with cabmen and street vendors.","zh":"这位小说家描写伦敦街头到处是马车出租车司机和小贩。"}]}],"synonyms":["taxi drivers","cabdrivers","hack drivers"],"phonetic":"/ˈkæbmən/","extraExplanation":["“cabmen”是复数形式，单数是“cabman”。这个词常见于19世纪到20世纪早期的英美文学或历史语境中，当时城市里常见的是马车出租车（horse-drawn cab）。现代英语里更常说“taxi driver”或“cabdriver”。"]}
{"word":"cabob","summary":{"en":"“Cabob” usually means a “kabob/kebab”: skewered and grilled pieces of meat and/or vegetables.","zh":"“cabob”通常指“kabob/kebab（烤肉串）”：把肉和/或蔬菜串起来烧烤的食物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Variant spelling of “kabob/kebab”) pieces of meat, vegetables, or seafood cooked on a skewer or on a grill, often served with bread, rice, or salad.","zh":"（“kabob/kebab”的另一种拼写）把肉、蔬菜或海鲜串在签子上烤（或烧烤）成的食物，常配面包、米饭或沙拉一起吃。"},"examples":[{"en":"We grilled chicken cabobs with peppers and onions.","zh":"我们烤了鸡肉串（cabobs），配甜椒和洋葱。"},{"en":"This restaurant serves lamb cabob with rice and salad.","zh":"这家餐厅的羊肉串（cabob）配米饭和沙拉。"},{"en":"For a quick dinner, I bought ready-made beef cabobs at the store.","zh":"为了快速做晚饭，我在店里买了现成的牛肉串（cabobs）。"}]}],"synonyms":["kabob","kebab","shish kebab"],"phonetic":"/kəˈbɑb/","extraExplanation":["“cabob”在英语里不如“kabob”或“kebab”常见，通常被视为拼写变体。","“kebab”更常见于英式或更国际化的写法；“kabob”在美式菜单或食谱中很常见。","在中东、地中海、南亚等饮食文化中，“kebab/kabob”是很常见的烤肉类统称，不同地区会有不同做法（例如用绞肉、整块肉、不同香料等）。"]}
{"word":"cabobs","summary":{"en":"“Cabobs” is usually a misspelling of “kabobs/kebabs,” meaning skewered grilled meat (often with vegetables).","zh":"“cabobs”通常是“kabobs/kebabs”的误拼，指串在签子上烤的肉（常搭配蔬菜）的食物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Pieces of meat (and often vegetables) cooked on a skewer, usually grilled; also the dish made this way.","zh":"（常指）把肉块（也常有蔬菜）串在签子上烤制的食物；也指这种菜肴。"},"examples":[{"en":"We grilled chicken kabobs with peppers and onions.","zh":"我们烤了鸡肉串，配甜椒和洋葱。"},{"en":"The restaurant sells lamb kabobs and rice.","zh":"那家餐厅卖羊肉串和米饭。"}]}],"synonyms":["kebab","shish kebab","skewer"],"phonetic":"/kəˈbɑb/","extraExplanation":["“cabobs”通常是对“kabobs”的拼写误写；在美式英语里常见拼法是“kabob”，英式英语更常写作“kebab”。","“kebab/kabob”源自中东与土耳其等地区的饮食文化；在英语国家常泛指“串烤肉”，但在不同地区也可能指“旋转烤肉切片夹饼”（如doner kebab）。"]}
{"word":"caboceer","summary":{"en":"Caboceer is a rare historical word for a West African local chief or influential trader/official.","zh":"Caboceer 是较少见的历史词，指西非的地方酋长或有影响力的商人/官员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a local chief or leader (especially in West Africa, historically on the Gold Coast/Ghana); also used for an important trader or official in coastal trading towns","zh":"（尤指西非、历史上加纳黄金海岸一带的）地方酋长、头目；也可指沿海贸易城镇中有势力的商人或官员"},"examples":[{"en":"The caboceer negotiated with the visiting merchants.","zh":"这位酋长与来访的商人进行谈判。"},{"en":"In some historical accounts, a caboceer acted as both leader and trade intermediary.","zh":"在一些历史记载中，caboceer 既是领袖也是贸易中间人。"}]}],"synonyms":["chief","headman","local leader"],"phonetic":"/ˌkæbəˈsɪr/","extraExplanation":["这个词多见于历史/殖民时期的英文文献，属于较少用的旧词或地区性词汇。常用于描述西非沿海贸易体系中的地方权力人物。","词源上一般认为与葡萄牙语有关（常被追溯到类似 cabeceiro “领头的人/首领”的形式），反映了早期欧洲与西非海岸贸易接触的历史背景。","现代英语中更常用的表达可能是 local chief、headman、community leader；在具体历史语境下也可能译作“酋长/部族首领/贸易头目”。"]}
{"word":"caboche","summary":{"en":"Caboche is an informal word (often Canadian/French-influenced) meaning “head,” and sometimes a “stubborn person.”","zh":"caboche 是一个非正式词（常见于加拿大/受法语影响的语境），意思是“头、脑袋”，有时也指“固执的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, chiefly Canadian/French-influenced English) A person’s head; the mind or brain (like “noggin”).","zh":"（非正式，多见于加拿大/受法语影响的英语）人的头；也可指头脑、脑子（类似 noggin）。"},"examples":[{"en":"Put on a helmet to protect your caboche.","zh":"戴上头盔保护你的脑袋。"},{"en":"Use your caboche—think before you speak.","zh":"动动脑子——说话前先想清楚。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, humorous) A stubborn or thick-headed person.","zh":"（非正式，幽默）固执的人；“死脑筋”的人。"},"examples":[{"en":"He’s a bit of a caboche when it comes to changing his habits.","zh":"说到改变习惯，他有点死脑筋。"}]}],"synonyms":["head","noggin","skull","bean","blockhead"],"phonetic":"/kəˈboʊʃ/","extraExplanation":["“caboche”源自法语，在魁北克法语里很常见，意思就是“头、脑袋”。在英语里属于比较少见的借词，通常出现在加拿大或带有法语风味的表达中。","不要和“cabochon”混淆：cabochon 是珠宝用语，指不切面、圆滑拱起的“蛋面”宝石切工。两者词形相近，但英语里更常见的是 cabochon。"]}
{"word":"caboched","summary":{"en":"Caboched is a rare adjective meaning (1) in heraldry, an animal head shown front-facing with no neck; or (2) in jewelry, cut/set as a smooth, domed cabochon.","zh":"Caboched 是较少见的形容词：① 纹章学中指动物头部正面朝向且不画颈部；② 珠宝中指以凸圆素面（cabochon）方式打磨或镶嵌。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Heraldry) Shown as a head facing forward with no neck visible (used especially of a stag, boar, etc.).","zh":"（纹章学）指动物头部正面朝向观者、且不画出颈部的图案（常用于鹿、野猪等）。"},"examples":[{"en":"The shield bears a stag’s head caboched in gold.","zh":"这面盾徽上画着一颗金色的鹿头（正面、无颈）。"},{"en":"In heraldry, a boar’s head caboched looks straight at you.","zh":"在纹章学中，“caboched”的野猪头是正面直视观者的样式。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Jewelry, rare) Cut or set as a cabochon (a smooth, rounded, unfaceted gemstone).","zh":"（珠宝用语，较少见）指宝石以“凸圆形素面”（cabochon）方式打磨或镶嵌。"},"examples":[{"en":"The ring held a caboched moonstone that glowed softly.","zh":"这枚戒指镶着一颗凸圆形打磨的月光石，柔和发亮。"},{"en":"Caboched gems have a smooth dome rather than sharp facets.","zh":"“Caboched”的宝石是光滑的拱面，而不是有棱角的刻面。"}]}],"synonyms":["caboshed","cabochon-cut","cabochon-set"],"phonetic":"/kəˈbɑʃt/","extraExplanation":["“caboched”较罕见，很多资料会把它视为“caboshed”的异拼（纹章学用语）。在日常英语里更常见的是 caboshed（纹章）或 cabochon-cut / cabochon-set（珠宝）。","词源与法语有关：caboche/cabochon 含“头、圆凸”之意，因此在纹章里指“只有头部、正面呈现”，在珠宝里指“圆凸的素面切割”。"]}
{"word":"cabochon","summary":{"en":"A cabochon is a gemstone polished into a smooth, rounded dome instead of being cut with facets.","zh":"cabochon 指把宝石磨成光滑圆拱形（弧面）、而非刻面切割的宝石/切工。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a gemstone that has been cut and polished into a smooth, rounded shape (not faceted), often with a flat bottom","zh":"（宝石的）弧面切割；把宝石打磨成表面圆滑隆起、通常底部平坦、没有刻面的形状"},"examples":[{"en":"The ring features a turquoise cabochon set in silver.","zh":"这枚戒指镶着一颗绿松石弧面宝石，配银托。"},{"en":"Opals are often cut as cabochons to show their color play.","zh":"欧泊常被切磨成弧面，以更好展现变彩效应。"}]}],"synonyms":["cabochon cut","dome-cut stone"],"phonetic":"/ˈkæbəˌʃɑn/","extraExplanation":["cabochon 常用于珠宝语境，强调“圆滑隆起、无刻面”的外观；与 faceted stone（刻面宝石）相对。弧面切割特别适合不透明或半透明、以及需要突出光泽/彩效的宝石（如绿松石、月光石、欧泊）。","词源来自法语 cabochon，和“头/凸起”的意象有关，因此也常让人联想到“圆顶/小凸起”的形状。"]}
{"word":"cabochon-cut","summary":{"en":"Cabochon-cut describes a gemstone shaped into a smooth, rounded dome without facets.","zh":"cabochon-cut 指宝石被磨成光滑圆润的拱顶弧面、没有刻面的切割方式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a gemstone) cut and polished into a smooth, rounded, dome-like shape (often oval), with no facets.","zh":"（指宝石）切磨成光滑圆润的半球形/拱顶形（常为椭圆），表面没有刻面。"},"examples":[{"en":"She wore a ring with a cabochon-cut moonstone that glowed softly.","zh":"她戴着一枚镶有弧面切割月光石的戒指，散发出柔和的光泽。"},{"en":"Opals are often sold cabochon-cut to show their color play.","zh":"欧泊常被做成弧面切割，以更好地呈现变彩效果。"},{"en":"The designer chose cabochon-cut stones for a vintage, understated look.","zh":"设计师选择弧面切割的宝石来营造复古、低调的风格。"}]}],"synonyms":["cabochon","smooth-polished","dome-shaped (when describing the surface)"],"phonetic":"/ˈkæbəˌʃɑn kʌt/","extraExplanation":["“Cabochon”源自法语，和“圆头、凸起”有关；在珠宝行业里常简称为“cabochon（弧面）”。弧面切割通常用于不透明或半透明、内部有特殊光学效果的宝石（如欧泊的变彩、月光石的月光效应、猫眼石的猫眼效应），因为刻面（facets）不一定能更好地展示这些效果。","文学与古典珠宝描述中，常用“a cabochon of …”来写“某种宝石的弧面”，例如“a cabochon of garnet（石榴石弧面）”，带有复古、古董首饰的画面感。"]}
{"word":"cabochon-set","summary":{"en":"Cabochon-set describes jewelry that is set with a smooth, rounded (non-faceted) gemstone.","zh":"cabochon-set 指“镶嵌凸圆形（无刻面、表面圆拱）宝石的”，多用于首饰描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Set with a cabochon (a smooth, rounded gemstone that is polished but not faceted), usually in jewelry.","zh":"（宝石）以凸圆形宝石（cabochon，表面光滑圆拱、无刻面）方式镶嵌的，常用于首饰描述。"},"examples":[{"en":"She wore a cabochon-set ring with a deep blue sapphire.","zh":"她戴着一枚镶着深蓝色蓝宝石凸圆宝石的戒指。"},{"en":"The pendant is cabochon-set to highlight the stone’s glow rather than sparkle.","zh":"这枚吊坠采用凸圆宝石镶嵌，是为了突出宝石的光泽而不是闪耀的刻面火彩。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Describing a mounting/setting style made specifically to hold a cabochon stone.","zh":"（较少见）指一种专门用来固定凸圆宝石的镶座／镶嵌方式。"},"examples":[{"en":"The jeweler recommended a cabochon-set bezel for better protection.","zh":"珠宝匠建议用适合凸圆宝石的包镶来更好地保护宝石。"}]}],"synonyms":["cabochon-mounted","cabochon-set in a bezel (common wording)","cabochon style (informal)"],"phonetic":"/ˈkæbəˌʃɑn sɛt/","extraExplanation":["“Cabochon”常用于形容像月光石、欧泊、绿松石等宝石的打磨方式：表面圆润、背面通常平或略弧，强调“柔和的光晕/猫眼/变彩”等效果，而不是刻面宝石那种强烈闪光。","“Cabochon-set”在首饰描述里多作定语（如 cabochon-set ring/pendant/earrings）。常见搭配还有 bezel-set（包镶）与 prong-set（爪镶）；凸圆宝石为了保护边缘，包镶更常见。"]}
{"word":"cabochons","summary":{"en":"Cabochons are rounded, smoothly polished gemstones (plural of cabochon), not faceted like typical cut diamonds.","zh":"Cabochons 指“凸圆形切磨宝石”（cabochon 的复数），表面圆滑抛光，不像常见刻面宝石那样有棱面。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a gemstone (or other material) that has been cut and polished with a smooth, rounded top and a flat (or slightly domed) bottom, rather than having sharp facets; “cabochons” is the plural form","zh":"（宝石或其他材料的）凸圆形切磨、抛光宝石；顶部圆滑隆起、底部较平（或微拱），不像刻面宝石那样有明显棱面；“cabochons”为复数"},"examples":[{"en":"The necklace is set with turquoise cabochons.","zh":"这条项链镶嵌着绿松石凸圆形宝石。"},{"en":"Opal cabochons often show their colors best in soft, rounded cuts.","zh":"欧泊常用凸圆形切磨更能展现变彩效果。"},{"en":"She bought a ring with a moonstone cabochon.","zh":"她买了一枚镶月光石凸圆形宝石的戒指。"}]}],"synonyms":["rounded gemstone","cabochon cut","cab (informal)"],"phonetic":"/ˈkæbəˌʃɑn/","extraExplanation":["“Cabochon”源自法语，常用于珠宝设计领域。凸圆形切磨特别适合不透明或半透明、需要突出纹理/光学效果的宝石（如绿松石、孔雀石、月光石、欧泊等），因为刻面切割不一定能增强它们的美感。","在日常交流中，cabochon 常被直接简称为 “cab”（尤其在手工首饰、宝石爱好者社区里），例如：a labradorite cab（拉长石凸圆形宝石）。"]}
{"word":"cabocle","summary":{"en":"Caboclo is a Brazilian Portuguese term for a person of mixed Indigenous and European ancestry, and sometimes for rural Amazon people more generally.","zh":"Caboclo 是巴西葡语词，指原住民与欧洲人混血者；有时也泛指亚马孙地区的乡村居民。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Brazil) a person of mixed Indigenous and European ancestry; also, more broadly, a rural person from the Amazon region.","zh":"（巴西）印第安原住民与欧洲人混血的人；也可泛指亚马孙地区的乡村居民。"},"examples":[{"en":"In some parts of Brazil, the word caboclo refers to people with mixed Indigenous and European roots.","zh":"在巴西的一些地区，caboclo 指具有原住民与欧洲混血背景的人。"},{"en":"The story is set in an Amazon village with caboclo families living along the river.","zh":"故事发生在亚马孙的一个村庄，河边住着许多 caboclo 家庭。"}]}],"synonyms":["caboclo","mestiço (Brazilian Portuguese, broader)","mixed-heritage person"],"phonetic":"/ˌkɑːboʊˈkloʊ/","extraExplanation":["“caboclo”（你写的 cabocle 常被认为是拼写变体/误拼）是带有强烈地域与历史背景的词。在巴西不同地区，它既可能是中性身份称呼，也可能因语境而带有社会阶层或刻板印象色彩；在写作或交流中，最好结合当地用法与当事人自我认同来使用。","词源通常与巴西原住民语言（如图皮语族）相关，后来在葡语语境中固定下来；在民俗宗教与文化传统中也会出现（例如某些“Caboclo”作为文化/民俗角色或称谓）。"]}
{"word":"caboclo","summary":{"en":"Caboclo refers to a Brazilian person of mixed Indigenous and European ancestry, especially in the Amazon; it can also mean a rural countryside person, depending on context.","zh":"Caboclo 指巴西（尤指亚马孙地区）印第安原住民与欧洲人混血的人；在某些语境下也可指乡下人/农村居民，语气随语境而变。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person in Brazil, especially in the Amazon, who is of mixed Indigenous and European ancestry (a Portuguese loanword)","zh":"（巴西用语，尤其指亚马孙地区）印第安原住民与欧洲人混血的人；葡萄牙语借词"},"examples":[{"en":"The novel portrays a caboclo family living along the Amazon River.","zh":"这部小说描写了一个生活在亚马孙河沿岸的 caboclo 家庭。"},{"en":"In some regions, caboclo communities maintain a mix of Indigenous and European traditions.","zh":"在一些地区，caboclo 社群保留着原住民与欧洲传统交织的生活方式。"}]},{"partOfSpeech":"n.","definition":{"en":"a rural person in Brazil; sometimes used to mean a backwoods or countryside person (tone can be neutral or, in some contexts, slightly pejorative)","zh":"（巴西用语）乡下人、农村居民；有时指“山里人/乡巴佬”（语气可中性，也可能带轻微贬义，视语境而定）"},"examples":[{"en":"He described himself as a caboclo from the interior, proud of his simple way of life.","zh":"他自称是来自内陆的 caboclo，并以朴素的生活方式为傲。"},{"en":"Be careful with the word caboclo—some people dislike it if it sounds dismissive.","zh":"使用 caboclo 要小心——如果听起来像在轻视，有些人会反感。"}]}],"synonyms":["mixed-ancestry Brazilian","mestizo (approx.)","rural Brazilian (contextual)"],"phonetic":"/kəˈboʊkloʊ/","extraExplanation":["“caboclo”主要是巴西葡萄牙语词，在英语中多出现在人类学、历史、文学或报道亚马孙地区的语境里，通常不翻译而直接使用。","它不是一个精确的“种族”分类，更像一种带地域与社会文化含义的称呼；不同地区、不同说话人用法和情感色彩可能不同。","在巴西历史语境中，它常与殖民时期以来的族群混合、河岸居民（ribeirinhos）与森林生计（渔猎、采集、小农耕作）相关。"]}
{"word":"caboclos","summary":{"en":"Caboclos is the plural of caboclo: (1) people in Brazil traditionally described as mixed Indigenous and European ancestry, and (2) in Umbanda and related religions, spirits linked to Indigenous ancestry and the forest.","zh":"Caboclos 是 caboclo 的复数：① 巴西语境中传统上指原住民与欧洲血统混合的人群；② 在乌班达等宗教中指与原住民祖先与森林相关的一类灵体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of caboclo) In Brazil, people traditionally described as having mixed Indigenous and European ancestry, especially in the Amazon and rural areas.","zh":"（caboclo 的复数）在巴西语境中，传统上指具有印第安原住民与欧洲血统混合的人群，常见于亚马孙地区与乡村社会。"},"examples":[{"en":"The novel describes caboclos living along the Amazon River and making a living from fishing and small farms.","zh":"这部小说描写了生活在亚马孙河沿岸的 caboclos，他们靠捕鱼和小农耕维生。"},{"en":"Some communities identify as caboclos, but many people prefer more specific or self-chosen identity terms today.","zh":"有些社群自称为 caboclos，但如今许多人更倾向使用更具体或由自己选择的身份称谓。"}]},{"partOfSpeech":"n.","definition":{"en":"In some Afro-Brazilian religions (such as Umbanda), spiritual entities/spirits associated with Indigenous ancestors, the forest, healing, and protection.","zh":"在某些非裔巴西宗教（如乌班达 Umbanda）中，指与原住民祖先、森林、疗愈与守护相关的灵体/神灵类别。"},"examples":[{"en":"In Umbanda ceremonies, caboclos are often invoked for guidance and healing.","zh":"在乌班达的仪式中，人们常祈请 caboclos 带来指引与疗愈。"},{"en":"The song mentions caboclos to evoke the power of the forest and ancestral memory.","zh":"这首歌提到 caboclos，用来唤起森林的力量与祖先记忆。"}]}],"synonyms":["caboclo (singular)","mixed Indigenous-European Brazilians","Umbanda spirits (contextual)"],"phonetic":"/kəˈboʊkloʊz/","extraExplanation":["“Caboclos”来自葡萄牙语，单数是“caboclo”。在英文里多作为外来词使用，通常出现在讨论巴西历史、亚马孙地区社会与文化人类学的语境中。","当它用于描述人群身份时，属于带有历史背景的分类词。现代语境中，最好尊重当事人的自我认同与当地更具体的族群/社区称谓。","在宗教语境（如 Umbanda）里，“caboclos”并不是“某个族群的人”，而是指一类灵体形象；常与“pretos-velhos”等其他灵体类别并列出现。"]}
{"word":"Cabomba","summary":{"en":"Cabomba is a freshwater aquatic plant (fanwort), often kept in aquariums.","zh":"Cabomba 指一种淡水水生植物（常称 fanwort/扇叶藻），常用于水族箱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of freshwater aquatic plants with finely divided, fan-shaped leaves, often used in aquariums; commonly called fanwort","zh":"一种淡水水生植物属，叶片细裂呈扇形，常用于水族箱造景；俗称“扇叶藻/扇叶水草（fanwort）”"},"examples":[{"en":"Cabomba is popular in planted aquariums because its leaves look soft and feathery.","zh":"Cabomba 在水草缸里很受欢迎，因为它的叶子看起来柔软、羽毛状。"},{"en":"Some places treat Cabomba as an invasive plant and restrict its sale.","zh":"有些地区把 Cabomba 视为入侵植物，并限制其销售。"}]}],"synonyms":["fanwort"],"phonetic":"/kəˈbɑːmbə/","extraExplanation":["Cabomba 是一个植物“属名”（genus name），在英语里通常首字母大写并用斜体书写（如 *Cabomba*）。常见的俗名是 fanwort（扇叶藻/扇叶水草）。","在园艺与生态语境中，Cabomba 有时会因生长快、易扩散而被归为潜在入侵水草；不同国家和地区的管理规定不一样。"]}
{"word":"cabomba","summary":{"en":"Cabomba: an aquarium aquatic plant with fine, fan-shaped leaves; sometimes invasive in the wild.","zh":"Cabomba（水盾草）：一种叶片细密呈扇形的水族水草；在野外有时会成为入侵物种。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of aquatic plant (genus *Cabomba*), often kept in aquariums; it has fine, fan-shaped underwater leaves.","zh":"一种水生植物（*Cabomba* 眼子菜科的水盾草属植物），常用于水族箱造景；水下叶细密、呈扇形。"},"examples":[{"en":"Cabomba is popular in freshwater aquariums because it looks soft and feathery.","zh":"水盾草在淡水鱼缸里很受欢迎，因为看起来柔软、像羽毛一样。"},{"en":"Some lakes try to control cabomba because it can grow very quickly.","zh":"有些湖泊会控制水盾草，因为它可能生长得非常快。"}]}],"synonyms":["fanwort","Cabomba (genus)"],"phonetic":"/kəˈbɑmbə/","extraExplanation":["“Cabomba”常见俗名是 fanwort（扇叶水草/扇藻），在水族圈也常直接叫“cabomba”。","在部分地区它被视为外来入侵水生植物：生长旺盛时可能影响本地生态与水道通行；购买或野外放生前最好了解当地法规与生态影响。"]}
{"word":"Cabombaceae","summary":{"en":"Cabombaceae is a botanical family of freshwater aquatic plants, including Cabomba.","zh":"Cabombaceae 指淡水水生植物的一个科（莼菜科），包含莼菜属 Cabomba 等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small family of aquatic (water) plants, including the genus Cabomba, often found in freshwater ponds and slow-moving rivers","zh":"莼菜科（Cabombaceae）：一小类水生植物科，包含莼菜属（Cabomba）等，多生长在淡水池塘和水流缓慢的河道中"},"examples":[{"en":"Cabombaceae plants are commonly used in aquariums because of their delicate, feathery leaves.","zh":"莼菜科植物因叶片细密如羽，常被用作水族箱造景植物。"},{"en":"In some wetlands, Cabombaceae can provide shelter for small fish and insects.","zh":"在一些湿地中，莼菜科植物能为小鱼和昆虫提供躲藏的空间。"}]}],"synonyms":["cabomba family"],"phonetic":"/ˌkæbɑmˈbeɪsiːi/","extraExplanation":["“Cabombaceae”是植物分类学中的“科名”，通常用于学术写作或自然科普中；日常英语里更常直接说某个具体植物名（如“cabomba”）。","该科成员多为沉水或浮叶植物，常见特征包括细裂、柔软的叶片，适应淡水环境；在某些地区也可能被视为入侵水生植物，需要管理。","词源上以属名“Cabomba”构成，拉丁化科名常用后缀“-aceae”（表示“……科”）。"]}
{"word":"cabombaceae","summary":{"en":"Cabombaceae is the botanical family of certain freshwater aquatic plants such as cabomba and water-shield.","zh":"Cabombaceae 指某些淡水水生植物（如水盾草、莼菜等）所属的植物科名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of aquatic flowering plants (water lilies’ relatives) that includes cabomba and water-shield; often found in ponds and slow-moving freshwater.","zh":"睡莲目中的一个水生开花植物科（与睡莲类近缘），包括水盾草属（Cabomba）与莼菜属（Brasenia）等，常见于池塘与缓流水域。"},"examples":[{"en":"Cabombaceae plants are popular in aquariums because their soft leaves look decorative.","zh":"睡莲目中的睡莲类近缘植物——Cabombaceae（莼菜科）的一些成员因叶片柔美、观赏性强而常用于水族箱。"},{"en":"Some Cabombaceae species can spread quickly in warm freshwater habitats.","zh":"在温暖的淡水环境中，Cabombaceae（莼菜科）的某些物种可能扩散得很快。"}]}],"synonyms":["water-shield family"],"phonetic":"/ˌkæbəmˈbeɪsiˌi/","extraExplanation":["“Cabombaceae”是植物分类学名称，常见于生物学、生态学和水生植物管理的语境；日常英语里更常用具体属名/俗名，如 cabomba（凤眼莲藻/水盾草类观赏水草）或 water-shield（莼菜）。","该科成员多为沉水或浮叶水生植物，叶片形态常呈细裂或盾形，适应静水或缓流水域；在部分地区也可能被当作入侵水生植物来管理。"]}
{"word":"cabombas","summary":{"en":"Cabombas are freshwater aquarium plants (cabomba/fanwort).","zh":"Cabombas 指淡水水族用的莼菜属水草（cabomba / fanwort）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of freshwater aquatic plant (genus Cabomba) often kept in aquariums; also called fanwort","zh":"一种淡水水生植物（莼菜属 Cabomba），常用于水族箱；也叫“扇叶草/扇藻”（fanwort）"},"examples":[{"en":"The aquarium shop sells cabombas because they grow quickly and look soft and feathery.","zh":"水族店卖 cabombas，因为它们长得快，看起来柔软、羽毛状。"},{"en":"Cabombas need enough light, or the leaves may turn brown.","zh":"Cabombas 需要足够的光照，否则叶子可能会变褐。"}]}],"synonyms":["fanwort","cabomba"],"phonetic":"/kəˈbɑːmbə/","extraExplanation":["“cabombas”通常是复数，单数是“cabomba”。在水族圈里更常见的英文俗名是“fanwort”。","一些地区把 cabomba 作为外来入侵水生植物管理，因为它繁殖快，可能堵塞水道、影响本地生态。"]}
{"word":"caboodle","summary":{"en":"Caboodle means a whole group or collection, especially “everything” (often in “the whole kit and caboodle”).","zh":"Caboodle 指一群／一堆（尤指“全部”），常见于短语“the whole kit and caboodle”（全部的一切）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A group, collection, or bunch of people or things—often meaning “everything” as a whole.","zh":"（非正式）一群／一堆人或物；常用来表示“全部、统统”"},"examples":[{"en":"She packed her books, clothes, and the whole caboodle into two suitcases.","zh":"她把书、衣服等等一整套东西都塞进了两只行李箱。"},{"en":"They brought the kids, the dog, and the entire caboodle to the picnic.","zh":"他们把孩子、狗，还有全部家当都带去野餐了。"}]},{"partOfSpeech":"phrase","definition":{"en":"In the phrase “the whole kit and caboodle”: absolutely everything; the entire set.","zh":"用于短语“the whole kit and caboodle”：全部的一切；整套东西"},"examples":[{"en":"After the move, we had to unpack the whole kit and caboodle.","zh":"搬家后，我们得把所有东西都拆箱整理。"},{"en":"The contract includes the whole kit and caboodle—fees, dates, and responsibilities.","zh":"合同把所有细节都写进去了——费用、日期和责任。"}]}],"synonyms":["the whole lot","everything","the whole bunch","the whole shebang","the whole kit"],"phonetic":"/kəˈbuːdəl/","extraExplanation":["“caboodle”常带幽默、口语色彩，尤其常见于固定说法“the whole kit and caboodle”，强调“一个不落、全部打包”。","词源一般认为与荷兰语/中古低地德语的 *boedel*（财物、家当）有关，后来在美国英语里发展成口语表达；它不是正式写作中的常用词。"]}
{"word":"caboodles","summary":{"en":"Caboodle is an informal word meaning “a whole group/set,” most commonly in the phrase “the whole caboodle” (= everything).","zh":"Caboodle 是口语用词，表示“一整套/全部”，最常见于短语 “the whole caboodle”（= 全部都包括）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Informal) A whole group or set of things; everything included.","zh":"（非正式）一整套；全部；所有东西（常指“全套都在内”）。"},"examples":[{"en":"She packed the whole caboodle into two suitcases.","zh":"她把所有东西一股脑儿塞进了两个行李箱。"},{"en":"We bought the camera, lens, tripod—the whole caboodle.","zh":"我们买了相机、镜头、三脚架——整套都买齐了。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) A group of people (often said in a slightly humorous or dismissive way).","zh":"（非正式）一群人（常带一点幽默或轻微不屑的语气）。"},"examples":[{"en":"The whole caboodle showed up at the party.","zh":"那帮人都来参加派对了。"},{"en":"He arrived with his caboodle of friends.","zh":"他带着一群朋友一起来了。"}]},{"partOfSpeech":"phrase","definition":{"en":"Used in the phrase “the whole caboodle” meaning “everything; the whole lot.”","zh":"用于短语“the whole caboodle”，表示“全部；一整套；全都算上”。"},"examples":[{"en":"They sold the house and the whole caboodle—furniture included.","zh":"他们把房子连同全部家当都卖了——家具也包括在内。"},{"en":"I don’t want part of the plan; I want the whole caboodle.","zh":"我不要只做计划的一部分；我要全套方案。"}]}],"synonyms":["the whole lot","everything","the whole shebang","the whole kit and caboodle","all of it"],"phonetic":"/kəˈbuːdəl/","extraExplanation":["“caboodle”多见于固定搭配“the whole caboodle”，语气口语、随意，常用于强调“全都算上”。","词源并不完全确定；很多词典认为它可能与19世纪美国英语中的“boodle”（一大堆/一群）有关，后来在口语里演变成更顺口的“caboodle”。"]}
{"word":"cabook","summary":{"en":"Cabook is a Sri Lankan English word for laterite soil/stone used in building.","zh":"Cabook是斯里兰卡英语中指用于建筑的红土岩/铁质土（laterite）的词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Sri Lanka) A reddish-brown laterite soil or soft rock used as a building material (often cut into blocks, “cabook bricks”).","zh":"（斯里兰卡用语）一种红褐色的铁铝质风化土/软岩（红土岩、铁质土），常被切成块用作建筑材料（如“cabook砖”）。"},"examples":[{"en":"Many older houses in Sri Lanka were built with cabook blocks.","zh":"斯里兰卡许多较老的房子是用cabook块建成的。"},{"en":"Cabook bricks are common in rural construction because they’re easy to cut.","zh":"在乡村建筑中，cabook砖很常见，因为它容易切割加工。"}]}],"synonyms":["laterite","laterite soil","building stone"],"phonetic":"/kəˈbʊk/","extraExplanation":["“cabook”不是全球通用的日常英语词，更常见于斯里兰卡英语（Sri Lankan English）语境，指当地常见的红土岩/铁质土建材。","如果你本来想查的是别的词：常见的拼写相近词有“casebook（案例汇编）”“cookbook（食谱）”。你可以告诉我你看到它的句子，我可以帮你确认。"]}
{"word":"Cabool","summary":{"en":"Cabool is usually a place name: a city in Missouri, or an older spelling of Kabul (Afghanistan).","zh":"Cabool 通常是地名：可指密苏里州的一座城市，或作为 Kabul（阿富汗喀布尔）的旧式拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a small city in southern Missouri, USA (Texas County).","zh":"美国密苏里州南部（德克萨斯县）的一个小城市。"},"examples":[{"en":"She grew up in Cabool, Missouri, before moving to St. Louis.","zh":"她在密苏里州的卡布尔（Cabool）长大，后来搬到了圣路易斯。"},{"en":"Cabool is a quiet stop along local highways in southern Missouri.","zh":"卡布尔是密苏里州南部公路沿线一个安静的小城。"}]},{"partOfSpeech":"other","definition":{"en":"an older/variant English spelling of “Kabul,” the capital of Afghanistan (seen in some historical texts).","zh":"“Kabul（喀布尔）”的较早/变体英文拼写（可见于一些历史文献中），指阿富汗首都喀布尔。"},"examples":[{"en":"In older books, you may see Kabul written as Cabool.","zh":"在较旧的书里，你可能会看到 Kabul 写成 Cabool。"},{"en":"The travel journal mentioned “Cabool,” referring to today’s Kabul.","zh":"那本旅行日记提到“Cabool”，指的就是今天的喀布尔（Kabul）。"}]}],"synonyms":["Kabul"],"phonetic":"/kəˈbuːl/","extraExplanation":["“Cabool”在现代英语里更多是美国地名（密苏里州）。如果你在历史或文学文本中看到它，也可能是“Kabul（喀布尔）”的旧拼写。判断时可以看上下文：出现阿富汗、波斯、中亚、战争或外交等内容时，通常指喀布尔；出现密苏里州、美国公路、当地社区时，通常指该城市。"]}
{"word":"caboose","summary":{"en":"A caboose is the traditional last car of a freight train; informally, it can also mean the last person or thing in a group.","zh":"caboose 指货运列车末尾的传统守车；口语中也可指队伍/群体中最后的那个人或东西。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A railroad car at the end of a freight train, traditionally used by the crew for work, rest, and watching the train.","zh":"（货运列车末尾的）守车/车尾车；传统上供列车工作人员办公、休息并观察车况。"},"examples":[{"en":"In old movies, the crew climbs into the caboose at the end of the train.","zh":"在老电影里，工作人员会爬进列车末尾的守车。"},{"en":"The railroad museum lets visitors walk through a bright red caboose.","zh":"铁路博物馆让游客进入一节鲜红的守车参观。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) The last person or thing in a line or group; the one at the very back.","zh":"（非正式）队伍或一群人/物中最后的那个；垫底/殿后者。"},"examples":[{"en":"I was the caboose on our hike, walking at the very back.","zh":"徒步时我是“殿后”的人，走在最后面。"},{"en":"After lunch, the sleepy toddler became the caboose of the group.","zh":"午饭后，困倦的幼儿成了队伍里的“最后一个”。"}]}],"synonyms":["(railroad) guard car","(informal) last one","tail end"],"phonetic":"/kəˈbus/","extraExplanation":["“Caboose”来自荷兰语/低地德语的相关词（如kabuis），原意接近“船上的小舱/厨房（cookhouse）”。后来在北美铁路文化中专指货运列车末尾供乘务员使用的车厢。","现代货运列车很多已不再使用传统守车，功能常由电子设备或列车尾端装置（EOT, end-of-train device）取代，但在文学、电影和铁路博物馆里仍很常见。"]}
{"word":"cabooses","summary":{"en":"“Cabooses” is the plural of “caboose,” meaning old-style crew cars at the end of freight trains; informally, it can also mean someone’s buttocks.","zh":"“cabooses”是“caboose”的复数，常指过去挂在货运列车末尾供乘务人员使用的守车；非正式场合也可指臀部/屁股。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of caboose) A railroad car attached at the end of a freight train, traditionally used by the train crew (now mostly historical in the U.S.).","zh":"（caboose 的复数）守车/车尾员车：过去常挂在货运列车最后方、供乘务人员工作和休息的车厢（在美国如今多为历史用法）。"},"examples":[{"en":"In old photos, you can often spot bright red cabooses at the end of freight trains.","zh":"在老照片里，你常能看到货运列车尾部有亮红色的守车。"},{"en":"The railway museum has several restored cabooses you can walk through.","zh":"铁路博物馆里有几节修复好的守车，游客可以进去参观。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, slang) A person’s buttocks; the rear end.","zh":"（非正式俚语）臀部；屁股。"},"examples":[{"en":"He slipped on the ice and landed on his caboose.","zh":"他在冰上打滑，一屁股坐在地上。"},{"en":"Move your caboose—we’re going to be late!","zh":"快动起来——我们要迟到了！"}]}],"synonyms":["(railroad) crew car","(railroad, historical) brake van","(slang) backside","(slang) rear end"],"phonetic":"/kəˈbuːs/","extraExplanation":["“caboose”最初与航海和殖民时期的用语有关，后来在北美铁路文化中固定指“列车尾部的乘务员车厢”。随着现代列车采用电子监测设备（如 EOT：end-of-train device），传统守车在美国大多退出日常运营，但在博物馆、观光铁路和模型火车中仍很常见。","俚语义通常带点幽默色彩，但在正式场合不建议使用；用更中性的表达可说 “backside” 或 “rear end”。"]}
{"word":"Caborojo","summary":{"en":"Cabo Rojo is a Spanish place name, most often the town/municipality in southwest Puerto Rico.","zh":"Cabo Rojo 是西语地名，最常指波多黎各西南部的卡沃罗霍市镇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a place name (proper noun), most commonly referring to a municipality on the southwest coast of Puerto Rico; it can also refer to other locations named “Cabo Rojo” in Spanish-speaking regions.","zh":"地名（专有名词），最常见指波多黎各西南海岸的“卡沃罗霍（Cabo Rojo）”市镇；在其他西语地区也可能有同名地点。"},"examples":[{"en":"We visited Cabo Rojo to see the beaches and the lighthouse.","zh":"我们去了卡沃罗霍，看海滩和灯塔。"},{"en":"Cabo Rojo is known for its salt flats and coastal views.","zh":"卡沃罗霍以盐滩和海岸景色闻名。"}]}],"synonyms":["(proper noun)"],"phonetic":"/ˌkɑboʊ ˈroʊhoʊ/","extraExplanation":["“Cabo Rojo”是西班牙语，直译为“红色的海角/岬角”（cabo=海角/岬；rojo=红色）。在英语语境中常直接保留西语拼写与读法。波多黎各的Cabo Rojo尤为常见，相关景点常见写法有Cabo Rojo Lighthouse（卡沃罗霍灯塔）等。"]}
{"word":"caboshed","summary":{"en":"“Caboshed” is a heraldry term describing an animal’s head shown from the front with no neck visible.","zh":"Caboshed 是纹章学用语，指动物头部正面呈现且不显示脖子。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Heraldry) Shown as an animal’s head facing forward, cut off cleanly behind the ears with no neck visible.","zh":"（纹章学）指动物的头正面朝向观察者，头部在耳后被整齐切断，看不见脖子。"},"examples":[{"en":"The shield shows a stag’s head caboshed in the center.","zh":"这面盾徽中央画着一只正面鹿头（caboshed）。"},{"en":"In heraldic terms, “caboshed” means the head appears without any neck.","zh":"在纹章术语中，caboshed 指头部呈现时不带脖子。"}]}],"synonyms":["full-faced (heraldry)","affronté (related heraldic term)"],"phonetic":"/kəˈbɑʃt/","extraExplanation":["caboshed 来自法语 caboche（意为“头、脑袋”）。它主要出现在欧洲纹章学中，用来描述徽章图案的呈现方式。","容易与 erased（像被撕裂/锯齿状断开）或 couped（平直切断，但通常仍会看到一段脖子）混淆；caboshed 的关键是“正面 + 无脖子”。"]}
{"word":"cabossed","summary":{"en":"Cabossed describes (especially in heraldry) an animal head shown full-face with no neck visible; less commonly, it can mean decorated with raised bosses.","zh":"cabossed 多用于纹章学，指动物头部正面朝向、在耳后截断且不露脖子；较少见时也可指表面有圆鼓状凸饰/饰钉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Heraldry) Shown full-face (front view), usually of an animal’s head, cut off close behind the ears so no neck is visible.","zh":"（纹章学）正面朝向地呈现（通常指动物头部），在耳后紧贴处截断，因此看不到脖子。"},"examples":[{"en":"The coat of arms shows a cabossed stag’s head in the center.","zh":"这枚纹章的中心是一颗正面朝向的雄鹿头（cabossed）。"},{"en":"In heraldic terms, a boar’s head can be described as cabossed when it faces the viewer directly with no neck shown.","zh":"在纹章术语里，野猪头如果正面朝向观者且不露脖子，就可以称为 cabossed。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Having raised knob-like ornaments (bosses); studded or embossed with rounded bumps.","zh":"（较少见）带有凸起的圆形饰钉（boss）；表面有圆鼓状凸饰的。"},"examples":[{"en":"The antique leather cover was cabossed with small metal studs.","zh":"那本古旧皮封面上钉着许多小金属凸钉（cabossed）。"},{"en":"They displayed a cabossed shield, richly decorated with bosses.","zh":"他们展示了一面带凸饰的盾牌，上面装饰着许多圆形凸钉。"}]}],"synonyms":["affronté (related)","full-face (related)","bossed (for the ornament sense)","studded (for the ornament sense)"],"phonetic":"/kəˈbɑst/","extraExplanation":["cabossed 常见于纹章学（heraldry）。它和 affronté（正面朝向）意思接近，但 cabossed 更强调“只见头部、紧贴耳后截断、没有脖子”的画法。","词源上与法语有关，早期用法多出现在描述纹章图案与中世纪器物装饰的语境中。"]}
{"word":"Cabot","summary":{"en":"Cabot is most commonly a surname (notably the explorer John Cabot) and also a place name for several towns, especially in the U.S.","zh":"Cabot最常见为姓氏（尤指探险家约翰·卡博特），也可作地名，指美国等地的多个城镇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), especially known from the explorers John Cabot and his son Sebastian Cabot in early European voyages to North America","zh":"卡博特（姓氏），尤其因探险家约翰·卡博特及其儿子塞巴斯蒂安·卡博特而广为人知，与早期欧洲前往北美的航行有关"},"examples":[{"en":"John Cabot sailed under the English flag in 1497.","zh":"约翰·卡博特于1497年在英格兰旗帜下航行。"},{"en":"The book compares Columbus and Cabot as early Atlantic explorers.","zh":"这本书把哥伦布和卡博特作为早期大西洋探险家进行比较。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name used for several towns and areas, especially in the United States (e.g., Cabot, Arkansas; Cabot, Vermont)","zh":"卡博特（地名）：美国等地若干城镇/地区的名称（如阿肯色州的Cabot、佛蒙特州的Cabot）"},"examples":[{"en":"She grew up in Cabot, Arkansas.","zh":"她在阿肯色州的卡博特长大。"},{"en":"We stopped near Cabot, Vermont during our road trip.","zh":"我们公路旅行时在佛蒙特州卡博特附近停了一下。"}]}],"phonetic":"/ˈkæbət/","extraExplanation":["“Cabot”在英语中多作为专有名词使用（人名/地名）。历史语境里最常见的是探险家John Cabot（约翰·卡博特），他在1497年的航行常被认为与欧洲人到达北美东北部有关（具体登陆地点仍有争议）。"]}
{"word":"cabot","summary":{"en":"Cabot most commonly refers to John Cabot, an explorer linked to a 1497 voyage to North America; it can also be a surname or name used for places and organizations.","zh":"Cabot最常指与1497年到达北美航行相关的探险家约翰·卡伯特；也可作姓氏，或用于地名与机构名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(usually capitalized) John Cabot: an Italian-born explorer who sailed for England and is often credited with reaching North America (Newfoundland) in 1497.","zh":"（通常大写）约翰·卡伯特：意大利裔探险家，为英格兰航行，常被认为于1497年到达北美（纽芬兰）。"},"examples":[{"en":"John Cabot’s 1497 voyage is often mentioned in early European exploration of North America.","zh":"约翰·卡伯特1497年的航行常在欧洲早期探索北美的历史中被提到。"},{"en":"Some history books compare Cabot’s route with Columbus’s earlier trips.","zh":"一些历史书会把卡伯特的航线与更早的哥伦布航行作比较。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name or place name (e.g., Cabot as a surname, or towns/companies named Cabot).","zh":"姓氏或地名（例如Cabot作姓氏，或名为Cabot的城镇/公司）。"},"examples":[{"en":"Her last name is Cabot, so people sometimes ask if she’s related to the explorer.","zh":"她的姓是Cabot，所以人们有时会问她是否和那位探险家有亲戚关系。"},{"en":"Cabot is also used in the names of some towns and businesses.","zh":"Cabot也会出现在一些城镇和企业的名称中。"}]}],"synonyms":["John Cabot","Giovanni Caboto"],"phonetic":"/ˈkæbət/","extraExplanation":["“Cabot”在英语里通常指历史人物John Cabot（约翰·卡伯特）。他原名多写作意大利语“Giovanni Caboto”，英语化后成为“John Cabot”。因此你可能会在不同语言或书籍里看到拼写略有变化。"]}
{"word":"cabotage","summary":{"en":"Cabotage is a legal/policy term for foreign companies operating transport services within another country’s domestic market.","zh":"Cabotage 是法律/政策术语，指外国公司在他国国内市场从事境内运输服务的权利或行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the right to operate transport services (especially flights or shipping) within a country by a company from another country, or the act of doing this","zh":"（尤指航空或航运中）他国公司在一国境内经营运输服务的权利；或进行此类境内运输经营的行为"},"examples":[{"en":"Many countries restrict foreign airlines from offering cabotage on domestic routes.","zh":"许多国家限制外国航空公司在国内航线上开展境内运输（cabotage）。"},{"en":"The policy debate focuses on whether allowing cabotage would lower prices for travelers.","zh":"政策讨论的焦点在于，允许境内运输经营是否会降低旅客票价。"}]}],"synonyms":["domestic carriage (policy context)","domestic transport rights"],"phonetic":"/ˈkæbəˌtɑʒ/","extraExplanation":["“Cabotage”常见于航空与海运法规语境。很多国家把国内航线/沿海航运视为需要保护的市场，因此通常只允许本国承运人运营，以维护国家安全、就业与产业稳定。","词源上通常认为与法语有关，且常与航海探险家 John Cabot（卡博特）的名字联系在一起；现代用法主要指“境内运输经营权/限制”，并不等同于一般的“运输”或“航运”。","学习提示：在新闻或政策文件里，cabotage 常与 “domestic routes（国内航线）/ coastal shipping（沿海航运）/ foreign carriers（外国承运人）/ restrictions（限制）/ liberalization（放开）”等搭配出现。"]}
{"word":"cabotages","summary":{"en":"“Cabotages” means instances or types of cabotage: domestic transport within one country (often legally restricted), or historically, coastal shipping.","zh":"“Cabotages”是“cabotage”的复数：指一国境内两地之间的国内运输（常受法律限制），或较旧义为沿海航运。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Domestic transport of goods or passengers between two places in the same country, usually by a foreign ship or airline (often restricted by law).","zh":"（通常指由外国船只或航空公司进行的）在同一国家境内两地之间的货运或客运；常受法律限制。"},"examples":[{"en":"Many countries restrict cabotage to protect local airlines.","zh":"许多国家限制国内航权（cabotage），以保护本国航空公司。"},{"en":"The company was denied permission to provide cabotage services between two U.S. cities.","zh":"该公司未获准在两座美国城市之间提供国内运输服务（cabotage）。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or practice of sailing along a coast, moving from port to port (historical or less common today).","zh":"（较少见/较旧）沿海航行、从港口到港口的航运方式。"},"examples":[{"en":"In earlier centuries, cabotage was essential for trade along the coastline.","zh":"在较早的世纪里，沿海航运（cabotage）对海岸贸易至关重要。"}]}],"synonyms":["domestic transport","coastal shipping","coastwise trade"],"phonetic":"/ˈkæbəˌtɑʒ/","extraExplanation":["“Cabotages”是“cabotage”的复数形式。现代最常见于航空与海运法规语境：例如“cabotage rights”（国内航权/沿岸运输权）通常只允许本国承运人经营，以维护本国产业与国家安全。","词源与航海史有关，源自法语 cabotage，早期更强调“沿海/近海航行”；后来在国际贸易与航空法里，意义更集中在“境内两点间运输（尤其由外方提供）”。"]}
{"word":"cabotin","summary":{"en":"“Cabotin” is a mostly literary/formal word for a showy, exaggerated performer (a ham), often implying mediocre talent or fake emotion.","zh":"“Cabotin”多用于较正式或文学性的语境，指表演浮夸、爱作秀的演员（类似“ham”），常暗示才华一般或情感做作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a showy but not very talented actor; a “ham” who performs in an exaggerated, attention-seeking way","zh":"（通常带贬义）浮夸但才华平平的演员；爱抢镜、表演夸张的“蹩脚戏子”"},"examples":[{"en":"The critic dismissed him as a cabotin who relied on loud gestures instead of real emotion.","zh":"评论家斥他为一个只会靠夸张动作而非真情实感的蹩脚戏子。"},{"en":"She didn’t want a cabotin on the team—she wanted someone who could listen and act naturally.","zh":"她不想要那种爱作秀的人加入团队——她想要能倾听、表演自然的人。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common) theatrical and showy in a way that feels fake or self-important","zh":"（不太常见）做作的；戏剧化到显得虚假或自我膨胀的"},"examples":[{"en":"His cabotin speech sounded designed to impress rather than to inform.","zh":"他那番做作的演讲听起来像是为了博人眼球，而不是为了传达信息。"}]}],"synonyms":["ham","show-off","showboat","poser","overactor"],"phonetic":"/ˈkæbətɪn/","extraExplanation":["该词来自法语 cabotin，常见于评论、文学批评或正式写作中，语气偏刻薄，意思接近英语里的 ham（夸张做作的演员）或 show-off（爱出风头的人）。","在日常英语对话里不算高频词；如果你想更自然地表达，可以用 ham / overact / showboat（更口语）。"]}
{"word":"cabotinage","summary":{"en":"Cabotinage means showy, artificial overacting or attention-seeking behavior.","zh":"cabotinage 指做作夸张的表演或博眼球的作秀行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often disapproving) Theatrical overacting; showy, artificial behavior meant to attract attention (\"hamminess\").","zh":"（常含贬义）舞台式的夸张表演；为吸引注意而做作、装腔作势的行为（“演过头/耍花腔”）。"},"examples":[{"en":"The critic complained that the performance slipped into cabotinage in the final scene.","zh":"影评人抱怨说，这场演出在最后一幕变得过于做作、夸张。"},{"en":"He answered the serious question with cabotinage—big gestures and an exaggerated smile.","zh":"他用装腔作势来回答那个严肃的问题——夸张的手势和过分的笑容。"}]},{"partOfSpeech":"n.","definition":{"en":"(by extension) Showy self-promotion or attention-seeking behavior, especially in public life or politics.","zh":"（引申）卖弄式的自我宣传/博眼球的行为，尤指公共场合或政治场域。"},"examples":[{"en":"Some voters were tired of the cabotinage and wanted practical plans instead.","zh":"一些选民厌倦了这种博眼球的表演，更想听务实的方案。"},{"en":"Her speech avoided cabotinage and focused on facts.","zh":"她的演讲避免了作秀，专注于事实。"}]}],"synonyms":["hamminess","overacting","theatricality","showmanship","grandstanding","posturing"],"phonetic":"/ˌkæbəˈtɪnɑːʒ/","extraExplanation":["“cabotinage”是法语借词，来自“cabotin”（小演员/跑龙套演员，常带轻蔑意味），因此这个词常用来批评“演得太用力、太做作”。","注意不要和“cabotage”混淆：后者在英语里更常见，指“沿海/国内运输（如航空、航运的国内航线运输）”。"]}
{"word":"cabots","summary":{"en":"“Cabots” usually means members of the Cabot family (a famous old Boston family) or, less commonly, multiple people/things named Cabot.","zh":"“Cabots”通常指卡博特家族成员（波士顿著名老家族），也可较少见地指多个名为Cabot的人或事物。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a plural form of the surname “Cabot,” often referring to members of the Cabot family (especially a well-known, old Boston family in the U.S.).","zh":"姓氏“Cabot”的复数形式，常指卡博特家族的成员（尤其在美国语境中，常指波士顿著名的老钱家族）。"},"examples":[{"en":"In the old joke, “the Cabots” represent Boston’s traditional upper class.","zh":"在老笑话里，“the Cabots”常用来代表波士顿传统上层阶级。"},{"en":"Some historians mention the Cabots as part of Boston’s elite social circles in the 1800s.","zh":"一些历史学者会提到卡博特家族，认为他们属于19世纪波士顿的精英社交圈。"}]},{"partOfSpeech":"other","definition":{"en":"less commonly, the plural of “Cabot” used to refer to people or things named Cabot (for example, businesses, schools, streets, or ships with the name).","zh":"较少见：用作“Cabot”的复数，指多个名为Cabot的事物（如公司、学校、街道或船只等）。"},"examples":[{"en":"There are several places named Cabot, so you might see “Cabots” in a list of locations.","zh":"有好几个地方叫Cabot，所以在地点列表中可能会看到“Cabots”。"},{"en":"The museum exhibit compared two ships named Cabot—so the guide casually called them “the Cabots.”","zh":"博物馆展览对比了两艘名为Cabot的船，所以讲解员随口把它们称作“the Cabots”。"}]}],"synonyms":["the Cabot family","Boston Brahmins (context-related)"],"phonetic":"/ˈkæbəts/","extraExplanation":["“the Cabots”在美国文化里常和“Boston Brahmins（波士顿婆罗门）”联系在一起，指历史悠久、教育背景强、社会地位高的波士顿精英阶层。常被用在带点讽刺或调侃的语境中，暗示“老钱”“传统势力”“社交圈封闭”。","有一句常被引用的打油诗（多为转述版本）：“And this is good old Boston / The home of the bean and the cod / Where the Lowells speak only to Cabots / And the Cabots speak only to God.” 其中“Cabots”象征上层圈子的人脉与阶层边界。"]}
{"word":"cabouca","summary":{"en":"“cabouca” is not a standard English word; it’s likely a misspelling or a proper name.","zh":"“cabouca”不是标准英语词汇；很可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a proper name (e.g., a surname, place name, or brand).","zh":"不是标准英语词汇，可能是拼写错误或专有名词（如姓氏、地名或品牌名）。"},"examples":[{"en":"I couldn’t find “cabouca” in an English dictionary—could you share the sentence you saw it in?","zh":"我在英语词典里找不到“cabouca”，你能把它出现的句子发我看看吗？"},{"en":"Did you mean “caboose” (the last car of a train)?","zh":"你是不是想写“caboose”（火车最后一节车厢）？"}]}],"phonetic":"N/A","extraExplanation":["“cabouca”在常见英语词典中没有收录，因此最常见的情况是：\n1）拼写误差：可能想写 caboose（火车车尾车厢）、caboca/caboclo（葡语相关词）、或其他近似拼写；\n2）专有名词：人名、地名、店名/品牌名，通常不作为通用词条收录。\n如果你把它所在的句子、来源（书/歌/游戏/社媒）、或你想表达的意思发来，我可以更准确判断。"]}
{"word":"Cabral","summary":{"en":"Cabral is mainly a Portuguese surname, often referring to the explorer Pedro Álvares Cabral, and it can also be a place name.","zh":"Cabral主要是葡萄牙语姓氏，常指航海家佩德罗·阿尔瓦雷斯·卡布拉尔，也可用作地名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Portuguese (and Lusophone) surname; often refers to Pedro Álvares Cabral (c. 1467–1520), the Portuguese navigator commonly credited with reaching Brazil in 1500.","zh":"葡萄牙语（及其他葡语国家常见）的姓氏；常特指佩德罗·阿尔瓦雷斯·卡布拉尔（约1467–1520），一般被认为于1500年抵达巴西的葡萄牙航海家。"},"examples":[{"en":"In 1500, Cabral led a Portuguese fleet that reached the coast of what is now Brazil.","zh":"1500年，卡布拉尔率领葡萄牙舰队抵达了今天巴西的海岸。"},{"en":"Many streets and schools in Brazil are named after Cabral.","zh":"巴西有许多街道和学校以卡布拉尔命名。"}]},{"partOfSpeech":"other","definition":{"en":"a place name in several countries (for example, towns or neighborhoods) named after people with the surname Cabral.","zh":"若干国家中的地名（如城镇、街区等），常以“Cabral（卡布拉尔）”这一姓氏人物命名。"},"examples":[{"en":"They moved to Cabral, a small community outside the city.","zh":"他们搬到了城外一个叫Cabral的小社区。"},{"en":"The meeting will be held near Cabral Square.","zh":"会议将在卡布拉尔广场附近举行。"}]}],"synonyms":["(no direct synonyms; proper name)"],"phonetic":"/kəˈbrɑːl/","extraExplanation":["在英语语境中，“Cabral”多作为专有名词出现，通常不翻译，只做音译（如“卡布拉尔”）。\n\n历史上提到“Cabral”最常指佩德罗·阿尔瓦雷斯·卡布拉尔。他原本航向印度，途中横渡大西洋偏西，抵达南美海岸，并将该地宣称为葡萄牙王室领地。这一事件常被简化为“发现巴西”，但从文化敏感与历史准确性角度，亦应看到当地原住民早已在此生活。"]}
{"word":"cabre","summary":{"en":"Cabre is a rare word meaning “to rear up,” especially of a horse; it’s also used in heraldry to describe a rearing horse.","zh":"Cabre 是个较罕见的词，常指（马）扬蹄直立；在纹章学中也可作形容词，描述徽章上“扬蹄直立”的马。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Rare) (Of a horse) to rear up on its hind legs.","zh":"（罕见用法）（指马）用后腿直立、前蹄腾起（扬蹄、直立）。"},"examples":[{"en":"The startled horse cabred and nearly threw its rider.","zh":"受惊的马突然扬蹄直立，差点把骑手甩下去。"},{"en":"In the arena, the stallion cabred for a moment before settling.","zh":"在场地里，那匹公马短暂扬蹄直立后才安定下来。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Heraldry) Describing an animal (especially a horse) shown rearing up on its hind legs.","zh":"（纹章学）用于描述动物（尤指马）在徽章图案中以后腿直立的姿态。"},"examples":[{"en":"The coat of arms shows a horse cabre above the shield.","zh":"这枚徽章在盾牌上方画着一匹扬蹄直立的马。"},{"en":"A cabre horse is similar to “rampant,” but often associated with horses.","zh":"“cabre”的马姿态类似“rampant（直立）”，但更常与马相关。"}]}],"synonyms":["rear (up)","rear back","rise up"],"phonetic":"/kəˈbreɪ/","extraExplanation":["“cabre”多见于借自法语的用法（源自法语动词 cabrer，意为“扬起、直立”），在现代日常英语中非常少见；更常用的说法是 rear (up) / rear back。","在纹章学里，姿态词（如 rampant, passant, couchant）用来描述动物在徽章上的固定动作与站姿；cabre 通常专门用来强调“马扬蹄直立”的形象。"]}
{"word":"cabree","summary":{"en":"“Cabree” isn’t standard; it’s usually meant to be “cabre,” a rare verb meaning a horse rears up.","zh":"“cabree”不是标准拼写；通常是想写“cabre”，一个较少见的动词，指马扬起前蹄直立。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; often a misspelling of “cabre” (mainly used about a horse rearing up).","zh":"不是标准英语单词；常见于对“cabre”的拼写错误（主要指马以前蹄腾空、后腿站立）。"},"examples":[{"en":"I couldn’t find “cabree” in a dictionary—did you mean “cabre”?","zh":"我在词典里找不到“cabree”——你是不是想写“cabre”？"}]},{"partOfSpeech":"vi.","definition":{"en":"(Of a horse) to rear up on its hind legs.","zh":"（马）以前蹄离地、后腿站立（扬蹄、直立）。"},"examples":[{"en":"The horse cabred when it heard the loud bang.","zh":"马听到巨响后突然扬起前蹄直立。"},{"en":"The rider pulled the reins to stop the horse from cabring.","zh":"骑手拉紧缰绳，防止马再扬蹄直立。"}]}],"synonyms":["rear","rear up","prance (context-dependent)"],"phonetic":"/kəˈbrɛr/","extraExplanation":["“cabre”来自法语（cabre/cabrer 一类形式），在英语里比较少见，多见于描写骑马、斗牛或文学性的动作描写。日常英语更常用的说法是：a horse rears / rears up（马扬起前蹄直立）。","如果你其实想表达舞蹈动作，可能是“cabriole”（芭蕾术语，指空中击腿跳）。如果你能给我一句原句/上下文，我可以帮你确认到底是哪一个词。"]}
{"word":"Cabrera","summary":{"en":"“Cabrera” is most commonly a Spanish surname, and it can also be used as a place name.","zh":"“Cabrera”最常见的是西班牙语姓氏，也可以用作地名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Spanish-language surname (family name), common in Spain and Latin America.","zh":"一个西班牙语姓氏（家族姓），在西班牙及拉丁美洲很常见。"},"examples":[{"en":"My neighbor’s last name is Cabrera.","zh":"我邻居的姓是 Cabrera。"},{"en":"Cabrera is a common surname in many Spanish-speaking countries.","zh":"Cabrera 在许多西语国家都是常见姓氏。"}]},{"partOfSpeech":"other","definition":{"en":"a place name used in several Spanish-speaking regions (for example, names of towns, islands, or neighborhoods).","zh":"一个地名，在一些西语地区用作城镇、岛屿或社区等的名称。"},"examples":[{"en":"We stayed near Cabrera during our trip.","zh":"旅行时我们住在 Cabrera 附近。"},{"en":"Please confirm whether “Cabrera” here refers to the person or the place.","zh":"请确认这里的 “Cabrera” 指的是人名还是地名。"}]},{"partOfSpeech":"other","definition":{"en":"the name of several well-known public figures (used as a last name), such as athletes or artists.","zh":"若干知名公众人物的姓（例如运动员或艺术家）。"},"examples":[{"en":"Miguel Cabrera is a famous baseball player.","zh":"Miguel Cabrera 是一位著名的棒球选手。"},{"en":"When you say “Cabrera,” do you mean the golfer or the baseball player?","zh":"你说 “Cabrera” 指的是高尔夫球手还是棒球手？"}]}],"phonetic":"/kəˈbrɛrə/","extraExplanation":["“Cabrera”源自西班牙语：常被认为与“cabra（山羊）”有关，历史上可能指“有山羊的地方/与山羊相关的人”。因此它既可作姓氏，也常见于地名。"]}
{"word":"cabrerite","summary":{"en":"Cabrerite is a rare green nickel–magnesium arsenate mineral name used mainly in geology/mineralogy.","zh":"cabrerite 指一种罕见的绿色镍—镁砷酸盐矿物名称，主要用于地质学/矿物学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare green mineral (a nickel–magnesium arsenate), found in some oxidized nickel deposits.","zh":"一种罕见的绿色矿物（含镍与镁的砷酸盐矿物），可见于某些镍矿床的氧化带中。"},"examples":[{"en":"Cabrerite is mainly mentioned in mineralogy references rather than everyday English.","zh":"cabrerite 主要出现在矿物学资料中，而不是日常英语里。"},{"en":"The specimen was labeled as cabrerite, a green nickel-bearing arsenate mineral.","zh":"这块标本的标签写着 cabrerite，一种绿色、含镍的砷酸盐矿物。"}]}],"synonyms":["mineral (technical term)"],"phonetic":"/ˈkæbrəˌraɪt/","extraExplanation":["“cabrerite”属于专业矿物学词汇，日常交流中几乎不会用到；更多见于矿物名录、矿物鉴定报告或博物馆标注。","它通常与含镍矿床的风化/氧化过程相关：当原生含镍矿物在地表条件下发生化学变化时，可能形成此类次生矿物。","名称多为人名或地名来源的矿物命名传统的一部分（类似许多以科学家、发现地命名的矿物）。"]}
{"word":"cabresta","summary":{"en":"Cabresta is a Spanish word meaning a halter or lead rope for leading an animal.","zh":"cabresta是西班牙语词，指牵引动物用的缰绳/笼头带（牵绳）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish word) a halter or lead rope used to control or lead an animal (especially a horse, mule, or cow).","zh":"（西班牙语）缰绳／笼头带；用于牵引或控制动物（尤指马、骡或牛）的牵绳。"},"examples":[{"en":"He put a cabresta on the mule before leading it to the stable.","zh":"他先给骡子套上cabresta（牵绳/笼头带），再把它牵到马厩。"},{"en":"Hold the cabresta firmly, but don’t pull too hard.","zh":"把cabresta握稳，但别拉得太用力。"}]}],"synonyms":["halter","lead rope","tether"],"phonetic":"/kəˈbrɛstə/","extraExplanation":["“cabresta”主要见于西班牙语语境（牧场、骑马、赶牲口等）。在英语里更常用的说法是“halter”（笼头）或“lead rope”（牵引绳）。如果在英文文本中看到cabresta，通常是保留原语以呈现地方色彩或文化背景。"]}
{"word":"cabrestas","summary":{"en":"“cabrestas” is Spanish for “halters/lead ropes” (plural of cabresta).","zh":"“cabrestas”是西班牙语，意为“（多条）笼头牵引绳／缰绳”，是 cabresta 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish, plural of cabresta) halters; lead ropes used to control an animal (especially a horse, mule, or donkey).","zh":"（西语，cabresta 的复数）缰绳／笼头绳；用于牵引和控制动物（尤指马、骡、驴）的牵引绳。"},"examples":[{"en":"The ranch hands put on the cabrestas before leading the horses out.","zh":"牧场工人在把马牵出来之前先给它们套上牵引笼头绳（cabrestas）。"},{"en":"He grabbed the cabrestas and guided the mule into the barn.","zh":"他抓起牵引绳（cabrestas），把骡子带进了畜棚。"}]}],"synonyms":["halters","lead ropes"],"phonetic":"/kaˈbɾes.tas/","extraExplanation":["“cabrestas”是西班牙语名词复数，单数为“cabresta”。在西语牧场文化（如墨西哥、拉丁美洲与美国西南部的西语语境）中常见，用来指牵马或其他役畜的笼头/牵引绳。英语里更常用对应词“halter”或“lead rope”，但在带有西语背景的叙述（文学作品、历史文本、边境地区口语）中可能直接保留为“cabrestas”。"]}
{"word":"cabresto","summary":{"en":"Cabresto (Spanish): a halter/lead rope for controlling an animal; less commonly, a noose.","zh":"cabresto（西语）：指控制动物的笼头/牵绳；较少见也可指绳套（绞索）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a halter (headgear) and/or lead rope used to control a horse, mule, or other working animal; by extension, anything used to lead or restrain an animal","zh":"（西语）笼头；牵绳（用于控制马、骡等役用动物）；引申为用来牵引或约束动物的器具"},"examples":[{"en":"He put a cabresto on the mule before leading it to the river.","zh":"他给骡子套上cabresto（笼头/牵绳），然后牵它去河边。"},{"en":"Keep the cabresto tight when the horse gets nervous.","zh":"马紧张的时候，把cabresto（牵绳）握紧一点。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a noose; a rope used for hanging","zh":"（较少见）套索；绞刑用的绳套"},"examples":[{"en":"In older stories, the word cabresto can refer to a hanging noose.","zh":"在较早的故事或文本里，cabresto有时指“绞刑的绳套”。"}]}],"synonyms":["halter","lead rope","headstall","noose"],"phonetic":"/kɑˈbɹɛstoʊ/","extraExplanation":["“cabresto”是西班牙语词，在拉美乡村、牧场语境里很常见，常和马、骡、牛等役畜一起出现。英语里通常会直接说“halter / lead rope”，但在描写西语文化背景（如牧场、骑手、乡村生活）的英语文本中，也可能保留原词以呈现地方色彩。","词义上从“牵引、控制动物的笼头/牵绳”延伸到“束缚人的绳套（noose）”并不罕见：两者都强调“套住并控制/限制”。"]}
{"word":"cabrestos","summary":{"en":"“cabrestos” is a Spanish plural noun meaning halters or lead ropes used to lead animals.","zh":"“cabrestos”是西班牙语复数名词，意思是用于牵引动物的笼头或牵引绳。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) plural of “cabresto”: a halter or lead rope used to control or lead an animal (especially a horse, mule, or donkey).","zh":"（西班牙语）“cabresto”的复数：指用来控制或牵引动物（尤指马、骡、驴）的缰绳/笼头（牵引绳）。"},"examples":[{"en":"The ranch hands grabbed the cabrestos to lead the mules out of the corral.","zh":"牧场工人拿起cabrestos，把骡子从围栏里牵出来。"},{"en":"He tied the horse with one of the cabrestos and checked the saddle.","zh":"他用一根cabrestos把马拴好，然后检查马鞍。"}]}],"synonyms":["halters","lead ropes","headstalls"],"phonetic":"/kɑˈbrɛstoʊs/","extraExplanation":["“cabresto”是西班牙语词（复数 cabrestos），常见于描写西班牙语文化背景的文本（如拉美乡村、牛仔/牧场题材）。英语里更常用的对应说法是 halter（笼头）或 lead rope（牵引绳）。"]}
{"word":"cabret","summary":{"en":"“Cabret” is usually a misspelling of “cabaret,” a place offering live music and stage entertainment.","zh":"“Cabret”通常是“cabaret”的拼写误写；“cabaret”指有现场音乐和舞台表演的歌舞夜总会/餐饮娱乐场所。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare in English) A misspelling or nonstandard spelling of “cabaret,” meaning a nightclub or restaurant with music, singing, dancing, and stage entertainment.","zh":"（英语中很少见）常见为“cabaret”的拼写错误或非标准拼写，指有现场音乐、歌唱、舞蹈与舞台表演的夜总会或餐馆式娱乐场所。"},"examples":[{"en":"I think you meant “cabaret,” not “cabret.”","zh":"我想你想写的是“cabaret”，不是“cabret”。"},{"en":"They went to a cabaret for dinner and live music.","zh":"他们去歌舞夜总会吃晚餐、听现场音乐。"}]}],"synonyms":["cabaret","nightclub","club","music hall"],"phonetic":"/ˌkæbəˈreɪ/","extraExplanation":["“Cabaret”来自法语，常指带表演的夜生活场所；在英语里更常见的固定搭配有“cabaret show”（歌舞表演）、“cabaret club”（歌舞俱乐部）。","如果你是在找某个专有名词（如人名、品牌名、书名）“Cabret”，也可能是特定作品或名字的拼写，而不是普通英语词汇。"]}
{"word":"cabretta","summary":{"en":"Cabretta is soft, fine kidskin leather, commonly used for high-quality gloves.","zh":"Cabretta 指柔软细致的小山羊皮革，常用于高品质手套等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very soft, fine leather made from kidskin (the skin of a young goat), often used for gloves and other items that need flexibility","zh":"一种非常柔软、细致的皮革，通常由小山羊皮（kidskin）制成，常用于手套等需要柔韧性的物品"},"examples":[{"en":"He bought a pair of cabretta gloves for the wedding.","zh":"他为婚礼买了一副cabretta（小山羊皮）手套。"},{"en":"Cabretta leather is prized because it feels smooth and supple.","zh":"Cabretta皮革很受欢迎，因为触感光滑、柔软有韧性。"},{"en":"Some golf gloves use cabretta for better grip and comfort.","zh":"一些高尔夫手套会使用cabretta皮革，以获得更好的抓握感和舒适度。"}]}],"synonyms":["kidskin","goatskin leather"],"phonetic":"/kəˈbrɛtə/","extraExplanation":["Cabretta 常见于商品说明（尤其是手套、运动手套）。它通常指“孩子皮/小山羊皮”的高档皮革，特点是细腻、贴手、延展性好，但相对更需要保养，避免长期受潮或暴晒。","词源上与“山羊”有关（可联想到 cabra / capra 这类表示“母山羊/山羊”的词根），因此它与 goatskin（山羊皮）、kidskin（小山羊皮）在意义上高度相关。"]}
{"word":"cabrettas","summary":{"en":"Cabrettas are soft, fine leather (plural of cabretta), commonly used for gloves.","zh":"Cabrettas指柔软细致的羊皮革（cabretta的复数），常用于制作手套。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"soft, fine leather made from hair sheep (often used for gloves); “cabrettas” is the plural form of “cabretta.”","zh":"（常用于手套的）卡布雷塔羊皮/毛羊皮制成的柔软细皮革；“cabrettas”是“cabretta”的复数。"},"examples":[{"en":"These gloves are made from cabrettas, so they feel very soft and flexible.","zh":"这些手套是用cabrettas（卡布雷塔羊皮）做的，所以手感很柔软、很有弹性。"},{"en":"The brand advertises cabretta leather for better grip and comfort.","zh":"这个品牌宣传使用cabretta羊皮，以提供更好的抓握感和舒适度。"}]}],"synonyms":["cabretta leather","sheepskin leather","hair-sheep leather"],"phonetic":"/kəˈbrɛtə/","extraExplanation":["“Cabretta”在商品语境里通常指“hair sheep（毛羊/无毛羊）”的皮革，并不一定等同于普通“lambskin（小羊皮）”。在高尔夫手套、骑行/驾驶手套等领域常见，因为它薄、贴手、抓握感好。","拼写提示：更常见的单数形式是“cabretta”，复数为“cabrettas”。有时也会在标签上写“cabretta leather”。"]}
{"word":"cabreuva","summary":{"en":"Cabreuva is mainly a name for a South American tree and its hard, durable wood; less commonly it can refer to its aromatic resin/oil.","zh":"Cabreuva 主要指一种南美树木及其坚硬耐用的木材；较少情况下也可指其芳香树脂/精油。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a South American tree (especially in Brazil and nearby regions) whose hard, durable wood is used for construction, flooring, and furniture; also the wood from this tree","zh":"一种南美洲树木（尤指巴西及周边地区），其木材坚硬耐用，用于建筑、地板和家具；也指这种树的木材"},"examples":[{"en":"The workshop used cabreuva wood because it resists wear and lasts for years.","zh":"这家工坊使用 cabreuva 木材，因为它耐磨而且经久耐用。"},{"en":"Cabreuva is sometimes chosen for heavy-duty flooring in humid climates.","zh":"在潮湿气候中，cabreuva 有时会被选来铺设耐用型地板。"}]},{"partOfSpeech":"n.","definition":{"en":"the aromatic resin or essential oil associated with the cabreuva tree, used in perfumery and traditional products (less common)","zh":"与 cabreuva 树相关的芳香树脂或精油，用于香水或传统制品（较少见）"},"examples":[{"en":"Some perfumes use a note described as cabreuva, with a warm, balsamic scent.","zh":"有些香水会使用被称为 cabreuva 的香调，气味温暖、带树脂般的香甜。"}]}],"synonyms":["cabreúva (variant spelling)","tropical hardwood"],"phonetic":"/ˌkæbriˈuːvə/","extraExplanation":["“cabreuva”常见于木材贸易或植物学语境，也常写作带重音的葡萄牙语拼写“cabreúva”。不同地区可能指不同但相近的树种（常见与 Myrocarpus 属相关），所以在专业场景里最好结合产地或拉丁学名确认。","作为外来词，它在英语里多用于“材料/木材名称”，日常对话中并不常见。"]}
{"word":"cabrie","summary":{"en":"“Cabrie” is not a standard English vocabulary word; it’s likely a misspelling or a name, so meaning depends on context.","zh":"“cabrie”不是标准英语词汇；更可能是拼写错误或专有名词，含义需要结合上下文判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or a name (for example, a username, brand name, or surname).","zh":"不是标准英语词。更可能是拼写错误，或是一个名字（例如用户名、品牌名或姓氏）。"},"examples":[{"en":"I couldn’t find “cabrie” in a standard English dictionary—did you mean another word?","zh":"我在常见英语词典里找不到“cabrie”——你是不是想写另一个词？"},{"en":"“Cabrie” might be a person’s name, so its meaning depends on context.","zh":"“Cabrie”可能是人名，因此含义要看上下文。"}]}],"phonetic":"/ˈkæbri/","extraExplanation":["你可能想查的是这些更常见的词：\n1) cabbie /ˈkæbi/（口语）出租车司机。\n2) cabriolet /ˌkæbriəˈleɪ/ 敞篷车（较正式用法）。\n3) Capri /ˈkɑːpri/ 卡普里岛（意大利地名，也常见作品牌/名字）。\n如果你告诉我你看到“cabrie”的句子或截图，我可以帮你准确判断它是什么、该怎么理解。"]}
{"word":"cabrilla","summary":{"en":"Cabrilla is a Spanish-derived word used in English mainly to mean an edible sea fish, often a grouper, common in the eastern Pacific.","zh":"Cabrilla在英语里多借自西语，主要指一种可食用的海鱼，常与石斑鱼类相关，常见于东太平洋地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of sea bass-like fish (often a grouper), especially in the eastern Pacific, used as food.","zh":"一种近似海鲈的海鱼（常指石斑鱼类），多见于东太平洋海域，常作为食用鱼。"},"examples":[{"en":"We ordered grilled cabrilla tacos by the beach.","zh":"我们在海边点了烤cabrilla鱼塔可。"},{"en":"The fisherman said cabrilla is best when it’s very fresh.","zh":"渔夫说cabrilla越新鲜越好吃。"}]}],"synonyms":["grouper","sea bass (regional/menu use)"],"phonetic":"/kəˈbriːjə/","extraExplanation":["“Cabrilla”常见于墨西哥及东太平洋沿岸的菜单与渔业语境中。不同地区可能把不同但相近的鱼称作cabrilla（常与石斑鱼/海鲈类有关），所以在菜单上不一定对应单一物种。这个词来自西班牙语，旅行或点餐时常被当作鱼名使用。"]}
{"word":"cabrillas","summary":{"en":"Cabrillas is a Spanish plural word meaning “little goats,” and it can also describe a sky dotted with small, puffy clouds (a “mackerel sky”).","zh":"Cabrillas 是西班牙语复数词，常指“小山羊”，也可形容布满碎小云团的“鱼鳞天/羊群云”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish loanword; plural) little goats; goat kids.","zh":"（西班牙语借词；复数）小山羊；羊羔（山羊幼崽）。"},"examples":[{"en":"In the village, the cabrillas followed their mother along the path.","zh":"在村子里，小山羊跟着母羊沿着小路走。"},{"en":"He said he grew up herding cabrillas in the hills.","zh":"他说他是在山里放小山羊长大的。"}]},{"partOfSpeech":"n.","definition":{"en":"(Regional; figurative, from Spanish) a sky filled with small, puffy clouds—like a “mackerel sky” (often altocumulus).","zh":"（地区用法；比喻义，源自西班牙语）布满一小团一小团云的天空，像“鱼鳞天/羊群云”（常指高积云）。"},"examples":[{"en":"By afternoon, cabrillas covered the sky, hinting that the weather might change.","zh":"到下午，天空布满一团团的“羊群云”，暗示天气可能要变。"},{"en":"Sailors watch for cabrillas because they can appear before wind or rain.","zh":"水手会留意“羊群云”，因为它们有时会在起风或下雨前出现。"}]}],"synonyms":["kid goats","young goats","altocumulus","mackerel sky"],"phonetic":"/kɑːˈbriːjɑːs/","extraExplanation":["“Cabrillas”是西班牙语 cabrilla（“小母山羊/小山羊”的指小词）的复数形式。它偶尔会以原词形式出现在英语文本中，常见于描写西语文化语境的文学、旅行写作或地方性表达。","把天空的碎云称作“cabrillas”属于形象化说法：像一群小羊散布在天上；英语里更常用的对应说法是 “mackerel sky”（鱼鳞天）。"]}
{"word":"Cabrini","summary":{"en":"“Cabrini” is usually a proper name, most commonly referring to Saint Frances Xavier Cabrini (Mother Cabrini), and it also appears in place and institution names.","zh":"「Cabrini」多為專有名詞，最常指聖方濟各·沙勿略·卡布里尼（卡布里尼修女），也常見於地名與機構名稱中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Saint Frances Xavier Cabrini (1850–1917), an Italian-born Catholic nun who worked in the United States to help immigrants; also known as Mother Cabrini and remembered for founding schools, hospitals, and orphanages.","zh":"聖方濟各·沙勿略·卡布里尼（1850–1917），義大利出生的天主教修女，在美國投入移民服務；亦稱「卡布里尼修女／Mother Cabrini」，以創辦學校、醫院與孤兒院而聞名。"},"examples":[{"en":"St. Frances Xavier Cabrini is often called the patron saint of immigrants.","zh":"聖方濟各·沙勿略·卡布里尼常被稱為「移民的主保聖人」。"},{"en":"Many hospitals and schools in the U.S. are named after Cabrini.","zh":"美國有不少醫院和學校以卡布里尼命名。"}]},{"partOfSpeech":"other","definition":{"en":"A surname or name used in place names and institutions (for example, Cabrini-Green in Chicago or Cabrini University).","zh":"姓氏；也常用於地名與機構名稱（例如芝加哥的 Cabrini-Green，或 Cabrini University 等）。"},"examples":[{"en":"The documentary discusses life in Cabrini-Green during the 1990s.","zh":"這部紀錄片談到 1990 年代在 Cabrini-Green 的生活。"},{"en":"She attends a college with “Cabrini” in its name.","zh":"她就讀於校名中含有「Cabrini」的學院。"}]}],"synonyms":["Mother Cabrini","St. Frances Xavier Cabrini","Saint Cabrini"],"phonetic":"/kəˈbriːni/","extraExplanation":["「Cabrini」是義大利姓氏，英語裡多讀作 /kəˈbriːni/（重音在第二音節）。在天主教語境中，單獨說「Cabrini」常指「Mother Cabrini（卡布里尼修女）」。","她於 1946 年被封為聖人，常被視為與移民、跨文化服務、慈善機構相關的象徵。因此在美國許多醫療與教育機構會用她的姓氏命名。","「Cabrini-Green」是芝加哥曾經著名的公共住宅區名稱；在美國文化中，它也常出現在新聞、回憶錄與影視作品裡，與城市貧困、住房政策等議題相關。"]}
{"word":"cabriole","summary":{"en":"Cabriole most commonly means a ballet jump with a midair beat, and it can also mean a curved, decorative furniture leg.","zh":"cabriole 常指芭蕾中的“空中击打腿”的跳跃动作，也可指一种向外弯曲的装饰性家具腿（卡布里奥尔腿）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In ballet) a jump where one leg beats against the other in midair.","zh":"（芭蕾）“卡布里奥尔跳”：腾空时一条腿在空中击打另一条腿的跳跃动作。"},"examples":[{"en":"In class, she practiced a clean cabriole to improve her elevation.","zh":"在课堂上，她练习标准的卡布里奥尔跳来提高腾空高度。"},{"en":"The choreographer added a cabriole to make the solo more dramatic.","zh":"编舞在独舞里加入了卡布里奥尔跳，让效果更有张力。"}]},{"partOfSpeech":"n.","definition":{"en":"A decorative furniture leg shape, typically curved outward and ending in a foot such as a hoof or scroll (common in older European styles).","zh":"（家具）“卡布里奥尔腿”：一种装饰性椅/桌腿造型，通常向外弯曲，末端常做成蹄形或卷饰（多见于欧洲古典风格）。"},"examples":[{"en":"The antique chair has elegant cabriole legs.","zh":"这把古董椅有优雅的卡布里奥尔腿。"},{"en":"Many Queen Anne pieces feature cabriole legs and curved lines.","zh":"许多安妮女王风格家具都有卡布里奥尔腿和柔和的曲线。"}]}],"synonyms":["(dance) jump","(dance) beaten jump","(furniture) curved leg","(furniture) Queen Anne leg"],"phonetic":"/ˌkæbriˈoʊl/","extraExplanation":["“Cabriole”来自法语，和表示“腾跳/翻跃”的词源有关，所以它既用于芭蕾动作，也被借用来描述家具腿那种“向外弯、像要跳起来”的曲线造型。","在英文里它通常出现在艺术/设计语境：舞蹈课、芭蕾评论、古董家具、室内设计与风格介绍（如 Queen Anne、Rococo 等）。"]}
{"word":"cabrioles","summary":{"en":"Cabrioles are lively leaps or jumps; in ballet, they are a specific jump with a leg beat in midair.","zh":"Cabrioles 指轻快的跳跃动作；在芭蕾中指一种在空中击腿的特定跳跃。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a series of leaps, jumps, or playful movements, especially in dancing or lively movement","zh":"一连串跳跃、翻腾或嬉戏般的动作（尤指舞蹈或轻快的动作）"},"examples":[{"en":"The dancers performed cabrioles across the stage.","zh":"舞者在舞台上做出一连串的跳跃动作。"},{"en":"The puppy ran around the yard in happy cabrioles.","zh":"小狗在院子里开心地蹦跳翻腾。"}]},{"partOfSpeech":"n.","definition":{"en":"in ballet, a jump where one leg is beaten against the other in midair","zh":"（芭蕾）一种跳跃动作：在空中用一条腿快速击打另一条腿"},"examples":[{"en":"Her cabrioles were clean and high in the final variation.","zh":"她在最后一段独舞中的“卡布里奥尔跳”干净利落、跳得很高。"},{"en":"The teacher asked the class to practice cabrioles at the barre first.","zh":"老师让大家先在把杆旁练习卡布里奥尔跳。"}]}],"synonyms":["leaps","jumps","bounds","capers","springing steps"],"phonetic":"/ˈkæbriˌoʊlz/","extraExplanation":["“cabrioles”是复数形式，单数是“cabriole”。该词来自法语“cabriole/cabrioler”，与“小山羊（cabri）”有关，暗示像小羊一样轻快跳跃的动作。","在文学或描写中，cabrioles常用来表达“欢快、轻盈、带点顽皮”的跳跃姿态；在舞蹈语境里则更偏向专业术语。"]}
{"word":"cabriolet","summary":{"en":"A cabriolet is most commonly a convertible car with a folding/removable roof.","zh":"cabriolet 最常指带可折叠/可拆卸车顶的敞篷车（敞篷版车型）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a car with a folding or removable roof (a convertible); in some contexts, a small open horse-drawn carriage.","zh":"（汽车）折叠或可拆卸车顶的敞篷车；（某些语境）小型敞篷马车。"},"examples":[{"en":"They rented a cabriolet to drive along the coast with the top down.","zh":"他们租了一辆敞篷车，开着敞篷沿海岸行驶。"},{"en":"In old novels, a cabriolet might refer to a light two-wheeled carriage.","zh":"在一些老小说里，cabriolet 也可能指轻便的两轮敞篷马车。"}]}],"synonyms":["convertible","drop-top"],"phonetic":"/ˌkæbriəˈleɪ/","extraExplanation":["词源来自法语 cabriolet，和“跳跃、轻快地动”的意象有关（cabriole）。早期多指轻便马车，后来在现代英语中更常指“敞篷车（convertible）”。","用法提示：英美日常更常说 convertible；cabriolet 听起来更偏“车型称呼/广告用语/较正式或欧式表达”。在汽车语境里常见搭配：a cabriolet version/model（敞篷版/敞篷车型）、two-seater cabriolet（双座敞篷）。"]}
{"word":"cabriolets","summary":{"en":"“Cabriolets” is the plural of “cabriolet,” meaning convertible cars; historically, it also meant a light horse-drawn carriage.","zh":"“cabriolets”是“cabriolet”的复数，常指敞篷车；历史上也指一种轻便的两轮篷马车。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a car with a folding/soft roof that can be opened; a convertible (also called a cabriolet)","zh":"（汽车）敞篷车；可折叠车顶的跑车/轿跑（也可称 cabriolet）"},"examples":[{"en":"They rented a cabriolet for the weekend drive along the coast.","zh":"他们租了一辆敞篷车，周末沿海岸线兜风。"},{"en":"In this model, the cabriolet version costs more than the coupe.","zh":"在这款车型中，敞篷版比双门轿跑（coupe）更贵。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) a light two-wheeled horse-drawn carriage with a folding top","zh":"（历史用法）轻便的两轮马车（常带可折叠篷顶）"},"examples":[{"en":"In old novels, a gentleman might arrive in a cabriolet.","zh":"在一些老小说里，绅士可能会坐着两轮篷马车（cabriolet）到来。"}]}],"synonyms":["convertible","drop-top","ragtop"],"phonetic":"/ˌkæbriəˈleɪ/","extraExplanation":["“cabriolet”来自法语，和“跳跃/轻快移动”的词根有关，早期先指轻便的马车，后来引申为“轻便、可打开车顶的汽车”。","现代英语里更常用“convertible”表示敞篷车；“cabriolet”在汽车语境中更偏正式或常见于欧洲品牌的车型命名（如某些保时捷车型）。"]}
{"word":"cabrit","summary":{"en":"Cabrit is a less common word meaning a young goat, and sometimes the meat from a young goat (often in French- or Caribbean-influenced usage).","zh":"Cabrit 是较少见的词，意思是“小山羊”，有时也指“小山羊肉”（常见于受法语或加勒比文化影响的用法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a young goat; a kid.","zh":"小山羊；幼山羊（kid）。"},"examples":[{"en":"The farmer carried the cabrit back to the pen.","zh":"农夫把小山羊抱回了围栏里。"},{"en":"In the spring, you may see cabrits following their mothers in the fields.","zh":"春天你可能会看到小山羊跟着母羊在田野里走。"}]},{"partOfSpeech":"n.","definition":{"en":"meat from a young goat, used as food (especially in Caribbean and French-influenced contexts).","zh":"小山羊肉（常见于加勒比地区或受法语影响的语境中，作为食材）。"},"examples":[{"en":"They served cabrit stew with rice and beans.","zh":"他们端上了小山羊肉炖菜，配米饭和豆子。"},{"en":"The menu listed cabrit as a specialty of the house.","zh":"菜单上把小山羊肉列为本店特色菜。"}]}],"synonyms":["kid","young goat","goat (meat)"],"phonetic":"/kəˈbriː/","extraExplanation":["“cabrit”源自法语（与“cabri”同源），在英语里属于较少见、带地域色彩的词。你更常见到的普通英语说法是“kid”（小山羊）或“goat meat”（羊肉/山羊肉）。","在一些法语影响较深的地区（如加勒比海部分地区、路易斯安那的部分语境），“cabrit”既可指小山羊，也可指用小山羊做的菜肴。阅读或点餐时看到它，多半是在这种文化背景下。"]}
{"word":"cabrito","summary":{"en":"Cabrito means a young goat, and it can also refer to a popular dish made from young goat meat in Mexican/Tex-Mex cuisine.","zh":"cabrito 指“小山羊”，也常指墨西哥/美墨料理中用幼山羊肉做的特色菜（多为烤制）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a young goat; a kid.","zh":"小山羊；羊羔（尤指山羊幼崽）。"},"examples":[{"en":"The farmer showed the children a cabrito and its mother.","zh":"农夫给孩子们看了一只小山羊和它的妈妈。"},{"en":"In rural areas, people may raise cabritos for milk and meat.","zh":"在一些乡村地区，人们可能会养小山羊，用来产奶和取肉。"}]},{"partOfSpeech":"n.","definition":{"en":"a dish made from young goat meat, especially in Mexican and Tex-Mex cooking (often roasted or grilled).","zh":"“烤/炙小山羊”这道菜；指用幼山羊肉做的菜，常见于墨西哥与美墨（Tex-Mex）料理（多为烤制或炙烤）。"},"examples":[{"en":"We ordered cabrito for dinner, roasted with garlic and lime.","zh":"我们晚餐点了烤小山羊，配大蒜和青柠烤制。"},{"en":"Cabrito is a specialty in northern Mexico.","zh":"烤小山羊是墨西哥北部的特色菜。"},{"en":"The restaurant serves cabrito on weekends only.","zh":"那家餐馆只在周末供应烤小山羊。"}]}],"synonyms":["kid (young goat)","young goat","goat (meat)","roast goat"],"phonetic":"/kəˈbriːtoʊ/","extraExplanation":["“cabrito”原本是西班牙语，进入英语后多用于餐饮语境（菜单、旅行、美食文章）。在美国英语里常见于与墨西哥菜相关的地区（如德州、加州等）。","文化小提示：在不同地区，“cabrito”做法会有差异；有的偏重慢烤（roasted），有的偏炭火炙烤（grilled）。点餐时如果在意口感，可以问清楚做法与熟度。"]}
{"word":"CABS","summary":{"en":"“CABS/cabs” usually means multiple taxis; it can also mean multiple vehicle driver compartments (truck cabs).","zh":"“CABS/cabs”通常指多辆出租车；也可指多辆车辆的驾驶室（如卡车驾驶室）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"taxis; cars you pay to take you somewhere (plural of “cab”).","zh":"出租车；你付费乘坐前往某地的车（“cab”的复数）。"},"examples":[{"en":"There were no cabs available because it was raining.","zh":"因为下雨，没有出租车可用。"},{"en":"We took cabs from the airport to the hotel.","zh":"我们从机场打车去酒店。"}]},{"partOfSpeech":"n.","definition":{"en":"the driver’s compartment in a truck, tractor, or other large vehicle (plural of “cab”).","zh":"（卡车、拖拉机等大型车辆的）驾驶室（“cab”的复数）。"},"examples":[{"en":"The trucks have larger cabs for long-distance drivers.","zh":"这些卡车的驾驶室更大，适合长途司机。"},{"en":"The company replaced the old cabs with safer, newer ones.","zh":"公司把旧驾驶室换成了更安全的新款。"}]}],"synonyms":["taxis","taxicabs"],"phonetic":"/kæbz/","extraExplanation":["“cabs”通常是普通名词“cab”的复数：在美式英语里最常指“出租车”。如果写成全大写“CABS”，在某些场合也可能是缩写（不同领域含义不同），需要结合上下文判断。"]}
{"word":"cabs","summary":{"en":"“Cabs” most commonly means taxis; it can also mean driver compartments in trucks/buses/trains.","zh":"“cabs”最常指“出租车”；也可指卡车/公交车/火车的“驾驶室”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of cab: a taxi (a car you pay to take you somewhere).","zh":"cab 的复数：出租车（付费载你到目的地的汽车）。"},"examples":[{"en":"We couldn’t find any cabs after the concert.","zh":"演唱会结束后我们找不到任何出租车。"},{"en":"Let’s call for a cab—there are no cabs on this street.","zh":"我们叫一辆出租车吧——这条街上没有出租车。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of cab: the driver’s compartment of a truck, bus, or train.","zh":"cab 的复数：（卡车/公交车/火车的）驾驶室、司机舱。"},"examples":[{"en":"The trucks’ cabs stayed warm even in winter.","zh":"这些卡车的驾驶室即使在冬天也很暖和。"},{"en":"Workers checked the cabs before the buses went out.","zh":"公交车出发前，工作人员检查了驾驶室。"}]}],"synonyms":["taxis","taxicabs","rides (context-dependent)"],"phonetic":"/kæbz/","extraExplanation":["在美式英语里，cab 常见于口语，意思是“出租车”，和 taxi 基本同义；在英式英语中也常用。如今也常说 ride (a rideshare)（网约车），但 cabs 更偏“传统出租车”。","cab 还可以指大型车辆的“驾驶室”。这个意思在交通/物流语境里很常见，比如 truck cab（卡车驾驶室）。"]}
{"word":"cabstand","summary":{"en":"“Cab stand” means the place where taxis wait for passengers.","zh":"“Cab stand”指出租车等待乘客的固定地点（出租车候客点）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place where taxis wait for passengers; a taxi stand (taxi rank)","zh":"（出租车）候客点；出租车站（英式常说 taxi rank）"},"examples":[{"en":"Let’s meet at the cab stand outside the station.","zh":"我们在车站外的出租车候客点见。"},{"en":"There’s usually a long line at the cab stand after the concert.","zh":"音乐会结束后，出租车站通常会排很长的队。"}]}],"synonyms":["taxi stand","taxi rank"],"phonetic":"/kæb stænd/","extraExplanation":["“Cab stand”在北美很常见；在英国更常说“taxi rank”。日常也会看到路牌写“Taxi Stand”。如果你输入的“cabstand”是把两个词连写了，标准拼写一般是分开写：cab stand。"]}
{"word":"cabstands","summary":{"en":"Cabstands are designated places where taxis wait for passengers.","zh":"cabstands 指出租车集中等候乘客的指定地点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Places where taxis wait for passengers; official taxi waiting areas (also called a taxi stand or taxi rank).","zh":"出租车候客点；出租车专用等候区（也可说 taxi stand / taxi rank）。"},"examples":[{"en":"You can usually find a taxi at the cabstand outside the train station.","zh":"火车站外的出租车候客点通常能找到出租车。"},{"en":"The hotel staff pointed us to the nearest cabstand.","zh":"酒店工作人员指给我们最近的出租车候客点。"}]}],"synonyms":["taxi stand","taxi rank","cab stand"],"phonetic":"/ˈkæbˌstænd/","extraExplanation":["“cabstand(s)”是“cabstand”的复数形式；更常见的写法是两个词的“cab stand(s)”。","在美式英语里更常说“taxi stand”；在英式英语里常用“taxi rank”。","“cab”是“taxicab”的口语缩写，因此“cabstand”在口语或旧式写法中更容易见到。"]}
{"word":"cabuja","summary":{"en":"Cabuja is agave fiber (or rope made from it), commonly used in Latin America.","zh":"Cabuja指龙舌兰纤维或其制成的绳索，在拉丁美洲较常见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong fiber or rope made from the agave (maguey) plant, used especially in parts of Latin America for tying, weaving, and making sacks or hammocks.","zh":"（拉丁美洲部分地区常用的）龙舌兰（maguey）纤维或由其制成的绳索，用于捆绑、编织、制作麻袋或吊床等。"},"examples":[{"en":"They tied the bundle with cabuja rope so it wouldn’t come loose on the road.","zh":"他们用cabuja绳把包裹捆起来，免得在路上散开。"},{"en":"In some rural markets, you can still find bags woven from cabuja fiber.","zh":"在一些乡村集市上，你仍然能看到用cabuja纤维编织的袋子。"}]}],"synonyms":["cabuya","agave fiber","maguey fiber","agave rope"],"phonetic":"/kɑˈbuːhɑ/","extraExplanation":["“cabuja”多见于西班牙语语境中的外来词用法，常被当作“cabuya”的变体拼写；在安第斯地区（如厄瓜多尔等地）尤其常见，既可指龙舌兰纤维，也可指由其搓成的绳。","发音在英语里通常是对西班牙语读音的近似；不同地区/说话者可能把词尾读成 -ha 或 -ya 的感觉。","与之相关但不完全等同的词有“sisal（剑麻纤维）”；两者都可做绳索和麻织品，但来源植物不同。"]}
{"word":"cabulla","summary":{"en":"Cabulla is a Latin-American term for a strong plant fiber (or rope/cord made from it) used for sacks, twine, and tying things.","zh":"Cabulla 指一种拉丁美洲常见的植物粗纤维（或其制成的绳索/麻绳），常用于麻袋、捆扎线和系绑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong natural fiber (or cord made from it), traditionally produced in parts of Latin America from agave/fique plants and used for rope, sacks, and twine","zh":"（拉丁美洲常见的）一种天然粗纤维或由其制成的绳索/麻绳，传统上取自龙舌兰/菲克（fique）等植物，用于制绳、麻袋和捆扎线"},"examples":[{"en":"The coffee beans were packed in cabulla sacks for transport.","zh":"咖啡豆被装在 cabulla 麻袋里运输。"},{"en":"He tied the bundle with a piece of cabulla cord.","zh":"他用一段 cabulla 麻绳把那捆东西系好。"}]}],"synonyms":["fique fiber","cabuya fiber","twine","cord"],"phonetic":"/kəˈbuːlə/","extraExplanation":["“Cabulla”多见于拉丁美洲语境（尤其与农产品包装、绳索材料有关），在英语里通常作为外来词使用，含义接近 cabuya / fique fiber（菲克纤维）。","它与当地农业和贸易关系密切：麻袋、捆扎绳等传统用品常用这种纤维制作。不同国家/地区的拼写与指代植物可能略有差异。"]}
{"word":"cabureiba","summary":{"en":"Cabureiba is a regional South American name for an aromatic timber/resin tree, often referring to cabreúva (Myrocarpus).","zh":"Cabureiba 是南美地区对一种芳香木材/树脂树的地方称呼，常指 cabreúva（Myrocarpus 属）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South American, regional) a type of tree known for aromatic wood and resin; often used as a local name for cabreúva (genus Myrocarpus).","zh":"（南美地区用语）一种以芳香木材和树脂著称的树；常作为“cabreúva（香木/卡布雷乌瓦树，Myrocarpus属）”的地方俗称。"},"examples":[{"en":"In some Brazilian regions, cabureiba is valued for its fragrant wood.","zh":"在巴西的一些地区，cabureiba 因为木材有香味而受到重视。"},{"en":"The carpenter said the cabinet was made from cabureiba wood.","zh":"木匠说这个柜子是用 cabureiba 木材做的。"}]}],"synonyms":["cabreúva","Myrocarpus","aromatic timber tree"],"phonetic":"/ˌkɑːbuːˈreɪbə/","extraExplanation":["“cabureiba”并不是标准英语里的常见词，更像是葡萄牙语/西语背景的外来词或地方名称，常见拼写可能包括 *cabreúva / cabureyba / cabureiba* 等。","在不同地区它可能指向相近的树种（常被归到 Myrocarpus 属相关树木）。如果你是从某篇文章、标签或地图上看到的，建议提供上下文或所在地（国家/地区），我可以帮你更准确地对应具体物种或标准拼写。"]}
{"word":"caburn","summary":{"en":"“Caburn” is not a standard English word; it’s likely a typo or a proper name. Context is needed to identify the intended word.","zh":"“caburn”不是标准英语词；更可能是拼写错误或专有名词，需要上下文来判断你原本想表达的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it is likely a misspelling or a proper name (e.g., a surname). If you meant another word, please share the sentence/context.","zh":"不是常见英语词典里的标准单词；更可能是拼写错误或专有名词（如姓氏）。如果你想查的是别的词，请提供句子或上下文。"},"examples":[{"en":"I can’t find “caburn” as a common English word—could you paste the sentence where you saw it?","zh":"我查不到“caburn”作为常见英文单词——你能把看到它的句子贴出来吗？"},{"en":"Did you mean “coburn” (a surname) or “carbon” (an element)?","zh":"你是想写“coburn”（一个姓氏）还是“carbon”（化学元素“碳”）吗？"}]}],"phonetic":"/kəˈbɝn/","extraExplanation":["“caburn”很可能是输入时把相近词打错了。最常见的可能包括：\n1) carbon（碳）：与科学/环保/化学语境有关；\n2) cab + burn（口语拆分）：比如“把出租车烧了”之类的非常不常见组合；\n3) Coburn（科本/科伯恩）：英语姓氏（如演员 James Coburn）。\n如果你把原句发来，我可以根据语境判断最可能的正确词并详细解释。"]}
{"word":"cabuya","summary":{"en":"Cabuya is a tough natural fiber (or the plant that produces it), used especially in the Andes for making rope and woven goods.","zh":"cabuya 指一种坚韧的天然植物纤维（也可指产这种纤维的植物），在安第斯地区常用于制作绳索与编织品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong fiber obtained from certain agave-like plants (especially in the Andes), used to make rope, twine, sacks, and similar goods","zh":"（尤指安第斯地区某些类龙舌兰植物的）卡布亚纤维；一种坚韧的植物纤维，用于制作绳索、麻线、麻袋等"},"examples":[{"en":"The farmers tied the bundles with cabuya rope.","zh":"农民用卡布亚纤维绳把成捆的东西绑起来。"},{"en":"Bags woven from cabuya fiber are common in some Andean markets.","zh":"在一些安第斯地区的集市上，用卡布亚纤维编织的袋子很常见。"}]},{"partOfSpeech":"n.","definition":{"en":"the agave-like plant that produces cabuya fiber","zh":"产卡布亚纤维的类龙舌兰植物"},"examples":[{"en":"Cabuya grows well on dry hillsides.","zh":"卡布亚植物在干燥的山坡上长得很好。"}]}],"synonyms":["sisal","agave fiber","maguey fiber"],"phonetic":"/kəˈbuːjə/","extraExplanation":["“cabuya”是从西班牙语借入英语的词，在厄瓜多尔、哥伦比亚等安第斯地区较常见；在当地既可指植物本身，也可指从叶片提取的纤维。","在日常语境里它常被拿来与“sisal（剑麻纤维）”“maguey fiber（龙舌兰纤维）”类比理解：都是耐用的天然硬质纤维，可用于绳索和编织品。"]}
{"word":"cabuyas","summary":{"en":"“Cabuyas” usually refers to ropes/cords made from cabuya (agave-type plant fiber); it’s a Spanish plural used in some regional contexts.","zh":"“cabuyas”通常指用cabuya（多为龙舌兰类植物纤维）做成的绳索；这是一个西语复数形式，常见于特定地区语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Ropes or cords made from cabuya (a strong plant fiber, often from agave), used for tying, carrying, or simple construction. (Spanish plural of “cabuya.”)","zh":"用“cabuya”（一种结实的植物纤维，常来自龙舌兰类植物）制成的绳索或线绳，用于捆绑、搬运或简易搭建。（西语“cabuya”的复数）"},"examples":[{"en":"They tied the bundles with cabuyas before loading the truck.","zh":"他们用cabuyas把包裹捆好再装上卡车。"},{"en":"In the market, you can still find handmade cabuyas for farm work.","zh":"在集市上你仍能买到手工做的cabuyas，用于农活。"}]}],"synonyms":["cabuya rope","agave-fiber rope","sisal rope"],"phonetic":"/kəˈbuːjəz/","extraExplanation":["“cabuyas”并不是常见英语词，更多见于西班牙语语境（尤其是安第斯地区等地）。在英文材料里出现时，通常保留原词，指用龙舌兰/类似植物纤维搓成的粗绳。","相关词：cabuya（纤维/绳）、sisal（剑麻纤维，英语更常用）、agave fiber（龙舌兰纤维）。"]}

