{"word":"CAC","summary":{"en":"CAC is an acronym most commonly meaning Customer Acquisition Cost; in U.S. military contexts it often means Common Access Card.","zh":"CAC 是缩写，最常见指“客户获取成本”；在美国军方语境中也常指“通用门禁卡”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Customer Acquisition Cost: the amount of money a business spends, on average, to gain one new customer (often used in marketing and startups).","zh":"客户获取成本：企业平均为获得一位新客户所花费的费用（常用于市场营销与创业/增长分析）。"},"examples":[{"en":"Our CAC dropped after we improved the website’s sign-up flow.","zh":"我们优化了网站注册流程后，CAC 降低了。"},{"en":"If CAC is higher than the customer’s lifetime value, the business model may not work.","zh":"如果 CAC 高于客户终身价值，这个商业模式可能不可持续。"}]},{"partOfSpeech":"other","definition":{"en":"Common Access Card: an identification card used by the U.S. Department of Defense for secure access to facilities and computer systems.","zh":"通用门禁卡（CAC）：美国国防部使用的身份证件，用于进入设施及访问计算机系统。"},"examples":[{"en":"You need your CAC to enter the base.","zh":"进入基地需要你的 CAC。"},{"en":"I can’t log in—the system isn’t reading my CAC.","zh":"我登不进去——系统读不到我的 CAC。"}]},{"partOfSpeech":"other","definition":{"en":"Capital Allowance Charge (finance/accounting): a charge used in some pricing or investment analyses to reflect the cost of using capital.","zh":"资本津贴费用/资本占用费用（金融/会计）：在某些定价或投资分析中，用来体现资本使用成本的费用。"},"examples":[{"en":"The report includes a CAC to account for the cost of capital.","zh":"报告加入了 CAC，用于反映资本成本。"}]}],"synonyms":["customer acquisition cost (for meaning 1)","Common Access Card (for meaning 2)"],"phonetic":"/ˌsiː.eɪˈsiː/","extraExplanation":["“CAC”是缩写，具体含义强烈依赖领域与语境。商业对话里最常见的是 Customer Acquisition Cost；在美军/政府相关语境里常指 Common Access Card。阅读邮件、报告或聊天记录时，可以从附近词判断：marketing、ads、LTV 往往对应“获客成本”；base、DoD、badge、login 往往对应“门禁卡”。"]}
{"word":"cac","summary":{"en":"CAC usually means customer acquisition cost—the average cost to get one new customer.","zh":"CAC 通常指客户获取成本：获得一位新客户的平均成本。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abbreviation for customer acquisition cost: the average amount of money a business spends to gain one new customer (often used in marketing and startups).","zh":"“客户获取成本”的缩写：企业为获得一位新客户平均需要花费的成本（常用于市场营销与创业公司语境）。"},"examples":[{"en":"Our CAC went up after we increased ad spending.","zh":"我们增加广告投放后，CAC 上升了。"},{"en":"If your CAC is higher than the customer’s lifetime value, the business may not be sustainable.","zh":"如果 CAC 高于客户终身价值（LTV），这个生意可能难以持续。"},{"en":"They track CAC by channel—search ads, social media, and referrals.","zh":"他们按渠道追踪 CAC——搜索广告、社交媒体和转介绍。"}]}],"synonyms":["customer acquisition cost","acquisition cost","CPA (cost per acquisition)"],"phonetic":"/ˌsiː.eɪˈsiː/","extraExplanation":["常见计算方式（简化）：CAC =（某段时间的销售+营销总成本）÷（同期获得的新客户数）。不同公司会把“销售人力、工具订阅费、内容制作费”等是否算进去，口径可能不同。","经常和 LTV（Customer Lifetime Value，客户终身价值）一起看：如果 LTV 明显大于 CAC，通常代表获客更健康。","在口语/会议里常读作字母：C-A-C（see-ay-see）。"]}
{"word":"Caca","summary":{"en":"Caca is an informal, childish word for feces (poop), and sometimes a slang insult meaning something is bad.","zh":"Caca 是“便便/大便”的儿童口语，也可用来吐槽某物很烂（非正式）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, childish) Feces; poop. Also used to mean something unpleasant or of poor quality (“crap”).","zh":"（非正式、儿童用语）大便；便便。也可引申为“很糟的东西/废话”（类似“crap”）。"},"examples":[{"en":"The little kid said he needed to go caca.","zh":"小孩子说他要去便便。"},{"en":"This movie is caca—let’s watch something else.","zh":"这部电影太烂了——我们换一个看吧。"}]}],"synonyms":["poop","pee-poo (childish)","crap (slang)","feces (formal)"],"phonetic":"/ˈkɑkɑ/","extraExplanation":["“caca”在英语里多见于儿童语言或家庭口语，语气比“shit”更轻，但在正式场合仍不合适。","在法语里“caca”也常指“便便”（偏儿童用语）；在一些西语环境里也可能被理解为类似含义，因此跨文化交流时要注意场合与听众。"]}
{"word":"caca","summary":{"en":"“Caca” is an informal word meaning “poop,” and sometimes “something bad or nonsense.”","zh":"“caca”是非正式用词，常指“便便/粪便”，有时也指“很烂的东西/胡扯”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, childish or vulgar) feces; poop.","zh":"（俚语、儿童用语或粗俗）粪便；便便。"},"examples":[{"en":"The toddler said, “I need to do caca.”","zh":"小宝宝说：“我想拉便便（caca）。”"},{"en":"Please don’t use words like “caca” at the dinner table.","zh":"吃饭时请不要用“caca”这种词。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, mainly spoken) something bad, silly, or worthless; “nonsense.”","zh":"（非正式，多用于口语）很差的东西；蠢话；“胡扯”。"},"examples":[{"en":"That rumor is total caca.","zh":"那个传闻完全是胡扯。"},{"en":"Stop talking caca and focus on the facts.","zh":"别胡说八道了，专注事实。"}]}],"synonyms":["poop","feces","crap","nonsense","garbage"],"phonetic":"/ˈkɑkɑ/","extraExplanation":["“caca”来自法语（也常见于西语口语环境），意思是“便便”。在英语里它多带有儿童用语或粗俗/不雅的感觉，正式场合建议用更中性的词：poop（口语）、feces（较正式/医学）、stool（医学/委婉）。","在一些英语国家或地区，“caca”也可被用来表示“很烂/很糟/胡扯”，但语气偏随意，可能显得不礼貌。"]}
{"word":"cacaesthesia","summary":{"en":"Cacaesthesia means an abnormal, unpleasant sensation, often a distorted sense of smell where things seem to stink.","zh":"Cacaesthesia 指令人不快的异常感觉，常指嗅觉扭曲，把气味闻成臭味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical term for an unpleasant, abnormal sensation—especially a distorted sense of smell in which odors seem foul (also spelled cacesthesia).","zh":"医学用语：令人不快的异常感觉；尤指嗅觉扭曲，把气味闻成恶臭（也写作 cacesthesia）。"},"examples":[{"en":"After the infection, she experienced cacaesthesia and said even clean air smelled rotten.","zh":"感染之后，她出现了 cacaesthesia，甚至觉得干净的空气也像腐臭味。"},{"en":"The doctor noted cacaesthesia as one possible symptom of a nerve-related problem.","zh":"医生记录了 cacaesthesia，认为这可能是神经相关问题的一个症状。"}]}],"synonyms":["cacesthesia","parosmia (related)","distorted smell (plain English)"],"phonetic":"/ˌkækəsˈθiːʒə/","extraExplanation":["词源上由前缀 caca-/cac-（表示“坏、恶臭”）+ aesthesia（“感觉”）组成，直观表达“糟糕的感觉”。","这是较少见的医学词，更常见的相关表达包括：parosmia（嗅觉扭曲）、phantosmia（幻嗅）。"]}
{"word":"cacafuego","summary":{"en":"Cacafuego is best known as the nickname of a Spanish treasure galleon captured by Francis Drake; it can also mean a boastful braggart (slang).","zh":"Cacafuego 最常指德雷克俘获的西班牙宝船绰号；也可作俚语指爱吹嘘的夸夸其谈者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A famous Spanish treasure galleon, Nuestra Señora de la Concepción, nicknamed “Cacafuego,” captured by Sir Francis Drake in 1579.","zh":"（历史）著名的西班牙宝船“康塞普西翁号”（Nuestra Señora de la Concepción）的绰号“Cacafuego”，1579年被英国航海家弗朗西斯·德雷克（Francis Drake）俘获。"},"examples":[{"en":"In many accounts of Drake’s voyage, the capture of the Cacafuego is a key moment.","zh":"在许多关于德雷克航行的记述中，俘获“Cacafuego”是一个关键情节。"},{"en":"The museum display explains how the galleon called Cacafuego carried silver and gold along the Pacific coast.","zh":"博物馆展览说明了这艘被称为“Cacafuego”的大帆船如何沿太平洋海岸运送金银。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang, often humorous or insulting, chiefly British) A boastful, showy person; a loud braggart.","zh":"（俚语，常带调侃或侮辱色彩，主要英式）爱吹嘘、爱摆架子的人；大话精。"},"examples":[{"en":"He talks big, but he’s just a cacafuego when it’s time to do the work.","zh":"他嘴上说得很厉害，但真要干活时不过是个爱吹的家伙。"},{"en":"Don’t be such a cacafuego—let your results speak for you.","zh":"别那么爱显摆——让成果替你说话。"}]}],"synonyms":["braggart","boaster","windbag"],"phonetic":"/ˌkɑkəˈfweɪɡoʊ/","extraExplanation":["“Cacafuego”来自西班牙语的外号，字面上带有粗俗的“粪火/屎火”意味，因此在英语里偶尔被借用来骂人或讽刺某人虚张声势。","在历史语境中它最常指德雷克在1579年俘获的那艘西班牙宝船（本名“康塞普西翁号”）。在普通英语对话里非常少见，使用时要注意语域和礼貌。"]}
{"word":"cacafugo","summary":{"en":"“Cacafugo” isn’t recognized as a standard English word; context is needed to identify what it means or what word was intended.","zh":"“cacafugo”不是常见/标准英语词；需要上下文才能判断它的真实含义或你本来想写的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it may be a misspelling, a name, or a word from another language.","zh":"不是标准英语单词；可能是拼写错误、人名/昵称，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “cacafugo” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里找不到“cacafugo”——你能把它出现的句子发我看看吗？"},{"en":"If you meant “cacophony,” it describes a loud, harsh mix of sounds.","zh":"如果你想写的是“cacophony（嘈杂刺耳的声音混合）”，它表示一堆吵闹、刺耳的声音。"}]}],"phonetic":"/ˌkɑːkəˈfuːɡoʊ/","extraExplanation":["“cacafugo”很可能是拼写误差。常见的近似英文词包括：\n1) cacophony（嘈杂刺耳的声音混杂）；\n2) catafalque（灵柩台，较少见）。\n如果你告诉我它出现的语境（句子/截图/是哪种语言或游戏、小说、人名），我可以更准确判断。","也可能接近西班牙语/意大利语的形式（例如某些昵称、方言或专有名词），但在英语里不作为常用词条。"]}
{"word":"cacahuatl","summary":{"en":"Cacahuatl is a Nahuatl term meaning a traditional cacao drink—literally “cacao water.”","zh":"Cacahuatl 是纳瓦特尔语词，指传统的可可饮品，字面为“可可水”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditional Nahuatl (Aztec) word referring to a cacao-based drink, literally “cacao water.”","zh":"（纳瓦特尔语/阿兹特克）一种以可可为主的传统饮品，字面意思是“可可水”。"},"examples":[{"en":"Some historians describe cacahuatl as an early cacao drink enjoyed in Mesoamerica.","zh":"一些历史学者把 cacahuatl 描述为中美洲早期人们饮用的可可饮品。"},{"en":"In modern writing, cacahuatl is sometimes mentioned alongside xocolatl when discussing the origins of chocolate.","zh":"在现代写作中，谈到巧克力的起源时，cacahuatl 有时会和 xocolatl 一起被提到。"}]}],"synonyms":["cacao drink","cacao beverage","chocolate drink (historical context)","xocolatl (related Nahuatl term)"],"phonetic":"/ˌkɑːkəˈwɑːtəl/","extraExplanation":["cacahuatl 来自纳瓦特尔语：cacahuatl 常被分析为 cacahuatl（可可/可可豆相关词根）+ atl（“水”）。因此它强调的是“可可饮品”的概念，而不一定等同于今天加糖加奶的热巧克力。","英文中更常见的相关借词是 xocolatl（常被解释为“苦水/苦饮”）以及 cacao / chocolate；cacahuatl 属于更偏历史或学术讨论时会出现的拼写与用词。"]}
{"word":"Cacajao","summary":{"en":"Cacajao is the scientific genus name for uakari monkeys from the Amazon rainforest.","zh":"Cacajao 是亚马逊雨林 uakari（秃猴/僧面猴）的科学属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of South American monkeys called uakaris, known for their short tails and (in some species) a bright red, nearly hairless face; they live mainly in the Amazon rainforest.","zh":"一种南美洲的猴类属名（秃猴属/僧面猴属），英文常称 uakari；特点是尾巴较短，部分种类脸部几乎无毛且呈鲜红色，主要栖息在亚马逊雨林。"},"examples":[{"en":"The genus Cacajao includes several species of uakaris found in the Amazon basin.","zh":"Cacajao（秃猴属）包括数种生活在亚马逊流域的 uakari（秃猴/僧面猴）。"},{"en":"Researchers study Cacajao to understand how rainforest primates adapt to seasonal flooding.","zh":"研究人员研究 Cacajao（秃猴属），以了解雨林灵长类如何适应季节性洪水。"}]}],"synonyms":["uakari","bald uakari"],"phonetic":"/ˌkækəˈdʒaʊ/","extraExplanation":["Cacajao 是动物分类学里的拉丁化属名（Genus）。在英语科普中更常见的日常名称是 uakari（常译“秃猴/僧面猴”），其中最有名的是 bald uakari（红脸秃猴）。","属名的读法在不同资料中可能略有差异；作为学名，常按英语习惯重读最后一部分：ca-ca-JOW。"]}
{"word":"cacajao","summary":{"en":"Cacajao is the scientific genus name for uakari monkeys from the Amazon.","zh":"Cacajao 是亚马逊地区乌卡里猴（秃尾猴）的科学属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of South American monkeys (uakaris) found mainly in the Amazon rainforest, known for a very short tail and, in some species, a bright red face","zh":"一种南美洲猴类属（秃尾猴属/乌卡里猴属），主要分布在亚马逊雨林，以尾巴很短、部分物种有鲜红色面部而闻名"},"examples":[{"en":"The red-faced uakari belongs to the genus Cacajao.","zh":"红脸秃尾猴（乌卡里猴）属于秃尾猴属（Cacajao）。"},{"en":"Researchers study Cacajao to understand how primates adapt to flooded forests.","zh":"研究人员研究秃尾猴属（Cacajao），以了解灵长类如何适应季节性淹水的森林。"}]}],"synonyms":["uakari","uacari"],"phonetic":"/ˌkɑːkəˈʒaʊ/","extraExplanation":["“Cacajao”是动物学中的拉丁化属名（genus name），在科普或学术语境里更常见；日常英语里人们通常直接说“uakari / uacari（乌卡里猴/秃尾猴）”。","这些猴子主要生活在亚马逊流域的雨林与季节性淹水林（flooded forests）中；“红脸”常被用作健康与寄生虫负担的视觉线索之一（在科普文章中会提到）。"]}
{"word":"Cacak","summary":{"en":"Čačak (Cacak) is a city in central Serbia.","zh":"Čačak（Cacak）是塞尔维亚中部的一座城市。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A city in central Serbia (often written as Čačak), known as a regional cultural and economic center.","zh":"塞尔维亚中部的一座城市（常写作 Čačak，带变音符号），是当地重要的文化与经济中心。"},"examples":[{"en":"Čačak is located in central Serbia, not far from the Morava River valley.","zh":"Čačak 位于塞尔维亚中部，靠近莫拉瓦河谷。"},{"en":"She traveled from Belgrade to Čačak by bus.","zh":"她从贝尔格莱德坐大巴去了 Čačak。"}]}],"phonetic":"/ˈtʃɑtʃɑk/","extraExplanation":["英文里你可能会看到两种拼法：Cacak 与 Čačak。后者是塞尔维亚语（拉丁字母）更标准的写法，其中“Č/č”发音类似英语的“ch”（如 chair）。因此在不方便输入变音符号时，常用 Cacak 代替。","作为地名，它通常不需要冠词：说“in Čačak”“from Čačak”，而不是“in the Čačak”。"]}
{"word":"Cacalia","summary":{"en":"Cacalia is an older botanical genus name; many plants once placed in it have been reclassified.","zh":"Cacalia 是一个较旧的植物属名；许多原属该类的植物现已改归其他属。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant genus name (Cacalia) formerly used for certain flowering plants in the daisy family; in modern botany many species once placed in Cacalia have been reclassified into other genera.","zh":"植物属名“Cacalia”（旧分类用语），曾用于指菊科的一些开花植物；现代植物分类中，许多原归入 Cacalia 的物种已被重新划入其他属。"},"examples":[{"en":"In older field guides, you may see the name Cacalia for plants that are now listed under different genera.","zh":"在较早的野外植物图鉴里，你可能会看到用 Cacalia 来指称一些如今被归到其他属的植物。"},{"en":"The herbarium label recorded the specimen as Cacalia, reflecting the taxonomy used at the time.","zh":"标本馆标签把该标本记为 Cacalia，反映了当时采用的分类体系。"}]}],"synonyms":["a former genus name","an obsolete taxonomic name"],"phonetic":"/kəˈkeɪliə/","extraExplanation":["“Cacalia”主要出现在植物学文献、标本标签或较旧的分类资料中。日常英语里很少用到；更多是作为拉丁化的学名（属名）出现，通常需要结合具体物种与地区才能确定指的是哪一类植物。","发音在英语里常按拉丁学名的英语读法处理；不同学者或地区可能略有差异。","词源来自古典用语（拉丁/希腊传统的植物命名），但由于现代分类学的修订，实际使用时常会看到“formerly Cacalia（旧称 Cacalia）”之类的注记。"]}
{"word":"cacalia","summary":{"en":"Cacalia is an older botanical name for certain daisy-family plants; many have been reclassified under other genera today.","zh":"Cacalia 是旧时对某些菊科植物的分类名称；如今许多已被重新划入其他属。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant in the daisy family (Asteraceae), formerly placed in the genus *Cacalia*; in modern botany many of these plants have been reclassified into other genera (for example, *Senecio*).","zh":"（植物）菊科植物，旧时曾归入“Cacalia（卡卡利亚属）”；现代分类中其中许多已被重新划入其他属（如 *Senecio* 千里光属）。"},"examples":[{"en":"The herbarium label lists the specimen as *Cacalia*, an older name used in historical plant records.","zh":"标本馆标签把这株植物写作 *Cacalia*，这是历史植物记录中常见的旧名称。"},{"en":"Some species once called cacalia are now classified under different genera.","zh":"一些曾被称为 cacalia 的物种，如今已被划入不同的属。"}]}],"synonyms":["(historical) Cacalia (genus name)","(modern reclassification varies) Senecio (for some species)"],"phonetic":"/kəˈkeɪliə/","extraExplanation":["“Cacalia”主要出现在较早的植物学文献、旧标本标签和历史记录中。因为分类学不断更新（依据形态与DNA证据等），许多原先归入该属的物种后来被拆分并移到其他属，所以在现代常用植物志里你不一定能直接找到“Cacalia属”。","作为普通词汇它并不常用，更多是学术/历史语境下的拉丁化植物名；书写时通常首字母大写并斜体（*Cacalia*）。"]}
{"word":"cacam","summary":{"en":"“cacam” is not a standard English word; it’s likely a misspelling or a proper name. Provide context to identify the intended word.","zh":"“cacam”不是标准英语单词；可能是拼写错误或专有名词。提供上下文可帮助确认你真正想表达的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling, a username/proper name, or a word from another language.","zh":"不是标准英语单词。更可能是拼写错误、用户名/专有名词，或来自其他语言的词。"},"examples":[{"en":"I can’t find “cacam” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里查不到“cacam”——你能把看到它的句子发出来吗？"},{"en":"If you meant “cacao,” it refers to the plant/beans used to make chocolate.","zh":"如果你想写的是“cacao”，它指可可（制作巧克力的植物/可可豆）。"}]}],"phonetic":"/kəˈkæm/","extraExplanation":["“cacam”在英语里并不常见；为了更准确帮你，我需要你提供上下文（例如完整句子、你想表达的意思，或它出现在哪个网站/文章里）。","常见的可能目标词：\n- cacao（可可）\n- cam（摄像头；凸轮）\n- scam（诈骗）\n- cab（出租车）\n把你想表达的中文意思也发我，我可以帮你定位最可能的英文单词并讲解用法。"]}
{"word":"Cacan","summary":{"en":"“Cacan” is typically a proper name; it isn’t a standard English vocabulary word, so its meaning depends on context.","zh":"“Cacan”通常是专有名词；它不是标准英语词汇，具体含义取决于上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (usually a surname or place name). In English, “Cacan” is not a common dictionary word, so its meaning depends on the person or location it refers to.","zh":"专有名词（通常是姓氏或地名）。“Cacan”在英语里不是常见词典词汇，含义取决于它指代的具体人物或地点。"},"examples":[{"en":"Dr. Cacan will present the research findings today.","zh":"Cacan博士今天将展示研究成果。"},{"en":"I couldn’t find much information about Cacan online.","zh":"我在网上找不到太多关于Cacan的信息。"}]}],"phonetic":"/kəˈkæn/","extraExplanation":["“Cacan”更像是名字/姓氏或地名，而不是英语常用词。如果你是在某段文字里看到它，告诉我上下文（句子、国家/语言、是否是人名/地名），我可以更准确地解释。","它也可能是拼写误差（例如你想查的是别的词）。如果你提供正确拼写或相关句子，我可以一起比较并说明差异。"]}
{"word":"cacan","summary":{"en":"“Cacan/Cacán” usually refers to an extinct Indigenous language (and sometimes the related historical region) in northwestern Argentina.","zh":"“Cacan/Cacán”通常指阿根廷西北部的一种已灭绝的原住民语言（有时也指相关的历史地区/文化区域）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) An extinct Indigenous language once spoken in northwestern Argentina (often called Cacán or the Diaguita/Calchaquí language).","zh":"（专有名词）一种已灭绝的原住民语言，曾在阿根廷西北部使用（常写作 Cacán，也常被称为迪亚吉塔/卡尔查基语）。"},"examples":[{"en":"Some historical sources mention Cacan as the language of the Diaguita peoples.","zh":"一些历史资料提到，Cacan 曾是迪亚吉塔人使用的语言。"},{"en":"Researchers have limited written records to reconstruct Cacán vocabulary.","zh":"研究者可用来复原 Cacán 词汇的文字记录非常有限。"}]},{"partOfSpeech":"n.","definition":{"en":"(Proper noun, historical) A name used for a region/cultural area associated with the Diaguita peoples in northwestern Argentina.","zh":"（专有名词，历史用法）用于指与阿根廷西北部迪亚吉塔人相关的地区/文化区域的名称。"},"examples":[{"en":"The text refers to the Cacan area in a pre-colonial context.","zh":"这篇文章在前殖民背景下提到了 Cacan 地区。"}]}],"synonyms":["Cacán","Diaguita language","Calchaquí language"],"phonetic":"/kɑˈkɑn/","extraExplanation":["在英语里“cacan/Cacan”并不是常见日常词汇，多出现在历史、人类学、语言学语境中；写作时通常会首字母大写（Cacan），或用带重音符号的拼写“Cacán”。","如果你是想查日常英语单词，可能是拼写误差：例如 *cacao*（可可）或 *cocoon*（茧）。你可以告诉我你看到它的句子/出处，我能更准确判断。"]}
{"word":"Cacana","summary":{"en":"“Cacana” is usually a proper name or a non-standard spelling; in some contexts it refers to Cacán, an extinct indigenous language of northwestern Argentina.","zh":"“Cacana”通常是专有名词或非标准拼写；在某些语境中它指阿根廷西北部已灭绝的原住民语言 Cacán。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a proper name (surname/place name) or a non-standard spelling; not a common English vocabulary word.","zh":"专有名词（人名/地名）或非标准拼写；不是常见的英语词汇。"},"examples":[{"en":"I couldn’t find “Cacana” in an English dictionary—can you share the sentence you saw it in?","zh":"我在英文词典里找不到“Cacana”这个词——你能把它出现的句子发我吗？"},{"en":"Cacana may be a family name in some countries.","zh":"Cacana 在一些国家可能是姓氏。"}]},{"partOfSpeech":"n.","definition":{"en":"(sometimes capitalized) a variant spelling used to refer to Cacán, an extinct indigenous language of northwestern Argentina (also linked to the Diaguita–Calchaquí peoples).","zh":"（有时首字母大写）一种拼写变体，用来指阿根廷西北部已灭绝的原住民语言 Cacán（也与迪亚圭塔—卡尔查基人群有关）。"},"examples":[{"en":"Some historical sources mention Cacana/Cacán when discussing indigenous languages of the Andes region.","zh":"一些历史资料在讨论安第斯地区原住民语言时会提到 Cacana/Cacán。"},{"en":"The name appears in older texts with different spellings, including Cacán and Cacana.","zh":"这个名称在较早的文本里有不同拼写，包括 Cacán 和 Cacana。"}]}],"synonyms":["Cacán"],"phonetic":"/kəˈkɑːnə/","extraExplanation":["“Cacana”在现代英语里不算一个固定词条，更常见的是作为专名或转写（不同语言/资料的拼法不一致）。如果你告诉我它来自哪里（书名、网站、对话语境、是否有人名/地名首字母大写），我可以更准确判断是哪一种含义。"]}
{"word":"cacana","summary":{"en":"“Cacana” is not standard English; it’s likely a misspelling (often of “cabana” or “cancan”) or a name from another language.","zh":"“cacana”不是标准英语词；多半是拼写错误（常见可能是“cabana”或“cancan”）或其他语言中的名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; often a misspelling or a name from another language. In English contexts, people may have meant “cabana” (a small shelter by a pool/beach) or “cancan” (a lively French dance).","zh":"不是标准英语单词；常见于拼写错误或其他语言中的名字。在英语语境里，有时可能想写的是 “cabana”（泳池/海滩边的小棚屋）或 “cancan”（法国康康舞）。"},"examples":[{"en":"I couldn’t find “cacana” in an English dictionary—did you mean “cabana”?","zh":"我在英语词典里找不到 “cacana”——你是不是想写 “cabana”？"},{"en":"Some words online are names or misspellings, so it helps to check the context sentence.","zh":"网上有些词可能是人名/地名或拼写错误，所以最好看上下文句子来判断。"}]}],"phonetic":"/kəˈkɑːnə/","extraExplanation":["“cacana”在英语里不常见，也没有稳定的通用释义。你可以把它放进一句完整的句子里（或告诉我它出现在哪个场景/国家/语言），我就能更准确判断是什么意思。","如果你想表达“海滩/泳池边的小棚屋”，最常见的拼写是 cabana；如果你指的是法国舞蹈“康康舞”，常见拼写是 cancan。"]}
{"word":"cacanapa","summary":{"en":"“cacanapa” is not recognized as standard English; it likely depends on context (name, misspelling, or another language).","zh":"“cacanapa”不是标准英语词；其含义高度依赖语境（可能是名字、拼写错误或外语词）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling, a name (proper noun), or a word from another language/dialect used in a specific community or text.","zh":"不是标准英语词；很可能是拼写错误、专有名词（人名/地名），或来自其他语言/方言、只在特定语境中使用的词。"},"examples":[{"en":"I can’t find “cacanapa” in standard English dictionaries—could it be a name or a local word?","zh":"我在标准英语词典里找不到“cacanapa”——它会不会是名字或地方用语？"},{"en":"If you share the sentence where you saw “cacanapa,” I can help guess the meaning from context.","zh":"如果你把看到“cacanapa”的句子发给我，我可以根据上下文帮你推测意思。"}]}],"phonetic":"/ˌkɑːkəˈnɑːpə/","extraExplanation":["“cacanapa”看起来不像常见英语词汇，可能有几种情况：\n1) 拼写误差：请确认是否想写的是另一个词（例如某个更常见的英语词、或外来词）。\n2) 专有名词：可能是人名、地名、品牌名、网名等，通常不收录在通用词典里。\n3) 他语借词/方言词：可能来自菲律宾语、西班牙语或其他语言的社区用法（需要具体语境判断）。\n\n建议你提供：出现的句子、所在国家/地区、相关主题（食物/植物/人名/地点等），我就能更准确地帮你查证或推断。"]}
{"word":"cacanthrax","summary":{"en":"Cacanthrax is a rare medical word for a very foul, severe ulcer or carbuncle.","zh":"Cacanthrax 是一个罕见的医学词，指非常恶臭、严重的溃疡或痈。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical, rare/old-fashioned) A foul-smelling, ulcer-like sore or carbuncle; a very nasty skin lesion.","zh":"（医学，罕见/旧用）恶臭的溃疡样疮或痈；非常严重、令人不适的皮肤病灶。"},"examples":[{"en":"The old medical text described a cacanthrax as a severe, foul ulcer on the skin.","zh":"那本旧医学书将 cacanthrax 描述为皮肤上严重且恶臭的溃疡。"},{"en":"In modern writing, doctors would rarely use the word cacanthrax, preferring more specific diagnoses.","zh":"在现代写作中，医生很少使用 cacanthrax，而会用更具体的诊断名称。"}]}],"synonyms":["ulcer","carbuncle","abscess"],"phonetic":"/ˌkækənˈθræks/","extraExplanation":["词源提示：来自希腊语 kakos（坏的、恶的）+ anthrax（“煤炭”，引申为“炭疽样疮/痈”）。因此该词字面带有“恶性的痈/疮”的感觉。","使用场景：该词在现代英语里极少见，多出现在旧医学文献或历史性描述中。日常表达通常会用 ulcer（溃疡）、abscess（脓肿）、carbuncle（痈）等更常见且更精确的词。"]}
{"word":"cacao","summary":{"en":"Cacao is the cacao bean (or powder) used to make chocolate, and it can also mean the cacao tree itself.","zh":"cacao 指用于制作巧克力的可可豆（或可可粉），也可指可可树。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The seeds (beans) of the cacao tree, used to make chocolate; also the powder made from these beans (often spelled “cocoa” in everyday use).","zh":"可可（树）的种子（可可豆），用于制作巧克力；也可指由其制成的粉末（日常英语里常写作 cocoa）。"},"examples":[{"en":"Chocolate is made from cacao beans that are fermented, dried, and roasted.","zh":"巧克力是由可可豆经过发酵、干燥和烘烤制成的。"},{"en":"This recipe uses cacao powder for a deeper, less sweet chocolate flavor.","zh":"这道食谱用可可粉来获得更浓、更不甜的巧克力风味。"}]},{"partOfSpeech":"n.","definition":{"en":"The cacao tree (a tropical tree native to the Americas) that produces cacao pods and beans.","zh":"可可树（原产美洲的热带树木），结可可果荚并产出可可豆。"},"examples":[{"en":"Cacao trees grow well in warm, humid climates near the equator.","zh":"可可树适合生长在靠近赤道的温暖潮湿气候中。"},{"en":"Farmers harvest ripe cacao pods and remove the beans inside.","zh":"农民采收成熟的可可果荚，取出里面的豆子。"}]}],"synonyms":["cocoa","cacao bean","cocoa bean"],"phonetic":"/kəˈkaʊ/","extraExplanation":["“cacao”和“cocoa”在现代英语里常被混用：一般来说，cacao更常用于强调“原料/更少加工”的语境（如cacao nibs、cacao powder），而cocoa更常指常见的可可粉与热可可饮料（hot cocoa）。不同品牌的用法也会影响拼写选择。","词源上，“cacao”来自西班牙语 cacao，再追溯到中美洲原住民语言（如纳瓦特尔语）中表示可可的词。可可在中美洲文化与历史中地位重要，曾用于仪式与贸易。"]}
{"word":"cacaos","summary":{"en":"“Cacaos” means cacao beans (plural), used to make chocolate.","zh":"“cacaos”是“cacao”的复数，指可可豆（复数），用于制作巧克力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of cacao: the beans (seeds) of the cacao tree, used to make chocolate; sometimes used to mean cacao trees or cacao products in general.","zh":"cacao 的复数：可可树的可可豆（种子），用于制作巧克力；有时也泛指可可树或可可制品。"},"examples":[{"en":"The farmer dried the cacaos in the sun before selling them.","zh":"农民把可可豆晒干后再出售。"},{"en":"This cooperative exports high-quality cacaos to chocolate makers worldwide.","zh":"这个合作社把高品质可可豆出口给全球的巧克力制造商。"}]}],"synonyms":["cacao beans","cocoa beans"],"phonetic":"/kəˈkaʊ/","extraExplanation":["“cacao”和“cocoa”在日常英语里常常混用，但有一点常见区分：cacao 更常指原料（可可树、可可豆、较少加工的可可制品），cocoa 更常指加工后的可可粉或热可可饮品。不同品牌/地区的用法也会不一致。"]}
{"word":"Cacara","summary":{"en":"Caracara: a large raptor similar to a falcon, often seen scavenging; “Cacara” is usually a misspelling.","zh":"Caracara：一种类似隼的大型猛禽，常见取食腐肉；“Cacara”多为拼写误写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large falcon-like bird (a type of raptor) found mainly in Central and South America and the southern United States; it often eats carrion as well as small animals.","zh":"一种体型较大的猛禽，外形像隼，主要分布于中南美洲及美国南部；常吃腐肉，也捕食小动物。"},"examples":[{"en":"We spotted a crested caracara standing near the roadside, looking for food.","zh":"我们看到一只冠卡拉卡拉鹰站在路边觅食。"},{"en":"Unlike many falcons, caracaras often walk on the ground.","zh":"和许多隼类不同，卡拉卡拉鹰常常在地面上行走。"}]}],"synonyms":["raptor","falcon (general term)"],"phonetic":"/ˌkærəˈkærə/","extraExplanation":["“Cacara”在英语里不太常见，很多情况下是把“caracara”拼错或少写了一个字母（r）。常见的标准拼写是 caracara，特别是物种名 crested caracara（冠卡拉卡拉鹰）。","caracara 这个词来自南美洲语言（经由西班牙语/葡萄牙语进入英语），因此拼写和发音对英语学习者来说可能不直观。"]}
{"word":"cacara","summary":{"en":"Caracara: a large falcon-like bird of prey, often seen scavenging as well as hunting.","zh":"Caracara：一种大型、似隼的猛禽，也常见取食腐肉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large falcon-like bird of prey (genus Caracara), found mainly in Central and South America and parts of the southern U.S.; it often eats carrion (dead animals) as well as hunting small animals","zh":"一种大型、似隼的猛禽（卡拉卡拉属 Caracara），主要分布于中南美洲及美国南部；既会捕食小动物，也常吃腐肉（动物尸体）"},"examples":[{"en":"We spotted a crested caracara on a fence post near the road.","zh":"我们在路边的栅栏柱上看到一只冠卡拉卡拉。"},{"en":"Unlike many falcons, the caracara will sometimes feed on carrion.","zh":"和许多隼类不同，卡拉卡拉有时会吃腐肉。"}]}],"synonyms":["crested caracara","raptor (general)"],"phonetic":"/ˌkærəˈkɑrə/","extraExplanation":["你输入的“cacara”在英语里不太常见；很多人其实想找的是 **caracara**（也写作 *caracara*），一种猛禽的名称。","词源上来自西班牙语/葡萄牙语 *caracará*，是拟声或源自当地语言的动物名；在美国常见的种是 **crested caracara**（冠卡拉卡拉）。"]}
{"word":"cacas","summary":{"en":"“Cacas” is an informal, childish plural word meaning poop/feces.","zh":"“cacas”是非正式、偏幼稚的说法，表示“便便/粪便”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “caca”: a childish or informal word for feces (poop).","zh":"“caca”的复数：幼稚/非正式用语，指粪便（便便）。"},"examples":[{"en":"My little brother says “cacas” when he needs the bathroom.","zh":"我弟弟要上厕所时会说“cacas”。"},{"en":"Please don’t say “cacas” in class—it’s too childish.","zh":"请不要在课堂上说“cacas”，太幼稚了。"}]}],"synonyms":["poop","feces","stool","doo-doo","crap"],"phonetic":"/ˈkɑkəz/","extraExplanation":["“caca/cacas”在英语里多见于儿童口语或刻意用幼儿化的表达（比如逗小孩、开玩笑）。正式场合更常用“feces”（较正式/医学）或“poop”（较中性口语）。","这个词在多种语言中都有类似形式（如法语、西班牙语里也有相近的儿童用语），英语里借用后同样带有“儿童说法”的语气。"]}
{"word":"Cacatua","summary":{"en":"Cacatua is the scientific genus name for several cockatoos, especially many white, crested species.","zh":"Cacatua 是若干凤头鹦鹉（多为白色、带羽冠）的科学属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of cockatoos (medium-to-large parrots), many of which are mostly white and have a raised crest; found mainly in Australia and nearby islands","zh":"凤头鹦鹉属（一类中大型鹦鹉），许多种类通体偏白并有可竖起的羽冠；主要分布在澳大利亚及附近岛屿"},"examples":[{"en":"The sulphur-crested cockatoo belongs to the genus Cacatua.","zh":"葵花凤头鹦鹉属于凤头鹦鹉属（Cacatua）。"},{"en":"At the zoo, we saw a Cacatua cockatoo lifting its crest when it got excited.","zh":"在动物园里，我们看到一只凤头鹦鹉属（Cacatua）的鸟兴奋时把羽冠竖了起来。"}]}],"synonyms":["cockatoo (genus)","white cockatoo (general)"],"phonetic":"/ˌkækəˈtuːə/","extraExplanation":["“Cacatua”是拉丁化的学名（属名），在正式写作中常用斜体：*Cacatua*。作为属名首字母要大写（Cacatua），而物种名要小写，例如 *Cacatua galerita*（葵花凤头鹦鹉）。","日常英语里更常说“cockatoo（凤头鹦鹉）”。“Cacatua”多见于生物、动物学或较正式的科普文章。"]}
{"word":"cacatua","summary":{"en":"Cacatua is the scientific genus name for several cockatoos.","zh":"Cacatua 是凤头鹦鹉属的学名属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific genus name for several kinds of cockatoos (large parrots), often found in Australia and nearby regions","zh":"（生物学）凤头鹦鹉属：一种（或一类）大型鹦鹉的学名属名，多见于澳大利亚及其周边地区"},"examples":[{"en":"The bird in the photo belongs to the genus Cacatua, a group of cockatoos.","zh":"照片里的鸟属于凤头鹦鹉属（Cacatua），这是凤头鹦鹉的一类。"},{"en":"Some Cacatua species are known for their loud calls and expressive crests.","zh":"一些凤头鹦鹉属（Cacatua）的物种以叫声很大、头冠很醒目而闻名。"}]}],"synonyms":["cockatoo"],"phonetic":"/ˌkækəˈtuːə/","extraExplanation":["“Cacatua”通常出现在科普文章、动物园说明牌或学术语境里；日常英语更常用“cockatoo（凤头鹦鹉）”。","作为拉丁化的学名属名，书写时通常首字母大写并用斜体（Cacatua）。"]}
{"word":"Cacatuidae","summary":{"en":"Cacatuidae is the scientific family name for cockatoos (a group of parrots).","zh":"Cacatuidae 是凤头鹦鹉（鹦鹉的一类）的科学分类名：凤头鹦鹉科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of parrots known as cockatoos, typically recognized by a movable crest on the head and strong curved beaks","zh":"凤头鹦鹉科；一类鹦鹉（凤头鹦鹉）的科，常见特征是头顶可竖起的羽冠和强壮弯曲的喙"},"examples":[{"en":"The sulphur-crested cockatoo belongs to the family Cacatuidae.","zh":"葵花凤头鹦鹉属于凤头鹦鹉科（Cacatuidae）。"},{"en":"In zoology class, we learned that Cacatuidae are mostly found in Australia and nearby islands.","zh":"在动物学课上，我们了解到凤头鹦鹉科主要分布在澳大利亚及其周边岛屿。"}]}],"synonyms":["cockatoo family"],"phonetic":"/ˌkækəˈtuːaɪdiː/","extraExplanation":["“Cacatuidae”是生物分类学（taxonomy）里的拉丁化学名，通常在学术写作中使用；日常英语更常说“cockatoos（凤头鹦鹉）”。","词尾“-idae”常表示“某某科”（动物分类的“family”级别），例如“Felidae（猫科）”。","发音上可大致按音节读作：ca-ca-TOO-i-dee；写作和检索时注意中间的“tu”对应“too”的音。"]}
{"word":"cacatuidae","summary":{"en":"Cacatuidae is the scientific family name for cockatoos.","zh":"Cacatuidae 是凤头鹦鹉（cockatoos）的科学“科”名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the biological family of parrots that includes cockatoos, known for their crests and (often) loud calls.","zh":"凤头鹦鹉科；鹦鹉的一科，包含各类凤头鹦鹉，以头冠羽（凤头）和（常见的）响亮叫声著称。"},"examples":[{"en":"Cockatoos belong to the family Cacatuidae, separate from most other parrots.","zh":"凤头鹦鹉属于凤头鹦鹉科（Cacatuidae），与大多数其他鹦鹉分属不同类群。"},{"en":"In field guides, Cacatuidae are often identified by their movable crests and strong beaks.","zh":"在观鸟图鉴中，凤头鹦鹉科常因可竖起的冠羽和强壮的喙而被辨认出来。"}]}],"synonyms":["cockatoo family","family Cacatuidae"],"phonetic":"/ˌkækəˈtuːɪdiː/","extraExplanation":["“Cacatuidae”是动物分类学中的“科”名（family），在正式写作里常与属名、种名一起出现。日常英语更常说“cockatoos”（凤头鹦鹉）。","词源上与“cockatoo”有关：英语“cockatoo”据说来自马来语/印尼语 *kakaktua*（常被解释为“姐姐/哥哥+老”之类的构词），拉丁化后形成学名体系中的“Cacatuidae”。"]}
{"word":"Cacatuinae","summary":{"en":"Cacatuinae is the scientific name for the cockatoo subfamily of parrots.","zh":"Cacatuinae 是“凤头鹦鹉亚科”的科学名称，属于鹦鹉类的一支。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the subfamily of parrots that includes the cockatoos (birds with a crest and often loud calls), mostly native to Australia and nearby islands","zh":"凤头鹦鹉亚科（鹦鹉的一类亚科，成员多具头冠、叫声响亮，主要分布于澳大利亚及周边岛屿）"},"examples":[{"en":"Many species in the Cacatuinae have a movable crest that they raise when excited.","zh":"凤头鹦鹉亚科的许多物种都有可活动的头冠，兴奋时会竖起。"},{"en":"Researchers compared Cacatuinae with other parrots to study how their social behavior evolved.","zh":"研究人员将凤头鹦鹉亚科与其他鹦鹉比较，以研究它们的群体行为如何演化。"}]}],"synonyms":["cockatoo subfamily","Cacatuidae (family name, closely related term)"],"phonetic":"/ˌkækəˈtuːɪniː/","extraExplanation":["“Cacatuinae”是拉丁化的科学分类名称，常见于生物学与鸟类学写作中；日常英语里更常用“cockatoo（凤头鹦鹉）”来指具体的鸟。","分类层级提示：亚科（subfamily）通常位于科（family）之下、属（genus）之上；Cacatuinae常被用来概括多种“cockatoos”相关的属与物种。"]}
{"word":"cacatuinae","summary":{"en":"Cacatuinae is the scientific name for the cockatoo subfamily in bird classification.","zh":"Cacatuinae 是鸟类分类学中“凤头鹦鹉亚科”的学名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a taxonomic subfamily of parrots that includes the cockatoos (in the family Cacatuidae).","zh":"（动物学/分类学）凤头鹦鹉亚科：鹦鹉目中凤头鹦鹉科（Cacatuidae）的一类群，包含各类凤头鹦鹉。"},"examples":[{"en":"Cockatoos are often classified within the subfamily Cacatuinae.","zh":"凤头鹦鹉常被归入凤头鹦鹉亚科（Cacatuinae）。"},{"en":"In some references, Cacatuinae is used to discuss the evolutionary relationships among cockatoos.","zh":"在一些资料中，会用 Cacatuinae 来讨论凤头鹦鹉之间的演化关系。"}]}],"synonyms":["cockatoo subfamily","Cacatuidae (family name, related term)"],"phonetic":"/ˌkækəˈtuːɪniː/","extraExplanation":["这是一个拉丁化的科学分类名称，常见于学术论文、动物志或鸟类图鉴中；日常英语里通常直接说 cockatoo（凤头鹦鹉）。","不同资料可能会因分类体系更新而把相关类群的层级（科/亚科/属等）处理得略有差异；阅读时可留意所采用的分类系统与出版年份。"]}
{"word":"cacaxte","summary":{"en":"A cacaxte is a traditional carrying frame used in parts of Mexico/Central America to transport loads.","zh":"cacaxte 指墨西哥/中美洲部分地区用来搬运重物的传统背架式运载工具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional wooden carrying frame (often used with a strap across the forehead or chest) for transporting loads, used in parts of Mexico and Central America","zh":"（墨西哥与中美洲部分地区使用的）传统木制背架/运载架，常配合额带或胸带来搬运重物"},"examples":[{"en":"The farmer tied the firewood onto a cacaxte and carried it home.","zh":"农夫把柴火绑在cacaxte上背回家。"},{"en":"In the museum, we saw a cacaxte used for carrying corn and other goods.","zh":"在博物馆里，我们看到一种用来运玉米和其他货物的cacaxte。"}]}],"synonyms":["carrying frame","pack frame","burden frame","tumpline pack (similar concept)"],"phonetic":"/kɑˈkɑsteɪ/","extraExplanation":["“cacaxte”常见为拼写变体；更常见的写法是 **cacaxtle**（也可见 **cacaxtli**），源自纳瓦特尔语（Nahuatl）。","它属于中美洲传统搬运工具文化的一部分：把货物绑在木架上，再用带子分担重量（有些地区会用额带/头带，类似“tumpline”的承重方式）。","由于属于地域与文化专有词，在英语语境中多见于人类学、民族志、博物馆说明或与墨西哥乡村生活相关的写作中。"]}
{"word":"Caccabis","summary":{"en":"“Caccabis” is a rare word meaning an old-style cooking pot, and it can also appear as an obsolete genus name for partridges.","zh":"“Caccabis”是一个很少见的词：可指（古义）炊锅，也可指（动物学旧用）某些鹧鸪的旧属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) a cooking pot; a kettle.","zh":"（古义）炊锅；煮食用的锅；水壶（泛指有柄的锅具）。"},"examples":[{"en":"In some old texts, a “caccabis” refers to a pot used for boiling food.","zh":"在一些古老文献里，“caccabis”指用来煮食物的锅。"},{"en":"The recipe called for meat to be simmered slowly in a caccabis.","zh":"这份古法食谱要求把肉放在“caccabis”（锅）里小火慢炖。"}]},{"partOfSpeech":"n.","definition":{"en":"(Obsolete zoology) a former scientific genus name used for certain partridges.","zh":"（动物学旧用）旧时用于某些鹧鸪/山鹑类的属名（已较少使用）。"},"examples":[{"en":"Older bird books may list some partridges under the genus Caccabis.","zh":"较早的鸟类图鉴可能会把某些鹧鸪归在 Caccabis 这个属名下。"}]}],"synonyms":["kettle","cooking pot","cauldron"],"phonetic":"/ˈkækəˌbɪs/","extraExplanation":["“Caccabis”在现代英语里非常少见，常见于古典（拉丁/希腊）语境或旧式动物分类文献。日常英语里一般不会用到。","它也容易被误写或误读为“cannabis”（大麻）。如果你本来想查的是 cannabis（大麻），告诉我我可以给你那一词的标准释义与用法。"]}
{"word":"caccabis","summary":{"en":"Cannabis is a plant; it also refers to marijuana, a drug made from the plant.","zh":"Cannabis 指大麻这种植物，也可指由其制成的毒品/药物（即 marijuana）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant (Cannabis sativa or related species) whose leaves and flowers can be used to make hemp products or a drug that can change mood and perception","zh":"大麻（植物；其叶与花可用于制成工业用麻制品或作为会影响情绪与感知的药物/毒品）"},"examples":[{"en":"Some countries allow cannabis for medical use, while others restrict it.","zh":"一些国家允许医用大麻，而另一些国家则严格限制。"},{"en":"The smell of cannabis can be strong when it is smoked.","zh":"大麻被吸食时气味可能很浓。"}]},{"partOfSpeech":"n.","definition":{"en":"the dried leaves and flowers of the cannabis plant, used as a recreational drug; marijuana","zh":"（作为娱乐性药物的）大麻制品；大麻烟；马里华纳（marijuana）"},"examples":[{"en":"He was arrested for possessing cannabis.","zh":"他因持有大麻被捕。"},{"en":"She said she doesn’t use cannabis because it affects her concentration.","zh":"她说她不使用大麻，因为那会影响她的注意力。"}]}],"synonyms":["marijuana","weed","pot","hemp (plant/industrial use)"],"phonetic":"/ˈkænəbɪs/","extraExplanation":["你输入的“caccabis”更可能是拼写错误，常见正确拼写是 **cannabis**（双写 n）。","在不同地区，“cannabis / marijuana / weed”常被当作同义词使用，但在法律与医学语境中，“cannabis”更正式；是否违法、是否可医用因国家与州/省而异。"]}
{"word":"caccagogue","summary":{"en":"A caccagogue is someone who leads or encourages others to do bad or immoral things.","zh":"caccagogue 指引人作恶、教唆他人做坏事的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who leads or encourages others toward wrongdoing or immoral behavior; a bad influence","zh":"引人作恶的人；教唆他人做坏事的人；坏榜样"},"examples":[{"en":"Parents worry about online caccagogues who pressure teens into risky behavior.","zh":"父母担心网络上那些引人作恶的人，会逼迫青少年做出冒险行为。"},{"en":"He wasn’t just a troublemaker—he acted like a caccagogue, pushing others to break the rules.","zh":"他不只是爱惹事的人——更像是教唆者，怂恿别人违反规定。"}]}],"synonyms":["bad influence","corruptor","instigator","seducer","tempter","demagogue (related, but more political)"],"phonetic":"/ˈkækəˌɡoʊɡ/","extraExplanation":["这是一个非常罕见、偏书面甚至带点“古典学/辞书体”的词，日常英语里几乎不用。更常见的表达是 bad influence（坏影响的人）、corruptor（腐化者）、instigator（煽动者）。","词源来自希腊语：kakos（坏的）+ agogos（引导者、带领者）。结构上类似 pedagogue（教师；教育者）/ demagogue（蛊惑民众的政客），但 caccagogue 含义更直接地指“带人走向坏事”。"]}
{"word":"cacchen","summary":{"en":"“cacchen” isn’t a standard English word; you likely meant “cache”: a hidden store or (in computing) temporary storage, used as a noun or verb.","zh":"“cacchen” 不是标准英语词；你可能想写 “cache”：指隐藏的储藏处或（计算机）缓存，可作名词或动词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"It looks like “cacchen” is not a standard English word. You may have meant “cache” (a hidden store or a place to store data).","zh":"“cacchen” 似乎不是标准英语单词。你可能想写的是 “cache”（隐藏的储藏处；或计算机中的缓存）。"},"examples":[{"en":"Did you mean “cache”? If you tell me the sentence you saw it in, I can confirm.","zh":"你是想写 “cache” 吗？如果你把它出现的句子发我，我可以帮你确认。"}]},{"partOfSpeech":"n.","definition":{"en":"cache (noun): a hidden collection of things stored for later use; in computing, a place that stores data temporarily for faster access.","zh":"cache（名词）：为以后使用而秘密/隐藏存放的一批物品；（计算机）缓存，用来临时存储数据以便更快读取。"},"examples":[{"en":"The hikers found a cache of supplies near the trail.","zh":"徒步者在小路旁发现了一处补给品的储藏点。"},{"en":"Try clearing your browser cache if the website won’t load correctly.","zh":"如果网站加载不正常，试试清除浏览器缓存。"}]},{"partOfSpeech":"v.","definition":{"en":"cache (verb): to hide and store something; in computing, to store data temporarily so it can be accessed more quickly later.","zh":"cache（动词）：把某物藏起来保存；（计算机）把数据暂存起来以便之后更快访问。"},"examples":[{"en":"They cached extra water in case the trip took longer than planned.","zh":"他们把额外的水藏起来，以防行程比计划更久。"},{"en":"The app caches images to speed up loading.","zh":"这个应用会缓存图片来加快加载速度。"}]}],"synonyms":["store","stash","hide","reserve","buffer"],"phonetic":"/kæʃ/","extraExplanation":["“cache” 源自法语 *cacher*（意为“隐藏”）。在现代英语里，它既常见于户外/寻宝语境（例如 geocaching 地理寻宝），也非常常见于电脑与网络语境（浏览器缓存、CPU cache 等）。","如果你看到的是拼写类似 “cachen / cachen.” 或带重音的 “caché”，也可能是不同语言或借词形式；把原句贴出来我能更准确判断。"]}
{"word":"caccia","summary":{"en":"Caccia is an Italian word meaning “hunt/hunting,” and it can also name a medieval Italian musical form that imitates a hunt.","zh":"Caccia 是意大利语，意思是“狩猎/打猎”；它也可指中世纪意大利的一种模仿狩猎场景的音乐体裁。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Italian word for “hunt” or “hunting”; sometimes used in English when talking about Italian culture, food, or place names","zh":"意大利语中“狩猎/打猎”的意思；在英语里也偶尔用于谈论意大利文化、饮食或地名等语境"},"examples":[{"en":"In Italian, caccia means “hunting.”","zh":"在意大利语里，caccia 的意思是“打猎/狩猎”。"},{"en":"Some Italian menus use the word caccia to suggest a rustic, “hunter-style” dish.","zh":"一些意大利菜单会用 caccia 来暗示一种乡村风、带“猎人风味”的菜式。"}]},{"partOfSpeech":"n.","definition":{"en":"a medieval Italian musical form (a type of canon) that often imitates the sounds of a hunt, such as horns and shouting","zh":"中世纪意大利的一种音乐体裁（类似卡农/轮唱），常模仿狩猎场景的声音，如号角与呼喊"},"examples":[{"en":"We studied a 14th-century caccia that imitates hunters calling to each other.","zh":"我们学习了一首14世纪的 caccia，它模仿猎人彼此呼喊的声音。"},{"en":"The composer used a caccia to create a lively, chasing effect.","zh":"作曲家用 caccia 营造出活泼、追逐般的效果。"}]}],"synonyms":["hunt","hunting"],"phonetic":"/ˈkɑːtʃə/","extraExplanation":["caccia 来自意大利语，字面就是“狩猎”。在英语材料中它多见于两类场景：①意大利相关的地名/文化（如某些姓氏、店名、活动名）；②音乐史里指一种中世纪体裁。日常英语中并不是高频词。","在饮食语境里，如果你看到像 “alla cacciatora（猎人风）” 这类表达，和 caccia 有语义关联：强调朴实、乡村风味，常与番茄、香草、洋葱等搭配有关（具体做法因地区而异）。"]}
{"word":"caccias","summary":{"en":"“caccias” means more than one “caccia,” a medieval Italian canon-like piece often portraying a hunt or other lively scenes.","zh":"“caccias”指多个“caccia”：一种中世纪意大利、类似卡农的音乐体裁，常描绘狩猎或其他热闹场景。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of caccia: a medieval Italian vocal/instrumental form (like a canon) that often depicts lively scenes such as a hunt or a marketplace.","zh":"caccia 的复数：一种中世纪意大利的声乐/器乐体裁（类似卡农轮唱），常描写狩猎或集市等热闹场景。"},"examples":[{"en":"The program includes two 14th‑century caccias with imitative lines that chase each other.","zh":"演出曲目包含两首14世纪的 caccia，其中模仿声部彼此“追逐”呼应。"},{"en":"In these caccias, the music can sound like dogs and hunters in motion.","zh":"在这些 caccia 中，音乐听起来仿佛猎犬和猎人正在奔跑追逐。"}]}],"synonyms":["canons","rounds","medieval part-songs"],"phonetic":"/ˈkɑtʃəz/","extraExplanation":["“caccia”在意大利语里原意是“狩猎”。这种体裁常用“追逐式”的模仿写作（声部一前一后进入），用音乐描绘追赶、喧闹与动感的画面。","在英语里你可能更常见到单数形式 caccia；复数写作 caccias，多用于音乐史、曲目单或学术写作中。"]}
{"word":"cacciatora","summary":{"en":"Cacciatora means “hunter-style,” a rustic Italian way of braising meat (often chicken) with tomatoes, onions, and herbs.","zh":"Cacciatora 指“猎人风味”的意式家常炖煮做法，常用于炖鸡等肉类，配番茄、洋葱和香草。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Italian cooking) a “hunter-style” dish, usually meat (often chicken or rabbit) cooked with tomatoes, onions, herbs, and sometimes mushrooms or wine.","zh":"（意大利烹饪）“猎人风味”的菜肴做法，通常把肉类（常见鸡肉或兔肉）与番茄、洋葱、香草（有时加蘑菇或葡萄酒）一起炖煮。"},"examples":[{"en":"We ordered chicken cacciatora with pasta.","zh":"我们点了猎人风味炖鸡配意面。"},{"en":"The menu says “rabbit cacciatora,” braised with tomatoes and rosemary.","zh":"菜单上写“猎人风味炖兔肉”，用番茄和迷迭香慢炖。"}]},{"partOfSpeech":"adj.","definition":{"en":"(in menus) in hunter style; cooked “alla cacciatora.”","zh":"（菜单用语）猎人风味的；按“alla cacciatora（猎人式）”做法烹调的。"},"examples":[{"en":"I’ll have the pork cacciatora, please.","zh":"我想要一份猎人风味猪肉。"},{"en":"Try the cacciatora sauce over polenta.","zh":"可以把猎人风味酱汁浇在玉米粥上试试。"}]}],"synonyms":["hunter-style","alla cacciatora","chicken cacciatore"],"phonetic":"/ˌkɑːtʃəˈtɔːrə/","extraExplanation":["“Cacciatora”来自意大利语“cacciatore”（猎人）。在英语里常见搭配是“chicken cacciatore / pollo alla cacciatora”。不同地区做法会有差异：有的偏番茄炖，有的会加白葡萄酒、橄榄、酸豆或蘑菇。","在餐馆菜单中，“alla cacciatora”通常表示一种家常炖煮风格，而不是固定的单一配方。"]}
{"word":"cacciatore","summary":{"en":"Cacciatore refers to an Italian “hunter-style” dish or sauce, often tomato-based, especially in chicken cacciatore.","zh":"Cacciatore 指意大利“猎人风味”的炖菜/酱汁做法，常以番茄为底，最常见于 chicken cacciatore（猎人风味炖鸡）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Italian cooking) a dish prepared “hunter-style,” usually cooked with tomatoes, onions, herbs, and often mushrooms; commonly used in names like chicken cacciatore.","zh":"（意大利料理）“猎人风味”的做法/菜肴，通常用番茄、洋葱、香草（常加蘑菇）炖煮；常见于菜名如“chicken cacciatore（猎人风味炖鸡）”。"},"examples":[{"en":"We ordered chicken cacciatore with pasta.","zh":"我们点了猎人风味炖鸡配意面。"},{"en":"This restaurant makes a rich cacciatore sauce with tomatoes and mushrooms.","zh":"这家餐厅用番茄和蘑菇做出很浓郁的cacciatore酱汁。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing food cooked in the “hunter-style” way (often used after the main ingredient, as in “cacciatore chicken”).","zh":"（形容食物）以“猎人风味”方式烹调的（常放在主食材后，如“cacciatore chicken”）。"},"examples":[{"en":"Try the cacciatore chicken—it’s slow-cooked with herbs and tomatoes.","zh":"试试猎人风味鸡吧——用香草和番茄慢炖的。"},{"en":"She served cacciatore-style stew with crusty bread.","zh":"她端上了猎人风味的炖菜，配硬皮面包。"}]}],"synonyms":["hunter-style","alla cacciatora"],"phonetic":"/ˌkɑːtʃəˈtɔːreɪ/","extraExplanation":["“Cacciatore”来自意大利语，字面意思是“猎人”（cacciatore）。在英语菜单里，它通常指一种“乡村/家常”的炖煮风格，而不是特定单一配方；常见搭配是鸡肉（chicken cacciatore），也可能用兔肉等。","在美国餐馆里你也会看到写作“alla cacciatora/cacciatore”（意大利语表达），意思接近“以猎人风味烹调”。"]}
{"word":"Caccini","summary":{"en":"Caccini is an Italian surname best known for Giulio Caccini, an influential early-opera and early Baroque vocal composer.","zh":"Caccini是意大利姓氏，最常指影响早期歌剧与巴洛克声乐风格的作曲家朱利奥·卡奇尼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an Italian surname, most commonly referring to Giulio Caccini (c. 1551–1618), a composer and singer who helped shape early opera and the solo singing style called monody.","zh":"意大利姓氏，最常指朱利奥·卡奇尼（Giulio Caccini，约1551–1618），作曲家与歌唱家，对早期歌剧与“独唱宣叙式/单声部独唱”（monody）风格的发展有重要影响。"},"examples":[{"en":"Caccini is often mentioned in lessons about the birth of opera.","zh":"在讲解歌剧诞生的课程中，经常会提到卡奇尼。"},{"en":"Many singers study Caccini’s song “Amarilli, mia bella.”","zh":"许多歌者会学习卡奇尼的歌曲《Amarilli, mia bella》。"}]},{"partOfSpeech":"n.","definition":{"en":"by extension, music written by the Caccini family—especially early Baroque vocal music associated with Florence.","zh":"引申指卡奇尼家族（尤其是佛罗伦萨早期巴洛克时期）的声乐作品与风格。"},"examples":[{"en":"The program includes Caccini alongside Peri and Monteverdi.","zh":"本场曲目把卡奇尼与佩里（Peri）、蒙特威尔第（Monteverdi）并列呈现。"},{"en":"We chose a Caccini piece for a small chamber concert.","zh":"我们为一场小型室内音乐会选了一首卡奇尼的作品。"}]}],"synonyms":["Giulio Caccini","Francesca Caccini"],"phonetic":"/kɑːˈtʃiːni/","extraExplanation":["“Caccini”在英语语境里通常是音乐史/古典音乐相关的专名。Giulio Caccini的著作《Le nuove musiche》（《新音乐》）提倡让歌词更清晰、用装饰音表达情感，这对早期歌剧与巴洛克声乐写作影响很大。","如果你在乐谱或演出海报上看到“Caccini”，有时也可能指他的女儿Francesca Caccini（1587–c.1641），她也是重要的作曲家，常被认为是最早创作歌剧的女性之一。"]}
{"word":"Cacciocavallo","summary":{"en":"Caciocavallo is a traditional Italian aged stretched-curd cheese, often teardrop-shaped and sold in tied pairs.","zh":"Caciocavallo（卡乔卡瓦洛）是一种传统意大利熟成拉丝奶酪，常呈水滴形并成对绑着出售。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditional Italian stretched-curd (pasta filata) cheese, usually aged and shaped like a teardrop, often sold tied in pairs.","zh":"一种传统意大利“拉丝凝乳”（pasta filata）奶酪，通常熟成后呈梨/水滴形，常成对绑着出售。"},"examples":[{"en":"She grated caciocavallo over the pasta for a rich, savory finish.","zh":"她把卡乔卡瓦洛奶酪刨丝撒在意面上，味道更浓郁咸香。"},{"en":"In southern Italy, caciocavallo is often enjoyed grilled or melted on bread.","zh":"在意大利南部，人们常把卡乔卡瓦洛奶酪烤着吃，或融化后抹在面包上。"}]}],"synonyms":["pasta filata cheese"],"phonetic":"ˌkɑːtʃoʊkəˈvɑːloʊ","extraExplanation":["词源提示：意大利语 cacio（奶酪）+ cavallo（马）。常见解释是这种奶酪会把两只用绳子绑在一起，像“骑在马背上”一样挂在横杆上风干/熟成，因此得名；也有人认为与古代运输方式有关。","口感与用法：属于“拉丝奶酪”家族，口感介于摩苏里拉与更硬的熟成奶酪之间；年轻时更柔和、可拉丝，熟成后更咸香浓郁，适合刨丝、切片烤制或搭配红酒。"]}
{"word":"cace","summary":{"en":"“cace” isn’t a common English word; it’s usually a typo for “case” or “cache.”","zh":"“cace” 不是常用英语词；通常是把 “case” 或 “cache” 拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling of “case” or “cache.”","zh":"不是标准英语单词；最常见是把 “case” 或 “cache” 拼错。"},"examples":[{"en":"I think you meant “case” (like a situation) or “cache” (stored data).","zh":"我猜你想写的是 “case”（情况/案例）或 “cache”（缓存/隐藏储藏）。"},{"en":"Could you check the spelling and tell me the sentence you wanted to write?","zh":"你可以检查一下拼写，并把你想写的句子发我吗？"}]}],"synonyms":["case","cache"],"phonetic":"/keɪs/","extraExplanation":["“case” /keɪs/ 常见意思：情况、案例、箱/盒、（法庭）案件等。","“cache” /kæʃ/ 常见意思：隐藏的储藏（名词）；（电脑）缓存（名词/动词）。如果你给我一个包含 “cace” 的句子，我可以帮你判断到底想表达哪一个词。"]}
{"word":"cacei","summary":{"en":"“cacei” isn’t a standard English word; you probably meant “cacti” (plural of cactus).","zh":"“cacei”不是标准英语词；你可能想写“cacti”（cactus 的复数）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “cacti,” the plural of “cactus.”","zh":"不是标准英语单词。很可能是把“cacti”（cactus 的复数）拼错了。"},"examples":[{"en":"Did you mean “cacti”? There are several cacti in the desert garden.","zh":"你是不是想写“cacti”？沙漠花园里有好几株仙人掌。"},{"en":"This word “cacei” doesn’t appear in most English dictionaries.","zh":"“cacei”这个词在大多数英语词典里找不到。"}]},{"partOfSpeech":"n.","definition":{"en":"cacti (plural noun): more than one cactus (a plant with thick stems and spines, common in dry places).","zh":"cacti（复数名词）：多个 cactus（仙人掌；一种茎粗厚、有刺、常见于干旱地区的植物）。"},"examples":[{"en":"We keep small cacti on the windowsill because they don’t need much water.","zh":"我们在窗台上养小型仙人掌，因为它们不太需要浇水。"},{"en":"Some cacti produce bright flowers in spring.","zh":"有些仙人掌在春天会开出鲜艳的花。"},{"en":"Be careful—those cacti have sharp spines.","zh":"小心——那些仙人掌的刺很尖。"}]}],"synonyms":["cactuses"],"phonetic":"/ˈkæktaɪ/","extraExplanation":["“cactus”的复数有两种常见形式：更常见、更口语的是“cactuses”；较常见于书面或学术语境的是拉丁复数“cacti”。","如果你想表达的是人名，可能是“Casey”（/ˈkeɪsi/）的误拼；如果你能提供一句上下文，我可以帮你确认。"]}
{"word":"cacemphaton","summary":{"en":"Cacemphaton means the deliberate use of harsh, unpleasant sound patterns in language for effect.","zh":"Cacemphaton 指在语言中刻意使用刺耳、不悦耳的声音组合来达到表达效果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rhetoric, literature) An intentionally harsh or unpleasant-sounding arrangement of words or sounds; the use of awkward, jarring sound effects in speech or writing.","zh":"（修辞/文学）刻意使用刺耳、不悦耳的语音或词语组合；用拗口、冲撞的声音效果来制造不适或强调。"},"examples":[{"en":"The poet uses cacemphaton to make the battle scene feel brutal and uncomfortable.","zh":"诗人用 cacemphaton 来让战斗场景显得残酷、令人不适。"},{"en":"That line’s repeated hard sounds create a cacemphaton that slows the reader down.","zh":"那一句反复出现的硬音形成了 cacemphaton，让读者读起来更慢、更吃力。"}]}],"synonyms":["cacophony","harsh-sounding wording","dissonance","jarring sound","awkward phrasing"],"phonetic":"/ˌkæsɛmˈfeɪtən/","extraExplanation":["这是一个很少见但很有用的修辞学术语，常用来分析“声音为什么让人不舒服”。它强调的是“刻意/有目的的刺耳”，而不仅仅是自然出现的难听。","词源来自希腊语：kakos（坏的）+ emphatos（发声/表达相关）。它和更常见的 cacophony（刺耳的杂音/不和谐声音）意义接近；相反概念是 euphony（悦耳）。","在写作或演讲中，作者可能用它来表现混乱、愤怒、暴力、压迫感，或让某句话更难读以突出紧张情绪。"]}
{"word":"cacesthesia","summary":{"en":"Cacesthesia means an unpleasant or abnormal sense of taste.","zh":"cacesthesia 指“味觉异常/不愉快的坏味觉”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an unpleasant or “bad” sense of taste (a distorted or disagreeable taste sensation)","zh":"味觉异常；不愉快的“坏味觉”（对味道的感知变得扭曲或令人不适）"},"examples":[{"en":"After the medication, she developed a cacesthesia and complained that everything tasted metallic.","zh":"服药后她出现了味觉异常，抱怨什么都带金属味。"},{"en":"Some illnesses can cause cacesthesia, making normal food taste strange or unpleasant.","zh":"一些疾病会引起味觉异常，让普通食物尝起来怪或难以下咽。"}]}],"synonyms":["dysgeusia","taste distortion","abnormal taste"],"phonetic":"/ˌkækɛsˈθiʒə/","extraExplanation":["这个词较少见，常用于医学或较正式的语境。由希腊语词根组成：caco- 表示“坏的/不良的”，-aesthesia 表示“感觉/知觉”（同根词：anesthesia 麻醉，aesthetic 美学的/审美的）。","不要和“恶心（nausea）”混淆：cacesthesia 主要强调“味觉变坏/变怪”，而恶心强调“想吐的感觉”。如果你想表达“金属味、苦味挥之不去”等，也可以更常用地说：a metallic/bitter taste in my mouth。"]}
{"word":"cacesthesis","summary":{"en":"Cacesthesis means an unpleasant abnormal sensation, often related to nerve problems.","zh":"cacesthesis 指不愉快的异常感觉，常与神经问题有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abnormal, unpleasant sensation (such as burning, stinging, or painful tingling), often caused by nerve irritation or damage","zh":"（医学）不愉快的异常感觉（如灼烧、刺痛或疼痛性麻刺感），常与神经受刺激或损伤有关"},"examples":[{"en":"After the injury, she reported cacesthesis in her fingertips, like a burning tingling.","zh":"受伤后，她说指尖出现了不愉快的异常感觉，像灼烧般的麻刺感。"},{"en":"Some neuropathies can cause cacesthesis even when the skin looks normal.","zh":"某些周围神经病变会引起不愉快的异常感觉，即使皮肤看起来正常。"}]}],"synonyms":["dysesthesia","paresthesia"],"phonetic":"/ˌkækɛsˈθiːsɪs/","extraExplanation":["词源上可拆成 caco-（“坏的、不良的”）+ aesthesis（“感觉”），来自希腊语 kakos 与 aisthesis。","这个词在日常英语中很少见，临床或神经学语境更常用的是 dysesthesia（感觉异常/不适感）或 paresthesia（麻刺感，未必疼痛）。"]}
{"word":"cachaca","summary":{"en":"Cachaça is a Brazilian sugarcane spirit, famous as the main ingredient in a caipirinha.","zh":"卡沙萨是一种巴西甘蔗烈酒，以卡皮里尼亚鸡尾酒的主要基酒而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Brazilian distilled alcoholic drink made from fermented sugarcane juice (often used in the cocktail caipirinha)","zh":"一种巴西蒸馏烈酒，由发酵的甘蔗汁制成（常用于调制“卡皮里尼亚”鸡尾酒）"},"examples":[{"en":"Caipirinha is traditionally made with cachaça, lime, sugar, and ice.","zh":"传统的卡皮里尼亚鸡尾酒用卡沙萨、青柠、糖和冰调制。"},{"en":"In Brazil, some cachaça is aged in wooden barrels for a smoother flavor.","zh":"在巴西，有些卡沙萨会在木桶中陈酿，使风味更柔和。"}]}],"synonyms":["Brazilian sugarcane spirit","Brazilian rum (informal)"],"phonetic":"/kəˈʃɑːsə/","extraExplanation":["“Cachaça”是葡萄牙语词，英语里也常直接借用。常见写法有重音符号的“cachaça”，不带重音的“cachaca”也很常见。","它常被拿来与朗姆酒（rum）比较：两者都源自甘蔗，但卡沙萨通常以“甘蔗汁”发酵蒸馏，而许多朗姆酒以“糖蜜（molasses）”为原料；因此风味常更有青草、甘蔗的香气（具体仍取决于品牌与陈酿）。"]}
{"word":"cachaemia","summary":{"en":"A rare medical term meaning a general state of poor health and weakness, similar to cachexia.","zh":"一个较少见的医学术语，指全身健康状况差、虚弱消耗的状态，含义接近“恶病质”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical, rare) A generally unhealthy condition of the body, often involving weakness, poor nutrition, and a “run-down” state caused by chronic disease; similar to cachexia.","zh":"（医学、较少用）指身体整体不健康的状态，常见为虚弱、营养不良、长期疾病导致的“消耗/衰弱”状态；含义接近 cachexia（恶病质）。"},"examples":[{"en":"The patient showed signs of cachaemia after months of untreated illness.","zh":"这位病人因数月未治疗的疾病而出现了 cachaemia（全身衰弱/消耗）的迹象。"},{"en":"In older medical writing, cachaemia was used to describe a general state of poor health.","zh":"在较早的医学文献中，cachaemia 常用来描述一种整体健康状况很差的状态。"}]}],"synonyms":["cachexia","debility","wasting","ill health"],"phonetic":"/kəˈkiːmiə/","extraExplanation":["这个词在现代英语里非常少见，多出现在旧医学文献中；临床表达里更常用的是 cachexia（恶病质）或 general debility（全身衰弱）。","词源上与“坏（kak-）+ 血（-haemia）”的构词思路有关，带有“血液/体质不佳导致全身状态差”的旧式医学色彩。"]}
{"word":"cachaemic","summary":{"en":"“Cachaemic” means having cachexia—severe illness-related wasting and weakness.","zh":"“cachaemic”指“恶病质的”——因严重疾病导致的消耗性消瘦与虚弱。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medical) affected by cachexia; extremely thin, weak, and ill because of a serious long-term disease (such as cancer).","zh":"（医学）恶病质的；因严重慢性疾病而极度消瘦、虚弱、病容明显的。"},"examples":[{"en":"The patient looked cachemic after months of treatment.","zh":"经过数月治疗后，这位病人看起来呈恶病质、非常虚弱。"},{"en":"Doctors noted cachemic weight loss and low energy.","zh":"医生记录到恶病质样的体重下降和精力低下。"}]}],"synonyms":["cachectic","emaciated","wasted","gaunt","frail"],"phonetic":"/kəˈkɛmɪk/","extraExplanation":["“cachaemic/cachemic”较少见，临床与学术写作中更常用的词是 **cachectic**（恶病质的）。","词源上与希腊语有关：**kakos**（坏的）+ **hexis**（体质/状态），用来描述长期消耗性疾病导致的全身衰弱与消瘦。","这是偏医学的描述词，日常英语更常用 **very thin / extremely weak / emaciated** 等，但它们不一定包含“疾病导致的消耗状态”这一专业含义。"]}
{"word":"cachalot","summary":{"en":"Cachalot means “sperm whale,” a large deep-diving toothed whale.","zh":"cachalot 指“抹香鲸”，一种能深潜的大型齿鲸。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sperm whale; a large toothed whale known for its huge head and deep diving","zh":"抹香鲸；一种体型巨大的齿鲸，以巨大的头部和深潜能力著称"},"examples":[{"en":"In the novel, the sailors hunted a cachalot for its oil.","zh":"在小说里，水手们捕猎抹香鲸来获取鲸油。"},{"en":"A cachalot can dive very deep to find squid.","zh":"抹香鲸能潜到很深的海里去捕食鱿鱼。"}]}],"synonyms":["sperm whale"],"phonetic":"/ˈkæʃəˌlɑt/","extraExplanation":["“cachalot”是较文学、较旧的英语用词，现代更常说“sperm whale”。它来自法语 *cachalot*，常见于航海故事与捕鲸题材文学（例如19世纪的捕鲸叙事传统）。","“sperm whale”这个常用名源于早期捕鲸者对其头部蜡状物质（spermaceti，鲸蜡）的误解，并不与人类生物学意义上的“sperm（精子）”有关。"]}
{"word":"cachalote","summary":{"en":"“Cachalote” means “sperm whale” (common in Spanish; less common in English).","zh":"“cachalote”指“抹香鲸”（西班牙语常用；英语中较少见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sperm whale (the large toothed whale known for producing ambergris and for having a big, square head)","zh":"抹香鲸（大型齿鲸，以方形大头、会产龙涎香而闻名）"},"examples":[{"en":"In Spanish, “cachalote” usually means “sperm whale.”","zh":"在西班牙语里，“cachalote”通常指“抹香鲸”。"},{"en":"The novel talks about hunting the cachalote on the open sea.","zh":"小说里提到在公海上捕猎抹香鲸。"}]}],"synonyms":["sperm whale","Physeter macrocephalus"],"phonetic":"/ˌkɑːtʃəˈloʊteɪ/","extraExplanation":["“cachalote”主要是西班牙语常用词；英语中更常用的说法是 “sperm whale”。如果你在英文文章里看到 “cachalote”，多半是在西语语境、翻译作品，或与捕鲸历史相关的写作中出现。","文学与文化提示：赫尔曼·梅尔维尔（Herman Melville）的《白鲸》（Moby-Dick）中主要写的是抹香鲸（sperm whale）；在一些西语译本或相关评论里，可能会用到 “cachalote” 来指它。"]}
{"word":"cachalots","summary":{"en":"“Cachalots” means sperm whales (plural).","zh":"“cachalots”指“抹香鲸”（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of cachalot: sperm whales; large toothed whales known for deep diving and producing ambergris.","zh":"cachalot 的复数：抹香鲸；一种大型齿鲸，以深潜闻名，也与“龙涎香”（ambergris）有关。"},"examples":[{"en":"Cachalots can dive for a long time to hunt giant squid.","zh":"抹香鲸能长时间深潜来捕食大王乌贼。"},{"en":"In the documentary, a group of cachalots rested near the surface between dives.","zh":"在纪录片里，一群抹香鲸在两次深潜之间会在水面附近休息。"},{"en":"Scientists study cachalots to learn how they communicate underwater.","zh":"科学家研究抹香鲸，以了解它们如何在水下交流。"}]}],"synonyms":["sperm whales"],"phonetic":"/ˈkæʃəˌlɑts/","extraExplanation":["“cachalot”来自法语，常见于较文学化或较正式的英语语境；日常英语里更常说“sperm whale（抹香鲸）”。","“ambergris（龙涎香）”是一种可能在抹香鲸体内形成的蜡状物，历史上曾用于香水制作；现代多用合成替代品。"]}
{"word":"cachaza","summary":{"en":"Cachaça is a Brazilian sugarcane spirit, best known as the main ingredient in a caipirinha.","zh":"Cachaça（卡沙萨酒）是巴西的甘蔗烈酒，最有名的用法是调制凯匹林纳。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Brazilian distilled spirit made from fermented sugarcane juice, similar to rum; often used in cocktails (especially the caipirinha).","zh":"卡沙萨酒（巴西烈酒）：由发酵的甘蔗汁蒸馏而成，类似朗姆酒；常用于鸡尾酒（尤其是“凯匹林纳”）。"},"examples":[{"en":"He ordered a caipirinha made with cachaça and fresh lime.","zh":"他点了一杯用卡沙萨酒和新鲜青柠做的凯匹林纳。"},{"en":"Cachaça is produced throughout Brazil from sugarcane juice.","zh":"卡沙萨酒在巴西各地用甘蔗汁酿制并蒸馏生产。"}]}],"synonyms":["Brazilian sugarcane spirit","cane spirit"],"phonetic":"/kəˈʃɑːsə/","extraExplanation":["“cachaça”原本带有葡萄牙语的重音符号（ç, á），英语里常写作cachaça，也有人写成不带符号的cachaca；你输入的“cachaza”多半是对“cachaça”的误拼。","卡沙萨酒与朗姆酒的常见区别：卡沙萨多由“新鲜甘蔗汁”发酵蒸馏；很多朗姆酒则来自“糖蜜（molasses）”。","文化小提示：在巴西，cachaça既可做鸡尾酒，也有人纯饮；不同品牌与陈年方式（例如在木桶中熟成）会带来明显风味差异。"]}
{"word":"cache","summary":{"en":"Cache means a temporary store to speed up access (in computing) or a hidden supply of items; it can also be a verb meaning “to store in a cache.”","zh":"cache 指（计算机中的）缓存/临时存储以加快访问，也可指隐藏的储备物；作动词表示“缓存、暂存”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A place (in a computer, browser, or app) where data is stored temporarily so it can be accessed faster later.","zh":"（电脑、浏览器或应用中的）缓存；临时存储区，用来加快之后的访问速度。"},"examples":[{"en":"Clear your browser cache if the page doesn’t update.","zh":"如果网页不更新，清除浏览器缓存。"},{"en":"The app keeps images in a cache to load them quickly.","zh":"这个应用把图片存到缓存里以便快速加载。"}]},{"partOfSpeech":"v.","definition":{"en":"To store data temporarily in a cache so it can be used faster later.","zh":"缓存；把数据临时存入缓存中以便之后更快使用。"},"examples":[{"en":"The browser caches images to speed up loading.","zh":"浏览器会缓存图片来加快加载速度。"},{"en":"This system caches results to reduce server work.","zh":"这个系统会缓存结果以减少服务器的工作量。"}]},{"partOfSpeech":"n.","definition":{"en":"A hidden or stored supply of things (often for later use), such as food, money, or weapons.","zh":"（常为日后使用而）隐藏或储存的一批物品；储藏物（如食物、钱或武器）。"},"examples":[{"en":"They found a cache of food in the basement.","zh":"他们在地下室发现了一批储藏的食物。"},{"en":"Police discovered a cache of illegal weapons.","zh":"警方发现了一批非法武器的藏匿处。"}]}],"synonyms":["store","stash","reserve","buffer","save"],"phonetic":"/kæʃ/","extraExplanation":["“cache”最常见于科技语境，读音接近“cash（现金）”，但含义不同：cash 是钱；cache 是“缓存/藏匿的储备”。","词源来自法语，原意与“隐藏、储藏”有关，所以既可以指现实中的“藏匿物”，也可以指电脑里的“缓存”。"]}
{"word":"cachectic","summary":{"en":"Cachectic describes an extremely thin, weak appearance caused by serious long-term illness; it can also mean “related to cachexia.”","zh":"cachectic 指因严重长期疾病导致的极度消瘦、虚弱的病容，也可指“与恶病质相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Very thin, weak, and ill-looking because of a serious long-term disease (often cancer or advanced chronic illness).","zh":"（因严重的长期疾病，如癌症或晚期慢性病而）极度消瘦、虚弱、病容明显的。"},"examples":[{"en":"The doctor noted that the patient looked cachectic and needed urgent nutritional support.","zh":"医生记录到病人呈现恶病质样消瘦，需要紧急的营养支持。"},{"en":"In advanced cancer, some people become cachectic even if they try to eat.","zh":"在晚期癌症中，有些人即使努力进食也会出现恶病质样的消瘦。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to or caused by cachexia (a wasting condition linked to serious illness).","zh":"与恶病质（cachexia）有关的；由恶病质引起的。"},"examples":[{"en":"The team studied cachectic weight loss and muscle wasting.","zh":"团队研究了与恶病质相关的体重下降和肌肉消耗。"},{"en":"They designed an exercise plan to help reduce cachectic fatigue.","zh":"他们制定了运动方案以帮助减轻恶病质相关的疲劳。"}]}],"synonyms":["emaciated","wasted","gaunt","frail","debilitated"],"phonetic":"/kəˈkek.tɪk/","extraExplanation":["“cachectic”常用于医学语境，语气较正式；日常英语里更常说“very thin and weak”或“severely underweight”。","词源来自希腊语：kakos（坏的）+ hexis（状态），引申为“身体状态很差”。常见搭配：cachectic patient（恶病质病人）、cachectic appearance（恶病质外观）。"]}
{"word":"cachectical","summary":{"en":"Catechetical means ‘related to teaching religious doctrine by question-and-answer (catechism).’","zh":"catechetical 指“与用问答方式教授宗教教义（要理问答）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Usually spelled “catechetical”) relating to teaching religious principles through questions and answers, especially in Christian education (a “catechism”).","zh":"（通常拼作 catechetical）指用“问答式”方式教授宗教教义，尤指基督教的要理问答（catechism）教学。"},"examples":[{"en":"The church offered catechetical classes for new members.","zh":"教会为新成员开设了要理问答（问答式教义）课程。"},{"en":"Her catechetical teaching style used short questions and clear answers.","zh":"她的要理问答式教学风格用简短的问题和清晰的答案来引导。"},{"en":"The book provides catechetical instruction for children.","zh":"这本书为儿童提供要理问答式的宗教教育。"}]}],"synonyms":["doctrinal","instructional","didactic","religious education"],"phonetic":"/ˌkætɪˈkɛtɪkəl/","extraExplanation":["你写的 “cachectical” 不是常见标准拼法；最常见、最可能想表达的是 “catechetical”。","“catechetical” 常见于基督教语境：通过固定问题与答案帮助学习者记忆与理解信仰要点（如教义、祷文、伦理原则）。","在文学或历史文本里，它也可泛指“问答式、循序渐进的教导方式”，但仍带有较强的宗教教育色彩。"]}
{"word":"cached","summary":{"en":"“Cached” means stored in a cache for faster access later, or the act of storing something that way.","zh":"“Cached”指为之后更快访问而被缓存在缓存中；也可指把东西进行缓存的动作。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Stored (usually in a hidden or temporary place) so it can be accessed quickly later; saved in a cache.","zh":"（通常在隐藏或临时的位置）被存储起来，以便之后能更快访问；被缓存在缓存中。"},"examples":[{"en":"The app loads faster because images are cached on your phone.","zh":"因为图片被缓存在手机里，所以这个应用加载更快。"},{"en":"If the page looks wrong, try clearing your cached data.","zh":"如果网页显示不正常，试着清除缓存数据。"}]},{"partOfSpeech":"v.","definition":{"en":"To store something in a cache so it can be used again quickly later.","zh":"把某物存入缓存中，以便之后能更快再次使用。"},"examples":[{"en":"Your browser cached the website’s files to speed up loading next time.","zh":"你的浏览器把网站文件缓存起来，以便下次加载更快。"},{"en":"The system caches results for frequently asked queries.","zh":"系统会把常见查询的结果缓存起来。"}]}],"synonyms":["stored","saved","buffered","kept"],"phonetic":"/kæʃt/","extraExplanation":["在计算机语境里，cache（缓存）通常读作 /kæʃ/，意思是“为加速而临时存放的数据”。因此 cached 常见于：cached images（缓存图片）、cached files（缓存文件）、cached data（缓存数据）。","日常用法中也可指“私藏/藏匿的一批东西”（如 cached weapons），但比起计算机用法更少见。"]}
{"word":"cachemia","summary":{"en":"*Cachemia* is a rare medical noun meaning a general unhealthy condition, especially an abnormal or “bad” state of the blood; it’s mostly historical and often overlaps with *cachexia* in older usage.","zh":"*Cachemia* 是一个罕见的医学名词，指全身不健康状态，尤其是血液的病态或“血液不良”；多为历史用法，旧文献中有时与“恶病质（cachexia）”含义重叠。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical, rare) A general state of ill health or “bad blood,” especially a morbid condition of the blood; sometimes used historically in a way similar to *cachexia* (severe weakness and weight loss caused by chronic disease).","zh":"（医学，罕用）指全身衰弱或“血液状态不良”的病态；在历史用法中有时与 *cachexia*（恶病质：慢性疾病导致的严重消瘦与虚弱）含义相近。"},"examples":[{"en":"The older textbook mentions *cachemia* as a sign of serious chronic disease.","zh":"那本较早的教材提到 *cachemia* 是严重慢性疾病的一个表现。"},{"en":"In modern writing, doctors usually prefer more specific terms than *cachemia*.","zh":"在现代写作中，医生通常更倾向使用比 *cachemia* 更具体的术语。"}]}],"synonyms":["cachexia","anemia (sometimes, depending on context)","poor health (general)"],"phonetic":"/kəˈkiːmiə/","extraExplanation":["这个词在现代英语医学文献中非常少见，更多见于较旧或历史性的写法；也常出现拼写变体 *cachaemia / cacemia* 等。","词源上通常被解释为来自希腊语构词成分，表达“坏/不良（kak-）+ 血（haima）”之意；但在当代临床表达中，一般会改用更明确的诊断词（如 anemia 贫血、sepsis 脓毒症、cachexia 恶病质 等）。"]}
{"word":"cachemic","summary":{"en":"Cachemic (rare; usually cachectic) describes someone who is severely wasted and weak due to chronic disease (cachexia).","zh":"cachemic（罕见，更常用cachectic）指因慢性疾病导致严重消瘦、虚弱的“恶病质”状态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Relating to or affected by severe physical wasting and weakness caused by chronic illness (cachexia); very thin and frail because of disease.","zh":"（医学）与“恶病质/消瘦综合征”（cachexia）有关的；因慢性疾病导致严重消瘦、虚弱的。"},"examples":[{"en":"The doctor noted a cachemic appearance, suggesting advanced chronic illness.","zh":"医生注意到他有恶病质样的外观，提示慢性疾病可能已进展。"},{"en":"In late-stage cancer, some patients become cachemic and lose muscle mass quickly.","zh":"在癌症晚期，一些患者会出现恶病质，肌肉量快速减少。"}]}],"synonyms":["cachectic","emaciated","wasted","gaunt"],"phonetic":"/kəˈkɛktɪk/","extraExplanation":["“cachemic”在现代英语中非常少见，临床与学术写作里更常用的是“cachectic”。两者都源自“cachexia（恶病质）”。","“cachexia/恶病质”通常指严重的体重下降与肌肉消耗，常见于癌症、慢性感染或器官衰竭等疾病，并不等同于单纯“吃得少/营养不良”。"]}
{"word":"cachepot","summary":{"en":"A cachepot is a decorative outer plant pot used to hide a plain inner pot and catch drips.","zh":"cachepot 指用来套住普通内盆的装饰性外盆（套盆），兼具遮挡与接水的作用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a decorative outer pot or container used to hide a plain plant pot (often with drainage holes) and catch any drips","zh":"（常指装饰性的）套盆／花盆外套：用来把普通的种植盆（常有排水孔）放在里面遮挡起来，并接住可能滴下的水"},"examples":[{"en":"She put the orchid in a ceramic cachepot to match the living room decor.","zh":"她把兰花放进一个陶瓷套盆里，好和客厅的装饰风格搭配。"},{"en":"Use a cachepot if your plant’s nursery pot is ugly but you still need drainage.","zh":"如果植物的育苗盆不好看但你又需要排水，就可以用套盆。"}]}],"synonyms":["plant pot cover","decorative planter","outer pot","pot cover"],"phonetic":"/ˈkæʃˌpoʊt/","extraExplanation":["“cachepot”来自法语 *cache-pot*，字面意思是“把花盆藏起来”。在家居与园艺语境中，它通常指“外层装饰盆”，里面再放一个真正种植用、带排水孔的内盆。使用时要注意：外层套盆往往不带排水孔，浇水后要倒掉积水，避免烂根。"]}
{"word":"cachepots","summary":{"en":"Cachepots are decorative outer pots used to hide plain plant pots.","zh":"Cachepots 指用来遮住普通花盆的装饰性外盆（套盆）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a decorative outer pot used to hide an ordinary plant pot (often one with drainage holes); a “cover pot.”","zh":"（套在花盆外面的）装饰性外盆；用于遮住普通内盆（常带排水孔）的“套盆/装饰盆”。"},"examples":[{"en":"She slipped the plastic nursery pot into a white ceramic cachepot.","zh":"她把塑料育苗盆放进一个白色陶瓷套盆里。"},{"en":"Use a cachepot to make mismatched pots look more stylish.","zh":"用套盆可以让不搭的花盆看起来更有质感。"},{"en":"The cachepot has no drainage, so water carefully.","zh":"这个套盆没有排水孔，浇水要小心。"}]}],"synonyms":["cover pot","decorative planter","planter"],"phonetic":"/ˈkæʃˌpoʊ/","extraExplanation":["“cachepot”来自法语 cache-pot，字面意思是“把花盆藏起来”。英语里常写作 cachepot，也可见到带连字符的 cache-pot。","你输入的 “cachepots” 是复数形式；单数是 cachepot。日常园艺里也常用更直白的说法：cover pot / decorative planter。"]}
{"word":"caches","summary":{"en":"“Caches” usually means multiple hidden stores (or saved data), and it can also be the verb form meaning “stores/saves for quick access.”","zh":"“Caches”通常指多个“隐藏的储藏物/缓存”，也可作动词（第三人称单数），表示“（系统/人）把东西藏起来或缓存以便更快使用”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “cache”: hidden stores of things (especially supplies or data kept for quick use later).","zh":"“cache”的复数：隐藏起来的储藏物（尤指备用物资或为更快使用而保存的数据）。"},"examples":[{"en":"Hikers sometimes leave caches of water along the trail.","zh":"徒步者有时会在小径沿途留下一些隐藏的储水点。"},{"en":"Your browser keeps caches so pages load faster next time.","zh":"你的浏览器会保存缓存，让网页下次加载更快。"}]},{"partOfSpeech":"v.","definition":{"en":"third-person singular of “cache”: to store something in a hidden place, or to save data temporarily for faster access.","zh":"“cache”的第三人称单数：把某物藏起来保存；或（计算机）把数据暂存以便更快访问。"},"examples":[{"en":"The app caches images to reduce loading time.","zh":"这个应用会缓存图片来减少加载时间。"},{"en":"A squirrel caches nuts for the winter.","zh":"松鼠会把坚果藏起来储备过冬。"}]}],"synonyms":["stores","stashes","reserves","hidden supplies","saved copies"],"phonetic":"ˈkæʃɪz","extraExplanation":["“cache”来自法语 cacher（意为“隐藏”）。在日常英语里既可指“秘密藏匿的物资”，也常见于科技语境的“缓存”（如 browser cache、memory cache）。读到 caches 时，要结合上下文判断是名词复数（很多个缓存/藏匿点）还是动词（三单：某程序/系统在缓存）。"]}
{"word":"cachespell","summary":{"en":"“Cachespell” is not a standard English word; it’s usually a creative blend meaning either a cache’s time period (tech) or a magic “spell” related to hiding/storing.","zh":"“cachespell”不是标准英语词；多为自造拼合词，可指缓存持续时间（技术语境）或与隐藏/储存有关的魔法“咒语”（文学/游戏语境）。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(not a fixed standard term) a period of time during which data stays stored in a cache before it is refreshed, expires, or is cleared.","zh":"（非固定标准术语）指数据被保存在缓存中的一段时间，之后会被刷新、过期或清除。"},"examples":[{"en":"Set a short cache spell for news pages so readers always see the latest updates.","zh":"给新闻页面设置较短的“缓存时长”，这样读者总能看到最新更新。"},{"en":"If the cache spell is too long, users may keep seeing old prices.","zh":"如果“缓存时长”太长，用户可能一直看到旧价格。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare/creative use) a “spell” (in the sense of magic) related to hiding or storing something, playing on the word cache (“to hide/store”).","zh":"（较少见/带创意的用法）与“隐藏/储存”有关的“魔法咒语”，利用了 cache（隐藏/存储）这一词义的双关。"},"examples":[{"en":"In the story, the wizard cast a cachespell to hide the map from thieves.","zh":"在故事里，巫师施放了一个“隐藏咒”，把地图藏起来不让小偷发现。"}]}],"synonyms":["cache duration","cache lifetime","TTL (time to live)","expiration time"],"phonetic":"/kæʃ spɛl/","extraExplanation":["“cachespell”不是常见的标准英语词条，更像是把 cache（缓存/隐藏起来）和 spell（咒语；一段时间）拼在一起的自造词。","在技术语境里，如果你想表达“缓存持续时间”，更常用的说法是 cache duration / cache lifetime / TTL (time to live) / expiration time。","如果你是在某个游戏、小说、软件项目里看到的专有名词，含义可能由该作品/项目的设定决定。"]}
{"word":"cachet","summary":{"en":"Cachet most commonly means prestige or special status; it can also mean an official seal or stamp (and, less commonly, a medicine wafer).","zh":"cachet 最常指“声望/光环”；也可指“官方印章/戳记”（较少见还可指旧式“药囊/药片薄膜”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Prestige, special status, or an admired quality that makes someone or something seem important or attractive.","zh":"声望；威望；（使人或事物显得更重要、更有吸引力的）特殊地位/光环。"},"examples":[{"en":"The award gave the small film festival new cachet.","zh":"这个奖项为这个小型电影节增添了新的声望。"},{"en":"There’s a certain cachet to studying at a famous university.","zh":"在名校学习会带来一种特别的光环/身份感。"}]},{"partOfSpeech":"n.","definition":{"en":"An official seal or stamp, especially one used to mark documents as authentic.","zh":"（尤指用于证明文件真实有效的）官方印章；戳记。"},"examples":[{"en":"The document carried the embassy’s cachet.","zh":"这份文件上盖有大使馆的印章。"},{"en":"Without the cachet, the letter wasn’t considered official.","zh":"没有盖章，这封信就不被视为正式文件。"}]},{"partOfSpeech":"n.","definition":{"en":"A small wafer or capsule used to contain a dose of medicine (less common today).","zh":"（较少见）盛装药剂用的薄片/药囊（旧式用法）。"},"examples":[{"en":"In older texts, medicine may be described as being given in a cachet.","zh":"在较老的文献中，药物可能被描述为用“cachet（药囊）”给药。"}]}],"synonyms":["prestige","status","esteem","distinction","cachet (seal sense): seal","stamp","imprimatur"],"phonetic":"/kæˈʃeɪ/","extraExplanation":["词源来自法语 cachet，原意与“印章/盖印”有关，因此它既可指“印章”，也引申出“带来权威与体面感的声望/光环”。","常见搭配：a certain cachet（某种光环/体面）、lend/give cachet to...（为……增添声望）、have cachet（有面子/有分量）。注意它更偏“社会评价与形象”，不等同于“cash（现金）”。"]}
{"word":"cacheted","summary":{"en":"Cacheted means sealed/stamped with an official seal, or (by extension) given prestige or high-status approval.","zh":"cacheted 指“盖有官方印章的”，也可引申为“带有声望背书的/显得高档的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"sealed or stamped with an official seal (a “cachet”).","zh":"（文件、信件等）盖有官方印章的；用印封好的。"},"examples":[{"en":"The letter arrived cacheted with the embassy’s seal.","zh":"这封信寄到时盖着大使馆的印章。"},{"en":"A cacheted envelope usually suggests the contents are official or formal.","zh":"盖有印章的信封通常暗示内容是官方或正式的。"}]},{"partOfSpeech":"adj.","definition":{"en":"having a special prestige or “stamp of approval”; seen as high-status.","zh":"带有声望的；被视为“有背书/有格调”的。"},"examples":[{"en":"Dining at that restaurant feels cacheted—people see it as a status symbol.","zh":"在那家餐厅用餐给人一种“有面子”的感觉——人们把它当作身份象征。"},{"en":"The award cacheted the young writer’s career overnight.","zh":"这个奖项让这位年轻作家的职业生涯一夜之间增添了声望。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of the verb “cachet”: to mark something with a seal, or (less commonly) to give it prestige.","zh":"动词 cachet 的过去式/过去分词：在……上盖章；（不太常见）使……增添声望。"},"examples":[{"en":"The documents were cacheted before being filed.","zh":"这些文件盖章后才归档。"}]}],"synonyms":["sealed","stamped","endorsed","prestigious","high-status"],"phonetic":"/kæˈʃeɪtɪd/","extraExplanation":["“cachet”来自法语，原意和“印章/封印”有关；现代英语里更常见的名词用法是“声望、名气、格调”。因此 cacheted 既可能指“盖章的”，也可引申为“带有声望加持的”。","在当代日常英语中，“cacheted”本身不算常用；更常见的是名词 cachet（e.g., have cachet）或形容词形式 “stamped/endorsed/prestigious”。"]}
{"word":"cachetic","summary":{"en":"Cachectic means showing or relating to severe wasting and weakness from serious illness (cachexia).","zh":"cachectic 指与恶病质有关或呈现恶病质的（因重病导致严重消瘦与虚弱）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Relating to or affected by cachexia (severe weight loss, muscle wasting, and weakness, often due to serious illness such as cancer).","zh":"（医学）与“恶病质”（严重消瘦、肌肉萎缩与虚弱，常由癌症等重病引起）有关的；患恶病质的。"},"examples":[{"en":"The patient looked cachectic after months of chemotherapy.","zh":"经过数月化疗后，这位病人看起来有恶病质表现。"},{"en":"Doctors noted cachectic features, including marked weight loss and fatigue.","zh":"医生记录了恶病质特征，包括明显体重下降和疲劳。"}]}],"synonyms":["emaciated","wasted","malnourished"],"phonetic":"/kəˈkɛk.tɪk/","extraExplanation":["你输入的“cachetic”在英语里更常见的标准拼写是 **cachectic**（形容词）。在医学语境中，它用来描述“由于严重慢性疾病导致的消耗性状态”，因此多见于病历记录、医学论文。","词源上与希腊语中表示“坏的（kakos）+ 状态（hexis）”有关，强调“身体状态变差、被消耗”。日常英语里不常用，通常由医生或医学文本使用。"]}
{"word":"cacheting","summary":{"en":"“Cacheting” is uncommon; in stamp collecting it means adding a cachet design/mark to an envelope, but many people use it by mistake when they mean “caching” in computing.","zh":"“Cacheting”不常见；在集邮中可指在信封上加盖/印制纪念戳图案，但很多情况下它其实是把计算机里的“caching（缓存）”拼错了。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Uncommon, specialized) The act of adding a “cachet” (a special stamped or printed design/mark) to an envelope, especially a first-day cover in stamp collecting.","zh":"（不常见，专门用语）给信封（尤其是集邮中的首日封）加盖/印上“纪念戳图案（cachet）”的行为。"},"examples":[{"en":"The collector spent the afternoon cacheting first-day covers for the new stamp issue.","zh":"这位收藏家花了一下午给新发行邮票的首日封加盖纪念戳图案。"},{"en":"Some clubs offer cacheting services for members.","zh":"有些集邮俱乐部为会员提供首日封加盖纪念戳图案的服务。"}]},{"partOfSpeech":"other","definition":{"en":"Often a misspelling of “caching” (storing data temporarily to make a system faster).","zh":"常见为“caching”的拼写错误（指暂存数据以加快系统运行）。"},"examples":[{"en":"If you mean website speed, you probably want caching, not cacheting.","zh":"如果你说的是网站速度，你很可能想表达的是 caching，而不是 cacheting。"},{"en":"Try clearing the browser cache if caching causes problems.","zh":"如果缓存（caching）导致问题，可以尝试清理浏览器缓存。"}]}],"synonyms":["stamping","marking","decorating (a cover)","adding a cachet"],"phonetic":"/kæˈʃeɪtɪŋ/","extraExplanation":["“cachet”原本来自法语，常指“声望/影响力”，但在集邮语境中指信封上的纪念图案或特别戳记（尤其是首日封上的设计）。因此“cacheting”在集邮圈里可理解为“给首日封加盖/印制纪念戳图案”的动作。","在一般计算机语境里，正确且常用的词是“caching”（缓存），而不是“cacheting”。如果你告诉我你看到它的句子/场景（集邮还是电脑），我可以帮你确定最准确的意思。"]}
{"word":"cachets","summary":{"en":"“Cachets” is the plural of “cachet,” meaning either prestige/status or an official seal/mark (and, less commonly, a medicinal wafer).","zh":"“cachets”是“cachet”的复数，常指“声望/地位”，也可指“官方印章/封印”（较少见还可指“药封”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"prestige, special status, or the respect that makes something seem more valuable or desirable","zh":"声望；威望；“加分”的地位（使某事物更显得有价值或更受欢迎的名望）"},"examples":[{"en":"The university’s name adds cachet to his résumé.","zh":"这所大学的名气为他的简历增添了光彩。"},{"en":"Buying local art gave the hotel a sense of cultural cachet.","zh":"购买本地艺术品让这家酒店更有文化格调和声望。"}]},{"partOfSpeech":"n.","definition":{"en":"an official mark, seal, or stamp (sometimes a wax seal) used to show approval or authenticity","zh":"（官方的）印记；印章；封印（有时指蜡封，用来表示认可或真伪）"},"examples":[{"en":"The document carried the royal cachet.","zh":"这份文件带有王室的印章。"},{"en":"Collectors look for a cachet on first-day covers.","zh":"集邮者会寻找首日封上的纪念戳（cachet）。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a thin wafer used to enclose a dose of medicine for swallowing","zh":"（较少见）药封；可吞服的薄片（用来包住一剂药粉）"},"examples":[{"en":"In older medical texts, powders were sometimes given in cachets.","zh":"在较早的医学文献中，药粉有时会装在药封（cachet）里服用。"}]}],"synonyms":["prestige","status","distinction","recognition","seal","stamp","mark"],"phonetic":"/kæˈʃeɪ/","extraExplanation":["“cachets”是“cachet”的复数。现代英语里更常用的是“prestige/status（声望、地位）”这一义；“印章/封印”的义多见于历史、法律或集邮语境。","该词源自法语，发音也保留法语风格（结尾不读t），所以读作 /kæˈʃeɪ/。"]}
{"word":"cachexia","summary":{"en":"Cachexia is a severe illness-related wasting syndrome with major weight and muscle loss.","zh":"Cachexia 指与严重疾病相关的消耗性综合征，典型表现为明显体重下降和肌肉流失。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a serious medical condition involving extreme weight loss, muscle wasting, and weakness, often caused by chronic illnesses such as cancer, heart failure, or advanced infections","zh":"恶病质；一种严重的医学状态，表现为极度消瘦、肌肉萎缩和虚弱，常由癌症、心力衰竭或晚期感染等慢性疾病引起"},"examples":[{"en":"The doctor explained that the patient’s rapid weight loss was due to cachexia related to advanced cancer.","zh":"医生解释说，患者体重迅速下降是由于晚期癌症相关的恶病质。"},{"en":"Unlike ordinary dieting, cachexia can occur even when a person is eating enough.","zh":"不同于普通节食，即使摄入足够食物，恶病质也可能发生。"},{"en":"Treating cachexia often requires addressing the underlying disease as well as nutrition and physical support.","zh":"治疗恶病质通常需要在营养和身体支持之外，同时处理其根本疾病。"}]}],"synonyms":["wasting syndrome","muscle wasting","severe weight loss (medical context)"],"phonetic":"/kəˈkɛk.si.ə/","extraExplanation":["词源来自希腊语：kakos（“坏的、糟的”）+ hexis（“身体状态”），字面有“糟糕的体质/状态”之意。","恶病质不只是“变瘦”，关键是肌肉和脂肪被持续分解、体力下降；单纯增加热量往往无法完全逆转，需要综合治疗（例如控制炎症、改善基础病、营养与运动支持等）。"]}
{"word":"cachexias","summary":{"en":"Cachexia (plural: cachexias) is severe wasting and weakness caused by serious chronic disease.","zh":"Cachexia（复数：cachexias）指由严重慢性疾病引起的明显消瘦、肌肉萎缩与虚弱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a serious medical condition involving extreme weight loss, muscle wasting, and weakness, often caused by chronic illnesses such as cancer, heart failure, or advanced infections","zh":"恶病质；一种严重的医学状态，表现为明显消瘦、肌肉萎缩和虚弱，常由癌症、心衰或严重慢性感染等疾病引起"},"examples":[{"en":"The doctor noted signs of cachexia in the patient with advanced cancer.","zh":"医生在这位晚期癌症患者身上观察到了恶病质的迹象。"},{"en":"Cachexia can make people feel weak even if they try to eat more.","zh":"即使努力多吃，恶病质也可能让人依然感到虚弱。"}]}],"synonyms":["wasting syndrome","severe wasting"],"phonetic":"/kəˈkɛksiə/","extraExplanation":["你输入的“cachexias”是“cachexia”的复数形式，意思是“多种/多例恶病质（的情况）”。日常英语里更常用单数“cachexia”，复数多见于医学论文或统计描述（如不同患者或不同病例）。","词源来自希腊语：kakos（坏的）+ hexis（体质/状态），带有“身体状态很差”的含义。","医学上，恶病质不只是“吃得少导致变瘦”，而是一种复杂的代谢与炎症相关状态；因此单纯增加热量摄入往往无法完全逆转。"]}
{"word":"cachexic","summary":{"en":"Cachectic describes extreme thinness and weakness caused by serious chronic illness (cachexia).","zh":"Cachectic 指因严重慢性疾病导致的极度消瘦与虚弱（恶病质）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Extremely weak, thin, and ill-looking because of a serious long-term disease (showing cachexia).","zh":"因严重慢性疾病而极度消瘦、虚弱、病容明显的（出现“恶病质”状态）。"},"examples":[{"en":"The patient appeared cachectic after months of cancer treatment.","zh":"这位病人在接受数月癌症治疗后看起来呈恶病质状态。"},{"en":"Doctors noted cachectic muscle loss and severe fatigue.","zh":"医生记录到恶病质相关的肌肉流失和严重疲劳。"}]}],"synonyms":["emaciated","wasted","gaunt","frail"],"phonetic":"/kəˈkɛk.tɪk/","extraExplanation":["你输入的“cachexic”通常是拼写误差；标准拼写多为 **cachectic**（形容词），对应名词 **cachexia**（恶病质）。","这是医学语境中较正式的词，常用于描述癌症、艾滋病、严重慢性心衰/肾病等导致的体重下降与肌肉消耗；日常英语里更常用的说法是 “very thin/weak from illness（因病很瘦很虚弱）”。","词源来自希腊语，含义接近“坏的体质/状态”；在文学或新闻中出现时，通常用来强调疾病带来的显著消耗与衰弱。"]}
{"word":"cachexies","summary":{"en":"Cachexia is severe illness-related wasting (weight and muscle loss).","zh":"Cachexia 指与严重疾病相关的消耗性消瘦（体重和肌肉流失）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) a condition of severe weight loss, muscle wasting, and weakness, often caused by serious illness such as cancer, advanced infections, or chronic disease.","zh":"（医学）恶病质：一种严重消瘦、肌肉萎缩和虚弱的状态，常由癌症、晚期感染或慢性疾病等严重疾病引起。"},"examples":[{"en":"The doctor explained that the patient’s extreme weight loss was due to cachexia.","zh":"医生解释说，病人极度消瘦是由恶病质引起的。"},{"en":"Cancer-related cachexia can make everyday activities difficult.","zh":"与癌症相关的恶病质会让日常活动变得困难。"}]}],"synonyms":["wasting syndrome","severe wasting","physical wasting"],"phonetic":"/kəˈkɛksiə/","extraExplanation":["你输入的“cachexies”很可能是拼写误差；常见拼法是“cachexia”（单数）和“cachexias”或“cachexiae”（复数，较少见且更偏学术）。","词源来自希腊语：kakos（坏的）+ hexis（状态/体质），字面意思类似“糟糕的身体状态”。","在医学语境中，它不只是“吃得少导致的变瘦”，而是一种复杂的代谢与炎症相关综合征，往往需要医疗评估与综合处理。"]}
{"word":"cachexy","summary":{"en":"“cachexy” is not standard English; it likely refers to “cache” (temporary storage for faster access).","zh":"“cachexy”不是标准英语；很可能指“cache”（缓存/临时存储，用于更快访问）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “cache” or a name/handle used in a specific app, game, or project.","zh":"不是标准英语单词。很可能是把“cache（缓存/隐藏储藏）”拼错了，或是在某个应用、游戏、项目中的名称/账号/变量名。"},"examples":[{"en":"I can’t find “cachexy” in a dictionary—did you mean “cache”?","zh":"我在词典里找不到“cachexy”——你是想写“cache”吗？"},{"en":"If “cachexy” is a username or product name, it may not have a fixed dictionary meaning.","zh":"如果“cachexy”是用户名或产品名，它可能没有固定的词典释义。"}]},{"partOfSpeech":"n.","definition":{"en":"(Suggested word) cache: a place or collection where things are stored for quick use later, especially in computers (temporary data storage).","zh":"（可能你想写的词）cache：为了之后快速使用而存放东西的地方或集合；尤指计算机中的“缓存”（临时数据存储）。"},"examples":[{"en":"Clear your browser cache to fix the loading problem.","zh":"清理浏览器缓存来解决加载问题。"},{"en":"The app keeps images in a cache so pages open faster.","zh":"这个应用把图片放进缓存里，所以页面打开更快。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Suggested word) cache: to store data temporarily so it can be accessed faster later.","zh":"（可能你想写的词）cache：把数据临时存储起来，以便之后更快访问。"},"examples":[{"en":"The system caches recent searches.","zh":"系统会缓存最近的搜索记录。"},{"en":"We cache the results to reduce server load.","zh":"我们把结果缓存起来以减少服务器负载。"}]}],"synonyms":["buffer","store","stash","temporary storage"],"phonetic":"/kæʃ/","extraExplanation":["“cache”在科技语境里非常常见，读作 /kæʃ/，和“cash（现金）”发音相同，但意思不同。","如果你能告诉我“cachexy”出现在哪里（比如一句话、软件界面、报错信息、游戏任务名），我可以更准确判断它是不是专有名词、用户名，还是拼写错误。"]}
{"word":"cachibou","summary":{"en":"“Cachibou” is likely a misspelling of “caribou,” a large northern deer (reindeer in Europe).","zh":"“cachibou”很可能是“caribou”的误拼，指生活在寒冷地区的大型鹿（欧洲常称驯鹿）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Also spelled “caribou”) a large deer that lives in northern regions of North America, Europe, and Asia; in Europe it is usually called a reindeer.","zh":"（也拼作“caribou”）一种生活在北半球寒冷地区的大型鹿；在欧洲通常称为“reindeer（驯鹿）”。"},"examples":[{"en":"Caribou migrate long distances to find food.","zh":"北美驯鹿会长距离迁徙来寻找食物。"},{"en":"In Canada, caribou are an important symbol of the Arctic and subarctic.","zh":"在加拿大，北美驯鹿是北极与亚北极地区的重要象征。"}]}],"synonyms":["caribou","reindeer"],"phonetic":"/ˈkærəˌbuː/","extraExplanation":["“cachibou”不是常见的标准英语拼写；你很可能想写的是 **caribou**（北美驯鹿）。在欧洲语境里更常说 **reindeer**。","词源上，caribou 来自北美原住民语言（如米克马克语等）对这种动物的称呼，经法语/英语传播。"]}
{"word":"cachila","summary":{"en":"“Cachila” is mainly Rioplatense Spanish slang meaning either an old man or an old beat-up car; it’s not a common English word.","zh":"“cachila”主要是拉普拉塔河地区西语俚语，可指“老先生/老人”或“破旧的车”；在英语里并不常见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish—Rioplatense slang, not standard English) an old person, especially an old man.","zh":"（西班牙语—拉普拉塔河地区俚语，非标准英语）老人，尤指老先生。"},"examples":[{"en":"In Argentine Spanish, “cachila” can mean an old man.","zh":"在阿根廷西班牙语里，“cachila”可以指一位老先生。"},{"en":"Don’t call someone “cachila” unless you’re sure it won’t offend them.","zh":"除非确定对方不介意，否则别用“cachila”称呼别人。"}]},{"partOfSpeech":"n.","definition":{"en":"(Spanish slang) an old, worn-out car; a “jalopy.”","zh":"（西班牙语俚语）破旧的车；老爷车（偏“破车”的意思）。"},"examples":[{"en":"He still drives that cachila to work every day.","zh":"他每天还开那辆破车去上班。"},{"en":"They fixed up an old cachila and sold it.","zh":"他们把一辆旧破车修了修就卖掉了。"}]}],"synonyms":["old-timer","geezer (informal)","jalopy (for the car meaning)"],"phonetic":"/kɑˈtʃilɑ/","extraExplanation":["“Cachila”多见于阿根廷、乌拉圭等拉普拉塔河流域的口语/俚语（常被归入 lunfardo 体系）。在语气上可能带调侃甚至轻微贬义，是否失礼取决于关系与场合。","如果你是在英文语境里看到“cachila”，它很可能是人名/昵称/品牌名或直接借用的西语词。给我一句原文我可以帮你更准确判断。"]}
{"word":"cachimailla","summary":{"en":"“Cachimailla” is not standard English; it’s likely a proper name used in Spanish-language contexts.","zh":"“Cachimailla”不是标准英语词；更可能是西语语境中的专有名词（人名/地名）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. “Cachimailla” most often appears as a proper name (a surname or place name) in Spanish-speaking contexts, so its meaning depends on the specific person/region.","zh":"不是标准英语词。“cachimailla”多见于西语语境中的专有名词（姓氏或地名），具体含义取决于所指的人或地区。"},"examples":[{"en":"I couldn’t find an English dictionary entry for “Cachimailla”; it may be a family name.","zh":"我在英语词典里找不到“Cachimailla”的词条；它可能是一个姓氏。"},{"en":"Cachimailla is written with a capital letter here, so it likely refers to a name.","zh":"这里“Cachimailla”首字母大写，所以很可能指的是一个名字。"}]}],"phonetic":"/ˌkɑːtʃɪˈmaɪjə/","extraExplanation":["这个词不像常见英语词汇，更像西班牙语/本地语言（如安第斯地区语言）的音译或拼写变体。若你能提供出现的国家/地区、原句（上下文）、是否为人名/地名，我可以更准确判断含义、词源与更自然的英文表达方式。"]}
{"word":"cachina","summary":{"en":"Cachina (more often spelled kachina/katsina) refers to a Pueblo spirit being, and by extension the dancer or doll representing that spirit.","zh":"Cachina（更常写作 kachina/katsina）指普韦布洛文化中的神灵，也可指扮演该神灵的舞者或其雕刻娃娃。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Hopi and some other Pueblo cultures) a spirit being connected with nature, ancestors, or community life; also the masked dancer who represents that spirit in ceremonies, or a carved doll made to teach children about the spirits.","zh":"（霍皮族及部分普韦布洛文化中）与自然、祖先或社群生活相关的灵体；也可指在仪式中扮演该灵体的戴面具舞者；或指用于教导儿童认识这些灵体的木雕娃娃。"},"examples":[{"en":"The museum displayed cachina dolls with notes explaining their meanings.","zh":"博物馆展出了卡奇纳（神灵）娃娃，并附有说明解释其含义。"},{"en":"In some ceremonies, dancers wear masks to represent a cachina.","zh":"在一些仪式中，舞者会戴上面具来扮演一位卡奇纳神灵。"},{"en":"Please learn the cultural context before buying a “cachina” figure as a souvenir.","zh":"在把“卡奇纳”雕像当作纪念品购买前，请先了解其文化背景。"}]}],"synonyms":["kachina","katsina"],"phonetic":"/kəˈtʃiːnə/","extraExplanation":["“cachina”更常见的英文拼写是 **kachina** 或 **katsina**；不同拼写反映了不同的转写方式。","在美国西南部原住民文化中，Kachina/Katsina 属于具有宗教与社群意义的概念。学习或谈论时，建议使用尊重的语气，并注意有些仪式细节并不适合随意模仿或商业化。"]}
{"word":"cachinate","summary":{"en":"Cachinate means to laugh loudly and uncontrollably, often in a harsh or rude-sounding way.","zh":"cachinate 指放声、失控地大笑，常带粗哑或略显不礼貌的感觉。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to laugh loudly, often in a harsh, uncontrolled, or slightly rude way","zh":"（常指放声、粗哑或有点失控地）大笑；咯咯大笑"},"examples":[{"en":"When he heard the joke, he cachinated so loudly that people turned around.","zh":"他听到那个笑话后放声大笑，声音大到大家都回头看。"},{"en":"She tried to stay quiet, but a sudden cachinate escaped in the library.","zh":"她想保持安静，但在图书馆里还是忍不住突然大笑出声。"}]},{"partOfSpeech":"vi.","definition":{"en":"to make a loud laughing sound; to cackle (less common)","zh":"发出大笑声；咯咯笑（较少见用法）"},"examples":[{"en":"From the next room, we could hear someone cachinating at the TV show.","zh":"从隔壁房间我们能听到有人看电视节目时咯咯大笑。"}]}],"synonyms":["laugh loudly","burst out laughing","cackle","guffaw"],"phonetic":"/ˈkækəˌneɪt/","extraExplanation":["这个词比较书面、偏文学/幽默用法，日常口语更常说 laugh loudly / burst out laughing / cackle。","词源来自拉丁语 cachinnare（大笑、狂笑），因此常带有“笑得很夸张、放纵”的感觉；有时也会暗示这种笑声不太礼貌或有点刺耳。"]}
{"word":"caching","summary":{"en":"Caching is storing data temporarily so it can be loaded or used faster next time.","zh":"Caching 指把数据暂时存入缓存，以便下次更快加载或使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of storing data temporarily so it can be accessed faster next time","zh":"（为加速下次访问而进行的）缓存；把数据暂存起来的做法"},"examples":[{"en":"Caching speeds up the website by saving frequently used files.","zh":"缓存通过保存常用文件来加快网站速度。"},{"en":"Your browser uses caching to load pages more quickly.","zh":"你的浏览器会使用缓存来更快加载网页。"}]},{"partOfSpeech":"n.","definition":{"en":"the process of hiding or storing something for later use (less common in everyday English; more common as “cache”/“caching” in tech)","zh":"（较少见）把东西藏起来或储存起来以备后用（更常见于科技语境中的“cache/缓存”）"},"examples":[{"en":"The hikers talked about caching extra water along the trail.","zh":"徒步者谈到沿途把多余的水藏起来备用。"}]},{"partOfSpeech":"v.","definition":{"en":"to store data in a cache so it can be retrieved more quickly later","zh":"（把数据）缓存起来；存入缓存以便之后更快读取"},"examples":[{"en":"The app is caching images to reduce loading time.","zh":"这个应用正在缓存图片以减少加载时间。"},{"en":"If the page looks wrong, try clearing data the browser has cached.","zh":"如果页面显示不正常，试试清除浏览器已缓存的数据。"}]}],"synonyms":["memoization","temporary storage","buffering"],"phonetic":"/ˈkæʃɪŋ/","extraExplanation":["在计算机里，cache（缓存）可以理解为“离你更近、更快但容量更小”的临时存放处，用来减少重复下载/重复计算。常见类型有：浏览器缓存、CPU 缓存、CDN 缓存。","学习提示：cache 作名词是“缓存/缓存数据”，作动词是“缓存（起来）”；英式拼写与美式拼写相同。发音上常与“cash（现金）”相近，但含义不同。"]}
{"word":"cachinnate","summary":{"en":"Cachinnate means to laugh loudly and wildly, often in a harsh or mocking way.","zh":"cachinnate 指放声大笑、笑得很夸张，常带刺耳或嘲讽的语气。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to laugh loudly and uncontrollably, often in a harsh or raucous way","zh":"放声大笑；大笑不止（常带刺耳、喧闹的感觉）"},"examples":[{"en":"When he heard the silly joke, he began to cachinnate in the back of the room.","zh":"他听到那个傻笑话后，在教室后排开始放声大笑。"},{"en":"A few people cachinnated at her mistake, which made her feel embarrassed.","zh":"有几个人对她的失误哄笑，让她很尴尬。"}]}],"synonyms":["cackle","guffaw","howl with laughter","snicker (less loud)"],"phonetic":"/ˈkækɪneɪt/","extraExplanation":["词源来自拉丁语 *cachinnare*，意思是“哈哈大笑”。这个词在现代英语里比较少见，语感偏书面、带一点文学色彩。","它和常见的 **laugh** 不同：**cachinnate** 常暗示笑声“很大、很放肆、甚至有点刺耳或嘲讽”，因此用在描写人物态度时更有画面感。"]}
{"word":"cachinnated","summary":{"en":"“Cachinnated” means “laughed loudly and uncontrollably,” and it’s a formal/literary word.","zh":"“cachinnated”意为“放声大笑/狂笑”，属于较正式或文学化用词。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"laughed loudly and uncontrollably (often in a harsh or boisterous way).","zh":"（常指放声、难以控制地）大笑；狂笑（有时带刺耳或喧闹的感觉）。"},"examples":[{"en":"When the comedian slipped on purpose, the audience cachinnated.","zh":"喜剧演员故意滑了一跤，观众们放声大笑。"},{"en":"They cachinnated at his mistake, which made him feel embarrassed.","zh":"他们对他的失误狂笑，让他觉得很尴尬。"}]}],"synonyms":["guffawed","howled with laughter","roared with laughter","cackled","burst out laughing"],"phonetic":"/ˈkækɪneɪtɪd/","extraExplanation":["“cachinnated”是动词“cachinnate”的过去式/过去分词，比较书面、带点文学色彩；日常更常说“laughed loudly / burst out laughing”。","词源来自拉丁语“cachinnare”（大笑、咯咯笑），因此这个词常用来描写夸张、爆发式的笑声，语气可能偏嘲笑或不礼貌，具体取决于上下文。"]}
{"word":"cachinnating","summary":{"en":"Cachinnating means laughing loudly and uncontrollably (the -ing form of cachinnate).","zh":"cachinnating 指放声大笑、止不住地大笑（cachinnate 的 -ing 形式）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"laugh loudly and uncontrollably (often in a harsh, noisy way); “cachinnating” is the -ing form of the verb “cachinnate.”","zh":"放声大笑、止不住地大笑（常带有刺耳、喧闹的感觉）；“cachinnating”是动词“cachinnate”的 -ing 形式。"},"examples":[{"en":"Someone told a terrible pun, and he started cachinnating in the back row.","zh":"有人讲了个很烂的双关笑话，他却在后排开始放声大笑。"},{"en":"The villain’s cachinnating filled the empty hall.","zh":"反派那刺耳的大笑声充满了空荡的大厅。"},{"en":"She tried to stay serious, but ended up cachinnating at her friend’s imitation.","zh":"她努力保持严肃，但还是被朋友的模仿逗得大笑起来。"}]}],"synonyms":["guffawing","cackling","roaring with laughter","howling with laughter"],"phonetic":"/ˈkækɪˌneɪtɪŋ/","extraExplanation":["“cachinnate”来自拉丁语“cachinnare”（大笑、咯咯大笑），在英语里属于比较书面、偏文学的用词，常用来描写带有夸张、尖厉或令人不适的笑声。","语气上通常不是温和的“giggle（咯咯笑）”，更接近“cackle（咯咯怪笑/像母鸡的笑）”或“guffaw（哄堂大笑）”。"]}
{"word":"cachinnation","summary":{"en":"Cachinnation means loud, uncontrolled laughter.","zh":"cachinnation 指放声、失控的大笑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Loud, uncontrolled laughter, often harsh or snorting in sound.","zh":"（通常指声音粗厉、带喷鼻声的）大笑，放声狂笑。"},"examples":[{"en":"His cachinnation echoed through the hallway after the joke.","zh":"听完那个笑话后，他的狂笑声在走廊里回荡。"},{"en":"The lecture was interrupted by a sudden burst of cachinnation from the back row.","zh":"讲座被后排突然爆发的一阵大笑打断了。"}]}],"synonyms":["laughter","cackling","guffaw","roaring laughter"],"phonetic":"/ˌkækɪˈneɪʃən/","extraExplanation":["这个词比较书面、偏文学或幽默夸张的用法，在日常口语里更常说 loud laughter / cackling / roaring laughter。","词源来自拉丁语 cachinnare（大笑），因此常用来描写一种“控制不住、很有画面感”的笑声。写作中用它能让语气更生动，但会显得较正式或刻意。"]}
{"word":"cachinnator","summary":{"en":"A rare word meaning “a person who laughs loudly.”","zh":"一个较少见的词，意思是“笑得很大声的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who laughs loudly or makes a loud, harsh laugh","zh":"大笑者；爆笑的人；发出响亮（有时略刺耳）笑声的人"},"examples":[{"en":"He’s a real cachinnator—once he starts laughing, everyone hears it.","zh":"他真是个大笑者——一旦笑起来，大家都听得到。"},{"en":"The quiet meeting turned chaotic when a cachinnator burst out at the joke.","zh":"原本安静的会议因为有人突然爆笑而变得有点失控。"}]}],"synonyms":["loud laugher","guffawer","chuckler"],"phonetic":"/ˈkækɪneɪtər/","extraExplanation":["这是一个非常少见、偏书面且带点幽默感的词，日常更常说：\"someone who laughs a lot\"、\"a loud laugher\"。","词源来自拉丁语 *cachinnare*（大笑、咯咯笑）。在写作里用它，常有“用高级/古怪词来开玩笑”的效果。"]}
{"word":"cachinnatory","summary":{"en":"Cachinnatory means “connected with loud, uncontrollable laughter.”","zh":"cachinnatory 指“与放声大笑、爆笑有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to loud, often uncontrollable laughter (like a big, noisy giggle).","zh":"与大笑、爆笑有关的；形容笑声很大、常常难以控制。"},"examples":[{"en":"The comedian’s joke set off cachinnatory laughter across the room.","zh":"喜剧演员的笑话引发了满屋子的爆笑。"},{"en":"Her cachinnatory response made it impossible to keep the meeting serious.","zh":"她那种爆笑的反应让会议完全严肃不起来。"}]}],"synonyms":["hilarious (context-dependent)","laughing","guffawing","boisterous (laughter)"],"phonetic":"/ˌkækəˈnɔːtɔːri/","extraExplanation":["这个词比较书面、偏少见，常见于描写或学术语境，用来强调“笑声很大、很放开”。日常口语更常说 loud laughter / burst out laughing / crack up。","词源来自拉丁语 cachinnare，意思是“放声大笑”。因此它通常带有“哈哈大笑、笑到停不下来”的画面感。"]}
{"word":"cachoeira","summary":{"en":"“Cachoeira” is a Portuguese word meaning “waterfall,” often used in English contexts about Brazil.","zh":"“Cachoeira”是葡语词，意思是“瀑布”，在英语中多用于谈论巴西相关语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Portuguese, especially Brazilian Portuguese) a waterfall; also used in English when talking about Brazil.","zh":"（葡语，尤指巴西葡语）瀑布；在英语中常用于谈论巴西时指“瀑布”。"},"examples":[{"en":"We stopped to swim near a cachoeira in Bahia.","zh":"我们在巴伊亚州的一处瀑布（cachoeira）附近停下来游泳。"},{"en":"The trail ends at a cachoeira with a natural pool.","zh":"这条小径的尽头是一处带天然水潭的瀑布（cachoeira）。"}]}],"synonyms":["waterfall","cascade"],"phonetic":"/ˌkɑːʃoʊˈɛrə/","extraExplanation":["“Cachoeira”主要是葡萄牙语词，在英语旅行写作、自然纪录片或介绍巴西地名/景点时常被保留原词，以突出当地语境。","巴西有些城镇或景点名称也包含该词（例如某地名含 Cachoeira），意思通常与附近的瀑布或急流有关。"]}
{"word":"cacholong","summary":{"en":"Cacholong is an opaque, milky-white type of opal used as a gemstone.","zh":"cacholong 指一种不透明的乳白色蛋白石，用作宝石材料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of opaque, milky-white opal (a gemstone) with a porcelain-like look; often used for carvings or beads","zh":"一种不透明、乳白色的蛋白石（宝石），外观像瓷器；常用于雕刻或制作珠子"},"examples":[{"en":"The pendant was carved from cacholong, giving it a soft, porcelain-white shine.","zh":"这枚吊坠是用白蛋白石雕刻的，呈现出柔和的瓷白光泽。"},{"en":"In the gem shop, cacholong was displayed beside other kinds of opal.","zh":"在宝石店里，白蛋白石与其他种类的蛋白石一起陈列。"}]}],"synonyms":["opal","common opal","milky opal"],"phonetic":"/ˈkæʃəˌlɔŋ/","extraExplanation":["“cacholong”不是日常英语里常见的词，主要出现在宝石/矿物领域，指一种不透明的蛋白石（也常被称为“common opal”的一种外观类型）。","在珠宝语境中，它通常强调“乳白、不透明、像瓷”的质感；与许多人熟悉的会“变彩”（play of color）的彩虹蛋白石相比，它一般不以变彩著称。"]}
{"word":"cachot","summary":{"en":"A cachot is a small, hidden dungeon-like prison cell; it can also mean a figurative place of harsh confinement.","zh":"cachot 指狭小隐蔽的地牢式牢房；也可比喻令人窒息、受困的处境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, hidden prison cell (often underground), especially in a castle or fortress; a dungeon.","zh":"（常指城堡或要塞里）隐蔽狭小的牢房，常在地下；地牢。"},"examples":[{"en":"The guard led the prisoner down stone steps into a dark cachot.","zh":"卫兵带着囚犯走下石阶，进入一个黑暗的地牢。"},{"en":"In the novel, the hero is thrown into a cachot beneath the palace.","zh":"在小说里，男主角被关进宫殿下方的地牢。"},{"en":"The museum shows a reconstructed cachot to explain how prisoners were held in the past.","zh":"博物馆展示了一个复原的地牢，用来解释过去如何关押囚犯。"}]},{"partOfSpeech":"n.","definition":{"en":"Figuratively, any place or situation that feels harsh, trapped, or cut off from the world.","zh":"（比喻）令人感到残酷、被困或与世隔绝的地方或处境。"},"examples":[{"en":"After months of isolation, the tiny room felt like a cachot.","zh":"经历数月的隔离后，那间小屋子让人感觉像地牢。"},{"en":"He described the job as a cachot of endless rules and no freedom.","zh":"他形容那份工作像地牢：规则无穷，毫无自由。"}]}],"synonyms":["dungeon","cell","prison cell","hole (informal)","lockup"],"phonetic":"/kæˈʃoʊ/","extraExplanation":["“cachot”来自法语，原义与“隐藏/关起来”有关，所以常带有“秘密关押、阴暗封闭”的感觉。","这个词在英语里偏文学、历史语境，常见于描写旧制度的监狱、城堡地牢等场景（如历史小说、哥特文学）。"]}
{"word":"cachou","summary":{"en":"A cachou is a small scented lozenge or pellet used to freshen the breath, often licorice-flavored.","zh":"cachou 指一种用于清新口气的小粒香口糖/含片，常带甘草味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, scented lozenge or pellet (often with licorice) used to sweeten the breath","zh":"（常含甘草味的）小粒香口糖/含片，用于清新口气"},"examples":[{"en":"She offered me a cachou after dinner to freshen my breath.","zh":"晚饭后她递给我一粒cachou，让我清新口气。"},{"en":"He always keeps a tin of cachous in his pocket.","zh":"他口袋里总放着一盒cachou。"}]}],"synonyms":["breath mint","mint","lozenge","pastille"],"phonetic":"/kəˈʃuː/","extraExplanation":["“cachou”在英式与法式语境里更常见，通常指小颗粒的口气清新糖（有时是甘草味）。在美式英语里相对少见，更常说 breath mint / mint / lozenge。","词源上多认为经由法语 *cachou* 进入英语；早期也可指一种带香味的糊剂/药用膏，后来更常指“口气清新糖”这一类小含片。"]}
{"word":"cachous","summary":{"en":"Cachous are small scented lozenges used to freshen the breath.","zh":"cachous 指用于清新口气的香味小含片（cachou 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"small, usually scented lozenges or pellets used to freshen the breath (plural of cachou)","zh":"（复数）香片／口气清新含片；常带香味的小粒含片（cachou 的复数）"},"examples":[{"en":"She offered him a few cachous after dinner to freshen his breath.","zh":"晚饭后她递给他几粒香片，让他清新口气。"},{"en":"The old tin of cachous smelled faintly of licorice.","zh":"那只旧铁盒里的香片带着淡淡的甘草味。"}]}],"synonyms":["breath mints","mints","lozenges","pastilles"],"phonetic":"/kæˈʃuːz/","extraExplanation":["“cachou”原本多指一种用来清新口气的小含片／糖粒，常见口味有甘草、薄荷等；“cachous”是其复数形式。在较老的英式或文学语境里更常见。","词源上经由法语 cachou 进入英语，和“catechu（儿茶，植物提取物）”有历史关联：早期产品可能含有相关成分或借用其名称来指代香味含片。"]}
{"word":"cachrys","summary":{"en":"Cachrys: a rare word, mainly a botanical name for a Mediterranean genus in the carrot family.","zh":"Cachrys：较少见的词，主要用作植物学名称，指地中海地区伞形科的一个属。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant in the genus Cachrys (carrot/parsley family), found mainly around the Mediterranean; sometimes mentioned in older botanical or herbal texts.","zh":"伞形科（胡萝卜/欧芹同科）的一类植物，属名为 Cachrys，主要分布在地中海地区；在较旧的植物志或草药书中偶有提及。"},"examples":[{"en":"The field guide lists Cachrys as a Mediterranean member of the carrot family.","zh":"这本野外指南把 Cachrys 列为地中海地区的伞形科植物。"},{"en":"In older herbals, cachrys was described as a strong-smelling wild plant.","zh":"在较早的草药书里，cachrys 被描述为一种气味浓烈的野生植物。"}]}],"synonyms":["Cachrys (genus)","umbellifer (broader category)"],"phonetic":"/ˈkæk.rɪs/","extraExplanation":["“Cachrys”是拉丁化的属名，来源可追溯到古希腊语传统；在英文里小写“cachrys”有时被当作普通名来指代这种植物或古代文献中提到的相关药草，但在现代英语中非常少见，通常出现在植物分类学或历史草药学语境。","读到它时，常见线索是与“Apiaceae（伞形科）/ umbellifer（伞形科植物）/ Mediterranean（地中海）”等词同现；如果你是在古典或中世纪草药文献里遇到，具体指哪一种植物可能因作者与时代不同而有差异。"]}
{"word":"cachua","summary":{"en":"Cachua is a traditional Peruvian Andean circle dance and song, commonly performed at festivals.","zh":"Cachua指秘鲁安第斯地区的传统围圈舞与歌，常见于节庆表演。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Peruvian (Andean) circle dance and song, often performed at festivals and celebrations","zh":"一种秘鲁（安第斯地区）的传统围圈舞与歌，常在节庆与庆典中表演"},"examples":[{"en":"The festival ended with a cachua, and everyone joined hands to dance in a circle.","zh":"节庆以一段cachua收尾，大家手牵手围成圈跳舞。"},{"en":"In the music class, we listened to a cachua from the Andes and talked about its rhythm.","zh":"在音乐课上，我们听了一首安第斯地区的cachua，并讨论了它的节奏。"}]}],"synonyms":["kachwa","Peruvian Andean folk dance"],"phonetic":"/kɑːˈtʃuː.ə/","extraExplanation":["“Cachua”常被认为来自克丘亚语（Quechua）的词（也常见拼写为“kachwa”）。它不仅是舞蹈名称，也常指配套的歌曲/曲调。","在安第斯文化语境里，cachua往往与社区性、参与性有关：多人围成圈或队列，边唱边跳，用来庆祝丰收、宗教节日或社群活动。","英语里这是相对小众的文化词汇，多出现在民族音乐、舞蹈研究、旅行写作或拉美文化介绍中。"]}
{"word":"cachucha","summary":{"en":"Cachucha can mean a small visor cap, or a traditional Cuban dance/song.","zh":"Cachucha可指一种带帽檐的小便帽，也可指一种传统的古巴舞/舞曲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, usually stiff cap with a visor (often associated with military or traditional Spanish/Latin American dress)","zh":"（常较硬、带帽檐的）小帽子；（常与军帽或西班牙/拉丁美洲传统服饰相关的）便帽"},"examples":[{"en":"The performer came onstage wearing a black cachucha and a bright red scarf.","zh":"演员戴着一顶黑色的cachucha（便帽）和一条鲜红的围巾走上舞台。"},{"en":"In the old photo, he’s dressed like a soldier, with a cachucha pulled low over his eyes.","zh":"在那张老照片里，他穿得像士兵一样，把cachucha（军帽式便帽）压得很低。"}]},{"partOfSpeech":"n.","definition":{"en":"a Cuban dance and/or lively song, especially from the 19th century, traditionally danced by couples","zh":"（尤指19世纪的）古巴舞/舞曲“cachucha”（常为双人舞，节奏活泼）"},"examples":[{"en":"They studied a cachucha that appears in some classical ballet productions.","zh":"他们学习了一段在某些古典芭蕾作品中会出现的cachucha舞。"},{"en":"The musicians played a cachucha to close the program with a festive mood.","zh":"乐手们演奏了一首cachucha舞曲，为演出在欢快气氛中收尾。"}]}],"synonyms":["cap","visor cap","peaked cap","Cuban dance"],"phonetic":"/kəˈtʃuːtʃə/","extraExplanation":["“Cachucha”来自西班牙语，在英语里多用于描述具有西班牙/拉丁美洲风格的帽子，或指一种古巴舞/舞曲。作为舞蹈名称时，你可能会在芭蕾语境中看到：一些作品会借用“cachucha”这一民间风格舞段来营造异国/地域色彩。使用时注意这是外来词，通常不需要复数变化规则很复杂：可写作 cachuchas。"]}
{"word":"cachuchas","summary":{"en":"“Cachuchas” is the plural of “cachucha,” meaning Spanish-style caps, and sometimes Spanish dances/tunes with that name.","zh":"“cachuchas”是“cachucha”的复数，常指西班牙风格的小帽子；有时也指同名的西班牙舞蹈/舞曲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Small, flat Spanish-style caps or peaked hats.","zh":"（复数）西班牙风格的小扁帽；（有时带帽檐的）便帽。"},"examples":[{"en":"The performers wore bright cachuchas as part of their traditional costume.","zh":"表演者戴着鲜艳的cachuchas，作为传统服装的一部分。"},{"en":"He tipped his cachucha politely before stepping inside.","zh":"他礼貌地掀了掀cachucha，然后走了进去。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) Spanish dances/tunes called the cachucha; lively, often associated with Andalusian/Spanish stage tradition.","zh":"（复数）名为cachucha的西班牙舞蹈/舞曲；节奏活泼，常与西班牙（舞台/安达卢西亚）传统相关。"},"examples":[{"en":"They ended the show with cachuchas that had the audience clapping along.","zh":"他们以几段cachuchas收尾，观众跟着节拍鼓掌。"},{"en":"The music shifted into a cachucha rhythm, quick and playful.","zh":"音乐转入cachucha的节奏，轻快又俏皮。"}]}],"synonyms":["caps","berets","hats","Spanish dance","tune"],"phonetic":"/kəˈtʃuːtʃəz/","extraExplanation":["“cachuchas”来自西班牙语单数“cachucha”。在英语里多见于描写西班牙服饰、民俗表演或文学中的异国风情场景，因此带一点“文化点缀”的语感。","如果你在英文文本里看到它，通常靠上下文判断是“帽子”还是“舞曲/舞蹈”：出现wear/hat/costume多半指帽子；出现dance/music/rhythm多半指舞。"]}
{"word":"cachucho","summary":{"en":"“Cachucho” is a Spanish word often meaning a cap/hat, and it can also be used as a nickname.","zh":"“cachucho”多为西班牙语词，常指帽子/鸭舌帽，也可用作人的绰号。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish loanword, informal) A cap or hat, especially a flat cap or baseball-style cap.","zh":"（西班牙语借词，非正式）帽子、鸭舌帽；常指平顶帽或棒球帽一类的帽子。"},"examples":[{"en":"He walked in wearing a cachucho pulled low over his eyes.","zh":"他走进来时把一顶cachucho压得很低，遮住了眼睛。"},{"en":"In some Caribbean Spanish, people might say cachucho when they mean “cap.”","zh":"在一些加勒比地区的西班牙语里，人们可能会用cachucho来表示“帽子/鸭舌帽”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Proper name/nickname) A person’s nickname, especially in Spanish-speaking communities.","zh":"（专有名词/绰号）人名绰号，常见于西语社群。"},"examples":[{"en":"Everyone calls him Cachucho, but his real name is Carlos.","zh":"大家都叫他Cachucho，但他真名叫Carlos。"}]}],"synonyms":["cap","hat","baseball cap","flat cap"],"phonetic":"/kɑˈtʃuːtʃoʊ/","extraExplanation":["“cachucho”主要是西班牙语用法，并不是标准英语词汇；在英语语境里通常出现在与拉美/加勒比文化有关的对话、歌词、社交媒体或人物昵称中。","更常见的形式是“cachucha”（阴性），在古巴、西语加勒比地区可指“帽子/鸭舌帽”。不同地区用词会有差异。"]}
{"word":"cachunde","summary":{"en":"“cachunde” isn’t standard English; it likely refers to Spanish slang meaning “horny” or “teasing/jokey (sometimes suggestive).”","zh":"“cachunde”不是标准英语；很可能来自西班牙语俚语，意思是“性兴奋/饥渴”，或“起哄爱闹（有时带暧昧暗示）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard; likely a misspelling of Spanish slang “cachonde”.) Sexually excited; “horny.”","zh":"（非标准拼写；很可能是西班牙语俚语“cachonde”的误拼。）性兴奋的；“很饥渴的/很想要的”。"},"examples":[{"en":"He was acting cachunde after a few drinks.","zh":"喝了几杯后，他表现得有点“cachunde”（性兴奋）。"},{"en":"That joke was meant to sound cachunde, not romantic.","zh":"那个玩笑是故意说得有点“cachunde”（带性暗示），不是在谈恋爱。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard; likely from Spanish “cachonde”.) Playful in a teasing, joking, sometimes sexually suggestive way.","zh":"（非标准用法；可能来自西班牙语“cachonde”。）爱开玩笑的、爱起哄的；有时带点性暗示的挑逗感。"},"examples":[{"en":"Don’t take him seriously—he’s being cachunde.","zh":"别太当真——他是在起哄开玩笑（cachunde）。"},{"en":"The comments got a bit cachunde, so the host changed the topic.","zh":"评论有点开始变得暧昧起哄（cachunde），所以主持人换了话题。"}]}],"synonyms":["horny","sexually aroused","flirty","teasing","suggestive"],"phonetic":"/kɑːˈtʃoʊn.deɪ/","extraExplanation":["“cachunde”不是标准英语单词；更常见的来源是西班牙（尤其是西班牙本土）俚语“cachonde”。在西语里它既可指“性兴奋”，也可指“起哄、搞笑、爱闹”。","在英语语境中，如果直接用这类外来俚语，容易被误解或显得不礼貌；更安全的表达：horny（直白，可能粗）、sexually aroused（更正式）、flirty/teasing（更委婉）。"]}
{"word":"caci","summary":{"en":"Caci is a traditional Manggarai whip-and-shield duel performed at festivals in Flores, Indonesia.","zh":"Caci 是印尼弗洛勒斯岛曼加莱地区在节庆中表演的传统“鞭与盾”对决仪式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Manggarai (Flores, Indonesia) ritual performance in which two men duel with whips and shields, often as part of festivals or harvest celebrations","zh":"一种印度尼西亚弗洛勒斯岛（Manggarai 曼加莱地区）的传统仪式表演：两名男子用鞭子与盾牌对决，常见于节庆或庆祝丰收活动中"},"examples":[{"en":"We watched a caci performance during the village festival.","zh":"我们在村庄的节庆活动中观看了 caci 表演。"},{"en":"In caci, the fighters use a whip to strike and a shield to block.","zh":"在 caci 中，对战者用鞭子进攻、用盾牌防守。"},{"en":"Travel writers often describe caci as both a sport and a ritual.","zh":"旅行作家常把 caci 描述为兼具竞技与仪式意义的活动。"}]}],"synonyms":["whip-fighting ritual","traditional duel","ceremonial combat"],"phonetic":"/ˈtʃɑːtʃi/","extraExplanation":["caci 多见于英文旅行文学、民族志（ethnography）或文化介绍文章里，通常被当作外来文化词直接使用，不翻译或仅加简短说明。","它不仅是“打斗”，也常包含音乐、歌唱与礼仪；参与者和观众通常把它视为社区凝聚与传统传承的一部分。"]}
{"word":"Cacia","summary":{"en":"“Cacia” is usually a misspelling or variant of “acacia,” a tree/shrub (and its wood).","zh":"“Cacia”通常是“acacia（金合欢）”的误拼或变体，指金合欢植物或其木材。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually spelled “acacia”) a type of tree or shrub, often with small leaves and sometimes thorns, common in warm regions such as Africa and Australia.","zh":"（通常拼作“acacia”）金合欢属植物；一种树或灌木，常见于非洲、澳大利亚等温暖地区，叶子细小，有些种类带刺。"},"examples":[{"en":"Acacia trees can survive in very dry climates.","zh":"金合欢树能在非常干旱的气候中生存。"},{"en":"We saw an acacia by the road with bright yellow flowers.","zh":"我们在路边看到一棵开着亮黄色花的金合欢。"}]},{"partOfSpeech":"n.","definition":{"en":"The wood (timber) from an acacia tree, used for furniture or other products.","zh":"金合欢木；指金合欢树的木材，可用于家具等制品。"},"examples":[{"en":"The table is made of acacia wood.","zh":"这张桌子是用金合欢木做的。"}]}],"synonyms":["wattle (some types)"],"phonetic":"əˈkeɪʃə","extraExplanation":["“Cacia”本身在英语里不常作为标准词条出现，更多见于人名、品牌名或对“acacia”的拼写误写/简写。若你是在读文章或看到标签上的“Cacia”，可以告诉我上下文，我能帮你判断具体指什么。","“acacia”在文化语境里偶尔有象征意义：在一些传统中与“坚韧、纯洁、重生”相关；《圣经》一些译本也提到“金合欢木”（常译为acacia wood/shittim wood）作为建造材料。"]}
{"word":"Cacicus","summary":{"en":"Cacicus is the scientific genus name for several tropical American birds called caciques.","zh":"Cacicus是若干热带美洲“cacique（酋长鸟/拟黄鹂类）”的鸟类属名（学名属）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical American birds (family Icteridae) commonly called caciques, known for loud calls and often for building hanging, woven nests.","zh":"一种热带美洲鸟类的属名（拟黄鹂科），通称“cacique（酋长鸟/拟黄鹂类）”，以响亮叫声以及常见的悬挂编织巢著称。"},"examples":[{"en":"The ornithologist recorded several Cacicus species in the rainforest canopy.","zh":"那位鸟类学家在雨林树冠层记录到了几种Cacicus属的鸟。"},{"en":"Some Cacicus birds weave long, hanging nests that sway in the wind.","zh":"有些Cacicus属的鸟会编织又长又悬挂的鸟巢，随风摇摆。"}]}],"synonyms":["cacique (common name)","caciques (plural)"],"phonetic":"/kəˈsaɪkəs/","extraExplanation":["“Cacicus”是拉丁化的学名，常与英语通称“cacique(s)”并用。后者来源与西班牙语/加勒比海地区原住民语言有关（“cacique”原指“部落首领/酋长”），后来被用于给某些鸟类命名。不同地区对“cacique”的中文译名不完全统一，查阅鸟类图鉴时可结合学名与分布确认。"]}
{"word":"cacicus","summary":{"en":"Cacicus is mainly used as a scientific name for a genus of tropical American birds; rarely, it can mean a chief (related to “cacique”).","zh":"Cacicus 主要作为热带美洲一类鸟的学名属名使用；较少情况下也可指“首领/酋长”（与 cacique 同源）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical American birds in the blackbird family (Icteridae), including several species often called “caciques.”","zh":"（鸟类）拟鹂科（黑鹂科）的一属，分布于热带美洲，其中一些物种常被称为“cacique（拟鹂/黑鹂类鸟）”。"},"examples":[{"en":"The biologist recorded a Cacicus species nesting high in the rainforest canopy.","zh":"生物学家记录到一只 Cacicus 属的鸟在雨林树冠层高处筑巢。"},{"en":"In some field guides, birds in the genus Cacicus are labeled as caciques.","zh":"在一些野外鸟类图鉴中，Cacicus 属的鸟会标注为 caciques（拟鹂类）。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a chief or leader; a Latinized form related to “cacique.”","zh":"（罕见）首领、酋长；与 cacique（酋长）相关的拉丁化形式。"},"examples":[{"en":"The text uses cacicus to refer to a local chief.","zh":"这篇文本用 cacicus 来指代当地的酋长。"}]}],"synonyms":["cacique (common name/spelling)","oropendola (related group, not identical)"],"phonetic":"/ˈkæsɪkəs/","extraExplanation":["“Cacicus”常见于生物分类学（拉丁化学名）。它与西班牙语 cacique（意为“酋长/首领”）同源；cacique 一词来自加勒比地区的原住民语言（常被认为与泰诺语/阿拉瓦克语有关）。早期欧洲殖民者用它称呼当地首领，后来也影响了某些动植物的命名与俗名。"]}
{"word":"cacidrosis","summary":{"en":"Cacidrosis means unusually foul-smelling sweat.","zh":"cacidrosis 指“汗液异常恶臭”的医学状况。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical condition in which a person’s sweat has an unusually strong, unpleasant odor (foul-smelling perspiration).","zh":"一种医学状况：出汗带有异常浓烈、令人不适的气味（恶臭性出汗）。"},"examples":[{"en":"The doctor explained that cacidrosis can be related to bacteria breaking down sweat on the skin.","zh":"医生解释说，cacidrosis 可能与皮肤表面的细菌分解汗液有关。"},{"en":"If the odor is sudden or severe, a clinician may evaluate for cacidrosis and possible underlying causes.","zh":"如果气味突然出现或非常严重，临床医生可能会评估是否为 cacidrosis 以及是否存在潜在原因。"}]}],"synonyms":["bromhidrosis","malodorous perspiration","foul-smelling sweat"],"phonetic":"/ˌkæsɪˈdroʊsɪs/","extraExplanation":["这是一个较少见、偏医学用语的词；日常英语里更常说“bad body odor (from sweating)”或“smelly sweat”。","词源来自希腊语：kakos（坏的、恶臭的）+ hidrosis（出汗）。","造成汗味明显的常见因素包括：皮肤细菌分解汗液、饮食（如大蒜/香料）、某些药物、激素变化、压力，以及个别代谢问题；若伴随其他症状或突然恶化，通常建议就医评估。"]}
{"word":"Cacie","summary":{"en":"“Cacie” is usually a female first name, a spelling variant of Casey/Kacie.","zh":"“Cacie”通常是女性名字，常见为 Casey/Kacie 的拼写变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (first name), often a variant spelling of “Casey/Kacie.”","zh":"女性名字（名），常被视为 “Casey/Kacie” 的变体拼写。"},"examples":[{"en":"Cacie moved to Chicago for her new job.","zh":"Cacie 为了新工作搬到了芝加哥。"},{"en":"I met Cacie at a friend’s birthday party.","zh":"我在朋友的生日派对上认识了 Cacie。"}]}],"synonyms":["Casey","Kacie"],"phonetic":"/ˈkeɪsi/","extraExplanation":["“Cacie”通常用作名字，而不是普通词汇；在英文里人名的拼写变体很常见。","发音多与 “Casey” 相同（开头像 “kay-”），因此在口语中你可能听到相同发音但看到不同拼写（Cacie / Kacie / Casey）。","在文学作品或正式写作中，出现 “Cacie” 多半是角色名；如果你是在特定文本/歌曲/品牌里看到它，也可能是专有名称（需要上下文才能确认）。"]}
{"word":"Cacilia","summary":{"en":"“Cacilia” is a female first name, often a variant spelling of “Cecilia.”","zh":"“Cacilia”是女性名字，常见为“Cecilia”的变体拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A female given name (a variant spelling of “Cecilia/Caecilia”), used as a person’s name.","zh":"女性名字（“Cecilia/Caecilia”的变体拼写），用作人名。"},"examples":[{"en":"Cacilia joined our class this semester.","zh":"Cacilia 这学期加入了我们班。"},{"en":"I met Cacilia at a music festival.","zh":"我在一个音乐节上认识了 Cacilia。"}]}],"synonyms":["Cecilia","Caecilia"],"phonetic":"/səˈsɪliə/","extraExplanation":["“Cacilia”更常见的标准拼写是 **Cecilia**（英文）或 **Caecilia**（拉丁文）。如果你是在证件、邮箱、社交媒体账号或作业里看到“Cacilia”，它可能是个人选择的拼写，也可能是对“Cecilia”的拼写误差。","名字 **Cecilia** 常被认为源自拉丁家族名 *Caecilius/Caecilia*，传统上与拉丁语 *caecus*（“盲的”）有关联（属于词源学层面的联系，现代用名时通常不带该含义）。","文化背景：天主教传统中有“圣塞西莉亚（Saint Cecilia）”，常被称为音乐的守护圣人，因此这个名字在音乐文化语境中也较常见。"]}
{"word":"Cacilie","summary":{"en":"Cacilie is a feminine first name, a variant of Cecilia/Cecilie, sometimes culturally associated with Saint Cecilia and music.","zh":"Cacilie 是一个女性名字，是 Cecilia/Cecilie 的变体拼写，有时在文化上与圣塞西莉亚及音乐相关联。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A feminine given name (a variant spelling of Cecilie/Cecilia), traditionally associated with the meaning “blind” (from Latin) and often linked culturally to Saint Cecilia, the patron saint of music.","zh":"一个女性名字（Cecilie/Cecilia 的变体拼写），传统上源自拉丁语，含义常被解释为“盲的”；在文化上也常与“圣塞西莉亚”（音乐守护圣人）相关联。"},"examples":[{"en":"Cacilie introduced herself to the class on the first day of school.","zh":"开学第一天，Cacilie 向全班做了自我介绍。"},{"en":"Cacilie is a less common spelling, so people sometimes ask how to pronounce it.","zh":"Cacilie 是比较少见的拼法，所以别人有时会问怎么读。"}]}],"synonyms":["Cecilie","Cecilia","Cecily"],"phonetic":"/səˈsɪli/","extraExplanation":["“Cacilie”更常见于欧洲语境中被视为“Cecilie”的变体拼写；在英语国家更常见的形式是“Cecilia / Cecily”。不同家庭可能出于发音习惯、家族传统或独特性选择这种拼法。","与“Saint Cecilia（圣塞西莉亚）”相关的文化联想：她在基督教传统中常被视为音乐与音乐人的守护圣人，因此这个名字有时会让人联想到音乐、合唱或艺术气质（这属于文化联想，并非字面含义）。"]}
{"word":"cacimbo","summary":{"en":"Cacimbo is the cool, dry, often misty season in Angola and nearby southern Africa.","zh":"Cacimbo 指安哥拉及其周边地区凉爽、干燥、常带雾气的季节。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Angola and nearby parts of southern Africa) the cool, dry season, often associated with mist or fog, usually during the southern hemisphere winter.","zh":"（安哥拉及其周边南部非洲地区）凉爽干燥的季节，常伴有薄雾或雾气，通常出现在南半球的冬季。"},"examples":[{"en":"During the cacimbo, mornings can be cold and misty in coastal Angola.","zh":"在 cacimbo 时节，安哥拉沿海的早晨可能又冷又多雾。"},{"en":"Farmers often adjust planting plans to the cacimbo’s dry weather.","zh":"农民常会根据 cacimbo 的干燥天气来调整播种计划。"}]}],"synonyms":["dry season","cool season","winter mist"],"phonetic":"/kəˈsɪmboʊ/","extraExplanation":["“cacimbo”常见于葡语语境（尤其是安哥拉）。它描述的是一种季节性气候现象：气温更低、降雨更少，沿海地区也可能出现雾或海雾。阅读非洲（特别是安哥拉）题材的旅行写作、新闻或文学作品时更容易遇到这个词。"]}
{"word":"cacimbos","summary":{"en":"Cacimbos is the plural of cacimbo, referring to the cool, dry season (and its fog) in parts of Angola and nearby regions.","zh":"Cacimbos 是 cacimbo 的复数，指安哥拉等地的凉爽干季，以及该季节常见的雾气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cool, dry season in parts of southwestern Africa (especially Angola and northern Namibia), often associated with chilly mornings and frequent fog or haze","zh":"（非洲西南部，尤指安哥拉、纳米比亚北部的）凉爽干季；常伴随清晨寒冷与浓雾/薄雾"},"examples":[{"en":"During the cacimbos, mornings can feel surprisingly cold near the coast.","zh":"在 cacimbos（凉爽干季）期间，沿海的清晨会意外地冷。"},{"en":"The fishermen waited for the fog of the cacimbos to lift before leaving.","zh":"渔民等到 cacimbos 带来的雾散去后才出海。"}]},{"partOfSpeech":"n.","definition":{"en":"the fog or haze typical of that season","zh":"该季节特有的雾气/霾状薄雾"},"examples":[{"en":"A thick cacimbo covered the road at dawn.","zh":"黎明时分，浓重的 cacimbo（雾气）笼罩了公路。"}]}],"synonyms":["dry season (regional)","coastal fog (contextual)"],"phonetic":"/kɑˈsɪmboʊ/","extraExplanation":["“cacimbo”多见于葡萄牙语语境的非洲地区报道与旅行写作，常指安哥拉沿海受本格拉寒流影响的凉爽干季，也可引申指那段时间常见的雾。","你输入的“cacimbos”是复数形式（多个季节/多次出现的雾，或在描述不同地区的同类现象时使用）。"]}
{"word":"caciocavallo","summary":{"en":"Caciocavallo is a traditional Italian stretched-curd cheese, often gourd-shaped and aged by hanging, eaten fresh or aged.","zh":"Caciocavallo 是一种传统意大利拉丝奶酪，常呈葫芦形并以吊挂方式熟成，可鲜食也可熟成食用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional Italian stretched-curd (pasta filata) cheese, usually shaped like a gourd and often sold tied in pairs; it can be eaten fresh or aged and has a mild to sharper flavor depending on age.","zh":"一种传统意大利“拉丝凝乳”（pasta filata）奶酪，常做成葫芦状，常以成对绑在一起出售；可鲜食或熟成，风味会随熟成时间从温和变得更浓郁。"},"examples":[{"en":"The recipe calls for caciocavallo, but you can use provolone if you can’t find it.","zh":"食谱需要用 caciocavallo，但如果买不到，也可以用普罗卧洛奶酪（provolone）代替。"},{"en":"We grated aged caciocavallo over pasta for a salty, nutty finish.","zh":"我们把熟成的 caciocavallo 刨丝撒在意面上，收尾带出咸香和坚果般的风味。"},{"en":"At the market, you’ll often see caciocavallo hung up to dry and age.","zh":"在市场上你常会看到 caciocavallo 被吊挂起来风干熟成。"}]}],"synonyms":["provolone","scamorza","pasta filata cheese"],"phonetic":"/ˌkɑːtʃoʊ kəˈvɑːloʊ/","extraExplanation":["“Caciocavallo”是意大利语词：cacio（奶酪）+ cavallo（马）。常见说法是这种奶酪会两颗一组绑起来，像“骑在木杆上”一样悬挂熟成，因此得名（并不一定和马本身有关）。","它属于“pasta filata（拉丝）”家族，和 mozzarella、provolone、scamorza 工艺相近：加热后拉伸形成有弹性的纤维结构。","在英语菜单或食谱里通常直接用意大利原名，首字母一般不大写；点餐时可把它理解为“适合融化、也适合刨丝”的意大利奶酪。"]}
{"word":"cacique","summary":{"en":"A cacique is an Indigenous chief (especially in the Caribbean/Latin America) or, by extension, a powerful local political boss.","zh":"cacique 指（加勒比/拉美语境中的）原住民首领；引申也可指把持地方政治的强势人物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A chief or leader of an Indigenous community, especially in the Caribbean or parts of Latin America (a term used in Spanish colonial contexts).","zh":"（尤指加勒比海或拉丁美洲部分地区的）原住民部落首领、酋长（多见于西班牙殖民语境）。"},"examples":[{"en":"The Spanish chroniclers wrote that each island had a cacique who led the local people.","zh":"西班牙编年史记载说，每座岛上都有一位 cacique 领导当地人。"},{"en":"In the museum, a label described a cacique’s role in organizing ceremonies and settling disputes.","zh":"在博物馆里，说明牌介绍了 cacique 组织仪式并调解纠纷的职责。"}]},{"partOfSpeech":"n.","definition":{"en":"In politics (especially in Latin America), a local political boss or powerful strongman who controls influence and votes in a region.","zh":"（政治语境，尤指拉丁美洲）地方政客头目、地头蛇式的权势人物（能操控地方影响力与选票）。"},"examples":[{"en":"The candidate depended on a regional cacique to mobilize supporters.","zh":"这位候选人依赖一位地区性的 cacique 来动员支持者。"},{"en":"The article criticized the system that lets caciques dominate local government.","zh":"那篇文章批评了让地方“caciques”把持基层政府的制度。"}]}],"synonyms":["chief","tribal leader","political boss","strongman"],"phonetic":"/kəˈsiːk/","extraExplanation":["词源与文化背景：cacique 源自泰诺语（Taíno，加勒比地区原住民族语言），经西班牙语 cacique 进入英语。英语里常用于历史、人类学或拉美政治报道中。","使用提醒：在英语文本中，cacique 往往带有明确的地域与历史语境（殖民记录、拉美政治），一般不用于泛指任何“酋长”；若要更中性泛用，可用 chief / leader。"]}
{"word":"caciques","summary":{"en":"Caciques are either (1) local political bosses who control influence and elections, or (2) Indigenous chiefs (historical use).","zh":"caciques 可指（1）操控地方政治与选举的“地方头目”，或（2）（历史用法）原住民酋长/首领。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a local political boss who controls votes, jobs, and influence (especially in parts of Latin America, Spain, or in historical/political writing)","zh":"（尤指拉丁美洲、西班牙或政治史语境中）地方政治“土豪/头目”，通过人脉与资源操控选票、职位与影响力的人"},"examples":[{"en":"In some provinces, caciques decided who would get government contracts.","zh":"在一些省份，地方政治头目往往决定谁能拿到政府合同。"},{"en":"The reform aimed to reduce the power of local caciques over elections.","zh":"这项改革旨在削弱地方头目对选举的控制。"}]},{"partOfSpeech":"n.","definition":{"en":"an Indigenous chief or leader, especially in the Caribbean or parts of Latin America (historical use)","zh":"（历史用法）原住民的酋长或首领，尤指加勒比地区或拉丁美洲部分地区"},"examples":[{"en":"The Spanish recorded meetings with Taíno caciques on the island.","zh":"西班牙人记录了他们在岛上与泰诺人酋长会面的情况。"},{"en":"Each village had a cacique who led ceremonies and made decisions.","zh":"每个村落都有一位酋长，主持仪式并作出决策。"}]}],"synonyms":["political boss","local boss","strongman","chieftain","chief"],"phonetic":"/kəˈsiːks/","extraExplanation":["“cacique”一词源自泰诺语（Taíno，加勒比原住民语言），原意是“首领/酋长”。西班牙殖民时期把它用来称呼当地原住民领袖；后来在西班牙语政治语境中引申为“地方强人/政治掮客”，英语也借用了这一政治含义。","复数形式是 caciques。英语中读音常见为 /kəˈsiːk/（单数），复数结尾发 /s/ 音。"]}
{"word":"caciqueship","summary":{"en":"Caciqueship means the office or power of a cacique (a local chief or political boss).","zh":"Caciqueship 指 cacique（地方首领/政治头目）的职位、权力或任期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the position, authority, or period of rule of a cacique (a local chief or powerful political boss, especially in Spanish-speaking regions).","zh":"“cacique”（地方首领/有势力的政治头目）的职位、权力或统治时期。"},"examples":[{"en":"The village was stable during his caciqueship because disputes were settled quickly.","zh":"在他担任首领的时期（caciqueship），村子很稳定，因为纠纷很快就能解决。"},{"en":"Historians described the shift from traditional caciqueship to a more centralized colonial administration.","zh":"历史学家描述了从传统的地方首领统治（caciqueship）到更集中的殖民行政体制的转变。"}]}],"synonyms":["chieftainship","leadership","chiefdom","bossism"],"phonetic":"/kəˈsiːkʃɪp/","extraExplanation":["“cacique”一词源自加勒比地区泰诺语（Taíno），后来进入西班牙语，用来指当地的部族首领。近代在西语政治语境中，cacique 也可指在地方上靠人脉与资源控制选举、分配利益的“地头蛇/地方豪强”，相关现象常被称为“caciquismo”（地方豪强政治）。","词尾 -ship 表示“身份/职位/状态/任期”（如 leadership, friendship），所以 caciqueship 直观理解就是“cacique 的身份/权力/任期”。"]}
{"word":"caciquism","summary":{"en":"Caciquism is local boss rule in politics, where a powerful figure controls outcomes through patronage and influence rather than fair democratic processes.","zh":"Caciquism 指地方豪强式的政治控制：由强势地方人物依靠恩庇与影响力（而非公平民主程序）左右政治结果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a political system in which local power is controlled by a “cacique” (a powerful local boss), often through patronage, intimidation, and manipulation of elections","zh":"一种“地方豪强/地方政治老板”（cacique）控制地方政治的制度，常通过裙带关系、威逼利诱或操纵选举来维持权力"},"examples":[{"en":"Some historians argue that caciquism weakened democratic institutions by turning elections into a formality.","zh":"一些历史学家认为，地方豪强政治削弱了民主制度，使选举沦为形式。"},{"en":"In that region, public jobs were often distributed through caciquism rather than merit.","zh":"在那个地区，公职常常是通过地方豪强政治的关系网络分配，而不是靠能力。"}]}],"synonyms":["bossism","political machine (context-dependent)","clientelism (related)","patronage politics (related)"],"phonetic":"/kəˈsiːkɪzəm/","extraExplanation":["“caciquism”来自西班牙语“caciquismo”，核心词“cacique”原指加勒比泰诺（Taíno）语中的部落首领，后在西语世界里常指掌控地方资源与选票的政治强人/地头蛇。","该词常用于讨论19—20世纪西班牙与拉丁美洲的地方政治：名义上有选举与政党，但实际运作依赖私人关系与恩庇网络（patronage），因此带有批判色彩。"]}
{"word":"cack","summary":{"en":"“Cack” is an informal word (often British) meaning poop, or something rubbish; it can also mean to poop or (less commonly) to cackle.","zh":"“cack”是非正式用语（多见于英式），可指“粪便/屎”或“很烂的东西”；也可作动词指“拉屎”，较少情况下指“咯咯怪笑”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Feces; poop. Also used more broadly to mean something of very low quality or nonsense.","zh":"（非正式）粪便；屎。也可泛指“很烂的东西 / 胡说八道”。"},"examples":[{"en":"That movie was total cack—don’t waste your time.","zh":"那部电影烂透了——别浪费时间。"},{"en":"I stepped in cack on the sidewalk.","zh":"我在人行道上踩到屎了。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal, chiefly British) To defecate; to poop.","zh":"（非正式，主要英式）排便；拉屎。"},"examples":[{"en":"The dog cacked on the carpet.","zh":"狗在地毯上拉屎了。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal) To cackle; to laugh in a loud, harsh way (less common than “cackle”).","zh":"（非正式）咯咯地笑；刺耳地大笑（不如 cackle 常见）。"},"examples":[{"en":"He cacked loudly at his own joke.","zh":"他听到自己的笑话就大声怪笑。"}]}],"synonyms":["poop","crap","feces","rubbish","nonsense","cackle"],"phonetic":"/kæk/","extraExplanation":["“cack”在英式口语里更常见，尤其指“粪便”或“很烂的东西”。在美式英语中相对少见；美式更常用poop/crap（口语）来表达。","注意语气：这个词比较粗俗/不文雅，正式场合不建议使用。"]}
{"word":"Cacka","summary":{"en":"“Cacka” isn’t standard English; it’s usually a misspelling of “caca” (poop) or “cackle” (loud laugh).","zh":"“Cacka”不是标准英语词；通常是把“caca”（便便）或“cackle”（咯咯大笑）拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling of “caca” (childish/slang for poop) or “cackle” (to laugh loudly).","zh":"不是标准英语单词；最常见是把“caca”（儿童用语/俚语：便便）或“cackle”（咯咯大笑）拼错了。"},"examples":[{"en":"Did you mean “caca” (poop) or “cackle” (laugh loudly)?","zh":"你是想写“caca”（便便）还是“cackle”（咯咯大笑）呢？"}]}],"synonyms":["caca","poop","cackle"],"phonetic":"/ˈkɑkə/","extraExplanation":["“Cacka”在英语里通常不作为常用词出现。如果你是在聊天、游戏ID、昵称或人名里看到它，也可能只是自造拼写。","如果你想表达“便便/大便”，更常见的拼写是“caca”（较幼稚或带玩笑语气），更中性的说法是“poop”（口语）或“feces/stool”（更正式/医学）。","如果你想表达“咯咯地笑/大声笑”，正确单词一般是“cackle”。"]}
{"word":"cacked","summary":{"en":"“Cacked” is an informal past-tense form of “cack,” often meaning “died/broke down” or (cruder) “pooped,” mainly in UK slang.","zh":"“cacked”是俚语（多见于英式英语）“cack”的过去式，常指“挂了/坏了”，也可粗俗地指“拉屎”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(UK, informal/slang) Past tense of “cack”: to defecate, or (more commonly) to die suddenly.","zh":"（英式，非正式/俚语）“cack”的过去式：拉屎；或（更常见）突然死去。"},"examples":[{"en":"He was so scared he almost cacked himself.","zh":"他吓得差点拉裤子。"},{"en":"That old laptop finally cacked after years of use.","zh":"那台老笔记本用了好多年，终于“挂了”。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense of “cack” meaning to laugh in a harsh, unpleasant way (less common).","zh":"“cack”的过去式：发出刺耳、难听的笑声（较少见）。"},"examples":[{"en":"He cacked loudly at his own joke.","zh":"他对自己的笑话发出刺耳的大笑。"}]}],"synonyms":["died (slang)","broke down","kicked the bucket (idiom)","conked out","pooped (informal)"],"phonetic":"/kækt/","extraExplanation":["“cacked”在口语里最常见于短语“cack (one’s) pants / cack oneself”，表示“吓得要尿/要拉（很夸张的说法）”。另外，“to cack it”在英式俚语中可表示“死了/挂了”，也常被引申为机器坏了（语气随意，可能有点粗俗）。","如果你原本想查的是“caked”（拼写很像），那意思通常是“结块的/覆满一层的”，例如“mud caked on his boots（泥巴糊满了靴子）”。"]}
{"word":"cackerel","summary":{"en":"Mackerel is a common ocean fish often eaten, known for its rich, oily taste.","zh":"Mackerel 指鲭鱼，一种常见的海鱼，常被食用，以油脂丰富、味道较浓著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a common ocean fish with a slim body, often eaten; it can be fresh, canned, smoked, or grilled","zh":"一种常见的海鱼（鲭鱼），身体细长，常被食用；可鲜食、罐装、烟熏或烧烤"},"examples":[{"en":"We had grilled mackerel for dinner.","zh":"我们晚餐吃了烤鲭鱼。"},{"en":"Mackerel is an oily fish, so it has a strong flavor.","zh":"鲭鱼是油脂含量较高的鱼，所以味道比较浓。"},{"en":"She bought a can of mackerel at the supermarket.","zh":"她在超市买了一罐鲭鱼罐头。"}]}],"synonyms":["oily fish"],"phonetic":"/ˈmækərəl/","extraExplanation":["你输入的“cackerel”通常是拼写错误；正确拼写多为“mackerel”。","“mackerel”在英语里是常见食用鱼名，常出现在菜单与食谱中（如 grilled mackerel、smoked mackerel）。"]}
{"word":"cacking","summary":{"en":"“Cacking” is British informal slang meaning either “defecating” or (in “cacking it”) “very scared/nervous.”","zh":"“cacking”是英式非正式俚语，可指“排便/拉屎”，也可在“cacking it”中表示“特别害怕/紧张”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(British informal, sometimes vulgar) Defecating; producing feces.","zh":"（英式非正式，有时粗俗）排便；拉屎。"},"examples":[{"en":"The baby was cacking in his diaper again.","zh":"宝宝又拉在尿布里了。"},{"en":"The dog was cacking on the lawn, so I had to clean it up.","zh":"狗在草坪上拉屎，所以我得清理。"}]},{"partOfSpeech":"adj.","definition":{"en":"(British informal) Very scared or nervous (often in the phrase “cacking it”).","zh":"（英式非正式）非常害怕或紧张（常用于短语“cacking it”）。"},"examples":[{"en":"I was cacking it before the job interview.","zh":"面试前我紧张得要命。"},{"en":"She’s cacking it about the exam results.","zh":"她特别担心考试成绩。"}]}],"synonyms":["pooping","defecating","having a bowel movement","terrified","scared stiff","really nervous","freaking out"],"phonetic":"/ˈkækɪŋ/","extraExplanation":["“cack”在英式口语里常指“粪便/拉屎”，因此“cacking”既可字面表示“在排便”，也常引申出“吓得要命/紧张得要命”（类似于更粗俗的说法“shit oneself”）。在正式场合不建议使用，可用更中性的表达：\n- 字面：pooping / having a bowel movement\n- 引申：really nervous / terrified / freaking out"]}
{"word":"cackle","summary":{"en":"“Cackle” means to laugh loudly in a harsh, repeated way, or the sound of that laugh.","zh":"“cackle”指刺耳、断续的咯咯笑/怪笑，或这种笑声本身。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to laugh loudly in a harsh, repeated way (often suggesting amusement that sounds mean, strange, or like a hen’s call)","zh":"（常指刺耳、断续地）咯咯笑；大声怪笑（有时带点幸灾乐祸或像母鸡叫）"},"examples":[{"en":"The kids cackled when the clown fell down.","zh":"小孩们看到小丑摔倒时咯咯笑了起来。"},{"en":"She cackled at her own joke, even though no one else laughed.","zh":"她对自己的笑话咯咯笑个不停，尽管别人都没笑。"}]},{"partOfSpeech":"n.","definition":{"en":"a loud, harsh, repeated laugh","zh":"刺耳的咯咯笑声；怪笑声"},"examples":[{"en":"A sudden cackle came from the back of the room.","zh":"房间后面突然传来一阵刺耳的咯咯笑声。"},{"en":"He heard her cackle and knew she was teasing him again.","zh":"他听到她的怪笑声，就知道她又在逗他了。"}]}],"synonyms":["giggle","chuckle","snicker","laugh","crow"],"phonetic":"/ˈkækəl/","extraExplanation":["“cackle”常用来描写带有“尖、碎、刺耳”的笑声，因此语气可能偏负面（像在嘲笑别人），但也可以只是形容笑声很夸张。","在英语文化里，女巫（witch）常被描写为“cackling”（女巫怪笑），因此在小说、童话或恐怖氛围中很常见。","也可用于动物叫声，尤其是母鸡下蛋后的叫声（hen cackle），这也是它拟声来源之一。"]}
{"word":"cackled","summary":{"en":"“Cackled” means laughed loudly and harshly, or (for a hen) made a loud cackling sound.","zh":"“cackled”表示刺耳地大笑/怪笑；也可指（母鸡）咯咯叫。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"laughed in a loud, harsh way, often sounding a little cruel or like a witch’s laugh","zh":"发出尖声、刺耳的笑声；常带一点刻薄感或像“女巫笑”"},"examples":[{"en":"He cackled at his own joke, even though no one else laughed.","zh":"他对自己的笑话发出刺耳的笑声，尽管别人都没笑。"},{"en":"The villain cackled as the hero fell into the trap.","zh":"反派看着英雄掉进陷阱时得意地怪笑起来。"}]},{"partOfSpeech":"v.","definition":{"en":"(of a hen) made a loud, broken “ka-ka-ka” sound, especially after laying an egg","zh":"（母鸡）发出咯咯的叫声，尤指下蛋后"},"examples":[{"en":"The hen cackled loudly after laying an egg.","zh":"母鸡下完蛋后大声咯咯叫。"}]}],"synonyms":["guffawed","snickered","chuckled","crowed"],"phonetic":"/ˈkækəld/","extraExplanation":["“cackled”是动词“cackle”的过去式/过去分词。它常用于描写夸张、带反派气质的笑声（影视里常见），因此语气往往不太友善。","文学与流行文化里，“cackle”经常和witch（女巫）、villain（反派）一起出现，用来营造阴森或幸灾乐祸的氛围。"]}
{"word":"cackler","summary":{"en":"A cackler is someone (or an animal, especially a hen) that makes a loud, harsh cackling sound or laugh.","zh":"cackler 指发出咯咯笑/咯咯叫声音的人（或动物，尤指母鸡）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who cackles (laughs loudly in a harsh, excited, or slightly unpleasant way).","zh":"咯咯大笑的人；发出刺耳、兴奋或略显讨厌的笑声的人。"},"examples":[{"en":"Don’t be such a cackler—everyone can hear you across the room.","zh":"别咯咯笑个不停——隔着房间大家都能听见。"},{"en":"The comedian loved the cacklers in the front row because they made the whole crowd laugh.","zh":"那位喜剧演员很喜欢前排那些笑得很夸张的人，因为他们带动了全场气氛。"}]},{"partOfSpeech":"n.","definition":{"en":"An animal (especially a hen) that cackles.","zh":"会咯咯叫的动物（尤指母鸡）。"},"examples":[{"en":"A few cacklers in the coop started making noise as soon as the sun came up.","zh":"太阳一出来，鸡舍里几只母鸡就开始咯咯叫了。"}]}],"synonyms":["laugher","guffawer","hen"],"phonetic":"/ˈkæk.lɚ/","extraExplanation":["“cackler”来自动词“cackle”（咯咯笑/咯咯叫）。在描写笑声时，cackle常带有“尖、响、略刺耳”的感觉；在文学和流行文化里也常用来描写女巫式的笑声（例如“a witch’s cackle”），因此“cackler”有时会带一点负面或戏谑的语气，具体取决于语境。"]}
{"word":"cacklers","summary":{"en":"“Cacklers” means people (or hens) that make a loud, harsh cackling sound or laugh.","zh":"“cacklers”指咯咯笑的人，或（尤指下蛋后）咯咯叫的母鸡。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People (or animals) that cackle—laugh or make a loud, harsh, repetitive sound.","zh":"咯咯笑（或发出尖厉、重复叫声）的人（或动物）；咯咯笑的人。"},"examples":[{"en":"The cacklers in the back row laughed at every joke.","zh":"后排那些咯咯笑的人几乎每个笑话都笑个不停。"},{"en":"A group of cacklers surrounded the speaker and kept interrupting.","zh":"一群咯咯笑的人围着演讲者，不停打断他。"}]},{"partOfSpeech":"n.","definition":{"en":"Hens (female chickens) making the typical “cackle” sound, especially after laying an egg.","zh":"（尤指母鸡下蛋后）咯咯叫的母鸡。"},"examples":[{"en":"The cacklers in the coop got noisy just after dawn.","zh":"鸡舍里的母鸡天刚亮就吵闹起来。"},{"en":"We heard the cacklers after the hen laid an egg.","zh":"母鸡下蛋后，我们听到了咯咯叫声。"}]}],"synonyms":["laughers","snickerers","hens","cluckers"],"phonetic":"/ˈkæk.lɚ/","extraExplanation":["“Cacklers”是复数形式，单数是cackler。它来自动词cackle（咯咯笑/咯咯叫）。","在英语文化里，cackle常用来形容“尖厉、带点刺耳或不友善的笑声”，也常出现在对“女巫般的笑声”的描写中（偏文学/影视表达）。"]}
{"word":"cackles","summary":{"en":"“Cackles” means (1) laughs loudly and harshly, or (2) makes the typical hen sound; it can also mean a harsh laugh as a noun.","zh":"“cackles”可指（1）刺耳地咯咯笑，（2）母鸡咯咯叫；也可作名词指刺耳的笑声。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(as a verb) to laugh in a loud, harsh, often unpleasant way; to make a sharp, broken laugh","zh":"（作动词）咯咯地笑；发出刺耳、断断续续的笑声（常带嘲讽或让人不舒服的感觉）"},"examples":[{"en":"She cackles when she hears gossip.","zh":"她一听到八卦就咯咯地笑。"},{"en":"The witch in the story cackled loudly.","zh":"故事里的女巫大声发出刺耳的笑声。"},{"en":"He cackled at his own joke, but no one else laughed.","zh":"他对自己的笑话咯咯笑个不停，但别人都没笑。"}]},{"partOfSpeech":"v.","definition":{"en":"(about a hen) to make a loud, repetitive “ka-ka-ka” sound","zh":"（指母鸡）咯咯叫；发出连续的“咯咯”声"},"examples":[{"en":"The hens cackled after laying eggs.","zh":"母鸡下完蛋后咯咯叫。"},{"en":"I woke up to chickens cackling in the yard.","zh":"我被院子里鸡的咯咯叫声吵醒了。"}]},{"partOfSpeech":"n.","definition":{"en":"(as a noun) a loud, harsh laugh; a sharp broken laugh","zh":"（作名词）刺耳的笑声；咯咯笑（常显得刻薄或怪异）"},"examples":[{"en":"A sudden cackle came from the back of the room.","zh":"房间后面突然传来一阵刺耳的笑声。"},{"en":"His cackle made people uncomfortable.","zh":"他的咯咯笑让人不舒服。"}]}],"synonyms":["guffaws","laughs harshly","snickers","chuckles (sometimes, but usually softer)","crow (with laughter)"],"phonetic":"ˈkækəlz","extraExplanation":["“cackle”常被用来描写女巫、反派或爱八卦的人那种“尖、碎、带点恶意”的笑声，因此语气往往偏负面或带戏剧感。","它也常被认为是拟声词，模仿母鸡咯咯叫的声音；用在人笑时，暗示笑声像鸡叫一样刺耳或夸张。"]}
{"word":"cackling","summary":{"en":"Cackling means making a loud, harsh laugh, or making a hen-like sound.","zh":"cackling 指刺耳的咯咯大笑，或像母鸡一样咯咯叫。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"laughing in a loud, harsh, and often unpleasant way (the sound is broken into short bursts).","zh":"（以）刺耳、喧闹、常带令人不适的方式咯咯大笑（断断续续的笑声）。"},"examples":[{"en":"She walked in, cackling at her own joke.","zh":"她走进来，一边为自己的笑话咯咯大笑。"},{"en":"We could hear cackling from the next room.","zh":"我们能听到隔壁房间传来的咯咯笑声。"}]},{"partOfSpeech":"adj.","definition":{"en":"making the short, sharp sound that a chicken (especially a hen) makes.","zh":"（像母鸡一样）发出咯咯的叫声。"},"examples":[{"en":"Hens were cackling behind the barn.","zh":"谷仓后面母鸡在咯咯叫。"},{"en":"A cackling rooster woke us up early.","zh":"一只咯咯叫的公鸡把我们很早吵醒了。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or sound of cackling (a harsh laugh or a hen’s call).","zh":"咯咯大笑（或母鸡咯咯叫）的动作或声音。"},"examples":[{"en":"Her cackling echoed down the hallway.","zh":"她的咯咯笑声在走廊里回荡。"}]}],"synonyms":["giggling","chortling","snickering","howling with laughter","clucking"],"phonetic":"/ˈkækəlɪŋ/","extraExplanation":["“cackling”常带一点负面或讽刺的语气：不仅是“大笑”，还暗示笑声刺耳、幸灾乐祸或不够友善。","在英语文化里，“witch’s cackle”（女巫的怪笑）是常见搭配，常用于故事、童话或万圣节语境，强调阴森、怪异的笑声。"]}
{"word":"cacks","summary":{"en":"“Cacks” is British slang for trousers/underwear; it can also be the verb form meaning “poops” (very informal/crude).","zh":"“cacks”是英式俚语，指裤子/内裤；也可作动词第三人称单数，表示“拉屎”（非常口语、略粗俗）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(British, informal) Trousers or underwear (usually used in the plural).","zh":"（英式，非正式）裤子；内裤（通常用复数形式）。"},"examples":[{"en":"He spilled coffee all over his cacks.","zh":"他把咖啡洒得满裤子都是。"},{"en":"I need to buy some new cacks for work.","zh":"我得买几条新的裤子上班穿。"}]},{"partOfSpeech":"v.","definition":{"en":"(Very informal, sometimes crude) To pass stool; to poop. “Cacks” is the third-person singular form (he/she/it cacks).","zh":"（非常口语，略粗俗）排便；拉屎。“cacks”是第三人称单数（他/她/它拉屎）。"},"examples":[{"en":"The baby cacks whenever we change the diaper.","zh":"我们一换尿布，宝宝就会拉。"},{"en":"The dog cacks on the lawn if you don’t take it out in time.","zh":"如果你不及时带狗出去，它就会在草坪上拉屎。"}]}],"synonyms":["trousers","pants","underwear","poops (as a verb)","defecates (formal)"],"phonetic":"/kæks/","extraExplanation":["“cacks”多见于英式口语，常用来随意地说“裤子/内裤”，语气有点戏谑；正式场合建议用 trousers（英）/pants（美）或 underwear。","动词 cack（拉屎）带有粗俗、搞笑或贬义色彩，日常礼貌表达更常用 poop / have a bowel movement。"]}
{"word":"CACM","summary":{"en":"CACM most commonly means Communications of the ACM, a major computing magazine/journal published by ACM.","zh":"CACM 最常指《Communications of the ACM》，即 ACM（国际计算机学会）出版的重要计算机杂志/期刊。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Communications of the ACM: a well-known magazine/journal published by the Association for Computing Machinery (ACM), featuring articles and news about computer science and technology.","zh":"《Communications of the ACM》（简称 CACM）：由国际计算机学会（ACM）出版的知名杂志/期刊，刊登计算机科学与技术相关的文章与资讯。"},"examples":[{"en":"I read an article in CACM about the future of AI systems.","zh":"我在 CACM 上读到一篇关于 AI 系统未来的文章。"},{"en":"Her research was discussed in CACM, which boosted its visibility.","zh":"她的研究被 CACM 讨论报道后，关注度更高了。"},{"en":"Many classic computing essays have appeared in CACM.","zh":"很多经典的计算文章都曾刊登在 CACM 上。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation that may refer to other organizations or terms depending on context (less common than the computing meaning).","zh":"在不同语境中也可能指其他机构或术语的缩写（但不如计算机领域的用法常见）。"},"examples":[{"en":"In this document, CACM refers to a different committee, not the ACM journal.","zh":"在这份文件里，CACM 指的是另一个委员会，不是 ACM 的期刊。"}]}],"synonyms":["Communications of the ACM","the ACM journal"],"phonetic":"/ˌsiː eɪ siː ˈɛm/","extraExplanation":["CACM 通常读作字母缩读（C-A-C-M）。它是计算机领域很有影响力的刊物之一，常用于学术/业界交流、观点文章、趋势讨论等。","ACM 是 Association for Computing Machinery（国际计算机学会）。在写作中第一次出现时常写全称 “Communications of the ACM (CACM)”，之后再用缩写。"]}
{"word":"caco","summary":{"en":"caco- is a prefix meaning “bad,” “unpleasant,” or “harsh,” as in cacophony.","zh":"caco- 是表示“坏的/不愉快的/刺耳的”的前缀，如 cacophony。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a prefix meaning “bad,” “unpleasant,” or “harsh,” used in some English words (often from Greek roots).","zh":"前缀，表示“坏的 / 不愉快的 / 刺耳的”，常见于一些源自希腊语词根的英语单词中。"},"examples":[{"en":"The word “cacophony” uses caco- to mean “harsh sound.”","zh":"“cacophony（刺耳的噪音）”里的 caco- 表示“刺耳/不悦耳”。"},{"en":"“Cacology” refers to bad or improper language use.","zh":"“cacology（用词不当/拙劣的措辞）”指糟糕或不规范的语言使用。"}]}],"synonyms":["kako-"],"phonetic":"ˈkækoʊ","extraExplanation":["caco- 来自希腊语 kakos（意为“坏的”）。英语里有时也会看到拼写变体 kako-（更接近原始希腊语拼写），但在常见词汇中 caco- 更普遍。","它多出现在较正式、学术或文学色彩的词里：例如 cacophony（刺耳的杂音）、cacophonic（刺耳的）、cacology（措辞拙劣）。日常口语里更常直接用 bad/awful/harsh 来表达。"]}
{"word":"cacocholia","summary":{"en":"Cacocholia is a rare word for persistent gloomy, negative thinking; historically it could also mean illness from “bad bile.”","zh":"cacocholia 是个罕见词，指持续的阴郁、负面想法；在旧医学中也可指“坏胆汁”导致的不适。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A morbid or persistent tendency toward unpleasant, gloomy, or “bad” thoughts; a state of melancholy or negative-mindedness (rare/archaic).","zh":"对不愉快、阴郁或“坏”想法的病态执着；消沉、负面心境（罕见/古旧用法）。"},"examples":[{"en":"After weeks of isolation, he slipped into cacocholia and assumed the worst about everything.","zh":"在隔离了几周后，他陷入了 cacocholia，总把一切往最坏处想。"},{"en":"The journal describes her cacocholia as a fog that made ordinary joys feel distant.","zh":"日记把她的 cacocholia 形容成一层雾，让平常的快乐都变得遥远。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical medicine) An unhealthy condition thought to be caused by “bad bile.”","zh":"（历史医学）被认为由“坏胆汁”引起的一种不健康状态。"},"examples":[{"en":"In older medical writing, cacocholia was linked to imbalanced humors rather than germs.","zh":"在较早的医学著作里，cacocholia 被归因于体液失衡，而不是细菌感染。"}]}],"synonyms":["melancholy","gloom","moroseness","negativity","depression (general use)"],"phonetic":"/ˌkækəˈkoʊliə/","extraExplanation":["这个词非常少见，多见于较老的英语文本或词典中。词源来自希腊语：kakos（坏的）+ chole（胆汁）。在古希腊—中世纪的“体液学说”里，胆汁被认为与情绪（尤其是忧郁）有关，因此该词既可指“阴郁的心理状态”，也可指“坏胆汁导致的疾病”。现代英语更常用 depression / melancholy / negativity 来表达类似意思。"]}
{"word":"cacochroia","summary":{"en":"Cacochroia is a rare term meaning an unhealthy or abnormal skin color.","zh":"Cacochroia 是个罕见词，指皮肤呈现不健康或异常的颜色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abnormal or unhealthy color of the skin (a “bad complexion”), often mentioned in older medical writing","zh":"（皮肤）异常或不健康的颜色；“病态的肤色”（多见于较旧的医学用语）"},"examples":[{"en":"The doctor noted cacochroia and suspected a liver problem.","zh":"医生记录了患者的病态肤色，并怀疑有肝脏问题。"},{"en":"In older texts, cacochroia could refer to a yellowish or dull skin tone linked to illness.","zh":"在较旧的文献中，“cacochroia”可指与疾病相关的发黄或暗沉肤色。"}]}],"synonyms":["unhealthy complexion","abnormal skin coloration","discoloration"],"phonetic":"/ˌkækoʊˈkrɔɪə/","extraExplanation":["词源：来自希腊语 kakos（坏的）+ chroia（颜色/肤色）。字面意思就是“坏的肤色”。","使用场景：这是一个比较罕见、偏历史/学术的词。现代英语医学中更常直接用更具体的描述，比如 jaundice（黄疸）、cyanosis（发绀）、pallor（苍白）等。"]}
{"word":"cacochylia","summary":{"en":"Cacochylia is a rare medical term for an unpleasant or distorted taste in the mouth (a kind of taste disorder).","zh":"cacochylia 是较少见的医学用语，指口中出现令人不快或扭曲的味觉（味觉障碍的一种）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abnormal or unpleasant taste sensation in the mouth; a distorted sense of taste","zh":"口中出现异常或令人不快的味觉；味觉扭曲（味觉异常）"},"examples":[{"en":"After starting the antibiotic, she noticed a constant metallic taste—her doctor called it cacochylia.","zh":"开始服用抗生素后，她一直觉得口中有金属味——医生称之为 cacochylia（味觉异常）。"},{"en":"Cacochylia can make food taste bitter or “off,” even when it is fresh.","zh":"cacochylia 会让食物尝起来发苦或“不对劲”，即使食物很新鲜。"}]}],"synonyms":["dysgeusia","taste disturbance","bad taste"],"phonetic":"/ˌkækoʊˈkaɪliə/","extraExplanation":["这是一个较少见、偏医学/旧式医学文献中的词。现代更常用的对应词是 dysgeusia（味觉异常/味觉障碍）。","词根来源可拆为 caco-（表示“坏的、不良的”）+（-chylia 相关成分在词源上与“汁液/体液”概念有关）。整体表达“味觉变坏/味觉不正常”。"]}
{"word":"cacochymia","summary":{"en":"Cacochymia means a sickly, unhealthy bodily state, especially as explained in older medicine as caused by “bad” bodily fluids.","zh":"Cacochymia 指一种病弱、不健康的身体状态，尤指古医学中用“体液不良/败坏”来解释的病态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an unhealthy condition of the body, especially one believed (in older medical theory) to be caused by “bad” bodily fluids or poor nourishment; general ill health or a sickly state","zh":"（古医学观念中）因“体液不良/败坏”或营养差而导致的身体不健康状态；泛指病弱、体质衰败"},"examples":[{"en":"The physician described the patient’s weakness as a kind of cacochymia.","zh":"医生把病人的虚弱描述为一种“cacochymia”（体液不良导致的病弱状态）。"},{"en":"In older texts, cacochymia was blamed on corrupted humors in the body.","zh":"在较早的文献中，人们把 cacochymia 归咎于体内“体液（humors）败坏”。"}]}],"synonyms":["cachexia","debility","ill health","dyscrasia"],"phonetic":"/ˌkækəˈkaɪmiə/","extraExplanation":["这是一个很少见、偏历史医学的词。它来自希腊语：kakos（坏的）+ chymos（汁液/体液）。在“体液学说”（humoral theory）流行的年代，人们认为血液、黏液、黄胆汁、黑胆汁等体液失衡会致病，因此 cacochymia 常见于古老医书或文学化的医学描写。现代医学语境更常用 cachexia（恶病质）等词。"]}
{"word":"cacochymic","summary":{"en":"Cacochymic means “unhealthy or sickly,” especially in old medical/literary language.","zh":"cacochymic 指“体质不健康、病态虚弱”，多见于旧医学或文学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(old-fashioned) Unhealthy or sickly; having an unhealthy body condition (especially in older medical ideas: having “bad humors”).","zh":"（旧式用法）体质不健康的；病态的、虚弱的（尤指旧医学观念中“体液/体质失衡、坏体液过多”）。"},"examples":[{"en":"In the old report, the patient is described as cacochymic and weak.","zh":"在那份旧报告里，病人被描述为体质不健康、虚弱。"},{"en":"After weeks of poor food and stress, he felt pale and cacochymic.","zh":"在连续几周饮食糟糕、压力很大之后，他感觉脸色苍白、身体状态很差。"}]}],"synonyms":["unhealthy","sickly","ailing","in poor health","unwell","invalid"],"phonetic":"/ˌkækəˈkɪmɪk/","extraExplanation":["这个词较少用于现代日常英语，更多见于旧医学/文学语境。词源来自希腊语：caco- 表示“坏的”，-chymic 与“液体/体液（chyme、chyle）”相关，因此原意接近“坏体液导致的病态体质”。现代更常用的替代说法有 unhealthy / sickly / in poor health。"]}
{"word":"cacochymical","summary":{"en":"Cacochymical is an old-fashioned adjective meaning “having bad humors” (unhealthy) or “impure/contaminated,” especially in early medical or alchemical writing.","zh":"cacochymical 是一个古旧形容词，指“体液不良、体质不健康（病态）”，也可指“含杂质、不纯”（尤用于早期医学或炼金术/旧化学语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(archaic) Having bad body fluids (“humors”); unhealthy, sickly, or impure in bodily constitution.","zh":"（古义）体液（“四体液/体液说”）不良的；体质不健康的、病态的；体内不纯的。"},"examples":[{"en":"In older medical writing, a person might be described as cacochymical if they were thought to have “bad humors.”","zh":"在较早的医学写作中，如果一个人被认为“体液不良”，就可能被形容为 cacochymical。"},{"en":"The doctor blamed his constant fatigue on a cacochymical constitution.","zh":"医生把他长期疲劳归咎于“体质失衡/体液不良”。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) Containing impurities; of poor quality—especially in old chemistry/alchemy contexts.","zh":"（罕见）含杂质的；质量差的（尤指旧时化学/炼金术语境）。"},"examples":[{"en":"The text warns that a cacochymical mixture will not yield a clean result.","zh":"该文本警告说，含杂质的混合物不会产生纯净的结果。"},{"en":"They rejected the ore as cacochymical and unsuitable for refining.","zh":"他们认为这矿石杂质太多，不适合提炼。"}]}],"synonyms":["unhealthy","sickly","ill-constituted","impure","contaminated","tainted"],"phonetic":"/ˌkækəˈkaɪmɪkəl/","extraExplanation":["这个词比较少见、带有强烈的“旧时代”味道，常出现在早期医学与“体液学说”（humorism）的语境中：当时认为健康取决于体内体液是否平衡，“caco-”表示“坏/不良”，“chymical”与“化学/炼金术（chemical/chymical）”有关。现代英语里更常用 sickly / unhealthy / impure 等词来表达类似意思。","拼写上你可能会见到旧式的 chymical（而不是 chemical），多见于17世纪左右的文本。"]}
{"word":"cacochymy","summary":{"en":"Cacochymy is a rare, old medical term meaning “bad humors/bodily fluids,” used to describe an unhealthy bodily condition.","zh":"Cacochymy 是一个罕见的旧医学术语，指“体液（四体液/血液等）不良”，用来描述身体不健康的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medicine, historical) A bad condition of the body’s “humors” or blood; poor bodily fluids thought to cause illness.","zh":"（医学，历史用语）体液（四体液/血液等）状态不良；被认为会导致疾病的“恶体液”状态。"},"examples":[{"en":"In older medical writing, cacochymy was blamed for many chronic illnesses.","zh":"在早期医学著作中，人们常把许多慢性病归咎于 cacochymy（恶体液状态）。"},{"en":"The doctor described the patient’s weakness as coming from cacochymy.","zh":"医生把病人的虚弱描述为源于 cacochymy（体液失调）。"}]},{"partOfSpeech":"n.","definition":{"en":"An unhealthy, “impure” bodily state; general ill health (rare, literary/archaic).","zh":"（罕见，文学/古语）不健康、“不纯”的身体状态；泛指体质不佳。"},"examples":[{"en":"The novel uses the word cacochymy to suggest a sickly atmosphere in the household.","zh":"小说用 cacochymy 来暗示家中一种病态的氛围。"}]}],"synonyms":["ill health","humoral imbalance","morbid state","impurity (archaic sense)"],"phonetic":"/ˌkækoʊˈkaɪmi/","extraExplanation":["这个词很少出现在现代英语里，主要见于古代/早期医学语境。它来自希腊语词根：kako-（坏的）+ chymos（汁液、体液），与早期“体液学说”（四体液）有关：人们认为体液失衡会导致疾病。","现代医学不会用 cacochymy 作为诊断词；如果在当代文章里看到，多半是历史讨论、学术引用，或作家用来营造“阴郁、病弱”的文学效果。","相关词根提示：caco- 常表示“坏、恶”（如 cacophony“刺耳的声音”），-chymy 与“混合/汁液/化学”有关（如 alchemy/chemistry 在词源上有联系）。"]}
{"word":"cacocnemia","summary":{"en":"Cacocnemia is a rare term for unpleasant sensations (often in the legs) and, even more rarely, a delusional belief of evil influence or possession of the limbs.","zh":"Cacocnemia 是一个罕见词，指（常在腿部的）不适/疼痛感觉；更罕见时也指认为四肢被恶灵影响或附体的妄想。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medicine, rare) An abnormal condition marked by unpleasant or painful sensations, especially in the legs.","zh":"（医学，罕见）一种异常状态，以令人不适或疼痛的感觉为特征，尤指腿部。"},"examples":[{"en":"The patient complained of burning sensations in his calves that the old textbook described as cacocnemia.","zh":"病人抱怨小腿有灼烧感，那本旧教材把这种情况称为 cacocnemia。"},{"en":"In modern writing, doctors usually use terms like “dysesthesia” instead of cacocnemia.","zh":"在现代写作中，医生通常用“感觉异常（dysesthesia）”之类的术语，而不是 cacocnemia。"}]},{"partOfSpeech":"n.","definition":{"en":"(very rare) A delusional belief that one’s body—especially the limbs—is possessed or influenced by an evil spirit.","zh":"（极罕见）一种妄想：认为自己的身体——尤其四肢——被恶灵附体或操控。"},"examples":[{"en":"In historical accounts of superstition and illness, cacocnemia was sometimes used for fears of possession.","zh":"在关于迷信与疾病的历史记载中，cacocnemia 有时被用来指“被附体”的恐惧。"},{"en":"The author mentions cacocnemia to show how people once explained strange physical symptoms in spiritual terms.","zh":"作者提到 cacocnemia，是为了展示人们曾如何用灵异解释奇怪的身体症状。"}]}],"synonyms":["dysesthesia","paresthesia","delusion of possession"],"phonetic":"/ˌkækoʊˈniːmiə/","extraExplanation":["这是一个非常少见、偏旧式的词，多见于早期医学或历史性文本。现代医学更常用的近义概念包括 dysesthesia（感觉异常、刺痛/灼痛等不适感觉）或 paresthesia（感觉异常、麻刺感）。","词形来自希腊语构词：caco- 表示“坏的、恶的”，-cnemia 与“小腿/腿部”有关，因此字面上可理解为“腿部的不良状态/恶感”。第二个义项（被恶灵影响）反映了某些时期把异常症状用宗教或灵异方式解释的文化背景。"]}
{"word":"cacodaemon","summary":{"en":"Cacodaemon means an evil spirit/demon, and sometimes (literarily) a wicked person.","zh":"cacodaemon 指“恶灵/魔鬼”，也可在文学语境中比喻“恶人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an evil spirit or demon; a malevolent supernatural being","zh":"恶灵；魔鬼；邪恶的超自然存在"},"examples":[{"en":"In medieval stories, a cacodaemon tempts people into harmful choices.","zh":"在中世纪故事里，恶灵会引诱人做出有害的选择。"},{"en":"The poem describes a cacodaemon whispering lies in the dark.","zh":"这首诗描写一个恶灵在黑暗中低声撒谎。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative, often literary) a wicked or cruel person","zh":"（比喻，多用于文学）恶人；残忍的人"},"examples":[{"en":"The villain is portrayed as a cacodaemon, delighting in suffering.","zh":"反派被刻画成一个“恶魔般”的人，以他人的痛苦为乐。"},{"en":"Don’t use words like cacodaemon for real people in everyday talk—it sounds overly dramatic.","zh":"在日常交流中别用 cacodaemon 形容真人——听起来过于戏剧化。"}]}],"synonyms":["demon","evil spirit","fiend","devil","malevolent spirit"],"phonetic":"/ˌkækəˈdiːmən/","extraExplanation":["词源来自希腊语：kakos（坏的、邪恶的）+ daimōn（精灵/神灵/守护灵）。在古希腊文化里，daimōn 不一定是“恶魔”，可以是中性或带有“命运之灵”的意味；加上 kakos 才明确指“恶灵”。","该词在现代英语中较罕见，更多见于宗教、神秘学、文学或哥特风格写作中，用来营造阴森、古典的语气。"]}
{"word":"cacodaemoniac","summary":{"en":"Cacodaemoniac is a rare, old-fashioned word meaning “demon-possessed,” and can also refer to a person believed to be possessed.","zh":"cacodaemoniac 是个罕见的古老用词，意为“像被恶魔/恶灵附体的”，也可指“被认为被恶灵附体的人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) Seemingly possessed by an evil spirit; wildly, frantically, or disturbingly deranged (often used in old-fashioned or literary writing).","zh":"（形）似被恶灵附体的；疯狂、狂乱或令人不安地失常的（多见于古典或文学语境）。"},"examples":[{"en":"The novel describes a cacodaemoniac laugh echoing through the empty hall.","zh":"小说描写了一阵像被恶灵附体般的笑声在空旷的大厅里回荡。"},{"en":"In the old tale, the soldier becomes cacodaemoniac after hearing the curse.","zh":"在那个古老故事里，士兵听到诅咒后变得像被恶灵附体般狂乱。"}]},{"partOfSpeech":"n.","definition":{"en":"(n.) A person believed to be possessed by an evil spirit (rare; archaic).","zh":"（名）被认为遭恶灵附体的人（罕见；古语）。"},"examples":[{"en":"The villagers feared he was a cacodaemoniac and refused to let him enter the church.","zh":"村民害怕他是个被恶灵附体的人，拒绝让他进教堂。"}]}],"synonyms":["demon-possessed","possessed","bewitched","deranged","maniacal"],"phonetic":"/ˌkækədiːˈmoʊniˌæk/","extraExplanation":["这个词非常少见，带有强烈的宗教与民俗色彩，常出现在较古老的文本中；现代英语更常用 possessed / demon-possessed / deranged 等表达。","词源可拆为希腊语 kakos（坏的、邪恶的）+ daimōn（灵、精灵/神灵），因此字面意思就是“邪灵相关的/邪灵附体的”。","在文学或哥特式（Gothic）氛围的描写里，它常用来营造“受邪恶力量驱使”的恐怖感，不一定指医学意义上的精神疾病。"]}
{"word":"cacodaemonial","summary":{"en":"Cacodaemonial means “demon-like” or “related to an evil spirit,” and it is mainly used in literary contexts.","zh":"cacodaemonial 指“恶魔般的/与恶灵有关的”，主要见于文学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an evil spirit or demon; demonic, sinister (a rare, literary word).","zh":"与恶灵、恶魔有关的；带有邪恶、阴森气息的（较少见的文学用词）。"},"examples":[{"en":"The novel describes a cacodaemonial presence that seems to haunt the old house.","zh":"小说描写了一种似乎萦绕在老宅中的恶灵般存在。"},{"en":"He spoke of his nightmares in strangely cacodaemonial imagery.","zh":"他用一种怪异而带有恶魔色彩的意象来描述自己的噩梦。"}]}],"synonyms":["demonic","diabolical","infernal","sinister"],"phonetic":"/ˌkækədiˈmoʊniəl/","extraExplanation":["这个词非常少见，常见于文学或学术化的描写，用来营造“邪灵/恶魔般”的氛围。","词根来自希腊语：kakos（坏的、邪恶的）+ daimōn（灵、精灵；后来常译作“恶魔”）。与之相对的词有 eudaemon / eudaimonic（与“善灵、幸福、良好精神状态”相关）。"]}
{"word":"cacodaemonic","summary":{"en":"Cacodaemonic means “demon-like or wicked,” and rarely can mean “a demon” in literary writing.","zh":"cacodaemonic 指“如恶魔般的、邪恶阴森的”，极少数情况下在文学中也可作名词指“恶魔/恶灵”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to evil spirits or demons; wicked, sinister, or devilish.","zh":"与恶灵/恶魔有关的；邪恶的、阴森的、如魔般的。"},"examples":[{"en":"The novel’s villain is described in almost cacodaemonic terms.","zh":"小说里的反派被描写得几乎像恶魔一样邪恶。"},{"en":"A cacodaemonic force seemed to haunt the abandoned house in the story.","zh":"故事里仿佛有一股恶魔般的力量在纠缠那栋废弃的房子。"}]},{"partOfSpeech":"n.","definition":{"en":"A demon; an evil spirit (rare, chiefly literary).","zh":"恶魔；恶灵（罕见，多见于文学语境）。"},"examples":[{"en":"In the poem, a cacodaemonic whispers temptations to the traveler.","zh":"在诗中，一个恶魔般的精灵对旅人低语诱惑。"}]}],"synonyms":["demonic","daemonic","diabolical","sinister","malevolent","fiendish"],"phonetic":"/ˌkækoʊdiˈmɑnɪk/","extraExplanation":["词源来自希腊语：kakos（坏的、邪恶的）+ daimon（精灵/神灵）。英语里更常见的相关词是 *daemonic/demonic*（恶魔的）以及 *cacodemon*（恶魔）。","这是偏文学、偏古典的词，常用于营造阴森、宗教或神话色彩；日常英语里通常用 *demonic*, *sinister*, *malevolent* 更自然。"]}
{"word":"cacodemon","summary":{"en":"A cacodemon is an evil spirit or demon; figuratively, it can mean a person’s inner “demon” like hatred or addiction.","zh":"cacodemon 指“恶魔/邪灵”；也可比喻人的“心魔”，如仇恨、成瘾或内疚等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an evil spirit or demon; a malevolent supernatural being","zh":"恶魔；邪灵；作祟的恶灵（带有强烈“邪恶、祸害”含义）"},"examples":[{"en":"In medieval stories, a cacodemon tempts people into doing harm.","zh":"在中世纪故事里，恶魔会诱使人们做坏事。"},{"en":"The villagers believed a cacodemon was causing the strange illness.","zh":"村民们相信有恶魔在作祟，导致这种怪病。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) a destructive force inside a person, such as hatred, addiction, or guilt","zh":"（比喻）心魔；内在的破坏力量（如仇恨、上瘾、内疚等）"},"examples":[{"en":"He fought his own cacodemon of jealousy for years.","zh":"他多年与自己“嫉妒的心魔”作斗争。"},{"en":"For her, the cacodemon was shame that never went away.","zh":"对她来说，那个恶魔般的东西就是挥之不去的羞耻感。"}]}],"synonyms":["demon","evil spirit","fiend","devil","inner demon"],"phonetic":"/ˌkækoʊˈdiːmən/","extraExplanation":["词源来自希腊语：kakos（坏的、邪恶的）+ daimōn（精灵、神灵）。因此它字面意思就是“邪恶的灵”。","在英语文学语境中，这个词带有古典/宗教色彩，常出现在史诗、神学讨论或哥特式、奇幻作品里。弥尔顿（John Milton）的《失乐园》（Paradise Lost）等作品语境中常见与“demon/fiend”一类的近义用法。"]}
{"word":"cacodemonia","summary":{"en":"Cacodemonia is a rare noun meaning the influence or worship of evil spirits, or being troubled/possessed by them.","zh":"Cacodemonia 是个少见名词，指恶灵/恶魔的影响或崇拜，或被其困扰/附身的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the belief in, worship of, or influence of evil spirits or demons; being troubled or “possessed” by an evil spirit (a rare, literary word).","zh":"对恶灵/恶魔的信仰、崇拜或其影响；（文学或古旧用法）被恶灵困扰或“附身”的状态。"},"examples":[{"en":"In the old tale, the village blamed the strange illness on cacodemonia.","zh":"在那个古老故事里，村民把怪病归咎于“恶灵作祟”（cacodemonia）。"},{"en":"The poet uses cacodemonia to describe a mind haunted by destructive thoughts.","zh":"诗人用 cacodemonia 来形容被毁灭性念头纠缠的心灵。"}]}],"synonyms":["demonic possession","demon worship","malevolent spirit influence","evil spirits"],"phonetic":"/ˌkækoʊdɪˈmoʊniə/","extraExplanation":["词源来自希腊语：kako-（坏的、恶的）+ daimon（灵、神灵）。在古典与中世纪语境中，daimon 不一定全是“恶魔”，但与 kako- 结合后就明确指“恶灵/恶性神灵”。","这是非常少见的书面词，现代英语更常用 demonic possession（恶魔附身）、evil spirits（恶灵）、demonology（恶魔学）等表达。"]}
{"word":"cacodemoniac","summary":{"en":"Cacodemoniac means “demon-possessed,” used mainly in old-fashioned, religious, or literary contexts.","zh":"cacodemoniac 指“被恶魔/邪灵附身的”，多用于古旧、宗教或文学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Possessed by an evil spirit or demon; showing signs of supposed demonic possession (an old-fashioned or literary word).","zh":"（古旧/文学用语）被恶灵或恶魔附身的；表现出似乎被邪灵控制的。"},"examples":[{"en":"In the old tale, the villagers feared the man was cacodemoniac and avoided him.","zh":"在那个古老的故事里，村民害怕那个人被恶魔附身，于是躲着他。"},{"en":"The novel describes her nightmares in almost cacodemoniac language.","zh":"小说用近乎“被恶魔缠身”般的措辞描写她的噩梦。"}]},{"partOfSpeech":"n.","definition":{"en":"A person believed to be possessed by an evil spirit (rare).","zh":"（罕见）被认为被恶灵附身的人。"},"examples":[{"en":"The preacher called the suffering man a cacodemoniac.","zh":"传教士称那个受苦的人为“被恶灵附身者”。"}]}],"synonyms":["demon-possessed","possessed","bewitched","diabolical","demonic"],"phonetic":"ˌkækəˌdiːməˈnaɪæk","extraExplanation":["词源来自希腊语：kakos（坏的、邪恶的）+ daimōn（灵体、精灵/神灵）。早期英语中常见于宗教文本或关于“附身/驱魔”的叙述，如今多见于文学、历史语境或带有夸张色彩的描写。使用时注意文化敏感性：现代语境中把真实的心理或医学问题直接说成“被附身”可能造成误解或冒犯。"]}
{"word":"cacodemonial","summary":{"en":"A rare adjective meaning “demonic; related to an evil spirit (cacodemon).”","zh":"一个很少见的形容词，意为“恶魔般的；与恶灵/恶魔（cacodemon）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to a cacodemon (an evil spirit); demonic; having the character of an evil demon.","zh":"与“恶魔/恶灵（cacodemon）”有关的；恶魔般的；带有邪恶妖魔特质的。"},"examples":[{"en":"The novel describes a cacodemonial presence that tempts the hero in his dreams.","zh":"小说描写了一种在梦中诱惑主角的恶魔般存在。"},{"en":"Critics called the villain’s laughter almost cacodemonial in its cruelty.","zh":"评论家说反派的笑声残忍得近乎恶魔般。"}]}],"synonyms":["demonic","devilish","infernal","satanic","fiendish"],"phonetic":"/ˌkækoʊdɪˈmoʊniəl/","extraExplanation":["“cacodemonial”非常罕见，多见于文学化、古风或学术风格的英文中，用来强调“邪恶、恶灵附体般”的气氛。日常表达更常用：demonic, devilish, infernal。","词源提示：caco- 来自希腊语 kakos（“坏的、邪恶的”），-demon- 来自 daimon（“灵、神灵/精灵”）。因此它字面意思接近“与邪恶之灵有关的”。"]}
{"word":"cacodemonic","summary":{"en":"Cacodemonic means “demonic” or “evil-spirit-like,” used mainly in literary or dramatic writing.","zh":"cacodemonic 指“恶魔般的、像邪灵一样的”，多用于文学或夸张的描写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like an evil spirit or demon; extremely wicked, frightening, or malevolent.","zh":"像恶魔/邪灵一样的；极其邪恶、可怕、充满恶意的。"},"examples":[{"en":"The novel’s villain is described as having a cacodemonic grin.","zh":"小说里的反派被描写成带着一种恶魔般的狞笑。"},{"en":"After the betrayal, she felt hunted by a cacodemonic force in her own mind.","zh":"遭到背叛后，她觉得自己被内心某种恶魔般的力量追逐。"}]}],"synonyms":["demonic","devilish","malevolent","fiendish","evil"],"phonetic":"/ˌkækoʊdaɪˈmɑnɪk/","extraExplanation":["词源上与希腊语有关：kakos（坏的、邪恶的）+ daimōn（灵、神灵/精灵）。因此 cacodemonic 字面意思就是“邪灵般的”。","这是偏文学/修辞色彩很强的词，常见于哥特式、恐怖、奇幻或较正式的描写中；日常英语更常用 demonic / devilish / evil。"]}
{"word":"cacodemonize","summary":{"en":"Cacodemonize means to demonize—portray someone or something as evil, often in an exaggerated way.","zh":"cacodemonize 意为“妖魔化”，把某人或某事描绘成邪恶（常带夸张语气）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to portray someone or something as an evil spirit or as extremely evil; to demonize (often in an exaggerated, dramatic way).","zh":"把某人或某事描绘成邪灵或极端邪恶的存在；将其“妖魔化”（常带夸张、戏剧化语气）。"},"examples":[{"en":"Some tabloids cacodemonize public figures to make scandals feel bigger than they are.","zh":"一些小报会把公众人物妖魔化，让丑闻看起来比实际更严重。"},{"en":"The novel shows how fear can cacodemonize a whole community in times of crisis.","zh":"这部小说展现了在危机时期，恐惧如何把整个群体“妖魔化”。"}]}],"synonyms":["demonize","vilify","blacken","malign","monsterize"],"phonetic":"/ˌkækoʊˈdiːmənaɪz/","extraExplanation":["这是个非常少见、偏文学/修辞的词，常用于强调“把人描绘得像恶魔一样”的夸张效果。","词源可拆为 caco-（表示“坏的、恶的”）+ demon/daemon（“恶魔、精灵”）+ -ize（动词后缀“使……成为”）。","在日常英语里更常用的是 demonize。cacodemonize 往往带有更“古典/怪诞/哥特式”的味道，适合写作或评论中刻意增强语气时使用。"]}
{"word":"cacodemonomania","summary":{"en":"A rare noun meaning an intense fixation on demons or demonic influence.","zh":"一个罕见名词：指对恶魔或“恶魔影响/附身”的强烈执念或恐惧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An intense obsession with, fear of, or belief in demons/evil spirits; a fixation on demonic influence (often used in a dramatic, occult, or pseudo-psychological way rather than as a standard clinical term).","zh":"对“恶魔/邪灵”的强烈痴迷、恐惧或深信不疑；对“被恶魔影响/附身”的过度关注（多用于戏剧化、神秘学或非正式的心理学语境，并非标准临床诊断用语）。"},"examples":[{"en":"After watching horror videos for weeks, he slipped into cacodemonomania and started seeing demons in every shadow.","zh":"连着看了几周恐怖视频后，他几乎陷入了对恶魔的执念，开始在每个影子里都“看见”恶魔。"},{"en":"The novel’s narrator suffers from cacodemonomania, interpreting ordinary noises as signs of demonic presence.","zh":"小说中的叙述者患有“恶魔妄想式的执念”，把普通的声响都解读为恶魔存在的迹象。"},{"en":"Some online forums encourage cacodemonomania by treating every bad dream as proof of possession.","zh":"一些网络论坛把每个噩梦都当作“附身证据”，反而助长了对恶魔的偏执式沉迷。"}]}],"synonyms":["demon obsession","demon fixation","demonophobia (fear of demons)","belief in demonic possession"],"phonetic":"/ˌkækoʊˌdiːməˈnoʊmeɪniə/","extraExplanation":["词源拆解：caco-（坏的、恶的）+ demon（恶魔）+ -mania（狂热、躁狂/痴迷）。整体字面意思接近“对恶魔的狂热/痴迷”。","用法提示：这是非常罕见的词，更常见于文学、恐怖/哥特语境或夸张表达。若要更自然地表达，可用“obsession with demons / fear of demons / belief in demonic possession”等。","文化语境：不同文化对“鬼神/恶灵”的理解差异很大。英语里把强烈而持续的“被恶魔影响”的想法称作 mania，多半是修辞或叙事手法；现实中若这种想法影响生活，更适合用中性表述并寻求专业帮助。"]}
{"word":"cacodontia","summary":{"en":"Cacodontia means having bad or diseased teeth (poor dentition).","zh":"cacodontia 指牙齿状况不良或患病的状态（齿劣症）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a condition of having bad or diseased teeth; poor dentition.","zh":"齿劣症；牙齿状况不良（指牙齿腐坏、病变或整体牙列健康差的情况）。"},"examples":[{"en":"Untreated cavities can contribute to cacodontia over time.","zh":"龋齿如果长期不治疗，可能会逐渐导致齿劣症。"},{"en":"The report mentioned signs of cacodontia, including broken and decayed teeth.","zh":"报告提到有齿劣症迹象，包括牙齿断裂和蛀坏。"}]}],"synonyms":["poor dentition","bad teeth","dental decay (related)"],"phonetic":"/ˌkækoʊˈdɑnʃiə/","extraExplanation":["这是较少见、偏医学/牙科的词。词根来自希腊语：caco- 表示“坏的、不良的”（如 cacophony“刺耳的声音”），-dont- 表示“牙齿”（如 orthodontics“正畸学”），-ia 表示“疾病/状态”。字面意思就是“牙齿不良的状态”。","在日常英语中更常用的说法是 bad teeth、poor dentition、tooth decay（龋坏/蛀牙）等；cacodontia 多见于专业文本或正式报告。"]}
{"word":"cacodorous","summary":{"en":"“Cacodorous” describes something that smells extremely bad.","zh":"“cacodorous”指气味非常难闻、恶臭的事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a very bad or unpleasant smell; foul-smelling.","zh":"（气味）极难闻的；恶臭的。"},"examples":[{"en":"The trash can was cacodorous after sitting in the sun all day.","zh":"垃圾桶在太阳下晒了一整天后变得恶臭。"},{"en":"A cacodorous odor drifted from the drain, so we called a plumber.","zh":"下水道飘出一股难闻的臭味，所以我们叫了水管工。"}]}],"synonyms":["foul-smelling","stinking","rank","malodorous","putrid"],"phonetic":"/ˌkækəˈdɔrəs/","extraExplanation":["“cacodorous”是较少见、偏书面/文学性的词，日常口语里更常用“stinky / smelly / foul-smelling”。","词源上可拆解理解：caco-（坏的、恶的）+ odorous（有气味的）。因此它字面意思就是“坏味道的”。","在写作里它常用于强调“令人作呕的臭味”，带有夸张和强烈厌恶的语气；在正式说明文里用得较少。"]}
{"word":"cacodoxian","summary":{"en":"Cacodoxian means “unorthodox or heretical,” or a person who holds such beliefs.","zh":"cacodoxian 指“非正统/异端的（观点）”，也可指“持异端观点的人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"holding or expressing beliefs that go against accepted or “orthodox” opinions; heretical","zh":"（观点/信念）违背公认“正统”看法的；异端的"},"examples":[{"en":"His cacodoxian views made him unpopular in that very traditional group.","zh":"他那些离经叛道的观点，让他在那个非常传统的团体里不受欢迎。"},{"en":"The essay defends a cacodoxian idea: that failure can be more valuable than success.","zh":"那篇文章为一个“非正统”的观点辩护：失败有时比成功更有价值。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who holds beliefs that oppose accepted or orthodox opinions; a heretic","zh":"持异端观点的人；持非正统信念者"},"examples":[{"en":"In the novel, she is treated as a cacodoxian for questioning the old rules.","zh":"在小说里，她因为质疑旧规矩而被当作异端。"},{"en":"The community labeled him a cacodoxian, even though he only wanted open debate.","zh":"社区给他贴上“异端”的标签，尽管他只是想公开讨论。"}]}],"synonyms":["heretical","unorthodox","heterodox","contrarian","dissenter"],"phonetic":"/ˌkækəˈdɑːksiən/","extraExplanation":["词源来自希腊语：kakos（坏的）+ doxa（观点、意见）。字面意思接近“坏的观点/错误的意见”，因此常带有评价色彩：说话者通常认为这种观点“不正确”或“背离正统”。","这是一个非常罕见、偏文学/学术风格的词。日常英语里更常用 heretical（异端的）、unorthodox（非正统的）、heterodox（非正统的）或 contrarian（唱反调的）。"]}
{"word":"cacodoxical","summary":{"en":"Cacodoxical means ‘against common opinion; seeming wrong to most people but possibly true.’","zh":"cacodoxical 指“违背普遍看法的；多数人看来像错的但可能是真的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of an idea or statement) seeming wrong or strange to most people, but possibly true; contrary to common opinion.","zh":"（指观点或说法）在大多数人看来似乎错误或古怪，但可能是真的；与普遍看法相反的。"},"examples":[{"en":"Her cacodoxical claim—that taking more breaks can increase productivity—was later supported by research.","zh":"她那个看似“离经叛道”的主张——休息更多反而能提高效率——后来被研究支持了。"},{"en":"At first, the essay sounds cacodoxical, but the argument becomes convincing as you read on.","zh":"这篇文章一开始听起来很反常识，但越往下读论证越有说服力。"}]}],"synonyms":["unconventional","unorthodox","heterodox","contrary","iconoclastic"],"phonetic":"/ˌkækəˈdɑksɪkəl/","extraExplanation":["这个词很罕见，多用于较正式或学术/修辞语境。它来自希腊语词根：caco- 表示“坏、不好”，doxa 表示“意见、看法”（也出现在 orthodox“正统的”、heterodox“异端的”中）。因此 cacodoxical 字面感觉像“坏的意见/不正统的看法”，但在现代用法里更接近“反主流/反常识、看起来不对却可能有道理”。","易混词提示：cacodoxical 不是 “paradoxical（悖论的）”。paradoxical 强调“表面矛盾但可能真实”；cacodoxical 更强调“违背大众看法、看起来像错的”。"]}
{"word":"cacodoxy","summary":{"en":"Cacodoxy means bad or faulty reasoning—unsound thinking that leads to wrong conclusions.","zh":"cacodoxy 指“谬误的推理/不健全的思维方式”，常会导向错误结论。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"bad or faulty reasoning; an unsound way of thinking, often leading to wrong conclusions","zh":"谬误的推理；不健全的思维方式（常导致错误结论）"},"examples":[{"en":"The article is persuasive in tone, but its logic is cacodoxy.","zh":"这篇文章语气很有说服力，但它的逻辑是谬误的推理。"},{"en":"We should challenge the cacodoxy behind stereotypes, not just the words people use.","zh":"我们应当质疑刻板印象背后的谬误思维，而不只是人们用的词语。"}]}],"synonyms":["fallacy","faulty logic","bad reasoning","illogic","non sequitur"],"phonetic":"/ˌkækəˈdɑksi/","extraExplanation":["这个词很少见、偏书面（学术/修辞批评语境更常用）。日常英语里更常用：fallacy（谬误）、bad reasoning（糟糕的推理）、faulty logic（错误逻辑）。","词源上常被解释为来自希腊语：kakos（坏的）+ doxa（观点/信念）。与 orthodoxy（正统观念）在构词上形成对比：ortho-（正确的）vs caco-（坏的）。"]}
{"word":"cacodyl","summary":{"en":"Cacodyl is an arsenic-containing chemical group, usually the dimethylarsenic radical (CH₃)₂As–.","zh":"Cacodyl 指含砷的化学基团，通常是二甲基砷基（CH₃）₂As–。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical group (radical) containing arsenic, usually meaning the dimethylarsenic group, (CH₃)₂As–, found in some organoarsenic compounds.","zh":"（化学）含砷的基团（自由基），通常指二甲基砷基（CH₃）₂As–，存在于一些有机砷化合物中。"},"examples":[{"en":"In organoarsenic chemistry, the cacodyl group is written as (CH3)2As–.","zh":"在有机砷化学中，cacodyl 基团常写作（CH3）2As–。"},{"en":"Some older texts mention cacodyl compounds when discussing early studies of organometallic reactions.","zh":"一些较早的教材在讨论有机金属反应的早期研究时会提到 cacodyl 化合物。"}]}],"synonyms":["dimethylarsenic (group)","(CH3)2As– group","cacodyl group"],"phonetic":"/ˈkækəˌdɪl/","extraExplanation":["这个词来自希腊语词根，含有“恶臭/难闻气味”的含义；历史上“cacodyl（以及 cacodyl oxide）”因气味极其刺鼻而出名。","19 世纪化学家罗伯特·本生（Robert Bunsen）曾系统研究过 cacodyl 相关化合物；这类研究对早期有机金属/有机砷化学的发展有重要影响。","注意：cacodyl 相关物质通常具有毒性（含砷），现实中只应在严格的安全条件与专业指导下处理；日常英语中非常少见，多出现在专业化学语境。"]}
{"word":"cacodylate","summary":{"en":"Cacodylate is an arsenic-containing chemical (a salt/ester of cacodylic acid) mainly seen in lab contexts, especially in buffers; it is toxic.","zh":"Cacodylate 指含砷的卡可地酸盐/酯，主要出现在实验室语境（常见于缓冲液），且具有毒性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a salt or ester of cacodylic acid (dimethylarsinic acid); an arsenic-containing chemical sometimes used in laboratory buffers and in research, but toxic and handled with care","zh":"“二甲胂酸（卡可地酸）”的盐或酯；一种含砷化合物，有时用于实验室缓冲液和科研中，但有毒，需谨慎处理"},"examples":[{"en":"The protocol calls for a cacodylate buffer to maintain the pH during fixation.","zh":"该实验方案要求使用 cacodylate（卡可地酸盐）缓冲液在固定过程中维持 pH。"},{"en":"Because cacodylate contains arsenic, the waste must be disposed of as hazardous chemical waste.","zh":"由于 cacodylate 含砷，废液必须按危害化学废物处理。"}]}],"synonyms":["dimethylarsinate","sodium cacodylate (common lab form)"],"phonetic":"/kəˈkɑːdɪˌleɪt/","extraExplanation":["词源提示：cacodylate 来自 “cacodyl”（与砷的有机化合物有关），其更早的来源与希腊语中表示“恶臭/难闻”的词根有关；早期一些相关砷化合物确实气味刺鼻。","使用场景：在生物电镜/组织学等领域，你可能会看到 “sodium cacodylate buffer（卡可地酸钠缓冲液）”。这属于专业实验用语，日常英语中很少出现。","安全提示：它属于含砷化学品，英文安全文件里常见的搭配有 toxic（有毒的）、hazardous（有害/危险的）、proper disposal（正确处置）等。"]}
{"word":"cacodylic","summary":{"en":"“Cacodylic” means “related to cacodyl/cacodylic acid,” describing certain arsenic-containing chemical compounds.","zh":"“cacodylic”意为“与卡可地尔/卡可地酸有关的”，常指含砷的相关化学化合物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to cacodyl or cacodylic acid; used to describe certain (often toxic) organoarsenic compounds, especially in chemistry.","zh":"与“卡可地尔/二甲胂基”（cacodyl）或“卡可地酸”（cacodylic acid）有关的；用于描述某些（常有毒的）有机砷化合物，尤用于化学语境。"},"examples":[{"en":"The lab stored cacodylic acid in a dedicated cabinet because it contains arsenic.","zh":"实验室把卡可地酸单独存放在专用柜里，因为它含有砷。"},{"en":"Researchers used a cacodylic buffer for electron microscopy, following strict safety rules.","zh":"研究人员在电子显微镜实验中使用卡可地缓冲液，并严格遵守安全规范。"}]}],"synonyms":["cacodyl (related term)","cacodylate (related term)"],"phonetic":"/ˌkækəˈdɪlɪk/","extraExplanation":["该词主要出现在化学/生物实验语境中，例如“cacodylic acid（卡可地酸）”和“cacodylate buffer（卡可地酸盐缓冲液）”。它们含砷，具有毒性风险，通常需要在通风橱中操作并按危险化学品规范处理。","词源上与希腊语表示“恶臭”的词根有关（早期含砷有机物常有强烈难闻气味），因此在历史文献里也常带有“气味刺鼻/有害”的联想。"]}
{"word":"cacodyls","summary":{"en":"Cacodyls are foul-smelling organoarsenic groups, mainly mentioned in historical or specialized chemistry contexts.","zh":"Cacodyls 指带恶臭的有机砷基团，多用于化学史或专业化学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a foul-smelling organoarsenic group (the dimethylarsenic radical), (CH₃)₂As–, used mainly in chemistry history and specialized chemical contexts; plural: cacodyls.","zh":"一种带强烈恶臭的有机砷基团（“二甲基砷”自由基/基团），化学式为 (CH₃)₂As–；主要出现在化学史或专业化学语境中；复数：cacodyls。"},"examples":[{"en":"Early chemists described cacodyls as having an extremely unpleasant odor.","zh":"早期化学家形容 cacodyls 的气味极其难闻。"},{"en":"The paper mentions cacodyl compounds only in a historical discussion of organoarsenic chemistry.","zh":"这篇论文只在讨论有机砷化学的历史时提到了 cacodyl 类化合物。"}]}],"synonyms":["dimethylarsenic (group)","cacodyl radical"],"phonetic":"/ˈkækəˌdɪl/","extraExplanation":["词源来自希腊语 kakōdēs（“恶臭的”），因此它的命名本身就强调“臭味”。","cacodyl 在化学史上很有名：19世纪的研究推动了有机金属/有机元素化学的发展，但由于含砷且有毒、气味强烈，如今多见于历史或专业文献中。"]}
{"word":"cacoeconomy","summary":{"en":"“Cacao economy” means the economy and trade system built around cacao production and chocolate supply chains.","zh":"“cacao economy（可可经济）”指围绕可可种植与巧克力供应链形成的经济与贸易体系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the economic system, market, and supply chain connected to cacao (the plant used to make chocolate), including farming, trade, processing, and export","zh":"与可可（制作巧克力的原料植物）相关的经济体系与市场链条，包括种植、贸易、加工与出口等"},"examples":[{"en":"Many small farmers depend on the cacao economy for their income.","zh":"许多小农户依靠可可经济获得收入。"},{"en":"The report looks at how prices in the cacao economy affect child labor and poverty.","zh":"该报告研究可可经济中的价格如何影响童工问题与贫困。"},{"en":"West Africa plays a major role in the global cacao economy.","zh":"西非在全球可可经济中扮演重要角色。"}]}],"synonyms":["cacao trade","chocolate supply chain","cocoa sector"],"phonetic":"/kəˈkaʊ iˈkɑnəmi/","extraExplanation":["“cacoeconomy”更常见的写法是分开写作“cacao economy”。“cacao”指可可豆/可可树（原料），而“cocoa”在日常英语里常指加工后的可可粉或热可可饮品；在农业与贸易语境中通常更偏好用“cacao”。","这个词常出现在讨论全球巧克力供应链、农民生计、价格波动、公平贸易（fair trade）、以及可持续认证（如 Rainforest Alliance）等话题的文章与报告里。"]}
{"word":"cacoenthes","summary":{"en":"Cacoethes means an irresistible (often unhealthy) urge, especially a compulsion to write.","zh":"cacoethes 指难以抑制的冲动或癖好，尤指写作癖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An irresistible urge or compulsion (often toward something unwise or unhealthy), especially a compulsive urge to write.","zh":"一种难以抑制的冲动或癖好（常指不太明智、甚至有害的倾向），尤其指“写作癖/写作冲动”。"},"examples":[{"en":"He joked that he suffered from a cacoethes to start new projects and never finish them.","zh":"他开玩笑说自己有种“坏冲动”，总爱开新项目却从不收尾。"},{"en":"The editor blamed her endless submissions on cacoethes scribendi.","zh":"编辑把她没完没了的投稿归因于“写作癖”（cacoethes scribendi）。"}]}],"synonyms":["compulsion","urge","craving","mania","addiction"],"phonetic":"/ˌkækoʊˈiːθiz/","extraExplanation":["你输入的拼写“cacoenthes”常见于误拼；标准拼写通常是 **cacoethes**。","该词来自拉丁语（也受希腊语词根影响），字面含义接近“坏的习惯/欲望”。在英语中最常见的固定搭配是 **cacoethes scribendi**，意思是“写作癖（停不下来的写作冲动）”。","这是比较书面、略带幽默或讽刺色彩的词，用来形容某种“想做就忍不住做”的倾向。"]}
{"word":"cacoepist","summary":{"en":"A rare word meaning a person who speaks or writes badly.","zh":"一个罕见词，指说话或写作很差的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who speaks or writes poorly; someone with an unpleasant or ineffective style of expression.","zh":"说话或写作很差的人；表达方式令人不舒服或效果很差的人。"},"examples":[{"en":"The critic dismissed the author as a cacoepist who couldn’t shape a clear argument.","zh":"评论家把那位作者贬为一个表达拙劣的人，连清晰的论点都组织不出来。"},{"en":"He worries he sounds like a cacoepist in meetings because English is not his first language.","zh":"他担心自己在会议上听起来像个表达很差的人，因为英语不是他的母语。"}]}],"synonyms":["poor speaker","bad writer","inarticulate person","tongue-tied speaker"],"phonetic":"/ˌkækoʊˈiːpɪst/","extraExplanation":["这是一个非常罕见、偏文学/讽刺的词。词根来自希腊语：caco- 表示“坏的、不良的”，-epist 与“言语/表达”有关，所以整体就是“表达不好的人”。","现代英语里更常用的替代说法有 poor speaker、bad writer、inarticulate person 等；如果用于非母语者的口语表现，语气可能显得刻薄，使用时要注意语境与礼貌。"]}
{"word":"cacoepistic","summary":{"en":"Cacoepistic describes the belief that language is deteriorating over time.","zh":"cacoepistic 指“认为语言会随着时间推移而退化变差”的观点。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"believing that language is getting worse over time (for example, that modern usage is “decay” or “corruption” compared with the past).","zh":"认为语言会随着时间推移而不断变差（例如觉得现代用法是在“退化/败坏”，不如过去）。"},"examples":[{"en":"Some cacoepistic commentators complain that texting is ruining English.","zh":"一些持“语言退化论”的评论者抱怨发短信正在毁掉英语。"},{"en":"Her cacoepistic view made her reject new words and slang automatically.","zh":"她的“语言会越来越差”的看法让她本能地排斥新词和俚语。"}]}],"synonyms":["prescriptive","purist","conservative (about language)","anti-change (in language)"],"phonetic":"/ˌkækoʊˈɛpɪstɪk/","extraExplanation":["这是一个非常罕见的词，常见于语言学/修辞学的讨论中，用来描述一种态度：把语言变化视为“堕落”而不是“演变”。","词根来自希腊语 kakos（坏的）+（与“言语/表达”相关的构词），与常见的 prescriptive（规范主义）讨论有交集，但更强调“越变越坏”的倾向。"]}
{"word":"cacoepy","summary":{"en":"Cacoepy means bad or incorrect pronunciation.","zh":"cacoepy 指不正确或不悦耳的发音（发音不正）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the habit or practice of pronouncing words badly; incorrect or unpleasant pronunciation","zh":"发音不正；错误/难听的发音习惯"},"examples":[{"en":"Teachers try to correct cacoepy by giving students clear models of pronunciation.","zh":"老师会通过提供清晰的发音示范来纠正学生的发音不正。"},{"en":"People sometimes mistake a regional accent for cacoepy, but accents are not necessarily “wrong.”","zh":"人们有时会把地方口音误认为发音不正，但口音不一定是“错误”的。"}]}],"synonyms":["mispronunciation","poor pronunciation","incorrect pronunciation"],"phonetic":"/kəˈkoʊ.ə.pi/","extraExplanation":["这个词比较罕见，常见于语言学或较正式的写作中。","词源来自希腊语：caco- 表示“坏的/不良的”（如 cacophony 刺耳的声音），-oepy 来自与“发音”相关的词根（可联想 orthoepy“正音/正确发音”）。","学习时可把它当作“bad pronunciation”的正式说法；日常交流更常用 mispronunciation 或 poor pronunciation。"]}
{"word":"cacoethes","summary":{"en":"Cacoethes means a strong, hard-to-control urge—often for something unusual; it can also mean an obsessive urge to write (“cacoethes scribendi”).","zh":"cacoethes 指强烈且难以控制的冲动（常带“不太正常/不太恰当”的意味）；也可指强烈的写作欲（如 cacoethes scribendi）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An intense, often uncontrollable urge or compulsion (especially to do something considered unusual, risky, or improper).","zh":"一种强烈而常常难以控制的冲动或欲望（尤指做一些不寻常、冒险或不太恰当的事）。"},"examples":[{"en":"He had a cacoethes to travel, quitting jobs whenever a new country called to him.","zh":"他有一种难以抑制的旅行冲动，只要有新国家吸引他就辞职出发。"},{"en":"She felt a sudden cacoethes to speak the truth, even though it might offend people.","zh":"她突然有种说真话的强烈冲动，即使这可能会冒犯别人。"}]},{"partOfSpeech":"n.","definition":{"en":"A strong craving for writing (often used in the phrase “cacoethes scribendi”).","zh":"强烈的写作欲（常见于短语“cacoethes scribendi”，意为“写作癖/写作冲动”）。"},"examples":[{"en":"During lockdown, his cacoethes scribendi filled notebooks with poems and short stories.","zh":"封控期间，他的“写作癖”让他写满了好几本诗歌和短篇小说。"},{"en":"The editor joked that every columnist suffers from cacoethes scribendi at times.","zh":"编辑开玩笑说，每个专栏作者有时都会得“写作冲动症”。"}]}],"synonyms":["urge","compulsion","craving","itch","obsession","impulse"],"phonetic":"/ˌkækəˈiːθiːz/","extraExplanation":["这个词源自拉丁语，常被解释为“坏习惯/不良冲动”，由 caco-（坏的）+ ethos（习惯、性情）相关成分构成。它在英语里属于偏文学、偏书面用词，日常口语更常用 urge / compulsion / craving 来表达。","经典固定搭配是 cacoethes scribendi，常用来半开玩笑地形容“忍不住要写”的毛病；语气可能带一点自嘲或批评。"]}
{"word":"cacoethic","summary":{"en":"Cacoethic means an often irresistible urge to do something unwise or wrong; it can also mean a harmful compulsion.","zh":"cacoethic 指一种常常难以抗拒、明知不妥仍想去做的冲动；也可指一种不太健康的强迫欲。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a strong (often irresistible) urge to do something unwise, wrong, or harmful.","zh":"（形容词）有一种强烈的（常常难以抗拒的）冲动去做不明智、错误或有害的事。"},"examples":[{"en":"He had a cacoethic desire to check his phone during the exam.","zh":"他有一种难以抑制的冲动，想在考试时看手机。"},{"en":"The article describes a cacoethic urge to argue online even when it solves nothing.","zh":"这篇文章描述了一种明知无益却仍想在网上争辩的冲动。"}]},{"partOfSpeech":"n.","definition":{"en":"A strong, often unhealthy compulsion or craving for something (commonly used with “the cacoethic to…”).","zh":"（名词）对某事的强烈、往往不太健康的强迫欲望或渴求（常见结构：the cacoethic to…）。"},"examples":[{"en":"Writers sometimes joke about the cacoethic to revise a sentence forever.","zh":"作家有时会开玩笑说自己有一种永远改不完一句话的强迫欲。"},{"en":"He felt the cacoethic to correct everyone’s grammar in meetings.","zh":"他在会议上总有一种想纠正所有人语法的强迫冲动。"}]}],"synonyms":["compulsive","irresistible","unhealthy","self-destructive","tempting"],"phonetic":"/ˌkæk.oʊˈiːθɪk/","extraExplanation":["这个词比较书面、少见，常用来带点讽刺地形容“明知不该却很想做”的冲动。","词源来自希腊语：kakos（坏的）+ êthos（习惯/性情），字面意思接近“坏习性/坏癖好”。在英文里常见搭配是“a/the cacoethic to + 动词”（例如：the cacoethic to write）。"]}
{"word":"cacogalactia","summary":{"en":"Cacogalactia is a rare medical term meaning abnormal or poor-quality breast milk.","zh":"cacogalactia 是一个罕见的医学术语，指乳汁分泌异常或乳汁质量不佳。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medicine, rare) Abnormally poor-quality or unhealthy breast milk; disordered milk secretion.","zh":"（医学，罕见）乳汁质量异常差或不健康；乳汁分泌异常（乳汁失常）。"},"examples":[{"en":"The doctor noted signs that could suggest cacogalactia and advised stopping breastfeeding temporarily.","zh":"医生注意到一些迹象可能提示乳汁失常（cacogalactia），并建议暂时停止哺乳。"},{"en":"In older medical texts, cacogalactia was used to describe milk thought to be harmful to an infant.","zh":"在较早的医学文献中，cacogalactia 用来描述被认为可能对婴儿有害的乳汁。"}]}],"synonyms":["abnormal lactation","disordered lactation"],"phonetic":"/ˌkækoʊɡəˈlækʃiə/","extraExplanation":["该词非常少见，多见于旧式或专业医学文献；现代临床更常用更具体的表述（如“乳汁成分异常/污染”“乳腺炎相关问题”等）。","词源：来自希腊语词根 caco-（坏的、恶的）+ galact-（乳、牛奶），字面意思是“坏的乳汁”。"]}
{"word":"cacogastric","summary":{"en":"A rare medical adjective meaning “related to a bad/unhealthy stomach condition; indigestion.”","zh":"一个少见的医学形容词，意思是“与胃部不良/不健康状况有关；消化不良的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medical) Related to an unhealthy or foul condition of the stomach; having poor digestion.","zh":"（医学）与胃部不健康或胃内状况不良有关的；消化不良的。"},"examples":[{"en":"The doctor described his symptoms as cacogastric and recommended dietary changes.","zh":"医生把他的症状描述为与胃部状况不良有关，并建议调整饮食。"},{"en":"Some older medical texts use “cacogastric” for patients with chronic indigestion.","zh":"一些较早的医学文献会用“cacogastric”来指慢性消化不良的患者。"}]}],"synonyms":["dyspeptic","indigestive"],"phonetic":"/ˌkækoʊˈɡæstrɪk/","extraExplanation":["这是一个很少见、偏旧的医学用词，由前缀 **caco-**（表示“坏的、不良的、有恶臭的”）+ **gastric**（“胃的”）组成。现代医学写作中更常见的相关表达包括 **dyspeptic**（消化不良的）或直接说 **gastric problems / indigestion**。","词根提示：你还可能见到 **cacophony**（刺耳的噪音，caco- + -phony “声音”）等词，caco- 一般都带有“令人不快/不良”的含义。"]}
{"word":"cacogenesis","summary":{"en":"Cacogenesis means the bad or incorrect formation of words or style; more rarely, it can mean abnormal development in medical contexts.","zh":"Cacogenesis 指词语/文风的拙劣或错误构造；较少见时在医学语境中可指异常发育。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the incorrect or ugly formation of words, phrases, or style (especially awkward, unpleasant-sounding language).","zh":"（尤指语言）词语或表达方式的错误或难看的构造；拙劣、刺耳的措辞或文风。"},"examples":[{"en":"The essay is full of cacogenesis—clumsy phrases and strange word choices.","zh":"这篇文章充满了 cacogenesis——措辞笨拙、用词怪异。"},{"en":"Good editors reduce cacogenesis by replacing awkward expressions with clear ones.","zh":"优秀的编辑会用清晰的表达替换拗口的说法，从而减少 cacogenesis。"}]},{"partOfSpeech":"n.","definition":{"en":"(medicine, rare) abnormal or unhealthy development; the production of something in a faulty way.","zh":"（医学，罕见）异常或不健康的发育；以错误方式生成或形成。"},"examples":[{"en":"Some older medical texts used cacogenesis to describe abnormal development of tissue.","zh":"一些较早的医学文献用 cacogenesis 来描述组织的异常发育。"}]}],"synonyms":["awkward wording","poor diction","malformation","malapropism (related)"],"phonetic":"/ˌkækəˈdʒɛnəsɪs/","extraExplanation":["词源来自希腊语：kakos（坏的）+ genesis（生成、起源）。因此它字面意思是“坏的生成”。在写作与修辞语境中，多用来批评“造词/用词不当”或“文风拙劣”。","该词较少见，正式写作中更常用的近义表达有 awkward wording（措辞别扭）、poor diction（措辞拙劣）、malapropism（用词滑稽错误，偏具体的一类）。"]}
{"word":"cacogenic","summary":{"en":"Cacogenic means “harsh or unpleasant-sounding; producing bad sounds.”","zh":"cacogenic 指“刺耳的、不悦耳的；发出难听声音的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"describing a sound, word, or speech style that is harsh, unpleasant, or awkward-sounding; producing bad sounds","zh":"（声音、用词或说话方式）刺耳的、不悦耳的；发出难听声音的"},"examples":[{"en":"Some people find the scraping sound of chalk on a board cacogenic.","zh":"有些人觉得粉笔刮黑板的声音很刺耳。"},{"en":"The poet avoided cacogenic word combinations and chose softer sounds instead.","zh":"那位诗人避免使用拗口刺耳的词语组合，而改用更柔和的音。"}]}],"synonyms":["harsh-sounding","unpleasant-sounding","grating","cacophonous","discordant"],"phonetic":"/ˌkækəˈdʒɛnɪk/","extraExplanation":["词源来自希腊语：kako-（坏的、不好的）+ -genic（产生……的）。所以它的字面意思是“产生不好的（声音）”。","这个词较为少见，常见于语言学/修辞或文学评论中，用来谈“音的美感”（euphony 悦耳）与“音的刺耳感”（cacophony 不和谐音）之间的对比。"]}
{"word":"cacogenics","summary":{"en":"Cacogenic means “likely to cause harmful or abnormal development,” especially regarding heredity or offspring.","zh":"cacogenic 指“可能导致有害或不良发育的”，尤用于遗传或后代相关语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(biology, medicine) Producing or likely to produce harmful, abnormal, or “bad” development—especially in relation to heredity or offspring.","zh":"（生物/医学）致畸的；（尤指遗传或后代方面）导致有害或不良发育的。"},"examples":[{"en":"Some chemicals are suspected of having cacogenic effects on embryos.","zh":"一些化学物质被怀疑对胚胎具有致畸（cacogenic）作用。"},{"en":"The report warned that certain exposures might be cacogenic if they damage reproductive cells.","zh":"报告警告说，某些暴露如果损伤生殖细胞，可能具有致不良后代的（cacogenic）风险。"}]}],"synonyms":["teratogenic","harmful","deleterious","pathogenic (in some contexts)"],"phonetic":"/ˌkækoʊˈdʒɛnɪk/","extraExplanation":["词源提示：caco- 来自希腊语，表示“坏的、不良的”（如 cacophony“刺耳的声音”）；-genic 表示“产生……的、引起……的”（如 carcinogenic“致癌的”）。因此 cacogenic 字面意思就是“产生不良结果的”。","使用语境：cacogenic 属于较少见、偏学术的词，在遗传学、致畸/毒理学讨论中可能出现；更常见的近义表达包括 teratogenic（致畸的）或 harmful to reproduction（对生殖有害的）。","文化与历史：该词有时会出现在早期“优生学/劣生学”相关文本中，带有强烈价值判断色彩；现代写作中更倾向用更中性的科学术语描述具体风险。"]}
{"word":"cacogeusia","summary":{"en":"Cacogeusia means an unpleasant or distorted sense of taste—often a persistent bad taste in the mouth.","zh":"cacogeusia 指“味觉异常”，常表现为口中持续的难闻或怪味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical term for an unpleasant, bad, or distorted sense of taste (often described as a persistent “bad taste” in the mouth)","zh":"医学术语：味觉异常，指持续的难闻、苦涩或“怪味”的味觉（常被描述为口中一直有不好的味道）"},"examples":[{"en":"After the infection, she complained of cacogeusia and couldn’t enjoy food.","zh":"感染之后，她抱怨出现味觉异常（cacogeusia），吃什么都不香。"},{"en":"Some medicines can cause cacogeusia as a side effect.","zh":"某些药物可能会以“味觉异常（cacogeusia）”作为副作用。"}]}],"synonyms":["dysgeusia","bad taste (in the mouth)","taste disturbance"],"phonetic":"/ˌkækoʊˈɡjuːziə/","extraExplanation":["词源：来自希腊语 kakos（坏的）+ geusis（味觉）。因此字面意思就是“坏的味觉”。","它常见于口腔/牙龈问题、上呼吸道感染、胃食管反流、某些药物或维生素/矿物质缺乏等情况；若持续存在，通常建议就医排查原因。","相关词：dysgeusia（味觉障碍/味觉异常，更常用、范围更广）；ageusia（味觉丧失）；phantogeusia（幻味，没吃东西却感觉有味道）。"]}
{"word":"cacoglossia","summary":{"en":"Cacoglossia means obscene or abusive speech (a “dirty tongue”).","zh":"cacoglossia 指“污言秽语/辱骂性下流言语”（可理解为“坏舌头”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"obscene, foul, or abusive speech; a habit of speaking in a dirty or insulting way.","zh":"污言秽语；粗俗、下流或辱骂性的言语（或说话习惯）。"},"examples":[{"en":"The teacher warned that cacoglossia would not be tolerated in class.","zh":"老师警告说，课堂上不允许说污言秽语。"},{"en":"Online comments sometimes turn into cacoglossia when people feel anonymous.","zh":"在网络上，人们一旦觉得匿名，有时评论就会变成辱骂和污言秽语。"}]}],"synonyms":["profanity","obscenity","foul language","abusive language","bad-mouthing"],"phonetic":"/ˌkækoʊˈɡlɑsiə/","extraExplanation":["这是一个非常罕见、偏学术或修辞学用词，日常英语更常说 profanity（脏话）、obscene language（淫秽语言）、abusive language（辱骂性语言）或 foul language（粗话）。","词源：来自希腊语前缀 caco-（坏的、恶的）+ glossa（舌头、语言）。字面意思接近“坏舌头/坏语言”。"]}
{"word":"cacographer","summary":{"en":"A rare word meaning a person who spells or writes poorly (sometimes with messy handwriting).","zh":"较少见的词，指拼写/书写很差的人（有时也指字迹潦草）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who is a bad speller or who writes with many mistakes.","zh":"拼写很差的人；常写错字、错拼的人。"},"examples":[{"en":"He’s a brilliant speaker, but he’s a terrible cacographer in emails.","zh":"他口才很棒，但在邮件里拼写错误很多。"},{"en":"The editor joked that the draft looked like it was written by a cacographer.","zh":"编辑开玩笑说，这份初稿看起来像是出自一个拼写很差的人之手。"}]},{"partOfSpeech":"n.","definition":{"en":"Someone whose handwriting is messy or hard to read (less common).","zh":"字迹潦草、难以辨认的人（较少见）。"},"examples":[{"en":"My doctor is such a cacographer that I can’t read the prescription.","zh":"我的医生字迹太潦草了，我看不懂处方。"}]}],"synonyms":["bad speller","poor speller","ill-speller","scribbler (informal)"],"phonetic":"/kəˈkɑɡrəfər/","extraExplanation":["这个词比较少见，偏书面或幽默用法。日常更常说：bad speller / poor spelling，或说 someone who can’t spell.","词源上来自希腊语前缀 caco-（“坏的、糟的”）+ -grapher（“写作者”）。同一类构词还有 cacophony（刺耳的噪音/不和谐的声音）。"]}
{"word":"cacographic","summary":{"en":"Cacographic means badly written—especially with poor handwriting or spelling; it can also describe something related to bad writing/spelling (cacography).","zh":"Cacographic 指书写很差（尤其是字迹或拼写很糟），也可指与拙劣书写/拼写（cacography）相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having very bad handwriting or poor spelling; poorly written.","zh":"字迹很差或拼写很差的；写得很糟的。"},"examples":[{"en":"His notes were so cacographic that no one could read them.","zh":"他的笔记字迹糟到没人看得懂。"},{"en":"The teacher returned the essay, pointing out several cacographic spellings.","zh":"老师退回了作文，指出了好几个拼写很差（错误很多）的地方。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to cacography (bad writing or spelling).","zh":"与“拙劣书写/拙劣拼写”（cacography）有关的。"},"examples":[{"en":"The report included a cacographic analysis of common spelling mistakes.","zh":"报告包含了对常见拼写错误的“拙劣书写/拼写”分析。"}]}],"synonyms":["illegible","misspelled","badly written","poorly written","sloppy"],"phonetic":"ˌkækəˈɡræfɪk","extraExplanation":["“cacographic”比较少见，更多时候你会看到名词“cacography”（拙劣的书写或拼写）。","词源来自希腊语：kakos（坏的、糟的）+ -graph-（写）。理解词根有助于记忆：caco- = bad，-graphic = writing。"]}
{"word":"cacographical","summary":{"en":"Cacographical means having very bad handwriting, and more rarely, being full of spelling errors.","zh":"cacographical 指“字迹很差的”，较少见时也可指“拼写错误很多的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having very bad handwriting; written in an ugly or hard-to-read way.","zh":"字迹很差的；书写难看或难以辨认的。"},"examples":[{"en":"His cacographical notes were so messy that even he couldn’t read them later.","zh":"他的笔记字迹太差了，后来连他自己都读不出来。"},{"en":"The doctor apologized for the cacographical handwriting on the prescription.","zh":"医生为处方上难以辨认的字迹道了歉。"}]},{"partOfSpeech":"adj.","definition":{"en":"Spelled or written incorrectly; full of spelling mistakes. (Rare)","zh":"拼写错误的；充满拼写错误的。（较少见）"},"examples":[{"en":"The student turned in a cacographical paragraph with many misspelled words.","zh":"学生交上来一段拼写错误很多的文字。"}]}],"synonyms":["illegible","scribbly","messy","poorly written","misspelled"],"phonetic":"/ˌkækəˈɡræfɪkəl/","extraExplanation":["词源上来自希腊语：kakos（坏的）+ graphein（书写）。因此它的核心意思就是“写得很糟”。","这是一个非常书面、少见的词。日常英语里更常用 messy handwriting / illegible handwriting（难辨认的字迹）或 bad spelling（拼写差）。"]}
{"word":"cacography","summary":{"en":"Cacography means bad handwriting or poor/incorrect writing (especially spelling).","zh":"cacography 指字迹潦草，或不规范/错误的书写（尤其是拼写错误）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Bad handwriting; writing that is hard to read.","zh":"字迹潦草；难以辨认的书写。"},"examples":[{"en":"His cacography made the address impossible to read.","zh":"他的字迹太潦草，地址根本看不清。"},{"en":"The teacher asked her to rewrite the paragraph because of the cacography.","zh":"老师因为字迹潦草，让她把那段话重写一遍。"}]},{"partOfSpeech":"n.","definition":{"en":"Poor spelling or incorrect writing; bad written expression.","zh":"拼写错误；不规范的书面表达（写得不好）。"},"examples":[{"en":"The editor corrected the cacography in the draft before publication.","zh":"编辑在出版前纠正了草稿里的拼写和书写错误。"},{"en":"In formal writing, try to avoid cacography such as inconsistent capitalization.","zh":"正式写作中尽量避免不规范写法，比如大小写不一致。"}]}],"synonyms":["bad handwriting","illegible handwriting","poor spelling","misspelling"],"phonetic":"/kəˈkɑɡrəfi/","extraExplanation":["词源：来自希腊语 *kakos*（坏的）+ *-graphy*（书写），字面意思就是“糟糕的书写”。","用法提示：这是比较正式、偏学术的词，在日常英语里更常说 *bad handwriting*（字迹差）或 *poor spelling*（拼写差）。"]}
{"word":"cacolet","summary":{"en":"A cacolet is a carrier mounted on a pack animal to transport a sick or injured person.","zh":"cacolet 指装在驮兽身上的运载装置，用来转运伤病员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a special seat or frame fastened to the sides or back of a pack animal (especially a mule or horse) for carrying an injured or sick person","zh":"（尤指固定在骡或马等驮兽两侧或背上的）担架座/驮架，用于运送伤病员"},"examples":[{"en":"In the mountains, the rescue team used a cacolet to carry the injured hiker down the trail.","zh":"在山区，救援队用驮架把受伤的徒步者沿小路运下山。"},{"en":"Before modern ambulances, soldiers were sometimes moved on mules fitted with cacolets.","zh":"在现代救护车出现之前，士兵有时会用装有驮架的骡子转运。"}]}],"synonyms":["litter","stretcher (in meaning)","saddle litter"],"phonetic":"/ˈkækəˌlɛt/","extraExplanation":["该词较少见，多出现在历史、军事或野外救援语境中。通常指装在驮兽身上的“伤员运输装置”，有的会在动物两侧各挂一个座位/篮架，用于运送两名伤员。","词源来自法语 cacolet，和早期野战医疗、殖民地行军等历史背景有关。"]}
{"word":"cacolike","summary":{"en":"Cacaolike means “similar to cacao,” especially a cocoa/chocolate-like smell or taste.","zh":"cacaolike 意为“像可可的”，常用来形容带可可/巧克力般的气味或风味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"resembling cacao (the bean used to make chocolate); having a cocoa/chocolate-like smell or flavor","zh":"类似可可（制作巧克力的可可豆）的；带有可可/巧克力般气味或风味的"},"examples":[{"en":"The coffee has a cacaolike aroma with a hint of nuts.","zh":"这款咖啡有一种类似可可的香气，还带一点坚果味。"},{"en":"Some dark-roasted teas develop a cacaolike note.","zh":"有些重度烘焙的茶会出现类似可可的风味。"},{"en":"The dessert’s cacaolike bitterness balances the sweetness.","zh":"甜点中类似可可的苦味让甜味更平衡。"}]}],"synonyms":["cacao-like","cocoa-like","chocolatey","chocolate-like"],"phonetic":"/kəˈkaʊˌlaɪk/","extraExplanation":["“cacaolike”在真实写作中相对少见，更常见的拼写是带连字符的“cacao-like”。它多出现在品鉴笔记（咖啡、茶、巧克力、葡萄酒等）里，用来描述“像可可豆/黑巧克力那样的香气或苦甜风味”。","注意区分：cacao 指“可可（原料/可可豆）”，cocoa 常指“可可粉/热可可饮品”，但在描述风味时二者经常被混用。"]}
{"word":"cacological","summary":{"en":"Cacological means “using bad or incorrect wording,” and sometimes “incorrect in pronunciation or standard usage.”","zh":"cacological 指“措辞/用词拙劣或不当”，有时也指“发音或用法不规范”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"using incorrect, awkward, or badly chosen words; showing poor language use (especially in speaking or writing).","zh":"（用词或表达）不当的；拙劣的；措辞错误的（尤指口头或书面表达）。"},"examples":[{"en":"The essay is clear in ideas, but some sentences are cacological and confusing.","zh":"这篇文章观点清楚，但有些句子措辞不当，让人困惑。"},{"en":"He apologized for the cacological phrasing that sounded rude.","zh":"他为那些听起来很无礼的不当措辞道歉。"}]},{"partOfSpeech":"adj.","definition":{"en":"pronounced or written incorrectly; not following standard usage.","zh":"（发音或拼写）不规范的；错误的；不符合标准用法的。"},"examples":[{"en":"Some learners are afraid of making cacological mistakes when they speak.","zh":"一些学习者害怕在口语中犯发音或用法不规范的错误。"},{"en":"The editor corrected several cacological spellings in the draft.","zh":"编辑在草稿里改正了几处不规范的拼写。"}]}],"synonyms":["awkwardly worded","poorly phrased","inarticulate","malapropistic","ungrammatical"],"phonetic":"/ˌkækəˈlɑːdʒɪkəl/","extraExplanation":["“cacological”很少见，常见的相关名词是“cacology”（措辞不当、用词拙劣）。“caco-”来自希腊语 kakos（坏的），“-logy/-log-”与 logos（言语、词语）有关，字面意思接近“坏的语言/坏的措辞”。在日常英语里，人们更常用 awkward wording / poor phrasing / misuse of words 来表达类似意思。"]}
{"word":"cacology","summary":{"en":"Cacology means bad or incorrect use of language, and less commonly a harsh-sounding style of wording.","zh":"cacology 指语言使用不当、错误或拙劣的表达；较少见时也指措辞刺耳、难听的表达风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"bad or incorrect use of language (poor grammar, wrong word choice, awkward or nonstandard wording) in speaking or writing","zh":"语言使用不当；错误或拙劣的用语（如语法错误、用词不当、表达别扭或不合规范）"},"examples":[{"en":"The editor fixed several cases of cacology in the draft, including wrong verb tenses and unclear phrases.","zh":"编辑在初稿中修正了几处用语不当的问题，包括错误的时态和不清晰的短语。"},{"en":"In formal writing, avoid cacology by choosing precise words and simple sentence structures.","zh":"在正式写作中，选择准确词汇和简洁句式可以避免拙劣用语。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a harsh or unpleasant style of expression; words that sound ugly or jarring","zh":"（较少见）刺耳、不悦耳的表达风格；听起来难听、别扭的用词"},"examples":[{"en":"The critic complained that the poem’s cacology distracted from its message.","zh":"评论家抱怨这首诗刺耳的措辞分散了读者对主题的注意力。"},{"en":"Some speakers mistake strong emotion for good style, but it can slip into cacology.","zh":"有些人把强烈情绪当成好表达，但它可能会滑向拙劣而刺耳的措辞。"}]}],"synonyms":["bad usage","poor diction","illiteracy (context-dependent)","solecism","barbarism"],"phonetic":"/kəˈkɑlədʒi/","extraExplanation":["词源：来自希腊语 *kakos*（坏的）+ *logos*（言语/词）。因此它强调“语言不好”。","学习提示：在语言学/写作语境中，*cacology* 常用来泛指“错误或不合适的表达”，比单个错误（如拼写错）更偏向整体用语质量。","相关词对比：*cacophony* 指“刺耳的声音/音响不和谐”；*solecism* 常指语法错误；*malapropism* 指“用词张冠李戴”（把相似发音的词用错）。"]}
{"word":"cacomagician","summary":{"en":"A rare/coinage term meaning a “bad or evil magician,” usually used humorously or in fantasy contexts.","zh":"一个罕见/自造词，指“糟糕的或邪恶的魔术师/魔法师”，多用于玩笑或奇幻语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A made-up or very rare word meaning “a bad (or morally bad) magician,” formed from the prefix caco- (“bad”) + magician. Not standard in everyday English; you’ll mostly see it as a nickname, fantasy term, or playful insult.","zh":"一个自造或极罕见的词，意思是“糟糕的（或品行不良的）魔术师/魔法师”，由前缀 caco-（坏的、糟的）+ magician（魔术师/魔法师）构成。不是日常标准英语，多见于网名、奇幻设定或玩笑式的贬称。"},"examples":[{"en":"In the story, the cacomagician tricks villagers with cheap illusions.","zh":"在故事里，这个“cacomagician”用低劣的幻术欺骗村民。"},{"en":"He calls himself a cacomagician, joking that his magic always fails.","zh":"他自称“cacomagician”，开玩笑说自己的魔法总是失败。"}]}],"synonyms":["bad magician","inept magician","evil sorcerer (fantasy context)"],"phonetic":"ˌkækoʊməˈdʒɪʃən","extraExplanation":["“caco-”来自希腊语 kakos（坏的）。英语里也能看到类似构词：cacophony（刺耳的声音/不和谐的声音）、cacoethes（强烈但不健康的冲动）。因此 cacomagician 很容易被理解为“坏的/糟的魔法师”，但它并不是常见词，写作时更适合用于创作或戏谑语境。"]}
{"word":"cacomelia","summary":{"en":"Cacomelia is a rare medical term meaning a congenital deformity or malformation of the limbs.","zh":"cacomelia 是一个罕见的医学术语，指先天性的肢体畸形或四肢发育异常。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a congenital (from birth) deformity or malformation of the limbs; abnormal shape or development of arms or legs.","zh":"（医学）先天性肢体畸形；四肢发育异常或形态异常。"},"examples":[{"en":"The doctor noted cacomelia affecting the infant’s lower legs.","zh":"医生记录该婴儿的下肢存在先天性肢体畸形。"},{"en":"Modern imaging can help identify cacomelia before birth.","zh":"现代影像检查可以在出生前帮助识别先天性肢体畸形。"}]}],"synonyms":["congenital limb malformation","limb deformity","limb anomaly"],"phonetic":"/ˌkækəˈmiːliə/","extraExplanation":["这是一个非常少见的医学术语，多见于旧式或专业文献中；日常英语里更常用的说法是“congenital limb deformity / limb malformation（先天性肢体畸形）”。","词源上可拆理解读为：caco-（表示“坏的、异常的”）+ -melia（与“肢体/四肢”有关，源自希腊语）。因此整体含义就是“异常的四肢发育”。","在写作或沟通中，如果对象不是医学专业人士，建议用更直白的表达，并注意使用尊重当事人的表述（如强调“a person with a limb difference”而非带有贬义的词）。"]}
{"word":"cacomistle","summary":{"en":"A cacomistle is a small, nocturnal, raccoon-like mammal related to the ringtail, found in Central America.","zh":"cacomistle 指一种中美洲的小型夜行性哺乳动物，外形像浣熊，和环尾猫近缘。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, raccoon-like mammal from Central America (related to the ringtail), with a long tail and a catlike face","zh":"一种生活在中美洲、外形像浣熊的小型哺乳动物（与环尾猫/环尾浣熊近缘），尾巴很长、脸部略像猫"},"examples":[{"en":"The cacomistle is mostly active at night.","zh":"猫鼬浣熊（cacomistle）大多在夜间活动。"},{"en":"Researchers set up cameras to study cacomistle behavior in the forest.","zh":"研究人员在森林里架设相机来观察猫鼬浣熊的行为。"}]}],"synonyms":["cacomixle (variant spelling)","ringtail (related animal, not always the same species)"],"phonetic":"/ˈkɑːkəˌmɪsəl/","extraExplanation":["词源来自纳瓦特尔语（Nahuatl），常被用来指中美洲的一种“像猫又像浣熊”的动物。在英语里它属于较少见、偏自然科学/动物学语境的词。","容易混淆：ringtail（常指北美的“环尾猫”Bassariscus astutus）与 cacomistle（通常指 Bassariscus sumichrasti，分布更偏中美洲）外形相近，但不是同一种。"]}
{"word":"cacomixl","summary":{"en":"Cacomixl is a rare spelling of cacomistle (ringtail), a small raccoon-like mammal with a long, ringed tail.","zh":"Cacomixl 是 cacomistle（ringtail）的罕见拼写，指一种尾巴有环纹的小型浣熊状哺乳动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare spelling of **cacomistle**: a small, raccoon-like mammal from the Americas, known for its long, ringed tail (also called a **ringtail**).","zh":"一种较少见的拼写，等同于 **cacomistle**：一种产于美洲、外形有点像浣熊的小型哺乳动物，以“有环纹的长尾巴”著称（也叫 **ringtail**）。"},"examples":[{"en":"In some older sources, **cacomixl** is used as another name for the cacomistle (ringtail).","zh":"在一些较旧的资料里，**cacomixl** 被用作 cacomistle（ringtail）的别名。"},{"en":"The animal’s ringed tail makes the **cacomixl** easy to recognize.","zh":"这种动物带环纹的尾巴让 **cacomixl** 很容易辨认。"}]}],"synonyms":["cacomistle","ringtail","miner’s cat"],"phonetic":"/ˌkækəˈmɪksəl/","extraExplanation":["“cacomixl”在现代英语里非常少见，更常见的写法是 **cacomistle**；很多读者更熟悉的俗名是 **ringtail**（环尾猫/环尾浣熊科动物，英文里也有人叫它 “miner’s cat”）。","这个词与墨西哥原住民语言（纳瓦特尔语 Nahuatl）的借词有关，因此会出现不同的转写/拼写形式。"]}
{"word":"cacomixle","summary":{"en":"Cacomixle is a less-common spelling for cacomistle, a raccoon relative found in Mexico and Central America.","zh":"Cacomixle 是较少见的拼写，通常指 cacomistle：一种分布于墨西哥和中美洲、与浣熊近亲的小型夜行性动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, nocturnal mammal related to raccoons, native to Mexico and Central America; often called the (Central American) cacomistle.","zh":"一种小型夜行性哺乳动物，和浣熊有亲缘关系，主要分布于墨西哥与中美洲；常指“中美洲环尾猫（cacomistle）”。"},"examples":[{"en":"The cacomixle hunts insects and small animals at night.","zh":"cacomixle 会在夜间捕食昆虫和小型动物。"},{"en":"In some regions, people use “cacomixle” as another spelling of “cacomistle.”","zh":"在一些地区，人们把 “cacomixle” 当作 “cacomistle” 的另一种拼写。"}]}],"synonyms":["cacomistle","Central American cacomistle","bassarisk (scientific-group term)"],"phonetic":"/ˈkɑkəˌmɪsəl/","extraExplanation":["“cacomixle”并非最常见的英语拼写，更常见的是 cacomistle。该词源自纳瓦特尔语（Nahuatl）中对类似动物的称呼，后来进入墨西哥西班牙语与英语。","注意区分：英语里 ringtail（环尾猫，Bassariscus astutus）多见于美国西南；cacomistle（Bassariscus sumichrasti）主要在墨西哥与中美洲，二者近亲、外形相似，民间名称有时会混用。"]}
{"word":"cacomixls","summary":{"en":"“cacomixls” is not a recognized English word; it’s likely a typo or a proper name.","zh":"“cacomixls”不是可识别的英语单词；更可能是拼写错误或专有名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username/brand name, or a word from another language.","zh":"不是标准英语单词。可能是拼写错误、用户名/品牌名，或来自其他语言的词。"},"examples":[{"en":"“Cacomixls” doesn’t appear in standard English dictionaries.","zh":"“cacomixls”在常见英语词典中查不到。"},{"en":"Did you mean another word (for example, a similar-looking spelling)?","zh":"你是不是想输入另一个词（例如拼写很像的那个）？"}]}],"extraExplanation":["我没法把“cacomixls”对应到常见英语词汇或固定短语。为了帮你更准确：\n1）你能提供它出现的句子/上下文吗？\n2）它是人名、游戏/社媒用户名、公司/产品名，还是你想查的英文单词？\n3）你也可以确认拼写：是否有大小写、连字符，或少/多了某个字母（例如 cacomixls vs. cacomics vs. cacophony 等）。"]}
{"word":"cacomorphia","summary":{"en":"Cacomorphia is a rare medical term for a delusional belief that one is physically deformed or ugly.","zh":"Cacomorphia 是较少见的医学术语，指坚信自己身体畸形或丑陋的妄想。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical, psychology) A delusional belief that one’s body or face is deformed, ugly, or abnormally shaped (often without an objective physical cause).","zh":"（医学/心理学）一种妄想：坚信自己的身体或面部畸形、丑陋或形状异常（通常缺乏客观的生理依据）。"},"examples":[{"en":"The clinician noted cacomorphia, as the patient insisted her nose was “twisted” despite normal findings.","zh":"临床医生记录了疑畸形妄想，因为患者坚持说自己的鼻子“歪了”，但检查结果正常。"},{"en":"In older case reports, cacomorphia was described as a fixed conviction of being physically deformed.","zh":"在较早的病例报道中，cacomorphia 被描述为“坚信自己有躯体畸形”的固定信念。"}]}],"synonyms":["body dysmorphic disorder","dysmorphophobia","dysmorphia"],"phonetic":"/ˌkækəˈmɔrfiə/","extraExplanation":["该词较少见，多见于较早的精神病学/医学文献；现代临床更常用更具体的术语来描述相关症状，例如 body dysmorphic disorder（躯体变形障碍）或 dysmorphophobia（畸形恐惧/疑畸形观念）。","词源来自希腊语：kakos（坏的、糟的）+ morphē（形状、形态），字面含义接近“坏的形态/畸形的观念”。","注意：该词指一种症状性描述（妄想或坚信），并不等同于正式诊断；是否构成诊断需要专业评估。"]}
{"word":"cacomorphosis","summary":{"en":"Cacomorphosis means an abnormal or defective formation—especially a congenital malformation.","zh":"cacomorphosis 指异常或不良的形成，尤指先天性畸形/发育异常。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bad or abnormal formation; a deformity or abnormal development (often used in medical or scientific writing).","zh":"不良或异常的形成；畸形；异常发育（多见于医学或科学语境）。"},"examples":[{"en":"The report described a rare congenital cacomorphosis affecting the infant’s heart.","zh":"报告描述了一种罕见的先天性畸形，影响了婴儿的心脏。"},{"en":"Researchers studied how early exposure to toxins might lead to cacomorphosis during development.","zh":"研究人员探讨了早期接触毒素如何可能在发育过程中导致畸形。"}]}],"synonyms":["malformation","deformity","abnormality","congenital anomaly"],"phonetic":"/ˌkækəˈmɔrfoʊsɪs/","extraExplanation":["词源：来自希腊语词根 kako-（坏的、恶的）+ morphosis（形成、塑形）。因此字面意思就是“坏的形成”。","使用提示：该词非常少见，现代英文中更常用的是 malformation（畸形/发育异常）、deformity（畸形）、abnormality（异常）。在写作中若面向一般读者，优先用这些更常见的词。"]}
{"word":"caconychia","summary":{"en":"Caconychia is a medical term for an unhealthy or abnormal condition of the nails.","zh":"caconychia 是医学用语，指指（趾）甲的不健康或异常病变状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) An abnormal, diseased, or poor condition of the fingernails or toenails (nail dystrophy).","zh":"（医学）指甲或趾甲的异常、病变或不良状态（甲营养不良/指（趾）甲病变）。"},"examples":[{"en":"The dermatologist noted caconychia along with discoloration of several toenails.","zh":"皮肤科医生记录到多枚趾甲变色，并伴有指（趾）甲病变（caconychia）。"},{"en":"In chronic fungal infections, caconychia may appear as thickened, brittle nails.","zh":"在慢性真菌感染中，指（趾）甲病变可能表现为甲板增厚、变脆。"}]}],"synonyms":["nail dystrophy","onychdystrophy","abnormal nails"],"phonetic":"/ˌkækəˈnɪkiə/","extraExplanation":["词源：来自希腊语 kakos（坏的、糟糕的）+ onyx/onychia（指甲）。因此字面意思是“坏的指甲状况”。","使用场景：这是比较少见、偏医学书面语的词。日常或临床更常用的表达包括 nail dystrophy（指/趾甲营养不良、甲营养障碍）、abnormal nails（异常指甲）、onychomycosis（甲真菌病，若特指真菌感染）。","构词提示：英语里很多和指甲有关的医学词根是 onych-（如 onychomycosis 甲真菌病；onycholysis 甲剥离）。看到 onych- 往往和“指甲”有关。"]}
{"word":"caconym","summary":{"en":"Caconym means a bad or incorrect name (a misnomer), and sometimes a harsh-sounding word or name.","zh":"caconym 指“恶名/误称”，也可指“听起来刺耳的词或名称”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bad name; an incorrect or inappropriate name for someone or something (a misnomer).","zh":"恶名；不恰当或错误的名称（误称）。"},"examples":[{"en":"Calling the city a “concrete jungle” can be a caconym if you ignore its parks and neighborhoods.","zh":"如果忽视这座城市的公园和社区，把它称作“水泥丛林”可能就是一种不恰当的误称。"},{"en":"Some historians argue that “Dark Ages” is a caconym because it oversimplifies the period.","zh":"一些历史学者认为“黑暗时代”是个误称，因为它过度简化了那个时期。"}]},{"partOfSpeech":"n.","definition":{"en":"a word or name that sounds unpleasant or harsh to the ear (a harsh-sounding term).","zh":"刺耳的词语或名称（听起来不悦耳、很“硬”的用词）。"},"examples":[{"en":"In poetry, a writer may avoid a caconym if it breaks the gentle mood of the line.","zh":"在诗歌里，如果某个词会破坏诗句的柔和氛围，作者可能会避免使用这种刺耳的词。"},{"en":"The speaker replaced the caconym with a softer-sounding phrase to make the message friendlier.","zh":"演讲者把那个刺耳的用词换成更柔和的表达，让信息听起来更友善。"}]}],"synonyms":["misnomer","bad name","unflattering label","harsh-sounding word","cacophonous term"],"phonetic":"/ˈkækəˌnɪm/","extraExplanation":["词源：来自希腊语 kakos（坏的）+ onoma（名字）。因此它既可指“坏名字/误称”，也可引申为“听起来不舒服的名字或词”。","它和 cacophony（刺耳的噪音/不和谐的声音）同源，记忆时可以把 caco- 理解成“坏/刺耳”，-onym 理解成“名字/词”。"]}
{"word":"caconymic","summary":{"en":"Caconymic means “having to do with a bad or unsuitable name.” It’s rare and mostly used in formal or linguistic contexts.","zh":"caconymic 指“与不佳/不恰当的名字有关的”。该词很罕见，多见于较正式或语言学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to or characterized by a bad, unpleasant, or inappropriate name (a “caconym”).","zh":"与“恶名/不雅或不恰当的名字”（caconym）有关的；带有不良命名特征的。"},"examples":[{"en":"Some critics said the product’s caconymic brand name made it hard to trust.","zh":"一些评论家说，这个产品的品牌名很“caconymic（不佳/不讨喜）”，让人难以信任。"},{"en":"The author avoided caconymic character names that might offend readers.","zh":"作者避免使用可能冒犯读者的 caconymic（不恰当的）人物姓名。"}]}],"synonyms":["poorly named","unfortunately named","inappropriately named","ill-named"],"phonetic":"/ˌkækəˈnɪmɪk/","extraExplanation":["词源上可拆为 caco-（来自希腊语 kakos，意为“坏的”）+ -onym（“名字/词名”）+ -ic（形容词后缀）。整体就是“坏的名字相关的”。","这是一个非常罕见、偏学术/词汇学（onomastics，命名学）语境的词；日常英语里更常用的表达是 “a bad name,” “an unfortunate name,” “an inappropriate/offensive name.”"]}
{"word":"cacoon","summary":{"en":"Cocoon means an insect’s protective case, and it can also mean a safe, sheltered state or to wrap something tightly for protection.","zh":"cocoon 指昆虫的“茧”；也可比喻安全、与外界隔绝的状态；作动词可表示把……包裹起来以保护。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A soft protective case made by some insects (like a caterpillar) around themselves while they develop into an adult insect.","zh":"（某些昆虫如毛毛虫结的）茧；用来保护自己并在其中发育成成虫的外壳。"},"examples":[{"en":"The caterpillar spun a cocoon and later became a moth.","zh":"毛毛虫结了一个茧，之后变成了飞蛾。"},{"en":"We found cocoons on the branches in early spring.","zh":"早春时我们在树枝上发现了茧。"}]},{"partOfSpeech":"n.","definition":{"en":"A situation or place that feels safe and separate from the outside world.","zh":"（比喻）安全、与外界隔绝的环境；“保护壳”。"},"examples":[{"en":"After a stressful week, she stayed home in a cocoon of quiet.","zh":"经历了压力很大的一周后，她待在家里，享受一层安静的“保护壳”。"},{"en":"He grew up in a cocoon and wasn’t ready for real-world problems.","zh":"他在一种“温室”般的环境里长大，还没准备好面对现实问题。"}]},{"partOfSpeech":"vt.","definition":{"en":"To wrap or cover someone or something completely, as if in a protective layer.","zh":"把……包裹起来；（像茧一样）完全覆盖以保护。"},"examples":[{"en":"She cocooned the baby in warm blankets.","zh":"她用温暖的毯子把宝宝裹得严严实实。"},{"en":"Snow cocooned the town overnight.","zh":"一夜之间，大雪把小镇覆盖起来。"}]}],"synonyms":["case","shell","covering","wrap","enclose","shield"],"phonetic":"/kəˈkuːn/","extraExplanation":["你写的“cacoon”通常是“cocoon”的常见拼写错误；正确拼写是 cocoon。","“cocoon”常被用作比喻，表示被保护、隔离、很舒适但也可能与现实脱节的状态（例如“a cocoon of comfort”）。"]}
{"word":"cacopathy","summary":{"en":"Cacopathy is a rare noun meaning either an unhealthy/diseased condition or, figuratively, a vice or bad habit.","zh":"Cacopathy 是个罕见名词，可指“疾病/病态”，也可引申指“恶习/恶行”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, formal) A diseased or unhealthy condition; illness.","zh":"（罕见，正式）疾病；不健康的状态。"},"examples":[{"en":"In older medical writing, cacopathy could refer to a general state of illness rather than a specific disease.","zh":"在较早的医学写作中，cacopathy 可能指一种总体的病态，而不是某种具体疾病。"},{"en":"The report described a cacopathy affecting the lungs.","zh":"报告描述了一种影响肺部的病症。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, rare) A bad habit or moral fault; vice.","zh":"（引申，罕见）恶习；道德缺陷；恶行。"},"examples":[{"en":"He treated gossip as a social cacopathy that spread quickly through the office.","zh":"他把八卦当作一种会在办公室迅速扩散的社会“恶习”。"},{"en":"She wrote about greed as a cacopathy of the human heart.","zh":"她写到贪婪是人心的一种“病”。"}]}],"synonyms":["disease","illness","malady","malaise","vice","bad habit"],"phonetic":"/kəˈkɑpəθi/","extraExplanation":["词源：来自希腊语前缀 caco-（坏的、恶的）+ -pathy（感受、病症）。所以它既可指“疾病”，也常被用来比喻“像病一样的恶习”。","用法提示：cacopathy 很少见，在现代英语里更常用 disease / illness 表示“疾病”，用 vice / bad habit 表示“恶习”。如果你在学术或文学语境里看到它，多半是在刻意用“病”来强调负面状态。"]}
{"word":"cacopharyngia","summary":{"en":"Cacopharyngia is a very rare/nonstandard noun that appears to mean a “bad/unhealthy condition of the pharynx (throat).”","zh":"Cacopharyngia 是一个非常罕见/非标准名词，大意可理解为“咽（喉咙）部的不良/病变状态”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Very rare / nonstandard) A condition involving the pharynx (throat), suggested by its parts to mean an “unhealthy/bad throat condition.”","zh":"（非常罕见／非标准用法）一个与咽（喉咙）有关的状况；从词形结构推测，含义接近“咽部不良/病变的状态”。"},"examples":[{"en":"The term cacopharyngia is not commonly used in modern medical English; clinicians would usually name the specific diagnosis instead.","zh":"“cacopharyngia”在现代医学英语中并不常用；临床上通常会直接说出具体诊断名称。"},{"en":"If you see cacopharyngia in an old text, read it as a broad label for a throat/pharynx problem rather than a precise medical term.","zh":"如果你在旧文本里看到“cacopharyngia”，可把它理解为对咽部问题的笼统称呼，而不是精确的医学术语。"}]}],"synonyms":["pharyngeal disorder","throat condition","pharyngitis (if inflammation is meant)"],"phonetic":"/ˌkækəfəˈrɪndʒiə/","extraExplanation":["这个词很可能是“构词透明但不常见”的造词：caco- 表示“坏的、不良的”（如 cacophony 刺耳的噪音），pharyng- 指“咽/咽部”，-ia 常见于“某种状态/病症”。但它并不是现代英语里标准、常用的医学诊断词。","更常见、更标准的表达会是 pharyngitis（咽炎）、sore throat（喉咙痛）、pharyngeal disorder（咽部疾病）等。","如果这是你在某篇文章里看到的拼写，也可能是作者的临时用词或拼写变体；如你提供原句，我可以帮你根据上下文确定更准确的意思。"]}
{"word":"cacophonia","summary":{"en":"A rare form meaning a harsh, unpleasant mix of sounds (like “cacophony”).","zh":"较少用的词，指刺耳、不和谐的声音混合（类似“cacophony”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) a harsh, jarring mixture of sounds; the same idea as “cacophony.”","zh":"（较少用）刺耳、杂乱不和谐的声音混合；含义与“cacophony”相同。"},"examples":[{"en":"The street outside became a cacophonia of car horns, sirens, and shouting.","zh":"外面的街道成了一片由喇叭声、警笛声和喊叫声组成的刺耳嘈杂。"},{"en":"In the movie, the sudden cacophonia makes the audience feel anxious.","zh":"在电影里，突然出现的刺耳杂音让观众感到紧张。"}]}],"synonyms":["cacophony","discord","din","racket","clamor"],"phonetic":"/ˌkækəˈfoʊniə/","extraExplanation":["“cacophonia”在英语里不如更常见的“cacophony”普遍，常见于受拉丁语/罗曼语影响的拼写或文学化用法。日常写作更推荐用“cacophony”。","词源提示：来自希腊语 kakos（坏的）+ phōnē（声音）。对应的反义概念是“euphony”（悦耳、和谐的声音）。"]}
{"word":"cacophonic","summary":{"en":"Cacophonic describes a harsh, unpleasant mixture of sounds.","zh":"cacophonic 用来形容刺耳、不和谐、难听的混杂声音。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a harsh, unpleasant mix of sounds; not harmonious.","zh":"（声音）刺耳的、不和谐的；嘈杂难听的。"},"examples":[{"en":"The band’s cacophonic rehearsal kept the neighbors awake.","zh":"乐队刺耳嘈杂的排练把邻居都吵醒了。"},{"en":"A cacophonic chorus of car horns filled the street during rush hour.","zh":"高峰期街道上充满了一片刺耳的汽车喇叭声。"}]}],"synonyms":["harsh-sounding","discordant","raucous","jarring"],"phonetic":"/ˌkækəˈfɑnɪk/","extraExplanation":["词源：来自希腊语前缀 caco-（“坏的、糟的”）+ -phonic（“声音的”）。因此它字面意思是“糟糕的声音”。","用法提示：cacophonic 常用于描写“很多声音混在一起而刺耳”的感觉，语气较书面；更日常可以用 noisy（吵闹的）或 harsh（刺耳的）。","相关词：cacophony（n. 刺耳的杂音、不和谐的声音），反义概念：euphonious（悦耳的）、melodious（动听的）。"]}
{"word":"cacophonical","summary":{"en":"Cacophonical means harsh, unpleasantly noisy, or related to a jarring mix of sounds; it’s a less common form of cacophonous.","zh":"cacophonical 表示“刺耳噪杂、不和谐的”，或“与噪音混杂有关的”；它是 cacophonous 的较少见形式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Harsh-sounding; unpleasantly noisy, especially because many sounds clash together.","zh":"刺耳的；不和谐噪杂的（尤指多种声音混在一起、彼此冲突而让人不舒服）。"},"examples":[{"en":"The street outside was cacophonical, with car horns, shouting, and sirens all at once.","zh":"街上非常刺耳噪杂，汽车喇叭、喊叫声和警笛声同时响起。"},{"en":"The band’s early rehearsal sounded cacophonical before they learned to play in time.","zh":"乐队早期排练在学会合拍之前听起来很刺耳、不协调。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to or creating a cacophony (a mix of loud, jarring sounds).","zh":"与“噪音混杂（cacophony）”有关的；造成噪音混杂的。"},"examples":[{"en":"The novel opens with a cacophonical description of the city at rush hour.","zh":"小说开篇用一段“噪杂刺耳”的描写呈现城市的下班高峰。"},{"en":"Some experimental music uses cacophonical effects on purpose.","zh":"有些实验音乐会刻意使用刺耳噪杂的效果。"}]}],"synonyms":["cacophonous","harsh-sounding","discordant","jarring","raucous","noisy"],"phonetic":"/ˌkækəˈfɑnɪkəl/","extraExplanation":["“cacophonical”比较少见，更常用的是“cacophonous”。两者意思接近：都表示“刺耳、不和谐”。在写作中用“cacophonous”更自然、常见。","词源来自希腊语：kakos（坏的）+ phōnē（声音），字面意思是“坏声音/不悦耳的声音”。常用于描写城市噪音、混乱的现场，或文学里用来营造压迫、烦躁的氛围。"]}
{"word":"cacophonically","summary":{"en":"“Cacophonically” means “in a harsh, unpleasant, noisy way.”","zh":"“cacophonically”表示“以刺耳、不和谐、嘈杂的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a harsh, unpleasant, or noisy way (especially about sounds).","zh":"以刺耳、不和谐、嘈杂的方式（尤指声音）。"},"examples":[{"en":"The instruments played cacophonically, and the audience covered their ears.","zh":"乐器演奏得很刺耳，观众捂住了耳朵。"},{"en":"Cars honked cacophonically outside the window all night.","zh":"窗外整夜车鸣声嘈杂刺耳。"}]}],"synonyms":["harshly","noisily","discordantly","jarringly"],"phonetic":"/ˌkækəˈfɑnɪkli/","extraExplanation":["词源提示：caco- 表示“坏的、不良的”，-phony 表示“声音”。所以 cacophonically 的核心感觉是“坏声音地/不悦耳地”。","使用场景：常用于描写城市噪音、杂乱的合奏、吵闹的人群等；比 simply “loudly” 更强调“难听、混乱、不和谐”。","相关词：cacophony（n. 刺耳的杂音/不和谐的声音），cacophonous（adj. 刺耳的、不和谐的）。","文学/写作中：这个词常用来营造压迫、混乱或紧张的氛围，例如描写街景、战争、工业噪声等。"]}
{"word":"cacophonies","summary":{"en":"“Cacophonies” means harsh, unpleasant mixtures of sounds, or (figuratively) chaotic mixes of voices, opinions, or styles.","zh":"“cacophonies”指刺耳、嘈杂的声音混杂；也可比喻杂乱冲突的声音/观点/风格的混合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Harsh, unpleasant, or jarring mixtures of sounds (plural of “cacophony”).","zh":"（cacophony 的复数）刺耳、嘈杂、令人不舒服的声音混杂。"},"examples":[{"en":"Outside my window, the cacophonies of traffic and construction made it hard to focus.","zh":"窗外车流和施工的嘈杂声混在一起，让我很难专心。"},{"en":"In the city, you often hear cacophonies—horns, sirens, and loud music all at once.","zh":"在城市里，你常常会听到各种刺耳的声音——喇叭声、警笛声和大音量音乐同时出现。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) Unpleasant mixtures of things such as voices, opinions, or styles that feel chaotic or conflicting.","zh":"（比喻）杂乱而互相冲突的混合（如声音、观点、风格等），让人觉得混乱不协调。"},"examples":[{"en":"The meeting turned into cacophonies of competing opinions.","zh":"会议变成了各种相互竞争观点的混乱场面。"},{"en":"The design felt like cacophonies of colors rather than a clear style.","zh":"这个设计更像是颜色的杂乱堆叠，而不是清晰的风格。"}]}],"synonyms":["noise","din","racket","clamor","discord","dissonance","hub-bub"],"phonetic":"/kəˈkɑːfəniz/","extraExplanation":["“cacophony”来自希腊语：kakos（坏的）+ phōnē（声音），字面意思就是“坏声音”。写作中常用它来营造紧张、混乱、压迫的氛围。","它常与“a cacophony of + 名词复数/不可数名词”搭配：a cacophony of horns / voices / noises。复数形式“cacophonies”强调“多种/多处的刺耳混杂声”。"]}
{"word":"cacophonist","summary":{"en":"A cacophonist is someone associated with harsh, discordant sound.","zh":"cacophonist 指与刺耳、不和谐声音相关的人（制造或偏好这种声音）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who makes or enjoys harsh, unpleasant sounds, especially in music, speech, or writing (the opposite idea of someone who seeks harmony).","zh":"喜欢或制造刺耳、不和谐声音的人；（尤指在音乐、言语或写作中）追求“噪音感”的人。"},"examples":[{"en":"Some critics called him a cacophonist because his music used a lot of clashing notes and rough textures.","zh":"一些评论家称他为 cacophonist，因为他的音乐大量使用冲突的音符和粗砺的音色。"},{"en":"In her poems, she isn’t afraid to sound like a cacophonist when the subject is anger or war.","zh":"在她的诗里，当主题是愤怒或战争时，她不怕呈现“刺耳感”，甚至像个 cacophonist。"}]}],"synonyms":["maker of cacophony","noise-maker","experimentalist","avant-gardist"],"phonetic":"/kəˈkɑfənɪst/","extraExplanation":["词源提示：cacophonist 来自 cacophony（“刺耳的噪音、不和谐的声音”）+ -ist（“从事者/拥护者”）。在评论音乐或文学时，有时带贬义（“乱、难听”），但也可能是中性或褒义，用来强调一种刻意的、表现性的“不和谐”风格（如某些先锋音乐、现代诗）。"]}
{"word":"cacophonists","summary":{"en":"Cacophonists are people associated with making or favoring harsh, discordant sounds.","zh":"Cacophonists 指与制造或偏好刺耳、不和谐声音相关的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who creates or enjoys harsh, unpleasant, or discordant sounds (often in music, writing, or speech)","zh":"制造或偏好刺耳、不和谐声音的人（常见于音乐、写作或言语表达中）"},"examples":[{"en":"Some critics dismissed the band as cacophonists, but fans loved the raw noise.","zh":"一些评论家把这支乐队说成是“刺耳噪音的制造者”，但粉丝却很喜欢这种原始的声音。"},{"en":"In the novel, the city feels alive with street vendors, horns, and other cacophonists of everyday life.","zh":"在小说里，这座城市因小贩叫卖、喇叭声等日常“噪音制造者”而显得充满生命力。"}]}],"synonyms":["noisemakers","dissonant musicians","noise artists"],"phonetic":"/kəˈkɑfəˌnɪsts/","extraExplanation":["“cacophonist”来自“cacophony（刺耳的噪音、不和谐的声音）”。词根源自希腊语：kakos（坏的）+ phone（声音）。","这个词在日常英语里不算常用，更常见的是“cacophony”。“cacophonist(s)”通常带一点评价色彩：可能是批评“吵/难听”，也可能是在艺术语境里称赞一种故意的“噪音美学”（如实验音乐、某些现代诗的音响效果）。"]}
{"word":"cacophonize","summary":{"en":"“Cacophonize” means to make something sound harsh and discordant (or, less commonly, to become so).","zh":"“cacophonize”表示把某物弄得刺耳不和谐（较少见时也可指变得刺耳）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something sound harsh, discordant, or unpleasant; to turn into a cacophony","zh":"使（声音/语言等）变得刺耳、不和谐；使之变成噪杂的声音"},"examples":[{"en":"The distorted speakers cacophonized the music until it was painful to listen to.","zh":"失真的音箱把音乐弄得刺耳难听，听起来很痛苦。"},{"en":"Political shouting can cacophonize a discussion and drown out careful ideas.","zh":"政治性的叫嚷会让讨论变得嘈杂不堪，淹没认真思考的观点。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become harsh or discordant in sound (less common)","zh":"（声音等）变得刺耳、不协调（较少见）"},"examples":[{"en":"As more horns joined in, the street noise cacophonized into chaos.","zh":"更多喇叭声加入后，街上的噪音变得一片混乱、刺耳不堪。"}]}],"synonyms":["discord","jar","clash","make (something) sound harsh","create a cacophony"],"phonetic":"/kəˈkɑfəˌnaɪz/","extraExplanation":["“cacophonize”来自“cacophony（刺耳的噪音/不和谐的声音）”，常见于批评音乐、演讲、写作风格时，强调“故意或不受控制地制造嘈杂感”。它比更常用的“make … sound harsh/noisy”更书面、更少见。","写作里也可用于比喻：不是指真实声音，而是指“信息/观点/语言风格混杂到让人难以理解”。"]}
{"word":"cacophonous","summary":{"en":"Cacophonous describes sounds (or sometimes writing) that are harsh, noisy, and unpleasantly unharmonious.","zh":"Cacophonous 用来形容声音（有时也形容文风）刺耳嘈杂、杂乱不和谐，令人不适。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a harsh, unpleasant mix of sounds; noisy and discordant.","zh":"（声音）刺耳的、嘈杂不和谐的；由许多不悦耳的声音混在一起的。"},"examples":[{"en":"The cafeteria was cacophonous at lunchtime, with clattering trays and shouting students.","zh":"午餐时间的食堂很cacophonous，托盘叮当作响，学生们大声喊叫。"},{"en":"A cacophonous chorus of car horns filled the street during the traffic jam.","zh":"堵车时，街上充满了刺耳的汽车喇叭声。"}]},{"partOfSpeech":"adj.","definition":{"en":"Unpleasantly harsh or jarring in style (especially language or writing), as if the words clash.","zh":"（文风/措辞）拗口刺耳的、不协调的；读起来像“词语互相冲突”。"},"examples":[{"en":"The translation felt cacophonous, with awkward word choices that didn’t flow.","zh":"这段翻译读起来很cacophonous，用词别扭、不够顺畅。"}]}],"synonyms":["harsh","discordant","raucous","jarring","noisy","unharmonious"],"phonetic":"/kəˈkɑfənəs/","extraExplanation":["词源提示：caco- 表示“坏的/不良的”，-phon- 表示“声音”（同根词如 phone, phonetics）。所以 cacophonous 字面意思就是“坏声音的”。","常见搭配：cacophonous noise/sounds; a cacophonous crowd; a cacophonous mix of voices。写作中常用来营造“城市噪音、混乱、压迫感”的氛围。"]}
{"word":"cacophonously","summary":{"en":"“Cacophonously” means “in a harsh, jarring, unpleasant-sounding way.”","zh":"“cacophonously”表示“以刺耳、不和谐、令人不适的方式（发出声音）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a harsh, unpleasant, and jarring way (especially referring to a mix of sounds).","zh":"刺耳地；不和谐地（尤指多种声音混杂在一起时令人不舒服）。"},"examples":[{"en":"The instruments played cacophonously, and the audience covered their ears.","zh":"乐器演奏得刺耳难听，观众捂住了耳朵。"},{"en":"Car horns blared cacophonously in the traffic jam.","zh":"堵车时，汽车喇叭刺耳地此起彼伏。"}]}],"synonyms":["harshly","discordantly","jarringly","noisily"],"phonetic":"/kəˈkɑːfənəsli/","extraExplanation":["词源提示：来自“cacophony（刺耳的噪音/不和谐的声音）”，其词根源于希腊语 *kakos*（坏的）+ *phone*（声音）。","用法提示：常用于写作或较正式的语境中，强调“声音混杂且令人烦躁”。日常口语里更常用 *noisily*（吵闹地）、*harshly*（刺耳地）、*discordantly*（不和谐地）。"]}
{"word":"cacophony","summary":{"en":"Cacophony means a harsh, unpleasant mix of sounds; in literature, it can also mean intentionally rough sound patterns used for effect.","zh":"cacophony 指刺耳、嘈杂的不和谐声音；在文学中也可指为表达效果刻意营造的拗口/不和谐音响。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A harsh, unpleasant mix of loud sounds.","zh":"刺耳、嘈杂的不和谐声音（多种声音混杂在一起，令人不舒服）。"},"examples":[{"en":"The classroom turned into a cacophony when the bell rang and everyone started talking at once.","zh":"铃声一响、大家同时说话时，教室里立刻变成一片嘈杂刺耳的声音。"},{"en":"Outside the station, a cacophony of car horns and shouting filled the air.","zh":"车站外，汽车喇叭声和喊叫声交织在一起，空气中充满了刺耳的噪声。"}]},{"partOfSpeech":"n.","definition":{"en":"(Literary) Intentionally rough-sounding language or a clash of sounds used for effect in writing or speech.","zh":"（文学用法）为达到表达效果而刻意使用的不和谐音（如拗口、尖锐的音响组合）。"},"examples":[{"en":"The poet uses cacophony to make the scene feel tense and chaotic.","zh":"诗人用不和谐音来让场景更紧张、更混乱。"},{"en":"The repeated hard sounds create a cacophony that mirrors the character’s anger.","zh":"反复出现的硬音形成不和谐的音响效果，呼应了人物的愤怒。"}]}],"synonyms":["din","racket","clamor","noise","discord"],"phonetic":"/kəˈkɑfəni/","extraExplanation":["词源小提示：cacophony 来自希腊语，caco- 表示“坏的”，-phony 表示“声音”（也见于 symphony 交响乐、phone 电话）。所以字面意思就是“坏声音”。","用法对比：cacophony 强调“混杂且刺耳”；noise 只是“噪音”；din 常指“持续、很吵的喧闹声”；clamor 常指“人群大声喧闹或强烈要求”。","文学与修辞：cacophony 常与 euphony（悦耳的和谐音）相对，用来制造紧张、粗粝、混乱的氛围。"]}
{"word":"cacophthalmia","summary":{"en":"Cacophthalmia is a rare medical term meaning a diseased or abnormal condition of the eye.","zh":"cacophthalmia 是较少见的医学词，表示眼部的病变或异常状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) A diseased or abnormal condition of the eye; an eye disorder.","zh":"（医学）眼部的病变或异常状态；眼疾。"},"examples":[{"en":"The old medical text mentions cacophthalmia as a general term for severe eye disease.","zh":"那本旧医学文献把 cacophthalmia 用作严重眼病的统称。"},{"en":"Because “cacophthalmia” is uncommon today, doctors usually use more specific terms (for example, keratitis or uveitis).","zh":"由于 “cacophthalmia” 现在很少用，医生通常会改用更具体的术语（例如角膜炎或葡萄膜炎）。"}]}],"synonyms":["ophthalmopathy","ocular disorder","eye disease"],"phonetic":"/ˌkækəfˈθælmiə/","extraExplanation":["词源：来自希腊语构词 kako-（坏的、不良的）+ ophthalmos（眼）。因此字面意思接近“坏眼/眼部不良状态”。","使用提示：这是较古老、较笼统的医学用语，现代临床与论文更倾向用具体诊断名（如 conjunctivitis 结膜炎、keratitis 角膜炎、uveitis 葡萄膜炎等）。"]}
{"word":"cacoplasia","summary":{"en":"Cacoplasia means abnormal or faulty development, especially in a medical or biological context.","zh":"cacoplasia 指（尤用于医学/生物学语境中）异常或不良发育。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medicine) Abnormal or poor development or formation of cells, tissues, or organs; faulty growth.","zh":"（医学）细胞、组织或器官的异常/不良发育；发育不良、形成异常。"},"examples":[{"en":"The pathologist noted signs of cacoplasia in the biopsy sample.","zh":"病理学家在活检样本中注意到了发育异常（cacoplasia）的迹象。"},{"en":"Researchers studied how certain chemicals may trigger cacoplasia in developing tissue.","zh":"研究人员探讨某些化学物质如何可能在发育中的组织中诱发发育异常（cacoplasia）。"}]}],"synonyms":["abnormal development","malformation","dysplasia","abnormal growth"],"phonetic":"/ˌkækəˈpleɪʒiə/","extraExplanation":["词源：来自希腊语 kako-（坏的）+ -plasia（形成、塑造）。因此它强调“形成得不好/不正常”。","使用场景：该词较偏专业，常见于病理学、组织学或医学论文中；日常英语里更常用的表达是 abnormal development / abnormal growth / malformation 等。","易混词：cacophony（刺耳的噪音）和 cacophasia（言语表达障碍）长得像，但含义不同；cacoplasia 主要与“组织/器官的形成”有关。"]}
{"word":"cacoplastic","summary":{"en":"Cacoplastic means “badly formed” or “abnormally shaped,” mainly in medical/scientific contexts.","zh":"cacoplastic 指“成形不良、畸形”，主要用于医学/科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Badly formed; misshapen or malformed (often used in medical or scientific writing).","zh":"发育不良的；畸形的；形态不良的（多见于医学或科学语境）。"},"examples":[{"en":"The scan showed a cacoplastic growth that was not developing normally.","zh":"扫描显示该组织增生呈现畸形特征，发育并不正常。"},{"en":"In older medical texts, “cacoplastic” was used to describe tissues with abnormal structure.","zh":"在较早的医学文献中，“cacoplastic”常用来形容结构异常的组织。"}]}],"synonyms":["malformed","misshapen","abnormal","deformed","ill-formed"],"phonetic":"/ˌkækəˈplæstɪk/","extraExplanation":["这个词比较少见，主要出现在较旧或较专业的医学/生物学语境里。日常英语更常用 malformed、misshapen、abnormal 或 deformed。","词源可拆解理解：caco- 来自希腊语 kakos（“坏的、不良的”），-plastic 来自 plastikos（“可塑的、成形的”），合起来就是“成形不良”。"]}
{"word":"cacoproctia","summary":{"en":"Cacoproctia means the habit of using obscene or vulgar language, especially “dirty” talk about bodily functions.","zh":"cacoproctia 指习惯性使用下流、猥亵的言语，尤其是与排泄等身体机能相关的“污言秽语”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the habit or practice of using obscene, vulgar, or “dirty” language (especially language related to bodily functions); obscenity in speech","zh":"（尤指涉及排泄等身体机能的）下流、猥亵的言语；说话粗俗、污秽的习惯"},"examples":[{"en":"The teacher warned the class that cacoproctia would not be tolerated during presentations.","zh":"老师警告全班，在做展示时不允许使用下流粗俗的语言。"},{"en":"Some people confuse casual swearing with cacoproctia, but the latter suggests a stronger habit of obscene speech.","zh":"有些人把随口骂人和“经常说污言秽语”混为一谈，但后者更强调一种明显的习惯性猥亵表达。"}]}],"synonyms":["obscenity","vulgarity","dirty language","coprolalia"],"phonetic":"/ˌkækəˈprɑkʃə/","extraExplanation":["这个词非常罕见，日常英语里几乎不用；更常见的说法是 vulgar language / obscenity / dirty talk。","词源来自希腊语：kako-（坏的、恶的）+ proktos（肛门），因此带有“与排泄相关的粗俗/污秽表达”的色彩。","在医学或心理学语境中，若想表达“无法控制地说粗话/秽语”，更常见的术语是 coprolalia（常与抽动障碍等话题一起出现）。"]}
{"word":"cacorhythmic","summary":{"en":"Cacorhythmic means having an abnormal or unhealthy rhythm, especially referring to the heartbeat.","zh":"cacorhythmic 指“节律异常/不健康的”，常用于描述心跳等节律问题。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medical) Having an abnormal, unhealthy, or “bad” rhythm; not beating or moving in a normal pattern (often used about the heart).","zh":"（医学）节律异常的；节律不健康的；（常指心脏）心律不齐的、病理性节律的。"},"examples":[{"en":"The patient showed a cacorhythmic heartbeat on the monitor.","zh":"监护仪上显示患者心跳节律异常。"},{"en":"Doctors investigated whether the irregular pulses were truly cacorhythmic or just temporary changes from stress.","zh":"医生评估这些不规则脉搏是否属于真正的病理性节律异常，还是仅由压力引起的暂时变化。"}]}],"synonyms":["arrhythmic","dysrhythmic","irregular"],"phonetic":"/ˌkækoʊˈrɪðmɪk/","extraExplanation":["这是一个非常少见、偏学术/医学的词。构词上可拆为：caco-（坏的、不良的）+ rhythmic（有节律的）。在现代临床英语里更常见的表达是 arrhythmic / dysrhythmic（心律失常的/节律异常的）。","如果你是在论文或老派医学文献中看到它，通常是在描述“节律不好/不健康”，而不一定指某一种具体心律失常类型。"]}
{"word":"cacorrhachis","summary":{"en":"A rare medical word meaning an abnormal or diseased spine.","zh":"一个罕见医学词，指脊柱异常或病变。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bad or abnormal spinal condition; a deformity or disease of the spine (rare, medical term).","zh":"脊柱的不良或异常状况；脊柱畸形或疾病（罕见医学用语）。"},"examples":[{"en":"The old text used the term cacorrhachis to describe severe spinal deformity.","zh":"那本旧医书用 cacorrhachis 来描述严重的脊柱畸形。"},{"en":"Today, doctors would usually name the specific condition (for example, scoliosis) instead of saying cacorrhachis.","zh":"如今医生通常会说出具体病名（例如“脊柱侧弯”），而不是用 cacorrhachis。"}]}],"synonyms":["spinal deformity","spinal abnormality"],"phonetic":"/ˌkækoʊˈrækɪs/","extraExplanation":["这是一个非常罕见、偏古典的医学词，来自希腊语词根：caco- 表示“坏的、不良的”，-rhachis 表示“脊柱（尤指脊椎骨）”。因此字面意思接近“坏的脊柱”。现代英语医学中更常用更具体的诊断词（如 scoliosis 脊柱侧弯、kyphosis 驼背、lordosis 腰椎前凸等）。"]}
{"word":"cacorrhinia","summary":{"en":"Cacorrhinia is a scientific genus name for a group of Australian flowering plants.","zh":"Cacorrhinia 是一个植物学属名，指一类澳大利亚的开花植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering plants (daisies) native to Australia; used mainly in scientific (botanical) names","zh":"（植物学）澳大利亚原产的一属开花植物（菊科/雏菊类），主要用于学名中"},"examples":[{"en":"Cacorrhinia is a genus recorded in Australian botanical references.","zh":"Cacorrhinia 是澳大利亚植物学资料中记载的一个植物属。"},{"en":"The label lists the plant as Cacorrhinia sp., meaning the exact species is not specified.","zh":"标签写着 Cacorrhinia sp.，表示属已确定，但具体种尚未标明。"}]}],"synonyms":["(no common everyday synonym; taxonomic name)"],"phonetic":"/ˌkækəˈrɪniə/","extraExplanation":["这是一个拉丁化的植物属名，通常出现在学术语境（植物志、标本标签、论文）中，日常英语里很少单独使用。","发音在英语中常按拉丁学名的读法处理；不同地区/学者可能会有轻微差异，但重音通常落在 -RIN- 或其附近音节。"]}
{"word":"cacosmia","summary":{"en":"Cacosmia means a foul smell, or (medically) a distorted sense of smell where things seem to smell bad.","zh":"cacosmia 指“恶臭”，也可指（医学）嗅觉异常：把正常气味闻成臭味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong, unpleasant smell; the sensation of foul odors.","zh":"恶臭；令人不快的气味（或对臭味的感觉）。"},"examples":[{"en":"The garbage room was filled with cacosmia after the power outage.","zh":"停电后，垃圾房里充满了恶臭。"},{"en":"Opening the old container released a wave of cacosmia.","zh":"打开那个旧容器时，一阵恶臭扑面而来。"}]},{"partOfSpeech":"n.","definition":{"en":"(medical) a distorted sense of smell in which normal odors are perceived as foul, or a persistent false belief that one smells something bad.","zh":"（医学）嗅觉异常：把正常气味闻成臭味；或持续产生“闻到臭味”的错误感觉/观念。"},"examples":[{"en":"After the infection, she experienced cacosmia and said everything smelled rotten.","zh":"感染后，她出现嗅觉异常，说什么都闻起来像腐烂的味道。"},{"en":"The doctor asked whether his cacosmia began after a head injury.","zh":"医生询问他的嗅觉异常是否在头部受伤后开始的。"}]}],"synonyms":["foul odor","stink","stench","malodor","olfactory distortion"],"phonetic":"/ˌkækəzˈmiə/","extraExplanation":["词源上来自希腊语：kakos（坏的、恶的）+ osme（气味）。因此它既可指“恶臭”，也可指“把气味闻成臭味”的嗅觉失真。","日常英语中更常用的说法是 bad smell / foul odor / stink；cacosmia 更偏医学或书面语。"]}
{"word":"cacospermia","summary":{"en":"Cacospermia is a medical term for foul-smelling or abnormally odorous semen, often associated with infection or inflammation.","zh":"cacospermia 是医学术语，指精液出现恶臭或异常气味，常与感染或炎症有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medicine) A condition in which semen has a foul or abnormal odor, often linked to infection or inflammation in the reproductive/urinary tract.","zh":"（医学）精液有恶臭或异常气味的情况，常与生殖/泌尿道感染或炎症有关。"},"examples":[{"en":"The doctor noted cacospermia and ordered tests to check for infection.","zh":"医生记录到精液异味（cacospermia），并安排检查以排查感染。"},{"en":"Cacospermia can be discussed as a symptom rather than a disease by itself.","zh":"cacospermia 常被作为“症状”来讨论，而不一定是一种独立疾病。"}]}],"synonyms":["foul-smelling semen","malodorous semen"],"phonetic":"/ˌkækoʊˈspɝmiə/","extraExplanation":["词源：来自希腊语 kakos（坏的、恶的）+ sperma（种子、精液），字面意思是“坏的精液/气味不良的精液”。","使用场景：该词多见于医学或较正式的健康讨论中；日常英语更常用“foul-smelling semen（有臭味的精液）”来表达。","注意：这是一个涉及隐私与健康的敏感词汇。在就医或沟通时，使用中性、客观的描述更合适。"]}
{"word":"cacosplanchnia","summary":{"en":"Cacosplanchnia is a rare, old medical word meaning an unhealthy condition of the internal (especially abdominal) organs.","zh":"Cacosplanchnia 是一个罕见的旧医学词，指内脏（尤指腹部内脏）处于不健康状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an old medical term for an unhealthy condition of the internal organs (especially the abdominal organs), sometimes implying foul or “bad” (unhealthy) viscera.","zh":"一种较古老的医学用语，指内脏（尤其是腹部内脏）处于不健康的状态；有时带有“脏器状况很差/不良”的含义。"},"examples":[{"en":"The author used the word *cacosplanchnia* to describe severe disorder of the abdominal organs in older medical writing.","zh":"作者在较早期的医学写作中用 *cacosplanchnia* 来描述严重的腹部脏器紊乱。"},{"en":"Today, doctors would usually name the specific disease instead of using a broad term like *cacosplanchnia*.","zh":"如今，医生通常会直接说明具体疾病，而不是使用像 *cacosplanchnia* 这样笼统的词。"}]}],"synonyms":["visceral disorder","abdominal/visceral disease (general)","internal organ pathology (broad)"],"phonetic":"/ˌkækoʊˈsplæŋkniə/","extraExplanation":["这个词非常少见，多见于19世纪或更早的医学文献，现代临床上几乎不用。","词源可拆解为希腊语词根：caco-（坏的、恶的）+ splanchn-（内脏）。因此它强调“内脏状况不良”的总体概念，而不是某一种明确诊断。"]}
{"word":"cacostomia","summary":{"en":"Cacostomia is a rare term meaning foul breath (halitosis), and less commonly, offensive speech.","zh":"cacostomia 是个较罕见的词，主要指“口臭（halitosis）”，较少也可指“粗鄙的言语/满口脏话”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) A condition of having foul breath; bad breath (halitosis).","zh":"（医学）口臭；口气恶臭（同 halitosis）。"},"examples":[{"en":"The dentist suggested treating her cacostomia by improving oral hygiene and checking for gum disease.","zh":"牙医建议她通过改善口腔卫生并检查牙龈疾病来处理口臭（cacostomia）。"},{"en":"Dry mouth can make cacostomia worse, especially in the morning.","zh":"口干会让口臭（cacostomia）更严重，尤其是早晨。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) Offensive or foul talk; a “foul mouth.”","zh":"（罕见）粗鄙、污秽的言语；满口脏话。"},"examples":[{"en":"The editor criticized the character’s cacostomia, calling the dialogue needlessly vulgar.","zh":"编辑批评这个角色的“满口脏话”（cacostomia），认为对白没必要那么粗俗。"}]}],"synonyms":["halitosis","bad breath","fetor oris","foul mouth"],"phonetic":"/ˌkækoʊˈstoʊmiə/","extraExplanation":["词根拆解：caco- 表示“坏的、恶臭的”（如 cacophony 刺耳的噪音），stoma 表示“口”（如 stomatitis 口腔炎）。因此 cacostomia 字面意思是“坏的口/臭口”。","使用提醒：在现代英语里，这个词非常罕见；日常表达更常说 bad breath 或医学用语 halitosis。"]}
{"word":"cacothansia","summary":{"en":"Cacothanasia (often misspelled as “cacothansia”) is a rare term meaning a bad or unethical death, sometimes specifically non-consensual euthanasia.","zh":"Cacothanasia（常被误拼为 cacothansia）是个罕见词，指“不正当/不道德的死亡”，有时特指“非自愿安乐死”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A “bad” or improper death, especially death brought about in a cruel, violent, or unethical way.","zh":"（罕见）“不好的/不正当的死亡”，尤指以残酷、暴力或不道德方式造成的死亡。"},"examples":[{"en":"Some writers use the term to condemn any death caused by cruelty or neglect.","zh":"有些作者用这个词来谴责任何因残酷或疏忽而导致的死亡。"},{"en":"The article warned that policies that devalue certain lives can lead to cacothanasia.","zh":"那篇文章警告说，贬低某些生命价值的政策可能导致“cacothanasia”（不正当的死亡）。"}]},{"partOfSpeech":"n.","definition":{"en":"(Bioethics; rare) Killing a person without their consent, sometimes contrasted with euthanasia as a “good death.”","zh":"（生命伦理学；罕见）在未获得本人同意的情况下结束其生命；有时与“euthanasia（安乐死/善终）”相对，被称为“坏的死亡”。"},"examples":[{"en":"In bioethics discussions, non-consensual euthanasia may be labeled cacothanasia.","zh":"在生命伦理学讨论中，非自愿的安乐死可能被称为 cacothanasia。"},{"en":"The speaker stressed that euthanasia requires consent; otherwise it becomes cacothanasia.","zh":"发言者强调安乐死需要同意，否则就成了 cacothanasia。"}]}],"synonyms":["violent death","cruel death","unethical killing","non-consensual euthanasia"],"phonetic":"/ˌkækoʊθəˈneɪʒə/","extraExplanation":["你输入的 **cacothansia** 常见于对 **cacothanasia** 的拼写误差；更标准的拼法是 **cacothanasia**。","词源可拆为 **caco-**（坏的、恶的）+ **-thanatos**（死亡）+ **-ia**（名词后缀），字面意思就是“坏的死亡”。","这是非常少见、偏学术/伦理学语境的词；日常英语里通常直接说 *a violent death*（暴死）或 *non-consensual euthanasia*（非自愿安乐死）。"]}
{"word":"cacothelin","summary":{"en":"Cacothelin is a rare, historical medical term for a toxic substance linked to the tuberculosis bacterium.","zh":"Cacothelin 是一个罕见的历史医学用语，指与结核分枝杆菌相关的某种“毒性物质/毒素”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a toxic substance (historically described as a “toxin”) obtained from or associated with the tuberculosis bacterium, discussed in early medical literature; now largely obsolete in modern medicine.","zh":"（旧称）一种与结核分枝杆菌相关、被早期医学文献称为“毒素”的有毒物质；现代医学中基本已不用/少见。"},"examples":[{"en":"Early 20th‑century papers sometimes mentioned cacothelin when discussing experimental tuberculosis toxins.","zh":"20世纪初的一些论文在讨论结核“毒素”的实验研究时，会提到 cacothelin。"},{"en":"The term cacothelin is rarely used today and is mostly found in historical medical texts.","zh":"如今 cacothelin 这个词很少使用，多见于历史医学文献中。"}]}],"synonyms":["(historical) tuberculosis toxin","(historical) tubercle bacillus extract"],"phonetic":"/ˌkækəˈθiːlɪn/","extraExplanation":["词源上可拆为 caco-（表示“坏的/不良的”，源自希腊语 kakos）+ -thelin/-in（旧式化学命名中常见的结尾）。这个词更多反映了早期对“细菌毒素/提取物”的命名习惯，而不是现代规范的化学命名。","在现代语境里，如果你在阅读医学史或老论文，遇到 cacothelin 通常可理解为“结核相关毒素/提取物”的旧称；具体成分与定义在不同文献中可能不完全一致。"]}
{"word":"cacotheline","summary":{"en":"Cacotheline is a specialized chemical reagent used in analytical chemistry, especially for testing alkaloids or as an oxidation indicator in some titrations.","zh":"Cacotheline 是一种用于分析化学的专用化学试剂，常用于生物碱检测，或在某些滴定中作氧化还原指示剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical reagent (a yellow nitro-derivative of brucine) used in analytical chemistry, especially to test for certain alkaloids or as an oxidation indicator in some titrations","zh":"一种化学试剂（番木鳖碱/布鲁辛 brucine 的硝基衍生物，常呈黄色），用于分析化学中检测某些生物碱，或在部分滴定中作氧化还原指示剂"},"examples":[{"en":"The lab used cacotheline as a reagent to help identify alkaloids in the sample.","zh":"实验室使用 cacotheline 作为试剂，帮助鉴定样品中的生物碱。"},{"en":"In some analytical methods, cacotheline can act as an oxidation indicator during titration.","zh":"在某些分析方法中，cacotheline 可在滴定过程中作为氧化还原指示剂。"}]}],"synonyms":["reagent","analytical reagent","indicator (in some contexts)"],"phonetic":"/ˌkækoʊˈθiːliːn/","extraExplanation":["这是一个相对冷门的专业词，多见于分析化学与药物分析语境。它与“生物碱检验（alkaloid testing）”“滴定（titration）”“指示剂（indicator）”等搭配出现。","词形来源可拆为 caco-（表示“坏、劣”，源自希腊语 kakos）+ theline（与化学命名传统相关）。在现代英语日常交流中几乎不会用到，更常见于实验步骤或方法学文献。"]}
{"word":"cacothes","summary":{"en":"“Cacothes” is a rare word meaning a bad habit or vice; it’s most often seen in the phrase “cacothes scribendi,” meaning an irresistible urge to write.","zh":"“cacothes”是个较罕见的词，意思是“恶习/坏毛病”；最常见于短语“cacothes scribendi”，指“忍不住想写作的冲动（写作瘾）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A bad habit or vice; a persistent, often hard-to-resist tendency to do something (especially something unhelpful).","zh":"（罕见）恶习；坏毛病；一种难以改掉、常常带有“忍不住”的倾向（多指不太好的行为）。"},"examples":[{"en":"He had a cacothes of checking his phone every few minutes.","zh":"他有个坏毛病——每隔几分钟就忍不住看手机。"},{"en":"Writers sometimes joke about the cacothes of revising the same paragraph forever.","zh":"作家有时会开玩笑说自己有个“恶习”——同一段落反复修改个没完。"}]},{"partOfSpeech":"phrase","definition":{"en":"In the fixed Latin phrase “cacothes scribendi”: an irresistible urge (often seen as a “bad habit”) to write.","zh":"用于固定拉丁语短语“cacothes scribendi”：指一种（常被看作“坏习惯”的）强烈写作冲动，忍不住想写。"},"examples":[{"en":"She blamed her long blog posts on cacothes scribendi.","zh":"她把自己博客文章总写很长归咎于“写作瘾”（cacothes scribendi）。"},{"en":"The critic mocked the poet’s cacothes scribendi.","zh":"评论家嘲讽那位诗人的“写作恶习”。"}]}],"synonyms":["bad habit","vice","compulsion","addiction","weakness"],"phonetic":"ˈkækəˌθiːz","extraExplanation":["这个词非常少见，更多时候你会在学术写作或文学评论里看到，尤其搭配拉丁语短语“cacothes scribendi”。","词源来自希腊语：kakos（坏的）+ ethos（习惯/性情）。因此它的核心语感是“带点贬义的习惯/冲动”。","日常英语里更常用的替代说法有：bad habit, vice, compulsion, addiction（视语境强弱而定）。"]}
{"word":"cacothesis","summary":{"en":"Cacothesis means a bad habit or unhealthy tendency—sometimes specifically a compulsion to write badly; in older usage, it can mean incorrect pronunciation.","zh":"Cacothesis 指坏习惯或不良倾向；有时特指“偏要写得很差”的冲动；在较旧用法中也可指错误发音。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bad habit or an unhealthy tendency; a compulsion to do something poorly (especially to write badly).","zh":"坏习惯；不健康的倾向；（尤指）一种“明知不好却偏要写得很差/做得很差”的冲动。"},"examples":[{"en":"He joked that his cacothesis was rewriting every email until it sounded worse.","zh":"他开玩笑说自己的“cacothesis”就是把每封邮件越改越难看。"},{"en":"With practice, she overcame the cacothesis of rushing through her essays.","zh":"通过练习，她克服了写作文时急躁草率的坏习惯。"}]},{"partOfSpeech":"n.","definition":{"en":"incorrect pronunciation or faulty speech (a rare, older use).","zh":"发音不正确；言语不当（较少见、偏旧的用法）。"},"examples":[{"en":"The teacher corrected his cacothesis gently, one sound at a time.","zh":"老师很温和地纠正他的错误发音，一个音一个音地带。"}]}],"synonyms":["bad habit","unhealthy tendency","compulsion","mispronunciation","faulty speech"],"phonetic":"/ˌkækoʊˈθiːsɪs/","extraExplanation":["这个词很少见，语体偏书面/学术，日常更常用 bad habit、poor writing、mispronunciation 等。","词源来自希腊语：kako-（坏的）+ -thesis（放置、形成），字面有“形成不好的习惯/倾向”的感觉。"]}
{"word":"cacothymia","summary":{"en":"A rare medical term meaning an abnormal mental state, especially with morbid or unhealthy desires or impulses.","zh":"一个较罕见的医学词，指异常的心理状态，尤指带有病态或不健康的欲望、冲动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical term for an abnormal state of mind, especially one marked by morbid or unhealthy desires or impulses","zh":"（医学用语）一种异常的心理状态，尤指伴随病态或不健康的欲望、冲动"},"examples":[{"en":"In older medical writing, cacothymia was used to describe a mind troubled by unhealthy impulses.","zh":"在较早期的医学著作中，cacothymia 用来描述被不健康冲动困扰的心理状态。"},{"en":"The term is rare today and is mostly found in historical or specialized texts.","zh":"这个词如今很少使用，多见于历史文献或专业文本中。"}]}],"synonyms":["morbid desire","abnormal impulse","dysthymia (related)","mental disturbance"],"phonetic":"/ˌkækoʊˈθaɪmiə/","extraExplanation":["词源：来自希腊语构词，caco- 表示“坏的/不良的”（同源于 cacophony “刺耳的噪音”），-thymia 与“情绪、心境、精神状态”有关（可联想 dysthymia “心境恶劣/心境障碍”）。整体含义可理解为“坏的心境/不良的精神状态”。","使用提示：现代英语里更常用更具体的心理/精神医学术语（如 impulse control disorder、depression、dysthymia 等）。cacothymia 带有明显的历史性与泛指色彩，写作时通常需要说明语境。"]}
{"word":"cacotopia","summary":{"en":"Cacotopia means an imagined “bad place” or terrible society—the opposite of a utopia.","zh":"cacotopia 指想象中的“坏地方/糟糕社会”，与乌托邦相反。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an imaginary place or society where everything is unpleasant, bad, or oppressive; a “worst possible world” (the opposite of a utopia).","zh":"一种想象中的糟糕社会或地方：处处令人不适、腐败或压迫的“反乌托邦/恶托邦”（与 utopia 相对）。"},"examples":[{"en":"Some critics describe the novel’s future city as a cacotopia ruled by fear and surveillance.","zh":"一些评论家把小说中的未来城市描述为由恐惧与监控统治的恶托邦。"},{"en":"The film turns the dream of progress into a cacotopia where ordinary people can’t breathe—literally and socially.","zh":"这部电影把“进步的梦想”变成了一个恶托邦：普通人无论在字面上还是社会层面都喘不过气。"}]}],"synonyms":["dystopia","hellscape","anti-utopia"],"phonetic":"/ˌkækoʊˈtoʊpiə/","extraExplanation":["词源上来自希腊语前缀 caco- / kako-（“坏的、恶的”）+ -topia（“地方”）。所以它的字面意思就是“坏地方”。","cacotopia 在日常英语里较少见，更常用的近义词是 dystopia（反乌托邦）。cacotopia 语气往往更强调“糟糕、令人厌恶”，而 dystopia 更常用于社会制度层面的压迫与失序。"]}
{"word":"cacotrichia","summary":{"en":"Cacotrichia is a rare medical term meaning abnormal, especially excessive or unusual, hair growth.","zh":"cacotrichia 是较少见的医学词，指毛发生长异常，尤指过多或不寻常的多毛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abnormal condition of hair growth, especially excessive or unusual hair growth (a rare medical term)","zh":"毛发生长异常（尤指过多或不寻常的多毛；较少见的医学用语）"},"examples":[{"en":"The dermatologist noted cacotrichia and ordered hormone tests to check for underlying causes.","zh":"皮肤科医生记录了毛发生长异常，并安排了激素检查以排查潜在原因。"},{"en":"In older medical texts, cacotrichia was sometimes used to describe unusual facial hair growth.","zh":"在较早的医学文献中，cacotrichia 有时用来描述不寻常的面部毛发生长。"}]}],"synonyms":["hypertrichosis","hirsutism","excessive hair growth"],"phonetic":"/ˌkækoʊˈtrɪkiə/","extraExplanation":["这个词很少在日常英语中使用，多见于旧式或较专业的医学语境。更常见、更现代的近义词是 hypertrichosis（多毛症）或 hirsutism（多毛，常指女性出现男性型体毛）。","词源来自希腊语：kakos（坏的、异常的）+ thrix/trich-（毛发）。看到 trich- 词根时，通常与“毛发”相关（如 trichology：毛发学）。"]}
{"word":"cacotrophia","summary":{"en":"Cacotrophia is a rare medical term meaning poor nutrition or malnutrition.","zh":"cacotrophia 是一个罕见的医学词，指营养不良或不健康/不足的营养状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical, rare) Poor nutrition; a state of malnourishment, often linked to unhealthy or insufficient nourishment.","zh":"（医学，罕用）营养不良；因营养摄入不足或不健康而造成的失养状态。"},"examples":[{"en":"The doctor noted signs of cacotrophia caused by a long period of inadequate diet.","zh":"医生记录到因长期饮食不足而导致的营养不良迹象。"},{"en":"In older medical writing, cacotrophia was used to describe disorders related to poor nourishment.","zh":"在较早的医学文献中，cacotrophia 常用来描述与不良营养有关的疾病。"}]}],"synonyms":["malnutrition","undernutrition","poor nutrition"],"phonetic":"/ˌkækəˈtroʊfiə/","extraExplanation":["词源：来自希腊语 kakos（坏的）+ trophē（营养、喂养）。因此字面意思就是“坏的营养/不良喂养”。","使用提示：这是非常少见、偏旧式的医学词汇；现代英语更常用 malnutrition（营养不良）或 undernutrition（营养不足）。","不要与 dystrophy（肌营养不良/营养障碍）混淆：dystrophy 指组织（如肌肉）因营养或代谢问题而出现的退化性改变，范围和语境更专门。"]}
{"word":"cacotrophic","summary":{"en":"Cacotrophic describes organisms that obtain nutrients from decaying matter or waste (a rare scientific term).","zh":"cacotrophic 指“以腐烂物或废弃物获取营养的（多见于学术语境，较少用）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology, ecology) Getting nutrition in a “low-quality” way—especially by feeding on decaying organic matter or waste rather than making one’s own food.","zh":"（生物/生态）以“低质量”的方式获取营养，尤指依靠腐烂有机物或废弃物取食，而不是自己制造养分。"},"examples":[{"en":"Many fungi are cacotrophic, absorbing nutrients from dead leaves and wood.","zh":"许多真菌是 cacotrophic 的，它们从枯叶和腐木中吸收养分。"},{"en":"In a decomposer-rich forest, cacotrophic organisms play a key role in recycling nutrients.","zh":"在分解者丰富的森林里，cacotrophic 生物在养分循环中起关键作用。"}]}],"synonyms":["saprotrophic","saprophytic","detritivorous","heterotrophic"],"phonetic":"/ˌkækoʊˈtrɑfɪk/","extraExplanation":["这个词非常少见，多用于学术或较旧的科学写作。日常英语里更常用的说法是 **saprotrophic / saprophytic（腐生的）** 或更宽泛的 **decomposer（分解者）**。","词源拆解：**caco-** 来自希腊语，表示“坏的/不良的”（如 *cacophony* “刺耳的声音”）；**-trophic** 表示“营养/取食方式”（如 *autotrophic* “自养的”、*heterotrophic* “异养的”）。因此 *cacotrophic* 字面含义是“以不良方式取食/营养”。"]}
{"word":"cacotrophy","summary":{"en":"Cacotrophy means poor or unhealthy nourishment (a rare, older term).","zh":"cacotrophy 指“营养不良/不健康的营养状态”，是较少见、偏旧式的用词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Poor or unhealthy nourishment; a state of being badly fed (often used in medical or older scientific writing).","zh":"营养不良；不健康的营养状态（常见于医学或较旧的科学文献中）。"},"examples":[{"en":"The doctor noted signs of cacotrophy due to the child’s limited diet.","zh":"医生指出孩子因为饮食过于单一而出现营养不良的迹象。"},{"en":"In older texts, cacotrophy was discussed as a cause of weakness and slow recovery.","zh":"在较旧的文献中，营养不良被认为会导致虚弱和康复缓慢。"}]}],"synonyms":["malnutrition","undernourishment","poor nutrition"],"phonetic":"/ˌkækoʊˈtrɑfi/","extraExplanation":["词源：来自希腊语 kakos（坏的）+ trophē（营养、喂养），字面意思是“坏的营养”。","使用提示：这是非常少见、偏学术/旧式的词；现代英语更常用 malnutrition（营养不良）、poor nutrition（营养差）或 undernourishment（营养不足）。","语境：多见于医学史、旧式生理学或营养学讨论中，有时用于描述长期饮食结构不佳导致的体质衰弱。"]}
{"word":"cacotype","summary":{"en":"Cacotype means very bad handwriting, or (rarely) an ugly typeface in printing.","zh":"cacotype 指“很糟糕、难辨认的笔迹”，也可（罕见）指“难看的印刷字体”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Very poor, hard-to-read handwriting; an ugly or badly formed written style.","zh":"难以辨认的糟糕笔迹；丑陋、拙劣的书写风格。"},"examples":[{"en":"His notes were a cacotype, so I couldn’t tell which homework was due.","zh":"他的笔记写得乱七八糟，我根本看不出作业到底是哪一项。"},{"en":"The teacher asked her to rewrite the paragraph because the first draft was a cacotype.","zh":"老师让她把那段重写一遍，因为第一稿的字迹太潦草难辨。"}]},{"partOfSpeech":"n.","definition":{"en":"In printing (rare), an unattractive or poorly designed typeface or printed style.","zh":"（印刷用语，罕见）难看的字体；设计拙劣的印刷字体或排印风格。"},"examples":[{"en":"The poster used a cacotype that made the whole design look cheap.","zh":"海报用了很难看的字体，让整个设计显得很廉价。"}]}],"synonyms":["bad handwriting","messy handwriting","scribble","scrawl","illegible writing"],"phonetic":"/ˈkækəˌtaɪp/","extraExplanation":["词源：来自希腊语 kakos（坏的、差的）+ typos（印记、字模、形式），字面意思就是“坏的字形/字迹”。因此它既可指“难看的手写字”，也可（较少见）指“难看的印刷字体”。","使用提示：该词非常少见，日常英语里更常说 bad handwriting、messy handwriting、scribble、scrawl。正式写作或带一点讽刺语气时才可能用 cacotype。"]}
{"word":"cacoxene","summary":{"en":"Cacoxene is a golden-yellow mineral that often appears as needle-like crystals, sometimes as inclusions in quartz.","zh":"Cacoxene（黄磷铁矿）是一种金黄色矿物，常呈针状晶体，也常作为石英中的包裹体出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a yellow-brown to golden mineral (a hydrated iron–aluminum phosphate) that often forms as tiny needle-like crystals in rock cavities or as an impurity in quartz.","zh":"一种黄褐色到金黄色的矿物（含水的铁—铝磷酸盐），常以细针状晶体出现在岩石空洞中，或作为石英中的杂质出现。"},"examples":[{"en":"Geologists identified cacoxene as the golden, needle-like coating inside the rock cavity.","zh":"地质学家把岩石空洞里那层金色针状覆盖物鉴定为 cacoxene（黄磷铁矿）。"},{"en":"Some quartz specimens contain inclusions of cacoxene that look like fine golden hair.","zh":"有些石英标本含有 cacoxene 包裹体，看起来像细细的金色发丝。"}]}],"synonyms":["cacoxenite","hydrated iron–aluminum phosphate"],"phonetic":"/ˌkækəˈksiːn/","extraExplanation":["词源上来自希腊语：kakos（“坏的”）+ xenos（“客人/外来者”），含义类似“讨厌的客人”，指它常以“杂质”的形式出现在其他矿物（尤其是石英）中。","在收藏和宝石圈里，你可能会看到“cacoxenite in quartz（含黄磷铁矿的石英）”之类的说法，有时会被误当作更常见的“金红石发晶（rutile in quartz）”；两者外观都可能呈金色针状，但矿物成分不同。"]}
{"word":"cacoxenite","summary":{"en":"Cacoxenite is a yellow-brown fibrous mineral, a hydrated iron–aluminum phosphate, often found in iron-rich rocks or as an impurity in iron ore.","zh":"cacoxenite（磷铁铝矿）是一种黄褐色纤维状矿物，属于含水的铁—铝磷酸盐，常见于富铁岩石中或作为铁矿石杂质出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a yellow to brown, fibrous mineral (a hydrated iron–aluminum phosphate) that often occurs as radiating “tufts” in iron-rich rocks or as an impurity in iron ore.","zh":"一种黄褐色、纤维状的矿物（含水的铁—铝磷酸盐），常以放射状“簇状/绒球状”结晶出现于富铁岩石中，也可作为铁矿石中的杂质。"},"examples":[{"en":"The geologist identified tiny golden tufts of cacoxenite in the rock sample.","zh":"地质学家在岩石样品中辨认出了细小的金色簇状磷铁铝矿。"},{"en":"Cacoxenite can appear as a secondary mineral formed during weathering.","zh":"磷铁铝矿可能作为风化过程中形成的次生矿物出现。"}]}],"synonyms":["cacoxene"],"phonetic":"/kəˈkɑːk.sə.naɪt/","extraExplanation":["词源提示：cacoxenite 来自希腊语 kakos（“坏的”）+ xenos（“客人/外来者”），有“坏客人/不受欢迎的外来物”之意；它被这样命名，是因为常作为铁矿石中的“不受欢迎的杂质”出现。","用法提示：这是专业矿物名称，常见于地质、矿物学语境；日常英语中几乎不会用到。"]}
{"word":"cacozeal","summary":{"en":"Cacozeal means harmful or misguided zeal—enthusiasm that becomes fanatical or damaging.","zh":"cacozeal 指“有害或方向错误的热情/狂热”，热心到变得盲目或造成伤害。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"misguided or harmful zeal; excessive enthusiasm used in a bad or fanatical way (often about religion or ideology).","zh":"不良的热心；带来伤害的狂热（常指宗教或意识形态上的盲目热情）。"},"examples":[{"en":"His cacozeal for the cause made him silence anyone who disagreed.","zh":"他对这项事业的盲目狂热让他压制所有不同意见的人。"},{"en":"History shows how cacozeal can turn faith into persecution.","zh":"历史表明，不良的狂热会把信仰变成迫害。"}]}],"synonyms":["misguided zeal","fanaticism","overzealousness","extremism","zealotry"],"phonetic":"/ˈkækoʊˌziːl/","extraExplanation":["这是一个非常少见、带文学色彩的词，常用于批评某人“热心过头而且方向不对”。\n\n词源来自希腊语：kakos（坏的）+ zeal（热忱）。可以把它理解为“坏的热情/热心”。在现代英语中更常见的表达是 misguided zeal（误入歧途的热情）、fanaticism（狂热）、overzealousness（过度热心）。"]}
{"word":"cacozealous","summary":{"en":"A very rare adjective meaning “overzealously imitative in a way that produces bad taste,” especially in writing or style.","zh":"一个非常罕见的形容词，指“过度热情地模仿却造成品味不佳”，尤用于写作或风格。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Very rare) Showing exaggerated enthusiasm in a way that leads to bad taste or poor imitation, especially in writing or artistic style.","zh":"（非常罕见）热情过度却导致品味不佳或拙劣模仿的；（尤指写作或艺术风格）矫揉造作、画虎不成反类犬的。"},"examples":[{"en":"The review criticized the novel as cacozealous, full of grand words but little clarity.","zh":"评论批评这部小说“cacozealous”，辞藻浮夸却缺乏清晰表达。"},{"en":"His cacozealous imitation of Shakespeare sounded dramatic, but it felt forced.","zh":"他对莎士比亚的拙劣模仿看似戏剧化，却显得很做作。"}]}],"synonyms":["overwrought","affected","pretentious","bombastic","overzealous","derivative"],"phonetic":"/ˌkækoʊˈzɛləs/","extraExplanation":["这个词非常少见，常见拼写也有 **cacozelous**。词根来自希腊语：**kako-**（坏的）+ **zelos**（热情、热忱），整体含义是“带着热情去模仿/表达，但结果很糟”。多用于批评某种“用力过猛”的文风或仿作。"]}
{"word":"cacozyme","summary":{"en":"Cacozyme is usually a product name for a digestive enzyme preparation used to aid digestion.","zh":"Cacozyme 通常是某种助消化的消化酶制剂（多为商品名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a digestive enzyme preparation (often used as a product name) taken to help break down food and support digestion.","zh":"一种消化酶制剂（常见为商品名），用于帮助分解食物、促进消化。"},"examples":[{"en":"My doctor suggested a cacozyme supplement to help with digestion after meals.","zh":"医生建议我饭后补充 cacozyme 这类消化酶来帮助消化。"},{"en":"The label says to take cacozyme with food, not on an empty stomach.","zh":"标签写着要随餐服用 cacozyme，不要空腹吃。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) the enzyme(s) contained in such a preparation.","zh":"（非正式）指这类制剂中所含的消化酶。"},"examples":[{"en":"Some people are sensitive to cacozyme and should start with a small dose.","zh":"有些人对 cacozyme 不太适应，应该从小剂量开始。"}]}],"synonyms":["digestive enzyme","enzyme supplement","pancreatic enzymes"],"phonetic":"/ˈkækoʊzaɪm/","extraExplanation":["“cacozyme”并不是常见的标准英语词汇，更常见于保健品/药品包装或品牌名称。不同厂商的配方可能不同（例如蛋白酶、淀粉酶、脂肪酶等），如果你是在处方、说明书或化验单上看到它，最好结合上下文（厂家、成分、用途）确认具体含义。","词形上可理解为“enzyme（酶）”相关的构词：-zyme 常见于与酶有关的词（如 amylase/amy-，enzyme，zymology）。不过 caco- 在英语里并不是常见的“消化”前缀，因此更像是商标/专有命名。"]}
{"word":"cacqueteuse","summary":{"en":"A rare French-derived word for a gossipy, overly talkative person; sometimes used as an adjective meaning “chattering.”","zh":"一个较罕见、源自法语的词，指爱八卦、话多的人；也可作形容词表示“喋喋不休的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, from French) a talkative, gossipy person—often implying someone who chatters or prattles too much (traditionally said of a woman).","zh":"（罕见，源自法语）爱说闲话、爱八卦的人；常含“喋喋不休、爱碎嘴”的贬义（传统上多指女性）。"},"examples":[{"en":"In the old satire, the author mocks the cacqueteuse who spreads rumors from house to house.","zh":"在那篇旧讽刺作品里，作者嘲笑那个挨家挨户散布流言的“碎嘴八卦者”。"},{"en":"He dismissed the story as gossip from a cacqueteuse rather than reliable reporting.","zh":"他把那条消息当作“爱搬弄是非的人”的闲话，而不是可靠的报道。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) describing someone as excessively talkative or gossiping.","zh":"（罕见）形容某人过分健谈、爱说闲话的。"},"examples":[{"en":"Her cacqueteuse comments interrupted the meeting again and again.","zh":"她那些喋喋不休的插话一次又一次打断了会议。"}]}],"synonyms":["gossip","chatterbox","blabbermouth","prattler","rumormonger"],"phonetic":"/ˌkækəˈtuz/","extraExplanation":["“cacqueteuse”来自法语动词“caqueter”（像母鸡一样咯咯叫→引申为喋喋不休地说话）。在英语里多见于文学、讽刺或学术写作中，日常英语更常用“gossip / chatterbox / blabbermouth / prattler”。","语感上通常带轻微到强烈的负面评价，使用时要注意语境与对他人的尊重；现代写作中直接用更常见的英语词往往更自然。"]}
{"word":"cacqueteuses","summary":{"en":"“cacqueteuses” is a French plural word meaning “gossipy/chattering women,” often used with a mildly negative tone.","zh":"“cacqueteuses”是法语复数，常指“爱八卦、爱嚼舌根（多嘴）的女人们”，语气多带轻微贬义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(French; feminine plural) gossipy; chattering a lot (often in an annoying way).","zh":"（法语；阴性复数）爱八卦的；喋喋不休的（常带贬义，指烦人的多嘴）。"},"examples":[{"en":"In the novel, the author calls them “cacqueteuses,” always whispering in the village square.","zh":"在小说里，作者称她们为“cacqueteuses”，总是在村广场上窃窃私语。"},{"en":"She avoided the cacqueteuses at work who spread rumors during lunch.","zh":"她会避开办公室里那些“cacqueteuses”，她们午饭时最爱散布流言。"}]},{"partOfSpeech":"n.","definition":{"en":"(French; feminine plural noun) gossipy women; prattlers; rumor-spreaders.","zh":"（法语；阴性复数名词）爱嚼舌根的女人们；多嘴的人；散布流言者。"},"examples":[{"en":"The cacqueteuses knew everyone’s business before anyone else did.","zh":"这些cacqueteuses总是比任何人都更早知道别人的私事。"},{"en":"He complained about the cacqueteuses who never stopped talking.","zh":"他抱怨那些cacqueteuses从来不停嘴。"}]}],"synonyms":["gossipy","chatty","prattling","tattling","rumor-mongering","gossips","prattlers"],"phonetic":"/ˌkækəˈtuz/","extraExplanation":["“cacqueteuses”是法语“cacqueteuse”的阴性复数形式，来自动词“cacqueter”，原意接近“像母鸡咯咯叫一样地叫”，因此常带有“吵、碎嘴、爱传话”的贬义色彩。","在英语语境中它非常少见，通常出现在引用法语、描写法式社会风俗或文学文本时；日常英语更常用“gossips / chatty people / rumor-mongers”等。"]}
{"word":"Cactaceae","summary":{"en":"Cactaceae is the scientific name for the cactus family.","zh":"Cactaceae 是“仙人掌科”的科学名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant family (the cactus family) whose members are cacti, usually adapted to dry environments, often with thick stems and spines.","zh":"仙人掌科（仙人掌家族）：一类植物科，成员为仙人掌，通常适应干旱环境，常见特征是肥厚的茎和刺。"},"examples":[{"en":"Many desert plants in the family Cactaceae store water in their stems.","zh":"仙人掌科的许多沙漠植物会把水储存在茎里。"},{"en":"The saguaro is a famous species in the Cactaceae family.","zh":"巨人柱是仙人掌科里很有名的一种。"}]}],"synonyms":["the cactus family"],"phonetic":"/kækˈteɪsiːiː/","extraExplanation":["“Cactaceae”是植物学里的拉丁化科名，来自“cactus（仙人掌）”。在正式写作中常用作科学分类名称（多首字母大写），日常英语更常说“the cactus family”或直接说“cacti”。","发音上常见读法为 /kækˈteɪsiːiː/，把它拆开记会更容易：cact-（像 cactus）+ -aceae（许多植物科名的常见后缀，如 Rosaceae 蔷薇科）。"]}
{"word":"cactaceae","summary":{"en":"Cactaceae is the botanical family name for cacti.","zh":"Cactaceae 是“仙人掌科”的植物学科名，即仙人掌所属的科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant family that includes cacti—typically desert plants with thick, water-storing stems and often spines instead of leaves","zh":"仙人掌科；包括各种仙人掌的植物科，通常适应干旱环境，茎肥厚储水，常以刺代叶"},"examples":[{"en":"Many species in the Cactaceae family survive long droughts by storing water in their stems.","zh":"仙人掌科的许多物种会把水储存在茎里，因此能熬过长时间干旱。"},{"en":"Prickly pear belongs to the Cactaceae.","zh":"仙人掌属的仙人掌（prickly pear，仙人掌果）属于仙人掌科。"}]}],"synonyms":["cactus family"],"phonetic":"/ˌkækˈteɪsiˌi/","extraExplanation":["“Cactaceae”是植物分类学里的拉丁学名，常见于植物百科、科普文章与学术写作；日常英语里更常直接说“cactus/cacti”。","读法提示：重音通常落在“-KAY-see-ee”（cact-AY-see-ee）的节奏上。","文化小知识：仙人掌科原产主要在美洲；像龙舌兰（agave）并不属于仙人掌科，容易混淆。"]}
{"word":"cactaceous","summary":{"en":"“Cactaceous” means “related to or like a cactus,” often used in botany and gardening.","zh":"“cactaceous”意为“与仙人掌有关的/像仙人掌的”，常用于植物学与园艺语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or resembling a cactus; belonging to the cactus family (Cactaceae).","zh":"与仙人掌有关的；像仙人掌的；属于仙人掌科（Cactaceae）的。"},"examples":[{"en":"Cactaceous plants often store water in thick stems to survive in dry climates.","zh":"仙人掌科植物常把水分储存在肥厚的茎里，以便在干旱气候中生存。"},{"en":"The garden has a small cactaceous section with many different species.","zh":"花园里有一块小小的仙人掌科植物区，种类很多。"}]}],"synonyms":["cactus-like","cactus-related"],"phonetic":"/kækˈteɪʃəs/","extraExplanation":["词源上，cactaceous 来自 “cactus（仙人掌）+ -aceous（表示‘……的；像……的’，常用于植物/化学相关形容词）”。","在写作或科普语境中，cactaceous 比 cactus-like 更正式，常见于园艺、植物学描述。"]}
{"word":"cactal","summary":{"en":"“Cactal” is a rare/nonstandard adjective meaning “cactus-like.” In most contexts, use “cactus” (as an adjective) or “cactaceous.”","zh":"“cactal”是罕用/非标准的形容词，意为“像仙人掌的”。多数情况下更建议用“cactus”（作形容词）或更正式的“cactaceous”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Relating to or resembling a cactus; cactus-like.","zh":"（罕用）与仙人掌有关的；像仙人掌的。"},"examples":[{"en":"The artist painted a cactal landscape with spiny silhouettes against the sunset.","zh":"画家画了一幅“仙人掌风”的风景画，落日下是带刺的剪影。"},{"en":"Some desert plants have a cactal shape that helps them store water.","zh":"一些沙漠植物有“仙人掌式”的形态，能帮助它们储存水分。"}]},{"partOfSpeech":"other","definition":{"en":"Often seen as a misspelling or nonstandard form; in most writing, use “cactus” (adj.) or “cactaceous.”","zh":"常被视为拼写错误或非标准形式；多数写作中更常用“cactus”（作形容词）或“cactaceous”。"},"examples":[{"en":"If you mean “cactus-like,” it’s safer to write “cactaceous leaves.”","zh":"如果你想表达“像仙人掌的”，更稳妥的写法是“cactaceous leaves（仙人掌状的叶子）”。"},{"en":"In everyday English, people usually say “a cactus plant,” not “a cactal plant.”","zh":"日常英语里人们通常说“a cactus plant（仙人掌植物）”，而不是“a cactal plant”。"}]}],"synonyms":["cactus-like","cactaceous","spiny"],"phonetic":"/ˈkæk.təl/","extraExplanation":["“cactal”在现代英语中不算常见标准词汇；你更可能想写的是“cactus”（名词：仙人掌；也可作形容词，如 cactus garden）或“cactaceous”（更正式、常用于生物/植物学，意为“仙人掌科的/仙人掌状的”）。","如果你是在特定文本/游戏/小说里看到“cactal”，也可能是作者的自造词或风格用法，用来营造“多刺、荒漠、耐旱”的意象。"]}
{"word":"Cactales","summary":{"en":"Cactales is a scientific term for an order of flowering plants that includes cacti and close relatives.","zh":"Cactales 是一个植物学术语，指包含仙人掌及其近缘类群的一个植物“目”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a botanical order of flowering plants that includes cacti and several related families, mostly adapted to dry (arid) environments","zh":"植物学上的一个被子植物“目”，包括仙人掌科及若干近缘科，许多成员适应干旱环境"},"examples":[{"en":"Cactales includes the cactus family (Cactaceae), famous for plants like the saguaro.","zh":"Cactales（仙人掌目）包括仙人掌科（Cactaceae），以巨人柱等植物闻名。"},{"en":"In a plant classification project, we studied how Cactales evolved traits for conserving water.","zh":"在植物分类项目中，我们研究了仙人掌目如何演化出节水的特征。"}]}],"synonyms":["cactus order (informal)","Cactaceae-related order (informal)"],"phonetic":"/kækˈteɪliːz/","extraExplanation":["“Cactales”是拉丁化的学术名称，通常用于植物分类学（taxonomy）。在现代分类系统（如APG系统）中，仙人掌科（Cactaceae）一般归入“石竹目（Caryophyllales）”，因此你在不同教材或数据库里可能会看到“Cactales”与“Caryophyllales”在归类上有所差异。"]}
{"word":"cactales","summary":{"en":"Cactales is an older scientific name for the cactus order in plant classification.","zh":"Cactales 是植物分类中较旧的“仙人掌目”名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany, taxonomy) a former scientific order name that grouped the cactus family (Cactaceae); in many modern systems, cacti are placed in the order Caryophyllales instead.","zh":"（植物学／分类学）曾用的一个植物“目”名，用来归类仙人掌科（Cactaceae）；在许多现代分类系统中，仙人掌多被归入石竹目（Caryophyllales）。"},"examples":[{"en":"In older botany books, you may see cacti listed under the order Cactales.","zh":"在较早的植物学书籍里，你可能会看到仙人掌被列在“仙人掌目（Cactales）”下。"},{"en":"Modern classifications usually place the cactus family in Caryophyllales rather than Cactales.","zh":"现代分类通常把仙人掌科放在石竹目（Caryophyllales），而不是仙人掌目（Cactales）。"}]}],"synonyms":["cactus order"],"phonetic":"/kækˈteɪliːz/","extraExplanation":["“Cactales”多见于较旧的学术资料或拉丁化的分类名，通常首字母大写。日常英语里更常用的是 cactus（仙人掌）及其复数 cacti / cactuses。","你输入的“cactales”如果是想表达“很多仙人掌”，更自然的说法是 cacti 或 cactuses；“Cactales”则偏学术分类用语。"]}
{"word":"cacti","summary":{"en":"Cacti is the plural form of cactus (also: cactuses)—spiny desert plants that store water.","zh":"Cacti 是 cactus 的复数（也可说 cactuses），指能储水、常有刺、常见于干旱地区的仙人掌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of cactus: a type of plant that usually grows in dry places and has thick stems that store water and sharp spines instead of leaves.","zh":"cactus 的复数：仙人掌，一种常生长在干旱地区的植物，茎肥厚可储水，常有刺而非叶子。"},"examples":[{"en":"Cacti can survive for a long time without rain.","zh":"仙人掌可以在很久没有下雨的情况下存活。"},{"en":"We saw many cacti in the desert.","zh":"我们在沙漠里看到了许多仙人掌。"},{"en":"Be careful—some cacti have very sharp spines.","zh":"小心——有些仙人掌的刺非常锋利。"}]}],"synonyms":["cactuses"],"phonetic":"/ˈkæktaɪ/","extraExplanation":["“cacti”常见于书面语或较正式的表达；口语中也常听到复数形式“cactuses”。两者都正确。","词源来自拉丁语 *cactus*，再经由希腊语 *kaktos*（一种带刺植物）。在英语里，拉丁语来源的名词有时会保留拉丁复数形式（如 cactus → cacti，focus → foci），但很多也接受英语规则复数（cactuses）。"]}
{"word":"cactiform","summary":{"en":"Cactiform means “cactus-shaped.”","zh":"cactiform 意为“仙人掌状的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Shaped like a cactus; having a cactus-like form (often used in botany to describe plants with thick, fleshy stems and reduced leaves).","zh":"仙人掌状的；形态像仙人掌的（常用于植物学，描述茎肥厚多肉、叶片退化的植物形态）。"},"examples":[{"en":"Some succulents have a cactiform shape that helps them store water.","zh":"一些多肉植物呈仙人掌状，有助于储存水分。"},{"en":"The researcher described the plant as cactiform, with a swollen stem and few visible leaves.","zh":"研究者描述这种植物为仙人掌状：茎膨大，几乎看不到叶子。"}]}],"synonyms":["cactus-like","cactaceous","succulent-looking"],"phonetic":"/ˈkæk.tə.fɔrm/","extraExplanation":["“cactiform”由“cactus（仙人掌）+ -form（……形状的）”构成，多见于植物学/园艺写作。它强调“外形像仙人掌”，不一定真的是仙人掌科植物。"]}
{"word":"cactoid","summary":{"en":"“Cactoid” means cactus-like in form or structure, often used in botany.","zh":"“cactoid”意为“仙人掌状的/像仙人掌的”，常用于植物学或园艺语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a cactus, especially in having a thick, fleshy, often spiny stem adapted to dry conditions.","zh":"像仙人掌的；尤指具备肥厚多汁、常带刺的茎等适应干旱环境的特征。"},"examples":[{"en":"Some succulents have a cactoid form even though they are not true cacti.","zh":"有些多肉植物呈现“仙人掌状”的外形，虽然它们并不是真正的仙人掌。"},{"en":"The plant developed a cactoid stem to store water during drought.","zh":"这种植物长出了仙人掌状的茎，以便在干旱时储存水分。"}]}],"synonyms":["cactus-like","cacti-form","spiny","succulent (context-dependent)"],"phonetic":"/ˈkæk.tɔɪd/","extraExplanation":["词源提示：cactoid 由 cactus（仙人掌）+ -oid（“……状/类似……的”）构成，常用于植物学写作来描述外形或结构“像仙人掌”，不一定表示它属于仙人掌科。","使用语境：多见于园艺、植物学、生态适应等语境；日常口语较少用，更常说 “cactus-like”。"]}
{"word":"Cactus","summary":{"en":"A cactus is a water-storing, usually spiny plant adapted to dry places.","zh":"Cactus 指能储水、通常带刺、适应干旱环境的仙人掌类植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A plant with thick, fleshy stems that stores water and usually has spines; many types grow in dry, desert areas.","zh":"仙人掌；一种茎肥厚可储水、通常带刺的植物，常见于干旱或沙漠地区。"},"examples":[{"en":"Cacti can survive long periods without rain.","zh":"仙人掌可以在很长时间没有降雨的情况下存活。"},{"en":"Be careful—this cactus has sharp spines.","zh":"小心——这株仙人掌有很尖的刺。"},{"en":"They decorated the room with small potted cacti.","zh":"他们用几盆小仙人掌装饰了房间。"}]},{"partOfSpeech":"n.","definition":{"en":"A type of tall, column-shaped cactus (especially a saguaro) associated with the deserts of the southwestern United States.","zh":"（尤指巨人柱等）高大柱状仙人掌，常与美国西南部沙漠联系在一起。"},"examples":[{"en":"The cactus in the photo is a saguaro, common in Arizona.","zh":"照片里的仙人掌是巨人柱，在亚利桑那很常见。"},{"en":"We saw a giant cactus silhouetted at sunset.","zh":"我们看到一株巨大的柱状仙人掌在日落时呈现剪影。"}]}],"synonyms":["succulent (related, not exact)","prickly pear (a type)"],"phonetic":"/ˈkæk.təs/","extraExplanation":["“cactus”复数常见两种：cactuses（更口语、更常用）和cacti（更偏学术/正式）。","在英语文化里，cactus常用来象征“坚韧”“能在艰难环境中生存”。文学与电影里也常用它来快速营造“荒漠/西部”氛围。"]}
{"word":"cactus","summary":{"en":"A cactus is a water-storing desert plant, usually covered with spines.","zh":"cactus 指“仙人掌”，一种能储水、常有刺、适应干旱环境的植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a desert plant with a thick, fleshy stem that stores water and usually has spines instead of leaves","zh":"仙人掌；一种生长在干旱地区、茎肉质可储水、通常以刺代替叶子的植物"},"examples":[{"en":"Cacti can survive long periods without rain.","zh":"仙人掌即使很久不下雨也能生存。"},{"en":"Be careful—the cactus has sharp spines.","zh":"小心——这株仙人掌有很尖的刺。"},{"en":"She keeps a small cactus on her desk because it’s easy to care for.","zh":"她在桌上放了一盆小仙人掌，因为很容易照顾。"}]}],"synonyms":["succulent (broader category)","prickly pear (a type of cactus)"],"phonetic":"/ˈkæk.təs/","extraExplanation":["“Cactus”的复数常见有两种：cactuses（更口语、常用）和 cacti（更偏传统/学术用法）。","仙人掌的“刺”在植物学上多由叶子演化而来，能减少水分蒸发并保护植物。","在英语文化里，cactus 常让人联想到干旱沙漠环境（如美国西南部），也常作为“耐旱、好养”的室内植物形象出现。"]}
{"word":"cactuses","summary":{"en":"“Cactuses” means more than one cactus; “cactuses” and “cacti” are both correct plurals.","zh":"“cactuses”表示“仙人掌”的复数；“cactuses”和“cacti”都是正确的复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural form of “cactus”: a desert plant with thick stems that store water, often with spines.","zh":"“cactus”的复数形式：仙人掌，一种常见于干旱地区、茎肥厚可储水、常带刺的植物。"},"examples":[{"en":"Cactuses can survive long periods without rain.","zh":"仙人掌能在很长时间没有降雨的情况下存活。"},{"en":"She grows cactuses on her sunny windowsill.","zh":"她在阳光充足的窗台上种仙人掌。"}]}],"synonyms":["cacti"],"phonetic":"/ˈkæk.təs.ɪz/","extraExplanation":["“cactuses”和“cacti”都正确：在日常英语里“cactuses”更常见、更口语；“cacti”更偏书面或带一点学术/拉丁语色彩。","当你在植物园、科普文章里也可能看到更专业的复数“cactuses”或“cacti”，两者都不会错。"]}
{"word":"cactuslike","summary":{"en":"“Cactuslike” means resembling a cactus in appearance.","zh":"“cactuslike”指外观像仙人掌的、仙人掌状的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a cactus in shape or appearance (for example, having spines, thick fleshy parts, or an upright, segmented form).","zh":"像仙人掌的；仙人掌状的（例如带刺、肉质肥厚，或直立分节的外形）。"},"examples":[{"en":"The landscape was dotted with cactuslike plants and dry shrubs.","zh":"这片地貌上点缀着仙人掌状的植物和干燥的灌木。"},{"en":"She drew a cactuslike silhouette with sharp spines along the edges.","zh":"她画了一个仙人掌状的轮廓，边缘带着尖刺。"}]}],"synonyms":["cactus-shaped","spiky","thorny","succulent-like"],"phonetic":"/ˈkæk.təsˌlaɪk/","extraExplanation":["“cactuslike”是由“cactus + -like”构成的形容词，-like 表示“像……一样”。常见同类表达还有：snake-like（蛇一样的）、childlike（孩子般的）。","在写作里它常用于描写外形与质感（spiky 带刺的、thorny 多刺的、succulent 多肉的）。注意它描述的是“外观像”，不一定真的是仙人掌。"]}
{"word":"cacumen","summary":{"en":"Cacumen means the highest point or tip of something, especially in formal or botanical contexts.","zh":"cacumen 指“最高点/顶点”或“尖端/顶端（植物学）”，多见于正式或学术语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the top or highest point of something; a peak or summit (often used in formal or scientific writing)","zh":"某物的顶部或最高点；顶峰、顶点（多用于正式或科学语境）"},"examples":[{"en":"From the cacumen of the hill, we could see the entire valley.","zh":"从山丘的顶峰上，我们能看到整个山谷。"},{"en":"Her career reached its cacumen in the early 2000s.","zh":"她的事业在21世纪初达到顶点。"}]},{"partOfSpeech":"n.","definition":{"en":"(botany) the tip or apex of a plant part, especially the growing point of a stem or leaf","zh":"（植物学）植物部分的尖端或顶端，尤指茎或叶的生长点"},"examples":[{"en":"Damage to the cacumen can slow a plant’s growth.","zh":"顶端（生长点）受损会减缓植物的生长。"},{"en":"The botanist examined the leaf cacumen under a microscope.","zh":"植物学家在显微镜下观察叶片的顶端。"}]}],"synonyms":["peak","summit","apex","tip","top","pinnacle"],"phonetic":"/kəˈkjuːmən/","extraExplanation":["该词来自拉丁语 cacumen，意为“顶点、尖端”。在现代英语里比较少见，常见于学术写作（尤其是植物学）或较文学化的表达。日常交流中更常用 peak / summit / top，植物学里常用 apex / tip / growing point。"]}
{"word":"cacuminal","summary":{"en":"Cacuminal is a rare adjective meaning “at the tip/summit (apex),” and very rarely “hooked at the tip.”","zh":"cacuminal 是个较罕见的形容词，主要指“在顶端/顶点的”，极少数情况下也可指“末端呈钩状的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare; technical) Located at, relating to, or forming the tip/summit (the apex) of something.","zh":"（罕见；术语）位于……顶端/顶点的；与顶端有关的；构成顶端的。"},"examples":[{"en":"In botany, a cacuminal bud is the bud at the very tip of a shoot.","zh":"在植物学中，cacuminal bud 指枝条最顶端的芽（顶芽）。"},{"en":"Damage to the cacuminal portion of the plant can slow its upward growth.","zh":"植物顶端部分受损可能会减缓其向上生长。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Very rare) Having a tip that is bent or hooked.","zh":"（极罕见）末端弯曲或呈钩状的。"},"examples":[{"en":"The old key had a slightly cacuminal tip, curved like a hook.","zh":"那把旧钥匙的尖端略呈钩状，微微弯曲。"}]}],"synonyms":["apical","terminal","summital","at the apex"],"phonetic":"/kəˈkjuːmɪnəl/","extraExplanation":["词源来自拉丁语 cacumen，意思是“顶点、尖端”。因此这个词在较旧或较专业的英文里，常用来表示“顶端的/顶点的”（尤其见于生物或解剖等语境）。","现代英语中更常见的相关词包括：apical（顶端的）、terminal（末端的）。在植物学里也常见：cacuminate/cuspidate（尖的、具尖突的），但它们与 cacuminal 不完全等同。"]}
{"word":"cacuminate","summary":{"en":"“Cacuminate” means to make something pointed, or to become pointed.","zh":"“cacuminate”意为“使某物变尖/削尖”，也可指“变尖”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something end in a sharp point; to sharpen or taper to a point","zh":"使某物变得尖；使末端呈尖点；削尖"},"examples":[{"en":"The artisan cacuminated the wooden stake so it could pierce the ground easily.","zh":"工匠把木桩削尖，这样就能更容易插进地里。"},{"en":"Some leaves look cacuminated, ending in a long, narrow tip.","zh":"有些叶子看起来像“渐尖”的，末端是一条又长又细的尖端。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become pointed or end in a tip","zh":"变尖；末端形成尖点"},"examples":[{"en":"As the clay dried, the small peak began to cacuminate.","zh":"黏土干燥后，小尖峰开始变得更尖。"}]}],"synonyms":["sharpen","point","taper","form a tip","make pointed"],"phonetic":"/kəˈkjuːməˌneɪt/","extraExplanation":["“cacuminate”是非常少见、偏书面（甚至带点古旧）的词，写作中更常用的替代词有“sharpen（削尖）”“taper（逐渐变细成尖）”或形容词“pointed（尖的）”。","词源来自拉丁语“cacumen”（意为“顶端、尖峰”）。在植物学或描述形状的语境里，你也可能见到相关形容词“cacuminate”（意为“渐尖的、具长尖端的”），用于形容叶尖等形态。"]}
{"word":"cacumination","summary":{"en":"Cacumination means the highest point or the climax/culminating point of something, especially in formal or literary contexts.","zh":"cacumination 指“最高点/顶峰”，也可指事情发展的“高潮/顶点”，多见于正式或文学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the highest point or peak; the culminating point of something (often used in formal or literary writing).","zh":"最高点；顶峰；（常用于正式或文学语境）事物发展的顶点/高潮。"},"examples":[{"en":"Reaching the summit felt like the cacumination of months of training.","zh":"到达山顶感觉像是数月训练的最高成果/顶点。"},{"en":"In the novel, the trial scene is the cacumination of the main conflict.","zh":"在这部小说中，审判场景是主要冲突的高潮。"}]}],"synonyms":["culmination","peak","pinnacle","apex","zenith","summit"],"phonetic":"/kəˌkjuːməˈneɪʃən/","extraExplanation":["“cacumination”非常少见，更常用的词是“culmination”（高潮/顶点）或“peak”（顶峰）。","词源来自拉丁语“cacumen”（顶端、尖峰）。如果你是在写作中看到它，它通常带有更“书面、古典”的风格色彩。"]}
{"word":"cacuminous","summary":{"en":"“Cacuminous” means harsh-sounding or unpleasant to hear.","zh":"“cacuminous”表示“刺耳的、难听的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"harsh-sounding; unpleasant to hear (used especially about a voice, music, or words).","zh":"（尤指声音、音乐或措辞）刺耳的；难听的。"},"examples":[{"en":"The singer’s cacuminous notes made the audience wince.","zh":"歌手刺耳的音调让观众皱起了眉。"},{"en":"The old microphone turned his speech into a cacuminous roar.","zh":"老旧的麦克风把他的讲话变成了刺耳的轰鸣。"},{"en":"She avoided cacuminous words and chose softer, kinder language instead.","zh":"她避免使用刺耳的词语，而选择更柔和、更友善的表达。"}]}],"synonyms":["cacophonous","harsh","grating","jarring","discordant"],"phonetic":"/kəˈkjuːmənəs/","extraExplanation":["这是一个比较少见、偏文学/正式的词，意思接近更常用的 cacophonous（刺耳的、不和谐的）。写作中用它可以强调“声音让人不舒服”的感觉。","词形上常让人联想到 caco-（源自希腊语，表示“坏的、差的”），与 cacophony（刺耳的噪音、不和谐的声音）同一类词根家族。实际使用中，多用于描述音色、发音或语言的“难听”。"]}
{"word":"cacur","summary":{"en":"Cactus: a water-storing plant adapted to dry environments, often with spines.","zh":"Cactus：适应干旱环境、能储水、常带刺的植物（仙人掌）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant with thick, fleshy stems (often with spines) that stores water and is adapted to dry places","zh":"仙人掌（一类茎肥厚、常带刺、能储水、适应干旱环境的植物）"},"examples":[{"en":"We keep a small cactus on the windowsill because it doesn’t need much water.","zh":"我们在窗台上养了一盆小仙人掌，因为它不太需要浇水。"},{"en":"Be careful—this cactus has sharp spines.","zh":"小心——这株仙人掌有尖刺。"}]}],"synonyms":["succulent (related, not exact)"],"phonetic":"/ˈkæk.təs/","extraExplanation":["“cacur” 不是常见英文单词，最可能是拼写错误。常见相近词包括：cactus（仙人掌）、caucus（党团会议/核心小组）、caper（恶作剧/跳跃）。如果你想查的不是 cactus，可以告诉我你想表达的中文意思或给一个例句。"]}
{"word":"Cacus","summary":{"en":"Cacus is a Roman mythological monster who stole Hercules’ cattle and was killed by Hercules.","zh":"Cacus（卡库斯）是罗马神话中的怪物，曾偷走赫拉克勒斯的牛群，后被赫拉克勒斯杀死。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Roman mythology, a fire-breathing giant or monster who lived in a cave on the Aventine Hill and stole cattle from Hercules (Heracles); Hercules later killed him.","zh":"在罗马神话中，卡库斯是会喷火的巨人/怪物，住在阿文提诺山的洞穴里，曾偷走赫拉克勒斯（海格力斯）的牛群，后来被赫拉克勒斯杀死。"},"examples":[{"en":"In the myth, Cacus hides Hercules’ cattle in his cave.","zh":"在神话里，卡库斯把赫拉克勒斯的牛藏进了洞穴。"},{"en":"Virgil mentions Cacus in the Aeneid as a terrifying monster defeated by Hercules.","zh":"维吉尔在《埃涅阿斯纪》中提到卡库斯，把他写成被赫拉克勒斯击败的可怕怪物。"}]}],"synonyms":["mythical monster","giant (myth)"],"phonetic":"/ˈkeɪkəs/","extraExplanation":["读音与拼写提示：Cacus 是拉丁名字，英语里常读作 /ˈkeɪkəs/（类似“KAY-kus”）。","文化背景：卡库斯的故事常被用来象征“偷盗、欺骗、野蛮力量”，也常与罗马地理传说相连（阿文提诺山 Aventine Hill）。","文学出处：最常见的经典来源之一是维吉尔《埃涅阿斯纪》（Aeneid）第八卷，书中描写赫拉克勒斯击杀卡库斯的场景，以凸显英雄力量与秩序战胜混乱。"]}
{"word":"cacy","summary":{"en":"“Cacy” is not a standard standalone English word; it’s usually a typo or part of a word ending in “-acy.”","zh":"“cacy”不是标准的独立英语单词；通常是拼写错误或“-acy”结尾单词的一部分。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word by itself; most often a misspelling or an incomplete fragment of a longer word (for example, words ending in “-acy” like “privacy” or “supremacy”).","zh":"本身不是标准英语单词；通常是拼写错误或较长单词的一部分（例如以“-acy”结尾的词，如 privacy 或 supremacy）。"},"examples":[{"en":"I couldn’t find “cacy” in a dictionary—did you mean “privacy” or “efficacy”?","zh":"我在词典里找不到“cacy”——你是想说“privacy（隐私）”还是“efficacy（疗效/效能）”吗？"},{"en":"Many English nouns end in “-acy,” like “accuracy” and “literacy.”","zh":"许多英语名词以“-acy”结尾，比如“accuracy（准确性）”和“literacy（读写能力）”。"}]}],"phonetic":"/ˈkeɪsi/","extraExplanation":["如果你想查的是以“-acy”结尾的名词，这个后缀常表示“状态/性质/程度”（如 privacy 隐私、accuracy 准确性、efficacy 疗效/效能、literacy 读写能力）。\n如果你把目标词（或完整句子）再发一次，我可以按正确词条给你发音、词义和例句。"]}
