{"word":"CAD","summary":{"en":"CAD most commonly means computer-aided design; it can also mean coronary artery disease or the Canadian dollar (CAD).","zh":"CAD最常指“计算机辅助设计”，也可指“冠状动脉疾病”或“加元（货币代码CAD）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Computer-aided design: the use of computer software to create, modify, and test designs (often in engineering, architecture, or product design).","zh":"计算机辅助设计：使用计算机软件来创建、修改并测试设计（常用于工程、建筑或产品设计）。"},"examples":[{"en":"She learned CAD to design furniture more accurately.","zh":"她学习CAD，以更精确地设计家具。"},{"en":"The architect sent the CAD files to the construction team.","zh":"建筑师把CAD文件发给了施工团队。"},{"en":"This job requires experience with CAD software like AutoCAD or SolidWorks.","zh":"这份工作需要有使用AutoCAD或SolidWorks等CAD软件的经验。"}]},{"partOfSpeech":"other","definition":{"en":"Coronary artery disease: a medical condition in which the heart’s arteries become narrowed or blocked.","zh":"冠状动脉疾病：一种心脏冠状动脉变窄或堵塞的疾病。"},"examples":[{"en":"Smoking increases the risk of CAD.","zh":"吸烟会增加患CAD（冠心病）的风险。"},{"en":"The doctor discussed treatment options for CAD.","zh":"医生讨论了CAD（冠心病）的治疗方案。"}]},{"partOfSpeech":"other","definition":{"en":"Canadian dollar: the currency of Canada (currency code: CAD).","zh":"加元：加拿大的货币（货币代码：CAD）。"},"examples":[{"en":"The price is 50 CAD, not 50 USD.","zh":"价格是50加元（CAD），不是50美元（USD）。"},{"en":"I exchanged some money into CAD before my trip to Toronto.","zh":"去多伦多旅行前，我把一些钱换成了加元（CAD）。"}]}],"synonyms":["computer-aided design (for meaning 1)"],"phonetic":"/kæd/","extraExplanation":["“CAD”是缩写，通常全大写；具体含义要看语境：在工程/设计领域最常指“计算机辅助设计”，在医学语境常指“冠状动脉疾病”，在金融/外汇语境则是“加元”的货币代码。","口语中有时会直接读作单词 /kæd/（像“cad”一样），也有人按字母读作 C-A-D；正式场合写作一般保留大写。"]}
{"word":"cad","summary":{"en":"“Cad” can mean an old-fashioned term for a dishonorable man, or (as “CAD”) computer-aided design.","zh":"“cad”可指（较旧式、偏英式）卑鄙无礼的男人；“CAD”则指计算机辅助设计。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rude or dishonorable man (old-fashioned, mainly British English)","zh":"卑鄙无礼的男人；无赖（较旧式用法，主要为英式英语）"},"examples":[{"en":"He behaved like a cad and never apologized.","zh":"他表现得像个无赖，从不道歉。"},{"en":"In the novel, the cad lies to several people to get what he wants.","zh":"在小说里，这个卑鄙的人为了达到目的对好几个人撒谎。"}]},{"partOfSpeech":"n.","definition":{"en":"Computer-Aided Design; the use of computer software to create technical drawings and 2D/3D models","zh":"计算机辅助设计（用软件制作工程图与二维/三维模型）"},"examples":[{"en":"She works in CAD and designs machine parts.","zh":"她从事CAD工作，设计机器零件。"},{"en":"Please send the CAD file before the meeting.","zh":"请在会议前把CAD文件发来。"},{"en":"Our team uses CAD to model the product in 3D.","zh":"我们团队用CAD做产品的三维建模。"}]}],"synonyms":["scoundrel","lout","jerk","computer-aided design"],"phonetic":"/kæd/","extraExplanation":["“cad”表示“卑鄙的人”时带有强烈的道德评判色彩，现代口语里较少见，常出现在英式语境、小说或较正式/戏谑的表达中。","“CAD”作为缩写在工程、建筑、工业设计等领域非常常见；书写上常用大写以避免与表示“无赖”的 cad 混淆。"]}
{"word":"Cadal","summary":{"en":"Cadal is usually a personal name in English; it can also refer to the Scottish Gaelic word for “sleep” in language/cultural contexts.","zh":"Cadal 在英语里通常是人名；在语言/文化语境中也可指苏格兰盖尔语里表示“睡眠”的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper name) A surname or given name; not a common English vocabulary word on its own.","zh":"（专有名词）姓氏或名字；本身不是常见的英语词汇。"},"examples":[{"en":"Dr. Cadal will lead today’s seminar.","zh":"Cadal 医生将主持今天的研讨会。"},{"en":"I saw the name Cadal on the guest list.","zh":"我在宾客名单上看到了 Cadal 这个名字。"}]},{"partOfSpeech":"n.","definition":{"en":"(From Scottish Gaelic) “sleep; a period of sleeping.” Used mainly when discussing Gaelic language/culture, not in everyday English.","zh":"（源自苏格兰盖尔语）“睡眠；睡着的一段时间”。多用于介绍盖尔语/文化语境，不是日常英语用词。"},"examples":[{"en":"In Scottish Gaelic, cadal means “sleep.”","zh":"在苏格兰盖尔语里，cadal 的意思是“睡眠”。"},{"en":"The poem uses the word cadal to suggest peaceful rest.","zh":"这首诗用 cadal 这个词来表达宁静的休憩。"}]}],"synonyms":["(name) N/A","(Gaelic sense) sleep"],"phonetic":"/kəˈdæl/","extraExplanation":["“Cadal”在英语语料中最常见的身份是人名/姓氏；如果你是在英文文章里看到它，通常不需要翻译，只要按名字理解。","如果你希望我给出更准确的释义，请告诉我你看到它的句子或上下文（例如是人名、地名、品牌名，还是语言学/文学引用）。"]}
{"word":"cadalene","summary":{"en":"Cadalene is a chemical name for an aromatic hydrocarbon found in some essential oils and fossil plant material, often used as a marker of plant-derived organics.","zh":"cadalene 是一种芳香烃的化学名称，见于某些精油及植物化石/沉积有机质中，常用作植物来源有机物的指示物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an aromatic hydrocarbon (C15H18) found in some essential oils and in fossil plant materials; used in chemistry and geology as an indicator of plant-derived organic matter (especially from certain resins).","zh":"一种芳香烃（C15H18），存在于某些精油及植物化石/沉积有机质中；在化学与地质研究中常用作“植物来源有机物（尤其某些树脂）”的指示性化合物。"},"examples":[{"en":"Scientists detected cadalene in the sediment sample, suggesting a strong input from plant resins.","zh":"科学家在沉积物样品中检测到cadalene，表明有较多的植物树脂输入。"},{"en":"Some essential oils contain trace amounts of cadalene and related aromatic compounds.","zh":"一些精油中含有微量的cadalene及相关芳香化合物。"}]}],"synonyms":["aromatic hydrocarbon","biomarker (contextual)"],"phonetic":"ˈkædəˌliːn","extraExplanation":["“cadalene”主要出现在化学、地球化学与有机地质学语境里，日常英语中很少使用。它常被当作“生物标志物（biomarker）/分子化石（molecular fossil）”之一，用来推断沉积物或石油中有机质的来源与演化。","该词多见于学术论文、实验报告、材料分析（如GC-MS气相色谱-质谱）结果描述中；在一般词典里可能收录较少。"]}
{"word":"cadamba","summary":{"en":"Cadamba is a fast-growing tropical Asian tree (also called kadamba) known for its round, fragrant flowers and useful wood.","zh":"cadamba 指一种生长快的热带亚洲树木（亦称 kadamba），以圆球状芳香花与可用木材而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical South and Southeast Asian tree (Neolamarckia cadamba, also called kadamba) with round, orange-yellow flower heads and fragrant blossoms; its wood is used for timber and paper pulp.","zh":"（南亚与东南亚的）卡丹巴树／卡达姆巴树（学名 Neolamarckia cadamba，亦作 kadamba），花呈圆球状、橙黄色且常带香味；木材常用于建材与造纸。"},"examples":[{"en":"The cadamba grows quickly, so it is often planted for timber.","zh":"卡丹巴树生长很快，所以常被种植用作木材。"},{"en":"In the rainy season, cadamba flowers can scent the air.","zh":"雨季时，卡丹巴树的花香会飘满空气。"},{"en":"The park planted cadamba trees to provide shade along the path.","zh":"公园沿小路种了卡丹巴树来提供树荫。"}]}],"synonyms":["kadamba","burflower-tree"],"phonetic":"/kəˈdæmbə/","extraExplanation":["“cadamba”常见于印度文化语境中，别名“kadamba”。在一些印度文学与宗教传统里，kadamba 与克里希纳（Krishna）的故事及雨季意象有关，因此在诗歌/歌曲中偶尔会被用作带有地域与季节氛围的植物意象。","拼写小提示：英语里常见两种写法 cadamba / kadamba，指的多为同一种树。"]}
{"word":"cadaster","summary":{"en":"A cadaster is an official land register (and mapping system) that records property boundaries, ownership, and value.","zh":"cadaster 指官方的地籍登记（及测绘体系），记录土地/房产的边界、权属与价值。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in government use) an official register of land parcels that records boundaries, ownership, and value for taxation or legal purposes; also the mapping system used for this.","zh":"（多用于政府语境）地籍／不动产登记册：记录土地地块的边界、权属和价值，用于征税或法律用途；也可指相应的测绘与登记体系。"},"examples":[{"en":"The city updated its cadaster to reflect new property boundaries.","zh":"该市更新了地籍记录，以反映新的房产边界。"},{"en":"According to the cadaster, this parcel belongs to the state.","zh":"根据地籍资料，这块地属于国家。"}]}],"synonyms":["land registry","cadastral record","property register"],"phonetic":"/kəˈdæs.tɚ/","extraExplanation":["“cadaster”常见于法律、测绘、城市规划与不动产管理语境，在美式英语里也常用更常见的说法“cadastral map/record”（地籍图／地籍记录）。","词源与法语/拉丁语有关，核心含义一直围绕“土地登记与测量”。在英美日常口语中不算高频，更多出现在正式文件或专业领域。"]}
{"word":"cadasters","summary":{"en":"“Cadasters” is the plural of “cadaster”: official land/property records (often with maps) used for ownership, boundaries, and taxation.","zh":"“cadasters”是“cadaster”的复数：指用于记录土地/房产的官方地籍资料（常含地图），涉及产权、边界与税务等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an official register (and often a map) showing land ownership, boundaries, and property values, used especially for taxation and legal records","zh":"地籍册；地籍（通常含地图），记录土地所有权、边界与估价，常用于征税与法律登记"},"examples":[{"en":"The city updated its cadaster to reflect new property boundaries.","zh":"该市更新了地籍，以反映新的房产边界。"},{"en":"According to the cadaster, this parcel belongs to the neighboring farm.","zh":"根据地籍记录，这块地属于隔壁农场。"}]},{"partOfSpeech":"n.","definition":{"en":"the system or process of surveying, mapping, and recording land parcels for administrative purposes","zh":"地籍制度；地籍测绘与登记（对地块进行测量、制图并登记的体系/过程）"},"examples":[{"en":"Modern cadaster helps reduce land disputes by clarifying who owns what.","zh":"现代地籍制度通过明确产权归属来减少土地纠纷。"}]}],"synonyms":["land registry","property register","land records","cadastral map"],"phonetic":"/kəˈdæs.tɚ/","extraExplanation":["“Cadaster”常见于政府、地产、测绘和法律语境；日常口语里更常说“land registry（土地登记处/产权登记）”或“property records（房产记录）”。","词源上与法语/拉丁语中“登记、记录”相关，许多国家（尤其欧洲）有较成熟的地籍系统，用于税收、规划与产权确认。"]}
{"word":"cadastral","summary":{"en":"Cadastral means relating to official land ownership and boundary records (a cadastre).","zh":"cadastral 指与地籍（官方土地权属与边界登记）相关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to a cadastre: an official government record or map showing who owns pieces of land, their boundaries, and often their value for tax purposes.","zh":"与“地籍”有关的：指政府对土地所有权、边界（有时还包括估价与税务信息）的官方登记与地图记录。"},"examples":[{"en":"The surveyor updated the cadastral map after the boundary dispute was resolved.","zh":"边界纠纷解决后，测量员更新了地籍地图。"},{"en":"Cadastral records help the city collect property taxes fairly.","zh":"地籍记录有助于城市更公平地征收房产税。"}]}],"synonyms":["land-registry","property-record","land-survey (related)"],"phonetic":"/kəˈdæs.trəl/","extraExplanation":["“cadastral”常见于法律、地产、测绘与政府文件中，日常口语里不太常用；更常听到的是“land registry（土地登记）/ property records（产权档案）/ land survey（土地测量）”。","词根来自法语与拉丁语系，核心概念是把土地“登记在册”，以便确认产权、处理边界争议、征税或进行城市规划。"]}
{"word":"cadastrally","summary":{"en":"Cadastrally means “in a way related to an official land/parcel registry (cadastre).”","zh":"cadastrally 表示“以与地籍（官方土地地块登记/地籍图）相关的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to a cadastre (an official register/map of land parcels, ownership, boundaries, and value for legal or tax purposes).","zh":"以（地籍的）方式；与地籍（官方土地登记/地籍图：地块、边界、权属与价值信息，用于法律或税务）有关地。"},"examples":[{"en":"The land was cadastrally surveyed before the new highway was approved.","zh":"在新高速公路获批之前，这片土地先进行了地籍测量。"},{"en":"The parcel is cadastrally recorded as Lot 12 on the municipal map.","zh":"该地块在地籍记录中标注为市政地图上的第12号地块。"}]}],"synonyms":["according to the land registry","on the cadastral map","in cadastral terms","land‑registry‑wise"],"phonetic":"/kəˈdæs.trə.li/","extraExplanation":["“cadastrally”来自“cadastre（地籍/地籍簿）”。在很多国家和地区，地籍系统用于明确土地边界与权属，并常与房产税、征收、规划审批等事务相关。","该词多见于法律、测绘、城市规划、房地产登记等正式语境；日常英语里更常说“in the land registry / on the cadastral map”。"]}
{"word":"cadastration","summary":{"en":"Cadastration means the official surveying and registration of land parcels for legal or tax purposes.","zh":"Cadastration 指对土地地块进行官方测绘并登记，用于法律或税务等目的。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the official surveying, mapping, and registration of land parcels (including boundaries, ownership, and value) for legal or tax purposes","zh":"地籍测量与登记；对土地地块进行官方测绘、制图并登记（包括边界、产权与价值），用于法律或税务等目的"},"examples":[{"en":"The government began a cadastration project to clarify land ownership.","zh":"政府启动了地籍登记项目，以厘清土地所有权。"},{"en":"Cadastration helps reduce boundary disputes between neighboring farms.","zh":"地籍测量与登记有助于减少相邻农场之间的边界纠纷。"}]}],"synonyms":["land registration","cadastral survey","land surveying","cadastre"],"phonetic":"/ˌkædəˈstreɪʃən/","extraExplanation":["“cadastration”来自“cadastre（地籍）”。在实际英语中，更常见的说法是“cadastral survey（地籍测量）”“cadastre/cadastral system（地籍/地籍制度）”，而“cadastration”相对偏正式、技术性更强。","地籍信息通常包含：地块编号、边界线、面积、用途、权利人/所有权、以及有时的评估价值。不同国家在数据公开程度与法律效力上差异很大。"]}
{"word":"cadastre","summary":{"en":"A cadastre is an official land register/map showing parcel boundaries, ownership, and value.","zh":"cadastre 指官方地籍登记/地籍图，记录地块边界、权属与估值。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an official register or map that records the boundaries, ownership, and value of land parcels (used for taxation and legal purposes)","zh":"（土地）地籍；地籍图/地籍簿：官方登记或地图，用来记录土地地块的边界、所有权与估值（常用于税务与法律管理）"},"examples":[{"en":"The city updated its cadastre to reflect new property boundaries.","zh":"该城市更新了地籍资料，以反映新的地产边界。"},{"en":"Surveyors used the cadastre to confirm who owned the parcel of land.","zh":"测量人员使用地籍资料来确认这块地的所有权归属。"},{"en":"Cadastre records help the government assess property taxes fairly.","zh":"地籍记录有助于政府更公平地评估房产税。"}]}],"synonyms":["land register","land registry","property register","parcel map"],"phonetic":"/kəˈdæstər/","extraExplanation":["“cadastre”多用于政府土地管理语境，尤其在欧洲、拉美等地区更常见；在日常英语中，人们更常说“land registry（不动产登记）”“property records（房产/土地档案）”。","常见区别：cadastre通常更强调“地块边界与地图化信息（parcel boundaries/map）”，而land registry更强调“产权与交易登记（legal title/transactions）”；很多国家/地区两者会相互配合或部分重叠。","词源来自法语“cadastre”，与土地测绘、征税制度相关；现代语境下也常与GIS（地理信息系统）和数字化地籍（digital cadastre）一起出现。"]}
{"word":"cadastres","summary":{"en":"“Cadastres” are official land-record systems (maps + registers) that document property boundaries and ownership; it’s the plural of “cadastre.”","zh":"“Cadastres”指地籍系统/地籍档案（地图+登记册），记录土地边界与权属；是“cadastre”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"official records and maps that show property boundaries, ownership, and land value (used for legal and tax purposes); plural of “cadastre.”","zh":"地籍档案/地籍图（记录土地边界、权属与价值，用于法律与税务等用途），“cadastre”的复数。"},"examples":[{"en":"The city updated its cadastres to reflect new property boundaries after the redevelopment.","zh":"城市更新了地籍档案，以反映改造后新的地块边界。"},{"en":"Researchers compared historical cadastres to see how farmland had been divided over time.","zh":"研究人员对比了历史地籍图，观察农田如何随时间被分割。"}]}],"synonyms":["land records","land registry (related)","property records","cadastral records","cadastral maps"],"phonetic":"/kəˈdæs.tɚ/","extraExplanation":["“cadastre”常见于法律、城市规划、测绘、房地产税等语境；在很多国家，地籍系统会与不动产登记系统（land registry）相关但不完全相同：地籍更强调“地块与边界/测绘”，登记更强调“权利与法律文件”。","词源来自法语 *cadastre*，因此在欧洲及受大陆法系影响的语境中更常见；在日常英语里，人们更常说 *land registry*、*property records* 或 *cadastral map*。"]}
{"word":"cadaver","summary":{"en":"“Cadaver” means a dead human body, especially one used in medical or scientific study.","zh":"“cadaver”指人的尸体，尤指用于医学或科学研究的遗体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a dead human body, especially one used for medical study or scientific examination","zh":"尸体；（尤指用于医学研究或科学检验的）遗体"},"examples":[{"en":"Medical students often learn anatomy by studying a cadaver.","zh":"医学生常通过解剖尸体来学习人体结构。"},{"en":"The researchers examined the cadaver to understand the cause of death.","zh":"研究人员检查遗体以了解死因。"}]}],"synonyms":["corpse","dead body","body","remains"],"phonetic":"/kəˈdævər/","extraExplanation":["“cadaver”是比较正式、偏专业的词，常见于医学、法医学、学术语境。日常口语里更常用“body”或“dead body”；新闻/警方语境也可能用“the remains（遗骸）”。","词源来自拉丁语，和“尸体、遗体”有关。由于它带有医学/法医的冷静客观语气，用在普通聊天中可能显得生硬或不够得体，建议在合适的场景使用。"]}
{"word":"cadaveric","summary":{"en":"“Cadaveric” means “related to a dead human body,” especially in medicine; less commonly, it can describe someone who looks corpse-like.","zh":"“cadaveric”意为“与人体遗体有关的”，尤用于医学语境；较少情况下可形容人“像尸体一样苍白无生气”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a dead human body (a cadaver), especially in medical study or surgery.","zh":"与尸体（尤指人体遗体）有关的；（尤用于医学学习或外科手术中的）尸体的。"},"examples":[{"en":"The students practiced basic anatomy on cadaveric tissue.","zh":"学生们在尸体组织上练习基础解剖。"},{"en":"Cadaveric organs are sometimes used for transplantation.","zh":"尸体供体器官有时用于移植。"}]},{"partOfSpeech":"adj.","definition":{"en":"Pale, stiff, or lifeless in appearance, like a corpse (less common).","zh":"（不常用）苍白僵硬、毫无生气的，像尸体一样的。"},"examples":[{"en":"He looked cadaveric after days without sleep.","zh":"几天没睡后，他看起来苍白无神。"}]}],"synonyms":["corpse-related","postmortem","mortuary"],"phonetic":"/kəˈdævərɪk/","extraExplanation":["“cadaveric”多见于正式或医学语境，如 cadaveric dissection（尸体解剖）、cadaveric donor（遗体捐献者）、cadaveric transplant（尸体供体移植）。日常描述一般用 “dead body” 或 “corpse”。","词源来自拉丁语 cadaver（尸体）。在一些文化语境中谈到遗体与捐献可能较敏感，英文里常用更委婉的表达如 “donor” 或 “the deceased”。"]}
{"word":"cadaverin","summary":{"en":"Cadaverine is a foul-smelling chemical produced during the decay of animal tissue.","zh":"Cadaverine（尸胺）是动物组织腐败分解时产生的恶臭化学物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a foul-smelling chemical (a polyamine) produced when animal tissue decays; it contributes to the odor of rotting flesh.","zh":"尸胺（腐胺的一种）：动物组织腐败分解时产生的一种有恶臭的化学物质（多胺类），会造成腐肉的气味。"},"examples":[{"en":"Scientists detected cadaverine as part of the odor released during decomposition.","zh":"科学家检测到尸胺是分解过程中释放气味的一部分。"},{"en":"The lab note mentioned cadaverine, a compound associated with decaying tissue.","zh":"实验记录提到尸胺，这是一种与组织腐败有关的化合物。"}]}],"synonyms":["cadaverine","putrefaction compound","decomposition odor compound"],"phonetic":"/kəˈdævəˌriːn/","extraExplanation":["“cadaverin”更常见的标准拼写是 **cadaverine**（尸胺）。有些语言或旧文献里可能会出现“cadaverin”这种变体拼写。","词源上与拉丁语 *cadaver*（尸体）相关，因此常见于法医学、微生物学、化学等语境。日常英语里很少用，更多是专业术语。"]}
{"word":"cadaverine","summary":{"en":"Cadaverine is a chemical formed during the decay of animal tissue and is known for its strong, unpleasant smell.","zh":"Cadaverine（尸胺）是在动物组织腐败分解时形成的化学物质，以强烈难闻的气味著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a foul-smelling chemical produced when proteins break down in decaying animal tissue; often associated with the smell of rotting flesh","zh":"一种在动物组织腐败、蛋白质分解时产生的恶臭化学物质；常与尸体腐烂气味有关"},"examples":[{"en":"As tissue decomposes, compounds like cadaverine and putrescine contribute to the strong odor.","zh":"当组织分解时，尸胺（cadaverine）和腐胺（putrescine）等化合物会造成强烈气味。"},{"en":"The lab studied cadaverine to understand the chemistry of decomposition.","zh":"实验室研究尸胺，以了解腐败分解的化学过程。"}]}],"synonyms":["pentane-1,5-diamine","1,5-diaminopentane"],"phonetic":"/kəˈdævəˌrin/","extraExplanation":["词源：cadaverine 来自拉丁语 cadaver（“尸体”），因此中文常译为“尸胺”。","学科语境：该词多见于生物化学、法医学、微生物学等领域，日常口语里很少用；写作或新闻中出现时通常带有科学或侦查背景。","相关概念：cadaverine 与 putrescine（腐胺）常并列出现，二者都属于腐败过程中产生的胺类物质，是导致“腐臭味”的重要来源之一。"]}
{"word":"cadaverize","summary":{"en":"Cadaverize means to make into a corpse (kill) or, figuratively, to make something corpse-like or lifeless; it’s very rare.","zh":"cadaverize 指“使变成尸体（杀死）”，也可比喻“使像尸体般毫无生气”；该词非常少见。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(vt.) To turn a living body into a corpse; to kill (very rare and often humorous, harsh, or overly technical).","zh":"（及物）使变成尸体；杀死（很少见，常带黑色幽默/冷硬或过度技术化的语气）。"},"examples":[{"en":"The critic joked that the slow pacing could cadaverize a viewer’s attention.","zh":"评论家开玩笑说，这种慢节奏足以把观众的注意力“弄死”。"},{"en":"The villain threatened to cadaverize anyone who betrayed him (a deliberately shocking word choice).","zh":"反派威胁要把背叛他的人“变成尸体”（刻意用一个耸动的词）。"}]},{"partOfSpeech":"vt.","definition":{"en":"(vt.) To make something look corpse-like; to deprive it of vitality (rare, figurative).","zh":"（及物）使……呈现死尸般的样子；使失去生气（少见，多为比喻）。"},"examples":[{"en":"Harsh lighting can cadaverize faces in photos.","zh":"刺眼的灯光会把照片里的人脸照得像“死尸脸”。"},{"en":"Endless bureaucracy cadaverized the team’s creativity.","zh":"无休止的官僚程序把团队的创造力“耗死”了。"}]},{"partOfSpeech":"vi.","definition":{"en":"(vi.) To become corpse-like or to die (very rare).","zh":"（不及物）变得像尸体；死亡（极少见）。"},"examples":[{"en":"After hours without sleep, he felt like his brain was cadaverizing.","zh":"连续好几个小时不睡，他感觉大脑都要“僵死”了。"}]}],"synonyms":["kill","murder","slay","deaden","drain","lifelessen"],"phonetic":"/kəˈdævəˌraɪz/","extraExplanation":["这个词来自 cadaver（尸体）+ -ize（使……化/使成为……）。在现代英语里非常不常用，更多见于夸张、黑色幽默或刻意“学术腔”的写法。","日常表达里更自然的说法通常是 kill / murder（杀死），或在比喻义上用 drain / deaden（耗尽、使麻木）。"]}
{"word":"cadaverous","summary":{"en":"Cadaverous describes someone who looks corpse-like—very pale and thin, often from illness or exhaustion.","zh":"cadaverous 用来形容人“像尸体一样”的苍白消瘦，常暗示疾病或极度疲劳。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Very pale, thin, or bony in a way that looks like a dead body; corpse-like.","zh":"（人）苍白消瘦、骨瘦如柴的；像尸体一样的。"},"examples":[{"en":"After weeks of illness, he looked cadaverous and exhausted.","zh":"病了几周后，他看起来苍白消瘦、疲惫不堪。"},{"en":"The actor wore makeup to give himself a cadaverous face for the horror film.","zh":"那位演员化了妆，让自己的脸在恐怖片里显得像尸体一样惨白。"}]}],"synonyms":["gaunt","pale","haggard","corpse-like","deathly"],"phonetic":"/kəˈdævərəs/","extraExplanation":["词源上来自拉丁语 cadaver（“尸体”），所以它带有强烈的“死亡/病态”联想。用于描写人时通常语气偏负面，暗示长期生病、极度疲劳、营养不良或精神压力过大。","与 pale（苍白）或 thin（瘦）相比，cadaverous 更形象、更文学化，也更夸张，常见于小说、哥特/恐怖题材或带批评意味的描述。"]}
{"word":"cadaverously","summary":{"en":"“Cadaverously” means “in a corpse-like, extremely pale or gaunt way,” often used in literary or dramatic descriptions.","zh":"“cadaverously”表示“像尸体一样地、极其苍白/消瘦地”，多用于文学或带戏剧性的描写。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a very thin, pale, or corpse-like way; looking extremely unhealthy or drained.","zh":"以极其消瘦、苍白或“像尸体一样”的方式；看起来非常不健康、憔悴。"},"examples":[{"en":"He smiled cadaverously under the harsh office lights.","zh":"在刺眼的办公室灯光下，他露出一种憔悴、像死一般的笑。"},{"en":"After the long illness, she looked cadaverously pale.","zh":"久病之后，她看起来苍白得近乎“尸色”。"}]}],"synonyms":["gauntly","pallidly","sickly","wanly"],"phonetic":"/kəˈdævərəsli/","extraExplanation":["“cadaverously”来自形容词“cadaverous”（像尸体的、面色灰白的），而“cadaver”指“尸体”。这个词常见于文学描写或较正式的写作，用来强调一种令人不安的憔悴感。日常口语里更常用“very pale / gaunt / sickly”。","语气与使用场景：通常带有负面或阴森的色彩，常用于描写恐怖、哥特风、悬疑氛围，或刻画人物因疲惫、疾病、压力而呈现的“死气沉沉”的状态。使用时注意避免用于对他人外貌的随意评论，以免显得不礼貌。"]}
{"word":"cadaverousness","summary":{"en":"Cadaverousness means an extremely pale, thin, corpse-like appearance.","zh":"Cadaverousness 指极度苍白消瘦、带有“像尸体一样”感觉的外貌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of looking very pale, thin, and unhealthy, like a corpse.","zh":"（外表）苍白、消瘦、显得不健康，像尸体一样的样子。"},"examples":[{"en":"After weeks of illness, his cadaverousness worried his friends.","zh":"生病几周后，他那种苍白消瘦的样子让朋友们很担心。"},{"en":"The actor used makeup to exaggerate the character’s cadaverousness.","zh":"演员用化妆来夸张角色的苍白枯瘦感。"}]}],"synonyms":["gauntness","pallor","sickliness","wan appearance"],"phonetic":"/kəˈdævərəsnəs/","extraExplanation":["“cadaverousness”来自形容词“cadaverous”（像尸体的、惨白消瘦的），而“cadaver”指“尸体”。这个词常用于文学描写或较正式的语境，强调一种让人不安的病态外观。","语气上比“paleness（苍白）”更强烈，也更带有阴森、死亡联想；在日常口语中更常说“looking very pale/gaunt/sickly”。"]}
{"word":"cadavers","summary":{"en":"“Cadavers” is the plural of “cadaver,” meaning dead human bodies, especially used in medical or forensic study.","zh":"“cadavers”是“cadaver”的复数，指尸体/遗体，尤指用于医学或法医学研究的遗体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Dead human bodies, especially when used for scientific study (for example, in medical school or forensic investigation).","zh":"（尤指用于科学研究的）尸体、遗体（如医学院解剖或法医学调查中使用）。"},"examples":[{"en":"Medical students learn anatomy by studying cadavers.","zh":"医学生通过研究遗体来学习解剖学。"},{"en":"The forensic team examined the cadaver to determine the cause of death.","zh":"法医团队检查了尸体以确定死因。"}]}],"synonyms":["dead bodies","corpses","remains","the deceased"],"phonetic":"/kəˈdævərz/","extraExplanation":["“cadaver”在日常对话中较正式、偏专业，常见于医学（anatomy lab 解剖实验室）、法医学（forensics）、法律或新闻报道。普通口语里人们更常说“a dead body”或“a body”，对逝者更委婉时会说“the deceased（死者）”。","复数“cadavers”读写与单数不同：cadaver（单数）→ cadavers（复数）。词源来自拉丁语，核心含义是“尸体/遗体”。"]}
{"word":"cadbait","summary":{"en":"“cadbait” isn’t a standard English word; it’s likely a typo or niche term.","zh":"“cadbait”不是标准英语词汇；更可能是拼写错误或小众用法。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a very niche/brand-specific term.","zh":"不是标准英语词汇。可能是拼写错误，或非常小众/品牌相关的用法。"},"examples":[{"en":"I couldn’t find “cadbait” in major dictionaries—could you share the sentence where you saw it?","zh":"在主流词典里找不到“cadbait”——你能把看到它的句子发我吗？"},{"en":"If you meant “bait,” the common word is “bait,” not “cadbait.”","zh":"如果你想表达“诱饵/引诱”，常用词是“bait”，不是“cadbait”。"}]}],"synonyms":["bait","clickbait"],"phonetic":"ˈkæd.beɪt","extraExplanation":["“cadbait”更像是把两个部分拼在一起的写法（cad + bait），但英语里没有固定、普遍认可的词条。","你可能想写的是：\n1) bait（诱饵；引诱）\n2) clickbait（标题党/点击诱饵）\n3) catbait（字面“用来引猫的饵”，不常见）\n4) CAD（Computer-Aided Design，计算机辅助设计；常见于工程/设计语境）","如果你把它出现的上下文（整句话/文章主题/领域，比如游戏、工程、社媒）发来，我可以更准确判断它的意思或给出更自然的替代表达。"]}
{"word":"cadbit","summary":{"en":"“cadbit” is not a standard English word; it’s probably a misspelling. Share the context and I’ll identify the intended word.","zh":"“cadbit” 不是标准英语单词，可能是拼写错误。把上下文发来，我可以帮你确定原本想表达的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“cadbit” is not a standard English word. It is likely a misspelling or a mistaken reading of another word (for example, “habit” or “cadet,” depending on context).","zh":"“cadbit” 不是标准英语单词；更可能是拼写错误或误读（例如在不同语境下可能想写 “habit（习惯）” 或 “cadet（军校学员）” 等）。"},"examples":[{"en":"I can’t find “cadbit” in a dictionary—did you mean “habit”?","zh":"我在词典里找不到 “cadbit”——你是不是想写 “habit（习惯）”？"},{"en":"If you share the sentence where you saw “cadbit,” I can help identify the correct word.","zh":"如果你把看到 “cadbit” 的整句话发给我，我可以帮你判断正确的词。"}]}],"phonetic":"/ˈkæd.bɪt/","extraExplanation":["我目前无法给出 “cadbit” 的准确释义，因为它不属于常见英语词汇。最有效的方法是：把它出现的句子/段落发来，或告诉我是从哪里看到的（书、网页、图片、字幕等），我就能根据上下文推断你真正需要的单词。"]}
{"word":"cadbote","summary":{"en":"“cadbote” isn’t a standard English word; it’s likely a misspelling (possibly “cabotage” or “catboat”).","zh":"“cadbote”不是标准英语单词；很可能是拼写错误（可能是“cabotage”或“catboat”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a name; common nearby words include “cabotage” (shipping/trade between ports in the same country) or “catboat” (a type of sailboat).","zh":"不是标准英语单词。它可能是拼写错误或人名/地名；较接近的词包括 “cabotage”（国内港口间的沿海/内河运输或贸易）或 “catboat”（一种帆船）。"},"examples":[{"en":"I couldn’t find “cadbote” in a dictionary—did you mean “cabotage”?","zh":"我在词典里查不到 “cadbote”——你是不是想写 “cabotage”？"},{"en":"Please check the spelling of “cadbote” in your notes and tell me the sentence it appears in.","zh":"请检查你笔记里 “cadbote” 的拼写，并告诉我它出现在什么句子里。"}]}],"phonetic":"/ˈkæd.boʊt/","extraExplanation":["“cadbote”很可能是误拼。最接近且常见的词之一是 **cabotage**（/ˈkæbətɑːʒ/），多用于航运与法律语境，指“一国境内港口之间的运输/贸易”（很多国家对外资公司从事 cabotage 有限制）。","如果你能提供包含该词的原句、出处（书名/网页/截图）或你想表达的中文意思，我可以更准确地判断它应该是哪一个词。"]}
{"word":"CADD","summary":{"en":"CADD usually means Computer-Aided Design and Drafting—creating designs and technical drawings with software.","zh":"CADD通常指“计算机辅助设计与制图”，即用软件完成设计与技术制图。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Computer-Aided Design and Drafting: using computer software to create technical drawings and design plans (often in engineering, architecture, and manufacturing).","zh":"计算机辅助设计与制图：用电脑软件制作技术图纸和设计方案（常用于工程、建筑、制造业）。"},"examples":[{"en":"She studied CADD to prepare for a job in architecture.","zh":"她学习了CADD，为从事建筑相关工作做准备。"},{"en":"The company needs a technician with CADD skills.","zh":"公司需要一名具备CADD技能的技术员。"},{"en":"CADD software helps engineers draft accurate blueprints.","zh":"CADD软件帮助工程师绘制精确的蓝图。"}]},{"partOfSpeech":"n.","definition":{"en":"A course, program, or department focused on Computer-Aided Design and Drafting.","zh":"（指）计算机辅助设计与制图相关的课程、项目或部门。"},"examples":[{"en":"I’m taking CADD this semester.","zh":"我这学期在学CADD课程。"},{"en":"Ask the CADD department for the file format they prefer.","zh":"去问一下CADD部门他们更偏好的文件格式。"}]}],"synonyms":["CAD","computer-aided design","drafting"],"phonetic":"/kæd/","extraExplanation":["“CADD”通常是大写的缩写，更常见的写法也有“CAD”（Computer-Aided Design，计算机辅助设计）。有些学校或岗位会用“CADD”强调既包含设计（design）也包含制图（drafting）。口语中也有人直接说“CAD”。"]}
{"word":"Caddaric","summary":{"en":"“Cadaveric” means related to a dead human body, especially in medical/scientific contexts.","zh":"“Cadaveric”表示“与尸体有关的”，多用于医学/科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely intended: “cadaveric”) relating to a dead human body (a cadaver), especially in medical or scientific study.","zh":"（很可能是想写：cadaveric）与尸体有关的；（尤指）医学或科学研究中用于解剖/研究尸体的。"},"examples":[{"en":"Medical students practice anatomy on cadaveric specimens.","zh":"医学生会用尸体标本来练习解剖学。"},{"en":"The report described cadaveric tissue used for research.","zh":"报告描述了用于研究的尸体组织。"}]}],"synonyms":["dead-body (attributive)","corpse-related","postmortem (related)"],"phonetic":"/kəˈdævərɪk/","extraExplanation":["你输入的“Caddaric”不是常见英语单词拼写；最接近、且在真实英语中常用的词是 **cadaveric**。","**cadaveric** 多见于医学、法医学、生物学等正式语境；日常生活里谈到“尸体相关”通常会说 **dead body**（较中性）或 **corpse**（更直接、偏冷硬）。","在文学或影视中，cadaveric 有时也会被用作形容词，带有“像尸体一样苍白/阴森”的气氛，但这种用法不如医学语境常见。"]}
{"word":"cadded","summary":{"en":"“Cadded” is rare; it usually means “behaved like a cad” or is a misspelling of “caddied” in golf.","zh":"“cadded”很少见：通常指“像不绅士/无赖那样行事”，或是高尔夫语境里“caddied”的误拼。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare) Past tense/past participle of “cad” meaning to behave in a rude, selfish, or dishonorable way (especially toward women).","zh":"（罕见）“cad”的过去式/过去分词，指举止粗鲁、自私或不体面（尤指对女性不尊重）。"},"examples":[{"en":"He apologized for how he had cadded around at the party.","zh":"他为自己在派对上那种不体面的举止道了歉。"},{"en":"In the novel, the hero admits he once cadded and hurt someone he cared about.","zh":"在小说里，男主承认自己曾经很不厚道，伤害了在乎的人。"}]},{"partOfSpeech":"other","definition":{"en":"(Nonstandard/typo) Sometimes seen as a misspelling of “caddied” (from “caddie”: to carry a golfer’s clubs).","zh":"（非标准/可能是拼写错误）有时被当作“caddied”的误拼（“caddie”：给高尔夫球手背球杆）。"},"examples":[{"en":"He caddied for his uncle all summer.","zh":"他整个夏天都在给叔叔当球童。"},{"en":"If you mean golf, the usual spelling is “caddied,” not “cadded.”","zh":"如果你指的是高尔夫，常见拼法是“caddied”，不是“cadded”。"}]}],"synonyms":["behaved rudely","acted dishonorably","behaved like a cad"],"phonetic":"/ˈkædɪd/","extraExplanation":["“cadded”在现代英语里非常少见；如果你是在阅读旧文学或想表达“像个无赖/不绅士那样行事”，更常见的说法是：behaved like a cad / acted like a cad。","如果你的语境是高尔夫，“caddied”来自名词/动词 caddie（球童/当球童），这是最常见、最标准的拼写。你也可以把原句发我，我能帮你判断应选哪个意思。"]}
{"word":"caddesse","summary":{"en":"“Caddesse” is not a standard English word; it’s probably a misspelling (often of “caddis” or “caddie”).","zh":"“caddesse”不是标准英语词，通常是拼写错误（常见是想写“caddis”或“caddie”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a rare proper name. Common nearby spellings include “caddis” (an insect) or “caddie” (a golf bag carrier).","zh":"不是标准英语单词，可能是拼写错误或少见的专有名词。常见的相近拼写包括“caddis”（石蛾，一种昆虫）或“caddie”（高尔夫球童/球包搬运者）。"},"examples":[{"en":"I couldn’t find “caddesse” in a standard dictionary—did you mean “caddis” or “caddie”?","zh":"我在常见词典里找不到“caddesse”，你想写的是“caddis”还是“caddie”吗？"},{"en":"If you meant “caddis,” it often appears in phrases like “caddisfly larva.”","zh":"如果你指的是“caddis”，它常出现在“caddisfly larva（石蛾幼虫）”这类表达中。"}]}],"phonetic":"/ˌkædˈdɛs/","extraExplanation":["你可以告诉我“caddesse”出现的句子/上下文（例如一整句话、书名、游戏名、聊天内容）吗？有了上下文我才能更准确判断你想表达的词。","如果你想查的是“caddis”：它指“石蛾（caddisfly）”或与其相关的事物（尤其在钓鱼领域，常见“caddis”仿生飞蝇钩）。如果你想查的是“caddie”：在高尔夫里指“球童”，也可指“把球具装进包里并帮助球员的人”。"]}
{"word":"caddice","summary":{"en":"Caddice is a less common spelling of caddis: a caddisfly or its case-building aquatic larva.","zh":"caddice 是 caddis 的较少见拼写：指石蛾或其会“造壳”的水生幼虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a caddisfly (or its larva), especially the larva that lives in water and often builds a protective case from sand, small stones, or plant pieces.","zh":"石蛾（或其幼虫）；尤指生活在水中的石蛾幼虫，常用沙粒、小石子或植物碎片做成保护性的“虫壳”。"},"examples":[{"en":"In the stream, the caddice larvae built little cases from bits of gravel.","zh":"在小溪里，石蛾幼虫用小碎石做成小小的虫壳。"},{"en":"Fly fishers often imitate caddice insects to attract trout.","zh":"飞蝇钓爱好者常用仿石蛾的假饵来吸引鳟鱼。"}]}],"synonyms":["caddis","caddisfly"],"phonetic":"/ˈkædɪs/","extraExplanation":["“caddice”是较旧或较少见的拼写；现代更常见的是“caddis”。在钓鱼语境里常见短语有“caddisfly（石蛾成虫）”与“caddis larva（石蛾幼虫）”，因为它们是许多淡水鱼的重要食物来源。"]}
{"word":"caddiced","summary":{"en":"“Caddiced” is a very rare, old-fashioned adjective meaning decorated with coarse ribbon/tape (caddice/caddis).","zh":"“caddiced”是非常少见的古义形容词，表示“用粗织带/饰带（caddice/caddis）装饰的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Very rare/archaic) Made of or decorated with caddice/caddis (a coarse ribbon or tape, often used as trimming in older clothing).","zh":"（非常少见/古义）由“caddice/caddis”（一种粗质的织带/缎带，旧时常用于衣物镶边装饰）制成的；用这种织带装饰的。"},"examples":[{"en":"In old texts, you may see “caddiced” describing clothes trimmed with coarse ribbon.","zh":"在一些旧文本里，你可能会看到“caddiced”用来形容衣服上镶了粗织带的装饰。"},{"en":"She wore a caddiced hood, plain but sturdy.","zh":"她戴着一顶用粗织带装饰的兜帽，朴素但结实。"}]}],"synonyms":["trimmed","decorated","ornamented"],"phonetic":"ˈkædɪst","extraExplanation":["“caddiced”几乎不用于现代英语，更常见的基础词是 caddice / caddis（指旧时的一种粗织带/毛织带）。它也容易与 caddis fly（石蛾/石蛾幼虫，水生昆虫）混淆：后者是常见的现代用法，而“织带”这个义项多见于旧文学或历史服饰语境。","如果你本来想查的是 addicted（上瘾的/沉迷的），拼写不同：addicted 不是 caddiced。你可以告诉我你的句子，我能帮你确认正确词。"]}
{"word":"caddicefly","summary":{"en":"A caddicefly (more commonly “caddisfly”) is a freshwater insect whose larva builds a protective case; it also names an artificial fishing fly that imitates it.","zh":"caddicefly（更常见写法为 caddisfly）指石蛾：淡水昆虫，幼虫会筑壳；也可指仿石蛾的钓鱼假饵。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An insect (a caddisfly) whose larva lives in freshwater and often builds a protective “case” from sand, small stones, or plant bits; the adult looks like a small moth.","zh":"石蛾（石蛾目昆虫）；其幼虫生活在淡水中，常用沙粒、小石子或植物碎片做成保护性的“巢/壳”，成虫外形有点像小飞蛾。"},"examples":[{"en":"Caddicefly larvae are a sign of clean, healthy streams.","zh":"石蛾幼虫常被视为溪流清洁、生态健康的指标。"},{"en":"The scientist studied how the caddicefly builds its case underwater.","zh":"科学家研究石蛾幼虫如何在水下建造自己的“巢/壳”。"}]},{"partOfSpeech":"n.","definition":{"en":"In fishing, a type of artificial fly made to imitate a caddisfly (especially the adult) to attract trout and other fish.","zh":"（钓鱼用语）仿石蛾的假饵（常仿成虫形态），用来诱钓鳟鱼等鱼类。"},"examples":[{"en":"Try a caddicefly pattern near sunset when the insects are active.","zh":"傍晚昆虫活跃时，可以试试石蛾仿生假饵。"},{"en":"He tied on a caddicefly and caught two trout.","zh":"他系上一只石蛾假饵，钓到了两条鳟鱼。"}]}],"synonyms":["caddisfly","sedge (BrE, in fly-fishing)","Trichoptera (scientific order name)"],"phonetic":"/ˈkædɪsˌflaɪ/","extraExplanation":["“caddice”指石蛾幼虫用碎石、砂粒等做成的“壳/巢”（case），所以caddicefly常与“case-building”（筑壳）联系在一起。","常见拼写：caddisfly（更常用）；caddicefly是较少见但可理解的变体。"]}
{"word":"caddices","summary":{"en":"Caddices is the plural of caddis, a waterside insect; it can also mean caddis larvae and the protective cases they build.","zh":"Caddices 是 caddis 的复数，指水边的石蛾；也可指石蛾幼虫及其制作的虫袋/外壳。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of caddis: a small insect (like a moth) that lives near water; its larvae live in streams and often build protective cases from sand, leaves, or small sticks.","zh":"caddis 的复数：一种常见于水边的小型昆虫（外形有点像蛾）；其幼虫生活在溪流等水域中，常用沙粒、树叶或小树枝做成保护外壳（虫袋）。"},"examples":[{"en":"In spring, caddices hatch near the river, attracting many fish.","zh":"春天时，河边会有许多石蛾（caddices）孵化，吸引很多鱼。"},{"en":"The biologist found caddices in clean, fast-moving streams.","zh":"生物学家在干净、流速快的溪流里发现了石蛾。"}]},{"partOfSpeech":"n.","definition":{"en":"The larvae of caddisflies, especially when referring to the case (the little “tube/house”) they build and carry.","zh":"石蛾的幼虫（石蛾幼虫），也常指它们建造并随身携带的“虫袋/小壳”（像小管子或小房子）。"},"examples":[{"en":"Look closely: the caddices have built cases from tiny stones.","zh":"仔细看：这些石蛾幼虫用小石子做出了虫袋。"},{"en":"We collected a few caddices to study how they build their cases.","zh":"我们采集了几只石蛾幼虫，研究它们如何制作虫袋。"}]}],"synonyms":["caddisflies","caddis (plural form)","Trichoptera (scientific group name)"],"phonetic":"/ˈkædɪs/","extraExplanation":["“caddices”在现代英语里最常见的对应单数是“caddis”。有时也会看到较少见的拼写“caddice”。在钓鱼圈（fly fishing）中，caddis/caddices 也是很常见的昆虫名，用来指模仿这种昆虫的拟饵（caddis fly pattern）。"]}
{"word":"caddie","summary":{"en":"A caddie is a person who carries a golfer’s clubs and helps during a round; it can also mean to do that job.","zh":"caddie 指高尔夫球童，也可作动词表示“当球童、为球手服务”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who carries a golfer’s clubs and gives help or advice during a round of golf","zh":"（高尔夫）球童；在比赛中帮球手背球包并提供协助或建议的人"},"examples":[{"en":"He hired a caddie to carry his bag and read the greens.","zh":"他雇了一个球童来背球包并帮他判断果岭的坡度。"},{"en":"The caddie suggested using a different club because of the wind.","zh":"因为有风，球童建议他换一支球杆。"}]},{"partOfSpeech":"v.","definition":{"en":"to work as a caddie for a golfer","zh":"当球童；为高尔夫球手背球包并提供协助"},"examples":[{"en":"She caddied at the local golf course during the summer.","zh":"她夏天在当地高尔夫球场当球童。"},{"en":"He caddied for his older brother in the charity tournament.","zh":"他在慈善赛中给哥哥当球童。"}]}],"synonyms":["golf caddie"],"phonetic":"/ˈkædi/","extraExplanation":["“caddie”主要用于高尔夫语境。球童不仅搬运球杆，有经验的球童还会提供球场策略、距离判断和果岭读线等建议，因此在职业比赛中往往是重要的“场上伙伴”。","拼写上常见两种：caddie（更常见）与 caddy（也可见，尤其在美式用法里）。","词源一般认为与法语/古法语有关，最早指“随从、信使”等，后来在苏格兰的高尔夫文化中固定为“球童”。"]}
{"word":"caddied","summary":{"en":"“Caddied” usually means “worked as a golf caddie” (carried clubs and helped a golfer). It can also mean “helped like an assistant,” or (less commonly) “put into a caddy/container.”","zh":"“caddied”通常指“当过高尔夫球童”（背球包并协助球手）；也可指“像助手一样帮忙”，或（较少见）“放入收纳盒/托架里”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of caddie) to work as a caddie for a golfer, carrying clubs and giving help or advice during a round.","zh":"（caddie 的过去式/过去分词）在高尔夫球场当球童，为球手背球包、递球杆并提供协助或建议。"},"examples":[{"en":"He caddied for his uncle during the club championship.","zh":"他在俱乐部锦标赛期间给叔叔当球童。"},{"en":"She caddied all summer to earn money for school.","zh":"她整个夏天都当球童赚钱交学费。"}]},{"partOfSpeech":"v.","definition":{"en":"(less common) to assist someone closely, like an aide or helper, especially in a demanding situation.","zh":"（不太常见）像助手一样贴身协助某人，尤其在任务繁重的场合。"},"examples":[{"en":"He caddied for the photographer, carrying gear and setting up lights.","zh":"他给摄影师打下手，帮忙搬器材、架灯。"}]},{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of caddy) to put or store something in a small container or holder (a caddy).","zh":"（caddy 的过去式/过去分词）把东西放进小收纳盒/支架（caddy）里收纳。"},"examples":[{"en":"The supplies were caddied in a small tray for easy access.","zh":"这些用品被放进一个小托盘里，方便取用。"}]}],"synonyms":["carried","assisted","helped","aided"],"phonetic":"/ˈkædid/","extraExplanation":["“caddied”最常见来自动词 caddie（当球童）。球童文化在英美高尔夫中很常见：除了背包，还可能负责看球路、读果岭（green reading）、递球杆、保持节奏等。","拼写上要注意：动词 caddie 变过去式常写作 caddied（把 -ie 变成 -y 再加 -ed），如：tie → tied，die → died（但 die 是直接加 -d）。"]}
{"word":"caddies","summary":{"en":"“Caddies” usually means either golf caddies (people who help golfers) or storage caddies (small organizing containers).","zh":"“caddies”通常指高尔夫球童（帮助球手的人）或收纳盒/小容器（用来整理存放物品）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of caddy: a person who carries a golfer’s clubs and gives advice during a round of golf","zh":"caddy 的复数：高尔夫球童；为球手背球杆并提供建议的人"},"examples":[{"en":"Two caddies walked ahead, reading the slope of the green.","zh":"两名球童走在前面，观察果岭的坡度。"},{"en":"In some tournaments, caddies help with strategy as well as carrying clubs.","zh":"在一些比赛中，球童不仅背球杆，也会协助制定策略。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of caddy: a small container used to store and organize things (often tea, sugar, or small items)","zh":"caddy 的复数：收纳盒；用来存放和整理物品的小容器（常见如茶叶盒、糖罐或小物件收纳盒）"},"examples":[{"en":"She keeps tea caddies on the top shelf.","zh":"她把茶叶盒放在最上层的架子上。"},{"en":"The office has desk caddies for pens and sticky notes.","zh":"办公室有桌面收纳盒，用来放笔和便利贴。"}]},{"partOfSpeech":"v.","definition":{"en":"third-person singular of caddy: to work as a golfer’s caddie (to carry clubs and assist)","zh":"caddy 的第三人称单数：当球童；为球手背球杆并协助比赛"},"examples":[{"en":"He caddies on weekends to earn extra money.","zh":"他周末当球童赚点外快。"}]}],"synonyms":["golf assistant","club carrier","attendant","helper","organizer","container","holder"],"phonetic":"ˈkædi","extraExplanation":["“caddie/caddy”在高尔夫语境里更常拼作 caddie；表示“收纳盒/小容器”时常拼作 caddy。两者在现代英语中常被视为可互换拼写，但场景会影响更自然的写法。","“tea caddy（茶叶盒）”是较传统的用法，源于早期茶叶昂贵、需要专门容器保存与上锁的历史。"]}
{"word":"caddiing","summary":{"en":"“Caddying” means working as a golf caddie—carrying clubs and helping the golfer.","zh":"“caddying”指在高尔夫中当球童：背球包并协助球员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Golf) the job of carrying a golfer’s bag and giving help or advice during a round.","zh":"（高尔夫）当球童：帮球员背球包，并在一轮比赛中提供协助或建议。"},"examples":[{"en":"He spent the summer caddying at a local golf club.","zh":"他整个夏天都在当地高尔夫俱乐部当球童。"},{"en":"Caddying taught her how to read greens and stay calm under pressure.","zh":"当球童让她学会了如何判断果岭线路，也学会了在压力下保持冷静。"}]},{"partOfSpeech":"v.","definition":{"en":"to work as a caddie for a golfer.","zh":"当球童；为高尔夫球员背包并提供协助。"},"examples":[{"en":"I caddied for my uncle in a charity tournament.","zh":"我在一场慈善锦标赛里给叔叔当球童。"},{"en":"She caddied on weekends to earn extra money.","zh":"她周末当球童来赚点外快。"}]}],"synonyms":["caddieing","working as a caddie"],"phonetic":"/ˈkædiɪŋ/","extraExplanation":["你输入的“caddiing”更常见的拼写是 **caddying**（双 d + y）。它来自 **caddie**（球童）。在高尔夫语境里非常常见：职业比赛中球童不仅背包，还会给距离、选杆、风向等建议。"]}
{"word":"cadding","summary":{"en":"“Cadding” is most commonly a misspelling of “caddying,” meaning working as a golf caddie. A rare meaning is behaving like a rude, dishonorable man (“a cad”).","zh":"“cadding”最常见是“caddying”的误拼，意思是当高尔夫球童；少见含义是像“cad（轻薄无礼的人）”那样行事。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often spelled “caddying”) the activity of carrying a golfer’s clubs and helping them during a round (e.g., giving advice, finding balls).","zh":"（常写作“caddying”）当球童：为高尔夫球手背球包并在打球过程中提供帮助（如给建议、找球）。"},"examples":[{"en":"He earned extra money by caddying at the local golf course on weekends.","zh":"他周末在当地高尔夫球场当球童赚点外快。"},{"en":"Caddying taught her how to read greens and manage pressure.","zh":"当球童让她学会了如何读果岭、如何应对压力。"}]},{"partOfSpeech":"v.","definition":{"en":"(often spelled “caddying”) to work as a caddie for a golfer.","zh":"（常写作“caddying”）给（高尔夫球手）当球童；做球童工作。"},"examples":[{"en":"I’m caddying for my uncle in the tournament tomorrow.","zh":"我明天要在比赛里给我叔叔当球童。"},{"en":"She started caddying when she was sixteen.","zh":"她十六岁就开始当球童了。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) behaving like a “cad” (someone who is rude or dishonorable), especially toward women.","zh":"（罕见）像“cad”（粗鲁、缺德的男人）那样行事，尤指对女性不尊重。"},"examples":[{"en":"His cadding behavior ruined his reputation.","zh":"他那种轻薄无礼的行为毁了名声。"}]}],"synonyms":["caddying","working as a caddie"],"phonetic":"/ˈkædiɪŋ/","extraExplanation":["你输入的“cadding”在高尔夫语境里更常见的拼写是“caddying”（来自名词 caddie）。很多人会把它简化或拼错成 cadding。","在英美文化中，球童（caddie）不仅是“背包的人”，在比赛中也可能提供策略建议；在职业赛里，优秀球童常被视为球员团队的重要成员。"]}
{"word":"caddis","summary":{"en":"Caddis most commonly refers to a caddisfly—especially its freshwater larva that builds a protective case. It can also mean an old-fashioned clothing trim (a narrow braid/tape).","zh":"caddis 最常指石蛾（尤指会在淡水中用沙石枝叶做“虫袋”的幼虫）；也可指（较旧用法）衣物镶边的饰带。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small insect (a caddisfly), especially the larva that lives in freshwater and often builds a protective case from sand, sticks, or leaves","zh":"石蛾；（尤指）石蛾幼虫（生活在淡水中，常用沙粒、树枝或叶片做成保护性的“虫袋/外壳”）"},"examples":[{"en":"We found caddis larvae in the stream, each one inside a little case made of sand.","zh":"我们在小溪里发现了石蛾幼虫，每一只都躲在用沙粒做成的小外壳里。"},{"en":"Trout often feed on caddis, so anglers use caddisfly patterns when fishing.","zh":"鳟鱼常吃石蛾，所以钓鱼的人常用仿石蛾的假饵。"}]},{"partOfSpeech":"n.","definition":{"en":"a narrow woven tape or braid used for trimming clothes (old-fashioned usage)","zh":"（旧用法）饰带；衣物镶边用的窄织带/编带"},"examples":[{"en":"The costume was edged with red caddis along the sleeves.","zh":"那件戏服的袖口用红色饰带做了镶边。"}]}],"synonyms":["caddisfly","caddis larva","case-bearing larva"],"phonetic":"/ˈkædɪs/","extraExplanation":["在英语里更常见的说法是 caddisfly（石蛾，成虫）与 caddis larva/larvae（石蛾幼虫）。在飞蝇钓（fly fishing）文化中，caddis（或 caddisfly hatch）常用来指“石蛾大量羽化的时段”，与钓鱼用的仿生假饵（fly pattern）密切相关。","“饰带”这一义项属于较老的服装用语，现代日常英语里更常用 trim、braid、tape 等词来表达。"]}
{"word":"caddised","summary":{"en":"“Caddised” is a rare word meaning either decorated with caddis braid (historical clothing term) or, more rarely, associated with caddisfly cases; it can also be the past form of the verb “to caddis.”","zh":"“caddised”较少见：可指（旧时）用caddis饰带镶边装饰过的；也可更罕见地指与石蛾幼虫虫鞘相关/像虫鞘的；还可作罕见动词to caddis的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(historical) Trimmed or decorated with caddis (a narrow worsted braid or tape used in clothing).","zh":"（历史用法）用“caddis”（一种窄的精纺毛织饰带/织带）镶边或装饰过的。"},"examples":[{"en":"The bodice was caddised along the seams with a darker braid.","zh":"上衣的缝线处用更深色的饰带做了镶边装饰。"},{"en":"In old descriptions of dress, “caddised” often means edged with a woven tape.","zh":"在旧时的服饰描写里，“caddised”常指用织带收边。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) Covered with, resembling, or associated with caddisfly cases (the small protective tubes made by caddisfly larvae).","zh":"（罕见）被石蛾（caddisfly）幼虫的“虫鞘/小管状外壳”覆盖的；像虫鞘的；与之相关的。"},"examples":[{"en":"The stones in the stream looked caddised, speckled with tiny larval cases.","zh":"溪流里的石头看起来像被虫鞘点缀着，布满细小的幼虫外壳。"},{"en":"Fly-fishers may describe a hook as caddised when it imitates a caddis case.","zh":"飞蝇钓爱好者有时会说鱼钩“caddised”，表示它模仿了石蛾虫鞘的样子。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of the rare verb “to caddis”: to trim with caddis braid or tape.","zh":"罕见动词“to caddis”的过去式/过去分词：用caddis饰带镶边或装饰。"},"examples":[{"en":"She caddised the cuffs to make the coat look smarter.","zh":"她给袖口镶上饰带，让外套看起来更利落。"}]}],"synonyms":["trimmed","edged","ornamented"],"phonetic":"/ˈkædɪst/","extraExplanation":["“caddis”在现代最常见的意思是“石蛾/石蛾幼虫”（水生昆虫），在飞蝇钓语境里尤其常见；而“用caddis饰带装饰衣物”的意思多见于较旧的服装/纺织描写。","拼写提示：更常见的基础词是“caddis”（名词），而“caddised”属于派生/较少见形式，阅读旧文本或特定爱好（如飞蝇钓、古装服饰）时更容易遇到。"]}
{"word":"caddises","summary":{"en":"Caddises = plural of caddis: caddisflies (or their freshwater larvae that build cases).","zh":"caddises 是 caddis 的复数：指石蛾（或其在淡水中会“筑壳”的幼虫）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of caddis: small insects (caddisflies) whose larvae live in freshwater and often build protective cases from sand, leaves, or small sticks.","zh":"caddis 的复数：石蛾（石蛾目）等小型昆虫；其幼虫生活在淡水中，常用沙粒、叶片或小树枝等做成保护性的“虫壳”。"},"examples":[{"en":"In summer, caddises can be seen flying near rivers at dusk.","zh":"夏天黄昏时，河边常能看到许多石蛾（caddises）飞来飞去。"},{"en":"The stream had lots of caddises, which is often a good sign for trout fishing.","zh":"这条小溪里有很多石蛾（caddises），这通常是鳟鱼资源不错的迹象。"}]}],"synonyms":["caddisflies","caddis fly (plural: caddis flies)"],"phonetic":"/ˈkædɪs/","extraExplanation":["“caddis”更常见的用法是指“caddisfly（成虫）”或“caddis larva（幼虫）”。在钓鱼语境里，caddis/caddises 也常用来指模仿石蛾的“拟饵/假蝇”（caddis pattern），因为石蛾是很多鱼类的重要食物来源。"]}
{"word":"caddisflies","summary":{"en":"Caddisflies are insects whose larvae live in freshwater and often build protective cases; they’re common near clean streams and are important in fly fishing.","zh":"石蛾是一类昆虫，幼虫生活在淡水中并常筑壳；常见于较洁净的溪流，也常被飞钓用来仿生。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Aquatic insects (plural of caddisfly). Caddisflies are small moth-like insects; their larvae live in freshwater and often build protective “cases” from sand, twigs, or leaves.","zh":"石蛾（caddisfly 的复数）。石蛾是一类外形有点像小飞蛾的昆虫；其幼虫生活在淡水中，常用沙粒、树枝或落叶等材料做“虫壳/巢壳”来保护自己。"},"examples":[{"en":"Caddisflies are common near clean rivers and streams.","zh":"在干净的河流和溪流附近，石蛾很常见。"},{"en":"The larvae of caddisflies build cases out of tiny stones.","zh":"石蛾的幼虫会用小石子搭建外壳。"},{"en":"Trout often feed on caddisflies, so anglers imitate them with flies.","zh":"鳟鱼常以石蛾为食，所以钓鱼者会用仿生假蝇来模仿它们。"}]}],"synonyms":["caddisfly (singular)","Trichoptera (scientific order)"],"phonetic":"ˈkædɪsˌflaɪ","extraExplanation":["“caddisfly”在北美与飞钓（fly fishing）文化关系很密切：很多“假蝇”饵的造型会模仿石蛾（尤其是成虫或幼虫），因为它们是鳟鱼等鱼类的重要食物来源。","石蛾幼虫对水质较敏感，因此在生态与水质监测中常被当作“指示生物”（出现较多通常意味着水体较干净、含氧较高）。"]}
{"word":"caddisfly","summary":{"en":"A caddisfly is an insect whose water-dwelling larvae often build protective cases; it’s common near rivers and important in fishing and freshwater ecosystems.","zh":"caddisfly（石蛾）是一种昆虫，幼虫生活在淡水中并常筑“壳”自护；常见于河溪附近，也与钓鱼和淡水生态密切相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small insect whose larvae live in fresh water and often build protective cases from sand, leaves, or small sticks; the adult looks somewhat like a small moth","zh":"石蛾；石蛾类昆虫（幼虫生活在淡水中，常用沙粒、树叶或小枝做成“壳”保护自己；成虫外形有点像小蛾子）"},"examples":[{"en":"Caddisfly larvae build little cases from sand and plant bits to hide in.","zh":"石蛾幼虫会用沙粒和植物碎屑做成小壳，躲在里面。"},{"en":"Fly fishers often choose caddisfly patterns because trout eat them.","zh":"飞蝇钓爱好者常选用“石蛾”仿生假饵，因为鳟鱼会吃它们。"}]}],"synonyms":["caddis fly","sedge fly"],"phonetic":"/ˈkædɪsˌflaɪ/","extraExplanation":["“caddis”这个词在历史上也指一种用于装饰的布料或带子，据说因为石蛾幼虫会把各种材料拼贴成“外壳”，让人联想到“拼接、装饰”的感觉，因此昆虫得名。","在生态学里，石蛾幼虫常被用作水质指标：很多种类对污染很敏感，所以在清洁溪流里更常见。"]}
{"word":"caddish","summary":{"en":"Caddish means rudely disrespectful—especially toward women—or more generally impolite and dishonorable.","zh":"caddish 指（尤指对女性）轻薄无礼、不正派；也可泛指没礼貌、缺德、失礼。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Rudely disrespectful toward women; behaving like a “cad” (a man who acts dishonorably, especially in romance).","zh":"（尤指对女性）粗鲁无礼、轻薄无耻的；像“cad”（在感情或道德上不正派的男人）的行为。"},"examples":[{"en":"He made a few caddish comments about her appearance, and everyone felt uncomfortable.","zh":"他对她的外表说了几句轻薄无礼的话，让大家都很尴尬。"},{"en":"She broke up with him because of his caddish behavior.","zh":"她因为他那种不正派、轻薄的行为而和他分手。"}]},{"partOfSpeech":"adj.","definition":{"en":"More generally, impolite, mean, or dishonorable in a social situation.","zh":"（更广义）不礼貌的、刻薄的、缺德的；在社交场合很失礼的。"},"examples":[{"en":"It was caddish to leave without saying goodbye.","zh":"不告而别很不礼貌、很失礼。"},{"en":"Don’t be caddish—apologize for what you said.","zh":"别这么没风度——为你说的话道歉。"}]}],"synonyms":["rude","disrespectful","sleazy","sexist","dishonorable","ungentlemanly"],"phonetic":"/ˈkædɪʃ/","extraExplanation":["“caddish”来自名词“cad”。“cad”在英式英语里常指“卑鄙的男人、花心或对女性不尊重的人”，带有明显的道德评判色彩。这个词在较正式或带点文学/讽刺语气的语境中更常见；日常口语里人们也可能用“rude / disrespectful / sleazy / sexist”来表达类似意思。","文化语感上，“caddish”强调“没品、没风度（ungentlemanly）”，尤其在恋爱或两性关系相关的情境里。近现代作品中常见于描写“花花公子/负心汉”的行径，带点老派的社交阶层语气。"]}
{"word":"caddishly","summary":{"en":"“Caddishly” means behaving in a rude, dishonorable way, especially in how a man treats others (often women).","zh":"“Caddishly”表示以粗鲁、卑劣、不讲道义的方式行事，常用于批评男性在对待他人（尤其女性）时缺德、失礼。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a rude, dishonorable, or ungentlemanly way; behaving like a “cad” (someone who treats others badly, especially women).","zh":"以粗鲁、卑劣、不讲道义的方式；表现得像“cad”（尤指对他人、特别是对女性不尊重、行为下作的人）。"},"examples":[{"en":"He spoke caddishly about his ex, as if her feelings didn’t matter at all.","zh":"他用很卑劣的口吻谈论前任，好像她的感受完全不重要。"},{"en":"It was caddishly unfair to flirt with her and then pretend he didn’t know her in public.","zh":"他先跟她调情，转头在公众场合又装作不认识她，这种做法卑鄙得不公平。"}]}],"synonyms":["rudely","dishonorably","boorishly","unfairly","like a cad"],"phonetic":"/ˈkædɪʃli/","extraExplanation":["“caddishly”来自名词“cad”。在英式英语里，“cad”在19世纪后常指“缺德的男人、无礼的小人”，带有强烈的道德谴责色彩，尤其常用于批评男性在恋爱或社交中玩弄、轻慢他人。","语体上偏书面或带讽刺感；日常口语里更常用“rudely / badly / like a jerk”之类表达，但“caddishly”更强调“卑劣、不讲绅士风度”的道德意味。"]}
{"word":"caddishness","summary":{"en":"Caddishness means ungentlemanly, disrespectful, or morally shabby behavior, often in romantic contexts.","zh":"Caddishness 指“不像绅士”的失礼或卑劣行为，常见于感情关系或对他人不尊重的情境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"rude, dishonest, or selfish behavior—especially the kind seen as ungentlemanly or disrespectful toward women","zh":"粗鲁、卑劣或自私的行为（尤指被认为“不像绅士”、对女性不尊重的举止）"},"examples":[{"en":"Everyone was shocked by his caddishness after he publicly mocked his ex-partner.","zh":"他在公开场合嘲笑前任的卑劣行径让大家都很震惊。"},{"en":"The film portrays his charm on the surface and his caddishness in private.","zh":"这部电影表现了他表面迷人、私下却很卑鄙的一面。"},{"en":"Her friends warned her not to ignore the signs of caddishness early in the relationship.","zh":"她的朋友提醒她不要在恋情初期忽视那些“渣”的迹象。"}]}],"synonyms":["boorishness","rudeness","shabbiness","dishonor","loutishness","sleaziness"],"phonetic":"/ˈkædɪʃnəs/","extraExplanation":["“caddishness”来自名词“cad”（英式用法更常见），传统上指“品行不端、不讲道义的男人”，常带有阶层与“绅士/非绅士”道德标准的意味。在现代语境里，它更常泛指自私、卑鄙、玩弄感情、缺乏尊重的行为（不一定只针对女性，但常与感情关系相关）。","在文学与影视评论中，“cad”常用来描写“外表风度翩翩、内里不负责任”的男性形象（与“gentleman”形成对照）。"]}
{"word":"caddishnesses","summary":{"en":"“Caddishnesses” means multiple instances of caddish (rude, dishonorable) behavior.","zh":"“caddishnesses”指多次或多种“卑鄙无礼、不讲道义”的行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of “caddishness”: repeated or multiple instances of rude, dishonorable, or inconsiderate behavior (especially toward women, in traditional usage).","zh":"“caddishness”的复数：多次或多种表现出来的粗鲁、卑鄙、不讲道义的行为（传统上常指对女性不尊重的举止）。"},"examples":[{"en":"The novel criticizes the hero’s caddishnesses—his lies, betrayals, and careless flirting.","zh":"这部小说批评男主的种种卑劣行径——撒谎、背叛，以及轻率的调情。"},{"en":"Her diary lists his caddishnesses, from broken promises to public insults.","zh":"她的日记记录了他一件件不堪的行为，从食言到当众羞辱。"}]}],"synonyms":["rudenesses","boorish behaviors","dishonorable acts","unprincipled behavior","loutishnesses"],"phonetic":"/ˈkædɪʃnəsɪz/","extraExplanation":["“cad”在英式英语里常指“卑鄙无礼的男人”，带有较强的道德评判色彩；因此“caddishness”也常见于文学评论、新闻评论或较正式的写作中。现代英语里更常用更中性的表达，如“rude behavior / dishonorable conduct / misogynistic behavior（若涉及性别偏见）”。"]}
{"word":"caddisworm","summary":{"en":"A caddisworm is a caddisfly larva that lives in water and often makes a protective case from natural materials.","zh":"caddisworm 指生活在水中的石蛾幼虫，常用天然材料做外壳保护自己。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the larva (young form) of a caddisfly, a small aquatic insect; it often lives in streams and builds a protective case from sand, twigs, or small stones.","zh":"石蛾幼虫（石蛾的幼体），常生活在溪流等淡水环境中，常用沙粒、树枝或小石头制作“外壳”保护自己。"},"examples":[{"en":"Caddisworms build little cases from sand and leaves to hide in.","zh":"石蛾幼虫会用沙粒和落叶做小外壳来躲藏。"},{"en":"The trout were feeding on caddisworms near the riverbank.","zh":"鳟鱼在河岸附近捕食石蛾幼虫。"},{"en":"Scientists found many caddisworms, which suggested the water was fairly clean.","zh":"科学家发现了很多石蛾幼虫，这暗示水质相对干净。"}]}],"synonyms":["caddisfly larva","caddis larva"],"phonetic":"/ˈkædɪsˌwɝm/","extraExplanation":["“caddisworm”里的“worm”并不表示它真的是“蠕虫”；它是昆虫（石蛾 caddisfly）的幼虫。因为外形像虫，所以英语里常用 worm 来称呼一些幼体。","石蛾幼虫常被用作钓鱼饵；在生态学上，它们也常被当作“水质指标生物”，因为很多种类更偏好较清洁、含氧量较高的水域。","也常见写法是 caddis worm（分开写），意义相同。"]}
{"word":"caddle","summary":{"en":"“Caddle” is not common/standard; it’s usually a misspelling of a similar word (like cattle, cuddle, coddle, or caddie).","zh":"“caddle”并非常见/标准用词，通常是与之相近单词（如 cattle、cuddle、coddle、caddie）的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard modern English word. It is usually a misspelling of a more common word (often “cattle,” “cuddle,” “coddle,” or “caddie”).","zh":"不是标准的现代英语单词。它通常是某个更常见单词的拼写错误（常见可能是 cattle、cuddle、coddle 或 caddie）。"},"examples":[{"en":"I couldn’t find “caddle” in a standard dictionary—did you mean “cattle” (farm animals)?","zh":"我在常见词典里找不到“caddle”——你是不是想写“cattle”（牛等家畜）？"},{"en":"If you mean “hold someone close,” the usual spelling is “cuddle.”","zh":"如果你想表达“抱着/依偎”，常见拼写是“cuddle”。"}]}],"phonetic":"/ˈkædəl/","extraExplanation":["“caddle”偶尔可能出现在方言、姓氏或地名中，但在日常英语里非常少见。","你可以告诉我你看到它的句子/上下文（或你想表达的中文意思），我就能帮你确认最可能的正确拼写和用法。"]}
{"word":"Caddo","summary":{"en":"Caddo refers to a Native American people, their traditional language, and things related to their culture.","zh":"Caddo 指卡多族（美国原住民民族）、卡多语，以及与其文化相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Native American people originally from parts of what are now eastern Texas, northwestern Louisiana, southwestern Arkansas, and southeastern Oklahoma","zh":"卡多族：美国原住民民族之一，原居于今美国德州东部、路易斯安那州西北部、阿肯色州西南部与俄克拉何马州东南部一带"},"examples":[{"en":"The Caddo were known for farming and large, organized communities.","zh":"卡多族以农业和规模较大、组织良好的聚落而闻名。"},{"en":"Some museum exhibits highlight Caddo pottery and mound sites.","zh":"一些博物馆展览会介绍卡多族的陶器与土丘遗址。"}]},{"partOfSpeech":"n.","definition":{"en":"the language traditionally spoken by the Caddo people","zh":"卡多语：卡多族传统使用的语言"},"examples":[{"en":"She is learning Caddo to help support language revitalization.","zh":"她在学习卡多语，以支持语言复兴。"},{"en":"The recording includes greetings in Caddo.","zh":"这段录音包含卡多语的问候语。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Caddo people or their language and culture","zh":"卡多族的；与卡多语或卡多文化相关的"},"examples":[{"en":"They attended a Caddo cultural event.","zh":"他们参加了一场卡多族文化活动。"},{"en":"The library has a small collection of Caddo language materials.","zh":"图书馆有一小部分卡多语资料。"}]}],"synonyms":["Caddo people","Caddo language","Caddoan (related term)"],"phonetic":"/ˈkædoʊ/","extraExplanation":["“Caddo”在美国语境中常见于人类学、历史与地方地名（如Caddo Lake、Caddo County）。作为族名与语言名时通常首字母大写。","卡多族与密西西比文化圈相关，历史上以土丘遗址（mounds）、陶器工艺与定居农业著称；当代也有语言复兴与文化传承项目。"]}
{"word":"Caddoan","summary":{"en":"Caddoan means “related to the Caddo people/culture” or “related to the Caddoan language family,” and it can also be a noun for a Caddoan person or the language family.","zh":"Caddoan 指“与卡多族及其文化相关”或“与卡多语系相关”，也可作名词指卡多族人或卡多语系。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Caddo peoples, their cultures, or their history (especially in parts of the southern United States).","zh":"与卡多族（Caddo peoples）及其文化或历史有关的（主要在美国南部部分地区）。"},"examples":[{"en":"The museum has a small exhibit of Caddoan pottery and tools.","zh":"这家博物馆有一个小型展区，展示卡多族的陶器和工具。"},{"en":"Researchers study Caddoan communities to better understand regional history.","zh":"研究人员研究卡多族社群，以更好地了解该地区的历史。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the Caddoan language family (the group of related Indigenous languages that includes Caddo).","zh":"与卡多语系有关的（包含 Caddo 在内的一组彼此相关的美洲原住民语言）。"},"examples":[{"en":"Caddoan languages share some historical connections in vocabulary and sound patterns.","zh":"卡多语系的语言在词汇和语音模式上有一些历史关联。"},{"en":"The linguistics class covered Caddoan language classification in North America.","zh":"语言学课讲到了北美的卡多语系分类。"}]},{"partOfSpeech":"n.","definition":{"en":"A member of a Caddoan people; also, the Caddoan language family as a whole (depending on context).","zh":"卡多族群的一员；也可指卡多语系整体（视语境而定）。"},"examples":[{"en":"Some Caddoan groups have maintained strong cultural traditions into the present.","zh":"一些卡多族群至今仍保有浓厚的文化传统。"},{"en":"The book introduces Caddoan and neighboring language families.","zh":"这本书介绍了卡多语系以及周边的语系。"}]}],"synonyms":["Caddo (related term)"],"phonetic":"/ˈkædoʊən/","extraExplanation":["“Caddoan”通常需要大写，因为它来自族群与语系名称（专有名词）。在学术写作中常见于“Caddoan languages（卡多语系语言）”“Caddoan peoples（卡多族群）”。","卡多族历史上主要分布在今日美国的德克萨斯州、俄克拉荷马州、路易斯安那州和阿肯色州一带。谈及原住民族群时，使用对方自称或公认名称，并注意语境的尊重与准确。"]}
{"word":"caddoan","summary":{"en":"Caddoan means “related to the Caddo people/culture” or “related to the Caddoan language family,” and it can also mean “a Caddo person.”","zh":"Caddoan 指“与卡多族人/文化有关”或“与卡多语系有关”，也可作名词表示“卡多族人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Caddo people or their culture, especially in parts of the southern United States.","zh":"（形容词）与卡多族（Caddo）人或其文化有关的，尤指美国南部地区。"},"examples":[{"en":"The museum has a Caddoan pottery exhibit from East Texas.","zh":"博物馆有一个来自德克萨斯州东部的卡多族陶器展。"},{"en":"Researchers study Caddoan history and traditions in the region.","zh":"研究人员在该地区研究卡多族的历史与传统。"}]},{"partOfSpeech":"n.","definition":{"en":"A member of the Caddo people, or something connected with them.","zh":"（名词）卡多族人；或与卡多族有关的事物。"},"examples":[{"en":"The speaker identified as a Caddoan and shared family stories.","zh":"那位演讲者自称是卡多族人，并分享了家族故事。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the Caddoan language family (a group of Indigenous languages), including Caddo and related languages.","zh":"（形容词）与卡多语系有关的（一个原住民语言家族），包括卡多语及其相关语言。"},"examples":[{"en":"Caddoan languages have been documented by linguists for decades.","zh":"语言学家几十年来一直在记录卡多语系的语言。"},{"en":"The course introduces Caddoan grammar and pronunciation basics.","zh":"这门课介绍卡多语系语言的基础语法与发音。"}]}],"synonyms":["Caddo (related term)","Caddoan (variant spelling)","Indigenous (broader term, context-dependent)"],"phonetic":"/kəˈdoʊən/","extraExplanation":["“Caddoan”常用于人类学、历史学与语言学语境：既可以指卡多族（Caddo）相关的文化与族群，也可以指“卡多语系”这一语言分类。","卡多族历史上主要分布在美国南部平原与森林交界地带（如今日德州、路易斯安那、俄克拉荷马等区域）。当代语境中，使用族群名称与相关形容词时，通常以尊重当事人自称与具体部族名称为佳。"]}
{"word":"caddow","summary":{"en":"“Caddow” is not a standard English word; it’s usually a misspelling/variant of “Caddo.”","zh":"“caddow”不是标准英语词；通常是“Caddo”的误拼或变体。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare or nonstandard spelling, most often seen as a mistaken spelling of “Caddo” (the name of a Native American people and their language, and also place names in the U.S.).","zh":"一种很少见/非标准的拼写，最常见是把“Caddo”（美国原住民卡多族及其语言的名称，也常见于美国地名）误写成“caddow”。"},"examples":[{"en":"I think “caddow” here is a misspelling of “Caddo.”","zh":"我觉得这里的“caddow”可能是把“Caddo”拼错了。"},{"en":"She’s researching the Caddo language and its history.","zh":"她在研究卡多语及其历史。"}]}],"synonyms":["Caddo"],"phonetic":"/ˈkædoʊ/","extraExplanation":["“Caddo”常读作 /ˈkædoʊ/，常见于：Caddo people（卡多族）、Caddo language（卡多语）、以及美国的一些地名（如 Caddo County）。","如果你是在特定文本里看到“caddow”，也可能是人名/姓氏或地方用语的拼法变体；可以把上下文（整句或出处）发我，我能更准确判断。"]}
{"word":"Caddric","summary":{"en":"Caddric is an uncommon spelling of the male name Cedric.","zh":"Caddric是男性名字Cedric的一种不常见拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A male given name (a variant spelling of “Cedric”); “Caddric” itself is uncommon and may be a modern or personal spelling.","zh":"男性名字（“Cedric”的一种变体拼写）；“Caddric”本身不常见，可能是较现代或个人化的拼写。"},"examples":[{"en":"Caddric is my classmate’s name, but most people spell it Cedric.","zh":"Caddric是我同学的名字，但大多数人会拼作Cedric。"},{"en":"If you see “Caddric” on a form, double-check the spelling with the person.","zh":"如果你在表格上看到“Caddric”，最好和本人确认一下拼写。"}]}],"synonyms":["Cedric"],"phonetic":"/ˈsɛdrɪk/","extraExplanation":["“Cedric”这个名字在英语世界更常见，读音通常为 /ˈsɛdrɪk/。它因英国小说家司各特（Walter Scott）在《艾凡赫》（Ivanhoe, 1819）中使用而流行起来。“Caddric”很可能是受“Cedric”影响的创意拼写；在正式写作或证件中尤其要注意按本人偏好的拼写来写。"]}
{"word":"caddy","summary":{"en":"A caddy is usually a golf helper who carries clubs and gives advice; it can also mean a small organizer/holder.","zh":"caddy通常指高尔夫球童；也可指用于收纳整理的小盒或小架。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who carries a golfer’s clubs and gives help or advice during a round of golf.","zh":"（高尔夫）球童；为球手背球包并提供协助或建议的人。"},"examples":[{"en":"The caddy carried her clubs for all 18 holes.","zh":"球童为她背着球杆走完了18洞。"},{"en":"He asked the caddy which club to use.","zh":"他问球童该用哪支球杆。"}]},{"partOfSpeech":"n.","definition":{"en":"A small container or holder used to keep or organize items (often in a kitchen or bathroom).","zh":"（用于收纳的）小盒/小架；收纳篮（常见于厨房或浴室）。"},"examples":[{"en":"She put the tea bags in a wooden caddy.","zh":"她把茶包放进一个木质茶叶收纳盒里。"},{"en":"Keep your shower supplies in a bathroom caddy.","zh":"把洗浴用品放在浴室收纳架里。"}]},{"partOfSpeech":"v.","definition":{"en":"To work as a golf caddy; to carry clubs for a golfer.","zh":"当球童；为球手背球杆并提供协助。"},"examples":[{"en":"He caddied at the local golf course during the summer.","zh":"他夏天在本地高尔夫球场当球童。"},{"en":"She caddied for her uncle in a charity tournament.","zh":"她在慈善赛中为叔叔当球童。"}]}],"synonyms":["caddie","golf assistant","club carrier","organizer","holder","container"],"phonetic":"/ˈkædi/","extraExplanation":["“caddy”在高尔夫语境中也常拼作“caddie”，意思相同；名词表示“球童”，动词常用“caddie/caddy for someone”。","词源与苏格兰英语有关（高尔夫运动也与苏格兰文化渊源深）。在文学或影视里，球童常被描写为了解球场、给建议、见证球手心态起伏的人物。"]}
{"word":"caddying","summary":{"en":"“Caddying” mainly means working as a golf caddie; it can also be used figuratively for assisting someone in a supportive role.","zh":"“caddying”主要指当高尔夫球童；也可引申为像球童一样在旁边协助某人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of working as a golf caddie—carrying a player’s clubs and often giving course advice","zh":"当高尔夫球童的行为——为球员背球杆，并常常提供球场建议"},"examples":[{"en":"He makes extra money on weekends by caddying at the local golf club.","zh":"他周末在当地高尔夫俱乐部当球童赚点外快。"},{"en":"Caddying taught her how to read the greens and stay calm under pressure.","zh":"当球童让她学会了如何判断果岭走势，并在压力下保持冷静。"}]},{"partOfSpeech":"vi.","definition":{"en":"helping someone in a supporting role (often by doing practical tasks or offering guidance), similar to “assisting”","zh":"以辅助身份帮助某人（常指做实际事务或提供建议），类似“协助/打下手”"},"examples":[{"en":"I spent the summer caddying for my professor—organizing notes and checking references.","zh":"我整个夏天都在给教授打下手——整理笔记、核对参考文献。"},{"en":"She joked that she was caddying for her friend during the presentation.","zh":"她开玩笑说，朋友做展示时她就是在旁边当“球童”帮忙。"}]}],"synonyms":["caddieing","working as a caddie","assisting","helping","supporting"],"phonetic":"ˈkædiɪŋ","extraExplanation":["“caddying”来自动词 caddy（当球童）。在英语里，golf caddie（高尔夫球童）不只是“背包的人”，很多时候也会提供距离判断、选杆建议、果岭线路（read the greens）等信息。","在非高尔夫语境中，caddy for somebody 有时带一点口语/幽默的比喻意味：像球童一样在旁边支援、跑腿、出主意。正式写作里通常用 assist/help/support 更中性。"]}
{"word":"cade","summary":{"en":"“Cade” usually refers to a young animal (often a lamb) that has been abandoned and raised by people, and it can also mean “tame/people-friendly” because of being hand-reared.","zh":"“Cade”通常指被母兽弃养、由人类人工喂养长大的幼兽（常指小羊），也可形容动物因人工喂养而“温顺亲人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(of a young animal, especially a lamb) left by its mother and raised by people; such an animal.","zh":"（尤指小羊等幼兽）被母兽遗弃、由人类人工喂养长大的幼兽；弃养幼兽。"},"examples":[{"en":"The farmer bottle-fed a cade lamb every four hours.","zh":"农夫每四小时用奶瓶喂一次那只人工喂养的小羊。"},{"en":"A cade calf can become very friendly with people.","zh":"人工喂养的小牛往往会对人很亲近。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of an animal) tame and used to people, often because it was hand-reared.","zh":"（动物）温顺亲人、习惯与人接触的（常因人工喂养长大）。"},"examples":[{"en":"Because it was cade, the lamb followed her around the yard.","zh":"因为很亲人，那只小羊在院子里一直跟着她。"},{"en":"The cade ewe was calm during the checkup.","zh":"那只很亲人的母羊在检查时很镇定。"}]},{"partOfSpeech":"vt.","definition":{"en":"To raise (a young animal) by hand; to bottle-feed.","zh":"人工饲养（幼兽）；用奶瓶喂养。"},"examples":[{"en":"They had to cade the orphaned lamb through the winter.","zh":"他们不得不在冬天把那只孤儿小羊人工喂养大。"}]}],"synonyms":["hand-reared","bottle-fed","orphaned (animal)","tame","docile"],"phonetic":"/keɪd/","extraExplanation":["“cade”在英式英语、苏格兰英语与农业语境中更常见，现代日常对话里不算高频；美式英语更常见的说法是“bottle-fed lamb/calf”或“hand-reared animal”。","词源上常被认为与苏格兰语/中古英语中表示“宠爱、驯养”的用法有关，因此既能指“被人工喂养的幼兽”，也能引申出“很亲人、温顺”的形容词意思。"]}
{"word":"cadeau","summary":{"en":"“Cadeau” means a gift, especially a complimentary freebie (often in marketing or hospitality).","zh":"“Cadeau”指礼物，尤指商家或酒店等提供的赠品/小礼品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a gift or present (often used in English to mean a small complimentary gift, especially in marketing or hospitality).","zh":"礼物；赠品（在英语里常指商家/酒店等提供的小礼品、赠送品）。"},"examples":[{"en":"The hotel left a small cadeau in the room—a box of chocolates.","zh":"酒店在房间里放了一份小礼物——一盒巧克力。"},{"en":"Customers receive a free cadeau with every purchase over $50.","zh":"消费满50美元的顾客都会收到一份免费赠品。"}]}],"synonyms":["gift","present","freebie","complimentary gift","giveaway"],"phonetic":"kæˈdoʊ","extraExplanation":["“cadeau”原是法语词，字面意思就是“礼物”。在英语语境中，它并不算常用的日常词，更常见于带一点“法式/高端”氛围的场合，或市场营销、酒店服务里指“随赠的小礼品/伴手礼”。在普通口语里，多数情况下直接说 gift / present 更自然。"]}
{"word":"cadee","summary":{"en":"“Cadee” is a rare spelling of “caddie/caddy,” meaning a golf caddie or a small organizer/holder.","zh":"“cadee”多为“caddie/caddy”的少见拼写，可指高尔夫球童或收纳盒/置物架。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare or nonstandard spelling of “caddie” (also “caddy”): a person who carries a golfer’s clubs and may give advice during a round of golf.","zh":"“caddie/caddy”的罕见或非标准拼写：指在高尔夫球场为球手背球杆、并可能提供建议的球童。"},"examples":[{"en":"He hired a caddie to carry his clubs during the tournament.","zh":"他在比赛中雇了一位球童帮他背球杆。"},{"en":"The caddie suggested using a 7-iron because of the wind.","zh":"球童因为有风，建议他用7号铁杆。"}]},{"partOfSpeech":"n.","definition":{"en":"A small container or holder used to keep things organized (more commonly spelled “caddy”), such as a tea caddy or shower caddy.","zh":"用于收纳整理的小盒或置物架（更常写作“caddy”），如茶叶罐、浴室置物架等。"},"examples":[{"en":"She put the tea bags back in the tea caddy.","zh":"她把茶包放回茶叶罐里。"},{"en":"I keep shampoo and soap in a shower caddy.","zh":"我把洗发水和肥皂放在浴室置物架里。"}]}],"synonyms":["caddie","caddy","golf caddie","organizer","holder"],"phonetic":"/ˈkædi/","extraExplanation":["“Cadee”在现代英语里不是常见标准拼写；如果你是在高尔夫语境或“收纳盒/置物架”语境看到它，通常就是“caddie/caddy”的变体或拼写错误。","“caddie”多指高尔夫球童；“caddy”更常指收纳容器。写作时用标准拼写会更自然。"]}
{"word":"Cadel","summary":{"en":"Cadel is mainly used as a male first name, notably associated with Australian contexts (e.g., cyclist Cadel Evans).","zh":"Cadel 主要用作男性名字，常与澳大利亚语境相关（如车手 Cadel Evans）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a masculine given name (first name), used especially in Australia and some English-speaking contexts.","zh":"男性名字（名），在澳大利亚及部分英语语境中较常见。"},"examples":[{"en":"Cadel is starting a new job next week.","zh":"Cadel 下周开始一份新工作。"},{"en":"Have you met Cadel before?","zh":"你之前见过 Cadel 吗？"}]},{"partOfSpeech":"n.","definition":{"en":"a surname (family name) in some contexts; also known as the first name of Australian cyclist Cadel Evans.","zh":"在某些语境中也可作姓；同时也是澳大利亚自行车运动员 Cadel Evans 的名字。"},"examples":[{"en":"Cadel Evans won the Tour de France in 2011.","zh":"Cadel Evans 在 2011 年赢得了环法自行车赛冠军。"}]}],"phonetic":"/kəˈdɛl/","extraExplanation":["“Cadel”通常被当作专有名词（人名）使用，因此在句子里一般不加冠词（a/the）。","发音上更接近“kuh-DEL”，重音在第二个音节：ca-DEL。"]}
{"word":"Cadell","summary":{"en":"Cadell is a proper name (first name or surname), most often associated with Welsh/British usage.","zh":"Cadell 是一个专有名词（名字或姓氏），多与威尔士/英国语境相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a personal name or surname (a proper noun), used especially in Welsh and British contexts.","zh":"（专有名词）人名或姓氏，常见于威尔士及英国语境中。"},"examples":[{"en":"Cadell is a Welsh name that appears in some historical records.","zh":"Cadell 是一个威尔士人名，在一些历史记录中可以见到。"},{"en":"Her last name is Cadell.","zh":"她的姓是 Cadell。"}]}],"phonetic":"/kəˈdɛl/","extraExplanation":["“Cadell”常被认为源自威尔士语人名，历史上在威尔士与早期不列颠地区的王族或贵族谱系中出现过（例如中世纪的威尔士统治者名字中可见）。作为现代英语使用时，它通常不翻译含义，而是按发音音译或直接保留拼写。","发音上英语里常读作 /kəˈdɛl/（重音在第二音节），但作为姓氏时也可能因家族或地区而略有差异。"]}
{"word":"cadelle","summary":{"en":"A rare word for a stored-grain pest beetle, especially the cadelle beetle.","zh":"一个较少见的词，指危害储粮的甲虫，尤指“cadelle beetle”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a beetle (Tenebroides mauritanicus) whose larvae and adults are pests in stored grain and flour; also called the cadelle beetle.","zh":"一种甲虫（学名 Tenebroides mauritanicus），幼虫和成虫都会危害储存的谷物与面粉；也称“谷仓甲/面粉害虫甲虫”（cadelle beetle）。"},"examples":[{"en":"The mill called a pest-control team after finding cadelles in the flour bins.","zh":"磨坊在面粉仓里发现 cadelle 之后，叫来了病虫害防治团队。"},{"en":"Cadelle larvae can damage grain stores by feeding and tunneling.","zh":"cadelle 的幼虫会取食并钻蛀，从而破坏粮食储藏。"}]}],"synonyms":["cadelle beetle","stored-product beetle","grain pest (general)"],"phonetic":"/kəˈdɛl/","extraExplanation":["“cadelle”在日常英语中非常少见，更常见的说法是“cadelle beetle”。它通常出现在农业、粮食仓储、害虫防治等语境里。","词源来自法语 cadelle（指一种会侵害谷物的甲虫），在英文里主要作为专业名词使用。"]}
{"word":"cadelles","summary":{"en":"Cadelles are beetles that infest stored grain and other dry foods.","zh":"Cadelles 指侵害储存谷物等干燥食品的甲虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a kind of dark beetle that can infest stored grain, flour, and other dry food products (plural of cadelle)","zh":"一种会侵害储存谷物、面粉等干燥食品的黑色甲虫（cadelle 的复数）"},"examples":[{"en":"The inspector found cadelles in the grain silo and ordered a cleanup.","zh":"检查员在粮仓里发现了 cadelles，并下令清理。"},{"en":"To prevent cadelles, store flour in sealed containers and keep the pantry dry.","zh":"为防止 cadelles，把面粉密封保存，并保持储藏间干燥。"}]}],"synonyms":["cadelle beetles","stored-grain beetles"],"phonetic":"/kəˈdɛlz/","extraExplanation":["“cadelle”一词来自法语，常用于害虫防治、仓储与农业语境中；在日常英语里并不常见，更常见的说法是“cadelle beetle”或直接说“a beetle infesting stored grain”。"]}
{"word":"Cadena","summary":{"en":"Cadena is a Spanish word meaning “chain,” and it can also refer to a network or chain of businesses; it is also used as a surname.","zh":"Cadena 是西班牙语词，意思是“链条/锁链”，也可指“连锁、网络”；同时它也常用作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Spanish) a chain; also used more broadly for a series or network (for example, a TV/radio chain).","zh":"（源自西班牙语）“链条、锁链”；也可引申指“一系列、连锁、网络”（如电视/电台连锁）。"},"examples":[{"en":"In Spanish, “cadena” means “chain.”","zh":"在西班牙语里，“cadena”的意思是“链条/锁链”。"},{"en":"The news talked about a national TV cadena with stations across the country.","zh":"新闻提到一个覆盖全国各地电视台的“连锁/网络（cadena）”。"}]},{"partOfSpeech":"n.","definition":{"en":"a Spanish-language surname (family name).","zh":"西班牙语姓氏（家族姓）。"},"examples":[{"en":"Her last name is Cadena.","zh":"她的姓是 Cadena。"},{"en":"Cadena is a common surname in many Spanish-speaking communities.","zh":"Cadena 在许多西语社群中是比较常见的姓氏。"}]}],"synonyms":["chain","series","network","string","linkage"],"phonetic":"/kəˈdeɪnə/","extraExplanation":["在西班牙语中，cadena 的常见搭配有：cadena de televisión（电视网/电视连锁）、cadena de restaurantes（连锁餐厅）、cadena perpetua（无期徒刑/终身监禁）。这些都来自“链条”引申出的“环环相扣、连锁”的概念。"]}
{"word":"Cadence","summary":{"en":"Cadence means a rhythmic flow or pattern (in music, poetry, or speech), and it can also mean a musical ending or the rate of repeated movement (like step or cycling speed).","zh":"Cadence 指有规律的节奏/韵律（常见于音乐、诗歌、讲话），也可指音乐的收束终止式，或重复动作的频率（如步频、踏频）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a steady, repeated pattern of rhythm or flow, especially in music, poetry, or speech","zh":"（尤指音乐、诗歌或讲话中的）节奏；韵律；抑扬顿挫"},"examples":[{"en":"The song has a slow cadence that feels calm and reflective.","zh":"这首歌的节奏很慢，让人感觉平静、沉思。"},{"en":"Good speakers vary their cadence to keep the audience interested.","zh":"优秀的演讲者会变化语速和抑扬顿挫，以吸引听众。"},{"en":"In the poem, the cadence rises and falls like waves.","zh":"在这首诗里，韵律起伏如波浪。"}]},{"partOfSpeech":"n.","definition":{"en":"a musical ending or closing sequence that signals a pause or conclusion","zh":"（音乐）终止式；（乐句的）收束、结尾"},"examples":[{"en":"The pianist ended the phrase with a perfect cadence.","zh":"钢琴家用一个完全终止式结束了这个乐句。"},{"en":"That cadence makes the ending feel final.","zh":"那个终止式让结尾听起来很有“结束感”。"}]},{"partOfSpeech":"n.","definition":{"en":"the rate at which something happens repeatedly, especially steps, movement, or cycling speed","zh":"（重复动作的）频率；步频；（骑行等的）踏频"},"examples":[{"en":"Try to keep a consistent running cadence to reduce fatigue.","zh":"尽量保持稳定的跑步步频，以减少疲劳。"},{"en":"Cyclists often track cadence along with heart rate.","zh":"骑行者常常同时监测踏频和心率。"}]}],"synonyms":["rhythm","flow","beat","meter","tempo","inflection","ending","close","rate"],"phonetic":"/ˈkeɪdəns/","extraExplanation":["“cadence”源自拉丁语 *cadere*（“落下”）。因此它常带有“起伏—落点—收束”的感觉：说话的语调落下、诗行的节奏落下、乐句在终止式处“落地”。","在英语写作与演讲中，cadence 常用来评价语言是否“顺口、好听、有节奏感”。例如短句加停顿会更有力，长短句交替会更自然。","文学/诗歌里常提到 “the cadence of the sea / of rain / of footsteps”（海浪/雨声/脚步声的节奏），用来营造画面感与情绪。"]}
{"word":"cadence","summary":{"en":"Cadence means a rhythm or flow (especially in speech or music), or a steady pattern of movement (like marching or running). In music it can also mean the “ending” that makes a phrase feel complete.","zh":"Cadence 指节奏/韵律（尤指说话或音乐的语流），也指行进或跑步等动作的稳定节律；在音乐中还可指让乐句收束、产生结束感的“终止式”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the rhythm or flow of sounds, especially in speech, writing, or music","zh":"（尤指说话、写作或音乐的）节奏；韵律；语流"},"examples":[{"en":"Her voice had a calm cadence that made the story easy to follow.","zh":"她的声音节奏平稳，让故事很容易听懂。"},{"en":"Good speakers vary their cadence to keep the audience interested.","zh":"好的演讲者会变化语流节奏，以保持听众的兴趣。"},{"en":"The poem’s cadence feels musical even without a strict rhyme.","zh":"这首诗即使没有严格押韵，读起来也很有音乐感。"}]},{"partOfSpeech":"n.","definition":{"en":"a repeated pattern or sequence of movements, especially in marching or running","zh":"（行进、跑步等的）步伐节奏；重复的动作节律"},"examples":[{"en":"Try to keep a steady cadence while you run.","zh":"跑步时尽量保持稳定的步频。"},{"en":"The drummer set the cadence for the marching band.","zh":"鼓手为行进乐队定下了行进节奏。"}]},{"partOfSpeech":"n.","definition":{"en":"(in music) the ending part of a phrase, where the harmony and melody come to a pause or feel “resolved”","zh":"（音乐）终止式；（乐句的）收束/解决（产生结束或停顿感的部分）"},"examples":[{"en":"The song ends with a soft cadence that sounds peaceful.","zh":"这首歌以柔和的终止式结束，听起来很宁静。"},{"en":"A strong cadence can make the end of a musical phrase feel complete.","zh":"强烈的终止式会让一个乐句的结尾显得完整。"}]}],"synonyms":["rhythm","beat","flow","tempo","meter"],"phonetic":"/ˈkeɪdəns/","extraExplanation":["“cadence”常用来谈“说话的节奏/语调起伏”。在英语口语里，人们会用它形容一个人说话是“有韵律、好听、容易跟上”，或相反“单调、机械”。","词源来自拉丁语 *cadere*（“落下”）。因此在音乐里，“cadence”也常带有“落点/收束”的感觉，即乐句走到一个可以停下、告一段落的位置。","相关常见搭配：speech cadence（讲话节奏）、natural cadence（自然语流）、steady cadence（稳定步频）、falling cadence（结尾语调下降，常见于陈述句）。"]}
{"word":"cadenced","summary":{"en":"Cadenced describes speech, writing, or movement that has a clear, measured rhythm.","zh":"Cadenced 用来形容语言、文字或动作具有清晰、匀称的节奏感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a rhythm or pattern of beats; spoken, written, or played with a measured flow.","zh":"（语音/文字/音乐）有节奏的；有抑扬顿挫的；有韵律感的。"},"examples":[{"en":"Her cadenced voice made the poem easy to follow.","zh":"她抑扬顿挫的声音让这首诗更容易听懂。"},{"en":"The pastor delivered a cadenced sermon that rose and fell like music.","zh":"牧师用有节奏的语调讲道，声音起伏像音乐一样。"},{"en":"The novel opens with cadenced sentences that feel almost poetic.","zh":"这部小说以富有韵律的句子开篇，几乎像诗一样。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense or past participle of “cadence”: to give something a rhythm, or to move with a measured, rhythmic pace.","zh":"“cadence”的过去式/过去分词：使……有节奏；（以）有节奏的步伐行进。"},"examples":[{"en":"The coach cadenced the team’s breathing during the drill: in for four, out for four.","zh":"教练在训练中让队员按节奏呼吸：吸四拍，呼四拍。"},{"en":"The soldiers cadenced their steps to the drum.","zh":"士兵们随着鼓点踏出整齐的节奏。"}]}],"synonyms":["rhythmic","measured","flowing","poetic","lilting"],"phonetic":"/ˈkeɪdənst/","extraExplanation":["“cadence”常见于文学与演讲中，指语言的“节奏感/音步”，例如句子长短变化、重读与停顿的安排，会让表达更有感染力。","在英语里也常说“the cadence of her speech”（她说话的节奏/抑扬），或“a slow, steady cadence”（缓慢而稳定的步调）。"]}
{"word":"cadences","summary":{"en":"Cadences means rhythms or patterns of beats—especially in speech/writing, music/poetry, marching, or cycling RPM.","zh":"Cadences 指各种“节奏/韵律/节拍模式”，常用于描述语言与写作、音乐与诗歌、行军操练节奏，或骑行踏频（RPM）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the natural rhythm or flow of speech, writing, music, or poetry (often describing how something “sounds” as it moves).","zh":"（讲话、写作、音乐或诗歌的）节奏；韵律；抑扬顿挫（强调语言或旋律“流动起来的感觉”）。"},"examples":[{"en":"Her voice had a calm, steady cadence that made everyone listen.","zh":"她的声音节奏平稳、令人安心，让大家都愿意听。"},{"en":"Good writers vary sentence cadences to keep the paragraph lively.","zh":"好的写作者会变化句子的节奏，让段落更有活力。"},{"en":"The poem’s cadence becomes stronger in the final lines.","zh":"这首诗在最后几行的韵律更强。"}]},{"partOfSpeech":"n.","definition":{"en":"a repeated pattern of beats used for marching or drill (military or group movement).","zh":"（行进或操练时的）口令节拍；行进节奏（常见于军队或集体队列）。"},"examples":[{"en":"The soldiers marched in cadence.","zh":"士兵们踏着整齐的步伐行进。"},{"en":"The drill leader called cadences to keep the group together.","zh":"教官用口令节拍让队伍保持一致。"}]},{"partOfSpeech":"n.","definition":{"en":"the rate of movement in cycling or similar sports, usually measured in revolutions per minute (RPM).","zh":"（骑行等运动的）踏频；转速（通常以每分钟转数 RPM 计）。"},"examples":[{"en":"He increased his cadence on the climb to save his legs.","zh":"爬坡时他提高踏频来省腿力。"},{"en":"A cadence sensor can track your RPM while you ride.","zh":"踏频传感器可以在骑行时记录你的转速。"}]}],"synonyms":["rhythms","patterns","beats","flow","tempo","meter","intonation"],"phonetic":"/ˈkeɪdəns/","extraExplanation":["“cadences”是复数形式，表示多种/多处的节奏（例如不同句子的节奏、不同段落的韵律）。","词源上来自拉丁语 *cadere*（“落下”），所以cadence常带有“声音或节拍落点”的感觉：重音如何一下一下“落”在听者耳中。","文学与演讲里常说“the cadence of the line/voice”，强调不仅是快慢，更是重音、停顿与语气共同形成的听觉效果。"]}
{"word":"cadencies","summary":{"en":"Cadencies (plural of cadency) means rhythmic flow in speech/writing/music, or a falling intonation at the end of a statement; rarely, it can mean a heraldic mark for a family branch.","zh":"cadencies（cadency 的复数）指讲话/写作/音乐中的节奏韵律，或陈述句句末的降调收尾；少见用法指纹章学中的家族分支区别记号。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"rhythmic flow or beat in speech, writing, or music; a pattern of rises and falls that sounds pleasing or expressive","zh":"（讲话、写作或音乐中的）节奏与韵律；起伏变化形成的悦耳或富有表现力的节拍/节奏感"},"examples":[{"en":"Her speech had a calm, steady cadency that made people listen.","zh":"她的演讲有一种平静而稳定的韵律，让人愿意倾听。"},{"en":"Poets often shape their lines for cadency as much as for meaning.","zh":"诗人常常既为了意义也为了韵律来打磨诗句。"}]},{"partOfSpeech":"n.","definition":{"en":"the downward change in pitch at the end of a statement; intonation that signals something is finished","zh":"（陈述句末尾）音高下降的语调变化；表示话语结束的语调"},"examples":[{"en":"In English, a statement often ends with a falling cadency.","zh":"在英语中，陈述句常以降调收尾。"},{"en":"The teacher asked for a question, but his cadency sounded like he was done.","zh":"老师看似在提问，但他的收尾语调听起来像是已经讲完了。"}]},{"partOfSpeech":"n.","definition":{"en":"(heraldry) a mark added to a coat of arms to show a younger branch of a family","zh":"（纹章学）用于区分家族旁支/幼支的纹章加记号"},"examples":[{"en":"The shield included a cadency mark to show a younger son’s line.","zh":"这面盾徽带有支系加记号，用来表示幼子的家族分支。"}]}],"synonyms":["rhythm","flow","intonation","inflection","meter"],"phonetic":"/ˈkeɪdənsi/","extraExplanation":["“cadency”来自拉丁语词根，和“fall（下降）”的概念有关，因此既可指声音/语调的“起落”，也可指句末“降调收尾”的感觉。","你输入的“cadencies”是复数形式：常见于描述多种不同的说话节奏、诗歌韵律，或不同句型的语调收尾。"]}
{"word":"cadencing","summary":{"en":"“Cadencing” means giving speech or music a clear rhythm, often moving toward a natural-feeling ending or pause.","zh":"“cadencing”指让语言或音乐呈现清晰的节奏感，常带有走向自然收束或停顿的感觉。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “cadence”) speaking, reading, or writing with a clear rhythm and pattern of stressed and unstressed beats; giving words a musical flow.","zh":"（“cadence”的现在分词）用清晰的节奏与重音模式来说话、朗读或写作；让语言有音乐般的韵律感。"},"examples":[{"en":"The actor was cadencing each line so the audience could feel the emotion.","zh":"演员把每一句都读得很有节奏，让观众感受到情绪。"},{"en":"Try cadencing the sentence slowly, then faster, to hear the rhythm.","zh":"试着先慢慢、再快一点读这句话，听听它的节奏。"}]},{"partOfSpeech":"v.","definition":{"en":"(music) shaping a phrase so it moves toward a cadence—an ending or pause that feels complete.","zh":"（音乐）把乐句处理得走向“终止式/收束点”，也就是听起来完整或暂停的结尾。"},"examples":[{"en":"The pianist is cadencing into the final chord.","zh":"钢琴家正在把乐句收束到最后一个和弦上。"},{"en":"The choir kept cadencing together at the end of each phrase.","zh":"合唱团在每个乐句结尾都整齐地收束。"}]}],"synonyms":["rhythming","phrasing","intoning","modulating"],"phonetic":"/ˈkeɪdən.sɪŋ/","extraExplanation":["“cadence”在英语里常指两类“节奏感”：①口语/朗读/写作中的抑扬顿挫（重读与非重读的排列）；②音乐里乐句的“收束/终止式”，给人“告一段落”的感觉。","在文学里，作者会用句子长短、停顿（逗号/分号）、重复与头韵等手段来营造cadence；朗读时“cadencing”就是把这些节奏读出来。"]}
{"word":"cadency","summary":{"en":"Cadency means a rhythmic, musical flow in speech, music, or writing (often said as “cadence”).","zh":"Cadency 指讲话、音乐或文字中的节奏与抑扬顿挫（更常用的说法是 cadence）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rhythmic flow or pattern in speech, music, or writing; the rise and fall of sounds","zh":"（讲话、音乐或写作的）节奏感；抑扬顿挫的韵律"},"examples":[{"en":"The poet’s cadency makes the lines easy to remember.","zh":"这位诗人的节奏感让诗句更容易记住。"},{"en":"Her cadency changed when she got nervous, and she started speaking faster.","zh":"她紧张时说话的节奏变了，开始讲得更快。"}]},{"partOfSpeech":"n.","definition":{"en":"the quality of a voice or style that sounds smooth and musical","zh":"（声音或表达方式的）圆润悦耳感；音乐性"},"examples":[{"en":"Many listeners enjoy the cadency of his storytelling voice.","zh":"很多听众喜欢他讲故事时声音的悦耳感。"},{"en":"The song’s cadency gives it a calm, comforting mood.","zh":"这首歌的韵律感带来平静、安慰的氛围。"}]}],"synonyms":["cadence","rhythm","flow","meter"],"phonetic":"/ˈkeɪdənsi/","extraExplanation":["“cadency”来自“cadence”（终止式/节奏），在现代英语里较少见，更多时候人们会直接用“cadence”。如果你想表达“说话的节奏/语速/抑扬顿挫”，更自然的搭配是：speech cadence / the cadence of her voice。"]}
{"word":"cadenette","summary":{"en":"Cadenette is a historical term for a side lock or braid of hair, often ribbon-tied, popular in 17th–18th century France.","zh":"Cadenette 指一种历史性的侧边长发/发辫（常用丝带系住），流行于17—18世纪的法国。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long lock or braid of hair (often tied with a ribbon) worn hanging at the side of the head, especially by men in 17th–18th century France.","zh":"（尤指17—18世纪法国男性所留的）侧边一缕长发/发辫，常用丝带系住下垂。"},"examples":[{"en":"In the portrait, the young officer wears a cadenette beside his ear.","zh":"在这幅肖像里，那位年轻军官耳边垂着一缕“cadenette”式的侧发。"},{"en":"The actor’s costume included a wig with a cadenette to match the period style.","zh":"那位演员的戏服里有一顶带“cadenette”侧发的假发，用来贴合时代造型。"}]}],"synonyms":["side lock","sidelock","braid","pigtail"],"phonetic":"/ˌkædəˈnɛt/","extraExplanation":["这个词来自法语，属于历史服饰/发型用语，现代日常英语里很少用，更多见于艺术史、戏剧服装、或描述旧时代肖像与军装风格的文字。","它常被看作一种“时尚标志”，尤其与贵族、军官或“青年（cadet）”形象联系在一起；不同地区与时期的具体样式可能略有差异。"]}
{"word":"cadent","summary":{"en":"Cadent is a literary adjective meaning “rhythmic and flowing,” sometimes also “gently descending.”","zh":"Cadent 是一个偏文艺的形容词，常指“富有韵律、流畅的”，有时也可指“渐降的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(literary) Rhythmic and flowing; having a regular beat or musical rise and fall.","zh":"（文艺用语）有节奏的；韵律流畅的；有抑扬顿挫的。"},"examples":[{"en":"Her cadent voice made the story feel like a song.","zh":"她那富有韵律的声音让故事听起来像一首歌。"},{"en":"The poem uses cadent lines to create a calm mood.","zh":"这首诗用有节奏的诗行营造出平静的氛围。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common) Falling or tapering down; descending in a smooth way.","zh":"（较少见）下落的；渐降的；顺势下降的。"},"examples":[{"en":"A cadent melody moved gently toward silence.","zh":"一段渐降的旋律轻轻走向寂静。"}]}],"synonyms":["rhythmic","flowing","melodic","measured","musical"],"phonetic":"/ˈkeɪdənt/","extraExplanation":["“cadent”常见于诗歌、音乐评论或较正式的文学描写里，日常口语里更常用“rhythmic / flowing / melodic”。","词源与拉丁语“cadere”（下落）有关，因此它既可指“有节奏的起伏”，也可引申为“渐渐下落”。","学习提示：它与更常见的名词“cadence”（节奏；抑扬顿挫）同源，可把“cadent”理解为“具有cadence的”。"]}
{"word":"cadentia","summary":{"en":"Cadentia is a rare form related to “cadence,” meaning rhythmic flow in music or speech, and it’s also used as a name.","zh":"Cadentia 是与“cadence（韵律/节奏）”相关的罕见形式，指音乐或语言的节奏感；也常被用作人名或品牌名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A cadence; a falling or rhythmic flow, especially in music, speech, or poetry.","zh":"（罕见）“cadence（韵律/节奏）”的另一种形式；指音乐、讲话或诗歌中的节奏感与抑扬顿挫。"},"examples":[{"en":"The poem’s cadentia makes it easy to read aloud.","zh":"这首诗的韵律感很强，朗读起来很顺畅。"},{"en":"She practiced the cadentia of the chant to keep everyone together.","zh":"她练习那段吟唱的节奏，好让大家保持一致。"}]},{"partOfSpeech":"n.","definition":{"en":"A personal or brand name (used as a proper noun), often chosen for its association with “cadence” and elegance.","zh":"人名或品牌名（专有名词用法），常因联想到“cadence（韵律）”与优雅而被选用。"},"examples":[{"en":"Cadentia is the name of their new music app.","zh":"Cadentia 是他们新音乐应用的名字。"},{"en":"In the novel, Cadentia is a character known for her calm voice.","zh":"在小说里，Cadentia 是一位以声音沉静著称的角色。"}]}],"synonyms":["cadence","rhythm","flow","meter"],"phonetic":"/kəˈdɛnʃiə/","extraExplanation":["“Cadentia”并不是现代英语里常见的标准词形；在一些写作、命名或艺术语境中，它常被当作更具“拉丁感/古典感”的拼写，用来呼应英语 cadent/cadence（与节奏、抑扬顿挫相关）。","如果你是在乐理或诗歌评论中看到它，通常可按“cadence（终止式/韵律）”来理解；具体含义要看上下文。"]}
{"word":"cadential","summary":{"en":"Cadential means ‘related to a cadence’—especially a musical ending or a rhythmic sense of closure.","zh":"Cadential 指“与终止/收束（cadence）有关”，常用于音乐中的乐句结尾，也可形容语言或诗歌的节奏性收束感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Music) relating to a cadence—the chord progression or melodic/harmonic movement that brings a phrase to a pause or sense of completion.","zh":"（音乐）与“终止式/乐句收束”有关的；用于产生停顿或结束感的（和声或旋律进行）。"},"examples":[{"en":"The composer uses a strong cadential progression at the end of the chorus.","zh":"作曲家在副歌结尾使用了强烈的终止式进行。"},{"en":"Listen for the cadential chord that signals the phrase is finished.","zh":"留意那个终止和弦，它提示这一乐句已经结束。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Poetry/literary) having the rhythm or falling pattern of a cadence; sounding like a measured ending.","zh":"（诗歌/文学）具有节奏性收束或“落点”的；听起来像有层次的结尾。"},"examples":[{"en":"Her speech became slow and cadential, like a poem.","zh":"她的讲话变得缓慢而有节奏的收束感，像一首诗。"},{"en":"The paragraph ends in a cadential line that feels final.","zh":"这一段以一句有收束感的句子结尾，让人觉得很有定论。"}]}],"synonyms":["cadence-related","closing","resolving","concluding"],"phonetic":"/kəˈdɛnʃəl/","extraExplanation":["“cadential”来自“cadence（终止/收束）”。在西方音乐里，cadence常指乐句结尾的和声模式（如authentic cadence属‘正格终止’，plagal cadence常被称为‘阿门终止’），用来制造‘到家了/结束了’的听觉感觉。文学里借用这个概念，强调语流的节奏性落点与结尾感。"]}
{"word":"Cadenza","summary":{"en":"A cadenza is a solo, showy passage in classical music (often near the end), or more generally a dramatic flourish or climax.","zh":"Cadenza 指古典音乐中接近结尾的炫技独奏华彩段；也可泛指语言或表演中的戏剧化“华丽高潮/收尾”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In classical music, a solo passage (often virtuosic and expressive) played by a singer or instrumentalist, usually near the end of a movement, sometimes improvised or written out.","zh":"（古典音乐中）华彩段：通常在一个乐章接近结尾处，由独唱或独奏者演奏的华丽、炫技、富于表达的独奏段落，可即兴也可写定。"},"examples":[{"en":"The pianist played a brilliant cadenza before the orchestra returned.","zh":"在乐队重新进入之前，钢琴家演奏了一段精彩的华彩段。"},{"en":"In some concertos, the performer may improvise the cadenza.","zh":"在一些协奏曲中，演奏者可能会即兴创作华彩段。"},{"en":"Her voice soared during the cadenza, showing both control and emotion.","zh":"在华彩段里，她的歌声高亢飞扬，既有控制力又充满情感。"}]},{"partOfSpeech":"n.","definition":{"en":"By extension, any showy or dramatic flourish or climax in speech, writing, or performance.","zh":"（引申）华丽的收尾/高潮：指演讲、写作或表演中夸张、戏剧化的点睛之笔或高潮段。"},"examples":[{"en":"He ended his speech with a rhetorical cadenza that got loud applause.","zh":"他用一段修辞华彩为演讲收尾，赢得了热烈掌声。"},{"en":"The essay builds to a cadenza of ideas in the final paragraph.","zh":"这篇文章在最后一段把观点推向了一个“华彩”般的高潮。"}]}],"synonyms":["solo flourish","virtuoso passage","flourish","climax"],"phonetic":"/kəˈdɛn.zə/","extraExplanation":["“Cadenza”来自意大利语，原意与“结尾/终止”相关（和 cadence“节奏/终止式”同源），因此常出现在乐章结尾附近。","在古典协奏曲里，华彩段往往出现在终止式（cadential）附近：乐队停下来或保持和弦，独奏者用快速音阶、琶音等展示技巧，然后再“带回”乐队。","著名例子：莫扎特、贝多芬的协奏曲常有华彩段；有些版本由作曲家写定，也有后人或演奏家自写华彩。"]}
{"word":"cadenza","summary":{"en":"A cadenza is a dramatic solo passage in classical music—often near the end of a movement—used to show off a performer’s skill; it can also mean a showy flourish in writing or speech.","zh":"cadenza 指古典音乐中的“华彩段”，常在乐章末尾附近用于展示演奏者技巧；也可比喻演讲或写作中炫技式的精彩段落。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In music, a solo passage—often improvised or written to sound improvised—where a performer shows technical skill and expression, especially near the end of a movement in a concerto or aria.","zh":"（音乐）华彩段：常带即兴感的独奏段落，用来展示演奏者的技巧与表现力，尤其常出现在协奏曲或咏叹调某个乐章接近结尾处。"},"examples":[{"en":"The pianist delivered a brilliant cadenza before the orchestra returned.","zh":"在乐队重新进入之前，钢琴家奏出了一段精彩的华彩段。"},{"en":"Many Mozart concertos leave space for a cadenza, so performers may choose their own version.","zh":"许多莫扎特协奏曲会留出华彩段空间，因此演奏者可以选择自己的版本。"},{"en":"Her teacher asked her to practice the cadenza slowly first, then build up speed.","zh":"老师让她先慢练华彩段，再逐渐加快速度。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) A showy, highly expressive “flourish” or highlight moment, especially in speech or writing.","zh":"（比喻）华丽的收尾/炫技式的亮点：指在演讲或写作中刻意强调、富有表现力的“点睛”段落。"},"examples":[{"en":"He ended the speech with a rhetorical cadenza that got a loud applause.","zh":"他用一段充满修辞张力的“华彩式”结尾赢得了热烈掌声。"},{"en":"The final paragraph is a cadenza of emotion, tying all the themes together.","zh":"最后一段像情感的华彩段，把所有主题串联起来。"}]}],"synonyms":["solo passage","flourish","showpiece","embellishment","display"],"phonetic":"/kəˈdɛn.zə/","extraExplanation":["“Cadenza”来自意大利语，原意与“终止/停顿（cadence）”有关：乐队在属和弦等处停住或减弱，让独奏者“独占舞台”进行自由发挥，随后再回到主旋律并收束。","在古典时期（如莫扎特时代）常有即兴华彩段传统；后来许多作曲家（如贝多芬、柴可夫斯基）会把华彩段写得更固定，演奏者也可能选择作曲家版本或其他名家的版本。"]}
{"word":"cadenzas","summary":{"en":"“Cadenzas” is the plural of “cadenza”: a flashy solo passage in classical music (or singing) that highlights the performer, often near the end of a movement.","zh":"“cadenzas”是“cadenza”的复数：指古典音乐或声乐中的炫技华彩乐段，常出现在乐章接近结尾处，用于突出表演者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A showy solo passage in a piece of music (especially in a concerto), often near the end of a movement, where the performer displays skill; it may be written by the composer or improvised.","zh":"（音乐）华彩乐段：常见于协奏曲等作品中、通常接近乐章结尾的炫技独奏段落；可由作曲家写定，也可能由演奏者即兴发挥。"},"examples":[{"en":"In the violin concerto, the soloist played a brilliant cadenza before the orchestra returned.","zh":"在这首小提琴协奏曲中，独奏者在乐队重新进入前演奏了一段华彩乐段。"},{"en":"Some performers improvise the cadenza, while others use the composer’s written version.","zh":"有些演奏者会即兴创作华彩乐段，也有人使用作曲家写好的版本。"}]},{"partOfSpeech":"n.","definition":{"en":"A dramatic flourish or concluding run in singing (especially in opera) that shows off the singer’s range and control.","zh":"（声乐）炫技的花腔/结尾华彩：歌唱中用于展示音域与控制力的戏剧性装饰段落（尤见于歌剧）。"},"examples":[{"en":"The soprano ended the aria with a sparkling cadenza.","zh":"女高音用一段闪亮的华彩收尾了这首咏叹调。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) A speech-like flourish or expressive ending that feels like a climactic ‘final touch.’","zh":"（较少见）类似演讲的修辞性收束/点睛式结尾，用来制造高潮或强调效果。"},"examples":[{"en":"He finished his talk with a short cadenza of praise for the team.","zh":"他在演讲结尾用一小段赞美团队的话作了点睛收束。"}]}],"synonyms":["solo passage","virtuoso passage","flourish","embellishment","ornamentation"],"phonetic":"/kəˈdɛnzəz/","extraExplanation":["“cadenza”来自意大利语，和“cadence（节奏/收束）”同源，核心感觉都是“收尾、落点”。在古典音乐中，华彩乐段常出现在乐章接近结束的停顿处（乐队暂停或弱化），让独奏者集中展示技巧，然后再回到乐队合奏。","复数在英文里常写作“cadenzas”，在更偏意大利语的语境里也可能看到“cadenze”。"]}
{"word":"cader","summary":{"en":"“Cader” is mainly seen in Welsh/UK place names and refers to a “chair/seat,” often used for a mountain name.","zh":"“Cader”主要见于威尔士/英国地名，意为“椅子/座位”，常用于山名等文化语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Welsh/UK place names) a “chair” or “seat,” often used poetically for a mountain shaped like a seat (e.g., Cader Idris in Wales).","zh":"（多见于威尔士/英国地名）“椅子/座位”的意思，常带有诗意地指形状像座椅的山（如威尔士的 Cader Idris）。"},"examples":[{"en":"Cader Idris is a famous mountain in Wales.","zh":"Cader Idris 是威尔士一座很有名的山。"},{"en":"In some older spellings, you may see “Cader” used where modern Welsh uses “Cadair.”","zh":"在一些较旧的拼写里，你可能会看到用“Cader”，而现代威尔士语更常写作“Cadair”。"}]}],"synonyms":["chair (in meaning, not in usage)"],"phonetic":"/ˈkɑːdər/","extraExplanation":["“cader”在现代英语里不是常用词汇，更多是出现在地名或文化语境中（尤其与威尔士有关）。如果你是在日常英文里想表达“干部/核心团队”，很可能是想写 cadre；如果是想写“高尔夫球童/把东西装进小箱”，可能是 caddie/caddy；如果是“提供餐饮”，则是 cater。"]}
{"word":"caderas","summary":{"en":"“caderas” is Spanish for “hips.”","zh":"“caderas”是西班牙语，意思是“髋部／臀部（复数）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of “cadera” (Spanish): the hips (the parts of the body at the sides of your waist; the joint area where your legs connect to your body).","zh":"西班牙语“cadera”的复数：髋部／臀部（腰两侧的部位；腿与身体连接处的关节区域）。"},"examples":[{"en":"Me duelen las caderas después de correr.","zh":"我跑完步后髋部（臀部）很疼。"},{"en":"Puso las manos en las caderas.","zh":"她把手叉在腰上（放在髋部/臀部两侧）。"}]}],"synonyms":["hips","hip joint","pelvis (broader/medical)"],"phonetic":"/hɪps/","extraExplanation":["“caderas”是西班牙语名词复数，单数是“cadera”。在英文里最常对应的是“hips”。常见搭配：\n- hands on your hips（叉腰）\n- hip pain（髋部疼痛）\n- hip joint（髋关节）\n如果语境是舞蹈/走路姿势，也可指“扭胯、摆胯”的动作（move your hips）。"]}
{"word":"cadere","summary":{"en":"cadere means “to fall,” used mainly as an Italian verb and as a Latin root seen in English words like cadence.","zh":"cadere 表示“落下/跌落”，主要是意大利语动词，也常作为拉丁语词根出现在英语词汇中（如 cadence）。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Italian; also a Latin root) to fall; to drop down from a higher place to a lower one.","zh":"（意大利语；也作拉丁语词根）跌落；落下；从高处到低处。"},"examples":[{"en":"Leaves cadere in autumn when the weather turns cold.","zh":"天气转冷时，树叶会在秋天落下。"},{"en":"Be careful—objects can cadere from the shelf if it shakes.","zh":"小心——架子晃动时，东西可能会从上面掉下来。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Italian; figurative) to fall (into a state), such as a mistake, silence, or temptation.","zh":"（意大利语；比喻）陷入（某种状态），如错误、沉默或诱惑。"},"examples":[{"en":"He cadere into silence after hearing the news.","zh":"听到消息后，他陷入沉默。"},{"en":"Try not to cadere into the same mistake again.","zh":"尽量别再犯同样的错误。"}]}],"synonyms":["fall","drop","descend"],"phonetic":"/kɑˈdɛre/","extraExplanation":["“cadere”在拉丁语中是“跌落、落下”的动词词根，影响了不少英语词汇：\n- cadence（节奏、韵律）：原义与“下落/落点”相关，引申为语调的“起落”。\n- cadent（趋于终止的、下落的）：常见于文学或正式语境。\n- accident（意外）：源头含“发生/降临”的概念，后来固定为“意外事件”。\n在英语学习中，把它当作“fall（落下）”的词根来记，会更有帮助。"]}
{"word":"Cades","summary":{"en":"“Cades” most commonly means the plural of “cade,” an old-fashioned word for a hand-raised (often bottle-fed) young animal, especially a lamb.","zh":"“Cades”最常见的意思是“cade”的复数：一个较旧用法，指人工哺育（常用奶瓶喂养）的幼兽，尤指小羊。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “cade”: a young animal (especially a lamb) that was raised by hand rather than by its mother; also used for an animal that has become very tame from being hand-fed (old-fashioned).","zh":"“cade”的复数：指（尤指小羊等）不是由母兽哺育、而是由人手工喂养长大的幼兽；也可指因被人喂养而变得非常亲人的动物（较旧用法）。"},"examples":[{"en":"The farmer bottle-fed two cades after their mothers died.","zh":"母兽死后，农夫用奶瓶喂养了两只人工哺育的小羊。"},{"en":"Because they were cades, the lambs followed people around the yard.","zh":"因为是人工哺育的小羊，它们在院子里总爱跟着人走。"}]},{"partOfSpeech":"adj.","definition":{"en":"a rare adjective meaning “hand-raised; tame because of being hand-fed” (old-fashioned).","zh":"罕见形容词：指“人工哺育的；因被人喂养而亲人、驯化的”（较旧用法）。"},"examples":[{"en":"The cade lamb was gentle and unafraid of strangers.","zh":"那只人工哺育的小羊很温顺，也不怕生人。"}]}],"synonyms":["hand-raised animals","bottle-fed lambs"],"phonetic":"/keɪdz/","extraExplanation":["“cade”主要见于英式/苏格兰地区的旧用法与农业语境里；在现代日常英语中不常见。很多人第一次看到“cades”会以为是拼写错误（如 cadence /keɪdən(t)s/），但它确实是一个真实词的复数形式。","如果你指的是专有名词（例如姓氏 Cades，或地名/机构名），那它通常不翻译为普通词义，需要结合具体语境来解释。"]}
{"word":"cades","summary":{"en":"“Cades” is usually the plural of the rare word “cade” (an orphaned, human-raised lamb), and it can also be a surname or a U.S. place name (e.g., Cades Cove).","zh":"“cades”通常是罕见词“cade”的复数，指被母体遗弃、由人喂养的幼畜（尤指羔羊）；也可能是姓氏或美国地名（如 Cades Cove/凯兹谷）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “cade”: an animal (especially a lamb) that was abandoned by its mother and is raised by people.","zh":"“cade”的复数：指（尤指）被母体遗弃、由人类喂养长大的幼畜，特别是羔羊。"},"examples":[{"en":"The farmer bottle-fed the cades every morning.","zh":"农夫每天早上用奶瓶喂那些被遗弃的人养羔羊。"},{"en":"During lambing season, a few cades may need extra care.","zh":"产羔季节里，可能会有几只“人养羔羊”需要额外照顾。"}]},{"partOfSpeech":"other","definition":{"en":"a family name (surname), or a place name in the U.S. (most famously in “Cades Cove” in Great Smoky Mountains National Park).","zh":"一个姓氏；或美国的地名（最著名的是大烟山国家公园的“Cades Cove/凯兹谷”）。"},"examples":[{"en":"We drove through Cades Cove to see deer and historic cabins.","zh":"我们开车穿过凯兹谷看鹿和历史小木屋。"},{"en":"Cades is a surname you might see in Hawaii and the mainland U.S.","zh":"Cades 是一个你可能在夏威夷和美国本土都见到的姓氏。"}]}],"synonyms":["orphan lambs","bottle-fed lambs"],"phonetic":"/keɪdz/","extraExplanation":["“cade”这个词在现代日常英语里非常少见，多出现在农业/畜牧语境中；更常见的相关表达是“orphan lamb（孤儿羊羔）”“bottle-fed lamb（奶瓶喂养的羊羔）”。","如果你本来想查的是“cadets（军校学员/少年军）”，拼写很接近：cadet /kəˈdɛt/（而不是 /keɪd/）。你可以告诉我你看到“cades”的句子，我也可以帮你判断具体指哪一种。"]}
{"word":"cadesse","summary":{"en":"“cadesse” is an Italian verb form meaning “(that) he/she/it might fall / were to fall.”","zh":"“cadesse”是意大利语动词形式，意思是“（他/她/它）可能会跌倒/会掉下去（用于假设或不确定情境）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Italian) “cadesse” = third-person singular imperfect subjunctive of *cadere* (“to fall”). It’s used in situations that are hypothetical, doubtful, or dependent on another past-tense action—roughly “(that) he/she/it might fall / were to fall.”","zh":"（意大利语）“cadesse”是动词 *cadere*（“跌倒/掉落”）的未完成过去虚拟式第三人称单数，用于表示在过去语境中的假设、不确定或从属情形，大致相当于“（他/她/它）可能会跌倒/会掉下去/若是跌倒的话”。"},"examples":[{"en":"Temeva che il bambino cadesse dalle scale.","zh":"他/她害怕孩子会从楼梯上摔下去。"},{"en":"Se cadesse, si farebbe male.","zh":"如果他/她摔倒了，就会受伤。"},{"en":"Era importante che nessuno cadesse durante la cerimonia.","zh":"在仪式期间，重要的是不要有人摔倒。"}]}],"synonyms":["precipitasse","crollasse","cascasse"],"phonetic":"/kɑˈdɛs.eɪ/","extraExplanation":["这是意大利语里的“虚拟式（congiuntivo）未完成过去（imperfetto）”，常见结构包括：\n- 过去的情绪/想法/担心 + che + congiuntivo imperfetto：*temevo che… cadesse*\n- “如果……就……”的假设句：*se … cadesse, …*（更偏不确定或假设情境）\n它并不是英语单词；如果你本来想查英语“cadence”（节奏/韵律），告诉我我也可以一起解释。"]}
{"word":"Cadet","summary":{"en":"A cadet is mainly a trainee preparing to become an officer, especially in the military or police.","zh":"cadet 主要指军队或警察等机构中正在受训、准备成为军官的学员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a student or trainee preparing to become an officer in the military, police, or a similar organization","zh":"（军队、警察等机构的）军官候补生；学员；警校/军校学员"},"examples":[{"en":"She is a cadet at the military academy.","zh":"她是军校的学员。"},{"en":"The police cadets practiced giving clear instructions.","zh":"警校学员练习清晰地下达指令。"}]},{"partOfSpeech":"n.","definition":{"en":"a younger son in a family (an older, less common meaning)","zh":"（较少用）家中的幼子；次子"},"examples":[{"en":"In older texts, a cadet might refer to a younger son who did not inherit the main estate.","zh":"在较早的文本中，cadet 可指未继承主要家产的次子。"}]}],"synonyms":["trainee","recruit","officer candidate","academy student"],"phonetic":"/kəˈdɛt/","extraExplanation":["词源上与法语有关，原意接近“年幼的/年少的”，所以后来引申出“年少的儿子（次子）”，再进一步用于“年轻的军官学员”。现代最常见用法是指军校、警校或类似组织中的见习人员。","常见搭配：cadet corps（学员团/军训团）、cadet program（学员项目）、military/police cadet（军校/警校学员）。"]}
{"word":"cadet","summary":{"en":"A cadet is a trainee in the military, police, or a similar service, and can also mean a young trainee in other structured programs.","zh":"cadet 指军队、警察等机构的学员/见习人员，也可指其他体系化项目中的见习生。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A student or trainee preparing to become a military officer, police officer, or member of another uniformed service.","zh":"（军队、警察等制服机构的）学员；候补军官/警员（在受训中）"},"examples":[{"en":"She joined the military academy as a cadet at eighteen.","zh":"她十八岁进入军校，成为一名学员。"},{"en":"The police cadets practiced marching and basic self-defense.","zh":"警校学员练习队列和基础防身术。"},{"en":"As a cadet, he had to follow strict rules about punctuality and uniform.","zh":"作为学员，他必须遵守关于守时和着装的严格规定。"}]},{"partOfSpeech":"n.","definition":{"en":"A young person training for a particular career, especially in a structured program (for example, aviation or public service).","zh":"（尤指在有体系的项目中）见习生；受训新人（如飞行、公共服务等）"},"examples":[{"en":"He worked as an airline cadet before becoming a full pilot.","zh":"他在成为正式飞行员之前做过航空见习学员。"},{"en":"The program recruits cadets from different regions to promote leadership skills.","zh":"该项目从不同地区招募见习学员，以培养领导力。"}]},{"partOfSpeech":"n.","definition":{"en":"A younger son or a younger branch of a family (a more formal, traditional use).","zh":"（较正式/传统用法）幼子；家族旁支中的年轻成员"},"examples":[{"en":"In old novels, a cadet of the family might seek a career in the army.","zh":"在一些旧小说里，家族的幼子可能会选择从军作为出路。"},{"en":"He was a cadet branch member with less claim to the family estate.","zh":"他来自家族的旁支，对家产的继承权较弱。"}]}],"synonyms":["trainee","recruit","student officer","apprentice"],"phonetic":"/kəˈdɛt/","extraExplanation":["“cadet”常见于军校（military academy）、军训（training）、警校（police academy）等语境。日常说“a cadet”通常指正在受训、级别低于正式军官/警员的人。","词源来自法语，原意与“年轻、较小（younger）”有关，所以也发展出“幼子/旁支”这种较文学化的含义。"]}
{"word":"cadetcy","summary":{"en":"Cadetcy means the state or period of being a cadet; historically it can also mean being a younger son or a junior branch of a family.","zh":"cadetcy 指“学员身份/学员时期”；历史上也可指“次子或家族旁支的身份”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the status, position, or period of being a cadet (a trainee officer or a student in a military/police academy).","zh":"（军校/警校等的）学员身份；军校生（或警校生）的地位/任期。"},"examples":[{"en":"She entered the academy and began her cadetcy last fall.","zh":"她进入学院，去年秋天开始了她的学员生涯。"},{"en":"During his cadetcy, he learned discipline, teamwork, and leadership.","zh":"在学员期间，他学会了纪律、团队合作和领导力。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical, less common) the position of a younger son in a family; the condition of being a cadet (junior branch) of a noble family.","zh":"（历史义，较少见）家中幼子或旁支的身份；贵族家族“次子/旁系”地位。"},"examples":[{"en":"In some aristocratic families, cadetcy meant fewer inheritance rights.","zh":"在一些贵族家庭中，次子/旁系的身份意味着更少的继承权。"}]}],"synonyms":["cadetship","traineeship","apprenticeship"],"phonetic":"/kəˈdɛtsi/","extraExplanation":["“cadetcy”由“cadet（学员/次子）+ -cy（表示状态或身份的名词后缀，如 privacy, accuracy）”构成。","在现代英语中，这个词不算常用；更常见的说法是“cadetship”或直接说“time as a cadet / being a cadet”。"]}
{"word":"cadets","summary":{"en":"Cadets are trainees—often in the military, police, or youth programs—who are learning skills and preparing for official roles.","zh":"cadets 指正在受训的学员，常见于军队、警察或少年训练项目中，学习技能并为正式岗位做准备。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A student or trainee preparing to become an officer in the military, police, or a similar organization (plural of cadet).","zh":"（cadet 的复数）军队、警察等机构中正在受训、准备成为军官/正式人员的学员。"},"examples":[{"en":"The cadets march across the parade ground every morning.","zh":"这些军校学员每天早晨在阅兵场上列队行进。"},{"en":"The police academy cadets learned how to handle emergencies.","zh":"警校学员学习如何处理紧急情况。"}]},{"partOfSpeech":"n.","definition":{"en":"Young members of a youth training program that teaches discipline, leadership, and basic skills (often linked to the military).","zh":"青少年训练项目的成员（常与军方相关），学习纪律、领导力和基础技能。"},"examples":[{"en":"The cadets went camping and practiced first aid.","zh":"这些少年团学员去露营并练习急救。"},{"en":"As cadets, they wore uniforms during community events.","zh":"作为少年团学员，他们在社区活动中会穿制服。"}]}],"synonyms":["trainees","recruits","students","learners"],"phonetic":"/kəˈdɛts/","extraExplanation":["“cadet”常见于军事院校或警察学院语境，例如美国的 West Point（西点军校）学生常被称为 cadets；不同国家也有类似的“少年军/少年警”项目，英语里也会用 cadets 来指这些青少年成员。","词源上与法语有关，早期含义有“较年轻/较低级的成员”的意思，因此在某些组织或公司里也可能用 cadet 表示“年轻/资历较浅的成员”（较少见）。"]}
{"word":"cadetship","summary":{"en":"Cadetship means being a cadet or the training period/position for a cadet, often in military, police, or professional training programs.","zh":"Cadetship 指学员身份（名额/职位）或学员培训期，常见于军队、警察或职业培养项目。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A period of training or an official position as a cadet (a trainee), especially in the military, police, or some professional programs.","zh":"见习生（学员）的培训期或正式学员身份（职位），尤指军队、警察等系统，或某些职业培养项目。"},"examples":[{"en":"She won a naval cadetship after passing the entrance exams.","zh":"她通过入学考试后获得了海军学员资格（军校学员名额）。"},{"en":"The airline offers cadetships for young pilots in training.","zh":"这家航空公司为年轻飞行员学员提供见习培养项目（cadetship）。"}]}],"synonyms":["traineeship","apprenticeship","internship","training program"],"phonetic":"/kəˈdɛtʃɪp/","extraExplanation":["“cadetship”由“cadet（学员/军校生/见习人员）+ -ship（表示身份、职位或状态）”构成，因此它既可指“当学员的身份/名额”，也可指“做学员的那段训练期”。在英联邦国家（如英国、澳大利亚）中更常见，也常出现在政府或大型机构的“定向培养/带薪培养”项目名称里。"]}
{"word":"cadette","summary":{"en":"Cadette usually means a female cadet; in the U.S., it can also mean a Girl Scouts member at the middle-school (Cadette) level.","zh":"Cadette通常指“女学员/女军校生”；在美国也可特指女童子军的Cadette（初中阶段）级别成员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a girl or young woman who is training to be an officer, or a female member of a cadet program (a youth military-style training organization)","zh":"（军官）见习生；（青少年军训/少年军校组织中的）女学员"},"examples":[{"en":"She joined the school’s cadet corps as a cadette and learned basic drill and leadership.","zh":"她以女学员身份加入了学校的少年军训队，学习了基本队列和领导力。"},{"en":"The cadette marched proudly during the ceremony.","zh":"那位女学员在仪式上自豪地行进。"}]},{"partOfSpeech":"n.","definition":{"en":"(U.S.) a Girl Scouts Cadette: a Girl Scout in the middle-school level (typically grades 6–8)","zh":"（美国）女童子军“Cadette”级别成员：通常指初中阶段（约6–8年级）的女童子军"},"examples":[{"en":"As a Girl Scouts Cadette, Maya planned a community service project with her troop.","zh":"作为女童子军Cadette级成员，玛雅和她的小队一起策划了一个社区服务项目。"},{"en":"Cadettes often work on badges that build independence and teamwork.","zh":"Cadette级成员常完成一些徽章项目，用来培养独立性和团队合作。"}]}],"synonyms":["cadet","trainee","Girl Scout (Cadette level)"],"phonetic":"/kəˈdɛt/","extraExplanation":["“cadette”是“cadet”的阴性/女性形式，词源与法语有关（cadet 原指家中较小的儿子，后来引申为“军校学员/见习军官”）。现代英语里更常用不分性别的“cadet”，但在某些组织或语境中仍会看到“cadette”。","在美国语境里，首字母大写的“Cadette”常特指女童子军的一个年龄段/等级（通常为初中）。如果是在女童子军话题中出现，优先按这个含义理解。"]}
{"word":"cadettes","summary":{"en":"“Cadettes” means female cadets or, in some youth groups, girls at the Cadette level.","zh":"“cadettes”指女学员；也可指某些青少年组织（如女童军）中处于 Cadette 等级的女孩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Female cadets; women or girls in military or police training, or in a youth organization (such as Girl Scouts) at a cadet/cadette level.","zh":"（cadette 的复数）女学员；（军警等）受训的女学员；或青少年组织（如美国女童军）中处于“Cadette”阶段的女孩。"},"examples":[{"en":"The cadettes marched in formation during the academy ceremony.","zh":"这些女学员在学院典礼上列队行进。"},{"en":"She volunteered as a leader for a troop of Girl Scout Cadettes.","zh":"她自愿担任一支女童军 Cadettes 小队的领队。"}]}],"synonyms":["female cadets","trainees","recruits"],"phonetic":"/kəˈdɛts/","extraExplanation":["“cadette”源自法语，带有“较年轻/次一级成员”的含义；在英语里常见于军校、警校等训练环境，也常用于美国女童军（Girl Scouts）中一个年龄段/等级的名称（Cadette）。在不同国家或机构中，具体称呼和等级可能略有差异。"]}
{"word":"cadew","summary":{"en":"“Cadew” isn’t a standard English word; it’s likely a typo or a name (often intended: “cadet”).","zh":"“cadew”不是标准英语词；多半是拼写错误或人名（常见想写的是“cadet”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a misspelling or a name. If you meant a common word, possibilities include “cadet” (a trainee soldier/police officer) or “Cade” (a surname/given name).","zh":"不是标准英语单词；更可能是拼写错误或人名。如果你想查常见词，可能是“cadet”（军校/警校学员）或“Cade”（人名/姓氏）。"},"examples":[{"en":"I couldn’t find “cadew” in a dictionary—did you mean “cadet”?","zh":"我在词典里找不到“cadew”——你是不是想写“cadet”？"},{"en":"Cade is used as a person’s name in English-speaking countries.","zh":"Cade在英语国家里可用作人名。"}]}],"synonyms":["cadet (possible intended word)","Cade (name)"],"phonetic":"/kəˈdɛt/","extraExplanation":["“cadew”在常见英语词典中通常查不到。如果你能提供一句包含它的原句、语境（聊天、游戏ID、地名、人名等）或你想表达的意思/发音，我可以更准确判断你要找的词。","最可能的拼写目标之一是“cadet”（/kəˈdɛt/，军校生/见习军官/警校学员）。如果你确认要查的是别的词，也可以告诉我相近拼写（例如cade、caddy、cawed等）。"]}
{"word":"cadge","summary":{"en":"“Cadge” means to get things by begging or repeatedly asking (often in an annoying or shameless way), or to borrow/obtain informally; it can also mean a freeloader.","zh":"“cadge”指（常带点贬义地）讨要/乞求以弄到东西，或非正式地借用/蹭到；也可指爱占便宜的人。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to get something (especially money, food, or favors) by asking repeatedly, begging, or using persuasion; often seen as mildly annoying or shameless","zh":"（尤指钱、食物或人情）反复讨要、乞求或靠说服手段弄到；常带有“厚着脸皮/有点烦人”的语气"},"examples":[{"en":"He cadged a few dollars from his friends to buy lunch.","zh":"他向朋友们讨了几块钱买午饭。"},{"en":"Stop cadging cigarettes—just buy your own.","zh":"别老是讨烟了——自己去买。"},{"en":"She didn’t mean to cadge; she was genuinely short of cash that day.","zh":"她并不是想厚着脸皮讨要；那天她确实手头很紧。"}]},{"partOfSpeech":"v.","definition":{"en":"to obtain or borrow something informally (sometimes without permission), often by taking advantage of someone’s kindness","zh":"（非正式地）借用/弄到某物（有时未征得同意）；常指利用别人的好心"},"examples":[{"en":"Can I cadge a pen for a minute?","zh":"我能借支笔用一下吗？"},{"en":"He cadged a ride home after the party.","zh":"聚会后他搭了别人的顺风车回家。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who regularly cadges; a beggar or freeloader (informal, often disapproving)","zh":"经常讨要的人；乞讨者/占便宜的人（非正式，常含贬义）"},"examples":[{"en":"Don’t be a cadge—help out or pay your share.","zh":"别当伸手党——要么帮忙，要么出你那份钱。"}]}],"synonyms":["bum","scrounge","mooch","beg","freeload"],"phonetic":"/kædʒ/","extraExplanation":["“cadge”在英式英语里更常见，语气偏口语、带一点不赞同的评价：不是正式的“borrow（借）”，更像“老是伸手要/占便宜”。","常见搭配：cadge money/cigarettes/a lift（讨钱/讨烟/蹭顺风车）。日常更中性的说法可以用：borrow, ask for, get a ride。"]}
{"word":"cadged","summary":{"en":"“Cadged” is the past form of “cadge,” meaning to scrounge or mooch—asking for or getting something informally, often in a slightly shameless way.","zh":"“cadged”是“cadge”的过去式/过去分词，表示“蹭、讨要、白拿”，带一点口语和轻微负面语气。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense / past participle of “cadge”) to ask for something, especially money, food, or cigarettes, in a way that is informal and a bit shameless; to scrounge or mooch.","zh":"（“cadge”的过去式/过去分词）以比较不害臊、随便的方式讨要（钱、食物、香烟等）；蹭、占便宜。"},"examples":[{"en":"He cadged a cigarette from a stranger outside the station.","zh":"他在车站外向陌生人讨（蹭）了一支烟。"},{"en":"We were broke, so we cadged a ride back home.","zh":"我们没钱了，所以就蹭了辆车回家。"},{"en":"She cadged food from her roommates during finals week.","zh":"期末周她从室友那里蹭吃的。"}]},{"partOfSpeech":"vt.","definition":{"en":"(past tense / past participle of “cadge”) to get something by repeatedly asking or by persuading others to share, often without intending to pay or return the favor.","zh":"（“cadge”的过去式/过去分词）通过反复开口或说服别人来得到东西，通常不太打算付钱或回报。"},"examples":[{"en":"He cadged meals all week and never offered to pay.","zh":"他一整周都在蹭饭，却从不主动说要付钱。"},{"en":"They cadged free tickets by claiming it was their birthday.","zh":"他们借口说是生日，蹭到了免费票。"}]}],"synonyms":["mooched","scrounged","begged","hit up (informal)","freeloaded (often stronger)"],"phonetic":"/kædʒd/","extraExplanation":["“cadge”在英式英语里更常见，语气偏口语，常带一点负面评价（像“蹭”“白拿”）。正式写作中可用“beg / solicit / obtain”视语境替换。","词源上与旧时指“背着东西到处跑、讨生活的人”的用法有关，所以带有“游荡、讨要”的感觉。"]}
{"word":"cadger","summary":{"en":"“Cadger” means a person who mooches or begs for things, or the act of scrounging something from others.","zh":"“cadger”指爱占便宜、总向人讨要东西的人，也可作动词表示“讨要/白拿/蹭”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who repeatedly asks for things (money, food, favors) in an annoying way; a mooch or beggar","zh":"（反复纠缠式地）向人讨要东西的人；爱占便宜的人；乞讨者"},"examples":[{"en":"He’s not dangerous, just a cadger who’s always asking strangers for cigarettes.","zh":"他不危险，只是个老爱向陌生人讨烟的讨要者。"},{"en":"Don’t be a cadger—offer to pay your share.","zh":"别老占便宜——该你出的钱就主动付。"}]},{"partOfSpeech":"v.","definition":{"en":"to get things by begging, borrowing, or pressuring others, often without paying or returning them; to scrounge","zh":"（常带贬义）靠讨要、借用或软磨硬泡弄到东西；骗要；白拿"},"examples":[{"en":"He cadged a ride to the station from a coworker.","zh":"他软磨硬泡让同事顺路送他去车站。"},{"en":"I’m tired of people cadging snacks from my desk.","zh":"我受够了别人老从我桌上讨零食。"}]}],"synonyms":["moocher","freeloader","scrounger","beggar","sponger"],"phonetic":"/ˈkædʒɚ/","extraExplanation":["“cadger”在英式英语里更常见，语气通常不太礼貌，带有“总想不付出就得到”的批评意味。日常更常用的近义表达有“moocher / freeloader / scrounger”。","常见搭配：cadge a cigarette / cadge money / cadge a lift(英)/cadge a ride(美)（讨烟、讨钱、蹭车）。"]}
{"word":"cadgers","summary":{"en":"“Cadgers” means people who habitually beg or try to get things for free; as a verb, “to cadge” means to obtain by persistent asking.","zh":"“cadgers”指经常讨要或爱占便宜的人；动词“cadge”指通过不断开口（常想白拿）来获得。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who tries to get things (money, food, favors) by begging or persistently asking, often in an annoying way","zh":"（常带贬义）靠讨要或死缠烂打来获得钱、食物或好处的人；讨便宜的人"},"examples":[{"en":"He’s a cadger who’s always asking coworkers for free lunches.","zh":"他老爱向同事讨免费的午餐，像个讨便宜的人。"},{"en":"Don’t be a cadger—offer to pay your share.","zh":"别当伸手党——该付的份额要主动付。"}]},{"partOfSpeech":"v.","definition":{"en":"to beg for something or get it by persistently asking (often for free)","zh":"（常带贬义）讨要；死缠烂打地要（通常想白拿）"},"examples":[{"en":"He cadged cigarettes from strangers outside the store.","zh":"他在商店外向陌生人讨烟。"},{"en":"I cadged a ride home after my car broke down.","zh":"我车坏了之后厚着脸皮讨了个顺风车回家。"}]}],"synonyms":["beggar","moocher","freeloader","sponger","scrounger"],"phonetic":"/ˈkædʒər/","extraExplanation":["“cadgers”是“cadger”的复数。日常更常见的动词形式是“cadge”。","这个词在英式英语里更常见，语气通常不太友好，暗示对方爱占便宜或不断索取。","词源与苏格兰/英格兰方言有关，早期与挑担、赶驮马的人（运货者）相关，后来语义逐渐转为“到处讨要/蹭”。"]}
{"word":"cadges","summary":{"en":"“Cadges” is the third-person singular form of “cadge,” meaning to scrounge or get things by repeatedly asking, often in an annoying way.","zh":"“cadges”是动词“cadge”的第三人称单数，指（常带烦人或不体面的感觉）反复讨要/白要东西、揩油。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to get something (money, food, a ride, etc.) by asking for it repeatedly, often in an annoying or shameless way; to scrounge","zh":"（常指厚着脸皮或反复央求）讨要、白要（钱、食物、搭便车等）；揩油"},"examples":[{"en":"He’s always cadging cigarettes from his coworkers.","zh":"他总是向同事讨烟抽。"},{"en":"Can I cadge a ride to the station?","zh":"我能搭你的车去车站吗？"},{"en":"Stop cadging money off your friends.","zh":"别再向朋友们讨钱/揩油了。"}]},{"partOfSpeech":"vi.","definition":{"en":"(less common) to live by begging or sponging off others","zh":"（不太常见）靠乞讨或靠别人接济过日子"},"examples":[{"en":"He drifted from town to town, cadging meals wherever he could.","zh":"他在各城镇之间漂泊，能在哪儿讨到饭就在哪儿吃。"}]}],"synonyms":["scrounge","bum","mooch","cadge for"],"phonetic":"/kædʒ/","extraExplanation":["“cadge”多为英式口语，但在美式英语里也能听到；语气通常偏负面，暗示让人觉得烦或不体面。若只是礼貌地请求，可以用“ask for / borrow / could I get…?”等更中性表达。"]}
{"word":"cadgily","summary":{"en":"“Cadgily” means “in a mooching/begging way,” trying to get things for free.","zh":"“cadgily”表示“以讨要、白拿白要（蹭）的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a cadging way; by begging, mooching, or trying to get things for free (often in an annoying or shameless manner).","zh":"以讨要/蹭要的方式；通过乞讨、白拿白要或“蹭”来得到东西（常带令人反感或不知羞耻的语气）。"},"examples":[{"en":"He cadgily asked everyone at the party for a cigarette.","zh":"他在派对上到处讨烟抽，显得很“蹭”。"},{"en":"She lived cadgily off her friends’ generosity for months.","zh":"她靠朋友们的慷慨白吃白住了好几个月。"}]}],"synonyms":["shamelessly","importunately","by mooching","beggingly"],"phonetic":"/ˈkædʒɪli/","extraExplanation":["“cadgily”来自动词“cadge”（讨要、白拿白要、蹭），属于较少见的副词形式。日常英语里更常用的说法是：“in a cadging way / shamelessly / by mooching”。","语气通常偏负面：暗示对方不愿付出、爱占便宜，或反复向人索取。使用时要注意礼貌与场合。"]}
{"word":"cadginess","summary":{"en":"Caginess means being cautious or evasive, especially about sharing information.","zh":"Caginess 指对信息保持谨慎或回避的态度，常见于不愿多说的语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being careful and not saying or showing too much; cautious or slightly secretive behavior","zh":"（言行上）谨慎、保守；不轻易透露信息的态度"},"examples":[{"en":"The manager’s caginess about the budget made the team nervous.","zh":"经理对预算讳莫如深的态度让团队很紧张。"},{"en":"Her caginess in interviews suggests the deal isn’t final yet.","zh":"她在采访中的谨慎回避表明交易可能还没最终敲定。"},{"en":"Don’t mistake his caginess for rudeness—he’s just being careful.","zh":"别把他的谨慎保留当成无礼——他只是小心而已。"}]}],"synonyms":["caution","wariness","evasiveness","reserve","guardedness"],"phonetic":"/ˈkeɪdʒinəs/","extraExplanation":["你输入的“cadginess”在英语里非常少见，通常是拼写误差；更常见的词是“caginess”，来自形容词“cagey”（谨慎的、守口如瓶的）。在新闻、商业谈判、采访语境中很常用，强调“说得很少、留有余地”。","“cagey/caginess”有时带一点负面意味：不仅是谨慎，也可能让人觉得在“故意回避”或“不够坦诚”。具体好坏要看语境。"]}
{"word":"cadging","summary":{"en":"“Cadging” means getting small things or favors by repeatedly asking or mooching, often in a slightly negative, informal sense.","zh":"“cadging”指反复开口或软磨硬泡去讨、去蹭一些小东西或人情，常带点贬义、口语色彩。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to get things (especially small amounts of money, food, or favors) by begging, asking repeatedly, or using informal pressure; to mooch","zh":"（尤指为一点钱、食物或小恩惠）靠讨要、反复开口或软磨硬泡来弄到；蹭、讨"},"examples":[{"en":"He’s always cadging cigarettes from his coworkers.","zh":"他总是向同事蹭烟。"},{"en":"I don’t mind sharing, but I’m tired of people cadging free rides every day.","zh":"我不介意分享，但我受够了有人天天来蹭车。"},{"en":"She cadged a few dollars to pay for the bus.","zh":"她讨了几美元来付公交车费。"}]},{"partOfSpeech":"vi.","definition":{"en":"(less common) to live by getting things for free from others; to sponge off people","zh":"（较少见）靠占便宜、白拿白用过日子；吃白食"},"examples":[{"en":"During college he was cadging at friends’ apartments, sleeping on couches.","zh":"上大学时他常在朋友家白住，睡沙发。"}]}],"synonyms":["mooch","scrounge","bum","sponge","freeload"],"phonetic":"/ˈkædʒɪŋ/","extraExplanation":["“cadge”是偏口语、带贬义色彩的词，常暗示“厚着脸皮”“占便宜”。比“borrow”更不礼貌；比“beg”更像日常小事（比如蹭烟、蹭饭、蹭车）。","在英式英语里更常见；美式英语里也能用，但更口语化，常可用“mooch”替换。"]}
{"word":"cadgy","summary":{"en":"Cadgy is a Scottish informal adjective meaning cheerful/lively or comfortably cozy.","zh":"Cadgy是苏格兰英语中的非正式形容词，表示“愉快活泼”或“舒服惬意、暖和舒适”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Scottish, informal) Cheerful; lively; in good spirits.","zh":"（苏格兰英语，非正式）愉快的；活泼的；兴致很高的。"},"examples":[{"en":"Despite the rain, she stayed cadgy and kept everyone laughing.","zh":"尽管下雨，她还是很cadgy，让大家一直笑个不停。"},{"en":"He sounded cadgy after hearing the good news.","zh":"听到好消息后，他听起来很cadgy。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Scottish, informal) Comfortable; cozy; pleasantly snug.","zh":"（苏格兰英语，非正式）舒服的；惬意的；温暖舒适的。"},"examples":[{"en":"We were cadgy by the fire after a long walk.","zh":"走了很久后，我们在火炉边觉得很cadgy、很舒服。"},{"en":"This little room feels cadgy on a cold night.","zh":"寒冷的夜晚，这个小房间让人感觉很cadgy、很暖和。"}]}],"synonyms":["cheerful","jolly","lively","in good spirits","cozy","snug"],"phonetic":"/ˈkædʒi/","extraExplanation":["“cadgy”主要见于苏格兰英语（Scots/Scottish English），在日常口语里带一点亲切、地方色彩。","它常用来形容人的精神状态（开心、来劲），也可以形容环境带来的“舒服、暖和、惬意”的感觉。"]}
{"word":"cadi","summary":{"en":"A cadi is a Muslim judge who rules according to Islamic law (Sharia).","zh":"cadi 指按伊斯兰教法（沙里亚）裁决案件的穆斯林法官。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Muslim judge who makes decisions according to Islamic law (Sharia); also spelled qadi.","zh":"（伊斯兰法）法官；按伊斯兰教法（沙里亚）裁决案件的人（也拼作 qadi）。"},"examples":[{"en":"In the story, the cadi settles a dispute between two merchants.","zh":"在故事里，这位 cadi 处理了两位商人之间的纠纷。"},{"en":"They brought the case to the cadi for a ruling.","zh":"他们把案件提交给 cadi 裁决。"}]}],"synonyms":["qadi","judge","magistrate"],"phonetic":"/ˈkɑːdi/","extraExplanation":["“cadi”多见于历史、文学或介绍伊斯兰文化的英文文本中，是从阿拉伯语经法语等语言进入英语的拼写形式；现代英语更常用拼写是“qadi”。","cadi 的职责类似“法官/裁判官”，但其裁决传统上与宗教法体系相关；在不同国家与历史时期，其具体权限会有差异。"]}
{"word":"cadie","summary":{"en":"“Cadie” is usually a variant spelling of “caddie,” meaning a golf assistant (or to work as one).","zh":"“cadie”通常是“caddie”的拼写变体，意思是高尔夫球童（或当球童）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who carries a golfer’s clubs and gives help or advice during a round of golf","zh":"（高尔夫）球童；为球手背球包并提供协助或建议的人"},"examples":[{"en":"The golfer thanked his caddie for choosing the right club.","zh":"球手感谢球童帮他选对了球杆。"},{"en":"Having an experienced caddie can make the course feel less intimidating.","zh":"有经验的球童能让球场没那么令人紧张。"}]},{"partOfSpeech":"v.","definition":{"en":"to work as a golf caddie; to carry a golfer’s clubs and assist during play","zh":"当球童；为球手背球包并在比赛中提供协助"},"examples":[{"en":"He caddied at the local golf course during the summer.","zh":"他夏天在本地高尔夫球场当球童。"},{"en":"She caddies for her older brother in weekend tournaments.","zh":"她在周末比赛中给哥哥当球童。"}]}],"synonyms":["caddie","caddy","golf assistant"],"phonetic":"/ˈkædi/","extraExplanation":["“cadie”在英语里不如“caddie/caddy”常见，通常被视为拼写变体或拼写错误。标准写法更常用“caddie”（指球童）或“caddy”（也可指收纳架，如tea caddy“茶叶罐/茶叶盒”）。","词源与“cad”有关，早期指“跑腿/打杂的人”，后来在苏格兰英语中发展出高尔夫“球童”的含义。"]}
{"word":"cadilesker","summary":{"en":"Cadilesker (more commonly spelled kadiasker/kazasker) refers to a top Ottoman judge, especially the chief military judge.","zh":"cadilesker（更常见拼写为 kadiasker/kazasker）指奥斯曼帝国的高级法官，尤指首席军法官。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A high-ranking judge in the Ottoman Empire, especially a chief military judge who dealt with legal matters for the army and senior administration.","zh":"（奥斯曼帝国）高级法官，尤指“军法大法官/首席军法官”，负责军队及高级行政相关的法律事务。"},"examples":[{"en":"In Ottoman records, the kadilesker often signed important legal appointments.","zh":"在奥斯曼帝国的档案中，kadilesker 常常在重要的法律任命文件上签署。"},{"en":"The dispute was brought before the kadilesker because it involved military land rights.","zh":"由于涉及军队土地权利，这起纠纷被提交给 kadilesker 裁决。"}]}],"synonyms":["kadiasker","kazasker","chief military judge (Ottoman context)"],"phonetic":"/ˈkɑːdiˌæskər/","extraExplanation":["“cadilesker”更常见的拼写是 **kadiasker / kazasker**（也可见作 *qadi al-askar* 的转写），来自阿拉伯语与奥斯曼土耳其语传统：*qadi* 表示“法官”，*askar* 表示“军队”。","这一职务在奥斯曼国家体系中很关键：既是宗教法（伊斯兰法）体系里的高级法官，也与军政官员任命、军队相关诉讼等密切相关。不同资料里可能会把它译作“军法官”“军法大臣”或“首席军法官”。","如果你是在某本书/论文里看到这个词，建议同时检索 *kadiasker* 与 *kazasker*，因为学术转写体系不同会导致拼写差异。"]}
{"word":"Cadillac","summary":{"en":"Cadillac is a luxury American car brand; informally, it can mean the best or top-of-the-line example of something (“the Cadillac of …”).","zh":"Cadillac 指美国豪华汽车品牌“凯迪拉克”；口语中也可指某类事物的顶级代表（“the Cadillac of …”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a well-known American brand of luxury cars (made by General Motors), often associated with comfort, status, and classic American style","zh":"凯迪拉克（美国豪华汽车品牌，通用汽车旗下），常与舒适、身份地位与经典美式风格相关"},"examples":[{"en":"She bought a black Cadillac with leather seats.","zh":"她买了一辆黑色的凯迪拉克，配有真皮座椅。"},{"en":"A Cadillac pulled up in front of the hotel.","zh":"一辆凯迪拉克停在了酒店门口。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) the best or most high-quality example of something (often in the pattern “the Cadillac of …”)","zh":"（非正式）某类事物中“顶级的、最好的”（常用结构为“the Cadillac of …”）"},"examples":[{"en":"They advertise it as the Cadillac of kitchen knives.","zh":"他们把它宣传为“厨刀中的凯迪拉克”（顶级厨刀）。"},{"en":"For years, this model was considered the Cadillac of smartphones.","zh":"多年来，这款机型被认为是智能手机里的顶级产品。"}]}],"synonyms":["luxury car","top-of-the-line (informal sense)","premium"],"phonetic":"ˈkædɪlæk","extraExplanation":["“Cadillac”原本是品牌名，来自18世纪法国探险家安托万·德·拉莫特·卡迪亚克（Antoine de la Mothe Cadillac）的姓氏；他与底特律的早期历史有关。由于凯迪拉克长期代表“豪华/高端”，英语里才引申出“the Cadillac of …”（某领域的顶配/标杆）这种说法。","文化提示：在美国语境中，Cadillac常带有“传统、体面、偏经典”的高端形象；不过在不同年代和地区，人们对它的印象也会随车型与流行文化而变化（例如书名《Cadillac Desert》用“Cadillac”来强化宏大、标志性的意象）。"]}
{"word":"cadillo","summary":{"en":"Cadillo means a prickly burr/seed that clings to clothes or fur, often used in Spanish-influenced American English.","zh":"Cadillo 指会粘在衣物或毛发上的带刺小种子／刺球，常见于受西班牙语影响的美式英语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, prickly seed or burr that sticks to clothing or animal fur; also the plant that produces these burrs (often called a “sandbur” or “burr” in English).","zh":"（会粘在衣物或动物毛上的）带刺小种子／刺球；也可指结这种刺球的植物（英语里常说 burr 或 sandbur）。"},"examples":[{"en":"After our hike, we found cadillos stuck all over our socks.","zh":"徒步后，我们发现袜子上粘满了 cadillos（小刺球）。"},{"en":"Keep the dog out of the tall grass—cadillos can get tangled in its fur.","zh":"别让狗进高草丛——cadillos 会缠在它的毛里。"}]}],"synonyms":["burr","sandbur","bur"],"phonetic":"/kəˈdiːjoʊ/","extraExplanation":["“Cadillo”是西班牙语借词，在美国英语中多见于西南部、墨西哥湾沿岸或拉丁裔社区的日常口语，用来指各种“会粘人的刺果/刺球”。在更通用的英语里，人们更常说 burr / sandbur。不同地区所指的具体植物可能不完全相同。"]}
{"word":"cadinene","summary":{"en":"Cadinene is a naturally occurring sesquiterpene found in some plant essential oils, often linked with woody or spicy aromas.","zh":"Cadinene（卡迪烯）是一种天然存在的倍半萜，见于一些植物精油中，常与木质或辛香气味相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a natural chemical (a sesquiterpene) found in the essential oils of some plants, especially certain woods and spices","zh":"一种天然化学物质（倍半萜），存在于一些植物的精油中，尤见于某些木材与香料"},"examples":[{"en":"Researchers identified cadinene in the essential oil of the plant sample.","zh":"研究人员在该植物样本的精油中鉴定出了卡迪烯（cadinene）。"},{"en":"Cadinene is one of the compounds that can contribute to a woody, spicy aroma.","zh":"卡迪烯是可能带来木质、辛香气味的化合物之一。"}]}],"synonyms":["sesquiterpene","α-cadinene","γ-cadinene"],"phonetic":"/ˈkædɪniːn/","extraExplanation":["cadinene 常见于精油与天然产物化学的语境中，不是日常英语词汇。","它通常指一类结构相近的异构体（例如 α-cadinene、γ-cadinene），在不同植物来源中比例会不同。","在香料学与精油分析里，人们可能用它来描述或解释某些“木质/辛香”气味特征，但它本身更多是化学名称而不是感官词。"]}
{"word":"cadis","summary":{"en":"Cadis is usually a spelling variant of caddis: a fly whose aquatic larvae build cases; rarely, it can mean a coarse woolen cloth in older texts.","zh":"cadis 通常是 caddis 的变体拼法：指石蛾（幼虫水生并会筑壳）；少见时在旧文献中也可指粗呢毛织物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Also spelled caddis) a kind of fly whose larvae live in water and often build a small “case” (tube) from sand, leaves, or tiny sticks; the insect is important in fly-fishing.","zh":"（也常拼作 caddis）石蛾（或石蛾类昆虫）；其幼虫生活在水中，常用沙粒、叶片或小树枝做成小“虫壳/虫管”；在飞蝇钓中很重要。"},"examples":[{"en":"Caddis (cadis) larvae build little cases to protect themselves in streams.","zh":"石蛾（cadis/caddis）幼虫会在溪流中做小虫壳来保护自己。"},{"en":"The fisherman chose a caddis pattern to match the insects on the river.","zh":"渔夫选了一款“石蛾”仿生飞蝇来贴近河里的昆虫。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical) a coarse woolen fabric, sometimes used in older texts; this meaning is now rare.","zh":"（历史用法）一种粗呢毛织物；在旧文献中可见，但现代很少使用。"},"examples":[{"en":"In older writing, “cadis” could refer to a rough wool cloth.","zh":"在较旧的文字里，“cadis”有时指一种粗呢毛织物。"}]}],"synonyms":["caddis"],"phonetic":"/ˈkædɪs/","extraExplanation":["“cadis”在现代英语里最常见的是“caddis”的旧拼法或变体拼法，尤其在与昆虫/飞蝇钓相关的语境中更常见“caddis”。如果你是在生物学或钓鱼资料里看到“cadis”，通常就是指石蛾。"]}
{"word":"cadish","summary":{"en":"“Cadish” is usually a misspelling of “caddish,” meaning rude or disrespectful (especially toward women).","zh":"“cadish”通常是“caddish”的误拼，意思是（尤对女性）粗鲁无礼、缺乏尊重。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Behaving in a rude, dishonest, or disrespectful way, especially toward women.","zh":"（尤指对女性）粗鲁、无礼、缺乏尊重，甚至带点卑劣的。"},"examples":[{"en":"He made a caddish comment about her appearance.","zh":"他对她的外表说了句很无礼的评论。"},{"en":"She refused to tolerate his caddish behavior.","zh":"她拒绝容忍他那种卑劣无礼的行为。"}]}],"synonyms":["rude","disrespectful","boorish","crass","impolite"],"phonetic":"/ˈkædɪʃ/","extraExplanation":["你输入的“cadish”在现代英语里通常是拼写错误；更常见的词是“caddish”（形容人粗鲁无礼）。","“caddish”来自名词“cad”，指“卑鄙/无礼的男人”（带有较强的负面评价，语气偏书面或英式）。","注意不要与“Kaddish”混淆：Kaddish（常见读音/拼写为 kaddish）是犹太教的一种祷文/祈祷词，含义与“caddish”完全无关。"]}
{"word":"cadism","summary":{"en":"“Cadism” means rude, dishonorable, or caddish behavior—especially disrespect toward women.","zh":"“Cadism”指卑鄙无礼、不体面的作风，尤指对女性不尊重的行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"rude or dishonorable behavior typical of a “cad,” especially disrespectful behavior toward women; caddishness.","zh":"（尤指对女性）像“cad（卑鄙无礼的男人）”那样粗鲁、不体面或不道德的行为；卑劣无礼的作风。"},"examples":[{"en":"His constant flirting at work, even after being told to stop, was pure cadism.","zh":"他在工作场合被要求停止后仍不断调情，完全是一种卑劣无礼的行为（cadism）。"},{"en":"She refused to excuse cadism as “just joking.”","zh":"她拒绝把这种卑鄙无礼的言行（cadism）当作“只是开玩笑”来原谅。"},{"en":"The novel portrays a charming man whose cadism slowly becomes obvious.","zh":"这部小说刻画了一个看似迷人的男人，但他的卑劣无礼逐渐暴露出来。"}]}],"synonyms":["caddishness","boorishness","rudeness","disrespect","loutishness"],"phonetic":"/ˈkædɪzəm/","extraExplanation":["“cadism”非常少见，更常见的拼写是“caddism”（来自名词 cad，指粗鲁、卑鄙、对女性不尊重的男人）。在现代英语里，这类表达多用于批评某人的品行，有时带一点文学或讽刺的语气。","cad 这个词在英式英语里更常见，常出现在对“绅士/淑女礼仪”的讨论中。现代更中性的说法可以用 disrespectful behavior / sexist behavior / harassment（视语境而定）。"]}
{"word":"cadiueio","summary":{"en":"“cadiueio” isn’t a standard English word; please provide the correct spelling or context.","zh":"“cadiueio”不是标准英文单词；请提供正确拼写或上下文以便我帮你确认。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a recognized English word (may be a typo or random letters).","zh":"这不是一个常见或可识别的英文单词（可能是拼写错误或随机字母）。"},"examples":[{"en":"I couldn’t find “cadiueio” in an English dictionary—could you check the spelling?","zh":"我在英文词典里找不到“cadiueio”——你能检查一下拼写吗？"},{"en":"If you tell me the sentence you saw it in, I can guess the intended word.","zh":"如果你把它出现的句子发给我，我可以帮你猜可能想表达的单词。"}]}],"extraExplanation":["你输入的“cadiueio”看起来像是键盘误触或拼写打错。你可以：\n1）再发一次正确拼写；\n2）告诉我它出现的上下文句子；\n3）如果是某个名字/缩写/品牌/游戏术语，也可以说明来源。\n\n另外，如果你是想练习“元音字母”顺序，英语里常见的是 a e i o u（有时加 y）。"]}
{"word":"Cadiz","summary":{"en":"Cadiz is most commonly the English name for Cádiz, a historic port city in southwestern Spain; it can also refer to several towns in the U.S.","zh":"Cadiz 通常指西班牙西南部的历史港口城市 Cádiz（加的斯）；也可指美国若干同名城镇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A port city in southwestern Spain (spelled Cádiz in Spanish), on a peninsula in the Atlantic Ocean; known for its old town and maritime history.","zh":"（西班牙语作 Cádiz）西班牙西南部的一座港口城市，位于大西洋沿岸的半岛上；以古城与航海历史闻名。"},"examples":[{"en":"We visited Cadiz for its beaches and the historic old town.","zh":"我们去加的斯游玩，那里有海滩和历史悠久的老城区。"},{"en":"Cadiz has long been an important gateway for trade across the Atlantic.","zh":"加的斯长期以来一直是跨大西洋贸易的重要门户。"}]},{"partOfSpeech":"n.","definition":{"en":"The name of several towns in the United States (for example, Cadiz in Kentucky or Ohio).","zh":"美国一些城镇的名称（例如肯塔基州或俄亥俄州的 Cadiz）。"},"examples":[{"en":"He grew up in Cadiz, Kentucky.","zh":"他在肯塔基州的卡迪兹（Cadiz）长大。"},{"en":"Our road trip passed through Cadiz, Ohio.","zh":"我们的公路旅行经过了俄亥俄州的卡迪兹（Cadiz）。"}]}],"phonetic":"/kəˈdɪz/","extraExplanation":["西班牙城市名常写作 **Cádiz**（带重音符号），英语里通常写 **Cadiz**。重音在第二个音节：ca-DIZ。","加的斯是欧洲最古老的持续有人居住的城市之一（常见说法），与腓尼基人、罗马时期以及后来的大西洋航运史都有联系。也常被提到与西班牙对美洲的航海与贸易史有关。"]}
{"word":"cadjan","summary":{"en":"Cadjan is palm-leaf thatch, especially coconut leaves used for roofs in Sri Lanka and South India.","zh":"Cadjan 指棕榈叶（多为椰叶）茅草材料，常用于斯里兰卡和印度南部的屋顶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"dried palm (often coconut palm) leaves used for thatching roofs or making temporary walls; also a roof made from this material (common in Sri Lanka and South India).","zh":"（常指椰子树的）干棕榈叶，用来做茅草屋顶或临时墙体的材料；也可指用这种材料盖成的屋顶（常见于斯里兰卡和印度南部）。"},"examples":[{"en":"The hut had a cadjan roof to keep out the sun and rain.","zh":"这间小屋用 cadjan 做屋顶，用来遮阳挡雨。"},{"en":"They repaired the cadjan after the storm tore some leaves away.","zh":"暴风雨吹掉了一些叶子后，他们修补了 cadjan 屋顶。"}]}],"synonyms":["thatch","palm-leaf thatch","thatched roof"],"phonetic":"/ˈkædʒən/","extraExplanation":["“cadjan”是南亚英语（尤其斯里兰卡英语）中常见的借词，常见拼写还有“cadjan thatch”。在当地生活与殖民时期记述（旅行写作、地方报刊等）里会用它来描写乡村住屋材料与景观。","在一般英语里更常用的对应表达是“thatch / thatched roof（茅草屋顶）”或“palm-leaf thatch（棕榈叶茅草）”。"]}
{"word":"cadlock","summary":{"en":"“Cadlock” is rare in English (mostly a surname) and is often a misspelling of “padlock.”","zh":"“Cadlock”在英语中很少见（多为姓氏），也常是把“padlock（挂锁）”拼错了。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare word (mainly seen as a family name). It is not a common standard English vocabulary item.","zh":"一个很少见的词（主要作为姓氏出现），不是常见的标准英语词汇。"},"examples":[{"en":"Ms. Cadlock will lead the meeting today.","zh":"Cadlock 女士今天将主持会议。"},{"en":"I found “Cadlock” listed as a surname in the records.","zh":"我在记录中看到“Cadlock”被列为一个姓氏。"}]},{"partOfSpeech":"other","definition":{"en":"Often a misspelling of “padlock” (a portable lock opened with a key or combination).","zh":"常被当作 “padlock”（挂锁）的拼写错误。"},"examples":[{"en":"Did you mean “padlock”? Put a padlock on the gate.","zh":"你是不是想说“padlock（挂锁）”？在大门上加一把挂锁。"},{"en":"The bike was secured with a padlock.","zh":"自行车用挂锁锁好了。"}]}],"synonyms":["padlock (if that is what you meant)"],"phonetic":"/ˈkædˌlɑk/","extraExplanation":["“Cadlock”本身在现代英语里非常不常用；如果你是在日常场景（门锁、自行车锁、储物柜）看到的，多半是把“padlock（挂锁）”拼错了。","判断方法：看上下文是否在谈“锁/上锁/钥匙/密码”。如果是，基本就应当用 padlock。也可以把原句贴出来，我可以帮你确认。"]}
{"word":"Cadman","summary":{"en":"Cadman is most commonly a surname; rarely, it can mean a traveling seller (especially in older Scottish/UK usage).","zh":"Cadman 最常见作姓氏；较少情况下可指走街串巷的小贩（多见于较旧的苏格兰/英式用法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), found especially in English-speaking countries","zh":"姓氏（常见于英语国家）"},"examples":[{"en":"Her last name is Cadman.","zh":"她的姓是 Cadman。"},{"en":"I met Mr. Cadman at the conference.","zh":"我在会议上认识了 Cadman 先生。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, mainly Scottish/older use) a traveling seller; a hawker or peddler","zh":"（罕见，主要为苏格兰/较旧用法）走街串巷的小贩；叫卖者"},"examples":[{"en":"In old stories, a cadman might walk from town to town selling small goods.","zh":"在老故事里，cadman 可能从一个镇走到另一个镇，卖些小商品。"},{"en":"The market attracted farmers, customers, and even a cadman or two.","zh":"集市吸引了农民、顾客，甚至还有一两个小贩。"}]}],"synonyms":["hawker","peddler","vendor"],"phonetic":"/ˈkædmən/","extraExplanation":["Cadman 更常见的是姓氏而不是普通名词。作为普通名词的“cadman”多见于较旧的英式/苏格兰语境，意思接近 hawker/peddler（小贩）。","文化小提示：你可能在地名或人名中见到它，比如美国纽约的 Cadman Plaza（地名），以及作曲家 Charles Wakefield Cadman（人名）。"]}
{"word":"Cadmann","summary":{"en":"“Cadmann” is mainly a proper name—most often a surname and a less common spelling of “Cadman.”","zh":"“Cadmann”主要是专有名词，多用作姓氏，常被视为“Cadman”的较少见拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname), a less common spelling variant of “Cadman.”","zh":"姓氏（家族名字），“Cadman”的较少见拼写变体。"},"examples":[{"en":"Ms. Cadmann will join the meeting at 3 p.m.","zh":"Cadmann 女士将于下午三点参加会议。"},{"en":"The email was signed “Jordan Cadmann.”","zh":"这封邮件署名为“Jordan Cadmann”。"}]},{"partOfSpeech":"other","definition":{"en":"(rare) used as a given name or character name; often chosen for its surname-like, English feel.","zh":"（少见）用作名字或角色名；常因其带有英式“姓氏感”而被选用。"},"examples":[{"en":"In the novel, Cadmann is a quiet but determined detective.","zh":"在小说中，Cadmann 是一位沉默但坚定的侦探。"}]}],"synonyms":["Cadman","Cædmon (similar spelling; different word)"],"phonetic":"/ˈkædmən/","extraExplanation":["“Cadman”这个姓在英语世界更常见，传统上可被解释为“caddie（搬运/跑腿的人）+ man（人）”一类的职业姓氏来源之一；“Cadmann”多被视为拼写变体（多一个 n）。","如果你想找的是古英语诗人 **Cædmon（常译‘凯德蒙/凯德门’）**，拼写与“Cadmann”相近但不是同一个词。Cædmon 被认为是最早的英语诗人之一，常在英国文学史中出现。","作为专有名词（人名/姓氏），它通常不需要加冠词（不说 *a Cadmann*），但可加所有格：*Cadmann’s book*（Cadmann 的书）。"]}
{"word":"Cadmar","summary":{"en":"“Cadmar” is usually a proper name rather than a standard English word; its meaning depends on context.","zh":"“Cadmar”通常是专有名词而不是标准英语词汇，含义需结合上下文判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (used as a surname, given name, or brand name). It is not a common standard English vocabulary word, so its meaning depends on the person/place/product it refers to.","zh":"专有名词（可作姓氏、名字或品牌名）。它不是常见的标准英语词汇，因此具体含义取决于所指的人名、地名或产品/品牌。"},"examples":[{"en":"Cadmar is the name on the account—please check the spelling.","zh":"账户上写的是 Cadmar——请核对拼写。"},{"en":"I saw “Cadmar” listed as a brand on the invoice.","zh":"我在发票上看到“Cadmar”被列为一个品牌。"}]}],"phonetic":"/ˈkædmɑr/","extraExplanation":["“Cadmar”在常见英语词典里通常不是一个固定词义的单词，更常见的是专有名词（人名/姓氏/公司或产品名）。如果你是在某个句子、商标、游戏角色、地名或文件里看到它，给我上下文我可以更准确解释。","也可能是拼写误差。常见容易混淆的词包括：cadmium（镉，化学元素）、cadre（骨干/干部）、Calmar/Cadmar（可能的地名或品牌拼法）。"]}
{"word":"Cadmarr","summary":{"en":"“Cadmarr” is not a standard English word; it is usually a name or invented term.","zh":"“Cadmarr”不是标准英语词；通常是名字或自造词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare or nonstandard term; most often used as a personal name, username, or fictional name rather than a common English vocabulary word.","zh":"一个少见或非标准的词；通常被用作人名、用户名或虚构名称，而不是常见英语词汇。"},"examples":[{"en":"Cadmarr is the name she uses online.","zh":"Cadmarr 是她在网上使用的名字。"},{"en":"In the story, Cadmarr is a knight from the northern lands.","zh":"在故事里，Cadmarr 是一位来自北方国度的骑士。"}]}],"synonyms":["(no standard synonyms; proper name)"],"phonetic":"/kædˈmɑr/","extraExplanation":["“Cadmarr”在主流英语词典中一般查不到固定词义，因此更可能是专有名词（人名/地名/角色名）或拼写变体。","如果你本来想查的是拼写相近的常见词，可能是：\n- cadmar / Cadmar（较少见的人名拼写）\n- Cadmar(r) 作为自造名（fantasy name）\n- 或其他词如 cadre（干部/核心成员）、camaraderie（友谊/同志情谊）等（需要你确认上下文）。","如果你能提供一句包含“Cadmarr”的原句或它出现的领域（游戏、小说、地名、人名），我可以更准确地判断读音与含义。"]}
{"word":"Cadmean","summary":{"en":"Cadmean means “of Cadmus or Thebes,” and in “Cadmean victory” it means a costly victory that feels like a defeat.","zh":"Cadmean 指“与卡德摩斯或底比斯有关的”；在“Cadmean victory”中指“惨胜”，即代价高到几乎像失败的胜利。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Cadmus (a figure in Greek myth) or to Thebes in Boeotia (ancient Greece).","zh":"与卡德摩斯（希腊神话人物）有关的；与底比斯（古希腊波奥提亚地区的城邦）有关的。"},"examples":[{"en":"The poem uses Cadmean imagery to suggest an ancient Theban setting.","zh":"这首诗用“卡德摩斯式”的意象来暗示一个古老的底比斯背景。"},{"en":"In some accounts, Cadmean legends explain the origins of Thebes.","zh":"在一些说法中，“卡德摩斯式”的传说解释了底比斯的起源。"}]},{"partOfSpeech":"adj.","definition":{"en":"(in the phrase “Cadmean victory”) a victory gained at such a heavy cost that it is almost like a defeat.","zh":"（见短语“Cadmean victory”）惨胜：付出极大代价的胜利，几乎等同于失败。"},"examples":[{"en":"It was a Cadmean victory: they won the case but lost their reputation.","zh":"那是一场“惨胜”：他们赢了官司，却失去了名声。"},{"en":"After the layoffs, the company’s ‘success’ felt like a Cadmean victory.","zh":"裁员之后，公司所谓的“成功”更像是一场惨胜。"}]}],"synonyms":["Theban","Boeotian","(for “Cadmean victory”) Pyrrhic"],"phonetic":"/kædˈmiːən/","extraExplanation":["“Cadmean”来自希腊神话中的卡德摩斯（Cadmus）。他在建立底比斯时杀死守护泉水的巨龙，并把龙牙撒在地上；龙牙长出武装战士（Spartoi），他们互相厮杀，最后只剩少数人。因为“胜利伴随巨大损失/灾祸”，英语里出现了“Cadmean victory（惨胜）”这种带典故色彩的说法，语气较文学化、书面。"]}
{"word":"cadmean","summary":{"en":"Cadmean means “related to Cadmus or Thebes (Theban),” used mainly in literary/classical contexts.","zh":"Cadmean 指“与卡德摩斯或底比斯（底比斯人的）相关”，多用于文学/古典语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Adj.) Relating to Cadmus (a hero in Greek mythology) or to Thebes, the ancient Greek city he founded; Theban.","zh":"（形容词）与希腊神话人物卡德摩斯（Cadmus）有关的；或与他建立的古希腊城市底比斯（Thebes）有关的；底比斯的。"},"examples":[{"en":"In Greek myth, the Cadmean royal family is often linked with tragic stories.","zh":"在希腊神话中，卡德摩斯（Cadmean）的王族常常与悲剧故事联系在一起。"},{"en":"The poet describes Cadmean walls rising above the plain of Thebes.","zh":"诗人描写底比斯平原上方耸立的“卡德摩斯之墙”（Cadmean walls）。"}]},{"partOfSpeech":"n.","definition":{"en":"(N.) A Theban; someone from Thebes (literary/rare).","zh":"（名词）底比斯人；来自底比斯的人（文学用法/较少见）。"},"examples":[{"en":"The play calls the citizens “Cadmeans” as they gather before the palace.","zh":"剧中把聚集在王宫前的市民称为“Cadmeans”（底比斯人）。"}]}],"synonyms":["Theban","Boeotian (sometimes, region-related)"],"phonetic":"/kædˈmiːən/","extraExplanation":["“Cadmean”源自希腊神话人物 Cadmus（卡德摩斯）。传说他建立了底比斯（Thebes），并把字母（腓尼基字母系统）带入希腊文化传统，因此“Cadmean”常出现在文学或古典学语境里，表示“底比斯的/卡德摩斯相关的”。","在古典文学里常见搭配有“Cadmean walls”（底比斯城墙）、“Cadmean city”（底比斯城）。它属于偏文学、偏古典的词，日常英语中很少使用。"]}
{"word":"cadmia","summary":{"en":"Cadmia is an old technical word for impure zinc compounds (often zinc oxide/carbonate) collected from smelting furnaces.","zh":"Cadmia 是一个较古老的技术词，指从冶炼炉中收集的不纯锌化合物（常为氧化锌/碳酸锌）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic/technical) An impure zinc compound (often zinc oxide or zinc carbonate) collected from the fumes or deposits of metal-smelting furnaces; historically used in making brass and in some medicines.","zh":"（古语/技术用语）一种不纯的锌化合物（常指氧化锌或碳酸锌），多从冶炼炉的烟尘或沉积物中收集；历史上用于制黄铜，也曾用于某些药用。"},"examples":[{"en":"Early writers described cadmia as a whitish deposit scraped from the inside of smelting furnaces.","zh":"早期文献把 cadmia 描述为从冶炼炉内壁刮下来的白色沉积物。"},{"en":"In older chemistry texts, cadmia was mentioned as a source of zinc used in brass-making.","zh":"在较早的化学教材中，cadmia 被提到是制黄铜所用锌的来源之一。"}]}],"synonyms":["calamine","zinc oxide","furnace calamine"],"phonetic":"/ˈkædmiə/","extraExplanation":["词源来自希腊语 kadmeia（“卡德摩斯的/卡德摩斯城的”），与古代底比斯（Thebes）传说人物 Cadmus 有关；早期矿物与冶金材料常用地名或神话名来命名。","不要把 cadmia 直接等同于现代元素“镉”（cadmium）。虽然 cadmium 这个词与 cadmia 有历史渊源（镉曾从含锌矿物中分离出来），但 cadmia 在旧文献里多指含锌的炉甘石/炉尘类物质。"]}
{"word":"cadmic","summary":{"en":"“Cadmic” means “related to or containing cadmium.”","zh":"“cadmic”表示“与镉有关的；含镉的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to or containing cadmium (a chemical element, symbol Cd).","zh":"与镉有关的；含镉的（镉是一种化学元素，符号 Cd）。"},"examples":[{"en":"Cadmic compounds are tightly regulated because cadmium can be toxic.","zh":"含镉化合物受到严格监管，因为镉可能有毒。"},{"en":"The lab labeled the sample as cadmic waste for special disposal.","zh":"实验室把样品标注为含镉废弃物，以便特殊处理。"}]}],"synonyms":["cadmium","cadmium-containing","cadmium-related"],"phonetic":"/ˈkædmɪk/","extraExplanation":["“cadmic”是较少见的形容词，更常见的写法/表达是“cadmium (adj.) / cadmium-containing（含镉的）”。在安全与环保语境中，你更常看到“cadmium exposure（镉暴露）”“cadmium waste（镉废物）”。","镉常与电池（如部分镍镉电池）、电镀、颜料等相关；由于毒性与环境风险，很多国家对含镉材料的使用与处置有明确规定。"]}
{"word":"cadmide","summary":{"en":"Cadmium: a toxic metallic chemical element (Cd) used in some batteries, coatings, and pigments.","zh":"Cadmium（镉）：一种有毒的金属化学元素（Cd），用于部分电池、镀层和颜料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical element (symbol Cd) that is a soft, silver-white metal, often used in batteries, coatings, and some pigments, but it is toxic","zh":"一种化学元素（符号 Cd），呈柔软的银白色金属，常用于电池、金属镀层和部分颜料，但具有毒性"},"examples":[{"en":"Cadmium is used in some rechargeable batteries.","zh":"镉用于一些可充电电池。"},{"en":"Exposure to cadmium can be harmful to your health.","zh":"接触镉可能对健康有害。"}]}],"phonetic":"/ˈkædmiəm/","extraExplanation":["你输入的“cadmide”在英语里不常见；大多数情况下人们想写的是“cadmium”（镉）。如果你指的是某种“镉化物”（cadmium compound），可以说“a cadmium compound”，并用具体名称如“cadmium sulfide（硫化镉）”。","文化与常识补充：镉曾用于颜料（如“cadmium yellow 镉黄”），颜色明亮但因为毒性问题，现代使用会更谨慎；在环境与职业健康语境里，cadmium 常与“污染、重金属、有害暴露”一起出现。"]}
{"word":"cadmiferous","summary":{"en":"Cadmiferous means “containing cadmium,” usually used in scientific descriptions of ores or minerals.","zh":"Cadmiferous 意为“含镉的”，多用于科学语境中描述矿石或矿物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"containing cadmium (a chemical element, symbol Cd), especially describing minerals or ores.","zh":"含镉的；含镉成分的（常用于描述矿物、矿石等）。"},"examples":[{"en":"The geologist identified a cadmiferous zinc ore in the sample.","zh":"地质学家在样本中鉴定出一种含镉的锌矿石。"},{"en":"Cadmiferous minerals should be handled carefully because cadmium can be toxic.","zh":"含镉矿物应谨慎处理，因为镉可能有毒。"}]}],"synonyms":["cadmium-bearing","cadmium-containing","Cd-bearing"],"phonetic":"/kædˈmɪfərəs/","extraExplanation":["“cadmiferous”多见于地质学、矿物学与冶金学文献，用来说明某种矿石“伴生/富含”镉；镉常与锌矿（如闪锌矿相关矿床）一起出现。","由于镉具有一定毒性，涉及“cadmiferous dust/ore（含镉粉尘/矿石）”的语境里，往往隐含职业健康与环境风险管理的提醒。"]}
{"word":"cadmium","summary":{"en":"Cadmium is a toxic metal (Cd) used in some batteries and industrial materials.","zh":"Cadmium 指有毒金属“镉”（Cd），用于某些电池和工业材料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A soft, bluish-white metal (chemical symbol Cd) used in some batteries, pigments, and industrial processes; it is poisonous, especially with long-term exposure.","zh":"镉（化学符号 Cd）：一种柔软的带蓝白色金属，用于某些电池、颜料和工业过程；有毒，长期接触危害更大。"},"examples":[{"en":"Some older rechargeable batteries contain cadmium.","zh":"一些较老的充电电池含有镉。"},{"en":"Cadmium exposure can be dangerous to human health.","zh":"接触镉可能对人体健康有危险。"}]}],"synonyms":["Cd (chemical symbol)"],"phonetic":"/ˈkædmiəm/","extraExplanation":["镉常见于“镍镉电池（Ni-Cd batteries）”、电镀、以及某些工业颜料中。由于有毒性，许多国家对含镉产品和排放有严格限制。","在环境与健康语境里，cadmium 常与 “heavy metal（重金属）”“contamination（污染）”“toxicity（毒性）” 等词一起出现。"]}
{"word":"cadmiumize","summary":{"en":"Cadmiumize means to coat a metal with cadmium, typically by electroplating, to resist corrosion.","zh":"Cadmiumize 指给金属镀镉（多为电镀），以增强耐腐蚀性。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to coat or treat (a metal object) with cadmium, usually by electroplating, to improve corrosion resistance.","zh":"（通常指通过电镀）给（金属物件）镀镉/用镉处理，以提高耐腐蚀性。"},"examples":[{"en":"The fasteners were cadmiumized to protect them from saltwater corrosion.","zh":"这些紧固件进行了镀镉处理，以防止盐水腐蚀。"},{"en":"Older aircraft parts were sometimes cadmiumized for extra durability.","zh":"一些较老的飞机零件有时会做镀镉处理以增强耐久性。"}]}],"synonyms":["cadmium-plate","plate with cadmium","cadmiate"],"phonetic":"/ˈkædmiəˌmaɪz/","extraExplanation":["“cadmiumize”多见于工业/工程语境，常与“cadmium plating（镀镉）”相关。由于镉及其化合物具有毒性，许多国家对镀镉工艺和含镉材料有更严格的环保与职业健康限制；在一些行业中会用锌镀层或其他涂层作为替代。"]}
{"word":"cadmiums","summary":{"en":"Cadmiums is the plural of cadmium, a toxic chemical element (Cd) used in some batteries, pigments, and coatings; the plural is mainly used in technical contexts.","zh":"Cadmiums 是 cadmium（镉）的复数；镉是有毒的化学元素（Cd），用于部分电池、颜料和镀层；复数多见于技术语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a soft, bluish-white chemical element (symbol Cd), used in some batteries, pigments, and metal coatings; it is toxic, especially when inhaled or absorbed over time.","zh":"镉（化学元素，符号 Cd），一种柔软的蓝白色金属，用于部分电池、颜料和金属镀层；具有毒性，长期吸入或摄入会危害健康。"},"examples":[{"en":"Cadmium is used in some rechargeable batteries, but safer alternatives are becoming more common.","zh":"镉曾用于一些可充电电池，但更安全的替代品正变得更常见。"},{"en":"The lab tested the soil for heavy metals such as lead and cadmium.","zh":"实验室检测了土壤中的重金属，如铅和镉。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of cadmium; sometimes used to mean different forms, samples, or types of cadmium (often in technical writing).","zh":"cadmium 的复数；有时在技术语境中指不同形态、样品或种类的镉。"},"examples":[{"en":"Different cadmiums were compared for purity in the experiment.","zh":"实验中比较了不同镉样品的纯度。"}]}],"synonyms":["Cd (chemical symbol)"],"phonetic":"/ˈkædmiəm/","extraExplanation":["“cadmiums”在一般英语里不常见；日常表达通常用不可数名词“cadmium”（例如：Cadmium is toxic.）。复数形式多出现在科研/工业文本里，用来区分不同来源或不同化学形态的镉。","镉属于“重金属”污染物之一，相关话题在环境与健康报道中较常见。注意在生活场景里谈“含镉”常用：cadmium-containing / cadmium contamination（镉污染）。"]}
{"word":"Cadmopone","summary":{"en":"Cadmopone is a scientific genus name for certain ants (Ponerinae).","zh":"Cadmopone 是某些蚂蚁的属名（刺蚁亚科），主要用于科学分类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of ants (subfamily Ponerinae), found mainly in Africa and parts of Asia; used in scientific naming.","zh":"【生物】一种蚂蚁属名（隶属刺蚁亚科 Ponerinae），主要分布于非洲及亚洲部分地区；用于学名分类。"},"examples":[{"en":"Researchers identified the specimen as a Cadmopone ant based on its body shape and mandibles.","zh":"研究人员根据体型和大颚判断该标本属于刺蚁属（Cadmopone）。"},{"en":"Cadmopone species are discussed in taxonomic papers on the Ponerinae subfamily.","zh":"在关于刺蚁亚科（Ponerinae）的分类学论文中，常会讨论 Cadmopone 的不同物种。"}]}],"phonetic":"/ˌkædmoʊˈpoʊni/","extraExplanation":["Cadmopone 属名主要出现在昆虫学/分类学语境中，不是日常英语词汇。写作时通常首字母大写并使用斜体（如 *Cadmopone*），表示拉丁学名。","如果你是在非学术语境（如聊天、作业、商品名）看到 “Cadmopone”，也可能是拼写错误或专有名词；常见相近词包括 cadmium（镉）等。你可以告诉我出现的句子，我可以帮你确认具体含义。"]}
{"word":"cadmopone","summary":{"en":"“cadmopone” isn’t a recognized English word; it’s likely a misspelling—possibly of “cardamom,” a fragrant spice.","zh":"“cadmopone”不是常见英语单词，可能是拼写错误；可能想写“cardamom（豆蔻）”，一种有香味的香料。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling.","zh":"不是标准英语单词，可能是拼写错误。"},"examples":[{"en":"I can’t find “cadmopone” in a dictionary—did you mean another word?","zh":"我在词典里找不到“cadmopone”——你是不是想写另一个词？"},{"en":"If you meant “cardamom,” it’s a spice used in cooking and tea.","zh":"如果你想写的是“cardamom”，那是一种常用于烹饪和茶饮的香料。"}]},{"partOfSpeech":"n.","definition":{"en":"(Possible intended word) cardamom: a spice made from the seeds of a plant in the ginger family, used for its strong sweet aroma.","zh":"（可能想表达的词）cardamom：豆蔻（香料），来自姜科植物的种子，气味浓郁、带甜香。"},"examples":[{"en":"Add a pinch of cardamom to the coffee for a warm flavor.","zh":"在咖啡里加一小撮豆蔻，会有温暖的香气。"},{"en":"Cardamom is common in Indian desserts and masala chai.","zh":"豆蔻常见于印度甜点和马萨拉奶茶中。"}]}],"synonyms":["cardamom","spice"],"phonetic":"/ˈkɑrdəˌmɑm/","extraExplanation":["“cadmopone”在英语中没有常见用法或权威词典收录。它的字母组合很像“cardamom（豆蔻）”，也可能是你想输入“camphor（樟脑）”“compound（化合物）”等词时打错了。","你可以告诉我：你在哪里看到这个词（句子/图片/科目），我就能更准确地帮你确认它到底是什么、怎么用。"]}
{"word":"Cadmus","summary":{"en":"Cadmus is a figure from Greek mythology, famous as the founder of Thebes and a bringer of alphabetic writing to Greece.","zh":"Cadmus（卡德摩斯）是希腊神话人物，以建立底比斯以及把字母书写带到希腊而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, a Phoenician prince who founded the city of Thebes and was credited with introducing the Phoenician (early alphabetic) writing system to Greece.","zh":"（希腊神话）卡德摩斯：腓尼基王子，被认为建立了底比斯（Thebes），并把腓尼基（早期字母）书写体系引入希腊。"},"examples":[{"en":"In Greek myth, Cadmus wandered in search of Europa before founding Thebes.","zh":"在希腊神话中，卡德摩斯为寻找欧罗巴而漂泊，后来建立了底比斯。"},{"en":"Some stories say Cadmus helped bring alphabetic writing to Greece.","zh":"一些传说认为卡德摩斯把字母书写带到了希腊。"}]},{"partOfSpeech":"n.","definition":{"en":"A male given name, used rarely in English (from the mythological name).","zh":"（较少见）英文男子名：Cadmus（源自神话人物名）。"},"examples":[{"en":"Cadmus is an uncommon first name today.","zh":"Cadmus 如今是不太常见的名字。"}]}],"synonyms":["Kadmos"],"phonetic":"/ˈkæd.məs/","extraExplanation":["卡德摩斯（Cadmus，也常拼作 Kadmos）与“字母的传播”常被联系在一起：神话里他来自腓尼基，而腓尼基字母被视为希腊字母的重要来源之一。","文学中常提到他“屠龙并播种龙牙”的故事：从龙牙长出的武士（Spartoi）帮助他建立城邦，这类情节常被用来象征文明建立所付出的代价与冲突。"]}
{"word":"Cadogan","summary":{"en":"Cadogan can mean (1) an old-fashioned tied-back hairstyle, or (2) a British surname/place name found in London and in titles.","zh":"Cadogan 可指（1）一种旧式后扎发型；或（2）英国的姓氏/地名，常见于伦敦地名与头衔称呼中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hairstyle in which the hair is tied back (often in a ponytail or queue) and sometimes fastened with a ribbon or bow at the nape of the neck","zh":"（旧时）卡多根式发型：把头发向后扎起（常为马尾或发辫），有时在颈后用缎带或蝴蝶结固定"},"examples":[{"en":"In some 18th-century portraits, men wear a cadogan tied with a black ribbon.","zh":"在一些18世纪的肖像画里，男性会梳卡多根式发型，并用黑色缎带系住。"},{"en":"The costume designer added a cadogan to make the character look more historically accurate.","zh":"服装设计师给角色加了卡多根式发型，让造型更符合历史。"}]},{"partOfSpeech":"n.","definition":{"en":"a British surname and place name (seen in names like Lord Cadogan, Cadogan Square, or Cadogan Hall)","zh":"卡多根（英式姓氏与地名；常见于如卡多根勋爵、卡多根广场、卡多根音乐厅等名称中）"},"examples":[{"en":"They met outside Cadogan Hall in London.","zh":"他们在伦敦的卡多根音乐厅外见面。"},{"en":"Cadogan is a well-known name in parts of Chelsea.","zh":"在切尔西的一些地方，“Cadogan”是个很常见的名字。"}]}],"synonyms":["queue (hairstyle)","ponytail","hair ribbon","surname","place name"],"phonetic":"/kəˈdoʊɡən/","extraExplanation":["“cadogan（发型）”一词通常被认为源自英国军政人物威廉·卡多根（William Cadogan，第一代卡多根伯爵）。18世纪欧洲男性常留长发或假发，把后部头发扎起并用缎带系住，这种造型后来就用他的姓来称呼。如今这个词更多出现在历史服饰、戏剧、影视造型或艺术史语境中。"]}
{"word":"Cadorna","summary":{"en":"Cadorna is mainly a proper noun: an Italian surname (often Luigi Cadorna, a WWI general) and also a place/station name in Italy (e.g., Milano Cadorna).","zh":"Cadorna 主要是专有名词：意大利姓氏（常指一战将领路易吉·卡多尔纳），也可指意大利的地名/车站名（如米兰卡多尔纳站）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) An Italian surname; most commonly refers to Luigi Cadorna (1850–1928), an Italian general who served as Chief of Staff of the Italian Army during much of World War I.","zh":"（专有名词）意大利姓氏；最常指路易吉·卡多尔纳（Luigi Cadorna，1850–1928），第一次世界大战期间意大利陆军的重要将领，曾长期担任总参谋长。"},"examples":[{"en":"In many histories of World War I, Cadorna is discussed as a key Italian commander.","zh":"在许多第一次世界大战的历史著作中，卡多尔纳常被作为意大利的重要指挥官来讨论。"},{"en":"The book compares Cadorna’s leadership style with that of other European generals.","zh":"这本书把卡多尔纳的领导风格与其他欧洲将领作了比较。"}]},{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A place name used in Italy (for example, Milano Cadorna, a major railway and metro station in Milan).","zh":"（专有名词）意大利的地名/站名用法（例如“米兰卡多尔纳站”Milano Cadorna，是米兰重要的铁路与地铁车站之一）。"},"examples":[{"en":"Let’s meet at Cadorna station and take the metro together.","zh":"我们在卡多尔纳站见面，然后一起坐地铁。"},{"en":"From Milano Cadorna, you can reach Malpensa Airport by train.","zh":"从米兰卡多尔纳站可以坐火车到马尔彭萨机场。"}]}],"phonetic":"/kəˈdɔrnə/","extraExplanation":["“Cadorna”在英文里通常不会当作普通词汇使用，而是作为人名或地名出现，因此写作时常需要上下文（如全名 Luigi Cadorna，或地点 Milano Cadorna）。","路易吉·卡多尔纳在英语史学写作中常与“一战意大利战线”“伊松佐河战役（Isonzo）”“卡波雷托战役（Caporetto）”等话题一起出现；评价有争议，常被提到其纪律严厉、战术保守等特点。"]}
{"word":"cados","summary":{"en":"“cados” is not a common English word; it’s likely a typo or an acronym.","zh":"“cados”不是常见英文词；更可能是拼写错误或某个缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or an acronym in a specific field (for example, a company name or a technical system).","zh":"不是标准英文单词。很可能是拼写错误，或是在某个领域里的缩写/专有名词（例如公司名或技术系统名称）。"},"examples":[{"en":"“Cados” isn’t in most English dictionaries—did you mean “chaos”?","zh":"“cados”在大多数英语词典里找不到——你是不是想写“chaos（混乱）”？"},{"en":"If “CADOS” is an acronym, please tell me what topic it’s from (tech, school, medicine, etc.).","zh":"如果“CADOS”是缩写，请告诉我它来自哪个领域（科技、学校、医学等）。"}]}],"extraExplanation":["“cados”最常见的情况是把“chaos（混乱）”拼错了（a 和 o 位置接近时容易误打）。也可能是某个组织/系统的名称缩写（全大写 CADOS 更像缩写）。\n你可以把你看到它的完整句子贴出来，我就能更准确地解释它的意思和用法。"]}
{"word":"Cadott","summary":{"en":"Cadott is a village in Wisconsin, USA.","zh":"Cadott 是美国威斯康星州的一个村庄。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a village in Chippewa County, Wisconsin, USA (a place name).","zh":"美国威斯康星州奇珀瓦县的一个村庄（地名）。"},"examples":[{"en":"Cadott is a small village in northwestern Wisconsin.","zh":"Cadott 是威斯康星州西北部的一个小村庄。"},{"en":"We stopped in Cadott on our drive between Eau Claire and Chippewa Falls.","zh":"我们从欧克莱尔开车去奇珀瓦福尔斯的路上在 Cadott 停了一下。"}]}],"phonetic":"/kəˈdɑt/","extraExplanation":["Cadott 是专有名词（地名），日常对话中通常不翻译，直接用英文拼写。","它位于威斯康星州的乡村地区，附近较大的城市有 Eau Claire（欧克莱尔）与 Chippewa Falls（奇珀瓦福尔斯）。如果你在美式英语里听到 “in Cadott”，一般指“在 Cadott 这个地方/城镇里”。"]}
{"word":"cadouk","summary":{"en":"“Cadouk” isn’t a common English word; it’s probably a misspelling of the rare/old word “caduke/caduc” meaning temporary or perishable.","zh":"“cadouk”不是常见英语词；多半是罕见/古旧词“caduke/caduc”的拼写误差，意为“短暂的、易衰败的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling of **caduke / caduc** (rare/old), meaning temporary, short-lived, or likely to fall/decay.","zh":"不是标准英语单词；很可能是 **caduke / caduc**（罕见/古旧）的拼写误差，意思是“短暂的、易凋落/易衰败的”。"},"examples":[{"en":"I can’t find **cadouk** in major English dictionaries—did you mean **caduke** or **caduc**?","zh":"在主流英语词典里找不到 **cadouk**——你是不是想写 **caduke** 或 **caduc**？"},{"en":"Fame can be **caduke**; it disappears quickly.","zh":"名声可能是 **短暂的**；它很快就会消失。"}]}],"synonyms":["temporary","fleeting","short-lived","transient","perishable"],"phonetic":"/kəˈduk/","extraExplanation":["**词源提示**：caduke/caduc 来自拉丁语 *caducus*（“会掉落的、会衰败的”），与 *caducous*（植物学：早落的，如叶子或花早早脱落）同源。","**用法提醒**：在现代英语里，这个词非常少见；更常用的表达是 **temporary, fleeting, short-lived, perishable**。"]}
{"word":"cadrans","summary":{"en":"“Cadrans” means “dials/faces of clocks, instruments, or sundials,” and is often the French plural used in English contexts.","zh":"“cadrans”指钟表、仪器或日晷的表盘/刻度盘；在英语中多为法语复数形式的借用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare in English) A dial or face of a clock, watch, instrument, or sundial—especially one marked with numbers or lines.","zh":"（英语中较少见）钟表、仪器或日晷的“表盘/刻度盘”，尤指带有数字或刻度线的那一面。"},"examples":[{"en":"The museum displayed several ancient cadrans used for sundials.","zh":"博物馆展出了几种古老的日晷表盘（cadrans）。"},{"en":"He examined the cadran to read the time more accurately.","zh":"他仔细查看表盘（cadran），以更准确地读出时间。"}]}],"synonyms":["dial","face","clock face","sundial"],"phonetic":"/kəˈdrɑːn/","extraExplanation":["“cadrans”通常是法语名词“cadran”的复数形式（单数：cadran；复数：cadrans）。在英语里更常用的说法是 dial / face（表盘、刻度盘），因此你在英文文本里见到“cadrans”时，往往带有法语色彩或出现在钟表、天文、仪器等语境中。"]}
{"word":"cadre","summary":{"en":"Cadre means a trained core group of people who lead or support an organization; in some contexts it also means government/party officials.","zh":"Cadre 指组织中的训练有素的核心骨干；在某些语境下也指党政干部/工作人员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small group of trained people who form the core of an organization, team, or movement (often in the military, government, or politics).","zh":"（组织、团队或运动中的）骨干队伍；核心干部（常用于军队、政府或政治语境）。"},"examples":[{"en":"The NGO built a cadre of local volunteers to run the program.","zh":"这个非政府组织培养了一支本地志愿者骨干来运行该项目。"},{"en":"A cadre of experienced nurses led the training for new staff.","zh":"一批有经验的护士骨干负责新员工的培训。"}]},{"partOfSpeech":"n.","definition":{"en":"In some political systems, an official or trained member of the ruling party or government staff (often translated as “cadre” in English).","zh":"（某些政治体制中）干部；党政工作人员（常直接译作“cadre/干部”）。"},"examples":[{"en":"Party cadres were sent to rural areas to support development projects.","zh":"干部被派往农村地区支持发展项目。"},{"en":"He worked as a government cadre in the local administration.","zh":"他在地方行政机构担任干部工作。"}]}],"synonyms":["core group","nucleus","leadership group","staff","kernel"],"phonetic":"/ˈkædri/","extraExplanation":["“cadre”源自法语，原意与“框架/骨架”有关，所以常带有“核心骨干、组织框架”的感觉。","在英语新闻里，“a cadre of …”很常见，意思是“一批/一群经过训练的骨干人员”，语气比“a group of people”更强调“训练有素、能带头、是核心”。","在中文语境里“干部”是常见词，但英语里的“cadre”并不总等于“official”；在公司或学校里也可以指“骨干团队”，偏正式用语。"]}
{"word":"cadres","summary":{"en":"“Cadres” is the plural of “cadre”: a trained core group within an organization.","zh":"“Cadres”是“cadre”的复数：指组织内部受过训练的骨干/核心成员（常译为“干部队伍”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group of trained people who form the core of an organization (especially in politics, the military, or administration).","zh":"（尤指政治、军队或行政体系中的）干部队伍；骨干成员；核心班底。"},"examples":[{"en":"The party relied on local cadres to organize meetings and communicate policy.","zh":"该政党依靠地方干部来组织会议并传达政策。"},{"en":"A small cadre of engineers led the project from start to finish.","zh":"一小批骨干工程师从头到尾领导了这个项目。"}]}],"synonyms":["core group","nucleus","coterie","inner circle","staff (context-dependent)"],"phonetic":"/ˈkædreɪ/","extraExplanation":["“Cadre”源自法语，原意与“框架/骨架”有关，所以常用来指“组织的骨干”。在英语里它既可用于一般机构（如“a cadre of teachers”），也常见于政治语境，尤其在谈论某些国家或政党体系时译作“干部”。","用法提示：英语里“cadre”常指规模不大但训练有素、影响力大的核心群体；如果只是泛指“大量员工/成员”，更常用“staff”“members”“workforce”等。"]}
{"word":"cads","summary":{"en":"“Cads” is the plural of “cad”: a dishonorable man, often one who treats women badly.","zh":"“cads”是“cad”的复数：指品行卑劣的男人，常含对女性不尊重之意。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a man who behaves dishonorably, especially toward women (rude, untrustworthy, or sexually disrespectful); an old-fashioned insult","zh":"（尤指对女性）行为卑劣、无礼或不可信的男人；一种较老派的侮辱用语"},"examples":[{"en":"Don’t trust him—he’s a cad who lies to get what he wants.","zh":"别信他——他是个卑鄙的人，会靠撒谎来达到目的。"},{"en":"She called him a cad for flirting with her and then denying it.","zh":"她骂他是个无耻之徒，因为他先跟她调情，后来又否认。"},{"en":"In old novels, the hero often protects the heroine from “cads.”","zh":"在一些老小说里，男主常常保护女主不受“无耻之徒”的伤害。"}]}],"synonyms":["scoundrel","rascal","jerk","creep","womanizer"],"phonetic":"/kæd/","extraExplanation":["“cad”在现代口语中不算常用，更常见于英式英语或带有复古/文学风格的语境（如小说、戏剧、影评）。语气是强烈的贬义，使用时要注意礼貌与场合。","词形：单数 cad，复数 cads。也可见到形容词用法“cad-like”（像无耻之徒一样的），但不常见。"]}
{"word":"cadua","summary":{"en":"Cadua is a rare Latin-derived term seen in English scholarly/legal contexts, meaning “things that fall/lapse,” especially in phrases like bona caduca.","zh":"cadua 多为拉丁语借用词，见于英语学术/法律语境，意为“落下之物/失效归公之物”，常见于 bona caduca 等固定短语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin; used in some English academic or legal writing) “things that fall” or “things that lapse/are forfeited.” Often appears in set phrases such as bona caduca (“forfeited property”).","zh":"（拉丁语；在部分英语学术或法律语境中使用）“落下之物 / 失效、归公之物”。常见于固定短语，如 bona caduca（“没收/归公的财产”）。"},"examples":[{"en":"In Roman-law texts, bona caduca referred to property that “fell” to the state under certain rules.","zh":"在罗马法文献中，bona caduca 指在特定规则下“归于国家/被没收”的财产。"},{"en":"The author uses cadua to describe rights that lapse when no heir is named.","zh":"作者用 cadua 描述在未指定继承人时会“失效/归公”的权利。"}]}],"synonyms":["(contextual) lapsed property","(contextual) forfeiture"],"phonetic":"/ˈkædʒuə/","extraExplanation":["“cadua”不是现代英语里常见的单词，多数情况下你可能是想查 **caducous**（形容词，植物学：叶、花等“早落的/易脱落的”）。如果你告诉我你看到 cadua 的原句或出处（书名、句子、学科），我可以更准确地判断它是拉丁语用法还是拼写/识别错误。"]}
{"word":"caduac","summary":{"en":"“caduac” is not standard; it is most likely the misspelling of “caducous,” meaning “falling off early” (esp. in plants) or, less commonly, “temporary.”","zh":"“caduac”不是标准拼写；很可能是“caducous”的误拼，意思是（尤指植物）“较早脱落的”，较少见地也可指“短暂的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely misspelling) “caducous”: shedding or falling off naturally at an early stage, especially leaves, petals, or other plant parts.","zh":"（可能是拼写错误）“caducous”：（尤指植物）在较早阶段自然脱落的，如叶、花瓣等。"},"examples":[{"en":"The caducous petals fell soon after the flower opened.","zh":"花一开放，早落的（caducous）花瓣很快就掉了。"},{"en":"Some trees have caducous leaves that drop in the dry season.","zh":"有些树的叶子会在旱季较早脱落。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) temporary; short-lived; not lasting long.","zh":"（较少用）短暂的；不持久的。"},"examples":[{"en":"Fame can be caducous if it depends only on trends.","zh":"如果名声只依赖潮流，它可能是短暂的。"},{"en":"They treated the argument as a caducous problem and moved on quickly.","zh":"他们把这场争论当作短暂的问题，很快就翻篇了。"}]}],"synonyms":["deciduous","transient","fleeting","short-lived"],"phonetic":"/kəˈduːkəs/","extraExplanation":["“caduac”本身不是常见英文单词，更像把 **caducous** 拼错了（也有人会看到较少见的词根形式 **caduc**）。","**caducous** 多见于植物学/自然写作，含义接近 **deciduous**（落叶的、会脱落的），但 caducous 更强调“较早脱落/容易脱落”。词源来自拉丁语 *cadere*（to fall，落下），和 *cadence*（节奏的“落点”）有同源关系。"]}
{"word":"caduca","summary":{"en":"Caduca (Spanish): deciduous/falling off; also expired or no longer valid.","zh":"caduca（西语）：落叶的/会脱落的；也可指到期或失效的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Spanish) “Caduca” means “deciduous” or “falling off/dropping,” especially used for leaves that fall each year, or for things that expire or become invalid (like a right, permit, or deadline).","zh":"（西班牙语）“caduca”表示“落叶的 / 会脱落的”，常指树叶每年会掉落；也可指“到期的、失效的”（如权利、许可、期限等）。"},"examples":[{"en":"En otoño, muchas hojas caducas caen de los árboles.","zh":"在秋天，许多落叶会从树上掉下来。"},{"en":"La licencia caduca a fin de mes.","zh":"这个许可证月底到期（失效）。"}]}],"synonyms":["deciduous (English equivalent)","caduco (masculine Spanish form)","expirada (when meaning “expired”)","vencida (when meaning “expired/overdue”)"],"phonetic":"/kəˈduːkə/","extraExplanation":["“caduca”是阴性形式（用于阴性名词）；阳性是“caduco”。在植物学里常与“árbol/planta de hoja caduca（落叶树/落叶植物）”一起用，对应英语常用词是“deciduous”。\n\n词源来自拉丁语“caducus”，与“caer（掉落）”同源。英语里的同源词是较少见的“caducous”（也可用于解剖学/医学，表示会脱落的组织）。"]}
{"word":"caducary","summary":{"en":"Caducary means short-lived or likely to fall/decay soon (a rare word).","zh":"Caducary 表示“短暂的/易逝的；很快会脱落或衰败的”（非常罕见）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) short-lived; temporary; perishable; likely to fall or decay soon.","zh":"（罕见）短暂的；易逝的；不耐久的；很快会脱落或衰败的。"},"examples":[{"en":"Some writers describe human fame as caducary—bright for a moment, then gone.","zh":"有些作家把人的名声形容为 caducary——一时耀眼，转瞬即逝。"},{"en":"In older scientific writing, certain leaves were called caducary because they drop early.","zh":"在较早的科学写作里，有些叶子被称为 caducary，因为它们会很早脱落。"}]}],"synonyms":["transient","temporary","short-lived","ephemeral","perishable","caducous"],"phonetic":"/kəˈduːkəri/","extraExplanation":["这个词非常少见，多见于较旧或较文学化的英文。现代英语里更常用 caducous（植物学：早落的）或 transient/temporary（短暂的）。","词源可追溯到拉丁语 caducus，意为“会掉落的、易衰败的”，也和英语里的词根 cad-（fall，落下）相关。"]}
{"word":"caducean","summary":{"en":"Caducean means “related to the caduceus,” a symbol linked to Hermes/Mercury and ideas like trade and communication.","zh":"caducean 指“与商神杖（赫尔墨斯杖）有关的”，常联想到贸易与沟通等含义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a caduceus (the staff with two snakes and usually wings), traditionally associated with Hermes/Mercury and with trade, negotiation, travel, or messaging.","zh":"与“商神杖/赫尔墨斯杖”（通常为两条蛇缠绕、顶部带翼的手杖）有关的；传统上与赫尔墨斯/墨丘利相关，常象征贸易、沟通、旅行或调停。"},"examples":[{"en":"The museum displayed caducean symbols on ancient Greek coins.","zh":"博物馆展示了古希腊硬币上的商神杖相关符号。"},{"en":"In the story, a caducean staff marks the character as a messenger.","zh":"在故事里，商神杖象征这名角色是一位使者。"}]}],"synonyms":["caduceal","Mercurial (context-dependent)"],"phonetic":"/kəˈduːʃiən/","extraExplanation":["“caducean”来自“caduceus”（商神杖）。在英语里它比较少见，更常见的说法是“the caduceus”或“caduceus-like symbol”。","文化小提示：在美国，商神杖有时被误用作“医学”标志；严格来说，医学更常对应“阿斯克勒庇俄斯之杖”（Rod of Asclepius，只有一条蛇、通常无翼）。"]}
{"word":"caducecaducean","summary":{"en":"Caduceus is Hermes’ winged staff with two snakes; caducean means “related to the caduceus/Hermes.”","zh":"caduceus 指希耳墨斯的“双蛇翼杖”；caducean 意为“与双蛇杖/希耳墨斯有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the caduceus: a staff with two snakes and often wings, traditionally the symbol of Hermes (Mercury), the messenger god; sometimes (especially in the U.S.) used as a symbol of medicine","zh":"（the caduceus）双蛇杖：一根缠绕两条蛇、常带翅膀的手杖，传统上是希耳墨斯（墨丘利）的象征；在美国等地也常被（有争议地）用作医学标志"},"examples":[{"en":"The company’s logo features a caduceus with two snakes and wings.","zh":"这家公司的标志是一根带双蛇和翅膀的双蛇杖。"},{"en":"Many people mistake the caduceus for the true medical symbol.","zh":"很多人把双蛇杖误认为真正的医学象征。"}]},{"partOfSpeech":"adj.","definition":{"en":"caducean: relating to the caduceus or to Hermes; also describing something shaped like or featuring a caduceus","zh":"caducean：与双蛇杖或希耳墨斯有关的；也可形容“呈双蛇杖形/带双蛇杖图案的”"},"examples":[{"en":"The uniform had a small caducean emblem on the sleeve.","zh":"制服袖子上有一个小小的双蛇杖徽章。"},{"en":"In mythology, Hermes is often shown with a caducean staff.","zh":"在神话中，希耳墨斯常被描绘为手持双蛇杖。"}]}],"synonyms":["Hermes’ staff","Mercury’s staff"],"phonetic":"/kəˈduːsiəs/","extraExplanation":["“caduceus”来自拉丁语 caduceus，源头与“使人和解、谈判的使者之杖”有关，因此它更常与“信使、商业、沟通、谈判”联系在一起。","医学领域更传统、更准确的符号通常是“阿斯克勒庇俄斯之杖（Rod of Asclepius）”：一条蛇缠绕、没有翅膀。双蛇杖在美国被一些医疗机构误用或沿用，导致两者经常混淆。","词尾 -an 常用于构成形容词，表示“与……有关的”（如 Roman, Victorian）。因此 caducean = “与 caduceus 有关的”。"]}
{"word":"caducecei","summary":{"en":"“Caducecei” is a nonstandard form; the usual plural is “caducei,” meaning the caduceus staffs associated with Hermes, shown as a winged staff with two snakes.","zh":"“caducecei”多为非标准写法；常见复数为“caducei”，指与赫尔墨斯相关的商神杖（双蛇缠绕、带翅）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural) staffs or wands carried by Hermes (Mercury), traditionally shown with two snakes intertwined around a winged staff; the plural of “caduceus.”","zh":"（复数）“caduceus（商神杖）”的复数：赫尔墨斯（罗马名墨丘利）所持的手杖/权杖，常画成一根带翅的杖，上有两条蛇缠绕。"},"examples":[{"en":"In Greek mythology, Hermes is often depicted holding two caducei.","zh":"在希腊神话中，赫尔墨斯常被描绘成手持两根商神杖（caducei）。"},{"en":"The museum displayed coins engraved with caducei as symbols of trade.","zh":"博物馆展出了刻有商神杖（caducei）作为贸易象征的钱币。"}]}],"synonyms":["caducei","Hermes’ staffs","Mercury’s staffs"],"phonetic":"/kəˈduːsi.aɪ/","extraExplanation":["你输入的 **caducecei** 通常被认为是拼写变体/误拼；更常见、较标准的复数拼写是 **caducei**（单数 **caduceus**）。","文化小知识：caduceus（双蛇带翅）常被误用为“医学标志”。严格来说，医学更传统的符号是 **Asclepius 的杖（Rod of Asclepius）**：一条蛇、没有翅膀。caduceus 更偏向“商业、谈判、使者、贸易”等含义。"]}
{"word":"caducei","summary":{"en":"Caducei is the plural of caduceus—the two‑snake (often winged) staff of Hermes, a symbol of commerce and messaging, sometimes mistaken for a medical symbol.","zh":"Caducei 是 caduceus 的复数：赫尔墨斯的“双蛇（常带翅）之杖”，象征商贸与使者，也常被误当作医学标志。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of caduceus: the staff carried by Hermes (Mercury), usually shown with two snakes wrapped around it and often with wings; a symbol linked to commerce, negotiation, and messengers (and sometimes—incorrectly—medicine).","zh":"caduceus（赫尔墨斯/墨丘利之杖）的复数：通常画成一根带翅膀的手杖，两条蛇缠绕其上；常与商业、谈判、使者相关（也常被误用为医学标志）。"},"examples":[{"en":"In the museum case, two bronze caducei are displayed beside statues of Hermes.","zh":"在博物馆的展柜里，两件青铜制的 caducei 陈列在赫尔墨斯雕像旁边。"},{"en":"The logo shows caducei, suggesting trade and communication rather than healthcare.","zh":"这个标志画着 caducei，更暗示贸易与沟通，而不是医疗。"},{"en":"Many people confuse the caducei with the Rod of Asclepius, which has only one snake.","zh":"很多人把 caducei 和“阿斯克勒庇俄斯之杖”混淆；后者只有一条蛇。"}]}],"synonyms":["caduceuses","staffs of Hermes","Hermes’ staffs"],"phonetic":"/kəˈduːsi.aɪ/","extraExplanation":["“caducei”读起来像拉丁语复数形式（类似 radius → radii）。英语里也常见规则复数“caduceuses”。","文化常识：医学领域更传统、也更准确的象征通常是“Rod of Asclepius（阿斯克勒庇俄斯之杖）”，特点是一条蛇、没有翅膀；“caduceus/caducei”与赫尔墨斯相关，历史上更偏向商贸与使者象征。"]}
{"word":"caduceus","summary":{"en":"Caduceus = Hermes’ winged staff with two snakes; often used (sometimes mistakenly) as a medical symbol in the U.S.","zh":"caduceus 指赫尔墨斯的“双蛇有翅权杖”；在美国常被用作医疗标志（但常被认为不够严谨）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A staff with two snakes winding around it, often shown with wings at the top; in modern American culture it is widely (but often incorrectly) used as a symbol of medicine and healthcare.","zh":"（caduceus）有两条蛇缠绕、顶端常带翅膀的权杖；在现代美国文化中常（但常被认为不严谨/不正确地）被当作医学与医疗的象征。"},"examples":[{"en":"The hospital’s logo shows a caduceus, though some people argue it should be the Rod of Asclepius.","zh":"这家医院的标志是“双蛇杖”（caduceus），不过有人认为更应该用“阿斯克勒庇俄斯之杖”（Rod of Asclepius）。"},{"en":"In a history class, we learned the caduceus was linked to Hermes, the messenger god.","zh":"在历史课上，我们学到“双蛇杖”与信使之神赫尔墨斯有关。"}]},{"partOfSpeech":"n.","definition":{"en":"In Greek/Roman mythology and later symbolism, the staff of Hermes (Mercury), associated with messengers, trade, negotiation, and travel.","zh":"在希腊/罗马神话及后来的象征中，指赫尔墨斯（罗马称墨丘利）的权杖，关联使者、商业、协商与旅行等含义。"},"examples":[{"en":"The caduceus appears in art to suggest commerce or diplomacy.","zh":"艺术作品中出现“双蛇杖”往往暗示商业或外交/谈判。"},{"en":"As a symbol, the caduceus is more about communication and exchange than healing.","zh":"作为象征，“双蛇杖”更多与沟通和交易相关，而不主要指治愈。"}]}],"synonyms":["Hermes’ staff","Mercury’s staff"],"phonetic":"/kəˈduːsiəs/","extraExplanation":["在英语世界里，医学更传统、更“准确”的符号通常被认为是单蛇杖“Rod of Asclepius”（一条蛇、无翅膀），与医神阿斯克勒庇俄斯有关；而 caduceus（双蛇、有翅）源自赫尔墨斯/墨丘利，原本与商业、使者、沟通相关。之所以在美国常被用作医学标志，部分原因与19–20世纪一些军事与商业机构的采用有关，后来被大众沿用。","词源提示：caduceus 来自拉丁语 caduceus，进一步可追溯到希腊语 κηρύκειον（kērýkeion），意为“使者的权杖”。"]}
{"word":"caduciaries","summary":{"en":"Caduciaries is the plural of the rare legal word caduciary, referring to (1) escheated/forfeited property that reverts to the state or (2) those who manage it.","zh":"Caduciaries 是少见法律词 caduciary 的复数，可指（1）因无人继承/没收而归国家的财产，或（2）负责管理该类财产的人/机构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Law, rare) relating to property or rights that “fall” or revert to the state (for example, by forfeiture or lack of heirs); escheated.","zh":"（法律用语，较少见）指“归落”或回归国家的财产/权利（例如因无人继承或因没收而归公）；与“归公财产”有关。"},"examples":[{"en":"In some older legal texts, caduciary property refers to assets that revert to the state when there are no lawful heirs.","zh":"在一些较旧的法律文本中，caduciary property 指在没有合法继承人时回归国家的资产。"},{"en":"The statute explains how caduciary assets should be recorded and transferred.","zh":"该法规说明了归公财产应如何登记与移交。"}]},{"partOfSpeech":"n.","definition":{"en":"(Law, rare) a person or office responsible for managing or handling such escheated/forfeited property.","zh":"（法律用语，较少见）负责管理或处理这类归公/没收财产的人或机构。"},"examples":[{"en":"Historically, a caduciary might oversee the collection of property that reverted to the crown or the state.","zh":"历史上，caduciary 可能负责征收回归王室或国家的财产。"}]}],"synonyms":["escheated (property)","forfeited (property)","reverted to the state"],"phonetic":"/kəˈduːʃiˌɛriz/","extraExplanation":["这个词非常少见，更多出现在历史法律文献里。它来自拉丁语 caducus（“落下的、会倒下的”），引申为“落空而归国家的财产”。","很多学习者把 caduciary 误写/误读成 fiduciary（更常见，意为“受托人/受信义务人”）。两者发音和拼写相似，但含义差别很大：fiduciary 强调“受托与信任关系”，caduciary 强调“财产归公/归国库”的概念。"]}
{"word":"caduciary","summary":{"en":"Caduciary is a rare legal word meaning “related to (or being) property that goes to the state because there is no lawful heir.”","zh":"Caduciary 是很少见的法律用词，指“与无人合法继承、依法归国家的财产有关的”，也可指这种归公的财产本身。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to property that has no legal heir and therefore goes back to the state (or the crown) by law","zh":"（法律）指无人继承的财产，依法归国家（或王室）所有的；与“无主继承/归公”有关的"},"examples":[{"en":"In some legal systems, caduciary property may pass to the state when no heirs can be found.","zh":"在一些法律体系中，如果找不到继承人，caduciary（无人继承的）财产可能会归国家所有。"},{"en":"The lawyer checked whether the estate would be treated as caduciary under local law.","zh":"律师核实该遗产在当地法律下是否会被认定为caduciary（无人继承而归公）。"}]},{"partOfSpeech":"n.","definition":{"en":"property (or an estate) that reverts to the state because there is no valid heir","zh":"（法律）无人合法继承而依法归国家的财产/遗产"},"examples":[{"en":"If the will is invalid and there are no relatives, the estate can become a caduciary.","zh":"如果遗嘱无效且没有亲属，该遗产可能会成为caduciary（归公遗产）。"}]}],"synonyms":["escheat (related concept)","ownerless property (general idea)","bona vacantia (legal Latin, related concept)"],"phonetic":"/kəˈduːʃiˌɛri/","extraExplanation":["该词非常少见，多出现在法律史或比较法语境。更常见的相关词是 caducary / caducity（在某些法系中指“无人继承而归公”的状态或规则）。","词源可追溯到拉丁语 caducus，原意有“坠落的、会倒下的”，在法律语境里引申为“权利/财产因条件不成立而失效、落空，转归国家”。不同国家对“归公/归国库”的具体规则和程序差异很大。"]}
{"word":"caducibranch","summary":{"en":"Caducibranch describes certain sea slugs whose gills can detach easily.","zh":"caducibranch 指某些海蛞蝓（尤裸鳃类）鳃容易脱落的特征。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of some sea slugs, especially nudibranchs) having gills that can be shed or drop off easily.","zh":"（指某些海蛞蝓，尤指裸鳃类）鳃容易脱落的；具有可脱落鳃的。"},"examples":[{"en":"Some nudibranchs are caducibranch and can lose their gill plumes when disturbed.","zh":"有些裸鳃类是“鳃可脱落的”，受到惊扰时会脱落鳃羽。"},{"en":"The caducibranch species may regrow its gills after a predator attack.","zh":"这种鳃可脱落的物种在遭到捕食者攻击后可能会再生鳃。"}]}],"synonyms":["deciduous-gilled","branchiae deciduous","caducibranchiate"],"phonetic":"/kəˈduːsɪˌbræŋk/","extraExplanation":["这个词很少见，主要用于动物学/海洋生物学语境。caduci- 来自拉丁语 caducus，意为“易落下的、会掉的”，-branch 与“鳃（gills）/鳃状结构”有关。整体意思就是“鳃会脱落的”。在一些海蛞蝓中，鳃的脱落可被视为一种防御机制（类似“自割”），用来分散捕食者注意或减少伤害。"]}
{"word":"Caducibranchiata","summary":{"en":"An old zoological term for amphibians (often salamanders) that shed their external gills as they mature.","zh":"旧式动物学术语：指（常为蝾螈类）会在成长过程中脱落外鳃的两栖动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historical zoological group name for amphibians (especially salamander-like species) whose external gills are shed as they mature (i.e., they do not keep gills in adulthood).","zh":"（旧式动物分类用语）指一类两栖动物（尤指类似蝾螈的种类），其幼体的外鳃会在发育过程中脱落，成体不保留外鳃。"},"examples":[{"en":"Some older zoology books place many salamanders in the Caducibranchiata because they lose their external gills during development.","zh":"一些较早的动物学书会把许多蝾螈类归入 Caducibranchiata，因为它们在发育过程中会失去外鳃。"},{"en":"Modern classifications rarely use the term Caducibranchiata, preferring groups such as Urodela or Caudata.","zh":"现代分类法很少使用 Caducibranchiata，而更常用 Urodela 或 Caudata 等类群名称。"}]}],"synonyms":["caducibranchiate","non-perennibranchiate salamanders","(modern broader terms) Caudata","Urodela"],"phonetic":"/kəˌduːsəbræŋkiˈeɪtə/","extraExplanation":["这是一个较为过时的分类名称，常见于19世纪到20世纪早期的动物学文献。","词源可拆为拉丁语/新拉丁语成分：caduc-（“易脱落的、会掉落的”）+ branchia（“鳃”），字面意思就是“会脱落的鳃”。","在现代生物分类中，这类动物通常会直接归入有尾目（Caudata / Urodela）等更通行的分类框架，因此你更可能在历史文献或旧教材里看到它。"]}
{"word":"caducibranchiata","summary":{"en":"Caducibranchiata is an older zoological term for amphibians that lose their gills as they mature.","zh":"Caducibranchiata 是较旧的动物学术语，指成体发育过程中会失去鳃的两栖动物类群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology, older classification) A group of amphibians whose external gills are lost as they develop into adults (as in most frogs and salamanders).","zh":"（动物学，较旧的分类）一类两栖动物：幼体有外鳃，但在发育为成体过程中鳃会脱落（如大多数蛙类与部分蝾螈）。"},"examples":[{"en":"In older zoology books, frogs were sometimes placed under Caducibranchiata because their gills disappear during metamorphosis.","zh":"在一些较旧的动物学书里，蛙类有时被归入 caducibranchiata，因为它们在变态过程中鳃会消失。"},{"en":"Caducibranchiata was contrasted with perennibranchiates, which keep gills throughout life.","zh":"caducibranchiata 常与 perennibranchiates（终生保留鳃的类群）相对比。"}]}],"synonyms":["caducibranchiate amphibians","caducibranchiates"],"phonetic":"/kəˌduːsəbraŋkiˈeɪtə/","extraExplanation":["词源可拆解理解：caduci- 来自拉丁语 *caducus*（“会脱落的、易落的”），branchiata 来自希腊语 *branchia*（“鳃”）。整体意思就是“会脱落鳃的”。","这是偏历史性的术语：现代生物分类更常用系统发育（亲缘关系）来划分两栖类，因此该词多见于旧文献、博物学著作或分类史讨论中。","相关对照词：*Perennibranchiata* 指“终生有鳃”的类群（如部分具有幼体性成熟特征的蝾螈）。"]}
{"word":"caducibranchiate","summary":{"en":"Caducibranchiate means “having gills that are shed during development.”","zh":"caducibranchiate 指“鳃会在发育过程中脱落/消失的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of some animals, especially certain amphibians) having gills that are shed or lost during development; having deciduous gills.","zh":"（指某些动物，尤指某些两栖类）具有会在发育过程中脱落/消失的鳃；具“落鳃”的。"},"examples":[{"en":"Some salamander larvae are described as caducibranchiate because their external gills disappear as they mature.","zh":"有些蝾螈幼体被称为 caducibranchiate，因为它们的外鳃会随着成熟而消失。"},{"en":"In older zoology texts, caducibranchiate species are contrasted with animals that keep their gills for life.","zh":"在较早的动物学文献中，caducibranchiate 物种常与终生保留鳃的动物作对比。"}]}],"synonyms":["caducibranch","deciduobranchiate"],"phonetic":"/kəˌduːsɪˈbræŋkiˌeɪt/","extraExplanation":["这是一个较少见的动物学术语，多见于较早的分类或形态学描述中。词源上由拉丁语词根组成：caduci- 表示“易落的、会脱落的”（同源于 caducous），branch- 来自希腊语表示“鳃”。用在描述某些幼体阶段具有外鳃、但随后鳃会退化或脱落的动物。"]}
{"word":"caducicorn","summary":{"en":"Caducicorn describes animals whose horns or antlers are shed and regrown.","zh":"Caducicorn 指角或鹿角会周期性脱落并再生的动物（落角的）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of an animal) having horns or antlers that are shed and regrown periodically (deciduous).","zh":"（动物）有会周期性脱落并再生的角/鹿角的（落角的）。"},"examples":[{"en":"Deer are caducicorn because they shed their antlers each year.","zh":"鹿是“落角的”（caducicorn），因为它们每年都会脱落鹿角。"},{"en":"The textbook contrasts caducicorn species with animals whose horns are permanent.","zh":"教材将“落角的”物种与角不会脱落的动物作对比。"}]}],"synonyms":["deciduous-horned","shedding-antlered"],"phonetic":"/kəˈduːsɪkɔrn/","extraExplanation":["这个词非常少见，多用于动物学/博物学写作。词源来自拉丁语：caducus（“会掉落的、易落的”）+ cornu（“角”）。","常见对比概念：鹿科的“鹿角/antlers”通常会脱落（可称 caducicorn）；而牛、羊等的“角/horns”一般终生不脱落（更常说 persistent/permanent horns）。"]}
{"word":"caducities","summary":{"en":"Caducities means forms of impermanence or perishability; in formal legal use, it can mean the lapse or invalidation of a right or claim.","zh":"Caducities 是 caducity 的复数，表示“短暂易逝、无常”；在正式法律语境中也可指“权利/请求权等因期限或条件不成就而失效或终止”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being short-lived; impermanence or perishability","zh":"短暂易逝的状态；无常、易朽"},"examples":[{"en":"The poem reflects on the caducities of youth and beauty.","zh":"这首诗反思了青春与美貌的易逝。"},{"en":"Travel can remind us of life’s caducities—moments pass quickly.","zh":"旅行会提醒我们人生的短暂无常——片刻转瞬即逝。"}]},{"partOfSpeech":"n.","definition":{"en":"(law, formal) the ending or invalidation of a right, contract, or claim because a required condition was not met or time has expired","zh":"（法律，正式）因未满足条件或期限届满而导致权利、合同或请求权终止/失效"},"examples":[{"en":"The judge noted the caducity of the claim after the filing deadline passed.","zh":"法官指出该请求在超过起诉期限后已失效。"},{"en":"They argued that the agreement was subject to caducity if approval was not obtained.","zh":"他们主张若未获得批准，该协议将面临失效。"}]}],"synonyms":["impermanence","transience","ephemerality","mortality","lapse","expiration"],"phonetic":"/kəˈduːsəti/","extraExplanation":["“caducities”是名词“caducity”的复数形式，比较正式、偏文学或法律语境。日常英语里更常用“impermanence / transience（无常/短暂）”来表达第一义。","词源来自拉丁语“caducus”（意为“会落下的、易倒的”），与“caducous”（植物学：早落的，如早落的花萼/叶）同源，因此常带有“容易消逝/容易终止”的意象。"]}
{"word":"caducity","summary":{"en":"Caducity means the quality of being short-lived or becoming invalid with time.","zh":"Caducity 指“短暂易逝”或“因时间推移而（法律上/形式上）失效”的性质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being temporary, likely to end, or no longer valid because time has passed","zh":"（事物）短暂、易逝的状态；（权利/文件等）因时间流逝而失效"},"examples":[{"en":"The caducity of youth is a common theme in poetry.","zh":"青春的易逝是诗歌中常见的主题。"},{"en":"Because of caducity, the old permit could not be used anymore.","zh":"由于时效失效，那张旧许可证已经不能再用了。"}]}],"synonyms":["impermanence","transience","ephemerality","expiration","lapse"],"phonetic":"/kəˈdusɪti/","extraExplanation":["该词源自拉丁语 *caducus*（意为“会坠落的、短命的”），与英语动词 *fall*（坠落）的概念接近。","在法律或正式语境中，*caducity* 可指“权利/合同/许可因期限届满而失效”。在文学或哲学语境中，则更常用来表达“生命、荣华、青春的短暂与无常”。","属于偏书面、较少日常使用的词。日常表达更常用 *impermanence*（无常/不永久）、*transience*（短暂）、或 *expiration*（到期/失效）。"]}
{"word":"caducous","summary":{"en":"Caducous means “shed early” (especially in botany) and, more generally, “short-lived.”","zh":"caducous 指“早期脱落的”（常用于植物学），引申为“短暂的、易逝的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Describing something (especially a leaf, flower, or horn) that falls off or is shed early, usually at a certain stage of development.","zh":"（尤指叶、花或角等）早落的；早期脱落的（通常在发育的某个阶段就脱落）。"},"examples":[{"en":"Some plants have caducous leaves that drop soon after they appear.","zh":"有些植物的叶子是早落的，刚长出来不久就会掉落。"},{"en":"The tree has caducous bracts that fall before the fruit fully forms.","zh":"这棵树的苞片会早期脱落，在果实完全形成前就掉了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Temporary or short-lived; lasting only a brief time (formal/literary).","zh":"短暂的；转瞬即逝的（较正式/文学用语）。"},"examples":[{"en":"Fame can be caducous, disappearing as quickly as it arrives.","zh":"名声可能是短暂的，来得快去得也快。"},{"en":"He wrote about the caducous nature of youth and beauty.","zh":"他写到了青春与美丽转瞬即逝的本质。"}]}],"synonyms":["deciduous","shed","falling","short-lived","ephemeral","transient"],"phonetic":"/kəˈduːkəs/","extraExplanation":["该词常见于植物学/医学等学术语境：如“caducous leaves（早落叶）”“caducous placenta（早期剥离的胎盘）”。日常英语更常用 fall off / shed early / short-lived 来表达。","词源来自拉丁语 caducus（“会掉落的”），与动词 cadere（“落下”）同源；因此它带有“自然脱落、易逝”的意象，在文学里也可用来形容“无常、短命”。"]}
{"word":"caduke","summary":{"en":"Caduke is an archaic adjective meaning “decaying” or “temporary/short-lived.”","zh":"Caduke 是一个较古的形容词，意思是“腐朽衰败的”或“短暂易逝的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic) Decaying or falling apart; in a state of decline.","zh":"（古/书面）腐朽的；衰败的；走向崩坏的。"},"examples":[{"en":"The once-proud mansion looked caduke, with peeling paint and a sagging roof.","zh":"那座曾经气派的宅邸如今显得颓败不堪，油漆剥落、屋顶下塌。"},{"en":"He wrote about caduke institutions that could no longer serve the people.","zh":"他写到那些已衰败、无法再服务人民的制度。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Archaic) Temporary; passing; not lasting long.","zh":"（古/书面）短暂的；易逝的；不持久的。"},"examples":[{"en":"Fame can be caduke, bright one day and forgotten the next.","zh":"名声可能转瞬即逝，今天耀眼，明天便被遗忘。"},{"en":"She treated her anger as caduke and chose to focus on what mattered.","zh":"她把愤怒看作短暂情绪，转而专注于真正重要的事。"}]}],"synonyms":["decaying","dilapidated","decrepit","transient","short-lived","ephemeral"],"phonetic":"/kəˈdjuːk/","extraExplanation":["“caduke”是较罕见的古词，多见于文学或带古典色彩的写作；现代英语里更常用“decaying / dilapidated / transient / short-lived”。","词源来自拉丁语“cadūcus”（意为“会倒下的、易逝的”），与“cadence（节奏的落点）”“cascade（瀑布般下落）”在词根上都有“落下/坠落”的关联。"]}
{"word":"cadus","summary":{"en":"Cadus is a rare literary word for an ancient Roman storage jar, often for wine.","zh":"Cadus 是较少见的文学用词，指古罗马用来储存（尤指葡萄酒）的陶罐。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large jar or earthenware vessel in ancient Rome, especially one used for storing wine or oil (similar to an amphora).","zh":"（古罗马的）大陶罐；（尤指）用来储存葡萄酒或橄榄油的陶制容器（类似双耳细颈瓶 amphora）。"},"examples":[{"en":"The museum displayed a cadus that once held wine.","zh":"博物馆展出了一只曾用来装葡萄酒的 cadus（大陶罐）。"},{"en":"In the poem, the poet mentions opening a cadus of aged wine for a celebration.","zh":"诗中提到为庆祝而开启一只装着陈年酒的 cadus。"}]}],"synonyms":["amphora","jar","earthenware vessel","wine jar"],"phonetic":"ˈkeɪdəs","extraExplanation":["“cadus”源自拉丁语，指古代常见的储存容器；在英语里属于较少见、偏古典/文学用词，常出现在古罗马题材、考古说明或诗歌翻译中。","在古典文学里，涉及酒宴、节庆或“开启陈酒”的意象时，有时会用到类似“cadus of wine”的表达，用来营造古罗马生活的氛围。"]}
{"word":"CADV","summary":{"en":"CADV is a grammar abbreviation meaning “conjunctive adverb,” a transition word like however or therefore.","zh":"CADV 是语法缩写，表示“连接副词”，即 however、therefore 这类过渡词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(grammar, abbreviation) conjunctive adverb: an adverbial word/phrase that connects ideas between sentences or clauses (similar to a transition), e.g., however, therefore, instead.","zh":"（语法缩写）连接副词：用来连接句子或分句之间逻辑关系的副词/副词短语（类似“过渡词”），如 however、therefore、instead。"},"examples":[{"en":"In some grammar notes, words like “however” and “therefore” are labeled as CADV (conjunctive adverbs).","zh":"在一些语法资料里，“however”“therefore”等会被标注为 CADV（连接副词）。"},{"en":"I was tired; however, I kept working. (“However” works as a CADV here.)","zh":"我很累；然而，我还是继续工作。（这里的 however 是连接副词。）"}]}],"synonyms":["conjunctive adverb","transition word","sentence adverb (close meaning)"],"phonetic":"/ˌsiː eɪ diː ˈviː/","extraExplanation":["CADV 常见于语法标注、词性标记（tagging）或课堂讲义中，不是日常写作里会直接用到的“单词”。","连接副词通常表达转折（however, nevertheless）、因果（therefore, thus）、补充（moreover, furthermore）、对比/替代（instead, rather）等逻辑关系。","在英语写作中，连接副词常见标点搭配是：句号 + 连接副词 + 逗号（\"It was late. However, ...\"）或分号 + 连接副词 + 逗号（\"It was late; however, ...\"）。"]}
{"word":"Cadwal","summary":{"en":"Cadwal is a Welsh male given name, often used as a short form of longer traditional Welsh names.","zh":"Cadwal 是威尔士男性名字，常作为较长的传统威尔士名字的简称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Welsh masculine given name; often a shortened form of names like Cadwaladr or Cadwallon.","zh":"威尔士男性名字；常见于 Cadwaladr（卡德瓦拉德尔）或 Cadwallon（卡德瓦隆）等名字的简称。"},"examples":[{"en":"Cadwal is a traditional Welsh name you might see in medieval history.","zh":"Cadwal 是一个传统的威尔士名字，你可能会在中世纪历史中看到。"},{"en":"The character was named Cadwal to give the story a Welsh flavor.","zh":"这个角色取名 Cadwal，是为了让故事更有威尔士风格。"}]}],"synonyms":["Cadwaladr","Cadwallon"],"phonetic":"/ˈkæd.wɔl/","extraExplanation":["在威尔士语中，名字里的 cad- 常与“战斗、战士”相关（如 Cadwaladr、Cadwallon 等）。因此 Cadwal 常给人一种“古老、史诗、英雄气质”的文化联想。","Cadwal 在现代英语语境里并不常见，多见于历史、家谱、奇幻/历史小说取名，或作为威尔士文化元素出现。"]}
{"word":"cadwal","summary":{"en":"Cadwal is a rare Welsh male name, linked to Welsh history and meanings like “battle” and “leader.”","zh":"Cadwal 是一个较少见的威尔士男性名字，常见于威尔士历史语境，含义大致与“战斗”“领袖”相关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Welsh masculine given name (often seen as a shortened form of Cadwaladr), historically connected with medieval Welsh royalty and meaning related to “battle” and “leader/ruler.”","zh":"一个威尔士男性名字（常被视为 Cadwaladr 的简称），与中世纪威尔士王族历史相关，词源含义大致与“战斗”“领袖/统治者”有关。"},"examples":[{"en":"Cadwal is a rare name, but you may see it in books about Welsh history.","zh":"Cadwal 这个名字比较少见，但你可能会在讲威尔士历史的书里看到它。"},{"en":"In some family trees, Cadwal appears as a shortened form of Cadwaladr.","zh":"在一些家谱中，Cadwal 会作为 Cadwaladr 的简称出现。"}]}],"synonyms":["Cadwaladr","Cadwallon"],"phonetic":"ˈkædˌwɑl","extraExplanation":["“Cadwal”主要出现在威尔士语与威尔士历史语境中：cad- 常与“战斗”有关；-wal 常与“统治/领导”相关（不同资料解释略有差异）。","历史人物方面，常被提及的是威尔士的国王 Cadwallon ap Cadfan（名字更常写作 Cadwallon），因此学习时要注意拼写相近的变体：Cadwal / Cadwallon / Cadwaladr。"]}
{"word":"Cadwallader","summary":{"en":"Cadwallader is a Welsh personal name and surname.","zh":"Cadwallader 是一个威尔士人名，也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Welsh masculine given name and a surname (a proper noun), often associated with Wales and sometimes found in English-speaking countries through Welsh heritage.","zh":"一个威尔士男性名字，也可作姓氏（专有名词）；常与威尔士文化相关，并因威尔士裔移民而出现在英语国家。"},"examples":[{"en":"Cadwallader is a traditional Welsh name that you may see in old records.","zh":"Cadwallader 是一个传统的威尔士名字，你可能会在旧档案里看到。"},{"en":"Her last name is Cadwallader, reflecting her family’s Welsh roots.","zh":"她的姓是 Cadwallader，体现了她家族的威尔士血统。"}]}],"synonyms":["Cadwaladr","Cadwalladar","Cadwalader"],"phonetic":"/kædˈwɑːlədər/","extraExplanation":["这个名字源自威尔士语传统，常被解释为与“战斗（cad）”相关，整体带有“战场领袖/战斗统帅”之类的含义（不同资料翻译略有差异）。","历史上有多位名为 Cadwallader（或 Cadwaladr）的威尔士统治者与传说人物；英语文本中常见的拼写包括 Cadwallader 与更接近威尔士语的 Cadwaladr。","在现代英语里它主要作为人名使用，不作为普通词汇；遇到时通常需要按姓名来理解和大写。"]}
{"word":"cadweed","summary":{"en":"Cadweed is a rare/older plant word, often a variant of “cudweed,” referring to a small wild plant with woolly leaves.","zh":"Cadweed 是较罕见/偏旧的植物词，常被看作 cudweed 的异拼，指一种叶片带绒毛的野生小草本。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A plant name used in some older or less common writing; often treated as a variant spelling of “cudweed,” a small wild plant with soft, woolly leaves.","zh":"一种植物名称，在较旧或较少见的用法中出现；常被视为“cudweed（绒毛草/鼠曲草类）”的异拼，指叶片带绒毛、常见于野外的小草本植物。"},"examples":[{"en":"In some old garden notes, cadweed is mentioned as a common weed in dry fields.","zh":"在一些旧的园艺笔记里，cadweed 被提到是干燥田地里常见的杂草。"},{"en":"The meadow was dotted with small, woolly plants that some writers called cadweed.","zh":"草地上点缀着一些带绒毛的小植物，有些作者把它们称为 cadweed。"}]}],"synonyms":["cudweed","cottonweed"],"phonetic":"/ˈkædˌwiːd/","extraExplanation":["“cadweed”并不是现代英语里非常常见的标准词形；很多词典与植物资料更常见的是“cudweed”，指菊科中一类叶面有绒毛的野草（不同地区可能对应不同近缘种）。如果你是在某本书、诗歌或旧文献里看到 cadweed，它很可能是地区性/历史性的拼写差异。","若你愿意，可以告诉我你看到这个词的句子或出处（书名/段落），我可以帮你更准确判断它指的是哪一种植物，以及中文常见对译。"]}
{"word":"Cadwell","summary":{"en":"Cadwell is usually a proper noun: a surname (often a variant of Caldwell) and sometimes a place name.","zh":"Cadwell 通常是专有名词：多为姓氏（常见为 Caldwell 的变体），有时也可作地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname); a less common spelling of “Caldwell.”","zh":"姓氏；是 “Caldwell” 的一种较少见的拼写。"},"examples":[{"en":"Ms. Cadwell will lead the meeting today.","zh":"Cadwell 女士今天将主持会议。"},{"en":"I saw the name Cadwell on the attendance list.","zh":"我在出勤名单上看到了 Cadwell 这个名字。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name in some English-speaking regions (often related to or confused with “Caldwell”).","zh":"在一些英语地区用作地名（常与 “Caldwell” 有关联或容易混淆）。"},"examples":[{"en":"They drove through Cadwell on the way to the coast.","zh":"他们去海边的路上开车经过了 Cadwell。"}]}],"synonyms":["Caldwell"],"phonetic":"/ˈkæd.wɛl/","extraExplanation":["Cadwell 多见于英文姓名或地名拼写。实际使用中，它常被认为是更常见拼写 Caldwell 的变体或误写。","Caldwell 这一类姓氏/地名常被解释为源自古英语地名构词，含义大致与“冷泉/冷井（cold well）”有关；但具体到某个家族或地点，来源可能因地区与历史而不同。"]}
{"word":"cadwell","summary":{"en":"Cadwell is mainly used as a proper name: a surname and a place name (notably a village in Lincolnshire, England).","zh":"Cadwell 主要作为专名使用：可作姓氏，也可作地名（尤其指英国林肯郡的一个村/聚落）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"（人名）姓氏：Cadwell。"},"examples":[{"en":"Dr. Cadwell will see you at 3 p.m.","zh":"Cadwell 医生会在下午三点见你。"},{"en":"I met Ms. Cadwell at a community meeting.","zh":"我在一次社区会议上认识了 Cadwell 女士。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name, especially Cadwell in Lincolnshire, England; also used in a few other locations as a proper name.","zh":"（地名）Cadwell，尤其指英国英格兰林肯郡的 Cadwell；也可能用作其他地方的专名。"},"examples":[{"en":"They drove through Cadwell on the way to Louth.","zh":"他们去劳斯（Louth）的路上开车经过 Cadwell。"},{"en":"Cadwell is a small rural area with farmland nearby.","zh":"Cadwell 是个小型乡村地区，附近有农田。"}]}],"synonyms":["Caldwell (common spelling variant)"],"phonetic":"/ˈkæd.wɛl/","extraExplanation":["Cadwell 多见于专有名词（姓氏或地名），不是常见的普通英语词汇。","它常被当作 Caldwell 的拼写变体（Caldwell 更常见），两者在英语国家都可能作为姓氏出现；在检索或填写信息时，可留意是否存在拼写差异。","英国林肯郡的 Cadwell 是一个小村/聚落名；如果你是在地图、地址或家谱材料里看到该词，通常指的就是地名或姓氏。"]}
{"word":"Cady","summary":{"en":"Cady is most commonly a female given name; it can also refer to a smooth, lightweight fabric used in clothing.","zh":"Cady 最常见是女性名字；也可指一种用于服装的光滑轻薄面料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (usually feminine), sometimes used as a nickname for names like Cadence or Catherine","zh":"人名（多为女性名），有时也可作昵称，如 Cadence 或 Catherine 的简称"},"examples":[{"en":"Cady is in my English class this semester.","zh":"Cady 这学期和我同上一门英语课。"},{"en":"Her name is Cadence, but everyone calls her Cady.","zh":"她的名字是 Cadence，但大家都叫她 Cady。"}]},{"partOfSpeech":"n.","definition":{"en":"a smooth, lightweight fabric (often silk or a silk-like material), used especially for dresses and linings","zh":"一种光滑、轻薄的面料（常为真丝或仿真丝），尤用于连衣裙或里衬"},"examples":[{"en":"The dress is made of black cady and feels very smooth.","zh":"这条裙子是黑色 cady 面料做的，摸起来很顺滑。"},{"en":"Cady is popular for formal wear because it drapes nicely.","zh":"cady 因为垂坠感好，所以常用于礼服。"}]}],"synonyms":["Cadie","Katie (similar-sounding name)","silk twill (similar fabric type)"],"phonetic":"/ˈkeɪdi/","extraExplanation":["作为人名时，Cady 在美国英语里常被读作 /ˈkeɪdi/，更常见于女性名字；在流行文化中也有人物名用到（例如电影《Mean Girls》里的主角名）。","作为面料名的 cady 多见于时尚与服装语境，常指具有良好垂坠感与细腻表面的织物；在服装标签或面料介绍中出现的频率更高。"]}
{"word":"cady","summary":{"en":"Cady is a formal-wear fabric with a soft drape and a slightly crepe-like texture.","zh":"Cady是一种常用于礼服等正式服装的面料，垂坠柔软，带轻微绉感纹理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of soft, slightly textured fabric (often silk, wool, or polyester), used especially for dresses and formal clothing; it usually has a smooth side and a more matte, crepe-like side","zh":"一种较柔软、略有纹理的面料（常见材质有真丝、羊毛或涤纶），常用于连衣裙和礼服；通常一面较光滑，另一面更哑光、带绉感"},"examples":[{"en":"The designer chose ivory cady for the wedding dress because it drapes beautifully.","zh":"设计师为婚纱选择了象牙白的cady面料，因为它垂坠感很好。"},{"en":"Her blazer is made of wool cady, so it looks structured but still soft.","zh":"她的西装外套是羊毛cady做的，所以版型挺括但手感仍然柔和。"}]}],"synonyms":["crepe","crêpe","dress fabric","formalwear fabric"],"phonetic":"/ˈkeɪdi/","extraExplanation":["“cady”多见于服装、面料说明和时尚语境，属于较专业的纺织词汇；在日常口语里更常说“crepe（绉纱/绉布）”或直接说“silk/wool fabric（真丝/羊毛面料）”。","该词在时尚行业里常写作“cady”或“silk cady / wool cady”，强调其垂坠性和适合正式剪裁的特性。"]}
{"word":"cadying","summary":{"en":"“Caddying” means working as a golf caddie—carrying clubs and often helping the golfer during a round.","zh":"“Caddying”指当高尔夫球童——背球杆，并常常在一轮比赛中协助球手。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of working as a caddie (a person who carries a golfer’s clubs and may give advice)","zh":"当球童；做球童的行为（球童会帮高尔夫球手背球杆，有时也会提供建议）"},"examples":[{"en":"He earned extra money in college by caddying on weekends.","zh":"他大学时周末当球童赚点外快。"},{"en":"Caddying taught her how to read the greens and stay calm under pressure.","zh":"当球童让她学会了如何看果岭、并在压力下保持冷静。"}]},{"partOfSpeech":"vi.","definition":{"en":"to work as a caddie for a golfer","zh":"当球童；为高尔夫球手背球杆并协助比赛"},"examples":[{"en":"I caddied for a local pro during a charity tournament.","zh":"我在一场慈善赛中为一位本地职业选手当球童。"},{"en":"She started caddying at sixteen at the country club.","zh":"她16岁就在乡村俱乐部开始当球童。"}]}],"synonyms":["working as a caddie","caddie work"],"phonetic":"/ˈkædiɪŋ/","extraExplanation":["“cadying”通常是拼写错误，更常见的正确拼法是 **caddying**（两个 d）。","在高尔夫文化里，球童不只是“背包的人”，优秀球童还会帮球手判断距离、风向、球道落点等；在一些职业比赛中，球童甚至被视为重要的比赛伙伴。"]}
{"word":"Cadyville","summary":{"en":"Cadyville is a hamlet (small community) in Clinton County, upstate New York.","zh":"Cadyville 是美国纽约州北部克林顿县的一个小社区（小村落/聚落）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A small community (hamlet) in Clinton County, in upstate New York, USA.","zh":"美国纽约州北部克林顿县的一个小社区（小村落/聚落）。"},"examples":[{"en":"Cadyville is a quiet hamlet in Clinton County, New York.","zh":"Cadyville 是纽约州克林顿县一个安静的小社区。"},{"en":"We drove through Cadyville on our way toward the Adirondacks.","zh":"我们开车经过 Cadyville，前往阿迪朗达克山区。"}]}],"phonetic":"/ˈkeɪdiˌvɪl/","extraExplanation":["Cadyville 属于美国地名中的“hamlet”（小村落/非建制社区），通常没有独立市政府，行政上常隶属于更大的 town（镇）。","它位于纽约州北部（upstate New York），地理与旅游语境里常与 Adirondacks（阿迪朗达克山区）或 Plattsburgh（普拉茨堡）一带联系在一起。"]}
{"word":"Cadzand","summary":{"en":"Cadzand is a coastal village and resort in Zeeland, the Netherlands.","zh":"Cadzand 是荷兰泽兰省的一个海滨村庄与度假地。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a village (and seaside resort) in the province of Zeeland in the southwestern Netherlands, near the Belgian border","zh":"卡德赞德（荷兰西南部泽兰省的一个村庄/海滨度假地，靠近比利时边境）"},"examples":[{"en":"We spent the weekend in Cadzand to enjoy the beach and fresh seafood.","zh":"我们在卡德赞德度过周末，享受海滩和新鲜海鲜。"},{"en":"Cadzand is a quiet coastal place in Zeeland, popular with cyclists.","zh":"卡德赞德是泽兰省一个安静的海滨地方，很受骑行者欢迎。"}]}],"phonetic":"/kædˈzænd/","extraExplanation":["“Cadzand”是荷兰地名，英语里通常按近似读音来念；在旅行语境中常与“Cadzand-Bad”（海滨度假区）一起出现。","该地区以海滩、沙丘和海岸散步闻名；也有人来这里寻找海滩上的小化石或贝壳。"]}
