{"word":"CAE","summary":{"en":"CAE most commonly refers to the Cambridge C1 Advanced English exam; it can also mean different things (e.g., Computer-Aided Engineering) depending on context.","zh":"CAE 最常指剑桥 C1 Advanced 英语考试；也可能因语境不同代表其他含义（如计算机辅助工程）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Cambridge English: Advanced (now officially called C1 Advanced), a high-level English exam that tests advanced reading, writing, listening, speaking, and use of English.","zh":"剑桥高级英语考试（Cambridge English: Advanced，现官方名称为 C1 Advanced），用于评估较高水平的英语能力，涵盖阅读、写作、听力、口语以及语法与词汇运用。"},"examples":[{"en":"I’m studying for the CAE this summer because my university requires a C1 level.","zh":"我今年夏天在准备 CAE，因为我的大学要求英语达到 C1 水平。"},{"en":"She passed the CAE and used the certificate when applying for jobs abroad.","zh":"她通过了 CAE，并在申请海外工作时使用了该证书。"}]},{"partOfSpeech":"other","definition":{"en":"(General) An abbreviation that can also refer to other things depending on the field, such as “Computer-Aided Engineering.”","zh":"（泛指）在不同领域也可能代表其他含义的缩写，例如“计算机辅助工程（Computer-Aided Engineering）”。"},"examples":[{"en":"In mechanical design, CAE tools are used to simulate stress and heat.","zh":"在机械设计中，CAE 工具常用于模拟应力和热量。"}]}],"synonyms":["C1 Advanced","Cambridge English: Advanced"],"phonetic":"/siː eɪ iː/","extraExplanation":["在英语学习语境里，CAE 最常指剑桥英语考试体系中的“Advanced”。目前官方更常用的名称是 “C1 Advanced”，但很多人仍习惯说 CAE。","如果你是在某个专业领域（工程、会计等）看到 CAE，含义可能不同；告诉我上下文句子，我可以帮你确认具体指什么。"]}
{"word":"cae","summary":{"en":"CAE is an abbreviation that most commonly means the Cambridge C1 Advanced English exam, and can also mean Computer-Aided Engineering or Chief Audit Executive.","zh":"CAE 是一个缩写，最常见指剑桥 C1 Advanced 英语考试，也可指计算机辅助工程或首席审计执行官。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbr.) Cambridge English: Advanced, a high-level English exam (now officially called C1 Advanced).","zh":"（缩写）剑桥高级英语考试（Cambridge English: Advanced），一项高阶英语水平考试（现官方名称多为 C1 Advanced）。"},"examples":[{"en":"She passed the CAE and used the certificate to apply for a master’s program.","zh":"她通过了 CAE，并用证书申请硕士项目。"},{"en":"Many schools now call CAE “C1 Advanced.”","zh":"很多学校现在把 CAE 称为 “C1 Advanced”。"}]},{"partOfSpeech":"n.","definition":{"en":"(abbr.) Computer-Aided Engineering: using computer software to design, simulate, and test engineering products.","zh":"（缩写）计算机辅助工程：用软件进行工程设计、仿真与测试。"},"examples":[{"en":"The team used CAE to simulate airflow around the car.","zh":"团队用 CAE 来模拟汽车周围的气流。"},{"en":"CAE tools help engineers find problems before building a prototype.","zh":"CAE 工具能帮助工程师在制作原型前发现问题。"}]},{"partOfSpeech":"n.","definition":{"en":"(abbr.) Chief Audit Executive: the top person responsible for internal auditing in an organization.","zh":"（缩写）首席审计执行官：组织中负责内部审计的最高负责人。"},"examples":[{"en":"The CAE reported the audit results to the board.","zh":"CAE 向董事会汇报了审计结果。"}]}],"synonyms":["C1 Advanced","Cambridge English: Advanced","computer-aided engineering","internal audit head"],"phonetic":"/ˌsi eɪ ˈi/","extraExplanation":["“CAE”是缩写，具体含义取决于语境。教育领域最常见的是剑桥英语考试中的“Cambridge English: Advanced”，近年来官方更常用“C1 Advanced”这一名称。工程领域则常指“Computer-Aided Engineering”，与CAD（计算机辅助设计）关系紧密：CAD偏画图与建模，CAE偏分析与仿真。"]}
{"word":"caeca","summary":{"en":"Caeca is the plural form of caecum, meaning blind-ended pouches—especially the cecum at the start of the large intestine.","zh":"Caeca 是 caecum 的复数，指盲端囊状结构，尤指大肠起始处的盲肠。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of caecum: one or more blind-ended pouches in the body, especially the pouch at the beginning of the large intestine (the cecum).","zh":"caecum 的复数：指身体中一个或多个“盲端囊状结构”，尤指大肠起始处的盲肠（cecum）。"},"examples":[{"en":"The surgeon examined the caeca for signs of inflammation.","zh":"外科医生检查了盲肠（caeca）是否有发炎迹象。"},{"en":"In this diagram, the caeca are located where the small intestine meets the large intestine.","zh":"在这张示意图中，盲肠（caeca）位于小肠与大肠连接处。"}]},{"partOfSpeech":"n.","definition":{"en":"(biology) blind-ended sacs in some animals’ digestive systems, often helping with digestion (for example, in insects or birds).","zh":"（生物学）某些动物消化系统中的盲端囊，常帮助消化（例如昆虫或鸟类）。"},"examples":[{"en":"Some insects have caeca that increase the surface area for digestion.","zh":"一些昆虫有肠盲囊（caeca），能增加消化的表面积。"},{"en":"Researchers compared gut caeca across different species.","zh":"研究人员比较了不同物种的肠盲囊（caeca）。"}]}],"synonyms":["ceca","blind pouches"],"phonetic":"/ˈsiːkə/","extraExplanation":["“caeca”来自拉丁语“caecus”（意为“盲的”），所以它常用来描述“末端封闭、没有出口”的囊状结构。","拼写上容易和“cacti / cactus”那类拉丁复数混淆：caecum（单数）→ caeca（复数）。医学与生物学文章里更常见。"]}
{"word":"caecal","summary":{"en":"Caecal means “related to the cecum,” the first part of the large intestine.","zh":"caecal 意为“盲肠的/与盲肠相关的”，常用于医学表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the cecum (also spelled caecum), a pouch at the beginning of the large intestine.","zh":"与盲肠有关的；盲肠的（盲肠是大肠起始处的囊状部分）。"},"examples":[{"en":"The doctor found mild caecal inflammation on the scan.","zh":"医生在影像检查中发现轻度盲肠炎症。"},{"en":"Caecal pain can sometimes feel similar to appendicitis.","zh":"盲肠部位的疼痛有时感觉会类似阑尾炎。"}]}],"synonyms":["cecal"],"phonetic":"/ˈsiːkəl/","extraExplanation":["“caecal”多用于医学语境（解剖学、影像报告、手术记录）。在美式英语里更常见拼写是“cecal”，英式英语更常见“caecal”。两者意思相同。","词源来自拉丁语“caecum”（盲肠），与“cecum/caecum”这一解剖名词同源。"]}
{"word":"caecally","summary":{"en":"Caecally means “in a way related to the cecum (caecum).” It’s mainly used in medical or biological writing.","zh":"caecally意为“以与盲肠有关的方式/在盲肠层面上”，主要见于医学或生物学写作。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to the cecum (caecum)—the pouch-like beginning of the large intestine.","zh":"以与盲肠（cecum/caecum）有关的方式；在盲肠部位/层面上。"},"examples":[{"en":"The medication is delivered caecally in this animal study.","zh":"在这项动物研究中，药物以盲肠途径/在盲肠部位给药。"},{"en":"Researchers measured caecally produced gases during fermentation.","zh":"研究人员测量了发酵过程中在盲肠产生的气体。"}]}],"synonyms":["cecally"],"phonetic":"/ˈsiːkəli/","extraExplanation":["“caecally”是医学/动物学里较少见的副词，更多时候会看到形容词“caecal/cecal”（盲肠的）或名词“caecum/caecum”（盲肠）。","拼写差异：英式更常见“caecum/caecal”，美式更常见“cecum/cecal”。“caecally”与“cecally”意义相同，只是拼写不同。"]}
{"word":"caecectomy","summary":{"en":"Caecectomy means surgically removing the cecum.","zh":"Caecectomy 指通过手术切除盲肠。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical operation to remove the cecum (the first part of the large intestine).","zh":"盲肠切除术：通过手术切除盲肠（大肠的起始部分）。"},"examples":[{"en":"The patient underwent a caecectomy after severe inflammation of the cecum.","zh":"由于盲肠严重发炎，患者接受了盲肠切除术。"},{"en":"The surgeon explained the risks and benefits of a caecectomy before the procedure.","zh":"手术前，外科医生解释了盲肠切除术的风险与益处。"}]}],"synonyms":["cecectomy","cecum resection","resection of the cecum"],"phonetic":"/siːˈkɛk.tə.mi/","extraExplanation":["“caecectomy”属于医学术语，词根来自拉丁语：caecum（盲的/盲肠，指肠道起始的“盲端”结构）+ -ectomy（切除术）。","临床上它比“appendectomy（阑尾切除术）”少见；是否需要做取决于病因与病变范围（如严重炎症、肿瘤等），具体应由专业医生评估。"]}
{"word":"caecias","summary":{"en":"Caecias is an ancient name for the northeast wind.","zh":"Caecias 是古代对“东北风”的称呼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In ancient Greek and Roman geography/meteorology) the northeast wind.","zh":"（古希腊/古罗马地理与气象用语）东北风。"},"examples":[{"en":"In some ancient wind-roses, Caecias is the northeast wind, bringing cold, dry air.","zh":"在一些古代风向图（wind-rose）中，Caecias 指东北风，常被认为带来寒冷、干燥的空气。"},{"en":"The text names Boreas, Eurus, and Caecias to describe shifting winds at sea.","zh":"文中提到 Boreas、Eurus 和 Caecias，用来描写海上变幻的风向。"}]}],"synonyms":["northeast wind","NE wind"],"phonetic":"/ˈsiːʃiəs/","extraExplanation":["Caecias 源自古希腊语 Καικίας（Kaikías），常出现在古代“风神/风向体系”里（类似把不同方位的风分别命名）。它在现代英语中很少日常使用，多见于古典学、神话研究、古代航海或文学翻译语境。","不要和更常见的 Boreas（北风）混淆：Caecias 通常特指“东北”方向的风。"]}
{"word":"caeciform","summary":{"en":"Caeciform means ‘cecum-shaped’—a blind-ended, pouch-like form, used mainly in anatomy and zoology.","zh":"caeciform 指“盲肠样的”——呈一端封闭的囊状形态，主要用于解剖学与动物学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Shaped like a cecum (a pouch-like, blind-ended part of the intestine); having a blind-ended, pouch form.","zh":"盲肠样的；呈盲端囊状的（形似盲肠这种一端封闭的囊状结构）。"},"examples":[{"en":"In some animals, the intestine has a large caeciform pouch used for fermenting plant material.","zh":"在一些动物中，肠道有一个较大的盲肠样囊，用于发酵植物性食物。"},{"en":"The report described a caeciform dilation at the beginning of the large intestine.","zh":"报告描述了大肠起始部位出现盲肠样扩张。"}]}],"synonyms":["cecal","ceciform","blind-ended","pouch-like"],"phonetic":"/ˈsiːsɪˌfɔrm/","extraExplanation":["词源提示：caeciform 来自拉丁语 caecum（盲肠；字面有“盲的、封闭的”之意）+ -form（形状）。因此它通常用于解剖学/动物学语境，强调“像盲肠那样一端封闭、呈囊状”的结构。","用法注意：在医学英语中也常见近义表达 cecal（盲肠的）或 “blind-ended pouch”（盲端囊），但 caeciform 更强调“形状像盲肠”。"]}
{"word":"Caecilia","summary":{"en":"Caecilia is used as a Latin-style female name and as a biological genus name for certain caecilians (legless amphibians).","zh":"Caecilia 既可作拉丁风格的女性名字，也可作生物学属名，指某些蚓螈（无足两栖动物）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper name) A female given name, a Latin spelling related to Cecilia.","zh":"（专有名词）女性名字，拉丁拼写形式之一，与 Cecilia（西西莉亚）同源/相关。"},"examples":[{"en":"Caecilia is a Latinized form sometimes used in historical or academic contexts.","zh":"Caecilia 有时会作为拉丁化写法出现在历史或学术语境中。"},{"en":"In the old record, Caecilia appears as the name of a Roman woman.","zh":"在那份古老记录里，Caecilia 作为一位罗马女性的名字出现。"}]},{"partOfSpeech":"n.","definition":{"en":"(Biology) A genus name used for certain caecilians (legless, burrowing amphibians).","zh":"（生物）一种蚓螈（无足、善于掘土的两栖动物）的属名。"},"examples":[{"en":"The paper describes a species in the genus Caecilia.","zh":"这篇论文描述了 Caecilia 属中的一个物种。"},{"en":"Caecilia species are adapted to life underground.","zh":"Caecilia 属的物种适应了地下生活。"}]}],"synonyms":["Cecilia","caecilian"],"phonetic":"/səˈsɪliə/","extraExplanation":["“Caecilia”来自拉丁语词根 *caecus*（意为“盲的”）。在古罗马姓名体系中，Caecilia 是著名氏族（gens Caecilia）的女性形式；英语里更常见的对应名字是 **Cecilia**。","生物学里的 **caecilian（蚓螈）** 因眼睛退化、常在地下生活而得名；“Caecilia”作为属名也与这一词源背景有关。"]}
{"word":"caecilia","summary":{"en":"Caecilia can mean a genus of limbless amphibians (caecilians) or a less common spelling of the female name Cecilia.","zh":"Caecilia 可指蚓螈属（一类无肢两栖动物），也可作女性名字，是 Cecilia 的一种较少见拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology) A genus of caecilians—limbless, wormlike amphibians that live mostly underground in tropical regions.","zh":"（动物学）蚓螈属：一种无肢、像蚯蚓一样的两栖动物，多生活在热带地区的土壤中。"},"examples":[{"en":"Researchers found a Caecilia species by digging in wet forest soil.","zh":"研究人员在潮湿的森林土壤中挖掘时发现了一种蚓螈属（Caecilia）的物种。"},{"en":"Unlike snakes, Caecilia are amphibians and have moist skin.","zh":"与蛇不同，蚓螈属（Caecilia）属于两栖动物，皮肤湿润。"}]},{"partOfSpeech":"n.","definition":{"en":"A female given name, a variant spelling of “Cecilia.”","zh":"女性名字，“Cecilia（塞西莉亚）”的变体拼写。"},"examples":[{"en":"Caecilia is a less common spelling, but it’s pronounced similarly to Cecilia.","zh":"Caecilia 是较少见的拼写，但发音通常与 Cecilia 相近。"},{"en":"In the program, Caecilia is listed as the lead violinist.","zh":"在节目单上，Caecilia 被列为第一小提琴手。"}]}],"synonyms":["caecilian","Cecilia"],"phonetic":"/siˈsɪliə/","extraExplanation":["“Caecilia”这个拼写常见于拉丁化或学术命名语境。蚓螈属的属名来自拉丁语词根 *caecus*（“盲的”），与某些蚓螈眼睛退化、长期穴居的特征有关。","作为人名时，它对应更常见的拼写“Cecilia”。在英语文化里，Cecilia 常让人联想到圣塞西莉亚（St. Cecilia，传统上被视为音乐的守护圣人），因此也常见于音乐相关的艺术作品或命名中。"]}
{"word":"Caeciliae","summary":{"en":"*Caeciliae* is a Latin form of *Caecilia*, meaning either “of/to Caecilia” or “(the) Caecilias,” depending on context.","zh":"*Caeciliae* 是 *Caecilia* 的拉丁语变格形式，可表示“Caecilia 的/给 Caecilia”或“多个 Caecilia”，需依上下文判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A Latin inflected form of the feminine name *Caecilia*; it can mean “of Caecilia” (genitive singular) or “to/for Caecilia” (dative singular), depending on context.","zh":"拉丁语女性名字 *Caecilia* 的变格形式；在不同语境中可表示“Caecilia 的”（单数属格）或“给/对 Caecilia”（单数与格）。"},"examples":[{"en":"In the inscription, *Caeciliae* means “of Caecilia,” showing possession.","zh":"在这段铭文里，*Caeciliae* 表示“Caecilia 的”，用来表达所属关系。"},{"en":"The letter begins with *Caeciliae salutem*, meaning “greetings to Caecilia.”","zh":"信的开头写 *Caeciliae salutem*，意思是“向 Caecilia 问候/致意”。"}]},{"partOfSpeech":"other","definition":{"en":"In scientific/Latin-style writing, a plural form used to refer to “Caecilia” individuals (e.g., members of the genus *Caecilia*) or, more loosely, “caecilians,” depending on the author’s Latinization.","zh":"在科学写作或拉丁化表达中，可作为复数形式指“*Caecilia* 属的个体”（或更宽泛地指“蚓螈/无足目动物”，取决于作者的拉丁化用法）。"},"examples":[{"en":"Several *Caeciliae* were collected during the survey for comparison.","zh":"调查中采集了几只 *Caeciliae* 用于对比研究。"},{"en":"Older notes may use Latin plurals like *Caeciliae* when discussing caecilians.","zh":"较早的笔记在讨论蚓螈时，可能会用 *Caeciliae* 这类拉丁复数形式。"}]}],"synonyms":["Caecilia","Cecilia"],"phonetic":"/kəˈsɪli.iː/","extraExplanation":["*Caeciliae* 不是常见英语词，而是拉丁语的“词尾变化”（变格）形式。第一变格阴性名词常见结尾：-a（主格单数）、-ae（属格/与格单数，也可能是主格复数）。所以遇到 *Caeciliae* 时，需要根据上下文判断是“Caecilia 的/给 Caecilia”，还是“多个 Caecilia”。","名字 *Caecilia* 与英语人名 *Cecilia* 有历史关联；在西方文化中常让人联想到圣女 Cecilia（音乐家的守护圣人之一），但 *Caeciliae* 本身主要是拉丁语语法形式。"]}
{"word":"caeciliae","summary":{"en":"*caeciliae* is a Latin form meaning “of Caecilia,” “to/for Caecilia,” or sometimes “Caecilias,” depending on context.","zh":"*caeciliae* 是拉丁语 *Caecilia* 的变格形式，可表示“凯西莉娅的”“给/为凯西莉娅”，有时也可表示“凯西莉娅们”，需看上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Latin inflected form of the feminine name *Caecilia* (used in texts and inscriptions), meaning “of Caecilia” (genitive singular) or “to/for Caecilia” (dative singular); it can also mean “Caecilias” (nominative plural) depending on context.","zh":"拉丁语女性名字 *Caecilia* 的一个变格形式（常见于文献与碑铭），可表示“凯西莉娅的”（单数属格）或“给/为凯西莉娅”（单数与格）；在某些语境中也可表示“凯西莉娅们”（复数主格），需根据上下文判断。"},"examples":[{"en":"*Domus Caeciliae* means “Caecilia’s house.”","zh":"*Domus Caeciliae* 的意思是“凯西莉娅的房子”。"},{"en":"*Donum Caeciliae* can be read as “a gift for Caecilia” or “Caecilia’s gift,” depending on the sentence.","zh":"*Donum Caeciliae* 可能是“给凯西莉娅的礼物”，也可能是“凯西莉娅的礼物”，要看句子结构。"},{"en":"In a letter, *Caeciliae scribo* means “I write to Caecilia.”","zh":"在书信里，*Caeciliae scribo* 表示“我写信给凯西莉娅”。"}]}],"phonetic":"/səˈsɪlieɪ/","extraExplanation":["这是拉丁语第一变格（-a 结尾的阴性名词/人名）的典型形式：属格单数与与格单数常为 **-ae**（如 *puellae* “女孩的/给女孩”）。因此看到 *Caeciliae* 时，最重要的是结合前后词来判断它到底是“……的”、还是“给/对……”，或是否为复数主格。","*Caecilia* 是古罗马常见女性名（*Caecilius* 家族的阴性形式）。英语里常见对应名为 **Cecilia**（如圣西西莉亚 St. Cecilia，音乐的守护圣人之一）。"]}
{"word":"caecilian","summary":{"en":"A caecilian is a limbless, burrowing amphibian found mainly in tropical areas.","zh":"caecilian 指蚓螈，一种主要生活在热带地区、无足且善于掘洞的两栖动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a limbless, wormlike amphibian that lives mostly underground in tropical regions","zh":"蚓螈（无足、像蚯蚓的两栖动物，多生活在热带地区的地下）"},"examples":[{"en":"Caecilians spend much of their lives burrowing through wet soil.","zh":"蚓螈一生中有很长时间都在潮湿的土壤里钻行。"},{"en":"Because they are hard to find, caecilians are less familiar than frogs or salamanders.","zh":"由于很难见到，蚓螈不像青蛙或蝾螈那样为人熟知。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or belonging to caecilians","zh":"蚓螈的；与蚓螈有关的"},"examples":[{"en":"Scientists studied caecilian skin to learn how it resists infection.","zh":"科学家研究蚓螈的皮肤，以了解它如何抵抗感染。"}]}],"synonyms":["gymnophionan","apodan amphibian"],"phonetic":"/səˈsɪliən/","extraExplanation":["词源小知识：caecilian 来自拉丁语 *caecus*（“盲的”），因为蚓螈的眼睛非常小，有些种类几乎看不见。","生物分类背景：蚓螈属于两栖动物的一支（常见英文分类名 *Gymnophiona* 或 *Apoda*），与青蛙、蝾螈同为两栖类，但外形更像蚯蚓或蛇，常被误认。"]}
{"word":"caecilians","summary":{"en":"Caecilians are legless, worm-like amphibians, usually living underground or in tropical freshwater.","zh":"Caecilians 指“蚓螈”，一种无足、像蚯蚓的两栖动物，多在热带地下或淡水环境中生活。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Legless, worm-like amphibians that mostly live underground or in freshwater in tropical regions.","zh":"蚓螈（无足目两栖动物）：一种没有四肢、外形像蚯蚓的两栖动物，多生活在热带地区的土壤中或淡水里。"},"examples":[{"en":"Caecilians spend much of their lives underground, so people rarely see them.","zh":"蚓舮大部分时间生活在地下，所以人们很少见到它们。"},{"en":"Some caecilians live in streams and look a bit like eels.","zh":"有些蚓螈生活在溪流里，看起来有点像鳗鱼。"},{"en":"The rainforest survey recorded frogs, salamanders, and caecilians.","zh":"这次雨林调查记录到了青蛙、蝾螈和蚓螈。"}]}],"synonyms":["legless amphibians","worm-like amphibians"],"phonetic":"/sɪˈsɪliənz/","extraExplanation":["“caecilian”一词来自拉丁语 *caecus*（意为“盲的”），因为早期人们注意到它们的眼睛很小、常被皮肤覆盖，看起来像“看不见”。","蚓螈是两栖动物的一个大类群（和青蛙、蝾螈并列），并不是蛇；它们通常有环状褶皱的皮肤，适合在土里钻行。"]}
{"word":"Caeciliidae","summary":{"en":"Caeciliidae is a scientific name for a family of caecilians (legless, burrowing amphibians).","zh":"Caeciliidae 是蚓螈科的学名，指一类无足、掘土生活的两栖动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of legless, burrowing amphibians (caecilians), found mainly in tropical regions; members are worm-like and live mostly underground or in leaf litter.","zh":"（两栖动物）蚓螈科：一类无足、善于掘土生活的两栖动物（蚓螈）所属的科，主要分布在热带地区；外形像蚯蚓，多在地下或落叶层中生活。"},"examples":[{"en":"Caeciliidae includes several species of caecilians that spend most of their lives underground.","zh":"蚓螈科包含多种蚓螈，它们一生的大部分时间都生活在地下。"},{"en":"Because Caeciliidae animals are hard to spot, they are less familiar than frogs or salamanders.","zh":"由于蚓螈科动物不容易被发现，它们不像青蛙或蝾螈那样为人熟知。"}]}],"synonyms":["caecilian family"],"phonetic":"/ˌsiːsɪˈlɪədiː/","extraExplanation":["“Caeciliidae”是生物分类学中的科名（family name），常见于学术文章、物种名录与博物馆标本标签。","词形来自拉丁化的科学命名体系；复数形式在英文中通常不变（仍写作 Caeciliidae）。","蚓螈（caecilians）与青蛙、蝾螈同属两栖动物，但因隐蔽的穴居生活方式，很多人不熟悉。"]}
{"word":"caeciliidae","summary":{"en":"Caeciliidae is the scientific name for a family of caecilians—limbless, burrowing amphibians.","zh":"Caeciliidae 是蚓螈科的学名，指一类无肢、穴居的两栖动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of limbless, burrowing amphibians (caecilians), found mainly in tropical regions; members look somewhat like worms or snakes but are amphibians.","zh":"一种无肢、善于掘洞生活的两栖动物（蚓螈/盲鳗类）科，主要分布在热带地区；外形有点像蚯蚓或蛇，但属于两栖动物。"},"examples":[{"en":"Caeciliidae are caecilians that spend much of their lives underground.","zh":"Caeciliidae（蚓螈科）的动物一生中很大一部分时间都生活在地下。"},{"en":"The researcher compared skull shapes across Caeciliidae to study their feeding habits.","zh":"研究人员比较了蚓螈科不同物种的头骨形态，以研究它们的取食习性。"}]}],"synonyms":["caecilians (common term)"],"phonetic":"/ˌsiːsɪˈliːədiː/","extraExplanation":["“Caeciliidae”是动物分类学名，属于“蚓螈目（Gymnophiona）”中的一个“科（family）”。学术写作中通常首字母大写并用斜体表示属/种名，但“科名”在英文里常见的是非斜体。","日常英语中很少用到这个词；更多会用更通俗的“caecilians（蚓螈/盲鳗类）”。如果你在科普或论文中看到它，通常是在讨论物种分类、分布或解剖特征。"]}
{"word":"caecitis","summary":{"en":"Caecitis means inflammation of the cecum (the beginning of the large intestine).","zh":"Caecitis 指盲肠（大肠起始部位）的炎症。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) Inflammation of the cecum (caecum), the first part of the large intestine.","zh":"（医学）盲肠炎：盲肠（大肠起始部位）的炎症。"},"examples":[{"en":"The doctor considered caecitis after the patient developed pain in the lower right abdomen.","zh":"病人出现右下腹疼痛后，医生考虑可能是盲肠炎。"},{"en":"Caecitis can sometimes be confused with appendicitis because the symptoms are similar.","zh":"由于症状相似，盲肠炎有时会与阑尾炎混淆。"}]}],"synonyms":["cecitis","typhlitis (related, often used for inflammation of the cecum, sometimes in specific clinical contexts)"],"phonetic":"/siˈsaɪtɪs/","extraExplanation":["“caecitis”由拉丁词根 *caec-*（= caecum，盲肠）和后缀 *-itis*（炎症）构成。在英式拼写中常见 *caecum*，而美式医学写作里也常见简化为 *cecum*，因此你也可能看到 *cecitis* 这种拼法。","学习相关词：*appendicitis*（阑尾炎）、*colitis*（结肠炎）、*ileitis*（回肠炎）。这些词的共同点是 *-itis* 表示“炎症”。"]}
{"word":"caecity","summary":{"en":"A formal/medical word meaning blindness.","zh":"一个较正式/医学用词，表示“失明”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Blindness; the condition of being unable to see.","zh":"失明；看不见的状态。"},"examples":[{"en":"The illness can lead to caecity if it is not treated early.","zh":"如果不及早治疗，这种疾病可能会导致失明。"},{"en":"The report focuses on preventing caecity caused by eye infections.","zh":"这份报告重点讨论预防由眼部感染引起的失明。"}]}],"synonyms":["blindness","loss of sight"],"phonetic":"/ˈsiːsəti/","extraExplanation":["“caecity”是比较少见、偏医学/学术的词，日常英语里更常用“blindness”。","词源来自拉丁语 *caecus*（盲的）。在医学语境中你也可能看到相关词形，如 *caecal*（与盲肠有关，注意与“失明”无关）——拼写相近但意义不同。"]}
{"word":"caecocolic","summary":{"en":"A medical adjective meaning “connected with the cecum and the colon.”","zh":"医学形容词，表示“与盲肠和结肠有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the cecum (the first part of the large intestine) and the colon.","zh":"与盲肠（大肠起始部位）和结肠有关的。"},"examples":[{"en":"The CT report described mild caecocolic inflammation.","zh":"CT 报告描述为轻度盲肠-结肠炎症。"},{"en":"The pain was localized to the right lower abdomen near the caecocolic region.","zh":"疼痛定位在右下腹，接近盲肠-结肠区域。"}]}],"synonyms":["cecocolic","ileocecal (related area)"],"phonetic":"/ˌsiːkoʊˈkɑːlɪk/","extraExplanation":["这是一个医学/解剖学形容词，常见于影像学报告（如 CT、超声）或病历记录中，用来概括“盲肠与结肠交界附近”的部位或相关病变。","英式拼写常见为 caeco-（与 caecum 相关），美式医学写作中也可能见到 ceco-。"]}
{"word":"caecostomy","summary":{"en":"A caecostomy is a surgical opening made into the cecum for drainage or decompression.","zh":"caecostomy 指“盲肠造口术”：在盲肠造开口以便引流或减压。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surgical procedure that creates an opening (stoma) into the cecum (the first part of the large intestine) for drainage, decompression, or access.","zh":"一种外科手术：在盲肠（大肠的起始部分）造一个开口（造口），用于引流、减压或提供进入肠道的通路。"},"examples":[{"en":"The surgeon performed a caecostomy to decompress the large bowel.","zh":"外科医生进行了盲肠造口术，以给大肠减压。"},{"en":"After the caecostomy, nurses monitored the stoma site for infection.","zh":"盲肠造口术后，护士监测造口部位是否感染。"}]}],"synonyms":["cecostomy","cecal stoma (general)"],"phonetic":"/ˌsiːˈkɑːstəli/","extraExplanation":["词源：caeco- 来自拉丁语 caecum（盲肠），-stomy 表示“造口/开口”的外科手术（如 colostomy 结肠造口术、ileostomy 回肠造口术）。","用法提示：英式拼写常见为 caecostomy；美式医学文献中也可能写作 cecostomy（去掉 a）。两者通常指同一类手术。","临床背景（概念性）：常用于肠道减压（如严重结肠胀气/梗阻风险）或作为进入结肠的通路；具体适应证与方案由医生根据病情决定。"]}
{"word":"caecotomy","summary":{"en":"Caecotomy is a medical term for making a surgical cut into the cecum, often to decompress or drain it.","zh":"Caecotomy 指对盲肠进行外科切开，常用于减压或引流。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical incision into the cecum (the first part of the large intestine), usually done to relieve pressure, drain contents, or gain access for treatment.","zh":"盲肠切开术：在盲肠（大肠的起始部位）上做外科切口，通常用于减压、引流内容物或便于治疗操作。"},"examples":[{"en":"In severe intestinal obstruction, the surgeon may perform a caecotomy to decompress the bowel.","zh":"在严重肠梗阻时，外科医生可能会进行盲肠切开术来给肠道减压。"},{"en":"The medical report noted a caecotomy followed by irrigation and drainage.","zh":"病历记录写到进行了盲肠切开术，随后冲洗并引流。"}]}],"synonyms":["cecotomy","cecostomy (related, but involves creating an opening/stoma rather than just an incision)"],"phonetic":"/siˈkɑːtəmi/","extraExplanation":["这是一个医学专用词，较少出现在日常英语中。词根可拆为：caeco-（盲肠）+ -tomy（切开术）。美式英语里也常见拼写 cecotomy（更常用）以及 caecotomy（较偏英式/学术）。","与之相对的后缀 -ectomy 表示“切除术”（如 appendectomy 阑尾切除术），而 -tomy 更强调“切开/切口”。"]}
{"word":"caecum","summary":{"en":"The caecum is the first pouch-like part of the large intestine where the small intestine joins it.","zh":"caecum 指小肠与大肠连接处的大肠起始囊状部位，即盲肠。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A pouch-like part of the large intestine at the point where the small intestine joins it; it is the first section of the colon (the appendix is attached to it in humans).","zh":"盲肠：大肠起始处的囊状结构，位于小肠与大肠连接处；在人类中，阑尾附着于盲肠。"},"examples":[{"en":"In humans, the appendix is connected to the caecum.","zh":"在人类中，阑尾与盲肠相连。"},{"en":"The doctor explained that inflammation near the caecum can cause lower right abdominal pain.","zh":"医生解释说，盲肠附近的炎症可能引起右下腹疼痛。"},{"en":"Some herbivores have a large caecum to help digest plant material.","zh":"一些食草动物的盲肠较大，用来帮助消化植物性食物。"}]}],"synonyms":["cecum"],"phonetic":"/ˈsiːkəm/","extraExplanation":["“caecum”常见于英式拼写；美式更常写作“cecum”，读音相同。","词源来自拉丁语“caecus”（意为“盲的”），指这段肠道像“盲端”一样呈囊状。医学语境里常与“appendix（阑尾）”“ileum（回肠）”一起出现。"]}
{"word":"caedere","summary":{"en":"*Caedere* is a Latin verb meaning “to cut; to strike; (by extension) to kill,” and it appears in English through forms like -cide and -cision.","zh":"*Caedere* 是拉丁语动词，意为“切割；击打；（引申）杀死”，并通过 -cide、-cision 等形式进入英语词汇系统。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Latin) to cut; to strike or beat; by extension, to kill or slaughter.","zh":"（拉丁语）切割；击打；引申为杀死、屠杀。"},"examples":[{"en":"In Latin, *caedere* means “to cut” or “to kill,” and it is the source of English endings like **-cide**.","zh":"在拉丁语中，*caedere* 的意思是“切割/杀死”，它也是英语后缀 **-cide** 的来源。"},{"en":"Words like **homicide** and **suicide** keep the older idea of “killing” from *caedere*.","zh":"像 **homicide（他杀）**、**suicide（自杀）** 这样的词保留了 *caedere* “杀死”的含义。"},{"en":"The related Latin noun *caesura* originally referred to a “cut,” and in poetry it means a pause or break in a line.","zh":"相关的拉丁名词 *caesura* 原意是“切口”，在诗歌中指诗行中的停顿或断裂。"}]}],"synonyms":["cut","strike","kill","slay"],"phonetic":"/ˈkaɪ.deɪ.reɪ/","extraExplanation":["*caedere* 是很多英语词根的源头，常见变化包括 **-cide**（杀：genocide, pesticide）、**-cision/-cise**（切：incision, precise 的历史关联）、以及 **caes-**（如 *Caesar* 可能与“切开/剖腹”民间说法有关，但多被认为缺乏可靠证据）。","在英语里看到 **-cide** 基本可理解为“杀/灭”，看到 **-cision** 往往与“切/割/切开”相关（医学和解剖学词汇中特别常见）。"]}
{"word":"Caedmon","summary":{"en":"Caedmon (Cædmon) is a famous 7th‑century figure associated with the earliest Old English religious poetry, especially “Cædmon’s Hymn.”","zh":"Caedmon（Cædmon，凯德蒙）是与最早的古英语宗教诗歌相关的7世纪人物，尤以《凯德蒙赞歌》闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditionally recognized early English poet and Christian singer (7th century), known for composing religious poetry in Old English, especially “Cædmon’s Hymn.”","zh":"（凯德蒙）传统上被认为是7世纪早期的英国诗人、基督教吟唱者，以用古英语创作宗教诗歌而闻名，尤以《凯德蒙赞歌》最著名。"},"examples":[{"en":"Cædmon is often called one of the earliest named poets in English literary history.","zh":"凯德蒙常被称为英语文学史上最早有姓名可考的诗人之一。"},{"en":"In class, we read an English translation of “Cædmon’s Hymn.”","zh":"课堂上我们读了《凯德蒙赞歌》的英文译文。"}]}],"synonyms":["Cædmon"],"phonetic":"/ˈkædmən/","extraExplanation":["“Cædmon”的故事主要出自修士比德（Bede）的《英吉利教会史》。传说他原本不会作诗，在一次梦境（或神启）后开始用古英语创作宗教诗歌，因此常被用来讨论“口头传统”“宗教传播”与“早期英语文学”的关系。","拼写上常见 Cædmon（带 æ）与 Caedmon（用 ae 代替 æ）两种形式；现代印刷与键盘环境中更常见 Caedmon。"]}
{"word":"Caedmonian","summary":{"en":"An adjective meaning “related to Cædmon or his early English religious poetry.”","zh":"形容词，意为“与凯德蒙及其早期英语宗教诗歌有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Cædmon, an early Anglo-Saxon poet (7th century), or to his religious poetry (especially “Cædmon’s Hymn”).","zh":"与凯德蒙（Cædmon，7世纪盎格鲁-撒克逊诗人）有关的；或指他的宗教诗歌风格（尤指《凯德蒙赞歌》）。"},"examples":[{"en":"The course includes a Caedmonian poem in Old English.","zh":"这门课程包含一首用古英语写成的凯德蒙式诗作。"},{"en":"Her brief, devotional lines feel almost Caedmonian in tone.","zh":"她那几行简短的虔敬诗句在语气上几乎带有凯德蒙式的风格。"}]}],"synonyms":["Cædmonic","Old English devotional (poetry)","Anglo-Saxon religious (poetry)"],"phonetic":"ˌkædˈmoʊniən","extraExplanation":["“Caedmonian”来自人名 Cædmon（常译作“凯德蒙”）。据英国史家比德（Bede）记载，凯德蒙原是修道院的牧牛人，后来据说在梦中获得作诗的灵感，开始用古英语写宗教主题的诗歌；现存最著名的相关作品是《Cædmon’s Hymn》。因此这个词多用于文学史、古英语研究或形容“朴素而虔敬的早期英语宗教诗”风格。"]}
{"word":"caedmonian","summary":{"en":"Caedmonian means “connected with Cædmon or his early Old English Christian poetic style.”","zh":"Caedmonian 指“与凯德蒙或其早期古英语基督教诗歌风格相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Cædmon (a 7th‑century Anglo‑Saxon poet) or to his style of early Old English religious poetry.","zh":"与凯德蒙（Cædmon，7世纪盎格鲁-撒克逊诗人）有关的；或指其早期古英语宗教诗歌风格的。"},"examples":[{"en":"The essay compares Caedmonian themes with later Christian poetry in Old English.","zh":"这篇文章把凯德蒙式（Caedmonian）的主题与后来的古英语基督教诗歌作比较。"},{"en":"Scholars sometimes describe the hymn’s plain, devotional tone as Caedmonian.","zh":"学者有时把这首赞美诗朴素、虔敬的语气称为“凯德蒙式（Caedmonian）”。"}]}],"synonyms":["Cædmonic","Old English (in context)","Anglo-Saxon (in context)"],"phonetic":"/ˌkædˈmoʊniən/","extraExplanation":["Cædmon 常被认为是最早有记载的英语诗人之一，与《凯德蒙赞歌》（Cædmon’s Hymn）相关；“Caedmonian”多见于文学史、语言学或中世纪研究的学术语境中。","拼写有时也会见到含连字的 Cǣdmon（古英语长元音标记），但现代英文里通常写作 Caedmon。"]}
{"word":"Caedmonic","summary":{"en":"Caedmonic means “related to Cædmon or resembling his early English religious poetic style.”","zh":"Caedmonic 指“与凯德蒙有关，或具有其早期英语宗教诗歌风格的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Cædmon (an early English/Anglo-Saxon poet) or to the style and themes associated with his religious poetry, especially “Cædmon’s Hymn.”","zh":"与凯德蒙（Cædmon，早期英格兰/盎格鲁-撒克逊诗人）有关的；或指具有其宗教诗歌（尤指《凯德蒙赞歌》）风格与主题的。"},"examples":[{"en":"The scholar compared the poem’s diction to Caedmonic verse.","zh":"学者把这首诗的用词与“凯德蒙式”的诗歌语言作了比较。"},{"en":"A Caedmonic tone often feels simple, reverent, and hymn-like.","zh":"“凯德蒙式”的语调常给人朴素、虔敬、近似赞歌的感觉。"}]}],"synonyms":["Cædmonian (rare)","Old English religious (in sense)","Anglo-Saxon (broad)"],"phonetic":"/ˌkædˈmɑnɪk/","extraExplanation":["“Caedmonic”来自人名 Cædmon（常译“凯德蒙”）。他常被视为已知最早的英语诗人之一；关于他的故事主要见于比德（Bede）的《英吉利教会史》（Ecclesiastical History of the English People）。","“Cædmon’s Hymn（凯德蒙赞歌）”是古英语诗歌传统中的重要作品之一，因此文学研究中会用“Caedmonic”来形容带有早期古英语宗教诗歌气质（如赞美造物主、语言朴素凝练、口传诗歌的节奏感）的文本或风格。"]}
{"word":"caedmonic","summary":{"en":"“Caedmonic” means connected with Cædmon, an early Old English poet, or with his works and poetic style.","zh":"“Caedmonic”指与古英语早期诗人凯德蒙（Cædmon）及其作品或诗歌风格相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Cædmon, an early English (Old English) poet, or to his works and style.","zh":"与凯德蒙（Cædmon，早期英语/古英语诗人）有关的；指其作品或诗歌风格的。"},"examples":[{"en":"The scholar described the hymn as Caedmonic in tone and imagery.","zh":"学者形容这首赞美诗在语气和意象上具有“凯德蒙式”的特点。"},{"en":"She studied Caedmonic poetry to understand the beginnings of English religious verse.","zh":"她研究凯德蒙相关的诗歌，以理解英语宗教诗歌的早期源头。"}]}],"synonyms":["Cædmonian","Old English (in context)","Anglo-Saxon (in context)"],"phonetic":"/ˌkædˈmɑːnɪk/","extraExplanation":["“Caedmonic”源自人名 Cædmon。根据《英吉利教会史》（Bede 的《Ecclesiastical History of the English People》）记载，凯德蒙原本是一名修士的牧牛人，后来据说在梦中获得灵感开始创作宗教诗歌，因此常被称为“最早有姓名可考的英语诗人”之一。","现代学术语境里，“Caedmonic”多用于文学研究，指与凯德蒙相关的文本、主题（如宗教创世叙事）、语言与意象风格，而日常英语中非常少见。"]}
{"word":"caeg","summary":{"en":"“caeg” is not standard English; it’s usually a misspelling of “cage.”","zh":"“caeg”不是标准英语；通常是把“cage”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most often a misspelling of “cage.”","zh":"不是标准英语单词。最常见的情况是把 “cage”（笼子；把……关起来）拼错了。"},"examples":[{"en":"I think you meant “cage,” not “caeg.”","zh":"我觉得你想写的是 “cage”，不是 “caeg”。"},{"en":"Correct spelling: The bird is in a cage.","zh":"正确拼写：The bird is in a cage.（鸟在笼子里。）"}]}],"synonyms":["cage (likely intended word)"],"phonetic":"/keɪdʒ/","extraExplanation":["“caeg”本身在常见英语词典里通常找不到。如果你是在阅读某个特定领域文本（例如人名、缩写、游戏ID、地名等）看到它，可以把原句发我，我能根据上下文判断它可能指什么。"]}
{"word":"Caela","summary":{"en":"Caela is a female given name, often a variant spelling of Kayla/Cayla.","zh":"Caela 是一个女性名字，常见为 Kayla/Cayla 的拼写变体。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a female given name (a personal name), often used as a modern spelling variant of “Kayla/Cayla.”","zh":"女性名字（人名），常见为“Kayla/Cayla”的一种现代拼写变体。"},"examples":[{"en":"Caela is starting kindergarten this fall.","zh":"Caela 今年秋天要上幼儿园了。"},{"en":"My friend Caela moved to Seattle for a new job.","zh":"我的朋友 Caela 为了新工作搬到了西雅图。"},{"en":"How do you spell it—Caela or Kayla?","zh":"你怎么拼写——Caela 还是 Kayla？"}]}],"synonyms":["Kayla","Cayla","Kaela"],"phonetic":"ˈkeɪlə","extraExplanation":["“Caela”通常作为专有名词使用（人名），首字母要大写：Caela。","读音在英语里常接近“Kay-luh”。不同家庭可能会有不同的偏好拼写（如 Kayla、Cayla、Kaela），但在日常交流中常被视为同一类名字的变体。"]}
{"word":"Caeli","summary":{"en":"Caeli is mainly used as a feminine name; it also appears as a Latin form connected to “sky/heaven.”","zh":"Caeli 主要用作女性名字；也可作为与“天空/天堂”相关的拉丁语形式出现。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A feminine given name (often used in English-speaking countries), sometimes chosen for its association with Latin “caelum” meaning “sky/heaven.”","zh":"女性名字（英语国家中使用），常因与拉丁语“caelum（天空/天堂）”的含义相关而被选用。"},"examples":[{"en":"Caeli is starting a new job next week.","zh":"Caeli 下周要开始一份新工作。"},{"en":"Her parents chose the name Caeli because they loved the meaning “sky.”","zh":"她父母取名 Caeli，是因为他们喜欢“天空”这个含义。"}]},{"partOfSpeech":"other","definition":{"en":"A Latin form meaning “of the sky/heaven” (genitive singular of caelum) or “skies/heavens” (nominative plural), seen in mottoes, titles, and scientific/astronomical naming.","zh":"拉丁语形式：可表示“天空/天堂的”（caelum 的单数属格），或“天空/诸天”（复数主格）；常见于格言、标题以及科学/天文学命名中。"},"examples":[{"en":"In Latin, “regina caeli” means “queen of heaven.”","zh":"拉丁语中 “regina caeli” 意为“天后/天堂之后”。"},{"en":"Astronomy sometimes uses Latin genitives like Caeli to mean “of Caelum.”","zh":"天文学有时使用像 Caeli 这样的拉丁属格，表示“属于 Caelum（雕具座）的”。"}]}],"synonyms":["Caelum (related Latin root)","sky (meaning-related)","heaven (meaning-related)"],"phonetic":"/ˈkeɪli/","extraExplanation":["“Caeli”在英语里最常见的用法是人名，发音往往按英语习惯读。它也常被解释为源自拉丁语 caelum（天空/天堂），因此带有“天空、苍穹”的意象。","在拉丁语中，caeli 既可能是 caelum 的单数属格（表示“……的”），也可能是复数主格（表示“诸天/天空们”）。因此你会在宗教短语（如 Regina Caeli）或学术/天文命名里见到它。"]}
{"word":"Caelian","summary":{"en":"Caelian means “of or related to the Caelian Hill,” one of Rome’s seven hills.","zh":"Caelian 指“与凯利安山有关的”，凯利安山是罗马七丘之一。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Caelian Hill (Latin: Collis Caelius), one of the seven hills of ancient Rome.","zh":"与罗马七丘之一“凯利安山（Caelian Hill，拉丁语 Collis Caelius）”有关的；凯利安山的。"},"examples":[{"en":"They walked along the Caelian Hill to see early Christian churches.","zh":"他们沿着凯利安山散步，去参观早期基督教教堂。"},{"en":"The Caelian district is quieter than the areas near the Colosseum.","zh":"凯利安山区比斗兽场附近的区域更安静。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from the Caelian area (rare).","zh":"凯利安山一带的人（较少用）。"},"examples":[{"en":"In the novel, a Caelian guides the visitors through old Rome.","zh":"在小说里，一位凯利安本地人带游客穿梭于古罗马遗迹之间。"}]}],"synonyms":["Celian (variant spelling)"],"phonetic":"ˈsiːliən","extraExplanation":["“Caelian”常见于历史、考古与旅游语境，指罗马“七丘”之一的Caelian Hill（意大利语常写作 Celio）。英语里也会看到拼写变体“Celian”。","凯利安山附近有一些重要遗址与教堂（如圣斯德望圆形堂等），所以在介绍古罗马城市地理、早期基督教史时常会出现这个词。"]}
{"word":"caelian","summary":{"en":"Caelian means “of or related to the Caelian Hill,” one of the Seven Hills of Rome.","zh":"Caelian 指“凯利安山的/与凯利安山相关的”，凯利安山是罗马七丘之一。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Caelian Hill (Latin: Caelius), one of the Seven Hills of ancient Rome.","zh":"（罗马）凯利安山（Caelian Hill，拉丁语 Caelius）相关的；凯利安山的。"},"examples":[{"en":"The basilica stands on the Caelian Hill, a historically important part of Rome.","zh":"这座大教堂坐落在凯利安山上，这是罗马一个很有历史意义的区域。"},{"en":"In ancient sources, Caelian neighborhoods are often mentioned alongside the other Roman hills.","zh":"在古代文献中，凯利安山一带常与罗马其他丘陵一起被提及。"}]}],"synonyms":["Celian (variant)"],"phonetic":"/ˈsiːliən/","extraExplanation":["“Caelian”主要出现在历史、考古与艺术史语境里，常与专名连用：the Caelian Hill（凯利安山）。它指的是罗马“七丘”之一，位于古罗马城区范围内。","拼写上有时也会看到变体“Celian”，但“Caelian”更常用于学术或历史写作。"]}
{"word":"Caelifera","summary":{"en":"Caelifera is the scientific group name for grasshoppers and locusts (short-horned grasshoppers).","zh":"Caelifera 是蚱蜢与蝗虫等“短角蝗类”的科学分类名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific name for a suborder of insects (in the order Orthoptera) that includes grasshoppers and locusts, often called “short-horned grasshoppers.”","zh":"（昆虫学）直翅目中的一个亚目名称，包含蚱蜢与蝗虫等，常被称为“短角蝗总科类/短角蚱蜢类（短角蝗类）”。"},"examples":[{"en":"Locusts belong to Caelifera, a group known for powerful jumping legs.","zh":"蝗虫属于 Caelifera（蝗亚目），这一类以强壮的跳跃后足闻名。"},{"en":"In the field guide, Caelifera is separated from crickets by its shorter antennae.","zh":"在野外图鉴中，Caelifera 常通过较短的触角与蟋蟀等类群区分开来。"}]}],"synonyms":["short-horned grasshoppers","grasshoppers (common term)","locusts (common term for swarming species)"],"phonetic":"/siˈlɪfərə/","extraExplanation":["这是一个拉丁化的科学分类名称（通常首字母大写、斜体书写：*Caelifera*）。在日常英语中更常用的说法是 “grasshoppers” 或 “short-horned grasshoppers”。","在形态特征上，Caelifera 一般触角较短、后足发达善跳；不少种类在特定环境下会发生“群聚相变”，形成大规模迁飞的蝗灾（locust swarms）。"]}
{"word":"caelometer","summary":{"en":"A ceilometer is a device (often laser-based) used to measure cloud-base height, especially for aviation and weather observation.","zh":"caelometer/ceilometer 指用于测量云底高度的仪器（常用激光），广泛用于航空与气象观测。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A scientific instrument that measures the height of cloud bases (cloud ceiling), usually by sending a laser beam upward and analyzing the light that reflects back.","zh":"测云仪（云高仪）：一种科学仪器，用来测量云底高度（云底高度/云高），通常通过向上发射激光并分析回波信号来计算。"},"examples":[{"en":"The airport uses a ceilometer to report the cloud ceiling for pilots.","zh":"机场使用测云仪向飞行员报告云底高度。"},{"en":"Meteorologists checked the ceilometer data to see when low clouds moved in.","zh":"气象学家查看测云仪数据，以判断低云何时进入。"}]}],"synonyms":["cloud-base height sensor","cloud ceiling sensor","laser ceilometer"],"phonetic":"/ˈsiːləˌmɪtər/","extraExplanation":["词源提示：ceilometer 来自 ceiling（“天花板；上限”，在气象中常指“云底高度/云高”）+ -meter（“测量仪”）。","使用场景：常见于机场气象观测、能见度与云高报告（如航空天气报告 METAR）以及研究雾、低云等边界层现象。"]}
{"word":"Caelum","summary":{"en":"Caelum is a Latin word meaning “sky/heavens,” and it is also the name of a faint southern constellation (the Chisel).","zh":"Caelum 在拉丁语中意为“天空/苍穹（诸天）”，也指南天一个较暗的小星座“雕具座”（The Chisel）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Latin; used in English mainly in mottos, names, or poetry) the sky; the heavens.","zh":"（拉丁语；在英语中多用于格言、名称或诗意表达）天空；苍穹；天堂（“诸天”）。"},"examples":[{"en":"The school motto uses Latin: “Ad caelum,” meaning “to the heavens.”","zh":"学校格言使用拉丁语：“Ad caelum”，意思是“通向苍穹/诸天”。"},{"en":"In some fantasy novels, Caelum is used as a character name to suggest “sky” or “heaven.”","zh":"一些奇幻小说中会用 Caelum 作角色名，借以表达“天空/天堂”的意象。"}]},{"partOfSpeech":"n.","definition":{"en":"A small, faint constellation in the southern sky, whose name means “the chisel.”","zh":"南天的一个小而暗的星座——“雕具座”（其名意为“凿子/刻刀”）。"},"examples":[{"en":"Caelum is a southern constellation; you’re more likely to see it from the Southern Hemisphere.","zh":"Caelum 是南天星座；在南半球更容易观测到。"},{"en":"The star atlas lists Caelum near Dorado and Eridanus.","zh":"星图把 Caelum 标在 Dorado（剑鱼座）和 Eridanus（波江座）附近。"}]}],"synonyms":["sky","the heavens"],"phonetic":"/ˈsiːləm/","extraExplanation":["“Caelum”源自拉丁语，基本义是“天空/苍穹”；其属格形式是“caeli”（你可能在拉丁短语里见到，如“sub caelo”意为“在天空之下/露天”）。","作为星座名时，Caelum 由17世纪天文学家拉卡伊（Nicolas Louis de Lacaille）命名，拉丁化含义指“雕刻用的刻刀/凿子”，属于他命名的一批“科学仪器”主题星座。"]}
{"word":"caelum","summary":{"en":"Caelum is a Latin word meaning “sky/heaven,” and it is also the name of a faint southern constellation (Caelum).","zh":"Caelum 源自拉丁语，意为“天空/天穹/天堂”；同时也是一个较暗淡的南天星座名（雕具座）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Latin) the sky or heaven.","zh":"（拉丁语）天空；天穹；天堂（较文学/学术用法）。"},"examples":[{"en":"In Latin poetry, “caelum” often symbolizes the vast sky above.","zh":"在拉丁诗歌里，“caelum”常用来象征头顶上辽阔的天空。"},{"en":"The inscription uses the word “caelum” to suggest a divine heaven.","zh":"这段碑文用“caelum”来暗示神圣的天堂。"}]},{"partOfSpeech":"n.","definition":{"en":"A small southern constellation; its name means “the chisel” in Latin (Caelum).","zh":"南天的一个小星座：雕具座（Caelum，名称源自拉丁语，意为“凿子/刻刀”）。"},"examples":[{"en":"Caelum is faint, so it’s harder to see without dark skies.","zh":"雕具座比较暗淡，没有足够黑暗的夜空就更难看见。"},{"en":"The star chart labels this region as Caelum.","zh":"星图把这一片区域标注为 Caelum（雕具座）。"}]}],"synonyms":["sky","heaven","firmament"],"phonetic":"/ˈsiːləm/","extraExplanation":["“caelum”是拉丁语词，在英语里多见于古典学、铭文引用、学术写作或天文学（星座名）。日常英语通常用 sky / heaven，而不直接用 “caelum”。","天文学中的星座名 Caelum 是18世纪天文学家拉卡伊（Nicolas-Louis de Lacaille）命名的一组“器具类”星座之一；它的词源与“雕刻用的凿/刀”有关。"]}
{"word":"Caelus","summary":{"en":"Caelus is a Roman name for the sky—either the sky-god/personification in mythology or the Latin word meaning “sky/heaven,” also used as a modern or fictional name.","zh":"Caelus指“天空/苍穹”：既可指罗马神话中天空的神格化（天空之神），也可指拉丁语里“天空/苍天”的词义，并常被用作现代或虚构作品中的名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Roman mythology) The god/personification of the sky (the heavens), often compared to the Greek god Uranus.","zh":"（罗马神话）天空（苍穹）的神格化/神祇，常与希腊神话中的乌拉诺斯（Uranus）相对应。"},"examples":[{"en":"In Roman myth, Caelus represents the sky itself rather than a human-like hero.","zh":"在罗马神话中，Caelus更像是“天空本身”的化身，而不是具有人物冒险故事的英雄。"},{"en":"Some writers describe Caelus as a very ancient, primordial deity.","zh":"一些作者会把Caelus描述为非常古老的、原初的神祇。"}]},{"partOfSpeech":"n.","definition":{"en":"A Latin word meaning “sky” or “heaven,” sometimes used in mottos, names, and fantasy settings.","zh":"拉丁语词，意为“天空/苍天”，有时用于格言、名称或奇幻作品的设定中。"},"examples":[{"en":"The motto uses Latin: “sub caelō,” meaning “under the sky.”","zh":"这句格言用了拉丁语：“sub caelō”，意思是“在天空之下”。"},{"en":"In fantasy stories, Caelus is sometimes used as a name to suggest something celestial.","zh":"在奇幻故事中，Caelus有时被用作名字，以暗示“天界/星空”的意象。"}]},{"partOfSpeech":"n.","definition":{"en":"A given name (especially in modern or fictional use), chosen for its “sky/heaven” associations.","zh":"人名（多见于现代或虚构作品），常因其“天空/天界”的联想而被选用。"},"examples":[{"en":"They named the character Caelus to match the story’s theme of stars and fate.","zh":"他们把角色取名为Caelus，以呼应故事里“星辰与命运”的主题。"}]}],"synonyms":["Uranus","the sky","the heavens","celestial sky"],"phonetic":"/ˈsiːləs/","extraExplanation":["在英语语境里，Caelus通常作为专有名词出现（罗马神话的“天空之神/天空的化身”），也常被当作带有“天、星、苍穹”意象的名字使用。","词源上来自拉丁语caelum（天空、苍天）。英语里与它同源/同根的常见词有celestial（天体的、天空的）和ceiling（天花板；历史上与“天空/顶棚”的概念相连）。","在古典文献与后世的神谱写作中，Caelus常被归入“原初神祇”（primordial deities）的层级：更像自然本体的象征，而非拥有大量戏剧化事迹的“人格化神”。"]}
{"word":"caelus","summary":{"en":"Caelus refers to the Roman personification of the sky, and it also appears as a Latin word meaning “sky/heaven.”","zh":"Caelus 指罗马神话中“天空”的拟人格/神祇，也可作为拉丁语词表示“天空/天界”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Roman mythology) The personification or god of the sky (the heavens), often paired with Earth (Terra) as a primal force.","zh":"（罗马神话）天空（苍穹）的拟人格或神祇，常与大地女神（Terra）成对出现，作为原初力量之一。"},"examples":[{"en":"In some Roman myths, Caelus represents the sky itself rather than a human-like god.","zh":"在一些罗马神话里，Caelus 更像是“天空本身”的象征，而不一定是具有人形的神。"},{"en":"The story contrasts Caelus (Sky) with Terra (Earth) to explain the origins of the world.","zh":"这个故事用 Caelus（天）与 Terra（地）的对比来解释世界的起源。"}]},{"partOfSpeech":"n.","definition":{"en":"(Latin, used in English contexts) “Sky; heaven,” especially in scientific, historical, or poetic writing.","zh":"（拉丁语，在英语语境中使用）“天空；天界”，多见于学术、历史或诗歌化表达。"},"examples":[{"en":"The Latin word caelus is related to English words like “celestial.”","zh":"拉丁语 caelus 与英语的 “celestial（天空的；天体的）” 有词源关联。"},{"en":"Some mottos use caelus to evoke the idea of “heaven” or “the skies.”","zh":"一些格言会用 caelus 来唤起“天界”或“苍穹”的意象。"}]}],"synonyms":["Uranus (mythological equivalent)","the heavens","the sky"],"phonetic":"/ˈsiːləs/","extraExplanation":["词源与联想：Caelus 来自拉丁语 caelum/caelus（天空、天界），因此与英语词根 cael-/cel- 的词（如 celestial, celeste）在意义上相通。","神话对照：Caelus 常被视为与希腊神话中的 Uranus（乌拉诺斯，天空之神）相近的概念，有时在文学或神话学讨论中会互相对照。","文学/古典语境：在古罗马诗歌与神话叙述（如奥维德等相关传统）里，Caelus 往往更偏“宇宙结构中的天空力量/天空本体”的象征，而非拥有大量个人故事线的神。"]}
{"word":"caementum","summary":{"en":"Caementum is the rubble aggregate used in ancient Roman concrete, especially the rough core of Roman walls.","zh":"Caementum 指古罗马混凝土中使用的碎石/碎砖骨料，常特指罗马墙体内部的粗糙核心填充层。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaeology/architecture) The rubble-like stone and broken-brick aggregate used in ancient Roman concrete, especially the rough core filling of Roman walls (often faced with brick or stone).","zh":"（考古/建筑）古罗马混凝土中使用的碎石、碎砖等“骨料/填充料”；尤指罗马墙体中间粗糙的核心填充层（外侧常用砖或石材饰面）。"},"examples":[{"en":"The wall was built with a brick facing and a caementum core.","zh":"这面墙外层是砖饰面，内部核心是碎石混凝土（caementum）填充。"},{"en":"Archaeologists analyzed the caementum to learn where the builders sourced the stone.","zh":"考古学家分析了 caementum，以了解建造者从哪里获取石料。"}]}],"synonyms":["Roman concrete aggregate","rubble core","concrete core"],"phonetic":"/sɪˈmɛn.təm/","extraExplanation":["“caementum”来自拉丁语，原意与“切下来的石块/碎石”有关，是罗马混凝土的重要组成部分；英语单词 cement（“水泥”）与其同源，但现代“水泥”更强调胶结材料，而 caementum 更常指混凝土里的碎石骨料或墙体的“芯部填充”。","在罗马建筑描述中，你可能会看到“facing（饰面）+ caementum core（芯部）”这样的搭配，用来区分外观材料与内部结构。"]}
{"word":"Caen","summary":{"en":"Caen is a city in Normandy, France, often mentioned for its medieval history and WWII battles after D-Day.","zh":"Caen（卡昂）是法国诺曼底的一座城市，常因其中世纪历史与诺曼底登陆后的二战战事而被提及。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in Normandy, northwestern France, known for its medieval heritage and its major role in World War II (especially after D-Day in 1944).","zh":"法国西北部诺曼底地区的一座城市，以中世纪历史遗产闻名，并因二战（尤其是1944年诺曼底登陆后）中的重要战事而著名。"},"examples":[{"en":"Caen is a historic city in Normandy with many landmarks rebuilt after World War II.","zh":"卡昂是诺曼底的一座历史名城，许多地标在二战后重建。"},{"en":"After D-Day, Allied forces fought hard to take Caen.","zh":"诺曼底登陆后，盟军为攻下卡昂进行了艰苦战斗。"}]},{"partOfSpeech":"n.","definition":{"en":"(History) A place-name used in discussing the WWII fighting around the city, often called the Battle of Caen.","zh":"（历史）在讨论二战中围绕该城的战事时使用的地名，常称为“卡昂战役”（Battle of Caen）。"},"examples":[{"en":"The Battle of Caen was part of the broader Normandy campaign.","zh":"卡昂战役是更大范围的诺曼底战役的一部分。"}]}],"phonetic":"/kɑːn/","extraExplanation":["发音提示：英语里通常读作 /kɑːn/，听起来更像“kahn”，不是“cane”。","文化背景：卡昂与诺曼底公爵威廉（征服者威廉，William the Conqueror）关系密切；城中有他修建的两座著名修道院（Abbaye aux Hommes 与 Abbaye aux Dames）。","文学/历史写作中，“Caen”常作为二战诺曼底战役的关键地名出现，用来指代围绕该城的长期与激烈的攻防。"]}
{"word":"caen","summary":{"en":"Caen is a city in Normandy, France, often mentioned in connection with medieval sites and WWII history.","zh":"Caen（卡昂）是法国诺曼底的一座城市，常与中世纪遗迹和二战历史联系在一起。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a city in Normandy, northwestern France, known for its medieval heritage and for major WWII battles nearby.","zh":"法国西北部诺曼底地区的一座城市，以中世纪历史遗迹以及二战期间附近的重要战役而闻名。"},"examples":[{"en":"Caen is a major city in Normandy.","zh":"卡昂是诺曼底的一座重要城市。"},{"en":"Many visitors go to Caen to learn about World War II history.","zh":"很多游客去卡昂了解二战历史。"},{"en":"The train ride from Paris to Caen is convenient.","zh":"从巴黎坐火车到卡昂很方便。"}]}],"phonetic":"/kɑn/","extraExplanation":["英文里 Caen 通常作为专有名词使用（地名）。在英语语境中它常与“诺曼底（Normandy）”“二战诺曼底登陆（D-Day）”等一起出现，例如“the Battle of Caen（卡昂战役）”。","发音上，英语里常把 Caen 读成接近“con”的音（/kɑn/）；法语原音更像鼻化元音，和英语读法略有差异。"]}
{"word":"Caeneus","summary":{"en":"Caeneus is a figure from Greek mythology, known for a transformation and for being nearly invulnerable.","zh":"Caeneus（凯纽斯）是希腊神话人物，以“变形”经历与近乎刀枪不入而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, a warrior (originally named Caenis) who was transformed into an invulnerable man, Caeneus, and fought in the battle between the Lapiths and the centaurs.","zh":"（希腊神话）凯纽斯：一位战士（原名凯尼斯 Caenis），后来被变成刀枪不入的男性“凯纽斯”，并参与拉庇泰人（Lapiths）与半人马（centaurs）的著名战斗。"},"examples":[{"en":"In Ovid’s *Metamorphoses*, Caeneus is described as nearly impossible to wound.","zh":"在奥维德的《变形记》中，凯纽斯几乎被描写成无法被伤害的人。"},{"en":"The story of Caeneus is often discussed in classes about Greek myths and transformation.","zh":"凯纽斯的故事常在讲希腊神话与“变形/转化”主题的课程中被讨论。"}]}],"synonyms":["Caenis (original name)"],"phonetic":"/siːˈniːəs/","extraExplanation":["“Caeneus”通常被视为一个神话人物的专有名词：他（原为女性 Caenis）向海神波塞冬提出愿望后变为男性，并获得“不会被武器刺伤”的能力。","他的结局在不同版本中略有差异：常见说法是半人马发现刺不伤他后，用树干和石块把他压入地里；有的版本说他后来化作鸟飞走。","常见相关词：Caenis（凯尼斯，变形前的名字）、Lapiths（拉庇泰人）、Centaurs（半人马）、Metamorphoses（《变形记》）。"]}
{"word":"Caenis","summary":{"en":"Caenis is a mythological name from Greek stories, best known from Ovid, referring to a woman who was transformed into the invulnerable warrior Caeneus.","zh":"Caenis 是希腊神话中的人物名（常见于奥维德《变形记》），指一位女子被变为刀枪不入的战士 Caeneus。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) A person in myth: Caenis was a Thessalian woman who, after being assaulted, asked Poseidon to turn her into an invulnerable man; she then lived as the warrior Caeneus.","zh":"（希腊神话）神话人物名：卡厄尼斯（Caenis）原为忒萨利的女子，据传遭受侵害后向波塞冬请求变为刀枪不入的男子，后来以战士“卡厄纽斯（Caeneus）”的身份生活。"},"examples":[{"en":"In Ovid’s *Metamorphoses*, Caenis is transformed into Caeneus.","zh":"在奥维德的《变形记》中，Caenis 被变成了 Caeneus。"},{"en":"The myth of Caenis is often discussed in classes on transformation stories.","zh":"Caenis 的神话常在讨论“变形”主题的课程中出现。"}]}],"synonyms":["Caeneus"],"phonetic":"/ˈsiːnɪs/","extraExplanation":["“Caenis / Caeneus”最常见的来源是罗马诗人奥维德（Ovid）的《变形记》（*Metamorphoses*），因此在英语文学与古典学语境里经常被引用。","在现代讨论中，Caenis 这个人物也常被用来引出关于身份、权力与性别转变的主题；但在古代文本里，她/他首先是“变形叙事”中的一个典型案例。"]}
{"word":"Caenogaea","summary":{"en":"Caenogaea is a rare, older biogeography term meaning the “new earth,” often referring to the combined northern landmasses (Eurasia + North America).","zh":"Caenogaea 是较少见的旧式生物地理术语，字面为“新大地”，常指欧亚大陆与北美等北方陆地的合称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, historical) a biogeographical term for the “newer” northern landmasses—especially Eurasia and North America—treated as one broad region in some older classifications.","zh":"（罕见，历史用语）生物地理学术语，指被某些旧式分类法合并看作一个大区的“较新的”北方陆地，尤指欧亚大陆与北美。"},"examples":[{"en":"In some older biogeography texts, Caenogaea is contrasted with southern regions such as Notogaea.","zh":"在一些较早的生物地理学著作中，Caenogaea 常与 Notogaea 等南方区域作对比。"},{"en":"The author grouped many temperate mammals under the Caenogaean fauna.","zh":"作者把许多温带哺乳动物归为 Caenogaea 的动物群。"}]}],"synonyms":["Holarctic","Arctogaea"],"phonetic":"/ˌkaɪnoʊˈɡeɪə/","extraExplanation":["这个词来自希腊语词根：kainos（意为“新的”）+ gaia（意为“地球/大地”），字面可理解为“新大地”。它不是现代常用的标准分区名称；在当代更常见的对应说法是 Holarctic（全北界）或（在较老文献中）Arctogaea。","由于属于较冷门的学术/历史术语，不同作者对它涵盖的地理范围可能略有差异；阅读时最好结合原文给出的分区说明。"]}
{"word":"caenogaea","summary":{"en":"Caenogaea is a rare, older term for the Cenozoic era (66 million years ago to today).","zh":"Caenogaea是一个罕见的旧称，指新生代（约6600万年前至今）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, historical) The Cenozoic era—the most recent major era of Earth’s history, from about 66 million years ago to the present.","zh":"（罕见/历史用语）新生代——地球历史中最近的一个主要地质时代，大约从6600万年前至今。"},"examples":[{"en":"Mammals diversified rapidly during the Caenogaea (the Cenozoic era).","zh":"在Caenogaea（新生代）期间，哺乳动物迅速多样化。"},{"en":"Some older books use “Caenogaea” where modern texts say “Cenozoic.”","zh":"一些较旧的书会用“Caenogaea”，而现代教材则写“Cenozoic（新生代）”。"}]}],"synonyms":["Cenozoic","Cenozoic era"],"phonetic":"/ˌsiːnəˈdʒiːə/","extraExplanation":["“Caenogaea”是较旧或学术性较强的拼写形式，常见于19世纪到20世纪早期的英文著作；现代地质学更常用“Cenozoic”。","词源可追溯到希腊语：kainos（新的）+ Gaia（大地/地球女神），字面意思接近“新（的）地球时代”。","如果你是在论文/书目里遇到它，通常可直接理解为“新生代”，并在需要时括注现代拼写“Cenozoic”。"]}
{"word":"Caenogaean","summary":{"en":"Caenogaean is an uncommon geology term meaning “Cenozoic,” the era from about 66 million years ago to today.","zh":"Caenogaean 是较少见的地质学用词，相当于“新生代（Cenozoic）”，指约6600万年前至今的地质年代。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Geology) Relating to the Cenozoic Era—the most recent major division of Earth’s history, from about 66 million years ago to the present.","zh":"（地质）与新生代有关的——新生代是地球历史中最近的一大阶段，约从6600万年前开始一直到现在。"},"examples":[{"en":"Caenogaean rocks in this region include many young sedimentary layers.","zh":"这个地区的新生代岩石包括许多较新的沉积层。"},{"en":"Most modern mammals diversified during the Caenogaean.","zh":"大多数现代哺乳动物是在新生代时期多样化发展的。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common; geology) The Cenozoic Era itself.","zh":"（较少用；地质）指新生代这一时期本身。"},"examples":[{"en":"These fossils date to the early Caenogaean.","zh":"这些化石可追溯到新生代早期。"}]}],"synonyms":["Cenozoic","Caenozoic"],"phonetic":"/ˌsiːnəˈdʒiːən/","extraExplanation":["“Caenogaean”是较旧或较少见的拼写形式，常与“Cenozoic / Caenozoic”互通使用；其中“caeno-”来自希腊语，意为“新的”，“-zoic”与“生命”相关。现代教材与论文中更常见的是“Cenozoic”（美式）或“Caenozoic”（英式）。"]}
{"word":"caenogaean","summary":{"en":"Caenogaean is an older term meaning “Cenozoic,” the most recent era of Earth history (about 66 million years ago to today).","zh":"Caenogaean 是较旧用语，意思相当于 Cenozoic（新生代），指约6600万年前至今的地球历史时期。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Geology) relating to the Cenozoic Era—the most recent major era of Earth’s history, from about 66 million years ago to the present.","zh":"（地质）与新生代有关的——地球历史上最近的一个主要地质代，约从6600万年前至今。"},"examples":[{"en":"Cenozoic (Caenogaean) rocks are common in many modern mountain basins.","zh":"在许多现代山地盆地中，新生代（Caenogaean）岩层很常见。"},{"en":"Many mammals diversified during the Caenogaean period.","zh":"许多哺乳动物在新生代时期发生了多样化。"}]},{"partOfSpeech":"n.","definition":{"en":"the Cenozoic Era (an older or less common spelling/form, often seen in older scientific writing).","zh":"新生代（较旧或较少见的拼写/形式，常见于较早的科学文献）。"},"examples":[{"en":"The paper divides Earth history into the Mesozoic and the Caenogaean.","zh":"这篇论文把地球历史分为中生代和新生代（Caenogaean）。"}]}],"synonyms":["Cenozoic","Cainozoic"],"phonetic":"/ˌsiːnəˈdʒiːən/","extraExplanation":["“Caenogaean”是“Cenozoic / Cainozoic”的较旧写法之一，词源来自希腊语：kainos（新的）+ zōē（生命），强调“新生的生命时代”（哺乳动物繁盛、人类出现）。现代教材与论文更常用“Cenozoic（新生代）”。"]}
{"word":"caenogenesis","summary":{"en":"Caenogenesis means the appearance of newly adapted traits during embryonic or larval development, rather than traits that mirror ancestral adult forms.","zh":"Caenogenesis 指胚胎或幼体发育中出现的新适应性特征，而非重现祖先成体形态的特征。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In evolutionary biology, the development of features in an embryo or larva that are new adaptations and do not reflect the species’ ancestral adult form (i.e., “new” traits appearing during development).","zh":"（进化生物学）指胚胎或幼体发育过程中出现的、为适应环境而“新产生”的特征，这些特征不对应（不重现）该物种祖先的成体形态。"},"examples":[{"en":"Some larval structures are explained as caenogenesis because they help survival at that stage rather than showing ancestral adult traits.","zh":"一些幼体结构可用“新生性发育（caenogenesis）”来解释，因为它们有助于该阶段的生存，而不是展示祖先成体的特征。"},{"en":"In older textbooks, caenogenesis was contrasted with traits that seem to repeat evolutionary history during development.","zh":"在较老的教材里，“新生性发育”常与那种看似在发育中重现进化历史的特征作对比。"}]}],"synonyms":["caenogeny","adaptive larval development","derived developmental traits"],"phonetic":"/ˌkiːnoʊˈdʒɛnəsɪs/","extraExplanation":["词源：来自希腊语 kainos（新的）+ genesis（产生/起源），字面意思是“新的生成”。","该词多见于较早期的比较胚胎学/进化论文献；现代讨论中常用更常见的相关术语，如 heterochrony（异时性，发育时间改变导致形态变化）与 adaptation in larval stages（幼体阶段适应）。","经典对比：palingenesis（复演/回返性发育，强调发育中“像是”重现祖先特征） vs. caenogenesis（强调发育中出现为当前阶段服务的“新适应”特征）。这一对比与“个体发育重演系统发育”的历史观点有关，但该观点在现代生物学中已被更谨慎、复杂的理解所取代。"]}
{"word":"caenogenetic","summary":{"en":"Caenogenetic describes newly evolved, adaptive traits that appear during embryonic or larval development, not direct reflections of ancestral history.","zh":"caenogenetic 指胚胎或幼体发育中出现的后期进化出的适应性新特征，并非祖先历史的直接反映。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology) Showing traits in an embryo or larva that are newly evolved or adapted for the organism’s current way of life, rather than reflecting ancestral (evolutionary) history.","zh":"（生物）指胚胎或幼体阶段出现的“新生/适应性”特征，这些特征是后期进化出来以适应现今生活方式的，并不直接反映祖先（进化）历史。"},"examples":[{"en":"Some larval structures are considered caenogenetic because they help the organism survive in its present environment.","zh":"一些幼体结构被认为是促成发生的（caenogenetic），因为它们帮助生物在当前环境中生存。"},{"en":"Researchers tried to separate caenogenetic features from ancestral traits when describing the embryo.","zh":"研究人员在描述胚胎时，尝试把促成发生的特征与祖先性状区分开来。"}]}],"synonyms":["cenogenetic","adaptive (in development)","derived (developmental)"],"phonetic":"ˌsiːnoʊdʒəˈnɛtɪk","extraExplanation":["该词也常写作（或更常见于现代文献中）cenogenetic，对应名词cenogenesis（促成发生）。它常出现在讨论“胚胎发育与进化关系”的语境里，尤其与palingenetic（重演祖先特征的）形成对比。","历史上，这类术语与19世纪末—20世纪初关于“胚胎是否会重演进化史”的观点（如海克尔相关理论）有关；现代生物学在使用时通常更谨慎，把它当作描述“发育中出现的派生/适应性特征”的术语，而不是强行套用简单的重演说。"]}
{"word":"caenogenetically","summary":{"en":"Caenogenetically means “in a way that adds new, evolutionarily derived features during development.”","zh":"caenogenetically 表示“以新生性的方式”，即在发育过程中新增了进化派生的特征或阶段。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that involves caenogenesis (the evolutionary addition of new, “extra” features or stages during an organism’s development that were not present in its ancestors).","zh":"以“新生性（caenogenesis）”的方式；指在个体发育过程中，由进化而新增的、祖先并不具备的特征或阶段。"},"examples":[{"en":"Some larval features appear caenogenetically, as adaptations to a specific environment.","zh":"一些幼体特征是以新生性的方式出现的，作为对特定环境的适应。"},{"en":"The researcher argued that the structure developed caenogenetically rather than reflecting an ancestral form.","zh":"研究者认为该结构是以新生性的方式形成的，而不是祖先形态的再现。"}]}],"synonyms":["in a derived way","secondarily (in development)","as an adaptive addition"],"phonetic":"/ˌsiːnoʊdʒəˈnɛtɪkli/","extraExplanation":["“Caenogenesis/caenogenetic/caenogenetically”常见于进化发育生物学与胚胎学语境，用来区分两类发育特征：一种被认为较接近祖先状态（传统上称“palingenesis/复演”），另一种则是后来为了适应而在发育过程中“加上去”的新特征（caenogenesis/新生性）。该术语与早期的“个体发育重演系统发育”讨论有关，但现代生物学更常用“异时性（heterochrony）”“派生特征（derived trait）”等框架来表述类似现象。"]}
{"word":"caenogeny","summary":{"en":"Caenogeny means secondary, adaptive changes in embryonic/larval development that can obscure ancestral evolutionary traits.","zh":"Caenogeny 指胚胎/幼体发育中的次生适应性变化，可能掩盖祖先演化特征。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In evolutionary biology, a change in an embryo or larva that is a later adaptation (not an ancestral trait) and can hide or distort earlier evolutionary features.","zh":"（演化生物学）指胚胎或幼体出现的后期适应性变化（并非祖先遗留特征），可能会遮蔽或扭曲更早的演化特征。"},"examples":[{"en":"Some larval structures are explained as caenogeny because they help the organism survive, even though they are not ancestral features.","zh":"一些幼体结构可用“caenogeny（新生性变化）”来解释，因为它们有助于生存，但并非祖先特征。"},{"en":"Caenogeny can make it harder to use embryos to infer evolutionary history.","zh":"caenogeny 会让我们更难通过胚胎来推断演化历史。"}]}],"synonyms":["cenogeny","secondary embryonic modification","adaptive embryonic change"],"phonetic":"/ˌsiːnəˈdʒɛnɪ/","extraExplanation":["该词常见于比较胚胎学与演化讨论中，与“recapitulation（重演说）”相关：研究者会区分胚胎中哪些特征更可能反映祖先状态（常称 palingeny/祖源性变化），哪些是为适应胚胎或幼体生活而“后来加上去”的变化（caenogeny）。","词源：来自希腊语 kainos（新的）+ geny（产生、起源）。拼写上也常见变体 cenogeny。"]}
{"word":"Caenolestes","summary":{"en":"Caenolestes is a scientific genus name for Andean shrew opossums (small insect-eating marsupials).","zh":"Caenolestes 是南美安第斯山脉“鼩鼱负鼠/袋鼩”一类小型食虫有袋动物的属名（学名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small, insect-eating marsupials known as shrew opossums, native to the Andes in South America.","zh":"（动物学）袋鼩属：一种生活在南美安第斯山脉、体型小、以昆虫等为食的有袋类动物属，常被称为“鼩鼱负鼠/袋鼩（shrew opossum）”。"},"examples":[{"en":"Scientists studied Caenolestes to better understand early marsupial evolution.","zh":"科学家研究袋鼩属（Caenolestes），以更好地了解早期有袋类的演化。"},{"en":"A Caenolestes is not a true shrew; it is a marsupial.","zh":"袋鼩属动物并不是真正的鼩鼱；它是有袋类动物。"}]}],"synonyms":["shrew opossum","Andean shrew opossum"],"phonetic":"/ˌsiːnəˈlɛstiːz/","extraExplanation":["“Caenolestes”常见于生物学/动物学文章中，属于学名（拉丁化的属名），日常英语里多用普通名“shrew opossum（鼩鼱负鼠/袋鼩）”。","词源上常被解释为来自希腊语词根，含有“新（kaino-）”等意义；不过在学习与使用时，重点是把它当作一个属名来识别即可。","这类动物主要分布于南美洲安第斯山区的森林与灌丛环境，体型像鼩鼱，但分类上与负鼠同属有袋类。"]}
{"word":"caenolestes","summary":{"en":"Caenolestes is a scientific genus name for shrew opossums, small South American marsupials.","zh":"Caenolestes 是鼩负鼠（南美小型有袋类）的一个属名（科学名称）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small South American marsupials known as shrew opossums (family Caenolestidae)","zh":"一种南美洲小型有袋类动物的属名，称为“鼩（qú）负鼠/鼩形负鼠”（Caenolestidae 科）"},"examples":[{"en":"Caenolestes species live mainly in the Andes and nearby forests.","zh":"Caenolestes 属的物种主要生活在安第斯山脉及附近的森林里。"},{"en":"Researchers studied Caenolestes to understand early marsupial evolution in South America.","zh":"研究人员研究 Caenolestes 来了解南美洲早期有袋类的演化。"}]}],"synonyms":["shrew opossum (general term)","Caenolestidae (family name, related)"],"phonetic":"/ˌsiːnəˈlɛstiːz/","extraExplanation":["这是一个生物分类学名称（属名），通常在英文中首字母大写并用斜体：*Caenolestes*。","“shrew opossum”在中文常译作“鼩负鼠”或“鼩形负鼠”。它们不是啮齿类的“鼩鼱”（shrew），也不是北美常见的“负鼠”（opossum），而是南美特有的一支有袋类。","在日常英语中很少用到，多见于动物学、生态学、演化生物学等学术语境。"]}
{"word":"Caenolestidae","summary":{"en":"Caenolestidae is the scientific family name for shrew opossums, small marsupials from South America.","zh":"Caenolestidae 是鼩负鼠（南美洲小型有袋类）的科学分类“科名”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of small South American marsupials known as shrew opossums.","zh":"一种南美洲小型有袋类动物的科，俗称“鼩负鼠科 / 鼩鼱负鼠科（shrew opossums）”。"},"examples":[{"en":"Caenolestidae includes several species of shrew opossums found in the Andes.","zh":"Caenolestidae（鼩负鼠科）包含数种分布在安第斯山脉的鼩负鼠。"},{"en":"Researchers study Caenolestidae to understand early marsupial evolution in South America.","zh":"研究人员通过研究 Caenolestidae 来了解南美洲早期有袋类的演化。"}]}],"synonyms":["shrew opossums (common name for members of the family)"],"phonetic":"/ˌsiːnoʊˈlɛstɪdiː/","extraExplanation":["Caenolestidae 是生物分类学中的“科（family）”名称，常见于动物学、生态学与演化生物学文献中；日常英语里更常用的通俗说法是 shrew opossums（鼩负鼠）。","词源上来自其代表属名 Caenolestes（加上表示“……科”的后缀 -idae）。","发音上，学术拉丁化的类群名在英语中可能有轻微差异，但通常按重音与元音清晰读出即可。"]}
{"word":"caenostylic","summary":{"en":"Caenostylic describes architecture with unusually wide spacing between columns.","zh":"Caenostylic 指柱子之间间距特别大的建筑布局（柱距很宽）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Architecture) Having columns set unusually far apart; relating to a building front or colonnade with wide spacing between columns.","zh":"（建筑）柱距很宽的；指柱廊或立面中柱子之间间距异常大的布局。"},"examples":[{"en":"The temple’s caenostylic colonnade creates an open, airy feeling at the entrance.","zh":"这座神庙的柱廊柱距很宽，让入口显得开阔通透。"},{"en":"Because the façade was caenostylic, the architect used stronger beams to span the gaps.","zh":"由于立面柱距很宽，建筑师使用了更坚固的梁来跨越这些间隔。"}]}],"synonyms":["widely spaced","open-spaced","araeostyle (near meaning)"],"phonetic":"/ˌsiːnəˈstaɪlɪk/","extraExplanation":["这是一个很少见的学术词，多见于古典建筑研究语境。它与古罗马建筑理论家维特鲁威（Vitruvius）讨论的“柱距”（intercolumniation）分类相关：柱距越大，视觉越开阔，但结构上往往需要更强的横梁或不同的构造方式来承重。","学习时可以把它理解为“wide‑spaced columns（柱子间距很大）”。在阅读建筑史或古典柱式分析文章时更可能遇到。"]}
{"word":"caenostyly","summary":{"en":"Caenostyly is a very rare technical noun meaning the development or presence of a newly formed “style,” especially in botanical descriptions.","zh":"Caenostyly 是非常罕见的专业名词，通常指（尤其在植物学中）“新形成/新发育的花柱（style）”的出现或这种现象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, technical) The condition or phenomenon of having a newly formed or newly developed “style” (a pillar-like structure), especially in botanical or morphological description.","zh":"（罕见/专业用语）指具有“新形成/新发育的花柱（style）”（一种柱状结构）的状态或现象，常见于植物学或形态学描述。"},"examples":[{"en":"In a few older botanical notes, caenostyly is mentioned when a flower develops a new style after damage.","zh":"在一些较早的植物学笔记中，提到花在受损后长出新的花柱时会用到 caenostyly。"},{"en":"The author uses caenostyly to describe an unusual change in the flower’s style structure.","zh":"作者用 caenostyly 来描述花柱结构的一种不寻常变化。"}]}],"synonyms":["(no common modern synonyms; depends on field/context)"],"phonetic":"/ˌsiːnoʊˈstaɪli/","extraExplanation":["这个词非常少见，很多现代词典里查不到；不同学科/作者可能用法不一致。它看起来由前缀 caeno-（源自希腊语 kainos，意为“新的/近期的”）+ -styly（与 style“柱状结构/花柱”相关）构成。","如果你是在论文、标本记录或某本书里看到它，建议把原句或学科背景（植物学/动物形态学等）发我，我可以帮你更准确地对应它在该语境中的意思。","也可能是拼写变体或误拼（例如与 caenostyle / cenostyle 等近形词混淆）；提供上下文能更好判断。"]}
{"word":"Caenozoic","summary":{"en":"Caenozoic (Cenozoic) refers to the most recent geological era (66 million years ago–present), often linked with the rise of mammals.","zh":"Caenozoic（=Cenozoic）指“新生代”，从约6600万年前至今，常与哺乳动物兴起相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the most recent geological era, from about 66 million years ago to the present, when mammals became dominant after the dinosaurs.","zh":"与（新生代）有关的：指约从6600万年前到现在的地质时代，恐龙灭绝后哺乳动物兴盛并占主导。"},"examples":[{"en":"Many modern mountain ranges formed during the Caenozoic era.","zh":"许多现代山脉是在新生代形成的。"},{"en":"Caenozoic fossils often include early mammals and birds.","zh":"新生代化石常包含早期哺乳动物和鸟类。"}]},{"partOfSpeech":"n.","definition":{"en":"The Caenozoic era itself (also spelled Cenozoic).","zh":"新生代（也拼作 Cenozoic）。"},"examples":[{"en":"The Caenozoic is divided into the Paleogene, Neogene, and Quaternary.","zh":"新生代可分为古近纪、新近纪和第四纪。"}]}],"synonyms":["Cenozoic"],"phonetic":"/ˌsiːnəˈzoʊɪk/","extraExplanation":["“Caenozoic”是“Cenozoic”的另一种拼写形式（更偏英式/学术拼写）。词源来自希腊语：kainos（新的）+ zōē（生命），字面意思是“新生命的时代”。","在大众科普和美国英语里更常见拼写是“Cenozoic”；在地质学写作中两者通常视为等同。"]}
{"word":"caenozoic","summary":{"en":"“Caenozoic/Cenozoic” means the most recent geological era (66 million years ago to now).","zh":"“Caenozoic/Cenozoic”指最近的地质时代——新生代（约6600万年前至今）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Also spelled “Cenozoic”) the most recent geological era, from about 66 million years ago to the present, when mammals became the dominant land animals and humans eventually appeared.","zh":"（也拼作“Cenozoic”）新生代：从约6600万年前至今的地质年代，哺乳动物在陆地上占优势，人类也在这一时期出现。"},"examples":[{"en":"Dinosaurs disappeared at the end of the Mesozoic, and the Cenozoic began afterward.","zh":"恐龙在中生代末期消失，之后新生代开始。"},{"en":"Many modern mammals evolved during the Cenozoic era.","zh":"许多现代哺乳动物是在新生代演化出来的。"},{"en":"Scientists study Cenozoic climate records to understand today’s climate change.","zh":"科学家研究新生代的气候记录来理解当今的气候变化。"}]}],"synonyms":["Cenozoic","Cenozoic Era"],"phonetic":"/ˌsiːnəˈzoʊɪk/","extraExplanation":["“Caenozoic”是较旧的英式拼写，现代科学写作中更常用“Cenozoic”（美式/通用）。两者指同一个时代。","词源来自希腊语：kainos（新的）+ zōē（生命），意思是“新生命的时代”。","新生代通常再细分为古近纪（Paleogene）、新近纪（Neogene）和第四纪（Quaternary）。在地质学与古生物学文章里，你会经常看到这些更具体的分期名称。"]}
{"word":"caeoma","summary":{"en":"Caeoma is a technical mycology term for a spore-producing structure in some rust fungi.","zh":"Caeoma 是真菌学术语，指某些锈菌的产孢结构（用于释放锈孢子）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cup- or cushion-like spore-producing structure of some rust fungi (a kind of aecium), usually lacking a protective wall and releasing aeciospores.","zh":"（植物病理）某些锈菌的产孢结构（属于一种“锈子器/锈孢器”类型），通常没有明显的保护性外壁，用来释放锈孢子（aeciospores）。"},"examples":[{"en":"Under the microscope, the researcher identified a caeoma on the infected leaf.","zh":"在显微镜下，研究人员在受感染的叶片上鉴定出了一个锈子器（caeoma）。"},{"en":"The rust fungus forms a caeoma stage that releases spores to spread to new hosts.","zh":"这种锈菌会形成锈子器（caeoma）阶段，释放孢子以传播到新的寄主。"}]}],"synonyms":["aecium","rust pustule","spore case"],"phonetic":"/siːˈoʊmə/","extraExplanation":["“caeoma”多见于植物病理学/真菌学文献，和锈菌（rust fungi）的复杂生活史有关。锈菌常有多个阶段与不同类型的孢子结构；“caeoma”可理解为一种较“开放”的锈子器类型（常被视作a e c i u m的一种变体），因此有时会在分类或描述中与“aecium（锈子器/锈孢器）”一起出现。","词源上来自希腊语，含义与“灼烧/烧灼的痕迹”相关，呼应锈病在叶片上常见的橙黄或锈色斑块外观。"]}
{"word":"caeomas","summary":{"en":"“caeomas” isn’t a recognized English word; it’s likely a misspelling or a proper name. Share context and I’ll identify the intended word.","zh":"“caeomas”不是常见英语词汇，可能是拼写错误或专有名词。给我上下文我可以帮你确认想表达的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a proper name (e.g., a username, brand, or place).","zh":"不是标准英语单词；更可能是拼写错误或专有名词（如用户名、品牌或地名）。"},"examples":[{"en":"I couldn’t find “caeomas” in a dictionary—could you share the sentence where you saw it?","zh":"我在词典里找不到“caeomas”，你能把它出现的句子发我吗？"},{"en":"If you meant “chaos,” the spelling is C-H-A-O-S.","zh":"如果你想表达“chaos（混乱）”，拼写是 C-H-A-O-S。"}]}],"extraExplanation":["“caeomas”很可能是输入时的拼写误差。请告诉我：1）它出现在什么句子里；2）你想表达的中文意思；或3）是否是人名/地名/品牌名。我就能准确给出词义、发音和例句。","从字母形状和常见拼写错误来看，你可能想找的词包括：\n- chaos（混乱）\n- comas（coma 的复数：昏迷）\n- caesura（诗歌中的“停顿/顿挫”）\n但需要上下文才能确定。"]}
{"word":"Caerdydd","summary":{"en":"“Caerdydd” is the Welsh name for Cardiff, the capital of Wales.","zh":"“Caerdydd”是加的夫（Cardiff）的威尔士语名称，也是威尔士的首府城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Welsh name for Cardiff, the capital city of Wales (UK).","zh":"（威尔士语）加的夫（Cardiff），英国威尔士的首府/首府城市。"},"examples":[{"en":"Caerdydd is the Welsh name for Cardiff.","zh":"Caerdydd 是 Cardiff（加的夫）的威尔士语名称。"},{"en":"I visited Caerdydd to see Cardiff Castle.","zh":"我去 Caerdydd（加的夫）参观了加的夫城堡。"},{"en":"The sign says “Caerdydd” in Welsh and “Cardiff” in English.","zh":"路牌上威尔士语写“Caerdydd”，英语写“Cardiff”。"}]}],"synonyms":["Cardiff"],"phonetic":"/kaɪˈrdiːð/","extraExplanation":["“Caerdydd”是威尔士语地名，常见于双语路牌、官方文件与媒体中。口语/写作里，讲英语的人通常用“Cardiff”，讲威尔士语的人用“Caerdydd”。","发音提示：威尔士语里的“dd”通常发英语th在“this”里的浊音/ð/，所以词尾听起来像带“th”音。"]}
{"word":"caeremoniarius","summary":{"en":"A Latin term meaning a ceremonial officer, especially a church master of ceremonies.","zh":"拉丁语：礼仪官，尤指教会中负责安排与主持仪式的司礼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Latin; used in church or historical writing) a ceremonial officer—especially the person who organizes and directs religious ceremonies; a “master of ceremonies.”","zh":"（拉丁语；常见于教会或历史语境）礼仪官；尤指负责安排并主持宗教仪式的人，相当于“司礼/礼仪主持人”。"},"examples":[{"en":"In the cathedral records, the caeremoniarius is responsible for directing the procession.","zh":"在大教堂的档案中，caeremoniarius 负责指挥游行队伍（仪式队列）。"},{"en":"The bishop consulted the caeremoniarius before the Mass to confirm the order of the rite.","zh":"主教在弥撒前请教 caeremoniarius，以确认礼仪流程。"}]}],"synonyms":["master of ceremonies","ceremonial officer","ritual director"],"phonetic":"/ˌsɛrəˌmoʊniˈɛriəs/","extraExplanation":["这是拉丁语词，源自 *caeremonia*（礼仪、宗教仪式）。在天主教礼仪传统中，对应的现代英语常见说法是 **master of ceremonies** 或 **ceremonial officer**。","拼写里 **ae** 是拉丁语常见组合；现代英语里往往简化为 **e**（如 *caeremony* → *ceremony*），所以你也可能在资料里看到更接近英语的形式。"]}
{"word":"Caerfyrddin","summary":{"en":"Caerfyrddin is the Welsh name for the town of Carmarthen in southwest Wales.","zh":"Caerfyrddin 是威尔士西南部城镇 Carmarthen（卡马森）的威尔士语名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Carmarthen (the Welsh name for a town in southwest Wales), historically an important market town and county town of Carmarthenshire.","zh":"卡马森（威尔士语名：Caerfyrddin），位于威尔士西南部的城镇；历史上是重要的集镇与卡马森郡的郡治。"},"examples":[{"en":"Caerfyrddin is known in English as Carmarthen.","zh":"Caerfyrddin 的英文名是 Carmarthen（卡马森）。"},{"en":"We stopped in Caerfyrddin on our trip through southwest Wales.","zh":"我们在穿越威尔士西南部的旅行中在 Caerfyrddin 停留了一下。"}]}],"synonyms":["Carmarthen"],"phonetic":"/kaɪrˈvɜrðɪn/","extraExplanation":["“Caerfyrddin”由“caer”（堡垒、城堡）+“Myrddin”（默林/梅林）相关形式构成，因此常被民间解释为“梅林的堡垒”。它也与拉丁语地名“Moridunum”（意为“海边的堡垒”）有关，反映了威尔士地名常见的凯尔特语与罗马时期叠加的历史。","在亚瑟王传说传统中，Carmarthen 一带常与梅林（Merlin/Myrddin）的故事联系在一起；例如当地流传“梅林的橡树（Merlin’s Oak）”等民俗说法，属于地方文化记忆的一部分。"]}
{"word":"caerimonia","summary":{"en":"“Caerimonia” is a Latin word meaning “ceremony,” especially a religious rite or formal observance, and by extension “formalities” or “ceremonial behavior.”","zh":"“caerimonia”是拉丁语，意为“仪式/典礼”，尤指宗教礼仪或正式礼节；也可引申为“讲究形式的礼节/客套”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Latin) a ceremony; a religious rite or formal observance.","zh":"（拉丁语）仪式；典礼；宗教礼仪或正式的礼节。"},"examples":[{"en":"In Latin texts, “caerimonia” often refers to a religious rite.","zh":"在拉丁文献中，“caerimonia”常指宗教礼仪。"},{"en":"The author describes the public caerimonia held in honor of the gods.","zh":"作者描述了为诸神举行的公共仪式。"}]},{"partOfSpeech":"n.","definition":{"en":"(By extension) outward respect, formalities, or ceremonial behavior.","zh":"（引申）礼节；外在的尊敬；讲究形式的做法。"},"examples":[{"en":"They performed the greeting with full caerimonia, following tradition.","zh":"他们按传统以完整的礼节进行问候。"},{"en":"He insisted on caerimonia even in small meetings.","zh":"即使在小型会议中，他也坚持讲究礼节和形式。"}]}],"synonyms":["ceremonia","rite","ritual","observance","formalities"],"phonetic":"/ˌsɛrəˈmoʊniə/","extraExplanation":["“caerimonia”更常见的拼写是“caeremonia”。它是英语“ceremony（仪式）”的词源之一：从拉丁语进入古法语，后来形成现代英语拼写与用法。","在古罗马语境中，这个词常与宗教、祭祀、公共典礼相关；在较宽泛的用法里，也可指“形式上的礼节/客套”。"]}
{"word":"Caerleon","summary":{"en":"Caerleon is a town in southeast Wales, famous for its Roman history and ruins.","zh":"Caerleon 是威尔士东南部的一座城镇，以罗马历史与遗址闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A town in southeast Wales (near Newport), known for its Roman-era remains and its history as a legionary fortress.","zh":"英国威尔士东南部的一座城镇（靠近纽波特），以罗马时期遗址闻名，历史上曾是罗马军团要塞。"},"examples":[{"en":"We visited Caerleon to see the Roman amphitheatre and baths.","zh":"我们去卡莱昂参观了罗马圆形剧场和浴场遗址。"},{"en":"Caerleon is often mentioned in discussions of Roman Wales.","zh":"在谈到“罗马时代的威尔士”时，卡莱昂常常会被提到。"}]}],"synonyms":["(no direct synonyms; related: Roman legionary fortress, Roman amphitheatre)"],"phonetic":"/kɛrˈliːən/","extraExplanation":["“Caerleon”是专有名词，常见写法首字母大写；中文多译作“卡莱昂”。","词源上常被解释为威尔士语中“caer（堡垒/要塞）+（与）legion（军团）相关”的组合，因此与当地的罗马军团驻扎历史有关。","在英国文化语境里，Caerleon除了罗马遗址，也常与亚瑟王传说的地点联想一起出现（文学与民间传说中的关联并不等同于确凿史实）。"]}
{"word":"Caernarfon","summary":{"en":"Caernarfon is a town in northwest Wales, famous for its medieval castle and Welsh cultural history.","zh":"Caernarfon（卡那封）是威尔士西北部城镇，以其中世纪城堡与威尔士文化历史著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a town in northwest Wales, known for Caernarfon Castle (a major medieval fortress) and as a historic center of Welsh culture; it is also the county town of Gwynedd.","zh":"英国威尔士西北部的一个城镇，以卡那封城堡（重要的中世纪要塞）闻名，也是威尔士文化的历史重镇之一；同时是圭内斯郡的郡治所在地。"},"examples":[{"en":"We visited Caernarfon to tour the castle and walk along the old town walls.","zh":"我们去卡那封参观城堡，并沿着古城墙散步。"},{"en":"Caernarfon is a good base for exploring Snowdonia (Eryri) National Park.","zh":"卡那封是探索斯诺登尼亚（Eryri）国家公园的好据点。"}]}],"synonyms":["Caernarfon Castle","Gwynedd","Snowdonia (Eryri)"],"phonetic":"/kɑrˈnɑrvən/","extraExplanation":["“Caernarfon”来自威尔士语地名，常被解释为“在阿尔丰（Arfon）对岸/前方的堡垒”（caer=堡垒）。英语中它是专有名词，通常不加冠词。","卡那封城堡与英国王室历史相关：1969年查尔斯王子在此举行“威尔士亲王”授衔仪式（investiture），因此在新闻与历史写作中常被提及。"]}
{"word":"Caernarfonshire","summary":{"en":"Caernarfonshire is a historic county in northwest Wales, UK.","zh":"Caernarfonshire 是英国威尔士西北部的一个历史郡名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historic county in northwest Wales (United Kingdom), centered on the town of Caernarfon; it roughly corresponds to today’s Gwynedd area.","zh":"英国威尔士西北部的一个历史郡（以卡那封/凯尔纳封镇为中心）；大致相当于今天的圭内斯（Gwynedd）部分地区。"},"examples":[{"en":"My grandfather’s family came from Caernarfonshire in northwest Wales.","zh":"我祖父那边的家族来自威尔士西北部的卡那封郡（Caernarfonshire）。"},{"en":"The guidebook describes Caernarfonshire as a region of castles, mountains, and coastline.","zh":"旅游指南把卡那封郡描述为一个有城堡、群山和海岸线的地区。"}]}],"synonyms":["Carnarvonshire"],"phonetic":"/kərˈnɑːrfənˌʃaɪr/","extraExplanation":["这是一个“历史行政区名”（historic county name）。1974年英国地方政府改革后，Caernarfonshire 作为行政郡不再使用，相关区域主要并入 Gwynedd；但在历史、家谱研究、文化/地理叙述中仍常出现。","拼写与名称：Caernarfonshire 也常见作 Carnarvonshire（较旧或英语化的拼写）。Caernarfon 是威尔士语拼写，更贴近当地用法。","读音提示：-shire 在英式英语里常读作 /ʃə/（像“shuh”），在美式语境中常被读得更清楚些（接近“shire”）。实际使用时，地名读音差异很常见。"]}
{"word":"Caernarvon","summary":{"en":"Caernarvon is an older spelling for Caernarfon, a Welsh town famous for its castle; it can also refer to the title “Earl of Caernarvon.”","zh":"Caernarvon 是威尔士城镇 Caernarfon 的较旧拼法，以城堡闻名；也可指贵族头衔“Earl of Caernarvon（卡那封伯爵）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A town in northwest Wales (now commonly spelled Caernarfon), known for its medieval castle and its historical links to the title “Prince of Wales.”","zh":"英国威尔士西北部的一座城镇（现更常拼作 Caernarfon），以中世纪城堡闻名，并与“威尔士亲王”称号的历史联系密切。"},"examples":[{"en":"We visited Caernarvon to see the castle and walk along the old town walls.","zh":"我们去了 Caernarvon 看城堡，并沿着老城墙散步。"},{"en":"Caernarvon Castle is one of the most famous landmarks in Wales.","zh":"Caernarvon Castle 是威尔士最著名的地标之一。"}]},{"partOfSpeech":"n.","definition":{"en":"A British aristocratic title used in “Earl of Caernarvon” (often associated with the Carnarvon family).","zh":"英国贵族头衔，用于“Earl of Caernarvon（卡那封伯爵）”（常与卡那封家族相关）。"},"examples":[{"en":"The Earl of Caernarvon is a title in the British peerage.","zh":"Earl of Caernarvon 是英国贵族爵位体系中的一个头衔。"},{"en":"In a history book, I read about Lord Carnarvon and the discovery of Tutankhamun’s tomb.","zh":"在一本历史书里，我读到卡那封勋爵与图坦卡蒙陵墓的发现。"}]}],"synonyms":["Caernarfon","Carnarvon"],"phonetic":"/kɑrˈnɑrvən/","extraExplanation":["“Caernarvon”是较旧的英文拼法；现代更常见的是“Caernarfon”，更接近威尔士语原名。学习时可以把两者视为同一个地方名的不同拼写。","威尔士语词源常被解释为：caer（堡垒/城堡）+ Arfon（“对着/在蒙岛 Anglesey 的对岸的地区”），因此这个地名和地理位置、城堡历史都有关系。","历史与文化小提示：Caernarfon Castle 常出现在英国王室与威尔士历史的语境中；而“Lord Carnarvon（卡那封勋爵）”在英语世界里也常因资助发掘图坦卡蒙陵墓而被提及。"]}
{"word":"Caernarvonshire","summary":{"en":"Caernarvonshire is a historic county in northwest Wales, now mostly part of Gwynedd.","zh":"Caernarvonshire 指威尔士西北部的历史郡（卡纳封郡），现多属圭内斯郡。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historic county in northwest Wales (UK), now largely within the modern county of Gwynedd; also spelled Caernarfonshire","zh":"英国威尔士西北部的历史郡名（卡纳封郡），现大部分地区属于现代的圭内斯郡（Gwynedd）；亦作 Caernarfonshire"},"examples":[{"en":"My great-grandmother was born in Caernarvonshire and later moved to Liverpool.","zh":"我曾祖母出生在卡纳封郡，后来搬去了利物浦。"},{"en":"The records list the farm as being in Caernarvonshire, Wales.","zh":"档案记录里写这座农场位于威尔士的卡纳封郡。"}]}],"synonyms":["Caernarfonshire"],"phonetic":"/kɑrˈnɑrvənˌʃɚ/","extraExplanation":["“Caernarvonshire / Caernarfonshire”是英语中对该郡名的写法；在现代行政区划中，这个历史郡已不再作为主要行政单位使用，相关地区多并入“Gwynedd（圭内斯郡）”。","拼写差异常见于历史文献与家谱、旧地图：Caernarvonshire（较旧、较常见于英语）与 Caernarfonshire（更接近当地地名 Caernarfon 的写法）。","该地名源自威尔士语地名“Caernarfon”，与中世纪的卡纳封城堡（Caernarfon Castle）及威尔士亲王授封传统等历史文化有关。"]}
{"word":"Caerphilly","summary":{"en":"Caerphilly refers to a town in South Wales and to a mild Welsh cheese named after it.","zh":"Caerphilly（凯尔菲利）既指威尔士南部的一座城镇，也指以该地命名的一种温和的威尔士奶酪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a town in South Wales (UK), known for Caerphilly Castle","zh":"英国威尔士南部的一座城镇，以凯尔菲利城堡（Caerphilly Castle）闻名"},"examples":[{"en":"We visited Caerphilly to see the castle.","zh":"我们去凯尔菲利参观了那座城堡。"},{"en":"Caerphilly is a short trip from Cardiff.","zh":"凯尔菲利离加的夫不远。"}]},{"partOfSpeech":"n.","definition":{"en":"a mild, crumbly white cheese originally made in Wales","zh":"一种源自威尔士的白色奶酪，口味温和、质地略松碎（凯尔菲利奶酪）"},"examples":[{"en":"This salad tastes great with Caerphilly cheese.","zh":"这道沙拉配凯尔菲利奶酪很好吃。"},{"en":"Caerphilly is often described as mild and slightly tangy.","zh":"凯尔菲利奶酪常被形容为温和、带一点微酸。"}]}],"phonetic":"/kɛrˈfɪli/","extraExplanation":["“Caerphilly”既是地名也是奶酪名：奶酪通常以产地命名。你在菜单或超市看到时，多半指奶酪；在旅游、地图或新闻中则多指威尔士的城镇。","读音上，重音常落在第二部分（-PHIL-）附近；拼写里的“ae”在这里不按字母逐个发音，整体读起来更像“care-FIL-lee”。","文化小知识：Caerphilly Castle 是英国最大的城堡之一（按占地面积），因此“Caerphilly”在英国旅行语境里经常与“castle（城堡）”一起出现。"]}
{"word":"caerphilly","summary":{"en":"Caerphilly is a town in South Wales and also the name of a mild Welsh cheese.","zh":"Caerphilly既是威尔士南部的城镇名，也是一种温和的威尔士奶酪名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a town in South Wales, known for Caerphilly Castle and as the place associated with Caerphilly cheese","zh":"（英国）威尔士南部的一个城镇，以卡菲利城堡闻名，也与卡菲利奶酪相关"},"examples":[{"en":"We visited Caerphilly to see the famous medieval castle.","zh":"我们去了卡菲利参观著名的中世纪城堡。"},{"en":"Caerphilly is a good base for exploring South Wales.","zh":"卡菲利是探索威尔士南部的一个不错据点。"}]},{"partOfSpeech":"n.","definition":{"en":"a mild, crumbly white cheese traditionally made in Wales (often called “Caerphilly cheese”)","zh":"卡菲利奶酪：一种传统威尔士白色奶酪，味道温和、口感易碎（常说“Caerphilly cheese”）"},"examples":[{"en":"She made a sandwich with Caerphilly cheese and tomatoes.","zh":"她用卡菲利奶酪和番茄做了一个三明治。"},{"en":"Caerphilly is milder than some aged cheeses.","zh":"卡菲利奶酪比一些陈年奶酪更温和。"}]}],"synonyms":["Caerphilly cheese","Welsh cheese"],"phonetic":"/kɛrˈfɪli/","extraExplanation":["“Caerphilly”来自威尔士语：常见解释是“caer（堡垒）+ philly（可能与地名/个人名有关）”。英语中通常把它当作地名专有名词使用。","卡菲利城堡（Caerphilly Castle）是英国最大的城堡之一，以巨大的护城河与同心式防御结构著称；这也是该地名在文化与旅游语境中最常见的联想。","作为奶酪名称时，通常会说“Caerphilly cheese”，在菜单或超市标签中更清楚；它多用于冷食、三明治或沙拉。"]}
{"word":"Caesalpinia","summary":{"en":"Caesalpinia is a plant genus in the legume family, known for ornamental flowers and some dye/wood species.","zh":"Caesalpinia（苏木属）是豆科植物的一属，以观赏花卉及部分可作染料/木材的物种而知名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical and subtropical flowering plants in the legume family, including species such as peacock flower and Brazilwood (some are grown as ornamentals or used for dyes/wood).","zh":"（植物）苏木属：豆科热带/亚热带开花植物的一属，包含如金凤花（peacock flower）、巴西苏木（Brazilwood）等物种；有的用于观赏，有的可提供染料或木材。"},"examples":[{"en":"Caesalpinia pulcherrima is often planted for its bright red and orange flowers.","zh":"金凤花（Caesalpinia pulcherrima）常因其鲜艳的红橙色花朵而被栽种。"},{"en":"Some Caesalpinia species have historically been valued for dye-producing wood.","zh":"历史上，苏木属的一些物种因可用于制取染料的木材而受到重视。"}]}],"synonyms":["peacock flower","Brazilwood"],"phonetic":"/ˌsiːzəlˈpɪniə/","extraExplanation":["“Caesalpinia”是以16世纪意大利植物学家 Andrea Cesalpino（安德烈亚·切萨尔皮诺）命名的拉丁化学名。","在现代分类中，部分原先归入 Caesalpinia 的物种已被重新划分到其他属；因此在不同资料里你可能会看到分类略有差异。","读音提示：重音常落在“PIN”附近（…-PIN-…），有助于更自然地读出这个学名。"]}
{"word":"caesalpinia","summary":{"en":"Caesalpinia is a genus of tropical/subtropical legume plants, often valued for ornamental flowers and sometimes for dye-producing wood.","zh":"Caesalpinia（苏木属）是豆科的一类热带/亚热带植物属，常因观赏花而种植，部分木材也可用于制作染料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical and subtropical trees and shrubs in the legume family, known for showy flowers and hard wood (some species are used for dyes or ornamentals).","zh":"（苏木属）豆科的一属热带与亚热带树木或灌木，常见特征是花朵鲜艳、木质坚硬（部分物种用于染料或园艺观赏）。"},"examples":[{"en":"The garden features Caesalpinia with bright yellow flowers.","zh":"这座花园里种有苏木属植物，开着明亮的黄色花。"},{"en":"Some Caesalpinia species have been used historically to produce natural dyes.","zh":"历史上，部分苏木属物种曾被用来提取天然染料。"}]}],"synonyms":["legume genus","Fabaceae (family)"],"phonetic":"/ˌsiːzəlˈpɪniə/","extraExplanation":["“Caesalpinia”源自意大利植物学家 Andrea Cesalpino（安德烈亚·切萨尔皮诺）的姓氏，是以人名命名的拉丁化学名。","在现代植物分类中，过去归入 Caesalpinia 的一些物种已被重新划分到其他属，因此不同资料中“苏木属”的范围可能略有差异。"]}
{"word":"Caesalpiniaceae","summary":{"en":"Caesalpiniaceae is an older botanical family name, now usually treated as part of the legume family (Fabaceae).","zh":"Caesalpiniaceae是一个较旧的植物科名，现代多并入豆科（Fabaceae）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former plant family of tropical and subtropical flowering plants (now usually treated as part of the legume family, Fabaceae), including trees and shrubs such as Caesalpinia and many related genera.","zh":"（旧分类）苏木科：热带与亚热带的开花植物类群，多为乔木或灌木；现代分类中通常并入豆科（Fabaceae）的一部分（常归为苏木亚科等）。"},"examples":[{"en":"In older textbooks, tamarind and related species were sometimes placed in Caesalpiniaceae.","zh":"在较旧的教材里，罗望子及其近缘种有时被归入苏木科（Caesalpiniaceae）。"},{"en":"The herbarium label lists the specimen under Caesalpiniaceae, reflecting an older classification system.","zh":"标本馆标签把该标本写作苏木科（Caesalpiniaceae），反映了较旧的分类体系。"}]}],"synonyms":["Caesalpinia family","(modern classification) Fabaceae (Caesalpinioideae)"],"phonetic":"/ˌsiːzəlˌpɪn.iˈeɪsi.aɪ/","extraExplanation":["“Caesalpiniaceae”在不少传统资料中被当作“科名”，但现代系统分类（如APG体系）多把它并入豆科（Fabaceae），相关成员常对应“苏木亚科（Caesalpinioideae）”等更细的分组。","词名源自植物学家Andrea Cesalpino（安德烈亚·切萨尔皮诺），许多植物科名/属名会用拉丁化的人名来命名。","阅读论文或旧版植物志时，看到Caesalpiniaceae通常意味着作者采用了较早的分类口径；与之对照的现代写法常见为Fabaceae（Caesalpinioideae）。"]}
{"word":"caesalpiniaceae","summary":{"en":"Caesalpiniaceae is an older scientific name for a group of legume plants, now usually included within the family Fabaceae.","zh":"Caesalpiniaceae 是植物学中较旧的“科名”，指一类豆科植物；现代多并入豆科（Fabaceae）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former botanical family name for a group of legume plants (now usually treated as part of the family Fabaceae, often as the subfamily Caesalpinioideae), including trees and shrubs such as cassia and redbud","zh":"（旧分类）豆科植物中的一个类群名称，传统上称“苏木科”；现代多并入豆科（Fabaceae），常作为“苏木亚科”（Caesalpinioideae），包括决明、紫荆等树木与灌木"},"examples":[{"en":"Some older textbooks list Cassia under the family Caesalpiniaceae.","zh":"一些较旧的教材会把决明属（Cassia）归在苏木科（Caesalpiniaceae）里。"},{"en":"In modern classification, many plants once placed in Caesalpiniaceae are included in Fabaceae.","zh":"在现代分类中，许多曾归入苏木科（Caesalpiniaceae）的植物被并入豆科（Fabaceae）。"}]}],"synonyms":["Caesalpinioideae","Fabaceae (in modern classification)"],"phonetic":"/ˌsiːzəlpɪˈniːeɪsiˌiː/","extraExplanation":["这是一个“旧的科名”。随着分子生物学与系统分类学的发展，许多传统科被重新划分；Caesalpiniaceae 常被视为豆科（Fabaceae）的一部分（常见写法为 Caesalpinioideae，苏木亚科）。","词源上来自植物属名 Caesalpinia（苏木属），以意大利植物学家 Andrea Cesalpino（安德烈亚·切萨尔皮诺）命名；后缀 -aceae 表示“科”（植物分类等级）。"]}
{"word":"caesalpiniaceous","summary":{"en":"A technical adjective meaning “related to the Caesalpinioideae group of legumes.”","zh":"一个植物学术语，表示“与豆科云实（苏木）亚科相关的；具有该类豆科植物特征的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the legume group (Caesalpinioideae) that includes many tropical trees and shrubs such as cassia and poinciana; resembling plants of this group.","zh":"（植物学）与豆科中“苏木亚科/云实亚科”（Caesalpinioideae）有关的；具有该类植物特征的（如许多热带乔木、灌木：决明、凤凰木等）。"},"examples":[{"en":"Tamarind is a caesalpiniaceous tree often grown in tropical regions.","zh":"罗望子是一种云实亚科的乔木，常见于热带地区种植。"},{"en":"The garden has several caesalpiniaceous plants with showy yellow flowers.","zh":"这座花园里有几种云实亚科植物，开着醒目的黄色花。"}]}],"synonyms":["caesalpinioid","Caesalpinioideae-related"],"phonetic":"/ˌsiːzəlˌpɪn.iˈeɪ.ʃəs/","extraExplanation":["词源与背景：caesalpiniaceous 来自植物分类名 Caesalpinia / Caesalpinioideae，最初与“苏木属/云实属”（Caesalpinia）相关；该属名纪念意大利植物学家 Andrea Cesalpino（切萨尔皮诺）。","用法提示：这是非常学术、偏植物分类学的形容词，日常英语里更常见的替代表达是 “Caesalpinioideae (plants)” 或 “caesalpinioid”。"]}
{"word":"caesalpinioid","summary":{"en":"A botanical adjective meaning “Caesalpinia-like” or “related to the Caesalpinia group (Caesalpinioideae) of legumes.”","zh":"一个植物学形容词，表示“像苏木属的”或“与豆科苏木亚科（Caesalpinioideae）相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Resembling or relating to plants in the Caesalpinia group (especially the subfamily Caesalpinioideae) within the legume family.","zh":"（植物学）类似或与苏木属相关的；尤指豆科中“苏木亚科（Caesalpinioideae）”这一类群的。"},"examples":[{"en":"Many tropical trees are caesalpinioid legumes with showy flowers.","zh":"许多热带树木属于苏木亚科的豆科植物，花朵十分艳丽。"},{"en":"The specimen has caesalpinioid traits, so we compared it with other Caesalpinioideae species.","zh":"这个标本具有苏木亚科的特征，因此我们把它与其他苏木亚科物种进行比较。"}]}],"synonyms":["Caesalpinia-like","Caesalpinioideae-related","caesalpinioid legume"],"phonetic":"/ˌsɛzəlˈpɪnioʊɪd/","extraExplanation":["“caesalpinioid”由专名“Caesalpinia（苏木属）”+ 后缀“-oid（……样的/类似的）”构成，常见于植物分类、形态描述与学术写作中，日常英语里很少用。","“Caesalpinia/ Caesalpinioideae”这一名称源自文艺复兴时期意大利植物学家 Andrea Cesalpino（安德烈亚·切萨尔皮诺）的拉丁化姓名，用来纪念他对植物分类的贡献。"]}
{"word":"Caesalpinioideae","summary":{"en":"Caesalpinioideae is a botanical term for a subfamily within the legume family (Fabaceae).","zh":"Caesalpinioideae 是植物学术语，指豆科（Fabaceae）中的一个亚科（苏木亚科）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a subfamily of the legume family (Fabaceae) that includes many tropical and subtropical trees and shrubs (such as cassia and bauhinia).","zh":"豆科（Fabaceae）中的一个亚科，包含许多热带与亚热带的乔木和灌木（如决明属、羊蹄甲属等）。"},"examples":[{"en":"Many street trees in the tropics belong to Caesalpinioideae.","zh":"热带地区常见的行道树中，有不少属于苏木亚科（Caesalpinioideae）。"},{"en":"The researchers compared leaf traits across Caesalpinioideae species.","zh":"研究人员比较了苏木亚科不同物种的叶片性状。"}]}],"synonyms":["caesalpinioids","subfamily Caesalpinioideae"],"phonetic":"/ˌsiːzəlˌpɪniˈɔɪdiˌiː/","extraExplanation":["这是一个植物分类学术语，常见于论文、植物志和标本标签中。名称来自代表属之一 Caesalpinia（苏木属），再加上表示“亚科”的词尾 -oideae。","在较新的分类系统中（例如基于分子系统学的更新），豆科内部的分组与范围可能会调整；因此你在不同资料中可能会看到亚科界定略有差异。"]}
{"word":"Caesalpinioideae-related","summary":{"en":"“Caesalpinioideae-related” means associated with the legume subfamily Caesalpinioideae.","zh":"“Caesalpinioideae-related”表示“与豆科的苏木亚科有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with, belonging to, or associated with the plant subfamily Caesalpinioideae (a major group within the legume family).","zh":"与苏木亚科（Caesalpinioideae，豆科中的一个重要亚科）有关的；属于或关联该亚科的。"},"examples":[{"en":"The researchers compared Caesalpinioideae-related traits across several tropical tree species.","zh":"研究人员比较了多种热带树种中与苏木亚科相关的性状。"},{"en":"This database includes Caesalpinioideae-related genera such as Senna and Cassia.","zh":"该数据库收录了与苏木亚科相关的属，例如决明属（Senna）和山扁豆属/卡西亚属（Cassia）。"}]}],"synonyms":["Caesalpinioideae-associated","Caesalpinioideae-linked","caesalpinioid (related)"],"phonetic":"/ˌsiːzəlˌpɪniˈɔɪdiˌiː-rɪˈleɪtɪd/","extraExplanation":["“Caesalpinioideae”是植物分类学中的拉丁化名称，指豆科（Leguminosae/Fabaceae）下的一个亚科；“-related”是英语中常见的构词方式，表示“与……有关”。因此“Caesalpinioideae-related”多见于学术写作、数据库标签或科普文章中，用来概括“与该亚科有关的特征、物种、基因或研究”。","在较新的分类系统（如APG相关研究）中，苏木亚科的范围和内部分组经历过调整；阅读论文时可留意作者采用的分类版本，以免将旧分类与新分类混淆。"]}
{"word":"Caesar","summary":{"en":"“Caesar” usually refers to Julius Caesar or, more broadly, a Roman imperial title meaning an emperor.","zh":"“Caesar”通常指尤利乌斯·恺撒，也可指罗马皇帝的称号，广义上表示“皇帝”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Julius Caesar (100–44 BCE), a famous Roman general and political leader who played a major role in the rise of the Roman Empire.","zh":"尤利乌斯·恺撒（公元前100–44年），著名的古罗马将军与政治领袖，对罗马从共和国走向帝制起了关键作用。"},"examples":[{"en":"Julius Caesar crossed the Rubicon, a decision that led to civil war.","zh":"尤利乌斯·恺撒“渡过卢比孔河”，这一决定引发了内战。"},{"en":"In Shakespeare’s play, Caesar is assassinated in the Senate.","zh":"在莎士比亚的戏剧中，恺撒在元老院被刺杀。"}]},{"partOfSpeech":"n.","definition":{"en":"A title used by Roman emperors (and later a general term for an emperor or ruler in some contexts).","zh":"（罗马帝国时期）皇帝的称号；在某些语境中也可泛指“皇帝/统治者”。"},"examples":[{"en":"After Julius Caesar, later rulers used “Caesar” as part of the imperial title.","zh":"在尤利乌斯·恺撒之后，后来的统治者把“Caesar”作为皇帝称号的一部分。"},{"en":"The word “czar/tsar” is historically related to “Caesar.”","zh":"“czar/tsar（沙皇）”在历史上与“Caesar（恺撒）”有关联。"}]}],"synonyms":["Julius Caesar","emperor","ruler","Kaiser","tsar"],"phonetic":"ˈsiːzər","extraExplanation":["“Caesar”通常首字母大写，因为多指人名或称号。英语里说到他常会联想到两个文化点：一是“cross the Rubicon（破釜沉舟、做出不可回头的决定）”，二是莎士比亚悲剧《Julius Caesar》，其中的名句包括“Et tu, Brute?（你也一样吗，布鲁图？）”。","词源文化上，“Caesar”后来影响了多种语言里的“皇帝”称呼，例如德语“Kaiser（凯撒）”与俄语“Tsar/Czar（沙皇）”。"]}
{"word":"caesar","summary":{"en":"Caesar usually refers to Julius Caesar, and historically it can also mean “emperor” as a title.","zh":"Caesar通常指“尤利乌斯·凯撒”，历史上也可指“皇帝”的称号。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Julius Caesar (100–44 BCE), a Roman general and statesman who played a key role in turning the Roman Republic into the Roman Empire.","zh":"尤利乌斯·凯撒（公元前100–44年），古罗马将军与政治家，在罗马共和国向罗马帝国转变过程中起了关键作用。"},"examples":[{"en":"Julius Caesar was assassinated on the Ides of March.","zh":"尤利乌斯·凯撒在“三月十五日”遇刺身亡。"},{"en":"In Shakespeare’s play Julius Caesar, betrayal and power are central themes.","zh":"在莎士比亚的戏剧《尤利乌斯·凯撒》中，背叛与权力是核心主题。"}]},{"partOfSpeech":"n.","definition":{"en":"A ruler’s title meaning “emperor,” used in ancient Rome and later adopted in other languages and empires (historical).","zh":"“皇帝/帝王”的称号：起源于古罗马，后来被其他语言与帝国沿用（历史用法）。"},"examples":[{"en":"After the Republic ended, the title Caesar became connected with the idea of an emperor.","zh":"共和国终结后，“Caesar”这一称号逐渐与“皇帝”的概念紧密相连。"},{"en":"The word Kaiser in German is historically related to Caesar.","zh":"德语中的“Kaiser”在历史上与“Caesar”有关联。"}]}],"synonyms":["Julius Caesar","emperor (historical sense)"],"phonetic":"/ˈsiːzɚ/","extraExplanation":["“Caesar”既是人名也具有“头衔”的历史含义：尤利乌斯·凯撒去世后，“Caesar”逐渐从家族名演变为帝王称号（如屋大维常被称为“Caesar Augustus”）。","文学与文化中常见典故：\n- “Et tu, Brute?”（你也背叛我吗，布鲁图？）常被用来表达“被亲近的人背叛”的情绪（源于莎士比亚戏剧的流行表达，并非确定的史实原话）。\n- “the Ides of March”（三月十五日）常用来暗示“不祥的预兆/政治危机”。"]}
{"word":"Caesar's","summary":{"en":"“Caesar’s” is the possessive form of “Caesar,” meaning “belonging to Caesar” or something named Caesar.","zh":"“Caesar’s”是“Caesar”的所有格，表示“凯撒的/属于凯撒的”或“以凯撒命名的事物的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"belonging to Caesar (used to show possession, usually referring to Julius Caesar or something named “Caesar”).","zh":"凯撒的；属于凯撒的（用于表示所属关系，通常指尤利乌斯·凯撒或以“Caesar”命名的事物）。"},"examples":[{"en":"Caesar's army crossed the Rubicon.","zh":"凯撒的军队渡过了卢比孔河。"},{"en":"We visited Caesar's Palace in Las Vegas.","zh":"我们参观了拉斯维加斯的“凯撒宫”（Caesar's Palace）。"}]}],"synonyms":["of Caesar","Caesarian (rare/technical in other meanings)"],"phonetic":"/ˈsiːzərz/","extraExplanation":["“Caesar’s”是专有名词“Caesar”的所有格形式：Caesar + ’s，用来表示“……的”。写作中常见于历史语境（尤利乌斯·凯撒）或品牌/地名（如 Caesar’s Palace）。","发音里末尾的 /z/ 来自所有格 -’s 的读音：以浊辅音/元音结尾时通常读作 /z/（如 Caesar’s /ˈsiːzərz/）。","文化提醒：英语里“Caesar”还常出现在固定名称中，如 Caesar salad（通常写作“Caesar salad”，不加 ’s）指一种凯撒沙拉，名字来自发明者（厨师 Caesar Cardini），不一定与古罗马凯撒本人有关。"]}
{"word":"Caesaraugusta","summary":{"en":"Caesaraugusta is the Roman name of modern Zaragoza, Spain.","zh":"Caesaraugusta 是西班牙萨拉戈萨（Zaragoza）的古罗马名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The ancient Roman name for the city now called Zaragoza, in northeastern Spain; a colony founded under Emperor Augustus.","zh":"西班牙东北部城市萨拉戈萨（Zaragoza）的古罗马名称；由奥古斯都时期建立的罗马殖民城市。"},"examples":[{"en":"Caesaraugusta was an important Roman settlement on the Ebro River.","zh":"Caesaraugusta 是埃布罗河沿岸的重要罗马聚落。"},{"en":"In Roman-era inscriptions, Zaragoza often appears as Caesaraugusta.","zh":"在罗马时代的铭文中，萨拉戈萨常以 Caesaraugusta 的名字出现。"}]}],"synonyms":["Zaragoza","Saragossa"],"phonetic":"/ˌsiːzərɔːˈɡʌstə/","extraExplanation":["这个名字是对“凯撒（Caesar）”与“奥古斯都（Augustus）”的致敬，反映了罗马帝国常用“以皇帝之名为城市命名”的传统。","Caesaraugusta 大致可理解为“奥古斯都的凯撒之城”。它是罗马在伊比利亚半岛的重要城市之一，后来在语言演变中逐渐发展为现代地名 Zaragoza（中文常译作‘萨拉戈萨’）。"]}
{"word":"Caesardom","summary":{"en":"Caesardom means Caesar-like personal dictatorship or autocratic rule by a single strong leader.","zh":"Caesardom 指类似凯撒的个人独裁统治或强人政治。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"autocratic rule by a single strong leader; a political system based on Caesar-like personal dictatorship","zh":"（类似“凯撒式”的）个人独裁统治；强人政治体制"},"examples":[{"en":"Critics warned that the new constitution could slide into Caesardom.","zh":"批评者警告说，新宪法可能会滑向凯撒式的个人独裁。"},{"en":"Some historians describe the late republic’s crisis as creating conditions for Caesardom.","zh":"一些历史学家认为，罗马共和国晚期的危机为“凯撒式统治”的出现创造了条件。"}]}],"synonyms":["autocracy","dictatorship","despotism","strongman rule","one-man rule"],"phonetic":"/ˈsiːzərdəm/","extraExplanation":["“Caesardom”源自“Caesar（凯撒）+ -dom（……的统治/状态）”。它常用于政治评论或历史写作，带有批判色彩，强调权力集中在个人、制度被弱化。","它不一定特指古罗马；也可泛指任何时代出现的“强人领袖—个人崇拜—权力集中”的治理模式。"]}
{"word":"caesardom","summary":{"en":"Caesardom means the rule or system of a Caesar—imperial, often autocratic government by one supreme leader.","zh":"Caesardom 指“凯撒式”的统治或制度，即由最高统治者掌权的帝制或常带贬义的个人专制统治。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the position, rule, or system of a Caesar; imperial or autocratic government associated with a supreme ruler","zh":"“凯撒”的地位、统治或制度；指由最高统治者掌权的帝制/专制统治"},"examples":[{"en":"Some historians warned that the republic was sliding toward caesardom.","zh":"一些历史学家警告说，这个共和国正在滑向“凯撒式”的个人专制统治。"},{"en":"He feared caesardom—one strong leader controlling the courts and the army.","zh":"他担心出现“凯撒式统治”——一个强人掌控法院和军队。"}]}],"synonyms":["autocracy","dictatorship","authoritarian rule","imperial rule"],"phonetic":"/ˈsiːzərdəm/","extraExplanation":["“Caesardom”来自“Caesar（凯撒）+ -dom（……的领域/统治）”。在英语里它常带批评意味，用来形容从共和或民主走向“强人政治”“个人独裁”的倾向。","历史文化背景：Julius Caesar（尤利乌斯·凯撒）在罗马共和国末期权力极大，后来“Caesar”逐渐成为罗马皇帝头衔的象征。它还影响了其他语言中的帝王称号，如德语 Kaiser（凯泽）和俄语 Tsar（沙皇）。","使用提示：现代英语中该词较少见，多出现在历史、政治评论或带修辞色彩的写作里。更常用的近义表达有 “dictatorship / autocracy / authoritarian rule”。"]}
{"word":"Caesarea","summary":{"en":"Caesarea is a Roman-era city name, most often referring to Caesarea Maritima, a major ancient port on the Mediterranean coast of Palestine.","zh":"Caesarea（凯撒利亚）是罗马时期常见的城名，最常指巴勒斯坦地中海沿岸的重要古港——海滨凯撒利亚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient city name used for several places in the Roman world, especially a major Mediterranean port in Palestine built by Herod the Great (often called Caesarea Maritima).","zh":"“凯撒利亚”：古罗马时期多个城市的名称，最常指巴勒斯坦地中海沿岸由希律王修建的重要港口城市（常称“海滨凯撒利亚”）。"},"examples":[{"en":"Paul was taken to Caesarea to be tried before the Roman governor.","zh":"保罗被押到凯撒利亚，在罗马总督面前受审。"},{"en":"Archaeologists excavated the theater at Caesarea Maritima.","zh":"考古学家发掘了海滨凯撒利亚的古剧场。"}]},{"partOfSpeech":"n.","definition":{"en":"Less commonly, the name of other ancient cities, such as Caesarea in Cappadocia (near modern Kayseri, Turkey).","zh":"较少见：也可指其他同名古城，例如卡帕多西亚的凯撒利亚（靠近今土耳其开塞利）。"},"examples":[{"en":"Some early Christian writers lived near Caesarea in Cappadocia.","zh":"一些早期基督教作家曾生活在卡帕多西亚的凯撒利亚附近。"}]}],"synonyms":["Caesarea Maritima (when the coastal city is meant)"],"phonetic":"/ˌsiːzəˈriːə/","extraExplanation":["“Caesarea”源自拉丁语，意为“属于凯撒的（城市）”，因此在罗马帝国时期常被用来给城市命名，以表达对皇帝的效忠或纪念。","在英语史料和《圣经》语境里，单独写“Caesarea”时往往默认指“Caesarea Maritima（海滨凯撒利亚）”，因为它在犹太行省的行政与军事地位很重要。阅读时若看到“Philippi”等限定（如“Caesarea Philippi”），则指另一座位于更北部内陆的城市。"]}
{"word":"Caesarean","summary":{"en":"Caesarean: a surgical delivery of a baby through the abdomen and uterus; also describes things related to that operation.","zh":"Caesarean：指通过切开腹部与子宫进行的剖宫产；也可作形容词表示与该手术相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical operation to deliver a baby through cuts made in the mother’s abdomen and uterus (often used when a vaginal birth would be risky).","zh":"剖宫产；通过切开孕妇腹部和子宫来分娩婴儿的手术（常用于阴道分娩风险较高时）。"},"examples":[{"en":"Because the baby was breech, the doctor recommended a Caesarean.","zh":"因为胎位是臀位，医生建议进行剖宫产。"},{"en":"She recovered well after a Caesarean section.","zh":"她在剖宫产手术后恢复得很好。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to a Caesarean birth or the operation itself.","zh":"与剖宫产（分娩方式或手术）有关的。"},"examples":[{"en":"She has a Caesarean scar on her lower abdomen.","zh":"她下腹部有一道剖宫产疤痕。"},{"en":"The hospital has clear Caesarean guidelines for emergencies.","zh":"医院对紧急情况下的剖宫产有明确的规范。"}]}],"synonyms":["C-section","cesarean section"],"phonetic":"/səˈzɛriən/","extraExplanation":["“Caesarean”在英式英语中常拼作Caesarean（美式更常见拼写是Cesarean）。口语里也常说“C-section”。","关于词源：大众常把它和尤利乌斯·凯撒（Julius Caesar）联系在一起，但这种说法未必可靠；更可能与拉丁语中“切开”的词根有关。现代医学里它就是指剖宫产手术。"]}
{"word":"caesarean","summary":{"en":"A caesarean is a surgical way to deliver a baby through the mother’s abdomen and uterus (C-section).","zh":"caesarean 指“剖腹产/剖宫产”，即通过切开孕妇腹部与子宫来分娩（C-section）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical operation to deliver a baby through cuts in the mother’s abdomen and uterus (also called a C-section)","zh":"剖腹产；通过切开孕妇腹部和子宫来分娩婴儿的手术（也叫“C-section / 剖宫产”）"},"examples":[{"en":"She had a caesarean because the baby was in a breech position.","zh":"她因为胎位是臀位而进行了剖腹产。"},{"en":"The doctor explained the risks and recovery time for a caesarean.","zh":"医生解释了剖腹产的风险和恢复时间。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to a birth delivered by this operation","zh":"与剖腹产（分娩方式）有关的；剖腹产的"},"examples":[{"en":"She is recovering after a caesarean delivery.","zh":"她正在从剖腹产分娩中恢复。"},{"en":"Some women need caesarean births for medical reasons.","zh":"有些女性因医学原因需要剖腹产。"}]}],"synonyms":["C-section","cesarean section"],"phonetic":"/səˈzeriən/","extraExplanation":["英式拼写是 caesarean，美式常写作 cesarean；口语里也常说 C-section（读作 “C section”）。","关于词源：大众常把它和 Julius Caesar（凯撒）联系在一起，但这种说法多半是民间传说；更可能与拉丁语 *caedere*（“切开”）有关。","语境提示：讨论分娩方式时，这个词是中性医学用语；在对话中可以用更委婉的表达，如 “had a C-section” 或 “delivered by C-section”。"]}
{"word":"Caesareanize","summary":{"en":"A rare verb meaning “to perform a C-section (Caesarean section) to deliver a baby.”","zh":"较少见的动词，意思是“对产妇实施剖腹产以分娩婴儿”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to deliver a baby by performing a Caesarean section (C-section) on the mother","zh":"对产妇实施剖腹产（C-section）以分娩婴儿"},"examples":[{"en":"The doctor decided to caesareanize the patient because the baby was in distress.","zh":"由于胎儿出现危险情况，医生决定为产妇实施剖腹产。"},{"en":"In modern hospitals, some complicated births may require caesareanizing the mother.","zh":"在现代医院里，一些复杂分娩可能需要对产妇进行剖腹产。"}]}],"synonyms":["perform a C-section","deliver by Caesarean section","do a C-section"],"phonetic":"/səˈsɛriəˌnaɪz/","extraExplanation":["“Caesareanize”在日常英语中很少用，更常见、也更自然的说法是：perform a Caesarean/Cesarean section、do a C-section，或用名词短语 have a C-section（产妇“接受剖腹产”）。","拼写上英式常写 Caesarean，美式也常见 Cesarean；两者意思相同。实际写作中（尤其医学语境）更推荐用 “Caesarean section / C-section” 而不是动词 “caesareanize”。"]}
{"word":"caesareanize","summary":{"en":"A rare verb meaning “to perform a Caesarean section (C-section) on (a mother) to deliver a baby.”","zh":"较少见的动词，意思是“对（产妇）实施剖宫产以分娩”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to deliver a baby by performing a Caesarean section (C-section) on the mother; to perform a C-section on","zh":"通过剖宫产（C-section）分娩；对（产妇）实施剖宫产"},"examples":[{"en":"The doctors decided to caesareanize the patient because the baby was in distress.","zh":"因为胎儿出现窘迫，医生决定为这位产妇实施剖宫产。"},{"en":"In emergency cases, a mother may be caesareanized to protect both her and the baby.","zh":"在紧急情况下，可能会对产妇实施剖宫产，以保护母婴安全。"}]}],"synonyms":["perform a C-section","do a C-section","deliver by C-section","cesareanize"],"phonetic":"/səˈzɛriəˌnaɪz/","extraExplanation":["这是一个很少见、偏“造词式”的动词，多见于医学或学术语境。日常英语里更常用表达是：perform a C-section (on someone) / do a C-section / deliver by C-section。","拼写上也常见英式写法 caesareanize 与美式拼写 cesareanize（美式更常见），但两者意思相同。","词源与“Caesarean section（剖宫产）”相关；关于是否与罗马的 Julius Caesar（凯撒）出生方式有关，学界与大众说法不一，但现代医学术语的核心含义就是“剖宫产”。"]}
{"word":"caesareans","summary":{"en":"“Caesareans” means C-sections—surgical births through the abdomen and uterus; it can also be used as an adjective meaning “related to a C-section.”","zh":"“Caesareans”指剖宫产（C-section）的复数形式；也可作形容词，表示“与剖宫产有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical operation used to deliver a baby through cuts in the mother’s abdomen and uterus; also called a C-section (plural: caesareans).","zh":"剖宫产；通过切开产妇腹部和子宫来分娩的手术（复数：caesareans）。"},"examples":[{"en":"She had an emergency caesarean because the baby’s heartbeat dropped.","zh":"因为宝宝心跳下降，她做了紧急剖宫产。"},{"en":"After two caesareans, her doctor discussed the safest plan for a future pregnancy.","zh":"做过两次剖宫产后，医生和她讨论了未来怀孕的最安全方案。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to a C-section delivery or the surgery itself.","zh":"与剖宫产（C-section）分娩或该手术有关的。"},"examples":[{"en":"The report described caesarean delivery rates in the hospital.","zh":"报告描述了该医院的剖宫产分娩率。"},{"en":"She is recovering from a caesarean operation.","zh":"她正在从剖宫产手术中恢复。"}]}],"synonyms":["C-section","cesarean section","surgical delivery"],"phonetic":"/sɪˈzɛriən/","extraExplanation":["“caesarean”常见同义说法是 **C-section**（更口语、在医疗场景也很常用）。英式拼写常见 **caesarean**，美式更常见 **cesarean**。","词源常被民间传说与尤利乌斯·凯撒（Julius Caesar）联系在一起，但历史学者普遍认为这种联系不可靠；更可能与拉丁语中表示“切开”的词根有关。"]}
{"word":"Caesaria","summary":{"en":"Caesaria is usually a proper name (a feminine given name) and can also be a Latin-style variant linked to place names like Caesarea, meaning “of Caesar/imperial.”","zh":"Caesaria 通常是专有名词（女性名字），也可作为与 Caesarea 等地名相关的拉丁化拼写变体，含“凯撒的／帝国的”之意。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feminine given name, often understood as a variant of “Caesarea/Caesaria,” meaning “of Caesar” or “imperial,” from Latin roots related to Caesar.","zh":"女性名字，常被视为“Caesarea/Caesaria”的变体，含义多与“凯撒的／帝国的”相关，源自拉丁语中与 Caesar（凯撒）有关的词根。"},"examples":[{"en":"Caesaria is an uncommon name, but it appears in some historical and religious contexts.","zh":"Caesaria 不是常见名字，但会出现在一些历史和宗教语境中。"},{"en":"They named their daughter Caesaria to reflect a classical Roman influence.","zh":"他们给女儿取名 Caesaria，以体现古典罗马风格的影响。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical/geographical) a Latin-style form related to places named for Caesar, similar to “Caesarea,” used in some texts to refer to ancient cities (for example, places in the Roman/Byzantine world).","zh":"（历史／地理）一种拉丁化写法，与以凯撒命名的地名相关，类似 “Caesarea”，在某些文本中用于指代古代城市（如罗马／拜占庭世界中的一些城市）。"},"examples":[{"en":"Some older sources use Latinized spellings like Caesaria when discussing ancient Mediterranean cities.","zh":"一些较早的资料在讨论古代地中海城市时，会使用类似 Caesaria 这样的拉丁化拼写。"},{"en":"The manuscript’s spelling differs: one page says Caesaria, another says Caesarea.","zh":"这份手稿的拼写不一致：一页写 Caesaria，另一页写 Caesarea。"}]}],"synonyms":["Caesarea","Cesarea"],"phonetic":"/siˈzɛriə/","extraExplanation":["“Caesaria / Caesarea”背后常见的词源线索是拉丁语 Caesar（凯撒），因此很多相关地名最初带有“皇帝的、帝国的”色彩。历史上有多座城市叫 Caesarea（如“凯撒利亚”一类译名），不同语言、抄写与转写会造成拼写变体。","如果你是在特定文本、地图或家谱中看到 Caesaria，最好结合上下文判断它是“人名”还是“地名/地名变体”，并留意相近拼写：Caesarea, Caesaria, Cesarea 等。"]}
{"word":"Caesarian","summary":{"en":"“Cesarean/Caesarean” means a baby delivered by surgical operation (C-section), and it can be an adjective or a noun.","zh":"“cesarean/caesarean”指剖宫产（C-section），既可作形容词也可作名词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Adj.) Relating to a cesarean birth (a baby delivered through a surgical cut in the mother’s abdomen and uterus).","zh":"（形容词）与剖宫产有关的；指通过手术切开孕妇腹部与子宫来分娩的。"},"examples":[{"en":"She had a cesarean delivery because the baby was breech.","zh":"因为宝宝是臀位，她做了剖宫产。"},{"en":"The doctor discussed cesarean risks and recovery time.","zh":"医生讲解了剖宫产的风险和恢复时间。"}]},{"partOfSpeech":"n.","definition":{"en":"(N.) A cesarean birth; the surgical operation used to deliver a baby.","zh":"（名词）剖宫产；剖腹产手术。"},"examples":[{"en":"After an emergency cesarean, both mother and baby were healthy.","zh":"紧急剖宫产后，母婴都很健康。"},{"en":"Some people plan a cesarean, while others need one unexpectedly.","zh":"有些人会计划剖宫产，也有人是在意料之外需要剖宫产。"}]}],"synonyms":["C-section","cesarean section","caesarean section"],"phonetic":"/sɪˈzɛriən/","extraExplanation":["常见拼写是 **cesarean**（美式）或 **caesarean**（英式）。你输入的 **Caesarian** 在英语里很常见但通常被视为拼写错误。","词源常被大众与“凯撒（Caesar）”联系在一起，但历史上更可能来自拉丁语 *caesus*（“切开”）。无论词源传说如何，现代用法主要用于医学与日常分娩语境。","搭配很常见：**cesarean section (C-section)**（剖宫产手术/剖腹产），口语里也常说 **C-section**。"]}
{"word":"caesarian","summary":{"en":"“Caesarean” (also “cesarean”) means a C-section: surgical childbirth through the abdomen and uterus; it can be an adjective or a noun for the operation.","zh":"“Caesarean/cesarean”指“剖宫产（C-section）”：通过手术切开腹部和子宫来分娩；既可作形容词，也可作名词表示该手术。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Usually in “Caesarean section”) relating to or involving a surgical operation used to deliver a baby through cuts in the mother’s abdomen and uterus (a C-section).","zh":"（常用于“Caesarean section/剖宫产”）指通过手术切开孕妇腹部和子宫来分娩的；与剖宫产有关的。"},"examples":[{"en":"Because of medical complications, the doctor recommended a Caesarean delivery.","zh":"由于出现医疗并发症，医生建议进行剖宫产分娩。"},{"en":"She had a Caesarean section, so she needed extra recovery time.","zh":"她做了剖宫产手术，所以需要更多时间恢复。"}]},{"partOfSpeech":"n.","definition":{"en":"A Caesarean section; the operation used to deliver a baby by surgery (also called a C-section).","zh":"剖宫产手术；通过手术方式分娩（也称C-section）。"},"examples":[{"en":"She had an emergency Caesarean after a long labor.","zh":"经历了长时间阵痛后，她接受了紧急剖宫产。"},{"en":"Some people schedule a Caesarean, while others only have one if it becomes necessary.","zh":"有些人会预约剖宫产，而另一些人只有在必要时才会做。"}]}],"synonyms":["C-section","cesarean section","Caesarean section"],"phonetic":"/sɪˈzɛriən/","extraExplanation":["“caesarian”常见但不太标准的拼写；更常见、也更规范的拼写是 **Caesarean**（英式常见）或 **Cesarean**（美式常见）。在美国医疗语境里，你会更常看到 **cesarean** 与 **C-section**。","词源上常被民间传说与尤利乌斯·凯撒（Julius Caesar）的出生联系在一起，但历史学界普遍认为这种联系不可靠；更可能与拉丁语中“切开”的含义相关。"]}
{"word":"Caesarians","summary":{"en":"“Caesarians” most often means supporters of Julius Caesar (or the Caesars), and can also mean “relating to Caesar.”","zh":"“Caesarians” 通常指凯撒（或历代“凯撒”）的支持者，也可作形容词表示“与凯撒有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who supported Julius Caesar (or later, the Caesars); Caesarian partisans.","zh":"（古罗马）凯撒的支持者；拥护凯撒派的人。"},"examples":[{"en":"After the civil war began, the Caesarians and the Pompeians fought for control of Rome.","zh":"内战爆发后，凯撒派与庞培派为争夺罗马的控制权而战。"},{"en":"Many Caesarians argued that Caesar’s reforms were necessary for stability.","zh":"许多凯撒派认为凯撒的改革对稳定局势是必要的。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to Julius Caesar or to the Roman emperors called Caesar.","zh":"与尤利乌斯·凯撒或被称为“凯撒”的罗马皇帝有关的；凯撒的。"},"examples":[{"en":"The museum displayed coins with Caesarian portraits.","zh":"博物馆展出了带有凯撒肖像的硬币。"}]}],"synonyms":["Caesarists","Caesarian supporters","pro-Caesar faction"],"phonetic":"/səˈzɛriənz/","extraExplanation":["注意拼写：Caesarian 常与 cesarean/caesarean（“剖腹产的”）混淆。前者多指“与凯撒有关/凯撒的支持者”，后者才是医学上的“剖腹产”。在现代日常英语里，提到手术通常写作 cesarean section（美式常见）或 caesarean section（英式常见）。","历史语境：在罗马共和国末期内战中，常把阵营分为 Caesarians（凯撒派）与 Pompeians（庞培派）。"]}
{"word":"Caesarism","summary":{"en":"Caesarism means strongman rule: power concentrated in a single leader who claims popular legitimacy and weakens democratic checks.","zh":"Caesarism 指强人统治：权力集中于单一领袖，常以民意正当性为名削弱民主制衡。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A political system or style of rule in which a strong leader holds (or seeks) near-absolute power, often claiming to represent “the people” while weakening democratic checks and institutions.","zh":"一种政治体制或统治风格：强人领袖掌握（或寻求）近乎绝对的权力，常以“代表人民”为名削弱民主制衡与制度。"},"examples":[{"en":"Some historians describe the late Roman Republic’s collapse as a drift toward Caesarism.","zh":"一些历史学家把罗马共和国末期的崩溃描述为逐渐滑向“恺撒主义”。"},{"en":"Critics warned that concentrating power in one office could encourage Caesarism.","zh":"批评者警告说，把权力集中到一个职位上可能会助长恺撒主义。"}]},{"partOfSpeech":"n.","definition":{"en":"A government dominated by a charismatic ruler who relies on personal authority, mass popularity, and forceful executive power rather than strong political parties or an independent judiciary.","zh":"由具有个人魅力的统治者主导的政体：依靠个人权威、群众拥戴与强势行政权力，而非健全的政党政治或独立司法。"},"examples":[{"en":"The election created a leader with huge public support, and opponents feared a turn to Caesarism.","zh":"这场选举造就了一位拥有巨大民意支持的领袖，反对者担心国家会转向恺撒主义。"},{"en":"In a Caesarism-style regime, loyalty to the leader can matter more than the constitution.","zh":"在类似恺撒主义的政权中，对领袖的忠诚可能比宪法更重要。"}]}],"synonyms":["authoritarianism","strongman rule","autocracy","personalist rule"],"phonetic":"/ˈsiːzəˌrɪzəm/","extraExplanation":["“Caesarism”源自罗马政治家尤利乌斯·恺撒（Julius Caesar）。在英语语境里，它不是单纯指“像恺撒一样”，而是带有政治学/历史学的评价色彩：强调强人集权、对制度制衡的削弱。","常见搭配：drift toward Caesarism（逐渐滑向恺撒主义）、danger of Caesarism（恺撒主义的风险）、Caesarism-style rule（恺撒主义式统治）。","词义上与“dictatorship（独裁）”有重叠，但“Caesarism”更突出“个人魅力 + 民粹式正当性 + 强势行政”的组合，以及在共和国/民主制度背景中权力被集中化的过程。"]}
{"word":"caesarism","summary":{"en":"Caesarism is rule by a single strong leader with near-total power, often justified as representing the people.","zh":"Caesarism（恺撒主义）指以“代表人民/维持秩序”为名的强人集权统治倾向或体制。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A political system or attitude in which a single strong leader holds (or seeks) almost total power, often justified by claiming to represent the people; rule like Julius Caesar’s in spirit.","zh":"“恺撒主义”：一种政治体制或政治倾向，指单一强人领袖掌握（或追求）近乎绝对的权力，常以“代表人民/维护秩序”为理由来正当化，带有类似恺撒式统治的色彩。"},"examples":[{"en":"Some critics warned that the emergency laws could slide into caesarism.","zh":"一些批评者警告说，紧急法可能会滑向恺撒主义。"},{"en":"He built a cult of personality that many historians describe as a form of caesarism.","zh":"他打造了个人崇拜，许多历史学家把这称为一种恺撒主义。"}]}],"synonyms":["strongman rule","autocracy","dictatorship","authoritarianism"],"phonetic":"/ˈsiːzəˌrɪzəm/","extraExplanation":["词源来自 Julius Caesar（尤利乌斯·恺撒）+ -ism（……主义）。它通常带有批评意味，强调“以民意之名集中权力”的强人政治。","在政治思想史中，19世纪法国讨论拿破仑三世时常用到 caesarism；也常与“个人魅力式领导（charismatic leadership）”“威权主义（authoritarianism）”等概念并提。","相关派生：Caesarist（adj./n. 恺撒主义的；恺撒主义者）。注意不要与 Caesar salad（凯撒沙拉）混淆。"]}
{"word":"Caesarist","summary":{"en":"Caesarist describes (or refers to) support for a strong, centralized, often authoritarian system led by one powerful leader.","zh":"Caesarist 指（或指称）支持由单一强势领袖主导的强中央集权、往往偏威权的统治模式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) Related to Caesarism; favoring or resembling strong, centralized, often authoritarian rule led by a single powerful leader (often justified as bringing order).","zh":"（形容词）与“恺撒主义”有关；支持或类似于由单一强势领袖主导的强中央集权、往往带有威权色彩的统治（常以“维持秩序”为理由）。"},"examples":[{"en":"Some critics called the new constitution Caesarist because it concentrated power in the president’s hands.","zh":"一些批评者称这部新宪法带有“恺撒主义”色彩，因为它把权力集中到总统手中。"},{"en":"He warned that a Caesarist style of politics can weaken courts and parliaments.","zh":"他警告说，“恺撒主义”式的政治风格会削弱法院和议会。"}]},{"partOfSpeech":"n.","definition":{"en":"(n.) A person who supports Caesarism or a strong-leader, authoritarian style of government.","zh":"（名词）支持恺撒主义或“强人统治/威权式强领导”政府模式的人。"},"examples":[{"en":"Opponents described him as a Caesarist who wanted to rule by decree.","zh":"反对者形容他是个恺撒主义者，想通过法令来统治。"}]}],"synonyms":["authoritarian","strongman","autocratic","dictatorial","Bonapartist"],"phonetic":"/ˈsiːzərɪst/","extraExplanation":["“Caesarist”来自“Caesar（恺撒）”，最初指古罗马尤利乌斯·恺撒式的个人权威与军政合一。后来常用来形容拿破仑三世等以“全民公投/民意授权”为名、但实际强化个人权力与行政控制的政治模式。","语气提示：在新闻评论与政治学语境里，这个词通常带批评意味，暗示对民主制衡（议会、司法、媒体）的侵蚀。"]}
{"word":"caesarist","summary":{"en":"Caesarist describes or supports authoritarian rule by a single strong leader; it can also mean a person who supports such rule.","zh":"caesarist 指“凯撒式/强人威权集权”的（形容词），也可指支持这种统治的人（名词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"favoring or relating to a strong, centralized leader who holds power in an authoritarian way (like Julius Caesar); supporting “Caesarism.”","zh":"凯撒式的；主张或赞同强人集权、威权统治的（类似凯撒的统治方式）。"},"examples":[{"en":"Some critics called the new constitution caesarist because it concentrated power in one leader.","zh":"一些批评者称这部新宪法为“凯撒式的”，因为它把权力集中到一个领袖手中。"},{"en":"He warned that caesarist politics can weaken democratic institutions.","zh":"他警告说，“凯撒式”政治可能会削弱民主制度。"}]},{"partOfSpeech":"n.","definition":{"en":"a supporter of an authoritarian strong leader or a political system led by such a leader.","zh":"凯撒主义者；支持强人威权统治或类似政治体制的人。"},"examples":[{"en":"The party attracted caesarists who wanted quick decisions from a single ruler.","zh":"该党吸引了一些凯撒主义者，他们希望由一位统治者迅速做决定。"},{"en":"Historians debate whether he was a reformer or a caesarist.","zh":"历史学家争论他究竟是改革者还是凯撒主义者。"}]}],"synonyms":["authoritarian","autocratic","dictatorial","strongman","Caesarism"],"phonetic":"/ˈsiːzərɪst/","extraExplanation":["“Caesarist”来自 Julius Caesar（尤利乌斯·凯撒）的名字。它常用于政治评论，带有批评意味：强调个人魅力与强势领导、削弱制衡与议会/司法等制度。","相关名词是 “Caesarism”（凯撒主义），指以强人领袖为中心的政治倾向或体制。与之相对的常见概念有 “constitutionalism”（宪政主义）与 “democracy”（民主）。"]}
{"word":"caesarists","summary":{"en":"Caesarists are supporters of Julius Caesar or, more generally, supporters of strong one-leader rule (“Caesarism”).","zh":"Caesarists 指凯撒的支持者；也可泛指支持强人领袖集中统治（“凯撒主义”）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Supporters or followers of Julius Caesar, especially in the political struggles of ancient Rome.","zh":"（古罗马）凯撒的支持者/追随者，尤指在政治斗争时期支持尤利乌斯·凯撒的一派。"},"examples":[{"en":"During the civil war, the Caesarists fought against Pompey’s supporters.","zh":"在内战期间，凯撒派与庞培的支持者交战。"},{"en":"Some senators feared the Caesarists would end the Republic.","zh":"一些元老担心凯撒派会终结共和制度。"}]},{"partOfSpeech":"n.","definition":{"en":"People who support “Caesarism,” meaning strong, centralized rule by a single leader (often with authoritarian overtones).","zh":"支持“凯撒主义”的人，即支持由单一强势领袖集中掌权的政治理念（常带有威权色彩）。"},"examples":[{"en":"Critics warned that the movement could attract Caesarists who prefer one-man rule.","zh":"批评者警告，这场运动可能吸引偏好“一人统治”的凯撒主义支持者。"},{"en":"In the debate, he accused his opponent of being a Caesarist.","zh":"在辩论中，他指责对手是凯撒主义者。"}]}],"synonyms":["Caesarians","followers of Caesar","supporters","authoritarians (context-dependent)"],"phonetic":"/ˈsiːzərɪsts/","extraExplanation":["“Caesarists”来自“Caesarist”（凯撒派/凯撒主义者）。历史上常用来指支持尤利乌斯·凯撒的一派；后来“Caesarism/凯撒主义”被用来概括一种政治倾向：以强人领袖为中心、权力高度集中。","在英语里，这个词较偏历史与政治语境，日常对话不常用；写作时可用更常见的表达，如“supporters of Caesar”或“authoritarian supporters”（视语境而定）。"]}
{"word":"Caesarize","summary":{"en":"Caesarize means to make something Caesar-like—especially to push a system toward strongman, authoritarian rule.","zh":"Caesarize 指“凯撒化”：使（或变得）更像凯撒式强人政治，走向集权与专断。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone or something more like Julius Caesar in style—especially to turn a government or leader into a strong, centralized, authoritarian (Caesar-like) form","zh":"使（某人/某事）呈现“凯撒式”风格；尤指使政权或领导者走向强人政治、中央集权、专断的“凯撒化”"},"examples":[{"en":"Some critics argued that the reforms would Caesarize the presidency by concentrating too much power in one office.","zh":"一些批评者认为这些改革会让总统职位“凯撒化”，把过多权力集中到一个职位上。"},{"en":"The general was accused of trying to Caesarize the republic after the coup.","zh":"政变后，这位将军被指责试图让共和国“凯撒化”。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become Caesar-like; to move toward authoritarian, strongman rule","zh":"变得“凯撒式”；走向强人统治、专断化"},"examples":[{"en":"In times of crisis, democratic systems can Caesarize if checks and balances weaken.","zh":"在危机时期，如果制衡机制削弱，民主制度可能会“凯撒化”。"}]}],"synonyms":["centralize","autocratize","dictatorialize","concentrate power"],"phonetic":"/ˈsiːzəˌraɪz/","extraExplanation":["“Caesarize”由“Caesar（凯撒）+ -ize（使……化）”构成，常用于政治评论语境，强调从共和/民主走向个人集权的趋势。","它常与“Caesarism（凯撒主义/强人政治）”相关；讨论罗马从共和国向帝制过渡时，凯撒常被当作“个人权力压过制度”的象征。"]}
{"word":"caesarize","summary":{"en":"Caesarize means to make something—or become—more like Caesar: centralized, strongman, authoritarian rule.","zh":"Caesarize 指使某事（或某人）“凯撒化”，即走向集权、强人式、威权/专制统治。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To make (a person, government, or society) more like Caesar—i.e., to move toward strong, centralized, authoritarian rule.","zh":"使（个人/政府/社会）“凯撒化”：趋向于强人政治、集权或专制统治。"},"examples":[{"en":"Some critics warned that the new constitution would caesarize the presidency.","zh":"一些批评者警告说，新宪法会让总统职位“凯撒化”，权力过度集中。"},{"en":"After the crisis, emergency powers began to caesarize the political system.","zh":"危机之后，紧急权力开始让政治体系走向“凯撒化”。"}]},{"partOfSpeech":"vi.","definition":{"en":"To become Caesar-like; to take on authoritarian power or behavior.","zh":"变得像凯撒一样（掌握或表现出强人式、专制式的权力/作风）。"},"examples":[{"en":"Leaders can caesarize when institutions are weak.","zh":"当制度薄弱时，领导人可能会逐渐“凯撒化”。"},{"en":"The party caesarized over time, concentrating decisions in one office.","zh":"这个政党随着时间推移走向“凯撒化”，决策集中到一个办公室。"}]}],"synonyms":["centralize","authoritarianize","autocratize","dictatorialize","militarize (in some contexts)"],"phonetic":"/ˈsiːzəraɪz/","extraExplanation":["“caesarize”来自 Julius Caesar（尤利乌斯·凯撒）的名字，在政治语境中常与“Caesarism（凯撒主义）”相关，强调以个人权威凌驾制度、以集权与强势手段统治。","这是较少见、偏书面/评论性的词，常出现在政治分析、历史写作或批评性文章中。日常英语里更常用的表达包括：centralize power（集中权力）、become authoritarian（走向威权）、turn into a strongman rule（转为强人统治）。"]}
{"word":"caesaropapacy","summary":{"en":"Caesaropapacy means a political ruler strongly controls the church.","zh":"Caesaropapacy 指世俗统治者强力控制教会的政教体制。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a system in which a political ruler (such as an emperor or king) has strong control over the church, especially over its leaders and policies","zh":"一种政教关系：世俗统治者（如皇帝或国王）对教会拥有强大控制权，尤其能左右教会领袖与政策"},"examples":[{"en":"Some historians describe the Byzantine Empire as a form of caesaropapacy, where the emperor heavily influenced church affairs.","zh":"一些历史学者把拜占庭帝国描述为一种“凯撒教皇制”，皇帝深度介入教会事务。"},{"en":"The debate was about whether the state should be able to appoint bishops—an issue often linked to caesaropapacy.","zh":"争论焦点是国家是否能任命主教——这常被认为与“凯撒教皇制”有关。"}]}],"synonyms":["Erastianism","state control of the church","state church system"],"phonetic":"/ˌsiːzəroʊˈpeɪpəsi/","extraExplanation":["“caesaropapacy”由 Caesar（凯撒，象征皇权/皇帝）+ papacy（教皇制度/教权）构成，用来强调“君主像教皇一样掌控宗教”的现象。","该词多用于历史与政治学讨论，常见语境包括拜占庭帝国或某些“国家主导教会”的制度；它通常带有批评色彩，暗示宗教缺乏独立性。","相关概念可对比：Erastianism（国家高于教会的主张，常译“埃拉斯特主义”）与 theocracy（神权政治，宗教领袖直接统治国家，方向相反）。"]}
{"word":"caesaropapism","summary":{"en":"Caesaropapism is the idea that a political ruler controls the church or religious authority.","zh":"Caesaropapism 指“世俗统治者控制宗教/教会权威”的政教关系模式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A system in which the secular ruler (like an emperor or king) has strong control over the church or religious authorities, often influencing religious leadership and doctrine.","zh":"一种政教关系模式：世俗统治者（如皇帝或国王）对教会或宗教权威拥有很强的控制力，常会影响宗教领导任命与教义走向。"},"examples":[{"en":"Some historians describe parts of the Byzantine Empire as an example of caesaropapism.","zh":"一些历史学家把拜占庭帝国的某些时期视为“皇权教权合一/君主控教”的例子。"},{"en":"Critics feared caesaropapism because it could make religious leaders dependent on political power.","zh":"批评者担心“皇权教权合一”，因为它可能让宗教领袖依赖政治权力。"}]}],"synonyms":["state control of the church","church-state fusion","religious establishment under the state"],"phonetic":"/ˌsiːzəroʊˈpeɪpɪzəm/","extraExplanation":["词源可拆成 Caesar（凯撒，象征皇帝/世俗权力）+ -papism（与 pope/教皇相关，象征教会权力），用来表达“皇权与教权之间由皇帝主导”的关系。","这个词多用于历史与宗教学讨论，常与“神权政治（theocracy，宗教掌权）”作对比：caesaropapism 更强调国家/君主对宗教的支配，而不是宗教对国家的支配。","在英文写作里它通常带有批判或警惕色彩，暗示宗教机构被政治化。"]}
{"word":"caesaropapist","summary":{"en":"Caesaropapist describes a system where a political ruler controls or dominates religious authority.","zh":"Caesaropapist 指政治统治者控制或支配宗教权威的政教关系模式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"A person or system in which the political ruler also controls the church or religious authority (or strongly dominates it).","zh":"指政治统治者同时掌控教会/宗教权威，或以国家权力强力支配宗教的个人或体制。"},"examples":[{"en":"Some historians describe the Byzantine emperor as a caesaropapist figure because he had major influence over church leadership.","zh":"一些历史学家把拜占庭皇帝称为“caesaropapist”式人物，因为他对教会领袖的任命和事务有很大影响。"},{"en":"Critics warned that the reform could create a caesaropapist system where the state controls religion.","zh":"批评者警告说，这项改革可能会形成一种“政教合一、以国控教”的体制。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to or showing caesaropapism (the union of political and religious power in one ruler or state).","zh":"与“caesaropapism（君主兼掌政权与教权/国家支配宗教）”相关的；体现这种倾向的。"},"examples":[{"en":"The writer argues that a caesaropapist model weakens the independence of religious institutions.","zh":"作者认为，“国家支配宗教”的模式会削弱宗教机构的独立性。"},{"en":"They debated whether the empire’s caesaropapist tradition was stable or harmful in the long run.","zh":"他们讨论该帝国“政教一体”的传统从长期看究竟是稳定因素还是隐患。"}]}],"synonyms":["theocratic (related but not the same)","state-controlled religion","church-state fusion"],"phonetic":"/ˌsiːzəroʊˈpeɪpɪst/","extraExplanation":["“caesaropapist”来自“Caesar（凯撒，象征世俗皇权）+ pope（教皇，象征宗教权威）”。常用于历史与政治学讨论，尤其与“拜占庭帝国皇帝对教会事务的影响”相关。","注意：它通常是评价性用语，带有批判或警惕“国家干预宗教”的意味；在写作中可用更中性的表达，如“state control of the church（国家控制教会）”。"]}
{"word":"caesaropopism","summary":{"en":"Caesaropapism is the idea that a political ruler also controls religious authority, effectively uniting state and church power.","zh":"Caesaropapism 指世俗统治者同时掌控宗教权威，使国家权力与教会权力合并的一种政教关系模式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A political-religious system in which the secular ruler (such as an emperor or king) also controls the church or religious authority, combining political power with religious leadership.","zh":"一种“政教合一/君权支配教权”的体制：世俗统治者（如皇帝、国王）也掌控教会或宗教权威，把政治权力与宗教领导权集中在一起。"},"examples":[{"en":"Some historians describe the Byzantine Empire as showing elements of caesaropapism, because the emperor strongly influenced church affairs.","zh":"一些历史学者认为拜占庭帝国带有“caesaropapism”的特征，因为皇帝对教会事务有很强的影响。"},{"en":"The debate focused on whether the ruler’s religious authority amounted to caesaropapism or was simply political oversight.","zh":"争论的焦点在于：统治者的宗教权威究竟算不算“caesaropapism”，还是仅仅属于政治层面的监督。"}]}],"synonyms":["state control of the church","church-state fusion","Erastianism (related)"],"phonetic":"/ˌsiːzəroʊˈpeɪpɪzəm/","extraExplanation":["词源上由 Caesar（凯撒，象征世俗皇权）+ pope（教皇，象征宗教权威）组合而成，用来描述“皇帝像教皇一样掌控宗教”的格局。","该词多见于历史与政治神学语境，常用于讨论拜占庭、俄罗斯帝国等地政权与教会关系；在学术写作中有时带评价色彩，暗示宗教机构缺乏独立性。","常见相关词：theocracy（神权政治：由宗教领袖统治国家）、Erastianism（国家对教会拥有最终权威的主张，概念相近但不完全等同）。"]}
{"word":"Caesarotomy","summary":{"en":"Caesarotomy is a medical term for making an incision in the uterus to deliver a baby (a C-section), and it can also refer to the uterine incision itself.","zh":"Caesarotomy 是医学用语，指为分娩而切开子宫取出胎儿的手术（剖宫产），也可指剖宫产时的子宫切口本身。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surgical incision into the uterus to deliver a baby; essentially a cesarean delivery (C-section).","zh":"（为分娩而）切开子宫取出胎儿的手术切口；基本上就是“剖宫产”（C-section）。"},"examples":[{"en":"Because of fetal distress, the doctor decided to perform a caesarotomy immediately.","zh":"由于胎儿出现窘迫，医生决定立即进行剖宫产（caesarotomy）。"},{"en":"The patient was counseled about the risks and recovery after caesarotomy.","zh":"医生向患者说明了剖宫产后的风险与恢复情况。"}]},{"partOfSpeech":"n.","definition":{"en":"the uterine incision itself made during a cesarean procedure (medical usage).","zh":"（医学用语）剖宫产中所做的“子宫切口”本身。"},"examples":[{"en":"A low transverse caesarotomy is commonly used to reduce complications.","zh":"常用低位横切的子宫切口（caesarotomy）以减少并发症。"}]}],"synonyms":["cesarean section","C-section","hysterotomy"],"phonetic":"ˌsiːzəˈrɑːtəmi","extraExplanation":["词源上与“Caesar（凯撒）”有关，但在现代医学里，它主要作为“剖宫产/子宫切开术”的专业用词出现。日常英语中更常用的说法是“cesarean section”或“C-section”。","相关词：hysterotomy（子宫切开术，偏手术动作/切口术语）、cesarean section/C-section（剖宫产，更常见）。"]}
{"word":"caesarotomy","summary":{"en":"Caesarotomy: a rare term meaning a surgical delivery of a baby by cutting into the uterus (cesarean section).","zh":"Caesarotomy：较少见的医学用词，指通过切开子宫分娩婴儿的手术（即剖宫产）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surgical procedure to deliver a baby by making an incision in the uterus; a (rare) medical term for a cesarean section.","zh":"一种通过切开子宫来分娩婴儿的手术；医学上较少使用的说法，基本等同于“剖宫产/剖腹产”。"},"examples":[{"en":"Because of complications, the doctors decided that a caesarotomy was necessary.","zh":"由于出现并发症，医生决定必须进行剖宫产手术。"},{"en":"In modern hospital English, you will usually hear “cesarean section” instead of “caesarotomy.”","zh":"在现代医院英语里，更常听到的是“cesarean section”，而不是“caesarotomy”。"}]}],"synonyms":["cesarean section","C-section"],"phonetic":"/ˌsiːzəˈrɑːtəmi/","extraExplanation":["“caesarotomy”由 Caesar（凯撒）+ -tomy（表示“切开/切割”的词缀，如 tracheotomy 气管切开）构成，字面意思就是“凯撒式切开”。","在实际英语使用中，这个词相对少见，更常见且更标准的是 “cesarean section / C-section”。","历史上常有人把剖宫产与尤利乌斯·凯撒（Julius Caesar）联系起来，但这种说法多被认为不准确；该术语更可能源于拉丁语中与“切割”相关的词源传统。"]}
{"word":"caesars","summary":{"en":"“Caesars” usually means Roman emperors (the plural of “Caesar”), and it can also be a brand name for casinos/hotels like Caesars Palace.","zh":"“Caesars”通常指罗马诸帝（“Caesar”的复数），也可作赌场/酒店等的品牌名称，如 Caesars Palace。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Roman emperors; rulers who hold power like an emperor (plural of “Caesar”).","zh":"罗马皇帝；（泛指）像皇帝一样掌权的统治者（“Caesar”的复数）。"},"examples":[{"en":"The early Caesars expanded Rome’s borders through war and diplomacy.","zh":"早期的罗马诸帝通过战争与外交扩张了罗马的疆域。"},{"en":"In some histories, the Caesars are described as both brilliant leaders and ruthless politicians.","zh":"在一些史书中，凯撒诸帝既被描写为杰出的领导者，也被说成冷酷的政客。"}]},{"partOfSpeech":"n.","definition":{"en":"A proper name for businesses or places connected to the “Caesars” brand (e.g., casinos and hotels).","zh":"“Caesars”品牌的专有名称（如赌场、酒店等）。"},"examples":[{"en":"They stayed at Caesars Palace during their trip to Las Vegas.","zh":"他们去拉斯维加斯旅行时住在凯撒皇宫酒店（Caesars Palace）。"},{"en":"Caesars operates several casinos in the United States.","zh":"Caesars 在美国经营多家赌场。"}]}],"synonyms":["Roman emperors","emperors","rulers"],"phonetic":"/ˈsiːzərz/","extraExplanation":["“Caesar”原本是罗马政治家尤利乌斯·凯撒（Julius Caesar）的姓，后来逐渐变成“皇帝/帝王”的称号；因此“the Caesars”常用来指罗马的历代皇帝。","英语里“Caesar”常读作/ˈsiːzər/（听起来像“SEE-zer”），复数“Caesars”就是/ˈsiːzərz/。","在文化用法中，“Caesar”也出现在一些固定说法里，如“Caesar salad（凯撒沙拉）”，但那与皇帝本身没有直接历史关联。"]}
{"word":"Caesarship","summary":{"en":"Caesarship means the office, rule, or status of a Caesar—especially the Roman imperial position or authority.","zh":"Caesarship 指凯撒的职位、统治或地位，尤指罗马皇帝的帝位与权威。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the position, rule, or authority of a Caesar (especially the Roman emperor); the imperial office","zh":"凯撒（尤指罗马皇帝）的职位、统治或权力；帝位"},"examples":[{"en":"After years of civil war, he aimed for Caesarship rather than sharing power.","zh":"经历多年内战后，他追求的是凯撒之位，而不是与人共享权力。"},{"en":"Writers warned that Caesarship could turn a republic into a monarchy.","zh":"作家们警告说，凯撒式的帝位可能会把共和国变成君主制。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) the rank or title of “Caesar,” used in parts of the later Roman Empire for a junior co-emperor or designated successor","zh":"（历史）“Caesar”的等级或称号：在罗马帝国后期部分时期指较低阶的共治皇帝或指定继承人"},"examples":[{"en":"In some periods, a Caesarship could indicate a successor chosen by the Augustus.","zh":"在某些时期，凯撒称号（凯撒位阶）可能表示由奥古斯都指定的继承人。"}]}],"synonyms":["emperorship","imperial office","emperorship (rule)","sovereignty","reign"],"phonetic":"/ˈsiːzɚˌʃɪp/","extraExplanation":["“Caesar”原是罗马政治人物尤利乌斯·凯撒（Julius Caesar）的家族名，后来逐渐演变为皇帝头衔与权力象征；因此“Caesarship”通常带有“从共和走向个人专制/帝制”的历史联想。","在英文写作里，这个词较少见，更常见的表达有“emperorship”“the imperial office”或直接说“the rule/reign of Caesar/ the emperor”。"]}
{"word":"caesarship","summary":{"en":"“Caesarship” means the office, rule, or reign of a Caesar—i.e., imperial power, especially in ancient Rome.","zh":"“Caesarship”指“凯撒（皇帝）的职位／统治／在位时期”，即帝位或帝制权力，尤指古罗马。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the position, rule, or period of being a Caesar (an emperor), especially in ancient Rome; the imperial office or reign","zh":"“凯撒”（皇帝）的职位、统治或在位时期；尤指古罗马的帝位或皇帝统治"},"examples":[{"en":"After years of civil war, he secured the caesarship and reshaped Roman politics.","zh":"经历多年内战后，他夺得帝位，并重塑了罗马政治。"},{"en":"Some historians debate whether the caesarship strengthened the empire or weakened the republic.","zh":"一些历史学家争论帝制究竟是巩固了帝国，还是削弱了共和制度。"}]}],"synonyms":["emperorship","imperial rule","sovereignty","reign"],"phonetic":"/ˈsiːzɚʃɪp/","extraExplanation":["“caesarship”是较少见的词，常见于历史写作或仿古、文学化的表达中，意思接近“emperorship / imperial rule（帝位／帝制统治）”。","词形：Caesar（凯撒，后来也泛指皇帝）+ -ship（表示“身份、职位、状态或制度”，如 friendship 友谊、leadership 领导地位）。","文化背景：在罗马后期，“Caesar”逐渐成为一种皇室头衔；到了后世，“Caesar”的影响也体现在德语 Kaiser（皇帝）与俄语 Tsar/Czar（沙皇）等词上。"]}
{"word":"caesious","summary":{"en":"Caesious means “bluish-gray,” a pale blue with a gray (sometimes lavender) cast.","zh":"Caesious 指“青灰色/灰蓝色”，即带灰（有时带淡紫）的浅蓝色。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"bluish-gray; a pale blue color with a gray or lavender tone (often used to describe eyes, skies, or natural surfaces).","zh":"青灰色的；带灰或淡紫调的浅蓝色（常用来描写眼睛、天空或自然表面）。"},"examples":[{"en":"In the old poem, the hero is described as having caesious eyes.","zh":"在那首古诗里，英雄被描写为“青灰色的眼睛”。"},{"en":"A thin caesious haze hung over the mountains at dawn.","zh":"拂晓时，群山上笼着一层淡淡的青灰色薄雾。"}]}],"synonyms":["bluish-gray","gray-blue","blue-gray","glaucous"],"phonetic":"/ˈsiːʒəs/","extraExplanation":["词源：来自拉丁语 *caesius*，意为“青灰色、灰蓝色”，古典文学里常用来形容“眼睛的颜色”。","用法提示：这是非常少见、偏文学/古典的形容词。日常英语更常用 *bluish-gray*、*gray-blue*，在植物学/自然描写中也可能用 *glaucous*（偏“带粉霜感的蓝灰/蓝绿灰”）。"]}
{"word":"caesium","summary":{"en":"Caesium is a very reactive alkali metal (Cs), best known for its role in atomic clocks.","zh":"铯是一种反应性极强的碱金属（Cs），最著名的用途之一是原子钟。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A soft, pale gold, highly reactive alkali metal (chemical symbol Cs, atomic number 55).","zh":"铯（化学符号 Cs，原子序数 55）：一种柔软、浅金色、反应性极强的碱金属。"},"examples":[{"en":"Caesium reacts violently with water, so it must be stored carefully.","zh":"铯与水会发生剧烈反应，所以必须小心保存。"},{"en":"Scientists use caesium atoms in atomic clocks because they vibrate at a very precise frequency.","zh":"科学家用铯原子制造原子钟，因为它的振动频率非常精确。"}]}],"synonyms":["cesium"],"phonetic":"/ˈsiːziəm/","extraExplanation":["“caesium”是英式拼写；美式常见拼写是“cesium”。发音基本相同。","铯在日常生活中不常见，但在科学与工程中很重要：例如铯-133用于定义秒（与原子钟相关）。"]}
{"word":"caesiums","summary":{"en":"“Caesiums” is the plural form of caesium (Cs), a highly reactive metal element.","zh":"“Caesiums”是 caesium（Cs，铯）的复数，指这种反应性很强的金属元素。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of caesium: a soft, silvery-white chemical element (symbol Cs) that is extremely reactive, especially with water.","zh":"caesium 的复数：一种柔软、银白色的化学元素（符号 Cs），反应性极强，尤其遇水会剧烈反应。"},"examples":[{"en":"Different isotopes of caesiums are used in scientific research.","zh":"不同的 caesium 同位素用于科学研究。"},{"en":"Caesiums react violently with water, so they must be stored carefully.","zh":"caesium 遇水会剧烈反应，所以必须小心保存。"}]}],"synonyms":["cesiums","cesium","caesium"],"phonetic":"/ˈsiːziəmz/","extraExplanation":["“Caesium”是英式拼写；美式英语更常写作“cesium”。两者指同一种元素。","在日常英语中更常见的是单数“caesium/cesium”，复数“caesiums”多出现在科学语境（如讨论同位素或不同样品）。"]}
{"word":"caespitose","summary":{"en":"Caespitose means “growing in dense tufts or clumps,” especially used to describe plants.","zh":"caespitose 指“丛生/簇生的”，多用于描述植物呈一丛丛紧密生长。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany/Ecology) Growing in dense tufts or clumps, with many stems arising close together from the base.","zh":"（植物学/生态学）丛生的；簇生的（许多茎从基部紧密长在一起，形成一丛或一簇）。"},"examples":[{"en":"The grass is caespitose, forming tight clumps across the dry hillside.","zh":"这种草是丛生的，在干燥的山坡上形成一团团紧密的草丛。"},{"en":"Many caespitose sedges survive well in windy, open habitats.","zh":"许多丛生的莎草在多风、开阔的生境中也能很好地存活。"}]}],"synonyms":["clump-forming","tufted","bunching","clustered"],"phonetic":"/ˈsɛspɪˌtoʊs/","extraExplanation":["词源来自拉丁语 caespes / caespitis，意为“草皮、草丛、土块”。因此 caespitose 常用来描述植物呈“草丛状/垫状”聚集生长的外观。","这是偏专业的自然科学用词，常见于植物志、生态调查和园艺描述中；日常英语里更常用 clump-forming（成丛的）、tufted（簇生的）来表达。"]}
{"word":"caespitosely","summary":{"en":"Caespitosely means “in a tufted or clumped growth form,” mainly in botanical writing.","zh":"caespitosely 指“以丛生/簇生成团的形态（方式）生长”，主要用于植物学写作。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a tufted, clumped, or cushion-forming way (used mainly in botany to describe how a plant grows).","zh":"以丛生、簇生或垫状成团的方式（主要用于植物学，描述植物的生长形态）。"},"examples":[{"en":"The sedge grows caespitosely along the edge of the wetland, forming tight tufts.","zh":"这种莎草在湿地边缘丛生，形成紧密的草丛。"},{"en":"In this habitat, the grass spreads caespitosely rather than by long runners.","zh":"在这种生境中，这种草以丛生方式扩展，而不是靠很长的匍匐茎。"}]}],"synonyms":["tuftedly","in tufts","in clumps","clusteredly"],"phonetic":"/siːˈspɪtəsli/","extraExplanation":["“caespitosely”来自形容词“caespitose（丛生的）”，常见于植物志、野外鉴定手册和学术描述中；日常英语几乎不用。","相关形态对比：caespitose/caespitosely 强调“成簇成团”；与“creeping（匍匐蔓延）”“stoloniferous（有匍匐茎的）”“rhizomatous（有根茎的）”等描述扩张方式的词常放在一起对比。"]}
{"word":"caestus","summary":{"en":"A *caestus* is an ancient Roman boxing glove/hand-wrap, often reinforced and sometimes metal-studded, used as a fighting weapon.","zh":"*caestus* 指古罗马的拳击手套/缠手带，常加固甚至带金属，用于格斗，具有武器性质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ancient Rome) a boxing glove or hand-wrap, often reinforced with leather straps and sometimes metal, used in fighting (a dangerous, weapon-like glove).","zh":"（古罗马）拳击用的皮手套/缠手带，常用皮条加固，有时还嵌入金属，用于格斗（带武器性质的拳套）。"},"examples":[{"en":"In the arena, fighters sometimes wore a caestus to make blows more damaging.","zh":"在竞技场里，斗士有时会戴上caestus，让拳击更具杀伤力。"},{"en":"The museum displayed a bronze-studded caestus from the Roman period.","zh":"博物馆展出了一只罗马时期带青铜铆钉的caestus。"},{"en":"The story describes a hero who refuses the caestus and chooses a fairer contest.","zh":"故事里写到一位英雄拒绝使用caestus，选择更公平的比试。"}]}],"synonyms":["cestus","boxing glove (ancient)","gauntlet (combat, general)"],"phonetic":"/ˈsiːstəs/","extraExplanation":["词源：来自拉丁语 *caestus*（也常写作 *cestus*），与“用皮带缠绕、束紧”的含义相关，所以最初指缠在手上的皮带，后来特指用于搏斗的拳套。","文化背景：在古罗马的体育或角斗传统中，*caestus* 往往比现代拳击手套更危险；有的会加硬皮条甚至金属片，常被用来强调比赛的残酷性。","文学提及：在一些古典史诗或古罗马题材作品中，*caestus* 常作为“野蛮力量/血腥竞技”的象征出现，用来对比“公平比赛”或“文明规则”。"]}
{"word":"caestuses","summary":{"en":"“Caestuses” are ancient Roman boxing straps/gloves, sometimes weighted with metal.","zh":"“Caestuses”指古罗马的拳套/拳带，有时会加金属增重。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a leather boxing glove or strap used in ancient Rome (often weighted with metal), especially in gladiatorial or athletic fights; plural form of “caestus.”","zh":"（古罗马的）拳套/拳带（通常为皮制，有时嵌金属增重，用于角斗或竞技搏斗）；“caestus”的复数形式。"},"examples":[{"en":"In the museum, you can see caestuses that were used in Roman combat sports.","zh":"在博物馆里，你可以看到用于古罗马格斗运动的拳套。"},{"en":"The fighter wrapped his hands with caestuses before stepping into the arena.","zh":"那名斗士走进竞技场前，用拳带把双手缠好。"}]}],"synonyms":["Roman boxing gloves","boxing straps","leather gauntlets"],"phonetic":"/ˈsiːstəsɪz/","extraExplanation":["“caestus”一词来自拉丁语，指用皮条缠绕手臂和拳头的“拳带”，后来有的会加上金属块或钉子，使打击更具伤害性。它常出现在描写古典史诗或罗马竞技的语境中。","文学语境中常见于维吉尔《埃涅阿斯纪》（Aeneid）等作品里的拳击/比武描写：人物会戴上或缠上caestus进行对决。"]}
{"word":"caesura","summary":{"en":"Caesura means a meaningful pause within a line of poetry (and also a brief pause in music).","zh":"Caesura 指诗行内部有意义的停顿（也可指音乐中的短暂停顿）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A pause or break within a line of poetry, often marked by punctuation or a natural rhythm in the sentence.","zh":"（诗歌中）诗行内部的停顿或断点，常由标点或语句的自然节奏形成。"},"examples":[{"en":"In the line “To be, or not to be: that is the question,” the colon creates a clear caesura.","zh":"在“To be, or not to be: that is the question”这一行中，冒号形成了明显的行内停顿（caesura）。"},{"en":"The poet uses a caesura to slow the rhythm and add emphasis.","zh":"诗人用行内停顿来放慢节奏并加强语气。"}]},{"partOfSpeech":"n.","definition":{"en":"In music, a brief pause or break (often shown by a special symbol), sometimes called a “railroad track.”","zh":"（音乐中）短暂的停顿或中断（常用特殊符号标出），有时俗称“铁轨符号”。"},"examples":[{"en":"The conductor held a caesura before the final chord to build tension.","zh":"指挥在最后一个和弦前做了一个停顿，以增强紧张感。"}]}],"synonyms":["pause","break","rest","interruption"],"phonetic":"/sɪˈzʊrə/","extraExplanation":["“Caesura”源自拉丁语，意为“切割/切开”，所以它强调的是在一行内部“切出”一个停顿，而不是换行。","在英语诗歌学习里，常见区分：end-stopped line（行末停顿） vs. caesura（行内停顿）。行内停顿常用逗号、分号、冒号或破折号实现，也可以靠朗读时的自然停顿。","经典用例之一是古英语史诗《贝奥武夫》（Beowulf），其中的强烈行内停顿是其节奏特点之一。"]}
{"word":"caesura-related","summary":{"en":"Caesura-related means “connected with a caesura,” a meaningful pause within a line of poetry or speech.","zh":"caesura-related 指“与断句/诗行内部停顿有关的”，用于描述诗歌或言语中有意义的停顿。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with, describing, or involving a caesura (a deliberate pause or break in a line of poetry, music, or speech).","zh":"与“停顿/断句”（caesura）有关的；描述或涉及诗行、音乐或讲话中刻意设置的停顿或断裂的。"},"examples":[{"en":"The teacher asked us to mark caesura-related pauses in the poem before reading it aloud.","zh":"老师让我们在朗读前标出诗中与断句有关的停顿。"},{"en":"Her caesura-related timing made the monologue feel tense and dramatic.","zh":"她与停顿相关的节奏处理让独白显得紧张而有戏剧性。"}]}],"synonyms":["caesural","pause-related","break-related"],"phonetic":"/sɪˈzʊrə rɪˈleɪtɪd/","extraExplanation":["“Caesura”常见于诗歌分析：指诗行内部（不一定在行尾）的停顿，可能由标点、语义转折或节奏需要造成。它能制造强调、悬念、对比，或让朗读更自然。","在英语诗歌里，caesura 有时被分为“男性停顿”（强停顿，常在重读后）与“女性停顿”（较轻或在非重读处），但学习时先掌握“诗行中段的有意停顿”这个核心概念即可。","写作或朗读提示：遇到破折号（—）、分号（;）、逗号（,）或明显的语义断裂处，往往就是可讨论的 caesura；所谓“caesura-related”就是在谈这些停顿如何影响语气与节奏。"]}
{"word":"caesurae","summary":{"en":"“Caesurae” are intentional pauses within lines of poetry (and sometimes music), used to shape rhythm and meaning; it is the plural of “caesura.”","zh":"“Caesurae” 指诗行内部（有时也指音乐中的）有意停顿，用来塑造节奏与意义；它是 “caesura” 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of caesura: intentional pauses or breaks in a line of poetry (often near the middle), used to control rhythm, emphasis, or emotion.","zh":"caesura 的复数：诗行中有意设置的停顿或断裂（常在中间附近），用来控制节奏、突出重点或传达情感。"},"examples":[{"en":"In many epic poems, caesurae create a steady beat and give the listener time to absorb the meaning.","zh":"在许多史诗中，caesurae 能形成稳定的节拍，并让听者有时间消化意义。"},{"en":"The poet uses caesurae to make the line feel hesitant—like someone thinking before speaking.","zh":"诗人用 caesurae 让诗句显得犹豫，就像人在开口前先想一想。"}]},{"partOfSpeech":"n.","definition":{"en":"In music or performance: brief pauses or breaks that shape phrasing and expression.","zh":"在音乐或表演中：用于塑造乐句与表现力的短暂停顿或间隔。"},"examples":[{"en":"The singer adds caesurae between phrases to heighten the drama.","zh":"歌手在乐句之间加入 caesurae 来增强戏剧张力。"},{"en":"Watch the conductor’s hands: the caesurae are small, but they change the mood.","zh":"注意指挥的手势：这些 caesurae 很短，却能改变情绪氛围。"}]}],"synonyms":["pauses","breaks","rests","halts"],"phonetic":"/sɪˈzʊri/","extraExplanation":["“caesura”来自拉丁语，意为“切开/切割”，所以它强调的是诗行内部被“切开”的停顿。英语里常用来讨论诗歌格律与朗诵节奏。","在英语诗歌学习中，caesurae 常与标点（逗号、破折号）相关，但不完全等同：即使没有标点，朗诵时也可能出现语义或节奏上的停顿。","文学中常用的例子是《贝奥武夫》（Beowulf）的古英语诗行，常在两半行之间有明显的中间停顿（medial caesura）。"]}
{"word":"caesural","summary":{"en":"Caesural means “having to do with a caesura,” a meaningful pause or break in a poetic line or rhythmic speech.","zh":"Caesural 意为“与诗行中顿有关的”，指诗句或有节奏语言中具有结构意义的停顿或断裂。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a caesura: a deliberate pause or break in a line of poetry or in rhythmic speech.","zh":"与“诗行中顿”（caesura）有关的；指诗句或有节奏的语言中刻意设置的停顿或断裂。"},"examples":[{"en":"The actor used a caesural pause to make the final line feel heavier.","zh":"演员用了一个“顿挫式”的停顿，让最后一句更有分量。"},{"en":"In many epic poems, a caesural break often comes near the middle of the line.","zh":"在许多史诗中，诗行中部常常出现“顿”。"},{"en":"The poet’s caesural rhythm creates a sense of hesitation and tension.","zh":"诗人的顿挫节奏营造出犹豫与紧张感。"}]}],"synonyms":["caesura-related","rhythmic","metrical (in context)"],"phonetic":"/sɪˈzjʊrəl/","extraExplanation":["“caesural”是从名词“caesura（诗行中顿）”派生出来的形容词，常见于文学批评、诗歌分析或朗诵指导中。日常口语里更常直接说“a pause / a break”。","“caesura”源自拉丁语，原义与“切开、切割”有关，所以它强调的不是随意停顿，而是结构上、节奏上起作用的“切分点”。"]}
{"word":"caesuras","summary":{"en":"“Caesuras” are pauses or breaks (especially mid-line in poetry) that affect rhythm and emphasis.","zh":"“Caesuras”指（尤指诗行中间的）停顿或断开，用来影响节奏与强调。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of caesura: a pause or break in the middle of a line of poetry (often marked by punctuation), used for rhythm, emphasis, or dramatic effect.","zh":"caesura 的复数：诗行中间的停顿或断开（常由标点体现），用来形成节奏、强调或制造戏剧效果。"},"examples":[{"en":"The poem’s caesuras slow the rhythm and make the speaker sound thoughtful.","zh":"这首诗里的多处停顿（caesuras）放慢了节奏，让说话者显得更沉思。"},{"en":"In the line “To be, or not to be,” the comma creates a clear caesura.","zh":"在“To be, or not to be”这行中，逗号造成了一个清晰的行中停顿。"}]},{"partOfSpeech":"n.","definition":{"en":"In music or public speaking, brief pauses or breaks that shape timing and expression.","zh":"在音乐或演讲中，用来控制节拍与表达的短暂停顿或间歇。"},"examples":[{"en":"The conductor asked for stronger caesuras between phrases.","zh":"指挥要求乐句之间的停顿（caesuras）更明显一些。"},{"en":"Well-placed caesuras can make a speech easier to follow.","zh":"恰当的停顿（caesuras）能让演讲更易理解。"}]}],"synonyms":["pauses","breaks","rests","halts"],"phonetic":"/sɪˈzjʊrəz/","extraExplanation":["“caesura”来自拉丁语，原意与“切开/切割”相关，所以强调的是诗行内部被“切出”的停顿。","在英文诗歌赏析里，caesura 常与诗的节奏（meter）一起讨论：它不一定等于句号，也可能由逗号、破折号，甚至语义上的自然停顿形成。","学习时注意形式：单数 caesura，复数 caesuras（你输入的就是复数）。"]}
{"word":"caesuric","summary":{"en":"Caesuric means “having or relating to a caesura,” a meaningful pause within a line of poetry or a sentence.","zh":"caesuric 指“与诗行停顿（caesura）有关的”，即诗句或句子中具有意义的行内停顿。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to a caesura: a natural pause or break in a line of poetry or in a sentence, often used for rhythm or emphasis","zh":"与“诗行停顿（caesura）”有关的；指诗句或句子中自然的停顿或断开，常用于节奏与强调"},"examples":[{"en":"The poet uses a caesuric pause in the middle of the line to slow the rhythm.","zh":"诗人用诗行中部的停顿来放慢节奏。"},{"en":"A caesuric break after the first phrase adds dramatic emphasis.","zh":"在第一短语之后的停顿会增强戏剧性的强调。"},{"en":"Read the line aloud and notice the caesuric pause created by the comma.","zh":"把这句诗朗读出来，注意逗号带来的停顿。"}]}],"synonyms":["caesural","paused","broken (rhythm)","syncopated (rhythm, broader)"],"phonetic":"/sɪˈzʊrɪk/","extraExplanation":["“caesuric”多见于诗歌分析、文学评论或语言学/修辞学语境，日常口语里较少用。","caesura（诗行停顿）常由标点（逗号、破折号）或语义自然断开形成；英语里常说“a caesura/caesural pause”，而“caesuric”更偏书面、学术表达。","相关概念：end-stopped line（句末停顿的诗行）与 enjambment（跨行连续/行末不断句）。caesuric pause 指“行内停顿”，与行末停顿不同。"]}
{"word":"Caetano","summary":{"en":"Caetano is a Portuguese name; it can also refer to the musician Caetano Veloso.","zh":"Caetano 是葡萄牙语人名/姓氏；也常用来指音乐人 Caetano Veloso。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Portuguese given name and surname (a proper noun), common in Portugal and Brazil.","zh":"（专有名词）葡萄牙语的人名/姓氏，在葡萄牙和巴西较常见。"},"examples":[{"en":"Caetano is a common name in Brazil.","zh":"Caetano 是巴西比较常见的名字。"},{"en":"My classmate Caetano moved from São Paulo to New York.","zh":"我的同学 Caetano 从圣保罗搬到了纽约。"}]},{"partOfSpeech":"other","definition":{"en":"often used to refer to the Brazilian singer-songwriter Caetano Veloso (1942– ), an influential figure in Brazilian popular music.","zh":"也常用来指巴西创作歌手 Caetano Veloso（1942– ），巴西流行音乐的重要人物。"},"examples":[{"en":"I’ve been listening to Caetano all week.","zh":"我整周都在听 Caetano（Veloso）的歌。"},{"en":"Caetano Veloso helped shape the Tropicalia movement.","zh":"Caetano Veloso 对“热带主义”（Tropicália）运动影响很大。"}]}],"synonyms":["(as a reference) Caetano Veloso"],"phonetic":"/kaɪˈtɑːnoʊ/","extraExplanation":["“Caetano”源自拉丁语名字“Caietanus”，原意与意大利城市 Gaeta（古称 Caieta）有关，含义可理解为“来自 Gaeta 的人”。","在英语语境里，它通常被当作人名使用；如果对方是葡语母语者，实际发音会更接近葡萄牙语/巴西葡语的读法。"]}

