{"word":"CAF","summary":{"en":"CAF is a common abbreviation; it most often refers to the Canadian Armed Forces, the trade term “Cost and Freight,” or France’s family benefits office.","zh":"CAF是常见缩写；最常见的意思包括加拿大武装部队、外贸术语“成本加运费”，以及法国的家庭福利机构（CAF）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Canadian Armed Forces (the military forces of Canada).","zh":"加拿大武装部队（加拿大的军队）。"},"examples":[{"en":"She joined the CAF after graduating from college.","zh":"她大学毕业后加入了CAF（加拿大武装部队）。"},{"en":"The CAF assisted with disaster relief after the storm.","zh":"暴风雨过后，CAF（加拿大武装部队）参与了救灾工作。"}]},{"partOfSpeech":"n.","definition":{"en":"Cost and Freight (a trade term meaning the seller pays the cost of goods and shipping to the named port; the buyer usually takes on risk after shipment).","zh":"成本加运费（国际贸易术语：卖方承担货物成本与运至指定港口的运费；货物装运后风险通常转由买方承担）。"},"examples":[{"en":"The invoice lists the price as CAF Shanghai.","zh":"发票上标注价格为CAF上海。"},{"en":"Under CAF terms, the seller arranges freight to the destination port.","zh":"在CAF条款下，卖方负责安排运费把货物运到目的港。"}]},{"partOfSpeech":"n.","definition":{"en":"(France) Caisse d’Allocations Familiales, the public office that manages many family benefits and housing assistance.","zh":"（法国）家庭补助金管理机构（CAF，负责多种家庭福利与住房补助等）。"},"examples":[{"en":"You may need a CAF certificate when applying for housing aid in France.","zh":"在法国申请住房补助时，你可能需要提供CAF证明。"},{"en":"He created an online account on the CAF website to report his income.","zh":"他在CAF官网注册了账号，用来申报收入。"}]}],"synonyms":["C-A-F"],"phonetic":"/ˌsiː.eɪˈɛf/","extraExplanation":["“CAF”是缩写，具体意思高度依赖语境与国家/领域：军事（加拿大）、外贸/航运（贸易术语）、法国公共服务（福利机构）等。读写时常按字母念“C-A-F”。如果你告诉我它出现的句子或行业场景，我可以帮你锁定最准确的含义。"]}
{"word":"Caf","summary":{"en":"“caf” is an informal (mostly British) word meaning a simple café or small restaurant, sometimes a short form of “cafeteria.”","zh":"“caf”是非正式（多为英式）的说法，指简易咖啡馆/小餐馆，有时是“cafeteria（自助餐厅/食堂）”的简称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, mainly British) a small, simple restaurant or café; sometimes short for “cafeteria.”","zh":"（非正式，主要英式）小餐馆/简易咖啡馆；有时是“cafeteria（自助餐厅）”的简称。"},"examples":[{"en":"Let’s grab breakfast at the caf near the station.","zh":"我们去车站附近那家小餐馆吃早餐吧。"},{"en":"I’ll meet you at the caf after class.","zh":"下课后我在食堂/小餐馆和你碰面。"}]}],"synonyms":["café","caff (BrE informal)","cafeteria","diner (AmE similar idea)"],"phonetic":"/kæf/","extraExplanation":["“caf”在英式英语里常见于口语或随意的招牌/菜单中，也常拼作“caff”。在更正式的写法中通常用“café”（咖啡馆）或“cafeteria”（自助餐厅/食堂）。","注意不要和缩写“CAF”（常指某个机构/项目名称）混淆；大写的CAF通常不是“餐馆”的意思。"]}
{"word":"caf","summary":{"en":"“caf” most commonly means an informal short form of “café,” but it can also be an acronym whose meaning depends on context.","zh":"“caf”最常见是“café（咖啡馆）”的非正式缩写；也可能是缩略词，含义需看上下文。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an informal shortened form of “café” (a small restaurant where you can buy coffee and light meals)","zh":"“café（咖啡馆/小餐馆）”的非正式缩写，指卖咖啡和简餐的地方"},"examples":[{"en":"Let’s meet at the caf after class.","zh":"下课后我们在咖啡馆见吧。"},{"en":"The hotel has a small caf in the lobby.","zh":"酒店大堂里有一家小咖啡馆。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for different organizations or phrases (the exact meaning depends on the context)","zh":"多个组织或术语的缩写（具体含义取决于语境）"},"examples":[{"en":"CAF policies may vary by country or institution.","zh":"CAF 的相关政策可能因国家或机构而异。"},{"en":"In some contexts, CAF refers to the Canadian Armed Forces.","zh":"在某些语境中，CAF 指加拿大武装部队。"}]}],"synonyms":["café","cafe","coffee shop"],"phonetic":"/kæf/","extraExplanation":["在英式英语或校园/公司环境里，caf 常见于口语或便条式写法，意思就是 café（咖啡馆/食堂）。例如 school caf 往往更像“学校食堂/小卖部”。","如果你在正式文本里写“咖啡馆”，一般用 café（常保留重音符号 é）；在不方便输入重音符号时也常写 cafe。"]}
{"word":"cafard","summary":{"en":"“cafard” can mean a cockroach, and (from French) it can also mean feeling gloomy or having “the blues.”","zh":"“cafard”既可指“蟑螂”，也可（源自法语）指情绪低落、忧郁（类似“the blues”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cockroach (a large, flat, brown insect often found in buildings)","zh":"蟑螂（常见于建筑物中的扁平褐色昆虫）"},"examples":[{"en":"We found a cafard in the kitchen and called pest control.","zh":"我们在厨房发现了一只蟑螂，于是叫了灭虫公司。"},{"en":"In some regions, people use “cafard” as another word for “cockroach.”","zh":"在一些地区，人们会用“cafard”来表示“蟑螂”。"}]},{"partOfSpeech":"n.","definition":{"en":"(from French) a feeling of sadness, gloom, or “the blues”","zh":"（源自法语）忧郁、低落的心情；“蓝色忧郁”"},"examples":[{"en":"After the long winter, she said she had the cafard.","zh":"漫长的冬天过后，她说自己有点忧郁。"},{"en":"He tried music and exercise to shake off the cafard.","zh":"他试着用音乐和运动来摆脱低落情绪。"}]}],"synonyms":["cockroach","roach","the blues","gloom","melancholy"],"phonetic":"/kəˈfɑrd/","extraExplanation":["“cafard”是法语外来词：在日常法语里既可以指“蟑螂”，也常出现在短语“avoir le cafard”（直译“有蟑螂”），习惯表达是“心情低落/抑郁/闷闷不乐”。这种从“让人不舒服的东西”引申到“让人不舒服的情绪”的转义很常见。","在英语里它不算常用词；写作或阅读中遇到时，多半带有法语语感（偏文艺或特定语境）。更常见的英语说法是 “cockroach” 或 “the blues”。"]}
{"word":"cafardise","summary":{"en":"Cafardise is a rare noun meaning hypocrisy or sanctimonious, showy piety.","zh":"cafardise 是个罕见名词，指伪善或故作虔诚的道貌岸然。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) hypocrisy or false, showy piety; sanctimonious behavior or talk.","zh":"（罕见）伪善；假装虔诚的言行；道貌岸然。"},"examples":[{"en":"He preached kindness in public, but his private cruelty exposed the cafardise of his speech.","zh":"他在公众场合宣扬善良，但私下的残忍暴露了他言辞中的伪善。"},{"en":"The novel mocks the cafardise of respectable society—people who care more about appearances than truth.","zh":"这部小说讽刺了体面社会的道貌岸然——人们更在乎面子而不在乎真相。"}]}],"synonyms":["hypocrisy","sanctimony","cant","insincerity","pharisaism"],"phonetic":"/kəˈfɑrˌdiz/","extraExplanation":["“cafardise”源自法语：cafard 可指“伪君子/伪善者”，也可指“忧郁、情绪低落”（常见于法语表达 avoir le cafard）。英语里 cafardise 极少见，多见于文学性、讽刺性语境，用来强调“装出来的虔诚或正直”。","相关词联想：sanctimony（装虔诚）、cant（虚伪的道德说教语气）、piety（虔诚，正常中性词，但与 false piety 搭配可表达“伪善”）。"]}
{"word":"CAFE","summary":{"en":"A cafe is a small place where you can buy coffee, drinks, and light meals.","zh":"cafe 指咖啡馆或提供饮料与简餐的小餐馆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small restaurant or coffee shop where you can buy coffee, drinks, and light meals","zh":"咖啡馆；小餐馆（卖咖啡、饮料和简餐）"},"examples":[{"en":"Let’s meet at a cafe near the station.","zh":"我们在车站附近的一家咖啡馆见吧。"},{"en":"I ordered a latte and a sandwich at the cafe.","zh":"我在咖啡馆点了一杯拿铁和一个三明治。"},{"en":"The cafe has outdoor seating in the summer.","zh":"这家咖啡馆夏天有户外座位。"}]}],"synonyms":["coffee shop","coffeehouse","bistro","eatery"],"phonetic":"/kæˈfeɪ/","extraExplanation":["英文里常见两种拼法：cafe 和 café。café 带重音符号（é）更接近法语来源，在菜单、店名或较正式的写法中更常见；日常英文里写 cafe 也很普遍。","在不同地区，cafe 的感觉可能不同：在美式英语中常指咖啡店或提供简餐的轻食店；在英式英语里也可能指提供较简单热食的平价小餐馆。"]}
{"word":"cafe","summary":{"en":"A cafe is a casual place to buy coffee and light food; it can also be a small food area inside another building.","zh":"cafe 指提供咖啡和简餐的休闲场所；也可指建筑内部的小型简餐/咖啡区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small restaurant or coffee shop where you can buy drinks (especially coffee) and light meals.","zh":"咖啡馆；小餐馆（通常卖咖啡、饮料和简餐）。"},"examples":[{"en":"Let’s meet at a cafe near the station.","zh":"我们在车站附近的一家咖啡馆见吧。"},{"en":"She worked on her laptop in the cafe all afternoon.","zh":"她整个下午都在咖啡馆里用笔记本电脑工作。"}]},{"partOfSpeech":"n.","definition":{"en":"A place in a store, museum, or workplace where people can buy coffee, snacks, or simple food.","zh":"（商店/博物馆/单位里的）咖啡区；简餐区。"},"examples":[{"en":"We grabbed sandwiches at the museum cafe.","zh":"我们在博物馆的咖啡区买了三明治。"}]}],"synonyms":["coffee shop","café","bistro (sometimes)","snack bar (context-dependent)"],"phonetic":"/kæˈfeɪ/","extraExplanation":["“Cafe”在美式英语里常直接写作 cafe（也常见不带重音符号的拼写），原本来自法语 café，意思与“coffee（咖啡）”相关。日常口语中，cafe 往往比 restaurant 更强调轻食、休闲和喝咖啡的氛围。","英美文化里，cafe 常被视为社交与休息的空间：聊天、读书、写作、远程办公都很常见。菜单通常包括咖啡、茶、甜点、三明治、沙拉等。"]}
{"word":"cafeneh","summary":{"en":"Caffeine is a stimulant in coffee, tea, and some drinks that helps you stay awake.","zh":"Caffeine（咖啡因）是咖啡、茶和一些饮料中的兴奋剂，能帮助人保持清醒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a natural stimulant found in coffee, tea, and some soft drinks; it can make you feel more awake and alert","zh":"咖啡因；一种天然兴奋剂，存在于咖啡、茶及一些饮料中，会让人更清醒、更有精神"},"examples":[{"en":"I try not to have caffeine after 3 p.m., or I can’t sleep.","zh":"我尽量下午三点后不摄入咖啡因，不然会睡不着。"},{"en":"This soda has more caffeine than I expected.","zh":"这款汽水的咖啡因含量比我想的高。"},{"en":"Tea usually has less caffeine than coffee.","zh":"茶通常比咖啡含有更少的咖啡因。"}]}],"synonyms":["stimulant","energy booster"],"phonetic":"/ˈkæf.iːn/","extraExplanation":["你输入的“cafeneh”很可能是拼写错误；标准拼写是 **caffeine**。","**caffeine** 常见搭配：*caffeine intake*（咖啡因摄入量）、*caffeine-free*（不含咖啡因）、*a caffeine boost*（咖啡因提神）。","文化小提示：英语里日常说“too much caffeine”往往暗示心跳加快、焦虑或睡眠受影响；在美国也常见“decaf”（脱咖啡因咖啡）的选择。"]}
{"word":"cafenet","summary":{"en":"“Cafenet” usually refers to an internet café (a place to use computers and the internet).","zh":"“cafenet”通常指网吧／网络咖啡馆（可使用电脑和网络的场所）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, uncommon) An internet café; a place where you can use computers and the internet, often with drinks or snacks.","zh":"（非正式、较少见）网吧／网络咖啡馆；提供电脑和上网服务，通常也卖饮料或小吃的地方。"},"examples":[{"en":"I’ll meet you at the cafenet near the station to check my email.","zh":"我会在车站附近的那家“cafenet”跟你碰面，顺便查一下邮件。"},{"en":"When we traveled, we used a cafenet to print our tickets.","zh":"旅行时我们去了一家“cafenet”打印车票。"}]}],"synonyms":["internet café","cybercafé","net café"],"phonetic":"/ˈkæfˌnɛt/","extraExplanation":["“cafenet”不是最常见的标准拼写，更常见的说法是 **internet café / cybercafé**（英式也写作 *internet cafe* 或 *internet café*）。有时“Cafenet”也可能是店名或品牌名，具体含义要看上下文。"]}
{"word":"cafes","summary":{"en":"“Cafes” means more than one café (coffee shop/light restaurant).","zh":"“cafes”是“café”的复数，表示不止一家咖啡馆（或提供简餐的咖啡店）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “café”: a small restaurant where you can buy coffee, drinks, and light meals.","zh":"“café”的复数：咖啡馆/小餐馆，通常提供咖啡、饮料和简餐。"},"examples":[{"en":"There are many cafes near the university.","zh":"大学附近有很多咖啡馆。"},{"en":"We stopped at a cafe for coffee and a sandwich.","zh":"我们在一家咖啡馆停下来喝咖啡、吃三明治。"},{"en":"Some cafes have free Wi‑Fi, so people work there.","zh":"有些咖啡馆有免费Wi‑Fi，所以人们会在那里工作。"}]}],"synonyms":["coffee shops","cafés"],"phonetic":"/kæˈfeɪz/","extraExplanation":["拼写提示：英语里常见两种写法：café（带重音符号，较正式/更接近法语来源）和 cafe（更常见于日常打字）。复数通常写 cafes（不加重音），也可见 cafés。","文化语境：在美式英语中，cafe/café 通常指轻食与咖啡为主的店；而 restaurant 更偏完整正餐。某些地区还会把“diner”用于更传统、菜单更大的平价餐馆。"]}
{"word":"cafetal","summary":{"en":"Cafetal means a coffee plantation, especially in Spanish-speaking cultural contexts.","zh":"cafetal 指“咖啡种植园”，尤其常见于与西语文化相关的语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a coffee plantation; an area of land where coffee plants are grown (often used in Latin American or Caribbean contexts).","zh":"咖啡种植园；种植咖啡树的大片土地（常见于拉丁美洲或加勒比语境）。"},"examples":[{"en":"The workers harvested ripe coffee cherries on the cafetal at sunrise.","zh":"工人们在日出时分在咖啡种植园里采摘成熟的咖啡果。"},{"en":"Their family has owned a small cafetal in the mountains for generations.","zh":"他们家族世世代代在山里拥有一座小型咖啡种植园。"}]}],"synonyms":["coffee plantation","coffee estate","coffee farm"],"phonetic":"ˌkæfəˈtɑːl","extraExplanation":["“cafetal”源自西班牙语，常用于西语文化背景的英语写作、新闻或文学中，指“咖啡种植园/咖啡园”，比一般的“coffee farm”更带有拉丁美洲语境色彩。","在相关历史与文学叙述里，cafetal有时不仅指土地，也会隐含种植园经济、劳作与社会阶层等背景；阅读时可结合上下文判断语气与立场。"]}
{"word":"cafeter","summary":{"en":"“Cafeter” is not a common English word; you probably mean “cafeteria,” a self-service dining area such as a school or workplace lunchroom.","zh":"“cafeter”不是常见英语单词；你可能想查的是“cafeteria”，指学校或单位等场所的自助餐厅/食堂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended: “cafeteria”) a self-service restaurant, especially in a school, workplace, or hospital, where you choose food from a counter and pay before you sit down.","zh":"（你可能想查的是：cafeteria）自助餐厅；（尤指学校、公司或医院里的）食堂，你在柜台选餐并付款后再就座。"},"examples":[{"en":"I usually eat lunch in the school cafeteria.","zh":"我通常在学校食堂吃午饭。"},{"en":"The hospital cafeteria is on the first floor.","zh":"医院的自助餐厅在一楼。"},{"en":"Let’s meet in the cafeteria at noon.","zh":"我们中午在食堂见。"}]}],"synonyms":["lunchroom","canteen","dining hall","self-service restaurant"],"phonetic":"/ˌkæfəˈtɪriə/","extraExplanation":["“cafeter”本身在现代英语中不是常用单词，最常见是拼写未完成或拼错了“cafeteria”。","“cafeteria”来自西班牙语 cafetería，和“café（咖啡馆）”同源；在美式英语里非常常见，常指学校/单位的“食堂”。"]}
{"word":"cafeteria","summary":{"en":"A cafeteria is a self-service place to get food (often in a school or workplace) and eat there.","zh":"cafeteria 指自助取餐并在现场用餐的地方，常见于学校或公司等的食堂/自助餐厅。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place (often in a school, hospital, or workplace) where people choose food from a serving line and eat there","zh":"自助餐厅；（常见于学校、医院或公司等的）食堂，人们在取餐线自选食物并在现场用餐"},"examples":[{"en":"I usually have lunch in the school cafeteria.","zh":"我通常在学校食堂吃午饭。"},{"en":"The hospital cafeteria is open 24 hours a day.","zh":"医院的自助餐厅全天 24 小时营业。"},{"en":"She grabbed a sandwich from the cafeteria line before class.","zh":"她上课前在食堂取餐队伍里拿了一个三明治。"}]}],"synonyms":["canteen","dining hall","lunchroom","self-service restaurant"],"phonetic":"/ˌkæfəˈtɪriə/","extraExplanation":["“Cafeteria”在美式英语里很常用，尤其指学校或公司里的“食堂/自助餐厅”。在英式英语中也能用，但有时更常说“canteen”（食堂）或“self-service restaurant”（自助餐厅）。","词源与西班牙语有关，最初与“cafetería（咖啡馆/提供咖啡的地方）”相关，后来在英语里更偏向“自助取餐的餐厅”这一含义。"]}
{"word":"cafeterias","summary":{"en":"“Cafeterias” is the plural of “cafeteria”: places where people eat, often by self-service, especially in schools or workplaces.","zh":"“cafeterias”是“cafeteria”的复数：指提供餐食的自助餐厅/食堂，尤指学校或单位里的就餐场所。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place (often in a school, hospital, workplace, or department store) where people get food by serving themselves or ordering at a counter","zh":"自助餐厅；食堂（常见于学校、医院、公司或商场等，人们通常自取食物或在柜台点餐）"},"examples":[{"en":"The hospital cafeterias are open 24 hours a day.","zh":"医院的食堂全天24小时开放。"},{"en":"Students crowded into the school cafeteria at lunchtime.","zh":"午餐时间学生们挤进了学校食堂。"},{"en":"We grabbed sandwiches from the cafeteria downstairs.","zh":"我们在楼下的自助餐厅买了三明治。"}]}],"synonyms":["canteens","dining halls","lunchrooms"],"phonetic":"/ˌkæfəˈtɪriəz/","extraExplanation":["“cafeteria”是可数名词，复数形式是“cafeterias”。拼写上遵循以元音字母结尾加 -s 的规则。","在美式英语里，“cafeteria”很常指学校的“食堂”；在英式英语中也会用，但有时更常说“canteen”（尤其在学校或工厂语境）。"]}
{"word":"cafetiere","summary":{"en":"A cafetière is a French press used to brew coffee by steeping and pressing.","zh":"cafetière 指法压壶（压滤壶），用浸泡再压滤的方式冲煮咖啡。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a glass or metal coffee pot with a plunger and mesh filter, used to brew coffee by steeping grounds in hot water (French press).","zh":"压滤壶；法压壶（用活塞和滤网把咖啡渣压下去来冲泡咖啡的壶）。"},"examples":[{"en":"I make coffee in a cafetière every morning.","zh":"我每天早上都用法压壶冲咖啡。"},{"en":"Add the grounds, pour in hot water, then press the cafetière slowly.","zh":"放入咖啡粉，倒入热水，然后慢慢压下法压壶的活塞。"}]}],"synonyms":["French press","press pot","coffee press"],"phonetic":"/ˌkæfəˈtjɛr/","extraExplanation":["“cafetière”在英式英语中更常见；美式英语里更常说“French press”。","这个词来自法语，原意与“咖啡器具/咖啡壶”有关；在餐馆点餐时，可能指“整壶咖啡”。"]}
{"word":"cafetorium","summary":{"en":"A cafetorium is a school room used as both a cafeteria and an auditorium.","zh":"cafetorium 指学校里兼作食堂与礼堂的多功能大厅。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large room in a school or community building that serves as both a cafeteria and an auditorium (used for eating meals, assemblies, performances, etc.)","zh":"（学校等的）食堂礼堂两用厅；兼作餐厅和礼堂的大房间（用于用餐、集会、演出等）"},"examples":[{"en":"The students ate lunch in the cafetorium, and then the chairs were set up for the school play.","zh":"学生们在食堂礼堂两用厅吃完午饭后，工作人员摆上椅子准备学校话剧演出。"},{"en":"Parents waited in the cafetorium for the principal’s announcement.","zh":"家长们在食堂礼堂两用厅等待校长的通知。"}]}],"synonyms":["multipurpose room","multi-purpose room","cafeteria/auditorium","school hall"],"phonetic":"/ˌkæfəˈtɔriəm/","extraExplanation":["“cafetorium”是由“cafeteria（自助餐厅/食堂）+ auditorium（礼堂/大礼堂）”拼成的混成词（portmanteau）。","这个词在美国校园语境里比较常见，尤其是小学或中学；正式文件里也可能写成“cafeteria/auditorium”或直接用“multipurpose room（多功能厅）”。"]}
{"word":"caff","summary":{"en":"“Caff” is an informal word meaning either a simple café (especially in the UK) or caffeinated coffee (opposite of decaf).","zh":"“caff”是非正式说法，可指（英式）简朴的小餐馆/小咖啡馆，也可指含咖啡因的咖啡（与decaf脱因相对）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(UK, informal) a small, simple café (often a cheap, casual place to eat).","zh":"（英式，非正式）小餐馆/小咖啡馆（常指便宜、随意的吃饭地方）。"},"examples":[{"en":"Let’s grab breakfast at the caff near the station.","zh":"我们去车站附近那家小餐馆吃早饭吧。"},{"en":"He’s always chatting with the locals in his favorite caff.","zh":"他总是在他最喜欢的小餐馆里和当地人聊天。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) caffeinated coffee (as opposed to decaf).","zh":"（非正式）含咖啡因的咖啡（相对于脱因咖啡 decaf）。"},"examples":[{"en":"Do you want a caff or a decaf?","zh":"你想要含咖啡因的还是脱因的？"},{"en":"I can’t have caff after dinner or I won’t sleep.","zh":"晚饭后我不能喝含咖啡因的咖啡，不然睡不着。"}]}],"synonyms":["café","coffee shop","diner","caffeinated coffee","regular coffee"],"phonetic":"/kæf/","extraExplanation":["“caff”多见于英式口语/书面随意场合：指“小餐馆”时带一点亲切、日常感；指“含咖啡因的咖啡”时常与“decaf（脱因）”成对出现。正式写作里更常用“café”或“caffeinated coffee”。"]}
{"word":"caffa","summary":{"en":"Caffa is mainly a historical place name: either the medieval Black Sea port now called Feodosia, or a variant spelling of Ethiopia’s Kaffa region.","zh":"Caffa 主要是历史地名：可指中世纪黑海港口（今费奥多西亚），也可作埃塞俄比亚 Kaffa 地区的拼写变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical name) A port city on the Crimean Peninsula, now called Feodosia (Ukraine/Crimea), famous in medieval trade history.","zh":"（历史地名）克里米亚半岛上的港口城市，今多称费奥多西亚（Feodosia），在中世纪贸易史上很有名。"},"examples":[{"en":"In medieval records, Caffa appears as a major Genoese trading port on the Black Sea.","zh":"在中世纪文献中，Caffa 常被记为黑海重要的热那亚贸易港。"},{"en":"Some histories mention the siege of Caffa when discussing the spread of the plague in Europe.","zh":"一些历史著作在讨论黑死病在欧洲的传播时，会提到对 Caffa 的围攻。"}]},{"partOfSpeech":"n.","definition":{"en":"A variant spelling of Kaffa, a region in southwestern Ethiopia sometimes linked (in popular accounts) to the origins of coffee.","zh":"Kaffa 的一种拼写变体；指埃塞俄比亚西南部的一个地区，在一些通俗说法中常被认为与咖啡起源有关。"},"examples":[{"en":"Some sources spell the Ethiopian region as Kaffa, while others write Caffa.","zh":"有些资料把埃塞俄比亚该地区写作 Kaffa，也有写作 Caffa 的。"},{"en":"The story connects coffee’s early use to the highlands around Kaffa/Caffa.","zh":"传说把咖啡的早期使用与 Kaffa/Caffa 一带的高地联系起来。"}]}],"synonyms":["Kaffa","Feodosia","Theodosia"],"phonetic":"ˈkɑːfə","extraExplanation":["“Caffa”常见于历史语境，尤其是指克里米亚的中世纪港口（今费奥多西亚）。英文里更常见的现代写法是 Feodosia（城市）或 Kaffa（埃塞俄比亚地区）。","历史上“围攻 Caffa（1346 年左右）”常被用来讨论黑死病传播的叙事；不过不同史料对细节的可靠性与解释不完全一致。","关于“coffee/咖啡”是否直接源自“Kaffa/Caffa”的说法很流行，但语言学上并非铁定结论；学习时可把它当作常见文化说法来理解。"]}
{"word":"caffeate","summary":{"en":"Caffeate means a salt or ester formed from caffeic acid, mainly used in chemistry and research contexts.","zh":"Caffeate 指由咖啡酸形成的盐或酯，主要用于化学与科研语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound that is a salt or ester of caffeic acid (often found in plants, coffee, and propolis).","zh":"咖啡酸盐或咖啡酸酯（由“咖啡酸”形成的盐或酯，常见于植物、咖啡与蜂胶等）。"},"examples":[{"en":"Researchers measured several caffeates in the plant extract.","zh":"研究人员测量了该植物提取物中的多种咖啡酸盐/咖啡酸酯。"},{"en":"This formulation includes a caffeate derivative for antioxidant studies.","zh":"该配方包含一种咖啡酸酯衍生物，用于抗氧化研究。"}]}],"synonyms":["caffeic acid salt","caffeic acid ester","caffeate derivative"],"phonetic":"/ˈkæfiˌeɪt/","extraExplanation":["“caffeate”是偏学术/化学领域用词，日常英语里不常见；更多时候会直接说“caffeic acid（咖啡酸）”或具体名称（如某某“caffeate ester/ salt”）。","咖啡酸（caffeic acid）是一种常见的植物酚类成分，因此“caffeate”常出现在植物化学、食品化学与药理相关的论文中。拼写上与“caffeine（咖啡因）”相似，但两者不是同一种物质。"]}
{"word":"caffeic","summary":{"en":"“Caffeic” usually appears in scientific contexts, especially in “caffeic acid,” meaning related to or derived from coffee/plant compounds.","zh":"“caffeic”多见于科学语境，尤用于“caffeic acid（咖啡酸）”，表示与咖啡有关或源自咖啡/植物化合物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or derived from coffee; most commonly used in chemistry in the term “caffeic acid,” a natural plant compound.","zh":"与咖啡有关的；源自咖啡的（最常见于化学用语，如“caffeic acid/咖啡酸”，一种天然植物化合物）。"},"examples":[{"en":"Caffeic acid is found in coffee, apples, and many other plants.","zh":"咖啡酸存在于咖啡、苹果以及许多其他植物中。"},{"en":"Researchers studied the caffeic compounds in the extract.","zh":"研究人员分析了该提取物中的咖啡酸类化合物。"}]}],"synonyms":["coffee-related (general)","coffee-derived (general)"],"phonetic":"/ˈkæfiɪk/","extraExplanation":["“caffeic”在日常英语里很少单独使用，更多出现在科学/营养学语境中，尤其是“caffeic acid（咖啡酸）”。它是一种多酚类（phenolic）天然物质，常见于咖啡、茶、某些水果与蔬菜中。"]}
{"word":"caffein","summary":{"en":"Caffeine is a stimulant that helps you feel more awake, commonly found in coffee and tea.","zh":"Caffeine（咖啡因）是一种常见于咖啡和茶中的兴奋剂，能让人更清醒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a natural stimulant found in coffee, tea, and some soft drinks; it can make you feel more awake and alert","zh":"咖啡因；一种天然兴奋剂，常见于咖啡、茶和一些汽水中，会让人更清醒、更有精神"},"examples":[{"en":"I try not to drink caffeine after 2 p.m. because it affects my sleep.","zh":"我尽量不在下午两点后摄入咖啡因，因为会影响睡眠。"},{"en":"Tea has less caffeine than coffee, but it can still help you stay focused.","zh":"茶的咖啡因含量通常比咖啡少，但仍能帮助你保持专注。"}]}],"synonyms":["stimulant","upper","coffee (informal, context-dependent)"],"phonetic":"/ˈkæfiːn/","extraExplanation":["你输入的 **caffein** 常见于拼写错误；标准拼写是 **caffeine**。","咖啡因既可来自天然来源（咖啡豆、茶叶、可可），也可作为添加成分出现在能量饮料、可乐、部分止痛药中。不同国家/品牌的含量差异较大。","日常语境里常说 **cut back on caffeine（减少咖啡因摄入）**、**caffeine-free/decaf（无咖啡因/低咖啡因）**。"]}
{"word":"caffeina","summary":{"en":"Caffeine is a stimulant that makes you feel more awake.","zh":"咖啡因是一种让人更清醒的兴奋剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Caffeine: a natural stimulant found in coffee, tea, and some soft drinks and medicines; it helps you feel more awake and alert.","zh":"咖啡因：一种天然的兴奋剂，常见于咖啡、茶以及一些汽水和药物中；能让人更清醒、更有精神。"},"examples":[{"en":"I try not to drink caffeine after 3 p.m., or I can’t sleep.","zh":"我尽量下午三点后不摄入咖啡因，不然我会睡不着。"},{"en":"This tea has less caffeine than coffee.","zh":"这种茶的咖啡因含量比咖啡低。"},{"en":"Some cold medicines contain caffeine to help you stay alert.","zh":"一些感冒药含有咖啡因，帮助你保持清醒。"}]}],"synonyms":["stimulant"],"phonetic":"/ˈkæf.iːn/","extraExplanation":["“caffeina”是意大利语里的“咖啡因”。英语对应词是“caffeine”。","日常英语里常说“caffeine”或“caffeine intake（咖啡因摄入量）”。如果你在看食品标签，也会看到“caffeinated（含咖啡因的）/ decaffeinated（脱咖啡因的）”这两个形容词。"]}
{"word":"caffeinated","summary":{"en":"Caffeinated means ‘containing caffeine’ or ‘made more awake/energetic by caffeine.’","zh":"caffeinated 表示“含咖啡因的”，也可指“因咖啡因而更清醒/更有精神的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing caffeine (a stimulant), especially describing drinks like coffee, tea, or energy drinks.","zh":"含咖啡因的（咖啡因是一种兴奋剂），常用于形容咖啡、茶或能量饮料等。"},"examples":[{"en":"I try not to drink caffeinated coffee after 3 p.m. or I can’t sleep.","zh":"我尽量下午三点后不喝含咖啡因的咖啡，不然会睡不着。"},{"en":"This soda is caffeinated, so it may keep you awake.","zh":"这款汽水含咖啡因，所以可能会让你更清醒。"},{"en":"Some people switch to decaf because regular tea is lightly caffeinated.","zh":"有些人改喝脱咖啡因饮品，因为普通茶也含少量咖啡因。"}]},{"partOfSpeech":"adj.","definition":{"en":"Made more alert or energetic by caffeine.","zh":"（因摄入咖啡因而）变得更清醒、更有精神的。"},"examples":[{"en":"After a double espresso, I felt caffeinated and ready to work.","zh":"喝了双份浓缩咖啡后，我感觉精神了，准备开始工作。"},{"en":"He seemed a little too caffeinated during the meeting.","zh":"他在会议上看起来有点太兴奋/太“咖啡因上头”了。"}]}],"synonyms":["caffeine-containing","stimulating"],"phonetic":"/ˈkæf.i.neɪ.tɪd/","extraExplanation":["“caffeinated”最常见的搭配是：caffeinated coffee/tea/soda（含咖啡因的咖啡/茶/汽水）。对应的反义表达是“decaffeinated”或口语“decaf”（脱咖啡因的）。","在日常礼貌表达里，点饮料时常说：“Do you have a decaf option?”（你们有脱咖啡因的吗？）或 “Is it caffeinated?”（这个含咖啡因吗？），在美国咖啡店很常用。"]}
{"word":"caffeine","summary":{"en":"Caffeine is a stimulant that helps you feel more awake and alert, commonly found in coffee and tea.","zh":"咖啡因是一种兴奋剂，能让人更清醒、更警觉，常见于咖啡和茶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A natural stimulant found in coffee, tea, and some other plants, often used to stay awake and feel more alert.","zh":"咖啡因；一种天然兴奋剂，存在于咖啡、茶等植物中，常用于提神、保持清醒。"},"examples":[{"en":"I need a little caffeine in the morning to feel awake.","zh":"我早上需要一点咖啡因才会清醒。"},{"en":"Too much caffeine can make you feel nervous or shaky.","zh":"咖啡因摄入过多会让人紧张或手抖。"},{"en":"This soda has less caffeine than coffee.","zh":"这款汽水的咖啡因比咖啡少。"}]},{"partOfSpeech":"n.","definition":{"en":"A substance added to drinks, medicines, or supplements to increase alertness or reduce drowsiness.","zh":"（添加在饮料、药品或补充剂中的）咖啡因，用于增强警觉、减少困倦。"},"examples":[{"en":"Some cold medicines contain caffeine.","zh":"一些感冒药含有咖啡因。"},{"en":"Check the label to see how much caffeine is in the energy drink.","zh":"看看标签，了解这瓶能量饮料含多少咖啡因。"}]}],"synonyms":["stimulant"],"phonetic":"/ˈkæfiːn/","extraExplanation":["“caffeine”最常见的来源是咖啡豆与茶叶；此外可可、可乐果（kola nut）也含有咖啡因，所以巧克力和某些汽水也可能含少量。","英语里常见搭配：caffeine intake（咖啡因摄入量）、caffeine-free/decaf（无咖啡因/低咖啡因）、caffeine withdrawal（咖啡因戒断：突然停用后可能头痛、疲倦）。"]}
{"word":"caffeine free","summary":{"en":"without caffeine","zh":"不含咖啡因"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without caffeine; not containing caffeine.","zh":"不含咖啡因的；无咖啡因的。"},"examples":[{"en":"I drink caffeine-free tea at night so I can sleep better.","zh":"我晚上喝无咖啡因的茶，这样更容易睡好。"},{"en":"Do you have any caffeine-free soda?","zh":"你们有无咖啡因的汽水吗？"},{"en":"She chose a caffeine-free option because caffeine makes her anxious.","zh":"她选了无咖啡因的选择，因为咖啡因会让她焦虑。"}]},{"partOfSpeech":"n.","definition":{"en":"A product (especially a drink) that does not contain caffeine.","zh":"（尤指饮料）无咖啡因产品。"},"examples":[{"en":"I’ll have a caffeine-free, please.","zh":"我想要一杯无咖啡因的。"},{"en":"The store has regular coffee and a caffeine-free version.","zh":"店里有普通咖啡，也有无咖啡因版本。"}]}],"synonyms":["decaffeinated","decaf","noncaffeinated"],"phonetic":"/ˈkæf.iːn friː/","extraExplanation":["在食品饮料标签上常见“caffeine-free”和“decaf/decaffeinated”。一般来说：caffeine-free 表示几乎不含咖啡因；decaf 表示“去咖啡因”，通常仍可能残留少量。不同国家/品牌标准可能略有差异。"],"etymology":"由“caffeine（咖啡因）+ free（无……的）”构成；英语里“X-free”常用来表示“不含X”。","mnemonic":["把它当作“咖啡因 + free（免费/免除）”：免除咖啡因＝无咖啡因。","记住常见结构“X-free”：sugar-free（无糖）、fat-free（脱脂/无脂）、caffeine-free（无咖啡因）。"]}
{"word":"caffeine-containing","summary":{"en":"Caffeine-containing means it has caffeine in it.","zh":"caffeine-containing 指“含有咖啡因的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a food, drink, or product) having caffeine in it.","zh":"（指食物、饮料或产品）含有咖啡因的。"},"examples":[{"en":"Avoid caffeine-containing drinks in the evening if you have trouble sleeping.","zh":"如果你晚上睡不好，尽量避免在傍晚喝含咖啡因的饮料。"},{"en":"Some tea and chocolate are caffeine-containing, even if they don’t taste like coffee.","zh":"有些茶和巧克力也含咖啡因，即使它们喝起来不像咖啡。"},{"en":"The package warns that this medicine is caffeine-containing.","zh":"包装上警告说这种药物含有咖啡因。"}]}],"synonyms":["caffeinated","caffeine-rich","with caffeine","containing caffeine"],"phonetic":"/ˈkæfiːn kənˌteɪnɪŋ/","extraExplanation":["“caffeine-containing”常见于产品标签、说明书或较正式的写作中；日常口语更常用“caffeinated”（如：caffeinated coffee/tea）或说“has caffeine / contains caffeine”。","它是由“caffeine + containing”构成的复合形容词；写作时常用连字符，放在名词前作定语（如：caffeine-containing beverages）。放在名词后也可以不用连字符（如：beverages containing caffeine）。"]}
{"word":"caffeine-free","summary":{"en":"“Caffeine-free” describes drinks or products that do not contain caffeine.","zh":"“caffeine-free”指不含咖啡因的饮料或产品。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not containing caffeine (the stimulant found in coffee, tea, and many sodas).","zh":"不含咖啡因的（咖啡、茶和许多汽水中的刺激性成分）。"},"examples":[{"en":"I usually choose caffeine-free tea at night so I can sleep better.","zh":"我晚上通常会选不含咖啡因的茶，这样更好入睡。"},{"en":"This soda has a caffeine-free version.","zh":"这款汽水有不含咖啡因的版本。"}]}],"synonyms":["noncaffeinated","without caffeine"],"phonetic":"/ˈkæfiːn friː/","extraExplanation":["“caffeine-free”常见于饮料包装与菜单，用来表示完全不含咖啡因（或含量低到符合“无咖啡因”标示标准）。需要注意：有些“decaf（低咖啡因/脱咖啡因）”饮品仍可能含少量咖啡因，而“caffeine-free”强调不含（或可忽略不计）。"]}
{"word":"caffeines","summary":{"en":"Caffeine is a stimulant that helps you feel more awake; “caffeines” is rare and usually refers to different forms/sources in technical contexts.","zh":"Caffeine 指咖啡因（一种让人更清醒的兴奋剂）；“caffeines”很少见，通常只在技术语境中指不同形式/来源的咖啡因。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a natural stimulant found in coffee, tea, many soft drinks, and chocolate; it can make you feel more awake and alert","zh":"咖啡因；一种天然兴奋剂，存在于咖啡、茶、许多汽水和巧克力中，可让人更清醒、更有精神"},"examples":[{"en":"I try not to have caffeine after 3 p.m., or I can’t sleep.","zh":"我尽量下午三点后不摄入咖啡因，否则会睡不着。"},{"en":"This drink has less caffeine than a cup of coffee.","zh":"这款饮料的咖啡因含量比一杯咖啡少。"},{"en":"Too much caffeine can make some people feel anxious.","zh":"摄入过多咖啡因会让一些人感到焦虑。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) different sources or forms of caffeine (used in technical writing)","zh":"（较少见/偏专业）不同来源或形式的咖啡因（常见于技术或学术语境）"},"examples":[{"en":"The study compared plant-based caffeines with synthetic caffeine.","zh":"该研究比较了植物来源的咖啡因与合成咖啡因。"},{"en":"Different caffeines were tested for their effects on alertness.","zh":"研究测试了不同形式的咖啡因对警觉性的影响。"}]}],"synonyms":["stimulant","coffee (informal, context-dependent)"],"phonetic":"/ˈkæfiːn/","extraExplanation":["“caffeine”在日常英语里通常是不可数名词，常说“some caffeine / a lot of caffeine”。你输入的“caffeines”在口语中不常用；只有在强调“不同种类/不同形式的咖啡因”时才可能用复数（多见于科研或说明书）。","常见表达：caffeine content（咖啡因含量）、caffeine-free/decaf（无咖啡因/脱咖啡因）、caffeine rush/crash（咖啡因带来的兴奋/随后疲惫）。"]}
{"word":"caffeinic","summary":{"en":"Caffeinic means related to caffeine/coffee or containing caffeine; less commonly, it can refer to compounds related to caffeic acid in chemistry.","zh":"caffeinic 指与咖啡因/咖啡有关或含咖啡因；较少见时在化学语境中也可指与咖啡酸相关的化合物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to caffeine or coffee; containing caffeine.","zh":"与咖啡因或咖啡有关的；含咖啡因的。"},"examples":[{"en":"Some people avoid caffeinic drinks at night so they can sleep better.","zh":"有些人晚上会避免喝含咖啡因的饮料，这样更容易睡好。"},{"en":"The doctor suggested cutting down on caffeinic beverages like coffee and energy drinks.","zh":"医生建议减少摄入咖啡、能量饮料等含咖啡因的饮品。"}]},{"partOfSpeech":"adj.","definition":{"en":"(chemistry, less common) relating to caffeic acid or compounds derived from it.","zh":"（化学，用法较少）与咖啡酸（caffeic acid）或其衍生物有关的。"},"examples":[{"en":"Researchers measured caffeinic compounds in roasted coffee to compare flavor and antioxidant levels.","zh":"研究人员测量了烘焙咖啡中的与咖啡酸相关的化合物，用来比较风味和抗氧化水平。"}]}],"synonyms":["caffeinated","caffeine-containing","coffee-related"],"phonetic":"/ˌkæfiˈɪnɪk/","extraExplanation":["“caffeinic”在日常英语中不算常见；更常见的说法是“caffeinated”（含咖啡因的）或直接说“contains caffeine”。","在科研/化学语境里，它有时会被用来指与“caffeic acid（咖啡酸）”相关的物质，但写作时通常会更明确地写成“caffeic”或直接使用化学名词。"]}
{"word":"caffeinism","summary":{"en":"Caffeinism means the set of symptoms caused by too much caffeine.","zh":"caffeinism 指咖啡因摄入过量引发的一系列不适症状。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A condition caused by consuming too much caffeine, with symptoms such as nervousness, restlessness, trouble sleeping, or a fast heartbeat.","zh":"因摄入过量咖啡因而引起的状态（或症状群），常见表现包括紧张焦虑、坐立不安、失眠、心跳加快等。"},"examples":[{"en":"After several energy drinks a day, he started to show signs of caffeinism, like insomnia and shaky hands.","zh":"每天喝好几罐能量饮料后，他开始出现咖啡因中毒样反应的迹象，比如失眠和手抖。"},{"en":"The doctor suggested cutting back on coffee because her headaches might be related to caffeinism.","zh":"医生建议她减少咖啡摄入，因为她的头痛可能与咖啡因过量有关。"}]}],"synonyms":["caffeine intoxication","caffeine overuse","caffeine toxicity"],"phonetic":"/ˈkæfiˌnɪzəm/","extraExplanation":["“caffeinism”在日常口语中不如“caffeine intoxication（咖啡因中毒）”或“too much caffeine（咖啡因摄入过多）”常见，更偏医学/科普写法。","与“caffeine addiction（咖啡因成瘾）”不同：caffeinism更强调当下过量引发的症状；成瘾则强调长期依赖、戒断（如停咖啡后头痛、疲倦）。"]}
{"word":"caffeins","summary":{"en":"Caffeine is a stimulant that helps you feel more awake; it can also refer to the caffeine content in a drink.","zh":"Caffeine 指咖啡因：一种让人更清醒的兴奋剂；也可指饮品中的咖啡因含量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Caffeine: a natural stimulant found in coffee, tea, some soft drinks, and chocolate that can help you feel more awake.","zh":"咖啡因：一种天然兴奋剂，存在于咖啡、茶、部分汽水和巧克力中，能让人更清醒。"},"examples":[{"en":"I try not to have caffeine after 3 p.m., or I can’t sleep.","zh":"我尽量下午三点后不摄入咖啡因，不然会睡不着。"},{"en":"This tea has less caffeine than coffee.","zh":"这款茶的咖啡因比咖啡少。"},{"en":"Some people are sensitive to caffeine and feel nervous after one cup.","zh":"有些人对咖啡因很敏感，一杯就会紧张。"}]},{"partOfSpeech":"n.","definition":{"en":"Caffeine (amount/content): the level of caffeine in a drink or product.","zh":"咖啡因含量：饮料或产品中咖啡因的多少。"},"examples":[{"en":"Check the caffeine content on the label.","zh":"看看标签上的咖啡因含量。"},{"en":"Energy drinks often have high caffeine.","zh":"能量饮料往往咖啡因很高。"}]}],"synonyms":["stimulant","upper"],"phonetic":"/kæˈfiːn/","extraExplanation":["你输入的“caffeins”通常是拼写错误；标准拼写是 **caffeine**。","**caffeine** 一般作不可数名词（I’m cutting down on caffeine）；如果强调“不同种类/不同来源的咖啡因”，也可能用复数 **caffeines**，但不常见。","常见搭配：**caffeine-free**（无咖啡因的）、**decaf**（脱咖啡因的咖啡/饮品）、**a caffeine boost**（咖啡因提神）。"]}
{"word":"caffeism","summary":{"en":"Caffeism means problems or symptoms caused by too much caffeine.","zh":"Caffeism 指因摄入过量咖啡因而引起的不适或症状。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a condition caused by taking too much caffeine, often with symptoms like nervousness, insomnia, fast heartbeat, or stomach upset","zh":"因摄入过量咖啡因而出现的不适状态（类似“咖啡因中毒/过量反应”），常见症状包括紧张、失眠、心跳加快或胃部不适等"},"examples":[{"en":"After three energy drinks, he felt shaky and couldn’t sleep—classic caffeism.","zh":"喝了三罐能量饮料后他开始发抖、睡不着——这就是典型的 caffeism（咖啡因过量反应）。"},{"en":"Her doctor suggested cutting back on coffee because the headaches might be related to caffeism.","zh":"医生建议她减少咖啡摄入，因为头痛可能与 caffeism（咖啡因过量）有关。"}]}],"synonyms":["caffeinism","caffeine intoxication","caffeine jitters"],"phonetic":"/ˈkæfiˌɪzəm/","extraExplanation":["“caffeism”较少见，更常见的词是 “caffeinism”（咖啡因中毒/过量）或更口语的说法如 “caffeine jitters”（咖啡因导致的发抖、亢奋）。","它通常用于描述咖啡因摄入过多引发的短期反应；如果你想表达“对咖啡因上瘾/依赖”，更常用 “caffeine dependence” 或 “caffeine addiction”。"]}
{"word":"caffeol","summary":{"en":"Caffeol means the aromatic coffee oils/compounds responsible for coffee’s smell and flavor.","zh":"caffeol 指构成咖啡香气与风味的芳香油脂/香味成分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The aromatic oily substances (especially volatile compounds) that give coffee its characteristic smell and flavor; sometimes used to mean “coffee oil” or “coffee aroma.”","zh":"咖啡中带来典型香气与风味的芳香油性物质（尤其指挥发性香味成分）；有时也泛指“咖啡油/咖啡香气”。"},"examples":[{"en":"Freshly ground beans release caffeol quickly into the air.","zh":"新鲜研磨的咖啡豆会很快把 caffeol（咖啡香气成分）释放到空气中。"},{"en":"Some brewing methods keep more caffeol, which can make the cup smell richer.","zh":"有些冲煮方式能保留更多 caffeol，因此咖啡闻起来更浓郁。"}]}],"synonyms":["coffee aroma","coffee oils","coffee essence"],"phonetic":"/ˈkæfiˌɔl/","extraExplanation":["“caffeol”在日常英语里不算常用词，更常见的说法是“coffee aroma（咖啡香气）”“coffee oils（咖啡油脂）”或更专业的“volatile aroma compounds（挥发性香气化合物）”。","词形来自“café/coffee（咖啡）+ -ol（常见于化学/物质名称的后缀）”，所以它常带一点“物质/成分”的语感。","如果你是在配料表、香精或科研语境看到它，它通常指与咖啡香味相关的一类油性/挥发性成分，而不是某一种单一化学物质。"]}
{"word":"caffeone","summary":{"en":"“Caffeone” isn’t standard English; it most likely means “caffeine.”","zh":"“caffeone”不是标准英语；很可能是想写“caffeine（咖啡因）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “caffeine,” the natural stimulant found in coffee, tea, and many energy drinks.","zh":"不是标准英语单词。很可能是把“caffeine（咖啡因）”拼错了；咖啡因是一种存在于咖啡、茶和许多能量饮料中的天然兴奋剂。"},"examples":[{"en":"I think you mean “caffeine”—it can help you feel more awake.","zh":"我觉得你想写的是“caffeine（咖啡因）”——它能让人更清醒。"},{"en":"Too much caffeine can make you feel nervous.","zh":"摄入太多咖啡因会让人紧张不安。"}]}],"synonyms":["caffeine","stimulant"],"phonetic":"/kæˈfiːn/","extraExplanation":["“caffeine”的常见正确拼写是 c-a-f-f-e-i-n-e（中间是 -ei-）。很多人会把它误写成 *caffein*、*caffine*，甚至像你写的 *caffeone*。","如果你看到 “Caffeone” 出现在包装、菜单或招牌上，它也可能是品牌名/店名（专有名词），具体含义要看上下文。你可以把那一行文字或图片发来，我可以帮你判断。"]}
{"word":"Cafferty","summary":{"en":"“Cafferty” is usually a surname (a last name), and it can also refer to a specific person with that name in media or conversation.","zh":"“Cafferty”通常是英文姓氏；也可在媒体或对话中指代名为 Cafferty 的特定人物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), used for people with the last name Cafferty.","zh":"（姓氏）卡弗蒂；用作人的姓。"},"examples":[{"en":"My professor’s last name is Cafferty.","zh":"我教授的姓是 Cafferty（卡弗蒂）。"},{"en":"Ms. Cafferty will lead today’s meeting.","zh":"Cafferty 女士将主持今天的会议。"}]},{"partOfSpeech":"n.","definition":{"en":"(often capitalized) a name that may refer to a specific person, especially in news/media contexts (e.g., Jack Cafferty, an American TV journalist).","zh":"（常大写）在新闻/媒体语境中指某位特定人物的名字，例如 Jack Cafferty（美国电视新闻记者）。"},"examples":[{"en":"I remember hearing Cafferty comment on the story on TV.","zh":"我记得在电视上听过 Cafferty 评论这条新闻。"},{"en":"The article quoted Cafferty’s opinion on the issue.","zh":"这篇文章引用了 Cafferty 对该问题的看法。"}]}],"synonyms":["(surname)"],"phonetic":"ˈkæfɚti","extraExplanation":["“Cafferty”多见于英语国家的姓氏，来源与爱尔兰盖尔语姓氏有关（常见解释为源自 Ó Cafartaigh 一类形式，意为“某位祖先/家族的后代”）。在英语里它通常不当作普通词汇使用，而是作为专有名词（人名/姓氏）。","读音提示：重音通常在第一个音节（CAF-），中间的 -er- 发弱读（类似“uh”）。"]}
{"word":"Caffery","summary":{"en":"Caffery is most commonly a surname (family name).","zh":"Caffery 最常见用法是英文姓氏（家族姓）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname), used for a person or a family; sometimes also used as a place name in English-speaking contexts","zh":"姓氏（家族姓），用于指一个人或一个家族；在英语语境中有时也可作地名"},"examples":[{"en":"Dr. Caffery will see you now.","zh":"Caffery 医生现在要见你。"},{"en":"I’m looking for Ms. Caffery’s email address.","zh":"我在找 Caffery 女士的邮箱地址。"},{"en":"The report was written by Caffery and colleagues.","zh":"这份报告由 Caffery 及其同事撰写。"}]}],"synonyms":["family name","surname","last name"],"phonetic":"/ˈkæfəri/","extraExplanation":["“Caffery”更常见于英文姓氏拼写体系里，可能与爱尔兰/苏格兰盖尔语背景的姓氏有关；在真实文本中也常见近似拼写如“Caffrey”“Caffery”。由于是专有名词，发音可能因家庭或地区而略有不同。","作为姓氏时，英语里通常不加冠词：说“Caffery said…”而不是“the Caffery said…”。要表示一家人时可用复数：the Cafferys（卡弗里一家）。"]}
{"word":"caffetannic","summary":{"en":"A rare technical adjective meaning “coffee-related and tannin-like,” often seen in terms like “caffetannic acid.”","zh":"一个少见的技术性形容词，指“与咖啡相关且具有单宁样性质”，常见于如“caffetannic acid（咖啡单宁酸）”等术语中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to or containing compounds found in coffee that have tannin-like properties (often used in chemistry or food science, e.g., “caffetannic acid”).","zh":"（多用于化学或食品科学）指与咖啡中具有类似单宁性质的化合物有关的；含“咖啡-单宁”类成分的（常见于“caffetannic acid（咖啡单宁酸）”等术语）。"},"examples":[{"en":"Some older chemistry texts mention caffetannic compounds when describing substances extracted from coffee.","zh":"一些较早的化学教材在描述从咖啡中提取的物质时会提到 caffetannic 类化合物。"},{"en":"The paper analyzed caffetannic acid and other polyphenols in roasted coffee.","zh":"该论文分析了烘焙咖啡中的咖啡单宁酸（caffetannic acid）和其他多酚类物质。"}]}],"synonyms":["coffee polyphenolic (technical)","tannin-like (general)"],"phonetic":"/ˌkæfiˈtænɪk/","extraExplanation":["“caffetannic”在日常英语里非常少见，更多出现在旧式或专业语境（化学/食品成分分析）中。现代资料里更常用的是更明确的化学类别名称，如“polyphenols（多酚）”“tannins（单宁）”或具体化合物名。","词形上可理解为 caffe-（咖啡）+ tannic（单宁的）。如果你是在成分表、论文或老书里看到它，通常是在指咖啡中的某类多酚/单宁样物质。"]}
{"word":"caffetannin","summary":{"en":"Caffetannin is a rare term for tannin-like compounds in coffee that can add bitterness and astringency.","zh":"Caffetannin 是个较少见的词，指咖啡中带来苦味与涩感（收敛感）的类单宁化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tannin-like polyphenolic substance found in coffee (and sometimes discussed in relation to coffee flavor), associated with bitterness and a dry, astringent mouthfeel","zh":"（咖啡中的）类单宁多酚物质；常被提到与咖啡的苦味和“涩感/收敛感”（口腔发干的感觉）有关"},"examples":[{"en":"Some tasters say over-extracted coffee brings out more caffetannin, making the cup taste harsh and drying.","zh":"有些品鉴者认为，萃取过度会带出更多 caffetannin，让咖啡变得刺口、发涩、口腔发干。"},{"en":"Lowering the brew temperature can sometimes reduce the bitter, tannin-like notes linked to caffetannin.","zh":"把冲煮温度稍微降低，有时能减轻与 caffetannin 相关的“类单宁”苦涩风味。"}]}],"synonyms":["coffee tannin","tannins","polyphenols"],"phonetic":"ˌkæfɪˈtænɪn","extraExplanation":["“caffetannin”在日常英语里非常少见，更常见的说法是用更泛的词：tannins（单宁）、polyphenols（多酚）、astringency（涩感/收敛感）。在咖啡语境中，人们往往用这些词来描述“苦、涩、口腔发干”的感觉。","“tannin/单宁”原本常用于描述茶、红酒的涩感；谈咖啡时也会借用这个概念，但从化学上说，咖啡里导致类似口感的并不一定是同一种单宁，更多是多酚类等物质带来的综合感受。"]}
{"word":"caffiaceous","summary":{"en":"“Caffiaceous” means coffee-related or coffee-like, often describing a coffee smell, flavor, or brown color.","zh":"“caffiaceous”指“与咖啡有关或像咖啡的”，常用来形容咖啡的香气、味道或咖啡色。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to coffee or the coffee plant; coffee-like (especially in color, smell, or flavor).","zh":"与咖啡或咖啡植物有关的；像咖啡的（尤指颜色、气味或味道）。"},"examples":[{"en":"The room filled with a caffiaceous aroma as the beans began to roast.","zh":"咖啡豆开始烘焙时，房间里弥漫着一股咖啡般的香气。"},{"en":"She chose a caffiaceous shade of brown for the kitchen walls.","zh":"她为厨房墙面选了一种咖啡色调的棕色。"}]}],"synonyms":["coffee-related","coffee-like","coffee-flavored","coffee-colored"],"phonetic":"ˌkæfiˈeɪʃəs","extraExplanation":["这个词比较少见、偏书面或幽默用法，日常更常说 coffee-related（与咖啡相关的）、coffee-flavored（咖啡味的）、coffee-colored（咖啡色的）。","词源上与 caffeine（咖啡因）、café（咖啡馆）同源的词根 caffe- 有关，再加上形容词后缀 -aceous（“……性质的/……的”）。"]}
{"word":"caffiso","summary":{"en":"“Caffiso” is not a recognized English word; it’s probably a misspelling or a brand/foreign term related to coffee.","zh":"“caffiso”不是常见英语词；多半是拼写错误或与咖啡相关的品牌/外来词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling, a brand name, or a word from another language (often related to coffee).","zh":"不是标准英语词；很可能是拼写错误、品牌名，或来自其他语言的词（常与咖啡有关）。"},"examples":[{"en":"I couldn’t find “caffiso” in an English dictionary—do you mean “caffeine” or “caffè”?","zh":"我在英语词典里找不到“caffiso”——你是不是想写“caffeine（咖啡因）”或“caffè（意大利语：咖啡）”？"},{"en":"If “Caffiso” is a product name, the meaning depends on the company’s branding.","zh":"如果“Caffiso”是产品名，它的含义取决于该公司的品牌命名。"}]}],"phonetic":"/ˈkæfɪsoʊ/","extraExplanation":["“caff-”这一段在很多词里常与咖啡有关（来自意大利语 caffè，或与 caffeine 相关）。如果你能提供一句原文（它出现在哪个句子/包装/菜单上），我可以更准确判断它指的是什么，以及是否有正确拼写。"]}
{"word":"caffle","summary":{"en":"“Caffle” is a Scottish dialect word meaning to bicker/argue or to haggle over a price; it can also mean a noisy argument.","zh":"“caffle”是苏格兰方言词，可指拌嘴争吵或讨价还价，也可作名词指一阵吵闹的争论。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Scots, dialect) to argue or wrangle noisily; to bicker back and forth, often over something small.","zh":"（苏格兰方言）争吵、吵闹式地争辩；常指为小事反复顶嘴、拌嘴。"},"examples":[{"en":"The two brothers were caffling over who should wash the dishes.","zh":"两兄弟为谁该洗碗吵个不停。"},{"en":"They caffled in the street until a neighbor asked them to quiet down.","zh":"他们在街上吵了起来，直到邻居让他们小声点。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Scots, dialect) to haggle or bargain, especially over price.","zh":"（苏格兰方言）讨价还价（尤指价格）。"},"examples":[{"en":"She caffled with the seller for a lower price at the market.","zh":"她在市场上和卖家讨价还价想便宜点。"},{"en":"He always caffles when he buys a used car.","zh":"他买二手车时总要讨价还价。"}]},{"partOfSpeech":"n.","definition":{"en":"(Scots, dialect) a noisy argument or bout of bickering.","zh":"（苏格兰方言）吵闹的争论；一阵拌嘴。"},"examples":[{"en":"There was a caffle outside the pub late at night.","zh":"深夜酒吧外发生了一阵吵闹的争执。"}]}],"synonyms":["bicker","wrangle","argue","quarrel","haggle","bargain"],"phonetic":"/ˈkæfəl/","extraExplanation":["“caffle”主要见于苏格兰英语/方言，在现代标准英语里不常用；日常写作里更常用的对应词是“argue / bicker / wrangle”（争吵）或“haggle / bargain”（讨价还价）。","在阅读苏格兰题材的小说、民谣或方言对白时可能会遇到它；语气通常偏口语，带一点“吵吵嚷嚷、纠缠不清”的感觉。"]}
{"word":"caffled","summary":{"en":"“Caffled” is a rare dialect form meaning “argued noisily” (past of caffle), and sometimes is used to mean “confused,” similar to “baffled.”","zh":"“caffled”是少见的方言用法，主要指“吵吵嚷嚷地争辩”（caffle的过去式/分词），有时也被用来表示“困惑”，近似“baffled”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Scotland, Northern England, dialect) past tense/past participle of “caffle”: argued or wrangled in a noisy, confused way; bickered.","zh":"（苏格兰、英格兰北部方言）“caffle”的过去式/过去分词：喧闹地争吵、争辩；吵嘴。"},"examples":[{"en":"They caffled over the bill for ten minutes.","zh":"他们为了账单吵了十分钟。"},{"en":"The neighbors had caffled again, and everyone could hear it.","zh":"邻居们又吵起来了，大家都听得见。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare, dialect) confused or flustered, as if “baffled.”","zh":"（少见，方言）困惑的、慌乱的（有时近似于“baffled”）。"},"examples":[{"en":"I was completely caffled by the directions.","zh":"我被那些指示弄得一头雾水。"}]}],"synonyms":["bicker","squabble","wrangle","argue","baffled"],"phonetic":"ˈkæfəld","extraExplanation":["“caffled”并不是现代标准英语里常见的拼写，更常见的是方言动词“caffle”的过去式/分词，用来形容“吵吵嚷嚷地争辩”。如果你本来想表达“困惑、想不通”，标准英语里更常用的是“baffled”。","在阅读苏格兰或英格兰北部题材的文学/对白（例如带方言的对话）时，可能会遇到“caffle/caffled”，语气通常更口语、更带地域色彩。"]}
{"word":"caffling","summary":{"en":"“Caffling” is not standard; it usually refers to “caviling/cavilling,” meaning picky, petty criticism or objections.","zh":"“caffling”不是标准拼写；通常指“caviling/cavilling”，意思是吹毛求疵、挑刺式的批评或反对。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Usually spelled “caviling”) raising petty, picky objections; nitpicking in a way that seems unfair or unhelpful.","zh":"（通常拼作“caviling”）吹毛求疵地挑刺；为小事提出挑剔的反对意见，显得不公平或不建设性。"},"examples":[{"en":"Stop caviling about minor details and focus on the main idea.","zh":"别再为小细节吹毛求疵了，专注于主要观点。"},{"en":"Her caviling comments slowed the meeting down.","zh":"她那些挑刺的评论让会议进展变慢了。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of making petty objections; nitpicking criticism.","zh":"吹毛求疵；挑刺式的批评。"},"examples":[{"en":"There was a lot of caviling over the exact wording of the contract.","zh":"大家对合同的具体措辞进行了很多吹毛求疵式的争论。"}]}],"synonyms":["nitpicking","quibbling","faultfinding","pettifogging"],"phonetic":"/ˈkævəlɪŋ/","extraExplanation":["“caffling”不是常见标准拼写，很多情况下是把“caviling/cavilling”拼错了。动词原形是 cavil（意为“挑刺、吹毛求疵”）。在正式写作中更常见拼写 cavilling（英式常见双写 l），美式也常见 caviling。"]}
{"word":"caffoline","summary":{"en":"“Caffoline” is not a standard English word; it is usually a misspelling of “caffeine.”","zh":"“caffoline”不是标准英文词，通常是“caffeine（咖啡因）”的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard spelling) Usually a misspelling of “caffeine,” the natural stimulant found in coffee, tea, and many sodas/energy drinks.","zh":"（非标准拼写）通常是“caffeine（咖啡因）”的误拼，指咖啡、茶及许多汽水/能量饮料中的天然兴奋剂。"},"examples":[{"en":"I think you mean “caffeine,” not “caffoline.”","zh":"我想你是想写“caffeine”，不是“caffoline”。"},{"en":"Too much caffeine can make it hard to sleep.","zh":"咖啡因摄入太多会让人难以入睡。"}]},{"partOfSpeech":"n.","definition":{"en":"caffeine: a substance that helps you feel more awake and alert, but can also cause jitters or insomnia in some people.","zh":"咖啡因：一种能让人更清醒、更警觉的物质，但对一些人也可能引起心慌、手抖或失眠。"},"examples":[{"en":"I drink coffee for the caffeine in the morning.","zh":"我早上喝咖啡是为了咖啡因提神。"},{"en":"This tea has less caffeine than coffee.","zh":"这款茶的咖啡因比咖啡少。"},{"en":"She’s trying to cut down on caffeine.","zh":"她在尽量减少咖啡因摄入。"}]}],"synonyms":["caffeine","stimulant"],"phonetic":"/kæˈfiːn/","extraExplanation":["“caffoline”不是常见英文单词；更常见的是“caffeine（咖啡因）”。如果你是在包装、配料表或某个品牌/产品名里看到“Caffoline”，它也可能是商标或专有名词，需要结合上下文才能准确翻译。你可以把完整句子或截图发来，我可以帮你确认意思。"]}
{"word":"caffoy","summary":{"en":"“Caffoy” is not a standard English word; it’s likely a misspelling or a proper name. Provide context to identify the intended meaning.","zh":"“caffoy”不是标准英语单词；很可能是拼写错误或专有名词。提供上下文可帮助确认真实含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a name/brand, or a rare dialect/spelling variant. Please share the sentence or context.","zh":"不是标准英语单词。可能是拼写错误、姓名/品牌，或非常少见的方言/变体。请提供句子或上下文。"},"examples":[{"en":"I can’t find “caffoy” in a dictionary—did you mean “coffee” or “caffeine”?","zh":"我在词典里找不到“caffoy”——你是不是想写“coffee（咖啡）”或“caffeine（咖啡因）”？"},{"en":"Could you paste the sentence where you saw “caffoy”?","zh":"你能把出现“caffoy”的句子贴出来吗？"}]}],"extraExplanation":["“caffoy”很可能是与咖啡相关的拼写误差。常见相近词：coffee（咖啡）、café（咖啡馆/咖啡）、caffeine（咖啡因）、caffè（意大利语“咖啡”，英语里常见于菜单如 caffè latte）。","如果你是在品牌名、人名、地名或游戏/网文里看到的，它可能是专有名词，这种情况下需要具体上下文才能确定含义。"]}
{"word":"caffre","summary":{"en":"“Caffre” is a dated, offensive racial slur; avoid using it except when discussing history or quoting texts critically.","zh":"“caffre”是过时且具侮辱性的种族歧视用语；除非在批判性讨论历史或引用文本时，一般应避免使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(dated, offensive) a contemptuous racial slur for a Black African person, especially in southern Africa.","zh":"（过时且具侮辱性）对非洲黑人（尤指南部非洲黑人）的蔑称、种族歧视性用语。"},"examples":[{"en":"In modern English, “caffre” is considered a racist slur and should be avoided.","zh":"在现代英语中，“caffre”被视为种族歧视性侮辱用语，应避免使用。"},{"en":"The novel includes the word to show the prejudice of a character, not as acceptable speech.","zh":"小说中出现这个词是为了呈现人物的偏见，并不表示这种说法是可接受的。"}]},{"partOfSpeech":"adj.","definition":{"en":"(dated, offensive) relating to Black Africans (especially in older colonial writing); now avoided.","zh":"（过时且具侮辱性）与非洲黑人有关的（多见于旧殖民语境）；现应避免使用。"},"examples":[{"en":"Older texts may use “caffre” as an adjective, but it is not appropriate in respectful modern writing.","zh":"旧文本中可能把“caffre”当形容词使用，但在现代尊重的表达中并不合适。"}]}],"synonyms":["kaffir (offensive)"],"phonetic":"/ˈkæfər/","extraExplanation":["这个词在英语里常见的对应拼写是“kaffir”。来源与殖民时期的种族分类与歧视历史有关，在南非等地尤其具有强烈侮辱性。","学习时建议把它当作“识别和理解历史文本中的冒犯性用语”，而不是可用于日常交流的词。若需要中性表达，可用“Black person / Black African / African person（视语境）”。"]}
{"word":"Caffrey","summary":{"en":"Caffrey is mainly used as an Irish-origin surname (a family name).","zh":"Caffrey 主要用作爱尔兰来源的英文姓氏（家族姓）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a surname (family name), most commonly Irish in origin; used as a last name for people","zh":"（姓氏）常见于爱尔兰裔的英文姓，用作人的家族姓氏"},"examples":[{"en":"Ms. Caffrey will lead the meeting today.","zh":"今天的会议将由卡弗里女士主持。"},{"en":"My friend’s last name is Caffrey.","zh":"我朋友的姓是 Caffrey。"},{"en":"In the credits, you’ll see the name Caffrey listed among the producers.","zh":"在演职员表里，你会看到 Caffrey 的名字列在制片人之中。"}]}],"synonyms":["Caffery","Cafferty"],"phonetic":"/ˈkæfri/","extraExplanation":["“Caffrey”通常被视为源自爱尔兰盖尔语姓氏的英文拼写之一，常见于爱尔兰及爱尔兰移民后裔社群。不同家族的拼写与来源可能略有差异。","作为姓氏时一般不翻译意思，中文多按读音音译（如“卡弗里/卡夫里”等），具体译法可随个人或媒体惯例而定。"]}
{"word":"cafh","summary":{"en":"“cafh” is not a standard English word; it’s likely a typo (often “café”) or a context-specific acronym.","zh":"“cafh”不是标准英语单词；通常是拼写错误（常见为“café”）或需要语境才能确定含义的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a typo (often for “café”) or an acronym/initialism whose meaning depends on context.","zh":"不是标准英语单词。更可能是拼写错误（常见是想写“café”），或是一个缩写/首字母缩略词，具体含义取决于语境。"},"examples":[{"en":"I can’t find “cafh” in an English dictionary—did you mean “café” (a small coffee shop)?","zh":"我在英语词典里找不到“cafh”——你是不是想写“café”（咖啡馆）？"},{"en":"If “cafh” is an acronym, please tell me the full sentence so I can explain it.","zh":"如果“cafh”是缩写，请把完整句子发我，我才能准确解释。"}]}],"phonetic":"/siː eɪ ɛf eɪtʃ/","extraExplanation":["“cafh”如果是你在聊天、作业或文件里看到的缩写，它很可能代表某个机构/项目名（不同领域含义差很多）。给我一句原句或相关领域（学校/医疗/商业/游戏等），我可以帮你确定含义，并提供正确读法与用法。","如果你想表达“咖啡馆”，英语常用：café（也可写 cafe）。注意 café 带重音符号（é），在英文里很常见。"]}
{"word":"Cafiero","summary":{"en":"Cafiero is an Italian-origin surname used as a family name.","zh":"Cafiero 是意大利起源的姓氏，用作家族姓。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname of Italian origin; used as a family name (a proper noun).","zh":"意大利起源的姓氏；用作家族姓（专有名词）。"},"examples":[{"en":"Ms. Cafiero will lead the meeting today.","zh":"Cafiero 女士今天将主持会议。"},{"en":"I saw Cafiero listed as the author of the article.","zh":"我看到文章作者署名为 Cafiero。"}]}],"phonetic":"/kəˈfjɛroʊ/","extraExplanation":["Cafiero 常见于意大利裔社群，读音在英语环境中可能因地区与个人偏好而略有不同；在正式场合可以礼貌地询问本人“Could you tell me how to pronounce your last name?”。","历史人物中有 Carlo Cafiero（1846–1892），意大利政治活动家与无政府主义者，偶尔会在历史或政治语境中被提及。"]}
{"word":"cafila","summary":{"en":"“Cafila” means a caravan or traveling group, especially in South Asian or Middle Eastern contexts.","zh":"“cafila”指商队/旅队，常见于南亚或中东语境（英语里更常用 caravan）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a caravan; a group of people, animals, or vehicles traveling together (especially across a long distance).","zh":"（尤指长途旅行的）商队；一队结伴同行的人/牲畜/车辆。"},"examples":[{"en":"The pilgrims joined a cafila to cross the desert safely.","zh":"朝圣者加入了一支 cafila（商队），以便安全穿越沙漠。"},{"en":"A long cafila of camels moved slowly toward the oasis.","zh":"一长列骆驼组成的 cafila 缓慢地朝绿洲前进。"}]}],"synonyms":["caravan","convoy","train (of camels/vehicles)","procession"],"phonetic":"/kəˈfiːlə/","extraExplanation":["“cafila”多见于南亚语境（如乌尔都语/印地语的转写），常对应乌尔都语 قافلہ（qāfila），意思是“队伍、商队、旅队”。在标准英语里更常用的词是 “caravan”。","在历史与文学叙述中，这个词常用来营造“丝路、沙漠行旅、朝圣或商贸迁徙”的氛围，因此有时会保留外来拼写以突出地域文化色彩。"]}
{"word":"cafiz","summary":{"en":"“Cafiz” is not a standard English word; it’s likely a misspelling or a proper name.","zh":"“cafiz”不是标准英语单词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling (e.g., of “cafe/café”) or a proper name/brand/username.","zh":"不是标准英语单词。更可能是拼写错误（例如想写“cafe/café”）或专有名词（品牌名/用户名等）。"},"examples":[{"en":"I couldn’t find “cafiz” in an English dictionary—did you mean “café”?","zh":"我在英语词典里找不到“cafiz”——你是不是想写“café（咖啡馆）”？"},{"en":"Cafiz is the name of a small app I use for ordering coffee.","zh":"Cafiz 是我用来点咖啡的一个小应用的名字。"}]}],"phonetic":"/kəˈfiz/","extraExplanation":["“cafiz”不太像英语里的常见词根或常用拼写，因此更像是：\n1）把“café / cafe（咖啡馆）”拼错了；\n2）把“coffee（咖啡）”“caffeine（咖啡因）”相关词拼混了；\n3）某个产品/公司/网名的自造词。\n\n如果你告诉我它出现的句子或语境（例如一段对话、标题、商标、菜单），我可以更准确判断你要查的词。"]}
{"word":"cafoy","summary":{"en":"“Cafoy” is not a standard English word; it’s likely a misspelling or a proper name. Provide the sentence for an accurate match.","zh":"“cafoy”不是标准英语单词，可能是拼写错误或专有名词。把它所在的句子发来可帮助准确判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a name. If you meant a different word, tell me the sentence you saw it in, and I’ll identify the closest match.","zh":"不是标准英语单词，可能是拼写错误或人名/地名。如果你是想查另一个词，请把它出现的句子发给我，我可以帮你判断最接近的正确词。"},"examples":[{"en":"I couldn’t find “cafoy” in a dictionary—can you share the full sentence?","zh":"我在词典里找不到“cafoy”，你能把完整句子发我吗？"},{"en":"Did you mean “cajole” or “goof off”? The context will help.","zh":"你是不是想写“cajole（哄骗/劝诱）”或“goof off（摸鱼/混日子）”？看语境更好判断。"}]}],"extraExplanation":["“cafoy”很可能是：\n1）拼写错误（常见：把字母顺序写错、少写/多写一个字母）；\n2）专有名词（人名、网名、地名、品牌名）；\n3）某个小圈子里的俚语/缩写。\n\n你可以回复：它来自哪里（书/电影/聊天/游戏）、大概意思，或给出前后各一两句，我就能更准确地帮你找到目标词。"]}
{"word":"caftan","summary":{"en":"A caftan is a long, loose robe, traditional in several regions and also used as modern fashion.","zh":"caftan 指长而宽松的长袍/罩衫，既有传统服饰含义，也常见于现代时尚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long, loose robe or tunic, often with wide sleeves, worn in parts of the Middle East, North Africa, and also as a modern fashion garment","zh":"（常指中东、北非等地穿的）长而宽松的长袍/外罩衫；也可指现代时尚中的宽松长款连衣裙/罩衫"},"examples":[{"en":"She wore a colorful caftan over her swimsuit at the beach.","zh":"她在海边把一件色彩鲜艳的卡夫坦罩袍穿在泳衣外面。"},{"en":"In the museum, we saw embroidered caftans from Morocco.","zh":"在博物馆里，我们看到了来自摩洛哥的刺绣卡夫坦长袍。"}]}],"synonyms":["kaftan","robe","tunic"],"phonetic":"/ˈkæf.tæn/","extraExplanation":["“caftan”也常拼作“kaftan”，两种拼写都常见。","这个词经由法语等欧洲语言进入英语，最早可追溯到中东与土耳其地区对长袍的称呼；在不同国家，款式、面料与场合（日常、礼仪、宫廷等）会有明显差异。","在现代英语语境里，caftan常被当作一种宽松、飘逸的时尚单品（例如度假、沙滩外搭），使用时注意尊重其文化来源与传统场合。"]}
{"word":"caftan-clad","summary":{"en":"“Caftan-clad” means wearing a caftan, often used in descriptive writing.","zh":"“caftan-clad”意为“身穿长袍的”，多用于描写性文字。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Wearing a caftan (a long, loose robe or tunic).","zh":"身穿长袍（caftan，一种宽松的长袍/长外衣）。"},"examples":[{"en":"A caftan-clad woman greeted the guests at the door.","zh":"一位身穿长袍的女子在门口迎接客人。"},{"en":"He appeared caftan-clad, looking relaxed and elegant.","zh":"他穿着长袍出场，显得轻松又优雅。"},{"en":"The caftan-clad performers moved slowly across the stage.","zh":"身着长袍的表演者缓缓穿过舞台。"}]}],"synonyms":["wearing a caftan","robed","draped"],"phonetic":"/ˈkæf.tæn klæd/","extraExplanation":["“caftan-clad”是由“caftan + clad（穿着……的）”组成的复合形容词，常用于较文学化或描写性的语境。clad 常见搭配还有：snow-clad（白雪覆盖的）、armor-clad（披甲的）。","caftan（也拼作 kaftan）在不同文化中都有出现，常指中东、北非、奥斯曼及部分西非地区的传统宽松长袍；英语写作中使用时，通常带有“长、宽松、飘逸”的视觉印象。"]}
{"word":"caftaned","summary":{"en":"“Caftaned” means dressed in a caftan (a long, loose robe).","zh":"“caftaned”表示“穿着长袍（caftan，一种宽松的长外袍）的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"wearing a caftan (a long, loose robe); dressed in a caftan.","zh":"穿着长袍（caftan，一种宽松的长外袍）；身着长袍的。"},"examples":[{"en":"The caftaned singer walked onto the stage in rich blue silk.","zh":"那位身着长袍的歌手穿着华丽的蓝色丝绸走上舞台。"},{"en":"In the photo, a caftaned host welcomes guests at the door.","zh":"照片里，一位穿着长袍的主人在门口迎接客人。"}]}],"synonyms":["robed","caftan-clad","kaftan-clad"],"phonetic":"/kæfˈtænd/","extraExplanation":["“caftan/kaftan”指一种宽松、长款的外袍，在中东、北非以及奥斯曼与地中海文化中很常见，后来也进入西方时尚语境（如度假装、家居袍风格）。英语里常见两种拼写：caftan 与 kaftan，意思相同。","“caftaned”多用作形容词（= caftan-clad），在文学或描写性写作里更常见，用来营造服饰与文化氛围。"]}
{"word":"caftans","summary":{"en":"“Caftans” is the plural of “caftan,” meaning long, loose robes or dresses, traditional in some cultures and also popular as relaxed fashion wear.","zh":"“Caftans”是“caftan”的复数，指长而宽松的长袍或连衣裙，既是一些地区的传统服饰，也常作为休闲时尚服装。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long, loose robe or dress with wide sleeves, often worn in parts of the Middle East, North Africa, and also used as a relaxed fashion garment elsewhere","zh":"一种长而宽松的长袍或连衣裙，常有宽袖；在中东、北非等地区常见，也被其他地区作为休闲时尚服装穿着"},"examples":[{"en":"She wore a colorful caftan on the beach because it was light and comfortable.","zh":"她在海边穿了一件色彩鲜艳的卡夫坦长袍，因为轻薄又舒服。"},{"en":"In Morocco, traditional caftans are often worn at weddings and celebrations.","zh":"在摩洛哥，传统卡夫坦长袍常在婚礼和庆典上穿。"},{"en":"The museum displayed a silk caftan decorated with detailed embroidery.","zh":"博物馆展出了一件带精美刺绣的丝质卡夫坦长袍。"}]}],"synonyms":["kaftans","robes","tunics"],"phonetic":"/ˈkæfˌtæn/","extraExplanation":["“Caftan / kaftan”常见两种拼写，指的都是类似的宽松长袍；英语里“caftans”是复数形式（多件卡夫坦长袍）。","这种服饰名称源自中东与奥斯曼文化圈，后来在北非（如摩洛哥）与西方时尚语境中也很常见：在西方常指适合度假、居家或海边穿的宽松长裙/罩衫。"]}
{"word":"cafuso","summary":{"en":"A historical Brazilian term for a person of mixed African and Indigenous ancestry; now often considered outdated in modern writing.","zh":"巴西历史用语，指非洲裔与原住民混血的人；现代写作中常被认为过时，使用需谨慎。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Brazil, historical) A person of mixed African and Indigenous (often Amerindian) ancestry; a term used in older racial classification systems.","zh":"（巴西，历史用语）指非洲裔与原住民（常指美洲原住民）混血的人；常见于旧式的种族分类体系中。"},"examples":[{"en":"In some older Brazilian texts, “cafuso” appears alongside terms like “mulato” and “mameluco.”","zh":"在一些较早的巴西文本中，“cafuso”常与“mulato（黑白混血）”和“mameluco（欧裔与原住民混血）”等词并列出现。"},{"en":"Today, many writers avoid the word “cafuso” because it can sound outdated or reductive.","zh":"如今，许多作者会避免使用“cafuso”，因为它可能显得过时，或把人简化为“血统分类”。"}]}],"synonyms":["(neutral) person of mixed African and Indigenous ancestry","(contextual) Afro-Indigenous person","(historical, Brazil) cafuzo (Portuguese spelling)"],"phonetic":"/kəˈfuːzoʊ/","extraExplanation":["“cafuso”主要是葡萄牙语（巴西）语境中的词，英语里很少单独使用，通常出现在讨论巴西历史、殖民时期社会结构或旧式“种族类别”术语的文章中。","由于这些词与殖民历史和社会等级相关，现代语境中使用时需要非常谨慎：最好说明是“历史术语/旧称”，并优先使用更中性的表达，例如“a person of mixed African and Indigenous ancestry（非洲裔与原住民混血的人）”。","如果你是在阅读巴西相关资料：传统分类里常见的对应词还有“mulato（非洲裔与欧洲裔混血）”“mameluco/caboclo（欧洲裔与原住民混血）”；不同地区、时期含义与用法可能有差异。"]}
{"word":"Café","summary":{"en":"a place to buy coffee and light food","zh":"卖咖啡与简餐的地方"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small restaurant where you can buy coffee, tea, and light meals.","zh":"咖啡馆；小餐馆（卖咖啡、茶和简餐）"},"examples":[{"en":"Let’s meet at a café after class.","zh":"下课后我们在一家咖啡馆见吧。"},{"en":"This café serves sandwiches and salads.","zh":"这家咖啡馆提供三明治和沙拉。"}]}],"synonyms":["coffee shop","coffeehouse","bistro","cafe"],"phonetic":"/kæˈfeɪ/","extraExplanation":["拼写提示：英语里 café 常写成带重音符号的 é，表示法语来源；但在日常英文里也常见 cafe（不带重音）。","文化小贴士：在美式英语里，café 通常指环境较舒适、以咖啡为主、可点简餐的店；cafeteria 更像“自助食堂”。"],"etymology":"来自法语 café（咖啡；咖啡馆），与 coffee 同源，最早指“咖啡”，后来常指“卖咖啡的地方”。英语中常保留重音符号 é（café），用来区分 cafe（咖啡馆）与 cafe/cafeteria 等更泛的用法。","mnemonic":["把 café 想成“咖啡”的前两字“咖啡”= caf-，最后的 é 像“点一下”（accent）提醒你：这是法语味的“咖啡馆”。","联想：去 café 常常是“看书/聊天/工作”，记成“咖啡+氛围”。"]}
{"word":"café","summary":{"en":"A café is a place where you can buy coffee and light food; sometimes it can also mean coffee itself.","zh":"café 指咖啡馆（卖咖啡和简餐的地方）；有时也可指咖啡这种饮料本身。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small restaurant or coffee shop where people buy and drink coffee, tea, and light meals.","zh":"咖啡馆；小餐馆（卖咖啡、茶和简餐的地方）"},"examples":[{"en":"Let’s meet at a café near the station.","zh":"我们在车站附近的一家咖啡馆见吧。"},{"en":"She ordered a sandwich at the café.","zh":"她在咖啡馆点了一个三明治。"}]},{"partOfSpeech":"n.","definition":{"en":"Coffee (the drink), especially when talked about in a casual or European style.","zh":"咖啡（饮料；常带有较随意或欧式语境的说法）"},"examples":[{"en":"Would you like a café with your dessert?","zh":"你想配甜点来杯咖啡吗？"}]}],"synonyms":["coffee shop","cafe","bistro"],"phonetic":"/kæˈfeɪ/","extraExplanation":["在英语里既可以写作 cafe（更常见于日常拼写），也可以写作 café（带重音符号，强调其法语来源）。两者意思相同。","在美式英语中，café 通常指提供咖啡与简餐的店；如果是更正式的“餐厅”，常用 restaurant。"]}

