{"word":"cag","summary":{"en":"“cag” is a rare dialect verb meaning “annoy/tease,” and “CAG” is more commonly an abbreviation whose meaning depends on context.","zh":"“cag”是较少见的方言动词，意为“惹恼/逗弄”；更常见的是大写“CAG”，作为缩写需结合语境理解。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Scottish/Irish English, informal) To annoy, bother, or tease someone.","zh":"（苏格兰/爱尔兰英语，非正式）惹恼；打扰；逗弄（某人）。"},"examples":[{"en":"Stop cagging me—I’m trying to work.","zh":"别来烦我——我在工作。"},{"en":"He kept cagging his sister until she shouted at him.","zh":"他一直逗他妹妹，直到她对他大喊。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation for various phrases or titles (meaning depends on context).","zh":"多种词组或头衔的缩写（具体含义取决于语境）。"},"examples":[{"en":"In this report, CAG stands for “Comptroller and Auditor General.”","zh":"在这份报告里，CAG 代表“审计长（Comptroller and Auditor General）”。"},{"en":"The lab studies the CAG repeat in certain genes.","zh":"实验室研究某些基因中的 CAG 重复序列。"}]}],"synonyms":["annoy","bother","tease","irritate"],"phonetic":"/kæɡ/","extraExplanation":["“cag”作为动词在现代标准美式英语里很少见，更多见于苏格兰/爱尔兰的口语或方言；在美国日常交流中通常用 annoy / bother / tease 来表达。","大写“CAG”常见于专业语境（政府机构头衔、医学/遗传学中的碱基序列C-A-G等）。看到它时要结合文章主题判断。"]}
{"word":"Cagayan","summary":{"en":"Cagayan is a Philippine place name most commonly referring to a northern province, and also to the country’s longest river and the valley region named after it.","zh":"Cagayan 是菲律宾的地名，最常指北部的卡加延省；也可指菲律宾最长的卡加延河，以及以该河命名的卡加延河谷地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A province in the northern Philippines (Luzon), known for its coastline, agriculture, and as part of the Cagayan Valley region.","zh":"（专有名词）菲律宾吕宋岛北部的一个省，临海，以农业等闻名，属于“卡加延河谷（Cagayan Valley）”区域的一部分。"},"examples":[{"en":"She grew up in Cagayan and moved to Manila for college.","zh":"她在卡加延长大，后来去马尼拉上大学。"},{"en":"Cagayan is in the northeastern part of Luzon.","zh":"卡加延位于吕宋岛的东北部。"}]},{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A major river in northern Luzon, Philippines; it is the longest river in the country and flows through the Cagayan Valley.","zh":"（专有名词）菲律宾北吕宋的一条重要河流——卡加延河；它是菲律宾最长的河流，流经卡加延河谷。"},"examples":[{"en":"The Cagayan River is central to farming in the valley.","zh":"卡加延河对河谷地区的农业至关重要。"},{"en":"They crossed the Cagayan River during the rainy season.","zh":"他们在雨季时渡过卡加延河。"}]},{"partOfSpeech":"n.","definition":{"en":"(Proper noun) The Cagayan Valley, a large region in northern Luzon named after the river.","zh":"（专有名词）卡加延河谷：菲律宾北吕宋的一个大区域，以卡加延河得名。"},"examples":[{"en":"Cagayan Valley is one of the major agricultural areas in the Philippines.","zh":"卡加延河谷是菲律宾主要的农业区之一。"}]}],"synonyms":["Cagayan Province","Cagayan River","Cagayan Valley"],"phonetic":"/kɑɡaɪˈɑn/","extraExplanation":["“Cagayan”在英文里通常是地名（专有名词），最常见指菲律宾的卡加延省；但在新闻、地理或旅游语境中，也可能指卡加延河或卡加延河谷地区。判断含义时可以看搭配词：province（省）、river（河）、valley/region（河谷/地区）。","英文写作中它一般首字母大写：Cagayan。若要更明确，可写作 Cagayan Province / Cagayan River / Cagayan Valley。"]}
{"word":"cagayan","summary":{"en":"Cagayan refers to a province in northeastern Luzon, Philippines, and can also refer to the Cagayan River in the Cagayan Valley.","zh":"Cagayan（卡加延）指菲律宾吕宋岛东北部的卡加延省，也可指卡加延谷中的卡加延河。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a province in the northeastern Philippines (Luzon), known for the Cagayan River and for being part of the Cagayan Valley region","zh":"菲律宾（吕宋岛）东北部的一个省，以卡加延河闻名，并属于卡加延谷地区"},"examples":[{"en":"She moved to Cagayan for work and now lives near Tuguegarao City.","zh":"她为了工作搬到卡加延，现在住在图格加劳市附近。"},{"en":"Farmers in Cagayan grow rice, corn, and tobacco.","zh":"卡加延的农民种植水稻、玉米和烟草。"}]},{"partOfSpeech":"other","definition":{"en":"the Cagayan River, the longest river in the Philippines, flowing through the Cagayan Valley","zh":"卡加延河：菲律宾最长的河流，流经卡加延谷"},"examples":[{"en":"The Cagayan River floods during strong typhoons.","zh":"遇到强台风时，卡加延河会发生洪水。"},{"en":"Many towns developed along the Cagayan River because of trade and farming.","zh":"由于贸易和农业，许多城镇沿卡加延河发展起来。"}]}],"synonyms":["Cagayan Valley","Cagayan River"],"phonetic":"/kɑɡɑˈjɑn/","extraExplanation":["“Cagayan”常被认为源自伊巴纳格语（Ibanag）或相关语言中的词根（常见解释与“河流/水道”有关），因为该地区以卡加延河为核心。","注意不要和“Cagayan de Oro（卡加延德奥罗）”混淆：后者是菲律宾棉兰老岛的一座城市，地理位置不同。"]}
{"word":"cagayans","summary":{"en":"“Cagayans” means people from Cagayan (Philippines), sometimes more broadly from the Cagayan Valley region.","zh":"“Cagayans”指来自菲律宾卡加延省的人；有时也泛指来自卡加延河谷地区的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people from Cagayan (a province in the Philippines); residents of Cagayan","zh":"来自菲律宾卡加延省（Cagayan）的人；卡加延省居民"},"examples":[{"en":"Many Cagayans speak Ibanag or Ilocano at home.","zh":"许多卡加延人（Cagayans）在家里会说伊巴纳格语或伊洛卡诺语。"},{"en":"The festival draws Cagayans who live in Manila back to their hometowns.","zh":"这个节日吸引住在马尼拉的卡加延人回到家乡。"}]},{"partOfSpeech":"n.","definition":{"en":"(broader, sometimes) people from the Cagayan Valley region in northern Luzon, Philippines","zh":"（较广义、也有人这样用）来自菲律宾吕宋岛北部“卡加延河谷地区”（Cagayan Valley）的人"},"examples":[{"en":"The team has players from different towns, including many Cagayans from the valley.","zh":"这支队伍的球员来自不同城镇，其中包括不少来自河谷地区的卡加延人。"}]}],"synonyms":["Cagayan residents","Cagayano (common local term)"],"phonetic":"/kɑːɡɑːˈjɑːnz/","extraExplanation":["“Cagayans”是专有名词“Cagayan”的复数形式，用来指“卡加延的人”。在英语里，更常见的单数/形容词形式是“Cagayan”（a Cagayan resident）或“Cagayano”（也常见于菲律宾英语/地方用法）。","Cagayan是菲律宾的一个省（在吕宋岛北部），而“Cagayan Valley”是包含多个省的行政区名称；因此在具体语境中，“Cagayans”有时会被用得更广或更窄。"]}
{"word":"Cage","summary":{"en":"A cage is a barred or wired enclosure, and it can also mean to confine someone or something.","zh":"cage 指“笼子/防护罩”，也可作动词表示“把……关起来、限制自由”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A structure made of bars or wire that keeps an animal or person inside.","zh":"（用铁条/铁丝等做的）笼子；用于把动物或人关在里面的围栏结构。"},"examples":[{"en":"The bird stayed quiet in its cage.","zh":"那只鸟在笼子里安静地待着。"},{"en":"The zoo built a larger cage for the tiger.","zh":"动物园为老虎建了一个更大的笼舍。"}]},{"partOfSpeech":"n.","definition":{"en":"A protective framework around something, especially a machine part.","zh":"（尤指机器部件外面的）防护罩；保护性框架。"},"examples":[{"en":"Always put the safety cage back on the fan.","zh":"一定要把风扇的安全护罩装回去。"}]},{"partOfSpeech":"vt.","definition":{"en":"To put someone or something in a cage; to confine.","zh":"把……关进笼子；囚禁；限制（自由）。"},"examples":[{"en":"They caged the rescued animals until they recovered.","zh":"他们把获救的动物关在笼里，直到它们恢复。"},{"en":"He felt caged by the strict rules at work.","zh":"他觉得工作中的严苛规定让他像被关在笼子里一样。"}]}],"synonyms":["enclosure","pen","crate","confine","imprison"],"phonetic":"/keɪdʒ/","extraExplanation":["“cage”常用于比喻，表示“被困住/被束缚”的感觉（例如被规则、责任或环境限制）。这种用法在日常英语里很常见，语气往往带有压抑或无奈。","常见搭配：in a cage（在笼子里/被困住）、cage door（笼门）、safety cage（安全护罩）、feel caged（感到受束缚）。"]}
{"word":"cage","summary":{"en":"Cage means a barred/wired container for keeping something in, or a protective frame; as a verb, it means to confine or restrict.","zh":"cage 指“笼子/囚笼”或“防护罩”，作动词表示“关进笼子、困住、限制”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a structure made of bars or wire that keeps an animal or person inside","zh":"笼子；（用铁条/金属网做的）围栏，用来把动物或人关在里面"},"examples":[{"en":"The bird stayed quiet in its cage.","zh":"那只鸟在笼子里安静地待着。"},{"en":"The police put the dangerous dog in a cage.","zh":"警察把那只危险的狗关进笼子里。"}]},{"partOfSpeech":"n.","definition":{"en":"a protective frame around something, especially a machine part","zh":"（保护用的）罩架；（机器部件的）防护框"},"examples":[{"en":"A metal cage protects the fan blades.","zh":"金属防护罩保护风扇叶片。"}]},{"partOfSpeech":"vt.","definition":{"en":"to confine someone or something in a cage; to trap or restrict","zh":"把……关进笼子；困住；限制（自由或行动）"},"examples":[{"en":"They caged the wild animal for treatment.","zh":"他们把野生动物关进笼子里治疗。"},{"en":"She felt caged by the strict rules at home.","zh":"她觉得家里严格的规矩让她像被关在笼子里一样。"}]}],"synonyms":["enclosure","pen","crate","confine","trap"],"phonetic":"/keɪdʒ/","extraExplanation":["“feel caged”常用来形容一种心理感受：被束缚、没有选择、缺少自由。它不一定是真的被关起来，而是强调压力或限制带来的“像在笼子里”的感觉。","词源上，cage来自法语/拉丁语系词，和“笼、围起”有关；因此它既可指真实的笼子，也可引申为对自由的限制。"]}
{"word":"caged","summary":{"en":"“Caged” means trapped or confined (literally in a cage or figuratively feeling restricted).","zh":"“caged”表示被关在笼子里或被困住；也可比喻感到受限制、压抑。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Confined in a cage or trapped so you cannot move or act freely.","zh":"被关在笼子里；被困住，无法自由行动。"},"examples":[{"en":"The bird looked caged and stressed in the small enclosure.","zh":"那只鸟在狭小的围栏里看起来像被关住了一样，很紧张。"},{"en":"After weeks at home, he felt caged and wanted to go outside.","zh":"在家待了好几个星期后，他觉得自己像被困住了一样，想出去。"}]},{"partOfSpeech":"v.","definition":{"en":"Put into a cage; imprisoned or enclosed.","zh":"把……关进笼子里；监禁或围住。"},"examples":[{"en":"The workers caged the animals for transport.","zh":"工人把动物关进笼子里以便运输。"},{"en":"The suspect was caged in a holding cell.","zh":"嫌疑人被关在临时拘留室里。"}]}],"synonyms":["trapped","confined","imprisoned","cooped up","restricted"],"phonetic":"/keɪdʒd/","extraExplanation":["“caged”既可作形容词（描述状态：被困、受束缚），也可作动词“cage”的过去式/过去分词（表示动作：把……关起来）。在日常英语里，用来形容人的感受时很常见，带有“压抑、憋闷、受限制”的情绪色彩。"]}
{"word":"cageful","summary":{"en":"“Cageful” means the amount that fits in a cage (a cage-full).","zh":"“cageful”指“一笼的量/满满一笼”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the amount that a cage can hold; a cage-full (used as a quantity or measure)","zh":"一笼（所能装下的量）；满满一笼（用作数量单位）"},"examples":[{"en":"They released a cageful of rescued birds back into the wild.","zh":"他们把一笼获救的鸟放回了野外。"},{"en":"The shelter took in a cageful of kittens overnight.","zh":"收容所一夜之间收留了一笼小猫。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) full of cages or filled by cages (usually sounds unusual in modern English)","zh":"（罕见）装满笼子的；被笼子填满的（现代英语中很少这样用，听起来不自然）"},"examples":[{"en":"The back room was cageful and hard to walk through.","zh":"后屋堆满了笼子，走起来很困难。"}]}],"synonyms":["cage-full","a cage full (of)","full cage (context-dependent)"],"phonetic":"/ˈkeɪdʒfəl/","extraExplanation":["“cageful”由名词 cage（笼子）+ 后缀 -ful 组成。-ful 常表示“……的量/满……的量”，比如 a handful（一把）、a spoonful（一勺）、a bagful（一袋）。因此 cageful 最自然的用法是当作名词，表示“满满一笼的数量”。","在日常表达中，人们也常说 a cage full of…（一笼……）来代替 cageful，语气更普通、更常见。"]}
{"word":"cagefuls","summary":{"en":"Cagefuls means “quantities that fill one cage,” usually referring to animals or items in cages.","zh":"Cagefuls 指“装满一个笼子的数量”，多用于笼中动物或物品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of cageful: amounts/quantities that fill one cage (often used for animals, birds, or items kept in cages).","zh":"cageful 的复数：装满一个笼子的数量（常用于动物、鸟类或放在笼中的物品）。"},"examples":[{"en":"The rescue center received two cagefuls of injured birds after the storm.","zh":"暴风雨过后，救助中心接收了两笼受伤的鸟。"},{"en":"They transported several cagefuls of rabbits to the farm.","zh":"他们把好几笼兔子运到了农场。"}]}],"synonyms":["cages (of)","cage-loads","cageful quantities"],"phonetic":"ˈkeɪdʒfʊlz","extraExplanation":["“cageful”由名词 cage（笼子）+ 后缀 -ful（“满……的量”）构成，表示“装满一个笼子的量”。变复数时加 -s：cagefuls。","这种结构常见于量词表达：a handful（一把）、a bagful（一袋）、a cupful（一杯）等。日常口语里也可以更直接说 two cages of birds（两笼鸟）。"]}
{"word":"cageless","summary":{"en":"Cageless means not in a cage, or (figuratively) not restricted—free to move, think, or create.","zh":"cageless 指“不在笼中/未被关住的”，也可比喻“无束缚、自由的（行动、思想或创造力）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not kept in a cage; free to move without being confined.","zh":"不在笼子里的；不被关住的；自由活动的。"},"examples":[{"en":"The birds are cageless now, flying wherever they want.","zh":"这些鸟现在不在笼里了，想飞到哪里就飞到哪里。"},{"en":"She prefers a cageless lifestyle, with as few rules as possible.","zh":"她更喜欢一种“无笼”的生活方式，规则越少越好。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Not restricted or controlled; free in thought, emotion, or creativity.","zh":"（比喻）不受限制的；不被控制的（思想、情感或创造力更自由）。"},"examples":[{"en":"His imagination felt cageless after he left the strict school.","zh":"离开那所严格的学校后，他的想象力仿佛不再受束缚。"},{"en":"The novel celebrates a cageless spirit that refuses to be owned.","zh":"这部小说歌颂了一种拒绝被占有的“无笼”精神。"}]}],"synonyms":["free","unconfined","unrestricted","uncaged","unfettered"],"phonetic":"/ˈkeɪdʒləs/","extraExplanation":["“cageless”由 cage（笼子）+ -less（没有……的）构成，常见于文学或表达性写作里，比日常口语更“诗意”。","使用提示：形容动物时多为字面意思；形容人或思想时多为比喻，接近 free / unconfined / unrestricted。","搭配建议：cageless birds（无笼之鸟）、cageless mind（不受束缚的心灵）、a cageless spirit（自由的精神）。"]}
{"word":"cagelike","summary":{"en":"“Cagelike” means cage-like: enclosed and confining, often making someone feel trapped.","zh":"“cagelike”指“像笼子一样的”：封闭、受限，常让人有被困住的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like a cage; enclosed, confining, or made of bars (often describing a space, structure, or feeling).","zh":"像笼子一样的；被围住、受限制的；（常指空间/结构或感受）像被关在笼里。"},"examples":[{"en":"The small office felt cagelike with its narrow walls and locked windows.","zh":"那间小办公室墙很窄、窗户又锁着，让人感觉像笼子一样压抑。"},{"en":"He described the subway car as cagelike during rush hour.","zh":"他形容高峰期的地铁车厢像笼子一样拥挤难受。"}]}],"synonyms":["confined","cramped","claustrophobic","boxed-in","enclosed"],"phonetic":"/ˈkeɪdʒˌlaɪk/","extraExplanation":["“cagelike”是由 cage（笼子）+ -like（像……一样）构成的形容词，常用于比喻“压抑、受困、缺乏自由”的感觉。比起单说 “small/closed”，它更强调“被困住”的心理体验。"]}
{"word":"cageling","summary":{"en":"A poetic/old-fashioned word meaning an animal kept in a cage, especially a caged bird.","zh":"一个较诗意/古旧的词，指笼中动物，尤指笼中鸟。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bird or other animal kept in a cage; a captive creature (often used in a poetic or old-fashioned way).","zh":"笼中鸟（或笼中动物）；被关住的生灵（常见于诗意或较古旧的用法）。"},"examples":[{"en":"The old poem describes a cageling singing for freedom.","zh":"那首老诗写到一只笼中鸟为自由而歌。"},{"en":"After the rescue, the cageling was released back into the wild.","zh":"救援之后，那只笼中动物被放归野外。"}]}],"synonyms":["captive","caged bird","prisoner (figurative)"],"phonetic":"/ˈkeɪdʒlɪŋ/","extraExplanation":["“cageling”由“cage（笼子）+ -ling（小……的人/物）”构成，-ling 常带有“小、弱、惹人怜爱”的语感（如 duckling 小鸭）。因此它不只是“被关着”，也常暗含“弱小、受困、可怜”的色彩。","这个词在现代日常英语里不常用，更常见的是“caged bird / captive”或更具象的“a bird in a cage”。在文学或修辞中用“cageling”，能更强烈地突出“被困、渴望自由”的意象。"]}
{"word":"cagelings","summary":{"en":"“Cagelings” is the plural of “cageling,” meaning small creatures kept in a cage, or (figuratively) people who are confined or controlled.","zh":"“cagelings”是“cageling”的复数，指笼中小动物/小生物；也可比喻受束缚、被控制、缺乏自由的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) small animals or creatures kept in a cage; sometimes used affectionately or humorously.","zh":"（复数）笼中小动物/小生物；有时带有亲昵或幽默意味。"},"examples":[{"en":"The children checked on their cagelings every morning before school.","zh":"孩子们每天上学前都会去看看他们笼里的小动物。"},{"en":"She cleaned the cage carefully so her cagelings would stay healthy.","zh":"她仔细清理笼子，好让她的小家伙们保持健康。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative, often literary) people who are confined or controlled, like prisoners or those with little freedom.","zh":"（比喻，常见于文学语境）像被关押的人一样受束缚、被控制、缺乏自由的人。"},"examples":[{"en":"In the poem, the city’s workers are described as cagelings of routine.","zh":"在那首诗里，城市工人被描写成被日常困住的“笼中人”。"},{"en":"They refused to live as cagelings of fear and silence.","zh":"他们拒绝做恐惧与沉默的“笼中人”。"}]}],"synonyms":["caged animals","captives","prisoners","the confined","the imprisoned"],"phonetic":"/ˈkeɪdʒlɪŋz/","extraExplanation":["“cagelings”来自“cage（笼子）+ -ling（表示‘小的/幼小的/某类人或物’的后缀）”。这个词在现代英语里不算常见，更多见于创意写作、诗歌或带点俏皮的表达。","比喻用法通常带有情绪色彩：强调被限制、被操控、失去自主。写作中可用来制造强烈意象，但在正式场合更常用 prisoners / captives / the confined 等更常规的词。"]}
{"word":"cageman","summary":{"en":"A rare term meaning either a mine cage operator or, informally, a cage-fighting (MMA) competitor.","zh":"一个较少见的词，可指矿井“升降笼”操作员，也可在口语中指笼中格斗（MMA）选手。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare) A person who works in or operates a cage-like lift or enclosure, especially the metal “cage” elevator used in a mine.","zh":"（罕见）操作或在笼式升降机/围栏中工作的人，尤指矿井里用来升降人员与矿车的金属“笼式电梯”（cage）。"},"examples":[{"en":"In older mining reports, the cageman controlled the cage to bring miners up safely.","zh":"在较早的采矿报告中，cageman 负责操控升降笼，把矿工安全送上来。"},{"en":"The shift ended when the cageman signaled that the cage was ready to move.","zh":"当 cageman 发出升降笼可以启动的信号时，这一班就结束了。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) A fighter who competes in a cage, especially in mixed martial arts (MMA).","zh":"（非正式）在铁笼中比赛的格斗选手，尤指综合格斗（MMA）选手。"},"examples":[{"en":"He trained for months to become a better cageman.","zh":"他训练了几个月，想成为更强的笼斗选手。"},{"en":"The documentary follows young cagemen trying to break into professional MMA.","zh":"这部纪录片追踪了想打进职业 MMA 的年轻笼斗选手。"}]}],"synonyms":["cage operator","mine hoist operator","cage fighter","MMA fighter"],"phonetic":"/ˈkeɪdʒmən/","extraExplanation":["“cageman”通常写作一个词，也可能写作“cage man”。在矿业语境中它更偏职业称呼；在现代口语里，受 MMA 文化影响，有时用来指“笼中格斗者”。","词根很好理解：cage（笼子/笼式升降机）+ man（人）。在正式写作中，若指 MMA 选手，更常见的说法是 “MMA fighter” 或 “cage fighter”。"]}
{"word":"cageot","summary":{"en":"A cageot is a small wooden crate for transporting fruits or vegetables (a French-derived word).","zh":"cageot 指装运水果或蔬菜的小木箱（源自法语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small (often slatted) wooden crate or box used for packing and carrying fruits or vegetables","zh":"（常指有缝隙的）小木箱／板条箱，用来装运水果或蔬菜"},"examples":[{"en":"The vendor stacked apples in a wooden cageot.","zh":"摊贩把苹果堆放在一个木制小箱（cageot）里。"},{"en":"At the market, peaches arrived in cageots to keep them from bruising.","zh":"在市场上，桃子用cageot装运，以免被压伤。"}]}],"synonyms":["crate","wooden crate","produce crate","box"],"phonetic":"/kɑˈʒoʊ/","extraExplanation":["“cageot”是法语外来词，主要在谈论法国市集、餐饮供应链或法式语境时出现；英语里更常用的说法是“crate / wooden crate / produce crate”。","词源上与法语“cage（笼子）”有关，暗示这种箱子常是“有条缝、透气”的结构，方便通风、减轻重量，也便于观察里面的果蔬。"]}
{"word":"cager","summary":{"en":"“Cager” usually means a basketball player (an old-fashioned term); less commonly, it can mean someone or something kept in a cage.","zh":"“cager”通常指（较旧的说法）篮球运动员；较少见时也可指被关在笼子里的（人或动物）或负责关笼的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A basketball player (old-fashioned or sports-journalism slang).","zh":"（较旧或体育报道用语）篮球运动员。"},"examples":[{"en":"Back in the 1940s, people sometimes called basketball players “cagers.”","zh":"在20世纪40年代，人们有时会把篮球运动员称为“cagers”。"},{"en":"The young cager scored 18 points in his first varsity game.","zh":"这位年轻的篮球小将第一次参加校队比赛就拿了18分。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or animal kept in a cage; someone who cages animals.","zh":"被关在笼子里的人或动物；（少见）把动物关进笼子的人。"},"examples":[{"en":"The rescued bird was a cager for years before it was freed.","zh":"这只被救的鸟在获救前被关在笼子里多年。"},{"en":"At the shelter, staff asked the cager to transfer the cat gently.","zh":"在收容所，工作人员请负责关笼的人轻柔地转移那只猫。"}]}],"synonyms":["basketball player","hooper","player","captive"],"phonetic":"/ˈkeɪdʒər/","extraExplanation":["“cager”最常见的用法来自早期篮球：当时一些球场周围会用铁丝网或围栏围起来，像“笼子（cage）”一样，球不容易飞出场外，所以篮球运动员被称为“cagers”。现在这个说法偏复古，更多见于老文章或怀旧语境。"]}
{"word":"cagers","summary":{"en":"“Cagers” is the plural of “cager,” meaning either animal keepers who work with cages or (informally, older usage) basketball players.","zh":"“cagers”是“cager”的复数，可指看管笼中动物的人，也可（非正式、较旧）指篮球运动员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) People who keep, raise, or display animals in cages (such as zoo workers or animal handlers).","zh":"（复数）把动物关在笼中饲养、看管或展示的人（如动物园工作人员、饲养员等）。"},"examples":[{"en":"The zookeepers and other cagers checked the locks twice before leaving.","zh":"动物园饲养员和其他看管笼舍的人在离开前把锁检查了两遍。"},{"en":"The cagers cleaned the bird cages every morning.","zh":"这些看管人员每天早上都会清理鸟笼。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) Basketball players; people playing basketball (especially in older writing, comparing the court to a ‘cage’).","zh":"（非正式）篮球运动员；打篮球的人（较旧的说法，把球场比作“笼子”）。"},"examples":[{"en":"The cagers practiced their defense for the big game.","zh":"这些篮球队员为重要比赛练习防守。"},{"en":"In early sports reports, the players were often called “cagers.”","zh":"在早期的体育报道里，球员常被称为“cagers”。"}]}],"synonyms":["zookeepers","animal handlers","basketball players","hoopers"],"phonetic":"/ˈkeɪdʒər/","extraExplanation":["“cager(s)”作为“篮球运动员”的用法带有年代感：早期一些篮球场周围会用铁丝网或围栏围起来，像“笼子”一样，因此球员被称为cagers。现代英语更常说basketball players、hoopers。"]}
{"word":"cages","summary":{"en":"“Cages” most often means the plural of “cage”: bar or wire enclosures for animals (or confinement). It can also refer to protective frameworks, and it’s used metaphorically for feeling trapped.","zh":"“cages”最常见是“cage”的复数：关动物（或囚禁）的笼子；也可指机器的保护框架；还常用作比喻，表示“感到被困/被束缚”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a structure made of bars or wire used to keep an animal or person inside, or to protect something","zh":"笼子；囚笼（用金属栏杆或铁丝做成，用来关住动物/人，或保护某物的结构）"},"examples":[{"en":"The birds were kept in small cages.","zh":"这些鸟被关在小笼子里。"},{"en":"The zoo uses larger cages to give animals more space.","zh":"动物园使用更大的笼舍，让动物有更多空间。"}]},{"partOfSpeech":"n.","definition":{"en":"a protective framework around something (often metal), especially around a machine part","zh":"（保护用的）金属框架/护罩（常指机器部件外的保护结构）"},"examples":[{"en":"A safety cage protects the fan blades.","zh":"安全护罩可以保护风扇叶片。"}]},{"partOfSpeech":"vt.","definition":{"en":"to put an animal or person into a cage; to confine","zh":"把……关进笼子；禁锢；囚禁"},"examples":[{"en":"They caged the stray dog until the owner came.","zh":"他们把流浪狗暂时关进笼子，直到主人来领。"},{"en":"He felt caged by the strict rules at home.","zh":"他觉得家里严格的规矩让他像被关在笼子里一样。"}]}],"synonyms":["enclosures","pens","crates","confinement","trap (figurative)"],"phonetic":"/ˈkeɪdʒɪz/","extraExplanation":["“cages”通常是名词复数（many cages）。也可能是动词第三人称单数（He cages the animals），但更常见的写法是句子里出现动词“cage”的变化形式。","比喻用法很常见：feel caged / be caged 常表示“感到被束缚、没有自由”。这种用法在文学作品里常用来表达压抑或被控制的心理状态。"]}
{"word":"cagester","summary":{"en":"A rare/nonstandard noun meaning a person who cages or keeps someone/animals confined.","zh":"一个少见/不规范名词，指把人或动物关进笼子、负责看守/笼养的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare or nonstandard word that can be understood as “someone who puts a person or animal into a cage” (a captor/jailer), or “someone who works with cages” (e.g., handling caged animals).","zh":"一个很少见/不规范的词，一般可理解为“把人或动物关进笼子的人”（抓捕者/看守/狱卒），或“从事笼具相关工作的人”（如管理笼养动物的人）。"},"examples":[{"en":"In the story, the hero escapes from the cagester who kept him locked up.","zh":"在故事里，英雄从把他关起来的“cagester”（看守/抓捕者）手中逃脱了。"},{"en":"The rescued birds were taken away from an irresponsible cagester.","zh":"获救的鸟被从一个不负责任的“cagester”（笼养者/看管者）那里带走了。"}]}],"synonyms":["jailer","captor","keeper","warden","zookeeper"],"phonetic":"ˈkeɪdʒɛstɚ","extraExplanation":["“cagester”并不是常见英语词汇，很多词典里查不到；更可能是作者自造词、网名，或把别的词拼错了。","如果你是在特定文本/游戏/社群里看到它，含义通常要结合上下文：是“关押者/看守”还是“饲养或管理笼中动物的人”。你可以把原句发我，我能更准确判断。"]}
{"word":"cagework","summary":{"en":"Cagework is a lattice-like framework of interlaced bars, often used in architecture; it can also mean a confining system (figuratively).","zh":"Cagework 指由交错条杆组成的网格状框架（多见于建筑装饰/支撑）；也可比喻束缚人的体系或框架。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A lattice-like framework made of interlaced bars, ribs, or strips (often used in architecture or construction for support or decoration).","zh":"（常用于建筑/结构中的）笼状格构；由交错的杆、肋或条组成的网格状框架，用于支撑或装饰。"},"examples":[{"en":"The balcony railing had delicate cagework in wrought iron.","zh":"阳台栏杆是精致的锻铁格构。"},{"en":"Light filtered through the stone cagework of the window.","zh":"光线透过窗户的石质格构洒进来。"}]},{"partOfSpeech":"n.","definition":{"en":"Figuratively, a rigid or confining structure or system that limits freedom.","zh":"（比喻）束缚人的结构/体系；令人受限的框架。"},"examples":[{"en":"He felt trapped by the cagework of rules at the new job.","zh":"他觉得新工作的规章制度像笼子一样把人困住了。"}]}],"synonyms":["latticework","grillework","framework","trelliswork"],"phonetic":"/ˈkeɪdʒˌwɝk/","extraExplanation":["“cagework”在艺术与建筑语境里很常见，尤其指窗、屏风、栏杆等处的网格/格栅式装饰与支撑结构；类似词有“latticework”（格子结构），但“cagework”更强调像“笼子”一样由条状构件围合成的框架感。"]}
{"word":"cagey","summary":{"en":"Cagey means cautious and not revealing much, or shrewd and hard to trick.","zh":"cagey 指谨慎不多说（不轻易表态），也可指精明警觉、难以上当。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Careful and cautious, especially in a way that avoids giving too much information or taking clear sides.","zh":"（尤指在表态或提供信息时）谨慎小心的；守口如瓶的；不轻易表态的。"},"examples":[{"en":"When reporters asked about the deal, the CEO gave a cagey answer.","zh":"记者问到这笔交易时，CEO 给了一个很含糊、很谨慎的回答。"},{"en":"She’s cagey about her personal life and doesn’t share much online.","zh":"她对自己的私生活很谨慎，不怎么在网上分享。"},{"en":"The politician stayed cagey, avoiding a direct yes-or-no.","zh":"那位政治人物保持谨慎回避，不正面回答“是或不是”。"}]},{"partOfSpeech":"adj.","definition":{"en":"Hard to catch or trick; shrewd and alert (often used for animals or opponents).","zh":"难以捉摸或难以上当的；精明警觉的（常用于动物或对手）。"},"examples":[{"en":"The fox is a cagey animal, so it rarely comes out in daylight.","zh":"狐狸很警觉狡黠，所以很少在白天出来。"},{"en":"He’s a cagey negotiator who never shows his real bottom line.","zh":"他是个精明的谈判者，从不轻易露出自己的底线。"}]}],"synonyms":["cautious","guarded","wary","reserved","shrewd","crafty"],"phonetic":"/ˈkeɪdʒi/","extraExplanation":["“cagey”常带一点“故意不说清楚”的感觉：不是单纯的“shy（害羞）”，而是出于策略或自我保护而谨慎。","用法提示：cagey about + 名词（对……讳莫如深/很谨慎），例如：cagey about his plans（对他的计划守口如瓶）。","语气一般偏口语，有时略带负面评价（让人觉得你不坦诚）；但在谈判、竞争场景也可以是中性或偏正面（精明、会保护自己）。"]}
{"word":"cageyness","summary":{"en":"Cageyness (more commonly spelled caginess) means cautious secrecy—being careful and not revealing much information.","zh":"cageyness（更常见拼写为 caginess）指谨慎而守口如瓶的态度：说话保留、不轻易透露信息。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being cautious, secretive, or not giving much information","zh":"谨慎而守口如瓶的状态；讳莫如深、话不说透的态度"},"examples":[{"en":"The manager’s cageyness made everyone wonder what was really happening.","zh":"经理那种讳莫如深的态度让大家都怀疑到底发生了什么。"},{"en":"When asked about the deal, she answered with cageyness instead of clear details.","zh":"当被问到那笔交易时，她没有讲清细节，而是显得很谨慎、含糊。"},{"en":"His cageyness in interviews is part of his public image.","zh":"他在采访中的守口如瓶也是他公众形象的一部分。"}]}],"synonyms":["caginess","wariness","reserve","evasiveness","guardedness"],"phonetic":"/ˈkeɪdʒinəs/","extraExplanation":["“cageyness”较少见，更多时候写作“caginess”。两者通常同义：指在谈话或回应中刻意保留信息、保持谨慎。","常见搭配：political caginess（政治上的含糊/回避）、press/interview caginess（面对媒体时的守口如瓶）。"]}
{"word":"caggy","summary":{"en":"Caggy is a rare dialect adjective meaning dirty or soiled, especially with dried dung on animal wool.","zh":"caggy 是很少见的方言形容词，指肮脏、被污物弄脏，尤指动物毛上粘着干结的粪污。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, British dialect) Dirty or soiled, especially with dried dung (for example, on a sheep’s wool).","zh":"（罕见；英式方言）肮脏的、被污物弄脏的；尤指（如羊毛上）粘着干结的粪污。"},"examples":[{"en":"After the long winter, a few sheep were caggy around the tail and needed cleaning.","zh":"漫长的冬天过后，有几只羊尾部附近变得很“caggy”，需要清理。"},{"en":"The farmer checked the flock for any caggy wool that might cause problems.","zh":"农夫检查羊群，看有没有粘了粪污的羊毛，以免出问题。"}]}],"synonyms":["dirty","soiled","grimy"],"phonetic":"/ˈkæɡi/","extraExplanation":["“caggy”在现代英语里非常少见，多见于英国乡村/牧羊相关语境；一般写作或日常交流中不常用。","如果你是在一般文本里看到“caggy”，也有可能是拼写误差：\n- “cagey”（谨慎的、守口如瓶的）\n- “craggy”（多岩的、崎岖的）\n如果你愿意贴出原句，我可以帮你判断最可能是哪一个。"]}
{"word":"cagier","summary":{"en":"“Cagier” means more cautious or more unwilling to reveal information.","zh":"“cagier”表示“更谨慎的/更不愿透露信息的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"More cautious, careful, or unwilling to share information; more secretive or evasive.","zh":"更谨慎的；更不愿透露信息的；更含糊其辞/更回避的。"},"examples":[{"en":"After the reporter asked about the budget, the mayor became cagier.","zh":"记者问到预算后，市长变得更谨慎、也更不愿意多说。"},{"en":"She got cagier about her travel plans once she realized people were watching her account.","zh":"她发现有人在关注她的账号后，对旅行计划就更不愿透露了。"},{"en":"The company has been cagier in recent interviews, avoiding direct answers about the layoffs.","zh":"这家公司最近接受采访时更含糊其辞，回避关于裁员的直接回答。"}]}],"synonyms":["more cautious","more guarded","more secretive","more evasive","warier"],"phonetic":"ˈkeɪɡiər","extraExplanation":["“cagier”是形容词“cagy / cagey”的比较级，意思是“更谨慎/更藏着掖着”。在美式英语里更常见的拼写是“cagey”，但“cagy”也被接受。","它常用于描述人对问题的态度（尤其是被追问时）：不直接说、绕开细节、保持保留。语气不一定是负面的，也可以只是“谨慎”。"]}
{"word":"cagiest","summary":{"en":"“Cagiest” means the most guarded/evasive or the most shrewdly cautious.","zh":"“cagiest”是“cagey”的最高级，表示最谨慎、最有戒心/最含糊，或最精明、最有策略。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Most cautious, guarded, or unwilling to share information; most evasive.","zh":"最谨慎的；最有戒心的；最不愿透露信息的；最闪烁其词的。"},"examples":[{"en":"When reporters asked about the deal, the CEO was the cagiest person in the room.","zh":"记者问到那笔交易时，CEO是房间里最含糊、最不愿多说的人。"},{"en":"She got cagiest whenever the conversation turned to money.","zh":"一谈到钱，她就变得最谨慎、最不愿透露。"}]},{"partOfSpeech":"adj.","definition":{"en":"Most shrewd or clever in a careful, strategic way.","zh":"最精明的；最有策略、最会盘算的。"},"examples":[{"en":"He’s the cagiest negotiator on the team—he never reveals his bottom line too early.","zh":"他是团队里最精明的谈判者——从不会太早亮出底牌。"},{"en":"Among the candidates, she gave the cagiest answers to avoid being misquoted.","zh":"在候选人中，她的回答最谨慎、最有策略，以免被断章取义。"}]}],"synonyms":["most guarded","most evasive","most wary","most cautious","most shrewd"],"phonetic":"/ˈkeɪdʒiɪst/","extraExplanation":["“cagiest”是形容词“cagey”的最高级形式：cagey → cagier → cagiest（拼写规则：以-y结尾时，变比较级/最高级常把y变成i，再加-er/-est）。","“cagey”在口语和新闻语境里很常见，常用来形容对敏感话题（钱、计划、关系、内幕等）“不肯说清楚”的态度。语气通常中性或略带批评。"]}
{"word":"cagily","summary":{"en":"“Cagily” means “in a cautious, guarded way,” often because of doubt or mistrust.","zh":"“cagily”表示“谨慎、带戒备地”，常因怀疑或不信任而小心行事。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a cautious, careful way, especially because you do not fully trust a person or situation.","zh":"（尤指因不信任或不确定而）小心翼翼地，谨慎地。"},"examples":[{"en":"She looked at the offer cagily before agreeing to anything.","zh":"她对这个提议小心翼翼地打量了一番，才决定是否同意。"},{"en":"He answered the reporter’s questions cagily.","zh":"他对记者的问题回答得很谨慎。"}]}],"synonyms":["cautiously","warily","guardedly","circumspectly"],"phonetic":"/ˈkeɪdʒəli/","extraExplanation":["“cagily”来自形容词“cagey”（也常拼作“cagy”），意思是“谨慎的、守口如瓶的”。日常写作中“cagey”更常见；“cagily/cageily”都可作副词拼写，但“cagily”更常见一些。","语气上，“cagily”常带一点“有所保留、怕吃亏或不想透露太多”的感觉，比中性的“carefully（仔细地）”更强调“提防/戒备”。"]}
{"word":"caginess","summary":{"en":"Caginess means being guarded and careful about what you reveal.","zh":"caginess 指“很保留、谨慎不透露信息”的态度或特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being cautious and not revealing much; being guarded or secretive about what you think or know.","zh":"谨慎而不轻易透露信息的特质；说话做事很“保留”、有点神秘或不表态。"},"examples":[{"en":"The manager’s caginess about the budget made the team nervous.","zh":"经理对预算问题很含糊保留，让团队有点紧张。"},{"en":"Her caginess in the interview suggested she was hiding something.","zh":"她在采访中表现得很谨慎回避，似乎在隐瞒什么。"}]}],"synonyms":["guardedness","wariness","evasiveness","reserve"],"phonetic":"/ˈkeɪdʒinəs/","extraExplanation":["“caginess”来自形容词“cagy/cagey”（意为“谨慎、狡黠、守口如瓶”）。在美式英语里常见拼写是“cagey”。它既可以是中性（小心不乱说），也可能带一点负面意味（故意不说实话、回避问题）。","语气辨析：比起“cautious”（谨慎）更强调“不透露/不表态”；比“secretive”（遮遮掩掩）稍微委婉一些。常见搭配：caginess about + 话题（对……很保留/含糊）。"]}
{"word":"caginesses","summary":{"en":"“Caginesses” means instances or forms of caginess: cautious, guarded, or evasive behavior.","zh":"“caginesses”指“caginess（戒备、谨慎、闪烁其词）”的复数：多种或多次表现出来的谨慎与保留。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being cautious and unwilling to share information; wariness or evasiveness","zh":"谨慎而不愿透露信息的状态；戒备、含糊其辞"},"examples":[{"en":"Her caginesses in interviews made reporters suspect she was hiding something.","zh":"她在采访中的种种闪烁其词，让记者怀疑她在隐瞒什么。"},{"en":"In business negotiations, a little caginess can be useful, but too much can damage trust.","zh":"在商务谈判中，适度的谨慎有所帮助，但过度就会损害信任。"}]}],"synonyms":["wariness","guardedness","caution","evasiveness","reticence"],"phonetic":"/ˈkeɪdʒinəsɪz/","extraExplanation":["“caginesses”是名词复数，单数是“caginess”。常见于写作或学术语境，用来强调“多种表现出来的谨慎/戒备”（例如不同场合下的多次回避与保留）。","词源上与“cage（笼子）”有关：像被关在笼子里一样警惕、戒备；在现代英语里多指说话做事“留一手”、不轻易表态。"]}
{"word":"caging","summary":{"en":"“Caging” means putting something in a cage or keeping it confined; it can also mean the process of enclosure or describe something related to confinement.","zh":"“caging”指把某物关进笼子或使其受限；也可指关笼/围住的过程，或作形容词表示与“囚禁、束缚”相关。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “cage”) putting a person or animal into a cage; keeping something confined or restricted.","zh":"（动词 cage 的现在分词）把人或动物关进笼子；使某物受限、被困住。"},"examples":[{"en":"The workers are caging the rescued birds until they recover.","zh":"工作人员把获救的鸟暂时关进笼子里，等它们恢复。"},{"en":"He felt like the strict rules were caging his creativity.","zh":"他觉得严格的规矩在束缚他的创造力。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or process of putting something into a cage; the state of being enclosed.","zh":"把某物装进笼子（或围栏）里的行为/过程；被关住、被围住的状态。"},"examples":[{"en":"The caging of wild animals for entertainment is widely criticized.","zh":"把野生动物关笼用于娱乐的做法广受批评。"},{"en":"Proper caging protects the equipment during shipping.","zh":"合适的框架式包装能在运输中保护设备。"}]},{"partOfSpeech":"adj.","definition":{"en":"used to describe something related to cages or confinement.","zh":"作定语：与笼子或“被困住/被束缚”有关的。"},"examples":[{"en":"The lab has strict caging requirements for the animals.","zh":"该实验室对动物的笼养有严格要求。"},{"en":"She wrote a poem about the caging effect of fear.","zh":"她写了一首诗，描绘恐惧带来的“囚笼效应”。"}]}],"synonyms":["confining","enclosing","imprisoning","restricting","penning up"],"phonetic":"/ˈkeɪdʒɪŋ/","extraExplanation":["“caging”既可以指字面上的“关进笼子”，也常用于比喻：把人的自由、想法、情感“关住”。这种隐喻在写作里很常见，例如说 rules/pride/fear is caging someone’s spirit（规矩/自尊/恐惧在禁锢某人的精神）。","在制造与运输语境中，cage 还可指用金属框架或木条做的“笼状保护架/围框”，所以 caging 也能表示“加装保护框架”的过程。"]}
{"word":"cagit","summary":{"en":"“cagit” is not a recognized standard English word; it’s probably a typo, a name, or an acronym.","zh":"“cagit”不是标准英语词汇；更可能是拼写错误、姓名或缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a typo or a name/acronym. Common possibilities include “cage it” (two words) or “cogitate” (meaning ‘think deeply’).","zh":"不是标准英语单词，可能是拼写错误、姓名或缩写。常见的可能包括两词“cage it”（把……关进笼子里）或“cogitate”（深思）。"},"examples":[{"en":"I couldn’t find “cagit” in a dictionary—did you mean “cogitate”?","zh":"我在词典里找不到“cagit”——你是不是想写“cogitate”（深思）？"},{"en":"If you meant “cage it,” you can say: “Cage it so it can’t escape.”","zh":"如果你想表达“cage it”，可以说：“把它关进笼子里，这样它就跑不掉了。”}],"},{"en":"“CAGIT” can also be an acronym in some fields; the meaning depends on the context (e.g., a company, project, or organization name).","zh":"“CAGIT”也可能在某些领域里作为缩写使用；具体含义取决于上下文（例如公司、项目或组织名称）。"}]}],"phonetic":"/ˈkædʒɪt/","extraExplanation":["如果你能告诉我它出现的句子或语境（例如一整句话、领域/行业、是否为人名或缩写），我可以更准确地判断你想表达的词，并给出正确拼写、发音和用法。"]}
{"word":"Cagle","summary":{"en":"Cagle is most commonly an American surname; it can also be a U.S. place name.","zh":"Cagle 最常见是美国姓氏，也可能作为美国某些地点的地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), mainly found in the United States","zh":"（主要见于美国的）姓氏：Cagle（凯格尔）"},"examples":[{"en":"Dr. Cagle will see you now.","zh":"Cagle 医生现在可以见你了。"},{"en":"My teacher’s last name is Cagle.","zh":"我老师的姓是 Cagle。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name used for some locations (for example, small communities) in the U.S.","zh":"（美国某些地区的）地名：Cagle（常指小社区或地区名）"},"examples":[{"en":"They drove through Cagle on the way to the lake.","zh":"他们去湖边的路上开车经过了 Cagle。"}]}],"phonetic":"/ˈkeɪɡəl/","extraExplanation":["“Cagle”在英语里最常见的用法是姓氏（proper noun）。在口语中通常读作两音节，重音在第一音节：KAY-gəl。","关于姓氏来源：一般认为它与欧洲移民姓氏的拼写变化有关（如德语或瑞士德语背景的姓氏在美国被英语化），但具体到某个家族需要结合家谱记录才能确定。"]}
{"word":"Cagliari","summary":{"en":"Cagliari is a city in Italy and the capital of Sardinia.","zh":"Cagliari（卡利亚里）是意大利城市，也是撒丁岛的首府。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in Italy; the capital of the autonomous region (and island) of Sardinia, on the Mediterranean Sea.","zh":"意大利的一座城市；撒丁岛（自治大区）的首府，位于地中海沿岸。"},"examples":[{"en":"Cagliari is the capital city of Sardinia.","zh":"卡利亚里是撒丁岛的首府。"},{"en":"We flew to Cagliari and then rented a car to explore the island.","zh":"我们飞到卡利亚里，然后租车环岛旅行。"},{"en":"Cagliari has a long history influenced by many Mediterranean cultures.","zh":"卡利亚里的历史悠久，深受多种地中海文化影响。"}]}],"synonyms":["capital of Sardinia","Sardinia (related place)"],"phonetic":"/kɑːlˈjɑːri/","extraExplanation":["英语里它通常作为专有名词使用，首字母大写：Cagliari。","地名读法在英语中常见重音落在中间音节附近；你也可能在旅行英语或新闻里听到略有差异的读音。","卡利亚里常与当地景点或文化一起出现，如 Castello（老城/城堡区）、Poetto（海滩）等。"]}
{"word":"Cagliostro","summary":{"en":"Cagliostro is the name of a famous 18th‑century Italian adventurer/occult charlatan, and it can also mean a glamorous, persuasive fraud.","zh":"Cagliostro既指18世纪意大利著名冒险家/神秘学骗子卡廖斯特罗伯爵，也可引申指“华丽而善辩的骗子”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Count Alessandro di Cagliostro (1743–1795), a famous Italian adventurer and self-styled occult healer/alchemist, widely regarded as a fraud; he became a symbol of an elegant, theatrical “charlatan.”","zh":"卡廖斯特罗伯爵（Count Alessandro di Cagliostro，1743–1795），意大利著名冒险家，自称神秘学治疗师/炼金术士，常被认为是骗子；其名后来成了“华丽而善于表演的江湖术士”的象征。"},"examples":[{"en":"Cagliostro became notorious in Europe for his claims of secret knowledge and miraculous cures.","zh":"卡廖斯特罗因宣称掌握秘密知识并能进行神奇治愈而在欧洲臭名昭著。"},{"en":"In the novel, the villain is modeled on Cagliostro—charming, persuasive, and ultimately deceptive.","zh":"小说里的反派以卡廖斯特罗为原型——有魅力、很会说服人，但最终充满欺骗。"}]},{"partOfSpeech":"n.","definition":{"en":"(by extension) A smooth-talking trickster or charlatan, especially one who uses mystery, “magic,” or fake expertise to deceive people.","zh":"（引申）花言巧语的骗子/江湖术士，尤指利用神秘感、“魔法”或伪专业来欺骗他人的人。"},"examples":[{"en":"Don’t trust that financial Cagliostro—his promises are too good to be true.","zh":"别信那个金融“卡廖斯特罗”——他的承诺好得不真实。"},{"en":"The film uses “Cagliostro” as a shorthand for a glamorous con artist.","zh":"这部电影把“Cagliostro”当作“华丽骗子”的代称。"}]}],"synonyms":["charlatan","impostor","con artist","fraud","trickster"],"phonetic":"/ˌkæliˈɑːstroʊ/","extraExplanation":["“Cagliostro”在英语里多作为历史人物的专名使用；引申义（指骗子）带有文学化、讽刺色彩，语气往往比直接说“fraud/charlatan”更戏剧化。","他与18世纪欧洲的“神秘学热”（炼金术、共济会、灵性疗法等）相关，也常在涉及宫廷阴谋与骗局的作品里被提及。","在文学与文化中，他常被写成魅力十足却不可信的人物原型；例如一些历史小说、戏剧与歌剧会借用他的形象来表现“伪神秘”“骗局”与社会迷恋。"]}
{"word":"cagmag","summary":{"en":"“cagmag” is not a standard English word; it likely needs context or correct spelling.","zh":"“cagmag”不是标准英语单词；需要语境或确认拼写才能确定含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling, username, brand name, or an abbreviation (for example, “CAG” + “mag/magazine”).","zh":"不是标准英语单词；更可能是拼写错误、用户名、品牌名，或由缩写组成（例如“CAG”+“mag/杂志”）。"},"examples":[{"en":"I couldn’t find “cagmag” in a dictionary—could you share the sentence you saw it in?","zh":"我在词典里找不到“cagmag”——你能把你看到它的句子发我吗？"},{"en":"If you meant “mag,” it’s short for “magazine.”","zh":"如果你想写的是“mag”，它是“magazine（杂志）”的缩写。"}]}],"phonetic":"/ˈkæɡmæɡ/","extraExplanation":["“cagmag”在常见英语词典里一般查不到。为了准确解释，我需要更多上下文：你在哪里看到它（游戏/社交媒体/论文/聊天）？它前后有哪些词？","如果你是想输入别的词，常见的相近可能是：\n- mag（magazine 的口语缩写）\n- CAG（常见缩写之一：比如在不同领域可指不同事物）\n把原句贴出来，我可以根据语境判断它具体是什么意思。"]}
{"word":"Cagn","summary":{"en":"“Cagn” is not a standard English word; it’s likely a typo, a name, or an abbreviation.","zh":"“Cagn”不是标准英语单词；很可能是拼写错误、人名或缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a typo, a name, or an abbreviation; please share the sentence or what you meant to type.","zh":"不是标准英语单词。可能是拼写错误、人名或缩写；请提供句子语境或你原本想输入的词。"},"examples":[{"en":"I can’t find “cagn” in an English dictionary—could you check the spelling?","zh":"我在英语词典里找不到“cagn”——你能检查一下拼写吗？"},{"en":"Did you mean “can” or “cage” instead of “cagn”?","zh":"你想写的是“can”还是“cage”，而不是“cagn”？"}]}],"phonetic":"N/A","extraExplanation":["“cagn”在常见英语词典中通常查不到。最常见的情况是：\n1) 拼写误差：比如想输入 can（能；可以）、cage（笼子）、cane（手杖/藤条）等；\n2) 专有名词：可能是人名/地名/用户名；\n3) 缩写：可能属于某个专业领域（游戏、课程、公司内部缩写等）。\n把你看到它的句子发我，我可以更准确判断。"]}
{"word":"cagn","summary":{"en":"“cagn” is not a standard English word; it is likely a typo or abbreviation. Share the context to identify the intended word.","zh":"“cagn”不是标准英语单词，可能是拼写错误或缩写。请提供上下文以确定你想查的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a typo or an abbreviation (for example, you may have meant “can,” “cage,” “cabin,” “cogn-,” or a proper name).","zh":"不是标准英语单词。它很可能是拼写错误或缩写（例如你可能想写“can（能/罐头）”“cage（笼子）”“cabin（小屋/机舱）”“cogn-（认知相关词根）”，或某个专有名词）。"},"examples":[{"en":"I couldn’t find “cagn” in a standard English dictionary—did you mean “can”?","zh":"我在常见英语词典里找不到“cagn”——你是想写“can”吗？"},{"en":"If you tell me the sentence you saw it in, I can identify the correct word.","zh":"如果你把它出现的句子发我，我可以帮你判断正确的单词。"}]}],"extraExplanation":["“cagn”在英语里不是常见词条。最有效的方式是：把你看到它的完整句子（或上下文）贴出来，或者告诉我你想表达的中文意思/场景，我就能判断你实际想查的词。\n\n你也可以先核对是否想输入：\n1) can /kæn/（能；罐头）\n2) cage /keɪdʒ/（笼子；把…关起来）\n3) cabin /ˈkæbɪn/（小木屋；机舱）\n4) cogn-（词根，常见于 cognition/recognize 等，与“认识/认知”有关）"]}
{"word":"Cagney","summary":{"en":"“Cagney” most often refers to James Cagney, a classic American film actor, and it can also be a surname (e.g., Cagney & Lacey).","zh":"“Cagney”最常指美国经典电影演员詹姆斯·卡格尼，也可作姓氏（如《Cagney & Lacey》）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"James Cagney (1899–1986), a famous American film actor known especially for fast-talking, tough, energetic roles—often gangsters—in classic Hollywood movies.","zh":"詹姆斯·卡格尼（James Cagney，1899–1986），美国著名电影演员，以语速快、强悍有冲劲的角色闻名，常在经典好莱坞影片中饰演黑帮或硬汉。"},"examples":[{"en":"James Cagney became iconic for his gangster roles in early Hollywood films.","zh":"詹姆斯·卡格尼因在早期好莱坞电影中的黑帮角色而成为经典。"},{"en":"If you like old crime movies, you’ll probably see Cagney’s name often.","zh":"如果你喜欢老派犯罪片，你大概会经常看到卡格尼的名字。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname; used in names like “Cagney & Lacey” (an American TV series).","zh":"姓氏；也用于名称中，例如《Cagney & Lacey》（一部美国电视剧）。"},"examples":[{"en":"My mom used to watch Cagney & Lacey on TV.","zh":"我妈妈以前常在电视上看《Cagney & Lacey》。"}]}],"phonetic":"/ˈkæɡni/","extraExplanation":["“Cagney”在日常英语里最常指演员James Cagney。他的表演风格影响了后来的“黑帮片/犯罪片”形象塑造，所以在影评或电影史语境中常被当作一种“经典硬汉演员”的文化参照。","常见搭配：James Cagney / Cagney films（卡格尼的电影）/ Cagney-esque（带有卡格尼式风格的：节奏快、强势、充满能量；较少见但在影评中可能出现）。"]}
{"word":"cagot","summary":{"en":"A historical term for an outcast social group in the Pyrenees (France/Spain) who faced long-term discrimination.","zh":"指法国/西班牙比利牛斯地区曾遭长期歧视与隔离的历史贱民群体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A member of a socially excluded group in the Pyrenees region of France and Spain, traditionally treated as an outcast and often forced into segregated living and work.","zh":"（历史）“卡戈人”：法国与西班牙比利牛斯地区中曾被社会排斥的一类群体，长期被视为贱民/异类，常被迫隔离居住与工作。"},"examples":[{"en":"In the village records, Cagots were required to sit in a separate section of the church.","zh":"在村庄的记录中，卡戈人被要求在教堂里坐在单独的区域。"},{"en":"The novel mentions the Cagot community to show how prejudice can persist for centuries.","zh":"小说提到卡戈人社群，用来展示偏见如何延续数百年。"}]}],"synonyms":["outcast (general meaning)"],"phonetic":"/kæˈɡoʊ/","extraExplanation":["“Cagot”是一个带有强烈历史歧视色彩的称呼，通常不用于现代日常自我称谓；在写作或讨论时，多用于历史、社会学或文学语境。","关于卡戈人被排斥的原因，历史上有多种猜测（如被误认为患病、族群来源不同、从事特定行业等），但并没有单一且确定的结论。","在一些文献中，卡戈人被限制与他人通婚、使用公共设施，甚至在教堂有专用入口与固定座位；这些细节常被用来讨论“制度化歧视”。"]}
{"word":"Cagoulard","summary":{"en":"A rare historical term for a member of the French far-right secret group La Cagoule (1930s).","zh":"较少见的历史词，指20世纪30年代法国极右翼秘密组织 La Cagoule（“斗篷党/蒙面组织”）的成员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of La Cagoule, a secret far-right French organization active mainly in the 1930s","zh":"“斗篷党/蒙面组织”（La Cagoule）成员：主要活跃于20世纪30年代的法国极右翼秘密组织成员"},"examples":[{"en":"Historians found evidence that some Cagoulards planned violent attacks against the French government in the 1930s.","zh":"历史学家发现证据表明，一些“斗篷党”成员在20世纪30年代策划过针对法国政府的暴力袭击。"},{"en":"In the novel, the journalist suspects a local businessman is a Cagoulard.","zh":"在小说中，这名记者怀疑一位本地商人是“斗篷党”成员。"}]}],"synonyms":["member of La Cagoule"],"phonetic":"/ˈkæɡuːlɑːrd/","extraExplanation":["“Cagoulard”来自法语，字面与“cagoule（头罩/斗篷）”有关，指该组织成员常以蒙面、秘密方式活动。","La Cagoule 的全名常见作“Comité secret d’action révolutionnaire（秘密革命行动委员会）”。它在法国第三共和国末期活动，与当时的政治极化、反共与反议会情绪有关。","这个词在日常英语里非常少见，多出现在历史著作、政治史文章或文学作品中，用来指涉那个特定组织的成员。"]}
{"word":"Cagoulards","summary":{"en":"Cagoulards are members/supporters of the 1930s French secret far-right group La Cagoule.","zh":"Cagoulards 指20世纪30年代法国秘密极右翼组织“卡古勒党”（La Cagoule）的成员/支持者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"members or supporters of La Cagoule, a secret far-right, anti-republican French organization active mainly in the 1930s","zh":"“卡古勒党”（La Cagoule）成员或支持者；指20世纪30年代法国一个秘密的极右翼、反共和组织的人"},"examples":[{"en":"In the late 1930s, the French government arrested many Cagoulards after uncovering plots of political violence.","zh":"在20世纪30年代末，法国政府揭露了政治暴力阴谋后，逮捕了许多卡古勒党成员。"},{"en":"The novel references Cagoulards to show how extremist groups operated in secret.","zh":"这部小说提到卡古勒党成员，以展现极端团体如何秘密活动。"}]}],"synonyms":["members of La Cagoule","La Cagoule militants","Cagoulard (singular)"],"phonetic":"/kæɡuˈlɑrdz/","extraExplanation":["“Cagoulard”来自法语，源于 la cagoule（意为“头罩、兜帽”）。该组织因秘密行动、成员常以“戴头罩/蒙面”示人而得名。","英语里这个词多见于历史、政治学或文学语境，通常带有强烈的时代与政治指向；日常英语里几乎不用。"]}
{"word":"cagoule","summary":{"en":"A cagoule is a lightweight hooded waterproof jacket (more common in British English).","zh":"cagoule指轻便的连帽防水外套/雨衣（英式英语更常见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lightweight, usually waterproof jacket with a hood (often packable), worn for protection from rain and wind","zh":"（通常防水、轻便、可收纳的）连帽雨衣/防风外套"},"examples":[{"en":"He packed a cagoule in his backpack in case it rained.","zh":"他在背包里塞了一件cagoule，以防下雨。"},{"en":"Wear a cagoule if you’re walking by the sea—wind and spray can get cold.","zh":"如果你要在海边散步就穿上cagoule——海风和浪花会让人觉得冷。"}]},{"partOfSpeech":"n.","definition":{"en":"the hood of a cagoule; a hood-like covering (less common)","zh":"（不常用）cagoule的兜帽；类似兜帽的遮盖物"},"examples":[{"en":"He pulled up the cagoule to keep the rain off his face.","zh":"他把cagoule的兜帽拉起来，挡住雨水打在脸上。"}]}],"synonyms":["rain jacket","waterproof jacket","hooded jacket","windbreaker"],"phonetic":"/kəˈɡuːl/","extraExplanation":["“cagoule”来自法语，原指带兜帽的外衣。该词在英式英语里更常见；在美式英语中，人们更常说“rain jacket / waterproof jacket / windbreaker”。","有些品牌或款式会强调“packable”（可折叠收纳），这也是cagoule常见的使用场景：旅行、徒步、通勤随身备用。"]}
{"word":"CAGR","summary":{"en":"CAGR = Compound Annual Growth Rate, a way to express the average compounded yearly growth over multiple years.","zh":"CAGR=复合年均增长率，用于表示跨多年期间的平均“复合”年度增长速度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Compound Annual Growth Rate: the average yearly growth rate of an investment, company, market, or value over a period of years, assuming the growth happens at a steady (compounded) rate.","zh":"复合年均增长率：衡量某项投资、公司、市场或数值在若干年内的平均年度增长速度，假设增长以稳定的“复利/复合”方式发生。"},"examples":[{"en":"The company’s revenue CAGR was 12% from 2019 to 2024.","zh":"该公司2019到2024年的营收复合年均增长率为12%。"},{"en":"CAGR helps compare growth across different investments over the same time period.","zh":"CAGR有助于在相同时间跨度内比较不同投资的增长表现。"},{"en":"Even if sales went up and down each year, the five-year CAGR shows the overall average growth.","zh":"即使每年销量有起有落，五年期的CAGR仍能体现整体的平均增长水平。"}]}],"synonyms":["compound annual growth rate","annualized growth rate"],"phonetic":"/ˌkɑːm.paʊnd ˌæn.ju.əl ˈɡroʊθ reɪt/","extraExplanation":["CAGR常用于商业与金融报告里，属于“缩写词/首字母缩略词”。读法既可以逐字母读“C-A-G-R”，也常直接说“compound annual growth rate”。","它强调“复合/复利”的概念：用一个稳定的年增长率来概括一段时间的总体增长，适合做横向比较，但可能掩盖中间年份的波动。"]}
{"word":"Caguas","summary":{"en":"Caguas is a city and municipality in Puerto Rico, southeast of San Juan.","zh":"Caguas 是波多黎各的一座城市与自治市，位于圣胡安东南方向。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A city and municipality in Puerto Rico, located in the island’s central valley (often called the \"Valley of Caguas\"), southeast of San Juan.","zh":"卡瓜斯（Caguas）：波多黎各的一座城市与自治市，位于岛屿中部的山谷地带（常称“卡瓜斯谷地”），在圣胡安东南方向。"},"examples":[{"en":"She grew up in Caguas before moving to San Juan for college.","zh":"她在卡瓜斯长大，后来搬到圣胡安上大学。"},{"en":"We drove from San Juan to Caguas in about half an hour.","zh":"我们从圣胡安开车到卡瓜斯，大约半小时。"},{"en":"Caguas is known for its local culture and music events.","zh":"卡瓜斯以其在地文化和音乐活动而闻名。"}]}],"phonetic":"/kəˈɡwɑs/","extraExplanation":["“Caguas”是西班牙语地名，常见读法接近“卡-瓜斯”。在英语语境中通常直接使用原名，不翻译。","卡瓜斯属于波多黎各都会圈的重要城市之一，因位置在山谷、气候较温暖，也常被称为“La Ciudad del Turabo”（图拉沃之城，Turabo与当地河流/地区名相关）。"]}
{"word":"cagui","summary":{"en":"“Cagui” is not a standard English word; it likely needs context or is a misspelling/name.","zh":"“cagui”不是标准英语词；通常需要上下文，或它是拼写错误/专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or a name/word from another language, so its meaning in English cannot be confirmed without context.","zh":"不是标准英语单词。更可能是拼写错误、专有名词，或来自其他语言的词；没有上下文无法确认其英语含义。"},"examples":[{"en":"I can’t find “cagui” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里查不到“cagui”——你能把它出现的句子发我吗？"},{"en":"If you meant “corgi,” it’s a small dog breed with short legs.","zh":"如果你想写的是“corgi（柯基）”，那是一种腿很短的小型犬品种。"}]}],"phonetic":"/kəˈɡwi/","extraExplanation":["“cagui”很可能是以下几类情况之一：\n1）拼写误差：常见相近词包括 corgi（柯基犬）、cagey（讳莫如深/谨慎的）、cahoots（in cahoots：串通）。\n2）人名/地名/品牌名：这类词通常不进普通英语词典。\n3）其他语言的词（例如带重音的拼写、地方语言转写等）。\n\n如果你把它出现的完整句子、来源（书/歌曲/游戏/社交媒体）、以及你想表达的意思发来，我可以更准确判断并给出对应的英文用法。"]}
{"word":"cagy","summary":{"en":"Cagey means cautious and not revealing much, sometimes also shrewd and good at avoiding trouble.","zh":"Cagey 指谨慎、话不说透（有所保留），也可指精明、善于避开麻烦。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Common spelling: **cagey**) careful about what you say or do; not giving much information because you are cautious or secretive.","zh":"（常见拼写：**cagey**）说话或做事很谨慎；因小心或有所隐瞒而不愿透露太多信息。"},"examples":[{"en":"When I asked about the plan, he got cagey and changed the subject.","zh":"我问到计划时，他变得很谨慎，转而换了话题。"},{"en":"The company was cagey about the details of the deal.","zh":"这家公司对交易细节讳莫如深。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) smart and shrewd; good at avoiding problems or traps.","zh":"（较少见）精明的；很会避开麻烦或陷阱的。"},"examples":[{"en":"She’s a cagey negotiator who rarely shows her cards.","zh":"她是个精明的谈判者，很少亮出自己的底牌。"},{"en":"You need to be cagey when buying a used car.","zh":"买二手车时你得精明谨慎。"}]}],"synonyms":["cautious","guarded","secretive","wary","shrewd"],"phonetic":"/ˈkeɪdʒi/","extraExplanation":["你输入的 **cagy** 通常是 **cagey** 的拼写误差。美式英语里 **cagey** 更常见；它常用来形容人“话不说满、信息留一手”。","语气提示：**cagey** 多为中性到略带负面，暗示“有所保留/不太坦诚”；如果想表达更中性的“谨慎”，也可用 **careful** 或 **cautious**。"]}
