{"word":"Cahan","summary":{"en":"Cahan is mainly used as a surname, sometimes linked to the Jewish name tradition meaning “priest.”","zh":"Cahan 主要用作姓氏，有时与犹太姓氏传统相关，词源上有“祭司”的含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname), found especially among Jewish families; sometimes a variant spelling of Cohen/Kahan, originally meaning “priest.”","zh":"一个姓氏，尤其常见于犹太家庭；有时是 Cohen/Kahan 的变体拼写，词源上与“祭司/司祭”有关。"},"examples":[{"en":"Abraham Cahan was a Jewish-American writer and editor.","zh":"亚伯拉罕·卡恩（Abraham Cahan）是一位犹太裔美国作家兼编辑。"},{"en":"My professor’s last name is Cahan.","zh":"我教授的姓是 Cahan。"}]}],"synonyms":["Cohen","Kahan","Kahn","Kohn"],"phonetic":"/kɑˈhɑn/","extraExplanation":["“Cahan”多作为专有名词（姓氏）使用，因此一般不按普通英语词汇来变形或派生。","它常被视为与犹太姓氏 Cohen / Kohn / Kahan 等同源或相关的拼写变体；这些姓在历史上与宗教身份（祭司阶层）有关。","如果你是在阅读文学/历史材料里遇到它，最有名的相关人物之一是 Abraham Cahan（《The Rise of David Levinsky》的作者）。"]}
{"word":"Cahenslyism","summary":{"en":"A historical term for Cahensly’s immigrant-focused Catholic policies, often used pejoratively in U.S. anti-Catholic/nativist debates.","zh":"一个历史术语，指卡恩斯利提出的面向移民的天主教政策；在美国的排外/反天主教论战中常带贬义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A late-19th-century term (mostly in the U.S.) for the ideas associated with Peter Paul Cahensly that Catholic immigrants should be organized and served through their own language-based (ethnic) parishes and schools; the word was also widely used by opponents as an anti-Catholic label implying foreign/Vatican control.","zh":"一个19世纪末（主要在美国）使用的术语，指与彼得·保罗·卡恩斯利（Peter Paul Cahensly）相关的主张：天主教移民应通过以母语为主的“族裔堂区”和学校来组织与牧养；该词也常被反对者用作反天主教的贬义标签，暗示受外国/梵蒂冈操控。"},"examples":[{"en":"Some newspapers attacked the proposal as “Cahenslyism,” claiming it threatened American unity.","zh":"一些报纸把该提议攻击为“Cahenslyism（卡恩斯利主义）”，声称它威胁美国的统一。"},{"en":"In church history discussions, Cahenslyism is linked to debates over ethnic parishes and immigrant identity.","zh":"在教会史讨论中，“Cahenslyism”常与“族裔堂区”和移民身份认同的争论联系在一起。"}]}],"synonyms":["the Cahensly Plan","ethnic-parish movement","nativist anti-Catholic scare term"],"phonetic":"/kəˈhɛnzliˌɪzəm/","extraExplanation":["“Cahenslyism”来自人名 Peter Paul Cahensly（瑞士天主教人士）。19世纪末，美国天主教会内部确实存在“用移民母语牧养、建立族裔堂区/学校”的现实需要；但在当时的排外与反天主教政治氛围中，这个词经常被煽动性地使用，把牧灵与教育安排描绘成“外国势力干预”。","相关说法：the Cahensly Plan（卡恩斯利方案）、ethnic parish（族裔堂区）、nativism（排外主义/本土主义，历史语境中）。"]}
{"word":"cahenslyism","summary":{"en":"Cahenslyism is a historical, often derogatory term for the alleged Catholic-Church control of immigrant Catholics in U.S. politics.","zh":"Cahenslyism 是一个历史性的、常带贬义的词，指当时一些人宣称的“天主教会操控天主教移民并影响美国政治”的说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a late-19th-century American political label (often used as a slur) for the alleged idea that the Catholic Church would control or politically direct Catholic immigrants in the U.S., especially through “national parishes” and clergy who spoke immigrants’ languages","zh":"（多为贬义的政治标签）指19世纪末美国一些人所宣称的“天主教会将控制/指挥天主教移民的政治行为”的所谓主张，常与设立按族裔划分的堂区、由会说移民语言的神职人员管理移民社群等议题联系在一起"},"examples":[{"en":"Some newspapers warned voters about “Cahenslyism,” claiming it would put immigrant Catholics under Church control.","zh":"一些报纸以“Cahenslyism（卡亨斯利主义）”警告选民，声称这会让天主教移民受教会控制。"},{"en":"In the 1890s, the term was used to attack proposals for more language-specific Catholic parishes.","zh":"在19世纪90年代，这个词被用来攻击“建立更多按语言划分的天主教堂区”的提议。"}]}],"synonyms":["nativism","anti-Catholicism","xenophobia"],"phonetic":"/kəˈhɛnzliˌɪzəm/","extraExplanation":["“Cahenslyism”源自彼得·保罗·卡亨斯利（Peter Paul Cahensly），他与保护欧洲天主教移民的牧灵照顾有关。美国的反移民、反天主教言论把相关建议扭曲为“教会操控移民、干预政治”的阴谋论式说法，因此该词在当时常带强烈偏见色彩。","理解该词时要注意历史语境：它更多反映了当时美国社会的本土主义（nativism）与反天主教情绪，而不一定是某个正式、成体系的政治主张。"]}
{"word":"cahier","summary":{"en":"A French loanword meaning “notebook/exercise book”; less commonly, a separate section of a publication.","zh":"法语借词，常指“笔记本/练习本”；较少情况下指出版物中的“分册/专刊”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a notebook (often a school exercise book), especially in French contexts","zh":"（常见于法语语境）笔记本；练习本（尤指学生用）"},"examples":[{"en":"She wrote her vocabulary in a small cahier.","zh":"她把词汇写在一个小练习本里。"},{"en":"For class, bring a cahier and a pen.","zh":"上课请带练习本和笔。"}]},{"partOfSpeech":"n.","definition":{"en":"a separate section of a book, newspaper, or report (less common in everyday English)","zh":"（较少见）书籍、报纸或报告中的分册；专刊；分区"},"examples":[{"en":"The magazine included a special cahier on contemporary art.","zh":"这本杂志包含一期关于当代艺术的专刊。"}]}],"synonyms":["notebook","exercise book","workbook","section","supplement"],"phonetic":"/kæˈjeɪ/","extraExplanation":["“cahier”是法语借词，法语里非常常用，尤其指学生的“练习本/作业本”。在英语里也能见到，但多出现在讨论法国教育、法语学习、出版物结构等语境中。"]}
{"word":"cahiers","summary":{"en":"“Cahiers” means notebooks/exercise books, and it can also refer to historical “cahiers de doléances” (lists of grievances) in France.","zh":"“Cahiers”指笔记本/练习本；也可指法国历史上的“cahiers de doléances（申诉书/不满清单）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) Notebooks or exercise books; in English, this is a French loanword and is often used in titles or cultural/academic contexts.","zh":"（复数名词）笔记本／练习本；在英语中这是法语借词，常见于书名、期刊名或文化与学术语境中。"},"examples":[{"en":"She filled several cahiers with sketches and short poems.","zh":"她用好几本 cahiers 记满了素描和短诗。"},{"en":"The library has a complete set of the journal Cahiers du Cinéma.","zh":"图书馆收藏了《Cahiers du Cinéma》（《电影手册》）期刊的全套。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural noun, history) In the phrase “cahiers de doléances,” written lists of complaints and requests prepared in France (especially in 1789) to present to authorities.","zh":"（复数名词，历史）在短语“cahiers de doléances（申诉书／请愿陈情册）”中，指法国（尤指1789年前后）民众为向当局陈述不满与诉求而写成的清单与文书。"},"examples":[{"en":"Peasants and townspeople contributed to the cahiers de doléances before the Estates-General met.","zh":"在三级会议召开前，农民和城镇居民共同撰写了 cahiers de doléances。"}]}],"synonyms":["notebooks","exercise books","journals","workbooks"],"phonetic":"/kæˈjeɪz/","extraExplanation":["“cahiers”是法语“cahier”的复数，原意接近“练习本/活页本/笔记本”。在英语里通常保留法语拼写与文化色彩，常见于期刊/丛书标题（如电影杂志《Cahiers du Cinéma》）。","发音上英语使用者常按英式读法近似处理；书面语里常带有“学术、文艺、出版物标题”的感觉。"]}
{"word":"Cahill","summary":{"en":"Cahill is mainly an Irish-origin surname; it can also appear as a less common place name.","zh":"Cahill 主要是一个源自爱尔兰的姓氏；也可能（较少见）用作地名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname), most commonly of Irish origin.","zh":"（常见为爱尔兰来源的）姓氏：Cahill。"},"examples":[{"en":"Tim Cahill is a well-known Australian soccer player.","zh":"Tim Cahill 是一位知名的澳大利亚足球运动员。"},{"en":"I met Ms. Cahill at the conference.","zh":"我在会议上见到了 Cahill 女士。"}]},{"partOfSpeech":"other","definition":{"en":"a place name in some English-speaking regions (less common).","zh":"（较少见）地名：在一些英语地区也可能用作地名。"},"examples":[{"en":"They drove through a small town called Cahill on their road trip.","zh":"他们公路旅行时开车经过了一个叫 Cahill 的小镇。"}]}],"phonetic":"/ˈkeɪhɪl/","extraExplanation":["“Cahill”多被认为源自爱尔兰盖尔语姓氏形式（常见解释为与 Ó Cathail 相关），大意是“Cathal 的后裔”。在英语语境里它通常就是一个姓，不需要翻译；正式写作中首字母大写。"]}
{"word":"Cahilly","summary":{"en":"Cahilly is primarily a surname (family name), often associated with Irish heritage.","zh":"Cahilly 主要用作姓氏（家族名），常与爱尔兰背景相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name), most often of Irish origin; used to refer to a person or family named Cahilly","zh":"姓氏（家族名）；多见于爱尔兰背景，用来指名为 Cahilly 的人或家族"},"examples":[{"en":"Ms. Cahilly will lead today’s meeting.","zh":"Cahilly 女士将主持今天的会议。"},{"en":"I saw Cahilly on the team list, but I don’t know them personally.","zh":"我在队员名单上看到 Cahilly，但我不认识这个人。"},{"en":"The Cahilly family moved to the U.S. many years ago.","zh":"Cahilly 家族多年前搬到了美国。"}]}],"synonyms":["(no true synonyms; it is a proper name)"],"phonetic":"/kəˈhɪli/","extraExplanation":["“Cahilly”通常是专有名词（姓氏），不是常见英语词汇，所以在普通词典里可能查不到。","它常被视为爱尔兰姓氏的拼写变体之一，可能与“Cahill”或类似姓氏有关；不同家族的拼写与读法可能略有差异。","在正式写作中，姓氏要大写：Cahilly。称呼他人时常与头衔连用：Mr./Ms./Dr. Cahilly。"]}
{"word":"cahincic","summary":{"en":"“cahincic” is not a recognized English word; it’s probably a misspelling or a proper noun.","zh":"“cahincic”不是公认的英语词汇；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a name/term from another language.","zh":"不是标准英语单词；很可能是拼写错误，或是人名/其他语言里的词。"},"examples":[{"en":"I couldn’t find “cahincic” in an English dictionary—could you share a sentence where you saw it?","zh":"我在英语词典里找不到“cahincic”，你能把它出现的句子发我吗？"},{"en":"Did you mean “chaotic” or “cathartic”?","zh":"你是不是想写“chaotic（混乱的）”或“cathartic（情感宣泄的）”？"}]}],"extraExplanation":["我查不到“cahincic”作为常见英语词汇的记录。为了帮你精准定位，请你提供：1）它出现的句子/上下文；2）你想表达的大概意思；3）是否是人名、地名或品牌名；4）是否可能是拼写错误。","如果你是从手写/图片里抄下来的，常见情况是字母看错（比如 a/o、h/n、c/e），发截图也能更快确认。"]}
{"word":"Cahita","summary":{"en":"Cahita refers to Indigenous peoples (and sometimes their related languages) from northwestern Mexico.","zh":"Cahita 指墨西哥西北部的一支原住民族（有时也指其相关语言/语支）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group of Indigenous peoples from northwestern Mexico (especially in the states of Sonora and Sinaloa), often discussed in anthropology and history; the term is also used for their related languages (the Cahitan languages).","zh":"墨西哥西北部（主要在索诺拉州和锡那罗亚州）的一支或一组原住民民族，在人类学与历史语境中常见；也可指其相关语言（卡伊塔语支/卡伊坦语支）。"},"examples":[{"en":"The Cahita peoples include groups such as the Mayo and the Yaqui.","zh":"卡伊塔人包括马约人（Mayo）和雅基人（Yaqui）等群体。"},{"en":"Researchers study Cahita history to understand cultural change in northwestern Mexico.","zh":"研究者通过研究卡伊塔人的历史来理解墨西哥西北部的文化变迁。"}]}],"synonyms":["Cahitan","Yaqui (more specific)","Mayo (more specific)"],"phonetic":"/kɑːˈhiːtə/","extraExplanation":["“Cahita”在英语里多作为人类学/民族史用语，常见于学术文本或博物馆说明牌，不算日常高频词。","语言学上常见写法是“Cahitan languages（卡伊塔语支）”，通常被归入“Uto-Aztecan（犹他-阿兹特克语系）”的一支；具体分类在不同资料中可能略有差异。","在当代语境中，提及相关社群时也常直接使用更具体的族名（如 Yaqui、Mayo），以尊重自称与差异。"]}
{"word":"cahita","summary":{"en":"Cahita refers to Indigenous peoples of northwestern Mexico and/or their related languages (often including Yaqui and Mayo).","zh":"Cahita 指墨西哥西北部的一些原住民族群及/或其相关语言群（常包括雅基与马约）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group of Indigenous peoples in northwestern Mexico (especially in Sonora and Sinaloa), often including the Yaqui and Mayo people.","zh":"墨西哥西北部（主要在索诺拉州与锡那罗亚州）的一个原住民族群体，常被用来涵盖雅基（Yaqui）与马约（Mayo）等民族。"},"examples":[{"en":"The Cahita peoples have a long history in northwestern Mexico.","zh":"卡伊塔（Cahita）诸民族在墨西哥西北部有悠久的历史。"},{"en":"Some sources discuss Cahita traditions alongside Yaqui and Mayo culture.","zh":"一些资料会把卡伊塔（Cahita）的传统与雅基、马约文化放在一起讨论。"}]},{"partOfSpeech":"n.","definition":{"en":"the Cahita (Cahitan) languages: a set of closely related Indigenous languages or language varieties in the Uto-Aztecan family.","zh":"卡伊塔语（Cahita/Cahitan languages）：一组彼此密切相关的原住民语言/方言，通常被归入尤托-阿兹特克语系。"},"examples":[{"en":"Researchers describe Mayo and Yaqui as part of the Cahita language group.","zh":"研究者常把马约语与雅基语描述为卡伊塔语群的一部分。"},{"en":"There are academic studies on Cahita grammar and oral narratives.","zh":"有一些学术研究探讨卡伊塔语的语法与口述叙事。"}]}],"synonyms":["Cahíta","Cahitan"],"phonetic":"/kɑːˈhiːtə/","extraExplanation":["“Cahíta”在西班牙语里常写作带重音符号的形式（Cahíta），英语资料中多写作Cahita或Cahitan。","这是人类学、历史学、语言学中较常见的术语；在日常英语里并不常用。","不同书籍对“Cahita”的范围可能略有差异：有时更偏向指一个语言群，有时更偏向指相关民族的集合。"]}
{"word":"Cahitan","summary":{"en":"“Cahitan” is not a standard English word; it is most likely a misspelling of “caftan/kaftan,” meaning a loose, long robe.","zh":"“Cahitan”不是常见英文词；很可能是“caftan/kaftan”的拼写误差，意思是“宽松的长袍/长衣”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended: caftan/kaftan) a long, loose robe or tunic, often worn as traditional clothing in parts of the Middle East, North Africa, and Central/South Asia, and also used in modern fashion.","zh":"（可能想写：caftan/kaftan）一种宽松的长袍或长上衣，常见于中东、北非及中亚/南亚等地的传统服饰，在现代时尚中也常出现。"},"examples":[{"en":"She wore a light caftan over her swimsuit at the beach.","zh":"她在海边把一件轻薄的长袍（caftan）罩在泳衣外面。"},{"en":"In the museum, we saw an embroidered Ottoman caftan.","zh":"在博物馆里，我们看到了一件绣花的奥斯曼长袍（caftan）。"}]}],"synonyms":["kaftan","robe","tunic"],"phonetic":"/ˈkæf.tæn/","extraExplanation":["“Caftan/kaftan”常被音译为“卡夫坦/卡夫丹”，不同地区拼写不同（caftan、kaftan）。如果你输入的“Cahitan”是人名或地名，也可能是另一种拼写；你可以告诉我你看到这个词的句子或来源，我可以更准确判断。"]}
{"word":"cahiz","summary":{"en":"“Cahiz” can mean “ready/prepared” (Turkish/Arabic loanword) or refer to Al‑Jahiz, a major 9th‑century Arab writer and scholar.","zh":"“cahiz”既可指“准备好的/就绪的”（土耳其语/阿拉伯语借词），也可指9世纪重要的阿拉伯作家与学者“贾希兹”（Al‑Jahiz）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Turkish/Arabic loanword) ready; prepared; equipped (often used in formal or older contexts).","zh":"（土耳其语/阿拉伯语借词）准备好的；就绪的；配备齐全的（多见于较正式或较旧的用法）。"},"examples":[{"en":"The team is cahiz to begin the project.","zh":"团队已经准备好开始这个项目了。"},{"en":"Keep the documents cahiz before the meeting.","zh":"开会前把文件准备齐全。"}]},{"partOfSpeech":"n.","definition":{"en":"Al-Jahiz (also spelled Jahiz/Cahiz): a famous 9th-century Arab writer and scholar, known for works on literature and animals.","zh":"贾希兹（也拼作 Jahiz/Cahiz，即 Al-Jahiz）：9世纪著名阿拉伯作家与学者，以文学与动物相关著作闻名。"},"examples":[{"en":"In a lecture on early Arabic prose, the teacher mentioned Al-Jahiz (Cahiz).","zh":"在讲早期阿拉伯散文的课上，老师提到了贾希兹（Cahiz）。"},{"en":"Al-Jahiz’s writing is often praised for its sharp observation and humor.","zh":"贾希兹的写作常因观察敏锐、带有幽默感而受到称赞。"}]}],"synonyms":["ready","prepared","equipped"],"phonetic":"/dʒɑːˈhiːz/","extraExplanation":["“cahiz”常见于土耳其语语境，也可能是对阿拉伯语“جاهز”（jāhiz，意为“准备好的”）的转写；在英语里更常见的拼法是“ready/prepared”，或作为专名写作“al-Jahiz / Jahiz”。","如果你是在英文文章里看到“cahiz”，很可能是人名（Al-Jahiz）的另一种拼写；如果是在土耳其语材料里看到，则更可能是形容词“准备好了/就绪”。"]}
{"word":"Cahn","summary":{"en":"Cahn is usually used as a surname (family name).","zh":"Cahn 通常用作姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A family name (surname).","zh":"姓氏（家族姓）。"},"examples":[{"en":"My teacher’s last name is Cahn.","zh":"我老师的姓是 Cahn。"},{"en":"In the credits, you can see the name Cahn.","zh":"在演职员表里，你可以看到 Cahn 这个名字。"}]}],"phonetic":"/kɑn/","extraExplanation":["Cahn 通常读作 /kɑn/，听起来像 “kahn”。它多见于英语国家的姓氏中。","这个姓在美国文化里可能让人想到词作者 Sammy Cahn（萨米·卡恩），他为许多经典歌曲写过歌词。"]}
{"word":"Cahnite","summary":{"en":"Cahnite is the name of a rare borate mineral.","zh":"Cahnite 是一种罕见硼酸盐矿物的名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral (a borate with calcium and hydrogen) that is typically found in certain metamorphic rocks; used mainly as a scientific/mineralogical term.","zh":"一种罕见的矿物（含钙和氢的硼酸盐矿物），通常产于某些变质岩中；主要用于矿物学/地质学的专业语境。"},"examples":[{"en":"Cahnite is a rare borate mineral collected mostly by mineral enthusiasts and studied by geologists.","zh":"Cahnite 是一种罕见的硼酸盐矿物，多由矿物爱好者收藏，也供地质学家研究。"},{"en":"The sample was labeled “cahnite” in the museum’s mineral display.","zh":"这块标本在博物馆的矿物展柜中被标注为“cahnite（卡恩石）”。"}]}],"synonyms":["(no common everyday synonyms; a specific mineral name)"],"phonetic":"/ˈkɑːnaɪt/","extraExplanation":["“Cahnite”常见于矿物目录、标本标签、地质论文等专业场景，日常英语里几乎不会用到。","名称来源通常与人名有关（以发现者/研究者命名的矿物很常见）；具体命名背景在不同资料中会有更详细的矿物史说明。","学习建议：如果你是在阅读矿物学资料，注意它常和“borate mineral（硼酸盐矿物）”“metamorphic rock（变质岩）”“specimen（标本）”等词一起出现。"]}
{"word":"cahnite","summary":{"en":"Cahnite is a rare mineral name used mainly in geology and mineral collecting.","zh":"Cahnite 是一种罕见矿物的名称，主要用于地质与矿物收藏语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral (a calcium borate arsenate hydroxide), usually found as small crystals.","zh":"一种罕见矿物（钙硼砷酸盐氢氧化物），通常以小晶体形式出现。"},"examples":[{"en":"Cahnite is mainly of interest to mineral collectors because it is quite rare.","zh":"Cahnite 主要因其罕见而受到矿物收藏者的关注。"},{"en":"The specimen shows tiny cahnite crystals on the rock surface.","zh":"这块标本在岩石表面有细小的 cahnite 晶体。"}]}],"synonyms":["(no common synonym; it is a specific mineral name)"],"phonetic":"/ˈkɑːnaɪt/","extraExplanation":["“Cahnite”通常读作重音在前（KAH-nite）。它是矿物学中的专有名词，日常英语里不常用。","该矿物名称来自人名（常见于矿物命名传统：以发现者、研究者或相关人士命名）。在科普或收藏语境中更常见。","注意拼写：cahnite 常被误拼为 *cahnite* 或与其他以 -nite 结尾的矿物名混淆（如 *kyanite* 蓝晶石）。"]}
{"word":"Cahokia","summary":{"en":"Cahokia refers mainly to a major ancient Mississippian culture city near today’s St. Louis, best known through Cahokia Mounds; it can also name a nearby Illinois community.","zh":"Cahokia主要指圣路易斯附近密西西比文化的重要史前城市（以卡霍基亚土丘遗址闻名）；也可指伊利诺伊州附近的同名社区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An important pre-Columbian Native American city (a major center of the Mississippian culture, c. 1050–1350 CE) located near present-day St. Louis, Missouri; today best known through the archaeological site called Cahokia Mounds.","zh":"美国史前重要的原住民城市（密西西比文化的重要中心，约公元1050–1350年），位于今密苏里州圣路易斯附近；如今主要以考古遗址“卡霍基亚土丘（Cahokia Mounds）”闻名。"},"examples":[{"en":"Cahokia was once one of the largest urban centers in North America north of Mexico.","zh":"卡霍基亚曾是墨西哥以北北美最大的城市中心之一。"},{"en":"Visitors can climb Monks Mound at Cahokia Mounds to understand the site’s scale.","zh":"游客可以在卡霍基亚土丘攀登“僧侣土丘”，直观感受遗址的规模。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name in Illinois (historically the town of Cahokia, now part of Cahokia Heights) near the Cahokia Mounds site.","zh":"伊利诺伊州的一个地名（历史上的卡霍基亚镇，现并入Cahokia Heights），位于卡霍基亚土丘遗址附近。"},"examples":[{"en":"She lives near Cahokia, Illinois, not far from St. Louis.","zh":"她住在伊利诺伊州的卡霍基亚附近，离圣路易斯不远。"},{"en":"Local museums in the Cahokia area explain the region’s Indigenous history.","zh":"卡霍基亚一带的当地博物馆会介绍这一地区的原住民历史。"}]}],"synonyms":["Cahokia Mounds"],"phonetic":"/kəˈhoʊkiə/","extraExplanation":["“Cahokia”常与“Cahokia Mounds（卡霍基亚土丘）”一起出现；该遗址被列入联合国教科文组织世界遗产。","发音常见重音在第二音节（ho），很多学习者容易把重音放错。","在历史与考古写作中，Cahokia通常特指密西西比文化的古城中心，而不是现代城镇。"]}
{"word":"Cahone","summary":{"en":"“Cahone” is not a standard English word; it’s most often a misspelling of “cajón” (a box drum), and sometimes a mistaken form of the vulgar Spanish slang “cojones.”","zh":"“Cahone”不是标准英语词；最常见是把“cajón”（箱鼓）拼错了，有时也可能误写了带粗俗色彩的西语俚语“cojones”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common misspelling) cajón: a wooden box drum that you sit on and play by tapping the front face with your hands, often used in flamenco and acoustic music.","zh":"（常见拼写错误）cajón：一种木箱鼓，人坐在上面，用手拍打前面板来演奏，常见于弗拉门戈与原声音乐。"},"examples":[{"en":"The singer asked the percussionist to play a cajón instead of a full drum kit.","zh":"歌手请打击乐手用 cajón 来代替整套架子鼓。"},{"en":"You can get a warm bass sound by hitting the center of the cajón.","zh":"拍打 cajón 的中间部位可以得到温暖的低音效果。"}]},{"partOfSpeech":"n.","definition":{"en":"(Likely intended, informal/vulgar) cojones: slang for “testicles,” and by extension “courage” or “nerve.” Use with caution because it can be offensive.","zh":"（可能想写的词，非正式/粗俗）cojones：俚语指“睾丸”，引申为“胆量/勇气”。因带粗俗色彩，使用需谨慎。"},"examples":[{"en":"It took a lot of nerve to say that in the meeting. (Neutral alternative to a vulgar slang expression.)","zh":"在会上那样说需要很大的胆量。（中性替代说法，避免粗俗俚语）"},{"en":"He finally had the courage to apologize.","zh":"他终于鼓起勇气道歉了。"}]}],"synonyms":["cajón","box drum","percussion box","courage","nerve","guts"],"phonetic":"/kɑˈhoʊn/","extraExplanation":["“cajón”来自西班牙语，字面意思是“箱子/抽屉”。在英语里常见发音为 /kɑˈhoʊn/，也常被拼错成 *cahone*。","如果你想表达“有胆量”，英语里更自然且得体的说法有：*courage*, *nerve*, *guts*（其中 *guts* 也偏口语，但不如 *cojones* 粗俗）。"]}
{"word":"cahoot","summary":{"en":"Cahoot means a secret, often dishonest partnership—usually heard as “in cahoots.”","zh":"cahoot 指秘密、常带不正当意味的合伙/串通，多用于短语 “in cahoots”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a secret or dishonest partnership; collusion (most often used in the phrase “in cahoots”).","zh":"秘密或不正当的合伙关系；串通（最常见于短语 “in cahoots”）。"},"examples":[{"en":"The two companies were accused of being in cahoots to raise prices.","zh":"这两家公司被指控串通抬高价格。"},{"en":"He suspected the guard was in cahoots with the thieves.","zh":"他怀疑那名保安与小偷勾结。"},{"en":"They’re not friends—just in cahoots for personal gain.","zh":"他们不是朋友——只是为了私利而勾结。"}]}],"synonyms":["collusion","conspiracy","scheme","plot","secret deal"],"phonetic":"/kəˈhuːt/","extraExplanation":["“cahoot”在现代英语里几乎只出现在固定搭配“in cahoots (with someone)”中，语气偏口语，常带负面含义（暗示不光彩或不诚实的合作）。","词源不完全确定；有观点认为可能与法语/方言词有关，但没有定论。"]}
{"word":"cahooting","summary":{"en":"“Cahooting” means secretly working together, usually in a dishonest or unfair way.","zh":"“cahooting”指暗中一起行动，通常含有不诚实或不公平的“串通、勾结”意味。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"secretly working together with someone, often to do something dishonest or unfair","zh":"（常指为做不诚实或不公平的事而）暗中与人串通、勾结"},"examples":[{"en":"The two employees were cahooting to steal from the company.","zh":"那两名员工正在暗中串通，从公司偷东西。"},{"en":"She suspected the supplier was cahooting with a competitor.","zh":"她怀疑那家供应商在和竞争对手暗中勾结。"}]},{"partOfSpeech":"n.","definition":{"en":"secret cooperation or collusion (often used informally)","zh":"（非正式）暗中合作；串通；勾结"},"examples":[{"en":"There was a lot of cahooting behind the scenes during the election.","zh":"选举期间幕后有很多暗中串通的操作。"},{"en":"The judge warned that any cahooting would be punished.","zh":"法官警告说，任何串通行为都会受到惩罚。"}]}],"synonyms":["colluding","conspiring","scheming","plotting","working together secretly"],"phonetic":"/kəˈhuːtɪŋ/","extraExplanation":["“cahooting”来自动词/名词“cahoot”。最常见的固定说法是“in cahoots (with sb)”=“与某人同谋/串通”。在日常英语里它通常带负面含义，用来暗示秘密合作、利益交换或不正当行为。","词源上常被认为与法语/苏格兰语中表示“伙伴、共同分担”的词有关，但现代用法里重点是“暗中一起干（多半不太光彩的）事”。"]}
{"word":"cahoots","summary":{"en":"“Cahoots” means a secret partnership, usually for dishonest purposes, most often in “in cahoots (with).”","zh":"“Cahoots”指秘密勾结/串通，多用于短语“in cahoots (with)”表示与……暗中合作（常不正当）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a secret partnership or cooperation (often for something dishonest or improper), usually used in the phrase “in cahoots (with).”","zh":"秘密勾结；暗中合作（常指不正当或不诚实的事），常用在短语“in cahoots (with)”中。"},"examples":[{"en":"The reporter suggested the company was in cahoots with local officials.","zh":"记者暗示这家公司和当地官员暗中勾结。"},{"en":"They denied being in cahoots to cheat customers.","zh":"他们否认串通来欺骗顾客。"}]}],"synonyms":["collusion","conspiracy","secret partnership","plotting"],"phonetic":"/kəˈhuːts/","extraExplanation":["“Cahoots”几乎总是以固定搭配出现：in cahoots (with)（与……勾结/串通）。单独说“cahoots”比较少见。","语气特点：带有强烈的负面含义，常见于新闻、法律、政治评论等语境，用来暗示“背后有猫腻”。","词源不完全确定，可能与旧法语/苏格兰语中表示“同伙、伙伴”的词有关；现代英语里主要保留为这个固定短语。"]}
{"word":"Cahors","summary":{"en":"Cahors is a city in southwestern France and also the name of a dark red wine from that region, often made from Malbec.","zh":"Cahors既是法国西南部的一座城市（卡奥尔），也指该地区出产的深色红葡萄酒，常以马尔贝克（Malbec）为主。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a city in southwestern France (in the Lot River valley), known historically as a medieval trading center.","zh":"（法国）卡奥尔：法国西南部洛特河谷的一座城市，历史上以中世纪贸易与建筑闻名。"},"examples":[{"en":"We spent a weekend in Cahors and walked across the old Valentré Bridge.","zh":"我们在卡奥尔待了一个周末，还走过了古老的瓦朗特雷桥。"},{"en":"Cahors has a long history tied to river trade in southern France.","zh":"卡奥尔的悠久历史与法国南部的河运贸易密切相关。"}]},{"partOfSpeech":"n.","definition":{"en":"a dark red wine (AOC) from the Cahors region, traditionally made mainly from Malbec grapes.","zh":"卡奥尔葡萄酒：产自卡奥尔产区的深色红葡萄酒（法定产区AOC），传统上以马尔贝克（Malbec）葡萄为主。"},"examples":[{"en":"He ordered a bottle of Cahors to pair with the roast lamb.","zh":"他点了一瓶卡奥尔红酒来搭配烤羊肉。"},{"en":"Cahors wines are often rich, dry, and deeply colored.","zh":"卡奥尔葡萄酒通常浓郁、偏干，颜色很深。"}]}],"synonyms":["Cahors wine","Malbec (often associated)"],"phonetic":"/kɑˈɔr/","extraExplanation":["“Cahors”既是地名也是酒名：在酒类语境里通常指该产区的红葡萄酒。","卡奥尔产区常被称为马尔贝克的“故乡”之一；在阿根廷马尔贝克走红之前，法国卡奥尔就以这种葡萄酿造深色、结构感强的红酒而闻名。","拼写以大写开头时多指城市（Cahors）；在菜单或酒单上也常见同样写法，但语境一般能判断是“城市”还是“葡萄酒”。"]}
{"word":"cahot","summary":{"en":"“In cahoots” means secretly cooperating, often for something dishonest.","zh":"“in cahoots”表示暗中合作/串通，常含不正当之意。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Usually in the phrase “in cahoots”) secretly working together, often to do something dishonest or unfair.","zh":"（常用于短语“in cahoots”）暗中勾结、串通（常带有不诚实或不公平的含义）。"},"examples":[{"en":"The two companies were accused of being in cahoots to raise prices.","zh":"这两家公司被指控串通抬高价格。"},{"en":"It looks like the thief was in cahoots with someone inside the building.","zh":"看起来小偷和楼里内部的人有勾结。"}]}],"synonyms":["collude","conspire","be in league (with)","plot"],"phonetic":"/kəˈhuːts/","extraExplanation":["你输入的“cahot”很可能是拼写错误，常见的词是“cahoots”。它几乎总是以固定搭配“in cahoots (with sb)”出现，表示“与某人串通/合谋”。","词源上，“cahoots”可能来自法语或苏格兰英语相关词，现代英语里带有口语色彩，常用于新闻、侦探故事或日常指责中。","近义表达：collude (with), conspire (with), be in league (with)。语气从中性到更强烈：collude/conspire 更正式、更强调违法或阴谋。"]}
{"word":"cahow","summary":{"en":"Cahow means the Bermuda petrel, a rare seabird associated with Bermuda.","zh":"cahow 指“百慕大海燕”，一种与百慕大密切相关、非常珍稀的海鸟。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sea bird (the Bermuda petrel) that lives around Bermuda; it is famous for being extremely rare and later rediscovered after people thought it was extinct","zh":"一种海鸟（百慕大海燕），生活在百慕大附近；因曾被认为已经灭绝、后来又被重新发现而闻名，也因此非常珍稀"},"examples":[{"en":"The cahow is also called the Bermuda petrel.","zh":"cahow 也叫做百慕大海燕。"},{"en":"Conservation efforts helped protect the cahow’s nesting sites.","zh":"保育工作帮助保护了 cahow 的筑巢地点。"}]}],"synonyms":["Bermuda petrel","petrel"],"phonetic":"/ˈkeɪhaʊ/","extraExplanation":["“Cahow”一词来自百慕大早期居民对这种鸟的称呼，属于地域性很强的词汇，在日常英语里并不常见；在新闻、纪录片或自然保护相关语境中更容易看到。","cahow 曾长期被认为在17世纪就已灭绝，20世纪中期在百慕大重新发现，常被用作“物种保护成功”的代表案例。"]}
{"word":"cahows","summary":{"en":"“Cahows” is the plural of “cahow,” meaning the Bermuda petrel, a seabird native to Bermuda.","zh":"“Cahows”是“cahow”的复数，指百慕大特有的海鸟——百慕大海燕。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a seabird (the Bermuda petrel) that breeds mainly on islands near Bermuda; the word is often used in the plural (cahows).","zh":"（百慕大海燕）一种海鸟，主要在百慕大附近岛屿繁殖；该词常用复数形式（cahows）。"},"examples":[{"en":"Scientists worked for decades to protect the cahows’ nesting sites in Bermuda.","zh":"科学家们花了几十年时间保护百慕大的 cahows（百慕大海燕）筑巢地。"},{"en":"For a long time, people feared the cahows had disappeared completely.","zh":"很长一段时间里，人们担心 cahows 已经彻底消失了。"}]}],"synonyms":["Bermuda petrel","petrel"],"phonetic":"/ˈkɑːhaʊ/","extraExplanation":["“Cahow”是百慕大对这种海燕的传统称呼，可能来自早期殖民时期对鸟叫声的拟声表达。","百慕大海燕曾一度被认为已灭绝，后来被“再发现”，因此在自然保护语境中常被当作濒危物种保护与生态复育的象征。"]}
{"word":"Cahra","summary":{"en":"“Cahra” is usually a name or a nonstandard spelling, not a common English word.","zh":"“Cahra”通常是人名或非标准拼写，并非常见英语单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“Cahra” is not a standard English vocabulary word. It is most often seen as a personal name (a given name) or a spelling variant of another name.","zh":"“Cahra”不是标准英语词汇。它更多见于人名（名字），或是其他名字的拼写变体。"},"examples":[{"en":"Cahra is my classmate’s name.","zh":"Cahra 是我同学的名字。"},{"en":"I’m not sure how to pronounce Cahra—could you say it first?","zh":"我不确定 Cahra 怎么读——你能先读一遍吗？"}]}],"phonetic":"/ˈkɑːrə/","extraExplanation":["在英语里，“Cahra”没有固定的词典义，更像是专有名词（人名/品牌名）。如果你是在查词义，可能是拼写误差。","常见的相似词包括：chakra（梵语来源，指“脉轮”）、Chara（也可能是人名/昵称，或某些专有名词）。如果你告诉我你想表达的语境（比如宗教、瑜伽、游戏角色、姓名），我可以帮你确定正确拼写和含义。"]}
{"word":"Cahuapana","summary":{"en":"Cahuapana refers to an Indigenous people in northern Peru and, in some contexts, to the Cahuapanan language family.","zh":"Cahuapana 可指秘鲁北部的原住民族群，也可在某些语境中指 Cahuapanan（卡瓦帕南）语系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small Indigenous group in northern Peru, historically associated with the Cahuapanas (a region/river area).","zh":"秘鲁北部的一个小型原住民族群，历史上与“Cahuapanas（卡瓦帕纳斯）”地区/河流流域有关。"},"examples":[{"en":"Some historical sources mention the Cahuapana people in accounts of northern Peru.","zh":"一些历史资料在描述秘鲁北部时会提到 Cahuapana 人。"},{"en":"Researchers sometimes group Cahuapana communities with nearby Amazonian peoples in older texts.","zh":"在较早的文献里，研究者有时会把 Cahuapana 社群与邻近的亚马孙地区民族一起讨论。"}]},{"partOfSpeech":"n.","definition":{"en":"a term used in linguistics for the Cahuapanan language family (often linked to the Shawi/Chayahuita language and related varieties).","zh":"语言学中指“Cahuapanan（卡瓦帕南）语系”的用语（常与 Shawi/Chayahuita 等语言及相关变体联系在一起）。"},"examples":[{"en":"The Shawi language is often classified under the Cahuapanan family.","zh":"Shawi 语言常被归入 Cahuapanan（卡瓦帕南）语系。"},{"en":"In some classifications, Cahuapana refers to a broader Cahuapanan grouping rather than one single language.","zh":"在某些分类中，Cahuapana 指更广义的 Cahuapanan 归类，而不是单一语言。"}]}],"synonyms":["Cahuapanan","Shawi (Chayahuita)","Cahuapanas"],"phonetic":"/ˌkɑːwɑːˈpɑːnə/","extraExplanation":["“Cahuapana”在英文资料里并不是很常见的日常词，更常见的是形容词/族群与语系名称“Cahuapanan”。如果你是在地图、民族志（人类学）或语言学论文里看到它，通常与秘鲁北部亚马孙流域的族群与语言分类有关。","拼写上不同资料可能出现 Cahuapana / Cahuapanas / Cahuapanan 等形式：- Cahuapanas 常像是地名/地区名称；- Cahuapanan 常用于语系名称；- Cahuapana 可能是对族群或语系的简略写法。具体含义需看上下文。"]}
{"word":"cahuapana","summary":{"en":"Cahuapana usually refers to the Cahuapanan language family and related Indigenous peoples in northern Peru.","zh":"Cahuapana 通常指秘鲁北部的卡瓦帕纳语系及相关原住民群体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small language family (and related Indigenous groups) from northern Peru; often written as Cahuapanan","zh":"（秘鲁北部的）卡瓦帕纳语系；也可指与之相关的原住民群体（常见拼写为 Cahuapanan）"},"examples":[{"en":"Some researchers classify Shawi and Shiwilu as part of the Cahuapana (Cahuapanan) language family.","zh":"一些研究者将 Shawi 和 Shiwilu 归类为卡瓦帕纳（Cahuapanan）语系。"},{"en":"The museum exhibit includes notes on Cahuapana peoples and their traditional territories in Peru.","zh":"博物馆展览包含关于卡瓦帕纳族群及其在秘鲁传统领地的说明。"}]}],"synonyms":["Cahuapanan"],"phonetic":"/ˌkɑwəˈpɑnə/","extraExplanation":["“Cahuapana”更常见的英文拼写是 **Cahuapanan**（指语系）或用于相关族群的称呼；在学术写作里通常会标注具体语言名称（如 Shawi、Shiwilu）。","这类名称多来自西班牙语或早期记录者的转写，因此在不同资料中可能出现拼写差异。"]}
{"word":"Cahuapanan","summary":{"en":"Cahuapanan is a proper name, usually pointing to the Cahuapanas River region in northern Peru.","zh":"Cahuapanan 是一个地名专名，通常指秘鲁北部的卡瓦帕纳斯河及其地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name (proper noun), most commonly referring to the Cahuapanas River area in northern Peru (Amazon region).","zh":"专有名词（地名）：最常指秘鲁北部亚马逊地区的“卡瓦帕纳斯河”（Cahuapanas River）及其周边地区。"},"examples":[{"en":"The village lies near the Cahuapanan/Cahuapanas River in northern Peru.","zh":"这个村庄位于秘鲁北部的卡瓦帕纳（斯）河附近。"},{"en":"Researchers documented biodiversity along the Cahuapanan watershed.","zh":"研究人员记录了卡瓦帕纳（斯）河流域的生物多样性。"}]}],"phonetic":"/ˌkɑwɑpɑˈnɑn/","extraExplanation":["“Cahuapanan”更常见的拼写是 **Cahuapanas**（卡瓦帕纳斯），英文资料里多用 *Cahuapanas River*。你输入的形式可能是变体拼写、旧拼写，或来自西班牙语/当地语言转写差异。","它属于秘鲁洛雷托大区（Loreto）一带的河流系统，常出现在有关亚马逊雨林、原住民社区与生态研究的语境中。","作为地名/专名，通常不翻译成英语常用词，而是保留原名；写作时可在第一次出现时加说明：*Cahuapanas River (in northern Peru)*。"]}
{"word":"Cahuapanas","summary":{"en":"Cahuapanas is a proper name most often referring to a river or district in northern Peru, and sometimes to an Indigenous language family (Cahuapanan).","zh":"Cahuapanas 多为专有名词，最常指秘鲁北部的一条河流或一个行政区；在语言学中也可指“卡瓦帕南语系”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a river in northern Peru (Loreto Region), in the Amazon basin.","zh":"秘鲁北部（洛雷托大区）亚马孙流域的一条河流。"},"examples":[{"en":"The Cahuapanas River flows through remote rainforest communities in Loreto, Peru.","zh":"卡瓦帕纳斯河流经秘鲁洛雷托大区偏远的雨林社区。"},{"en":"Researchers traveled by boat along the Cahuapanas to visit nearby villages.","zh":"研究人员乘船沿卡瓦帕纳斯河前往附近的村庄。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name used for local administrative areas in Peru (for example, “Cahuapanas District”).","zh":"秘鲁的一个地名，用于当地行政区域（例如“卡瓦帕纳斯区”）。"},"examples":[{"en":"She works on a health project in Cahuapanas District.","zh":"她在卡瓦帕纳斯区参与一个健康项目。"},{"en":"Cahuapanas District is in Datem del Marañón Province.","zh":"卡瓦帕纳斯区位于达特姆-德尔-马拉尼翁省。"}]},{"partOfSpeech":"other","definition":{"en":"in linguistics, a label for an Indigenous language family of Peru (often called the Cahuapanan languages).","zh":"（语言学）指秘鲁的一个原住民语言家族（常称“卡瓦帕南语系”）。"},"examples":[{"en":"Some sources group Shawi and Shiwilu as Cahuapanan languages.","zh":"一些资料把沙维语（Shawi）和希维卢语（Shiwilu）归为卡瓦帕南语系。"}]}],"synonyms":["Cahuapanas River","Cahuapanas District","Cahuapanan (languages)"],"phonetic":"/ˌkɑːwəˈpɑːnəz/","extraExplanation":["“Cahuapanas”多见于西班牙语/英语的地名或学术写法，通常来自当地原住民语言的地名转写，因此拼写与重音在不同资料中可能略有差异。","如果你是在地图或文章里看到这个词，最常见的指代是“Cahuapanas River（卡瓦帕纳斯河）”或“Cahuapanas District（卡瓦帕纳斯区）”；在语言学语境里则可能指“Cahuapanan languages（卡瓦帕南语系）”。"]}
{"word":"Cahuilla","summary":{"en":"Cahuilla refers to a Native American people of Southern California and the language they traditionally speak.","zh":"Cahuilla 指加州南部的卡维亚原住民族群，以及他们传统使用的卡维亚语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Native American people of Southern California, traditionally living in the inland areas near present-day Palm Springs and the Coachella Valley.","zh":"（卡维亚人）美国加利福尼亚州南部的原住民族群之一，传统上居住在如今棕榈泉（Palm Springs）及科切拉谷（Coachella Valley）一带的内陆地区。"},"examples":[{"en":"The Cahuilla have lived in Southern California for many generations.","zh":"卡维亚人在加州南部世世代代居住。"},{"en":"We learned about Cahuilla history in a local museum.","zh":"我们在当地博物馆学习了卡维亚人的历史。"}]},{"partOfSpeech":"n.","definition":{"en":"the Uto-Aztecan language traditionally spoken by the Cahuilla people.","zh":"（卡维亚语）卡维亚人传统上使用的一种语言，属犹他—阿兹特克语系（Uto-Aztecan）。"},"examples":[{"en":"Some community programs teach Cahuilla to younger learners.","zh":"一些社区项目把卡维亚语教给年轻学习者。"},{"en":"This word list includes a few Cahuilla terms for local plants.","zh":"这份词表包含一些卡维亚语中表示当地植物的词。"}]}],"synonyms":["Cahuilla people","Cahuilla language"],"phonetic":"/kəˈwiːjə/","extraExplanation":["“Cahuilla”通常作专有名词使用，指“族群”或“语言”，英语里一般不加冠词（如：Cahuilla history / speak Cahuilla）。","在美国语境中，Cahuilla 与多个部落社区和保留地（reservations）相关；谈到当代社区时，也常出现 “Cahuilla Band/Tribe” 等正式名称。"]}
{"word":"cahuilla","summary":{"en":"Cahuilla refers to a Native American people of Southern California, their language, and anything related to their culture.","zh":"Cahuilla 指美国加州南部的卡维拉原住民部族、其语言（卡维拉语），以及与其文化相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Native American people whose traditional homeland is in Southern California (especially inland areas near the Coachella Valley, San Jacinto Mountains, and surrounding regions)","zh":"卡维拉人（美国原住民部族之一；传统居住地在美国加利福尼亚州南部内陆地区，如科切拉谷、圣哈辛托山脉及周边）"},"examples":[{"en":"The Cahuilla have lived in Southern California for many generations.","zh":"卡维拉人在加州南部世代居住。"},{"en":"The museum has an exhibit about Cahuilla history and basketry.","zh":"博物馆有关于卡维拉人历史与编篮工艺的展览。"}]},{"partOfSpeech":"n.","definition":{"en":"the Indigenous language traditionally spoken by the Cahuilla people","zh":"卡维拉语（卡维拉人传统使用的原住民语言）"},"examples":[{"en":"She is learning Cahuilla to connect with her family’s heritage.","zh":"她正在学习卡维拉语，以更贴近家族的文化传承。"},{"en":"A few elders still speak Cahuilla fluently, and language classes are helping new learners.","zh":"仍有少数长者能流利使用卡维拉语，语言课程正在帮助新学习者。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Cahuilla people, their language, or culture","zh":"与卡维拉人、卡维拉语或其文化相关的"},"examples":[{"en":"They attended a Cahuilla cultural event hosted by the community.","zh":"他们参加了由社区举办的卡维拉文化活动。"},{"en":"The library collected Cahuilla oral-history recordings.","zh":"图书馆收集了卡维拉口述历史录音。"}]}],"synonyms":["Cahuilla people","Cahuilla language","Ivilyuat"],"phonetic":"/kəˈwiːjə/","extraExplanation":["“Cahuilla”常见英语读音接近“ka-WEE-ya”。该族群也常以自称（endonym）“Ivilyuat / Ɂívil̃uqaletem”等形式出现，不同资料的拼写可能略有差异。","卡维拉语通常被归入尤托-阿兹特克语系（Uto-Aztecan）的塔基克语支（Takic）。近年来有不少社区与学校推动语言复振与教材整理。"]}
{"word":"cahuita","summary":{"en":"Cahuita is a coastal town in Costa Rica and also the name of the nearby national park.","zh":"Cahuita 指哥斯达黎加的海滨小镇，也可指附近的卡维塔国家公园。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small coastal town on Costa Rica’s Caribbean coast (in Limón Province), known for beaches and Afro-Caribbean culture.","zh":"卡维塔：哥斯达黎加加勒比海岸（利蒙省）的一个海滨小镇，以海滩与非裔加勒比文化闻名。"},"examples":[{"en":"We stayed in Cahuita for two nights before heading to Puerto Viejo.","zh":"我们在卡维塔住了两晚，然后前往普埃尔托维耶霍。"},{"en":"Cahuita feels quiet and walkable, with shops and restaurants near the beach.","zh":"卡维塔氛围安静、适合步行，海边附近有商店和餐馆。"}]},{"partOfSpeech":"n.","definition":{"en":"Cahuita National Park, a protected area near the town, famous for an easy coastal trail and coral reefs.","zh":"卡维塔国家公园：位于小镇附近的保护区，以轻松的海岸步道和珊瑚礁著称。"},"examples":[{"en":"We saw monkeys and raccoons on the trail in Cahuita National Park.","zh":"我们在卡维塔国家公园的步道上看到了猴子和浣熊。"},{"en":"Snorkeling near Cahuita is popular because of the reef.","zh":"在卡维塔附近浮潜很受欢迎，因为那里有珊瑚礁。"}]}],"synonyms":["Cahuita National Park","Limón Province","Caribbean coast (Costa Rica)","Costa Rica"],"phonetic":"/kɑˈwita/","extraExplanation":["“Cahuita”是专有名词，英语里通常按西语发音来读，接近“ka-WEE-ta”。","当地位于哥斯达黎加的加勒比海岸，文化上常与非裔加勒比（Afro-Caribbean）传统、美食与音乐联系在一起。"]}
{"word":"cahuy","summary":{"en":"“cahuy” is not recognized as a standard English word; it’s likely a misspelling or a proper name.","zh":"“cahuy”不是标准英语词，可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a name (proper noun).","zh":"不是标准英语单词，可能是拼写错误或人名/地名（专有名词）。"},"examples":[{"en":"I couldn’t find “cahuy” in an English dictionary—did you mean “cahoots” or “coy”?","zh":"我在英语词典里找不到“cahuy”——你是不是想写“cahoots”或“coy”？"},{"en":"If you can share the sentence where you saw “cahuy,” I can help identify the intended word.","zh":"如果你把看到“cahuy”的句子发我，我可以帮你判断原本想表达的词。"}]}],"extraExplanation":["“cahuy”看起来更像是：\n1）拼写误差：比如 *cahoots*（短语：*in cahoots (with)*，意为“与……串通/勾结”）或 *coy*（adj. 含蓄的、装害羞的）等。\n2）专有名词：可能是人名/姓氏，或某些语言（如西班牙语、菲律宾语等）里的词或地名转写。\n如果你告诉我：它出现的语境、所在国家/语言、或你想表达的中文意思，我可以更准确地给出对应英文词和用法。"]}

