{"word":"CAI","summary":{"en":"CAI most commonly means computer-assisted instruction; it can also be the romanized spelling of the Chinese surname Cai (蔡).","zh":"CAI 最常指计算机辅助教学；也可能是中文姓氏“蔡”（Cai）的拼音/罗马字母拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"computer-assisted instruction; teaching and practice activities delivered or supported by a computer (often interactive).","zh":"计算机辅助教学；由电脑提供或支持的教学与练习活动（通常具有互动性）。"},"examples":[{"en":"The school uses CAI to help students practice spelling and math.","zh":"学校用 CAI 来帮助学生练习拼写和数学。"},{"en":"CAI programs can give instant feedback after each question.","zh":"CAI 程序可以在每道题后立刻给出反馈。"}]},{"partOfSpeech":"other","definition":{"en":"(often “Cai”) a Chinese family name.","zh":"（常写作“Cai”）中文姓氏“蔡”。"},"examples":[{"en":"Her last name is Cai, spelled C-A-I.","zh":"她姓蔡，拼作 C-A-I。"},{"en":"Professor Cai will speak at the seminar tomorrow.","zh":"蔡教授明天将在研讨会上发言。"}]}],"synonyms":["computer-based instruction","e-learning","online learning","digital learning"],"phonetic":"/siː eɪ aɪ/","extraExplanation":["在教育领域里，CAI 是一个比较常见的缩写，常与 CAL（computer-assisted learning，计算机辅助学习）一起出现；现代语境下也可能被更通用的“online learning / e-learning（在线学习）”所替代。","读作字母时更常见（/siː eɪ aɪ/），而作为中文姓氏时通常读作 /kaɪ/（接近“kye”）。"]}
{"word":"cai","summary":{"en":"“Cai” is most commonly a surname; “CAI” can also mean computer-assisted instruction.","zh":"“Cai”最常见为姓氏；“CAI”也可指计算机辅助教学。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), common among people of Chinese, Vietnamese, and other East Asian backgrounds","zh":"姓氏（常见于华人、越南人等东亚背景人群）"},"examples":[{"en":"Dr. Cai will give a talk on public health tomorrow.","zh":"蔡博士明天将做一场关于公共卫生的讲座。"},{"en":"Her last name is Cai, spelled C-A-I.","zh":"她的姓是 Cai，拼作 C-A-I。"}]},{"partOfSpeech":"other","definition":{"en":"(CAI) an abbreviation for “computer-assisted instruction” (also called computer-aided instruction), learning supported by computers","zh":"（CAI）“计算机辅助教学/计算机辅助学习”的缩写，指借助计算机进行教学与学习"},"examples":[{"en":"The school uses CAI to help students practice math skills.","zh":"学校使用 CAI 来帮助学生练习数学技能。"},{"en":"CAI programs can give instant feedback to learners.","zh":"CAI 程序可以给学习者即时反馈。"}]}],"synonyms":["computer-assisted instruction","computer-aided instruction"],"phonetic":"/tsaɪ/","extraExplanation":["“Cai”在英语中最常见是人名/姓氏的拼写。其读音会因家庭的语言背景而不同：有的人按英语习惯读成近似 /kaɪ/；也有人按汉语拼音对应姓“蔡”读成近似“tsai”（更接近 /tsaɪ/）。实际以本人偏好为准。","如果你指的是汉语拼音“cai”，它可能对应多个汉字（如：菜、才、采、蔡等），意思取决于具体汉字与语境；你可以告诉我你想查的是哪一个字/词。"]}
{"word":"Caia","summary":{"en":"Caia is most commonly a proper noun: a feminine given name or a place name in Wales.","zh":"Caia 最常见作专有名词：女性名字，或威尔士的地名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a feminine given name (also spelled Kaya or Kaia in English contexts).","zh":"女性名字（英语语境中也常见拼写为 Kaya / Kaia）。"},"examples":[{"en":"Caia loves reading mystery novels.","zh":"Caia 喜欢读推理小说。"},{"en":"We met Caia at a language exchange event.","zh":"我们在一次语言交换活动上认识了 Caia。"}]},{"partOfSpeech":"other","definition":{"en":"a place name in Wales (an area/suburb of Wrexham), used as a proper noun.","zh":"威尔士的地名（雷克瑟姆 Wrexham 附近的一个地区/郊区），作专有名词使用。"},"examples":[{"en":"He grew up in Caia near Wrexham.","zh":"他在雷克瑟姆附近的 Caia 长大。"},{"en":"Caia Park is a well-known area in Wrexham.","zh":"Caia Park 是雷克瑟姆一个比较有名的地区。"}]}],"synonyms":["Kaia","Kaya"],"phonetic":"/ˈkaɪ.ə/","extraExplanation":["“Caia”在英语里最常见是人名或地名，因此通常不当作普通词汇来解释。","作为人名时，英语使用者有时把它看作 Kaia/Kaya 的变体；读音也可能因家庭语言背景不同而变化。","如果你是在特定文本/句子里看到“Caia”，把上下文发来，我可以帮你判断它是人名、地名，还是其他语言的词。"]}
{"word":"Caiaphas","summary":{"en":"Caiaphas is the name of a Jewish high priest in Jerusalem who appears in the New Testament accounts of Jesus’ trial.","zh":"Caiaphas（该亚法）是公元1世纪初耶路撒冷的一位犹太大祭司，在《新约》中与耶稣受审的记载相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The Jewish high priest in Jerusalem (in the early 1st century CE) who, in the New Testament, is connected with the trial of Jesus.","zh":"该亚法：公元1世纪初耶路撒冷的犹太大祭司；在《新约》中与耶稣受审一事有关。"},"examples":[{"en":"In the New Testament, Caiaphas is presented as a key figure in the events leading to Jesus’ trial.","zh":"在《新约》中，该亚法被描述为推动耶稣受审事件的关键人物之一。"},{"en":"The high priest Caiaphas questioned Jesus during the night proceedings in some Gospel accounts.","zh":"在一些福音书的记载中，大祭司该亚法在夜间的审讯中盘问了耶稣。"}]}],"synonyms":["high priest (contextual)"],"phonetic":"/ˈkaɪ.ə.fəs/","extraExplanation":["“Caiaphas”是音译人名，常见于基督教/犹太教相关的历史与宗教语境中。中文常译作“该亚法”（也见“该法亚”）。","他与“Sanhedrin（公会/犹太公会）”“high priest（大祭司）”“Pontius Pilate（本丢·彼拉多）”等人物或机构常在同一段历史叙事中出现。","文学与艺术作品（戏剧、小说、电影）在改编耶稣受难故事时，也常把该亚法塑造成具有政治与宗教权力的代表人物。"]}
{"word":"caiarara","summary":{"en":"“Caiarara” isn’t recognized as a standard English word; context is needed to identify it.","zh":"“caiarara”不是常见英语词；需要语境才能确认它是什么。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it may be a misspelling, a name, or a word from another language.","zh":"不是标准英语词；可能是拼写错误、专有名词，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “caiarara” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里找不到“caiarara”——你能把它出现的句子发给我吗？"},{"en":"If it’s a person or place name, the meaning may depend on the local language or culture.","zh":"如果它是人名或地名，含义可能取决于当地语言或文化背景。"}]}],"phonetic":"/kaɪ.əˈrɑːrə/","extraExplanation":["“caiarara”在常见英语语料与词典中基本查不到记录，因此更像是：1）拼写接近的词（例如某些葡语/西语/土著语词）；2）人名、网名、品牌名；3）专有名词（地名、船名、作品名等）。","如果你告诉我它来自哪个语境（国家/语言/一整句原文/你想表达的意思），我可以帮你判断它可能对应哪个词、正确拼写，以及更自然的英文表达。"]}
{"word":"caic","summary":{"en":"CAIC is an initialism with multiple possible meanings; its exact meaning depends on context.","zh":"CAIC 是一个可能有多种含义的缩写，具体指代需要结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"CAIC (often written in capitals) is an initialism that can stand for different organizations or terms depending on the field and country. It is usually said by naming the letters.","zh":"CAIC（常用大写）是一个首字母缩略词，在不同国家和领域里可能代表不同的机构或术语；通常读作逐个字母。"},"examples":[{"en":"What does CAIC stand for in this report?","zh":"这份报告里的 CAIC 指的是什么？"},{"en":"In aviation news, CAIC may refer to a specific aircraft company, depending on the country.","zh":"在航空新闻里，CAIC 可能指某个飞机制造公司，但要看具体国家与语境。"}]}],"synonyms":["initialism","acronym"],"phonetic":"/keɪ aɪ siː/","extraExplanation":["“CAIC”不是常见的普通英文单词，更像是缩写；常见读法是逐字母读 /keɪ aɪ siː/。","因为它在不同领域含义差异很大（例如公司名、机构名、项目名等），需要你提供上下文（句子、行业、国家/地区）才能给出准确释义。你也可以告诉我你看到它的全文标题或它出现的段落。"]}
{"word":"caickle","summary":{"en":"“Caickle” isn’t a standard English word; it’s usually a misspelling of “cackle,” and sometimes of “icicle.”","zh":"“caickle”不是标准英语单词；通常是把“cackle”拼错，有时也可能是把“icicle”拼错。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is commonly a misspelling of “cackle” (to laugh in a loud, harsh way; or that kind of laugh).","zh":"不是标准英语单词。常见于把 “cackle” 拼错（指刺耳、咯咯的大笑；也可指这种笑声）。"},"examples":[{"en":"I think you meant “cackle”: The witch cackled loudly.","zh":"你可能想写的是 “cackle”：女巫大声咯咯笑。"},{"en":"As a noun: Her cackle echoed in the hallway.","zh":"作名词：她刺耳的笑声在走廊里回荡。"}]},{"partOfSpeech":"other","definition":{"en":"Less commonly, it may be a misspelling of “icicle” (a long, thin piece of ice hanging from a roof).","zh":"也有可能（较少见）是把 “icicle” 拼错（指从屋檐等处垂下的细长冰柱）。"},"examples":[{"en":"I think you meant “icicle”: An icicle was hanging from the roof.","zh":"你可能想写的是 “icicle”：屋檐下挂着一根冰柱。"}]}],"synonyms":["(for cackle) laugh","(for cackle) giggle","(for cackle) caw"],"phonetic":"/ˈkækəl/","extraExplanation":["“caickle”不是词典里的标准拼写。最常见的正确词是 **cackle**（/ˈkækəl/），因为发音里有清晰的 /k/ 音，容易被写成带 a-i 的形式。另一个可能是 **icicle**，因为它的拼写里有 -cicle 结构。","如果你告诉我你想表达的意思（“笑声”还是“冰柱”），我可以把对应单词的用法、常见搭配和更多例句整理给你。"]}
{"word":"Caicos","summary":{"en":"Caicos: the Caicos Islands, part of the Turks and Caicos Islands in the Caribbean.","zh":"Caicos：凯科斯群岛，加勒比海的特克斯和凯科斯群岛的一部分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Caicos Islands (part of the Turks and Caicos Islands), a group of low-lying Caribbean islands southeast of the Bahamas, known for beaches and tourism","zh":"凯科斯群岛（英属“特克斯和凯科斯群岛”的一部分），位于巴哈马东南方向的加勒比海低平群岛，以海滩与旅游闻名"},"examples":[{"en":"She’s planning a trip to the Caicos for a quiet beach vacation.","zh":"她计划去凯科斯群岛度假，享受安静的海滩。"},{"en":"Providenciales is one of the best-known islands in the Caicos.","zh":"普罗维登西亚莱斯岛（Providenciales）是凯科斯群岛中最有名的岛屿之一。"}]}],"synonyms":["the Caicos Islands","Turks and Caicos (Islands)"],"phonetic":"/ˈkeɪkoʊs/","extraExplanation":["“Caicos”常见于地名搭配：the Caicos / the Caicos Islands（凯科斯群岛）。在英语里它通常与“Turks”连用，说成“Turks and Caicos（特克斯和凯科斯群岛）”。","书写上多为首字母大写的专有名词（Caicos），前面常加定冠词 the（the Caicos）。"]}
{"word":"caid","summary":{"en":"“Caid” means a local chief/governor in North Africa or the Middle East, mainly used in historical or literary contexts.","zh":"“caid”指北非或中东的地方首领/长官，多用于历史或文学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a local leader or governor in parts of North Africa or the Middle East; a chief or commander (also spelled qaid/kaid/caïd).","zh":"（北非或中东某些地区的）地方首领、长官；酋长；指挥官（也可拼作 qaid/kaid/caïd）。"},"examples":[{"en":"The caid collected taxes for the regional ruler.","zh":"这位 caid 为地区统治者征税。"},{"en":"In the novel, the caid is described as both feared and respected.","zh":"在小说里，这位 caid 被描写成既令人畏惧又受人敬重。"}]}],"synonyms":["qaid","kaid","chief","commander","governor"],"phonetic":"/kaɪd/","extraExplanation":["“caid”多见于历史/文学语境，常指传统行政体系中的地方官或部族首领。","词源来自阿拉伯语 qā’id（قائد），意为“领袖、指挥官”。英语里常见拼写有 qaid、kaid、caïd（带分音符表示发音）。","如果你是想查日常英语词汇，可能是拼写有误；常见近似词包括：paid（已付）、cared（关心过）、card（卡片）、cad（卑鄙的人）。可以告诉我你看到它的句子，我能帮你确认。"]}
{"word":"caids","summary":{"en":"“caids” is the plural of “caid,” meaning local chiefs or officials, especially in North Africa.","zh":"“caids”是“caid”的复数，指（尤指北非的）地方首领或官员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a local chief, commander, or official (especially in North Africa); plural of “caid.”","zh":"（尤指北非的）地方首领、指挥官或官员；“caid”的复数。"},"examples":[{"en":"In older histories of Morocco, caids are described as local leaders who collected taxes and kept order.","zh":"在较早的摩洛哥史书中，caids 常被描述为负责征税并维持秩序的地方领袖。"},{"en":"The village negotiated with the caids about land use and security.","zh":"村民就土地使用和安全问题与这些地方首领进行了协商。"}]}],"synonyms":["chiefs","local rulers","leaders","commanders","officials"],"phonetic":"/kaɪdz/","extraExplanation":["“caid”常见于历史/人类学语境，指北非地区的地方权力人物。这个词来自阿拉伯语 قائد（qāʾid，“领袖/指挥官”），在英语里多见于描述摩洛哥、阿尔及利亚等地的旧制度与殖民时期文献。现代新闻英语更常直接用“local official/commander/chief”等表达，除非特指该历史头衔。"]}
{"word":"cailcedra","summary":{"en":"“cailcedra” isn’t a standard English word; it’s likely a misspelling of “caldera” (a large volcanic crater).","zh":"“cailcedra”不是标准英文单词；很可能是“caldera”（巨大的火山塌陷口/破火山口）的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not a standard English word.) It looks like a misspelling. A common similar word is “caldera,” meaning a large bowl-shaped volcanic crater formed when a volcano collapses.","zh":"（不是标准英文单词。）看起来像拼写错误。一个常见的相近词是“caldera”，指火山塌陷后形成的巨大碗状火山口/破火山口。"},"examples":[{"en":"This seems to be a misspelling—did you mean “caldera”?","zh":"这看起来像拼写错误——你想说的是“caldera”吗？"},{"en":"Yellowstone sits on top of a massive caldera.","zh":"黄石公园位于一个巨大的破火山口之上。"}]}],"synonyms":["volcanic crater","crater","basin"],"phonetic":"/kælˈdɛrə/","extraExplanation":["“Caldera”来自西班牙语，原义接近“锅/大锅”，用来形容火山塌陷后形成的“锅状”地形。","如果你想查的不是火山相关的词，也可能你想输入的是别的单词。你可以告诉我：你在哪句话/哪段文字里看到它，或你想表达的中文意思，我就能更准确地帮你找正确拼写。"]}
{"word":"Cailean","summary":{"en":"Cailean is a Scottish Gaelic male given name, closely related to Colin.","zh":"Cailean 是一个苏格兰盖尔语男性名字，与 Colin（科林）很接近。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A masculine given name of Scottish Gaelic origin, often explained as meaning “young pup/whelp.” It is closely related to the English name Colin.","zh":"一个苏格兰盖尔语来源的男性名字，常被解释为“幼犬/小狗崽”。与英语名 Colin（科林）关系很近。"},"examples":[{"en":"Cailean moved to Boston for college.","zh":"Cailean 去波士顿上大学了。"},{"en":"His name is Cailean, but many people call him Colin in English.","zh":"他叫 Cailean，不过很多人用英语会叫他 Colin。"},{"en":"Cailean is a traditional Scottish name you may see in Gaelic-speaking families.","zh":"Cailean 是一个传统的苏格兰名字，你可能会在讲盖尔语的家庭中见到。"}]}],"synonyms":["Colin","Callum (related Gaelic name)"],"phonetic":"/ˈkælən/","extraExplanation":["“Cailean”常被视为苏格兰盖尔语名字，和“Colin”属于同一名字系统的不同拼写/形式；在英语环境里，有些人会把它读得更像“凯-伦”(KAY-lən)或“卡-伦”(KAL-ən)，具体取决于个人与地区习惯。","在文化语境上，它常让人联想到苏格兰高地/盖尔语传统；如果你在写作或自我介绍中使用该名，可以顺便说明你偏好的英文读法。"]}
{"word":"caille","summary":{"en":"“Caille” is a French culinary word meaning “quail,” used sometimes in English menus and recipes.","zh":"“caille”是法语借词（多见于餐饮语境），意思是“鹌鹑/鹌鹑肉”，英语里常用对应词是“quail”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(mainly in culinary/French contexts) a quail; the meat of a quail served as food.","zh":"（多见于法式/烹饪语境）鹌鹑；（作为食物的）鹌鹑肉。"},"examples":[{"en":"The menu lists roasted caille with herbs and garlic.","zh":"菜单上写着香草蒜香烤鹌鹑（caille）。"},{"en":"She ordered caille because she wanted to try a classic French game bird.","zh":"她点了鹌鹑（caille），因为想尝尝经典的法式野味禽类。"}]}],"synonyms":["quail"],"phonetic":"/kaɪ/","extraExplanation":["“caille”原本是法语词，意思就是“鹌鹑”。在英语里它不算常用词，通常出现在法式餐厅菜单、食谱或强调法式风格的写法中。","如果你是在英语学习中看到“caille”，很多时候可以直接把它理解为“quail（鹌鹑）”。日常英语更常用“quail”。","发音方面，在英语环境中常见把它读得接近 /kaɪ/（类似“kye”）；但在法语里读音更接近“kai/凯”。"]}
{"word":"Cailleac","summary":{"en":"Cailleac is a rare proper name, most commonly a French-origin surname; less often it may refer to a location depending on context.","zh":"Cailleac 是较少见的专有名词，最常见为法语背景的姓氏；在特定上下文中也可能指地点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare proper name (most often a French-origin surname). In English texts it typically refers to a person or family name rather than a common vocabulary word.","zh":"一个较少见的专有名词（多见于法语背景的姓氏）。在英文语境中通常指人名/家族姓氏，而不是常用词汇。"},"examples":[{"en":"Dr. Cailleac will present the research findings tomorrow.","zh":"Cailleac 医生将于明天展示研究成果。"},{"en":"I couldn’t find much information about the Cailleac family in the local archives.","zh":"我在当地档案里没找到太多关于 Cailleac 家族的信息。"}]},{"partOfSpeech":"n.","definition":{"en":"Occasionally used as a place name or name element in French contexts (less common; often confused with similar spellings).","zh":"在法语语境中偶尔也可能被用作地名或地名成分（较少见；常与相近拼写混淆）。"},"examples":[{"en":"The record mentions “Cailleac” as a location, but the spelling may be inconsistent.","zh":"记录里把“Cailleac”写成一个地点，但拼写可能不一致。"}]}],"phonetic":"/ˌkæliˈæk/","extraExplanation":["“Cailleac”不是常见英语词条，更像法语背景的专名。英文里遇到它时，通常需要看上下文：是人名（姓）、地名，还是文件/族谱中的拼写变体。","发音在英语中往往会被英语化；若是法语来源，读法可能更接近法语习惯。常见混淆来源是与其他近似拼写（例如某些法语地名/姓氏变体）相互替换。","如果你能提供一句包含它的原句或告诉我它出现在哪（人名、地名、公司名、书名等），我可以给出更准确的含义与更贴近来源语的读音建议。"]}
{"word":"cailleach","summary":{"en":"Cailleach is a Gaelic word meaning an old woman or hag, and it also refers to a famous winter-associated folklore figure in Scotland and Ireland.","zh":"Cailleach 是盖尔语词，指“老妇/老巫婆”，也可指苏格兰与爱尔兰民俗中与冬季相关的著名女性形象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scottish Gaelic / Irish) an old woman; a hag (often used in folklore or poetic language).","zh":"（苏格兰盖尔语/爱尔兰语）老妇人；老巫婆（常见于民间传说或诗意用法）。"},"examples":[{"en":"In the story, the hero meets a cailleach living alone on the hill.","zh":"在故事里，英雄遇到一位独居山上的 cailleach（老妇/巫婆）。"},{"en":"The word cailleach can be used like “old woman,” but it may sound harsh in English contexts.","zh":"cailleach 有时可当作“老妇人”，但在英语语境里往往带有不太友善、刺耳的感觉。"}]},{"partOfSpeech":"n.","definition":{"en":"In Scottish and Irish folklore, a powerful old-woman figure (often called “the Cailleach”) linked with winter, storms, and the shaping of the landscape.","zh":"（苏格兰/爱尔兰民俗）“冬之女巫/冬之老妇”式的人物（常写作 the Cailleach），与冬季、风暴以及地貌的塑造相关。"},"examples":[{"en":"Some legends say the Cailleach brings winter and controls the storms.","zh":"一些传说说 the Cailleach 带来冬天并掌控风暴。"},{"en":"In folklore retellings, the Cailleach is sometimes described as a creator of mountains and rocks.","zh":"在民俗改写故事中，the Cailleach 有时被描述为塑造山峦岩石的存在。"}]}],"synonyms":["hag","crone","old woman","witch (context-dependent)"],"phonetic":"/ˈkɑːliəx/","extraExplanation":["发音提示：cailleach 来自盖尔语，词尾的 “-ch” 常接近 /x/（类似德语 Bach 的喉擦音），英语里没有完全对应的音，所以英语使用者常把它读得更像 “KAL-yukh / KAL-ee-ukh”。","文化背景：在苏格兰与爱尔兰的口述传统中，the Cailleach 往往是古老、强大而又带威慑力的女性形象，常与冬季严寒、风暴、荒野相关；不同地区的故事版本差异很大。","用法提醒：把它翻成“女巫/老巫婆”有时能传达气质，但不一定等同于英语 witch；更中性的译法可用“老妇/老妪”，而在神话语境可译作“冬之女神/冬之老妇”。"]}
{"word":"cailliach","summary":{"en":"Cailleach (also spelled cailliach) is a Gaelic word meaning an old woman, and it’s also the name of a mythic “divine hag” associated with winter and wild landscapes in Celtic folklore.","zh":"Cailleach（也常见变体 cailliach）在盖尔语里可指“老妇人”，也可指凯尔特民间传说中与冬季与荒野地貌相关的“神圣老妪/冬之女神”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Scottish Gaelic and Irish) an old woman; often used to mean a hag or crone.","zh":"（苏格兰盖尔语和爱尔兰语）老妇人；常指“老巫婆/老妖婆”一类的老妇形象。"},"examples":[{"en":"In Gaelic stories, the cailleach is often described as a very old woman living in the hills.","zh":"在盖尔语故事里，cailleach 常被描写成住在山里的非常年老的女人。"},{"en":"The word can simply mean “old woman,” depending on context.","zh":"根据语境不同，这个词也可能只是指“老妇人”。"}]},{"partOfSpeech":"n.","definition":{"en":"A powerful figure in Celtic folklore, especially in Scotland and Ireland: a “divine hag” linked to winter, storms, mountains, and the shaping of the landscape.","zh":"凯尔特民间传说中的强大神祇形象（尤见于苏格兰与爱尔兰）：常被称为“神圣的老妪”，与冬季、风暴、群山以及塑造地貌有关。"},"examples":[{"en":"In some legends, the Cailleach brings winter and controls the weather.","zh":"在一些传说中，Cailleach 带来冬天并掌控天气。"},{"en":"Many place-name stories explain mountains as stones dropped from the Cailleach’s apron.","zh":"许多地名传说把山解释为 Cailleach 围裙里掉落的石头堆成的。"},{"en":"A novel set in the Highlands mentions the Cailleach as a symbol of harsh winter and endurance.","zh":"一部以苏格兰高地为背景的小说把 Cailleach 提到为严冬与坚韧的象征。"}]}],"synonyms":["hag","crone","old woman","winter witch","divine hag"],"phonetic":"/ˈkæl.jəx/","extraExplanation":["拼写提示：更常见的标准拼写是 **cailleach**；你写的 **cailliach** 也能见到，但多被视为变体/误拼。","发音与理解：结尾的 **-ach** 往往带有类似“清喉音”的 /x/（像德语 *Bach* 的结尾），英语母语者有时会把它简化成 /k/ 或 /h/。","文化背景：在苏格兰与爱尔兰的传统中，Cailleach 常被视为“冬之女神/冬之老妪”，与季节更替相关；在某些故事里，她也与“主权女神（sovereignty）”主题相连——国家/土地以老妇或少女形象出现，象征权力与更新。"]}
{"word":"Cailly","summary":{"en":"Cailly is mainly a French proper name (a river/place name in Normandy) and can also be a surname.","zh":"Cailly 主要是法语专名（诺曼底的河流/地名），也可作姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a French proper name, most commonly referring to the Cailly River in Normandy (Seine-Maritime), or used as a surname.","zh":"一个法语专有名词，最常见指法国诺曼底（滨海塞纳省）的“卡伊河（Cailly）”，也可用作姓氏。"},"examples":[{"en":"The Cailly River runs through several towns near Rouen in Normandy.","zh":"卡伊河流经诺曼底鲁昂附近的多个城镇。"},{"en":"In the records, her last name is Cailly.","zh":"在档案里，她的姓是 Cailly。"}]}],"phonetic":"/ˈkaɪli/","extraExplanation":["“Cailly”在英语语境中通常不会当作普通词汇使用，而是作为地名/河流名或姓氏出现，因此在阅读地图、历史资料或人物名单时更常见。","法语专名进入英语时，拼写通常保持不变；发音可能因英语化而略有差异，读到时可把它当作“一个地名/姓氏”来理解。"]}
{"word":"caimacam","summary":{"en":"Caimacam (more commonly spelled kaimakam/kaymakam) is a historical title for a district governor or an acting/deputy governor in Ottoman and related contexts.","zh":"Caimacam（更常写作 kaimakam/kaymakam）是奥斯曼及相关语境中的历史官职，指地方行政长官，也可指代理/副职官员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Historical, in the Ottoman Empire and some Middle Eastern contexts) a district governor or administrative official; also used for a deputy/acting governor.","zh":"（历史用语：奥斯曼帝国及部分中东语境）地方行政长官、区长；也可指代理/副职的行政长官。"},"examples":[{"en":"In the Ottoman period, a kaimakam governed a district and reported to higher provincial officials.","zh":"在奥斯曼时期，kaimakam 管理一个行政区，并向更高一级的省级官员汇报。"},{"en":"The documents mention an acting kaimakam appointed during the governor’s absence.","zh":"文件提到在总督不在时任命了一位代理 kaimakam。"}]}],"synonyms":["district governor","administrator","acting governor","deputy governor"],"phonetic":"/ˌkaɪməˈkɑːm/","extraExplanation":["“caimacam”常见为“kaimakam / kaymakam”的另一种拼写（多见于旧译或不同转写系统）。该词源自阿拉伯语结构，含义接近“代行者/代理者”，后来在奥斯曼与土耳其行政体系中固定为官职名称（现代土耳其语 kaymakam 常指“县/区长”一类的地方行政首长）。在英语里通常作为历史或地区研究用词出现。"]}
{"word":"caimakam","summary":{"en":"Caimakam is a historical title for an Ottoman-era official, often a district governor or an acting substitute for a higher governor.","zh":"Caimakam 是奥斯曼时代的历史官职称谓，常指地方（区/县）长官或代理更高职位（如总督）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a government official in the Ottoman Empire and some later Middle Eastern administrations, often acting as a district governor or as a temporary substitute for a higher official (such as a governor).","zh":"（奥斯曼帝国及其后一些中东政体的）官员，常指区/县级行政长官，或临时代替更高职位（如总督）的人。"},"examples":[{"en":"During the late Ottoman period, a caimakam managed local administration and reported to the provincial governor.","zh":"在奥斯曼帝国晚期，caimakam 负责地方行政并向省级总督汇报。"},{"en":"The caimakam served as acting governor while the governor was away.","zh":"总督外出期间，caimakam 代理总督职务。"}]}],"synonyms":["kaymakam","qaimmaqam","district governor","acting governor"],"phonetic":"/ˈkaɪməˌkæm/","extraExplanation":["“caimakam”也常见拼写为“kaymakam / kaimakam / qaimmaqam”。词源来自阿拉伯语“qāʾim maqām”（意为“代位者/代理者”），经土耳其语进入英语等语言。","在奥斯曼行政体系中，它通常对应一个地区（类似“区长/县长”）的长官；在不同国家与时期，职责与级别可能有所变化。阅读历史文献时可结合具体国家与年代理解。"]}
{"word":"caiman","summary":{"en":"A caiman is a large alligator-like reptile native to Central and South America.","zh":"caiman 指一种产于中南美洲、外形类似短吻鳄的大型爬行动物（凯门鳄）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large reptile related to alligators, found in Central and South America, usually living in rivers, lakes, and wetlands.","zh":"凯门鳄（与短吻鳄近亲的一类大型爬行动物），分布于中南美洲，常栖息在河流、湖泊与湿地。"},"examples":[{"en":"We spotted a caiman resting on the muddy riverbank.","zh":"我们看到一只凯门鳄趴在泥泞的河岸上休息。"},{"en":"Caimans hunt fish and other animals in slow-moving water.","zh":"凯门鳄会在水流缓慢的水域捕食鱼类和其他动物。"}]}],"synonyms":["alligator (similar animal)","crocodilian (broader group)"],"phonetic":"/ˈkeɪmən/","extraExplanation":["“caiman”常见于自然纪录片与生态文章中，指一类生活在美洲的鳄形目动物。日常英语里也有人用“caiman”泛指“中南美洲的鳄类”，但更准确地说它是一个具体类群。","词源来自西班牙语/葡萄牙语（caimán/caimão），再往前与美洲原住民语言有关。","易混词：alligator（短吻鳄，多见于美国与中国养殖/皮革语境中提到的“鳄鱼”常被泛称，但生物分类不同）；crocodile（鳄鱼/真鳄，分布更广，口鼻更尖细的形象更常见）。"]}
{"word":"caimans","summary":{"en":"Caimans are small alligator-like reptiles found mainly in Central and South America.","zh":"Caimans 指主要分布在中美洲和南美洲、外形类似小型短吻鳄的爬行动物（凯门鳄）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A caiman; a reptile like a small alligator that lives in Central and South America.","zh":"凯门鳄；一种外形像小型短吻鳄的爬行动物，主要生活在中美洲和南美洲。"},"examples":[{"en":"We saw caimans resting on the riverbank during the boat tour.","zh":"乘船游览时，我们看到凯门鳄在河岸上休息。"},{"en":"Caimans hunt fish and other small animals at night.","zh":"凯门鳄会在夜间捕食鱼和其他小动物。"}]}],"synonyms":["caiman","alligator (similar animal)","crocodilian (scientific group)"],"phonetic":"/ˈkeɪmənz/","extraExplanation":["“Caiman”通常特指生活在中南美洲的鳄形目动物，和“alligator（短吻鳄）”“crocodile（鳄鱼）”是近亲，但分布地区不同。","在英语里单数是“caiman”，复数是“caimans”。“Caiman”一词来自西班牙语，源头可追溯到加勒比地区的原住民语言。"]}
{"word":"caimitillo","summary":{"en":"Caimitillo is a regional Spanish loanword for a small tropical fruit (and its tree) related to the star apple.","zh":"Caimitillo 是地区性西语外来词，指一种与星苹果/牛奶果相关的小型热带水果及其果树。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small tropical fruit (and the tree that bears it), related to the star apple; a Spanish loanword used especially in the Caribbean and parts of Latin America.","zh":"（热带）一种小型水果（也指其果树），与“星苹果/牛奶果”同科；西班牙语外来词，常见于加勒比地区与部分拉丁美洲。"},"examples":[{"en":"In Puerto Rico, some people call the wild star apple a caimitillo.","zh":"在波多黎各，有些人把野生的星苹果叫作 caimitillo。"},{"en":"The caimitillo tree grows well in warm coastal climates.","zh":"caimitillo 果树在温暖的沿海气候里长得很好。"}]}],"synonyms":["wild star apple","satinleaf","star-apple (related)"],"phonetic":"/ˌkaɪmiˈtiːjoʊ/","extraExplanation":["“caimitillo”通常来自西班牙语的指小形式（-illo），字面有“较小的 caimito（星苹果）”之意；不同地区对它指代的具体树种可能不完全一致。","在英语里它多作为地域性词汇出现（菜单、市场、地方介绍），正式科学语境更常用拉丁学名或通用名（如 wild star apple、satinleaf 等）。"]}
{"word":"caimito","summary":{"en":"Caimito is a tropical fruit (and its tree) also known as the star apple.","zh":"Caimito 指一种热带水果（及其果树），也叫“星苹果”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical fruit and the tree that produces it, also called the star apple; it has smooth skin (often purple or green) and sweet, jelly-like flesh that shows a star pattern when cut across.","zh":"一种热带水果及其果树，也叫“星苹果”（star apple）；果皮光滑（常见紫色或绿色），果肉甜、胶质感强，横切后常呈星形花纹。"},"examples":[{"en":"In Puerto Rico, people often eat caimito chilled and spoon out the soft flesh.","zh":"在波多黎各，人们常把 caimito 冷藏后用勺子挖着吃。"},{"en":"She cut the caimito in half and pointed out the star shape inside.","zh":"她把 caimito 切成两半，指给大家看里面的星形纹路。"}]}],"synonyms":["star apple","golden-leaf tree"],"phonetic":"/kaɪˈmiːtoʊ/","extraExplanation":["“Caimito”在英语中多指“星苹果”（star apple），学名常见为 *Chrysophyllum cainito*。词源来自西班牙语/加勒比地区用语，在拉丁美洲与加勒比海地区较常见。","食用时常建议不要咀嚼或吃到果皮（部分品种果皮含乳白色黏液，口感发涩），通常是对半切开后挖果肉。"]}
{"word":"Cain","summary":{"en":"Cain is a biblical name often used to symbolize jealousy, guilt, or harming one’s own brother/family.","zh":"Cain（该隐）是《圣经》人物名，常用来象征嫉妒、罪疚，以及伤害手足/亲人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) In the Bible, the first son of Adam and Eve, who killed his brother Abel; often used as a symbol of jealousy, guilt, or brother-killing (fratricide).","zh":"（专有名词）《圣经》中亚当与夏娃的长子，该隐；他杀死了弟弟亚伯，常被用作“嫉妒、罪疚、弑兄（手足相残）”的象征。"},"examples":[{"en":"In the Bible story, Cain becomes angry when his offering is not accepted and he kills Abel.","zh":"在《圣经》故事里，该隐因自己的献祭不被悦纳而愤怒，最终杀了亚伯。"},{"en":"Some writers use Cain to represent jealousy that turns into violence.","zh":"一些作家会用“该隐”来象征由嫉妒发展成的暴力。"},{"en":"He felt like a Cain after betraying his own family.","zh":"他背叛了家人后，感觉自己像“该隐”一样有罪。"}]},{"partOfSpeech":"n.","definition":{"en":"A person seen as a murderer or traitor, especially someone who harms a close relative or friend (literary, figurative).","zh":"（文学/比喻）被视为“凶手或叛徒”的人，尤指伤害亲近亲友的人。"},"examples":[{"en":"In the novel, he is treated like a Cain for turning against his brother.","zh":"在小说里，他因反过来对付兄弟而被当作“该隐”一般的人。"},{"en":"The play paints the general as a Cain who destroys his own people.","zh":"这部戏把那位将军刻画成毁掉自己人民的“该隐”。"}]}],"phonetic":"/keɪn/","extraExplanation":["“Cain / Abel（该隐/亚伯）”的故事来自《创世记》。在英语文化中，Cain 常常带有“因嫉妒而犯下严重罪行、背负罪责”的联想。","常见相关表达：\n- the mark of Cain：该隐的记号；比喻“无法洗脱的耻辱或罪名”。\n- raise Cain：大吵大闹、惹出大麻烦（较口语）。"]}
{"word":"cain","summary":{"en":"Cain is a biblical name best known as the brother who killed Abel; it can symbolize guilt or a murderer, and it’s also used as a personal name.","zh":"Cain（该隐）最常指《圣经》中杀死亚伯的兄长；可象征罪疚或凶手，也可作人名/姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In the Bible) the first son of Adam and Eve, who murdered his brother Abel; often used as a symbol of a murderer, someone guilty, or a person marked by wrongdoing.","zh":"（《圣经》中）亚当和夏娃的长子，因杀害弟弟亚伯而闻名；常被引申为“杀人者/有罪之人/带着罪恶印记的人”的象征。"},"examples":[{"en":"In the Bible story, Cain kills his brother Abel out of jealousy.","zh":"在《圣经》的故事里，该隐出于嫉妒杀了弟弟亚伯。"},{"en":"The novel hints that the character carries a ‘Cain-like’ guilt.","zh":"小说暗示这个角色背负着“像该隐一样”的罪疚感。"}]},{"partOfSpeech":"n.","definition":{"en":"A male given name or surname.","zh":"男性名字或姓氏（该隐）。"},"examples":[{"en":"His last name is Cain.","zh":"他姓该隐。"}]}],"synonyms":["murderer (figurative)","killer (figurative)"],"phonetic":"/keɪn/","extraExplanation":["“the mark of Cain（该隐的印记）”是常见文化典故，指一种无法隐藏的罪恶标记或长期背负的羞耻与惩罚（来自上帝给该隐的记号）。","在英语文学与日常表达中，Cain 常作为“人类最早的凶手/兄弟相残”的象征，用来强调背叛、嫉妒导致的暴力或沉重的道德负担。"]}
{"word":"Cain-colored","summary":{"en":"Cain-colored means “bloodstained/blood-red,” used in literary or old-fashioned writing to suggest murder and guilt.","zh":"Cain-colored 指“染血的／血红色的”，多见于文学或古风表达，用来暗示谋杀与罪责。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(literary, archaic) Bloodstained or blood-red, suggesting murder and guilt (from the biblical story of Cain).","zh":"（文学用语，古语）染血的／血红色的，暗示谋杀与罪责（源自《圣经》中该隐的故事）。"},"examples":[{"en":"In the old poem, the hero returns with Cain-colored hands.","zh":"在那首古诗里，英雄带着“Cain-colored（染血的）”双手归来。"},{"en":"The writer describes a Cain-colored stain to hint at a hidden crime.","zh":"作者用“Cain-colored”的污迹来暗示一桩隐秘的罪行。"}]}],"synonyms":["bloodstained","blood-red","crimson","gory","bloody"],"phonetic":"ˈkeɪn ˌkʌlɚd","extraExplanation":["“Cain-colored（该隐之色）”来自《圣经·创世记》：该隐杀死弟弟亚伯后，被上帝责问并受到惩罚；因此该词常用来联想到“杀人后的血迹、罪恶感、被标记的凶手”。","这是非常少见的文学/古风表达，现代英语更常用 bloodstained, blood-red, crimson, guilty-looking 等来表达类似意思。"]}
{"word":"caine","summary":{"en":"“Caine” is mainly a surname; “-caine” is a suffix used in names of numbing medicines (local anesthetics).","zh":"“Caine”主要是姓氏；“-caine”是用于局部麻醉药（止麻药）名称的后缀。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper name) A surname (family name). It’s also used as a given name in some places.","zh":"（专有名词）一个姓氏（家族姓）。在一些地区也会被用作名字。"},"examples":[{"en":"Michael Caine is a well-known British actor.","zh":"迈克尔·凯恩是一位知名的英国演员。"},{"en":"Ms. Caine will contact you tomorrow.","zh":"Caine 女士明天会联系你。"}]},{"partOfSpeech":"other","definition":{"en":"In medicine/chemistry, “-caine” is a common ending in the names of local anesthetics (numbing medicines).","zh":"在医学/化学中，“-caine”常作为局部麻醉药（使局部麻木的药物）名称的结尾。"},"examples":[{"en":"Lidocaine is often used to numb the skin before a small procedure.","zh":"利多卡因常用于在小手术前让皮肤麻木。"},{"en":"Some people are allergic to certain “-caine” anesthetics.","zh":"有些人对某些以“-caine”结尾的麻醉药过敏。"}]}],"synonyms":["(surname)","(suffix: local anesthetics)"],"phonetic":"/keɪn/","extraExplanation":["“caine”本身在日常英语里不算常见词：最常见的情况是作为姓氏 Caine，或作为药名后缀 -caine。","如果你本来想拼的是“cane”（手杖/甘蔗/用棍打），告诉我语境（一句话也行），我可以按“cane”给你完整释义与例句。"]}
{"word":"Caines","summary":{"en":"“Caines” is most commonly a surname; more rarely, it’s the plural of “Cain.”","zh":"“Caines”最常见是姓氏；较少情况下是“Cain（该隐）”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), found in English-speaking countries.","zh":"姓氏（家族姓），在英语国家中可见。"},"examples":[{"en":"Ms. Caines will lead the meeting today.","zh":"Caines 女士今天将主持会议。"},{"en":"I saw the name Caines on the class list.","zh":"我在班级名单上看到了 Caines 这个姓。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) plural of “Cain,” meaning more than one person named Cain; sometimes used figuratively to mean “people like Cain.”","zh":"（少见）“Cain”的复数：指不止一个名叫 Cain 的人；有时也可比喻“像该隐那样的人”。"},"examples":[{"en":"The book mentions two Cains in different family branches.","zh":"这本书提到在不同家族分支里有两位叫 Cain 的人。"},{"en":"In a figurative sense, he called them “modern Cains.”","zh":"在比喻意义上，他称他们为“现代的该隐”。"}]}],"synonyms":["(surname variant) Caines ↔ Caine, Cain"],"phonetic":"/keɪnz/","extraExplanation":["“Cain（该隐）”来自《圣经·创世记》，是亚当和夏娃的长子，因嫉妒杀死兄弟亚伯（Abel）。因此在英语文化里，Cain 常带有“罪与嫉妒、兄弟相残”的象征意义。","作为姓氏时，Caines 常被视为 Cain/Caine 的变体拼写；在不同地区，拼写与读音可能略有差异。"]}
{"word":"Caingang","summary":{"en":"Caingang is an alternative spelling of Kaingang, referring to an Indigenous people in southern Brazil and their language.","zh":"Caingang 是 Kaingang 的另一种拼写，指巴西南部的原住民族及其语言。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a spelling variant of Kaingang: an Indigenous people of southern Brazil, and also the name of their language.","zh":"Kaingang（也拼作 Caingang）：巴西南部的一个原住民族；也可指他们所使用的语言。"},"examples":[{"en":"The museum has a small collection of Caingang artifacts from southern Brazil.","zh":"这家博物馆收藏了一些来自巴西南部的 Caingang（Kaingang）文物。"},{"en":"She is studying the Caingang language as part of her work in Indigenous linguistics.","zh":"她正在研究 Caingang（Kaingang）语言，作为原住民语言学研究的一部分。"}]}],"synonyms":["Kaingang","Kaingáng"],"phonetic":"/ˈkaɪ.ɪŋ.ɡæŋ/","extraExplanation":["“Caingang”更常见于较早的葡萄牙语/学术拼写或转写；在英语与当代学术资料中，“Kaingang”更常用。","在写作中，若指“民族”可用复数（the Kaingang/Caingang）；若指“语言”通常用单数（the Kaingang language）。"]}
{"word":"caingang","summary":{"en":"“Caingang” isn’t recognized as a standard English word; it likely needs context or a corrected spelling.","zh":"“caingang”不是标准英语单词；很可能需要上下文或纠正拼写才能确定含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a name, or a romanization (pinyin) from another language.","zh":"不是标准英语单词，可能是拼写错误、人名/地名，或其他语言的拼音（如中文拼音）。"},"examples":[{"en":"I can’t find “caingang” in major English dictionaries—could you share the sentence where you saw it?","zh":"我在主要英语词典里找不到“caingang”——你能提供你看到它的句子吗？"},{"en":"If you meant “chaingang,” the spelling is different and the meaning changes.","zh":"如果你想写的是“chaingang”，拼写不同，意思也会变。"}]}],"phonetic":"/ˈkeɪnɡæŋ/","extraExplanation":["“caingang”很可能是：\n1）拼写错误：例如有人想写“chaingang（chain gang）”。\n2）专有名词：人名、网名、店名、游戏ID等，通常不收录在词典。\n3）中文拼音：可能对应“才刚/菜港/蔡刚/采钢/财纲”等多种可能，需上下文才能确定。\n\n把你看到它的完整句子（或它来自哪个领域：游戏/地名/人名/社交媒体）发我，我可以帮你判断最可能的意思与正确拼写。"]}
{"word":"Caingangs","summary":{"en":"“Caingangs” usually refers to the Kaingang people (plural) in southern Brazil or their language; it’s often a spelling variant of “Kaingang.”","zh":"“Caingangs”通常指巴西南部的Kaingang族（复数）或其语言；常见为“Kaingang”的拼写变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plural form of Kaingang: an Indigenous people of southern Brazil, or their language.","zh":"Kaingang（凯恩甘/卡因甘）的复数：指巴西南部的一个原住民族，或指他们的语言。"},"examples":[{"en":"The museum has an exhibit about the Kaingangs of southern Brazil.","zh":"这家博物馆有一个关于巴西南部Kaingang（Kaingang族）的展览。"},{"en":"Some researchers work with Kaingang communities to document the Kaingang language.","zh":"一些研究人员与Kaingang社群合作记录Kaingang语言。"}]}],"synonyms":["Kaingang","Kaingang people","Kaingang language"],"phonetic":"/kaɪˈɪŋɡæŋ/","extraExplanation":["“Kaingang”更常见的拼写是 K-a-i-n-g-a-n-g；“Caingangs”有时是早期或其他语言（如葡萄牙语）转写影响下出现的拼写变体。","作为族群名称时通常大写（Kaingang/Kaingangs）。在英语里也常见“the Kaingang (people)”这种用法，用单数形式指整个族群。"]}
{"word":"caingin","summary":{"en":"Caingin is a regional term (often spelled kaingin) for slash-and-burn farming, where land is cleared by cutting and burning vegetation.","zh":"Caingin（常拼作 kaingin）是地区性用语，指通过砍伐并焚烧植被来清理土地的刀耕火种式耕作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A farming method in which a small area of forest or brush is cut and burned so crops can be grown on the cleared land (a type of slash-and-burn agriculture).","zh":"一种把森林或灌木砍伐后焚烧、再在清理出的土地上种植作物的耕作方式（属于“刀耕火种/烧垦农业”）。"},"examples":[{"en":"Some communities still practice caingin to grow rice and vegetables on hillside land.","zh":"一些社区仍会用 caingin 的方式在山坡地种植稻米和蔬菜。"},{"en":"The government introduced programs to reduce caingin because it can lead to soil erosion.","zh":"政府推出项目来减少 caingin，因为它可能导致水土流失。"}]}],"synonyms":["slash-and-burn","swidden farming"],"phonetic":"/ˈkaɪɪŋ/","extraExplanation":["“caingin”常见于菲律宾语境，更常见的拼写是“kaingin”（源自他加禄语 Tagalog）。在英语文章里多用于讨论菲律宾的农业、森林砍伐与环境保护议题。","相关近义概念：swidden（轮歇刀耕火种）、slash-and-burn（刀耕火种/烧荒）。语气上“caingin/kaingin”更像一个地区性的专门名词。"]}
{"word":"Caingua","summary":{"en":"Caingua is a South American vegetable (also spelled caigua), a hollow green gourd often cooked or stuffed.","zh":"Caingua（也写作 caigua）是一种南美蔬菜，绿色中空，常用来烹饪或做填馅菜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(also caigua) a green, hollow South American gourd-like vegetable (Cyclanthera pedata), often stuffed or cooked; sometimes called “stuffing cucumber.”","zh":"（也作 caigua）一种南美的绿色中空葫芦科蔬菜（学名 Cyclanthera pedata），常用来填馅或烹饪；有时被称为“可填馅的黄瓜”。"},"examples":[{"en":"In Peru, caingua is often stuffed with meat and baked.","zh":"在秘鲁，caingua 常被塞入肉馅后烘烤。"},{"en":"The recipe calls for caingua, but you can substitute zucchini if you can’t find it.","zh":"食谱需要用 caingua；如果买不到，也可以用西葫芦代替。"}]}],"synonyms":["caigua","stuffing cucumber","Cyclanthera pedata"],"phonetic":"/kaɪˈɡwɑː/","extraExplanation":["“Caingua/caigua”多见于拉丁美洲（尤其秘鲁、玻利维亚）饮食语境；英语里属于较少见的外来词，拼写可能因地区或转写而不同（如 caigua、caihua 等）。","它外形像小黄瓜但内部通常是中空的，因此很适合做“填馅（stuffed）”菜。购物或查菜谱时可搭配关键词：caigua vegetable / stuffing cucumber / Cyclanthera pedata。"]}
{"word":"caingua","summary":{"en":"“Caingua” is usually a South American place name, often written as “Cainguás” in Argentina.","zh":"“Caingua” 通常是南美的地名，多见于阿根廷写作 “Cainguás”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name in South America, most commonly referring to Cainguás (a department/region) in Misiones Province, Argentina.","zh":"南美的地名，最常见指阿根廷米西奥内斯省的 Cainguás（一个行政区/地区）。"},"examples":[{"en":"Cainguás is one of the departments of Misiones Province in Argentina.","zh":"Cainguás 是阿根廷米西奥内斯省的一个行政区。"},{"en":"The park lies near towns in the Cainguás area.","zh":"这座公园位于 Cainguás 地区附近的一些城镇旁。"}]},{"partOfSpeech":"other","definition":{"en":"a less common spelling/romanization you may see for related local names in the Guaraní/Spanish-speaking region (often written with an accent as “Cainguás”).","zh":"在讲瓜拉尼语/西班牙语地区可能出现的较少见拼写或转写形式（常见带重音写作 “Cainguás”）。"},"examples":[{"en":"You may also see it spelled Cainguás in maps and official documents.","zh":"在地图和官方文件中，你也可能看到它写作 Cainguás。"}]}],"synonyms":["Cainguás","Cainguá"],"phonetic":"/kaɪnˈɡwɑː/","extraExplanation":["“Caingua/ Cainguá(s)”多见于南美（尤其阿根廷、巴拉圭、巴西交界附近）的地名语境。英语里通常当作专有名词使用，发音会因说话者而略有差异。","如果你其实想查的是蔬菜 “caigua”（也写作 “caihua”，一种南美葫芦科植物，英文常叫 slipper gourd），拼写会少一个 n：caigua。你可以告诉我你指的是地名还是蔬菜，我可以按正确词条补充。"]}
{"word":"Cainian","summary":{"en":"Cainian describes something connected to Cain—often suggesting jealousy, betrayal, or brother-killing.","zh":"Cainian 指与该隐相关的（常暗示嫉妒、背叛或兄弟相残）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Cain (in the Bible), often implying jealousy, betrayal, or the killing of one’s own brother (fratricide).","zh":"与《圣经》中该隐（Cain）有关的；常含“嫉妒、背叛、弑兄（兄弟相残）”等意味。"},"examples":[{"en":"The novel explores a Cainian rivalry between two brothers competing for their father’s approval.","zh":"这部小说探讨了两兄弟为争取父亲认可而产生的“该隐式”对立与竞争。"},{"en":"His Cainian anger felt sudden and destructive, as if aimed at someone close to him.","zh":"他的“该隐式”愤怒来得突然而具有破坏性，仿佛把矛头指向了亲近的人。"}]},{"partOfSpeech":"n.","definition":{"en":"A person whose actions resemble Cain’s—especially someone capable of betraying or harming a close relative or companion.","zh":"（文学/修辞）“该隐式的人”：指行为像该隐的人，尤指会背叛或伤害亲近之人者。"},"examples":[{"en":"In the poem, the speaker fears becoming a Cainian to those who love him.","zh":"在诗中，叙述者害怕自己会变成伤害爱他之人的“该隐式的人”。"}]}],"synonyms":["fratricidal","treacherous","betraying","brother-against-brother"],"phonetic":"/ˈkeɪniən/","extraExplanation":["“Cainian”源自《创世记》（Genesis）中的故事：该隐因嫉妒杀死弟弟亚伯（Abel）。因此在文学、评论或新闻写作中，“Cainian”常用来暗示“兄弟相残/同室操戈”、深层嫉妒与背叛等主题。","与常见词“fratricidal（弑兄的）”相比，“Cainian”更带有宗教与文学典故色彩，语气更隐喻、更具象征意义。"]}
{"word":"cainian","summary":{"en":"“Cainian” is a rare adjective meaning “connected with Cain (from the Bible),” often implying jealousy or fratricidal conflict.","zh":"“Cainian”是很少见的形容词，意思是“与《圣经》中的该隐有关”，常带有嫉妒或兄弟相残等含义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Cain (a figure in the Bible), or having qualities traditionally associated with him (especially jealousy or violence); very rare/archaic in modern English.","zh":"与《圣经》人物该隐（Cain）有关的；或指传统上与“该隐”联系的特质（尤指嫉妒、暴力）；现代英语中很少见/较古旧。"},"examples":[{"en":"Some older religious writing describes a “Cainian spirit” of jealousy and anger.","zh":"一些较旧的宗教文字会用“Cainian spirit（该隐式的精神）”来形容嫉妒与愤怒。"},{"en":"The poem hints at a Cainian conflict between brothers.","zh":"这首诗暗示了兄弟之间带有“Cainian（该隐式）”色彩的冲突。"}]}],"synonyms":["Cain-like","fratricidal (in meaning/context)"],"phonetic":"/ˈkeɪniən/","extraExplanation":["“Cainian”来自人名 Cain（该隐）。在《旧约·创世记》中，该隐因嫉妒杀害了弟弟亚伯（Abel），因此英语里提到 Cain 往往会联想到“兄弟相残、嫉妒、暴力”等象征意义。","如果你想查的是中文“概念”（gàiniàn）的拼音，常见英文对应是 concept；而“cainian”并不是常用的英文拼写。你也可以告诉我你想表达的中文词或句子，我可以帮你找最合适的英文。"]}
{"word":"Cainish","summary":{"en":"Cainish means “like Cain”: marked by jealous, hateful, or brother-against-brother violence.","zh":"Cainish 意为“像该隐一样的”：带有嫉妒、仇恨或手足相残的暴力意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like Cain in the Bible; showing violent jealousy, hatred, or a readiness to harm a close relation (especially a brother).","zh":"像《圣经》中该隐一样的；带有强烈嫉妒、仇恨或对亲近之人（尤指兄弟）施暴倾向的。"},"examples":[{"en":"In the novel, his Cainish envy of his brother drives him to betrayal.","zh":"在小说里，他对兄弟那种“该隐式”的嫉妒最终把他推向背叛。"},{"en":"The poet warns that Cainish anger can destroy a family from within.","zh":"诗人警告说，“该隐式”的愤怒会从内部摧毁一个家庭。"}]}],"synonyms":["jealous","hateful","murderous","fratricidal","Cain-like"],"phonetic":"/ˈkeɪnɪʃ/","extraExplanation":["“Cainish”来自该隐（Cain）。在《创世记》中，该隐因嫉妒杀害兄弟亚伯（Abel），因此该词常用来形容“手足相残/兄弟阋墙”的暴力与嫉妒色彩。","这是一个较少见、带文学或宗教典故色彩的形容词；日常表达中更常见的说法有 “jealous,” “murderous,” “fratricidal (兄弟相残的),” 或 “like Cain.”"]}
{"word":"cainish","summary":{"en":"Cainish means “like Cain,” often describing violent, envious, or fratricidal behavior and the guilt associated with it.","zh":"Cainish 指“像该隐一样”，常形容带有嫉妒、暴力、兄弟相残等意味，并暗示罪疚感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like Cain (in the Bible); showing violent, hateful, or brother-against-brother qualities—often suggesting guilt, envy, or the act of killing a close relative.","zh":"像《圣经》中的该隐；带有暴力、仇恨或“兄弟相残”特征的（常暗示罪疚、嫉妒，或杀害近亲的行为/倾向）。"},"examples":[{"en":"The novel describes a Cainish rivalry that turns brothers into enemies.","zh":"小说描写了一种“该隐式”的对立，把兄弟变成了仇敌。"},{"en":"His Cainish jealousy pushed him to betray his closest friend.","zh":"他“该隐式”的嫉妒驱使他背叛了最亲近的朋友。"}]}],"synonyms":["fratricidal","murderous","bloodthirsty","violent","ruthless"],"phonetic":"/ˈkeɪnɪʃ/","extraExplanation":["“Cainish”来自《圣经·创世记》中该隐（Cain）与亚伯（Abel）的故事：该隐因嫉妒杀死了弟弟亚伯，因此“Cainish”常用来指“兄弟相残/同类相残”的暴力与罪责感。","这是一个比较文学化、带强烈道德评判色彩的形容词，常见于写作、评论或严肃语境；日常口语里更常用 murderous（凶残的）、fratricidal（兄弟相残的）或 bitter/violent rivalry（激烈/暴力的对立）。"]}
{"word":"Cainism","summary":{"en":"Cainism is a rare word meaning identification with Cain—often implying jealous hostility or fratricidal spirit; in literary contexts it can also mean admiration of Cain-like rebellion.","zh":"Cainism 是个较罕见的词，指对《圣经》中该隐的认同，常暗示嫉妒敌意或兄弟相残；在文学语境中也可指对“该隐式反叛”的推崇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A belief or attitude that identifies with Cain in the Bible—often implying hostility, jealousy, or a spirit of fratricide (violence against one’s “brother”).","zh":"（罕见）一种把自己与《圣经》中的该隐认同的信念或态度，常含有敌意、嫉妒或“弑兄/兄弟相残”的意味。"},"examples":[{"en":"Some critics use the word “Cainism” to describe a character’s jealous hatred of a brother figure.","zh":"一些评论家用“Cainism”来形容角色对“兄弟式人物”的嫉妒与仇恨。"},{"en":"In that essay, “Cainism” stands for a mindset that turns rivalry into violence.","zh":"在那篇文章里，“Cainism”指一种把竞争升级为暴力的心态。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare, literary) A worldview that treats rebellion against moral or religious authority as admirable, sometimes linked to “Byronic” or Romantic portrayals of Cain.","zh":"（罕见，文学用法）一种把反抗道德或宗教权威视为可敬的世界观，有时与浪漫主义/“拜伦式”对该隐的描写相关。"},"examples":[{"en":"The novel hints at a kind of “Cainism,” praising the hero’s defiance as noble.","zh":"这部小说暗示一种“Cainism”，把主人公的反抗称颂为高贵。"},{"en":"In Romantic criticism, “Cainism” may refer to sympathetic readings of Cain as a rebel.","zh":"在浪漫主义文学批评中，“Cainism”有时指对该隐作为“反叛者”的同情式解读。"}]}],"synonyms":["fratricidal spirit","brother-hatred","jealous hostility","Byronic rebellion (contextual)"],"phonetic":"/ˈkeɪnɪzəm/","extraExplanation":["“Cainism”源自《圣经·创世记》中该隐（Cain）杀害弟弟亚伯（Abel）的故事，因此这个词常带有“嫉妒—敌意—兄弟相残”的象征意义。","文学语境里它有时和拜伦（Lord Byron）的戏剧《Cain》（1821）相关：作品把该隐写成更具哲思与反抗精神的人物，所以“Cainism”也可能指对这种反叛气质的推崇。"]}
{"word":"cainism","summary":{"en":"Cainism is jealous, hostile, often fratricidal hatred—an attitude like Cain’s in the Bible.","zh":"Cainism 指“该隐式”的嫉妒与敌意，常暗含兄弟相残或同类相残的仇恨。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an attitude of jealousy, hostility, or violence toward others (especially toward a brother or close rival), like Cain in the Bible; fratricidal hatred.","zh":"（源自《圣经》中该隐的形象）对他人（尤其是兄弟或亲近对手）的嫉妒、敌意或暴力倾向；“兄弟相残”式的仇恨。"},"examples":[{"en":"The novel portrays the brothers’ relationship as a kind of Cainism, driven by envy and resentment.","zh":"这部小说把兄弟关系写成一种“该隐式”的仇恨，由嫉妒与怨恨推动。"},{"en":"Some critics warned that extreme political rivalry can slide into Cainism, where opponents are treated like enemies to be destroyed.","zh":"一些评论者警告，极端的政治对立可能滑向“该隐主义”，把对手当成必须消灭的敌人。"}]}],"synonyms":["fratricidal hatred","brotherly rivalry","envy","malice","animosity"],"phonetic":"/ˈkeɪnɪzəm/","extraExplanation":["“Cainism”来自《圣经·创世纪》：该隐（Cain）因嫉妒杀害弟弟亚伯（Abel），常被用作“嫉妒导致的兄弟相残/同类相残”的象征。","这个词在现代英语中比较少见，常见于文学评论、历史/政治评论等较正式的语境，用来强调“仇恨来自嫉妒、并且发生在本应亲近的人之间”。"]}
{"word":"Cainite","summary":{"en":"Cainite usually means “related to Cain” or “like Cain,” and can also refer to the early group called the Cainites.","zh":"Cainite 通常指“与该隐有关”或“像该隐一样的人/特质”，也可指早期的“该隐派（Cainites）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person descended from Cain (in the Bible), or a person thought to resemble Cain in character (for example, violent or morally corrupt).","zh":"（《圣经》中）该隐的后裔；或指被认为在性格上像该隐的人（如暴力、道德败坏等）。"},"examples":[{"en":"In the novel, the murderer is described as a Cainite figure, marked by jealousy and guilt.","zh":"在小说里，凶手被描写成一个“该隐式”的人物，充满嫉妒与罪疚。"},{"en":"The preacher warned against living like a Cainite, turning anger into harm.","zh":"牧师告诫人们不要像“该隐之人”那样生活，把愤怒变成伤害。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Cain or to the Cainites (an early religious group).","zh":"与该隐有关的；或与“该隐派”（早期宗教团体）有关的。"},"examples":[{"en":"The painting uses Cainite imagery: a brother, a field, and a dark mark.","zh":"这幅画使用了该隐相关的意象：兄弟、田野，以及黑暗的印记。"},{"en":"She wrote a short article on Cainite themes in medieval literature.","zh":"她写了一篇短文，讨论中世纪文学中的“该隐主题”。"}]}],"synonyms":["of Cain","cain-like","Cainites"],"phonetic":"/ˈkeɪnaɪt/","extraExplanation":["“Cainite”源自《圣经·创世记》中的该隐（Cain）：他因嫉妒杀害弟弟亚伯（Abel），因此在英语文学里常被当作“嫉妒、暴力、兄弟相残与罪疚”的象征。","历史上“Cainites / 该隐派”也指一个早期诺斯替（Gnostic）团体（约2世纪），据一些教父文献记载，他们对《圣经》中某些被视为“反派”的人物持特殊解读。这个用法较少见，多出现在宗教史或学术语境。"]}
{"word":"cainite","summary":{"en":"“Cainite” most often means ‘related to Cain’ or ‘a Cain-like person’ in a literary sense; it can also mean a mineral (more commonly spelled “kainite”).","zh":"“cainite”最常指“与该隐有关/像该隐一样的人”（偏文学用法）；也可指一种矿物（更常拼作“kainite”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person thought to be like Cain in the Bible; someone seen as sinful, violent, or morally corrupt (often used in a literary or old-fashioned way).","zh":"该隐式的人；被认为像《圣经》中该隐那样有罪、暴力或道德败坏的人（多见于文学或较旧的用法）。"},"examples":[{"en":"In the novel, the murderer is described as a cainite figure, marked by guilt and exile.","zh":"在小说中，凶手被描写成一个“该隐式”的人物，被罪疚与流放所标记。"},{"en":"He used “cainite” as an insult, suggesting betrayal within the family.","zh":"他把“cainite”当作辱骂，暗示家族内部的背叛。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Cain, especially suggesting guilt, brother-against-brother violence, or being cursed/exiled.","zh":"与该隐有关的；尤指带有罪疚、兄弟相残或受诅咒/被放逐之意的。"},"examples":[{"en":"The poem’s cainite imagery centers on jealousy and irreversible choices.","zh":"这首诗的“该隐式”意象聚焦于嫉妒与不可逆的选择。"},{"en":"They spoke of a cainite curse passed down through generations.","zh":"他们谈到一种代代相传的“该隐式”诅咒。"}]},{"partOfSpeech":"n.","definition":{"en":"a mineral: hydrated potassium magnesium sulfate chloride, often found in evaporite deposits (also spelled “kainite”).","zh":"一种矿物：含水的钾镁硫酸氯化物，常见于蒸发岩矿床（也拼作“kainite”）。"},"examples":[{"en":"The report lists cainite among the salts formed as the lake evaporated.","zh":"报告将 cainite 列为湖水蒸发后形成的盐类之一。"},{"en":"Cainite/kainite can be associated with potash mining in evaporite basins.","zh":"Cainite/kainite 可能与蒸发岩盆地中的钾盐开采有关。"}]}],"synonyms":["Cain-like","fratricidal","kainite"],"phonetic":"/ˈkeɪ.naɪt/","extraExplanation":["“cainite”源自《创世记》中该隐（Cain）的故事：他因嫉妒杀害兄弟亚伯（Abel），因此在英语文学里，“Cain/Cainite”常象征“手足相残、罪疚、被放逐或受诅咒”。这种用法偏文学色彩，日常对话中不常见。","矿物义项里更常见的拼写是“kainite”。两者指同一种矿物，属于蒸发沉积形成的盐类。"]}
{"word":"Cainitic","summary":{"en":"Cainitic means “related to Cain,” often suggesting guilt, violence, or a ‘mark’ linked to fratricide.","zh":"Cainitic 指“与该隐有关/该隐式的”，常含“罪疚、暴力或弑兄之印记”的象征意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Cain (in the Bible) or to Cain’s character—especially the idea of being violent, guilty, or marked by fratricide (killing one’s brother).","zh":"与《圣经》中的该隐有关；或指具有该隐式的特征——尤指暴力、罪责感、或“弑兄”所带来的烙印。"},"examples":[{"en":"Some writers describe the murderer as having a Cainitic mark, as if guilt were visible.","zh":"有些作家把凶手描写成带着“该隐式的印记”，仿佛罪恶能被看见。"},{"en":"The novel frames the rivalry between brothers in Cainitic terms.","zh":"这部小说用“该隐式”的角度来呈现兄弟间的竞争与冲突。"}]}],"synonyms":["Cainite","Cainaic","fratricidal","murderous"],"phonetic":"/keɪˈnɪtɪk/","extraExplanation":["“Cainitic”来自 Cain（该隐）+ 形容词后缀 -itic，意思是“像……的/与……有关的”。在英语里更常见的相关词是 “Cainite / Cainitic (rare)”（该隐的/该隐式的）。","文化背景：该隐是《创世记》中亚当和夏娃的长子，他因嫉妒杀害弟弟亚伯（Abel）。上帝给他“记号/印记”（the mark of Cain），既是惩罚的象征，也常被文学作品用来隐喻罪疚、暴力冲动或无法摆脱的道德污点。","文学语境：在讨论“兄弟相残”“原罪/罪疚”“人类暴力本性”等主题时，评论文章可能用 Cainitic 来强调一种象征性的、带有宗教与道德色彩的解读。"]}
{"word":"cainitic","summary":{"en":"Cainitic means “of or like Cain,” often implying guilt, exile, or fratricidal symbolism in literary contexts.","zh":"Cainitic 意为“与该隐有关或像该隐的”，多用于文学语境，暗示罪疚、放逐或弑兄等象征。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(literary, rare) Relating to Cain in the Bible, or suggesting the qualities traditionally associated with Cain (especially guilt, exile, or fratricide).","zh":"（文学用语，较少见）与《圣经》中的该隐有关；或带有传统上与该隐相关的特质（尤指负罪感、被放逐、或兄弟相残）。"},"examples":[{"en":"The novel paints a Cainitic figure haunted by guilt after betraying his own brother.","zh":"这部小说描绘了一个“该隐式”的人物：在背叛亲兄弟后被罪疚感纠缠。"},{"en":"His Cainitic restlessness kept him wandering, unable to return home.","zh":"他那种“该隐式”的不安使他不断漂泊，无法回家。"}]}],"synonyms":["Cain-like","fratricidal (when referring to brother-killing)","biblical"],"phonetic":"/keɪˈnɪtɪk/","extraExplanation":["“Cainitic”源自 Cain（该隐）+ 形容词后缀 -itic，常见于文学批评或较正式的描写中，用来借用“该隐”的文化意象：犯下不可挽回的罪、被标记与流放、良知折磨等。","现代英语里更常见的相关词有：Cain-like（像该隐的）、Cainite（该隐的追随者/相关的，较少见）、以及更通用的 fratricidal（弑兄的）。"]}
{"word":"cainogenesis","summary":{"en":"Cainogenesis means the development or emergence of new traits, especially in evolutionary biology.","zh":"Cainogenesis 指新的性状/特征的出现或形成，常用于进化生物学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology, evolution) The appearance of new characteristics (new traits or features) in an organism, especially traits that arise later in development and are not found in ancestors.","zh":"（生物学/进化）个体出现新的特征（新的性状/形态），尤指在发育后期才出现、祖先中没有的特征。"},"examples":[{"en":"Some biologists once used the term “cainogenesis” to describe novel features that appear late in an animal’s development.","zh":"一些生物学家曾用“cainogenesis”来描述动物在发育后期出现的新颖特征。"},{"en":"The paper discusses cainogenesis as one possible explanation for how complex structures could arise over evolutionary time.","zh":"这篇论文把“cainogenesis”作为复杂结构在进化过程中如何出现的一种可能解释。"}]}],"synonyms":["evolutionary novelty","novel trait","innovation (in evolution)"],"phonetic":"/ˌkaɪnoʊˈdʒɛnəsɪs/","extraExplanation":["这是一个非常少见、偏历史性的进化生物学术语；现代写作中更常见的相关表达是“evolutionary novelty（进化新颖性）”“novel trait（新性状）”。","词源提示：caino- 来自希腊语 *kainos*（“新的”），-genesis 表示“产生/起源”。","在一些早期讨论中，它常与“palingenesis（重现祖先特征/回归性发育）”对比，用来区分“真正新出现的特征”与“祖先特征的再现”。"]}
{"word":"Cainozoic","summary":{"en":"Cainozoic is a less common spelling of Cenozoic, the current geological era (66 million years ago to today).","zh":"Cainozoic 是 Cenozoic（新生代）的较少见拼写，指从约6600万年前至今的现行地质时代。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Geology) Another spelling of “Cenozoic”: the most recent major era of Earth’s history, from about 66 million years ago to the present, when mammals became the dominant land animals.","zh":"（地质学）“Cenozoic（新生代）”的另一种拼写：地球历史上最近的一个大地质时代，约从6600万年前至今，哺乳动物在陆地上占主导地位。"},"examples":[{"en":"Dinosaurs disappeared before the Cainozoic era began.","zh":"恐龙在新生代（Cainozoic）开始之前就消失了。"},{"en":"Many modern mammals evolved during the Cainozoic.","zh":"许多现代哺乳动物是在新生代（Cainozoic）期间演化出来的。"},{"en":"The textbook uses “Cenozoic,” but older papers may say “Cainozoic.”","zh":"这本教材用的是“Cenozoic”，但较早的论文可能会写“Cainozoic”。"}]}],"synonyms":["Cenozoic","Cenozoic Era"],"phonetic":"/ˌseɪnəˈzoʊɪk/","extraExplanation":["“Cainozoic”多见于英式或较旧的学术写法；现代科学写作中更常用“Cenozoic”。两者意义相同。","词源来自希腊语：kainos（新的）+ zoe（生命），意思是“新生命的时代”。在地质年代划分中，新生代之后不再细分为“代”级别更大的单位，而常讨论其内部的“纪”（如古近纪、新近纪、第四纪）。"]}
{"word":"cainozoic","summary":{"en":"Cenozoic (also spelled Cainozoic) is the geologic era from about 66 million years ago to the present, often called the “Age of Mammals.”","zh":"Cenozoic（亦拼作 Cainozoic）指距今约6600万年至今的新生代，常被称为“哺乳动物的时代”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the most recent geologic era, from about 66 million years ago to today, when mammals became the dominant land animals; it includes the Paleogene, Neogene, and Quaternary periods","zh":"新生代：距今约6600万年至今的地质年代，在这一时期哺乳动物成为陆地上的优势动物；包括古近纪、新近纪和第四纪"},"examples":[{"en":"Dinosaurs died out at the end of the Mesozoic, and the Cenozoic began soon after.","zh":"恐龙在中生代末期灭绝，新生代随后开始。"},{"en":"Most modern mammals and birds evolved during the Cenozoic.","zh":"大多数现代哺乳动物和鸟类在新生代演化形成。"},{"en":"Humans appear very late in the Cenozoic era.","zh":"人类在新生代很晚才出现。"}]}],"synonyms":["Age of Mammals"],"phonetic":"/ˌsiːnəˈzoʊɪk/","extraExplanation":["“Cainozoic”是“Cenozoic”的另一种拼写（较常见于英式/学术拼写），都指“新生代”。词源来自希腊语：kainos（新的）+ zōē（生命），字面意思是“新生命的时代”。","学习提示：地质年代常用的三大“代”是 Paleozoic（古生代）、Mesozoic（中生代）、Cenozoic/Cainozoic（新生代）。"]}
{"word":"cains","summary":{"en":"“Cains” most commonly means the plural of “Cain” (people named Cain), and it can also be used symbolically for Cain-like figures in literature.","zh":"“Cains”通常是“Cain”的复数（指多个名为 Cain 的人），也可在文学中象征“该隐式”的人物形象。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Plural of Cain: more than one person named Cain (a given name or surname).","zh":"Cain 的复数：指不止一个名叫 Cain 的人（可作名或姓）。"},"examples":[{"en":"Two Cains are listed in the class roster.","zh":"班级名单上有两位姓（或名）为 Cain 的同学。"},{"en":"The book compares several Cains in different myths and stories.","zh":"这本书比较了不同神话与故事中的多个“Cain”形象。"}]},{"partOfSpeech":"other","definition":{"en":"In literature or discussion, “Cains” can mean people like Cain—figures associated with betrayal, jealousy, or the first murder (from the Bible story of Cain and Abel).","zh":"在文学或讨论中，Cains 可指“像该隐一样的人”——与背叛、嫉妒或“第一次谋杀”形象相关（源自《圣经》中该隐与亚伯的故事）。"},"examples":[{"en":"The novel is filled with Cains and Abels—siblings torn apart by jealousy.","zh":"小说里充满了“该隐与亚伯”式的人物——手足因嫉妒而分裂。"},{"en":"He warns against becoming one of the Cains of history.","zh":"他警告人们不要成为历史上的“该隐式人物”。"}]}],"synonyms":["people named Cain","Cain-like figures"],"phonetic":"/keɪnz/","extraExplanation":["“Cain（该隐）”来自《圣经·创世记》：Cain 因嫉妒杀害兄弟 Abel（亚伯），常被当作“嫉妒、罪与兄弟相残”的象征。英语里有习语 **raise Cain**，意思是“惹出大乱子/大吵大闹”。","拼写提醒：**cains** 很容易与 **canes**（cane 的复数：手杖/藤条/甘蔗）混淆；两者发音相同 /keɪnz/，但意思完全不同。"]}
{"word":"Cainsville","summary":{"en":"Cainsville is a place name used for locations in the U.S. and Canada.","zh":"Cainsville 是一个地名，可指美国和加拿大的不同地点。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a small city in northern Missouri, USA (Harrison County).","zh":"美国密苏里州北部（哈里森县）的一个小城镇名。"},"examples":[{"en":"She grew up near Cainsville, Missouri, and moved to Kansas City after college.","zh":"她在密苏里州的凯恩斯维尔附近长大，大学毕业后搬到了堪萨斯城。"},{"en":"The storm track passed close to Cainsville, so local roads were briefly closed.","zh":"风暴路径靠近凯恩斯维尔，因此当地道路短暂封闭。"}]},{"partOfSpeech":"other","definition":{"en":"a community/neighborhood name in Ontario, Canada (near Brantford).","zh":"加拿大安大略省（靠近布兰特福德）的一个社区/地名。"},"examples":[{"en":"They rented a house in Cainsville, Ontario, for a quieter commute.","zh":"他们在安大略省的凯恩斯维尔租了房子，通勤更安静。"},{"en":"The bus route runs from downtown Brantford to Cainsville.","zh":"这条公交线路从布兰特福德市中心开往凯恩斯维尔。"}]}],"synonyms":["(no direct synonyms; proper place name)"],"phonetic":"/ˈkeɪnzvɪl/","extraExplanation":["“Cainsville”是典型的英语地名构词：人名/姓氏 Cain + 后缀 -ville（意为“城镇、聚落”），常表示“某人建立或与某家族相关的地方”。","作为专有名词，通常不翻译其含义而是音译（如“凯恩斯维尔”）。书写时首字母大写。"]}
{"word":"caique","summary":{"en":"A caique is a small, light boat used especially around the eastern Mediterranean.","zh":"caique 指一种常见于东地中海沿岸的小而轻的船。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, light boat, especially a narrow rowing or sailing boat used in the eastern Mediterranean (often spelled “caïque”).","zh":"（尤指东地中海地区的）小而轻的窄船，常用于划桨或帆行（也常拼作 caïque）。"},"examples":[{"en":"We took a caique from the harbor to a quiet beach.","zh":"我们从港口坐一艘小船（caique）去了一个安静的海滩。"},{"en":"Fishermen pulled their caique onto the sand at dusk.","zh":"黄昏时，渔民把他们的小船拖上了沙滩。"}]}],"synonyms":["small boat","dinghy","skiff"],"phonetic":"/kaˈik/","extraExplanation":["这个词多见于旅行写作或描写希腊、土耳其沿海的语境，带有“地方特色/地中海风情”的文化色彩。","来源与土耳其语 kayık（意为“小船”）有关；在英语里常见法语式拼写 caïque。","注意不要和 calque（语言学术语，指“仿译/借译”）混淆；两者读音和意义都不同。"]}
{"word":"caiquejee","summary":{"en":"“caiquejee” is not a recognized English word; it’s likely a name/handle or a misspelling.","zh":"“caiquejee”不是常见英语词；更可能是名字/网名或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a username, a made-up spelling, or a misspelling of another word.","zh":"不是标准英语单词；更可能是用户名/自造拼写，或是其他单词的拼写错误。"},"examples":[{"en":"My username online is “caiquejee.”","zh":"我在网上的用户名是“caiquejee”。"},{"en":"I can’t find “caiquejee” in a dictionary—did you mean a different word?","zh":"我在词典里找不到“caiquejee”——你是不是想写另一个词？"}]}],"phonetic":"/kaɪˈkiːdʒiː/","extraExplanation":["“caiquejee”在常见英语词典中没有固定词义和标准读音，因此更像是网名/ID。","如果你想查的其实是 **caique**（一种鸟名/也可指小船）或 **calque**（语言学：仿译/摹译），请告诉我你想表达的语境或给一句原句，我可以按你真正想查的词来详细解释。"]}
{"word":"caiques","summary":{"en":"Caiques is the plural of caique, meaning either a small Mediterranean boat or a type of South American pet parrot.","zh":"caiques 是 caique 的复数，可指东地中海常见的小艇，也可指一种南美的锥尾鹦鹉（宠物鸟）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small, light boat (often a narrow wooden skiff) used especially around Turkey and the eastern Mediterranean.","zh":"（尤指土耳其及东地中海一带的）小型轻便船；常为狭长的木船/小艇。"},"examples":[{"en":"We crossed the bay in a caique at sunset.","zh":"我们在日落时乘一艘小艇（caique）横渡海湾。"},{"en":"Fishermen pulled their caiques onto the beach.","zh":"渔民把他们的小艇（caiques）拖上了海滩。"}]},{"partOfSpeech":"n.","definition":{"en":"A small South American parrot, especially a black-headed or white-bellied caique (a pet bird).","zh":"（南美的）锥尾鹦鹉的一种；尤指黑头/白腹锥尾鹦鹉（常作宠物鸟）。"},"examples":[{"en":"Her caique is playful and loves to climb.","zh":"她的锥尾鹦鹉（caique）很爱玩，也喜欢攀爬。"},{"en":"Caiques are known for their high energy.","zh":"锥尾鹦鹉（caiques）以精力旺盛而出名。"}]}],"synonyms":["skiff","dinghy","small boat","parrot"],"phonetic":"/kaˈiks/","extraExplanation":["拼写提示：你输入的“caiques”通常是复数形式；单数是“caique”。在英文里也常见带变音符号的法式拼法“caïque/caïques”，但日常写作中常省略变音符号。","词源与文化背景：作“船”义时，这个词与土耳其语/希腊语相关，常见于旅行写作或描写爱琴海、伊斯坦布尔海峡等地的场景。"]}
{"word":"cair","summary":{"en":"“Cair” is uncommon in standard English and is mostly used as a name; many people actually mean “cairn” (a pile of stones used as a marker).","zh":"“Cair”在标准英语中不常见，多用于人名/地名；很多人其实想查的是“cairn”（用作标记的石堆）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a rare spelling/variant seen mainly in names (a surname or place name); not common as a standard English vocabulary word","zh":"一种较少见的拼写/变体，多见于人名（姓氏）或地名；不常作为标准英语词汇使用"},"examples":[{"en":"Her last name is Cair, spelled C-A-I-R.","zh":"她的姓是 Cair，拼作 C-A-I-R。"},{"en":"Cair is sometimes used in family records as an alternate spelling.","zh":"在一些家族记录里，Cair 有时会作为另一种拼写出现。"}]}],"synonyms":["(for the stone-pile sense) cairn"],"phonetic":"/ker/","extraExplanation":["“cair”在英语里非常少见，很多学习者其实想查的是 **cairn**（/kɛrn/），意思是“石堆（用作路标或纪念物）”。如果你是想表达“路边的石堆”，更常用 **cairn**。","在某些语境中你也可能看到它是缩写、品牌名或地名拼写；需要结合上下文判断。"]}
{"word":"Cairba","summary":{"en":"“Cairba” isn’t a standard English word; it’s probably a misspelling or a proper name.","zh":"“Cairba”不是标准英语单词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling, a username, or a proper name (e.g., a brand or place name).","zh":"不是标准英语单词。更可能是拼写错误、用户名，或专有名词（如品牌名/地名）。"},"examples":[{"en":"I couldn’t find “Cairba” in an English dictionary—did you mean “carb” or “Caribbean”?","zh":"我在英语词典里找不到“Cairba”——你是不是想写“carb（碳水）”或“Caribbean（加勒比的）”？"}]}],"phonetic":"/ˈkɛr.bə/","extraExplanation":["“Cairba”在常见英语词典中没有对应词条。如果你能告诉我它出现的句子/上下文（例如一段话、网站、游戏、聊天记录），我可以更准确判断它可能是哪一个词或专有名词。","常见的可能目标：\n- **carb**（名词，口语：碳水化合物）\n- **Caribbean**（形容词/名词：加勒比的/加勒比地区）\n- **cairn**（名词：石堆路标，常见于登山/徒步语境）"]}
{"word":"cairba","summary":{"en":"“cairba” is not a standard English word; it may be a misspelling or a proper name. Share the context to identify the intended word.","zh":"“cairba”不是标准英语单词，可能是拼写错误或专有名词。请提供语境以便确认你想表达的词。"},"extraExplanation":["“cairba” 不是常见的英语单词（可能是拼写错误或专有名词）。","你是不是想写：caribou（驯鹿/北美驯鹿）、cairn（石堆/路标石堆）、Cariba（地名/品牌名）或 cara（西班牙语“脸”）？","如果你告诉我它出现的句子或语境（例如一整句、文章标题、游戏/人名/地名），我可以更准确地确认并给出释义与例句。"]}
{"word":"Caird","summary":{"en":"“Caird” is most commonly a Scottish surname; in older Scots, “caird” can mean a traveling tinker or wandering worker.","zh":"“Caird” 最常见是苏格兰姓氏；在较早的苏格兰方言中，“caird” 也可指走村串户的补锅匠等流动手艺人或漂泊者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Scottish family name (surname) and place/name element found in Scotland (e.g., in some personal names and historical figures).","zh":"苏格兰常见的姓氏（也可见于地名或人名成分中）。"},"examples":[{"en":"The author Thomas Carlyle was not a Caird, but the surname is common in Scotland.","zh":"作家托马斯·卡莱尔并不姓 Caird，但这个姓在苏格兰很常见。"},{"en":"You may see Caird as a last name in English-language records or genealogies.","zh":"在英文档案或家谱资料中，你可能会看到 Caird 作为姓氏出现。"}]},{"partOfSpeech":"n.","definition":{"en":"(Scots, older use) an itinerant worker such as a tinker or traveling craftsman; sometimes used as a word for a wandering person.","zh":"（苏格兰英语旧用法）流动手艺人（如补锅匠等）；有时也指四处漂泊的人。"},"examples":[{"en":"In older Scots writing, a “caird” might travel from village to village fixing pots.","zh":"在较早的苏格兰英语作品中，“caird” 可能指走村串户修补锅具的人。"},{"en":"The story describes a caird who never stayed long in one place.","zh":"故事描写了一个从不在同一地方久留的漂泊者。"}]}],"synonyms":["(surname)","tinker","itinerant worker","traveler","wanderer"],"phonetic":"/kɛrd/","extraExplanation":["“caird” 作为普通名词主要见于苏格兰方言/旧文学语境，现代日常英语里更常用 tinker、traveler、itinerant worker 等表达；而大写的 “Caird” 多数情况下是姓氏。阅读历史小说或苏格兰背景作品时更可能遇到该词。"]}
{"word":"caird","summary":{"en":"“caird” is a Scots word meaning a traveling tinker/itinerant repairer; in older usage it can also mean a vagrant or rogue.","zh":"“caird”是苏格兰用语，常指走乡串户的修补匠／流动工匠；在较旧用法中也可指流浪汉或无赖（部分语境带贬义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scots) A traveling tinker or itinerant worker, especially someone who goes from place to place doing small repairs (often metalwork).","zh":"（苏格兰用语）走乡串户的修补匠／流动工匠，尤指到处做小修小补（常见为金属修理）的人。"},"examples":[{"en":"In some old Scots stories, a caird would visit villages to mend pots and pans.","zh":"在一些古老的苏格兰故事里，caird 会到村子里帮人修锅修盆。"},{"en":"The novel describes a caird walking the roads with tools in his bag.","zh":"小说描写了一位 caird 背着工具袋在路上行走。"}]},{"partOfSpeech":"n.","definition":{"en":"(Scots, older/derogatory in some contexts) A vagrant or rogue; a person seen as living by wandering or trickery.","zh":"（苏格兰用语，较旧；部分语境带贬义）流浪汉；无赖，指被认为靠游荡或耍滑头过活的人。"},"examples":[{"en":"He was dismissed as a mere caird by those who didn’t trust strangers.","zh":"那些不信任陌生人的人把他打发成“不过是个 caird”。"},{"en":"In older writing, “caird” can be used to suggest someone shady or unreliable.","zh":"在较旧的作品里，caird 有时用来暗示某人不太正派或不可靠。"}]}],"synonyms":["tinker","itinerant worker","traveler","vagrant (context-dependent)","rogue (older/context-dependent)"],"phonetic":"/kɛrd/","extraExplanation":["“caird”主要见于苏格兰英语（Scots）与较早期的英文学作品中，现代日常英语里很少用。它常与“tinker（补锅匠）”“itinerant（流动的）”等概念相关。","在文学里，这个词有时带有社会阶层与偏见色彩：对手艺人而言是职业称呼，但在某些语境会被用作轻蔑地指“游民/无赖”。阅读时要结合上下文判断语气。","你可能会在罗伯特·彭斯（Robert Burns）等苏格兰作家的作品或带方言色彩的文本中见到它。"]}
{"word":"cairds","summary":{"en":"“Cairds” is the Scots plural of “caird,” meaning traveling tinkers/peddlers (sometimes vagabonds or beggars).","zh":"“cairds”是苏格兰方言“caird”的复数，指走街串巷的修补匠/小贩（有时也指流浪汉或乞丐）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scots) a traveling tinkerer or peddler; sometimes used for a vagabond or beggar.","zh":"（苏格兰英语）流动修补匠、走街串巷的小贩；有时也指流浪汉或乞丐。"},"examples":[{"en":"In old Scots stories, cairds went from village to village mending pots and selling small goods.","zh":"在一些古老的苏格兰故事里，cairds 走村串巷，修补锅具并售卖小商品。"},{"en":"The novel describes a caird camped by the road for the night.","zh":"小说描写了一名 caird 夜里在路边露营。"}]}],"synonyms":["tinkers","peddlers","pedlars","vagrants"],"phonetic":"/kɛrdz/","extraExplanation":["“caird”主要见于苏格兰方言与文学语境；“cairds”是其复数形式。现代日常英语里很少用到，阅读苏格兰作品（含罗伯特·彭斯 Robert Burns 等）时更常见。","词义带有历史与社会阶层色彩：既可较中性地指走街串巷的手艺人/小贩，也可能带轻微贬义（类似“游民/流浪者”的刻板印象），使用时注意语境与尊重。"]}
{"word":"Cairene","summary":{"en":"Cairene means “from Cairo” or “a person from Cairo.”","zh":"Cairene 表示“开罗的”，也可指“开罗人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Cairo, the capital city of Egypt","zh":"开罗的；与埃及首都开罗有关的"},"examples":[{"en":"Cairene streets are known for their lively markets and café culture.","zh":"开罗的街道以热闹的市集和咖啡馆文化而闻名。"},{"en":"She studies Cairene Arabic for her fieldwork in Egypt.","zh":"她为了在埃及做田野调查而学习开罗阿拉伯语。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Cairo","zh":"开罗人；开罗的居民"},"examples":[{"en":"As a Cairene, he can recommend the best places to eat near Tahrir Square.","zh":"作为开罗人，他能推荐解放广场附近最好吃的地方。"},{"en":"Many Caire nes commute across the city every day.","zh":"许多开罗人每天在城里通勤。"}]}],"synonyms":["from Cairo","Cairo resident"],"phonetic":"/kaɪˈriːn/","extraExplanation":["“Cairene”是英文里对“开罗的/开罗人”的常见称呼（demonym）。通常首字母大写：a Cairene writer（开罗作家）。","在语言学习语境中常见搭配：Cairene Arabic（开罗方言/开罗阿拉伯语），用来指埃及开罗地区的口音与用法。"]}
{"word":"cairene","summary":{"en":"Cairene means “from Cairo” or “a person from Cairo.”","zh":"Cairene 指“开罗的”，或“开罗人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Cairo, the capital of Egypt","zh":"与埃及首都开罗有关的；开罗的"},"examples":[{"en":"Cairene street food is famous for being flavorful and affordable.","zh":"开罗的街头小吃以味道浓郁、价格亲民而出名。"},{"en":"She studies Cairene Arabic for her research on modern Egyptian culture.","zh":"她为了研究现代埃及文化而学习开罗阿拉伯语。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Cairo","zh":"开罗人；来自开罗的人"},"examples":[{"en":"As a Cairene, he knows the city’s neighborhoods very well.","zh":"作为开罗人，他非常了解这座城市的各个街区。"},{"en":"Many Caire nes commute daily across the Nile for work.","zh":"许多开罗人每天跨越尼罗河通勤上班。"}]}],"synonyms":["Cairo (adj. use)","from Cairo","Cairo resident"],"phonetic":"/kaɪˈriːn/","extraExplanation":["“Cairene”是“Cairo（开罗）”的居民称呼（demonym）与形容词形式，常见于新闻、学术写作与旅行写作中。","在语言学习语境里，“Cairene Arabic”通常指开罗地区的埃及阿拉伯语口音/变体；更广泛时也会用“Egyptian Arabic（埃及阿拉伯语）”。"]}
{"word":"Cairistiona","summary":{"en":"Cairistiona is a Scottish Gaelic form of the female name Christina.","zh":"Cairistiona 是女性名 Christina 的苏格兰盖尔语形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Scottish Gaelic female given name, equivalent to English “Christina.”","zh":"苏格兰盖尔语女性名字，相当于英语名字“Christina（克里斯蒂娜）”。"},"examples":[{"en":"Cairistiona is a traditional Gaelic name used in Scotland.","zh":"Cairistiona 是苏格兰使用的传统盖尔语名字。"},{"en":"Her name is Cairistiona, but she goes by Christina in English.","zh":"她叫 Cairistiona，但用英语时常用 Christina。"}]}],"synonyms":["Christina","Christine"],"phonetic":"/ˌkɑrɪʃˈtoʊnə/","extraExplanation":["这个名字常见的盖尔语拼写也会写作 **Cairistìona**（带重音符号 ì），重音符号提示元音长度与发音差异；在英语环境中通常会对应为 **Christina** 或用更易读的拼法来转写。","在苏格兰盖尔语文化语境里，使用盖尔语名字有时也带有对家族、地区身份与语言传承的认同。"]}
{"word":"cairn","summary":{"en":"A cairn is a pile of stones used as a trail marker or memorial.","zh":"cairn 指用于指路或纪念的石堆/石冢。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a pile of stones built as a marker (for a trail, a mountain summit, or a memorial).","zh":"（用于指路、标记山顶或纪念的）石堆，石冢。"},"examples":[{"en":"Follow the cairns to stay on the hiking trail in foggy weather.","zh":"在有雾的天气里，沿着路标石堆走，才能不偏离徒步路线。"},{"en":"We reached the summit and added one stone to the cairn.","zh":"我们到达山顶后，往石堆上又放了一块石头。"},{"en":"A small cairn marked the place where the climber was remembered.","zh":"一个小石冢标记着人们纪念那位登山者的地方。"}]},{"partOfSpeech":"vt.","definition":{"en":"to build or mark with a pile of stones (less common).","zh":"用石堆堆起（或用石堆做标记）（较少见）。"},"examples":[{"en":"The guide cairned the junction so hikers wouldn’t miss the turn.","zh":"向导在岔路口堆了石堆，免得徒步者错过转弯。"}]}],"synonyms":["stone pile","stone marker","rock cairn","memorial pile"],"phonetic":"/kɛrn/","extraExplanation":["“cairn”常见于徒步、登山语境，功能类似“路标”。在一些山区或荒原，视线受限时，石堆能帮助人们沿正确路线前进。","它也可带有纪念意味：在苏格兰等凯尔特文化地区，石冢与悼念、仪式或传说相关。英语词源来自苏格兰盖尔语 *càrn*（意为“石堆/石冢”）。","相关搭配：summit cairn（山顶石堆）、trail cairn（路线标记石堆）。注意户外礼仪：有些保护区不鼓励随意堆石，以免影响生态或误导路线。"]}
{"word":"Cairnbrook","summary":{"en":"Cairnbrook is a proper name, usually a community in Pennsylvania, USA.","zh":"Cairnbrook是专有名词，通常指美国宾夕法尼亚州的一个社区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a proper name (place name), most commonly referring to Cairnbrook, a community in Somerset County, Pennsylvania, USA.","zh":"专有名词（地名），最常见指美国宾夕法尼亚州萨默塞特县的一个社区：Cairnbrook。"},"examples":[{"en":"He grew up in Cairnbrook, Pennsylvania, before moving to Pittsburgh.","zh":"他在宾夕法尼亚州的Cairnbrook长大，后来搬到了匹兹堡。"},{"en":"Cairnbrook is in Somerset County, not far from Johnstown.","zh":"Cairnbrook在萨默塞特县，离约翰斯敦不远。"}]}],"synonyms":["(proper noun) Cairnbrook, PA"],"phonetic":"/ˈkɛrnˌbrʊk/","extraExplanation":["“Cairnbrook”多被当作地名使用：Cairn（石堆、界标石堆，常见于苏格兰等地）+ brook（小溪）。这种组合很像英语地名的构词方式，带有自然地貌或移民文化的痕迹。"]}
{"word":"cairned","summary":{"en":"“Cairned” means marked with stone cairns, or (as a verb form) having built/placed cairns to mark a route.","zh":"“cairned”表示“用石堆路标标记的”，也可作动词过去式/过去分词，指“堆石成标记（石冢）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Marked with cairns (piles of stones), or having cairns on it.","zh":"用石堆路标（石冢）标记的；有石堆路标的。"},"examples":[{"en":"We followed the cairned trail across the foggy ridge.","zh":"我们沿着用石堆路标标记的小径穿过雾蒙蒙的山脊。"},{"en":"The cairned summit route is easier to navigate in low light.","zh":"通往山顶的石堆路标路线在光线不足时更容易辨认。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “cairn”: to build a cairn or mark a route by placing stone piles.","zh":"“cairn”的过去式/过去分词：堆石成冢；用石堆为路线做标记。"},"examples":[{"en":"They cairned the junction so hikers wouldn’t miss the turn.","zh":"他们在岔路口堆了石堆路标，免得徒步者错过转弯。"},{"en":"The path had been cairned years ago by local guides.","zh":"这条路多年前就被当地向导用石堆标记过了。"}]}],"synonyms":["marked","signposted","stone-marked"],"phonetic":"/kɛrnd/","extraExplanation":["“cairn”常见于苏格兰及英语徒步文化中，指用石头堆成的路标或纪念性石堆。在高山、荒野或积雪地带，cairns 用来指引方向；有时也用于纪念逝者。","拼写提示：cairn 的字母组合 “ai” 发 /ɛ/，并且 r 在美式英语里通常会读出来（/kɛrn/）。因此 “cairned” 读作 /kɛrnd/。"]}
{"word":"cairngorm","summary":{"en":"Cairngorm refers either to the Cairngorms mountains in Scotland or to a smoky quartz gemstone associated with that region.","zh":"cairngorm 可指苏格兰的凯恩戈姆山/凯恩戈姆山脉，也可指与该地区相关的烟晶类宝石“凯恩戈姆石”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mountain (or the Cairngorms mountain range) in the Scottish Highlands; often used to refer to the Cairngorms area or national park.","zh":"（苏格兰高地的）凯恩戈姆山；也常指“凯恩戈姆山脉”及其周边地区/国家公园。"},"examples":[{"en":"They went hiking in the Cairngorms during their trip to Scotland.","zh":"他们去苏格兰旅行时在凯恩戈姆山脉徒步。"},{"en":"Snow can stay on the Cairngorm plateau well into spring.","zh":"凯恩戈姆高原的积雪可能一直持续到春末。"}]},{"partOfSpeech":"n.","definition":{"en":"a yellowish-brown to smoky variety of quartz used as a gemstone (also called cairngorm stone).","zh":"凯恩戈姆石：一种呈黄褐色到烟灰色的石英（常为烟晶），可作宝石。"},"examples":[{"en":"The brooch was set with a polished cairngorm stone.","zh":"那枚胸针镶着一颗打磨过的凯恩戈姆石。"},{"en":"Cairngorm is sometimes mistaken for topaz because of its warm color.","zh":"由于色泽偏暖，凯恩戈姆石有时会被误认为黄玉（topaz）。"}]}],"synonyms":["the Cairngorms","smoky quartz","cairngorm stone"],"phonetic":"ˈkɛrnˌɡɔrm","extraExplanation":["“Cairngorm”来自苏格兰盖尔语 *Càrn Gorm*，大意是“蓝色/青色的石堆（山峰）”。在英国语境里更常见复数形式 **the Cairngorms** 指整片山脉与地区。","作为宝石的“cairngorm（凯恩戈姆石）”在苏格兰传统首饰中较常见，尤其用于胸针、匕首柄或传统服饰配件。"]}
{"word":"cairngorum","summary":{"en":"Cairngorm (often misspelled “cairngorum”) most commonly means a smoky yellow-brown quartz gemstone, and it can also refer to the Cairngorms mountain region in Scotland.","zh":"Cairngorm（常被误写为“cairngorum”）最常指一种烟黄色到棕色的石英宝石，也可指苏格兰的凯恩戈姆山脉地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a smoky yellow-brown variety of quartz used as a gemstone; also called cairngorm (stone)","zh":"一种烟黄色到棕色的石英（烟晶的一种），可作宝石；也叫“cairngorm（石）”"},"examples":[{"en":"She wore a brooch set with a cairngorm stone.","zh":"她戴着一枚镶有凯恩戈姆石的胸针。"},{"en":"Victorian jewelry sometimes featured cairngorms in silver settings.","zh":"维多利亚时代的首饰有时会用银托镶嵌凯恩戈姆石。"}]},{"partOfSpeech":"n.","definition":{"en":"(often capitalized) the Cairngorms: a mountain range and national park area in northeast Scotland","zh":"（常大写）凯恩戈姆山脉：苏格兰东北部的一片山地与国家公园区域"},"examples":[{"en":"They went hiking in the Cairngorms during the summer.","zh":"他们夏天去凯恩戈姆山脉徒步了。"},{"en":"The Cairngorms are known for cold, changeable weather.","zh":"凯恩戈姆地区以寒冷多变的天气闻名。"}]}],"synonyms":["smoky quartz","Cairngorms"],"phonetic":"/ˈkɛrənˌɡɔrm/","extraExplanation":["“cairngorum”更常见是拼写误写；标准形式多为 **cairngorm**（单数）或 **Cairngorms**（山脉复数）。","词源与地名有关：Cairngorm 来自苏格兰盖尔语（Gàidhlig）地名，意为“蓝色的石冢/山”（常解释为 *blue cairn*）。这种石英最初因在凯恩戈姆山区被发现而得名。"]}
{"word":"Cairns","summary":{"en":"“Cairns” most commonly refers to a city in Queensland, Australia; it can also mean the plural of “cairn,” stone piles used as trail markers.","zh":"“Cairns”最常指澳大利亚昆士兰州的城市“凯恩斯”；也可指“cairn”的复数，即用于指路/标记的石堆路标。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a coastal city in Queensland, Australia, known as a gateway to the Great Barrier Reef and tropical rainforests","zh":"凯恩斯（澳大利亚昆士兰州的海滨城市，以大堡礁与热带雨林的门户而闻名）"},"examples":[{"en":"We flew into Cairns to visit the Great Barrier Reef.","zh":"我们飞到凯恩斯去参观大堡礁。"},{"en":"Cairns is popular with tourists looking for beaches and rainforest trips.","zh":"凯恩斯很受想去海滩和雨林旅行的游客欢迎。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of “cairn”: small piles of stones built as markers on paths or mountains","zh":"cairn 的复数：石堆路标（常见于山路、荒野，用来指路或标记地点的石头堆）"},"examples":[{"en":"The trail was marked by cairns every few hundred meters.","zh":"这条步道每隔几百米就有石堆路标。"},{"en":"In foggy weather, hikers follow the cairns to stay on the route.","zh":"在有雾的天气里，徒步者靠石堆路标来保持在正确路线上。"}]}],"synonyms":["(stone marker) rock piles","(stone marker) stone heaps"],"phonetic":"/kɛrnz/","extraExplanation":["“Cairns”（城市）通常大写，读音与英文单词“cairn”（石堆）相近，但含义不同。语境里如果谈旅行、澳大利亚昆士兰、多堡礁，几乎一定是城市；如果谈登山、步道标记，才可能是“cairns”=石堆复数。","该城市名称来自19世纪的澳大利亚政治人物 William Cairns；在英语写作中常见搭配有 “in Cairns / fly to Cairns / based in Cairns”。"]}
{"word":"cairns","summary":{"en":"Cairns are stone piles used as trail markers or memorials; “Cairns” can also refer to the Australian city.","zh":"cairns 指用作路标或纪念的石堆（cairn 的复数）；Cairns 也可指澳大利亚的凯恩斯市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Piles of stones built as a marker or memorial, often used to show a trail or to remember a person or event.","zh":"（cairn 的复数）石堆路标/纪念石堆：用石头堆成的标记或纪念物，常用于指示山路或纪念人和事件。"},"examples":[{"en":"The hikers followed the cairns to stay on the mountain trail.","zh":"徒步者沿着石堆路标前进，以免偏离山路。"},{"en":"They left a small stone on the cairns as a quiet tribute.","zh":"他们在纪念石堆上放了一块小石头，作为安静的致敬。"}]},{"partOfSpeech":"n.","definition":{"en":"The city of Cairns in Queensland, Australia (often capitalized: Cairns).","zh":"澳大利亚昆士兰州的凯恩斯市（通常大写：Cairns）。"},"examples":[{"en":"We flew into Cairns and then drove north to the rainforest.","zh":"我们飞到凯恩斯，然后开车向北去雨林。"}]}],"synonyms":["stone piles","rock piles","trail markers","stone markers"],"phonetic":"/kɛrnz/","extraExplanation":["“cairn”一词源自苏格兰盖尔语，常见于英国、爱尔兰及北美等地的山区步道文化中，用石堆当路标在雾大、积雪或没有明显路迹的地方特别有用。","在一些登山/徒步规范中，不建议随意新建或移动石堆，因为可能误导他人或破坏当地生态与景观。"]}
{"word":"cairny","summary":{"en":"Cairny means ‘marked by cairns’ or ‘stony like a cairn’ (a rare adjective).","zh":"cairny 指“有石堆路标的”或“像石堆一样多石粗砺的”（较少见的形容词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Having many cairns (piles of stones used as markers), or resembling a cairn; stony and marked by small stone heaps.","zh":"（罕见）有许多石堆路标（cairn）的；像石堆的；多石且常见小石堆标记的。"},"examples":[{"en":"We followed a cairny ridge where small piles of stones marked the path.","zh":"我们沿着一条“石堆遍布的”山脊前行，小石堆标记着路线。"},{"en":"The cairny summit looked rough and wind-swept.","zh":"那座“像石堆一样”的山顶看起来粗粝，风吹得很厉害。"}]}],"synonyms":["cairn-strewn","stony","rocky","stone-strewn","dotted with cairns"],"phonetic":"/ˈkɛrni/","extraExplanation":["“cairny”来自名词“cairn”（石堆路标），常见于苏格兰/高地徒步语境。它在现代英语里很少单独使用，更常见的表达是“cairn-strewn / dotted with cairns / marked by cairns”。","“cairn”传统上可用于指路、纪念或标记墓地；在山地徒步时看到的石堆多用于导航（但也要遵守当地规则，不要随意堆石以免误导他人）。"]}
{"word":"Cairo","summary":{"en":"Cairo is most commonly the capital of Egypt; it can also refer to some U.S. towns named Cairo, depending on context.","zh":"Cairo 通常指埃及首都开罗；也可能指美国一些名为 Cairo 的城镇，需结合语境判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The capital city of Egypt, located on the Nile River; the largest city in Egypt and a major cultural and historical center.","zh":"开罗：埃及首都，位于尼罗河畔；埃及最大的城市，也是重要的文化与历史中心。"},"examples":[{"en":"Cairo is famous for its busy streets and rich history.","zh":"开罗以繁忙的街道和悠久的历史而闻名。"},{"en":"We flew to Cairo and then visited the pyramids near Giza.","zh":"我们飞到开罗，然后去参观了吉萨附近的金字塔。"},{"en":"The Nile River runs through Cairo.","zh":"尼罗河流经开罗。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name used for some smaller towns in the U.S. (for example, Cairo, Illinois), depending on context.","zh":"Cairo 也可指美国一些较小的城镇名（例如伊利诺伊州的 Cairo），具体含义取决于语境。"},"examples":[{"en":"He grew up in Cairo, Illinois, not Cairo, Egypt.","zh":"他在伊利诺伊州的 Cairo 长大，不是埃及的开罗。"},{"en":"Make sure the address says Cairo, IL.","zh":"请确认地址写的是 Cairo（伊利诺伊州）。"}]}],"synonyms":["al-Qāhirah (Arabic name)"],"phonetic":"/ˈkaɪroʊ/","extraExplanation":["“Cairo”在英语里通常读作 /ˈkaɪroʊ/（KAI-roh）。而阿拉伯语中的城市名是“al-Qāhirah”（القاهرة），常译为“胜利者/征服者”。","开罗常被称为“City of a Thousand Minarets”（千塔之城），因为城中清真寺与宣礼塔非常多。这是文化称呼，并不是精确的数量。"]}
{"word":"CAIS","summary":{"en":"CAIS is usually an acronym. A common meaning is “Center for AI Safety,” but the exact meaning depends on context.","zh":"CAIS 通常是缩写。一个常见含义是“Center for AI Safety（人工智能安全中心）”，但准确含义取决于具体语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Acronym) Center for AI Safety (an organization focused on reducing risks from advanced artificial intelligence).","zh":"（缩写）Center for AI Safety（人工智能安全中心：关注降低先进人工智能风险的组织）。"},"examples":[{"en":"CAIS published a statement about managing AI risks.","zh":"CAIS 发布了一份关于管理 AI 风险的声明。"},{"en":"I read a CAIS report on AI safety research.","zh":"我读过一份 CAIS 关于 AI 安全研究的报告。"}]},{"partOfSpeech":"other","definition":{"en":"(Acronym, less common/depends on field) A shortened form used for various organizations or systems, such as an “information system” name in a company or school.","zh":"（缩写，较少见/取决于领域）可指不同机构或系统的简称，例如公司或学校里某种“信息系统”的名称。"},"examples":[{"en":"Ask your IT department what CAIS stands for in your company.","zh":"在你们公司里，最好问 IT 部门 CAIS 具体代表什么。"},{"en":"The email mentions CAIS, but it doesn’t explain the abbreviation.","zh":"邮件里提到 CAIS，但没有解释这个缩写。"}]}],"synonyms":["abbreviation","acronym"],"phonetic":"/keɪs/","extraExplanation":["“CAIS”不是一个固定含义的普通英语单词，而是缩写（acronym/abbreviation），不同场景代表不同全称。最常见的一种读法是像“case”一样读 /keɪs/，但也有人逐字母读（C-A-I-S）。","如果你告诉我它出现的领域（AI、安全、学校系统、公司系统、学术组织等）或给我一句原文，我可以帮你确定最准确的含义。"]}
{"word":"caisse","summary":{"en":"Caisse is a French noun meaning a box/crate, a cash register/checkout, or (in names) a fund/financial institution.","zh":"Caisse 是法语名词，可指箱子/板条箱、收银台/结账处，也可指（常见于名称中的）基金或金融机构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in French) a box or crate; a case used to hold or transport things.","zh":"（法语）箱子；板条箱；用于装载或运输物品的箱盒。"},"examples":[{"en":"They shipped the bottles in a wooden caisse.","zh":"他们把瓶子装在木箱（caisse）里运输。"},{"en":"The museum stored the artifact in a padded caisse.","zh":"博物馆把文物放在带缓冲保护的箱子（caisse）里保存。"}]},{"partOfSpeech":"n.","definition":{"en":"(in French) the cash desk/cash register; the checkout where you pay.","zh":"（法语）收银台；收银机；结账处。"},"examples":[{"en":"Pay at the caisse, please.","zh":"请到收银台（caisse）付款。"},{"en":"There was a long line at the caisse.","zh":"收银台（caisse）排了很长的队。"}]},{"partOfSpeech":"n.","definition":{"en":"(in French) a fund or financial institution (often seen in names).","zh":"（法语）基金；资金池；（常用于机构名称中的）金融机构/保险或储蓄机构。"},"examples":[{"en":"She works for a local caisse d’assurance.","zh":"她在当地的保险机构（caisse d’assurance）工作。"},{"en":"The program is supported by a public caisse.","zh":"该项目由公共基金机构（caisse）支持。"}]}],"synonyms":["box","crate","cash register","checkout","fund"],"phonetic":"/kɛs/","extraExplanation":["“caisse”是法语词，在英语里通常只会出现在法语语境、品牌/机构名称或翻译作品中；日常英语更常用 box/crate（箱子）或 cash register/checkout（收银台/结账处）。","常见搭配：caisse enregistreuse（收银机）、à la caisse（在收银台/去结账）、caisse d’épargne（储蓄机构/储蓄银行）、caisse claire（军鼓/小鼓，音乐术语）。","发音上法语“caisse”里的字母组合 -aisse 常读作接近英语的 /ɛs/（类似“ess”）。"]}
{"word":"caissier","summary":{"en":"French word meaning “cashier.”","zh":"法语词，意思是“收银员”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(French) a cashier; the person who takes payments at a store, bank, or ticket counter.","zh":"（法语）收银员；在商店、银行或售票处负责收款的人。"},"examples":[{"en":"The caissier asked if I wanted a receipt.","zh":"收银员问我是否需要小票。"},{"en":"I paid the caissier in cash.","zh":"我用现金付给收银员。"}]}],"synonyms":["cashier","checkout clerk","teller"],"phonetic":"/kɛˈsjeɪ/","extraExplanation":["“caissier”是法语词，来自“caisse”（收银台/钱箱）。在实际法语中有阴性形式“caissière”，指女性收银员；现代法语里也常用更中性的表达（视地区与语境而定）。","在法语国家（如法国、加拿大魁北克）购物时，你可能会在对话里听到：\"Bonjour, je vais à la caisse\"（你好，我去收银台结账）或\"La caissière/le caissier\"（收银员）。"]}
{"word":"caisson","summary":{"en":"Caisson most commonly means a large watertight chamber used to build foundations underwater; it can also mean a sealed box for ammunition.","zh":"Caisson 常指用于水下基础施工的沉箱/沉井；也可指用于运输或储存弹药的密封箱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large watertight box or chamber used in underwater construction (for example, to build bridge piers) so workers can dig or pour foundations below water level","zh":"（水下施工用的）沉箱；沉井（用于在水下或地下形成干燥作业空间，常见于桥墩、码头等基础施工）"},"examples":[{"en":"Engineers lowered a caisson to the riverbed to build the bridge foundation.","zh":"工程师把沉箱下沉到河床上，用来修建桥梁基础。"},{"en":"Workers pumped air into the caisson to keep water out while they worked.","zh":"工人向沉箱内打入空气，以便在施工时把水挡在外面。"}]},{"partOfSpeech":"n.","definition":{"en":"a sealed container for ammunition or explosives, designed for safe transport and storage","zh":"（弹药/爆炸物用的）密封箱；弹药箱"},"examples":[{"en":"The supplies included fuel, medical kits, and a caisson of ammunition.","zh":"补给品包括燃料、医疗包和一箱弹药。"}]}],"synonyms":["cofferdam (related)","foundation chamber","ammunition box"],"phonetic":"/ˈkeɪsən/","extraExplanation":["“caisson”常与桥梁/港口工程词汇搭配出现，如 *caisson foundation*（沉箱基础）、*pneumatic caisson*（气压沉箱）。气压沉箱通过加压空气把水顶出去，让工人在干燥环境中挖掘；但若减压不当可能出现“潜水病/减压病”，这是工程史上常被提及的安全风险。","词源来自法语 *caisson*，原意与“箱子/大箱柜”相关，因此它既可指工程中的“大箱状结构”，也可指军需中的“箱式容器”。"]}
{"word":"caissoned","summary":{"en":"Caissoned usually means “coffered”: decorated with sunken panels, especially on ceilings; more rarely it is the past participle of caisson, meaning placed in or carried by a caisson.","zh":"caissoned 通常指“有凹格（藻井/格槽）装饰的”，尤用于天花板；较少见时是动词 caisson 的过去分词，表示置于沉箱中施工或由灵车/炮车式载具运送。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Architecture) Decorated with sunken panels (coffers), especially on a ceiling or vault.","zh":"（建筑）有凹格装饰的；（尤指天花板/拱顶）做成凹陷方格（藻井、格槽）的。"},"examples":[{"en":"The museum’s caissoned ceiling creates a sense of depth and grandeur.","zh":"博物馆的藻井式天花板营造出纵深感和庄严感。"},{"en":"In many Renaissance churches, the caissoned vault is carefully proportioned.","zh":"许多文艺复兴时期的教堂里，带凹格装饰的拱顶比例十分讲究。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past participle of caisson: placed in or supported by a caisson (a watertight chamber used in underwater construction), or transported on a caisson (a military/ceremonial carriage for a coffin or artillery).","zh":"caisson 的过去分词：放入/置于沉箱（用于水下施工的密闭舱）中或由沉箱支撑；或用灵车/炮车式载具（caisson）运送（棺柩/火炮等）。"},"examples":[{"en":"The bridge pier was built with parts caissoned below the waterline.","zh":"桥墩的建造中，有些部分被置于水线以下的沉箱里施工。"},{"en":"At the funeral, the flag-draped coffin was caissoned to the cemetery.","zh":"葬礼上，覆着国旗的棺柩由灵车式炮车运送到墓地。"}]}],"synonyms":["coffered","paneled","recessed","sunken-panel"],"phonetic":"/ˈkeɪsənd/","extraExplanation":["“caissoned”在日常英语里最常见的是建筑语境，基本等同于“coffered（有凹格/藻井的）”。看到“caissoned ceiling”通常就是指格槽天花板。","词源上，caisson 来自法语，原义与“箱子/匣子”有关，因此无论是“沉箱”（像大箱子一样的密闭舱）还是“灵车式炮车”（像承载平台的车）都保留了“箱状承载”的概念。"]}
{"word":"caissons","summary":{"en":"Caissons are large box-like structures—most commonly watertight chambers for underwater construction; they can also mean military ammunition wagons or ceremonial funeral carriages.","zh":"caissons 指“箱状结构”：最常见是水下施工用的“沉箱”；也可指军用“弹药车/弹药箱”，或仪式上运送棺椁的“灵车炮架”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large, watertight box or chamber used in underwater construction (such as bridges or tunnels) so workers can dig or build below water level.","zh":"（水下工程用的）沉箱；一种大型防水箱体/密闭舱，用于桥梁、隧道等在水下或低于水位处施工。"},"examples":[{"en":"Engineers lowered caissons into the riverbed to build the bridge’s foundations.","zh":"工程师把沉箱下放到河床里，用来修建桥梁的地基。"},{"en":"Workers pumped air into the caisson to keep water out during excavation.","zh":"工人向沉箱里打入空气，以便在开挖时把水挡在外面。"}]},{"partOfSpeech":"n.","definition":{"en":"A military wagon or box used to carry ammunition, explosives, or supplies.","zh":"（军用）弹药车；弹药箱（用于运送弹药、炸药或军需品）。"},"examples":[{"en":"The caissons followed the artillery to resupply the guns.","zh":"弹药车跟在炮兵后面，为火炮补给弹药。"},{"en":"They loaded shells onto the caisson before moving out.","zh":"他们把炮弹装上弹药车后出发。"}]},{"partOfSpeech":"n.","definition":{"en":"A two-wheeled carriage (often used in military or state funerals) for transporting a coffin or ceremonial equipment.","zh":"（仪式用）灵车炮架；（常见于军葬/国葬）用来运送棺椁或礼仪器材的两轮车。"},"examples":[{"en":"During the state funeral, the coffin rested on a caisson pulled by horses.","zh":"在国葬上，棺椁放在由马匹牵引的灵车炮架上。"}]}],"synonyms":["(construction) cofferdam (related)","(military) ammunition wagon","(military) limber (related)"],"phonetic":"/ˈkeɪsən/","extraExplanation":["“caisson”来自法语，原意与“箱子/框架”相关。英语里既用于工程（沉箱）也用于军事后勤（弹药车）。","在美国文化里，你可能会在美国陆军军歌《The Caissons Go Rolling Along》（后成为《The Army Goes Rolling Along》）中看到“caissons”，指随炮兵滚动前进的弹药车。"]}
{"word":"Caitanyas","summary":{"en":"“Caitanyas” is the plural of “Caitanya,” meaning multiple people with that name or (in some contexts) devotees linked to Sri Chaitanya.","zh":"“Caitanyas”是“Caitanya”的复数，可指多位名叫 Caitanya 的人，或在某些语境中指与柴坦尼亚圣者相关的信众群体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) People named Caitanya; also used to refer to followers or devotees connected with Caitanya (especially Sri Chaitanya Mahaprabhu) in South Asian religious/cultural contexts.","zh":"（复数）名叫 Caitanya 的人；也可指与 Caitanya（尤指柴坦尼亚圣者 Sri Chaitanya Mahaprabhu）有关的追随者/信众，在南亚宗教与文化语境中使用。"},"examples":[{"en":"Two Caitanyas in my class are from India, but their names have different spellings on paper.","zh":"我班上有两位叫 Caitanya 的同学，都来自印度，但他们名字的拼写不一样。"},{"en":"In the discussion of Gaudiya Vaishnavism, the author mentions the Caitanyas as a community of devotees.","zh":"在讨论高迪亚外士那瓦派时，作者把 Caitanyas 提到为一个信众群体。"}]}],"synonyms":["Chaitanyas"],"phonetic":"/tʃaɪˈtʌnjəz/","extraExplanation":["“Caitanya”常见对应拼写有“Chaitanya / Caitanya”。在宗教与历史语境中，它常指16世纪孟加拉与奥里萨地区的圣者 Sri Chaitanya Mahaprabhu（常译“柴坦尼亚”），与高迪亚外士那瓦派（Gaudiya Vaishnavism）密切相关。","作为人名时，“Caitanya”在南亚文化中较常见，含义常被解释为“意识、觉知、生命力/灵性”。在英文文本里加 -s 形成复数（Caitanyas）通常表示“多位名叫 Caitanya 的人”，或在特定语境中泛指与其传统相关的一群人。"]}
{"word":"caitanyas","summary":{"en":"“Caitanyas” usually means the plural of the name Caitanya, and it may also refer to people associated with Sri Chaitanya in a religious/cultural context.","zh":"“caitanyas”通常是人名Caitanya的复数；在宗教/文化语境中也可能泛指与圣者柴坦尼亚及其传统相关的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) Caitanya: a Sanskrit-origin name meaning “consciousness” or “spiritual awareness”; most commonly refers to Sri Chaitanya (Caitanya) Mahaprabhu (1486–1534), a major Bengali saint and key figure of the Gaudiya Vaishnava (Krishna-bhakti) tradition. “Caitanyas” can mean “people/things named Caitanya” or “followers/figures associated with Caitanya,” depending on context.","zh":"（专有名词）Caitanya：源自梵语的名字，意为“意识/觉知”或“灵性觉醒”；最常见用法是指孟加拉重要圣者柴坦尼亚（Caitanya/Chaitanya）·玛哈帕布（1486–1534），高迪亚毗湿奴派（克里希纳奉爱传统）的关键人物。“caitanyas”可表示“名为Caitanya的人/事物（复数）”，或在特定语境下指“与柴坦尼亚相关的人物/追随者”等。"},"examples":[{"en":"In Gaudiya Vaishnavism, Caitanya is remembered for teaching devotional love (bhakti) through kirtan.","zh":"在高迪亚毗湿奴派传统中，柴坦尼亚以通过唱诵（kirtan）弘扬奉爱（bhakti）而为人所纪念。"},{"en":"The library catalog listed several authors named Caitanya; the editor grouped them as “Caitanyas.”","zh":"图书馆目录里有好几位作者都叫Caitanya；编辑把他们统称为“Caitanyas”。"}]}],"synonyms":["Chaitanya (variant spelling)","Sri Chaitanya (specific person)"],"phonetic":"/tʃaɪˈtʌnjəz/","extraExplanation":["“Caitanya”在学术转写中常写作“Chaitanya”。你输入的“caitanyas”更像是英文里的复数形式，但在宗教/文化语境里也可能被用作泛指“与柴坦尼亚传统相关的人”。如果你能提供原句，我可以帮你判断这里究竟是“复数人名”，还是“宗教传统相关称呼”。"]}
{"word":"Caite","summary":{"en":"Caite is a female first name, usually a variant spelling of Kate/Cait.","zh":"Caite 是女性名，通常是 Kate/Cait 的变体拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feminine given name, usually a variant spelling of Kate or Cait (often ultimately from Katherine).","zh":"女性名字，常见为 Kate 或 Cait 的变体拼写（词源上多可追溯到 Katherine）。"},"examples":[{"en":"Caite moved to New York for college.","zh":"Caite 去纽约上大学了。"},{"en":"‘Caite’ is pronounced like “Kate” in many families.","zh":"在很多家庭里，“Caite”的发音像“Kate”。"}]}],"synonyms":["Kate","Cait","Cate","Katie"],"phonetic":"/keɪt/","extraExplanation":["“Caite”多见于英语国家作为名字的创意拼写（variant spelling），常与 Cait、Cate、Kate、Katie 同属一个“名字家族”。这些名字常被认为与 Katherine/Catherine 有关；Katherine 的含义常被解释为“纯洁的（pure）”。不过名字的具体来源与含义也可能因家庭传统而不同。"]}
{"word":"caite","summary":{"en":"Caite is not standard English; it’s most often an Irish word meaning “spent/used up/worn out.”","zh":"Caite 不是标准英语；最常见是爱尔兰语，意为“花掉的/用尽的/磨损的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not a standard English word. Most commonly, **caite** is an Irish (Gaeilge) word meaning “spent; used up; worn out” (often used like a past participle/adjective).","zh":"不是标准英语单词。**caite**最常见是爱尔兰语（Gaeilge），意思是“花掉的；用尽的；磨损的”（常作过去分词/形容词用）。"},"examples":[{"en":"In Irish, *airgead caite* means “money spent.”","zh":"在爱尔兰语中，*airgead caite* 表示“花掉的钱”。"},{"en":"After the hike, I felt completely worn out—Irish might say I was *caite*.","zh":"徒步之后我感觉完全累坏了——用爱尔兰语可以说我很 *caite*（用尽了/疲惫了）。"}]}],"synonyms":["spent","used up","worn out"],"phonetic":"/ˈkɑtʃə/","extraExplanation":["**caite**源自爱尔兰语动词 **caith**（大意为“花费/投掷/穿（衣）”等）的过去分词形式，因此常表示“已经花掉/已经用过/已经磨损”的状态。","如果你本来想查的是英文单词，可能是拼写接近的 **Katy/Caitie**（人名昵称）、**caste**（种姓/阶层）或 **quite**（相当、很）。你想查哪一个？"]}
{"word":"Caithness","summary":{"en":"Caithness is a historic region/county in far northeastern Scotland; it can also refer to the earldom/title of the Earl of Caithness.","zh":"Caithness 指苏格兰最东北部的历史地区/郡；也可指“凯斯内斯伯爵”的伯爵领或相关称号。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historic county and region in the far northeast of Scotland (now part of the Highland council area), known for rugged coasts and small towns such as Wick and Thurso","zh":"苏格兰最东北部的历史郡与地区（现属“高地”行政区的一部分），以崎岖海岸与维克（Wick）、瑟索（Thurso）等小镇闻名"},"examples":[{"en":"Caithness is famous for its dramatic sea cliffs and open landscapes.","zh":"凯斯内斯以壮观的海崖与开阔的地貌闻名。"},{"en":"They drove north through Caithness on the way to John o’ Groats.","zh":"他们一路向北穿过凯斯内斯，前往约翰奥格罗茨。"},{"en":"Wick is a town in Caithness with a long maritime history.","zh":"维克是凯斯内斯的一座小镇，有着悠久的海事历史。"}]},{"partOfSpeech":"n.","definition":{"en":"the title/territory traditionally associated with the Earl of Caithness (a Scottish noble title)","zh":"与“凯斯内斯伯爵”（苏格兰贵族爵位）传统相关的领地/称号"},"examples":[{"en":"In historical records, the Earl of Caithness appears in accounts of northern Scotland.","zh":"在历史记载中，凯斯内斯伯爵常出现在有关苏格兰北部的记述里。"},{"en":"The earldom of Caithness has changed hands many times over the centuries.","zh":"几个世纪以来，凯斯内斯伯爵领多次易主。"}]}],"phonetic":"/ˈkeɪθnəs/","extraExplanation":["读音提示：拼写里虽然有“th”，但常见读法接近“凯斯-内斯”，重音在第一个音节。","地理文化小知识：Caithness 属于苏格兰“远北”（Far North）的一部分，常与 Orkney（奥克尼群岛）一起出现在旅行与历史语境中。","词源背景：地名与古北欧语/古苏格兰地区历史有关，反映了维京时代北方沿海地区的影响。"]}
{"word":"caitif","summary":{"en":"Caitiff is an old-fashioned word meaning a cowardly, contemptible person, or something cowardly and vile.","zh":"Caitiff 是较古旧的词，指“懦夫、卑鄙的人”，也可作形容词表示“懦弱卑劣的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cowardly or despicable person; a villain (old-fashioned/literary).","zh":"懦夫；卑鄙的人；恶棍（较古旧/文学用语）。"},"examples":[{"en":"The knight swore he would punish the caitiff who betrayed the village.","zh":"骑士发誓要惩罚那个背叛村庄的卑鄙之徒。"},{"en":"In the novel, the hero refuses to run—he won’t be called a caitiff.","zh":"在小说里，英雄拒绝逃跑——他不愿被叫作懦夫。"}]},{"partOfSpeech":"adj.","definition":{"en":"cowardly; vile; despicable (old-fashioned/literary).","zh":"懦弱的；卑劣的；可鄙的（较古旧/文学用语）。"},"examples":[{"en":"It was a caitiff trick to blame an innocent person.","zh":"把责任推给无辜的人是卑劣的把戏。"},{"en":"He spoke with caitiff cruelty, enjoying others’ fear.","zh":"他说话带着卑劣的残忍，享受别人的恐惧。"}]}],"synonyms":["coward","cur","wretch","scoundrel","villain"],"phonetic":"/ˈkeɪtɪf/","extraExplanation":["“caitiff”在现代英语里很少用于日常口语，更常出现在莎士比亚式/中世纪题材的文学、史诗或奇幻作品中，用来营造古风语气。","词源上与古法语有关，历史上含有“被俘的人/卑微的人”的意味，后来引申为“卑鄙的家伙、懦夫”。注意它带有强烈的道德谴责色彩。"]}
{"word":"caitiff","summary":{"en":"“Caitiff” is a literary, old-fashioned word meaning a cowardly, despicable person (noun) or something morally contemptible (adjective).","zh":"“caitiff”是较古典、文学化的词，指“卑鄙怯懦的人”（名词）或“卑劣可鄙的”（形容词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A despicable, cowardly person; someone seen as contemptible or base.","zh":"卑鄙怯懦的人；可鄙的人。"},"examples":[{"en":"He called the thief a caitiff for stealing from the poor.","zh":"他骂那个小偷是个卑鄙怯懦的人，因为他竟从穷人那里偷东西。"},{"en":"In the old story, the hero refuses to fight like a caitiff and faces danger openly.","zh":"在那则古老的故事里，英雄拒绝像懦夫那样行事，而是光明正大地面对危险。"}]},{"partOfSpeech":"adj.","definition":{"en":"Despicable or cowardly; contemptible in a morally low way.","zh":"卑劣的；怯懦可鄙的。"},"examples":[{"en":"It was a caitiff act to betray a friend for money.","zh":"为了钱背叛朋友是卑劣可耻的行为。"},{"en":"The novel describes a caitiff villain who hides behind others.","zh":"小说描写了一个卑鄙的反派，总躲在别人背后。"}]}],"synonyms":["coward","wretch","scoundrel","despicable","contemptible"],"phonetic":"ˈkeɪtɪf","extraExplanation":["“caitiff”带有强烈的文学/古风色彩，在现代日常英语里很少用，更常见的替代词有：coward（懦夫）、wretch（可怜又可鄙的人）、scoundrel（无赖）、despicable（卑鄙的）。","词源上与“captif/ captive（俘虏）”有关：在中世纪语境里，“俘虏、奴仆”常被社会视为卑下之人，含义逐渐转为“卑鄙怯懦”。","常见于莎士比亚等古典文学风格中，用来加重道德谴责；语气很重，带侮辱性，使用时需注意场合。"]}
{"word":"caitiffs","summary":{"en":"“Caitiffs” means contemptible, cowardly people (a literary/old-fashioned insult).","zh":"“caitiffs”指“卑鄙懦弱的人”，属于较文学/古旧的侮辱用语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of caitiff) A contemptible, cowardly person; someone seen as mean, despicable, or dishonorable.","zh":"（caitiff 的复数）卑鄙懦弱的人；可鄙、可厌、无耻的人。"},"examples":[{"en":"The hero refused to bargain with the caitiffs who betrayed their own allies.","zh":"英雄拒绝与那些背叛自己盟友的卑鄙小人讨价还价。"},{"en":"In the story, the villain calls his enemies “caitiffs” to insult their courage and honor.","zh":"在故事里，反派用“caitiffs”来辱骂敌人缺乏勇气与名誉。"}]}],"synonyms":["cowards","scoundrels","wretches","villains","miscreants"],"phonetic":"/ˈkeɪtɪfs/","extraExplanation":["“caitiff”是较古旧、带强烈蔑视的词，常见于文学或历史风格写作；日常英语里更常用“coward”“scoundrel”“wretch”“villain”等。","词源大致来自古法语/拉丁语系统，早期还带有“俘虏、受困之人”的含义，后来语义转为“卑鄙可鄙的人”。","文学中常见此类辱骂词（例如莎士比亚作品里也能见到类似风格的用语），用来强化戏剧性与道德评判。"]}
{"word":"caitifty","summary":{"en":"Captivity means being kept somewhere as a prisoner or not being free to leave.","zh":"Captivity 指被囚禁或被限制自由、无法离开的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being kept as a prisoner or being unable to leave freely","zh":"被囚禁、被关押的状态；失去自由的处境"},"examples":[{"en":"The soldiers spent two years in captivity before they were released.","zh":"这些士兵被囚禁了两年才获释。"},{"en":"Many animals suffer in captivity because their natural needs aren’t met.","zh":"许多动物在圈养环境中受苦，因为它们的自然需求得不到满足。"},{"en":"She wrote a diary about her captivity and how she stayed hopeful.","zh":"她写日记记录自己的囚禁经历，以及她如何保持希望。"}]}],"synonyms":["imprisonment","confinement","detention","captivity"],"phonetic":"/kæpˈtɪvəti/","extraExplanation":["你输入的“caitifty”很可能是拼写错误，常见目标词是 **captivity**。它来自 *captive*（俘虏、被关押的人）。","在英语里，**in captivity** 常用来指“圈养/关在笼中”，尤其谈论动物（如 *animals in captivity*）。","文学与新闻语境中，**captivity** 常与战争、人质事件、殖民历史叙事等话题相关，语气较严肃。"]}
{"word":"Caitlin","summary":{"en":"Caitlin is a common female first name, originally from Irish, often linked to the idea of “purity.”","zh":"Caitlin 是常见的女性英文名，源自爱尔兰语，常与“纯洁”的含义相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A female given name (first name), common in English-speaking countries; originally from Irish, often associated with the meaning “pure.”","zh":"女性名字（名），在英语国家很常见；源自爱尔兰语，常被解释为“纯洁”。"},"examples":[{"en":"Caitlin is starting a new job next week.","zh":"Caitlin 下周要开始一份新工作。"},{"en":"Please ask Caitlin to call me when she’s free.","zh":"请让 Caitlin 有空时给我打电话。"}]}],"synonyms":["Kaitlyn","Katelyn","Catelyn","Katherine (related origin)"],"phonetic":"/ˈkeɪt.lɪn/","extraExplanation":["“Caitlin”常被认为来自爱尔兰语姓名“Caitlín”，与“Katherine（凯瑟琳）”同源；在英文中有多种常见拼写与变体，如 Kaitlyn、Katelyn、Catelyn 等，读音也可能因地区与个人偏好略有不同。","在20世纪末至21世纪初，“Caitlin/Kaitlyn”系列拼写在美国非常流行，因此你可能会在同一届学生或同一年龄段里遇到多个不同拼写但读音相近的名字。"]}
{"word":"Caitrin","summary":{"en":"Caitrin is a feminine given name, often treated as a variant of Catriona/Caitríona (related to Katherine).","zh":"Caitrin 是一个女性名字，常被视为 Catriona/Caitríona 的变体拼写（与 Katherine/凯瑟琳相关）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A female given name (first name), commonly used in English-speaking contexts; a variant spelling of Caitríona/Catriona/Katherine.","zh":"女性名字（名），常见于英语语境；常被视为 Caitríona/Catriona/Katherine（凯瑟琳）的一种变体拼写。"},"examples":[{"en":"Caitrin joined our class this semester.","zh":"Caitrin 这学期加入了我们班。"},{"en":"I met Caitrin at a conference in Boston.","zh":"我在波士顿的一场会议上认识了 Caitrin。"}]}],"synonyms":["Catriona","Caitríona","Katrina","Catherine","Katherine"],"phonetic":"/ˈkeɪtrɪn/","extraExplanation":["“Caitrin”多被理解为苏格兰/爱尔兰姓名体系中的变体拼写，常与 Catriona / Caitríona（相当于英语 Katherine）相关。不同地区与家庭会选择不同拼写来体现文化身份或个人偏好。","在英文里，人名通常不翻译含义，但在介绍时可以补充其来源：Katherine 传统上与“纯洁（pure）”的联想有关；不过现代取名更多看重音韵与家族传统。"]}
{"word":"Caius","summary":{"en":"Caius is a male name, often a variant of the Roman name Gaius, and it also appears in names of institutions such as Gonville and Caius College.","zh":"Caius 是男子名，常被视为罗马人名 Gaius 的变体，也常见于机构名称中，如剑桥大学的冈维尔与凯斯学院。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A masculine given name used in ancient Rome; a spelling variant of **Gaius** (a very common Roman personal name).","zh":"（男子名）古罗马常见的名字；**Gaius** 的一种拼写变体（非常常见的罗马人名）。"},"examples":[{"en":"Caius Julius Caesar is a famous figure from Roman history.","zh":"Caius Julius Caesar 是罗马历史上的著名人物。"},{"en":"In the play, Caius speaks like a Roman soldier.","zh":"在这部戏里，Caius 的说话方式像一名罗马士兵。"}]},{"partOfSpeech":"n.","definition":{"en":"A name used for people or institutions connected to the name **Caius**, especially in British contexts (e.g., **Gonville and Caius College**, Cambridge).","zh":"用于与 **Caius** 这个名字相关的人或机构的名称，尤其在英国语境中（如剑桥大学的 **Gonville and Caius College**）。"},"examples":[{"en":"She studied at Gonville and Caius College, Cambridge.","zh":"她在剑桥大学冈维尔与凯斯学院学习。"}]}],"synonyms":["Gaius"],"phonetic":"/ˈkeɪəs/","extraExplanation":["“Caius”在古典拉丁语中对应“Gaius”。英语里常把它读成 /ˈkeɪəs/（类似“KAY-us”），尤其在学校名称或人名的现代用法中。","文学提及：莎士比亚《温莎的风流娘儿们》（The Merry Wives of Windsor）里有一位名叫 Doctor Caius 的角色（法国医生），因此在英语戏剧语境中你可能会遇到这个名字。"]}
{"word":"caixinha","summary":{"en":"“Caixinha” is Portuguese for “a little box,” and in Brazil it often also means “a small tip/gratuity” (and sometimes a petty-cash fund).","zh":"“Caixinha”是葡语，字面是“小盒子”；在巴西常也指“小费/酬谢”，有时还指“小额周转金”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small box; a little box (diminutive of Portuguese “caixa”).","zh":"小盒子；小箱子（葡语“caixa”的指小形式）。"},"examples":[{"en":"She kept the jewelry in a caixinha on her desk.","zh":"她把首饰放在桌上的一个小盒子里。"},{"en":"Put the keys in the caixinha by the door.","zh":"把钥匙放在门边的小盒子里。"}]},{"partOfSpeech":"n.","definition":{"en":"(Brazil, informal) a small tip or gratuity; sometimes a small extra payment/bonus given for a service.","zh":"（巴西口语）小费；有时也指服务后的额外酬谢/小奖励。"},"examples":[{"en":"We left a caixinha for the hotel staff.","zh":"我们给酒店员工留了一点小费。"},{"en":"It’s common to give the doorman a caixinha at the end of the year.","zh":"年底给门卫一点“年终小费/酬谢”很常见。"}]},{"partOfSpeech":"n.","definition":{"en":"(business, Brazil) a petty-cash fund or small cash reserve; sometimes an unofficial “slush fund,” depending on context.","zh":"（商业/巴西）备用零钱/小额现金周转金；在某些语境下也可能暗指“灰色小金库/小账”。"},"examples":[{"en":"They used the caixinha to pay for small office expenses.","zh":"他们用备用零钱来支付办公室的小额开支。"},{"en":"In the news, “caixinha” can imply an unofficial fund.","zh":"在新闻里，“caixinha”有时暗示非正式资金池。"}]}],"synonyms":["small box","little box","tip","gratuity","petty cash"],"phonetic":"/kaɪˈʃiːnjə/","extraExplanation":["“caixinha”是葡萄牙语的指小词：caixa（箱子/盒子）+ -inha（小…、可爱的…）。在巴西语境里，“dar uma caixinha”常用来表示“给点小费/意思一下”。","不同国家/行业对“小费”习惯差异很大；在巴西旅行时，是否给“caixinha”以及给多少，通常取决于服务类型和当地惯例。"]}
