{"word":"Cajan","summary":{"en":"Cajan usually means “pigeon pea,” a tropical edible legume.","zh":"Cajan通常指“木豆/鸽豆”，一种热带可食用的豆类作物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical legume (pigeon pea) whose seeds are eaten as food; also the plant itself.","zh":"木豆；一种热带豆科作物（鸽豆），其豆粒可食用；也可指这种植物本身。"},"examples":[{"en":"Cajan is widely used in Caribbean cooking, often in rice-and-peas dishes.","zh":"木豆在加勒比地区料理中很常见，常被用来做“豆饭”一类的菜。"},{"en":"The stew is made with cajan and coconut milk.","zh":"这道炖菜用木豆和椰奶做成。"},{"en":"Farmers grow cajan because it tolerates heat and drought better than many other beans.","zh":"农民种木豆是因为它比很多其他豆类更耐热、耐旱。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to pigeon pea.","zh":"与木豆（鸽豆）有关的。"},"examples":[{"en":"Cajan leaves are sometimes used in traditional herbal teas.","zh":"木豆的叶子有时会被用来泡传统草本茶。"}]}],"synonyms":["pigeon pea","Congo pea","gungo pea"],"phonetic":"/ˈkædʒən/","extraExplanation":["“Cajan”在英语里不如“pigeon pea”常见，多见于饮食或植物学语境。常见别名包括：Congo pea / gungo pea（在一些加勒比英语中常用）。","注意不要和“Cajun（卡津）”混淆：Cajun指美国路易斯安那的卡津文化与人群，拼写不同、含义也完全不同。","在许多地区（如印度、非洲、加勒比海），木豆是重要蛋白质来源，也常用于改善土壤（豆科植物可固氮）。"]}
{"word":"cajan","summary":{"en":"Cajan is another name for the pigeon pea plant (Cajanus cajan) and its edible seeds.","zh":"cajan 指木豆（鸽豆）这种植物及其可食用的豆子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical legume (Cajanus cajan) whose edible seeds are used as food; also called pigeon pea.","zh":"一种热带豆科植物（木豆，学名 Cajanus cajan），其可食用的豆子常被用作食物；也叫“鸽豆”。"},"examples":[{"en":"Pigeon peas come from the cajan plant and are common in Caribbean cooking.","zh":"鸽豆来自木豆（cajan）植物，在加勒比烹饪中很常见。"},{"en":"In some markets, cajan seeds are sold dried, like other beans.","zh":"在一些市场里，木豆（cajan）的种子会像其他豆类一样以干货形式出售。"}]}],"synonyms":["pigeon pea","Cajanus cajan","red gram"],"phonetic":"/kəˈdʒæn/","extraExplanation":["“cajan”在英语里比较少见，更多情况下人们会说“pigeon pea（鸽豆）”或“Cajanus cajan（学名）”。","注意不要和“Cajun（卡津/卡真，指路易斯安那的法裔文化与方言）”混淆；两者拼写和含义都不同。","“cajan”常出现在植物学、食品成分表或农业资料中，而日常对话里用“pigeon pea”更自然。"]}
{"word":"cajang","summary":{"en":"“Cajang” is uncommon in English; it usually refers to (or is a misspelling of) Kajang, a town in Malaysia known for Kajang satay.","zh":"“Cajang”在英语里不常见；通常指（或是误写）马来西亚的加影（Kajang），以加影沙爹闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name (proper noun): a town in Selangor, Malaysia, near Kuala Lumpur; often mentioned for its famous “Kajang satay.”","zh":"地名（专有名词）：马来西亚雪兰莪州的城镇，靠近吉隆坡；常因“加影沙爹（Kajang satay）”而被提到。"},"examples":[{"en":"We stopped in Kajang to try the local satay.","zh":"我们在加影（Kajang）停下来吃当地的沙爹。"},{"en":"Kajang is within commuting distance of Kuala Lumpur.","zh":"加影在吉隆坡的通勤范围内。"}]}],"synonyms":["Kajang"],"phonetic":"/kəˈdʒɑːŋ/","extraExplanation":["“Cajang”在英语中并不常见，很多情况下是把马来西亚地名“Kajang”误写成了“Cajang”。英语资料里更标准的拼法是“Kajang”。","如果你本来想查的是 **Cajun**（卡津人/卡津文化）或 **cajón**（卡洪鼓），告诉我你的上下文（句子/来源），我可以帮你确认。"]}
{"word":"Cajanus","summary":{"en":"Cajanus is the plant genus that includes the pigeon pea.","zh":"Cajanus 指包含木豆/鸽豆在内的植物属（木豆属）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical legume plants in the pea/bean family (Fabaceae), best known for the pigeon pea (Cajanus cajan).","zh":"木豆属：豆科（Fabaceae）的一类热带豆类植物属，最知名的成员是木豆/鸽豆（Cajanus cajan）。"},"examples":[{"en":"Cajanus cajan (pigeon pea) is widely grown for food in tropical regions.","zh":"木豆（Cajanus cajan，鸽豆）在热带地区广泛种植作为食物。"},{"en":"Researchers studied Cajanus species for drought tolerance.","zh":"研究人员研究木豆属（Cajanus）物种的耐旱性。"}]}],"synonyms":["pigeon pea (for Cajanus cajan)","pigeonpea"],"phonetic":"/kəˈdʒænəs/","extraExplanation":["“Cajanus”是拉丁化的植物学属名，常见于学术论文、植物志和食品/农业资料中；日常英语里更常说具体作物名“pigeon pea”（鸽豆/木豆）。","分类上它属于豆科，与常见的豆类（如豌豆、菜豆等）同科，但“Cajanus”本身指的是“属”（genus），不是单一物种。"]}
{"word":"cajanus","summary":{"en":"Cajanus is a plant genus, most famously including the pigeon pea (Cajanus cajan).","zh":"Cajanus 指木豆属（豆科的一属植物），最著名的成员是木豆/鸽豆（Cajanus cajan）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of plants in the pea/bean family (Fabaceae), best known for the species Cajanus cajan (the pigeon pea).","zh":"（植物）木豆属：豆科（Fabaceae）的一属植物，最著名的物种是木豆（Cajanus cajan，即“鸽豆/木豆”）。"},"examples":[{"en":"Cajanus includes the pigeon pea, an important food crop in many tropical regions.","zh":"木豆属（Cajanus）包含木豆/鸽豆，在许多热带地区是一种重要的粮食作物。"},{"en":"Researchers studied Cajanus species to improve drought tolerance in pigeon peas.","zh":"研究人员研究木豆属（Cajanus）的物种，以提高木豆（鸽豆）的抗旱能力。"}]}],"synonyms":["pigeon pea genus"],"phonetic":"/kəˈdʒænəs/","extraExplanation":["“Cajanus”是拉丁化的学名，常见于生物学、农学与植物学文章中；日常英语里更常说具体物种名“pigeon pea（鸽豆/木豆）”或学名“Cajanus cajan”。","在科学写作中，属名通常首字母大写并用斜体：Cajanus；物种名写作 Cajanus cajan（属名+种加词）。"]}
{"word":"cajaput","summary":{"en":"Cajuput (also spelled cajaput) is a tropical tree, or the essential oil made from its leaves.","zh":"cajuput（也拼作 cajaput）指一种热带树（白千层等），也可指由其叶子蒸馏得到的白千层精油。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical tree (Melaleuca species) native to Southeast Asia and Australia, with pale bark and aromatic leaves","zh":"白千层（或同类桃金娘科植物）；一种热带树，树皮浅色，叶子有芳香"},"examples":[{"en":"Cajuput trees grow well in swampy coastal areas.","zh":"白千层树在沿海沼泽地区生长良好。"},{"en":"The leaves of the cajuput are strongly scented when crushed.","zh":"白千层的叶子捣碎后气味很浓。"}]},{"partOfSpeech":"n.","definition":{"en":"an essential oil distilled from cajuput leaves, used in traditional remedies and in products for fragrance or a cooling feeling","zh":"白千层油（由白千层叶蒸馏而成的精油）；常用于传统外用护理、香氛或带清凉感的产品"},"examples":[{"en":"Some balms contain cajuput oil for a cooling effect.","zh":"有些药膏含白千层油，会有清凉感。"},{"en":"Always dilute cajuput oil before applying it to the skin.","zh":"把白千层油涂在皮肤上前一定要先稀释。"}]}],"synonyms":["cajaput","cajuput oil","Melaleuca (tree)","white tea tree (informal)"],"phonetic":"/ˈkædʒəˌpʊt/","extraExplanation":["“cajuput”也常拼作“cajaput”。词源来自马来语 *kayu putih*，意思是“白色的木头（白木）”，对应这种树浅色的树皮。","学习提示：这是一个比较专业的植物/精油词。日常更常见的近义或相关说法包括“tea tree (oil)”（茶树油，常指澳洲茶树）和“eucalyptus (oil)”（桉树/桉树油），但它们不是同一种植物或精油，气味与用途也可能不同。"]}
{"word":"cajaputs","summary":{"en":"Cajuput (sometimes misspelled “cajaputs”) is an essential oil from a tea tree, often used in balms or steam to ease congestion and aches.","zh":"Cajuput（常被误写成 cajaputs）是从白千层/茶树类植物提取的精油，常用于药膏或熏蒸以缓解鼻塞与酸痛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Also spelled cajuput.) A fragrant essential oil made from the leaves and twigs of a type of tea tree (Melaleuca), used especially in rubs and traditional remedies to relieve congestion or muscle aches.","zh":"（也拼作 cajuput。）一种从白千层（茶树属 Melaleuca）叶和嫩枝蒸馏得到的芳香精油，常用于外用擦剂或传统疗法，帮助缓解鼻塞、咳嗽或肌肉酸痛。"},"examples":[{"en":"The balm contains cajuput oil to help open up your nose when you have a cold.","zh":"这种药膏含有白千层（cajuput）精油，感冒时可以帮助缓解鼻塞。"},{"en":"Some people add a few drops of cajuput oil to hot water for steam inhalation.","zh":"有人会在热水里滴几滴白千层精油，用蒸汽吸入。"}]}],"synonyms":["cajuput oil","tea tree oil (broader term)","Melaleuca oil"],"phonetic":"/ˈkɑːdʒəpʊt/","extraExplanation":["“cajaputs”通常不是标准拼写，更常见的是 **cajuput**（单数）或 **cajuputs**（复数，表示多种/多瓶白千层精油或相关制品）。","cajuput oil 在东南亚（如印尼、马来西亚）较常见；在英语里也会和 eucalyptus oil（桉树油）一起被提到，但气味与来源不同。"]}
{"word":"cajava","summary":{"en":"“cajava” is not a common English word; it’s usually a name or a blend (often related to “java,” meaning coffee or the Java language).","zh":"“cajava”不是常见英语词，通常是名称或自造组合；常与“java”（咖啡或 Java 语言）有关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English dictionary word. “cajava” is most often seen as a name (e.g., a username, brand, or project title) or as a creative blend like “CA + Java.”","zh":"不是标准英语词典词。“cajava”更常见为名称（如用户名、品牌、项目名），或作为“CA + Java”等自造组合。"},"examples":[{"en":"I couldn’t find “cajava” in a dictionary, so it may be a brand name or a typo.","zh":"我在词典里找不到“cajava”，所以它可能是品牌名或拼写错误。"},{"en":"The file is called “cajava,” which looks like a project name rather than a common word.","zh":"这个文件叫“cajava”，看起来像项目名而不是常用词。"}]},{"partOfSpeech":"n.","definition":{"en":"(Possible intended word) “java”: coffee; or the Java programming language.","zh":"（可能想写的词）“java”：咖啡；或 Java 编程语言。"},"examples":[{"en":"Let’s grab some java before class.","zh":"上课前我们去喝杯咖啡吧。"},{"en":"She writes apps in Java.","zh":"她用 Java 写应用程序。"}]}],"synonyms":["(if intended: java) coffee","(if intended: Java) Java programming language"],"phonetic":"/kəˈdʒɑːvə/","extraExplanation":["“cajava”如果出现在咖啡相关语境里，可能是“CA (California) + java（咖啡）”的店名/品牌名写法；如果出现在编程语境里，也可能指“CA + Java”的项目代号。","如果你能提供一句原文（它出现的句子/网站/领域），我可以更准确判断它到底是专有名词、缩写，还是把“java”拼错了。"]}
{"word":"cajeput","summary":{"en":"Cajeput is a tropical tree, and also the essential oil made from its leaves that smells similar to eucalyptus.","zh":"cajeput 指一种热带的白千层树，也指由其叶子蒸馏得到、气味类似桉树的白千层精油。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tropical tree (Melaleuca cajuputi, related to tea tree) native to Southeast Asia and Australia.","zh":"白千层树（Melaleuca cajuputi，一种热带树木，与茶树同属桃金娘科），原产东南亚与澳大利亚一带。"},"examples":[{"en":"Cajeput trees grow well in wet, coastal areas.","zh":"白千层树在潮湿的沿海地区生长得很好。"},{"en":"The bark of the cajeput tree peels off in thin layers.","zh":"白千层树的树皮会一层层薄薄地剥落。"}]},{"partOfSpeech":"n.","definition":{"en":"An essential oil distilled from the leaves/twigs of the cajeput tree, traditionally used for a strong, eucalyptus-like smell and in some folk remedies.","zh":"白千层精油（由白千层树的叶或嫩枝蒸馏而成），气味像尤加利（桉树）般辛香，在一些民间用途中被使用。"},"examples":[{"en":"This balm contains cajeput oil for its sharp, refreshing scent.","zh":"这款药膏含有白千层精油，闻起来辛香清新。"},{"en":"Some people use cajeput oil in a diffuser, but it should be used carefully.","zh":"有些人会在香薰机里使用白千层精油，但需要谨慎使用。"}]}],"synonyms":["Melaleuca cajuputi","cajeput oil"],"phonetic":"/ˈkædʒəˌpʊt/","extraExplanation":["“cajeput”一词来自马来语/印尼语，意思大致是“白色的树（白木）”，对应这种树常见的浅色、纸状剥落树皮。","在英文里它常出现在香氛、按摩膏或传统用法的语境中；作为精油属于高浓度芳香物质，日常使用通常需要稀释，并注意皮肤敏感与儿童/宠物安全。"]}
{"word":"cajeputol","summary":{"en":"Cajeputol is a strongly scented essential oil from cajeput (cajuput) leaves, used traditionally in small amounts in balms or inhalations.","zh":"cajeputol 指由白千层（cajeput/cajuput）叶子提取的气味浓烈的精油，传统上少量用于外用清凉膏或蒸汽吸入等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a pale, strongly scented essential oil made from the leaves of the cajeput (cajuput) tree, traditionally used in small amounts in topical remedies and inhalations","zh":"白千层精油（桉千层油）：由白千层（cajeput/cajuput）树叶蒸馏得到的浅色、气味浓烈的精油，传统上少量用于外用护理或吸入用途"},"examples":[{"en":"Some traditional balms contain cajeputol for its strong, camphor-like aroma.","zh":"一些传统的清凉膏会含有白千层精油，因为它有类似樟脑的强烈香气。"},{"en":"She added a drop of cajeputol to a bowl of hot water for steam inhalation.","zh":"她在热水盆里滴了一滴白千层精油，用来蒸汽吸入。"}]}],"synonyms":["cajuput oil","oil of cajeput","cajeput oil"],"phonetic":"/ˈkɑːdʒəˌpjuːt ɔɪl/","extraExplanation":["“cajeputol”在现代英语里不算常见，更常见的写法是 **cajuput oil / oil of cajeput**（也常指与白千层相关的精油）。如果你是在配方、药典或旧书里看到这个词，它多半是指白千层精油一类的传统用油。","词源上与东南亚（如马来语）对白千层树的称呼有关，常见于传统草药与香膏文化语境。","学习与使用时要注意：精油通常需要稀释并遵循安全用量；不同国家对外用或吸入的建议不一。"]}
{"word":"cajeputole","summary":{"en":"Cajeput oil is an essential oil from the cajeput (Melaleuca) tree, often used for its strong, eucalyptus-like scent in topical products and aromatherapy.","zh":"Cajeput oil（白千层精油）是从白千层（Melaleuca）树提取的精油，常因类似桉树的气味用于外用产品与芳香疗法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an essential oil made from the leaves and twigs of the cajeput tree (a type of Melaleuca), used in small amounts in traditional remedies, aromatherapy, and some liniments for a cooling, eucalyptus-like smell","zh":"白千层精油（由白千层树属 Melaleuca 的叶和嫩枝蒸馏而成），少量用于传统外用药、芳香疗法和一些搽剂，气味类似桉树、带清凉感"},"examples":[{"en":"Cajeput oil is sometimes added to liniments for sore muscles.","zh":"白千层精油有时会加入肌肉酸痛用的搽剂里。"},{"en":"The balm had a strong, eucalyptus-like scent from cajeput oil.","zh":"这种膏药因为含白千层精油而带有浓烈、类似桉树的气味。"},{"en":"Use cajeput oil carefully and dilute it before applying to skin.","zh":"使用白千层精油要小心，涂皮肤前应先稀释。"}]}],"synonyms":["cajuput oil","cajeput essential oil"],"phonetic":"/ˈkædʒəˌpʊt ɔɪl/","extraExplanation":["“cajeput oil”也常拼作“cajuput oil”。你输入的“cajeputole”很可能是把“cajeput oil”连写或拼写混淆了。","词源与文化：cajeput 来自马来语“kayu putih”（意为“白色的木头/白树”），在东南亚地区传统上用于外用搽剂、熏香等。","注意区分：白千层精油与常见的“tea tree oil（茶树精油）”同属 Melaleuca 属但通常来自不同物种，气味与用途也不完全一样；精油类产品一般不建议口服，皮肤使用需稀释并留意过敏反应。"]}
{"word":"cajeputs","summary":{"en":"Cajeputs are tropical trees, and the word can also mean the essential oil made from their leaves (cajeput oil).","zh":"cajeputs 指白千层树（复数），也可指由其叶片制成的白千层精油（cajeput oil）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical tree (Melaleuca cajuputi) native to Southeast Asia and northern Australia, with papery bark and aromatic leaves","zh":"白千层树（Melaleuca cajuputi），一种原产东南亚与澳大利亚北部的热带树木，树皮呈纸状、叶片带芳香"},"examples":[{"en":"Cajeputs grow well in hot, wet climates near coastal areas.","zh":"白千层树适合在炎热潮湿的沿海地区生长。"},{"en":"The leaves of cajeputs release a strong, fresh scent when crushed.","zh":"白千层树的叶子捏碎后会散发出强烈清新的气味。"}]},{"partOfSpeech":"n.","definition":{"en":"the essential oil distilled from cajeput leaves, used in small amounts in topical products for its strong scent and warming sensation","zh":"白千层精油（由叶片蒸馏而成），常少量用于外用产品中，因其气味浓烈并带“温热感”"},"examples":[{"en":"Some balms include cajeput oil for a cooling-then-warming feeling on the skin.","zh":"有些药膏会加入白千层精油，让皮肤先凉后热。"},{"en":"Always dilute cajeput oil before applying it to your skin.","zh":"把白千层精油涂在皮肤上前一定要先稀释。"}]}],"synonyms":["cajuput","cajeput oil","white tea tree (common name)"],"phonetic":"ˈkædʒəˌpʊt","extraExplanation":["“cajeput”一词来自马来语 *kayu putih*（字面意思是“白木”），指这种树浅色、纸状的树皮。英语里也常写作 **cajuput**，而你输入的 **cajeputs** 多半是其复数形式（指多棵树或多种相关产品）。","学习提示：在英语里，谈到精油时更常用 **cajeput oil** 这个搭配。若你在成分表或药膏说明上看到它，通常就是指“白千层精油”。"]}
{"word":"cajeta","summary":{"en":"Cajeta is a Mexican goat’s-milk caramel used as a sauce or candy.","zh":"Cajeta是一种墨西哥山羊奶焦糖，可作酱或糖果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Mexican caramel sauce or candy made by slowly cooking sweetened goat’s milk (sometimes mixed with cow’s milk) until thick and golden-brown.","zh":"一种墨西哥焦糖酱或焦糖糖果，通常用加糖的山羊奶（有时混合牛奶）慢慢熬煮至浓稠、呈金棕色。"},"examples":[{"en":"I bought cajeta to drizzle over ice cream.","zh":"我买了cajeta淋在冰淇淋上。"},{"en":"Cajeta tastes like a richer, slightly tangier version of dulce de leche.","zh":"cajeta的味道像更浓郁、带一点酸香的dulce de leche。"},{"en":"The bakery filled the churros with cajeta.","zh":"那家烘焙店用cajeta做吉事果的内馅。"}]}],"synonyms":["goat’s-milk caramel","dulce de leche (similar)","caramel sauce"],"phonetic":"/kəˈheɪtə/","extraExplanation":["“Cajeta”是西班牙语借词，在英语里多指墨西哥的山羊奶焦糖。常见吃法包括抹面包、淋甜点、做夹馅或调入咖啡。","发音上英语里常读成类似“kah-HEH-tah / kuh-HEH-tah”。在少数西语地区它也可能有粗俗含义；在餐饮语境中一般只指甜品。"]}
{"word":"cajole","summary":{"en":"Cajole means to gently (and sometimes slyly) persuade someone, often with flattery or repeated requests.","zh":"Cajole 指用好话、奉承或反复请求来“哄劝/软磨硬泡”说服别人。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To persuade someone to do something by friendly pressure, repeated requests, or gentle flattery (often when the person is unsure or unwilling).","zh":"（常指对方不太情愿时）用哄劝、软磨硬泡、好言相劝或带点奉承来劝说某人做某事。"},"examples":[{"en":"She finally cajoled him into going to the doctor.","zh":"她最后哄劝他去看医生。"},{"en":"The kids tried to cajole their dad into buying ice cream.","zh":"孩子们试着软磨硬泡让爸爸买冰淇淋。"},{"en":"I had to cajole the team to finish the report on time.","zh":"我不得不好言相劝团队按时完成报告。"}]},{"partOfSpeech":"vt.","definition":{"en":"To get something from someone through persistent, gentle persuasion.","zh":"用反复的温和劝说从某人那里“哄”到某物。"},"examples":[{"en":"He cajoled a promise out of her.","zh":"他好言相劝，让她答应了下来。"},{"en":"With a little joking and praise, she cajoled a discount from the clerk.","zh":"她开玩笑又夸了几句，从店员那里哄到了折扣。"}]}],"synonyms":["coax","wheedle","sweet-talk","persuade","nudge"],"phonetic":"/kəˈdʒoʊl/","extraExplanation":["“cajole”常带有一点“手段不强硬、但有点技巧/策略”的感觉：比 persuade 更偏“哄、软磨”，比 threaten 或 pressure 更温和。语气有时略微负面（像在“哄骗/套话”），但不一定是坏事，取决于语境。","常见搭配：cajole sb into doing sth（哄劝某人做某事）；cajole sth out of sb（从某人那里哄到某物/承诺）。"]}
{"word":"cajoled","summary":{"en":"“Cajoled” means persuaded by gentle/flattering talk, sometimes slightly manipulative.","zh":"“cajoled”指用温和或奉承的话哄劝别人做事，有时带一点点操控意味。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “cajole”: persuaded someone to do something by talking in a friendly, gentle, or flattering way, sometimes with a slightly manipulative tone","zh":"“cajole”的过去式/过去分词：用温和、讨好、奉承的方式劝说某人去做某事，有时带点“哄着来”的操控意味"},"examples":[{"en":"She cajoled her little brother into sharing his toys.","zh":"她哄着弟弟把玩具拿出来一起玩。"},{"en":"The salesperson cajoled him into buying the more expensive model.","zh":"销售人员用甜言蜜语把他劝得买了更贵的型号。"},{"en":"After a long conversation, we finally cajoled the dog into getting into the car.","zh":"聊了很久，我们终于哄着狗上了车。"}]}],"synonyms":["coaxed","sweet-talked","wheedled","persuaded"],"phonetic":"/kəˈdʒoʊld/","extraExplanation":["“cajole”常带轻微的负面含义：不是强迫（force），也不只是普通说服（persuade），更像用好话、哄劝、奉承来让对方答应。语气可轻松，但在商业或权力关系里可能暗示“套路/忽悠”。","常见搭配：cajole sb into doing sth（哄/劝某人去做某事）。","近义词语感区别：coax（哄劝，语气更中性/更温柔）、wheedle（用讨好话纠缠着要，偏负面）、sweet-talk（甜言蜜语哄人，口语）。"]}
{"word":"cajolement","summary":{"en":"Cajolement means gentle, persistent persuasion, often using flattery or friendliness.","zh":"Cajolement 指用温和但持续的方式（常带奉承或讨好）去哄劝他人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(noun) Gentle, persistent persuasion—often using flattery, friendliness, or repeated requests—to get someone to do something.","zh":"（名词）哄劝；劝诱——用温和但持续的方式（常带奉承、讨好或反复请求）让别人做某事。"},"examples":[{"en":"After a lot of cajolement, he finally agreed to help us move.","zh":"在一番哄劝之后，他终于同意帮我们搬家。"},{"en":"The child got extra dessert through smiles and cajolement.","zh":"孩子用笑脸和哄劝换来了额外的甜点。"},{"en":"She resisted their cajolement and stuck to her decision.","zh":"她顶住了他们的哄劝，坚持了自己的决定。"}]}],"synonyms":["coaxing","persuasion","sweet talk","wheedling","entreaty"],"phonetic":"/kəˈdʒoʊlmənt/","extraExplanation":["“cajolement”通常带一点“软磨硬泡/讨好哄骗”的语感：不是强迫，而是用甜言蜜语或反复劝说来影响别人。语气可中性也可略带贬义，取决于是否显得不真诚或带目的性。","相关词：cajole（动词，哄骗/劝诱）；近义表达还有 sweet-talk（甜言蜜语）和 coax（哄劝，较中性）。"]}
{"word":"cajolements","summary":{"en":"“Cajolements” means coaxing, often flattering persuasion (plural).","zh":"“cajolements”指（复数）哄劝、甜言蜜语式的劝说。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Gentle, persuasive talk or actions—often flattering—used to coax someone into doing something.","zh":"（复数）哄劝、甜言蜜语；用温和（常带奉承）的方式劝人照做。"},"examples":[{"en":"After hours of cajolements, he finally agreed to join the team.","zh":"在哄劝了好几个小时后，他终于同意加入团队。"},{"en":"She didn’t respond to threats, but she softened after a few warm cajolements.","zh":"她对威胁不为所动，但在几句温和的甜言蜜语后态度软化了。"},{"en":"The child’s cajolements were cute, but the answer was still no.","zh":"孩子的撒娇哄劝很可爱，但答案还是不行。"}]}],"synonyms":["blandishments","coaxing","sweet talk","flattery","wheedling"],"phonetic":"/kəˈdʒoʊlmənts/","extraExplanation":["“cajolements”来自动词“cajole”（哄骗/哄劝）。语气通常比“pressure（施压）”更柔和，但有时也暗示对方在“用甜言蜜语达成目的”，带一点不太真诚或带策略的感觉。","词源上与法语“cajoler”有关，含“讨好、用温柔话语取悦”的意味，因此常和“flattery（奉承）”的语境一起出现。"]}
{"word":"cajoler","summary":{"en":"A cajoler is someone who persuades people through gentle coaxing or flattering.","zh":"cajoler 指用哄劝、奉承等温和方式来说服他人的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who cajoles—someone who persuades others gently by flattering, coaxing, or sweet talk (sometimes in a slightly manipulative way).","zh":"哄劝者；用甜言蜜语、奉承或温和劝诱来说服他人的人（有时带一点操纵意味）。"},"examples":[{"en":"He’s a skilled cajoler who can talk almost anyone into joining his plan.","zh":"他很会哄劝，几乎能把任何人说服加入他的计划。"},{"en":"As a cajoler, she relied on compliments rather than pressure.","zh":"作为一个哄劝者，她更依赖夸奖而不是施压。"},{"en":"Don’t trust every cajoler—sweet words can hide selfish motives.","zh":"别轻信每个哄劝者——甜言蜜语可能掩盖自私的动机。"}]}],"synonyms":["coaxer","wheedler","sweet-talker","persuader","flatterer"],"phonetic":"/kəˈdʒoʊlər/","extraExplanation":["“cajoler”来自动词“cajole”（哄劝、诱哄）。语气通常比“force/pressure”（强迫/施压）更柔和，但在一些语境里也可能暗示“不太真诚的劝诱”。","词源上与法语有关（cajoler），常与“flatter（奉承）/coax（哄劝）/wheedle（软磨硬泡）”等词在意义上接近。"]}
{"word":"cajoleries","summary":{"en":"“Cajoleries” means flattering, sweet talk used to persuade someone.","zh":"“cajoleries”指用来劝诱或哄人的甜言蜜语、奉承话。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Sweet talk, flattering words, or gentle persuasion used to get someone to do something.","zh":"（复数）甜言蜜语；奉承话；用温柔的劝诱让别人照你的意思做。"},"examples":[{"en":"He won the guard over with smiles and cajoleries.","zh":"他用微笑和甜言蜜语把门卫哄得心软了。"},{"en":"She was tired of his constant cajoleries and wanted a direct answer.","zh":"她厌倦了他不停的甜言蜜语，只想要一个直接的回答。"},{"en":"The salesperson’s cajoleries didn’t change her mind.","zh":"推销员的花言巧语并没有改变她的想法。"}]}],"synonyms":["flattery","sweet talk","blandishments","coaxing","wheedling"],"phonetic":"/kəˈdʒoʊləriz/","extraExplanation":["“cajoleries”是名词“cajolery”的复数形式，来自动词“cajole”（哄骗、劝诱），词源可追溯到法语。“cajolery/cajoleries”常带一点“不够真诚、带目的的讨好”的感觉，比普通的“praise”（表扬）更像“软磨硬泡式的甜言蜜语”。在文学或叙述中，它常用来描写人物用言语技巧操控他人、化解冲突或达成交易的方式。"]}
{"word":"cajolers","summary":{"en":"“Cajolers” are people who coax or sweet-talk others into doing something.","zh":"“Cajolers”指用哄劝、甜言蜜语或奉承来让别人做某事的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who try to persuade someone by using gentle, friendly, or flattering talk (often to get what they want)","zh":"用甜言蜜语、恳求或奉承来哄劝他人的人（常带有想达到目的的意味）"},"examples":[{"en":"Sales cajolers can make a bad deal sound tempting.","zh":"善于哄劝的推销员能把一笔糟糕的交易说得很诱人。"},{"en":"The cajolers kept praising him until he finally agreed.","zh":"那些哄劝者不停夸他，直到他终于同意。"}]}],"synonyms":["coaxers","sweet-talkers","flatterers","persuaders"],"phonetic":"/kəˈdʒoʊlərz/","extraExplanation":["“cajoler”来自动词“cajole”（哄骗、劝诱）。它通常暗示对方用温柔或奉承的方式“软磨硬泡”，有时带一点操控或不真诚的感觉；比“persuader（说服者）”更偏“哄”。"]}
{"word":"cajolery","summary":{"en":"Cajolery means persuasion through flattering or sweet talk, often to get something.","zh":"Cajolery 指用奉承或甜言蜜语来哄劝他人，常带有达到目的的意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of persuading someone by using sweet talk, flattery, or gentle pressure (often to get what you want).","zh":"用甜言蜜语、奉承或温和施压来劝诱他人的行为（常带有为了达到目的的意味）。"},"examples":[{"en":"Her promise sounded like cajolery rather than a real plan.","zh":"她的承诺听起来更像是在哄劝，而不是一个真正的计划。"},{"en":"He used laughter and compliments—pure cajolery—to convince them to stay.","zh":"他用笑声和夸奖——十足的哄劝——说服他们留下来。"}]}],"synonyms":["flattery","sweet talk","wheedling","coaxing","blandishment"],"phonetic":"/kəˈdʒoʊləri/","extraExplanation":["“cajolery”来自动词“cajole”（哄骗、劝诱）。它常暗示说话者不够坦率，带一点“用好听话达到目的”的感觉，但不一定是严重的欺骗。","使用场景上，它比“persuasion”（说服）更偏向“哄、软磨硬泡、花言巧语”；在正式写作里常用于批评某人的沟通方式。"]}
{"word":"cajoles","summary":{"en":"“Cajoles” means persuades someone by flattery or gentle, persistent urging.","zh":"“cajoles”表示用哄劝、奉承或温和但反复的方式来说服别人。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to persuade someone to do something by using gentle pressure, flattery, or repeated friendly requests (often suggesting you are trying to get your way)","zh":"用哄劝、奉承或反复温和请求来说服某人做某事（常带有“想让对方按自己意思来”的含义）"},"examples":[{"en":"She cajoles her little brother into doing his homework by promising a game afterward.","zh":"她答应作业后陪弟弟玩游戏，哄着他把作业做完。"},{"en":"The salesperson cajoles customers with compliments to close the deal.","zh":"销售人员用恭维话哄劝顾客，好促成交易。"},{"en":"He cajoles his friends to join him, even when they’re not interested.","zh":"即使朋友不太感兴趣，他也一直温言软语地劝他们加入。"}]}],"synonyms":["coax","wheedle","sweet-talk","persuade","talk into"],"phonetic":"/kəˈdʒoʊlz/","extraExplanation":["“cajole”通常带一点负面语气：不是直接、坦率地说服，而是用好听的话、撒娇式的劝说，甚至有点“哄、骗着让你答应”的感觉。语气强弱取决于语境。","词源上与法语有关，进入英语后常用于描述在社交或商业场景中用甜言蜜语争取对方同意。与“encourage/urge”相比，更强调“软磨硬泡 + 奉承”。"]}
{"word":"cajoling","summary":{"en":"Cajoling means coaxing or sweet-talking someone into doing something, often with friendly pressure or flattery.","zh":"Cajoling 指用哄劝、甜言蜜语（常带奉承或软磨硬泡）来让别人做某事。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Trying to persuade someone to do something by using gentle, friendly pressure, flattery, or repeated requests (often a little manipulative).","zh":"用温和的劝说、奉承或反复请求来哄劝某人做某事（常带一点操控意味）。"},"examples":[{"en":"She spent the whole evening cajoling her brother into helping her with the move.","zh":"她整个晚上都在哄劝哥哥帮她搬家。"},{"en":"The salesman kept cajoling us with compliments and special “limited-time” offers.","zh":"推销员不停用夸奖和“限时优惠”来哄劝我们下单。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of persuading someone through coaxing or flattery; persuasive talk meant to get a favor.","zh":"哄劝；用哄骗式劝说或奉承来达到目的的话术/行为。"},"examples":[{"en":"After a little cajoling, he finally agreed to join the team.","zh":"经过一番哄劝后，他终于同意加入团队。"},{"en":"Her cajoling didn’t work this time—he refused to change his mind.","zh":"这次她的哄劝没奏效——他拒绝改变主意。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “cajole”: persuading someone by coaxing or flattering.","zh":"“cajole”的现在分词：通过哄劝或奉承来劝人。"},"examples":[{"en":"He is cajoling his friends to come to the party.","zh":"他正在哄劝朋友们来参加派对。"},{"en":"They were cajoling the child into taking the medicine.","zh":"他们在哄劝孩子把药吃下去。"}]}],"synonyms":["coaxing","sweet-talking","wheedling","persuading","entreating"],"phonetic":"/kəˈdʒoʊ.lɪŋ/","extraExplanation":["“cajole”语气通常比“persuade”更像“软磨硬泡/哄着来”，可能带点不太光明正大的意味；但在日常语境里也常用于比较轻松、无恶意的“哄劝”。","常见搭配：cajole someone into (doing) something（哄劝某人去做……）；cajole someone out of something（哄着让某人交出/放弃某物）。"]}
{"word":"cajolingly","summary":{"en":"“Cajolingly” means speaking or acting in a coaxing, sweetly persuasive way to get someone to do something.","zh":"“cajolingly”表示用哄劝、甜言蜜语般的方式去说服别人做某事。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a coaxing, gently persuasive way, often using flattery or sweet talk to get someone to do something.","zh":"以哄劝、软磨硬泡（常带点奉承甜言蜜语）的方式，让别人做某事。"},"examples":[{"en":"He spoke cajolingly, hoping she would change her mind.","zh":"他用哄劝的语气说话，希望她会改变主意。"},{"en":"“Just one more try,” she said cajolingly.","zh":"“再试一次嘛，”她用撒娇般的哄劝口吻说。"}]}],"synonyms":["coaxingly","persuasively","ingratiatingly","sweetly","wheedlingly"],"phonetic":"/kəˈdʒoʊlɪŋli/","extraExplanation":["“cajolingly”来自动词“cajole”（哄骗/劝诱/软硬兼施地说服），加上副词后缀 -ly，表示“以……的方式”。语气通常比“persuasively（有说服力地）”更“软”，常带一点讨好、撒娇或甜言蜜语，有时也暗示对方在“套路”你。"]}
{"word":"cajon","summary":{"en":"Cajón most commonly means a box-shaped drum you sit on and play with your hands.","zh":"cajón 最常见的意思是“卡洪鼓/箱鼓”，一种坐在上面用手敲击演奏的箱形鼓。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A wooden box drum that you sit on and play by tapping the front surface with your hands (sometimes with brushes).","zh":"卡洪鼓／箱鼓：一种木制箱形打击乐器，演奏者坐在鼓上，用手（有时用刷子）敲击前面板发声。"},"examples":[{"en":"He played the cajón at the acoustic concert instead of a full drum set.","zh":"在那场不插电音乐会上，他用卡洪鼓代替了整套架子鼓。"},{"en":"The cajón adds a warm, punchy beat to flamenco and pop music.","zh":"卡洪鼓能为弗拉明戈和流行音乐带来温暖、有力度的节奏。"}]},{"partOfSpeech":"n.","definition":{"en":"A drawer; a small box or compartment, especially in Latin American Spanish contexts.","zh":"（西语语境中）抽屉；小箱子或隔层。"},"examples":[{"en":"In Spanish, “cajón” can mean a drawer in a desk.","zh":"在西班牙语里，“cajón”也可以指桌子的抽屉。"}]}],"synonyms":["box drum","Peruvian box drum"],"phonetic":"/kɑˈhoʊn/","extraExplanation":["“cajón”源自西班牙语，字面意思是“盒子/箱子/抽屉”。作为乐器时，常与秘鲁音乐联系在一起，也广泛用于弗拉明戈等风格。英语里通常写作 cajón（带重音符号）或 cajon（不带重音）。重音一般在第二个音节：ca-JÓN。"]}
{"word":"cajones","summary":{"en":"Cajones usually refers to multiple cajón (cajon) box drums; in Spanish it can also mean drawers/boxes.","zh":"cajones 通常指多个 cajón（木箱鼓）；在西班牙语里也可表示抽屉/箱子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of cajón/cajon: wooden box drums that you sit on and play by slapping the front face with your hands.","zh":"cajón/cajon 的复数：一种木箱鼓，演奏者坐在鼓上，用手拍击正面发声。"},"examples":[{"en":"The band added cajones to give the song a warmer, acoustic rhythm.","zh":"乐队加入了 cajones，让歌曲的节奏更温暖、更偏原声。"},{"en":"In the workshop, we tried different cajones to compare bass and snare sounds.","zh":"在工作坊里，我们试了不同的 cajones 来比较低音和“军鼓”般的声音。"}]},{"partOfSpeech":"n.","definition":{"en":"In Spanish, cajones can mean “drawers” or “boxes” (often used in everyday contexts).","zh":"在西班牙语里，cajones 还可以指“抽屉”或“箱子”（日常用法）。"},"examples":[{"en":"The Spanish label said “cajones,” meaning the storage drawers inside the cabinet.","zh":"西语标签写着“cajones”，指的是柜子里的收纳抽屉。"},{"en":"He keeps old letters in the bottom cajones.","zh":"他把旧信件放在最下面的抽屉（cajones）里。"}]}],"synonyms":["cajons","box drums"],"phonetic":"/kɑːˈhoʊneɪz/","extraExplanation":["“cajón”（常写作 cajon）原意是“木箱/箱子”。这种打击乐器与秘鲁的非裔与克里奥尔（Afro-Peruvian / Creole）音乐传统关系密切，后来也常见于弗拉明戈（flamenco）与原声流行/民谣编制中。","英语里更常用单数形式 cajon；复数有时写 cajons，也有人保留西语复数 cajones（尤其在音乐/器材语境中）。"]}
{"word":"cajou","summary":{"en":"“Cajou” means a cashew nut (and sometimes the cashew tree), but “cashew” is the more common English word.","zh":"“cajou”指“腰果”（有时也指“腰果树”），但英语中更常用的说法是“cashew”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cashew nut; sometimes also the cashew tree (especially in Caribbean or older usage)","zh":"腰果；有时也指腰果树（尤见于加勒比地区或较旧用法）"},"examples":[{"en":"These cookies are topped with roasted cajou.","zh":"这些饼干上撒了烤腰果。"},{"en":"In some markets, cajou is sold fresh before it’s fully dried.","zh":"在一些市场里，cajou 会在完全干燥前以较新鲜的状态出售。"},{"en":"The cajou tree grows well in warm, tropical climates.","zh":"腰果树在温暖的热带气候里长得很好。"}]}],"synonyms":["cashew","cashew nut"],"phonetic":"/kəˈʒuː/","extraExplanation":["“cajou”在英语里属于比较少见/带地域色彩的用词，更常见的标准说法是“cashew”。在法语中“cajou”非常常用，所以你可能会在法语影响较大的地区、菜单或进口食品标签上看到它。","词源上与葡萄牙语/法语对同一植物名称的借词有关，因此拼写看起来不像典型英语单词。"]}
{"word":"cajuela","summary":{"en":"Cajuela means the trunk of a car (rear storage space), used especially in Mexican/US Spanish.","zh":"cajuela 指汽車後車廂（車尾置物空間），多見於墨西哥／美國西語用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(US Spanish, especially Mexican Spanish) the trunk of a car; the rear storage space of a vehicle.","zh":"（美國西語，尤指墨西哥用法）汽車後車廂；車尾的置物空間。"},"examples":[{"en":"Put the groceries in the cajuela, please.","zh":"請把雜貨放到後車廂。"},{"en":"My suitcase is in the cajuela.","zh":"我的行李箱在後車廂裡。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) a small compartment or box-like storage space.","zh":"（較少見）小隔層；盒狀的收納空間。"},"examples":[{"en":"Keep the tools in the cajuela so they don’t roll around.","zh":"把工具放在那個收納隔層裡，免得滾來滾去。"}]}],"synonyms":["trunk (car)","maletero (Spanish)","baúl (Spanish, some regions)"],"phonetic":"/kɑˈwɛlɑ/","extraExplanation":["「cajuela」主要是墨西哥西班牙語與美國西語社群常用詞；在很多其他西語地區，更常說「maletero」（後車廂）。","在英文對話中出現時，通常是雙語社群的語碼轉換（code-switching）：句子大多是英文，但用「cajuela」取代「trunk」。"]}
{"word":"Cajun","summary":{"en":"Cajun refers to a Louisiana French-descended cultural group and also describes their culture, especially food and music.","zh":"Cajun 指路易斯安那的法裔卡津族群，也可形容其文化（尤其是饮食与音乐）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from a French-speaking cultural group in Louisiana, descended largely from Acadians who were expelled from Canada in the 1700s","zh":"卡津人；路易斯安那州的法语文化族群之一，多为18世纪从加拿大被驱逐的阿卡迪亚人（Acadians）的后裔"},"examples":[{"en":"Many Cajuns in Louisiana grew up hearing French at home.","zh":"路易斯安那州的许多卡津人从小在家里就听法语。"},{"en":"Cajun culture is known for its music, food, and community festivals.","zh":"卡津文化以音乐、美食和社区节庆闻名。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Cajun people or their culture, especially food, music, or dialect","zh":"卡津的；与卡津人及其文化有关的（尤指饮食、音乐或方言）"},"examples":[{"en":"We ordered Cajun seafood and spicy rice.","zh":"我们点了卡津风味海鲜和辣味米饭。"},{"en":"He plays Cajun music on the accordion.","zh":"他用手风琴演奏卡津音乐。"}]}],"synonyms":["Louisiana French","Creole (related but not the same)"],"phonetic":"/ˈkeɪdʒən/","extraExplanation":["“Cajun”一词来自“Acadian（阿卡迪亚人）”的口语变化。18世纪中期，许多阿卡迪亚人被英国驱逐后迁到路易斯安那，逐渐形成独特的卡津身份、法语变体（Cajun French）与饮食传统。","在美国饮食语境里，“Cajun”常指一种偏辛辣、重香料的路易斯安那风味；但也要注意它首先是族群与文化称呼，用作形容词描述食物时通常是中性正当的。"]}
{"word":"cajun","summary":{"en":"Cajun refers to the people, culture, food, and music of a French-influenced community in southern Louisiana; it can also mean a person from that community.","zh":"Cajun 指路易斯安那州南部受法语影响的卡津社群及其文化、饮食与音乐；也可指卡津人本身。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the French-speaking descendants of early settlers (Acadians) and other groups in southern Louisiana, especially their culture, food, and music","zh":"（与）卡津人有关的；指路易斯安那州南部法语裔（源自阿卡迪亚人等）群体的文化、饮食与音乐等"},"examples":[{"en":"We had Cajun food like gumbo and jambalaya for dinner.","zh":"我们晚餐吃了卡津菜，比如秋葵浓汤（gumbo）和什锦饭（jambalaya）。"},{"en":"Cajun music often features fiddles and accordions.","zh":"卡津音乐常用小提琴和手风琴。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from the Cajun community in southern Louisiana","zh":"卡津人（路易斯安那州南部卡津社群的一员）"},"examples":[{"en":"She’s a Cajun from Lafayette, Louisiana.","zh":"她是来自路易斯安那州拉斐特的卡津人。"},{"en":"Many Cajuns speak or grew up hearing French at home.","zh":"许多卡津人会说法语，或从小在家里就听法语。"}]}],"synonyms":["Louisiana French","Acadian (historical/related)"],"phonetic":"/ˈkeɪdʒən/","extraExplanation":["“Cajun”常被用来指一种口味：例如“Cajun seasoning（卡津香料/调味料）”，通常偏咸香、带辣味，常见香料有辣椒粉（paprika）、卡宴辣椒（cayenne）、大蒜粉、洋葱粉、黑胡椒、百里香、牛至等。","文化上常会把“Cajun”和“Creole（克里奥尔）”一起提到：两者都与路易斯安那有关，但历史来源与文化背景不完全相同；日常用法里，“Cajun”更常联想到乡村/民间传统、家常料理与民谣风格。"]}
{"word":"cajuns","summary":{"en":"Cajuns are a French-speaking community in southern Louisiana (descended mainly from Acadians), and “Cajun” also means related to their culture, food, music, or dialect.","zh":"Cajuns指路易斯安那州南部的法语系族群（主要为阿卡迪亚后裔），“Cajun”也可作形容词表示与其文化、饮食、音乐或方言相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of a French-speaking community in southern Louisiana, descended mainly from Acadians (French settlers) who were forced to leave Canada in the 1700s","zh":"卡津人（美国路易斯安那州南部的法语系族群，主要为18世纪从加拿大被迫迁离的阿卡迪亚人后裔）"},"examples":[{"en":"Many Cajuns live in southern Louisiana, especially around Lafayette and the bayous.","zh":"许多卡津人居住在路易斯安那州南部，尤其在拉法叶一带和沼泽水乡（bayous）附近。"},{"en":"Cajuns are known for their strong community traditions and storytelling.","zh":"卡津人以浓厚的社区传统和讲故事文化而闻名。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Cajun people, culture, food, music, or dialect","zh":"卡津的；与卡津人、文化、饮食、音乐或方言有关的"},"examples":[{"en":"We ordered Cajun seafood with spicy seasoning.","zh":"我们点了带辣味香料的卡津海鲜。"},{"en":"He plays Cajun music on the accordion.","zh":"他用手风琴演奏卡津音乐。"}]}],"synonyms":["Louisiana French (people/dialect)","Acadian (historical/related)"],"phonetic":"/ˈkeɪdʒən/","extraExplanation":["“Cajuns”是“Cajun”的复数。日常英语里常用“Cajun”作形容词（如Cajun food / Cajun seasoning），在菜单上往往指带有路易斯安那风格、常偏辛香的调味。","卡津文化与“Creole（克里奥尔）”常被一起提到，但两者不完全相同：Cajun更常指阿卡迪亚后裔的乡村传统；Creole在路易斯安那语境中可能指不同来源（法、西、非洲、加勒比等）融合的城市与多元文化。具体用法会因地区与个人认同而不同，表达时尊重当事人的自称更合适。"]}
{"word":"cajuput","summary":{"en":"Cajuput is a tropical tree, and it can also mean the strong-smelling essential oil made from its leaves.","zh":"cajuput 指一种热带树（白千层/卡尤普特树），也可指由其叶子蒸馏出的气味浓烈的精油。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical tree (Melaleuca cajuputi) from Southeast Asia and northern Australia, known for its aromatic leaves and bark.","zh":"一种热带树（白千层/卡尤普特树，学名 Melaleuca cajuputi），原产东南亚和澳大利亚北部，以其芳香的叶子和树皮而闻名。"},"examples":[{"en":"Cajuput trees often grow in swampy, coastal areas.","zh":"卡尤普特树常生长在湿地或沿海沼泽地区。"},{"en":"The bark of the cajuput tree can look pale and papery.","zh":"卡尤普特树的树皮看起来常常偏浅色、像纸一样薄。"}]},{"partOfSpeech":"n.","definition":{"en":"(also cajuput oil) an essential oil distilled from cajuput leaves, traditionally used for its strong, fresh scent and in some folk remedies.","zh":"（也作 cajuput oil）由卡尤普特树叶蒸馏得到的精油，以浓烈清新的气味著称，也常见于传统民间用法。"},"examples":[{"en":"Some balms include cajuput oil for a cooling smell.","zh":"有些膏霜会加入卡尤普特精油，带来清凉的气味。"},{"en":"The label says the soap is scented with cajuput.","zh":"标签上写着这款香皂用卡尤普特（精油）增香。"},{"en":"In parts of Southeast Asia, cajuput oil is a familiar household scent.","zh":"在东南亚一些地区，卡尤普特精油的味道是很常见的“居家气味”。"}]}],"synonyms":["cajeput","cajuput oil"],"phonetic":"/ˈkædʒəˌpʊt/","extraExplanation":["“cajuput”也常拼作“cajeput”。它来自马来语“kayu putih”，意思是“白色的木头/白木”，指这种树浅色的树皮。","在英语语境里，“cajuput oil”多用于描述一种带樟脑样清新气味的精油。它常被用于香膏、肥皂、驱虫或芳香用途；若涉及健康用途，建议以产品说明和专业意见为准。"]}
{"word":"cajuputene","summary":{"en":"Cajuputene is a rare technical noun meaning a terpene found in cajuput oil.","zh":"cajuputene 是较少见的专业名词，指白千层油中的一种萜烯成分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a terpene (a type of aromatic hydrocarbon) found in cajuput oil, used mainly as a technical term in chemistry and pharmacology","zh":"（化学术语）白千层油（cajuput oil）中的一种萜烯类芳香烃成分"},"examples":[{"en":"Researchers analyzed cajuput oil and identified cajuputene among its volatile compounds.","zh":"研究人员分析了白千层油，并在其挥发性成分中鉴定出白千层烯（cajuputene）。"},{"en":"In the lab report, cajuputene was grouped with other terpenes responsible for the oil’s scent.","zh":"在实验报告中，白千层烯与其他造成该精油气味的萜烯一起被归类。"}]}],"synonyms":["terpene","aromatic hydrocarbon"],"phonetic":"/kəˈdʒuːpjuːtiːn/","extraExplanation":["这是一个比较少见、偏专业的词，通常出现在精油成分分析、天然产物化学或药学文献中；日常英语里几乎不会用。","拼写上容易和 cajuput（白千层；白千层油）混淆。cajuput 这个词源自马来语 kayu putih，意思是“白色的木头”，指白千层树（Melaleuca）。","词尾 -ene 常见于有机化学命名，表示“烯/烯烃或相关不饱和烃类”（如 limonene 柠檬烯、pinene 蒎烯）；cajuputene 也遵循这种构词习惯。"]}
{"word":"cajuputol","summary":{"en":"Cajuput oil is a strong-smelling essential oil from the cajuput (tea tree) used mainly in traditional remedies and topical products.","zh":"白千层精油是一种气味浓烈的植物精油，来自白千层（茶树类）植物，常用于传统疗法与外用产品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an essential oil made from the leaves and twigs of the cajuput tree (a type of tea tree), used especially in traditional medicine and in liniments for a cooling, medicinal smell","zh":"白千层精油（又称加尤普特油），从白千层树叶与嫩枝蒸馏而成，常用于传统疗法或外用擦剂，带有清凉的药草气味"},"examples":[{"en":"The balm contains cajuput oil to give a cooling sensation on sore muscles.","zh":"这款膏含有白千层精油，用在酸痛的肌肉上会有清凉感。"},{"en":"In some parts of Southeast Asia, cajuput oil is used as a traditional remedy for congestion.","zh":"在东南亚一些地区，人们会把白千层精油当作缓解鼻塞的传统方法之一。"}]}],"synonyms":["cajeput oil","white tea tree oil","Melaleuca cajuputi oil"],"phonetic":"/ˈkɑːdʒəˌpʊt ɔɪl/","extraExplanation":["“cajuput oil”常见的拼写是两个词：cajuput oil。你输入的“cajuputol”多半是把它连写在一起了。","词源上，“cajuput/cajeput”来自马来语，意思接近“白色的树”；因此中文常译为“白千层”。","用途多为外用（如擦拭、按摩、闻香），不同品牌浓度差异很大；精油可能刺激皮肤或黏膜，使用前通常需要稀释并避免接触眼口。"]}
{"word":"cajuputs","summary":{"en":"Cajuputs are tropical trees (and the essential oil made from their leaves).","zh":"cajuputs 指热带的白千层树（也可指由其叶子提取的精油）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical tree (Melaleuca cajuputi), related to the tea tree, native to Southeast Asia and northern Australia","zh":"白千层树（又称白茶树的一种相关树种），一种热带树木，原产东南亚与澳大利亚北部"},"examples":[{"en":"Cajuputs grow well in hot, wet coastal areas.","zh":"白千层树在炎热潮湿的沿海地区生长良好。"},{"en":"The swampy forest was full of cajuputs and other melaleuca trees.","zh":"那片沼泽森林里长满了白千层树和其他白千层属植物。"}]},{"partOfSpeech":"n.","definition":{"en":"(also cajuput oil) a strong-smelling essential oil made from the leaves of the cajuput tree, sometimes used in traditional remedies and in aromatherapy","zh":"（也作白千层油／加久普油）一种从白千层树叶提取、气味浓烈的精油，有时用于传统疗法或芳香疗法"},"examples":[{"en":"Some people use cajuput oil in balms for colds, but you should follow safety advice.","zh":"有些人会在感冒用的膏剂里加入白千层油，但应遵循安全使用建议。"},{"en":"The ointment had a sharp, cooling scent like cajuput.","zh":"这药膏带着像白千层油那样辛凉、刺鼻的气味。"}]}],"synonyms":["cajuput","cajuput tree","cajuput oil","melaleuca (general term)"],"phonetic":"/ˈkædʒəˌpʊt/","extraExplanation":["“cajuput”一词来自马来语 *kayu putih*，意思是“白色的木头”（*kayu*＝木头，*putih*＝白色），指这种树常见的浅色树皮。","在日常英语里更常见的拼写是单数 **cajuput**，复数 **cajuputs**；在产品标签上也常写 **cajuput oil**。"]}
