{"word":"Cakavci","summary":{"en":"Cakavci (more commonly written Čakavci) are people associated with the Čakavian dialect of Croatian.","zh":"Cakavci（更常写作 Čakavci）指与克罗地亚语“恰卡维方言”（Čakavian）相关的人/使用者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who speak (or are associated with) the Čakavian dialect of Croatian; Chakavians","zh":"使用（或与之相关的）克罗地亚语“恰卡维方言”（Čakavian）的人；恰卡维方言使用者"},"examples":[{"en":"In some studies of Croatian dialects, the Čakavci are contrasted with the Kajkavci and Štokavci.","zh":"在一些关于克罗地亚方言的研究中，Čakavci 常与 Kajkavci 和 Štokavci 作对比。"},{"en":"My grandparents come from an island area where many locals are Čakavci.","zh":"我的祖父母来自一个岛屿地区，当地很多人都是 Čakavci。"}]}],"synonyms":["Čakavci","Chakavci","Chakavians"],"phonetic":"/tʃɑˈkɑvtsi/","extraExplanation":["“Čakavci”是克罗地亚语里的复数形式（单数常见为“Čakavac”），指使用“Čakavian/恰卡维方言”的人。英语文本里有时也会写作“Chakavci/Chakavians”。","“Čakavian、Kajkavian、Štokavian”三大方言名称都来自它们表示“什么”的常用疑问词：ča（Čakavian）、kaj（Kajkavian）、što/šta（Štokavian）。这也是它们在语言学介绍中常被并列提及的原因。"]}
{"word":"cakavci","summary":{"en":"“cakavci” is not an English word; it’s likely a non-English proper name (e.g., a surname).","zh":"“cakavci”不是英语单词；更可能是非英语的专有名词（例如姓氏）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It looks like a proper name (often a surname) from another language, so it doesn’t have an established English dictionary meaning.","zh":"不是标准英语单词。它更像是来自其他语言的专有名词（常见为姓氏），因此在英语词典里通常没有固定释义。"},"examples":[{"en":"I couldn’t find “cakavci” in an English dictionary—what language is it from?","zh":"我在英语词典里找不到“cakavci”——它来自哪种语言？"},{"en":"“Cakavci” appears to be a family name rather than an English vocabulary word.","zh":"“Cakavci”看起来更像是姓氏，而不是英语词汇。"}]}],"phonetic":"/ˈkɑːkɑːvˌtʃi/","extraExplanation":["“cakavci”很可能是土耳其语等语言中的姓名拼写（例如土耳其语里可能出现带变音符号的形式）。如果你能提供：1）它出现在哪句话/哪段文字里；2）是否是人名/地名；3）原始拼写（是否有特殊字符），我可以帮你判断更准确的读音、可能的来源与含义。"]}
{"word":"Cakchikel","summary":{"en":"Cakchikel (more commonly spelled Kaqchikel) refers to a Mayan Indigenous people in Guatemala and also their language; it can also be used as an adjective for related culture.","zh":"Cakchikel（更常见拼写为 Kaqchikel）指危地马拉的玛雅原住民族卡克其克尔人及其语言；也可作形容词表示“与其文化/语言相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Mayan Indigenous people mainly from the central highlands of Guatemala, and also the language they speak","zh":"（主要居住在危地马拉中部高地的）玛雅原住民族卡克其克尔人；也指他们所说的语言（卡克其克尔语）"},"examples":[{"en":"Many Kaqchikel (Cakchikel) communities live around Lake Atitlán in Guatemala.","zh":"危地马拉阿蒂特兰湖周边有许多卡克其克尔（Cakchikel/Kaqchikel）社区。"},{"en":"She is learning Cakchikel to speak with her grandparents.","zh":"她正在学习卡克其克尔语，好和祖父母交流。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Kaqchikel (Cakchikel) people or their language and culture","zh":"与卡克其克尔人或其语言、文化有关的"},"examples":[{"en":"We studied Cakchikel traditions and history in class.","zh":"我们在课上学习了卡克其克尔的传统与历史。"},{"en":"The museum has a Cakchikel textile exhibit.","zh":"博物馆有一个卡克其克尔纺织品展览。"}]}],"synonyms":["Kaqchikel","Cachiquel","Cakchiquel"],"phonetic":"/kɑːtʃiˈkɛl/","extraExplanation":["更常见的拼写是 **Kaqchikel**（也写作 Cachiquel / Cakchiquel 等），**Cakchikel** 属于较旧或变体拼写；不同写法多与转写系统和历史拼写习惯有关。","Kaqchikel 是玛雅语系的一种语言，在危地马拉仍有大量使用者；在英语语境中，这个词既可指“族群”也可指“语言”，具体看上下文。"]}
{"word":"cakchikel","summary":{"en":"Cakchikel: a Mayan people in Guatemala and the language they speak (often spelled Kaqchikel).","zh":"Cakchikel：危地马拉的玛雅族群之一及其语言（常见拼写为 Kaqchikel）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Mayan people from the Guatemalan highlands, and the language they speak (often spelled Kaqchikel).","zh":"危地马拉高地的玛雅族群之一（卡克其奎尔人/卡克奇克尔人），也指他们所说的语言（常见拼写为 Kaqchikel）。"},"examples":[{"en":"She is learning Cakchikel to speak with her grandparents in Guatemala.","zh":"她在学卡克奇克尔语，好在危地马拉和祖父母交流。"},{"en":"The museum has recordings of stories told in Cakchikel.","zh":"博物馆收藏了用卡克奇克尔语讲述故事的录音。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Cakchikel people or their language.","zh":"与卡克奇克尔人或卡克奇克尔语有关的。"},"examples":[{"en":"They visited a Cakchikel community near Lake Atitlán.","zh":"他们拜访了阿蒂特兰湖附近的一个卡克奇克尔社区。"},{"en":"The class includes Cakchikel cultural traditions and history.","zh":"这门课包含卡克奇克尔的文化传统与历史。"}]}],"synonyms":["Kaqchikel","Cakchiquel"],"phonetic":"/ˈkɑːtʃɪkɛl/","extraExplanation":["更常见的学术与当代拼写是 **Kaqchikel**（也见 **Cakchiquel**）。不同拼写多与西班牙语转写传统、以及玛雅语言现代正字法标准化有关。","Kaqchikel/“Cakchikel” 属于玛雅语系，在危地马拉中部高地使用者较多；在语言与文化保护（双语教育、社区广播、文字化）方面有持续的复振努力。"]}
{"word":"Cakchiquel","summary":{"en":"Cakchiquel is a Mayan language (and also the name of its people) in Guatemala; “Kaqchikel” is a common modern spelling.","zh":"Cakchiquel指危地马拉的玛雅语系语言，也可指其族群；现代常见拼写为“Kaqchikel”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Mayan language spoken mainly by the Kaqchikel people in the highlands of Guatemala (also spelled “Kaqchikel”).","zh":"一种玛雅语系语言，主要由危地马拉高地的卡克其奎尔（Kaqchikel）族群使用（也常拼作“Kaqchikel”）。"},"examples":[{"en":"She is learning Cakchiquel to speak with her grandparents in Guatemala.","zh":"她正在学习Cakchiquel，这样就能和在危地马拉的祖父母交流。"},{"en":"The museum label is written in Spanish, English, and Cakchiquel.","zh":"博物馆标签用西班牙语、英语和Cakchiquel书写。"}]},{"partOfSpeech":"n.","definition":{"en":"the Kaqchikel people, an Indigenous Maya group in Guatemala.","zh":"卡克其奎尔（Kaqchikel）人：危地马拉的玛雅原住民族群之一。"},"examples":[{"en":"Cakchiquel communities have rich traditions of weaving and storytelling.","zh":"Cakchiquel社群拥有丰富的织布与讲故事传统。"}]}],"synonyms":["Kaqchikel"],"phonetic":"/kɑːkˈtʃiːkɛl/","extraExplanation":["“Cakchiquel”是较早的英文拼写；如今在学术与社群语境中更常见“Kaqchikel”，更接近该语言/族名在本地书写系统中的表示。","它属于玛雅语系，主要分布在危地马拉中部与西部高地；在语言复兴与双语教育项目中常被提及。"]}
{"word":"cake","summary":{"en":"Cake usually means a sweet baked dessert; it can also mean a flat food mass (like a rice cake) or describe something covered in a thick layer (caked in mud).","zh":"Cake通常指甜点“蛋糕”；也可指饼状食物（如米饼/年糕）；作动词可表示“结成厚层、糊满”（如被泥糊满）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sweet baked food made from flour, eggs, sugar, and butter or oil, often eaten as dessert (e.g., birthday cake).","zh":"蛋糕；一种甜味烘焙食品，常由面粉、鸡蛋、糖和黄油或油制成，常作为甜点食用（如生日蛋糕）。"},"examples":[{"en":"She baked a chocolate cake for his birthday.","zh":"她为他的生日烤了一个巧克力蛋糕。"},{"en":"Would you like a slice of cake with your tea?","zh":"你想配茶吃一块蛋糕吗？"}]},{"partOfSpeech":"n.","definition":{"en":"A small, flat, round-shaped food mass (often with a firm surface), such as a fish cake or rice cake.","zh":"饼状食物；小而扁圆的一块食物（表面常较结实），如鱼饼、年糕/米饼。"},"examples":[{"en":"They served fish cakes as an appetizer.","zh":"他们把鱼饼作为开胃菜端上来。"},{"en":"Rice cakes are a light snack.","zh":"米饼是一种清淡的零食。"}]},{"partOfSpeech":"v.","definition":{"en":"To form or cover something with a thick layer, often of powder or dried material (commonly: be caked in/with).","zh":"结成厚层；（常指粉末或干燥物）结块并附着/覆盖（常用：be caked in/with）。"},"examples":[{"en":"His boots were caked in mud after the hike.","zh":"徒步后他的靴子上糊满了泥。"},{"en":"The makeup caked on her skin in the heat.","zh":"天热时她脸上的妆变得厚重结块。"}]}],"synonyms":["pastry","dessert","torte","sponge cake"],"phonetic":"/keɪk/","extraExplanation":["“cake”作为名词在英语文化里很常见，尤其与庆祝活动相关（如生日、婚礼）。因此它不仅指食物，也常带有“庆祝、分享、仪式感”的文化联想。","常见搭配：birthday cake（生日蛋糕）、wedding cake（婚礼蛋糕）、a slice/piece of cake（一片/一块蛋糕）。注意习语“a piece of cake”表示“很容易的事”。","动词用法里，最常见结构是“be caked in/with + 物质”（被……糊满/结满），多用于泥、雪、灰尘或厚重的化妆品等。"]}
{"word":"cake factory","summary":{"en":"a plant where cakes are produced in large quantities","zh":"批量生产蛋糕的工厂"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place where cakes are made in large quantities, usually for sale","zh":"制作蛋糕的工厂（通常批量生产并用于销售）"},"examples":[{"en":"She works at a cake factory that supplies desserts to supermarkets.","zh":"她在一家蛋糕工厂工作，给超市供应甜点。"},{"en":"The smell outside the cake factory is sweet in the morning.","zh":"早上蛋糕工厂外面闻起来甜甜的。"}]}],"synonyms":["bakery","cake bakery","commercial bakery","confectionery","bakehouse"],"phonetic":"/keɪk ˈfæktəri/","extraExplanation":["在日常英语里，人们更常说 bakery（面包/糕点店）或 cake bakery（蛋糕店）。cake factory 通常强调“工厂式、流水线、大批量生产”，而不是街边零售店。","在商业语境中也可能指企业的生产车间/厂房；在旅游或参观活动中，可能会有 “factory tour（工厂参观）”。"],"etymology":"短语由 cake（蛋糕）+ factory（工厂）构成。factory 来自拉丁语 facere（“做、制造”），后来在英语中指“集中生产的场所”。","mnemonic":["把它拆开记：cake（蛋糕）+ factory（工厂）= “生产蛋糕的地方”。","factory 联想“F-ACTORY = 做事的地方（act）”，就是制造/生产的地方。"]}
{"word":"cake wax","summary":{"en":"a block/puck of wax used for rubbing or coating","zh":"用于擦涂的一块（饼状）蜡"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a solid block or puck of wax (often round like a small cake), used for things like polishing, sealing, or waxing skis/surfboards","zh":"蜡块；（常做成小圆饼状的）块状蜡，用于抛光、封蜡或给滑雪板/冲浪板打蜡等"},"examples":[{"en":"He rubbed a cake wax on the leather to make it shine.","zh":"他用一块蜡在皮革上来回摩擦，让它更有光泽。"},{"en":"Bring a cake wax if you want to re-wax your board at the beach.","zh":"如果你想在海边给板子补蜡，就带上一块蜡块。"}]},{"partOfSpeech":"phrase","definition":{"en":"a thick, hardened layer of wax stuck on a surface (less common; often expressed as “caked wax”)","zh":"结成厚层的蜡；凝结并附着在表面的蜡层（较少用；更常说“caked wax”）"},"examples":[{"en":"The candle holder had cake wax around the base after years of use.","zh":"这个烛台用了很多年，底座周围积了一圈凝结的蜡。"}]}],"synonyms":["wax block","wax cake","wax puck","bar of wax"],"phonetic":"/keɪk wæks/","extraExplanation":["在冲浪/滑雪/护理用品等语境中，cake wax 通常指“成块出售的蜡”，强调外形像小饼或圆块，方便拿取、摩擦使用。","如果你想表达“蜡结成厚厚一层”，英语更自然的说法是“caked wax”（形容词 caked = 结成块/结成厚层）。"],"etymology":"由“cake（饼状物/块状物）+ wax（蜡）”直译组合而来；这里的 cake 指“做成一块/一饼的形状”，不是“蛋糕”。在一些行业里也会写作“wax cake”。","mnemonic":["把 cake 理解为“饼状/块状”（像“蜡饼”），不是甜点蛋糕：cake wax ≈ “一块蜡”。","联想“打蜡要拿一块蜡去擦”：cake（小块）+ wax（蜡）= 可手持摩擦的蜡块。"]}
{"word":"cake-like","summary":{"en":"“Cake-like” describes something that looks or feels like cake, especially soft and spongy.","zh":"“cake-like”形容某物像蛋糕，尤其指口感松软、海绵状。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the texture, softness, or appearance of cake (often slightly sweet, spongy, and airy).","zh":"像蛋糕的；具有蛋糕般的质地或外观（常带有松软、海绵状、略甜的感觉）。"},"examples":[{"en":"These muffins are a bit cake-like, so they feel more like dessert than breakfast.","zh":"这些松饼有点蛋糕感，所以更像甜点而不是早餐。"},{"en":"The pancakes turned out thick and cake-like because I added too much flour.","zh":"薄煎饼做得很厚、很像蛋糕，因为我面粉加太多了。"},{"en":"A cake-like crumb is usually soft and tender, not chewy.","zh":"蛋糕般的组织通常是松软细嫩的，而不是有嚼劲的。"}]}],"synonyms":["spongy","soft","tender","fluffy"],"phonetic":"/ˈkeɪkˌlaɪk/","extraExplanation":["“cake-like”是形容词，由名词cake + like构成，常用来描述食物的口感（texture）和内部组织（crumb）。在烘焙语境里，它通常表示“更松软、更像蛋糕”，有时也暗示“没那么有嚼劲/不那么像面包”。","写法上多用连字符：cake-like。也常见类似表达：bread-like（像面包的）、cookie-like（像饼干的）。"]}
{"word":"cakebox","summary":{"en":"A cake box is a box used to carry, store, or package a cake.","zh":"cake box 指用来装、带或包装蛋糕的盒子（常见写法为两词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A box (usually cardboard) used to carry, store, or give a cake, often to keep it fresh and protect its shape.","zh":"（通常为纸板做的）蛋糕盒，用来携带、保存或赠送蛋糕，常用于保鲜并保护蛋糕造型。"},"examples":[{"en":"Please put the cake in a cake box so it doesn’t get damaged on the way home.","zh":"请把蛋糕装进蛋糕盒里，这样回家路上就不容易压坏。"},{"en":"She opened the cake box and everyone could smell the chocolate frosting.","zh":"她打开蛋糕盒，大家都闻到了巧克力糖霜的香味。"},{"en":"We brought a cake box to the party as a gift.","zh":"我们带了一个装着蛋糕的蛋糕盒去聚会当礼物。"}]},{"partOfSpeech":"n.","definition":{"en":"A container or package for a cake sold by a bakery (sometimes used to refer to the boxed cake itself).","zh":"面包店售卖蛋糕所用的包装盒（有时也用来指“盒装蛋糕”本身）。"},"examples":[{"en":"There were three cake boxes on the counter, ready for delivery.","zh":"台面上有三个蛋糕盒，准备配送。"},{"en":"He showed up with a cake box from the bakery downtown.","zh":"他带着市中心那家面包店的一个蛋糕盒出现了。"}]}],"synonyms":["pastry box","bakery box","cake container"],"phonetic":"ˈkeɪk ˌbɑks","extraExplanation":["英语里更常见的写法是两词形式 “cake box”。写成一个词 “cakebox” 也能被理解，但多见于品牌名、用户名、商品名或非正式拼写。","“cake box” 是常见的名词复合结构：前面的 cake 用来说明 box 的用途（装蛋糕的盒子），类似的还有 “shoe box（鞋盒）”、“lunch box（午餐盒）”。"]}
{"word":"cakebread","summary":{"en":"Cakebread usually means a sweet, cake-like bread; it can also refer to the Napa Valley winery Cakebread Cellars.","zh":"Cakebread 通常指口感像蛋糕的甜面包；也可指纳帕谷的酒庄 Cakebread Cellars。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sweet, cake-like bread (a loaf with a soft texture and richer ingredients like sugar, eggs, or butter), often eaten as a snack or dessert","zh":"甜面包；蛋糕般的面包（口感更像蛋糕、配方更丰富，常含糖、鸡蛋、黄油等），常当作点心或甜点吃"},"examples":[{"en":"This cakebread is lightly sweet and perfect with tea.","zh":"这款甜面包微甜，配茶刚刚好。"},{"en":"She baked a banana cakebread for breakfast.","zh":"她烤了一条香蕉甜面包当早餐。"}]},{"partOfSpeech":"n.","definition":{"en":"(proper noun) Cakebread Cellars, a well-known winery in Napa Valley, California","zh":"（专有名词）Cakebread Cellars，加州纳帕谷一家知名酒庄"},"examples":[{"en":"They ordered a bottle from Cakebread Cellars.","zh":"他们点了一瓶 Cakebread Cellars 的酒。"}]}],"synonyms":["sweet bread","tea loaf","quick bread","banana bread (type)","Cakebread Cellars (winery)"],"phonetic":"/ˈkeɪkˌbrɛd/","extraExplanation":["“cakebread”并不是最标准、最常见的通用词；在食谱或烘焙语境里，人们更常写成两个词“cake bread”，或用更具体的名称（如“banana bread”“sweet bread”“tea loaf”）。","作为酒庄名称“Cakebread”，来自创办家族的姓氏；在餐厅酒单中常见，通常不需要直译。"]}
{"word":"caked","summary":{"en":"“Caked” means covered with a thick hardened layer (mud/dust/makeup), or formed into hard lumps; it’s also the past form of “cake.”","zh":"“caked”表示“糊满并结成硬层/结块的”，也可作动词“cake”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"covered with a thick, dry layer of something (like mud, dust, or makeup) that has hardened","zh":"（被泥、灰尘、化妆品等）厚厚地糊住并变干、结成硬层的"},"examples":[{"en":"His boots were caked with mud after the hike.","zh":"徒步之后，他的靴子上糊满了泥并结成硬块。"},{"en":"The windows were caked with dust from the construction.","zh":"窗户被施工扬起的灰尘糊住，积了一层厚厚的灰。"},{"en":"Her mascara was caked and flaking off.","zh":"她的睫毛膏结块了，还在掉屑。"}]},{"partOfSpeech":"adj.","definition":{"en":"packed or pressed together into a solid mass (a “cake”)","zh":"（粉末、盐等）被压实、结成块状（成“饼/块”）的"},"examples":[{"en":"The brown sugar was caked at the bottom of the bag.","zh":"红糖在袋子底部结成块了。"},{"en":"The detergent was caked into hard lumps.","zh":"洗衣粉结成了硬块。"}]},{"partOfSpeech":"v.","definition":{"en":"simple past tense and past participle of “cake” (to form a thick layer or hard lumps)","zh":"“cake”的过去式/过去分词：结成层；结块"},"examples":[{"en":"The paint caked on the brush because it was left out overnight.","zh":"刷子放了一夜，油漆在上面结成了硬块。"},{"en":"Sweat and dust caked on his face in the heat.","zh":"在高温下，汗水和灰尘在他脸上糊成了一层。"}]}],"synonyms":["encrusted","covered","coated","crusted","clumped","hardened"],"phonetic":"/keɪkt/","extraExplanation":["“caked”常和介词with连用：be caked with mud/dust/snow（被……糊满/覆满并变硬）。","在美妆语境里，“caked makeup / cakey”表示“妆感厚重、结块、不服帖”，比单纯的“厚”更偏负面。","“cake”作动词的核心画面是“从湿/散到干/结”：先黏在表面或聚在一起，后来变干变硬。"]}
{"word":"cakehouse","summary":{"en":"Cakehouse usually means a cake/dessert shop, but in older slang it can mean a brothel.","zh":"Cakehouse通常指蛋糕/甜品店，但在较旧的俚语中也可指“妓院”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a shop, café, or small business that mainly sells cakes and other desserts","zh":"以蛋糕和甜点为主的店铺/咖啡馆（常见写法也可作 two words：cake house）"},"examples":[{"en":"Let’s stop by the cakehouse and pick up a birthday cake.","zh":"我们去那家蛋糕店买个生日蛋糕吧。"},{"en":"That cakehouse is famous for its cheesecake.","zh":"那家甜点店的芝士蛋糕很有名。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang, dated) a brothel; a place where people pay for sex","zh":"（俚语，过时/不推荐使用）妓院；卖淫场所"},"examples":[{"en":"In some old novels, ‘cakehouse’ appears as slang for a brothel.","zh":"在一些旧小说里，“cakehouse”会作为“妓院”的俚语出现。"}]}],"synonyms":["cake shop","bakery","patisserie","dessert shop","dessert café"],"phonetic":"/ˈkeɪkˌhaʊs/","extraExplanation":["“cakehouse”是由 cake + house 组合而成的复合词。现代日常英语里更常见的是用两词写法“cake house”，或直接说“bakery / dessert shop”。","它也有历史上的俚语含义（与性交易相关），在现代交流中容易造成误解或冒犯；如果只是指甜品店，建议用更明确的表达（如 bakery, cake shop, dessert café）。"]}
{"word":"cakemaker","summary":{"en":"“Cakemaker” means a person who makes cakes (as a job or hobby).","zh":"“cakemaker”指制作蛋糕的人（可以是职业也可以是爱好者）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person whose job or hobby is making cakes, often for sale or for special occasions.","zh":"做蛋糕的人；制糕师（以制作蛋糕为工作或爱好，常用于销售或庆典定制）。"},"examples":[{"en":"She works as a cakemaker and designs wedding cakes.","zh":"她是一名制糕师，还会设计婚礼蛋糕。"},{"en":"The local cakemaker is famous for rich chocolate cake.","zh":"当地那位做蛋糕的人以浓郁的巧克力蛋糕而出名。"}]}],"synonyms":["cake maker","baker","pastry chef"],"phonetic":"/ˈkeɪkˌmeɪkər/","extraExplanation":["“cakemaker”是由“cake + maker”组合而成的复合词，含义直观，但在日常英语里更常见的说法是“cake maker”（分开写）或“baker / pastry chef”（更职业化，范围更广）。","语体上，“cakemaker”更像描述性的用词；如果是职业头衔，在菜单、店招或简历中更常用“baker”或“pastry chef”。"]}
{"word":"cakemaking","summary":{"en":"Cakemaking means the activity of making cakes, and it can also describe things related to making cakes.","zh":"Cakemaking 指“做蛋糕”的活动/过程，也可作定语表示“与做蛋糕有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity or process of making cakes, especially as a hobby or small business","zh":"（尤指作为爱好或小生意的）做蛋糕、烘焙蛋糕的活动/过程"},"examples":[{"en":"Cakemaking became her weekend hobby during the pandemic.","zh":"疫情期间，做蛋糕成了她的周末爱好。"},{"en":"This class teaches basic cakemaking skills like mixing, baking, and frosting.","zh":"这门课教授基础的做蛋糕技能，比如搅拌、烘烤和抹糖霜。"},{"en":"He started a home cakemaking business for birthdays and weddings.","zh":"他开始在家做蛋糕接单，主要做生日和婚礼蛋糕。"}]},{"partOfSpeech":"adj.","definition":{"en":"used to describe things related to making cakes","zh":"（作定语）与做蛋糕有关的"},"examples":[{"en":"She bought new cakemaking tools, including a spatula and cake pans.","zh":"她买了新的做蛋糕工具，包括刮刀和蛋糕模具。"},{"en":"The blog shares easy cakemaking tips for beginners.","zh":"这个博客分享适合新手的简单做蛋糕技巧。"}]}],"synonyms":["making cakes","cake baking","baking cakes","cake decorating (related)"],"phonetic":"/ˈkeɪkˌmeɪkɪŋ/","extraExplanation":["“cakemaking”是由“cake + making”构成的复合词，含义直观。更常见、也更口语的说法是“making cakes”或“cake baking/ baking cakes”。在英式或美式英语里都能理解，但在日常对话中“making cakes”更常用。"]}
{"word":"caker","summary":{"en":"“Caker” means a person who makes or sells cakes, but it’s uncommon in modern English.","zh":"“caker”指做或卖蛋糕的人，但在现代英语中不常用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who makes or sells cakes; a cake maker (uncommon—more often “baker” or “cake maker”).","zh":"做蛋糕的人；卖蛋糕的人（不常用，更常见说法是“baker（面包/糕点师）”或“cake maker（蛋糕师）”）。"},"examples":[{"en":"The small shop hired a caker to prepare birthday cakes.","zh":"这家小店雇了一位做蛋糕的人来准备生日蛋糕。"},{"en":"She works as a caker, decorating cakes for weddings.","zh":"她做蛋糕工作，负责婚礼蛋糕的装饰。"}]}],"synonyms":["baker","cake maker","pastry chef"],"phonetic":"/ˈkeɪkər/","extraExplanation":["“caker”在现代英语里非常少见，日常表达更自然的是：a baker（更泛指做面包和甜点的人）、a cake maker（直译“蛋糕制作者”）、a pastry chef（更专业，甜点主厨）。","如果你是在阅读旧文本或看到用户名/姓氏，“Caker”也可能是专有名词（人名/网名/姓氏），不一定表示职业。"]}
{"word":"cakes","summary":{"en":"“Cakes” is usually the plural of “cake”: a sweet baked dessert; it can also refer informally to something easy, and “to cake” means to form a thick, dry layer.","zh":"“cakes”通常是“cake”的复数：指蛋糕；口语里也可指很容易的事；动词“cake”表示结块或在表面结成厚层。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sweet baked dessert made from flour, eggs, sugar, and butter/oil, often eaten at celebrations.","zh":"蛋糕；一种用面粉、鸡蛋、糖、黄油/油等烘烤而成的甜点，常用于庆祝场合。"},"examples":[{"en":"She baked a chocolate cake for his birthday.","zh":"她为他的生日烤了一个巧克力蛋糕。"},{"en":"Would you like a slice of cake?","zh":"你想来一块蛋糕吗？"},{"en":"We ordered a wedding cake with white frosting.","zh":"我们订了一个涂着白色糖霜的婚礼蛋糕。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) Something that is very easy to do.","zh":"（非正式）很容易的事。"},"examples":[{"en":"The test was a piece of cake.","zh":"那次考试小菜一碟。"},{"en":"Fixing the problem was cake once we found the cause.","zh":"一旦找到原因，解决这个问题就很容易。"}]},{"partOfSpeech":"v.","definition":{"en":"To form a thick, dry layer or lumps, often on a surface.","zh":"结块；（常指在表面）结成一层厚厚的干硬物。"},"examples":[{"en":"Mud caked on his shoes after the hike.","zh":"徒步后泥巴结在他的鞋上。"},{"en":"Dust had caked the windowsill for years.","zh":"窗台上多年的灰尘都结成一层了。"}]}],"synonyms":["dessert","pastry","treat","(informal) breeze","(verb) crust over"],"phonetic":"/keɪk/","extraExplanation":["“cakes”通常是“cake”的复数：two cakes（两个蛋糕）。","动词“to cake”常与介词“on”搭配：cake on something（在……上结成厚层/结块）。","常见习语是“a piece of cake”（小菜一碟），口语里也会简化说“That was cake.”"]}
{"word":"cakette","summary":{"en":"Cakette means a small or mini cake, but it’s not very common; people often say “mini cake” or “cupcake.”","zh":"Cakette 指“小蛋糕/迷你蛋糕”，但并不常用；更常见的说法是 mini cake 或 cupcake。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small cake; a mini cake (a less common word).","zh":"小蛋糕；迷你蛋糕（较不常见的用法）。"},"examples":[{"en":"Each guest got a cakette with a candle on top.","zh":"每位客人都拿到一个上面插着蜡烛的小蛋糕。"},{"en":"The bakery sells cute cakettes for parties.","zh":"那家面包店卖很可爱、适合派对的小蛋糕。"}]}],"synonyms":["mini cake","small cake","cupcake"],"phonetic":"/keɪˈkɛt/","extraExplanation":["“cakette”通常由“cake + -ette”构成；“-ette”在英语里常表示“较小的……/……的小型版本”，也带一点可爱或精致的语气（如 kitchenette 小厨房、cigarette 香烟原义为“小雪茄”）。","在现代英语中，“small cake / mini cake / cupcake”更常见；“cakette”有时用于品牌命名、菜单文案或为了强调“迷你、精致”的感觉。"]}
{"word":"cakewalk","summary":{"en":"A cakewalk is something very easy; it can also mean a traditional dance called the cakewalk.","zh":"cakewalk 常指“轻而易举的事”；也可指一种传统的“蛋糕舞”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Something that is very easy to do; an easy success.","zh":"轻而易举的事；很容易取得的成功。"},"examples":[{"en":"The first quiz was a cakewalk, but the final exam was tough.","zh":"第一次小测非常轻松，但期末考试很难。"},{"en":"They thought winning would be a cakewalk, but the other team played well.","zh":"他们以为赢球会很容易，但对方发挥得很好。"}]},{"partOfSpeech":"n.","definition":{"en":"A lively dance (originally a showy, high-stepping walk), especially in the past.","zh":"一种轻快的舞步（源自夸张的高抬腿走步），尤指过去较流行的舞蹈。"},"examples":[{"en":"At the festival, a group performed a traditional cakewalk.","zh":"在节庆上，一群人表演了传统的 cakewalk 舞。"},{"en":"The movie includes a brief cakewalk scene from the early 1900s.","zh":"那部电影里有一段20世纪初的 cakewalk 场景。"}]}],"synonyms":["easy win","breeze","walk in the park","pushover","slam dunk"],"phonetic":"/ˈkeɪkˌwɔk/","extraExplanation":["“cakewalk”最早指19世纪美国的一种竞赛舞蹈：参与者以夸张、优雅的步态表演，获胜者常能得到一块蛋糕作为奖品。这个舞蹈形式与当时非裔美国人的文化历史有关，后来词义引申为“像赢蛋糕一样容易”，也就成了“轻而易举”的比喻说法。"]}
{"word":"cakewalked","summary":{"en":"“Cakewalked” is the past tense of “cakewalk,” meaning someone won or did something very easily (and less commonly, performed the cakewalk dance).","zh":"“Cakewalked”是“cakewalk”的过去式，常指轻松获胜或轻松完成某事（较少见：表演cakewalk舞蹈）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(informal) To win or succeed very easily; to do something with little effort.","zh":"（非正式）轻松获胜；毫不费力地完成某事。"},"examples":[{"en":"Their team cakewalked to victory in the final.","zh":"他们的队在决赛中轻松夺冠。"},{"en":"I thought I could cakewalk the exam, but it was harder than I expected.","zh":"我以为考试会很轻松，但比我想的更难。"}]},{"partOfSpeech":"v.","definition":{"en":"To perform a cakewalk (a dance).","zh":"表演“cakewalk”（一种舞蹈）。"},"examples":[{"en":"At the festival, the dancers cakewalked in bright costumes.","zh":"在节日上，舞者们穿着鲜艳的服装跳起了cakewalk。"}]}],"synonyms":["won easily","cruised","sailed through","aced","breezed through"],"phonetic":"/ˈkeɪkˌwɔk/","extraExplanation":["“cakewalk”最早指19世纪美国非裔社群中的一种舞蹈比赛，优胜者常得到蛋糕作为奖品，因此得名。后来这个词引申为“像拿蛋糕一样容易”，表示事情非常轻松、几乎不费力。","在现代英语里，“cakewalk”常用来形容比赛或任务“毫无悬念地轻松完成”；但在正式写作中可考虑用更中性表达（如“easily won / easily achieved”）。"]}
{"word":"cakewalker","summary":{"en":"Cakewalker is an informal word for a very easy winner or something that’s extremely easy.","zh":"Cakewalker 是非正式用语，指“轻松取胜的人”，也可指“非常容易的事”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Someone who wins very easily, or a person who is so much better than others that winning seems effortless.","zh":"（非正式）轻松取胜的人；实力明显强于他人、赢得毫不费力的人。"},"examples":[{"en":"Against that team, she’s a cakewalker—she wins every time.","zh":"对上那支队，她就是“稳赢的人”——每次都能轻松拿下。"},{"en":"He’s not a cakewalker; the competition is tough this year.","zh":"他可不是那种能轻松赢的人；今年竞争很激烈。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) Something extremely easy to do; an easy task or situation.","zh":"（非正式）非常容易的事；轻而易举的任务或局面。"},"examples":[{"en":"Don’t worry—the final question is a cakewalker.","zh":"别担心——最后一道题非常简单。"},{"en":"With good notes, the test should be a cakewalker.","zh":"有了完整笔记，这次考试应该会很轻松。"}]}],"synonyms":["sure winner","easy winner","walkover","pushover (context-dependent)","easy task","piece of cake"],"phonetic":"/ˈkeɪkˌwɔkɚ/","extraExplanation":["“cakewalker”来自短语“a cakewalk”（轻而易举的事）。更早的“cakewalk”原指一种表演舞蹈/比赛，优胜者常能得到蛋糕作为奖品，因此逐渐引申为“很容易赢”。","历史背景上，“cakewalk”也与19世纪美国非裔文化中的舞蹈传统有关；现代使用时通常只表达“很容易/轻松取胜”的意思，不带特定族群指向，但在正式写作中可用更中性的说法（如 easy win / simple task）。"]}
{"word":"cakewalking","summary":{"en":"“Cakewalking” usually means something is extremely easy or done effortlessly; it can also refer to a dance style related to the traditional cakewalk.","zh":"“cakewalking”通常表示事情非常容易或做得毫不费力；也可指与传统“cakewalk（蛋糕步舞）”相关的舞蹈风格。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) Very easy; requiring little effort.","zh":"（非正式）非常容易的；不费力的。"},"examples":[{"en":"The first level is cakewalking, but the game gets harder later.","zh":"第一关简直太容易了，但后面游戏会变难。"},{"en":"For her, public speaking is cakewalking because she practices a lot.","zh":"对她来说，当众演讲很轻松，因为她练得很多。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of doing something in an easy, relaxed way; making something look effortless.","zh":"轻松完成某事的状态/做法；把事情做得毫不费力。"},"examples":[{"en":"He finished the exam in thirty minutes—pure cakewalking.","zh":"他三十分钟就考完了——完全是轻松搞定。"}]},{"partOfSpeech":"n.","definition":{"en":"A style of dance connected to the traditional “cakewalk.”","zh":"一种与传统“cakewalk（蛋糕步舞）”相关的舞蹈风格。"},"examples":[{"en":"The show included jazz numbers and a bit of cakewalking.","zh":"演出包含爵士舞段，也穿插了一点蛋糕步舞风格。"}]}],"synonyms":["easy","effortless","a breeze","a piece of cake","simple"],"phonetic":"/ˈkeɪkˌwɔkɪŋ/","extraExplanation":["“cakewalk/蛋糕步舞”最初是一种19世纪末的舞蹈与比赛形式，常见于美国南方，获胜者会得到蛋糕作为奖品。它与非裔美国人文化有密切关联，也被认为带有对上层舞会姿态的模仿与讽刺意味。后来引申出比喻义：某事“容易得像走路一样”，因此有了“a cakewalk（小菜一碟）”以及形容词用法“cakewalking（轻轻松松的）”。","常见搭配：“It’s a cakewalk.”（小菜一碟）/ “This will be a cakewalk.”（这会很轻松）。注意写法：作比喻时更常见的是名词短语“a cakewalk”，而“cakewalking”多用来强调“轻松到像在散步一样的过程/状态”。"]}
{"word":"cakewalks","summary":{"en":"“Cakewalks” usually means very easy tasks or easy wins; less commonly, it can mean multiple cakewalk dances.","zh":"“cakewalks”通常指“很容易的事情/轻松的胜利”；较少见时也可指多段蛋糕步舞（cakewalk舞蹈）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “cakewalk”: something that is very easy to do; an easy win or task.","zh":"“cakewalk”的复数：非常容易完成的事情；轻松的胜利/任务。"},"examples":[{"en":"The first two quizzes were cakewalks, but the final exam was tough.","zh":"前两次小测简直是小菜一碟，但期末考试很难。"},{"en":"Against an injured opponent, the match looked like a cakewalk.","zh":"面对受伤的对手，这场比赛看起来会轻松取胜。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) plural of “cakewalk”: a kind of dance, originally performed in competitions.","zh":"（较少见）“cakewalk”的复数：一种舞蹈，最初常在比赛中表演。"},"examples":[{"en":"The show included old-time cakewalks and ragtime music.","zh":"演出包含了传统的蛋糕步舞和拉格泰姆音乐。"}]},{"partOfSpeech":"vi.","definition":{"en":"third-person singular of “cakewalk” (informal): to do something easily, with little effort.","zh":"“cakewalk”的第三人称单数（非正式）：轻松完成；毫不费力地做到。"},"examples":[{"en":"She cakewalks through math problems that most people struggle with.","zh":"大多数人觉得吃力的数学题，她却轻轻松松就能搞定。"}]}],"synonyms":["easy wins","pushovers","walkovers","breeze","piece of cake"],"phonetic":"ˈkeɪkˌwɔks","extraExplanation":["“a cakewalk”作“轻而易举的事”很常见，常用于口语和体育/考试语境。写作时也可用更中性的表达：an easy task / an effortless win。","“cakewalk”最早指19世纪美国非裔社群中的舞蹈比赛，优胜者常得到蛋糕作为奖品；后来这个词才引申出“轻松获胜/不费力”的意思。使用时注意其历史背景，避免在严肃语境中轻率使用。"]}
{"word":"cakey","summary":{"en":"“Cakey” means cake-like—soft and crumbly; in makeup it often means thick or powdery-looking.","zh":"“Cakey”表示“像蛋糕一样的（松软、略碎）”；在化妆语境里常指妆感厚重、粉感强、像结块。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like cake in texture or taste; soft, sweet, and slightly crumbly (often used for baked goods or cosmetics).","zh":"像蛋糕一样的；口感/质地松软香甜、略带碎屑感的（常用于形容烘焙食品或化妆品）。"},"examples":[{"en":"These brownies are a bit cakey—I prefer them fudgier.","zh":"这些布朗尼有点偏蛋糕口感——我更喜欢更湿润浓稠一点的。"},{"en":"The foundation looks cakey when you apply too much powder on top.","zh":"如果在上面扑太多粉，粉底看起来会很“厚重结块”（很cakey）。"},{"en":"The muffins came out light and cakey.","zh":"这些玛芬烤出来很轻盈、很有蛋糕感。"}]}],"synonyms":["cake-like","spongy","crumbly","powdery-looking"],"phonetic":"/ˈkeɪki/","extraExplanation":["“cakey”是由名词“cake（蛋糕）”加上形容词后缀“-y”构成，表示“有……特征的”。在美妆语境里，“cakey”通常带负面含义，指底妆像结了一层“面具”，纹理明显、不服帖；在烘焙语境里多为中性或褒义，指口感松软像蛋糕。","常见对比：fudgy（更湿润浓郁、偏“软糖/生巧”口感的布朗尼） vs. cakey（更蓬松、像蛋糕的口感）。"]}
{"word":"cakier","summary":{"en":"“Cakier” means “more cake-like,” describing a drier/crumbly texture or (figuratively) thicker, less natural-looking makeup.","zh":"“cakier”表示“更像蛋糕的”，常形容口感更干更松碎；也可比喻妆容更厚重、更不自然。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"More like cake in texture (drier, crumbly, or denser), or containing more cake.","zh":"更像蛋糕的（质地更干、更松碎或更厚实）；或含有更多蛋糕成分的。"},"examples":[{"en":"This muffin is cakier than a typical cupcake—it's drier and more crumbly.","zh":"这个玛芬比一般的纸杯蛋糕更“蛋糕口”——更干、更松碎。"},{"en":"I prefer a cakier brownie instead of a fudgy one.","zh":"我更喜欢更像蛋糕的布朗尼，而不是那种很湿润黏稠的。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Looking thicker and less natural, especially about makeup.","zh":"（比喻）看起来更厚、更不自然（尤指妆容）。"},"examples":[{"en":"My foundation looks cakier in bright sunlight.","zh":"在强光下我的粉底看起来更厚重、更不自然。"},{"en":"Try a lighter layer so it won’t get cakier as the day goes on.","zh":"尽量薄涂一点，这样一天过去也不容易越来越“结块厚重”。"}]}],"synonyms":["more cake-like","more crumbly","drier","thicker (makeup)","more heavy-looking"],"phonetic":"/ˈkeɪkiər/","extraExplanation":["“cakier”是形容词“cakey”的比较级形式，常见于食物口感对比（cakier vs. fudgier/chewier）。","拼写规则：以“-y”结尾的形容词变比较级通常把“y”变成“i”再加“-er”（cakey → cakier）。","在美妆语境里，“cakey/cakier”常指底妆“厚重、浮粉、结块”，属于非常常见的口语评价。"]}
{"word":"cakiest","summary":{"en":"“Cakiest” means “the most cake-like,” describing a texture (especially baked goods) or a heavy, powdery makeup look.","zh":"“cakiest”表示“最像蛋糕的/最偏蛋糕质地的”，常用于形容烘焙口感或妆容粉感过重、显厚。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Most like cake in texture or appearance; the thickest, most cake-like (often said about baked goods or makeup).","zh":"最像蛋糕的；最“蛋糕般”的（常形容烘焙食品的口感/质地，或妆容的厚重感）。"},"examples":[{"en":"Of all the brownies, this batch is the cakiest and least fudgy.","zh":"在这些布朗尼里，这一炉最偏蛋糕口感，最不“湿润黏糯”。"},{"en":"I used too much powder, and now my makeup looks the cakiest around my nose.","zh":"我粉用太多了，现在鼻翼周围的妆看起来最厚、最“浮粉”。"}]}],"synonyms":["most cake-like","most spongy","least fudgy"],"phonetic":"/ˈkeɪkiəst/","extraExplanation":["“cakiest”来自形容词“cakey”（像蛋糕的、粉感重的）的最高级形式：cakey → cakier → cakiest。","在烘焙语境里，caky/cakey常与fudgy（更黏密、像软糖/巧克力酱般）对比；在美妆语境里，cakey通常带负面含义，指粉底/散粉堆积、显厚重。"]}
{"word":"Cakile","summary":{"en":"Cakile is the scientific name for sea rocket, a beach plant in the mustard family.","zh":"Cakile 是海火箭属的学名，指一种生长在海滩与沙丘的十字花科植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of seaside plants (sea rocket) in the mustard family, typically found on sandy beaches and dunes.","zh":"滨海植物属名（海火箭属），属于十字花科，常见于沙滩与海岸沙丘。"},"examples":[{"en":"Cakile often grows on sandy beaches where few other plants can survive.","zh":"Cakile 常生长在沙滩上，那里很少有其他植物能存活。"},{"en":"The coastal dunes were dotted with sea rocket (Cakile).","zh":"海岸沙丘上零星分布着海火箭（Cakile）。"}]}],"synonyms":["sea rocket"],"phonetic":"/kəˈkaɪli/","extraExplanation":["Cakile 是拉丁学名，英语里更常见的普通名是 sea rocket（海火箭）。在北美海岸常见的物种之一是 Cakile edentula（American sea rocket）。","作为海岸先锋植物，它耐盐、耐风、耐沙埋，有助于稳定沙地；在自然写作或生态文章中，常用来描写海岸荒野与沙丘生态。"]}
{"word":"cakile","summary":{"en":"Cakile is a plant genus known as sea rocket, a beach/dune plant in the mustard family.","zh":"Cakile 指海火箭属植物（sea rocket），属于十字花科，常见于海滩与沙丘。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of coastal flowering plants in the mustard family (Brassicaceae), commonly called sea rocket, often found on sandy beaches and dunes","zh":"（植物）海火箭属：十字花科（芥菜科）的一类海岸开花植物，常见于沙滩与沙丘，英文常称 sea rocket（海火箭）"},"examples":[{"en":"Sea rocket (Cakile) often grows just above the high-tide line on sandy beaches.","zh":"海火箭属植物（Cakile）常生长在沙滩高潮线以上的位置。"},{"en":"After storms, Cakile seeds can spread along the coast and sprout in new patches of sand.","zh":"风暴过后，Cakile 的种子可能沿海岸传播，并在新的沙地里发芽。"}]}],"synonyms":["sea rocket","Cakile (genus name)"],"phonetic":"/ˈkeɪkɪli/","extraExplanation":["“Cakile”是拉丁化的植物学属名，日常英语里更常用的俗名是“sea rocket”。如果你在论文、标本标签或植物百科中看到“Cakile”，通常是在用学名系统指代这一属。"]}
{"word":"caking","summary":{"en":"Caking means forming into a hard mass or thick layer; it’s also used for makeup that looks thick or uneven on skin.","zh":"caking 指“结块/结成硬团或厚层”，也常指化妆“卡粉、厚重不均”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of forming into a hard mass or a thick, dry layer (often something unwanted)","zh":"结块；结成硬块或形成一层厚而干的硬壳（常指不受欢迎的情况）"},"examples":[{"en":"Humidity can cause caking in salt and sugar.","zh":"潮湿会导致盐和糖结块。"},{"en":"There was caking of mud on the boots after the hike.","zh":"徒步后靴子上结了一层泥。"}]},{"partOfSpeech":"n.","definition":{"en":"(makeup) the look of cosmetics becoming thick, uneven, or cracked on the skin","zh":"（化妆）底妆/粉类在皮肤上变厚、斑驳或卡粉的现象"},"examples":[{"en":"To avoid caking, apply foundation in thin layers.","zh":"为了避免卡粉，粉底要薄涂、分层上。"},{"en":"My concealer started caking around my eyes.","zh":"我的遮瑕在眼周开始卡粉了。"}]},{"partOfSpeech":"adj.","definition":{"en":"forming into a hard mass; becoming covered with a thick, dry layer","zh":"正在结块的；正在结成一层厚而干硬覆盖物的"},"examples":[{"en":"The wet flour is caking in the bowl.","zh":"湿面粉在碗里正在结块。"},{"en":"Leaves were caking the drain and blocking the water.","zh":"落叶在排水口处堆结成团，把水堵住了。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “cake”: to form into a hard mass or stick in a thick layer","zh":"“cake”的现在分词：结块；结成硬团；厚厚地黏附/覆盖"},"examples":[{"en":"Dirt was caking onto the tires.","zh":"泥巴厚厚地黏在轮胎上。"},{"en":"The powder is caking because the container isn’t sealed.","zh":"粉末会结块，因为容器没有密封。"}]}],"synonyms":["clumping","hardening","crusting","caking up","buildup"],"phonetic":"/ˈkeɪkɪŋ/","extraExplanation":["“caking”在美妆语境里非常常见，常与“crease（卡纹/起褶）”“patchy（斑驳）”一起出现。通常指粉底、遮瑕、散粉在皮肤纹理或干燥处堆积，看起来不服帖。"]}
{"word":"cakra","summary":{"en":"Cakra (often spelled “chakra”) usually means a spiritual energy center in the body; it can also mean “wheel” in South Asian religious contexts.","zh":"Cakra（英语常拼作 chakra）通常指人体的“脉轮/能量中心”；在南亚宗教语境中也可指“轮/法轮”等含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Hinduism, Buddhism, and yoga) one of the body’s spiritual “energy centers,” often described as seven main points aligned along the spine.","zh":"（在印度教、佛教与瑜伽中）人体的“脉轮/能量中心”，常被描述为沿脊柱排列的七个主要能量点。"},"examples":[{"en":"In yoga class, the teacher talked about balancing the heart cakra through breathing.","zh":"在瑜伽课上，老师说可以通过呼吸来平衡“心轮”。"},{"en":"Some meditation traditions focus on visualizing light moving through the cakras.","zh":"一些冥想传统会练习观想光穿过各个脉轮。"}]},{"partOfSpeech":"n.","definition":{"en":"A wheel; by extension, a circular symbol of power or teaching (especially in South Asian religious contexts).","zh":"轮子；引申为象征力量或教法的圆形符号（尤见于南亚宗教语境）。"},"examples":[{"en":"The dharma wheel is sometimes described using the word cakra.","zh":"“法轮”有时会用 cakra 这个词来描述。"},{"en":"In some stories, a cakra can refer to a powerful, spinning disk-like weapon.","zh":"在一些故事里，cakra 也可以指一种强力旋转的圆盘状武器。"}]}],"synonyms":["chakra","energy center","wheel (religious symbol)"],"phonetic":"ˈtʃʌkrə","extraExplanation":["“cakra”是梵语（Sanskrit）词，英语里更常见的拼写是“chakra”。在现代英语中，它常出现在瑜伽、冥想与身心灵（wellness/spirituality）语境里，指“脉轮”。","在更传统的宗教与哲学语境中，cakra 的本义与“轮、圆盘”有关，因此也会出现在“法轮（dharma wheel）”“神的圆盘武器”等文化意象里。阅读英文材料时，可根据上下文判断是“能量中心”还是“轮/圆盘”的含义。"]}
{"word":"cakravartin","summary":{"en":"Cakravartin means an ideal “universal monarch” in ancient Indian religious and literary traditions, often translated as “world emperor.”","zh":"Cakravartin 指印度古代宗教与文学传统中的理想“普世君主/转轮王”，常译为“世界帝王”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a universal ruler or ideal monarch in ancient Indian tradition (Hinduism, Buddhism, and Jainism), believed to “rule the whole world” in a righteous way; often translated as “world emperor.”","zh":"（印度古代传统中）“转轮王/转轮圣王”，指理想的“世界君主/普世君王”，以正法治理天下；常译为“世界帝王”。"},"examples":[{"en":"In Buddhist stories, a cakravartin rules by justice rather than by fear.","zh":"在佛教故事中，转轮王以公正治理，而不是靠恐惧统治。"},{"en":"The inscription praises the king as a cakravartin, suggesting he had unmatched authority.","zh":"铭文称赞国王为“转轮王”，暗示他拥有无与伦比的权威。"}]},{"partOfSpeech":"adj.","definition":{"en":"(in religious or literary contexts) relating to such an ideal universal ruler.","zh":"（宗教或文学语境中）与“转轮王/普世君主”相关的；具有“普世君王”象征意义的。"},"examples":[{"en":"The poem uses cakravartin imagery to describe a perfectly just reign.","zh":"这首诗用“转轮王”的意象来描写一种完美而公正的统治。"}]}],"synonyms":["universal monarch","world emperor","world ruler"],"phonetic":"/ˌtʃʌk.rəˈvɑr.tɪn/","extraExplanation":["“Cakravartin”来自梵语：cakra（轮）+ vartin（转动/运转者），字面意思接近“使轮转者”。传统意象中常出现“轮宝/法轮”象征其合法性与德行（并不只是武力征服）。","在佛教中，“转轮王”常被视为理想的世俗统治者，与佛陀（觉悟的精神导师）形成对照：一个以正法治世，一个以正法度心。不同地区与文本对其“统治范围”和“七宝”等细节描述可能不同。","英语里该词多用于宗教学、历史学、艺术史或文学评论中，属于较学术的借词；一般日常英语更常用的解释性说法是 “universal monarch / world ruler”。"]}
{"word":"caky","summary":{"en":"“Caky” (usually spelled “cakey”) means having a cake-like, often too-dry or too-thick texture or look.","zh":"“caky”（更常写作“cakey”）指外观或质地像蛋糕一样，常带有过干或过厚的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Informal, less common spelling of “cakey”) Like cake in texture or appearance; dry, thick, or crumbly in a way that resembles cake (often used about makeup, batter, or food).","zh":"（非正式、较少见的拼写，等同于“cakey”）像蛋糕一样的；质地偏干、厚重或易碎，呈现“蛋糕感”（常用于形容妆容、面糊或食物）。"},"examples":[{"en":"This foundation looks caky around my nose.","zh":"这款粉底在我鼻翼附近看起来很“卡粉”，有蛋糕般的厚重感。"},{"en":"The frosting turned caky after sitting out too long.","zh":"糖霜放在外面太久后变得发干、发厚，有点“蛋糕感”。"},{"en":"Don’t overmix the batter, or the texture can get caky.","zh":"别把面糊搅拌过头，不然口感可能会变得偏干、发硬。"}]}],"synonyms":["cakey","crumbly","dry","powdery","thick-looking"],"phonetic":"/ˈkeɪki/","extraExplanation":["“caky”在现代英语里更常写作“cakey”。在美妆语境中，“cakey”通常指底妆太厚、显粉感/卡粉；在烘焙语境中则多指口感偏干、像蛋糕屑一样。正式写作建议用“cakey”。"]}

