{"word":"caque","summary":{"en":"Caqué is a rare/old word meaning a cask or large barrel.","zh":"caque 是一个罕见/旧式词，意思是“（大）木桶/酒桶”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cask or large barrel, especially one used for wine, fish, or other goods (rare/old-fashioned in English).","zh":"（罕见/旧式英语）大木桶；（尤指）装酒、鱼或其他货物的桶。"},"examples":[{"en":"The merchant stored salted fish in a caque for the sea voyage.","zh":"商人把腌鱼装进大木桶里，准备海上运输。"},{"en":"In some older texts, you may see “caque” used where modern English would say “cask” or “barrel.”","zh":"在一些较早的文本中，你可能会看到用“caque”来表达现代英语中的“cask”或“barrel”。"}]}],"synonyms":["cask","barrel","tun"],"phonetic":"/kæk/","extraExplanation":["“caque”多见于历史/文学语境，来源与法语 *caque*（桶）有关，因此在现代日常英语里相当少用。阅读旧文或历史题材作品时遇到它，通常可按“木桶/酒桶”来理解。"]}
{"word":"Caquet","summary":{"en":"Caquet means trivial chatter or gossip (a rare, literary word).","zh":"Caquet 指琐碎的闲聊或流言（较少见、偏文学/书面用语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"idle talk; light, often trivial chatter or gossip","zh":"闲聊；（多指）琐碎的闲话或流言"},"examples":[{"en":"The room filled with caquet as everyone waited for the meeting to start.","zh":"大家等着会议开始时，房间里充满了闲聊声。"},{"en":"She tried to ignore the caquet about her promotion and focus on her work.","zh":"她尽量不理会关于她升职的流言，把注意力放在工作上。"},{"en":"In the café, caquet drifted from table to table like background music.","zh":"在咖啡馆里，闲聊声从一桌飘到另一桌，像背景音乐一样。"}]}],"synonyms":["chatter","gossip","babble","prattle","tittle-tattle"],"phonetic":"/kæˈkeɪ/","extraExplanation":["“caquet”是法语借词，来自法语 *caqueter*（指像母鸡咯咯叫一样不停说话），因此常带有“叽叽喳喳、话多而琐碎”的语感。","在现代英语里它相当少见，属于比较文学/书面、略带复古色彩的词；日常口语更常用 *chatter*（闲聊）或 *gossip*（八卦、流言）。"]}
{"word":"caquet","summary":{"en":"Caquet means light, idle chatter or gossip, usually in a literary or old-fashioned tone.","zh":"caquet 指轻松但无实质内容的闲聊或八卦，多用于文学或较古雅的语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"light, idle talk; prattle or gossip (often used in a literary or old-fashioned style)","zh":"闲聊；饶舌；八卦（多见于文学或较古雅的用法）"},"examples":[{"en":"The room filled with the caquet of guests discussing the latest news.","zh":"房间里充满了宾客们谈论最新消息的闲聊声。"},{"en":"He ignored the caquet and focused on his work.","zh":"他不理会那些闲言碎语，专心工作。"}]}],"synonyms":["chatter","gossip","prattle","babble"],"phonetic":"/kæˈkeɪ/","extraExplanation":["这个词在现代英语里非常少见，更常见的替代词有 chatter / gossip / prattle。它来自法语 caquet，原意与“咯咯叫、喋喋不休的声音”相关，因此带有“嘴碎、话多”的语感。","在文学语境中，caquet 往往用来营造一种“社交场合的嘈杂闲谈”氛围，比普通的 gossip 更强调“声音与喧闹感”。"]}
{"word":"caqueterie","summary":{"en":"Caqueterie means coquettish, attention-seeking talk or behavior, or more generally light, affected chatter.","zh":"Caqueterie 指带矫饰的调情言谈/举止，也可泛指轻薄、做作的闲聊。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often critical) Flirtatious or coquettish behavior, especially light, affected talk meant to attract attention.","zh":"（常带贬义）卖弄风情、矫饰的调情举止；尤指为博取注意而故作轻佻的言谈。"},"examples":[{"en":"The novel mocks the heroine’s caqueterie at the party—smiles, teasing remarks, and practiced charm.","zh":"小说嘲讽女主在派对上的卖弄风情——微笑、逗弄的话语和刻意练习的魅力。"},{"en":"He mistook her friendly conversation for caqueterie.","zh":"他把她友善的交谈误当成了矫饰的调情。"}]},{"partOfSpeech":"n.","definition":{"en":"Light, trivial chatter; talk that feels showy or insincere.","zh":"轻浮琐碎的闲聊；让人觉得卖弄或不真诚的谈话。"},"examples":[{"en":"She was tired of salon caqueterie and wanted a serious discussion.","zh":"她厌倦了沙龙里轻浮的闲聊，想要一场严肃的讨论。"},{"en":"Behind the caqueterie, the writer hints at real loneliness.","zh":"在那些轻佻话语背后，作者暗示了真实的孤独。"}]}],"synonyms":["coquetry","flirtation","affectation","banter","chitchat"],"phonetic":"/ˌkɑːkəˈtɪri/","extraExplanation":["该词来自法语 *caqueterie*，与 *caqueter*（叽叽喳喳地说、闲聊）有关，所以既可指“调情式的卖弄言谈”，也可泛指“轻薄的闲聊”。","在英语里属于较文学/书面用词，语气常带讽刺或批评，暗示“刻意、做作、不够真诚”。"]}
{"word":"caqueteuse","summary":{"en":"A rare, literary word for a talkative, gossipy woman; also an adjective meaning gossipy.","zh":"一个罕见的文学词，指爱唠叨、爱八卦的女人；也可作形容词表示“爱八卦的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, literary) A talkative, gossiping woman; a chatterbox.","zh":"（罕见/文学用语）爱唠叨、爱搬弄是非的女人；话匣子。"},"examples":[{"en":"In the novel, the caqueteuse spreads rumors from one salon to another.","zh":"在小说里，这个爱嚼舌根的女人把流言从一个沙龙传到另一个沙龙。"},{"en":"He dismissed her as a mere caqueteuse and refused to listen.","zh":"他把她当成只会唠叨的长舌妇，干脆不听她说。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) Talkative and gossipy (usually describing a woman).","zh":"（罕见）爱唠叨、爱八卦的（通常形容女性）。"},"examples":[{"en":"A caqueteuse neighbor kept commenting on everyone’s business.","zh":"一位爱八卦的邻居总对别人的私事指指点点。"}]}],"synonyms":["chatterbox","gossip","blabbermouth","garrulous (adj.)","gossipy (adj.)"],"phonetic":"/ˌkækəˈtuz/","extraExplanation":["词源来自法语 *caqueteuse*（阴性形式），与动词 *caqueter*（喋喋不休、像母鸡咯咯叫一样叽叽喳喳）有关，因此带有“吵、碎、惹人烦”的贬义色彩。","在英语中它非常少见，多见于描写法国沙龙文化、旧小说或带法式风格的文字；日常英语更常用 *chatterbox*, *gossip*, *gossipy*, *chatty*。"]}
{"word":"caqueteuses","summary":{"en":"Caqueteuses is a French plural form meaning “gossipy women / chatterboxes,” or “gossipy (feminine plural).”","zh":"Caqueteuses 是法语阴性复数形式，指“爱八卦的女人们/话痨”，或作形容词表示“（阴性复数）爱嚼舌根的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(French) plural feminine form of caqueteuse: a gossipy woman; a chatterbox (someone who talks a lot, often about other people).","zh":"（法语）caqueteuse 的阴性复数：爱嚼舌根的女人；话多的“八卦”者（常谈论别人私事）。"},"examples":[{"en":"In the novel, the author mocks the caqueteuses who spread rumors in the village.","zh":"在小说里，作者嘲讽那些在村里散播流言的“八卦女人们”。"},{"en":"She avoided the caqueteuses at work because they always had something to say about everyone.","zh":"她躲开办公室里那些爱嚼舌根的人，因为她们总爱议论每一个人。"}]},{"partOfSpeech":"adj.","definition":{"en":"(French) plural feminine adjective meaning “gossipy; chatty; given to prattling,” often with a negative tone.","zh":"（法语）阴性复数形容词，意为“爱八卦的；话多碎嘴的”，通常带贬义。"},"examples":[{"en":"They describe her friends as caqueteuses and unkind.","zh":"他们形容她的朋友们爱八卦而且刻薄。"}]}],"synonyms":["gossips","chatterboxes","busybody","rumor-mongers"],"phonetic":"/ˌkɑkəˈtuz/","extraExplanation":["“Caqueteuses”来自法语动词“caqueter”，原义带有“像母鸡咯咯叫一样喋喋不休”的联想，因此常用来讽刺碎嘴、爱传播闲话的人。","这个词在英语里不算常见，多见于文学、历史或带法式风格的写作中。英语更常用的对应说法有：gossips, chatterboxes, busybodies（语气更强）。"]}
{"word":"Caquetio","summary":{"en":"Caquetío refers to an Indigenous people of northwestern Venezuela and nearby Caribbean islands, and also to their (largely extinct) language.","zh":"Caquetío 指委内瑞拉西北部及周边加勒比岛屿的原住民族卡克蒂奥人，也可指他们的（多已消亡的）卡克蒂奥语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A member of the Caquetío people, an Indigenous group historically living in what is now northwestern Venezuela and nearby Caribbean areas (including Aruba, Curaçao, and Bonaire).","zh":"卡克蒂奥人：历史上居住在今委内瑞拉西北部及邻近加勒比地区（包括阿鲁巴、库拉索和博奈尔）的原住民族成员。"},"examples":[{"en":"Archaeologists have found traces of Caquetío settlements on Aruba.","zh":"考古学家在阿鲁巴发现了卡克蒂奥人聚落的遗迹。"},{"en":"Some local traditions are linked to Caquetío heritage.","zh":"一些地方传统与卡克蒂奥人的文化遗产有关。"}]},{"partOfSpeech":"n.","definition":{"en":"The (largely extinct) Indigenous language traditionally spoken by the Caquetío people, usually classified within the Arawakan language family.","zh":"卡克蒂奥语：卡克蒂奥人传统使用、现多已消亡的原住民语言，通常被归入阿拉瓦克语系。"},"examples":[{"en":"Only limited records of the Caquetío language remain today.","zh":"如今仅存少量关于卡克蒂奥语的记录。"},{"en":"Researchers compare Caquetío with related Arawakan languages to understand its vocabulary.","zh":"研究者会把卡克蒂奥语与相关的阿拉瓦克语系语言对比，以理解其词汇。"}]}],"synonyms":["Caquetíos"],"phonetic":"/kɑːˈkeɪ.ti.oʊ/","extraExplanation":["“Caquetío”常见于历史与人类学语境，尤其与荷兰加勒比地区（Aruba、Curaçao、Bonaire）早期原住民史相关。","拼写上也常见复数形式“Caquetíos”。在学术写作中，有时会出现不同转写或重音标注。"]}
{"word":"caquetio","summary":{"en":"Caquetío refers to an Indigenous people (and their historical Arawakan language) from northwestern Venezuela and nearby Caribbean islands such as Aruba.","zh":"Caquetío 指委内瑞拉西北部及阿鲁巴等附近加勒比海岛的原住民族群（以及其历史上的阿拉瓦克语系语言）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Caquetío, an Indigenous people historically from northwestern Venezuela and nearby Caribbean islands (especially Aruba, Curaçao, and Bonaire).","zh":"卡克蒂奥人：历史上分布于委内瑞拉西北部及附近加勒比海岛（尤其阿鲁巴、库拉索和博奈尔）的原住民族群成员。"},"examples":[{"en":"Archaeologists have found Caquetío pottery on Aruba.","zh":"考古学家在阿鲁巴发现了卡克蒂奥人的陶器。"},{"en":"Some local place names may come from Caquetío words.","zh":"一些当地地名可能源自卡克蒂奥语词汇。"}]},{"partOfSpeech":"n.","definition":{"en":"the (historical) Arawakan language associated with the Caquetío people.","zh":"卡克蒂奥语：与卡克蒂奥人相关的（历史上的）阿拉瓦克语系语言。"},"examples":[{"en":"Very little Caquetío is recorded in written sources.","zh":"文献中对卡克蒂奥语的记录非常少。"},{"en":"Researchers compare Caquetío with other Arawakan languages.","zh":"研究者会把卡克蒂奥语与其他阿拉瓦克语系语言进行比较。"}]}],"phonetic":"/kɑːˈkeɪti.oʊ/","extraExplanation":["“Caquetío”常见于历史、人类学与加勒比地区研究语境中，属于较专门的词。英文资料里有时写作 Caquetio（不带重音符号），但在西班牙语拼写中常见 Caquetío。","发音在英文中可能会受西班牙语影响而有差异；阅读学术资料时，注意它既可指“族群/族人”，也可指“语言”。"]}
{"word":"caquetoire","summary":{"en":"A rare word for a historic French armchair-like seat associated with conversation.","zh":"较罕见：指一种历史上的法国扶手椅式座椅，常与聊天社交相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of French chair (especially 16th–17th century) with arms or a wide, open seat, associated with conversation and informal socializing.","zh":"一种法国古典椅（多见于16–17世纪），常有扶手或较宽、开放的座面，常与闲聊、社交场景相关。"},"examples":[{"en":"The museum displayed a carved caquetoire from the Renaissance period.","zh":"博物馆展出了一把文艺复兴时期的雕花 caquetoire（古法座椅）。"},{"en":"In the portrait, she sits on a caquetoire, suggesting a refined domestic setting.","zh":"在那幅肖像里，她坐在一把 caquetoire 上，暗示一种讲究的家庭场景。"},{"en":"Collectors value caquetoires for their distinctive arms and historical style.","zh":"收藏家很看重 caquetoire，因为它的扶手造型独特且具有历史风格。"}]}],"synonyms":["armchair","antique chair","French Renaissance chair"],"phonetic":"/ˌkækəˈtwɑr/","extraExplanation":["这个词是法语借词，来自法语动词 *caqueter*（像母鸡一样“咯咯叫”，引申为“叽叽喳喳地闲聊/八卦”）。因此 *caquetoire* 常被解释为“适合坐着聊天的椅子”。","在英语里它非常少见，更多出现在艺术史、家具史、博物馆说明或古董收藏语境中；日常英语更常说 *armchair*（扶手椅）或 *Renaissance chair*（文艺复兴时期椅子）。"]}
{"word":"caquetoires","summary":{"en":"Caquetoires is the plural of caquetoire, a rare word for a seat (often in a church) associated with chatting or gossip.","zh":"Caquetoires 是 caquetoire 的复数，指一种（常见于教堂的）与闲聊或八卦相关的座位/长凳（罕见词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural: caquetoires) a seat or small bench, especially in a church, where people (traditionally women) could sit and chat; by extension, a place where gossip is exchanged.","zh":"（复数：caquetoires）一种座位或长凳，尤指教堂里的座位；传统上被认为是人们（尤其女性）坐着聊天的地方；引申为“闲聊、八卦的场所”。"},"examples":[{"en":"In the old chapel, the women were said to gather on the caquetoires after the service.","zh":"在那座古老的小教堂里，据说礼拜结束后妇女们会聚在那些 caquetoires 上聊天。"},{"en":"The novelist describes the market steps as a kind of caquetoire where rumors travel fast.","zh":"小说家把集市的台阶描写成一种“caquetoire”，谣言在那里传播得很快。"}]}],"synonyms":["gossip bench","gossip corner","meeting place","gathering spot"],"phonetic":"ˌkækɪˈtwɑr","extraExplanation":["这是一个从法语借入的极罕见词：法语动词 *caqueter* 有“叽叽喳喳地说话、闲聊”的意思，因此 *caquetoire*（及其复数 *caquetoires*）带有“聊天/八卦”的文化联想。现代英语中几乎只在历史、建筑描述或文学性写作里出现。","英语里更常用的对应表达有 *gossip bench*（八卦长凳）、*a place for gossip*（闲聊之处）等；在正式写作中也可用 *a gathering place*（聚集处）根据语境替换。"]}
