{"word":"CAV","summary":{"en":"CAV is most commonly an abbreviation for “cavalry”; in technical contexts it can mean “constant angular velocity.”","zh":"CAV最常见是“cavalry（骑兵）”的缩写；在技术语境中也可指“constant angular velocity（恒定角速度）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “cavalry” (soldiers who fight on horseback; in modern times, often armored or fast-moving troops)","zh":"“cavalry（骑兵）”的缩写（过去指骑马作战的部队；现代也可泛指机动/装甲骑兵部队）"},"examples":[{"en":"He served in the U.S. 1st Cav Division.","zh":"他曾在美国陆军第一骑兵师服役。"},{"en":"The museum has a cav uniform from the 1800s.","zh":"博物馆里有一套19世纪的骑兵制服。"}]},{"partOfSpeech":"other","definition":{"en":"(technical) short for “constant angular velocity,” meaning an object rotates at a steady rate","zh":"（技术用语）“constant angular velocity（恒定角速度）”的缩写，指物体以稳定的速度旋转"},"examples":[{"en":"This joint is designed for CAV operation.","zh":"这个接头是为恒定角速度运转而设计的。"},{"en":"Under CAV, the turntable rotates at a constant speed.","zh":"在恒定角速度条件下，转盘以恒定速度旋转。"}]}],"synonyms":["cav.","cavalry"],"phonetic":"/kæv/","extraExplanation":["“CAV”通常是缩写/首字母词，具体含义强烈依赖语境（军事、工程、公司/机构名称等）。如果你告诉我它出现在哪句话或哪个领域里，我可以给出更准确的释义。"]}
{"word":"Cav","summary":{"en":"“Cav” is usually an informal short form of “cavalry,” and sometimes a nickname connected to the Cleveland Cavaliers (often “Cavs”).","zh":"“Cav”通常是“cavalry（骑兵/装甲骑兵）”的非正式缩写；有时也与NBA克利夫兰骑士队相关（球队常写“Cavs”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an informal short form of “cavalry” (mounted soldiers or military units that move quickly, traditionally on horses; in modern use often armored vehicles).","zh":"“cavalry（骑兵/装甲骑兵）”的非正式缩写，指行动快速的部队（传统为骑马士兵；现代也常指装甲骑兵）。"},"examples":[{"en":"The cav arrived fast and pushed the enemy back.","zh":"骑兵部队很快赶到，把敌军逼退了。"},{"en":"In many games, “cav” units are strong at charging.","zh":"在很多游戏里，“cav（骑兵）”单位擅长冲锋。"}]},{"partOfSpeech":"n.","definition":{"en":"a nickname for a member of the Cleveland Cavaliers basketball team (more commonly written as “Cav” for one player, “Cavs” for the team).","zh":"克利夫兰骑士队（Cleveland Cavaliers）球员的昵称（更常见写法：单个球员用“Cav”，球队整体常用“Cavs”）。"},"examples":[{"en":"He used to be a Cav before joining another team.","zh":"他以前是骑士队的一员，后来加入了别的球队。"},{"en":"Are you a Cavs fan?","zh":"你是骑士队球迷吗？"}]}],"synonyms":["cavalry","Cavs (Cleveland Cavaliers)"],"phonetic":"/kæv/","extraExplanation":["“cav”多见于口语、军队/游戏圈或聊天打字里；正式写作通常写全称“cavalry”。","大小写会影响含义：小写“cav”更像“cavalry”的缩写；大写“Cav/Cavs”常指NBA的克利夫兰骑士队。"]}
{"word":"cav","summary":{"en":"“cav” is usually an informal abbreviation for “cavalry,” and sometimes a short form related to “Cavalier(s)” (often the Cleveland Cavaliers).","zh":"“cav”通常是“cavalry（骑兵/骑兵部队）”的非正式缩写；有时也指与“Cavalier(s)”相关的简称（常见为克利夫兰骑士队）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbrev.) cavalry; soldiers who fight on horseback or in armored vehicles (military use).","zh":"（缩写）cavalry 的简写：骑兵；也可泛指装甲/侦察骑兵部队。"},"examples":[{"en":"He served in the Cav during his first tour.","zh":"他第一次服役时在骑兵部队（Cav）服役。"},{"en":"The Cav unit moved out at dawn.","zh":"骑兵部队在黎明时出动了。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) a short form of “Cavalier(s),” especially referring to the Cleveland Cavaliers (NBA) or a team named Cavaliers.","zh":"（非正式）“Cavalier(s)” 的简称，常指 NBA 的克利夫兰骑士队（Cleveland Cavaliers）或名为 Cavaliers 的队伍。"},"examples":[{"en":"Are you watching the Cavs game tonight?","zh":"你今晚看骑士队（Cavs）的比赛吗？"},{"en":"He’s a longtime Cavs fan.","zh":"他是多年的骑士队球迷。"}]}],"synonyms":["cavalry (full form)","Cavs (Cleveland Cavaliers, informal)"],"phonetic":"/kæv/","extraExplanation":["“cav”本身不是非常标准的词条，更常见于口语、短信、论坛或军事语境中的缩写。正式写作里建议写全称 cavalry / Cavaliers。","注意大小写：军事缩写里常写 Cav；球队通常写 Cavs（复数）更常见。"]}
{"word":"cava","summary":{"en":"Cava most commonly means Spanish sparkling wine made in the traditional method; less commonly it can mean a cellar/cave in Spanish contexts.","zh":"Cava 通常指西班牙传统法酿造的起泡酒；较少情况下可指西班牙语语境中的地窖/洞穴。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Spanish sparkling wine (usually made in Catalonia) produced by a traditional bottle-fermentation method similar to Champagne.","zh":"西班牙起泡酒（常产自加泰罗尼亚），采用与香槟类似的传统瓶中二次发酵法酿造。"},"examples":[{"en":"We ordered a bottle of cava to celebrate the promotion.","zh":"我们点了一瓶卡瓦起泡酒来庆祝升职。"},{"en":"Cava is often a more affordable alternative to Champagne.","zh":"卡瓦常被视为比香槟更实惠的替代选择。"},{"en":"She prefers dry cava with seafood.","zh":"她更喜欢用干型卡瓦搭配海鲜。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common in English) A cellar or cave, especially in Spanish/Catalan contexts.","zh":"（英语中较少见）地窖；洞穴（多见于西班牙语/加泰罗尼亚语语境）。"},"examples":[{"en":"The restaurant stores its wine in a cool cava underground.","zh":"这家餐厅把葡萄酒储存在地下凉爽的地窖里。"},{"en":"In some villages, old stone cavas were used to keep food fresh.","zh":"在一些村庄里，古老的石砌地窖曾用来保鲜食物。"}]}],"synonyms":["Spanish sparkling wine","sparkling wine","bubbly"],"phonetic":"/ˈkɑːvə/","extraExplanation":["“Cava”作为酒名通常不需要加冠词也可以：例如说“Let’s have cava.” 但更常见的表达是“a glass of cava / a bottle of cava”。","文化小贴士：卡瓦最常与西班牙的餐前小吃（tapas）或海鲜搭配。其常见葡萄品种包括 Macabeo、Xarel·lo、Parellada。","与“Champagne”的用法类似：严格来说，“cava”指符合西班牙产区与工艺规范的起泡酒，不是所有西班牙气泡酒都能叫 cava。"]}
{"word":"cavae","summary":{"en":"“Cavae” is a medical Latin plural, most often seen in “venae cavae,” referring to the body’s two main vena cavae that carry blood back to the heart.","zh":"“cavae”是医学拉丁语中的复数形式，最常见于“venae cavae”，指上、下腔静脉这两条将血液回流到心脏的大静脉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical Latin, plural noun) A plural form used in anatomy, most commonly in the phrase “venae cavae,” meaning the two large veins (the superior and inferior vena cava) that return blood to the heart.","zh":"（医学拉丁语，名词复数）解剖学中常见的复数形式，最常用于短语“venae cavae”，指两条将血液回流到心脏的大静脉：上腔静脉和下腔静脉。"},"examples":[{"en":"The CT scan showed a clot near the venae cavae.","zh":"CT 扫描显示血栓靠近腔静脉（venae cavae）附近。"},{"en":"Blood from the body returns to the heart through the venae cavae.","zh":"来自全身的血液通过腔静脉（venae cavae）回流到心脏。"}]}],"synonyms":["venae cavae"],"phonetic":"/ˈkeɪvi/","extraExplanation":["“cavae”本身在日常英语里几乎不会单独使用，更多是出现在拉丁/医学术语中（尤其是“venae cavae”）。","读音在英语医学语境里常按拉丁化读法来读，通常把“venae cavae”读成类似“VEE-nee KAY-vee”。","如果你原本想查的是“caveat”（警告、注意事项）或“cavea/caveae”（古罗马剧场的看台/座席区），也可能是拼写接近导致的混淆；告诉我上下文我可以帮你确认。"]}
{"word":"cavaedia","summary":{"en":"“cavaedia” is not a standard English word; it’s likely a misspelling or a proper name.","zh":"“cavaedia”不是标准英语单词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a name, or a term from another language. If you tell me where you saw it (sentence/context), I can identify the intended word.","zh":"这不是标准英语单词。它可能是拼写错误、人名，或来自其他语言的词。若你提供出现的语境（句子/来源），我可以帮你判断你想表达的词。"},"examples":[{"en":"I couldn’t find “cavaedia” in an English dictionary—could you share the sentence you saw it in?","zh":"我在英语词典里找不到“cavaedia”——你能把它出现的句子发我吗？"},{"en":"Did you mean “cavalcade” or “caveat”?","zh":"你想写的是“cavalcade”（车队/一长列）还是“caveat”（警告/注意事项）吗？"}]}],"phonetic":"/ˌkævəˈdiːə/","extraExplanation":["可能的目标词（取决于你的语境）：\n1) caveat（/ˈkeɪviæt/）：“警告；注意事项”，常见于正式写作：with the caveat that...（但要提醒的是……）。\n2) cavalcade（/ˌkævəlˈkeɪd/）：指“（节庆中的）车队/队伍；一长列人或物”。\n3) Cava（/ˈkɑːvə/）：西班牙起泡酒名（专有名词/外来词）。\n把原句贴出来，我可以根据上下文帮你精准匹配。"]}
{"word":"cavaedium","summary":{"en":"Cavaedium is a historical term for the central atrium/courtyard in a Roman house.","zh":"cavaedium 是指古罗马住宅中的中庭/内院（类似 atrium）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Roman architecture, historical) The central open court or atrium of a Roman house; an inner courtyard that brought light and air into the home.","zh":"（罗马建筑，历史用语）罗马住宅（domus）中部的中庭/内院；用于采光与通风的开放式庭院。"},"examples":[{"en":"In a traditional Roman domus, the cavaedium was the social and architectural heart of the house.","zh":"在传统的罗马式住宅中，cavaedium（中庭）既是社交中心，也是建筑的核心。"},{"en":"Rainwater could be collected in a basin beneath the opening of the cavaedium.","zh":"雨水可以从cavaedium（中庭）上方的开口落下，汇入下方的水池。"}]}],"synonyms":["atrium","courtyard","inner court"],"phonetic":"/kəˈviːdiəm/","extraExplanation":["这是拉丁语词（也常写作 cavædium / cavae dium 之类的变体），多见于古罗马建筑与考古、古典学写作中，现代英语日常不常用。","在罗马住宅里，它与 atrium（中庭）概念非常接近；许多资料会直接把 cavaedium 视为 atrium 的另一种说法或更古典的称呼。"]}
{"word":"Cavafy","summary":{"en":"Cavafy: a major Greek poet from Alexandria, known for thoughtful poems about history and the human experience.","zh":"Cavafy：来自埃及亚历山大的重要希腊诗人，以关于历史与人性体验的沉思诗作著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Constantine P. Cavafy (1863–1933), a Greek poet from Alexandria (Egypt), famous for reflective poems about history, desire, and the meaning of life’s journey.","zh":"卡瓦菲（Constantine P. Cavafy，1863–1933），出生并长期生活在埃及亚历山大的希腊诗人，以书写历史、欲望与人生旅程意义的沉思诗作闻名。"},"examples":[{"en":"In our literature class, we read Cavafy’s poem “Ithaka.”","zh":"在文学课上，我们读了卡瓦菲的《伊萨卡》。"},{"en":"Many readers know Cavafy for “Waiting for the Barbarians,” a poem about fear and politics.","zh":"很多读者因《等待蛮族》而认识卡瓦菲，这首诗写的是恐惧与政治。"},{"en":"Cavafy’s poems often use historical settings to talk about personal choices.","zh":"卡瓦菲的诗常用历史场景来谈个人选择。"}]}],"synonyms":["Constantine P. Cavafy","C. P. Cavafy","Kavafis","Cavafis"],"phonetic":"/kəˈvɑːfi/","extraExplanation":["“Cavafy”是英语中常见的拼写；他的希腊姓氏也常被转写为“Cavafis / Kavafis”。如果你在书店或学术文章中看到不同拼写，通常指的是同一位诗人。","卡瓦菲的代表作常被当作“人生建议”来读：例如《伊萨卡》强调旅程本身的价值；《等待蛮族》则常被引用来讨论社会如何制造“外部敌人”来维持秩序或权力。"]}
{"word":"caval","summary":{"en":"“Caval” is a rare, old-fashioned word meaning “horse,” mainly found in older or poetic writing.","zh":"“caval”是一个罕见的古旧词，意思是“马”，主要见于旧文本或诗歌化表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a horse (rare/archaic in modern English; mostly seen in older or poetic usage)","zh":"马（现代英语中很少用、偏古旧/诗歌用法）"},"examples":[{"en":"In some older texts, “caval” can mean a horse.","zh":"在一些较古老的文本里，“caval”可以表示“马”。"},{"en":"The knight mounted his caval and rode out at dawn. (archaic style)","zh":"骑士跨上他的马，拂晓时分出发。（古风表达）"}]}],"synonyms":["horse","steed (literary)"],"phonetic":"/kəˈvæl/","extraExplanation":["“caval”在现代英语里不常作为独立单词出现，更常见的是它作为词根出现在与“马、骑兵、骑士”相关的词里，例如：cavalry（骑兵）、cavalier（骑士/轻佻的）、cavalcade（马队/行进队伍）。","词源上与拉丁语 caballus（马）同源，也和法语/意大利语中表示“马”的词（如法语 cheval、意大利语 cavallo）有亲缘关系。"]}
{"word":"cavalcade","summary":{"en":"A “cavalcade” is a formal word for a parade or procession, or (figuratively) a long series of things happening one after another.","zh":"“cavalcade”指盛大的行列/游行/车队，也可比喻一连串接连发生的事。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A procession or parade of people, vehicles, or things moving forward together, often in a festive or impressive way.","zh":"（人、车辆或事物的）行列；车队；游行（常带有盛大、壮观的感觉）。"},"examples":[{"en":"A cavalcade of trucks rolled through the city to deliver supplies.","zh":"一支卡车车队驶过城市运送物资。"},{"en":"The festival opened with a cavalcade of dancers and musicians.","zh":"节日以舞者和乐手的盛大游行拉开序幕。"},{"en":"In the novel, a cavalcade of memories returns to him as he walks home.","zh":"在小说里，他走回家时，一连串记忆如行列般涌回心头。"}]},{"partOfSpeech":"n.","definition":{"en":"A series or succession of things that comes one after another (often used figuratively).","zh":"（比喻）一连串；接连不断的事物。"},"examples":[{"en":"After the announcement, a cavalcade of questions followed.","zh":"公告发布后，随之而来的是一连串问题。"},{"en":"The documentary shows a cavalcade of inventions that changed daily life.","zh":"纪录片展示了一连串改变日常生活的发明。"}]}],"synonyms":["parade","procession","motorcade","convoy","pageant","succession","stream"],"phonetic":"/ˌkævəlˈkeɪd/","extraExplanation":["“cavalcade”原本与骑马有关，来自法语/意大利语词根（与“cavalry 骑兵”同源），最初指骑马的队伍，后来也常指汽车等车辆的车队或更广义的“盛大行列”。","语体上偏正式，常见于新闻报道、文学描写或活动介绍中。日常口语里也可用“parade（游行）”“motorcade（车队）”“procession（行列）”等更常见词替换。"]}
{"word":"cavalcaded","summary":{"en":"“Cavalcaded” means “moved in a procession (often a grand parade of riders or vehicles),” and can also mean “passed by in a long series” figuratively.","zh":"“cavalcaded”表示“列队行进（常指盛大的骑马队伍或车队）”，也可比喻“一连串地涌现/接连出现”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(past tense of “cavalcade”) To ride or move in a group in a formal procession, especially on horseback or in vehicles.","zh":"（“cavalcade”的过去式）成队列行进；（尤指骑马或乘车）以仪仗式的队伍前进。"},"examples":[{"en":"The riders cavalcaded through the town square, waving to the crowd.","zh":"骑手们列队穿过城镇广场，向人群挥手致意。"},{"en":"The wedding cars cavalcaded down the main street, honking happily.","zh":"婚车队沿着主街列队前行，欢快地鸣笛。"}]},{"partOfSpeech":"vi.","definition":{"en":"(figurative) To appear or pass by in a long, impressive series.","zh":"（比喻）如长队般接连出现；一连串地涌现。"},"examples":[{"en":"Memories cavalcaded through her mind as she reread the letter.","zh":"她重读那封信时，回忆一幕幕在脑海中接连涌现。"},{"en":"One success cavalcaded after another during their best season.","zh":"在他们最辉煌的赛季里，成功接踵而至。"}]}],"synonyms":["paraded","processioned","rode in formation","moved in a motorcade","filed past"],"phonetic":"ˌkævəlˈkeɪdɪd","extraExplanation":["“cavalcade”原指盛大的骑马队伍（也可指车队），来自意大利语 *cavalcata*（骑马行列），与 *cavalry*（骑兵）、*cavalier*（骑士/彬彬有礼的人）同源。","“cavalcaded”在现代英语里不算常见，更常见的表达是 *paraded*, *rode in a procession*, *moved in a motorcade*。文学或新闻写作中偶尔用来制造“宏大队列感”。"]}
{"word":"cavalcades","summary":{"en":"Cavalcades are long, often impressive lines or processions of people, vehicles, or riders moving together.","zh":"cavalcades 指一长队（常很有排场的）人、车辆或骑马者一起行进的队伍/车队，也可指盛大的游行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long line of people, vehicles, or animals moving together (often in a formal or celebratory way)","zh":"（常指正式或庆祝场合的）一长队行进的人、车辆或骑马者；车队/队伍"},"examples":[{"en":"A cavalcade of cars followed the parade route.","zh":"一长串汽车车队沿着游行路线行驶。"},{"en":"The president arrived with a cavalcade of security vehicles.","zh":"总统在一队安保车辆的护送下到达。"},{"en":"We watched a cavalcade of bicycles pass by the park.","zh":"我们看到一长队自行车从公园旁经过。"}]},{"partOfSpeech":"n.","definition":{"en":"an impressive or colorful procession; a showy parade","zh":"（令人印象深刻的）盛大队列；华丽的游行"},"examples":[{"en":"The festival opened with a cavalcade of dancers and musicians.","zh":"节日以舞者与乐手组成的盛大游行拉开序幕。"},{"en":"A cavalcade of lanterns lit up the streets at night.","zh":"一场灯笼游行在夜晚点亮了街道。"}]}],"synonyms":["procession","parade","motorcade","convoy","train"],"phonetic":"/ˌkæv.əlˈkeɪd/","extraExplanation":["“cavalcade”常用于新闻或描写性文字，带有“规模大、很有排场”的感觉。它既可指真实的车队/队伍，也可用于更具画面感的“盛大游行”。","词源与骑马有关：来自法语/意大利语的词根与“骑士、骑马者（caval-）”相关，所以它常让人联想到骑兵或仪仗队那种整齐行进的场景。"]}
{"word":"cavalcading","summary":{"en":"“Cavalcading” describes people or vehicles moving together in a parade-like procession.","zh":"“cavalcading”指人或车辆像游行队伍一样成队前进。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"moving in a procession (a long line) of people, vehicles, or animals; traveling together like a parade","zh":"（人、车或骑手等）成队行进的；像游行队伍一样前进的"},"examples":[{"en":"A cavalcading line of motorcycles rolled through the town at sunset.","zh":"一长队摩托车在日落时分驶过小镇，像游行队伍一样前进。"},{"en":"We watched the cavalcading cars escort the athlete to the stadium.","zh":"我们看着成队的车辆护送那位运动员前往体育场。"}]},{"partOfSpeech":"v.","definition":{"en":"the present participle of “cavalcade”: to move or travel in a procession","zh":"“cavalcade”的现在分词：成队行进；列队前进"},"examples":[{"en":"The supporters were cavalcading behind the bus, honking and waving flags.","zh":"支持者们跟在大巴后面成队行进，按着喇叭、挥舞着旗帜。"},{"en":"News cameras followed crowds cavalcading down the main street.","zh":"新闻镜头跟拍人群沿着主街成队前进。"}]}],"synonyms":["processional","parading","marching","in convoy","in a motorcade"],"phonetic":"/ˌkævəlˈkeɪdɪŋ/","extraExplanation":["“cavalcading”来自名词/动词“cavalcade”（游行队伍、车队、骑马队），常用于描写“视觉上很壮观的长队伍在移动”。语气偏文学或新闻描写，比普通的“moving in a line”更有画面感。","词源上与拉丁语“caballus（马）”有关，早期多指骑马队伍；现代也常指车队（motorcade/convoy）或任何长队伍。"]}
{"word":"Cavalerius","summary":{"en":"“Cavalerius” is typically a Latin-style name linked to the idea of a knight/horseman, not a standard everyday English word.","zh":"“Cavalerius”通常是带拉丁风格的名字，含义常与“骑士/骑手”相关，但不是日常英语常用词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare Latinized form used as a name (proper noun), often built from the root meaning “horseman/knight.” It is not a common modern English word, so you’ll usually see it as a surname, character name, or stylized/academic Latin form.","zh":"一种较少见的拉丁化姓名（专有名词）形式，词根常与“骑士/骑手”有关。它不是现代英语中的常用词，通常作为姓氏、人物名或学术/风格化的拉丁形式出现。"},"examples":[{"en":"In the old manuscript, the author signs as “Cavalerius.”","zh":"在那份古老手稿中，作者署名为“Cavalerius”。"},{"en":"The game features a knight character named Cavalerius.","zh":"那款游戏里有一位名叫 Cavalerius 的骑士角色。"}]}],"synonyms":["cavalier","chevalier","knight"],"phonetic":"/ˌkævəˈlɪəriəs/","extraExplanation":["“Cavalerius”看起来像拉丁化形式：词根与拉丁语/罗曼语系中表示“骑士、骑兵、骑马的人”的词有关（可联想到英语 cavalier、以及法语 chevalier 等）。","后缀 -ius 常见于拉丁人名或拉丁化姓氏（如学术著作署名、古籍、徽章题词等），用来营造“古典/学术/贵族”风格。","如果你是在特定作品、家族谱系或某段文本里看到它，含义可能取决于作者设定或具体语境；你也可以提供出现的句子，我可以帮你更精准判断。"]}
{"word":"cavalero","summary":{"en":"Cavalero is an uncommon, old-fashioned word meaning a Spanish gentleman/knight or a chivalrous man.","zh":"cavalero 是个少见的古旧词，指西班牙绅士/骑士或有骑士风度的男子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic/Literary) A Spanish gentleman or knight; a chivalrous, courtly man (similar to a “caballero”).","zh":"（古旧/文学用语）西班牙绅士或骑士；举止彬彬、讲究骑士风度的男子（类似 caballero）。"},"examples":[{"en":"In the novel, the cavalero rides in to defend the village’s honor.","zh":"在小说里，那位 cavalero 骑马而来，捍卫村庄的荣誉。"},{"en":"She described him as a true cavalero—polite, brave, and generous.","zh":"她形容他是个真正的 cavalero——有礼、勇敢又慷慨。"}]}],"synonyms":["caballero","knight","gentleman","cavalier (literary)","chivalrous man"],"phonetic":"ˌkævəˈlɛroʊ","extraExplanation":["“cavalero”在现代英语里非常少见，多见于旧式/文学语境；日常表达更常用“caballero”（西班牙语借词，指绅士/骑士）或英语的“gentleman / knight / chivalrous man”。","词源上与“骑士/马术”概念相关：可联想英语词根“caval-”（与马有关，如 cavalry 骑兵、cavalier 骑士/轻佻的）。拼写上也常与“caballero”混用或被当作变体。"]}
{"word":"cavaleros","summary":{"en":"Caballeros (often misspelled as “cavaleros”) is Spanish for “gentlemen” and can also mean “knights,” used in English mainly for Spanish/Old West flavor or on signs.","zh":"Caballeros（常被误写为“cavaleros”）是西班牙语，意思是“先生们/绅士们”，也可指“骑士们”；在英语中多用于带西语/西部片风格的表达或标识用语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish; plural) gentlemen; polite form of address to a group of men, often used in a Spanish or “Old West” style.","zh":"（西班牙语；复数）绅士们、先生们；对一群男性的礼貌称呼，常带有西班牙语或“西部片/牛仔”风格。"},"examples":[{"en":"Caballeros, please take your seats.","zh":"先生们，请就座。"},{"en":"The sign said “Caballeros” and “Damas” for the restrooms.","zh":"标牌上写着“Caballeros（男厕）”和“Damas（女厕）”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Spanish; plural) knights; noble horsemen, especially in historical or romantic contexts.","zh":"（西班牙语；复数）骑士；（尤指）历史或浪漫语境中的高贵骑马武士。"},"examples":[{"en":"In the story, the caballeros swore loyalty to the king.","zh":"在故事里，骑士们向国王宣誓效忠。"},{"en":"The festival honored traditional caballeros on horseback.","zh":"节日向传统的骑马骑士致敬。"}]}],"synonyms":["gentlemen","sirs","knights"],"phonetic":"/ˌkɑːbəˈjɛroʊz/","extraExplanation":["“cavaleros”更常见的拼写是西班牙语“caballeros”。在英语环境里有时会直接借用，常见于西部片台词、拉美文化场景、餐厅/洗手间标识等。","单数是“caballero”（一位先生/骑士）。在标识上常与“damas”（女士们）对应。"]}
{"word":"Cavalier","summary":{"en":"“Cavalier” can mean (1) a courteous, chivalrous man, or (2) an attitude that is careless and dismissive of rules or risks.","zh":"“cavalier”既可指（1）殷勤有礼、骑士风度的男人，也可指（2）对规则或风险不在意、轻率自信的态度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person (often a man) who is polite and attentive to others, especially toward women; a chivalrous escort.","zh":"（常指男性）彬彬有礼、体贴周到的人；（对女性）殷勤的护花使者/陪伴者。"},"examples":[{"en":"He offered his seat to the elderly woman in a very cavalier way.","zh":"他很绅士地把座位让给了那位老人。"},{"en":"She arrived with a cavalier who held the door and carried her bag.","zh":"她和一位殷勤的男伴一起来，他替她开门并帮她拎包。"}]},{"partOfSpeech":"adj.","definition":{"en":"Showing a careless, overly confident attitude that ignores other people’s feelings, rules, or risks.","zh":"（态度）漫不经心的；轻率自信的；不把规则/风险/他人感受当回事的。"},"examples":[{"en":"It was cavalier of him to joke about the deadline.","zh":"他拿截止日期开玩笑，态度很轻率。"},{"en":"The report criticized the company for its cavalier approach to safety.","zh":"报告批评该公司对安全问题采取了漫不经心的态度。"}]}],"synonyms":["chivalrous","gallant","courteous","careless","dismissive","nonchalant"],"phonetic":"/ˌkævəˈlɪr/","extraExplanation":["“cavalier”一词来自与“骑士/骑马的人”相关的词源（同源词包括 cavalry“骑兵”）。因此它既能表达“骑士般的殷勤有礼”，也常引申为“自信到轻忽后果、对他人不够在意”的负面含义。","在文学与历史语境中，Cavalier 还可指英国17世纪英国内战时期支持国王查理一世的保王党（the Cavaliers），常与支持议会的一方 Roundheads 对立。"]}
{"word":"cavalier","summary":{"en":"Cavalier can mean a polite, romantic gentleman/escort, a Royalist in the English Civil War, or (as an adjective) a careless “too-casual” attitude.","zh":"cavalier 可指殷勤的绅士/护送者、英国内战时期的王党人，也可作形容词表示“轻率、满不在乎”的态度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A young man (historically) who is polite, romantic, and attentive to women; a gentleman or escort.","zh":"（历史或较正式用法）风度翩翩、对女性殷勤的年轻绅士；护送者、男伴。"},"examples":[{"en":"He offered his arm and walked her home like a cavalier.","zh":"他挽起她的手臂，像个殷勤的绅士一样送她回家。"},{"en":"In the novel, the cavalier promises to protect the heroine.","zh":"在小说里，那位风度翩翩的男主答应保护女主角。"}]},{"partOfSpeech":"n.","definition":{"en":"A supporter of King Charles I during the English Civil War; a Royalist.","zh":"（英国内战时期）支持查理一世的王党成员；保皇党人。"},"examples":[{"en":"The Cavaliers fought against the Parliamentarians in the 1640s.","zh":"17世纪40年代，王党军与议会派交战。"},{"en":"In some history books, “Cavalier” contrasts with “Roundhead.”","zh":"在一些历史书中，“Cavalier（王党）”与“Roundhead（圆颅党/议会派）”相对。"}]},{"partOfSpeech":"adj.","definition":{"en":"Showing a careless, overly confident attitude; not taking something seriously enough.","zh":"（态度）轻率的；满不在乎的；过于自信而不够谨慎的。"},"examples":[{"en":"Don’t be cavalier about safety rules.","zh":"别对安全规定满不在乎。"},{"en":"She sounded cavalier about the deadline, but the work was late.","zh":"她对截止日期说得轻描淡写，但工作还是拖延了。"}]}],"synonyms":["gentleman","escort","Royalist","careless","dismissive","nonchalant"],"phonetic":"/ˌkævəˈlɪr/","extraExplanation":["“cavalier”来自与“骑士/骑兵”相关的词源（和 horse、骑马的形象有关），所以名词义里常带有“骑士式的风度、护送、殷勤”的联想。","历史义：英国内战中“Cavaliers（王党）”常被描写为穿着讲究、讲礼仪的贵族形象；对应的对立称呼是“Roundheads（议会派）”。","语气提醒：形容词 cavalier 多为贬义，表示“轻率、不够重视”。如果想表达正面的“绅士风度”，更常用 gentlemanly、courteous 等。"]}
{"word":"cavaliere","summary":{"en":"Cavaliere is an Italian word meaning “knight,” and it can also be an Italian honorific title.","zh":"Cavaliere 是意大利语，意为“骑士”，也可指意大利的荣誉头衔（骑士称号）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Italian) a knight; also used as an Italian honorific title meaning “Knight,” given for certain orders of merit (often translated as “Sir”).","zh":"（意大利语）骑士；也可作意大利的荣誉头衔“Cavaliere（骑士）”，常授予功勋人士，英语里常译作“Sir（爵士/骑士）”。"},"examples":[{"en":"He was made a cavaliere for his service to Italian culture.","zh":"他因对意大利文化的贡献被授予“Cavaliere（骑士）”称号。"},{"en":"In Italy, “Cavaliere” can appear before a person’s name as a title.","zh":"在意大利，“Cavaliere”可以作为头衔放在人名前面使用。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common, especially in Italian contexts) the chess “knight.”","zh":"（较少见，多见于意大利语语境）国际象棋中的“马（knight）”。"},"examples":[{"en":"Move the cavaliere to attack the queen.","zh":"走马去攻击后。"},{"en":"The cavaliere jumps in an L-shape.","zh":"马走“日”字形。"}]}],"synonyms":["knight","Sir","chevalier"],"phonetic":"/ˌkævəˈljɛreɪ/","extraExplanation":["“Cavaliere”在意大利不仅是“骑士”的普通名词，也常指一种正式荣誉称号（例如意大利共和国功绩勋章中的等级之一：Cavaliere）。在英语文本里有时会保留意大利语原词，用来强调“意大利式的头衔/文化背景”。","英语里更常见的对应词是“knight / Sir”，而拼写相近的“cavalier”在英语中还可以作形容词，表示“漫不经心的、轻率的”，但这和意大利语头衔“cavaliere”不是同一个词义。"]}
{"word":"cavaliered","summary":{"en":"“Cavaliered” means “treated dismissively or too casually” (past tense of the verb “cavalier”).","zh":"“cavaliered”表示“以轻慢、过于随意的态度对待”（动词 cavalier 的过去式）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Past tense/past participle of “cavalier”) Treated someone or something in a dismissive, offhand, or overly casual way, as if it didn’t deserve serious attention.","zh":"（动词 cavalier 的过去式/过去分词）以轻慢、随意、无所谓的态度对待某人或某事；不当回事。"},"examples":[{"en":"The manager cavaliered the team’s concerns, saying they were “overreacting.”","zh":"经理对团队的担忧不以为然，说他们“反应过度”。"},{"en":"She felt he had cavaliered her request for help and changed the subject.","zh":"她觉得他轻慢地对待了她的求助请求，还把话题岔开了。"}]}],"synonyms":["dismissed","brushed off","shrugged off","belittled","treated lightly"],"phonetic":"/ˌkævəˈlɪrd/","extraExplanation":["“cavalier”既可作形容词（表示“轻慢的、满不在乎的”），也可作动词（表示“轻慢地对待/敷衍处理”）。“cavaliered”就是动词形式的过去式/过去分词，但在现代英语中相对少见，更常见的表达是用形容词：“He was cavalier about it.”","词源上与中古法语/拉丁语中“骑士、侍从”相关（类似 chevalier）。从“骑士式的洒脱/大胆”引申出“轻率、不够认真”的语气，所以用在批评别人态度时很常见。"]}
{"word":"cavalieres","summary":{"en":"“Cavalier” usually means (1) a gentleman companion/escort, (2) a mounted soldier, or (3) an attitude that is carelessly dismissive.","zh":"“cavalier”常见义为：(1)（社交场合）男伴/陪同者，(2) 骑兵/骑马的人，(3) 轻慢的、满不在乎的态度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a man who escorts a woman to a social event; a gentleman companion","zh":"（社交场合中）陪同女士出席活动的男伴；绅士陪同者"},"examples":[{"en":"She arrived at the ball with her cavalier.","zh":"她和她的男伴一起到达了舞会。"},{"en":"In old novels, a lady often enters with a cavalier at her side.","zh":"在一些旧小说里，女士常常挽着男伴登场。"}]},{"partOfSpeech":"n.","definition":{"en":"a horseman, especially a soldier who fights on horseback; cavalryman","zh":"骑马的人（尤指骑兵）；骑兵"},"examples":[{"en":"The cavaliers rode quickly across the field.","zh":"骑兵迅速穿过了田野。"},{"en":"The museum displays armor worn by cavaliers.","zh":"博物馆展出了骑兵穿过的盔甲。"}]},{"partOfSpeech":"adj.","definition":{"en":"showing a careless, dismissive attitude toward serious matters or other people’s feelings","zh":"对严肃问题或他人感受满不在乎的；轻慢的；不以为意的"},"examples":[{"en":"He was cavalier about the risks.","zh":"他对风险满不在乎。"},{"en":"Her cavalier reply upset the team.","zh":"她轻慢的回答让团队很不高兴。"}]}],"synonyms":["escort","companion","cavalryman","horseman","dismissive","careless"],"phonetic":"/ˌkævəˈlɪr/","extraExplanation":["你输入的“cavalieres”在英语里不算常见标准拼写。更常见的是：\n1) “cavaliers”＝“cavalier”的复数（男伴/骑兵等）。\n2) 如果来自法语“cavalières”（带重音），通常指“女骑手/（女士的）骑马靴”等语境，但那属于法语借词用法，需要看上下文。","词源提示：cavalier 与“cavalry（骑兵）”同源，都来自表示“马”的词根（经由拉丁语/意大利语等进入英语），所以很多含义都与“骑马的人、骑兵、贵族气质”有关。"]}
{"word":"Cavalieri","summary":{"en":"“Cavalieri” can mean Italian “knights” (plural of cavaliere) and also refers to “Cavalieri’s principle” in geometry about equal volumes from equal cross-sections.","zh":"“Cavalieri”既可指意大利语中“骑士”（cavaliere 的复数），也常指几何中的“卡瓦列里原理”，即由相同截面积推出体积相同的原理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Italian) a knight; a title of honor similar to “Sir,” used especially in Italy.","zh":"（意大利语）骑士；荣誉称号，类似英语的“Sir（爵士）”，尤用于意大利语境。"},"examples":[{"en":"In Italy, he was known as Cavaliere Rossi after receiving a national honor.","zh":"在意大利，他在获得国家荣誉后被称为“罗西骑士（Cavaliere Rossi）”。"},{"en":"The museum guide mentioned a cavaliere in a Renaissance portrait.","zh":"博物馆讲解员提到一幅文艺复兴肖像画中的一位骑士（cavaliere）。"}]},{"partOfSpeech":"n.","definition":{"en":"(math, usually in the phrase “Cavalieri’s principle”) a rule in geometry comparing volumes by comparing cross-sectional areas at the same height.","zh":"（数学，常见于短语“Cavalieri’s principle/卡瓦列里原理”）一种几何原理：若两立体在每一高度处的截面积都相等，则它们体积相等。"},"examples":[{"en":"We used Cavalieri’s principle to understand why two different-shaped solids can have the same volume.","zh":"我们用卡瓦列里原理来理解为什么两种不同形状的立体可能体积相同。"},{"en":"Cavalieri’s principle is often taught as an intuitive step toward integral calculus.","zh":"卡瓦列里原理常被作为理解积分思想的直观过渡。"}]}],"synonyms":["knight","chevalier","sir","Cavalieri’s principle"],"phonetic":"ˌkævəˈljɛəri","extraExplanation":["“Cavalieri”也常见作人名或姓氏，最著名的是17世纪意大利数学家 Bonaventura Cavalieri（博纳文图拉·卡瓦列里），其名字用于命名“Cavalieri’s principle（卡瓦列里原理）”。","在意大利语中，单数常写作 cavaliere，复数为 cavalieri；英语里借用时有时会保留意大利拼写与含义。"]}
{"word":"cavalieri","summary":{"en":"“Cavalieri” usually refers to Cavalieri’s principle in math, or to the Italian mathematician Bonaventura Cavalieri.","zh":"“Cavalieri”通常指数学中的“卡瓦列里原理”，也可指意大利数学家博纳文图拉·卡瓦列里。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(math) Cavalieri’s principle: If two solids have the same height and the same cross-sectional area at every level (same distance from the base), then they have the same volume. It’s often used to find volumes by comparing shapes.","zh":"（数学）卡瓦列里原理：若两个立体高度相同，并且在每一个同样高度处的截面积都相同，那么它们的体积相同。常用来通过“比较形状”来求体积。"},"examples":[{"en":"Using Cavalieri’s principle, we can show a cylinder and a “sheared” cylinder have the same volume.","zh":"利用卡瓦列里原理，我们可以证明一个圆柱体和一个“斜切/错切”的圆柱体体积相同。"},{"en":"In calculus, this idea is closely related to finding volume by slicing.","zh":"在微积分里，这个思想和用“切片法”求体积密切相关。"}]},{"partOfSpeech":"n.","definition":{"en":"Bonaventura Cavalieri (1598–1647), an Italian mathematician whose work influenced early integral calculus; his name appears in the term “Cavalieri’s principle.”","zh":"博纳文图拉·卡瓦列里（1598–1647），意大利数学家；他的研究影响了早期的积分思想，因此有“卡瓦列里原理”这一术语。"},"examples":[{"en":"Cavalieri is often mentioned in histories of geometry and early calculus.","zh":"在几何学和早期微积分的历史中，经常会提到卡瓦列里。"}]}],"synonyms":["Cavalieri’s principle","method of slices","slicing method"],"phonetic":"/ˌkævəˈljɛri/","extraExplanation":["“Cavalieri”常见于英文数学课本里，多半指“Cavalieri’s principle（卡瓦列里原理）”。它强调“同高处截面积相同 → 体积相同”，是后来积分法（用无数个薄切片累加）的直观基础。","读音上英语里通常重音落在倒数第二个音节附近；同时它也是意大利姓氏。","有时你会看到拼写形式如 Cavalieri’s principle（带所有格）或 Cavalieri principle（不带所有格）。"]}
{"word":"cavaliering","summary":{"en":"Cavaliering means acting in a dismissive, careless, or arrogantly offhand way.","zh":"cavaliering 指以轻慢、敷衍或带点傲慢的态度对待人或事。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Present participle) acting in a careless, dismissive, or arrogant way toward people, rules, or risks.","zh":"（现在分词）以轻率、敷衍或傲慢的态度对待他人、规矩或风险。"},"examples":[{"en":"He was cavaliering through the safety briefing, as if it didn’t matter.","zh":"他对安全简报敷衍了事，好像这不重要一样。"},{"en":"She apologized for cavaliering his concerns during the meeting.","zh":"她为在会议中轻慢他的担忧而道歉。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Adjective) showing an offhand or superior attitude; not taking something seriously enough.","zh":"（形容词）表现出漫不经心或自以为是的态度；对事情不够重视。"},"examples":[{"en":"His cavaliering tone made the team feel unheard.","zh":"他那种轻慢的语气让团队觉得自己的声音没有被听见。"},{"en":"A cavaliering approach to deadlines often causes problems later.","zh":"对截止日期抱着轻率态度，往往会在之后引发问题。"}]}],"synonyms":["dismissive","offhand","nonchalant","arrogant","casual about"],"phonetic":"/ˌkævəˈlɪrɪŋ/","extraExplanation":["“cavaliering”来自“cavalier”。词根与法语/拉丁语中“骑士、骑马的人”有关，最早带有“潇洒的骑士气派”的意味；但在现代英语里更常见的是贬义，指对他人感受、规则或危险“轻慢、不当回事”。","历史上英国内战时期的“Cavaliers”指支持查理一世的王党派（与“Roundheads”相对）。这一文化背景让“cavalier”在英语里也逐渐带上了“傲慢、不把别人放在眼里”的色彩。"]}
{"word":"cavalierish","summary":{"en":"Cavalierish means somewhat cavalier—often casually dismissive or unconcerned (sometimes showily confident).","zh":"cavalierish 表示“有点轻慢/满不在乎的（带轻率或傲慢感）”，偶尔也指“有点潇洒招摇的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Showing a casual, dismissive attitude; not taking something seriously enough (often sounding a bit arrogant or unconcerned).","zh":"态度轻慢的；满不在乎的（常带一点傲慢或不在意、对问题不够重视）。"},"examples":[{"en":"His cavalierish response made it seem like the deadline didn’t matter.","zh":"他那种轻慢的回应让人觉得截止日期根本不重要。"},{"en":"Don’t be cavalierish about safety rules—they exist for a reason.","zh":"别对安全规定满不在乎——它们存在是有原因的。"}]},{"partOfSpeech":"adj.","definition":{"en":"Somewhat like a “cavalier” in style: confident and charming in a showy way (less common).","zh":"带点“骑士/风流骑士”式的派头：自信、潇洒，略显招摇（较少见）。"},"examples":[{"en":"He had a cavalierish flair, tipping his hat as he greeted everyone.","zh":"他有点潇洒的派头，向每个人打招呼时还会微微掀帽致意。"}]}],"synonyms":["dismissive","nonchalant","casual","offhand","reckless","insouciant"],"phonetic":"/ˌkævəˈlɪrɪʃ/","extraExplanation":["“cavalierish”由“cavalier（骑士；对人或事不够认真、显得轻慢的人）+ -ish（有点……的）”构成，语气通常表示“有点像……但不完全是……”。在现代英语里，这个词更常带负面意味，强调“轻率、对后果不够在意”。","近义词里，“cavalier”本身更常用；“cavalierish”听起来更像一种描述语气，用来弱化或模糊程度（= 有点轻慢）。"]}
{"word":"cavalierishness","summary":{"en":"Cavalierishness means a casually unconcerned or slightly disrespectful attitude, especially toward serious matters.","zh":"cavalierishness 指对严肃问题漫不经心、轻慢敷衍的态度或行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A casual, carefree, or slightly disrespectful attitude or way of behaving, often showing a lack of serious concern for rules, risks, or other people’s feelings.","zh":"（对规则、风险或他人感受）漫不经心、满不在乎，甚至有点轻慢无礼的态度或行为。"},"examples":[{"en":"His cavalierishness about safety rules made his coworkers uneasy.","zh":"他对安全规定的漫不经心让同事们感到不安。"},{"en":"People criticized the company’s cavalierishness in handling customer complaints.","zh":"人们批评这家公司处理客户投诉时态度敷衍、轻慢。"},{"en":"She apologized for her cavalierishness and promised to take the issue seriously.","zh":"她为自己的轻率态度道歉，并承诺会认真对待这个问题。"}]}],"synonyms":["carelessness","nonchalance","insouciance","dismissiveness","recklessness"],"phonetic":"/ˌkævəˈlɪrɪʃnəs/","extraExplanation":["“cavalierishness”来自形容词“cavalier”（轻慢的、满不在乎的）+ “-ish”（有点像）+ 名词后缀“-ness”。语气通常偏负面，暗示“不够认真”“不够尊重”。\n\n历史上“cavalier”最初指“骑士、绅士”，也曾指英国内战时期支持国王的“保皇党（Cavaliers）”。后来词义发展出“潇洒不拘”乃至“对后果不在乎”的含义；现代英语里多用后者。"]}
{"word":"cavalierism","summary":{"en":"Cavalierism is a noun meaning a dismissive, risk-ignoring attitude; historically, it can also mean the courtly “cavalier” style and values.","zh":"cavalierism 作名词，常指对风险或规则的轻慢与满不在乎；在历史语境中也可指“宫廷派/骑士作风”的风度与价值观。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually disapproving) A careless, overly confident attitude that shows little concern for risks, rules, or other people’s feelings.","zh":"（通常含贬义）一种轻率、自负、满不在乎的态度，对风险、规则或他人感受缺乏重视。"},"examples":[{"en":"His cavalierism about safety rules worried the whole team.","zh":"他对安全规定的轻慢态度让整个团队都很担心。"},{"en":"She criticized the company’s cavalierism toward customer complaints.","zh":"她批评公司对顾客投诉的漠视态度。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical) The values and behavior associated with a “cavalier” (a courtly gentleman or royalist supporter in 17th-century England), emphasizing stylishness, bravery, and polite manners.","zh":"（历史义）与“cavalier”（17世纪英格兰的宫廷绅士或保王党支持者）相关的价值观与行为方式，强调风度、勇敢与礼仪。"},"examples":[{"en":"In the novel, cavalierism is linked with elegant dress and loyalty to the king.","zh":"在小说中，“cavalierism”与华丽服饰和对国王的忠诚联系在一起。"},{"en":"The historian contrasts Puritan seriousness with the cavalierism of the royal court.","zh":"历史学家把清教徒的严肃与王室宫廷的“cavalierism（骑士/宫廷派作风）”作对比。"}]}],"synonyms":["recklessness","carelessness","nonchalance","indifference"],"phonetic":"/ˌkævəˈlɪrɪzəm/","extraExplanation":["词源提示：cavalierism 来自 cavalier，最早与“骑士、骑马的绅士”有关（与法语/拉丁语中“马、骑兵”的词根相关）。因此它既可指历史上的“宫廷派/骑士作风”，也常引申为现代英语中带贬义的“轻慢、满不在乎”。","用法建议：在现代新闻和评论里，cavalierism 多用于批评态度（例如对安全、法律、健康风险、公共利益的忽视）。如果你想表达“潇洒自信”但不带批评色彩，通常会改用 confidence / nonchalance / relaxed attitude 等更中性的词。","相关词与搭配：cavalier（adj.）= “轻慢的；满不在乎的”；be cavalier about sth = “对某事满不在乎”。近义（视语境）：recklessness（鲁莽）、carelessness（粗心）、nonchalance（冷漠/若无其事）。反义：caution（谨慎）、respect（尊重）、seriousness（严肃认真）。"]}
{"word":"cavalierly","summary":{"en":"Cavalierly means acting or speaking in a careless, dismissive way, not taking something (or someone) seriously enough.","zh":"cavalierly 表示（说话或做事）轻率、漫不经心、带轻慢态度，没有认真对待事情或他人。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a careless, casual, or dismissive way, showing little concern for other people’s feelings, safety, or the seriousness of a situation.","zh":"以漫不经心、随便或轻慢的方式；对他人感受、安全或事情的严重性缺乏重视。"},"examples":[{"en":"He spoke cavalierly about the layoffs, as if people’s lives weren’t affected.","zh":"他轻描淡写地谈裁员，好像这不会影响人们的生活一样。"},{"en":"The company cavalierly ignored the safety warnings.","zh":"公司对安全警告置若罔闻，态度很轻率。"}]}],"synonyms":["carelessly","dismissively","nonchalantly","recklessly","offhandedly"],"phonetic":"/ˌkævəˈlɪrli/","extraExplanation":["“cavalierly”通常带负面评价，暗示一种“轻率又有点傲慢/不把别人当回事”的语气。","词源上与“cavalier”（原指骑士/骑兵，后来也指举止潇洒但可能轻佻的人）有关，因此有时带一点“潇洒到不负责任”的意味。"]}
{"word":"cavalierness","summary":{"en":"Cavalierness means a careless, offhand, or dismissive attitude, especially toward something serious or important.","zh":"Cavalierness 指对严肃或重要事情表现出的满不在乎、轻率或轻慢的态度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of seeming careless or not worried about something important; an offhand attitude","zh":"（对重要事情）满不在乎、漫不经心的态度；轻率"},"examples":[{"en":"His cavalierness about safety rules made everyone nervous.","zh":"他对安全规定的满不在乎让大家都很紧张。"},{"en":"The company’s cavalierness toward customer complaints damaged its reputation.","zh":"这家公司对客户投诉的敷衍态度损害了名声。"}]},{"partOfSpeech":"n.","definition":{"en":"the quality of appearing overly confident, dismissive, or slightly arrogant","zh":"（说话/做事）过于自信、轻慢甚至有点傲慢的态度"},"examples":[{"en":"Her cavalierness in the meeting sounded dismissive, even if she didn’t mean it that way.","zh":"她在会议上的轻慢语气听起来很不尊重人，尽管她未必有这个意思。"}]}],"synonyms":["carelessness","nonchalance","indifference","dismissiveness","recklessness"],"phonetic":"/ˌkævəˈlɪrnəs/","extraExplanation":["cavalierness 来自形容词 cavalier（“满不在乎的；轻慢的”）。更早的词源与“骑士/骑兵”有关：早期的 cavalier 可指“骑士般潇洒的人”，后来逐渐带上“轻率、目中无人”的语气色彩，因此现代用法多偏负面。","学习提示：cavalierness 常用来批评对风险、规则、他人感受不够重视的态度。更自然的常见替换有 carelessness（粗心）、nonchalance（若无其事）、dismissiveness（轻视/敷衍）。"]}
{"word":"cavaliernesses","summary":{"en":"“Cavaliernesses” is the plural of “cavalierness,” meaning careless casualness or arrogant disregard.","zh":"“cavaliernesses”是“cavalierness”的复数，指漫不经心的草率态度或傲慢轻视、无视规则的态度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being casual and careless about important matters (often showing a lack of concern for consequences or other people’s feelings).","zh":"（对重要事情）漫不经心、草率的态度；常带有对后果或他人感受不够在意之意。"},"examples":[{"en":"The report criticized the cavaliernesses in how the data was handled.","zh":"报告批评了在处理数据时那种种漫不经心的做法。"},{"en":"Her cavalierness about deadlines frustrated the whole team.","zh":"她对截止日期的漫不经心让整个团队很沮丧。"}]},{"partOfSpeech":"n.","definition":{"en":"An attitude of arrogant disregard; behaving as if rules or criticism do not matter.","zh":"傲慢轻视、目中无人的态度；表现得仿佛规则或批评都不重要。"},"examples":[{"en":"His cavalierness in the meeting sounded like he didn’t respect anyone else’s opinion.","zh":"他在会议上的那种傲慢轻视，听起来像是不尊重别人的观点。"},{"en":"The judge warned him that cavalierness toward the law would not be tolerated.","zh":"法官警告他，对法律的轻慢态度不会被容忍。"}]}],"synonyms":["carelessness","nonchalance","indifference","insouciance","disregard","recklessness"],"phonetic":"/ˌkævəˈlɪrnəs/","extraExplanation":["“cavaliernesses”是名词复数，来自形容词“cavalier”（漫不经心的/傲慢轻视的）+ 名词后缀“-ness”（表示“……的状态/性质”）再加复数“-es”。日常写作里更常用不可数形式“cavalierness”。"]}
{"word":"cavaliero","summary":{"en":"Cavaliero is a rare/archaic word meaning a knight or cavalier (a mounted gentleman), sometimes implying bold, slightly careless confidence.","zh":"cavaliero 是一个罕见/古旧词，指“骑士/骑马的绅士”（类似 cavalier），有时也可含“大胆、自信甚至有点轻率”的语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic/rare) A knight or gentleman on horseback; a “cavalier.”","zh":"（古旧/罕见）骑士；骑马的绅士；相当于“cavalier（骑士/骑手）”。"},"examples":[{"en":"In the old story, a cavaliero rode into town to defend the weak.","zh":"在那个古老的故事里，一位cavaliero骑马进城，保护弱者。"},{"en":"The poem describes the cavaliero as brave but proud.","zh":"诗中把这位cavaliero写得勇敢却傲慢。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A man with a bold, confident, sometimes slightly careless manner.","zh":"（罕见）举止大胆、自信，有时带点轻率的人。"},"examples":[{"en":"He spoke like a cavaliero, sure that the rules didn’t apply to him.","zh":"他说话像个cavaliero，自信到觉得规则对他不适用。"}]}],"synonyms":["cavalier","knight","horseman","gentleman"],"phonetic":"/ˌkævəˈlɪroʊ/","extraExplanation":["“cavaliero”在现代英语中非常少见，更多时候你会看到“cavalier”（更常用）或意大利语“cavaliere”、西班牙语“caballero”（都可指“骑士/绅士”）。如果你是在文学作品、旧译本或历史语境里看到它，通常就是“骑士/骑马的绅士”的意思。","词源上与拉丁语“caballus（马）”有关，因此常带有“骑马的人/骑士阶层”的文化联想。写作时除非刻意营造古风，否则建议用更常见的“cavalier”或直接用“knight”。"]}
{"word":"cavaliers","summary":{"en":"“Cavaliers” can mean Royalist supporters in the English Civil War, mounted soldiers/knights, people who act carelessly, or the Cleveland Cavaliers NBA team; “cavalier” also works as an adjective meaning offhand or dismissive.","zh":"“cavaliers”可指英国内战时期的保皇党、（史/文）骑兵/骑士、轻率行事的人，也可指NBA克利夫兰骑士队；“cavalier”作形容词表示轻率、漠不关心。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member or supporter of the English Royalist party during the English Civil War (17th century)","zh":"（英国内战时期的）保皇党支持者；王党派成员"},"examples":[{"en":"In the novel, the hero’s family were Cavaliers who supported King Charles I.","zh":"在小说里，男主的家族是保皇党，支持查理一世。"},{"en":"The Cavaliers and the Roundheads fought over the future of England’s government.","zh":"保皇党与圆颅党为英格兰政府的未来而交战。"}]},{"partOfSpeech":"n.","definition":{"en":"mounted soldiers or knights; horsemen (historical or literary use)","zh":"（史/文）骑兵；骑士；骑马作战的人"},"examples":[{"en":"A group of cavaliers rode across the field at dawn.","zh":"一群骑兵在黎明时骑马穿过田野。"},{"en":"The painting shows cavaliers in armor, carrying long swords.","zh":"这幅画描绘了身披铠甲、佩长剑的骑士们。"}]},{"partOfSpeech":"n.","definition":{"en":"people who behave in a careless or overly casual way, especially showing little concern for others (often disapproving)","zh":"（常含贬义）态度轻率、满不在乎的人；对他人感受不在意的人"},"examples":[{"en":"Some critics called the executives cavaliers who ignored the risks.","zh":"一些批评者称这些高管轻率行事、无视风险。"},{"en":"He spoke like a cavalier, as if the problem didn’t matter.","zh":"他说话很轻佻，仿佛问题无关紧要。"}]},{"partOfSpeech":"n.","definition":{"en":"the NBA team name: the Cleveland Cavaliers (often shortened to “the Cavs”)","zh":"（专有名词）克利夫兰骑士队（NBA，常简称 The Cavs）"},"examples":[{"en":"The Cavaliers play their home games in Cleveland.","zh":"骑士队在克利夫兰进行主场比赛。"},{"en":"She’s been a Cavaliers fan since she was a kid.","zh":"她从小就是骑士队的球迷。"}]},{"partOfSpeech":"adj.","definition":{"en":"showing a careless, dismissive attitude; too casual about serious matters (disapproving)","zh":"（态度）轻率的；漠不关心的；对严肃事情过于随便的（含贬义）"},"examples":[{"en":"A cavalier attitude toward safety can cause accidents.","zh":"对安全问题轻率的态度可能导致事故。"},{"en":"Don’t be cavalier about other people’s feelings.","zh":"别对别人的感受满不在乎。"}]}],"synonyms":["royalists","horsemen","knights","riders","the Cavs","carefree (adj.)","offhand (adj.)","dismissive (adj.)"],"phonetic":"/ˌkævəˈlɪrz/","extraExplanation":["“cavalier”来自法语 chevalier（骑士），词根与“horse（马）”相关，所以早期含义与“骑马的战士/骑士”有关。后来在英国历史语境中特指英国内战时期的“保皇党（Cavaliers）”。","在文学作品里（尤其是描写17世纪英国或宫廷风格的作品），“Cavaliers vs. Roundheads（保皇党 vs. 圆颅党）”是常见的历史对立表达。","口语里说某人“cavalier”多为批评，强调“轻率、漫不经心”，并不等同于“随和/放松（relaxed）”。"]}
{"word":"cavaliership","summary":{"en":"Cavaliership means the manner or attitude of a cavalier—gallant, proud, or sometimes dismissively careless.","zh":"Cavaliership 指“cavalier（骑士/殷勤或轻率的人）”那种作风：可能是骑士风度与自信，也可能带点傲慢和不在乎。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the attitude, behavior, or qualities of a cavalier person—especially a proud, gallant, or slightly careless/overconfident manner","zh":"（尤指）轻骑士式的态度或作风；带有骄傲、殷勤（骑士风度）或有点轻率自信的举止"},"examples":[{"en":"His cavaliership made him seem charming, but also a little too sure of himself.","zh":"他的“骑士式作风”让他显得很有魅力，但也有点过于自信。"},{"en":"She disliked the cavaliership with which he dismissed other people’s concerns.","zh":"她不喜欢他那种轻描淡写、把别人的担忧一笔带过的轻率态度。"}]}],"synonyms":["cavalierness","nonchalance","swagger","gallantry"],"phonetic":"/ˌkævəˈlɪrʃɪp/","extraExplanation":["“cavaliership”是比较少见的名词，来自“cavalier”（原指骑兵/骑士，后也可指对人殷勤有礼的人，或指态度轻率、不够认真的人）。在英国历史语境里，Cavaliers（保王党）与Roundheads（议会派）对立，这也让“cavalier”一词带上了某种“潇洒、傲气、无所谓”的色彩。"]}
{"word":"cavalla","summary":{"en":"Cavalla is a borrowed term (often from Italian) for a mackerel-type fish, commonly mentioned in Mediterranean food contexts.","zh":"Cavalla多为借自意大利语的说法，指一种鲭鱼/竹荚鱼等鲭科或近似鱼类，常出现在地中海饮食语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of fish (mackerel or horse mackerel), especially in Mediterranean/Italian contexts; often used as a food fish","zh":"（多用于地中海/意大利语境）一种鲭鱼或竹荚鱼（马鲛/鰺类等），常作为食用鱼"},"examples":[{"en":"We grilled cavalla with lemon and olive oil.","zh":"我们把cavalla用柠檬和橄榄油烤着吃。"},{"en":"In some Italian markets, cavalla is sold fresh early in the morning.","zh":"在一些意大利市场里，cavalla清晨会以鲜鱼出售。"}]}],"synonyms":["mackerel","horse mackerel"],"phonetic":"/kəˈvɑːlə/","extraExplanation":["“cavalla”最常见是意大利语词汇：在意大利日常用法里常指“鲭鱼/马鲛类（mackerel）”或与之相近的鱼。英文里偶尔会直接借用这个词，尤其出现在菜单、食谱、海鲜市场或旅行语境中。","如果你在菜单上看到cavalla，点餐时可理解为“味道较浓、油脂较足的青皮鱼”，烹饪上常见做法是炭烤、煎、腌制（配柠檬、橄榄油、香草）。不同地区可能对应不同具体鱼种，因此也可询问店家英文名称（mackerel / horse mackerel）。"]}
{"word":"Cavallaro","summary":{"en":"“Cavallaro” is most commonly an Italian surname; less commonly, it can refer (from Italian) to a horseman or someone who works with horses.","zh":"“Cavallaro”最常见用法是意大利姓氏；较少见时（源自意大利语）可指骑马的人或与马相关的从业者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), most often of Italian origin.","zh":"（常见于意大利裔的）姓氏。"},"examples":[{"en":"Dr. Cavallaro will speak at the conference tomorrow.","zh":"Cavallaro 医生将于明天在会议上发言。"},{"en":"My neighbor’s last name is Cavallaro.","zh":"我邻居的姓是 Cavallaro。"}]},{"partOfSpeech":"n.","definition":{"en":"(from Italian, less common in English) a horseman; someone who works with horses.","zh":"（源自意大利语，在英语中较少见）骑马的人；与马打交道的人、马夫。"},"examples":[{"en":"In the story, the cavallaro delivers messages on horseback.","zh":"在故事里，那位 cavallaro 骑马送信。"},{"en":"The museum label mentions a “cavallaro,” meaning a horseman in Italian.","zh":"博物馆的标签提到“cavallaro”，在意大利语里意思是“骑士/骑马的人”。"}]}],"synonyms":["(surname)","horseman"],"phonetic":"/ˌkævəˈlɑːroʊ/","extraExplanation":["“Cavallaro”来自意大利语词根 cavallo（马），与英语的 cavalry（骑兵）在意义上有亲缘关系。作为姓氏时通常不翻译。","读到人名/姓氏时，一般重读在中间音节：ca-val-LA-ro（英语发音会因地区与家族习惯略有不同）。"]}
{"word":"cavallas","summary":{"en":"Cavallas = plural of cavalla: a kind of mackerel (often king mackerel).","zh":"cavallas 是 cavalla 的复数：一种鲭鱼（常指王鲭/king mackerel）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of mackerel (a large, fast ocean fish) found in warm seas; often called “king mackerel.”","zh":"一种鲭鱼（大型、游速快的海鱼），常见于温暖海域；也常指“王鲭（king mackerel）”。"},"examples":[{"en":"We grilled cavalla with lemon and herbs.","zh":"我们用柠檬和香草烤了王鲭（cavalla）。"},{"en":"Cavallas are popular in coastal seafood markets.","zh":"在沿海的海鲜市场里，cavalla（王鲭）很受欢迎。"}]}],"synonyms":["king mackerel","mackerel"],"phonetic":"/kəˈvælə/","extraExplanation":["“cavalla”在英语里比较少见，多见于海鲜、钓鱼或沿海地区的用法；“cavallas”通常是复数形式。","词源与地中海/伊比利亚地区语言有关（与意大利语、葡萄牙语/西班牙语中指鲭鱼的词有联系），因此在菜单或地方性英语里更常见。"]}
{"word":"cavallies","summary":{"en":"“Cavalier(s)” can mean horse soldiers or (historically) supporters of King Charles I, and as an adjective it means ‘carelessly unconcerned.’ Your spelling “cavallies” is likely a misspelling of “cavaliers.”","zh":"“cavalier(s)”可指骑兵/骑马的士兵、（历史上）英国内战时期的保王党人；作形容词表示“漫不经心、掉以轻心”。你写的“cavallies”很可能是“cavaliers”的拼写错误。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A soldier on horseback; a horseman, especially in past wars.","zh":"（旧时战争中的）骑兵；骑马的士兵。"},"examples":[{"en":"In the story, a group of cavaliers rode across the valley at dawn.","zh":"在故事里，一队骑兵在黎明时骑马穿过山谷。"},{"en":"The museum has paintings of cavaliers in armor.","zh":"博物馆里有穿着盔甲的骑兵画像。"}]},{"partOfSpeech":"n.","definition":{"en":"A supporter of King Charles I during the English Civil War (1642–1651).","zh":"（英国内战时期）查理一世的支持者；保王党人。"},"examples":[{"en":"The novel describes conflict between the Roundheads and the Cavaliers.","zh":"这部小说描写了圆颅党与保王党之间的冲突。"}]},{"partOfSpeech":"adj.","definition":{"en":"Showing a careless attitude, as if something is not important.","zh":"漫不经心的；对重要事情显得不在乎的。"},"examples":[{"en":"He was cavalier about the deadline, which worried his team.","zh":"他对截止日期漫不经心，让团队很担心。"},{"en":"Don’t be cavalier with safety rules.","zh":"不要对安全规定掉以轻心。"}]}],"synonyms":["horseman","cavalryman","royalist","nonchalant","careless"],"phonetic":"/ˌkævəˈlɪr/","extraExplanation":["你输入的“cavallies”通常是拼写错误，更常见的拼写是“cavaliers”（复数）或“cavalier”（单数）。","“Cavalier”在历史语境里常指英国内战中的保王党；在现代日常英语中更常用作形容词，表示“对事不够认真/太随意”。","词源上与“骑士/骑马的人”有关（来自法语与意大利语中“骑马的人”的词）。","在美国文化里，“Cavaliers”也是克利夫兰职业篮球队（Cleveland Cavaliers）的队名；如果你指的是球队，也可以告诉我具体句子或语境。"]}
{"word":"cavally","summary":{"en":"Cavalry means soldiers who fight on horseback, or modern fast-moving army units (often with armored vehicles).","zh":"Cavalry 指“骑兵”，也可指现代军队中具快速机动能力的部队（常用装甲车辆）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group of soldiers who fight on horseback, or (in modern armies) a unit that moves quickly using vehicles such as tanks or armored cars","zh":"骑兵；（现代军队中）机动作战部队（如装甲兵/快速机动部队）"},"examples":[{"en":"In the movie, the cavalry arrives just in time to save the town.","zh":"在电影里，骑兵及时赶到，救了小镇。"},{"en":"Historically, cavalry soldiers were trained to fight from horseback.","zh":"从历史上看，骑兵受训要在马背上作战。"},{"en":"Modern cavalry units may use armored vehicles instead of horses.","zh":"现代“骑兵”部队可能使用装甲车而不是马。"}]}],"synonyms":["mounted troops","horse soldiers","armored unit","reinforcements"],"phonetic":"/ˈkævəlri/","extraExplanation":["你输入的 **cavally** 通常是拼写错误；最常见的正确拼法是 **cavalry**（骑兵）。","**cavalry** 的常见发音节奏接近“CAV-uhl-ree”，中间的 **-al-** 读成弱读的 /əl/，不是每个字母都清晰发音。","在英语里它也常出现在比喻用法中：**the cavalry** 指“救援/支援力量”（比如“援军到了”）。"]}
{"word":"cavalries","summary":{"en":"“Cavalries” is the plural of “cavalry,” meaning multiple cavalry forces/units.","zh":"“cavalries”是“cavalry”的复数，指多支骑兵（或机动装甲）部队。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “cavalry”: groups of soldiers who fight on horseback (historically) or in fast-moving armored units (modern use).","zh":"“cavalry”的复数：骑兵部队（历史上骑马作战）或快速机动的装甲/机械化部队（现代用法）。"},"examples":[{"en":"In the old war stories, the cavalries charged across the field at dawn.","zh":"在老战争故事里，骑兵部队在黎明时冲过战场。"},{"en":"Several cavalries were stationed near the border to respond quickly.","zh":"几支骑兵/机动部队被部署在边境附近，以便快速反应。"}]}],"synonyms":["cavalry units","mounted troops","horsemen (historical)","armored units (modern)"],"phonetic":"/ˈkævəlriz/","extraExplanation":["“cavalry”在英语里更常见的是集合名词（collective noun），很多时候不加复数也能表示“骑兵部队整体”，例如：The cavalry arrived. 但在强调“多支不同的骑兵部队/不同国家或地区的骑兵”时，也会看到复数“cavalries”。","现代语境中，“cavalry”常带有历史色彩；如果说当代军队，相关词还会用到“armored cavalry（装甲骑兵/侦察部队）”“cavalry unit（骑兵分队）”。"]}
{"word":"cavalry","summary":{"en":"Cavalry means mounted soldiers (or modern fast-moving armored troops), and it can also mean quick help arriving in time.","zh":"Cavalry 指（历史上的）骑兵或（现代）高机动装甲部队；也可引申为关键时刻赶来的“救兵”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"soldiers who fight on horseback (historically) or, in modern armies, fast-moving troops using vehicles such as armored cars or tanks.","zh":"（历史上）骑马作战的骑兵；（现代军队中）机动性很强的部队，常使用装甲车或坦克等车辆。"},"examples":[{"en":"In old battles, the cavalry charged across the field to break the enemy line.","zh":"在古代战斗中，骑兵会冲过战场来冲垮敌军防线。"},{"en":"Modern cavalry units often operate armored vehicles instead of horses.","zh":"现代的骑兵部队通常使用装甲车辆而不是马匹。"}]},{"partOfSpeech":"n.","definition":{"en":"a group of people who arrive quickly to help in a difficult situation (often used humorously or informally).","zh":"（常幽默/口语）及时赶来救场的一群人；“救兵”。"},"examples":[{"en":"When the computer crashed, our IT cavalry showed up and fixed everything.","zh":"电脑崩溃时，我们的 IT 救兵赶到，把一切都修好了。"},{"en":"Don’t worry—the cavalry is coming with extra supplies.","zh":"别担心——救兵会带着额外的物资来。"}]}],"synonyms":["mounted troops","horsemen","armored cavalry","reinforcements","rescue"],"phonetic":"/ˈkævəlri/","extraExplanation":["“cavalry”来自拉丁语 *caballus*（马），因此它和“马/骑乘”有历史联系。现代军事语境里，“cavalry”常强调“快速机动、侦察、突击”的角色，即使不再骑马。","在文学和电影里，“the cavalry arrives”常被用作固定表达，意思是“关键时刻援军赶到”，有时带一点夸张或幽默色彩。"]}
{"word":"cavalryman","summary":{"en":"A cavalryman is a soldier from the cavalry—traditionally fighting on horseback.","zh":"cavalryman 指骑兵部队的士兵，传统上骑马作战。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A soldier who fights on horseback; in modern use, a soldier from a cavalry unit (historically mounted, now often using armored vehicles).","zh":"骑兵；（现代也可指）隶属于骑兵部队的士兵（历史上骑马作战，如今多为装甲车辆部队）。"},"examples":[{"en":"In the novel, a cavalryman rides ahead to scout the road.","zh":"在小说里，一名骑兵骑马先行去侦察道路。"},{"en":"During the ceremony, the cavalrymen wore polished boots and carried sabers.","zh":"在仪式上，骑兵们穿着擦得发亮的靴子，佩着军刀。"},{"en":"The museum displays a cavalryman’s uniform from the 1800s.","zh":"博物馆展出了19世纪一名骑兵的制服。"}]}],"synonyms":["trooper","horse soldier","cavalry soldier"],"phonetic":"/ˈkævəlrimən/","extraExplanation":["“cavalryman”由“cavalry（骑兵部队）+ man（男子/人）”构成，常见于历史、战争题材的叙述。现代英语中也可能泛指“骑兵部队成员”，不一定真的骑马。","文化/文学中，骑兵常象征速度、突袭与机动性；在一些西部片或历史小说里，cavalryman也会带有“军纪严明、制服醒目”的形象联想。"]}
{"word":"cavalrymen","summary":{"en":"“Cavalrymen” means soldiers of the cavalry—traditionally horse soldiers, and sometimes modern fast mobile/armored troops.","zh":"“cavalrymen”指骑兵（传统上是骑马作战的士兵；有时也泛指现代机动/装甲骑兵部队人员）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Soldiers who fight on horseback, or (in modern armies) soldiers trained to move and fight using fast vehicles such as armored cars or tanks.","zh":"骑兵；（现代军队中）机动骑兵/装甲侦察部队士兵，指受训用于快速机动并作战的士兵。"},"examples":[{"en":"In the past, cavalrymen charged across open fields with swords and lances.","zh":"过去，骑兵会持剑与长枪在开阔地带冲锋。"},{"en":"The general sent cavalrymen ahead to scout the road and report back.","zh":"将军派骑兵先行侦察道路并回报情况。"},{"en":"In modern history books, “cavalrymen” sometimes refers to armored reconnaissance units rather than horse soldiers.","zh":"在现代历史书里，“cavalrymen”有时指装甲侦察部队，而不一定是骑马作战的士兵。"}]}],"synonyms":["mounted soldiers","horsemen","cavalry soldiers"],"phonetic":"/ˈkævəlrimən/","extraExplanation":["“cavalrymen”是复数形式；单数是“cavalryman”。更常见的复数表达也可以说“cavalry soldiers”或直接用“cavalry”（作为集合名词，指骑兵部队）。","词源上来自拉丁语“caballus”（马），因此核心概念与“骑马/机动”有关。英语里常见搭配有：heavy cavalry（重骑兵）、light cavalry（轻骑兵）、cavalry charge（骑兵冲锋）。"]}
{"word":"Cavan","summary":{"en":"Cavan is most commonly a place name in Ireland (a county and its main town), and it can also be used as a personal name.","zh":"Cavan 最常见是爱尔兰的地名（卡文郡及其主要城镇），也可用作人名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a county in the Republic of Ireland, in the province of Ulster","zh":"（专有名词）爱尔兰共和国的一个郡，位于阿尔斯特省"},"examples":[{"en":"My grandparents come from County Cavan in Ireland.","zh":"我的祖父母来自爱尔兰的卡文郡。"},{"en":"We drove through Cavan on our way to Donegal.","zh":"我们去多尼戈尔的路上开车经过了卡文郡。"}]},{"partOfSpeech":"n.","definition":{"en":"a town in County Cavan, Ireland (the county town)","zh":"（专有名词）爱尔兰卡文郡内的一个城镇（郡治所在地）"},"examples":[{"en":"They stayed overnight in Cavan before continuing the trip.","zh":"他们在卡文镇过了一夜，然后继续行程。"}]},{"partOfSpeech":"n.","definition":{"en":"a surname or given name, often associated with Irish origin","zh":"（人名）姓氏或名字，常与爱尔兰背景相关"},"examples":[{"en":"Cavan is his first name, not his last name.","zh":"Cavan 是他的名，不是姓。"},{"en":"She met a writer named Cavan at the workshop.","zh":"她在工作坊认识了一位名叫 Cavan 的作家。"}]}],"synonyms":["County Cavan (for the county)","Cavan Town (to specify the town)"],"phonetic":"/ˈkævən/","extraExplanation":["在英语里，Cavan 多用于地名：既可以指“卡文郡（County Cavan）”，也可以指郡内的“卡文镇（Cavan）”。日常表达中常说 County Cavan 来避免与城镇混淆。","该地名源自爱尔兰语 An Cabhán，常被解释为与“空地/洼地（hollow）”之类的地形含义相关。英语读音一般为重音在第一音节。"]}
{"word":"Cavanagh","summary":{"en":"Cavanagh is mainly an Irish family name (surname), sometimes used as a first name.","zh":"Cavanagh主要是爱尔兰姓氏（家族名），有时也可作名字使用。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a surname (family name), most commonly Irish; also sometimes used as a given name","zh":"姓氏（家族名），多见于爱尔兰；有时也可作名字使用"},"examples":[{"en":"Justice Brett Kavanaugh’s surname is sometimes spelled similarly to “Cavanagh.”","zh":"布雷特·卡瓦诺大法官的姓有时会被拼写得和“Cavanagh”相似。"},{"en":"Ms. Cavanagh will join the meeting at 3 p.m.","zh":"卡瓦纳先生/女士将在下午三点参加会议。"}]}],"phonetic":"/ˈkævəˌnɑː/","extraExplanation":["“Cavanagh”主要是爱尔兰姓氏，来自爱尔兰盖尔语来源的姓族名（常与“Kavanagh”互为常见变体拼写）。在英语国家里，这类姓氏的拼写可能因移民登记、地区口音或家族习惯而出现多种版本。","读音在不同地区可能有差异；学习时可把重音放在第一个音节：KAV-uh-nah（大致类似“卡-瓦-纳”）。"]}
{"word":"Cavanaugh","summary":{"en":"Cavanaugh is mainly a surname, often associated with Irish heritage; it can also appear as a place name.","zh":"Cavanaugh 主要是姓氏，常与爱尔兰渊源相关；也可能在少数情况下作为地名出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A family name (surname), most commonly used for people of Irish heritage; also used as a place name in some areas.","zh":"一个姓氏（家族姓），多与爱尔兰血统相关；在少数地区也可作地名。"},"examples":[{"en":"Justice Brett Kavanaugh served on the U.S. Supreme Court.","zh":"布雷特·卡瓦诺法官在美国最高法院任职。"},{"en":"My professor’s last name is Cavanaugh.","zh":"我教授的姓是 Cavanaugh（卡瓦诺）。"}]}],"synonyms":["Kavanaugh","Cavanagh","Cavanah"],"phonetic":"/ˈkævəˌnɔː/","extraExplanation":["Cavanaugh 通常被视为爱尔兰姓氏的英语拼写之一，常见变体包括 Kavanaugh、Cavanagh、Cavanaugh 等（发音往往相近）。","在新闻与法律语境中，Kavanaugh 这一拼写因美国最高法院大法官 Brett Kavanaugh 而更为常见；但 Cavanaugh 也作为许多人的姓独立存在。","作为专有名词，通常首字母大写；在正式写作中第一次出现可加上身份或头衔（如 Justice/Dr./Mr./Ms.）。"]}
{"word":"cavascope","summary":{"en":"A cavascope is a medical device for viewing/examining the vena cava.","zh":"cavascope 指用于观察或检查腔静脉的医疗器械。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical instrument used to view or examine the vena cava (the body’s largest vein), especially during certain procedures","zh":"用于观察或检查腔静脉（人体最大的静脉）的医疗器械，常见于某些介入或外科操作中"},"examples":[{"en":"The surgeon used a cavascope to check the inside of the vena cava during the procedure.","zh":"外科医生在手术过程中用腔静脉内窥镜检查腔静脉内部。"},{"en":"A cavascope may help doctors see whether a clot is blocking blood flow.","zh":"腔静脉内窥镜可能帮助医生观察是否有血栓阻塞血流。"}]}],"synonyms":["endoscope (general)","cavoscope (variant spelling)"],"phonetic":"/ˈkɑːvəˌskoʊp/","extraExplanation":["“cavascope”不是日常英语中的常见词，更可能出现在医学语境里，含义通常可从词根拆解理解：cava（腔静脉）+ scope（观察镜/内窥镜）。在不同医院或产品/文献中也可能写作“cavoscope”，或作为某种器械/品牌名使用。"]}
{"word":"cavate","summary":{"en":"Caveat means a warning or caution, often used to add a condition or limitation to what you just said.","zh":"Caveat 指“提醒/警告/保留意见”，常用来补充条件或限制说明。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a warning or caution that something may be different from what you expect, or that there may be a problem","zh":"（对某事的）警告；提醒；（说明可能有问题的）保留意见"},"examples":[{"en":"The plan looks good, with one caveat: it may cost more than we expected.","zh":"这个计划看起来不错，但有一个提醒：费用可能比我们预期的更高。"},{"en":"I agree with your idea, but I have a caveat.","zh":"我同意你的想法，但我有一点保留意见。"}]},{"partOfSpeech":"phrase","definition":{"en":"a warning in the phrase “caveat emptor,” meaning buyers should be careful because the seller is not always responsible for problems","zh":"（用于短语）“caveat emptor（买者自负）”：提醒买方要谨慎，因为卖方不一定对问题负责"},"examples":[{"en":"When buying used electronics online, remember: caveat emptor.","zh":"在网上买二手电子产品时要记住：买者自负。"}]}],"synonyms":["warning","caution","qualification","condition"],"phonetic":"/ˈkæviˌæt/","extraExplanation":["你输入的“cavate”在现代英语里不常见，很多学习者其实是想写 caveat（警告/提醒）。caveat 来自拉丁语，原意是“让他小心/注意”。","常见搭配：with the caveat that...（但前提/但需提醒的是……）；a caveat applies（需要注意的是……）。在正式写作里很常用。"]}
{"word":"cavated","summary":{"en":"“Cavated” is a rare word meaning “hollowed out,” or the past form of “cavate” (to form a cavity). In most everyday contexts, people use “excavated” instead.","zh":"“cavated”较少见，意思是“被挖空的”，也可作动词“cavate”（使形成空洞）的过去式/过去分词。日常语境中多数情况下更常用“excavated”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) hollowed out; having a cavity or being made into a hollow shape.","zh":"（较少见）被挖空的；有空洞的；被做成中空形状的。"},"examples":[{"en":"The stone looked cavated, with a small hollow in the center.","zh":"这块石头看起来被挖空了，中间有个小凹洞。"},{"en":"The model shows a cavated space where the pipe will go.","zh":"这个模型显示了将要放置管道的中空空间。"}]},{"partOfSpeech":"vt.","definition":{"en":"(rare) past tense/past participle of “cavate”: to hollow out or form a cavity in something.","zh":"（较少见）动词“cavate”的过去式/过去分词：使某物形成空洞；挖空。"},"examples":[{"en":"Water slowly cavated the soft rock over many years.","zh":"多年里，水慢慢把较软的岩石侵蚀出空洞。"},{"en":"The dentist noted the tooth was cavated and needed treatment.","zh":"牙医指出这颗牙已经蛀出洞了，需要治疗。"}]}],"synonyms":["hollowed (out)","cored","pitted","excavated (common alternative)"],"phonetic":"/ˈkeɪveɪtɪd/","extraExplanation":["“cavated”在日常英语中很少用。你更常见到：\n1) “excavated”（挖掘出的/被发掘的），来自“excavate”。例如：an excavated site（被发掘的遗址）。\n2) “cavitated”（形成空穴的/出现气蚀的），常见于医学或工程领域（如“cavitation”气蚀/空化）。\n如果你是在描述“挖出来的东西”，通常应写“excavated”。"]}
{"word":"cavatina","summary":{"en":"A cavatina is a short, simple, lyrical solo song/aria, often used in opera or as a songlike instrumental piece.","zh":"cavatina 指短小、朴素而抒情的独唱咏叹调/歌曲，也常指具有歌唱性的器乐小品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A short, simple, lyrical song or aria (usually for one singer), often expressive rather than dramatic, commonly found in operas or instrumental pieces.","zh":"（音乐）短小、旋律优美、抒情的咏叹调或歌曲（常为独唱），通常重在抒情表达而非戏剧性冲突；也可出现在器乐作品中。"},"examples":[{"en":"The soprano sang a gentle cavatina before the faster section began.","zh":"女高音在较快的段落开始前，先唱了一段温柔的短咏叹调（cavatina）。"},{"en":"In the opera, his cavatina shows his feelings in a quiet, lyrical way.","zh":"在歌剧中，他的这段cavatina以安静抒情的方式展现了情感。"},{"en":"The concert program included a cavatina arranged for violin and piano.","zh":"音乐会曲目中有一首改编为小提琴与钢琴的cavatina。"}]}],"synonyms":["aria","air","melody","song"],"phonetic":"/ˌkævəˈtiːnə/","extraExplanation":["“Cavatina”源自意大利语，常用于古典音乐语境。它通常比典型的“aria（咏叹调）”更短、更朴素，更像一段抒情的“歌唱性旋律”。在一些歌剧结构里，cavatina有时会与更快、更华丽的后半段（如“cabaletta”）形成对比。","在英语里它多用于音乐评论、节目单、乐曲标题等正式场合；日常对话中较少见。"]}
{"word":"cavatinas","summary":{"en":"Cavatinas are short, lyrical solo songs in an opera (plural of cavatina).","zh":"cavatinas 指歌剧中短小抒情的独唱段落（cavatina 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of cavatina: a short, simple song (aria) in an opera, usually lyrical and less showy than a full aria.","zh":"cavatina 的复数：歌剧中的短小、较为朴素的咏叹调（或独唱段落），通常抒情、炫技性较弱。"},"examples":[{"en":"The soprano sang two cavatinas before the finale.","zh":"女高音在终曲前演唱了两段短咏叹调（cavatinas）。"},{"en":"In this opera, the cavatinas are intimate and gentle rather than dramatic.","zh":"在这部歌剧里，这些 cavatinas 更亲密柔和，而不是戏剧化的。"}]}],"synonyms":["arias (general)","short aria","solo song"],"phonetic":"/ˌkævəˈtiːnə/","extraExplanation":["“Cavatina”来自意大利语，常用来指比典型“aria（咏叹调）”更短、更抒情的独唱段落；在一些作品里也可能特指角色的“抒情自白式”唱段。","音乐史语境中，cavatina 常出现在古典/浪漫时期歌剧与声乐作品里；不同作曲家对这个词的使用不完全一致，但“短、抒情、较少炫技”是常见核心印象。"]}
{"word":"cavatine","summary":{"en":"A cavatine is a short, lyrical solo song in an opera (similar to a brief aria).","zh":"cavatine 指歌剧中的短小抒情独唱曲，类似简短的咏叹调。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a short, simple vocal solo (like a brief aria) in an opera or similar classical work, usually lyrical rather than highly dramatic","zh":"（歌剧等中的）短小抒情的独唱曲；短咏叹调"},"examples":[{"en":"The soprano’s cavatine comes early in the opera and introduces her character’s emotions.","zh":"女高音的短咏叹调出现在歌剧前段，用来引出角色的情感。"},{"en":"He practiced the cavatine slowly to shape a smooth, singing line.","zh":"他慢速练习这段短咏叹调，以塑造圆润如歌的旋律线条。"}]}],"synonyms":["cavatina","aria","solo"],"phonetic":"/ˌkævəˈtiːn/","extraExplanation":["“cavatine”常见于法语语境或作为“cavatina”的变体；英语里更常用的是“cavatina”。两者通常都指歌剧中较短、旋律性强、技巧炫技成分相对少的独唱段落。","在歌剧里，cavatine/cavatina往往比完整的“aria（咏叹调）”更简短、更抒情，常用来刻画人物性格或情绪的转折。你也可能在器乐作品标题中见到它，用来表示“像歌唱一样的短抒情段”。"]}
{"word":"cavayard","summary":{"en":"“Cavayard” is likely a misspelling of “graveyard”: a cemetery; also used figuratively for a place where things are abandoned or no longer used.","zh":"“cavayard”很可能是“graveyard”的拼写错误：指墓地；也可比喻指东西被弃用、被遗忘的地方。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A place where dead people are buried; a cemetery or graveyard.","zh":"埋葬逝者的地方；墓地。"},"examples":[{"en":"We visited the old graveyard behind the church.","zh":"我们参观了教堂后面的老墓地。"},{"en":"The town’s cemetery is quiet in the early morning.","zh":"清晨时小镇的公墓很安静。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) A place where things are left unused or forgotten, as if they are “dead.”","zh":"（比喻）被弃用或被遗忘的地方；“废弃之地”。"},"examples":[{"en":"That folder has become a graveyard for old documents.","zh":"那个文件夹成了旧文件的“坟场”。"},{"en":"The garage is a graveyard of broken bicycles.","zh":"车库像是坏自行车的坟场。"}]}],"synonyms":["cemetery","burial ground","graveyard"],"phonetic":"/ˈɡreɪvˌjɑrd/","extraExplanation":["你输入的 **cavayard** 很可能是拼写错误；常见正确拼写是 **graveyard**（墓地）或 **cemetery**（公墓）。在美式英语里，*cemetery* 更正式中性，*graveyard* 常指教堂附近或较传统的墓地。","词源小知识：*graveyard* 由 *grave*（坟墓）+ *yard*（院子/围地）组成，字面意思是“坟墓的院子”。","文化用法：英语里常用“a graveyard of …”作比喻，表示“某种东西的堆积处/淘汰地”，语气可以是幽默或带一点无奈。"]}
{"word":"cavdia","summary":{"en":"“cavdia” is not a recognized English word; it is probably a misspelling.","zh":"“cavdia”不是规范英语单词；很可能是拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling or a name/term from another language.","zh":"不是标准英语单词；很可能是拼写错误，或来自其他语言的名称/术语。"},"examples":[{"en":"I couldn’t find “cavdia” in an English dictionary—did you mean a different word?","zh":"我在英语词典里找不到“cavdia”——你是不是想写别的词？"},{"en":"If you tell me the sentence, I can help you figure out the correct spelling and meaning.","zh":"如果你把它放在句子里，我可以帮你确定正确拼写和含义。"}]}],"phonetic":"/ˈkævdiə/","extraExplanation":["“cavdia”看起来像拼写误差。常见的接近词有：\n1) cavia（豚鼠属；与guinea pig相关，偏生物学用语）\n2) Candia（坎迪亚：历史地名/人名，常指克里特岛的伊拉克利翁 Heraklion 的旧称）\n3) cavia/candia 之外，也可能是你想输入的 candid（坦率的）或 caviar（鱼子酱）等。\n把你看到它的原句发我，我可以精准判断。"]}
{"word":"Cave","summary":{"en":"A cave is a natural hollow in rock or ground; as a verb, it can mean to collapse inward or to give in under pressure.","zh":"cave 指天然洞穴；作动词可指（向内）坍塌，或在压力下屈服/让步。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a natural hollow space in the ground or inside a hill/mountain, often made in rock","zh":"洞穴；山洞（通常为天然形成的岩洞）"},"examples":[{"en":"They explored a cave near the beach.","zh":"他们探险了海边附近的一个洞穴。"},{"en":"Bats often live in dark caves.","zh":"蝙蝠常常生活在黑暗的洞穴里。"}]},{"partOfSpeech":"v.","definition":{"en":"to collapse or fall inward (often used with “in”)","zh":"（向内）塌陷；坍塌（常与 in 连用）"},"examples":[{"en":"The roof caved in after the heavy snow.","zh":"大雪过后屋顶塌陷了。"},{"en":"Part of the tunnel started to cave in.","zh":"隧道有一部分开始坍塌。"}]},{"partOfSpeech":"v.","definition":{"en":"to stop resisting and agree to something because of pressure; to give in (often used with “in”)","zh":"屈服；让步（常与 in 连用）"},"examples":[{"en":"After days of arguing, he finally caved in and apologized.","zh":"争吵了好几天后，他终于让步并道歉了。"},{"en":"She didn’t want dessert, but she caved in when everyone insisted.","zh":"她本来不想吃甜点，但大家一直劝，她就妥协了。"}]}],"synonyms":["grotto","cavern","hollow","give in","yield","collapse"],"phonetic":"/keɪv/","extraExplanation":["“cave in”有两个常见意思：①（结构）塌陷、坍塌；②（人）在压力下让步、屈服。语境通常能区分：谈房屋、屋顶、隧道多是塌陷；谈争论、要求、诱惑多是让步。","名词“cave”在文化语境里常让人联想到“洞穴人(caveman)”或史前生活，也常见于探险、考古、旅游等话题。"]}
{"word":"cave","summary":{"en":"“Cave” most commonly means a natural underground hollow; as a verb, it can mean “collapse inward” or “give in under pressure.”","zh":"“cave”最常指“洞穴”；作动词可指“塌陷/坍塌”，也可引申为“在压力下屈服/让步”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a natural hollow place in the ground or inside a hill or mountain; a large hole you can go into","zh":"洞穴；山洞（地面或山体内部的天然空洞，通常可以进入）"},"examples":[{"en":"We explored a cave with a guide and headlamps.","zh":"我们在向导和头灯的帮助下探索了一个洞穴。"},{"en":"Bats often live in dark caves.","zh":"蝙蝠常常住在黑暗的洞穴里。"}]},{"partOfSpeech":"vi.","definition":{"en":"to collapse inward; to fall in (often because it is weak or under pressure)","zh":"塌陷；坍塌（常因结构脆弱或承受压力）"},"examples":[{"en":"The roof caved in during the storm.","zh":"暴风雨中屋顶塌陷了。"},{"en":"Part of the tunnel wall started to cave in.","zh":"隧道墙的一部分开始坍塌。"}]},{"partOfSpeech":"vi.","definition":{"en":"to give in or agree after resisting; to stop saying no because of pressure","zh":"屈服；让步（在压力下不再坚持反对）"},"examples":[{"en":"After hours of arguing, he finally caved and apologized.","zh":"争论了几个小时后，他终于让步并道歉了。"},{"en":"She didn’t want a pet, but she caved when the kids begged.","zh":"她本来不想养宠物，但孩子们央求后她还是妥协了。"}]}],"synonyms":["(n.) cavern","(n.) grotto","(vi.) collapse","(vi.) fall in","(vi.) give in","(vi.) yield"],"phonetic":"/keɪv/","extraExplanation":["“cave in”常用来表示“（屋顶/地面/结构）塌陷”，也可比喻“在压力下让步”。例如：Don’t cave in to peer pressure.（别屈服于同伴压力。）","词源上，名词cave来自拉丁语“cavus”（空的、凹的），和“cavity”（腔、洞）是同源词，能帮助记忆。"]}
{"word":"cavea","summary":{"en":"Cavea means the tiered seating area for spectators in an ancient Roman theater or amphitheater.","zh":"Cavea 指古罗马剧场或圆形竞技场中供观众就座的阶梯式看台/观众席区域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the tiered seating area in an ancient Roman (or Greek-style) theater or amphitheater, where the audience sat","zh":"（古罗马/古典）剧场或圆形竞技场的阶梯式观众席区域"},"examples":[{"en":"From the cavea, spectators could see the entire stage and orchestra below.","zh":"从cavea（观众席）上，观众可以俯瞰下方的舞台和乐池。"},{"en":"Archaeologists mapped the cavea to estimate how many people the theater could hold.","zh":"考古学家测绘了cavea，以估算这座剧场可容纳的人数。"},{"en":"The guide explained how the cavea was divided by class in many Roman venues.","zh":"导游讲解了许多罗马场馆里cavea如何按社会阶层分区。"}]}],"synonyms":["auditorium","seating area","stands","grandstand"],"phonetic":"/ˈkeɪviə/","extraExplanation":["“cavea”源自拉丁语，原意与“围住的空间/笼状结构”相关；在罗马建筑语境中专指剧场里环绕舞台、呈扇形上升的观众坐席区。","古典剧场常分为几个核心区域：cavea（观众席）、orchestra（乐池/圆形区域）、scaenae frons（舞台背景立面）。在阅读建筑史或考古文章时，这些词常一起出现。","英语里“cavea”较偏学术/考古用语；日常更常说 “seating area / auditorium / stands”。"]}
{"word":"caveae","summary":{"en":"“caveae” is the Latin-style plural of “cavea,” most often meaning the seating tiers of an ancient Roman theater; less commonly, it can mean small cavities in technical biology/anatomy.","zh":"“caveae”是“cavea”的拉丁式复数，最常指古罗马剧场的分层观众席；较少见时可指生物/解剖学中的小空腔。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of cavea: the seating area (tiers of seats) in a Roman/ancient theater or amphitheater.","zh":"cavea 的复数：古罗马/古代剧场或圆形竞技场中的观众席区域（分层座位）。"},"examples":[{"en":"Archaeologists studied the caveae to understand how crowds moved through the theater.","zh":"考古学家研究这些 caveae，以了解观众在剧场中的流动方式。"},{"en":"The guide explained that the caveae were divided by walkways into sections.","zh":"导游解释说，caveae 被通道分隔成不同区域。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of cavea: small hollow spaces or cavities in biology/anatomy (used in some technical writing).","zh":"cavea 的复数：生物学/解剖学中指小的空腔或凹陷（多见于较专业的写法）。"},"examples":[{"en":"The paper described several caveae in the specimen’s structure.","zh":"论文描述了该标本结构中的几个 caveae（小空腔）。"},{"en":"Under magnification, tiny caveae became visible.","zh":"在放大观察下，细小的 caveae 变得可见。"}]}],"synonyms":["seating tiers","auditorium seating (ancient)","cavities"],"phonetic":"/ˈkeɪviˌi/","extraExplanation":["“caveae”来自拉丁语复数形式：单数以 -a 结尾（cavea），复数常变为 -ae（caveae）。在英语里，这类拉丁复数多出现在考古、古典学或部分生物/解剖学写作中。","很多学习者会把 “caveae” 误当作 “caveats”（caveat 的复数，意思是“警告/注意事项/但书”）。如果你想查的是“caveat”，告诉我我可以再给你对应词条。"]}
{"word":"caveat","summary":{"en":"Caveat means a warning or important limitation to remember (often used in careful or formal writing).","zh":"caveat 指“警告/注意事项/重要限制条件”，常见于较正式或严谨的表达中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A warning or caution that something may not be fully true, safe, or complete; a condition you should keep in mind.","zh":"（对某事不完全真实/安全/完整的）警告、注意事项；需要牢记的限制条件。"},"examples":[{"en":"The study is useful, but there’s an important caveat: the sample size was small.","zh":"这项研究很有用，但有一个重要的注意事项：样本量很小。"},{"en":"I agree with your plan, with the caveat that we stay within budget.","zh":"我同意你的计划，但前提/注意事项是我们必须控制在预算内。"}]},{"partOfSpeech":"n.","definition":{"en":"A formal notice (often in law) that warns or restricts an action.","zh":"（常用于法律语境的）正式告诫/声明，用来警示或限制某项行为。"},"examples":[{"en":"The lawyer filed a caveat to prevent the property transfer until the dispute was settled.","zh":"律师提交了一份正式告诫，以在纠纷解决前阻止房产过户。"}]}],"synonyms":["warning","caution","reservation","qualification","condition","stipulation"],"phonetic":"/ˈkæviˌæt/","extraExplanation":["“Caveat”来自拉丁语，常见于短语“caveat emptor”（买者自负），意思是买方要自行谨慎判断商品质量与风险。在现代英语里，它更常用于学术、商业、新闻等场合，表示“需要补充说明的限制/保留意见”。"]}
{"word":"caveated","summary":{"en":"Caveated means ‘qualified with a warning or condition,’ and can also be the (rare) past form of the verb caveat, including a legal sense of filing a formal objection.","zh":"caveated 指“带有提醒或条件的、有所保留的”；也可作动词 caveat 的过去式（较少见），在法律语境中还可指提交正式异议通知。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(often in writing) stated with a warning, limit, or condition; qualified (not absolute).","zh":"（常见于书面语）带有提醒、限制或条件的；有所保留的；被限定的（并非绝对）。"},"examples":[{"en":"The results are caveated: the sample size was small.","zh":"这些结果是有保留的：因为样本量很小。"},{"en":"She offered a caveated apology, saying she was sorry “if anyone was offended.”","zh":"她给出了一个带条件的道歉，说如果有人被冒犯她很抱歉。"}]},{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of caveat (rare): to add a warning or condition to a statement; to qualify.","zh":"caveat 的过去式/过去分词（较少见）：给陈述加上提醒或条件；限定。"},"examples":[{"en":"The report caveated its conclusions with several assumptions.","zh":"报告用若干假设来限定其结论。"},{"en":"He caveated his support by asking for more data.","zh":"他在表示支持时加了一条条件：需要更多数据。"}]},{"partOfSpeech":"vt.","definition":{"en":"(law, rare) past tense/past participle: to file a formal notice (a caveat) to stop or delay a legal action until a claim is heard.","zh":"（法律，较少见）过去式/过去分词：提出“异议/保留通知（caveat）”，以阻止或延缓某项法律程序，直到相关主张被审理。"},"examples":[{"en":"The estate was caveated by a relative who disputed the will.","zh":"一位亲属对遗嘱提出异议（提交 caveat），使遗产处理被暂缓。"}]}],"synonyms":["qualified","conditional","limited","restricted","hedged","with a caveat"],"phonetic":"ˈkæviˌeɪtɪd","extraExplanation":["“caveated”来自名词 caveat，常见于学术、新闻和正式写作中，意思是“加上但书/注意事项”。日常口语里更常说 with a warning/with conditions/with a caveat。","caveat 源自拉丁语“caveat”（意为“让他/她小心”），因此带有“提醒读者别把话当成绝对结论”的语气。"]}
{"word":"caveatee","summary":{"en":"A caveat is an important warning or condition you should keep in mind.","zh":"caveat 指需要牢记的重要警告或限制条件。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a warning or caution that something may not be completely true or safe, or that there are special conditions you must remember","zh":"（对某事的）警告；告诫；注意事项（提醒并非完全可靠/安全，或有特殊条件需要牢记）"},"examples":[{"en":"The plan sounds good, with one caveat: we don’t have enough time.","zh":"这个计划听起来不错，但有一个注意事项：我们时间不够。"},{"en":"He agreed to help, but with the caveat that he could leave early.","zh":"他同意帮忙，但前提/条件是他可以提前离开。"}]}],"synonyms":["warning","caution","reservation","condition","stipulation"],"phonetic":"/ˈkæviæt/","extraExplanation":["你输入的“caveatee”通常是拼写错误；常见正确词是 caveat。","caveat 源自拉丁语，原意是“让他小心/注意（let him/her beware）”，所以常用于正式或书面语里表示“附带的警告/限制条件”。","常见相关短语：caveat emptor（买者自负）—表示买东西的人要自己判断质量与风险。"]}
{"word":"caveating","summary":{"en":"“Caveating” means adding a caution/limitation to what you say, or (in some legal systems) filing a formal caveat to pause or challenge a legal process.","zh":"“Caveating”指在表达中加上提醒或限制条件；在某些法律语境中也指提交正式异议（caveat）以暂缓或挑战法律程序。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"adding a warning or limitation to what you say; qualifying a statement","zh":"（说话时）加上保留意见/限制条件；作出提醒性补充（使表述更谨慎）"},"examples":[{"en":"He supported the plan, caveating that the budget might change.","zh":"他支持这个计划，但补充说明预算可能会变动。"},{"en":"I’m not an expert, so I’m caveating my advice.","zh":"我不是专家，所以我会给建议加上保留说明。"}]},{"partOfSpeech":"v.","definition":{"en":"(legal, especially UK/Australia) formally placing a legal warning/objection on a process, often about a will or an estate","zh":"（法律用语，尤指英/澳）提出“异议/保留通知”（caveat），以暂缓或阻止某项法律程序，常见于遗嘱或遗产相关事项"},"examples":[{"en":"She is caveating the will while the family investigates possible fraud.","zh":"在家人调查是否存在欺诈期间，她对该遗嘱提出异议以暂缓程序。"},{"en":"The solicitor explained the risks of caveating an estate.","zh":"律师解释了对遗产程序提出异议的风险。"}]}],"synonyms":["qualifying","hedging","adding a caveat","noting a limitation","placing a caveat","filing a caveat"],"phonetic":"ˈkæviˌeɪtɪŋ","extraExplanation":["“caveating”来自动词 caveat，意思是“加上一条保留/提醒”。caveat 最常见作名词（a caveat）表示“注意事项、但书”。","词源上 caveat 来自拉丁语，意为“让他/她当心”。在日常英语里，多用来表达“我同意，但要说明一个限制”。","法律义项在不同法域用法不一：在英联邦语境里，to caveat 常指正式提交 caveat，以暂停遗嘱认证（probate）或相关程序。"]}
{"word":"caveator","summary":{"en":"A caveator is a person who formally files a legal objection (a caveat).","zh":"caveator 指在法律程序中正式提出异议（caveat）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Law) A person who enters a formal warning or objection (a “caveat”), especially to stop a legal process (often in probate or patent matters).","zh":"（法律）提出“异议/警告声明（caveat）”的人；尤指在遗嘱认证或专利等程序中提出异议以暂停或阻止程序的人。"},"examples":[{"en":"In the probate case, the caveator challenged the will and delayed the court’s approval.","zh":"在遗嘱认证案件中，异议提出人对遗嘱提出质疑，推迟了法院的批准。"},{"en":"The judge asked the caveator to provide evidence supporting the objection.","zh":"法官要求异议提出人提交支持该异议的证据。"}]}],"synonyms":["objector","challenger","opponent","caveat (related term)"],"phonetic":"ˈkæv.i.eɪ.tɚ","extraExplanation":["“caveator”在日常英语中很少见，多出现在法律语境（尤其英联邦国家的遗嘱认证/probate）里。更常见的词是“caveat”（名词：警告、保留意见；法律：异议声明）。","拼写上容易和“caveat”混淆：如果你想表达“提醒/注意事项”，通常应写“caveat”，例如：There’s one caveat: it may be expensive.（有个注意事项：它可能很贵。）"]}
{"word":"caveators","summary":{"en":"“Caveators” is the plural of “caveator,” meaning people who file legal caveats (formal objections/warnings).","zh":"“caveators”是“caveator”的复数，指在法律中提交caveat（正式异议/保留通知）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Law) A person who files a formal warning or objection (a caveat) to stop or delay a legal action until the issue is considered.","zh":"（法律）提出“保留/异议通知”（caveat）的人；为阻止或延缓某项法律程序而正式提出异议的人。"},"examples":[{"en":"In probate court, the caveator challenged the validity of the will.","zh":"在遗嘱认证法庭上，异议提出人（caveator）对遗嘱的有效性提出质疑。"},{"en":"The judge scheduled a hearing after a caveator filed a caveat.","zh":"在异议提出人提交保留/异议通知后，法官安排了听证会。"}]}],"synonyms":["objector","challenger","protester"],"phonetic":"/ˈkæviˌeɪtər/","extraExplanation":["“caveators”是名词复数，单数是 caveator。这个词主要用于法律语境，日常英语里更常见的是 caveat（意为“警告、附带条件、保留意见”）及其复数 caveats。","词源上 caveat 来自拉丁语，意为“让他/她当心（let him/her beware）”。在法律中，caveat 是一种正式通知；提出该通知的人就是 caveator。"]}
{"word":"caveats","summary":{"en":"Caveats are warnings, limitations, or conditions you should keep in mind.","zh":"caveats 指需要注意的警告、限制或附带条件。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A warning or important note that you should consider before accepting or doing something.","zh":"（接受或做某事前的）提醒、注意事项、警告（通常指需要特别留意的条件或限制）。"},"examples":[{"en":"There are a few caveats to the plan, so read the details carefully.","zh":"这个计划有一些注意事项，所以要仔细阅读细节。"},{"en":"I agree with you, with one caveat: we need a bigger budget.","zh":"我同意你，但有一个前提/注意点：我们需要更大的预算。"}]},{"partOfSpeech":"n.","definition":{"en":"A condition or limitation that makes a statement or agreement not fully true in all situations.","zh":"（使陈述或协议不完全成立的）限制条件、但书、附带条件。"},"examples":[{"en":"The offer comes with the caveat that you must start next month.","zh":"这个工作机会附带条件：你必须下个月入职。"},{"en":"That’s true, but the caveat is that it only works in warm weather.","zh":"没错，但限制是它只在暖和的天气里有效。"}]}],"synonyms":["warnings","reservations","conditions","limitations","fine print","disclaimers"],"phonetic":"/ˈkæviˌæts/","extraExplanation":["“caveat”源自拉丁语，原意是“让他当心/注意”（let him beware）。在法律和商业语境中常见，比如“caveat emptor”（买者自负/买者自慎），意思是买东西要自己仔细检查、承担风险。"]}
{"word":"caved","summary":{"en":"“Caved” is the past form of “cave” or “cave in,” meaning either “collapsed inward” or “gave in/yielded.”","zh":"“caved”是“cave / cave in”的过去式或过去分词，常表示“塌陷/坍塌”或“让步/屈服”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense / past participle of cave in) to collapse inward; to fall in because of pressure or damage.","zh":"（cave in 的过去式/过去分词）向内坍塌；因压力或损坏而塌陷。"},"examples":[{"en":"After the storm, the old roof caved in.","zh":"暴风雨过后，旧屋顶塌陷了。"},{"en":"The tunnel entrance caved in, so the road was closed.","zh":"隧道入口塌方了，所以道路被封闭。"}]},{"partOfSpeech":"v.","definition":{"en":"(past tense / past participle of cave) to finally agree or give up resistance; to yield under pressure.","zh":"（cave 的过去式/过去分词）最终让步；在压力下屈服。"},"examples":[{"en":"He argued for hours, but he eventually caved and apologized.","zh":"他争辩了好几个小时，但最终还是让步并道歉了。"},{"en":"They caved to public pressure and changed the policy.","zh":"他们在公众压力下让步，修改了政策。"}]}],"synonyms":["collapsed","fell in","gave in","yielded","buckled"],"phonetic":"/keɪvd/","extraExplanation":["“caved”最常见来自短语动词“cave in”（坍塌/塌陷）。比起单独说“cave”，日常英语里更常用“cave in”来表达“塌方、塌陷”。","“cave”表示“让步”时语气偏口语，常见搭配：cave in (to someone/something)＝在某人/某事的压力下让步。"]}
{"word":"cavefish","summary":{"en":"A cavefish is a fish adapted to living in dark caves or underground waters, often with reduced eyes and pigmentation.","zh":"cavefish 指适应在黑暗洞穴或地下水域生活的鱼类，常见特征是眼睛与色素退化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fish that lives in caves or other underground waters, often with reduced eyesight and little or no skin pigment","zh":"穴居鱼；生活在洞穴或地下水域的鱼类，常见特征是视力退化、皮肤色素很少或几乎没有"},"examples":[{"en":"Cavefish often have tiny eyes or no eyes at all because they live in darkness.","zh":"穴居鱼常常只有很小的眼睛，甚至完全没有眼睛，因为它们生活在黑暗中。"},{"en":"Scientists study cavefish to understand how animals adapt to extreme environments.","zh":"科学家研究穴居鱼，以了解动物如何适应极端环境。"}]}],"synonyms":["cave-dwelling fish","troglobitic fish"],"phonetic":"/ˈkeɪvˌfɪʃ/","extraExplanation":["“cavefish”常用于科普与生物学语境，并不是某一个单一物种的名字，而是对“生活在洞穴/地下水系统中的鱼类”的统称。常见研究对象包括墨西哥脂鲤（Mexican tetra, Astyanax mexicanus）的洞穴型群体，用来研究进化、感官补偿（如嗅觉触觉增强）等现象。","文学与写作中，cavefish 有时会被当作隐喻：象征长期处于“信息缺失/封闭环境”而导致的“视野变窄”，或象征在黑暗中发展的另一种能力（适应与生存）。"]}
{"word":"cavefishes","summary":{"en":"Cavefishes are fish that live in caves/underground waters and are often adapted to darkness.","zh":"洞穴鱼是生活在洞穴或地下水域的鱼类，常对黑暗环境有特殊适应。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Fish that live in caves or underground waters, often adapted to darkness (for example, with reduced eyes and little or no skin pigment).","zh":"生活在洞穴或地下水域中的鱼类，常对黑暗环境产生适应（例如眼睛退化、皮肤色素减少或缺失）。"},"examples":[{"en":"Cavefishes often rely on smell and touch more than sight.","zh":"洞穴鱼通常更依赖嗅觉和触觉，而不是视觉。"},{"en":"Scientists study cavefishes to understand how animals adapt to extreme environments.","zh":"科学家研究洞穴鱼，以了解动物如何适应极端环境。"}]}],"synonyms":["cavefish","troglobitic fish","cave-dwelling fish"],"phonetic":"ˈkeɪvˌfɪʃ","extraExplanation":["“cavefish”是常见的单数形式，“cavefishes”是复数。写作中也常用“cave fish”作两词写法，但在科普语境里“cavefish”更常见。","洞穴鱼并不是单一物种，而是一类生活环境相似的鱼的统称；它们在不同地区可能属于不同科属。最常被提到的例子之一是墨西哥脂鲤（Mexican tetra, Astyanax mexicanus）的洞穴型。"]}
{"word":"cavekeeper","summary":{"en":"A cavekeeper is someone who manages or guards a cave, often at a tourist or protected site.","zh":"cavekeeper 指负责管理或看守洞穴的人，常见于旅游洞穴或受保护区域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person whose job is to look after, manage, or protect a cave (especially a tourist cave or a protected natural site)","zh":"看守洞穴的人；洞穴管理员（尤指旅游洞穴或受保护自然景区的工作人员）"},"examples":[{"en":"The cavekeeper opened the gate at 9 a.m. and led the first tour inside.","zh":"洞穴管理员早上九点打开大门，带第一批游客进洞。"},{"en":"Ask the cavekeeper before using a flashlight, because some areas are protected.","zh":"使用手电筒前先问洞穴管理员，因为有些区域是受保护的。"}]}],"synonyms":["cave guide","caretaker","warden","park ranger"],"phonetic":"/ˈkeɪvˌkiːpər/","extraExplanation":["“cavekeeper”并不是非常常见的固定词汇，更常见的说法包括：cave guide（洞穴导游）、park ranger（护林员/公园管理员）、caretaker（看护人/管理员）。","构词很好理解：cave（洞穴）+ keeper（看守者/管理者）。在真实工作场景里，这类人可能负责安全、导览、保护钟乳石等地质结构，以及提醒游客不要触碰蝙蝠或野生动物。"]}
{"word":"cavel","summary":{"en":"Cavil means to make petty objections or, as a noun, a petty objection.","zh":"Cavil 指对细枝末节吹毛求疵地反对；作名词指这种小挑剔。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to raise small, picky objections; to criticize in a fault-finding way (often about unimportant details)","zh":"吹毛求疵地挑剔；为小事提出挑刺式的反对（常指不重要的细节）"},"examples":[{"en":"It’s fine to ask questions, but don’t cavil over every tiny mistake.","zh":"提问当然可以，但别对每个小错误都吹毛求疵。"},{"en":"She caviled at the wording instead of discussing the main idea.","zh":"她纠结于措辞而不是讨论核心观点。"}]},{"partOfSpeech":"n.","definition":{"en":"a small, petty objection or criticism","zh":"（对细枝末节的）吹毛求疵式反对；小题大做的挑剔"},"examples":[{"en":"He had a cavil about the seating plan, but everyone else was satisfied.","zh":"他对座位安排有点小挑剔，但其他人都满意。"}]}],"synonyms":["quibble","nitpick","find fault","carp"],"phonetic":"/ˈkævəl/","extraExplanation":["你输入的“cavel”在现代英语里不常见；多数情况下是把 **cavil** 拼错了。","**cavil** 常用于较正式的语境，带有“挑小毛病、抓细节来反对”的负面含义；比普通的 *criticize* 更强调“鸡蛋里挑骨头”。","常见搭配：**cavil at/about** (something)（对……挑剔）。"]}
{"word":"cavelet","summary":{"en":"Cavelet means a very small cave.","zh":"cavelet 指“很小的洞穴”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very small cave; a little hollow or grotto in rock","zh":"小洞穴；（岩石中的）小洞窟、小岩穴"},"examples":[{"en":"The hikers found a cavelet to rest in during the sudden rain.","zh":"突如其来的雨中，徒步者发现了一个小洞穴可以暂时避雨休息。"},{"en":"A bat slipped out of a cavelet near the cliff face.","zh":"一只蝙蝠从悬崖岩壁附近的小洞窟里飞了出来。"}]}],"synonyms":["small cave","grotto","nook","cavernlet"],"phonetic":"/ˈkeɪv.lət/","extraExplanation":["“cavelet”比较少见，常见于较文学化或描述性的语境。它由 cave（洞穴）+ 后缀 -let 构成，-let 表示“较小的……”（如 booklet 小册子、streamlet 小溪流），所以 cavelet 就是“很小的洞穴”。"]}
{"word":"cavelike","summary":{"en":"“Cavelike” means cave-like in appearance or feeling—dark, enclosed, or hollow.","zh":"“cavelike”表示“洞穴般的”，外观或氛围像洞穴：昏暗、封闭或中空。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a cave: dark, enclosed, rough, or hollow like the inside of a cave.","zh":"像洞穴的；洞穴般的（昏暗、封闭、粗糙或中空，像洞穴内部一样）。"},"examples":[{"en":"The restaurant had a cavelike interior with low lighting and stone walls.","zh":"这家餐厅的内部像洞穴一样，灯光很暗，墙是石头砌的。"},{"en":"We followed the narrow, cavelike tunnel into the hillside.","zh":"我们沿着狭窄、洞穴般的隧道走进山坡里。"},{"en":"His voice echoed in the cavelike hall.","zh":"他的声音在洞穴般的大厅里回响。"}]}],"synonyms":["cavernous","grotto-like","dark","enclosed"],"phonetic":"/ˈkeɪvˌlaɪk/","extraExplanation":["这是一个由“cave（洞穴）+ -like（像……的）”构成的形容词，常用于描写环境氛围（dark/echoing/damp/stone）或空间形状（enclosed/hollow），带有较强的画面感。写作中可用来营造神秘、阴冷或与世隔绝的感觉。"]}
{"word":"Cavell","summary":{"en":"Cavell is mainly used as an English surname, known through figures like Edith Cavell and Stanley Cavell.","zh":"Cavell主要是英文姓氏，常因伊迪丝·卡维尔与斯坦利·卡维尔等人物而被熟知。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A surname (family name) of English origin; often recognized from notable people such as the British nurse Edith Cavell or the American philosopher Stanley Cavell.","zh":"一个英文姓氏；常因一些知名人物而被认识，例如英国护士伊迪丝·卡维尔（Edith Cavell）或美国哲学家斯坦利·卡维尔（Stanley Cavell）。"},"examples":[{"en":"Edith Cavell is remembered for helping soldiers during World War I.","zh":"伊迪丝·卡维尔因在第一次世界大战期间帮助士兵而被人们纪念。"},{"en":"In philosophy class, we read an essay by Stanley Cavell.","zh":"在哲学课上，我们读了一篇斯坦利·卡维尔的文章。"}]}],"phonetic":"/kəˈvɛl/","extraExplanation":["“Cavell”通常作为姓氏使用；在英语里，人名/姓氏一般不翻译含义，而是音译（如“卡维尔”）。","Edith Cavell（1865–1915）是英国护士，在一战中帮助盟军士兵逃离占领区，后被德军处决；她在英国文化记忆中常被视为勇气与人道主义的象征。","Stanley Cavell（1926–2018）是美国哲学家，以日常语言哲学、电影与文学批评等领域的研究闻名。"]}
{"word":"caveman","summary":{"en":"A caveman is a prehistoric human (often portrayed living in a cave) or, informally, someone with outdated or rude attitudes.","zh":"caveman 指史前人类（常被描绘为穴居人）；也可非正式地指观念落伍或粗鲁的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A prehistoric human (or a character shown as one), often imagined as living in a cave and using simple stone tools.","zh":"史前人类；（常见于故事或影视中的）“穴居人”，通常被想象成住在洞穴里、使用简单石器的人。"},"examples":[{"en":"In the museum, we saw a model of a caveman making stone tools.","zh":"在博物馆里，我们看到一个“穴居人”制作石器的模型。"},{"en":"The cartoon shows a caveman wearing animal skins and carrying a club.","zh":"动画里有个穴居人穿着兽皮、拿着木棒。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) A person whose attitudes or behavior seem old-fashioned, rude, or not socially aware.","zh":"（非正式）思想或行为很落伍、粗鲁，或缺乏社会意识的人。"},"examples":[{"en":"He’s not a caveman, but he sometimes speaks as if women can’t lead.","zh":"他不是真正的“穴居人”，但他有时说话好像女人不能当领导一样。"},{"en":"Don’t be a caveman—clean up after yourself.","zh":"别那么“野蛮/落伍”——用完东西要收拾干净。"}]}],"synonyms":["prehistoric man","primitive human","Neanderthal (informal)","brute (informal)","old-fashioned person"],"phonetic":"/ˈkeɪvˌmæn/","extraExplanation":["“caveman”这个词在现代英语里常带有想象和夸张色彩：并不是所有史前人类都住在洞穴里。很多史前人类也住在临时营地或其他住所。","用来形容“落伍的人”时，语气可能带批评甚至冒犯；在正式场合更建议用“old-fashioned”“outdated”“sexist”等更具体、客观的词。"]}
{"word":"cavemen","summary":{"en":"Cavemen = prehistoric men (or early humans), and figuratively people who behave rudely or in an old-fashioned way.","zh":"cavemen 指史前人类（常被想象成洞穴人），也可比喻粗鲁或思想落后的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “caveman”: a prehistoric human (especially imagined as living in caves and using simple stone tools). In modern use, it can also mean someone who seems rude, aggressive, or old-fashioned.","zh":"“caveman”的复数：史前人类（常被想象为住在洞穴里、使用简单石器）。现代也可引申指粗鲁、好斗或思想很落后的人。"},"examples":[{"en":"In the museum, we saw drawings of cavemen hunting with stone spears.","zh":"在博物馆里，我们看到描绘史前人类用石矛狩猎的图画。"},{"en":"Stop acting like cavemen—talk calmly and share the space.","zh":"别像野人一样——冷静沟通、共同使用这个空间。"}]}],"synonyms":["prehistoric people","early humans","Neanderthals (informal/loose)","brutes (figurative)"],"phonetic":"/ˈkeɪvˌmɛn/","extraExplanation":["“cavemen”常带有“刻板印象”的色彩：并不是所有史前人类都住在洞穴里。更准确、较中性的说法有“prehistoric people / early humans”。","作比喻时（比如说某人“像caveman”）可能带有贬义或不礼貌，尤其在职场或正式场合要谨慎使用。"]}
{"word":"Cavendish","summary":{"en":"Cavendish most commonly refers to the widely sold banana variety; it can also be a surname (notably the scientist Henry Cavendish) and a place name.","zh":"Cavendish最常指常见的商业香蕉品种“卡文迪什”；也可作姓氏（著名人物如科学家亨利·卡文迪什）以及地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A variety of banana that is the most common type sold internationally (usually yellow, sweet, and mild).","zh":"卡文迪什香蕉（最常见的商业香蕉品种之一，通常为黄色、甜、味道温和）。"},"examples":[{"en":"Most supermarket bananas are Cavendish bananas.","zh":"大多数超市里的香蕉都是卡文迪什香蕉。"},{"en":"The Cavendish is popular because it ships well and ripens predictably.","zh":"卡文迪什之所以受欢迎，是因为它耐运输、成熟过程比较稳定。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name, especially known from the British scientist Henry Cavendish (1731–1810).","zh":"卡文迪什（姓氏；尤以英国科学家亨利·卡文迪什 1731–1810 著名）。"},"examples":[{"en":"Henry Cavendish made important discoveries in chemistry and physics.","zh":"亨利·卡文迪什在化学和物理学方面有重要发现。"},{"en":"In class, we talked about Cavendish and the measurement of Earth’s density.","zh":"课堂上我们谈到卡文迪什以及他对地球密度的测量。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name used in several English-speaking regions (for example, towns or communities called Cavendish).","zh":"卡文迪什（地名；英语地区有多个城镇/社区使用该名称）。"},"examples":[{"en":"They spent a weekend in Cavendish and visited local museums.","zh":"他们在卡文迪什度过了一个周末，并参观了当地的博物馆。"}]}],"synonyms":["(banana) dessert banana","(person) Henry Cavendish","(science) Cavendish experiment"],"phonetic":"ˈkævəndɪʃ","extraExplanation":["“Cavendish”作香蕉名称时，通常源自19世纪英国的卡文迪什家族（如第六代德文郡公爵 William Cavendish），据说该家族的温室/庄园种植并推广了这一品系，之后在全球商业化种植中占主导地位。","科学史上常说的“卡文迪什实验（Cavendish experiment）”指通过扭秤测量万有引力，从而估算地球平均密度；因此在理工科语境里，Cavendish 往往让人联想到这项经典实验。"]}
{"word":"cavendish","summary":{"en":"Cavendish most commonly refers to the standard supermarket banana variety; it can also be a British family name/title.","zh":"Cavendish最常指常见的超市香蕉品种“卡文迪许香蕉”；也可指英国的卡文迪许家族/姓氏与相关头衔。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a widely sold variety of banana (the common supermarket banana), known for its mild sweetness and good shipping qualities","zh":"卡文迪许香蕉（最常见的超市香蕉品种），口感温和偏甜、耐运输"},"examples":[{"en":"Most bananas in U.S. grocery stores are Cavendish bananas.","zh":"美国超市里大多数香蕉都是卡文迪许香蕉。"},{"en":"The Cavendish is popular because it travels well and stays firm.","zh":"卡文迪许香蕉很受欢迎，因为它耐运输、比较不容易变软。"}]},{"partOfSpeech":"n.","definition":{"en":"a British family name and title; used in names such as the Duke of Devonshire (House of Cavendish)","zh":"卡文迪许（英国姓氏与贵族家族名，如德文郡公爵所属的卡文迪许家族）"},"examples":[{"en":"The Cavendish family has played an important role in British aristocratic history.","zh":"卡文迪许家族在英国贵族历史中扮演过重要角色。"}]}],"synonyms":["Cavendish banana"],"phonetic":"/ˈkævənˌdɪʃ/","extraExplanation":["“Cavendish banana（卡文迪许香蕉）”得名与英国的卡文迪许家族有关：19世纪这种香蕉在其庄园温室中被培育、传播，因此用家族名命名。","在20世纪中期，曾经更常见的香蕉品种“Gros Michel（大米七/大麦克）”因病害（巴拿马病）大规模减产，卡文迪许逐渐成为全球主要商业品种；如今它也面临新的病害压力，所以新闻里常会提到“卡文迪许香蕉的危机”。"]}
{"word":"caveo","summary":{"en":"Caveo is a Latin verb meaning “I beware / I am careful,” mainly used in Latin phrases and as the root of “caveat.”","zh":"caveo 是拉丁语动词，意为“我当心/我谨慎”，多见于拉丁短语，并且是英语 caveat 的词源。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin, 1st‑person singular verb) “I beware / I am careful / I avoid.” It’s mainly seen in Latin texts or mottos, and it is the root of English words/phrases like “caveat.”","zh":"（拉丁语，第一人称单数动词）“我当心/我谨慎/我避免”。主要出现在拉丁文文本或格言中，也是英语词/短语如 caveat 的词源。"},"examples":[{"en":"In a Latin motto, “caveo” can mean “I am on guard.”","zh":"在拉丁文格言中，caveo 可表示“我保持警惕”。"},{"en":"The legal phrase “caveat emptor” (“let the buyer beware”) comes from the same root as “caveo.”","zh":"法律短语 caveat emptor（“买者自负/买者当心”）与 caveo 同源。"}]}],"synonyms":["beware","be cautious","watch out","avoid"],"phonetic":"ˈkɑː.veɪ.oʊ","extraExplanation":["caveō（常在英文资料中写作 caveo）是拉丁语动词，基本义是“当心、警惕、避免”。现代英语里几乎不直接使用 caveo，本词更多用于古典/法律/格言语境。","它与英语 caveat（警告、保留意见）同源；常见固定语 caveat emptor 直译为“让买方当心”，表示购物或交易中买方需要自行审慎判断。"]}
{"word":"caveola","summary":{"en":"A caveola is a tiny pocket in the cell membrane, important for signaling and transport.","zh":"caveola 指细胞膜上的微小凹陷结构（洞小窝），与信号传导和物质运输有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small pocket-like indentation (invagination) in the cell membrane, often involved in cell signaling and transporting substances into the cell.","zh":"（细胞生物学）细胞膜上的小凹陷/小囊状内陷，常参与细胞信号传导以及物质进入细胞的运输过程。"},"examples":[{"en":"Scientists studied how caveolae help cells respond to mechanical stress.","zh":"科学家研究了洞小窝（caveolae）如何帮助细胞应对机械压力。"},{"en":"Some viruses can enter cells through caveola-mediated pathways.","zh":"一些病毒可以通过“洞小窝介导”的途径进入细胞。"}]},{"partOfSpeech":"n.","definition":{"en":"A small natural cavity or hollow, especially in anatomical descriptions (less common).","zh":"（较少用）小洞穴/小腔隙；在解剖学描述中指小的空腔或凹陷。"},"examples":[{"en":"The report mentioned a small caveola-like hollow in the tissue.","zh":"报告提到组织中有一个类似小凹窝（caveola）的空隙。"}]}],"synonyms":["membrane invagination","cell membrane pit","microdomain"],"phonetic":"/ˌkæv.iˈoʊ.lə/","extraExplanation":["“caveola”来自拉丁语 cavea（洞、腔），caveola 是“小洞/小腔”的指小形式。生物学中更常见的复数形式是 caveolae（洞小窝）。在阅读论文时，常会看到相关词组：caveolin（洞蛋白，形成/标记洞小窝的关键蛋白）与 caveolae-mediated endocytosis（洞小窝介导的胞吞）。"]}
{"word":"caver","summary":{"en":"A caver is someone who explores caves.","zh":"caver 指“探洞者/洞穴探险者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who explores caves as a hobby, sport, or scientific activity; a cave explorer.","zh":"探洞者；洞穴探险者（以兴趣、运动或科研方式探索洞穴的人）。"},"examples":[{"en":"She’s an experienced caver who has explored caves on three continents.","zh":"她是一位经验丰富的探洞者，曾在三个大洲探索洞穴。"},{"en":"Local cavers helped rescuers map the underground passages.","zh":"当地的探洞者帮助救援人员绘制地下通道地图。"}]}],"synonyms":["cave explorer","spelunker"],"phonetic":"/ˈkeɪvɚ/","extraExplanation":["“caver”是中性、常用的说法。美式英语里也会说“spelunker”，但在一些严肃的洞穴探险圈子里，“spelunker”有时带一点“新手/不专业”的调侃意味，因此更正式或更尊重的说法常用“caver”或“cave explorer”。","相关常见搭配：caving gear（探洞装备）, caving expedition（探洞考察/远征）, cave rescue（洞穴救援）。"]}
{"word":"cavern","summary":{"en":"A cavern is a large cave or hollow space in rock, usually underground.","zh":"cavern 指巨大的洞穴或岩石内部（通常地下）的空腔。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large cave or a huge hollow space inside rock, often underground.","zh":"大洞穴；岩石内部（通常在地下的）巨大空腔。"},"examples":[{"en":"We explored a cavern filled with stalactites.","zh":"我们探险了一个布满钟乳石的巨大洞穴。"},{"en":"Bats often live in dark caverns.","zh":"蝙蝠常住在黑暗的洞穴里。"}]},{"partOfSpeech":"v.","definition":{"en":"To form a large hollow space; to become like a cavern.","zh":"形成巨大空洞；变得像洞穴一样空旷（较少用）。"},"examples":[{"en":"Over time, the rock caverns under the pressure of water.","zh":"随着时间推移，岩石在水的作用下形成空洞。"}]}],"synonyms":["cave","grotto","hollow"],"phonetic":"/ˈkævɚn/","extraExplanation":["词源上与拉丁语“caverna（洞穴）”有关，核心意思是“空的、凹进去的空间”。在文学或写作中，cavern常用来营造“幽暗、神秘、回声”的氛围。","常见搭配：a dark/underground cavern（黑暗的/地下的洞穴）；explore a cavern（探索洞穴）；cavern walls（洞壁）。相关词：cave（更常见、范围更广的“洞穴”），cavern（更强调“巨大、深、空旷”的洞穴）。"]}
{"word":"cavernal","summary":{"en":"Cavernal means “cave-like” or “related to a cavern.”","zh":"cavernal 指“洞穴般的”或“与洞穴有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a cavern; cave-like, especially in shape or structure.","zh":"与洞穴有关的；洞穴般的（尤指形状或结构像洞穴）。"},"examples":[{"en":"The hikers found a cavernal passage behind the waterfall.","zh":"徒步者在瀑布后面发现了一条洞穴般的通道。"},{"en":"The building’s basement had a cavernal feel—dark, cool, and echoing.","zh":"那栋楼的地下室有种洞穴般的感觉——阴暗、凉爽，还带回声。"}]}],"synonyms":["cave-like","cavernous","hollow","grotto-like"],"phonetic":"/kəˈvɝːnəl/","extraExplanation":["“cavernal”来自名词“cavern”（洞穴），加形容词后缀“-al”（表示“……的/与……有关的”）。在日常英语里，人们更常用“cavernous”来表示“像洞穴一样的大、空旷、回声重”；“cavernal”更偏书面或专业场景。"]}
{"word":"caverned","summary":{"en":"“Caverned” describes something that has caves or deep hollow spaces, or has been hollowed out into a cave-like shape.","zh":"“caverned”指“有洞穴/布满空洞的”，或“被掏空成洞穴状的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having caverns (large hollow spaces), or shaped/marked by deep hollows; cavernous.","zh":"有洞穴的；布满深坑/空洞的；（形状）像洞穴般的。"},"examples":[{"en":"We walked into a caverned cliff face where the waves had carved deep hollows.","zh":"我们走进了一个布满洞穴的悬崖面，海浪在上面凿出了很深的空洞。"},{"en":"In the novel, the hero hides in a caverned hillside to escape his enemies.","zh":"在小说里，英雄躲进了一个满是洞穴的山坡，以逃避敌人。"}]},{"partOfSpeech":"adj.","definition":{"en":"Hollowed out; excavated into a cavern-like space (often describing rock, earth, or a wall).","zh":"被掏空的；被挖成洞穴状空间的（常形容岩石、泥土或墙面）。"},"examples":[{"en":"The river has caverned the limestone over centuries.","zh":"几个世纪以来，这条河把石灰岩掏成了洞穴状。"},{"en":"They found a small room caverned into the soft rock.","zh":"他们发现了一间在软岩里凿出来的小房间。"}]}],"synonyms":["cavernous","hollowed","pitted","honeycombed"],"phonetic":"ˈkævərnd","extraExplanation":["“caverned”多见于描写性写作（如小说、诗歌、自然纪实），用来营造阴暗、幽深、回声感强的氛围。日常口语里更常用“cavernous（像洞穴一样的/空旷的）”或“full of caves（满是洞穴的）”。","词源上与“cavern（洞穴）”同根；“-ed”在这里常表示“具有……特征/被……形成”的形容词用法（如 wooded 森林茂密的、rugged 崎岖的）。"]}
{"word":"cavernicolous","summary":{"en":"Cavernicolous describes animals or organisms that live in caves or are associated with cave environments.","zh":"cavernicolous 用于描述居住在洞穴中或与洞穴环境有关的（多指生物）“穴居的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Living in or relating to caves; cave-dwelling.","zh":"居住在洞穴中的；与洞穴有关的；穴居的。"},"examples":[{"en":"Certain insects are cavernicolous and spend their whole lives in caves.","zh":"有些昆虫是穴居的，一生都生活在洞穴里。"},{"en":"The researchers studied cavernicolous fish that have adapted to darkness.","zh":"研究人员研究了适应黑暗生活的穴居鱼类。"}]}],"synonyms":["cave-dwelling","troglodytic","subterranean"],"phonetic":"/ˌkævərˈnɪkələs/","extraExplanation":["词源小提示：cavern（洞穴）+ -colous（居住的/栖居的，来自拉丁语 colere“居住、耕作、栖息”）。在生物学与生态学文章里较常见，用来描述“以洞穴为主要栖息地”的物种。","相关术语辨析：troglodytic（穴居的，常指“终生严格穴居”的生物）有时更强调“只能在洞穴中生存”；cavernicolous 更偏“栖息于洞穴”这一生态特征，语气更中性。"]}
{"word":"caverning","summary":{"en":"“Caverning” is a rare word meaning “forming caverns” or “becoming cavern-like.” In most writing, people use “cavernous” or “cavern.”","zh":"“caverning”很少见，可表示“形成洞穴”或“变得像洞穴一样”。大多数写作中更常用“cavernous”或“cavern”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(rare) The act or process of forming caves/caverns; hollowing out into cave-like spaces.","zh":"（罕见）形成洞穴/岩洞的过程；把某物掏空成洞穴状。"},"examples":[{"en":"Water has been caverning the limestone for thousands of years.","zh":"水已经侵蚀石灰岩数千年，逐渐形成洞穴。"},{"en":"The glacier’s meltwater is caverning the rock beneath the ice.","zh":"冰川融水正在把冰下的岩石侵蚀出洞穴般的空腔。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare, informal) Looking or becoming cavern-like: very hollow, deep, or full of large dark spaces.","zh":"（罕见/非正式）呈洞穴状的；变得很空、很深，或充满巨大阴暗空间的。"},"examples":[{"en":"The abandoned building’s basement felt caverning and cold.","zh":"那座废弃建筑的地下室让人感觉像洞穴一样空旷阴冷。"},{"en":"Her voice echoed in the caverning corridor.","zh":"她的声音在那条像洞穴般的走廊里回响。"}]}],"synonyms":["hollowing (out)","eroding","burrowing","cavernous (more common)"],"phonetic":"/ˈkævɚnɪŋ/","extraExplanation":["“caverning”并不是常见词。多数情况下，你可能想写：\n- **cavernous**（adj.）“像洞穴的；巨大而空旷的”（例如：a cavernous hall 巨大空旷的大厅）\n- **cavern**（n.）“岩洞；洞穴”\n如果你告诉我句子上下文，我可以帮你判断更自然的用词。"]}
{"word":"cavernitis","summary":{"en":"Cavernitis is a medical term meaning inflammation of the corpus cavernosum (erectile tissue).","zh":"cavernitis 是医学术语，指海绵体（勃起组织，常指阴茎海绵体）的炎症。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) Inflammation of erectile tissue, especially the corpus cavernosum (most often in the penis).","zh":"（医学）海绵体炎：勃起组织（尤指阴茎海绵体）的炎症。"},"examples":[{"en":"The urologist considered cavernitis after the patient reported penile pain and swelling.","zh":"患者报告阴茎疼痛和肿胀后，泌尿科医生考虑了海绵体炎的可能性。"},{"en":"If cavernitis is caused by infection, antibiotics may be needed.","zh":"如果海绵体炎由感染引起，可能需要使用抗生素。"}]}],"synonyms":["inflammation of the corpus cavernosum","corpus cavernosum inflammation"],"phonetic":"/ˌkævərˈnaɪtɪs/","extraExplanation":["这是一个较少见、偏专业的医学词，日常英语中不常用，更常在泌尿科或医学文献里出现。","词源上可拆为 cavern-（指“腔、海绵体/海绵状结构”）+ -itis（表示“炎症”），很多疾病名都用 -itis 结尾（如 tonsillitis 扁桃体炎）。","若你是在体检报告或医学文章里看到该词，建议同时关注上下文是否提到感染、外伤、疼痛、肿胀等信息，并向专业医生确认诊断与治疗。"]}
{"word":"cavernlike","summary":{"en":"“Cavernlike” describes something that feels like a cave—spacious, hollow, deep, and often dark or echoing.","zh":"“cavernlike”用来形容像洞穴一样的感觉——空旷、深邃，常带昏暗或回声感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like a cavern; large, deep, dark, or hollow in a way that reminds you of a cave.","zh":"像洞穴的；（空间）巨大、深邃、昏暗或空旷得让人联想到洞穴的。"},"examples":[{"en":"The cathedral’s cavernlike interior echoed with every footstep.","zh":"大教堂像洞穴一样空旷的内部空间里，每一步都回响不断。"},{"en":"He spoke into the cavernlike room, and his voice sounded distant.","zh":"他对着那间洞穴般的房间说话，声音听起来很遥远。"}]}],"synonyms":["cavelike","grotto-like","hollow","vaulted","echoing"],"phonetic":"/ˈkævɚnˌlaɪk/","extraExplanation":["“cavernlike”是由名词“cavern（大洞穴）”+ “-like（像……一样的）”构成的形容词，常用于描写空间的“空旷回声感”、光线的“幽暗感”，或内部结构的“深而多空洞”的感觉。","写作中它带一点氛围感（often moody/atmospheric）：不仅描述大小，也暗示声音回荡、光线不足、甚至神秘或压迫的情绪。"]}
{"word":"cavernoma","summary":{"en":"A cavernoma is a cavernous malformation: a cluster of abnormal blood vessels, often in the brain or spinal cord.","zh":"cavernoma 指海绵状血管瘤/海绵状血管畸形：多见于脑或脊髓的异常血管团。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A cluster of abnormal, dilated blood vessels (a cavernous malformation), usually in the brain or spinal cord, which can sometimes bleed and cause symptoms such as headaches, seizures, or neurological problems.","zh":"（医学）海绵状血管瘤/海绵状血管畸形：由异常扩张的血管形成的团块，常见于脑或脊髓，有时会出血并引起头痛、癫痫或神经功能异常等症状。"},"examples":[{"en":"The MRI showed a cavernoma in the patient’s temporal lobe.","zh":"核磁共振显示患者颞叶有一个海绵状血管瘤。"},{"en":"Some cavernomas cause no symptoms and are found by accident.","zh":"有些海绵状血管瘤没有症状，是偶然检查发现的。"},{"en":"Her neurologist explained that a cavernoma can sometimes bleed and irritate nearby brain tissue.","zh":"神经科医生解释说，海绵状血管瘤有时会出血，并刺激附近的脑组织。"}]}],"synonyms":["cavernous malformation","cerebral cavernous malformation (CCM)","cavernous angioma"],"phonetic":"/ˌkævərˈnoʊmə/","extraExplanation":["“Cavernoma”在英式医学英语中更常见；在美式语境里常用更通用的说法“cavernous malformation”。","它不是日常英语词汇，更多出现在医疗报告、影像学描述（MRI/CT）和神经外科/神经科沟通中。","发音里“-oma”是医学后缀，常表示“肿瘤/肿块”，但cavernoma更准确指“血管畸形”，不一定是典型意义上的肿瘤。"]}
{"word":"cavernous","summary":{"en":"“Cavernous” describes something very large and hollow inside, often with an echoing, cave-like feeling.","zh":"“cavernous”形容内部非常大而空旷，像洞穴一样，常带回声感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like a cavern: very large, deep, and hollow inside; spacious in an echoing way.","zh":"像洞穴一样的：内部非常大、深且空旷的；常带有回声感的宽阔。"},"examples":[{"en":"They walked into a cavernous hall that made every footstep echo.","zh":"他们走进一座空旷如洞穴的大厅，每一步都回响。"},{"en":"The old factory felt cavernous after the machines were removed.","zh":"机器搬走后，那座旧工厂显得格外空旷。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having a large hollow space (especially in the body), or shaped like a cavity.","zh":"（尤指身体里）有很大的空腔；或呈腔状的。"},"examples":[{"en":"Doctors found a cavernous space in the tissue on the scan.","zh":"医生在扫描中发现组织里有一个较大的空腔。"},{"en":"Bats slept in a cavernous opening under the bridge.","zh":"蝙蝠睡在桥下一个腔状的大洞口里。"}]}],"synonyms":["spacious","vast","echoing","hollow","cave-like"],"phonetic":"/ˈkævɚnəs/","extraExplanation":["“cavernous”来自“cavern（洞穴）”。它常用来描写建筑空间（如大厅、仓库、教堂）给人的“空、深、回声大”的感觉。","常见搭配：cavernous room/hall/warehouse（空旷的房间/大厅/仓库）；cavernous interior（空旷的内部）。语气通常偏生动、形象。"]}
{"word":"cavernously","summary":{"en":"“Cavernously” means “in a cavernous, cave-like way,” often describing echoing sounds or an empty, hollow-feeling space.","zh":"“cavernously”表示“像洞穴般空旷、深而有回声地”，常用来形容回响的声音或空荡的空间感。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is very large, deep, and hollow—like a cave; often describing a space that feels open and echoing.","zh":"以像洞穴一样巨大、深而空旷的方式；常用来形容空间开阔、回声明显。"},"examples":[{"en":"Footsteps rang cavernously in the empty hallway.","zh":"脚步声在空荡的走廊里空旷地回响。"},{"en":"The old warehouse opened cavernously before us.","zh":"那座旧仓库在我们面前显得格外空旷深邃。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Figurative) With a hollow, echoing quality, especially of a voice, silence, or sound.","zh":"（比喻）以空洞、回响的质感，尤指声音、沉默或声响。"},"examples":[{"en":"His laugh sounded cavernously, as if it came from far away.","zh":"他的笑声听起来空洞回响，仿佛从很远的地方传来。"},{"en":"The room fell cavernously silent after the announcement.","zh":"宣布之后，房间陷入了空洞般的寂静。"}]}],"synonyms":["hollowly","echoingly","resoundingly"],"phonetic":"/ˈkævɚnəsli/","extraExplanation":["“cavernously”来自形容词“cavernous（像洞穴的；空旷回响的）”加副词后缀“-ly”。它在日常口语中不算常见，更常见的替代表达有“echoed loudly / sounded hollow / in a huge empty space”等。","这个词常与表示声音的动词搭配（如 ring, echo, boom, sound），用来强调“空旷造成的回声感”。"]}
{"word":"caverns","summary":{"en":"Caverns are large natural caves; it can also mean to hollow out or form caves.","zh":"caverns 指大型天然洞穴；也可作动词，表示侵蚀形成洞穴或使中空。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Large natural underground spaces (caves), often formed in rock; the plural form of “cavern.”","zh":"（天然形成的）大洞穴；地下的巨大空洞（“cavern”的复数）"},"examples":[{"en":"The explorers used headlamps to move through the dark caverns.","zh":"探险者用头灯在黑暗的洞穴中前进。"},{"en":"Water slowly carved caverns into the limestone over thousands of years.","zh":"流水在数千年间慢慢在石灰岩中侵蚀出洞穴。"},{"en":"Bats often sleep in caverns during the day.","zh":"蝙蝠常在白天栖息在洞穴里。"}]},{"partOfSpeech":"v.","definition":{"en":"To form into a cavern; to hollow out (often used in descriptions of nature or geology).","zh":"形成洞穴；使（岩石等）中空、挖空（多用于自然或地质描写）"},"examples":[{"en":"Over time, the river caverns the rock beneath the cliff.","zh":"随着时间推移，河水会把悬崖下的岩石侵蚀成洞穴。"},{"en":"Acidic groundwater can cavern limestone into complex cave systems.","zh":"酸性地下水会把石灰岩侵蚀成复杂的洞穴系统。"}]}],"synonyms":["caves","grottos","hollows","cavities"],"phonetic":"/ˈkævərnz/","extraExplanation":["“cavern”通常比“cave”更强调“空间很大、内部像大厅一样空旷”。日常口语更常用“cave”，但在旅行写作、地理/地质介绍中，“cavern”很常见（如 Carlsbad Caverns）。","词源来自拉丁语“caverna”（洞穴）。在文学或叙事里，caverns常带有“幽暗、回声、神秘”的氛围。"]}
{"word":"cavernulous","summary":{"en":"Cavernulous means “full of caverns” or “cave-like and hollow.”","zh":"cavernulous 指“布满洞穴的”或“像洞穴一样空旷多空洞的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Full of caverns (large caves) or having many hollow, cave-like spaces; cavernous.","zh":"布满洞穴的；多空洞的；（像洞穴一样）深而空旷的。"},"examples":[{"en":"The cavernulous limestone was shaped by water over thousands of years.","zh":"这片布满洞穴的石灰岩经过数千年的流水侵蚀而形成。"},{"en":"Bats often live in cavernulous rock formations.","zh":"蝙蝠常栖息在多洞穴的岩层结构中。"}]}],"synonyms":["cavernous","hollow","cave-riddled","pitted"],"phonetic":"/kəˈvɝːn.jə.ləs/","extraExplanation":["“cavernulous”是比较少见、偏书面/科学（尤其地质学、洞穴研究）用词，意思接近更常见的“cavernous”。","构词上：cavern（洞穴）+ -ulous（表示“充满……的”），类似的还有“granulous”（颗粒状的）、“tuberculous”（结核的，字面含“多结节的”）。"]}
{"word":"cavers","summary":{"en":"Cavers are people who explore caves.","zh":"cavers 指“洞穴探险者/探洞者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who explore caves as a sport, hobby, or scientific activity","zh":"洞穴探险者；探洞者（把洞穴探索当作运动、兴趣或科学活动的人）"},"examples":[{"en":"A group of cavers entered the limestone cave with helmets and headlamps.","zh":"一群洞穴探险者戴着头盔和头灯进入石灰岩洞穴。"},{"en":"Experienced cavers always check ropes and safety gear before going underground.","zh":"有经验的探洞者在下洞前总会检查绳索和安全装备。"},{"en":"The park asks cavers to avoid touching bats and delicate cave formations.","zh":"公园要求探洞者不要触碰蝙蝠和脆弱的洞穴结构。"}]}],"synonyms":["spelunkers","cave explorers"],"phonetic":"/ˈkeɪvərz/","extraExplanation":["在英语里，caver 通常是中性、较专业的说法；spelunker 也指“洞穴探险者”，但在一些洞穴运动圈里，spelunker 有时带点“外行、初学者”的调侃意味（语气因地区和语境而异）。"]}
{"word":"Caves","summary":{"en":"“Caves” usually means multiple natural underground spaces; as a verb (often “cave in”), it means to collapse or to give in.","zh":"“Caves” 通常指多个洞穴；作动词（常见为 cave in）可表示“坍塌”或“屈服/让步”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large natural hole or chamber in the ground or in the side of a hill or mountain, often made in rock.","zh":"洞穴；天然的大洞或地下空间（常在岩石中形成）。"},"examples":[{"en":"They explored a cave near the coast.","zh":"他们探索了海岸附近的一个洞穴。"},{"en":"Bats often live in caves because it’s dark and safe.","zh":"蝙蝠常住在洞穴里，因为那里又黑又安全。"}]},{"partOfSpeech":"n.","definition":{"en":"A system of connected natural underground passages and rooms.","zh":"洞穴系统；相连的地下通道和洞室。"},"examples":[{"en":"This region has many caves formed by water over thousands of years.","zh":"这个地区有许多洞穴，是水经过数千年形成的。"},{"en":"The guide warned us not to enter the caves without proper equipment.","zh":"导游警告我们没有合适装备不要进入洞穴群。"}]},{"partOfSpeech":"v.","definition":{"en":"To collapse or fall inward; to give way under pressure (often used as “cave in”).","zh":"（向内）坍塌；塌陷（常用作 cave in）。"},"examples":[{"en":"The roof of the tunnel caved in after the storm.","zh":"暴风雨后，隧道顶部塌陷了。"},{"en":"The old mine might cave in if people walk inside.","zh":"如果有人走进那座旧矿井，可能会塌方。"}]},{"partOfSpeech":"v.","definition":{"en":"To stop resisting and agree to demands; to surrender (often used as “cave in”).","zh":"屈服；让步（常用作 cave in）。"},"examples":[{"en":"He finally caved in and apologized.","zh":"他最后还是让步并道歉了。"},{"en":"Don’t cave in to peer pressure.","zh":"不要向同伴压力屈服。"}]}],"synonyms":["caverns","grottos","cave systems","collapse (cave in)","give in (cave in)"],"phonetic":"/keɪv/","extraExplanation":["“Caves” 可能是名词复数（many caves），也可能是动词第三人称单数（He caves in）。最常见搭配是短语动词 “cave in”，既可指“坍塌”，也可指“屈服/让步”，要靠语境判断。","词源上 “cave” 来自拉丁语 *cavus*（空的、凹的），所以与“空洞/凹陷”的概念有关。"]}
{"word":"caves","summary":{"en":"“Caves” most commonly means more than one cave; it can also mean “gives in” or “collapses inward,” as the third-person singular of the verb “cave.”","zh":"“caves”最常见是“洞穴”的复数；也可作动词“cave”的第三人称单数，表示“屈服/让步”或“坍塌/塌陷”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “cave”: large natural holes or chambers in rock, often underground.","zh":"“cave”的复数：洞穴；（通常在地下的）天然岩洞。"},"examples":[{"en":"The park has several caves that visitors can explore.","zh":"这个公园有好几个洞穴，游客可以去探险。"},{"en":"Bats often sleep in caves during the day.","zh":"蝙蝠白天常常在洞穴里睡觉。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular of “cave”: to give in under pressure; to stop resisting.","zh":"“cave”的第三人称单数：屈服；在压力下让步。"},"examples":[{"en":"He usually caves when everyone disagrees with him.","zh":"当大家都不同意他时，他通常会让步。"},{"en":"She never caves to unfair demands.","zh":"她从不向不公平的要求屈服。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular of “cave”: (of a structure or ground) to collapse inward; to fall in.","zh":"“cave”的第三人称单数：（建筑物或地面）向内坍塌；塌陷。"},"examples":[{"en":"The roof caves after the heavy snowfall.","zh":"大雪过后，屋顶塌陷了。"},{"en":"If the sand is too loose, the tunnel caves easily.","zh":"如果沙子太松，隧道很容易塌。"}]}],"synonyms":["caverns","grottoes","yields","gives in","collapses","falls in"],"phonetic":"/keɪvz/","extraExplanation":["口语里更常见的是短语“cave in”（屈服/塌陷）。例如：“He caved in and apologized.”（他最终让步并道歉了。）；“The floor caved in.”（地板塌陷了。）","区分两种意思的小技巧：谈“人/态度”多是“屈服”；谈“屋顶/地面/墙”多是“坍塌”。"]}
{"word":"cavesson","summary":{"en":"A cavesson is a noseband on a horse’s bridle, or a firm training noseband used for lunging and groundwork.","zh":"cavesson 指马具中的鼻带，也可指用于绕圈牵绳与地面训练的硬质训练鼻箍。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strap or noseband on a horse’s bridle that goes around the horse’s nose, used to help control or guide the horse.","zh":"（马具）鼻带／鼻箍：套在马鼻子周围的带子，用来辅助控制或引导马。"},"examples":[{"en":"The trainer adjusted the cavesson so it sat comfortably on the horse’s nose.","zh":"训练师调整了鼻带，让它在马鼻子上戴得更舒适。"},{"en":"A cavesson can help steady the horse during basic training.","zh":"在基础训练中，鼻带可以帮助马保持稳定。"}]},{"partOfSpeech":"n.","definition":{"en":"A special training headgear with a firm noseband (often with rings) used for lunging and groundwork.","zh":"（训练用）套索鼻箍：带有较硬鼻带（常带金属环）的训练头具，用于绕圈牵绳（lunging）和地面训练。"},"examples":[{"en":"She clipped the lunge line to the ring on the cavesson.","zh":"她把绕圈牵绳扣在训练鼻箍的环上。"},{"en":"Using a cavesson, he practiced circles and turns from the ground.","zh":"他用训练鼻箍做地面绕圈和转向练习。"}]}],"synonyms":["noseband","training cavesson","lunging cavesson"],"phonetic":"/ˈkævəsən/","extraExplanation":["“cavesson”多用于马术语境，日常英语里不常见；在阅读马术训练、骑术教材或看比赛解说时更容易遇到。","词源上常认为与法语（如 *caveçon*）有关，指马具中的鼻部束带。","佩戴位置与松紧很重要：太紧会不舒服、影响呼吸；太松则起不到引导作用。不同流派（如古典盛装舞步/基础地面训练）对使用方式也可能不同。"]}
{"word":"Cavetown","summary":{"en":"Cavetown is best known as the stage name of indie pop musician Robin Skinner; rarely, it can literally mean a town associated with caves.","zh":"Cavetown 最常见的意思是独立流行音乐人 Robin Skinner 的艺名；较少见时也可按字面指“与洞穴有关的城镇”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a stage name for the English indie pop musician Robin Skinner (also used as the name of his music project/band).","zh":"英国独立流行音乐人 Robin Skinner 的艺名（也指他的音乐企划/乐队名）。"},"examples":[{"en":"I’ve been listening to Cavetown on repeat while studying.","zh":"我学习的时候一直在循环听 Cavetown。"},{"en":"Cavetown’s songs often feel gentle and emotional.","zh":"Cavetown 的歌常常给人温柔又很有情绪的感觉。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, literal) a town known for caves, or a town with many caves.","zh":"（较少见，字面）以洞穴闻名的城镇；洞穴很多的小镇。"},"examples":[{"en":"The guide described the area as a cavetown built near a huge cave system.","zh":"导游把那一带形容为建在巨大洞穴群附近的“洞穴小镇”。"}]}],"synonyms":["(music) Robin Skinner (real name)"],"phonetic":"/ˈkeɪvtaʊn/","extraExplanation":["“Cavetown”作为音乐人名称时，通常被视为专有名词，因此常见写法是首字母大写：Cavetown。","该艺名在网络音乐圈（如YouTube、Spotify）很常见，作品常被归为 indie pop / bedroom pop 等风格。","谈到艺人本身时可用单数：“Cavetown is…”；谈到其作品或团队时也可能听到“Cavetown are…”，但美式英语里更常用单数。"]}
{"word":"cavetti","summary":{"en":"Cavetti are low training poles/rails used in horse riding, commonly a variant of “cavalletti.”","zh":"cavetti 指马术训练用的低栏/地杆，常见为 “cavalletti” 的变体写法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Equestrian) Low training rails or poles set on the ground or slightly raised, used to improve a horse’s rhythm, balance, and stride. Often treated as a variant/misspelling of “cavalletti.”","zh":"（马术）放在地面上或略微抬起的低栏/训练杆，用来训练马的节奏、平衡与步幅。常被视为 “cavalletti” 的变体或误拼。"},"examples":[{"en":"The trainer set up cavetti to help the horse lengthen and shorten its stride.","zh":"教练摆了几组 cavetti 来帮助马练习加长与缩短步幅。"},{"en":"We trotted over the cavetti in a steady rhythm.","zh":"我们以稳定的节奏小跑越过 cavetti。"}]}],"synonyms":["cavalletti","ground poles","training poles","trot poles"],"phonetic":"/ˌkævəˈlɛti/","extraExplanation":["在马术语境里，更常见、也更标准的拼写是意大利语借词 **cavalletti**（复数），常指用于地杆训练或小障碍训练的一排训练杆/小栏。你看到的 **cavetti** 可能是简写、误拼，或在少数马房/地区的口语写法。","读音通常也按 **cavalletti** 来读。相关训练常用于盛装舞步与场地障碍的基础练习，强调步伐的规律性与身体协调。"]}
{"word":"cavetto","summary":{"en":"Cavetto is an architectural term for a concave, quarter-round molding used as decorative trim or a cornice.","zh":"Cavetto 是建筑术语，指呈四分之一圆弧的凹形线脚，用作装饰收边或檐口。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Architecture) a concave molding with a quarter-circle curve, often used as a cornice or decorative trim along the top of a wall or around a doorway.","zh":"（建筑）凹形线脚；一种呈四分之一圆弧的内凹装饰线条，常用于檐口、墙顶或门窗边缘。"},"examples":[{"en":"The museum’s entrance is finished with a cavetto molding above the doors.","zh":"博物馆入口的门上方用凹形线脚做了收边装饰。"},{"en":"In the restoration, the architect matched the original cavetto profile to keep the façade consistent.","zh":"修复时，建筑师按原有的凹形线脚曲线复原，以保持立面风格一致。"}]}],"synonyms":["concave molding","cove molding","cove","cavetto molding","cavetto cornice"],"phonetic":"/kəˈvɛtoʊ/","extraExplanation":["“cavetto”来自意大利语，和拉丁语词根“cav-”（意为“空的、凹的”）有关，所以它强调的是“向内凹”的弧面。","在古埃及建筑中常见一种“Egyptian cavetto cornice（埃及式凹檐口）”，常配合象形纹饰出现在神庙与纪念性建筑的顶部边缘，用来形成强烈的光影效果。"]}
{"word":"cavettos","summary":{"en":"“Cavettos” means concave moldings/grooves in architecture (plural of cavetto).","zh":"“cavettos”指建筑装饰中的凹形线脚/凹槽，是 cavetto 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a concave (inward-curving) molding or groove used in architecture and design; plural of “cavetto.”","zh":"（建筑/装饰中的）凹形线脚、凹槽；“cavetto”的复数。"},"examples":[{"en":"The museum’s facade is finished with cavettos that soften the edge between the wall and the roof.","zh":"博物馆的立面用凹形线脚收边，让墙面与屋顶的衔接更柔和。"},{"en":"The restorer cleaned the dust from the cavettos along the stone columns.","zh":"修复师清理了石柱上凹形线脚里的灰尘。"}]}],"synonyms":["concave molding","cove molding","cove","molding"],"phonetic":"/kəˈvɛtoʊ/","extraExplanation":["“cavetto”多用于建筑、古典柱式与装饰线脚的语境，指一种向内凹的弧形截面（与向外凸的“ovolo”相对）。在讲到古埃及建筑时也常出现，例如“Egyptian cavetto cornice（埃及式凹形飞檐/檐口）”。","“cavettos”是较少见的复数形式；在学术或建筑写作里也可能见到拉丁/意大利风格复数“cavetti”。两者通常都能被理解。"]}
{"word":"cavey","summary":{"en":"“Cavey” is usually a misspelling of “cavy,” meaning a guinea pig.","zh":"“cavey”通常是“cavy”的误拼，指豚鼠（天竺鼠）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A common misspelling of “cavy,” meaning a guinea pig (a small South American rodent), or more generally an animal in the cavy family.","zh":"“cavy”的常见拼写错误，意思是“豚鼠/天竺鼠”（一种来自南美的小型啮齿动物），也可泛指豚鼠科动物。"},"examples":[{"en":"We kept two cavies (guinea pigs) as pets when I was a kid.","zh":"我小时候养过两只豚鼠（天竺鼠）当宠物。"},{"en":"Some people write “cavey,” but the standard spelling is “cavy.”","zh":"有些人会写成“cavey”，但标准拼写是“cavy”。"}]}],"synonyms":["guinea pig"],"phonetic":"/ˈkeɪvi/","extraExplanation":["“cavy”在英文里是较偏书面/专业的词，日常更常说“guinea pig”。","词源上与南美当地语言有关，进入英语后用于指代豚鼠及其近缘动物；因此拼写固定为“cavy”，不是“cavey”。"]}
{"word":"Cavia","summary":{"en":"Cavia is the scientific genus name for guinea pigs and related rodents.","zh":"Cavia 是豚鼠（天竺鼠）及其近亲的科学属名（豚鼠属）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of South American rodents that includes the domestic guinea pig (scientific name: Cavia porcellus)","zh":"豚鼠属（南美洲啮齿动物的一属，包含家养天竺鼠/豚鼠，学名：Cavia porcellus）"},"examples":[{"en":"The domestic guinea pig belongs to the genus Cavia.","zh":"家养豚鼠属于豚鼠属（Cavia）。"},{"en":"In the lab report, the species was listed as Cavia porcellus.","zh":"在实验报告里，该物种被写作 Cavia porcellus（家豚鼠/天竺鼠）。"}]}],"synonyms":["guinea pig (genus)","cavy (related term)"],"phonetic":"ˈkeɪviə","extraExplanation":["“Cavia”是生物分类学里的拉丁化属名，日常英语里更常说“guinea pig”（天竺鼠/豚鼠）。","拼写时首字母通常大写（Cavia），表示“属”；如果写具体物种，会用两段式命名（如 Cavia porcellus），属名大写、种加词小写。"]}
{"word":"cavia","summary":{"en":"Cavia is the scientific genus name for guinea pigs and their close relatives.","zh":"Cavia 是豚鼠（天竺鼠）及其近缘动物的科学属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small South American rodents that includes the domestic guinea pig (Cavia porcellus).","zh":"豚鼠属（南美洲小型啮齿动物的一属，包含家养豚鼠/天竺鼠 Cavia porcellus）。"},"examples":[{"en":"The domestic guinea pig belongs to the genus Cavia.","zh":"家养豚鼠属于豚鼠属（Cavia）。"},{"en":"In biology class, we learned that Cavia are herbivorous rodents from South America.","zh":"在生物课上，我们学到豚鼠属（Cavia）是来自南美洲的食草啮齿动物。"}]}],"synonyms":["guinea pig","cavy"],"phonetic":"/ˈkeɪviə/","extraExplanation":["“Cavia”是动物分类学（拉丁学名）中的属名，日常英语里更常说“guinea pig”或“cavy”。","常见物种是 Cavia porcellus（家豚鼠），在宠物与实验动物语境中都很常见。"]}
{"word":"caviar","summary":{"en":"Caviar is salted fish eggs (usually sturgeon roe) eaten as a luxury food.","zh":"caviar 指腌制的鱼卵（常为鲟鱼卵）制成的高档食品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the salted eggs (roe) of sturgeon or similar fish, eaten as a luxury food, often served in small amounts","zh":"鱼子酱：通常指鲟鱼等鱼类的腌制鱼卵，被视为高档食物，常少量食用"},"examples":[{"en":"They served caviar on toast points at the wedding reception.","zh":"婚礼招待会上他们用小烤面包片配鱼子酱。"},{"en":"Caviar is often paired with blinis, sour cream, and a little lemon.","zh":"鱼子酱常搭配俄式薄饼、酸奶油和一点柠檬。"},{"en":"Real sturgeon caviar can be very expensive.","zh":"真正的鲟鱼子酱可能非常昂贵。"}]}],"synonyms":["roe","fish roe"],"phonetic":"/ˈkæviˌɑr/","extraExplanation":["“caviar”常被当作“奢华、讲究品味”的象征，因此在比喻里也可能表示“只有少数人懂得欣赏的东西”。例如：It’s caviar to the general（对大众来说太小众/不合口味）。","常见搭配：caviar and champagne（鱼子酱配香槟）；a tin/jar of caviar（一罐鱼子酱）；black caviar（黑鱼子酱）；red caviar（红鱼子/常指鲑鱼卵，严格来说不一定算“真正的鲟鱼子酱”）。"]}
{"word":"caviare","summary":{"en":"Caviare is an older/less common spelling of caviar, meaning salted fish eggs eaten as a luxury food.","zh":"caviare 是 caviar 的较旧/较少见拼写，指作为奢侈食品食用的盐渍鱼卵（鱼子酱）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Caviar: salted fish eggs (roe), usually from sturgeon, eaten as a luxury food.","zh":"鱼子酱：用盐腌制的鱼卵（通常来自鲟鱼），被视为高档食物。"},"examples":[{"en":"They served caviare with crackers and sour cream.","zh":"他们用饼干和酸奶油搭配鱼子酱。"},{"en":"Caviare is often considered a luxury item at formal parties.","zh":"在正式聚会上，鱼子酱常被认为是奢侈食物。"}]}],"synonyms":["caviar","roe"],"phonetic":"/ˈkæviˌɑr/","extraExplanation":["“caviare”是“caviar”的较少见拼写，在现代英语里更常写作“caviar”。","在莎士比亚《哈姆雷特》中有一句著名台词“the caviare to the general”，意思是“对大众来说过于高雅/不合口味的东西”（类似“阳春白雪”）。这也让“caviare”带有一点文学色彩。"]}
{"word":"caviares","summary":{"en":"“Caviares” is an uncommon plural of “caviar,” used mainly when talking about different kinds of caviar.","zh":"“caviares”是“caviar（鱼子酱）”较少见的复数形式，多用于强调不同种类的鱼子酱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural form of caviar: salt-cured fish eggs (roe), eaten as a luxury food.","zh":"caviar（鱼子酱）的复数：腌制的鱼卵，常被视为高档食物。"},"examples":[{"en":"The menu listed several caviares from different regions.","zh":"菜单上列出了来自不同产地的几种鱼子酱。"},{"en":"They compared the flavors of three caviares in a tasting session.","zh":"他们在品鉴中比较了三种鱼子酱的风味。"}]}],"synonyms":["caviar (uncountable)","types of caviar","varieties of caviar"],"phonetic":"/ˈkæv.i.ɑr/","extraExplanation":["“caviares”在现代英语里不太常见；更常见的写法是把“caviar”当作不可数名词（例如：some caviar, a tin of caviar）。在强调“不同种类/产地的鱼子酱”时，才可能用复数“caviares”。","“caviar”一词与法语用法有关，因此在高档餐饮语境中有时会出现较“法式”的复数写法，但日常英语里用“types/varieties of caviar”更自然。"]}
{"word":"caviars","summary":{"en":"“Caviars” means different kinds or portions of caviar (a luxury food made from salted fish roe).","zh":"“caviars”指鱼子酱的复数，常用于表示不同种类/产地的鱼子酱（盐渍鱼卵制成的奢侈食品）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of caviar: salted fish eggs (roe), eaten as a luxury food.","zh":"caviar 的复数：鱼子（鱼卵）经盐渍处理后作为奢侈食品食用。"},"examples":[{"en":"The menu listed several caviars from different regions.","zh":"菜单上列出了几种来自不同产地的鱼子酱。"},{"en":"She compared the taste of the caviars side by side.","zh":"她把几种鱼子酱放在一起对比品尝。"}]}],"synonyms":["roe (general)","fish roe (general)","caviar (uncountable form)"],"phonetic":"/ˈkæviˌɑr/","extraExplanation":["“Caviar”在日常英语里常作不可数名词（e.g., Some caviar），但在谈论“不同品种/产地/等级”时也会用可数形式，因而出现复数“caviars”。","传统上“caviar”多指鲟鱼卵（sturgeon roe）；其他鱼卵常会写成“salmon caviar / trout caviar”等来说明来源。"]}
{"word":"cavicorn","summary":{"en":"“Cavicorn” isn’t a standard English word; it’s probably a typo or a coined name (possibly “Capricorn” or “unicorn”).","zh":"“cavicorn”不是标准英语单词；可能是拼写错误或自造名称（可能想写“Capricorn”或“unicorn”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a made-up/blended word (for example, you may have meant “Capricorn” or “unicorn”).","zh":"不是标准英语单词。它很可能是拼写错误或自造/混成词（例如你可能想写“Capricorn（摩羯座）”或“unicorn（独角兽）”）。"},"examples":[{"en":"I couldn’t find “cavicorn” in a dictionary—did you mean “Capricorn”?","zh":"我在词典里找不到“cavicorn”——你是不是想写“Capricorn（摩羯座）”？"},{"en":"If “cavicorn” is a character name, you can define it in your story the first time it appears.","zh":"如果“cavicorn”是角色名，你可以在故事里第一次出现时就把它的含义交代清楚。"}]}],"phonetic":"ˈkævɪkɔrn","extraExplanation":["“Capricorn”是很常见的词：既可以指黄道十二宫中的“摩羯座”，也常用来指“摩羯座的人”。如果你确认想查的是“Capricorn”，我可以给你标准读音、词性、用法和例句。","如果你是从游戏、社群梗、品牌名或同人作品里看到“cavicorn”，它可能是专有名词（proper noun），通常不收录在通用词典里；你可以告诉我出处或句子，我能更准确解释。"]}
{"word":"Cavicornia","summary":{"en":"Cavicornia is an older taxonomy term for hollow-horned ruminants like cattle, sheep, goats, and antelopes.","zh":"Cavicornia 是一个较旧的分类学术语，指具有中空且通常不脱落的角的反刍动物，如牛、羊、山羊和羚羊等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(biology, taxonomy) A former group (suborder) of ruminant mammals with permanent hollow horns, such as cattle, sheep, goats, and antelopes; roughly corresponding to the family Bovidae (often contrasted with deer, whose antlers are solid and shed).","zh":"（生物学/分类学）旧时使用的一个反刍类哺乳动物类群（曾作亚目），特点是具有不脱落的中空角，如牛、羊、山羊、羚羊等；大致相当于牛科（Bovidae），常与鹿类（角为实心且会脱落）相对。"},"examples":[{"en":"In older zoology texts, cattle and goats were sometimes placed in Cavicornia.","zh":"在较早的动物学教材中，牛和山羊有时被归入 Cavicornia。"},{"en":"Cavicornia refers to animals with hollow horns that usually stay for life.","zh":"Cavicornia 指的是角中空、通常终生不脱落的动物。"}]}],"synonyms":["Bovidae","hollow-horned ruminants"],"phonetic":"/ˌkævɪˈkɔrniə/","extraExplanation":["词源：来自拉丁语 *cavus*（“中空的”）+ *cornu*（“角”）。\n使用提示：现代分类学中更常直接使用“牛科 Bovidae”等更精确的分类名称；Cavicornia 多见于旧文献或科普/历史语境。"]}
{"word":"cavicornia","summary":{"en":"Cavicornia is an old zoological term for hollow-horned ruminants (mainly bovids like cattle, sheep, and goats).","zh":"Cavicornia 是一个较旧的动物学术语，指洞角的反刍动物（主要是牛科，如牛、羊、山羊）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former scientific group name for the hollow-horned ruminant mammals (roughly the bovids), such as cattle, sheep, goats, and antelopes","zh":"（旧分类名）指“洞角类”反刍哺乳动物（大致相当于牛科），如牛、羊、山羊和羚羊等"},"examples":[{"en":"In older zoology books, Cavicornia was used for animals with permanent hollow horns, like cattle and goats.","zh":"在一些较早的动物学书中，Cavicornia 用来指角为中空且永久存在的动物，如牛和山羊。"},{"en":"Modern classification usually talks about the family Bovidae instead of Cavicornia.","zh":"现代分类学通常使用“牛科（Bovidae）”而不是 Cavicornia。"}]}],"synonyms":["Bovidae (modern term)"],"phonetic":"/ˌkævɪˈkɔrniə/","extraExplanation":["这是一个较早期的分类术语：字面可理解为“中空的角”（cavi- 与 cavity“空腔”相关，-corn- 与 horn“角”相关）。过去常用来与“鹿科”等“实心、会脱落再长的角（鹿角）”形成对比；但现在学术写作中多用 Bovidae（牛科）等更标准的分类单位。","拼写提醒：该词比较少见，很多人会误拼；如果你原本想查的是 California（加利福尼亚/加州），请告诉我我可以一起对比说明。"]}
{"word":"Cavidae","summary":{"en":"Cavidae is the rodent family that includes guinea pigs and capybaras.","zh":"Cavidae 指包括豚鼠和水豚在内的啮齿动物“豚鼠科”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of rodents that includes guinea pigs (cavies), capybaras, and their close relatives","zh":"豚鼠科（啮齿动物的一科），包括豚鼠（天竺鼠）、水豚及其近缘种"},"examples":[{"en":"Guinea pigs belong to the family Cavidae.","zh":"豚鼠属于豚鼠科（Cavidae）。"},{"en":"Capybaras are large members of Cavidae found in South America.","zh":"水豚是生活在南美洲的豚鼠科大型成员。"}]}],"synonyms":["the cavy family"],"phonetic":"/ˈkævɪdiː/","extraExplanation":["“Cavidae”是动物分类学（taxonomy）里的科名，常见于科普、动物园说明牌、学术文章中；日常英语里更常直接说“guinea pig（豚鼠）”或“capybara（水豚）”。","词源来自新拉丁语（New Latin）：属名“Cavia”（豚鼠属）+ 科名常用后缀“-idae”（表示“……科”）。发音结尾的“-idae”在英语里常读作 /-diː/（例如 Hominidae /hɑːˈmɪnɪdiː/）。"]}
{"word":"cavidae","summary":{"en":"Cavidae is the rodent family that includes guinea pigs and their close relatives in South America.","zh":"Cavidae 指豚鼠科，是包括豚鼠及其南美近缘物种的一类啮齿动物科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of South American rodents that includes guinea pigs (cavies), capybaras, and related species.","zh":"豚鼠科：一类主要分布在南美洲的啮齿动物科，包括豚鼠（天竺鼠）、水豚及其近缘物种。"},"examples":[{"en":"Guinea pigs belong to the family Cavidae.","zh":"豚鼠属于豚鼠科（Cavidae）。"},{"en":"The capybara is often discussed with Cavidae in older classifications, but many modern sources place it in a separate family.","zh":"水豚在一些较早的分类中常与豚鼠科一起讨论，但许多现代资料将其划分到另一个科。"}]}],"synonyms":["cavy family"],"phonetic":"/ˈkævɪdiː/","extraExplanation":["“Cavidae”是动物分类学中的“科名”（family name），常见于生物学与学术写作，而不太用于日常口语。","词源来自拉丁化的“Cavia”（豚鼠属名/豚鼠的旧称），因此你也会看到相关词：cavy（豚鼠）。","分类在不同教材/资料中可能略有差异（例如水豚的归属），学习时可查看所用参考书或数据库的最新系统分类。"]}
{"word":"cavie","summary":{"en":"A cavy is a guinea pig (a small South American rodent).","zh":"cavy 指豚鼠/天竺鼠（一种南美的小型啮齿动物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small South American rodent (a guinea pig), often kept as a pet","zh":"豚鼠；天竺鼠（南美洲的一种小型啮齿动物，常被当作宠物饲养）"},"examples":[{"en":"My little sister has a pet cavy at home.","zh":"我妹妹在家里养了一只豚鼠当宠物。"},{"en":"Cavies are gentle animals, but they still need daily care.","zh":"豚鼠性格温和，但仍然需要每天照料。"}]}],"synonyms":["guinea pig"],"phonetic":"/ˈkeɪvi/","extraExplanation":["你输入的“cavie”在现代英语里不太常见，更常见的拼写是“cavy”。在一些旧资料或特定地区用法中，可能会看到“cavie”作为变体拼写。","“cavy / guinea pig”在日常英语里更常用的说法是“guinea pig（天竺鼠）”。另外“guinea pig”还有引申义，指“实验对象/小白鼠”。例如：I don’t want to be the guinea pig.（我不想当小白鼠。）"]}
{"word":"cavies","summary":{"en":"“Cavies” means more than one cavy (especially guinea pigs).","zh":"“cavies”指不止一只 cavy（尤指豚鼠）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A plural form of cavy: small South American rodents, especially guinea pigs (often kept as pets or used in research).","zh":"cavy 的复数：一种南美的小型啮齿动物，尤指豚鼠（常作宠物或用于科研）。"},"examples":[{"en":"The shelter received several cavies that needed new homes.","zh":"收容所接收了几只需要新家的豚鼠。"},{"en":"In the children’s book, the cavies squeaked and hid under the hay.","zh":"在那本儿童读物里，豚鼠吱吱叫着躲到干草下面。"}]}],"synonyms":["guinea pigs","cavy"],"phonetic":"ˈkeɪvi","extraExplanation":["“cavy”在日常英语里不如“guinea pig”常见；看到“cavies”多半出现在宠物饲养、动物学或科研语境中。","复数变化：cavy → cavies（以 -y 结尾且前面是辅音字母时，复数常变为 -ies）。"]}
{"word":"Cavil","summary":{"en":"“Cavil” means to criticize by making petty objections; it can also mean a petty objection itself.","zh":"“cavil”指对细枝末节吹毛求疵地反对或挑剔；也可指这种无谓的小挑剔本身。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to raise petty, unfair, or unnecessary objections; to criticize in a trivial way","zh":"吹毛求疵；就细枝末节挑剔、提出无谓的反对意见"},"examples":[{"en":"It’s easy to cavil at small mistakes, but the overall plan is solid.","zh":"对小错误吹毛求疵很容易，但整体计划很扎实。"},{"en":"Don’t cavil over the wording—focus on what the message means.","zh":"别在措辞上挑剔，专注于信息的含义。"}]},{"partOfSpeech":"n.","definition":{"en":"a petty or trivial objection; a minor criticism","zh":"吹毛求疵的反对意见；无关紧要的批评"},"examples":[{"en":"The report is strong, aside from a few cavils about formatting.","zh":"这份报告很有力，除了对格式的一些小挑剔。"},{"en":"Her only cavil was that the meeting started five minutes late.","zh":"她唯一的挑剔是会议晚了五分钟开始。"}]}],"synonyms":["nitpick","quibble","find fault","carp","object"],"phonetic":"/ˈkævəl/","extraExplanation":["“cavil”常带有负面语气，暗示反对意见偏“刻薄/不公允/抓小放大”，与中性表达如“question”“raise a concern”不同。","词源来自拉丁语 *cavillari*（嘲弄、诡辩），所以在语感上也常有“抬杠、挑刺”的意味。"]}
{"word":"cavil","summary":{"en":"“Cavil” means to nitpick—making petty, overly critical objections; it can also mean a petty objection itself.","zh":"“cavil”表示吹毛求疵地挑剔；也可指这种鸡毛蒜皮的异议本身。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To raise small, overly critical objections; to find fault in a petty way (often about unimportant details).","zh":"吹毛求疵；挑剔（常指对不重要的细节提出苛刻的小异议）。"},"examples":[{"en":"It’s easy to cavil about the wording, but the main idea is clear.","zh":"很容易在措辞上吹毛求疵，但主要意思很清楚。"},{"en":"Don’t cavil at every minor mistake—focus on what we can improve.","zh":"别对每个小错误都挑剔——把注意力放在我们能改进的地方。"}]},{"partOfSpeech":"n.","definition":{"en":"A petty or overly critical objection; a trivial complaint.","zh":"（对细节的）苛刻异议；鸡毛蒜皮的抱怨。"},"examples":[{"en":"Her only cavil was that the report was two pages too long.","zh":"她唯一的异议是报告长了两页。"},{"en":"Most of their cavils were about formatting, not content.","zh":"他们大多数的挑剔都在格式上，而不是内容上。"}]}],"synonyms":["nitpick","quibble","find fault","carp","pick holes in"],"phonetic":"/ˈkævəl/","extraExplanation":["“cavil”在正式语境中更常见，常带有负面评价：暗示批评者是在抠细节、故意找茬，而不是提出建设性意见。","常见搭配：cavil at/about (sth)（对……挑剔）；raise cavils（提出吹毛求疵的异议）。"]}
{"word":"caviled","summary":{"en":"“Caviled” means “made petty objections or argued over trivial details.”","zh":"“caviled”表示“吹毛求疵、为小事挑剔反对”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of cavil) to argue about small, unimportant details; to raise petty objections.","zh":"（cavil 的过去式/过去分词）吹毛求疵；为无关紧要的细节挑剔、提出琐碎的反对意见。"},"examples":[{"en":"He caviled about the wording in the email instead of addressing the main issue.","zh":"他吹毛求疵地挑剔邮件措辞，而不是处理主要问题。"},{"en":"The committee caviled over minor budget items for hours.","zh":"委员会为了小额预算项目争论（挑剔）了好几个小时。"},{"en":"She didn’t want to cavil; she just asked for a clearer explanation.","zh":"她并不想吹毛求疵；她只是想要一个更清楚的解释。"}]}],"synonyms":["nitpicked","quibbled","found fault","objected"],"phonetic":"/ˈkævəld/","extraExplanation":["“cavil”常带有负面语气：不是“合理质疑”，而是“抓小问题不放”。","拼写上，美式英语更常见单写 l：caviled；英式英语常见双写 l：cavilled。意思相同。"]}
{"word":"caviler","summary":{"en":"A caviler is someone who nitpicks—criticizing or objecting over small, unimportant details.","zh":"caviler 指爱吹毛求疵、专挑无关紧要小问题来反对或批评的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who habitually finds petty faults or raises trivial objections; a nitpicker.","zh":"爱吹毛求疵、提出琐碎反对意见的人；爱挑刺的人。"},"examples":[{"en":"Ignore the caviler and focus on the main idea of your presentation.","zh":"别理那个爱挑刺的人，把注意力放在你演讲的重点上。"},{"en":"Every plan has risks, but a caviler only talks about small flaws.","zh":"每个计划都有风险，但爱挑刺的人只盯着小毛病说。"}]}],"synonyms":["nitpicker","faultfinder","critic","carper"],"phonetic":"/ˈkævəlɚ/","extraExplanation":["“caviler”来自动词“cavil”（吹毛求疵、挑小毛病）。这个词语气偏负面，常暗示对方不是在建设性批评，而是在为反对而反对。","词源与拉丁语 *cavillari*（挑剔、诡辩）有关；在正式写作或评论中更常见，日常口语里更常用“nitpicker / picky person”。"]}
{"word":"cavilers","summary":{"en":"“Cavilers” means people who habitually nitpick or raise petty objections.","zh":"“cavilers”指经常吹毛求疵、提出琐碎反对意见的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who keeps finding small faults or raises petty, unfair objections (often to avoid accepting the main point)","zh":"（常指为反对而反对的）吹毛求疵者；爱挑小毛病、提出琐碎或不公正反对意见的人"},"examples":[{"en":"Ignore the cavilers and focus on the main goal of the project.","zh":"别理那些吹毛求疵的人，专注于项目的主要目标。"},{"en":"The proposal was solid, but a few cavilers argued about minor wording.","zh":"提案很扎实，但有几个人却在措辞小问题上挑刺。"}]}],"synonyms":["nitpickers","faultfinders","pedants","carpers"],"phonetic":"/ˈkævəlɚ/","extraExplanation":["“cavilers”是复数形式，单数是“caviler”（美式拼写）；英式常写作“caviller”。两者意思相同。","“to cavil”这个动词带有“为挑剔而挑剔”的语气，通常比一般的“criticize（批评）”更负面，强调挑小错、抓细枝末节。"]}
{"word":"caviling","summary":{"en":"“Caviling” describes petty, nitpicking objections or criticism.","zh":"“caviling”指吹毛求疵、为小事抬杠式的反对或批评。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"making petty, overly critical, or trivial objections; nitpicking","zh":"吹毛求疵的；为小事挑剔、抬杠的"},"examples":[{"en":"Ignore the caviling comments and focus on the main idea of the proposal.","zh":"别理会那些吹毛求疵的评论，把注意力放在提案的主要内容上。"},{"en":"Her caviling tone turned a simple discussion into an argument.","zh":"她那种抬杠的语气把一场简单的讨论变成了争吵。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of raising petty objections; nitpicking criticism","zh":"吹毛求疵式的反对；抬杠式的批评"},"examples":[{"en":"The meeting was slowed by constant caviling over minor details.","zh":"会议因为不断在细枝末节上抬杠而进展缓慢。"}]}],"synonyms":["nitpicking","petty","hypercritical","captious","hair-splitting"],"phonetic":"/ˈkævəlɪŋ/","extraExplanation":["“caviling”来自动词“cavil”（吹毛求疵、挑小毛病）。在正式或书面语里更常见，语气通常带有负面评价，暗示对方不是在建设性讨论，而是在抓小问题来反对。","常见搭配：caviling objections/comments/criticism（吹毛求疵的反对/评论/批评）。相近表达：nitpicky（更口语）、petty（强调小气/小题大做）、hair-splitting（强调过度纠结细微差别）。"]}
{"word":"cavilingly","summary":{"en":"“Cavilingly” means ‘in a nitpicky, fault-finding way.’","zh":"“cavilingly”表示“以吹毛求疵、过度挑剔的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that finds petty faults or raises small, often unfair objections; overly critical and nitpicking.","zh":"以吹毛求疵、挑小毛病或提出琐碎（常带不公平）反对意见的方式；过度挑剔地。"},"examples":[{"en":"He cavilingly corrected her pronunciation in the middle of the presentation.","zh":"他在演讲进行到一半时吹毛求疵地纠正她的发音。"},{"en":"The review cavilingly focused on minor formatting issues instead of the main argument.","zh":"那篇评论吹毛求疵地盯着一些小的格式问题，而不是主要论点。"},{"en":"She listened politely, though the feedback was delivered cavilingly and felt discouraging.","zh":"她礼貌地听着，尽管那些反馈说得很挑剔，让人泄气。"}]}],"synonyms":["nitpickingly","captiously","pedantically","faultfindingly","hypercritically"],"phonetic":"/ˈkævəlɪŋli/","extraExplanation":["“cavilingly”来自动词“cavil”（吹毛求疵、对小事提出反对）。它常带负面语气，暗示批评不够建设性，偏向挑错而不是改进。写作或正式场合更常用“caviling”作形容词（a caviling critic）或用短语“in a caviling way”。"]}
{"word":"cavilingness","summary":{"en":"Cavilingness means a tendency to find petty faults or raise unnecessary objections about small details.","zh":"cavilingness 指爱挑小毛病、对琐事无端反对的倾向（吹毛求疵）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The habit or quality of making petty, unnecessary objections; fault-finding over small details.","zh":"吹毛求疵、挑剔小细节的习惯或特质；为琐事提出不必要的反对。"},"examples":[{"en":"Her cavilingness turned a simple discussion into an argument about tiny details.","zh":"她爱吹毛求疵，把一个简单的讨论变成了对细枝末节的争论。"},{"en":"The editor asked him to reduce his cavilingness and focus on the main point.","zh":"编辑让他少些挑剔，把注意力放在重点上。"},{"en":"We need constructive feedback, not cavilingness.","zh":"我们需要建设性的反馈，而不是吹毛求疵。"}]}],"synonyms":["pettiness","nitpicking","fault-finding","carping","quibbling"],"phonetic":"/ˈkævəlɪŋnəs/","extraExplanation":["“cavilingness”来自动词“to cavil”（吹毛求疵、无端挑错）。在现代英语里，这个名词形式相对少见，更常用的是“caviling”（n./adj.）或“cavils”（n. 复数）来表达“挑剔/吹毛求疵”的意思。","语气通常偏负面，暗示批评不够建设性、抓小放大。若想表达更中性的“仔细/严谨”，可以用“careful,” “thorough,” 或“detail-oriented”。"]}
{"word":"Cavill","summary":{"en":"Cavill is an English surname, widely recognized because of actor Henry Cavill.","zh":"Cavill 是一个英文姓氏，因演员亨利·卡维尔而广为人知。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), best known internationally from British actor Henry Cavill.","zh":"一个英文姓氏（家族姓），因英国演员亨利·卡维尔（Henry Cavill）而广为人知。"},"examples":[{"en":"Henry Cavill played Superman in several DC films.","zh":"亨利·卡维尔在多部DC电影中饰演了超人。"},{"en":"I saw an interview with Cavill about his training routine.","zh":"我看了卡维尔谈他训练计划的采访。"}]}],"phonetic":"/ˈkævəl/","extraExplanation":["“Cavill”通常作为姓氏使用，而不是常见词汇；在新闻、影评和社交媒体中经常用来指代演员亨利·卡维尔本人（类似用姓称呼名人）。","英文里只用姓称呼公众人物（如“Cavill said…”）在正式报道中很常见；在口语里若对方不熟悉这位名人，最好加上名字（Henry Cavill）以避免误解。"]}
{"word":"cavillation","summary":{"en":"Cavillation means petty, nitpicking objections that focus on minor details rather than the main issue.","zh":"cavillation 指吹毛求疵式的反驳/抬杠，专抓小细节而忽略重点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A petty or overly clever objection that focuses on small details instead of the main point; nitpicking argument.","zh":"吹毛求疵式的反驳；在小细节上钻牛角尖、故意挑刺的辩驳。"},"examples":[{"en":"Let’s not get lost in cavillation—do you agree with the main idea or not?","zh":"别在吹毛求疵的争辩里打转了——你到底同不同意主要观点？"},{"en":"His cavillations about wording delayed the decision for hours.","zh":"他对措辞的挑刺式争辩把决定拖延了好几个小时。"}]}],"synonyms":["nitpicking","pettifoggery","quibbling","hair-splitting"],"phonetic":"/ˌkævəˈleɪʃən/","extraExplanation":["词源提示：cavillation 来自拉丁语 cavillari，意为“嘲弄式地争辩、挑剔”。因此它常带有负面评价：不是认真讨论，而是借细枝末节来反对或拖延。","常见搭配：endless cavillation（没完没了的挑刺）、mere cavillation（纯属挑刺）、avoid cavillation（避免吹毛求疵）。","近义词区别：cavillation 比 objection 更“鸡毛蒜皮”；比 criticism 更强调“挑刺/抬杠”的语气；与 nitpicking 很接近，但 cavillation 更偏正式、书面。"]}
{"word":"cavillatory","summary":{"en":"Cavillatory describes nitpicking, petty objections that avoid the main issue.","zh":"cavillatory 指“吹毛求疵、爱挑小毛病”，常用来形容抓细枝末节而回避重点的反对。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person, comment, or argument) making petty objections; quibbling or nitpicking instead of focusing on the main point.","zh":"（指人、评论或论点）吹毛求疵的；爱挑小毛病的；用琐碎反对来回避重点的。"},"examples":[{"en":"The reviewer’s cavillatory remarks ignored the author’s main idea.","zh":"评论者吹毛求疵的评语忽略了作者的主要观点。"},{"en":"Instead of being cavillatory, try to suggest one clear improvement.","zh":"与其吹毛求疵，不如提出一个明确的改进建议。"},{"en":"The debate turned unproductive because one side stayed cavillatory about minor details.","zh":"辩论变得没有成效，因为一方一直在小细节上吹毛求疵。"}]}],"synonyms":["nitpicking","quibbling","pedantic","hair-splitting","captious"],"phonetic":"/ˈkævəˌleɪtɔri/","extraExplanation":["“cavillatory”来自动词“cavillate”（吹毛求疵、挑剔式反对），语气偏正式、书面，常带负面评价。","容易与“careful/critical（谨慎/批判性）”混淆：cavillatory强调“抓小辫子”“为反对而反对”，而“critical”可以是有建设性的批判。"]}
{"word":"cavilled","summary":{"en":"“Cavilled” means someone nitpicked or raised petty objections.","zh":"“cavilled”表示（过去）对小问题吹毛求疵、挑剔式地反对。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"past tense/past participle of “cavil”: to argue or complain by making small, picky objections (often in a negative or unhelpful way).","zh":"“cavil”的过去式/过去分词：吹毛求疵地挑剔、为小问题争辩（常带贬义，显得不建设性）。"},"examples":[{"en":"Some reviewers cavilled over minor details instead of discussing the main idea.","zh":"有些评论者只对小细节吹毛求疵，而不是讨论核心观点。"},{"en":"He cavilled at the wording of the agreement, but offered no better alternative.","zh":"他对协议措辞百般挑剔，却拿不出更好的方案。"}]},{"partOfSpeech":"v.","definition":{"en":"to criticize in a petty way; to nitpick.","zh":"（更笼统）小题大做地批评；挑刺。"},"examples":[{"en":"Don’t cavil—tell me what you would change and why.","zh":"别光挑刺——告诉我你想改哪里、为什么。"}]}],"synonyms":["nitpicked","quibbled","found fault","carped","objected"],"phonetic":"/ˈkævəld/","extraExplanation":["拼写小知识：美式英语里也常见 caviled（单写 l），英式英语更常见 cavilled（双写 l）。两者含义相同。","语感提示：cavil 通常暗示“挑剔得不必要、过于琐碎”，比普通的 criticize 更偏负面。","词源：来自拉丁语 cavillari，含“诡辩、挑毛病”的意思。"]}
{"word":"caviller","summary":{"en":"A caviller is someone who nitpicks and makes petty objections, often about minor details.","zh":"caviller 指爱吹毛求疵、对小细节提出无谓反对的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who raises petty, unnecessary objections, especially about small details; a nitpicker","zh":"（常指对细枝末节）吹毛求疵、提出无谓反对意见的人；爱挑刺的人"},"examples":[{"en":"Ignore the caviller and focus on the main idea of the plan.","zh":"别理那个爱挑刺的人，把注意力放在计划的核心思路上。"},{"en":"In every meeting, there was a caviller who questioned the wording instead of the goals.","zh":"每次开会总有人爱挑刺，纠结措辞而不是目标。"},{"en":"She didn’t mind criticism, but she disliked cavillers who argued just to argue.","zh":"她不介意批评，但不喜欢那种为了争辩而争辩的人。"}]}],"synonyms":["nitpicker","faultfinder","quibbler","critic"],"phonetic":"/ˈkævələr/","extraExplanation":["词源上来自拉丁语 *cavillari*（挑剔、抬杠），在现代英语里常带负面评价，暗示“挑毛病不解决问题”。在写作或讨论中，常与“petty / trivial（琐碎的）”等词搭配。"]}
{"word":"cavillers","summary":{"en":"“Cavillers” means people who habitually pick at minor faults or raise petty objections.","zh":"“cavillers”指习惯性挑小毛病、提出琐碎反对意见的人（常带贬义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who keep finding small faults or raising petty objections, often in a critical or argumentative way.","zh":"（常指吹毛求疵地）挑剔者；爱找茬、爱抬杠的人。"},"examples":[{"en":"The proposal was solid, but a few cavillers complained about minor details.","zh":"这个提案很扎实，但还是有几个吹毛求疵的人抓着小细节不放。"},{"en":"Don’t waste energy arguing with cavillers—focus on improving the main idea.","zh":"别把精力浪费在和爱抬杠的人争论上——专注把核心想法做好。"}]}],"synonyms":["nitpickers","faultfinders","critics","objectors"],"phonetic":"/ˈkævəlɚ/","extraExplanation":["“caviller”来自动词“to cavil”，意思是对细枝末节进行挑剔式的反对或质疑。语气通常偏负面，暗示对方并非建设性批评，而是为反对而反对。","常见搭配：cavil at（对……吹毛求疵/挑刺），如：Some people cavil at every decision（有人对每个决定都要挑刺）。","在较正式的写作或评论中更常见；日常口语里可用“nitpicker（吹毛求疵的人）”“faultfinder（爱挑毛病的人）”表达相近意思。"]}
{"word":"cavilling","summary":{"en":"Cavilling means making petty, overly critical objections or fault-finding.","zh":"cavilling 指吹毛求疵地挑小毛病、提出琐碎且过度挑剔的反对意见。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Making petty, unnecessary, or overly critical objections; finding small faults (often in an unfair or unhelpful way).","zh":"（常指不公正或无建设性地）吹毛求疵地挑毛病；提出琐碎的反对意见。"},"examples":[{"en":"Stop cavilling over minor details and focus on the main idea.","zh":"别再对小细节吹毛求疵了，把注意力放在重点上。"},{"en":"Her cavilling comments slowed the meeting down.","zh":"她那些吹毛求疵的评论让会议进展变慢。"},{"en":"The judge dismissed the cavilling objections as irrelevant.","zh":"法官认为这些吹毛求疵的反对意见无关紧要，予以驳回。"}]},{"partOfSpeech":"n.","definition":{"en":"Petty or overly critical fault-finding or objections (the act of ‘cavil’).","zh":"吹毛求疵；对琐碎之处过度挑剔的反对（指“cavil”的行为）。"},"examples":[{"en":"There was no time for cavilling; the team had to act quickly.","zh":"没时间吹毛求疵了，团队必须迅速行动。"},{"en":"His speech was met with cavilling from a few listeners.","zh":"他的演讲遭到少数听众吹毛求疵的挑刺。"}]}],"synonyms":["petty","nitpicking","fault-finding","hypercritical","quibbling"],"phonetic":"ˈkævəlɪŋ","extraExplanation":["“cavilling”来自动词 cavil（吹毛求疵、挑小毛病）。它常带明显的负面语气，暗示对方的批评是“抬杠式”“鸡蛋里挑骨头”，而不是建设性的建议。","常见搭配：cavilling objections/comments/criticism；动词用法：cavil about/over (something)。在正式写作或辩论语境中较常见。"]}
{"word":"cavillingly","summary":{"en":"“Cavillingly” means speaking or acting in a nitpicking, overly critical way, focusing on trivial faults.","zh":"“cavillingly”表示说话或做事时吹毛求疵、过分挑剔，专抓细枝末节。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that finds petty faults or raises trivial objections; overly critical and nitpicking.","zh":"以吹毛求疵、挑剔小毛病的方式；爱提出琐碎反对意见地。"},"examples":[{"en":"He cavillingly pointed out a tiny typo and ignored the main idea.","zh":"他吹毛求疵地指出一个小错别字，却忽略了主要观点。"},{"en":"The proposal was reasonable, but some comments were written cavillingly.","zh":"这个提案很合理，但有些评论写得很挑剔。"}]}],"synonyms":["nitpickingly","pedantically","captiously","fault-findily"],"phonetic":"/ˈkævəlɪŋli/","extraExplanation":["“cavillingly”来自动词“cavil”（吹毛求疵、对小事挑刺），常用于批评一种不建设性的争辩方式：不是讨论核心问题，而是抓住细枝末节反对。","语气通常偏负面，暗示“挑刺的人不公平/不真诚”。在正式写作里偶尔可见，更常用的替代表达有：“nitpickingly / pedantically / fault-findily（较少见）”。"]}
{"word":"cavillingness","summary":{"en":"Cavillingness means a habit of making petty, overly critical objections (quibbling).","zh":"cavillingness 指习惯性吹毛求疵、提出琐碎而苛刻的反对意见（抬杠、挑剔）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the tendency or habit of making petty, overly critical objections; quibbling.","zh":"吹毛求疵、挑剔（指习惯性地提出琐碎、过度苛刻的反对意见）；抬杠。"},"examples":[{"en":"Her cavillingness turned a simple meeting into an argument about tiny details.","zh":"她的吹毛求疵把一个简单的会议变成了对细枝末节的争论。"},{"en":"Try to focus on the main idea instead of cavillingness over minor wording.","zh":"尽量关注核心观点，不要在措辞小问题上抬杠。"}]}],"synonyms":["quibbling","nitpicking","faultfinding","pettiness"],"phonetic":"/ˈkævəlɪŋnəs/","extraExplanation":["“cavillingness”来自动词“to cavil”（吹毛求疵、提出无谓的反对）。在现代英语里，这个名词形式相对少见，更常用的是“caviling/cavilling”（挑剔、吹毛求疵）或“quibbling”（诡辩、在小事上纠缠）。","语气上，“cavillingness”通常带负面评价：不是建设性的批评（constructive criticism），而是为了反对而反对，或抓住细节来否定整体。正式写作中常用来批评某人的讨论方式。"]}
{"word":"cavillous","summary":{"en":"Cavillous describes someone who is habitually petty and overly critical, often raising trivial objections.","zh":"Cavillous 用来形容一个人习惯性地吹毛求疵、过度挑剔，经常提出无关紧要的反对意见。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Overly critical in a petty way; always finding small faults or raising trivial objections.","zh":"吹毛求疵的；爱挑小毛病的；为小事争辩的。"},"examples":[{"en":"The reviewer was cavillous, focusing on minor typos instead of the main ideas.","zh":"那位评论者很吹毛求疵，只盯着小错别字而不是主要观点。"},{"en":"Try not to sound cavillous when giving feedback to a new colleague.","zh":"给新同事提意见时，尽量别显得过于挑剔。"}]}],"synonyms":["nitpicky","captious","hypercritical","faultfinding","petty"],"phonetic":"/ˈkævələs/","extraExplanation":["“cavillous”来自动词“cavil”（为小事吹毛求疵、挑刺、争辩）。它常带有负面评价：不是建设性批评，而是抓住细枝末节不放。","近义词里“nitpicky”更口语；“captious”更正式、偏书面；“hypercritical”强调“过度苛刻”。"]}
{"word":"cavils","summary":{"en":"“Cavils” means making or expressing petty, picky objections; it can be a verb form or the plural noun for such objections.","zh":"“cavils”指对小事吹毛求疵地反对或抱怨；既可作动词形式，也可作名词复数表示这些挑剔的异议。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make small, picky objections or criticisms (often about minor details)","zh":"吹毛求疵、在小细节上挑剔地反对或批评（常指无关紧要的点）"},"examples":[{"en":"Don’t cavil at every small mistake—focus on the main idea.","zh":"别对每个小错误都吹毛求疵——把注意力放在主要观点上。"},{"en":"Some readers caviled about the wording, even though the message was clear.","zh":"尽管意思很清楚，还是有些读者对措辞挑剔不休。"}]},{"partOfSpeech":"n.","definition":{"en":"small, petty objections or complaints","zh":"（对小事的）挑剔反对、吹毛求疵的抱怨"},"examples":[{"en":"We can address your main concerns, but not every cavil.","zh":"我们可以回应你的主要担忧，但不可能把每一条吹毛求疵的反对都处理完。"},{"en":"His report was solid, despite a few cavils from the audience.","zh":"尽管观众提出了一些挑剔的异议，他的报告仍然很扎实。"}]}],"synonyms":["nitpick","quibble","find fault","carp"],"phonetic":"/ˈkævəl/","extraExplanation":["“cavils”既可以是动词 cavil 的第三人称单数（He cavils…），也可以是名词 cavil 的复数（minor cavils）。在正式写作或讨论中，这个词常带有“挑刺但不建设性”的语气，暗示对方过分纠结小问题。","近义词区分：criticize（批评，范围更广，可中性） / nitpick（更口语，专挑小毛病） / quibble（为小事争辩或吹毛求疵，语气接近）。"]}
{"word":"cavin","summary":{"en":"“cavin’” is a casual spelling of “caving” (dropping the -g), meaning cave exploration or “caving in” (collapsing/giving in).","zh":"“cavin’”是“caving”的口语拼写（省略 -g），可指洞穴探险，也可指“caving in”（塌陷/屈服）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(informal spelling) “caving” — the -g is dropped in casual speech/writing. It can mean exploring caves, or it can refer to something collapsing or a person giving in.","zh":"（非正式拼写）“caving”的口语/随意写法，省略了词尾的 -g。可指“洞穴探险”，也可指“坍塌/塌陷”，或“屈服/让步”。"},"examples":[{"en":"We’re goin’ cavin’ this weekend, so bring a helmet and a headlamp.","zh":"我们这周末要去“洞穴探险”（cavin’），所以带上头盔和头灯。"},{"en":"After hours of arguing, he finally started cavin’ and apologized.","zh":"争论了好几个小时后，他终于开始让步（cavin’），并道歉了。"},{"en":"The roof was cavin’ in because of the heavy snow.","zh":"屋顶因为大雪正在塌陷（cavin’ in）。"}]}],"synonyms":["caving","spelunking","caving in","giving in","yielding"],"phonetic":"/ˈkeɪvɪn/","extraExplanation":["“cavin’”常见于口语化书写（尤其是在歌词、对话、社交媒体中），用来表现随意、地域口音或亲近的语气；正式写作中建议用标准拼写 “caving”。","注意区分两种常见用法：\n1) caving（洞穴探险，类似 spelunking）\n2) cave in / caving in（塌陷；比喻“屈服、让步”）。"]}
{"word":"Cavina","summary":{"en":"“Cavina” is usually a proper name (most often a surname) rather than a common English word.","zh":"“Cavina”通常是专有名词（多为姓氏），而不是常见英语词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname), often of Italian origin; also used as a brand or business name.","zh":"（专有名词）姓氏，常见于意大利语系；也可能用作品牌名或公司名。"},"examples":[{"en":"Ms. Cavina will present the report at the meeting.","zh":"Cavina 女士将在会议上汇报。"},{"en":"I found Cavina listed as the author of an Italian cookbook.","zh":"我看到 Cavina 被列为一本意大利菜谱的作者。"}]}],"synonyms":["(proper name)"],"phonetic":"/kəˈviːnə/","extraExplanation":["“Cavina”不是常见的英语词汇，更多作为专有名词出现（例如人名/姓氏、商号、产品名）。因此它的确切含义通常要看上下文：是在指某个人、某家公司，还是某个品牌。","发音在英语中可能会因个人或家族习惯而不同；如果你是在特定文本里看到它（例如一篇文章、酒标、公司名片），我可以根据语境帮你判断最可能的指代。"]}
{"word":"cavina","summary":{"en":"“Cavina” is usually a proper name in English, not a common word with a standard definition.","zh":"“Cavina”在英语中通常是专有名词，不是带有标准释义的常见单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (usually a surname or brand/company name) rather than a standard English vocabulary word. It doesn’t have a widely recognized dictionary meaning in English.","zh":"专有名词（多为姓氏或品牌/公司名），而不是常见的英语词汇。在英语词典中通常没有公认的固定词义。"},"examples":[{"en":"I found “Cavina” listed as the author’s last name.","zh":"我看到“Cavina”被列为作者的姓氏。"},{"en":"The package says it was made by Cavina.","zh":"包装上写着由 Cavina 生产。"}]}],"phonetic":"/kəˈviːnə/","extraExplanation":["“Cavina”在英语语境里更常被当作名字来用（例如姓氏、品牌名、地名或机构名），因此通常不会像普通单词那样有稳定的“词义、同义词、反义词”。如果你能提供一句包含它的原句（或告诉我它来自哪里：书名/电影/商标/人名），我可以更准确地解释它指的是什么，以及更自然的读法。"]}
{"word":"Caviness","summary":{"en":"Caviness means “hollowness” or “the state of having an empty space inside”; it can also be a surname.","zh":"caviness 指“中空/空洞的状态”；也可作姓氏使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being hollow; having a cavity or empty space inside.","zh":"中空；空洞的状态；有腔体/空隙的性质。"},"examples":[{"en":"The caviness of the old tree trunk made it a good home for small animals.","zh":"老树干的中空让它成了小动物的好住处。"},{"en":"Tap the wall—if you hear a dull sound, it may indicate caviness behind the plaster.","zh":"敲敲墙——如果听到沉闷的声音，可能表示灰泥后面有空洞。"},{"en":"The dentist checked the tooth for signs of caviness.","zh":"牙医检查这颗牙是否有形成龋洞的迹象。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname).","zh":"（姓氏）Caviness。"},"examples":[{"en":"Ms. Caviness will lead the meeting today.","zh":"Caviness 女士今天将主持会议。"},{"en":"The article was written by Jordan Caviness.","zh":"这篇文章由 Jordan Caviness 撰写。"}]}],"synonyms":["hollowness","emptiness","porosity","cavity (related)"],"phonetic":"/ˈkævɪnəs/","extraExplanation":["“caviness”通常来自形容词“cavernous/cavy（有洞的）”或名词“cavity（洞、腔）”的概念，最常用于描述物体内部的空腔感（如墙体、木头、岩石）。在医学/牙科语境中，有时也可用来指“出现龋洞/空洞感”，但更常见的词是“cavity”。"]}
{"word":"caving","summary":{"en":"Caving most commonly means exploring caves as a sport. It can also describe something collapsing inward (“cave in”) or someone giving in under pressure.","zh":"caving 最常指“洞穴探险”。也可指“向内塌陷（cave in）”，或比喻“在压力下让步/屈服”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity or sport of exploring natural caves; also called spelunking.","zh":"洞穴探险；探索天然洞穴的活动/运动（也叫 spelunking）。"},"examples":[{"en":"They went caving in Kentucky during the weekend.","zh":"他们周末去肯塔基进行洞穴探险。"},{"en":"Caving can be dangerous without a guide and proper equipment.","zh":"没有向导和合适装备的洞穴探险可能很危险。"}]},{"partOfSpeech":"v.","definition":{"en":"giving way or collapsing inward under pressure; (of a surface or structure) falling in.","zh":"（在压力下）向内塌陷；（表面或结构）坍塌。"},"examples":[{"en":"The roof started caving in after the heavy snow.","zh":"大雪后屋顶开始向内塌陷。"},{"en":"I was worried the old wall was caving in.","zh":"我担心那面旧墙会塌。"}]},{"partOfSpeech":"v.","definition":{"en":"to stop resisting and agree to something, often because of pressure (usually in the phrase “cave in”).","zh":"（常用在短语“cave in”中）屈服；在压力下让步。"},"examples":[{"en":"After hours of arguing, he finally caved in and apologized.","zh":"争论了好几个小时后，他终于屈服并道歉了。"},{"en":"Don’t cave in to peer pressure.","zh":"不要向同伴压力屈服。"}]}],"synonyms":["spelunking","cave exploration","collapsing","giving in","yielding"],"phonetic":"/ˈkeɪvɪŋ/","extraExplanation":["“Caving”最常见是名词，指洞穴探险；美式英语里也常说“spelunking”，但在一些爱好者圈子里“caving”更常用、更正式。","“cave in”既可字面表示“塌陷”，也可比喻表示“让步/屈服”。学习时可以通过语境判断：谈建筑、地面多为字面；谈争论、压力多为比喻。"]}
{"word":"cavings","summary":{"en":"“Cavings” usually means multiple cave-exploring trips, or (in technical contexts) multiple cave-ins/collapses.","zh":"“Cavings”通常指多次洞穴探险；在技术语境中也可指多次塌陷/坍塌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity or sport of exploring caves (plural form of “caving”).","zh":"洞穴探险（活动/运动，“caving”的复数）。"},"examples":[{"en":"They went on several cavings during their summer break.","zh":"他们在暑假进行了好几次洞穴探险。"},{"en":"Local guides offer safe cavings for beginners.","zh":"当地向导为初学者提供安全的洞穴探险项目。"}]},{"partOfSpeech":"n.","definition":{"en":"collapses or cave-ins; places or events where rock or soil falls inward (plural of “caving” in engineering/geology).","zh":"塌陷；坍塌事件/塌方处（工程/地质语境中“caving”的复数）。"},"examples":[{"en":"The report mentioned repeated cavings along the tunnel wall.","zh":"报告提到隧道侧壁多次发生坍塌。"},{"en":"Heavy rain increased the risk of cavings on the hillside.","zh":"暴雨增加了山坡塌方的风险。"}]}],"synonyms":["cave exploration","spelunking (informal)","cave-ins","collapses","cave-ins (events)"],"phonetic":"/ˈkeɪvɪŋz/","extraExplanation":["“cavings”在日常英语里不算常见：表示“洞穴探险”时，人们更常说 go caving（去洞穴探险）或 caving trips（洞穴探险之旅）。","如果你原本想表达“强烈的渴望/想吃某物”，常见拼写是 cravings（不是 cavings）。"]}
{"word":"cavish","summary":{"en":"“Cavish” is a rare adjective meaning “cave-like; hollow or cavern-shaped.”","zh":"“cavish”是很少见的形容词，意思是“像洞穴一样的；空洞/洞穴状的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Like a cave; hollow, deep, or cave-shaped.","zh":"（罕见用法）像洞穴一样的；空洞的、深凹的、洞穴状的。"},"examples":[{"en":"The old well had a cavish opening that looked like a small cave.","zh":"那口老井的井口很洞穴状，看起来像个小洞。"},{"en":"In the dim light, the room felt cavish and damp.","zh":"在昏暗的光线里，这个房间让人觉得像洞穴一样阴冷潮湿。"}]}],"synonyms":["cave-like","cavernous","hollow"],"phonetic":"/ˈkeɪvɪʃ/","extraExplanation":["“cavish”在现代英语中非常少见，很多词典不会收录。若你是在阅读中看到它，它通常表示“洞穴般的”。","你可能想查的是拼写相近但更常用的词：\n- “cavernous”（更常见）：巨大而空旷、像洞穴一样\n- “caddish”：卑鄙的、没风度的（意思完全不同）\n- “lavish”：奢华的、慷慨的（意思也不同）","如果你能提供句子上下文（原句/截图），我可以帮你确认到底是哪一个词以及最合适的释义。"]}
{"word":"Cavit","summary":{"en":"Cavit is a temporary dental filling material (a brand name) used to seal a tooth between treatments.","zh":"Cavit是临时补牙/暂封材料的品牌名，用于在治疗间隔期暂时封闭牙齿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand name for a temporary dental filling material used to close a tooth after treatment (especially between dental visits).","zh":"（品牌名）一种临时牙科充填材料/临时补牙材料，用于在治疗后（尤其两次就诊之间）暂时封闭牙齿。"},"examples":[{"en":"The dentist placed Cavit to protect the tooth until my next appointment.","zh":"牙医放了Cavit来保护这颗牙，等我下次复诊再处理。"},{"en":"If the Cavit comes out, call the clinic so they can replace the temporary filling.","zh":"如果Cavit掉了，请联系诊所，让他们把临时补牙材料补回去。"}]}],"synonyms":["temporary filling","temporary dental cement","temporary restorative material"],"phonetic":"/ˈkævɪt/","extraExplanation":["“Cavit”常见于牙科语境，是商品名（首字母通常大写）。它一般用于根管治疗、暂封药等情况，目的是短期密封、防止食物残渣进入。不同材料和使用时间会因医生判断而异；如果出现脱落、疼痛或咬合明显不适，应尽快联系牙医。"]}
{"word":"cavitary","summary":{"en":"“Cavitary” describes something that contains or forms a hollow cavity, especially a medical finding like a hollow lesion in an organ.","zh":"“cavitary”指“有空洞的/形成空腔的”，多用于医学上描述器官内的空洞性病变。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having one or more hollow spaces (cavities), especially in the body (often used in medical contexts).","zh":"有空洞的；形成（或具有）空腔的（尤用于医学语境）。"},"examples":[{"en":"A cavitary lesion was seen on the chest X-ray.","zh":"胸部X光片上可见一个空洞性病灶。"},{"en":"Doctors suspected a cavitary infection in the lung.","zh":"医生怀疑肺部有空洞性感染。"}]}],"synonyms":["hollow","cavity-forming","cavitating"],"phonetic":"/ˈkævəˌtɛri/","extraExplanation":["“cavitary”多用于医学英语，常见搭配有：cavitary lesion（空洞性病灶）、cavitary pneumonia（空洞性肺炎）、cavitary tuberculosis（空洞型结核）。","词源上来自“cavity”（空腔、洞）+ 形容词后缀“-ary”，表示“与……有关的/具有……特征的”。在日常英语里不常用，更多见于影像学报告、病理描述或临床记录。"]}
{"word":"cavitate","summary":{"en":"Cavitate means to form bubbles/voids in a liquid due to low pressure, often causing noise and damage in machines like pumps or propellers.","zh":"Cavitate 指液体因压力过低而产生气泡/空腔（空化），常导致设备噪音、振动与损伤。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Of a liquid) to form bubbles or empty spaces (cavities), usually because the pressure suddenly drops; this can cause noise, vibration, and damage in pumps, propellers, etc.","zh":"（液体）发生空化：因压力突然降低而形成气泡或空腔，常会引起噪音、振动，并可能损坏水泵、螺旋桨等设备。"},"examples":[{"en":"The pump began to cavitate when the inlet pressure got too low.","zh":"当入口压力过低时，水泵开始发生空化。"},{"en":"Boat propellers can cavitate at high speed, reducing efficiency and causing a loud buzzing sound.","zh":"船只螺旋桨在高速时可能发生空化，降低效率并产生很大的嗡嗡声。"}]},{"partOfSpeech":"vt.","definition":{"en":"To make a hollow or pit in something; to form small holes or cavities (less common, often technical).","zh":"使……形成凹陷/孔洞；出现小坑或空腔（较少见，多为技术用法）。"},"examples":[{"en":"Acid exposure can cavitate the surface of certain metals over time.","zh":"长期接触酸可能会使某些金属表面出现小坑。"}]}],"synonyms":["undergo cavitation","form bubbles","form vapor bubbles"],"phonetic":"ˈkævəˌteɪt","extraExplanation":["“cavitate”常见于工程与流体力学：当局部压力低于液体的饱和蒸汽压时，液体会“沸腾”出蒸汽泡；气泡随后在高压区快速破裂（塌陷），会产生冲击波，导致金属表面点蚀（pitting）与磨损。","词根来自拉丁语“cavus”（空的），同源词包括“cavity（腔）”“cave（洞穴）”。"]}
{"word":"cavitated","summary":{"en":"“Cavitated” means having formed cavities or bubbles (often in liquids), or having a hollow/cavity in tissue or a tooth; it’s also the past form of “cavitate.”","zh":"“cavitated”表示已形成空穴/气泡（常指液体空化），或组织/牙齿出现空洞；也可作“cavitate”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Engineering/physics) Having formed cavities (empty spaces) or vapor bubbles, usually in a liquid because of pressure changes.","zh":"（工程/物理）因压力变化在液体中形成空穴（空隙）或气泡的；发生空化的。"},"examples":[{"en":"The propeller surface was badly cavitated after months of high-speed operation.","zh":"在高速运转数月后，螺旋桨表面因空化而严重受损。"},{"en":"If the pump is cavitated, it may become noisy and lose efficiency.","zh":"如果泵发生空化，可能会变得很吵并且效率下降。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Medicine/dentistry) Having developed a cavity or hollowed-out area in tissue or a tooth.","zh":"（医学/牙科）组织或牙齿出现空洞（形成“洞”）的。"},"examples":[{"en":"The dentist noted a cavitated lesion and recommended a filling.","zh":"牙医发现了已经形成“洞”的龋损，并建议补牙。"},{"en":"On the scan, the infection showed a cavitated area in the lung.","zh":"在影像检查中，感染在肺部呈现出一个空洞区域。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “cavitate”: to form cavities or bubbles (or to cause them to form).","zh":"“cavitate”的过去式/过去分词：形成（或使形成）空穴/气泡（空化）。"},"examples":[{"en":"The fluid cavitated near the valve when the pressure dropped suddenly.","zh":"压力突然下降时，阀门附近的液体发生了空化。"}]}],"synonyms":["pitted","hollowed","cavitating (related)","eroded (in damage contexts)"],"phonetic":"/ˈkævɪˌteɪtɪd/","extraExplanation":["“cavitation（空化）”在工程里很常见：比如螺旋桨、泵、涡轮等设备中，液体压力过低会产生蒸汽泡，气泡破裂会冲击金属表面，导致噪音、振动和“空化侵蚀”。","在牙科里，cavitated lesion 指“已经破洞的龋损”；与之相对的是 non-cavitated（未形成洞、早期龋）—有时可以通过涂氟等方式观察或干预。"]}
{"word":"cavitates","summary":{"en":"“Cavitates” means “forms vapor bubbles (cavities) in a liquid due to low pressure,” often causing noise or damage in pumps or propellers.","zh":"“cavitates”表示“发生空化”：在液体中因压力过低而形成气泡/空穴，常导致噪音或损伤（如水泵、螺旋桨）。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(of a liquid or a machine part in a liquid) to form vapor bubbles (cavities) because pressure drops; the bubbles can collapse and cause noise or damage.","zh":"（液体或浸在液体中的机械部件）因压力下降而产生气泡/空穴（空化）；气泡破裂会产生噪音并可能造成损伤。"},"examples":[{"en":"If the pump cavitates, it may become noisy and lose efficiency.","zh":"如果水泵发生空化，就可能变得很吵并降低效率。"},{"en":"At high speed, the propeller cavitates and can damage the blades.","zh":"在高速下，螺旋桨会发生空化，可能损坏叶片。"},{"en":"This valve cavitates when the pressure drops too quickly.","zh":"当压力下降太快时，这个阀门会发生空化。"}]}],"synonyms":["undergo cavitation","form vapor bubbles","bubble"],"phonetic":"/ˈkævəˌteɪts/","extraExplanation":["“cavitates”是动词“cavitate”的第三人称单数现在时（he/she/it cavitates）。常见于工程、流体力学语境（泵、螺旋桨、阀门等）。","空化通常发生在局部压力低于液体的饱和蒸汽压时，液体“沸腾”出小气泡；气泡随后在高压区塌陷，会产生冲击与侵蚀，因此常与“噪音、振动、效率下降、叶片/叶轮损伤”一起出现。"]}
{"word":"cavitating","summary":{"en":"Cavitating describes a liquid (or a machine moving liquid) that forms and collapses vapor bubbles due to low pressure; in dentistry it can mean forming cavities.","zh":"cavitating 指液体或设备因局部压力过低而产生并塌陷蒸汽气泡（气蚀）；在牙科中也可指形成龋洞/空洞性病变。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(of a liquid) forming small vapor bubbles because pressure drops; these bubbles can collapse suddenly.","zh":"（指液体）因压力降低而产生许多小的蒸汽气泡；这些气泡可能会突然破裂。"},"examples":[{"en":"At high speed, the water around the propeller starts cavitating.","zh":"高速运转时，螺旋桨周围的水会开始发生气蚀并产生气泡。"},{"en":"The pump was cavitating, so the flow became noisy and uneven.","zh":"水泵发生气蚀，所以流量变得很吵而且不稳定。"}]},{"partOfSpeech":"adj.","definition":{"en":"Experiencing cavitation; making or affected by vapor bubbles in a liquid (often describing a propeller, pump, or valve).","zh":"正在发生气蚀的；受到液体中蒸汽气泡影响的（常形容螺旋桨、水泵或阀门）。"},"examples":[{"en":"A cavitating propeller can lose efficiency and vibrate.","zh":"发生气蚀的螺旋桨可能效率下降并产生震动。"},{"en":"Engineers adjusted the design to reduce cavitating conditions.","zh":"工程师调整设计以减少导致气蚀的工况。"}]},{"partOfSpeech":"adj.","definition":{"en":"In dentistry/medicine: having or forming cavities (holes) in tissue or a lesion.","zh":"（牙科/医学）出现或形成“空洞/孔洞”的（如龋洞或组织空洞性病变）。"},"examples":[{"en":"The dentist noted a small cavitating lesion on the molar.","zh":"牙医发现臼齿上有一个正在形成龋洞的小病灶。"}]}],"synonyms":["undergoing cavitation","bubbling (in the cavitation sense)","pitting (result of cavitation)"],"phonetic":"/ˈkævɪˌteɪtɪŋ/","extraExplanation":["“cavitating”常见于工程语境，尤其是船舶螺旋桨、水泵、涡轮和阀门。气泡塌陷时会产生冲击，可能造成金属表面点蚀（pitting）、噪音和振动，并降低效率。","写作中常搭配：cavitating pump/propeller/flow，或说“the pump is cavitating”。与“boiling（沸腾）”不同：气蚀不一定需要高温，关键是局部压力过低。"]}
{"word":"cavitation","summary":{"en":"Cavitation is the formation and collapse of vapor bubbles in a liquid, often causing noise, vibration, and damage to equipment.","zh":"Cavitation（气蚀）是液体中汽泡的产生与塌陷现象，常引发噪声、振动，并可能损坏设备。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The formation of vapor bubbles in a liquid (often caused by rapid pressure drop), and their collapse, which can create shock waves and damage surfaces such as propellers or pump parts.","zh":"（液体中因压力骤降等原因）产生汽泡并在随后塌陷的现象；塌陷会产生冲击波，可能损坏螺旋桨或泵等部件。"},"examples":[{"en":"Cavitation can damage a ship’s propeller over time.","zh":"气蚀会随着时间损坏船的螺旋桨。"},{"en":"The engineer reduced the pump speed to prevent cavitation.","zh":"工程师降低了泵的转速以防止气蚀。"},{"en":"You may hear a rattling sound when cavitation happens in a water pipe.","zh":"当水管里发生气蚀时，你可能会听到类似“咔嗒”的噪声。"}]}],"synonyms":["vapor bubble formation","bubble collapse (in fluids)","cavitation damage (context-specific)"],"phonetic":"/ˌkævəˈteɪʃən/","extraExplanation":["“cavitation”来自拉丁语词根 *cav-*（意为“空的、空洞”），和 *cavity*（空腔）同源。它多用于工程、流体力学、医疗超声等语境。","在工程里常见的相关词有：*cavitation erosion*（气蚀侵蚀/气蚀磨损）、*cavitation bubbles*（气蚀气泡）。日常对话中不常用，更多出现在技术说明、设备故障分析和科学文章里。"]}
{"word":"cavitations","summary":{"en":"“Cavitations” most often means pressure-caused bubbles forming in a liquid (and collapsing), or hollow spaces forming inside tissue/material.","zh":"“cavitations”常指液体中因压力变化产生并塌陷的气泡（空化），也可指组织或材料内部形成的空洞/腔隙。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the formation of small vapor bubbles (cavities) in a liquid when pressure drops, often near fast-moving propellers, pumps, or turbines; these bubbles can collapse and cause noise or damage","zh":"（流体力学）空化：液体中因压力降低而形成的小气泡/空洞，常见于螺旋桨、泵或涡轮附近；气泡塌陷会产生噪音并可能造成损伤"},"examples":[{"en":"Cavitations around the propeller reduced the boat’s efficiency.","zh":"螺旋桨周围的空化降低了船的效率。"},{"en":"Engineers changed the pump design to prevent cavitations.","zh":"工程师改了泵的设计来避免空化。"}]},{"partOfSpeech":"n.","definition":{"en":"hollow spaces (cavities) that form inside a material or body tissue, especially in medical imaging or pathology","zh":"（医学/材料）空洞、腔隙：在材料或人体组织内部形成的空腔，常用于影像学或病理描述"},"examples":[{"en":"The scan showed cavitations in the lung.","zh":"扫描显示肺部有空洞。"},{"en":"The doctor monitored the cavitations to see if they were getting larger.","zh":"医生持续观察这些空洞是否在变大。"}]}],"synonyms":["cavitation","bubble formation","voids","cavities"],"phonetic":"/ˌkævəˈteɪʃənz/","extraExplanation":["“cavitation”最常见于工程与船舶/水泵领域：气泡在高压处突然塌陷，会产生冲击波，可能导致金属表面点蚀（pitting）和振动噪音。","医学里的“cavitations”常用于描述影像上看到的“空洞性病变”（例如肺部某些感染或坏死后形成的空腔）；具体含义要结合临床背景判断。"]}
{"word":"Cavite","summary":{"en":"Cavite is a province in the Philippines near Manila; it can also refer to Cavite City within that province.","zh":"Cavite 指菲律宾马尼拉附近的甲米地省；也可指该省内的甲米地市。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a province in the Philippines, located just south of Manila on Manila Bay; known for its role in Philippine history and its growing suburban/industrial areas.","zh":"菲律宾的一个省，位于马尼拉以南、马尼拉湾附近；以其重要的历史地位以及不断发展的郊区与工业区而闻名。"},"examples":[{"en":"My family moved to Cavite because it’s close to Manila but quieter.","zh":"我家搬到甲米地（Cavite），因为离马尼拉近，但更安静。"},{"en":"Cavite played a major role in the Philippine Revolution.","zh":"甲米地在菲律宾革命中发挥了重要作用。"}]},{"partOfSpeech":"other","definition":{"en":"a coastal city in Cavite Province (often called Cavite City).","zh":"甲米地省内的一座沿海城市（常称为“甲米地市”Cavite City）。"},"examples":[{"en":"We took a day trip to Cavite City to visit historical sites.","zh":"我们去甲米地市一日游，参观历史遗迹。"}]}],"synonyms":["Cavite Province","Cavite City"],"phonetic":"/kəˈviːteɪ/","extraExplanation":["“Cavite”在菲律宾历史里常与民族主义与独立运动联系在一起：19世纪末的反殖民运动中，这里是重要据点之一，因此在菲律宾近代史叙述中经常出现。","日常用法中，“Cavite”既可以指“甲米地省”（Cavite Province），也可能指“甲米地市”（Cavite City）。如果语境提到通勤、住宅开发、新城或与马尼拉相邻，多半指“省”；若提到港口、老城区或具体市区景点，可能指“市”。"]}
{"word":"caviteno","summary":{"en":"Caviteño means “from Cavite” or “a person from Cavite,” and it can also refer to Cavite Chavacano, a local Spanish-based creole variety.","zh":"Caviteño 指“来自甲米地的/甲米地人”，也可指甲米地市的一种恰瓦卡诺语（以西班牙语为基础的克里奥尔语）方言。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"from Cavite (a province in the Philippines); relating to the people, culture, or things from Cavite","zh":"来自菲律宾甲米地省（Cavite）的；与甲米地的人、文化或事物有关的"},"examples":[{"en":"She grew up in a Caviteño family near Manila.","zh":"她在马尼拉附近的一个甲米地家庭中长大。"},{"en":"Caviteño food is known for bold, savory flavors.","zh":"甲米地的食物以浓郁的咸香风味而闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Cavite","zh":"甲米地人"},"examples":[{"en":"Many Caviteños commute to Metro Manila for work.","zh":"许多甲米地人通勤到大马尼拉地区工作。"}]},{"partOfSpeech":"n.","definition":{"en":"a local variety of Chavacano (a Spanish-based creole) historically spoken in Cavite City; also called Cavite Chavacano","zh":"甲米地市历史上使用的一种恰瓦卡诺语（以西班牙语为基础的克里奥尔语）方言；也称“甲米地恰瓦卡诺语”"},"examples":[{"en":"His grandfather still understands Caviteño (Cavite Chavacano).","zh":"他祖父仍然听得懂甲米地方言的恰瓦卡诺语。"}]}],"synonyms":["Caviteno (without ñ)","from Cavite","Cavite resident"],"phonetic":"/ˌkɑːvɪˈteɪnjoʊ/","extraExplanation":["更常见的标准拼写是 **Caviteño**（带 ñ）。你输入的 **caviteno** 通常是因为键盘不方便输入 ñ 而用 n 代替。","词尾 **-eño** 来自西班牙语，常用来表示“某地的人/某地的”（类似 *Madrileño* 表示“马德里人/马德里的”）。由于菲律宾曾受西班牙长期影响，这类词形在地名与族群称呼中很常见。","在英语写作中，若无法输入 ñ，写作 **Caviteno** 也能被理解；正式场合（如学术、出版）更建议保留 **ñ**。"]}
{"word":"cavitied","summary":{"en":"“Cavitied” means having cavities or hollow spaces, especially used for teeth or pitted surfaces.","zh":"“cavitied”表示“有空洞/有蛀洞的”，常用于牙齿或表面有凹坑的物体。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having cavities (holes or hollow spaces) in it; full of pits or hollowed areas.","zh":"有洞的；有空腔的；布满凹坑/空洞的。"},"examples":[{"en":"The tooth was badly cavitied and needed a filling.","zh":"那颗牙齿蛀得很严重，需要补牙。"},{"en":"The rock surface was cavitied by years of wind and water erosion.","zh":"岩石表面经过多年的风化和流水侵蚀，变得布满孔洞。"}]}],"synonyms":["pitted","hollowed","cavernous","cavited"],"phonetic":"/ˈkævəˌtaɪd/","extraExplanation":["“cavitied”来自名词 cavity（空洞、腔）。“to cavitate”在科学语境里常指液体中因压力变化产生气泡并破裂（空化现象），但日常里 “cavitied” 更常用来描述“有洞/有蛀洞”的状态，尤其在牙科语境中。","拼写提示：更常见的表达是 “cavited”（有空洞的）或直接说 “with cavities / full of cavities”。“cavitied”相对少见，多见于特定专业写作或技术描述。"]}
{"word":"cavities","summary":{"en":"“Cavities” usually means decayed holes in teeth, and more generally it can mean hollow spaces or holes inside something.","zh":"“cavities”通常指牙齿的蛀洞（龋洞）；广义也可指物体内部的空洞或孔洞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hole or hollow space inside something; in everyday use, especially a decayed hole in a tooth.","zh":"（物体内部的）空洞；日常用法尤指（牙齿的）蛀洞、龋洞。"},"examples":[{"en":"The dentist found two small cavities in my back teeth.","zh":"牙医在我的后牙发现了两个小蛀洞。"},{"en":"Brushing and flossing every day helps prevent cavities.","zh":"每天刷牙和使用牙线有助于预防蛀牙。"},{"en":"The rock had cavities where water had slowly worn it away.","zh":"岩石上有一些空洞，是水长期侵蚀造成的。"}]},{"partOfSpeech":"other","definition":{"en":"The plural form of “cavity” (more than one cavity).","zh":"“cavity”的复数形式（不止一个空洞/龋洞）。"},"examples":[{"en":"The report mentions cavities in the walls that need to be filled.","zh":"报告提到墙里有一些空洞需要填补。"}]}],"synonyms":["holes","hollows","dental caries (teeth)","decay (teeth)"],"phonetic":"/ˈkævətiz/","extraExplanation":["在美式英语里，日常生活中说“a cavity / cavities”最常见的就是指牙齿龋坏形成的洞；更正式的说法是“dental cavity”。如果是身体里的“腔”，常见搭配有“chest cavity（胸腔）”“abdominal cavity（腹腔）”。"]}
{"word":"cavitory","summary":{"en":"“Cavitory” is not standard English; you probably want “cavity” or “cavitary.”","zh":"“cavitory”不是标准英语；你大概率要用“cavity”或“cavitary”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or misspelled form; in most contexts people mean “cavity” (a hollow space) or “cavitary” (having cavities).","zh":"非标准或常见拼写错误；多数情况下人们想表达的是“cavity”（空洞/腔）或“cavitary”（有空洞的/腔性的）。"},"examples":[{"en":"I couldn’t find “cavitory” in the dictionary—did you mean “cavity” or “cavitary”?","zh":"我在词典里找不到“cavitory”——你想说的是“cavity”还是“cavitary”？"},{"en":"The dentist found a cavity in my tooth, not a “cavitory.”","zh":"牙医发现我牙上有一个蛀洞（cavity），不是“cavitory”。"}]}],"synonyms":["cavity","cavitary"],"phonetic":"/ˈkævəti/","extraExplanation":["“cavity”是最常见的词：既可指牙齿的蛀洞，也可指任何“空腔/洞”。\n“cavitary”是形容词，更常见于医学语境（如“cavitary lesion”=“空洞性病灶”）。\n如果你是在看医学报告或影像学描述，可能要用“cavitary”；如果是日常说牙齿蛀洞，用“cavity”。"]}
{"word":"cavity","summary":{"en":"A cavity is most commonly a hole in a tooth from decay, and more generally any hollow space inside something (like a body cavity or a tree cavity).","zh":"cavity最常指牙齿因龋坏形成的蛀洞；也可泛指任何内部的空腔或中空空间（如腹腔、树洞）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hole in a tooth caused by decay (a dental caries).","zh":"（牙齿的）蛀洞；龋洞（由蛀牙/龋坏造成的洞）。"},"examples":[{"en":"The dentist found two cavities and filled them the same day.","zh":"牙医发现了两处蛀洞，并在当天补好了。"},{"en":"Too much sugar can increase your risk of cavities.","zh":"糖吃太多会增加长蛀洞的风险。"}]},{"partOfSpeech":"n.","definition":{"en":"An empty space or hollow area inside something, especially in the body or in an object.","zh":"（物体或身体内部的）空腔；腔；洞（尤指内部的中空空间）。"},"examples":[{"en":"The surgeon examined the abdominal cavity.","zh":"外科医生检查了腹腔。"},{"en":"The bird built a nest in a cavity in the tree.","zh":"那只鸟在树洞里筑了巢。"}]}],"synonyms":["hole","hollow","space","void"],"phonetic":"/ˈkævəti/","extraExplanation":["“cavity”在日常生活里最常指“牙洞/蛀洞”，去看牙医时常听到：cavity filling（补牙/补蛀洞）、cavity prevention（预防蛀牙）。","在解剖学里，“body cavity”指身体的腔隙，如胸腔（thoracic cavity）和腹腔（abdominal cavity）。语境不同，含义就会从“牙洞”扩展为更一般的“空腔”。"]}
{"word":"cavity qed","summary":{"en":"“Cavity QED” is a physics term for studying and controlling light–matter interaction inside a resonant cavity.","zh":"“cavity QED（腔QED）”是物理术语，指在共振腔中研究并操控光与物质相互作用的领域。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(physics) Short for “cavity quantum electrodynamics”: the study of how light (photons) interacts with atoms or other quantum systems inside a resonant cavity, where the cavity strongly shapes the interaction.","zh":"（物理）“cavity quantum electrodynamics”的简称：研究光子在共振腔（cavity）中与原子或其他量子系统相互作用的领域；腔体会显著增强或改变量子相互作用。"},"examples":[{"en":"Cavity QED experiments can trap single atoms and let them interact with one photon at a time.","zh":"腔QED实验可以困住单个原子，让它们一次只和一个光子发生相互作用。"},{"en":"Researchers use cavity QED to build devices for quantum communication and quantum computing.","zh":"研究人员用腔QED来开发量子通信和量子计算相关的器件。"}]}],"synonyms":["cavity quantum electrodynamics","CQED"],"phonetic":"ˈkævəti ˌkjuː iː ˈdiː","extraExplanation":["“QED”在这里读作字母（Q-E-D），指的是“quantum electrodynamics（量子电动力学）”。注意它不同于拉丁语短语“Q.E.D.”（quod erat demonstrandum，常用于数学证明结尾，意为“证毕”）。","“cavity（腔/谐振腔）”通常指能把电磁波困在里面来回反射的结构（例如两面高反射镜之间的光学腔），它能让光与物质的耦合变得更强、更可控。"]}
{"word":"caviya","summary":{"en":"“Caviar” means salted fish eggs eaten as a delicacy, and it can also be used figuratively for something luxurious or rare.","zh":"“caviar”指鱼子酱（腌制鱼卵的美食），也可比喻奢侈、稀有、只有少数人享用的东西。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Salted fish eggs (roe), especially from sturgeon, eaten as a delicacy.","zh":"（尤指鲟鱼的）鱼子酱；用盐腌制的鱼卵，常被视为美食。"},"examples":[{"en":"They served caviar on small pieces of toast.","zh":"他们把鱼子酱放在小块吐司上端上来。"},{"en":"Caviar is often eaten with a spoon made of non-metal, like mother-of-pearl.","zh":"鱼子酱常用非金属勺（如珍珠母勺）食用。"}]},{"partOfSpeech":"n.","definition":{"en":"Something considered luxurious, rare, or only for a small group of people (used figuratively).","zh":"（比喻）奢侈品；稀有而昂贵、只有少数人享用的东西。"},"examples":[{"en":"For many families, private tutoring is caviar—nice, but not affordable.","zh":"对很多家庭来说，私教课像“鱼子酱”一样——很好，但负担不起。"},{"en":"Good sleep can feel like caviar during exam week.","zh":"考试周里，睡个好觉都像鱼子酱一样珍贵。"}]}],"synonyms":["roe","fish eggs","delicacy","luxury"],"phonetic":"/ˈkæv.i.ɑr/","extraExplanation":["“caviya”在英语里不是常见拼写；你可能想查的是 **caviar**（鱼子酱），或较少见的 **Cavia**（豚鼠属，生物学用语）。如果你想要我查其中哪一个，也可以告诉我语境。"]}
{"word":"cavort","summary":{"en":"Cavort means to move around playfully and energetically; it can also suggest showy or irresponsible partying, especially in criticism.","zh":"cavort 指精力充沛地嬉戏、欢跳；也可带批评语气，指卖弄或不负责任地作乐（常见于新闻/评论语境）。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to jump, dance, or run around in an energetic, playful way","zh":"（精力充沛地）嬉戏；欢跳；蹦蹦跳跳地玩耍"},"examples":[{"en":"The kids cavorted in the park after school.","zh":"放学后孩子们在公园里嬉戏玩耍。"},{"en":"Puppies cavorted in the grass, chasing each other.","zh":"小狗们在草地上嬉闹追逐。"}]},{"partOfSpeech":"vi.","definition":{"en":"to behave in a lively, sometimes showy way (often used humorously or disapprovingly)","zh":"（有时带嘲讽或不赞同地）卖弄地嬉闹；放纵地作乐"},"examples":[{"en":"Reporters criticized the celebrity for cavorting on a yacht during the crisis.","zh":"记者批评那位名人在危机期间还在游艇上纵情玩乐。"},{"en":"He was accused of cavorting with corrupt officials.","zh":"他被指控与腐败官员厮混。"}]}],"synonyms":["frolic","romp","prance","skip","capers"],"phonetic":"/kəˈvɔrt/","extraExplanation":["“cavort”常带有画面感：快乐地跳动、奔跑、打闹。用在成年人身上时，语气可能变得讽刺或带批评（如“cavorting on the beach while others work”）。","固定搭配：cavort with sb 表示“与某人厮混/鬼混”（语气多为负面或调侃）。"]}
{"word":"cavorted","summary":{"en":"“Cavorted” means “played or moved around in a lively, excited way” (past tense of cavort).","zh":"“cavorted”是“cavort”的过去式，表示“欢快地蹦跳嬉戏/放得开地玩闹”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(past tense of “cavort”) to jump, run, dance, or play in a lively, energetic way, often because you feel happy or excited.","zh":"（“cavort”的过去式）欢快地蹦跳、奔跑、跳舞或嬉戏；常因开心或兴奋而动作夸张。"},"examples":[{"en":"The kids cavorted in the park after school.","zh":"孩子们放学后在公园里嬉戏打闹。"},{"en":"Puppies cavorted around the yard, chasing each other.","zh":"小狗们在院子里追来追去、欢蹦乱跳。"},{"en":"She cavorted on the beach when she heard the good news.","zh":"她听到好消息后在海滩上高兴得又跳又跑。"}]},{"partOfSpeech":"vi.","definition":{"en":"(past tense of “cavort”) to behave in a playful or uninhibited way in a public or social situation; sometimes suggests showing off or acting a bit wild.","zh":"（“cavort”的过去式）在社交或公共场合玩闹、放得开；有时带“有点张扬/疯闹”的意味。"},"examples":[{"en":"They cavorted at the party and didn’t care who was watching.","zh":"他们在派对上放肆地玩闹，也不在乎别人怎么看。"},{"en":"The actor cavorted for the cameras during the premiere.","zh":"那位演员在首映礼上对着镜头一通卖力表现。"}]}],"synonyms":["romped","frolicked","pranced","played","gambolled"],"phonetic":"/kəˈvɔrt/","extraExplanation":["“cavort”常用于书面或描写性的语境，比“play”更强调动作夸张、精力旺盛、带点淘气或放纵的感觉。","在较正式的新闻或评论里，“cavort”有时会带轻微的负面评价（像是在不合时宜地胡闹或招摇）。"]}
{"word":"cavorter","summary":{"en":"A cavorter is someone who moves around in a lively, playful way—jumping, dancing, or romping.","zh":"cavorter 指“嬉闹者/欢跳玩乐的人”，形容活泼、顽皮地跳舞、乱蹦或嬉戏的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who cavorts—someone who jumps, dances, or moves around in a lively, playful way (often in a carefree or slightly silly manner)","zh":"嬉闹者；欢跳玩乐的人——指以活泼、顽皮的方式跳跃、舞动或到处跑动的人（常带有无忧无虑或略显滑稽的感觉）"},"examples":[{"en":"The children were happy cavorters on the beach, splashing in the waves.","zh":"孩子们在海滩上成了快乐的嬉闹者，在海浪里拍水玩。"},{"en":"The host called her guests “cavorters” and invited them onto the dance floor.","zh":"主持人把客人称作“嬉闹者”，邀请大家到舞池里来。"}]}],"synonyms":["romper","dancer","reveler","partygoer","frolicker"],"phonetic":"/kəˈvɔrtər/","extraExplanation":["“cavorter”来自动词“cavort”（嬉戏、欢跳）。这个名词不算特别常见，日常里更常用“dancer”“partygoer”“romper”等；“cavorter”常带一点轻松幽默或带画面感的写法。","语体上偏口语/文学描写：可以用来描写人或动物在开心、兴奋时的动作（例如小狗在草地上乱蹦）。"]}
{"word":"cavorters","summary":{"en":"“Cavorters” are people or animals who frolic or move about playfully and energetically.","zh":"“cavorters”指嬉戏玩闹、活泼跑跳（甚至有点胡闹）的人或动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People (or animals) who cavort—move around in a lively, playful way, often dancing, skipping, or behaving excitedly.","zh":"（人或动物）嬉戏玩闹的人；欢跳打闹者；（常指）兴奋地跑跳、跳舞或胡闹的人。"},"examples":[{"en":"The cavorters splashed in the shallow water, laughing loudly.","zh":"这群嬉戏玩闹的人在浅水里嬉水，笑声不断。"},{"en":"In the park, children and dogs were cheerful cavorters on a sunny afternoon.","zh":"在公园里，孩子和狗在晴朗的午后都成了快乐的嬉戏者。"},{"en":"The reporter described the beach cavorters as carefree and noisy.","zh":"记者把海滩上的嬉闹者形容得无忧无虑又吵闹。"}]}],"synonyms":["frolickers","rompers","players","revelers"],"phonetic":"/kəˈvɔr.tərz/","extraExplanation":["“cavort”常带有“欢闹、蹦跳、手舞足蹈”的画面感，有时语气偏随意或带一点调侃，写作中可用来描绘热闹、无拘束的场景。","词源上，“cavort”与法语/拉丁语系的“跳、翻腾”相关，现代英语中多用于描写活泼的动作（如在海滩、派对、草地上玩闹）。"]}
{"word":"cavorting","summary":{"en":"“Cavorting” means playing or moving around in a lively, playful way; it can also (often disapprovingly) suggest socializing in an improper way.","zh":"“cavorting”指欢快地嬉闹、蹦跳、玩耍；也可（多带不赞同）指与人不太得体地厮混/交往。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to dance, run around, or behave in a lively and playful way (often in an energetic or silly manner)","zh":"（常指精力旺盛或有点傻气地）欢快地跳舞、奔跑或嬉闹"},"examples":[{"en":"The children were cavorting in the yard after school.","zh":"放学后，孩子们在院子里嬉闹。"},{"en":"We saw dolphins cavorting in the waves near the boat.","zh":"我们看到海豚在船边的海浪里嬉戏。"},{"en":"He was cavorting around the stage, making the crowd laugh.","zh":"他在舞台上蹦蹦跳跳，逗得观众大笑。"}]},{"partOfSpeech":"v.","definition":{"en":"to spend time with someone in a way that seems improper or that people might criticize (often used jokingly or disapprovingly)","zh":"（常带玩笑或不赞同语气）与某人厮混/交往，显得不太得体或容易招人议论"},"examples":[{"en":"The tabloids claimed the actor was cavorting with a mystery guest.","zh":"小报声称那位演员在与一位神秘来客厮混。"},{"en":"She didn’t want to be seen cavorting with her boss at the party.","zh":"她不想在派对上被人看见和老板过于亲密地来往。"}]}],"synonyms":["romping","frolicking","prancing","gamboling","larking about"],"phonetic":"/kəˈvɔr.tɪŋ/","extraExplanation":["“cavorting”是动词“cavort”的现在分词/动名词形式，常见于进行时（was cavorting）或作伴随动作（came cavorting in）。","语气与用法：既可中性表示“嬉戏玩耍”，也可带一点夸张或调侃；在新闻/八卦语境里常暗示“举止不端的交往”。","常见搭配：cavort around（到处蹦跳/乱跑）、cavort in the water（在水里嬉戏）、cavort with（与……嬉闹/厮混）。"]}
{"word":"cavorts","summary":{"en":"“Cavorts” means ‘plays or moves around in a lively, excited way,’ and it can also imply ‘behaves flirtatiously or improperly’ in negative contexts.","zh":"“cavorts”表示“欢跳嬉戏、兴奋地跑跳”，在负面语境中也可指“轻佻或不正当地鬼混/厮混”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to jump, run, dance, or play in a lively, excited way (often for fun or showing off)","zh":"（常指为了好玩或炫耀而）欢跳、嬉戏、雀跃"},"examples":[{"en":"The children cavorted on the beach after dinner.","zh":"晚饭后，孩子们在海滩上嬉戏打闹。"},{"en":"The puppy cavorted around the yard, chasing leaves.","zh":"小狗在院子里欢跳，追着落叶跑。"},{"en":"He cavorted at the party to get everyone’s attention.","zh":"他在派对上又跳又闹，想吸引大家注意。"}]},{"partOfSpeech":"v.","definition":{"en":"(often disapproving) to behave in a playful or sexually suggestive way","zh":"（常含贬义）放荡地嬉闹；做出轻佻、带性暗示的举动"},"examples":[{"en":"The tabloid claimed the celebrity was cavorting with strangers.","zh":"小报声称那位名人和陌生人鬼混。"},{"en":"They were accused of cavorting in public when they should have been working.","zh":"他们被指责在该工作的时候却在公共场合嬉闹。"}]}],"synonyms":["frolics","romps","plays","prances","leaps around"],"phonetic":"/kəˈvɔrts/","extraExplanation":["“cavorts”是动词“cavort”的第三人称单数（he/she/it cavorts）。过去式是“cavorted”，现在分词是“cavorting”。","这个词在新闻或八卦语境中很常见，尤其搭配“cavort with …”（和……鬼混/厮混），语气往往带批评或暗示不正当关系。日常中更中性、常见的替换词有“play” “frolic” “run around”。"]}
{"word":"Cavour","summary":{"en":"Cavour is the name of an important Italian leader who helped unify Italy in the 1800s.","zh":"Cavour 指一位19世纪推动意大利统一的重要意大利领导人（加富尔伯爵）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Camillo Benso, Count of Cavour (1810–1861), an Italian statesman who helped lead the movement to unify Italy and served as the first prime minister of the Kingdom of Italy.","zh":"加富尔伯爵卡米洛·奔索（1810–1861），意大利政治家，推动意大利统一运动的重要领导者之一，并担任意大利王国首任首相。"},"examples":[{"en":"Cavour worked with Victor Emmanuel II during the unification of Italy.","zh":"加富尔在意大利统一过程中与维托里奥·埃马努埃莱二世合作。"},{"en":"In many history books, Cavour is mentioned alongside Garibaldi and Mazzini.","zh":"在许多历史书中，加富尔常与加里波第和马志尼并列被提及。"}]}],"synonyms":["Count of Cavour","Camillo Benso"],"phonetic":"/kəˈvʊr/","extraExplanation":["“Cavour”通常指历史人物“加富尔伯爵”。他以务实的外交与改革著称，通过结盟与战争推动意大利诸邦统一。意大利语原名为 Camillo Benso, Conte di Cavour。","学习场景里，这个词多出现在欧洲史/意大利统一（Risorgimento，意大利复兴运动）的章节中，常与 Garibaldi（加里波第）、Mazzini（马志尼）、Victor Emmanuel II（维托里奥·埃马努埃莱二世）一起出现。"]}
{"word":"CAVU","summary":{"en":"CAVU is an aviation term for perfectly clear flying weather (“ceiling and visibility unlimited”), and informally it can mean everything is going smoothly.","zh":"CAVU 原为航空用语，指“云底高度与能见度无限制”的好天气；口语里也可引申为“一切顺利、形势明朗”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Aviation weather term meaning “ceiling and visibility unlimited,” i.e., clear skies with very good flying conditions.","zh":"航空气象用语，指“云底高度与能见度无限制”，也就是天空晴朗、能见度极佳，适合飞行。"},"examples":[{"en":"The forecast is CAVU all day, so we won’t have weather delays.","zh":"预报显示全天都是 CAVU，所以不会因为天气而延误。"},{"en":"The pilot reported CAVU conditions over the airfield.","zh":"飞行员报告机场上空为 CAVU 天气条件。"}]},{"partOfSpeech":"adj.","definition":{"en":"Informal: very clear, calm, or ideal—like a “blue-sky day,” often used about life or a situation.","zh":"非正式用法：形势很清晰、顺利或理想，类似“风和日丽、一路顺风”的感觉，也可形容生活状态。"},"examples":[{"en":"After we solved the budget issue, everything felt CAVU.","zh":"预算问题解决后，一切都感觉顺风顺水、很 CAVU。"},{"en":"Not perfect, but pretty CAVU compared with last week.","zh":"不算完美，但和上周比已经相当 CAVU 了。"}]}],"synonyms":["clear skies","blue-sky","clear and calm","smooth sailing"],"phonetic":"/ˈkævuː/","extraExplanation":["CAVU 是缩写：Ceiling And Visibility Unlimited。ceiling 指云底高度（云层底部到地面的高度），visibility 指能见度；“unlimited”表示没有显著限制（对飞行很有利）。","它常见于美国军用/民用航空圈，也被一些飞行员、军人或户外爱好者借用到日常表达里，用来形容“前景明朗、没有阻碍”。","书写上通常全大写（CAVU）。口语里多读作 “KAV-oo”。"]}
{"word":"cavu","summary":{"en":"CAVU means extremely clear weather for flying: cloud ceiling and visibility are essentially unlimited.","zh":"CAVU 指飞行时极其晴朗的天气：云底高度和能见度基本不受限制。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Aviation, informal) Short for “ceiling and visibility unlimited”: perfectly clear flying weather with no meaningful cloud ceiling and excellent visibility.","zh":"（航空/口语）“ceiling and visibility unlimited”的缩写：云底高度与能见度都几乎不受限制的极佳飞行天气，通常指天空非常晴朗、视程很远。"},"examples":[{"en":"The forecast is CAVU all day, so we can fly VFR without worries.","zh":"预报说全天都是 CAVU，所以我们可以放心按目视飞行（VFR）进行。"},{"en":"We took off at dawn—CAVU conditions and a smooth ride.","zh":"我们黎明起飞——CAVU 的天气，飞行非常平稳。"},{"en":"If it’s CAVU, you’ll get amazing views over the mountains.","zh":"如果是 CAVU，你会看到特别清晰的山景。"}]}],"synonyms":["clear","clear skies","great visibility","severe clear"],"phonetic":"/ˈkævuː/","extraExplanation":["CAVU 常见于飞行员口语、航空论坛、航行情报简报等语境；它强调“几乎没有云层限制、能见度极好”。","日常英语里不常用；如果对非航空人士表达，可说 “clear skies,” “perfectly clear,” 或 “great visibility.”","相关表达：VFR（目视飞行规则）、“severe clear”（非常通透、几乎无云的晴朗天气）。"]}
{"word":"cavum","summary":{"en":"A medical/anatomical term meaning a hollow space or cavity in the body.","zh":"医学/解剖学术语，指体内的空腔或腔隙。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anatomy/medicine) a hollow space or cavity inside the body or an organ.","zh":"（解剖/医学）体内或器官内的空腔、腔隙。"},"examples":[{"en":"The report noted a small cavum in the brain near the midline.","zh":"报告指出大脑中线附近有一个较小的腔隙。"},{"en":"In anatomy class, we learned that “cavum” is a Latin-based term used in many structure names.","zh":"在解剖课上，我们学到“cavum”是一个源自拉丁语的术语，常出现在许多结构名称中。"}]}],"synonyms":["cavity","hollow","space","chamber"],"phonetic":"/ˈkeɪvəm/","extraExplanation":["“cavum”来自拉丁语，意思是“空的地方/凹陷处”。在医学英语里它常作为专业名词出现在结构名称中，例如：cavum septi pellucidi（透明隔腔）、cavum nasi（鼻腔）。","日常英语里更常用的是“cavity”“space”“chamber”等；“cavum”多见于论文、影像报告和解剖学命名。"]}
{"word":"Cavuoto","summary":{"en":"Cavuoto is most commonly used as a surname (a family name).","zh":"Cavuoto 最常见的用法是作为姓氏（家族姓）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname), most often of Italian origin","zh":"一个姓氏（家族姓），多见于意大利语背景"},"examples":[{"en":"Ms. Cavuoto will lead the meeting today.","zh":"Cavuoto 女士今天将主持会议。"},{"en":"I saw the name Cavuoto on the class list.","zh":"我在班级名单上看到了 Cavuoto 这个姓。"}]}],"phonetic":"/ˌkɑːˈwoʊtoʊ/","extraExplanation":["“Cavuoto”通常作为专有名词使用（姓氏），英语里一般不翻译含义；在写作中首字母大写。","在英语语境中遇到不熟悉的姓氏时，最礼貌的做法是询问对方希望的读法（How do you pronounce your last name?）。"]}
{"word":"cavus","summary":{"en":"Cavus is a medical/Latin word meaning “hollow or concave,” most commonly seen in the term “pes cavus” (a high-arched foot).","zh":"Cavus 是医学/拉丁语词，意为“空的、凹的”，最常见于“pes cavus（高弓足）”这一术语中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical/Latin) hollow or concave; used in anatomy to describe a structure that is arched inward.","zh":"（医学/拉丁语）空的、凹的；用于解剖学中描述某个结构向内凹或呈弓形内陷。"},"examples":[{"en":"The X-ray suggested a cavus deformity of the foot.","zh":"X 光片提示足部存在“cavus（凹弓）”畸形。"},{"en":"Pes cavus is a condition where the foot has a very high arch.","zh":"Pes cavus（高弓足）是指足弓异常增高的一种情况。"}]},{"partOfSpeech":"phrase","definition":{"en":"Short form used in medical phrases (especially in orthopedics/podiatry), as in “pes cavus.”","zh":"（医学短语用法）常作为术语搭配中的核心词使用（尤其在骨科/足病学中），如“pes cavus（高弓足）”。"},"examples":[{"en":"The clinician documented “pes cavus” in the patient’s chart.","zh":"临床医生在病历中记录了“pes cavus（高弓足）”。"},{"en":"He was treated for a cavus foot posture that caused pain when walking.","zh":"他因“cavus 足姿势（足弓过高）”导致行走疼痛而接受治疗。"}]}],"synonyms":["concave","hollow","arched (inward)"],"phonetic":"/ˈkeɪvəs/","extraExplanation":["“cavus”来自拉丁语，意思是“空的/凹的”。在日常英语里很少单独使用，更多出现在医学拉丁术语中。","最常见搭配是“pes cavus”（pes=足），指足弓过高、足底中部不易着地；与“pes planus（扁平足）”相对。若你是在医学文章或检验报告里看到它，通常与足部结构或畸形描述有关。"]}
{"word":"cavy","summary":{"en":"Cavy means a guinea pig; it’s a less common, more formal word.","zh":"cavy 指“天竺鼠/豚鼠”，比 guinea pig 更少见、偏书面或正式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A guinea pig (a small rodent often kept as a pet or used in scientific research).","zh":"天竺鼠；豚鼠（常见的小型啮齿动物，可当宠物，也常用于实验研究）。"},"examples":[{"en":"She keeps a cavy at home as a gentle pet.","zh":"她在家里养了一只天竺鼠，当作温顺的宠物。"},{"en":"Cavies are social animals, so they often do better in pairs.","zh":"天竺鼠是群居动物，所以通常两只一起养会更适应。"}]}],"synonyms":["guinea pig"],"phonetic":"/ˈkeɪvi/","extraExplanation":["“cavy”在日常英语里不如“guinea pig”常用，更多见于较正式或书面语（例如动物学、科普写作）。","“guinea pig”也常被引申为“（新事物的）试验对象/小白鼠”，而“cavy”一般不这样引申。"]}
{"word":"cavyyard","summary":{"en":"Graveyard means a cemetery (a place where people are buried) and can also mean a place where old or unused things end up.","zh":"Graveyard 指“墓地”，也可比喻“废弃物/旧事物的堆积地、终点”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place where dead people are buried; a cemetery","zh":"墓地；埋葬死者的地方（同 cemetery）"},"examples":[{"en":"They walked quietly through the graveyard behind the church.","zh":"他们安静地穿过教堂后面的墓地。"},{"en":"There’s an old graveyard near my town.","zh":"我家附近有一座老墓地。"}]},{"partOfSpeech":"n.","definition":{"en":"a place where many old, broken, or unused things are left; a “dead” place for something","zh":"（比喻）废弃物堆放处；某事物的“终点/沉寂之地”"},"examples":[{"en":"The back room became a graveyard for broken computers.","zh":"后屋成了坏电脑的“坟场”。"},{"en":"That folder is a graveyard of unfinished ideas.","zh":"那个文件夹就是未完成想法的“坟场”。"}]}],"synonyms":["cemetery","burial ground","churchyard"],"phonetic":"/ˈɡreɪvˌjɑrd/","extraExplanation":["你输入的“cavyyard”很可能是拼写错误，正确拼写通常是 graveyard。","graveyard 常指教堂旁的墓地（历史上很多墓地与教堂相连）；更中性的词是 cemetery（不一定与教堂相关）。","在文学与影视中，graveyard 常被用来营造阴森、怀旧或“终结”的氛围；比喻义也很常见，比如“a graveyard of dreams（梦想的坟场）”。"]}
