{"word":"Caxias","summary":{"en":"Caxias is a Portuguese proper name, often referring to Brazilian places (e.g., Duque de Caxias) or to the Duke of Caxias, a key figure in Brazil’s 19th‑century history.","zh":"Caxias 是葡语专有名词，常指巴西的地名（如杜克·德·卡希亚斯）或“卡希亚斯公爵”（巴西19世纪历史中的重要人物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Portuguese surname and place name, most commonly referring to people or places in Brazil (for example, Duque de Caxias, a city near Rio de Janeiro).","zh":"葡语中的姓氏与地名，最常见指巴西的人名或地名（例如里约热内卢附近的城市“杜克·德·卡希亚斯”）。"},"examples":[{"en":"She grew up in Duque de Caxias, in the state of Rio de Janeiro.","zh":"她在里约热内卢州的杜克·德·卡希亚斯长大。"},{"en":"The museum has an exhibit about Caxias and Brazil’s history.","zh":"博物馆有一个关于“卡希亚斯”和巴西历史的展览。"}]},{"partOfSpeech":"n.","definition":{"en":"A shortened way to refer to Luís Alves de Lima e Silva, the Duke of Caxias, a major 19th‑century Brazilian military and political figure.","zh":"“卡希亚斯”的简称，用来指巴西19世纪重要的军事与政治人物——路易斯·阿尔维斯·德·利马·席尔瓦（卡希亚斯公爵）。"},"examples":[{"en":"In Brazilian history class, we learned about Caxias and the imperial army.","zh":"在巴西历史课上，我们学习了卡希亚斯以及帝国军队。"},{"en":"The statue honors Caxias for his role in national unification.","zh":"这座雕像表彰卡希亚斯在国家统一中的作用。"}]}],"synonyms":["Duque de Caxias","Caxias do Sul","Duke of Caxias"],"phonetic":"/kɑˈʃiːəs/","extraExplanation":["“Caxias”源自葡语，常被用作纪念性地名或称号的一部分，如“Duque de Caxias（卡希亚斯公爵）”。在英语语境中，它多作为专有名词出现，通常不翻译，而是音译或保留原名。","发音提示：葡语更接近“ka-SHEE-as”；英语使用者常按拼写读成接近 /kɑˈʃiːəs/。"]}
{"word":"caxiri","summary":{"en":"Caxiri is a traditional Amazon-region fermented drink, usually made from cassava (manioc).","zh":"Caxiri 是亚马孙地区常见的传统发酵饮品，通常以木薯（树薯）为主要原料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional fermented drink (often mildly alcoholic) made mainly from cassava/manioc, especially in parts of the Amazon region of Brazil and neighboring areas","zh":"（主要见于巴西亚马孙地区及周边）一种用木薯/树薯发酵制成的传统饮品，常带轻微酒精度"},"examples":[{"en":"In some Amazon communities, caxiri is prepared for festivals and shared with guests.","zh":"在一些亚马孙地区的社群里，caxiri 常在节庆时制作，并与来客共享。"},{"en":"The recipe for caxiri can vary by region and family tradition.","zh":"caxiri 的做法会因地区与家族传统而不同。"}]}],"synonyms":["cassava beer","manioc beer","fermented cassava drink"],"phonetic":"/kɑˈʃiːri/","extraExplanation":["“Caxiri”是葡萄牙语借词，常用于描述亚马孙流域一些原住民与河岸社群的发酵饮品文化。不同地方可能会用木薯为主，也可能加入玉米、甘薯等，发酵时间与酒精度也会不同。","在文化语境里，它不仅是“饮料”，也常与待客、社群聚会、仪式或节庆相关；翻译成英文时有时会解释为“cassava (manioc) beer”，但并不一定等同于现代工业啤酒。"]}
{"word":"caxon","summary":{"en":"“Caxon” is usually a misspelling; the intended word is often “caisson.”","zh":"“caxon”通常是拼写错误；常见的目标词是“caisson（沉箱/弹药箱）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or misspelled form; most often people mean “caisson,” a watertight box-like structure used in construction (especially for bridge foundations), or an ammunition chest in military use.","zh":"非标准拼写/拼写错误；多数情况下人们想写的是“caisson（沉箱/气压沉箱）”，用于工程施工（尤其桥梁地基）的防水箱体结构；在军事语境中也可指“弹药箱（炮车上的弹药箱）”。"},"examples":[{"en":"I couldn’t find “caxon” in the dictionary—did you mean “caisson”?","zh":"我在词典里找不到“caxon”——你是不是想写“caisson”？"},{"en":"Workers lowered a caisson into the riverbed to build the bridge pier.","zh":"工人把沉箱下放到河床里来建造桥墩。"}]}],"synonyms":["caisson","cofferdam","ammunition chest"],"phonetic":"/ˈkeɪsən/","extraExplanation":["“caxon”本身并不是常见或标准英文单词。最可能的目标词是 **caisson**（美式IPA：/ˈkeɪsən/）。工程里的 *caisson* 常译为“沉箱/气压沉箱”；军事里的 *caisson* 常见于历史文本，指运送或存放弹药的箱/车。若你告诉我它出现的句子或领域（工程/军事/人名等），我可以更精确判断。"]}
{"word":"Caxton","summary":{"en":"Caxton usually refers to William Caxton, England’s first printer; in book history, “a Caxton” can mean a book printed by him.","zh":"Caxton通常指英国第一位印刷商威廉·卡克斯顿；在藏书/书籍史语境中，“a Caxton”也可指他印行的书。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"William Caxton (c. 1422–1491), the first English printer and publisher, known for introducing the printing press to England and printing many early English books.","zh":"威廉·卡克斯顿（约1422–1491），英国第一位印刷商与出版商，以把活字印刷术引入英格兰、印行大量早期英文书籍而著名。"},"examples":[{"en":"William Caxton set up a printing press in Westminster in 1476.","zh":"威廉·卡克斯顿于1476年在威斯敏斯特建立了印刷作坊。"},{"en":"Caxton’s editions helped spread stories like the legends of King Arthur to more readers.","zh":"卡克斯顿的版本让亚瑟王传说等故事传播给更多读者。"}]},{"partOfSpeech":"n.","definition":{"en":"By extension, something connected with Caxton’s printing work (such as “a Caxton” meaning a book printed by Caxton), used mainly in historical or book-collecting contexts.","zh":"引申义：与卡克斯顿印刷相关的事物（如收藏界说“a Caxton”指“卡克斯顿印行的书”），多用于历史或藏书语境。"},"examples":[{"en":"The library displayed a rare Caxton behind glass.","zh":"图书馆在玻璃柜中展出了一本稀有的“卡克斯顿印本”。"},{"en":"Collectors prize Caxtons for their place in the history of English printing.","zh":"收藏家珍视卡克斯顿印本，因为它们在英国印刷史上地位重要。"}]}],"synonyms":["William Caxton"],"phonetic":"/ˈkækstən/","extraExplanation":["卡克斯顿常被提到的原因之一是：印刷让书籍成本大幅下降、读者人数增加；同时也推动英文拼写与用词逐渐趋于统一（虽然在他那个年代仍有很多变体）。","卡克斯顿印过的重要作品包括乔叟（Chaucer）的作品，以及托马斯·马洛礼（Thomas Malory）的《亚瑟王之死》（Le Morte d'Arthur）。"]}
{"word":"caxton","summary":{"en":"Caxton usually refers to William Caxton, the first English printer, or to books printed by him.","zh":"Caxton 通常指英国第一位印刷商威廉·卡克斯顿，或指他印行的书籍/版本。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"William Caxton (c. 1422–1491), the first English printer and publisher, who introduced the printing press to England and helped standardize written English.","zh":"威廉·卡克斯顿（约1422–1491），英国第一位印刷商与出版商，将印刷术带到英国，并在一定程度上推动了英语书面语的规范化。"},"examples":[{"en":"William Caxton set up one of the earliest printing presses in England.","zh":"威廉·卡克斯顿在英国建立了最早的一批印刷作坊之一。"},{"en":"Many students meet Caxton when they study the history of English books.","zh":"许多学生在学习英国图书史时会接触到卡克斯顿。"}]},{"partOfSpeech":"n.","definition":{"en":"(By extension) a book or edition printed by Caxton, or something connected with early English printing.","zh":"（引申）卡克斯顿印行的书/版本；或与早期英国印刷有关的事物。"},"examples":[{"en":"The library owns a rare Caxton in its special collections.","zh":"这家图书馆的特藏里有一本罕见的卡克斯顿印本。"},{"en":"Collectors look for Caxtons because of their historical value.","zh":"收藏家寻找卡克斯顿印本，因为它们具有历史价值。"}]}],"synonyms":["William Caxton","early English printer","Caxton edition"],"phonetic":"/ˈkækstən/","extraExplanation":["卡克斯顿最著名的成就之一是他在威斯敏斯特（Westminster）建立印刷所，并印行了许多重要作品（如乔叟《坎特伯雷故事集》的一些早期版本）。他的拼写与用词选择对后来的“标准英语”形成有一定影响，但并非单独决定因素，而是与当时伦敦书面语、行政与商业语言的变化共同作用。"]}
{"word":"Caxton-related","summary":{"en":"Caxton-related means connected with William Caxton or his work in early English printing and publishing.","zh":"Caxton-related 指与威廉·卡克斯顿或其在英格兰早期印刷与出版工作相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with William Caxton (the first English printer) or with his printing, books, language, or historical period.","zh":"与威廉·卡克斯顿（英国最早的印刷商）或与其印刷、书籍、语言使用及其时代背景有关的。"},"examples":[{"en":"The museum has a small Caxton-related exhibit on early English printing.","zh":"博物馆有一个小型展览，介绍与卡克斯顿相关的早期英格兰印刷史。"},{"en":"Scholars study Caxton-related spellings to understand how written English began to standardize.","zh":"学者研究与卡克斯顿相关的拼写形式，以了解书面英语如何开始走向规范化。"}]}],"synonyms":["Caxtonian","related to Caxton","Caxton-associated"],"phonetic":"/ˈkækstən rɪˌleɪtɪd/","extraExplanation":["“Caxton-related”通常用于学术或博物馆语境，指与威廉·卡克斯顿（William Caxton, c.1422–1491）有关的事物。卡克斯顿于1476年在威斯敏斯特建立印刷所，将印刷术带到英格兰，对英语出版与拼写逐渐趋于一致有重要影响。","与之相关的常见搭配有：Caxton-related materials/editions/spellings/exhibit（相关材料/版本/拼写/展览）。","语感上它是一个“专名 + related”的复合形容词，写作时常加连字符；也可用更正式的替换表达，如 “related to Caxton” 或 “Caxtonian”。"]}
{"word":"Caxtonian","summary":{"en":"Caxtonian means “connected with William Caxton or his early English printing style.”","zh":"Caxtonian 指“与威廉·卡克斯顿或其早期英语印刷风格相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to William Caxton (c. 1422–1491), the first English printer, or to his printing, spelling, and language style in early printed English.","zh":"与威廉·卡克斯顿（约1422–1491，英国第一位印刷商）有关的；或指他早期英语印刷中的拼写、语言与风格。"},"examples":[{"en":"The museum has a small Caxtonian collection, including early printed books.","zh":"博物馆有一批小型的卡克斯顿相关藏品，包括早期印刷书籍。"},{"en":"Scholars study Caxtonian spelling to understand how English became more standardized.","zh":"学者研究卡克斯顿式拼写，以了解英语如何逐渐走向规范化。"}]},{"partOfSpeech":"adj.","definition":{"en":"in the style of Caxton’s early printing and typography (typefaces, layout, and book design).","zh":"（排印与版式）卡克斯顿式的；指类似卡克斯顿早期印刷的字体、版面与书籍设计风格。"},"examples":[{"en":"The poster uses a Caxtonian layout with heavy black type and wide margins.","zh":"这张海报采用卡克斯顿式版面：粗重的黑体字与宽阔的页边。"},{"en":"She chose a Caxtonian font for a medieval-themed project.","zh":"她为一个中世纪主题项目选择了卡克斯顿风格的字体。"}]}],"synonyms":["Caxton-related","early-printing","incunabular (related term)"],"phonetic":"/kækˈstɑːniən/","extraExplanation":["“Caxtonian”来自人名 William Caxton。他在1476年于伦敦建立印刷所，把活字印刷带入英国，并印行了许多作品（如《坎特伯雷故事集》的早期版本）。因此该词常出现在文学史、书籍史、语言史与排版设计的语境中。"]}
{"word":"caxtonian","summary":{"en":"Caxtonian means “connected to William Caxton or early English printing,” and it can also mean a collector or scholar of Caxton and early English printed books.","zh":"Caxtonian 指“与威廉·卡克斯顿或早期英国印刷有关”，也可指研究或收藏卡克斯顿及早期英文印本的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to William Caxton (c. 1422–1491), the first English printer, or to the early period/style of English printing and publishing associated with him.","zh":"与威廉·卡克斯顿（约1422–1491，英国第一位印刷商）有关的；或指与其相关的早期英国印刷与出版时期/风格的。"},"examples":[{"en":"The museum displayed a Caxtonian typeface inspired by early English printing.","zh":"博物馆展出了受早期英国印刷启发的卡克斯顿式字体。"},{"en":"She studies Caxtonian editions to understand how English spelling began to standardize.","zh":"她研究卡克斯顿时期的版本，以了解英语拼写如何开始走向规范化。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who admires, collects, or studies Caxton’s works or early English printed books (often used among book collectors).","zh":"（常用于藏书圈）崇拜、收藏或研究卡克斯顿作品/早期英文印本的人。"},"examples":[{"en":"As a dedicated Caxtonian, he spent years tracking down rare fifteenth-century printings.","zh":"作为一名资深的卡克斯顿迷，他花了多年追寻罕见的十五世纪印本。"},{"en":"The Caxtonians in the club exchanged notes on paper, type, and binding.","zh":"俱乐部里的卡克斯顿研究者们交流了关于纸张、字体和装帧的笔记。"}]}],"synonyms":["Caxtonic (rare)","early-printing","incunabular (related, broader)","bibliophilic (related)"],"phonetic":"/kækˈstɑːniən/","extraExplanation":["“Caxtonian”来自人名 William Caxton。卡克斯顿于1476年前后在英格兰建立印刷所，把活字印刷更系统地带入英语世界，对英语书写、出版与文本传播影响很大。","在藏书与书目学语境中，Caxtonian 常带有“早期印刷/初期英文印本”的味道；有时也会指与“卡克斯顿学会（The Caxton Club / Caxton Society）”等相关的书籍文化圈子。"]}
{"word":"Caxtonic","summary":{"en":"A rare adjective meaning “connected with William Caxton or the style/spelling of his early English printed works.”","zh":"一个少见形容词，表示“与威廉·卡克斯顿有关，或与其早期英文印刷品的文体/拼写有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Relating to William Caxton (c. 1422–1491), the first English printer, or to the language, spelling, or style found in Caxton’s early printed English.","zh":"（少见）与威廉·卡克斯顿（约1422–1491，英国第一位印刷商）有关的；或指卡克斯顿早期英文印刷品中的语言、拼写或文体特点。"},"examples":[{"en":"The editor kept the Caxtonic spellings to preserve the feel of the original text.","zh":"编辑保留了卡克斯顿式拼写，以保持原文的时代感。"},{"en":"Scholars study Caxtonic English to understand how printed books helped shape standard spelling.","zh":"学者研究卡克斯顿时期的英语，以理解印刷书籍如何促进标准拼写的形成。"}]}],"synonyms":["Caxtonian","Caxton-like"],"phonetic":"/kækˈstɑnɪk/","extraExplanation":["“Caxtonic”来自人名 Caxton（威廉·卡克斯顿）。卡克斯顿把印刷术带到英格兰（1470年代），他的印刷品在词汇选择与拼写上常呈现出中古英语向早期现代英语过渡的痕迹。","这个词在现代英语里非常少用，更多见于语言学、书籍史或中古英语研究的学术语境；日常表达中通常会说 “Caxton’s (style/spelling/English)”。"]}

