{"word":"Caz","summary":{"en":"“Caz” is commonly a nickname, and it can also be a casual texting spelling of “because” in some varieties of English.","zh":"“Caz”常见用法是人名昵称；在某些英语地区的网聊中也可作为“because”的随意拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a nickname, often used for someone named Caroline, Cassandra, or similar names","zh":"昵称，常用来称呼名叫 Caroline、Cassandra 等（或相近名字）的人"},"examples":[{"en":"Hey, Caz, are you coming to dinner?","zh":"嗨，Caz，你要来吃晚饭吗？"},{"en":"Everyone calls Cassandra “Caz” at work.","zh":"在公司里大家都叫 Cassandra “Caz”。"}]},{"partOfSpeech":"conj.","definition":{"en":"an informal spelling of “because,” used in casual texting (mainly British/Australian English)","zh":"“because”的非正式拼写，用于随意的短信/聊天（主要见于英式/澳式英语）"},"examples":[{"en":"I’m late caz the bus didn’t come.","zh":"我迟到了，caz 公交没来。"},{"en":"Can’t talk now caz I’m in class.","zh":"现在不能聊，caz 我在上课。"}]}],"synonyms":["nickname: Cass (for Cassandra), Caro (for Caroline)","because (informal): 'cause, cuz"],"phonetic":"/kæz/","extraExplanation":["“caz = because”属于非常口语/网聊式的拼写，并不常见于正式写作；在美式英语里更常见的简写是“’cause”或拼作“cuz”（更口语、更随意）。","作为昵称的“Caz”通常写作首字母大写；作为“because”的简写则多为小写“caz”。"]}
{"word":"caza","summary":{"en":"“Caza” is a Spanish word meaning “hunting,” sometimes also referring to hunted game.","zh":"“caza”是西班牙语，意思是“狩猎/打猎”，有时也可指“猎物”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) hunting; the act of hunting animals.","zh":"（西班牙语）狩猎；打猎这一行为。"},"examples":[{"en":"In Spanish, “caza” means “hunting.”","zh":"在西班牙语中，“caza”的意思是“狩猎/打猎”。"},{"en":"The sign said “Temporada de caza,” meaning “hunting season.”","zh":"牌子上写着“Temporada de caza”，意思是“狩猎季节”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common in English contexts) hunted game; animals that are hunted.","zh":"（在英语语境中较少见）猎物；被捕猎的动物。"},"examples":[{"en":"The report mentioned “caza” and “pesca” (hunting and fishing).","zh":"报告中提到“caza”和“pesca”（狩猎和捕鱼）。"}]}],"synonyms":["hunting","the hunt","chase"],"phonetic":"/ˈkɑːzə/","extraExplanation":["“caza”是西班牙语名词，来自动词“cazar”（打猎、追捕）。在英语里它通常不会当作常用词汇出现，多见于西语国家的告示、法律条文、旅游文本或双语材料中。","常见搭配：“temporada de caza”（狩猎季节），“caza mayor / caza menor”（大型猎物狩猎 / 小型猎物狩猎）。"]}
{"word":"Cazadero","summary":{"en":"Cazadero is a place name, best known as a rural community in Northern California.","zh":"Cazadero 是一个地名，最常指美国加州北部的乡村社区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name (proper noun), especially the small rural community called Cazadero in Sonoma County, Northern California, USA.","zh":"地名（专有名词）；尤指美国加州北部索诺玛县的乡村小镇/社区 Cazadero（卡萨德罗）。"},"examples":[{"en":"We spent the weekend hiking near Cazadero in Sonoma County.","zh":"我们周末在索诺玛县的 Cazadero 附近徒步。"},{"en":"The weather in Cazadero can be cooler and foggier than the coast.","zh":"Cazadero 的天气有时比海边更凉、更有雾。"}]}],"phonetic":"/ˌkæzəˈdɛroʊ/","extraExplanation":["“Cazadero”来源于西班牙语，和动词“cazar”（打猎）有关，整体含义可理解为“狩猎的地方/猎场”。在美国西部，很多地名来自西班牙语或早期西班牙/墨西哥时期的命名传统。","作为地名使用时，英语里通常不翻译其字面意思，而是直接把它当作专名来读写。"]}
{"word":"Cazenovia","summary":{"en":"Cazenovia is a place name, most commonly referring to a town/village in central New York and the nearby Cazenovia Lake.","zh":"Cazenovia 是一个地名，最常指纽约州中部的卡泽诺维亚城镇/村庄及其附近的卡泽诺维亚湖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a town and village in Madison County, central New York State, USA (near Syracuse), known for Cazenovia Lake and a historic small-town setting.","zh":"美国纽约州中部麦迪逊县的一个城镇与村庄（靠近锡拉丘兹），以卡泽诺维亚湖和具有历史风貌的小镇环境而闻名。"},"examples":[{"en":"She went to college near Cazenovia, New York.","zh":"她在纽约州卡泽诺维亚附近上大学。"},{"en":"We spent a quiet weekend in Cazenovia by the lake.","zh":"我们在卡泽诺维亚湖边度过了一个安静的周末。"}]},{"partOfSpeech":"n.","definition":{"en":"Cazenovia Lake, a lake beside the village of Cazenovia in New York State.","zh":"卡泽诺维亚湖：位于纽约州卡泽诺维亚村旁的一座湖。"},"examples":[{"en":"The sunset over Cazenovia Lake was beautiful.","zh":"卡泽诺维亚湖上的日落很美。"}]}],"phonetic":"/ˌkæzəˈnoʊviə/","extraExplanation":["“Cazenovia”通常作为专有名词使用，最常指纽约州的城镇/村庄及其旁边的卡泽诺维亚湖。","地名据说来自荷兰裔美国金融家 Theophilus Cazenove（西奥菲勒斯·卡泽诺夫）的姓氏；在美国东北部，一些地名源自早期欧洲移民或土地投资者的名字。"]}
{"word":"cazibi","summary":{"en":"“cazibi” is not standard English; it’s internet slang meaning “attractive/charming,” likely borrowed from Turkish.","zh":"“cazibi”不是标准英语，多为网络俚语，意思接近“有吸引力/迷人”，可能借自土耳其语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard; internet slang, borrowed from Turkish) attractive; charming; having “pull” or appeal.","zh":"（非标准英语；网络俚语，借自土耳其语）有吸引力的；迷人的；很“有魅力/有感觉”的。"},"examples":[{"en":"That outfit is really cazibi.","zh":"那套穿搭真的很“cazibi”（很有吸引力）。"},{"en":"The new café looks cazibi—let’s check it out.","zh":"那家新咖啡馆看起来很“cazibi”（很有吸引力）——去看看吧。"}]}],"synonyms":["attractive","charming","appealing","good-looking","alluring"],"phonetic":"/kɑːˈziːbi/","extraExplanation":["“cazibi”不是标准英语词汇，更常见于部分社交媒体/弹幕语境，通常表示“有吸引力、很迷人”。如果你是在学习英语，正式写作或日常交流更推荐用：attractive, charming, appealing, good-looking, alluring。","它大概率与土耳其语词根“cazibe”（意为“吸引力、魅力”）有关；在土耳其语里更常见的形式包括“cazip”（有吸引力的）或“cazibeli”（迷人的）。不同圈子可能会有不同拼写与用法，遇到时可根据上下文理解为“很有魅力”。"]}
{"word":"cazimi","summary":{"en":"Cazimi is an astrological term for a planet extremely close to the Sun, said to be “in the heart of the Sun.”","zh":"Cazimi是占星术语，指行星与太阳极近，被称为“在太阳之心”的位置。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Astrology) Describing a planet that is extremely close to the Sun—traditionally within about 17 arcminutes—so it is said to be “in the heart of the Sun,” a position considered especially powerful or protected.","zh":"（占星术）指一颗行星与太阳极其接近（传统上约在17角分以内），被称为“在太阳之心”，通常被认为力量更强、较受庇护的状态。"},"examples":[{"en":"In traditional astrology, Mercury cazimi is often interpreted as clarity of mind and sharp communication.","zh":"在传统占星里，水星cazimi常被解读为思维清晰、表达敏锐。"},{"en":"The astrologer noted that the planet was cazimi rather than combust, so the influence was viewed more positively.","zh":"占星师指出这颗行星是cazimi而不是combust（被太阳灼烧），因此影响更偏正面。"}]},{"partOfSpeech":"n.","definition":{"en":"The state or condition of being in this “heart of the Sun” position.","zh":"处于这种“太阳之心”位置的状态（cazimi状态）。"},"examples":[{"en":"Her chart shows Venus in cazimi, which some schools read as strengthened Venus themes.","zh":"她的星盘显示金星处于cazimi状态，一些流派会解读为金星主题被增强。"}]}],"synonyms":["in the heart of the Sun","sun-centered conjunction (astrology)"],"phonetic":"/kəˈziːmi/","extraExplanation":["词源背景：cazimi来自中世纪阿拉伯-拉丁占星传统，常解释为“在太阳的心中”（in the heart of the Sun）。","占星用法提示：cazimi通常与combust（行星离太阳太近而“受灼烧”）对比；许多传统流派认为cazimi并非受损，反而像被太阳“加冕/保护”。不同体系对允许的距离（orbs）可能略有差异。","使用场景：这是非常专业的占星术语，日常英语里很少见；写作时常用结构是“Planet + is/was cazimi (the Sun)”。"]}
{"word":"cazique","summary":{"en":"“Cazique” (more commonly spelled “cacique”) means an Indigenous local chief in Latin America, and by extension a powerful regional political boss.","zh":"“cazique”（更常见写法“cacique”）指拉丁美洲的原住民地方酋长，也可引申为掌控地方势力的政治强人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a local Indigenous chief or leader in parts of Latin America, especially in historical contexts (a spelling variant of “cacique”).","zh":"（拉丁美洲部分地区，尤指历史语境中）印第安部族的酋长、首领；亦为“cacique”的异拼。"},"examples":[{"en":"Spanish chroniclers often used the word “cazique” (more commonly “cacique”) to describe local chiefs they encountered in the Caribbean.","zh":"西班牙编年史作者常用“cazique”（更常见写法为“cacique”）来指他们在加勒比遇到的当地酋长。"},{"en":"The village negotiated with the cazique before trading with outsiders.","zh":"村庄在与外来者交易前，会先与酋长协商。"}]},{"partOfSpeech":"n.","definition":{"en":"a powerful local political boss who controls influence and favors in a region (Latin American political usage).","zh":"（拉丁美洲政治语境）地方强人、土豪式的政治头目；掌控人脉与利益分配的人。"},"examples":[{"en":"In the novel, the governor behaves like a cazique, rewarding loyal supporters with jobs.","zh":"在小说中，那位州长像个地方强人一样，用职位回报忠诚的支持者。"},{"en":"Some reforms aimed to reduce the power of regional caziques.","zh":"一些改革旨在削弱地方政治头目的势力。"}]}],"synonyms":["cacique","chief","chieftain","tribal leader","local boss","political boss"],"phonetic":"/kəˈsiːk/","extraExplanation":["“cazique”多被视为“cacique”的变体拼写。该词经由西班牙语传播，源头常追溯到泰诺语（Taíno）中表示“首领/统治者”的词，欧洲殖民者在记录美洲社会结构时大量使用。","在现代西班牙语与英语的政治语境里，cacique/cazique 也可引申为“地方政治机器的控制者”，带有批评色彩，强调其对选票、职位与资源的垄断。"]}
{"word":"caziques","summary":{"en":"“Caziques” is the plural of “cacique,” meaning Indigenous chiefs, and by extension powerful local political bosses.","zh":"“caziques”是“cacique”的复数，指原住民部落首领，也可引申为地方政治强人/大佬。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"local chiefs or leaders of Indigenous communities (especially in the Caribbean and parts of Latin America); plural of “cacique.”","zh":"（尤指加勒比与部分拉丁美洲的）原住民部落酋长、首领；为 cacique 的复数。"},"examples":[{"en":"The Spanish records describe several caziques who governed nearby villages.","zh":"西班牙人的记录描述了几位统治附近村落的原住民首领。"},{"en":"The caziques negotiated with the colonizers to protect their people.","zh":"这些首领与殖民者谈判，以保护自己的族人。"}]},{"partOfSpeech":"n.","definition":{"en":"powerful local political bosses or strongmen (in Spanish-speaking contexts); plural of “cacique.”","zh":"（西语语境中）地方政治大佬、地头蛇、强人；为 cacique 的复数。"},"examples":[{"en":"In some regions, caziques controlled votes and local government jobs.","zh":"在一些地区，地方政治大佬操控选票和地方政府职位。"},{"en":"The reform aimed to limit the influence of the caziques.","zh":"这场改革旨在限制这些地方强人的影响力。"}]}],"synonyms":["chieftains","tribal leaders","local bosses","political strongmen"],"phonetic":"/kəˈsik/","extraExplanation":["“cacique / caziques”源自泰诺语（Taíno，加勒比原住民语言），经由西班牙语进入英语；最初指原住民的“酋长/首领”。后来在拉美政治语境中引申为“地方势力人物、政治掮客”。","拼写上更常见的是“caciques”（同为复数）；“caziques”属于较少见的变体拼写，阅读历史或人类学材料时更可能遇到。"]}
{"word":"Cazzie","summary":{"en":"Cazzie is a personal name, often used as a nickname; it can also refer to the public figure Cazzie David.","zh":"Cazzie 是人名，常作昵称使用；也可能指公众人物 Cazzie David。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (usually a feminine name); sometimes used as a nickname","zh":"人名（多为女性名）；有时也用作昵称"},"examples":[{"en":"Cazzie is my cousin’s name.","zh":"Cazzie 是我表妹的名字。"},{"en":"People sometimes call Cassandra “Cazzie” as a nickname.","zh":"人们有时会把 Cassandra（卡桑德拉）昵称为 “Cazzie”。"}]},{"partOfSpeech":"n.","definition":{"en":"a public figure’s name, especially referring to Cazzie David (an American writer/actor) in media contexts","zh":"公众人物的名字；在媒体语境中常指美国作家/演员 Cazzie David"},"examples":[{"en":"I read an essay by Cazzie David online.","zh":"我在网上读过一篇 Cazzie David 的随笔。"},{"en":"Some interviews mention Cazzie as a writer and performer.","zh":"一些采访会提到 Cazzie 是作家兼表演者。"}]}],"synonyms":["Cassie (similar-sounding nickname)"],"phonetic":"/ˈkæzi/","extraExplanation":["“Cazzie”多见于英语国家作为人名或昵称，拼写比较个性化；在口语里常被听作 /ˈkæzi/，类似 “Cassie” 的发音。","如果你在社交媒体或娱乐新闻里看到 “Cazzie”，很可能是在指 Cazzie David。"]}
