{"word":"CB","summary":{"en":"CB is a common abbreviation meaning citizens band (radio), central bank, or (in American football) cornerback—depending on context.","zh":"CB 是常见缩写，常指民用波段无线电、中央银行，或（在美式橄榄球中）角卫，需结合语境理解。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbrev.) citizens band (radio): a public short-range radio system used for communication, especially by drivers and hobbyists.","zh":"（缩写）民用波段无线电：一种公众可用的短距离无线电通信系统，常见于卡车司机或无线电爱好者。"},"examples":[{"en":"Truck drivers sometimes use CB to warn others about traffic.","zh":"卡车司机有时用 CB 提醒别人前方路况。"},{"en":"He installed a CB radio in his car for road trips.","zh":"他在车里装了 CB 无线电，方便自驾旅行时联络。"}]},{"partOfSpeech":"n.","definition":{"en":"(abbrev.) central bank: a country’s main bank that manages money supply and interest rates.","zh":"（缩写）中央银行：一个国家的主要银行，负责管理货币供应与利率等。"},"examples":[{"en":"The CB raised interest rates to control inflation.","zh":"中央银行（CB）上调利率以控制通货膨胀。"},{"en":"Analysts are watching the CB’s policy announcement.","zh":"分析师正在关注央行（CB）的政策声明。"}]},{"partOfSpeech":"n.","definition":{"en":"(abbrev., esp. in American football) cornerback: a defensive player who covers wide receivers.","zh":"（缩写，尤指美式橄榄球）角卫：负责盯防外接手的防守球员。"},"examples":[{"en":"The CB intercepted the pass in the fourth quarter.","zh":"第四节时角卫（CB）抄截了传球。"},{"en":"He played CB in college before going pro.","zh":"他大学打的位置是角卫（CB），后来进入职业队。"}]}],"synonyms":["citizens band","CB radio","central bank","cornerback"],"phonetic":"ˌsiːˈbiː","extraExplanation":["“CB”是缩写，具体含义高度依赖语境：出现在无线电/驾驶话题里多指 citizens band；在经济金融新闻里常指 central bank；在美式橄榄球报道或比赛数据里常指 cornerback。","读字母缩写时通常逐个读字母：C-B。"]}
{"word":"cb","summary":{"en":"“cb” is a common abbreviation meaning “come back” or “callback”; “CB” can also mean “citizens band” radio.","zh":"“cb”常见为“come back（回来/再回）”或“callback（回电/回覆）”的缩写；“CB”也可指“公众波段”无线电。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(informal text abbreviation) “come back,” used to ask someone to return or reply again.","zh":"（非正式短信缩写）“回来 / 再回（来）”，用于让对方回来或再次回复。"},"examples":[{"en":"CB soon—I want to tell you something.","zh":"早点CB（回来/再回我一下）——我想跟你说件事。"},{"en":"If you get disconnected, just cb.","zh":"如果断线了，就cb（再回来/再联系）。"}]},{"partOfSpeech":"other","definition":{"en":"(informal abbreviation) “callback,” meaning a return call or message.","zh":"（非正式缩写）“callback（回电/回拨/回覆）”。"},"examples":[{"en":"Can you cb when you have a minute?","zh":"你有空的时候能cb（回电/回我）一下吗？"},{"en":"I left a message and I’m waiting for a cb.","zh":"我留了言，正在等对方cb（回覆/回电）。"}]},{"partOfSpeech":"n.","definition":{"en":"(often written as CB) “citizens band,” a short-range radio system used by the public (especially by truck drivers).","zh":"（常写作CB）“公众波段/民用波段（citizens band）”，一种短距离无线电通讯系统（卡车司机等常用）。"},"examples":[{"en":"Truckers sometimes chat on the CB radio.","zh":"卡车司机有时会用CB无线电聊天。"},{"en":"He installed a CB in his car for road trips.","zh":"他在车上装了CB，方便自驾出行时通讯。"}]}],"synonyms":["come back","callback","return call","CB radio"],"phonetic":"/ˌsiːˈbiː/","extraExplanation":["“cb”在不同圈子里意思差异很大：聊天/短信里常见的是“come back”或“callback”，而大写“CB”更像一个固定缩写（如CB radio）。如果你告诉我上下文（聊天、编程、电子、电力等），我可以帮你锁定最准确的含义。"]}
{"word":"CBA","summary":{"en":"CBA most commonly means (1) “can’t be arsed/asked” (slang: can’t be bothered), but it can also mean (2) Chinese Basketball Association or (3) cost-benefit analysis.","zh":"CBA最常见含义是（1）俚语“懒得/不想”（= can’t be bothered），也可能指（2）中国男子篮球职业联赛或（3）成本效益分析。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(informal, chiefly UK/Aus internet slang) “Can’t be arsed/asked”: used to say you don’t have the energy or interest to do something.","zh":"（非正式，主要英/澳网络俚语）“懒得/不想/没心情”：表示你没有精力或兴趣去做某事。"},"examples":[{"en":"I was going to cook, but I’m CBA—let’s order food.","zh":"我本来想做饭，但我懒得弄——我们点外卖吧。"},{"en":"CBA arguing with him. It won’t change anything.","zh":"我懒得跟他吵。吵也改变不了什么。"}]},{"partOfSpeech":"n.","definition":{"en":"Chinese Basketball Association: the top professional men’s basketball league in China.","zh":"中国男子篮球职业联赛（CBA）：中国最高水平的男子职业篮球联赛。"},"examples":[{"en":"He plays for a CBA team in China.","zh":"他在中国的CBA球队打球。"},{"en":"Many foreign players have competed in the CBA.","zh":"很多外援都参加过CBA联赛。"}]},{"partOfSpeech":"n.","definition":{"en":"Cost-benefit analysis: a method of comparing the costs and benefits of a decision to see if it is worthwhile.","zh":"成本效益分析：比较一项决策的成本与收益，以判断是否值得。"},"examples":[{"en":"Before building the new road, the city did a CBA.","zh":"在修新路之前，市政府做了成本效益分析。"},{"en":"Our CBA shows the project will pay for itself in two years.","zh":"我们的成本效益分析显示，这个项目两年就能回本。"}]}],"synonyms":["can’t be bothered","CBF","cost-benefit analysis"],"phonetic":"ˌsiː biː ˈeɪ","extraExplanation":["“CBA = can’t be arsed/asked”带有明显口语和俚语色彩；其中“arsed”在部分语境里会被认为粗俗，因此更正式的表达可以用：I can’t be bothered / I don’t feel like it / I don’t have the energy.","缩写在不同国家和语境中含义差异很大：聊天里看到CBA常是“懒得”，体育新闻多指中国篮球联赛，商业/政策文本里更可能是“成本效益分析”。"]}
{"word":"cba","summary":{"en":"CBA most commonly means either internet slang “can’t be bothered” or a formal abbreviation such as cost-benefit analysis, collective bargaining agreement, or Chinese Basketball Association.","zh":"CBA常见用法要么是网络俚语“懒得/不想做（can’t be bothered）”，要么是正式缩写（如成本—效益分析、集体谈判协议、中国男子篮球职业联赛）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(informal, online slang) Short for “can’t be bothered,” meaning you don’t feel like doing something because you’re too tired, not interested, or it seems not worth the effort.","zh":"（非正式/网络俚语）“can’t be bothered”的缩写，表示不想做某事（懒得、没兴趣、觉得不值得花力气）。"},"examples":[{"en":"I was going to cook, but I cba—let’s just order takeout.","zh":"我本来想做饭，但我懒得弄——我们点外卖吧。"},{"en":"He didn’t reply; he probably cba with the drama.","zh":"他没回消息；他可能懒得理这些闹剧。"}]},{"partOfSpeech":"n.","definition":{"en":"Abbreviation for “cost-benefit analysis,” a method of comparing the costs and benefits of a decision or project.","zh":"“cost-benefit analysis（成本—效益分析）”的缩写，用来比较某个决策/项目的成本与收益。"},"examples":[{"en":"Before we build the new system, we need a CBA.","zh":"在我们建设新系统之前，需要做一份成本—效益分析（CBA）。"},{"en":"The CBA showed the project would save money over five years.","zh":"成本—效益分析显示，这个项目在五年内会省钱。"}]},{"partOfSpeech":"n.","definition":{"en":"Abbreviation for “collective bargaining agreement,” a contract between an employer and a labor union.","zh":"“collective bargaining agreement（集体谈判协议/集体合同）”的缩写，指雇主与工会之间的合同。"},"examples":[{"en":"The new CBA includes higher pay and better health benefits.","zh":"新的集体谈判协议（CBA）包含更高工资和更好的医疗福利。"},{"en":"They reopened talks after the CBA expired.","zh":"CBA到期后，他们重新开启谈判。"}]},{"partOfSpeech":"n.","definition":{"en":"Abbreviation for “Chinese Basketball Association,” a professional basketball league in China.","zh":"“Chinese Basketball Association（中国男子篮球职业联赛）”的缩写。"},"examples":[{"en":"He played in the CBA before moving to the NBA.","zh":"他去NBA之前在CBA打过球。"},{"en":"CBA games are popular with many basketball fans in China.","zh":"CBA比赛在中国的很多篮球迷中很受欢迎。"}]}],"synonyms":["(slang) cbf","(slang) can’t be bothered","cost-benefit analysis","collective bargaining agreement"],"phonetic":"/ˌsiːbiːˈeɪ/","extraExplanation":["“cba”作网络俚语时语气偏随意，常见于短信、聊天、社媒评论；在正式写作或对不熟的人沟通时不建议使用。","需要注意大小写：小写“cba”更常被理解为俚语“can’t be bothered”；大写“CBA”更常指正式缩写（如成本—效益分析、集体谈判协议、联赛名称）。","英式俚语里还可能看到“CBA”被用来表示更粗鲁的“can’t be arsed”，语气更冲、更不礼貌。"]}
{"word":"CBC","summary":{"en":"CBC is an abbreviation that most commonly means a medical blood test (complete blood count), Canada’s public broadcaster, or an encryption mode (cipher block chaining).","zh":"CBC是一个缩写，最常见的含义包括：血常规（全血细胞计数）、加拿大广播公司，以及一种加密模式（密文分组链接）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Complete blood count: a common blood test that measures different parts of your blood (such as red blood cells, white blood cells, and platelets).","zh":"全血细胞计数（血常规）：一种常见的血液检查，用于测量血液中的不同成分（如红细胞、白细胞和血小板）。"},"examples":[{"en":"The doctor ordered a CBC to check for infection and anemia.","zh":"医生开了血常规（CBC）来检查是否有感染和贫血。"},{"en":"My CBC results came back normal.","zh":"我的血常规（CBC）结果显示正常。"}]},{"partOfSpeech":"other","definition":{"en":"Canadian Broadcasting Corporation: Canada’s national public radio and television broadcaster.","zh":"加拿大广播公司：加拿大的国家公共广播电视机构。"},"examples":[{"en":"I heard the interview on CBC Radio this morning.","zh":"我今天早上在加拿大广播电台（CBC Radio）听到了那段采访。"},{"en":"CBC News reported the story last night.","zh":"CBC新闻昨晚报道了这条消息。"}]},{"partOfSpeech":"other","definition":{"en":"Cipher Block Chaining: a mode used in encryption that links each block of data to the previous one (often seen in tech/security contexts).","zh":"密文分组链接（CBC）：一种加密模式，把每个数据块与前一个块“链接”起来（常见于技术/安全语境）。"},"examples":[{"en":"This system uses AES in CBC mode for encryption.","zh":"这个系统使用AES的CBC模式进行加密。"},{"en":"CBC mode needs an IV (initialization vector).","zh":"CBC模式需要一个IV（初始化向量）。"}]}],"synonyms":["complete blood count","Canadian Broadcasting Corporation","cipher block chaining"],"phonetic":"/si bi ˈsi/","extraExplanation":["“CBC”是缩写，具体含义强烈依赖语境：在医院/化验单里通常是“血常规”；在加拿大媒体语境（新闻、广播、电视）里多指“加拿大广播公司”；在计算机安全/密码学语境里常指加密的“CBC模式”。判断时可看同一句里的关键词（如 blood/test、Radio/News、AES/encryption/IV）。"]}
{"word":"CBD","summary":{"en":"CBD most commonly means either cannabidiol (a non-intoxicating cannabis compound) or central business district (a city’s main business area), depending on context.","zh":"CBD 常见有两种含义：cannabidiol（大麻二酚，不致嗨）或 central business district（中央商务区），需结合语境判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abbreviation for cannabidiol, a chemical from the cannabis (hemp/marijuana) plant that does not cause a “high” like THC; often sold in oils, gummies, creams, etc.","zh":"“cannabidiol（大麻二酚）”的缩写：来源于大麻（工业大麻/大麻）植物的一种成分，不像 THC 那样会让人“嗨”；常见于精油、软糖、外用膏等产品中。"},"examples":[{"en":"Some people use CBD oil to help them relax before bed.","zh":"有些人睡前会用 CBD 油来帮助放松。"},{"en":"This lotion contains CBD and is marketed for sore muscles.","zh":"这款乳液含 CBD，主打缓解肌肉酸痛。"},{"en":"Always check the label for how much CBD is in each serving.","zh":"一定要看标签，确认每份含多少 CBD。"}]},{"partOfSpeech":"n.","definition":{"en":"an abbreviation for central business district: the main commercial and office area of a city (often “downtown”).","zh":"“central business district（中央商务区）”的缩写：城市里商业和办公最集中的区域（常接近/等同于 downtown）。"},"examples":[{"en":"I work in the CBD, so I take the train to avoid traffic.","zh":"我在 CBD 上班，所以坐火车避开堵车。"},{"en":"Hotels near the CBD are usually more expensive.","zh":"CBD 附近的酒店通常更贵。"}]}],"synonyms":["cannabidiol","central business district","downtown"],"phonetic":"ˌsiːbiːˈdiː","extraExplanation":["在不同国家/地区，CBD 更常指“大麻二酚”还是“中央商务区”，取决于语境：谈健康产品、精油、软糖、护肤品时多为前者；谈城市规划、通勤、房价、写字楼时多为后者。","关于“大麻二酚（CBD）”：其合规性因国家/州而异，有的地方允许“工业大麻来源且 THC 含量很低”的产品，有的地方限制更严格；购买或携带前最好查询当地法规。","在口语中，CBD（中央商务区）有时可近似理解为 downtown，但并非所有城市的 CBD 都等同于“市中心最热闹的区域”，它更强调商业/办公功能。"]}
{"word":"CBDS","summary":{"en":"“CBDS” most commonly means the plural of “CBD”: either cannabidiol products/compounds or central business districts, depending on context.","zh":"“CBDS”通常是“CBD”的复数：在保健品语境指大麻二酚相关产品/成分；在城市/房地产语境指多个中央商务区，需看上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Plural form of CBD (“cannabidiol”), a chemical from the cannabis plant often used in oils, gummies, creams, etc.","zh":"CBD（大麻二酚）的复数形式；指多种CBD产品或不同来源/类型的CBD成分（如油、软糖、乳膏等）。"},"examples":[{"en":"Some stores sell different CBDs, including oils and topical creams.","zh":"有些商店卖不同的CBD产品，包括CBD油和外用乳膏。"},{"en":"Researchers are still studying how various CBDs may affect pain or anxiety.","zh":"研究人员仍在研究不同的CBD成分可能如何影响疼痛或焦虑。"}]},{"partOfSpeech":"other","definition":{"en":"Plural form of CBD (“central business district”), meaning the main downtown business areas of cities.","zh":"CBD（中央商务区）的复数形式；指多个城市的主要商业中心/市中心商务区。"},"examples":[{"en":"Many CBDs became quieter after more people started working from home.","zh":"更多人开始居家办公后，许多城市的CBD变得更冷清。"},{"en":"Public transit usually connects suburbs to CBDs.","zh":"公共交通通常把郊区和CBD（中央商务区）连接起来。"}]}],"synonyms":["CBDs","cannabidiol products (context)","central business districts (context)"],"phonetic":"/ˌsiː biː ˈdiːz/","extraExplanation":["“CBD(s)”在不同语境里含义差别很大：\n- 在健康/保健品语境，多指“cannabidiol（大麻二酚）”，不是让人“嗨”的THC，但各地法规不同、质量也参差不齐。\n- 在城市规划/房地产语境，多指“central business district（中央商务区）”。\n写作时最好在首次出现时把全称写出来（cannabidiol / central business district），避免误解。"]}
{"word":"CBE","summary":{"en":"CBE is most commonly an abbreviation for a British honor (Commander of the Order of the British Empire) or for competency-based education, depending on context.","zh":"CBE最常见是两个缩写：英国荣誉勋衔“大英帝国勋章（司令级）”，或教育领域的“能力本位教育”，具体含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Commander of the Order of the British Empire (a British honor awarded by the monarch).","zh":"大英帝国勋章（司令级）（由英国君主授予的一种荣誉称号）。"},"examples":[{"en":"She was appointed a CBE for her services to education.","zh":"她因对教育事业的贡献被授予CBE勋衔。"},{"en":"His biography notes that he is a CBE.","zh":"他的传记中提到他拥有CBE勋衔。"}]},{"partOfSpeech":"other","definition":{"en":"competency-based education (an approach where students progress by demonstrating skills/competencies).","zh":"能力本位教育（以达成与展示能力/胜任力为核心的学习模式）。"},"examples":[{"en":"The college launched a CBE program in nursing.","zh":"这所学院启动了护理专业的CBE项目。"},{"en":"In CBE, learners move forward after they prove mastery.","zh":"在CBE中，学习者在证明掌握之后再继续下一阶段。"}]},{"partOfSpeech":"other","definition":{"en":"a shortened label for an organization or exam name in some contexts (for example, a school may use CBE as its board name).","zh":"在某些语境中用作机构或考试名称的缩写（例如某些地区学校用CBE指代教育局/考试委员会名称）。"},"examples":[{"en":"Check the CBE website for the updated schedule.","zh":"去CBE官网查看更新后的日程安排。"},{"en":"Our district follows CBE guidelines.","zh":"我们学区遵循CBE的相关指南。"}]}],"synonyms":["Commander of the Order of the British Empire","competency-based education","honor (UK)","skills-based learning"],"phonetic":"ˌsiː biː ˈiː","extraExplanation":["“CBE”最常见的两种含义是：英国荣誉体系里的勋衔（Commander of the Order of the British Empire）以及教育领域的“能力本位教育”（competency-based education）。写作或对话中最好在第一次出现时把全称写出来，以免误解。","英国勋衔体系中常见缩写还有 MBE、OBE、CBE，级别不同；它们通常写在姓名后面（如“Jane Smith, CBE”）。"]}
{"word":"CBEL","summary":{"en":"CBEL is an initialism; its meaning depends on the context and should be spelled out when first used.","zh":"CBEL 是一个首字母缩写；具体含义取决于语境，首次出现时应写出全称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An initialism/abbreviation made from the letters C-B-E-L; its exact meaning depends on the context (organization, program, course, etc.) and should be defined where it first appears.","zh":"由字母 C-B-E-L 组成的缩写/首字母缩略词；具体含义取决于使用场景（机构、项目、课程等），通常需要在文中首次出现时加以说明。"},"examples":[{"en":"Please define CBEL the first time you use it in the report.","zh":"请在报告中第一次使用 CBEL 时先写出全称并解释。"},{"en":"Our school launched CBEL (full name) as a new learning program.","zh":"我们学校启动了 CBEL（写出全称）作为一项新的学习项目。"}]}],"synonyms":["initialism","abbreviation","acronym"],"phonetic":"ˌsiː biː iː ˈɛl","extraExplanation":["“CBEL”不是一个在通用英语里固定、广泛认知的单词，更像是某个领域内部使用的缩写。阅读或写作时，建议：\n1) 第一次出现时写“全称（CBEL）”；\n2) 在不同机构/文件中含义可能不同，不要默认读者知道；\n3) 口语里通常逐个字母读（C-B-E-L），而不是当作一个词来读。"]}
{"word":"CBEMA","summary":{"en":"CBEMA is an acronym for a former U.S. trade association representing computer and business-equipment manufacturers.","zh":"CBEMA 是一个缩写，指美国曾经代表计算机与商业/办公设备制造商的行业协会。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for the Computer and Business Equipment Manufacturers Association, a former U.S. industry trade group for computer and office-equipment makers","zh":"“Computer and Business Equipment Manufacturers Association”的缩写，指美国曾经的一个行业协会（计算机与办公/商业设备制造商协会）"},"examples":[{"en":"In the 1980s, CBEMA published guidelines and policy positions for the U.S. computer industry.","zh":"在20世纪80年代，CBEMA 会为美国计算机行业发布指南和政策立场。"},{"en":"The company joined CBEMA to collaborate with other manufacturers on standards and regulations.","zh":"这家公司加入 CBEMA，与其他制造商在标准与监管问题上合作。"}]}],"synonyms":["Computer and Business Equipment Manufacturers Association"],"phonetic":"/ˌsiː biː iː ɛm eɪ/","extraExplanation":["CBEMA 通常读作字母缩读（逐个字母读），用于商业、政策与行业资料中。","该组织后来与相关行业团体整合演变；在较新的资料里，你可能更常见到 ITAA（Information Technology Association of America）或 ITI（Information Technology Industry Council）等后续/相关组织名称。"]}
{"word":"CBI","summary":{"en":"CBI is an abbreviation that most commonly means India’s Central Bureau of Investigation or the UK’s Confederation of British Industry, depending on context.","zh":"CBI是缩写，最常见的意思是印度“中央调查局”或英国“工业联合会”，需根据语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Central Bureau of Investigation: India’s federal investigative agency (often compared to the FBI in the U.S.).","zh":"（印度）中央调查局：印度的联邦侦查机构（常被拿来类比美国的FBI）。"},"examples":[{"en":"The CBI is investigating the corruption case.","zh":"CBI正在调查这起腐败案件。"},{"en":"The case was transferred to the CBI for a deeper probe.","zh":"案件被移交给CBI进行更深入的调查。"}]},{"partOfSpeech":"other","definition":{"en":"Confederation of British Industry: a major UK business organization that represents many companies and speaks for employers on economic policy.","zh":"（英国）工业联合会：代表许多英国企业的主要商业组织，常就经济政策发表雇主立场。"},"examples":[{"en":"The CBI called for lower energy costs for businesses.","zh":"CBI呼吁降低企业能源成本。"},{"en":"According to a CBI survey, business confidence is rising.","zh":"根据CBI的一项调查，企业信心正在上升。"}]}],"synonyms":["(India) federal investigative agency","(UK) business lobby group"],"phonetic":"/ˌsiː.biːˈaɪ/","extraExplanation":["“CBI”是缩写（initialism），通常按字母读“C-B-I”。在不同国家/语境中含义不同：印度新闻里多指“中央调查局”，英国财经新闻里多指“工业联合会”。阅读时可以通过上下文（如是否提到案件调查、逮捕 vs. 经济政策、企业调查）来判断。"]}
{"word":"CBR","summary":{"en":"CBR is an abbreviation; common meanings include California Bearing Ratio (soil strength), Chemical/Biological/Radiological (hazards), and Case-Based Reasoning (AI).","zh":"CBR是缩写；常见含义包括加州承载比（土壤强度）、化学/生物/放射性（危险类别）以及基于案例推理（AI方法）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) California Bearing Ratio: a number used in civil engineering to show how strong soil is for road or pavement construction.","zh":"（缩写）加州承载比：土木工程中衡量土壤承载强度的指标，常用于道路/路面设计。"},"examples":[{"en":"The lab reported a CBR value of 8, so the subgrade needs improvement.","zh":"实验室报告的CBR值为8，所以路基需要改良。"},{"en":"Engineers use CBR tests to choose the right pavement thickness.","zh":"工程师用CBR试验来确定合适的路面厚度。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) Chemical, Biological, and Radiological: a category used in emergency response or military contexts for certain hazardous threats (often seen as CBR or CBRN).","zh":"（缩写）化学、生物与放射性（威胁/事件）：应急与军事语境中对危险威胁的分类（也常见CBR或CBRN）。"},"examples":[{"en":"The team completed CBR training for hazardous-material incidents.","zh":"该团队完成了针对危险品事件的CBR培训。"},{"en":"CBR equipment must be checked regularly.","zh":"CBR装备必须定期检查。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) Case-Based Reasoning: an AI method that solves new problems by using similar past cases.","zh":"（缩写）基于案例推理：一种人工智能方法，通过参考相似的历史案例来解决新问题。"},"examples":[{"en":"The chatbot uses CBR to answer questions from past support tickets.","zh":"这个聊天机器人用CBR从以往的客服工单中学习来回答问题。"},{"en":"CBR works well when you have many well-labeled examples.","zh":"当你有大量标注良好的案例时，CBR效果很好。"}]}],"synonyms":["California Bearing Ratio","CBRN","Case-Based Reasoning"],"phonetic":"/ˌsiː biː ˈɑːr/","extraExplanation":["“CBR”是首字母缩写，在不同领域含义差别很大。阅读时要看上下文：如果出现在道路、土壤、路基、试验报告里，多半是California Bearing Ratio；如果和防护装备、演练、应急处置一起出现，可能是Chemical/Biological/Radiological；如果在AI、专家系统、推理方法里，则常指Case-Based Reasoning。","读音通常按字母读（而不是读成一个单词）。写作时第一次出现常会先写全称，再在括号里写CBR。"]}
{"word":"CBS","summary":{"en":"CBS is an abbreviation for Columbia Broadcasting System, a major U.S. TV and radio network.","zh":"CBS 是 Columbia Broadcasting System 的缩写，指美国主要的电视与广播网络之一。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(U.S.) A major American television and radio network; short for Columbia Broadcasting System.","zh":"（美国）美国主要的电视与广播媒体网络之一；全称为 Columbia Broadcasting System（哥伦比亚广播公司）。"},"examples":[{"en":"The game will be broadcast live on CBS tonight.","zh":"这场比赛今晚会在 CBS 进行现场直播。"},{"en":"She works as a producer for CBS News.","zh":"她在 CBS 新闻部担任制片人。"}]},{"partOfSpeech":"other","definition":{"en":"Used before a program name to show it belongs to CBS (often in titles like “CBS News”).","zh":"用于节目名称前，表示该节目隶属于 CBS（常见于标题，如“CBS News”）。"},"examples":[{"en":"I usually watch CBS News in the morning.","zh":"我通常早上看 CBS 新闻。"},{"en":"The interview aired on CBS Sunday Morning.","zh":"这段采访在《CBS Sunday Morning》播出。"}]}],"synonyms":["a TV network","a broadcast network"],"phonetic":"/ˌsiː biː ˈɛs/","extraExplanation":["CBS 最早可追溯到 1920 年代的美国广播事业，后来发展为电视网络。它与 NBC、ABC 并称为美国传统“三大电视网”。","在美国文化里，人们常把 CBS 和其新闻部门（CBS News）联系在一起；有时也会用 “on CBS” 来表达“在 CBS 频道播出”。"]}
{"word":"CBW","summary":{"en":"CBW most commonly means “chemical and biological weapons.” In informal online use, it can also mean “could be worse.”","zh":"CBW 最常见指“化学与生物武器”。在非正式网络语境中也可能表示“could be worse（还不算最糟）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abbreviation for chemical and biological weapons","zh":"“化学与生物武器”的缩写"},"examples":[{"en":"The report discusses the risk of CBW attacks.","zh":"这份报告讨论了化学与生物武器（CBW）袭击的风险。"},{"en":"Many countries have signed treaties to prevent the spread of CBW.","zh":"许多国家签署了条约，以防止化学与生物武器（CBW）的扩散。"}]},{"partOfSpeech":"other","definition":{"en":"(informal, online) an abbreviation for “could be worse” (used to show mild acceptance when something isn’t great)","zh":"（非正式/网络用语）“could be worse（还不算最糟）”的缩写，用来表示勉强接受或自我安慰"},"examples":[{"en":"My day was pretty rough—CBW, I guess.","zh":"我今天挺不顺的——不过想想也还不算最糟（CBW）。"},{"en":"The food wasn’t amazing, but CBW.","zh":"食物不算惊艳，但也还过得去（CBW）。"}]}],"synonyms":["chemical and biological weapons","chemical weapons","biological weapons","WMD"],"phonetic":"/ˌsiː biː ˈdʌbəl.juː/","extraExplanation":["“CBW”最常见于安全、军事、新闻与政策语境，指“chemical and biological weapons（化学与生物武器）”。有时也会扩展写作“CBRN”（chemical, biological, radiological, nuclear）。","作为“could be worse”的缩写更偏聊天/论坛语境；因为不同圈子含义差异很大，正式写作里建议直接写全称以避免误解。"]}
{"word":"CBX","summary":{"en":"CBX is most commonly the abbreviation for Cross Border Xpress, the San Diego–Tijuana airport border-crossing facility; in other contexts it can be a name/code whose meaning depends on usage.","zh":"CBX最常见是Cross Border Xpress的缩写（圣迭戈—蒂华纳机场跨境通道）；在其他语境也可能是名称/代码，含义取决于上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Abbreviation) Cross Border Xpress: a pedestrian bridge and terminal that connects San Diego, California, with Tijuana International Airport (TIJ) in Mexico, used by ticketed airline passengers to cross the U.S.–Mexico border more conveniently.","zh":"（缩写）Cross Border Xpress（CBX）：连接美国加州圣迭戈与墨西哥蒂华纳国际机场（TIJ）的步行跨境通道与航站设施，供持机票旅客更便捷地往返美墨边境。"},"examples":[{"en":"We’re flying out of TIJ, so we’ll use CBX to cross from San Diego.","zh":"我们要从TIJ起飞，所以会用CBX从圣迭戈过境。"},{"en":"CBX can save time compared with driving to other border crossings.","zh":"和开车去其他口岸相比，CBX有时能节省时间。"}]},{"partOfSpeech":"other","definition":{"en":"(Abbreviation, less common) A company name, product name, or code (for example, a stock ticker or an internal project code), with the exact meaning depending on context.","zh":"（缩写，较不常见）公司名、产品名或代码（如股票代码、内部项目代号等）；具体含义取决于使用场景。"},"examples":[{"en":"In the report, CBX refers to a specific project code.","zh":"在这份报告里，CBX指的是某个项目代号。"},{"en":"Can you tell me what CBX stands for in this email?","zh":"你能告诉我这封邮件里的CBX代表什么吗？"}]}],"synonyms":["Cross Border Xpress"],"phonetic":"/ˌsiː.biːˈɛks/","extraExplanation":["在美国日常语境里，CBX最常见的指代就是圣迭戈—蒂华纳机场的跨境通道（Cross Border Xpress）。如果你是在金融、科技或公司内部文件里看到“CBX”，也可能是股票代码、产品型号或系统缩写，需要结合行业与上下文确认。"]}
