{"word":"CC","summary":{"en":"CC most commonly means “carbon copy” in email (the CC field), and it can also mean “to cc someone.” It can also mean “cubic centimeter” (a volume unit) or “credit card,” depending on context.","zh":"CC最常见指邮件中的“抄送（carbon copy）”，也可作动词表示“抄送某人”。在不同语境下还可指“立方厘米（体积单位）”或“信用卡”等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(email) “carbon copy”: a field in an email where you add people who should receive the message for information (not the main person you are writing to).","zh":"（电子邮件）抄送：在邮件中添加需要知情的收件人（不是主要收件人）。"},"examples":[{"en":"I’ll put you in CC so you can follow the updates.","zh":"我会把你抄送（CC）进去，这样你就能跟进最新进展。"},{"en":"Please CC your manager on the reply.","zh":"回复时请抄送你的经理。"}]},{"partOfSpeech":"vt.","definition":{"en":"to add someone to the CC field in an email; to copy someone on a message.","zh":"（邮件）抄送某人；把某人加入CC栏，让对方收到同一封邮件。"},"examples":[{"en":"Can you cc me on that email?","zh":"那封邮件你能抄送我吗？"},{"en":"She cc’d the whole team to keep everyone informed.","zh":"她抄送了整个团队，让大家都了解情况。"}]},{"partOfSpeech":"n.","definition":{"en":"cubic centimeter: a unit of volume, often used for engine size or medicine amounts (same volume as 1 milliliter).","zh":"立方厘米：体积单位，常用于发动机排量或药量（体积等于1毫升）。"},"examples":[{"en":"This motorcycle has a 150 cc engine.","zh":"这辆摩托车的发动机排量是150cc。"},{"en":"Inject 5 cc of saline.","zh":"注射5cc的生理盐水。"}]},{"partOfSpeech":"n.","definition":{"en":"(common abbreviation) credit card.","zh":"（常见缩写）信用卡。"},"examples":[{"en":"Do you accept CC or cash?","zh":"你们收信用卡（CC）还是现金？"}]}],"synonyms":["copy (on an email)","include","send a copy to"],"phonetic":"/ˌsiː ˈsiː/","extraExplanation":["“CC”最常见于英文邮件：To（主要收件人）负责行动/回复；CC（抄送）主要是让对方知情。若对方不需要参与决策或回复，一般放在CC更合适。","注意大小写：在邮件里常写作“CC”；作为动词时常写“cc (someone)”。不同领域里CC还可能表示“closed captions（字幕）”“Creative Commons（知识共享协议）”等，需要看语境。"]}
{"word":"CCA","summary":{"en":"CCA is a common abbreviation with different meanings; most often it means co-curricular activities in schools, but it can also mean canonical correlation analysis (statistics) or calcium channel antagonist/blocker (medicine).","zh":"CCA 是一个常见缩写，含义随语境变化；最常见指学校的课外/共同课程活动，也可指统计学的典型相关分析或医学中的钙通道拮抗剂/阻滞剂。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) co-curricular activities: organized school activities outside regular classes (clubs, sports, music, volunteering).","zh":"（缩写）课外／共同课程活动：指课堂之外由学校组织的活动（社团、运动、音乐、志愿服务等）。"},"examples":[{"en":"She joined two CCAs this semester: basketball and debate.","zh":"这学期她参加了两个 CCA：篮球和辩论。"},{"en":"CCA points can affect scholarships in some school systems.","zh":"在一些教育体系里，CCA 积分可能会影响奖学金。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., statistics) canonical correlation analysis: a method to study relationships between two sets of variables.","zh":"（缩写，统计）典型相关分析：用于研究两组变量之间关系的方法。"},"examples":[{"en":"The researchers used CCA to link lifestyle variables with health outcomes.","zh":"研究人员用 CCA 来把生活方式变量与健康结果联系起来。"},{"en":"CCA is useful when you have multiple measurements on both sides.","zh":"当两边都有多项测量指标时，CCA 很有用。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., medicine) calcium channel antagonist (or blocker): a drug that relaxes blood vessels and helps treat high blood pressure and some heart conditions.","zh":"（缩写，医学）钙通道拮抗剂（钙通道阻滞剂）：一种让血管放松、用于治疗高血压及部分心脏疾病的药物。"},"examples":[{"en":"The doctor prescribed a CCA to help control his blood pressure.","zh":"医生开了一种 CCA 来帮助控制他的血压。"},{"en":"Some people may get swollen ankles when taking a CCA.","zh":"有些人服用 CCA 后可能会出现脚踝肿胀。"}]}],"synonyms":["co-curricular activities (school use)","canonical correlation analysis (statistics)","calcium channel blocker (medicine)"],"phonetic":"/ˌsiː siː ˈeɪ/","extraExplanation":["“CCA”是高度依赖语境的缩写：在新加坡、香港等地的学校语境里最常见的是“co-curricular activities（共同课程/课外活动）”；在学术论文里常见统计学的“canonical correlation analysis”；在医疗语境里常指“calcium channel antagonist/blocker”。如果你告诉我你看到它的句子/领域，我可以帮你确定最准确的含义。"]}
{"word":"CCAFS","summary":{"en":"CCAFS is an abbreviation most commonly meaning Cape Canaveral Air Force Station (now Cape Canaveral Space Force Station), and it can also mean the CGIAR program on Climate Change, Agriculture and Food Security.","zh":"CCAFS 是一个缩写，最常见指“卡纳维拉尔角空军基地”（现为卡纳维拉尔角太空军基地），也可指 CGIAR 的“气候变化、农业与粮食安全”研究项目。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) Cape Canaveral Air Force Station—an American military spaceport in Florida that supported many rocket launches; it is now officially called Cape Canaveral Space Force Station (CCSFS).","zh":"（缩写）卡纳维拉尔角空军基地——美国佛罗里达州的军事航天发射场，曾支持许多火箭发射；现官方名称为“卡纳维拉尔角太空军基地”（CCSFS）。"},"examples":[{"en":"The satellite was launched from CCAFS in Florida.","zh":"这颗卫星是在佛罗里达州的 CCAFS 发射的。"},{"en":"News reports still sometimes use “CCAFS,” even though the base is now called CCSFS.","zh":"新闻报道有时仍会使用“CCAFS”，尽管该基地现在叫 CCSFS。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) CGIAR Research Program on Climate Change, Agriculture and Food Security—a research initiative focused on how climate change affects farming and food systems.","zh":"（缩写）CGIAR“气候变化、农业与粮食安全”研究项目——关注气候变化如何影响农业与粮食系统的研究计划。"},"examples":[{"en":"CCAFS published a report on climate-smart agriculture.","zh":"CCAFS 发布了一份关于气候智慧型农业的报告。"},{"en":"Her team worked with CCAFS to improve crop resilience.","zh":"她的团队与 CCAFS 合作，提高作物抗逆性。"}]}],"synonyms":["CCSFS (new official name for the base)"],"phonetic":"/ˌsiː ˌsiː ˌeɪ ˌɛf ˌɛs/","extraExplanation":["“CCAFS”是缩写，具体指什么要看语境：航天新闻/火箭发射多半指佛州的发射基地；农业、气候与发展领域的文章则更可能指 CGIAR 的研究项目。","美国军事单位名称曾有变更：Cape Canaveral Air Force Station（CCAFS）在 2020 年后逐步改称 Cape Canaveral Space Force Station（CCSFS），但旧缩写在口语与媒体中仍常见。"]}
{"word":"CCC","summary":{"en":"“CCC” is an abbreviation with multiple meanings; common ones include the Civilian Conservation Corps (U.S. history) and the credit rating “CCC” (high risk).","zh":"“CCC”是一个多义缩写；常见含义包括美国历史上的民间保护队（Civilian Conservation Corps）以及信用评级中的“CCC”（高风险）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation meaning different things in different contexts (you must use surrounding context to know which). Common uses include the U.S. New Deal program “Civilian Conservation Corps,” the credit rating “CCC,” and names of organizations such as “Chaos Computer Club.”","zh":"缩写，具体含义取决于语境。常见用法包括美国新政时期的“民间保护队（Civilian Conservation Corps）”、信用评级中的“CCC”等级，以及某些组织名称（如“Chaos Computer Club”）等。"},"examples":[{"en":"In history class, we learned about the CCC building trails in national parks.","zh":"在历史课上，我们学到 CCC 在国家公园修建步道。"},{"en":"The company’s bonds were rated CCC, which suggests high risk.","zh":"这家公司的债券被评为 CCC，通常表示风险很高。"},{"en":"He follows CCC news about computer security and hacking culture.","zh":"他关注 CCC 关于网络安全和黑客文化的消息。"}]},{"partOfSpeech":"other","definition":{"en":"(Finance) A credit-rating grade “CCC,” generally indicating a very speculative / high-risk borrower or investment (exact meaning varies by rating agency).","zh":"（金融）信用评级“CCC”，一般表示高度投机/高风险的借款人或投资标的（不同评级机构的具体标准略有差异）。"},"examples":[{"en":"A CCC rating often means the issuer may struggle to repay its debt.","zh":"CCC 评级通常意味着发行人可能难以偿还债务。"},{"en":"Some investors avoid CCC-rated debt unless the return is very high.","zh":"一些投资者会避开 CCC 级别的债务，除非回报非常高。"}]},{"partOfSpeech":"other","definition":{"en":"(U.S. history) Civilian Conservation Corps: a U.S. government program (1933–1942) that employed young men on environmental and public-works projects.","zh":"（美国历史）Civilian Conservation Corps：美国政府项目（1933–1942），雇用年轻人从事环保与公共工程建设。"},"examples":[{"en":"The CCC planted millions of trees during the Great Depression.","zh":"大萧条时期，CCC 种下了数百万棵树。"},{"en":"Many park cabins and roads were built by the CCC.","zh":"许多公园小屋和道路由 CCC 修建。"}]}],"synonyms":["abbreviation","acronym"],"phonetic":"/si si si/","extraExplanation":["“CCC”是典型的多义缩写，写作时最好第一次出现就写出全称（例如 Civilian Conservation Corps），之后再用 CCC，以免读者误解。","读到“rated CCC / CCC-rated”时，几乎可以确定是在金融信用评级语境中；而在美国历史、国家公园、公共工程等话题中，更可能指 Civilian Conservation Corps。"]}
{"word":"CCCCM","summary":{"en":"“CCCCM” is not a standard Roman numeral; it’s often (loosely) read as 1,300 or simply spoken as the letters C-C-C-C-M.","zh":"“CCCCM”不是标准罗马数字；常被勉强理解为 1300，或仅作为字母串按 C-C-C-C-M 念出。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard string of Roman-numeral letters. It is usually interpreted as 1,300 (CCCC = 400, CM = 900), but standard Roman numerals would write 1,300 as MCCCCC (older additive style) or, more commonly today, MCCC (1,000 + 300).","zh":"一个不规范的罗马数字字母组合。它常被勉强理解为 1300（CCCC=400，CM=900），但按较标准的写法，1300 通常写作 MCCC（1000+300）；较古老的“加法式”有时会出现更长的写法。"},"examples":[{"en":"The inscription shows “CCCCM,” but that isn’t a standard Roman numeral form.","zh":"碑文上写着“CCCCM”，但这不是标准的罗马数字写法。"},{"en":"If you mean 1300, the common modern Roman numeral is “MCCC.”","zh":"如果你想表示 1300，常见的现代罗马数字是“MCCC”。"}]},{"partOfSpeech":"other","definition":{"en":"The letters read aloud as “C-C-C-C-M,” often used when spelling out codes, labels, or initials (not a common word).","zh":"把字母逐个念出来的“C-C-C-C-M”，常用于拼读代码、标签或缩写（不是常见单词）。"},"examples":[{"en":"Please enter the code: C-C-C-C-M.","zh":"请输入代码：C-C-C-C-M。"}]}],"synonyms":["MCCC (for 1300, standard Roman numeral)"],"phonetic":"/ˌsiːˌsiːˌsiːˌsiːˈɛm/","extraExplanation":["罗马数字更常见的规则是“减法式”组合：4 写作 IV（不是 IIII/CCCC 这类连写），9 写作 IX，40 写作 XL，90 写作 XC，400 写作 CD，900 写作 CM。因为 400 的标准写法是 CD，所以用 CCCC 会显得很不规范；而把 CCCC 和 CM 拼在一起（CCCCM）也很少见，容易引起歧义。","如果你是在手表表盘或旧式建筑上看到类似写法，确实有些场景会用更“加法式”的传统写法（例如 IIII 表示 4），但 CCCC 仍然相对少见。你可以告诉我你在哪看到“CCCCM”（例如纹身、钟表、题目、缩写），我可以更准确解释它的意图。"]}
{"word":"CCCI","summary":{"en":"CCCI is an abbreviation most commonly referring to Campus Crusade for Christ International (now called Cru), but it can also mean other things depending on context.","zh":"CCCI 是一个缩写，最常见指 Campus Crusade for Christ International（现多称 Cru），也可能在不同语境下代表其他含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) Campus Crusade for Christ International; the former name of a U.S.-based Christian ministry now commonly known as Cru.","zh":"（缩写）Campus Crusade for Christ International（基督教校园事工组织）；现多称为 Cru，是其较常见的新名称。"},"examples":[{"en":"She volunteered with CCCI (now Cru) during college.","zh":"她在大学期间在 CCCI（现称 Cru）做过志愿者。"},{"en":"CCCI runs outreach programs on many university campuses.","zh":"CCCI 在许多大学校园开展外展（传教/关怀）项目。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) CCCI can also stand for other organizations or technical terms; the exact meaning depends on the context (e.g., a company name, a report title, or an industry abbreviation).","zh":"（缩写）CCCI 也可能代表其他机构或专业术语；具体含义取决于语境（例如公司名、报告标题或行业缩写）。"},"examples":[{"en":"In this document, CCCI refers to a local company, not the ministry.","zh":"在这份文件里，CCCI 指的是一家本地公司，而不是那个事工组织。"},{"en":"What does CCCI stand for in your email?","zh":"你邮件里的 CCCI 是什么的缩写？"}]}],"synonyms":["Cru (for the ministry)"],"phonetic":"/ˌsiː ˌsiː ˌsiː ˈaɪ/","extraExplanation":["CCCI 通常按字母逐个读（C-C-C-I）。如果你告诉我它出现的场景（例如学校、宗教组织、公司、医疗、物流等），我可以更准确地确认是哪一种含义。"]}
{"word":"CCD","summary":{"en":"CCD usually means “charge-coupled device,” an image sensor used to capture light and create digital images.","zh":"CCD 通常指“电荷耦合器件”，一种用于采集光线并生成数字图像的图像传感器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbr.) charge-coupled device: a type of image sensor used in cameras, scanners, and scientific instruments to capture light and turn it into digital signals.","zh":"（缩写）电荷耦合器件：一种图像传感器，用于相机、扫描仪和科研仪器，把光转换成数字信号。"},"examples":[{"en":"Older digital cameras often used a CCD sensor.","zh":"早期的数码相机常使用 CCD 传感器。"},{"en":"The microscope’s CCD camera helps researchers record very faint light.","zh":"显微镜的 CCD 相机能帮助研究人员记录非常微弱的光。"},{"en":"This scanner uses a CCD to capture detailed images.","zh":"这台扫描仪使用 CCD 来捕捉细节丰富的图像。"}]}],"synonyms":["charge-coupled device","image sensor"],"phonetic":"/ˌsiː siː ˈdiː/","extraExplanation":["CCD 通常读作字母：C-C-D（/ˌsiː siː ˈdiː/）。写作时多为大写，因为它是缩写。","在消费级产品中，CCD 过去很常见；现在很多设备更常见的是 CMOS 传感器。一般口语或产品说明中会把 CCD 和 CMOS 并列来比较画质、噪点、功耗等。","在不同领域里 CCD 也可能指别的机构或术语（如学校或项目名称）。如果在非影像/相机语境中看到 CCD，最好结合上下文确认含义。"]}
{"word":"CCDS","summary":{"en":"CCDS is most commonly an acronym for Certified Clinical Documentation Specialist (healthcare). In other contexts, it may refer to a specific software/file format and depends on where you saw it.","zh":"CCDS最常见的含义是医疗领域的“认证临床文档专员（Certified Clinical Documentation Specialist）”。在其他语境中也可能是某种软件/文件格式等缩写，需结合出现的场景判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Certified Clinical Documentation Specialist (a professional certification in healthcare documentation and coding).","zh":"认证临床文档专员（医疗行业的一种专业认证，侧重临床病历/文档质量与编码合规）。"},"examples":[{"en":"She earned her CCDS to move into clinical documentation improvement (CDI).","zh":"她取得了CCDS认证，转到临床文档改进（CDI）方向工作。"},{"en":"Many hospitals prefer CDI staff to have CCDS or CDIP certification.","zh":"许多医院更倾向于让CDI人员持有CCDS或CDIP认证。"}]},{"partOfSpeech":"other","definition":{"en":"CCDS (computing): a file format/extension used for certain image or scanned-document workflows, depending on the software.","zh":"CCDS（计算机领域）：某些软件/工作流中使用的文件格式或扩展名（常见于图像或扫描文档处理，具体含义取决于软件）。"},"examples":[{"en":"The lab exported the scans as CCDS files for archiving.","zh":"实验室将扫描结果导出为CCDS文件用于归档。"},{"en":"If you can’t open a .ccds file, check which program created it.","zh":"如果你打不开 .ccds 文件，先确认它是由哪个程序生成的。"}]}],"synonyms":["Certified Clinical Documentation Specialist","CDI (related field)","CDIP (related certification)"],"phonetic":"/ˌsiː siː diː ˈɛs/","extraExplanation":["在医疗语境里，CCDS最常指AcdIS（Association of Clinical Documentation Integrity Specialists）相关的专业认证“Certified Clinical Documentation Specialist”。它通常与CDI（Clinical Documentation Integrity/Improvement，临床文档完整性/改进）岗位密切相关，用于提升病历记录的准确性、支持合理编码与合规报销。","如果你看到CCDS出现在某个特定行业（如软件、学校、工程项目）里，它也可能是该领域内部的缩写。你可以告诉我你是在哪里看到“CCDS”的（例如邮件、课程、医院岗位、文件后缀），我可以把含义精确到那个场景。"]}
{"word":"Cceres","summary":{"en":"Cáceres is a city (and also a province) in western Spain; it can also be a Spanish surname.","zh":"Cáceres（卡塞雷斯）是西班牙西部的一座城市（也指同名省份）；也可作西语姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A city in western Spain (Extremadura), famous for its well-preserved medieval and Renaissance old town (a UNESCO World Heritage Site).","zh":"西班牙西部（埃斯特雷马杜拉大区）的一座城市，以保存完好的中世纪与文艺复兴时期古城区闻名（联合国教科文组织世界遗产）。"},"examples":[{"en":"We visited Cáceres to see its medieval old town.","zh":"我们去卡塞雷斯（Cáceres）参观它的中世纪古城区。"},{"en":"Cáceres is in the region of Extremadura, near the Portuguese border.","zh":"卡塞雷斯位于埃斯特雷马杜拉大区，靠近葡萄牙边境。"}]},{"partOfSpeech":"other","definition":{"en":"A province of Spain whose capital city is also called Cáceres.","zh":"西班牙的一个省，省会同样叫卡塞雷斯（Cáceres）。"},"examples":[{"en":"The Cáceres province has many historic towns and natural parks.","zh":"卡塞雷斯省有许多历史古镇和自然公园。"}]},{"partOfSpeech":"n.","definition":{"en":"A Spanish-language surname (family name).","zh":"西语姓氏（家族姓）。"},"examples":[{"en":"Her last name is Cáceres.","zh":"她的姓是卡塞雷斯（Cáceres）。"}]}],"phonetic":"/ˈkɑːsəˌrɛs/","extraExplanation":["你输入的“Cceres”很可能是“Cáceres”（带重音符号 á）。在西班牙语里重音会影响读法与拼写；英文写作中有时会省略重音写成“Caceres”。","Cáceres 的古城区在一些英文旅行写作中常被称为“the Old Town of Cáceres”，并因石砌宫殿与城墙景观出名。"]}
{"word":"ccesser","summary":{"en":"Accessor: something (or someone) that provides access; often used in programming for accessor methods.","zh":"Accessor：提供“访问/取用”的人或事物；在编程中常指访问器方法（如getter）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing that helps you reach, enter, or use something; something that provides access","zh":"帮助你到达、进入或使用某物的人或事物；提供“进入/使用权限”的东西"},"examples":[{"en":"The system uses a separate accessor to connect to the database safely.","zh":"这个系统使用单独的访问器来安全地连接数据库。"},{"en":"In some designs, each data field has its own accessor method.","zh":"在某些设计中，每个数据字段都有自己的访问器方法。"}]},{"partOfSpeech":"n.","definition":{"en":"(law, less common) someone who helps another person commit a crime; an accomplice","zh":"（法律用语，较少见）协助他人犯罪的人；共犯"},"examples":[{"en":"He was charged as an accessor after the fact.","zh":"他被指控为事后从犯。"}]}],"synonyms":["gateway","interface","entry point","getter","accomplice"],"phonetic":"/əkˈsɛsər/","extraExplanation":["你输入的“ccesser”在英语里不常见，最接近、也最常用的可能是 **accessor**（访问器/取用器）。另一个可能的目标词是 **access**（名词/动词：进入、使用；获取权限），但拼写差得更远一些。","在编程语境中，**accessor (method)** 常指“getter/读取器”（有时也包含setter/写入器），用于读取或控制对数据的访问。","在法律语境里，英式用法常见 **accessory**（如 accessory to a crime），美式也会用，但日常英语里更常说 **accomplice**。"]}
{"word":"CCF","summary":{"en":"CCF is an abbreviation most commonly meaning China Computer Federation, but it can stand for different things depending on context.","zh":"CCF 是一个缩写，最常见指“中国计算机学会”，但在不同语境下也可能代表其他含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) China Computer Federation: a major academic/professional organization for computer science and technology in China.","zh":"（缩写）中国计算机学会：中国重要的计算机科学与技术领域学术/专业组织。"},"examples":[{"en":"I’m going to a CCF conference this summer.","zh":"我今年夏天要去参加 CCF 的会议。"},{"en":"The paper was recommended by a CCF technical committee.","zh":"这篇论文由 CCF 的技术委员会推荐。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev.) an acronym used in different fields with different meanings (for example, in healthcare or finance); the exact meaning depends on the context.","zh":"（缩写）在不同领域可代表不同含义的字母缩写（如医疗、金融等）；具体意思取决于上下文。"},"examples":[{"en":"In this report, CCF is defined in the glossary.","zh":"在这份报告里，CCF 的含义在术语表中有定义。"},{"en":"What does CCF stand for in this email?","zh":"这封邮件里的 CCF 是什么意思/代表什么？"}]}],"synonyms":["abbrev.","acronym"],"phonetic":"/ˌsiː siː ˈɛf/","extraExplanation":["CCF 作为缩写非常“依赖语境”。在中文学术语境里，最常见的是指“中国计算机学会”（China Computer Federation），常用于会议、论文分级/推荐、技术委员会等相关话题。","如果你是在某份特定材料（邮件、课程、医院报告、公司文件）里看到 CCF，最稳妥的方法是查看该材料是否在开头或术语表里给出全称（stand for）。你也可以把完整句子发我，我可以帮你判断最可能的含义。"]}
{"word":"CCH","summary":{"en":"“CCH” is an abbreviation with multiple possible meanings; the correct one depends on the context.","zh":"“CCH”是一个可能有多种含义的缩写，具体意思取决于出现的语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation that can stand for different things depending on context (often said as the letters “C-C-H”). Common meanings include “Certified Clinical Hypnotherapist” (a professional credential) and “Chicago”/“Cook County Hospital” in some U.S. healthcare contexts.","zh":"一个会因语境不同而代表不同含义的缩写（常读作字母“C-C-H”）。常见含义包括“Certified Clinical Hypnotherapist（认证临床催眠治疗师）”等职业证书，以及在美国部分医疗语境中指“芝加哥/库克郡医院（Cook County Hospital）”。"},"examples":[{"en":"Her signature includes “CCH,” which stands for Certified Clinical Hypnotherapist.","zh":"她的签名里有“CCH”，指的是 Certified Clinical Hypnotherapist（认证临床催眠治疗师）。"},{"en":"The report mentions CCH, but we need the full name to know which organization it refers to.","zh":"报告里提到 CCH，但需要全称才能知道具体指哪个机构。"}]}],"synonyms":["initialism","abbreviation","acronym (general term)"],"phonetic":"ˌsiː siː ˈeɪtʃ","extraExplanation":["“CCH”是典型的首字母缩写（initialism），通常按字母逐个读：C-C-H。由于缩写在不同领域可能对应多个全称（医疗、教育、职业资格、机构名称等），如果你告诉我你看到它的场景（例如医院文件、学校名称、证书、论文/报告），我可以给出最准确的释义和用法。"]}
{"word":"Cchaddie","summary":{"en":"A caddie is a golf assistant who carries clubs and gives advice; it can also mean to work in that role.","zh":"caddie 指高尔夫球童（背球杆并提供协助/建议的人）；也可作动词表示“当球童”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who carries a golfer’s bag and gives help or advice during a game","zh":"（高尔夫球）球童；为球手背包并在比赛中提供帮助或建议的人"},"examples":[{"en":"The golfer thanked the caddie for choosing the right club.","zh":"那位球手感谢球童帮他选了合适的球杆。"},{"en":"Her caddie suggested aiming a little left because of the wind.","zh":"她的球童建议因为有风，瞄准时稍微偏左。"}]},{"partOfSpeech":"v.","definition":{"en":"to work as a caddie; to carry clubs and assist a golfer","zh":"当球童；为球手背球杆并协助比赛"},"examples":[{"en":"He caddied on weekends to earn extra money.","zh":"他周末当球童赚点外快。"},{"en":"She caddied for her friend during the charity tournament.","zh":"在慈善锦标赛上，她给朋友当球童。"}]}],"synonyms":["golf assistant","caddy"],"phonetic":"/ˈkædi/","extraExplanation":["你输入的“Cchaddie”更像是拼写错误；常见正确拼写是 **caddie**（美式）或 **caddy**（也常见，尤其在英式用法中也可见）。","在高尔夫文化里，专业球童不只是“背包的人”，还会帮球手读果岭坡度、判断风向、建议选杆，因此在比赛中很重要。"]}
{"word":"cchaddoorck","summary":{"en":"“cchaddoorck” doesn’t appear to be an English word; please provide the correct spelling or context.","zh":"“cchaddoorck”似乎不是英文单词；请提供正确拼写或使用语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a recognized English word. It may be a misspelling, a username, or a random string.","zh":"这不是一个常见或可识别的英文单词，可能是拼写错误、用户名或随机字符。"},"examples":[{"en":"I couldn’t find “cchaddoorck” in an English dictionary—could you check the spelling?","zh":"我在英文词典里找不到“cchaddoorck”——你能检查一下拼写吗？"},{"en":"If you tell me the sentence where you saw it, I can guess what it was meant to be.","zh":"如果你告诉我它出现的句子语境，我可以帮你推测它本来想表达的词。"}]}],"phonetic":"/tʃædˈdɔɹk/","extraExplanation":["可能的情况：\n1）拼写打错：比如你想查的是某个近似拼写的英文单词。\n2）专有名词：例如游戏ID、网名、项目代号、文件名等。\n3）把两个词粘在一起了：例如“chad + door + …”之类。\n\n你可以把它出现的完整句子/截图发我，或告诉我你想表达的中文意思（例如“门口/门锁/阴影/咒语”等），我就能更准确地帮你找到正确单词。"]}
{"word":"Cchakri","summary":{"en":"Chakri means a paid job or employment in South Asian English, often implying a stable, secure position.","zh":"Chakri 指南亚英语里的“工作/职业”，常暗示稳定、正规、较有保障的职位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian English, especially Bangladesh/India) a paid job; employment, often used for a stable position such as government or office work.","zh":"（南亚英语，尤指孟加拉/印度）工作；职业；雇佣（常指较稳定的职位，如公务员或办公室工作）。"},"examples":[{"en":"She’s looking for a chakri in Dhaka after graduation.","zh":"她毕业后正在达卡找一份工作。"},{"en":"He finally got a government chakri, so his family felt relieved.","zh":"他终于找到了一份公务员工作，所以家里人都松了一口气。"},{"en":"In many families, a steady chakri is seen as more secure than freelancing.","zh":"在很多家庭里，一份稳定的工作被认为比自由职业更有保障。"}]}],"synonyms":["job","employment","work","position","occupation"],"phonetic":"ˈtʃʌkri","extraExplanation":["“chakri/চাকরি”在孟加拉语等南亚语境里很常见，日常对话中就相当于英语的 job/employment。写成“Cchakri”多半是拼写变体或输入错误。","使用场景上，它常带有“稳定、体面、正规编制（尤其政府部门）”的隐含意味，因此有时不完全等同于任何一种英语里的 job，而更接近 “a stable position / a secure job”。"]}
{"word":"CCI","summary":{"en":"CCI is an abbreviation; most commonly it means the Consumer Confidence Index, but it can also refer to other field-specific terms depending on context.","zh":"CCI是一个缩写；最常见指“消费者信心指数”，也可能在不同领域表示其他含义，需结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation that most commonly stands for Consumer Confidence Index (an economic indicator that measures how optimistic consumers feel about the economy).","zh":"缩写，最常见指“消费者信心指数”（衡量消费者对经济前景乐观程度的经济指标）。"},"examples":[{"en":"The CCI rose this month, suggesting consumers feel more optimistic about spending.","zh":"本月CCI上升，表明消费者对支出更乐观。"},{"en":"Analysts watch the CCI closely because it can affect retail sales and investment sentiment.","zh":"分析师密切关注CCI，因为它可能影响零售销售和投资情绪。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation used in some fields for other terms (for example, in agriculture: Certified Crop Adviser; in business contexts: various company or organization names).","zh":"在不同领域也可能代表其他词组（例如农业领域：注册作物顾问Certified Crop Adviser；商业语境：某些公司或组织名称等）。"},"examples":[{"en":"She became a CCI to provide professional advice on crop management.","zh":"她取得了CCI资格，为作物管理提供专业建议。"},{"en":"Please clarify what CCI refers to in this document.","zh":"请说明这份文件里的CCI具体指什么。"}]}],"phonetic":"/ˌsiː siː ˈaɪ/","extraExplanation":["“CCI”是字母缩写，具体含义高度依赖语境：金融新闻里通常指消费者信心指数；职业/资质场景可能指某种认证；企业或机构名称里也常用作简称。阅读时可以先看它出现的主题（经济数据、职业证书、公司名）来判断。","读法一般按字母逐个读（C-C-I）。写作中第一次出现时，正式文本常会先写全称再写缩写，例如：Consumer Confidence Index (CCI)。"]}
{"word":"ccid","summary":{"en":"CCID is most commonly a tech acronym for the USB smart-card standard; in other contexts it can simply mean a system-specific ID code.","zh":"CCID 最常见是指 USB 智能卡通信标准；在其他语境中也可能只是某个系统自定义的编号/识别码。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(computing) A standard for USB smart-card readers and security tokens (chip-card interface device).","zh":"（计算机）USB 智能卡读卡器/安全令牌的通信标准（芯片卡接口设备）。"},"examples":[{"en":"This YubiKey can work in CCID mode for smart-card authentication.","zh":"这把 YubiKey 可以用 CCID 模式进行智能卡认证。"},{"en":"On Linux, the CCID driver lets the system talk to a USB smart-card reader.","zh":"在 Linux 上，CCID 驱动让系统能够与 USB 智能卡读卡器通信。"}]},{"partOfSpeech":"other","definition":{"en":"(general) An abbreviation for “customer/client/card/chip ID,” meaning an identification code in a specific system (exact meaning depends on the context).","zh":"（通用）“customer/client/card/chip ID”等的缩写，指某个系统里的识别码（具体含义取决于上下文）。"},"examples":[{"en":"Please enter your CCID to verify your account.","zh":"请输入你的 CCID 以验证账户。"},{"en":"The device label shows the CCID and serial number.","zh":"设备标签上有 CCID 和序列号。"}]}],"synonyms":["smart-card interface","chip-card interface device (standard)"],"phonetic":"/ˌsiːˌsiːˈaɪˈdiː/","extraExplanation":["在技术语境里，CCID 最常见指 USB 智能卡标准（Chip/Smart Card Interface Devices），常出现在安全登录、证书、企业门禁、PKI 等场景。","如果你是在某个具体平台/软件里看到“CCID”（例如运营商、银行、公司内部系统），它也可能只是该系统自定义的“编号/ID”。若你贴一下出现 CCID 的界面或一句上下文，我可以帮你确定它的准确含义。"]}
{"word":"ccident","summary":{"en":"An accident is an unexpected harmful event, or something that happens by chance.","zh":"accident 指“意外事故”，也可指“偶然发生的事”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An unexpected event that causes harm, damage, or injury.","zh":"意外事故；突然发生并造成伤害、损坏或受伤的事件。"},"examples":[{"en":"She was hurt in a car accident.","zh":"她在一场车祸中受伤了。"},{"en":"The accident caused a long traffic jam.","zh":"这起事故造成了严重的交通堵塞。"}]},{"partOfSpeech":"n.","definition":{"en":"Something that happens by chance, not planned or intended.","zh":"偶然发生的事；并非计划或故意发生的事。"},"examples":[{"en":"We met by accident at the airport.","zh":"我们在机场偶然遇见。"},{"en":"It was no accident that she won; she practiced every day.","zh":"她获胜并非偶然；她每天都在练习。"}]}],"synonyms":["mishap","incident","crash","collision","chance"],"phonetic":"/ˈæk.sə.dənt/","extraExplanation":["你输入的“ccident”很可能是拼写错误；正确拼写是 accident（前面要加 a）。","常见搭配：car accident（车祸），traffic accident（交通事故），by accident（偶然地），accidentally（adv. 意外地）。","在法律/新闻语境里，accident 常暗示“非故意”的事件；若强调“人为疏忽导致”，也可能用 incident（事件）或 crash（撞车/坠毁，偏描述碰撞本身）。"]}
{"word":"CCIM","summary":{"en":"CCIM most commonly means “Certified Commercial Investment Member,” a well-known commercial real estate designation.","zh":"CCIM 最常见的含义是“Certified Commercial Investment Member（商业不动产投资认证会员）”，是商业地产领域知名的职业认证。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Certified Commercial Investment Member: a professional designation for commercial real estate and investment experts (awarded by the CCIM Institute).","zh":"（美国）商业不动产投资认证会员：一种面向商业地产与投资专业人士的职业认证（由 CCIM Institute 颁发）。"},"examples":[{"en":"She earned her CCIM to strengthen her credibility in commercial real estate.","zh":"她获得了 CCIM 认证，以提升自己在商业地产领域的专业可信度。"},{"en":"Many investors prefer working with a broker who is a CCIM.","zh":"很多投资者更愿意与拥有 CCIM 资格的经纪人合作。"}]},{"partOfSpeech":"n.","definition":{"en":"The CCIM Institute / the organization behind the CCIM designation (sometimes informally called “CCIM”).","zh":"CCIM Institute / 负责该认证的机构（有时也简称为“CCIM”）。"},"examples":[{"en":"He took valuation courses through CCIM.","zh":"他通过 CCIM（机构）学习了估值课程。"}]}],"synonyms":["commercial real estate designation","CRE credential"],"phonetic":"/ˌsiːˌsiːˈaɪˈɛm/","extraExplanation":["“CCIM”通常读作字母：C-C-I-M。它在美国商业地产圈很常见，强调财务分析、估值、投资回报等能力，常出现在名片、简历或签名档中（如：Jane Doe, CCIM）。","注意区分：CCIM 既可以指“认证头衔”（某人是 a CCIM），也可能指“机构/课程体系”（through CCIM）。"]}
{"word":"CCIP","summary":{"en":"CCIP is an acronym most commonly referring to a Cisco professional-level networking certification, but it can also mean “Commander’s Critical Information Requirements” in military/decision-making contexts.","zh":"CCIP 是缩写，最常见指思科的专业级网络认证；在军事/决策语境中也可指“指挥官关键信息需求”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Cisco Certified Internetwork Professional: a mid-to-advanced Cisco networking certification (commonly called a “professional-level” Cisco cert).","zh":"Cisco 认证网络专家：思科的中高级网络认证（通常称为“专业级”认证）。"},"examples":[{"en":"She earned her CCIP to qualify for senior network engineer roles.","zh":"她拿到了 CCIP，以便应聘高级网络工程师岗位。"},{"en":"Our company values CCIP because it shows strong routing and service-provider networking skills.","zh":"我们公司重视 CCIP，因为它体现了较强的路由与运营商网络技能。"}]},{"partOfSpeech":"other","definition":{"en":"(Military/business) Commander’s Critical Information Requirements: key information a commander/leader needs to make decisions.","zh":"（军事/管理）指挥官关键信息需求：指挥官/领导做决策所必须掌握的关键信息。"},"examples":[{"en":"The briefing focused on CCIP such as troop movement and supply status.","zh":"简报聚焦于 CCIP，例如部队调动和补给情况。"},{"en":"Analysts were tasked to collect CCIP before the operation began.","zh":"分析人员在行动开始前被要求收集 CCIP。"}]}],"synonyms":["Cisco professional certification","Commander’s critical information requirements"],"phonetic":"ˌsiː siː aɪ ˈpiː","extraExplanation":["CCIP 是缩写，不同领域含义不同。最常见的两个用法是：① IT/网络领域的思科认证名称；② 军事与情报/管理领域的“关键信息需求”。如果你告诉我你看到 CCIP 的上下文（证书、岗位JD、军方文件等），我可以帮你确定准确含义。"]}
{"word":"CCIR","summary":{"en":"CCIR most commonly refers to the former International Radio Consultative Committee of the ITU, whose recommendations influenced many radio/TV standards; it later became part of ITU‑R.","zh":"CCIR 最常指 ITU 旗下曾经的国际无线电咨询委员会，许多无线电/电视标准受其建议影响；后来并入 ITU‑R。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the International Radio Consultative Committee (French: Comité Consultatif International des Radiocommunications), a former technical body of the ITU that developed standards and recommendations for radio communications; later became part of today’s ITU‑R.","zh":"国际无线电咨询委员会（法语：Comité Consultatif International des Radiocommunications），国际电信联盟（ITU）曾设立的技术机构，负责制定无线电通信相关的标准与建议，后来并入如今的 ITU‑R（国际电信联盟无线电通信部门）。"},"examples":[{"en":"Older engineering documents may refer to CCIR recommendations for television and radio systems.","zh":"较早的工程文件可能会引用 CCIR 关于电视和无线电系统的建议书。"},{"en":"Some standards were once labeled “CCIR,” but today they are typically associated with ITU‑R.","zh":"有些标准过去标注为“CCIR”，但如今通常与 ITU‑R 相关。"}]},{"partOfSpeech":"n.","definition":{"en":"an abbreviation used in some fields for other organizations or terms (meaning depends on context).","zh":"在某些领域中也可能代表其他机构或术语的缩写（具体含义取决于上下文）。"},"examples":[{"en":"In a technical report, check the glossary to see what CCIR stands for in that document.","zh":"在技术报告里，查看术语表可以确认该文档中 CCIR 的具体含义。"}]}],"synonyms":["International Radio Consultative Committee","Comité Consultatif International des Radiocommunications","ITU‑R (modern successor, related term)"],"phonetic":"/ˌsiːˌsiːˌaɪˈɑːr/","extraExplanation":["CCIR 是历史上非常常见的无线电与电视标准来源之一。1990 年代 ITU 结构调整后，CCIR 与 CCITT 等机构的职能重新整合；无线电相关工作主要归入 ITU‑R。你可能在旧版制式、色彩编码、广播电视参数等资料中见到 “CCIR” 的标注。"]}
{"word":"CCIS","summary":{"en":"CCIS is an initialism (said as letters) with different possible meanings depending on context, often referring to a school/department or an office name.","zh":"CCIS 是按字母读的缩写，含义因语境而异，常指学校的学院/系所或某类办公室名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation (acronym/initialism) whose meaning depends on context; it is most often read as the individual letters “C-C-I-S.”","zh":"一个缩写（首字母缩略词/字母缩写），具体含义取决于语境；通常按字母逐个读作“C-C-I-S”。"},"examples":[{"en":"What does CCIS stand for in this email?","zh":"这封邮件里的 CCIS 是什么意思/代表什么？"},{"en":"Our university’s CCIS office will contact new international students.","zh":"我们学校的 CCIS 办公室会联系新入境的国际学生。"}]},{"partOfSpeech":"other","definition":{"en":"(Common in education) A name for a university/college unit, often something like “College/Center of Computing and Information Sciences” or “Computer and Information Science.”","zh":"（教育领域常见）大学/学院里的机构名称，常见类似“计算与信息科学学院/中心”或“计算机与信息科学”。"},"examples":[{"en":"She is a lecturer in CCIS.","zh":"她在 CCIS 任教。"},{"en":"CCIS offers courses in programming and data science.","zh":"CCIS 提供编程与数据科学课程。"}]},{"partOfSpeech":"other","definition":{"en":"(Also used by some organizations) A department or program name related to international students/services, e.g., “Center for/Office of Citizenship and Immigration Services” or similar local titles.","zh":"（一些机构也会用）与国际学生/移民或相关服务有关的部门或项目名称，例如“公民与移民服务中心/办公室”等（以当地命名为准）。"},"examples":[{"en":"Please submit your documents to CCIS before Friday.","zh":"请在周五前把材料提交给 CCIS。"},{"en":"CCIS can help you understand your visa requirements.","zh":"CCIS 可以帮助你了解签证要求。"}]}],"synonyms":["an abbreviation","an initialism","an acronym"],"phonetic":"/ˌsiːˌsiːˌaɪˈɛs/","extraExplanation":["CCIS 不是一个“固定只有一种意思”的单词，更多是机构/项目的缩写。最稳妥的做法是看它出现的场景：学校官网、邮件签名、抬头、所在国家/城市等，通常会在第一次出现时写出全称（例如“… (CCIS)”）。","如果你把 CCIS 出现的完整句子（或所在学校/公司名称）发我，我可以帮你判断它在你语境里最可能的全称与中文对应。"]}
{"word":"CCITT","summary":{"en":"CCITT: a former international telecom standards committee, now associated with ITU‑T.","zh":"CCITT：曾经的国际电信标准机构名称，如今多与 ITU‑T 对应。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) The International Telegraph and Telephone Consultative Committee, a former international standards body that developed telecommunications recommendations (later reorganized as ITU‑T).","zh":"（历史用语）国际电报电话咨询委员会：曾负责制定电信相关国际标准与建议的机构，后来重组为 ITU‑T。"},"examples":[{"en":"The fax standard known as Group 3 comes from CCITT recommendations.","zh":"常见的第三组传真标准（Group 3）来自 CCITT 的建议书。"},{"en":"Older networking documents may refer to CCITT instead of ITU‑T.","zh":"较早的网络文档可能会用 CCITT，而不是 ITU‑T。"}]}],"synonyms":["ITU‑T","International Telegraph and Telephone Consultative Committee"],"phonetic":"/ˌsiː siː aɪ tiː tiː/","extraExplanation":["CCITT 是法语名称「Comité Consultatif International Téléphonique et Télégraphique」的缩写，英语常译为 International Telegraph and Telephone Consultative Committee。","1993 年前后，CCITT 被并入国际电信联盟（ITU）的电信标准化部门，今天更常见的名称是 ITU‑T（ITU Telecommunication Standardization Sector）。","在技术写作里，CCITT 常出现在传真（如 CCITT Group 3/4）、图像压缩（如 CCITT T.4/T.6，与早期 TIFF 传真压缩有关）等标准语境中。"]}
{"word":"ccitt","summary":{"en":"CCITT is the former name of a major telecom standards group (now ITU‑T).","zh":"CCITT 是重要电信标准机构的旧称（现为 ITU‑T）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(historical) The International Telegraph and Telephone Consultative Committee, a standards body that helped create global telecommunications recommendations (for example, fax and modem standards). It later became ITU‑T.","zh":"（历史用语）国际电报电话咨询委员会，一个制定/推动全球电信标准（建议书）的机构，例如传真与调制解调器等标准；后来演变为 ITU‑T。"},"examples":[{"en":"CCITT standards helped make early fax machines compatible worldwide.","zh":"CCITT 的标准帮助早期传真机在全球范围内实现兼容。"},{"en":"The modem manual mentions CCITT V.32 for data transmission.","zh":"调制解调器说明书提到用于数据传输的 CCITT V.32 标准。"}]}],"synonyms":["ITU‑T","International Telegraph and Telephone Consultative Committee","Comité Consultatif International Téléphonique et Télégraphique"],"phonetic":"/ˌsiːˌsiːˌaɪˌtiːˌtiː/","extraExplanation":["CCITT 是法语名称缩写（Comité Consultatif International Téléphonique et Télégraphique）。在 1993 年左右，相关组织结构调整后更常用的名称是 ITU‑T（国际电信联盟电信标准化部门）。","在技术文档里你常会看到“CCITT + 字母/数字”的写法，例如 V 系列（调制解调器）、T 系列（传真）、X 系列（数据网络）。这些通常指“CCITT 建议书/标准”。"]}
{"word":"cckw","summary":{"en":"“CCKW” is likely an initialism; its meaning depends on context.","zh":"“CCKW”很可能是缩写；具体含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“CCKW” is not a standard English word. It is most likely an abbreviation/initialism (the letters C-C-K-W), and its meaning depends on the context (e.g., a company name, a username, a project code, or a short form used in a specific community).","zh":"“CCKW” 不是常见的英语单词，更可能是一个缩写/首字母缩略词（C-C-K-W）。它的含义需要结合语境判断（例如公司名、用户名、项目代号，或某个圈子里的简写）。"},"examples":[{"en":"I saw “CCKW” in a chat—what does it stand for?","zh":"我在聊天里看到“CCKW”——它代表什么？"},{"en":"In this email, “CCKW” might be a team or project code.","zh":"在这封邮件里，“CCKW”可能是团队名或项目代号。"}]}],"phonetic":"/ˌsiː ˌsiː ˈkeɪ ˈdʌbəl.juː/","extraExplanation":["这类全大写的短串通常是“首字母缩写”。要准确解释，我需要你提供一点上下文：它出现在哪（短信/游戏/工作邮件/社交媒体）？前后一句是什么？也可能与你所在地区、行业或社群有关。"]}
{"word":"CCL","summary":{"en":"CCL is a context-dependent abbreviation, commonly read as “C-C-L,” and in biology it often refers to C‑C chemokine ligands like CCL2/CCL5.","zh":"CCL是一个依语境而定的缩写，通常读作“C-C-L”；在生物医学中常指C‑C趋化因子配体（如CCL2/CCL5）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation that is usually spoken as the letters “C-C-L.” Its exact meaning depends on the field or context.","zh":"一个缩写，通常按字母读作“C-C-L”。具体含义取决于使用领域或语境。"},"examples":[{"en":"What does CCL stand for in this document?","zh":"在这份文件里，CCL代表什么？"},{"en":"Please define CCL the first time you use it in your report.","zh":"请在报告中第一次使用CCL时先写出其全称。"}]},{"partOfSpeech":"other","definition":{"en":"(Biology/medicine) Short for “C‑C chemokine ligand,” a naming label for certain signaling proteins (e.g., CCL2, CCL5) involved in immune responses.","zh":"（生物/医学）“C‑C趋化因子配体（chemokine ligand）”的缩写，用于命名一类参与免疫反应的信号蛋白（如CCL2、CCL5）。"},"examples":[{"en":"The study measured CCL2 levels after infection.","zh":"该研究测量了感染后的CCL2水平。"},{"en":"CCL5 is linked to inflammation in some conditions.","zh":"在某些情况下，CCL5与炎症有关。"}]}],"synonyms":["initialism","abbreviation"],"phonetic":"/ˌsiː siː ˈɛl/","extraExplanation":["“CCL”属于首字母缩写（acronym/initialism）。在英文写作中，首次出现时通常需要写出全称（full form），后面才用缩写，以免读者误解。","如果你告诉我CCL出现的场景（例如聊天、公司文件、课程、医学论文、游戏等），我可以给出最符合该语境的释义与更贴切的例句。"]}
{"word":"CCls","summary":{"en":"CCLs most commonly means “Creative Commons licenses” (plural). It can also mean plural uses of the Roman numeral CCL (=250) in some numbering contexts.","zh":"CCLs 最常见指“知识共享许可协议（Creative Commons licenses）”的复数；也可能在编号语境中指罗马数字 CCL（=250）的复数用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of CCL, meaning Creative Commons licenses (standard licenses that tell others how they may use a work, such as a photo, article, or video).","zh":"CCL 的复数，常指 Creative Commons licenses（知识共享许可协议；用来说明他人可以如何使用作品，如照片、文章或视频的标准许可）。"},"examples":[{"en":"Many images on Wikipedia are shared under different CCLs.","zh":"维基百科上的许多图片使用不同的 CCL（知识共享许可）进行共享。"},{"en":"Check which of the CCLs allows commercial use before you repost the video.","zh":"转发视频前先确认是哪一种 CCL 允许商用。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of CCL used as a Roman numeral: CCL = 250, so CCLs can mean “250s” in numbering contexts.","zh":"作为罗马数字的 CCL 的复数：CCL = 250，因此在编号语境中 CCLs 可表示“250 这一类（250们/250段）”。"},"examples":[{"en":"The pages are numbered with Roman numerals, and the CCLs section begins near the end.","zh":"页码用罗马数字标注，CCLs（250 段附近）那一部分接近末尾开始。"}]}],"synonyms":["CC licenses","Creative Commons licenses"],"phonetic":"/ˌsiːˌsiːˈɛlz/","extraExplanation":["“CCL(s)”在真实英文里多见于特定圈子或内部文件；更常见的写法是“CC licenses / Creative Commons licenses”。如果你是在某个专业领域（如医学、工程、网络、安全、金融）看到“CCLs”，它也可能是该领域的缩写（不同机构含义会不同）。你可以告诉我出现它的句子或领域，我能更准确地解释。"]}
{"word":"ccm","summary":{"en":"“CCM” is an abbreviation most commonly meaning “cubic centimeter(s)” (a volume unit), and it can also mean “Contemporary Christian Music” or (in business) “customer communications management.”","zh":"“CCM”是缩写，最常见指“立方厘米”（体积单位）；也可指“当代基督教音乐”，或（商业领域）“客户沟通管理”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbr.) cubic centimeter(s): a unit of volume equal to 1 milliliter, often used in medicine and engine sizes.","zh":"（缩写）立方厘米：体积单位，等于 1 毫升，常用于医疗用量或发动机排量。"},"examples":[{"en":"The syringe holds 5 ccm of liquid.","zh":"这支注射器能装 5 ccm 的液体。"},{"en":"This motorcycle has a 150 ccm engine.","zh":"这辆摩托车的发动机排量是 150 ccm。"}]},{"partOfSpeech":"n.","definition":{"en":"(abbr.) Contemporary Christian Music: a modern style of Christian popular music.","zh":"（缩写）当代基督教音乐：一种现代风格的基督教流行音乐。"},"examples":[{"en":"She listens to CCM while driving to work.","zh":"她开车上班时会听 CCM。"},{"en":"That song is popular on CCM radio stations.","zh":"那首歌在 CCM 电台很受欢迎。"}]},{"partOfSpeech":"n.","definition":{"en":"(abbr., business) customer communications management: software/processes for creating and managing customer messages (letters, emails, bills).","zh":"（缩写，商业）客户沟通管理：用于制作与管理客户信息（信件、邮件、账单等）的软件或流程。"},"examples":[{"en":"Our bank uses a CCM system to generate monthly statements.","zh":"我们银行用 CCM 系统来生成月度对账单。"},{"en":"The team is upgrading its CCM platform for better email templates.","zh":"团队正在升级 CCM 平台，以改进邮件模板。"}]}],"synonyms":["cc","cm³","mL (for volume)"],"phonetic":"/ˌsiː siː ˈɛm/","extraExplanation":["在北美医学或护理记录里，更常写作 “cc” 或 “mL”；有些地方会看到 “ccm”，但它不是最标准的写法。","“ccm”表示体积时，读作字母：C-C-M（/ˌsiː siː ˈɛm/）。在发动机语境中，英语也常直接写 “cc”。"]}
{"word":"CCNC","summary":{"en":"CCNC is an acronym; its meaning changes with context (often a conference or an organization/program name).","zh":"CCNC 是首字母缩写；含义随语境变化（常见为会议名称或机构/项目名称）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation with several possible meanings; most commonly used as a name for an organization, program, or conference (the exact meaning depends on context).","zh":"一个有多种可能含义的缩写；最常见于机构、项目或会议名称（具体含义取决于语境）。"},"examples":[{"en":"What does CCNC stand for in this email?","zh":"这封邮件里的 CCNC 是什么意思？"},{"en":"I saw CCNC on the schedule, but the document didn’t explain it.","zh":"我在日程表上看到 CCNC，但文件没有解释。"}]},{"partOfSpeech":"other","definition":{"en":"(often) the initials for a conference name such as “Computer Communication and Network Conference/Congress” or similar titles used by universities and professional groups.","zh":"（常见用法）作为某类会议名称的缩写，例如“计算机通信与网络会议/大会”（不同机构的全称可能不同）。"},"examples":[{"en":"She presented her research at CCNC this year.","zh":"她今年在 CCNC 上做了研究报告。"},{"en":"Our lab submitted a paper to CCNC.","zh":"我们实验室向 CCNC 投稿了论文。"}]},{"partOfSpeech":"other","definition":{"en":"(in some places) an abbreviation used for a local network, public-health, or community-care program (name varies by region).","zh":"（在部分地区）用于地方网络、公共卫生或社区照护项目的缩写（各地名称不同）。"},"examples":[{"en":"The clinic works with CCNC to coordinate patient care.","zh":"这家诊所与 CCNC 合作来协调患者照护。"},{"en":"Ask your provider whether CCNC services are available.","zh":"请问你的医疗服务方是否提供 CCNC 的相关服务。"}]}],"synonyms":["acronym","initialism"],"phonetic":"/ˌsiː siː ˌɛn ˈsiː/","extraExplanation":["“CCNC”不是一个固定单词，而是首字母缩写，因此必须结合领域来判断：常见场景包括学术会议（计算机/通信/网络方向）、地方医疗或社区服务项目、以及公司或学校内部项目名。","读法通常按字母逐个读：C-C-N-C。你可以提供一句原文或所在领域（邮件、论文、课程表、医院等），我能帮你锁定最可能的全称。"]}
{"word":"CCNY","summary":{"en":"CCNY most commonly refers to The City College of New York (a CUNY college in NYC).","zh":"CCNY 通常指纽约市立学院（纽约市立大学 CUNY 体系内的一所高校）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(acronym) The City College of New York, a public college in New York City that is part of the City University of New York (CUNY) system.","zh":"（缩写）纽约市立学院（The City College of New York），纽约市的一所公立大学，隶属于纽约市立大学（CUNY）系统。"},"examples":[{"en":"She studied engineering at CCNY.","zh":"她在 CCNY 学习工程。"},{"en":"CCNY is located in Harlem, Manhattan.","zh":"CCNY 位于曼哈顿哈莱姆区。"},{"en":"He transferred from a community college to CCNY.","zh":"他从社区学院转学到 CCNY。"}]}],"synonyms":["The City College of New York","City College","CCNY (City College)"],"phonetic":"/ˌsiːˌsiːˌɛnˈwaɪ/","extraExplanation":["在纽约本地语境里，人们常直接说“City College”或“CCNY”。正式全名是“The City College of New York”。","CCNY 历史上以提供优质公立教育而知名，常被视为纽约公立高等教育的重要代表之一。"]}
{"word":"Ccoya","summary":{"en":"“Ccoya” is usually a variant spelling of “coya/qoya,” meaning the Inca queen or the ruler’s principal wife.","zh":"“Ccoya”通常是“coya/qoya”的拼写变体，指印加王后或君主的正妻。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the queen (or principal wife) of an Inca ruler; a title in the Inca Empire (from Quechua).","zh":"（印加帝国）印加君主的王后/正妻；“王后”的称号（源自克丘亚语）。"},"examples":[{"en":"In some histories of the Inca Empire, the coya is described as the emperor’s chief wife.","zh":"在一些印加帝国的历史记载中，coya 被描述为皇帝的正妻。"},{"en":"The coya could hold significant influence in court and religious life.","zh":"coya 在宫廷与宗教生活中可能拥有相当大的影响力。"}]},{"partOfSpeech":"other","definition":{"en":"a spelling variant of “coya” or “qoya,” used when writing Quechua names/terms in different systems.","zh":"“coya / qoya”的一种拼写变体，常见于用不同拼写体系转写克丘亚语的人名或术语。"},"examples":[{"en":"You may see the title written as coya, qoya, or ccoya depending on the source.","zh":"根据资料来源不同，这个称号可能写作 coya、qoya 或 ccoya。"}]}],"synonyms":["Inca queen","queen consort","principal wife (of the Inca ruler)"],"phonetic":"/ˈkɔɪ.ə/","extraExplanation":["“Ccoya”本身并不是常见英语词汇，更常见的英语写法是 coya（也见 qoya/koya）。它来自克丘亚语（Quechua），指“王后/贵妇”。","在一些安第斯语言的转写里，双写的辅音（如“cc”）可能用来表示与单写不同的发音或强调，但不同学者与地区的拼写习惯不完全一致。","文学与文化语境中，这个词多出现在关于印加文明、安第斯历史、或相关小说/史诗改写作品的英文文本里。"]}
{"word":"ccoya","summary":{"en":"“ccoya” isn’t a standard English word; please share context or check the spelling.","zh":"“ccoya”不是标准英语单词；请提供语境或确认拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“ccoya” is not a standard English word. It may be a typo, a username, a brand name, or an acronym used in a specific community.","zh":"“ccoya”不是标准英语单词，可能是拼写错误、用户名、品牌名，或某个圈子里的缩写。"},"examples":[{"en":"I couldn’t find “ccoya” in a dictionary—do you mean “Coya” or something else?","zh":"我在词典里找不到“ccoya”——你是想写“Coya”还是别的词？"},{"en":"If you tell me the sentence where you saw “ccoya,” I can help you interpret it.","zh":"如果你把看到“ccoya”的句子发给我，我可以帮你判断它的意思。"}]}],"extraExplanation":["“ccoya”更像是网络用语/缩写或专有名词（比如账号名、项目名）。请你提供：1）它出现的句子或场景；2）是否要查某个缩写（全称是什么）；3）你是不是想输入“coya / coy / cocoa / COYA”等相近拼写。","如果你其实想查“COYA/ Coya”（常见为品牌或专有名词），也请说明你指的是哪一类：餐厅/酒店品牌、地名、人名等；不同语境含义不同。"]}
{"word":"CCP","summary":{"en":"CCP most commonly means the Chinese Communist Party; it can also mean “critical control point” (food safety) or “Certified Cost Professional” (a certification).","zh":"CCP最常见指中国共产党；也可指“关键控制点”（食品安全）或“Certified Cost Professional”（成本领域职业认证）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Chinese Communist Party, the ruling political party of the People’s Republic of China","zh":"中国共产党（执政党）"},"examples":[{"en":"Many news reports use “CCP” when discussing China’s political leadership.","zh":"许多新闻报道在谈到中国的政治领导层时会用“CCP”。"},{"en":"The article analyzed how the CCP manages party membership and discipline.","zh":"这篇文章分析了中共如何管理党员与党纪。"}]},{"partOfSpeech":"n.","definition":{"en":"critical control point: a step in a process (especially food production) where control is essential to prevent or reduce a safety risk","zh":"关键控制点（尤指食品生产中必须加以控制的环节，用于预防或降低安全风险）"},"examples":[{"en":"Cooking chicken to the correct temperature is a CCP in food safety.","zh":"把鸡肉加热到合适的温度是食品安全中的一个关键控制点。"},{"en":"They identified several CCPs in the factory’s hygiene plan.","zh":"他们在工厂的卫生计划中识别出多个关键控制点。"}]},{"partOfSpeech":"n.","definition":{"en":"Certified Cost Professional: a professional certification in cost engineering/cost management","zh":"成本专业人士认证（成本工程/成本管理领域的职业认证之一）"},"examples":[{"en":"She earned her CCP to qualify for more senior cost-management roles.","zh":"她获得了CCP认证，以胜任更高级的成本管理岗位。"}]}],"synonyms":["Chinese Communist Party","Communist Party of China (CPC)","critical control point","Certified Cost Professional"],"phonetic":"/ˌsiː siː ˈpiː/","extraExplanation":["在英文语境里，“CCP”最常见指“中国共产党”。但在中国官方英文表述中更常用“CPC”（Communist Party of China）。不同媒体或个人选择“CCP/CPC”有时带有风格或立场差异；写作时可根据场合（学术/官方/新闻/口语）选择更中性、清晰的用法，并在首次出现时写全称以避免误解。","“CCP”也可能出现在专业领域缩写里（如食品安全、成本管理）。遇到缩写时，最好结合上下文确认具体含义。"]}
{"word":"CCR","summary":{"en":"CCR usually means “Creedence Clearwater Revival” (a U.S. rock band), but it can also be a context-specific abbreviation (e.g., in reports or internal company terms).","zh":"CCR通常指美国摇滚乐队“Creedence Clearwater Revival”，也可能是在报告或公司内部使用的特定缩写，需结合上下文理解。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abbreviation used for several different things; most commonly “Creedence Clearwater Revival” (an American rock band) or, in medicine/public health, “carbon dioxide combining power/consumption calculation-related terms” or “cumulative case rate,” depending on context.","zh":"一个缩写，可能指不同事物；最常见的是“Creedence Clearwater Revival（美国摇滚乐队）”，在医学/公共卫生语境中也可能指与检测或统计相关的术语（如累计病例率等），需结合上下文判断。"},"examples":[{"en":"My dad loves CCR—he plays their songs on road trips.","zh":"我爸很喜欢CCR——自驾旅行时他会放他们的歌。"},{"en":"In the report, CCR refers to the cumulative case rate for the past two weeks.","zh":"在这份报告里，CCR指的是过去两周的累计病例率。"}]},{"partOfSpeech":"n.","definition":{"en":"(often in organizations/HR) an abbreviation for “Career/Corporate/Change & Communications Review” or similar internal names; meaning varies by company.","zh":"（组织/人力资源中常见）可能是公司内部用语的缩写，如“职业/公司/变更与沟通评审”等；具体含义因公司而异。"},"examples":[{"en":"Please submit the proposal to CCR before Friday.","zh":"请在周五前把提案提交到CCR审核。"}]}],"synonyms":["(as a band name) Creedence Clearwater Revival"],"phonetic":"/ˌsiːˌsiːˈɑːr/","extraExplanation":["“CCR”最常见的公众含义是美国乐队 Creedence Clearwater Revival（1960–70年代），代表作包括《Have You Ever Seen the Rain?》《Bad Moon Rising》。在聊天里如果有人说“listen to CCR”，几乎肯定是在说这个乐队。","在公共卫生/统计类文章里，“CCR”有时被用作“cumulative case rate（累计病例率）”之类的缩写，但不同机构缩写习惯不完全一致，阅读时要看文章的缩写表或首次出现处的全称。"]}
{"word":"CCRP","summary":{"en":"CCRP is an acronym; most commonly it means “Continuously Computed Release Point” in military aviation, but it can also refer to various organizations depending on context.","zh":"CCRP 是一个缩写；最常见指军事航空中的“连续计算投放点”，也可能在不同语境下代表不同机构或项目。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"CCRP (Continuously Computed Release Point): a bombing/weapon-release mode in military aviation where the aircraft’s computer calculates the correct release point and the weapon is released at that computed moment.","zh":"CCRP（Continuously Computed Release Point，连续计算投放点）：军事航空中的一种投弹/武器投放模式，由机载计算机连续计算最佳投放时机，并在计算出的时刻自动/提示投放。"},"examples":[{"en":"The pilot selected CCRP to drop the bomb accurately from higher altitude.","zh":"飞行员选择CCRP，以便从较高高度更精准地投弹。"},{"en":"In CCRP mode, the system calculates the release point based on speed, altitude, and wind.","zh":"在CCRP模式下，系统会根据速度、高度和风等因素计算投放点。"}]},{"partOfSpeech":"other","definition":{"en":"CCRP: an acronym that can refer to different programs or titles depending on context (for example, the Community College Research Center in U.S. education research).","zh":"CCRP：一个会因语境不同而代表不同机构/项目/头衔的缩写（例如美国教育研究领域的 Community College Research Center，社区学院研究中心）。"},"examples":[{"en":"I found the report on the CCRP website.","zh":"我在CCRP的网站上找到了那份报告。"},{"en":"Which CCRP do you mean—aviation or an organization?","zh":"你说的CCRP是指航空术语，还是某个机构？"}]}],"phonetic":"/ˌsiː siː ɑːr ˈpiː/","extraExplanation":["CCRP 属于“首字母缩写词（acronym/initialism）”，通常读作一个个字母：C-C-R-P。它在军事航空里最常见；但在学术、政府或企业语境中也可能指不同组织或项目。若你告诉我所在领域（例如：F-16 操作、大学研究、公司文件），我可以给出最准确的释义。"]}
{"word":"CCS","summary":{"en":"CCS is an abbreviation. Most commonly it means Carbon Capture and Storage; it can also mean Customer Care/Service or (in military medicine) Combat Casualty Care, depending on context.","zh":"CCS是一个缩写。最常见指“碳捕集与封存”；也可能指“客户服务”或（军医语境）“战伤救护”，需结合上下文判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Carbon Capture and Storage (or Sequestration): a technology that captures carbon dioxide (CO₂) from factories or power plants and stores it underground to reduce greenhouse-gas emissions.","zh":"碳捕集与封存（或碳封存）：一种从工厂或发电厂捕获二氧化碳（CO₂）并将其封存在地下，以减少温室气体排放的技术。"},"examples":[{"en":"The company is investing in CCS to cut emissions from its cement plants.","zh":"这家公司正在投资CCS，以减少其水泥厂的排放。"},{"en":"Some countries use CCS as part of their climate plans.","zh":"一些国家把CCS作为其气候计划的一部分。"}]},{"partOfSpeech":"other","definition":{"en":"Customer Care/Customer Service: a department or team that helps customers with questions, problems, or returns.","zh":"客户关怀/客户服务：帮助客户处理咨询、问题或退换货的部门或团队。"},"examples":[{"en":"Please contact CCS if you need help with your order.","zh":"如果你的订单需要帮助，请联系CCS（客服）。"},{"en":"CCS will reply within 24 hours.","zh":"CCS会在24小时内回复。"}]},{"partOfSpeech":"other","definition":{"en":"In medicine/first aid (often in the military): Combat Casualty Care—emergency care for injured people in a combat setting.","zh":"医学/急救（常见于军方语境）：战伤救护——在战斗环境中对伤者进行的紧急救治。"},"examples":[{"en":"The course covers basic CCS skills like controlling bleeding.","zh":"这门课程涵盖基本的CCS技能，比如止血。"}]}],"synonyms":["carbon capture and storage","customer service","combat casualty care"],"phonetic":"/ˌsiːˌsiːˈɛs/","extraExplanation":["“CCS”是缩写，具体含义高度依赖领域与上下文：环保/能源领域最常指“碳捕集与封存”；电商或企业沟通里可能指“客户服务”；军医或应急训练里可能与战伤救护相关。","读作字母：C-C-S。写作时常全大写（CCS），正式文件里第一次出现通常会先写全称再写缩写，例如：Carbon Capture and Storage (CCS)。"]}
{"word":"CCSA","summary":{"en":"CCSA is an abbreviation with multiple possible meanings; commonly it refers to the California Charter Schools Association, but it may also appear in medical or organizational contexts.","zh":"CCSA 是一个可能有多种含义的缩写；常见指“加州特许学校协会”，也可能出现在医学或机构名称等语境中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation that can refer to different organizations or terms depending on context; one common meaning is the California Charter Schools Association.","zh":"一个缩写，会因语境不同而指代不同机构或术语；常见含义之一是“加州特许学校协会（California Charter Schools Association）”。"},"examples":[{"en":"CCSA released a report on charter school performance in California.","zh":"CCSA 发布了一份关于加州特许学校表现的报告。"},{"en":"Our district met with CCSA to discuss charter school policy.","zh":"我们学区与 CCSA 会面，讨论特许学校政策。"}]},{"partOfSpeech":"other","definition":{"en":"(Medicine) Canadian Cardiovascular Society Angina (classification): a system used to describe how severe a person’s angina (chest pain) is, often written as CCS/CCSA class I–IV.","zh":"（医学）加拿大心血管学会心绞痛分级：用于描述心绞痛（胸痛）严重程度的分级体系，常写作 CCS/CCSA I–IV 级。"},"examples":[{"en":"The doctor documented the patient as CCSA class II angina.","zh":"医生记录患者为 CCSA II 级心绞痛。"},{"en":"Her symptoms improved from CCSA class III to class I after treatment.","zh":"治疗后，她的症状从 CCSA III 级改善到 I 级。"}]},{"partOfSpeech":"other","definition":{"en":"A generic initialism used as a short label in names (e.g., departments, programs, clubs), where the exact meaning must be confirmed from the surrounding text.","zh":"一种通用的首字母缩略写法，常用作名称简写（如部门、项目、社团等）；具体含义需要结合上下文确认。"},"examples":[{"en":"Please check the email signature to see what CCSA stands for in this organization.","zh":"请查看邮件签名，确认在这个组织里 CCSA 代表什么。"},{"en":"The form mentions CCSA, but it doesn’t define the abbreviation.","zh":"表格提到 CCSA，但没有解释这个缩写。"}]}],"synonyms":["initialism","abbreviation","acronym"],"phonetic":"/ˌsiːˌsiːˌɛsˈeɪ/","extraExplanation":["缩写 CCSA 在不同领域的常见释义不止一个；要准确翻译或解释，最好提供你看到它的场景（例如：学校/教育政策文件、医学病历、公司或社团名称、表格标题等）。","如果你把出现 CCSA 的完整句子贴出来，我可以根据上下文判断最可能的含义，并给出更贴切的中文译法。"]}
{"word":"CCT","summary":{"en":"CCT most commonly means a video surveillance system (closed-circuit television). In medical contexts, it can also mean cardiac computed tomography (heart CT).","zh":"CCT最常指监控系统（闭路电视）。在医学语境中也可指心脏CT（心脏计算机断层扫描）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbreviation) closed-circuit television; a system of video cameras that sends signals to a limited set of screens for security or monitoring.","zh":"（缩写）闭路电视监控系统；通过摄像头把画面传到特定屏幕，用于安保或监看。"},"examples":[{"en":"The store installed CCT to reduce shoplifting.","zh":"这家商店安装了CCT（监控）来减少偷窃。"},{"en":"CCT footage showed what happened at the entrance.","zh":"CCT录像显示了入口处发生的情况。"},{"en":"Please note that this area is monitored by CCT.","zh":"请注意，本区域由CCT进行监控。"}]},{"partOfSpeech":"n.","definition":{"en":"(abbreviation, medical) cardiac computed tomography; a CT scan focused on the heart and coronary arteries.","zh":"（缩写，医学）心脏计算机断层扫描；针对心脏与冠状动脉的CT检查。"},"examples":[{"en":"The doctor recommended a CCT to check for blocked arteries.","zh":"医生建议做CCT来检查动脉是否堵塞。"},{"en":"CCT can help assess coronary artery disease.","zh":"CCT有助于评估冠状动脉疾病。"}]}],"synonyms":["CCTV","video surveillance","security cameras","cardiac CT"],"phonetic":"/ˌsiː siː ˈtiː/","extraExplanation":["在日常英语里，CCT最常见的含义其实是CCTV（closed-circuit television）的另一种写法或简写，但更常见、也更标准的写法通常是CCTV。医疗语境中，CCT可能指cardiac CT（心脏CT），是否采用取决于国家/医院的习惯。"]}
{"word":"CCTA","summary":{"en":"CCTA is an abbreviation most commonly meaning coronary CT angiography (a heart artery imaging test). In some contexts it can refer to UK emergency-planning terminology related to the Civil Contingencies Act.","zh":"CCTA是一个缩写，最常见指冠状动脉CT血管造影（用于观察心脏冠状动脉的检查）。在某些语境中也可能指英国与《民事应急法》相关的应急管理用语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(medical) Coronary computed tomography angiography: a heart-imaging test that uses CT scanning and contrast dye to show the coronary arteries.","zh":"（医学）冠状动脉CT血管造影：一种用CT扫描和造影剂来显示冠状动脉情况的心脏影像检查。"},"examples":[{"en":"The doctor ordered a CCTA to check for blocked coronary arteries.","zh":"医生安排做CCTA来检查冠状动脉是否堵塞。"},{"en":"CCTA can help rule out significant coronary artery disease in some patients with chest pain.","zh":"对一些胸痛患者来说，CCTA可以帮助排除明显的冠状动脉疾病。"}]},{"partOfSpeech":"other","definition":{"en":"(UK law) Civil Contingencies and/or related abbreviation used for emergency planning; sometimes used informally to refer to the Civil Contingencies Act (2004).","zh":"（英国法律/公共管理）与突发事件应急规划相关的缩写；有时口语中用来指《民事应急法》（2004年）。"},"examples":[{"en":"Local councils review their plans under the CCTA framework.","zh":"地方政府会在CCTA相关框架下审查应急预案。"},{"en":"The training covered duties set out in the CCTA for major emergencies.","zh":"培训内容涵盖了CCTA中规定的重大突发事件职责。"}]}],"synonyms":["coronary CTA","CT coronary angiography","CTA (context-dependent)"],"phonetic":"/ˌsiːˌsiːˌtiːˈeɪ/","extraExplanation":["“CCTA”最常见于医学语境，尤其是心内科/影像科，指冠状动脉CTA（coronary CTA）。在非医学领域也可能出现其他释义（如英国应急管理相关），具体含义通常需要结合上下文（医院检查单、论文、政府文件等）判断。"]}
{"word":"CCTAC","summary":{"en":"CCTAC is most commonly seen as a short DNA sequence (a motif), but it can also be an acronym whose meaning depends on context.","zh":"CCTAC 最常见的是作为一段短的 DNA 序列（序列片段/基序）出现；也可能是一个需要语境才能确定含义的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A short DNA sequence (a five-letter “motif”) made of the bases C, C, T, A, C; used in genetics/bioinformatics to describe or search for specific patterns in DNA.","zh":"一段短的 DNA 序列（5 个碱基的“序列片段/基序”），由 C、C、T、A、C 组成；在遗传学与生物信息学中用于描述或检索特定的 DNA 模式。"},"examples":[{"en":"The primer includes the motif CCTAC near its 3' end.","zh":"这个引物在 3' 端附近包含 CCTAC 这个序列片段。"},{"en":"We scanned the genome to find every occurrence of CCTAC.","zh":"我们扫描了基因组以找出所有出现 CCTAC 的位置。"}]},{"partOfSpeech":"other","definition":{"en":"An acronym/initialism that can refer to different things depending on context (e.g., an organization, program, or technical term).","zh":"一个首字母缩写/缩略词；在不同语境下可能指不同事物（如机构、项目或技术术语）。"},"examples":[{"en":"What does CCTAC stand for in your document?","zh":"在你的文件里，CCTAC 代表什么？"},{"en":"Please define CCTAC the first time you use it in the report.","zh":"请在报告中第一次出现时把 CCTAC 的全称写出来。"}]}],"synonyms":["DNA motif","sequence motif","oligonucleotide (context-dependent)"],"phonetic":"/ˈsiːsiːtæk/","extraExplanation":["如果你看到的是一串由 A/C/G/T 组成的字母（像 CCTAC），通常更像是 DNA 序列而不是英语单词；它本身不自带固定“词义”，意义取决于它出现在什么基因区域、是否是引物/探针的一部分、或是否对应某种结合位点。","如果你是把它当作缩写使用，需要具体领域/上下文（例如哪篇文章、哪个行业或哪份表格），才能确定它的全称与准确含义。你可以告诉我它出现的句子或领域，我可以帮你展开。"]}
{"word":"CCTV","summary":{"en":"CCTV most commonly means closed-circuit television (security camera monitoring). In a China/media context, it can also mean China Central Television.","zh":"CCTV最常指“闭路电视监控/监控摄像系统”。在中国媒体语境中也可指“中国中央电视台”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"closed-circuit television; a video system used to monitor places with security cameras, where the signal is sent to a limited set of screens (not broadcast publicly).","zh":"闭路电视；用于监控的摄像系统，画面只传到特定的显示设备（不向公众广播）。"},"examples":[{"en":"The store installed CCTV to reduce theft.","zh":"这家店安装了CCTV来减少偷窃。"},{"en":"CCTV footage showed the suspect entering the building at 9 p.m.","zh":"CCTV录像显示嫌疑人在晚上9点进入了大楼。"},{"en":"For safety, the parking lot is covered by CCTV cameras.","zh":"为安全起见，停车场由CCTV摄像头覆盖监控。"}]},{"partOfSpeech":"n.","definition":{"en":"China Central Television; the main state television broadcaster in China (often known today under the brand name CGTN for international channels).","zh":"中国中央电视台；中国主要的国家电视台（其国际频道常用CGTN品牌）。"},"examples":[{"en":"My grandparents watch the evening news on CCTV.","zh":"我爷爷奶奶看中央电视台的晚间新闻。"},{"en":"The documentary first aired on CCTV.","zh":"这部纪录片最初在央视播出。"}]}],"synonyms":["closed-circuit television","security cameras","surveillance cameras","video surveillance"],"phonetic":"/ˌsiːˌsiːˌtiːˈviː/","extraExplanation":["“CCTV”是缩写，读作四个字母：C-C-T-V。在安防语境里最常指“闭路电视监控”；在中文语境（尤其谈媒体）里也常指“中国中央电视台”。具体含义通常靠上下文判断。","写作时可用全称“closed-circuit television”作更正式表达；安防领域也常说“security cameras / surveillance cameras”（更口语）。"]}
{"word":"CCU","summary":{"en":"CCU is an abbreviation most commonly meaning a hospital Critical Care Unit (or Coronary Care Unit), and in climate/industry contexts it can mean Carbon Capture and Utilization.","zh":"CCU 是缩写，最常见指医院的重症监护单元（也可能指冠心监护单元）；在气候/工业语境中也可指碳捕集与利用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Critical Care Unit: a hospital department for patients who are very ill and need close monitoring and advanced life support (often similar to an ICU).","zh":"重症监护病房/重症监护单元：医院里为病情危重、需要严密监测和高级生命支持的患者提供治疗的科室（常与 ICU 含义接近）。"},"examples":[{"en":"After the surgery, he was moved to the CCU for close monitoring.","zh":"手术后，他被转到 CCU 进行严密监护。"},{"en":"Only family members were allowed to visit the CCU during certain hours.","zh":"只有家属在规定时间内可以探视 CCU。"}]},{"partOfSpeech":"n.","definition":{"en":"Coronary Care Unit: a hospital unit specializing in serious heart conditions such as heart attacks and unstable angina.","zh":"冠心病监护病房/冠状动脉监护单元：专门处理严重心脏问题（如心肌梗死、不稳定型心绞痛）的病房。"},"examples":[{"en":"The patient with chest pain was admitted to the CCU for cardiac monitoring.","zh":"这位胸痛患者被收入 CCU 做心脏监测。"},{"en":"The doctor explained that the CCU focuses on heart-related emergencies.","zh":"医生解释说，CCU 主要处理心脏相关的急症。"}]},{"partOfSpeech":"n.","definition":{"en":"Carbon Capture and Utilization: technology that captures carbon dioxide (CO₂) and uses it to make products (for example, fuels or building materials).","zh":"碳捕集与利用：将二氧化碳（CO₂）捕获并用于生产产品（如燃料或建材）的技术。"},"examples":[{"en":"The company is investing in CCU to reduce industrial emissions.","zh":"这家公司正在投资 CCU 以减少工业排放。"},{"en":"Researchers discussed CCU solutions at the climate conference.","zh":"研究人员在气候会议上讨论了 CCU 方案。"}]}],"synonyms":["ICU (for Critical Care Unit)","cardiac unit (for Coronary Care Unit)","carbon capture (related to Carbon Capture and Utilization)"],"phonetic":"ˌsiː siː ˈjuː","extraExplanation":["“CCU”是缩写，具体含义很依赖语境：在医院场景最常见是“Critical Care Unit（重症监护单元）”或“Coronary Care Unit（冠心监护单元）”。不同国家/医院可能用法不同，有的地方更常用“ICU（Intensive Care Unit）”。","发音通常按字母读（C-C-U）。写作时第一次出现建议写全称：例如“Critical Care Unit (CCU)”。","在环保与能源领域，CCU常指“Carbon Capture and Utilization（碳捕集与利用）”，与“CCS（Carbon Capture and Storage，碳捕集与封存）”相近但后续处理方式不同。"]}
{"word":"Ccuta","summary":{"en":"Cúcuta is a city in northeastern Colombia near the Venezuelan border.","zh":"Cúcuta（库库塔）是哥伦比亚东北部、靠近委内瑞拉边境的一座城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Cúcuta: a city in northeastern Colombia, near the border with Venezuela; the capital of Norte de Santander Department.","zh":"库库塔（Cúcuta）：哥伦比亚东北部城市，靠近委内瑞拉边境；北桑坦德省（Norte de Santander）的首府。"},"examples":[{"en":"Cúcuta is an important border city between Colombia and Venezuela.","zh":"库库塔是哥伦比亚与委内瑞拉之间重要的边境城市。"},{"en":"She traveled from Bogotá to Cúcuta for work.","zh":"她为了工作从波哥大去到了库库塔。"}]}],"phonetic":"/kuˈkuːtə/","extraExplanation":["你输入的“Ccuta”很可能是西班牙语地名“Cúcuta”的简写或漏掉重音符号的写法。西班牙语中常写作“Cúcuta”，带有重音符号“ú”。","库库塔因地处边境，在新闻与历史语境里常与跨境贸易、人口流动等话题一起出现。"]}
{"word":"CCV","summary":{"en":"CCV most often refers to a consonant-consonant-vowel syllable pattern in phonics; it can also (less commonly) refer to a credit card security code.","zh":"CCV最常见指自然拼读中的“辅音-辅音-元音”音节结构；也可能（较少）指信用卡安全码。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation in linguistics/phonics meaning a syllable pattern with two consonants followed by a vowel","zh":"（语言学/自然拼读）辅音-辅音-元音的音节结构（两个辅音后接一个元音）"},"examples":[{"en":"In this lesson, we practice CCV words like “play” and “tree.”","zh":"这节课我们练习CCV结构的单词，比如 play 和 tree。"},{"en":"Many English CCV syllables begin with a consonant blend, such as /pl/ or /tr/.","zh":"很多英语CCV音节以辅音连缀开头，比如 /pl/ 或 /tr/。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation sometimes used to mean a credit card’s security code (more commonly written as CVV/CVC)","zh":"（较少见）有时用来指信用卡安全码（更常写作CVV/CVC）"},"examples":[{"en":"The form asks for your CCV/CVV code to confirm the payment.","zh":"表格要求填写CCV/CVV安全码以确认付款。"}]}],"synonyms":["consonant-consonant-vowel (CCV pattern)","CVV","CVC"],"phonetic":"/ˌsiːˌsiːˈviː/","extraExplanation":["在自然拼读（phonics）里，CCV常用来帮助初学者识别“辅音连缀 + 元音”的开头结构：比如 /pl/ + /eɪ/（play）、/tr/ + /iː/（tree）。有的教材也会用CCVC、CCVCC等来表示更长的拼写结构。","在支付场景中，更标准、更常见的缩写是CVV（Visa）或CVC（Mastercard）。如果你在表格里看到CCV，多半也是在指同一个“卡背面3位（或4位）安全码”。"]}
{"word":"CCW","summary":{"en":"CCW most commonly means “counterclockwise.” In U.S. contexts, it can also refer to a concealed-carry weapon/permit.","zh":"CCW最常见指“逆时针”。在美国语境中也可指隐蔽携枪的武器/许可。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(abbrev.) counterclockwise; moving or turning in the direction opposite to a clock’s hands.","zh":"（缩写）逆时针；朝着与钟表指针相反的方向移动或旋转。"},"examples":[{"en":"Turn the knob CCW to loosen it.","zh":"逆时针（CCW）转动旋钮把它拧松。"},{"en":"The fan spins CCW when viewed from above.","zh":"从上方看，风扇是逆时针（CCW）旋转的。"}]},{"partOfSpeech":"n.","definition":{"en":"(abbrev., esp. in the U.S.) concealed-carry weapon / concealed-carry permit; related to legally carrying a hidden firearm.","zh":"（缩写，尤用于美国）隐蔽携带武器/隐蔽持枪许可；与合法隐藏携带枪支有关。"},"examples":[{"en":"Some states make it easier to apply for a CCW permit.","zh":"一些州让申请隐蔽持枪许可（CCW）更容易。"},{"en":"He took a safety class before getting his CCW.","zh":"他在取得CCW之前先上了安全课程。"}]}],"synonyms":["anticlockwise","counter-clockwise"],"phonetic":"/ˌsiː ˌsiː ˈdʌbəl juː/","extraExplanation":["“CCW”在不同领域含义差异很大。最常见的是“counterclockwise（逆时针）”，常见于机械、工程、装配说明等。","在美国语境里，“CCW”也常指与隐蔽携枪相关的许可或证件（各州法律差异大）。阅读时可根据上下文判断，例如出现“turn/rotate/loosen”多半是逆时针；出现“permit/license/state law/class”多半与隐蔽携枪有关。"]}
{"word":"ccw","summary":{"en":"CCW usually means “counterclockwise” (opposite the direction of a clock’s hands).","zh":"CCW 通常表示“逆时针”（与钟表指针方向相反）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"counterclockwise; in the direction opposite to how the hands of a clock move.","zh":"逆时针方向；与钟表指针转动方向相反。"},"examples":[{"en":"Turn the knob ccw to loosen it.","zh":"把旋钮逆时针（ccw）转动来松开它。"},{"en":"The arrow shows a ccw rotation.","zh":"箭头表示逆时针旋转。"}]},{"partOfSpeech":"adj.","definition":{"en":"moving or arranged in a counterclockwise direction.","zh":"逆时针移动的；按逆时针方向排列的。"},"examples":[{"en":"Use a ccw motion to remove the cap.","zh":"用逆时针的动作拧下瓶盖。"}]}],"synonyms":["counterclockwise","anticlockwise","CCW"],"phonetic":"/ˌkaʊnərˈklɑkˌwaɪz/","extraExplanation":["“ccw”常见于工程图纸、装配说明、数学/物理题和地图标注中，表示旋转方向（相对“cw = clockwise 顺时针”）。","英式英语里也常说“anticlockwise”，美式英语更常用“counterclockwise”。","在美国语境里，CCW有时也指“Concealed Carry Weapon/License（隐蔽携枪/持枪许可）”。阅读时要看上下文判断。"]}
{"word":"ccws","summary":{"en":"CCWs usually means multiple CCWs—most often concealed-carry weapons or concealed-carry permits, depending on context.","zh":"CCWs 通常指多个 CCW，多用于表示“隐蔽携带武器”或“隐蔽携枪许可”，需看语境确定。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) plural of CCW; commonly used to mean “concealed-carry weapons” or “concealed-carry permits,” depending on context.","zh":"（缩写）CCW 的复数形式；常指“隐蔽携带武器”或“隐蔽携枪许可/证件”，具体含义取决于语境。"},"examples":[{"en":"Some states make it easier to apply for CCWs than others.","zh":"有些州申请 CCWs（隐蔽携枪许可）更容易，有些州更难。"},{"en":"The policy explains how CCWs must be stored on school property (if allowed at all).","zh":"该政策说明了在学校场地内（如果允许的话）CCWs（隐蔽携带武器）必须如何存放。"}]}],"synonyms":["concealed-carry permits","carry permits","concealed weapons (context-dependent)"],"phonetic":"/ˌsiːˌsiːˈdʌbəl.juːz/","extraExplanation":["“CCW”原本就是缩写，口语或网络上常直接读字母；写作中第一次出现时最好先写全称（concealed-carry weapon/permit）再括号标注CCW/CCWs，以免误解。","这是与枪支/执法相关的敏感话题用语，不同地区法律与文化差异很大；在正式场合建议用更中性、明确的表达（例如 concealed-carry permit）。"]}
