{"word":"CF","summary":{"en":"CF is an abbreviation with several common meanings: “cf.” = compare/see also (in writing), and CF can also mean cystic fibrosis, center forward (soccer), or cash flow (business).","zh":"CF 是一个多义缩写：写作中“cf.”表示“参见/对照”；而大写 CF 在不同语境中也可指囊性纤维化（医学）、中锋（足球）或现金流（商业）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) used in writing to mean “compare; see also,” pointing the reader to another source or related idea.","zh":"（缩写）用于写作中表示“参见；对照”，引导读者去比较或查看相关内容。"},"examples":[{"en":"For other views on this topic, cf. Smith (2020).","zh":"关于这个主题的其他观点，参见/对照 Smith（2020）。"},{"en":"The term appears in French too; cf. the entry under “culture.”","zh":"这个词在法语中也出现；参见/对照“culture”词条。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev.) cystic fibrosis, a genetic disease that affects the lungs and digestive system.","zh":"（缩写）囊性纤维化，一种影响肺部和消化系统的遗传性疾病。"},"examples":[{"en":"She was diagnosed with CF as a child.","zh":"她小时候被诊断为囊性纤维化（CF）。"},{"en":"New treatments have improved life expectancy for people with CF.","zh":"新疗法提高了囊性纤维化（CF）患者的预期寿命。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev.) center forward, a player position in soccer/football focused on scoring goals.","zh":"（缩写）中锋（足球位置），主要负责进球与终结进攻。"},"examples":[{"en":"He plays CF for the national team.","zh":"他在国家队踢中锋（CF）。"},{"en":"The coach moved her from wing to CF.","zh":"教练把她从边锋调整到中锋（CF）。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev.) cash flow, the movement of money into and out of a business.","zh":"（缩写）现金流，资金在企业中的流入与流出情况。"},"examples":[{"en":"The company has strong CF this quarter.","zh":"这家公司本季度现金流（CF）很强。"},{"en":"We need to improve CF to pay our bills on time.","zh":"我们需要改善现金流（CF），才能按时付账。"}]}],"synonyms":["abbrev.","acronym"],"phonetic":"/ˌsiːˈɛf/","extraExplanation":["“cf.”通常用于学术写作，来自拉丁语 confer（意为“比较”）。在句中多写作小写并带点：cf.；而表示“囊性纤维化/中锋/现金流”时，常写作大写 CF，且一般不加点。","不同领域里 CF 含义差异很大，阅读时要靠上下文判断：医学语境多指 cystic fibrosis；体育报道里多指 center forward；财务/商业文本里多指 cash flow；论文注释或参考文献里常见 cf. = compare。"]}
{"word":"Cf","summary":{"en":"cf. = “compare (with)” in citations and notes.","zh":"cf. = 文献注释中表示“参照/比较”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"used in academic writing to mean “compare (with),” directing the reader to look at another source or example for comparison (not necessarily exact support).","zh":"（学术写作中）表示“参照/比较”，提示读者去看另一处资料进行对比（不一定是直接证明同一观点）。"},"examples":[{"en":"Cf. Smith (2020) for a different approach to the same problem.","zh":"参见/比较 Smith（2020），其中对同一问题提出了不同方法。"},{"en":"The motif appears in several poems; cf. the opening lines of Eliot’s “Prufrock.”","zh":"这一主题在多首诗中出现；可比较艾略特《普鲁弗洛克》开头几行。"}]}],"synonyms":["compare","see also"],"phonetic":"/ˌsiːˈɛf/","extraExplanation":["“cf.”来自拉丁语 confer，意思是“拿来对照/比较”。在论文、注释、词典条目里很常见。","用法区别：一般 “see” 更像“直接去看这个来源以获取支持/信息”；“cf.” 更强调“对比/参照”，常用于指出相似或可比较但不完全相同的内容。","书写习惯：多写作小写 “cf.”，句中常后接作者年份、章节或条目；放在句首时有时会大写为 “Cf.”。"]}
{"word":"cf","summary":{"en":"cf. is a written abbreviation meaning “compare,” directing readers to another source for comparison.","zh":"cf. 是书面缩写，表示“比较/参见”，引导读者去看另一处内容作对照。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Used in writing to mean “compare”; it tells the reader to look at another idea, text, or example for comparison (often to notice similarities or differences).","zh":"（书面语）表示“参见/比较”，提示读者去看另一个观点、文本或例子作对照（常用于发现相同或不同之处）。"},"examples":[{"en":"Some languages mark tense differently; cf. Spanish and English.","zh":"有些语言用不同方式表达时态；比较一下西班牙语和英语。"},{"en":"For a contrasting view, cf. Smith (2020).","zh":"如需对照的观点，参见 Smith（2020）。"}]}],"synonyms":["compare","see also"],"phonetic":"/ˌsiːˈɛf/","extraExplanation":["“cf.”来自拉丁语 confer，意思是“比较、对照”。常见于学术写作、注释、词典或论文参考文献中。","与“see”相比，“cf.”更强调“对照比较”，不只是让你去看相关内容；有时也暗示“可能存在差异，值得对比”。","写作中通常带句点（cf.），放在提示内容前；在中文语境可理解为“参照/对照”。"]}
{"word":"CFA","summary":{"en":"“CFA” most commonly means Chartered Financial Analyst, a well-known finance and investment certification.","zh":"“CFA”最常指“特许金融分析师”，是金融投资领域非常知名的资格认证。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(most common) Chartered Financial Analyst: a professional certification in investment and finance, awarded by the CFA Institute to people who pass exams and meet work/ethics requirements.","zh":"（最常见）特许金融分析师：由CFA协会（CFA Institute）授予的投资与金融领域专业资格认证，需要通过考试并满足工作经验与职业道德要求。"},"examples":[{"en":"She is studying for the CFA to move into asset management.","zh":"她正在备考CFA，想转到资产管理行业。"},{"en":"Many research analysts list “CFA” after their names on LinkedIn.","zh":"很多研究分析师会在领英名字后面标注“CFA”。"}]},{"partOfSpeech":"other","definition":{"en":"(less common) a short form used for different organizations/terms in specific contexts (for example, “country-of-final-assembly” in supply chains). Meaning depends on the field.","zh":"（较少见）在特定领域里表示不同机构或术语的缩写（例如供应链中的“最终组装国家”）。具体含义取决于语境。"},"examples":[{"en":"In this report, CFA means country of final assembly.","zh":"在这份报告里，CFA指最终组装国家。"}]}],"synonyms":["Chartered Financial Analyst","CFA charter","CFA designation"],"phonetic":"/si ɛf eɪ/","extraExplanation":["“CFA”在金融语境里几乎默认指“特许金融分析师”资格。常见说法：pass Level I/II/III（通过一/二/三级）、CFA charterholder（持证人）、CFA program（CFA考试项目）。写作时如果担心歧义，第一次出现可写全称“Chartered Financial Analyst (CFA)”。"]}
{"word":"CFB","summary":{"en":"CFB usually means “college football,” and sometimes specifically the top NCAA level (College Football Bowl Subdivision).","zh":"CFB 通常指“大学橄榄球”，有时特指 NCAA 最高级别（College Football Bowl Subdivision）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation most commonly used for “college football,” especially in the U.S. (often seen in sports news, schedules, and rankings).","zh":"常用缩写，最常指“大学橄榄球”（尤指美国），常见于体育新闻、赛程和排名中。"},"examples":[{"en":"I’m watching CFB on Saturday afternoon.","zh":"我周六下午要看大学橄榄球（CFB）。"},{"en":"CFB rankings come out every week during the season.","zh":"大学橄榄球赛季期间每周都会公布排名。"}]},{"partOfSpeech":"other","definition":{"en":"In particular, it can refer to the NCAA’s top level: “College Football Bowl Subdivision” (often discussed with playoffs, bowl games, and major conferences).","zh":"更具体地，也可指 NCAA 最高级别：“大学橄榄球碗赛分区”（常与季后赛、碗赛和主要联盟一起讨论）。"},"examples":[{"en":"He got scholarship offers from several CFB programs.","zh":"他收到了好几所顶级大学橄榄球项目（CFB）的奖学金邀请。"},{"en":"CFB has a postseason with bowl games.","zh":"大学橄榄球（CFB）的赛季结束后会有碗赛等季后赛。"}]}],"synonyms":["college football","FBS (in some contexts)"],"phonetic":"/ˌsiː ɛf ˈbiː/","extraExplanation":["在美国体育语境里，CFB 几乎默认是 college football（大学橄榄球）。若你看到 FBS / FCS：FBS 是更强、更商业化、与“碗赛（bowl games）”联系更紧的分区；FCS 也属于大学橄榄球，但季后赛体系不同。","在非体育场景中，CFB 也可能是其他领域的缩写（公司名、项目名等）。如果你提供一句完整语境，我可以帮你判断是哪一种意思。"]}
{"word":"CFC","summary":{"en":"CFC usually means “chlorofluorocarbon,” a chemical linked to ozone-layer damage.","zh":"CFC 通常指“氯氟烃”，一种与臭氧层破坏有关的化学物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chlorofluorocarbon: a man‑made chemical once widely used in refrigerators, air conditioners, and aerosol sprays, later found to damage the ozone layer.","zh":"氯氟烃：一种人造化学物质，曾广泛用于冰箱、空调和喷雾剂等，后来被发现会破坏臭氧层。"},"examples":[{"en":"CFCs were used in older refrigerators as a coolant.","zh":"氯氟烃曾作为制冷剂用于旧式冰箱中。"},{"en":"Many countries banned CFCs to protect the ozone layer.","zh":"许多国家为保护臭氧层而禁止使用氯氟烃。"},{"en":"This product is labeled “CFC‑free.”","zh":"这款产品标注为“无氯氟烃（CFC‑free）”。"}]}],"synonyms":["chlorofluorocarbon","CFCs","Freon (informal/common use)"],"phonetic":"/ˌsiː ɛf ˈsiː/","extraExplanation":["CFC 常见于环保与科学语境，是 “chlorofluorocarbon” 的缩写，日常读法通常按字母读（C-F-C）。","CFC 会在高空被紫外线分解，释放出的氯会催化分解臭氧，因此与“臭氧层空洞”问题密切相关。","1987 年《蒙特利尔议定书》（Montreal Protocol）推动全球逐步淘汰 CFC，这是国际环境治理中非常经典的成功案例。","“Freon（氟利昂）”常被用来泛指某些制冷剂，但它原本是商标名，不等同于所有 CFC。"]}
{"word":"cfc","summary":{"en":"CFC usually means “chlorofluorocarbon,” a chemical linked to ozone-layer damage.","zh":"CFC 通常指“氯氟烃”，一种与臭氧层破坏有关的化学物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chlorofluorocarbon: a man-made chemical (once common in aerosol sprays and refrigerators) that damages the ozone layer.","zh":"氯氟烃：一种人造化学物质（曾常用于气雾喷雾和冰箱/空调制冷剂），会破坏臭氧层。"},"examples":[{"en":"Many countries banned CFCs because they harm the ozone layer.","zh":"许多国家禁止使用CFC，因为它们会破坏臭氧层。"},{"en":"Older refrigerators may contain CFC refrigerants.","zh":"较老的冰箱可能含有CFC制冷剂。"},{"en":"The company switched from CFC-based propellants to safer alternatives.","zh":"这家公司把含CFC的推进剂改成了更安全的替代品。"}]}],"synonyms":["chlorofluorocarbon","Freon"],"phonetic":"/ˌsiː ɛf ˈsiː/","extraExplanation":["CFC 是缩写，读字母：C-F-C。最常见的含义是“氯氟烃”，在环境与化学语境中尤其常见。","CFC 曾被广泛用于制冷剂与气雾剂，但会导致臭氧层消耗；《蒙特利尔议定书》（Montreal Protocol）推动全球逐步淘汰。","在日常英语里也有人用“Freon（氟利昂）”泛指某些旧式制冷剂，但 Freon 实际上是商标名，不完全等同于所有 CFC。"]}
{"word":"CFCA","summary":{"en":"CFCA most commonly refers to China Financial Certification Authority or a digital certificate issued by it, used for secure online identity verification and e-signatures.","zh":"CFCA 通常指中国金融认证中心，或其签发的数字证书，用于线上身份认证与电子签名等安全业务。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbr.) China Financial Certification Authority — a major certificate authority (CA) in China that issues digital certificates used for identity verification, electronic signatures, and secure online transactions (especially in banking and e-government).","zh":"（缩写）中国金融认证中心（CFCA）——中国重要的数字证书认证机构（CA）之一，主要用于身份验证、电子签名与保障线上交易安全（尤其常见于银行与政务系统）。"},"examples":[{"en":"You may need a CFCA certificate to sign the online banking agreement.","zh":"你可能需要 CFCA 数字证书来签署网银协议。"},{"en":"The system supports CFCA-based electronic signatures for secure approval.","zh":"该系统支持基于 CFCA 的电子签名，用于安全审批。"}]},{"partOfSpeech":"n.","definition":{"en":"(abbr.) A CFCA certificate — a digital certificate issued by CFCA and installed in software, a USB token, or a smart card to prove a user’s identity online.","zh":"（缩写）CFCA 证书——由 CFCA 签发的数字证书，可安装在软件、U 盾/USB Key 或智能卡中，用于在线证明用户身份。"},"examples":[{"en":"Please insert your USB token and select the CFCA certificate.","zh":"请插入你的 U 盾，并选择 CFCA 证书。"},{"en":"My CFCA certificate expired, so I can’t submit the form.","zh":"我的 CFCA 证书过期了，所以无法提交表单。"}]}],"synonyms":["China Financial Certification Authority","CA (certificate authority)","digital certificate","e-signature certificate"],"phonetic":"/ˌsiːˌɛfˌsiːˈeɪ/","extraExplanation":["CFCA 常见于中国的银行、证券、企业网银与一些政务平台，用来做“强身份认证”和“电子签名”。在中文界面里你可能会看到“CFCA 安全控件/证书/USB Key”等字样。","读法通常按字母读：C-F-C-A（类似“see-eff-see-ay”）。如果你指的是别的领域里的 CFCA（不同组织/术语也可能用同一缩写），告诉我具体场景，我可以按上下文解释。"]}
{"word":"CFCs","summary":{"en":"CFCs are chlorofluorocarbons—man-made chemicals once used in cooling and aerosol products, later restricted because they damage the ozone layer.","zh":"CFCs指氯氟烃：曾用于制冷与喷雾等的人造化学物质，因会破坏臭氧层而被严格限制/逐步淘汰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"chlorofluorocarbons: a group of man-made chemicals once widely used in refrigerators, air conditioners, aerosol sprays, and foam-making, later found to damage the Earth’s ozone layer.","zh":"氯氟烃（复数）：一类人造化学物质，曾广泛用于冰箱、空调、喷雾剂和发泡材料；后来发现会破坏地球臭氧层。"},"examples":[{"en":"In the 1980s, scientists showed that CFCs were harming the ozone layer.","zh":"20世纪80年代，科学家证明CFCs正在破坏臭氧层。"},{"en":"Many countries banned or strictly limited CFCs in aerosol products.","zh":"许多国家禁止或严格限制在气雾产品中使用CFCs。"},{"en":"Older refrigerators may contain CFCs, so they must be disposed of safely.","zh":"较旧的冰箱可能含有CFCs，因此必须安全处理。"}]},{"partOfSpeech":"n.","definition":{"en":"the plural abbreviation for CFC (chlorofluorocarbon).","zh":"CFC（chlorofluorocarbon，氯氟烃）的复数缩写形式。"},"examples":[{"en":"This report compares CO2 emissions and CFCs in the atmosphere.","zh":"这份报告比较了大气中的二氧化碳排放与CFCs。"},{"en":"CFCs are measured in parts per trillion in some studies.","zh":"在一些研究中，CFCs以万亿分之一（ppt）的单位测量。"}]}],"synonyms":["chlorofluorocarbons","CFC (singular)"],"phonetic":"/ˌsiː ɛf ˈsiːz/","extraExplanation":["“CFCs”常在环保与科普语境出现，核心关联是“臭氧层空洞”。CFCs在平流层被紫外线分解后，会释放氯原子，催化分解臭氧（O₃），导致更多紫外线到达地表。","国际上最著名的政策背景是《蒙特利尔议定书》（1987年），推动全球逐步淘汰CFCs；后来不少用途改用对臭氧层影响更小的替代物（如HFCs等，但它们又可能与温室效应相关）。","读法上，“CFCs”通常按字母读：C-F-C(s)；写作上常见于科学报道与法规文件。"]}
{"word":"CFD","summary":{"en":"CFD most commonly means either computational fluid dynamics (engineering simulations of fluid flow) or contract for difference (a leveraged trading instrument).","zh":"CFD最常见有两种意思：计算流体力学（工程中的流体仿真）或差价合约（带杠杆的交易工具）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(computational fluid dynamics) the use of computer models to simulate how liquids and gases flow, often for engineering and science.","zh":"（计算流体力学）用计算机模型模拟液体和气体如何流动的方法，常用于工程与科学研究。"},"examples":[{"en":"Engineers used CFD to test the airflow around the new car design.","zh":"工程师用CFD来测试新车型周围的气流。"},{"en":"CFD simulations can predict pressure and temperature changes inside a pipe.","zh":"CFD模拟可以预测管道内压力和温度的变化。"}]},{"partOfSpeech":"n.","definition":{"en":"(contract for difference) a financial product where you trade on price movements of an asset without owning it, paying the difference between opening and closing prices.","zh":"（差价合约）一种金融产品：不实际持有资产，只交易其价格涨跌，结算开仓与平仓价格的差额。"},"examples":[{"en":"Some traders use CFDs to speculate on oil prices.","zh":"一些交易者用差价合约（CFDs）来投机原油价格。"},{"en":"CFD trading can involve high risk because of leverage.","zh":"差价合约交易可能因杠杆而风险较高。"}]}],"synonyms":["computational fluid dynamics","contract for difference"],"phonetic":"ˌsiː ˌɛf ˈdiː","extraExplanation":["CFD是缩写，具体含义高度依赖语境：在工程/科研文章里几乎总是“计算流体力学”；在投资交易平台或金融新闻里常指“差价合约”。遇到CFD时，优先看上下文关键词：如flow/airfoil/mesh/solver → 计算流体力学；如broker/leverage/spread → 差价合约。"]}
{"word":"cfd","summary":{"en":"CFD most commonly means Computational Fluid Dynamics (engineering simulations), and in finance it can mean Contract for Difference (a derivatives trading product).","zh":"CFD 最常见指“计算流体力学”（工程仿真）；在金融语境中也可指“差价合约”（一种衍生品交易）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Computational Fluid Dynamics: the use of computer calculations to simulate how fluids (like air or water) move and interact with surfaces.","zh":"计算流体力学：用计算机数值计算来模拟流体（如空气、水）的流动，以及它们与物体表面相互作用的学科/方法。"},"examples":[{"en":"Engineers used CFD to predict airflow around the airplane wing.","zh":"工程师用 CFD 来预测飞机机翼周围的气流。"},{"en":"CFD simulations helped optimize the design before building a prototype.","zh":"CFD 仿真帮助在制作原型前优化设计。"}]},{"partOfSpeech":"n.","definition":{"en":"Contract for Difference: a financial product where you trade based on the price movement of an asset without owning it.","zh":"差价合约：一种金融衍生品，根据资产价格涨跌进行交易，但并不实际持有该资产。"},"examples":[{"en":"Some traders use CFDs to speculate on stock prices without buying the shares.","zh":"一些交易者用差价合约（CFDs）来投机股票价格，而不买入股票。"},{"en":"CFDs can be risky because leverage may amplify losses.","zh":"差价合约可能风险较高，因为杠杆会放大亏损。"}]}],"synonyms":["computational fluid dynamics","contract for difference"],"phonetic":"/ˌsiː ˌɛf ˈdiː/","extraExplanation":["“CFD”是缩写，具体含义非常依赖领域语境：在工程/航空/机械等语境里最常指“计算流体力学”；在投资交易语境（尤其是英国、欧洲等市场）常指“差价合约”。如果你告诉我句子或领域，我可以帮你精准判断。"]}
{"word":"CFE","summary":{"en":"CFE is an abbreviation with several meanings; most commonly it means Certified Fraud Examiner, but it can also mean Customer-Furnished Equipment, Call for Evidence, or Cash Flow to Equity depending on context.","zh":"CFE是一个多义缩写；最常见指“注册舞弊审查师（Certified Fraud Examiner）”，也可能指“客户自备设备”“征求证据/意见”或“股权现金流”，需结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Certified Fraud Examiner: a professional credential for people trained to detect and investigate fraud.","zh":"注册舞弊审查师：一种职业资格认证，面向接受过识别与调查欺诈培训的专业人士。"},"examples":[{"en":"She became a CFE to work on fraud investigations in banking.","zh":"她取得了CFE资格，用于在银行从事欺诈调查。"},{"en":"Our company hired a CFE to review the suspicious expense reports.","zh":"公司聘请了一位CFE来审查可疑的报销单。"}]},{"partOfSpeech":"other","definition":{"en":"Customer-Furnished Equipment: equipment provided by the customer (often in telecom or IT) rather than by the service provider.","zh":"客户自备设备：由客户自行提供的设备（常见于电信或IT领域），而非由服务商提供。"},"examples":[{"en":"The internet service works with CFE, but the customer must configure the router.","zh":"该网络服务支持CFE，但客户需要自行配置路由器。"}]},{"partOfSpeech":"other","definition":{"en":"Call for Evidence: an invitation (often by a government or organization) for the public to submit information, opinions, or data on an issue.","zh":"征求证据/意见：政府或机构邀请公众就某一议题提交信息、观点或数据。"},"examples":[{"en":"The agency issued a CFE on online safety to gather public feedback.","zh":"该机构就网络安全发布了CFE，以收集公众反馈。"}]},{"partOfSpeech":"other","definition":{"en":"Cash Flow to Equity: the cash available to a company’s shareholders after expenses, reinvestment, and debt payments.","zh":"股权现金流：企业在支付费用、再投资和偿还债务后，可分配给股东的现金。"},"examples":[{"en":"Analysts estimated CFE to value the company’s stock.","zh":"分析师用CFE来评估公司的股票价值。"}]}],"synonyms":["acronym","initialism","credential","certification"],"phonetic":"/ˌsiː ɛf ˈiː/","extraExplanation":["“CFE”是缩写，在不同领域含义差异很大。最常见的一种（尤其在求职、简历、审计与合规语境中）是“Certified Fraud Examiner”，通常与ACFE（Association of Certified Fraud Examiners，注册舞弊审查师协会）相关。","当你在邮件、报告或合同里看到CFE时，最稳妥的做法是看上下文：金融/审计更可能指资格证；电信/IT更可能指客户自备设备；政府政策文件里更可能指征求证据。"]}
{"word":"CFF","summary":{"en":"CFF is an abbreviation with multiple meanings; commonly “Critical Flicker Fusion (frequency)” in vision science, or “Call for Fire” in the military.","zh":"CFF 是一个多义缩写；常见含义包括视觉科学中的“临界闪烁融合（频率）”，以及军事中的“请求火力支援（Call for Fire）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for different things depending on the field; often used to mean “Critical Flicker Fusion (frequency)” in vision science (the point where a flickering light is perceived as steady).","zh":"缩写：含义取决于领域；在视觉科学中常指“临界闪烁融合（频率）”，即闪烁的光在人眼中看起来变成连续不闪烁的阈值。"},"examples":[{"en":"In the experiment, we measured participants’ CFF to estimate visual processing speed.","zh":"在实验中，我们测量参与者的 CFF，用来估计视觉处理速度。"},{"en":"A higher CFF usually means the flicker is harder to notice.","zh":"CFF 越高，通常表示越不容易察觉闪烁。"}]},{"partOfSpeech":"other","definition":{"en":"(military) “Call for Fire,” a request for artillery or mortar fire support.","zh":"（军事）“Call for Fire”，指请求炮兵/迫击炮火力支援。"},"examples":[{"en":"The forward observer sent a CFF with the target coordinates.","zh":"前沿观察员发出 CFF，并提供目标坐标。"},{"en":"They practiced writing a CFF quickly and clearly.","zh":"他们练习快速、清晰地撰写 CFF。"}]},{"partOfSpeech":"other","definition":{"en":"(computing, less common) can refer to a file format or internal company/system term (meaning varies by organization).","zh":"（计算机领域，较少见）可能指某种文件格式或公司/系统内部术语（含义因机构而异）。"},"examples":[{"en":"This tool exports the report as a CFF file in our system.","zh":"这个工具会在我们的系统里把报告导出为 CFF 文件。"},{"en":"Ask your team what CFF stands for in this project.","zh":"在这个项目里，最好问问团队 CFF 具体指什么。"}]}],"phonetic":"/si ɛf ɛf/","extraExplanation":["“CFF”是高度依赖语境的缩写：同一个缩写在不同学科/行业可能完全不同。写作或沟通时，第一次出现通常需要先写全称（例如：critical flicker fusion, CFF），以避免误解。"]}
{"word":"cfh","summary":{"en":"“CFH” is an abbreviation; most often it means cubic feet per hour (air/gas flow rate), but in finance it can mean cash flow hedge.","zh":"“CFH”是缩写；最常见指每小时立方英尺（空气/气体流量），在金融中也可能指现金流量套期保值。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation used in different fields; most commonly it means “cubic feet per hour,” a unit for measuring airflow or gas flow rate.","zh":"一个在不同领域使用的缩写；最常见的意思是“每小时立方英尺（cubic feet per hour）”，用于测量空气或气体的流量/风量。"},"examples":[{"en":"This air purifier is rated at 200 CFH, so it can move 200 cubic feet of air per hour.","zh":"这台空气净化器标称 200 CFH，意思是每小时可以处理/输送 200 立方英尺的空气。"},{"en":"Check the furnace manual to see the recommended CFH for ventilation.","zh":"查看炉子的说明书，看看通风所建议的 CFH（风量/流量）是多少。"}]},{"partOfSpeech":"other","definition":{"en":"In finance/accounting contexts, CFH can mean “cash flow hedge,” a hedging strategy to reduce the risk of changes in future cash flows.","zh":"在金融/会计语境中，CFH 也可能指“现金流量套期保值（cash flow hedge）”，一种用来降低未来现金流波动风险的对冲方式。"},"examples":[{"en":"The company designated the swap as a CFH to reduce exposure to interest-rate changes.","zh":"公司将该掉期指定为 CFH，以降低利率变化带来的风险敞口。"},{"en":"CFH accounting can affect when gains and losses appear in earnings.","zh":"CFH 的会计处理会影响收益和损失何时计入利润表。"}]}],"synonyms":["cu ft/hr (for airflow)","airflow rate (general)","cash flow hedge (finance term)"],"phonetic":"/siː ɛf eɪtʃ/","extraExplanation":["“CFH”属于缩写，具体含义高度依赖场景（暖通空调/通风、气体设备、财务报表等）。如果你告诉我它出现在哪里（比如说明书、聊天、论文、报表），我可以给出更准确的释义和用法。","读法通常按字母念：C-F-H（美式常说“see-eff-aitch”）。"]}
{"word":"CFHT","summary":{"en":"CFHT is an acronym for the Canada–France–Hawaii Telescope, an important research telescope in Hawaiʻi.","zh":"CFHT 是 Canada–France–Hawaii Telescope（加拿大—法国—夏威夷望远镜）的缩写，是位于夏威夷的重要科研望远镜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Canada–France–Hawaii Telescope: a large optical/infrared astronomical telescope used for research, located on Mauna Kea in Hawaiʻi.","zh":"加拿大—法国—夏威夷望远镜：一座用于天文研究的大型光学/红外望远镜，位于夏威夷的莫纳克亚山（Mauna Kea）。"},"examples":[{"en":"The team used CFHT data to study distant galaxies.","zh":"研究团队使用 CFHT 的数据来研究遥远的星系。"},{"en":"Images from CFHT helped astronomers map dark matter through gravitational lensing.","zh":"来自 CFHT 的图像帮助天文学家通过引力透镜效应绘制暗物质分布。"}]}],"synonyms":["Canada–France–Hawaii Telescope"],"phonetic":"/ˌsiː ɛf eɪtʃ ˈtiː/","extraExplanation":["CFHT 通常在学术论文、天文台数据发布与新闻稿中作为缩写使用，完整名称为 Canada–France–Hawaii Telescope，体现了早期由加拿大、法国与夏威夷相关机构合作建设与运营的背景。","它是一台 3.6 米口径的望远镜，位于 Mauna Kea 山顶附近。该地点因高海拔、空气干燥、光污染较少而适合观测，但也与当地原住民文化与土地使用议题有关，相关讨论在当代具有文化与社会敏感性。"]}
{"word":"CFI","summary":{"en":"CFI is an abbreviation most commonly meaning Certified Flight Instructor (aviation) or Cash Flow from Investing (finance), depending on context.","zh":"CFI 是一个缩写，最常见指（航空）认证飞行教员或（财务）投资活动现金流，具体含义取决于语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Aviation) Certified Flight Instructor: a person officially qualified to teach others how to fly an aircraft.","zh":"（航空）认证飞行教员：获得官方资格、可以教授他人驾驶飞机的人。"},"examples":[{"en":"My goal is to become a CFI after I finish my commercial pilot training.","zh":"我的目标是在完成商用飞行员训练后成为一名 CFI（认证飞行教员）。"},{"en":"The CFI corrected my landing technique and explained the crosswind procedure.","zh":"CFI 纠正了我的着陆动作，并讲解了侧风操作流程。"}]},{"partOfSpeech":"n.","definition":{"en":"(Finance/Accounting) Cash Flow from Investing: the part of a company’s cash flow statement that shows cash spent on or received from investments (like buying equipment or selling assets).","zh":"（金融/会计）投资活动现金流：现金流量表中反映与投资相关的现金支出或流入（如购买设备、出售资产）的一部分。"},"examples":[{"en":"The company’s CFI was negative because it invested heavily in new factories.","zh":"公司的 CFI 为负，因为它大量投资建设新工厂。"},{"en":"Analysts compared CFO, CFI, and CFF to understand where the cash was going.","zh":"分析师比较了 CFO、CFI 和 CFF，以了解现金流向。"}]},{"partOfSpeech":"other","definition":{"en":"(General) An abbreviation with other meanings depending on the field (for example, in medicine, education, or computing).","zh":"（通用）在不同领域可能代表不同含义的缩写（例如医学、教育或计算机领域）。"},"examples":[{"en":"In this report, CFI stands for a specific index, so check the glossary.","zh":"在这份报告里，CFI 代表某个特定指数，所以要查看术语表。"}]}],"synonyms":["C-F-I (spelling-out pronunciation)"],"phonetic":"/ˌsiː ɛf ˈaɪ/","extraExplanation":["“CFI”是高度依赖语境的缩写：在航空圈最常见是 Certified Flight Instructor；在财务报表里常见是 Cash Flow from Investing。遇到不确定时，可以问：Which CFI do you mean—aviation or finance?（你指的是航空还是财务？）","发音通常按字母读：C-F-I。写作中第一次出现，正式文本常用“全称（CFI）”的格式：Certified Flight Instructor (CFI)。"]}
{"word":"cfi","summary":{"en":"CFI is an abbreviation that most commonly means Chief Flight Instructor or Cash Flow from Investing, but it can also mean Control Flow Integrity or Corporate Finance Institute depending on context.","zh":"CFI是一个缩写，最常见指“首席飞行教官”或“投资活动现金流”，也可能指“控制流完整性”或“Corporate Finance Institute”，需结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) Chief Flight Instructor (the senior instructor at a flight school who oversees flight training and other instructors).","zh":"（缩写）首席飞行教官（飞行学校中负责统筹飞行训练与管理教官的资深教员）。"},"examples":[{"en":"She works as a CFI at the local flight school.","zh":"她在当地飞行学校担任首席飞行教官（CFI）。"},{"en":"Ask the CFI to review your training plan before your checkride.","zh":"在你参加飞行考试（checkride）前，请CFI审核你的训练计划。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev., finance/accounting) Cash Flow from Investing (the part of a cash flow statement that shows money spent on or received from investments like equipment or securities).","zh":"（缩写，财务/会计）投资活动现金流（现金流量表中反映购买/出售设备、证券等投资相关现金收支的部分）。"},"examples":[{"en":"The company reported negative CFI because it bought new equipment.","zh":"公司因购买新设备而出现负的投资活动现金流（CFI）。"},{"en":"Strong CFI can come from selling assets, but it may not be sustainable.","zh":"强劲的CFI可能来自出售资产，但未必可持续。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev., cybersecurity) Control Flow Integrity (a security technique that prevents a program’s execution from being redirected in unauthorized ways).","zh":"（缩写，网络安全）控制流完整性（一种安全技术，用来防止程序执行流程被未授权地劫持/重定向）。"},"examples":[{"en":"The compiler can add CFI checks to reduce exploit risk.","zh":"编译器可以加入CFI检查来降低被利用的风险。"},{"en":"CFI helps defend against certain code-reuse attacks.","zh":"CFI有助于防御某些代码复用类攻击。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev., education/finance) Corporate Finance Institute (a company/brand known for online finance courses and certificates).","zh":"（缩写，教育/金融）Corporate Finance Institute（提供在线金融课程与证书的机构/品牌）。"},"examples":[{"en":"He completed a CFI financial modeling course.","zh":"他完成了CFI的财务建模课程。"},{"en":"CFI certificates are popular with some finance job seekers.","zh":"一些求职者会选择CFI证书来提升竞争力。"}]}],"synonyms":["abbrev.","initialism"],"phonetic":"ˌsiː ɛf ˈaɪ","extraExplanation":["“CFI”是首字母缩写，在不同领域含义差异很大（航空、财务报表、网络安全、培训机构等）。如果你告诉我你看到它的句子或领域（例如：飞行训练/现金流量表/安全论文/课程网站），我可以只解释最相关的那个意思，并补充更贴切的例句。"]}
{"word":"CFL","summary":{"en":"CFL most commonly means the Canadian Football League or a compact fluorescent lamp, depending on the context.","zh":"CFL最常见的意思是“加拿大橄榄球联盟”或“紧凑型荧光灯（节能灯）”，具体看语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Canadian Football League (a professional football league in Canada).","zh":"加拿大橄榄球联盟（加拿大的职业橄榄球联赛）。"},"examples":[{"en":"He watches CFL games on weekends.","zh":"他周末会看CFL的比赛。"},{"en":"She bought tickets for the CFL playoff game.","zh":"她买了CFL季后赛的门票。"}]},{"partOfSpeech":"n.","definition":{"en":"compact fluorescent lamp (an energy-saving light bulb, common before LEDs became widespread).","zh":"紧凑型荧光灯（节能灯；在LED普及前很常见的一种灯泡）。"},"examples":[{"en":"This CFL bulb uses less electricity than an old incandescent bulb.","zh":"这种CFL节能灯比老式白炽灯更省电。"},{"en":"Please recycle CFLs properly because they contain a small amount of mercury.","zh":"请正确回收CFL灯泡，因为它们含有少量汞。"}]}],"synonyms":["Canadian Football League","compact fluorescent lamp"],"phonetic":"/ˌsiː ɛf ˈɛl/","extraExplanation":["“CFL”是首字母缩略词，不同领域含义不同。日常英语里最常见的是“Canadian Football League”（体育新闻、加拿大语境）和“compact fluorescent lamp”（家居/照明、节能话题）。","读字母时通常逐个读：C-F-L。写作中第一次出现时，正式场合常先写全称再括号注明缩写：Canadian Football League (CFL)。"]}
{"word":"cfm","summary":{"en":"“CFM” most often means “cubic feet per minute,” a measure of airflow; in casual texting it can also mean “confirm/confirmed.”","zh":"“CFM”最常见意思是“每分钟立方英尺”，用于表示风量；在非正式聊天中也可表示“确认/已确认”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) cubic feet per minute: a unit for measuring airflow (how much air moves each minute). Common in HVAC, fans, and ventilation.","zh":"（缩写）每分钟立方英尺：衡量气流量的单位（每分钟空气流动多少）。常见于暖通空调、风扇与通风领域。"},"examples":[{"en":"This bathroom fan is rated at 80 CFM.","zh":"这台浴室排风扇的额定风量是每分钟 80 立方英尺（80 CFM）。"},{"en":"Higher CFM usually means more airflow, but it can also be louder.","zh":"更高的 CFM 通常意味着更大的风量，但也可能更吵。"}]},{"partOfSpeech":"other","definition":{"en":"(informal abbr.) confirm / confirmed; used in texts or chats to mean “OK, I confirm.”","zh":"（非正式缩写）confirm / confirmed；用于短信或聊天中，表示“确认/收到/没问题”。"},"examples":[{"en":"7 pm dinner—CFM?","zh":"晚上七点吃饭——确认吗（CFM）？"},{"en":"CFM. See you there.","zh":"确认。到时见。"}]}],"synonyms":["airflow rate","cubic feet per minute","confirm","confirmed"],"phonetic":"/ˌsiː ɛf ˈɛm/","extraExplanation":["在工程/家电语境里，CFM 常出现在空调（HVAC）、抽油烟机、浴室排风扇、电脑机箱风扇等参数表中，用来比较“风量”。在日常聊天里，CFM 作为“confirm(ed)”的缩写相对小众，可能更常见的是“confirm/confirmed”直接写全或用“ok/sg”等。"]}
{"word":"CFO","summary":{"en":"CFO means Chief Financial Officer, the executive in charge of a company’s financial management and strategy.","zh":"CFO指首席财务官，负责公司财务管理与财务战略的高管。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Chief Financial Officer: the top executive responsible for a company’s finances (such as budgeting, accounting, financial reporting, cash flow, fundraising, and financial strategy).","zh":"首席财务官：公司负责财务工作的最高管理者（如预算、会计、财务报告、现金流、融资与财务战略）。"},"examples":[{"en":"Our CFO will present the quarterly earnings report tomorrow.","zh":"我们的CFO明天将汇报季度财报。"},{"en":"The CEO asked the CFO to cut costs and improve cash flow.","zh":"CEO要求CFO削减成本并改善现金流。"},{"en":"She worked as CFO of a tech startup before joining a bank.","zh":"她曾在一家科技初创公司担任CFO，之后加入了一家银行。"}]}],"synonyms":["Chief Financial Officer","finance director (varies by country/company)","head of finance"],"phonetic":"/ˌsiː.ɛfˈoʊ/","extraExplanation":["在美国职场中，CFO常与CEO（首席执行官）、COO（首席运营官）并列为“C-suite（高管层）”。","在不同公司规模里，CFO的侧重点可能不同：大型上市公司更强调财务合规、审计与对外披露；初创公司更强调融资、现金流管理与商业模型的财务规划。","口语里常直接说“the CFO”（读作字母），也有人会说“Chief Financial Officer”以显得更正式。"]}
{"word":"CFP","summary":{"en":"CFP commonly means either Certified Financial Planner® (finance) or Call for Papers (academia).","zh":"CFP常见含义有两种：金融领域的“注册金融理财师”认证，或学术领域的“征稿启事”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(finance) Certified Financial Planner®—a professional certification for financial planners, especially in the U.S.","zh":"（金融）注册金融理财师（Certified Financial Planner®）——一种专业理财规划师认证（尤指美国）。"},"examples":[{"en":"She is a CFP and helps clients plan for retirement.","zh":"她是CFP，帮助客户做退休规划。"},{"en":"I’m meeting with a CFP to review my investments and insurance.","zh":"我将和一位CFP见面，复盘我的投资和保险。"}]},{"partOfSpeech":"other","definition":{"en":"(academia) Call for Papers—an announcement inviting researchers to submit papers to a conference or journal.","zh":"（学术）征稿启事（Call for Papers）——邀请研究者向会议或期刊投稿的公告。"},"examples":[{"en":"The conference CFP is open until March 1.","zh":"该会议的CFP（征稿）开放至3月1日。"},{"en":"Please read the CFP carefully before submitting your abstract.","zh":"提交摘要前请仔细阅读CFP（征稿说明）。"}]}],"synonyms":["Certified Financial Planner®","Call for Papers"],"phonetic":"/ˌsiː ɛf ˈpiː/","extraExplanation":["在美国语境里，CFP最常指理财规划领域的专业认证（Certified Financial Planner®）。它通常意味着持证人完成规定课程、通过考试，并遵守职业道德与继续教育要求。","在学术圈里，CFP常见于会议官网或邮件中，后面会列主题范围（topics）、投稿格式、重要日期（deadlines）等。阅读CFP时要特别关注截止时间、字数/模板、以及是否双盲评审（double-blind review）。"]}
{"word":"CFR","summary":{"en":"CFR is an abbreviation that most commonly means the U.S. Code of Federal Regulations; it can also mean Cost and Freight (trade terms) or case fatality rate (public health).","zh":"CFR是一个缩写，最常见指美国《联邦法规汇编》；也可指外贸术语“成本加运费”，或公共卫生中的“病死率”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(U.S. law) Code of Federal Regulations: the official collection of rules (regulations) made by U.S. federal government agencies.","zh":"（美国法律）《联邦法规汇编》：美国联邦政府各机构制定并正式汇编的规章制度。"},"examples":[{"en":"The new safety requirements are listed in the CFR.","zh":"新的安全要求列在《联邦法规汇编》（CFR）中。"},{"en":"Our compliance team checks the CFR for updates.","zh":"我们的合规团队会查看CFR是否有更新。"}]},{"partOfSpeech":"n.","definition":{"en":"(International trade) Cost and Freight: an Incoterm meaning the seller pays the cost of goods and ocean freight to the destination port (but risk usually transfers earlier).","zh":"（国际贸易）成本加运费：一项国际贸易术语，通常指卖方承担货物成本及海运费至目的港（但风险一般会在更早阶段转移）。"},"examples":[{"en":"They offered the shipment on CFR Shanghai terms.","zh":"他们按CFR上海条款报价。"},{"en":"Under CFR, the seller pays the freight to the port of destination.","zh":"在CFR条件下，卖方支付到目的港的运费。"}]},{"partOfSpeech":"n.","definition":{"en":"(Public health) Case fatality rate: the percentage of people with a disease who die from it.","zh":"（公共卫生）病死率：患某种疾病的人中死亡的比例。"},"examples":[{"en":"The CFR was higher in older patients.","zh":"老年患者的病死率（CFR）更高。"},{"en":"Researchers compared the CFR across different outbreaks.","zh":"研究人员比较了不同疫情中的病死率（CFR）。"}]}],"synonyms":["Code of Federal Regulations","Cost and Freight","case fatality rate"],"phonetic":"/ˌsiː ɛf ˈɑːr/","extraExplanation":["“CFR”多用于书面或专业语境，读作字母：C-F-R。具体含义要看领域：法律合规最常见的是《联邦法规汇编》；外贸单证/报价常见的是Incoterms里的CFR；医学/流行病学报告里常见的是case fatality rate（病死率）。","外贸里CFR与“CIF（Cost, Insurance and Freight，成本、保险加运费）”常被一起比较：CIF比CFR多了保险责任。实际风险转移点与运输方式、合同约定有关，学习时建议同时看Incoterms解释。"]}
{"word":"cfs","summary":{"en":"CFS is a common abbreviation that can mean Chronic Fatigue Syndrome, cubic feet per second (flow rate), or cash flow statement, depending on context.","zh":"CFS 是常见缩写，依语境可指：慢性疲劳综合征、立方英尺每秒（流量单位）或现金流量表。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) Chronic Fatigue Syndrome: a long-term illness that causes extreme tiredness and other symptoms, often called ME/CFS.","zh":"（医学）慢性疲劳综合征：一种长期疾病，会导致极度疲劳及其他症状，常与 ME/CFS 连用。"},"examples":[{"en":"She was diagnosed with CFS after months of severe exhaustion.","zh":"在经历了数月严重乏力后，她被诊断为 CFS（慢性疲劳综合征）。"},{"en":"Researchers are studying treatments for ME/CFS.","zh":"研究人员正在研究 ME/CFS 的治疗方法。"}]},{"partOfSpeech":"n.","definition":{"en":"(science/engineering) Cubic feet per second: a unit used to measure the flow rate of water, especially in rivers and dams.","zh":"（理工/水文）立方英尺每秒：用于衡量水流流量的单位，常见于河流与水坝数据。"},"examples":[{"en":"The river is running at 8,000 CFS after the storm.","zh":"暴风雨后，这条河的流量达到每秒 8,000 立方英尺（CFS）。"},{"en":"The dam released water at 2,500 CFS.","zh":"水坝以 2,500 CFS 的流量泄洪。"}]},{"partOfSpeech":"n.","definition":{"en":"(business) Cash Flow Statement: a financial report showing how money moves in and out of a company.","zh":"（商业/会计）现金流量表：展示公司现金流入与流出的财务报表。"},"examples":[{"en":"Check the CFS to see whether the company can pay its bills.","zh":"查看 CFS（现金流量表），看公司是否付得起账单。"},{"en":"Our accountant prepared the CFS for the quarterly report.","zh":"我们的会计为季度报告准备了 CFS。"}]}],"synonyms":["ME/CFS (medical)","chronic fatigue syndrome (medical)","ft³/s (flow unit)","cash flow statement (finance)"],"phonetic":"/siː ɛf ɛs/","extraExplanation":["“CFS”是缩写，具体含义高度依赖语境：医疗讨论中最常指 Chronic Fatigue Syndrome；水文/工程报告里常指 cubic feet per second；财务语境里可能指 cash flow statement。阅读时可根据周围词（如 symptoms/diagnosed；river/dam/flow；financial report/accountant）来判断。","医学上现在常写作“ME/CFS”（myalgic encephalomyelitis/chronic fatigue syndrome），以涵盖更广的症状与研究用语。"]}

