{"word":"CG","summary":{"en":"CG usually means computer graphics or computer-generated (especially in film and games).","zh":"CG通常指电脑图形或计算机生成的内容（尤其用于影视和游戏）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"computer graphics; images created or edited using a computer, especially in movies, games, and design","zh":"电脑图形；（尤指电影、游戏、设计中的）计算机生成/处理的图像"},"examples":[{"en":"The movie uses a lot of CG to create the monsters.","zh":"这部电影用了很多CG来制作怪兽。"},{"en":"She studies CG and 3D modeling at school.","zh":"她在学校学习CG和3D建模。"}]},{"partOfSpeech":"adj.","definition":{"en":"an abbreviation for “computer-generated,” describing something made by a computer (often images or effects)","zh":"“computer-generated”的缩写；指“计算机生成的”（常用于画面或特效）"},"examples":[{"en":"The background is CG, but the actors are real.","zh":"背景是CG的，但演员是真人。"},{"en":"Some fans prefer less CG and more practical effects.","zh":"有些粉丝更喜欢少用CG、多用实拍特效。"}]},{"partOfSpeech":"n.","definition":{"en":"an abbreviation used in some contexts for “caregiver” (less common)","zh":"在某些语境中指“照护者/看护者”（不太常见）"},"examples":[{"en":"Please list the CG’s phone number on the form.","zh":"请在表格上填写照护者（CG）的电话号码。"}]}],"synonyms":["computer graphics","computer-generated imagery","CGI"],"phonetic":"ˌsiː ˈdʒiː","extraExplanation":["“CG”在影视/游戏里最常见，常与“VFX（视觉特效）”一起出现：CG更强调“由电脑生成的画面/元素”，VFX更强调“把特效融入镜头的整体制作”。有时人们也会把CG直接当作“特效”的泛称。"]}
{"word":"cg","summary":{"en":"“CG” most often means computer graphics; in physics it can also mean center of gravity.","zh":"“CG”最常指电脑图像/特效（computer graphics）；在物理中也可指重心（center of gravity）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) computer graphics; images made or enhanced by a computer, especially in movies, games, and design.","zh":"（缩写）电脑图像 / 计算机图形；用电脑制作或增强的画面，常见于电影、游戏和设计中。"},"examples":[{"en":"The movie uses a lot of CG to create realistic monsters.","zh":"这部电影用了很多CG来制作逼真的怪物。"},{"en":"She works in CG for video games.","zh":"她在游戏行业做CG（电脑图像）相关工作。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev., physics/engineering) center of gravity; the point where an object’s weight is balanced.","zh":"（缩写，物理/工程）重心；物体重量达到平衡的点。"},"examples":[{"en":"A lower CG helps the car stay stable in turns.","zh":"较低的CG（重心）能让汽车转弯时更稳定。"},{"en":"If the CG is too high, the bike is easier to tip over.","zh":"如果CG（重心）太高，自行车更容易翻倒。"}]}],"synonyms":["computer graphics","CGI (related)","center of gravity (when used in physics)"],"phonetic":"ˌsiː ˈdʒiː","extraExplanation":["“CG”在日常英语里最常指电影/游戏中的“电脑特效画面”。如果你在聊天或技术语境里看到它，也可能是“center of gravity（重心）”，需要看上下文判断。"]}
{"word":"CGA","summary":{"en":"CGA is an abbreviation; it most commonly refers to a former Canadian accounting designation, but it can also mean terms in computer graphics or genetics depending on context.","zh":"CGA 是缩写；最常见指加拿大曾使用的会计资格，但也可能在计算机图形或遗传检测等语境中表示其他含义，需结合上下文判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) Certified General Accountant: a professional accounting designation formerly used in Canada.","zh":"（缩写）加拿大“注册普通会计师”：加拿大曾使用的一种会计专业资格/头衔。"},"examples":[{"en":"She earned her CGA before the accounting designations were unified under CPA.","zh":"在加拿大会计头衔统一为 CPA 之前，她取得了 CGA 资格。"},{"en":"The job posting says “CPA (CGA/CMA/CA accepted).”","zh":"招聘启事写着“CPA（接受 CGA/CMA/CA）”。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) Computer Graphics Architecture: a set of methods or a system design for generating and displaying computer graphics.","zh":"（缩写）计算机图形架构：用于生成与显示计算机图形的系统设计/方法体系。"},"examples":[{"en":"This course introduces basic CGA concepts like the graphics pipeline.","zh":"这门课介绍图形流水线等基础的 CGA 概念。"},{"en":"Researchers compared two CGA designs for real-time rendering.","zh":"研究人员比较了两种用于实时渲染的 CGA 设计。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) Comparative Genomic Array / Chromosomal microarray analysis (usage varies): a lab test that looks for DNA copy-number changes.","zh":"（缩写，使用不一）比较基因组芯片/染色体微阵列分析：一种检测 DNA 拷贝数变化的实验室检查。"},"examples":[{"en":"The doctor ordered a CGA to check for genetic copy-number variations.","zh":"医生开了 CGA 检查，用于查看是否存在基因拷贝数变异。"},{"en":"CGA results are usually discussed with a genetic counselor.","zh":"CGA 的结果通常会与遗传咨询师一起解读。"}]}],"synonyms":["CPA (Canada)","CMA","CA"],"phonetic":"ˌsiː dʒiː ˈeɪ","extraExplanation":["“CGA”是缩写，具体含义高度依赖领域与国家/地区：在加拿大会计语境里最常见（但现在多并入 CPA 体系）；在计算机、医学等语境也可能出现其他释义。若你能告诉我看到它的句子或行业（会计/计算机/医学等），我可以帮你锁定最准确的意思。"]}
{"word":"CGCT","summary":{"en":"CGCT is an initialism; without context it can mean different things. In science it may also refer to the DNA sequence C-G-C-T.","zh":"CGCT 是一个首字母缩略词；没有上下文时可能有多种含义。在科学语境中也可能指 DNA 序列 C-G-C-T。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An initialism (acronym) whose meaning depends on context; commonly used as a short label in technical or organizational names.","zh":"一个首字母缩略词；具体含义取决于使用场景，常用作技术或组织名称的简称。"},"examples":[{"en":"I saw “CGCT” in the report, but the author didn’t define what it stands for.","zh":"我在报告里看到“CGCT”，但作者没有说明它代表什么。"},{"en":"Please spell out CGCT the first time you use it in a document.","zh":"在文档中第一次使用CGCT时，请先写出全称。"}]},{"partOfSpeech":"other","definition":{"en":"(Biology/Genetics) A DNA sequence motif written as the four bases C-G-C-T, sometimes discussed in genetics or molecular biology as a short sequence within a longer strand.","zh":"（生物/遗传）由四个碱基 C-G-C-T 组成的DNA序列片段，常在遗传学或分子生物学中作为更长序列中的短片段被讨论。"},"examples":[{"en":"The primer includes the sequence CGCT near its 3' end.","zh":"这个引物在3'端附近包含CGCT序列。"},{"en":"They searched the genome for repeated CGCT patterns.","zh":"他们在基因组中搜索重复出现的CGCT模式。"}]}],"synonyms":["initialism","acronym"],"phonetic":"/si dʒi si ti/","extraExplanation":["“CGCT”最常见的问题是：它可能有很多不同的全称（不同领域、不同机构都可能用同一组字母）。如果你能提供出现的场景（例如：论文/课程/公司/聊天内容），我可以帮你锁定最可能的含义并给出更准确的解释与例句。"]}
{"word":"CGE","summary":{"en":"CGE is an initialism with multiple meanings; common ones include Certified Global Educator and (in Canada) Capital Gains Exemption.","zh":"CGE 是多义缩写；常见含义包括 Certified Global Educator（全球教育者认证）以及（加拿大）Capital Gains Exemption（资本利得免税/减税）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation (initialism) that can stand for different phrases depending on the field; commonly used in education or business contexts.","zh":"缩写（首字母缩略词），在不同领域可代表不同含义；常见于教育或商业语境中。"},"examples":[{"en":"What does CGE stand for in this document?","zh":"这份文件里的 CGE 代表什么？"},{"en":"CGE can mean different things, so please give more context.","zh":"CGE 可能有不同含义，所以请提供更多上下文。"}]},{"partOfSpeech":"other","definition":{"en":"(often) Certified Global Educator: a title/certification for educators focused on global competence and international education.","zh":"（常见）Certified Global Educator：强调全球胜任力/国际教育的教师认证或称号。"},"examples":[{"en":"She earned her CGE certification last year.","zh":"她去年获得了 CGE 认证。"},{"en":"Our school hired a CGE to lead global learning projects.","zh":"我们学校聘请了一位 CGE 来带领全球学习项目。"}]},{"partOfSpeech":"other","definition":{"en":"(finance/tax, Canada) Capital Gains Exemption: a tax exemption that can reduce tax on certain capital gains (context-dependent).","zh":"（金融/税务，加拿大）Capital Gains Exemption：对某些资本利得提供的免税/减税政策（具体以语境为准）。"},"examples":[{"en":"Ask an accountant whether you qualify for the CGE.","zh":"请咨询会计你是否符合 CGE（资本利得免税）的条件。"},{"en":"The CGE rules can change over time.","zh":"CGE 的相关规定可能会随时间变化。"}]}],"synonyms":["initialism","abbreviation"],"phonetic":"/ˌsiː dʒiː ˈiː/","extraExplanation":["“CGE”不是像“teacher”那样固定含义的单词，而是缩写；最可靠的理解方式是看它出现的领域（学校、证书、税务文件、公司内部简称等）。如果你把 CGE 所在的句子/段落发来，我可以帮你准确判断是哪一种。"]}
{"word":"CGI","summary":{"en":"CGI most commonly means computer-generated imagery (visual effects). In web contexts, it can also mean Common Gateway Interface (server-run scripts).","zh":"CGI 最常指“电脑生成影像/视觉特效”。在网页开发语境中也可指“通用网关接口”（服务器运行脚本）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(computing) Computer-generated imagery: images or visual effects made with computers, often used in films, TV, video games, and advertising.","zh":"（计算机）电脑生成影像：用电脑制作的画面或视觉特效，常用于电影、电视剧、电子游戏和广告。"},"examples":[{"en":"The dragon in the movie was created with CGI.","zh":"电影里的那条龙是用 CGI 做出来的。"},{"en":"Modern action films rely heavily on CGI for big explosions and fantasy scenes.","zh":"现代动作片在大爆炸和奇幻场景上非常依赖 CGI。"},{"en":"Some viewers prefer practical effects, but good CGI can look very realistic.","zh":"有些观众更喜欢实拍特效，但好的 CGI 也能非常逼真。"}]},{"partOfSpeech":"n.","definition":{"en":"(business/tech) Common Gateway Interface: an older method that lets a web server run programs (scripts) to create dynamic web pages.","zh":"（网络/技术）通用网关接口：一种较早的技术，让网页服务器运行程序（脚本）来生成动态网页内容。"},"examples":[{"en":"The website used a CGI script to process the contact form.","zh":"这个网站用 CGI 脚本来处理联系表单。"},{"en":"CGI was common before modern frameworks made dynamic websites easier.","zh":"在现代框架让动态网站更容易之前，CGI 曾很常见。"}]}],"synonyms":["computer-generated imagery","visual effects (VFX)","special effects (SFX)"],"phonetic":"/ˌsiː dʒiː ˈaɪ/","extraExplanation":["在日常英语里，提到 CGI 最常见的意思是“电影/游戏里的电脑特效”。如果在网页开发语境（尤其是较旧的教程或系统）里看到 CGI，才更可能指 Common Gateway Interface。","读法通常按字母读：C-G-I。"]}
{"word":"CGIAR","summary":{"en":"CGIAR is a global partnership and research network focused on agricultural and food-system solutions for development.","zh":"CGIAR 是一个聚焦农业与食物系统解决方案的全球合作与研究网络。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an international partnership and global research network that works on food, agriculture, nutrition, climate resilience, and natural resources, especially to support low- and middle-income countries","zh":"一个国际合作伙伴关系与全球研究网络，致力于粮食与农业、营养、气候韧性和自然资源等研究，重点支持中低收入国家"},"examples":[{"en":"CGIAR develops and shares agricultural innovations to help farmers adapt to climate change.","zh":"CGIAR 开发并分享农业创新，帮助农民适应气候变化。"},{"en":"Many universities and governments collaborate with CGIAR centers on crop and water research.","zh":"许多大学和政府与 CGIAR 的研究中心合作开展作物与水资源研究。"},{"en":"The report summarizes CGIAR’s work on improving food security in Africa and South Asia.","zh":"这份报告总结了 CGIAR 在提升非洲和南亚粮食安全方面的工作。"}]}],"synonyms":["CGIAR system","global agricultural research network","international agricultural research partnership"],"phonetic":"/ˌsiː dʒiː aɪ ˈɑːr/","extraExplanation":["CGIAR 是一个缩写，常见读法是逐个字母读（C-G-I-A-R）。它最初与“Consultative Group on International Agricultural Research（国际农业研究磋商组织）”这一名称有关；如今更多被当作品牌名使用，通常直接写作 CGIAR。","CGIAR 体系下有多个国际农业研究中心（如与水稻、小麦、玉米、渔业、林业、水资源等相关的研究机构），常与联合国机构、各国政府、高校与非营利组织合作。"]}
{"word":"CGL","summary":{"en":"CGL most commonly means Commercial General Liability (business insurance). In some academic contexts, it can mean Computer Graphics Lab/Laboratory.","zh":"CGL最常见指“商业综合责任险”（企业保险）。在部分学术语境中也可指“计算机图形实验室”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) Commercial General Liability (insurance): a type of business insurance that helps cover claims of bodily injury, property damage, and related legal costs.","zh":"（缩写）商业综合责任险：一种企业保险，通常用于应对人身伤害、财产损失等第三方索赔及相关法律费用。"},"examples":[{"en":"Our landlord requires tenants to carry CGL insurance before moving in.","zh":"房东要求租户在入住前购买CGL商业综合责任险。"},{"en":"Please send the CGL certificate of insurance to the client.","zh":"请把CGL保险证明发给客户。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) Computer Graphics Laboratory / Lab: a department or research group focused on computer graphics.","zh":"（缩写）计算机图形实验室：从事计算机图形学研究或教学的部门/团队。"},"examples":[{"en":"She did her internship at the university’s CGL.","zh":"她在大学的CGL（计算机图形实验室）实习。"},{"en":"The CGL published a new paper on rendering techniques.","zh":"CGL发表了一篇关于渲染技术的新论文。"}]}],"synonyms":["general liability (GL)","business liability insurance"],"phonetic":"/ˌsiː dʒiː ˈɛl/","extraExplanation":["“CGL”最常见于商业/法律/保险文件中，几乎默认指 Commercial General Liability。若在学术或学校语境（尤其计算机相关院系）出现，才可能指某个“Computer Graphics Lab/Laboratory”的名称缩写。","读法通常按字母读：C-G-L。"]}
{"word":"CGM","summary":{"en":"CGM most commonly refers to a continuous glucose monitor (or continuous glucose monitoring) used to track blood sugar over time.","zh":"CGM最常指连续血糖监测仪（或连续血糖监测），用于长期追踪血糖变化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"continuous glucose monitor; a small device (often a sensor worn on the body) that measures glucose levels continuously and sends the readings to a phone or receiver.","zh":"连续血糖监测仪；一种（通常贴在身体上的）小型装置，可持续测量葡萄糖/血糖水平，并把数据发送到手机或接收器。"},"examples":[{"en":"My doctor recommended a CGM to help me track my blood sugar trends.","zh":"医生建议我使用CGM来追踪血糖变化趋势。"},{"en":"With a CGM, you can get alerts when your glucose is too high or too low.","zh":"使用CGM时，血糖过高或过低会收到提醒。"}]},{"partOfSpeech":"n.","definition":{"en":"continuous glucose monitoring; the method or process of tracking glucose levels over time using a continuous glucose monitor.","zh":"连续血糖监测；指通过CGM设备在一段时间内持续追踪血糖的方式/过程。"},"examples":[{"en":"CGM can reduce finger-stick tests for some people.","zh":"对一些人来说，CGM可以减少扎手指测血糖的次数。"},{"en":"She shared her CGM data with her healthcare team.","zh":"她把CGM数据分享给了医疗团队。"}]}],"synonyms":["continuous glucose monitor","continuous glucose monitoring","glucose sensor"],"phonetic":"ˌsiː dʒiː ˈɛm","extraExplanation":["在英语里，CGM在医疗语境中最常见，尤其与糖尿病（diabetes）管理有关。它通常提供“趋势箭头（trend arrows）”、历史曲线和高低血糖警报，帮助调整饮食、运动或胰岛素用量。","不同品牌/系统的术语可能不同：有的把“传感器（sensor）”贴在皮肤上，有的还配合“发射器（transmitter）”把数据传到手机App。"]}
{"word":"cgm","summary":{"en":"CGM most commonly means continuous glucose monitoring/a continuous glucose monitor, used to track glucose levels over time.","zh":"CGM最常指“持续/连续血糖监测（或连续血糖监测仪）”，用于长期追踪血糖水平。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abbreviation for continuous glucose monitoring (or a continuous glucose monitor), a device/system that tracks blood sugar (glucose) levels throughout the day and night","zh":"“持续血糖监测/连续血糖监测（或连续血糖监测仪）”的缩写；一种/一套系统，用来全天候追踪血糖（葡萄糖）水平"},"examples":[{"en":"My doctor suggested a CGM to help me see how different foods affect my glucose.","zh":"医生建议我用CGM，帮助我看不同食物会怎样影响血糖。"},{"en":"With a CGM, you can check your glucose trends without finger-prick tests as often.","zh":"用CGM后，你可以查看血糖变化趋势，不需要那么频繁地扎手指测血糖。"}]},{"partOfSpeech":"n.","definition":{"en":"less commonly, an abbreviation used in some fields for terms like computer-generated media/graphics (meaning images, video, or content made by computers)","zh":"较少见：在某些领域里也可指“计算机生成的媒体/图形”等（指由电脑制作的图像、视频或内容）"},"examples":[{"en":"The film uses CGM to create realistic background scenes.","zh":"这部电影使用CGM来制作逼真的背景场景。"}]}],"synonyms":["continuous glucose monitor","continuous glucose monitoring"],"phonetic":"/ˌsiː dʒiː ˈɛm/","extraExplanation":["在医疗语境中，CGM最常见：通常由“皮下传感器 + 读取器/手机App”组成，会显示实时数值与趋势箭头，并可设置高/低血糖警报。不同品牌与国家地区的具体功能、术语可能略有差异。","书写上常见大写“CGM”。口语里一般按字母读：C-G-M。"]}
{"word":"CGN","summary":{"en":"CGN most commonly refers to the airport code for Cologne Bonn Airport, and in networking it can mean carrier-grade NAT (CGN/CGNAT).","zh":"CGN最常见指德国科隆/波恩机场的三字代码；在网络领域也可指运营商级NAT（CGN/CGNAT）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(airport code) The IATA code for Cologne Bonn Airport in Germany.","zh":"（机场代码）德国科隆/波恩机场（Cologne Bonn Airport）的国际航空运输协会（IATA）代码。"},"examples":[{"en":"My flight lands at CGN at 8:40 p.m.","zh":"我的航班晚上8:40降落在CGN（科隆/波恩机场）。"},{"en":"Is there a train from CGN to Cologne city center?","zh":"从CGN到科隆市中心有火车吗？"}]},{"partOfSpeech":"other","definition":{"en":"(networking) Abbreviation for carrier-grade NAT, a method used by internet providers to share one public IP address among many users.","zh":"（网络）carrier-grade NAT 的缩写（也常写作 CGNAT），指运营商级网络地址转换：让许多用户共享同一个公网 IP 的技术。"},"examples":[{"en":"Because of CGN, hosting a game server at home can be difficult.","zh":"因为CGN（运营商级NAT），在家里搭建游戏服务器可能会比较困难。"},{"en":"Ask your ISP for a public IP if CGN is blocking port forwarding.","zh":"如果CGN导致无法做端口转发，可以向网络运营商申请公网IP。"}]}],"synonyms":["CGNAT"],"phonetic":"/siː dʒiː ɛn/","extraExplanation":["“CGN”最常见于两类语境：① 旅行/机票信息里作为机场三字代码（IATA code）；② 网络技术讨论里作为“运营商级NAT（CGN/CGNAT）”。看到它出现在哪一类文本中，通常就能判断是哪种意思。","读作逐个字母：C-G-N。"]}
{"word":"CGNAT","summary":{"en":"CGNAT means Carrier-Grade NAT, an ISP technique that lets many users share one public IP address.","zh":"CGNAT 指运营商级 NAT：运营商让许多用户共享一个公网 IP 的地址转换技术。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Carrier-Grade NAT: a method used by Internet providers to share one public IP address among many customers by translating their private IP addresses (network address translation).","zh":"运营商级 NAT（Carrier-Grade NAT）：互联网服务提供商用来让许多用户共享同一个公网 IP 的技术，通过把用户的私有 IP 做地址转换（NAT）。"},"examples":[{"en":"My home router shows a private address, and my ISP also uses CGNAT, so I can’t get a true public IP.","zh":"我家路由器显示的是私有地址，而且运营商还用了 CGNAT，所以我拿不到真正的公网 IP。"},{"en":"Online gaming can be harder with CGNAT because you may get a stricter NAT type.","zh":"用了 CGNAT 以后，在线游戏可能更麻烦，因为你可能会遇到更严格的 NAT 类型。"},{"en":"To host a server, you may need to ask your ISP for a public IP or use a VPN if you’re behind CGNAT.","zh":"如果要自己搭服务器，在 CGNAT 后面可能需要向运营商申请公网 IP，或用 VPN 等方案。"}]}],"synonyms":["Carrier-Grade NAT","carrier NAT","large-scale NAT (LSN)"],"phonetic":"/ˌsiː dʒiː ˈnæt/","extraExplanation":["CGNAT 常见于 IPv4 地址不够用的地区：运营商把很多家庭/手机用户“挤”在少量公网 IPv4 上，从而节省地址。","对普通浏览网页/看视频通常影响不大；但对“从外网主动连进来”的需求影响较大，例如端口转发（Port Forwarding）、自建 NAS/网站、部分 P2P、某些语音/联机游戏匹配。","一个简单识别方法：如果你路由器的“公网 IP”其实落在 100.64.0.0/10 这段（运营商级 NAT 专用段）或明显不是公网段，通常意味着你在 CGNAT 后面。"]}
{"word":"CGP","summary":{"en":"CGP is usually an abbreviation—often referring to CGP Books in the UK; otherwise, its meaning depends on context.","zh":"CGP通常是缩写——在英国常指CGP Books；在其他语境下则需看上下文确定含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) The initials “CGP,” most commonly referring (in the UK) to **CGP Books**, a publisher known for exam revision guides. (Example: “I bought a CGP Maths revision guide.”)","zh":"（缩写）“CGP”这组首字母缩写，在英国语境中最常见指 **CGP Books**（一家以考试复习资料/教辅书出名的出版社）。（例：I bought a CGP Maths revision guide.＝“我买了一本CGP的数学复习书。”）"},"examples":[{"en":"I revised for my GCSEs using a CGP guide.","zh":"我用CGP的复习指南来准备GCSE考试。"},{"en":"Is this from CGP Books or another publisher?","zh":"这是CGP Books出的还是别的出版社出的？"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev.) More generally, “CGP” can be used as an initialism for different terms in different fields; the exact meaning depends on the context (company, document, or topic). (Example: “CGP stands for … in this report.”)","zh":"（缩写）更一般地说，“CGP”也可能在不同领域代表不同词组；具体含义取决于上下文（公司/文件/话题）。（例：CGP stands for … in this report.＝“在这份报告里CGP代表……”）"},"examples":[{"en":"In this document, CGP stands for “Corporate Governance Policy.”","zh":"在这份文件里，CGP代表“公司治理政策”。"},{"en":"What does CGP mean here?","zh":"这里的CGP是什么意思？"}]}],"synonyms":["an abbreviation","an initialism (context-dependent)"],"phonetic":"/ˌsiː dʒiː ˈpiː/","extraExplanation":["“CGP”是由字母组成的缩写，英语里通常按字母逐个读（initialism），读作“C-G-P”。当你看到这种缩写时，最可靠的方法是查看它在该文本/机构里第一次出现时给出的全称（often written as: CGP = …）。","在英国学生语境中，提到“a CGP book/guide”常常默认就是指CGP Books出的复习资料（尤其是GCSE、A-level等考试相关）。"]}
{"word":"CGS","summary":{"en":"CGS most commonly refers to the centimeter–gram–second system of measurement used in older scientific contexts.","zh":"CGS 最常指厘米—克—秒单位制，常见于较早的科学/工程语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbrev.) the centimeter–gram–second system of units, an older measurement system used especially in physics and engineering.","zh":"（缩写）厘米—克—秒单位制，一种较早的计量单位体系，常见于物理与工程领域。"},"examples":[{"en":"In CGS, force is often measured in dynes.","zh":"在 CGS 制中，力常用“达因（dyne）”来表示。"},{"en":"Many older physics papers report magnetic values in CGS units.","zh":"许多较早的物理论文会用 CGS 单位来报告磁学量。"},{"en":"The textbook compares CGS with SI to show why SI is now more common.","zh":"教材把 CGS 和 SI 作比较，以说明为什么现在 SI 更常用。"}]},{"partOfSpeech":"n.","definition":{"en":"(abbrev., less common) a set of initials used as a name for organizations, programs, or job titles, depending on context.","zh":"（缩写，较不常见）在不同语境中可能代表机构、项目或职位等名称的首字母缩写。"},"examples":[{"en":"What does CGS stand for in this report?","zh":"在这份报告里，CGS 代表什么？"},{"en":"Please spell out CGS the first time you use it in the paper.","zh":"在论文中第一次使用 CGS 时，请先写出其全称。"}]}],"synonyms":["centimeter–gram–second system","centimetre–gram–second system","CGS units"],"phonetic":"ˌsiː dʒiː ˈɛs","extraExplanation":["在科学语境里，CGS 最常指“厘米—克—秒制”。它与现代更通用的 SI（国际单位制：米—千克—秒）不同，尤其在电磁学中两者的单位换算更复杂。阅读旧教材或论文时经常会遇到 CGS（例如 dyne、erg、gauss、oersted 等）。如果你是在某份具体材料里看到 CGS，最好结合上下文确认是否为其他机构/项目缩写。"]}
{"word":"cgs","summary":{"en":"CGS usually means the centimeter–gram–second unit system, common in older physics/engineering texts; in other contexts it may stand for different names.","zh":"CGS通常指厘米-克-秒制，常见于较早的物理/工程资料；在其他语境中也可能是不同名称的缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the centimeter–gram–second (CGS) system: a metric unit system based on centimeters, grams, and seconds, used especially in older physics and engineering contexts","zh":"厘米-克-秒制（CGS制）：以厘米、克、秒为基本单位的度量体系，常见于较早的物理与工程文献"},"examples":[{"en":"Older textbooks may give electromagnetic formulas in the CGS system instead of SI.","zh":"较老的教材可能用CGS制而不是国际单位制（SI）来写电磁学公式。"},{"en":"The lab report listed the magnetic field in gauss, a CGS unit.","zh":"实验报告用高斯（gauss）表示磁场，这是一个CGS制单位。"}]},{"partOfSpeech":"other","definition":{"en":"(general) an abbreviation used in names of organizations or courses (meaning depends on context), e.g., “Computer and Game Science/Studies” in some schools","zh":"（泛指）用于机构、课程等名称的缩写（具体含义取决于语境），例如某些学校里可指“计算机与游戏科学/研究”等"},"examples":[{"en":"What does CGS stand for in your syllabus? It can mean different things.","zh":"你的课程大纲里CGS代表什么？它在不同地方含义可能不同。"}]}],"synonyms":["centimeter–gram–second system","cgs system"],"phonetic":"si dʒi ɛs","extraExplanation":["在科学语境里，CGS最常见指“厘米-克-秒制”。它与SI（国际单位制）并存过很长时间，尤其在电磁学中出现较多。常见CGS单位包括：dyne（达因，力）、erg（尔格，能量）、gauss（高斯，磁感应强度）、poise（泊，黏度）。","读到“CGS”时，最好看它周围是否出现这些单位或与“SI”对比；若出现在学校/机构名称中，则需要依据具体上下文确认全称。"]}
{"word":"CGX","summary":{"en":"CGX is usually an abbreviation whose meaning depends on context; it can also refer to the former airport code for Chicago Meigs Field.","zh":"CGX 通常是依上下文而定的缩写；它也可以指芝加哥梅格斯机场（已关闭）的机场代码。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An initialism (abbreviation) made from the letters C, G, and X; its meaning depends on context (for example, a stock ticker or an airport code).","zh":"由字母 C、G、X 组成的首字母缩略写法；具体含义取决于使用场景（例如股票代码或机场代码）。"},"examples":[{"en":"I saw “CGX” on the screen, but I needed more context to know what it meant.","zh":"我在屏幕上看到“CGX”，但需要更多上下文才知道它是什么意思。"},{"en":"In finance news, CGX can appear as a ticker symbol for a company.","zh":"在财经新闻里，CGX 可能会作为某家公司的股票代码出现。"}]},{"partOfSpeech":"other","definition":{"en":"The IATA airport code for Chicago Meigs Field (a former airport in Chicago).","zh":"芝加哥梅格斯机场（Chicago Meigs Field，已停用/关闭的机场）在 IATA 的三字代码。"},"examples":[{"en":"Old flight records sometimes list Meigs Field as CGX.","zh":"旧的航班记录有时会把梅格斯机场标为 CGX。"}]}],"phonetic":"/si dʒi ɛks/","extraExplanation":["“CGX”本身不是一个固定词义的英语单词，更像“代码/缩写”。最可靠的理解方式是看它出现的领域：金融语境里常见为股票代码；航空语境里可能是机场三字码；在不同公司、软件或项目中也可能被自定义为内部缩写。","读法通常按字母逐个读：C-G-X（而不是当作一个连读的单词）。"]}

