{"word":"CHP","summary":{"en":"CHP is an abbreviation most commonly meaning “Combined Heat and Power,” but it can also mean “California Highway Patrol” or a medical condition in infants (congenital hypertrophic pyloric stenosis), depending on context.","zh":"CHP 是缩写，最常见指“热电联产”，也可能指“加州公路巡警”或婴儿的医学疾病“先天性肥厚性幽门狭窄”，需结合语境判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Combined Heat and Power: a system that produces electricity and also captures the waste heat for heating (and sometimes cooling), improving energy efficiency.","zh":"热电联产：一种同时发电并回收余热用于供暖（有时也用于制冷）的系统，可提高能源利用效率。"},"examples":[{"en":"The hospital installed a CHP plant to cut energy costs and reduce emissions.","zh":"这家医院安装了热电联产（CHP）系统来降低能耗成本并减少排放。"},{"en":"CHP is common in factories that need both power and steam.","zh":"需要电力和蒸汽的工厂里，热电联产（CHP）很常见。"}]},{"partOfSpeech":"n.","definition":{"en":"California Highway Patrol: the state police agency that patrols highways in California.","zh":"加州公路巡警：负责巡逻和执法加利福尼亚州高速公路的州级警察机构。"},"examples":[{"en":"Call the CHP if there’s an accident on the freeway in California.","zh":"在加州如果高速公路发生事故，可以联系加州公路巡警（CHP）。"},{"en":"A CHP officer helped direct traffic after the crash.","zh":"车祸后，一名加州公路巡警（CHP）警官协助指挥交通。"}]},{"partOfSpeech":"n.","definition":{"en":"Congenital hypertrophic pyloric stenosis (medical): a condition in infants where the muscle at the stomach outlet thickens and blocks food from entering the small intestine.","zh":"（医学）先天性肥厚性幽门狭窄：婴儿胃出口处肌肉增厚，导致食物难以进入小肠的疾病。"},"examples":[{"en":"The doctor suspected CHP after the baby began vomiting forcefully after feeding.","zh":"婴儿喂奶后出现喷射性呕吐，医生怀疑是先天性肥厚性幽门狭窄（CHP）。"},{"en":"CHP is usually treated with a minor surgery.","zh":"先天性肥厚性幽门狭窄（CHP）通常通过小手术治疗。"}]}],"synonyms":["cogeneration (for Combined Heat and Power)"],"phonetic":"/ˌsiː eɪtʃ ˈpiː/","extraExplanation":["“CHP”是缩写，具体含义高度依赖语境：能源/工程领域最常见的是“热电联产”；在美国加州交通语境里常指“加州公路巡警”；在医疗语境（尤其儿科）里可能指“先天性肥厚性幽门狭窄”。","读法通常是按字母读：C-H-P（不是当作一个普通单词连读）。","如果你告诉我你看到“CHP”的场景（新闻、课本、报告、聊天、医院单据等），我可以帮你锁定最准确的意思。"]}

