{"word":"chyack","summary":{"en":"“chyack” is an informal regional word meaning “to chat” or “a chat.”","zh":"“chyack”是地区口语用词，表示“聊天/闲聊”或“一段闲聊”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(informal, regional) to chat casually; to talk in a friendly, relaxed way.","zh":"（非正式；地区用语）闲聊；随意聊天。"},"examples":[{"en":"We sat outside the café and chyacked for an hour.","zh":"我们坐在咖啡馆外面闲聊了一个小时。"},{"en":"Stop chyacking and get back to work, please.","zh":"别再闲聊了，请回去继续工作。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, regional) a casual chat; friendly conversation.","zh":"（非正式；地区用语）闲聊；家常话。"},"examples":[{"en":"Let’s have a quick chyack after class.","zh":"下课后我们简单聊两句吧。"},{"en":"It was just a bit of chyack—nothing serious.","zh":"就只是随便聊聊——没什么大事。"}]}],"synonyms":["chat","chatter","talk","natter"],"phonetic":"/tʃæk/","extraExplanation":["“chyack”更常见的拼写有“chiack / chyak”，多见于苏格兰英语或澳大利亚等地区的口语里，意思接近“chat / chatter”。在正式写作中通常用“chat”。如果你是在特定文章、歌词或社媒中看到的，也可能是个人化拼写，用来表现口音或随意语气。"]}
{"word":"chyak","summary":{"en":"“Chyak” is not a standard English word; it’s likely a typo or a transliteration, and its meaning depends on where you saw it.","zh":"“chyak”不是标准英语单词；更可能是拼写错误或外语音译，具体含义取决于出现的语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most often seen as a misspelling or a romanization/transliteration from another language, so its meaning depends on context.","zh":"不是标准英语单词。更常见于拼写错误或其他语言的罗马字转写/音译，因此含义需要结合上下文判断。"},"examples":[{"en":"I couldn’t find “chyak” in an English dictionary—did you mean “check” or “chuck”?","zh":"我在英语词典里找不到“chyak”——你是不是想写“check（检查）”或“chuck（扔）”？"},{"en":"In some chat messages, “chyak” may be a typo, so ask the writer what they meant.","zh":"在一些聊天信息里，“chyak”可能只是打错字，所以可以问对方想表达什么。"}]}],"phonetic":"/tʃjæk/","extraExplanation":["“chyak”在英语里没有固定词义。若你是在字幕、游戏ID、社交媒体或某种语言学习材料里看到它，可能是：\n1）把别的词打错了：常见接近的有 check /tʃek/（检查、核对）、chuck /tʃʌk/（扔；卡盘）、clack /klæk/（咔嗒声）。\n2）外来语音译：不同语言里可能对应不同词（例如某些亚洲语言的拟声或人名/地名的拼写）。\n如果你把它出现的完整句子（或截图）发来，我可以更准确地判断它想表达的意思。"]}
{"word":"chyazic","summary":{"en":"“Chyazic” isn’t a recognized English word; it’s likely a misspelling or a niche/proper term.","zh":"“chyazic”不是常见英文词，可能是拼写错误或小众/专有术语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a proper name/term from a specific community, game, or language.","zh":"不是标准英语单词。可能是拼写错误，或来自某个社群/游戏/其他语言的专有名词。"},"examples":[{"en":"I couldn’t find “chyazic” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里找不到“chyazic”——你能把看到它的句子发我吗？"},{"en":"If you meant “chaotic,” the spelling is different.","zh":"如果你想写的是“chaotic（混乱的）”，拼写不一样。"}]}],"phonetic":"/ˈtʃaɪ.ə.zɪk/","extraExplanation":["“chyazic”看起来像是拼写误差。最常见、最接近的可能是 **chaotic**（/keɪˈɑːtɪk/，意思是“混乱的、无序的”），但也可能是某个名字、网名、品牌名，或某种小众术语。","如果你把它出现的上下文（完整句子/领域，比如医学、游戏、化学等）发来，我可以更准确判断你想表达的词，并给出正确释义与例句。"]}
{"word":"chylaceous","summary":{"en":"Chylaceous means “related to chyle” or “milky in appearance like chyle,” mainly used in medical contexts.","zh":"Chylaceous 指“与乳糜有关的”或“呈乳糜样乳白色的”，主要用于医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to chyle (a milky fluid formed in the small intestine during digestion) or having a milky appearance like chyle.","zh":"与乳糜（消化过程中在小肠形成的乳白色液体）有关的；或呈乳糜样乳白色的。"},"examples":[{"en":"The report described a chylaceous fluid in the abdominal cavity.","zh":"报告描述腹腔内有乳糜样液体。"},{"en":"After the injury, the drainage looked chylaceous—cloudy and milky.","zh":"受伤后，引流液看起来呈乳糜样——浑浊而乳白。"}]}],"synonyms":["chylous","milky","lactescent","opalescent"],"phonetic":"/kaɪˈleɪʃəs/","extraExplanation":["“chylaceous”多见于医学与生理学语境，用来描述与乳糜相关的体液（如乳糜腹水、乳糜胸）。","词源上与“chyle（乳糜）”同根，源自希腊语/拉丁语，核心意象是“乳白、像牛奶一样的消化液”。"]}
{"word":"chylangioma","summary":{"en":"Chylangioma is a rare benign lymphatic-vessel tumor containing milky lymph fluid (chyle).","zh":"Chylangioma 指一种罕见的良性淋巴管性肿瘤，内含乳白色的乳糜样淋巴液。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medicine) A rare benign tumor (non-cancerous growth) made up of lymphatic vessels and filled with milky lymph fluid (chyle); often considered a type of lymphangioma.","zh":"（医学）一种罕见的良性肿瘤（非癌性增生），由淋巴管组织构成，内含乳白色的淋巴液（乳糜）；常被视为淋巴管瘤的一种。"},"examples":[{"en":"The surgeon suspected a chylangioma after finding a cyst filled with milky fluid.","zh":"外科医生在发现一个充满乳白色液体的囊肿后，怀疑是乳糜性淋巴管瘤（chylangioma）。"},{"en":"Imaging tests can help distinguish a chylangioma from other cystic masses.","zh":"影像学检查可以帮助将乳糜性淋巴管瘤与其他囊性肿块区分开来。"}]}],"synonyms":["lymphangioma","chylous lymphangioma"],"phonetic":"/ˌkaɪl.ændʒiˈoʊ.mə/","extraExplanation":["词源提示：chyl- 来自 chyle（乳糜，消化后进入淋巴系统的乳白色脂肪性淋巴液），angioma 指“血管/管道样组织的肿瘤”。","该词在现代医学文献中不算常用；临床上更常见、更通用的说法是 lymphangioma（淋巴管瘤），有时也会用 chylous lymphangioma（乳糜性淋巴管瘤）来强调内容物为乳糜。","这属于医学专业词汇；如果你是在报告或病理诊断中看到它，通常需要结合影像、病理结果与医生解释来理解具体类型与处理方式。"]}
{"word":"chylaqueous","summary":{"en":"A rare medical adjective meaning “containing or resembling chyle,” often describing a milky-looking body fluid.","zh":"一个罕见的医学形容词，意为“含乳糜的/乳糜样的”，常用来描述呈乳白色的体液。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical, rare) Containing or resembling chyle (a milky fluid formed during digestion, rich in fat droplets).","zh":"（医学，罕见）含有乳糜（消化过程中形成的乳白色液体，富含脂肪微粒）的；或呈乳糜样的（乳白、混浊）。"},"examples":[{"en":"The fluid drawn from the chest looked chylaqueous, suggesting chyle leakage.","zh":"从胸腔抽出的液体呈乳糜样，提示可能有乳糜漏。"},{"en":"A chylaqueous appearance can make a sample look cloudy or milky.","zh":"乳糜样外观会使样本看起来浑浊或乳白。"}]}],"synonyms":["chylous","milky","cloudy (appearance)"],"phonetic":"/ˌkaɪləˈkwiːəs/","extraExplanation":["该词在现代英语里非常少见，多见于较旧的医学文献或病理描述。现在更常用的说法是“chylous（乳糜的）”“milky（乳白的）”或直接写“contains chyle（含乳糜）”。","词源上来自 chyle（乳糜）+ 形容词后缀 -aceous（“……样的/具有……性质的”），因此字面意思就是“乳糜样的/含乳糜的”。"]}
{"word":"chyle","summary":{"en":"Chyle is a milky digestive fluid rich in fats that moves from the intestine through the lymph system.","zh":"Chyle（乳糜）是消化过程中在小肠形成的乳白色、富含脂肪的体液，经淋巴系统运输。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A milky body fluid made in the small intestine during digestion; it contains fats and travels through lymph vessels to the bloodstream.","zh":"（生理）乳糜：在小肠消化过程中形成的乳白色体液，富含脂肪，经淋巴管运输并进入血液循环。"},"examples":[{"en":"After a fatty meal, chyle carries digested fats from the intestine into the lymphatic system.","zh":"吃了高脂食物后，乳糜会把消化后的脂肪从肠道运送到淋巴系统。"},{"en":"The lab sample looked milky, suggesting it contained chyle.","zh":"实验样本呈乳白色，提示其中可能含有乳糜。"}]}],"synonyms":["intestinal lymph","lymph (context-dependent)"],"phonetic":"/kaɪl/","extraExplanation":["“chyle”多用于解剖学/医学语境，日常英语很少用；一般科普会说“fat-rich lymph（富含脂肪的淋巴液）”。","词源来自希腊语 *chylos*（“汁液、乳汁样液体”），经拉丁语传入英语，因此拼写看起来不太像常见英语词。"]}
{"word":"chyle-containing","summary":{"en":"“Chyle-containing” means having chyle in it (a milky, fat-rich fluid from digestion).","zh":"“chyle-containing”指“含乳糜的”，即含有一种消化后形成的乳白色、富含脂肪的淋巴液。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medical) Containing chyle (a milky lymphatic fluid rich in fat that forms during digestion and is transported from the intestines).","zh":"（医学）含有乳糜的（乳糜是消化过程中形成的、富含脂肪的乳白色淋巴液，由肠道经淋巴系统运输）。"},"examples":[{"en":"The surgeon noted chyle-containing fluid in the drainage tube after the operation.","zh":"外科医生注意到手术后引流管中出现含乳糜的液体。"},{"en":"A chyle-containing pleural effusion may suggest injury to the thoracic duct.","zh":"含乳糜的胸腔积液可能提示胸导管受损。"}]}],"synonyms":["chylous","containing chyle","chyle-rich"],"phonetic":"/ˈkaɪl kənˌteɪnɪŋ/","extraExplanation":["“chyle”常见于医学语境，尤其与“chylous（乳糜性的）”“chylothorax（乳糜胸）”等词一起出现。“chyle-containing”是较直接的描述性写法，用来强调“该液体/组织里含有乳糜”。"]}
{"word":"chyle-forming","summary":{"en":"Chyle-forming means producing or involved in producing chyle during fat digestion.","zh":"chyle-forming 指“产生乳糜的；与乳糜生成有关的”，多用于脂肪消化吸收相关语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology/medicine) Producing or related to the production of chyle (a milky fluid formed in the small intestine during fat digestion and carried by the lymphatic system).","zh":"（生物/医学）产生乳糜（小肠在脂肪消化过程中形成的乳白色液体，并由淋巴系统运输）的；与乳糜生成有关的。"},"examples":[{"en":"The small intestine has chyle-forming functions after a fatty meal.","zh":"在高脂饮食后，小肠具有乳糜生成的功能。"},{"en":"Researchers examined chyle-forming processes in the intestinal lymph vessels.","zh":"研究人员检查了肠道淋巴管中的乳糜生成过程。"}]}],"synonyms":["chylopoietic","chyle-producing"],"phonetic":"/ˈkaɪl ˌfɔːrmɪŋ/","extraExplanation":["“chyle-forming”多见于较正式的生理学/解剖学语境，常用来描述与脂肪吸收相关的机制或组织。","“chyle（乳糜）”主要由乳糜微粒等脂质成分使其呈乳白色；它从小肠绒毛内的乳糜管进入淋巴系统，最终汇入血液循环。"]}
{"word":"chyle-like","summary":{"en":"Chyle-like means “milky and cloudy, like chyle,” and is mainly used in medical/scientific descriptions.","zh":"chyle-like 指“乳白浑浊、像乳糜一样的”，主要用于医学或科研描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling chyle (a milky body fluid formed during digestion), especially in being milky-white or cloudy in appearance.","zh":"类似乳糜（消化过程中形成的乳白色体液）的；尤指外观呈乳白色或浑浊状的。"},"examples":[{"en":"The lab noted a chyle-like, milky appearance in the fluid sample.","zh":"实验室记录该液体样本呈乳糜样的乳白色外观。"},{"en":"Doctors investigated the chyle-like drainage to find the source of the leak.","zh":"医生对乳糜样的引流液进行检查，以查找渗漏来源。"}]}],"synonyms":["milky","cloudy","lactescent","chylous"],"phonetic":"/ˈkaɪlˌlaɪk/","extraExplanation":["“chyle”指“乳糜”，是小肠吸收脂肪后形成的一种乳白色液体，会经由淋巴系统运输。医学语境里常用“chyle-like / chylous（乳糜性的）”来描述某些体液或积液呈乳白、混浊、含脂肪的外观（如胸腔积液中的乳糜胸 chylothorax）。","拼写与用法提示：多见于医学报告或科研描述中，通常作定语（a chyle-like fluid / chyle-like drainage）。日常英语里较少使用。"]}
{"word":"chyle-producing","summary":{"en":"Chyle-producing means making or secreting chyle (a milky lymph fluid that carries absorbed fats).","zh":"Chyle-producing 指“产生/分泌乳糜”的（多用于医学语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Describing a vessel, gland, or structure) that produces or secretes chyle, a milky fluid formed during digestion that carries fats from the intestines through the lymphatic system.","zh":"（形容血管、腺体或结构）产生或分泌乳糜（chyle）的一种消化后形成的乳白色液体，负责将肠道吸收的脂肪经淋巴系统运输。"},"examples":[{"en":"The surgeon carefully avoided injuring chyle-producing lymphatic vessels during the operation.","zh":"手术时，外科医生小心避免损伤产生乳糜的淋巴管。"},{"en":"Damage to chyle-producing channels can lead to chylous leakage.","zh":"产生乳糜的通道受损可能导致乳糜漏。"}]}],"synonyms":["chyle-forming","chyliferous"],"phonetic":"/ˈkaɪl prəˈduːsɪŋ/","extraExplanation":["“Chyle-producing”多见于医学/解剖学语境，常用来描述与小肠绒毛内的乳糜管（lacteals）或胸导管（thoracic duct）相关的结构。日常英语里很少使用，更常见的写法是“chyle-forming”或直接说“lymphatic vessels that carry chyle”。"]}
{"word":"chyleless","summary":{"en":"“Chyleless” means “without chyle,” used mainly in medical contexts.","zh":"“chyleless”意为“无乳糜的”，主要用于医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Lacking chyle (the milky fluid formed in the intestines during digestion and carried by the lymphatic system).","zh":"缺乏乳糜（消化时在肠道形成、经淋巴系统运输的乳白色液体）。"},"examples":[{"en":"The doctor noted chyleless fluid in the drainage tube after surgery.","zh":"医生记录到术后引流管中的液体缺乏乳糜成分。"},{"en":"In the report, the sample was described as clear and chyleless rather than milky.","zh":"报告中将该样本描述为清澈、无乳糜样外观，而不是乳白色。"}]}],"synonyms":["nonchylous","achylous"],"phonetic":"/ˈkaɪlləs/","extraExplanation":["“Chyleless”是非常少见、偏医学/生理学的词，日常英语中几乎不用；更常见的相关词是“chyle”（乳糜）以及形容外观的“chylous”（乳糜性的、乳白的）。","乳糜（chyle）与脂肪吸收有关，因此在医学语境里，“chyleless”常用来对比“chylous”，用来描述某种液体“不呈乳白色、看起来更清澈”。"]}
{"word":"chylemia","summary":{"en":"Chylemia is a medical term meaning chyle (milky, fat-rich digestive fluid) is present in the blood, making it look milky.","zh":"chylemia 是医学词，指血液中出现乳糜，使血液呈乳白色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) The presence of chyle (a milky fluid rich in fat from digestion) in the bloodstream, making the blood appear milky; also called lipemia in some contexts.","zh":"（医学）乳糜血症：血液中出现乳糜（消化后富含脂肪的乳白色液体），使血液呈乳白色；某些语境下也可与“脂血症（lipemia）”相关联。"},"examples":[{"en":"The lab noted chylemia when the patient’s blood sample looked unusually milky.","zh":"当患者的血样呈现异常乳白色时，化验报告提示可能存在乳糜血症。"},{"en":"Chylemia can be linked to problems in the lymphatic system, so further tests were ordered.","zh":"乳糜血症可能与淋巴系统问题有关，因此医生安排了进一步检查。"}]}],"synonyms":["lipemia","hyperlipidemia (related term)"],"phonetic":"/kaɪˈliːmiə/","extraExplanation":["词源提示：chyl- 来自 chyle（乳糜），-emia 表示“血液中的……状态”（如 anemia 贫血）。","学习提示：日常英语中很少用到该词，更多出现在医学检验报告、病例讨论或学术文章里。"]}
{"word":"chyles","summary":{"en":"Chyles is the plural of chyle, a milky digestive fluid that carries fats through the lymph system.","zh":"Chyles 是 chyle 的复数，指一种乳白色的消化液，通过淋巴系统运输脂肪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of chyle: a milky fluid made in the small intestine during digestion, carrying fats through the lymph system","zh":"chyle 的复数：消化过程中在小肠形成的乳白色液体，通过淋巴系统运输脂肪"},"examples":[{"en":"After a fatty meal, chyles carry more fat from the intestine.","zh":"吃完高脂肪的食物后，chyles 会从肠道运输更多脂肪。"},{"en":"In anatomy class, we learned how chyles move through lymph vessels.","zh":"在解剖课上，我们学习了 chyles 如何在淋巴管中流动。"}]}],"synonyms":["chylous fluid (related term)"],"phonetic":"/kaɪl/","extraExplanation":["“chyle / chyles”是医学与生理学用词，日常英语里很少用到。常见于解剖学、消化与淋巴系统相关的描述（如“chylous fluid 乳糜液”“chylomicron 乳糜微粒”）。","如果你想查的是地名或食物相关的词，很多人会把“chiles”（辣椒，尤指新墨西哥州用法）误拼成“chyles”。你可以确认一下语境。"]}
{"word":"chylidrosis","summary":{"en":"Chylidrosis is a rare medical term for sweating a milky, chyle-like fluid.","zh":"chylidrosis 指“乳糜汗症”：汗液呈乳白色、类似乳糜的罕见出汗异常。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical, rare) A condition in which a person sweats a milky, chyle-like fluid (often due to lymph/chyle leaking into sweat).","zh":"（医学用语，罕见）一种出汗异常：汗液呈乳白色、类似乳糜（chyle）的液体（常与淋巴/乳糜渗漏进入汗液有关）。"},"examples":[{"en":"The doctor suspected chylidrosis when the patient reported milky sweat after exercise.","zh":"当患者说运动后会出乳白色的汗液时，医生怀疑是乳糜汗症（chylidrosis）。"},{"en":"Chylidrosis is rare and usually needs medical tests to find the cause.","zh":"乳糜汗症很罕见，通常需要做检查来找出原因。"}]}],"synonyms":["chylous sweating","chylous perspiration"],"phonetic":"/ˌkaɪlɪˈdroʊsɪs/","extraExplanation":["词源提示：chyl- 来自 chyle（乳糜，肠道吸收脂肪后形成的乳白色淋巴液）；-hidrosis/-idrosis 与“出汗”有关。合起来大意是“乳糜样出汗”。","这是非常少见的医学词，日常英语几乎不用；更常见、相关的词包括 hyperhidrosis（多汗症）、chromhidrosis（彩色汗）、bromhidrosis（臭汗）。若在现实中出现类似症状，应就医而不是自行判断。"]}
{"word":"chylifaction","summary":{"en":"Chylifaction is a rare medical term meaning the digestive process of forming chyle in the small intestine.","zh":"Chylifaction（乳糜化）是较少见的医学术语，指消化过程中在小肠内形成乳糜的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process in digestion in which food is changed into chyle (a milky fluid formed in the small intestine that carries absorbed fats).","zh":"（消化过程中）食物转化为乳糜的过程；乳糜是小肠中形成的乳白色液体，负责运送吸收的脂肪。"},"examples":[{"en":"In old medical textbooks, chylifaction is described as a key stage of digestion.","zh":"在一些旧式医学教材里，乳糜化被描述为消化的重要阶段。"},{"en":"Problems in the intestine can affect chylifaction and reduce fat absorption.","zh":"肠道问题会影响乳糜化，从而降低脂肪吸收。"}]}],"synonyms":["formation of chyle","chyle formation"],"phonetic":"/ˌkaɪləˈfækʃən/","extraExplanation":["这是一个较少见、偏医学/生理学的词，现代更常见的表达是“formation of chyle（乳糜形成）”或直接谈“fat absorption（脂肪吸收）”。","词源上来自“chyle（乳糜）+ -fication（使……形成/变成……的过程）”，因此字面意思就是“形成乳糜的过程”。","在文学或日常英语中几乎不使用，多见于古典医学著作或历史语境；写作时若面向普通读者，建议用更直白的说法替代。"]}
{"word":"chylifactive","summary":{"en":"A rare medical adjective meaning “producing or promoting the production of chyle during digestion.”","zh":"一个较罕见的医学形容词，意为“产生或促进产生乳糜（与消化/脂肪吸收相关）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medicine, rare) producing or helping to produce chyle (a milky fluid formed in the small intestine during digestion).","zh":"（医学，较罕见）产生或促进产生乳糜（消化过程中在小肠形成的乳白色淋巴液体）的。"},"examples":[{"en":"The doctor discussed chylifactive processes involved in fat absorption.","zh":"医生讲到脂肪吸收过程中与“乳糜生成”有关的机制。"},{"en":"Certain intestinal functions are described as chylifactive in older medical texts.","zh":"在较早的医学文献中，某些肠道功能会被描述为“促乳糜生成的”。"}]}],"synonyms":["chylous (related to chyle)","chylopoietic (chyle-forming, rare)","lacteal (related to intestinal lymph vessels, context-dependent)"],"phonetic":"/ˌkaɪləˈfæk.tɪv/","extraExplanation":["这是一个非常少见、偏旧式的医学形容词，日常英语几乎不会用到。更常见的表达通常会直接说“related to chyle / chylous”或用更具体的术语描述消化与脂肪吸收过程。","词形上可拆为 chyle（乳糜）+ -factive（使……发生/促成……的，常见于拉丁语来源的构词）。遇到它时，多半出现在老教材、词典或专业史料中。"]}
{"word":"chylifactory","summary":{"en":"“chylifactory” is not standard English; it likely means “chili factory,” a place/company that makes chili or chili products.","zh":"“chylifactory”不是标准英文，通常是想表达“chili factory（辣椒/辣味产品工厂）”，指生产辣椒或辣椒制品的地方/公司。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Nonstandard spelling) likely intended to mean “chili factory”: a place (or company) that makes chili or chili-based products (such as sauces, powders, or canned chili).","zh":"（非标准拼写）很可能想表达“chili factory（辣椒/辣味产品工厂）”：生产辣椒或辣椒制品（如辣酱、辣椒粉、罐装辣味炖菜等）的工厂或公司。"},"examples":[{"en":"We visited a chili factory and learned how hot sauce is made.","zh":"我们参观了一家辣椒制品工厂，了解了辣酱是怎么做出来的。"},{"en":"This brand started as a small chili factory in New Mexico.","zh":"这个品牌起初是新墨西哥州的一家小型辣椒工厂。"}]},{"partOfSpeech":"phrase","definition":{"en":"(Rare, informal, figurative) a place that produces a lot of “spicy” content—heated arguments, strong opinions, or intense drama.","zh":"（较少见，非正式，比喻）指“生产很多火辣内容”的地方：争吵、强烈观点或戏剧性冲突不断。"},"examples":[{"en":"That comment section is a real chili factory—everything turns into an argument.","zh":"那个评论区简直是“辣椒工厂”——什么都能吵起来。"}]}],"synonyms":["chili plant","food factory","hot sauce manufacturer","chili producer"],"phonetic":"ˈtʃɪli ˈfæktəri","extraExplanation":["“chylifactory”不是常见英文拼写。更自然的写法通常是分开写：chili factory。美式英语更常用chili（而英式英语常见chilli）。","如果你指的是某个品牌名/账号名（例如ChyliFactory），它可能是专有名词，拼写可以是创意写法；正式写作中仍建议用标准拼写chili factory以避免误解。"]}
{"word":"chyliferous","summary":{"en":"Chyliferous describes structures in the body that carry or contain chyle (a milky digestive fluid that transports fats).","zh":"Chyliferous 用来形容人体内输送或含有乳糜的结构（乳白色的消化液，负责运输脂肪）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of the body, especially the intestines or lymphatic vessels) carrying or containing chyle—a milky fluid formed during digestion that transports fats through the lymph system.","zh":"（人体中，尤指肠道或淋巴管）输送或含有乳糜的——乳糜是消化过程中形成的乳白色液体，通过淋巴系统运输脂肪。"},"examples":[{"en":"Chyliferous vessels help move dietary fats from the intestines into the lymphatic system.","zh":"乳糜管有助于把饮食中的脂肪从肠道运送到淋巴系统。"},{"en":"The doctor pointed out a chyliferous duct in the anatomy diagram.","zh":"医生在解剖图上指出了一条乳糜管。"}]}],"synonyms":["chylous","lacteal"],"phonetic":"/kaɪˈlɪfərəs/","extraExplanation":["这个词主要用于解剖学/生理学语境，日常英语很少用。词根来自 chyle（乳糜）+ -ferous（“携带/产生……的”，源自拉丁语 ferre “携带”）。常见相关词：chylous（乳糜的）、lacteal vessels（乳糜管/乳糜淋巴管）。"]}
{"word":"chylific","summary":{"en":"Chylific means “producing chyle” or “related to chyle formation,” and it’s a rare, mostly older physiology term.","zh":"chylific 指“产生乳糜的”或“与乳糜形成相关的”，多见于较旧或较少用的生理学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Physiology, rare) Producing or related to the production of chyle (a milky digestive fluid formed in the small intestine during fat digestion).","zh":"（生理学，较少用）产生乳糜，或与乳糜产生有关的（乳糜是小肠在消化脂肪时形成的乳白色消化液）。"},"examples":[{"en":"The small intestine has chylific vessels that help transport absorbed fats.","zh":"小肠有与乳糜生成/运输相关的乳糜管，帮助运输被吸收的脂肪。"},{"en":"In older medical texts, you may see “chylific” used to describe processes connected to chyle formation.","zh":"在较老的医学文献中，你可能会看到“chylific”用来描述与乳糜形成相关的过程。"}]}],"synonyms":["chylous (related term)","chyle-producing (paraphrase)","lacteal (related, context-dependent)"],"phonetic":"/kaɪˈlɪfɪk/","extraExplanation":["“chylific”来自“chyle（乳糜）”+“-fic（使…形成/产生…的）”，整体意思就是“产生乳糜的”。现代医学英语里更常见的说法是用“chyle/chylous”相关表达（如 chylous fluid 乳糜液、chylomicron 乳糜微粒），所以“chylific”显得比较古旧、学术且少见。","拼写上也容易混淆：它不是常见词“chilific（刺激消化的）”。如果你是在文章里看到的，建议结合上下文看是否在谈脂肪吸收、淋巴系统或乳糜。"]}
{"word":"chylification","summary":{"en":"Chylification means the formation of chyle during digestion, especially from fats in the small intestine.","zh":"Chylification 指消化过程中（尤其是脂肪在小肠中）形成乳糜的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of forming chyle (a milky digestive fluid) from digested fats in the small intestine","zh":"乳糜化；指小肠在消化过程中把脂肪等营养物质转变为“乳糜”（一种乳白色的消化液/淋巴液）的过程"},"examples":[{"en":"Chylification occurs in the small intestine after fatty foods are broken down.","zh":"在脂肪类食物被分解后，乳糜化会在小肠中发生。"},{"en":"Doctors may discuss problems with chylification when a patient has trouble absorbing fats.","zh":"当病人难以吸收脂肪时，医生可能会谈到乳糜化出现的问题。"}]}],"synonyms":["formation of chyle","chyle formation","fat absorption (related)"],"phonetic":"/ˌkaɪlɪfɪˈkeɪʃən/","extraExplanation":["这是一个偏医学/生理学的词，日常英语里很少用，更常见的相关表达是 “fat absorption（脂肪吸收）” 或 “formation of chyle（乳糜的形成）”。","词源上可理解为 chyle（乳糜）+ -fication（使形成/形成的过程）。乳糜通常通过肠道的乳糜管（lacteals）进入淋巴系统。"]}
{"word":"chylificatory","summary":{"en":"“Chylificatory” is a rare medical adjective meaning “related to the formation of chyle during digestion.”","zh":"“Chylificatory” 是一个罕见的医学形容词，意思是“与消化过程中乳糜的形成有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the formation of chyle (a milky fluid produced during digestion and absorbed from the intestines).","zh":"与乳糜（消化过程中形成、由肠道吸收的乳白色液体）的形成有关的。"},"examples":[{"en":"Chylificatory processes occur in the small intestine during digestion.","zh":"在消化过程中，与乳糜形成有关的过程发生在小肠内。"},{"en":"Some older medical texts describe the “chylificatory organs” involved in nutrition.","zh":"一些较早的医学文献会把参与营养吸收的器官称为“乳糜形成相关器官”。"}]}],"synonyms":["related to chyle formation","chyle-producing","involved in digestion (context-dependent)"],"phonetic":"/ˌkaɪləˈfɪkətɔri/","extraExplanation":["这是一个非常少见、偏医学/生理学的词，更多出现在旧式医学写作中；现代英语里通常会用更常见的表达，如 related to chyle formation / involved in chyle production。","词根提示：chyle（乳糜）来自希腊语 khylos（汁液）；-ficatory 表示“促成/生成……的”（类似 make/produce 的含义）。"]}
{"word":"chylified","summary":{"en":"Chylified means “turned into chyle,” describing a milky, emulsified digestive fluid formed in the small intestine.","zh":"chylified 意为“乳糜化的/变成乳糜的”，常用于描述小肠消化过程中形成的乳白色、乳化的液体。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medical) Changed into chyle; made milky and emulsified during digestion in the small intestine.","zh":"（医学）转变为乳糜的；在小肠消化过程中变成乳白色乳糜状并被乳化的。"},"examples":[{"en":"After a fatty meal, the contents of the small intestine become chylified.","zh":"吃了高脂肪食物后，小肠内容物会变成乳糜状（chylified）。"},{"en":"The report described chylified fluid as milky in appearance.","zh":"报告称乳糜化液体外观呈乳白色。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of chylify (“to turn into chyle; to make chylous”).","zh":"chylify 的过去式/过去分词（意为“使变成乳糜；使乳糜化”）。"},"examples":[{"en":"Fats are chylified in the intestine before entering the lymphatic system.","zh":"脂肪在进入淋巴系统之前会在肠道中被乳糜化。"}]}],"synonyms":["chylous","emulsified","milky"],"phonetic":"/ˈkaɪlɪˌfaɪd/","extraExplanation":["“chyle”指小肠消化后形成的乳白色液体，富含脂肪微粒（经乳化后形成），主要通过淋巴系统吸收并运输。","词源上与希腊语 chylos（“汁液/消化液”）有关，因此这个词多见于医学、生理学或解剖学语境，日常英语中很少用。","拼写提示：chylified 不是常见词；写作中若面向大众读者，常用更通俗的表达，如 “milky/emulsified intestinal fluid（乳白/乳化的肠液）”。"]}
{"word":"chyliform","summary":{"en":"Chyliform means “milky and chyle-like,” commonly used in medical descriptions of fluids.","zh":"chyliform 指“乳糜样的、乳白似乳糜的”，多用于医学描述体液外观。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the appearance of chyle (a milky body fluid rich in fat), or resembling chyle in color/consistency.","zh":"呈乳糜样的；外观或质地像乳糜（富含脂肪的乳白色体液）的。"},"examples":[{"en":"The lab report noted a chyliform fluid, suggesting a high fat content.","zh":"化验报告注明液体呈乳糜样，提示脂肪含量较高。"},{"en":"The doctor described the drainage as chyliform because it looked milky white.","zh":"医生将引流液描述为乳糜样，因为它呈乳白色。"}]}],"synonyms":["chyle-like","milky","lactescent"],"phonetic":"/ˈkaɪləˌfɔrm/","extraExplanation":["词源：chyliform = chyle（乳糜）+ -form（……形的）。常见于医学/检验语境，用来描述“看起来像乳糜”的液体或渗出物。","在临床上，这类“乳白、似牛奶”的外观有时会让人联想到与淋巴/脂肪相关的问题（例如某些胸腔积液或尿液异常的情况），但“chyliform”本身强调的是外观相似，并不自动等同于确诊。"]}
{"word":"chylify","summary":{"en":"“Chylify” means to convert food—especially fats—into chyle during digestion, or to become chyle.","zh":"“Chylify”指在消化过程中把食物（尤指脂肪）转化为乳糜，或（自身）变成乳糜。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to turn food (especially fats) into chyle during digestion; to digest so that it becomes a milky fluid absorbed by the body","zh":"（消化过程中）把食物（尤指脂肪）转化为乳糜；使消化成可被身体吸收的乳白色液体"},"examples":[{"en":"The small intestine helps chylify dietary fats before they enter the lymphatic system.","zh":"小肠会先将膳食脂肪乳糜化，再让它们进入淋巴系统。"},{"en":"Enzymes and bile work together to chylify the meal.","zh":"酶和胆汁协同作用，使这顿饭被乳糜化（消化成乳糜）。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become chyle; to be digested into chyle","zh":"变成乳糜；被消化为乳糜"},"examples":[{"en":"After digestion begins, some of the fat quickly chylifies in the intestine.","zh":"消化开始后，一部分脂肪在肠道里很快就乳糜化了。"}]}],"synonyms":["digest","convert into chyle","form chyle"],"phonetic":"/ˈkaɪləˌfaɪ/","extraExplanation":["“chylify”是比较少见、偏医学/生理学语域的词，常见于解剖学或消化系统相关的文章中。","词源上来自“chyle（乳糜）+ -fy（使变成……）”。日常英语里更常说“digest (fats)”或“form chyle”。"]}
{"word":"chylifying","summary":{"en":"Chylifying is a rare medical word meaning “becoming chyle” or “forming/making chyle-like fluid” during digestion.","zh":"Chylifying 是较罕见的医学用词，表示“变成乳糜”或“形成/使之呈乳糜状（乳白含脂液体）”，多与消化吸收有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare, medical) Becoming chyle, or turning into a milky fluid like chyle during digestion.","zh":"（罕见，医学）变成乳糜；在消化过程中转变为类似乳糜的乳白色液体。"},"examples":[{"en":"After a fatty meal, the intestinal contents become chylifying as digestion progresses.","zh":"高脂餐后，随着消化进行，肠内容物逐渐呈乳糜化（变成乳糜状）。"},{"en":"The report describes a chylifying fluid consistent with lymph mixed with fat.","zh":"报告描述了一种乳糜化液体，符合“淋巴液混合脂肪”的特征。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of chylify: to form chyle or make something become chyle-like.","zh":"chylify 的现在分词：形成乳糜；使某物变成乳糜状（乳白、含脂）。"},"examples":[{"en":"In older medical writing, the lacteals are described as chylifying dietary fat.","zh":"在较早的医学著作中，乳糜管常被描述为“将膳食脂肪乳糜化”。"}]}],"synonyms":["forming chyle","becoming chylous","turning milky (medical context)"],"phonetic":"/ˈkaɪlɪˌfaɪɪŋ/","extraExplanation":["“chyle /kaɪl/（乳糜）”指小肠吸收脂肪后形成的乳白色液体，进入淋巴系统。chylify / chylifying 属于较少见的医学/生理学用词，现代写作中更常见的是 “form chyle（形成乳糜）” 或 “chylous（乳糜性的）”。"]}
{"word":"chylo","summary":{"en":"“Chylo” is not a common English word; it’s usually a name or online nickname.","zh":"“chylo”不是常见英语单词，通常是名字或网名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare term in English; most often seen as a username, nickname, or surname (a proper name), not a standard dictionary word.","zh":"英语中很少见；多见于用户名、昵称或姓氏（专有名词），并非标准词典词汇。"},"examples":[{"en":"My online handle is Chylo.","zh":"我在网上的用户名是 Chylo。"},{"en":"Chylo wrote the first draft of the report.","zh":"Chylo 写了报告的初稿。"}]}],"phonetic":"/ˈkaɪloʊ/","extraExplanation":["“chylo”不是常见英语词，因此在没有上下文时很难给出确定词义与用法。它更可能是人名/网名，或是拼写输入错误。","如果你本来想查的是发音相近的词，常见可能包括：chill（放松/冷静）、chili/chilli（辣椒）、Chilo（人名/地名，取决于语境）。你可以告诉我一句包含“chylo”的原句，我可以帮你判断最可能的意思。"]}
{"word":"chylocaulous","summary":{"en":"A rare adjective meaning “having a milky/latex-containing stem.”","zh":"一个罕见形容词，表示“茎里含有或会分泌乳白色汁液（乳胶）的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, technical) Having a stem that contains or exudes a milky fluid (latex), like “chyle.”","zh":"（罕见、专业用语）指“茎里含有或会渗出乳白色液体（乳汁/乳胶）”的；可理解为“乳汁茎的/乳白汁茎的”。"},"examples":[{"en":"Some older botanical descriptions call certain latex-bearing plants chylocaulous.","zh":"一些较早的植物学描述会把某些含乳胶的植物称为 chylocaulous。"},{"en":"In the field notes, the specimen was described as chylocaulous because a milky sap oozed from the cut stem.","zh":"在野外记录里，这个标本被描述为 chylocaulous，因为剪开茎后会渗出乳白色汁液。"}]}],"synonyms":["latex-bearing","lactiferous","milky-stemmed","latex-containing"],"phonetic":"/ˌkaɪloʊˈkɔləs/","extraExplanation":["这个词非常少见，多出现在旧式或非常专业的植物学/博物学文本里；现代更常用的表达通常是 latex-bearing（含乳胶的）、lactiferous（含乳汁的）或 milky-stemmed（茎呈乳白汁的）。","词源上可拆成 chyl-（与“乳糜/乳白汁”有关）+ -caulous（与“茎/杆”有关）。因此整体意思可直译为“乳汁茎的”。"]}
{"word":"chylocaulously","summary":{"en":"A very rare botanical adverb meaning “in a way that has milky sap in the stem.”","zh":"一个非常罕见的植物学副词，意为“茎部带乳汁/乳液地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is chylocaulous; with milky sap or juice in the stem (used in botanical description).","zh":"以“茎中含乳状汁液（乳汁/乳液）”的方式；用于植物学描写，表示茎部带乳汁。"},"examples":[{"en":"The specimen is described as chylocaulously exuding a white latex when cut.","zh":"该标本被描述为切开时茎部会以“乳汁状”方式渗出白色乳液。"},{"en":"Some field notes mention the plant chylocaulously, contrasting it with species that have clear sap.","zh":"一些野外记录用“chylocaulously（茎含乳汁）”来描述这种植物，并与汁液清澈的物种作对比。"}]}],"synonyms":["with milky sap","with milky latex"],"phonetic":"/ˌkaɪloʊˈkɔləsli/","extraExplanation":["这个词极罕见，主要可能出现在旧式或非常专业的植物学描写中；在现代写作里更常直接说“the stem contains milky latex / milky sap（茎有乳汁/乳液）”。","构词可拆为 chylo-（与乳糜/乳状液体有关）+ caul-（茎，源自拉丁语 caulis）+ -ous（形容词后缀）+ -ly（副词后缀）。实际使用中更常见的基础形容词是 chylocaulous。"]}
{"word":"chylocauly","summary":{"en":"Chylocauly is a very rare botanical term meaning the presence of milky sap in a plant’s stems.","zh":"Chylocauly 是一个极少见的植物学词，指植物茎部含有乳白色汁液。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Very rare, botany) The condition of having milky sap or “chyle-like” juice in the stems; being milky-stemmed.","zh":"（极少用，植物学）指植物茎部含有乳白色汁液的状态；“茎部带乳汁”。"},"examples":[{"en":"Some field guides note chylocauly in certain spurges, whose broken stems ooze white latex.","zh":"一些野外图鉴会提到大戟属植物的“chylocauly”，因为它们折断的茎会渗出白色乳汁。"},{"en":"The botanist recorded leaf shape, flower color, and chylocauly to help identify the specimen.","zh":"植物学家记录了叶形、花色以及“chylocauly（茎部乳汁性）”，以帮助鉴定标本。"}]}],"synonyms":["milky sap (in stems)","lactiferous","milky-stemmed"],"phonetic":"/ˌkaɪloʊˈkɔli/","extraExplanation":["这个词在现代英语里非常少见，多见于较旧的植物学描写或专业笔记中。","词源可拆解为 chylo-（来自 chyle，指乳糜/乳白色体液，引申为“乳白的液体”）+ caul-（来自拉丁语 caulis，意为“茎”）。因此整体就是“茎里有乳白汁液”的意思。","更常见的表达通常是 milky sap / milky latex（乳白色汁液）或 lactiferous（含乳汁的）。"]}
{"word":"chylocele","summary":{"en":"A chylocele is a rare swelling caused by chyle (milky lymph fluid) collecting in a sac, often in the scrotum.","zh":"chylocele 指乳糜（乳白色淋巴液）在囊腔内积聚导致的囊性肿胀，多见于阴囊部位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical swelling (usually in the scrotum) caused by a collection of chyle—milky lymphatic fluid—inside a sac, similar to a hydrocele but filled with chyle","zh":"（医学）乳糜囊肿；多指阴囊内因乳糜（呈乳白色的淋巴液）积聚而形成的肿胀/囊性积液，类似“鞘膜积液”，但内容物为乳糜"},"examples":[{"en":"The ultrasound suggested a chylocele rather than a typical hydrocele.","zh":"超声检查提示更像是乳糜囊肿，而不是典型的鞘膜积液。"},{"en":"Chylocele can occur when lymphatic vessels are damaged or blocked.","zh":"当淋巴管受损或阻塞时，可能出现乳糜囊肿。"}]}],"synonyms":["chylous hydrocele"],"phonetic":"/ˈkaɪloʊˌsiːl/","extraExplanation":["词源：chylo- 来自 chyle（乳糜，肠道吸收脂肪后进入淋巴系统的乳白色液体）；-cele 源自希腊语，表示“疝/肿胀/囊肿”。合起来就是“乳糜性囊性肿胀”。","使用场景：这是较少见、偏专业的临床用词，常见于泌尿外科或影像学报告中；日常英语中更常见的是 hydrocele（鞘膜积液）。"]}
{"word":"chylocyst","summary":{"en":"A medical term for a cyst that contains chyle (milky lymphatic fluid).","zh":"医学术语：指内含乳糜（乳白色淋巴液）的囊肿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cyst (fluid-filled sac) that contains chyle (a milky lymphatic fluid rich in fat), usually discussed in medical contexts","zh":"（医学）乳糜囊肿：内含乳糜（富含脂肪、呈乳白色的淋巴液）的囊肿"},"examples":[{"en":"The ultrasound suggested a chylocyst, but further imaging was needed to confirm it.","zh":"超声检查提示可能是乳糜囊肿，但仍需要进一步影像学检查来确认。"},{"en":"Because it contains chyle, a chylocyst may appear milky when drained.","zh":"由于含有乳糜，乳糜囊肿在引流时可能呈乳白色外观。"}]}],"synonyms":["chylous cyst"],"phonetic":"/ˈkaɪloʊsɪst/","extraExplanation":["词源提示：chyl(o)- 表示“乳糜/乳糜液”，-cyst 表示“囊肿/囊”。该词较少见，临床写作中更常见的是描述性表达（如“chylous cyst/含乳糜的囊肿”）或与具体部位相关的诊断用语。","学习建议：如果你是在病历或论文里看到它，也可能存在拼写差异；常见相关词包括 chyle（乳糜）、chylous（乳糜性的）、cyst（囊肿）。"]}
{"word":"chyloid","summary":{"en":"Chyloid describes something medically as related to chyle or having a milky, chyle-like look.","zh":"Chyloid 用于医学语境，指与乳糜有关或呈乳糜样（乳白色）外观。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medical) Related to chyle (a milky fluid formed in the small intestine during digestion) or resembling it in appearance.","zh":"（医学）与乳糜（消化时在小肠形成的乳白色液体）有关的；或外观类似乳糜的。"},"examples":[{"en":"Doctors noted a chyloid (milky) fluid in the sample, suggesting lymphatic involvement.","zh":"医生在样本中观察到乳糜样（乳白色）的液体，提示可能与淋巴系统有关。"},{"en":"The report described the drainage as chyloid rather than clear or bloody.","zh":"报告将引流液描述为乳糜样，而不是清亮或带血。"}]}],"synonyms":["chylous","milky","opalescent"],"phonetic":"/ˈkaɪlɔɪd/","extraExplanation":["“chyloid”较少见，多用于医学写作中描述“乳白色、像乳糜一样”的外观。常见相关词有：chyle（乳糜，名词）和chylous（乳糜的；乳糜样的，形容词），临床上更常见的是“chylous effusion（乳糜性积液）”“chylous ascites（乳糜性腹水）”。"]}
{"word":"chyloma","summary":{"en":"A chyloma is a medical term for a lump caused by leaked chyle collecting in tissue.","zh":"chyloma 指乳糜渗漏后在组织中聚集形成的包块，是一种医学用词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medicine) A mass or swelling caused by a collection of chyle (a milky fluid from the intestines) that has leaked from the lymphatic system; a chylous tumor-like lump.","zh":"（医学）由乳糜（肠道产生的乳白色液体）从淋巴系统渗漏并聚集形成的肿块/肿胀；乳糜性“瘤样”包块。"},"examples":[{"en":"After the surgery, imaging showed a small chyloma near the lymphatic vessels.","zh":"手术后，影像检查显示淋巴管附近有一个小的乳糜瘤。"},{"en":"The doctor suspected a chyloma because the fluid was milky and rich in fat.","zh":"医生怀疑是乳糜瘤，因为渗出液呈乳白色且脂肪含量高。"}]}],"synonyms":["chylous collection","chylous cyst","lymphatic (chyle) leak collection"],"phonetic":"/kaɪˈloʊmə/","extraExplanation":["“chyloma”较少见，主要出现在医学语境（影像学报告、手术并发症描述）中。它通常与淋巴管/胸导管损伤后的乳糜漏（chyle leak）相关，表现为局部液体聚集形成的包块。","词源可拆为 chyle（乳糜）+ -oma（肿块/瘤样结构）。这里的 -oma 常表示“肿块样的聚集”，不一定意味着癌症。"]}
{"word":"chylomicron","summary":{"en":"A chylomicron is a tiny particle that carries fat absorbed from food from the intestines into the lymph and blood.","zh":"chylomicron 指“乳糜微粒”，是一种把食物吸收来的脂肪从肠道运到淋巴与血液、再分配到全身的微小颗粒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tiny particle in the blood and lymph that carries dietary fat (especially triglycerides) from the intestines to other parts of the body","zh":"乳糜微粒（从肠道进入淋巴与血液的微小颗粒，主要负责把饮食中的脂肪/甘油三酯运输到全身）"},"examples":[{"en":"After a fatty meal, chylomicrons increase in the bloodstream to transport triglycerides.","zh":"吃了高脂肪的一餐后，血液中的乳糜微粒会增多，用来运输甘油三酯。"},{"en":"In biology class, we learned that chylomicrons are formed in the small intestine.","zh":"在生物课上，我们学到乳糜微粒是在小肠中形成的。"},{"en":"High chylomicron levels can be linked to certain lipid metabolism disorders.","zh":"乳糜微粒水平偏高可能与某些脂质代谢疾病有关。"}]}],"synonyms":["lipoprotein particle","triglyceride-rich lipoprotein"],"phonetic":"/ˌkaɪləˈmaɪkrɑn/","extraExplanation":["词源提示：chyl- 来自希腊语，和“乳糜（消化后呈乳白色的脂肪乳状液）”有关；-micron 表示“微小的颗粒”。","学习要点：乳糜微粒主要运输“外源性脂肪”（来自食物的脂肪），与之相关的常见概念还有 LDL/HDL（更常见于胆固醇运输）以及 triglycerides（甘油三酯）。"]}
{"word":"chylopericardium","summary":{"en":"Chylopericardium is the accumulation of chyle (milky lymphatic fluid) in the pericardial sac around the heart.","zh":"Chylopericardium 指乳糜（乳白色淋巴液）积聚在心包腔内的情况（乳糜心包积液）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical condition in which chyle (a milky lymphatic fluid rich in fat) collects in the pericardial sac around the heart (also called a chylous pericardial effusion).","zh":"（医学）乳糜心包积液：富含脂肪的乳糜（呈乳白色的淋巴液）积聚在包围心脏的心包腔内的情况。"},"examples":[{"en":"The patient was diagnosed with chylopericardium after imaging showed milky fluid in the pericardial space.","zh":"影像检查显示心包腔内有乳白色液体后，患者被诊断为乳糜心包积液。"},{"en":"Chylopericardium can cause shortness of breath if the fluid compresses the heart.","zh":"如果积液压迫心脏，乳糜心包积液可能导致呼吸困难。"}]}],"synonyms":["chylous pericardial effusion","chylous pericardial effusion (medical term)"],"phonetic":"/ˌkaɪloʊˌpɛrɪˈkɑrdiəm/","extraExplanation":["词源拆解：chylo- 来自“chyle（乳糜）”，peri- 表示“周围”，cardium 表示“心脏/心包区域”；合起来就是“乳糜出现在心脏周围（心包内）”。","在临床语境中常与 “pericardial effusion（心包积液）” 一起出现；病因可能与胸导管/淋巴管损伤、手术或外伤、肿瘤或先天性淋巴异常有关。","这是偏专业的医学词汇，日常英语中很少使用；写作或阅读医学材料时更常见。"]}
{"word":"chylophyllous","summary":{"en":"Chlorophyllous means ‘containing chlorophyll’—green, photosynthesizing plant tissue.","zh":"Chlorophyllous 指“含叶绿素的”——绿色、能进行光合作用的植物组织。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having chlorophyll; green and capable of photosynthesis (used mainly in botany).","zh":"含有叶绿素的；呈绿色并能进行光合作用的（主要用于植物学）。"},"examples":[{"en":"The chlorophyllous parts of the plant, such as the leaves, capture sunlight for photosynthesis.","zh":"植物的含叶绿素部分（如叶片）会吸收阳光来进行光合作用。"},{"en":"Some stems are chlorophyllous and can produce energy even when leaves are small.","zh":"有些茎也含叶绿素，即使叶子很小也能制造能量。"}]}],"synonyms":["chlorophyll-bearing","chlorophyll-containing","green"],"phonetic":"/ˌklɔːrəˈfɪləs/","extraExplanation":["你输入的“chylophyllous”在常见英语词典中很少见；更常见、标准的拼写是“chlorophyllous”（与 chlorophyll“叶绿素”有关）。如果你是在论文或标本标签上看到“chylophyllous”，可能是拼写变体或误拼，建议核对原文来源。","词源上它来自“chlorophyll（叶绿素）+ -ous（……的）”，多用于较正式的植物学描述，而日常英语通常直接说“green”或“containing chlorophyll”。"]}
{"word":"chylophyllously","summary":{"en":"Chlorophyllously means “in a chlorophyll-related or green (chlorophyll-bearing) way,” but it’s very rare in everyday English.","zh":"Chlorophyllously 表示“以与叶绿素相关/带叶绿素（呈绿色）的方式”，但在日常英语中非常罕见。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Rare/technical) In a way that involves chlorophyll; in a green, chlorophyll-bearing manner.","zh":"（罕见/专业）以含有叶绿素的方式；以绿色、带叶绿素的状态/方式。"},"examples":[{"en":"The leaves develop chlorophyllously as they receive more sunlight.","zh":"叶子在获得更多阳光时会以“产生叶绿素”的方式逐渐发绿。"},{"en":"Some algae grow chlorophyllously in bright, shallow water.","zh":"一些藻类会在明亮的浅水区以含叶绿素的方式生长。"}]}],"synonyms":["in a chlorophyll-rich way","greenly (context-dependent)","with chlorophyll"],"phonetic":"/ˌklɔːrəˈfɪləsli/","extraExplanation":["你输入的拼写“chylophyllously”很可能是想写 **chlorophyllously**（与“chlorophyll/叶绿素”相关的副词）。在正式语料中，这个副词非常少见；更常用的是 **chlorophyllous**（adj. 含叶绿素的）或直接用 **with chlorophyll / rich in chlorophyll** 来表达。","构词理解：**chloro-**（绿色）+ **phyll**（叶）+ **-ous**（…的）→ *chlorophyllous*；再加 **-ly** 变成副词 *chlorophyllously*（以…的方式）。"]}
{"word":"chylophylly","summary":{"en":"Chylophylly is likely a misspelling of chlorophyll, the green pigment that enables photosynthesis.","zh":"chylophylly 很可能是 chlorophyll（叶绿素）的拼写错误；叶绿素是帮助植物进行光合作用的绿色色素。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely misspelling) **chlorophyll**: the green substance in plants and algae that helps them use sunlight to make food (photosynthesis).","zh":"（可能为拼写错误）**chlorophyll（叶绿素）**：植物和藻类中的绿色物质，帮助它们利用阳光制造养分（光合作用）。"},"examples":[{"en":"Leaves look green because they contain chlorophyll.","zh":"叶子看起来是绿色的，因为它们含有叶绿素。"},{"en":"In autumn, chlorophyll breaks down and other colors appear.","zh":"在秋天，叶绿素分解，其他颜色就显现出来。"},{"en":"Scientists measured the chlorophyll in the lake to check algae growth.","zh":"科学家测量湖水中的叶绿素含量来判断藻类生长情况。"}]}],"synonyms":["plant pigment","green pigment"],"phonetic":"/ˈklɔrəˌfɪl/","extraExplanation":["你输入的 **chylophylly** 通常不是标准英文单词；最接近且常见的目标词是 **chlorophyll**（叶绿素）。","词源小提示：**chlorophyll** 来自希腊语 *chloros*（“绿色的”）+ *phyllon*（“叶子”），所以字面意思接近“叶子的绿色”。"]}
{"word":"chylopoetic","summary":{"en":"Chylopoetic means “producing chyle,” used mainly in medical or older scientific writing.","zh":"chylopoetic 指“产糜（生成糜乳）的”，主要见于医学或较旧的科学文献。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medical) Producing or involved in producing chyle (a milky digestive fluid formed in the small intestine and carried by the lymphatic system).","zh":"（医学）产糜（糜乳）的；与糜乳生成有关的（糜乳是小肠消化后形成、经淋巴系统运输的乳白色液体）。"},"examples":[{"en":"The small intestine has chylopoetic functions that help form chyle after fat is digested.","zh":"小肠具有产糜功能，帮助在脂肪消化后形成糜乳。"},{"en":"In older medical texts, you may see “chylopoetic organs” referring to parts of the digestive system involved in chyle formation.","zh":"在较早的医学文献中，你可能会看到“产糜器官”，指参与糜乳形成的消化系统部位。"}]}],"synonyms":["chyle-forming","chylous (related)","lacteal (related)"],"phonetic":"/ˌkaɪloʊpoʊˈɛtɪk/","extraExplanation":["词源拆解：chylo- 来自希腊语 khylos（“汁液、消化液/糜乳”）；-poetic 在这里不是“诗歌的”，而是来自 -poiesis（“制造、生成”），与 hematopoietic（造血的）中的 -poietic 同源。","这是一个相对少见、偏旧式的医学形容词；现代更常见的相关词包括 chyle（糜乳）、chylous（糜乳的）、lacteal（乳糜管的）。"]}
{"word":"chylopoiesis","summary":{"en":"Chylopoiesis means the process of forming chyle in the small intestine during digestion.","zh":"Chylopoiesis 指消化时在小肠内形成乳糜的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the formation of chyle (a milky fluid of digested fats) in the small intestine during digestion","zh":"乳糜生成；指在消化过程中，小肠内形成乳糜（含脂肪的乳白色消化液）的过程"},"examples":[{"en":"After a fatty meal, chylopoiesis increases as the intestine absorbs more lipids.","zh":"吃了高脂肪的一餐后，随着肠道吸收更多脂类，乳糜生成会增加。"},{"en":"The textbook described chylopoiesis as a key step in transporting dietary fats through the lymphatic system.","zh":"教材把乳糜生成描述为通过淋巴系统运输膳食脂肪的关键步骤。"}]}],"synonyms":["chyle formation"],"phonetic":"/ˌkaɪloʊpɔɪˈiːsɪs/","extraExplanation":["词源：chyl- 来自希腊语 khylos（“汁液、乳糜”），-poiesis 来自希腊语 poiein（“制作、形成”）。合起来就是“形成乳糜”。","使用场景：这是较为少见的生理学/医学术语，实际写作中更常见的相关表达是 chyle formation（乳糜形成）或直接描述“intestinal fat absorption（肠道脂肪吸收）”。"]}
{"word":"chylopoietic","summary":{"en":"A rare medical adjective meaning “producing chyle.”","zh":"一个罕见的医学形容词，意思是“产生乳糜的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Producing chyle (a milky fluid formed in the small intestine during digestion of fats).","zh":"（医学）产乳糜的；生成乳糜的（乳糜是小肠消化脂肪时形成的乳白色液体）。"},"examples":[{"en":"The intestinal lacteals are part of the chylopoietic system that helps absorb dietary fats.","zh":"肠道的乳糜管属于产乳糜系统的一部分，帮助吸收食物中的脂肪。"},{"en":"In older medical texts, the mesenteric lymphatics were described as chylopoietic vessels.","zh":"在较早的医学文献中，肠系膜淋巴管常被描述为产乳糜的血管。"}]}],"synonyms":["chyle-producing","chylous (related, not exact)"],"phonetic":"/ˌkaɪloʊpɔɪˈɛtɪk/","extraExplanation":["该词非常少见，多见于旧式医学/解剖学写作。现代英语里更常用的相关表达包括：chyle（乳糜）、chylous（乳糜性的）、chylification（乳糜化）等。","词源可拆解为：chylo-（乳糜）+ -poietic（“生成/制造”的，源自希腊语 poiein “制作”）。"]}
{"word":"chylosis","summary":{"en":"Chylosis is a medical term meaning the formation of chyle during digestion, or less commonly an abnormal presence/leak of chyle into body fluids.","zh":"Chylosis 是医学术语，主要指消化过程中乳糜的生成；较少见时也可指乳糜异常出现或渗漏到体液中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the formation or production of chyle (a milky digestive fluid formed in the small intestine during fat digestion)","zh":"乳糜的形成或生成（乳糜是在小肠消化脂肪时形成的一种乳白色消化液）"},"examples":[{"en":"After a fatty meal, chylosis increases as the intestine absorbs fats.","zh":"吃完高脂餐后，随着肠道吸收脂肪，乳糜的形成会增加。"},{"en":"In physiology, chylosis refers to the normal process of making chyle during digestion.","zh":"在生理学中，chylosis 指的是消化过程中生成乳糜的正常过程。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common, medical) a condition involving chyle appearing where it should not, such as leaking into body fluids","zh":"（较少见，医学）乳糜出现在不该出现的地方的情况，例如乳糜渗漏到某些体液中"},"examples":[{"en":"The doctor investigated whether the cloudy fluid was related to chylosis.","zh":"医生检查这种浑浊的液体是否与乳糜异常渗漏有关。"}]}],"synonyms":["chylification","formation of chyle"],"phonetic":"/kaɪˈloʊsɪs/","extraExplanation":["“Chylosis”是很偏医学/生理学的词，日常英语几乎不用。更常见的相关词有：chyle（乳糜）、chylous（乳糜样的/含乳糜的）、chylification（乳糜化，指脂肪被消化吸收并形成乳糜的过程）。","乳糜（chyle）属于淋巴系统的一部分：小肠吸收的脂肪会进入乳糜管/淋巴管，使淋巴液呈乳白色。某些疾病或外伤可能导致“乳糜渗漏”（例如出现乳糜性胸水 chylothorax）。"]}
{"word":"chylothorax","summary":{"en":"Chylothorax is the buildup of chyle (lymphatic fluid) in the pleural space around the lungs.","zh":"Chylothorax（乳糜胸）指乳糜（淋巴液）积聚在肺周围的胸膜腔内。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical condition in which lymphatic fluid (chyle) collects in the space around the lungs (the pleural cavity), often causing breathing problems.","zh":"（医学）乳糜胸：乳糜（淋巴液的一种）积聚在肺周围的胸膜腔内，常导致呼吸困难等症状。"},"examples":[{"en":"After the surgery, the patient developed a chylothorax and needed drainage.","zh":"手术后，病人出现乳糜胸，需要引流处理。"},{"en":"The doctor suspected chylothorax because the fluid from the chest tube looked milky.","zh":"医生怀疑是乳糜胸，因为胸腔引流液看起来呈乳白色。"},{"en":"CT imaging helped confirm the cause of the chylothorax.","zh":"CT影像检查有助于确认乳糜胸的病因。"}]}],"synonyms":["pleural chyle leak","chyle effusion"],"phonetic":"/ˌkaɪloʊˈθɔːræks/","extraExplanation":["词源：由 chyle（乳糜，来自肠道吸收脂肪后的淋巴液）+ thorax（胸腔）组成，因此字面意思就是“乳糜进入胸腔”。","常见原因包括胸部外伤或手术损伤胸导管、肿瘤压迫或侵犯淋巴系统等。临床上常通过胸腔穿刺/引流液呈“乳白色”以及化验（如甘油三酯升高）来提示该诊断。","这是专业医学词汇，日常英语中很少使用；在医患沟通中常会解释为“淋巴液漏到胸腔里”。"]}
{"word":"chylous","summary":{"en":"Chylous means “related to chyle,” often describing a milky, fat-rich bodily fluid in medical contexts.","zh":"chylous 指“与乳糜有关的”，常用于医学中描述乳白色、富含脂肪的体液。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to chyle (a milky fluid of digested fats) in the lymphatic system, especially after food is absorbed from the intestines.","zh":"与乳糜（消化后的脂肪形成的乳白色液体）有关的；尤指肠道吸收食物后进入淋巴系统的乳糜。"},"examples":[{"en":"The lab report described a chylous fluid, suggesting it contained a high amount of fat.","zh":"化验报告描述为“乳糜样”的液体，提示其中含有较多脂肪。"},{"en":"Doctors suspected a chylous effusion when the drainage looked milky.","zh":"当引流液呈乳白色时，医生怀疑是乳糜性积液。"}]}],"synonyms":["milky (in appearance)","fat-rich (in context)","lymphatic (context-related)"],"phonetic":"/ˈkaɪləs/","extraExplanation":["“Chylous”常见于医学语境，如 chylous effusion（乳糜性积液）、chylous ascites（乳糜性腹水）、chylothorax（乳糜胸）。其核心线索是“milky/乳白色 + 富含脂肪”。","词源来自希腊语 khylos，意为“汁液/液体”，在生理学中专指消化吸收后的乳糜。"]}
{"word":"chyluria","summary":{"en":"Chyluria is a condition where urine appears milky due to chyle (fat-rich lymph) in the urine.","zh":"Chyluria 指尿液因含乳糜（富脂淋巴液）而呈乳白色的情况（乳糜尿）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical condition in which urine looks milky because it contains chyle (lymphatic fluid rich in fat).","zh":"（医学）乳糜尿：尿液中含有乳糜（富含脂肪的淋巴液），因此尿液呈乳白色或乳浊状。"},"examples":[{"en":"The patient reported milky-looking urine, and tests suggested chyluria.","zh":"患者反映尿液呈乳白色，检查结果提示可能是乳糜尿。"},{"en":"Chyluria can come and go, so doctors may ask about episodes after meals.","zh":"乳糜尿可能时有时无，所以医生可能会询问是否在进食后更容易出现发作。"}]}],"synonyms":["milky urine (descriptive)","chylous urine (medical)"],"phonetic":"/kaɪˈlʊriə/","extraExplanation":["词源：chyle（乳糜）+ -uria（表示“尿中出现某物”的医学后缀）。因此字面意思就是“尿中有乳糜”。","常见机制是淋巴系统与泌尿系统之间出现异常通道（如淋巴管与尿路相通），让乳糜进入尿液。","在一些热带/亚热带地区，丝虫感染（如班氏丝虫）可导致淋巴回流受阻并引发乳糜尿；在其他情况下也可能与外伤、肿瘤或先天性淋巴异常有关。","学习提示：它是较专业的医学词，日常英语中更常用描述性说法，如 “milky urine（乳白色尿）”。"]}
{"word":"chym","summary":{"en":"“Chym” is an old spelling of “chyme,” the semi-liquid partly digested food in the stomach.","zh":"“chym”是“chyme（食糜）”的旧拼法，指胃里部分消化后的半流质食物混合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An archaic or variant spelling of “chyme,” the semi-liquid mixture of partially digested food in the stomach.","zh":"“chyme（食糜）”的古旧/变体拼写，指胃里部分消化后的半流质食物混合物。"},"examples":[{"en":"In older medical texts, you may see “chym” used where modern English uses “chyme.”","zh":"在较早的医学文献中，你可能会看到用“chym”来表示现代英语中的“chyme”。"},{"en":"After digestion begins, food becomes chyme in the stomach before moving into the small intestine.","zh":"消化开始后，食物在胃里变成食糜（chyme），然后进入小肠。"}]}],"synonyms":["chyme"],"phonetic":"/kaɪm/","extraExplanation":["“chym”多见于古英语/早期医学写作，现代标准写法通常是“chyme”。如果你是在生物/医学课本里看到，建议用“chyme”。","词源上与希腊语有关，和“把东西混合/倒在一起”的概念相关，因此在消化语境中表示“混合后的半流质”。"]}
{"word":"chymaqueous","summary":{"en":"A rare medical adjective meaning “related to or like chyme.”","zh":"一个罕见的医学形容词，意思是“与食糜有关的/类似食糜的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical, rare) Relating to or resembling chyme (the semi-fluid mixture of partly digested food and gastric juices in the stomach).","zh":"（医学用语，罕见）与“食糜”（胃内半流体的消化混合物）有关的；类似食糜的。"},"examples":[{"en":"After the stomach churns food, it becomes a chymaqueous mass before moving into the small intestine.","zh":"食物在胃里被搅拌后，会变成类似食糜的半流体团块，然后进入小肠。"},{"en":"Some older anatomy texts describe the stomach contents as chymaqueous.","zh":"一些较早的解剖学教材会把胃内容物描述为“类似食糜的”。"}]}],"synonyms":["chymous","chyme-like"],"phonetic":"ˌkaɪməˈkweɪəs","extraExplanation":["这个词非常少见，多出现在较旧的医学/解剖学写作中。现代英语更常用的表达是“chymous”（与食糜有关的）或直接说“chyme-like / like chyme”。","词源上可理解为 chyme（食糜）+ -aqueous（含水的、液体的），强调“像含水的食糜那样的半流体状态”。"]}
{"word":"chymase","summary":{"en":"Chymase is an enzyme released mainly by mast cells, involved in protein breakdown and processes like inflammation.","zh":"Chymase（糜蛋白酶）是主要由肥大细胞释放的酶，参与蛋白质分解并与炎症等过程相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an enzyme (a type of protein) released mainly by mast cells that helps break down proteins and can affect inflammation and tissue remodeling, especially in allergic reactions and some heart/blood-vessel conditions","zh":"糜蛋白酶（chymase）：一种主要由肥大细胞释放的酶（蛋白质），能分解蛋白质，并影响炎症与组织重塑；常与过敏反应以及部分心血管相关过程有关"},"examples":[{"en":"Researchers studied chymase to understand how mast cells contribute to inflammation.","zh":"研究人员研究糜蛋白酶，以了解肥大细胞如何促成炎症。"},{"en":"In some studies, chymase inhibitors are explored as potential treatments for cardiovascular disease.","zh":"在一些研究中，糜蛋白酶抑制剂被探索作为潜在的心血管疾病治疗方式。"}]}],"synonyms":["mast cell chymase","protease"],"phonetic":"/ˈkaɪmeɪs/","extraExplanation":["词源提示：chymase 来自希腊语词根 chyme（“食糜/消化物”）相关的构词传统，常用于命名“能分解特定底物的酶”。在医学与生物学文献里，它通常特指“肥大细胞糜蛋白酶”（mast cell chymase）。","学习建议：它是专业术语，日常英语很少出现；常见搭配有 chymase activity（糜蛋白酶活性）、chymase inhibitor（糜蛋白酶抑制剂）、mast cell chymase（肥大细胞糜蛋白酶）。"]}
{"word":"chyme","summary":{"en":"Chyme is the semi-liquid mixture of partly digested food and stomach juices that moves from the stomach into the small intestine.","zh":"Chyme 指“食糜”，即部分消化的食物与胃液混合形成的半流体，从胃进入小肠。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a thick, semi-liquid mixture of partially digested food and digestive juices that leaves the stomach and enters the small intestine","zh":"（消化过程中）食糜；由部分消化的食物与胃液混合形成的半流体，离开胃进入小肠"},"examples":[{"en":"After food is churned in the stomach, it becomes chyme.","zh":"食物在胃里被搅拌后会变成食糜。"},{"en":"The stomach releases chyme into the small intestine little by little.","zh":"胃会一点点把食糜释放到小肠中。"},{"en":"Bile helps the body digest fats once chyme reaches the small intestine.","zh":"当食糜进入小肠后，胆汁会帮助身体消化脂肪。"}]}],"synonyms":["partly digested food mixture","gastric contents"],"phonetic":"/kaɪm/","extraExplanation":["“chyme”主要用于生物学、医学或营养学语境，日常对话里更常说“partly digested food（部分消化的食物）”。","词源来自希腊语 *khymós*（意为“汁液/液体”），与“化学/流体变化”的概念有关。","容易与“chime（钟声/和谐地响）”混淆：发音相同，但意思完全不同。"]}
{"word":"chyme-like","summary":{"en":"An adjective meaning “like chyme”—thick, semi-liquid, and partly digested in appearance.","zh":"形容词，意为“像食糜一样”——外观/质地浓稠、半流体、似半消化状态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling chyme (the thick, semi-liquid mixture of partly digested food in the stomach); having a lumpy, mushy, digestive-fluid-like texture or appearance.","zh":"类似食糜（胃里半消化食物与胃液混合形成的浓稠半流体）；外观或质地呈现块状、糊状、像消化液混合物那样。"},"examples":[{"en":"The lab sample had a chyme-like consistency, thick and uneven.","zh":"那份实验样本呈现类似食糜的质地，浓稠而不均匀。"},{"en":"The vomit was described as chyme-like in the medical report.","zh":"病历报告中把呕吐物描述为“类似食糜”。"}]}],"synonyms":["chymeous","mushy","pasty","semi-liquid"],"phonetic":"/kaɪm laɪk/","extraExplanation":["“chyme-like”多见于医学、解剖学、法医或实验记录等较正式语境，用来描述“像胃内容物/食糜”的外观与质地；日常英语里很少用。","“chyme”（食糜）指食物在胃里被搅拌并与胃液混合后的半消化状态，不等同于“chyle”（乳糜，主要在小肠吸收脂肪时形成的乳白色淋巴液）。"]}
{"word":"chyme-related","summary":{"en":"Chyme-related means connected to chyme, the partly digested food mixture in the stomach.","zh":"chyme-related 指与“食糜”（胃内部分消化的食物混合物）有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to chyme (the semi-liquid mixture of partly digested food and digestive juices in the stomach that moves into the small intestine).","zh":"与食糜有关的（食糜是胃里食物与胃液混合形成的半液态消化物，随后进入小肠）。"},"examples":[{"en":"The researchers measured chyme-related changes in acidity after the meal.","zh":"研究人员测量了餐后与食糜相关的酸度变化。"},{"en":"Certain medications are designed to reduce chyme-related irritation in the stomach.","zh":"一些药物用于减轻与食糜相关的胃部刺激。"}]}],"synonyms":["related to chyme","gastric (in some contexts)","stomach-related (general)"],"phonetic":"/kaɪm rɪˈleɪtɪd/","extraExplanation":["“chyme”是医学/生理学里的专门词，日常英语里不常用；因此“chyme-related”多见于论文、教材、临床记录等正式语境。","常见搭配：chyme-related acidity（与食糜相关的酸度）、chyme-related symptoms（与食糜相关的症状）、chyme-related digestion（与食糜相关的消化过程）。"]}
{"word":"chymes","summary":{"en":"“Chime” means the sound of bells, or to ring like bells; it can also mean “to match well” or “to agree,” and “chime in” means to join a conversation.","zh":"“chime”指钟铃的叮当声或钟鸣；也可指“协调/相配”或“赞同”；“chime in”表示“插话、加入讨论”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the ringing sound of bells (often from a clock or a set of bells)","zh":"钟（或一组铃）发出的叮当声；（常指）钟声"},"examples":[{"en":"I heard the church chimes at noon.","zh":"我在正午听到了教堂的钟声。"},{"en":"The clock’s chimes woke me up.","zh":"钟表的报时声把我叫醒了。"}]},{"partOfSpeech":"v.","definition":{"en":"to make a clear, ringing sound like a bell","zh":"（像钟一样）发出清脆的叮当声；鸣响"},"examples":[{"en":"The bells chimed softly in the wind.","zh":"风中铃声轻轻作响。"},{"en":"The clock chimed three times.","zh":"钟报了三下。"}]},{"partOfSpeech":"v.","definition":{"en":"to match or sound pleasant together; to be in harmony","zh":"（声音/颜色/气氛等）协调，和谐"},"examples":[{"en":"The music chimed perfectly with the mood of the scene.","zh":"音乐与场景的氛围配合得恰到好处。"},{"en":"Her bright scarf chimed with her dress.","zh":"她鲜艳的围巾和裙子很搭。"}]},{"partOfSpeech":"v.","definition":{"en":"to agree with someone; to say the same thing","zh":"赞同；与……一致"},"examples":[{"en":"His opinion chimed with mine.","zh":"他的看法和我一致。"},{"en":"Several experts chimed with the report’s conclusion.","zh":"几位专家赞同报告的结论。"}]},{"partOfSpeech":"phrase","definition":{"en":"(phrasal verb) to join a conversation, often by adding an opinion","zh":"（短语动词）插话；加入讨论（常指补充观点）"},"examples":[{"en":"She chimed in with a helpful suggestion.","zh":"她插话提出了一个有帮助的建议。"},{"en":"Feel free to chime in if you have questions.","zh":"如果你有问题，欢迎随时插话。"}]}],"synonyms":["ring","toll","jingle","clang","harmonize","match","agree"],"phonetic":"/tʃaɪm/","extraExplanation":["“chymes”多见于较早的英文拼写或非常少见的变体拼写，现代英语通常写作“chimes”（名词复数/动词第三人称）或“chime”（原形）。如果你是在诗歌、旧文本里看到“chymes”，一般可按“chimes”理解为“钟声/叮当声”。"]}
{"word":"chymia","summary":{"en":"Chymia is an archaic word meaning chemistry or alchemy.","zh":"Chymia 是古义词，意思是“化学”或“炼金术”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(archaic) Chemistry or alchemy; the art/science of working with substances and transformations.","zh":"（古义）化学或炼金术；研究与操作物质及其变化的技艺/学问。"},"examples":[{"en":"In old books, **chymia** often refers to what we now call chemistry.","zh":"在旧书里，**chymia** 常指我们今天所说的化学。"},{"en":"The scholar studied **chymia** to understand how metals and medicines could be made.","zh":"这位学者研究 **chymia**，以理解金属与药物如何被制成。"}]}],"synonyms":["chemistry","alchemy (historical/overlapping sense)"],"phonetic":"/ˈkaɪmiə/","extraExplanation":["“chymia”是较古老的拼写，常见于16–18世纪的英文或拉丁化文本中；现代英语通常写作 **chemistry**。它与 **alchemy（炼金术）** 在早期历史上关系很近，因为早期“化学”常包含金属转化、炼制、制药等内容。","词源上可追溯到希腊语与中世纪拉丁语的相关词形（与“khem-/chem-”词根有关），后来拼写逐渐稳定为“chem-”。阅读古文献时看到“chymist”通常相当于现代的“chemist（化学家）”。"]}
{"word":"chymic","summary":{"en":"Chymic is an old-fashioned word meaning “chemical,” often linked to alchemy or early chemistry in historical texts.","zh":"Chymic 是“chemical（化学的）”的古老用法/拼写，常见于历史文本中，并常带有炼金术或早期化学的语境色彩。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic) relating to chemistry; chemical.","zh":"（古义）与化学有关的；化学的。"},"examples":[{"en":"In early science books, you may see “chymic experiments” where we would now say “chemical experiments.”","zh":"在早期科学书籍里，你可能会看到“chymic experiments”，如今我们会说“chemical experiments（化学实验）”。"},{"en":"The author described the lab as a place of chymic study and discovery.","zh":"作者把实验室描述为进行“chymic（化学）”研究与发现的地方。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Archaic) relating to alchemy or early forms of chemistry.","zh":"（古义）与炼金术或早期化学（化学尚未完全独立成现代科学时）有关的。"},"examples":[{"en":"Some writers used “chymic” when talking about alchemy, metals, and mysterious transformations.","zh":"一些作者在谈到炼金术、金属与神秘的“转化”时会用“chymic”这个词。"},{"en":"He collected old chymic texts that mixed observation with superstition.","zh":"他收藏了一些古老的“chymic（炼金/早期化学）”文本，把观察与迷信混在一起。"}]}],"synonyms":["chemical","alchemical","chemic (rare)"],"phonetic":"/ˈkaɪmɪk/","extraExplanation":["“chymic”是“chemical”的古拼写之一，常见于16—18世纪的英语文本。那时“alchemy（炼金术）”与“chemistry（化学）”的界限还不清晰，所以“chymic”有时会带一点“炼金术/早期化学”的历史语感。","现代英语里几乎不用“chymic”，阅读古文献时识别它即可；写作时一般用“chemical”或在历史语境下用“alchemical”。"]}
{"word":"chymics","summary":{"en":"“Chymics” is an archaic term meaning chemistry, sometimes with links to alchemy in older writings.","zh":"“Chymics”是古语，意为“化学”，在旧文献中有时与“炼金术”有所关联。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) the study or practice of chemistry; earlier spelling of “chemics/chemistry,” sometimes overlapping with alchemy in older texts.","zh":"（古语）化学（或化学实践）；“chemics/chemistry”的早期拼写，在旧文献中有时与炼金术（alchemy）含义有重叠。"},"examples":[{"en":"In some 17th‑century books, “chymics” refers to what we now call chemistry.","zh":"在一些17世纪的书籍里，“chymics”指的就是我们今天所说的化学。"},{"en":"He studied chymics and medicine, mixing early lab work with older ideas about nature.","zh":"他学习化学与医学，把早期实验室操作与更古老的自然观念混在一起。"}]}],"synonyms":["chemistry","chemics","chymistry","alchemy (historical overlap)"],"phonetic":"/ˈkaɪmɪks/","extraExplanation":["“chymics”是历史拼写，常见于16–18世纪英文文献（如“chymistry / chymical”一类形式）。当时“化学”和“炼金术”的边界还不清晰，所以语境里可能既指实验性的化学研究，也可能带有炼金术色彩。现代英语中几乎不用，阅读旧书时遇到可直接理解为“chemistry”。"]}
{"word":"chymiferous","summary":{"en":"Chymiferous means “producing or carrying chyme (or, in older texts, chyle),” and it’s mostly seen in older or technical anatomy writing.","zh":"chymiferous 指“产生或输送食糜（旧文献中也可指乳糜）”，多见于较旧或专业的解剖学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy/biology) Producing or carrying chyme (partly digested food) or, in older usage, chyle (a milky digestive fluid).","zh":"（解剖/生物）产生或输送食糜（部分消化的食物）；较旧用法中也可指产生或输送乳糜（乳白色的消化液/淋巴液）。"},"examples":[{"en":"In some older anatomy texts, the intestinal vessels were described as chymiferous.","zh":"在一些较早的解剖学教材中，肠道的某些血管/淋巴管被描述为 chymiferous（输送食糜/乳糜的）。"},{"en":"The term chymiferous is rare in modern English; writers usually choose more specific words like lacteal or lymphatic.","zh":"chymiferous 在现代英语中很少见；作者通常会用更具体的词，如 lacteal（乳糜管的）或 lymphatic（淋巴的）。"}]}],"synonyms":["chyliferous","lacteal (related)","lymphatic (related)"],"phonetic":"/kaɪˈmɪfərəs/","extraExplanation":["这个词多见于旧式或较专业的解剖/生理学语境。词根可理解为：chyme（食糜）+ -ferous（“携带/产生……的”，如 *odoriferous* “有气味的”。）","注意易混：*chyme*（食糜）与 *chyle*（乳糜）相关但不同；现代教材里谈到肠道吸收后的乳糜，多用 *chyliferous* 或 *lacteal*。"]}
{"word":"chymification","summary":{"en":"Chymification is the stomach’s process of turning food into chyme (a thick semi-liquid) during digestion.","zh":"Chymification 指胃在消化中把食物变成食糜（浓稠的半液体）的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of digestion in which food in the stomach is turned into a thick, semi-liquid mixture (chyme) before moving into the small intestine","zh":"（消化过程中的）食糜化：食物在胃里被搅拌并与胃液混合，变成浓稠的半液体“食糜（chyme）”，再进入小肠"},"examples":[{"en":"Chymification happens in the stomach before the food enters the small intestine.","zh":"食糜化发生在胃里，食物进入小肠之前会先经历这个过程。"},{"en":"Doctors may discuss chymification when explaining how the stomach breaks down a meal.","zh":"医生在解释胃如何分解一顿饭时，可能会提到“食糜化”。"}]}],"synonyms":["formation of chyme","gastric digestion (broader)","chyme formation"],"phonetic":"/ˌkaɪmɪfɪˈkeɪʃən/","extraExplanation":["“chymification”是一个医学/生理学术语，日常英语里不常用。更常见的说法是“the stomach turns food into chyme（胃把食物变成食糜）”。","词源提示：chyme（食糜）来自希腊语，和“juice/液体混合物”的概念有关；-fication 表示“使成为/形成……的过程”。"]}
{"word":"chymified","summary":{"en":"Chymified means “turned into chyme” during digestion in the stomach.","zh":"chymified 指“在胃里消化过程中被转化为食糜”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of food in the stomach) changed into chyme (a thick, semi-liquid mixture) during digestion.","zh":"（指胃里的食物）在消化过程中被转化为食糜（chyme，一种浓稠的半流质混合物）。"},"examples":[{"en":"After a few hours, the meal becomes partly chymified in the stomach.","zh":"几小时后，这顿饭在胃里会部分转化为食糜。"},{"en":"Doctors once described the food as “chymified” before it moved into the small intestine.","zh":"过去医生常把食物描述为“已成食糜”，然后它再进入小肠。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past participle of chymify: to turn food into chyme during digestion.","zh":"chymify 的过去分词：把食物在消化过程中转变为食糜。"},"examples":[{"en":"The stomach chymified the food before it passed onward.","zh":"胃先把食物转化为食糜，然后它再继续向前移动。"}]}],"synonyms":["digested (partly)","converted into chyme","partly broken down"],"phonetic":"/ˈkaɪməˌfaɪd/","extraExplanation":["“chymified / chymify”多见于较早期的医学或生理学文献，现代英语里更常用一般表达，如 “digested / partially digested（被/部分被消化）” 或 “turned into chyme（变成食糜）”。","词根与“chyme（食糜）”相关，来源于希腊语，常与消化过程（stomach 胃、small intestine 小肠）一起出现。"]}
{"word":"chymify","summary":{"en":"To chymify means to digest food in the stomach and turn it into chyme.","zh":"chymify 指在胃中把食物消化并转化为食糜（半流质）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Physiology, often old-fashioned) to turn food into chyme in the stomach; to digest and make it into a semi-liquid mass.","zh":"（生理学，常较旧式用法）把食物在胃中转化为“食糜/食糜状物（chyme）”；使其消化成半流质。"},"examples":[{"en":"In the stomach, enzymes help chymify the food before it moves into the small intestine.","zh":"在胃里，酶会帮助把食物食糜化，然后再进入小肠。"},{"en":"Older medical texts sometimes say the stomach “chymifies” what we eat.","zh":"一些较早的医学文献会说胃会把我们吃的东西“食糜化”。"}]}],"synonyms":["digest","convert into chyme","break down (food)"],"phonetic":"ˈkaɪməˌfaɪ","extraExplanation":["“chymify”来自动词化的构词方式：chyme（食糜）+ -ify（使……化/使成为）。现代英语里更常用的说法是 “digest (food)” 或 “turn food into chyme”。","该词多见于较老的医学、生理学写作中；在日常交流里使用会显得书面、学术或古旧。"]}
{"word":"chymifying","summary":{"en":"“Chymifying” is an archaic form meaning “digesting into chyme” or “chemically transforming.”","zh":"“chymifying” 是古旧用法，意思是“把食物消化成食糜”或“以化学方式使某物发生变化”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"chymifying (present participle of **chymify**): (archaic) turning food into **chyme** during digestion; or changing something by a chemical process.\nExamples: 1) The stomach is **chymifying** the meal. 2) Early writers described heat as **chymifying** metals in a furnace.","zh":"chymifying（**chymify** 的现在分词）：（古旧用法）指在消化过程中把食物转变成**食糜（chyme）**；也可指用化学作用改变某物。\n例句：1）胃正在把这顿饭**化为食糜**。2）早期作者会写到热在炉中**以化学方式改变**金属。"},"examples":[{"en":"After you eat, your stomach begins chymifying the food into chyme.","zh":"你吃完后，胃开始把食物 chymifying 成食糜。"},{"en":"In older texts, the verb “chymify” appears in discussions of early chemistry and medicine.","zh":"在较古老的文本里，“chymify”常出现在早期化学与医学的讨论中。"}]}],"synonyms":["digesting","breaking down","chemically transforming","processing"],"phonetic":"/ˈkaɪmɪˌfaɪɪŋ/","extraExplanation":["“chym-” 是较古老的拼写形式，和 **chyme（食糜）**、以及早期的 **chymistry（古拼写的 chemistry）**有关。它来自希腊语 *khymós*（意为“汁液/液体”），后来在炼金术与早期化学文献中常见。","现代英语里这个词非常少用；日常表达通常用 **digesting**（消化）或 **chemically transforming/processing**（化学转化/处理）来替代。"]}
{"word":"chymist","summary":{"en":"“Chymist” is an archaic spelling of “chemist,” seen in older texts.","zh":"“chymist”是“chemist（化学家）”的古旧拼写，常见于旧文本。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) An old spelling of “chemist,” especially used in the 16th–18th centuries; a person who studied or practiced chemistry, often connected with early alchemy and medicine.","zh":"（古旧拼写）“chemist（化学家）”的旧式写法，常见于16—18世纪；指研究或从事化学的人，常与早期炼金术和医药实践有关。"},"examples":[{"en":"In early English texts, the word “chymist” often referred to someone working with metals and medicinal mixtures.","zh":"在早期英文文献中，“chymist”常指研究金属或调配药剂的人。"},{"en":"The book describes a chymist preparing acids in a small laboratory.","zh":"这本书描写了一位“chymist”在小实验室里制备酸。"}]}],"synonyms":["chemist","alchemist (historical context)"],"phonetic":"/ˈkaɪmɪst/","extraExplanation":["“chymist”是“chemist”的历史拼写变体。随着18世纪以后英语拼写逐渐规范化，“chemist”成为标准写法，“chymist”多只在古籍、历史语境或文学仿古写作中出现。","在早期语境中，它有时会与“alchemy（炼金术）”的传统交织：当时的“化学”尚未完全成为现代意义上的科学学科，因此“chymist”可能既做实验也配制药剂，身份边界比今天更模糊。"]}
{"word":"chymistry","summary":{"en":"“Chymistry” is an archaic spelling of “chemistry,” sometimes implying early chemistry mixed with alchemy.","zh":"“chymistry”是“chemistry（化学）”的古拼写，有时暗示早期化学与炼金术交织。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An old (archaic) spelling of “chemistry,” especially common in the 16th–18th centuries; it could refer to early chemistry and sometimes to alchemy-like practices.","zh":"“chemistry（化学）”的古拼写（较古旧），在16—18世纪常见；可指早期化学，有时也带有炼金术式的含义。"},"examples":[{"en":"In the old book, the author writes about “chymistry” and the search for new medicines.","zh":"在那本旧书里，作者写到“chymistry”，以及寻找新药物的过程。"},{"en":"Some early “chymistry” texts mix careful experiments with ideas we now call alchemy.","zh":"一些早期的“chymistry”著作把严谨的实验与我们如今称为炼金术的观念混在一起。"}]}],"synonyms":["chemistry","alchemy (historical context)"],"phonetic":"/ˈkɛmɪstri/","extraExplanation":["“Chymistry”常见于早期英语文献与标题中（例如17世纪的科学著作）。当时“chemistry / chymistry”的拼写尚未统一；在现代学术写作里，作者有时会刻意用“chymistry”来强调“早期化学与炼金术交织”的历史阶段。"]}
{"word":"chymists","summary":{"en":"“Chymists” is an archaic spelling of “chemists,” used mainly in older texts and sometimes implying early chemistry/alchemy.","zh":"“chymists” 是 “chemists（化学家们）” 的古旧拼写，主要见于旧文献，有时带早期化学/炼金术语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of chymist: an archaic spelling of “chemist,” especially common in older texts; sometimes referring to early chemists or alchemists.","zh":"chymist 的复数：英语中“chemist（化学家）”的古旧拼写，常见于古文献；有时也指早期的化学研究者或炼金术士。"},"examples":[{"en":"In old books, you may see “chymists” where modern English would write “chemists.”","zh":"在旧书里，你可能会看到用 “chymists”，而现代英语会写 “chemists”。"},{"en":"Some seventeenth-century writers called both early chemists and alchemists “chymists.”","zh":"一些17世纪的作者把早期化学家和炼金术士都称为 “chymists”。"}]}],"synonyms":["chemists","alchemists (in historical contexts)"],"phonetic":"/ˈkɛmɪsts/","extraExplanation":["“chymist/chymistry” 常见于16–18世纪英语，是 “chemist/chemistry” 的旧拼写。早期“化学”和“炼金术”之间界限不如现代清晰，因此在历史语境中可能带有炼金术色彩。阅读古文献时，遇到该拼写通常可直接按现代意义理解为 chemist（化学家）或 chemistry（化学）。"]}
{"word":"chymo","summary":{"en":"chymo- is a medical combining form meaning “related to chyme” in digestion.","zh":"chymo- 是医学中表示“与食糜有关”的构词成分。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a combining form meaning “related to chyme” (the semi-liquid mixture of food and digestive juices in the stomach), used mainly in medical/scientific words.","zh":"构词成分，表示“与食糜（胃里食物与消化液混合形成的半流体）有关”，主要用于医学/科学词汇中。"},"examples":[{"en":"In words like chymotrypsin, chymo- refers to chyme in digestion.","zh":"在 chymotrypsin（胰凝乳蛋白酶）这类词中，chymo- 指与消化过程中的食糜有关。"},{"en":"Chymo- is common in medical terms, not everyday conversation.","zh":"chymo- 常见于医学术语，而不用于日常口语。"}]}],"synonyms":["chyme-related"],"phonetic":"/ˈkaɪmoʊ/","extraExplanation":["“chymo-”一般不单独作为一个英语单词使用，而是作为词根/构词成分出现。它来自希腊语 khymos，意为“汁液、液体”。","相关常见词：chyme（食糜），chymous（含食糜的），chymotrypsin（胰凝乳蛋白酶）。如果你本来想查的是“Chimo/Chimo!”（某些语境里的感叹语或专有名词），告诉我使用场景我可以再确认。"]}
{"word":"chymosin","summary":{"en":"Chymosin is an enzyme that curdles milk, widely used in cheese-making.","zh":"凝乳酶是一种使牛奶凝固的酶，广泛用于奶酪制作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An enzyme used to curdle milk by clotting the milk protein casein; it is essential in making many cheeses.","zh":"一种用于使牛奶凝固（使酪蛋白结块）的酶；在制作许多奶酪时非常关键。"},"examples":[{"en":"Chymosin is added to milk to form curds for cheese production.","zh":"制作奶酪时会把凝乳酶加入牛奶中，使其形成凝乳块。"},{"en":"Many modern cheese factories use chymosin made through fermentation instead of animal rennet.","zh":"许多现代奶酪工厂使用发酵生产的凝乳酶，而不是动物来源的凝乳酶（凝乳酵素）。"}]}],"synonyms":["rennin","(active enzyme in) rennet","milk-clotting enzyme"],"phonetic":"/kaɪˈmoʊsɪn/","extraExplanation":["“Chymosin”常被称为“rennin”（较旧的名称），传统上来自小牛胃（凝乳酶是“rennet/凝乳剂”中的关键成分）。现在很多产品使用“发酵生产的凝乳酶（FPC）”，由微生物发酵制造，常见于工业化奶酪制作。","在饮食文化与标签阅读中，你可能会看到“animal rennet（动物凝乳剂）”“microbial rennet（微生物凝乳剂）”“FPC（发酵生产的凝乳酶）”。不同来源可能与宗教饮食或素食选择相关（但各标准不完全相同，需看具体认证）。"]}
{"word":"chymosinogen","summary":{"en":"Chymosinogen is the inactive precursor that becomes the milk-curdling enzyme chymosin in the stomach.","zh":"Chymosinogen 是凝乳酶的非活性前体，在胃中被激活后变成能凝固牛奶的凝乳酶（chymosin）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An inactive precursor (zymogen) that is converted into the active enzyme chymosin in the stomach, especially in young calves.","zh":"（酶原）凝乳酶的非活性前体，在胃中（尤其是小牛胃中）被激活并转化为有活性的凝乳酶（chymosin）。"},"examples":[{"en":"In young calves, chymosinogen is activated in the acidic stomach to form chymosin.","zh":"在小牛体内，chymosinogen 会在胃的酸性环境中被激活，转化为凝乳酶 chymosin。"},{"en":"Researchers measured chymosinogen levels to study how milk-digesting enzymes develop.","zh":"研究人员测量 chymosinogen 的水平，以研究消化牛奶的酶如何发育。"}]}],"synonyms":["prochymosin","prorennin"],"phonetic":"/kaɪˈmoʊsɪnədʒən/","extraExplanation":["“chymosinogen”由“chymosin（凝乳酶）+ -ogen（……的前体/生成物）”构成；在生物化学里，-ogen 常用来表示“尚未激活的形式”。","它与奶酪制作有关：真正使牛奶蛋白（主要是酪蛋白）凝固的是活性酶 chymosin；传统凝乳酶最初来源于小牛胃。现代工业也常用微生物发酵生产的凝乳酶（FPC），概念上与“chymosinogen→chymosin”的消化过程有关。"]}
{"word":"chymosins","summary":{"en":"“Chymosins” is the plural form of “chymosin,” the milk-curdling enzyme widely used in cheese making.","zh":"“Chymosins”是“chymosin”的复数，指广泛用于奶酪制作、使牛奶凝固的酶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of chymosin: an enzyme (also called rennin) used to coagulate milk, especially in making cheese.","zh":"chymosin 的复数：一种酶（也叫 rennin），用于使牛奶凝固，尤其常用于制奶酪。"},"examples":[{"en":"Many traditional cheeses are made using chymosins to help the milk form curds.","zh":"许多传统奶酪会使用 chymosins 来帮助牛奶形成凝乳（curds）。"},{"en":"Some factories use microbial or recombinant chymosins instead of animal rennet.","zh":"有些工厂会使用微生物或重组（基因工程）chymosins，而不是动物来源的凝乳酶。"}]}],"synonyms":["rennin","rennet (context-dependent)","milk-curdling enzyme"],"phonetic":"/kaɪˈmoʊsɪnz/","extraExplanation":["chymosin 常被称为“rennet（凝乳酶）”的关键成分之一，传统上来源于小牛胃中；现代食品工业中也常见“微生物来源”或“重组 chymosin（基因工程生产）”，以满足成本、稳定性或饮食偏好（如素食者部分可接受）的需求。","在奶酪制作里，chymosin 的作用是切割牛奶中的 κ-酪蛋白（kappa-casein），从而促使酪蛋白聚集成凝乳；凝乳再经过切割、加热、压制等步骤成为奶酪。"]}
{"word":"chymotrypsin","summary":{"en":"Chymotrypsin is a pancreatic digestive enzyme that breaks down proteins.","zh":"Chymotrypsin（胰凝乳蛋白酶）是胰腺分泌的消化酶，用于分解蛋白质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a digestive enzyme made by the pancreas that helps break down proteins into smaller peptides (it works best in the small intestine).","zh":"一种由胰腺产生的消化酶，帮助把蛋白质分解成更小的肽（主要在小肠中发挥作用）。"},"examples":[{"en":"Chymotrypsin helps the body digest protein from foods like meat, eggs, and beans.","zh":"胰凝乳蛋白酶帮助人体消化来自肉类、鸡蛋和豆类等食物中的蛋白质。"},{"en":"Doctors may measure certain digestive enzymes, such as chymotrypsin, to check pancreatic function.","zh":"医生可能会检测某些消化酶（如胰凝乳蛋白酶）来评估胰腺功能。"}]}],"synonyms":["protease","digestive enzyme"],"phonetic":"/ˌkaɪmoʊˈtrɪpsɪn/","extraExplanation":["词源小提示：chymo- 与“食糜/消化内容物”有关，trypsin 指一类“分解蛋白质的酶”。chymotrypsin 常与 trypsin 并列出现，二者都属于蛋白酶，但切割蛋白质的“偏好位点”不同。"]}
{"word":"chymotrypsinogen","summary":{"en":"Chymotrypsinogen is the inactive pancreatic precursor that becomes chymotrypsin for protein digestion.","zh":"chymotrypsinogen 指胰腺分泌的无活性酶原，激活后变为胰凝乳蛋白酶参与蛋白质消化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An inactive enzyme precursor (zymogen) made by the pancreas that is converted into chymotrypsin, a protease that helps digest proteins in the small intestine.","zh":"胰凝乳蛋白酶原（酶原）：由胰腺产生的“无活性酶前体”，在小肠中被激活后转变为胰凝乳蛋白酶，参与蛋白质消化。"},"examples":[{"en":"The pancreas secretes chymotrypsinogen, which is activated in the small intestine to help digest proteins.","zh":"胰腺分泌胰凝乳蛋白酶原，它在小肠中被激活，帮助消化蛋白质。"},{"en":"In biochemistry class, we learned that chymotrypsinogen becomes chymotrypsin after specific cleavage.","zh":"在生物化学课上，我们学到胰凝乳蛋白酶原经过特定切割后会变成胰凝乳蛋白酶。"}]}],"synonyms":["proenzyme","zymogen"],"phonetic":"/ˌkaɪ.moʊˈtrɪp.sɪn.ə.dʒən/","extraExplanation":["“chymo-”与“凝乳/食糜（chyme）”相关，“trypsin”来自希腊语，意为“摩擦/磨碎”，在命名上常用于表示“分解蛋白质的消化酶”；“-ogen”表示“前体/生成……的物质”。因此 chymotrypsinogen 字面上就是“生成胰凝乳蛋白酶的前体”。","在人体内，使用“酶原（zymogen）”形式分泌有助于避免胰腺被自身产生的蛋白酶“自我消化”。它通常先被另一种酶（如胰蛋白酶 trypsin）切割激活，再发挥作用。"]}
{"word":"chymous","summary":{"en":"“Chymous” is a medical adjective meaning “related to chyme,” the semi-liquid partially digested food in the stomach.","zh":"“chymous”是医学形容词，表示“与食糜有关”，即胃内半流体的半消化食物混合物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to chyme: the semi-liquid mixture of partially digested food and digestive juices in the stomach.","zh":"与“食糜（chyme）”有关的；指胃里由半消化食物与消化液混合形成的半流体混合物。"},"examples":[{"en":"Doctors described the patient’s vomiting as containing chymous material.","zh":"医生描述病人的呕吐物含有食糜样物质。"},{"en":"The lab report noted a chymous mixture taken from the stomach.","zh":"化验报告记录了从胃中取出的食糜样混合物。"}]}],"synonyms":["chyme-related","of chyme"],"phonetic":"/ˈkaɪməs/","extraExplanation":["“chymous”是医学/生理学用词，日常英语很少用。更常见的相关词是“chyme”（食糜，名词）。","词源上与希腊语 *chymos*（汁液、液体）有关，因此常出现在消化系统的语境中。"]}
{"word":"chyometer","summary":{"en":"A rare, mostly obsolete word for an instrument that measures the density (specific gravity) of liquids.","zh":"一个罕见且多已废用的词，指测量液体密度（比重）的仪器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/obsolete) An instrument used to measure the density or specific gravity of liquids, similar to a hydrometer.","zh":"（罕见/已废用）一种用于测量液体密度或比重的仪器，类似于比重计（hydrometer）。"},"examples":[{"en":"In some older scientific writing, a chyometer was mentioned as a tool for testing liquid density.","zh":"在一些较早的科学文献中，会提到 chyometer 作为测试液体密度的工具。"},{"en":"The lab replaced the old chyometer with a modern hydrometer.","zh":"实验室用现代比重计替换了旧的 chyometer。"}]}],"synonyms":["hydrometer","densimeter"],"phonetic":"/kaɪˈɑmɪtɚ/","extraExplanation":["这个词在现代英语里几乎不使用，也不常见于主流词典。你可能想找的是更常用的词，比如：\n- hydrometer（比重计，测液体密度/比重）\n- cryometer（冰点计/低温计，用于测定凝固点）\n如果你能提供出现它的句子或领域（化学/医学/工程等），我可以帮你确认最准确的含义与对应术语。"]}
{"word":"Chyou","summary":{"en":"“Chyou” is not a standard English word; it’s usually a name/romanization or a misspelling (often of “chew”).","zh":"“Chyou”不是标准英文词；通常是人名/音译拼写，或是拼错（常见为“chew”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most often seen as a personal name or a romanized spelling from another language (for example, Japanese/Korean/Chinese names), or as a misspelling of common English words like “chew” or “choose you.”","zh":"不是标准英文单词。更常见于人名或其他语言的罗马字拼写（例如日语/韩语/中文姓名的拼写），也可能是常见英文词（如“chew/咀嚼”或口语里的“choose you/选择你”）的误拼。"},"examples":[{"en":"I couldn’t find “Chyou” in an English dictionary—do you mean “chew”?","zh":"我在英文词典里找不到“Chyou”——你是不是想写“chew（咀嚼）”？"},{"en":"Chyou might be a family name in your context; could you share the sentence it appears in?","zh":"在你的语境里，Chyou 可能是姓氏；你能把它出现的句子发我吗？"}]}],"phonetic":"/tʃuː/","extraExplanation":["“Chyou”本身不属于常见英语拼写体系，所以在英语学习中通常不作为词汇来记。更可能的情况有：\n1）名字/姓氏的音译或自定拼写（不同地区会有多种拼法）；\n2）把“chew /tʃuː/（咀嚼）”误写成 Chyou；\n3）在口语或网络语境里把“choose you（选择你）”缩写/谐写成类似拼法。\n如果你把原句或来源（例如游戏ID、日文罗马字、韩文拼写、中文姓名）发来，我可以更准确判断含义与更自然的英文表达。"]}
{"word":"chypre","summary":{"en":"Chypre is a classic perfume family: citrus on top with a mossy, woody base.","zh":"Chypre（西普调）是一种经典香水香调：上部多为柑橘清新，底部偏苔藓与木质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fragrance family in perfumery that typically combines citrus top notes with a mossy, woody base (often featuring oakmoss, labdanum, and patchouli).","zh":"（香水）西普调：一种经典香调类型，常见结构是清新的柑橘前调，搭配苔藓感、木质感的基调（常见原料包括橡苔、劳丹脂、广藿香等）。"},"examples":[{"en":"She prefers chypre perfumes because they smell crisp at first and then turn warm and earthy.","zh":"她喜欢西普调香水，因为一开始清爽，随后会变得温暖而带有泥土与苔藓的气息。"},{"en":"This classic chypre has a bright bergamot opening and a deep mossy finish.","zh":"这款经典西普调以明亮的佛手柑开场，最后收在深沉的苔藓基调上。"}]}],"synonyms":["chypre accord","mossy woody fragrance","chypre-style perfume"],"phonetic":"/ˈʃiːprə/","extraExplanation":["“Chypre”是法语词（读音也常按法语习惯来读），字面与“塞浦路斯（Cyprus）”有关。现代香水语境中，它主要指一种香调结构，而不是某一种单一气味。","在香水史上，“Chypre”这一香调名称常与1917年 François Coty 的香水《Chypre》相关，它奠定了这种“柑橘+苔藓木质”的经典框架。","由于成分法规与过敏原限制，现代西普调常用替代材料来模拟橡苔的效果，因此你会看到“modern chypre（现代西普）”或“chypre-like（类西普）”等说法。"]}
{"word":"chytra","summary":{"en":"Chytra is a rare word meaning a clay cooking pot, borrowed from Greek; it’s mainly seen in etymology (e.g., related to “chytrid”).","zh":"chytra 是个罕见词，指希腊语来源的陶制炊锅；在英文里多见于词源说明（如与 chytrid“壶菌”相关）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A clay or earthenware cooking pot (a borrowing from Modern Greek χύτρα).","zh":"（罕见）陶制/瓦制的炊锅（源自现代希腊语 χύτρα，意为“锅”）。"},"examples":[{"en":"The stew simmered slowly in a chytra over the fire.","zh":"炖菜在火上用一口 chytra 慢慢煨着。"},{"en":"In some Greek homes, a chytra is used for hearty soups and beans.","zh":"在一些希腊家庭里，chytra 常用来煮浓汤或豆类。"}]}],"synonyms":["earthenware pot","clay pot","cooking pot"],"phonetic":"/ˈkɪtrə/","extraExplanation":["这个词在英文里非常少见，更多时候会在词源说明里出现。生物学名词 chytrid（壶菌/壶菌类真菌）的词根 chytr- 就来自希腊语 χύτρα（“锅”），因为它们的某些结构形状像小壶或小锅。","如果你是在阅读生物/生态学资料时遇到的“chytra”，也有可能是拼写或简写问题；常见的相关词是 chytrid /ˈkɪtrɪd/。建议你贴出原句，我可以帮你判断具体含义。"]}
{"word":"chytrid","summary":{"en":"Chytrid is a kind of fungus; in common conservation talk, it often refers to the chytrid fungus that infects amphibians.","zh":"Chytrid 指一种壶菌；在常见的生态保护语境中，它也常特指感染两栖动物的致病壶菌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of fungus (from the group Chytridiomycota), usually living in water or wet soil; some species can infect plants or animals","zh":"一种壶菌（隶属壶菌门），通常生活在水中或潮湿土壤里；其中一些种类会感染植物或动物"},"examples":[{"en":"Scientists study chytrid fungi in ponds and wetlands.","zh":"科学家在池塘和湿地研究壶菌。"},{"en":"Some chytrids are parasites, while others help break down dead material.","zh":"有些壶菌是寄生的，而另一些则帮助分解死亡的有机物。"}]},{"partOfSpeech":"n.","definition":{"en":"a disease-causing chytrid fungus that infects amphibians (often referring to the fungus behind chytridiomycosis)","zh":"可导致疾病的壶菌（常指引起两栖动物“壶菌病”的那类真菌）"},"examples":[{"en":"Chytrid has been linked to declines in frog populations in many regions.","zh":"壶菌与许多地区青蛙种群数量下降有关。"},{"en":"Conservation teams screen frogs to reduce the spread of chytrid.","zh":"保护团队会检测青蛙，以减少壶菌的传播。"}]}],"synonyms":["chytrid fungus","chytridiomycete"],"phonetic":"/ˈkɪt.rɪd/","extraExplanation":["“chytrid”来自希腊语 chytra（意为“罐、壶”），与这类真菌某些结构的“壶状/罐状”外形有关。","在新闻与科普语境里，chytrid 常被用作简写，尤其指两栖动物壶菌病相关的病原真菌（如 Bd）。但在真菌学语境中，它也可以泛指壶菌门的成员，不一定都是致病的。"]}
{"word":"chytrid-related","summary":{"en":"“Chytrid-related” means connected with chytrid fungi, especially chytrid disease affecting amphibians.","zh":"“chytrid-related”表示与壶菌有关的，尤指与两栖动物壶菌病/壶菌感染相关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with chytrids (a type of fungus), especially the chytrid fungi that can cause disease in amphibians.","zh":"与壶菌（chytrids，一类真菌）有关的；尤指会导致两栖动物患病的壶菌相关的真菌或疾病。"},"examples":[{"en":"Scientists tracked chytrid-related deaths in local frog populations.","zh":"科学家追踪了当地青蛙种群中与壶菌相关的死亡案例。"},{"en":"The team developed a protocol to reduce chytrid-related infection risk during fieldwork.","zh":"团队制定了在野外工作时降低壶菌相关感染风险的流程。"}]}],"synonyms":["chytrid-associated","chytrid-linked","Bd-related (specific)"],"phonetic":"/ˈkɪt.rɪd rɪˌleɪ.tɪd/","extraExplanation":["“Chytrid”常指壶菌门中的某些真菌；在生态与保育语境里，最常被提到的是导致两栖动物壶菌病的病原，如 Batrachochytrium dendrobatidis（常写作 Bd）与 B. salamandrivorans（Bsal）。因此“chytrid-related”在新闻、论文中常用来概括“与壶菌病/壶菌感染相关”的问题（例如死亡率、传播、检疫与消毒措施）。","构词提示：这是“chytrid + related”的复合形容词，常见搭配有 chytrid-related disease/infection/mortality/declines。也可写作不加连字符的 chytrid related（较少见），或用更具体的说法如 Bd-related（更专业）。"]}
{"word":"Chytridiaceae","summary":{"en":"Chytridiaceae is a scientific name for a family of chytrid fungi, often associated with water and zoospore production.","zh":"Chytridiaceae 是壶菌科的学名，指一类多与水环境相关、常产生游动孢子的壶菌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of chytrid fungi (simple, mostly aquatic fungi) within the phylum Chytridiomycota; members often produce swimming spores (zoospores).","zh":"（真菌学）壶菌科：壶菌门中的一个真菌科，成员多与水环境相关，常产生能游动的孢子（游动孢子）。"},"examples":[{"en":"Chytridiaceae includes several chytrid fungi that live in freshwater habitats.","zh":"壶菌科包含多种生活在淡水环境中的壶菌。"},{"en":"Under the microscope, some Chytridiaceae species can be identified by their zoospores.","zh":"在显微镜下，有些壶菌科物种可通过其游动孢子来辨认。"}]}],"synonyms":["chytrid family","Chytridiaceae (taxonomic family)"],"phonetic":"/ˌkɪtrɪdɪˈeɪsiˌi/","extraExplanation":["“Chytridiaceae”是生物分类学用语，常见于论文、教材和物种鉴定报告中，日常英语里很少用。","词根提示：chytrid（壶菌）来自希腊语“chytra”（陶壶、罐子），与这类真菌某些结构形态的联想有关；-aceae 是植物/真菌“科”名常见后缀（表示“……科”）。","与两栖类壶菌病相关的病原体常被称为“chytrids（壶菌）”；不过具体病原体的分类位置可能随研究更新而变化，阅读文献时以最新分类为准。"]}
{"word":"chytridiaceae","summary":{"en":"Chytridiaceae is a taxonomic family name for certain chytrid fungi, often found in wet environments.","zh":"Chytridiaceae（壶菌科）是某些壶菌类真菌的科级分类名称，常见于潮湿或水生环境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of chytrid fungi (aquatic or moisture-loving fungi with motile spores), including species found in soil and freshwater; used as a taxonomic name in biology","zh":"（生物分类）壶菌科：壶菌类真菌的一科，多见于土壤与淡水等潮湿环境，具有能游动的孢子；用于生物学分类名称"},"examples":[{"en":"In the lab, we identified the sample as belonging to the family Chytridiaceae.","zh":"在实验室里，我们鉴定该样本属于壶菌科（Chytridiaceae）。"},{"en":"Some Chytridiaceae species live in freshwater and feed on algae or decaying material.","zh":"一些壶菌科物种生活在淡水中，以藻类或腐烂有机物为食。"}]}],"synonyms":["chytrid family"],"phonetic":"/ˌkaɪtrɪˈdiːeɪsiˌiː/","extraExplanation":["“Chytridiaceae”是拉丁化的科名，常见于学术论文与分类检索中；日常英语里通常不会用到。","它属于壶菌门（Chytridiomycota）相关的分类范围。壶菌类的一个典型特征是产生带鞭毛、可游动的孢子（zoospores），因此常与水环境或潮湿环境相关。"]}
{"word":"chytridiacean","summary":{"en":"Chytridiacean means “related to chytrids,” or it can mean a chytrid fungus itself, mainly in scientific contexts.","zh":"chytridiacean 指“与壶菌（壶菌类）有关的”，也可指“壶菌本身”，主要用于科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(biology) Relating to chytrids—very small fungi (or fungus-like organisms) that often live in water or wet soil.","zh":"（生物）与壶菌（chytrids）有关的——一种非常微小的真菌（或类真菌生物），常生活在水中或潮湿土壤里。"},"examples":[{"en":"Chytridiacean fungi produce swimming spores that move through water.","zh":"壶菌类（chytridiacean）真菌会产生能在水中游动的孢子。"},{"en":"The researcher identified a chytridiacean organism in the pond sample.","zh":"研究人员在池塘样本中鉴定出一种壶菌类（chytridiacean）生物。"}]},{"partOfSpeech":"n.","definition":{"en":"A chytrid fungus; an organism belonging to the chytrids (often used in scientific writing).","zh":"壶菌；壶菌类生物（常见于科学写作中的用法）。"},"examples":[{"en":"Under the microscope, the chytridiacean appeared as a tiny spherical structure.","zh":"在显微镜下，这个壶菌类生物（chytridiacean）呈现为很小的球形结构。"}]}],"synonyms":["chytrid","chytrid fungus"],"phonetic":"/ˌkaɪtrɪˈdiːʃiən/","extraExplanation":["“chytridiacean”主要用于真菌学/生物学语境，属于相对专业的词。日常英语中更常见的说法是“chytrid”或“chytrid fungus”。","词源提示：chytrid- 来自希腊语 *chytra*（意为“陶罐/小锅”），与其某些结构外形相似有关。","相关文化/科学背景：壶菌中有些物种与两栖动物疾病有关（如引发“壶菌病”的病原体常被简称为 chytrid），因此在生态学与保护生物学文献中会出现较多。"]}
{"word":"chytridiaceous","summary":{"en":"An adjective meaning “related to chytrid fungi.”","zh":"形容词：表示“与壶菌（壶菌类真菌）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or characteristic of chytrids (a group of microscopic fungi, often living in water or moist environments).","zh":"（形容词）与壶菌（chytrids，一类常见于水域或潮湿环境的微小真菌）有关的；具有壶菌特征的。"},"examples":[{"en":"Scientists monitored chytridiaceous fungi in pond water samples.","zh":"科学家在池塘水样中监测壶菌类真菌。"},{"en":"The lab identified a chytridiaceous organism under the microscope.","zh":"实验室在显微镜下鉴定出一种壶菌类生物。"}]}],"synonyms":["chytrid","chytridial","chytridiacean"],"phonetic":"ˌkaɪtrɪˈdɪeɪʃəs","extraExplanation":["“chytridiaceous”来自“Chytridiaceae/Chytrid-”（壶菌相关分类名/词根）+ 形容词后缀“-aceous”（表示“……的、类似……的”）。在生物学论文里常用于描述“属于壶菌类群或与壶菌相似”的特征。","壶菌（chytrids）中有些会引起动物疾病，最常被大众提到的是与两栖动物数量下降相关的“壶菌病”（chytridiomycosis）。不过“chytridiaceous”本身只是中性描述词，不一定表示致病。"]}
{"word":"chytridial","summary":{"en":"Chytridial means “related to chytrid fungi,” often in scientific discussions about amphibian infections.","zh":"chytridial 意为“与壶菌（壶菌类真菌）有关的”，常见于关于两栖动物感染的科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to chytrids (a group of microscopic fungi), especially the chytrid fungi that can infect amphibians.","zh":"与壶菌（chytrids，一类微小真菌）有关的；尤指会感染两栖动物的壶菌类真菌。"},"examples":[{"en":"Scientists monitored chytridial infection in local frog populations.","zh":"科学家监测了当地青蛙种群中的壶菌相关感染情况。"},{"en":"Chytridial disease has been linked to amphibian declines in some regions.","zh":"在一些地区，壶菌相关疾病与两栖动物数量下降有关。"}]}],"synonyms":["chytrid","chytrid-related"],"phonetic":"/kaɪˈtrɪdiəl/","extraExplanation":["“chytridial”来自“chytrid（壶菌）”。在生态与保育语境中，常与“chytridiomycosis（壶菌病）”一起出现，指由壶菌（如 Bd, Batrachochytrium dendrobatidis）引起、会影响两栖动物皮肤功能的疾病。","日常英语中很少用到这个词，更常见的搭配是“chytrid fungus（壶菌）”“chytrid infection（壶菌感染）”“chytridial disease（壶菌相关疾病）”。"]}
{"word":"Chytridiales","summary":{"en":"Chytridiales is an order of chytrid fungi, often aquatic, known for producing swimming spores.","zh":"Chytridiales（壶菌目）是壶菌类真菌的一个“目”，多见于水环境，以产生可游动的孢子为特点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an order of chytrid fungi (primitive, mostly aquatic fungi) that produce swimming spores (zoospores).","zh":"壶菌目；一种壶菌类真菌的“目”（分类等级），多生活在水中或潮湿环境，能产生可游动的孢子（游动孢子）。"},"examples":[{"en":"Many species in Chytridiales live in freshwater ponds and wet soils.","zh":"壶菌目中的许多物种生活在淡水池塘和潮湿土壤中。"},{"en":"Researchers study Chytridiales to understand early fungal evolution.","zh":"研究人员研究壶菌目，以了解真菌早期的演化。"}]}],"synonyms":["chytrid order","order Chytridiales"],"phonetic":"/kaɪˈtrɪdiˌeɪliːz/","extraExplanation":["“Chytridiales”是生物分类学名称：以“-ales”结尾通常表示“目”（order），属于真菌界壶菌门（Chytridiomycota）中的一个类群。","壶菌常见特征之一是产生带鞭毛、能游动的孢子（zoospores），这在真菌中相对少见，因此在生物学教材中常被用来说明真菌的多样性。","大众媒体中常提到导致两栖动物群体受威胁的“壶菌病”（chytridiomycosis），主要病原常被称为Bd（Batrachochytrium dendrobatidis）。它属于壶菌类，但不等同于整个“壶菌目”。"]}
{"word":"chytridiales","summary":{"en":"Chytridiales is a scientific term for an order of aquatic or moisture-loving fungi (chytrids).","zh":"Chytridiales 是科学名称，指壶菌门中一类多生活在水中或潮湿环境的真菌“目”（壶菌目）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an order of chytrids (primitive fungi) in the phylum Chytridiomycota, often found in water or wet environments; some members are parasites of plants or animals","zh":"壶菌目（Chytridiales）：壶菌门中的一个“目”（分类等级），多生活在水中或潮湿环境；其中一些成员可寄生植物或动物"},"examples":[{"en":"Chytridiales are common in freshwater habitats such as ponds and streams.","zh":"壶菌目常见于淡水环境，如池塘和溪流。"},{"en":"Some researchers study Chytridiales to understand fungal evolution and early-diverging fungi.","zh":"一些研究人员研究壶菌目，以了解真菌的演化以及早期分化的真菌类群。"}]}],"synonyms":["order Chytridiales","chytrids (general term)"],"phonetic":"/kaɪˈtrɪdiəliːz/","extraExplanation":["“Chytridiales”是拉丁化的科学名称（复数形式常见），在论文中通常首字母大写并用斜体（*Chytridiales*）。","壶菌目与两栖动物“壶菌病”常被一起提到，但致病物种更常见于相关类群（如 *Batrachochytrium*），具体分类需看研究语境。","词源提示：chytrid- 来自希腊语 *chytra*（“陶罐”），指其某些结构形状像小罐。"]}
{"word":"chytridiomycete","summary":{"en":"A chytridiomycete is a chytrid fungus, often aquatic, known for making swimming spores.","zh":"chytridiomycete 指壶菌（一类常见于水域或潮湿环境的真菌），以产生能游动的孢子为特征。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of fungus in the group Chytridiomycota, usually living in water or very moist places and producing swimming spores (zoospores).","zh":"壶菌（壶菌门）的真菌；多生活在水中或潮湿环境里，会产生能游动的孢子（游动孢子）。"},"examples":[{"en":"Chytridiomycetes often live in ponds and wet soil.","zh":"壶菌常见于池塘和潮湿的土壤中。"},{"en":"Some chytridiomycetes infect algae, plants, or animals.","zh":"有些壶菌会感染藻类、植物或动物。"},{"en":"Scientists study chytridiomycetes to understand how early fungi evolved.","zh":"科学家研究壶菌，以了解早期真菌的演化。"}]}],"synonyms":["chytrid","chytrid fungus"],"phonetic":"/ˌkaɪ.trɪd.i.oʊ.maɪˈsiːt/","extraExplanation":["“chytridiomycete”常出现在生物学/生态学语境中，指一类相对“原始”的真菌。它们的一个典型特征是产生带鞭毛、可以在水中游动的孢子（zoospores）。","你可能在新闻或纪录片里见到相关词：某些壶菌（如 *Batrachochytrium dendrobatidis*）会引发两栖动物的“壶菌病”（chytridiomycosis），与全球部分蛙类数量下降有关。","词源提示：chytrid- 来自希腊语 *chytra*（意为“罐子/陶壶”），与其孢子囊形状相似有关；-mycete 来自希腊语 *mykēs*（“真菌”）。"]}
{"word":"chytridiomycosis","summary":{"en":"Chytridiomycosis is a fungal disease that infects amphibian skin and can be deadly.","zh":"Chytridiomycosis（壶菌病）是一种感染两栖动物皮肤、可能致命的真菌病。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a serious fungal disease in amphibians (like frogs and salamanders) caused by chytrid fungi, which infect the skin and can lead to death","zh":"两栖动物（如青蛙、蝾螈）的一种严重真菌性疾病，由壶菌感染皮肤引起，可能导致死亡"},"examples":[{"en":"Chytridiomycosis has contributed to the decline of many frog populations worldwide.","zh":"壶菌病促成了全球许多青蛙种群的衰退。"},{"en":"Researchers test captured frogs for chytridiomycosis before releasing them back into the wild.","zh":"研究人员会在放生前检测捕获的青蛙是否感染壶菌病。"}]}],"synonyms":["amphibian chytrid disease","chytrid disease"],"phonetic":"/ˌkɪt.rɪd.i.oʊ.maɪˈkoʊ.sɪs/","extraExplanation":["“chytridiomycosis”常用于生物学与环境保护语境，是由壶菌（chytrid fungi）引起的皮肤感染。两栖动物的皮肤不仅是“皮”，还参与呼吸与水盐（电解质）平衡；因此感染后可能导致严重生理失衡。","词源上，“-mycosis”表示“真菌感染/真菌病”；“chytrid-”来自希腊语词根，和“壶/容器”有关，用来指一类具有特征性结构的真菌。","常见搭配：chytridiomycosis outbreak（壶菌病暴发）、spread of chytridiomycosis（壶菌病传播）、a chytridiomycosis-positive frog（检测呈壶菌病阳性的青蛙）。"]}
{"word":"chytridiose","summary":{"en":"Chytridiose is a chytrid-fungus disease in amphibians, often linked to major frog declines.","zh":"Chytridiose 指两栖动物感染壶菌引起的壶菌病，常与青蛙等种群锐减有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fungal disease (especially in amphibians like frogs) caused by chytrid fungi, often leading to severe skin damage and population decline","zh":"（尤指青蛙等两栖动物的）壶菌病；由壶菌感染引起的真菌性疾病，常造成皮肤受损并导致种群下降"},"examples":[{"en":"Chytridiose has contributed to the decline of frog populations in many parts of the world.","zh":"壶菌病导致世界许多地区的青蛙种群数量下降。"},{"en":"Researchers monitor wild amphibians for signs of chytridiose.","zh":"研究人员会监测野生两栖动物是否出现壶菌病的迹象。"}]}],"synonyms":["chytridiomycosis","chytrid disease"],"phonetic":"/kɪˌtrɪdiˈoʊs/","extraExplanation":["“chytridiose”常见于法语或部分学术写法中；英语更常用的对应词是 **chytridiomycosis**（壶菌病）。","这种病主要影响两栖动物的皮肤（两栖类皮肤参与呼吸与水盐平衡），因此感染后可能出现行动迟缓、蜕皮异常，严重时导致死亡。","词源上与希腊语 *chytrid-*（与“壶/罐”有关）相关，因为这类真菌的某些结构形态像小容器。"]}
{"word":"chytridiosis","summary":{"en":"Chytridiosis is a fungal disease caused by chytrid fungi, best known for infecting amphibians (like frogs).","zh":"Chytridiosis 指由壶菌引起的真菌病，最常用于描述感染两栖动物（如青蛙）的情况。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fungal disease (especially in amphibians) caused by chytrid fungi, often attacking the skin and potentially leading to death","zh":"（尤指两栖动物的）壶菌病；由壶菌引起的真菌性疾病，常侵害皮肤，严重时可致死"},"examples":[{"en":"Chytridiosis has contributed to severe frog population declines in many regions.","zh":"壶菌病导致许多地区的青蛙种群严重下降。"},{"en":"Scientists test frogs for chytridiosis by swabbing their skin.","zh":"科学家通过擦拭蛙类皮肤取样来检测壶菌病。"}]}],"synonyms":["chytridiomycosis"],"phonetic":"/kɪˌtrɪdiˈoʊsɪs/","extraExplanation":["在自然保护语境中，这个词常与“全球两栖动物衰退（amphibian decline）”一起出现；由于壶菌能在水环境中传播、且对部分物种致死率高，它被视为重要的生物多样性威胁之一。","常见相关术语包括：chytrid fungus（壶菌）、chytridiomycosis（壶菌病/壶菌感染；在学术文献中更常见）、Bd（Batrachochytrium dendrobatidis 的缩写，最常被提及的致病壶菌）。"]}
{"word":"Chytridium","summary":{"en":"Chytridium is a genus of tiny aquatic/moist-environment fungi (chytrids) that produce swimming spores; some are parasites.","zh":"Chytridium（壶菌属）是一类常见于水中或潮湿环境的微小真菌，能产生会游动的孢子；部分物种具有寄生性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of microscopic fungi (chytrids) that often live in water or very moist environments and reproduce using swimming spores (zoospores); some species can infect algae, plants, or other organisms","zh":"壶菌属（Chytridium）：一类微小的真菌（壶菌类），常生活在水中或极潮湿环境，通过能游动的孢子（游动孢子）繁殖；其中一些种可寄生或感染藻类、植物或其他生物"},"examples":[{"en":"Under the microscope, the sample showed structures typical of Chytridium.","zh":"在显微镜下，这个样本呈现出典型的壶菌属（Chytridium）结构。"},{"en":"Some Chytridium species are parasites of algae in freshwater ponds.","zh":"一些壶菌属（Chytridium）的物种会寄生在淡水池塘中的藻类上。"}]}],"synonyms":["chytrid (related, informal)","chytridiomycete (broader group)"],"phonetic":"/kaɪˈtrɪdiəm/","extraExplanation":["词源小提示：Chytridium 来自希腊语 chytra（意为“陶壶/小锅”），与其形态特征有关——部分壶菌的孢子囊形状像小壶或小瓶。","学习用法：这是生物学/真菌学里的专有名词，写作时常作为属名使用（拉丁学名格式通常斜体、首字母大写），例如 Chytridium sp.（表示“壶菌属的某个未确定种”）。"]}
{"word":"chytridium","summary":{"en":"Chytridium is a scientific name for a genus of microscopic aquatic/ moisture-loving fungi (chytrids).","zh":"Chytridium（壶菌属）是一个真菌属的学名，属于常见于水中或潮湿环境的微小壶菌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of microscopic fungi (chytrids) that typically live in water or wet environments and reproduce with swimming spores","zh":"壶菌属；一类微小的壶菌（多生于水中或潮湿环境），常通过能游动的孢子繁殖"},"examples":[{"en":"Under the microscope, the biologist identified the sample as Chytridium.","zh":"在显微镜下，生物学家把样本鉴定为壶菌属（Chytridium）。"},{"en":"Some species of Chytridium can infect algae or other small organisms in ponds.","zh":"壶菌属的一些物种会感染池塘中的藻类或其他小型生物。"}]}],"synonyms":["chytrid","chytrid fungus","fungus (general)"],"phonetic":"/kaɪˈtrɪdiəm/","extraExplanation":["“Chytridium”是拉丁化的学名，常见于生物学与生态学文献中；日常英语里更常用更宽泛的词“chytrid”（壶菌）来指这一类真菌。","壶菌（chytrids）的一个典型特征是产生带鞭毛、能游动的孢子（zoospores），因此常与水环境联系在一起。"]}
{"word":"chytrids","summary":{"en":"Chytrids are microscopic fungi; some live in water and some can infect plants or animals.","zh":"壶菌是一类微小真菌；有的生活在水中，有的会感染植物或动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of microscopic fungus (plural) in the group Chytridiomycota, often found in water or damp soil; some species infect plants and animals","zh":"（复数）壶菌：一类微小真菌（隶属壶菌门 Chytridiomycota），常见于水体或潮湿土壤；其中一些种类会感染植物或动物"},"examples":[{"en":"Scientists study chytrids in lakes to understand how they affect algae populations.","zh":"科学家研究湖泊中的壶菌，以了解它们如何影响藻类种群。"},{"en":"Some chytrids can infect amphibians and cause serious disease.","zh":"有些壶菌会感染两栖动物并引发严重疾病。"}]}],"synonyms":["chytrid fungi","Chytridiomycota"],"phonetic":"/ˈkɪtrɪdz/","extraExplanation":["“Chytrids”是“chytrid”的复数。这个词常见于生物学、生态学与新闻报道中，尤其与“两栖动物壶菌病”（chytridiomycosis）相关。该病由某些壶菌（如 Bd）引起，被认为与全球多地两栖动物数量下降有关。","词源上与希腊语中表示“壶/容器”的词根有关，指的是这类真菌某些阶段呈“壶状”的结构。"]}
{"word":"Chytroi","summary":{"en":"“Chytroi” is a non-English transliteration meaning “clever” or “cunning/sly” in Ukrainian/Russian contexts.","zh":"“Chytroi”不是英语词，而是乌克兰语/俄语中的转写，表示“聪明、机灵”，也可指“狡猾”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Not a standard English word) A transliteration of the Ukrainian/Russian adjective meaning “clever” or “cunning/sly,” often implying smartness used in a tricky or deceptive way depending on context.","zh":"（非标准英语词）乌克兰语/俄语形容词的拉丁转写，意思是“聪明、机灵”，有时也带“狡猾、耍小聪明”的含义，褒贬取决于语境。"},"examples":[{"en":"In Ukrainian, “chytroi” describes someone who is clever, sometimes a bit sly.","zh":"在乌克兰语里，“chytroi”形容一个人很机灵，但有时也有点狡黠。"},{"en":"He called the fox chytroi, meaning it was cunning and hard to trick.","zh":"他把那只狐狸称为 chytroi，意思是它很狡猾，不容易上当。"}]}],"synonyms":["clever","cunning","sly","crafty"],"phonetic":"/ˈhɪt.rɔɪ/","extraExplanation":["“Chytroi”常见于把西里尔字母词（如乌克兰语/俄语）转写成拉丁字母时的拼法；更规范的转写里，你也可能见到接近的写法（如根据不同体系出现细微差异）。","对应的原词在东欧文化语境里既能夸人“机灵、会动脑子”，也可能暗示“狡猾、爱算计”。具体是褒义还是贬义，通常要看说话人的语气与上下文（例如谈到“狐狸”时多偏向“狡猾”）。"]}
{"word":"chytroi","summary":{"en":"“Chytroi” isn’t standard English; it’s likely a Slavic transliteration meaning “cunning/sly; cleverly tricky.”","zh":"“chytroi” 不是标准英语，可能是斯拉夫语言的转写，意为“狡猾/狡诈；带点耍聪明的机灵”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not a standard English word. It is most likely a transliteration of the Ukrainian/Russian adjective meaning “cunning, sly, clever (in a tricky way).”","zh":"不是标准英语单词。更可能是乌克兰语/俄语形容词的拉丁转写，意思是“狡猾的、狡诈的；（带点耍小聪明的）聪明的”。"},"examples":[{"en":"In some Slavic languages, a word like chytroi describes a person who is clever in a sneaky way.","zh":"在一些斯拉夫语言里，类似 chytroi 的词用来形容一个人“聪明但有点阴”。"},{"en":"He looked friendly, but his plan was chytroi—he wanted to trick them.","zh":"他看起来很友好，但他的计划很 chytroi——他想骗他们。"}]}],"synonyms":["cunning","sly","crafty","sneaky","shrewd"],"phonetic":"/ˈhɪtrɔɪ/","extraExplanation":["在英语环境中你通常不会看到 chytroi。更自然的英语表达取决于语气：\n- 中性偏褒义：clever, smart\n- 偏贬义：cunning, sly, crafty, sneaky\n如果你告诉我它来自哪种语言（例如乌克兰语、俄语）或你看到它的句子，我可以帮你更准确地对应到英文词。"]}

