{"word":"cll","summary":{"en":"CLL most commonly means chronic lymphocytic leukemia (a usually slow-growing blood cancer).","zh":"CLL最常见指慢性淋巴细胞白血病（通常进展较慢的一种血液肿瘤）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(medicine) Chronic lymphocytic leukemia: a slow-growing cancer of the blood and bone marrow that affects a type of white blood cell (lymphocytes).","zh":"（医学）慢性淋巴细胞白血病：一种进展通常较慢的血液与骨髓癌症，影响一种白细胞（淋巴细胞）。"},"examples":[{"en":"My uncle was diagnosed with CLL and now gets regular blood tests.","zh":"我叔叔被诊断为CLL，现在定期做血液检查。"},{"en":"Some people with CLL don’t need treatment right away; doctors may monitor it first.","zh":"有些CLL患者不需要立刻治疗；医生可能会先观察监测。"}]},{"partOfSpeech":"other","definition":{"en":"(general) An abbreviation for different terms depending on the field (for example, in medicine it usually means chronic lymphocytic leukemia).","zh":"（通用）在不同领域可能代表不同词组的缩写（例如在医学中通常指慢性淋巴细胞白血病）。"},"examples":[{"en":"What does CLL stand for in this article?","zh":"在这篇文章里CLL代表什么？"},{"en":"CLL can mean different things, so check the context.","zh":"CLL可能有不同含义，所以要看上下文。"}]}],"synonyms":["chronic lymphocytic leukemia","leukemia (general)"],"phonetic":"/siː ɛl ˈɛl/","extraExplanation":["CLL常写作大写“CLL”，读作三个字母的名称（see-el-el）。医学语境里最常见；如果在计算机、工程或公司内部文件里看到，可能是别的缩写，最好结合上下文或询问作者。"]}
{"word":"CLLI","summary":{"en":"CLLI is a telecom code that identifies a specific network location.","zh":"CLLI 是电信行业用于标识具体网络地点的标准代码。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"CLLI: an acronym for Common Language Location Identifier—a standardized code used in the telecommunications industry to identify a specific network location (such as a central office, switch site, or building).","zh":"CLLI：Common Language Location Identifier（通用语言位置标识符）的缩写——电信行业使用的一种标准代码，用来标识某个具体的网络地点（如电话局端、交换机站点或机房/楼宇）。"},"examples":[{"en":"Please include the CLLI code for the destination central office in the ticket.","zh":"请在工单中填写目的地局端（central office）的 CLLI 代码。"},{"en":"The circuit is down at the CLLI: NYCMNY12.","zh":"该电路在 CLLI：NYCMNY12 处发生中断。"}]}],"synonyms":["Common Language Location Identifier","CLLI code"],"phonetic":"/ˌsiːˌɛlˌɛlˈaɪ/","extraExplanation":["CLLI 常见于北美电信/网络运维场景（如工单、线路开通、故障定位、资源管理）。它通常由一串字母数字组成，用来精确指向某个机房或网络节点。","口语里常直接读字母：C-L-L-I。书面上也常写作 “CLLI code”。"]}
{"word":"Cllr","summary":{"en":"“Cllr” is a title/abbreviation for a local elected councillor, used especially in the UK before a person’s name.","zh":"“Cllr”是“councillor（地方议员/市议员）”的头衔缩写，尤用于英国，常置于姓名前。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Councillor/Councilor,” a person elected to sit on a local government council (especially in the UK and other Commonwealth countries); used as a title before a name","zh":"“councillor（议员/市议员）”的缩写，指当选进入地方政府议会/市政委员会的人（尤见于英国及英联邦国家）；常作头衔放在姓名前"},"examples":[{"en":"Cllr Jane Smith will attend the community meeting tonight.","zh":"市议员简·史密斯今晚将出席社区会议。"},{"en":"Please contact Cllr Ahmed if you have concerns about local road safety.","zh":"如果你对本地道路安全有担忧，请联系市议员艾哈迈德。"},{"en":"The council voted 18–6; Cllr Brown supported the proposal.","zh":"议会以18比6表决通过；布朗议员支持该提案。"}]}],"synonyms":["Councillor","Councilor","local councillor","alderman (older/limited use)"],"phonetic":"/ˈkaʊns(ə)lər/","extraExplanation":["“Cllr”多见于英国地方政治语境（如市政厅公告、新闻、邮件签名），通常写作“Cllr + 姓名”。美式英语更常见拼写为“councilor”，但很少用“Cllr”作头衔。","复数可写作“Cllrs”（如：Cllrs Patel and Wong）。在正式写作中也可能直接写全称“Councillor”。"]}

