{"word":"cly","summary":{"en":"“cly” is a nonstandard shorthand for “clearly” used in casual online writing.","zh":"“cly”通常是“clearly”的非标准简写，用于非正式网络表达。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(informal, nonstandard) A written abbreviation for “clearly,” mostly seen in casual online messages.","zh":"（非正式、非标准）“clearly（显然；清楚地）”的简写，多见于网络聊天或随手打字。"},"examples":[{"en":"Cly, that’s not what I meant.","zh":"很明显，那不是我的意思。"},{"en":"He’s joking, cly.","zh":"他显然是在开玩笑。"}]}],"synonyms":["clearly","obviously","plainly"],"phonetic":"/kli/","extraExplanation":["“cly”不是标准英语词典里常见的词条，更像是个人或小圈子里用的速记写法。在正式写作、邮件、作业中建议写全：clearly / obviously。","如果你看到的是大写“CLY”，也可能是缩写（比如公司名、用户名、股票代码等），具体含义需要上下文才能确定。"]}
{"word":"Clyde","summary":{"en":"Clyde is a name, and it can also refer to the River Clyde in Scotland.","zh":"Clyde 既是人名/姓氏，也可指苏格兰的克莱德河。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (first name); also used as a family name.","zh":"男性名字（名）；也可作姓氏。"},"examples":[{"en":"Clyde is my uncle’s name.","zh":"Clyde 是我叔叔的名字。"},{"en":"We met a designer named Clyde at the conference.","zh":"我们在会议上认识了一位叫 Clyde 的设计师。"}]},{"partOfSpeech":"n.","definition":{"en":"(also “the Clyde”) the River Clyde in Scotland, especially associated with Glasgow.","zh":"（也作 the Clyde）苏格兰的克莱德河，常与格拉斯哥联系在一起。"},"examples":[{"en":"They took a walk along the Clyde in Glasgow.","zh":"他们在格拉斯哥的克莱德河边散步。"},{"en":"Shipbuilding once made the Clyde famous.","zh":"造船业曾让克莱德河闻名。"}]}],"synonyms":["(as a person’s name) no direct synonyms","River Clyde (proper name)"],"phonetic":"/klaɪd/","extraExplanation":["“Clyde”源自苏格兰地名与河名，河名的词源通常认为与古老的不列颠凯尔特语有关，含义常被解释为“清洁/净水”一类的概念。","在美国文化里，Clyde 也常让人联想到“Bonnie and Clyde（邦妮与克莱德）”，指 1930 年代著名的亡命鸳鸯；这个搭配在影视与新闻语境里常被用来比喻“形影不离、一起冒险（有时也带点负面含义）的一对”。"]}
{"word":"clyde","summary":{"en":"Clyde is a proper name: most often a man’s name, sometimes a surname; it can also refer to Scotland’s River Clyde, and culturally to “Bonnie and Clyde.”","zh":"Clyde 是专有名词：最常见是男性名字（也可作姓氏）；也可指苏格兰的克莱德河；在文化语境中还可指“邦妮与克莱德”中的克莱德。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a male given name (first name), also used as a surname.","zh":"男性名字（名），也可作姓氏。"},"examples":[{"en":"My uncle’s name is Clyde.","zh":"我叔叔叫 Clyde。"},{"en":"Clyde Johnson will speak at the meeting today.","zh":"Clyde Johnson 今天会在会上发言。"}]},{"partOfSpeech":"other","definition":{"en":"the River Clyde in Scotland, known for Glasgow and historic shipbuilding.","zh":"（专有名词）苏格兰的克莱德河（River Clyde），与格拉斯哥及历史上的造船业有关。"},"examples":[{"en":"Glasgow sits on the River Clyde.","zh":"格拉斯哥坐落在克莱德河畔。"},{"en":"They took a walk along the Clyde at sunset.","zh":"他们在日落时沿着克莱德河散步。"}]},{"partOfSpeech":"other","definition":{"en":"a reference to Clyde Barrow, from the famous U.S. outlaw pair “Bonnie and Clyde.”","zh":"（文化指涉）指“邦妮与克莱德（Bonnie and Clyde）”中的克莱德·巴罗（Clyde Barrow），美国著名亡命鸳鸯之一。"},"examples":[{"en":"The movie is based on the story of Bonnie and Clyde.","zh":"这部电影改编自“邦妮与克莱德”的故事。"},{"en":"People sometimes say “Bonnie and Clyde” to describe a reckless couple.","zh":"人们有时用“Bonnie and Clyde”形容一对鲁莽、一起闯祸的情侣。"}]}],"synonyms":["(given name)","(the Clyde / River Clyde)","(Bonnie and Clyde)"],"phonetic":"/klaɪd/","extraExplanation":["“Clyde”的发音与英文单词“clied”同音（虽然这个拼写不常见），核心音是 /aɪ/，像“my”的元音。","在英语里，人名与地名通常首字母大写：Clyde；河流全名常写作 the River Clyde 或简称 the Clyde。","文化上，“Bonnie and Clyde”常被用作比喻，但在正式场合要注意它指涉犯罪人物，避免浪漫化或不恰当地使用。"]}
{"word":"Clydebank","summary":{"en":"Clydebank is a town in Scotland on the River Clyde, historically famous for shipbuilding.","zh":"Clydebank 是苏格兰克莱德河畔的一座城镇，历史上以造船业闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A town in West Dunbartonshire, Scotland, on the River Clyde, historically known for shipbuilding and heavy industry.","zh":"英国苏格兰西邓巴顿郡（West Dunbartonshire）的一座城镇，位于克莱德河（River Clyde）畔，历史上以造船业与重工业闻名。"},"examples":[{"en":"My grandfather worked in the shipyards in Clydebank.","zh":"我祖父曾在克莱德班克的造船厂工作。"},{"en":"Clydebank sits on the River Clyde, not far from Glasgow.","zh":"克莱德班克位于克莱德河畔，离格拉斯哥不远。"}]}],"synonyms":["(proper noun)"],"phonetic":"/ˈklaɪdˌbæŋk/","extraExplanation":["“Clydebank”由“Clyde（克莱德河）+ bank（河岸）”构成，字面意思接近“克莱德河岸”。","克莱德班克与英国造船史联系紧密；二战期间这里曾遭到严重空袭，常被称为“Clydebank Blitz（克莱德班克大轰炸）”。了解这一背景能帮助你在历史类文章或纪录片中更好地理解它被提及的原因。"]}
{"word":"Clydes","summary":{"en":"“Clydes” most often means Clydesdale horses (informal), but it can also be the plural of the name “Clyde.”","zh":"“Clydes”最常指克莱兹代尔马（非正式说法），也可以是人名/地名“Clyde”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Short for “Clydesdales,” large draft horses originally bred in Scotland.","zh":"（非正式）“Clydesdales（克莱兹代尔马）”的简称，指一种起源于苏格兰的大型挽马。"},"examples":[{"en":"The farm keeps a pair of Clydes for pulling wagons.","zh":"农场养了一对克莱兹马来拉货车。"},{"en":"At the parade, the Clydes drew a decorated carriage.","zh":"游行时，克莱兹马拉着一辆装饰华丽的马车。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural form of “Clyde” (a person’s name, or referring to more than one place/thing named Clyde).","zh":"“Clyde”的复数形式（可指多人名为Clyde，或多个名为Clyde的地方/事物）。"},"examples":[{"en":"There are two Clydes in our class, so we use last names to avoid confusion.","zh":"我们班有两个叫Clyde的人，所以我们用姓氏来避免混淆。"},{"en":"The map labels several Clydes in different regions.","zh":"地图在不同地区标出了几个名为Clyde的地点。"}]}],"synonyms":["Clydesdales","draft horses","workhorses"],"phonetic":"/klaɪdz/","extraExplanation":["“Clydes”在口语里最常见的用法是指“Clydesdales（克莱兹代尔马）”。这种马以高大、力气大、腿部常有“白色饰毛（feathering）”而有名。","在美国文化中，Budweiser 啤酒广告里常出现的“Budweiser Clydesdales（百威克莱兹代尔马）”让这个词更广为人知。","如果你是在读地名/人名（如 River Clyde 克莱德河，或名叫 Clyde 的人），“Clydes”通常只是复数，语境会帮助你判断。"]}
{"word":"Clydesdale","summary":{"en":"Clydesdale is most commonly a large Scottish draft horse breed; it can also refer to a historic region in Scotland.","zh":"Clydesdale 常指苏格兰出产的一种大型挽马品种；也可指苏格兰的历史地区“克莱兹代尔”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large, strong breed of draft (working) horse, originally from Scotland, often used for pulling heavy loads","zh":"克莱兹代尔马（一种体型高大、力量很强的挽马品种，起源于苏格兰，常用于拉重物）"},"examples":[{"en":"A team of Clydesdales pulled the wagon in the parade.","zh":"一队克莱兹代尔马在游行中拉着马车。"},{"en":"Clydesdales are known for their tall legs and feathered hooves.","zh":"克莱兹代尔马以高腿和蹄部浓密的长毛而闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"a historic area in Scotland (around the River Clyde), associated with where the breed developed","zh":"克莱兹代尔（苏格兰的历史地区，位于克莱德河流域一带，与该马种的起源有关）"},"examples":[{"en":"The Clydesdale breed takes its name from Clydesdale in Scotland.","zh":"克莱兹代尔马的名字来自苏格兰的克莱兹代尔地区。"}]}],"synonyms":["draft horse","heavy horse","workhorse"],"phonetic":"/ˈklaɪdzdɛl/","extraExplanation":["“Clydesdale”来自苏格兰的克莱德河（River Clyde）流域旧称“Clydesdale（克莱兹代尔）”，马种因此得名。","在北美文化中，这种马常与啤酒品牌百威（Budweiser）的广告形象联系在一起：大型马队拉着红色马车，象征力量与传统。","发音提示：重音在第一音节，/ˈklaɪdz-/ 听起来像 “klides-”。"]}
{"word":"clydesdale","summary":{"en":"A Clydesdale is a big, powerful Scottish draft horse.","zh":"Clydesdale 指体型高大、力量强的苏格兰重挽马。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large, strong draft horse breed originally from Scotland, known for pulling heavy loads","zh":"克莱兹代尔马（原产苏格兰的重挽马品种），体型高大强壮，常用于拉重物"},"examples":[{"en":"Clydesdales were used on farms to pull plows and wagons.","zh":"过去克莱兹代尔马常在农场里拉犁和拉货车。"},{"en":"The parade featured a team of Clydesdales pulling a decorated carriage.","zh":"游行中有一队克莱兹代尔马拉着装饰华丽的马车。"}]}],"synonyms":["draft horse","dray horse","cart horse"],"phonetic":"/ˈklaɪd.zdeɪl/","extraExplanation":["“Clydesdale”这个名字来自苏格兰的克莱兹河谷地区（Clydesdale）。这种马以力量和温和的性格出名，腿部常有浓密的长毛（feathering）。","在美国文化里，Clydesdale常因百威（Budweiser）广告中的马车队而广为人知。"]}
{"word":"Clydesdales","summary":{"en":"Clydesdales are large Scottish draft horses (plural of Clydesdale).","zh":"Clydesdales 指源自苏格兰的体型巨大的重挽马（Clydesdale 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a breed of large, strong draft horse, originally from Scotland; “Clydesdales” is the plural form","zh":"克莱兹代尔马（重挽马品种，原产苏格兰）；Clydesdales 为其复数形式"},"examples":[{"en":"Clydesdales are famous for their size and calm temperament.","zh":"克莱兹代尔马以体型巨大、性情温和而闻名。"},{"en":"The farm used two Clydesdales to pull the wagon during the festival.","zh":"农场在节庆活动中用两匹克莱兹代尔马拉车。"},{"en":"You can often recognize Clydesdales by the feathering around their lower legs.","zh":"你常常可以通过它们小腿周围像“羽毛”一样的长毛来辨认克莱兹代尔马。"}]}],"synonyms":["draft horses","workhorses","Clydesdale horses"],"phonetic":"/ˈklaɪdˌsdeɪlz/","extraExplanation":["“Clydesdale”这个名字来自苏格兰的克莱德河谷（Clyde valley）地区，历史上主要用于拉车、耕作等重体力工作。","在美国文化中，Clydesdales 常因百威（Budweiser）啤酒广告中的马队而广为人知，因此在游行、庆典场合也常被用作表演与展示。"]}
{"word":"Clydeside","summary":{"en":"Clydeside is the area along Scotland’s River Clyde, especially around Glasgow.","zh":"Clydeside 指苏格兰克莱德河沿岸地区，尤指格拉斯哥一带。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the area along the River Clyde, especially the industrial and urban parts of Glasgow and nearby towns in Scotland","zh":"克莱德河沿岸地区（尤指苏格兰格拉斯哥及周边城镇的城市与工业地带）"},"examples":[{"en":"My grandparents grew up on Clydeside in Glasgow.","zh":"我祖父母在格拉斯哥的克莱德河沿岸地区长大。"},{"en":"Clydeside was once famous for shipbuilding.","zh":"克莱德河沿岸地区曾因造船业而闻名。"},{"en":"She’s researching housing and health in Clydeside communities.","zh":"她在研究克莱德河沿岸社区的住房与健康问题。"}]}],"synonyms":["the River Clyde area","the Glasgow (Clyde) area"],"phonetic":"/ˈklaɪdˌsaɪd/","extraExplanation":["“Clydeside”在英国语境里常让人联想到19—20世纪的重工业与造船传统；格拉斯哥曾是世界重要造船中心之一。","历史上还有“Red Clydeside（红色克莱德河沿岸）”一说，指一战前后当地活跃的工人运动与左翼政治传统。"]}
{"word":"clydeside","summary":{"en":"Clydeside means the River Clyde area around Glasgow, Scotland, and can also describe things connected to that region.","zh":"Clydeside指苏格兰格拉斯哥附近的克莱德河沿岸地区，也可形容与该地区相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the area along the River Clyde in and around Glasgow, Scotland (often referring to its industry and communities, especially shipbuilding).","zh":"苏格兰格拉斯哥一带克莱德河沿岸地区（常指其工业与社区，尤指造船业）。"},"examples":[{"en":"He grew up on Clydeside and remembers when the shipyards were busy.","zh":"他在克莱德河沿岸地区长大，还记得当年造船厂最繁忙的日子。"},{"en":"Clydeside played a major role in Britain’s industrial history.","zh":"克莱德河沿岸地区在英国工业史上扮演了重要角色。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to this area, especially its accent, politics, or culture (often used before a noun).","zh":"与克莱德河沿岸地区相关的（尤指口音、政治或文化；常作定语）。"},"examples":[{"en":"She speaks with a strong Clydeside accent.","zh":"她带着很浓的克莱德河沿岸口音。"},{"en":"The book explores Clydeside working-class life.","zh":"这本书探讨了克莱德河沿岸工人阶级的生活。"}]}],"synonyms":["the Clyde area","Greater Glasgow (roughly, in context)"],"phonetic":"/ˈklaɪdˌsaɪd/","extraExplanation":["“Clydeside”源自River Clyde（克莱德河）+ side（河岸/一带）。在历史语境中，它常让人联想到19—20世纪格拉斯哥周边的重工业与造船业（如著名的克莱德造船厂），以及与之相关的工人阶级文化与社会运动。","在文学与新闻写作中，“Clydeside”有时不仅指地理位置，也带有一种“地方身份”的意味（比如“Clydeside accent/shipyards/politics”）。"]}
{"word":"Clydesider","summary":{"en":"Clydesider means a person from Clydeside, the River Clyde area around Glasgow, Scotland.","zh":"Clydesider 指来自苏格兰格拉斯哥附近克莱德河沿岸地区（Clydeside）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Clydeside (the area along the River Clyde, especially around Glasgow in Scotland)","zh":"克莱德河沿岸地区（尤其是苏格兰格拉斯哥一带，Clydeside）的人；克莱德河畔居民"},"examples":[{"en":"He’s a proud Clydesider who still speaks with a Glasgow accent.","zh":"他是个自豪的克莱德河畔人，说话仍带着格拉斯哥口音。"},{"en":"Many Clydesiders remember the area’s shipbuilding history.","zh":"许多克莱德河畔人都记得当地的造船业历史。"}]}],"synonyms":["Clydeside resident","local (to Clydeside)","Glaswegian (close, but not identical)"],"phonetic":"/ˈklaɪdˌsaɪdər/","extraExplanation":["“Clydesider”常见于英国英语语境中，指居住在Clydeside（克莱德河沿岸、以格拉斯哥为中心的地区）的人。它更像“地域身份/称呼”，并不是非常高频的日常词。","Clydeside在19—20世纪以重工业和造船业闻名，因此在历史、劳工运动、地方文化的讨论中，你更容易看到“Clydesider”这个说法。"]}
{"word":"clydesider","summary":{"en":"A (rare) word meaning someone from Clydeside (the River Clyde/Glasgow area in Scotland).","zh":"（较少见）指苏格兰克莱德河畔（格拉斯哥一带）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Clydeside, the area around the River Clyde in and near Glasgow, Scotland (not a very common word; sometimes written as “Clydesider”).","zh":"（不太常见）克莱德河畔地区（Clydeside，主要指苏格兰格拉斯哥及克莱德河周边）的人；“Clydesider”有时用作这种地区居民的称呼。"},"examples":[{"en":"He’s a proud Clydesider and can tell you a lot about Glasgow.","zh":"他是个很自豪的“Clydesider”，能跟你讲很多格拉斯哥的事。"},{"en":"Many Clydesiders grew up with the River Clyde as part of daily life.","zh":"很多克莱德河畔的人从小就把克莱德河当作日常生活的一部分。"}]}],"synonyms":["Glaswegian (more common, if you mean Glasgow specifically)","Clydeside resident"],"phonetic":"/ˈklaɪdˌsaɪdər/","extraExplanation":["“Clydeside”指克莱德河（River Clyde）沿岸地区，尤其与格拉斯哥的工业与造船历史有关。","这种“地名 + -sider”的构词在英国很常见，用来指某地居民，例如：Tynesider（泰恩河畔的人，纽卡斯尔一带）、Wearsider（威尔河畔的人，桑德兰一带）。因此“Clydesider”在构词上合理，但在实际英语中不如“Glaswegian（格拉斯哥人）”常用。"]}
{"word":"clyer","summary":{"en":"“Clear” most often means easy to understand or see; it can also mean transparent/without clouds, or to remove/empty something.","zh":"“clear”最常指“清楚的、容易理解的”；也可指“清澈/透明、晴朗”，或作动词表示“清理、清空”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"easy to see, hear, or understand; not confusing","zh":"清楚的；易于看见/听见/理解的；不令人困惑的"},"examples":[{"en":"The instructions are clear and simple.","zh":"说明清楚又简单。"},{"en":"Please speak clearly so everyone can understand.","zh":"请说清楚一点，让大家都能听懂。"}]},{"partOfSpeech":"adj.","definition":{"en":"not blocked; allowing light or vision to pass through","zh":"透明的；清澈的；不被遮挡的"},"examples":[{"en":"The sky is clear today.","zh":"今天天空很晴朗。"},{"en":"We could see clear water near the shore.","zh":"我们在岸边看到了清澈的水。"}]},{"partOfSpeech":"vt.","definition":{"en":"to remove people or things from a place; to empty an area","zh":"清走；清空（某处的人或物）"},"examples":[{"en":"Please clear the table after dinner.","zh":"晚饭后请把桌子收拾干净。"},{"en":"The police cleared the street for the parade.","zh":"警察为游行清空了街道。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become free of clouds, fog, or trouble; to improve","zh":"转晴；（雾等）消散；（问题/麻烦）缓解、好转"},"examples":[{"en":"The weather will clear by afternoon.","zh":"下午天气会转晴。"},{"en":"After we talked, things began to clear up.","zh":"我们谈过之后，事情开始明朗起来。"}]}],"synonyms":["obvious","plain","transparent","unclouded","clean","remove"],"phonetic":"/klɪr/","extraExplanation":["你输入的 “clyer” 不是常见英语单词，最可能是拼写错误，常见想表达的是 “clear”（清楚的/清澈的/清理）。如果你原本想写的是 “claire / clier / crier”等其他词，请告诉我句子，我可以帮你准确判断。"]}
{"word":"clyers","summary":{"en":"“Clyers” is not a standard English word; it’s likely a misspelling (often of “flyers”).","zh":"“clyers”不是标准英语单词，通常是拼写错误（常见为“flyers”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of another word (often “flyers” or “cliers”).","zh":"不是标准英语单词，更可能是其他单词的拼写错误（常见可能是 “flyers” 或 “cliers”）。"},"examples":[{"en":"I couldn’t find “clyers” in a dictionary—did you mean “flyers” (advertising leaflets)?","zh":"我在词典里找不到 “clyers”——你是不是想写 “flyers”（广告传单）？"},{"en":"If you meant “flyers,” you can say: “They handed out flyers outside the station.”","zh":"如果你想写的是 “flyers”，可以说：“他们在车站外发传单。”"}]}],"phonetic":"/ˈklaɪərz/","extraExplanation":["“clyers”本身不常见于英语词典和主流语料库里，因此更像拼写错误。最常见的可能是：\n1) flyers：传单；也可指“飞行者/飞行物”的复数。\n2) crier(s)：叫卖者、报信者（更少见但真实存在）。\n3) buyers：买家（如果键盘误按也可能）。\n如果你把它放进一个句子里（或告诉我你想表达的中文意思），我可以更准确判断你想要的词。"]}
{"word":"clyfaker","summary":{"en":"“clyfaker” is not a standard English word; it’s likely a misspelling or a username. Share the sentence/context and I can help identify the intended word.","zh":"“clyfaker”不是标准英语单词；更可能是拼写错误或用户名。提供句子/上下文我可以帮你推断真正想表达的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it does not appear in common dictionaries. It is most likely a misspelling, a username, or a made-up word.","zh":"不是标准英语单词；常见词典中一般查不到。更可能是拼写错误、用户名或自造词。"},"examples":[{"en":"I couldn’t find “clyfaker” in a dictionary—did you mean “clay faker” or another word?","zh":"我在词典里找不到“clyfaker”——你是不是想写“clay faker”或其他单词？"},{"en":"Sometimes unusual strings like “clyfaker” are usernames rather than vocabulary words.","zh":"像“clyfaker”这种不常见的字串有时是用户名，而不是词汇。"}]}],"phonetic":"/ˈklaɪˌfeɪkər/","extraExplanation":["如果你告诉我它出现的句子/上下文（例如一整句英文、游戏ID、社交媒体昵称、文章截图），我可以更准确判断它可能想表达什么。","可能的方向：\n1）拼写误差：比如把常见词打错了（可提供原句我来推测）。\n2）拆分成两部分：cly + faker（faker=“冒充者/造假者”），但“cly”本身不是常用英语词根。\n3）专有名词：人名/品牌/网名通常不遵循词典拼写规律。"]}
{"word":"clyfaking","summary":{"en":"Not a standard word; likely a misspelling of “clayfaking” = pretending to work/looking busy while doing little.","zh":"不是标准词；很可能是 “clayfaking” 的误拼：装忙、假装干活但实际偷懒。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“clyfaking” is not a standard English word. It is most likely a misspelling of “clayfaking,” meaning pretending to work or doing as little work as possible while looking busy.","zh":"“clyfaking” 不是标准英语单词。它很可能是 “clayfaking” 的拼写错误，意思是装忙、假装在工作，实际上尽量少干活。"},"examples":[{"en":"Stop clayfaking and help us clean up.","zh":"别装忙了，过来帮我们收拾。"},{"en":"The boss caught him clayfaking near the toolshed.","zh":"老板在工具棚附近发现他在装忙摸鱼。"}]}],"synonyms":["slacking","skiving","goldbricking","shirking"],"phonetic":"/ˈkleɪˌfeɪkɪŋ/","extraExplanation":["“clayfaking” 多见于较口语/俚语语境，尤其在澳大利亚英语和部分工人阶层口语中更常见。大意接近 “skiving off / slacking off / goldbricking（摸鱼、偷懒、假装忙）”。","如果你是在某个具体帖子、歌词或聊天里看到 “clyfaking”，也可能是个人造词或打字错误。你可以把原句发来，我可以帮你判断最可能的意思。"]}
{"word":"Clyman","summary":{"en":"Clyman is usually a proper noun: a surname, and also the name of a small village in Wisconsin, USA.","zh":"Clyman 通常是专有名词：既可作姓氏，也可指美国威斯康星州的一个小村庄名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname)","zh":"（常见于英语国家的）姓氏"},"examples":[{"en":"My history teacher’s last name is Clyman.","zh":"我历史老师的姓是 Clyman。"},{"en":"The article was written by Sarah Clyman.","zh":"这篇文章是 Sarah Clyman 写的。"}]},{"partOfSpeech":"other","definition":{"en":"a place name, especially the village of Clyman in Wisconsin, USA","zh":"地名：尤指美国威斯康星州的 Clyman 村"},"examples":[{"en":"They drove through Clyman on the way to Madison.","zh":"他们去麦迪逊的路上开车经过了 Clyman。"},{"en":"Clyman is a small community in Dodge County.","zh":"Clyman 是道奇县的一个小社区。"}]}],"synonyms":["(surname)","(place name)"],"phonetic":"/ˈklaɪmən/","extraExplanation":["“Clyman”多作为专有名词使用（人名或地名），一般不当作普通词汇。","历史上有名的同姓人物包括 James Clyman（19世纪美国前沿地区的探险者/“mountain man”）。在历史类文章里看到 Clyman，常常指具体人物而不是一个“单词意思”。"]}
{"word":"Clymene","summary":{"en":"Clymene is a name from Greek mythology (with different traditions about who she is) and is also a rare female given name in English.","zh":"Clymene（克吕墨涅）是希腊神话中的人物名（不同传统有不同身份与家族关系），也可作为英语中较少见的女性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, a Titan or Oceanid/nymph named Clymene; in different sources she is the wife of Iapetus and the mother of Prometheus, Epimetheus, Menoetius, and Atlas, or she is an Oceanid linked with the sun god Helios as the mother of Phaethon.","zh":"（希腊神话）克吕墨涅：在不同文献中，她或被写作伊阿珀托斯（Iapetus）的妻子、普罗米修斯等人的母亲；或被写作与太阳神赫利俄斯（Helios）相关、法厄同（Phaethon）的母亲。"},"examples":[{"en":"In some myths, Clymene is listed as the mother of Prometheus.","zh":"在一些神话版本中，克吕墨涅被列为普罗米修斯的母亲。"},{"en":"The story of Phaethon is sometimes connected to Clymene as his mother.","zh":"法厄同的故事有时会把克吕墨涅写作他的母亲。"}]},{"partOfSpeech":"n.","definition":{"en":"A female given name used in English, borrowed from Greek mythology (rare).","zh":"（人名）克吕墨涅：源自希腊神话、在英语中较少见的女性名字。"},"examples":[{"en":"Her parents chose Clymene because they liked mythological names.","zh":"她的父母取名克吕墨涅，因为他们喜欢神话人物名字。"}]}],"synonyms":["mythological name","Greek myth figure","Oceanid","Titaness"],"phonetic":"/ˈklaɪ.miːn/","extraExplanation":["“Clymene”在神话里会“身份不固定”，因为古希腊诗人和后来的整理者常把不同谱系（家族关系）版本并存记录：同名人物可能被当作不同神祇/宁芙，或在不同传统中承担不同亲属关系。阅读时可留意作者/作品（如赫西俄德等）采用的是哪一支系谱。","英文文本里常见拼写为 Clymene，重音通常在第二音节；也可见于文学改写或诗歌中，用来营造古典、神话气氛。"]}
{"word":"Clymenia","summary":{"en":"Clymenia is a name from Greek mythology, most often referring to an Oceanid associated in some sources with Iapetus and the mother of Prometheus and Atlas.","zh":"Clymenia 是希腊神话中的名字，最常指一位海洋女神；在部分文献中她与伊阿珀托斯相关，并被说成是普罗米修斯、阿特拉斯等人的母亲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) A female figure whose name refers to more than one character; most commonly an Oceanid (a sea nymph) sometimes described as the wife of the Titan Iapetus and the mother of major Titans such as Atlas, Prometheus, and Epimetheus (in some sources she is called Asia instead).","zh":"（希腊神话）“克吕墨涅亚/克吕墨涅”这一名字可指不止一位女性人物；最常见的说法是她是一位海洋女神（Oceanid），有时被描写为泰坦伊阿珀托斯（Iapetus）的妻子，并被说成是阿特拉斯、普罗米修斯、厄庇墨透斯等泰坦的母亲（有的文献中她也被称为“阿西亚 Asia”）。"},"examples":[{"en":"In one version of the myth, Clymenia is the mother of Prometheus.","zh":"在某一版本的神话里，克吕墨涅亚是普罗米修斯的母亲。"},{"en":"Different ancient sources disagree about whether Clymenia or Asia is Iapetus’s wife.","zh":"不同的古代文献对伊阿珀托斯的妻子是克吕墨涅亚还是阿西亚说法不一。"}]}],"synonyms":["Clymene","Asia (in some sources)"],"phonetic":"/klaɪˈmiːniə/","extraExplanation":["“Clymenia”来自希腊语名字 Κλυμένη（常译作 Clymene/Clymeneia），含义常被解释为与“名声、闻名”有关，因此在英语里多作为神话人物的专名出现。","古典神话人物常有“同名不同人”的情况：除了作为 Oceanid 的克吕墨涅亚外，个别文献也用该名指代其他女性（例如与赫利俄斯相关人物的不同变体）。阅读时建议结合作者与谱系（家族关系）来辨认。"]}
{"word":"clymenia","summary":{"en":"Clymenia is a rare proper noun used as a variant mythological name (related to Clymene) and also as a scientific genus name in some contexts.","zh":"Clymenia 是较少见的专有名词：可作为神话中与 Clymene 相关的变体名字，也可在一些语境中作为科学属名使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) A rare/variant name sometimes used for Clymene, an Oceanid (a sea nymph) in ancient Greek stories.","zh":"（希腊神话）一个较少见的变体名字，有时用来指克吕墨涅（Clymene），即古希腊故事中的一位海洋女神/海中仙女（Oceanid）。"},"examples":[{"en":"In some retellings, Clymenia appears as a sea nymph connected with the gods of the ocean.","zh":"在一些改写版本中，Clymenia 被写作与海洋诸神相关的海中仙女。"},{"en":"The name Clymenia is uncommon, so many readers will recognize Clymene more easily.","zh":"Clymenia 这个名字不常见，所以很多读者会更容易认出 Clymene。"}]},{"partOfSpeech":"n.","definition":{"en":"(Science, proper name) A genus name used in biological classification, especially for certain fossil cephalopods in older scientific writing.","zh":"（科学专有名词）生物分类中的属名，尤其在一些较旧的科学文献中用于指某些化石头足类动物。"},"examples":[{"en":"The paper mentions Clymenia as a fossil genus found in Devonian strata.","zh":"这篇论文提到 Clymenia 是在泥盆纪地层中发现的一种化石属。"},{"en":"Because it is a scientific name, Clymenia is usually written with a capital letter and in italics in textbooks.","zh":"因为是学名，Clymenia 在教材中通常首字母大写并用斜体书写。"}]}],"synonyms":["Clymene (mythological spelling/variant)"],"phonetic":"/klaɪˈmiːniə/","extraExplanation":["“Clymenia”不是常见的英语词汇，更多出现在神话人物的变体拼写或科学拉丁学名中。日常英语里更常见的是“Clymene”。","如果你是在特定文章/课本里看到这个词，发我上下文（句子或截图），我可以帮你判断它到底指神话人物还是某个生物属名。"]}
{"word":"Clymenus","summary":{"en":"Clymenus is a Greek-mythology proper name used for several different male figures; exact identity depends on the source.","zh":"Clymenus 是希腊神话中的专有人名，指多个不同的男性人物；具体是谁取决于文献来源。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) A male name; Clymenus is the name of several figures in Greek myths, often listed as a king or a son/descendant of a god or hero (details vary by source).","zh":"（希腊神话）男性人名；Clymenus（克吕墨诺斯）在希腊神话中指多个不同人物，常被写作国王或某位神祇/英雄的儿子或后裔（不同文献版本细节不一）。"},"examples":[{"en":"In one version of Greek myth, Clymenus is mentioned in a genealogy of kings.","zh":"在某些希腊神话版本中，Clymenus 出现在国王的族谱里。"},{"en":"The name Clymenus can refer to different characters, so the context matters.","zh":"Clymenus 这个名字可能指不同角色，因此要看上下文。"}]}],"synonyms":["Klymenos"],"phonetic":"ˈklaɪmənəs","extraExplanation":["这是一个专有名词（人名），在阅读神话、古典文学或人物谱系时常见；同名人物较多，常见于不同城邦或家族的传说系统里。","拼写有时会见到希腊化转写 Klymenos（更贴近希腊语字母 κλυμένος 的转写习惯），英译里更常用 Clymenus。"]}
{"word":"Clymer","summary":{"en":"Clymer is most commonly a surname, and it is also used as a place name in parts of the United States.","zh":"Clymer 最常见是姓氏，也可作美国部分地区的地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"姓氏（人名的姓）。"},"examples":[{"en":"Her last name is Clymer.","zh":"她的姓是 Clymer。"},{"en":"I met Mr. Clymer at the conference.","zh":"我在会议上见到了 Clymer 先生。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name in the United States (used for some towns/areas, e.g., in Pennsylvania and New York).","zh":"美国的地名（用于一些城镇/地区，如宾夕法尼亚州、纽约州等地）。"},"examples":[{"en":"They drove through Clymer, New York on their way west.","zh":"他们西行途中开车经过纽约州的 Clymer。"},{"en":"Clymer is a small community with a quiet, local feel.","zh":"Clymer 是个小社区，氛围安静、很有地方特色。"}]}],"phonetic":"/ˈklaɪmər/","extraExplanation":["Clymer 常见作英语姓氏，发音接近 “KLY-mer”。在英语文化中，姓氏常来自祖先的职业、居住地或家族来源；Clymer 也可能与早期移民家族有关，因此在美国一些地名中也能看到它。","如果你指的是具体人物（例如历史人物、作者、艺术家等）或某个具体地点（哪个州/城市），告诉我更多上下文，我可以给出更精确的说明与用法。"]}
{"word":"Clyne","summary":{"en":"Clyne is most often used as a surname, and it can also be a place name (notably in Swansea, Wales).","zh":"Clyne 最常见作姓氏，也可作地名（尤其指英国威尔士斯旺西的一片地区）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname).","zh":"（人名）姓氏。"},"examples":[{"en":"Robert Clyne is my history teacher.","zh":"罗伯特·克莱恩是我的历史老师。"},{"en":"Ms. Clyne will email the class schedule tomorrow.","zh":"克莱恩女士明天会把课程表发邮件给大家。"}]},{"partOfSpeech":"other","definition":{"en":"a place name, especially Clyne, an area in Swansea, Wales (UK).","zh":"（地名）克莱恩，尤其指英国威尔士斯旺西的一片地区。"},"examples":[{"en":"They moved to Clyne near Swansea for work.","zh":"他们为了工作搬到了斯旺西附近的克莱恩。"},{"en":"We walked through Clyne and visited the nearby park.","zh":"我们穿过克莱恩，还去了附近的公园。"}]}],"phonetic":"/klaɪn/","extraExplanation":["“Clyne”在英语里通常是专有名词（人名/地名），不作普通词汇使用。读音常与“Klein”相近，但拼写与来源不一定相同。写作时首字母要大写。"]}
{"word":"Clynes","summary":{"en":"“Clynes” is mainly used as a surname (family name).","zh":"“Clynes”主要用作英文姓氏（家族姓）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname); a less common spelling of “Clyne,” used to refer to a person or a family called Clynes","zh":"姓氏；较少见的姓氏拼写（与 Clyne 相关），用来指姓 Clynes 的个人或家族"},"examples":[{"en":"Dr. Clynes will give a talk at the university tonight.","zh":"Clynes 博士今晚将在大学做报告。"},{"en":"The Clynes family moved to California in the 1990s.","zh":"Clynes 家族在 1990 年代搬到了加利福尼亚州。"}]}],"synonyms":["Clyne","Cline"],"phonetic":"/klaɪnz/","extraExplanation":["“Clynes”通常作为英文姓氏使用，而不是常见词汇；写作时一般首字母大写：Clynes。","发音上常读作 /klaɪnz/，和“lines”押韵。","如你是在阅读中遇到它：它很可能指某位具体人物（例如学术文章、新闻、作者署名等），需要结合上下文判断是谁。"]}
{"word":"Clyo","summary":{"en":"Clyo is usually a variant spelling of Clio, the Greek Muse of history, and it can also be used as a personal name.","zh":"Clyo 通常是 Clio（希腊神话中的历史女神）的变体拼写，也可用作人名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A variant spelling of “Clio,” a name from Greek mythology (the Muse of history and heroic poetry).","zh":"“Clio（克利俄）”的另一种拼写；源自希腊神话中掌管历史与英雄史诗的缪斯女神之名。"},"examples":[{"en":"In the museum program, the guide mentioned Clyo (Clio), the Muse of history.","zh":"在博物馆的活动里，讲解员提到了Clyo（Clio），也就是历史女神。"},{"en":"The novel’s narrator calls herself Clyo to suggest a connection to remembering the past.","zh":"小说的叙述者自称Clyo，以暗示她与追忆过去有关。"}]},{"partOfSpeech":"n.","definition":{"en":"A personal name (given name or nickname), sometimes used as a modern or stylized spelling.","zh":"人名（名字或昵称）；有时作为较现代或艺术化的拼写方式使用。"},"examples":[{"en":"Clyo is the name on her ID badge.","zh":"她的工牌上写着Clyo。"},{"en":"He chose “Clyo” as his stage name.","zh":"他选择“Clyo”作为艺名。"}]}],"synonyms":["Clio"],"phonetic":"/ˈklaɪoʊ/","extraExplanation":["“Clio/克利俄”在英语文化中常被用来象征“历史、记忆、记录”。如果你看到 Clyo，多半是对 Clio 的改写或拼写变体。","在真实语境里，Clyo 也可能是品牌名、用户名或作品中的角色名；具体含义通常要看上下文。"]}
{"word":"clype","summary":{"en":"Clype is a rare word meaning “shield,” and it may also appear in biology as a shortened/older form related to insect clypeus.","zh":"clype 是个罕见词，主要表示“盾牌”；在生物学中也可能作为与昆虫“唇基（clypeus）”相关的旧称/简写出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, archaic) a shield; something used for protection.","zh":"（罕见/古语）盾牌；用于防护的东西。"},"examples":[{"en":"In old poetry, a hero may lift his clype before charging into battle.","zh":"在古诗歌里，英雄可能在冲锋前举起他的盾牌（clype）。"},{"en":"The small clype protected his chest from flying stones.","zh":"那面小盾牌（clype）保护他的胸口不被飞石击中。"}]},{"partOfSpeech":"n.","definition":{"en":"(biology, rare) an older/short form related to clypeus: the plate-like area on the front of an insect’s head, above the upper lip.","zh":"（生物学/罕见）与 clypeus 相关的旧称/简写：昆虫头部前方、上唇（labrum）上方的板状区域（唇基）。"},"examples":[{"en":"Some field guides describe the clype (clypeus) to help identify beetle species.","zh":"一些野外图鉴会描述唇基（clype / clypeus）来帮助辨认甲虫种类。"},{"en":"The clype is often a useful feature in insect identification.","zh":"唇基常是昆虫鉴定中很有用的特征。"}]}],"synonyms":["shield","buckler","protector"],"phonetic":"/klaɪp/","extraExplanation":["“clype”多见于较旧的英语或文学化语境，更常见的词是“shield”。","词源与拉丁语“clipeus / clypeus”（盾）有关；在现代科学英语里，“clypeus”更常用来指昆虫的“唇基”。"]}
{"word":"clypeal","summary":{"en":"Clypeal means “related to an insect’s clypeus,” a shield-like plate on the front of the head.","zh":"clypeal 指“与昆虫唇基有关的”，即昆虫头部前方类似盾牌的硬板结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the clypeus (a shield-like plate on the front of an insect’s head, above the upper lip).","zh":"（昆虫学）与唇基有关的；指昆虫头部前方、上唇上方的“盾状硬板”（唇基）。"},"examples":[{"en":"The wasp has a bright yellow clypeal mark on its face.","zh":"这只黄蜂脸部有一块亮黄色的唇基斑纹。"},{"en":"In many bees, the clypeal area is used to identify the species.","zh":"在许多蜜蜂中，唇基区域常用于鉴别物种。"}]}],"synonyms":["of the clypeus","clypeus-related"],"phonetic":"/ˈklaɪpiəl/","extraExplanation":["“clypeal”来自拉丁语 clypeus，意为“盾”。在昆虫形态学中，clypeus（唇基）因形状像盾牌而得名。这个词多见于学术描述（如分类、解剖特征记录），日常英语中很少使用。"]}
{"word":"Clypeaster","summary":{"en":"Clypeaster is the scientific genus name for certain flat sea urchins related to sand dollars.","zh":"Clypeaster 是某些扁平海胆（与沙钱近缘）的属名（科学分类名称）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flat, disk-shaped sea urchins (related to sand dollars) that live on sandy seabeds.","zh":"一种扁平圆盘状的海胆属（与“沙钱/海钱”近缘），生活在沙质海底。"},"examples":[{"en":"Scientists identified the fossil as a Clypeaster, a kind of sand-dollar relative.","zh":"科学家将该化石鉴定为 Clypeaster（一种与沙钱近缘的海胆）。"},{"en":"In shallow tropical waters, Clypeaster species often burrow slightly under the sand.","zh":"在浅海热带水域，Clypeaster 的一些物种常会略微钻入沙中。"}]}],"synonyms":["sand dollar (general/common name)","echinoid (broader scientific term)"],"phonetic":"/ˌklaɪpiˈæstər/","extraExplanation":["词源：Clypeaster 来自拉丁语 clypeus（“圆盾”）+ 希腊语 aster（“星”），指其外形像盾牌，表面花纹常呈星形/花瓣状。","语境提示：它是生物分类学名称（属名），在科普、海洋生物、古生物（化石）文章中较常见；日常英语里更常用 sand dollar（沙钱/海钱）来泛指类似的扁平海胆。"]}
{"word":"clypeaster","summary":{"en":"Clypeaster is a scientific genus name for certain sand-dollar-like sea urchins.","zh":"Clypeaster 是某些“沙钱/海饼”类海胆的科学属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of sea urchins (sand dollars/sea biscuits) that live on sandy sea floors; the name is also used to refer to animals in this group.","zh":"盾海胆属：一种生活在海底沙质环境中的海胆类（常见为沙钱/海饼一类）的属名；也可泛指该属中的动物。"},"examples":[{"en":"Scientists studied Clypeaster species to understand how sand dollars burrow in shallow water.","zh":"科学家研究盾海胆属的物种，以了解沙钱类如何在浅海的沙中钻行。"},{"en":"A fossil of Clypeaster was found in ancient marine sediments.","zh":"人们在古老的海相沉积物中发现了盾海胆属的化石。"}]}],"synonyms":["sand dollar (common name)","sea biscuit (common name)"],"phonetic":"/klaɪˈpiːæstər/","extraExplanation":["“Clypeaster”来自拉丁语词根 clypeus（意为“盾牌”），指它们扁平、略呈盾形的外壳（骨骼）。","它是生物分类学中的“属”（genus）名称，写作时首字母通常大写并用斜体（如 *Clypeaster*）。","日常英语里更常用的通俗说法是 sand dollar（沙钱）或 sea biscuit（海饼）；但这些通俗名称不一定只指盾海胆属。"]}
{"word":"Clypeasterina","summary":{"en":"Clypeasterina is a scientific genus name for a kind of sea urchin related to sand dollars.","zh":"Clypeasterina 是一种与沙钱（sand dollar）近缘的海胆类生物的属名（拉丁学名）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a scientific (Latin) genus name for a type of sea urchin related to sand dollars and sea biscuits (an echinoid).","zh":"一个海胆类（棘皮动物）生物的拉丁学名属名，和“沙钱/海月”（sand dollar）与“海饼”（sea biscuit）等扁平或饼状海胆近缘。"},"examples":[{"en":"In this paper, the fossils were identified as belonging to the genus Clypeasterina.","zh":"在这篇论文中，这些化石被鉴定为属于 Clypeasterina 属。"},{"en":"Clypeasterina is discussed alongside other clypeasteroid sea urchins.","zh":"Clypeasterina 常与其他楯形目（clypeasteroid）海胆一起被讨论。"}]}],"synonyms":["Clypeasteroid sea urchin (broader group)","sand dollar (related, not the same)"],"phonetic":"ˌklaɪpiəˈstɛrɪnə","extraExplanation":["这是一个“学名/拉丁名”（scientific name），通常用于动物分类、古生物学或博物馆标本标签中；在日常英语里很少直接使用。","英文里提到此类属名时，常用斜体书写（*Clypeasterina*），首字母大写；若写到具体物种，会用“属名+种加词”（例如 *Clypeasterina* + species epithet）。","如果你是在论文或标本记录中看到它，周围常出现的相关词包括：clypeasteroid（楯形目海胆）、echinoid（海胆类）、sand dollar（沙钱/海月）、sea biscuit（海饼）。"]}
{"word":"clypeasteroid","summary":{"en":"Clypeasteroid means “sand-dollar type”: a flattened sea urchin (or relating to that group).","zh":"clypeasteroid 指“砂钱/海饼类的扁平海胆（或与之相关的）”，多用于生物分类与学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or belonging to the group of flattened sea urchins that includes sand dollars and sea biscuits (order Clypeasteroida).","zh":"与扁平海胆类群有关的；属于砂钱（沙钱）与海饼等扁平海胆所在类群（盾海胆目 Clypeasteroida）的。"},"examples":[{"en":"Clypeasteroid echinoids often live on sandy bottoms and burrow just under the surface.","zh":"盾海胆目的海胆常生活在沙质海底，并在表层下方掘穴。"},{"en":"The museum label described the fossil as a clypeasteroid from a shallow marine environment.","zh":"博物馆标签将这块化石描述为来自浅海环境的盾海胆目个体。"}]},{"partOfSpeech":"n.","definition":{"en":"A sea urchin of the sand-dollar/sea-biscuit type (a member of Clypeasteroida).","zh":"盾海胆目的一种海胆；泛指砂钱/海饼类扁平海胆。"},"examples":[{"en":"The tidepool guide lists several clypeasteroids found along the coast.","zh":"潮池指南列出了海岸线可见的几种盾海胆目海胆。"},{"en":"This clypeasteroid has a round, coin-like body and short spines.","zh":"这只盾海胆目海胆身体圆扁像硬币，棘较短。"}]}],"synonyms":["sand-dollar (type)","sea-biscuit (type)","clypeasteroid echinoid"],"phonetic":"/ˌklaɪpiˈstæɹɔɪd/","extraExplanation":["这是一个偏“学术/分类学”用词，常见于海洋生物学、古生物学与博物馆说明文字中。日常英语里更常说 sand dollar（砂钱/沙元海胆）或 sea biscuit（海饼）。","词形来源：clype- 来自拉丁语 clypeus（盾牌），-aster 表“星/形似”，-oid 表“像……的”，合起来强调这类海胆外形常呈扁平、盾状（或硬币状）的特征。"]}
{"word":"Clypeasteroida","summary":{"en":"Clypeasteroida is the scientific name for the order of sea urchins that includes sand dollars and sea biscuits.","zh":"Clypeasteroida 是“盾海胆目”的科学名称，包含沙钱与海饼等类群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a taxonomic order of echinoderms (irregular sea urchins) that includes sand dollars and sea biscuits, usually living on or in sandy seabeds.","zh":"（生物分类）海胆纲中的一个“目”，包括沙钱（sand dollars）和海饼（sea biscuits）等不规则海胆，通常生活在沙质海底表面或浅埋于沙中。"},"examples":[{"en":"Sand dollars belong to the order Clypeasteroida.","zh":"沙钱属于 Clypeasteroida（盾海胆目）。"},{"en":"Researchers surveyed Clypeasteroida on shallow sandy flats after the storm.","zh":"研究人员在风暴后调查了浅海沙滩上的 Clypeasteroida（盾海胆目）个体。"}]}],"synonyms":["sand dollar group","sea biscuit group"],"phonetic":"/ˌklaɪpiːəˈstɪrɔɪdə/","extraExplanation":["这是一个拉丁化的科学名称（通常在学术写作中首字母大写、斜体书写：*Clypeasteroida*），日常英语里更常直接说 sand dollars（沙钱）或 sea biscuits（海饼）。","词源上可拆成 *clypeus*（拉丁语“盾牌”）+ *aster*（“星”）+ -oid（“……形状的”）+ -a（复数/类群结尾），与它们扁平、圆盘状的外形有关。","发音在不同学者间可能略有差异；在口头交流中，只要重音和主要音节清楚，一般都能被生物/海洋学领域的人理解。"]}
{"word":"Clypeasteroidea","summary":{"en":"Clypeasteroidea is the scientific name for the sand dollar and sea biscuit group of sea urchins.","zh":"Clypeasteroidea 是沙钱和海饼等一类海胆的科学名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific taxonomic group (superorder) of sea urchins that includes sand dollars and sea biscuits; these animals have flattened or rounded bodies adapted for life on sandy seafloors","zh":"一种海胆的科学分类群（总目/超目），包括沙钱（sand dollars）和海饼（sea biscuits）；这类动物身体扁平或圆厚，适应在沙质海底生活"},"examples":[{"en":"Clypeasteroidea includes many species commonly called sand dollars.","zh":"Clypeasteroidea 包含许多通常被称为“沙钱”的物种。"},{"en":"In marine biology class, we learned that Clypeasteroidea are echinoids adapted to burrowing in sand.","zh":"在海洋生物课上，我们学到 Clypeasteroidea 属于海胆类，适合在沙中掘埋生活。"}]}],"synonyms":["sand dollar group","sea biscuit group"],"phonetic":"/ˌklaɪpiːˌæstɚˈɔɪdiə/","extraExplanation":["这是一个拉丁化的科学名称，常见于生物分类与学术写作，而不是日常英语。读到它时，可以把它理解为“沙钱/海饼这一大类海胆”。","词源上常被解释为来自拉丁语 clypeus（盾牌）+ 希腊/拉丁词根 aster（星），暗示其外形特征（扁平、带放射状花纹）。","在分类学上它通常被当作“总目/超目（superorder）”使用；不同教材或数据库在层级与分组上可能略有差异，但核心指向基本一致。"]}
{"word":"clypeasteroids","summary":{"en":"Clypeasteroids are sand-dollar-type sea urchins (order Clypeasteroida).","zh":"clypeasteroids 指“盾形海胆目”的海胆类动物，包含沙钱等扁平海胆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Sea urchins in the order Clypeasteroida, including sand dollars and sea biscuits (flat, disk-shaped echinoderms that often live in sandy seabeds).","zh":"盾形海胆目（Clypeasteroida）的海胆类动物，包括沙钱（sand dollars）和海饼（sea biscuits）；常呈扁平圆盘状，常生活在沙质海底。"},"examples":[{"en":"Clypeasteroids such as sand dollars are often found buried just under the surface of the sand.","zh":"像沙钱这样的盾形海胆目动物，常常埋在沙子表层下面。"},{"en":"The biologist compared clypeasteroids and regular sea urchins to show how body shape changes with habitat.","zh":"生物学家比较了盾形海胆目动物和普通海胆，说明体形如何随栖息地而变化。"}]}],"synonyms":["sand dollars","sea biscuits","clypeasteroids (order Clypeasteroida)"],"phonetic":"/ˌklaɪpiˈæstərɔɪdz/","extraExplanation":["这是一个生物分类学术语：单数是 clypeasteroid（一个个体），复数是 clypeasteroids（多个个体）。日常英语里更常用 sand dollars（沙钱）或 sea biscuits（海饼）来指其中的常见成员。","词源上，Clypeasteroida 来自拉丁语/希腊语词根：clypeus 表“盾”、aster 表“星”（常见于 echinoderm 学名中），合起来与其“盾形/扁圆”的外形有关。"]}
{"word":"Clypeastridea","summary":{"en":"Clypeastridea is a scientific taxonomic name for the group of echinoids that includes sand dollars and sea biscuits.","zh":"Clypeastridea 是一个科学分类名称，指包含沙钱与海饼等的海胆类群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a taxonomic group of sea urchins that includes sand dollars and sea biscuits (flat, disk-shaped echinoderms that live on or in sandy seabeds).","zh":"一种海胆类（棘皮动物）的分类群，包含沙钱（sand dollars）与海饼（sea biscuits）等，通常体形扁平、圆盘状，生活在沙质海底表层或浅埋沙中。"},"examples":[{"en":"Many sand dollars belong to Clypeastridea.","zh":"许多沙钱属于 Clypeastridea。"},{"en":"Clypeastridea species are often adapted for burrowing in sand.","zh":"Clypeastridea 的物种常常适应在沙中掘埋生活。"}]}],"synonyms":["Clypeasteroida","sand dollars (informal group name)","sea biscuits (informal group name)"],"phonetic":"/ˌklaɪpiˈæstrɪdiə/","extraExplanation":["“Clypeastridea”在不同资料中可能是拼写或分类阶元用法的变体；更常见的对应名称是“Clypeasteroida”（一个海胆的“目”，包含沙钱与海饼）。如果你是在论文、化石名录或海洋生物数据库里看到该词，建议同时检索相近拼写（如 Clypeasteroida / Clypeastrida）以确认作者采用的分类体系。","词源上与拉丁语有关：clypeus 意为“盾牌”，呼应这类动物扁平、像盾牌/硬币的外形。"]}
{"word":"clypeastridea","summary":{"en":"Clypeastridea is a scientific taxonomic name for a group of sea urchins that includes sand dollars and sea biscuits.","zh":"Clypeastridea 是一个海胆类的科学分类名称，包含沙钱与海饼等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(zoology, taxonomy) A scientific group of sea urchins that includes sand dollars and sea biscuits; used as a taxonomic name in some classifications.","zh":"（动物学·分类学）一类海胆的科学分类群，包含沙钱（sand dollars）与海饼（sea biscuits）；在某些分类体系中用作分类名称。"},"examples":[{"en":"Sand dollars are often placed within the group Clypeastridea in some older classifications.","zh":"在一些较旧的分类体系中，沙钱常被归入 Clypeastridea 这一类群。"},{"en":"Researchers compare the body shape of Clypeastridea with other echinoids to study evolution.","zh":"研究人员会把 Clypeastridea 的体形与其他海胆类比较，以研究演化。"}]}],"synonyms":["Clypeasteroida","Clypeasteroidea"],"phonetic":"/ˌklaɪpiːəˈstɪridiə/","extraExplanation":["这个词属于生物分类学术语，不是日常英语词汇，通常出现在论文、物种名录或博物馆说明中。","你输入的拼写“clypeastridea”在资料中有时会被视为与更常见的分类名 **Clypeasteroida**（或更高阶的 **Clypeasteroidea**）相关/混用；不同作者、年代与分类体系可能采用不同的后缀与等级。阅读文献时可以对照上下文（是否在讲 sand dollar、sea biscuit 等）来确认指代。"]}
{"word":"Clypeastrina","summary":{"en":"Clypeastrina is a scientific name for a group of echinoids such as sand dollars and sea biscuits.","zh":"Clypeastrina 是一个科学分类名称，指代包括沙钱与海饼等在内的一类海胆近缘类群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific taxon name used in zoology for a group of echinoids (sea urchin relatives), especially sand dollars and sea biscuits.","zh":"（动物学）一个分类学名称，用于指代一类海胆纲的棘皮动物，常见成员包括沙钱（sand dollars）与海饼（sea biscuits）等。"},"examples":[{"en":"In some marine-biology texts, sand dollars are discussed within Clypeastrina.","zh":"在一些海洋生物学教材中，沙钱常被放在 Clypeastrina 这一类群中讨论。"},{"en":"Researchers compared several Clypeastrina species to study how their flat bodies help them live in sand.","zh":"研究人员比较了多种 Clypeastrina 类群的物种，以研究它们扁平的身体如何帮助其在沙中生活。"}]}],"synonyms":["sand-dollar group","Clypeaster (related genus)"],"phonetic":"ˌklaɪpiːəˈstriːnə","extraExplanation":["这是一个较少见的学术用词，通常只出现在分类学、古生物学或海洋生物学语境中；在不同文献体系里，它的“级别”（如亚目、类群等）可能略有差异，但总体都与沙钱、海饼等“不规则海胆”近缘类群相关。","词源上常被认为与拉丁语有关：clypeus（盾）指其“盾形/扁平”的外形特征；在阅读论文或物种名录时，注意它多作为分类单元标题出现，而不是日常英语词汇。"]}
{"word":"clypeastrina","summary":{"en":"A rare zoological taxonomic term for a group of echinoids, often linked to sand dollars; frequently a variant of “Clypeasterina.”","zh":"一个少见的动物学分类名，指与沙钱类相关的一支海胆类群；常被视为“Clypeasterina”的异拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a taxonomic name used in zoology for a group of echinoids (sea urchin relatives), especially the “sand dollar” and “sea biscuit” line; often treated as a variant spelling of Clypeasterina.","zh":"（动物学分类名）指一类海胆类（棘皮动物）群，常与“沙钱/沙海胆（sand dollars）”“海饼（sea biscuits）”相关；在一些资料中常被视为 Clypeasterina 的异拼写/变体。"},"examples":[{"en":"Some older references list sand dollars under Clypeastrina (often written as Clypeasterina).","zh":"一些较早的资料会把沙钱类列在 Clypeastrina（也常写作 Clypeasterina）之下。"},{"en":"In a museum catalog, “Clypeastrina” may appear as a label for certain flattened echinoids.","zh":"在博物馆目录里，“Clypeastrina”可能作为某些扁平海胆类标本的标签出现。"}]}],"synonyms":["Clypeasterina","sand dollar (common name, not a strict synonym)","sea biscuit (common name, related)"],"phonetic":"ˌklaɪpiəˈæstrɪnə","extraExplanation":["这是一个偏专业的拉丁化分类名称，日常英语中极少使用。阅读学术文献时，建议同时检索更常见的拼写 Clypeasterina，以及相关通俗名 sand dollar（沙钱/海胆的一类）与 sea biscuit（海饼）。","分类名称在不同年代或不同分类体系中可能有变动；如果你是在论文、化石/标本标签或数据库里看到该词，最好结合上下文确认它对应的“阶元”（如亚目、类群等）以及作者采用的体系。"]}
{"word":"clypeastroid","summary":{"en":"A clypeastroid is a flat, disk‑shaped sea urchin (or related to that group), such as a sand dollar or sea biscuit.","zh":"clypeastroid 指盾海胆目的一类扁平圆盘状海胆（或与之相关的），如沙钱、海饼干等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sea urchin in the group Clypeasteroida (flat, disk‑shaped echinoids such as sand dollars and sea biscuits).","zh":"盾海胆类动物：指盾海胆目（Clypeasteroida）的一类海胆，通常扁平呈圆盘状，例如沙钱（sand dollar）和“海饼干”（sea biscuit）。"},"examples":[{"en":"Many clypeastroids live partly buried in sandy seabeds.","zh":"许多盾海胆类会部分埋在沙质海底生活。"},{"en":"The fossil was identified as a clypeastroid because of its flattened, coin‑like shape.","zh":"这块化石因其扁平、像硬币一样的形状而被鉴定为盾海胆类。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or belonging to the clypeastroids.","zh":"与盾海胆类有关的；属于盾海胆类的。"},"examples":[{"en":"Researchers compared clypeastroid body plans with those of other sea urchins.","zh":"研究人员将盾海胆类的体型结构与其他海胆进行比较。"}]}],"synonyms":["clypeasteroid","sand dollar (informal/common example)","sea biscuit (common example)"],"phonetic":"/ˌklaɪpiˈæstrɔɪd/","extraExplanation":["这个词在英语里更常见的拼写是 **clypeasteroid**（带 -er-），而 **clypeastroid** 属于较少见的变体拼写。在学术写作中建议优先使用更常见的拼写以便检索文献。","词根提示：**clypeus**（拉丁语，意为“盾牌”）+ **-oid**（“……形状的”），呼应这类海胆常见的“扁平/盾状”外形。"]}
{"word":"Clypeastroida","summary":{"en":"Clypeastroida is the scientific name for the order of sea urchins that includes sand dollars and sea biscuits.","zh":"Clypeastroida 是包含沙钱与海饼等扁平海胆的科学分类名称（一个“目”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a taxonomic order of sea urchins that includes sand dollars and sea biscuits (flat or disk-shaped echinoids).","zh":"（生物分类）海胆纲的一类目，包含沙钱（sand dollars）和海饼（sea biscuits）等扁平或圆盘状的海胆。"},"examples":[{"en":"Sand dollars belong to the order Clypeastroida.","zh":"沙钱属于 Clypeastroida（盾海胆目）。"},{"en":"The museum display compares regular sea urchins with Clypeastroida, which are usually flatter.","zh":"博物馆展览把普通海胆和 Clypeastroida（通常更扁平）做了对比。"}]}],"synonyms":["clypeasteroids","sand dollars and allies"],"phonetic":"/ˌklaɪpiːˈæstrɔɪdə/","extraExplanation":["这是一个拉丁化的科学分类名，常见于海洋生物学/古生物学文献中。一般日常英语更常说 sand dollars（沙钱）或 sea biscuits（海饼），而不是直接用 Clypeastroida。","词根上可联想到 clypeus（拉丁语“盾”）+ 形态相关的后缀，暗示其“盾/盘状”的外形特征。"]}
{"word":"clypeastroida","summary":{"en":"Clypeasteroida is a biological taxonomic order that includes sand dollars and sea biscuits.","zh":"Clypeasteroida 是一个生物分类“目”，包含沙钱和海饼等海胆类亲缘动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology) An order of echinoderms (sea urchin relatives) that includes sand dollars and sea biscuits; commonly written as **Clypeasteroida**.","zh":"（生物）一种棘皮动物（海胆近亲）的目，包含**沙钱（sand dollars）**与**海饼（sea biscuits）**；常见拼写为 **Clypeasteroida**。"},"examples":[{"en":"Sand dollars belong to the order Clypeasteroida.","zh":"沙钱属于 Clypeasteroida（盾形海胆目）。"},{"en":"In a marine biology lab, students compared Clypeasteroida with other sea urchins.","zh":"在海洋生物实验课上，学生把 Clypeasteroida 与其他海胆类作比较。"}]}],"synonyms":["Clypeasteroida (standard spelling)","sand dollar order","sea biscuit order"],"phonetic":"/ˌklaɪpiːəˈstɛrɔɪdə/","extraExplanation":["你输入的 **clypeastroida** 很可能是拼写误差；标准写法通常是 **Clypeasteroida**（分类学名称首字母常大写）。","词源提示：**clypeus**（拉丁语）有“盾牌”之意，指这类动物较扁平、像圆盘/盾牌的外形；因此 sand dollar 的外形特征和这个名称有关。"]}
{"word":"Clypeastroidea","summary":{"en":"Clypeastroidea is the scientific name for the group of echinoids that includes sand dollars and sea biscuits.","zh":"Clypeastroidea 是包含沙钱与海饼等动物的一类海胆（棘皮动物）科学分类名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific group (infraclass) of echinoids (sea urchins) that includes sand dollars and sea biscuits, known for their flattened or disk-like bodies adapted to living on or in sandy seafloors.","zh":"（生物分类）一种海胆类（棘皮动物门）下的科学分类群（下纲），包括沙钱（sand dollars）和海饼（sea biscuits），常见特征是身体扁平或圆盘状，适应在沙质海底表面或沙中生活。"},"examples":[{"en":"Sand dollars belong to the infraclass Clypeastroidea.","zh":"沙钱属于下纲 Clypeastroidea。"},{"en":"Many Clypeastroidea species are adapted to burrowing into sand to avoid waves and predators.","zh":"许多 Clypeastroidea 的物种会钻入沙中，以躲避海浪和捕食者。"},{"en":"In a marine biology lab, students compared the shapes of Clypeastroidea and other sea urchins.","zh":"在海洋生物学实验课上，学生比较了 Clypeastroidea 与其他海胆的外形差异。"}]}],"synonyms":["sand-dollar echinoids","sand dollars (common name for members)"],"phonetic":"/ˌklaɪpiəˈstrɔɪdiə/","extraExplanation":["词源提示：Clypeastroidea 来自拉丁/希腊词根，clypeus 有“盾牌”之意，呼应这类动物常见的“盾形/盘形”外观。","使用场景：该词主要出现在动物学、海洋生物学与古生物学文献中；日常英语里人们更常说 sand dollar（沙钱）或 sea biscuit（海饼）。"]}
{"word":"clypeastroidea","summary":{"en":"Clypeastroidea is the scientific name for the order of sea urchins that includes sand dollars and sea biscuits.","zh":"Clypeastroidea 是一个科学分类名称，指包含沙钱和海饼等在内的一类海胆（盾海胆目）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group (order) of sea urchins that includes sand dollars and sea biscuits; these echinoids usually have a flattened or rounded “disk-like” body adapted for life on or in sandy seafloors.","zh":"一种海胆类群（通常作“目”），包括沙钱（sand dollars）和海饼（sea biscuits）；这类棘皮动物的身体多呈扁平或圆盘状，适应在沙质海底表面或沙中生活。"},"examples":[{"en":"Sand dollars belong to the order Clypeastroidea.","zh":"沙钱属于 Clypeastroidea（盾海胆目）。"},{"en":"Researchers compared feeding behavior across several Clypeastroidea species.","zh":"研究人员比较了多个 Clypeastroidea 物种的取食行为。"},{"en":"In the museum collection, Clypeastroidea specimens are labeled with their family and genus names.","zh":"在博物馆馆藏中，Clypeastroidea 标本会标注其科名和属名。"}]}],"synonyms":["clypeasteroids (informal/common name)"],"phonetic":"/ˌklaɪpiːəˈstrɔɪdiə/","extraExplanation":["这是一个生物分类学术语，常出现在海洋生物学、古生物学和系统分类学文本中；日常英语里较少使用。","词源上与拉丁语/希腊语中“盾（shield）”相关，暗示这类海胆外形像圆盾或扁圆盘。","常见相关词：sand dollar（沙钱/海钱）、sea biscuit（海饼）、echinoid（海胆类/海胆纲动物）。"]}
{"word":"clypeate","summary":{"en":"Clypeate means “shield-shaped,” used mainly in scientific descriptions of organisms.","zh":"clypeate 意为“盾形的”，主要用于对生物形态的科学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially in biology) Shield-shaped; shaped like or resembling a shield.","zh":"（尤用于生物学）盾形的；像盾牌一样的。"},"examples":[{"en":"The beetle has a clypeate plate on the front of its head.","zh":"这只甲虫头部前方有一块盾形的板状结构。"},{"en":"Some leaves are described as clypeate when they look like a small shield.","zh":"有些叶片看起来像小盾牌时，会被形容为盾形的。"}]}],"synonyms":["shield-shaped","scutiform","buckler-shaped"],"phonetic":"/ˈklaɪpi.eɪt/","extraExplanation":["这个词比较书面、偏专业，常见于昆虫学与植物形态学等描述性文本。","词源来自拉丁语 clypeus（盾牌）。在昆虫学里，clypeus 也是“唇基”（头部前方的一块硬板）这个结构名称；clypeate 则强调“盾形/像唇基那样的形状”。"]}
{"word":"clypeated","summary":{"en":"Clypeated means “shield-shaped,” especially in scientific descriptions.","zh":"clypeated 指“盾形的”，尤其常用于科学（如生物学）描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Shield-shaped; having the form of a round shield (often used in biology to describe an organism or body part).","zh":"盾形的；像圆盾一样的（常用于生物学中描述生物体或器官的形状）。"},"examples":[{"en":"The insect has a clypeated head plate that looks like a small shield.","zh":"这种昆虫的头部背板呈盾形，看起来像一面小盾牌。"},{"en":"Under the microscope, the structure appears clypeated and slightly convex.","zh":"在显微镜下，这个结构呈盾形，并且略微隆起。"}]}],"synonyms":["shield-shaped","clypeate","scutiform"],"phonetic":"/ˈklɪpiˌeɪtɪd/","extraExplanation":["“clypeated”较为少见，多见于较旧的科学写作或分类描述中。它来自拉丁语词根 clypeus，意为“圆盾”。现代生物学里更常见的近义写法是 clypeate 或 shield-shaped（更通俗）。"]}
{"word":"clypei","summary":{"en":"Clypei is the plural form of clypeus, meaning the shield-like plate(s) on the front of an insect’s head.","zh":"Clypei 是 clypeus 的复数，指昆虫头部前方的盾状板（唇基）的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of clypeus; in entomology/anatomy, the clypei are the shield-like plates on the front of an insect’s head (above the upper lip/labrum).","zh":"clypeus 的复数；（昆虫学/解剖）指昆虫头部前方、上唇（labrum）上方的“盾状板”（唇基），复数为 clypei。"},"examples":[{"en":"In many beetles, the clypei form a distinct plate between the frons and the labrum.","zh":"在许多甲虫中，clypei 是位于额区（frons）与上唇（labrum）之间的一块明显板状结构。"},{"en":"The key identifies this wasp by the shape of its clypei.","zh":"这份检索表通过 clypei 的形状来识别这种黄蜂。"}]}],"synonyms":["clypeuses (less common)","facial plates (general)"],"phonetic":"ˈklaɪpiˌaɪ","extraExplanation":["“clypeus / clypei”来自拉丁语，原意是“盾牌”。因此在昆虫学里用来形容头部前方那块像盾一样的硬板结构。","在现代英语中，它主要出现在学术语境（昆虫分类、形态描述、解剖图注）里，日常交流很少用到。"]}
{"word":"clypeiform","summary":{"en":"“Clypeiform” means shield-shaped, often used in scientific descriptions of organisms’ structures.","zh":"“clypeiform”意为“盾形的”，常用于科学（生物形态）描述某些结构的外形。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Shield-shaped; having the form of a round or oval shield.","zh":"盾形的；形状像（圆形或椭圆形的）盾牌的。"},"examples":[{"en":"Some lichens have clypeiform fruiting bodies that look like tiny shields on the bark.","zh":"一些地衣的子实体呈盾形，看起来像树皮上的小小盾牌。"},{"en":"The description notes a clypeiform leaf base, broad and slightly rounded.","zh":"描述中提到叶基呈盾形，较宽并略微圆润。"}]}],"synonyms":["shield-shaped","scutiform"],"phonetic":"/ˈklaɪpiˌfɔrm/","extraExplanation":["这个词多见于生物学/植物学/真菌学的形态描述（例如叶片、鳞片、子实体等的外形）。","词源来自拉丁语 *clypeus*（盾牌）+ *-form*（……形状的）。看到 *-form* 结尾的形容词时，通常可以理解为“呈……形”。"]}
{"word":"clypeo","summary":{"en":"clypeo- is a scientific prefix meaning “related to an insect’s clypeus (a shield-like plate on the front of the head).”","zh":"clypeo- 是科学用的构词成分，意为“与昆虫唇基（头部前方的盾状硬板）有关”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a prefix or combining form meaning “relating to the clypeus,” the shield-like front plate on an insect’s head (above the mouthparts).","zh":"（多用于昆虫学的）词缀/构词成分，表示“与唇基有关”；唇基是昆虫头部前方、口器上方的一块盾状硬板。"},"examples":[{"en":"In some ants, the clypeal margin helps identify the species.","zh":"在一些蚂蚁中，唇基（clypeal）边缘有助于鉴别物种。"},{"en":"The paper describes clypeal hairs and their role in feeding.","zh":"论文描述了唇基（clypeal）毛以及它们在取食中的作用。"}]}],"synonyms":["clypeal (related adjective)","clypeus (the structure)"],"phonetic":"ˈklaɪpiːoʊ","extraExplanation":["“clypeo-”来自拉丁语 clypeus（盾牌）。在英文里常见于学术词汇，如 clypeal（唇基的）、clypeus（唇基）。日常英语几乎不用，主要出现在昆虫解剖或分类描述中。"]}
{"word":"clypeola","summary":{"en":"Clypeola is a botanical genus (mustard family), sometimes called shieldwort.","zh":"Clypeola 是一个植物属名（十字花科），有时俗称“盾果草/盾形草”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small flowering plants in the mustard family (Brassicaceae), often called shieldwort, found mainly in Europe and parts of Western Asia and North Africa.","zh":"一种十字花科（Brassicaceae）的开花植物属，通常俗称“盾果草/盾形草”（shieldwort），主要分布于欧洲及西亚、北非部分地区。"},"examples":[{"en":"Clypeola species are small mustard-family plants with distinctive, shield-like seed pods.","zh":"Clypeola 属的植物体型较小，属于十字花科，常见特征是像盾牌一样的果荚。"},{"en":"In some Mediterranean habitats, you may find Clypeola growing in dry, open ground.","zh":"在一些地中海地区的生境中，你可能会在干燥、开阔的地面看到 Clypeola 生长。"}]}],"synonyms":["shieldwort (common name)"],"phonetic":"/ˌklaɪpiˈoʊlə/","extraExplanation":["这是一个比较少见的拉丁学名（植物属名），日常英语里不常用，多见于植物学、生态学或物种名录中。","词源上与拉丁语 clypeus（“盾牌”）有关，暗示其果实或结构呈“盾形”。","如果你在论文或图鉴里看到它，通常是作为双名法的一部分出现：例如 Clypeola jonthlaspi（属名 + 种加词）。"]}
{"word":"clypeolar","summary":{"en":"Clypeolar means “shield-shaped,” mainly used in scientific descriptions (especially biology).","zh":"clypeolar 表示“盾形的”，主要用于科学（尤其生物学）描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Shield-shaped; resembling a round or oval shield (often used in biology to describe body parts or structures).","zh":"盾形的；像圆形或椭圆盾牌一样的（常用于生物学中描述某些身体部位或结构）。"},"examples":[{"en":"In some insects, the pronotum can be clypeolar in shape.","zh":"在一些昆虫中，前胸背板的形状可能呈盾形。"},{"en":"The scientist described a clypeolar plate covering the front part of the body.","zh":"科学家描述了一块盾形的板状结构覆盖在身体前部。"}]}],"synonyms":["shield-shaped","scutiform"],"phonetic":"/ˌklaɪpiˈoʊlər/","extraExplanation":["“clypeolar”主要见于动物学、昆虫学与植物形态学等描述性写作中，日常英语里非常少用。","词根来自拉丁语 clypeus，意思是“圆盾”。因此它强调的是“盾牌般的外形”，而不是“防护”的含义。"]}
{"word":"clypeolate","summary":{"en":"Clypeolate means shield-shaped or shield-like, used mainly in biological descriptions.","zh":"Clypeolate 指“盾形的/像盾牌的”，主要用于生物学形态描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany/Zoology) Having the shape of a shield; shield-like.","zh":"（植物学/动物学）盾形的；像盾牌一样的。"},"examples":[{"en":"The beetle has a clypeolate plate covering the front of its head.","zh":"这只甲虫的头部前方有一块盾形的板状结构。"},{"en":"In the field guide, the leaves are described as small and clypeolate.","zh":"在野外图鉴里，这种叶子被描述为小而盾形。"}]}],"synonyms":["shield-shaped","shield-like","scutiform","scutellate"],"phonetic":"ˌklaɪpiˈoʊleɪt","extraExplanation":["词源来自拉丁语 *clypeus*（“圆盾”）。在生物学描述里，*clypeolate* 多用于形容某个部位“整体轮廓像盾牌”，常见于昆虫形态（如头部的“唇基/额盾”区域）或某些植物结构的外形描述。","容易和 *peltate*（“盾状着生的”，指叶柄连接在叶片近中心处而非边缘）混淆：*clypeolate* 主要强调“形状像盾”，而 *peltate* 强调“连接方式/着生点”。"]}
{"word":"clypeole","summary":{"en":"Clypeole is a rare technical noun meaning a small shield-like plate or structure, especially in zoology/anatomy.","zh":"Clypeole 是一个罕见的专业名词，指小型的盾状板或盾状结构，常见于动物学/解剖学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small shield-shaped structure; especially a small clypeus (a shield-like plate) in anatomy or zoology.","zh":"小盾状结构；尤指解剖学或动物学中的“小额盾/小盾片”（clypeus 的小型形态）。"},"examples":[{"en":"In some insect descriptions, the clypeole is mentioned as a tiny shield-like plate on the front of the head.","zh":"在一些昆虫形态描述中，clypeole 指头部前方一个很小的盾状板。"},{"en":"The specimen’s clypeole is broader than in related species.","zh":"该标本的 clypeole 比近缘物种更宽。"}]}],"synonyms":["clypeus","shield-like plate","shieldlet"],"phonetic":"/ˈklaɪpiˌoʊl/","extraExplanation":["“clypeole”非常少见，多用于较专业的分类学/形态学语境。它来自拉丁语词根 clypeus（盾、盾牌），-ole/-ole(或 -olus) 常带有“小……的”含义，因此整体可理解为“像小盾牌一样的结构”。","如果你其实想查更常见的词，可能是拼写接近的 clypeus（昆虫头部前方的“额盾”）或 clypeolate（盾形的）。"]}
{"word":"clypeus","summary":{"en":"Clypeus is a technical noun meaning a shield-like plate—most commonly the facial plate on an insect’s head above the mouthparts.","zh":"clypeus 是专业名词，指“盾形板”；最常见是指昆虫头部正面、口器上方的唇基。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In entomology) a shield-like plate on the front of an insect’s head, located below the frons (forehead area) and above the labrum (upper lip).","zh":"（昆虫学）昆虫头部正面的一块“盾形”硬板，位于额区（frons）下方、上唇（labrum）上方。"},"examples":[{"en":"In many beetles, the clypeus forms a clear boundary above the mouthparts.","zh":"在许多甲虫中，clypeus（唇基）在口器上方形成清晰的分界。"},{"en":"The key to identifying this wasp includes the shape and punctures on the clypeus.","zh":"鉴定这种黄蜂的要点包括唇基的形状和其表面的刻点。"}]},{"partOfSpeech":"n.","definition":{"en":"A shield-shaped part or structure, especially in anatomy/zoology, named by analogy with a shield.","zh":"（引申义）盾形的结构或部位（尤用于解剖学/动物学中，以“盾”为类比命名）。"},"examples":[{"en":"Some anatomical descriptions use clypeus for a shield-like region.","zh":"一些解剖学描述会用 clypeus 指代某个盾形区域。"}]}],"synonyms":["facial plate (context-specific)","clypeal plate (technical)"],"phonetic":"/ˈklɪpiəs/","extraExplanation":["词源来自拉丁语 clypeus，意为“圆盾/盾牌”。因为该结构形状像盾，所以在昆虫形态学中被借用为术语。","在中文昆虫学里，clypeus 常译为“唇基”。它常用于物种鉴定（比如比较唇基的形状、边缘、毛或刻点）。"]}
{"word":"clypeus-related","summary":{"en":"“Clypeus-related” means related to the clypeus—a shield-like plate—most often in insect anatomy (the clypeus on the face).","zh":"“clypeus-related”意为“与唇基/盾状板有关的”，多用于昆虫形态学中指与头部唇基区域相关的特征。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with, resembling, or involving a clypeus (a shield-like plate), especially the clypeus on an insect’s face or the anatomical “shield” in some animals.","zh":"与“clypeus（盾状板）”有关的；类似盾状板的；涉及盾状板的（尤指昆虫头部前脸的额唇基/唇基区域）。"},"examples":[{"en":"In the species description, the author notes a clypeus-related ridge above the mouthparts.","zh":"在物种描述中，作者提到口器上方有一条与唇基相关的隆起。"},{"en":"The key uses clypeus-related characters to separate the two wasp genera.","zh":"这份检索表用与唇基相关的特征来区分两个黄蜂属。"}]}],"synonyms":["clypeal","pertaining to the clypeus","clypeus-associated"],"phonetic":"/ˈklɪpiəs rɪˌleɪtɪd/","extraExplanation":["“clypeus”源自拉丁语，原意是“圆盾/盾牌”，因此在生物学里常用来指“像盾一样的板状结构”。在昆虫形态学中，clypeus通常指头部前面、位于额（frons）下方、上唇（labrum）上方的那块硬板区域。学术写作里用“clypeus-related”多见于分类学、形态学描述与检索表。"]}
{"word":"clypeuses","summary":{"en":"“Clypeuses” refers to clypeus structures—shield-like plates on the front of an insect’s head (often pluralized as clypei in scientific writing).","zh":"“clypeuses”指昆蟲頭部前方的盾狀硬板（額盾／唇基）；學術寫作中更常用複數 clypei。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology, entomology) The shield-like plate on the front of an insect’s head, just above the upper lip (labrum).","zh":"（生物／昆虫學）昆蟲頭部前方、上唇（labrum）上方的盾狀硬板（額盾／唇基）。"},"examples":[{"en":"In many beetles, the clypeus forms a clear border above the mouthparts.","zh":"在許多甲蟲中，額盾在口器上方形成明顯的邊界。"},{"en":"The researcher compared the shape of the clypeus to identify closely related species.","zh":"研究人員比較額盾的形狀來辨識近緣物種。"}]}],"synonyms":["clypeus","clypei (plural)","clypeal plate","shield (figurative)"],"phonetic":"ˈklaɪpiəs","extraExplanation":["「clypeuses」在英文中多半是把拉丁語名詞 clypeus（常見複數為 clypei）做成不常見的英語複數拼法；在學術文章裡更常看到 clypeus（單數）與 clypei（複數）。","字源來自拉丁語 clypeus，意為「圓盾牌」，因此這個構造常被描述為「盾狀（shield-like）」；閱讀昆蟲形態學資料時也常遇到 related 形容詞 clypeal（與額盾相關的）。"]}
{"word":"clyppan","summary":{"en":"“Clyppan” is an Old English verb meaning “to embrace or clasp tightly.”","zh":"“clyppan”是一个古英语动词，意思是“拥抱、紧紧搂住/抱住”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Old English, obsolete) To embrace; to clasp or hold closely.","zh":"（古英语，已废）拥抱；紧抱；搂住。"},"examples":[{"en":"In some Old English texts, “clyppan” is used for holding someone in a close embrace.","zh":"在一些古英语文本中，“clyppan”用来表示把某人紧紧拥入怀中。"},{"en":"He clyppan his child and would not let go.","zh":"他紧紧抱住孩子，不肯放手。"}]}],"synonyms":["embrace","hug","clasp","hold close"],"phonetic":"/ˈklɪpən/","extraExplanation":["“clyppan”来自古英语，现代英语里对应意义最接近的是 *to clasp* / *to embrace*。它也与现代英语单词 *clip*（夹住、剪下）在词源上有关：早期“把东西夹住/抱住”的核心概念，后来在现代英语发展出“夹、剪”的常见用法。","在学习或阅读时，可以把它当作一种文学/历史用词：在现代日常英语中不会用“clyppan”，写作时更推荐用 *embrace*, *hug*, *clasp*。"]}
{"word":"clyses","summary":{"en":"“closes” means “shuts” or “ends,” and is the present form used with he/she/it.","zh":"“closes”表示“关上/结束/停业”，是与 he/she/it 搭配的现在时形式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"third-person singular present of “close”: to shut something; to end or finish something; or to stop operating (for a business or place).","zh":"“close”的第三人称单数现在时：关闭（门、窗等）；结束/完成（会议、活动等）；（商店、机构等）停业/关闭。"},"examples":[{"en":"She closes the door quietly.","zh":"她轻轻地把门关上。"},{"en":"The store closes at 9 p.m.","zh":"这家店晚上九点关门。"},{"en":"The meeting closes with a short speech.","zh":"会议以一段简短的讲话结束。"}]}],"synonyms":["shuts","ends","finishes","concludes"],"phonetic":"/ˈkloʊzɪz/","extraExplanation":["你输入的“clyses”看起来像拼写错误。最常见的可能是：\n1) closes（关上/结束/停业）；\n2) clichés（陈词滥调，名词复数）。\n如果你想查的是“clichés”，告诉我你的语境（句子）我可以给你对应词条。"]}
{"word":"clysis","summary":{"en":"A rare medical term meaning therapeutic infusion of fluid into the body, especially via the rectum or under the skin.","zh":"较少见的医学词：指为治疗而向体内灌入液体，尤指经直肠或皮下灌注。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) The infusion of a liquid into the body for therapeutic purposes, especially through the rectum (as in proctoclysis) or into subcutaneous tissue (as in hypodermoclysis).","zh":"（医学）为治疗目的将液体灌入体内的做法，尤指经直肠灌注（如 proctoclysis），或皮下注液（如 hypodermoclysis）。"},"examples":[{"en":"Because the patient couldn’t keep fluids down, the doctor considered clysis to prevent dehydration.","zh":"因为病人无法进食或保住液体，医生考虑用灌注疗法来防止脱水。"},{"en":"In older medical texts, clysis is mentioned as a way to deliver water or saline when IV access is difficult.","zh":"在较早的医学文献中，clysis 被提及为一种在静脉通路困难时输送水或生理盐水的方法。"}]}],"synonyms":["infusion","proctoclysis","hypodermoclysis"],"phonetic":"/ˈklaɪsɪs/","extraExplanation":["这是一个比较少见、偏“旧式/书面”的医学词汇，现代临床更常直接说更具体的术语：proctoclysis（直肠灌注）或 hypodermoclysis（皮下注液）。","词源来自希腊语，和“冲洗/灌洗”有关，因此常见于描述“灌注、灌肠式补液”的语境。","如果你是想查的是 lysis（溶解/裂解）或 clisis（语言学：重音词附着），拼写可能输入错了；告诉我你的上下文我可以帮你确认。"]}
{"word":"clysma","summary":{"en":"Clysma is a rare, formal word for an enema (a bowel-clearing wash).","zh":"clysma 是“灌肠（enema）”的少见、较正式的说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical procedure in which liquid is put into the rectum to help empty the bowels; an enema","zh":"（医疗）灌肠；把液体注入直肠以帮助排便的处理（同 enema）"},"examples":[{"en":"The doctor recommended a clysma to relieve severe constipation.","zh":"医生建议做一次灌肠来缓解严重便秘。"},{"en":"In older medical texts, you may see “clysma” used instead of “enema.”","zh":"在较早的医学文献中，你可能会看到用 clysma 来代替 enema。"}]}],"synonyms":["enema","clyster","bowel wash"],"phonetic":"ˈklɪzmə","extraExplanation":["这个词在现代英语里很少见，更多出现在医学史、古典或较旧的医学写作中；日常交流中通常用更常见、更直白的 enema。","词源来自希腊语，和“冲洗/灌洗”的含义有关。由于属于较私密的身体话题，正式场合建议使用医学用语（如 enema）并注意措辞。"]}
{"word":"clysmian","summary":{"en":"“clysmian” isn’t standard English; it likely refers to “cataclysmic,” meaning disastrous or massively destructive.","zh":"“clysmian”不是标准英语；很可能想写“cataclysmic”，意为“灾难性的、破坏巨大的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a misspelling of “cataclysmic” (describing something extremely violent or causing great destruction).","zh":"不是标准英语单词；很可能是把“cataclysmic”（指极其猛烈、造成巨大破坏的）拼错了。"},"examples":[{"en":"I couldn’t find “clysmian” in major dictionaries; did you mean “cataclysmic”?","zh":"在主流词典里找不到“clysmian”；你是不是想写“cataclysmic”？"},{"en":"The novel describes a cataclysmic flood that changes the whole city.","zh":"这部小说描写了一场灾难性的洪水，彻底改变了整座城市。"}]},{"partOfSpeech":"n.","definition":{"en":"cataclysm (noun): a sudden, violent event that causes great change or destruction.","zh":"cataclysm（名词）：突发的、猛烈的灾难性事件，造成巨大变化或破坏。"},"examples":[{"en":"The earthquake was a cataclysm for the region.","zh":"那场地震对该地区来说是一场大灾难。"},{"en":"Some historians describe the war as a political cataclysm.","zh":"一些历史学家把这场战争称为一场政治巨变（灾难）。"}]}],"synonyms":["catastrophic","disastrous","devastating","calamitous"],"phonetic":"/ˌkætəˈklɪzmɪk/","extraExplanation":["“cataclysm”来自希腊语词根，和“冲刷、洪水”相关，后来意义扩展为“任何灾难性巨变”。","如果你想表达“天堂般的、极其美好的”，可能你想写的是“Elysian”（/iˈlɪʒən/），意思和“cataclysmic”完全相反。你可以告诉我你的句子语境，我来帮你确定正确单词。"]}
{"word":"clysmic","summary":{"en":"Cataclysmic means extremely disastrous, causing sudden and severe destruction or change.","zh":"Cataclysmic 指“灾难性的”，强调突然而严重的大规模破坏或巨变。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Causing sudden, violent, and extremely serious change or destruction; disastrous on a very large scale.","zh":"引发突然而剧烈、极其严重的变化或破坏的；灾难性的（规模很大）。"},"examples":[{"en":"The earthquake had cataclysmic effects on the coastal towns.","zh":"这场地震对沿海城镇造成了灾难性的影响。"},{"en":"A cataclysmic flood destroyed homes and roads across the region.","zh":"一场灾难性的洪水摧毁了整个地区的房屋和道路。"},{"en":"The company suffered a cataclysmic loss after the scandal.","zh":"丑闻之后，这家公司遭受了灾难性的损失。"}]}],"synonyms":["devastating","disastrous","catastrophic","ruinous"],"phonetic":"/ˌkætəˈklɪzmɪk/","extraExplanation":["你输入的“clysmic”通常是拼写缺字，常见正确形式是 **cataclysmic**（少了前面的 cata-）。","词根提示：cataclysm（大灾变）来自希腊语词源，常用于描述自然灾害（地震、火山、洪水）或比喻性的重大冲击（经济崩盘、社会动荡）。","搭配很常见：cataclysmic event/disaster/change/effects；语气比“very bad”强得多，表示“几乎毁灭性”的程度。"]}
{"word":"clyssus","summary":{"en":"“Clyssus” isn’t a recognized English vocabulary word; it’s likely a name or a misspelling.","zh":"“clyssus”不是常见英语词汇；更可能是名字或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most likely a misspelling or a proper name (e.g., a username, character name, or brand).","zh":"不是标准英语单词；更可能是拼写错误或专有名词（如用户名、角色名或品牌名）。"},"examples":[{"en":"I couldn’t find “clyssus” in a dictionary—could it be a name or a typo?","zh":"我在词典里找不到“clyssus”——它会不会是名字或拼写错了？"},{"en":"If “clyssus” is a character name, its meaning depends on the story’s world-building.","zh":"如果“clyssus”是角色名，它的含义取决于作品的世界观设定。"}]}],"synonyms":["(none—likely a name/typo)"],"phonetic":"/ˈklɪsəs/","extraExplanation":["“clyssus”在常见英英词典/语料中几乎查不到，通常说明它不是通用词汇。你可以检查是否想写：\n- clysis /ˈklaɪsɪs/（医学：输液、灌注）\n- Clitus /ˈklaɪtəs/（人名，历史/文学中可能出现）\n- 或者其他接近拼写。\n如果你告诉我它出现的句子或来源（书名/游戏/截图），我可以更准确判断它的词性与含义。"]}
{"word":"clyster","summary":{"en":"Clyster is an old-fashioned word for an enema (or to give an enema).","zh":"clyster 是“灌肠/灌肠剂”（或“给人灌肠”）的古语说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) An enema: a liquid medicine put into the rectum to empty the bowels or deliver medication.","zh":"（古语）灌肠；灌肠剂：把液体药物注入直肠，用于通便或给药。"},"examples":[{"en":"In old medical texts, doctors often prescribed a clyster for constipation.","zh":"在旧式医学文献中，医生常开“clyster”来治疗便秘。"},{"en":"The patient was given a clyster before surgery, as was common in earlier centuries.","zh":"在早期几个世纪里，手术前给病人灌肠很常见。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Archaic) To give someone an enema.","zh":"（古语）给（某人）灌肠。"},"examples":[{"en":"The nurse was instructed to clyster the patient if the medicine did not work by mouth.","zh":"如果口服药不起作用，就指示护士给病人灌肠给药。"}]}],"synonyms":["enema","bowel irrigation"],"phonetic":"/ˈklɪstər/","extraExplanation":["“clyster”主要见于16–19世纪的英式英语医学与文学作品，如今日常英语几乎不用，现代更常说“enema”。","词源可追溯到拉丁语与希腊语中表示“注射/灌入”的词根，反映了当时以灌肠作为常见治疗手段的医疗文化背景。"]}
{"word":"clysterize","summary":{"en":"“Clysterize” is an archaic verb meaning to give someone an enema.","zh":"“clysterize”是一个较古旧的动词，意思是“给某人灌肠”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to give someone an enema (to inject liquid into the rectum for medical treatment or cleansing); an old-fashioned/archaic term","zh":"给某人灌肠（将液体注入直肠用于治疗或清洁）；较古旧/过时的用法"},"examples":[{"en":"In older medical texts, doctors might clysterize a patient to relieve severe constipation.","zh":"在较早的医学文献中，医生可能会给病人灌肠，以缓解严重便秘。"},{"en":"The word is now rare; modern English usually says “give an enema.”","zh":"这个词现在很少见；现代英语通常说“give an enema（灌肠）”。"}]}],"synonyms":["give an enema","administer an enema","enema (as a verb, medical)"],"phonetic":"/ˈklɪstərˌaɪz/","extraExplanation":["“clysterize”源自名词“clyster”（灌肠器/灌肠），该词在17–19世纪的英语医学与讽刺文学中较常见；如今多被更直接的表达“give/administer an enema”取代。","在文学里它有时带一点滑稽或讽刺色彩，因为灌肠在早期欧洲医学中相当普遍，也常被用来调侃“过度治疗”。"]}
{"word":"clysters","summary":{"en":"“Clusters” usually means groups of similar things close together, or (as a verb) to gather closely; it is the plural/verb form of “cluster.”","zh":"“Clusters”通常指“成簇/成群地聚在一起”，或作动词表示“聚集”；它是“cluster”的复数/动词形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group of similar things close together (plural of “cluster”)","zh":"一簇；一群（相似的东西聚在一起，“cluster”的复数）"},"examples":[{"en":"A cluster of grapes hung from the vine.","zh":"一串葡萄挂在葡萄藤上。"},{"en":"The stars form clusters that you can see on a clear night.","zh":"在晴朗的夜晚，你能看到星星形成的星团。"},{"en":"We sat in small clusters to discuss the question.","zh":"我们分成几个小组（成小圈）讨论这个问题。"}]},{"partOfSpeech":"v.","definition":{"en":"to gather or arrange close together (third-person singular: “clusters”)","zh":"（使）聚集；（使）集中（动词第三人称单数：clusters）"},"examples":[{"en":"People cluster near the entrance when the event starts.","zh":"活动开始时，人们会聚在入口附近。"},{"en":"Dark clouds clustered over the mountains.","zh":"乌云聚集在群山上空。"}]}],"synonyms":["groups","bunches","bunch","clumps","gather","gather together","cluster together"],"phonetic":"/ˈklʌstər/","extraExplanation":["你输入的“clysters”很可能是拼写错误，常见目标词是“clusters”。","另外也存在一个非常少见、偏古旧的单词“clyster”（复数 clysters），历史上指“灌肠/灌肠器”（enema），多见于旧式医学文本或文学作品里；现代英语更常用“enema”。"]}
{"word":"Clytaemnesra","summary":{"en":"Clytemnestra is the mythological wife of Agamemnon, famous for killing him after the Trojan War.","zh":"克吕泰涅斯特拉是阿伽门农的神话妻子，以在特洛伊战争后杀死他而著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Clytemnestra (also spelled Clytaemnestra) is a queen in Greek mythology: the wife of King Agamemnon and the mother of Orestes, Electra, and Iphigenia. She is best known for killing Agamemnon when he returns from the Trojan War (often as revenge for his sacrifice of their daughter Iphigenia).","zh":"克吕泰涅斯特拉（也写作 Clytaemnestra）是希腊神话中的王后：阿伽门农的妻子，俄瑞斯忒斯、厄勒克特拉与伊菲革涅亚的母亲。她最著名的情节是阿伽门农从特洛伊战争归来后被她杀死（常被解释为为女儿伊菲革涅亚被献祭而复仇）。"},"examples":[{"en":"In the tragedy, Clytemnestra murders Agamemnon when he comes home from Troy.","zh":"在悲剧中，克吕泰涅斯特拉在阿伽门农从特洛伊归来时杀了他。"},{"en":"Many readers see Clytemnestra as both a villain and a grieving mother.","zh":"许多读者既把克吕泰涅斯特拉视为反派，也视为一位悲痛的母亲。"}]}],"synonyms":["Clytaemnestra (variant spelling)"],"phonetic":"/ˌklaɪtəmˈnɛstrə/","extraExplanation":["“Clytemnestra”来自古希腊语的拉丁转写。英语里常见两种拼法：Clytemnestra（更常见）与 Clytaemnestra（较接近某些古典转写习惯）。","她最重要的文学形象常出现在古希腊悲剧中：埃斯库罗斯《俄瑞斯忒亚》（尤其《阿伽门农》）以及索福克勒斯、欧里庇得斯相关剧作。她的故事核心主题包括：复仇、正义、家庭伦理与权力。"]}
{"word":"Clytaemnestra","summary":{"en":"Clytaemnestra is a famous queen in Greek mythology and tragedy, best known for killing her husband Agamemnon and symbolizing revenge and family violence.","zh":"Clytaemnestra（克吕泰涅斯特拉）是希腊神话与悲剧中的著名王后，以杀死丈夫阿伽门农而闻名，并常象征复仇与家族暴力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, the wife of King Agamemnon who kills him when he returns from the Trojan War (often portrayed as acting from revenge, anger, or a struggle for power).","zh":"（希腊神话）阿伽门农王的妻子；在特洛伊战争后阿伽门农归来时将其杀害的人物（常被描写为出于复仇、愤怒或权力斗争）。"},"examples":[{"en":"In Aeschylus’s tragedy, Clytaemnestra murders Agamemnon after his return from Troy.","zh":"在埃斯库罗斯的悲剧中，克吕泰涅斯特拉在阿伽门农从特洛伊归来后杀死了他。"},{"en":"Many modern retellings present Clytaemnestra as a complex character rather than a simple villain.","zh":"许多现代改写把克吕泰涅斯特拉呈现为复杂人物，而不是单纯的反派。"}]},{"partOfSpeech":"n.","definition":{"en":"A literary symbol of revenge, betrayed marriage, and the cycle of violence in a family (especially in Greek tragedy).","zh":"（文学意象）象征复仇、婚姻背叛与家族暴力循环的人物原型（尤见于希腊悲剧）。"},"examples":[{"en":"The novel uses a Clytaemnestra-like figure to explore betrayal and justice.","zh":"这部小说借用“克吕泰涅斯特拉式”的人物来探讨背叛与正义。"},{"en":"Critics often compare her to other tragic figures driven by grief and rage.","zh":"评论家常把她与其他被悲痛与愤怒驱动的悲剧人物相比较。"}]}],"synonyms":["(no true synonyms; related names: Agamemnon, Orestes, Aegisthus)"],"phonetic":"/ˌklaɪtiəmˈnɛstrə/","extraExplanation":["“Clytaemnestra”常见于《奥瑞斯提亚》（The Oresteia）三部曲：她杀夫后，儿子奥瑞斯忒斯（Orestes）又为父报仇杀母，体现“冤冤相报”的悲剧链条。","不同作品会强调不同动机：有的突出她对阿伽门农献祭女儿伊菲革涅亚（Iphigenia）的仇恨；有的强调她与埃癸斯托斯（Aegisthus）的关系与政治权力。","拼写与读音对学习者较难：可分段记忆为 Cly-taem-nes-tra（克-吕泰-涅斯-特拉），重音通常落在 “NES” 音节。"]}
{"word":"Clyte","summary":{"en":"Clyte is a rare name, usually used as a proper noun.","zh":"Clyte 是一个较少见的人名/姓氏，通常作为专有名词使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare proper name (given name or surname), often used as a literary/myth-inspired spelling; usually treated simply as a person’s name rather than a common vocabulary word.","zh":"一个较少见的专有名词（人名或姓氏），常见于文学或带神话色彩的拼写；通常作为人名使用，而不是常用词汇。"},"examples":[{"en":"In the novel, Clyte is the archivist who keeps the town’s records.","zh":"在小说里，Clyte 是负责保管小镇档案的档案管理员。"},{"en":"I’m not sure how to pronounce Clyte—does it rhyme with “kite”?","zh":"我不确定 Clyte 怎么读——它和 “kite” 押韵吗？"}]}],"synonyms":["(no direct synonyms; it is typically a name)"],"phonetic":"/klaɪt/","extraExplanation":["“Clyte”在英语世界里更常见为独特/创作型名字，或受古希腊名字拼写影响的变体。常见的读法多为 /klaɪt/（像 kite），但人名读音有时会因个人或地区偏好而不同。遇到真实人物时，最好以本人或权威来源的读法为准。"]}
{"word":"Clytemnestra","summary":{"en":"Clytemnestra is the queen in Greek myth who kills her husband Agamemnon, a major figure in Greek tragedy.","zh":"克吕泰涅斯特拉是希腊神话中的王后，杀死丈夫阿伽门农，是希腊悲剧的重要人物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, the queen of Mycenae (wife of King Agamemnon) who murders him after he returns from the Trojan War; she is a central figure in Greek tragedy, especially Aeschylus’s trilogy *The Oresteia*.","zh":"（希腊神话/悲剧）克吕泰涅斯特拉：迈锡尼王后，阿伽门农之妻；阿伽门农从特洛伊战争归来后被她杀害。她是希腊悲剧（尤其埃斯库罗斯《俄瑞斯忒亚》三部曲）中的重要人物。"},"examples":[{"en":"Clytemnestra is often portrayed as both a grieving mother and a ruthless political actor.","zh":"克吕泰涅斯特拉常被塑造成既是悲痛的母亲，也是冷酷的政治行动者。"},{"en":"In *Agamemnon*, Clytemnestra welcomes her husband home—and then kills him.","zh":"在《阿伽门农》中，克吕泰涅斯特拉迎接丈夫归来——随后将他杀死。"},{"en":"Many modern retellings reinterpret Clytemnestra as a symbol of resistance against injustice.","zh":"许多现代改写把克吕泰涅斯特拉重新诠释为反抗不公的象征。"}]}],"synonyms":["(no true synonym; a proper name)"],"phonetic":"/ˌklaɪtəmˈnɛstrə/","extraExplanation":["名字常译作“克吕泰涅斯特拉/克吕泰涅斯特拉（Clytemnestra）”。她杀夫的动机在不同作品中有差异：常见说法之一与阿伽门农为出征而献祭女儿伊菲革涅亚（Iphigenia）有关，因此她既被视为“弑君者”，也常被讨论为“复仇的母亲”。","她的故事与“家族复仇循环”紧密相连：她杀阿伽门农后，儿子俄瑞斯忒斯（Orestes）在神谕与道德冲突中又杀母复仇，引出古希腊悲剧对正义、法律与私人复仇界限的思考。"]}
{"word":"clytemnestra","summary":{"en":"Clytemnestra is a queen in Greek mythology, best known for killing her husband Agamemnon and becoming a major figure in Greek tragedy.","zh":"克吕泰涅斯特拉是希腊神话中的王后，以杀死丈夫阿伽门农而闻名，也是希腊悲剧中的重要人物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) The wife of Agamemnon and queen of Mycenae, famous for killing Agamemnon after the Trojan War (often with her lover Aegisthus) and being killed in turn by her son Orestes.","zh":"（希腊神话）阿伽门农的妻子、迈锡尼的王后；因在特洛伊战争后（常与情人埃癸斯托斯一起）杀死阿伽门农而著名，后来又被儿子俄瑞斯忒斯杀死。"},"examples":[{"en":"In Greek tragedy, Clytemnestra is often shown as intelligent and fiercely determined.","zh":"在希腊悲剧中，克吕泰涅斯特拉常被塑造成聪明且意志极其坚定的人物。"},{"en":"Aeschylus’s play *Agamemnon* opens with the long shadow of Clytemnestra’s revenge.","zh":"埃斯库罗斯的戏剧《阿伽门农》以克吕泰涅斯特拉复仇的阴影开场。"},{"en":"The name Clytemnestra is sometimes used to suggest a dangerous or vengeful wife in literature.","zh":"在文学中，“克吕泰涅斯特拉”有时用来暗示“危险或复仇心强的妻子”的形象。"}]}],"synonyms":["Klytemnestra"],"phonetic":"/ˌklaɪtəmˈnɛstrə/","extraExplanation":["她的故事常被用来讨论“正义与复仇”的边界：阿伽门农据说为了出征特洛伊而献祭女儿伊菲革涅亚（不同版本细节不同），这常被视为她复仇的动机之一。","文学与戏剧中最重要的出处之一是古希腊三大悲剧诗人之一埃斯库罗斯的《俄瑞斯忒亚》（三部曲），其中《阿伽门农》刻画了她与权力、婚姻、暴力之间的复杂关系。","发音上常见拼写为 Clytemnestra（也可见 Klytemnestra 的学术拼写），来源于古希腊语名字的拉丁化转写，因此英语读音不按常见字母规则直读。"]}
{"word":"Clytia","summary":{"en":"Clytia is best known as a mythological nymph who loved Helios and was later associated with a sun-following flower; it’s also a rare female name.","zh":"Clytia 最常指神话中爱慕太阳神赫利俄斯的女仙，后与“追随太阳的花”意象相连；也可作少见的女子名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, a sea nymph (Oceanid) who loved the sun god Helios; in later stories she wasted away and was transformed into a flower that turns toward the sun (often linked in English to the “heliotrope” or sometimes the sunflower).","zh":"（希腊神话）海洋女仙（俄刻阿尼得之一）克吕提娅，爱上太阳神赫利俄斯；后世传说中她因痴恋而憔悴，最终化为一种会朝向太阳转动的花（英语里常与“heliotrope/向日葵类意象”相联系）。"},"examples":[{"en":"In Ovid’s retelling, Clytia watches Helios cross the sky and slowly fades away.","zh":"在奥维德的改写里，克吕提娅凝望赫利俄斯穿越天空，自己却逐渐憔悴消逝。"},{"en":"The poem compares her devotion to Clytia, always turning toward the light.","zh":"诗歌把她的痴情比作克吕提娅——总是朝向光。"}]},{"partOfSpeech":"n.","definition":{"en":"A female given name, used occasionally in English (often inspired by the myth).","zh":"女子名（英语中偶尔使用，常受神话人物影响）。"},"examples":[{"en":"Clytia is an unusual name with a strong mythological feel.","zh":"Clytia 是个少见但很有神话气息的名字。"}]}],"synonyms":["Clytie","Heliotrope (as the associated flower image)","Helios (related figure)"],"phonetic":"ˈklɪtiə","extraExplanation":["“Clytia/克吕提娅”的故事最常见于罗马诗人奥维德（Ovid）的《变形记》（Metamorphoses）传统：她因爱慕赫利俄斯而长久凝视太阳，最终与“向光而转”的花的意象绑定，所以在英语文学里常用来象征执着的爱、单恋或对光明的追随。","拼写提示：Clytia 有时也会见到拼作 Clytie（读音相近），多出现在文学或古典题材中。"]}
{"word":"Clytie","summary":{"en":"Clytie is a figure from Greek mythology associated with turning toward the sun; the name is also used (rarely) for girls.","zh":"Clytie 指希腊神话人物（常被描写为化作追随太阳的花）；也可作较少见的女性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) A water nymph who loved the sun god (often Apollo/Helios in later retellings) and was transformed into a flower that keeps turning toward the sun (often linked with the heliotrope or sunflower in English literature).","zh":"（希腊神话）克吕提厄：一位水泽宁芙，爱上太阳神（后世常与阿波罗/赫利俄斯联系），据传因痴恋而化为会追随太阳转动的花（英语文学中常与“向日葵/香水草 heliotrope”相联系）。"},"examples":[{"en":"In the myth, Clytie watches the sun move across the sky until she becomes a flower.","zh":"在神话里，克吕提厄凝望太阳横越天空，直到自己化作一朵花。"},{"en":"The poet compares her longing to Clytie turning toward the light.","zh":"诗人把她的思念比作克吕提厄追随光的转向。"}]},{"partOfSpeech":"n.","definition":{"en":"A female given name, used rarely, taken from the mythological figure.","zh":"（较少见）女性名字，来源于同名神话人物。"},"examples":[{"en":"Her middle name is Clytie, after a character from Greek myth.","zh":"她的中间名叫 Clytie，取自希腊神话人物。"}]}],"synonyms":["Clytia"],"phonetic":"/ˈklaɪti/","extraExplanation":["常见读法重音在第一音节：CLY-tie。","Clytie 的故事最常见于奥维德《变形记》（Metamorphoses）的传统影响之下；英语诗歌里常用她象征“痴恋、执着的凝望、对光与希望的追随”。","有时会见到拼写变体 Clytia。不同版本里她所爱的太阳神会被称为 Helios（赫利俄斯）或与 Apollo（阿波罗）混用；文学作品常不严格区分。"]}
{"word":"Clytius","summary":{"en":"Clytius is a mythological proper name, most commonly a Giant in Greek mythology; the same name can also refer to other minor figures depending on the source.","zh":"Clytius 是神话中的专有名词，最常见指希腊神话中的巨人族成员；在不同文献中也可能指其他同名小人物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) A Giant (one of the Gigantes) who fought against the Olympian gods in the Gigantomachy; in some sources he is killed by the goddess Hecate.","zh":"（希腊神话）巨人族（Gigantes）之一，在“巨人之战”（Gigantomachy）中与奥林匹斯诸神作战；一些版本中说他被女神赫卡忒（Hecate）所杀。"},"examples":[{"en":"In one version of the myth, Hecate defeats Clytius during the Gigantomachy.","zh":"在某个神话版本里，赫卡忒在巨人之战中击败了克吕提俄斯。"},{"en":"The name Clytius appears in lists of Giants in ancient myth retellings.","zh":"在一些古代神话复述中，“克吕提俄斯”会出现在巨人名单里。"}]},{"partOfSpeech":"n.","definition":{"en":"A proper name used for several different minor characters in Greek and Roman mythology (the exact identity depends on the source).","zh":"（专有名）希腊与罗马神话中多个小角色共用的名字（具体指谁取决于文本来源）。"},"examples":[{"en":"When you see ‘Clytius’ in a classical text, check the context to know which character it refers to.","zh":"在古典文本中看到“Clytius”，要根据上下文判断具体是哪位人物。"},{"en":"Different writers may use the name Clytius for different mythological figures.","zh":"不同作家可能用“Clytius”来指代不同的神话人物。"}]}],"phonetic":"ˈklɪtiəs","extraExplanation":["“Clytius”常见于英文古典学/神话学写作中，是拉丁化（Romanized/Latinized）的拼写；希腊文常写作 Klytius（Κλύτιος），中文译名也可能见到“克吕提俄斯/克利提俄斯”等不同译法。","在文学与神话资料中，同名人物很多（这是古希腊神话的常见现象），所以阅读时最好同时看作者、作品（如阿波罗多洛斯等汇编）、以及事件（例如是否在巨人之战场景中）来确定指代。"]}
{"word":"Clyve","summary":{"en":"“Clyve” is usually a rare spelling of the name “Clive,” and can also be an archaic verb meaning “to climb.”","zh":"“Clyve”通常是姓名“Clive”的少见拼写；也可作古语动词，表示“攀爬”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A less common spelling of the name “Clive,” used as a given name or surname.","zh":"“Clive”的一种不常见拼写，可作名字或姓氏。"},"examples":[{"en":"Clyve is a rare spelling; most people write it as Clive.","zh":"Clyve 是比较少见的拼写；大多数人会写作 Clive。"},{"en":"His last name is Clyve, so people often ask how to pronounce it.","zh":"他姓 Clyve，所以别人常会问怎么读。"}]},{"partOfSpeech":"v.","definition":{"en":"(Archaic/Scottish) To climb; sometimes used in older writing with the sense of “clamber up.”","zh":"（古语/苏格兰用法）攀爬；在较早的文字中可表示“费力地爬上去”。"},"examples":[{"en":"The child clyved up the rocky bank.","zh":"那个孩子爬上了多石的河岸。"},{"en":"In old stories, travelers clyve the steep hill to reach the castle.","zh":"在古老故事里，旅人会爬上陡坡去到城堡。"}]}],"synonyms":["Clive","climb","clamber"],"phonetic":"/klaɪv/","extraExplanation":["作为姓名（Clive/Clyve），来源常被认为与古英语里的“clif”（悬崖、峭壁）有关，因此带有“靠近悬崖/住在峭壁附近的人”的地名或姓氏色彩。","在现代英语里你几乎不会在日常写作中看到动词 clyve；更常用的是 climb（攀爬）或 clamber（费力攀爬）。如果你是在文学、方言或历史文本中遇到 clyve，它通常就是这种“攀爬”的意思。"]}
{"word":"Clywd","summary":{"en":"Clwyd is a Welsh place name: mainly a historic county in northeast Wales, and also the name of a local river.","zh":"Clwyd 是威尔士地名：主要指威尔士东北部的旧郡名，也可指当地的克卢伊德河。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historic county in northeastern Wales (UK), used especially in older place references and addresses","zh":"（英国）威尔士东北部的旧郡名“克卢伊德”（多见于较早的地名、地址或历史语境）"},"examples":[{"en":"My grandparents’ address used to end with “Clwyd, Wales.”","zh":"我祖父母以前的地址末尾常写“Clwyd, Wales（威尔士克卢伊德郡）”。"},{"en":"Some older maps label the region as Clwyd.","zh":"一些旧地图会把这片地区标注为Clwyd。"}]},{"partOfSpeech":"n.","definition":{"en":"the River Clwyd, a river in northeastern Wales","zh":"克卢伊德河：威尔士东北部的一条河流"},"examples":[{"en":"They walked along the River Clwyd in the afternoon.","zh":"他们下午沿着克卢伊德河散步。"}]}],"phonetic":"/klʊid/","extraExplanation":["你输入的“Clywd”更常见的拼写是“Clwyd”。它来自威尔士语地名。","Clwyd 作为“郡”在地方政府改革后（1996年）不再是主要行政区名称，但在历史资料、旧地址、地图或机构名称中仍可能看到。","读音对英语学习者来说容易混淆：它通常听起来有点像“fluid”去掉 f 的开头音（接近“cloo-id/kluh-id”的感觉）。"]}

