{"word":"CM","summary":{"en":"CM most commonly refers to “cm,” the abbreviation for centimeter(s); it can also mean other things depending on context (e.g., job titles).","zh":"CM 最常见是指“cm（厘米）”的缩写；在不同语境中也可能代表其他含义（如某些职务简称）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"abbreviation for “centimeter(s),” a metric unit of length equal to 1/100 of a meter","zh":"“centimeter(s)”（厘米）的缩写；公制长度单位，1 厘米 = 1/100 米"},"examples":[{"en":"The scar is about 3 cm long.","zh":"这道疤大约有 3 厘米长。"},{"en":"Cut the paper into strips that are 2 cm wide.","zh":"把纸剪成宽 2 厘米的纸条。"}]},{"partOfSpeech":"other","definition":{"en":"a written abbreviation used for certain job titles (e.g., “CM” = Chief Minister in some countries) or other field-specific terms, depending on context","zh":"在特定语境中表示某些职务或专业术语的缩写（例如在一些国家/地区，“CM”可指 Chief Minister“首席部长”），具体含义取决于上下文"},"examples":[{"en":"The CM announced a new education policy.","zh":"首席部长（CM）宣布了一项新的教育政策。"}]}],"synonyms":["cm","centimeter"],"phonetic":"siː ɛm","extraExplanation":["在日常英文里，表示“厘米”时常写作“cm”（小写）而不是“CM”。科学/工程写作通常遵循国际单位制（SI）写法：数字与单位之间留空格，例如 “10 cm”。","如果你是在某个特定领域（如公司职位、医学、网络、游戏等）看到“CM”，需要结合上下文判断；你也可以把原句发我，我能帮你确定最可能的意思。"]}
{"word":"cm","summary":{"en":"“cm” most commonly means “centimeter,” a length unit (0.01 meter).","zh":"“cm”最常见表示“厘米”，长度单位（0.01 米）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"abbreviation for centimeter, a unit of length equal to one hundredth of a meter (0.01 m).","zh":"“centimeter（厘米）”的缩写；长度单位，等于一米的百分之一（0.01 米）。"},"examples":[{"en":"The table is 120 cm long.","zh":"这张桌子长 120 厘米。"},{"en":"Please write your height in cm.","zh":"请用厘米写下你的身高。"},{"en":"Add 2 cm to the hem.","zh":"把下摆加长 2 厘米。"}]},{"partOfSpeech":"other","definition":{"en":"abbreviation for “CM,” used in some contexts to mean “configuration management” (managing versions and changes in software) or other titles (varies by field).","zh":"“CM”的缩写用法之一；在某些领域可指“配置管理”（软件版本与变更管理）或其他头衔/名称（因领域而异）。"},"examples":[{"en":"The team improved CM to track changes more reliably.","zh":"团队改进了配置管理，以更可靠地跟踪变更。"}]}],"synonyms":["centimeter","centimetre"],"phonetic":"/ˌsiːˈɛm/","extraExplanation":["在日常英语里，小写“cm”几乎最常见的意思就是“厘米”。写作时通常不加复数：例如“10 cm”（而不是“10 cms”）。","厘米属于国际单位制（SI）里的长度单位体系：1 m = 100 cm；也常用换算：1 inch ≈ 2.54 cm。"]}
{"word":"CM-glass","summary":{"en":"“CM-glass” usually means a specific glass grade/code labeled “CM,” with meaning depending on context.","zh":"“CM-glass”通常指代用“CM”标识的某种玻璃牌号/代码，具体含义要看使用场景。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A technical label for a type or grade of glass identified by the code “CM” (used in some catalogs, labs, or industries). The exact composition and properties depend on the specific field or manufacturer.","zh":"一种技术性名称，用“CM”这个代码来标识的玻璃类型或等级（常见于产品目录、实验室或行业用语）。其具体成分与性能取决于所处领域或厂家标准。"},"examples":[{"en":"The spec sheet says the window is made from CM-glass, so we need the supplier’s data to confirm its optical properties.","zh":"规格表写着窗口材料是CM-glass，所以我们需要供应商的数据来确认它的光学性能。"},{"en":"In this lab, “CM-glass” refers to a particular batch code rather than a general kind of glass.","zh":"在这个实验室里，“CM-glass”指的是某个批次代码，而不是一种通用的玻璃类别。"}]}],"synonyms":["CM glass","C-M glass","glass grade CM"],"phonetic":"ˌsiːˈɛm ɡlæs","extraExplanation":["“CM-glass”不是英语里普遍通用的标准词汇，更像是行业/项目内部的代号或产品命名（例如光学玻璃牌号、材料清单中的缩写、或厂家型号）。如果你告诉我它出现的领域（比如光学、建筑、化工、显示器、实验材料等）或给出一句原文，我可以把含义解释得更精确，并补充更贴近该领域的同义说法与常见搭配。"]}
{"word":"CMA","summary":{"en":"CMA is an abbreviation with several common meanings (finance certification, medical job title, real-estate report, or country-music organization), depending on context.","zh":"CMA是一个多义缩写，常见含义包括财会认证、医疗岗位、房产分析报告或乡村音乐机构，需结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) Certified Management Accountant: a professional certification in management accounting and corporate finance.","zh":"（缩写）CMA：注册管理会计师；一种侧重管理会计与公司财务的专业资格认证。"},"examples":[{"en":"She is studying for the CMA to move into financial planning.","zh":"她在准备考CMA，以便转到财务规划岗位。"},{"en":"Many employers value a CMA for budgeting and cost control roles.","zh":"很多雇主在预算与成本控制岗位上很看重CMA资格。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) Certified Medical Assistant: a healthcare worker who supports doctors and nurses with basic clinical and administrative tasks.","zh":"（缩写）CMA：认证医疗助理；在医疗机构中协助医生和护士处理基础临床与行政工作的人员。"},"examples":[{"en":"The CMA took my blood pressure and updated my records.","zh":"医疗助理（CMA）给我量了血压，并更新了病历信息。"},{"en":"In some clinics, a CMA also schedules appointments.","zh":"在一些诊所里，CMA还会负责预约安排。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) Comparative Market Analysis: an estimate of a home’s value based on recent sales of similar properties, often used in real estate.","zh":"（缩写）CMA：比较市场分析；房地产中根据近期相似房源成交价来估算房屋价值的分析。"},"examples":[{"en":"Before listing the house, the agent prepared a CMA.","zh":"在挂牌出售前，经纪人做了一份CMA（比较市场分析）。"},{"en":"The CMA suggested a slightly lower asking price.","zh":"这份CMA建议把要价稍微定低一些。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) Country Music Association: an organization that promotes country music, known for the CMA Awards.","zh":"（缩写）CMA：乡村音乐协会；推广乡村音乐的机构，以“CMA颁奖礼”闻名。"},"examples":[{"en":"They watched the CMA Awards on TV last night.","zh":"他们昨晚在电视上看了CMA颁奖礼。"},{"en":"The singer was nominated by the CMA.","zh":"这位歌手获得了CMA的提名。"}]}],"synonyms":["(as an abbreviation) initialism"],"phonetic":"/ˌsiː ɛm ˈeɪ/","extraExplanation":["“CMA”是常见缩写，具体含义高度依赖语境：\n- 职场/财会（finance/accounting）里通常指 Certified Management Accountant。\n- 医疗/诊所语境常指 Certified Medical Assistant。\n- 房产交易语境常指 Comparative Market Analysis。\n- 音乐娱乐语境可能指 Country Music Association。","发音多按字母逐个读（C-M-A）。写作中首次出现时，正式文本通常会先写全称，再在括号里标注CMA。"]}
{"word":"CMAC","summary":{"en":"CMAC most commonly means Cipher-based Message Authentication Code in cryptography; it can also be a context-dependent abbreviation for other names or organizations.","zh":"CMAC 最常见指密码学中的“基于分组密码的消息认证码”；也可能是依上下文而定的其他缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(cryptography) Cipher-based Message Authentication Code: a method for creating a short “tag” from a message and a secret key to verify the message hasn’t been changed and comes from someone who knows the key.","zh":"（密码学）CMAC：基于分组密码的消息认证码；用“消息+密钥”生成一段短的认证标签，用来验证消息未被篡改且来自持有密钥的一方。"},"examples":[{"en":"The device uses AES-CMAC to authenticate firmware updates.","zh":"该设备使用 AES-CMAC 来验证固件更新的真实性。"},{"en":"If the CMAC tag doesn’t match, the receiver rejects the message.","zh":"如果 CMAC 标签不匹配，接收方会拒绝该消息。"}]},{"partOfSpeech":"other","definition":{"en":"(general) An abbreviation that can also refer to different organizations, technical terms, or names depending on the field (e.g., a company, a school, a sports nickname).","zh":"（泛指）缩写：在不同领域可能代表不同机构、技术名词或名称（例如公司、学校或体育昵称等），具体含义需看上下文。"},"examples":[{"en":"What does CMAC stand for in this document?","zh":"在这份文件里，CMAC 代表什么？"},{"en":"CMAC can mean different things in IT and in business.","zh":"CMAC 在 IT 和商业领域里可能有不同含义。"}]}],"synonyms":["MAC","message authentication code","AES-CMAC"],"phonetic":"ˈsiːmæk","extraExplanation":["在英文技术语境中，CMAC 最常见的是密码学里的“Cipher-based Message Authentication Code”，并且经常写成 “AES-CMAC”。它用于“完整性与鉴别”（确认内容没被改、确认发送方），但不提供加密保密性。","如果你能提供上下文（例如出现在网络设备、论文、合同、球队讨论等），我可以把 CMAC 的具体展开与含义精确到该领域。"]}
{"word":"CMC","summary":{"en":"CMC most commonly means computer-mediated communication (online/digital communication), but it can also mean carboxymethylcellulose (a thickener) or Command Master Chief (a military title).","zh":"CMC 最常见指“计算机媒介交流”（网络/数字沟通），也可能指“羧甲基纤维素”（增稠剂）或“司令军士长”（军衔/职位）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Communication) Computer-mediated communication: communication that happens through digital devices and networks (e.g., email, texting, social media, online forums).","zh":"（传播/语言学）计算机媒介交流：通过数字设备与网络进行的沟通（如电子邮件、短信、社交媒体、网络论坛）。"},"examples":[{"en":"CMC has changed how people write, with more abbreviations and emojis in casual messages.","zh":"CMC 改变了人们的写作方式，随意消息里出现更多缩写和表情符号。"},{"en":"Researchers study CMC to understand how language works online.","zh":"研究者研究 CMC 来了解语言在网络环境中的使用方式。"}]},{"partOfSpeech":"n.","definition":{"en":"(Chemistry/Food/Pharmacy) Carboxymethylcellulose: a common thickener or stabilizer used in foods, toothpaste, eye drops, and medicines.","zh":"（化学/食品/制药）羧甲基纤维素：常见的增稠剂或稳定剂，用于食品、牙膏、滴眼液和药品等。"},"examples":[{"en":"This ice cream uses CMC to improve texture and reduce ice crystals.","zh":"这种冰淇淋使用 CMC 来改善口感并减少冰晶。"},{"en":"The label lists CMC as an ingredient in the gel.","zh":"标签上把 CMC 列为这种凝胶的成分之一。"}]},{"partOfSpeech":"n.","definition":{"en":"(Military, especially U.S. Navy) Command Master Chief: a senior enlisted advisor at a command.","zh":"（军事，尤指美国海军）司令军士长：在一个单位/司令部担任高级士兵顾问的军士长。"},"examples":[{"en":"The CMC briefed sailors on the new training requirements.","zh":"CMC 向水兵说明了新的训练要求。"}]}],"synonyms":["computer-mediated communication","online communication","digital communication"],"phonetic":"/ˌsiːˌɛmˈsiː/","extraExplanation":["在语言学与传播学里，CMC 是最常见的意思，常用来讨论“网络语言”（如缩写、语气词、表情符号、打字风格）以及线上互动礼仪。","在配料表中看到 CMC 往往指“羧甲基纤维素”，属于用途很广的增稠/稳定成分；具体安全性与用量需以当地法规与产品标准为准。","CMC 也可能是机构/职位/课程名缩写；判断时可看上下文（是否在谈网络沟通、配方成分、或军事单位）。"]}
{"word":"CMCC","summary":{"en":"CMCC most commonly means China Mobile Communications Corporation; always check the context because acronyms can vary.","zh":"CMCC 最常指中国移动通信集团公司；但缩写可能有多种含义，需结合上下文确认。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"China Mobile Communications Corporation, a major Chinese telecommunications company (often shortened to “China Mobile”).","zh":"中国移动通信集团公司（常简称为“中国移动”），一家大型中国电信运营商。"},"examples":[{"en":"CMCC is one of the world’s largest mobile network operators.","zh":"CMCC 是全球最大的移动通信运营商之一。"},{"en":"Our SIM cards are supported by CMCC in many regions of China.","zh":"在中国的许多地区，我们的 SIM 卡都支持 CMCC 网络。"}]},{"partOfSpeech":"n.","definition":{"en":"An abbreviation that can also mean other organizations depending on context; you should confirm the full name in the document you’re reading.","zh":"一种缩写，也可能在不同语境中代表其他机构；阅读时应根据文件上下文确认其全称。"},"examples":[{"en":"In this report, CMCC refers to China Mobile Communications Corporation.","zh":"在这份报告中，CMCC 指中国移动通信集团公司。"},{"en":"CMCC can have different meanings in different industries.","zh":"在不同领域里，CMCC 可能有不同含义。"}]}],"synonyms":["China Mobile"],"phonetic":"/siː ˌɛm siː ˈsiː/","extraExplanation":["在英语里，像 CMCC 这类全大写缩写通常按字母逐个读（C-M-C-C）。正式写作中第一次出现常会写全称并在括号里给出缩写：China Mobile Communications Corporation (CMCC)。在新闻或商业语境中，有时也会直接用 “China Mobile” 来指代该公司。"]}
{"word":"CMD","summary":{"en":"CMD usually means the Windows Command Prompt/command line, where you type commands to control the computer.","zh":"CMD 通常指 Windows 的命令提示符/命令行，用来输入命令控制电脑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(computing) Abbreviation for “Command Prompt” or “command line” on Windows; a text-based interface where you type commands to run programs and manage files.","zh":"（计算机）“Command Prompt（命令提示符）/命令行”的缩写；在 Windows 上通过输入命令来运行程序、管理文件的文字界面。"},"examples":[{"en":"Open CMD and type ipconfig to check your network settings.","zh":"打开 CMD，输入 ipconfig 来查看网络设置。"},{"en":"I ran the installer from CMD because the GUI kept freezing.","zh":"因为图形界面一直卡住，我就从 CMD 里运行了安装程序。"}]},{"partOfSpeech":"n.","definition":{"en":"(business/instructions) Short for “command”; an instruction given to a computer or a device.","zh":"（商务/说明书）“command（命令）”的简写；给电脑或设备下达的一条指令。"},"examples":[{"en":"This tool supports basic CMD like copy and delete.","zh":"这个工具支持 copy、delete 等基础 CMD（命令）。"},{"en":"Enter the CMD exactly as shown in the manual.","zh":"请严格按照说明书输入该 CMD（命令）。"}]}],"synonyms":["Command Prompt","command line","terminal","cmd.exe"],"phonetic":"ˌsiːˌɛmˈdiː","extraExplanation":["在日常英语里，人们说“open CMD / in CMD / from CMD”通常指 Windows 的“命令提示符”（程序名常显示为“Command Prompt”或“cmd.exe”）。","注意：CMD 更常用于 Windows；在 macOS/Linux 上更常说“Terminal”。在 Windows 里，较新的替代工具还有 PowerShell 和 Windows Terminal。","写法上常见：CMD（大写）强调工具/界面；cmd（小写）常指可执行文件 cmd.exe，或在路径/命令中使用。"]}
{"word":"cmd","summary":{"en":"“cmd” usually means the Windows Command Prompt or a shorthand for “command(s).”","zh":"“cmd”通常指 Windows 的命令提示符，或作为“command（命令）”的缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(computing) The Windows Command Prompt program (the command-line interface where you type commands).","zh":"（计算机）Windows 的“命令提示符”（命令行界面，用来输入命令的程序）。"},"examples":[{"en":"Open cmd and type ipconfig to check your network settings.","zh":"打开 cmd，输入 ipconfig 来查看网络设置。"},{"en":"I ran the installer from cmd as an administrator.","zh":"我以管理员身份在 cmd 里运行了安装程序。"}]},{"partOfSpeech":"other","definition":{"en":"(computing) Short for command; used in file names, menus, or labels to mean “command/commands.”","zh":"（计算机）command 的缩写；常见于文件名、菜单或标签里，表示“命令”。"},"examples":[{"en":"This folder contains useful cmd scripts.","zh":"这个文件夹里有一些有用的 cmd 脚本。"},{"en":"The app has a cmd option for advanced users.","zh":"这个应用有一个给高级用户用的 cmd 选项。"}]}],"synonyms":["Command Prompt","terminal","shell","command line"],"phonetic":"/ˌsiːˌɛmˈdiː/","extraExplanation":["在 Windows 里，人们常把“命令提示符”叫做 cmd（来自可执行文件名 cmd.exe）。它最早与 MS-DOS 的命令行传统有关；如今很多任务也可以在 PowerShell 或 Windows Terminal 中完成，但“打开 cmd”仍是很常见的说法。","注意：在不同领域 cmd 也可能代表别的意思（如“commander/command”等），具体要看上下文；在日常技术交流中最常见的就是 Windows 的命令提示符。"]}
{"word":"CMDF","summary":{"en":"CMDF is an initialism whose meaning depends on context; ask what it stands for in the specific document or field.","zh":"CMDF 是一个缩略词，具体含义取决于语境；需要结合所在文件或领域来确认它的全称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An initialism (letter-based abbreviation) that can stand for different phrases depending on the field; it is most often used in technical, organizational, or government contexts.","zh":"一个首字母缩略词（按字母读的缩写），在不同领域可代表不同含义；常见于技术、组织或政府等语境。"},"examples":[{"en":"I saw “CMDF” in the report, but the meaning wasn’t explained.","zh":"我在报告里看到“CMDF”，但没有解释它是什么意思。"},{"en":"Can you tell me what CMDF stands for in this document?","zh":"你能告诉我在这份文件里 CMDF 代表什么吗？"}]}],"synonyms":["initialism","abbreviation","acronym"],"phonetic":"/ˌsiː ˌɛm ˌdiː ˈɛf/","extraExplanation":["“CMDF”不是一个在日常英语里固定、人人都懂的单词，更像是某个机构/系统/项目名称的缩写。没有上下文时，很难唯一确定它的全称。","常见用法上，它可能出现在：公司或政府文件（部门/基金/项目名）、IT/工程系统（模块/格式/功能名）、或特定行业（金融、医疗、军事等）的内部缩写。","如果你把它出现的句子、行业领域（例如：计算机、金融、医疗）或它前后文贴出来，我可以帮你更准确地还原它的全称与含义。"]}
{"word":"cmdg","summary":{"en":"“cmdg” is not a common English word; it’s usually an abbreviation whose meaning depends on where you saw it.","zh":"“cmdg”不是常见英语单词，通常是缩写，含义取决于出现的语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation/initialism that is not a standard English word. Its meaning depends on context (it may be a username, code, project name, or initials).","zh":"一个缩写/首字母词，不是常见的英语单词；具体含义取决于语境（可能是用户名、代码、项目名或人名缩写）。"},"examples":[{"en":"I saw “cmdg” in the file name, but there was no explanation of what it stands for.","zh":"我在文件名里看到了“cmdg”，但没有说明它代表什么。"},{"en":"Can you tell me what “cmdg” means in this chat?","zh":"你能告诉我“cmdg”在这段聊天里是什么意思吗？"}]}],"phonetic":"/ˌsiː ɛm ˌdiː ˈdʒiː/","extraExplanation":["“cmdg”更像是字母缩写而非词汇本身。不同领域可能会用相同的字母组合表示不同含义（例如内部项目代号、机构部门简称、游戏公会名、命令/按键缩写等）。如果你能提供它出现的场景（句子、软件界面、学科/行业、截图），我可以更准确地解释。"]}
{"word":"Cmdr","summary":{"en":"“Cmdr” is a written abbreviation for “Commander,” used for the military/naval rank or as a title for someone in command.","zh":"“Cmdr”是“Commander（指挥官/海军少校等）”的书面缩写，用于军衔或指挥职位头衔。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Commander,” a military or naval rank (especially in the U.S. Navy) or a title for someone who commands a unit.","zh":"“Commander（指挥官/海军少校）”的缩写，常用于军队或海军军衔/头衔，表示负责指挥某个单位的人。"},"examples":[{"en":"Cmdr Smith reported to the base early this morning.","zh":"史密斯指挥官今天一早到基地报到。"},{"en":"Please address the letter to Cmdr. Lee, Operations Division.","zh":"请将信件寄给李指挥官（作战部门）。"}]},{"partOfSpeech":"other","definition":{"en":"a shortened form used informally in writing (emails, forms, lists) to mean “commander,” including in fiction, games, or organizations that use military-style titles.","zh":"在邮件、表格、清单等书面场合的非正式缩写，用来表示“指挥官”；也常见于小说、游戏或采用军事风格头衔的组织。"},"examples":[{"en":"Cmdr, we’re ready to move.","zh":"指挥官，我们准备出发。"},{"en":"The meeting is led by Cmdr Jackson.","zh":"会议由杰克逊指挥官主持。"}]}],"synonyms":["Commander","Cdr"],"phonetic":"/kəˈmændər/","extraExplanation":["“Cmdr”常见于军队/海军书面材料、名牌、邮件签名等；有时也写作“Cdr”。正式通信里是否加点取决于风格指南：既可见“Cmdr”也可见“Cmdr.”。","在美国海军里，Commander 是一个具体军衔（介于 Lieutenant Commander 与 Captain 之间）；在非军语境里也可泛指“指挥者/负责人”。"]}
{"word":"cmdr","summary":{"en":"“cmdr” is a common abbreviation for “commander,” used as a rank or title for someone in command.","zh":"“cmdr”通常是“commander（指挥官）”的缩写，用作军衔或头衔，表示负责指挥的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abbreviation of “commander,” meaning a person in charge of a group (often in the military, navy, police, or a large organization).","zh":"“commander（指挥官/指挥员）”的缩写，指负责指挥某个团队的人（常见于军队、海军、警察或大型组织）。"},"examples":[{"en":"Cmdr. Lewis briefed the team before the mission.","zh":"刘易斯指挥官在任务前向团队做了简报。"},{"en":"Please report to the Cmdr. at 0900.","zh":"请在 0900 向指挥官报到。"}]},{"partOfSpeech":"other","definition":{"en":"a title used before someone’s name in formal writing, similar to “Capt.” or “Lt.”","zh":"用于正式书写中、放在人名前的头衔缩写，类似 “Capt.”（上尉/船长）或 “Lt.”（中尉）。"},"examples":[{"en":"Cmdr. Aoki will speak at the ceremony.","zh":"青木指挥官将在仪式上发言。"}]}],"synonyms":["commander","commanding officer","chief"],"phonetic":"/kəˈmæn.dɚ/","extraExplanation":["“Cmdr.”常见于海军/海岸警卫队等体系的军衔缩写（例如美国海军的 Commander），在不同国家或机构里对应的级别不完全一样。","在科幻或游戏语境中（如太空舰队、航海题材），Cmdr 也常作为“指挥官”的称呼，带有正式、职业化的感觉。"]}
{"word":"CMDS","summary":{"en":"CMDS most commonly means “commands,” especially in computing/technical contexts.","zh":"CMDS 最常见的意思是“commands（命令/指令）”，尤其在计算机/技术语境中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “commands” (instructions you type or choose to control a computer/program), often seen in technical notes or menus","zh":"“commands（命令/指令）”的缩写，常见于技术文档或菜单中，指用来控制电脑/程序的指令"},"examples":[{"en":"Run these CMDS in the terminal to install the package.","zh":"在终端里运行这些 CMDS 来安装这个软件包。"},{"en":"The guide lists common CMDS for checking system status.","zh":"这份指南列出了用于查看系统状态的常用 CMDS。"}]},{"partOfSpeech":"other","definition":{"en":"(less common) an abbreviation used in some fields (e.g., medical or organizational names); the exact meaning depends on the context","zh":"（较少见）在某些领域中作为缩写使用（如医学或机构名称）；具体含义取决于上下文"},"examples":[{"en":"In this report, CMDS refers to a specific program name.","zh":"在这份报告里，CMDS 指的是某个特定的项目名称。"}]}],"synonyms":["commands","instructions","cmds"],"phonetic":"/ˌsiːɛmˈdiːɛs/","extraExplanation":["在英语技术写作里，CMDS 通常是非正式缩写，多见于笔记、聊天或表格标题中；正式文档更常直接写出 commands。","如果你是在某篇文章/报告里看到 CMDS，最好看前后是否有“CMDS = ……”的定义句，因为不同领域可能代表完全不同的词组。"]}
{"word":"CMF","summary":{"en":"CMF most commonly means “Color, Material, Finish” in product design; in some contexts it can also refer to a cash-management facility or an internal abbreviation related to diplomatic missions.","zh":"CMF最常见指产品设计中的“颜色-材料-表面处理”。在某些语境下也可能指现金管理服务/安排，或与外交使团相关的内部缩写，用法取决于上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Design/Manufacturing) short for “Color, Material, Finish”: the planned combination of colors, materials, and surface finishes used to shape a product’s look and feel.","zh":"（设计/制造）“Color, Material, Finish”的缩写：指产品在颜色、材料与表面处理（质感/工艺）上的整体搭配方案，用来塑造外观与触感。"},"examples":[{"en":"The phone’s CMF was updated to a matte finish to reduce fingerprints.","zh":"这款手机的CMF改成了哑光表面处理，以减少指纹。"},{"en":"Our team is reviewing CMF options for the car interior.","zh":"我们团队正在评估汽车内饰的CMF方案。"},{"en":"Good CMF can make a budget product feel premium.","zh":"好的CMF能让一款平价产品显得更有质感。"}]},{"partOfSpeech":"other","definition":{"en":"(Business/Finance) Cash Management Facility: a service or arrangement that helps a company manage cash flow, payments, and short-term liquidity.","zh":"（商业/金融）现金管理服务/安排（Cash Management Facility）：帮助企业管理现金流、支付结算与短期流动性的服务或机制。"},"examples":[{"en":"The company set up a CMF with the bank to handle daily payments.","zh":"公司与银行建立了CMF来处理日常付款。"},{"en":"Using a CMF can reduce idle cash and improve liquidity.","zh":"使用CMF可以减少闲置资金并改善流动性。"}]},{"partOfSpeech":"other","definition":{"en":"(Diplomacy) Chief of Mission (CM): sometimes written as CMF in internal contexts; the head of a diplomatic mission (often the ambassador).","zh":"（外交）使团团长（Chief of Mission，常写作CM；在某些内部语境可能见到CMF）：指外交使团负责人（通常为大使）。"},"examples":[{"en":"The CMF/CM met local officials to discuss cooperation.","zh":"使团团长与当地官员会面讨论合作。"},{"en":"All staff reported updates to the CMF/CM each morning.","zh":"所有人员每天早上向使团团长汇报最新情况。"}]}],"synonyms":["Color, Material, Finish"],"phonetic":"/ˌsiː ɛm ˈɛf/","extraExplanation":["“CMF”最常见的用法是在工业设计/用户体验领域，尤其在消费电子、汽车、家居产品中。它强调“看起来是什么颜色、摸起来是什么材料、表面是亮面/哑光/拉丝/喷砂”等综合体验，而不仅仅是“配色”。","金融和外交领域的“CMF”并非全球统一常用缩写，具体含义强依赖行业与上下文；遇到缩写时最好查看文件标题、部门或首次出现处的全称。"]}
{"word":"CMG","summary":{"en":"CMG is most commonly short for China Media Group, but it can also mean other organizations depending on context.","zh":"CMG最常指“中国中央广播电视总台（China Media Group）”，也可能在不同语境中代表其他机构或名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"China Media Group (a major Chinese state media organization that includes CCTV, China National Radio, and China Radio International).","zh":"中国中央广播电视总台（国家级媒体机构，整合了央视CCTV、中央人民广播电台与中国国际广播电台等）。"},"examples":[{"en":"CMG aired the opening ceremony live on multiple channels.","zh":"CMG通过多个频道直播了开幕式。"},{"en":"The documentary was co-produced by CMG and an international studio.","zh":"这部纪录片由CMG与一家国际影业机构联合制作。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation that can refer to different organizations or terms depending on context (used mainly in names).","zh":"缩写：在不同语境中可能指不同机构或术语（多用于名称中），具体含义需结合上下文判断。"},"examples":[{"en":"In this email, CMG refers to the company’s Corporate Marketing Group.","zh":"在这封邮件里，CMG指公司的“企业市场部”（Corporate Marketing Group）。"},{"en":"Please clarify what CMG stands for in your report.","zh":"请说明你报告中CMG的具体含义。"}]}],"synonyms":["China Media Group","CCTV (as part of CMG)"],"phonetic":"siː ɛm dʒiː","extraExplanation":["“CMG”最常见的用法之一是在中文新闻与国际传播语境中指 **China Media Group（中国中央广播电视总台）**。但在商业与学校/机构名称中也可能有其他含义（例如某公司的部门名、某集团名等），因此最好查看它出现的行业、国家、上下文句子或全称第一次出现的位置。"]}
{"word":"CMH","summary":{"en":"CMH most commonly means the airport code for John Glenn Columbus International Airport (Columbus, Ohio).","zh":"CMH最常见指美国俄亥俄州哥伦布的约翰·格伦哥伦布国际机场三字代码。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) The IATA airport code for John Glenn Columbus International Airport in Columbus, Ohio, USA.","zh":"（缩写）美国俄亥俄州哥伦布市“约翰·格伦哥伦布国际机场”的国际航空运输协会（IATA）机场代码。"},"examples":[{"en":"My flight lands at CMH at 7:30 p.m.","zh":"我的航班晚上7点30分降落在CMH。"},{"en":"Is there a direct flight from CMH to New York?","zh":"从CMH到纽约有直飞航班吗？"},{"en":"Please meet me at CMH baggage claim.","zh":"请到CMH的行李提取处接我。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., less common) Used in some fields as an abbreviation (its meaning depends on the context), for example in job titles, organizations, or technical notes.","zh":"（缩写，较不常见）在不同领域中可作不同含义的缩写（具体意思取决于语境），例如职位、机构名称或技术说明中的简写。"},"examples":[{"en":"In this email, CMH probably refers to an organization name—can you share the full sentence?","zh":"在这封邮件里，CMH可能指某个机构名称——你能把完整句子发我吗？"},{"en":"I saw CMH in the report, but the document didn’t define it.","zh":"我在报告里看到了CMH，但文件没有解释它的含义。"}]}],"synonyms":["(airport codes with similar use) IATA code","airport code"],"phonetic":"/ˌsiː ɛm ˈeɪtʃ/","extraExplanation":["CMH最常见的用法是“机场三字代码”。英语里谈航班、机票、行程单时，常用三字代码（如 LAX、JFK、ORD）来代表机场；CMH对应的是美国哥伦布（Columbus, Ohio）的机场。","如果你是在医疗、工程或某个公司/部门文件里看到CMH，它也可能是其他缩写。给我它出现的完整句子/领域（航空、医疗、学校、公司等），我可以更准确判断。"]}
{"word":"CMI","summary":{"en":"CMI is an abbreviation. Most commonly it means cell-mediated immunity in immunology, or computer-managed instruction in education/technology; other meanings exist depending on context.","zh":"CMI是缩写。最常见指免疫学中的“细胞介导免疫”，或教育/技术中的“计算机管理教学”；也可能在特定语境下有其他含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(immunology) Cell-mediated immunity: immune protection mainly carried out by T cells rather than antibodies.","zh":"（免疫学）细胞介导免疫：主要由T细胞等免疫细胞发挥作用、而不是主要依靠抗体的免疫防御。"},"examples":[{"en":"Vaccines can trigger both antibodies and CMI.","zh":"疫苗既能诱导抗体反应，也能诱导CMI（细胞介导免疫）。"},{"en":"People with weak CMI may be more vulnerable to certain viral infections.","zh":"细胞介导免疫较弱的人，可能更容易受到某些病毒感染。"}]},{"partOfSpeech":"other","definition":{"en":"(education/technology) Computer-managed instruction: a system that uses computers to track learning progress, deliver tests, and manage course records.","zh":"（教育/技术）计算机管理教学：用计算机系统追踪学习进度、发放测验并管理课程记录的一种教学管理方式。"},"examples":[{"en":"The school used CMI to record quiz scores automatically.","zh":"学校用CMI系统自动记录小测验成绩。"},{"en":"CMI reports helped teachers see which topics students struggled with.","zh":"CMI报告帮助老师了解学生在哪些主题上更吃力。"}]},{"partOfSpeech":"other","definition":{"en":"(business/HR) Continuous medical insurance (varies by country/company): ongoing health coverage provided by an employer or plan.","zh":"（商业/人事）持续医疗保险（因国家/公司而异）：由雇主或保险计划提供的持续性医疗保障。"},"examples":[{"en":"Check whether your contract includes CMI after your probation period.","zh":"确认你的合同在试用期后是否包含CMI（持续医疗保险）。"}]}],"synonyms":["cell-mediated immunity","computer-managed instruction"],"phonetic":"ˌsiː ˌɛm ˈaɪ","extraExplanation":["“CMI”是缩写，在不同领域含义差异很大。最常见的两类是免疫学里的 cell-mediated immunity，以及教育技术里的 computer-managed instruction。","判断含义时，重点看上下文：如果周围词是 vaccine/T cells/immune response，多半指免疫；如果是 course/quiz/learning system，多半指教学管理系统。","在正式写作中，首次出现通常会写全称（如 cell-mediated immunity, CMI），后文再用缩写，避免歧义。"]}
{"word":"CMIP","summary":{"en":"CMIP is usually an acronym for the Coupled Model Intercomparison Project in climate science; it can also mean the older Common Management Information Protocol in networking.","zh":"CMIP通常指气候科学中的“耦合模式比较计划”；在网络领域也可指较早期的“通用管理信息协议”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Coupled Model Intercomparison Project: an international climate-science program that coordinates standard experiments so researchers can compare and evaluate global climate models (often used in IPCC reports).","zh":"耦合模式比较计划：一个国际气候科学合作项目，通过统一的实验设计来比较与评估全球气候/地球系统模式（常用于IPCC评估报告）。"},"examples":[{"en":"Many papers use CMIP6 data to study future temperature and rainfall changes.","zh":"许多论文使用CMIP6数据来研究未来气温与降雨的变化。"},{"en":"The IPCC often cites results from CMIP model experiments.","zh":"IPCC经常引用CMIP模式试验的结果。"}]},{"partOfSpeech":"other","definition":{"en":"Common Management Information Protocol: a (historical) network-management protocol used for managing and monitoring computer networks, especially in OSI-based systems.","zh":"通用管理信息协议：一种（较早期的）网络管理协议，用于管理与监控计算机网络，常见于基于OSI体系的系统中。"},"examples":[{"en":"Older documentation compares CMIP with SNMP for network management.","zh":"较早的文档会把CMIP和SNMP用于网络管理的方式作比较。"},{"en":"CMIP is less common today than SNMP in many practical deployments.","zh":"在许多实际部署中，CMIP如今不如SNMP常见。"}]}],"synonyms":["Coupled Model Intercomparison Project","Common Management Information Protocol","CMIP6","CMIP5"],"phonetic":"/ˌsiː ˌɛm ˌaɪ ˈpiː/","extraExplanation":["在气候领域里，CMIP最常指“耦合模式比较计划”。你可能会看到CMIP5、CMIP6等版本号：数字表示不同阶段的数据集与标准试验设计。CMIP6是近年最常用的一批全球气候模式集合。","发音上通常按字母读：C-M-I-P。"]}
{"word":"CMIS","summary":{"en":"CMIS is an acronym most commonly meaning either an IT configuration information system (ITIL/ITSM) or a content-management interoperability standard.","zh":"CMIS 是缩写，最常见的意思是：IT 配置管理信息系统（ITIL/ITSM）或内容管理互操作标准。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Configuration Management Information System: a set of tools, databases, and processes used to store and manage information about IT assets and their relationships (often in IT service management/ITIL).","zh":"配置管理信息系统：用于存储并管理 IT 资产及其相互关系的信息的一套工具、数据库与流程（常见于 IT 服务管理/ITIL）。"},"examples":[{"en":"Our CMIS helps us track servers, software versions, and how changes affect related systems.","zh":"我们的 CMIS 帮助我们追踪服务器、软件版本，以及变更会如何影响相关系统。"},{"en":"Before the upgrade, the team checked the CMIS to confirm the current configuration items.","zh":"升级前，团队查看了 CMIS，以确认当前的配置项（CI）。"}]},{"partOfSpeech":"other","definition":{"en":"Content Management Interoperability Services: a technical standard (often shortened to CMIS) that lets different content management systems share and access documents in a consistent way.","zh":"内容管理互操作服务：一种技术标准（常简称为 CMIS），让不同的内容管理系统以一致的方式共享与访问文档。"},"examples":[{"en":"This app uses CMIS to connect to multiple document repositories with one interface.","zh":"这个应用使用 CMIS，通过同一个接口连接多个文档存储库。"},{"en":"If your platform supports CMIS, migrating documents between systems is usually easier.","zh":"如果你的平台支持 CMIS，在不同系统之间迁移文档通常会更容易。"}]}],"synonyms":["(ITIL) configuration database (CMDB) (related)","content management standard (general)"],"phonetic":"/ˌsiː ɛm ˈaɪ ɛs/","extraExplanation":["CMIS 是缩写，在不同领域含义不同；实际阅读时要看上下文。出现在 ITIL/ITSM、资产盘点、配置项（CI）、变更管理（Change Management）等语境里，通常指“配置管理信息系统”。出现在 ECM（企业内容管理）、文档库、Repository、API/标准等语境里，通常指“内容管理互操作服务（标准）”。","读缩写时英文里常按字母读（C-M-I-S）。正式写作中第一次出现时通常会先写全称，再在括号里写 CMIS。"]}
{"word":"CMISE","summary":{"en":"CMISE is usually an acronym; its meaning depends on context.","zh":"CMISE 通常是缩写，具体含义需要结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An acronym/initialism (not a standard dictionary word). Its exact meaning depends on the field or document where it appears.","zh":"一个缩写/首字母词（不是常见词典词条）。具体含义取决于它出现的领域或文本语境。"},"examples":[{"en":"CMISE is used as a project or department name in some documents; check the first page for the full form.","zh":"CMISE 在一些文件里会作为项目名或部门名出现；通常可在首页找到它的全称。"},{"en":"I saw “CMISE” in the email subject line, but the message didn’t explain what it stood for.","zh":"我在邮件主题里看到“CMISE”，但正文没有说明它代表什么。"}]}],"phonetic":"/ˌsiːɛmˌaɪˌɛsˈiː/","extraExplanation":["“CMISE”并不是一个通用、固定含义的英文单词，更像是某个机构/课程/项目自定义的缩写。不同学校、公司或行业可能会用它代表完全不同的全称。","为了帮你准确解释：请告诉我它出现的上下文（例如：一封邮件、课程名称、论文标题、公司部门、证书/报名页面等），或把包含它的那句话发来。","如果你本来想查的是法语/英语里的“mise”（如 mise-en-scène），也可以告诉我；那是另一个词源与含义。"]}
{"word":"CML","summary":{"en":"CML most commonly means chronic myeloid leukemia in medical English, but it can also be a field-specific abbreviation depending on context.","zh":"CML在医学英语中最常指慢性髓性白血病，但在其他领域也可能是不同缩写，需看语境确认。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(medicine) Chronic myeloid leukemia: a slow-growing cancer of the blood and bone marrow.","zh":"（医学）慢性髓性白血病：一种进展较慢的血液与骨髓癌症。"},"examples":[{"en":"My aunt was diagnosed with CML last year and started treatment soon after.","zh":"我阿姨去年被诊断为CML（慢性髓性白血病），之后很快开始治疗。"},{"en":"Some people with CML can live many years with modern targeted medicine.","zh":"在现代靶向药物帮助下，一些CML患者可以生活很多年。"}]},{"partOfSpeech":"other","definition":{"en":"A general abbreviation that can mean different things in different fields (for example, in some workplaces or technical contexts). You may need to ask for the full form.","zh":"一个在不同领域可能代表不同含义的缩写（例如在某些职场或技术语境中）。通常需要确认其全称。"},"examples":[{"en":"In this report, CML stands for a medical condition, not a software term.","zh":"在这份报告里，CML指的是一种疾病，而不是软件术语。"},{"en":"If you see “CML” in an email, ask what it stands for to avoid confusion.","zh":"如果你在邮件里看到“CML”，最好问清楚它的全称，以免误解。"}]}],"synonyms":["chronic myeloid leukemia","chronic myelogenous leukemia","CGL"],"phonetic":"/ˌsiː ɛm ˈɛl/","extraExplanation":["在英语里，医学语境中最常见的CML是“Chronic Myeloid Leukemia”。也有人说“Chronic Myelogenous Leukemia”，意思相同。","谈到疾病相关缩写时，沟通上要注意尊重与隐私；在非医学场合看到CML，最好结合上下文或直接询问全称以确认。"]}
{"word":"cml","summary":{"en":"CML is most commonly an abbreviation for chronic myeloid leukemia; it can also stand for other terms depending on context.","zh":"CML 最常见是“慢性髓性白血病”的缩写；也可能在不同语境中代表其他名词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abbreviation for chronic myeloid (myelogenous) leukemia, a type of blood cancer.","zh":"“慢性髓性白血病（慢性粒细胞白血病）”的缩写，一种血液癌症。"},"examples":[{"en":"CML is often treated with targeted drugs called TKIs.","zh":"CML 常用一种叫 TKI 的靶向药物治疗。"},{"en":"The doctor said the blood test results suggested CML.","zh":"医生说血液检查结果提示可能是 CML。"}]},{"partOfSpeech":"n.","definition":{"en":"an abbreviation used for various organizations or technical terms (meaning depends on context).","zh":"可指不同机构或技术名词的缩写（具体含义取决于语境）。"},"examples":[{"en":"In some documents, CML stands for Chemical Markup Language.","zh":"在一些资料里，CML 代表 Chemical Markup Language（化学标记语言）。"},{"en":"Please tell me the context—CML can mean different things.","zh":"请告诉我上下文——CML 可能有不同含义。"}]}],"synonyms":["chronic myeloid leukemia","chronic myelogenous leukemia"],"phonetic":"/ˌsiː ˌɛm ˈɛl/","extraExplanation":["“CML”最常见的含义是医学上的慢性髓性白血病；在科技领域也可能指 Chemical Markup Language 等。因为缩写高度依赖语境（医学/学校/公司/技术文档），如果你能提供一句原文或领域，我可以给出更准确的解释与用法。"]}
{"word":"CMMU","summary":{"en":"CMMU is an acronym most commonly referring to either the College of Management, Mahidol University (Thailand) or a Cache/Memory Management Unit in computing.","zh":"CMMU是一个缩写，最常见指泰国马希隆大学管理学院，或计算机领域的缓存/内存管理单元。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(acronym) College of Management, Mahidol University (Thailand).","zh":"（缩写）泰国马希隆大学管理学院（College of Management, Mahidol University）。"},"examples":[{"en":"She’s applying to CMMU for an MBA program in Bangkok.","zh":"她正在申请CMMU在曼谷的MBA项目。"},{"en":"CMMU offers weekend classes for working professionals.","zh":"CMMU为在职人士提供周末课程。"}]},{"partOfSpeech":"other","definition":{"en":"(acronym, computing) Cache/Memory Management Unit: a hardware unit that manages caching and memory access in some computer systems (especially in older CPU architectures).","zh":"（缩写，计算机）缓存/内存管理单元：在某些计算机系统中负责缓存与内存访问管理的硬件单元（在较早期的CPU架构中更常见）。"},"examples":[{"en":"The system uses a separate CMMU to handle caching and address translation.","zh":"该系统使用独立的CMMU来处理缓存和地址转换。"},{"en":"Older documentation mentions configuring the CMMU for better performance.","zh":"较早的文档会提到配置CMMU以获得更好的性能。"}]}],"synonyms":["College of Management, Mahidol University","Cache/Memory Management Unit","MMU"],"phonetic":"ˌsiː ɛm ɛm ˈjuː","extraExplanation":["“CMMU”最常见是特定机构或技术名词的缩写，具体含义很依赖语境（教育/商学院 vs. 计算机硬件）。如果你告诉我它出现的场景（比如学校、简历、芯片/操作系统文档），我可以帮你确认最准确的释义。"]}
{"word":"Cmon","summary":{"en":"“C’mon” (come on) is a casual expression used to encourage, hurry, invite someone to join/start, or show disbelief/annoyance.","zh":"“C’mon”（= come on）是很口语的表达，可用来催促/鼓励、邀请开始或加入，也可表示不相信或不耐烦。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"Used to urge or encourage someone to act, hurry, or try harder.","zh":"用来催促或鼓励别人行动、快点或更努力。"},"examples":[{"en":"C’mon, we’re going to miss the bus!","zh":"快点儿，我们要赶不上公交了！"},{"en":"C’mon, you can do it—one more try.","zh":"加油，你可以的——再试一次。"}]},{"partOfSpeech":"int.","definition":{"en":"Used to show disbelief, annoyance, or impatience (meaning “Really?” or “That’s not fair”).","zh":"表示不相信、不耐烦或不满（相当于“真的吗？”“太离谱了/不公平吧”）。"},"examples":[{"en":"Oh, c’mon—that’s not what I said.","zh":"拜托——我不是那样说的。"},{"en":"C’mon, you’re joking, right?","zh":"不是吧，你在开玩笑对吧？"}]},{"partOfSpeech":"int.","definition":{"en":"Used to invite someone to start doing something or to join you.","zh":"用来邀请对方开始做某事或加入你。"},"examples":[{"en":"C’mon, let’s get started.","zh":"来吧，我们开始吧。"},{"en":"C’mon, come with us.","zh":"来嘛，跟我们一起去。"}]},{"partOfSpeech":"phrase","definition":{"en":"Spoken form of “come on,” sometimes used as a casual, persuasive request (can sound pushy depending on tone).","zh":"“come on”的口语形式，有时表示带点劝说的请求（语气不当会显得强势/纠缠）。"},"examples":[{"en":"C’mon, just tell me what happened.","zh":"快说嘛，发生什么了？"},{"en":"C’mon, give me a chance.","zh":"拜托，给我一次机会。"}]}],"synonyms":["come on","hurry up","let’s go","give me a break","really?"],"phonetic":"/kəˈmɑn/","extraExplanation":["“C’mon”是“come on”的缩写（省略元音并加撇号），非常口语，常见于聊天、字幕、歌词中；正式写作中通常用“come on”或换更正式表达（如“please,” “hurry,” “let’s begin”）。","语气很关键：同一句“C’mon”可以是鼓励、催促，也可能显得不耐烦；对不熟的人或敏感场合，建议改用更礼貌的说法。"]}
{"word":"CMOS","summary":{"en":"CMOS is a common low-power semiconductor technology used in chips and camera image sensors.","zh":"CMOS 是一种常见的低功耗半导体技术，用于芯片和相机图像传感器等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of semiconductor technology widely used to make integrated circuits, especially in image sensors and computer chips; short for “complementary metal-oxide-semiconductor.”","zh":"一种常见的半导体制造技术，广泛用于集成电路，尤其是图像传感器和计算机芯片；是“互补金属氧化物半导体（complementary metal-oxide-semiconductor）”的缩写。"},"examples":[{"en":"Most smartphone cameras use a CMOS image sensor.","zh":"大多数智能手机相机都使用 CMOS 图像传感器。"},{"en":"The engineer chose a CMOS design because it uses little power.","zh":"工程师选择 CMOS 设计是因为它功耗很低。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to CMOS technology (often used before another noun).","zh":"与 CMOS 技术有关的（常用作定语）。"},"examples":[{"en":"This camera has a CMOS sensor.","zh":"这台相机配备 CMOS 传感器。"},{"en":"CMOS circuits are common in modern electronics.","zh":"CMOS 电路在现代电子产品中很常见。"}]}],"synonyms":["complementary metal-oxide-semiconductor","CMOS technology","CMOS sensor (context-specific)"],"phonetic":"/ˈsiːmoʊs/","extraExplanation":["CMOS 在科技语境里通常不翻译成一个“单词”，而是直接读字母（C-M-O-S），也常写作 “CMOS sensor（CMOS 传感器）”。","在相机领域，人们常把 CMOS 与 CCD（电荷耦合器件）对比：CMOS 通常更省电、集成度更高、成本更低；CCD 在一些场景下曾以画质/噪点控制见长，但如今高端 CMOS 已非常普及。","在电脑硬件里，你可能听到 “CMOS battery（主板电池）/ CMOS settings（CMOS 设置）”：这里的 CMOS 指主板上一小块低功耗存储/电路区域，用电池维持时间与BIOS/UEFI相关设置。"]}
{"word":"CMOT","summary":{"en":"CMOT most commonly refers to “Cut-Me-Own-Throat” (as in C.M.O.T. Dibbler from Discworld), but it can also be a context-dependent abbreviation.","zh":"CMOT 最常见指“Cut-Me-Own-Throat”（如《碟形世界》里的 C.M.O.T. Dibbler），也可能是取决于语境的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation used to mean “Cut-Me-Own-Throat,” a humorous nickname (often written as CMOT) for the character C.M.O.T. Dibbler in Terry Pratchett’s Discworld novels.","zh":"缩写，表示“Cut-Me-Own-Throat（割我自己的喉咙）”，常用来指特里·普拉切特《碟形世界》系列中的角色 C.M.O.T. Dibbler 的搞笑绰号（常写作 CMOT）。"},"examples":[{"en":"In Discworld fandom, “CMOT” usually points to Dibbler, the shady street vendor.","zh":"在《碟形世界》的粉丝圈里，“CMOT”通常指狡猾的街头小贩迪布勒。"},{"en":"The sign said “CMOT Dibbler,” so I knew the joke was about his “cut-throat” business style.","zh":"招牌写着“CMOT Dibbler”，我就知道这个梗是在笑他的“狠辣/不择手段”的经商风格。"}]},{"partOfSpeech":"other","definition":{"en":"(general use) an initialism meaning different things in different fields (for example, a team name or an internal project label); the exact meaning depends on context.","zh":"（一般用法）首字母缩略词，在不同领域可能代表不同含义（如团队名称、项目代号等）；具体意思取决于上下文。"},"examples":[{"en":"What does “CMOT” stand for in your company’s documentation?","zh":"在你们公司的文档里，“CMOT”代表什么？"},{"en":"Without more context, “CMOT” is hard to interpret because it can be a local abbreviation.","zh":"没有更多语境，“CMOT”很难判断，因为它可能是某个圈子/组织内部的缩写。"}]}],"synonyms":["initialism","abbreviation"],"phonetic":"ˌsiː ɛm oʊ ˈtiː","extraExplanation":["“Cut-Me-Own-Throat”是一种夸张的英式幽默说法，字面很吓人，但实际用来讽刺某人做生意特别“狠”、只顾赚钱。","C.M.O.T. Dibbler 是《碟形世界》里反复出现的角色，常卖不靠谱的小吃（例如著名的“香肠 in a bun”），因此 CMOT 在同人讨论、书评或梗图里很常见。"]}
{"word":"CMRR","summary":{"en":"CMRR most commonly means Common-Mode Rejection Ratio, a spec for how well a circuit rejects shared (common-mode) noise on both inputs.","zh":"CMRR 最常见指共模抑制比，用来表示电路对两输入端共有噪声（共模噪声）的抑制能力。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Common-Mode Rejection Ratio: a measurement of how well an amplifier or input circuit rejects noise or signals that are the same on both input lines (common-mode signals). Higher CMRR usually means better noise rejection.","zh":"共模抑制比：衡量放大器或输入电路抑制“共模信号”（两条输入线上相同的噪声或信号）的能力。CMRR 越高，通常抗干扰能力越强。"},"examples":[{"en":"This instrumentation amplifier has a high CMRR, so it can measure tiny signals in a noisy environment.","zh":"这款仪表放大器的 CMRR 很高，所以它能在噪声很大的环境里测到很微弱的信号。"},{"en":"If the CMRR is low, 50/60 Hz hum may show up in the output.","zh":"如果 CMRR 很低，输出里可能会出现 50/60 赫兹的工频嗡声。"}]}],"synonyms":["common-mode rejection"],"phonetic":"/siː ɛm ɑːr ɑːr/","extraExplanation":["CMRR 常见于模拟电路/音频/传感器测量领域，尤其是差分输入或仪表放大器（instrumentation amplifier）。它通常用 dB 表示；数值越大，表示对共模噪声（例如电源干扰、工频干扰、长线引入的噪声）的抑制越好。","在实际应用中，除了器件本身的 CMRR，布线对称性、匹配电阻、接地方式也会明显影响最终的“有效 CMRR”。"]}
{"word":"CMS","summary":{"en":"CMS most commonly means “content management system” (website/content publishing software), and in U.S. healthcare it can mean the “Centers for Medicare & Medicaid Services.”","zh":"CMS 最常见指“内容管理系统”；在美国医疗语境中也可指“美国医疗保险和医疗补助服务中心”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a content management system: software used to create, edit, organize, and publish digital content (especially websites) without needing much coding","zh":"内容管理系统：一种用于创建、编辑、管理并发布数字内容（尤其是网站）的软件，通常不需要很多编程技能"},"examples":[{"en":"We built the company website with a CMS like WordPress.","zh":"我们用 WordPress 之类的 CMS 搭建了公司网站。"},{"en":"The CMS lets non-technical staff update pages and post news.","zh":"这个 CMS 让非技术人员也能更新页面、发布新闻。"}]},{"partOfSpeech":"n.","definition":{"en":"the Centers for Medicare & Medicaid Services: a U.S. federal agency that runs major public health insurance programs such as Medicare and Medicaid","zh":"美国医疗保险和医疗补助服务中心：美国联邦机构，负责管理 Medicare（联邦医疗保险）和 Medicaid（医疗补助）等公共医保项目"},"examples":[{"en":"CMS announced new rules for Medicare payments.","zh":"CMS 发布了关于 Medicare 付款的新规定。"},{"en":"Hospitals must follow CMS reporting requirements.","zh":"医院必须遵守 CMS 的报告要求。"}]}],"synonyms":["content management system","website platform","publishing platform"],"phonetic":"siː ɛm ɛs","extraExplanation":["“CMS”是缩写，在不同语境里意思可能完全不同。科技/网站领域最常见的是 content management system（内容管理系统）；在美国医疗政策新闻里常指 Centers for Medicare & Medicaid Services（美国联邦机构）。遇到不确定时，优先看上下文（网站、编辑发布、WordPress 等 → 内容管理系统；Medicare/Medicaid、医院报销、政策规则 → 美国机构）。","读法通常按字母逐个读：C-M-S。"]}
{"word":"CMSGT","summary":{"en":"CMSgt = Chief Master Sergeant, the highest enlisted rank in the U.S. Air Force.","zh":"CMSgt 是 Chief Master Sergeant（空军首席军士长）的缩写，为美国空军最高士兵军衔之一。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation for “Chief Master Sergeant,” the highest enlisted rank in the U.S. Air Force (pay grade E-9).","zh":"“Chief Master Sergeant（空军首席军士长）”的缩写，是美国空军最高的士兵（士官/士兵体系）军衔之一（薪级 E-9）。"},"examples":[{"en":"CMSgt Rivera will lead the enlisted professional development briefing today.","zh":"Rivera 空军首席军士长（CMSgt）今天将主持士兵职业发展简报。"},{"en":"Please route this request to the CMSgt for final review.","zh":"请把这份申请转给首席军士长（CMSgt）做最终审核。"}]}],"synonyms":["Chief Master Sergeant","Chief"],"phonetic":"/ˌsiːˌɛmˌɛsˈdʒiːˌtiː/","extraExplanation":["CMSgt 通常写作 CMSgt（大小写固定），属于美军空军的士官军衔体系；在正式场合可写全称 Chief Master Sergeant。","口语里常把 CMSgt 称为 “Chief”（读作“chief”），但这是称呼方式，不是正式军衔写法。","这是美国空军语境下的缩写；不同军种的最高士官称谓不同（例如陆军的 Sergeant Major 等）。"]}
{"word":"CMT","summary":{"en":"CMT usually means Country Music Television, Charcot–Marie–Tooth disease (medical), or “comment” in social media.","zh":"CMT 通常指：乡村音乐电视频道（CMT）、夏科–马里–图斯病（医学），或社交媒体中的“评论/留言”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Country Music Television,” a U.S. TV channel focused on country music.","zh":"“Country Music Television”的缩写，美国一个以乡村音乐为主的电视频道。"},"examples":[{"en":"I saw the new music video on CMT last night.","zh":"我昨晚在 CMT 上看到那支新音乐视频。"},{"en":"CMT used to play a lot more music videos than it does now.","zh":"CMT 以前播放的音乐视频比现在多得多。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Charcot–Marie–Tooth (disease),” a hereditary condition that affects nerves, often causing muscle weakness in the feet and hands.","zh":"“Charcot–Marie–Tooth（夏科–马里–图斯）病”的缩写，一种遗传性周围神经疾病，常导致手脚肌肉无力等症状。"},"examples":[{"en":"She was diagnosed with CMT in her teens.","zh":"她在十几岁时被诊断为 CMT。"},{"en":"CMT can make walking difficult for some people.","zh":"对一些人来说，CMT 可能会让走路变得困难。"}]},{"partOfSpeech":"other","definition":{"en":"(social media, informal) short for “comment,” meaning to leave a comment on a post.","zh":"（社交媒体，非正式）“comment（评论）”的缩写，指在帖子下留言/评论。"},"examples":[{"en":"CMT if you agree!","zh":"同意的话就评论（CMT）！"},{"en":"Please CMT your questions below.","zh":"请在下面评论（CMT）你的问题。"}]}],"synonyms":["Country Music Television","Charcot–Marie–Tooth disease","comment"],"phonetic":"ˌsiː ɛm ˈtiː","extraExplanation":["“CMT”是缩写，具体意思高度依赖场景：音乐/电视语境多指电视频道；医学语境多指遗传性神经疾病；社交媒体语境里常被当作“comment”的简写。看到它时，最好结合上下文判断。"]}
{"word":"CMTC","summary":{"en":"CMTC is an all-caps acronym; a common meaning is the Connecticut Manufacturing Technology Center, but the exact expansion depends on context.","zh":"CMTC 是一个大写首字母缩写；常见含义之一是“康涅狄格制造技术中心”，但具体全称需看语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Connecticut Manufacturing Technology Center (CMTC): a nonprofit organization in Connecticut that provides consulting, training, and support to help manufacturers improve productivity and competitiveness.","zh":"康涅狄格制造技术中心（CMTC）：美国康涅狄格州的一家非营利机构，为制造业提供咨询、培训与支持，帮助提升效率与竞争力。"},"examples":[{"en":"Our plant worked with CMTC to improve our lean manufacturing process.","zh":"我们工厂与 CMTC 合作，改进了精益生产流程。"},{"en":"CMTC offered training on quality management for small manufacturers.","zh":"CMTC 为小型制造企业提供了质量管理培训。"}]},{"partOfSpeech":"other","definition":{"en":"An acronym whose exact meaning depends on the context (business, government, healthcare, engineering, etc.); it is usually read by saying each letter: C-M-T-C.","zh":"一个缩写词，具体含义取决于语境（商业、政府、医疗、工程等）；通常逐个字母读：C-M-T-C。"},"examples":[{"en":"What does CMTC stand for in this document?","zh":"这份文件里的 CMTC 是什么意思/代表什么？"},{"en":"In the meeting notes, CMTC appears several times, but the full name isn’t explained.","zh":"在会议纪要中 CMTC 出现了好几次，但没有解释全称。"}]}],"synonyms":["acronym","initialism","abbreviation"],"phonetic":"/ˌsiː.ɛm.tiːˈsiː/","extraExplanation":["“CMTC”不是一个固定只有一种含义的单词，更像是“首字母缩写”。在不同国家、行业或机构里可能代表不同组织或术语。","如果你能提供一句包含 CMTC 的原文句子、所在行业（例如制造业/医疗/学校/军工/IT）或地区（例如美国某州），我可以帮你锁定最可能的全称与含义。"]}
{"word":"CMU","summary":{"en":"“CMU” is a common abbreviation, most often meaning Carnegie Mellon University; in construction it often means “concrete masonry unit” (a concrete block).","zh":"“CMU”是常见缩写，最常指卡内基梅隆大学；在建筑领域常指“混凝土砌块”（concrete masonry unit）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Carnegie Mellon University, a private research university in Pittsburgh, Pennsylvania (often written as “CMU”).","zh":"卡内基梅隆大学（Carnegie Mellon University），位于美国宾夕法尼亚州匹兹堡的一所私立研究型大学（常写作“CMU”）。"},"examples":[{"en":"She got into CMU for computer science.","zh":"她被 CMU 的计算机科学专业录取了。"},{"en":"CMU is well known for robotics and AI research.","zh":"CMU 以机器人和人工智能研究闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"concrete masonry unit; a standard concrete block used in construction.","zh":"混凝土砌块（concrete masonry unit）；建筑中常用的标准混凝土块。"},"examples":[{"en":"The wall was built with CMU blocks and then painted.","zh":"这面墙用 CMU 砌块砌成，之后再刷漆。"},{"en":"Engineers specified reinforced CMU for the stairwell.","zh":"工程师为楼梯间指定使用钢筋加固的 CMU 结构。"}]},{"partOfSpeech":"n.","definition":{"en":"Central Michigan University, a public university in Michigan (also shortened to “CMU”).","zh":"中密歇根大学（Central Michigan University），位于美国密歇根州的一所公立大学（也常简称“CMU”）。"},"examples":[{"en":"He studied education at CMU in Michigan.","zh":"他在密歇根的 CMU 学习教育学。"},{"en":"CMU’s homecoming game brings many alumni back.","zh":"CMU 的返校赛会吸引许多校友回来。"}]}],"synonyms":["Carnegie Mellon University","concrete masonry unit","concrete block"],"phonetic":"/ˌsiː ˌɛm ˈjuː/","extraExplanation":["“CMU”是缩写，具体含义高度依赖语境：在学术/求学话题里最常指 Carnegie Mellon University；在建筑/工程语境里常指 concrete masonry unit（混凝土砌块）。写作时如果读者不确定，第一次出现通常会先写全称再括号标注（e.g., Carnegie Mellon University (CMU)）。","读音上英语里常把字母逐个读出来（C-M-U），所以发音会是三个字母的组合。"]}
{"word":"CMW","summary":{"en":"CMW is an abbreviation; in texting it often means “Call me when…,” but in workplaces it can be a field-specific label whose meaning depends on context.","zh":"CMW 是缩写；聊天中常指“Call me when…（……时联系我）”，但在工作场景也可能是某个系统/项目/机构的代号，需结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) “Call me when …” used in texting to ask someone to contact you at a certain time or after something happens.","zh":"（缩写）“Call me when …” 的简写，常用于短信/聊天，表示“……的时候给我打电话/联系我”。"},"examples":[{"en":"CMW you get home—it's important.","zh":"你到家后给我打电话——很重要。"},{"en":"CMW after the meeting and tell me what happened.","zh":"开完会给我联系一下，告诉我发生了什么。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev.) Used as an organization/technical abbreviation (meaning varies by field), e.g., a company name, a project, or a system label.","zh":"（缩写）也可能是机构名或技术名词缩写（具体含义因领域而异），例如公司名、项目名或系统代号。"},"examples":[{"en":"Please submit the request in CMW before Friday.","zh":"请在周五前在 CMW 系统里提交申请。"},{"en":"CMW is down right now, so the upload will be delayed.","zh":"CMW 目前宕机了，所以上传会延迟。"}]}],"synonyms":["Call me when… (texting)"],"phonetic":"/ˌsiːˌɛmˈdʌbəl.juː/","extraExplanation":["“CMW”不是一个固定、唯一的英文缩写，最常见的聊天用法之一是“Call me when…”。但在公司/学校/工程环境里，它也常被当作内部系统、项目或机构名称的缩写使用。你可以告诉我上下文（在哪看到的、前后句是什么），我就能帮你锁定最准确的含义。"]}
{"word":"CMYK","summary":{"en":"CMYK is the four-ink color system used for most printing (cyan, magenta, yellow, and black).","zh":"CMYK 是多数印刷使用的四色油墨体系（青、品红、黄、黑）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a color model used mainly in printing that mixes four inks—Cyan, Magenta, Yellow, and Key (Black)—to produce colors on paper","zh":"一种主要用于印刷的色彩模式，通过四种油墨——青(Cyan)、品红(Magenta)、黄(Yellow)与黑(Key/Black)——混合来呈现纸面颜色"},"examples":[{"en":"This brochure was designed in CMYK for professional printing.","zh":"这本宣传册是用 CMYK 模式设计的，便于专业印刷。"},{"en":"If your file is in RGB, convert it to CMYK before sending it to the printer.","zh":"如果你的文件是 RGB 模式，发给印刷厂前先转换成 CMYK。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to printing or design work that uses the CMYK color model","zh":"与使用 CMYK 色彩模式的印刷/设计工作有关的"},"examples":[{"en":"We need a CMYK version of the logo for packaging.","zh":"我们需要一个用于包装印刷的 CMYK 版本标志。"},{"en":"CMYK printing can look slightly different from what you see on a screen.","zh":"CMYK 印刷出来的效果可能会和屏幕上看到的略有不同。"}]}],"synonyms":["four-color process","process color","four-color printing"],"phonetic":"/ˌsiː ɛm waɪ ˈkeɪ/","extraExplanation":["“CMYK”是四个颜色英文名的首字母缩写：Cyan（青）、Magenta（品红）、Yellow（黄）、Key（黑）。其中“K”常被解释为“Key plate（关键版）”，也常直接理解为 Black（黑色）。","学习设计时常会对比 CMYK 与 RGB：RGB 用于屏幕发光显示（加色法），CMYK 用于油墨印刷（减色法）。因此同一张图在屏幕上和印刷品上可能出现色差。"]}
