{"word":"CN","summary":{"en":"CN most commonly means “China” (including the domain .cn), and it can also mean “common noun” in grammar.","zh":"CN 最常见表示“中国”（也包括域名 .cn）；在语法中也可表示“普通名词”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for China; also the internet country code top-level domain for China (.cn)","zh":"“China（中国）”的缩写；也指中国的互联网国家/地区顶级域名（.cn）"},"examples":[{"en":"Many products are labeled “CN” to show they were made in China.","zh":"很多产品会标注“CN”，表示它们在中国制造。"},{"en":"Their website ends in .cn because it targets users in China.","zh":"他们的网站以 .cn 结尾，因为主要面向中国用户。"}]},{"partOfSpeech":"other","definition":{"en":"in grammar, an abbreviation for common noun","zh":"在语法中，common noun（普通名词）的缩写"},"examples":[{"en":"In the worksheet, “CN” means a common noun like “city” or “teacher.”","zh":"在练习题里，“CN”表示普通名词，比如“city（城市）”或“teacher（老师）”。"}]},{"partOfSpeech":"other","definition":{"en":"in technology, an abbreviation for computer network (less common in everyday English)","zh":"在科技语境中，computer network（计算机网络）的缩写（日常英语中较少用）"},"examples":[{"en":"The report discusses CN security risks in large organizations.","zh":"这份报告讨论了大型组织中的 CN（计算机网络）安全风险。"}]}],"synonyms":["China (in meaning)",".cn (domain meaning)"],"phonetic":"/siː ɛn/","extraExplanation":["“CN”是缩写，具体含义非常依赖语境：标签/产地和域名里多指“中国”；语法作业里常指“普通名词”；技术文档里偶尔指“计算机网络”。如果你告诉我出现在什么句子或场景里，我可以帮你判断最准确的意思。"]}
{"word":"Cn","summary":{"en":"“CN/Cn” most commonly means China (abbreviation), and it can also be the chemical symbol for copernicium or simply the letters C and N.","zh":"“CN/Cn”最常见指“中国”的缩写；也可指元素“鎶”的化学符号，或仅表示字母 C 和 N。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “China,” often used in internet contexts, country codes, shipping, or language tags (CN).","zh":"“China（中国）”的缩写，常见于网络语境、国家代码、物流/寄送信息或语言标签（CN）。"},"examples":[{"en":"The package was shipped from CN.","zh":"这个包裹是从 CN（中国）寄出的。"},{"en":"Choose CN to see the China region settings.","zh":"选择 CN 来查看中国地区设置。"}]},{"partOfSpeech":"other","definition":{"en":"the chemical symbol for copernicium, a synthetic element (atomic number 112).","zh":"化学元素“Copernicium（鎶）”的符号，人工合成元素（原子序数 112）。"},"examples":[{"en":"Cn is the symbol for copernicium on the periodic table.","zh":"在元素周期表上，Cn 是鎶的符号。"}]},{"partOfSpeech":"other","definition":{"en":"the letters “C” and “N” spoken as a name (e.g., initials or a label).","zh":"读作字母名的“C”和“N”（例如首字母缩写或标签名）。"},"examples":[{"en":"My initials are C.N.","zh":"我的姓名首字母是 C.N。"},{"en":"Write “CN” at the top of the form.","zh":"在表格顶部写上“CN”。"}]}],"synonyms":["China (when meaning the country)","PRC (People’s Republic of China, more specific)","C.N. (as initials)"],"phonetic":"siː ɛn","extraExplanation":["“CN”最常见的含义确实是“中国”，来源于国际通用缩写（如 ISO 国家代码、互联网域名 .cn）。","注意大小写：在许多正式场景会写作“CN”；而化学符号按惯例写作“Cn”（第一个字母大写、第二个小写）。","读音通常按字母读作“C-N”。在口语里也可能直接说“China”，尤其在日常聊天中更自然。"]}
{"word":"cn","summary":{"en":"Tell me the English word/phrase you want to look up; I can provide bilingual (EN/ZH) explanations with a Chinese-leaning focus.","zh":"请告诉我你要查询的英文单词/短语；我可以用中英双语（偏中文）提供音标、释义、例句等。"},"extraExplanation":["你是想把解释内容偏向中文（cn = Chinese）吗？可以的。","请再告诉我你要查询的英文单词/短语（例如：\"resilient\" 或 \"break the ice\"），我会按中英双语给出：音标、词性、释义、例句、同义词等。"]}
{"word":"CNA","summary":{"en":"CNA is an acronym most commonly meaning Certified Nursing Assistant (a patient-care support role). In some contexts, it can also mean China News Agency.","zh":"CNA是一个缩写，最常见含义是“认证护理助理/护工”。在某些语境中也可指“中国新闻社”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Certified Nursing Assistant: a healthcare worker who helps patients with basic daily care (such as bathing, dressing, eating), takes simple vital signs, and supports nurses in hospitals or long-term care facilities.","zh":"（美国常用）CNA：认证护理助理/护工，负责协助病人日常生活护理（如洗澡、穿衣、进食），测量基础生命体征，并在医院或护理机构中协助护士工作。"},"examples":[{"en":"My grandmother has a CNA who helps her get dressed every morning.","zh":"我奶奶有一位CNA每天早上帮她穿衣服。"},{"en":"To work as a CNA, you usually need training and a state certification exam.","zh":"要当CNA通常需要接受培训并通过州认证考试。"},{"en":"The nurse asked the CNA to check the patient’s blood pressure.","zh":"护士让CNA去量一下病人的血压。"}]},{"partOfSpeech":"other","definition":{"en":"China News Agency: a major state-run news organization in China, often abbreviated as CNA in English contexts.","zh":"（新闻机构）中国新闻社：在英文语境中有时缩写为CNA的中国大型新闻机构（国有背景）。"},"examples":[{"en":"The report was published by CNA and picked up by other outlets.","zh":"这篇报道由CNA发布，随后被其他媒体转载。"},{"en":"According to CNA, the event drew thousands of visitors.","zh":"据CNA报道，该活动吸引了数千名游客。"}]}],"synonyms":["nursing assistant","nursing aide"],"phonetic":"/ˌsiːˌɛnˈeɪ/","extraExplanation":["在美国日常英语里，CNA最常指“Certified Nursing Assistant（认证护理助理）”，常见工作场景是nursing home（护理院）、hospital（医院）或long-term care（长期护理）。","读新闻或国际话题时，CNA也可能指China News Agency（中国新闻社）。遇到缩写不确定时，最好结合上下文（医疗/招聘 vs. 新闻来源）判断。"]}
{"word":"CNAA","summary":{"en":"CNAA usually refers to the UK Council for National Academic Awards, a former degree-awarding/validating body.","zh":"CNAA通常指英国“国家学术奖项委员会”，曾负责学位颁发与认证。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(UK, historical) Council for National Academic Awards: a former British public body that awarded and validated degrees for polytechnics and other higher-education institutions (especially before many became universities).","zh":"（英国，历史用语）国家学术奖项委员会：英国曾设立的公共机构，负责为理工学院等高等教育机构颁发与认证学位（尤其在许多机构升格为大学之前）。"},"examples":[{"en":"She earned a CNAA-validated degree in business in the 1980s.","zh":"她在20世纪80年代获得了由CNAA认证的商科学位。"},{"en":"Before the university was created, its courses were accredited through the CNAA.","zh":"在该校成为大学之前，它的课程通过CNAA进行认证。"}]}],"synonyms":["Council for National Academic Awards"],"phonetic":"/ˌsiːˌɛnˌeɪˈeɪ/","extraExplanation":["CNAA常见于英国教育史语境。它在1960年代设立，主要为当时没有独立授位权的理工学院等机构提供“授予/验证学位”的机制。1992年前后，随着许多理工学院获得大学地位并取得授位权，CNAA的职能逐步被替代并最终撤销。"]}
{"word":"CNAB","summary":{"en":"CNAB usually refers to a former Chinese national board for laboratory accreditation.","zh":"CNAB 通常指曾负责实验室认可的中国国家级机构（旧称/历史缩写）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for China National Accreditation Board for Laboratories, a former national body that evaluated and accredited testing/calibration laboratories in China","zh":"“中国国家实验室认可委员会”的缩写（早期机构名称之一），曾负责对中国的检测/校准实验室进行评审与认可"},"examples":[{"en":"The lab was accredited by CNAB before the system was reorganized.","zh":"该实验室在体系重组之前由 CNAB 认可。"},{"en":"CNAB documents helped standardize quality management in testing laboratories.","zh":"CNAB 的文件帮助检测实验室统一了质量管理标准。"}]}],"synonyms":["laboratory accreditation body (general)"],"phonetic":"/ˌsiːɛnˌeɪˈbiː/","extraExplanation":["CNAB 属于缩写词，具体所指在不同国家/领域可能不一样。常见读法是逐字母读（C-N-A-B）。","在中国质量/认可体系的历史中，CNAB 相关职能后来经历整合与更名；如果你是在某份旧证书、旧标准或旧报告里看到 CNAB，通常与实验室认可/资质评审有关。"]}
{"word":"cnawan","summary":{"en":"“cnawan” is not recognized as an English vocabulary word; please provide context or confirm the intended spelling.","zh":"“cnawan”不是常见英文词汇；请提供上下文或确认你想查的正确拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a name, or a term from another language.","zh":"不是标准英语单词。可能是拼写错误、人名，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “cnawan” in an English dictionary—did you mean “Canaan” or “canal” or “cannon”?","zh":"我在英文词典里找不到“cnawan”——你是不是想写“Canaan（迦南）”或“canal（运河）”或“cannon（大炮）”？"}]}],"phonetic":"/ˈsiːˌɛnəwæn/","extraExplanation":["“cnawan”更像是键盘误打或转写（音译）形式。你可以告诉我：1）你看到它的原句/上下文；2）它来自哪里（歌曲、游戏、聊天、课本等）；3）你想表达的中文意思。我就能更准确地判断你要查的词。","如果你想查的是 **Canaan**（迦南），那是《圣经》中常见的地名/象征“应许之地”，读音是 /ˈkeɪnən/。但需要你确认拼写。"]}
{"word":"cnawlece","summary":{"en":"Knowledge means what you know or understand from learning or experience; it can also mean being aware of something.","zh":"Knowledge 指通过学习或经验获得的知识/理解，也可指对某事的知晓。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Information, understanding, or skills that you gain through learning or experience.","zh":"通过学习或经验获得的知识、理解或技能。"},"examples":[{"en":"She has a lot of knowledge about cooking.","zh":"她对烹饪有很多知识。"},{"en":"Reading helps you build knowledge over time.","zh":"阅读能帮助你随着时间积累知识。"}]},{"partOfSpeech":"n.","definition":{"en":"Awareness of a fact or situation (often used in the phrase “to my knowledge”).","zh":"对某个事实或情况的知晓（常用于短语“to my knowledge”）。"},"examples":[{"en":"To my knowledge, the meeting starts at 3 p.m.","zh":"据我所知，会议下午三点开始。"},{"en":"He left without my knowledge.","zh":"他在我不知情的情况下离开了。"}]}],"synonyms":["information","understanding","learning","awareness","expertise"],"phonetic":"/ˈnɑlɪdʒ/","extraExplanation":["你输入的“cnawlece”看起来像是把 **knowledge** 拼错了。正确拼写：**knowledge**。","**knowledge** 里的字母组合 **-ow-** 不发 /aʊ/（不像 *now*），而更接近 /ɑ/ 的音；很多学习者会在拼写和发音上一起混淆。","常见搭配：**general knowledge**（常识/一般知识），**scientific knowledge**（科学知识），**gain/acquire knowledge**（获得知识），**share knowledge**（分享知识）。"]}
{"word":"CNC","summary":{"en":"CNC usually means Computer Numerical Control: computers controlling machines for precise manufacturing.","zh":"CNC通常指计算机数控：用计算机控制机床进行高精度加工。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Computer Numerical Control: a system in which computers control machines (such as mills, lathes, or routers) using programmed instructions to cut, shape, or drill materials precisely.","zh":"计算机数控：用计算机通过编程指令来控制机床（如铣床、车床、雕刻机/开料机等），对材料进行高精度切削、成形或钻孔的系统。"},"examples":[{"en":"This factory uses CNC machines to make metal parts with very high accuracy.","zh":"这家工厂使用CNC机床来高精度制造金属零件。"},{"en":"He programmed the CNC router to cut the wood into the exact shape.","zh":"他给CNC雕刻机/开料机编程，让它把木材切成精确的形状。"},{"en":"CNC is common in automotive and aerospace manufacturing.","zh":"CNC在汽车和航空航天制造业中很常见。"}]}],"synonyms":["computer-controlled machining","numerically controlled (NC)"],"phonetic":"/ˌsiːɛnˈsiː/","extraExplanation":["CNC在英语里通常读作字母：C-N-C（/ˌsiːɛnˈsiː/）。","常见搭配：CNC machine（数控机床）、CNC milling（数控铣削）、CNC lathe（数控车床）、CNC router（数控雕刻/开料机）、CNC operator（数控操作员）。","相关概念：很多人会把“CNC”与“G-code”一起提到；G-code是常见的机床控制指令语言，用来告诉机器如何移动、切削以及使用什么速度等。"]}
{"word":"CNCC","summary":{"en":"CNCC is an initialism with multiple possible meanings; a common one in business is China National Chemical Corporation.","zh":"CNCC 是一个可能有多种含义的字母缩写；在商业语境中较常见的一种是 China National Chemical Corporation（中国国家化工集团公司）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An initialism (letter-by-letter abbreviation) that can stand for different organizations or terms depending on the field (for example, a company name, a committee, or a technical center).","zh":"一个按字母逐个读出的缩写（首字母缩略词），在不同领域可能代表不同的机构或术语（例如公司名称、委员会或技术中心）。"},"examples":[{"en":"What does CNCC stand for in this document?","zh":"在这份文件里，CNCC 代表什么？"},{"en":"CNCC can mean different things, so please give the full name once.","zh":"CNCC 可能有不同含义，所以请先写出一次全称。"}]},{"partOfSpeech":"other","definition":{"en":"(Business) Sometimes used to refer to ChemChina’s former English name: China National Chemical Corporation.","zh":"（商业）有时用来指中国中化集团（ChemChina）曾用的英文名：China National Chemical Corporation（中国国家化工集团公司）。"},"examples":[{"en":"The report mentions CNCC (China National Chemical Corporation) in the merger history.","zh":"报告在并购历史中提到 CNCC（中国国家化工集团公司）。"}]}],"synonyms":["initialism","acronym (general)"],"phonetic":"/ˌsiːˌɛnˌsiːˈsiː/","extraExplanation":["“CNCC”本身不是一个固定含义的普通英语单词，更像是缩写；准确解释通常需要上下文（例如出自哪份文件、哪个行业、哪个国家/地区）。","读法一般按字母逐个读：C-N-C-C。","如果你告诉我它出现的句子或领域（如化工、教育、宗教、IT 等），我可以给出最贴切的释义与用法。"]}
{"word":"CND","summary":{"en":"CND is an abbreviation most commonly meaning the UK Campaign for Nuclear Disarmament; informally it can also mean “could/cannot determine.”","zh":"CND是缩写，最常见指英国“核裁军运动”；在非正式报告中也可表示“无法判定/无法确定”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) Campaign for Nuclear Disarmament (a UK anti-nuclear weapons organization).","zh":"（缩写）英国“核裁军运动”（反对核武器的社会组织）。"},"examples":[{"en":"The CND held a march calling for nuclear disarmament.","zh":"核裁军运动（CND）举行游行，呼吁实现核裁军。"},{"en":"She joined CND in the 1980s to protest nuclear weapons.","zh":"她在20世纪80年代加入CND，抗议核武器。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., informal) could not determine / cannot determine (used in reports or tests when a result isn’t clear).","zh":"（缩写，非正式）无法判定/无法确定（用于报告或检测中表示结果不明确）。"},"examples":[{"en":"The cause of the error was marked as CND in the report.","zh":"报告中将错误原因标注为CND（无法确定）。"},{"en":"If the sample is too small, the result may be CND.","zh":"如果样本太少，结果可能会显示为CND（无法判定）。"}]}],"synonyms":["Campaign for Nuclear Disarmament","cannot determine","could not determine"],"phonetic":"/ˌsiː ɛn ˈdiː/","extraExplanation":["“CND”是一个缩写，在不同领域含义差异很大。最常见的正式含义之一是英国的“核裁军运动”，也常出现在政治与社会运动的语境中。","如果你是在某个特定场景（比如医学检验、工程报告、聊天信息、游戏）看到“CND”，告诉我上下文，我可以帮你确定最可能的意思。"]}
{"word":"cnemapophysis","summary":{"en":"A scientific term for a spur-like outgrowth on the shin/tibia area of an arthropod leg.","zh":"一个科学术语：指节肢动物腿部胫（小腿/胫节）区域的刺状突起。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology/Entomology) A small bony or hardened projection (an “outgrowth” or spur) on the cnema (shin/tibia area) of an arthropod leg, described especially in scientific taxonomy.","zh":"（动物学/昆虫学）指节肢动物腿部胫节（小腿/“胫”部位，cnema）上的一种小的硬化突起或“骨突/刺状突起”，常用于分类描述。"},"examples":[{"en":"The species can be identified by the shape of the cnemapophysis on the hind leg.","zh":"该物种可通过后足胫部的 cnemapophysis 形状来鉴别。"},{"en":"Under the microscope, the cnemapophysis appears as a short spur near the tibia.","zh":"在显微镜下，cnemapophysis 看起来像胫节附近的一段短小刺突。"}]}],"synonyms":["cnemial apophysis","tibial apophysis"],"phonetic":"/ˌniːməpəˈfɪsɪs/","extraExplanation":["词源上可拆为 cnema-（来自希腊语 knēmē，意为“小腿/胫”）+ apophysis（“突起、骨突、外生长物”）。因此它整体就是“胫部的突起”。","这是偏专业的形态学术语，多见于节肢动物（如昆虫、蛛形纲等）的形态描述与检索表中；具体位置与形状会因研究对象不同而略有差异。"]}
{"word":"cnemial","summary":{"en":"Chemical means “related to chemistry/chemicals,” and as a noun it means “a chemical substance.”","zh":"Chemical 可作形容词表示“化学的/与化学物质有关的”，也可作名词表示“化学物质/化学品”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(likely intended) relating to chemicals or chemistry; produced by or using chemical processes","zh":"（可能你想拼的是）与化学或化学物质有关的；由化学过程产生的；使用化学方法的"},"examples":[{"en":"The lab studies chemical reactions.","zh":"这个实验室研究化学反应。"},{"en":"Some plants can cause chemical burns on the skin.","zh":"有些植物会导致皮肤化学灼伤。"},{"en":"They make chemical-free cleaners for the kitchen.","zh":"他们生产用于厨房的“无化学成分”清洁剂。"}]},{"partOfSpeech":"n.","definition":{"en":"a substance used in or produced by chemistry, especially one that can affect health or the environment","zh":"化学品；（尤指）可能影响健康或环境的化学物质"},"examples":[{"en":"Keep household chemicals away from children.","zh":"把家用化学品放在孩子接触不到的地方。"},{"en":"The river was polluted by industrial chemicals.","zh":"这条河被工业化学品污染了。"}]}],"synonyms":["synthetic","industrial","compound","substance"],"phonetic":"/ˈkɛmɪkəl/","extraExplanation":["你输入的“cnemial”很像是把 chemical 拼错了：chemical 的正确拼法是 c-h-e-m-i-c-a-l。","chemical 来自 chemistry（化学）。在生活语境里，复数 chemicals 常指“化学品/化学药剂”。","注意口语里“chemical-free（无化学成分）”常用于营销表达，科学上更准确的说法可能是 “free of certain chemicals（不含某些化学物质）”。"]}
{"word":"cnemic","summary":{"en":"Cnemic means “related to the shin,” mainly used in medical/anatomy contexts.","zh":"cnemic 指“与小腿胫部有关的”，多用于医学/解剖语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the shin (the front part of the lower leg), especially in anatomy or medicine","zh":"（解剖/医学）与小腿胫部（小腿前侧的“胫/胫骨附近”）有关的"},"examples":[{"en":"The doctor noted pain in the cnemic region after the fall.","zh":"医生记录说他摔倒后小腿胫部区域疼痛。"},{"en":"In anatomy class, we studied the muscles along the cnemic area.","zh":"在解剖课上，我们学习了沿小腿胫部区域分布的肌肉。"}]}],"synonyms":["tibial","crural"],"phonetic":"/ˈniːmɪk/","extraExplanation":["读音里开头的 c 不发音：cnemic 读作 /ˈniːmɪk/，类似于 knee（膝盖）里开头的 k 不发音。","这个词比较书面且偏专业，常见于解剖学、医学或生物学描述；日常英语更常用 shin（小腿胫部）或 tibial（胫骨的）。","词源来自希腊语 knēmē，意为“小腿/胫”。相关名词是 cnemis（胫；小腿胫部）。"]}
{"word":"cnemides","summary":{"en":"Cnemides are ancient shin-protecting leg armors (greaves).","zh":"cnemides 指古代用于保护小腿胫部的护腿甲（护胫）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) pieces of armor worn to protect the lower legs (shins); greaves.","zh":"（复数）护胫；护腿甲（保护小腿胫骨部位的盔甲）。"},"examples":[{"en":"The museum displayed bronze cnemides from ancient Greece.","zh":"博物馆展出了古希腊的青铜护胫。"},{"en":"Warriors fastened their cnemides before going into battle.","zh":"战士们上战场前先把护胫系好。"},{"en":"In the epic, the hero’s cnemides shine as he prepares to fight.","zh":"在史诗里，英雄备战时护胫闪闪发亮。"}]}],"synonyms":["greaves","shin guards","leg armor"],"phonetic":"/ˈniːmɪdiːz/","extraExplanation":["“cnemides”来自希腊语词根（与小腿/胫部有关）。拼写里的 c 通常不发音：开头的 “cn-” 在英语借词中常读作 /n/（类似“cnidarian”）。","这个词多见于考古、古典学、武器与盔甲史等语境；日常英语更常说 “greaves” 或 “shin guards”。"]}
{"word":"cnemidium","summary":{"en":"Cnemidium is a rare word meaning a small shin guard (a type of greave) in ancient armor.","zh":"Cnemidium 是较少见的词，指古代铠甲中的“小腿护胫”（护胫的一种）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small shin guard (a type of greave), especially in ancient Greek or Roman armor","zh":"小腿护胫（护胫的一种），尤指古希腊或古罗马铠甲中的护具"},"examples":[{"en":"The museum displayed a bronze cnemidium used to protect a soldier’s lower leg.","zh":"博物馆展出了一件青铜制的 cnemidium，用来保护士兵的小腿。"},{"en":"In the illustration, the warrior wears a helmet, a shield, and a pair of cnemidia.","zh":"插图中，战士戴着头盔、拿着盾牌，并穿着一对 cnemidia（护胫）。"}]}],"synonyms":["greave","shin guard"],"phonetic":"/nɪˈmɪdiəm/","extraExplanation":["该词较罕见，多见于古典学、考古或武备史语境。词根来自希腊语 knēmē，意为“小腿/胫骨”相关，因此指“护胫”类装备。","更常见的英语说法是 greave(s)（护胫）或 shin guard（护腿板，现代运动中更常用）。"]}
{"word":"Cnemidophorus","summary":{"en":"Cnemidophorus is a scientific genus name historically used for many whiptail lizards; many of those species are now classified as Aspidoscelis.","zh":"Cnemidophorus 是历史上用于许多鞭尾蜥的属名；其中不少物种现多改归 Aspidoscelis。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former (and still sometimes used) scientific genus name for many whiptail lizards in the family Teiidae, found mainly in the Americas.","zh":"（旧用但仍常见的）鞭尾蜥（Teiidae 美洲蜥蜴科）中许多物种曾归属的一个属名，主要分布于美洲。"},"examples":[{"en":"Older field guides may list the desert grassland whiptail under Cnemidophorus.","zh":"较早的野外图鉴可能会把“沙漠草原鞭尾蜥”列在 Cnemidophorus 属下。"},{"en":"In recent scientific papers, many species once called Cnemidophorus are now placed in Aspidoscelis.","zh":"在较新的科研论文中，许多曾称为 Cnemidophorus 的物种已改归 Aspidoscelis（盾趾蜥属）。"}]}],"synonyms":["whiptail lizard (general term)","Aspidoscelis (current genus for many former members)"],"phonetic":"/nəˌmɪdəˈfɔrəs/","extraExplanation":["发音提示：词首的 c 通常不发音，读起来更像以 n 开头。","词源：来自希腊语词根，knēmē（小腿/胫部）+ -phoros（“携带、具有……的”），是一种传统的拉丁化学名构词方式。","分类学背景：现代爬行动物分类中，北美很多“鞭尾蜥”常被从 Cnemidophorus 拆分/转移到 Aspidoscelis；但在旧文献、部分地区名录或较广义用法中仍可能看到 Cnemidophorus。"]}
{"word":"cnemidophorus","summary":{"en":"Cnemidophorus is an older genus name for whiptail lizards, now mostly replaced by Aspidoscelis in modern taxonomy.","zh":"Cnemidophorus 是鞭尾蜥的旧属名，现代分类中多已改用 Aspidoscelis。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former scientific genus name for whiptail lizards (fast-moving lizards found mainly in the Americas), now largely reclassified under the genus Aspidoscelis","zh":"（旧）一种鞭尾蜥的科学属名（主要分布于美洲、行动敏捷的蜥蜴），现多已重新归入 Aspidoscelis 属"},"examples":[{"en":"In older field guides, you may see whiptail lizards listed as Cnemidophorus.","zh":"在较早的野外图鉴里，你可能会看到鞭尾蜥被列为 Cnemidophorus。"},{"en":"The species once called Cnemidophorus tigris is now commonly placed in Aspidoscelis.","zh":"曾被称为 Cnemidophorus tigris 的物种，如今通常被归入 Aspidoscelis。"}]}],"synonyms":["Aspidoscelis (modern classification for many species)"],"phonetic":"/ˌnɛməˈdɑfərəs/","extraExplanation":["这是一个拉丁化的学名（属名），常见于生物分类学文献中。学习时可把它当作“旧称/旧分类”，阅读旧资料特别有用。","现代分类学根据形态与分子证据进行了调整：许多原 Cnemidophorus 的物种在今天更常见的属名是 Aspidoscelis。不同书籍可能因年代与采用的分类体系而用法不同。"]}
{"word":"cnemis","summary":{"en":"Enemy means someone (or something) you oppose or that harms your goals.","zh":"Enemy 指你对抗的敌人/对手，也可指会伤害你或阻碍目标的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or group that you fight against or strongly oppose; an opponent.","zh":"敌人；对手（你与之战斗或强烈反对的人或团体）。"},"examples":[{"en":"In the story, the hero must face his enemies to protect the village.","zh":"在故事里，英雄必须面对敌人来保护村庄。"},{"en":"They were enemies in the competition, but they still respected each other.","zh":"他们在比赛中是对手，但仍然互相尊重。"}]},{"partOfSpeech":"n.","definition":{"en":"Something that harms you or makes success difficult.","zh":"有害之物；阻碍成功的因素。"},"examples":[{"en":"Stress can be an enemy of good sleep.","zh":"压力可能是良好睡眠的敌人。"},{"en":"Laziness is the enemy of progress.","zh":"懒惰是进步的敌人。"}]}],"synonyms":["opponent","rival","adversary","foe"],"phonetic":"/ˈɛnəmi/","extraExplanation":["你输入的“cnemis”不是常见英文单词，最可能是把“enemies”（enemy 的复数）拼错了。正确拼写：enemy（单数），enemies（复数）。","拼写提示：enemy 结尾是 -my；变复数时把 -y 变成 -ies：enemy → enemies。"]}
{"word":"Cneoraceae","summary":{"en":"Cneoraceae: a scientific plant-family name for a small group of flowering shrubs (including Cneorum).","zh":"Cneoraceae：植物学中的“白花木科”科名，指一小类开花灌木（含白花木属）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small plant family (Cneoraceae) of flowering shrubs, including the genus Cneorum, found mainly around the Mediterranean region and nearby areas.","zh":"（植物）白花木科（Cneoraceae）：一类小型被子植物科，主要为灌木，包含白花木属（Cneorum），多分布于地中海及其周边地区。"},"examples":[{"en":"Cneoraceae is a small family of shrubs in the order Sapindales.","zh":"白花木科是无患子目中的一个小型灌木类群。"},{"en":"In some modern classifications, Cneoraceae is discussed alongside related families such as Rutaceae.","zh":"在一些现代分类系统中，白花木科常与芸香科等近缘类群一起讨论。"}]}],"synonyms":["the Cneorum family (informal)","plant family Cneoraceae"],"phonetic":"/ˌniːəˈreɪsiˌiː/","extraExplanation":["这是一个主要用于“植物分类学/系统学”的拉丁化学名（科名），一般不会出现在日常英语对话中，更常见于植物志、学术论文、标本标签与植物百科全书。","词尾 -aceae 是植物“科名”的常见后缀（如 Rosaceae 蔷薇科、Fabaceae 豆科），看到这个后缀通常就能判断它指的是一个“科”。","不同分类系统可能会对该科的范围与归属有调整；阅读资料时可留意其是否被并入或与某些近缘科放在一起讨论。"]}
{"word":"cneoraceae","summary":{"en":"Cneoraceae is a botanical term for a small family of flowering shrubs, sometimes classified within Rutaceae.","zh":"Cneoraceae（苦内罗木科）是植物学术语，指一个较小的开花植物科，部分分类体系会将其并入芸香科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small family of flowering plants (the Cneoraceae), consisting of a few shrub species; sometimes treated as part of the rue family (Rutaceae) in modern classification.","zh":"苦内罗木科（Cneoraceae）：一个较小的被子植物科，主要由少数灌木物种组成；在一些现代分类体系中常被并入芸香科（Rutaceae）。"},"examples":[{"en":"Cneoraceae is a small plant family that includes shrubs adapted to Mediterranean climates.","zh":"苦内罗木科是一个较小的植物科，其中包含适应地中海气候的灌木。"},{"en":"Some botanists place Cneoraceae within Rutaceae based on genetic evidence.","zh":"一些植物学家根据遗传证据把苦内罗木科归入芸香科。"}]}],"synonyms":["Cneorum family (informal)"],"phonetic":"/niːˌɔːrəˈeɪsiːeɪ/","extraExplanation":["这是一个偏专业的植物分类名，日常英语里很少出现，多见于植物学论文、植物志或分类数据库（如APG体系相关资料）。","词尾“-aceae”是植物科名的常见拉丁化后缀（表示“……科”），因此看到类似拼写时，通常可以判断它是一个“植物科”的名称。"]}
{"word":"Cneoraceae-related","summary":{"en":"Associated with the plant family Cneoraceae.","zh":"与海桐花科（Cneoraceae）有关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with, belonging to, or scientifically associated with the plant family Cneoraceae.","zh":"与芸香目中的海桐花科（Cneoraceae，学名）有关的；属于或涉及海桐花科的。"},"examples":[{"en":"Researchers compared Cneoraceae-related species with nearby Rutaceae plants to clarify their evolutionary history.","zh":"研究人员将与海桐花科相关的物种与附近的芸香科植物进行比较，以澄清它们的进化历史。"},{"en":"This herbarium folder contains Cneoraceae-related specimens collected from Mediterranean islands.","zh":"这个植物标本馆夹册里收录了来自地中海岛屿的海桐花科相关标本。"}]}],"synonyms":["cneoraceous","Cneoraceae-associated","Cneoraceae-connected"],"phonetic":"/ˌniːoʊˈreɪsi.i rɪˈleɪtɪd/","extraExplanation":["“Cneoraceae”是一个植物科名，常见于分类学、系统发育（亲缘关系）与植物区系研究中；日常英语里很少使用。","在学术写作里，“X-related”常用来表示“与X有关/相关”，不一定表示“属于X（同一分类群）”，有时只是研究主题、特征或数据与之相关。若要表达“属于该科”，也可用形容词“cneoraceous（海桐花科的）”，但使用频率较低。"]}
{"word":"cneoraceous","summary":{"en":"A rare botanical adjective meaning “related to Cneoraceae/Cneorum.”","zh":"一个罕见的植物学形容词，意思是“与鼠李叶木科/鼠李叶木属有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Relating to the plant family Cneoraceae or to plants of the genus Cneorum; cneoraceous plants are typically shrubs found in Mediterranean-type regions.","zh":"（植物学）与鼠李叶木科（Cneoraceae）或鼠李叶木属（Cneorum）的植物有关的；通常指生长在地中海型气候地区的灌木类植物。"},"examples":[{"en":"The cneoraceous shrubs in this area are adapted to dry summers.","zh":"这一带的鼠李叶木科灌木适应了干燥的夏季。"},{"en":"Some field guides mention cneoraceous species when describing Mediterranean coastal vegetation.","zh":"一些野外植物图鉴在介绍地中海沿海植被时会提到鼠李叶木科的物种。"}]}],"synonyms":["Cneoraceae-related","Cneorum-related","(more general) botanical"],"phonetic":"/ˌniːəˈreɪʃəs/","extraExplanation":["这是一个非常少见的“植物分类学形容词”，多出现在学术论文、植物志或较专业的植物图鉴中，日常英语里几乎不会用到。","词形结构上常见于“某某科/属 + -aceous（……的）”，例如 rosaceous（蔷薇科的）。因此 cneoraceous = Cneorum/Cneoraceae + -aceous。","你输入的拼写 cneoraceous 很可能正确，但它确实罕见；若你原本想查的是其他更常见的词（比如 “ceraceous/igneous/corneous”等），也可以把上下文句子发我，我可以帮你确认。"]}
{"word":"Cneorum","summary":{"en":"Cneorum is a botanical genus name for certain Mediterranean evergreen shrubs.","zh":"Cneorum 是植物学上的属名，指地中海地区的一类常绿灌木。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small genus of evergreen shrubs (family Rutaceae), especially Cneorum tricoccon, native to the Mediterranean region.","zh":"一种常绿灌木属名（芸香科），以地中海地区的“三籽香叶木”（Cneorum tricoccon）最常见。"},"examples":[{"en":"The garden label read “Cneorum tricoccon,” an evergreen shrub from the Mediterranean.","zh":"花园的标签写着“Cneorum tricoccon”，一种来自地中海的常绿灌木。"},{"en":"In a plant guide, Cneorum is listed among drought-tolerant shrubs for coastal climates.","zh":"在植物百科中，Cneorum 被列为适合海岸气候、耐旱的灌木之一。"}]}],"synonyms":["(no common English synonym; usually used as a Latin genus name)"],"phonetic":"/ˈniːoʊrəm/","extraExplanation":["“Cneorum”主要出现在植物学、园艺与拉丁学名系统中，日常英语里很少单独使用。","发音在英语中常按拉丁学名的读法读作“NEE-oh-rum”。如果你指的是某个具体物种，常见写法是 Cneorum tricoccon（意为“三个果室/三籽”的香叶木）。"]}
{"word":"cneorum","summary":{"en":"Cneorum is a botanical genus name for small evergreen shrubs, mainly used in gardening and plant science.","zh":"Cneorum 是植物学属名，指一类常绿小灌木，主要用于园艺与植物学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small evergreen shrubs grown as ornamental plants (for example, in Mediterranean-style gardens).","zh":"一种常绿小灌木的属名，常作为观赏植物栽培（如地中海风格花园中）。"},"examples":[{"en":"Cneorum is often planted for its tidy shape and evergreen leaves.","zh":"Cneorum 常因株形整齐、四季常绿而被种植。"},{"en":"In a dry, sunny garden, Cneorum can be a good low-shrub choice.","zh":"在干燥、阳光充足的花园里，Cneorum 可能是不错的低矮灌木选择。"}]}],"synonyms":["genus name","botanical name"],"phonetic":"/ˈniːərəm/","extraExplanation":["“Cneorum”主要出现在植物学与园艺语境中，属于拉丁化的学名（属名），日常英语里不常见，通常需要首字母大写（Cneorum）。","不同地区的园艺资料可能会把它与近缘或旧分类的名称一起提到；如果你是在某本书、植物标签或论文里看到它，给出上下文能更准确判断具体指哪一种。"]}
{"word":"Cneorum-related","summary":{"en":"“Cneorum-related” means connected with the plant genus Cneorum, used mainly in scientific or botanical contexts.","zh":"“Cneorum-related”指“与植物属 Cneorum 有关的”，主要用于植物学或科研语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with the plant genus Cneorum (a small group of shrubs sometimes called spurge-olives), especially in botanical description or research.","zh":"与植物属 Cneorum（少数灌木类植物，有时俗称“spurge-olive/大戟橄榄”）有关的；多用于植物学描述或研究。"},"examples":[{"en":"The paper discusses several Cneorum-related species found in coastal habitats.","zh":"这篇论文讨论了几种在海岸生境中发现的与 Cneorum 有关的物种。"},{"en":"We collected Cneorum-related samples to compare leaf structure under the microscope.","zh":"我们采集了与 Cneorum 有关的样本，用显微镜比较叶片结构。"},{"en":"A Cneorum-related compound was identified during the chemical analysis of the plant extract.","zh":"在对植物提取物进行化学分析时，鉴定出一种与 Cneorum 有关的化合物。"}]}],"synonyms":["Cneorum-associated","Cneorum-linked","spurge-olive-related"],"phonetic":"/niˈɔrəm/","extraExplanation":["“Cneorum-related”是由属名 Cneorum + related 组合而成的学术写法，常见于植物分类、生态与天然产物（植物化学）等语境中。","Cneorum 通常指一个小型植物属（如 Cneorum tricoccon），分布多与地中海地区有关；不同分类系统中其科级归属可能会有调整，因此写作时常用“Cneorum-related”来保持表述中性、聚焦于“与该属有关”。"]}
{"word":"cneowlian","summary":{"en":"“cneowlian” doesn’t appear to be a standard English word; please provide context or the intended spelling.","zh":"“cneowlian”看起来不是标准英语单词；请提供上下文或你想输入的正确拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not recognized as a standard English word. It may be a misspelling, a name, or a made-up term.","zh":"这不是常见的英语单词；可能是拼写错误、人名/地名，或自造词。"},"examples":[{"en":"I couldn’t find “cneowlian” in a dictionary—could you check the spelling or share the sentence it’s in?","zh":"我在词典里找不到“cneowlian”——你能检查一下拼写，或把它所在的句子发我吗？"},{"en":"If you meant a different word, try typing it again (for example, it might be missing or swapping letters).","zh":"如果你想查的是另一个词，请再输入一次（例如可能有字母缺失或顺序颠倒）。"}]}],"extraExplanation":["你可以告诉我以下信息，我就能更准确地帮你：\n1）它出现在哪句话/哪段文字里（上下文）；\n2）你是从哪里看到的（书、游戏、聊天、作业等）；\n3）你想表达的大概意思或中文意思。\n\n另外也可能是“拼写打乱/键盘误触”。把你认为正确的几种拼法都发来，我可以帮你逐个匹配最可能的英文单词。"]}
{"word":"CNES","summary":{"en":"CNES is France’s national space agency.","zh":"CNES 是法国国家航天局。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"the French national space agency (Centre National d’Études Spatiales), responsible for France’s civil space program and many satellite, launch, and space research projects","zh":"法国国家航天局（法语：Centre National d’Études Spatiales，简称 CNES），负责法国的民用航天计划以及许多卫星、发射与空间研究项目"},"examples":[{"en":"CNES works with ESA on several European space missions.","zh":"CNES 与欧洲航天局（ESA）在多个欧洲航天任务上合作。"},{"en":"The satellite was developed by CNES in partnership with universities and industry.","zh":"这颗卫星由 CNES 与大学及产业伙伴合作研发。"},{"en":"According to CNES, the mission aims to improve Earth observation for climate science.","zh":"根据 CNES 的说法，该任务旨在提升用于气候科学的地球观测能力。"}]}],"synonyms":["Centre National d’Études Spatiales"],"phonetic":"/siː ɛn iː ɛs/","extraExplanation":["CNES 通常读作字母缩写（C-N-E-S）。其法语全称是“Centre National d’Études Spatiales”。","CNES 是法国在航天领域的重要机构，常参与欧洲层面的项目（例如与 ESA 合作），也会与 NASA 等机构在科学载荷、地球观测与深空探测等方面协作。","在新闻或学术文章里，CNES 常作为“机构署名”出现，用于表示发布数据、提出计划或参与研制。"]}
{"word":"CNI","summary":{"en":"CNI is an acronym most commonly meaning “Critical National Infrastructure,” but it can also refer to other organizations or indexes depending on context.","zh":"CNI是一个缩写，最常见指“关键国家基础设施”，但也可能因语境不同而指其他机构或索引。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(acronym) Critical National Infrastructure: essential systems and services a country relies on, such as power grids, water supply, transport, banking, and telecommunications.","zh":"（缩写）关键国家基础设施：国家赖以运转的重要系统与服务，如电网、供水、交通、金融与通信等。"},"examples":[{"en":"Hospitals depend on CNI like electricity and telecommunications.","zh":"医院依赖电力和通信等关键国家基础设施（CNI）。"},{"en":"The government introduced new rules to protect CNI from cyberattacks.","zh":"政府出台新规以保护关键国家基础设施（CNI）免受网络攻击。"}]},{"partOfSpeech":"other","definition":{"en":"(acronym) Conseil National de l’Information / National Information Council (used in some Francophone or bilingual contexts): an organization connected to national-level information policy or media oversight.","zh":"（缩写）国家信息委员会（在部分法语或双语语境中使用）：与国家层面的信息政策或媒体监管相关的机构。"},"examples":[{"en":"The report was submitted to the CNI for review.","zh":"该报告已提交给CNI审查。"},{"en":"CNI guidelines focus on information access and transparency.","zh":"CNI的指导方针侧重信息获取与透明度。"}]},{"partOfSpeech":"other","definition":{"en":"(acronym) Common Name Index (less common): a list used to map everyday names to official terms (often in databases or reference tools).","zh":"（缩写）常用名索引（较少见）：用于将日常名称对应到正式术语的索引（常见于数据库或检索工具）。"},"examples":[{"en":"Search the CNI to find the official term used in the system.","zh":"在常用名索引（CNI）中查询，以找到系统使用的正式术语。"}]}],"synonyms":["critical infrastructure","national infrastructure"],"phonetic":"/ˌsiː ɛn ˈaɪ/","extraExplanation":["“CNI”在英语里通常是一个缩写，而不是固定单词，具体含义高度依赖领域与国家/机构背景。最常见的用法之一是英国安全与政策语境中的“Critical National Infrastructure”。如果你告诉我你在哪篇文章/哪个行业里看到它（例如网络安全、政府文件、医疗、数据库），我可以帮你确定最准确的释义。"]}
{"word":"cnibophore","summary":{"en":"A cnidophore is a stinging cell/structure in jellyfish-like animals that holds or bears stinging capsules for prey capture and defense.","zh":"cnidophore 指刺细胞动物体内用于捕食和防御、含有或携带刺丝囊的刺细胞/刺器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology) A stinging cell or structure in cnidarians (like jellyfish and sea anemones) that contains or bears a stinging capsule (a nematocyst) used for capturing prey or defense.","zh":"（动物学）刺细胞动物（如水母、海葵）体内含有或携带刺丝囊（nematocyst）的刺细胞/刺器，用于捕食或防御。"},"examples":[{"en":"Jellyfish use cnidophores to sting prey and protect themselves.","zh":"水母用 cnidophores 来刺伤猎物并保护自己。"},{"en":"Under the microscope, the cnidophore can release a tiny harpoon-like thread.","zh":"在显微镜下，cnidophore 能释放出像微型鱼叉一样的丝状结构。"}]}],"synonyms":["cnidocyte","stinging cell"],"phonetic":"/ˈnaɪdəˌfɔr/","extraExplanation":["你输入的“cnibophore”很可能是“cnidophore”的拼写误差：cnid- 来自希腊语，和“刺”（stinging）有关；-phore 表示“携带/承载”。","相关常见术语：nematocyst（刺丝囊，真正“发射”的囊体）、cnidocyte（刺细胞，现代生物学更常用的说法）。不同教材或旧文献可能用词略有差异。"]}
{"word":"cnicin","summary":{"en":"A cynic is someone who distrusts people’s motives and doubts sincere goodness.","zh":"cynic 指愤世嫉俗的人：不信任他人动机、怀疑真诚善意。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who believes people are mostly motivated by selfishness and who doubts that sincere goodness exists","zh":"犬儒主义者；愤世嫉俗的人（认为人多半出于自私动机，怀疑真诚善意）"},"examples":[{"en":"He’s a cynic who thinks every act of kindness hides a personal benefit.","zh":"他很愤世嫉俗，觉得每一次善举背后都藏着个人利益。"},{"en":"Don’t be a cynic—sometimes people help simply because they care.","zh":"别那么犬儒——有时人们帮助别人只是因为在乎。"},{"en":"After years of bad experiences, she became a bit of a cynic about politics.","zh":"经历多年糟糕的事情后，她对政治变得有点愤世嫉俗。"}]}],"synonyms":["skeptic","doubter","pessimist"],"phonetic":"/ˈsɪnɪk/","extraExplanation":["你输入的“cnicin”不是常见英文单词，最可能是想写 **cynic**（犬儒主义者/愤世嫉俗的人）或相关词 **cynical**（adj. 愤世嫉俗的）/ **cynicism**（n. 犬儒主义）。","词源小背景：**cynic** 来自古希腊“犬儒学派”（Cynics），他们主张简朴生活、怀疑社会虚伪；现代英语里更多指“总爱怀疑别人动机、不太相信真诚善意的人”。","语感提示：**cynic/cynical** 常带负面色彩；如果只是“现实、不天真”，更中性的说法可以用 **realistic**（现实的）。"]}
{"word":"Cnicus","summary":{"en":"Cnicus is an old botanical genus name for some thistles, now mostly treated under Carduus and related genera.","zh":"Cnicus 是某些蓟类植物的旧属名，如今多已归入 Carduus 等相关属。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former genus name for certain thistles (plants with prickly leaves and purple or pink flower heads), now usually classified in the genus Carduus and related groups","zh":"（旧）某些蓟类植物的属名（叶有刺、花多为紫色或粉红色），如今多被重新归入苍术蓟属（Carduus）等相关分类"},"examples":[{"en":"In older field guides, you may see some thistles listed under Cnicus rather than Carduus.","zh":"在较旧的野外图鉴里，你可能会看到一些蓟被写作 Cnicus，而不是 Carduus。"},{"en":"The label read “Cnicus,” but the modern database updated it to a Carduus species.","zh":"标签上写着“Cnicus”，但现代数据库把它更新为苍术蓟属（Carduus）的一个物种。"}]}],"synonyms":["thistle","Carduus"],"phonetic":"/ˈnaɪkəs/","extraExplanation":["“Cnicus”主要出现在植物学的旧文献或旧标本标签中；日常英语里更常用的普通词是“thistle（蓟）”。","词源来自希腊语，和“safflower（红花）/thistle（蓟）”相关的古词根有关；在分类学发展过程中，许多旧属名会被并入或拆分到新的属名中。"]}
{"word":"cnicus","summary":{"en":"Cnicus is an older botanical genus name for some thistle-like plants; many species have been reclassified under other genera in modern taxonomy.","zh":"Cnicus 是较旧的蓟类植物属名；在现代分类中，许多物种已改归其他近缘属。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus name used in botany for certain thistle-like plants (in the daisy family); in many modern classifications, some species once placed in Cnicus are classified under related genera such as Cirsium (true thistles).","zh":"（植物学）曾用于指某些“蓟”类植物的属名（菊科）；在较新的分类中，许多原归入 Cnicus 的物种常被划入近缘属，例如 Cirsium（真蓟属）。"},"examples":[{"en":"In older field guides, you may see some thistles labeled as Cnicus.","zh":"在较早的野外图鉴里，你可能会看到一些蓟被标为 Cnicus。"},{"en":"The species once called Cnicus benedictus is often treated as Centaurea benedicta today.","zh":"过去称为 Cnicus benedictus 的物种，如今常被处理为 Centaurea benedicta。"}]}],"synonyms":["thistle","Cirsium (in many modern classifications)","Centaurea (for some formerly included species)"],"phonetic":"/ˈnaɪkəs/","extraExplanation":["Cnicus 来自拉丁化的学名，源头可追溯到希腊语词根，和“带刺、蓟类植物”有关。","在生物分类里，属名会因研究（形态、基因证据等）而调整，所以你可能在不同资料中看到同一植物的不同学名（旧名/异名）。","如果你是在药草或园艺语境里遇到它，建议同时查该物种的现行学名（例如 Cirsium 或 Centaurea），以免对照资料时混淆。"]}
{"word":"cnida","summary":{"en":"“cnida” is not a recognized English word; it’s probably a misspelling (e.g., “Canada” or “Candida”).","zh":"“cnida”不是英语单词；很可能是拼写错误（如“Canada”或“Candida”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a typo or a mistyped form of another word or name.","zh":"不是标准英语单词，可能是拼写错误或误打了其他单词/名字。"},"examples":[{"en":"“cnida” doesn’t appear in standard English dictionaries—could you check the spelling?","zh":"“cnida”在常见英语词典里查不到——你能否检查一下拼写？"},{"en":"If you meant “Canada,” the spelling is C-A-N-A-D-A.","zh":"如果你想写“Canada（加拿大）”，拼写是 C-A-N-A-D-A。"}]}],"synonyms":["(possible intended word) Canada","(possible intended word) Candida","(possible intended word) cinder"],"phonetic":"N/A","extraExplanation":["“cnida”常见原因是键盘误按或字母顺序打乱。你可能想输入：\n1) Canada（加拿大）\n2) cinder（煤渣；灰烬）\n3) Candida（念珠菌；也可作人名）\n如果你告诉我它出现的句子/语境（聊天、作业、医学、地名等），我可以更准确判断。"]}
{"word":"cnidae","summary":{"en":"Cnidae are the plural form of cnida—stinging structures in cnidarians like jellyfish.","zh":"Cnidae 是 cnida 的复数，指水母等刺胞动物体内用于蜇刺的微小刺结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of cnida: the tiny stinging structures (stinging capsules/organelles) used by jellyfish, sea anemones, and other cnidarians to capture prey or defend themselves","zh":"cnida 的复数：刺胞动物（如水母、海葵等）用来捕食或防御的微小“刺细胞/刺丝囊”等刺针结构（刺器官）"},"examples":[{"en":"Jellyfish tentacles contain many cnidae that can sting humans.","zh":"水母的触手里有大量 cnidae，可能会刺伤人。"},{"en":"Under the microscope, the researcher counted the cnidae on the tentacle surface.","zh":"在显微镜下，研究人员统计了触手表面的 cnidae 数量。"}]}],"synonyms":["stinging capsules","nematocysts (common type)"],"phonetic":"ˈnaɪdiː","extraExplanation":["“cnidae”主要出现在生物学/海洋生物学语境中，日常英语里很少用。更常见的相关词是 cnidocyte（刺细胞）和 nematocyst（刺丝囊，一种常见的刺器）。","词源来自希腊语，和“荨麻/刺”的概念有关；因此 cnidae 指的就是能“刺/蜇”的微结构。"]}
{"word":"cnidae-bearing","summary":{"en":"Cnidae-bearing means having stinging cells/structures (cnidae), as in jellyfish or sea anemones.","zh":"Cnidae-bearing 指“具有刺器/刺细胞结构（cnidae）的”，如水母、海葵等。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology) Having cnidae (stinging cells/structures) used for defense or catching prey, typical of animals like jellyfish and sea anemones.","zh":"（生物）具有刺细胞／刺丝囊等“刺器”（cnidae），用于防御或捕食；常见于水母、海葵等刺胞动物。"},"examples":[{"en":"Jellyfish are cnidae-bearing animals that can sting when touched.","zh":"水母是具有刺器（cnidae）的动物，触碰时可能会蜇人。"},{"en":"The cnidae-bearing tentacles help the sea anemone capture small fish.","zh":"海葵带刺器的触手能帮助它捕捉小鱼。"}]}],"synonyms":["cnidiferous","stinging-celled"],"phonetic":"/ˈnaɪ.diː ˌbɛrɪŋ/","extraExplanation":["“cnidae-bearing”是一个生物学形容词，多用于学术写作。cnidae（单数 cnida）指刺胞动物体内的刺细胞/刺丝囊相关结构（常见术语：nematocyst）。它们能“发射”刺丝并释放毒素，用于捕食或防御。","相关更常见或更学术的近义表达包括：cnidiferous（有刺器的）、stinging-celled（有刺细胞的）。"]}
{"word":"cnidae-producing","summary":{"en":"“Cnidae-producing” means able to produce cnidae—stinging capsules found in animals like jellyfish and sea anemones.","zh":"“cnidae-producing”指能产生刺丝囊（刺胞动物如水母、海葵用于蜇刺、防御与捕食的微小囊状结构）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology) Producing cnidae—stinging capsules (such as nematocysts) used by cnidarians (e.g., jellyfish, sea anemones) for defense and catching prey.","zh":"（生物）产生刺丝囊（cnidae）——一种带刺的微小囊状结构（如刺丝囊/刺细胞囊 nematocyst），刺胞动物（如水母、海葵）用来防御和捕食。"},"examples":[{"en":"Jellyfish are cnidae-producing animals that can sting when touched.","zh":"水母是会产生刺丝囊的动物，触碰时可能会蜇人。"},{"en":"The researchers examined cnidae-producing cells under a microscope.","zh":"研究人员在显微镜下观察了产生刺丝囊的细胞。"}]}],"synonyms":["cnidocyst-producing","nematocyst-producing","cnidocyst-forming"],"phonetic":"ˈnaɪdi prəˈdusɪŋ","extraExplanation":["“cnidae-producing”是由“cnidae（刺丝囊的复数形式）+ producing”构成的科技写作复合形容词，常见于动物学/细胞生物学论文或科普材料中。","cnidae通常存在于刺细胞（cnidocytes）内；其中最常被提到的类型是nematocysts（刺丝囊/刺囊），用于发射带倒钩的丝状结构并释放毒素。"]}
{"word":"Cnidaria","summary":{"en":"Cnidaria is the animal phylum that includes jellyfish, corals, sea anemones, and hydras, characterized by stinging cells.","zh":"Cnidaria 指刺胞动物门，包括水母、珊瑚、海葵、水螅等，特点是具有刺细胞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group (phylum) of aquatic animals such as jellyfish, corals, sea anemones, and hydras, known for having stinging cells used to catch prey and defend themselves","zh":"刺胞动物门：一类水生动物（一个“门”级分类），包括水母、珊瑚、海葵和水螅等，其特点是具有用来捕食和防御的刺细胞"},"examples":[{"en":"Jellyfish belong to the phylum Cnidaria.","zh":"水母属于刺胞动物门（Cnidaria）。"},{"en":"Coral reefs are built by cnidarians that produce hard skeletons.","zh":"珊瑚礁由能分泌坚硬骨骼的刺胞动物构建。"}]}],"synonyms":["the phylum Cnidaria","cnidarians"],"phonetic":"/naɪˈdɛriə/","extraExplanation":["读音提示：词首的“C”通常不发音，常读作“Nidaria”。","词源与命名：Cnidaria 来自希腊语 knidē（意为“荨麻”），指它们“刺痛”的感觉；这一点与它们的刺细胞（cnidocytes）有关。","学习延伸：中文里常见译名是“刺胞动物门”，以前也有人称“腔肠动物”，但现代分类更常用“刺胞动物”。"]}
{"word":"cnidaria","summary":{"en":"Cnidaria is the animal group that includes jellyfish, corals, and sea anemones, known for their stinging cells.","zh":"Cnidaria 指刺胞动物门，包括水母、珊瑚、海葵等，以具有刺细胞为特征。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group (phylum) of simple sea animals that have stinging cells (like jellyfish, corals, and sea anemones).","zh":"刺胞动物门：一类结构较简单的海洋动物，具有能刺伤猎物或防御的“刺细胞”（如水母、珊瑚、海葵等）。"},"examples":[{"en":"Jellyfish belong to Cnidaria.","zh":"水母属于刺胞动物门。"},{"en":"Corals are cnidarians that build reefs over long periods of time.","zh":"珊瑚是刺胞动物门的动物，能在很长时间里形成珊瑚礁。"}]}],"synonyms":["coelenterates (older term)"],"phonetic":"/naɪˈdɛriə/","extraExplanation":["“Cnidaria”来自希腊语 knidē（意为“荨麻”），指它们的刺细胞带来类似“被荨麻蜇到”的刺痛感。","生物课里常会提到刺胞动物的两个常见形态：水螅体（polyp，如海葵）和水母体（medusa，如水母）。不同种类可能以其中一种形态为主，或在生命周期中交替出现。","旧称 coelenterates（腔肠动物）有时在老教材中出现，但现代分类更常用 Cnidaria。"]}
{"word":"cnidarian","summary":{"en":"A cnidarian is a sea animal like a jellyfish, coral, or sea anemone, known for its stinging cells.","zh":"cnidarian 指刺胞动物，如水母、珊瑚或海葵，以“刺细胞”著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sea animal in the group that includes jellyfish, corals, and sea anemones; it has stinging cells (used to catch prey or defend itself) and usually a simple body shape","zh":"刺胞动物；一类海洋动物，包括水母、珊瑚和海葵等；具有用来捕食或防御的刺细胞，身体结构通常较简单"},"examples":[{"en":"A jellyfish is a cnidarian with stinging cells in its tentacles.","zh":"水母是一种刺胞动物，它的触手上有刺细胞。"},{"en":"Coral reefs are built by tiny cnidarians living in large colonies.","zh":"珊瑚礁是由大量群体生活的微小刺胞动物建造出来的。"}]}],"synonyms":["coelenterate (older term)"],"phonetic":"/naɪˈdɛriən/","extraExplanation":["读音与词源：cnidarian 来自希腊语 knidē（意为“荨麻”），因为刺胞动物的刺细胞会造成类似被荨麻蜇到的刺痛感。","学习提示：在生物学语境中常与 stinging cells（刺细胞）、tentacles（触手）、jellyfish/coral/sea anemone（水母/珊瑚/海葵）一起出现。"]}
{"word":"cnidarians","summary":{"en":"Cnidarians are marine animals like jellyfish, anemones, and corals that have stinging cells.","zh":"Cnidarians 指水母、海葵、珊瑚等具有刺细胞的海洋动物（刺胞动物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group (phylum) of mostly marine animals with soft bodies and stinging cells, including jellyfish, sea anemones, and corals.","zh":"刺胞动物门：一类多为海洋生活的软体动物，具有能刺人的刺细胞，包括水母、海葵和珊瑚等。"},"examples":[{"en":"Jellyfish and sea anemones are cnidarians.","zh":"水母和海葵都是刺胞动物。"},{"en":"Many cnidarians use stinging cells to catch prey and defend themselves.","zh":"许多刺胞动物会用刺细胞来捕食并自我防御。"},{"en":"Coral reefs are built by tiny cnidarians that live in large colonies.","zh":"珊瑚礁是由群体生活的微小刺胞动物建造的。"}]}],"synonyms":["coelenterates (older term)"],"phonetic":"/naɪˈdɛriənz/","extraExplanation":["“cnidarians”是复数形式；单数是“cnidarian”。","词源来自希腊语“knidē”（意为“荨麻/刺”），对应它们会“刺”的特征。","刺胞动物的关键特征是“刺细胞”（cnidocytes），其中的刺丝囊（nematocysts）能像小鱼叉一样快速弹出。"]}
{"word":"Cnidean","summary":{"en":"Cnidean means “from or related to ancient Cnidus/Knidos,” and can also mean a person from there.","zh":"Cnidean 指“来自或与古希腊克尼都斯/Knidos 有关的”，也可指“克尼都斯人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Cnidus (also spelled Knidos), an ancient Greek city in Caria (in today’s southwestern Turkey), or to its people, culture, or art.","zh":"与克尼都斯（也拼作 Knidos，古希腊卡里亚地区的一座城邦，今土耳其西南部）及其居民、文化或艺术有关的。"},"examples":[{"en":"The museum displayed a Cnidean inscription dating to the fourth century BCE.","zh":"博物馆展出了一块可追溯至公元前四世纪的克尼都斯铭文。"},{"en":"Scholars compare Cnidean pottery with Attic styles to track trade routes.","zh":"学者将克尼都斯陶器与阿提卡风格进行比较，以追踪贸易路线。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from ancient Cnidus/Knidos; a Cnidian.","zh":"克尼都斯人；来自（古）克尼都斯/Knidos 的人。"},"examples":[{"en":"Ancient writers mention a Cnidean who donated to a sanctuary.","zh":"古代作者提到一位克尼都斯人向圣所捐献。"}]}],"synonyms":["Cnidian","Knidian","of Cnidus","of Knidos"],"phonetic":"naɪˈdiːən","extraExplanation":["“Cnidean”来自古希腊地名 Κνίδος（Knidos）。英语里常见两种拼法：Cnidean（以拉丁化拼写保留开头的 c）与 Cnidian（更常见的变体）；意思基本相同。","词首的 c 在英语读音中通常不发音，这类拼写常见于古典学术语（如 Cnidus/Knidos）。","在艺术史语境中，它常让人联想到著名的《克尼都斯的阿佛洛狄忒》（Aphrodite of Knidos，普拉克西特列斯作品/传为其作），因此在讨论古希腊雕塑与审美时也会出现。"]}
{"word":"Cnidia","summary":{"en":"Cnidia are the stinging capsules/structures in jellyfish and other cnidarians (plural of cnidium).","zh":"Cnidia 指水母等刺胞动物体内用于蜇刺的刺囊/刺细胞器（cnidium 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the stinging structures (tiny capsules) found in cnidarians (such as jellyfish, sea anemones, and corals); plural of cnidium","zh":"刺胞动物（如水母、海葵、珊瑚）体内的刺丝囊/刺胞等“刺细胞器”；cnidium 的复数"},"examples":[{"en":"Jellyfish use cnidia to sting and capture prey.","zh":"水母会用 cnidia 来蜇刺并捕捉猎物。"},{"en":"Under a microscope, you can see cnidia inside the cells of a sea anemone.","zh":"在显微镜下，你能看到海葵细胞中的 cnidia。"}]}],"synonyms":["stinging capsules","stinging organelles","cnidae"],"phonetic":"/ˈnaɪdiə/","extraExplanation":["发音提示：c 在 cn- 开头的词里通常不发音（类似 knife 里的 k 不发音），所以读作以 /n/ 开头。","相关词：cnidarian（刺胞动物，指整类动物）；cnidocyte（刺细胞，指“带有刺囊的细胞”）。cnidia/cnidium 更强调“刺的器官/囊”本身。"]}
{"word":"Cnidian","summary":{"en":"“Cnidian” means “from or related to Cnidus (Knidos),” an ancient Greek city; it can also mean a person from there.","zh":"“Cnidian”指“克尼多斯（Knidos）这一古希腊城市的/与之相关的”，也可指“克尼多斯人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Cnidus (also spelled Knidos), an ancient Greek city in Caria (in today’s southwestern Turkey).","zh":"与克尼多斯（亦作 Knidos，古希腊城市，位于今土耳其西南部）有关的；克尼多斯的。"},"examples":[{"en":"The museum displays a Cnidian inscription from the 4th century BCE.","zh":"博物馆展出了一块公元前4世纪的克尼多斯铭文。"},{"en":"Scholars compare Cnidian and Rhodian trade networks in the Aegean.","zh":"学者们比较克尼多斯与罗德岛在爱琴海的贸易网络。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Cnidus; an inhabitant or citizen of ancient Cnidus.","zh":"克尼多斯人；古克尼多斯的居民/公民。"},"examples":[{"en":"Ancient sources mention a Cnidian who dedicated a statue at Delphi.","zh":"古代文献提到一位克尼多斯人在德尔斐供奉了一尊雕像。"}]}],"synonyms":["Knidian","of Cnidus"],"phonetic":"/ˈnɪdiən/","extraExplanation":["“Cnidian”常见于历史、考古、艺术史语境。最著名的相关文化点之一是古希腊雕塑《克尼多斯的阿佛洛狄忒》（Aphrodite of Cnidus），常被用来讨论古典艺术中的人体表现。","拼写上你也会看到“Knidian/Knidos”。这是因为希腊语转写习惯不同：字母组合“Cn-”在英语里通常读作以 /n/ 开头（c 不发音）。"]}
{"word":"cnidian","summary":{"en":"“Cnidian” means a cnidarian, or something related to cnidarians such as jellyfish and corals.","zh":"“cnidian”指刺胞动物（如水母、珊瑚、海葵），也可作形容词表示“刺胞动物的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cnidarian; an animal from the group that includes jellyfish, corals, and sea anemones","zh":"刺胞动物；刺胞动物门的动物（如水母、珊瑚、海葵）"},"examples":[{"en":"Jellyfish are cnidians with stinging cells used for catching prey.","zh":"水母是刺胞动物，具有用来捕食的刺细胞。"},{"en":"Many reef-building corals are cnidians that live in colonies.","zh":"许多造礁珊瑚属于刺胞动物，常以群体形式生活。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to cnidarians (jellyfish, corals, sea anemones)","zh":"刺胞动物的；与水母、珊瑚、海葵等刺胞动物有关的"},"examples":[{"en":"Researchers studied cnidian venom to understand how stings affect humans.","zh":"研究人员研究刺胞动物的毒液，以了解蜇伤如何影响人类。"},{"en":"The aquarium has a cnidian exhibit featuring anemones and corals.","zh":"水族馆有一个刺胞动物展区，展示海葵和珊瑚。"}]}],"synonyms":["cnidarian"],"phonetic":"/ˈnaɪdiən/","extraExplanation":["“Cnidian”在日常英语里比较少见，更常见的形式是“cnidarian”（n./adj.）。“cnid-”来自希腊语，和“刺、针”有关，指这类动物具有会“蜇人”的刺细胞（英语常说 stinging cells）。"]}
{"word":"cnidoblast","summary":{"en":"A cnidoblast is a developing stinging-cell type in jellyfish and related animals, forming the capsule used for stinging.","zh":"cnidoblast 指刺胞动物体内发育中的刺细胞前体，可形成用于刺击的刺丝囊结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a specialized cell in cnidarians (such as jellyfish, sea anemones, and corals) that develops into a stinging cell containing a capsule (a cnidocyst) used for defense or catching prey.","zh":"刺胞动物（如水母、海葵、珊瑚）体内的一种特化细胞，会发育成含有“刺丝囊/刺胞囊”（cnidocyst）的刺细胞，用于防御或捕食。"},"examples":[{"en":"Jellyfish tentacles contain many cnidoblasts that help them capture small fish.","zh":"水母的触手里有许多刺细胞母细胞（cnidoblast），帮助它们捕捉小鱼。"},{"en":"In class, we learned that a cnidoblast can form a cnidocyst with a tiny harpoon-like thread.","zh":"课堂上我们学到，刺细胞母细胞（cnidoblast）能形成刺丝囊（cnidocyst），里面有像小鱼叉一样的丝。"}]}],"synonyms":["cnidocyte (related; mature form)","stinging cell (general)"],"phonetic":"/ˈnaɪdəˌblæst/","extraExplanation":["词源上，cnido- 来自希腊语，和“荨麻刺痛/刺”的概念有关；-blast 表示“未成熟的、正在形成的细胞”（如生物学里的 osteoblast 造骨细胞）。因此 cnidoblast 常被理解为“形成刺胞结构的细胞”。","在一些现代教材或论文中，更常见的术语是 cnidocyte（刺细胞，成熟的“发射单位”细胞）；cnidoblast 常用来强调其“发育阶段/前体细胞”的含义。"]}
{"word":"cnidoblast-related","summary":{"en":"Cnidoblast-related means connected to the stinging cells of cnidarians (e.g., jellyfish and corals).","zh":"cnidoblast-related 指与腔肠动物（如水母、珊瑚）的刺细胞及其功能/形成相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to cnidoblasts (specialized stinging cells) found in cnidarians such as jellyfish, sea anemones, and corals.","zh":"与刺细胞（cnidoblast，腔肠动物的刺针/刺丝相关的专门细胞）有关的；与腔肠动物刺细胞有关的。"},"examples":[{"en":"Researchers described a cnidoblast-related structure that helps jellyfish capture prey.","zh":"研究人员描述了一种与刺细胞相关的结构，能帮助水母捕获猎物。"},{"en":"The paper focuses on cnidoblast-related genes expressed during early coral development.","zh":"这篇论文重点讨论了珊瑚早期发育过程中表达的刺细胞相关基因。"}]}],"synonyms":["cnidocyte-related","stinging-cell-related","nematocyst-related"],"phonetic":"/ˈnaɪdoʊˌblæst rɪˈleɪtɪd/","extraExplanation":["“cnidoblast”是较早的术语，现代生物学更常用“cnidocyte（刺细胞）”来指这种细胞；刺细胞内部的“nematocyst（刺丝囊/刺针囊）”会发射刺丝，用于防御或捕食。","“cnidoblast-related”多见于学术写作（如发育生物学、比较基因组学），用于说明某基因、结构、机制与刺细胞的形成或功能有关。"]}
{"word":"cnidocell","summary":{"en":"A cnidocell is a stinging cell in jellyfish and other cnidarians, used for defense and catching prey.","zh":"cnidocell 指水母等腔肠动物的刺细胞，用于防御和捕食。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a specialized stinging cell in jellyfish, sea anemones, corals, and related animals, used to capture prey or defend themselves (also called a cnidocyte)","zh":"刺细胞（腔肠动物如水母、海葵、珊瑚等的特殊“刺”细胞，用于捕食或防御；也称 cnidocyte）"},"examples":[{"en":"Jellyfish tentacles are covered with cnidocells that can sting when touched.","zh":"水母的触手布满刺细胞，接触时可能会蜇人。"},{"en":"The cnidocell fires a tiny harpoon-like structure to inject venom into prey.","zh":"刺细胞会发射类似微型鱼叉的结构，把毒液注入猎物体内。"}]}],"synonyms":["cnidocyte","stinging cell"],"phonetic":"/ˈnaɪdoʊsɛl/","extraExplanation":["“Cnidocell”来自希腊语词根 cnido-/cnid-，意思与“荨麻的刺”相关，强调“能刺/能蜇”的功能。","在生物学里更常见的术语是 **cnidocyte（刺细胞）**；而 **nematocyst（刺丝囊）** 通常指刺细胞内部的“发射装置/囊体”，两者相关但不完全等同。"]}
{"word":"cnidocil","summary":{"en":"“cnidocil” isn’t a recognized English word; it’s likely a misspelling (possibly of “Clindocil”).","zh":"“cnidocil”不是常见英语词汇；更可能是拼写错误（可能想写“Clindocil”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it may be a misspelling or a brand/product name.","zh":"不是标准英语单词；可能是拼写错误，或某种品牌/产品名。"},"examples":[{"en":"I can’t find “cnidocil” in an English dictionary—could you check the spelling?","zh":"我在英语词典里找不到“cnidocil”，你能检查一下拼写吗？"},{"en":"Did you mean “Clindocil” (a brand name for an antibiotic in some places)?","zh":"你是不是想写“Clindocil”（在一些地区是抗生素的商品名）？"}]}],"extraExplanation":["“cnidocil”很可能是把“Clindocil / clindocil”拼错了（有些国家/地区用作克林霉素 clindamycin 的商品名）。如果你是在药品包装、处方或说明书上看到的，建议你发一张清晰照片或提供上下文（国家/地区、剂型、完整拼写），我可以帮你更准确地确认。","如果这是药品相关词汇，请不要仅凭网络信息自行用药；用药请以医生/药师指导为准。"]}
{"word":"cnidocyst","summary":{"en":"A cnidocyst is a stinging cell found in jellyfish and related animals that can shoot a tiny thread, often with venom.","zh":"cnidocyst 指水母等刺胞动物的“刺细胞”，可弹射细丝（常带毒）用来蜇刺或捕食。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a specialized stinging cell in cnidarians (such as jellyfish, sea anemones, and corals) that contains a capsule and can fire a tiny barbed thread to inject venom or help capture prey","zh":"刺胞动物（如水母、海葵、珊瑚）体内的一种“刺细胞”，内含囊体，可弹射带倒刺的细丝，用于注入毒液或捕捉猎物"},"examples":[{"en":"A jellyfish’s sting comes from thousands of cnidocysts on its tentacles.","zh":"水母的蜇刺来自触手上成千上万个刺细胞（cnidocysts）。"},{"en":"Under the microscope, you can see a cnidocyst discharge its thread in a split second.","zh":"在显微镜下，你能看到刺细胞在一瞬间弹射出细丝。"}]}],"synonyms":["stinging cell","nematocyst (often used similarly)"],"phonetic":"/ˈnaɪdəˌsɪst/","extraExplanation":["词源提示：cnidocyst 来自希腊语词根 knidē（意为“荨麻、刺痛”）+ cyst（“囊”）。因此它字面含义接近“会刺的囊”。","易混词：cnidocyst 常与 nematocyst 混用。严格说，nematocyst（线囊）是刺胞中的一种类型；在很多教材或科普语境里两者会被当作近义词使用。"]}
{"word":"cnidocyte","summary":{"en":"A cnidocyte is a stinging cell in jellyfish and related animals that can fire a tiny thread for catching prey or defense.","zh":"cnidocyte 指水母等刺胞动物体内能发射刺丝、用于捕食或防御的刺细胞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A specialized stinging cell found in cnidarians (such as jellyfish, sea anemones, and corals). It contains a capsule that can fire a tiny harpoon-like thread, usually to catch prey or for defense.","zh":"刺细胞；刺丝胞（刺胞动物如水母、海葵、珊瑚等体内的专门刺痛细胞）。其中有一个囊体，可发射像小鱼叉一样的丝状结构，通常用于捕食或防御。"},"examples":[{"en":"A jellyfish uses cnidocytes to sting its prey.","zh":"水母用刺细胞来蜇刺猎物。"},{"en":"When you touch a sea anemone, its cnidocytes can fire and cause irritation.","zh":"当你碰到海葵时，它的刺细胞可能会发射而引起皮肤刺激。"}]}],"synonyms":["stinging cell"],"phonetic":"/ˈnaɪdəˌsaɪt/","extraExplanation":["“cnidocyte”常见于生物学/海洋生物学语境，属于专业词汇。它来自希腊语词根 *knidē*（意为“荨麻”，因为被蜇的感觉像碰到荨麻）。","刺细胞内部的“发射装置”常被称为 *nematocyst*（刺丝囊）。学习时可记：*cnidocyte* 是“细胞”，*nematocyst* 是细胞里的“刺丝囊/武器”。"]}
{"word":"cnidogenous","summary":{"en":"Cnidogenous describes something that produces stinging capsules/cells (cnidae) in cnidarians.","zh":"cnidogenous 指“能产生刺丝囊/刺细胞（cnidae）的”，多用于刺胞动物的生物学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology) Producing cnidae (stinging capsules/cells), as in jellyfish, sea anemones, and other cnidarians.","zh":"（生物）能产生刺丝囊/刺细胞（用于蜇刺的结构）的；多用于描述水母、海葵等刺胞动物。"},"examples":[{"en":"Cnidogenous tissue helps a jellyfish produce new stinging cells.","zh":"刺丝囊生成组织帮助水母产生新的刺细胞。"},{"en":"Researchers compared cnidogenous structures across different cnidarian species.","zh":"研究人员比较了不同刺胞动物物种之间的刺丝囊生成结构。"}]}],"synonyms":["stinging-cell-producing","cnidae-producing"],"phonetic":"/naɪˈdɑːdʒənəs/","extraExplanation":["词源提示：开头的 c 通常不发音，cnid- 来自希腊语 knidē，意为“荨麻”，用来比喻刺胞动物的“蜇刺”感觉。","使用场景：该词主要见于动物学、海洋生物学的学术写作中；日常英语中更常用 cnidarian（刺胞动物）或 stinging cell（刺细胞）。","相关词：cnida（刺丝囊，单数），cnidae（复数），cnidocyte（刺细胞），cnematocyst（刺丝囊/刺囊，常见具体术语）。"]}
{"word":"cnidophobia","summary":{"en":"Cnidophobia means an intense fear of stinging insects such as wasps or bees.","zh":"cnidophobia 指对黄蜂、蜜蜂等刺人昆虫的强烈恐惧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an intense fear of stinging insects (especially wasps, hornets, and bees)","zh":"对刺人昆虫（尤指黄蜂、胡蜂和蜜蜂）的强烈恐惧"},"examples":[{"en":"He has cnidophobia, so he avoids picnics in late summer when wasps are common.","zh":"他有刺人昆虫恐惧症，所以会避免在黄蜂常见的夏末去野餐。"},{"en":"Her cnidophobia got worse after she was stung as a child.","zh":"她小时候被蜇过之后，对刺人昆虫的恐惧变得更严重了。"}]}],"synonyms":["fear of bees","fear of wasps","entomophobia"],"phonetic":"/ˌnaɪˌdoʊˈfoʊbiə/","extraExplanation":["这个词在日常英语里比较少见；更常用的说法是“a fear of bees/wasps”或更宽泛的“entomophobia（昆虫恐惧症）”。","词形上常见的后缀 -phobia 表示“恐惧症”。不过严格的科学用词里，前缀 cnido- 常与“刺细胞/刺丝（如水母的刺）”相关，所以有时也会出现用词不够严谨、被混用的情况。写作或就医时更推荐用更明确的表达（如“fear of wasps/bees”）。"]}
{"word":"cnidophore","summary":{"en":"A cnidophore is a stinging capsule/structure in jellyfish and other cnidarians that can fire to sting or catch prey.","zh":"cnidophore 指刺细胞动物体内能发射、用于蜇刺或捕食的刺丝囊/刺器结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a stinging capsule/organ found in cnidarians (such as jellyfish and sea anemones) that can discharge a tiny harpoon-like thread, often delivering venom","zh":"刺细胞动物（如水母、海葵）体内的刺丝囊/刺细胞器官，可弹射出细丝或“倒钩”样结构，常带毒，用于防御或捕食"},"examples":[{"en":"Jellyfish tentacles are covered with cnidophores that sting when touched.","zh":"水母的触手布满了刺丝囊，触碰时会蜇人。"},{"en":"Under the microscope, the cnidophore looks like a small capsule ready to fire.","zh":"在显微镜下，刺丝囊像一个随时准备发射的小囊。"},{"en":"The fish avoided the sea anemone because its cnidophores can inject venom.","zh":"那条鱼避开海葵，因为它的刺丝囊会注入毒液。"}]}],"synonyms":["nematocyst","cnida","stinging capsule"],"phonetic":"/ˈnaɪdəˌfɔr/","extraExplanation":["词源：来自希腊语 *knidē*（“荨麻、刺痛”）+ *-phore*（“携带者/承载者”），字面意思接近“带刺器”。","相关术语：在生物学里更常见的近义词是 **cnida / nematocyst**（刺丝囊），以及 **cnidocyte**（刺细胞，承载刺丝囊的细胞）。不同教材可能把 cnidophore 用作较宽泛的“刺器/刺细胞器”称呼。"]}
{"word":"cnidophorous","summary":{"en":"Cnidophorous means “having stinging cells (cnidae),” typical of jellyfish and sea anemones.","zh":"cnidophorous 指“具有刺丝囊/刺细胞（能蜇刺）的”，常见于水母、海葵等。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Bearing or containing cnidae (stinging capsules/cells), as in many jellyfish, sea anemones, and related animals.","zh":"（生物）具有或含有刺丝囊/刺细胞（用于蜇刺的结构）的；多见于水母、海葵等刺胞动物。"},"examples":[{"en":"Jellyfish are cnidophorous animals and can sting when touched.","zh":"水母是具刺细胞（cnidophorous）的动物，触碰时可能会蜇人。"},{"en":"The tentacles of a sea anemone are highly cnidophorous.","zh":"海葵的触手含有大量刺细胞（高度 cnidophorous）。"}]}],"synonyms":["cnidae-bearing","stinging-cell-bearing","cnidarian (related)"],"phonetic":"/ˌnaɪdoʊˈfɔrəs/","extraExplanation":["这是一个生物学形容词，来自“cnido-”（与刺丝囊/刺细胞有关）+ “-phorous”（“携带/具有”，如 phosphorus 同源词根含“携带”的意思）。通常用于学术或科普语境，日常英语里更常说“stinging cells”或直接说“it can sting”。","相关名词是“cnidae”（复数，指刺丝囊/刺细胞的刺囊结构）；更常见的形容词还有“cnidarian”（刺胞动物门的）。"]}
{"word":"cnidopod","summary":{"en":"A cnidopod is a stinging tentacle-like appendage of cnidarians used for feeding and defense.","zh":"cnidopod 指刺胞动物身上带刺细胞的触手状附肢，用于捕食和防御。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tentacle-like appendage in a cnidarian (such as a hydra or jellyfish) that bears stinging cells (cnidocytes/nematocysts), used for catching prey and defense","zh":"刺胞动物（如水螅、水母等）身上带有刺细胞/刺丝囊的触手状附肢，用于捕食与防御"},"examples":[{"en":"The hydra grasped the tiny crustacean with its cnidopods.","zh":"水螅用它的刺触手（cnidopods）抓住了那只小型甲壳动物。"},{"en":"A cnidopod can deliver a sting when it touches prey.","zh":"刺触手（cnidopod）接触到猎物时可能会释放刺丝造成刺痛。"}]}],"synonyms":["stinging tentacle","tentacle (general)"],"phonetic":"/ˈnaɪdoʊˌpɑd/","extraExplanation":["这是一个生物学/动物学术语，属于较少见的专业词汇。词根 cnido- 来自希腊语，和“cnidarian（刺胞动物）”同源，指“刺、荨麻样刺激”；-pod 表示“足/附肢”。","发音上 c 在 cn- 组合里通常不发音：cnidarian /naɪˈdɛriən/，因此 cnidopod 也常按“nido-”来读。"]}
{"word":"cnidosac","summary":{"en":"A cnidosac is a defensive sac in some sea slugs that stores stinging cells taken from jellyfish/anemones.","zh":"cnidosac 指某些海蛞蝓体内用于防御的囊状结构，能储存从水母/海葵等刺胞动物获得的刺细胞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small sac in certain sea slugs (especially aeolid nudibranchs) that stores stolen stinging cells from cnidarians (like jellyfish or anemones) for defense","zh":"（某些海蛞蝓，尤指枝鳃海蛞蝓体内的）刺囊囊；一种小囊结构，用来储存从刺胞动物（如水母、海葵）“偷来”的刺细胞以自卫"},"examples":[{"en":"Aeolid nudibranchs can keep their prey’s stinging cells in a cnidosac for protection.","zh":"枝鳃海蛞蝓能把猎物的刺细胞储存在刺囊囊里，用来保护自己。"},{"en":"Scientists studied the cnidosac to understand how sea slugs reuse nematocysts safely.","zh":"科学家研究刺囊囊，以了解海蛞蝓如何安全地再利用刺丝囊（刺细胞）。"}]}],"synonyms":["stinging-cell sac","nematocyst sac"],"phonetic":"ˈnaɪdoʊsæk","extraExplanation":["词源提示：cnido- 来自 Cnidaria（刺胞动物门），-sac 表示“囊、袋”。这个词多见于海洋生物学/动物学语境，日常英语中很少使用。","概念补充：cnidosac 常与 nematocyst（刺丝囊/刺囊）一起出现。许多枝鳃海蛞蝓会吃海葵等刺胞动物，并把未被消化的刺细胞转移到体表末端的囊中，遇敌时可释放进行防御。"]}
{"word":"Cnidoscolus","summary":{"en":"Cnidoscolus is a scientific genus name for certain spurge-family plants, often known for stinging hairs or irritating sap.","zh":"Cnidoscolus 是刺麻属的植物学属名，属于大戟科，常以刺毛或刺激性乳汁著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of plants in the spurge family (Euphorbiaceae), many of which have stinging hairs or irritating sap; some species are used as food or medicine (for example, chaya).","zh":"刺麻属（大戟科）植物的一个属名，许多种类有刺毛或刺激性乳汁；部分种类可食用或作药用（如“树菠菜/查亚”）。"},"examples":[{"en":"Cnidoscolus plants often have hairs that can sting your skin.","zh":"刺麻属植物常有会刺痛皮肤的刺毛。"},{"en":"In parts of Mexico, Cnidoscolus aconitifolius (chaya) is cooked and eaten as a leafy vegetable.","zh":"在墨西哥一些地区，人们会把刺麻属的树菠菜（Cnidoscolus aconitifolius，查亚）煮熟后当作叶菜食用。"}]}],"synonyms":["spurge (family context)","chaya (a common species name)"],"phonetic":"/naɪˌdoʊˈskoʊləs/","extraExplanation":["这是植物学中的拉丁学名（属名），日常英语里通常出现在科普文章、植物志、园艺或学术论文中。","词源常被解释为来自希腊语：knidē（荨麻、刺痛感）+ skolops（尖刺），用来提示不少物种“会刺人”的特征。","不同地区也可能用俗名指代其中某些物种，例如“mala mujer”（西语，意为“坏女人”，常指会刺人的种）、“chaya”（常指可食用的树菠菜）。俗名可能因地区而异。"]}
{"word":"cnidoscolus","summary":{"en":"Cnidoscolus is a plant genus (spurge family), often known for stinging hairs; common in the Americas.","zh":"Cnidoscolus 指刺荨麻属（大戟科）植物，常因带刺毛、会蜇人而闻名，主要分布在美洲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of plants in the spurge family (Euphorbiaceae), many of which have stinging hairs and are found mainly in the Americas.","zh":"刺荨麻属（大戟科）植物的一个属，许多种类带有刺毛、会蜇人，主要分布在美洲。"},"examples":[{"en":"Cnidoscolus texanus is commonly called bull nettle in parts of the United States.","zh":"在美国部分地区，Cnidoscolus texanus 常被叫作“bull nettle”（牛荨麻）。"},{"en":"Some Cnidoscolus plants cause a painful sting if you brush against the leaves.","zh":"有些刺荨麻属植物如果叶片擦到皮肤，会造成疼痛的蜇刺感。"}]}],"synonyms":["Cnidoscolus (genus)","bull nettle (common name for some species)","mala mujer (regional common name for some species)"],"phonetic":"/ˌnaɪdoʊˈskoʊləs/","extraExplanation":["这是一个拉丁化的植物学名称，常见于学术文章、植物图鉴与物种名中（例如 Cnidoscolus aconitifolius）。","词源上常被解释为源自希腊语：knidē（荨麻、会蜇人的植物）+ skolos（尖刺、刺），用来强调这类植物“带刺、会蜇人”的特征。","有些物种在民间也有西班牙语俗名（如“mala mujer”，意为“坏女人”），反映其碰触后刺痛的体验；不同地区俗名可能差异很大。"]}
{"word":"cnidosis","summary":{"en":"Cnidosis is a medical term for a skin reaction caused by stinging sea animals like jellyfish.","zh":"Cnidosis 指被水母等刺胞动物蜇到后引起的皮肤反应。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) Skin irritation or a rash caused by contact with the stinging cells of cnidarians (such as jellyfish, sea anemones, or corals).","zh":"（医学）因接触刺胞动物（如水母、海葵、珊瑚等）的刺细胞而引起的皮肤刺激或皮疹。"},"examples":[{"en":"After swimming near the reef, he developed cnidosis on his arms.","zh":"在礁区附近游泳后，他的手臂出现了刺胞动物导致的皮肤刺痛性皮疹（cnidosis）。"},{"en":"The doctor said the burning and welts were consistent with cnidosis from a jellyfish.","zh":"医生说这种灼痛和风团符合水母刺伤引起的皮肤反应（cnidosis）。"}]}],"synonyms":["jellyfish sting","cnidarian dermatitis","marine envenomation"],"phonetic":"/naɪˈdoʊsɪs/","extraExplanation":["这个词比较少见；有时会用更常见的说法来表达，比如“jellyfish sting / jellyfish dermatitis（水母蜇伤/皮炎）”。如果你本来想查的是 **candidiasis / candidosis（念珠菌感染）**，请告诉我，我可以另给那一条词条。","词源上 **cnid-** 来自希腊语 *knidē*，意思是“荨麻/刺痛”，强调“像被荨麻蜇到一样的刺痛感”。"]}
{"word":"Cnidus","summary":{"en":"Cnidus is the traditional English/Latin name of an ancient Greek city (also spelled Knidos) in what is now southwestern Turkey.","zh":"Cnidus（克尼多斯）是古希腊城市的传统英文/拉丁式名称（亦作 Knidos），位于今土耳其西南部。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an ancient Greek city on the coast of Caria (in today’s southwestern Turkey), famous in antiquity for its harbor, trade, and art (especially the sanctuary of Aphrodite).","zh":"克尼多斯：古希腊城市，位于卡里亚沿海（今土耳其西南部），古代以港口贸易与艺术闻名，尤其与阿佛洛狄忒（爱神）崇拜相关。"},"examples":[{"en":"Cnidus was an important port city in the ancient Aegean world.","zh":"克尼多斯在古代爱琴海世界中是一座重要的港口城市。"},{"en":"Many historians mention Cnidus when discussing Greek sanctuaries dedicated to Aphrodite.","zh":"许多历史学者在讨论献给阿佛洛狄忒的希腊神庙时会提到克尼多斯。"},{"en":"Some books use the spelling “Knidos,” which refers to the same place as Cnidus.","zh":"有些书写作“Knidos”，指的就是同一个地方——克尼多斯。"}]}],"synonyms":["Knidos"],"phonetic":"/ˈnaɪdəs/","extraExplanation":["“Cnidus”是拉丁化（或英语传统）拼写；现代学术与旅游资料中常见希腊式转写“Knidos”。两者是同一地名。","克尼多斯在古典艺术史上很有名，常与雕塑家普拉克西特列斯（Praxiteles）的《克尼多斯的阿佛洛狄忒》（Aphrodite of Knidos）联系在一起；这尊作品在古代被认为极具影响力。","如果你在文学或历史文章里看到“Battle of Cnidus（克尼多斯海战）”，通常指公元前394年发生的一场重要海战。"]}
{"word":"cnif","summary":{"en":"CNIF is usually an acronym (C-N-I-F), not a common English word; its meaning depends on context.","zh":"CNIF 通常是缩写（C-N-I-F），不是常见英语词；含义需根据上下文确定。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; usually seen as an acronym/initialism (the letters “C-N-I-F”). The meaning depends on the field or document, so you need context to interpret it.","zh":"不是标准英语单词；通常作为缩写/首字母缩略词（“C-N-I-F”）出现。具体含义取决于领域或上下文，需要结合语境理解。"},"examples":[{"en":"I saw “CNIF” in the report, but it wasn’t defined anywhere.","zh":"我在报告里看到“CNIF”，但文中没有任何解释。"},{"en":"Could you tell me what CNIF stands for in this document?","zh":"你能告诉我在这份文件里 CNIF 代表什么吗？"}]}],"synonyms":["acronym","initialism","abbreviation"],"phonetic":"/ˌsiːˌɛnˌaɪˈɛf/","extraExplanation":["“CNIF”更像是把字母逐个读出来的缩写（initialism），常见于机构名、项目名、文件栏目名等。不同组织可能会用同样的字母组合表示完全不同的意思。","如果你把含有“CNIF”的整句话或所在段落发出来，我可以根据语境更准确地判断它可能代表什么。"]}
{"word":"cniht","summary":{"en":"“Knight” most commonly means a medieval mounted warrior or the title “Sir”; it can also mean the chess piece called a knight.","zh":"“Knight”最常指中世纪骑士或被授予的“Sir”爵士头衔；也可指国际象棋里的“马”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a man in the past (especially in medieval Europe) who was trained to fight on horseback and followed a code of honor; also, a title given for merit (in the UK), with the right to be called “Sir.”","zh":"（尤指中世纪欧洲的）骑士：受训练骑马作战并遵守荣誉准则的人；也指英国授予的爵士/骑士头衔，获封者可被称为“Sir（爵士）”。"},"examples":[{"en":"In old stories, the knight rides out to protect the weak.","zh":"在古老的故事里，骑士出发去保护弱者。"},{"en":"He was made a knight for his service to science.","zh":"他因对科学的贡献而被授予爵士头衔。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make someone a knight (to give them the title “Sir”).","zh":"授予某人爵士/骑士头衔（使其成为“Sir”）。"},"examples":[{"en":"The king will knight her for her charity work.","zh":"国王将因她的慈善工作而授予她爵士头衔。"}]},{"partOfSpeech":"n.","definition":{"en":"a piece in chess that moves in an “L” shape (two squares in one direction and then one square sideways).","zh":"（国际象棋）马：走“日”字形（一个方向两格，再横向一格）。"},"examples":[{"en":"The knight can jump over other pieces.","zh":"马可以跳过其他棋子。"},{"en":"I moved my knight to protect the queen.","zh":"我走马来保护后。"}]}],"synonyms":["sir","cavalier","horseman"],"phonetic":"/naɪt/","extraExplanation":["你输入的“cniht”看起来像是把“knight”打乱或拼错了（可能少了字母 k 和 g）。英语里“knight”开头的 k 不发音：/naɪt/。","文化小提示：中世纪“骑士”常出现在亚瑟王传说（King Arthur）等文学中，象征勇敢、忠诚与“骑士精神”（chivalry）。现代英语里也常用“knight in shining armor”比喻“白马王子/拯救者”。"]}
{"word":"CNM","summary":{"en":"“CNM” can be an offensive online insult, or a professional abbreviation for Certified Nurse-Midwife; meaning depends on context.","zh":"“CNM”既可能是网络辱骂的缩写，也可能是“认证护士助产士”的专业缩写；含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(slang, offensive) A crude insult meaning “f*** your mother,” used online as an angry attack.","zh":"（俚语，冒犯）粗俗辱骂语，大意是“去你妈的/操你妈”，常见于网络吵架时的攻击性用语。"},"examples":[{"en":"Please don’t use “CNM” in this chat—it’s offensive.","zh":"请不要在这个群里用“CNM”——这很冒犯。"},{"en":"He got banned for posting “CNM” at other players.","zh":"他因为对其他玩家发“CNM”而被封禁。"}]},{"partOfSpeech":"n.","definition":{"en":"An abbreviation used in professional contexts for “Certified Nurse-Midwife.”","zh":"在专业语境中，“CNM”是“Certified Nurse-Midwife（认证护士助产士）”的缩写。"},"examples":[{"en":"The CNM guided her through the birth plan.","zh":"这位认证护士助产士帮助她制定分娩计划。"},{"en":"She works as a CNM at a community clinic.","zh":"她在社区诊所担任认证护士助产士。"}]},{"partOfSpeech":"n.","definition":{"en":"A general acronym that can stand for different organizations or terms depending on context.","zh":"通用首字母缩写，具体含义取决于上下文（可能代表不同机构或术语）。"},"examples":[{"en":"What does CNM stand for in this document?","zh":"在这份文件里，CNM代表什么？"},{"en":"CNM could mean different things in different fields.","zh":"在不同领域里，CNM可能有不同含义。"}]}],"synonyms":["see-en-em","Certified Nurse-Midwife","(offensive) insult/slur"],"phonetic":"/ˌsiː ɛn ˈɛm/","extraExplanation":["“CNM”在中文网络语境里常被当作拼音首字母缩写，指向一句极其粗俗的脏话；即使只写字母，在很多平台也会被视为辱骂或挑衅，可能导致删帖/禁言。","如果你是想表达不满但不想冒犯别人，可用更温和的英文：“That’s not okay.” “Please stop.” “I’m upset about this.”","在医疗领域里，CNM通常是正规的职业缩写（Certified Nurse-Midwife）。遇到缩写不确定时，最安全的做法是直接询问：‘What does CNM stand for here?’"]}
{"word":"CNMS","summary":{"en":"CNMS is an initialism; its exact meaning depends on context (often a school/organization name).","zh":"CNMS 是首字母缩略词，具体含义取决于语境（常见于学校或机构名称）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation (initialism) for different names depending on the context (for example, a university college/department name or a professional certification).","zh":"一个缩写（首字母缩略词），具体含义取决于使用语境（例如大学学院/部门名称或某种职业认证）。"},"examples":[{"en":"CNMS is hosting a public lecture on climate change this Friday.","zh":"CNMS 将在本周五举办一场关于气候变化的公开讲座。"},{"en":"She listed CNMS on her résumé, but I asked what it stood for.","zh":"她在简历里写了 CNMS，但我问她这具体代表什么。"}]},{"partOfSpeech":"other","definition":{"en":"(common campus use) short for “College of Natural and Mathematical Sciences” at some universities.","zh":"（一些大学校园常用）指“自然与数学科学学院（College of Natural and Mathematical Sciences）”。"},"examples":[{"en":"He’s a CNMS student majoring in biology.","zh":"他是 CNMS 的学生，主修生物学。"},{"en":"The CNMS advising office can help you plan your courses.","zh":"CNMS 的学业咨询办公室可以帮你规划课程。"}]}],"synonyms":["initialism","abbreviation"],"phonetic":"/ˌsiːˌɛnˌɛmˈɛs/","extraExplanation":["CNMS 不是一个只有单一标准含义的英文词，更常见于学校、机构或行业内部的缩写。不同地区/单位可能代表不同名称（例如某些学校的学院名、某些证书或系统名）。如果你告诉我它出现的场景（学校网页、简历、论文、公司系统等），我可以帮你锁定最准确的展开与中文对应。"]}
{"word":"CNN","summary":{"en":"CNN most commonly refers to the Cable News Network (U.S. news media). In tech contexts, it can also mean a Convolutional Neural Network.","zh":"CNN 最常见指美国有线电视新闻网；在科技/机器学习语境中也可指卷积神经网络。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Cable News Network: a major American 24-hour television news channel and media organization, often simply called CNN.","zh":"美国有线电视新闻网（Cable News Network）：美国重要的24小时电视新闻频道与媒体机构，常简称为 CNN。"},"examples":[{"en":"I watched the breaking news on CNN last night.","zh":"我昨晚在 CNN 上看了突发新闻。"},{"en":"CNN reported on the election results throughout the day.","zh":"CNN 一整天都在报道选举结果。"}]},{"partOfSpeech":"n.","definition":{"en":"Convolutional Neural Network: a type of deep-learning model commonly used for image recognition and computer vision.","zh":"卷积神经网络：深度学习模型的一种，常用于图像识别与计算机视觉。"},"examples":[{"en":"A CNN can learn to recognize cats and dogs in photos.","zh":"卷积神经网络（CNN）可以学会在照片中识别猫和狗。"},{"en":"The researcher trained a CNN on thousands of medical images.","zh":"研究人员用上千张医学影像训练了一个 CNN。"}]}],"synonyms":["Cable News Network","Convolutional Neural Network"],"phonetic":"/ˌsiːˌɛnˈɛn/","extraExplanation":["“CNN”是缩写（acronym/initialism），日常口语多读作字母：C-N-N（/ˌsiːˌɛnˈɛn/），而不是读成一个单词。","在不同语境里“CNN”含义差异很大：新闻语境通常指 Cable News Network；科技/机器学习语境通常指 Convolutional Neural Network。看到时可根据上下文判断。"]}
{"word":"CNN-based","summary":{"en":"“CNN-based” means built on or using a CNN, usually a convolutional neural network in AI contexts.","zh":"“CNN-based”表示“基于 CNN 的”，在 AI 语境里通常指基于卷积神经网络。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(computing, AI) Using or built on a Convolutional Neural Network (CNN), a type of deep-learning model often used for image, video, and pattern recognition.","zh":"（计算机/人工智能）基于或使用卷积神经网络（CNN）构建的；常用于图像、视频与模式识别等任务。"},"examples":[{"en":"The team proposed a CNN-based model for detecting tumors in medical images.","zh":"团队提出了一个基于 CNN 的模型，用于在医学影像中检测肿瘤。"},{"en":"CNN-based features often work well for image classification.","zh":"基于 CNN 的特征常常在图像分类中表现很好。"}]},{"partOfSpeech":"adj.","definition":{"en":"(media, less common) Based on or associated with CNN (Cable News Network) in style, reporting, or content.","zh":"（媒体，较少见）以 CNN（美国有线电视新闻网）的风格/报道方式/内容为基础或与之相关的。"},"examples":[{"en":"Some viewers prefer a CNN-based analysis of the election results.","zh":"一些观众更喜欢基于 CNN 风格的选举结果分析。"}]}],"synonyms":["CNN-driven","CNN-powered","CNN-backed","convolutional-neural-network-based"],"phonetic":"/ˌsiːˌɛnˈɛn beɪst/","extraExplanation":["“CNN-based”里的“based”表示“以……为基础/基于……”。在学术与工程语境中，CNN 几乎总是指“Convolutional Neural Network（卷积神经网络）”；在新闻媒体语境中才可能指“Cable News Network（美国有线电视新闻网）”。判断含义通常看上下文：如果出现“images / detection / model / training”等词，多半是机器学习含义。"]}
{"word":"CNO","summary":{"en":"CNO is an abbreviation that most commonly means Chief Nursing Officer, and can also mean Chief of Naval Operations (U.S.) or Chief Network Officer depending on context.","zh":"CNO是一个缩写，最常见指“首席护理官”，也可能根据语境指“（美国）海军作战部长”或“首席网络官”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Chief Nursing Officer: the top executive in charge of nursing staff and nursing standards in a hospital or healthcare system.","zh":"首席护理官：在医院或医疗系统中负责护理团队与护理标准的最高管理者。"},"examples":[{"en":"The CNO introduced new patient-safety training for all nurses.","zh":"首席护理官为所有护士推出了新的病人安全培训。"},{"en":"If you have questions about nursing policy, ask the CNO’s office.","zh":"如果你对护理政策有疑问，可以联系首席护理官办公室。"}]},{"partOfSpeech":"other","definition":{"en":"Chief of Naval Operations (U.S.): the senior military officer of the U.S. Navy.","zh":"（美国）海军作战部长：美国海军的最高级别现役军官。"},"examples":[{"en":"The CNO testified before Congress about Navy readiness.","zh":"海军作战部长在国会就海军战备情况作证。"},{"en":"The report was sent to the CNO for review.","zh":"这份报告被送交海军作战部长审阅。"}]},{"partOfSpeech":"other","definition":{"en":"Chief Network Officer: an executive responsible for an organization’s network strategy and operations (especially in telecom or large IT organizations).","zh":"首席网络官：负责组织网络战略与运营的高管（常见于电信或大型IT机构）。"},"examples":[{"en":"The CNO oversaw the upgrade to a faster, more secure network.","zh":"首席网络官负责推进网络升级，使其更快、更安全。"},{"en":"The company hired a CNO to lead its global connectivity plan.","zh":"公司聘请了一位首席网络官来领导其全球连接方案。"}]}],"synonyms":["Chief Nursing Officer","Chief of Naval Operations","Chief Network Officer"],"phonetic":"/ˌsiː en ˈoʊ/","extraExplanation":["“CNO”是缩写，具体含义高度依赖行业与语境：医院里最常指Chief Nursing Officer；美国军政新闻里常指Chief of Naval Operations；通信/大型IT组织中也可能指Chief Network Officer。","书写上通常全大写（CNO），读作字母音。首次在正式写作中出现时，建议先写全称再括号标注缩写（例如：Chief Nursing Officer (CNO)）。"]}
{"word":"cnocian","summary":{"en":"“cnocian” is not a recognized common English word; it is likely a misspelling or a proper name.","zh":"“cnocian” 不是常见英文单词；更可能是拼写错误或专有名词。"},"extraExplanation":["“cnocian” 不是常见的英文单词（在主流词典中查不到）。它看起来像是拼写错误或是某个专有名词/外来词。","你可能想输入的是下面这些更常见的英文词之一（拼写相近但意思不同）：\n1) concoction /kənˈkɑkʃən/（n. 调制物；混合饮料；“编造出来的说法”）\n2) concision /kənˈsɪʒən/（n. 简洁；简明）\n3) Caucasian /kɔˈkeɪʒən/（adj./n. 高加索的；（在某些语境中指）白人——用法有文化与社会敏感性，需谨慎）","如果你告诉我你想表达的中文意思、出现的句子/上下文，或你怀疑的正确拼写，我可以帮你确定正确单词并给出详细释义与例句。"]}
{"word":"Cnossian","summary":{"en":"Cnossian means “related to Cnossus/Knossos,” the ancient Minoan site on Crete.","zh":"Cnossian 指“与克诺索斯/Knossos（克里特岛的米诺斯遗址）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Cnossus (also spelled Knossos), an ancient city on Crete, especially its Minoan palace and culture.","zh":"与克诺索斯（亦拼作 Knossos；克里特岛上的古城）有关的，尤指米诺斯文明的宫殿与文化。"},"examples":[{"en":"Archaeologists study Cnossian artifacts to learn about Minoan life.","zh":"考古学家研究克诺索斯的文物，以了解米诺斯人的生活。"},{"en":"The museum has a small collection of Cnossian pottery.","zh":"这家博物馆收藏了一小批克诺索斯陶器。"}]}],"synonyms":["Knossian","Cretan (context-dependent)"],"phonetic":"/ˈnɑːsiən/","extraExplanation":["“Cnossian”来自古地名 Cnossus（更常见拼写：Knossos/Knossus）。这是克里特岛上最著名的米诺斯遗址之一，常与“迷宫（Labyrinth）”和“弥诺陶洛斯（Minotaur）”的神话联系在一起。","现代英文里更常见的写法是“Knossian”。如果你在学术文章或博物馆说明牌上看到“Cnossian”，通常只是较旧或较文学化的拼写。"]}
{"word":"Cnossus","summary":{"en":"Cnossus (also spelled Knossos) is an ancient Minoan palace-city on Crete, famous in both archaeology and Greek myth (the Labyrinth and the Minotaur).","zh":"Cnossus（也常拼作 Knossos）是希腊克里特岛上的米诺斯文明宫殿城市遗址，既是重要考古地点，也因“迷宫与牛头怪”的希腊神话而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient city and palace complex on the island of Crete (Greece), the main center of the Minoan civilization.","zh":"克里特岛（希腊）上的古代城市与宫殿遗址，是米诺斯文明的重要中心。"},"examples":[{"en":"Many tourists visit Cnossus to see the remains of the Minoan palace.","zh":"许多游客参观克诺索斯（Cnossus）以观看米诺斯宫殿的遗迹。"},{"en":"Archaeologists found colorful wall paintings at Cnossus.","zh":"考古学家在克诺索斯发现了色彩鲜艳的壁画。"}]},{"partOfSpeech":"n.","definition":{"en":"In Greek myth, the place linked with the Labyrinth and the Minotaur, ruled by King Minos.","zh":"在希腊神话中，与迷宫和牛头怪相关的地点，由米诺斯王统治。"},"examples":[{"en":"The story says Theseus entered the Labyrinth at Cnossus to face the Minotaur.","zh":"传说忒修斯在克诺索斯进入迷宫，去面对牛头怪。"},{"en":"In literature, Cnossus often symbolizes mystery and hidden dangers.","zh":"在文学中，克诺索斯常象征神秘与潜藏的危险。"}]}],"synonyms":["Knossos"],"phonetic":"/ˈnɑsəs/","extraExplanation":["“Cnossus”常见的另一种拼写是“Knossos”。两者指同一地点；“Kn-”的写法更贴近希腊语转写，但英语中两种拼写都能见到。","该遗址在20世纪初由英国考古学家阿瑟·埃文斯（Arthur Evans）大规模发掘与复原，因此在考古与旅游语境中经常出现。"]}
{"word":"cnotta","summary":{"en":"“cnotta” is not a recognized English word; it’s probably a typo or a name.","zh":"“cnotta”不是英语词汇，通常是拼写错误或名字。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a name/username.","zh":"不是标准英语单词，可能是拼写错误，或是人名/用户名/缩写。"},"examples":[{"en":"I couldn’t find “cnotta” in a dictionary—did you mean “ciabatta” or “cotta”?","zh":"我在词典里找不到“cnotta”——你是不是想写“ciabatta（恰巴塔面包）”或“cotta（熟的/烤制的；也常见于意大利甜点 panna cotta）”？“"}]}],"extraExplanation":["“cnotta”很可能是键盘误按或转写错误。最接近的常见词包括：\n- ciabatta：意大利长条面包（恰巴塔）\n- cotta：意大利语来源，意为“熟的/烤制的”，也常出现在 panna cotta（意式奶冻）的名称里\n如果你能告诉我它出现的句子/场景（聊天、菜单、游戏ID、作业等），我可以更准确判断你想查的词。"]}
{"word":"CNR","summary":{"en":"CNR is an abbreviation. Common meanings include “carrier-to-noise ratio” (telecom) and “Canadian National Railway” (historical usage).","zh":"CNR 是缩写，常见含义包括“载波噪声比”（通信领域）以及“加拿大国家铁路”（历史用法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Carrier-to-noise ratio: a measurement of how strong a signal is compared with background noise (used in telecom, radio, satellite, etc.).","zh":"载波噪声比：衡量信号强度相对于背景噪声的指标（常用于通信、广播、卫星等领域）。"},"examples":[{"en":"The engineer checked the CNR to make sure the satellite signal was clear enough.","zh":"工程师检查了 CNR，以确保卫星信号足够清晰。"},{"en":"A higher CNR usually means better audio or data quality.","zh":"CNR 越高，通常表示音频或数据质量越好。"}]},{"partOfSpeech":"n.","definition":{"en":"Canadian National Railway (CN): a major freight railway company in Canada (often abbreviated as CNR historically).","zh":"加拿大国家铁路：加拿大主要的货运铁路公司（历史上常缩写为 CNR）。"},"examples":[{"en":"My grandfather worked for the CNR when he lived in Ontario.","zh":"我祖父住在安大略时曾在 CNR 工作。"},{"en":"Some old documents still use “CNR” for Canadian National Railway.","zh":"一些旧文件仍用 “CNR” 指加拿大国家铁路。"}]},{"partOfSpeech":"n.","definition":{"en":"An initialism used in names of organizations or systems (meaning depends on the field), e.g., a company, a government program, or a technical term.","zh":"用于机构或系统名称的首字母缩写（具体含义取决于领域），例如公司名、政府项目或技术术语。"},"examples":[{"en":"In this report, CNR refers to a local agency, not the telecom measurement.","zh":"在这份报告里，CNR 指的是某个本地机构，而不是通信指标。"}]}],"synonyms":["carrier-to-noise ratio","C/N","Canadian National Railway","CN"],"phonetic":"/ˌsiː.ɛnˈɑːr/","extraExplanation":["“CNR”是缩写，最常见的理解取决于语境：技术/通信里常指“载波噪声比”；加拿大交通与历史语境里可能指“加拿大国家铁路”。如果你告诉我你在哪篇文章、哪个领域看到的，我可以帮你锁定最准确的意思。"]}
{"word":"CNS","summary":{"en":"CNS usually means the central nervous system (brain and spinal cord).","zh":"CNS通常指中枢神经系统（大脑与脊髓）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the central nervous system: the brain and spinal cord, which control and coordinate the body’s activities","zh":"中枢神经系统：由大脑和脊髓组成，负责控制与协调身体的各种活动"},"examples":[{"en":"Multiple sclerosis is a disease that affects the CNS.","zh":"多发性硬化是一种影响中枢神经系统（CNS）的疾病。"},{"en":"Alcohol can slow activity in the CNS, which affects reaction time.","zh":"酒精会减慢中枢神经系统（CNS）的活动，从而影响反应时间。"},{"en":"The doctor checked whether the injury involved the CNS or only peripheral nerves.","zh":"医生检查这次损伤是否涉及中枢神经系统（CNS），还是只影响周围神经。"}]}],"synonyms":["central nervous system"],"phonetic":"/ˌsiː.ɛnˈɛs/","extraExplanation":["CNS常见于医学、心理学与生物学文章中，是“central nervous system”的缩写。与之相对的是PNS（peripheral nervous system，周围神经系统），指连接CNS与全身器官和肌肉的神经网络。写作中首次出现时常写作“the central nervous system (CNS)”，之后再用CNS。"]}
{"word":"CNS-active","summary":{"en":"CNS-active describes a substance (especially a drug) that affects the brain and spinal cord.","zh":"CNS-active 指（尤指药物）会影响大脑和脊髓等中枢神经系统的物质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Affecting the central nervous system (the brain and spinal cord), usually used to describe a drug or chemical that changes mood, alertness, pain, or movement.","zh":"影响中枢神经系统（大脑和脊髓）的；常用于描述会改变情绪、警觉性、疼痛或运动功能的药物或化学物质。"},"examples":[{"en":"This medicine is CNS-active, so it may cause drowsiness.","zh":"这种药物具有中枢神经系统活性，因此可能会引起嗜睡。"},{"en":"Researchers tested whether the compound is CNS-active by measuring its effects on behavior.","zh":"研究人员通过测量其对行为的影响来测试该化合物是否具有中枢神经系统活性。"}]}],"synonyms":["centrally acting","psychoactive (often, but not always)","neuroactive"],"phonetic":"/ˌsiː ˌɛn ˈɛs ˈæk.tɪv/","extraExplanation":["“CNS”是“central nervous system（中枢神经系统）”的缩写；“CNS-active”多见于药学/医学写作，用来概括某种物质是否会直接影响大脑或脊髓的功能。它不等同于“有毒”，而是强调“会产生神经系统层面的作用”，例如镇静、止痛、兴奋、抗焦虑、抗癫痫等。"]}
{"word":"CNS-related","summary":{"en":"“CNS-related” means connected to the central nervous system (the brain and spinal cord).","zh":"“CNS-related”指与中枢神经系统（大脑和脊髓）有关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with or involving the CNS (central nervous system: the brain and spinal cord).","zh":"与CNS（中枢神经系统：大脑和脊髓）有关的；涉及中枢神经系统的。"},"examples":[{"en":"The doctor asked about any CNS-related symptoms, such as dizziness or confusion.","zh":"医生询问是否有任何与中枢神经系统相关的症状，比如头晕或意识混乱。"},{"en":"Some medications can cause CNS-related side effects like drowsiness.","zh":"有些药物可能会引起与中枢神经系统相关的副作用，比如嗜睡。"}]}],"synonyms":["central nervous system–related","neurologic (medical)","neurological"],"phonetic":"/ˌsiː.ɛnˈɛs rɪˈleɪtɪd/","extraExplanation":["“CNS”是医学和生物学里常见缩写，代表 central nervous system（中枢神经系统），通常与“PNS”（peripheral nervous system，周围神经系统）对比使用。","“CNS-related”多见于医学写作、药品说明书和科研论文中，用来把问题限定在“大脑/脊髓”层面；日常口语里更常说“related to the brain/nervous system”。","书面表达中常写作“CNS-related adverse events/side effects/symptoms”（中枢相关不良事件/副作用/症状）。"]}
{"word":"CNSR","summary":{"en":"CNSR is an informal online abbreviation meaning “censor/censorship.”","zh":"CNSR 是一种非正式的网络缩写，表示“审查/删改（censor/censorship）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(internet slang, abbreviation) “censor” or “censorship,” often written without vowels (CNSR) to avoid automatic filters or to look like a label.","zh":"（网络用语，缩写）“censor / censorship（审查；删改）”，常把元音省略写成 CNSR，用来躲避自动过滤，或像标签一样标注“已审查”。"},"examples":[{"en":"Some people write “CNSR” instead of “censor” to avoid keyword filters.","zh":"有些人会把“censor”写成“CNSR”，用来避开关键词过滤。"},{"en":"The video was marked “CNSR” and several scenes were cut.","zh":"这个视频被标注为“CNSR”，有几个片段被剪掉了。"}]}],"synonyms":["censor","censored","censorship","redacted"],"phonetic":"/ˌsiː ˌɛn ˌɛs ˈɑɹ/","extraExplanation":["“CNSR”不是非常正式的缩写，更常见于弹幕、论坛、社交媒体或字幕里。正式写法通常还是用“censor / censored / censorship”。","如果你是在某个特定领域看到 CNSR（例如公司名、医学/科研缩写、课程代码等），它也可能有别的含义；告诉我出现的句子或场景，我可以帮你精确判断。"]}
{"word":"Cnuphis","summary":{"en":"Cnuphis is an ancient name (variant spelling) for the Egyptian god Khnum, and sometimes for a serpent-like protective/creator figure in late antique texts.","zh":"Cnuphis 是古代对埃及神赫努姆（Khnum）的异拼写；在部分晚期古代文献中也可指带有护佑/创世意味的蛇形象征。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(proper name) A Greco-Roman spelling of the Egyptian god Khnum (also written Chnuphis/Cnouphis), a ram-headed deity linked to the Nile’s source, creation, and shaping life on a potter’s wheel.","zh":"（专有名词）埃及神“赫努姆”（Khnum）的希腊—罗马时期拼写之一（也写作 Chnuphis/Cnouphis），常被描绘为羊首神，与尼罗河源头、创生，以及用陶轮“塑造生命”有关。"},"examples":[{"en":"In some ancient Greek sources, Khnum appears under the name Cnuphis.","zh":"在一些古希腊文献中，赫努姆会以 Cnuphis 这个名字出现。"},{"en":"The temple inscriptions honor Cnuphis as a god connected to the Nile and fertility.","zh":"碑铭中会敬奉 Cnuphis，强调他与尼罗河及生育力的关联。"}]},{"partOfSpeech":"n.","definition":{"en":"In some late antique (Hermetic/Gnostic) writings, a name for a protective or creator-like serpent figure, sometimes associated with the “good spirit” (Agathodaimon).","zh":"在部分晚期古代（赫尔墨斯主义/诺斯替）著作中，用来指一种带有护佑或创世意味的“蛇形”存在，有时会与“善灵”（Agathodaimon）联系在一起。"},"examples":[{"en":"A few Hermetic texts mention Cnuphis in connection with a sacred serpent.","zh":"一些赫尔墨斯派文本会在“神圣之蛇”的语境下提到 Cnuphis。"},{"en":"The name Cnuphis can appear beside Agathodaimon in discussions of protective spirits.","zh":"在讨论护佑灵体时，Cnuphis 这个名字有时会与 Agathodaimon 并列出现。"}]}],"synonyms":["Khnum","Chnuphis","Cnouphis","Knuphis","Agathodaimon (related)"],"phonetic":"/ˈnuːfɪs/","extraExplanation":["“Cnuphis”多见于希腊语/拉丁语作者对埃及神名的转写，不同作品里也常拼作 Cnouphis、Chnuphis、Knuphis 等；现代学术与博物馆说明更常用的对应名是 Khnum（赫努姆）。","如果你是在某本书或碑文里看到 Cnuphis，理解时通常要结合上下文：是指“赫努姆”这位羊首创生之神，还是指晚期宗教哲学文本里更抽象的蛇形守护/创世象征。"]}
{"word":"Cnut","summary":{"en":"Cnut (Canute) was a powerful 11th‑century king of England who also ruled Denmark and Norway; he is also remembered in a legend about the tide that teaches the limits of power.","zh":"Cnut（Canute，克努特）是11世纪统治英格兰并兼统丹麦、挪威的强势君主；他也因“命令潮水停止”的传说而被用来象征权力的限度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A king (c. 995–1035), often called Canute, who ruled England (1016–1035) and also Denmark and Norway, creating a North Sea empire.","zh":"克努特（约995–1035），又常写作 Canute；曾统治英格兰（1016–1035），并兼统丹麦与挪威，建立了“北海帝国”的丹麦王。"},"examples":[{"en":"Cnut became king of England after years of conflict following the Viking invasions.","zh":"在维京人入侵后的多年冲突之后，克努特成为英格兰国王。"},{"en":"In history class, we learned that Cnut ruled across England, Denmark, and Norway.","zh":"历史课上我们学到，克努特的统治横跨英格兰、丹麦和挪威。"}]},{"partOfSpeech":"n.","definition":{"en":"In the famous legend, Cnut orders the tide to stop to show his followers that even a king cannot control nature (often used as a lesson about limits of power).","zh":"在著名传说中，克努特命令海潮停止，以向随从说明即使国王也无法控制自然（常用来说明权力的限度）。"},"examples":[{"en":"The story of Cnut and the tide is often told to warn leaders against arrogance.","zh":"“克努特与潮水”的故事常被用来告诫领导者不要自负。"},{"en":"He referenced Cnut to remind everyone that some problems can’t be solved by authority alone.","zh":"他提到克努特，提醒大家有些问题不是靠权威就能解决的。"}]}],"synonyms":["Canute"],"phonetic":"/nʌt/","extraExplanation":["“Cnut”是中古英语/古北欧名字的拼写，现代英语里常见写法是“Canute”。两者指同一位国王。","读音在现代英语里通常像“nut”。开头的字母 C 不读 /k/ 音。","“克努特命令潮水停止”的故事常被误解成他自大想控制海潮；较常见的解读是：他借此反讽奉承者，强调王权也有边界。"]}
{"word":"CNY","summary":{"en":"CNY most commonly means the Chinese yuan (Renminbi) currency code; it can also mean Chinese New Year.","zh":"CNY最常见指人民币（中国元）的货币代码；也可指Chinese New Year（春节/中国新年）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"The ISO currency code for the Chinese yuan (Renminbi), used in finance and exchange rates.","zh":"人民币（中国元）的国际货币代码（ISO），常用于金融与汇率标注。"},"examples":[{"en":"The price is 299 CNY, not including shipping.","zh":"价格是299 CNY（人民币），不含运费。"},{"en":"The exchange rate moved from 7.20 to 7.15 CNY per dollar.","zh":"汇率从每美元7.20 CNY变到7.15 CNY。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation for Chinese New Year (also called Lunar New Year).","zh":"Chinese New Year（中国新年/春节；也常称 Lunar New Year 农历新年）的缩写。"},"examples":[{"en":"Our office is closed for CNY holidays.","zh":"我们办公室春节（CNY）假期休息。"},{"en":"CNY travel can be very busy, so book early.","zh":"春节（CNY）出行会很拥挤，所以要早点订票。"}]}],"synonyms":["RMB","yuan","Renminbi","Chinese New Year","Lunar New Year"],"phonetic":"/ˌsiː ɛn ˈwaɪ/","extraExplanation":["在金融语境里，CNY通常指“在中国境内流通/结算的人民币（在岸人民币）”；有时你也会看到CNH，多用于指“离岸人民币”。在日常标价中也常见RMB或¥，但在国际支付/汇率里用CNY更标准。","在节日语境里，CNY在英文社交媒体和公司通知中很常见；如果面向更广泛的国际读者，写“Lunar New Year”通常更包容、也更容易被不同文化背景的人理解。"]}
{"word":"cnyttan","summary":{"en":"“cnyttan” isn’t an English word; please provide context (it may be Swedish or a typo).","zh":"“cnyttan”不是英语单词；请提供上下文（可能是瑞典语或拼写错误）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username/code, or a word from another language (possibly Swedish).","zh":"不是标准英语单词。可能是拼写错误、用户名/代码，或来自其他语言（可能是瑞典语）。"},"examples":[{"en":"I couldn’t find “cnyttan” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里找不到“cnyttan”——你能把它出现的句子发我吗？"},{"en":"If you meant Swedish “nyttan,” it can mean “the benefit” or “the usefulness.”","zh":"如果你想写的是瑞典语“nyttan”，它可以表示“益处/好处”或“有用性”。"}]}],"synonyms":["(if you meant “benefit”): advantage","(if you meant “usefulness”): utility","(if you meant “help”): aid"],"phonetic":"/ˈsiː ˈɛn ˈwaɪ tiː ˈtiː æn/","extraExplanation":["“cnyttan”看起来不像英语词汇，也不像常见英语缩写。它很可能是：\n1）键盘误打/漏打空格（例如把两个词连在一起）；\n2）某个平台的用户名、项目代号、文件名；\n3）来自其他语言的词形。尤其像瑞典语里“nyttan”（the benefit/usefulness）的形式。\n\n如果你告诉我它出现的上下文（整句/截图/你想表达的意思），我可以更准确判断并给出对应的英语表达。"]}

