{"word":"COD","summary":{"en":"COD is an abbreviation that most commonly means “cash on delivery,” but it can also mean “cause of death,” or “Call of Duty” (CoD) in gaming contexts.","zh":"COD 是缩写，最常见指“货到付款”，也可指“死因”，在游戏语境中还可指《使命召唤》（CoD）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"cash on delivery: a way to pay for goods where you pay when they arrive","zh":"货到付款：货物送达时再付款的一种支付方式"},"examples":[{"en":"We can ship it COD, so you pay the driver when it arrives.","zh":"我们可以用货到付款寄送，这样到货时你再付钱给送货员。"},{"en":"Some sellers don’t offer COD anymore.","zh":"有些卖家现在不再提供货到付款了。"}]},{"partOfSpeech":"other","definition":{"en":"cause of death: the medical reason someone died","zh":"死因：医学上导致某人死亡的原因"},"examples":[{"en":"The doctor listed the COD on the death certificate.","zh":"医生在死亡证明上填写了死因。"},{"en":"Police are still investigating the COD.","zh":"警方仍在调查死因。"}]},{"partOfSpeech":"n.","definition":{"en":"Call of Duty: a popular video game series (often written as CoD)","zh":"《使命召唤》：一款很受欢迎的电子游戏系列（常写作 CoD）"},"examples":[{"en":"He plays CoD with his friends after school.","zh":"他放学后和朋友一起玩《使命召唤》。"},{"en":"CoD is short for Call of Duty.","zh":"CoD 是 Call of Duty 的缩写。"}]}],"synonyms":["cash on delivery","pay on delivery","cause of death"],"phonetic":"/ˌsiː oʊ ˈdiː/","extraExplanation":["“COD”是缩写，具体意思要看场景：电商/物流里最常见的是“货到付款”；医疗/警方文件里常见“死因”；游戏社区里常见“CoD=Call of Duty”。书写上有时会写作 C.O.D. 或 COD。"]}
{"word":"cod","summary":{"en":"Cod most commonly means the fish (or its meat). In informal British English, it can also mean a boring person or mean to tease/trick someone.","zh":"cod 最常见指“鳕鱼/鳕鱼肉”。在非正式英式英语中，也可指“讨厌无聊的人”，或作动词表示“戏弄、哄骗”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large edible sea fish (codfish), common in the North Atlantic; also the meat from this fish","zh":"鳕鱼（常见于北大西洋的大型食用海鱼）；也指鳕鱼肉"},"examples":[{"en":"We had baked cod with lemon for dinner.","zh":"晚餐我们吃了柠檬烤鳕鱼。"},{"en":"Cod is often used in fish and chips.","zh":"炸鱼薯条里常用鳕鱼。"}]},{"partOfSpeech":"n.","definition":{"en":"a boring or unpleasant person (informal, mainly British)","zh":"令人厌烦的人；无聊讨厌的人（非正式，多为英式用法）"},"examples":[{"en":"Don’t invite him—he’s such a cod.","zh":"别邀请他——他真是个讨厌的人。"}]},{"partOfSpeech":"v.","definition":{"en":"to tease or trick someone (informal, mainly British)","zh":"戏弄；哄骗（非正式，多为英式用法）"},"examples":[{"en":"Are you codding me, or is this serious?","zh":"你是在逗我吗，还是你是认真的？"},{"en":"He was just codding—he didn’t mean it.","zh":"他只是开玩笑逗人，并不是当真。"}]}],"synonyms":["codfish","fish","tease","trick","kid (informal)"],"phonetic":"/kɑd/","extraExplanation":["“cod”在英式英语里还可以作形容词，表示“假的、冒牌的”（例如 cod accent / cod story），意思接近 fake / bogus。","鳕鱼在英语文化中很常见，尤其与英国的 fish and chips、北大西洋渔业有关；历史上还有与鳕鱼捕捞权相关的“Cod Wars（鳕鱼战争）”。","注意：很多人会把缩写“COD”当作单词使用（如 Cash on Delivery 货到付款；Call of Duty 游戏名；在医学里也可能指 cause of death 死因）。这些属于缩写，不是“cod”这个普通词的基本词义。"]}
{"word":"cod-fishing","summary":{"en":"Cod-fishing means catching cod, either commercially or for recreation.","zh":"cod-fishing 指捕捞鳕鱼，可指商业捕捞或休闲垂钓。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity of catching cod (a type of saltwater fish), especially as a job or as a recreational sport","zh":"鳕鱼捕捞；捕鳕鱼活动（可指职业捕捞或休闲垂钓）"},"examples":[{"en":"Cod-fishing is an important part of the local economy in some coastal towns.","zh":"在一些沿海小镇，鳕鱼捕捞是当地经济的重要组成部分。"},{"en":"We went cod-fishing early in the morning and brought back enough fish for dinner.","zh":"我们一大早去捕鳕鱼，带回了够吃晚饭的鱼。"},{"en":"The company invested in safer gear for cod-fishing in rough winter seas.","zh":"公司投资更安全的设备，以便在冬季风浪中进行鳕鱼捕捞。"}]}],"synonyms":["cod fishing","cod angling","cod harvest"],"phonetic":"/ˈkɑd ˌfɪʃɪŋ/","extraExplanation":["“cod-fishing”常见于北大西洋语境，尤其与Newfoundland（纽芬兰）、New England（新英格兰）等地区的渔业历史有关。","写作中也可用更通用的表达：cod fishing（不加连字符）。作定语时更常见连字符：a cod-fishing boat（捕鳕鱼船）。"]}
{"word":"coda","summary":{"en":"A coda is a concluding section—especially in music, where it’s the final passage that brings a piece to an ending.","zh":"coda 指“结尾/尾声”，尤其在音乐中指乐曲最后用来收束并结束的终结段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In music, a final section added to bring a piece to a clear ending (often after the main part is finished).","zh":"（音乐）尾声；终结段：加在乐曲结尾、用来收束并完成结束的段落（常在主体之后）。"},"examples":[{"en":"After the last chorus, the band played a short coda to end the song.","zh":"最后一段副歌之后，乐队又演奏了一个简短的尾声来结束这首歌。"},{"en":"The conductor held the tempo steady through the coda.","zh":"指挥在尾声部分保持了稳定的速度。"}]},{"partOfSpeech":"n.","definition":{"en":"More generally, an ending part that wraps up a story, speech, or event; a concluding section.","zh":"（引申）结尾部分；收束段：用来总结或收尾的最后一段（如故事、演讲或事件）。"},"examples":[{"en":"The final chapter acts as a coda, showing what happens to the characters years later.","zh":"最后一章像尾声一样，展示了多年后角色们的境况。"},{"en":"Her brief thank-you was a perfect coda to the ceremony.","zh":"她简短的致谢为典礼画上了完美的句号。"}]}],"synonyms":["ending","conclusion","finale","epilogue","closing"],"phonetic":"/ˈkoʊdə/","extraExplanation":["“coda”来自意大利语，原意与“尾巴”有关，所以常用来表示“末尾、收束”。在乐谱里常会看到“Coda”或符号提示（例如“to Coda”），意思是跳转到标记的尾声段落来结束。","文学/叙事里用“coda”时，常带有一种“回望与余韵”的感觉：不是简单停止，而是用一小段来补充、总结或留下回响。"]}
{"word":"codable","summary":{"en":"Codable means “able to be encoded into code or a data format,” especially in software (often for JSON).","zh":"Codable 表示“可编码的”，在软件开发中常指能进行编码/解码（常用于 JSON 等格式转换）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be turned into code (for example, represented using a system of symbols or rules).","zh":"可编码的；能够被转换成代码或用某种符号/规则表示的。"},"examples":[{"en":"The information must be codable so the computer can store it efficiently.","zh":"这些信息必须是可编码的，这样电脑才能高效地存储。"},{"en":"Not every feeling is easily codable into numbers.","zh":"并不是每一种情感都能轻易被编码成数字。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Software) Able to be encoded and decoded, especially converted to and from a data format like JSON.","zh":"（软件）可进行编码与解码的；尤指能与 JSON 等数据格式互相转换的。"},"examples":[{"en":"Make the model codable so we can send it as JSON to the server.","zh":"把这个模型做成可编码/可解码的，这样我们就能把它作为 JSON 发给服务器。"},{"en":"This struct is codable, so saving it to a file is straightforward.","zh":"这个结构体是可编码/可解码的，所以保存到文件很方便。"}]}],"synonyms":["encodable","decodable","serializable"],"phonetic":"/ˈkoʊdəbəl/","extraExplanation":["在苹果生态的 Swift 里，Codable 通常特指一个协议（Protocol），表示类型可以在“对象 ↔ 数据”之间转换（常见是 JSON）。因此你会看到开发者说 “Make it codable.” 这里的 codable 带有很强的编程语境。","一般英语里更常见的说法是 “encodable/decodable” 或 “can be encoded”。“codable”作为日常词并不算特别常见，但在软件开发语境中使用频率很高。"]}
{"word":"Codacci-Pisanelli","summary":{"en":"Codacci-Pisanelli is a hyphenated Italian surname used as a proper name.","zh":"Codacci-Pisanelli 是一个带连字符的意大利姓氏（复姓），作为专有名词使用。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a hyphenated Italian family name (surname); used as a proper noun to identify a person or family.","zh":"一个意大利的复姓（连字符姓氏）；作为专有名词用于指代某个人或某个家族。"},"examples":[{"en":"Professor Codacci-Pisanelli will give a guest lecture tomorrow.","zh":"Codacci-Pisanelli 教授明天将做一场客座讲座。"},{"en":"I’m not sure how to pronounce Codacci-Pisanelli—could you say it for me?","zh":"我不太确定 Codacci-Pisanelli 怎么读——你可以念给我听吗？"},{"en":"In the article, Ms. Codacci-Pisanelli is listed as one of the co-authors.","zh":"在文章里，Codacci-Pisanelli 女士被列为共同作者之一。"}]}],"phonetic":"/koʊˈdɑtʃi ˌpizɑˈnɛli/","extraExplanation":["这是一个带连字符的意大利复姓，通常表示两个家族姓氏的结合（例如婚姻、继承或家族传统）。在英文语境中把它当作专有名词使用，书写时一般保留连字符并首字母大写。","读音在不同家庭或地区可能略有差异；如果是在正式场合（课堂、会议、采访），最礼貌的做法是直接询问当事人偏好的发音。"]}
{"word":"codal","summary":{"en":"Codal means “related to a coda” or “toward the end/tail.” It’s a rare word, used mostly in technical or musical contexts.","zh":"codal 表示“与尾声/末段有关”或“朝向末端/尾部”。较少用于日常，多见于音乐或专业语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a coda or the end part of something; “toward the tail/end.”","zh":"与“尾声/末段”（coda）有关的；指向末端、尾部的。"},"examples":[{"en":"The codal section of the song slows down and repeats the main theme.","zh":"这首歌的尾声段落节奏放慢，并重复主旋律。"},{"en":"In anatomy, codal often means “near the tail end” of an organism.","zh":"在解剖学中，codal 常指“靠近生物的尾端”。"}]}],"synonyms":["final","ending","terminal","tail-end"],"phonetic":"/ˈkoʊdəl/","extraExplanation":["词源提示：codal 来自 coda（尾声、结尾部分）。coda 常见于音乐术语，表示乐曲最后的“收束/尾声”。","使用场景：在日常英语里 codal 比较少见，更常见的是 ending/final/closing（结尾的）或 tail-end（末端的）。在音乐、解剖学、动物学等语境中更可能出现。"]}
{"word":"codamin","summary":{"en":"Codamin is usually a brand name for a cough/cold medicine (often codeine-based), not a common English word.","zh":"Codamin 通常是止咳/感冒药的商品名（常见可能与可待因相关），不是常见英文词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a brand name for a cough/cold medicine (often containing codeine and other ingredients, depending on the country); not a general English vocabulary word","zh":"一种止咳/感冒药的商品名（常见配方可能含可待因等成分，但因国家/地区而异）；不是通用英语词汇"},"examples":[{"en":"In some countries, Codamin is sold as a cough medicine, but the formula can differ by region.","zh":"在一些国家，Codamin 作为止咳药销售，但不同地区的配方可能不一样。"},{"en":"You should check the label to see what active ingredients Codamin contains.","zh":"你应该查看标签，确认 Codamin 含有哪些有效成分。"}]}],"synonyms":["codeine cough syrup","codeine (ingredient)","cough medicine"],"phonetic":"/ˈkoʊdəˌmɪn/","extraExplanation":["“Codamin / Codamine”更常见于药品品牌或商品名，而不是标准词典里的普通英文单词。不同国家可能有不同配方（例如含可待因的止咳成分、抗组胺成分等），因此不能仅凭名字判断具体药效与风险。","如果你是在学习英语拼写：你可能想写的是 **codeine**（可待因，一种镇痛/止咳成分）或某个含可待因的咳嗽糖浆品牌。可待因属于受管制药物，在许多地方需要处方或有严格限制。","如用于实际用药，请以药品说明书与医生/药师建议为准，避免与酒精、安眠药或其他镇静类药物同用。"]}
{"word":"codamine","summary":{"en":"Codamine is usually a brand name for a codeine-containing medicine (often for cough or pain).","zh":"Codamine 通常是含可待因的药品商品名（常用于止咳或镇痛）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a brand name for a medicine (in some countries) that contains codeine and is used to relieve cough or pain; not a standard general-English vocabulary word","zh":"（在一些国家使用的）一种含可待因的药品商品名，用于止咳或镇痛；不是常见的通用英语词汇"},"examples":[{"en":"The label says Codamine contains codeine, so it may cause drowsiness.","zh":"标签上写着 Codamine 含有可待因，所以可能会引起嗜睡。"},{"en":"Some places sell Codamine only with a prescription.","zh":"在一些地方，Codamine 只能凭处方购买。"}]}],"synonyms":["codeine","codeine cough syrup","opioid pain reliever"],"phonetic":"/ˈkoʊdəmiːn/","extraExplanation":["“Codamine”通常是商品名（brand name），不同国家/地区的配方可能不同；不要仅凭名称判断成分。","可待因（codeine）属于阿片类药物，在许多地区受管制，可能导致嗜睡、便秘、成瘾风险；务必遵医嘱使用并避免与酒精同用。","如果你本来想查的是拼写相近的词（如 codeine 或 dopamine），告诉我你的语境/句子，我可以帮你确认。"]}
{"word":"codas","summary":{"en":"Codas are ending sections—especially the concluding passage of a work or the final passage of a musical piece.","zh":"codas 是 coda 的复数，表示“结尾/尾声”；在音乐中特指乐曲的终结段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A concluding part that brings something to an end; a wrap-up or final section.","zh":"（文章、故事、电影、演讲等的）结尾部分；收束；尾声"},"examples":[{"en":"The book ends with a short coda that explains what happened to the characters later.","zh":"这本书以一段简短的尾声结尾，解释了角色后来发生的事。"},{"en":"After the main argument, the speaker added a coda about hope and responsibility.","zh":"在主要论点之后，演讲者又补充了一段关于希望与责任的收束。"}]},{"partOfSpeech":"n.","definition":{"en":"In music, a final passage added to conclude a piece, often extending or rounding off the ending.","zh":"（音乐）终结段；尾声；（乐曲的）结尾乐段"},"examples":[{"en":"The orchestra repeated the theme in a powerful coda.","zh":"乐团在尾声中有力地重复了主题。"},{"en":"Listen for the coda—the ending section feels like a final goodbye.","zh":"留意尾声——结尾段听起来像最后的告别。"}]}],"synonyms":["ending","conclusion","epilogue","closing passage","finale","postscript"],"phonetic":"/ˈkoʊdə/","extraExplanation":["“coda”来自意大利语，原意是“尾巴”。在英语里常用于音乐术语，也常被借用到文学、电影和演讲中，表示“最后的收束/尾声”。","你输入的“codas”是复数形式：one coda / two codas。"]}
{"word":"CODASYL","summary":{"en":"CODASYL is an early computing standards consortium and is also used to refer to its network database model (DBTG).","zh":"CODASYL 是一个早期计算机标准协作组织，也常用来指其提出的网状数据库模型（DBTG）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An early international consortium (Conference on Data Systems Languages) that worked on standards for programming languages and data management, especially in the 1960s–1980s.","zh":"一个早期的国际协作组织（Conference on Data Systems Languages，数据系统语言会议），在20世纪60–80年代推动编程语言与数据管理相关标准。"},"examples":[{"en":"CODASYL played an important role in early computing standards.","zh":"CODASYL 在早期计算机标准制定中发挥了重要作用。"},{"en":"Some old enterprise systems were influenced by CODASYL recommendations.","zh":"一些旧的企业系统受到 CODASYL 建议的影响。"}]},{"partOfSpeech":"other","definition":{"en":"A term often used to refer to the CODASYL Database Task Group (DBTG) model, also called the network database model, which organizes data using records and set-based links.","zh":"常用来指 CODASYL 数据库任务组（DBTG）的数据库模型，也称“网状数据库模型”，用记录（record）与集合式链接（set）来组织数据。"},"examples":[{"en":"Before relational databases became dominant, the CODASYL (network) model was widely discussed.","zh":"在关系型数据库占主导地位之前，CODASYL（网状）模型曾被广泛讨论。"},{"en":"Learning the CODASYL model can help you understand how older database systems navigated relationships.","zh":"学习 CODASYL 模型能帮助你理解旧式数据库系统如何“沿着关系”进行导航访问。"}]}],"synonyms":["CODASYL DBTG","network database model","DBTG model"],"phonetic":"/ˈkoʊdəˌsɪl/","extraExplanation":["CODASYL 这个缩写最常与 COBOL 的标准化历史联系在一起；它参与推动了早期商业数据处理领域的通用规范。","所谓“CODASYL 数据库模型/DBTG 报告”强调的是指针式（navigational）访问：程序往往需要明确“从哪条记录沿哪个链接走到哪条记录”。这与后来 SQL 主导的关系模型（用查询来描述“要什么”，而非“怎么走”）形成对比。","在阅读计算机史、数据库史或旧系统迁移资料时，你会频繁看到 CODASYL 与 DBTG、network model、navigational database 这些词一起出现。"]}
{"word":"codbank","summary":{"en":"“Codbank” most commonly means a code repository (a reusable collection of code). More rarely, it can mean a cod fishing bank (often written “Cod Bank”).","zh":"“codbank”最常见指代码库/代码仓库（可复用代码的集合）；较少见时可指鳕鱼渔场/浅滩（常写作“Cod Bank”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a collection or repository of reusable pieces of computer code (often templates, snippets, or modules) that can be stored and used again in different projects","zh":"代码库；代码片段/模块的集合（常用于存放可复用的模板、片段或组件，便于在不同项目中重复使用）"},"examples":[{"en":"Our team keeps a codebank of tested functions so we don’t rewrite the same code every time.","zh":"我们团队保存了一个经过测试的代码库，这样就不用每次都重写相同的代码。"},{"en":"She copied a snippet from the codebank and adapted it for the new feature.","zh":"她从代码库里复制了一段代码片段，并把它改成适用于新功能。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common; often written as “Cod Bank”) an underwater ridge or fishing ground where cod are found","zh":"（较少见；常写作 Cod Bank）鳕鱼浅滩/渔场（海底隆起或浅滩，常有鳕鱼出没）"},"examples":[{"en":"The boats headed toward the cod bank at dawn.","zh":"天一亮，渔船就驶向鳕鱼渔场。"},{"en":"Overfishing reduced the catch on the cod bank over time.","zh":"随着时间推移，过度捕捞使鳕鱼浅滩的渔获减少了。"}]}],"synonyms":["code repository","code library","snippet library","repo"],"phonetic":"/ˈkoʊd ˌbæŋk/","extraExplanation":["“codebank / code bank”在软件语境里更常见的说法是 code repository（代码仓库）或 snippet library（代码片段库）。如果你指的是 GitHub/GitLab 上的项目仓库，用“repository/repo”最自然。","“Cod Bank”作为地理/渔业用语时，常指某一片固定的渔场或浅滩；具体名称可能因地区而不同。"]}
{"word":"CODCF","summary":{"en":"CODCF is an uncommon acronym; its meaning depends on context.","zh":"CODCF 是不常见的缩写，含义取决于具体语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"CODCF is not a standard English word. It is usually seen as an acronym/initialism, and its meaning depends on the specific field (e.g., a company name, a project code, a course title, or a technical abbreviation).","zh":"CODCF 不是一个标准英文单词，通常以首字母缩略词的形式出现，具体含义取决于所在领域（例如公司/项目代号、课程名称或技术缩写等）。"},"examples":[{"en":"I saw “CODCF” in the report, but there was no explanation—do you know what it stands for?","zh":"我在报告里看到了“CODCF”，但没有解释——你知道它代表什么吗？"},{"en":"Please define CODCF the first time you use it in the document.","zh":"请在文档中第一次使用 CODCF 时先写出它的全称/定义。"}]}],"phonetic":"/ˈsiː oʊ diː siː ɛf/","extraExplanation":["像这种不常见的缩写，最可靠的方法是看它出现的上下文：它在哪个行业/课程/软件里？前后句在谈什么？如果你把它所在的完整句子或截图发我，我可以更准确地判断它可能的全称与含义。"]}
{"word":"Codd","summary":{"en":"Codd is most commonly recognized as the name of Edgar F. Codd, a key figure in relational database theory; it is also a surname.","zh":"Codd 最常见的用法是指关系型数据库理论的重要人物埃德加·F·科德；它也可以作为姓氏使用。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper noun) Edgar F. Codd, the computer scientist best known for creating the relational model of databases (the idea behind modern SQL databases).","zh":"（专有名词）埃德加·F·科德（Edgar F. Codd），以提出“关系型数据库模型”而闻名的计算机科学家（现代 SQL 数据库的基础思想）。"},"examples":[{"en":"Codd proposed the relational model, which changed how data is stored and queried.","zh":"科德提出了关系模型，改变了数据的存储与查询方式。"},{"en":"Many database courses mention Codd when introducing relational databases.","zh":"很多数据库课程在介绍关系型数据库时都会提到科德。"}]},{"partOfSpeech":"other","definition":{"en":"(Proper noun) A surname (family name).","zh":"（专有名词）一个姓氏（家族姓）。"},"examples":[{"en":"Dr. Codd will speak at the conference.","zh":"科德博士将在会议上发言。"}]}],"phonetic":"/kɑd/","extraExplanation":["科德（E. F. Codd）在 1970 年发表论文提出“关系模型”（relational model），用“表（tables）”来组织数据，并强调用严格的数学思想来描述数据之间的关系。后来 SQL 等关系数据库技术在工业界广泛应用，因此他的名字常出现在数据库史与计算机课程中。"]}
{"word":"codd","summary":{"en":"“Codd” is a rare dialect spelling meaning “cod” (the fish).","zh":"“codd”是非常少见的方言拼写，意思是“cod”（鳕鱼）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Dialect, rare) A cod (a type of fish).","zh":"（方言，少见）鳕鱼（cod，一种鱼）。"},"examples":[{"en":"In some older dialect writing, “codd” can mean the fish cod.","zh":"在一些较早的方言写法中，“codd”可以指鳕鱼（cod）。"},{"en":"The fisherman brought home codd for dinner.","zh":"渔夫带回鳕鱼当晚餐。"}]}],"synonyms":["cod"],"phonetic":"/kɑd/","extraExplanation":["“codd”在现代英语里非常少见，更多时候你会看到标准拼写“cod”（鳕鱼）。","如果你想查的是“coddle”（溺爱；娇惯；悉心照料）或“CODD”之类的缩写，请告诉我上下文（句子/领域），我可以按你真正想要的词来解释。"]}
{"word":"codded","summary":{"en":"“Codded” usually means gently cooked in hot water (especially eggs); it can also be the past form of the cooking verb “cod.”","zh":"“codded”通常指（尤指鸡蛋）用热水温和地煮；也可作烹饪动词“cod”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Cooking) gently cooked in hot water below boiling, especially used for eggs.","zh":"（烹饪）用接近沸点但不沸腾的热水温和地煮（常指“温煮蛋”）。"},"examples":[{"en":"She served codded eggs with toast for breakfast.","zh":"她早餐端上温煮蛋和吐司。"},{"en":"Codded eggs have a softer texture than hard-boiled eggs.","zh":"温煮蛋的口感比水煮老的硬煮蛋更柔软。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “cod” (to cook gently in hot water, especially eggs).","zh":"“cod”的过去式/过去分词：（尤指鸡蛋）用热水温和地煮。"},"examples":[{"en":"He codded the eggs for about six minutes.","zh":"他把鸡蛋温煮了大约六分钟。"},{"en":"The eggs were codded until the whites set.","zh":"鸡蛋温煮到蛋白凝固为止。"}]}],"synonyms":["gently cooked","soft-cooked","poached (similar, not identical)"],"phonetic":"/ˈkɑdɪd/","extraExplanation":["“codded”在现代英语里最常见于烹饪语境，尤其是“codded eggs（温煮蛋）”。做法通常是用低于沸点的热水慢慢加热，有时还会用专门的小容器“egg coddler（温煮蛋盅）”。","很多学习者会把“codded”和“coddled”混淆：coddled（被溺爱、被娇惯）更常见，例如“He was coddled by his parents（他被父母溺爱）”。如果你想表达“被娇惯”，更可能要用“coddled”。"]}
{"word":"codder","summary":{"en":"“Codder” is uncommon; it’s usually a misspelling of “coder” (programmer). Rarely, it can mean a person involved in cod fishing/processing.","zh":"“codder”不常见；通常是“coder（程序员）”的误拼。少数情况下也可指从事鳕鱼捕捞/加工的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common misspelling) someone who writes computer code; a programmer.","zh":"（常见拼写误写）写电脑程序代码的人；程序员。"},"examples":[{"en":"She is a coder who builds mobile apps.","zh":"她是一名开发手机应用的程序员。"},{"en":"Many coders learn Python as a first language.","zh":"很多程序员把 Python 作为第一门编程语言来学。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) a person who catches or processes cod (a type of fish).","zh":"（较少见）捕捞或加工鳕鱼（cod）的人。"},"examples":[{"en":"In old coastal records, a codder was someone working in the cod fishery.","zh":"在一些旧的沿海记录里，codder 指在鳕鱼渔业里工作的人。"}]}],"synonyms":["coder","programmer","developer"],"phonetic":"/ˈkɑdɚ/","extraExplanation":["“codder”在现代英语里不算常用标准拼写。你大概率想写的是“coder”（程序员）。如果你告诉我你的句子语境（编程/渔业/别的），我可以帮你确认最合适的词。"]}
{"word":"codders","summary":{"en":"“codders” is usually a misspelling of “coders” (programmers). In rare British usage, it can mean people who tease or trick others.","zh":"“codders”通常是把“coders（程序员）”误拼了；在少见的英式用法里，也可指爱戏弄或蒙骗别人的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common misspelling) plural of “coder”: people who write computer programs (software developers).","zh":"（常见拼写错误）“coder”的复数：写计算机程序的人（程序员/软件开发者）。"},"examples":[{"en":"Our team has codders (coders) in New York and Taipei.","zh":"我们团队在纽约和台北都有程序员（常误写作 codders）。"},{"en":"Good codders (coders) test their code before releasing it.","zh":"好的程序员会在发布前测试代码。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) people who “cod” others—joke, tease, or trick someone (mainly British usage for “cod”).","zh":"（罕见）取笑、戏弄或骗别人的人（“cod”的施事者；主要为英式用法）。"},"examples":[{"en":"Don’t mind him—he’s just a codder who likes to tease people.","zh":"别理他——他就是爱逗人玩的那种人。"},{"en":"She realized the codders were only joking and wasn’t offended.","zh":"她发现那些人只是开玩笑，就没生气。"}]}],"synonyms":["coders","programmers","software developers","teasers","pranksters"],"phonetic":"/ˈkoʊdərz/","extraExplanation":["“codders”在英语里最常见的情况是把“coders（程序员）”误拼成了双写 d。标准拼法通常是“coder/coders”。","“to cod”表示“戏弄/开玩笑/蒙骗”偏英式、较口语，也比较少见；日常交流里更常用“tease, joke, prank, trick”。"]}
{"word":"Codding","summary":{"en":"“Codding” is usually a misspelling of “coding,” meaning programming or the use of code systems to label information.","zh":"“Codding”多半是“coding”的拼写错误，意思通常是“编程/写代码”，也可指“用编码系统给信息分类或标记”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity or job of writing computer programs (computer code)","zh":"编程；写代码（计算机程序）"},"examples":[{"en":"She’s learning coding to build her own app.","zh":"她在学编程，想做一个自己的应用。"},{"en":"Coding takes practice—start with small projects.","zh":"编程需要练习——从小项目开始。"},{"en":"He does coding every day at work.","zh":"他每天上班都在写代码。"}]},{"partOfSpeech":"n.","definition":{"en":"a system of using letters, numbers, or symbols to classify or label information (a “code”)","zh":"编码系统；用字母、数字或符号来分类/标记信息"},"examples":[{"en":"The hospital uses color coding for different levels of urgency.","zh":"医院用颜色编码来区分不同的紧急程度。"},{"en":"The data needs consistent coding before analysis.","zh":"数据在分析前需要一致的编码。"}]},{"partOfSpeech":"v.","definition":{"en":"writing computer code; creating instructions for a computer (often used as a -ing form)","zh":"编写代码；给计算机写指令（常作动名词/现在分词）"},"examples":[{"en":"I’m coding in Python right now.","zh":"我现在正在用 Python 写代码。"},{"en":"They spent the weekend coding the new feature.","zh":"他们周末在写新功能的代码。"}]}],"synonyms":["programming","software development","writing code","encoding","classification"],"phonetic":"/ˈkoʊdɪŋ/","extraExplanation":["“Codding”常见于把“coding（编程）”拼错了。标准拼写是 coding。","另外，英式英语里确实有口语“codding”，来自短语“cod someone”，意思是“开玩笑、戏弄（某人）”。例如：I’m only codding you.（我只是跟你开玩笑。）但这个用法不如 coding 常见。"]}
{"word":"codding","summary":{"en":"“Codding” usually means pampering (from “coddle”); in some British/Irish use it can mean “joking.” It’s also often a misspelling of “coding.”","zh":"“codding”通常指“溺爱/娇惯”（来自 coddle）；在部分英式/爱尔兰用法里也可指“开玩笑”。它也常被误拼为“coding（编程）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “coddle”) treating someone too gently; pampering or overprotecting.","zh":"（“coddle”的现在分词）过分溺爱；娇惯；过度保护。"},"examples":[{"en":"Stop codding him—he can carry his own bag.","zh":"别再惯着他了——他自己能背包。"},{"en":"Some parents end up codding their kids and not letting them try things alone.","zh":"有些父母会不知不觉地过度保护孩子，不让他们独立尝试。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal, chiefly British/Irish) joking; teasing; not serious.","zh":"（非正式，主要英式/爱尔兰用法）开玩笑的；逗趣的；不当真的。"},"examples":[{"en":"I’m only codding—you did a great job.","zh":"我只是开个玩笑——你做得很棒。"},{"en":"Don’t be upset; he was just codding with you.","zh":"别难过；他只是跟你开玩笑。"}]},{"partOfSpeech":"other","definition":{"en":"A common misspelling of “coding” (writing computer programs).","zh":"“coding”（编程）的常见拼写错误。"},"examples":[{"en":"If you mean computer programming, the usual spelling is “coding,” not “codding.”","zh":"如果你指的是计算机编程，通常拼写是“coding”，不是“codding”。"}]}],"synonyms":["pampering","spoiling","overprotecting","teasing","joking"],"phonetic":"/ˈkɑdɪŋ/","extraExplanation":["“codding”和“coding”只差一个字母，但意思差很多：\n- coding /ˈkoʊdɪŋ/：编程（来自 code）。\n- codding /ˈkɑdɪŋ/：多半与“coddle（溺爱）”有关；在部分英式口语里也可表示“开玩笑”。\n如果你想表达“编程”，建议改用拼写“coding”。"]}
{"word":"Coddington","summary":{"en":"Coddington is mainly used as an English surname and as a place name (especially in England).","zh":"Coddington 主要用作英语姓氏，也可作地名（尤指英格兰的一些地方）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a surname (family name) of English origin","zh":"一个英语姓氏（家族姓），起源于英格兰"},"examples":[{"en":"Dr. Coddington will see you now.","zh":"科丁顿医生现在会见你。"},{"en":"My teacher’s last name is Coddington.","zh":"我老师的姓是科丁顿。"}]},{"partOfSpeech":"other","definition":{"en":"a place name, especially villages in England (for example, Coddington in Lincolnshire or Nottinghamshire)","zh":"一个地名，尤指英格兰的一些村庄（例如林肯郡或诺丁汉郡的 Coddington）"},"examples":[{"en":"They moved to Coddington for a quieter life.","zh":"他们搬到科丁顿，想过更安静的生活。"},{"en":"Coddington is a small village in England.","zh":"科丁顿是英格兰的一个小村庄。"}]}],"phonetic":"/ˈkɑdɪŋtən/","extraExplanation":["“Coddington”常见于英国地名与姓氏。许多英语地名以“-ton”结尾，来自古英语，表示“农庄/聚落”。“-ing-”常带有“……的人/家族”之意，所以整体常可理解为“某个家族/族群的聚落”。具体含义会因历史来源不同而略有差异。","作为专有名词（人名/地名），英语书写时通常首字母大写：Coddington。读音在不同地区可能略有变化，但常见美式读法接近 /ˈkɑdɪŋtən/。"]}
{"word":"coddle","summary":{"en":"Coddle means to pamper someone too much or, in cooking, to gently cook food (often eggs) in hot water just below boiling.","zh":"coddle 指过分溺爱/娇惯某人；在烹饪中也指用将沸未沸的热水温煮（尤指鸡蛋）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to treat someone too gently or protectively; to pamper them","zh":"过分溺爱；娇惯；过度照顾（某人）"},"examples":[{"en":"Stop coddling him—he needs to learn to do things by himself.","zh":"别再溺爱他了——他得学会自己做事。"},{"en":"She was coddled as a child and found it hard to handle criticism later.","zh":"她小时候被娇惯，后来很难接受批评。"},{"en":"The new employee felt coddled when the manager checked on them every hour.","zh":"经理每小时都来问一次，让新员工觉得被过度照顾。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cook (especially eggs) gently in hot water just below boiling","zh":"（尤指鸡蛋）用将沸未沸的热水慢煮；温煮"},"examples":[{"en":"Coddle the eggs for about six minutes for a soft, creamy yolk.","zh":"鸡蛋温煮大约六分钟，蛋黄会柔软绵密。"},{"en":"He learned to coddle eggs instead of boiling them to avoid a rubbery texture.","zh":"他学会温煮鸡蛋而不是直接煮沸，以免口感变老变硬。"}]}],"synonyms":["pamper","spoil","baby","overprotect","mollycoddle","poach"],"phonetic":"/ˈkɑdəl/","extraExplanation":["“coddle”在“溺爱/娇惯”的用法里常带一点负面评价，暗示对方被保护得太多、缺少独立性。","与“pamper”相比，“coddle”更强调把人当成“很脆弱、需要被小心照顾”的感觉；与“spoil”相比，“coddle”更偏向“过度保护/过度体贴”，而不一定是用物质满足。"]}
{"word":"coddled","summary":{"en":"Coddled means treated too protectively or indulgently; it can also mean gently cooked in hot water (poached).","zh":"Coddled指被过度溺爱/过度保护；也可指用热水低温慢煮（如水波蛋）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to treat someone too kindly or protectively, so they don’t learn to handle difficulty","zh":"过度溺爱或过度保护（使其缺乏应对困难的能力）"},"examples":[{"en":"His parents coddled him, so he struggled when he moved out.","zh":"他父母太溺爱他了，所以他搬出去后很不适应。"},{"en":"Don’t coddle the new employee—give clear support, but let her solve problems too.","zh":"别太“护着”新员工——可以提供清晰支持，但也要让她自己解决问题。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cook food gently in hot water below boiling; to poach","zh":"用低于沸点的热水慢煮；（尤指）水波煮"},"examples":[{"en":"She coddled the eggs for breakfast.","zh":"她早餐用水波法煮了鸡蛋。"}]},{"partOfSpeech":"adj.","definition":{"en":"treated with too much care or protection","zh":"被过度照顾的；被溺爱的"},"examples":[{"en":"He grew up as a coddled child and hated taking risks.","zh":"他从小被溺爱，长大后很怕冒险。"}]}],"synonyms":["spoil","pamper","baby","overprotect","mollycoddle","poach"],"phonetic":"/ˈkɑd(ə)ld/","extraExplanation":["“coddled”是动词“coddle”的过去式/过去分词，也常用作形容词。日常语境里更常见的是“过度溺爱/过度保护”的含义，通常带一点负面评价（暗示缺乏独立性）。","烹饪义比较少见，多出现在食谱或较正式的烹饪写法里，意思接近“poach（做水波蛋）”。"]}
{"word":"coddler","summary":{"en":"A coddler is someone who treats another person too gently or protectively, often criticized for encouraging dependence.","zh":"coddler 指对他人过度温柔或保护、常被认为会助长依赖的“溺爱者/过度照顾的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who coddles someone—treating them too gently or protectively, often in a way that makes them less independent.","zh":"溺爱者；过度照顾（或过分保护）他人的人，常会让对方变得不够独立。"},"examples":[{"en":"Some people think a good teacher challenges students, not a coddler who never lets them struggle.","zh":"有些人认为好老师要能挑战学生，而不是从不让学生吃苦的“溺爱者”。"},{"en":"He’s not a coddler—he expects his kids to clean up after themselves.","zh":"他不是那种溺爱的人——他要求孩子们自己收拾干净。"}]}],"synonyms":["spoiler","enabler","overprotective parent","pamperer"],"phonetic":"/ˈkɑd(ə)lɚ/","extraExplanation":["“coddler”来自动词“to coddle”，原意与“把人裹得暖暖的、悉心照料”有关；在现代英语里多带批评意味，强调“过度保护/过度纵容”。","常见搭配：a coddler of children（溺爱孩子的人）、stop coddling someone（别再溺爱/纵容某人）。"]}
{"word":"coddlers","summary":{"en":"“Coddlers” means people who coddle—those who pamper or overprotect others too much.","zh":"“coddlers”指溺爱者/过度照顾者：把他人娇惯或过度保护的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of coddler: people who coddle someone (treat them too gently or protect them too much from difficulty).","zh":"coddler 的复数：指“溺爱者/过度照顾他人者”，把人照顾得过于周到，过度保护其免受困难。"},"examples":[{"en":"Some parents become coddlers and never let their kids solve problems on their own.","zh":"有些父母会变成溺爱者，从不让孩子自己解决问题。"},{"en":"The coach warned that coddlers don’t prepare athletes for real competition.","zh":"教练警告说，过度照顾的人无法让运动员为真正的比赛做好准备。"}]},{"partOfSpeech":"vt.","definition":{"en":"(related verb) to coddle: to treat someone too gently; to pamper or overprotect.","zh":"（相关动词）coddle：对某人过于温柔/娇惯；溺爱或过度保护。"},"examples":[{"en":"She doesn’t want to coddle her team; she wants them to grow.","zh":"她不想娇惯团队；她希望他们成长。"},{"en":"Don’t coddle him—let him learn from mistakes.","zh":"别太娇惯他——让他从错误中学习。"}]}],"synonyms":["pamperers","overprotective people","enablers","spoilers"],"phonetic":"ˈkɑd(ə)lɚ","extraExplanation":["“coddlers”在拼写上常被误写/混淆为“cuddlers”。“cuddlers”来自 cuddle（拥抱、搂抱），意思是“喜欢拥抱的人”；而“coddlers”来自 coddle（溺爱、娇惯），语气常带批评。"]}
{"word":"coddles","summary":{"en":"“Coddles” means (1) pampers or overprotects someone, often too much; (2) gently cooks food (less common).","zh":"“coddles”主要指（1）溺爱、娇惯、过度保护；（2）文火慢煮（较少见）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to pamper someone; to treat them too gently or protectively, often so they become less independent","zh":"溺爱；娇惯（对某人过度温柔或保护，常导致其不够独立）"},"examples":[{"en":"She coddles her youngest son and rarely lets him do chores.","zh":"她很娇惯最小的儿子，几乎不让他做家务。"},{"en":"If we coddle employees too much, they may avoid taking responsibility.","zh":"如果我们过度迁就员工，他们可能会逃避责任。"}]},{"partOfSpeech":"v.","definition":{"en":"to cook something gently, especially by simmering (less common in everyday speech)","zh":"文火煮；慢煨（较少见的用法）"},"examples":[{"en":"He coddles the eggs for a few minutes until the whites set.","zh":"他把鸡蛋用小火煮几分钟，直到蛋白凝固。"}]}],"synonyms":["pamper","spoil","baby","mollycoddle","overprotect"],"phonetic":"/ˈkɑdəl/","extraExplanation":["“coddles”是动词“coddle”的第三人称单数（he/she/it coddles）。日常里更常用的是“溺爱、娇惯”这一层含义，常带一点负面评价，暗示对方被照顾得“太过头”。","与“spoil（宠坏）”相比，“coddle”更强调过度呵护与保护；与“pamper（宠爱、享受式照顾）”相比，“coddle”更容易让人联想到让对方变得不够坚强或不独立。"]}
{"word":"coddling","summary":{"en":"Coddling means overprotecting someone (often criticized), and it can also mean gently cooking food, especially eggs.","zh":"coddling 指对某人过度呵护（常带批评意味）；也可指用小火/温水慢煮食物，尤指鸡蛋。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to treat someone too gently or protectively, so they do not face normal difficulties (often seen as unhelpful)","zh":"溺爱；过度呵护（常带贬义，指让人无法正常面对困难）"},"examples":[{"en":"Stop coddling him—let him solve the problem himself.","zh":"别再溺爱他了——让他自己解决问题。"},{"en":"Some parents worry they are coddling their children by doing everything for them.","zh":"有些父母担心自己事事代劳是在溺爱孩子。"}]},{"partOfSpeech":"v.","definition":{"en":"to cook food (especially an egg) gently in hot water below boiling","zh":"（用低于沸腾的热水）慢煮、温煮（尤指鸡蛋）"},"examples":[{"en":"She coddled the eggs for a soft, delicate texture.","zh":"她用温煮的方式煮鸡蛋，口感柔嫩。"}]}],"synonyms":["pampering","spoiling","babying","overprotecting","soft-boiling"],"phonetic":"/ˈkɑdəlɪŋ/","extraExplanation":["“coddling”通常是动词“coddle”的现在分词/动名词形式：可以描述正在发生的动作（They are coddling him.），也可以当名词用（Too much coddling can backfire. 过度呵护可能适得其反）。","在育儿与教育话题里，“coddle”常用来批评“过度保护”，隐含的观点是：适度挫折能帮助一个人更独立、更有韧性。"]}
{"word":"coddy","summary":{"en":"“Coddy” is a rare word, usually a dialect term for a codfish, and it can also appear as a nickname or surname.","zh":"“coddy”较罕见，通常是方言里对“鳕鱼”的称呼，也可能作为昵称或姓氏出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, dialect) A codfish; sometimes a small/young cod.","zh":"（罕见；方言）鳕鱼；有时指小鳕鱼/幼鳕鱼。"},"examples":[{"en":"In some coastal dialects, people might call a small cod a “coddy.”","zh":"在一些沿海方言里，人们可能把小鳕鱼叫作“coddy”。"},{"en":"The menu listed “coddy” as the local word for cod.","zh":"菜单上把“coddy”标注为当地对鳕鱼的叫法。"}]},{"partOfSpeech":"n.","definition":{"en":"(Very uncommon) A nickname or surname; also sometimes used as a spelling variant in names.","zh":"（很少见）昵称或姓氏；有时作为名字拼写的变体出现。"},"examples":[{"en":"He goes by Coddy in online games.","zh":"他在网络游戏里用 Coddy 这个昵称。"},{"en":"Coddy is listed as a family name in some records.","zh":"在一些记录中，Coddy 被列为一个姓氏。"}]}],"synonyms":["cod","codfish","(name) Cody"],"phonetic":"/ˈkɑdi/","extraExplanation":["“coddy”在现代标准英语中非常少见，常见词典里可能查不到或只标为方言/变体拼写。","如果你是想问更常见的词，可能是拼写接近的：\n- caddy：球童；（也可指小收纳盒）\n- Cody：常见人名\n- cuddy：英式/苏格兰用法里可指“小马、驴”（方言）\n你可以告诉我语境（句子/场景），我可以帮你确认最可能的词。"]}
{"word":"code","summary":{"en":"Code most commonly means a set of rules or a computer program, and it can also mean a secret password/system; as a verb, it means to program or to encode/classify.","zh":"code 常指规则体系或计算机代码，也可指密码/暗号；作动词时表示编程或对信息进行编码/分类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A system of rules, laws, or standards that people follow (often written down).","zh":"（成文的）规则体系；法规；准则。"},"examples":[{"en":"The company has a strict code of conduct.","zh":"这家公司有严格的行为准则。"},{"en":"The building code requires smoke alarms in every bedroom.","zh":"建筑法规要求每间卧室都要安装烟雾报警器。"}]},{"partOfSpeech":"n.","definition":{"en":"Instructions written for a computer (a programming language).","zh":"（计算机）代码；程序指令（用编程语言写成）。"},"examples":[{"en":"She wrote code to analyze the data.","zh":"她写了代码来分析数据。"},{"en":"This bug is somewhere in the code.","zh":"这个漏洞在代码的某个地方。"}]},{"partOfSpeech":"n.","definition":{"en":"A secret system of words, numbers, or symbols used to hide meaning.","zh":"密码；暗号；密语（用来隐藏真实含义的符号/文字系统）。"},"examples":[{"en":"They used a code to communicate safely.","zh":"他们用暗号来安全沟通。"},{"en":"What’s the code to unlock the door?","zh":"开门的密码是多少？"}]},{"partOfSpeech":"v.","definition":{"en":"To write computer programs; to create software instructions.","zh":"编程；写代码。"},"examples":[{"en":"He learned to code in high school.","zh":"他在高中学会了编程。"},{"en":"I code for a living.","zh":"我靠写代码谋生。"}]},{"partOfSpeech":"vt.","definition":{"en":"To put information into a coded form; to label or classify something with symbols or categories.","zh":"把信息编码；用符号/类别给……标记或分类。"},"examples":[{"en":"The data is coded by age group.","zh":"这些数据按年龄组进行了编码/分类。"},{"en":"Please code these files by priority.","zh":"请按优先级给这些文件分类标记。"}]}],"synonyms":["rules","standards","regulations","program","source code","cipher","password","encode"],"phonetic":"/koʊd/","extraExplanation":["常见搭配：code of conduct（行为准则）、building code（建筑规范/法规）、source code（源代码）、code review（代码审查）、code snippet（代码片段）。","文化/语境提示：在科技语境里，code 通常默认指“程序代码”；在日常生活里，code 常指“密码/门禁码/验证码”。","文学与修辞中，code 有时也引申为“隐含规则/不成文的规矩”（例如“a social code 社交规范”），强调群体内部默认遵守的行为方式。"]}
{"word":"code of conduct","summary":{"en":"“Code of conduct” means rules and standards for how people should behave in a group or profession.","zh":"“Code of conduct”指组织或职业领域中规定成员应如何行为的规则与标准（行为准则/职业操守）。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A set of written or agreed rules that describe expected behavior and ethical standards in a group (such as a workplace, school, or online community).","zh":"（团体/组织的）行为准则；规定成员应如何行为与遵守的道德标准（如公司、学校、线上社群）。"},"examples":[{"en":"All employees must read and follow the company’s code of conduct.","zh":"所有员工都必须阅读并遵守公司的行为准则。"},{"en":"The forum banned the user for breaking the code of conduct.","zh":"该论坛因用户违反行为准则而封禁了他/她。"},{"en":"Our team created a code of conduct to make meetings respectful and inclusive.","zh":"我们团队制定了行为准则，让会议更尊重他人并更具包容性。"}]},{"partOfSpeech":"phrase","definition":{"en":"A professional guide of ethics for people in a particular job or field (for example, doctors, teachers, or lawyers).","zh":"（职业领域的）职业操守规范；为某一行业从业者制定的职业伦理指南（如医生、教师、律师）。"},"examples":[{"en":"Journalists are expected to follow a code of conduct about accuracy and fairness.","zh":"记者应遵守关于准确性与公正性的职业操守规范。"},{"en":"The medical code of conduct requires patient confidentiality.","zh":"医疗行业的职业操守要求对患者信息保密。"}]}],"synonyms":["behavior policy","conduct policy","code of ethics","community guidelines"],"phonetic":"/ˌkoʊd əv ˈkɑndʌkt/","extraExplanation":["“conduct”在这里作名词，意思是“行为、举止”。“code”指“成文的规则/法规”。合起来就是“对行为的规则”。","常见相关表达：code of ethics（更强调“伦理/道德”原则）、company policy（公司政策，更广，未必只谈行为）、community guidelines（社群规范，常见于网站/平台）。","使用场景提示：在学校/公司/活动中，code of conduct通常会写明禁止事项（如骚扰、歧视）、举报渠道、以及违规后果（警告、停职、封禁等）。"]}
{"word":"code-breaking","summary":{"en":"Code-breaking is the activity of decoding encrypted messages, or anything related to that work.","zh":"code-breaking 指“破译加密信息的活动”，也可作形容词表示“与破译工作相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity of figuring out the meaning of coded (encrypted) messages without being told the key","zh":"破译（在不知道密钥的情况下解读加密信息的活动）"},"examples":[{"en":"Code-breaking played an important role in World War II.","zh":"破译在第二次世界大战中发挥了重要作用。"},{"en":"The team used math and computers for code-breaking.","zh":"这个团队用数学和电脑来进行破译。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to the work of breaking codes or ciphers","zh":"与破译密码/密文工作有关的"},"examples":[{"en":"She joined a code-breaking unit.","zh":"她加入了一个破译单位。"},{"en":"They built a code-breaking machine.","zh":"他们制造了一台破译机器。"}]}],"synonyms":["cryptanalysis","decoding","decryption","cipher-breaking"],"phonetic":"/ˈkoʊd ˌbreɪkɪŋ/","extraExplanation":["“code-breaking”常与“cryptography（密码学）/cryptanalysis（密码分析）”一起出现：cryptography 更偏“设计加密”，cryptanalysis/code-breaking 更偏“破解加密”。","在文化与历史语境里，这个词常让人联想到二战期间的破译工作，例如英国布莱切利园（Bletchley Park）对德军通信的破译，以及图灵（Alan Turing）等人的贡献；相关主题在电影《模仿游戏》(The Imitation Game) 中也被大众熟知。"]}
{"word":"code-broken","summary":{"en":"Code-broken means a secret code has been deciphered (most common); less commonly, it can mean software code is faulty.","zh":"Code-broken 通常指密码已被破译；较少见时可指程序代码有故障。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a secret message or system) successfully deciphered or decoded.","zh":"（指秘密信息或系统）已被破译、已被解码。"},"examples":[{"en":"The enemy’s encrypted radio messages were code-broken within days.","zh":"敌方加密的无线电信息在几天内就被破译了。"},{"en":"Once the cipher was code-broken, the investigators could read the full plan.","zh":"密码一旦被破译，调查人员就能读到完整计划。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common) having programming code that is faulty and causes something to fail.","zh":"（较少见）程序代码出了问题、导致系统无法正常运行的。"},"examples":[{"en":"After the update, the login page was code-broken and kept crashing.","zh":"更新后，登录页面的代码出问题了，一直崩溃。"},{"en":"We need to fix the code-broken script before releasing the app.","zh":"我们需要在发布应用前修复这段有问题的脚本。"}]}],"synonyms":["decoded","decrypted","cracked","broken (code)","buggy (software)"],"phonetic":"/ˈkoʊd ˌbroʊkən/","extraExplanation":["“code-broken”常见于情报与密码学语境，表示“密码被破译了”。二战时期的密码破译（codebreaking）非常有名，例如英国布莱切利园（Bletchley Park）的工作常被提及。","在软件语境里，说“code-broken”不如说“buggy / broken / the code is broken”更自然；“code-broken”可能听起来像临时造词或不太标准的表达。"]}
{"word":"code-free","summary":{"en":"Code-free means you can build or automate something without writing programming code.","zh":"Code-free 指无需编写程序代码就能完成搭建或自动化。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not requiring users to write computer code; made to be used through visual tools or simple settings.","zh":"无需编写程序代码的；可通过可视化工具或简单设置来使用的。"},"examples":[{"en":"This platform is code-free, so anyone can build a simple app with drag-and-drop tools.","zh":"这个平台是无需写代码的，所以任何人都能用拖拽工具做一个简单应用。"},{"en":"We chose a code-free website builder to launch the page quickly.","zh":"我们选择了一个无需写代码的网站搭建工具来快速上线页面。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Marketing/Business) Designed to let non-developers automate tasks or create workflows without programming.","zh":"（市场/商业语境）让非开发者无需编程即可自动化任务或创建工作流程的。"},"examples":[{"en":"The team adopted a code-free automation tool to connect forms, emails, and spreadsheets.","zh":"团队采用了一个无需写代码的自动化工具，把表单、邮件和表格连接起来。"},{"en":"Code-free workflows help sales teams move faster without waiting for engineering support.","zh":"无需写代码的工作流程能帮助销售团队更快推进，不必一直等工程支持。"}]}],"synonyms":["no-code","nontechnical","drag-and-drop","easy-to-use"],"phonetic":"/ˈkoʊd friː/","extraExplanation":["“code-free”常用于产品宣传与软件工具介绍，含义接近“no-code”。有时也会看到“code free”（不加连字符）或“code-free”连字符写法；作定语放在名词前时（如 code-free tool）用连字符更常见、更清晰。","“code-free”通常强调“完全不需要写代码”；而“low-code”表示“需要写一点点代码，但比传统开发少很多”。"]}
{"word":"code-making","summary":{"en":"Code-making means creating code—usually writing programming code, or sometimes creating a code system.","zh":"Code-making 指“制作代码”，通常是编写程序代码；也可指制定一套编码/规则体系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity of creating, writing, or designing code (usually computer programming code, but sometimes secret codes)","zh":"编写或设计“代码”的活动（通常指计算机程序代码，有时也指密码/暗号）"},"examples":[{"en":"Code-making is a core part of software development.","zh":"编写代码是软件开发的核心部分。"},{"en":"She enjoys code-making because it lets her build useful tools.","zh":"她喜欢编写代码，因为这让她能做出有用的工具。"}]},{"partOfSpeech":"n.","definition":{"en":"the creation of a system of rules or symbols used for communication or classification (a code)","zh":"制定一套用于交流或分类的规则/符号体系（编码体系）"},"examples":[{"en":"The team’s code-making focused on clear labels for medical data.","zh":"团队的编码体系制定重点是给医疗数据贴上清晰的标签。"},{"en":"Good code-making makes information easier to organize and share.","zh":"好的编码体系制定能让信息更容易整理和共享。"}]}],"synonyms":["coding","programming","writing code","code creation","codification"],"phonetic":"/ˈkoʊd ˌmeɪkɪŋ/","extraExplanation":["“code-making”不是最常见的固定搭配；在计算机领域，人们更常说“coding”“programming”或“writing code”。当你想强调“制定一套规则/编码体系”时，也可以用“codification”或“creating a code system”。","如果你是在谈“密码学/暗号”，更自然的表达是“code-making and code-breaking”（制码与破译），但现代英语里更常用“encryption”（加密）和“cryptanalysis”（密码分析）。"]}
{"word":"code-mixing","summary":{"en":"Code-mixing is mixing two or more languages within the same sentence or conversation.","zh":"code-mixing 指在同一句或同一段交流中混用两种或多种语言。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The practice of using words or phrases from two (or more) languages in the same conversation, sentence, or even clause.","zh":"在同一段对话、同一句话，甚至同一个分句中混用两种（或多种）语言的词或短语。"},"examples":[{"en":"In many bilingual families, code-mixing happens naturally at home.","zh":"在许多双语家庭里，在家里出现语码混用很自然。"},{"en":"Her message was code-mixed: “I’m late, 我马上到.”","zh":"她的信息是混合语码的：“I’m late, 我马上到。”}],"},{"en":"Teachers sometimes discourage code-mixing during exams, but it can help learning in class.","zh":"老师有时会在考试中不鼓励语码混用，但在课堂上它也可能帮助学习。"}]}],"synonyms":["language mixing","mixed-language speech","code-switching (related)"],"phonetic":"/ˈkoʊd ˌmɪksɪŋ/","extraExplanation":["“code”在语言学里常指“语言/方言/语体等语言系统”。“code-mixing（语码混用）”常被拿来和“code-switching（语码转换）”比较：一般来说，code-switching更强调在句子与句子之间或不同语境中切换语言；code-mixing更强调在同一句内部的混合。不过在日常使用中两者有时会被交替使用。","语码混用在许多社群中是自然且有功能的，比如表达亲密感、强调重点、借用更贴切的词、体现身份认同等。避免把它简单看成“语言不标准”，更接近一种双语能力的体现。"]}
{"word":"code-named","summary":{"en":"“Code-named” means given a secret or temporary name to keep something hidden or confidential.","zh":"“code-named”指“被赋予代号的”，用于保密或隐去真实名称。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"given a secret or temporary name used to hide the real identity of a person, project, plan, or operation","zh":"被赋予一个秘密或临时名称的，用来隐藏某个人、项目、计划或行动的真实身份"},"examples":[{"en":"The journalists learned about a code-named operation scheduled for next week.","zh":"记者得知一项代号行动计划于下周进行。"},{"en":"The company developed a code-named prototype before announcing the product publicly.","zh":"公司在公开发布产品前，开发了一个代号原型。"},{"en":"She worked on a code-named research project and couldn’t share details.","zh":"她参与了一个代号科研项目，不能透露细节。"}]}],"synonyms":["codenamed","under the code name","alias-named","secretly named"],"phonetic":"/ˈkoʊd neɪmd/","extraExplanation":["“code-named”常见于军事、情报、执法和科技行业，用来在文件或对外沟通中保密或简化称呼。比如“Operation Neptune Spear”（海神之矛行动）就是一个著名的行动代号。","写法上既可见到连字符形式 code-named，也常见合写 codename / codenamed。作形容词修饰名词时（a code-named mission）用连字符更常见、更清晰。"]}
{"word":"code-related","summary":{"en":"“Code-related” means connected with programming or source code.","zh":"“code-related”表示“与编程或源代码有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with computer programming or source code; involving writing, reading, testing, or managing code.","zh":"与计算机编程或源代码有关的；涉及编写、阅读、测试或管理代码的。"},"examples":[{"en":"Please report any code-related issues in the bug tracker.","zh":"请在缺陷跟踪系统里报告任何与代码相关的问题。"},{"en":"The meeting will focus on code-related tasks, like refactoring and testing.","zh":"这次会议将重点讨论与代码相关的任务，比如重构和测试。"}]}],"synonyms":["programming-related","code-centric","developer-focused","software-related"],"phonetic":"/ˈkoʊd rɪˌleɪtɪd/","extraExplanation":["“code-related”是一个复合形容词，常用连字符连接，用来修饰名词（如 code-related problem/changes/questions）。在更正式或技术写作中，放在名词前通常加连字符更清晰；放在名词后有时也可以不加（e.g., issues related to code）。","它偏“工作/技术语境”用法，比“programming-related”更强调具体的代码本身（提交、合并、风格、测试覆盖率等），而不是更广泛的编程学习或职业话题。"]}
{"word":"code-switched","summary":{"en":"“Code-switched” describes switching between languages or speaking styles, or it can be the past form of “code-switch.”","zh":"“code-switched”指在语言或说话风格之间切换，也可作“code-switch”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a speaker) having switched between two or more languages, dialects, or styles in the same conversation or situation.","zh":"（指说话者）在同一段对话或同一情境中在两种或多种语言、方言或表达风格之间进行了转换。"},"examples":[{"en":"In the meeting, she code-switched from Spanish to English when the client joined.","zh":"在会议上，客户加入后她从西班牙语切换到英语。"},{"en":"He sounded more formal at work, but at home he code-switched into a relaxed, local style.","zh":"他在工作时更正式，但在家会切换成更放松、更本地的说话方式。"}]},{"partOfSpeech":"v.","definition":{"en":"simple past / past participle of “code-switch”: to switch between languages or styles depending on audience, topic, or setting.","zh":"“code-switch”的过去式/过去分词：根据听众、话题或场合在不同语言或表达方式之间切换。"},"examples":[{"en":"I code-switched without thinking when my grandparents walked in.","zh":"爷爷奶奶走进来时，我不自觉就切换了说话方式/语言。"},{"en":"She has code-switched her whole life between school English and the language spoken at home.","zh":"她一生都在学校英语和家里使用的语言之间切换。"}]}],"synonyms":["alternated languages","shifted register","changed dialect","style-shifted","mixed languages"],"phonetic":"/ˈkoʊd swɪtʃt/","extraExplanation":["“code-switching（语码转换）”常见于双语/多语环境，也可以指在同一种语言里切换“语体”（例如更正式、更随意、更学术、更多俚语等）。","在一些文化语境里，“code-switching”不仅是语言技巧，也和身份认同、礼貌策略、融入群体、避免误解或应对偏见有关。","写作中偶尔会用“code-switched”来描述对话的真实感：人物在不同人面前用不同语言或语气，能体现关系亲疏与社会背景。"]}
{"word":"code-switching","summary":{"en":"Code-switching is switching between languages (or dialects) depending on the moment, audience, or purpose.","zh":"Code-switching（语码转换）指根据情境、对象或目的在不同语言（或方言/语体）之间切换。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the practice of changing between two or more languages (or language varieties) in the same conversation, sentence, or situation","zh":"在同一段对话、同一句子或同一情境中，在两种或多种语言（或同一语言的不同变体）之间切换的做法"},"examples":[{"en":"In many bilingual families, code-switching happens naturally at the dinner table.","zh":"在许多双语家庭里，吃饭聊天时自然就会发生语码转换。"},{"en":"She started in English, then code-switched to Spanish to speak to her grandmother.","zh":"她先用英语说话，然后为跟奶奶交流切换成了西班牙语。"},{"en":"The teacher explained that code-switching is common and not a sign of poor language ability.","zh":"老师解释说，语码转换很常见，并不表示语言能力差。"}]},{"partOfSpeech":"n.","definition":{"en":"(in writing, media, or performance) the deliberate mixing of languages or dialects for style, identity, humor, or realism","zh":"（在写作、媒体或表演中）为表达风格、身份认同、幽默或真实感而有意混用不同语言或方言"},"examples":[{"en":"The novel uses code-switching to show the character’s mixed cultural identity.","zh":"这本小说用语码转换来呈现人物的混合文化身份。"},{"en":"Many comedians use code-switching to connect with different audiences.","zh":"很多喜剧演员会用语码转换来与不同观众产生共鸣。"}]}],"synonyms":["language switching","code-switch"],"phonetic":"/ˈkoʊdˌswɪtʃɪŋ/","extraExplanation":["“Code”在语言学里常指“语言/方言/语体”，所以code-switching也常译为“语码转换”。","语码转换并不等于“夹杂外语显得高级”，更多时候是出于对象（对谁说）、场景（正式/非正式）、话题（学校/家庭）、情感与身份认同等原因。","相关概念：code-mixing（语码混用，常指更细碎地混杂）、dialect-switching（方言/口音切换）、register shift（语域变化，如把口语换成更正式的表达）。"]}
{"word":"codebase","summary":{"en":"A codebase is all the source code for a software project, viewed as a whole.","zh":"codebase 指一个软件项目的全部源代码（整体来看的一套代码）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The complete collection of source code for a software project (often including related files like configuration, scripts, and documentation).","zh":"（软件项目的）代码库；源代码的完整集合（常也包括配置文件、脚本、文档等相关文件）。"},"examples":[{"en":"Before we add new features, we should clean up the codebase.","zh":"在增加新功能之前，我们应该先整理一下代码库。"},{"en":"She knows the codebase well because she has maintained it for years.","zh":"她很熟悉这套代码库，因为她维护了很多年。"},{"en":"The team decided to split the codebase into smaller services.","zh":"团队决定把代码库拆分成更小的服务。"}]}],"synonyms":["source code","code (as a whole)","project code","software code"],"phonetic":"/ˈkoʊdbeɪs/","extraExplanation":["“codebase”是软件开发中非常常见的工作用语，通常指某个产品/系统的“所有代码”，不只是某一个文件或模块。","在日常交流里，它常与版本控制系统（如 Git）联系在一起，但“codebase”强调的是代码本身及其整体结构；而“repository / repo（代码仓库）”更强调存放与管理代码的地方（比如 Git 仓库）。","常见搭配：legacy codebase（遗留/老旧代码库）、shared codebase（共享代码库）、monolithic codebase（单体代码库）、refactor the codebase（重构代码库）。"]}
{"word":"codebases","summary":{"en":"“Codebases” means multiple collections of source code for software projects.","zh":"“Codebases”指多个软件项目的源代码集合（多个代码库/代码基）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the complete set of source code (and related files) for a software project; plural of “codebase”","zh":"（软件项目的）全部源代码（及相关文件）的集合；“codebase”的复数"},"examples":[{"en":"Large companies often maintain many codebases for different products.","zh":"大型公司通常会为不同产品维护许多代码库（codebases）。"},{"en":"We need to update all affected codebases after the security fix.","zh":"安全修复之后，我们需要更新所有受影响的代码库。"}]}],"synonyms":["source code","repositories (informal overlap)","code repositories","projects (context-dependent)"],"phonetic":"/ˈkoʊdˌbeɪsiz/","extraExplanation":["“codebase”在实际工作中常常和“repository / repo（代码仓库）”一起出现：codebase更强调“代码本身及其整体结构”，repo更强调“存放与版本管理的地方（如Git仓库）”。一个repo里可能包含一个或多个codebases（例如monorepo）。"]}
{"word":"codebook","summary":{"en":"A codebook is a reference that explains codes—either for secret messages or for organizing/interpreting data.","zh":"codebook 指“代码/密码对照表或手册”，可用于加解密，也可用于说明数据如何编码与分类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A book or document that lists codes (symbols, numbers, or words) and what they mean, used to encode, decode, or interpret messages or data.","zh":"密码本；代码手册（列出各种代码/符号/数字及其含义，用于加密、解密或解释信息/数据）。"},"examples":[{"en":"The spy hid a codebook in a hollowed-out dictionary.","zh":"间谍把密码本藏在一本挖空的词典里。"},{"en":"Without the codebook, the radio message was impossible to decode.","zh":"没有密码本，那条无线电信息无法解码。"}]},{"partOfSpeech":"n.","definition":{"en":"A reference document that explains how information is categorized and labeled (for example, in surveys, research, or billing).","zh":"编码说明书；变量/分类说明文档（用于调查、研究或结算等，解释数据如何被分类和标注）。"},"examples":[{"en":"Before analyzing the survey, read the codebook to understand each variable.","zh":"在分析问卷之前，先读编码说明书来理解每个变量。"},{"en":"The hospital updated its billing codebook for the new year.","zh":"医院为新的一年更新了收费编码手册。"}]}],"synonyms":["cipher book","code manual","coding manual","data dictionary"],"phonetic":"/ˈkoʊdˌbʊk/","extraExplanation":["“codebook”在日常英语里既可指“密码本/密钥册”（与密码学、情报活动相关），也常见于数据分析与社会科学研究中，指“数据字典/变量说明”（例如问卷选项如何编码成0/1/2）。语境不同，含义差别很大。","相关近义说法：数据语境里常用“data dictionary（数据字典）”“coding manual（编码手册）”；密码学语境里也会说“cipher book（密码书）”。"]}
{"word":"codebooks","summary":{"en":"Codebooks are reference lists that explain codes—used for secret messages, data labeling, or (in computing) compression patterns.","zh":"codebooks 指“代码/密码对照表或说明文档”，可用于机密通信、数据标注说明，或计算机中的压缩/模式表示。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A book (or digital document) that lists codes and what they mean, used to encode/decode messages or information.","zh":"（纸质或电子的）密码本/代码本：列出各种代码及其含义，用来给信息编码或解码。"},"examples":[{"en":"The agent memorized the codebook before the mission.","zh":"特工在任务前把密码本内容背了下来。"},{"en":"Without the codebook, the intercepted message was meaningless.","zh":"没有密码本，被截获的信息就毫无意义。"}]},{"partOfSpeech":"n.","definition":{"en":"A reference document that explains how data values are labeled and recorded (for example, in surveys or research datasets).","zh":"（数据/问卷的）编码说明书：解释数据变量如何命名、各数值代表什么，以及如何记录。"},"examples":[{"en":"Check the codebook to see what “1” and “2” mean in the dataset.","zh":"查看编码说明书，了解数据里“1”和“2”分别代表什么。"},{"en":"The research team published a codebook with the survey results.","zh":"研究团队随调查结果一起发布了编码说明书。"}]},{"partOfSpeech":"n.","definition":{"en":"In computing (especially signal processing and machine learning), a set of representative patterns used to compress or categorize data.","zh":"（计算机领域，尤指信号处理/机器学习）码本：一组“代表性模式/向量”，用于压缩或分类数据。"},"examples":[{"en":"The audio codec uses a codebook to compress speech efficiently.","zh":"该音频编码器使用码本来高效压缩语音。"}]}],"synonyms":["cipher book","codebook (singular)","data dictionary","coding manual","reference guide"],"phonetic":"/ˈkoʊdˌbʊk/","extraExplanation":["“codebook”由 code（代码/密码）+ book（书）构成；复数是 codebooks。除了传统的“密码本”，在数据分析里它常指“变量说明/字段字典”，相当于告诉你每一列数据是什么意思。","在间谍小说或战争题材作品中，codebook 常与 cipher（密码体系）一起出现：codebook 更偏“约定的代号表”，cipher 更偏“加密算法/规则”。"]}
{"word":"codebreak","summary":{"en":"Codebreak means to decode a secret code or encrypted message, or the act of doing so.","zh":"codebreak 指“破译密码/加密信息”，也可指“破译的过程或一次破译”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to figure out (decode) a secret code or encrypted message","zh":"破译（解读）密码或加密信息"},"examples":[{"en":"The team tried to codebreak the encrypted email.","zh":"团队试图破译那封加密邮件。"},{"en":"She learned basic methods to codebreak simple ciphers.","zh":"她学习了破译简单密码的基础方法。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or process of breaking a code; a successful decoding","zh":"破译密码的行为或过程；一次成功的破译"},"examples":[{"en":"The codebreak took hours of careful work.","zh":"这次破译花了好几个小时的细致工作。"}]}],"synonyms":["decode","decrypt","break the code","crack (a code)"],"phonetic":"/ˈkoʊdˌbreɪk/","extraExplanation":["“codebreak”更常见的写法是两个词：code break（名词）/ code-break（作定语时也常见，如code-breaking techniques）。动词通常写作codebreak或code-break都能看到，但在正式写作里更常用break the code。","在英语文化语境中，codebreaking常让人联想到二战时期英国布莱切利庄园（Bletchley Park）对德军“恩尼格玛”（Enigma）密码的破译，这是相关题材影视与书籍里很常见的背景。"]}
{"word":"codebreaker","summary":{"en":"A codebreaker is someone who solves secret codes to understand hidden messages.","zh":"codebreaker指破译秘密密码、从而读懂隐藏信息的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who breaks (solves) secret codes or ciphers, often to read hidden messages","zh":"破译密码的人；密码破译者（用来解读加密信息）"},"examples":[{"en":"During the war, skilled codebreakers helped uncover enemy plans.","zh":"在战争期间，熟练的密码破译者帮助揭露了敌方计划。"},{"en":"She works as a codebreaker, analyzing encrypted messages for patterns.","zh":"她是一名密码破译者，通过分析加密信息来寻找规律。"},{"en":"The movie tells the story of a young codebreaker racing against time.","zh":"这部电影讲述了一位年轻的密码破译者与时间赛跑的故事。"}]}],"synonyms":["cryptanalyst","decoder","cipher breaker"],"phonetic":"/ˈkoʊdˌbreɪkər/","extraExplanation":["“codebreaker”常让人联想到二战时期的密码战，尤其是英国布莱切利园（Bletchley Park）对德军“恩尼格玛”（Enigma）密码机的破译工作；相关人物如Alan Turing也因此广为人知。","在现代语境里，它既可以指政府/军方的密码分析人员，也可以泛指信息安全领域中研究破解加密算法的人；但在日常英语里更常用于历史、新闻或影视作品的叙述。"]}
{"word":"codebreakers","summary":{"en":"“Codebreakers” means people who decipher secret codes or ciphers.","zh":"“codebreakers”指“破译秘密密码或密文的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who decipher or solve secret codes or ciphers (often in military, intelligence, or cybersecurity work).","zh":"破译密码的人；密码破译者（常见于军事、情报或网络安全领域）。"},"examples":[{"en":"During World War II, codebreakers helped read encrypted enemy messages.","zh":"在第二次世界大战期间，密码破译者帮助解读敌方的加密信息。"},{"en":"Modern codebreakers may work on breaking weak encryption to test security.","zh":"现代的密码破译者可能会破解薄弱的加密方式，以测试安全性。"}]}],"synonyms":["cryptanalysts","cipher solvers","decoders"],"phonetic":"/ˈkoʊdˌbreɪkərz/","extraExplanation":["“Codebreakers”常让人联想到二战时期英国布莱切利园（Bletchley Park）的破译团队，以及艾伦·图灵（Alan Turing）等人的工作。他们的破译成果被认为显著影响了战争进程。","在日常英语里，codebreaker也可以比喻“破解难题的人”（比如解开复杂谜题或找到问题关键的人），但最常见的还是“破译密码/密文”的字面含义。"]}
{"word":"codebreaking","summary":{"en":"Codebreaking means decoding secret messages or the field/skill of breaking codes.","zh":"Codebreaking 指破译密码、解码，也可指从事破解密码的技能与领域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or skill of solving coded messages (decoding), often by finding patterns or using special knowledge","zh":"破译密码；解码（指通过规律、技巧或知识读懂加密信息的行为或能力）"},"examples":[{"en":"Codebreaking was crucial during the war.","zh":"战争时期，破译密码至关重要。"},{"en":"She studied math and linguistics to work in codebreaking.","zh":"她学习数学和语言学，准备从事破译密码工作。"},{"en":"Modern codebreaking often uses computers to test many possibilities quickly.","zh":"现代破译密码常用计算机快速测试大量可能性。"}]},{"partOfSpeech":"n.","definition":{"en":"the process or field of analyzing and breaking secret codes used in communication (a part of cryptography/cryptanalysis)","zh":"密码破译学；密码分析领域（研究如何破解通信中使用的密钥与算法）"},"examples":[{"en":"He wrote a paper on codebreaking techniques.","zh":"他写了一篇关于密码破译技术的论文。"},{"en":"The museum has an exhibit on codebreaking and early computers.","zh":"这家博物馆有一个关于密码破译与早期计算机的展览。"}]}],"synonyms":["cryptanalysis","decoding","decryption","cipher-breaking"],"phonetic":"/ˈkoʊdˌbreɪkɪŋ/","extraExplanation":["“codebreaking”常与历史上的情报工作联系在一起，最著名的例子之一是二战时期对德军“恩尼格玛（Enigma）”密码系统的破译；英国布莱切利园（Bletchley Park）的研究常被视为现代计算与密码分析发展的重要推动力。","相关词区分：cryptography（密码学，强调“加密/设计安全通信”），cryptanalysis（密码分析，强调“破解/分析密码”）；codebreaking通常更偏向“破解”这一侧。"]}
{"word":"codebtor","summary":{"en":"A co-debtor is someone who shares legal responsibility for a debt with another person.","zh":"co-debtor 指与他人共同承担同一债务法律责任的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who shares a debt with another person and is legally responsible for paying it (often written as “co-debtor”).","zh":"与他人共同承担债务的人，并在法律上对还款负有责任（常写作 co-debtor）。"},"examples":[{"en":"If one co-debtor doesn’t pay, the other may have to pay the full amount.","zh":"如果其中一位共同债务人不还款，另一位可能需要承担全部金额。"},{"en":"She became a co-debtor on the loan to help her brother qualify.","zh":"她成为该贷款的共同债务人，以帮助弟弟通过审核。"}]}],"synonyms":["co-debtor","coborrower","joint debtor"],"phonetic":"/ˌkoʊˈdɛtər/","extraExplanation":["“codebtor”更常见的标准拼写是“co-debtor”（有连字符）或“coborrower”（共同借款人）。在实际合同里，两者有时会被混用，但也可能有细微差别：coborrower通常强调一起借款；co-debtor强调共同承担债务责任。具体以合同用词为准。"]}
{"word":"codebtors","summary":{"en":"“Co-debtors” are people who share responsibility for the same debt or loan.","zh":"“Co-debtors”指共同承担同一笔债务或贷款责任的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who share a debt or loan responsibility together (two or more borrowers who owe the same debt)","zh":"共同债务人；连带债务人（两人或多人共同承担同一笔债务/贷款）"},"examples":[{"en":"If one of the co-debtors stops paying, the other may still be responsible for the full amount.","zh":"如果其中一位共同债务人停止还款，另一位仍可能需要承担全部金额。"},{"en":"The bank required both partners to sign as co-debtors on the mortgage.","zh":"银行要求两位伴侣都作为共同债务人在房贷合同上签字。"}]}],"synonyms":["co-borrowers","joint debtors","joint obligors"],"phonetic":"ˌkoʊˈdɛtərz","extraExplanation":["“codebtors”通常是拼写/排版写法，更常见的标准写法是 **co-debtors**（也可写作 **co-debtors** 或 **co-debtors**，以连字符最常见）。","在法律与金融语境中，共同债务人常涉及 **joint and several liability（连带责任）**：债权人可能有权向任何一位共同债务人追讨全部欠款，具体以合同条款与当地法律为准。"]}
{"word":"CODEC","summary":{"en":"A codec is hardware/software or a standard that compresses and decompresses digital audio/video.","zh":"codec 指用于压缩与解压数字音视频的编解码器或编解码标准。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device or software that encodes (compresses) and decodes (decompresses) digital audio or video so it can be stored or transmitted efficiently","zh":"（音视频）编解码器：用于把数字音频/视频进行编码（压缩）和解码（解压）的硬件或软件，以便高效存储或传输"},"examples":[{"en":"This video won’t play because your computer doesn’t have the right codec.","zh":"这个视频播不了，因为你的电脑没有合适的编解码器。"},{"en":"Streaming services use modern codecs to reduce file size while keeping good quality.","zh":"流媒体平台使用较新的编解码器，在保持较好画质的同时减少文件大小。"},{"en":"H.264 is a widely used video codec.","zh":"H.264 是一种广泛使用的视频编解码器。"}]},{"partOfSpeech":"n.","definition":{"en":"a specific coding/decoding standard or format used for audio or video (e.g., AAC, Opus, HEVC)","zh":"（音视频）某一种编解码标准/格式（如 AAC、Opus、HEVC 等）"},"examples":[{"en":"The camera records in the HEVC codec to save storage space.","zh":"这台相机用 HEVC 编解码格式录制，以节省存储空间。"},{"en":"Choose the Opus codec for clear voice calls on slow connections.","zh":"在网速较慢时，选 Opus 编解码格式有助于保持清晰的语音通话。"}]}],"synonyms":["coder-decoder","encoder/decoder","compression format","audio codec","video codec"],"phonetic":"/ˈkoʊdɛk/","extraExplanation":["“codec”来自“coder-decoder”（编码器-解码器）的缩写，常见于视频播放、直播、会议软件、手机录屏与蓝牙音频等场景。","学习时可区分：codec（如何压缩/解压的“方法”）与 container（封装格式，如 MP4、MKV，用来把视频、音频、字幕等“装在一起”）。例如：MP4（容器）里可能装 H.264（视频codec）+ AAC（音频codec）。"]}
{"word":"codec","summary":{"en":"A codec is a tool or software that encodes/decodes (often compresses/decompresses) audio or video for storage and playback.","zh":"Codec 指对音视频进行编码/解码（常含压缩/解压）的工具或软件，用于存储、传输与播放。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device, program, or method that compresses and decompresses (or encodes and decodes) digital audio/video data so it can be stored or transmitted and then played back","zh":"编解码器：用于对数字音频/视频数据进行压缩与解压（或编码与解码）的设备、程序或方法，以便存储/传输并在之后播放"},"examples":[{"en":"This video won’t play because your computer doesn’t have the right codec.","zh":"这个视频播放不了，因为你的电脑没有正确的编解码器。"},{"en":"H.264 is a common codec for online video streaming.","zh":"H.264 是在线视频流媒体中常见的编解码器。"},{"en":"Switching to a more efficient codec can reduce file size without much loss of quality.","zh":"换用更高效的编解码器可以在画质损失不大的情况下减小文件体积。"}]}],"synonyms":["encoder/decoder","compressor/decompressor","coder-decoder"],"phonetic":"/ˈkoʊ.dɛk/","extraExplanation":["“codec”是“coder-decoder”或“compressor-decompressor”的缩写，常见于多媒体与通信领域。","日常里人们常把“codec”和“format（格式）”混用：严格来说，MP4/MKV 这类是“容器（container）”，里面可以装不同的“编码（codec）”，例如 MP4 容器里可能是 H.264 或 H.265 视频编码。"]}
{"word":"codeclination","summary":{"en":"“Codeclination” is not a standard English word; you likely mean “declination,” meaning a refusal, a decrease/slope, or (in science) an angle such as magnetic declination or a star’s declination.","zh":"“codeclination”不是标准英语词；你可能想写“declination”，可指婉拒、下降/下倾趋势，或（科学语境）如磁偏角、天体赤纬等角度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended word) A polite refusal of an offer or invitation.","zh":"（可能想写的词）对邀请或提议的礼貌拒绝。"},"examples":[{"en":"Thank you for the offer, but I must decline.","zh":"谢谢你的好意，但我必须婉拒。"},{"en":"Her declination of the invitation was respectful and brief.","zh":"她对邀请的婉拒既礼貌又简短。"}]},{"partOfSpeech":"n.","definition":{"en":"A downward slope or movement; a decrease.","zh":"下降的倾斜/趋势；减少。"},"examples":[{"en":"There was a declination in sales after the holiday season.","zh":"假期过后销量出现了下降。"},{"en":"The road’s declination made cycling difficult.","zh":"道路的下坡坡度让骑行变得困难。"}]},{"partOfSpeech":"n.","definition":{"en":"(Astronomy/Geography) The angular distance of a point north or south of the celestial equator; in navigation, sometimes used for the difference between true north and magnetic north (magnetic declination).","zh":"（天文/地理）天体相对天球赤道的赤纬；在航海/地理中也可指真北与磁北的夹角（磁偏角）。"},"examples":[{"en":"The star’s declination helps locate it in the night sky.","zh":"恒星的赤纬有助于在夜空中定位它。"},{"en":"Pilots adjust for magnetic declination when navigating.","zh":"飞行员导航时会校正磁偏角。"}]}],"synonyms":["refusal","decline","decrease","drop","downturn","slope"],"phonetic":"/ˌdɛkləˈneɪʃən/","extraExplanation":["“codeclination”在英语中不是常见或标准拼写。你可能想输入的是 **declination**（最常见），也有人会把 **decline**（动词“拒绝/下降”）和 **declination**（名词）混淆。","词源小提示：declination 来自拉丁语，核心意思是“向下倾/偏离”，所以既能表示“下降”，也能引申到“拒绝”（把提议“向下放回去”）。","相关常见搭配：declination of an invitation（婉拒邀请）；a sharp declination（急剧下降）；magnetic declination（磁偏角）。"]}
{"word":"codecree","summary":{"en":"Decree means an official order or judgment, and it can also be the verb meaning “to officially order/decide.”","zh":"Decree 指官方命令或（法院）判决，也可作动词表示“正式下令/裁定”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A legal or official order (especially one made by a court or a government).","zh":"（尤指法院或政府发布的）法令；判决；正式命令。"},"examples":[{"en":"The judge issued a decree ending the dispute.","zh":"法官发布判决，结束了这场纠纷。"},{"en":"The government passed a decree to protect historic buildings.","zh":"政府颁布法令以保护历史建筑。"}]},{"partOfSpeech":"vt.","definition":{"en":"To officially decide or order something.","zh":"正式裁定；下令；颁布（命令/法令）。"},"examples":[{"en":"The court decreed that the company must pay damages.","zh":"法院裁定该公司必须赔偿损失。"},{"en":"The king decreed a day of national mourning.","zh":"国王下令设立全国哀悼日。"}]}],"synonyms":["order","edict","ruling","judgment","mandate"],"phonetic":"/dɪˈkriː/","extraExplanation":["“codecree” 不是常见英文单词，很可能是拼写错误或把两个词连在一起了。你可能想查的是 **decree**（法令/判决）。","如果你本来想表达“共同发布的判决/共同法令”，英语更常见的说法是 **joint decree**（联合命令/联合判决）或在法律语境中用 **consent decree**（同意判决，常指双方达成和解后由法院确认并具有约束力的协议）。"]}
{"word":"codecs","summary":{"en":"“Codecs” means the compression/decompression systems (or supported formats) used for digital audio and video.","zh":"“Codecs”指数字音视频的编解码（压缩/解压）系统，也可指设备支持的编解码格式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of codec: a method (and often the software/hardware) used to compress and decompress digital audio or video so it can be stored or streamed.\nExamples: (1) “This video won’t play because the right codecs aren’t installed.” (2) “YouTube uses modern codecs to reduce file size.”","zh":"codec 的复数：用于压缩与解压数字音频/视频的方法（也常指实现这种方法的软件或硬件），让内容更易于存储或传输/播放。\n例句：(1)“这个视频播不了，因为没装对的 codecs（编解码器）。”(2)“YouTube 使用较新的 codecs 来减小文件体积。”"},"examples":[{"en":"This video won’t play because the right codecs aren’t installed.","zh":"这个视频播不了，因为没装对的编解码器。"},{"en":"Streaming services use efficient codecs to save bandwidth.","zh":"流媒体服务会用更高效的编解码器来节省带宽。"}]},{"partOfSpeech":"n.","definition":{"en":"(computing) the set of audio/video formats or encoders/decoders a device or app supports.\nExamples: (1) “My phone supports more audio codecs than my old one.” (2) “Check the Bluetooth codecs in your settings.”","zh":"（计算机/数码）指设备或应用所支持的一组音/视频编码与解码格式。\n例句：(1)“我这台手机支持的音频编解码器比旧的多。”(2)“去设置里看看蓝牙支持哪些 codecs（如 AAC/aptX）。”"},"examples":[{"en":"My phone supports more audio codecs than my old one.","zh":"我这台手机支持的音频编解码器比旧的多。"},{"en":"Check which Bluetooth codecs your headphones can use.","zh":"看看你的耳机能用哪些蓝牙音频编解码器。"}]}],"synonyms":["encoders/decoders","compression formats","media formats"],"phonetic":"/ˈkoʊˌdɛks/","extraExplanation":["“codec”来自 COder/DECoder（编码器/解码器）的缩写。日常交流里人们常把它泛指“某种视频/音频压缩标准”或“能让文件播放的组件”。","常见视频编解码器：H.264/AVC、H.265/HEVC、VP9、AV1。常见音频编解码器：AAC、MP3、Opus。蓝牙音频里也常说 codec（如 SBC、AAC、aptX、LDAC）。","学习提示：在电脑问题场景中，codecs 常和 “install / missing / supported / compatible / playback” 等词一起出现。"]}
{"word":"coded","summary":{"en":"“Coded” most often means written in a code or expressed in an indirect/hidden way; it can also be the past form of “code.”","zh":"“coded”常指“用代码写成/编码的”或“带有隐晦暗示的”；也可作“code”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Written or communicated using a code (symbols, numbers, or special rules) so it can be stored, sent, or understood in a specific way.","zh":"用代码（符号、数字或特定规则）写成或传达的，以便存储、传输或按特定方式理解。"},"examples":[{"en":"The message was coded so only the team could read it.","zh":"这条信息被编码了，只有团队成员能读懂。"},{"en":"The data is coded before it is uploaded to the server.","zh":"数据在上传到服务器之前会被编码。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having a hidden or indirect meaning that is understood mainly by people “in the know.”","zh":"带有隐藏或间接含义的（通常只有圈内人或特定群体才能领会）。"},"examples":[{"en":"His comment sounded coded, like it meant something more.","zh":"他的话听起来像是暗含别意。"},{"en":"Some articles use coded language to avoid direct criticism.","zh":"有些文章用隐晦的措辞来避免直接批评。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “code”: to put information into a system of symbols or into a computer-readable form.","zh":"“code”的过去式/过去分词：把信息编成符号系统或转换成计算机可读的形式。"},"examples":[{"en":"She coded the survey answers into categories.","zh":"她把问卷答案编码并归类。"},{"en":"The programmer coded the feature in two days.","zh":"程序员两天就把这个功能写出来了。"}]}],"synonyms":["encrypted","encoded","in code","cryptic","veiled","implicit"],"phonetic":"/ˈkoʊdɪd/","extraExplanation":["在英语里，coded language（隐晦/暗号式语言）常用于描述“表面在说A，其实在暗示B”的表达方式；它不一定是密码学意义上的“加密”，更多是社交或政治语境中的“含蓄暗示”。使用时注意场合：说某人“using coded language”有时是在暗示对方在影射、回避或试图传递只让特定人懂的信息。"]}
{"word":"Codee","summary":{"en":"“Codee” is an informal or name-like spelling that usually means “a person who codes,” similar to “coder,” and it can also be an online handle or a variant of “Cody.”","zh":"“Codee”多为非正式或名字式拼写，通常指“写代码的人”，类似“coder”；也可能是网名或 “Cody” 的变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A person who codes; someone learning or doing computer programming. Often used as a playful or brand-like spelling of “coder.”","zh":"（非正式）写代码的人；正在学习或从事编程的人。常作为“coder（程序员）”的俏皮/品牌式拼写。"},"examples":[{"en":"Our workshop is open to beginners and experienced codees.","zh":"我们的工作坊对初学者和有经验的“codee（写代码的人）”都开放。"},{"en":"She’s a new codee, so she asks a lot of questions.","zh":"她是个新手 codee，所以会问很多问题。"}]},{"partOfSpeech":"other","definition":{"en":"A name/handle (proper noun) used online; may also be a variant spelling of the name “Cody.”","zh":"（专有名词）网名/昵称；也可能是名字 “Cody” 的变体拼写。"},"examples":[{"en":"Codee posted the solution in the forum.","zh":"Codee 在论坛里发了这个解法。"}]}],"synonyms":["coder","programmer","developer"],"phonetic":"/ˈkoʊdi/","extraExplanation":["“Codee”在标准英语词典里不算常见拼写，更常见的是“coder”。不过在社群、课程、账号名里，人们会用“-ee”这种结尾来制造一种“某类人/参与者”的感觉（例如 employee, trainee）。因此“codee”常被理解为“写代码的人/学员”。"]}
{"word":"codefendant","summary":{"en":"A codefendant is one of two or more defendants in the same legal case.","zh":"codefendant 指同一法律案件中的共同被告之一。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who is on the same side in a lawsuit or criminal case as another defendant; one of two or more defendants in the same case.","zh":"（同一案件中的）共同被告；与另一名被告一起被起诉/受审的人。"},"examples":[{"en":"The prosecutor offered the codefendant a plea deal in exchange for testimony.","zh":"检察官向共同被告提出认罪协商，以换取其出庭作证。"},{"en":"Her lawyer argued that her codefendant was responsible for the stolen goods.","zh":"她的律师主张盗窃物品应由她的共同被告负责。"}]}],"synonyms":["co-defendant","joint defendant"],"phonetic":"/ˌkoʊdɪˈfendənt/","extraExplanation":["“Codefendant”常用于美国法律语境（刑事与民事都可用），指同一案件中被同时起诉的多个被告之一。","拼写上也常见作“co-defendant”。在刑事案件里，共同被告之间可能出现利益冲突：例如一方为了减轻刑罚而指证另一方。"]}
{"word":"codefendants","summary":{"en":"“Codefendants” means people who are defendants together in the same legal case.","zh":"“codefendants”指在同一案件中一起被起诉的共同被告。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is accused in the same court case as another defendant","zh":"在同一案件中与他人一起被指控的被告（共同被告）"},"examples":[{"en":"The two codefendants were charged with robbery.","zh":"这两名共同被告被指控抢劫。"},{"en":"One codefendant agreed to testify against the others.","zh":"其中一名共同被告同意出庭作证指控其他人。"}]}],"synonyms":["co-defendants","joint defendants"],"phonetic":"/ˌkoʊdɪˈfendənts/","extraExplanation":["“Codefendant”是法律用语：co- 表示“共同、一起”，defendant 是“被告”。因此 codefendant 指“同案被告/共同被告”。","在新闻或法庭语境中很常见；普通日常对话里不常用。常见搭配：codefendant(s), co-defendant(s)（也常见带连字符的拼写）。","注意与“accomplice（同伙）”不同：accomplice 强调一起犯罪的同伙；codefendant 强调法律程序上同案被告的身份，两者有时重叠但不完全等同。"]}
{"word":"codefest","summary":{"en":"Codefest is a programming-focused festival or event, sometimes used as an official event name.","zh":"Codefest 指以编程为主题的节日或活动，也常作为某个活动的官方名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a festival or event focused on computer programming, often with talks, workshops, coding challenges, and community networking (sometimes similar to a hackathon).","zh":"以电脑编程为主题的节日或活动，常包含演讲、工作坊、编程挑战与社群交流（有时类似黑客松）。"},"examples":[{"en":"Our team is presenting a small app we built during Codefest.","zh":"我们团队会在 Codefest 上展示我们在活动期间做的小应用。"},{"en":"She signed up for Codefest to meet other developers and learn new tools.","zh":"她报名参加 Codefest，是为了认识其他开发者并学习新工具。"}]},{"partOfSpeech":"n.","definition":{"en":"a specific event name or brand used by different organizations for their own programming festivals or competitions.","zh":"不同机构用作自家编程节/编程竞赛的专有活动名称或品牌名。"},"examples":[{"en":"Codefest 2026 will be held in Austin this year.","zh":"今年的 Codefest 2026 将在奥斯汀举行。"},{"en":"Check the official Codefest website for the schedule and rules.","zh":"去 Codefest 官方网站查看日程和规则。"}]}],"synonyms":["hackathon","coding festival","programming competition","dev event","code jam"],"phonetic":"/ˈkoʊdˌfɛst/","extraExplanation":["“Codefest”通常是可数名词（a Codefest / the Codefest），也常作为专有名词大写使用；不同城市或组织可能各自有名为 Codefest 的活动。","和“hackathon（黑客松）”相比，Codefest 往往更强调“节/活动”的氛围（讲座、展位、社群），但也可能包含限时编程竞赛。"]}
{"word":"codeia","summary":{"en":"“codeia” is not a standard English word; it’s likely a name or a misspelling.","zh":"“codeia”不是标准英语词；更可能是名称或拼写/输入错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a proper name, a brand/user name, or a misspelling/typo of another word (for example, “code” + “idea,” or “idea”).","zh":"不是标准英语单词；更可能是专有名词（人名/品牌/用户名）或拼写错误/输入错误（例如把“code”和“idea”拼在一起，或想写“idea”）。"},"examples":[{"en":"I couldn’t find “codeia” in a dictionary—did you mean “idea” or “code idea”?","zh":"我在词典里找不到“codeia”——你是想写“idea（想法）”还是“code idea（编程点子）”吗？"},{"en":"“Codeia” might be a product or project name; please share the sentence where you saw it.","zh":"“Codeia”可能是产品名或项目名；请把你看到它的句子发出来。"}]}],"phonetic":"/koʊˈdiːə/","extraExplanation":["“codeia”在常见英语词典中没有固定词条，所以最有效的做法是：\n1）给出上下文句子；2）确认是否为专有名词；3）核对拼写（是否想写 idea / coding / codify 等）。\n如果它是你们内部项目名，我也可以根据领域（AI、编程、教育等）帮你拟一个更自然的英文命名与释义。"]}
{"word":"codeias","summary":{"en":"An idea is a thought, plan, or suggestion.","zh":"idea 指“想法、主意、计划或建议”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A thought, plan, or suggestion about what to do or create.","zh":"想法；主意；计划或建议。"},"examples":[{"en":"I have an idea for a new app.","zh":"我有一个新应用的想法。"},{"en":"That’s a good idea—let’s try it.","zh":"那是个好主意——我们试试吧。"},{"en":"Do you have any ideas for dinner?","zh":"你晚饭有什么主意吗？"}]}],"synonyms":["thought","plan","suggestion","concept","notion"],"phonetic":"/aɪˈdiːə/","extraExplanation":["“codeias” 不是常见的英语单词，可能是拼写错误。你也许想写的是：\n1) “ideas”（idea 的复数）：表示“想法们/点子”。例：I need some ideas.\n2) “code ideas”（两个词）：表示“编程点子/代码创意”。例：I’m looking for code ideas for a weekend project.\n如果你告诉我你想表达的是哪一种，我可以给你更贴切的释义和例句。"]}
{"word":"codein","summary":{"en":"“Code in” most commonly means “write code using a specific programming language,” and sometimes refers to a coding event/contest called “Code-in.”","zh":"“code in”最常见的意思是“用某种编程语言编写代码”，有时也指名为“Code-in”的编程活动/比赛。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to write computer code using a particular programming language or within a particular file/system","zh":"用某种编程语言（或在某个文件/系统中）编写代码"},"examples":[{"en":"I usually code in Python because it’s easy to read.","zh":"我通常用 Python 写代码，因为它很容易读懂。"},{"en":"Could you code it in JavaScript for the website?","zh":"你能用 JavaScript 为这个网站写吗？"},{"en":"She learned to code in C++ at school.","zh":"她在学校学会了用 C++ 写代码。"}]},{"partOfSpeech":"n.","definition":{"en":"(often written as “Code-in”) a type of event/contest that invites students to complete small programming tasks (e.g., Google Code-in)","zh":"（常写作“Code-in”）一种面向学生的活动/比赛，通过完成小型编程任务来参与（如 Google Code-in）"},"examples":[{"en":"He joined Code-in to practice real open-source tasks.","zh":"他参加了 Code-in 来练习真实的开源任务。"},{"en":"Code-in projects helped beginners learn step by step.","zh":"Code-in 项目帮助初学者循序渐进地学习。"}]}],"synonyms":["program in","write code in","develop in"],"phonetic":"ˈkoʊd ɪn","extraExplanation":["“code in + 语言”是非常常见的搭配，表示“用某种语言写代码”：code in Python / code in Java / code in C。","如果你其实想表达“coding（写代码）”，那是名词/动名词：I enjoy coding.（我喜欢写代码。）","Google Code-in 是谷歌曾举办的面向中学生的开源入门活动；现在不同组织也可能用类似名称举办活动。"]}
{"word":"codeina","summary":{"en":"Codeine is an opioid medicine used for pain relief and in some cough medicines; it can cause drowsiness and may be addictive.","zh":"Codeine（可待因）是一种阿片类药物，用于止痛，也用于部分止咳药；可能引起嗜睡并有成瘾风险。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medicine (an opioid) used to treat mild to moderate pain; it can also make people feel sleepy and may be addictive.","zh":"一种药物（阿片类），用于缓解轻到中度疼痛；也可能使人嗜睡，并具有成瘾风险。"},"examples":[{"en":"The doctor prescribed codeine for my dental pain.","zh":"医生给我开了可待因来缓解牙痛。"},{"en":"Codeine can cause drowsiness, so don’t drive after taking it.","zh":"可待因可能引起嗜睡，所以服用后不要开车。"}]},{"partOfSpeech":"n.","definition":{"en":"A medicine used in some cough syrups to reduce coughing.","zh":"某些止咳糖浆中的成分，用于减轻咳嗽。"},"examples":[{"en":"This cough syrup contains codeine, so it’s only available with a prescription in many places.","zh":"这种止咳糖浆含有可待因，所以在很多地方只能凭处方购买。"},{"en":"Ask the pharmacist if codeine is safe with your other medications.","zh":"请向药师确认可待因是否能与其他药物安全同用。"}]}],"synonyms":["opioid (general term)","painkiller (general term)","antitussive (for cough; more formal)"],"phonetic":"/ˈkoʊdiːn/","extraExplanation":["你输入的“codeina”更像是西班牙语/意大利语的拼写；英语通常写作“codeine”。","可待因属于阿片类药物，来源于罂粟（鸦片）相关成分，体内可部分转化为吗啡来发挥镇痛作用，因此有滥用与依赖风险。","不同国家/地区对含可待因的药物管制差异很大；在英语语境中常见提醒包括“prescription only（需处方）”“controlled substance（管制药物）”。"]}
{"word":"codeinas","summary":{"en":"Codeine is an opioid medicine used for pain relief or cough suppression, and it is often controlled because it can be addictive.","zh":"Codeine（可待因）是一种阿片类药物，用于止痛或镇咳；因可能成瘾而常被管制。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medicine (an opioid) used to relieve pain or reduce coughing; it can cause sleepiness and can be addictive, so it is controlled in many countries","zh":"可待因（一种阿片类药物），用于止痛或镇咳；可能引起嗜睡且有成瘾风险，因此在许多国家属于管制药品"},"examples":[{"en":"The doctor prescribed codeine for her severe cough.","zh":"医生给她开了可待因来缓解严重咳嗽。"},{"en":"Do not drive if codeine makes you feel sleepy.","zh":"如果可待因让你犯困，就不要开车。"},{"en":"Some painkillers combine codeine with acetaminophen.","zh":"有些止痛药会把可待因和对乙酰氨基酚（扑热息痛）一起配伍。"}]}],"synonyms":["opioid","painkiller (general)","cough suppressant (general)"],"phonetic":"/ˈkoʊdiːn/","extraExplanation":["你输入的“codeinas”看起来像是“codeine”的拼写变体，或是其他语言（如西班牙语/葡萄牙语）里“codeína(s)”的写法/复数形式。在英语中标准拼写是 codeine。","在日常英语里，codeine 常出现在医疗与药物说明中；由于它属于阿片类药物，使用时通常会强调遵医嘱、避免与酒精同用、注意成瘾与依赖风险。"]}
{"word":"codeine","summary":{"en":"Codeine is an opioid medicine used to relieve pain and sometimes to suppress coughs, but it can cause drowsiness and carries a risk of dependence.","zh":"可待因是一种阿片类药物，用于止痛并有时用于止咳，但可能导致嗜睡并有成瘾风险。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a pain-relieving medicine (an opioid) that can also reduce coughing; it can cause drowsiness and may be habit-forming, so it should be used only as directed by a doctor","zh":"可待因：一种止痛药（阿片类药物），也可用于止咳；可能引起嗜睡并具有成瘾风险，应在医生指导下使用"},"examples":[{"en":"The doctor prescribed codeine to help manage her pain after surgery.","zh":"医生开了可待因来帮助控制她术后的疼痛。"},{"en":"Some cough syrups contain codeine, so you shouldn’t drive after taking them.","zh":"有些止咳糖浆含有可待因，所以服用后不应该开车。"},{"en":"Codeine can be dangerous when mixed with alcohol or other sedatives.","zh":"可待因与酒精或其他镇静药物同用可能很危险。"}]}],"synonyms":["opioid","painkiller","analgesic"],"phonetic":"/ˈkoʊdiːn/","extraExplanation":["可待因（codeine）来源于“罂粟/鸦片（opium）”中的生物碱，与吗啡同属阿片类，但一般镇痛强度较弱。","在不同国家/地区，可待因的管制和是否可在药店购买差异很大；学习或出国时要注意当地法规与处方要求。","文学与流行文化中有时会提到含可待因的止咳药（如“codeine cough syrup”），常与“嗜睡、滥用风险”等话题相关；在正式写作中建议用中性、医学化表达。"]}
{"word":"codeines","summary":{"en":"Codeine is an opioid medicine used for pain relief and sometimes for cough suppression.","zh":"Codeine（可待因）是一种阿片类药物，用于镇痛，有时也用于止咳。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an opioid medicine used to relieve mild to moderate pain; it can also be used to reduce coughing","zh":"可待因：一种阿片类药物，用于缓解轻到中度疼痛；也可用于止咳"},"examples":[{"en":"The doctor prescribed codeine for her post-surgery pain.","zh":"医生给她开了可待因来缓解术后疼痛。"},{"en":"Some cough syrups contain codeine, but they are usually regulated.","zh":"一些止咳糖浆含有可待因，但通常受到管制。"},{"en":"He shouldn’t take codeine and drive because it can make him drowsy.","zh":"他不该服用可待因后开车，因为它可能让人嗜睡。"}]}],"synonyms":["opioid (general)","painkiller (general)","cough suppressant (when used for coughing)"],"phonetic":"/ˈkoʊdiːn/","extraExplanation":["你输入的“codeines”通常是复数形式，单数是“codeine”。在实际英语里，这个词多用作不可数名词（更常说“codeine”而不是“codeines”），除非是在医学/化学语境里谈“不同剂量/不同制剂”的可待因。","可待因属于阿片类（opioid），有成瘾风险，在许多国家属于管制药物；学习或使用相关表达时，注意语境一般偏医疗、药品说明或公共健康话题。"]}
{"word":"codeins","summary":{"en":"Codeine is an opioid medicine used to relieve pain and sometimes to suppress coughs.","zh":"Codeine（可待因）是一种阿片类药物，用于止痛，也有时用于镇咳。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a pain-relieving medicine (an opioid) that is also used to reduce coughing, usually given in low doses and sometimes combined with other medicines","zh":"可待因（一种阿片类止痛药，也常用于镇咳；通常小剂量使用，有时与其他药物合用）"},"examples":[{"en":"The doctor prescribed codeine for short-term pain after the surgery.","zh":"医生开了可待因，用于术后短期止痛。"},{"en":"Some cough syrups used to contain codeine, but many places restrict it now.","zh":"一些止咳糖浆过去含有可待因，但现在很多地方对它有严格限制。"},{"en":"Do not drive if codeine makes you feel sleepy or dizzy.","zh":"如果可待因让你犯困或头晕，就不要开车。"}]}],"synonyms":["opioid painkiller","cough suppressant"],"phonetic":"/ˈkoʊdiːn/","extraExplanation":["“codeins”看起来像是拼写错误，更常见的拼法是“codeine”。如果你原本想查的是别的词（比如“coding/codec/coins”），告诉我我可以改为正确词条。","可待因属于阿片类药物，可能导致嗜睡、便秘，并有成瘾风险；不同国家/地区对其处方与购买限制差异很大。学习时注意：它是药品名称，日常对话中多出现在医疗或用药说明语境里。"]}
{"word":"Codel","summary":{"en":"“Codel” is mainly used in Piet programming to mean one colored unit (like a pixel). Outside that context, it’s uncommon and may be a name.","zh":"“codel”主要出现在 Piet 编程语言里，指一个最小色块单位（类似像素）。除此之外不常用，可能是专有名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In the esoteric programming language Piet, a single unit (usually one square “pixel”) of color; programs are made from blocks of these units.","zh":"（在深奥/另类编程语言 Piet 中）色块的最小单位（通常是一格“像素”）；Piet 程序由这些单位组成的色块构成。"},"examples":[{"en":"In Piet, the interpreter moves from one codel to the next through the image.","zh":"在 Piet 里，解释器会在图像中从一个 codel 移动到下一个。"},{"en":"This program uses a codel size of 10 pixels to make the blocks easier to see.","zh":"这个程序把 codel 的大小设为 10 个像素，方便看清色块。"}]},{"partOfSpeech":"other","definition":{"en":"A rare term or name (e.g., a surname or brand); it is not a common everyday English word.","zh":"较少见的用法或专有名称（如姓氏、品牌名等）；不是常见的日常英语单词。"},"examples":[{"en":"I couldn’t find “codel” in a general dictionary; it may be a name or a specialized term.","zh":"我在通用词典里找不到“codel”，它可能是名字或某个专业领域的术语。"}]}],"synonyms":["pixel (Piet context)","codelet (related idea)"],"phonetic":"/ˈkoʊdəl/","extraExplanation":["“codel”常被解释为“code + el（小东西）”的造词，用来表示“很小的一段代码/单位”。但在实际使用中，它最有名的语境是 Piet：Piet 是一种把程序写成彩色图片的另类编程语言，执行逻辑依赖颜色变化与移动方向；因此需要一个基本的网格单位来计算与移动，这个单位就叫 codel。","如果你本来想查的是常见词，可能是拼写接近的 code（代码/编码）或 model（模型）。你也可以告诉我你看到它的句子或领域（编程/人名/品牌），我可以更准确解释。"]}
{"word":"codeless","summary":{"en":"“Codeless” means you can build or run something without writing code, usually using visual tools or settings.","zh":"“codeless”指无需写代码就能搭建或使用某个功能/产品，通常通过可视化工具或配置完成。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not requiring writing or editing computer code; able to be used or built through visual tools or simple configuration.","zh":"无需编写或修改计算机代码的；可通过可视化工具或简单配置来使用或搭建的。"},"examples":[{"en":"Our team chose a codeless platform to build the workflow in one afternoon.","zh":"我们团队选择了一个无代码平台，用一个下午就把流程搭建好了。"},{"en":"Codeless automation lets non-developers connect apps with drag-and-drop steps.","zh":"无代码自动化让非开发者也能用拖拽步骤把应用连接起来。"}]}],"synonyms":["no-code","code-free","low-code (related)"],"phonetic":"/ˈkoʊd.ləs/","extraExplanation":["“codeless”常见于科技与产品语境，和“no-code（无代码）”“low-code（低代码）”相关，但侧重点略不同：no-code更强调完全不写代码；codeless强调对使用者来说“不需要接触代码”。","在实际工作中，codeless工具通常适合原型、表单、自动化流程、数据看板等；但遇到高度定制、安全合规或复杂性能需求时，仍可能需要开发者写代码来扩展或集成。"]}
{"word":"codelet","summary":{"en":"A codelet is a small, focused piece of code used to do one specific job.","zh":"codelet 指用于完成某个具体任务的一小段代码/小程序。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small piece of computer code that performs a specific, limited task (often used as a building block inside a larger program)","zh":"（计算机）代码片段；小程序：用于完成某个具体且有限任务的小段代码（常作为更大程序中的构件）"},"examples":[{"en":"The tutorial includes a short codelet to show how the function works.","zh":"教程里有一段简短的代码片段，用来演示这个函数如何工作。"},{"en":"Each codelet handles one step, like reading input or formatting output.","zh":"每个小代码片段负责一个步骤，比如读取输入或格式化输出。"}]}],"synonyms":["code snippet","snippet","small program","routine"],"phonetic":"/ˈkoʊd.lət/","extraExplanation":["“codelet”由“code（代码）+ -let（表示‘小的’的后缀）”构成，含义类似于“booklet（小册子）”。在编程教学、技术文档或框架示例中常见，用来强调“短小、可复用、功能单一”的代码。","与“script（脚本）”相比，codelet 更强调“片段/模块”，不一定能独立运行；与“snippet（片段）”相比，codelet 更像“具备明确功能的小组件”。"]}
{"word":"codelight","summary":{"en":"“codelight” most commonly refers to CodeLite, an open-source IDE; it can also mean “code-light,” describing something that needs little coding.","zh":"“codelight”最常见是指开源 IDE：CodeLite；也可能表示“code-light（少写代码的）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An open-source integrated development environment (IDE), especially popular for C/C++ programming.","zh":"一个开源的集成开发环境（IDE），尤其常用于 C/C++ 编程。"},"examples":[{"en":"I use CodeLite to write and debug my C++ projects.","zh":"我用 CodeLite 来编写和调试我的 C++ 项目。"},{"en":"CodeLite supports code completion and project management.","zh":"CodeLite 支持代码补全和项目管理。"}]},{"partOfSpeech":"adj.","definition":{"en":"Requiring little coding; designed to be simple to implement or maintain (often written as “code-light” or “code light”).","zh":"需要很少写代码的；强调易实现、易维护（常写作 “code-light” 或 “code light”）。"},"examples":[{"en":"This tool offers a code-light way to build a website.","zh":"这个工具提供了一种“少写代码”就能搭建网站的方法。"},{"en":"We chose a code-light solution to move faster.","zh":"我们选择了一个“代码负担更轻”的方案来加快进度。"}]}],"synonyms":["CodeLite (IDE)","lightweight IDE","low-code","minimal-coding"],"phonetic":"/ˈkoʊdˌlaɪt/","extraExplanation":["“CodeLite”常见写法是首字母大写并写成一个词，属于软件名称；如果你看到的是“code light / code-light”，通常不是专有名词，而是形容某个方案“需要写的代码较少”。","如果你指的是某个具体产品、课程或公司名也叫“codelight”，它可能是品牌用法，含义会以该品牌介绍为准。"]}
{"word":"codelinquency","summary":{"en":"“Codelinquency” is an informal coined word meaning irresponsible or unethical behavior in coding or software development.","zh":"“codelinquency”是一个非正式的自造词，指写代码或软件开发中的不负责任/不道德行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Informal, nonstandard) Misbehavior, negligence, or unethical conduct in software development or coding (for example, writing unsafe code, ignoring best practices, or acting irresponsibly in a tech context).","zh":"（非正式、非标准用语）在软件开发/写代码中的不良行为、疏忽或不道德做法（例如写不安全的代码、无视最佳实践、在技术工作中不负责任）。"},"examples":[{"en":"The data leak wasn’t just a bug—it was codelinquency: they skipped basic security checks.","zh":"这次数据泄露不只是一个漏洞——而是“codelinquency”：他们连最基本的安全检查都跳过了。"},{"en":"Our team treats codelinquency seriously, like copying code without understanding it or hiding errors.","zh":"我们团队很重视“codelinquency”，比如不理解就照抄代码，或隐瞒错误。"},{"en":"He joked about his codelinquency after pushing changes without tests.","zh":"他在没写测试就提交改动后，开玩笑说自己犯了“codelinquency”。"}]}],"synonyms":["poor coding practices","negligence","misconduct","carelessness","security negligence"],"phonetic":"/ˌkoʊdəlˈɪŋkwənsi/","extraExplanation":["这是一个网络/行业里的“造词”（neologism），把 code（代码）和 delinquency（不良行为、失职、违法倾向）拼在一起，用来带点讽刺或批评地形容“写代码不负责任”。","它不是标准词典里的常用词，更常见的表达包括：poor coding practices（糟糕的编码习惯）、negligence（疏忽）、misconduct（不当行为）、security negligence（安全疏忽）。"]}
{"word":"codelinquent","summary":{"en":"An informal term for a programmer who breaks coding rules or writes messy/unsafe code.","zh":"非正式用语：指不守编码规范、写出混乱或不安全代码的程序员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, often humorous or critical) A person—especially a programmer—who breaks coding rules, ignores best practices, or creates messy/unsafe code.","zh":"（非正式，常带调侃或批评）“代码不良少年/代码惯犯”：指（尤指程序员）经常违反编码规范、无视最佳实践，写出混乱或不安全代码的人。"},"examples":[{"en":"Our build keeps failing because a codelinquent keeps committing untested changes.","zh":"我们的构建一直失败，因为有个“codelinquent”总是提交没测试的改动。"},{"en":"Don’t be a codelinquent—write clear names and add comments when needed.","zh":"别当“codelinquent”——变量名写清楚，需要时加注释。"},{"en":"The team joked that he was a reformed codelinquent after he started writing unit tests.","zh":"他开始写单元测试后，团队开玩笑说他是“改过自新”的 codelinquent。"}]}],"synonyms":["sloppy coder","bad programmer","cowboy coder","code monkey (informal)","rule-breaker"],"phonetic":"/ˌkoʊdɪˈlɪŋkwənt/","extraExplanation":["这是一个非标准词（较可能是网络造词/圈内玩笑），把 code（代码）和 delinquent（不良少年、违法者）拼在一起，用来调侃“写代码不守规矩的人”。","使用场景多见于程序员社区、代码评审、团队玩笑或吐槽；正式写作中更常用 sloppy coder / bad programmer / poor coding practices 等更中性的表达。","语气通常带幽默或讽刺，面对不熟的人或跨文化沟通时要注意可能显得冒犯。"]}
{"word":"CodeLite","summary":{"en":"CodeLite is an open-source IDE, especially popular for C/C++ development.","zh":"CodeLite 是一款开源 IDE，尤其常用于 C/C++ 开发。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An open-source integrated development environment (IDE) mainly used for writing and debugging C/C++ programs, available on Windows, macOS, and Linux.","zh":"一款开源的集成开发环境（IDE），主要用于编写与调试 C/C++ 程序，可在 Windows、macOS 和 Linux 上使用。"},"examples":[{"en":"I use CodeLite to build and debug my C++ project on Linux.","zh":"我用 CodeLite 在 Linux 上构建并调试我的 C++ 项目。"},{"en":"CodeLite can manage workspaces, projects, and build settings in one place.","zh":"CodeLite 可以在同一个地方管理工作区、项目和构建设置。"}]},{"partOfSpeech":"n.","definition":{"en":"The application itself (a specific program) used as a tool for programming tasks such as editing code, running builds, and debugging.","zh":"指该软件本身（一个具体程序），作为编程工具用于编辑代码、运行构建与调试等任务。"},"examples":[{"en":"Open CodeLite and create a new workspace.","zh":"打开 CodeLite 并创建一个新的工作区。"},{"en":"After installing the compiler, CodeLite recognized my toolchain automatically.","zh":"安装编译器后，CodeLite 自动识别了我的工具链。"}]}],"synonyms":["IDE","integrated development environment","code editor (general)","CLion (similar tool)","Code::Blocks (similar tool)","Visual Studio Code (similar tool)"],"phonetic":"/ˈkoʊdˌlaɪt/","extraExplanation":["CodeLite 通常被归类为“IDE”（集成开发环境）。IDE 一般把代码编辑器、编译/构建工具、调试器等功能整合在一起，方便学习者与开发者进行完整的开发流程。","作为专有名词，写作通常是 CodeLite（大小写固定）。在口语里也有人说 “I’m using CodeLite.”，把它当作一个软件名称直接使用。"]}
{"word":"Codell","summary":{"en":"“Codell” is usually a proper noun: a surname or a U.S. place name (often Codell, Kansas).","zh":"“Codell”通常是专有名词：姓氏或美国地名（常见为堪萨斯州的Codell）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name), used for people (e.g., in “Mr./Ms. Codell”).","zh":"姓氏（家族姓），用于称呼或指代某人（如“Codell先生/女士”）。"},"examples":[{"en":"Ms. Codell will lead today’s meeting.","zh":"Codell女士将主持今天的会议。"},{"en":"I emailed Dr. Codell about the project.","zh":"我给Codell博士发了邮件讨论这个项目。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name in the U.S., most commonly referring to Codell, Kansas (a small community).","zh":"美国地名，最常见指堪萨斯州的Codell（一个小社区）。"},"examples":[{"en":"He grew up near Codell, Kansas.","zh":"他在堪萨斯州Codell附近长大。"},{"en":"We passed through Codell on our road trip.","zh":"我们自驾旅行时路过了Codell。"}]}],"phonetic":"/koʊˈdɛl/","extraExplanation":["“Codell”主要作为专有名词使用：要么是英文姓氏，要么是美国的一些地名（尤其是堪萨斯州的Codell）。在写作中通常首字母大写。","如果你是在某本书、电影或社交媒体里看到“Codell”，它很可能是人名或地名；需要结合上下文判断具体指哪一个。"]}
{"word":"Coden","summary":{"en":"CODEN is a six-character identifier for scientific journals, used mainly in library and database indexing.","zh":"CODEN 是用于科学期刊的六码识别码，主要见于图书馆与数据库索引。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a six-character code used to identify scientific and technical periodicals (journals), especially in libraries and databases","zh":"用于识别科学与技术期刊（杂志）的六码代码，常见于图书馆与数据库"},"examples":[{"en":"The database record lists the journal’s CODEN along with its ISSN.","zh":"数据库记录里除了 ISSN 之外，还列出了该期刊的 CODEN。"},{"en":"CODENs were widely used in older chemistry indexing systems.","zh":"CODEN 在较早的化学文献索引系统中使用得很广。"}]}],"synonyms":["journal identifier","periodical code"],"phonetic":"/ˈkoʊdɛn/","extraExplanation":["CODEN 通常写作全大写（CODEN）。它最早由美国化学会相关的文献检索体系推广，用来给期刊一个简短、机器可读的标识码。","在现代检索中，ISSN/ISBN 更常见；但在一些老文献、化学数据库或馆藏记录中仍可能看到 CODEN。","不要把 CODEN 和日常英语里的 code（代码/密码）混淆：CODEN 更像是一种“期刊专用的缩写编号”。"]}
{"word":"coden","summary":{"en":"CODEN is a code used to identify journals in scientific references; “coden” can also be a misspelling of “coding.”","zh":"CODEN 是用于在科技文献中识别期刊的编码；“coden” 也可能是把 “coding” 误写出来的非标准拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a six-character code used to uniquely identify scientific and technical journals (often in library catalogs and databases)","zh":"（常用于图书馆目录与数据库的）六位字符代码，用来唯一识别科技期刊"},"examples":[{"en":"This journal’s CODEN helps databases distinguish it from similarly named titles.","zh":"这个期刊的 CODEN 能帮助数据库把它与名称相近的刊物区分开。"},{"en":"When searching older chemistry references, you may see a CODEN listed instead of an ISSN.","zh":"查找较早的化学文献时，你可能会看到用 CODEN 而不是 ISSN 来标注。"}]},{"partOfSpeech":"other","definition":{"en":"a (nonstandard) misspelling of “code” or “coding” in informal writing","zh":"（非标准拼写）在非正式写作中把 “code / coding” 误写成 coden"},"examples":[{"en":"I think you meant “coding,” not “coden.”","zh":"我觉得你想写的是 “coding”，不是 “coden”。"}]}],"synonyms":["journal code","bibliographic code","identifier"],"phonetic":"/ˈkoʊdɛn/","extraExplanation":["CODEN 是一种书目识别码，历史上在化学与工程类文献中更常见；现在很多场景更常用 ISSN/ISBN 或 DOI，但你仍可能在旧文献、索引或某些数据库字段里看到 CODEN。"]}
{"word":"codename","summary":{"en":"A codename is a secret name used to hide the real identity or purpose of a person, project, or operation.","zh":"codename 指“代号/暗号”，用于隐藏某人或某项目/行动的真实身份或目的。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A secret or disguised name used to refer to a person, project, operation, or product so others won’t know the real identity or purpose.","zh":"代号；暗号（用于指代某人、项目、行动或产品，以隐藏真实身份或目的）"},"examples":[{"en":"The military operation was known by the codename “Desert Storm.”","zh":"这次军事行动的代号是“沙漠风暴”。"},{"en":"During development, the new phone had the codename “Project Aurora.”","zh":"在研发期间，这款新手机的代号是“极光计划”。"}]},{"partOfSpeech":"vt.","definition":{"en":"To assign or use a secret name for someone or something.","zh":"给……起代号；用代号称呼……"},"examples":[{"en":"The team codenamed the project “Phoenix.”","zh":"团队把这个项目定名为代号“凤凰”。"},{"en":"He was codenamed “Eagle” in the report.","zh":"在报告里，他被用代号“鹰”称呼。"}]}],"synonyms":["code name","alias","designation","cover name"],"phonetic":"/ˈkoʊd.neɪm/","extraExplanation":["“codename”常见于军事、情报、警方行动，也常用于科技公司内部研发（产品未发布前的内部代称），以及影视/游戏中的秘密任务。","与“nickname（绰号）”不同：codename 的重点是“保密/隐蔽”，而 nickname 多是亲昵称呼或外号，不一定用于保密。","常见搭配：under the codename…（以……代号）、use the codename…（使用……代号）、give/assign a codename（指定代号）。"]}
{"word":"codenames","summary":{"en":"Codenames are secret names used to conceal real identities or plans; it can also refer to the party game titled Codenames.","zh":"codenames 指用于隐藏真实身份或计划的“代号”；也可指桌游《Codenames》。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a secret name or label used to hide a real person, place, plan, or operation (often in military, intelligence, or business contexts)","zh":"（常用于军事、情报或商业等场景的）代号；暗号名称，用来隐藏真实人物、地点、计划或行动"},"examples":[{"en":"The mission’s codename was kept confidential until the operation ended.","zh":"这次任务的代号一直保密到行动结束。"},{"en":"They used a codename in emails to avoid revealing the project’s real purpose.","zh":"他们在邮件里用代号，避免泄露项目的真实目的。"},{"en":"Her codename in the investigation was “Bluebird.”","zh":"在这次调查中，她的代号是“Bluebird”。"}]},{"partOfSpeech":"n.","definition":{"en":"the name of a popular word-association party game, usually written as Codenames (proper noun)","zh":"一款热门的联想猜词聚会桌游的名称，通常写作 Codenames（专有名词）"},"examples":[{"en":"We played Codenames after dinner.","zh":"晚饭后我们玩了《Codenames》。"},{"en":"Codenames is great for groups because it’s quick to learn.","zh":"《Codenames》很适合多人，因为上手快。"}]}],"synonyms":["alias","cover name","code word","designation"],"phonetic":"/ˈkoʊdˌneɪmz/","extraExplanation":["“codename”常见于新闻与正式写作：如 *Operation Overlord*（霸王行动）这类军事行动名称就是典型的代号，用于保密与沟通。","日常生活里也会借用这个词来指“内部项目名/暂定名”，例如科技公司在发布前给产品取的代号。"]}
{"word":"codenization","summary":{"en":"“Codenization” is not standard; it most often refers to (or is confused with) “codonization,” rewriting DNA codons to improve expression without changing the protein.","zh":"“codenization”不是标准词；多半是指（或误写了）“codonization（密码子化/密码子优化）”，在不改变蛋白的前提下调整DNA密码子以改善表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard; likely a misspelling) Usually intended to mean “codonization” in biology: the process of rewriting a gene’s DNA sequence by changing codons (often to match a host organism’s preferred codon usage) while keeping the same protein.","zh":"（非标准用法；很可能是拼写错误）通常想表达生物学中的“codonization / 密码子化”：在不改变蛋白质产物的前提下，通过替换DNA中的密码子来重写基因序列（常用于匹配宿主生物偏好的密码子使用）。"},"examples":[{"en":"The researcher discussed codonization to improve protein expression in E. coli.","zh":"研究人员讨论了通过“密码子化”来提高大肠杆菌中的蛋白表达。"},{"en":"After codonization, the gene produced more protein without changing the amino-acid sequence.","zh":"进行密码子化后，该基因在不改变氨基酸序列的情况下产生了更多蛋白。"}]}],"synonyms":["codon optimization","gene optimization","sequence optimization"],"phonetic":"/ˌkoʊdɑːnəˈzeɪʃən/","extraExplanation":["“codenization”并不是常见或标准的英文词；在学术语境里更常见的是 **codonization**，或更通用的表达 **codon optimization（密码子优化）**。如果你原本想写的是社会历史相关的“殖民化”，正确拼写是 **colonization**。"]}
{"word":"codens","summary":{"en":"CODEN (plural: CODENs) is a short code used to identify scientific journals in databases.","zh":"CODEN（复数：CODENs）是用于在数据库中识别科学期刊的短代码。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a six-character alphanumeric code used to identify a scientific or technical periodical (journal), especially in library and database systems","zh":"（尤用于图书馆与数据库的）期刊识别码；一种用来标识科学/技术期刊的六码字母数字代码"},"examples":[{"en":"The database record lists the journal’s CODEN and ISSN.","zh":"数据库记录列出了该期刊的 CODEN 和 ISSN。"},{"en":"Researchers used the CODEN to locate the correct chemistry journal quickly.","zh":"研究人员用 CODEN 很快找到了正确的化学期刊。"}]}],"synonyms":["journal identifier","journal code"],"phonetic":"/ˈkoʊdɛn/","extraExplanation":["“CODEN”常写作全大写，复数可写作“CODENs”。它在化学与工程类文献检索中较常见，常与 ISSN（国际标准连续出版物号）一起出现，用于更精确地识别期刊。","如果你原本想查的是“codons”（遗传学中的“密码子”），请告诉我，我可以也给出对应词条与对比。"]}
{"word":"codependence","summary":{"en":"Codependence is an unhealthy relationship pattern of over-reliance and enabling.","zh":"Codependence 指不健康的关系模式：过度依赖并常常纵容对方。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A relationship pattern where one person overly relies on another for emotional support, approval, or identity, often while enabling the other person’s unhealthy behavior.","zh":"一种关系模式：一方过度依赖另一方来获得情感支持、认可或自我认同，并常常在无意中纵容对方的不健康行为。"},"examples":[{"en":"She realized her codependence was keeping her in a relationship that made her unhappy.","zh":"她意识到自己的共依存让她困在一段令她不快乐的关系里。"},{"en":"In their family, codependence showed up as constant rescuing and avoiding honest conversations.","zh":"在他们家里，共依存表现为总是在“救火”、并回避坦诚的沟通。"},{"en":"Therapy helped him notice codependence and set healthier boundaries.","zh":"心理咨询帮助他觉察共依存，并建立更健康的界限。"}]}],"synonyms":["codependency","enmeshment (related)","emotional dependence"],"phonetic":"/ˌkoʊdɪˈpɛndəns/","extraExplanation":["“codependence”常见于心理学与自助文化语境，尤其与成瘾（如酒精、药物）相关的家庭系统讨论有关：一方可能以“照顾/拯救”为名，长期承担对方后果，从而让问题持续。","它并不等同于“亲密”或“互相支持”。关键区别在于：支持是有界限的；共依存往往伴随过度负责、难以说“不”、把他人的情绪当成自己的责任。","相关词：codependent（adj./n. 共依存的；有共依存倾向的人）、enabling（n./adj. 纵容/助长不良行为的）、boundary（n. 界限）。"]}
{"word":"codependency","summary":{"en":"Codependency is an unhealthy pattern of over-relying on someone else emotionally, often with weak boundaries and a “rescuer/control” dynamic.","zh":"Codependency（共依存）指一种不健康的关系模式：情感上过度依赖他人、界限薄弱，常伴随“拯救/控制”的互动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A relationship pattern where someone relies too much on another person’s approval or needs, often ignoring their own needs; it commonly involves trying to control, “rescue,” or manage the other person’s feelings or behavior.","zh":"一种关系模式：一个人过度依赖他人的认可或需求，常常忽视自己的需要；也常表现为试图“拯救”、控制或管理对方的情绪与行为。"},"examples":[{"en":"In therapy, she realized her codependency was making it hard to set boundaries.","zh":"在治疗中，她意识到自己的共依存让她很难设立界限。"},{"en":"Their codependency meant every argument felt like a crisis.","zh":"他们的共依存使得每次争吵都像一场危机。"},{"en":"Learning to say “no” helped him break patterns of codependency.","zh":"学会说“不”帮助他打破共依存的模式。"}]}],"synonyms":["enmeshment","emotional dependence","unhealthy dependence","overdependence"],"phonetic":"/ˌkoʊdɪˈpɛndənsi/","extraExplanation":["“Codependency”原本常用于讨论与成瘾（如酒精依赖）相关的家庭/亲密关系：一方围绕成瘾者生活、不断“收拾残局”或过度照顾，久而久之形成不健康的相互依赖。后来用法扩大，也可指任何关系中长期失衡的依赖与界限问题。","词形拆解：co-（共同、相互）+ dependency（依赖）。在日常表达里也常说“codependent relationship”（共依存关系）或“to be codependent”（处于共依存状态）。","语气与使用场景：这是心理学/自助语境里常见的词，带有“需要调整/不健康”的评价色彩。正式写作或对他人关系做判断时，建议谨慎使用，避免给人贴标签。"]}
{"word":"codependent","summary":{"en":"Codependent usually describes an unhealthy relationship pattern of over-reliance on another person, though it can also mean simply mutually dependent.","zh":"Codependent通常指关系中不健康的过度依赖（共依赖），也可指一般意义上的“相互依存”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"In a relationship, overly dependent on another person emotionally or psychologically, often by focusing on their needs or problems in an unhealthy way.","zh":"（关系中）过度依赖对方（情感或心理上），常以不健康的方式过分关注对方的需求或问题。"},"examples":[{"en":"She realized she had become codependent, always putting her partner’s feelings before her own.","zh":"她意识到自己变得很共依赖，总是把伴侣的感受放在自己之前。"},{"en":"Codependent relationships can make it hard for people to set healthy boundaries.","zh":"共依赖关系会让人很难建立健康的界限。"}]},{"partOfSpeech":"adj.","definition":{"en":"Mutually dependent; needing each other to function or succeed.","zh":"相互依存的；彼此需要对方才能运作或成功的。"},"examples":[{"en":"In nature, bees and flowers are codependent in many ecosystems.","zh":"在自然界中，蜜蜂和花朵在许多生态系统里是相互依存的。"},{"en":"The team’s roles are codependent—each person’s work supports the others.","zh":"团队的角色是相互依存的——每个人的工作都在支撑其他人。"}]}],"synonyms":["interdependent","mutually dependent","overdependent","enmeshed"],"phonetic":"/ˌkoʊdɪˈpɛndənt/","extraExplanation":["“codependent”常见于心理健康与家庭治疗语境，尤其用来描述一种关系模式：一个人通过“照顾/拯救/控制”对方来获得自我价值感，同时又害怕冲突或被抛弃，因此不容易说“不”。","日常交流中使用时要注意礼貌与敏感度：它带有临床/咨询色彩，有时会被当作“贴标签”。更温和的说法包括：“unhealthy dependence”（不健康的依赖）或“poor boundaries”（界限感较弱）。","词源上由 co-（共同）+ dependent（依赖的）构成；在大众文化里常与“enabler（纵容者/助长者）”“people-pleaser（讨好型人格）”“boundary-setting（建立界限）”等概念一起出现。"]}
{"word":"codeposit","summary":{"en":"“Codeposit” usually means a deposit formed or placed together with something else, especially in technical/scientific writing.","zh":"“Codeposit”通常指与其他物质一起形成或一起沉积/存入的“共沉积（物）”，多用于技术或科研写作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"something deposited together with something else; a joint or accompanying deposit (often used in technical contexts such as geology or chemistry).","zh":"与其他物质一起沉积/沉淀或一起存入的东西；伴生沉积物（常见于地质、化学等技术语境）。"},"examples":[{"en":"The mineral occurs as a codeposit with quartz.","zh":"这种矿物常与石英呈伴生沉积（共沉积）出现。"},{"en":"Impurities can form a codeposit during the reaction.","zh":"杂质可能在反应过程中形成共沉积物。"}]},{"partOfSpeech":"v.","definition":{"en":"to deposit or lay down together with something else; to co-deposit.","zh":"与其他物质一起沉积/沉淀；共同沉积（= co-deposit）。"},"examples":[{"en":"Under these conditions, copper may codeposit with nickel.","zh":"在这些条件下，铜可能与镍发生共沉积。"},{"en":"The two compounds can codeposit on the surface.","zh":"这两种化合物可能会在表面共同沉积。"}]}],"synonyms":["co-deposit","joint deposit","co-deposition (related term)"],"phonetic":"/ˌkoʊdɪˈpɑzɪt/","extraExplanation":["“codeposit”更常见的写法是带连字符的“co-deposit”（名词为“co-deposit / codeposit”，动词为“to co-deposit”）。在日常英语里不常用，多出现在学术论文、实验报告、材料/电镀/地质相关文本中。","如果你是在银行语境里想表达“共同存款/联名账户”，英语通常说“joint account / joint deposit account”，而不是“codeposit”。"]}
{"word":"coder","summary":{"en":"A coder is usually someone who writes computer code (a programmer), and it can also mean someone who assigns or converts information into codes (e.g., medical coding).","zh":"coder通常指编写计算机代码的人（程序员），也可指为信息分配或转换编码的人（如医疗编码）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who writes computer programs (code); a programmer.","zh":"编写计算机程序（代码）的人；程序员。"},"examples":[{"en":"She’s a coder who builds mobile apps.","zh":"她是一名开发手机应用的程序员。"},{"en":"Many coders learn by making small projects every day.","zh":"很多程序员通过每天做小项目来学习。"},{"en":"He started as a self-taught coder in high school.","zh":"他从高中起就自学编程。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who converts information into a coded form or assigns classification codes (for example, in hospitals or research).","zh":"将信息转换成编码形式或分配分类编码的人（例如医院或研究机构）。"},"examples":[{"en":"The medical coder checked the diagnosis codes for accuracy.","zh":"医疗编码员核对诊断编码是否准确。"},{"en":"A data coder labeled survey answers for analysis.","zh":"数据编码员给问卷答案做编码以便分析。"}]}],"synonyms":["programmer","developer","software engineer","medical coder","data encoder"],"phonetic":"/ˈkoʊdɚ/","extraExplanation":["“coder”通常偏口语、偏日常称呼，强调“写代码的人”。在正式职业头衔里更常见的是“software engineer（软件工程师）”或“developer（开发者）”。","在科技文化里，“coder”常带有“动手做、解决问题”的氛围，例如“coding bootcamp（编程训练营）”“coder community（程序员社区）”。","注意区分：coder（写代码的人）≠ code（密码/法典/代码本身）。另外在医疗领域的“coder”指“编码员”，工作内容更偏规则与合规。"]}
{"word":"coder-decoder","summary":{"en":"Coder-decoder usually means an encoder/decoder system (often called a codec) that turns information into a code and back again.","zh":"Coder-decoder 通常指“编码-解码”系统（常称 codec），把信息编码成代码并再解码还原。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device or system that converts information from one coded form into another, often by using a coder (encoder) to turn a message into a code and a decoder to turn it back into a readable form.","zh":"一种将信息从一种编码形式转换为另一种的装置或系统，通常由编码器（coder/encoder）把信息变成代码，再由解码器（decoder）把代码还原成可读信息。"},"examples":[{"en":"In digital communications, a coder-decoder helps protect data from noise during transmission.","zh":"在数字通信中，coder-decoder 可以帮助数据在传输时抵抗噪声干扰。"},{"en":"The audio codec works like a coder-decoder: it compresses sound and then reconstructs it for playback.","zh":"音频 codec 的工作方式就像 coder-decoder：它先压缩声音，再在播放时还原。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or team that writes encoded messages (coder) and also interprets or breaks them (decoder), especially in security or intelligence contexts.","zh":"（尤指安全或情报领域）既负责编写加密/编码信息（coder）又负责解读或破译信息（decoder）的人或团队。"},"examples":[{"en":"During the exercise, the coder-decoder team sent encrypted instructions and verified they could be decoded correctly.","zh":"在演练中，coder-decoder 团队发送了加密指令，并确认能被正确解码。"},{"en":"She trained as a coder-decoder for secure messaging systems.","zh":"她接受了培训，成为安全消息系统的 coder-decoder 人员。"}]}],"synonyms":["encoder-decoder","codec","coder/decoder"],"phonetic":"/ˈkoʊdɚ dɪˈkoʊdɚ/","extraExplanation":["在工程语境里更常见的说法是 “encoder-decoder” 或缩写 “codec”（coder/decoder）。例如视频编码的 H.264、H.265 常被称为 codecs。","“coder-decoder” 也可能出现在“纠错编码”（error-correcting codes）里：coder 负责加入冗余信息以便纠错，decoder 则根据收到的数据推断原始信息。"]}
{"word":"coderive","summary":{"en":"Coderive means to derive or work out a result together with someone else, especially in academic or technical writing.","zh":"Coderive 指与他人一起推导或共同得出某个结果，尤用于学术或技术写作。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to derive or work out something together with someone else; to reach a result jointly (often used in academic or technical contexts)","zh":"与他人一起推导/推得（某个结论、公式或结果）；共同得出（常见于学术或技术语境）"},"examples":[{"en":"The two researchers coderived a new formula for the model.","zh":"两位研究人员共同推导出了该模型的新公式。"},{"en":"In class, we coderived the equation step by step on the board.","zh":"在课堂上，我们在黑板上一步步共同推导出这个方程。"}]},{"partOfSpeech":"vi.","definition":{"en":"to be derived together or to develop from the same source (rare)","zh":"共同衍生；同源地产生（较少见）"},"examples":[{"en":"These two meanings may coderive from an older usage.","zh":"这两个含义可能同源于一种更早的用法。"}]}],"synonyms":["jointly derive","derive together","work out together","co-develop"],"phonetic":"/ˌkoʊdɪˈraɪv/","extraExplanation":["“coderive”常见写法也会写成“co-derive”（带连字符），其中前缀“co-”表示“共同、一起”。在数学、物理、计算机或语言学写作里，用它来强调“推导过程是合作完成的”。","日常英语中更常用的表达是“derive (something) together / work out (something) together / jointly derive”。如果你是在论文或报告中使用，建议根据写作风格选择“co-derive”或“jointly derive”。"]}
{"word":"coderived","summary":{"en":"Coderived means “derived together from the same source,” mainly used in academic contexts.","zh":"coderived 指“共同源自同一来源/共同衍生”，主要用于学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"derived together from the same source or developed jointly (often used in academic writing, e.g., biology, linguistics, chemistry).","zh":"共同源自同一来源；共同衍生/共同发展（常用于学术语境，如生物学、语言学、化学等）。"},"examples":[{"en":"These two traits are likely coderived from a shared ancestor.","zh":"这两种性状很可能是从共同祖先那里共同衍生出来的。"},{"en":"The authors discuss coderived terms that came from Latin.","zh":"作者讨论了源自拉丁语、共同衍生的词语。"},{"en":"In the dataset, several features appear to be coderived and should be analyzed together.","zh":"在该数据集中，有几个特征看起来是共同衍生的，应当一起分析。"}]}],"synonyms":["co-derived","jointly derived","derived from the same source","shared-derived"],"phonetic":"/ˌkoʊdɪˈraɪvd/","extraExplanation":["“coderived”多见于学术写作，尤其是系统发育学（phylogenetics）中，用来描述“共同衍生性状（shared derived characters）”，常与“synapomorphy（共衍征）”相关。一般写作也可用“co-derived”（带连字符）或更常见的表达如“derived from the same source”。"]}
{"word":"coderives","summary":{"en":"“Coderives” usually means “co-derives”: jointly derives a result with others.","zh":"“coderives”通常指“co-derives”，意思是与他人共同推导/共同得出结果。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to derive (an idea, result, or formula) together with someone else; to develop something jointly from shared sources or reasoning","zh":"（与他人）共同推导；共同得出（结论/公式/结果）"},"examples":[{"en":"The two researchers co-derive the equation from first principles.","zh":"两位研究人员从基本原理共同推导出这个方程。"},{"en":"From the data, the team co-derives a set of design rules.","zh":"团队根据这些数据共同得出一套设计规则。"},{"en":"In class, students co-derive the solution step by step with the teacher.","zh":"在课堂上，学生和老师一起一步步共同推导解法。"}]}],"synonyms":["co-develop","jointly derive","work out together","collaboratively derive"],"phonetic":"/ˌkoʊ dɪˈraɪv/","extraExplanation":["“co-derive”由前缀 co-（共同、一起）+ derive（推导/得出）构成，常见于学术写作、数学/物理推导、研究论文中，用来强调“共同完成推导/共同得出结论”。","你输入的“coderives”通常是动词第三人称单数形式：He/She/It co-derives ...；也可能是复数名词写法的误拼，但最常见理解是动词形式。"]}
{"word":"coderiving","summary":{"en":"Co-driving means shared driving: a human and an assistance system (or another person) cooperate to control the vehicle.","zh":"Co-driving 指“共同驾驶/协同驾驶”：人类与辅助系统（或另一人）协作控制车辆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in automotive technology) a mode or system where a human driver and an assistance system (or another person) share driving tasks and decisions.","zh":"（尤指汽车技术）一种“共同驾驶/协同驾驶”模式或系统：人类驾驶员与驾驶辅助系统（或另一位驾驶者）分担驾驶任务与决策。"},"examples":[{"en":"The new co-driving feature helps the driver stay centered in the lane and keeps a safe distance.","zh":"新的协同驾驶功能会帮助驾驶员保持车道居中，并保持安全车距。"},{"en":"In co-driving, the human remains responsible, but the system can assist with steering or braking.","zh":"在协同驾驶中，人类仍负主要责任，但系统可以辅助转向或制动。"}]},{"partOfSpeech":"adj.","definition":{"en":"describing a shared-driving approach, where control is divided between a human and an automated system (or between two people).","zh":"描述“共同驾驶/协同驾驶”的：控制权由人类与自动系统（或两个人）共同分配。"},"examples":[{"en":"They tested a co-driving interface that clearly shows who is in control.","zh":"他们测试了一种协同驾驶界面，能清楚显示由谁在控制。"},{"en":"Co-driving support is useful in heavy traffic and on long highway trips.","zh":"协同驾驶支持在拥堵路段和长途高速行驶时很有用。"}]}],"synonyms":["shared driving","collaborative driving","cooperative driving","driver-assistance driving"],"phonetic":"/koʊˈdraɪvɪŋ/","extraExplanation":["“co-driving / co-driving system”多见于自动驾驶与ADAS（高级驾驶辅助系统）领域，强调“人机协作”而不是完全自动驾驶（full self-driving）。常见搭配：co-driving mode（协同驾驶模式）、co-driving assistance（协同驾驶辅助）、co-driving interface（协同驾驶交互界面）。","拼写上常见两种：co-driving（更规范，带连字符）与 codriving（更口语/产品命名风格）。在正式写作（论文、报告）中通常推荐用 co-driving。"]}
{"word":"coders","summary":{"en":"“Coders” means people who write computer code to build or improve software.","zh":"“coders”指编写计算机代码、开发或改进软件的人（“coder”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who write computer code (instructions) to build or change software, websites, apps, or scripts.","zh":"编写计算机代码（指令）的人，用来创建或修改软件、网站、应用或脚本。"},"examples":[{"en":"The coders fixed the bug before the app update.","zh":"程序员们在应用更新前修复了这个漏洞。"},{"en":"Our team has designers, coders, and product managers.","zh":"我们团队有设计师、开发者（程序员）和产品经理。"},{"en":"Many coders learn by building small projects and sharing them online.","zh":"很多编程者通过做小项目并在网上分享来学习。"}]}],"synonyms":["programmers","developers","software engineers"],"phonetic":"/ˈkoʊdərz/","extraExplanation":["“coders”是“coder”的复数。口语里常用“coder”泛指会写代码的人；在一些语境下，“programmer / developer / software engineer”可能更正式或强调工程能力与系统设计。","“coder”有时带一点“偏写代码、偏实现”的感觉；但在日常交流中通常是中性词。"]}
{"word":"codes","summary":{"en":"“Codes” can mean multiple sets of rules/instructions (noun plural) or “writes code/encodes” (verb).","zh":"“codes”既可指多套规则/指令/代码（名词复数），也可表示“（他/她）编程/编码”（动词三单）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “code”: a set of rules, symbols, or instructions used to communicate or control how something works.","zh":"“code”的复数：一套规则、符号或指令，用来交流信息或规定事物如何运作。"},"examples":[{"en":"Different countries have traffic codes to keep roads safe.","zh":"不同国家有交通法规（codes）来保障道路安全。"},{"en":"The app follows strict privacy codes to protect user data.","zh":"这个应用遵守严格的隐私规范（codes）来保护用户数据。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular of “code”: to write or arrange instructions for a computer program; to program.","zh":"“code”的第三人称单数：为计算机程序编写指令；编程。"},"examples":[{"en":"She codes in Python every day.","zh":"她每天用 Python 编程。"},{"en":"He codes the new feature and tests it before release.","zh":"他编写新功能并在发布前测试。"}]},{"partOfSpeech":"v.","definition":{"en":"To represent information using symbols or a system (for example, turning a message into a secret form).","zh":"用符号或某种系统来表示信息（例如把信息变成“密文”）。"},"examples":[{"en":"The spy codes the message so no one else can read it.","zh":"间谍把信息编码成密文，这样别人就读不懂。"},{"en":"The chart codes each category with a different color.","zh":"这张图用不同颜色对每个类别进行编码（标记）。"}]}],"synonyms":["rules","regulations","standards","programs","software","encrypts","encodes"],"phonetic":"/koʊdz/","extraExplanation":["“code/codes”在英语里很常见的三大领域：\n1）计算机：code=代码；to code=写代码/编程。\n2）规则规范：a code of conduct（行为准则）、dress code（着装要求）、building codes（建筑规范）。\n3）编码/暗号：Morse code（摩尔斯电码）、secret code（暗号）。\n看到“codes”时要根据句子判断是“多套规范/代码”（名词复数）还是“他/她在编程/编码”（动词三单）。"]}
{"word":"codescendant","summary":{"en":"Codescendant (more commonly written co-descendant) means someone who shares the same ancestor with another person, or describing that shared lineage.","zh":"codescendant（更常写作 co-descendant）指与他人同出一祖先的后裔，也可作形容词表示“同宗同源”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who descends from the same ancestor as another person; a fellow descendant (often used in genealogy).","zh":"（与他人）同宗后裔、同一祖先的后代（多用于家谱/族谱研究）。"},"examples":[{"en":"My codescendants and I all trace our family line back to the same great‑grandparents.","zh":"我和我的同宗后裔都能把家族谱系追溯到同一对曾祖父母。"},{"en":"The historian interviewed several codescendants of the original settlers.","zh":"那位历史学家采访了多位最初定居者的同宗后裔。"}]},{"partOfSpeech":"adj.","definition":{"en":"sharing descent from the same ancestor; related through a common lineage.","zh":"同源的；出自同一祖先谱系的；同宗的。"},"examples":[{"en":"They are codescendant branches of the same family tree.","zh":"他们是同一家族树上的同宗分支。"},{"en":"The two families are codescendant, even though their surnames are different now.","zh":"尽管如今姓氏不同，这两家仍同宗同源。"}]}],"synonyms":["co-descendant","fellow descendant","shared descendant","relative (general)","kinsman (general)"],"phonetic":"/ˌkoʊdɪˈsɛndənt/","extraExplanation":["“codescendant”较少见，更常写作 **co-descendant**（带连字符）或直接说 **fellow descendant / shared descendant**。","常见相关词：**common ancestor**（共同祖先）、**descendant**（后代）、**lineage**（世系/血统）、**kinsman/relative**（亲属）。"]}
{"word":"codesign","summary":{"en":"Co-design means designing something collaboratively, often with the people who will use it.","zh":"Co-design 指与他人（常与未来使用者）协作完成设计的做法或过程。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to design something together with other people, especially the users or stakeholders, by sharing ideas and making decisions as a team","zh":"（与他人，尤其是与用户/相关方）共同设计；协作设计，通过共同提出想法并一起做决定来完成设计"},"examples":[{"en":"The team co-designed the app with teachers to make it easier to use in class.","zh":"团队与老师一起共同设计这款应用，让它更适合课堂使用。"},{"en":"We’re co-designing a new logo with our client rather than presenting only one option.","zh":"我们正在和客户共同设计新标志，而不是只拿出一个方案。"}]},{"partOfSpeech":"n.","definition":{"en":"a process or approach in which a product, service, or plan is created collaboratively by designers and the people who will use it","zh":"共同设计（方法/过程）：由设计者与未来使用者协作完成产品、服务或方案的设计"},"examples":[{"en":"Co-design helped the hospital improve patient experiences.","zh":"共同设计帮助医院改善了患者体验。"},{"en":"Our workshop uses co-design to gather ideas from the community.","zh":"我们的工作坊用共同设计来收集社区的想法。"}]}],"synonyms":["collaborative design","participatory design","co-create","design together"],"phonetic":"/ˌkoʊ dɪˈzaɪn/","extraExplanation":["“co-”表示“共同、一起”。写法上常见三种：co-design（较常见、正式）、co design（不太规范）、codesign（更像合并写法，部分公司/领域会用，但在通用英语里不如带连字符的形式常见）。","co-design 常用于产品设计、服务设计、公共政策与社区项目，强调“参与式/以用户为中心”的合作，而不只是设计师单方面决定。"]}
{"word":"codesigned","summary":{"en":"“Codesigned / co-designed” means created through shared design work by multiple people or groups.","zh":"“codesigned / co-designed”指由多个人或多个团队协作、共同完成设计。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"designed together by two or more people or groups, usually through collaboration and shared decision-making","zh":"由两方或多方共同设计的（通常强调协作与共同决策）"},"examples":[{"en":"The app was co-designed by teachers and students to make it easier to use in class.","zh":"这款应用由老师和学生共同设计，使课堂使用更方便。"},{"en":"We want a co-designed logo that reflects both companies’ identities.","zh":"我们希望有一个共同设计的标志，能体现两家公司的特点。"}]},{"partOfSpeech":"vt.","definition":{"en":"to design something together with another person or group","zh":"与他人或其他团队共同设计（某物）"},"examples":[{"en":"They co-designed a new wheelchair with input from patients.","zh":"他们在患者的参与下共同设计了一款新的轮椅。"},{"en":"Our engineers co-designed the system with the local community.","zh":"我们的工程师与当地社区共同设计了这个系统。"}]}],"synonyms":["collaboratively designed","jointly designed","co-created","developed together"],"phonetic":"/ˌkoʊ dɪˈzaɪnd/","extraExplanation":["“co-”表示“共同、一起”。写作上常见两种形式：co-designed（更常见，尤其作形容词时）和 codesigned（较少见，多见于某些公司风格或不加连字符的写法）。在正式写作里，用连字符 co-designed 更清晰。","在产品、教育、公共服务等语境中，co-design 往往强调“让使用者/利益相关者参与设计过程”（参与式设计），不仅是两位设计师一起做图。"]}
{"word":"codesigner","summary":{"en":"A co-designer is someone who designs something together with another person or team.","zh":"co-designer 指与他人共同完成设计的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who designs something together with another person or a team; a joint designer.","zh":"与他人一起进行设计的人；共同设计者。"},"examples":[{"en":"She is the co-designer of the app’s new user interface.","zh":"她是这款应用新版用户界面的共同设计者。"},{"en":"The chair lists two names: the lead designer and the co-designer.","zh":"这把椅子上标有两个名字：主设计师和共同设计者。"},{"en":"He worked as a co-designer on a fashion collaboration.","zh":"他在一次时尚联名项目中担任共同设计者。"}]}],"synonyms":["collaborator","joint designer","design partner","co-creator"],"phonetic":"/ˌkoʊdɪˈzaɪnɚ/","extraExplanation":["更常见的拼写是“co-designer”（带连字符）或“co designer”（分开写）。“codesigner”也能理解，但在正式出版物、简历或署名中通常用“co-designer”。","“co-”表示“共同、协作”。在设计、科研、艺术等领域，用来强调作品或方案不是独立完成，而是与他人共同创作。"]}
{"word":"codesigners","summary":{"en":"“Codesigners” (more commonly written “co-designers”) means people who work together to design something.","zh":"“codesigners”（更常写作“co-designers”）指一起合作完成设计的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who design something together; collaborators in the design process","zh":"共同设计者；一起参与设计的人（在设计过程中协作的伙伴）"},"examples":[{"en":"The app’s co-designers tested the prototype with users before launch.","zh":"这款应用的共同设计者在上线前和用户一起测试了原型。"},{"en":"She is one of the co-designers of the new community library.","zh":"她是新社区图书馆的共同设计者之一。"},{"en":"The architect and the engineer worked as co-designers on the project.","zh":"建筑师和工程师以共同设计者的身份合作完成这个项目。"}]}],"synonyms":["collaborators","design partners","co-creators","team members"],"phonetic":"/ˌkoʊ dɪˈzaɪnərz/","extraExplanation":["“co-”是英语里常见的前缀，表示“共同、一起”（如 co-worker 同事、co-founder 共同创办人）。因此 co-designer 强调“共同参与设计”，不仅是分工完成任务，也常包含讨论、迭代、一起做决定。","在产品与服务领域里，co-design 有时特指“与使用者/利益相关者共同设计”（例如让居民参与公共空间设计）。在这种语境下，co-designers 可能包括设计师、客户、用户、社区成员等。"]}
{"word":"codesigning","summary":{"en":"Codesigning (co-signing) is either legally signing to guarantee someone else’s obligation, or informally showing public support for an idea/person.","zh":"Codesigning（co-signing）既可指在法律上共同签署以为他人债务作担保，也可指在口语中公开表示支持或认可。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of signing a legal agreement together with another person, usually to guarantee their loan, lease, or obligation if they cannot pay","zh":"（在法律文件上）与他人共同签署，通常指为对方贷款、租约或债务作担保（对方无力支付时由你承担责任）"},"examples":[{"en":"My sister asked me about co-signing her student loan.","zh":"我妹妹问我能不能帮她共同签署（担保）学生贷款。"},{"en":"Before co-signing, read the contract carefully and understand the risks.","zh":"在共同签署（担保）之前，要仔细读合同并了解风险。"},{"en":"Co-signing can affect your credit score if payments are late.","zh":"如果还款逾期，共同签署（担保）可能会影响你的信用评分。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) publicly supporting, approving, or endorsing someone’s idea, opinion, or work","zh":"（非正式）公开表示支持、认可或为某人的想法、观点或作品“背书”"},"examples":[{"en":"I’m co-signing what she said about the new policy.","zh":"我支持（背书）她对新政策的说法。"},{"en":"The manager co-signed his proposal in the meeting.","zh":"经理在会议上公开支持了他的提案。"}]}],"synonyms":["guaranteeing","acting as a guarantor","joint signing","endorsing","backing","supporting"],"phonetic":"/ˈkoʊˌsaɪnɪŋ/","extraExplanation":["在美国的信贷语境里，co-signing（共同签署/担保）意味着你和借款人同样承担法律责任：如果对方不还，你需要还，而且逾期也可能影响你的信用记录。","口语里的 cosign / co-sign 常见于社交媒体或流行文化，意思更接近“我同意、我力挺”，不一定有法律含义。"]}
{"word":"codesigns","summary":{"en":"Codesign means creating a product, service, or plan collaboratively—often together with the users.","zh":"Codesign 指与他人（常与使用者/相关方）共同协作完成产品、服务或方案的设计。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to design something together with other people, especially the users or stakeholders who will be affected by it","zh":"（与他人，尤其是与使用者/相关利益方）共同参与设计；协作设计"},"examples":[{"en":"We codesign the app with teachers to make sure it fits classroom needs.","zh":"我们与老师共同设计这款应用，确保它符合课堂需求。"},{"en":"The city is codesigning a new park with local residents.","zh":"市政府正在与当地居民共同设计一座新公园。"}]},{"partOfSpeech":"n.","definition":{"en":"a process or approach where a product, service, or plan is created collaboratively with the people who will use it","zh":"共同设计：与最终使用者或相关方一起协作完成产品、服务或方案的过程/方法"},"examples":[{"en":"Codesign helps teams build services that real people can actually use.","zh":"共同设计能帮助团队做出真正可用、贴近用户的服务。"},{"en":"The project uses codesign workshops to gather ideas and test early drafts.","zh":"该项目通过共同设计工作坊来收集想法并测试早期方案。"}]}],"synonyms":["co-design","collaborate on the design","jointly design","participatory design"],"phonetic":"ˌkoʊdɪˈzaɪn","extraExplanation":["你输入的“codesigns”通常是动词第三人称单数（He/She codesigns…）或名词复数（different codesigns）。更常见的词形是“codesign / co-design”，写成带连字符的“co-design”在学术、政府与UX/服务设计领域很常见。","“codesign”强调让使用者/受影响者参与设计决策（而不仅是被动提供反馈）。在一些语境中它与“co-create（共创）”接近，但codesign更聚焦在“设计流程与方案产出”。"]}
{"word":"codespairer","summary":{"en":"“codespairer” is not standard English; it likely intends “code repairer/code fixer.”","zh":"“codespairer”不是标准英语词，可能想表达“修复代码的人/工具”（code repairer / code fixer）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It appears to be a misspelling or a made-up (nonce) term, possibly intended to mean “a person/tool that repairs or fixes code” (similar to “code repairer” or “code fixer”).","zh":"不是标准英语单词。看起来像拼写错误或临时造词，可能想表达“修复代码的人/工具”（类似于 code repairer 或 code fixer）。"},"examples":[{"en":"I think you meant “code repairer” or “code fixer,” not “codespairer.”","zh":"我觉得你想写的可能是“code repairer”或“code fixer”，不是“codespairer”。"},{"en":"As a code fixer, she spends most of her time debugging and updating old programs.","zh":"作为“代码修复者”，她大部分时间都在调试并更新旧程序。"}]}],"synonyms":["code fixer","code repairer","debugger","maintainer","developer","programmer"],"phonetic":"/koʊdˈspɛrər/","extraExplanation":["“codespairer”在常见英语词典中找不到，比较像把 code + repairer（修理者）或 sp—开头的词拼在一起后产生的拼写。","如果你想表达“修复代码的人”，更自然的说法有：developer（开发者）、programmer（程序员）、software engineer（软件工程师）、maintainer（维护者）、debugger（调试者，偏工具/角色）。","如果你告诉我你看到这个词的上下文句子（或这是产品名/用户名/项目名），我可以更准确判断它可能指什么。"]}
{"word":"codetermination","summary":{"en":"Codetermination is a system where employees share in company decision-making, often through board representation.","zh":"共同决定制是指员工参与企业决策的制度，常见形式是员工代表进入董事会/监事会参与治理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A system in which employees (often through unions or elected worker representatives) participate in a company’s decision-making, especially by having seats on the company’s board.","zh":"（共同决定制）一种让员工（常通过工会或员工代表）参与企业决策的制度，尤其是让员工代表进入公司董事会参与治理。"},"examples":[{"en":"Codetermination gives workers a formal voice on the supervisory board.","zh":"共同决定制让员工在监事会中拥有正式的发声渠道。"},{"en":"Germany is often cited as a country where codetermination is strongly established.","zh":"德国常被认为是共同决定制非常成熟的国家。"}]},{"partOfSpeech":"n.","definition":{"en":"More generally, any arrangement where management and employees share authority in setting workplace rules, pay structures, or major policies.","zh":"更广义地说，指管理层与员工共同分享权力来制定工作场所规则、薪酬结构或重大政策的任何安排。"},"examples":[{"en":"The agreement introduced codetermination on scheduling and overtime rules.","zh":"该协议在排班与加班规定上引入了共同决定机制。"},{"en":"They discussed whether codetermination could reduce workplace conflict.","zh":"他们讨论共同决定是否能减少职场冲突。"}]}],"synonyms":["worker participation","employee representation","co-management","shared governance","Mitbestimmung"],"phonetic":"/ˌkoʊdɪˌtɝːməˈneɪʃən/","extraExplanation":["“Codetermination”常见于欧洲劳资关系与公司治理语境，尤其与德国的“Mitbestimmung（共同参与/共同决定）”制度相关：在一定规模以上企业，员工代表可能在监事会/董事会中占有一定席位。","它通常与“collective bargaining（集体谈判）”并列出现：集体谈判更侧重工资与工作条件的谈判；共同决定更强调在治理或重大政策层面的参与权。"]}
{"word":"codetermine","summary":{"en":"Codetermine means to decide or influence something together with another person or factor.","zh":"Codetermine 指与他人或其他因素一起决定或共同影响某事的结果。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to determine something together with someone or something else; to jointly influence an outcome","zh":"与他人或其他因素一起决定；共同影响结果"},"examples":[{"en":"Interest rates and consumer confidence can codetermine how much people spend.","zh":"利率和消费者信心会共同决定人们花多少钱。"},{"en":"In some companies, workers and managers codetermine workplace policies.","zh":"在一些公司里，员工和管理层共同决定工作场所的政策。"},{"en":"Genes and environment codetermine many health outcomes.","zh":"基因和环境共同决定许多健康结果。"}]}],"synonyms":["co-determine","jointly determine","help determine","shape together","influence together"],"phonetic":"/ˌkoʊdɪˈtɝːmɪn/","extraExplanation":["这个词更常见的拼写是 **co-determine**（带连字符）或 **codetermine**（不带连字符）；两者意思相同。","常用于学术或正式写作，强调“没有单一原因/单一方决定”，而是“多方共同造成/共同决定”。","在欧洲语境里，**codetermination**（名词）也常指企业治理制度中“员工参与公司决策”的做法，尤其与德国的 *Mitbestimmung*（共同决策制度）相关。"]}
{"word":"codetta","summary":{"en":"A codetta is a short “tail” that acts as a concluding passage in music.","zh":"Codetta 指音乐中用于收束的短小结尾段，像加在结尾后的“尾巴”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Music) A short concluding passage that ends a section, movement, or piece, often like a small “tail” after the main ending.","zh":"（音乐）短小的结尾段，用来结束一个乐段、乐章或整首作品，常像在主要终止之后再加的一小段“尾巴”。"},"examples":[{"en":"After the main theme returned, the composer added a brief codetta to round off the movement.","zh":"主旋律回归之后，作曲家又加了一段简短的结尾段（codetta）来收束这一乐章。"},{"en":"In the score, the codetta repeats a tiny motif and then lands firmly on the final chord.","zh":"在乐谱中，这段结尾段反复一个小动机，然后稳稳地落在终止和弦上。"}]},{"partOfSpeech":"n.","definition":{"en":"(Music theory) A small closing section at the end of a phrase or theme, often reinforcing the cadence.","zh":"（乐理）乐句或主题末尾的小型收束段，常用于加强终止感（cadence）。"},"examples":[{"en":"The phrase ends with a cadence, followed by a codetta that emphasizes the home key.","zh":"这个乐句以终止式结束，随后用一个收束小段（codetta）来强调主调。"},{"en":"Teachers may point out the codetta as a clue to the form of the theme.","zh":"老师可能会把结尾小段（codetta）指出来，作为判断主题结构形式的线索。"}]}],"synonyms":["closing passage","coda (related but usually longer)","conclusion"],"phonetic":"/koʊˈdɛtə/","extraExplanation":["“Codetta”来自意大利语，意思是“小尾巴”，对应音乐写作中“在结尾之后再补上一小段”的感觉。","它常见于古典音乐的结构分析中（例如奏鸣曲式或回旋曲中），用来加强收束、延长终止、或把情绪更平稳地带到结束。"]}
{"word":"codettas","summary":{"en":"Codettas are short musical ending passages—little codas—that neatly close a phrase, section, or movement.","zh":"Codettas 指音乐中短小的结尾段（小尾声），用来收束乐句、段落或乐章。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a short concluding passage in a piece of music; a “little coda” that briefly wraps up a section or movement","zh":"（音乐）短小的结尾段；相当于“迷你尾声”，用来简短收束一个乐段或乐章"},"examples":[{"en":"The theme returns, followed by a brief codetta that closes the movement neatly.","zh":"主题回归后接上一段简短的 codetta，把这一乐章干净利落地收束起来。"},{"en":"In this dance tune, the codetta repeats the final phrase to signal the ending.","zh":"在这首舞曲里，codetta 重复最后一句旋律，用来提示结束。"}]},{"partOfSpeech":"n.","definition":{"en":"(music theory) a small closing idea that rounds off a phrase or section, often using a repeated cadence or final motif","zh":"（乐理）用来收尾一个乐句/段落的小型结尾材料，常通过重复终止式或结尾动机来完成收束"},"examples":[{"en":"After the cadence, the composer adds a codetta to reinforce the key.","zh":"终止式之后，作曲家加了一段 codetta 来强化调性。"},{"en":"The codetta is short, but it helps the listener feel a clear sense of closure.","zh":"codetta 虽短，却能让听众更清楚地感到“收束感”。"}]}],"synonyms":["short coda","closing passage","closing phrase","ending tag"],"phonetic":"/koʊˈdɛtə/","extraExplanation":["“codettas”是“codetta”的复数形式。该词来自意大利语，-etta 是“小……”的后缀，所以 codetta 字面意思就是“little coda（小尾声）”。","在分析古典音乐（如奏鸣曲、回旋曲）时，codetta 常被用来指主部或某个段落结束处的“补充收尾”，通常比完整的 coda 更短、更局部。"]}
{"word":"codette","summary":{"en":"“Codette” is not a standard English word; it’s usually a name/username or a misspelling (often of “codetta” in music).","zh":"“codette”不是标准英语词汇；多为名字/网名或拼写误写（常见是音乐术语“codetta”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A very rare/nonstandard word in English. It is most often seen as a name/username or a misspelling of another word (especially “codetta” in music).","zh":"英语中非常少见、非标准的词。最常见的情况是作为名字/网名出现，或是其他单词的拼写误写（尤其常被误写成音乐术语“codetta/codetta”）。"},"examples":[{"en":"I couldn’t find “codette” in most dictionaries—did you mean “codetta”?","zh":"大多数词典里找不到“codette”——你想说的是“codetta（小尾声）”吗？"},{"en":"“Codette” appears to be a username rather than a common English word.","zh":"“Codette”看起来更像是用户名，而不是常见英语单词。"}]}],"phonetic":"/koʊˈdɛt/","extraExplanation":["“Codette”很可能是把音乐术语 **codetta**（意为“短小的结尾/小尾声”，常用于古典音乐分析）拼错了。codetta 的词源来自意大利语 *coda*（尾巴、结尾）加上表示“小”的后缀。","如果你是在音乐课、乐谱分析或曲式（如奏鸣曲式）里看到的，建议你确认原词是否为 **codetta**。如果你提供一句原文，我也可以帮你判断到底是哪一个词。"]}
{"word":"codevelop","summary":{"en":"Codevelop means to develop something jointly with others, or to grow/progress together.","zh":"codevelop 指与他人共同开发，或（事物）同步发展。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to develop something together with another person, company, or group (sharing planning, work, and responsibility)","zh":"与他人/其他公司或团队共同开发（共同规划、投入工作并分担责任）"},"examples":[{"en":"The two companies codeveloped a new battery for electric cars.","zh":"这两家公司共同开发了一种用于电动汽车的新电池。"},{"en":"We’re codeveloping the training program with local teachers.","zh":"我们正在与当地教师共同开发这套培训项目。"},{"en":"The app was codeveloped by designers and engineers from three countries.","zh":"这款应用由来自三个国家的设计师和工程师共同开发。"}]},{"partOfSpeech":"v.","definition":{"en":"to grow or progress together at the same time (often used for systems, skills, or relationships)","zh":"（常指系统、能力或关系）共同发展、同步成长"},"examples":[{"en":"Trust and good communication often codevelop in a healthy team.","zh":"在健康的团队中，信任与良好沟通常常会同步发展。"},{"en":"Language skills and confidence can codevelop with regular practice.","zh":"通过规律练习，语言能力和自信心可以共同提升。"}]}],"synonyms":["co-develop","develop jointly","collaborate on","co-create","jointly develop"],"phonetic":"/ˌkoʊdɪˈvɛləp/","extraExplanation":["“co-”是前缀，表示“共同、一起”（如 cooperate 合作、coauthor 合著）。因此 codevelop 常用于商业、科技、研究语境，强调“共同投入与共同成果”。写作中也常见作形容词/过去分词：a codeveloped product（共同开发的产品）。"]}
{"word":"codeveloped","summary":{"en":"“Codeveloped / co-developed” means developed together through collaboration; it can function as an adjective or as the past tense/participle of “co-develop.”","zh":"“codeveloped / co-developed”表示“共同开发/共同研制”，既可作形容词，也可作动词 co-develop 的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"developed together by two or more people, groups, or organizations; created through collaboration.","zh":"由两方或多方共同开发/共同研制的；合作完成的。"},"examples":[{"en":"The app was co-developed by a university team and a local startup.","zh":"这款应用由大学团队和本地初创公司共同开发。"},{"en":"They co-developed a new method to reduce water use in farming.","zh":"他们共同研发了一种减少农业用水的新方法。"},{"en":"This product was co-developed with our partners in Japan.","zh":"该产品与我们在日本的合作伙伴共同开发。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “co-develop”: to develop something together with someone else.","zh":"“co-develop（共同开发）”的过去式/过去分词：与他人一起开发某物。"},"examples":[{"en":"We co-developed the training program last year.","zh":"我们去年共同开发了这个培训项目。"},{"en":"The two companies have co-developed several tools for teachers.","zh":"这两家公司已共同开发了几款教师工具。"}]}],"synonyms":["collaboratively developed","jointly developed","developed together","co-created"],"phonetic":"/ˌkoʊdɪˈvɛləpt/","extraExplanation":["拼写上常见两种形式：co-developed（更正式、常见于书面语/新闻稿/学术与商业文本）和 codeveloped（有时出现在不使用连字符的写作规范中）。在简历、论文或官网文案里通常建议用 co-developed 更清晰。","语境上它常用于“共同研发/联合开发”的场景，如软件、药物、产品、课程、政策或研究成果；强调各方都有实质性贡献。"]}
{"word":"codeveloper","summary":{"en":"A co-developer is someone who develops something together with others, often a software or product.","zh":"co-developer 指与他人共同进行开发的人（或团队），常用于软件或产品开发语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or team that develops something together with another person or team (especially software, a product, or a project).","zh":"与他人或其他团队共同开发某事物的人或团队（尤指软件、产品或项目）。"},"examples":[{"en":"Our co-developer built the login system while we worked on the database.","zh":"我们的共同开发者负责登录系统，而我们负责数据库。"},{"en":"She is a co-developer of the app and helped design its main features.","zh":"她是这款应用的共同开发者之一，并参与设计主要功能。"}]}],"synonyms":["collaborator","joint developer","partner","co-creator"],"phonetic":"/ˌkoʊdɪˈvɛləpɚ/","extraExplanation":["“co-”表示“共同、一起”。写作时常见两种形式：co-developer（更常见，尤其在正式写作中）和 codeveloper（较少见）。在科技行业里，它常用于指共同开发软件、开源项目或联合产品的合作方/人员。"]}
{"word":"codevelopers","summary":{"en":"Co-developers are people who work together to develop something.","zh":"codevelopers（更常写作 co-developers）指一起开发某事物的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who develop something together (such as software, a product, or a project); partners in development.","zh":"共同开发某事物（如软件、产品或项目）的人；共同开发者。"},"examples":[{"en":"I’ll ask my co-developers to review the code before we merge it.","zh":"我会请共同开发者在合并前审查代码。"},{"en":"The game’s co-developers announced a new update schedule.","zh":"这款游戏的共同开发者公布了新的更新计划。"}]}],"synonyms":["collaborators","development partners","teammates","fellow developers"],"phonetic":"/ˌkoʊ dɪˈvɛləpərz/","extraExplanation":["“co-”表示“共同、一起”。“co-developer”常写作带连字符的形式（co-developer），复数是“co-developers”。在工作场景中也常用更具体的说法，如“teammates / collaborators / fellow developers”。"]}
{"word":"codeveloping","summary":{"en":"“Codeveloping” means developing something together with others, or developing in parallel at the same time.","zh":"“codeveloping”指与他人共同开发/共同发展，也可指并行、同时发展。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"developing something together with another person, company, or group (present participle of “co-develop”).","zh":"与他人/其他公司/团体共同开发、共同发展（“co-develop”的现在分词）。"},"examples":[{"en":"We are codeveloping a new app with a local startup.","zh":"我们正在与一家本地初创公司共同开发一款新应用。"},{"en":"The two universities are codeveloping a program to train teachers.","zh":"这两所大学正在共同开发一个教师培训项目。"},{"en":"They are codeveloping the storyline and the characters.","zh":"他们正在共同创作剧情和角色。"}]},{"partOfSpeech":"adj.","definition":{"en":"happening or growing together at the same time; developing in parallel (often used as an adjective in front of a noun).","zh":"同时共同发生/共同成长；并行发展（常作定语）。"},"examples":[{"en":"We studied the codeveloping trends in technology and education.","zh":"我们研究了科技与教育的并行发展趋势。"},{"en":"Codeveloping markets often influence each other.","zh":"并行发展的市场往往会相互影响。"}]}],"synonyms":["co-creating","collaborating on","jointly developing","developing together","partnering on"],"phonetic":"ˌkoʊdɪˈvɛləpɪŋ","extraExplanation":["“codeveloping”来自“co-”（共同）+“develop”（发展/开发）。写法上既可写作 co-developing（更常见于较正式写作），也可写作 codeveloping（更像合成词，常见于商业、科技文档）。","在职场语境里，codeveloping 强调“双方共同投入与共同承担”，常用于产品、技术、项目、课程、研究等：codeveloping a product / codeveloping standards / codeveloping a curriculum。"]}
{"word":"codevelops","summary":{"en":"“Codevelops” means “develops something jointly with others.”","zh":"“codevelops”表示“与他人共同开发/共同研制”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Third-person singular of “co-develop”) to develop something together with another person, team, or organization.","zh":"（“co-develop”的第三人称单数）与他人、团队或机构共同开发/共同研制某事物。"},"examples":[{"en":"She codevelops a new app with a small startup.","zh":"她与一家小型创业公司共同开发一款新应用。"},{"en":"The university codevelops this program with local schools.","zh":"这所大学与当地学校共同开发这个项目。"},{"en":"Our engineers codevelop the product with customers to meet real needs.","zh":"我们的工程师与客户共同开发产品，以满足真实需求。"}]}],"synonyms":["co-develops","collaborates on","jointly develops","partners to develop"],"phonetic":"/ˌkoʊdɪˈvɛləps/","extraExplanation":["“codevelops”来自动词“co-develop”。写法上常见两种：带连字符 co-develops（更传统、也更清晰）和不带连字符 codevelops（在商业/科技写作中也常见）。两者意思相同。","常用搭配：codevelops a product/feature/app（共同开发产品/功能/应用），codevelops with + 人/机构（与……共同开发）。"]}
{"word":"codeword","summary":{"en":"A codeword is a secret word/phrase used for secure identification, or a hidden name for an operation/project; it can also mean a “coded” substitute term for something sensitive.","zh":"codeword 指用于安全识别的口令/暗号，或用于保密的行动/项目代号；也可指对敏感话题的“暗语式”替代说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A secret word or phrase used to identify someone, confirm permission, or communicate safely (often used in the military, security, or spy stories).","zh":"用于识别身份、确认授权或安全沟通的“口令/暗号”（常见于军队、安保或谍战场景）。"},"examples":[{"en":"What’s the codeword to enter the building?","zh":"进入这栋楼的口令是什么？"},{"en":"They agreed on a codeword so they would know it was really each other.","zh":"他们约定了一个暗号，这样就能确认对方确实是本人。"},{"en":"If I text you the codeword, call the police.","zh":"如果我发给你暗号，就报警。"}]},{"partOfSpeech":"n.","definition":{"en":"A special name used to hide the real name of a plan, project, operation, or product while it is secret or unfinished.","zh":"用于隐藏某个计划、项目、行动或产品真实名称的“代号/项目代号”。"},"examples":[{"en":"The rescue operation had the codeword “Eagle.”","zh":"这次救援行动的代号是“Eagle”。"},{"en":"During development, the phone was known by a codeword.","zh":"在研发期间，这款手机用一个代号来称呼。"}]},{"partOfSpeech":"n.","definition":{"en":"A word or expression used as a substitute for something sensitive or embarrassing (a kind of indirect or “coded” way of speaking).","zh":"用来替代敏感或尴尬事物的说法（类似委婉语或“暗语式”表达）。"},"examples":[{"en":"“Downsizing” is sometimes a codeword for “layoffs.”","zh":"“downsizing”有时是“裁员”的委婉说法。"},{"en":"In that office, “restructuring” was a codeword everyone worried about.","zh":"在那家公司里，“restructuring”是大家一听就紧张的“暗语”。"}]}],"synonyms":["password","watchword","signal word","codename","secret word","euphemism"],"phonetic":"/ˈkoʊdˌwɝd/","extraExplanation":["“codeword”在现实中常见于军队/安保的“口令（password/challenge-and-response）”，也常见于情报或行动的“代号（codename）”。在新闻或职场语境里，它还可以表示“听起来中性，但实际含义更重”的替代说法（类似euphemism）。"]}
{"word":"codewords","summary":{"en":"A codeword is a secret word/phrase used for secure communication or identity checks; it can also mean an indirect “signal” word, or (in tech) a data unit in a coding system.","zh":"codeword 指用于保密通信或身份确认的暗号/口令；也可指带隐含指向的“暗语”；在技术语境中还指编码系统中的“码字”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A secret word or phrase used to communicate securely or to confirm someone’s identity (often in the military, police work, or emergencies).","zh":"（用于保密通信或确认身份的）暗号；口令（常见于军队、警方或紧急情况）"},"examples":[{"en":"If you don’t know the codeword, you can’t enter the safe room.","zh":"如果你不知道暗号，你就不能进入安全房间。"},{"en":"They agreed on a codeword to make sure the caller was really a family member.","zh":"他们约定了一个暗号，用来确认打电话的人确实是家人。"}]},{"partOfSpeech":"n.","definition":{"en":"A word used to refer to something sensitive in a less direct way, especially in politics or social topics (often implying a hidden message).","zh":"（尤指政治或社会议题中）暗语；隐晦用词（常带有“话里有话”的暗示）"},"examples":[{"en":"In some speeches, “law and order” is treated as a codeword for tougher policing.","zh":"在一些演讲中，“法律与秩序”被视为暗语，暗指更强硬的执法。"},{"en":"Be careful—some “neutral” terms can become codewords depending on context.","zh":"要小心——一些看似中性的词在特定语境下可能会变成暗语。"}]},{"partOfSpeech":"n.","definition":{"en":"In computing, telecommunications, or coding theory: a specific string or block of symbols that represents data under a coding system.","zh":"（计算机、通信或编码理论中）码字；用于表示数据的一串符号/比特块"},"examples":[{"en":"The system transmits each message as a series of codewords.","zh":"系统把每条信息作为一系列码字来传输。"},{"en":"A valid codeword must follow the rules of the code.","zh":"有效的码字必须符合该编码的规则。"}]}],"synonyms":["password","watchword","signal word","shibboleth"],"phonetic":"/ˈkoʊdˌwɝd/","extraExplanation":["日常里更常见的单数形式是 **codeword**；你输入的 **codewords** 是复数。","在新闻与文化语境中，codeword（暗语）常用来讨论“表面正常、实际暗示特定立场或群体”的用词；是否算暗语很依赖具体语境与听众解读。"]}
{"word":"codex","summary":{"en":"A codex is (1) an ancient bound manuscript book, or (2) an organized collection of laws/rules (a code).","zh":"codex 指（1）古代装订成册的抄本/手稿书；或（2）系统整理的法规、规则汇编（法典/准则）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a book, especially an ancient manuscript made of pages bound together (not a scroll)","zh":"（尤指古代的）抄本书册；装订成册的手稿（不同于卷轴）"},"examples":[{"en":"The museum displayed a medieval codex with gold-leaf illustrations.","zh":"博物馆展出了一部带有金箔插图的中世纪抄本。"},{"en":"Scholars studied the codex to understand how the text changed over time.","zh":"学者研究这部抄本，以了解文本如何随着时间演变。"}]},{"partOfSpeech":"n.","definition":{"en":"a systematically arranged set of rules, laws, or guidelines; a code","zh":"（系统整理的）法规汇编；规则体系；法典"},"examples":[{"en":"The city updated its building codex to improve safety standards.","zh":"该市更新了建筑法规汇编，以提高安全标准。"},{"en":"The organization follows a codex of conduct for all members.","zh":"该组织为所有成员制定并遵守行为准则。"}]}],"synonyms":["manuscript","book","volume","code","compendium","rulebook"],"phonetic":"/ˈkoʊdɛks/","extraExplanation":["“codex”源自拉丁语，原意与“木块/树干”有关，后来指用木板装订的书。与“scroll（卷轴）”相对，codex 的页册形式更接近现代书本。","复数常见为“codices”（/ˈkoʊdɪˌsiz/），也可见“codexes”（更口语/现代）。","在现代语境中，Codex 也常作为专名出现，例如“Codex Alimentarius（食品法典委员会/食品标准）”，以及编程领域的产品名或项目名（如 OpenAI Codex）。"]}
{"word":"codex-related","summary":{"en":"“Codex-related” means connected with a codex—usually an ancient manuscript book, and sometimes (by context) a compiled set of rules or reference material.","zh":"“codex-related”表示“与codex有关的”，通常指与古代抄本册有关；在特定语境下也可指与法典、规范汇编或资料库等有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with or about a codex (an ancient manuscript book, often written on parchment, especially from the Roman and medieval periods).","zh":"与“抄本册/古代手抄本书”（codex，尤指罗马与中世纪时期写在羊皮纸等材料上的书册形式）有关的。"},"examples":[{"en":"The museum has a small room for codex-related artifacts, including inkpots and writing tools.","zh":"博物馆有一个小展室展示与古代抄本有关的文物，包括墨水瓶和书写工具。"},{"en":"She is doing codex-related research on how scribes corrected mistakes in the margins.","zh":"她正在做与古代抄本相关的研究，主题是抄写员如何在页边改正错误。"}]},{"partOfSpeech":"adj.","definition":{"en":"(More broadly) Connected with a modern “codex,” such as a set of rules, a code, or a compiled reference text (depending on context).","zh":"（更广义）与现代语境中的“法典/规范汇编/代码集”等“codex”概念有关的（具体含义取决于上下文）。"},"examples":[{"en":"The training included codex-related guidelines for ethical conduct.","zh":"培训内容包括与行为准则汇编相关的道德规范。"},{"en":"In this game community, codex-related pages explain the lore and item stats.","zh":"在这个游戏社区里，与资料库（codex）相关的页面会解释世界观和道具数值。"}]}],"synonyms":["codex-associated","codex-linked","codex-based","manuscript-related","code-related"],"phonetic":"/ˈkoʊdɛks rɪˈleɪtɪd/","extraExplanation":["“codex”原指“书册形态的手稿书”，与更早的卷轴（scroll）相对；很多西方古典与中世纪文献以这种形式保存下来，所以在博物馆、考古、古文字学、宗教研究等领域很常见。","在当代语境中，“codex”有时也被借用来指“汇编成册的规则/条文/资料库”（例如法典、游戏资料库等）。因此看到“codex-related”时，最好从上下文判断是“古代抄本”还是“规则/资料汇编”。"]}
{"word":"codfish","summary":{"en":"Codfish is a commonly eaten ocean fish, or the meat from it.","zh":"Codfish 指常见可食用的海鱼“鳕鱼”，也可指鳕鱼肉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large ocean fish that is commonly eaten; also the meat from this fish","zh":"鳕鱼；（也指）鳕鱼肉（常见可食用海鱼及其鱼肉）"},"examples":[{"en":"We had codfish with potatoes for dinner.","zh":"我们晚餐吃了鳕鱼配土豆。"},{"en":"Codfish is often used in fish and chips.","zh":"鳕鱼常用来做炸鱼薯条。"},{"en":"In some markets, codfish is sold fresh, frozen, or salted.","zh":"在一些市场里，鳕鱼会以鲜货、冷冻或盐渍的形式出售。"}]}],"synonyms":["cod","salt cod (for salted codfish)"],"phonetic":"/ˈkɑdˌfɪʃ/","extraExplanation":["“codfish”在日常英语里常常直接说“cod”，尤其是在点餐或超市标签上（如：fresh cod）。","在不同地区，“cod”有时也会被用作更宽泛的“鳕形鱼类”统称；如果需要更具体，可以说“Atlantic cod（大西洋鳕）”等。","“salt cod / salted cod（盐渍鳕鱼）”在一些传统菜里很常见，例如葡萄牙的bacalhau以及加勒比地区的saltfish dishes。"]}
{"word":"codfisher","summary":{"en":"A codfisher is someone who catches cod, especially as a livelihood.","zh":"codfisher 指捕捞鳕鱼的人，尤指以此为生的渔民。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who catches cod (a type of ocean fish), especially as a job","zh":"捕鳕鱼的人（尤指以捕鳕为业的人）"},"examples":[{"en":"My grandfather worked as a codfisher off the coast of Maine.","zh":"我爷爷曾在缅因州近海当过捕鳕鱼的渔民。"},{"en":"Codfishers have to follow strict rules to protect fish populations.","zh":"捕鳕鱼的渔民必须遵守严格规定，以保护鱼群数量。"}]}],"synonyms":["cod fisherman","fisherman","fisher"],"phonetic":"/ˈkɑdˌfɪʃər/","extraExplanation":["“Codfisher”是由“cod（鳕鱼）+ fisher（捕鱼者）”组成的复合词。更常见的说法是“cod fisherman”。","在北大西洋地区（如加拿大纽芬兰、美国新英格兰一带），鳕鱼渔业在历史上非常重要；因此相关词汇常出现在当地的海洋文化、历史叙述与民间故事中。"]}
{"word":"codfisheries","summary":{"en":"“Cod fisheries” means the business of catching cod or the places where cod are caught.","zh":"“cod fisheries”指鳕鱼捕捞产业（鳕鱼渔业）或捕捞鳕鱼的渔场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the industry or activity of catching cod (a type of sea fish), especially as a commercial business","zh":"鳕鱼渔业；指捕捞鳕鱼（海鱼的一种）的产业或活动，尤指商业捕捞"},"examples":[{"en":"Many coastal towns depended on cod fisheries for jobs and income.","zh":"许多沿海城镇依靠鳕鱼渔业提供工作和收入。"},{"en":"The government introduced new rules to protect cod fisheries from overfishing.","zh":"政府出台了新规定，以保护鳕鱼渔业免受过度捕捞的影响。"}]},{"partOfSpeech":"n.","definition":{"en":"specific fishing areas or fishing grounds where cod are caught","zh":"鳕鱼渔场；指捕捞鳕鱼的特定海域或渔场"},"examples":[{"en":"Boats traveled north to reach the cod fisheries during the peak season.","zh":"在旺季，渔船会北上前往鳕鱼渔场。"}]}],"synonyms":["cod fishing","cod fishery","commercial cod fishing","cod fishing grounds"],"phonetic":"/kɑd ˈfɪʃəriz/","extraExplanation":["“cod fisheries”常见于新闻、环境报告和历史写作中。著名背景之一是加拿大纽芬兰附近的大西洋鳕鱼渔业在20世纪末因过度捕捞等因素严重衰退，成为资源管理与海洋保护的典型案例。","拼写上更常见的是分开写“cod fisheries”。你输入的“codfisheries”可理解为合写形式，但在正式英文中一般不用合写。"]}
{"word":"codfishery","summary":{"en":"Codfishery means the catching and industry of cod, or the cod fishing area.","zh":"Codfishery 指鳕鱼的捕捞与相关产业，或鳕鱼渔场/渔业。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity or industry of catching cod; a cod fishing ground or fishery","zh":"鳕鱼捕捞业；鳕鱼渔场（或渔业）"},"examples":[{"en":"The town’s economy once depended on the codfishery.","zh":"这个小镇的经济曾经依赖鳕鱼捕捞业。"},{"en":"Strict quotas were introduced to protect the codfishery from collapse.","zh":"为防止鳕鱼渔业崩溃，人们引入了严格的配额制度。"},{"en":"Many boats left the codfishery and switched to other species.","zh":"许多渔船退出了鳕鱼捕捞，转而捕捞其他鱼种。"}]}],"synonyms":["cod fishery","cod fishing industry","fishery"],"phonetic":"/ˈkɑdˌfɪʃəri/","extraExplanation":["“codfishery”在历史与新闻语境中常与北大西洋（如纽芬兰、加拿大大西洋沿岸、冰岛、挪威等）的鳕鱼渔业联系紧密。20世纪末一些地区因过度捕捞与生态变化出现资源锐减，相关政府实施禁渔、配额与管理改革，因此该词常出现在“保护、配额、崩溃、复苏”等主题里。"]}
{"word":"codfishes","summary":{"en":"“Codfishes” means more than one codfish (cod), a sea fish commonly eaten.","zh":"“codfishes”意为“多条鳕鱼”（codfish 的复数），鳕鱼是一种常见食用海鱼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of codfish: cod (a kind of sea fish), often used as food.","zh":"codfish 的复数：鳕鱼（一种海鱼），常用作食物。"},"examples":[{"en":"The market sells fresh codfishes every morning.","zh":"这个市场每天早上卖新鲜的鳕鱼。"},{"en":"Codfishes are common in cold northern waters.","zh":"鳕鱼在寒冷的北方海域很常见。"},{"en":"They cooked the codfishes with butter and herbs.","zh":"他们用黄油和香草烹饪鳕鱼。"}]}],"synonyms":["cod","codfish"],"phonetic":"/ˈkɑdˌfɪʃɪz/","extraExplanation":["“codfish / cod”在日常英语里更常用“cod”（既可指单数也可指复数）或“codfish”。“codfishes”作为复数形式是正确的，但在现代口语和菜单上相对少见。","鳕鱼在欧美饮食文化中很常见，比如英式“fish and chips”常用鳕鱼（cod）或黑线鳕（haddock）。同时，鳕鱼渔业也常出现在海洋生态与可持续捕捞的话题中。"]}
{"word":"codfishing","summary":{"en":"Codfishing means catching cod, or the cod-fishing industry.","zh":"Codfishing 指捕捞鳕鱼，或指鳕鱼渔业（产业）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity or practice of catching cod (a type of ocean fish), usually for food or commercial sale","zh":"捕捞鳕鱼的活动或做法（鳕鱼是一种海鱼），通常用于食用或商业销售"},"examples":[{"en":"Codfishing is popular in the North Atlantic, especially during certain seasons.","zh":"在北大西洋，捕鳕鱼在特定季节很受欢迎。"},{"en":"Local rules limit codfishing to protect the fish population.","zh":"当地法规限制捕鳕鱼，以保护鱼群数量。"}]},{"partOfSpeech":"n.","definition":{"en":"the cod-fishing industry or fishery in a particular area","zh":"某一地区的鳕鱼渔业（产业/渔场）"},"examples":[{"en":"The town grew wealthy from codfishing in the 1800s.","zh":"这个小镇在19世纪因鳕鱼渔业而富裕起来。"},{"en":"New regulations changed codfishing across the region.","zh":"新法规改变了整个地区的鳕鱼渔业。"}]}],"synonyms":["fishing for cod","cod-fishing","cod fishery"],"phonetic":"/ˈkɑdˌfɪʃɪŋ/","extraExplanation":["“Codfishing”常写作一个词，也常见连字符写法“cod-fishing”。在日常表达中，人们也会说“fishing for cod”（去钓/捕鳕鱼）。","鳕鱼在北大西洋饮食与贸易史中很重要，尤其与新英格兰（New England）和加拿大大西洋沿岸的渔业文化有关；因此在一些历史语境里，codfishing 也会带有“传统生计/地方经济支柱”的意味。"]}
{"word":"codger","summary":{"en":"A (often humorous) informal word for an old man, especially one who seems odd or stubborn.","zh":"口语里带点调侃地称呼“老头儿”，常指古怪或固执的老男人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an old man, especially one seen as odd, stubborn, or humorous in an old-fashioned way","zh":"老头儿（尤指古怪、固执，或带点滑稽、老派感觉的老男人）"},"examples":[{"en":"The old codger at the corner store always tells stories about “the good old days.”","zh":"街角小店的那位老头儿总爱讲“过去的好时光”的故事。"},{"en":"Don’t mind him—he’s a grumpy old codger, but he’s kind underneath.","zh":"别介意——他是个脾气臭的老头儿，但内心其实很善良。"}]}],"synonyms":["old man","old-timer","geezer","curmudgeon"],"phonetic":"/ˈkɑːdʒɚ/","extraExplanation":["“codger”是比较口语、带评价色彩的词，常含“调侃/戏称”的感觉；有时也可能带轻微贬义（像“老顽固”）。使用时要看语境和对象关系，避免对陌生人或正式场合使用，以免显得不礼貌。","常见搭配：a funny/queer/odd old codger（古怪但好笑的老头儿）、a grumpy old codger（脾气坏的老头儿）。","词源上常被认为与“拘谨、爱计较的人”有关，现代用法多强调年纪大、性格古怪或固执的形象。"]}
{"word":"codgers","summary":{"en":"“Codgers” is the plural of “codger,” meaning old men, often in a humorous or slightly rude/affectionate way.","zh":"“codgers”是“codger”的复数，指“老头儿/老家伙”，多为口语，语气可幽默、略不客气或带亲昵。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An old man (often said in a humorous, slightly rude, or affectionate way).","zh":"老头儿；老家伙（常带幽默、略显无礼或亲昵的语气）。"},"examples":[{"en":"Some old codger keeps feeding the pigeons in the park every morning.","zh":"每天早上都有个老头儿在公园里喂鸽子。"},{"en":"He may look like a grumpy old codger, but he’s actually very kind.","zh":"他看起来像个爱抱怨的老家伙，但其实人很善良。"}]}],"synonyms":["old man","old fellow","old-timer","geezer"],"phonetic":"/ˈkɑdʒɚ/","extraExplanation":["“codger”通常指年纪大的男性，语气多为口语化；有时是开玩笑的称呼（类似“老顽固”“老爷子”），但在不熟的人面前可能显得不礼貌，使用时要注意场合与关系。","你输入的“codgers”是复数形式，单数是“codger”。"]}
{"word":"codhead","summary":{"en":"“Codhead” is a mainly UK/Ireland slang noun meaning a foolish person; rarely it can mean a cod fish’s head.","zh":"“codhead”主要是英爱地区的俚语名词，意思是“傻瓜”；很少情况下也可指“鳕鱼头”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, mainly UK/Ireland) A foolish or annoying person; an idiot.","zh":"（俚语，多见于英国/爱尔兰）傻瓜；讨厌的蠢人。"},"examples":[{"en":"Don’t be a codhead—check the time before you leave.","zh":"别当个傻瓜——出门前先看看时间。"},{"en":"He forgot his passport again; what a codhead.","zh":"他又忘带护照了；真是个蠢货。"}]},{"partOfSpeech":"n.","definition":{"en":"(literal, rare) The head of a cod fish.","zh":"（字面义，较少用）鳕鱼的头。"},"examples":[{"en":"Some recipes use codhead to make a rich fish stock.","zh":"有些菜谱会用鳕鱼头来熬出浓郁的鱼高汤。"}]}],"synonyms":["idiot","fool","dummy","nitwit"],"phonetic":"/ˈkɑdˌhɛd/","extraExplanation":["“codhead”通常带有贬义、带点粗鲁的玩笑口吻，用来骂人或吐槽别人不聪明；在正式场合不建议使用。","它属于地区性较强的口语词（英爱更常见），在美式英语里不常听到。"]}
{"word":"codheaded","summary":{"en":"“Codheaded” is an old-fashioned insult meaning “stupid” or “foolish.”","zh":"“codheaded”是较旧的侮辱性说法，意思是“愚蠢的、傻的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Old-fashioned, insulting) stupid; foolish; having poor judgment.","zh":"（旧式、侮辱性）愚蠢的；傻的；缺乏判断力的。"},"examples":[{"en":"Don’t be so codheaded—read the instructions first.","zh":"别这么傻——先把说明书读一遍。"},{"en":"He made a codheaded mistake and emailed the wrong file to everyone.","zh":"他犯了个很蠢的错误，把错误的文件群发给了所有人。"}]}],"synonyms":["stupid","foolish","silly","thick-headed","boneheaded","dim-witted"],"phonetic":"/ˈkɑdˌhɛdɪd/","extraExplanation":["“codheaded”是比较古老的骂人说法，现代英语里很少用，更多会在旧文学、戏剧或模仿古风的语气中出现。","这里的“cod”在历史上有“傻瓜、蠢人”的意思（类似于“nincompoop”那种带嘲讽的称呼）；“-headed”常用来构成“……脑袋的/……性格的”形容词，如“thick-headed（愚钝的）”。因此“codheaded”字面像“傻瓜脑袋”，引申为“愚蠢的”。","使用提醒：语气带侮辱，和朋友开玩笑也可能冒犯；正式场合建议用更中性的表达，如“careless（粗心的）”“unwise（不明智的）”。"]}
{"word":"Codi","summary":{"en":"Codi is a personal name, commonly used as a variant of “Cody.”","zh":"Codi 是一个人名，常被视为 “Cody” 的拼写变体。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a given name (usually a nickname or spelling variant of “Cody”); used for any gender, but often seen as a modern, casual name","zh":"人名（常被视为“Cody”的昵称或拼写变体）；男女皆可用，但更常见于现代、较随意的取名方式"},"examples":[{"en":"Codi is my classmate in English 101.","zh":"Codi 是我英语101课的同学。"},{"en":"I met Codi at the library yesterday.","zh":"我昨天在图书馆遇到了 Codi。"},{"en":"Codi, could you help me with this homework?","zh":"Codi，你能帮我做这份作业吗？"}]}],"synonyms":["Cody"],"phonetic":"/ˈkoʊdi/","extraExplanation":["“Codi”在英语里更常见的对应拼写是“Cody”。“Cody”最早多见于姓氏，后来变成名字；常被认为与爱尔兰姓氏来源有关，并被解释为带有“乐于助人/有帮助的”含义（不同资料说法会略有差异）。","在日常阅读中，如果你看到 Codi/Cody 作为人名，一般不需要翻译含义，直接按名字处理即可。"]}
{"word":"Codiaceae","summary":{"en":"Codiaceae is a scientific term for a family of marine green algae, including Codium.","zh":"Codiaceae 是科学术语，指一类海洋绿藻的科，其中包括石莼属（Codium）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of green algae that includes the genus Codium (often called “dead man’s fingers”), found mainly in marine environments.","zh":"（生物）绿藻的一科，包含石莼属（Codium，常被称为“死人手指藻”），主要生活在海洋环境中。"},"examples":[{"en":"Codiaceae includes Codium, a common seaweed on rocky shores.","zh":"Codiaceae（石莼科）包含石莼属（Codium），是在岩石海岸常见的海藻。"},{"en":"Some Codiaceae species can spread quickly and become invasive in new waters.","zh":"某些石莼科物种在新的水域中可能扩散很快，甚至成为入侵物种。"}]}],"synonyms":["Codium family","a family of green algae"],"phonetic":"/ˌkoʊdiˈeɪsiˌiː/","extraExplanation":["“Codiaceae”是生物分类学里的科名（family name），常见于学术文章、物种名录或海洋生态研究中。一般日常英语里不常用，更常见的是说“Codium”或直接说“seaweed（海藻）”。","与它相关的常见词：green algae（绿藻）、seaweed（海藻）、genus（属）、species（种）、marine（海洋的）、invasive species（入侵物种）。"]}
{"word":"codiaceae","summary":{"en":"Codiaceae is a scientific name for a family of marine green algae, including Codium.","zh":"Codiaceae 是羽毛藻科的学名，指包含 Codium（羽毛藻属）在内的一类海洋绿藻。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of green algae (seaweeds), including the genus Codium, often found in marine environments.","zh":"绿藻的一科（海藻类），包括羽毛藻属（Codium）等，常见于海洋环境。"},"examples":[{"en":"Codiaceae includes several Codium species that grow on rocks in shallow coastal waters.","zh":"Codiaceae（羽毛藻科）包含多种 Codium（羽毛藻属）物种，常在近岸浅水区的岩石上生长。"},{"en":"Some members of Codiaceae can form dense mats that affect local marine habitats.","zh":"羽毛藻科的一些成员会形成密集的藻毯，从而影响当地海洋栖息地。"}]}],"synonyms":["Codium family"],"phonetic":"/ˌkoʊdiˈeɪsiˌiː/","extraExplanation":["“Codiaceae”是生物分类学里的拉丁化名称：科名通常以“-aceae”结尾，表示“……科”。","常见相关属是Codium（羽毛藻属），有些物种在部分地区会被视为外来入侵海藻，因其生长快、覆盖面大。"]}
{"word":"codiaceous","summary":{"en":"Codiaceous describes something that looks or feels like Codium seaweed—soft, spongy, and velvety.","zh":"Codiaceous 指“像叉枝藻属（Codium）海藻那样的”，常强调柔软、海绵状、绒毛般的质地。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(biology) Resembling or relating to the green seaweed genus Codium (often soft, spongy, and velvety in texture).","zh":"（生物）类似或与绿藻属“Codium（叉枝藻属）”有关的；常指质地柔软、海绵状、绒毛感的。"},"examples":[{"en":"The specimen had a codiaceous, velvety surface typical of some Codium seaweeds.","zh":"这份标本表面呈叉枝藻状的绒毛质感，是某些叉枝藻属海藻的典型特征。"},{"en":"Under the microscope, the thallus looked codiaceous and spongy rather than leafy.","zh":"在显微镜下，这种藻体看起来呈叉枝藻状、海绵状，而不是叶片状。"}]}],"synonyms":["Codium-like","sponge-like","velvety"],"phonetic":"/ˌkoʊdiˈeɪʃəs/","extraExplanation":["该词多见于海洋生物学、藻类学的描述性写作中：用“codiaceous”来概括“像叉枝藻属（Codium）那样的形态/触感”。Codium常被形容为柔软、海绵状、触感像绒布。","词形结构：Codium + -aceous（表示“……的、具有……性质的”，如 herbaceous“草本的”、crustaceous“甲壳类的”）。"]}
{"word":"Codiaeum","summary":{"en":"Codiaeum is a genus of tropical ornamental plants, commonly known as croton.","zh":"Codiaeum 指变叶木属，是热带观赏植物属，常见俗名为 croton（变叶木）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical plants in the spurge family (Euphorbiaceae), best known for ornamental plants with colorful leaves, especially the garden croton.","zh":"变叶木属（大戟科的热带植物属），以叶色鲜艳的观叶植物著称，尤其指常见的园艺变叶木（croton）。"},"examples":[{"en":"Codiaeum variegatum is often grown indoors for its bright, patterned leaves.","zh":"Codiaeum variegatum 常被当作室内观叶植物栽培，因为它的叶片颜色明亮、花纹丰富。"},{"en":"The label on the pot said “Codiaeum,” but many people simply call it croton.","zh":"花盆标签写着“Codiaeum”，但很多人直接叫它 croton（变叶木）。"}]}],"synonyms":["croton"],"phonetic":"/ˌkoʊdiˈiːəm/","extraExplanation":["“Codiaeum”常用于植物学或园艺标签中，作为属名一般首字母大写；日常交流里更常用俗名“croton（变叶木）”。","在室内园艺语境中，人们提到的多是“Codiaeum variegatum”（常见观赏种），而不是整个属的所有植物。"]}
{"word":"codiaeum","summary":{"en":"Codiaeum is a tropical plant genus, especially the colorful-leaved croton (Codiaeum variegatum).","zh":"Codiaeum 指变叶木属植物，尤指叶色多彩的变叶木（常被英文俗称为 croton）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical plant (genus Codiaeum), especially Codiaeum variegatum, grown for its bright, multicolored leaves; commonly called croton.","zh":"变叶木属植物（Codiaeum），尤指变叶木（Codiaeum variegatum），因叶色鲜艳多变而常作观叶植物；常见俗名为“巴西变叶木/彩叶木”，英文也常叫 croton（变叶木）。"},"examples":[{"en":"The codiaeum by the window has red, yellow, and green leaves.","zh":"窗边那盆变叶木的叶子有红、黄、绿多种颜色。"},{"en":"Codiaeum variegatum is popular as a houseplant in warm, bright rooms.","zh":"变叶木（Codiaeum variegatum）在温暖、光照充足的室内很受欢迎，常被当作盆栽。"}]}],"synonyms":["croton","Codiaeum variegatum"],"phonetic":"/ˌkoʊdiˈiːəm/","extraExplanation":["“Codiaeum”是植物学上的属名，日常英语里更常听到的是“croton”。不过要注意：在园艺市场上，“croton”有时也会被用来指其他近似的观叶植物，所以在正式场合用“Codiaeum”更精确。","作为室内植物时，变叶木通常需要强光才能保持鲜艳叶色；光线不足时叶色可能变绿。其汁液可能刺激皮肤，修剪时最好戴手套。"]}
{"word":"Codiales","summary":{"en":"“Cordial” means warm and politely friendly; it can also mean a sweet drink or liqueur (often “cordials”).","zh":"“cordial”指热情而礼貌的；也可指甜饮料或甜酒（常用复数“cordials”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Warm, friendly, and polite (often used in formal situations).","zh":"热情友好的；彬彬有礼的（常用于较正式的场合）。"},"examples":[{"en":"They had a cordial conversation despite their disagreement.","zh":"尽管有分歧，他们仍进行了友好而礼貌的交谈。"},{"en":"Our neighbors gave us a cordial welcome.","zh":"邻居们热情地欢迎了我们。"}]},{"partOfSpeech":"n.","definition":{"en":"A sweet drink, especially a fruit-flavored syrup drink, or a sweet liqueur (often used in the plural: cordials).","zh":"甜饮料（尤指果味糖浆饮品）；或甜酒/利口酒（复数常用 cordials）。"},"examples":[{"en":"She served a cranberry cordial with ice.","zh":"她端上了一杯加冰的蔓越莓甜饮。"},{"en":"After dinner, they offered cordials and coffee.","zh":"晚餐后，他们提供了甜酒和咖啡。"}]}],"synonyms":["friendly","warm","amiable","affable","genial","heartfelt"],"phonetic":"/ˈkɔrdʒəl/","extraExplanation":["“Codiales”在英语里不常见，最可能是拼写错误，想写的是“cordiales/cordials/cordial”。在正式书信里常见搭配有“cordial regards”（谨致问候），“cordial invitation”（诚挚邀请）。","词源提示：cordial 来自拉丁语 cor（心），所以有“发自内心的、真诚热情的”这种感觉。"]}
{"word":"codiales","summary":{"en":"Cordial means friendly and polite; it can also mean a sweet liqueur or (regionally) a sweet syrupy drink.","zh":"Cordial 可表示“亲切友好、礼貌热情”；也可指“甜味利口酒”，或（因地区而异）指可兑水的甜味糖浆饮料。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"friendly, warm, and polite (often used for formal relationships or diplomacy)","zh":"友好而热情的；亲切而礼貌的（常用于较正式的人际关系或外交场合）"},"examples":[{"en":"They had a cordial conversation despite their disagreement.","zh":"尽管意见不同，他们仍进行了亲切友好的交谈。"},{"en":"She offered a cordial welcome to the new students.","zh":"她热情而礼貌地欢迎新同学。"}]},{"partOfSpeech":"n.","definition":{"en":"a sweet alcoholic drink (a liqueur), often served in small amounts after a meal","zh":"甜味烈酒；利口酒（常在饭后少量饮用）"},"examples":[{"en":"We finished dinner with coffee and a citrus cordial.","zh":"我们用咖啡和一小杯柑橘味利口酒结束晚餐。"},{"en":"He offered guests a homemade berry cordial.","zh":"他给客人们端上自制的浆果利口酒。"}]},{"partOfSpeech":"n.","definition":{"en":"a sweet drink or syrup, sometimes non-alcoholic (usage varies by region)","zh":"甜饮料或糖浆（有时不含酒精；不同地区用法不一）"},"examples":[{"en":"Add a little elderflower cordial to sparkling water.","zh":"在苏打水里加一点接骨木花糖浆。"}]}],"synonyms":["friendly","warm","amiable","affable","liqueur"],"phonetic":"/ˈkɔrdʒəl/","extraExplanation":["你输入的“codiales”更常见是拼写误差；英语里最接近、最常用的是“cordial”（形容词/名词）。“cordials”是其复数形式。","语体提示：形容词“cordial”常见于较正式或书面语（如新闻、商务、外交），强调“友好但不一定亲密”。","饮品含义在不同英语地区会有差异：在美式英语里常指甜味利口酒；在英式英语里也常指可兑水的甜味浓缩饮料（如 elderflower cordial）。"]}
{"word":"codical","summary":{"en":"Codical means ‘related to a codex’ (a bound manuscript/book), mainly used in academic contexts.","zh":"codical 意为“与古籍抄本装帧本（codex）有关的”，多见于学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to a codex (an old-style bound book or manuscript).","zh":"与“抄本/古籍装帧本（codex）”有关的；抄本式的。"},"examples":[{"en":"Scholars compared codical features such as page layout and binding.","zh":"学者比较了抄本式特征，比如版式和装订方式。"},{"en":"The museum’s catalog describes the codical structure of the manuscript.","zh":"博物馆的目录描述了这份手稿的抄本式结构。"}]}],"synonyms":["codex-related","manuscript-related"],"phonetic":"/ˈkɑdɪkəl/","extraExplanation":["“codical”在现代英语里很少见，主要出现在书籍史、手稿学（manuscript studies）等学术语境中，意思是“与codex（册页装订成书的抄本/古籍形态）有关”。","学习者常把它和更常见的“codicil”（遗嘱的附录/补充条款）混淆：codicil /ˈkɑdəsɪl/ 是法律用语，意思完全不同。"]}
{"word":"codices","summary":{"en":"Codices is the plural of codex, meaning ancient bound manuscripts or formally compiled volumes.","zh":"Codices 是 codex 的复数，常指古代装订成册的手抄本，也可指正式汇编成卷的书册。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of codex; ancient handwritten books/manuscripts, especially bound volumes from the time before printing","zh":"codex 的复数；（尤指印刷术出现前的）古代手抄本/写本，装订成册的书"},"examples":[{"en":"The library preserves several medieval codices in climate-controlled cases.","zh":"这家图书馆在恒温展柜中保存着几部中世纪写本。"},{"en":"Scholars compared the codices to reconstruct the original text.","zh":"学者们对比多部写本，以重建原始文本。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of codex; books in a series or authoritatively compiled volumes (formal/academic use)","zh":"codex 的复数；（较正式/学术用法）一套成书的卷册，或权威汇编的卷本"},"examples":[{"en":"The museum catalog describes the codices as part of a larger collection.","zh":"博物馆目录将这些卷册描述为更大馆藏的一部分。"}]}],"synonyms":["manuscripts","handwritten books","volumes","texts","scrolls (contrast)"],"phonetic":"/ˈkoʊdɪˌsiːz/","extraExplanation":["“Codex”（单数）来自拉丁语，原本指“木块/木板”，后来引申为“用木板作封面、把纸页或羊皮纸装订在一起的书”。它与早期常见的卷轴（scroll）相对，是现代“书本形态”的重要前身。","复数写作 codices（也可见较少用的 codexes）。在西方古典与中世纪研究中，codices 常特指珍贵的手抄本，例如玛雅或阿兹特克的图画写本也常被称为 codices。"]}
{"word":"codicil","summary":{"en":"A codicil is a legal add-on that changes an existing will.","zh":"codicil 指对现有遗嘱进行修改的法律补充文件。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A legal document that makes a small change (an addition, deletion, or amendment) to an existing will.","zh":"（法律）遗嘱补充条款；用于对原遗嘱作小幅修改（增补、删改或修正）的文件。"},"examples":[{"en":"She wrote a codicil to add her new grandchild as a beneficiary.","zh":"她写了一份遗嘱补充条款，把新出生的孙子/孙女加入受益人名单。"},{"en":"The lawyer advised them to use a codicil instead of writing a whole new will.","zh":"律师建议他们用遗嘱补充条款，而不是重写整份遗嘱。"},{"en":"After the divorce, he signed a codicil removing his ex-spouse from the will.","zh":"离婚后，他签署补充条款，将前配偶从遗嘱中移除。"}]}],"synonyms":["amendment","addition","supplement","appendix"],"phonetic":"/ˈkɑdəsɪl/","extraExplanation":["“codicil”常用于遗嘱与遗产规划语境。一般用于改动较小的情况；如果改动很多，通常会选择重立新遗嘱。","词源来自拉丁语 *codicillus*（意为“小册子/小书”），后来用于指对正式文件（尤其遗嘱）的补充。","在文学或正式写作中，也可引申为“附录/补记/补充说明”，但这种用法不如法律意义常见。"]}
{"word":"codicil-related","summary":{"en":"“Codicil-related” means connected with a codicil, a legal add-on or change to a will.","zh":"“Codicil-related”指与遗嘱附录有关，即用于补充或修改遗嘱的法律文件相关内容。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to a codicil (a legal document that adds to or changes a will).","zh":"与遗嘱附录（codicil：用于补充或修改遗嘱的法律文件）有关的。"},"examples":[{"en":"The lawyer prepared several codicil-related documents to update the will.","zh":"律师准备了几份与遗嘱附录相关的文件，用来更新遗嘱。"},{"en":"Please gather any codicil-related paperwork before the meeting.","zh":"开会前请把所有与遗嘱附录相关的材料整理好。"}]}],"synonyms":["codicil-related matter","codicil-associated","related to a codicil","will-amendment-related"],"phonetic":"/ˈkɑdəsəl rɪˌleɪtɪd/","extraExplanation":["“codicil”常用于英美法律语境，指对“will（遗嘱）”进行小范围修改或补充的正式文件；“codicil-related”多见于法律文书、律师沟通或档案分类中。写作中也可用更常见的表达，如 “related to a codicil” 或 “codicil concerning …”。"]}
{"word":"codicilic","summary":{"en":"Codicilic means “related to a codicil,” a formal written change or addition to a will.","zh":"codicilic 指“与遗嘱附录有关的”，即对遗嘱作正式书面补充或修改的文件。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a codicil (an official written change or addition to a will).","zh":"与遗嘱附录（对遗嘱作正式书面修改或补充的文件）有关的；遗嘱附录的。"},"examples":[{"en":"The lawyer prepared a codicilic document to update the will.","zh":"律师准备了一份遗嘱附录文件，用来更新遗嘱内容。"},{"en":"They signed a codicilic amendment after the birth of their child.","zh":"孩子出生后，他们签署了一份遗嘱附录修正文件。"}]}],"synonyms":["codicillary","related to a codicil","amending"],"phonetic":"/ˌkɑdɪˈsɪlɪk/","extraExplanation":["“codicilic”来自“codicil（遗嘱附录）”。在英美法律语境中，codicil是对遗嘱进行补充或修改的正式文件，通常需要满足与遗嘱类似的签署与见证要求。日常英语里更常见的是“codicil / codicils”，而“codicilic”较偏法律书面用语。"]}
{"word":"codicillary","summary":{"en":"Codicillary means “related to a codicil,” a legal add-on that changes or adds to a will.","zh":"Codicillary 指“与遗嘱附录有关的”，即对遗嘱进行补充或修改的法律附加文件。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Law) relating to a codicil (a legal document that changes or adds to a will).","zh":"（法律）与遗嘱附录有关的；与对遗嘱进行补充或修改的法律文件有关的。"},"examples":[{"en":"The lawyer prepared a codicillary document to update the will.","zh":"律师准备了一份与遗嘱附录相关的文件，用来更新遗嘱。"},{"en":"Any codicillary changes must be signed and witnessed to be valid.","zh":"任何对遗嘱的附录性修改都必须签署并有见证人见证，才具有法律效力。"}]}],"synonyms":["codicil-related","supplementary (legal context)"],"phonetic":"/ˌkɑːdəˈsɪləri/","extraExplanation":["“codicillary”常见于法律英语，通常修饰 change / clause / document / provision（修改/条款/文件/规定）。","它来自“codicil”（遗嘱附录）。在英美法传统中，codicil 是对原遗嘱进行小幅补充或更正的正式文件；若改动较大，往往会重新订立一份新遗嘱，而不是只做附录。"]}
{"word":"codicils","summary":{"en":"Codicils are legal additions or changes to a will (and sometimes, more generally, added clauses to a document).","zh":"codicils 指遗嘱的补遗（对遗嘱的补充或修改）；也可泛指文件中的补充条款。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A legal document that adds to, changes, or clarifies a will after the will has been signed.","zh":"（遗嘱的）附录；补遗（在遗嘱签署后，用来补充、修改或澄清遗嘱内容的法律文件）。"},"examples":[{"en":"She added a codicil to her will to leave her jewelry to her niece.","zh":"她在遗嘱中加了一份补遗，把珠宝留给外甥女。"},{"en":"The lawyer prepared two codicils to update the will after the client got married.","zh":"客户结婚后，律师准备了两份补遗来更新遗嘱。"},{"en":"The court reviewed the will and its codicils together.","zh":"法院将遗嘱及其补遗一并审查。"}]},{"partOfSpeech":"n.","definition":{"en":"In a broader sense, an additional note or clause attached to an existing document or agreement.","zh":"（广义）附加条款；补充说明（附在既有文件或协议后的内容）。"},"examples":[{"en":"There was a short codicil at the end of the contract about late fees.","zh":"合同末尾有一条关于逾期费用的简短补充条款。"},{"en":"The policy includes a codicil explaining exceptions.","zh":"该政策包含一段补充说明，解释例外情况。"}]}],"synonyms":["amendment","addendum","supplement","appendix"],"phonetic":"/ˈkɑdəˌsɪlz/","extraExplanation":["“Codicil”是遗嘱法里的常见词：它不是重新写一份新遗嘱，而是在原遗嘱基础上做小幅修改或补充。通常需要满足与遗嘱相似的签署/见证要求；若频繁修改，实务中也可能建议直接重立遗嘱以避免冲突与解释困难。"]}
{"word":"codicological","summary":{"en":"“Codicological” means “related to the physical study of manuscripts and how they were made and used.”","zh":"“codicological”意为“与抄本学有关的；研究手稿的物质形态及其制作、流传与使用方式的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to codicology—the study of handwritten books (manuscripts) as physical objects, including their materials, structure, and history of production and use.","zh":"与“手稿学/抄本学（codicology）”有关的——研究手写书（手稿）作为“物质对象”的学科，关注其材料、装订结构以及制作与使用历史。"},"examples":[{"en":"The researcher presented a codicological description of the manuscript’s binding and paper.","zh":"研究者对这份手稿的装订和纸张做了抄本学（codicological）描述。"},{"en":"Codicological evidence suggests the pages were rearranged in the 15th century.","zh":"抄本学证据表明这些页面在15世纪被重新编排过。"},{"en":"Her codicological analysis focused on ink, stitching, and page size.","zh":"她的抄本学分析聚焦于墨水、缝线和页面尺寸。"}]}],"synonyms":["manuscript-related","codicology-based","book-historical"],"phonetic":"/ˌkoʊdɪkəˈlɑːdʒɪkəl/","extraExplanation":["“codicological”来自“codex（古代装订成册的书）”。在中世纪研究与文献学里很常见。它通常和“paleographical（古文字学的，侧重字形与书写风格）”相区分：codicological 更关注书作为“物体”的构造与制作过程，比如纸张/羊皮纸、折页结构（quires/signatures）、装订与修补痕迹等。"]}
{"word":"codicology","summary":{"en":"Codicology is the study of manuscripts and books as physical objects—materials, structure, production, and history of use.","zh":"Codicology 指研究抄本与书作为实体物件的学科，关注材料、结构、制作过程与使用/保存历史。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The academic study of books as physical objects, especially handwritten manuscripts—how they were made, assembled, used, and preserved (e.g., parchment, ink, binding, page layout, and later repairs).","zh":"书籍形态学／抄本学：把书作为“实体物件”来研究的学科，尤指手写抄本；研究其制作、装订与结构、使用痕迹与保存修复（如羊皮纸、墨水、装帧、版面与后期修补）。"},"examples":[{"en":"Her dissertation in codicology analyzed the binding and page layout of medieval manuscripts.","zh":"她的论文以书籍形态学方法分析了中世纪抄本的装帧与版面布局。"},{"en":"Codicology can reveal when a manuscript was altered by studying ink, stitching, and wear marks.","zh":"书籍形态学会通过墨水、缝线和磨损痕迹来揭示抄本何时被改动过。"}]}],"synonyms":["manuscript studies","book history","material bibliography"],"phonetic":"/ˌkɑːdɪˈkɑːlədʒi/","extraExplanation":["词源：来自拉丁语 *codex*（“书册、写本”）+ *-logy*（“……学”）。常与 *paleography*（古文字学：辨读与分析字迹/书写风格）并用；两者相关但关注点不同：codicology 更看重“书作为物件”的材料与结构，paleography 更看重“字怎么写”。","使用场景：主要见于学术语境（历史、手稿研究、图书馆与档案、博物馆策展）。日常英语很少用，写作中可用 “the study of manuscripts as physical objects” 来释义。","相关表达：*manuscript studies*（手稿研究，较泛）、*book history*（书籍史）、*materiality of the book*（书的物质性）。"]}
{"word":"codictatorship","summary":{"en":"A codictatorship is a joint dictatorship where two or more rulers share unchecked power.","zh":"codictatorship 指两人或多人共同掌握不受制衡的独裁权力的统治形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a system of government in which two (or more) people share dictatorial power; a joint dictatorship.","zh":"由两人（或多人）共同掌握独裁权力的政体；共同独裁（统治）。"},"examples":[{"en":"After the coup, the country was ruled by a codictatorship of two generals.","zh":"政变后，这个国家由两位将军实行共同独裁统治。"},{"en":"Some analysts described the arrangement as a codictatorship rather than a true coalition.","zh":"一些分析人士认为这种安排更像共同独裁，而不是真正的联合政府。"}]}],"synonyms":["co-dictatorship","joint dictatorship","dual dictatorship","shared dictatorship"],"phonetic":"/ˌkoʊˈdɪkteɪtərˌʃɪp/","extraExplanation":["“codictatorship”不是特别常见的标准词，写作时也常见为“co-dictatorship”。它强调“权力分享”，但分享者之间并不受民主程序或法律制衡，仍然属于独裁体制。","可与“junta（军政府）”或“diarchy（两人共治）”对比：junta更强调军方集团统治；diarchy偏中性，未必是独裁；codictatorship明确指出“共同的独裁统治”。"]}
{"word":"Codie","summary":{"en":"Codie is mainly used as a personal name, often a variant spelling of Cody.","zh":"Codie 主要用作人名，常是 Cody 的变体拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a given name or nickname, usually a variant spelling of “Cody,” used for any gender but more common for boys","zh":"人名或昵称，通常是“Cody”的变体拼写；可用于任何性别，但更常见于男生"},"examples":[{"en":"Codie is my classmate in English class.","zh":"Codie 是我英语课的同学。"},{"en":"I saw Codie’s name on the team list.","zh":"我在队员名单上看到了 Codie 的名字。"}]}],"synonyms":["Cody","Kody"],"phonetic":"/ˈkoʊdi/","extraExplanation":["“Codie”多见于英语国家作为名字拼写变体，常与“Cody / Kody”互换使用。填表或订票时，最好按证件上的拼写来写。","如果你指的是某个品牌、账号名或特定人物（例如艺名、游戏ID），含义会取决于具体语境；你可以补充一句话，我可以帮你解释。"]}
{"word":"codifiability","summary":{"en":"Codifiability means how easily a concept can be put into words in a language.","zh":"Codifiability 指一个概念在某种语言中被“用词表达出来”的容易程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the degree to which an idea, meaning, or experience can be easily and clearly expressed (“coded”) in a language, often using a single word or a fixed expression","zh":"（语言学）可编码性：某个概念、意义或经验在一种语言中能否被轻松、清晰地表达（“编码”）的程度，常指是否能用一个词或固定表达直接说出来"},"examples":[{"en":"The codifiability of color terms differs across languages.","zh":"不同语言对颜色词的可编码性不同。"},{"en":"Because the emotion has low codifiability in English, people often describe it with a sentence instead of one word.","zh":"因为这种情绪在英语中的可编码性较低，人们常用一句话来描述，而不是用一个词。"},{"en":"Researchers measured codifiability by asking how quickly speakers could name the object.","zh":"研究者通过询问说话者能多快给物体命名来衡量可编码性。"}]}],"synonyms":["expressibility","nameability","lexicalizability"],"phonetic":"/ˌkoʊdəˌfaɪəˈbɪləti/","extraExplanation":["“codifiability”常见于语义学、心理语言学与跨文化研究中，常与“可说性/可表达性（expressibility）”一起讨论。通常不是日常口语词，更常出现在论文、研究报告里。","概念的可编码性并不代表“某种语言表达不了”；很多时候只是需要更长的说法、借用外来词，或用比喻来表达。"]}
{"word":"codifiable","summary":{"en":"Codifiable means something can be clearly written into an organized set of rules, laws, or instructions.","zh":"Codifiable 指某事物可以被清晰地写成一套有组织的规则、法律或指令。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be codified (put into a clear, organized system of rules or laws).","zh":"可被编纂的；可被系统化成清晰规则或法律的。"},"examples":[{"en":"Many workplace safety practices are codifiable into written procedures.","zh":"许多职场安全做法都可以编写成书面流程。"},{"en":"The committee focused on codifiable standards, not personal preferences.","zh":"委员会专注于可编纂的标准，而不是个人偏好。"}]},{"partOfSpeech":"adj.","definition":{"en":"Able to be turned into code or a formal set of instructions (often in computing or logic).","zh":"可被写成代码或形式化指令的（常用于计算机或逻辑语境）。"},"examples":[{"en":"If the steps are codifiable, we can automate the task.","zh":"如果这些步骤可被写成代码，我们就能把任务自动化。"},{"en":"Not every human judgment is codifiable for an AI system.","zh":"并非每一种人类判断都能被AI系统形式化编码。"}]}],"synonyms":["able to be codified","systematizable","formalizable","standardizable"],"phonetic":"/ˈkoʊdɪˌfaɪəbəl/","extraExplanation":["“codifiable”来自动词“codify”（编纂、把规则成文化），常见于法律、政策、组织管理与软件工程等语境。它强调“可以被清楚写下来并统一执行”，与“难以用明确规则表达”的情形形成对比。"]}
{"word":"codification","summary":{"en":"Codification means organizing laws, rules, or information into a clear system or code; it can also refer to standardizing a language or encoding data.","zh":"Codification 指把法律、规则或信息整理成清晰系统的规范/法典；也可指语言的规范化或数据的编码。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of organizing laws, rules, or information into a clear, systematic code","zh":"把法律、规则或信息系统化、整理成“法典/规范/编码体系”的过程"},"examples":[{"en":"The codification of traffic laws made the rules easier for drivers to understand.","zh":"交通法规的法典化让司机更容易理解规则。"},{"en":"Many countries began the codification of civil law in the 19th century.","zh":"许多国家在19世纪开始对民法进行法典编纂。"}]},{"partOfSpeech":"n.","definition":{"en":"(linguistics) the process of standardizing a language—especially its spelling, grammar, and usage—often through dictionaries and grammar books","zh":"（语言学）对语言进行规范化的过程，尤其是拼写、语法和用法，常通过词典和语法书来确立标准"},"examples":[{"en":"The codification of English spelling was influenced by early dictionaries.","zh":"英语拼写的规范化受到早期词典的影响。"},{"en":"Language codification can support education, but it may also disadvantage regional dialects.","zh":"语言规范化有助于教育，但也可能让方言处于不利地位。"}]},{"partOfSpeech":"n.","definition":{"en":"(computing) the act of encoding information into a specific format or system; coding","zh":"（计算机）把信息编码成某种特定格式或体系的行为；编码"},"examples":[{"en":"The codification of the data allows it to be stored and searched efficiently.","zh":"对数据进行编码使其能够高效存储和检索。"}]}],"synonyms":["systematization","compilation","standardization","encoding"],"phonetic":"/ˌkɑː.də.fəˈkeɪ.ʃən/","extraExplanation":["词根提示：codification 来自 code（法典/规范/编码）+ -fication（“使……成为/形成……的过程”）。在法律语境中常见 collocations 有 legal codification（法律法典化）、the codification of civil/criminal law（民法/刑法的编纂）。","文化/历史背景：欧洲大陆法系（civil law tradition）强调将法律编成系统的法典，例如《拿破仑法典》（Napoleonic Code），因此“codification”在法律史讨论中出现频率很高。","相关词：codify（v. 编纂；把……系统化）、code（n. 法典；代码）、coding/encoding（n. 编码）。注意 codification 与 classification（分类）不同：classification 是“分门别类”，codification 更强调“形成统一标准/条文体系”。"]}
{"word":"codifications","summary":{"en":"“Codifications” means multiple processes of codifying or multiple written codes produced by codifying, often in legal contexts.","zh":"“codifications”指多次/多种“编纂”过程，或编纂后形成的多套成文法典/规范文本，常见于法律语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) The act or process of arranging rules, laws, or information into a systematic code or set of written rules.","zh":"（复数）将规则、法律或信息整理、编纂成系统性“法典/规范”的过程或行为。"},"examples":[{"en":"The committee worked for years on the codifications of national tax laws.","zh":"该委员会花了多年时间编纂国家税法体系。"},{"en":"Different codifications of the same tradition can vary by region.","zh":"同一传统的不同编纂版本可能因地区而异。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) The written codes or official versions that result from codifying, especially collections of laws.","zh":"（复数）编纂后形成的成文“法典/规范文本”，尤指法律汇编。"},"examples":[{"en":"The library holds several codifications of civil law from the 19th century.","zh":"图书馆收藏了几套19世纪的民法法典汇编。"},{"en":"Lawyers compared the codifications to see how the rules changed over time.","zh":"律师们对比这些法典版本，以了解规则如何随时间变化。"}]}],"synonyms":["codes","compilations","systematizations","collections (of laws)","recodifications"],"phonetic":"/ˌkɑːdɪfɪˈkeɪʃənz/","extraExplanation":["“codification”常见于法律与制度语境：把分散的规定整理成结构清晰、便于引用与执行的“法典/规范”。例如历史上著名的《拿破仑法典》（Napoleonic Code）就是典型的法律编纂成果。","词形方面：codifications 是 codification 的复数形式。日常写作中如果你指“这个过程”，更常用单数 codification；如果你指“多套法典/多个版本/多次编纂成果”，才常用复数 codifications。"]}
{"word":"codified","summary":{"en":"Codified means officially written down and organized into a formal system of rules or laws.","zh":"Codified 指把规则或法律正式写成明文并系统化、制度化。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Written down and organized into a clear, official system (such as laws, rules, or standards).","zh":"被编纂成明文并系统化的（如法律、规则或标准）。"},"examples":[{"en":"Many countries have codified labor laws to protect workers.","zh":"许多国家把劳动法编纂成明文来保护工人。"},{"en":"The company codified its safety rules in a handbook.","zh":"公司把安全规定编成了员工手册。"}]},{"partOfSpeech":"v.","definition":{"en":"To put something into a formal written code or set of rules; to systematically arrange and record.","zh":"把某事编成正式的成文法规/规则；系统整理并记录。"},"examples":[{"en":"In the 19th century, some governments codified local customs into national law.","zh":"在19世纪，一些政府把地方习俗编纂成国家法律。"},{"en":"They codified the procedures so new staff could learn them quickly.","zh":"他们把流程规范成文，好让新员工能更快学会。"}]}],"synonyms":["formalized","systematized","standardized","written into law"],"phonetic":"/ˈkoʊdɪˌfaɪd/","extraExplanation":["“codified”来自“code（法典/编码）”。在日常英语里，它常出现在法律与制度语境：codified law（成文法）对比 common law（判例法/普通法传统），后者更多依赖法院判决逐步形成规则。","也常见于管理与教育场景：codify best practices（把最佳实践制度化/标准化）。注意它强调“写下来并形成体系”，不仅仅是“记录”。"]}
{"word":"codifier","summary":{"en":"A codifier is someone (or something like a dictionary) that turns rules or practices into an organized written code or standard.","zh":"codifier 指把规则或惯例整理成成文体系（法典/规范/标准）的人或工具（如词典、语法书）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or group that organizes rules, laws, or information into a clear written system (a code).","zh":"把规则、法律或信息整理并写成清晰体系（法典/规范）的人或机构；编纂者。"},"examples":[{"en":"The committee acted as the codifier of the school’s new rules.","zh":"该委员会充当了学校新规章的编纂者。"},{"en":"In many countries, lawmakers are also codifiers when they turn practices into written law.","zh":"在许多国家，立法者把惯例写成成文法时，也是在做编纂工作。"}]},{"partOfSpeech":"n.","definition":{"en":"In language and grammar, a person or book that sets down standard rules for how a language should be used.","zh":"（语言/语法）制定或记录语言使用规范的人或著作；规范制定者。"},"examples":[{"en":"That dictionary became a codifier of modern spelling and usage.","zh":"那本词典成了现代拼写和用法的规范制定者。"},{"en":"Early grammarians were important codifiers of English grammar.","zh":"早期语法学家是英语语法的重要规范制定者。"}]}],"synonyms":["compiler","standardizer","rule-maker","lawgiver"],"phonetic":"/ˈkoʊdəˌfaɪər/","extraExplanation":["“codifier”来自动词“codify”（把……编成法典/规范化）。它常用于法律、政策、标准制定等语境；在语言学里也常指“把语言规则写下来并推广为标准”的人或工具书。"]}
{"word":"codifiers","summary":{"en":"“Codifiers” are people who organize rules—often laws or language—into an official written system.","zh":"“codifiers”指把规则（常见为法律或语言）整理并编纂成正式成文体系的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who codify something—especially those who organize laws, rules, or language into a clear, written system (plural of “codifier”).","zh":"把某些内容“编纂成体系的人”（“codifier”的复数），尤指把法律、规则或语言整理成清晰的成文规范的人。"},"examples":[{"en":"Legal codifiers helped organize scattered rules into a single civil code.","zh":"法律编纂者把零散的规则整理成一部统一的民法典。"},{"en":"Dictionary makers can be seen as codifiers of spelling and usage.","zh":"词典编写者可以被视为拼写和用法的规范制定者。"},{"en":"Some codifiers describe how people speak; others try to tell people how they should speak.","zh":"有些规范者记录人们如何说话；另一些则试图规定人们应该如何说话。"}]}],"synonyms":["compilers","editors","lawmakers","standardizers"],"phonetic":"ˈkoʊdəˌfaɪər","extraExplanation":["“codifiers”是复数形式；单数是“codifier”。常见搭配有：legal codifiers（法律编纂者）、language codifiers（语言规范制定者/整理者）。","在语言学语境中，codifiers常与“descriptive（描述性）”和“prescriptive（规定性）”对比：前者记录真实用法，后者强调应当如何用。"]}
{"word":"codifies","summary":{"en":"“Codifies” means formally organizing rules or practices into a clear written system, or officially writing rules into law.","zh":"“Codifies”表示把规则/做法正式整理成清晰的成文规范，或将规定正式编入法律。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to arrange rules, ideas, or practices into a clear system (a “code”), often written down","zh":"把规则、理念或做法整理并系统化成清晰的“规范/准则”（通常形成书面形式）"},"examples":[{"en":"The company codifies its customer-service standards in a handbook.","zh":"公司把客户服务标准编写成一本手册。"},{"en":"Over time, the team codifies what works into a step-by-step process.","zh":"随着时间推移，团队把有效的方法整理成分步骤的流程。"}]},{"partOfSpeech":"vt.","definition":{"en":"to put laws or regulations into an official written form (to make them part of a legal code)","zh":"把法律或规章正式汇编成成文法典（使其成为法典的一部分）"},"examples":[{"en":"The government codifies new safety rules after the investigation.","zh":"调查之后，政府把新的安全规定正式编入法规。"},{"en":"The court follows principles that the legislature later codifies into law.","zh":"法院遵循的原则后来被立法机关写入法律。"}]}],"synonyms":["formalize","systematize","standardize","compile","set down","legislate"],"phonetic":"/ˈkoʊdəˌfaɪz/","extraExplanation":["“codifies”是动词“codify”的第三人称单数（he/she/it codifies）。常见于较正式的语境（商业制度、政策文件、法律条文）。","词源上可理解为 code（规范/法典）+ -ify（使成为），核心含义是“把零散的东西变成一套明确的规则”。"]}
{"word":"codify","summary":{"en":"Codify means to put rules or ideas into an organized written system, or to encode information into a code.","zh":"Codify 指把规则或思想整理成系统的成文规范，或把信息进行编码处理。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to arrange ideas, rules, or laws into a clear, organized system (often written down)","zh":"把思想、规则或法律整理并系统化（通常写成文字）"},"examples":[{"en":"The company codified its workplace rules into an employee handbook.","zh":"公司把工作场所的规定整理成了一本员工手册。"},{"en":"Over time, these customs were codified into formal laws.","zh":"随着时间推移，这些习俗被系统化并写入正式法律。"}]},{"partOfSpeech":"vt.","definition":{"en":"to express something in a code or symbolic form","zh":"用代码或符号形式表达（编码）"},"examples":[{"en":"Researchers codified the survey answers so they could analyze the data quickly.","zh":"研究人员把问卷答案编码处理，以便快速分析数据。"},{"en":"The app codifies user actions into simple categories.","zh":"这个应用把用户行为编码成简单的类别。"}]}],"synonyms":["systematize","formalize","compile","encode"],"phonetic":"/ˈkɑːdəˌfaɪ/","extraExplanation":["“codify”常用于法律、制度、标准等语境，强调“把零散的规则变成系统的成文规范”。名词是“codification”（法典编纂/系统化）。","词根来自“code（法典/规范/代码）”。在现代语境里，除了“法律成文化”，也常见于数据处理领域，表示“对信息进行编码分类”。"]}
{"word":"codifying","summary":{"en":"“Codifying” means formally organizing rules or ideas into an official written code (and sometimes writing them into computer code).","zh":"“codifying”指把规则/理念正式整理并编纂成成文规范（有时也指把内容写成计算机代码）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"putting laws, rules, or ideas into a clear, organized written system (a “code”); formally arranging and recording them","zh":"把法律、规则或理念整理成清晰、有体系的书面“法典/规范”；将其正式编纂、成文化"},"examples":[{"en":"The government is codifying the new labor rules so employers can follow one standard set of regulations.","zh":"政府正在把新的劳动规定加以编纂成文，以便雇主遵循一套统一的规范。"},{"en":"The team is codifying best practices into a handbook for new employees.","zh":"团队正在把最佳实践整理成册，写进新员工手册。"}]},{"partOfSpeech":"v.","definition":{"en":"translating information or instructions into computer code; writing code to make something work","zh":"把信息或指令转化为计算机代码；编写代码以实现功能"},"examples":[{"en":"She is codifying the algorithm in Python for the first prototype.","zh":"她正在用 Python 把该算法写成代码，用于第一个原型。"},{"en":"Engineers are codifying the safety checks into the system’s startup process.","zh":"工程师正在把安全检查写进系统的启动流程中。"}]}],"synonyms":["formalizing","systematizing","organizing","standardizing","writing into law","documenting","encoding (in programming context)"],"phonetic":"/ˈkoʊdəˌfaɪɪŋ/","extraExplanation":["“codify”的核心是把原本分散、口头、零散或不统一的内容，整理成统一、可查、可执行的书面体系；因此在法律语境里常见（如把判例/规定汇编成法典），在组织管理里也常见（把“潜规则/经验”写成制度或流程）。","词源上与“code（法典/密码/代码）”同源；注意它不是“加密/编码（encrypt/encode）”，而更强调“规范化、成文化”。"]}
{"word":"codilla","summary":{"en":"“Codilla” is not a standard English word; it’s likely a misspelling (often of “codicil”) or a proper name.","zh":"“codilla” 不是标准英语词；多半是拼写错误（常见目标词为 “codicil”）或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most often seen as a misspelling or a name (e.g., a surname or brand). If you meant a real English vocabulary item, the closest common word is “codicil” (an addition or change to a will).","zh":"不是标准英语词；更常见于拼写错误或专有名词（如姓氏/品牌）。如果你想查常见英语词，最接近的通常是 “codicil”（遗嘱的补充或修改条款）。"},"examples":[{"en":"I couldn’t find “codilla” in a standard dictionary—did you mean “codicil”?","zh":"我在常见词典里找不到 “codilla”——你是不是想写 “codicil”？"},{"en":"Please double-check the spelling of “codilla” in the document.","zh":"请在文件里再核对一下 “codilla” 的拼写。"}]}],"phonetic":"/koʊˈdɪlə/","extraExplanation":["“codicil”（常被误写成类似 codilla 的形式）读音接近，意思是“对遗嘱的补充/修订”。常见搭配：add a codicil to a will（给遗嘱加补充条款）。","如果你是从人名、地名、品牌名里看到 “Codilla”，它可能是专有名词，用法取决于具体语境。你可以把原句发我，我能帮你判断。"]}
{"word":"codille","summary":{"en":"Codille is a rare, old card-game term (from *ombre*) meaning a loss/penalty for failing to win enough tricks.","zh":"Codille 是一个罕见的旧纸牌术语（源自 *ombre*），指因未赢到足够墩数而造成的失败或罚分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Card games, rare/old-fashioned) In the historical card game *ombre*, a loss/penalty when the player (declarer) fails to win enough tricks.","zh":"（纸牌游戏，罕见/旧用）在古老的纸牌游戏 *ombre*（翁布雷）中，指庄家/叫牌者未能赢到足够墩数而导致的失败或罚分。"},"examples":[{"en":"He played aggressively, but ended the hand in a codille.","zh":"他打得很激进，但这一局以一次 codille（失败/罚分）收场。"},{"en":"In *ombre*, avoiding a codille was sometimes more important than taking risks.","zh":"在 *ombre* 里，避免 codille（失败/罚分）有时比冒险更重要。"}]},{"partOfSpeech":"n.","definition":{"en":"(Card games, rare) A card or situation that brings about that loss/penalty in *ombre*.","zh":"（纸牌游戏，罕见）在 *ombre* 中导致上述失败/罚分的那张牌或局面。"},"examples":[{"en":"One unlucky trick turned into a codille.","zh":"一个不走运的墩次演变成了 codille（导致罚分的局面）。"}]}],"synonyms":["(contextual) penalty","(contextual) defeat"],"phonetic":"/koʊˈdiːl/","extraExplanation":["“codille”在现代英语中非常少见，主要出现在讨论欧洲历史纸牌游戏（尤其是 *ombre*）的文本里。","它常被误看成更常见的词：**codicil**（遗嘱附录）或 **coddle**（溺爱/娇养）。如果你想查的是其中一个，告诉我上下文句子我可以帮你确认。"]}
{"word":"coding","summary":{"en":"Coding most commonly means writing computer programs; it can also mean labeling/classifying information using codes.","zh":"Coding 最常指写程序/编程；也可指用编码对信息进行标注与分类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity of writing instructions (code) for a computer, app, or website; programming","zh":"编写计算机指令（代码）的活动；编程"},"examples":[{"en":"She learned coding to build a simple website.","zh":"她学编程来做一个简单的网站。"},{"en":"Coding takes practice, not just reading.","zh":"写代码需要练习，不只是阅读。"}]},{"partOfSpeech":"v.","definition":{"en":"writing computer code; creating or editing programs","zh":"写代码；编写或修改程序"},"examples":[{"en":"I’m coding a small game in Python.","zh":"我正在用 Python 写一个小游戏。"},{"en":"He stayed up late coding and fixing bugs.","zh":"他熬夜写代码、修复漏洞。"}]},{"partOfSpeech":"n.","definition":{"en":"the process of assigning a code (numbers/letters) to classify or label information","zh":"给信息编号/编码以便分类或标注的过程"},"examples":[{"en":"The researcher is coding interview answers into categories.","zh":"研究者正在把访谈答案编码成不同类别。"}]}],"synonyms":["programming","writing code","software development","encoding","classification"],"phonetic":"/ˈkoʊdɪŋ/","extraExplanation":["日常口语里，coding 通常指“写程序/学编程”。在学术研究或数据分析中，coding 也常指“把文字资料按主题分类并标记”（例如质性研究的访谈资料编码）。","在招聘或学习语境中，programming 更正式；coding 更口语、更强调“动手写代码”这件事。"]}
{"word":"codings","summary":{"en":"“Codings” is the plural of “coding,” used for multiple code implementations or multiple research classification/labeling results.","zh":"“codings”是“coding”的复数，用于指多套代码实现，或研究中多份分类/标注结果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) pieces or instances of computer programming code; different code implementations.","zh":"（复数）多段/多份程序代码；不同的编码实现。"},"examples":[{"en":"The app contains several codings for the same feature on different platforms.","zh":"这个应用在不同平台上为同一个功能包含了好几套代码实现。"},{"en":"We reviewed the codings and removed repeated logic.","zh":"我们检查了这些代码实现，并删除了重复逻辑。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) classification or labeling decisions in research (e.g., marking themes in interview data).","zh":"（复数）研究中的分类/标注结果（例如给访谈资料标主题）。"},"examples":[{"en":"Two researchers compared their codings to check reliability.","zh":"两位研究者对比各自的标注结果，以检验一致性。"},{"en":"The final codings showed three main themes.","zh":"最终的编码结果显示出三个主要主题。"}]}],"synonyms":["codes","implementations","programs","coding schemes","labels","classifications"],"phonetic":"/ˈkoʊdɪŋz/","extraExplanation":["“coding”更常见、也更自然，通常作不可数名词（I’m learning coding. 我在学编程）。","“codings”多用于强调“有多套/多次/多种编码或标注结果”，常见于技术讨论（不同实现）或学术研究（多份标注）。","如果你想表达“编码方式/编码方案”，也常用“coding schemes / coding systems”。"]}
{"word":"codiniac","summary":{"en":"“Codiniac” is not a standard English word; it’s likely a misspelling (often of “Cognac” or “cardiac”).","zh":"“codiniac” 不是标准英文单词，可能是拼写错误（常见是 “Cognac” 或 “cardiac”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a name/username. Common possibilities include “Cognac” (a type of brandy) or “cardiac” (related to the heart).","zh":"不是标准英文单词，更可能是拼写错误或专有名词/用户名。常见的可能目标包括 “Cognac”（一种白兰地）或 “cardiac”（与心脏有关的）。"},"examples":[{"en":"I couldn’t find “codiniac” in a dictionary—did you mean “Cognac”?","zh":"我在词典里找不到 “codiniac”——你是不是想写 “Cognac”？"},{"en":"If you meant “cardiac,” it describes something related to the heart.","zh":"如果你想写的是 “cardiac”，它表示“与心脏有关的”。"}]}],"phonetic":"ˈkoʊnjæk","extraExplanation":["“Cognac” 是法国干邑地区出产的一种白兰地，在英文里常作为酒类名词出现，拼写是 C-o-g-n-a-c。","如果你能告诉我它出现的句子或语境（比如一整句话、截图、或你想表达的意思），我可以更准确判断你想要的单词并给出完整释义与用法。"]}
{"word":"codirect","summary":{"en":"Codirect means to direct or manage something together with another person or people.","zh":"codirect 指与他人共同导演或共同指导/管理某事。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To direct (a project, performance, film, etc.) together with one or more other people; to share the role of director.","zh":"（与他人）共同导演；联合指导（项目、演出、电影等），共同承担导演职责。"},"examples":[{"en":"She will codirect the new documentary with an award-winning filmmaker.","zh":"她将与一位获奖电影人共同导演这部新纪录片。"},{"en":"Two teachers codirected the school play to help the students more effectively.","zh":"两位老师共同指导学校话剧，以便更有效地帮助学生。"},{"en":"He codirected the project, but the final artistic decisions were made by the lead director.","zh":"他共同指导了这个项目，但最终的艺术决定由总导演作出。"}]},{"partOfSpeech":"v.","definition":{"en":"To give direction or guidance jointly; to manage or steer something together with others.","zh":"共同指挥/引导；与他人一起管理或推动某事。"},"examples":[{"en":"The two managers codirect the team’s daily operations.","zh":"两位经理共同负责团队的日常运营。"},{"en":"A mentor and a professor codirected her research work.","zh":"一位导师和一位教授共同指导她的研究工作。"}]}],"synonyms":["co-direct","direct together","jointly direct","co-lead","co-manage"],"phonetic":"/ˌkoʊdəˈrɛkt/","extraExplanation":["“codirect”常写作“co-direct”（带连字符），尤其在电影、戏剧、项目管理语境中更常见；名词形式是“co-director”（联合导演）。","在片尾字幕或职位头衔里，“co-director / co-directed by”表示导演职责由多人共享，但具体分工可能不同（如一人负责演员调度，另一人负责镜头与剪辑风格）。"]}
{"word":"codirected","summary":{"en":"Codirected means “directed together by two or more people,” and it is also the past form of “codirect.”","zh":"Codirected 指“由两人或多人共同执导/共同指导”，也可作动词 codirect 的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"jointly directed by two or more people (often used for films, projects, or research).","zh":"由两人或多人共同执导/共同指导（常用于电影、项目或研究）。"},"examples":[{"en":"The documentary was codirected by two journalists.","zh":"这部纪录片由两位记者共同执导。"},{"en":"She codirected the research project with a colleague from another university.","zh":"她与另一所大学的同事共同指导了这个研究项目。"}]},{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of “codirect”: to direct something together with someone else.","zh":"“codirect”的过去式/过去分词：与他人共同执导/共同指导某事。"},"examples":[{"en":"They codirected the play last year.","zh":"他们去年共同执导了那部话剧。"},{"en":"The film was codirected by a veteran director and a newcomer.","zh":"这部电影由一位资深导演和一位新人导演共同执导。"}]}],"synonyms":["co-directed","jointly directed","directed collaboratively"],"phonetic":"/ˌkoʊdəˈrɛktɪd/","extraExplanation":["“co-”这个前缀表示“共同、一起”（如: coauthor 共同作者；cofounder 共同创办人）。因此 codirect/codirected 常见于正式语境（电影字幕、学术项目介绍、公司公告）。","在电影领域更常见的表达是 “co-directed / co-directed by …”（通常写成带连字符的 co-directed）。不带连字符的 codirected 也能用，但更少见。"]}
{"word":"codirecting","summary":{"en":"Codirecting (more commonly written co-directing) means sharing the job of directing with someone else.","zh":"codirecting（更常写作 co-directing）指与他人共同承担“执导/指挥/负责”的工作。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"working together with another person (or people) to direct a film, play, project, or organization; the act of sharing directing duties","zh":"与另一人（或多人）共同执导（电影、戏剧、项目或组织）；分担导演/指挥工作的行为"},"examples":[{"en":"She is co-directing the new documentary with her brother.","zh":"她正在和哥哥共同执导一部新纪录片。"},{"en":"They were co-directing the project, so they made big decisions together.","zh":"他们共同负责这个项目，所以重大决定一起做。"},{"en":"Co-directing can help combine different strengths, like writing and visual style.","zh":"共同执导可以把不同优势结合起来，比如编剧能力和视觉风格。"}]}],"synonyms":["co-leading","jointly directing","co-managing","co-heading"],"phonetic":"/ˌkoʊ dəˈrɛktɪŋ/","extraExplanation":["拼写上常见两种形式：co-directing（带连字符）和 codirecting（不带连字符）。在电影/戏剧领域里，带连字符更常见、更清晰。","语境上，“co-directing”最常指两位导演共同执导一部作品；有时也用于学术或机构中，表示共同担任“主任/负责人”（co-director）。"]}
{"word":"codirectional","summary":{"en":"Codirectional means “in the same direction,” mainly used in technical writing.","zh":"codirectional 指“同方向的”，主要用于技术或学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Going in the same direction; aligned in direction (often used in technical contexts such as physics, engineering, and math).","zh":"同方向的；方向一致的（常用于物理、工程、数学等技术语境）。"},"examples":[{"en":"The two forces are codirectional, so their effects add together.","zh":"这两个力是同方向的，所以它们的效应会相加。"},{"en":"Keep the current codirectional with the magnetic field in this setup.","zh":"在这个装置中，让电流与磁场保持同方向。"}]}],"synonyms":["in the same direction","aligned","parallel (same direction)","co-directional"],"phonetic":"/ˌkoʊdəˈrɛkʃənəl/","extraExplanation":["“codirectional”由前缀 co-（共同、一起）+ directional（方向的）组成，常见于学术与工程写作。日常英语里更常用同义表达，如 “in the same direction / aligned / parallel (and pointing the same way)”。注意：parallel 只表示“平行”，不一定强调“同向”（可能反向）。"]}
{"word":"codirector","summary":{"en":"A co-director is someone who shares the director role with another person.","zh":"co-director 指与他人共同担任导演/主管职位的人（联合导演）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who shares the job of directing a project, organization, or production (often a film) with one or more other directors.","zh":"与他人共同承担“导演/主管”职责的人；联合导演（常见于电影或项目管理）。"},"examples":[{"en":"She served as co-director of the documentary with her longtime collaborator.","zh":"她与长期合作伙伴共同担任这部纪录片的联合导演。"},{"en":"The program has two co-directors who make decisions together.","zh":"这个项目有两位联合主管，他们共同做决定。"}]}],"synonyms":["joint director","co-leader","co-head"],"phonetic":"ˌkoʊ dɪˈrɛktɚ","extraExplanation":["“co-”是前缀，表示“共同、联合”。因此 co-director 强调“职位由两人或多人共享”，通常权责相对对等。","拼写上常见 co-director（带连字符）或 codirector（不带连字符）；在正式写作中，co-director 更常见、更清晰。","不要与 assistant director（副导演/助理导演）混淆：assistant director 往往是协助执行与协调，不一定与 director 平级。"]}
{"word":"codirectors","summary":{"en":"“Codirectors” means people who share directing or leadership responsibilities together.","zh":"“codirectors”指共同承担导演或领导/管理职责的多人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"two or more people who share the job of directing a film, play, organization, project, or department together","zh":"（两人或多人）共同担任导演/主管/负责人，共同负责指导或管理某个作品、机构或项目"},"examples":[{"en":"The film’s codirectors split the work: one handled the actors, and the other focused on the visuals.","zh":"这部电影的联合导演分工合作：一位负责演员表演，另一位专注于画面风格。"},{"en":"The codirectors of the research program approved the final budget.","zh":"该研究项目的共同负责人批准了最终预算。"}]}],"synonyms":["co-directors","joint directors","co-leaders"],"phonetic":"/ˌkoʊdəˈrɛktərz/","extraExplanation":["拼写上常见三种形式：co-directors（最常见、最清晰）、co directors（较少见）、codirectors（不加连字符也可，但有时可读性稍差）。正式写作中多用 co-directors。","co- 这个前缀表示“共同、联合”，常见于 co-worker（同事）、coauthor（合著者）、copilot（副驾驶）等。"]}
{"word":"codirectorship","summary":{"en":"Codirectorship means two people share the director role and responsibilities.","zh":"Codirectorship 指两人共同担任主管/导演并分担责任的制度或职位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the position, role, or arrangement in which two people share the responsibilities of being directors (for example, in a company, organization, committee, or film).","zh":"（由两人共同担任）共同导演／共同主管的职位、角色或制度安排（例如在公司、机构、委员会或电影制作中）。"},"examples":[{"en":"The nonprofit created a codirectorship so that leadership could be shared.","zh":"这个非营利机构设立了共同主管制，让领导工作由两人分担。"},{"en":"Their codirectorship worked well because one focused on finance and the other on programs.","zh":"他们的共同主管制运作良好：一人负责财务，另一人负责项目。"},{"en":"After the founder stepped down, the board approved a codirectorship for the transition period.","zh":"创始人卸任后，董事会批准在过渡期实行共同主管制。"}]}],"synonyms":["co-leadership","joint directorship","shared leadership","co-director role"],"phonetic":"/ˌkoʊdəˈrɛktɚˌʃɪp/","extraExplanation":["“codirectorship”由前缀 co-（共同、合作）+ directorship（主管/导演职位）构成，常见于组织治理与管理语境，强调“权力与责任共享”，并不一定表示地位高低有差别。","与 film/TV 领域的“co-directing（共同执导）”相关，但“codirectorship”更常指一种正式的职位或制度（例如两位执行主任共同领导），而不只是一次合作行为。","写法上也可能见到带连字符的形式 “co-directorship”。"]}
{"word":"codirects","summary":{"en":"“Codirects” means “directs together with someone else,” usually used for films, plays, or projects.","zh":"“Codirects”表示“与他人共同执导/共同负责（某作品或项目）”，常用于电影、戏剧或项目。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to direct (a film, play, project, etc.) together with one or more other people; to share the job of director","zh":"与他人共同执导（电影、戏剧、项目等）；共同承担导演/负责人工作"},"examples":[{"en":"She codirects the documentary with her brother.","zh":"她和哥哥共同执导这部纪录片。"},{"en":"He codirects the school play, focusing on the actors while his partner handles lighting.","zh":"他共同执导学校话剧：他主要指导演员，而搭档负责灯光。"}]}],"synonyms":["co-direct","co-lead","jointly direct","collaborate on directing"],"phonetic":"/ˌkoʊdəˈrɛkts/","extraExplanation":["“codirects”通常是动词“co-direct”的第三人称单数形式（he/she/it codirects）。写法上常见两种：co-direct（更规范、清晰）与 codirect（较少见，偏合写）。在正式写作里多用连字符形式 co-direct / co-directs。"]}
{"word":"codiscoverer","summary":{"en":"A co-discoverer is someone who discovers something together with others and shares credit for the discovery.","zh":"co-discoverer 指与他人一起做出发现并共同分享发现功劳的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who discovers something together with someone else; one of the people who share credit for a discovery","zh":"与他人一起发现某事的人；共同发现者（共享发现功劳的人）"},"examples":[{"en":"She is recognized as the co-discoverer of the new species.","zh":"她被公认为这一新物种的共同发现者。"},{"en":"The paper lists Dr. Chen as a co-discoverer of the method.","zh":"论文将陈博士列为该方法的共同发现者。"},{"en":"As co-discoverers, they shared the prize and the responsibility for the findings.","zh":"作为共同发现者，他们分享了奖项，也共同承担研究结果的责任。"}]}],"synonyms":["joint discoverer","co-finder","co-inventor (when it’s an invention)"],"phonetic":"/ˌkoʊ dɪˈskʌvərər/","extraExplanation":["“codiscoverer”更常见的写法是 **co-discoverer**（带连字符）或 **co-discoverer** / **co-discoverers**。前缀 **co-** 表示“共同、一起”。","在学术与新闻语境里，“co-discoverer”常用于强调“发现的署名与功劳归属”，有时也隐含“谁先发现/谁贡献更大”的讨论背景。"]}
{"word":"codiscoverers","summary":{"en":"“Codiscoverers” means people who discover something together with others.","zh":"“codiscoverers”指与他人共同发现某事物的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who discover something together with another person or group; joint discoverers","zh":"与他人一起发现某事物的人；共同发现者"},"examples":[{"en":"Watson and Crick are often described as co-discoverers of the structure of DNA.","zh":"沃森和克里克常被称为DNA结构的共同发现者。"},{"en":"The paper lists three co-discoverers of the new species.","zh":"论文列出了三位该新物种的共同发现者。"}]}],"synonyms":["joint discoverers","collaborators (in discovery)","discoverers together"],"phonetic":"/ˌkoʊdɪˈskʌvərɚz/","extraExplanation":["“co-”是英语里很常见的前缀，意思是“共同、一起”。所以 co-discoverer = “一起发现的人”。常见类似构词：cofounder（共同创办者）、coworker（同事）、coauthor（合著者）。","写作中也常见两种拼写：co-discoverer（带连字符，更清晰）与 codiscoverer（不带连字符）。两者意思相同。"]}
{"word":"codisjunct","summary":{"en":"A rare logic term meaning one of the alternative parts in an “either…or…” statement, viewed alongside the other part(s).","zh":"一个较少见的逻辑学术语，指“要么……要么……”析取命题中的某一项（与另一项/其他项并列来看）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(logic, rare) A disjunct considered together with another disjunct in the same “either…or…” statement; one of the alternative parts of a disjunction.","zh":"（逻辑学，较少见）与另一个析取项一起被考虑的析取项；“要么……要么……”这类析取命题中的其中一个选项/部分。"},"examples":[{"en":"In the statement “Either it rains or it snows,” “it rains” is a codisjunct of “it snows.”","zh":"在“要么下雨，要么下雪”这句话里，“下雨”是“下雪”的一个 codisjunct（同析取项）。"},{"en":"If one codisjunct is true, the whole disjunction can still be true.","zh":"只要其中一个 codisjunct 为真，整个析取命题仍然可能为真。"}]},{"partOfSpeech":"adj.","definition":{"en":"(logic, rare) Being in an either–or relationship; mutually alternative within a disjunction.","zh":"（逻辑学，较少见）处在“二选一/要么……要么……”的关系中；在析取中互为备选的。"},"examples":[{"en":"The two clauses are codisjunct in this argument.","zh":"在这个论证中，这两个分句互为 codisjunct（同处一个析取关系）。"}]}],"synonyms":["disjunct","alternative","either-or option"],"phonetic":"/ˌkoʊdɪsˈdʒʌŋkt/","extraExplanation":["这个词非常少见，更多时候你会看到更常用的 disjunct（析取项）或 disjunction（析取/“或”）。如果你是在语言学里查词，disjunct 也可指“句子评注成分”（如 frankly, fortunately），但 codisjunct 通常还是出现在逻辑相关语境。","拼写上也常写作 co-disjunct（加连字符）。"]}
{"word":"codist","summary":{"en":"“codist” is not standard English; it’s usually an informal short form of “co-distributed,” or a field-specific label like “CoDist.”","zh":"“codist”不是标准英语词；通常是“co-distributed（共同分布）”的非正式缩写，或特定领域中的名称（如 CoDist）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Not a standard dictionary word) Used informally or in technical writing as a shortened form of “co-distributed,” meaning existing or occurring in the same areas/locations.","zh":"（非标准词典词汇）在非正式或专业写作中常作为“co-distributed（共同分布）”的缩写，指在相同或重叠的地区/位置出现或分布。"},"examples":[{"en":"These two species are codist across most of the coastal wetlands.","zh":"这两个物种在大多数沿海湿地区域共同分布。"},{"en":"The markers are codist with the disease trait in this population.","zh":"在该人群中，这些标记与疾病性状呈共同分布（或共同出现的分布模式）。"}]},{"partOfSpeech":"n.","definition":{"en":"(Computing/academic contexts, often written “CoDist”) A label/name for a method, metric, or tool related to “co-distance” or “co-distribution distance,” depending on the field.","zh":"（计算/学术语境，常写作“CoDist”）在不同领域中可作为某种方法、度量或工具的名称，含义可能与“co-distance（共距离）”或“co-distribution distance（共同分布距离）”相关，需结合上下文判断。"},"examples":[{"en":"We report results using the CoDist metric.","zh":"我们使用 CoDist 指标报告结果。"},{"en":"CoDist performed better than baseline methods on this dataset.","zh":"在该数据集上，CoDist 的表现优于基线方法。"}]}],"synonyms":["co-distributed","co-occurring","found together"],"phonetic":"/ˈkoʊ.dɪst/","extraExplanation":["“codist”在通用英语里并不常见，很多时候是作者自造的缩写（co- + dist）或特定项目/论文里的命名。最可靠的做法是查看它出现的句子或文献定义。","如果你是想表达“共同分布/共现”，更常见、更标准的写法是：co-distributed, co-occurring, found in the same areas。"]}
{"word":"codistillation","summary":{"en":"Codistillation is a process where two or more substances distill together, often used (with steam/water) to distill heat-sensitive or high-boiling compounds at lower temperatures.","zh":"共蒸馏是两种或多种物质一起被蒸出和收集的过程，常借助水/水蒸气在较低温度下蒸出高沸点或怕热分解的物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a distillation process in which two (or more) substances vaporize and are distilled together, often because they are mixed or their vapors combine during heating","zh":"（化学）共蒸馏：两种或多种物质在加热时一起汽化并共同被蒸出、收集的蒸馏过程"},"examples":[{"en":"The chemist used codistillation to remove the solvent along with a volatile impurity.","zh":"化学家用共蒸馏把溶剂和一种易挥发的杂质一起蒸出。"},{"en":"In codistillation, water can carry certain organic compounds over even when their boiling points are high.","zh":"在共蒸馏中，水即使在某些有机物沸点很高时，也能把它们一起带出。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially) a technique where an immiscible liquid (often water/steam) is distilled with another compound to lower the effective distillation temperature (steam codistillation)","zh":"（尤指）水/水蒸气与另一种不互溶的液体共同蒸馏，以降低实际蒸馏温度的技术（蒸汽共蒸馏）"},"examples":[{"en":"They purified the fragrance oil by steam codistillation to avoid thermal decomposition.","zh":"他们用蒸汽共蒸馏来纯化香精油，避免高温分解。"},{"en":"Codistillation is common when isolating essential oils from plant material.","zh":"从植物原料中分离精油时，共蒸馏很常见。"}]}],"synonyms":["co-distillation","steam distillation","co-distill (related verb)"],"phonetic":"/ˌkoʊˌdɪstəˈleɪʃən/","extraExplanation":["“codistillation”常写作“co-distillation”。它与“steam distillation（蒸汽蒸馏）”关系密切：当两种液体互不相溶时，总蒸气压为各自蒸气压之和，因此混合物可能在低于任一纯组分沸点的温度下沸腾，从而实现较温和的分离/提取。","共蒸馏也可能出现在“共沸（azeotrope）”相关的分离中：某些混合物会以固定组成一起蒸出，导致普通蒸馏难以进一步分离。"]}
{"word":"Codium","summary":{"en":"Codium is a genus of thick, spongy green seaweed, sometimes called “dead man’s fingers.”","zh":"Codium 是一种粗厚海绵状的海洋绿藻属，常被俗称为“死人手指”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of green seaweeds (algae) found in marine environments, often with thick, spongy, finger-like branches; some species are eaten, and some can become invasive","zh":"（生物）石莼属/鹿角藻属（Codium）：一种海洋绿藻属，常呈粗厚、海绵状、指状分枝；部分种类可食用，部分在外来海域可能成入侵物种"},"examples":[{"en":"Codium often grows attached to rocks in the intertidal zone.","zh":"Codium 常附着在潮间带的岩石上生长。"},{"en":"In some places, Codium is harvested as an edible seaweed.","zh":"在一些地区，人们会采收 Codium 作为可食用海藻。"},{"en":"Scientists monitor Codium because certain species can spread quickly and affect local ecosystems.","zh":"科学家会监测 Codium，因为某些物种扩散很快，可能影响当地生态系统。"}]}],"synonyms":["dead man's fingers"],"phonetic":"/ˈkoʊdiəm/","extraExplanation":["Codium 常见英文俗名是 “dead man’s fingers”（“死人手指”），因为它的枝体粗短、指状且触感海绵般柔软；这是形象说法，不带冒犯含义，多见于自然科普与潜水/潮间带观察。","词源来自希腊语 kodion，意为“（羊毛）绒/小毛皮”，指其表面有绒感、质地柔软。","注意：Codium 既可指整个属（genus），也常在海洋生态或入侵生物语境中指某些代表性物种（如 Codium fragile）。"]}
{"word":"codium","summary":{"en":"Codium is a scientific name for a genus of green seaweed; some species are edible, and some can be invasive.","zh":"Codium是石莼属（绿藻海藻）的学名；部分种可食用，也有部分可能是入侵物种。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of green seaweed (marine algae), often with thick, spongy, finger-like branches; some species are eaten and some are invasive","zh":"石莼属（绿藻类海藻）的统称，常呈粗厚、海绵状、指状分枝；有些种可食用，也有些种会成为入侵物种"},"examples":[{"en":"Codium grows on rocks in shallow coastal waters.","zh":"石莼属海藻常生长在近岸浅水区的岩石上。"},{"en":"In some places, codium is harvested as an edible seaweed.","zh":"在一些地区，人们会采收石莼属海藻作为可食用海藻。"}]}],"synonyms":["green seaweed","green algae","seaweed","dead man’s fingers (common name for some species)"],"phonetic":"/ˈkoʊdiəm/","extraExplanation":["“Codium”是拉丁化的学名（属名），在日常英语里通常作为生物学/海洋学词汇出现；不常用于一般口语。","常见种之一Codium fragile在英语里有俗名“dead man’s fingers（死人手指）”，因为外形像一簇暗绿色的手指；在部分海域它属于入侵海藻，会影响本地生态与渔业。","在料理语境中，codium有时被当作“海葡萄/海藻类食材”提到（不同地区指代可能不同），具体食用与否要看是哪一种石莼属及当地习惯。"]}
{"word":"Codium-like","summary":{"en":"Meaning “resembling Codium seaweed,” used mainly in biology/ecology descriptions.","zh":"意为“类似石莼属（Codium）海藻的”，多用于生物学/生态学描写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling or characteristic of Codium, a genus of soft, spongy green seaweeds (often with finger-like, branching, velvety fronds).","zh":"类似或具有石莼属（Codium）海藻特征的；常指柔软、海绵状、分枝呈“手指状”、表面略绒感的绿色海藻外观。"},"examples":[{"en":"The diver photographed a codium-like algae growing on the rocks.","zh":"潜水员拍到了长在岩石上的一种类似石莼属的藻类。"},{"en":"We saw codium-like green branches spread across the tide pool.","zh":"我们看到潮池里有像石莼属那样的绿色分枝铺展开来。"}]}],"synonyms":["Codium-shaped","Codium-type","Codium-resembling","seaweed-like (less specific)"],"phonetic":"/ˈkoʊdiəm laɪk/","extraExplanation":["“Codium”是一个海藻属名（常见俗名如“dead man’s fingers”，因外形像手指）。因此“Codium-like”多用于生物学/生态学写作中，描述某种藻类或结构“看起来像Codium”。","这种由“名词 + -like”构成的形容词在 науч术英语里很常见，表示“像……一样/具有……的外观或特征”（如: jellyfish-like, mushroom-like）。"]}
{"word":"codivine","summary":{"en":"Codivine (often written co-divine) is a rare word meaning “sharing divinity” or, less commonly, “divining together.”","zh":"codivine（常写作 co-divine）是个罕见词，通常指“共同具有神性”，较少见的意思是“共同占卜/共同预言”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) sharing divine status; divine together with another being (often used in theological or poetic writing).","zh":"（罕见）与他者共享神性/神格的；共同具有神圣地位的（多见于神学或诗歌语境）。"},"examples":[{"en":"In some myths, the hero is portrayed as a co-divine figure, half human and half god.","zh":"在一些神话中，英雄被描绘为“共神性”的形象，半人半神。"},{"en":"The poem hints at lovers becoming co-divine through sacrifice and devotion.","zh":"这首诗暗示恋人通过牺牲与奉献而变得“共具神性”。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Very rare) to practice divination together; to “divine” something jointly with others.","zh":"（极罕见）共同占卜/共同预言；与他人一起进行“占卜（divine）”。"},"examples":[{"en":"They would co-divine before battle, reading signs in the sky.","zh":"他们会在战斗前共同占卜，从天空的征兆中读出启示。"}]}],"synonyms":["semi-divine (similar idea, not the same)","divine (related)","co-deify (related, rarer)"],"phonetic":"/ˌkoʊdɪˈvaɪn/","extraExplanation":["“codivine / co-divine”不是现代英语里的常用词，更常见的是带连字符的写法“co-divine”。它往往是作者为了表达“共同具有神性”或“共同占卜”而临时造出的词。","如果你原本想查的是“codeine（可待因）”或“divine（神圣的/占卜）”，告诉我你的语境（句子/领域），我可以帮你确认并给出更准确的释义。"]}
{"word":"codlin","summary":{"en":"Codlin is an older/dialect form of codling, meaning a small or early apple, often used for cooking.","zh":"Codlin 是 codling 的旧式/方言写法，指小青苹果或早熟、常用来烹饪的苹果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a codling apple; a small or early apple often cooked (an older or dialect spelling of “codling”)","zh":"小青苹果/早熟苹果（常用于烹饪）；“codling”的旧式或方言拼写"},"examples":[{"en":"She baked a tart with codlins and cinnamon.","zh":"她用小青苹果和肉桂烤了一个馅饼。"},{"en":"In old recipes, you may see “codlin” used for cooking apples.","zh":"在旧食谱里，你可能会看到用“codlin”来指适合烹饪的苹果。"}]}],"synonyms":["codling (apple)","cooking apple"],"phonetic":"/ˈkɑːdlɪn/","extraExplanation":["“codlin”多见于较早的英语或英式方言写法，更常见的现代拼写是“codling”。在文学里也常写作“codling”，例如莎士比亚作品中出现过“codling”指可食用的苹果。"]}
{"word":"codline","summary":{"en":"“Codline” is not a standard English word; you may mean “code line” (a line of code) or “deadline” (due date).","zh":"“codline”不是标准英语词；你可能想写“code line（代码行）”或“deadline（截止日期）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a term from a specific context.","zh":"不是标准英语单词，可能是拼写错误或某个特定领域里的用语。"},"examples":[{"en":"I can’t find “codline” in a standard dictionary—did you mean “deadline” or “code line”?","zh":"我在常见词典里找不到“codline”——你是不是想写“deadline（截止日期）”或“code line（代码行）”？"}]},{"partOfSpeech":"phrase","definition":{"en":"(Possible intended meaning) code line: a single line of computer code.","zh":"（可能你想表达的意思）code line：一行计算机代码。"},"examples":[{"en":"This bug is caused by one code line in the loop.","zh":"这个问题是循环里的一行代码导致的。"},{"en":"Try adding a comment above that code line.","zh":"试着在那行代码上方加一条注释。"}]},{"partOfSpeech":"n.","definition":{"en":"(Possible intended meaning) deadline: the latest time by which something must be done.","zh":"（可能你想表达的意思）deadline：截止日期；最后期限。"},"examples":[{"en":"The deadline for the application is Friday.","zh":"申请的截止日期是周五。"},{"en":"We’re working late to meet the deadline.","zh":"我们加班是为了赶上截止日期。"}]}],"synonyms":["deadline (if that’s what you meant)","due date","cutoff date","line of code (if you meant code line)"],"phonetic":"/ˈkɑdˌlaɪn/","extraExplanation":["“codline”本身不常见，最常见的情况是把“deadline（截止日期）”拼错，或想写“code line（一行代码）”。如果你能提供一句原句或所在领域（比如编程/项目管理/游戏术语），我可以更准确地解释。"]}
{"word":"codling","summary":{"en":"Codling usually means either a young cod fish or (more commonly today) the codling moth/larva that damages apples.","zh":"Codling通常指小鳕鱼；但更常见的是指苹果蠹蛾（或其幼虫），会危害苹果等水果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a young cod (a small cod fish), sometimes used for a small edible fish of the cod family","zh":"小鳕鱼（幼鳕），有时也泛指可食用的小型鳕科鱼"},"examples":[{"en":"The fisherman said the codling was too small to keep, so he let it go.","zh":"渔夫说这条小鳕鱼太小不该留，就把它放生了。"},{"en":"In the market, codling can refer to smaller cod sold for cooking.","zh":"在市场上，“codling”有时指卖来做菜的较小鳕鱼。"}]},{"partOfSpeech":"n.","definition":{"en":"a common moth (or its larva) that damages apples and other fruit; the larva is a typical “worm in the apple”","zh":"苹果蠹蛾（或其幼虫）；常见的“苹果里的虫”，会蛀食苹果等水果"},"examples":[{"en":"Farmers monitored codling moths to protect the apple orchard.","zh":"果农监测苹果蠹蛾，以保护苹果园。"},{"en":"The apple had a brown tunnel inside—damage typical of codling moth larvae.","zh":"苹果里面有一条褐色虫道——这是苹果蠹蛾幼虫造成的典型损害。"}]}],"synonyms":["young cod","codling moth","apple moth"],"phonetic":"/ˈkɑːdlɪŋ/","extraExplanation":["“codling moth”在农业英语里非常常见，尤其与苹果种植相关；很多人说的“worm in the apple”通常指的就是它的幼虫。","词源提示：表示“小鳕鱼”的codling与cod（鳕鱼）有关；表示害虫的codling moth则是一个固定搭配，日常最常见的用法也是这个。"]}
{"word":"codlings","summary":{"en":"“Codlings” is the plural of “codling,” meaning (1) young cod fish, (2) codling apples, or (3) (informal) pampered people.","zh":"“codlings”是“codling”的复数，可指（1）幼鳕/小鳕鱼，（2）某种苹果，（3）（非正式，常贬义）被娇惯的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) young cod fish; small cod.","zh":"（复数）幼鳕；小鳕鱼。"},"examples":[{"en":"The harbor was full of codlings in early spring.","zh":"早春时港湾里到处都是小鳕鱼。"},{"en":"Seals often feed on codlings near the shore.","zh":"海豹常在近岸捕食幼鳕。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) apples of the codling variety (a traditional type of cooking/eating apple).","zh":"（复数）“Codling”品种的苹果（传统的食用/烹饪苹果品种）。"},"examples":[{"en":"She made a pie with codlings from the old orchard.","zh":"她用老果园里的那种苹果做了一个派。"},{"en":"Codlings can be tart when they’re not fully ripe.","zh":"这种苹果在未完全成熟时可能偏酸。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, often disapproving) people who are pampered or treated too gently.","zh":"（非正式，常含贬义）被娇惯的人；过分被照顾的人。"},"examples":[{"en":"He complained that the new trainees were codlings who couldn’t handle hard work.","zh":"他抱怨新学员都是被娇惯的人，吃不了苦。"},{"en":"Don’t raise your kids as codlings—let them try things on their own.","zh":"别把孩子养成被娇惯的人——让他们自己去尝试。"}]}],"synonyms":["young cod","small cod","codling apples","pampered people","softies"],"phonetic":"/ˈkɑdlɪŋ/","extraExplanation":["“codling”作“被娇惯的人”时，来自动词“to coddle”（溺爱、娇养）。所以在语气上常带批评或不赞同。","关于苹果的“codling”，在一些英式或较传统的语境中更常见；现代日常对话里可能不如常见苹果品种名（如 Granny Smith）常用。"]}
{"word":"codlins","summary":{"en":"Codlins = cooking apples (an older/regional plural form of codling).","zh":"Codlins 指煮食用的酸苹果（较旧／地方用法，来自 codling 的复数或变体）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural) cooking apples (especially small or unripe ones), traditionally used for making sauce, pies, or preserves.","zh":"（复数）酸苹果／煮食用苹果（尤指个头小或未成熟的），传统上用于做苹果酱、派或果酱等。"},"examples":[{"en":"She stewed a pot of codlins with sugar and cinnamon.","zh":"她把一锅酸苹果加糖和肉桂炖成了苹果酱。"},{"en":"In old recipes, codlins were often boiled down for a simple dessert.","zh":"在一些老食谱里，酸苹果常被煮软做成简单的甜点。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) a variant spelling of “codlings,” meaning young or small apples; sometimes used in older or regional English.","zh":"（较少见）“codlings”的变体拼写，指小苹果／嫩苹果；有时见于较旧或地方性的英语用法。"},"examples":[{"en":"The text mentions “codlins” in an old country cooking note.","zh":"那段文字在一则旧式乡村烹饪笔记里提到“codlins”。"}]}],"synonyms":["cooking apples","tart apples"],"phonetic":"/ˈkɑdlɪnz/","extraExplanation":["“codlin/codling”在古英语与方言语境里常指可煮食的苹果（类似“cooking apple”）。如果你是在文学作品或旧食谱里见到“codlins”，多半就是这个意思。","注意不要和“codling moth”（苹果蠹蛾）混淆：那是害虫名称，和“codlins=苹果”不是一回事。"]}
{"word":"codman","summary":{"en":"Codman is mainly a proper noun: a surname, and sometimes the name of a place or organization/brand (often seen in medical contexts).","zh":"Codman 主要是专有名词：常见为英文姓氏，也可能是地名或机构/品牌名称（在医疗语境中较常见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), used as a last name for people","zh":"姓氏：用作人的英文姓（家族姓）"},"examples":[{"en":"Dr. Codman presented his findings at the meeting.","zh":"Codman 医生在会议上展示了他的研究结果。"},{"en":"My teacher’s last name is Codman.","zh":"我老师的姓是 Codman。"}]},{"partOfSpeech":"n.","definition":{"en":"a name used for certain organizations, brands, or places (often related to medicine or local geography)","zh":"专有名称：用于某些机构、品牌或地名（常见于医疗领域或地方地名）"},"examples":[{"en":"The hospital ordered Codman equipment for the operating room.","zh":"医院为手术室订购了 Codman 的设备。"},{"en":"They live near Codman Square in Boston.","zh":"他们住在波士顿的 Codman Square 附近。"}]}],"phonetic":"/ˈkɑdmən/","extraExplanation":["“Codman”通常不是普通词汇，而是专有名词（人名/地名/品牌名）。在医疗语境里，你可能会看到它作为某些医疗器械或相关机构的名称出现；在美国波士顿也有“Codman Square”等地名。具体含义往往要看上下文（是在指人、地点，还是品牌/机构）。"]}
{"word":"codo","summary":{"en":"“Codo” is mainly the Spanish word for “elbow,” sometimes used in English bilingual contexts; it can also mean an elbow-like bend/corner.","zh":"“codo”主要是西班牙语“肘/肘部”，有时在英语的双语语境中出现；也可指“肘形”的弯折处/拐角。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish word used in English-context writing) the elbow; the joint between the upper arm and the forearm.","zh":"（常见于英语语境中的西班牙语词）肘部；上臂与前臂之间的关节。"},"examples":[{"en":"In the clinic, the nurse asked where it hurt, and he said, “My codo.”","zh":"在诊所里，护士问哪里痛，他说：“我的肘（codo）。”"},{"en":"The bilingual sign labeled the body part as “codo / elbow.”","zh":"那块双语标牌把这个身体部位标成“codo / elbow”。"}]},{"partOfSpeech":"n.","definition":{"en":"(In geography/architecture, less common) an elbow-like bend or corner in a road, pipe, river, or structure.","zh":"（地理/建筑中较少见）像手肘一样的转弯处、拐角（如道路、管道、河道或结构的弯折处）。"},"examples":[{"en":"The hikers stopped at the codo of the trail where it turned sharply.","zh":"徒步者在小路急转弯的“肘形拐点”（codo）处停了下来。"},{"en":"The technician replaced the damaged codo in the pipe.","zh":"技师更换了管道里损坏的弯头（codo）。"}]}],"synonyms":["elbow","bend","corner","elbow joint"],"phonetic":"/ˈkoʊ.doʊ/","extraExplanation":["“codo”是西班牙语里的“肘、肘部”。在英语中，它通常出现在双语交流、移民社区语境、或翻译/标注（例如“codo / elbow”）中，并不算常见的英语日常词汇；日常英语更常用“elbow”。","如果你是在特定场景（如零件名称、地名、机构缩写）看到“Codo/CODO”，也可能是专有名词或缩写；给我一句原句我可以帮你判断。"]}
{"word":"codol","summary":{"en":"“Codol” is usually a medication brand name; it may also be a misspelling of “coddle.”","zh":"“Codol”通常是止痛药的品牌名；也可能是 “coddle（溺爱/过度呵护）” 的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A brand name used in some countries for a pain-relief medicine (the exact ingredients vary by region and product type).","zh":"在一些国家使用的止痛药品牌名（不同地区/不同产品的成分可能不同）。"},"examples":[{"en":"In some pharmacies, Codol is sold as a pain reliever for headaches.","zh":"在一些药店里，Codol 作为缓解头痛的止痛药出售。"},{"en":"Always check the label to see what ingredients Codol contains in your country.","zh":"一定要查看包装标签，确认你所在国家的 Codol 含有哪些成分。"}]},{"partOfSpeech":"vt.","definition":{"en":"A likely misspelling of “coddle” (to treat someone too gently or protectively).","zh":"可能是 “coddle”（溺爱/过度呵护）的拼写错误。"},"examples":[{"en":"Don’t coddle him—let him try to solve the problem.","zh":"别溺爱他——让他自己试着解决问题。"},{"en":"She felt her parents coddled her when she was young.","zh":"她觉得自己小时候父母对她过度呵护。"}]}],"synonyms":["coddle (if that’s what you meant)","pamper","spoil"],"phonetic":"/ˈkoʊdɔl/","extraExplanation":["“Codol”更常见于商品名/品牌名而不是普通英语词汇；不同国家可能对应不同配方（有的可能含对乙酰氨基酚/扑热息痛，有的可能含可待因等）。用药时务必以当地包装说明、医生或药师建议为准。","如果你想查的是动词“coddle”，它常带有“把人当孩子一样照顾、反而让人不独立”的语气。"]}
{"word":"codomain","summary":{"en":"In math, the codomain is the target set a function maps into (the allowed outputs).","zh":"在数学中，codomain 指函数映射到的“目标集合”（允许的输出范围）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Mathematics) The set that a function is defined to output into; every value of the function must be in this set, even if some elements of the set are never actually produced.","zh":"（数学）函数的陪域：函数被规定“输出到”的集合；函数的所有输出值都必须属于这个集合，即使其中有些元素并不会真的作为输出出现。"},"examples":[{"en":"If f(x)=x² and the codomain is the real numbers, then every output of f is a real number.","zh":"如果 f(x)=x² 且陪域是实数集，那么 f 的每个输出都是实数。"},{"en":"A function can have the same rule but a different codomain, which can change whether it is onto (surjective).","zh":"同一个函数规则可以指定不同的陪域，这会影响它是否为满射（surjective）。"}]}],"synonyms":["target set","output set"],"phonetic":"/ˈkoʊˌdoʊmeɪn/","extraExplanation":["“codomain（陪域）”经常和“domain（定义域）”“range/image（值域/像）”一起出现：\n- domain：输入来自哪里（x 的集合）\n- codomain：允许输出落在哪里（y 的“目标集合”）\n- range/image：实际输出产生了哪些值（通常是陪域的子集）\n例如 f(x)=x²，若定义域是实数、陪域是实数，则 range 是非负实数；若把陪域指定为非负实数，则 range 与 codomain 相同。"]}
{"word":"codomestication","summary":{"en":"Codomestication means two species shaping each other through long-term domestication and close living together.","zh":"Codomestication 指两个物种在长期密切共处中通过驯化过程彼此塑造、共同改变。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process in which two species (often humans and another organism) domesticate and shape each other over time through close association and mutual influence","zh":"共同驯化；指两个物种（常见为人类与另一种生物）在长期密切互动中相互影响、相互塑造的过程"},"examples":[{"en":"Some researchers describe the relationship between humans and dogs as a case of codomestication.","zh":"一些研究者将人类与狗的关系描述为一种共同驯化的案例。"},{"en":"In farming communities, plants, animals, and human habits can change together through codomestication.","zh":"在农耕社区里，植物、动物与人类的生活习惯可能会通过共同驯化一起改变。"}]}],"synonyms":["co-domestication","mutual domestication","reciprocal domestication"],"phonetic":"/ˌkoʊdəˌmɛstəˈkeɪʃən/","extraExplanation":["“codomestication”由前缀 co-（共同、一起）+ domestication（驯化）构成，常用于讨论人类与家养动物、作物、甚至微生物之间的长期互相适应。","它强调“双向改变”：不仅人类选择并改变了动植物（如性情更温顺、果实更大），动植物的出现与特性也反过来改变了人类的生活方式、饮食结构与社会组织。","相关学术语境中有时会与“coevolution（共同进化）”“mutualism（互利共生）”并列，但共同驯化更突出与人类生活/文化实践紧密相关的驯养与选择过程。"]}
{"word":"codominance","summary":{"en":"Codominance means two different alleles (or two forces) are expressed/active at the same time, so both can be seen.","zh":"Codominance（共显性/共主导）指两种等位基因（或两股力量）同时被表达/起作用，因此两者都能被清楚看到。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Genetics) A pattern of inheritance in which two different alleles in a heterozygote are both fully expressed, so both traits can be seen at the same time (not blended).","zh":"（遗传学）共显性：在杂合子中两种不同等位基因都会被完全表达，因此两种性状会同时表现出来（不是混合成中间型）。"},"examples":[{"en":"In codominance, both alleles show their effects in the phenotype.","zh":"在共显性中，两种等位基因都会在表型上体现出来。"},{"en":"Human AB blood type is a classic example of codominance.","zh":"人类的AB血型是共显性的经典例子。"},{"en":"The calf showed both coat colors, suggesting codominance.","zh":"这头小牛同时呈现两种毛色，提示可能是共显性。"}]},{"partOfSpeech":"n.","definition":{"en":"(Social context) The sharing of power or influence by two groups, languages, or cultures within the same system, without one fully replacing the other.","zh":"（社会语境）共同主导/共主导：两个群体、语言或文化在同一体系中共享影响力或主导地位，而不是一方完全取代另一方。"},"examples":[{"en":"Some researchers describe the codominance of two languages in the community.","zh":"一些研究者把该社区两种语言的共同主导称为“共主导”。"},{"en":"The region’s politics shifted toward codominance between two parties.","zh":"该地区政治逐渐转向两党共同主导的格局。"}]}],"synonyms":["co-expression","shared dominance","joint dominance"],"phonetic":"/ˌkoʊˈdɑːmɪnəns/","extraExplanation":["在遗传学里，“共显性（codominance）”常与“不完全显性（incomplete dominance）”对比：\n- 共显性：两种性状都清晰可见（如AB血型同时有A抗原与B抗原）。\n- 不完全显性：表现为“中间型”（如红花×白花得到粉花）。\n另外，“共显性”不等同于“显性/隐性”那种谁盖过谁的关系，而是两者都被表达出来。"]}
{"word":"codominant","summary":{"en":"Codominant means two traits or alleles are expressed equally at the same time, especially in genetics (e.g., AB blood type).","zh":"Codominant（共显性）指两种性状或等位基因同时且同等地表达，常用于遗传学（如 AB 血型）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Genetics) Describing alleles (gene versions) that are both fully expressed in a heterozygote, so both traits appear at the same time (not blended).","zh":"（遗传学）指在杂合体中两个等位基因都能被完全表达，因此两种性状会同时出现（不是混合成中间型）。"},"examples":[{"en":"In humans, the A and B alleles for blood type are codominant, so type AB expresses both A and B markers.","zh":"在人类中，血型的 A 和 B 等位基因是共显性的，所以 AB 型会同时表达 A 和 B 两种抗原标记。"},{"en":"With codominant alleles, you can often see both traits clearly in the offspring.","zh":"在共显性等位基因的情况下，你常常能在后代身上清楚看到两种性状。"}]},{"partOfSpeech":"adj.","definition":{"en":"More generally, having equal power or influence; jointly dominant.","zh":"更广义地说，势均力敌的；共同占主导的。"},"examples":[{"en":"In some markets, two codominant companies control most of the sales.","zh":"在一些市场中，两家势均力敌的公司掌握了大部分销售额。"}]}],"synonyms":["coequal","jointly dominant","equally expressed"],"phonetic":"/ˌkoʊˈdɑmɪnənt/","extraExplanation":["“codominant / codominance（共显性）”常与“incomplete dominance（不完全显性）”对比：共显性是“两种性状同时出现”，不完全显性更像“出现中间型/混合效果”。例如红白花不完全显性可能开粉花；而共显性更像同一朵花上同时出现红色和白色斑块（不同教材会用不同例子）。","词形拆解：co-（共同）+ dominant（占优势的/显性的）。在遗传学里它强调的是“共同表达”，而不是“谁压过谁”。"]}
{"word":"codon","summary":{"en":"A codon is a three-base DNA/RNA unit that specifies an amino acid or a stop signal in protein-making.","zh":"codon（密码子）是由三个碱基组成的遗传单位，用来指定氨基酸或发出终止信号，参与蛋白质合成。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A set of three DNA or RNA bases that tells a cell which amino acid to add when making a protein, or signals “stop.”","zh":"（遗传）由三个 DNA 或 RNA 碱基组成的“密码子”，在合成蛋白质时指示加入哪一种氨基酸，或发出“终止”信号。"},"examples":[{"en":"A codon is made of three nucleotides.","zh":"一个密码子由三个核苷酸组成。"},{"en":"The codon AUG usually signals the start of protein synthesis.","zh":"密码子 AUG 通常表示蛋白质合成的起始信号。"},{"en":"Some codons don’t code for an amino acid—they tell the ribosome to stop.","zh":"有些密码子不编码氨基酸——它们会告诉核糖体停止。"}]}],"synonyms":["triplet"],"phonetic":"/ˈkoʊdɑn/","extraExplanation":["“codon”来自“code（编码）”，可理解为遗传信息的“单词”。因为只有四种碱基（A、U/T、C、G），三联组合能形成 64 种可能，对应 20 种氨基酸和终止信号；因此同一种氨基酸往往由多个不同的密码子表示（这叫“简并性”，degeneracy）。","常见术语搭配：start codon（起始密码子，常为 AUG）；stop codon（终止密码子，常为 UAA/UAG/UGA）；codon table（密码子表）。注意：在 mRNA 上说 codon；与之配对的 tRNA 上通常说 anticodon（反密码子）。"]}
{"word":"codons","summary":{"en":"Codons are three-base DNA/RNA sequences that tell the cell which amino acid to add—or when to stop—when making proteins.","zh":"密码子是由三个碱基组成的DNA/RNA序列，用来告诉细胞在合成蛋白质时该加入哪种氨基酸，或何时停止。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sequence of three DNA or RNA bases (nucleotides) that specifies an amino acid or a stop signal in protein synthesis.","zh":"（生物）密码子：由三个DNA或RNA碱基（核苷酸）组成的序列，用来指定一种氨基酸或“终止”信号，从而指导蛋白质合成。"},"examples":[{"en":"Each codon in mRNA matches a specific amino acid during translation.","zh":"在翻译过程中，mRNA上的每个密码子都对应一种特定的氨基酸。"},{"en":"A stop codon tells the ribosome to end the protein chain.","zh":"终止密码子会告诉核糖体结束蛋白质链的合成。"},{"en":"Mutations can change codons and sometimes alter the final protein.","zh":"突变可能会改变密码子，从而有时改变最终形成的蛋白质。"}]}],"synonyms":["triplet","genetic code unit"],"phonetic":"/ˈkoʊdɑn/","extraExplanation":["“codon”来自“code（编码）+ -on”，强调它像“编码单位”一样把遗传信息转换成蛋白质信息。","常见例子：AUG 是“起始密码子”，通常编码甲硫氨酸（Met）；UAA、UAG、UGA 是“终止密码子”。","一个氨基酸可能由多个不同的密码子编码，这叫“遗传密码的简并性（degeneracy）”，能在一定程度上缓冲突变的影响。"]}
{"word":"Codorus","summary":{"en":"Codorus is a place name in Pennsylvania, best known from Codorus Creek and places named after it.","zh":"Codorus 是宾夕法尼亚州的地名，最常见于科多鲁斯溪及相关地名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a proper name used for places in Pennsylvania, especially Codorus Creek (a stream) and places named after it (e.g., Codorus Township, Codorus State Park).","zh":"专有名词：常用于美国宾夕法尼亚州的地名，尤其指科多鲁斯溪（Codorus Creek，一条溪流）及以其命名的地点（如 Codorus Township、Codorus State Park）。"},"examples":[{"en":"We followed Codorus Creek for part of the hike.","zh":"我们徒步时有一段沿着科多鲁斯溪走。"},{"en":"Codorus State Park is a popular spot for boating and picnics.","zh":"科多鲁斯州立公园是划船和野餐的热门地点。"}]}],"phonetic":"/kəˈdɔrəs/","extraExplanation":["“Codorus”主要作为宾夕法尼亚州的地名出现，尤其与约克县（York County）一带相关。","关于其词源：一些资料认为它可能与当地原住民语言有关，但公开来源中的解释不完全一致；在学习和写作中，把它当作地名正确使用即可。"]}
{"word":"codpiece","summary":{"en":"A historical men’s garment piece covering the front groin area, common in Renaissance clothing.","zh":"旧时男装中遮盖裆部前方的部件，常见于文艺复兴时期服饰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A covering or pouch attached to the front of men’s trousers in the past, used to cover (and sometimes emphasize) the genital area.","zh":"（旧时男装的）护裆、裆袋：缝在裤子前方用来遮盖（有时也用于强调）男性生殖部位的覆盖物。"},"examples":[{"en":"In many Renaissance portraits, men wear a prominent codpiece.","zh":"在许多文艺复兴时期的肖像画里，男性会穿戴很显眼的护裆。"},{"en":"The costume designer added a codpiece to make the outfit historically accurate.","zh":"服装设计师加上护裆，以让造型更符合历史。"}]}],"synonyms":["groin covering","protective pouch"],"phonetic":"/ˈkɑdˌpis/","extraExplanation":["这个词常出现在艺术史、戏服/影视服装、以及对16世纪欧洲男性时尚的讨论中。它在现代日常英语里很少使用，提到时往往带一点戏谑或尴尬的语气。","词源上，cod- 在中古英语里与“袋子/囊状物”有关，-piece 表示“一块/一件”。","相关搭配：Renaissance fashion（文艺复兴时尚）、period costume（时代服装/古装）、groin area（腹股沟/裆部区域）。"]}
{"word":"codpieces","summary":{"en":"Codpieces are front coverings on men’s clothing (and sometimes armor) used historically to cover/protect the groin, especially in 15th–16th century Europe.","zh":"Codpieces 指历史上男性服装（有时也指盔甲）前部用于遮盖/保护裆部的罩袋，尤以15—16世纪欧洲常见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a pouch or covering attached to the front of men’s pants or hose to cover and sometimes emphasize the genital area (common in Europe in the 1400s–1500s)","zh":"（历史用语）男裤或紧身裤前部用来遮盖、并有时用来凸显生殖器部位的罩袋（常见于15—16世纪欧洲）"},"examples":[{"en":"In the portrait, the nobleman wears a decorated codpiece, typical of Renaissance fashion.","zh":"在这幅肖像里，这位贵族穿着装饰性的裤裆罩袋，这是文艺复兴时期常见的时尚。"},{"en":"The costume designer added a codpiece to make the period outfit look accurate.","zh":"服装设计师加上了裤裆罩袋，让这套历史服装更符合时代。"}]},{"partOfSpeech":"n.","definition":{"en":"a similar protective piece on some types of armor, covering the groin","zh":"（盔甲）类似的护裆部件，用于保护腹股沟/裆部"},"examples":[{"en":"The museum displayed a suit of armor with a metal codpiece.","zh":"博物馆展出了一套带金属护裆的盔甲。"},{"en":"Knights needed a codpiece for extra protection in combat.","zh":"骑士在战斗中需要护裆来加强保护。"}]}],"synonyms":["groin guard","protective cup","armor plate (groin)","pouch (historical clothing)"],"phonetic":"/ˈkɑdˌpis/","extraExplanation":["“codpiece”在当代英语里多用于历史讨论、戏服/舞台服装或带幽默、讽刺意味的语境。日常现代服饰一般不使用这个部件，因此这个词在现代语境中可能显得“古旧”或略带调侃。","词源小知识：早期英语里“cod”有“袋子/囊”的意思（类似“pouch”），因此“codpiece”字面上就是“袋状部件”。"]}
{"word":"codpitchings","summary":{"en":"“codpitchings” isn’t a recognized English word; it’s probably a typo or two words run together.","zh":"“codpitchings”不是常见或规范英语词，可能是拼写错误或两个词连写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a merged form of two words (for example, “cod” + “pitching(s)”).","zh":"不是标准英语单词，可能是拼写错误或把两个词连在一起了（例如“cod”+“pitching(s)”）。"},"examples":[{"en":"I can’t find “codpitchings” in major English dictionaries—could you share the sentence you saw it in?","zh":"我在主要英语词典里找不到“codpitchings”，你能把它出现的句子发我吗？"},{"en":"Did you mean “cod” (a type of fish) or “pitching” (throwing / presenting an idea)?","zh":"你想表达的是“cod”（鳕鱼）还是“pitching”（投掷/推介想法）？"}]}],"extraExplanation":["“cod”常见意思是“鳕鱼”，也可以作动词表示（非正式）“开玩笑/哄骗”。","“pitching”常见作名词：1）体育或投掷动作（pitching a ball）；2）（商业）路演/推介（a sales pitch / pitching an idea）。","如果你把原句或上下文贴出来，我可以判断你要查的到底是哪一个词，并给出准确释义和例句。"]}
{"word":"codrive","summary":{"en":"Co-drive means to share driving responsibilities or take turns driving on a trip.","zh":"codrive（更常写作 co-drive）指与他人分担驾驶任务，轮流开车。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to share driving duties with another person; to take turns driving the same trip","zh":"与他人分担驾驶任务；同一趟行程轮流开车"},"examples":[{"en":"We decided to co-drive to save energy on the long trip.","zh":"我们决定轮流开车，长途旅行更省体力。"},{"en":"Can you co-drive with me so I don’t get too tired?","zh":"你能和我轮流开车吗？这样我就不会太累。"},{"en":"They co-drove the rental car from LA to San Francisco.","zh":"他们轮流开着租来的车从洛杉矶到旧金山。"}]},{"partOfSpeech":"v.","definition":{"en":"(less common) to drive together with another person in the vehicle, with one driving and the other assisting (e.g., navigation, monitoring safety)","zh":"（较少见）两人同车协作驾驶：一人开车，另一人协助（如导航、观察路况等）"},"examples":[{"en":"I’ll co-drive by handling navigation and looking for parking.","zh":"我来协助：负责导航并帮你找车位。"},{"en":"In rally racing, a driver and co-driver work as a team.","zh":"在拉力赛中，车手和领航员（副驾驶）是团队合作。"}]}],"synonyms":["take turns driving","share the driving","switch drivers"],"phonetic":"/ˌkoʊˈdraɪv/","extraExplanation":["“codrive”更常见的写法是带连字符的“co-drive”。在日常口语里，也常直接说“take turns driving”（轮流开车）或“share the driving”（分担驾驶）。","在赛车语境（尤其是拉力赛）里，更常见的是名词“co-driver”（领航员/副驾驶），而不是动词“co-drive”。"]}
{"word":"codriven","summary":{"en":"Co-driven means “driven jointly by two or more people, teams, or forces.”","zh":"Co-driven 指“由两方或多方/多种力量共同驱动、共同主导”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Often written with a hyphen: co-driven) led, motivated, or influenced jointly by two people, groups, or forces.","zh":"（常写作 co-driven）由两个人、两方/多方或两种力量共同驱动、共同主导的。"},"examples":[{"en":"The project is co-driven by the engineering and design teams.","zh":"这个项目由工程团队和设计团队共同驱动（共同主导）。"},{"en":"Economic growth is often co-driven by investment and consumer spending.","zh":"经济增长常常由投资和消费支出共同驱动。"},{"en":"Our strategy is co-driven by data and customer feedback.","zh":"我们的策略由数据和客户反馈共同驱动。"}]}],"synonyms":["jointly driven","dual-driven","collaboratively driven","co-led"],"phonetic":"/ˌkoʊˈdrɪvən/","extraExplanation":["“co-” 是前缀，表示“共同、一起”（如 co-founder 共同创办人、co-author 合著者）。因此 co-driven 通常用于正式写作或商业语境，强调“不是单一因素/单一团队推动，而是共同推动”。","拼写提示：更常见的写法是 **co-driven**（带连字符）。如果你想表达“由代码驱动”，更常用 **code-driven** 或 **code-driven development**。如果你告诉我你的具体句子，我也可以帮你判断到底是哪一个意思。"]}
{"word":"codriver","summary":{"en":"A co-driver is someone who shares driving or helps the driver; in rally racing, it specifically means the navigator who reads pace notes.","zh":"co-driver 指分担驾驶或协助驾驶的人；在拉力赛中常特指负责读路书、指引路线的领航员/副驾驶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who shares driving duties with another driver, especially on long trips or in racing; also the person sitting in the front passenger seat who helps the driver (e.g., with navigation).","zh":"与另一位司机分担驾驶任务的人（常见于长途旅行或比赛）；也可指坐在副驾驶座、协助驾驶者的人（如导航等）。"},"examples":[{"en":"On the road trip, Maya drove first and I was the co-driver for the second half.","zh":"在这次自驾旅行中，玛雅先开车，我在后半程当共同驾驶。"},{"en":"My co-driver kept an eye on the GPS and warned me about the next exit.","zh":"我的共同驾驶一直盯着导航，并提醒我下一个出口。"}]},{"partOfSpeech":"n.","definition":{"en":"In rally racing, the navigator who reads pace notes and guides the driver through the course.","zh":"（拉力赛中）领航员/副驾驶：通过读路书（节奏笔记）来引导车手完成赛段的人。"},"examples":[{"en":"The co-driver called the turns clearly, so the driver could keep speed.","zh":"副驾驶清晰地报弯，车手才能保持速度。"},{"en":"A good rally co-driver must stay calm and read the pace notes accurately.","zh":"优秀的拉力赛副驾驶必须冷静，并准确读出路书。"}]}],"synonyms":["navigator","rally navigator","relief driver","second driver"],"phonetic":"/ˈkoʊˌdraɪvɚ/","extraExplanation":["“co-”表示“共同、一起”（如 co-worker 同事）。因此 co-driver 字面意思就是“共同驾驶的人”。","拼写上常见两种：co-driver（较常见、较正式）和 codriver（较少见，多见于非正式写法或特定文本）。","在日常语境里，co-driver 不一定真的开车，也可以指在副驾协助的人；但在拉力赛语境里，co-driver 通常特指负责报路书的领航员。"]}
{"word":"codrives","summary":{"en":"“Co-drive” means to share driving with someone, or (in rally racing) to act as the navigator supporting the driver.","zh":"“Co-drive”指与他人共同/轮流驾驶；在拉力赛中也可指担任领航员协助车手。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to share the driving of a vehicle with someone else (taking turns or working as a team)","zh":"与他人共同驾驶（轮流开车或团队协作驾驶）"},"examples":[{"en":"On long road trips, we co-drive so no one gets too tired.","zh":"长途旅行时，我们轮流开车，这样就没人会太累。"},{"en":"She co-drives with her partner when they travel across the state.","zh":"她和伴侣跨州出行时会一起轮流驾驶。"}]},{"partOfSpeech":"v.","definition":{"en":"(motorsports, especially rally) to work as the navigator who reads pace notes and supports the driver","zh":"（赛车运动，尤其是拉力赛）担任领航员/副驾驶，负责读路线笔记并协助车手"},"examples":[{"en":"He co-drove in a rally, calling out the turns from the pace notes.","zh":"他在拉力赛中担任领航员，根据路线笔记报出弯道信息。"},{"en":"In rally racing, the co-driver’s timing and notes are crucial.","zh":"在拉力赛里，领航员的报点节奏和笔记非常关键。"}]}],"synonyms":["share the driving","take turns driving","co-pilot (informal, for cars)","navigate (rally context)"],"phonetic":"/ˌkoʊˈdraɪv/","extraExplanation":["“codrives”通常是“co-drives”的不加连字符写法，表示动词第三人称单数（he/she/it co-drives）或较少见的名词复数拼写误差。常见标准写法是“co-drive / co-drives”，也可写作“co drive”。","在日常语境里，co-drive 多指“轮流开车”；在拉力赛语境里，co-driver（名词）更常用，指“领航员/副驾驶”，负责读路书（pace notes）并协助车手。"]}
{"word":"codrove","summary":{"en":"“codrove” usually means “co-drove”: the past tense of co-drive, meaning to share driving with someone.","zh":"“codrove”通常指“co-drove”：co-drive 的过去式，意思是与他人分担/轮流驾驶。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense of “co-drive”) to drive a vehicle together with another person, usually sharing the driving or responsibilities on a trip.","zh":"（“co-drive”的过去式）与他人一起开车（通常指轮流驾驶或分担驾驶任务）。"},"examples":[{"en":"On the road trip, we co-drove so neither of us got too tired.","zh":"在公路旅行中，我们轮流开车，这样谁都不会太累。"},{"en":"She co-drove with her friend for six hours and then switched seats.","zh":"她和朋友一起轮流开了六个小时，然后换了座位。"}]}],"synonyms":["co-drove","shared the driving","took turns driving","split the driving"],"phonetic":"/koʊˈdroʊv/","extraExplanation":["“codrove”并不是非常常见的标准拼写。更常见的写法是带连字符的“co-drove”，对应动词“co-drive（共同驾驶/轮流驾驶）”。在正式写作中，你也可以直接用更自然的表达：“we shared the driving / we took turns driving”。"]}
{"word":"Codrus","summary":{"en":"Codrus is a classical proper name: chiefly a legendary Athenian king famous for self-sacrifice, and also a name used in pastoral poetry for an idealized poet/shepherd.","zh":"Codrus 是古典专名：主要指以自我牺牲闻名的雅典传奇国王，也可指田园诗中象征性的诗人/牧人形象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek myth/history) A legendary king of Athens, often said to be the last king, who sacrificed his life to save the city.","zh":"（希腊神话/传说）雅典的一位传奇国王，常被说成“最后一位国王”，传说他为拯救城邦而自我牺牲。"},"examples":[{"en":"In the legend, Codrus disguises himself and dies so Athens will win the war.","zh":"在传说中，科德鲁斯乔装身份并赴死，使雅典赢得战争。"},{"en":"Some writers cite Codrus as a symbol of self-sacrifice for one’s country.","zh":"一些作者把科德鲁斯视为为国家自我牺牲的象征。"}]},{"partOfSpeech":"n.","definition":{"en":"(Literature) A classical name used in pastoral poetry for a poet or shepherd—often representing an idealized, humble poet.","zh":"（文学）田园诗中常用的古典人名，指“诗人/牧人”的代称，常带有理想化、朴素诗人的意味。"},"examples":[{"en":"In some pastoral poems, Codrus is praised as a gifted poet despite his poverty.","zh":"在一些田园诗里，Codrus 虽贫穷却被称赞为才华横溢的诗人。"},{"en":"The name Codrus appears in Latin poetry as a figure in a singing contest.","zh":"在拉丁诗歌中，Codrus 常作为歌唱比赛中的人物出现。"}]},{"partOfSpeech":"n.","definition":{"en":"(Biology, less common) Codrus: a scientific genus name used for certain butterflies in some classifications.","zh":"（生物学，较少见）Codrus：在某些分类体系中用于部分蝴蝶的属名。"},"examples":[{"en":"Older scientific sources may list a species under the genus Codrus.","zh":"较早的科学资料里，某些物种可能被列在 Codrus 这个属下。"}]}],"synonyms":["(myth) King Codrus","(symbolic sense) the self-sacrificing king","(pastoral literature) the humble poet figure"],"phonetic":"ˈkɑdrəs","extraExplanation":["“Codrus（科德鲁斯）”最常见的文化背景来自雅典的“自我牺牲”传说：神谕说只要雅典国王不死，敌军就会取胜；于是 Codrus 以平民身份挑衅敌人并被杀，从而“用自己的死换来城邦的生”。因此在英语写作里，Codrus 有时会被用来象征爱国、舍身取义。","在古典田园诗传统里（如拉丁诗歌），许多名字会被当作“类型角色”的代称：某个名字不一定指真实人物，而是一种“诗人/牧人”的文学面具。Codrus 就常以“清贫但有才华的诗人”形象出现。"]}
{"word":"codrus","summary":{"en":"Codrus is a classical name: mainly the legendary last king of Athens known for self-sacrifice, and sometimes a literary symbol of a poor or unlucky poet.","zh":"Codrus 是古典典故名：主要指以自我牺牲闻名的雅典传奇末代国王；有时也在文学中象征贫穷或不走运的诗人。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Greek myth/history) A legendary last king of Athens who sacrificed himself in war to save the city; often used as a symbol of patriotic self-sacrifice.","zh":"（希腊神话/传说史）雅典的传奇“最后一位国王”，相传为拯救城邦在战争中献身；常用来象征爱国的自我牺牲。"},"examples":[{"en":"In the legend, Codrus gives his life so Athens will be victorious.","zh":"传说中，Codrus 为了雅典获胜而献出生命。"},{"en":"The speech compares the soldier to Codrus, praising his self-sacrifice.","zh":"演讲把那位士兵比作 Codrus，赞扬他的自我牺牲精神。"}]},{"partOfSpeech":"other","definition":{"en":"(Literary reference) A name used by some Roman writers as a character-type—often a poor or unlucky poet—so it can suggest hardship or neglected talent.","zh":"（文学典故）一些罗马作家用作人物类型的名字——常指贫穷或不走运的诗人——因此可引申为困顿、被忽视的才华。"},"examples":[{"en":"In satire, ‘Codrus’ can stand for a poet with little money and few readers.","zh":"在讽刺文学里，“Codrus”可指代没钱、也没什么读者的诗人。"},{"en":"The author uses Codrus as a name to hint at poverty rather than a real person.","zh":"作者用 Codrus 这个名字来暗示贫穷处境，而不一定指真实人物。"}]}],"synonyms":["King Codrus (as a reference)","a classical allusion (general label)"],"phonetic":"ˈkɑdrəs","extraExplanation":["“Codrus”多出现在古典作品或带典故的写作里，不是现代常用词。读到它时，先判断语境：若提到雅典、国王、战争、献身，多半指“为城邦牺牲的国王”；若在讽刺/诗歌语境里，可能是作家借用的“穷诗人”形象。","在英语写作中，它常作为文化引用（allusion）：用一个名字快速唤起读者对某种品质（爱国牺牲/贫困潦倒）的联想。"]}
{"word":"cods","summary":{"en":"“Cods” usually means more than one cod fish; in informal British/Irish slang, it can also mean “testicles.”","zh":"“cods”通常指多条鳕鱼；在英式/爱尔兰非正式俚语中也可指“睾丸/蛋蛋”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “cod”: a type of sea fish that is commonly eaten.","zh":"“cod”的复数：鳕鱼（一种常见的食用海鱼）。"},"examples":[{"en":"The market sells fresh cods and salmon every morning.","zh":"市场每天早上卖新鲜的鳕鱼和三文鱼。"},{"en":"They ordered cods with chips for dinner.","zh":"他们晚餐点了鳕鱼配薯条。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, chiefly British/Irish) A slang plural meaning “testicles.”","zh":"（非正式，主要英式/爱尔兰用法）俚语复数：指“睾丸/蛋蛋”。"},"examples":[{"en":"That joke is pretty rude—it mentions his cods.","zh":"那个笑话挺粗俗的——提到了他的“蛋蛋”。"}]}],"synonyms":["cod (fish)","testicles (slang meaning)"],"phonetic":"/kɑdz/","extraExplanation":["“cods”最常见的字面意思是“鳕鱼”的复数，但日常英语里谈到鱼时更常直接说“cod”（例如：We had cod for dinner），不一定用复数形式。","“cods”作俚语指男性生殖器的一部分，语气粗俗、容易冒犯，建议在正式场合或不熟悉的人面前避免使用。","如果你本来想查的是动词“cod”（开玩笑/骗弄、戏弄），常见搭配是“to cod someone”，意思接近“耍某人、拿某人开涮”。"]}
{"word":"codshead","summary":{"en":"Codshead is an old-fashioned word meaning “a fool,” and very rarely it can mean the literal head of a cod fish.","zh":"codshead 是一个旧式用语，主要指“傻瓜/蠢人”；极少数情况下也可指鳕鱼的头（字面义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(old-fashioned, informal) A fool; a stupid or silly person.","zh":"（旧式、非正式）傻瓜；笨蛋；蠢人。"},"examples":[{"en":"Don’t be a codshead—read the instructions first.","zh":"别当傻瓜——先把说明书读一遍。"},{"en":"In the play, the hot-headed soldier is mocked as a “codshead.”","zh":"在剧中，那位火爆的士兵被嘲笑为“蠢人”。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, literal) The head of a cod (a type of fish).","zh":"（罕见、字面义）鳕鱼的头。"},"examples":[{"en":"The recipe uses codshead for a rich fish stock.","zh":"这道菜用鳕鱼头来熬出浓郁的鱼高汤。"}]}],"synonyms":["blockhead","fool","idiot","nitwit","dunce"],"phonetic":"/ˈkɑdzˌhɛd/","extraExplanation":["“codshead”多见于较早期的英式英语，常作为侮辱性称呼，语气类似“blockhead（木头脑袋）”。其中“cod”在某些历史用法里可带有“愚弄、胡说”的贬义色彩，因此“codshead”整体就引申为“蠢人”。在现代英语中很少用，更多会在旧文学、戏剧或仿古语气中看到。"]}
{"word":"codswallop","summary":{"en":"Codswallop means nonsense—something you consider untrue or ridiculous (informal, mainly British).","zh":"codswallop 指“胡说八道、无稽之谈”（非正式，主要是英式英语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Nonsense; something said or written that is not true or not worth believing.","zh":"胡说八道；无稽之谈；不值得相信的话。"},"examples":[{"en":"That claim is complete codswallop.","zh":"那个说法完全是胡说八道。"},{"en":"Don’t fill the report with codswallop—use real data.","zh":"别在报告里塞一堆废话——用真实数据。"}]}],"synonyms":["nonsense","rubbish","baloney","hogwash","bull"],"phonetic":"/ˈkɑdzˌwɑləp/","extraExplanation":["“codswallop”是非常英式（Brit. English）的非正式用语，语气带点嘲讽或不耐烦，常用来否定别人说的话。美式英语里更常见的对应说法有“nonsense”“rubbish（偏英式）”“baloney”。","词源说法众多、并不完全确定；大众文化中常见一种说法把它和旧时的啤酒/饮料或人名联系起来，但缺乏可靠证据。学习时把它当作“俏皮、英式的‘胡扯’”来记就够了。"]}
{"word":"codworm","summary":{"en":"A codworm is a parasitic worm larva sometimes found in cod and other fish.","zh":"codworm 指有时在鳕鱼等鱼类中发现的寄生虫幼虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a parasitic worm (larva) that can be found in cod and other fish; it may appear as a small white worm in the flesh.","zh":"（鳕鱼等鱼类体内的）寄生虫幼虫；可能在鱼肉中看到的小白色虫体。"},"examples":[{"en":"The inspector found a codworm in the fillet and removed it before cooking.","zh":"检查员在鱼片里发现了一条鳕鱼寄生虫，并在烹饪前把它去掉了。"},{"en":"Some people feel uneasy when they see a codworm, even though proper cooking makes the fish safe to eat.","zh":"有些人看到鳕鱼寄生虫会觉得不舒服，不过只要充分加热，鱼通常仍然可以安全食用。"}]}],"synonyms":["fish worm","anisakis (worm)","parasitic worm"],"phonetic":"/ˈkɑdˌwɝm/","extraExplanation":["“codworm”在日常英语里不算常见，更常见的说法是“fish worm”或具体到“anisakis (worm)”（异尖线虫）这类会寄生在海鱼中的线虫幼虫。","在食品安全语境中，人们常提到“candling”（用强光检查鱼片）或冷冻/充分加热来降低风险；很多地区对生食用鱼有冷冻处理的规定。"]}
{"word":"Cody","summary":{"en":"Cody is mainly used as a person’s name (first name or surname) and can also be a U.S. place name (Cody, Wyoming).","zh":"Cody 主要是人名（名字或姓氏），也可以是美国地名（怀俄明州的 Cody）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (usually masculine) used for a person’s first name; it can also be used as a surname","zh":"Cody：人名（常见为男性名），也可作姓氏"},"examples":[{"en":"Cody is my classmate in math.","zh":"Cody 是我数学课的同学。"},{"en":"I met Cody’s parents at the school event.","zh":"我在学校活动上见到了 Cody 的父母。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name, most famously Cody, a town in Wyoming, USA","zh":"Cody：地名，最著名的是美国怀俄明州的 Cody 镇"},"examples":[{"en":"We stayed in Cody, Wyoming on the way to Yellowstone.","zh":"去黄石公园的路上，我们在怀俄明州的 Cody 住了一晚。"}]}],"phonetic":"/ˈkoʊdi/","extraExplanation":["“Cody”作为姓名在美国较常见。它也常让人联想到“Buffalo Bill” William F. Cody（威廉·F·科迪），一位19世纪末的著名人物，以“西部秀（Wild West show）”闻名，对美国西部形象的流行文化传播有影响。","怀俄明州的 Cody 镇也与 Buffalo Bill 有渊源，当地有 Buffalo Bill Center of the West（一个综合博物馆群），与西部历史文化相关。"]}

