{"word":"cofactor","summary":{"en":"Cofactor most often means (1) a matrix-related number used in determinants (math) or (2) a non-protein helper required for enzyme function (biology/chemistry); more broadly, it can mean a contributing factor.","zh":"cofactor 常指（1）数学中用于行列式/逆矩阵计算的代数余子式，或（2）生物/化学中酶所需的非蛋白质辅因子；泛义上也可指促成结果的共同因素。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In math, a number (with a sign) linked to an entry in a matrix, used when finding determinants and inverses.","zh":"（数学）余子式的代数余子式：与矩阵中某个元素对应的（带正负号的）数，用于求行列式与矩阵的逆。"},"examples":[{"en":"To compute the determinant, you expand along a row using cofactors.","zh":"要计算行列式，可以沿着某一行用代数余子式展开。"},{"en":"Each element’s cofactor depends on the determinant of a smaller submatrix.","zh":"每个元素的代数余子式取决于一个更小子矩阵的行列式。"}]},{"partOfSpeech":"n.","definition":{"en":"In biology/chemistry, a non-protein helper that an enzyme needs to work (for example, a metal ion or an organic molecule).","zh":"（生物/化学）辅因子：酶发挥作用所必需的非蛋白质“助手”（例如金属离子或有机分子）。"},"examples":[{"en":"Some enzymes require zinc as a cofactor.","zh":"有些酶需要锌作为辅因子。"},{"en":"Without the proper cofactor, the enzyme cannot catalyze the reaction efficiently.","zh":"没有合适的辅因子，酶就无法高效催化反应。"},{"en":"NAD+ acts as a cofactor in many metabolic reactions.","zh":"NAD+ 在许多代谢反应中充当辅因子。"}]},{"partOfSpeech":"n.","definition":{"en":"More generally, something that helps produce a result together with other factors; a contributing element.","zh":"（泛指）共同因素/促成因素：与其他因素一起促成某种结果的要素。"},"examples":[{"en":"Access to education can be a cofactor in improving public health.","zh":"获得教育机会可能是改善公共健康的共同因素之一。"},{"en":"Stress is often a cofactor in sleep problems.","zh":"压力常常是睡眠问题的促成因素之一。"}]}],"synonyms":["contributing factor","helper (biology)","enzyme helper","adjugate element (math context)"],"phonetic":"/ˈkoʊˌfæk.tɚ/","extraExplanation":["在生物化学里，“cofactor（辅因子）”常见细分：\n- 金属离子（如 Mg2+、Zn2+）\n- 有机分子：若紧密结合在酶上，常称为“prosthetic group（辅基）”；若可在酶之间来回移动、参与反应再被再生，常称为“coenzyme（辅酶，如 NAD+、FAD）”。\n不同教材的划分略有差异，但核心概念都是：它不是蛋白质本身，却对酶的功能很关键。","词形提示：co- 表示“共同”，factor 表示“因素/因子”。因此 cofactor 直观上就是“共同起作用的因素”。"]}
{"word":"cofactors","summary":{"en":"Cofactors are helpers that work together with something else—most commonly substances that help enzymes, and in math, values related to coefficients or matrix determinants.","zh":"cofactors 指“共同起作用的辅助因素”，最常见是帮助酶工作的（生物化学）辅因子；在数学中也可指系数或矩阵行列式计算中的余子式等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance or helper that works with another factor to make a process happen, especially an enzyme in the body","zh":"（尤指生物化学中）辅因子；与另一因素一起作用、帮助过程发生的物质（常与酶共同作用）"},"examples":[{"en":"Many enzymes need metal ions as cofactors to function properly.","zh":"许多酶需要金属离子作为辅因子才能正常工作。"},{"en":"Vitamin B12 acts as a cofactor in important reactions in the body.","zh":"维生素B12在人体的重要反应中起辅因子的作用。"}]},{"partOfSpeech":"n.","definition":{"en":"a number that multiplies a variable or term in an algebraic expression","zh":"（数学）系数；代数式中乘在变量或项前的数"},"examples":[{"en":"In 3x + 2, the coefficient (cofactor) of x is 3.","zh":"在 3x + 2 中，x 的系数是 3。"},{"en":"We compared the coefficients of each term to solve the equation.","zh":"我们比较每一项的系数来解方程。"}]},{"partOfSpeech":"n.","definition":{"en":"(linear algebra) a value used in calculating a matrix determinant, related to a minor with a sign (+/−)","zh":"（线性代数）余子式；用于计算行列式的量，与代数余子式/余因子有关（带正负号）"},"examples":[{"en":"To find the determinant, compute the cofactors along the first row.","zh":"要计算行列式，可以沿第一行计算各个余子式。"},{"en":"The cofactor includes a sign that depends on its position in the matrix.","zh":"余子式包含一个由它在矩阵中的位置决定的正负号。"}]}],"synonyms":["helpers","supporting factors","enzyme helpers","coenzymes","metal ions","coefficients (math)","minors (linear algebra)"],"phonetic":"/ˈkoʊˌfæktɚ/","extraExplanation":["“cofactors” 是复数形式，单数是 “cofactor”。在生物化学里最常见，常见搭配有 enzyme cofactors（酶的辅因子）、metal cofactor（金属辅因子）。","数学里更常用的词是 “coefficient（系数）”；“cofactor/余子式” 则多出现在矩阵与行列式的语境中。"]}
{"word":"Cofane","summary":{"en":"\"Cofane\" is usually a variant spelling of \"Cofán,\" referring to an Indigenous people (and related culture/language) in Ecuador and Colombia.","zh":"“Cofane”通常是“Cofán”的拼写变体，指厄瓜多尔与哥伦比亚的科凡原住民族，以及相关的文化/语言。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a spelling variant of \"Cofán,\" an Indigenous people mainly living in northeastern Ecuador and southern Colombia","zh":"“Cofán”的一种拼写变体；指主要生活在厄瓜多尔东北部与哥伦比亚南部的科凡（Cofán）原住民族"},"examples":[{"en":"The Cofane (Cofán) people have communities in Ecuador and Colombia.","zh":"科凡（Cofán，也有人写作 Cofane）族在厄瓜多尔和哥伦比亚都有社区。"},{"en":"She is studying Cofán history and culture in the Amazon region.","zh":"她正在研究亚马逊地区的科凡族历史与文化。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Cofán people or their language and culture","zh":"与科凡族或其语言、文化有关的；科凡族的"},"examples":[{"en":"They visited a Cofán community to learn about local traditions.","zh":"他们参访了一个科凡族社区，了解当地传统。"},{"en":"Cofán leaders spoke about protecting the rainforest.","zh":"科凡族领袖谈到保护雨林的重要性。"}]}],"synonyms":["Cofán"],"phonetic":"/koʊˈfɑn/","extraExplanation":["“Cofane”在英语里更常见的写法是“Cofán”（带重音符号 á），但在不方便输入重音时也常被写成 Cofane。它通常作为专有名词出现，指一个民族；与之相关的语言有时也被称为 Cofán（他们自称语言为 A’ingae）。","如果你想查的其实是另一个单词（例如拼写类似的“coffin”棺材），可以告诉我上下文句子，我会帮你确认正确词形与意思。"]}
{"word":"cofane","summary":{"en":"“Cofane” is not standard English; it’s likely a misspelling (often “coffin”) or an Italian word (“cofano/cofane”).","zh":"“cofane”不是标准英语；更可能是拼写错误（常见为“coffin”）或意大利语词（“cofano/cofane”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling (often of “coffin”) or a word from another language (e.g., Italian “cofane/cofano,” meaning a trunk or the hood/bonnet of a car).","zh":"不是标准英语单词。更可能是拼写错误（常见是把“coffin/棺材”拼成这样），或来自其他语言（例如意大利语“cofane/cofano”，可指“箱柜/大箱子”，也可指汽车的“引擎盖”）。"},"examples":[{"en":"I couldn’t find “cofane” in an English dictionary—did you mean “coffin”?","zh":"我在英语词典里查不到“cofane”——你是不是想写“coffin（棺材）”？"},{"en":"In Italian, “cofano” can mean the hood of a car.","zh":"在意大利语里，“cofano”可以表示汽车的引擎盖。"}]}],"phonetic":"/koʊˈfɑːneɪ/","extraExplanation":["如果你告诉我“cofane”出现的句子或你想表达的意思（比如“棺材/箱子/汽车引擎盖”），我可以帮你确认正确拼法，并给出对应的英文词条（发音、释义、例句、同义词等）。"]}
{"word":"cofaster","summary":{"en":"“Cofaster” isn’t standard English; it’s usually a typo or a coined form. You likely mean “faster/go faster,” or possibly “cofactor” in science/math contexts.","zh":"“cofaster”不是标准英语；多半是拼写错误或自造词。你可能想写“faster/go faster”，或在理科语境下想写“cofactor”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is usually a typo or a made-up/brand name form; people often mean “go faster,” “faster,” or sometimes confuse it with “cofactor.”","zh":"不是标准英语单词。通常是拼写错误或自造/品牌用词；常见想表达的是“go faster（更快）”“faster（更快）”，有时也会和“cofactor（辅因子/余因子）”混淆。"},"examples":[{"en":"I couldn’t find “cofaster” in a dictionary—did you mean “go faster” or “faster”?","zh":"我在词典里找不到“cofaster”——你是不是想写“go faster”或“faster”？"},{"en":"The correct spelling in math/biology is “cofactor,” not “cofaster.”","zh":"在数学/生物里正确拼写是“cofactor”，不是“cofaster”。"}]}],"synonyms":["faster","go faster","speed up"],"phonetic":"/koʊˈfæstər/","extraExplanation":["“cofaster”看起来像把两个词拼在一起（co- + faster）或是打字错误。英文里常见前缀 co- 表示“共同/一起”（如 co-worker 同事），但“co-faster”并不是固定用法。","如果你是在表达“更快一点”，更自然的写法是：go faster / faster / speed up / make it faster。","如果你是在理科语境看到它，最可能想写的是“cofactor”（生化里的“辅因子”，或数学里的“余因子”），发音和拼写都很接近。"]}
{"word":"cofather","summary":{"en":"Co father: a rare term meaning either a co‑parent who shares fatherhood, or (in some contexts) the other father connected by a child’s marriage.","zh":"Co father（cofather）较少见，可指共同承担父亲角色的共同养育者，也可在某些语境中指因子女婚姻而成为关系的“对方父亲/亲家”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who shares fatherhood responsibilities with another person (for example, the child’s other parent or a father-like co‑parent); not a common standard word in modern English","zh":"共同承担父亲角色的人（例如孩子的另一位家长或共同养育者）；在现代英语中并非常用标准词"},"examples":[{"en":"After the divorce, he remained a supportive cofather and stayed involved in daily parenting.","zh":"离婚后，他仍然是一位负责任的共同父亲，继续参与日常育儿。"},{"en":"They discussed schedules with their child’s cofather to keep routines stable.","zh":"他们与孩子的共同父亲讨论时间安排，以保持作息稳定。"}]},{"partOfSpeech":"n.","definition":{"en":"(in some cultures or informal use) one of two men whose children marry each other; the two fathers become related through marriage (similar to “the other father-in-law”)","zh":"（在某些文化或非正式用法中）两位子女彼此结婚后，其中一方的父亲；两位父亲因婚姻而产生关系（类似“另一位亲家/对方的岳父或公公”）"},"examples":[{"en":"At the wedding, he finally met his cofather and they talked about family traditions.","zh":"在婚礼上，他终于见到了对方的父亲（亲家），两人聊起了家族传统。"},{"en":"In their community, the two dads often call each other cofathers as a sign of respect.","zh":"在他们的社区里，两位父亲常互称“cofathers”，以示尊重。"}]}],"synonyms":["co-parent","father","the other parent","the other father-in-law"],"phonetic":"/koʊˈfɑðər/","extraExplanation":["“cofather”常见于个别社区写作、家谱/社群讨论或直译语境，并不如“co-parent（共同养育者）”“father-in-law（岳父/公公）”“the other father（对方父亲）”那样普遍。正式写作中可根据具体关系改用更常见的表达。"]}
{"word":"cofathership","summary":{"en":"Cofathership means shared fatherhood—two people (often two men) being fathers together and jointly raising a child.","zh":"cofathership 指“共同父亲身份/共同为父”——两个人（常见于两位男性）共同承担父职并一起抚养孩子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or role of being fathers together; shared fatherhood (for example, two men raising a child as co-parents).","zh":"共同父亲身份；共同为父（例如两位男性作为共同家长一起抚养孩子）。"},"examples":[{"en":"The couple talked openly about cofathership and how they would share childcare.","zh":"这对伴侣坦率地讨论了共同父亲身份，以及他们将如何分担育儿。"},{"en":"Their cofathership began after they adopted a child together.","zh":"他们在一起收养孩子后，开始了共同为父的生活。"},{"en":"The article explores legal challenges related to cofathership in different states.","zh":"这篇文章探讨了不同州与共同父亲身份相关的法律挑战。"}]}],"synonyms":["co-fatherhood","shared fatherhood","co-parenthood","co-parenting"],"phonetic":"/ˌkoʊˈfɑðɚˌʃɪp/","extraExplanation":["“cofathership”不是非常常见的日常词，更常见的表达是“co-fatherhood”或“co-parenting”（共同育儿）。写作中也常见带连字符的形式“co-fathership”。","该词多出现在法律、社会学、家庭研究或LGBTQ+家庭语境中，用来强调“两位父亲共同承担父职/共同养育”的关系与责任分配。"]}
{"word":"cofeature","summary":{"en":"“Cofeature” means a feature that occurs together with another feature, especially in technical or research contexts.","zh":"“cofeature”指与另一特征共同出现的特征，常用于技术或研究语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feature (trait, variable, or signal) that appears together with another feature, often used to describe co-occurring characteristics in data, biology, or text analysis","zh":"与另一项特征一起出现的特征（性状、变量或信号）；常用于描述数据、生物或文本中“共现/伴随出现”的特征"},"examples":[{"en":"In the dataset, age and income often act as cofeatures that help predict purchasing behavior.","zh":"在这个数据集中，年龄和收入常常作为共现特征，帮助预测购买行为。"},{"en":"The researchers searched for cofeatures that consistently appeared in patients with the same diagnosis.","zh":"研究人员寻找在同一诊断患者中稳定共现的特征。"}]},{"partOfSpeech":"v.","definition":{"en":"to occur together with (another feature), or to analyze features that occur together (less common)","zh":"与（另一特征）一起出现；或分析共现特征（较少见用法）"},"examples":[{"en":"These markers cofeature with inflammation in early-stage disease.","zh":"这些标记在疾病早期常与炎症一起出现。"}]}],"synonyms":["co-occurring feature","associated feature","correlated feature","co-feature"],"phonetic":"/koʊˈfiːtʃər/","extraExplanation":["“cofeature”多见于技术语境（如机器学习、数据挖掘、生物信息学）。在学术写作中也常写作“co-feature”或“co-occurring feature(s)”。","构词法：前缀“co-”表示“共同/一起”，feature表示“特征/特点”，合起来就是“共同出现的特征”。"]}
{"word":"cofeatures","summary":{"en":"“Cofeatures” means features that occur or are considered together with other features.","zh":"“cofeatures”指与其他特征共同出现或共同被考虑的一组特征。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) features that appear or are considered together with other features; accompanying or jointly occurring characteristics.","zh":"（复数）与其他特征一起出现、一起被考虑的特征；伴随出现的共同特征。"},"examples":[{"en":"In the survey, age and income were analyzed with their cofeatures, such as education level.","zh":"在这项调查中，年龄和收入会与其共同特征（如受教育程度）一起分析。"},{"en":"The model improved when we included cofeatures like time of day and location.","zh":"当我们加入“时间段”和“地点”等共同特征后，模型效果变好了。"}]}],"synonyms":["co-features","associated features","joint features","accompanying features"],"phonetic":"/ˈkoʊˌfiːtʃər/","extraExplanation":["“cofeatures”通常写作“co-features”（带连字符）或“cofeatures”（较少见），意思是“共同出现/共同考虑的特征”。在机器学习、统计分析或产品设计讨论中更常见，用来强调特征之间的搭配、相关性或联合出现。","发音上可按“co- + features”理解；单数可写作“cofeature”。"]}
{"word":"cofeoffee","summary":{"en":"Coffee is a drink made from roasted coffee beans; it can also mean the beans/grounds or the coffee plant.","zh":"Coffee 指用烘焙咖啡豆制成的饮料；也可指咖啡豆/咖啡粉或咖啡植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a popular drink made from roasted coffee beans, usually served hot but sometimes iced","zh":"咖啡（由烘焙咖啡豆制成的饮料，通常热饮，也可做成冰咖啡）"},"examples":[{"en":"I drink coffee every morning.","zh":"我每天早上喝咖啡。"},{"en":"Could I get a coffee to go, please?","zh":"我可以要一杯外带咖啡吗？"},{"en":"She ordered an iced coffee because it was hot outside.","zh":"外面很热，所以她点了冰咖啡。"}]},{"partOfSpeech":"n.","definition":{"en":"coffee beans (or the ground beans) used to make the drink","zh":"咖啡豆；咖啡粉（用来冲煮咖啡的原料）"},"examples":[{"en":"We ran out of coffee, so I need to buy more beans.","zh":"我们的咖啡用完了，所以我得再买些豆子。"},{"en":"This coffee smells amazing.","zh":"这咖啡闻起来太香了。"}]},{"partOfSpeech":"n.","definition":{"en":"the coffee plant (a tropical plant that produces coffee beans)","zh":"咖啡树；咖啡植物"},"examples":[{"en":"Coffee grows best in warm, tropical climates.","zh":"咖啡最适合在温暖的热带气候生长。"}]}],"synonyms":["java","joe","caffeine (informal context)"],"phonetic":"/ˈkɔfi/","extraExplanation":["你输入的“cofeoffee”看起来像是拼写错误，常见正确拼写是 **coffee**（双写 ff，结尾是 -ee）。","词源上，coffee 经过多种语言传播：阿拉伯语 *qahwa* → 土耳其语 *kahve* → 欧洲语言，最后进入英语。","口语里点单常说：**a coffee**（一杯咖啡）、**black coffee**（不加奶不加糖）、**coffee with milk**（加奶咖啡）。另外 **coffee shop** 在美式英语里常指咖啡店/咖啡馆。"]}
{"word":"coferment","summary":{"en":"Coferment means to ferment ingredients or microbes together in one process.","zh":"coferment 指把原料或微生物放在同一过程中一起发酵。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to ferment (two or more ingredients or microorganisms) together in the same process or vessel","zh":"（把两种或以上的原料或微生物）一起发酵；共发酵"},"examples":[{"en":"Some breweries coferment grapes and barley to create hybrid beer-wine styles.","zh":"有些酒厂会把葡萄和大麦一起共发酵，做出啤酒与葡萄酒融合的风格。"},{"en":"The lab cofermented yeast and bacteria to study their interaction.","zh":"实验室让酵母和细菌共发酵，以研究它们的相互作用。"},{"en":"We coferment the fruit with the skins to add more aroma.","zh":"我们让水果连皮一起共发酵，以增加香气。"}]}],"synonyms":["co-ferment","ferment together","jointly ferment"],"phonetic":"/ˌkoʊfərˈmɛnt/","extraExplanation":["“coferment”常见于酿酒、食品发酵与生物技术语境；日常英语里更常写作“co-ferment”（带连字符）。","这个词强调“同时、在同一批次里”发酵，区别于先后分开发酵再混合（blend/mix after fermentation）。"]}
{"word":"cofermentation","summary":{"en":"Cofermentation is fermenting ingredients or microbes together in the same batch, often to shape flavor and aroma (commonly discussed in coffee and brewing).","zh":"Cofermentation 指把多种原料或微生物在同一批次中一起发酵，以塑造风味与香气（咖啡与酿造领域常见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of fermenting two or more ingredients (or using two or more microbes) together so they ferment at the same time, often to create a specific flavor, aroma, or chemical profile","zh":"（共）协同发酵：把两种或以上的原料（或两种/以上微生物）同时一起发酵，以产生特定的风味、香气或化学特性"},"examples":[{"en":"Some roasters buy coffee made with cofermentation to highlight intense fruit flavors.","zh":"一些烘焙商会采购经过共发酵处理的咖啡，以突出浓郁的水果风味。"},{"en":"In brewing, cofermentation can mean yeast and bacteria fermenting the same batch together.","zh":"在酿造中，共发酵可以指酵母和细菌在同一批次里一起发酵。"}]},{"partOfSpeech":"n.","definition":{"en":"(in some coffee-processing contexts) a method where coffee cherries/beans are fermented together with added fruit, juice, spices, or other ingredients to influence flavor","zh":"（咖啡处理语境）一种做法：让咖啡果/豆与加入的水果、果汁、香料等一起发酵，以改变或增强风味"},"examples":[{"en":"The bag notes said the coffee used cofermentation with pineapple and cinnamon.","zh":"包装说明写着这款咖啡采用了与菠萝和肉桂的共发酵。"},{"en":"Not everyone likes cofermentation coffees because the added flavors can feel very strong.","zh":"并不是所有人都喜欢共发酵咖啡，因为添加带来的风味可能会非常强烈。"}]}],"synonyms":["co-fermentation","mixed fermentation","combined fermentation"],"phonetic":"/ˌkoʊfɝmɛnˈteɪʃən/","extraExplanation":["“co-”表示“共同/一起”。“cofermentation”在学术上可写作“co-fermentation”（加连字符更常见），意思基本相同。","在咖啡圈里，“cofermentation”常与“infused fermentation（浸入式/添加式发酵）”被混用，但严格说：共发酵强调“共同发酵的对象/微生物”，而“infused/added”更强调“加入外来材料带味”。购买时可留意处理法说明是否写明添加物、发酵时长与容器，以判断风味来源。"]}
{"word":"COFF","summary":{"en":"“Coff” is a rare/informal form of “cough,” used as a verb (to cough) or as a written cough sound in dialogue.","zh":"“coff”是较少见/非正式的“cough”写法，可作动词表示“咳嗽”，也可作名词/拟声词表示“咳的一声（咳咳）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(informal/rare) To cough, especially a short or rough cough.","zh":"（非正式/较少见）咳嗽，尤指短促或粗哑的一声咳。"},"examples":[{"en":"He coffed once and cleared his throat before speaking.","zh":"他轻咳了一声，清了清嗓子才开口。"},{"en":"The old engine started, sputtered, and the driver coffed in the smoke.","zh":"老发动机发动后噗噗作响，司机在烟里咳了几声。"}]},{"partOfSpeech":"n.","definition":{"en":"A short cough sound, often written to show someone coughing.","zh":"（书面拟声）咳的一声，用来表示有人在咳嗽。"},"examples":[{"en":"“Coff, coff,” she said, trying to get his attention politely.","zh":"“咳咳，”她说，想礼貌地引起他的注意。"},{"en":"The script includes a stage direction: Coff (offstage).","zh":"剧本里有一句舞台提示：咳（幕后）。"}]}],"synonyms":["cough","hack","clear one’s throat"],"phonetic":"/kɔf/","extraExplanation":["“coff”多见于方言、旧式写法或文学/戏剧里，用来模拟“cough”的声音或表示轻咳；现代日常英语更常用“cough”。在对话里写“coff coff”有时也带一点“故意轻咳以示提醒/打断”的语气。"]}
{"word":"coff","summary":{"en":"“coff” is a nonstandard spelling meaning “cough.” Use “cough” in formal English.","zh":"“coff”是“cough（咳嗽）”的非标准拼写；正式英语中应写作“cough”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(nonstandard) To cough; an informal or mistaken spelling of “cough.”","zh":"（非标准）咳嗽；常见于口语化拼写或误拼，标准拼写是“cough”。"},"examples":[{"en":"I keep coffing at night, so I’m going to see a doctor.","zh":"我晚上一直在咳（coff），所以打算去看医生。（标准写法：coughing）"},{"en":"If you coff a lot, drink some warm water and rest.","zh":"如果你一直咳（coff）得厉害，喝点温水并休息一下。（标准写法：cough）"}]},{"partOfSpeech":"n.","definition":{"en":"(nonstandard) A cough; the sound or action of coughing.","zh":"（非标准）咳嗽（一次咳嗽的动作或声音）。"},"examples":[{"en":"That dry coff won’t go away.","zh":"那种干咳（coff）一直好不了。（标准写法：cough）"},{"en":"I heard a coff from the next room.","zh":"我听到隔壁房间传来一声咳嗽（coff）。（标准写法：cough）"}]}],"synonyms":["cough"],"phonetic":"/kɔf/","extraExplanation":["“coff”一般不是标准英语单词，多见于聊天、拼写错误或为了模仿咳嗽声音的写法。正式写作和考试中建议使用“cough /kɔf/”。","相关常用搭配：cough up（咳出；也可指“勉强掏钱”）、a bad cough（严重咳嗽）、cough medicine（止咳药）。"]}
{"word":"Coffea","summary":{"en":"Coffea is the scientific genus of plants that produce coffee beans.","zh":"Coffea 指产咖啡豆的咖啡植物的科学属名（咖啡属）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical flowering plants whose seeds (coffee beans) are used to make coffee","zh":"咖啡属（热带开花植物的属名；其种子“咖啡豆”用于制作咖啡）"},"examples":[{"en":"Coffea arabica is widely grown for high-quality coffee.","zh":"阿拉比卡咖啡（Coffea arabica）因高品质咖啡而被广泛种植。"},{"en":"Different Coffea species produce beans with different flavors.","zh":"不同的咖啡属物种会产出风味不同的咖啡豆。"}]}],"synonyms":["coffee plant","coffee tree"],"phonetic":"/ˈkɔːfiə/","extraExplanation":["“Coffea”是拉丁化的科学属名，日常英语里更常说“coffee plant”（咖啡树/咖啡植物）或直接说“coffee”。","最常见的栽培种包括：Coffea arabica（阿拉比卡）与 Coffea canephora（常称 robusta，罗布斯塔）。二者在风味、咖啡因含量与抗病性上都有差异。","在书面或学术语境中，属名通常首字母大写且斜体书写：*Coffea*；具体物种名如 *Coffea arabica*。"]}
{"word":"coffea","summary":{"en":"Coffea is the scientific genus name for coffee plants.","zh":"Coffea 是“咖啡植物”的学名属名（咖啡属）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A genus of tropical plants (family Rubiaceae) whose seeds are used to produce coffee.","zh":"咖啡属（茜草科的一属热带植物）；其种子（咖啡豆）用来制作咖啡。"},"examples":[{"en":"Coffea arabica is the most widely grown species for high-quality coffee.","zh":"阿拉比卡咖啡（Coffea arabica）是最广泛种植、品质较高的咖啡品种。"},{"en":"Many farmers cultivate Coffea in warm, humid regions near the equator.","zh":"许多农民在靠近赤道的温暖湿润地区种植咖啡属植物。"}]}],"synonyms":["coffee plant","coffee tree"],"phonetic":"/ˈkɔ.fi.ə/","extraExplanation":["“Coffea”是拉丁化的学名，用于植物学分类；日常英语里更常说“coffee plant”（咖啡树/咖啡植物）或直接说“coffee”。","常见的两大栽培种：Coffea arabica（阿拉比卡，风味更细腻、咖啡因通常较低）和 Coffea canephora（罗布斯塔，常见于速溶或拼配，咖啡因通常较高）。"]}
{"word":"coffee","summary":{"en":"Coffee is a popular drink made from roasted coffee beans; it can also mean the beans/grounds themselves or a coffee-brown color.","zh":"coffee 常指咖啡饮料，也可指咖啡豆/咖啡粉，或指咖啡色（深棕色）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a drink made from roasted coffee beans, usually served hot (or sometimes iced).","zh":"咖啡（由烘焙咖啡豆制成的饮料，通常热饮，也可做成冰咖啡）。"},"examples":[{"en":"I drink coffee every morning before work.","zh":"我每天上班前都会喝咖啡。"},{"en":"Could I get an iced coffee with milk, please?","zh":"请给我一杯加牛奶的冰咖啡，好吗？"}]},{"partOfSpeech":"n.","definition":{"en":"the roasted beans (or ground powder) used to make the drink.","zh":"咖啡豆；咖啡粉（用来冲泡咖啡的原料）。"},"examples":[{"en":"We ran out of coffee, so I need to buy a new bag of beans.","zh":"我们的咖啡用完了，所以我得去买一袋新咖啡豆。"}]},{"partOfSpeech":"adj.","definition":{"en":"having a dark brown color like coffee.","zh":"咖啡色的；深棕色的。"},"examples":[{"en":"She wore a coffee-colored coat.","zh":"她穿了一件咖啡色的大衣。"}]}],"synonyms":["java","joe","café (informal in some contexts)"],"phonetic":"/ˈkɔːfi/","extraExplanation":["“Coffee”既可指饮料，也可指原料（咖啡豆/咖啡粉）。在点单时常见说法有：black coffee（不加奶不加糖的黑咖啡）、coffee with milk/cream（加牛奶/奶油）、coffee with sugar（加糖）。","在一些英语语境里，“coffee”还可以指“喝咖啡的时间/社交小聚”，如 coffee break（咖啡休息时间）或 coffee with someone（和某人一起喝咖啡、聊聊）。"]}
{"word":"coffee bar","summary":{"en":"A place (or counter) where coffee drinks are made and sold.","zh":"制作并售卖咖啡饮品的地方或吧台。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A café or counter where coffee and coffee drinks are prepared and served, often with a casual place to sit or stand.","zh":"咖啡吧；咖啡馆里的咖啡柜台（提供咖啡及咖啡饮品的地方，常可坐或站着喝）"},"examples":[{"en":"Let’s meet at the coffee bar near the station.","zh":"我们在车站附近的咖啡吧见吧。"},{"en":"This hotel has a small coffee bar in the lobby.","zh":"这家酒店在大堂里有一个小咖啡吧。"},{"en":"She ordered a latte at the coffee bar and found a seat by the window.","zh":"她在咖啡吧点了一杯拿铁，然后在窗边找了个座位。"}]},{"partOfSpeech":"n.","definition":{"en":"A long, counter-like table where people can sit and drink coffee, similar to a bar counter but for coffee.","zh":"（像酒吧吧台一样的）咖啡吧台；咖啡长桌"},"examples":[{"en":"There’s a coffee bar along the wall with stools.","zh":"靠墙有一排咖啡吧台，配着高脚凳。"},{"en":"I like working at the coffee bar because there are power outlets.","zh":"我喜欢在咖啡吧台那边工作，因为有插座。"}]}],"synonyms":["café","coffee shop","espresso bar","coffee counter"],"phonetic":"/ˈkɔfi bɑr/","extraExplanation":["在北美语境里，coffee bar 常指“卖咖啡的店/区域”，不一定像酒吧那样卖酒。很多商场、酒店、办公室会用 coffee bar 表示“提供现煮咖啡的角落或柜台”。","易混淆点：coffee shop 更常指“咖啡店/咖啡馆”（整体空间）；coffee bar 更强调“出咖啡的吧台/服务区”，也可以指小型咖啡店。"]}
{"word":"coffee break","summary":{"en":"A coffee break is a short rest from work or study, often used for having a drink and chatting before returning to an activity.","zh":"coffee break 指工作或学习中的短暂休息时间，常用于喝饮料、放松或简单社交，然后继续活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A short rest from work or study when people drink coffee or another beverage (often with a small snack).","zh":"（工作或学习中的）咖啡休息时间；短暂休息（通常喝咖啡或其他饮料，有时配小点心）。"},"examples":[{"en":"Let’s take a coffee break at 10:30.","zh":"我们10:30休息一下，来个咖啡时间吧。"},{"en":"I met my new colleague during the coffee break.","zh":"我在咖啡休息时间认识了新同事。"},{"en":"After two hours of studying, I needed a coffee break.","zh":"学习了两小时后，我需要休息一下喝杯咖啡。"}]},{"partOfSpeech":"n.","definition":{"en":"A short pause in an activity or broadcast; a brief intermission.","zh":"（活动或节目中的）短暂停顿；中场休息。"},"examples":[{"en":"We’ll resume the meeting after a coffee break.","zh":"咖啡休息后我们继续开会。"},{"en":"The workshop includes a coffee break between sessions.","zh":"这场培训在两段课程之间安排了咖啡休息。"}]}],"synonyms":["break","rest break","tea break","refreshment break"],"phonetic":"/ˈkɔfi breɪk/","extraExplanation":["在英语职场文化里，coffee break 不一定真的喝咖啡，也可以喝茶或水；重点是“短暂放松+社交”。在欧洲一些国家也常见类似表达（如 tea break），但 coffee break 更国际化、在办公室语境尤其常用。"]}
{"word":"coffee shop","summary":{"en":"A café where you buy coffee and often sit to drink, work, or meet people.","zh":"卖咖啡并常可内用、工作或会面的咖啡馆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small café where people buy and drink coffee (and often tea, pastries, or light meals), and may sit, work, or meet others.","zh":"咖啡店；咖啡馆（卖咖啡，常也卖茶、点心或简餐，人们可以坐着聊天、工作或见面）"},"examples":[{"en":"Let’s meet at a coffee shop near the station.","zh":"我们在车站附近的咖啡店见吧。"},{"en":"She likes to study in a quiet coffee shop after class.","zh":"她喜欢下课后在安静的咖啡店学习。"},{"en":"The coffee shop serves sandwiches and fresh pastries.","zh":"这家咖啡店供应三明治和新鲜糕点。"}]}],"synonyms":["café","coffeehouse"],"phonetic":"/ˈkɔfi ʃɑp/","extraExplanation":["“coffee shop”在美式英语里通常指提供咖啡饮品、可内用的咖啡馆，语气比“café”更口语、更日常。","在英式英语中，“coffee shop”有时也可指较简单的餐馆/小吃店；但在现代语境里，两边都常理解为咖啡馆。","常见搭配：coffee shop culture（咖啡馆文化）、coffee shop conversation（咖啡馆式聊天/轻松谈话）、local/independent coffee shop（本地/独立咖啡店）。"]}
{"word":"coffee table","summary":{"en":"A low living-room table in front of a sofa, used for drinks and small items.","zh":"客厅里放在沙发前的矮桌（茶几），用来放饮料和小物品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A low table placed in front of a sofa or seating area, used for putting drinks, books, decorations, etc.","zh":"（客厅里沙发前的）茶几／咖啡桌，用来放饮料、书、装饰品等。"},"examples":[{"en":"I left the remote on the coffee table.","zh":"我把遥控器放在茶几上了。"},{"en":"There are some magazines on the coffee table.","zh":"茶几上有几本杂志。"},{"en":"Be careful—your cup might spill on the coffee table.","zh":"小心点——你的杯子可能会洒在茶几上。"}]}],"synonyms":["low table","living-room table"],"phonetic":"/ˈkɔfi ˌteɪbəl/","extraExplanation":["“coffee table”这个说法来自西方客厅文化：人们在客厅聊天时会把咖啡或茶放在较矮的桌子上，因此得名。现代家庭里不一定真的喝咖啡，但名称保留下来。","在英美语境里更常说coffee table；中文里常对应“茶几”。如果桌子更高、用来吃饭或工作，通常不叫coffee table，而可能叫end table（边几）、side table（边桌）或dining table（餐桌）。"]}
{"word":"coffee-colored","summary":{"en":"“Coffee-colored” means coffee-brown: a warm medium-to-dark brown color.","zh":"“coffee-colored”指咖啡般的棕色：偏暖的中深棕色。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a color like coffee (usually a warm medium-to-dark brown).","zh":"咖啡色的；像咖啡一样的颜色（通常是偏暖的中深棕色）。"},"examples":[{"en":"She wore a coffee-colored coat in the fall.","zh":"她在秋天穿了一件咖啡色的外套。"},{"en":"The room looked calm with coffee-colored walls and soft lighting.","zh":"咖啡色的墙面配上柔和的灯光，让房间看起来很安静。"},{"en":"He has coffee-colored eyes.","zh":"他有一双咖啡色的眼睛。"}]}],"synonyms":["coffee-brown","brown","dark brown","warm brown","chestnut (sometimes)"],"phonetic":"/ˈkɔfi ˌkʌlɚd/","extraExplanation":["“coffee-colored”通常作定语形容词，放在名词前：a coffee-colored dress。放在系动词后也可以：The dress is coffee-colored。","拼写上常用连字符（hyphen）把两个词连成一个形容词，尤其在名词前更常见；不加连字符的coffee colored也能见到，但在正式写作中连字符更清晰。","语感上它常带有“温暖、沉稳、自然”的色彩联想；在描述肤色时也会出现，但为避免冒犯或刻板印象，最好在合适语境中使用，并可用更具体的颜色词（如 medium brown / warm brown）来表达。"]}
{"word":"coffee-derived","summary":{"en":"Coffee-derived describes something made from coffee or originating from coffee (literally or figuratively).","zh":"coffee-derived 指「由咖啡製成／衍生而來的」，可作字面或引申用法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made from coffee or produced using coffee as a source material or ingredient.","zh":"由咖啡製成的；以咖啡為原料或來源生產的。"},"examples":[{"en":"The dessert has a coffee-derived flavor from espresso extract.","zh":"這道甜點帶有由濃縮咖啡萃取物帶來的咖啡衍生風味。"},{"en":"Researchers tested coffee-derived antioxidants in the lab.","zh":"研究人員在實驗室測試了咖啡衍生的抗氧化物。"}]},{"partOfSpeech":"adj.","definition":{"en":"Coming from coffee in a figurative sense (for example, habits, culture, or routines influenced by coffee).","zh":"（引申）源自咖啡的；由喝咖啡的習慣或咖啡文化所形成的。"},"examples":[{"en":"Her coffee-derived morning routine includes a quiet ten minutes of reading.","zh":"她那個由咖啡引出的晨間習慣包含安靜閱讀十分鐘。"},{"en":"The café’s music is part of a coffee-derived sense of comfort.","zh":"咖啡館的音樂也是一種由咖啡文化帶來的舒適感。"}]}],"synonyms":["coffee-based","coffee-sourced","derived from coffee","coffee-related"],"phonetic":"/ˈkɔfi dɪˈraɪvd/","extraExplanation":["「coffee-derived」是由「coffee + derived」組成的複合形容詞，常用連字號修飾名詞（如 coffee-derived compounds）。放在名詞後面時有時可不加連字號（the compounds are coffee derived），但在學術與商業寫作中加連字號更清楚。"]}
{"word":"coffee-family","summary":{"en":"The “coffee family” is the plant family Rubiaceae, which includes coffee plants and related species.","zh":"“coffee-family/coffee family”指植物学上的茜草科（Rubiaceae），包含咖啡植物及其相关物种。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the coffee family; the plant family Rubiaceae, which includes coffee plants (Coffea) and many other flowering plants such as gardenia and madder","zh":"咖啡科；茜草科（Rubiaceae），一个植物科，包含咖啡属（Coffea）等多种开花植物，如栀子、茜草等"},"examples":[{"en":"Coffee (Coffea) belongs to the coffee family, Rubiaceae.","zh":"咖啡（Coffea）属于咖啡科（茜草科，Rubiaceae）。"},{"en":"Gardenia is also in the coffee family.","zh":"栀子也属于咖啡科（茜草科）。"},{"en":"The guide explained how to recognize members of the coffee family by their opposite leaves.","zh":"导览员解释了如何通过对生叶等特征辨认咖啡科（茜草科）植物。"}]}],"synonyms":["Rubiaceae","rubiaceous plants"],"phonetic":"ˈkɔfi ˈfæməli","extraExplanation":["“coffee family”在日常英语里不太常用；在植物学语境中更常见，指的就是茜草科（学名 Rubiaceae）。有时也会写作不加连字符的“coffee family”。","茜草科是一个很大的植物科，除了咖啡，还包括可观赏的栀子（gardenia）、以及历史上用于染料的茜草（madder）。"]}
{"word":"coffee-farming","summary":{"en":"Coffee-farming means growing coffee plants to produce coffee beans.","zh":"coffee-farming 指为生产咖啡豆而进行的咖啡植物种植与管理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The growing and cultivating of coffee plants (coffee trees/shrubs) in order to produce coffee beans.","zh":"咖啡种植；咖啡栽培（为了收获咖啡豆而种植与管理咖啡树/咖啡灌木）。"},"examples":[{"en":"Coffee-farming supports many families in Colombia and Ethiopia.","zh":"咖啡种植在哥伦比亚和埃塞俄比亚养活了许多家庭。"},{"en":"Because of warmer weather, coffee-farming is becoming harder at lower altitudes.","zh":"由于天气变暖，低海拔地区的咖啡种植变得更困难。"},{"en":"She studied sustainable coffee-farming methods to protect soil and water.","zh":"她研究可持续的咖啡种植方法，以保护土壤和水资源。"}]}],"synonyms":["coffee cultivation","coffee growing","coffee agriculture"],"phonetic":"/ˈkɔfi ˌfɑrmɪŋ/","extraExplanation":["“coffee-farming”常作复合名词（也可写作coffee farming），用于讨论农业、供应链与永续议题。与“coffee production”（咖啡生产，范围更广，包含加工与出口）相比，它更聚焦在田间种植与管理阶段。","语境里常搭配：coffee-farming regions（咖啡种植区）、smallholder coffee-farming（小农咖啡种植）、shade-grown coffee（荫蔽栽培咖啡，强调生态与生物多样性）、coffee-farm worker（咖啡农场工人）。"]}
{"word":"coffee-flavored","summary":{"en":"“Coffee-flavored” describes something that tastes or smells like coffee.","zh":"“coffee-flavored”用来形容某物带有咖啡的味道或香气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the taste or smell of coffee (often added to foods, drinks, or desserts).","zh":"有咖啡味的；带咖啡香气/风味的（常用于食品、饮料或甜点）。"},"examples":[{"en":"I bought coffee-flavored ice cream.","zh":"我买了咖啡味的冰淇淋。"},{"en":"Do you have coffee-flavored syrup for the latte?","zh":"你们有拿铁用的咖啡风味糖浆吗？"},{"en":"She prefers coffee-flavored candy to fruit flavors.","zh":"比起水果口味，她更喜欢咖啡味的糖果。"}]}],"synonyms":["coffee-tasting","coffee-flavored","coffee-scented"],"phonetic":"/ˈkɔfi ˈfleɪvərd/","extraExplanation":["“coffee-flavored”是复合形容词，通常用连字符（coffee-flavored）放在名词前：coffee-flavored yogurt。放在名词后作表语时也常见：The cookies are coffee flavored（此时连字符可省略）。","搭配提示：更偏“天然/真实咖啡风味”可说 coffee-flavored / coffee-tasting；更偏“添加香精的风味”也会用 coffee-flavored（语境决定）。商业包装上常见同义表达：coffee flavor / coffee-flavoured（英式拼法多一个u）。"]}
{"word":"coffee-like","summary":{"en":"Similar to coffee in taste, smell, color, or overall character.","zh":"在味道、气味、颜色或整体特征上“像咖啡的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a smell, taste, color, or general quality similar to coffee.","zh":"像咖啡的；具有咖啡相似的气味、味道、颜色或整体特征的。"},"examples":[{"en":"The dessert had a coffee-like aroma, even though it contained no coffee.","zh":"这道甜点有一种咖啡般的香气，尽管里面并没有咖啡。"},{"en":"He described the sauce as coffee-like in color—dark brown and glossy.","zh":"他形容这酱汁的颜色像咖啡一样——深棕色而且有光泽。"},{"en":"This herbal drink has a coffee-like bitterness but no caffeine.","zh":"这种草本饮品有类似咖啡的苦味，但不含咖啡因。"}]}],"synonyms":["coffee-flavored","coffee-scented","coffee-colored","espresso-like"],"phonetic":"/ˈkɔfiˌlaɪk/","extraExplanation":["“coffee-like”是由名词coffee + 后缀-like（表示“像……一样的”）构成的形容词，常用连字符，尤其在放在名词前作定语时更常见：a coffee-like smell / a coffee-like flavor。口语或非正式写作中也可能写作coffeelike。"]}
{"word":"coffee-producing","summary":{"en":"Coffee-producing describes places or things that produce coffee beans.","zh":"coffee-producing 用来形容出产咖啡豆的国家、地区或相关事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a country, region, farm, or plant) producing coffee beans as an agricultural product.","zh":"（指国家、地区、农场或植物）生产/出产咖啡豆的；产咖啡的。"},"examples":[{"en":"Brazil is one of the world’s largest coffee-producing countries.","zh":"巴西是世界上最大的产咖啡国家之一。"},{"en":"Many coffee-producing regions rely on seasonal rainfall.","zh":"许多产咖啡地区依赖季节性降雨。"},{"en":"Rising temperatures may affect coffee-producing areas.","zh":"气温上升可能会影响产咖啡地区。"}]}],"synonyms":["coffee-growing","coffee-producing (areas/regions)","coffee-farming (more general)"],"phonetic":"ˈkɔfi prəˈdusɪŋ","extraExplanation":["“coffee-producing”是由名词 + 现在分词（coffee + producing）构成的复合形容词，常用连字符，放在名词前作定语：coffee-producing countries/regions/areas。","不加连字符也可能见到（coffee producing），但在名词前作修饰语时加连字符更清晰、更常见。","含义上更偏“用于产业/农业生产的产出”，如果强调“种植咖啡”，也常用近义表达“coffee-growing”。"]}
{"word":"coffee-related","summary":{"en":"“Coffee-related” means connected with coffee or anything involving coffee.","zh":"“coffee-related”表示“与咖啡或咖啡相关事物有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with coffee (the drink), coffee beans, coffee shops, or the culture and business around coffee.","zh":"与咖啡（饮品）、咖啡豆、咖啡店或咖啡相关的文化与产业有关的。"},"examples":[{"en":"We sell coffee-related products like grinders, filters, and mugs.","zh":"我们卖一些咖啡相关的产品，比如磨豆机、滤纸和马克杯。"},{"en":"She wrote a coffee-related article about espresso drinks and how to order them.","zh":"她写了一篇与咖啡有关的文章，内容是意式浓缩咖啡饮品以及如何点单。"},{"en":"The company offers coffee-related training for new baristas.","zh":"这家公司为新咖啡师提供咖啡相关的培训。"}]}],"synonyms":["coffee-associated","coffee-connected","coffee-focused"],"phonetic":"/ˈkɔfi rɪˌleɪtɪd/","extraExplanation":["“coffee-related”是由名词+related构成的复合形容词，常用连字符（hyphen）放在名词前作定语：coffee-related issues / coffee-related jobs。放在名词后作表语时有时也可不加连字符：The issues are coffee related（但加连字符更常见、更清晰）。"]}
{"word":"coffeeberries","summary":{"en":"Coffeeberries are the fruits of the coffee plant (coffee cherries) that contain the coffee beans inside.","zh":"Coffeeberries 指咖啡树的果实（咖啡樱桃），里面含有咖啡豆（种子）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the fruit of the coffee plant; the red or yellow “coffee cherry” that contains the coffee beans (seeds) inside","zh":"咖啡果；咖啡樱桃（咖啡树的果实，里面包着咖啡豆/种子）"},"examples":[{"en":"Coffee berries are picked when they turn deep red.","zh":"咖啡果变成深红色时就会被采摘。"},{"en":"Inside each coffee berry, there are usually two beans.","zh":"每颗咖啡果里通常有两粒咖啡豆。"},{"en":"Different processing methods change how the coffee berry’s sweetness shows up in the cup.","zh":"不同的处理法会影响咖啡果的甜感如何在风味中呈现。"}]}],"synonyms":["coffee cherries","coffee fruit","coffee cherry"],"phonetic":"/ˈkɔfi ˌbɛriz/","extraExplanation":["“coffee berry”更常见的说法是“coffee cherry”（咖啡樱桃），因为外形像樱桃；“berry”在日常英语里也常泛指小型多汁果实。","咖啡“豆”其实是种子：咖啡果的外层果皮与果肉被去除后，里面的两粒种子经过发酵、清洗/日晒、烘焙，才成为我们喝到的咖啡。","如果看到“cascara”，通常指咖啡果皮/果肉干燥后泡饮的原料（风味像果茶），与“coffee berries”同属咖啡果相关产物。"]}
{"word":"coffeeberry","summary":{"en":"Coffeeberry usually means the coffee plant’s fruit (coffee cherry), and it can also refer to a North American shrub called coffeeberry (Frangula californica).","zh":"coffeeberry 通常指咖啡树的果实（咖啡樱桃）；也可指北美一种叫“咖啡莓”的灌木/小乔木（Frangula californica）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the fruit (cherry) of the coffee plant; the dried outer fruit is sometimes used to make a tea-like drink (often called cascara)","zh":"咖啡樱桃（咖啡树的果实）；其干燥外果皮有时可用来泡成类似茶的饮品（常称为 cascara/咖啡果皮茶）"},"examples":[{"en":"Coffeeberries are picked when they turn red, then the beans are removed for roasting.","zh":"咖啡樱桃变红后会被采摘，然后取出咖啡豆进行烘焙。"},{"en":"Some cafés serve a drink made from dried coffeeberry skins.","zh":"一些咖啡馆会提供用干燥咖啡果皮做的饮品。"}]},{"partOfSpeech":"n.","definition":{"en":"a North American shrub or small tree known as coffeeberry (Frangula californica), often used in landscaping","zh":"北美一种被称为“咖啡莓”的灌木或小乔木（学名 Frangula californica），常用于园艺绿化"},"examples":[{"en":"Coffeeberry is a hardy native plant that can handle dry weather.","zh":"咖啡莓是一种耐旱的本土植物，能适应干燥天气。"},{"en":"They planted coffeeberry along the path because it stays green most of the year.","zh":"他们在小路旁种了咖啡莓，因为它一年大部分时间都保持常绿。"}]}],"synonyms":["coffee cherry","cascara (for the dried fruit/skin drink)","Frangula californica (plant name)"],"phonetic":"/ˈkɔfiˌbɛri/","extraExplanation":["“coffeeberry”在咖啡语境里通常指咖啡树的果实（咖啡樱桃），不是“咖啡豆”。咖啡豆其实是果实里面的种子。","用咖啡果皮/果肉干泡的饮品常见名称是西班牙语“cascara”。点单或读菜单时更可能看到 cascara，而不是 coffeeberry tea。","在园艺语境里，Coffeeberry（Frangula californica）是加州等地常见的本土植物名称，与咖啡树并非同一种植物；名字多来自其果实颜色与咖啡相似。"]}
{"word":"coffeebush","summary":{"en":"Coffeebush is a common name for a coffee plant, and in some regions it can also mean a different shrub called “wild coffee.”","zh":"coffeebush 常指咖啡树（咖啡属植物）；在一些地区也可指称为“野咖啡”的另一种灌木。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a coffee plant (genus Coffea), especially when it is grown as a shrub and produces coffee beans","zh":"咖啡树；咖啡灌木（咖啡属植物，结出咖啡豆）"},"examples":[{"en":"They grow coffeebush in the highlands where the weather is cool and wet.","zh":"他们在气候凉爽湿润的高地种植咖啡树。"},{"en":"The coffeebush started flowering after the rainy season.","zh":"雨季过后，这株咖啡树开始开花。"}]},{"partOfSpeech":"n.","definition":{"en":"a shrub called “wild coffee,” often referring to a coffeebush in the Americas (for example, a small ornamental shrub with red berries)","zh":"野咖啡灌木（美洲常见的俗名用法，常指一种观赏灌木，结红色果实）"},"examples":[{"en":"In Florida gardens, a native coffeebush is planted for its berries and shade tolerance.","zh":"在佛罗里达的花园里，人们会种本地的野咖啡灌木，因为它结果漂亮而且耐阴。"},{"en":"That coffeebush isn’t used to make coffee, but it attracts birds.","zh":"那种野咖啡灌木并不用来做咖啡，但很能吸引鸟类。"}]}],"synonyms":["coffee bush","coffee plant","Coffea (genus)","wild coffee (regional)"],"phonetic":"/ˈkɔfiˌbʊʃ/","extraExplanation":["“coffeebush”是一个常见名（俗名），不同地区可能指不同植物：有时就是指咖啡属（Coffea）的咖啡树；在部分美洲地区也可能指“wild coffee”（例如常见的观赏灌木）。看到这个词时，最好结合产地或学名确认。","拼写上也常写作 coffee bush（分开写）；含义通常不变。"]}
{"word":"coffeecake","summary":{"en":"Coffeecake is a sweet cake, often topped with crumbs, typically served with coffee or tea (not usually coffee-flavored).","zh":"Coffeecake 指一种甜蛋糕，常有酥粒表层，通常搭配咖啡或茶食用（一般不是咖啡口味）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sweet cake (often with a crumb topping) meant to be eaten with coffee or tea; it usually does not contain coffee flavor.","zh":"一种甜蛋糕（常有酥粒/碎屑表层），常搭配咖啡或茶一起吃；通常不含咖啡味。"},"examples":[{"en":"We had coffeecake with tea after lunch.","zh":"午饭后我们配茶吃了咖啡蛋糕。"},{"en":"She baked a cinnamon coffeecake with a crumb topping.","zh":"她烤了一个肉桂咖啡蛋糕，上面有酥粒。"},{"en":"In many American homes, coffeecake is a common weekend breakfast treat.","zh":"在很多美国家庭里，咖啡蛋糕是周末常见的早餐甜点。"}]}],"synonyms":["coffee cake","crumb cake","streusel cake"],"phonetic":"/ˈkɔfiˌkeɪk/","extraExplanation":["在美式英语里，coffeecake 的“coffee”主要表示“搭配咖啡吃”，而不是“咖啡口味”。真正带咖啡风味的甜点更常写作 coffee-flavored cake、espresso cake，或用 mocha（摩卡）来指咖啡+巧克力风味。","拼写上常见两种：coffee cake（更常见的写法，两个词）和 coffeecake（较少见但也能看到，尤其在菜单或商品名中）。"]}
{"word":"coffeecakes","summary":{"en":"Coffeecakes are sweet cakes or cake-like breads often eaten with coffee or tea (not necessarily made with coffee).","zh":"coffeecakes 指常配咖啡或茶吃的甜蛋糕/点心（不一定含咖啡）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sweet, cake-like bread (often with cinnamon, nuts, or fruit), usually served with coffee or tea.","zh":"咖啡蛋糕；一种偏甜的蛋糕/面包点心（常有肉桂、坚果或水果），通常配咖啡或茶一起吃。"},"examples":[{"en":"We brought coffeecakes to the office for breakfast.","zh":"我们带了咖啡蛋糕到办公室当早餐。"},{"en":"She served warm coffeecakes with tea in the afternoon.","zh":"她下午端上温热的咖啡蛋糕配茶。"}]}],"synonyms":["coffee cakes","streusel cake","cinnamon cake"],"phonetic":"/ˈkɔfiˌkeɪks/","extraExplanation":["在美式英语里，coffee cake 通常并不一定含有咖啡；它指“适合配咖啡吃的蛋糕/点心”。常见款式有上面撒糖酥粒（streusel）的肉桂咖啡蛋糕。","拼写上更常见的是 two words：coffee cake；复数是 coffee cakes。写成一个词 coffeecake/coffeecakes 也能见到，但较不正式或较少见。"]}
{"word":"coffeecup","summary":{"en":"A coffeecup is a small cup used for drinking coffee.","zh":"coffeecup 指用来喝咖啡的小杯子（咖啡杯）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small cup used for drinking coffee; often with a handle","zh":"咖啡杯；用来喝咖啡的小杯子（通常带把手）"},"examples":[{"en":"She poured the espresso into a small coffeecup.","zh":"她把浓缩咖啡倒进一个小咖啡杯里。"},{"en":"Please rinse your coffeecup and put it on the drying rack.","zh":"请把你的咖啡杯冲洗一下，然后放到晾干架上。"},{"en":"A plain white coffeecup sat beside his notebook.","zh":"一本笔记本旁边放着一个朴素的白色咖啡杯。"}]}],"synonyms":["coffee cup","cup","mug (usually larger)"],"phonetic":"/ˈkɔfi kʌp/","extraExplanation":["更常见的写法是分开写：coffee cup。合写 coffeecup 也能理解，但在正式写作中不如 coffee cup 常见。","在日常英语里，mug（马克杯）通常更大更厚；cup（杯子）往往更小、更偏向茶杯/咖啡杯的尺寸。"]}
{"word":"coffeegrower","summary":{"en":"A coffee grower is someone who grows coffee plants and produces coffee beans.","zh":"coffee grower 指种植咖啡树、生产咖啡豆的种植者/种植户。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or business that cultivates coffee plants and produces coffee cherries/beans.","zh":"咖啡种植者；咖啡种植户（种植咖啡树并生产咖啡果/咖啡豆的人或企业）"},"examples":[{"en":"Many coffee growers in Colombia depend on a good harvest each year.","zh":"哥伦比亚的许多咖啡种植户每年都依赖好收成。"},{"en":"The coffee grower sells fresh coffee cherries to a local cooperative.","zh":"这位咖啡种植者把新鲜咖啡果卖给当地合作社。"},{"en":"Consumers are learning more about the coffee grower behind each cup.","zh":"消费者正在更多了解每一杯咖啡背后的咖啡种植者。"}]}],"synonyms":["coffee farmer","coffee producer","coffee planter"],"phonetic":"/ˈkɔfi ˌɡroʊər/","extraExplanation":["“coffee grower”更常见的写法是分开写（coffee grower）。在咖啡产业语境里，你还会看到 farmer（农户）、producer（生产者）或 smallholder（小农户）等近义称呼，但它们强调点略不同：producer更常用于精品咖啡圈，smallholder强调规模较小的家庭农场。"]}
{"word":"coffeegrowing","summary":{"en":"Coffee-growing means “related to growing coffee” (adj.) or “the activity/business of growing coffee” (n.).","zh":"coffee-growing 指“与咖啡种植有关的”（形容词），也可指“咖啡种植这一活动/产业”（名词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to the cultivation of coffee plants, or to places/industries where coffee is produced.","zh":"与咖啡种植（栽培）有关的；指咖啡产区或咖啡产业的。"},"examples":[{"en":"She works in the coffee-growing region of Colombia.","zh":"她在哥伦比亚的咖啡种植区工作。"},{"en":"Climate change is affecting coffee-growing areas around the world.","zh":"气候变化正在影响世界各地的咖啡种植地区。"},{"en":"The company supports coffee-growing communities through fair trade.","zh":"这家公司通过公平贸易支持咖啡种植社区。"}]},{"partOfSpeech":"n.","definition":{"en":"The activity or business of growing coffee plants.","zh":"咖啡种植（作为一项活动或产业）。"},"examples":[{"en":"Coffee growing requires careful attention to altitude and rainfall.","zh":"咖啡种植需要仔细考虑海拔和降雨。"},{"en":"Many families depend on coffee growing for their income.","zh":"许多家庭依靠咖啡种植获得收入。"}]}],"synonyms":["coffee-producing","coffee-farming","coffee cultivation","coffee production"],"phonetic":"/ˈkɔfi ˌɡroʊɪŋ/","extraExplanation":["更常见的拼写是带连字符的 coffee-growing（作形容词），例如 coffee-growing regions（咖啡种植区）。不带连字符的 coffee growing 通常当作名词短语，表示“种咖啡这件事/产业”。","咖啡适合在“咖啡带（coffee belt）”生长：大致位于北回归线与南回归线之间的热带地区；因此 coffee-growing 常与国家或地区（如 Colombia, Ethiopia, Vietnam）一起出现。"]}
{"word":"coffeehouse","summary":{"en":"A coffeehouse is a café where people go to buy and drink coffee, often as a place to meet, talk, read, or work; historically, it was a key public meeting place for discussion.","zh":"coffeehouse 指咖啡馆/咖啡店：人们去买和喝咖啡，也常用来见面、聊天、阅读或工作；在历史上也指讨论新闻政治文学的重要公共聚会场所。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A café (often relaxed and informal) where people buy and drink coffee or other beverages, sometimes with light food, and may talk, work, or read.","zh":"咖啡馆；咖啡店（通常氛围轻松，可喝咖啡饮品，有时也提供简餐，人们会聊天、工作或阅读）。"},"examples":[{"en":"Let’s meet at the coffeehouse near the station.","zh":"我们在车站附近那家咖啡馆见吧。"},{"en":"She spent the afternoon studying in a quiet coffeehouse.","zh":"她在一家安静的咖啡馆学习了一下午。"},{"en":"The neighborhood coffeehouse serves great espresso and pastries.","zh":"这家社区咖啡馆的浓缩咖啡和点心很棒。"}]},{"partOfSpeech":"n.","definition":{"en":"Historically, a public place where people gathered to drink coffee and discuss news, politics, and literature.","zh":"（历史用法）咖啡馆（人们聚集饮咖啡、谈新闻、政治与文学的公共场所）。"},"examples":[{"en":"In the 1700s, coffeehouses were important places for debate and information.","zh":"在18世纪，咖啡馆是辩论与信息交流的重要场所。"},{"en":"Writers often met in coffeehouses to share ideas.","zh":"作家们常在咖啡馆聚会交流想法。"}]}],"synonyms":["café","coffee shop","cafeteria (sometimes)"],"phonetic":"/ˈkɔːfihaʊs/","extraExplanation":["“coffeehouse”和“café”在现代英语里常可互换，但“coffeehouse”更强调以咖啡为主、氛围偏休闲，也常让人联想到“坐下来聊/工作”的空间。","在英国与欧洲历史中，coffeehouse 一度是知识与商业信息流通的中心，被称为“便士大学”（penny university）：花一便士买咖啡，就能听到各种消息与讨论。","文学与文化里常把 coffeehouse 当作“公共社交空间”的象征：陌生人可以相遇、对话、辩论，也适合写作与观察人群。"]}
{"word":"coffeehoused","summary":{"en":"“Coffeehoused” is an informal, rare past form meaning someone spent time in a coffeehouse, often to meet or talk; sometimes it implies ideas discussed in cafés.","zh":"“coffeehoused”是较少见的非正式用法，常指（过去）在咖啡馆里待着社交/学习/工作；有时也暗指在咖啡馆里随意讨论出来的想法。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of “coffeehouse,” informal) Spent time in a coffeehouse, often to meet, talk, read, or work.","zh":"（“coffeehouse”的过去式/过去分词，非正式）在咖啡馆里消磨时间，常指去见人、聊天、阅读或工作。"},"examples":[{"en":"After class, we coffeehoused for an hour and planned our project.","zh":"下课后，我们在咖啡馆待了一个小时，商量项目。"},{"en":"She coffeehoused all afternoon, writing and sipping a latte.","zh":"她整个下午都在咖啡馆里，一边写作一边喝拿铁。"}]},{"partOfSpeech":"vt.","definition":{"en":"(informal, rare) Talked about something in a coffeehouse setting; discussed casually in cafés.","zh":"（非正式，较少见）在咖啡馆语境里谈论/讨论某事；指在咖啡馆里随意聊出来的讨论。"},"examples":[{"en":"The idea was first coffeehoused by students near campus.","zh":"这个想法最早是在校园附近的咖啡馆里被学生们聊出来的。"},{"en":"It was a coffeehoused debate, friendly but intense.","zh":"那是一场“咖啡馆式”的争论，友好但激烈。"}]}],"synonyms":["hung out at a coffee shop","met at a café","spent time in a café","café-hopped"],"phonetic":"ˈkɔfiˌhaʊzd","extraExplanation":["“coffeehoused”在现代英语里并不是常见标准词形，更常见的是名词“coffeehouse”（咖啡馆）或动词短语“hang out at a coffee shop / in a coffeehouse”。如果你是在阅读文学作品或旧报刊里看到它，它可能是作者为了风格而临时把名词动词化（noun→verb），表示“去咖啡馆社交/讨论”。","历史上（尤其17–18世纪英国）coffeehouse不仅是喝咖啡的地方，也是政治、文学与商业消息交流的公共空间，所以“coffeehouse/coffeehoused”有时会带一点“公共讨论、社交沙龙”的文化意味。"]}
{"word":"coffeehouses","summary":{"en":"Coffeehouses are places (plural) where people drink coffee and often sit to work, study, or socialize.","zh":"Coffeehouses 指“咖啡馆”（复数）：喝咖啡并常用于学习、工作或社交的地方。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of coffeehouse) A café where people buy and drink coffee and other drinks, often a casual place to sit, work, or meet others.","zh":"（coffeehouse 的复数）咖啡馆：人们购买并饮用咖啡等饮品的地方，常用于休息、工作或会面。"},"examples":[{"en":"Many coffeehouses offer free Wi‑Fi and a quiet place to study.","zh":"许多咖啡馆提供免费 Wi‑Fi 和安静的学习环境。"},{"en":"In big cities, coffeehouses can be popular meeting spots for friends and coworkers.","zh":"在大城市里，咖啡馆常是朋友和同事见面的热门地点。"}]}],"synonyms":["cafés","coffee shops"],"phonetic":"/ˈkɔːfiˌhaʊs/","extraExplanation":["“Coffeehouse”在英语里通常偏“较传统/偏文化社交空间”的感觉；现代日常口语里也常用“café”或“coffee shop”。","历史上，17–18世纪的欧洲（尤其是英国）coffeehouse 常被视为交流新闻、商业与思想的公共空间，有时被称为“penny universities”（花一便士就能听到各种讨论）。"]}
{"word":"coffeehousing","summary":{"en":"“Coffeehousing” is an uncommon term related to spending time in coffee shops/coffeehouses, or (rarely) creating/managing coffee-serving spaces.","zh":"“coffeehousing”较不常见，可指“泡咖啡馆”的习惯；少见情况下也可指打造/管理咖啡服务空间。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon) The activity or habit of spending time in coffeehouses (coffee shops), often to socialize, study, or work.","zh":"（不常见）在咖啡馆（咖啡店）消磨时间的活动或习惯，常用于社交、学习或工作。"},"examples":[{"en":"In college, coffeehousing became part of her daily routine—she did homework at the café every afternoon.","zh":"上大学时，“泡咖啡馆”成了她的日常——她每天下午都在咖啡店写作业。"},{"en":"The city’s new students are coffeehousing more than ever because cafés have free Wi‑Fi and quiet corners.","zh":"这座城市的新学生比以往更爱“泡咖啡馆”，因为咖啡店有免费 Wi‑Fi 和安静的角落。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare/industry) The providing, design, or management of spaces meant for coffee service (e.g., café areas inside offices, stores, or apartment buildings).","zh":"（罕见/行业用法）为咖啡供应而设置、设计或管理空间（如办公室、商场或公寓楼内的咖啡区）。"},"examples":[{"en":"The company invested in coffeehousing to create a small café area for employees and visitors.","zh":"公司投入“咖啡空间配置”，为员工和访客打造了一个小型咖啡区。"},{"en":"Modern apartment complexes sometimes include coffeehousing—lobby cafés that feel like community hubs.","zh":"现代公寓楼有时会设置“咖啡配套空间”——大堂里的咖啡店，让人感觉像社区中心。"}]}],"synonyms":["hanging out at a coffee shop","café culture","coffeehouse life"],"phonetic":"/ˈkɔfiˌhaʊzɪŋ/","extraExplanation":["“coffeehousing”不是非常标准、常见的英语词。更自然的表达通常是：\n- “hanging out at a coffeehouse / coffee shop”（在咖啡馆待着/泡咖啡馆）\n- “café culture”（咖啡馆文化）\n- “coffeehouse”本身指“咖啡馆”（更常用）\n如果你是想表达“咖啡馆/咖啡店”，建议直接用“coffeehouse”或“coffee shop”。"]}
{"word":"coffeeleaf","summary":{"en":"A coffeeleaf is a leaf from the coffee plant, often mentioned when used for brewing or as an ingredient.","zh":"coffeeleaf 指咖啡树的叶子，常用于描述其作为冲泡或食用原料时的用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a leaf from the coffee plant, especially when used as an ingredient (for example, to make a drink such as coffee-leaf tea).","zh":"咖啡树的叶子；尤指作为原料使用的咖啡叶（例如用来泡咖啡叶茶）。"},"examples":[{"en":"Coffee leaves can be dried and brewed like tea.","zh":"咖啡叶可以晒干后像茶一样冲泡。"},{"en":"The farmer showed us the coffeeleaf and the coffee cherries growing on the same branch.","zh":"农场主给我们看同一根枝条上生长的咖啡叶和咖啡果。"}]}],"synonyms":["coffee leaf","leaf of the coffee plant"],"phonetic":"/ˈkɔfi lif/","extraExplanation":["“coffee leaf”更常见的写法是分开写（coffee leaf / coffee leaves）。写成一个词“coffeeleaf”多见于品牌名、产品名或特定语境中的合成词。","一些地区有饮用“咖啡叶茶（coffee-leaf tea / coffee leaf tea）”的传统，味道通常更接近草本茶而不是咖啡豆冲煮的咖啡；咖啡因含量也往往低于普通咖啡（但会因品种与冲泡方式而变化）。"]}
{"word":"coffeemaker","summary":{"en":"A coffeemaker is a device used to brew coffee, especially an electric drip machine.","zh":"coffeemaker 指用来冲煮咖啡的器具，常见为家用电动滴滤咖啡机。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A machine or device used to brew coffee.","zh":"咖啡机；咖啡壶（用来冲煮咖啡的机器或器具）"},"examples":[{"en":"I set the coffeemaker to start at 7 a.m. so the coffee is ready when I wake up.","zh":"我把咖啡机设定在早上7点开始工作，这样我起床时咖啡就好了。"},{"en":"Our coffeemaker stopped working, so we made coffee with a French press.","zh":"我们的咖啡机坏了，所以我们用法压壶来煮咖啡。"},{"en":"Please clean the coffeemaker regularly to keep the coffee tasting fresh.","zh":"请定期清洗咖啡机，让咖啡保持新鲜好喝。"}]}],"synonyms":["coffee maker","coffee machine","drip coffee maker"],"phonetic":"/ˈkɔːfiˌmeɪkɚ/"}
{"word":"coffeeman","summary":{"en":"“Coffeeman” is an informal/nonstandard form meaning a coffee seller/server or a man known for loving coffee.","zh":"“coffeeman”是非正式/非标准写法，常指卖/端咖啡的人，或以爱喝咖啡出名的男性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, not standard as one word) A man who sells or serves coffee, or someone known for liking coffee a lot.","zh":"（非正式；通常不写成一个词）卖/端咖啡的人（如咖啡师、咖啡摊贩），或以很爱喝咖啡而出名的人。"},"examples":[{"en":"The coffee man comes by the office every morning with a cart.","zh":"那个卖咖啡的人每天早上推着小车来办公室。"},{"en":"At school they call him “Coffee Man” because he always has a cup in his hand.","zh":"在学校大家叫他“咖啡男”，因为他总是手里拿着一杯咖啡。"}]}],"synonyms":["barista","coffee vendor","coffee seller","coffee lover","coffee addict"],"phonetic":"/ˈkɔfi mæn/","extraExplanation":["“coffeeman”更常见的写法是两个词：coffee man；作为外号/网名时也可能写成一个词。正式写作里建议用更明确的词：barista（咖啡师）、coffee vendor/seller（咖啡摊贩/卖咖啡的人）、coffee lover（咖啡爱好者）。"]}
{"word":"coffeepot","summary":{"en":"A coffeepot is a pot used to brew or hold coffee for serving, often part of a coffee maker.","zh":"coffeepot 指用于煮咖啡或盛装并倒咖啡的咖啡壶，常是咖啡机的壶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A pot or container used to brew and/or serve coffee, often part of a coffee maker.","zh":"咖啡壶；用于煮咖啡和/或盛装、倒咖啡的壶（常是咖啡机的一部分）。"},"examples":[{"en":"There’s fresh coffee in the coffeepot.","zh":"咖啡壶里有新煮好的咖啡。"},{"en":"Please rinse the coffeepot after you use it.","zh":"用完咖啡壶后请把它冲洗一下。"},{"en":"The glass coffeepot cracked because it got too hot.","zh":"玻璃咖啡壶因为太热而裂了。"}]}],"synonyms":["coffee pot","carafe"],"phonetic":"/ˈkɔːfiˌpɑːt/","extraExplanation":["“coffeepot”在美式英语里常写作一个词（coffeepot），也常见两词写法“coffee pot”。两种都能理解与使用；在产品说明或日常写作里两种拼写都很常见。","在美国办公文化中，“coffeepot”也常让人联想到办公室茶水间（break room）里那种大玻璃壶或保温壶，和“coffee break（咖啡休息时间）”的场景有关。"]}
{"word":"coffeepots","summary":{"en":"“Coffeepots” means more than one coffee pot—containers used to brew or serve coffee.","zh":"“coffeepots”是“咖啡壶”的复数，指用于冲泡或盛装、倒出咖啡的壶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of coffee pot: containers used to brew or serve coffee.","zh":"coffee pot（咖啡壶）的复数：用于冲泡或盛装、倒出咖啡的壶。"},"examples":[{"en":"The hotel breakfast area has several coffeepots on the counter.","zh":"酒店早餐区的台面上放着好几个咖啡壶。"},{"en":"Please wash the coffeepots after the meeting.","zh":"会议结束后请把咖啡壶洗一下。"}]},{"partOfSpeech":"n.","definition":{"en":"(By extension) The kinds or models of coffee pots used in a place or for a purpose.","zh":"（引申）某个地方或某种用途所使用的咖啡壶种类/型号。"},"examples":[{"en":"In the kitchen aisle, they sell coffeepots for drip coffee and for stovetops.","zh":"在厨房用品区，他们卖滴滤式和炉灶式的咖啡壶。"}]}],"synonyms":["coffee pots","coffee urns (large ones)","carafes (often for serving)"],"phonetic":"/ˈkɔfiˌpɑts/","extraExplanation":["“coffee pot”是复合名词（coffee + pot），写作一个词更常见：coffeepot（也常见拼写 coffee pot）。复数通常加 -s：coffeepots / coffee pots。"]}
{"word":"coffeeroom","summary":{"en":"A coffee room is a place where people drink coffee and take breaks, especially at work.","zh":"coffee room 指人们喝咖啡、休息的地方，尤其常见于工作场所。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A room (especially in a workplace, school, or public building) where people can get coffee/tea and take short breaks, often with a small kitchen area.","zh":"（尤指办公室、学校或公共建筑里的）茶水间/咖啡休息室：人们可以喝咖啡或茶、短暂休息的房间，通常带有简易厨房区域。"},"examples":[{"en":"I’ll meet you in the coffee room after the meeting.","zh":"会议结束后我们在茶水间见。"},{"en":"There’s a microwave and a fridge in the coffee room.","zh":"茶水间里有微波炉和冰箱。"},{"en":"Office news spreads fast in the coffee room.","zh":"办公室的消息在茶水间传得很快。"}]},{"partOfSpeech":"n.","definition":{"en":"A room in a hotel, club, or restaurant area where coffee and light snacks are served (more common in British usage).","zh":"（酒店、俱乐部等的）咖啡室/咖啡厅（常指提供咖啡和简餐的房间；此用法更偏英式）。"},"examples":[{"en":"Breakfast is served in the coffee room from 7 to 10.","zh":"早餐在咖啡室7点到10点供应。"},{"en":"They had tea and cake in the coffee room.","zh":"他们在咖啡室喝茶吃蛋糕。"}]}],"synonyms":["break room","staff room","lounge","cafeteria"],"phonetic":"/ˈkɔfi ˌrum/","extraExplanation":["“coffee room”常写作两个词 coffee room；也可能写作 coffeeroom（较少见）或 coffee-room（较旧式）。在美式英语里，办公场景更常说 break room 或 staff room。"]}
{"word":"coffees","summary":{"en":"“Coffees” means multiple cups/servings of coffee, or different kinds of coffee.","zh":"“coffees”表示多杯/多份咖啡，或不同种类的咖啡。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of coffee: more than one cup or serving of coffee (a drink made from roasted coffee beans).","zh":"coffee 的复数：两杯/多份咖啡（由烘焙咖啡豆制成的饮品）。"},"examples":[{"en":"Two coffees, please.","zh":"请给我两杯咖啡。"},{"en":"We ordered coffees after dinner.","zh":"我们晚饭后点了咖啡。"},{"en":"They brought the coffees to our table.","zh":"他们把咖啡端到了我们桌上。"}]},{"partOfSpeech":"n.","definition":{"en":"Different kinds or styles of coffee (used when talking about varieties).","zh":"不同种类/风味/做法的咖啡（用于谈论品种或类型）。"},"examples":[{"en":"The shop sells coffees from Ethiopia and Colombia.","zh":"这家店卖埃塞俄比亚和哥伦比亚的咖啡。"},{"en":"I like light-roast coffees for their fruity taste.","zh":"我喜欢浅烘焙咖啡，因为它有果香。"}]}],"synonyms":["cups of coffee","coffee drinks","coffee varieties","brews"],"phonetic":"/ˈkɔfi/","extraExplanation":["在英文里，coffee 通常是不可数名词（I like coffee 我喜欢喝咖啡）。但在点单或强调“几杯/几份”时，会把它当作可数名词使用：a coffee / two coffees。","“coffees”也常用于说“不同产地或风味的咖啡豆/咖啡饮品类型”（varieties）：specialty coffees 精品咖啡。"]}
{"word":"coffeetime","summary":{"en":"“Coffee time” means a short break to drink coffee, or the time you usually drink coffee.","zh":"“coffee time”指喝咖啡的休息时间，也可指你习惯喝咖啡的那个时间段。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a time set aside to drink coffee and take a short break (often at work or during an event)","zh":"（通常在工作或活动中）专门用来喝咖啡、短暂休息的时间（咖啡休息时间）"},"examples":[{"en":"Let’s take coffee time at 10:30.","zh":"我们10:30去喝咖啡休息一下吧。"},{"en":"During coffee time, people chatted and relaxed.","zh":"咖啡时间里，大家聊天放松。"}]},{"partOfSpeech":"phrase","definition":{"en":"the time when someone usually drinks coffee (a personal habit or routine)","zh":"（个人习惯）通常喝咖啡的时间"},"examples":[{"en":"After lunch is my coffee time.","zh":"午饭后是我喝咖啡的时间。"},{"en":"She protects her coffee time—no meetings allowed.","zh":"她很重视自己的咖啡时间——不安排开会。"}]}],"synonyms":["coffee break","tea break","break time","coffee hour"],"phonetic":"/ˈkɔfi taɪm/","extraExplanation":["“coffee time”常见写法是分开写作 coffee time；也常用更固定的说法 coffee break（咖啡休息）。在英美职场文化里，coffee break 通常指短暂的非正式休息时间，用来补充精力、社交寒暄。","在北欧文化中也有类似概念，例如瑞典的 “fika”（咖啡+点心+社交的固定休息），语气上更强调放慢节奏与人际交流。"]}
{"word":"Coffeeville","summary":{"en":"Coffeeville is a U.S. place name for more than one town/community; the exact one depends on context.","zh":"Coffeeville 是美国多个城镇/社区的地名；具体指哪个地点要看语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name (proper noun) used for several towns/communities in the United States; which specific location it refers to depends on context (e.g., Coffeeville, Mississippi / Alabama / Kansas).","zh":"（专有名词）美国多个城镇/社区的地名；具体指哪一个“Coffeeville”要看语境（如密西西比州/阿拉巴马州/堪萨斯州的 Coffeeville）。"},"examples":[{"en":"My grandparents live near Coffeeville, Mississippi.","zh":"我祖父母住在密西西比州 Coffeeville 附近。"},{"en":"We drove through Coffeeville on our way to the lake.","zh":"我们去湖边的路上开车经过了 Coffeeville。"}]}],"phonetic":"/ˈkɔfiˌvɪl/","extraExplanation":["“Coffeeville”属于典型的美式地名构词：Coffee（咖啡）+ -ville（“小镇、城镇”），类似的地名还有 Clarksville、Jacksonville。很多“-ville”地名来源于早期定居点的命名习惯，可能与当地商店、邮局、种植/贸易、或人物姓氏等有关，但每个 Coffeeville 的具体来历不一定相同。","作为地名使用时，通常首字母大写（Coffeeville），口语或写作中常加州名/县名来避免混淆：Coffeeville, MS / Coffeeville, Alabama 等。"]}
{"word":"coffeeweed","summary":{"en":"Coffeeweed is a weedy plant (often coffee senna) sometimes linked to a coffee-like drink made from roasted seeds.","zh":"Coffeeweed 指一种杂草类植物（常指咖啡决明/咖啡野决明），其种子曾被用来烘烤制作类似咖啡的饮品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a common name for certain weedy plants (especially coffee senna) whose roasted seeds have sometimes been used as a coffee substitute.","zh":"（俗名）指某些杂草类植物（尤指“咖啡决明/咖啡野决明”），其种子有时会被烘烤后当作咖啡替代品。"},"examples":[{"en":"In some rural areas, people once roasted coffeeweed seeds to make a bitter drink.","zh":"在一些乡村地区，人们曾把咖啡weed的种子烘烤后做成一种苦味饮料。"},{"en":"The field was full of coffeeweed, so the farmer planned to remove it before planting.","zh":"田里长满了coffeeweed，所以农民打算在播种前把它清除。"}]}],"synonyms":["coffee senna","coffee senna plant","Senna occidentalis"],"phonetic":"/ˈkɔfiˌwid/","extraExplanation":["“coffeeweed”多用于日常或农业语境里的俗名，并不是严格的单一物种名称；在北美语境中常指 coffee senna（学名 *Senna occidentalis*），在其他地区也可能指近似的决明属/山扁豆属植物。","需要注意：有些“coffeeweed/coffee senna”相关植物对牲畜（尤其牛马）可能有毒，误食会造成健康风险；因此不要因为名字里有“coffee”就随意食用或当作饮品原料。"]}
{"word":"coffeewood","summary":{"en":"Coffeewood is wood from the coffee plant, used for items like chews, decor, or smoking/grilling.","zh":"Coffeewood 指咖啡树的木材，可用于咬棒、装饰或熏烤等用途。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"wood from the coffee plant (coffee tree/shrub), used for things like small woodworking items, smoking/grilling, or pet/aquarium products.","zh":"咖啡树（咖啡灌木）所产的木材；可用于小型木作、熏烤、或宠物/水族用品等。"},"examples":[{"en":"The shop sells coffeewood sticks as natural chews for dogs.","zh":"这家店卖咖啡木棒，作为狗狗的天然磨牙咬棒。"},{"en":"Some people use coffeewood for smoking meat because it gives a mild aroma.","zh":"有人用咖啡木来熏肉，因为香气比较温和。"},{"en":"This bowl is carved from coffeewood.","zh":"这个碗是用咖啡木雕出来的。"}]}],"synonyms":["coffee wood","coffee-tree wood"],"phonetic":"/ˈkɔfiˌwʊd/","extraExplanation":["“coffeewood”通常写作一个词或两词（coffee wood）。它不是“有咖啡味的木头”，而是“咖啡树的木材”。常见于宠物用品（咬棒）与水族用品（沉木/装饰）等商业语境；作为燃木/烟熏木使用时，不同商家会强调其气味较淡、略带甜香。"]}
{"word":"coffer","summary":{"en":"Coffer means a strong box for valuables (and “coffers” can mean a treasury), or an architectural recessed panel in a ceiling.","zh":"coffer 指存放贵重物品的箱柜（复数 coffers 常指国库/资金），也可指建筑中的天花板凹格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strong box or chest used to store valuable things such as money or documents; a treasury or store of funds.","zh":"保险箱；（放钱或贵重物品的）箱柜；（常用复数）金库、资金储备。"},"examples":[{"en":"The old coins were locked in a wooden coffer.","zh":"那些旧硬币被锁在一个木制保险箱里。"},{"en":"The museum kept the rare letters in a secure coffer.","zh":"博物馆把那些珍贵信件保存在一个安全的箱柜里。"},{"en":"Public coffers are low this year, so the city cut spending.","zh":"今年公共财政吃紧，所以城市削减了开支。"}]},{"partOfSpeech":"n.","definition":{"en":"A recessed panel (a sunken square or shape) in a ceiling or vault; also used in architecture and design.","zh":"（建筑）天花板或拱顶上的凹格、格板（coffered ceiling 指有凹格装饰的天花板）。"},"examples":[{"en":"The hall had a coffered ceiling with deep rectangular coffers.","zh":"大厅的天花板是凹格装饰的，凹格很深而且呈长方形。"},{"en":"Light and shadow made each coffer stand out.","zh":"光影让每个凹格都更立体醒目。"}]}],"synonyms":["chest","strongbox","treasury","vault","recessed panel"],"phonetic":"/ˈkɔfɚ/","extraExplanation":["“coffer”来自古法语，和“箱子、容器”有关。在现代英语里，单数常指“装贵重物品的箱”，而复数“coffers”非常常见，常用来比喻“国库/公共资金/组织资金”（例如 public coffers, company coffers）。","建筑义的 coffer 常出现在“coffered ceiling（凹格天花板）”里，古罗马与文艺复兴建筑里很常见；它既能减轻结构重量，也能增加装饰效果。"]}
{"word":"cofferdam","summary":{"en":"A cofferdam is a temporary watertight enclosure used to keep water out of a construction area so work can be done dry.","zh":"cofferdam 指“临时围堰”，用来隔水并抽排，使施工区域保持干燥。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A temporary watertight barrier built in water (or soft ground) so workers can pump out the water and build or repair structures in a dry area.","zh":"（临时）围堰：在水中（或软弱地基中）修建的防水围护结构，用来把水隔开并抽干，以便在干燥环境中施工或维修。"},"examples":[{"en":"Engineers built a cofferdam around the bridge pier so the foundation could be poured in the dry.","zh":"工程师在桥墩周围修建围堰，这样就能在干燥条件下浇筑基础。"},{"en":"After the cofferdam was sealed, pumps removed the water from inside the work area.","zh":"围堰封闭后，水泵把施工区域内的水抽走。"}]}],"synonyms":["temporary dam","enclosure","water barrier"],"phonetic":"/ˈkɔfərˌdæm/","extraExplanation":["词源提示：coffer- 有“箱子、容器”的意思，dam 是“坝、堤”。cofferdam 字面上像“箱形的坝”，形象地表达“围出一个封闭空间来挡水”。","使用场景：常见于桥梁墩台、码头、船闸、海上/河道基础施工等工程语境，是偏专业的土木/水利工程词汇。"]}
{"word":"cofferdams","summary":{"en":"Cofferdams are temporary watertight structures that block water so construction can be done in a dry area.","zh":"Cofferdams（围堰）是临时防水围护结构，用来阻水排水，使施工能在干燥区域进行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a temporary watertight enclosure built in water or wet ground so workers can pump the water out and build or repair something (like a bridge pier) in dry conditions","zh":"（在水中或湿地建的）围堰；临时防水围护结构，用于排水后在干燥环境中施工或维修（如桥墩）"},"examples":[{"en":"Workers built cofferdams around the bridge foundations so they could pour concrete in the dry.","zh":"工人们在桥梁基础周围修建围堰，这样就能在干燥环境下浇筑混凝土。"},{"en":"The project needed two cofferdams to keep the river from flooding the construction site.","zh":"该工程需要两道围堰，以防河水淹没施工现场。"}]}],"synonyms":["temporary dam","water barrier","enclosure","sheet-pile enclosure"],"phonetic":"/ˈkɔfɚˌdæm/","extraExplanation":["“cofferdam”常见于土木工程与水利工程语境：先用钢板桩、土袋或混凝土等围出一块区域，再把里面的水抽干（dewater），形成可施工的“干作业面”。","词形：cofferdams 是复数；单数是 cofferdam。日常英语里不常用，多见于新闻报道、工程说明、纪录片等。"]}
{"word":"coffered","summary":{"en":"Coffered describes a ceiling or surface with recessed (sunken) panels, often in a grid pattern.","zh":"coffered 指天花板或表面带有规则凹陷格槽（凹格板）装饰的样式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Architecture) Having a pattern of sunken panels (coffers), especially in a ceiling, vault, or dome; “coffered” describes that recessed, box-like panel design.","zh":"（建筑）带有格槽/凹格板装饰的；尤指天花板、拱顶或穹顶上呈现规则凹陷方格（或多边形）面板的设计。"},"examples":[{"en":"The living room has a coffered ceiling with soft lighting in each panel.","zh":"客厅有一个格槽天花板，每个凹格里都装了柔和的灯。"},{"en":"In the museum, the coffered dome draws your eyes upward.","zh":"在博物馆里，格槽穹顶会把人的视线吸引向上。"},{"en":"They chose coffered woodwork to add depth and elegance to the room.","zh":"他们选用了格槽木作，让房间更有层次感也更显雅致。"}]}],"synonyms":["paneled","recessed-panel","sunken-panel","lacunar"],"phonetic":"/ˈkɔfɚd/","extraExplanation":["“coffered”来自名词“coffer”（在建筑语境中指“凹格板/格槽”），常见搭配是 coffered ceiling（格槽天花板）与 coffered dome（格槽穹顶）。这种设计在古罗马与文艺复兴建筑中很常见，不仅装饰性强，也能在视觉上减轻顶面的“厚重感”。","学习提示：不要把它和“coffin（棺材）”混淆；两者拼写和发音相近，但含义完全不同。"]}
{"word":"cofferer","summary":{"en":"Cofferer is an old word for a keeper of funds or a treasurer, especially as a historical British royal household officer.","zh":"cofferer 是古语，指管钱箱/资金的人（类似司库、财务主管），也可指英国王室历史上的“王室家政财务官”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who keeps or manages money in a chest (a “coffer”); a treasurer or keeper of funds (old-fashioned).","zh":"（古语）管理钱箱（coffer）的人；财务主管、管库人。"},"examples":[{"en":"In old records, the cofferer was responsible for guarding the household’s funds.","zh":"在一些旧档案中，cofferer 负责看管家中的资金。"},{"en":"The cofferer recorded every payment and kept the money safe.","zh":"cofferer 记录每一笔付款，并把钱妥善保管。"}]},{"partOfSpeech":"n.","definition":{"en":"(British history) An official title: the Cofferer of the Household, a royal court officer who handled parts of the monarch’s household finances (historical).","zh":"（英国史）一个官职：王室家政财务官（Cofferer of the Household），负责处理君主宫廷家务开支的部分财务事务（历史用语）。"},"examples":[{"en":"He served as Cofferer of the Household during the reign of George II.","zh":"他在乔治二世统治时期担任过王室家政财务官。"},{"en":"The post of cofferer appears in lists of royal household offices.","zh":"在王室家政官职名单中可以看到 cofferer 这一职位。"}]}],"synonyms":["treasurer","keeper","paymaster","steward"],"phonetic":"/ˈkɔfərər/","extraExplanation":["“coffer”原指装钱或贵重物品的箱子（钱箱、保险箱一类），所以“cofferer”字面意思就是“管钱箱的人”。现代英语里这个词很少见，多出现在历史语境或旧文献中。","在英国王室体系中，Cofferer of the Household 曾是较重要的宫廷财务相关职位之一；如今属于历史名目，阅读历史书或传记时可能会遇到。"]}
{"word":"cofferfish","summary":{"en":"A cofferfish is a tropical reef fish with a hard, box-like body.","zh":"cofferfish 指一种身体像箱子、有硬骨甲的热带珊瑚礁海鱼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical marine fish with a hard, box-shaped body (a bony “armor”), often found around coral reefs; also called a type of boxfish/trunkfish","zh":"（热带）箱鲀类海鱼，身体外有坚硬的箱状骨甲，常见于珊瑚礁附近；也可指箱鲀/躄鱼（trunkfish）一类"},"examples":[{"en":"We spotted a yellow cofferfish drifting slowly near the coral reef.","zh":"我们在珊瑚礁旁看到一条黄色的箱鲀慢慢漂着。"},{"en":"Because of its rigid body, a cofferfish looks like it swims by “paddling” its fins.","zh":"由于身体很硬，箱鲀游动时看起来像在用鱼鳍“划水”。"}]}],"synonyms":["boxfish","trunkfish"],"phonetic":"/ˈkɔfɚˌfɪʃ/","extraExplanation":["“coffer-”在英语里有“箱子、匣子”的意思（coffer = 保险箱/宝箱/钱箱），因此 cofferfish 直译就是“箱子鱼”，形容它像小盒子一样的外形。","日常英语里更常见的相关词是 boxfish 和 trunkfish；不同地区可能把相近的种类都叫 cofferfish。"]}
{"word":"coffering","summary":{"en":"Coffering most commonly means decorative sunken panels in a ceiling or dome (coffered design). Less commonly, it can mean storing valuables in a coffer.","zh":"coffering最常指天花板或穹顶上的凹格装饰（格槽式设计）；较少见时可指把贵重物品存入箱柜/金库的行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"sunken decorative panels (often square or octagonal) in a ceiling, dome, or vault; this style of paneling as a whole","zh":"（天花板、穹顶或拱顶上的）凹格装饰板；格槽式天花/穹顶装饰（总称）"},"examples":[{"en":"The old church has beautiful coffering in the ceiling.","zh":"这座老教堂的天花板上有很漂亮的凹格装饰。"},{"en":"Coffering can make a large ceiling feel more detailed and less flat.","zh":"凹格装饰能让大面积天花板看起来更有细节、不那么单调。"},{"en":"The dome’s coffering draws your eyes upward.","zh":"穹顶的凹格装饰会把你的视线上引。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of putting money or valuables into a coffer (a strong box); storing away","zh":"把钱财或贵重物品放入金库/保险箱；收藏、存放"},"examples":[{"en":"In old stories, coffering gold was a sign of wealth and power.","zh":"在一些古老故事里，把金子收进金库象征着财富与权力。"},{"en":"They were accused of coffering public funds for private use.","zh":"他们被指控把公款私存（收进“自家金库”）。"}]}],"synonyms":["coffered panels","sunken panels","paneling","vault decoration"],"phonetic":"/ˈkɔfərɪŋ/","extraExplanation":["“coffering”在建筑语境中最常见，常用来形容“coffered ceiling（格槽天花）”。经典例子包括罗马万神殿（Pantheon）穹顶的coffers（凹格），既装饰也能在视觉上减轻厚重感。","词源上与“coffer（箱柜、金库）”同源，来自法语/拉丁语系表示“箱子、柜子”的词，因此也引申出“把东西收进箱柜里”的含义（较少见，多见于文学或正式表达）。"]}
{"word":"cofferlike","summary":{"en":"“Cofferlike” means chest-like or resembling a strongbox in shape or appearance.","zh":"“cofferlike”表示“像箱柜/保险箱一样的；箱状的、柜状的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a coffer (a strongbox or chest), especially in shape—boxy, chest-like, or lid-like.","zh":"像保险箱/箱柜（coffer）的；（外形）箱状的、柜状的，像带盖箱子的。"},"examples":[{"en":"The ancient tomb had a cofferlike stone lid that fit tightly over the opening.","zh":"那座古墓有一个像箱盖一样的石盖，严丝合缝地盖住入口。"},{"en":"A cofferlike cabinet sat in the corner, heavy and plain.","zh":"角落里放着一个箱柜似的柜子，沉重而朴素。"}]}],"synonyms":["chest-like","boxlike","case-like","coffinlike"],"phonetic":"/ˈkɔfɚˌlaɪk/","extraExplanation":["“cofferlike”是由名词“coffer”（箱柜、保险箱、金库）+ “-like”（像……的）构成的形容词，多见于描写外观或结构的文学/考古/建筑语境。","“coffer”还可以指“国库/金库”（the public coffers），但“cofferlike”通常说的是“外形像箱子”，不常用来形容“资金”概念。"]}
{"word":"coffers","summary":{"en":"Coffers means a fund or treasury—money kept for an organization or government (often used in the plural).","zh":"coffers 指“金库/财库、资金储备”，常用于复数形式，尤指机构或政府的资金。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A place (or supply) where money is kept, especially money belonging to a government, organization, or household.","zh":"（尤指政府、机构或家庭的）金库；资金储备（放钱的地方或钱本身）。"},"examples":[{"en":"The city’s coffers are nearly empty after the disaster response.","zh":"灾后应对开支巨大，市政府的金库几乎见底。"},{"en":"Donations helped refill the charity’s coffers.","zh":"捐款帮助慈善机构补充了资金。"}]},{"partOfSpeech":"n.","definition":{"en":"A strongbox or chest for storing valuables (an older, more literal meaning).","zh":"（较古老、字面义）存放贵重物品的箱子/柜子。"},"examples":[{"en":"He locked the letters in a small coffer.","zh":"他把信锁进了一个小箱子里。"}]}],"synonyms":["treasury","funds","reserves","public purse"],"phonetic":"/ˈkɔfɚz/","extraExplanation":["“coffers”常以复数形式出现，尤其在新闻和正式语境中（如 public coffers “国库/公共财政”）。语感上比“money”更正式、更像“资金池/财政状况”。","词源上与“coffer（箱柜）”有关，因此从“装钱的箱子”引申为“资金/财库”。在文学或历史叙述中更常见。"]}
{"word":"cofferwork","summary":{"en":"Cofferwork is decorative ceiling or vault design made from repeated sunken panels (coffers).","zh":"Cofferwork 指由重复的凹格（格槽）构成的天花板或拱顶装饰结构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"decorative architectural work made of coffers (sunken panels), especially in a ceiling or vault; coffering.","zh":"（建筑）格槽装饰；由“格槽/凹格”（coffers，天花板或拱顶上的下沉式方格/多边形格）构成的装饰结构，常见于格槽天花板或拱顶。"},"examples":[{"en":"The museum’s main hall features cofferwork that makes the ceiling feel deeper and more formal.","zh":"博物馆主厅的格槽装饰让天花板看起来更有层次、更庄重。"},{"en":"Restorers cleaned the stone cofferwork carefully to preserve the original pattern.","zh":"修复人员小心清洁石质格槽装饰，以保留原有图案。"}]}],"synonyms":["coffering","a coffered ceiling","coffered work"],"phonetic":"/ˈkɔfɚˌwɝk/","extraExplanation":["“cofferwork”多用于建筑与艺术史语境，日常英语里更常见的说法是“a coffered ceiling”（格槽天花板）或“coffering”。","格槽（coffers）最早可追溯到古罗马与文艺复兴建筑中：一方面减轻顶面重量，另一方面通过重复的几何凹格营造秩序感与仪式感。","相关搭配：coffered ceiling（格槽天花板）、coffered vault（格槽拱顶）、sunken panel（凹格/凹板）。"]}
{"word":"Coffey","summary":{"en":"Coffey is most commonly a surname, and it can also be a U.S. place name (e.g., Coffey County).","zh":"Coffey 最常见的是姓氏；也可作美国地名（如 Coffey County）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), common in Ireland and among Irish descendants","zh":"（常见于爱尔兰及其移民后裔的）姓氏"},"examples":[{"en":"Ms. Coffey will lead today’s meeting.","zh":"Coffey 女士将主持今天的会议。"},{"en":"My neighbor’s last name is Coffey.","zh":"我邻居的姓是 Coffey。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name in the U.S. (for example, Coffey County in Kansas)","zh":"（美国的）地名（例如堪萨斯州的 Coffey County）"},"examples":[{"en":"He grew up in Coffey County, Kansas.","zh":"他在堪萨斯州的 Coffey County 长大。"},{"en":"The storm moved across Coffey County overnight.","zh":"暴风雨在夜间穿过了 Coffey County。"}]}],"synonyms":["(surname)","(place name)"],"phonetic":"/ˈkɔfi/","extraExplanation":["“Coffey”通常被认为来自爱尔兰姓氏 Ó Cobhthaigh 的英语化拼写，含义常被解释为与“胜利（victory）”有关。","在英语文化中，“Coffey”也常因文学/影视角色而被记住，例如史蒂芬·金《绿里奇迹》（The Green Mile）中的角色 John Coffey。注意这是专有名词，一般不当作“coffee（咖啡）”的替代拼写；只有在品牌名、网名或创意拼写中才可能看到这种用法。"]}
{"word":"Coffeyville","summary":{"en":"Coffeyville is a city in southeastern Kansas, USA.","zh":"Coffeyville 是美国堪萨斯州东南部的一座城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in southeastern Kansas, USA.","zh":"美国堪萨斯州东南部的一座城市（科菲维尔）。"},"examples":[{"en":"Coffeyville is in Montgomery County, Kansas.","zh":"科菲维尔位于堪萨斯州的蒙哥马利县。"},{"en":"She grew up near Coffeyville and later moved to Wichita.","zh":"她在科菲维尔附近长大，后来搬到了威奇托。"}]}],"phonetic":"/ˈkɔfiˌvɪl/","extraExplanation":["Coffeyville 常因美国西部历史事件而被提及：1892 年“道尔顿帮（Dalton Gang）抢劫案”在此发生，镇民与匪徒交火，使它在“旧西部（Old West）”叙事中较有名。","这是一个专有名词（地名），通常不翻译，只做音译或直接用英文拼写；书写时首字母要大写：Coffeyville。"]}
{"word":"coffin","summary":{"en":"A coffin is a box used to hold a dead body for burial or cremation.","zh":"coffin 指用于安放遗体以便埋葬或火化的棺材。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A long, narrow box (usually wood or metal) used to hold a dead body for burial or cremation.","zh":"棺材；（通常为木制或金属的）长方形盒子，用于安放遗体以便埋葬或火化。"},"examples":[{"en":"The family chose a simple wooden coffin.","zh":"家人选了一口朴素的木棺材。"},{"en":"The coffin was carried slowly into the church.","zh":"棺材被缓缓抬进了教堂。"}]}],"synonyms":["casket"],"phonetic":"/ˈkɔfɪn/","extraExplanation":["在英语文化语境里，coffin 常见于葬礼、哀悼等庄重场合。英式英语里还常用 casket（尤指外观更精致、常见于北美），但在日常理解上两者经常被当作“棺材”使用。"]}
{"word":"coffin-bearer","summary":{"en":"A coffin-bearer is a person who carries the coffin at a funeral.","zh":"coffin-bearer 指在葬礼上抬棺的人（扶灵者）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who helps carry a coffin at a funeral; a pallbearer.","zh":"（葬礼上）抬棺者；扶灵者（pallbearer）。"},"examples":[{"en":"Six coffin-bearers carried the coffin into the church in silence.","zh":"六位抬棺者默默地把棺材抬进了教堂。"},{"en":"He was asked to be a coffin-bearer for his uncle’s funeral.","zh":"他被请去在叔叔的葬礼上担任抬棺者。"}]}],"synonyms":["pallbearer","bearer"],"phonetic":"/ˈkɔfɪn ˌbɛrɚ/","extraExplanation":["“coffin-bearer”是一个较直白、偏描述性的词，常见于新闻报道或正式叙述；日常英语里更常用“pallbearer”。","在一些文化与宗教传统中，抬棺者通常由亲友担任，象征对逝者的尊敬与送别；不同地区也可能由专业殡葬人员承担。","词形上是复合词：coffin（棺材）+ bearer（搬运/携带者）。bearer也常见于“flag-bearer（旗手）”“torchbearer（火炬手/传承者）”。"]}
{"word":"coffin-shaped","summary":{"en":"Coffin-shaped means having the long, tapered shape of a coffin.","zh":"coffin-shaped 指“像棺材一样的形状”，细长且一端较宽、另一端收窄。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape of a coffin: long and narrow, usually wider at one end and tapered at the other.","zh":"棺材形的；形状像棺材的：细长，通常一端较宽、另一端逐渐变窄。"},"examples":[{"en":"The mirror was coffin-shaped, with a wider top and a narrower bottom.","zh":"那面镜子是棺材形的，上端更宽，下端更窄。"},{"en":"The old building had coffin-shaped windows that made the hallway feel eerie.","zh":"那栋老房子有棺材形的窗户，让走廊显得阴森。"}]}],"synonyms":["coffinlike","tapered","hexagonal (in some contexts)","trapezoidal (in some contexts)"],"phonetic":"/ˈkɔfɪn ʃeɪpt/","extraExplanation":["“coffin-shaped”常用于描述物体外形（如窗户、镜子、冲浪板/滑板、石碑、桌面等），在文学或影视评论中也常用来营造“阴郁、死亡联想”的氛围。它一般是客观形状描述，但语境可能带有情绪色彩（creepy/eerie/morbid）。","形态上可理解为“六边形/梯形”的一种：两侧大致平行或略收，顶部较宽、底部更尖或更窄。不同物品的“coffin-shaped”不一定完全一致，但都保留这种“棺材轮廓”的联想。"]}
{"word":"coffined","summary":{"en":"“Coffined” means placed in a coffin, or (literarily) shut in tightly as if in a coffin.","zh":"“Coffined”指“被装入棺材”，也可作文学性表达，指“像装进棺材一样被严密封闭/困住”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “coffin”: to place a dead body in a coffin; to enclose in a coffin.","zh":"“coffin”的过去式/过去分词：把遗体放入棺材；把……装入棺材。"},"examples":[{"en":"After the viewing, the body was coffined and prepared for burial.","zh":"瞻仰仪式后，遗体被装入棺材并准备下葬。"},{"en":"In the story, the villagers coffined the stranger before nightfall.","zh":"在故事里，村民在天黑前把陌生人装入棺材。"}]},{"partOfSpeech":"adj.","definition":{"en":"enclosed as if in a coffin; shut in tightly (often poetic or literary).","zh":"像被装进棺材一样被封闭；被紧紧关住（常见于诗歌或文学表达）。"},"examples":[{"en":"The old house felt coffined in darkness.","zh":"那座老房子像被黑暗封进棺材里一样。"},{"en":"He sat coffined in the cramped car, unable to stretch his legs.","zh":"他蜷在狭窄的车里，像被“封住”一样，腿都伸不开。"}]}],"synonyms":["casketed","entombed","interred","enclosed","shut in"],"phonetic":"/ˈkɔfənd/","extraExplanation":["“coffined”在现实语境里多用于殡葬相关的正式表达（如遗体处理流程）；在非字面用法中带有强烈的阴郁、压迫感，常见于文学描写（表示“被封闭、被困住”）。","相关常见搭配：be coffined in + 名词（darkness / silence / earth 等），用来营造“密闭、窒息、无法逃脱”的意象。"]}
{"word":"coffing","summary":{"en":"“Coffing” means mocking or scornfully laughing (from “coff”). It’s often confused with “coughing” (to cough).","zh":"“coffing”意为“嘲笑、讥讽”（来自动词coff）。它常与“coughing（咳嗽）”混淆。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"mocking or showing scorn; laughing at someone in a rude, dismissive way (present participle of “coff”).","zh":"嘲笑；轻蔑地讥讽（动词 coff 的现在分词）。"},"examples":[{"en":"They were coffing at his accent, which was unkind.","zh":"他们嘲笑他的口音，这样做很不友善。"},{"en":"She ignored the coffing comments and kept speaking calmly.","zh":"她无视那些讥讽的评论，仍然冷静地继续发言。"}]},{"partOfSpeech":"n.","definition":{"en":"an act or sound of mocking laughter or scornful remarks (less common).","zh":"嘲笑的举动或声音；轻蔑的言语（较少见）。"},"examples":[{"en":"A coffing laugh came from the back of the room.","zh":"教室后排传来一声嘲笑的笑声。"}]}],"synonyms":["mocking","scoffing","jeering","ridiculing","deriding"],"phonetic":"/ˈkɔfɪŋ/","extraExplanation":["“coffing”比较少见，很多学习者其实想写的是“coughing”（咳嗽）。两者发音和意思差很多：coughing /ˈkɔfɪŋ/（美式中与coffing同音或近似同音）= 咳嗽；coffing = 嘲笑、讥讽。写作时要特别注意拼写。","“coff at”是更常见的搭配：to coff at someone/something = 嘲笑某人/某事。更中性的常用词还包括“mocking”“scoffing”。"]}
{"word":"coffining","summary":{"en":"“Coffining” means putting a body into a coffin; it can also mean the process itself.","zh":"“coffining”指把遗体放入棺材（入棺）；也可指入棺这一过程。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"putting a dead body into a coffin; preparing a body for burial in a coffin","zh":"把遗体放入棺材；为下葬进行入棺处理"},"examples":[{"en":"The funeral home staff are coffining the body before the viewing.","zh":"殡仪馆工作人员正在为瞻仰遗容前把遗体入棺。"},{"en":"In some traditions, coffining happens shortly after washing and dressing the body.","zh":"在一些传统中，净身与穿衣之后不久就会进行入棺。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or process of putting a body into a coffin (used as a noun)","zh":"入棺这一行为或过程（作名词用）"},"examples":[{"en":"The family requested privacy during the coffining.","zh":"家属要求在入棺过程中保持私密。"}]}],"synonyms":["casketing","placing in a coffin","enclosing","interring (broader)"],"phonetic":"/ˈkɔfɪnɪŋ/","extraExplanation":["“coffin”既可以作名词（棺材），也可以作动词（把……放入棺材）。在现代英语里，动词用法比较正式、也偏殡葬行业语境，日常更常说“place the body in the coffin / casket”。","在美式英语中，“casket”常用于更委婉、更常见的表达；“coffin”更直白，也可能让语气显得更沉重。与丧葬相关的词汇在跨文化交流中要注意场合与语气。"]}
{"word":"coffinite","summary":{"en":"Coffinite is a rare uranium-bearing mineral and a source (ore) of uranium.","zh":"Coffinite 是一种稀有的含铀矿物，可作为铀的矿石来源之一。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare uranium-bearing mineral (a uranium silicate) that is an important ore of uranium.","zh":"一种含铀的稀有矿物（铀硅酸盐），是重要的铀矿石之一。"},"examples":[{"en":"Coffinite is studied because it can form in uranium deposits under low-temperature conditions.","zh":"人们研究 coffinite，是因为它能在低温条件下于铀矿床中形成。"},{"en":"In some rocks, coffinite occurs together with uraninite and quartz.","zh":"在一些岩石中，coffinite 会与晶质铀矿（uraninite）和石英共生。"}]}],"synonyms":["uranium silicate (general term)"],"phonetic":"/ˈkɔfɪnaɪt/","extraExplanation":["“coffinite”是矿物学术语，常见于地质学、矿床学与核燃料资源相关的文献中。","词名来自美国地质学家 Reuben Clare Coffin（鲁本·克莱尔·科芬）的姓氏，后缀“-ite”常用于矿物名称，表示“某种矿物/岩石”。"]}
{"word":"coffinless","summary":{"en":"Coffinless means “without a coffin,” literally or metaphorically describing a death or farewell lacking the usual formality or dignity.","zh":"coffinless 意为“无棺的”，可作字面含义（未用棺材）或比喻（缺少应有的仪式感/体面）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"without a coffin; not placed in a coffin","zh":"无棺的；未放入棺材的"},"examples":[{"en":"The victims were buried coffinless because there were not enough supplies.","zh":"由于物资不足，遇难者被无棺下葬。"},{"en":"In the story, he feared a coffinless burial far from home.","zh":"在故事里，他害怕远离家乡、无棺下葬。"}]},{"partOfSpeech":"adj.","definition":{"en":"(figurative) lacking the usual protection, dignity, or formality associated with death or farewell","zh":"（比喻）缺少应有的保护、体面或仪式感（像告别/死亡那样）"},"examples":[{"en":"The article described a “coffinless goodbye,” meaning there was no proper ceremony.","zh":"文章写到“无棺的告别”，意思是没有体面的仪式。"},{"en":"He felt the memory was left coffinless—exposed and unresolved.","zh":"他觉得那段记忆像“无棺”一样，赤裸而未了结。"}]}],"synonyms":["uncoffined","without a coffin","boxless"],"phonetic":"/ˈkɔfɪnˌlɛs/","extraExplanation":["“coffinless”由 coffin（棺材）+ -less（没有……的）构成，属于非常少见的词，更多见于新闻报道、历史/战争叙述或文学修辞。","不同文化对安葬方式的习惯不同；英语语境里“coffinless burial”常强调条件艰难（如战乱、灾害）或仪式缺失带来的情感冲击。"]}
{"word":"coffinlike","summary":{"en":"Coffinlike means “like a coffin,” often implying a narrow, enclosed, dark, or oppressive space.","zh":"coffinlike 表示“像棺材的”，常暗示狭窄、封闭、阴暗或压抑的空间。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a coffin in shape, size, or feeling—often suggesting something long, narrow, boxed-in, dark, or uncomfortable.","zh":"像棺材的；棺材般的（形状、大小或给人的感觉相似，常带有狭长、封闭、阴暗或令人不适的意味）。"},"examples":[{"en":"The hallway was long and coffinlike, with almost no light.","zh":"走廊又长又像棺材一样狭窄，几乎没有光。"},{"en":"He woke up in a coffinlike sleeping pod on the train.","zh":"他在火车上一个棺材般的睡眠舱里醒来。"},{"en":"The room felt coffinlike when the door was shut and the curtains were drawn.","zh":"门一关、窗帘一拉，房间就显得像棺材一样压抑。"}]}],"synonyms":["coffin-shaped","boxlike","cramped","claustrophobic","tight","enclosed"],"phonetic":"/ˈkɔfɪnˌlaɪk/","extraExplanation":["“coffinlike”由名词“coffin（棺材）”+后缀“-like（像……一样）”构成。它通常带有强烈的氛围感，除了“形状像”，也常用来表达“令人窒息、压抑、阴冷”的情绪。","常见搭配：a coffinlike box/space/room/pod（棺材般的盒子/空间/房间/舱）。写作中多见于描述恐怖、悬疑、科幻或强调幽闭恐惧（claustrophobia）的场景。"]}
{"word":"coffinmaker","summary":{"en":"A coffinmaker is someone whose job is to make coffins for funerals.","zh":"coffinmaker 指制作棺材的工匠或从业者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who makes coffins; a craftsman whose job is to build coffins (and sometimes caskets) for funerals.","zh":"制作棺材的人；以制作棺材（有时也包括西式棺木 casket）为业的工匠。"},"examples":[{"en":"In the past, the village coffinmaker built a coffin by hand for each funeral.","zh":"过去，村里的棺材匠会为每一场葬礼手工制作一副棺材。"},{"en":"The novel describes a coffinmaker who knows everyone’s family history.","zh":"小说描写了一位棺材匠，他了解每个家族的往事。"}]}],"synonyms":["coffin maker","casket maker","undertaker (broader meaning)","funeral director (broader meaning)"],"phonetic":"/ˈkɔfɪnˌmeɪkɚ/","extraExplanation":["“coffinmaker”由 coffin（棺材）+ maker（制造者）构成，属于复合名词。现代英语里更常见的说法是 “coffin maker”（分开写）或用更广义的职业词 “undertaker / funeral director”（殡葬承办人/殡仪人员），因为当代殡葬业通常由殡仪馆统一提供棺材等用品。","英美语境中，coffin 和 casket 有时会区分：coffin 常指两端收窄、较传统的棺材；casket 多指长方形、外观更精致的棺木。不过在口语中也常混用。","文学与影视中，“coffinmaker”常带有民俗或哥特式气氛（gothic tone），用来营造与死亡、仪式、乡镇生活相关的氛围。"]}
{"word":"coffinmaking","summary":{"en":"Coffinmaking means the craft or industry of making coffins.","zh":"coffinmaking 指“制作棺材的手艺或行业”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the craft or business of making coffins (wooden or other containers used for burying or cremating a dead person)","zh":"制作棺材的手艺或行业（为安葬或火化遗体而制作的容器）"},"examples":[{"en":"In the past, coffinmaking was often done by local carpenters.","zh":"过去，制作棺材常常由本地木匠来完成。"},{"en":"He learned coffinmaking as part of his work in the funeral trade.","zh":"他在殡葬行业工作时学会了制作棺材。"}]}],"synonyms":["coffin manufacture","coffin production","casket making"],"phonetic":"/ˈkɔfɪnˌmeɪkɪŋ/","extraExplanation":["“Coffinmaking”是由“coffin（棺材）+ making（制作）”构成的复合名词，语气较直接、偏描述性。在现代英语里更常见的正式说法包括“coffin manufacture（棺材制造）”或“coffin production（棺材生产）”。","在一些文化与历史语境中，棺材的样式、材质与装饰会反映当地的宗教观念、葬礼习俗与经济条件；因此“coffinmaking”也可能出现在历史、民俗、或文学作品对死亡与仪式的描写中。"]}
{"word":"coffins","summary":{"en":"“Coffins” is the plural form of “coffin,” meaning burial boxes for dead bodies.","zh":"“coffins”是“coffin（棺材）”的复数，指用于安放遗体并安葬的箱子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “coffin”: a long, narrow box in which a dead body is buried or cremated.","zh":"“coffin”的复数：棺材；用于安放遗体并进行土葬或火化的狭长箱子。"},"examples":[{"en":"The family chose simple coffins for the funeral.","zh":"家人给葬礼选择了朴素的棺材。"},{"en":"In the museum, you can see ancient coffins from different cultures.","zh":"在博物馆里，你可以看到来自不同文化的古代棺材。"}]}],"synonyms":["caskets"],"phonetic":"/ˈkɔfɪnz/","extraExplanation":["“coffin”在英语文化中常与葬礼（funeral）、安葬（burial）等场景相关；在文学和影视里也常用作“死亡、终结、恐惧或压抑”的象征。","相关词汇：casket（更偏美式委婉说法，常指更精致的棺材）、tomb（坟墓/陵墓）、grave（坟墓）、urn（骨灰坛）。其中 casket 常用于较正式或希望表达更含蓄的语境。"]}
{"word":"coffle","summary":{"en":"A coffle is a group bound together (often with chains), especially in historical accounts of enslaved people; it can also mean to tie and drive in such a group.","zh":"coffle 指被绳索或铁链拴在一起、被迫成队行进的一群人或动物（常见于奴隶制历史语境）；也可作动词，表示把（人/动物）拴成队并驱赶前行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group of people or animals tied together with ropes or chains and made to travel as a unit (especially enslaved people in historical contexts)","zh":"（尤指历史上）用绳索或铁链拴在一起、被迫成队行进的一群人或动物；（常指）被奴役者的押送队伍"},"examples":[{"en":"The novel describes a coffle of enslaved people being marched to the market.","zh":"这部小说描写了一队被奴役的人被迫行进到市场。"},{"en":"In the museum exhibit, a drawing showed a coffle moving along a dusty road.","zh":"在博物馆展览中，一幅画展示了一队被拴在一起的人沿着尘土飞扬的路前行。"}]},{"partOfSpeech":"v.","definition":{"en":"to tie people or animals together and drive them along as a group","zh":"把人或动物拴在一起并驱赶成队前行"},"examples":[{"en":"They were coffled and forced to march for days.","zh":"他们被铁链拴在一起，被迫行军数日。"},{"en":"Horses were coffled to keep them from running off during the journey.","zh":"旅途中人们把马拴成一串，以防它们跑散。"}]}],"synonyms":["chain gang","gang","caravan (historical/looser sense)","procession (looser sense)"],"phonetic":"/ˈkɑfəl/","extraExplanation":["“coffle”在英语史料中常与跨大西洋奴隶贸易和美国奴隶制度相关，带有强烈的暴力与去人性化含义。阅读或使用该词时要注意语境与文化敏感性。","词源一般认为与阿拉伯语中表示“队伍/行旅商队”的词有关，后进入英语并在北美历史语境中固定为“押送奴隶的队列”等含义。"]}
{"word":"coffled","summary":{"en":"“Coffled” means people were (or are) chained together in a line, often in historical contexts involving prisoners or enslaved people.","zh":"“coffled”指（某些人）被用锁链串成一列，常见于押送囚犯或奴隶制等历史语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of coffle) to chain people together in a line (a “coffle”), especially prisoners or enslaved people being forced to travel.","zh":"（coffle 的过去式/过去分词）把一群人用锁链串成一列（称为“coffle”），尤指押送囚犯或被奴役者被迫迁移。"},"examples":[{"en":"In the novel, the captives were coffled and marched for days.","zh":"在小说中，俘虏被用锁链串成一列，被迫行军好几天。"},{"en":"Historical records describe enslaved people coffled together during forced transport.","zh":"历史记录记载，被奴役者在被强制转运时常被锁链串成一列。"}]},{"partOfSpeech":"adj.","definition":{"en":"chained together in a line (as in a coffle).","zh":"被锁链串成一列的（如“coffle”那样）。"},"examples":[{"en":"They saw a coffled line of prisoners on the road.","zh":"他们在路上看见一列被锁链串起来的囚犯。"},{"en":"The painting depicts coffled figures moving across a barren landscape.","zh":"这幅画描绘了一群被锁链串成一列的人穿过荒凉的景色。"}]}],"synonyms":["chained","shackled","bound","in chains"],"phonetic":"/ˈkɔfəld/","extraExplanation":["“coffle”一词常出现在与大西洋奴隶贸易、美国奴隶制与押送囚犯相关的历史叙述中，语境往往沉重且带有暴力与去人性化意味。阅读或使用时，注意其历史背景与对受害者的尊重。"]}
{"word":"coffles","summary":{"en":"Coffles are lines/groups of people (historically enslaved or imprisoned) chained together; less commonly, lines of animals driven together.","zh":"coffles 指（历史上）被锁链串在一起的奴隶或囚犯队列；较少见时也指成列行进的动物队。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a line or group of enslaved people or prisoners fastened together with chains or ropes, forced to travel or be moved as a unit (historical).","zh":"（历史用语）一串被锁链或绳索绑在一起、被迫行进或转移的奴隶或囚犯。"},"examples":[{"en":"The novel describes a coffle of enslaved people being marched to the market.","zh":"这部小说描写了一串被奴役的人被迫行进到市场。"},{"en":"Records from that era mention prisoners transported in coffles.","zh":"那个时代的记录提到囚犯被成串锁着押送。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a group of animals, especially horses or mules, traveling or driven in a line.","zh":"（较少见）一队动物（尤指马或骡）排成一列行进或被驱赶前进。"},"examples":[{"en":"A coffle of mules carried supplies along the narrow trail.","zh":"一队骡子沿着狭窄的小路运送补给。"}]}],"synonyms":["chain gang","file","caravan"],"phonetic":"/ˈkɑfəl/","extraExplanation":["“coffle”在英语中常与跨大西洋奴隶贸易、美国奴隶制度等历史语境相关，带有强烈的暴力与非人化含义。现代写作或讨论中多用于历史叙述、文学作品或批判性语境。"]}
{"word":"coffling","summary":{"en":"Coffling is a historical term for chaining or arranging people/animals into a line (a coffle), often linked to enslavement.","zh":"Coffling是历史词，指把人或牲畜用绳索/锁链串成一列（coffle），常与奴役和强迫押送相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) The act of forming people or animals into a coffle (a line tied or chained together), especially in the context of forced labor or enslavement.","zh":"（历史用语）把人或牲畜编成“coffle”（被绳索或锁链串成一列的队伍，尤指奴隶贸易/强迫劳动中的押送队列）的行为。"},"examples":[{"en":"The book describes enslaved people coffling together before being marched to the market.","zh":"这本书描述了被奴役的人在被迫行军到市场前被“coffling”成一队。"},{"en":"The film avoids showing coffling directly, but it hints at it through the sound of chains.","zh":"这部电影没有直接呈现“coffling”，但通过锁链的声音暗示了这一情景。"}]},{"partOfSpeech":"vt.","definition":{"en":"(historical) To arrange people or animals into a coffle; to chain or tie them together in a line.","zh":"（历史用语）把人或牲畜编成coffle；用锁链或绳索把他们串在一起排成一列。"},"examples":[{"en":"They coffled the captives and forced them to walk for days.","zh":"他们把俘虏用锁链串成一列，逼迫其走了好几天。"},{"en":"In some old accounts, traders are described as coffling groups before transport.","zh":"在一些旧记载中，商人被描述为在运输前把人群coffling成队。"}]}],"synonyms":["chaining together","binding in a line","marching in chains","chain-ganging (context-dependent)"],"phonetic":"/ˈkɔfəlɪŋ/","extraExplanation":["“coffle / coffling”多出现在描写跨大西洋奴隶贸易或其他强迫迁徙/押送的历史文本中，带有强烈的暴力与非人化含义。阅读或使用时要注意语境与文化敏感性。","词源上与“链成一列的队伍”相关，因此常与chains、march、captives等词共现。日常英语里很少用，现代写作更常用更直接的表达，如“chained together”或“forced into a chain gang”（视语境而定）。"]}
{"word":"Coffman","summary":{"en":"Coffman is mainly a surname (and sometimes a place name) used as a proper noun.","zh":"Coffman 主要是姓氏（有时也作地名），属于专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a surname (family name), most common in the U.S.; used to refer to a person or family named Coffman","zh":"姓氏（家族名），在美国较常见；用于指代姓 Coffman 的个人或家庭"},"examples":[{"en":"Dr. Coffman will see you now.","zh":"Coffman 医生现在要见你。"},{"en":"I met a Coffman at the conference.","zh":"我在会议上认识了一位 Coffman。"}]},{"partOfSpeech":"other","definition":{"en":"(less common) a place name in the U.S. (for example, small local features or communities)","zh":"（较少见）美国的地名（例如某些小型社区或地理地点）"},"examples":[{"en":"They drove through Coffman on their way north.","zh":"他们一路向北时开车经过了 Coffman。"}]}],"synonyms":["(no direct synonyms; it is a proper name)"],"phonetic":"ˈkɔfmən","extraExplanation":["“Coffman”通常是英语里的专有名词（人名/地名），首字母大写。","这个姓氏常被认为与德语姓“Kaufmann（商人）”有关：早期移民来到北美后，拼写可能逐渐英语化为 Coffman。","在英文里提到姓氏时，可用 Mr./Ms./Dr. + Coffman；也常用于机构/地点命名（如 Coffman Hall），表示与某位 Coffman（捐赠者、重要人物、家族）相关。"]}
{"word":"coffret","summary":{"en":"Coffret means a small decorative box or a luxury boxed gift set (often for perfumes/cosmetics).","zh":"coffret 指精致小匣子，也常指香水/化妆品等的高端礼盒套装。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, often decorative box or casket (especially for jewelry, keepsakes, or valuables); in modern retail, a boxed gift set (commonly perfumes/cosmetics) presented in a luxury package","zh":"（常指精致的）小盒/匣子（尤用于放珠宝、纪念品、贵重物品）；现代零售中也指（香水/化妆品等的）礼盒套装"},"examples":[{"en":"She kept her grandmother’s ring in a velvet-lined coffret.","zh":"她把祖母的戒指放在一个内衬天鹅绒的小匣子里。"},{"en":"The brand released a holiday coffret with two mini perfumes and a lotion.","zh":"该品牌推出了节日礼盒套装，里面有两支迷你香水和一瓶身体乳。"}]}],"synonyms":["box","case","casket","jewelry box","gift set","boxed set"],"phonetic":"/kɔˈfreɪ/","extraExplanation":["“coffret”源自法语，在英语里多见于奢侈品与美妆零售语境（产品页、专柜宣传），用来营造“法式精致/高端包装”的感觉。日常英语更常用 box、case、casket、gift set。","发音在英语中常见近似“ko-FRAY/ko-FREH”的读法；有些人会更接近法语鼻化与元音，但在美国英语环境里用近似读法通常可被理解。","相关法语词：coffre（箱子/柜子）；与英语的 coffer（保险箱、金库； coffers “国库/资金”）有历史关联，但现代用法与语域不同。"]}
{"word":"coffrets","summary":{"en":"Coffrets is the plural of coffret: a small decorative box or a boxed gift set (often in luxury packaging).","zh":"coffrets 是 coffret 的复数：指精致的小匣子，或（多见于奢侈品包装语境的）礼盒套装。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, often decorative box or casket (especially for jewelry, keepsakes, or valuables)","zh":"小型（常带装饰的）盒/匣/小箱（尤指放珠宝、纪念品或贵重物品）"},"examples":[{"en":"She kept her rings in a velvet coffret.","zh":"她把戒指放在一个天鹅绒小匣子里。"},{"en":"The museum displayed a gold coffret from the 18th century.","zh":"博物馆展出了一只18世纪的金质小匣。"}]},{"partOfSpeech":"n.","definition":{"en":"(in French-influenced retail/packaging) a boxed gift set, especially for cosmetics, perfume, or wine","zh":"（受法语影响的零售/包装用语）礼盒套装（尤指化妆品、香水或葡萄酒等）"},"examples":[{"en":"They released a holiday coffret of mini perfumes.","zh":"他们推出了节日迷你香水礼盒。"},{"en":"This wine coffret includes two glasses and a bottle opener.","zh":"这款葡萄酒礼盒里包含两个酒杯和一个开瓶器。"}]}],"synonyms":["box","case","casket","jewelry box","gift set"],"phonetic":"/koʊˈfreɪ/","extraExplanation":["“coffret”源自法语，英语中属于较偏书面/奢侈品语境的借词；日常英语更常用 box、case、casket、gift set 等。","在英语里它常带有“精致、用于收藏或送礼”的感觉，因此在珠宝、香水、葡萄酒等产品文案中更常见。"]}
{"word":"coffs","summary":{"en":"“coffs” is usually a misspelling of “coughs,” meaning “(she/he) coughs” or “multiple coughs.”","zh":"“coffs”通常是“coughs”的常见拼写错误，意思是“（他/她）咳嗽”或“多次咳嗽”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(verb) Third-person singular of “cough”: to force air out of the throat with a sudden sound, often because of irritation or illness.","zh":"（动词）“cough”的第三人称单数：因喉咙受刺激或生病而突然把空气从喉咙里冲出并发出咳嗽声。"},"examples":[{"en":"She coughs a lot in winter because the air is so dry.","zh":"冬天她咳得很厉害，因为空气太干了。"},{"en":"He coughs when the smoke gets too strong.","zh":"烟太呛时他就会咳嗽。"}]},{"partOfSpeech":"n.","definition":{"en":"(noun) Plural of “cough”: repeated sounds/actions of coughing.","zh":"（名词）“cough”的复数：多次咳嗽的声音或行为。"},"examples":[{"en":"His coughs kept him awake at night.","zh":"他一阵阵咳嗽，晚上睡不着。"},{"en":"The doctor asked how long the coughs had lasted.","zh":"医生问这些咳嗽持续多久了。"}]}],"synonyms":["coughs","hacks (informal)","clears one’s throat (similar action)"],"phonetic":"/kɔfs/","extraExplanation":["“coffs”一般不是标准拼写，最常见是把“coughs”拼错了。英语里“cough”结尾的“gh”不发/g/音，常常读成/f/，所以“coughs”的发音像/kofs/，容易让学习者误写成“coffs”。"]}
{"word":"Cofield","summary":{"en":"Cofield is most commonly a surname; in some contexts it can also be a place name.","zh":"Cofield 最常见是姓氏；在某些语境下也可能是地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surname (family name), used for a person or family named Cofield.","zh":"一个姓氏（家族姓），用于名为 Cofield 的个人或家族。"},"examples":[{"en":"Ms. Cofield will lead the meeting today.","zh":"Cofield 女士今天将主持会议。"},{"en":"I saw Cofield on the class list.","zh":"我在班级名单上看到了 Cofield 这个名字。"}]},{"partOfSpeech":"n.","definition":{"en":"A proper name that may also appear as a place name (less common), depending on local usage.","zh":"一个专有名词，也可能在某些地区作为地名出现（较少见），具体取决于当地用法。"},"examples":[{"en":"They drove through Cofield on the way to the coast.","zh":"他们去海岸的路上经过了 Cofield。"}]}],"phonetic":"/ˈkoʊfiːld/","extraExplanation":["“Cofield”通常被当作英语世界中的姓氏来使用，写法固定首字母大写。","如果你是在某份文件、书里或地图上看到它，最准确的含义要看上下文：是人名、公司名，还是地名。你可以把句子发我，我能帮你判断。"]}
{"word":"cofighter","summary":{"en":"Cofighter means someone who fights with you—your fellow fighter or ally.","zh":"cofighter 指与你并肩作战的人，即“战友/同盟/队友”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who fights alongside someone else; a fellow fighter (often used in stories, games, or informal writing).","zh":"与他人并肩作战的人；战友（常见于故事、游戏或非正式写作中）。"},"examples":[{"en":"The hero thanked his cofighters after the battle.","zh":"战斗结束后，英雄感谢了与他并肩作战的战友们。"},{"en":"In the game, you can recruit cofighters to help you defeat the boss.","zh":"在游戏里，你可以招募队友一起击败首领。"}]}],"synonyms":["fellow fighter","ally","comrade-in-arms","teammate","comrade"],"phonetic":"/ˈkoʊˌfaɪtər/","extraExplanation":["“co-”表示“共同、一起”（如 coworker 同事、coauthor 合著者），所以 cofighter 直译就是“一起战斗的人”。不过在真实新闻或正式英语里更常说 fellow fighter、comrade-in-arms、ally、teammate。"]}
{"word":"cofinal","summary":{"en":"Cofinal usually means (in math) ‘reaching arbitrarily far/high in an ordered set’; more generally it can mean ‘sharing the same endpoint.’","zh":"cofinal 通常指（数学中）在有序集合里“向上无界、能覆盖到任意高处”的性质；更一般也可指“终点相同”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Mathematics) In order theory, a subset is cofinal in an ordered set if it reaches arbitrarily “high” elements—meaning every element is less than or equal to some element of the subset.","zh":"（数学·序理论）在一个有序集合中，若子集在“上方”足够密集：对任意元素，都能在该子集中找到一个不小于它的元素，则称该子集在该有序集合中是共终（cofinal）的。"},"examples":[{"en":"The set of natural numbers is cofinal in the integers ordered by ≤.","zh":"在按“≤”排序的整数中，自然数集合是共终的。"},{"en":"To prove the sequence is cofinal, show that for any bound you choose, the sequence eventually exceeds it.","zh":"要证明这个序列是共终的，需要说明：不管你选什么界，它最终都会超过该界。"}]},{"partOfSpeech":"adj.","definition":{"en":"Ending at the same point; sharing the same final limit or endpoint (less common, usually formal).","zh":"在同一终点结束的；具有相同最终界限/终点的（较少见，多用于正式语境）。"},"examples":[{"en":"These two paths are cofinal because they meet at the same destination.","zh":"这两条路线在同一目的地汇合，因此是共终的。"},{"en":"The debates were different, but they were cofinal in the same conclusion.","zh":"这些争论各不相同，但最终都指向同一个结论。"}]}],"synonyms":["(math) unbounded (above)","(general) converging","ending at the same point"],"phonetic":"/koʊˈfaɪnəl/","extraExplanation":["“cofinal”主要出现在数学（特别是序理论、集合论）里；日常英语更常用“have the same endpoint / end at the same point / lead to the same conclusion”等表达。","在序理论中常见搭配：cofinal subset（共终子集）、cofinality（共终性，名词：the cofinality of a set/order）。"]}
{"word":"cofinance","summary":{"en":"“Cofinance” means to fund a project together with others (share the financing).","zh":"“cofinance” 指与他人或机构共同出资/共同融资来支持某个项目。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to provide money for a project together with another person, company, bank, or organization; to share the funding","zh":"（与他人/机构）共同为某个项目提供资金；共同出资"},"examples":[{"en":"The two banks agreed to cofinance the bridge project.","zh":"两家银行同意共同为这座桥梁项目提供资金。"},{"en":"We will cofinance the new clinic with an international charity.","zh":"我们将与一家国际慈善机构共同资助新诊所。"},{"en":"The film was cofinanced by studios in the U.S. and Europe.","zh":"这部电影由美国和欧洲的制片公司共同出资。"}]}],"synonyms":["jointly finance","co-fund","help fund","underwrite (partly)"],"phonetic":"/ˌkoʊˈfaɪnæns/","extraExplanation":["常见拼写也会写作 co-finance（加连字符），含义相同；名词形式常用 cofinancing / co-financing（共同融资）。该词在商业、基础设施建设、国际发展援助（如世界银行、开发银行项目）和影视制作等语境中很常见。"]}
{"word":"cofinanced","summary":{"en":"“Cofinanced” means jointly funded or paid for by multiple sources; it is also the past form of “cofinance.”","zh":"“cofinanced”指由多个来源共同出资/共同资助的；也可作“cofinance”的过去式或过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"paid for together by two or more people, organizations, or sources; jointly funded.","zh":"由两个或多个个人、组织或资金来源共同出资的；共同资助的。"},"examples":[{"en":"The project was cofinanced by the local government and a private company.","zh":"该项目由地方政府和一家私营公司共同出资。"},{"en":"Many scholarships are cofinanced by universities and alumni donations.","zh":"许多奖学金由大学和校友捐款共同资助。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense or past participle of “cofinance”: to pay for something together with others.","zh":"“cofinance”的过去式/过去分词：与他人共同为某事出资。"},"examples":[{"en":"The program was cofinanced through public funds and international aid.","zh":"该项目通过公共资金和国际援助共同出资。"},{"en":"They have cofinanced several housing developments in the region.","zh":"他们已在该地区共同出资了多个住房开发项目。"}]}],"synonyms":["jointly funded","joint-financed","shared-funded","partly funded"],"phonetic":"/ˌkoʊˈfaɪnænst/","extraExplanation":["“co-”是常见前缀，表示“共同、一起”（如 coauthor 共同作者，cooperate 合作）。因此 cofinance 的核心意思就是“共同出钱/共同筹资”。","在商务、政府项目、国际发展与非营利领域中很常见，常见搭配有：cofinanced by…（由……共同出资），cofinanced with…（与……共同出资），cofinanced through…（通过……共同筹资）。"]}
{"word":"cofinances","summary":{"en":"“Cofinances” means “jointly funds,” usually said of an organization helping pay for a project together with others.","zh":"“cofinances”表示“共同出资/共同资助”，常用于机构与他方一起为项目提供资金。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to provide money for a project or activity together with one or more other people or organizations; to jointly fund","zh":"与他人或其他机构共同为某个项目/活动出资；共同资助"},"examples":[{"en":"The city cofinances the program with the national government.","zh":"市政府与国家政府共同为该项目出资。"},{"en":"Our company cofinances the research in partnership with a university.","zh":"我们公司与一所大学合作，共同资助这项研究。"},{"en":"She cofinances the film with two independent producers.","zh":"她与两位独立制片人共同为这部电影出资。"}]}],"synonyms":["jointly fund","co-fund","help fund","finance together","underwrite (partly)"],"phonetic":"/ˌkoʊˈfaɪnæns/","extraExplanation":["“cofinances”通常是动词“cofinance（共同资助）”的第三人称单数形式（he/she/it cofinances）。也常见写法为“co-finance”（加连字符），两者意思相同，正式写作中根据机构风格指南选择即可。","这个词多用于政府、银行、国际组织或公司合作出资的语境；日常口语里也可以用更常见的说法：“help fund / fund … together”。"]}
{"word":"cofinancing","summary":{"en":"Cofinancing means shared funding—two or more parties provide money for the same project or expense.","zh":"cofinancing 指“共同融资”，即两个或更多出资方为同一项目或支出共同提供资金。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the practice of funding a project or purchase together with one or more other parties (such as banks, governments, or organizations)","zh":"共同融资；由一个或多个出资方共同为某个项目或购买行为提供资金"},"examples":[{"en":"The bridge was built through cofinancing by the national government and the city.","zh":"这座桥由国家政府和市政府共同融资建成。"},{"en":"The NGO offered cofinancing for small businesses that couldn’t get full loans.","zh":"该非政府组织为无法获得全额贷款的小企业提供共同融资。"},{"en":"Many climate projects depend on cofinancing from public and private sources.","zh":"许多气候项目依赖公共与私营部门的共同融资。"}]}],"synonyms":["joint financing","shared financing","cost-sharing"],"phonetic":"/ˌkoʊˈfaɪnænsɪŋ/","extraExplanation":["常见语境：在“国际发展/援助”（世界银行、区域开发银行、联合国项目）、“基础设施建设”（道路、桥梁、能源）、“房地产与企业融资”等领域非常常见。","写法提醒：也常写作 co-financing（带连字符），两种写法都能见到。含义一致。","搭配：cofinancing agreement（共同融资协议）、cofinancing partner（共同融资方/合作出资方）、cofinancing requirement（共同融资要求，常指项目方需自筹一部分资金）。"]}
{"word":"cofluctuation","summary":{"en":"Cofluctuation means two or more things fluctuate together over time.","zh":"cofluctuation 指两个或多个事物随时间一起波动（共同起落）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a situation where two or more things (often prices, variables, or indicators) rise and fall together over time; co-movement in their fluctuations","zh":"（常指价格、变量或指标）两个或多个事物随时间一起上下波动的现象；共同波动/同向波动"},"examples":[{"en":"Researchers studied the cofluctuation of oil prices and airline stocks.","zh":"研究人员分析了油价与航空股之间的共同波动。"},{"en":"During the crisis, many markets showed strong cofluctuation.","zh":"在危机期间，许多市场表现出明显的共同波动。"},{"en":"We found cofluctuation between temperature changes and electricity demand.","zh":"我们发现气温变化与用电需求之间存在共同波动。"}]}],"synonyms":["co-movement","correlated fluctuations","joint fluctuation","comovement"],"phonetic":"/ˌkoʊflʌktʃuˈeɪʃən/","extraExplanation":["“cofluctuation”并不是日常英语里的高频词，更常见于学术写作（经济学、金融学、统计学、物理等）中，通常用来强调“波动的共同性/同步性”。","在更常用的表达里，人们往往说：co-movement（共同变动）、correlated fluctuations（相关波动）、move together（一起变动）。","需要注意：cofluctuation通常暗示“同时波动/一起起落”，但不一定等同于“因果关系”；它更接近“相关/同步”这一层面的描述。"]}
{"word":"coforeknown","summary":{"en":"Coforeknown means “jointly known beforehand,” a rare formal word often seen in theological or philosophical writing.","zh":"coforeknown 意为“共同被预先知道/预知的”，是较罕见的正式词，多见于神学或哲学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"known in advance together with something or someone else; jointly foreknown (rare, formal).","zh":"与其他事物或他人一起被预先知道的；共同被预知的（罕见、正式用语）。"},"examples":[{"en":"In some theological writings, events are described as coforeknown with a divine plan.","zh":"在一些神学著作中，事件被描述为与神圣计划一起被共同预知的。"},{"en":"The author treats the characters’ choices as coforeknown, not accidental.","zh":"作者把人物的选择视为被共同预知的，而不是偶然发生的。"}]}],"synonyms":["foreknown","predetermined","preordained","known in advance"],"phonetic":"/ˌkoʊfɔrˈnoʊn/","extraExplanation":["“co-”表示“共同、一起”，而“foreknown”表示“预先知道/预知”。“coforeknown”多见于较旧或较正式的宗教、哲学语境，用来强调“不是单独被预知，而是与其他对象一起（成套地）被预知”。","现代英语中更常用的表达是：“foreknown together / jointly foreknown / known in advance along with …”。"]}
{"word":"coformer","summary":{"en":"A coformer is a substance used with another compound (often a drug) to form a co-crystal.","zh":"coformer 指与另一种化合物（常为药物）一起形成共晶的物质（共晶形成剂）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Pharmacy/chemistry) A substance that combines with another substance to form a co-crystal (a crystal made from two or more different molecules in the same lattice).","zh":"（药学/化学）共晶形成剂；与另一种物质结合形成“共晶”（由两种或多种不同分子组成、共享同一晶格的晶体）的物质。"},"examples":[{"en":"In this study, caffeine was used as a coformer to produce a more stable co-crystal.","zh":"在这项研究中，咖啡因为共晶形成剂，用来制备更稳定的共晶。"},{"en":"Choosing the right coformer can improve a drug’s solubility without changing its chemical identity.","zh":"选择合适的共晶形成剂可以提高药物溶解度，同时不改变其化学本质。"}]}],"synonyms":["co-former","cocrystal former","cocrystal coformer"],"phonetic":"/ˈkoʊfɔrmɚ/","extraExplanation":["“coformer”多见于药剂学与晶体工程（crystal engineering）文献，常写作“co-former”。它指与API（活性药物成分）通过非共价作用（如氢键）共同结晶的另一种分子。","与“salt former（成盐剂）”不同：共晶通常不要求发生质子转移（不一定形成离子），而是以分子形式共同排列成晶体。","常见搭配：screening coformers（筛选共晶形成剂）、coformer selection（共晶形成剂选择）、API–coformer co-crystal（API-共晶形成剂共晶）。"]}
{"word":"coformulator","summary":{"en":"A coformulator is someone who helps formulate something together with others.","zh":"coformulator 指与他人一起制定（或配制）某事物的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who helps create or develop something together with others (such as a plan, policy, theory, or product formula).","zh":"共同制定者；共同拟定者（与他人一起制定计划、政策、理论或产品配方的人）。"},"examples":[{"en":"She was a coformulator of the new safety guidelines.","zh":"她是新安全指南的共同制定者之一。"},{"en":"The patent lists two coformulators of the chemical mixture.","zh":"专利文件列出了该化学混合物的两位共同配方制定者。"}]}],"synonyms":["collaborator","co-developer","joint formulator","co-creator"],"phonetic":"/ˌkoʊˈfɔrmjəˌleɪtər/","extraExplanation":["“co-”是常见前缀，表示“共同、一起”（如 cofounder 共同创办人，coauthor 合著者）。因此 coformulator 通常指“与他人一起拟定/配制的人”。","在制药、化妆品、食品等行业语境中，coformulator 往往更接近“共同配方师/共同配方开发者”；在政策或理论语境中则更接近“共同拟定者”。"]}
{"word":"cofound","summary":{"en":"“Cofound” means to found or start something together with others.","zh":"“cofound”表示与他人共同创立某事物。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to start (a company, organization, project, etc.) together with one or more other people","zh":"与他人共同创立（公司、组织、项目等）"},"examples":[{"en":"She cofound​ed a tech startup with two classmates.","zh":"她和两位同学共同创立了一家科技初创公司。"},{"en":"The museum was cofound​ed by local artists and historians.","zh":"这家博物馆由当地艺术家和历史学者共同创立。"}]}],"synonyms":["co-found","found jointly","establish together","start together"],"phonetic":"/koʊˈfaʊnd/","extraExplanation":["“cofound”常见写法是“co-found”（带连字符），尤其在正式写作中更常见；意思相同。注意不要和“confound”（使困惑/混淆）混淆，拼写相近但意思完全不同。"]}
{"word":"cofounded","summary":{"en":"“Cofounded” means “helped start something with others” (past tense/participle of cofound).","zh":"“cofounded”表示“与他人共同创立”，是 cofound 的过去式/过去分词。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to help start (a company, organization, project, etc.) together with one or more other people","zh":"与他人共同创立（公司、组织、项目等）"},"examples":[{"en":"She cofounded a nonprofit to support rural education.","zh":"她与人共同创立了一个支持乡村教育的非营利组织。"},{"en":"The app was cofounded by two college friends in 2018.","zh":"这款应用于2018年由两位大学好友共同创立。"}]}],"synonyms":["co-created","helped found","established (with others)","co-established"],"phonetic":"/ˌkoʊˈfaʊndɪd/","extraExplanation":["“co-”是前缀，表示“共同、一起”（如 coauthor 共同撰写；cooperate 合作）。因此 cofounded 常用于介绍企业或机构的创始团队。","在简历与新闻稿里，cofounder（联合创始人）比 “cofounded” 更常用来做头衔；而 “cofounded” 多用于叙述过去发生的动作（过去式/过去分词）。"]}
{"word":"cofounder","summary":{"en":"A cofounder is someone who starts something together with others, especially a company.","zh":"cofounder 指与他人共同创办（尤其是公司）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who helps start (found) a company, organization, or project together with one or more other people.","zh":"（公司/组织/项目的）联合创始人；共同创办者。"},"examples":[{"en":"She is the cofounder of a tech startup that builds language-learning apps.","zh":"她是一家开发语言学习应用的科技初创公司的联合创始人。"},{"en":"The cofounders agreed to split ownership 50–50.","zh":"两位联合创始人同意把股份按50比50分配。"}]}],"synonyms":["co-founder","joint founder","founding partner"],"phonetic":"/ˌkoʊˈfaʊndɚ/","extraExplanation":["“co-”是常见前缀，表示“共同、一起”（如 co-worker 同事，co-author 合著者）。因此 cofounder 指“共同创立的人”。","拼写上也常见写作 co-founder（带连字符）或 cofounder（不带连字符）；两者都常用。"]}
{"word":"cofounders","summary":{"en":"Cofounders are people who start something together, especially a company.","zh":"cofounders 指共同创办某事（尤指公司）的人，即“联合创始人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"One of the people who start a company, organization, or project together with one or more others.","zh":"（与他人）共同创办公司、组织或项目的人；联合创始人。"},"examples":[{"en":"The cofounders met in college and started the company in 2019.","zh":"两位联合创始人在大学相识，并于2019年创办了公司。"},{"en":"She is a cofounder of a nonprofit that supports new immigrants.","zh":"她是一家帮助新移民的非营利组织的联合创始人。"}]}],"synonyms":["co-founder","joint founder","founding partner"],"phonetic":"/ˌkoʊˈfaʊndərz/","extraExplanation":["“co-”是常见前缀，意思是“共同、一起”（如 coworker 同事，coauthor 合著者）。因此 cofounder = co-（共同）+ founder（创始人）。","拼写上既常见 cofounder，也常见连字符形式 co-founder；在简历、新闻稿、公司网站中两种都可见。"]}
{"word":"cofounding","summary":{"en":"Cofounding means starting something together with other founders.","zh":"cofounding 指与他人一起共同创立某个组织或项目。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"helping to start and build an organization, company, project, or institution together with one or more other founders","zh":"与他人共同创立并建设一个组织、公司、项目或机构"},"examples":[{"en":"She is cofounding a nonprofit to support first-generation college students.","zh":"她正在与他人共同创立一个非营利组织，来支持第一代大学生。"},{"en":"After cofounding the startup, he focused on product design.","zh":"共同创立这家初创公司之后，他专注于产品设计。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or process of creating something as a cofounder","zh":"作为共同创办人进行创立的行为或过程"},"examples":[{"en":"Cofounding often involves sharing risk and decision-making.","zh":"共同创立通常意味着分担风险并共同决策。"}]}],"synonyms":["co-establishing","starting together","launching together"],"phonetic":"/ˌkoʊˈfaʊndɪŋ/","extraExplanation":["“cofounding”来自动词“cofound”（共同创立）。也常写作“co-founding”（带连字符），两者含义相同。","注意不要与“confounding”（令人困惑的、使困惑的）混淆：cofounding = 共同创立；confounding = 使人困惑。"]}
{"word":"cofoundress","summary":{"en":"A cofoundress is a woman who helps found something, especially a company or organization.","zh":"cofoundress 指女性共同创办人，即与他人一起创立公司或组织的女性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A woman who helps start (found) an organization, company, project, or institution; a female co-founder.","zh":"（女性）共同创办人；与他人一起创立组织/公司/项目/机构的女性。"},"examples":[{"en":"She is the cofoundress of a nonprofit that supports rural schools.","zh":"她是一个支持乡村学校的非营利组织的共同创办人。"},{"en":"The cofoundress and her partners launched the company in 2018.","zh":"这位共同创办人和她的合伙人在2018年创办了这家公司。"}]}],"synonyms":["cofounder","co-founder","founder (female)","co-creator"],"phonetic":"/ˌkoʊˈfaʊndrəs/","extraExplanation":["“cofoundress”带有性别标记（强调创办者是女性）。在现代英语里，更常见、更中性的写法是“cofounder / co-founder”，不论性别都可用；很多职场语境也更推荐使用中性称呼。","拼写上也常见“co-founder / cofounder”。“cofoundress”相对少见，可能出现在较正式或强调女性身份的文本中。"]}
{"word":"cofounds","summary":{"en":"“Cofounds” means “starts something together with others” (he/she/it cofounds).","zh":"“cofounds”表示“与他人共同创立”，是 co-found 的第三人称单数形式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to help start (a company, organization, or project) together with one or more other people; the third-person singular form of “co-found”","zh":"与他人共同创立（公司、组织或项目）；“co-found”的第三人称单数形式"},"examples":[{"en":"She cofounds a small tech startup with two classmates.","zh":"她和两位同学共同创办了一家小型科技初创公司。"},{"en":"He cofounds the charity to support local students.","zh":"他与他人共同创立了这个慈善机构来帮助本地学生。"},{"en":"Every year, the program cofounds new community projects with residents.","zh":"这个项目每年都会与居民共同发起新的社区项目。"}]}],"synonyms":["co-establishes","jointly founds","helps start","sets up together"],"phonetic":"/ˌkoʊˈfaʊndz/","extraExplanation":["“co-”表示“共同、一起”。“cofound”有时会写成带连字符的“co-found”，更清晰，也能避免与另一个单词“confound”（使困惑、混淆）在拼写上产生误读。","时态变化：cofound / cofounds / cofounded / cofounding。名词常用“cofounder / co-founder”（联合创始人）。"]}
{"word":"cofreighter","summary":{"en":"A (rare) term meaning a freighter used as a co-carrier—sharing cargo transport with another carrier or arrangement.","zh":"一个较少见的词，指作为共同承运方使用的货轮，即与其他承运方/安排共同运输货物的货船。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cargo ship (freighter), especially one operating together with another carrier or as part of a shared shipping arrangement; a co-carrier freighter (rare).","zh":"货轮；（尤指）与其他承运方共同运营、共同承运的货船（较少见）。"},"examples":[{"en":"The company used a cofreighter to move grain across the Atlantic during peak season.","zh":"在旺季，这家公司使用一艘共同运营的货轮把谷物运过大西洋。"},{"en":"Under the agreement, the cofreighter handled the westbound cargo while a partner ship handled the eastbound route.","zh":"根据协议，这艘共同承运的货轮负责西行货物，合作方的船负责东行航线。"}]}],"synonyms":["freighter","cargo ship","merchant ship","co-carrier (context)"],"phonetic":"/koʊˈfreɪtər/","extraExplanation":["“cofreighter”通常可理解为“co- + freighter（共同的/合作的 + 货轮）”。在现代航运英语里，更常见的表达是“co-carrier（共同承运人）”“partner carrier（合作承运方）”“vessel-sharing arrangement（船舶共享安排）”等；“cofreighter”本身比较少见，可能出现在特定合同、旧资料或行业内部用法中。"]}
{"word":"cofrian","summary":{"en":"“Cofrian” is not a standard English word; it’s likely a misspelling or a proper name.","zh":"“cofrian”不是标准英语词，可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a name (proper noun), or a word from another language.","zh":"不是标准英语单词，可能是拼写错误、专有名词（人名/地名/品牌名），或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “cofrian” in an English dictionary—did you mean “coffer” or “coffering”?","zh":"我在英语词典里找不到“cofrian”——你是不是想写“coffer”或“coffering”？"},{"en":"Cofrian appears to be used as a name in some contexts.","zh":"在某些语境中，Cofrian 似乎被当作名字来使用。"}]}],"phonetic":"/ˈkoʊfriən/","extraExplanation":["“cofrian”在常见英语词典中没有收录，因此更可能是：1）拼错了；2）专有名词；3）其他语言的词（例如西班牙语/法语等）的转写。","如果你告诉我它出现的句子、领域（比如游戏、医学、地名、人名）或你想表达的意思，我可以帮你精准判断并给出正确拼写与用法。","可能的相近英文拼写（仅供排查）：coffer（保险箱/金库；也可指“把……放入”）、coffret（法语借词，常指礼盒/套装，在化妆品语境常见）。"]}
{"word":"Cofsky","summary":{"en":"“Cofsky” is mainly used as a surname (a person’s last name), not a common English word.","zh":"“Cofsky”主要用作姓氏，不是常见英文单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A family name (surname). It is not a common English vocabulary word and is usually used as a person’s last name.","zh":"一个姓氏（家族姓）。它不是常见的英文词汇，通常用作人的姓。"},"examples":[{"en":"Ms. Cofsky will lead today’s meeting.","zh":"Cofsky 女士将主持今天的会议。"},{"en":"I found a paper by Cofsky in the library database.","zh":"我在图书馆数据库里找到一篇 Cofsky 写的论文。"}]}],"phonetic":"/ˈkɔf.ski/","extraExplanation":["“Cofsky”更像是人名/姓氏，而不是可查到的常用英语单词。很多姓氏以 -sky 结尾（也常写作 -ski），在东欧/斯拉夫语系姓名中较常见，进入英语后通常保留拼写与读音。","如果你是在某个句子、书名、品牌或网名里看到 “Cofsky”，含义可能取决于具体语境；也有可能是拼写变体或打字错误。你可以把原句发来，我可以帮你判断更准确的意思与用法。"]}
{"word":"coft","summary":{"en":"“Coft” is a Scots/archaic form meaning “bought” (past of “buy”).","zh":"“coft”是苏格兰方言／古语形式，意思是“bought”（buy 的过去式）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Scots, dialect, archaic) past tense and past participle of “buy”; meaning “bought.”","zh":"（苏格兰方言／古语）“buy”的过去式和过去分词；意思是“买了／买到的（= bought）”。"},"examples":[{"en":"I coft this jacket at the market yesterday.","zh":"我昨天在集市上买了这件夹克。"},{"en":"He said he’d coft the bread on his way home.","zh":"他说他回家路上会把面包买回来。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Scots, dialect) describing something that has been bought; “purchased.”","zh":"（苏格兰方言）形容“买来的／购得的”。"},"examples":[{"en":"That’s a coft gift, not handmade.","zh":"那是买来的礼物，不是手工做的。"}]}],"synonyms":["bought","purchased"],"phonetic":"/kɔft/","extraExplanation":["“coft”主要见于苏格兰英语（Scots）和较老的文学语体，相当于标准英语里的“bought”。在现代日常英语写作中通常不用；如果你在诗歌、民谣或方言对话里看到它，多半是在营造地方色彩。"]}
{"word":"cofunction","summary":{"en":"“Cofunction” is a specialized math term meaning a function related to another one in a paired or “dual/opposite” way, often discussed in advanced topics like category theory.","zh":"“Cofunction”是一个较专门的数学术语，指与另一个函数成对或以“对偶/反向”方式相关的函数，常见于范畴论等高阶主题。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(mathematics) A function that pairs with another function in a specific relationship, especially in category theory: for a function f: A → B, a cofunction often refers to a related mapping going in the opposite direction (informally, something like B → A) or a “dual” notion to the original function in a given framework.","zh":"（数学）与另一个函数在特定关系中成对出现的函数，常见于范畴论等领域：例如对函数 f: A → B，“共函数/对偶函数（cofunction）”常指在某种意义上与之相对、方向相反（粗略类比为 B → A）或在某个理论框架下的“对偶”概念。"},"examples":[{"en":"In category theory, people sometimes discuss a function and its cofunction when switching to the opposite category.","zh":"在范畴论里，人们有时会在转到对偶范畴（opposite category）时讨论一个函数及其“共函数/对偶函数”。"},{"en":"The term “cofunction” isn’t common in everyday math classes; it usually appears in more advanced, specialized texts.","zh":"“cofunction”这个词在日常数学课里并不常见；它通常出现在更高阶、更专门的文献中。"}]}],"synonyms":["dual function","opposite (mapping)","adjoint (in some contexts)"],"phonetic":"/koʊˈfʌŋkʃən/","extraExplanation":["“co-”这个前缀常表示“共同、对应、对偶”（如 coauthor 合著者、cooperate 合作）。在数学里，co-也常用来表达“对偶/反向”的概念（如 codomain、coproduct）。不过“cofunction”并不是一个在所有数学分支都固定使用的标准术语，不同作者可能用它指不同但相关的“对偶”构造。","如果你是在特定教材/论文里看到 cofunction，最好结合上下文（例如是否在谈 opposite category、dual、adjoint 等）来确定它究竟指哪一种对应关系。"]}

