{"word":"cog","summary":{"en":"Cog most commonly means a tooth on a gear; figuratively, it can mean a small, replaceable person in a large system.","zh":"cog最常指齿轮上的齿；引申义可指大体系里可替换的小角色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tooth on the edge of a wheel or gear that fits into another gear to make a machine move smoothly.","zh":"（齿轮边缘的）齿；与另一齿轮啮合，使机器平稳运转。"},"examples":[{"en":"One broken cog can stop the whole machine.","zh":"一个齿断了就可能让整台机器停摆。"},{"en":"The watchmaker replaced a tiny cog inside the clock.","zh":"修表匠更换了钟表里一个很小的齿轮齿。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who is a small, replaceable part of a large organization or system (often used critically).","zh":"（常带批评意味）大机构/体系里可替换的小角色；“小齿轮”。"},"examples":[{"en":"He felt like just a cog in the company, easily replaced.","zh":"他觉得自己在公司里只是个小齿轮，随时可被替代。"},{"en":"In a big bureaucracy, it’s easy to become a cog in the machine.","zh":"在大型官僚体系里，人很容易变成“机器上的一颗螺丝钉/小齿轮”。"}]},{"partOfSpeech":"v.","definition":{"en":"To provide with cogs; to fit or connect parts so they work together like gears.","zh":"装齿轮齿；（使部件）像齿轮一样啮合、配合运作。"},"examples":[{"en":"The new system is designed so the parts cog together efficiently.","zh":"新系统的设计让各部分能高效地配合运作。"}]}],"synonyms":["gear tooth","tooth (of a gear)","small part","functionary"],"phonetic":"/kɑɡ/","extraExplanation":["“a cog in the machine”是常见隐喻，把组织或社会比作机器，强调个人像齿轮一样只是整体中的一小部分；有时表达无力感或被物化的感觉。","相关搭配：cogwheel（齿轮）；cog in the machine（机器中的一枚小齿轮/可替代的小人物）；cog together（协调配合）。"]}
{"word":"cog-like","summary":{"en":"Similar in shape or texture to a gear tooth or cog.","zh":"形状或纹理像齿轮（齿）一样。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a cog (a small gear with teeth); having tooth-like edges like a gear.","zh":"像齿轮（齿轮上的齿）一样的；边缘呈齿状的。"},"examples":[{"en":"The machine uses a cog-like wheel to grip and move the paper forward.","zh":"这台机器用一个齿轮状的轮子来夹住并把纸向前送。"},{"en":"Under the microscope, the cell’s surface looked cog-like, with many tiny bumps around the edge.","zh":"在显微镜下，这个细胞表面看起来像齿轮一样，边缘有许多细小的凸起。"},{"en":"The designer added a cog-like pattern to give the watch a mechanical feel.","zh":"设计师加入了齿轮状的图案，让手表更有机械感。"}]}],"synonyms":["gearlike","toothed","serrated","notched"],"phonetic":"ˈkɑɡˌlaɪk","extraExplanation":["“cog-like”常用连字符（hyphen）来表示“像……一样的”形容词结构，也常见写法是“coglike”。两者意思相同，选择哪一种多与写作风格或出版规范有关。","这个词多用于描述外形或结构（如机械零件、纹理、边缘形状），比喻用法较少。"]}
{"word":"Cogan","summary":{"en":"Cogan is usually a proper noun: a surname or a place name (notably an area in Wales).","zh":"Cogan 通常是专有名词：常见作姓氏或地名（尤其指威尔士的一个地区）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a surname (family name), most common in English-speaking countries. Examples: • EN: Ms. Cogan is our new math teacher. • EN: I read a book by John Cogan. • EN: The email is from Alex Cogan.","zh":"（姓氏）Cogan，常见于英语国家。例：• 中：Cogan 女士是我们的新数学老师。• 中：我读过 John Cogan 写的一本书。• 中：这封邮件来自 Alex Cogan。"},"examples":[{"en":"Ms. Cogan is our new math teacher.","zh":"Cogan 女士是我们的新数学老师。"},{"en":"I read a book by John Cogan.","zh":"我读过 John Cogan 写的一本书。"},{"en":"The email is from Alex Cogan.","zh":"这封邮件来自 Alex Cogan。"}]},{"partOfSpeech":"other","definition":{"en":"a place name, especially Cogan: an area near Penarth in the Vale of Glamorgan, Wales (UK). Examples: • EN: We took the train to Cogan station. • EN: Cogan is close to Cardiff.","zh":"（地名）Cogan：英国威尔士格拉摩根谷（Vale of Glamorgan）彭阿瑟（Penarth）附近的地区。例：• 中：我们坐火车到 Cogan 车站。• 中：Cogan 离加的夫（Cardiff）很近。"},"examples":[{"en":"We took the train to Cogan station.","zh":"我们坐火车到 Cogan 车站。"},{"en":"Cogan is close to Cardiff.","zh":"Cogan 离加的夫很近。"}]}],"phonetic":"/ˈkoʊɡən/","extraExplanation":["“Cogan”多见于专有名词：要么是姓氏，要么是英国威尔士的地名。作为姓氏时，通常不翻译，只按英文读音音译或直接保留拼写。","如果你是在某本书/论文里看到“Cogan”（例如作者名、地名、机构名），我也可以根据上下文帮你判断具体指哪一个。"]}
{"word":"cogboat","summary":{"en":"A cogboat is a medieval Northern European merchant sailing ship (a “cog”).","zh":"cogboat 指中世纪北欧常见的一种商用帆船（柯克船），也常简称为 cog。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medieval European sailing ship (especially in the North and Baltic Seas), typically a broad, sturdy merchant vessel with one mast; also simply called a “cog.”","zh":"（中世纪欧洲的）柯克船/单桅商船，常见于北海与波罗的海一带；也可直接称为 cog（柯克船）。"},"examples":[{"en":"In the Middle Ages, merchants often shipped wool and timber in a cogboat across the North Sea.","zh":"在中世纪，商人常用柯克船把羊毛和木材运过北海。"},{"en":"The museum’s model shows a cogboat with a high stern and a single square sail.","zh":"博物馆的模型展示了一艘船尾较高、单桅方帆的柯克船。"}]}],"synonyms":["cog","medieval merchant ship"],"phonetic":"/ˈkɑɡˌboʊt/","extraExplanation":["“cogboat”在现代英语里不算常用词；历史与航海语境中更常见的说法是“cog”。“cog/cogboat”多指12–14世纪北欧常用的宽体商船，常被认为与后来的汉萨同盟贸易兴盛有关。"]}
{"word":"Cogen","summary":{"en":"“Cogen” is an informal term for cogeneration/CHP: making electricity and useful heat together.","zh":"“Cogen”是“cogeneration/CHP（热电联产）”的非正式说法，指同时产电并利用余热。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Short for “cogeneration”: producing electricity and useful heat at the same time (also called combined heat and power, CHP).","zh":"（非正式）“cogeneration”的简称：同时生产电力并回收可利用的热能（也叫热电联产，CHP）。"},"examples":[{"en":"The factory installed a cogen system to cut energy costs.","zh":"这家工厂安装了热电联产（cogen）系统来降低能源成本。"},{"en":"Cogen plants often use the waste heat for heating buildings or making steam.","zh":"热电联产电厂常把余热用于供暖或产生蒸汽。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing equipment or projects related to cogeneration (used before a noun).","zh":"（作定语）指与热电联产相关的设备或项目。"},"examples":[{"en":"They’re building a cogen plant near the campus.","zh":"他们正在校园附近建一座热电联产电厂。"},{"en":"The hospital signed a contract for cogen equipment.","zh":"医院签了热电联产设备的合同。"}]}],"synonyms":["cogeneration","CHP","combined heat and power"],"phonetic":"/ˈkoʊdʒɛn/","extraExplanation":["“cogen”多见于能源、工程和商业语境，是口语/行业缩写；正式写作中更常写全称“cogeneration”或用“CHP (combined heat and power)”。","热电联产的核心好处是提高燃料利用效率：把发电过程中的“废热”回收再利用，因此常用于工厂、医院、大学园区等需要稳定热/蒸汽的场所。"]}
{"word":"cogence","summary":{"en":"Cogence is a rare noun meaning the logical, convincing power of an argument (more commonly spelled “cogency”).","zh":"Cogence 是一个较少见的名词，表示论证的逻辑性与说服力（更常见拼写为 cogency）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) the quality of being clear, logical, and convincing; persuasive force of an argument.","zh":"（罕见）论证或理由的“说服力、严密性”；清晰而合乎逻辑、令人信服的力量。"},"examples":[{"en":"The cogence of her reasoning convinced the committee to approve the plan.","zh":"她推理的严密与说服力让委员会同意了这个计划。"},{"en":"We were impressed by the cogence of the evidence presented in court.","zh":"法庭上提交的证据之有力与说服性让我们印象深刻。"}]}],"synonyms":["cogency","persuasiveness","force","convincingness","logic"],"phonetic":"/ˈkoʊdʒəns/","extraExplanation":["“cogence”在现代英语里非常少见；更常用、也更自然的写法是“cogency”。在学术写作或正式表达中，通常建议用“cogency”。"]}
{"word":"cogences","summary":{"en":"Cogency means the quality of being clear, logical, and convincing—especially in arguments or writing.","zh":"Cogency 指论证或表达的“清晰、严密且有说服力”的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(of an argument, reason, or evidence) the quality of being clear, logical, and convincing; persuasive force.","zh":"（论点、理由或证据的）说服力；逻辑严密、清晰有力的特质。"},"examples":[{"en":"The cogency of her argument changed the committee’s mind.","zh":"她论证的说服力改变了委员会的看法。"},{"en":"We were impressed by the cogency of the evidence presented in court.","zh":"我们对法庭上出示的证据之有力印象深刻。"}]},{"partOfSpeech":"n.","definition":{"en":"clarity and effectiveness in expressing ideas, especially in speaking or writing.","zh":"（表达上的）清晰与有效；尤指口头或书面表达条理分明。"},"examples":[{"en":"He writes with cogency, even when the topic is complex.","zh":"即使主题复杂，他的写作也很清晰有力。"},{"en":"Try to improve the cogency of your conclusion by stating your main point directly.","zh":"试着在结论中直接点出要旨，以增强表达的清晰与力度。"}]}],"synonyms":["persuasiveness","convincingness","force","logic","clarity"],"phonetic":"/ˈkoʊdʒənsi/","extraExplanation":["你输入的“cogences”在英语里不常见；更常见的形式是 **cogency**（名词），复数是 **cogencies**。","常见相关词：**cogent**（形容词，意为“有说服力的、逻辑严密的”）。例如：a cogent argument（一个有力的论证）。","词源上与拉丁语 *cogere*（“迫使、驱使”）有关，因此有“论证力量把人‘推向’某个结论”的含义。"]}
{"word":"cogencies","summary":{"en":"“Cogencies” means multiple instances or aspects of logical, persuasive force—especially in arguments or reasons.","zh":"“Cogencies”指（多个/多方面的）逻辑严密且有说服力之处，常用于论证或理由。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being clear, logical, and persuasive (often used about an argument or reason).","zh":"（论证、理由等）有说服力、逻辑严密且清晰的特质。"},"examples":[{"en":"The cogencies of her argument convinced the committee.","zh":"她论证的说服力让委员会信服。"},{"en":"Even if you disagree, you can’t deny the cogencies behind his concerns.","zh":"即使你不同意，你也不能否认他担忧背后的合理性与说服力。"}]}],"synonyms":["persuasiveness","force","convincingness","soundness","validity"],"phonetic":"/ˈkoʊdʒənsi/","extraExplanation":["“cogencies”是名词“cogency”的复数形式，表示“多种/多方面的说服力、多个有力的理由”。在日常英语里更常见的是单数“cogency”，或用更口语的表达如“strong reasons / persuasive points”。","词根上与形容词“cogent”（有说服力的）同源，写作中常用于评价论证质量（如学术写作、评论、法律文本）。"]}
{"word":"cogency","summary":{"en":"Cogency means the quality of being clear, logical, and persuasive, especially in an argument.","zh":"Cogency 指（论点/理由）清晰、合乎逻辑并且很有说服力的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being clear, logical, and convincing (especially of an argument or reason)","zh":"（尤指论点或理由）清晰、有逻辑且有说服力的品质"},"examples":[{"en":"The cogency of her argument changed several minds in the room.","zh":"她论证的说服力让房间里好几个人改变了看法。"},{"en":"We were impressed by the cogency of his evidence and reasoning.","zh":"我们对他证据与推理的严密性（说服力）印象深刻。"}]}],"synonyms":["persuasiveness","forcefulness","logic","soundness","conviction"],"phonetic":"/ˈkoʊdʒənsi/","extraExplanation":["“cogency”常用于较正式的学术/写作语境，强调“论证结构严密、推理连贯，因此令人信服”。日常口语里更常用“convincing”“strong”来表达类似意思。","词源上与拉丁语“cogere”（意为“聚集、促使”）相关，因此带有“把人/想法‘推向’某个结论”的感觉。常见搭配：the cogency of an argument/reason/evidence。"]}
{"word":"cogener","summary":{"en":"Cogener is a rare form, usually meaning the same as congener: something of the same kind/genus (often used in biology or chemistry).","zh":"cogener 很少见，通常等同于 congener：指同类/同属的成员（多用于生物学或化学）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare; usually spelled **congener**) a thing—especially an organism or chemical compound—that belongs to the same group or kind as another; a member of the same genus or category.","zh":"（罕见；通常拼作 **congener**）与另一事物同类的东西；尤指与另一生物同属（同一属）或同类别的成员，或同系列的化合物。"},"examples":[{"en":"In biology, a species is compared with its congener(s) in the same genus.","zh":"在生物学中，一个物种常与同属的近缘物种（congeners）进行比较。"},{"en":"These pollutants include several dioxin congeners with similar structures.","zh":"这些污染物包括若干结构相近的二噁英同系物（congeners）。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare; usually spelled **congeneric**) belonging to the same group, genus, or kind; closely related in type.","zh":"（罕见；通常对应 **congeneric**）同类的；同属的；同一种类或类型上近缘的。"},"examples":[{"en":"Researchers examined cogener organisms to trace evolutionary differences.","zh":"研究人员检查同属的生物以追踪进化差异。"}]}],"synonyms":["congener","counterpart","peer","relative"],"phonetic":"/koʊˈdʒɛnər/","extraExplanation":["“cogener”在现代英语中非常少见，多数情况下是“congener”的旧拼法/变体或拼写错误。学术写作（生物分类学、化学同系物/同系物群）中几乎一律使用“congener”（名词）以及“congeneric”（形容词）。","词源上与拉丁语“con-（一起、共同）+ genus（种类、属）”相关，因此核心含义是“同一类/同一属的成员”。"]}
{"word":"cogeneration","summary":{"en":"Cogeneration is making electricity and useful heat at the same time from one energy source to improve efficiency.","zh":"Cogeneration（热电联产）指用同一能源同时发电并回收利用热能，以提高效率。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The production of electricity and useful heat at the same time from the same energy source (often a power plant or industrial facility).","zh":"用同一种能源同时生产电力和可利用热能（常见于电厂或工业设施）。"},"examples":[{"en":"The university installed a cogeneration system to make electricity and heat buildings more efficiently.","zh":"这所大学安装了热电联产系统，以更高效地发电并为建筑供热。"},{"en":"Cogeneration can reduce fuel use because the waste heat is captured instead of released into the air.","zh":"热电联产可以减少燃料消耗，因为它把余热回收利用，而不是直接排放到空气中。"}]}],"synonyms":["combined heat and power (CHP)","CHP","co-generation"],"phonetic":"/ˌkoʊ.dʒen.əˈreɪ.ʃən/","extraExplanation":["“cogeneration”也常写作“co-generation”，在能源领域常与“CHP（combined heat and power，热电联产）”同义或紧密相关。","常见应用场景包括：工业蒸汽与发电同时供应、医院/学校的集中供热+供电、区域供热系统等。","与普通发电相比，热电联产的核心优势是利用原本会浪费的“余热（waste heat）”，因此整体能效更高、碳排放通常更低。"]}
{"word":"cogeneric","summary":{"en":"“Cogeneric” means “belonging to the same genus,” and more broadly “of the same kind.”","zh":"“cogeneric”指“同属的”，更广义可指“同类的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology, taxonomy) Belonging to or coming from the same genus.","zh":"（生物/分类学）同属的；属于同一属的。"},"examples":[{"en":"Lions and tigers are not cogeneric; they belong to different genera.","zh":"狮子和老虎不是同属的；它们属于不同的属。"},{"en":"The study compared cogeneric species to see how traits vary within a genus.","zh":"这项研究比较了同属物种，以观察同一属内性状如何变化。"}]},{"partOfSpeech":"adj.","definition":{"en":"More generally: of the same general kind or category; closely related in type.","zh":"（更一般用法）同类的；同种类型的；在类别上很接近的。"},"examples":[{"en":"The author groups cogeneric themes—loss, memory, and identity—across the poems.","zh":"作者在这些诗中把同类主题——失落、记忆与身份——归在一起。"},{"en":"When comparing policies, use cogeneric measures so the results are fair.","zh":"比较政策时，应使用同类指标，这样结果才公平。"}]}],"synonyms":["congeneric","same-genus","related","akin"],"phonetic":"/ˌkoʊdʒəˈnɛrɪk/","extraExplanation":["“cogeneric”常见于学术写作，尤其是生物分类学。分类层级大致是：界 kingdom → 门 phylum → 纲 class → 目 order → 科 family → 属 genus → 种 species；因此“同属（cogeneric）”比“同科（confamilial）”更具体。","词源可理解为 co-（共同）+ generic（同类/属的）。在非生物语境中也能用，但偏正式、书面。"]}
{"word":"cogenetic","summary":{"en":"Cogenetic means “from the same origin” or “formed together from a common source,” often in scientific contexts.","zh":"Cogenetic 指“同源/共同起源、由共同来源形成”，多用于科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the same origin; produced or formed together from a common source (often used in biology, geology, and chemistry).","zh":"同源的；共同起源的；由同一来源一起形成的（常用于生物、地质与化学语境）。"},"examples":[{"en":"The researchers argue that the two populations are cogenetic, descending from a single ancestral group.","zh":"研究人员认为这两个群体是同源的，源自同一个祖先群体。"},{"en":"These minerals are likely cogenetic because they crystallized under the same conditions.","zh":"这些矿物很可能是同源的，因为它们在相同条件下结晶形成。"}]}],"synonyms":["common-origin","same-origin","comagmatic (geology)","related"],"phonetic":"/ˌkoʊdʒəˈnɛtɪk/","extraExplanation":["“cogenetic”常见于学术写作，尤其是地质学/岩石学中：用来说明矿物、岩浆或岩体“来自同一次（或同一来源）形成过程”，强调共同成因或共同来源。","词形上可理解为 co-（共同）+ genetic（起源的/生成的）。这里的“genetic”更多指“成因/起源”，不一定只指DNA意义上的“遗传”。"]}
{"word":"cogenial","summary":{"en":"Cogenial means friendly, agreeable, and pleasant to be with (often written as congenial).","zh":"cogenial 指“友善随和、合得来、令人愉快的”（更常见拼写为 congenial）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person) pleasant, friendly, and easy to get along with; (of a situation/place) comfortable and suitable.","zh":"（指人）友善随和、容易相处的；（指环境/氛围）令人愉快、舒适且合适的。"},"examples":[{"en":"Our new teammate is cogenial and fits in quickly.","zh":"我们的新队友很随和，很快就融入了团队。"},{"en":"They had a cogenial dinner with lots of laughter.","zh":"他们共进了一顿气氛融洽、笑声不断的晚餐。"}]}],"synonyms":["congenial","friendly","agreeable","pleasant","amiable","sociable"],"phonetic":"/kənˈdʒiːniəl/","extraExplanation":["“cogenial”并不是最常见的拼写；在现代英语里更常用的是 **congenial**（含义相同）。在一些场合你会看到带连字符的 **co-genial**，用来强调“彼此都很合得来/共同营造愉快氛围”的意思，但日常写作与考试中建议用 **congenial**。"]}
{"word":"cogent","summary":{"en":"“Cogent” means clear, logical, and persuasive—used mostly for arguments, reasons, or points.","zh":"“Cogent”指清晰、有逻辑、很有说服力（多用于论点、理由、观点）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Clear, logical, and convincing (especially of an argument or explanation).","zh":"（尤指论证或解释）清晰有条理、合乎逻辑且有说服力的。"},"examples":[{"en":"She gave a cogent argument for changing the policy.","zh":"她提出了一个很有说服力的理由来支持修改政策。"},{"en":"The report is concise and cogent.","zh":"这份报告简明而有力。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relevant and to the point; directly connected to what matters.","zh":"切中要点的；与关键问题直接相关的。"},"examples":[{"en":"Please keep your comments cogent to the main issue.","zh":"请让你的评论紧扣主要问题。"},{"en":"He asked a few cogent questions that clarified the plan.","zh":"他问了几个切中要害的问题，把计划讲清楚了。"}]}],"synonyms":["persuasive","convincing","compelling","sound","clear","well-reasoned"],"phonetic":"/ˈkoʊdʒənt/","extraExplanation":["“cogent”常用于较正式的语境（写作、演讲、学术或职场）。搭配很常见：a cogent argument/reason/point/case（有力的论点/理由/观点/论证）。","词源上与拉丁语“co-（一起）+ agere（推动、驱动）”相关，给人的感觉是“把想法推动到位”，因此强调逻辑连贯与说服力。"]}
{"word":"cogently","summary":{"en":"“Cogently” means speaking or writing in a clear, logical, and persuasive way.","zh":"“cogently”表示说话或写作清晰有逻辑、论证严密并很有说服力。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a clear, logical, and convincing way.","zh":"以清晰、有逻辑且有说服力的方式。"},"examples":[{"en":"She argued cogently that the policy would hurt small businesses.","zh":"她有理有据地论证了这项政策会伤害小企业。"},{"en":"He explained the problem cogently, so everyone understood.","zh":"他把问题讲得很清楚、很有条理，所以大家都明白了。"}]}],"synonyms":["clearly","logically","convincingly","persuasively","coherently"],"phonetic":"/ˈkoʊdʒəntli/","extraExplanation":["“cogently”来自形容词“cogent”（有说服力的、论证严密的）。常见搭配有：argue/say/put forward a point cogently（有力地论证/陈述/提出观点）。","语气与使用场景：它比较正式，常用于写作、演讲、辩论或学术语境；日常口语里更常用“clearly”“convincingly”。"]}
{"word":"Coggan","summary":{"en":"Coggan is most commonly a surname (a proper name for a person or family).","zh":"Coggan 最常见的用法是姓氏（用于指代个人或家族的专有名词）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a surname (family name), used for people (e.g., an author, athlete, or other public figure named Coggan).","zh":"一个姓氏（家族姓），用于指代名为 Coggan 的人（例如作者、运动员或其他公众人物）。"},"examples":[{"en":"Dr. Coggan published a paper on exercise training.","zh":"Coggan 博士发表了一篇关于运动训练的论文。"},{"en":"I met Ms. Coggan at the conference.","zh":"我在会议上见到了 Coggan 女士。"}]},{"partOfSpeech":"other","definition":{"en":"a proper name that may also appear as a place name or business name (less common; depends on context).","zh":"也可能用作地名或机构/商号名称的专有名词（较少见，取决于语境）。"},"examples":[{"en":"They opened a small shop called Coggan on Main Street.","zh":"他们在主街开了一家名为 Coggan 的小店。"}]}],"phonetic":"/ˈkɑɡən/","extraExplanation":["“Coggan”主要作为英语世界中的姓氏出现；在正式写作中通常首字母大写。","如果你是在特定领域看到它（例如运动科学、音乐、地名），可以告诉我具体句子或出处，我可以帮你确认它指的是哪位人物或哪一个地点/机构。"]}
{"word":"cogged","summary":{"en":"Cogged usually means “having gear-like teeth,” and less commonly “rigged for cheating” (e.g., cogged dice).","zh":"cogged通常指“带齿轮齿的/能咬合的”，较少见时也指“被做手脚用于作弊的”（如被做手脚的骰子）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having cogs (teeth) or shaped with gear-like notches; fitted with gear teeth so parts can lock or turn together.","zh":"带齿轮齿的；呈齿轮状缺口的；装有齿使部件能咬合或联动的。"},"examples":[{"en":"The old machine has a cogged wheel that turns the belt.","zh":"那台旧机器有一个带齿的轮子，用来带动皮带转动。"},{"en":"A cogged belt helps the motor grip better and reduces slipping.","zh":"带齿皮带能让电机抓得更牢，减少打滑。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of dice, cards, or a game) secretly altered or “fixed” to cheat; rigged.","zh":"（指骰子、纸牌或游戏）被暗中做手脚的；作弊的；被操纵的。"},"examples":[{"en":"The gambler was accused of using cogged dice.","zh":"那个赌徒被指控使用被做过手脚的骰子。"},{"en":"They checked the equipment to make sure nothing was cogged.","zh":"他们检查了器材，确保没有被人做手脚。"}]}],"synonyms":["toothed","gear-toothed","notched","rigged","fixed","loaded"],"phonetic":"/kɑɡd/","extraExplanation":["“cogged”来自名词/动词“cog”。在机械语境中，它指“有齿的、能咬合的”（像齿轮或带齿皮带）。在较旧或较文学化的用法里，“cog”也可指“在骰子上做记号/加重以作弊”，因此“cogged dice”就是“被做手脚的骰子”。"]}
{"word":"cogger","summary":{"en":"A rare word for a horse dealer/trader (often in older British use), sometimes implying dishonesty; also rarely a swindler.","zh":"较少见的词，指（多为旧时英式用法的）马贩子/马匹交易商，常带不太诚实的暗示；也可少见地指骗子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(chiefly British, informal/old-fashioned) A horse dealer or horse trader, sometimes with the suggestion of being tricky or dishonest.","zh":"（主要英式，非正式/旧用法）马贩子、马匹交易商；有时暗示做生意不太老实。"},"examples":[{"en":"In the old market town, a cogger would buy horses cheaply and sell them for a profit.","zh":"在旧时的集镇里，马贩子会低价买马再加价卖出获利。"},{"en":"He warned me not to trust every cogger at the fair.","zh":"他提醒我别轻信集市上的每个马贩子。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) A person who cheats or tricks others; a swindler.","zh":"（少见）骗子；耍手段坑人的人。"},"examples":[{"en":"She called him a cogger after he changed the deal at the last minute.","zh":"他临时变卦改条件后，她骂他是个骗子。"}]}],"synonyms":["horse dealer","horse trader","dealer","swindler","con artist"],"phonetic":"/ˈkɑɡər/","extraExplanation":["“cogger”比较少见，带有较强的地域与时代色彩，常见于英国旧文本或方言环境；现代英语里更常用 horse dealer / horse trader。","它与动词“cog”（在某些旧用法里有“欺骗、动手脚”的意思）有关，因此有时会带出“做生意不老实”的负面联想。"]}
{"word":"coggers","summary":{"en":"“Coggers” is a Twitch-style slang exclamation meaning “awesome!” or “so exciting!” (often a playful variant of “poggers”).","zh":"“coggers”是偏 Twitch/游戏圈的网络感叹词，表示“太棒了/太激动了”，常被当作“poggers”的玩笑式变体。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"(Internet slang, especially on Twitch) An exclamation used to show excitement, amazement, or strong approval—similar to “awesome!” or “let’s go!”","zh":"（网络俚语，常见于 Twitch）表示兴奋、惊讶或强烈赞同的感叹，相当于“太棒了！”“冲啊！”"},"examples":[{"en":"Coggers! You actually beat the boss on your first try.","zh":"Coggers！你居然第一次就打过了那个 Boss。"},{"en":"Coggers, that was a crazy good play.","zh":"Coggers，这波操作太离谱了（太强了）。"},{"en":"He got the job offer—coggers!","zh":"他拿到工作 offer 了——coggers！"}]},{"partOfSpeech":"other","definition":{"en":"A joking/variant form of “poggers,” sometimes referring to the excited reaction itself or the “hype” moment.","zh":"一种带玩笑感的“poggers”变体，有时也指那种兴奋反应本身或“高光/嗨点”时刻。"},"examples":[{"en":"That comeback was pure coggers.","zh":"那波翻盘简直就是纯纯的 coggers（太燃了）。"},{"en":"Chat went full coggers when the goal went in.","zh":"进球那一刻，弹幕直接全员 coggers（全员嗨了）。"}]}],"synonyms":["poggers","let's go","hype","awesome","no way"],"phonetic":"/ˈkɑɡɚz/","extraExplanation":["“Coggers”通常被理解为从 Twitch/游戏圈的“poggers”衍生出来的戏仿/变体写法。更常见、更通用的说法是“poggers”。","使用场景偏口语和网络聊天；在正式写作、邮件或工作场合一般不使用。"]}
{"word":"coggie","summary":{"en":"“Coggie” most commonly refers (in Scottish dialect) to a small wooden bowl; online it can also be a misspelling/nickname for “corgi.”","zh":"“coggie”多指（苏格兰方言）小木碗/木盆；在网络语境中也可能是“corgi（柯基犬）”的误拼或昵称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scotland, informal/dialect) A small wooden bowl or dish, often used for food or drink.","zh":"（苏格兰方言/口语）小木碗、小木盆（常用来盛食物或饮料）。"},"examples":[{"en":"Grandad ate his porridge from a wooden coggie.","zh":"爷爷用一个小木碗（coggie）吃燕麦粥。"},{"en":"She brought water in a coggie from the kitchen.","zh":"她从厨房用小木盆（coggie）端来水。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, often online) A mistaken spelling or playful nickname for “corgi” (the dog breed).","zh":"（非正式，常见于网络）“corgi（柯基犬）”的误拼或俏皮写法/昵称。"},"examples":[{"en":"I thought you wrote “coggie,” but you meant “corgi.”","zh":"我还以为你写的是“coggie”，其实你想写“corgi（柯基）”。"},{"en":"That coggie is so cute! (meaning: corgi)","zh":"那只“coggie”太可爱了！（意思是柯基）"}]}],"synonyms":["(bowl sense) bowl","(bowl sense) dish","(corgi sense) corgi"],"phonetic":"/ˈkɔɡi/","extraExplanation":["“coggie”作为“木碗/木盆”的意思主要见于苏格兰英语（Scots/Scottish English）语境，在其他地区不常用；日常英语里更常说 bowl / dish。","在社交媒体或聊天中看到“coggie”，很多时候只是把“corgi”拼错或故意卖萌的写法；如果你指的是狗，标准拼写是 corgi。"]}
{"word":"cogging","summary":{"en":"“Cogging” most commonly means the jerky, uneven motion (torque ripple) in certain electric motors; less commonly, it refers to fitting/using gear teeth.","zh":"“Cogging”最常指某些电机转动时的顿挫感/转矩脉动（齿槽效应）；较少见时可指装齿或齿轮传动相关动作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A jerky, uneven motion or torque ripple in an electric motor (especially a stepper motor or some permanent‑magnet motors), caused by the interaction between magnets and the motor’s slots/teeth.","zh":"（电机术语）“齿槽效应/转矩脉动”：电机转动时出现一顿一顿、转矩不均匀的现象，常见于步进电机或某些永磁电机，由磁体与定子齿槽/槽口的相互作用引起。"},"examples":[{"en":"At low speed, the fan motor has noticeable cogging, so it feels slightly jerky.","zh":"在低转速时，这个风扇电机有明显的齿槽效应，所以感觉有点一顿一顿的。"},{"en":"Using a different motor design can reduce cogging and make motion smoother.","zh":"采用不同的电机设计可以降低齿槽效应，让运动更平顺。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of inserting or fitting cogs/teeth, or moving by means of cogs (gears).","zh":"（较少用）装上/加上齿轮齿（齿、棘齿等）的动作；或通过齿轮传动来移动。"},"examples":[{"en":"The technician checked the cogging of the gear assembly to ensure it meshed properly.","zh":"技术员检查了齿轮组件的装齿/啮合情况，确保咬合正常。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “cog”: to provide with cogs/teeth or to move using gear teeth (rare in everyday English).","zh":"“cog”的现在分词：给……加齿/装齿；或用齿轮齿传动移动（日常英语较少见）。"},"examples":[{"en":"They are cogging the mechanism so it locks into place step by step.","zh":"他们在给机构加齿/做成分步卡位的结构，让它一步步锁定到位。"}]}],"synonyms":["torque ripple","cogging torque","jerkiness","uneven rotation","stuttering motion"],"phonetic":"/ˈkɔɡɪŋ/","extraExplanation":["在电机领域里，cogging 常与 “cogging torque（齿槽转矩）” 搭配出现。它不是“负载导致的抖动”，而更多是电机结构本身带来的转矩起伏，因此在低速、轻载时更容易被感觉到。","学习时可以把 cogging 理解为“像齿轮一格一格地跳动的感觉”，虽然它发生在电机里，不一定真的有齿轮。"]}
{"word":"coggle","summary":{"en":"“Coggle” usually means to wobble or shake unsteadily; it can also mean an unsteady wobble.","zh":"“coggle”通常表示“摇晃、晃动、不稳地移动”；也可作名词表示“一次摇晃/晃动”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to wobble, rock, or shake unsteadily; to move in a way that is not stable","zh":"摇晃；晃动；不稳地移动"},"examples":[{"en":"The old table began to coggle when someone leaned on it.","zh":"有人靠在旧桌子上时，桌子开始摇晃。"},{"en":"The cart coggles over the uneven road.","zh":"手推车在坑洼不平的路上颠得摇摇晃晃。"}]},{"partOfSpeech":"n.","definition":{"en":"a wobble or unsteady movement","zh":"摇晃；晃动；不稳的动作"},"examples":[{"en":"There was a slight coggle in the ladder, so he stepped down carefully.","zh":"梯子有点摇晃，所以他小心地爬下来。"}]}],"synonyms":["wobble","rock","shake","teeter"],"phonetic":"/ˈkɑɡəl/","extraExplanation":["“coggle”是较少见的英语词，常见于英式或较老的用法，意思接近“wobble / shake”。在日常口语里，人们更常用“wobble”“shake”“rock”。","注意：Coggle（首字母大写）也是一个在线思维导图/脑图工具的品牌名；作为品牌名时一般不翻译，语境不同于动词/名词“coggle”。"]}
{"word":"coggledy","summary":{"en":"“Coggledy” is a rare dialect adjective meaning wobbly, unstable, or rickety.","zh":"“coggledy”是很少见的方言形容词，意思是摇晃不稳、摇摇欲坠或不牢靠。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Dialect, informal) Wobbly or unsteady; likely to tip over; not firmly balanced.","zh":"（方言/非正式）摇摇晃晃的；不稳的；容易倒的。"},"examples":[{"en":"Be careful with that chair—it’s a bit coggledy.","zh":"小心那把椅子——它有点摇摇晃晃的。"},{"en":"The stack of books looked coggledy, so I moved them to a lower shelf.","zh":"那一摞书看起来不太稳，所以我把它们挪到更低的架子上。"}]}],"synonyms":["wobbly","unstable","rickety","shaky","unsteady"],"phonetic":"/ˈkɑɡəldi/","extraExplanation":["“coggledy”非常少见，多被认为是英语方言词（常见于苏格兰/爱尔兰一带的口语或拼写变体）。你也可能会看到拼作“coggly / cogglety / coggly-looking”等，用来形容东西“晃、歪、不稳”。","如果你是在网络或聊天里看到“coggledy”，也有可能是把更常见的词拼错了（例如：想写“wobbly”“rickety”“shaky”）。可以把原句发我，我能帮你判断更准确的意思。"]}
{"word":"cogglety","summary":{"en":"“Cogglety” is a rare dialect word meaning “wobbly; unstable.”","zh":"“cogglety”是较少见的方言词，意思是“摇晃的；不稳的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(dialect, informal) Wobbly or unsteady; likely to tip over; not stable.","zh":"（方言/非正式）摇摇晃晃的；不稳的；容易翻倒的。"},"examples":[{"en":"The table feels a bit cogglety—put a coaster under that leg.","zh":"这张桌子有点摇晃——在那条桌腿下面垫个杯垫吧。"},{"en":"Be careful on the cogglety stool.","zh":"小心那张不稳的小凳子。"}]}],"synonyms":["wobbly","shaky","unstable","rickety"],"phonetic":"/ˈkɑɡəlti/","extraExplanation":["“cogglety”不是标准英语里常见的拼写，更常见的是方言里的“coggly / coggly”（意思接近 wobbly, shaky）。如果你是在聊天、歌词、小说对话里看到“cogglety”，通常是在模仿苏格兰或英格兰北部的口语风格，用来形容东西不稳、摇晃。","如果你本来想写的是“cogently”（有条理地、令人信服地），告诉我上下文句子，我可以帮你确认并给出对应解释。"]}
{"word":"coggly","summary":{"en":"“Coggly” is not standard English; it may be an informal/joking word meaning “gear-like,” or a misspelling (often of “coggy”).","zh":"“coggly”不是标准英语；可能是非正式（带玩笑意味）的“像齿轮的”，也可能是拼写错误（常见是把“coggy”写错）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not a standard English word. It is sometimes used informally (often jokingly) to mean “having lots of cogs/gears” or “gear-like,” but it may also be a misspelling.","zh":"不是标准英语词。有时在非正式语境（常带玩笑意味）里用来表示“有很多齿轮/齿状结构的、像齿轮一样的”，也可能只是拼写错误。"},"examples":[{"en":"This isn’t a common word, but someone might jokingly describe an old machine as “coggly.”","zh":"这不是常见词，但有人可能开玩笑地把一台老机器形容为“coggly（满是齿轮的）”。"},{"en":"If you meant “coggy,” that adjective can mean “having cogs or teeth.”","zh":"如果你想写的是“coggy”，它可以表示“有齿轮或齿状结构的”。"}]}],"synonyms":["coggy","cog-like","geared","mechanical"],"phonetic":"/ˈkɑɡli/","extraExplanation":["“cog”意为“齿轮；（齿轮的）齿”。英语里把名词加上“-y”常可变成形容词（如rain → rainy），所以更常见的造法是“coggy”。“coggly”看起来像是把“cog”加“-ly”，但“-ly”更常用来构成副词（如quick → quickly），因此“coggly”在正规词典中通常找不到，更多像临时造词或拼写变体。","如果你是在某篇文章、游戏、品牌名或特定社群里看到“coggly”，把原句发我，我可以根据上下文判断它具体想表达什么，以及是否应改为“coggy / cog-like / geared / mechanical”等更自然的说法。"]}
{"word":"Coggon","summary":{"en":"Coggon is most commonly a place name (a small city in Iowa) and can also be a surname.","zh":"Coggon最常见是地名（美国艾奥瓦州的一个小城镇），也可以作为姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small city in Linn County, Iowa, USA (a place name).","zh":"美国艾奥瓦州林恩县的一个小城镇（地名）。"},"examples":[{"en":"Coggon is a quiet community in eastern Iowa.","zh":"科根（Coggon）是艾奥瓦州东部一个安静的社区。"},{"en":"She grew up near Coggon before moving to Cedar Rapids.","zh":"她在科根附近长大，后来搬到了锡达拉皮兹。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname).","zh":"一个姓氏。"},"examples":[{"en":"Mr. Coggon will lead the meeting today.","zh":"科根先生今天将主持会议。"}]}],"phonetic":"/ˈkɑɡən/","extraExplanation":["“Coggon”在日常英语里最常见的是地名（艾奥瓦州的城镇）或姓氏。因为是专有名词，通常首字母大写；读音在英语中相对固定，但不同家庭姓氏也可能有细微差异。","在书面表达中，如果指城镇，可以加上州名或县名来避免歧义，例如：Coggon, Iowa。"]}
{"word":"coggy","summary":{"en":"“Coggy” is a rare adjective meaning “having cogs/gear teeth” or, informally, “jerky/catching in motion.”","zh":"“coggy”是个较少见的形容词，可指“有齿轮齿的”，也可在口语里指“动作卡顿、不顺”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Having cogs (teeth), or designed to work with cogs; like a gear.","zh":"（罕用）有齿轮齿的；与齿轮配合工作的；像齿轮一样的。"},"examples":[{"en":"The old mill used a coggy wheel to transfer power to the next shaft.","zh":"那座老磨坊用一个带齿的轮子把动力传到下一根轴上。"},{"en":"A coggy mechanism can move heavy loads more reliably than a smooth wheel.","zh":"带齿的机构比光滑轮子更能可靠地带动重载。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal, rare) Jerky, uneven, or catching in movement; as if gears are not meshing smoothly.","zh":"（非正式，罕用）动作不顺、断断续续的；像齿轮咬合不顺那样“卡顿”的。"},"examples":[{"en":"The bike ride felt coggy after the chain got dirty.","zh":"链条脏了之后，骑车感觉有点卡卡的。"},{"en":"His steps were coggy on the loose gravel.","zh":"他在松散的碎石上走路有点磕磕绊绊。"}]}],"synonyms":["geared","toothed","cogged","jerky","uneven","choppy"],"phonetic":"/ˈkɑɡi/","extraExplanation":["“coggy”不是现代英语中的高频词，更常见的说法是 geared / toothed（有齿的）来形容“有齿轮齿的”，或用 jerky / uneven / choppy 来形容“卡顿、不顺”。","词根来自 cog（齿轮齿；齿轮）。在机械语境中偶尔能见到“coggy wheel”等搭配，但整体上属于少见用法。"]}
{"word":"coghle","summary":{"en":"“coghle” is not a standard English word; it is likely a misspelling of “cough.”","zh":"“coghle”不是标准英文单词；很可能是“cough（咳嗽）”的拼写错误。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Likely intended: “cough”) to push air out of your throat suddenly and noisily, often because your throat or lungs are irritated or because you are sick.","zh":"（可能想写的是 cough）突然、用力并带声音地从喉咙把气咳出来，常因喉咙/肺部受刺激或生病引起。"},"examples":[{"en":"She started to cough during the meeting.","zh":"她在会议中开始咳嗽。"},{"en":"The smoke made me cough.","zh":"烟把我呛得直咳嗽。"},{"en":"If you cough a lot, you should see a doctor.","zh":"如果你咳得很厉害，应该去看医生。"}]},{"partOfSpeech":"n.","definition":{"en":"(Likely intended: “cough”) the act or sound of coughing; a symptom of illness.","zh":"（可能想写的是 cough）咳嗽这一动作或声音；（疾病的）咳嗽症状。"},"examples":[{"en":"He has a bad cough and a fever.","zh":"他咳嗽很严重，还发烧。"},{"en":"Her cough kept everyone awake.","zh":"她的咳嗽声让大家都睡不着。"}]}],"synonyms":["hack","clear one’s throat"],"phonetic":"/kɔf/","extraExplanation":["“coghle”不是常见的英文单词，比较像拼写错误。最常见的可能是你想写“cough”（咳嗽）。注意拼写：cough 的字母组合 “-ough” 发音不规则，读作 /kɔf/。如果你其实想表达耳朵里的“耳蜗”，那个词是 cochlea（/ˈkoʊkliə/），拼写和意思都不同。"]}
{"word":"cogida","summary":{"en":"“Cogida” is a Spanish noun meaning (1) a catching/taking, (2) a bullfighting goring, and in some regions (3) a vulgar term for sexual intercourse.","zh":"“cogida”是西语名词，可指（1）抓/拿/取得，（2）斗牛语境中的“被牛角顶伤”，在部分地区也可（3）作粗俗的“性交”之意。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) a catching, grabbing, or taking (the act or result of taking hold of something).","zh":"（西语）抓住、拿起、取得（指“抓/拿”的动作或结果）。"},"examples":[{"en":"La cogida del bolso fue tan rápida que nadie la vio.","zh":"她抢走（拿走）包的动作太快了，没人看到。"},{"en":"La cogida del tren a tiempo nos salvó.","zh":"我们及时赶上火车，得救了（避免了麻烦）。"}]},{"partOfSpeech":"n.","definition":{"en":"(Bullfighting) a goring: when a bull catches and wounds someone with its horns.","zh":"（斗牛）被牛角顶伤；牛用角“挂到/刺伤”人的一次事件。"},"examples":[{"en":"El torero sufrió una cogida y tuvo que ir al hospital.","zh":"斗牛士被牛角顶伤，不得不去医院。"},{"en":"La noticia habló de una cogida grave durante la corrida.","zh":"新闻报道了斗牛比赛中一次严重的顶伤事件。"}]},{"partOfSpeech":"n.","definition":{"en":"(Vulgar in some regions) sexual intercourse; used as a crude term.","zh":"（部分地区粗俗用法）性交；非常粗口的说法。"},"examples":[{"en":"In many places, it’s better to avoid this meaning because it sounds very crude.","zh":"在很多地方最好避免这种含义，因为听起来很粗俗。"},{"en":"They warned him that the word can be offensive depending on the country.","zh":"他们提醒他这个词在不同国家可能会冒犯人。"}]}],"synonyms":["(taking) captura","(taking) agarre","(bullfighting) cornada","(neutral alternatives) toma"],"phonetic":"/koʊˈhiðə/","extraExplanation":["“Cogida”来自西班牙语动词“coger”（抓、拿、乘坐）。但在拉美一些国家/地区，“coger”及其相关词（如“cogida”）常带有强烈粗俗的性含义；在西班牙本土通常更常用“拿/乘坐”的普通含义。为了避免误会，想表达“乘车/搭车”可用“tomar (el autobús/tren)”，表达“拿起”可用“agarrar/recoger”。","在斗牛文化语境中，“una cogida”是固定搭配，指斗牛士或他人被公牛用角顶到并造成伤害的事件，常见于新闻报道与体育评论。"]}
{"word":"cogie","summary":{"en":"Cogie is a Scottish dialect word for a small wooden bucket or tub, often for milk or water.","zh":"Cogie 是苏格兰方言词，指小木桶或小木盆，常用于装牛奶或水。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scotland, dialect) A small wooden bucket or tub, especially one used for carrying milk or water.","zh":"（苏格兰方言）小木桶、小木盆，尤指用来装牛奶或水的那种。"},"examples":[{"en":"She carried fresh milk in a cogie from the farm to the house.","zh":"她用一个小木桶把新鲜牛奶从农场提到家里。"},{"en":"He filled the cogie with water from the well.","zh":"他从井里打水，把小木桶装满。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A small vessel or container; sometimes used loosely for a small bowl or tub.","zh":"（罕见）小容器；有时泛指小碗或小盆一类的器皿。"},"examples":[{"en":"Put the berries in a cogie and rinse them.","zh":"把莓果放进一个小盆里冲洗一下。"}]}],"synonyms":["bucket","pail","tub"],"phonetic":"/ˈkoʊɡi/","extraExplanation":["“cogie”主要见于苏格兰英语/方言写作，在现代美式英语里非常少见；如果你在普通语境想表达“小桶/水桶”，更常用的是 bucket / pail / tub。","拼写上你也可能会遇到“coggie”，含义相同或非常接近，常见于表现苏格兰口语风格的文学或民谣语境。"]}
{"word":"cogit","summary":{"en":"“Cogit” isn’t standard English; it’s sometimes a shorthand for “cogitate,” meaning to think deeply.","zh":"“cogit”不是标准英文；有时是“cogitate”的简写，意为深入思考。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not a standard English word) Often seen as an informal abbreviation in notes for “cogitate,” meaning to think carefully for a period of time; to ponder.","zh":"（不是标准英文单词）有时在笔记里作为“cogitate”的非正式缩写，意思是长时间认真思考；沉思。"},"examples":[{"en":"I need time to cogit—let me think this through before I answer.","zh":"我需要一点时间先“cogit”——让我把这件事想清楚再回答。"},{"en":"In formal writing, use “cogitate” or “think,” not “cogit.”","zh":"在正式写作中用“cogitate”或“think”，不要用“cogit”。"}]},{"partOfSpeech":"v.","definition":{"en":"To think deeply and carefully; to ponder (more formal than “think”).","zh":"深入而仔细地思考；沉思（比“think”更正式）。"},"examples":[{"en":"She cogitated on the problem all night.","zh":"她整晚都在沉思这个问题。"},{"en":"He paused to cogitate before making a decision.","zh":"他停下来想了想，才做决定。"},{"en":"We should cogitate on the long-term effects, not just the short-term gains.","zh":"我们应当思考长期影响，而不只是短期收益。"}]}],"synonyms":["think","consider","ponder","reflect","mull (over)"],"phonetic":"/ˈkɑːdʒəˌteɪt/","extraExplanation":["“Cogitate”来自拉丁语 cogitare（思考、计划）。在现代英语里它偏书面、略带幽默或“装文气”的感觉；日常更常用 think, consider, ponder.","如果你想表达“我在思考”，更自然的说法有：I’m thinking. / I’m considering it. / Let me think about it.","容易混淆：cogito 是拉丁语（如“Cogito, ergo sum.” 我思故我在），不是日常英语动词。"]}
{"word":"cogitability","summary":{"en":"Cogitability means the quality of being thinkable or conceivable (a rare philosophical term).","zh":"cogitability 指“可思性/可设想性”，即某事物能够被想象或构想（较少见的哲学用语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Philosophy, rare) The quality of being thinkable or capable of being conceived by the mind; conceivability.","zh":"（哲学用语，较少见）“可思性/可设想性”：某事物能够被心智想到、构想或设想的性质。"},"examples":[{"en":"In philosophy, some argue that a contradiction has no cogitability because it cannot be consistently conceived.","zh":"在哲学讨论中，有人认为“自相矛盾”的命题没有可思性，因为它无法被一致地设想。"},{"en":"The thought experiment tests the cogitability of a world without physical laws.","zh":"这个思想实验在检验一个“没有物理定律的世界”的可思性。"}]}],"synonyms":["conceivability","thinkability","imaginability","conceivableness"],"phonetic":"/ˌkɑːdʒɪtəˈbɪləti/","extraExplanation":["这个词非常少见，多出现在哲学写作中；日常英语里更常用 conceivability / thinkability / imaginability 来表达“可设想性”。","词根来自拉丁语 cogitare（思考）。在某些哲学语境里，“可思性/可设想性”常与 possibility（可能性）对比：可设想≠必然可能（有争议）。例如“僵尸论证”里会区分“能设想”与“是否真的可能”。","常见搭配：the cogitability of X（X 的可设想性）、lack cogitability（缺乏可思性）。"]}
{"word":"cogitable","summary":{"en":"“Cogitable” means “thinkable” or “conceivable,” usually in formal writing.","zh":"cogitable 指“可被思考/可设想的”，多用于较正式的书面语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to be thought about; thinkable; conceivable.","zh":"可被思考的；可想象的；可设想的。"},"examples":[{"en":"It’s cogitable that the plan could fail if we don’t have enough funding.","zh":"可以设想的是，如果资金不足，这个计划可能会失败。"},{"en":"At the time, a peaceful solution seemed barely cogitable.","zh":"当时，和平解决方案几乎难以想象。"}]}],"synonyms":["conceivable","imaginable","thinkable","possible"],"phonetic":"/ˈkɑːdʒɪtəbəl/","extraExplanation":["“cogitable”比较少见，日常英语里更常用的是“conceivable / imaginable / thinkable”。它来自拉丁语词根“cogit-”（与“cogitate”同源），意思与“思考、想”。在正式或学术语境中偶尔会看到，用来强调“在思维上是可能的”。"]}
{"word":"cogitabund","summary":{"en":"“Cogitabund” means deeply thoughtful or pensive, usually in a formal or literary style.","zh":"“cogitabund”指“沉思的、若有所思的”，多用于正式或文学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"deep in thought; pensive; contemplative","zh":"沉思的；若有所思的；爱沉思的"},"examples":[{"en":"He sat by the window, cogitabund, turning the problem over in his mind.","zh":"他坐在窗边沉思着，在脑海里反复琢磨这个问题。"},{"en":"Her cogitabund expression suggested she was planning her next step.","zh":"她若有所思的表情暗示她正在计划下一步。"}]}],"synonyms":["pensive","thoughtful","contemplative","reflective","meditative"],"phonetic":"/ˌkɑːdʒɪtəˈbʌnd/","extraExplanation":["这是一个非常书面、偏古典的词，日常英语里不常用。更常见的替代词有 pensive、thoughtful、contemplative。","词源来自拉丁语 cogitare（思考）+ 后缀 -bund（表示“倾向于/充满……”），整体意思就是“充满思考的”。在文学描写中，它常用来营造人物安静、内省的气氛。"]}
{"word":"cogitabundity","summary":{"en":"Cogitabundity means a tendency toward deep, prolonged thinking or reflection.","zh":"cogitabundity 指一种倾向于深度、长时间思考与反省的状态或习惯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the habit or tendency to think deeply and for a long time; deep, thoughtful reflection","zh":"（长期、深度的）沉思；爱深思的习惯"},"examples":[{"en":"After the meeting, she sat in quiet cogitabundity, weighing everyone’s arguments.","zh":"会后，她安静地陷入沉思，权衡每个人的论点。"},{"en":"His essays show cogitabundity rather than quick opinions.","zh":"他的文章体现的是深思熟虑，而不是脱口而出的观点。"}]}],"synonyms":["thoughtfulness","reflection","contemplation","meditation","rumination"],"phonetic":"/ˌkɑːdʒɪtəˈbʌndəti/","extraExplanation":["这是一个非常少见、偏书面和带点“文气”的词，更常见的表达是 thoughtfulness（深思）、reflection（反思/沉思）、contemplation（沉思）。","词源上可拆解理解：来自拉丁语词根 cogit-（思考，见 cogitate）+ -abundus（充满……的，类似 abundant 的感觉）+ 名词后缀 -ity，整体有“充满思考”的意味。","在文学或修辞场景中，它常用来营造一种“安静、深邃、反复推敲”的气氛；日常口语里用它可能显得夸张或刻意。"]}
{"word":"cogitabundly","summary":{"en":"“Cogitabundly” means “in a deeply thoughtful way,” often with a humorous or old-fashioned tone.","zh":"“cogitabundly”表示“沉思地、若有所思地”，常带幽默或古雅语气。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a deeply thoughtful or contemplative way; as if lost in thought (often humorous or old-fashioned).","zh":"以深思或沉思的方式；仿佛陷入思考（常带幽默或古雅语气）。"},"examples":[{"en":"He stared out the window cogitabundly, planning what to say next.","zh":"他若有所思地望着窗外，盘算着下一步该说什么。"},{"en":"She nodded cogitabundly before giving her answer.","zh":"她沉思地点了点头，然后才回答。"}]}],"synonyms":["thoughtfully","pensively","reflectively","contemplatively"],"phonetic":"/ˌkɑːdʒɪtəˈbʌndli/","extraExplanation":["这个词很少见，语气常偏“书面/古风”或带点戏谑，写作中用来刻意强调“沉思的样子”。日常口语更常用：thoughtfully, pensively, reflectively。","词源上与拉丁语 cogitare（思考、考虑）有关；形容词是 cogitabund（沉思的）。"]}
{"word":"cogitabundous","summary":{"en":"Cogitabundous means “deep in thought; pensive.” It’s a rare, very formal (often playful) word.","zh":"cogitabundous 意为“沉思的；若有所思的”。它非常少见，语气很正式（也常带点俏皮）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"deep in thought; thoughtful and a little serious; pensive","zh":"沉思的；若有所思的；（略带严肃地）专注思考的"},"examples":[{"en":"He sat by the window, cogitabundous, planning what to say next.","zh":"他坐在窗边，若有所思，盘算着接下来该说什么。"},{"en":"After the meeting, she grew cogitabundous and unusually quiet.","zh":"会议结束后，她变得沉思起来，异常安静。"}]}],"synonyms":["thoughtful","pensive","reflective","contemplative","meditative"],"phonetic":"/ˌkɑːdʒɪtəˈbʌndəs/","extraExplanation":["这是一个非常罕见、略带“书卷气/玩笑感”的形容词，来自拉丁语词根 cogit-（思考）+ -abundus/-bundous（“充满……的”一类后缀），意思是“充满思考的”。日常英语里更常用 thoughtful, pensive, reflective。","因为生僻，它常出现在幽默的写作或刻意文雅的语境中：用它会显得夸张、书面、甚至有点俏皮。"]}
{"word":"cogitant","summary":{"en":"Cogitant means “deeply thinking; thoughtful,” and more rarely “a thinker.”","zh":"cogitant 指“深思的、沉思的”，更少见时也可指“思想者”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Thinking deeply; thoughtful; meditative.","zh":"深思的；沉思的；善于思考的。"},"examples":[{"en":"She wrote in a calm, cogitant tone, weighing every word.","zh":"她用平静而深思的语气写作，斟酌每一个词。"},{"en":"In the library, he sat quietly, cogitant and focused.","zh":"在图书馆里，他安静地坐着，沉思而专注。"}]},{"partOfSpeech":"n.","definition":{"en":"A thinking person; a thinker (rare).","zh":"思考者；思想者（较少用）。"},"examples":[{"en":"The essay addressed the responsibilities of the cogitant in public life.","zh":"这篇文章讨论了公共生活中思想者的责任。"}]}],"synonyms":["thoughtful","reflective","contemplative","meditative","pensive"],"phonetic":"/ˈkɑːdʒənt/","extraExplanation":["“cogitant”较为书面、偏文学或哲学语境，日常英语里更常用 thoughtful, reflective, contemplative 等词。","词源来自拉丁语 cogitare（思考、考虑）。在哲学讨论中，你也可能看到 related forms：cogitation（沉思、思考）和 cogito（“我思”）。"]}
{"word":"cogitantly","summary":{"en":"“Cogitantly” means “thoughtfully” or “after careful reflection,” and it is quite formal.","zh":"“cogitantly”表示“深思熟虑地/若有所思地”，语体较正式、偏书面。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a thoughtful, reflective way; after careful thinking.","zh":"以深思熟虑的方式；经过认真思考地。"},"examples":[{"en":"She spoke cogitantly about the risks and benefits before making a decision.","zh":"她在做决定前，深思熟虑地谈到了风险和收益。"},{"en":"He listened cogitantly, then asked one clear question.","zh":"他若有所思地听着，然后问了一个很清楚的问题。"}]}],"synonyms":["thoughtfully","carefully","reflectively","deliberately","pensively"],"phonetic":"/ˈkɑdʒɪtəntli/","extraExplanation":["“cogitantly”比较书面、少见，日常英语更常用：thoughtfully / carefully / reflectively。","词根来自拉丁语“cogitare”（思考）。常见相关词：cogitate（v. 思考），cogitation（n. 思考）。"]}
{"word":"cogitate","summary":{"en":"Cogitate means to think deeply and carefully, especially in a formal or literary style.","zh":"Cogitate 指“深思熟虑、认真思考”，语体偏正式或文学化。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to think deeply and carefully about something, often for a period of time","zh":"（对某事）深思熟虑；认真思考（通常持续一段时间）"},"examples":[{"en":"She sat quietly to cogitate on the decision.","zh":"她安静地坐着，仔细思考这个决定。"},{"en":"I need a day or two to cogitate before I reply.","zh":"我需要一两天时间想清楚再回复。"}]},{"partOfSpeech":"v.","definition":{"en":"to plan or consider ideas in your mind; to mentally work something out","zh":"在头脑中盘算；构思；在心里把想法理清"},"examples":[{"en":"He was cogitating a way to explain the problem simply.","zh":"他在琢磨一个能把问题简单讲清楚的方法。"},{"en":"They cogitated about how to improve the team’s workflow.","zh":"他们在思考如何改进团队的工作流程。"}]}],"synonyms":["ponder","contemplate","deliberate","mull over","reflect on"],"phonetic":"/ˈkɑdʒəˌteɪt/","extraExplanation":["“cogitate”语气比“think”更正式，常带有“深入、反复、慎重地想”的感觉；在日常口语里不算常用，写作、演讲或较正式的表达中更常见。","词源来自拉丁语“cogitare”（思考、考虑）。因此它常让人联想到“把想法在脑中‘聚拢、整理’之后再下结论”。","文学或正式语境里，有时会用它来表现人物“沉思”“冥想式的思考”，氛围更严肃或更书面。"]}
{"word":"cogitated","summary":{"en":"“Cogitated” means “thought deeply/carefully” (formal).","zh":"“cogitated”表示“深思/仔细思考”（偏正式用语）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of “cogitate”) to think deeply and carefully; to ponder.","zh":"（cogitate 的过去式/过去分词）深思；仔细思考；沉思。"},"examples":[{"en":"She cogitated for a moment before answering.","zh":"她沉思了一会儿才回答。"},{"en":"After reading the report, he cogitated on what to do next.","zh":"读完报告后，他仔细思考下一步该怎么做。"},{"en":"The committee cogitated over the budget problem all afternoon.","zh":"委员会整个下午都在反复斟酌预算问题。"}]}],"synonyms":["pondered","considered","reflected","deliberated","mused"],"phonetic":"/ˈkɑdʒəˌteɪt/","extraExplanation":["“cogitate”语气比较正式，常见于书面语或较严肃的表达；日常口语里更常用 think, consider, ponder。","词源来自拉丁语 cogitare，含义与“把想法集中起来、认真思考”有关，因此通常带有“反复琢磨”的感觉。"]}
{"word":"cogitates","summary":{"en":"“Cogitates” means “thinks deeply” (formal), as in “he/she/it cogitates.”","zh":"“cogitates”表示“（他/她/它）深思、仔细思考”，语气较正式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(third-person singular) to think deeply and carefully; to ponder.","zh":"（第三人称单数）深思；仔细思考；沉思。"},"examples":[{"en":"She cogitates before making big decisions.","zh":"她在做重大决定前会仔细思考。"},{"en":"He cogitates on how to solve the problem.","zh":"他在沉思该如何解决这个问题。"}]},{"partOfSpeech":"vt.","definition":{"en":"(less common, formal) to consider or plan something in your mind.","zh":"（较少见，较正式）在心中考虑或筹划某事。"},"examples":[{"en":"The committee cogitates a new policy for remote work.","zh":"委员会在考虑一项新的远程办公政策。"}]}],"synonyms":["think","consider","ponder","reflect","meditate"],"phonetic":"/ˈkɑdʒɪˌteɪts/","extraExplanation":["“cogitate”语气偏正式、书面，日常口语中更常用 think, consider, ponder。","“cogitates”是一般现在时第三人称单数（he/she/it cogitates）。常见变形：cogitate / cogitated / cogitating。","搭配提示：常见结构是 cogitate on/upon + 名词/动名词（cogitate on a plan / cogitate on moving abroad）。"]}
{"word":"cogitating","summary":{"en":"“Cogitating” means thinking deeply and carefully, often in a formal tone.","zh":"“cogitating”表示正在深入、认真地思考，语气较正式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"thinking carefully and deeply about something; considering it seriously","zh":"正在认真、深入地思考某事；仔细斟酌"},"examples":[{"en":"She sat by the window, cogitating about her next move.","zh":"她坐在窗边，正在思考下一步该怎么做。"},{"en":"I’m cogitating on whether to accept the offer.","zh":"我正在仔细考虑要不要接受这个提议。"},{"en":"He walked slowly, cogitating over the question.","zh":"他慢慢地走着，反复琢磨那个问题。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common) producing thoughts or plans by careful thinking","zh":"（较少见）通过深思熟虑来形成想法或计划的"},"examples":[{"en":"The team spent the afternoon cogitating strategies for the debate.","zh":"团队花了一下午在推敲辩论策略。"},{"en":"Cogitating minds often notice details others miss.","zh":"善于深思的人往往能注意到别人忽略的细节。"}]}],"synonyms":["thinking","pondering","considering","reflecting","mulling (over)"],"phonetic":"/ˈkɑːdʒəˌteɪtɪŋ/","extraExplanation":["“cogitating”来自动词“cogitate”，语气比常见的“think”更正式，常带有“深思、反复斟酌”的感觉。日常口语里更常用“thinking”或“thinking hard”。","词源上与拉丁语“cogitare”（思考、考虑）有关，也与“cognition（认知）”同源。"]}
{"word":"cogitatingly","summary":{"en":"“Cogitatingly” means “in a deeply thoughtful way.”","zh":"“cogitatingly”表示“以深思熟虑的方式；若有所思地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that shows deep thinking; thoughtfully, as if you are carefully considering something.","zh":"以深思熟虑的方式；若有所思地（表现出正在认真思考或斟酌）。"},"examples":[{"en":"She stared out the window cogitatingly, deciding whether to accept the job.","zh":"她若有所思地望着窗外，思考要不要接受那份工作。"},{"en":"He rubbed his chin cogitatingly before answering the question.","zh":"他摸着下巴沉思片刻，然后才回答问题。"}]}],"synonyms":["thoughtfully","pensively","reflectively","meditatively"],"phonetic":"/ˈkɑːdʒəˌteɪtɪŋli/","extraExplanation":["“cogitatingly”属于比较少见、偏书面或文学化的副词，用来营造“正在深思”的画面感。日常口语里更常说 “thoughtfully / after thinking for a moment / as if thinking hard”。","构词上：cogitate（认真思考）+ -ing（现在分词）+ -ly（副词后缀），表示“以……的方式”。"]}
{"word":"cogitation","summary":{"en":"Cogitation means deep, careful thinking, often in a formal or serious context.","zh":"cogitation 指较正式语境中的“深思、沉思、认真思考”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"deep, careful thinking; serious reflection","zh":"深思；沉思；认真思考"},"examples":[{"en":"After some cogitation, she decided to change her major.","zh":"经过一番深思后，她决定换专业。"},{"en":"The plan needs more cogitation before we present it to the team.","zh":"这个计划在提交给团队之前需要更多的认真思考。"}]}],"synonyms":["deep thought","reflection","consideration","deliberation","contemplation"],"phonetic":"/ˌkɑdʒəˈteɪʃən/","extraExplanation":["“Cogitation”较正式，常见于写作、学术或严肃语境；日常口语里更常说“thinking / careful thought”。","词源来自拉丁语 *cogitare*（思考、考虑），因此带有“经过推敲的思考”这种偏书面、较郑重的语感。","文学/写作中可用来强调人物在做重要决定前的“反复斟酌”，比普通的“thought”更显深度与庄重。"]}
{"word":"cogitations","summary":{"en":"“Cogitations” means deep, careful thoughts or the reflections produced by serious thinking; it’s a formal/literary word.","zh":"“Cogitations”指深思熟虑的想法或由认真思考产生的感想，属于较正式/文学化用词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"deep, careful thoughts; serious thinking (plural of “cogitation”)","zh":"深思；慎重的思考（“cogitation”的复数）"},"examples":[{"en":"After a few hours of cogitations, she decided to change careers.","zh":"经过几个小时的深思后，她决定转行。"},{"en":"His cogitations often wandered to the meaning of success.","zh":"他常常沉思成功的意义。"}]},{"partOfSpeech":"n.","definition":{"en":"ideas or reflections that come from such deep thinking (often formal/literary)","zh":"由深思产生的想法或感想（较正式/文学用语）"},"examples":[{"en":"The essay records the author’s cogitations on love and loss.","zh":"这篇文章记录了作者关于爱与失去的思考与感悟。"},{"en":"In his journal, he wrote down his private cogitations.","zh":"他在日记里写下了自己的私密感想。"}]}],"synonyms":["thoughts","reflections","meditations","deliberations","ruminations"],"phonetic":"/ˌkɑdʒəˈteɪʃənz/","extraExplanation":["“cogitations”语气偏正式，日常口语里更常用 thoughts、thinking、reflections。它常见于散文、演讲或较书面表达，用来强调“深沉、反复、谨慎的思考”。","词源上来自拉丁语 cogitare（思考、考虑），因此带有“认真推敲”的感觉。"]}
{"word":"cogitative","summary":{"en":"“Cogitative” means “related to thinking; deeply thoughtful,” and it’s mainly used in formal contexts.","zh":"“cogitative”意为“与思考相关；深思的”，主要用于正式或学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to thinking; thoughtful and reflective (often used in formal or academic writing).","zh":"与思考有关的；深思的、沉思的（多用于正式或学术语境）。"},"examples":[{"en":"After a cogitative pause, she answered with care.","zh":"沉思片刻后，她谨慎地回答了。"},{"en":"The essay takes a cogitative approach to the problem of identity.","zh":"这篇文章以一种深思的方式探讨身份认同的问题。"},{"en":"He was quiet and cogitative during the long train ride.","zh":"在漫长的火车旅途中，他安静而沉思。"}]}],"synonyms":["thoughtful","reflective","contemplative","pensive","meditative"],"phonetic":"/ˈkɑdʒəˌteɪtɪv/","extraExplanation":["“cogitative”比较少见，语气偏书面/学术。日常英语里更常用“thoughtful”“reflective”“contemplative”。","词源来自拉丁语“cogitare”（思考、考虑）。在文学或评论写作中，它常用来营造一种冷静、内省、理性思辨的氛围。"]}
{"word":"cogitatively","summary":{"en":"“Cogitatively” means “thoughtfully; in a reflective, reasoning way.”","zh":"“cogitatively”表示“深思熟虑地；以思考、推理为主地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that involves careful thinking or reasoning; thoughtfully.","zh":"以思考、推理为主的方式；深思熟虑地。"},"examples":[{"en":"She responded cogitatively, choosing her words with care.","zh":"她深思熟虑地回应，谨慎地选择措辞。"},{"en":"The committee spoke cogitatively about the long-term effects of the policy.","zh":"委员会以审慎思考的方式讨论了该政策的长期影响。"}]}],"synonyms":["thoughtfully","reflectively","deliberately","carefully","pensively"],"phonetic":"/ˈkɑːdʒəˌteɪtɪvli/","extraExplanation":["“cogitatively”较偏正式、书面语，常用于描写说话/讨论/沉思的语气，日常口语里更常用“thoughtfully”“carefully”“reflectively”。","词根来自拉丁语“cogitare”（思考、考虑）；“-ive”构成形容词“cogitative”（善于思考的），再加“-ly”变成副词。"]}
{"word":"cogitativeness","summary":{"en":"Cogitativeness means a reflective habit of thinking deeply and carefully.","zh":"Cogitativeness 指习惯性地深思熟虑、反思的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality or habit of thinking deeply and carefully; reflectiveness.","zh":"深思熟虑的特质或习惯；沉思、善于思考。"},"examples":[{"en":"Her cogitativeness made her a careful planner who rarely acted on impulse.","zh":"她的深思熟虑让她成为一个谨慎的规划者，很少冲动行事。"},{"en":"In the quiet library, his cogitativeness helped him understand the difficult text.","zh":"在安静的图书馆里，他的沉思帮助他理解了那篇难懂的文章。"}]}],"synonyms":["thoughtfulness","reflectiveness","contemplation","meditativeness"],"phonetic":"/ˌkɑːdʒəˈteɪtɪvnəs/","extraExplanation":["“cogitativeness”较为书面、少见，日常更常用“thoughtfulness”“reflectiveness”或“being reflective”。","词根来自拉丁语“cogitare”（思考、考虑）。同族词包括：cogitate（深思）、cogitation（思考）。在正式写作中，它常用来描述一种持续、稳定的性格特征，而不是一次性的“想了一下”。"]}
{"word":"cogitativity","summary":{"en":"Cogitativity means the quality or habit of deep, reflective thinking.","zh":"cogitativity 指“深度、反思式思考”的特质或习惯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or tendency of thinking deeply and reflectively; a habit of careful thought","zh":"深思熟虑的特质；爱思考、善于反思的倾向"},"examples":[{"en":"Her cogitativity made her a thoughtful leader who listened before deciding.","zh":"她善于深思熟虑，因此成了一位会先倾听再做决定的领导者。"},{"en":"The novel’s slow pacing invites cogitativity rather than quick judgment.","zh":"这部小说节奏缓慢，更容易引发读者深思，而不是匆忙下结论。"},{"en":"In meetings, he was quiet—not uninterested, but full of cogitativity.","zh":"在会议上他很安静——不是不感兴趣，而是在认真思考。"}]}],"synonyms":["thoughtfulness","reflectiveness","contemplation","deliberation"],"phonetic":"/ˌkɑdʒɪˈteɪtɪvɪti/","extraExplanation":["这是一个较少见、偏正式（academic/formal）的名词，多用于写作或学术语境。日常英语里更常用 thoughtfulness（体贴/深思）、reflectiveness（善于反思）、deep thinking（深度思考）。","词源上来自拉丁语 cogitare（思考、考虑）。你也可能见到形容词 cogitative（沉思的、好思考的）。"]}
{"word":"cogitator","summary":{"en":"A rare word meaning “thinker,” and in some sci‑fi settings, a computer-like information processor.","zh":"较少见的词，表示“思考者”；在部分科幻设定中也指类似计算机的信息处理装置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who thinks deeply; a thinker.","zh":"善于深思的人；思考者。"},"examples":[{"en":"She’s a careful cogitator who rarely speaks before thinking things through.","zh":"她是个谨慎的思考者，通常会想清楚才开口。"},{"en":"The book was written for serious cogitators interested in ethics and society.","zh":"这本书是写给对伦理与社会感兴趣的严肃思考者的。"}]},{"partOfSpeech":"n.","definition":{"en":"(Science fiction, especially Warhammer 40,000) A computer-like device used to process information.","zh":"（科幻用语，尤指《战锤40K》）类似计算机的“信息处理装置”。"},"examples":[{"en":"In the story, the ship’s cogitator calculates the safest route through the storm.","zh":"在故事里，飞船的“cogitator”会计算穿越风暴的最安全航线。"},{"en":"The tech-priest consults the cogitator before making a decision.","zh":"技术牧师在做决定前会查阅那台“cogitator”。"}]}],"synonyms":["thinker","philosopher","intellectual","contemplator"],"phonetic":"/ˈkɑːdʒəˌteɪtɚ/","extraExplanation":["“cogitator”源自拉丁语词根 *cogitare*（思考），与英语的 *cogitate*（深思）同源。它在日常英语中较少见，常见替代词是 *thinker* 或 *philosopher*。","在《战锤40K》等作品中，*cogitator*常被用作“复古/宗教化的计算机”称呼，营造一种把科技当作神秘仪式对待的氛围。"]}
{"word":"cogitators","summary":{"en":"“Cogitators” most commonly means “thinkers,” and in sci‑fi (especially Warhammer 40,000) it can mean computer-like machines.","zh":"“cogitators”常指“思考者”，在科幻语境（尤指《战锤40K》）中也可指类似计算机的数据处理装置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who think deeply; thinkers (plural of “cogitator”).","zh":"善于深思的人；思考者（cogitator 的复数）。"},"examples":[{"en":"In the seminar, the cogitators challenged every assumption behind the theory.","zh":"在研讨课上，这些深思者质疑了该理论背后的每一个假设。"},{"en":"The book is for patient cogitators who enjoy slow, careful arguments.","zh":"这本书适合有耐心、喜欢慢慢推敲论证的思考者。"}]},{"partOfSpeech":"n.","definition":{"en":"(Science fiction, especially Warhammer 40,000) Computer-like machines used for calculation, data storage, or control (plural of “cogitator”).","zh":"（科幻语境，尤指《战锤40K》）类似计算机的装置，用于计算、存储数据或控制系统（cogitator 的复数）。"},"examples":[{"en":"The ship’s cogitators failed, so the crew had to navigate by hand.","zh":"飞船的“ cogitators ”失灵了，船员只好手动导航。"},{"en":"Tech-priests consulted the cogitators for archived battle records.","zh":"技术牧师查阅这些“ cogitators ”来读取存档的战斗记录。"}]}],"synonyms":["thinkers","intellectuals","philosophers","contemplatives"],"phonetic":"/ˈkɑdʒəˌteɪtər/","extraExplanation":["“cogitator”源自拉丁语 cogitare（思考、考虑），和英语中的“cogitate（沉思）”同源；在现代日常英语里更常用的是“thinker”。","在《战锤40K》等作品里，“cogitator”带有复古未来风格，常用来指代“计算机/数据处理装置”，以区别于现代语境里的“computer”。"]}
{"word":"cogito","summary":{"en":"Cogito is a philosophical term (from Descartes) referring to the thinking self, often shorthand for “cogito, ergo sum” (“I think, therefore I am”).","zh":"Cogito 是源自笛卡尔的哲学术语，指“思考的自我”，也常作为“cogito, ergo sum（我思故我在）”的简称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In philosophy) the thinking self; the mind as a conscious, thinking subject.","zh":"（哲学）“思考的自我”；作为有意识、能思考的主体的心灵/自我。"},"examples":[{"en":"In Descartes’ philosophy, the cogito is what remains certain even when you doubt everything else.","zh":"在笛卡尔的哲学中，即使你怀疑其他一切，“cogito”（思考的自我）仍是确定无疑的。"},{"en":"The course begins with the cogito and then moves to questions about the outside world.","zh":"这门课从“cogito”出发，然后讨论外部世界的问题。"}]},{"partOfSpeech":"n.","definition":{"en":"Short for Descartes’ famous statement “cogito, ergo sum” (“I think, therefore I am”), used to refer to that argument or starting point.","zh":"“cogito, ergo sum”（“我思故我在”）的简称，用来指代这句名言或其论证/出发点。"},"examples":[{"en":"Some critics say the cogito is too personal to build a whole philosophy on.","zh":"一些批评者认为，“cogito”（我思故我在的出发点）太主观，难以据此建立完整哲学体系。"},{"en":"When people mention ‘the cogito,’ they often mean Descartes’ starting point for certainty.","zh":"人们提到“the cogito”时，常常指笛卡尔用来获得确定性的起点。"}]}],"synonyms":["the thinking self","Descartes’ cogito","cogito, ergo sum","Cartesian starting point"],"phonetic":"/kɑːˈɡiːtoʊ/","extraExplanation":["“Cogito”来自拉丁语 cogitare（思考）。在笛卡尔《第一哲学沉思集》中，他用“普遍怀疑”去寻找不可动摇的确定性：即使怀疑一切，我仍在“怀疑/思考”，因此作为正在思考的主体“我”必然存在。","英语里常见两种写法：小写 cogito（概念/论证）和大写 Cogito（指笛卡尔的这一核心命题/论证）。","文学与文化中它常被引用来表达：自我意识、理性、怀疑精神，或“思考=存在”的观念。相关表达：Cartesian doubt（笛卡尔式怀疑）、the thinking self（思考的自我）。"]}
{"word":"cogitos","summary":{"en":"“Cogitos” is the plural of “cogito,” usually referring to Descartes’ “I think, therefore I am” idea or similar self-validating acts of thinking.","zh":"“cogitos”是“cogito”的复数，通常指笛卡尔“我思，故我在”的思想，或类似用思考来确证自我存在的观点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “cogito”: a self-aware act of thinking, especially the famous idea from René Descartes that one’s thinking proves one’s existence (“I think, therefore I am”).","zh":"“cogito”的复数：指一种自我意识到的“思考行为/我在思”的状态，尤指笛卡尔提出的著名论点——思考本身证明自己的存在（“我思，故我在”）。"},"examples":[{"en":"In philosophy class, we compared different cogitos and what each one tries to prove.","zh":"在哲学课上，我们比较了不同的“cogitos（我思论证）”以及它们各自想证明什么。"},{"en":"Some writers say modern cogitos are shaped by technology and social media.","zh":"有些作者说，现代的“cogitos（自我确证式的思考）”会被科技和社交媒体塑造。"}]}],"synonyms":["cogito (singular)","Cartesian argument","self-awareness","act of thinking"],"phonetic":"/koʊˈdʒiːtoʊz/","extraExplanation":["“Cogito”源自拉丁语，意思是“我思/我在思考”。最常见的文化语境来自17世纪哲学家笛卡尔（René Descartes）的命题“Cogito, ergo sum”（我思，故我在），常被用来讨论“自我”“意识”“确定性”等主题。","英语里更常直接用单数“cogito”指这条论证或核心想法；复数“cogitos”较少见，多用于比较不同版本的“我思”式论证或不同思想家的“自我确证”观点。"]}
{"word":"coglorify","summary":{"en":"“Coglorify” (usually “co-glorify”) means to glorify or praise together; it’s rare in everyday English.","zh":"“coglorify”（通常写作“co-glorify”）指“共同颂扬/共同给予荣耀”，日常英语中较少见。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare; usually written “co-glorify”) to glorify or praise together with someone; to give joint glory or credit to.","zh":"（罕用；通常写作 co-glorify）与他人一起赞美/颂扬；共同给予荣耀或功劳。"},"examples":[{"en":"Some believers say we should not co-glorify people, but glorify God alone.","zh":"有些信徒认为我们不该与人“共同颂扬”人，而应只荣耀上帝。"},{"en":"The article seemed to co-glorify the leader and his inner circle.","zh":"这篇文章似乎在共同歌颂那位领袖及其核心圈子。"}]}],"synonyms":["praise together","give joint credit","celebrate together","glorify (more common)"],"phonetic":"/koʊˈɡlɔrəˌfaɪ/","extraExplanation":["“coglorify”不是常见的标准拼写，更常见的是带连字符的“co-glorify”。在日常英语里，人们通常直接说“praise together / give joint credit / celebrate together”。","词根“glorify”来自“glory（荣耀）”。前缀“co-”表示“共同、一起”，因此语义是“共同颂扬/共同归功”。"]}
{"word":"coglorious","summary":{"en":"“Coglorious” is not standard English; it’s probably a misspelling of “glorious” or a playful blend of “cog” + “glorious.”","zh":"“coglorious”不是标准英语；多半是“glorious”的拼写错误，或“cog + glorious”的俏皮合成词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling or a playful invented word (nonce word). People might intend “glorious,” or they may be blending “cog” + “glorious” to mean “gloriously mechanical/gear-like.”","zh":"不是标准英语单词；很可能是拼写错误或临时造词（nonce word）。有时可能是想写“glorious（辉煌的/极好的）”，也可能是把“cog（齿轮）”和“glorious”混合，表达“很有机械/齿轮美感、酷得很”的意思。"},"examples":[{"en":"I can’t find “coglorious” in dictionaries—did you mean “glorious”?","zh":"我在词典里找不到“coglorious”，你是不是想写“glorious”？"},{"en":"The artist described the steampunk machine as “coglorious,” meaning full of gears and glory.","zh":"艺术家把那台蒸汽朋克机器称为“coglorious”，意思是“满是齿轮、又很酷很华丽”。"}]}],"synonyms":["glorious","magnificent","splendid"],"phonetic":"/koʊˈɡlɔriəs/","extraExplanation":["“coglorious”目前不属于常见/规范英语词汇（在主流词典中通常查不到）。如果你是在小说、游戏、网文或同人作品里看到它，它很可能是作者为了风格而创造的词。","最可能的目标词是“glorious（辉煌的；极好的）”。如果语境与机械、齿轮、蒸汽朋克有关，也可能是“cog + glorious”的合成词，用来营造一种俏皮、夸张的修辞效果。","如果你把原句发给我，我可以根据上下文判断它更像是拼写错误还是有意造词，并给出更贴切的翻译。"]}
{"word":"cogman","summary":{"en":"A rare informal word meaning a person treated as a small, replaceable part of a big system.","zh":"一个较少见的非正式词，指在大系统中被当作渺小、可替代的一员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, rare) A person seen as just a small, replaceable worker in a large organization; someone treated like “a cog in the machine.”","zh":"（非正式；较少见）指在大型组织中被看作渺小、可替代的工作人员；像“机器里的一个齿轮”一样的人。"},"examples":[{"en":"He felt like a cogman in the company—easy to replace and rarely noticed.","zh":"他觉得自己在公司里就像个“cogman”——很容易被替代，也很少被注意到。"},{"en":"The novel criticizes a system that turns people into cogmen instead of valuing their ideas.","zh":"这部小说批评一种把人变成“cogmen”、而不重视他们想法的体制。"}]}],"synonyms":["cog","functionary","underling","worker bee","small fry"],"phonetic":"/ˈkɑɡˌmæn/","extraExplanation":["“cogman”不是常见标准词汇，更常见的说法是“a cog in the machine”（机器里的一个齿轮），用来比喻个人在体制里显得渺小、可替代。你可能在讽刺性写作、评论或虚构作品里看到“cogman”作为这种比喻的变体。"]}
{"word":"cogmen","summary":{"en":"“Cogmen” is the plural of “cogman,” meaning workers who operate or maintain gear (cogwheel) mechanisms, especially in older machinery.","zh":"“Cogmen”是“cogman”的复数，指负责操作或维护齿轮（齿轮传动）装置的工人，尤多见于旧式机械语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of “cogman”) A worker who maintains, adjusts, or operates cogwheels/gearing, especially in older machinery (e.g., mills or hoisting equipment).","zh":"（“cogman”的复数）负责维护、调校或操作齿轮传动装置的工人，尤指旧式机械（如磨坊或起重/卷扬设备）中的岗位。"},"examples":[{"en":"In the old mill, the cogmen kept the gears aligned so the stones could turn smoothly.","zh":"在那座老磨坊里，齿轮工人（cogmen）把齿轮对准，磨石才能顺畅转动。"},{"en":"The foreman called for cogmen to inspect the worn teeth on the main gear.","zh":"工头叫来齿轮工人检查主齿轮上磨损的齿牙。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare/archaic) Skilled workers responsible for mechanical timing and gear coordination in early industrial equipment.","zh":"（少见/古旧）早期工业设备中负责机械“配时”与齿轮协调的技术工人。"},"examples":[{"en":"Factory records mention cogmen who specialized in keeping the machines in step.","zh":"工厂档案提到一些齿轮工人专门负责让机器运转同步。"}]}],"synonyms":["gear operator","mechanic","maintenance worker","millwright"],"phonetic":"/ˈkɑɡmən/","extraExplanation":["“cogman / cogmen”属于较少见、偏历史的职业用语，多出现在描述早期工厂、磨坊、矿井卷扬机等机械系统的语境。现代英语更常用更具体的职位名称，如“mechanic（机械修理工）”“millwright（机修/装配技工）”“maintenance technician（维修技术员）”。","拼写上“cogman”的复数写作“cogmen”，类似“man → men”。阅读旧文学作品、工业史资料时更容易遇到这种复数形式。"]}
{"word":"cogn","summary":{"en":"cogn- is a word root meaning “to know/recognize,” used in words about thinking and knowledge (e.g., cognitive, cognition, recognize).","zh":"cogn- 是表示“知道/认识”的词根，常见于与思考和知识相关的词中（如 cognitive, cognition, recognize）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Latin-based word root meaning “to know” or “to learn/recognize,” seen in many English words related to thinking and knowledge","zh":"拉丁语词根，意思是“知道/认识/学习辨认”，常见于与“思考、认知、知识”相关的英语词汇中"},"examples":[{"en":"The word “cognitive” comes from the root cogn-, meaning “to know.”","zh":"“cognitive（认知的）”来自词根 cogn-，意思是“知道/认识”。"},{"en":"“Recognize” is related to the same cogn- family: re- + cogn- + -ize.","zh":"“recognize（认出/承认）”也属于 cogn- 词族：re- + cogn- + -ize。"},{"en":"In psychology, “cognition” refers to processes like memory and attention.","zh":"在心理学中，“cognition（认知）”指记忆、注意力等心理过程。"}]}],"synonyms":["gnos-","-gnos-","-cogn-"],"phonetic":"/kɑn/","extraExplanation":["cogn- 常追溯到拉丁语 cognoscere（“逐渐了解、识别”），也和更基础的 gnōscere（“知道”）有关，因此你会在很多“知识/辨认/认知”相关词里看到 -cogn- / -gnos-。","常见同词根词汇：cognition（认知）、cognitive（认知的）、recognize（认出/承认）、cognizant（意识到的）、incognito（匿名的/乔装的）。其中 incognito 字面可理解为 “in-（不）+ cogn-（被认识）”，即“不被认出”。"]}
{"word":"Cognac","summary":{"en":"Cognac is a French brandy from the Cognac region; it can also mean an amber-brown color.","zh":"Cognac 指法国产区“干邑”的白兰地；也可指“干邑色”的琥珀棕色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A high-quality brandy made in the Cognac region of western France, distilled from white wine and aged in oak barrels.","zh":"干邑白兰地：一种产自法国西部“干邑（Cognac）”产区的优质白兰地，由白葡萄酒蒸馏后在橡木桶中陈酿而成。"},"examples":[{"en":"He ordered a glass of cognac after dinner.","zh":"晚饭后他点了一杯干邑。"},{"en":"Cognac is typically aged in oak, which gives it vanilla and caramel notes.","zh":"干邑通常在橡木桶中陈酿，因此常带有香草和焦糖的风味。"},{"en":"This bottle is labeled “Cognac,” so it must come from the Cognac region under French regulations.","zh":"这瓶标注“Cognac”，按法国法规它必须来自干邑产区。"}]},{"partOfSpeech":"adj.","definition":{"en":"A warm amber-brown color resembling the color of cognac.","zh":"干邑色：一种温暖的琥珀棕色，颜色类似干邑酒。"},"examples":[{"en":"She chose a cognac leather jacket.","zh":"她选了一件干邑色的皮夹克。"},{"en":"The living room has cognac-toned wood floors.","zh":"客厅铺着干邑色调的木地板。"}]}],"synonyms":["brandy (general)","eau-de-vie (broader term)","amber (color sense)","tan (color sense)"],"phonetic":"/ˈkoʊn.jæk/","extraExplanation":["“Cognac”在酒类里属于受原产地保护的名称（类似“Champagne/香槟”）：只有在法国干邑产区、并符合规定工艺与陈酿标准的白兰地才能叫Cognac。日常口语里有人会把所有白兰地都叫“cognac”，但在正式语境（酒标、菜单、专业描述）中这种用法不严谨。"]}
{"word":"cognac","summary":{"en":"Cognac is a French grape brandy (and also a golden-brown color name).","zh":"cognac 指法国干邑产区的葡萄白兰地，也可指“干邑色”的金棕色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of high-quality brandy from the Cognac region of France, made from grapes and aged in oak barrels.","zh":"干邑：一种高品质白兰地，产自法国干邑（Cognac）地区，以葡萄为原料并在橡木桶中陈酿。"},"examples":[{"en":"He ordered a glass of cognac after dinner.","zh":"晚餐后他点了一杯干邑。"},{"en":"Cognac is often sipped slowly to enjoy its aroma.","zh":"干邑常常被慢慢啜饮，以品味它的香气。"},{"en":"This bottle of cognac has been aged for many years.","zh":"这瓶干邑已经陈酿了很多年。"}]},{"partOfSpeech":"adj.","definition":{"en":"A warm golden-brown color, similar to the color of cognac.","zh":"干邑色：一种温暖的金棕色，类似干邑酒的颜色。"},"examples":[{"en":"She chose a cognac-colored leather jacket.","zh":"她选了一件干邑色的皮夹克。"},{"en":"The room was painted in soft cognac tones.","zh":"这个房间刷成了柔和的干邑色调。"}]}],"synonyms":["brandy","French brandy","amber (color)","golden-brown"],"phonetic":"/ˈkoʊn.jæk/","extraExplanation":["“Cognac（干邑）”在法国属于受法律保护的原产地名称（类似“香槟 Champagne”）。只有在法国干邑产区、并按规定工艺蒸馏与陈酿的白兰地，才能合法标为“Cognac”。","常见等级缩写：VS（较年轻）、VSOP（较长陈酿）、XO（更长陈酿）。日常口语里也会用这些缩写来点酒或描述酒的陈酿程度。"]}
{"word":"cognacs","summary":{"en":"“Cognacs” means more than one cognac (a French brandy from the Cognac region).","zh":"“cognacs”指多个/多种干邑（法国干邑产区的白兰地）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of cognac: a type of high-quality brandy from the Cognac region of France.","zh":"cognac 的复数：指法国干邑（Cognac）产区出产的一种高品质白兰地。"},"examples":[{"en":"The menu offers several cognacs after dinner.","zh":"菜单上提供几种干邑，适合餐后饮用。"},{"en":"They compared different cognacs to see which one tasted smoother.","zh":"他们对比了不同的干邑，看看哪一种口感更顺滑。"}]}],"synonyms":["brandies","French brandies"],"phonetic":"/ˈkoʊn.jæk/","extraExplanation":["“Cognac（干邑）”是一种受法律保护的产地名称（类似 Champagne 香槟）。只有在法国干邑产区、并符合特定酿造与蒸馏规定的白兰地，才可以叫 cognac。","英语里谈到“many cognacs”通常指“多种/多瓶干邑酒”，而不是不同类型的“白兰地”泛称；更泛的说法是 brandy（白兰地）。"]}
{"word":"cognate","summary":{"en":"A cognate is a word (or form) that shares the same historical origin as a word in another language; it can also mean “related by origin.”","zh":"cognate 指不同语言中“同源”的词（同一词源），也可作形容词表示“同源的/同族的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In linguistics, a word in one language that has the same origin as a word in another language (often with similar spelling and meaning).","zh":"（语言学）同源词：不同语言中来源相同（词源相同）的词，常常在拼写和意义上也相近。"},"examples":[{"en":"English “night” and German “Nacht” are cognates.","zh":"英语 night 和德语 Nacht 是同源词。"},{"en":"Not every similar-looking word is a cognate; some are just borrowings or coincidences.","zh":"并不是所有看起来相似的词都是同源词；有些只是借词或巧合。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related by origin; sharing the same root or source (used to describe words, languages, or sometimes people).","zh":"同源的；同族的：在来源上相关、共享同一词根或来源（常用于描述词、语言，有时也指人）。"},"examples":[{"en":"Spanish and Portuguese are cognate languages.","zh":"西班牙语和葡萄牙语是同源语言。"},{"en":"These two terms are cognate forms from the same root.","zh":"这两个术语是来自同一词根的同源形式。"}]}],"synonyms":["etymological relative","related word","same-origin word"],"phonetic":"/ˈkɑɡneɪt/","extraExplanation":["“cognate”来自拉丁语 *cognatus*，本义是“同出生、同族”。在语言学习中，它常用来帮助你通过“熟悉的相似词”猜测词义（例如 English *information* 和 French *information*）。","注意区分：同源词（cognates）强调“共同祖先/词源”；借词（loanwords）强调“从别的语言借来”；假朋友（false friends）则是“看起来像但意思不同”（如 English *actual* 与 Spanish *actual*＝“当前的”）。"]}
{"word":"cognate-related","summary":{"en":"“Cognate-related” means related to cognates—words in different languages that share a common origin.","zh":"“cognate-related”表示“与同源词有关/同源相关”，指不同语言中来自同一词源的词之间的关系。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to cognates—words in different languages that come from the same historical root and often look or sound similar.","zh":"与“同源词”有关的——指不同语言中来自同一历史词根、且常常在形式或发音上相似的词之间的关系。"},"examples":[{"en":"English “mother” and German “Mutter” are cognate-related words.","zh":"英语 mother 和德语 Mutter 是同源相关的词。"},{"en":"These two terms seem cognate-related, but their meanings have drifted apart over time.","zh":"这两个词看起来同源相关，但随着时间推移意义已经分化。"}]},{"partOfSpeech":"adj.","definition":{"en":"Connected with the idea of similarity across languages due to shared origin (used in linguistics or language learning).","zh":"与“因共同来源而产生的跨语言相似性”这一概念相关（常用于语言学或语言学习语境）。"},"examples":[{"en":"Cognate-related patterns can help you guess the meaning of new vocabulary in a related language.","zh":"同源相关的规律能帮助你在相关语言中猜测新词的意思。"},{"en":"The textbook has a chapter on cognate-related spelling changes between Spanish and English.","zh":"这本教材有一章讲西班牙语和英语之间同源相关的拼写变化。"}]}],"synonyms":["cognate","cognate-based","etymologically related","from the same root","same-origin"],"phonetic":"/ˈkɑɡneɪt rɪˈleɪtɪd/","extraExplanation":["“cognate”本身既可作名词（a cognate 同源词），也可作形容词（cognate languages 同源语言）。“cognate-related”并不是最固定、最常见的词典词条，更像是写作中临时组合的形容词；在正式学术写作里也常见类似表达：cognate-based、cognate-influenced、cognate relationship。","注意不要把“cognate-related”（同源相关）和“look-alike/false friend”（形似但意义不同的“假朋友”）混为一谈：同源词也可能发展出不同含义，但核心强调的是“共同词源”。"]}
{"word":"cognately","summary":{"en":"Cognately means “in a way that shows a shared origin,” especially when talking about cognate words in linguistics.","zh":"Cognately 指“以显示共同词源的方式”，尤其用于语言学中谈论同源词。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that shows two words or languages share the same origin; as cognates.","zh":"以同源的方式；表示两个词或语言有共同词源（作为同源词）。"},"examples":[{"en":"English “mother” and German “Mutter” are cognately related.","zh":"英语 mother 和德语 Mutter 在词源上是同源相关的。"},{"en":"The linguist compared the two terms cognately to trace their history.","zh":"这位语言学家从同源角度比较这两个术语，以追溯它们的历史。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a closely related or connected way (more formal and less common).","zh":"以密切相关的方式（较正式、较少见的用法）。"},"examples":[{"en":"These traditions developed cognately over centuries in neighboring regions.","zh":"这些传统在相邻地区经过数百年发展，彼此紧密关联。"}]}],"synonyms":["etymologically","by origin","in a related way"],"phonetic":"/ˈkɑɡneɪtli/","extraExplanation":["“cognately”来自形容词“cognate（同源的/同族的）”，常见于语言学写作。日常英语里更常说：“are cognates / are related / share the same origin”。","语言学里的“cognate”强调“来源相同”，不等于“看起来像”或“意思一样”；例如英语 actual 和法语 actuel 形式相近但意思不同，属于“false friends（假朋友词）”，不算可靠的同源意义对应。"]}
{"word":"cognateness","summary":{"en":"“Cognateness” means the state of being historically related (cognate), especially between words or languages.","zh":"“cognateness”指（词或语言之间因共同历史来源而产生的）同源性、同源关系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being cognate; a relationship between words or languages because they come from the same historical origin","zh":"同源性；（词或语言因历史来源相同而产生的）同源关系"},"examples":[{"en":"Linguists study the cognateness of words like “mother” (English) and “Mutter” (German).","zh":"语言学家研究像英语 mother 与德语 Mutter 这样的词的同源性。"},{"en":"The cognateness between Spanish and Italian helps learners guess meanings of many words.","zh":"西班牙语和意大利语之间的同源性帮助学习者猜出许多词的意思。"}]}],"synonyms":["relatedness","cognate relationship","common origin"],"phonetic":"/ˈkɑɡnətnəs/","extraExplanation":["“cognateness”常用于语言学语境，强调“同源”而不是“看起来相似”。例如英语 actual 和西班牙语 actual 形式相似，但意思不同（“实际的” vs “当前的”），这种情况叫“假同源/伪同源”（false cognates）。","词源提示：co-（共同）+ gnatus（拉丁语“出生”相关）→ 表示“共同出身/同一来源”。学术写作里也常用 relatedness 或 cognate relationship 来表达类似概念。"]}
{"word":"cognates","summary":{"en":"Cognates are words (or word forms) in different languages that come from the same origin and are often similar in spelling and meaning.","zh":"cognates 指不同语言中来源相同、常在拼写与意义上相近的同源词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A word in one language that is related to a word in another language because they share the same historical origin (often similar in form and meaning).","zh":"（不同语言中）同源词；由于共同的历史来源而相关的词（常在形式和意义上相似）。"},"examples":[{"en":"English “night” and German “Nacht” are cognates.","zh":"英语 night 和德语 Nacht 是同源词。"},{"en":"Many Spanish-English cognates make reading easier, like “animal” and “animal.”","zh":"许多西英同源词能让阅读更容易，比如 animal（动物）和 animal（动物）。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having a shared origin; related in form and meaning across languages.","zh":"同源的；（在不同语言中）在形式和意义上有共同来源的。"},"examples":[{"en":"These two words are cognate forms from Latin.","zh":"这两个词是源自拉丁语的同源形式。"},{"en":"French and Italian have many cognate vocabulary items.","zh":"法语和意大利语有很多同源词汇。"}]}],"synonyms":["related words","word relatives","loanword (not always)"],"phonetic":"/ˈkɑɡˌneɪts/","extraExplanation":["学习提示：同源词（cognates）通常能帮助你快速猜词义，但要小心“假同源词/假朋友”（false cognates / false friends），也就是看起来像、意思却不同的词。例如英语 actual（实际的）与西语 actual（当前的）容易混淆。","词源小知识：cognate 来自拉丁语 co-（共同）+ gnatus（出生的），字面意思是“同出生的/同源的”，所以常用来描述语言之间“同根”的词。"]}
{"word":"cognati","summary":{"en":"Cognati is a Latin plural meaning “blood relatives/kin,” especially used in Roman-law contexts for relatives through either parent’s line.","zh":"cognati 是拉丁语复数，意为“血亲/亲属”，常见于罗马法语境，指父系或母系两边的亲属。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Latin; plural noun) blood relatives; people related by birth (kin).","zh":"（拉丁语；复数名词）血亲；有血缘关系的亲属。"},"examples":[{"en":"In the old text, the term cognati refers to a person’s blood relatives.","zh":"在这篇旧文献里，cognati 指的是一个人的血亲。"},{"en":"Roman law often contrasted cognati (blood relatives) with other kinds of legal relations.","zh":"罗马法中常把 cognati（血亲）与其他类型的法律关系作对比。"}]},{"partOfSpeech":"n.","definition":{"en":"(Roman law/context) relatives connected through either the father’s or the mother’s line (as opposed to agnati, relatives through the male line only).","zh":"（罗马法语境）父系或母系两边的亲属（区别于 agnati，指仅父系男性谱系的亲属）。"},"examples":[{"en":"A person’s cognati included relatives on the mother’s side.","zh":"一个人的 cognati 包括母系亲属。"},{"en":"The inheritance rules could differ for cognati and agnati.","zh":"继承规则对 cognati 和 agnati 可能不同。"}]}],"synonyms":["kin","relatives","blood relations","kindred"],"phonetic":"/kɑɡˈnɑti/","extraExplanation":["cognati 是拉丁语 cognatus（“亲属、同宗者”）的复数形式。在英语学习中，你更常见到的是 cognate（同源词/同源的），意思与“同根同源”有关；它和拉丁语的“亲属”概念在比喻上相通——词与词像“亲戚”一样来自同一来源。","如果你本来想查的是英语单词 cognate（更常用），告诉我你的语境（语言学/日常/学术），我可以按英语词条解释并给出常见搭配。"]}
{"word":"cognatic","summary":{"en":"Cognatic means either (1) related by blood through both the mother’s and father’s lines, or (2) related to cognates (words from the same historical root).","zh":"cognatic 可指（1）亲属学中的“双系/双边血缘”（父母两边都算），也可指（2）与“同源词/同源关系”有关的（语言学用语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related through blood on either the mother’s or the father’s side (not only through males).","zh":"（亲属关系）父系与母系两边都算的；通过父母任一方的血缘关系的（不只按父系）。"},"examples":[{"en":"In many societies, cognatic descent allows people to claim kinship through both parents.","zh":"在许多社会中，双系（cognatic）血统让人们可以通过父母双方来认定亲属关系。"},{"en":"She traced her family history using a cognatic approach, including relatives from her mother’s side.","zh":"她用双系的方法追溯家族史，把母系亲属也算进去。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to cognates—words that come from the same historical root in different languages.","zh":"与同源词有关的；指不同语言中源自同一词根的词。"},"examples":[{"en":"The linguistics paper compared cognatic words in Latin and French.","zh":"那篇语言学论文比较了拉丁语和法语中的同源词。"},{"en":"“Night” (English) and “Nacht” (German) are cognatic forms from an older shared root.","zh":"英语的 night 和德语的 Nacht 是来自更早共同词根的同源形式。"}]}],"synonyms":["bilateral (kinship)","two-sided (kinship)","cognate (linguistics)","etymologically related"],"phonetic":"/kɑɡˈnætɪk/","extraExplanation":["“cognatic”在英语里偏学术用语，常见于人类学/社会学（亲属与继承制度）和历史语言学（同源词比较）。日常交流里更常用的是“related on the mother’s/father’s side”或直接说“cognate”。","亲属学里：cognatic（双系/双边）强调父母双方都算亲属；与“agnatic”（父系为主、只按男性血缘线）相对。语言学里：cognatic与“cognate”相关，但更像“关于同源关系的/同源的（形式）”，语域更正式。"]}
{"word":"cognatical","summary":{"en":"A rare adjective meaning “cognate”—related by origin, roots, or family.","zh":"一个罕用形容词，意为“同源的/同族的”（相当于 cognate）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Related by origin or family; having the same roots; cognate.","zh":"（罕用）同源的；同族的；有共同根源的；同词源的（即“cognate”之意）。"},"examples":[{"en":"Spanish and Italian are cognatical languages in the sense that they share Latin roots.","zh":"从共享拉丁语根源这一点来说，西班牙语和意大利语是同源（cognatical）的语言。"},{"en":"The researcher compared cognatical words across several Indo-European languages.","zh":"研究者比较了几个印欧语系语言中的同源词。"}]}],"synonyms":["cognate","related","kindred","affiliated"],"phonetic":"/kɑɡˈneɪtɪkəl/","extraExplanation":["“cognatical”非常少见，现代英语里更常用的是“cognate”（形容词/名词）来表示“同源的；同词源的；同族的”。","词源上与拉丁语“cognatus”（同生的、同族的）相关：co-（共同）+ gnatus（出生）。在语言学语境中，常用搭配是“cognate words / cognate languages”。"]}
{"word":"cognation","summary":{"en":"Cognation is a formal word meaning blood relationship (kinship), and more rarely, a close affinity between things.","zh":"Cognation 是一个正式用语，主要指血缘亲属关系；较少见时也指事物之间的密切关联或相似性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Formal) a relationship by blood; kinship.","zh":"（正式用语）血缘关系；亲属关系。"},"examples":[{"en":"In Roman law, cognation referred to kinship through blood rather than through marriage.","zh":"在罗马法中，cognation 指的是通过血缘形成的亲属关系，而不是通过婚姻形成的关系。"},{"en":"The tribe organized inheritance according to cognation, counting relatives on both the mother’s and father’s sides.","zh":"这个部落按血缘亲属关系来安排继承，同时计算母系和父系的亲属。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) a close connection or affinity between things; a sense of being related in nature.","zh":"（较少见）事物之间的密切联系；相似性；同类关系。"},"examples":[{"en":"Some writers note a cognation between music and poetry in their rhythm and emotion.","zh":"有些作家指出音乐与诗歌在节奏和情感上有一种同类关联。"}]}],"synonyms":["kinship","consanguinity","blood relation","affinity"],"phonetic":"/kɑɡˈneɪʃən/","extraExplanation":["cognation 来自拉丁语 cognatio，词根与“know/认识”相关（co- + gn-），原意偏向“通过共同认识到的亲属关系”，后来固定用于“血亲”。","在英语里它常见于法律、人类学、历史研究等正式语境。不要与 cognate（同源词/同类的）混淆：cognate 更常用于语言学；cognation 更偏向“亲属关系”这个抽象名词。"]}
{"word":"cognatus","summary":{"en":"Cognatus is a Latin-based term meaning “related by blood” or “a blood relative,” used mainly in legal/classical contexts.","zh":"cognatus 是拉丁语来源的词，主要用于法律/古典语境，表示“血缘上的”或“血亲”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Legal/Latin-based) related by blood; a blood relative (as opposed to related by marriage).","zh":"（法律/拉丁语来源）血缘上的；血亲（区别于姻亲）。"},"examples":[{"en":"In Roman-law writing, a person could be described as cognatus if they were related by blood.","zh":"在罗马法相关的写作中，如果一个人与他人有血缘关系，就可能被称为 cognatus。"},{"en":"She is a cognatus, not an in-law, so the inheritance rules may be different.","zh":"她是血亲（cognatus），不是姻亲，所以继承规则可能不同。"}]},{"partOfSpeech":"n.","definition":{"en":"a blood relative; someone who shares a family line by birth.","zh":"血亲；有同一血缘家族线的人。"},"examples":[{"en":"Only cognatus were allowed to attend that private family rite in the story.","zh":"故事里只有血亲（cognatus）被允许参加那场私密的家族仪式。"},{"en":"The historian listed his cognatus before naming political allies.","zh":"那位历史学家先列出他的血亲（cognatus），再提到政治盟友。"}]}],"synonyms":["blood relative","kin","kinsman","cognate (related meaning)"],"phonetic":"/kɑɡˈneɪtəs/","extraExplanation":["cognatus 是拉丁语词（来自 con- “共同” + gnatus/natus “出生的”），在英语里多见于法律史、古典学或学术写作中，不是日常用词。","它常与拉丁语 affinis（姻亲、因婚姻而产生的亲属关系）相对，用来区分“血缘亲属”与“姻亲”。","在现代英语里更常见的对应词是 cognate（同源的/同族的；同源词），以及更日常的表达：blood relative、kin、relative by blood。"]}
{"word":"cognisability","summary":{"en":"Cognisability means how easily something can be recognized or identified.","zh":"cognisability 指某事物“有多容易被认出或识别”的程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being easy to recognize, identify, or know (often because it has clear, familiar features)","zh":"可辨识性；可识别性（指因特征清晰或熟悉而容易被认出、识别或了解的性质）"},"examples":[{"en":"The logo’s simplicity improves its cognisability at a glance.","zh":"这个标志的简洁性提高了它一眼就能被辨认出来的可辨识性。"},{"en":"In low light, the suspect’s cognisability was reduced.","zh":"在光线昏暗的情况下，嫌疑人的可辨识性降低了。"},{"en":"The artist plays with faces to question personal cognisability.","zh":"这位艺术家通过处理面孔来质疑个人身份的可辨识性。"}]}],"synonyms":["recognizability","identifiability","distinctiveness","visibility"],"phonetic":"/ˌkɑɡnəˈzaɪbəlɪti/","extraExplanation":["英式拼写是 cognisability，美式更常见的是 cognizability。两者含义相同：都来自 cognise/cognize（“认识、识别”）+ -ability（“……的能力/性质”）。","该词常见于学术、法律与设计/品牌语境：例如“在证人证词中某人是否可辨认”“图标/标志在远处或小尺寸下的可识别程度”。"]}
{"word":"cognisable","summary":{"en":"“Cognisable” means “recognizable; able to be identified,” and is a British spelling of “cognizable.”","zh":"“cognisable”意为“可辨认的、可识别的”，是“cognizable”的英式拼写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be recognized, identified, or understood (often by having familiar features).","zh":"可辨认的；可识别的；可理解的（通常因具有熟悉的特征）。"},"examples":[{"en":"Her voice was still clearly cognisable over the phone.","zh":"电话里她的声音仍然很容易辨认。"},{"en":"The old factory is barely cognisable after the renovation.","zh":"翻新后，那座旧工厂几乎认不出来了。"},{"en":"There is a cognisable pattern in the data.","zh":"数据中有一个可识别的规律。"}]}],"synonyms":["recognisable","recognizable","identifiable","discernible","distinguishable"],"phonetic":"/ˈkɑɡnəˌzaɪzəbəl/","extraExplanation":["“cognisable”是英式拼写；美式英语更常见拼写是“cognizable”。两者意思相同。","词根来自拉丁语 cognoscere（意为“认识、辨认”），同源词包括：cognition（认知）、recognize（识别）。","常见搭配：clearly/easily/barely cognisable（清晰/容易/几乎无法辨认）。","在正式写作中更常见；日常口语里常用“recognizable/recognisable”。"]}
{"word":"cognisableness","summary":{"en":"“Cognisableness” means the quality of being cognizable—able to be recognized or (in law) able to be heard by a court. It’s rare; “cognizability/cognisability” is more common.","zh":"“cognisableness”指“可被认知/可受理”的性质（法律语境尤常见）。该词很少用，更常见的名词是“cognizability/cognisability”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being able to be recognized, understood, or taken notice of (often used in legal contexts: able to be dealt with by a court)","zh":"可被识别、理解或被注意到的性质（常见于法律语境：案件/事项可由某法院受理）"},"examples":[{"en":"In law, the cognisableness of the claim depends on whether the court has jurisdiction.","zh":"在法律上，该主张是否“可受理”（cognisableness）取决于法院是否具有管辖权。"},{"en":"The report questioned the cognisableness of the problem to the public because the effects were hard to see.","zh":"报告质疑公众是否能“察觉/认知”这个问题，因为其影响不容易看见。"}]}],"synonyms":["cognizability","cognisability","recognizability","legitimacy (context-dependent)"],"phonetic":"/ˈkɑɡnəˌzaɪzəbəlnəs/","extraExplanation":["“cognisableness”非常少见，很多写作场景里会显得不自然；更常用的是形容词“cognizable/cognisable（可被认知/可受理的）”或名词“cognizability/cognisability（可认知性/可受理性）”。","拼写方面：英式英语更常见“cognisable / cognisability”（s），美式英语更常见“cognizable / cognizability”（z）。","法律里“cognizable”常指“（案件）可由某法院管辖/受理”，例如“a cognizable claim（可受理的主张）”。如果你是在写论文或法律文件，通常选用更标准的“cognizability/cognisability”。"]}
{"word":"cognisably","summary":{"en":"Cognisably means “in a recognizable way; noticeably.”","zh":"cognisably 表示“以可辨认的方式；明显地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that is recognizable; noticeably or clearly enough to be identified","zh":"以可被辨认的方式；明显到足以被识别"},"examples":[{"en":"After the renovation, the old building was still cognisably the same.","zh":"翻新之后，这座老建筑仍然明显还是原来的样子。"},{"en":"Her voice was cognisably different on the recording.","zh":"录音里她的声音明显不一样。"},{"en":"The town is becoming less cognisably traditional every year.","zh":"这座小镇一年比一年不那么“看得出”传统了。"}]}],"synonyms":["recognizably","noticeably","distinctly","clearly"],"phonetic":"/ˈkɑɡnəˌzaɪbli/","extraExplanation":["“cognisably”更常见于英式拼写，对应的美式拼写通常是“cognizably”。两者意思相同，只是拼写习惯不同。","它来自形容词“cognisable / cognizable（可辨认的）”，常与“still / clearly / hardly”等词搭配，如“still cognisably…”（仍然看得出来是……）。"]}
{"word":"cognisance","summary":{"en":"Cognisance means awareness or knowledge of something, often used in formal English (also spelled cognizance).","zh":"cognisance 指对某事的知晓或意识（多用于正式英语；也可拼作 cognizance）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Awareness or knowledge of something; notice.","zh":"对某事的知晓；意识到；注意到。"},"examples":[{"en":"The manager had no cognisance of the problem until customers complained.","zh":"直到顾客投诉，经理才意识到这个问题。"},{"en":"Please take cognisance of the safety rules before entering the lab.","zh":"进入实验室前请注意安全规定。"}]}],"synonyms":["awareness","knowledge","notice","recognition"],"phonetic":"/ˈkɑɡnəzəns/","extraExplanation":["“cognisance”是英式拼写；美式英语更常见的拼写是“cognizance”。两者意思相同。","常见固定搭配：take cognisance of（注意到/考虑到）。在法律或正式文体中也常见，如“the court took cognisance of…”（法院注意到/受理……）。","词源与“cognition（认知）”同源，来自拉丁语词根，和“recognize（认出/承认）”“cognitive（认知的）”是同一词族。"]}
{"word":"cognisant","summary":{"en":"Cognisant (often spelled cognizant in US English) means aware of and understanding something; mindful of a fact, risk, or responsibility.","zh":"cognisant（美式常拼作 cognizant）意为“意识到、知晓并理解”；也可表示“牢记某个事实、风险或责任”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(US spelling usually: cognizant) aware of something; noticing and understanding what is happening.","zh":"（美式拼写常作 cognizant）意识到的；知晓并理解正在发生的事。"},"examples":[{"en":"She was cognisant of the risk, but she chose to continue.","zh":"她意识到风险，但还是选择继续。"},{"en":"Please be cognisant of other people’s time during the meeting.","zh":"开会时请注意别人的时间安排。"}]},{"partOfSpeech":"adj.","definition":{"en":"aware that something exists or is important; mindful of a fact or responsibility.","zh":"认识到某事的存在或重要性；牢记某个事实或责任。"},"examples":[{"en":"The company is cognisant of its impact on the environment.","zh":"公司清楚自己对环境的影响。"},{"en":"He stayed cognisant of his role as a mentor.","zh":"他始终牢记自己作为导师的角色。"}]}],"synonyms":["aware","mindful","conscious","informed","attentive"],"phonetic":"/ˈkɑɡ.nə.zənt/","extraExplanation":["“cognisant”更常见于英式英语；在美式英语里通常写作“cognizant”。两者意思相同，只是拼写差异。","词根来自拉丁语“cognoscere”（认识、了解），和“cognition”（认知）同源，因此带有“有意识地理解/注意到”的语感，比单纯的“know”更正式。","语体较正式，常用于写作、新闻、商业或学术语境。日常口语里更常用“aware of / mindful of”。"]}
{"word":"cognise","summary":{"en":"“Cognise” (more often spelled “cognize” in American English) means to recognize, perceive, or understand something, and it is quite formal/rare.","zh":"“cognise”（美式更常写作“cognize”）意为“认出/察觉/理解”，用法较正式且少见。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To become aware of something; to recognize or perceive it (a rare/technical verb).","zh":"意识到某事；认出、察觉（较少用、偏学术/技术性的动词）。"},"examples":[{"en":"After a moment, she cognised the danger and stepped back.","zh":"过了一会儿，她察觉到危险，便往后退了一步。"},{"en":"The system can cognise patterns in speech, but it still makes mistakes.","zh":"该系统能识别语音中的模式，但仍会出错。"}]},{"partOfSpeech":"vt.","definition":{"en":"To understand something mentally; to know (very formal/rare).","zh":"在心智上理解；知晓（非常正式/少见）。"},"examples":[{"en":"He could not cognise why the decision felt unfair.","zh":"他无法理解为什么这个决定让人觉得不公平。"}]}],"synonyms":["recognize","realize","perceive","understand","apprehend"],"phonetic":"/ˈkɑɡ.naɪz/","extraExplanation":["“cognise”多见于英式拼写，对应更常见的美式拼写是“cognize”。在日常英语里，人们通常用更自然的词：recognize（认出/意识到）、realize（意识到/明白）、perceive（察觉）、understand（理解）。","它和“cognition（认知）/cognitive（认知的）”同源，来自拉丁语词根 cogn-（知道、认识）。因此在心理学、哲学或较正式写作中更可能出现。"]}
{"word":"cognised","summary":{"en":"“Cognised” is the (UK) past form of “cognize,” meaning “recognized/understood,” often in formal contexts; it can also mean “took cognizance of” in legal use.","zh":"“cognised”是英式拼写，表示“cognize”的过去式/过去分词，意为“意识到、理解”（偏正式）；在法律语境中也可指“受理/依法知悉”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “cognize”: to recognize, understand, or become aware of something (often used in formal or academic writing).","zh":"“cognize”的过去式/过去分词：认知；意识到；理解（多用于正式或学术语境）。"},"examples":[{"en":"She finally cognised the reason he was upset.","zh":"她终于意识到他为什么生气。"},{"en":"The study examined how infants cognised facial expressions.","zh":"该研究考察婴儿如何认知面部表情。"}]},{"partOfSpeech":"v.","definition":{"en":"(Less common, legal) Past tense/past participle of “cognise”: to take notice of a case or matter officially; to take cognizance of it.","zh":"（较少见，法律用语）“cognise”的过去式/过去分词：正式受理；依法知悉（即“take cognizance”）。"},"examples":[{"en":"The court cognised the complaint and scheduled a hearing.","zh":"法院受理了该投诉并安排了听证。"}]}],"synonyms":["realized","recognized","understood","became aware of","noticed"],"phonetic":"/ˈkɑɡnaɪzd/","extraExplanation":["“cognised”主要是英式拼写；美式更常写作“cognized”。两者意思相同。","这个词在日常口语中很少用，更常见的替代词是“realized / recognized / understood / became aware of”。","词源与拉丁语“cognoscere（认识、了解）”有关，同源词包括“cognition（认知）”“cognitive（认知的）”。"]}
{"word":"cogniser","summary":{"en":"A rare word meaning “a person who recognizes or identifies.”","zh":"较少见的词，意思是“认出或识别的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who recognizes, identifies, or acknowledges someone or something; someone who knows (often used in older or formal writing).","zh":"（尤用于较旧或较正式的文本中）认出、识别或承认某人/某事的人；知晓者。"},"examples":[{"en":"She was the first cogniser of the forged signature.","zh":"她是第一个识别出伪造签名的人。"},{"en":"In old records, the cogniser is the person who confirms the identity of the witness.","zh":"在旧档案里，cogniser 指确认证人身份的人。"}]}],"synonyms":["recognizer","identifier","witness"],"phonetic":"/ˈkɑɡnaɪzər/","extraExplanation":["cogniser 是较少见的拼写与用法，常见于英式拼写体系（-iser），对应更常见的 cognizer（美式 -izer）。","它来自动词 recognise/recognize（“认出；识别；承认”）。现代英语里更常用 recognizer/recogniser 或更直接用 the person who recognized… 来表达。","在法律、档案或较古旧的正式文体中偶尔能见到，用来指“确认/识别某人的人”。"]}
{"word":"cognises","summary":{"en":"“Cognises” (UK spelling) means “recognizes/realizes; becomes aware of,” and it’s a formal verb form.","zh":"“cognises”（英式拼写）表示“认识到/意识到”，是较正式用法的动词形式。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to become aware of something; to recognize or realize something (often used in formal writing).","zh":"意识到某事；认识到/察觉到某事（多用于较正式的表达）。"},"examples":[{"en":"She finally cognised the danger of sharing her password.","zh":"她终于意识到分享密码的危险。"},{"en":"The report cognises that the policy may have unintended effects.","zh":"报告承认/意识到这项政策可能带来意想不到的影响。"}]}],"synonyms":["realize","recognize","acknowledge","perceive"],"phonetic":"/ˈkɑɡˌnaɪz/","extraExplanation":["“cognises”是英式拼写，表示动词“cognise”的第三人称单数（he/she/it cognises）。在美式英语中更常见的拼写是“cognizes”。","这个词比“realize / recognize”更正式、更少见；日常口语里通常用“realize”更自然。"]}
{"word":"cognising","summary":{"en":"“Cognising” means actively thinking about or becoming aware of something; it’s a formal British spelling of “cognizing.”","zh":"“Cognising”表示正在认知/意识到某事，是较正式的用法；为“cognizing”的英式拼写。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"the process of thinking about, recognizing, or becoming aware of something (present participle of the verb “cognise/cognize”).","zh":"正在思考、认知、识别或意识到某事（动词“cognise/cognize”的现在分词）。"},"examples":[{"en":"She was cognising the risks before making a decision.","zh":"她在做决定前正在认真认知这些风险。"},{"en":"In therapy, he is cognising how stress affects his sleep.","zh":"在治疗中，他正在意识到压力如何影响睡眠。"}]}],"synonyms":["recognizing","realizing","becoming aware of","perceiving","apprehending"],"phonetic":"/ˈkɑɡnəˌzaɪzɪŋ/","extraExplanation":["“cognising”是英式拼写，更常见的美式拼写是“cognizing”。这个词在日常英语里不常用，通常出现在哲学、心理学、认知科学等较正式的语境中。","在普通交流中，人们更常用：recognize（认出/承认）、realize（意识到）、be aware of（察觉到）、think about（思考）。例如：I realized the risk. / I recognized the pattern."]}
{"word":"cognisor","summary":{"en":"A legal term for someone who formally accepts an obligation in a recognizance (a court-backed promise).","zh":"法律用语：在具结（法院认可的保证）中正式承担义务的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Law) A person who formally acknowledges an obligation (especially in a recognizance), promising to do something (such as appear in court) or to pay a sum of money if they do not.","zh":"（法律）在“具结保释/具结”（recognizance）中正式承认并承担义务的人；通常承诺履行某事（如出庭），否则需支付一定金额。"},"examples":[{"en":"The cognisor promised to appear in court on the scheduled date.","zh":"具结人承诺在预定日期出庭。"},{"en":"If the cognisor fails to appear, the court may order the bond forfeited.","zh":"如果具结人未出庭，法院可能会裁定没收保证金。"}]}],"synonyms":["cognizor","principal (in a recognizance)","obligor","surety (sometimes)"],"phonetic":"/ˈkɑɡnɪˌzɔr/","extraExplanation":["“cognisor”较少见，更常见的拼写是“cognizor”。它多出现在英美法语境，常与“recognizance（具结/具结保释）”一起使用：当事人向法院作出正式保证，违约时可能承担金钱责任。","相关对比：cognisor/cognizor 是“做出保证的人”；有时会与“surety（保证人/担保人）”并列或区分，具体取决于案件和司法辖区的用法。"]}
{"word":"cognition","summary":{"en":"Cognition means the mental processes involved in thinking, learning, remembering, and understanding.","zh":"cognition 指與思考、學習、記憶和理解相關的心理過程（認知）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The mental process of knowing, thinking, learning, remembering, and understanding.","zh":"認知；指人類進行知道、思考、學習、記憶與理解等心理過程。"},"examples":[{"en":"Sleep is important for cognition, especially memory and attention.","zh":"睡眠對認知很重要，特別是記憶與注意力。"},{"en":"The class discusses how language affects cognition.","zh":"課堂討論語言如何影響認知。"}]},{"partOfSpeech":"n.","definition":{"en":"In psychology/brain science, a person’s thinking abilities or patterns (often discussed as “cognitive function”).","zh":"（心理學／腦科學）思維能力或思考模式，常見於「認知功能」的語境。"},"examples":[{"en":"After the injury, doctors monitored his cognition over time.","zh":"受傷後，醫生持續觀察他的認知狀況。"},{"en":"Regular exercise may support healthy cognition as we age.","zh":"規律運動可能有助於我們隨年齡增長維持健康的認知。"}]}],"synonyms":["thinking","understanding","perception","mental processes","awareness"],"phonetic":"/kɑɡˈnɪʃən/","extraExplanation":["字源：來自拉丁語 *cognitio*（認識、知識），與 *cognitive*（認知的）同源。","常見搭配：cognition and emotion（認知與情緒）、social cognition（社會認知）、human cognition（人類認知）、cognitive bias（認知偏誤）、cognitive function/decline（認知功能／認知衰退）。","使用提醒：*cognition* 比 *thinking* 更正式、偏學術；日常可說 “the way we think/understand things”。"]}
{"word":"cognitional","summary":{"en":"Cognitional means “related to cognition,” but it is uncommon; “cognitive” is the usual word.","zh":"cognitional 意为“与认知有关的”，但较少用；更常见的说法是 cognitive。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to cognition (the mental processes of knowing, thinking, learning, and understanding).","zh":"与“认知”有关的；涉及认识、思考、学习与理解等心理过程的。"},"examples":[{"en":"The study focuses on cognitional development in early childhood.","zh":"这项研究聚焦于幼儿早期的认知发展。"},{"en":"Stress can affect cognitional performance, such as attention and memory.","zh":"压力会影响认知表现，比如注意力与记忆力。"}]}],"synonyms":["cognitive","mental","intellectual"],"phonetic":"/kɑɡˈnɪʃənəl/","extraExplanation":["“cognitional”在现代英语里相对少见，更常用的是“cognitive”。在学术写作（尤其哲学、心理学、神经科学）中，你几乎总能用“cognitive”替换它而不改变意思。","词根来自拉丁语 cognoscere（认识、了解），相关词包括 cognition（认知）、cognize（认识到，较少用）。"]}
{"word":"cognitions","summary":{"en":"“Cognitions” means the processes of thinking/knowing, or specific thoughts and beliefs (plural of “cognition”).","zh":"“cognitions”是“cognition”的复数，指认知/思维过程，或具体的想法与信念。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the mental processes involved in knowing, learning, understanding, and remembering; thinking","zh":"与“认识/认知”有关的心理过程：包括了解、学习、理解与记忆等；思维活动"},"examples":[{"en":"Language learning involves many cognitions, such as attention and memory.","zh":"语言学习包含许多认知过程，比如注意力和记忆。"},{"en":"Stress can affect cognition and make it harder to focus.","zh":"压力会影响认知能力，让人更难专注。"}]},{"partOfSpeech":"n.","definition":{"en":"a particular thought, belief, or piece of knowledge someone has","zh":"某个具体的想法、信念或知识内容"},"examples":[{"en":"Her cognitions about failure were very negative.","zh":"她关于失败的想法非常消极。"},{"en":"Therapy helps people notice unhealthy cognitions and replace them with healthier ones.","zh":"治疗能帮助人们觉察不健康的想法，并用更健康的想法替代。"}]}],"synonyms":["thoughts","beliefs","thinking","mental processes","understanding"],"phonetic":"/kɑɡˈnɪʃən/","extraExplanation":["“cognitions”是可数复数形式，单数是“cognition”。在心理学语境中很常见（如 cognitive psychology 认知心理学；cognitive behavioral therapy/CBT 认知行为疗法），通常指“思维内容（想法/信念）”或“认知过程（注意、记忆、理解等）”。","词根小提示：来自拉丁语词根 *cogn-*（know，知道），同源词包括 *recognize*（认出）和 *cognitive*（认知的）。"]}
{"word":"cognitive","summary":{"en":"“Cognitive” describes things connected to how the mind works—especially thinking, learning, memory, and attention.","zh":"“cognitive”指与大脑如何运作有关，尤其与思考、学习、记忆和注意力相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to thinking and mental processes such as understanding, learning, remembering, and paying attention.","zh":"与思考及心理过程有关的，如理解、学习、记忆与注意力等。"},"examples":[{"en":"Regular sleep is important for cognitive performance.","zh":"规律的睡眠对认知表现很重要。"},{"en":"The app is designed to support children’s cognitive development.","zh":"这个应用旨在支持儿童的认知发展。"},{"en":"Stress can reduce cognitive flexibility, making it harder to adapt to change.","zh":"压力会降低认知灵活性，使人更难适应变化。"}]},{"partOfSpeech":"adj.","definition":{"en":"In psychology and philosophy, focused on how knowledge is acquired and used (for example, cognitive science or cognitive therapy).","zh":"在心理学与哲学中，指关注知识如何获得与运用的（如认知科学、认知疗法）。"},"examples":[{"en":"She studies cognitive science, which combines psychology, linguistics, and computer science.","zh":"她研究认知科学，这门学科结合了心理学、语言学和计算机科学。"},{"en":"Cognitive behavioral therapy helps people notice and change unhelpful thought patterns.","zh":"认知行为疗法帮助人们觉察并改变不利的思维模式。"}]}],"synonyms":["mental","intellectual","thinking-related","of the mind"],"phonetic":"/ˈkɑɡnətɪv/","extraExplanation":["词根提示：cognitive 来自拉丁语 cognoscere（“认识、了解”），和 recognize（识别）、cognition（认知）同源。记忆法：co-（一起）+ gn-（知道）→ “知道、认识”。","常见搭配：cognitive skills（认知技能）、cognitive ability（认知能力）、cognitive load（认知负荷）、cognitive bias（认知偏差）、cognitive decline（认知衰退）。","语体与语境：这是较偏学术/正式的形容词；日常口语中更常用 thinking/mental（思考的/心理的）来表达类似意思。"]}
{"word":"cognitive-impairment-related","summary":{"en":"An adjective meaning “related to cognitive impairment.”","zh":"形容词：表示“与认知障碍有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to, caused by, or involving cognitive impairment (problems with thinking skills such as memory, attention, or reasoning).","zh":"与认知障碍有关的；由认知障碍引起的；涉及认知障碍的（如记忆、注意力或推理能力受损）。"},"examples":[{"en":"The clinic offers cognitive-impairment-related support for patients and families.","zh":"该诊所为患者及其家属提供与认知障碍相关的支持服务。"},{"en":"The report lists cognitive-impairment-related symptoms, including confusion and memory loss.","zh":"报告列出了与认知障碍相关的症状，包括困惑和记忆减退。"},{"en":"They designed a cognitive-impairment-related safety plan for medication management.","zh":"他们制定了一份与认知障碍相关的用药安全方案。"}]}],"synonyms":["cognition-related","cognitive-disorder-related","dementia-related (more specific)","related to cognitive impairment"],"phonetic":"/ˈkɑɡnətɪv ɪmˈpɛrmənt rɪˈleɪtɪd/","extraExplanation":["这个词通常出现在医疗、护理、心理健康、康复、保险或法律文本中，用来把某种“问题/风险/服务/费用/症状”等与“认知障碍”明确关联起来。","写作上常作定语放在名词前：cognitive-impairment-related care/risk/symptoms/services。也可改写得更自然：related to cognitive impairment / cognitive impairment–related（用短横线连接）/ dementia-related（更具体但含义不同）。","注意它是描述“关联性”的形容词，不等于“有认知障碍的（人）”。描述人时更常用：a person with cognitive impairment（有认知障碍的人）。"]}
{"word":"cognitive-linguistic","summary":{"en":"Connected to cognitive linguistics—studying how language relates to human thinking and experience.","zh":"与认知语言学相关——研究语言如何与人类思维和经验相联系。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to cognitive linguistics: the study of how language reflects human thought, perception, and experience.","zh":"与“认知语言学”相关的；指研究语言如何反映人类思维、感知与经验的学科或方法。"},"examples":[{"en":"This paper takes a cognitive-linguistic approach to metaphor.","zh":"这篇论文用认知语言学的视角来研究隐喻。"},{"en":"Cognitive-linguistic research often connects grammar with meaning and usage.","zh":"认知语言学研究常把语法与意义和实际使用联系起来。"}]}],"synonyms":["cognitive-linguistics-related","cognitivist (in linguistics)","usage-based (in linguistics)"],"phonetic":"/ˌkɑɡnətɪv lɪŋˈɡwɪstɪk/","extraExplanation":["“cognitive-linguistic”通常出现在学术语境，常用于修饰 approach（方法/视角）, analysis（分析）, framework（框架）, study（研究）等。","它强调语言并非独立的抽象规则系统，而是与人的概念、注意力、身体经验（embodiment）和情境使用密切相关。常见相关主题包括：概念隐喻（conceptual metaphor）、范畴化与原型（categorization & prototypes）、构式语法（construction grammar）等。","写作上可连字符（cognitive-linguistic）多用于放在名词前作定语（a cognitive-linguistic framework）；放在名词后作表语时有时也可不加连字符（The framework is cognitive linguistic），但加连字符也常见，取决于期刊风格。"]}
{"word":"cognitive-psychology","summary":{"en":"Cognitive psychology is a branch of psychology that studies mental processes like thinking, memory, attention, language, and problem-solving.","zh":"认知心理学是心理学的一个分支，研究思维、记忆、注意、语言与解决问题等心理过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the scientific study of how people think, learn, remember, pay attention, use language, and solve problems","zh":"认知心理学：研究人类如何思考、学习、记忆、注意、使用语言与解决问题的心理学分支"},"examples":[{"en":"Cognitive psychology explores how memory works and why we sometimes forget names.","zh":"认知心理学会研究记忆如何运作，以及我们为什么有时会忘记名字。"},{"en":"In cognitive psychology, attention is often studied using simple computer tasks.","zh":"在认知心理学中，注意力常用简单的电脑任务来研究。"}]}],"synonyms":["cognitive science (related field)","the psychology of cognition"],"phonetic":"/ˈkɑɡnətɪv saɪˈkɑlədʒi/","extraExplanation":["“Cognitive”来自拉丁语词根，和“to know（知道）”相关，因此cognitive psychology的核心是研究“心智如何处理信息”。","它与行为主义（behaviorism）常被对比：行为主义更关注可观察的行为；认知心理学更关注内部心理过程（如记忆、推理）。","常见相关主题包括：工作记忆（working memory）、注意（attention）、知觉（perception）、语言加工（language processing）、决策（decision-making）。"]}
{"word":"cognitively","summary":{"en":"“Cognitively” means “in a way related to thinking and mental processing.”","zh":"“cognitively”表示“在认知方面；与思维和心理信息处理有关地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to thinking processes such as understanding, remembering, learning, or paying attention.","zh":"在认知方面；与思考过程（如理解、记忆、学习、注意力）有关地。"},"examples":[{"en":"This puzzle is cognitively challenging for beginners.","zh":"这个谜题对初学者来说在认知上很有挑战。"},{"en":"The app is designed to support users cognitively by reducing distractions.","zh":"这个应用通过减少干扰在认知上支持用户。"}]},{"partOfSpeech":"adv.","definition":{"en":"In terms of mental ability or how the brain processes information (often used in education, psychology, and health contexts).","zh":"就心理能力或大脑处理信息的方式而言（常用于教育、心理学和健康语境）。"},"examples":[{"en":"Older adults may slow down cognitively, but they can still learn new skills.","zh":"老年人可能在认知上变慢，但仍然可以学习新技能。"},{"en":"Children develop cognitively at different rates.","zh":"孩子的认知发展速度各不相同。"}]}],"synonyms":["mentally","intellectually","in terms of thinking","in terms of mental processing"],"phonetic":"/ˈkɑːɡ.nə.tɪv.li/","extraExplanation":["“cognitively”来自“cognitive”（认知的），而“cognitive”源自拉丁语 *cognoscere*，意思是“认识、了解”。因此它常出现在学术或正式表达中，尤其是心理学（cognitive psychology）、教育（cognitive development）和医学（cognitive impairment）等领域。","常见搭配：cognitively demanding（认知负荷高的）、cognitively impaired（认知受损的）、cognitively engage/engaging（在认知上投入/引人思考的）、cognitively aware（有认知意识的）。日常口语里也可以用更简单的说法，如 “mentally” 或 “in your mind”，但它们不一定强调“信息处理/认知功能”这一层意思。"]}
{"word":"cognitives","summary":{"en":"“Cognitives” is the plural form of the less common noun “cognitive,” meaning cognitive factors/processes; most often you’ll see “cognitive” used as an adjective about thinking and learning.","zh":"“cognitives”是较少见的名词“cognitive”的复数，用于指认知因素/过程；更常见的是把“cognitive”作形容词，表示与思维和学习等有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to mental processes such as thinking, learning, remembering, understanding, and paying attention.","zh":"与思维等心理过程有关的，如思考、学习、记忆、理解和注意力。"},"examples":[{"en":"Cognitive skills include memory, attention, and problem-solving.","zh":"认知技能包括记忆力、注意力和解决问题的能力。"},{"en":"Lack of sleep can hurt your cognitive performance.","zh":"睡眠不足会影响你的认知表现。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) A cognitive process or factor; usually used in academic writing. Often appears in plural as “cognitives.”","zh":"（较少见）指一种认知过程或认知因素；多见于学术写作中，常用复数“cognitives”。"},"examples":[{"en":"The study compares social influences with cognitives such as beliefs and expectations.","zh":"这项研究将社会影响与信念、期望等认知因素进行比较。"},{"en":"Researchers measured several cognitives related to decision-making.","zh":"研究者测量了与决策相关的几项认知变量。"}]}],"synonyms":["mental","thinking-related","intellectual","psychological (context-dependent)","cognitive processes","cognitive factors"],"phonetic":"/ˈkɑɡnɪtɪv/","extraExplanation":["“cognitives”在日常英语里不常见。多数情况下，人们会说：cognitive processes（认知过程）、cognitive factors（认知因素）、cognitive skills（认知技能）。如果你在论文里看到“cognitives”，通常是在把“认知因素/变量”当作名词使用。","词根 cogn- 来自拉丁语，和 know（知道）有关；同源词包括 cognition（认知）、recognize（认出/识别）。"]}
{"word":"cognitivity","summary":{"en":"Cognitivity means the quality or ability related to cognition—thinking, learning, and understanding.","zh":"cognitivity 指与“认知”有关的性质或能力，如思考、学习与理解等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being cognitive; the capacity for mental processes such as thinking, knowing, learning, and understanding","zh":"认知性；认知状态；进行思考、认识、学习与理解等心理过程的能力"},"examples":[{"en":"Sleep loss can reduce cognitivity and make it harder to concentrate.","zh":"睡眠不足会降低认知能力，让人更难集中注意力。"},{"en":"The study measured changes in cognitivity after the training program.","zh":"这项研究测量了训练项目后认知能力的变化。"}]}],"synonyms":["cognition","cognitive ability","cognitive function","mental capacity"],"phonetic":"/ˌkɑɡnəˈtɪvɪti/","extraExplanation":["“cognitivity”在日常英语中比较少见，更常用的是“cognition（认知）”“cognitive ability/function（认知能力/功能）”。在学术写作（如心理学、神经科学、语言学）里偶尔会用它来强调“认知的属性/程度”。","词形来源：由“cognitive（认知的）”加名词后缀“-ity（……的性质/状态）”构成，含义接近“cognitiveness（认知性）”。"]}
{"word":"cognitivus","summary":{"en":"*Cognitivus* is a Latin term meaning “cognitive,” used mainly in scholarly contexts; in modern English, you usually say “cognitive.”","zh":"*cognitivus* 是拉丁语术语，意为“认知的”，多用于学术语境；现代英语通常直接用 “cognitive”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Latin; used in academic or philosophical contexts) “cognitive”; relating to knowing, understanding, or mental processes.","zh":"（拉丁语；多见于学术/哲学语境）“认知的”；与认识、理解或心理过程有关的。"},"examples":[{"en":"In some philosophy texts, *cognitivus* is used as a Latin adjective meaning “cognitive.”","zh":"在一些哲学文本中，*cognitivus* 用作拉丁语形容词，意思是“认知的”。"},{"en":"The author contrasts *cognitivus* (cognitive) with emotional or practical aspects of the mind.","zh":"作者把 *cognitivus*（认知的）与情感或实践层面的心智活动作对比。"}]}],"synonyms":["cognitive","knowing","perceptive"],"phonetic":"/kɑɡˈnɪtɪvəs/","extraExplanation":["*cognitivus* 不是常见英语单词，更像是拉丁语术语（有时以斜体出现在英语论文、哲学/神学著作中）。在现代英语里通常直接用 **cognitive**。","词源上它与拉丁语 **cognoscere**（认识、了解）相关，也与英语词根 **cogn-**（know/knowledge）同源，常见于 **cognition, recognize, cognizant** 等词。","如果你是在某篇文章里看到 *cognitivus*，通常不需要逐字翻译成“cognitivus”，直接按语境理解为“认知的/关于认识的”更自然。"]}
{"word":"cognitization","summary":{"en":"Cognitization means the process of becoming more cognitive (involving thinking/understanding), and in tech it often means adding AI-driven intelligence to services or workflows.","zh":"Cognitization 指“认知化”的过程；在科技语境中常指用 AI 等技术让服务或流程更智能。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of making something involve cognition (thinking, understanding, or mental processing), or of becoming more “cognitive.”","zh":"使某事物更涉及“认知”（思考、理解、心理加工）的过程；或变得更“认知化”的过程。"},"examples":[{"en":"Some researchers describe language learning as a gradual cognitization of patterns you first copy and later understand.","zh":"一些研究者把语言学习描述为：你先模仿模式，之后再理解，逐步发生的“认知化”过程。"},{"en":"The course focuses on the cognitization of study habits—learning to plan, monitor, and reflect.","zh":"这门课强调学习习惯的“认知化”——学会计划、监控并反思。"}]},{"partOfSpeech":"n.","definition":{"en":"(business/technology) the use of AI or “cognitive” technologies to make services and workflows more intelligent (e.g., automated understanding, decision support).","zh":"（商业/科技）用人工智能或“认知”技术让服务与流程更智能的做法（如自动理解、辅助决策）。"},"examples":[{"en":"The company’s strategy report highlighted the cognitization of customer support through chatbots and analytics.","zh":"公司的战略报告强调通过聊天机器人和数据分析实现客服的“认知化/智能化”。"},{"en":"Cognitization can reduce routine work, but teams still need humans to handle complex cases.","zh":"“认知化/智能化”可以减少重复性工作，但复杂情况仍需要人来处理。"}]}],"synonyms":["cognitive development","cognitive processing","intellectualization","computerization (tech context)","automation (tech context)"],"phonetic":"/ˌkɑɡnɪtaɪˈzeɪʃən/","extraExplanation":["“cognitization”不是日常高频词，更常见的表达是“cognitive development（认知发展）”“making something more cognitive（让……更具认知性）”，或在科技语境下直接说“AI enablement / AI-driven automation（AI赋能/AI自动化）”。","在企业咨询/外包/IT报告中，“cognitization”常作为行业术语或营销用语，意思接近“把流程做得更智能”。学术写作中若要更自然，可根据语境改用更具体的词组来表达。"]}
{"word":"Cognitum","summary":{"en":"Cognitum means “the thing known,” especially as the object/content of knowledge in philosophy.","zh":"Cognitum 指“被认识之物”，尤指哲学中作为知识对象/内容的东西。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Philosophy, Latin loanword) a thing known; the object or content of knowledge (what the mind knows).","zh":"（哲学、拉丁借词）“被认识之物”；知识的对象或内容（心智所认识到的东西）。"},"examples":[{"en":"In epistemology, the cognitum is distinguished from the act of knowing.","zh":"在认识论中，cognitum 常与“认识的行为”区分开来。"},{"en":"The theory focuses on the relation between the knower and the cognitum.","zh":"该理论关注“认识者”和“被认识之物（cognitum）”之间的关系。"}]}],"synonyms":["object of knowledge","known object","the known"],"phonetic":"/kɑɡˈniːtəm/","extraExplanation":["cognitum 源自拉丁语，直译为“已被知道的东西”，与 cognoscere（认识、了解）同源。它多出现在哲学、神学或学术写作中，日常英语很少用。","在一些经典表述里会看到类似对比：act of knowing（认识的行为） vs. cognitum（认识的对象/内容）。不同学派对它的界定可能略有差异，但核心都是“知识指向的对象”。"]}
{"word":"cognitum","summary":{"en":"A formal philosophical term meaning “the thing known,” i.e., the object/content of knowledge.","zh":"一个偏哲学、正式的词，指“被认识到的事物”，也就是知识的对象/内容。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Philosophy, formal) A thing that is known; the object/content of knowledge (what the mind knows).","zh":"（哲学/正式用语）被认识到的事物；知识的对象/内容（心智所知道的东西）。"},"examples":[{"en":"In epistemology, the mind is the knower and the cognitum is what is known.","zh":"在认识论中，心智是“认识者”，而 cognitum 是“被认识的对象”。"},{"en":"The researcher distinguished between the act of knowing and the cognitum itself.","zh":"研究者区分了“认识的活动”与 cognitum（被认识的内容）本身。"}]}],"synonyms":["the known","object of knowledge","what is known"],"phonetic":"/kɑɡˈnaɪtəm/","extraExplanation":["cognitum 源自拉丁语（与 cognoscere “认识、了解”同源），常见于认识论/心理哲学的讨论中，用来与“认识者/主体”（有时写作 cognoscens）相对照。","它在现代日常英语里非常少见，写作或阅读时更常遇到同义表达：the known / the object of knowledge / what is known。"]}
{"word":"cognizability","summary":{"en":"Cognizability means how easily something can be recognized or identified, especially in formal contexts.","zh":"Cognizability 指某事物“有多容易被识别/辨认”，常用于较正式语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being able to be recognized, identified, or known (often used in formal or academic writing).","zh":"可识别性；可辨认性；可认知性（常见于较正式或学术语境）。"},"examples":[{"en":"The logo’s cognizability is important for building brand trust.","zh":"标志的可识别性对建立品牌信任很重要。"},{"en":"In the fog, the street signs lost their cognizability.","zh":"在雾中，路牌变得难以辨认。"},{"en":"Researchers measured the cognizability of faces in different lighting conditions.","zh":"研究人员测量了不同光照条件下面孔的可识别性。"}]}],"synonyms":["recognizability","identifiability","visibility","discernibility"],"phonetic":"/ˌkɑɡ.nəˌzaɪ.əˈbɪ.lə.ti/","extraExplanation":["“cognizability”来自形容词“cognizable”（可识别的、可认知的）+ 名词后缀“-ity”（表示“性质/状态”）。在日常英语里，人们更常用“recognizability”（可辨识度）或“visibility/clarity”（可见度/清晰度）来表达相近意思。","常见搭配：cognizability of + 名词（如：cognizability of a brand/logo/face/symptom）。也常出现在法律/心理学/传播学等领域，用来强调“是否能被明确识别或在认知上被把握”。"]}
{"word":"cognizable","summary":{"en":"“Cognizable” means recognizable/understandable; in law, it means a claim a court can legally recognize and hear.","zh":"“cognizable”指“可辨认/可理解的”；在法律语境中指“法院可受理、可审理的（法律请求）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be recognized, identified, or understood (often from clear signs or features).","zh":"可辨认的；可识别的；可理解的（通常因有明显特征或迹象）。"},"examples":[{"en":"His voice was barely cognizable over the noisy crowd.","zh":"在嘈杂的人群中，他的声音几乎辨认不出来。"},{"en":"There was a cognizable improvement in her pronunciation after a month of practice.","zh":"练习一个月后，她的发音有明显的进步。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Law) Recognizable by a court as a valid legal claim; within a court’s authority to judge.","zh":"（法律）可受理的；法院可审理的（构成有效法律请求，属于法院管辖范围）。"},"examples":[{"en":"The judge ruled that the complaint stated a cognizable claim.","zh":"法官裁定该起诉状提出了可受理的请求。"},{"en":"Not every unfair act is a cognizable legal wrong.","zh":"并非每一种不公平行为都构成法院可认定的法律侵害。"}]}],"synonyms":["recognizable","identifiable","noticeable","discernible","perceptible","(law) justiciable"],"phonetic":"/ˈkɑɡ.nəˌzaɪ.zə.bəl/","extraExplanation":["词源上来自拉丁语“cognoscere”（认识、了解），和 cognition（认知）是同源词。日常英语里较正式，法律语境中非常常见（cognizable claim / offense）。","常见搭配：cognizable difference（明显差异）、cognizable improvement（可察觉的改善）、cognizable claim（可受理的请求）。近义词可用 recognizable / noticeable；反义词可用 imperceptible（难以察觉的）。"]}
{"word":"cognizableness","summary":{"en":"Cognizableness means the quality of being understandable/recognizable, and in law, being within a court’s power to hear a case.","zh":"cognizableness 指“可理解/可辨认的性质”，在法律语境中也可指“可受理性”（属于法院管辖可审理的范围）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being understandable or recognizable; the state of being something the mind can clearly notice or grasp","zh":"可被理解或辨认的性质；指某事物在认知上清晰可察、可把握的状态"},"examples":[{"en":"The cognizableness of the pattern made the data easy to interpret.","zh":"这个模式的可辨识性让数据更容易解读。"},{"en":"Good design increases the cognizableness of important buttons on a website.","zh":"良好的设计会提高网站上重要按钮的易识别性。"}]},{"partOfSpeech":"n.","definition":{"en":"(law) the quality of being cognizable; the state of being within a court’s authority to hear and decide","zh":"（法律）可受理性；指某事项属于法院有权受理并裁决的范围"},"examples":[{"en":"The lawyer argued that the dispute’s cognizableness depended on where the contract was signed.","zh":"律师主张该纠纷是否可受理取决于合同签署地。"},{"en":"They challenged the cognizableness of the claim in federal court.","zh":"他们在联邦法院对该主张的可受理性提出质疑。"}]}],"synonyms":["cognizability","recognizability","understandability","intelligibility","perceptibility"],"phonetic":"/ˌkɑɡnəˈzaɪzəbəlnəs/","extraExplanation":["“cognizableness”比较少见，更常用的名词是“cognizability”，形容词是“cognizable”（美式拼写；英式常写作“cognisable”）。在学术或法律写作中，通常用这些更常见的形式会更自然。"]}
{"word":"cognizably","summary":{"en":"“Cognizably” means “in a clearly recognizable way.”","zh":"“cognizably”表示“以明显、易于辨认的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is easy to recognize; noticeably.","zh":"以容易辨认的方式；明显地。"},"examples":[{"en":"Her accent is cognizably British.","zh":"她的口音明显是英式的。"},{"en":"The new version is cognizably the same game, just faster and smoother.","zh":"新版本明显还是同一款游戏，只是更快更流畅。"},{"en":"The melody is cognizably inspired by folk music.","zh":"这段旋律明显受民间音乐启发。"}]}],"synonyms":["recognizably","clearly","obviously","noticeably"],"phonetic":"/ˈkɑːɡ.nə.zə.bli/","extraExplanation":["“cognizably”来自形容词“cognizable”（可识别的）/动词“cognize”（认识、意识到，较少见），核心词根与“cognition”（认知）相同。","常见搭配：cognizably different（明显不同）、cognizably similar（明显相似）、cognizably X（明显具有X特征，如 cognizably human/modern）。","语域提示：较偏正式、书面语；日常口语中常用“clearly / obviously / recognizably”替代。"]}
{"word":"cognizance","summary":{"en":"Cognizance means awareness or knowledge; in formal/legal contexts it can mean official notice or recognition.","zh":"cognizance 指“知晓/意识到”；在正式或法律语境中也可指“正式知悉/受理/承认”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Awareness or knowledge of something; noticing and understanding it.","zh":"对某事的知晓、意识或了解；注意到并理解它。"},"examples":[{"en":"The manager had no cognizance of the problem until customers complained.","zh":"直到顾客投诉，经理才意识到这个问题。"},{"en":"Please keep me informed so I can have full cognizance of the schedule changes.","zh":"请随时告诉我，这样我才能充分了解日程变更。"}]},{"partOfSpeech":"n.","definition":{"en":"Official notice or recognition of something, especially in law or formal writing.","zh":"（尤用于法律或正式文体中）对某事的正式知悉或承认。"},"examples":[{"en":"The court took cognizance of the new evidence.","zh":"法院正式采纳并审视了新的证据。"},{"en":"The agency declined to take cognizance of the complaint.","zh":"该机构拒绝正式受理这项投诉。"}]}],"synonyms":["awareness","knowledge","notice","recognition","understanding"],"phonetic":"/ˈkɑɡ.nə.zəns/","extraExplanation":["“cognizance”常见于正式或法律语境，日常口语里更常用 awareness / knowledge / notice。","固定搭配：take cognizance of（正式注意到/受理/审视）；have cognizance of（知晓/了解）。","词源与“cognitive（认知的）”同源，来自拉丁语 cognoscere（认识、了解）。"]}
{"word":"cognizances","summary":{"en":"“Cognizances” is the plural of “cognizance,” meaning awareness/knowledge, or (less commonly) identifying badges/symbols in historical contexts.","zh":"“cognizances”是“cognizance”的复数，常指“知晓/意识到”，较少见的意思是历史语境中的“识别徽记/标志”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"awareness or knowledge of something; notice or understanding","zh":"对某事的意识或知晓；注意到；理解"},"examples":[{"en":"I had no cognizance of the rule changes until today.","zh":"直到今天我才知道规则有改动。"},{"en":"The report brought the problem to public cognizance.","zh":"这份报告让公众意识到了这个问题。"}]},{"partOfSpeech":"n.","definition":{"en":"(formal) a symbol or badge that identifies a person, family, or group (used especially in historical or heraldic contexts)","zh":"（正式）用于识别个人、家族或团体的标志/徽记（尤用于历史或纹章语境）"},"examples":[{"en":"The knight wore his lord’s cognizance on his sleeve.","zh":"那位骑士在袖子上佩戴着领主的徽记。"}]}],"synonyms":["awareness","knowledge","recognition","notice","consciousness"],"phonetic":"/ˈkɑɡnəˌzəns/","extraExplanation":["“cognizances”是“cognizance”的复数形式。日常英语里更常见的是单数或用法如“take cognizance of”（注意到/考虑到）。","词源与拉丁语“cognoscere”（了解、认识）有关，因此它常带有“经过了解而意识到”的正式语气，多见于法律、学术和正式写作中。"]}
{"word":"cognizant","summary":{"en":"“Cognizant” means aware of and understanding something, often used in formal contexts.","zh":"“cognizant”表示“意识到并理解”，多用于较正式的语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Being aware of something; knowing about it and understanding it.","zh":"意识到某事；知道并理解某事。"},"examples":[{"en":"Be cognizant of the rules before you start the exam.","zh":"考试开始前要清楚考试规则。"},{"en":"The company is cognizant of the risks but decided to move forward.","zh":"公司意识到风险，但仍决定继续推进。"},{"en":"She remained cognizant of how her words might affect others.","zh":"她始终注意自己的话可能会如何影响他人。"}]}],"synonyms":["aware (of)","mindful (of)","conscious (of)","informed","alert"],"phonetic":"/ˈkɑɡnəzənt/","extraExplanation":["“cognizant”较偏正式，常用于书面语、新闻或职场语境。日常口语里更常说“aware of”“mindful of”“conscious of”。","常见搭配：be cognizant of + 名词/动名词（例如：be cognizant of cultural differences）。","词源上与“cognition（认知）”“recognize（识别/认出）”同源，都和“知道、认识”有关。"]}
{"word":"cognize","summary":{"en":"Cognize is a rare, formal verb meaning “to know/recognize/become aware of.”","zh":"cognize 是一个少见、偏正式的动词，意思是“知道/认出/意识到”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to know, recognize, or become aware of something (a rare, formal word)","zh":"知道；认出；意识到（较少见、偏正式用词）"},"examples":[{"en":"After a moment, she cognized the voice on the phone as her old teacher’s.","zh":"过了一会儿，她认出电话里的声音是她以前老师的。"},{"en":"He slowly cognized that the meeting time had been changed.","zh":"他慢慢意识到会议时间已经改了。"}]}],"synonyms":["recognize","realize","perceive","become aware of"],"phonetic":"/ˈkɑːɡnaɪz/","extraExplanation":["“cognize”在现代英语中非常少见，更多时候人们会用更常见的词，如 “recognize / realize / perceive”。","词源来自拉丁语词根 *cogn-*（“知道、认识”），同家族词包括：**cognition**（认知）、**cognitive**（认知的）、**cognizant**（意识到的）、**incognito**（匿名的）。","在学术或心理学语境里更常见的是说 “cognition” 或 “cognitive processes”，而不是动词 “cognize”。"]}
{"word":"cognized","summary":{"en":"“Cognized” is a rare form meaning “recognized/understood.”","zh":"“cognized”很少用，大致意思是“认出/意识到/理解”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of “cognize”: to become aware of, recognize, or understand something (rare; more common: “recognized”).","zh":"“cognize”的过去式/过去分词：意识到、认出或理解某事（很少用；更常见说法是“recognized”）。"},"examples":[{"en":"He finally cognized the danger and stepped back.","zh":"他终于意识到危险，往后退了一步。"},{"en":"The patient seemed unable to cognize familiar faces.","zh":"这位病人似乎无法认出熟悉的面孔。"}]},{"partOfSpeech":"adj.","definition":{"en":"(literary/technical) mentally perceived or acknowledged; understood.","zh":"（文学/技术性用法）在心里被感知到或被承认的；被理解的。"},"examples":[{"en":"Once cognized, the pattern was easy to explain.","zh":"一旦理解了这个规律，就很容易解释了。"}]}],"synonyms":["recognized","realized","understood","perceived","acknowledged"],"phonetic":"/ˈkɑɡnaɪzd/","extraExplanation":["“cognized”在现代英语里非常少见，常见于较旧的写作或哲学/心理学语境。日常表达一般用“recognized”（认出/意识到）或“realized”（意识到/明白）。","词根来自拉丁语“cognoscere”（认识、了解），与“cognition（认知）”“cognitive（认知的）”同源。"]}
{"word":"cognizee","summary":{"en":"An archaic legal term for the person who receives the benefit/rights acknowledged in an old property conveyance called a “fine.”","zh":"古语法律用词：在旧式不动产转让程序（fine）中接受权利/利益的一方。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Law, archaic) A person in whose favor a fine (an old form of legal conveyance) is acknowledged—similar to a grantee or beneficiary in that transaction.","zh":"（法律，古语）在“fine”（一种旧式的不动产转让/诉讼和解形式）中受益的一方，即对方承认转让权利的人；大致相当于受让人/受益人。"},"examples":[{"en":"In old English property law, the cognizee received the rights acknowledged in the fine.","zh":"在早期英国不动产法中，cognizee 是在 fine 中获得被承认权利的一方。"},{"en":"The deed names a cognizor and a cognizee, showing who gives and who receives the interest.","zh":"该文书写明 cognizor 与 cognizee，用来标示谁转让、谁受让该权益。"}]}],"synonyms":["grantee","beneficiary","recipient"],"phonetic":"/ˌkɑɡ.nəˈziː/","extraExplanation":["这是一个非常少见、偏“古英国法律史”的词，多出现在研究性文本里。它常与 cognizor（转让/承认的一方）成对出现。这里的 fine 不是“罚款”，而是中古/近代早期英格兰一种通过法院程序来确认并转移土地权利的做法。现代英语中一般会用 grantee、beneficiary、recipient 等更常见的词来表达。"]}
{"word":"cognizer","summary":{"en":"“Cognizer” means a person or system that recognizes or becomes aware of something, mainly in academic/technical contexts.","zh":"“cognizer”指能识别或意识到某事的人或系统，多见于学术/技术语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or system that recognizes, perceives, or becomes aware of something (especially in psychology, philosophy, or AI).","zh":"能识别、感知或意识到某事的人或系统（尤用于心理学、哲学或人工智能语境）。"},"examples":[{"en":"In this model, the cognizer uses past experience to interpret new information.","zh":"在这个模型中，认知者会用过去的经验来解读新的信息。"},{"en":"A speech-recognition program can act as a cognizer of spoken commands.","zh":"语音识别程序可以充当对口头指令的识别者。"}]}],"synonyms":["recognizer","perceiver","observer","knower"],"phonetic":"/ˈkɑɡˌnaɪzɚ/","extraExplanation":["“cognizer”在日常英语里比较少见，更多出现在学术写作（如cognitive science/哲学）或技术语境中。一般口语更常用“person who recognizes/realizes…”、“observer”、“recognizer”等表达。","词根来自拉丁语 cognoscere（to know/recognize，意为“认识、辨认”），与“cognition（认知）”“recognize（识别）”是同源词。"]}
{"word":"cognizers","summary":{"en":"“Cognizers” means people or systems that recognize, perceive, or know something, mainly in academic contexts.","zh":"“cognizers”指能够识别、感知或获得知识的主体（人或系统），主要用于学术语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people or systems that cognize—i.e., recognize, perceive, or come to know something (often used in philosophy or cognitive science).","zh":"能够“认知/认识”的人或系统；也就是能识别、感知或获得知识的主体（常见于哲学或认知科学语境）。"},"examples":[{"en":"In this theory, humans and some animals are cognizers of their environment.","zh":"在这个理论中，人类和一些动物都是其环境的认知者。"},{"en":"The study compares human cognizers with AI systems on visual tasks.","zh":"这项研究比较了人类认知者与人工智能系统在视觉任务上的表现。"}]}],"synonyms":["knowers","perceivers","agents","thinkers","observers"],"phonetic":"/ˈkɑɡnaɪzər/","extraExplanation":["“cognizer(s)”在日常英语里很少用，更常见的说法是“knower（认识者）”“thinker（思考者）”“agent（主体/智能体）”或直接说“person/organism/system”。它多出现在学术写作中，用来强调“谁在认知”这一点。","词源上来自拉丁语 cognoscere（认识、了解）。相关动词“cognize”也偏学术，日常更常用“recognize / know / perceive”。"]}
{"word":"cognizes","summary":{"en":"“Cognizes” means “recognizes or becomes aware of; understands,” but it’s rare and formal in modern English.","zh":"“cognizes”意为“认出/认识到；觉察到；理解”，但在现代英语中较少见且偏正式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(rare, formal) to recognize, perceive, or become aware of something; to know by mental awareness.","zh":"（罕见、正式）认识到；觉察到；以心智理解/认知某事。"},"examples":[{"en":"She finally cognizes the risk of sharing personal information online.","zh":"她终于意识到在网上分享个人信息的风险。"},{"en":"The child cognizes his mother’s voice in the crowd.","zh":"孩子在人群中辨认出母亲的声音。"}]},{"partOfSpeech":"vt.","definition":{"en":"to take something in as knowledge; to understand or comprehend (often used with “that” clauses).","zh":"把某事作为知识理解；领会；明白（常接 that 从句）。"},"examples":[{"en":"He cognizes that the deadline cannot be moved.","zh":"他明白截止日期无法更改。"}]}],"synonyms":["recognizes","realizes","perceives","understands","apprehends"],"phonetic":"/ˈkɑɡ.naɪz/","extraExplanation":["“cognizes”是动词“cognize”的第三人称单数（he/she/it cognizes）。这个词在现代英语里很少用，日常更常说：recognize（认出/承认）、realize（意识到）、perceive（察觉）、understand（理解）。","词源与“cognition（认知）”“cognitive（认知的）”同源，来自拉丁语 *cognoscere*（意为“知道、认识”）。在心理学/哲学语境中偶尔会见到，但一般写作也更偏好用更常见的同义词。"]}
{"word":"cognizing","summary":{"en":"“Cognizing” means recognizing or coming to know something (formal), and it can also mean the process of understanding.","zh":"“Cognizing”指“认识到/开始知道某事”（较正式），也可指“理解的过程”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “cognize”) recognizing or coming to know something; becoming aware of something through thought or perception (often formal or philosophical).","zh":"（“cognize”的现在分词）认识到、知晓某事；通过思考或感知而产生意识（常见于较正式或哲学语境）。"},"examples":[{"en":"She paused, cognizing the risk before agreeing to the plan.","zh":"她停顿了一下，意识到风险后才同意这个计划。"},{"en":"In the essay, the author describes cognizing the self through memory.","zh":"在文章中，作者描述了通过记忆来认识自我。"}]},{"partOfSpeech":"n.","definition":{"en":"(gerund use) the act or process of knowing, recognizing, or mentally grasping something (formal).","zh":"（作动名词）认识、知晓或在头脑中把握某事的行为或过程（较正式）。"},"examples":[{"en":"Cognizing meaning from context is a key reading skill.","zh":"从语境中理解意义是一项关键的阅读技能。"},{"en":"The study focuses on cognizing patterns rather than memorizing rules.","zh":"该研究关注对模式的理解，而不是死记规则。"}]}],"synonyms":["recognizing","realizing","perceiving","becoming aware of","grasping"],"phonetic":"ˈkɑɡnaɪzɪŋ","extraExplanation":["“cognize / cognizing”在日常英语里不常用，更常见的替代表达有：recognize（认出/意识到）、realize（意识到）、know（知道）、perceive（察觉）。在哲学、心理学或学术写作中更容易看到。","词源上与拉丁语 cognoscere（了解、认识）有关，也和 cognition（认知）是同一词族。"]}
{"word":"cognizor","summary":{"en":"A rare legal term for someone who formally acknowledges a legal obligation (often a recognizance).","zh":"一个罕见的法律用语，指正式确认并承担法律义务的人（常见于担保出庭的保证书）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Law, rare) A person who formally acknowledges a legal obligation (especially a recognizance), promising to do something—such as appear in court—or to forfeit money if they do not.","zh":"（法律，罕用）在法律上正式“承认/确认”一项义务的人（尤指担保出庭的保证书 recognizance 的承诺人）；若不履行（如不到庭），可能需要没收保证金/承担罚金。"},"examples":[{"en":"In the recognizance, the cognizor promised to appear in court on the scheduled date.","zh":"在保证书中，承诺人（cognizor）保证在指定日期出庭。"},{"en":"If the cognizor fails to appear, the court may order the bond to be forfeited.","zh":"如果承诺人未出庭，法院可能会下令没收保证金。"}]}],"synonyms":["cognisor","principal (in a bond)","obligor","surety (related term)"],"phonetic":"/ˈkɑɡ.nəˌzɔr/","extraExplanation":["“cognizor”是非常偏法律文书的词，日常英语几乎不用；更常见的是用“defendant / principal / surety（保证人）/ person who entered into a recognizance”等表达。","你也可能会看到拼写变体“cognisor”（同义）。词根来自“cognize（认识、确认）”，在法律语境中更接近“正式确认/承认一项义务”。"]}
{"word":"cognomen","summary":{"en":"A cognomen is an extra identifying name—especially a Roman family-name part or a formal term for a nickname/surname.","zh":"cognomen 指用于识别的附加名字，尤其指古罗马姓名中的家族第三名，也可作较正式的“别称/绰号/姓氏”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An additional name that identifies a person more specifically; often a nickname, surname, or (in ancient Rome) a third name showing a branch of a family.","zh":"用于更具体识别某人的附加名字；常指绰号、姓氏，或（古罗马）第三个名字，用来表示家族分支。"},"examples":[{"en":"In ancient Rome, “Cicero” was a cognomen, added to distinguish one branch of a family.","zh":"在古罗马，“Cicero”是一个cognomen（家族第三名），用来区分同一家族的不同分支。"},{"en":"People sometimes earn a cognomen based on their personality or achievements.","zh":"人们有时会因为性格或成就而获得一个别称（cognomen）。"}]}],"synonyms":["nickname","epithet","sobriquet","byname"],"phonetic":"/ˈkɑɡnəˌmɛn/","extraExplanation":["词源来自拉丁语：co-（一起）+ nomen（名字）。在古罗马常见的命名结构是 praenomen（名）+ nomen（氏族名）+ cognomen（家族分支/别号）。例如 Gaius Julius Caesar：Julius 是氏族名（nomen），Caesar 常被分析为 cognomen。","在现代英语里，cognomen 多用于较正式或学术语境，强调“附加的识别名/别称”，语气比 nickname 更书面。相关近义词根据语境可选：nickname（更口语）、epithet（带评价色彩的称呼，如“the Great”）、sobriquet（法语来源，常指雅称/绰号）。"]}
{"word":"cognomens","summary":{"en":"Cognomen (plural: cognomens) means a surname or distinguishing nickname, especially the third name in ancient Roman naming, and more generally an epithet or title.","zh":"cognomen（复数 cognomens）指“姓/别名”，尤指古罗马姓名中的第三个名字；也可泛指较正式的称号、绰号。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surname or family nickname, especially the third name in an ancient Roman person’s full name (after the given name and clan name).","zh":"（尤指古罗马人姓名中的）“别名/家族支系名”，常作为第三个名字，用来区分家族分支或个人特点。"},"examples":[{"en":"In Roman history, “Scipio” was the cognomen in Publius Cornelius Scipio.","zh":"在罗马史中，Publius Cornelius Scipio 里的“Scipio”就是 cognomen（别名/支系名）。"},{"en":"His cognomen identified which branch of the Cornelius clan he belonged to.","zh":"他的 cognomen 用来表明他属于 Cornelius 氏族的哪一支。"}]},{"partOfSpeech":"n.","definition":{"en":"Any distinctive name, title, or epithet used to describe a person (often formal or literary).","zh":"（较正式/文学用法）任何用于描述某人的称号、绰号或称谓。"},"examples":[{"en":"She earned the cognomen “the Iron Lady” for her tough leadership style.","zh":"她因强硬的领导风格获得了“铁娘子”这一称号（cognomen）。"},{"en":"Writers sometimes give heroes cognomens that highlight their character.","zh":"作家有时会给英雄人物起一些突出性格的称号（cognomens）。"}]}],"synonyms":["epithet","nickname","sobriquet","surname","byname","moniker"],"phonetic":"/kɑɡˈnoʊmən/","extraExplanation":["“cognomen”来自拉丁语，和“name（名字）”有关。古罗马人的典型命名常见为三段：praenomen（个人名）+ nomen（氏族名）+ cognomen（支系名/别名）。有时还会加上 agnomen（额外称号，如因战功获得）。","你输入的“cognomens”是复数形式；单数是“cognomen”。在现代英语里这个词偏学术/历史语境，也可用来更正式地说“绰号/称号”。"]}
{"word":"cognomina","summary":{"en":"Cognomina means “additional identifying names,” especially the plural of Roman cognomen (branch names or nicknames).","zh":"cognomina 指“附加的识别性名字”，尤指古罗马 cognomen（家族支系名或绰号）的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of cognomen: additional names used to identify a person more specifically, especially in ancient Rome (e.g., a family branch name or a descriptive nickname).","zh":"cognomen 的复数：用于更具体识别某人的附加名字，尤指古罗马的姓名体系中（如家族支系名或描述性绰号）。"},"examples":[{"en":"In Roman history, many senators are recorded with multiple cognomina.","zh":"在罗马史中，许多元老院成员的记录里会出现多个 cognomina（附加名）。"},{"en":"Scholars compare cognomina to modern nicknames, but they could also mark a family line.","zh":"学者常把 cognomina 类比为现代的昵称，但它们也可能用来标记某个家族支系。"}]}],"synonyms":["additional names","by-names","sobriquets","nicknames"],"phonetic":"/ˌkɑɡˈnoʊmɪnə/","extraExplanation":["在古罗马常见的“三名制”里，典型结构是 praenomen（个人名）+ nomen（氏族名）+ cognomen（附加名）。后来有些人还会再加 agnomen（荣誉称号或进一步的别号）。","cognomen 往往来自外貌特征、性格、事迹或出身背景（例如与“卷发”“勇敢”等特征相关），久而久之也可能固定为家族分支的名称。","英语里更常见的是单数 cognomen；cognomina 多见于历史、古典学、铭文学等学术语境。"]}
{"word":"cognominal","summary":{"en":"Cognominal means “having the same name” or “related to a cognomen (an additional name, especially in Roman contexts).”","zh":"cognominal 指“同名的”，也可指“与别名/姓氏（尤指古罗马的 cognomen）相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the same name; sharing a name or title.","zh":"同名的；同称的（与他人或他物名字/称号相同）。"},"examples":[{"en":"Two cognominal villages in different states often cause confusion in mail delivery.","zh":"两个位于不同州的同名村庄常常会让邮件投递产生混淆。"},{"en":"The author avoids cognominal characters so readers won’t mix them up.","zh":"作者避免让角色同名，以免读者把他们搞混。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to a cognomen (an additional name, nickname, or family name), especially in Roman naming traditions.","zh":"与“别名/姓氏（cognomen）”有关的（尤指古罗马的命名传统）。"},"examples":[{"en":"In Roman history, a cognominal label could reflect a person’s family branch or a notable trait.","zh":"在罗马史中，一个与别名有关的称呼可能体现家族分支或某个显著特征。"},{"en":"Some inscriptions include cognominal information that helps identify individuals across generations.","zh":"一些铭文包含与别名相关的信息，能帮助辨认跨世代的个人身份。"}]}],"synonyms":["same-named","homonymous","namesake-related","eponymous (related sense)"],"phonetic":"/kɑɡˈnɑmɪnəl/","extraExplanation":["“cognominal”较少见，多用于学术写作（语言学、历史、古典学）中。日常英语里更常用：same-named、having the same name、namesake（名义上“同名的人/物”）。","词源与拉丁语有关：co-（共同）+ nomen（名字）。与“cognomen”（别名/家族支系名）同源。古罗马人常用多段姓名结构（如 praenomen + nomen + cognomen），其中 cognomen 有时像“家族支系名/绰号”。"]}
{"word":"cognominally","summary":{"en":"Cognominally means “by or in terms of a surname (cognomen).”","zh":"cognominally 意为“按姓氏而言；与姓氏（cognomen）有关地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to a surname (cognomen); by or according to a surname.","zh":"以与姓氏（别号/家族名，cognomen）有关的方式；按姓氏而言。"},"examples":[{"en":"He is cognominally known as “Johnson,” though his first name is David.","zh":"他按姓氏来说被称为“Johnson”，尽管他的名字是 David。"},{"en":"The two families are distinguished cognominally rather than by their first names.","zh":"这两个家族主要按姓氏来区分，而不是按名字。"}]}],"synonyms":["by surname","by last name","as a surname"],"phonetic":"/kɑɡˈnɑmənəli/","extraExplanation":["“cognominally”来自“cognomen”（源于拉丁语），在古罗马姓名体系中指除名（praenomen）与氏族名（nomen）之外的“别号/家族支系名”，后来可泛指“姓氏”或“外号”。因此这个副词多见于历史、古典学、语言学或较正式的写作中，日常英语更常说 by surname / by last name。"]}
{"word":"cognominate","summary":{"en":"A formal/rare verb meaning “to give a surname or nickname to; to call by an additional name.”","zh":"一个较正式且少见的动词，意为“给某人取姓氏或绰号；用附加名字称呼某人”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to give someone a surname or nickname; to call someone by an additional name","zh":"给某人取姓氏或绰号；用附加的名字称呼某人"},"examples":[{"en":"The Romans often cognominated their generals after major victories.","zh":"罗马人常在将领取得重大胜利后给他们加上称号（绰号）。"},{"en":"In the village, people cognominated him “Red” because of his hair.","zh":"在村里，人们因为他的头发给他起绰号叫“红毛”。"}]}],"synonyms":["surname","nickname","dub","name","style"],"phonetic":"/kɑɡˈnɑməˌneɪt/","extraExplanation":["该词较少见，语气偏正式/古典，常见于讨论罗马姓名体系或历史文本中。","词源来自拉丁语 cognōmināre（加上“cognomen”即“别名/附加称号”）。在古罗马，一个人可能有 praenomen（名）+ nomen（氏族名）+ cognomen（别名/支系名或功绩称号）。"]}
{"word":"cognominated","summary":{"en":"“Cognominated” is a rare form meaning “co-nominated”—nominated together with someone else.","zh":"“cognominated”很少见，通常指“co-nominated”：与他人一起被提名/共同提名。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Uncommon) Nominated together with another person or group for the same position, prize, or election; jointly nominated.","zh":"（不常见）与他人或团体一起被提名（同一职位/奖项/选举）；共同被提名。"},"examples":[{"en":"The two actors were co-nominated for Best Ensemble.","zh":"这两位演员被共同提名“最佳群体表演奖”。"},{"en":"In the election, she was co-nominated by two parties.","zh":"在这次选举中，她由两个政党共同提名。"}]},{"partOfSpeech":"v.","definition":{"en":"Past form of “co-nominate”: to nominate someone together with others, or to have two groups nominate the same candidate.","zh":"“co-nominate”的过去式：与他人一起提名某人，或由两个团体共同提名同一候选人。"},"examples":[{"en":"They co-nominated him and agreed to share campaign duties.","zh":"他们共同提名了他，并同意分担竞选工作。"},{"en":"Several organizations co-nominated the project for an award.","zh":"多个组织共同提名该项目参评一个奖项。"}]}],"synonyms":["co-nominated","jointly nominated","nominated together"],"phonetic":"/ˌkoʊˈnɑməˌneɪtɪd/","extraExplanation":["“cognominated”在真实语料中非常少见，更常见的写法是带连字符的“co-nominated”。前缀co-表示“共同、一起”（如 co-author 共同作者、cofounder 联合创始人）。","如果你本来想表达“认知/同源”的意思，可能是把“cognate（同源词/同族的）”或“cognition（认知）”与 nominate 搞混了。","在正式写作里，若担心读者不熟悉 co-nominate，可改用更常见表达：“jointly nominated / nominated together”。"]}
{"word":"cognomination","summary":{"en":"Cognomination means joint naming or a name/title shared by more than one person or thing.","zh":"cognomination 指“共同命名”或“多人/多物共用的名字、称号”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of giving the same name to two or more people or things; joint naming","zh":"（给两者或多者）取同一个名字的行为；共同命名"},"examples":[{"en":"In the record, the cognomination of the two villages caused confusion for tax officials.","zh":"在这份记录中，两座村庄的同名（共同命名）让税务官员产生了混淆。"},{"en":"The historian notes a cognomination that linked several branches of the family under one surname.","zh":"历史学家提到一种共同命名方式，把这个家族的几个分支用同一个姓联系在一起。"}]},{"partOfSpeech":"n.","definition":{"en":"a shared name, title, or epithet used by more than one person or thing","zh":"（多人或多物）共用的名字、称号或绰号"},"examples":[{"en":"“The Great” became a cognomination used for more than one ruler in different periods.","zh":"“大帝”成了不同时期多位统治者共用的称号（同名称）。"},{"en":"Because of the cognomination, readers sometimes mistake one character for another.","zh":"因为共用同一个称号，读者有时会把一个角色误认成另一个。"}]}],"synonyms":["shared name","same name","common name","epithet","sobriquet"],"phonetic":"/ˌkɑɡnɑməˈneɪʃən/","extraExplanation":["这个词非常少见，多见于历史、族谱或古典研究语境。构词上来自拉丁语：co-（共同）+ nomin-（名字）+ -ation（名词后缀）。现代英语里更常用的表达是 shared name / same name / epithet / surname 等。","注意不要和 cognition（认知）混淆：cognomination 里的 nomin- 词根指“名字”，和 nominate（提名、任命）同源。"]}
{"word":"cognosce","summary":{"en":"“Cognosce” is a Latin imperative meaning “Know!” or “Learn!”, often used as a motto encouraging knowledge or self-understanding.","zh":"“Cognosce”是拉丁语祈使式，意为“去了解/去学习！”，常作格言或校训，鼓励求知或自我认识。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin) “Know!” or “Learn!”—an imperative form meaning a command or encouragement to come to know something.","zh":"（拉丁语）“去认识/去了解！”或“去学习！”——祈使语气，用来命令或鼓励别人去获得知识或理解。"},"examples":[{"en":"The motto “Cognosce” can be understood as “Know yourself” or “Seek knowledge.”","zh":"格言“Cognosce”常可理解为“认识你自己”或“追求知识”。"},{"en":"In some schools, Latin words like “Cognosce” are used to express a love of learning.","zh":"在一些学校里，会用像“Cognosce”这样的拉丁词来表达对学习的热爱。"}]}],"synonyms":["know","learn","understand","seek knowledge"],"phonetic":"/kɑɡˈnoʊs.keɪ/","extraExplanation":["“cognosce”来自拉丁动词 cognoscere（意为“认识、了解、发现、学习”）。在古典拉丁语里它是第二人称单数祈使式，语气类似英语里的“Know!”“Learn!”。","现代英语中它并不是常用词，更多出现在校训、格言、徽章、纹章文字或带有古典风格的写作中。与英语词根 *cogni-*（如 cognition“认知”、cognizant“知晓的”）同源。"]}
{"word":"cognoscent","summary":{"en":"Cognoscent means “knowledgeable/with refined taste,” or a knowledgeable person; it’s often seen in the collective phrase “the cognoscenti.”","zh":"cognoscent 表示“内行的/有鉴赏力的”，也可指“内行人士”；更常见于集合说法 the cognoscenti。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"knowledgeable and well-informed, especially about art, music, food, fashion, or other “taste” subjects","zh":"（尤指在艺术、音乐、美食、时尚等品味领域）有鉴赏力的、很内行的"},"examples":[{"en":"The review was written for a cognoscent audience, not for beginners.","zh":"这篇评论是写给内行读者看的，不是给初学者的。"},{"en":"She’s cognoscent in contemporary jazz and can explain what makes a solo great.","zh":"她对当代爵士很内行，能解释一段即兴为何精彩。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who is highly knowledgeable; an expert (often used collectively as “the cognoscenti”)","zh":"内行人士；行家（常用集合意义：the cognoscenti 指“懂行的一群人”）"},"examples":[{"en":"The gallery opening attracted the cognoscent, along with curious tourists.","zh":"画廊开幕式吸引了不少内行人士，也有好奇的游客。"},{"en":"The new restaurant quickly became a favorite of the cognoscenti.","zh":"这家新餐厅很快成了美食圈内行人的心头好。"}]}],"synonyms":["knowledgeable","informed","expert","connoisseur","sophisticated"],"phonetic":"/ˈkɑːɡnəˌsɛnt/","extraExplanation":["这个词在现代英语里较少单独用作“cognoscent”，更常见的是复数形式 cognoscenti（指一群懂行的人），或单数 cognoscente（指某一位内行/鉴赏家）。来源与意大利语有关，常带一点“品味圈子里的人”的语感，语体偏正式或评论写作。"]}
{"word":"cognoscente","summary":{"en":"A cognoscente is an expert or connoisseur with refined taste, especially in the arts or culture.","zh":"cognoscente 指在艺术或文化等领域很懂行、很会鉴赏的行家/鉴赏家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who has deep knowledge and refined taste in a particular subject (especially art, music, food, or wine).","zh":"（尤指艺术、音乐、美食或葡萄酒等领域的）行家；鉴赏家；内行。"},"examples":[{"en":"She’s a cognoscente of modern art and can explain why certain paintings matter.","zh":"她是现代艺术的鉴赏家，能解释为什么某些画作很重要。"},{"en":"The restaurant is popular with cognoscenti who care about seasonal ingredients.","zh":"这家餐厅很受讲究时令食材的内行人欢迎。"}]}],"synonyms":["connoisseur","expert","aficionado","authority"],"phonetic":"/ˌkɑn.jəˈʃɛn.ti/","extraExplanation":["词源来自意大利语 *conoscente*，意为“懂行的人、熟知的人”，与英语 *know*（知道）在意义上相近。","常见语域偏正式/书面语，带有“品味高、懂门道”的语气；复数常用 *cognoscenti* 指“一群懂行的人”。","用法提示：可以说 *a cognoscente of jazz*（爵士乐行家），也常见 *the cognoscenti*（行家圈子/懂行的人们）。"]}
{"word":"cognoscenti","summary":{"en":"Cognoscenti means the people who are “in the know”—experts with refined taste, especially in the arts.","zh":"cognoscenti 指“懂行的一群人/鉴赏家圈子”，尤用于艺术等领域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who have expert knowledge and refined taste in a particular subject, especially the arts (often used as a group).","zh":"（尤指艺术等领域的）行家、鉴赏家；懂行的人（常指一群人）"},"examples":[{"en":"The museum’s new exhibit impressed both casual visitors and the cognoscenti.","zh":"博物馆的新展览既打动了普通观众，也让行家们印象深刻。"},{"en":"She’s part of the literary cognoscenti in New York.","zh":"她是纽约文学圈里懂行的那群人之一。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having expert knowledge and refined judgment about something (less common; often sounds formal).","zh":"（较少用，偏正式）有鉴赏力的；精通的"},"examples":[{"en":"His cognoscenti comments on film history changed how I watched the movie.","zh":"他对电影史那种很懂行的评论改变了我看这部电影的方式。"},{"en":"They offered a cognoscenti perspective on contemporary art.","zh":"他们从行家角度解读当代艺术。"}]}],"synonyms":["connoisseurs","experts","aficionados","insiders","specialists"],"phonetic":"/ˌkɑn.jəˈʃɛn.ti/","extraExplanation":["这个词来自意大利语 cognoscente（“懂的人/识货的人”），英语里常用复数 cognoscenti 来指“那一圈懂行的人”。","语气与使用场景：多见于艺术、音乐、文学、美食等“品味/鉴赏”相关话题，带一点“圈内人”的感觉。口语中更常用 experts、connoisseurs、insiders。","用法提示：cognoscenti 通常当作复数名词使用（the cognoscenti are...），不太常写 *a cognoscenti*；如果想表达“一个懂行的人”，更自然的是 a connoisseur 或 an expert。"]}
{"word":"cognoscere","summary":{"en":"*Cognoscere* is a Latin verb meaning “to come to know,” “to learn/find out,” or “to recognize.”","zh":"*cognoscere* 是拉丁语动词，意为“逐渐了解/认识”“学习或弄清”“识别、认出”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Latin) to come to know; to learn or find out; to recognize.","zh":"（拉丁语）了解/认识；学习或弄清；认出、识别。"},"examples":[{"en":"In Latin, *cognoscere* means “to come to know.”","zh":"在拉丁语里，*cognoscere* 的意思是“逐渐认识/了解”。"},{"en":"The phrase *te cognosco* can be translated as “I recognize you” or “I get to know you,” depending on context.","zh":"短语 *te cognosco* 可译为“我认出你了”或“我在了解你”，取决于语境。"}]}],"synonyms":["(Latin) scire","(Latin) noscere","(Latin) agnoscere"],"phonetic":"/ˌkɑɡnəˈskɛreɪ/","extraExplanation":["*cognoscere* 由 **co-/con-**（“一起、完全”）+ **gnoscere**（“知道、认识”）构成，和英语 **cognition**（认知）、**cognitive**（认知的）、**recognize**（识别）属于同源词。","在拉丁语里它常有“从不知道到知道”的“获得知识/了解”的过程感，不只是静态的“知道”。","常见词形提示：完成时 **cognōvī**（我已经知道/了解了），过去分词 **cognitus**（已被认识的、已知的）。在学术英语中偶尔会看到源自这些词形的派生词或引用。"]}
{"word":"cognoscibility","summary":{"en":"Cognoscibility means “knowability”—the quality of being able to be known or understood, especially in philosophical writing.","zh":"cognoscibility 指“可知性/可认识性”，即某事物能够被认识或理解的性质，尤常见于哲学写作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being able to be known, understood, or recognized (often in philosophy: knowable in principle)","zh":"“可被认识/可被理解/可被辨认”的性质（常用于哲学语境：原则上可被认识）"},"examples":[{"en":"In epistemology, people debate the cognoscibility of truths we can’t directly observe.","zh":"在认识论中，人们会讨论那些无法直接观察到的真理是否具有“可被认识性”。"},{"en":"The theory assumes the cognoscibility of the natural world through careful study.","zh":"该理论假定自然世界可以通过细致研究而被认识。"}]}],"synonyms":["knowability","intelligibility","understandability"],"phonetic":"/kɑɡˌnɑsəˈbɪləti/","extraExplanation":["词根提示：cognoscibility 来自形容词 cognoscible（“可认识的”），其词源与拉丁语 cognoscere（“去了解、认识”）有关，也与常见词 cognition（“认知”）同源。","使用场景：这个词较学术，常见于哲学、认识论（epistemology）、科学方法论等讨论；日常英语里更常用 knowability 或 “can be known”。"]}
{"word":"cognoscible","summary":{"en":"Cognoscible means “knowable or understandable,” often used in formal or philosophical writing.","zh":"cognoscible 意为“可知的、可理解的”，常见于较正式或哲学/学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be known, understood, or recognized; knowable.","zh":"可被认识的；可理解的；可知的。"},"examples":[{"en":"Some aspects of the universe may be cognoscible through careful observation and math.","zh":"宇宙的某些方面可以通过细致观察和数学推理而变得可知。"},{"en":"Her motives were not fully cognoscible to the public.","zh":"她的动机对公众来说并不完全可理解。"}]}],"synonyms":["knowable","understandable","comprehensible","recognizable","intelligible"],"phonetic":"/kɑɡˈnɑsəbəl/","extraExplanation":["“cognoscible”较正式、偏学术/哲学语境，常用于讨论“知识的边界”（什么能被人类认识、理解或证明）。日常口语里更常用 knowable / understandable / recognizable。","词源上来自拉丁语 cognoscere（认识、得知），同根词包括 cognizant（知晓的）与 cognition（认知）。","在文学或思想写作中，它有时带一点“人类理性能否把握真相”的味道，例如讨论“the cognoscible world（可认识的世界）”与“the unknowable（不可知之物）”的对比。"]}
{"word":"cognoscing","summary":{"en":"“Cognoscing” is a rare, formal word meaning “knowing/perceiving” or “the process of knowing,” mostly seen in philosophy or academic writing.","zh":"“cognoscing”是罕见且正式的词，表示“认识/感知”或“认识的过程”，多用于哲学或学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, formal) Knowing or perceiving; engaged in the act of coming to know something (used mainly in philosophy or academic writing).","zh":"（罕见，正式）“认识的 / 认知的；正在认识、知觉某事”的意思（多见于哲学或学术语境）。"},"examples":[{"en":"In some philosophical texts, the mind is described as a cognoscing subject.","zh":"在一些哲学文本中，心灵被描述为“认知的主体”。"},{"en":"The study compares cognoscing (knowing) with acting (doing).","zh":"这项研究比较“认知（认识）”与“行动（做事）”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) The act or process of knowing; cognition (often used as a gerund/participle form).","zh":"（罕见）认识的行为或过程；认知（常作为动名词/分词形式使用）。"},"examples":[{"en":"Their theory focuses on cognoscing rather than memory.","zh":"他们的理论关注“认识的过程”而非记忆。"},{"en":"Cognoscing can be influenced by culture and language.","zh":"认知过程会受到文化与语言的影响。"}]}],"synonyms":["knowing","perceiving","cognition","awareness"],"phonetic":"/kɑɡˈnɑsɪŋ/","extraExplanation":["“cognoscing”在现代日常英语中几乎不用，更多是学术写作里的“拉丁化”用法。它与拉丁语 cognoscere（认识、了解）有关。更常见、更自然的表达通常是：knowing（知道/认识）、cognition（认知）、perceiving（感知）。","如果你想表达“内行的人/鉴赏家”，很可能你要找的是 cognoscenti（鉴赏家们）或 cognoscente（鉴赏家，单数）。"]}
{"word":"cognoscitive","summary":{"en":"Cognoscitive means “related to knowing or mental understanding,” and it is a less common synonym of “cognitive.”","zh":"cognoscitive 指“与认识/理解等心理过程有关的”，是较少见的“cognitive（认知的）”同义词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to knowing, perception, or the mental process of understanding (similar in meaning to “cognitive,” but less common).","zh":"与认识、知觉或理解的心理过程有关的（意义接近“cognitive”，但更少见）。"},"examples":[{"en":"The study examined cognoscitive processes such as attention and memory.","zh":"这项研究考察了注意力和记忆等认识过程。"},{"en":"In philosophy, some writers discuss the cognoscitive powers of the mind.","zh":"在哲学中，一些作者会讨论心灵的认识能力。"}]}],"synonyms":["cognitive","intellectual","mental","perceptive"],"phonetic":"/kɑɡˈnɑsɪtɪv/","extraExplanation":["“cognoscitive”在现代英语中比较少用，更常见、自然的说法是“cognitive”。如果你在学术写作里想表达“与认知有关的”，通常优先选用“cognitive”。","词源上与拉丁语 cognoscere（意为“认识、了解”）有关，因此它常出现在哲学、心理学或较正式的文体中。"]}
{"word":"cognoscitively","summary":{"en":"“Cognoscitively” means “in terms of knowing or mental understanding,” but it is uncommon; “cognitively” is more common.","zh":"“cognoscitively”表示“在认知/认识层面上”，但较少用；更常见的是“cognitively”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to knowing, perceiving, or mental understanding (cognition).","zh":"以与认知、认识、感知或心理理解有关的方式；在认知层面上。"},"examples":[{"en":"Children may develop cognoscitively at different speeds, even if they are the same age.","zh":"即使同龄，孩子在认知发展上的速度也可能不同。"},{"en":"The course is designed to challenge students cognoscitively, not just emotionally.","zh":"这门课程旨在在认知层面挑战学生，而不仅仅是情感层面。"},{"en":"He understood the rule cognoscitively, but he still needed practice to apply it naturally.","zh":"他在认知上理解了这个规则，但仍需要练习才能自然运用。"}]}],"synonyms":["cognitively","mentally","intellectually"],"phonetic":"ˌkɑɡnəˈsɪtɪvli","extraExplanation":["“cognoscitively”来自形容词“cognoscitive”（与认识/认知有关的），词根可追溯到拉丁语 *cognoscere*（意为“认识、得知”）。在现代英语中，这个副词很少见；更常用的表达是 “cognitively”（在认知上）。在哲学、心理学或教育学写作中偶尔会出现，用来强调“与认识活动/知识获得有关”的角度。"]}
{"word":"cognovit","summary":{"en":"A Latin-based legal term for an advance confession of judgment, letting a creditor get a court judgment without a full trial.","zh":"拉丁语法律用语，指债务人预先“承认并同意判决”，使债权人可在无需完整审判的情况下取得判决。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a legal document or clause (from Latin) in which a debtor admits owing a debt and agrees in advance that the creditor may obtain a judgment without a full court trial (often called a “cognovit note” or “cognovit judgment”).","zh":"（拉丁语法律用语）一种法律文件或条款，债务人承认欠款，并预先同意债权人无需完整审判程序即可取得法院判决（常见于“cognovit note/本票”或“cognovit judgment/判决”）。"},"examples":[{"en":"The contract included a cognovit clause, allowing the lender to get a judgment quickly if the borrower defaulted.","zh":"合同里包含了cognovit条款，若借款人违约，出借方可迅速取得判决。"},{"en":"Some states restrict or prohibit cognovit notes because they waive important due-process rights.","zh":"一些州限制或禁止cognovit本票，因为它会放弃重要的正当程序权利。"}]}],"synonyms":["confession of judgment","cognovit clause","cognovit note"],"phonetic":"ˈkɑɡnoʊvɪt","extraExplanation":["“cognovit”源自拉丁语，意为“（他）已承认/已知悉”。在英美法律语境中，它与“confession of judgment（认诺判决/承认判决）”相关：债务人事先放弃部分程序性权利（如提前通知、在法庭上充分抗辩），使债权人更容易、更快取得判决。","在日常英语中几乎不用；主要出现在法律文件、合同条款或判例讨论中。阅读合同时若看到“cognovit clause/note”，通常需要特别留意其风险与当地法律是否允许。"]}
{"word":"cognovits","summary":{"en":"A legal document/term meaning a debtor admits liability and lets the court enter judgment without a trial.","zh":"法律术语：债务人承认责任，并同意法院可无需审理直接作出判决。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Law) A written confession of judgment: an agreement where a person admits they owe money and allows a court to enter judgment against them without a trial if they default.","zh":"（法律）认诺判决书／承认判决：一种书面协议，债务人承认欠款，并同意一旦违约，法院可无需审理直接作出对其不利的判决。"},"examples":[{"en":"The loan contract included a cognovit, allowing the lender to get a judgment quickly if payments stopped.","zh":"这份贷款合同包含认诺判决条款，使放贷方在停止还款时可以迅速取得法院判决。"},{"en":"Some states restrict or ban cognovit clauses because they can take away a borrower’s chance to defend themselves in court.","zh":"一些州限制或禁止认诺判决条款，因为它可能剥夺借款人在法庭上辩护的机会。"}]}],"synonyms":["confession of judgment","judgment by confession","cognovit note"],"phonetic":"/ˈkɑɡnəˌvɪt/","extraExplanation":["“cognovits”通常是拼写误写；标准拼写是 **cognovit**（单数）/ **cognovits**（复数）。在法律文件中你也可能看到 **cognovit note**（带认诺条款的本票）或 **confession of judgment**（承认判决/认诺判决）等说法。","这个词来自拉丁语 *cognovit*，意思是“他/她已承认（欠债或责任）”。在美国，是否有效、如何使用，取决于州法；在一些地区被认为对消费者不公平，因此受到严格限制。"]}
{"word":"cogon","summary":{"en":"Cogon is a tall grass (cogon grass) that can spread aggressively and may be treated as an invasive weed.","zh":"cogon 指一种高大的白茅/茅草（cogon grass），蔓延性强，有时被视为入侵性杂草。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tall, tough grass (Imperata cylindrica), often called cogon grass, common in tropical and subtropical areas and sometimes considered an invasive weed","zh":"（一种）高大而坚韧的草——白茅/茅草（学名 Imperata cylindrica），常称“cogon grass”，分布于热带和亚热带地区，有时被视为入侵性杂草"},"examples":[{"en":"Cogon can quickly take over open fields if it isn’t controlled.","zh":"如果不加以控制，cogon 会很快占领开阔的田地。"},{"en":"The hillside was covered with cogon grass after the fire.","zh":"火灾过后，山坡上长满了白茅（cogon grass）。"},{"en":"Farmers cut cogon to reduce weeds around young trees.","zh":"农民会割除白茅（cogon），以减少幼树周围的杂草。"}]}],"synonyms":["cogon grass","Imperata cylindrica","blady grass"],"phonetic":"ˈkoʊɡən","extraExplanation":["“cogon”常见于东南亚与太平洋地区的英语语境中，最常用搭配是“cogon grass”。在生态与农业文章里，它常被提到是生长迅速、根茎发达、较难清除的杂草。","在美国（尤其南部）与部分地区的环境管理语境中，cogon grass 常被列为入侵物种之一，因此在新闻或科普中会出现“control/eradicate cogon (grass)”等表达。"]}
{"word":"cogonal","summary":{"en":"“Cogonal” is not a standard English word; it’s usually a misspelling of “cognate” or a confusion with “conjugal.”","zh":"“cogonal”不是标准英语词；通常是“cognate”的拼写错误，或与“conjugal”混淆。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard or very rare word in modern English. It is most often a misspelling of “cognate” (related by origin) or sometimes confused with “conjugal” (related to marriage).","zh":"现代英语中不规范或极少见的词。多半是把“cognate”（同源的）拼错，或与“conjugal”（婚姻的）混淆。"},"examples":[{"en":"I can’t find “cogonal” in most dictionaries; did you mean “cognate”?","zh":"大多数词典里查不到“cogonal”；你是不是想写“cognate”？"},{"en":"Spanish “nación” and English “nation” are cognate words.","zh":"西语“nación”和英语“nation”是同源词。"},{"en":"“Conjugal” refers to marriage, as in “conjugal rights.”","zh":"“Conjugal”指婚姻相关，例如“conjugal rights（配偶权利/婚内权利）”。"}]}],"synonyms":["cognate","related","conjugal (if you meant marriage-related)"],"phonetic":"/kɑˈɡoʊnəl/","extraExplanation":["“cognate”常用于语言学：两种语言里词形/词义相近，且来自同一词源（比如拉丁语/希腊语）。","如果你告诉我你的上下文句子，我可以判断你更可能想表达“同源的（cognate）”还是“婚姻的（conjugal）”，并给你更贴切的替换词和例句。"]}
{"word":"cogongrass","summary":{"en":"Cogongrass is a fast-spreading invasive grass (Imperata cylindrica).","zh":"Cogongrass 指扩散很快、常被视为入侵杂草的白茅（Imperata cylindrica）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tall, tough grass (Imperata cylindrica) that often spreads quickly and is considered an invasive weed in many warm regions.","zh":"一种高大、坚韧的草本植物（白茅/茅草；学名 Imperata cylindrica），扩散很快，在许多温暖地区被视为入侵性杂草。"},"examples":[{"en":"Cogongrass can quickly take over roadsides and fields if it isn’t controlled.","zh":"如果不加以控制，cogongrass 会很快占据路边和田地。"},{"en":"The park removed cogongrass to protect native plants.","zh":"公园清除了 cogongrass，以保护本地植物。"}]}],"synonyms":["Imperata cylindrica","kunai grass"],"phonetic":"/ˈkoʊɡɑːnˌɡræs/","extraExplanation":["“Cogongrass”常见于环保、农业与土地管理语境，尤其在美国东南部等地被列为重点防治的入侵植物之一。","它通常通过地下根茎（rhizomes）和种子扩散，形成密集草丛，容易排挤本地植物，有时也会增加火灾风险。","中文里常把它译作“白茅/茅草”，但不同地区对“茅草”的指代可能不完全一致；正式场合可配合学名 Imperata cylindrica 来避免歧义。"]}
{"word":"cogons","summary":{"en":"“Cogons” means several “cogon” grasses—tough tropical grasses often used for thatch, or areas covered with them.","zh":"“Cogons”是“cogon”的复数，指多株热带硬草（常用于茅草屋顶），也可指长满这种草的草地。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “cogon”: a tall, coarse tropical grass (often used for thatching roofs); also used to mean the grassland areas covered by this grass.","zh":"“cogon”的复数：一种高大、粗硬的热带草（常用来盖茅草屋顶）；也可指长满这种草的草地/荒草地。"},"examples":[{"en":"In some rural areas, houses were roofed with dried cogons.","zh":"在一些乡村地区，房子的屋顶用晒干的茅草（cogons）来铺。"},{"en":"After the fire, the hillside quickly filled with cogons again.","zh":"火灾过后，山坡很快又长满了茅草（cogons）。"}]}],"synonyms":["cogongrass","thatch grass","Imperata cylindrica"],"phonetic":"ˈkoʊɡɑnz","extraExplanation":["“cogon”一词在菲律宾英语和东南亚语境中较常见，常指白茅一类的草，可用于茅草屋顶材料。","在生态/农业语境里，相关植物常被称为“cogongrass”（学名 Imperata cylindrica），在一些地区被视为入侵性很强的杂草；日常英语里更常见的说法通常是 “cogongrass” 或直接说 “grassland”。","拼写提醒：你输入的“cogons”通常是复数；单数是 “cogon”。"]}
{"word":"cogovernment","summary":{"en":"Cogovernment means shared governance: two or more parties jointly hold power and make governing decisions together.","zh":"Cogovernment 指“共同治理/共治”：两个或多个团体共同掌权并共同做出治理决策。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a system or arrangement in which two or more groups share governing power and make decisions together (shared governance).","zh":"一种由两个或多个团体共同掌握治理权、共同决策的制度或安排（共同治理/共治）。"},"examples":[{"en":"After the conflict, the country tried a co-government between the two main parties.","zh":"冲突结束后，这个国家尝试由两大政党组成的共同政府（共治）。"},{"en":"The university uses co-government, so students and faculty both have a voice in policy decisions.","zh":"这所大学实行共同治理，因此学生和教师都能参与政策决策。"},{"en":"They proposed co-government with local communities to manage the national park.","zh":"他们提议与当地社区共同治理，以管理这座国家公园。"}]}],"synonyms":["shared governance","power-sharing","coalition government","joint governance"],"phonetic":"/koʊˈɡʌvərnmənt/","extraExplanation":["“cogovernment”并不是最常见的标准拼写；更常见的写法是 **co-government**（带连字符）或直接用更常用的词 **coalition government**（联合政府）/ **power-sharing**（权力分享）/ **shared governance**（共同治理）。具体用哪个取决于语境：国家政治常用 coalition government 或 power-sharing；学校、机构管理更常用 shared governance。","含义上它强调“共同决策、共同承担治理责任”，不一定表示正式的“联合内阁”，也可能指政府与社区/原住民组织的共同管理（例如自然资源或公共服务）。"]}
{"word":"cogovernor","summary":{"en":"A co-governor is someone who governs jointly with another person, sharing authority and responsibility.","zh":"co-governor 指与他人共同执政、共同承担权力与责任的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who shares the job and authority of governing with one or more others (for example, two leaders jointly running a region or organization).","zh":"共同执政者；与他人共享治理职责与权力的人（例如两位领导共同管理一个地区或机构）。"},"examples":[{"en":"The country appointed two co-governors to lead the transitional government.","zh":"该国任命了两位共同执政者来领导过渡政府。"},{"en":"As co-governor of the province, she had to coordinate every major decision with her counterpart.","zh":"作为该省的共同执政者，她必须与另一位共同执政者协调每一项重大决策。"}]}],"synonyms":["joint governor","co-ruler","co-leader","co-head","shared-governance leader"],"phonetic":"/ˌkoʊˈɡʌvɚnɚ/","extraExplanation":["“co-”表示“共同、一起”。因此 co-governor 通常强调“权力与责任共享”，而不仅仅是“副手”。","该词多见于政治/行政语境（如共同统治、联合管理、临时政府安排），有时也会借用于机构或项目的“共同负责人”语境，但正式程度偏高。","拼写上常见 co-governor（带连字符）与 cogovernor（不带连字符）；写作时可参考所在机构/媒体的风格指南。"]}
{"word":"cogracious","summary":{"en":"“Cogracious” isn’t a standard English word; you probably meant “gracious” or “ingracious.”","zh":"“cogracious”不是标准英语词；你可能想写“gracious（有礼、亲切）”或“ingracious（无礼、不领情）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or mistaken form of “gracious” (kind and polite) or “ingracious” (rude; not appreciative).","zh":"不是标准英语单词。更可能是把“gracious（亲切有礼）”或“ingracious（无礼的；不知感激的）”拼错或记错了。"},"examples":[{"en":"I couldn’t find “cogracious” in a dictionary—did you mean “gracious”?","zh":"我在词典里找不到“cogracious”——你是不是想说“gracious”？"},{"en":"She gave a gracious smile to the guests.","zh":"她向客人们报以亲切有礼的微笑。"},{"en":"His ingracious reply made the situation worse.","zh":"他那不客气的回复让情况更糟。"}]}],"synonyms":["gracious","polite","kind","courteous","ingracious","rude","impolite"],"phonetic":"/koʊˈɡreɪʃəs/","extraExplanation":["“gracious”常用来形容人的礼貌、友善（a gracious host 体贴周到的主人），也可形容行为/话语得体（a gracious apology 得体的道歉）。在较传统或宗教语境里也会见到“Gracious!”作为轻微的感叹（类似“天哪/哎呀”，语气较温和）。","如果你是在某个句子/文章里看到“cogracious”，可能是排版错误或人名、品牌名、网名等专有名词；把原句发我，我可以帮你判断最合适的意思。"]}
{"word":"cograil","summary":{"en":"A cograil is a rack-rail system that lets trains climb very steep slopes using gears.","zh":"cograil 指齿轨（齿条）铁路系统，让列车用齿轮啮合方式攀爬很陡的坡。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a railway system (or the toothed rail used in it) where a train climbs steep slopes by using a gear that meshes with a rack rail between the tracks; also called a rack railway.","zh":"齿轨铁路；（或其使用的）齿条轨道：列车通过车底齿轮与轨道中间的齿条啮合来爬陡坡的铁路系统。"},"examples":[{"en":"The mountain line uses a cograil to climb sections that are too steep for normal trains.","zh":"这条山地线路使用齿轨铁路来爬普通列车无法应对的陡坡路段。"},{"en":"On the steepest part of the route, the train switches onto the cograil for extra traction.","zh":"在路线最陡的部分，列车会切换到齿轨路段以获得更强的牵引力。"}]}],"synonyms":["rack railway","cog railway","rack-and-pinion railway"],"phonetic":"/ˈkɑːɡreɪl/","extraExplanation":["“cograil”常写作“cog rail”或“cograil”，也常用更通用的说法“rack railway（齿轨铁路）”。","这类铁路多见于山区观光线路，例如瑞士、奥地利等地；核心原理是“齿轮（cog）+齿条（rack）啮合”，提高爬坡与制动的安全性。"]}
{"word":"cogrediency","summary":{"en":"Cogrediency means “moving/working together in the same direction,” mainly in technical contexts.","zh":"cogrediency 指“同向地一起运动或一起起作用”的状态，多用于技术/学术语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being cogredient; moving or acting together in the same direction or manner (often used in technical or scientific writing).","zh":"同向性；同趋性；指在同一方向或方式上一起运动或一起起作用的状态（多见于科技或学术语境）。"},"examples":[{"en":"The report discusses the cogrediency of the two currents as they flow along the coast.","zh":"报告讨论了两股洋流沿海岸流动时的同向性。"},{"en":"In this model, cogrediency between variables suggests they change in step over time.","zh":"在这个模型中，变量之间的同趋性表示它们会随时间同步变化。"}]},{"partOfSpeech":"n.","definition":{"en":"(geometry, less common) the relationship of figures that correspond in position or are transformable together without changing their relative structure.","zh":"（几何，较少见）同位对应关系；指图形在位置上相互对应，或可在保持相对结构不变的情况下共同变换的关系。"},"examples":[{"en":"The textbook mentions cogrediency when describing how one figure can be mapped onto another.","zh":"教材在讲解如何把一个图形映射到另一个图形时提到了这种同位对应关系。"}]}],"synonyms":["co-movement","alignment","moving in tandem","concurrence"],"phonetic":"/koʊˈɡriːdiənsi/","extraExplanation":["“cogrediency”源自形容词“cogredient”（同向的、一起移动的），在现代日常英语中非常少见，更多出现在旧式学术写作、物理/工程描述或某些数学（尤其是几何变换）语境中。","如果你想表达更常见、更自然的意思，通常可以用：“move together / in the same direction”（一起移动/同方向）、“in tandem”（同步地）、“aligned”（一致的）等。"]}
{"word":"cogredient","summary":{"en":"Cogredient means “in the same direction,” especially in mathematical or geometric contexts.","zh":"cogredient 表示“同方向的”，多用于数学或几何等语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"moving or directed in the same way; sharing the same direction (often used in math or geometry).","zh":"同方向的；朝同一方向运动或指向的（常见于数学或几何语境）。"},"examples":[{"en":"In the diagram, the two arrows are cogredient because they point in the same direction.","zh":"在图中，这两个箭头是同方向的，因为它们指向同一方向。"},{"en":"Two forces can be cogredient if they act along the same line in the same direction.","zh":"如果两个力沿同一直线并朝同一方向作用，它们可以被称为同方向的。"}]},{"partOfSpeech":"n.","definition":{"en":"a thing (such as a line, vector, or ray) that has the same direction as another.","zh":"（如直线、向量或射线等）与另一对象同方向的事物。"},"examples":[{"en":"Pick a cogredient to this vector to show the same direction.","zh":"选一个与这个向量同方向的向量来表示相同方向。"}]}],"synonyms":["co-directional","in the same direction","parallel (in some contexts)"],"phonetic":"/koʊˈɡriːdiənt/","extraExplanation":["这个词非常少见，多出现在较老的数学/几何或物理英文资料中；日常英语里更常用 parallel（平行的）、in the same direction（同一方向）或 co-directional（同向的）。","词源上可理解为 co-（共同）+ gredient（行进的/朝向的，来自拉丁语与“走/步”相关的词根）。"]}
{"word":"cogroad","summary":{"en":"A cog road is a toothed (rack) railway section used for climbing very steep slopes.","zh":"cog road 指带齿条的齿轨铁路路段，用于在非常陡的坡面上安全爬升。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a steep railway track or road for a cog (rack) railway, built with a toothed rail so a train can climb hills safely","zh":"（齿轨铁路的）齿轨路段／齿轨线路；带齿条的轨道，用来让列车在陡坡上安全爬升"},"examples":[{"en":"We rode the train up the mountain on a cog road.","zh":"我们坐齿轨铁路的列车沿着齿轨线路上山。"},{"en":"Because the slope is so steep, the railway uses a cog road instead of normal tracks.","zh":"因为坡度太陡，这条铁路用齿轨路段而不是普通铁轨。"}]}],"synonyms":["rack railway","cog railway","rack railroad","cog railroad"],"phonetic":"ˈkɑɡ ˌroʊd","extraExplanation":["“cogroad”更常见的写法是分开的“cog road”，也常被称为“rack railway / rack railroad（齿轨铁路）”。这种设计会在两条钢轨之间加一条“齿条（rack）”，车轮上的齿轮（cog）咬合齿条来上坡，避免打滑。","在美国语境里，最有名的例子之一是新罕布什尔州的 Mount Washington Cog Railway（华盛顿山齿轨铁路）。","如果你是在某个地图、地名或品牌上看到“Cog Road / Cogroad”，也可能是专有名词（道路名或项目名），具体含义需结合当地背景。"]}
{"word":"COGS","summary":{"en":"COGS is an accounting abbreviation meaning “cost of goods sold,” the direct cost of products sold during a period.","zh":"COGS 是会计缩写，指“销售成本”，即某期间售出商品的直接成本。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Cost of goods sold: the direct costs of making or buying the products a company sells in a period (often materials, direct labor, and production costs). It is used to calculate gross profit.","zh":"销售成本（COGS）：公司在某一期间为生产或购入并售出的商品所发生的直接成本（常包括原材料、直接人工与制造费用等），用于计算毛利。"},"examples":[{"en":"Our COGS went up because raw material prices increased.","zh":"由于原材料价格上涨，我们的 COGS（销售成本）上升了。"},{"en":"Gross profit equals revenue minus COGS.","zh":"毛利等于收入减去 COGS（销售成本）。"},{"en":"The report breaks out COGS by product line.","zh":"报告按产品线拆分了 COGS（销售成本）。"}]}],"synonyms":["cost of goods sold","cost of sales","direct costs"],"phonetic":"/kɑɡz/","extraExplanation":["在财务报表里，COGS 通常出现在损益表（Income Statement）中，位置在“Revenue/Net Sales（收入/净销售额）”下方，用来计算“Gross Profit（毛利）”。","常见计算思路（制造业/零售业会略有不同）：期初存货 + 本期购入/生产成本 − 期末存货 = COGS。","在口语或邮件中也常写作“cost of sales”，尤其在服务型或某些国际会计口径中更常见。"]}
{"word":"cogs","summary":{"en":"“Cogs” usually means gears/teeth in a machine, and it can also mean people as small parts of a larger system.","zh":"“cogs”常指机器中的齿轮/齿；也可比喻大系统中可替代的小人物/小角色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Teeth or wheels in a machine (gears) that fit together and make parts move.","zh":"（机器中的）齿；齿轮（彼此咬合以带动运转的部件）。"},"examples":[{"en":"The clock stopped because one of the cogs was worn down.","zh":"这个钟停了，因为其中一个齿轮的齿磨损了。"},{"en":"Oil the cogs so the machine runs smoothly.","zh":"给齿轮上油，让机器运转更顺畅。"}]},{"partOfSpeech":"n.","definition":{"en":"People seen as small, replaceable parts of a large system (often in the phrase “a cog in the machine”).","zh":"（比喻）大系统中可替代的小人物/小角色（常见于短语“a cog in the machine”）。"},"examples":[{"en":"He felt like one of many cogs in the company, easily replaced.","zh":"他觉得自己在公司里只是众多“齿轮”之一，很容易被替代。"},{"en":"Even small cogs matter when the whole team is working toward a goal.","zh":"当整个团队为目标努力时，再小的“齿轮”也很重要。"}]}],"synonyms":["gears","gear wheels","toothed wheels","parts","workers (figurative)"],"phonetic":"/kɑɡz/","extraExplanation":["“cog(s)”既可以指“齿/齿轮”，也常用作隐喻：把组织或社会系统比作机器，人就像其中的“齿轮”。常见表达：a cog in the machine（体制/机构中的小螺丝钉；小角色）。","单数是 cog；复数是 cogs。作为动词较少见：to cog（给轮子装齿；使咬合）。"]}
{"word":"Cogswell","summary":{"en":"Cogswell is most commonly a surname, and it can also be used as a place or institution name.","zh":"Cogswell 最常见是姓氏，也可用作地名或机构名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"姓氏（家族姓）。"},"examples":[{"en":"Ms. Cogswell will lead the meeting today.","zh":"Cogswell 女士今天将主持会议。"},{"en":"I saw the name Cogswell on the list of donors.","zh":"我在捐赠者名单上看到了 Cogswell 这个名字。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name used for some locations (for example, towns, schools, or buildings) in English-speaking areas.","zh":"地名（在英语国家里用于一些地点，如城镇、学校或建筑名称）。"},"examples":[{"en":"He grew up near Cogswell and moved away after college.","zh":"他在 Cogswell 附近长大，大学毕业后搬走了。"},{"en":"The event will be held at the Cogswell Center.","zh":"活动将在 Cogswell 中心举行。"}]}],"phonetic":"/ˈkɑɡzwɛl/","extraExplanation":["“Cogswell”通常是英语中的专有名词（人名/地名）。作为姓氏时，多与英格兰的地名来源有关：常见解释是由人名（如 Cog/Cogg 一类的古老昵称）+“well”（泉、井）组合而来，含义类似“某人的泉水/井边”。","因为是专名，书写时通常首字母大写：Cogswell。读音在不同家庭/地区可能略有差异，但在美式英语里常见重音在第一音节。"]}
{"word":"Cogswellia","summary":{"en":"Cogswellia is an older botanical genus name, now largely replaced by Lomatium for certain desert-parsley plants.","zh":"Cogswellia 是一个较旧的植物属名，如今多被 Lomatium 取代，用于某些荒漠欧芹类植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany) A former genus name for certain desert-parsley plants in the carrot family (Apiaceae); in most modern classification these species are placed in the genus Lomatium.","zh":"（植物）旧时用于某些“荒漠欧芹/沙漠欧芹”（伞形科）的属名；在多数现代分类中，这些植物多归入 Lomatium（洛马蒂乌姆属）。"},"examples":[{"en":"In older floras, some desert-parsley species were listed under Cogswellia rather than Lomatium.","zh":"在较早的植物志里，一些荒漠欧芹物种会被列为 Cogswellia，而不是 Lomatium。"},{"en":"The label ‘Cogswellia’ on a herbarium sheet often indicates an outdated name.","zh":"标本馆标签上写着“Cogswellia”常常意味着这是一个已过时的名称。"}]}],"synonyms":["Lomatium (modern genus name)"],"phonetic":"/kɑɡˈzwɛliə/","extraExplanation":["这是一个“历史分类名”（旧属名）。在植物分类学中，随着研究方法（形态比较、后来加入分子证据等）更新，某些属会被合并或拆分，因此你可能只在老版本的植物志、标本标签或旧论文里看到 Cogswellia。","如果你是在北美荒野植物百科或野外识别手册中遇到它，通常可以把它理解为今天更常用的属名 Lomatium 的旧称。"]}
{"word":"cogswellia","summary":{"en":"Cogswellia is an older botanical name for certain Ferula (giant fennel) plants, sometimes linked to the resin galbanum.","zh":"Cogswellia 是舊的植物屬名，指某些現多歸入阿魏屬（Ferula）的巨型茴香類植物，常與樹脂加爾巴納姆（galbanum）相關。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former scientific (botanical) genus name for certain giant fennel plants (now usually classified in the genus Ferula), some of which produce the aromatic resin galbanum","zh":"（植物學）一個舊的植物屬名，曾用來指某些「巨型茴香／阿魏」類植物（現多歸入阿魏屬 Ferula）；其中一些種類可分泌芳香樹脂「加爾巴納姆」（galbanum）"},"examples":[{"en":"Older references may list the galbanum plant under the name Cogswellia.","zh":"較早期的資料可能會把產加爾巴納姆樹脂的植物寫作 Cogswellia。"},{"en":"In modern taxonomy, Cogswellia is generally treated as part of the genus Ferula.","zh":"在現代分類學中，Cogswellia 通常被視為阿魏屬（Ferula）的一部分。"}]}],"synonyms":["Ferula","galbanum plant"],"phonetic":"/kɑɡˈzwɛliə/","extraExplanation":["這個詞多出現在舊的植物分類文獻或香料／樹脂的相關資料中；現在在學術寫作裡通常改用 Ferula 這個屬名，因此你在新教材或現代植物百科中不一定找得到 Cogswellia。","galbanum（加爾巴納姆）是一種帶辛香、樹脂感的香料原料，歷史上曾用於香水與宗教薰香；提到 Cogswellia 時常會連帶談到這種樹脂。"]}
{"word":"coguarantor","summary":{"en":"A co-guarantor is someone who shares legal responsibility to repay or perform an obligation if the main person fails.","zh":"co-guarantor 指共同承担担保责任的人：若主要责任人违约，担保人需代为偿还或履约。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who signs an agreement with another guarantor and shares responsibility for someone else’s debt or obligation if that person does not pay or perform as promised.","zh":"（共同）担保人：与另一位担保人一起签署协议的人；如果借款人/责任人未按约还款或履约，需共同承担还款或履约责任。"},"examples":[{"en":"My aunt agreed to be a co-guarantor on my student loan.","zh":"我阿姨同意做我助学贷款的共同担保人。"},{"en":"If the borrower misses payments, the co-guarantor may have to pay.","zh":"如果借款人逾期不还，担保人可能需要代为偿还。"},{"en":"The bank asked for a co-guarantor because I had a short credit history.","zh":"因为我的信用记录较短，银行要求我提供共同担保人。"}]}],"synonyms":["co-signer","guarantor","surety"],"phonetic":"ˌkoʊˈɡærənˌtɔr","extraExplanation":["你输入的拼写“coguarantor”更常见的标准写法是 **co-guarantor**（也可写作 **coguarantor**）。在法律/金融语境中，它通常与 **guarantor**（担保人）同义但强调“共同/一起”。","在一些国家或地区的合同中，co-guarantor 的责任可能是“连带责任”（即债权人可直接要求担保人偿还），具体以合同条款与当地法律为准。签字前最好确认责任范围。"]}
{"word":"coguardian","summary":{"en":"A co-guardian is someone who shares guardianship duties with another guardian.","zh":"co-guardian 指与他人共同承担监护职责的共同监护人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who shares legal responsibility for caring for someone (often a child) or managing their affairs together with another guardian.","zh":"共同监护人：与另一位监护人一起，依法共同负责照顾某人（常为未成年人）或管理其事务的人。"},"examples":[{"en":"After the divorce, the child’s aunt became a co-guardian with the father.","zh":"离婚后，孩子的姑妈与父亲一起成为共同监护人。"},{"en":"The court appointed two co-guardians to manage the elderly man’s finances.","zh":"法院指定两位共同监护人来管理这位老人的财务。"}]}],"synonyms":["joint guardian","co-custodian (context-dependent)","legal co-guardian"],"phonetic":"/ˌkoʊ ˈɡɑrdiən/","extraExplanation":["“co-guardian”多用于法律与家庭事务语境（如监护权、法院指定监护）。不同地区法律对监护人的权利与义务规定不一，有时会区分“legal guardian（法定监护人）”“custody（抚养/监护安排）”等概念。","书写上也常见“co-guardian”或“co guardian”。在正式文件里通常会用带连字符的形式。"]}
{"word":"cogue","summary":{"en":"“Cogue” is usually a proper name; it’s not a common English word with a standard dictionary meaning.","zh":"“cogue”通常是专有名词（如姓氏）；并非常见、具有固定词典释义的英语单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard modern English vocabulary word; most often seen as a proper name (a surname) or in place/company names.","zh":"不是现代英语中的常用词汇；最常见于专有名词（姓氏）或地名/公司名中。"},"examples":[{"en":"Dr. Cogue will present the research tomorrow.","zh":"Cogue 博士将于明天展示这项研究。"},{"en":"I found “Cogue” as a last name in the document.","zh":"我在文件里看到“Cogue”作为姓氏出现。"}]}],"phonetic":"/koʊɡ/","extraExplanation":["“cogue”很可能是拼写误差或听写误差。学习者更常遇到的相近词包括：\n- vogue /voʊɡ/（n. 流行；in vogue 流行的）\n- cog /kɑːɡ/（n. 齿轮；v. 使……像齿轮一样运作）\n- rogue /roʊɡ/（n./adj. 流氓；不守规矩的）\n如果你告诉我你看到它的句子语境，我可以帮你判断到底是哪一个词。"]}
{"word":"cogware","summary":{"en":"“Cogware” means cognitive or AI software—software that imitates or supports human thinking and decision-making.","zh":"“Cogware”指认知/AI 软件——用于模拟或辅助人类思考与决策的软件。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"software designed to imitate or support human thinking (such as learning, reasoning, understanding language, or making decisions); cognitive/AI-based software.","zh":"用于模拟或辅助人类思维（如学习、推理、理解语言或决策）的软件；认知/人工智能软件。"},"examples":[{"en":"Modern customer service teams use cogware to answer common questions through chatbots.","zh":"现代客服团队会用 cogware（认知软件）通过聊天机器人回答常见问题。"},{"en":"The company invested in cogware that can detect patterns in medical images.","zh":"这家公司投资了能在医学影像中识别模式的 cogware。"}]},{"partOfSpeech":"n.","definition":{"en":"an industry term for the broader set of tools and systems built around cognitive computing (often including machine learning models, automation, and data pipelines).","zh":"行业用语：围绕“认知计算”构建的一整套工具与系统（常包含机器学习模型、自动化与数据流程）。"},"examples":[{"en":"Their “cogware platform” combines data management and machine-learning models in one product.","zh":"他们的“cogware 平台”把数据管理和机器学习模型整合在一个产品里。"},{"en":"The report compares traditional software with cogware used for predictive analytics.","zh":"报告比较了传统软件与用于预测分析的 cogware。"}]}],"synonyms":["cognitive software","AI software","intelligent software","cognitive computing software"],"phonetic":"/ˈkɑːɡˌwɛr/","extraExplanation":["“cogware”通常被理解为 cognition（认知）+ software（软件）的合成词，多见于科技/商业写作中，用来强调“像人一样思考”的软件能力。","它不是非常常见的日常英语词汇；更常见、更通用的说法包括 “AI software / cognitive software / intelligent software”。"]}
{"word":"cogway","summary":{"en":"Cogway is a rare term meaning the toothed rail/track used in rack (cog) railways to climb steep slopes.","zh":"Cogway 是较少见的词，指齿轨铁路中带齿的轨道/齿条，用于帮助列车爬陡坡。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rack railway track (or the toothed rail) that uses cogs to help a train climb very steep slopes","zh":"（齿轨铁路的）齿轨／齿条；一种带齿的铁轨，使列车能靠齿轮在陡坡上爬升"},"examples":[{"en":"On the mountain line, the train grips a cogway to climb the steep grade safely.","zh":"在山地线路上，列车靠齿轨（cogway）抓紧爬升，才能安全通过陡坡。"},{"en":"The historic railway was converted to a cogway system for better traction in winter.","zh":"这条历史铁路被改造成齿轨系统（cogway），以便在冬季获得更好的牵引力。"}]}],"synonyms":["rack railway","cog railway","cog rail","toothed rail"],"phonetic":"/ˈkɑɡˌweɪ/","extraExplanation":["“cogway”在日常英语里很少见，更多会看到更明确的说法：rack railway（齿轨铁路）、cog railway（齿轨铁路）、cog rail（齿轨/齿条）。如果你是在工程/铁路语境里看到它，通常指“带齿的轨道部分”。","很多人输入“cogway”其实是想写《功夫熊猫》里的乌龟大师 “Oogway”。“Oogway”是专有名词（角色名），不是英语常用词；拼写也不同。"]}
{"word":"cogways","summary":{"en":"“Cogways” means cog railways—rack-rail train lines for very steep slopes.","zh":"“Cogways”指齿轨铁路：利用齿条轨与齿轮啮合以攀爬陡坡的铁路系统。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of railway (cog railway) that uses a toothed rack rail and a gear (cog) so the train can climb very steep slopes; plural: cogways","zh":"（齿轨铁路）一种使用带齿的齿条轨与齿轮（cog）啮合的铁路系统，使列车能爬很陡的坡；复数：cogways"},"examples":[{"en":"The mountain route uses a cogway to reach the summit safely.","zh":"这条山地线路使用齿轨铁路来安全到达山顶。"},{"en":"Many old cogways were built to carry tourists up steep hills.","zh":"许多早期的齿轨铁路是为了把游客运上陡坡而修建的。"}]}],"synonyms":["cog railway","cog railroad","rack railway","rack railroad"],"phonetic":"/ˈkɑɡweɪ/","extraExplanation":["“cogways”在现代英语里不算常见词，更常见的说法是“cog railway / cog railroad”或“rack railway”。","这种系统的关键是“rack-and-pinion（齿条—齿轮）”：轨道中间有一条带齿的“rack rail（齿条轨）”，火车底部的齿轮与之咬合，从而提供额外牵引力，适合高山或坡度很大的路段。"]}
{"word":"cogweel","summary":{"en":"A cogwheel is a toothed wheel (a gear) that meshes with others to transfer motion or power.","zh":"cogwheel 指“齿轮”：边缘带齿、与其他齿轮啮合以传递动力或运动的轮子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wheel with teeth (cogs) around its edge that fits into another toothed wheel to transmit movement or power; a gear","zh":"（边缘有齿的）齿轮；用来与其他齿轮啮合、传递运动或动力的轮子"},"examples":[{"en":"The clock works because small cogwheels turn together inside it.","zh":"钟表之所以能走，是因为里面的小齿轮相互啮合转动。"},{"en":"When one cogwheel turns, it makes the next one rotate in the opposite direction.","zh":"一个齿轮转动时，会带动下一个齿轮向相反方向旋转。"},{"en":"The technician replaced a worn cogwheel in the machine.","zh":"技师更换了机器里一个磨损的齿轮。"}]}],"synonyms":["gear","cog","toothed wheel"],"phonetic":"/ˈkɑɡˌwil/","extraExplanation":["你输入的“cogweel”常见于拼写错误；标准拼写是“cogwheel”。在日常英语里更常用的词是“gear”（齿轮）。","“cogwheel”也常被用作比喻，表示“体系中的一环/小角色”（a small part of a large system），例如：He felt like a cogwheel in a huge company.（他觉得自己只是大公司里的一枚齿轮。）"]}
{"word":"cogweels","summary":{"en":"“Cogweels” is a misspelling of “cogwheels,” meaning toothed wheels (gears) that mesh to transmit motion.","zh":"“cogweels”是“cogwheels”的拼写错误，意思是啮合传动的带齿轮子（齿轮）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A misspelling of “cogwheels” (plural of “cogwheel”): wheels with teeth (cogs) that interlock to transmit motion in a machine.","zh":"“cogwheels”的拼写错误（“cogwheel”的复数）：带齿（齿轮齿）的轮子，彼此啮合以在机器中传递运动。"},"examples":[{"en":"The engineer replaced the worn cogwheels to stop the machine from slipping.","zh":"工程师更换了磨损的齿轮，防止机器打滑。"},{"en":"In the old clock, the cogwheels turn at different speeds.","zh":"在老式钟表里，齿轮以不同的速度转动。"},{"en":"The gears (cogwheels) must mesh smoothly to reduce noise.","zh":"齿轮必须顺畅啮合以降低噪音。"}]}],"synonyms":["gears","cogwheels","cogwheels (plural)","gear wheels"],"phonetic":"/ˈkɑɡˌwilz/","extraExplanation":["“cogweels”少了一个字母 h；正确拼写是“cogwheels”。单数是“cogwheel”。","“cogwheel/gear”在日常英语里常常可互换；更口语、更常见的说法通常是“gears”。","也常见比喻用法：the cogwheels of government/industry（政府/产业的运转机制），强调系统像机器一样运转。"]}
{"word":"cogwheel","summary":{"en":"A cogwheel is a gear: a toothed wheel that works with other gears to move parts of a machine.","zh":"cogwheel 指“齿轮”，是带齿的轮子，与其他齿轮啮合来带动机器运转。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a toothed wheel (gear) that meshes with another gear to transmit motion or force in a machine","zh":"（机器中的）齿轮；带齿的轮子（与其他齿轮啮合，用来传递运动或力量）"},"examples":[{"en":"The clock stopped because a cogwheel inside it was worn out.","zh":"钟停了，因为里面有一个齿轮磨损了。"},{"en":"When one cogwheel turns, it makes the next one turn too.","zh":"当一个齿轮转动时，也会带动下一个齿轮转动。"}]}],"synonyms":["gear","cog"],"phonetic":"/ˈkɑɡˌwil/","extraExplanation":["“Cogwheel”通常指“有齿的轮子”，在美式英语里更常直接说 **gear**。在英式英语中，**cogwheel** 这个词更常见一些。","在比喻用法中，**a cog in the machine**（机器中的一枚小齿轮）用来形容“组织里的小人物/小角色”，强调个人只是系统的一部分。"]}
{"word":"cogwheels","summary":{"en":"Cogwheels are toothed wheels (gears) used in machines; figuratively, they can mean the people or parts that keep a system running.","zh":"Cogwheels 指机器中的齿轮；也可比喻维持系统/组织运转的人员或环节。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a toothed wheel (a gear) that works with other gears to transmit motion or force in a machine","zh":"（机械中的）齿轮；啮合齿轮，用来传递运动或力量"},"examples":[{"en":"The clock’s cogwheels turn smoothly to keep accurate time.","zh":"钟表的齿轮平稳转动，以保持走时准确。"},{"en":"Oil the cogwheels so the machine doesn’t make a grinding noise.","zh":"给齿轮上油，这样机器就不会发出刺耳的摩擦声。"},{"en":"In this factory, hundreds of cogwheels work together inside each engine.","zh":"在这家工厂里，每台发动机内部都有数百个齿轮协同工作。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) the people or parts of a system that make it work, often in a large organization","zh":"（比喻）系统/组织中推动运转的“齿轮”；关键人员或环节（常指大型组织）"},"examples":[{"en":"Teachers are the cogwheels of the education system.","zh":"教师是教育体系中推动运转的“齿轮”。"},{"en":"If one of the cogwheels fails, the whole project can slow down.","zh":"如果某个关键环节出问题，整个项目就可能变慢。"}]}],"synonyms":["gears","cogs"],"phonetic":"/ˈkɑɡˌwilz/","extraExplanation":["“cogwheel”常与“gear”意思接近：日常英语里更常说gear（齿轮），cogwheel较偏技术或较书面。","比喻用法里常见搭配：a cog in the machine（机器里的一颗螺丝/一枚齿轮），强调个人在庞大体系中的小角色，有时带一点无奈或讽刺意味。"]}
{"word":"cogwood","summary":{"en":"Cogwood refers to a dogwood-type tree or shrub known for spring flowers (and sometimes red berries).","zh":"cogwood指山茱萸（狗木属）一类的小树或灌木，以春季花朵（有时红色浆果）著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small tree or shrub (often in the genus Cornus) known for its spring flowers and, in some types, bright red berries","zh":"山茱萸（狗木属）植物；一种常见的小乔木或灌木，以春季花朵著名，部分品种会结红色浆果"},"examples":[{"en":"We planted a flowering dogwood near the front door for its spring blooms.","zh":"我们在前门附近种了一棵开花的山茱萸，让春天更有景致。"},{"en":"In the story, the path was lined with white dogwoods and tall pines.","zh":"故事里，小路两旁开着白色山茱萸，旁边还有高大的松树。"}]}],"synonyms":["dogwood","Cornus"],"phonetic":"/ˈkɑɡˌwʊd/","extraExplanation":["在北美语境里，cogwood常被当作dogwood的另一种叫法或拼写变体；日常更常见的是dogwood。著名品种包括“flowering dogwood”（北美山茱萸，Cornus florida）和“Pacific dogwood”（太平洋山茱萸，Cornus nuttallii）。","文化小提示：在美国，dogwood常出现在描写春天与乡村景色的文学或诗歌中，象征春天、纯净与新生。"]}

