{"word":"Coh","summary":{"en":"“COH/Coh” is usually an abbreviation; most commonly it means “cash on hand,” and informally it can mean “cohort.”","zh":"“COH/Coh”通常是缩写；最常见指“手头现金（cash on hand）”，也可在非正式场合指“同届/同批（cohort）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) cash on hand; the amount of money (cash) a person or business has available right now.","zh":"（缩写）手头现金；指个人或公司目前可立即使用的现金金额。"},"examples":[{"en":"We need to check our COH before we buy new equipment.","zh":"我们在购买新设备前需要先查看手头现金（COH）。"},{"en":"After paying the bills, our COH is only $500.","zh":"付完账单后，我们的手头现金（COH）只有500美元。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., informal) cohort; a group of people who start something at the same time (often used in schools or training programs).","zh":"（缩写，非正式）同届/同批（cohort）；指同时开始学习或培训的一群人，常见于学校或项目中。"},"examples":[{"en":"I’m in the 2025 COH for the nursing program.","zh":"我在护理项目的2025届（COH）。"},{"en":"Our COH meets every Friday to study together.","zh":"我们这届（COH）每周五一起学习。"}]}],"synonyms":["cash available","available cash","cohort (when used informally)"],"phonetic":"/koʊ/","extraExplanation":["“COH/Coh”不是一个常见的完整英语单词，更多是缩写，具体含义要看领域与上下文（财务、教育、医疗机构名称等）。如果你告诉我你在哪里看到它（例如账单、课程表、聊天信息），我可以给出更准确的释义。"]}
{"word":"cohabit","summary":{"en":"Cohabit means to live together, especially as an unmarried couple; it can also mean to coexist peacefully.","zh":"cohabit 指同住/同居，尤指未婚伴侣同居；也可指（不同群体等）共处、并存。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Of two people) to live together in the same home, especially as a couple without being married.","zh":"（两个人）同居；共同生活，尤指未婚伴侣住在一起。"},"examples":[{"en":"They decided to cohabit before getting married.","zh":"他们决定在结婚前先同居。"},{"en":"Some couples cohabit for years and still choose not to marry.","zh":"有些情侣同居多年，仍选择不结婚。"},{"en":"In many cities, it’s common for young adults to cohabit to share rent.","zh":"在许多城市，年轻人同居分担房租很常见。"}]},{"partOfSpeech":"vi.","definition":{"en":"To live together (in the same place) with someone or something; to exist side by side.","zh":"共处；同住（同一空间）；并存。"},"examples":[{"en":"Different cultures can cohabit peacefully in the same neighborhood.","zh":"不同文化可以在同一社区里和平共处。"},{"en":"Wildlife and humans must learn to cohabit in this protected area.","zh":"在这个保护区里，野生动物和人类必须学会共存。"}]}],"synonyms":["live together","share a home","coexist"],"phonetic":"/koʊˈhæbɪt/","extraExplanation":["词源上来自拉丁语：co-（共同）+ habitare（居住），和 inhabit（居住于）、habitat（栖息地）是同源词。","在日常英语里，cohabit 常用于较正式或法律/社会话题的语境；口语更常说 live together。","在一些地区，“cohabitation”可能涉及法律权利与义务（如租房、财产、子女抚养等），具体因国家/州而异。"]}
{"word":"cohabitancy","summary":{"en":"Cohabitancy means the state of living together, especially as an unmarried couple.","zh":"Cohabitancy 指同居的状态，尤指未婚伴侣同住。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of living together in the same home, especially as a couple in a romantic relationship without being married; cohabitation","zh":"同居状态；（尤指未婚伴侣的）同居"},"examples":[{"en":"Some people choose cohabitancy before marriage to see if they are compatible.","zh":"有些人在结婚前选择同居，以看看彼此是否合适。"},{"en":"The law treats cohabitancy differently from marriage in many places.","zh":"在许多地方，法律对同居与婚姻的对待不同。"}]}],"synonyms":["cohabitation","living together","shared residence"],"phonetic":"/koʊˈhæbɪtənsi/","extraExplanation":["“cohabitancy”比较少见，更常用的说法是“cohabitation”。在法律、社会学或较正式的写作中，可能会看到“cohabitancy”。","词根：co-（共同）+ habit（居住、习惯）→ cohabit（同居、共同居住）+ -ancy（名词后缀，表示状态/性质）。","文化语境：在一些英语国家/地区，“cohabitancy/cohabitation”常与住房、财产、子女抚养、伴侣权益等社会议题相关；不同地区对同居伴侣权利的法律规定差异很大。"]}
{"word":"cohabitant","summary":{"en":"A cohabitant is someone you live with, especially a partner you’re not married to.","zh":"cohabitant 指与你同住的人，尤其是未婚同居的伴侣（语气较正式）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who lives with another person in the same home, especially as an unmarried couple","zh":"同居者；（尤指）未婚同居的伴侣"},"examples":[{"en":"He introduced her as his cohabitant, not his wife.","zh":"他介绍她是他的同居伴侣，而不是妻子。"},{"en":"Some cities give legal protections to cohabitants who share a home long-term.","zh":"一些城市会为长期共同居住的同居者提供法律保护。"}]}],"synonyms":["partner","live-in partner","housemate","roommate"],"phonetic":"/koʊˈhæbɪtənt/","extraExplanation":["“cohabitant”语气偏正式，常见于法律、新闻或官方文件；日常口语里更常用“partner”“boyfriend/girlfriend”“roommate”（室友不一定是恋爱关系）。","在一些地区，“cohabitant”可能涉及财产、租约、医疗决定等权利义务，具体含义会随法律体系而变化。"]}
{"word":"cohabitants","summary":{"en":"“Cohabitants” means people who live together, often referring to an unmarried couple living together.","zh":"“cohabitants”指共同居住的人，常用于指未婚同居的伴侣。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who live together in the same home, especially a couple living together in a romantic relationship without being married.","zh":"同居者；同住的人（尤指未婚但以伴侣关系同住的一对人）。"},"examples":[{"en":"They introduced themselves as cohabitants, not husband and wife.","zh":"他们介绍自己是同居伴侣，而不是夫妻。"},{"en":"In some places, cohabitants can have certain legal rights similar to married couples.","zh":"在一些地方，同居伴侣可能享有类似已婚夫妻的某些法律权利。"}]},{"partOfSpeech":"n.","definition":{"en":"People or creatures that share the same living space or habitat.","zh":"共居者；同栖者（指共享同一居住空间或栖息地的人或生物）。"},"examples":[{"en":"The garden supports many cohabitants, from birds to insects.","zh":"这个花园养育着许多同栖者，从鸟类到昆虫。"},{"en":"Roommates are cohabitants, but not necessarily a couple.","zh":"室友也是共居者，但不一定是伴侣关系。"}]}],"synonyms":["partners","live-in partners","housemates","roommates"],"phonetic":"/koʊˈhæbɪtənts/","extraExplanation":["“cohabitants”是“cohabitant”的复数，来自动词“cohabit”（同居/同住）。日常语境里常指未婚同居的伴侣；在法律或社会学文本中也常见。"]}
{"word":"cohabitate","summary":{"en":"Cohabitate means to live together, especially as an unmarried couple; it can also mean to coexist in the same place.","zh":"cohabitate 指（尤指未婚伴侣）同居，也可指在同一地方或情境中共存。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to live together in the same home, especially as a romantic couple without being married","zh":"（尤指未婚的情侣）同居；共同生活在一个住所里"},"examples":[{"en":"They decided to cohabitate before getting married.","zh":"他们决定在结婚前先同居。"},{"en":"Some couples cohabitate to see if they are compatible.","zh":"有些情侣同居是为了看看是否合得来。"}]},{"partOfSpeech":"v.","definition":{"en":"to exist or occur together in the same place or situation","zh":"共存；同时存在于同一环境或情境中"},"examples":[{"en":"Tradition and modern technology can cohabitate in the same workplace.","zh":"传统与现代科技可以在同一个职场中共存。"}]}],"synonyms":["cohabit","live together","share a home","coexist"],"phonetic":"/koʊˈhæbɪˌteɪt/","extraExplanation":["“cohabitate”在日常英语里也常写作“cohabit”，两者意思相同；“cohabit”更常见、更自然一些。","在法律、社会学或新闻语境中，“cohabitate/cohabit”常用于描述未婚伴侣的共同生活状态（如同居伴侣、同居关系）。在不同文化与地区，这种关系可能有不同的社会观感与法律含义。"]}
{"word":"cohabitation","summary":{"en":"Cohabitation means living together as a couple (often without marriage); it can also mean different species living together in one habitat.","zh":"cohabitation 指伴侣（常为未婚）同居；也可指不同物种在同一栖息地共栖/共居。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The situation in which two people live together in the same home as a couple, especially when they are not married.","zh":"（尤指未婚）同居：两个人以伴侣关系住在同一屋檐下。"},"examples":[{"en":"They chose cohabitation before deciding whether to get married.","zh":"他们选择先同居，再决定是否结婚。"},{"en":"Some families accept cohabitation, while others prefer marriage first.","zh":"有些家庭能接受同居，有些则更希望先结婚。"},{"en":"The study looked at how cohabitation affects relationship satisfaction.","zh":"这项研究考察了同居如何影响伴侣关系的满意度。"}]},{"partOfSpeech":"n.","definition":{"en":"In ecology, the state of different species living together in the same area or habitat.","zh":"（生态学）共栖/共居：不同物种在同一地区或栖息地共同生活的状态。"},"examples":[{"en":"The island supports the cohabitation of many bird species.","zh":"这座岛屿支持多种鸟类的共栖。"},{"en":"Cohabitation can increase competition for food and space.","zh":"共栖可能会加剧对食物和空间的竞争。"}]}],"synonyms":["living together","co-residence","domestic partnership (context-dependent)"],"phonetic":"/koʊˌhæbəˈteɪʃən/","extraExplanation":["“cohabitation”常见于法律与社会学语境：例如在某些地区，同居伴侣在财产、抚养权、医疗决定等方面的权利与义务可能与婚姻不同。不同文化、宗教与家庭观念对“同居”的接受度差异很大。","词源提示：来自拉丁语前缀 co-（一起）+ habitare（居住），字面意思是“住在一起”。"]}
{"word":"cohabitations","summary":{"en":"“Cohabitations” means instances or situations of living together, most commonly referring to unmarried couples living together.","zh":"“cohabitations”指“同居”的情况/个案，最常见是指未婚伴侣同居。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or situation of living together in an intimate relationship (often like marriage) without being legally married; plural of “cohabitation.”","zh":"同居；（通常指）未婚同居、伴侣共同生活的状态；“cohabitation”的复数。"},"examples":[{"en":"The study compared marriage rates with cohabitations among young adults.","zh":"这项研究比较了年轻人的结婚率与同居情况。"},{"en":"In some countries, long-term cohabitations can affect legal rights related to property or children.","zh":"在一些国家，长期同居可能会影响与财产或子女相关的法律权利。"}]},{"partOfSpeech":"n.","definition":{"en":"shared living arrangements in general (two or more people living in the same home), often used in formal or academic writing.","zh":"（较正式/学术用法）共同居住的安排（两人或多人同住一处）。"},"examples":[{"en":"The report examined intergenerational cohabitations, such as adult children living with parents.","zh":"报告研究了代际共居，例如成年子女与父母同住。"}]}],"synonyms":["living together","cohabitation","unmarried partnership","domestic partnership","shared household"],"phonetic":"/koʊˌhæbəˈteɪʃənz/","extraExplanation":["“cohabitation”在现代英语里常与伴侣关系相关，尤其指“未婚同居”。在社会学、人口学研究中常用其复数“cohabitations”来表示不同的同居个案或不同人群中的同居现象。","在法律语境中，不同地区对同居伴侣的权利义务规定差异很大；有的地方承认类似“事实婚姻/同居伴侣关系”，有的则不承认，因此写作或翻译时最好结合具体国家/地区。"]}
{"word":"cohabited","summary":{"en":"Cohabited means lived together, usually as an unmarried couple.","zh":"cohabited 指“同居”，通常指未婚伴侣共同生活。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"lived together in the same home, especially as a couple in a romantic relationship without being married","zh":"同居；（尤指）以伴侣身份同住在一起，通常指未婚同居"},"examples":[{"en":"They cohabited for two years before getting married.","zh":"他们同居了两年后才结婚。"},{"en":"The report says the couple cohabited but were not legally married.","zh":"报告称这对伴侣同居，但并未合法结婚。"}]},{"partOfSpeech":"v.","definition":{"en":"lived together (in the same place) with others; shared a living space","zh":"共住；与他人住在同一处（较少用，通常不特指恋爱关系）"},"examples":[{"en":"Several families cohabited in the large house during the winter.","zh":"冬天时，几户人家住在那所大房子里。"}]}],"synonyms":["lived together","shared a home","co-resided (formal)"],"phonetic":"/koʊˈhæbɪtɪd/","extraExplanation":["“cohabited”是动词“cohabit”的过去式/过去分词。日常英语里更常见的说法是“live together”。“cohabit”更偏正式，常用于法律、新闻、社会学研究等语境。","在一些国家或地区，“cohabiting couple（同居伴侣）”在法律上可能涉及财产、租约、子女抚养或“common-law marriage（事实婚姻）”等概念；具体含义随当地法律而变。"]}
{"word":"cohabiter","summary":{"en":"“Cohabiter” is a French verb meaning “to live together,” especially as an unmarried couple; it can also refer to political “cohabitation” (power-sharing).","zh":"“cohabiter”是法语动词，意思是“同住/同居”（尤指未婚伴侣）；也可指政治上的“左右共治/共治”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(French verb) to live together in the same home, especially as a couple without being married; to cohabit.","zh":"（法语动词）同住；（尤指未婚伴侣）同居。"},"examples":[{"en":"Ils ont décidé de cohabiter avant de se marier.","zh":"他们决定在结婚前先同居。"},{"en":"Certaines personnes préfèrent cohabiter plutôt que se marier.","zh":"有些人更愿意同居而不是结婚。"}]},{"partOfSpeech":"v.","definition":{"en":"(Politics, French) to share governing power when a president and a prime minister come from opposing parties (a “power-sharing” period).","zh":"（政治语境，法语）“左右共治/共治”：总统与总理来自不同党派时的权力共存状态。"},"examples":[{"en":"Sous la Ve République, ils ont dû cohabiter pendant plusieurs années.","zh":"在法兰西第五共和国时期，他们曾“左右共治”了好几年。"}]}],"synonyms":["cohabit","live together","share a home","coexist"],"phonetic":"/koʊˈhæbɪteɪ/","extraExplanation":["“cohabiter”是法语不定式；对应的常见英语词是 cohabit（同居/同住）。在法语里它既可用于日常关系（同居），也可用于政治术语“cohabitation”（左右共治）。","日常语境里，“cohabiter”有时也可更中性地表示“共处/共存”（例如不同物种或群体在同一空间共处），但最常见还是指伴侣同居。"]}
{"word":"cohabiting","summary":{"en":"“Cohabiting” means living together as a couple, usually without being married.","zh":"“cohabiting”指情侣同居，通常为未婚同住。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"living together with a romantic partner without being married (or not in a legally recognized marriage).","zh":"（与恋人）同居；未婚（或未在法律上认可的婚姻中）而共同生活。"},"examples":[{"en":"They’ve been cohabiting for three years, but they’re not married.","zh":"他们同居三年了，但还没有结婚。"},{"en":"Some families don’t approve of cohabiting before marriage.","zh":"有些家庭不赞成婚前同居。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “cohabit”; living together in the same home, especially as romantic partners without marriage.","zh":"“cohabit”的现在分词；同住（尤其指未婚情侣共同生活）。"},"examples":[{"en":"They are cohabiting while they save money for a wedding.","zh":"他们一边同居一边攒钱准备婚礼。"},{"en":"The law treats cohabiting couples differently in some places.","zh":"在一些地方，法律对同居伴侣的对待有所不同。"}]}],"synonyms":["living together","unmarried partners","cohabitation","shacking up (informal)"],"phonetic":"/koʊˈhæbɪtɪŋ/","extraExplanation":["“cohabit / cohabiting”常用于较正式的语境（新闻、法律、社会话题）。日常口语里更常说：live together（住在一起）或 move in together（搬到一起住）。","在不同文化与地区，同居的社会接受度与法律权益（如财产、抚养权、继承、医疗决定等）可能差异很大；表达时可根据语境选择更中性或更明确的说法。"]}
{"word":"cohabits","summary":{"en":"“Cohabits” means “lives together,” most commonly referring to a couple living together (often unmarried).","zh":"“cohabits”意为“同住/同居”，最常指伴侣同住（常含未婚同居之意）。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"lives together with someone (especially as a couple) in the same home, often without being married","zh":"与某人同住（尤指作为伴侣同居），通常不一定已婚"},"examples":[{"en":"She cohabits with her partner in Seattle.","zh":"她和伴侣在西雅图同住。"},{"en":"In the novel, the two characters cohabit before deciding whether to marry.","zh":"在小说里，两位角色在决定是否结婚前先同居。"}]},{"partOfSpeech":"vi.","definition":{"en":"lives together (in the same place) with another person or group","zh":"与他人或群体共同生活在同一处（更一般的“共居/同住”）"},"examples":[{"en":"Different generations cohabit under one roof.","zh":"不同世代同住在一个屋檐下。"}]}],"synonyms":["live together","share a home","co-reside"],"phonetic":"/koʊˈhæbɪts/","extraExplanation":["“cohabit(s)”在日常英语里常带有“作为情侣同居、未婚同住”的含义；在法律或社会话题中也可能涉及同居伴侣的权利与责任（如租约、财产、子女抚养等），语境会影响它听起来是中性、正式，还是带一点争议性。"]}
{"word":"Cohagen","summary":{"en":"Cohagen is a fictional name, most commonly referring to Vilos Cohaagen, the villain in the film \"Total Recall\" (1990).","zh":"Cohagen 是一个虚构名字，最常指电影《全面回忆》（1990）中的反派维洛斯·科哈根。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A fictional proper name, best known as the surname of the main antagonist (Vilos Cohaagen) in the science‑fiction film \"Total Recall\" (1990).","zh":"虚构的人名/姓氏；最常见的用法是科幻电影《全面回忆》（1990）中反派角色维洛斯·科哈根（Vilos Cohaagen）的姓。"},"examples":[{"en":"In \"Total Recall,\" Cohaagen is the powerful leader controlling Mars’s air supply.","zh":"在《全面回忆》中，科哈根是掌控火星空气供应的强势统治者。"},{"en":"The reviewer said the villain felt like “a Cohaagen type”—cold, ruthless, and politically powerful.","zh":"影评人说这个反派很像“科哈根那种类型”——冷酷、无情且握有政治权力。"}]}],"phonetic":"/ˈkoʊhɑːɡən/","extraExplanation":["“Cohagen”主要属于流行文化专有名词（proper noun）。在英语里谈论影视角色名时，常用作“引用/指代某种典型反派形象”，例如说 someone is a “Cohaagen-type villain”。","如果你在文本里看到不同拼写（如 Cohaagen / Cohagen），通常是同一角色名的变体；较常见的官方拼写是 Cohaagen（双 a）。"]}
{"word":"Cohan","summary":{"en":"Cohan is mainly a surname, famously associated with Broadway figure George M. Cohan; it can also refer to the U.S. tax-law “Cohan rule” about estimated deductions.","zh":"Cohan 主要是姓氏（常让人联想到百老汇人物 George M. Cohan）；也可指美国税法中的“Cohan 规则”，即在证明确有支出时允许合理估算扣除。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname); most commonly recognized from the American entertainer George M. Cohan","zh":"姓氏；在英语语境中常因美国艺人 George M. Cohan（乔治·M·科汉）而被熟知"},"examples":[{"en":"George M. Cohan was known for writing and performing in musical theater.","zh":"乔治·M·科汉以创作并出演音乐剧而闻名。"},{"en":"Our teacher mentioned Cohan when discussing early Broadway history.","zh":"老师在讲早期百老汇历史时提到了科汉。"}]},{"partOfSpeech":"phrase","definition":{"en":"in U.S. tax law, “the Cohan rule”: a court principle allowing estimated deductions when exact records are missing (if the expense is proven to have happened)","zh":"（美国税法）“Cohan 规则”：在缺少精确凭证时，只要能证明费用确实发生，法院可能允许用合理估算来扣除"},"examples":[{"en":"The accountant warned that the Cohan rule still requires credible evidence, not just guesses.","zh":"会计提醒说，即使适用 Cohan 规则，也需要可信证据，而不是随便猜。"},{"en":"In class, we learned the Cohan rule from a case involving entertainment expenses.","zh":"课堂上我们通过一宗涉及招待费用的案件学习了 Cohan 规则。"}]}],"phonetic":"/ˈkoʊən/","extraExplanation":["“Cohan”常被当作专有名词使用，最出名的是 George M. Cohan（1878–1942），与美国音乐剧/百老汇早期发展密切相关，代表作包括《Yankee Doodle Dandy》等爱国题材歌曲与舞台作品。","“Cohan 规则”源于税务案件 Cohan v. Commissioner（1930）。它并不是“没有票据也一定能扣除”，而是：纳税人先要证明确有支出，法官才可能在证据基础上做合理估算。"]}
{"word":"Cohanim","summary":{"en":"Cohanim are Jewish priests from a hereditary priestly line, traditionally descended from Aaron.","zh":"Cohanim指犹太传统中的世袭祭司阶层，传统上认为源自亚伦的后裔。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Jewish priests—members of the hereditary priestly class traditionally descended from Aaron, with special religious roles (especially in ancient Temple worship and in some rituals today).","zh":"犹太祭司——传统上被认为世袭自亚伦的祭司阶层成员，具有特定宗教职责（古代主要负责圣殿礼仪，如今在部分仪式中仍有角色）。"},"examples":[{"en":"In many synagogues, the Cohanim may recite the priestly blessing during services.","zh":"在许多犹太会堂里，Cohanim（祭司家族成员）可能会在礼拜中诵读“祭司祝福”。"},{"en":"The family identifies as Cohanim and follows certain customs linked to that status.","zh":"这户人家自认属于Cohanim（祭司家族），并遵循一些与该身份相关的习俗。"}]}],"synonyms":["kohanim","Jewish priests","priestly class"],"phonetic":"/koʊˈhɑːnɪm/","extraExplanation":["“Cohanim”是希伯来语复数形式，单数是“kohen”。英文里也常见写法“kohanim”。","在犹太传统中，Cohanim与古代耶路撒冷圣殿（Temple）的献祭与礼仪密切相关；圣殿被毁后，他们的角色多转为礼仪性与象征性（如“Priestly Blessing/祭司祝福”）。","不同社群对Cohanim相关习俗的遵守程度不一；一些传统会提到他们在婚姻、丧葬或接触遗体方面的特殊宗教规定。"]}
{"word":"cohanim","summary":{"en":"Cohanim (more commonly spelled kohanim) means Jewish priests—descendants of Aaron—who have traditional religious roles.","zh":"Cohanim（更常拼作 kohanim）指犹太教的祭司群体，即亚伦后裔，传统上承担特定宗教职责。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Judaism) Jewish priests descended from Aaron (Moses’ brother), traditionally responsible for certain religious duties; plural of “kohen.”","zh":"（犹太教）源自亚伦（摩西的兄弟）后裔的犹太祭司群体；“kohen（祭司）”的复数。"},"examples":[{"en":"In the synagogue, kohanim may perform the priestly blessing on holidays.","zh":"在会堂里，cohanim/kohanim 可能会在节日时进行祭司祝福。"},{"en":"Some families have the surname Cohen and identify as kohanim by tradition.","zh":"有些家庭姓 Cohen，并按传统认同自己属于 cohanim/kohanim。"}]}],"synonyms":["kohanim","kohen (singular)","Aaronic priests","Jewish priests"],"phonetic":"/koʊˈhɑːnɪm/","extraExplanation":["“cohanim”更常见的拼写是“kohanim”。它来自希伯来语“kōhănîm（祭司们）”。在现代犹太社群中，是否属于 kohanim 往往由家族传统与身份传承来认定。","与 kohanim 相关的常见习俗包括：在特定场合进行“祭司祝福”（Birkat Kohanim），以及在某些礼仪与葬礼相关场合遵守特定规约（不同传统与社群做法会有差异）。"]}
{"word":"cohanims","summary":{"en":"Kohanim are Jewish priests (plural of kohen), a hereditary priestly group with traditional religious duties.","zh":"Kohanim 指犹太教中的“祭司”（kohen）的复数形式，是世袭的祭司群体，传统上承担特定宗教职责。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Judaism) plural of “kohen”: members of the hereditary Jewish priestly class, traditionally descended from Aaron, with specific religious roles and honors.","zh":"（犹太教）“kohen（祭司）”的复数：指世袭的犹太祭司阶层成员，传统上被认为出自亚伦的后裔，在宗教仪式中有特定职责与荣誉。"},"examples":[{"en":"In many synagogues, kohanim may perform the Priestly Blessing on certain holidays.","zh":"在许多犹太会堂里，kohanim 可能会在某些节日进行“祭司祝福”。"},{"en":"He was called to the Torah first because he was a kohen, one of the kohanim.","zh":"他因是 kohen（属于 kohanim 之一）而被优先请上台诵读《妥拉》。"}]}],"synonyms":["Jewish priests","priests (in Jewish context)","Kohanim"],"phonetic":"/koʊˈhɑːnɪm/","extraExplanation":["“Kohanim”来自希伯来语 כֹּהֲנִים（kohanim），单数是 “kohen”。英文里也常见拼写为 “Kohanim”（首字母大写更常用于宗教语境）。","在传统犹太礼仪中，kohanim 与利未人（Levites）有不同的身份与职责；例如在某些场合会有特定的上台顺序或仪式角色。不同社群与地区的实践可能有差异。","如果你输入的 “cohanims” 是按发音拼写的非标准写法，标准英文拼写通常是 “kohanim”。"]}
{"word":"coharmonious","summary":{"en":"“Coharmonious” means ‘harmonious together’—two or more things work well and fit smoothly with each other.","zh":"“coharmonious”表示“共同和谐”：两个或更多事物彼此契合、相处融洽、配合顺畅。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Harmonious together; fitting well with each other in a shared system, relationship, or environment.","zh":"（与……）共同和谐的；彼此相配、相处融洽的（强调“在一起/共同”地和谐）。"},"examples":[{"en":"The building’s modern glass facade and the historic stone base feel coharmonious rather than conflicting.","zh":"这栋建筑的现代玻璃立面与历史石材底座感觉是共同和谐的，而不是互相冲突的。"},{"en":"They designed a coharmonious schedule so work and family time could support each other.","zh":"他们制定了一个共同和谐的时间表，让工作与家庭时间可以相互支持。"}]}],"synonyms":["compatible","harmonious","well-matched","congruent","in harmony"],"phonetic":"/ˌkoʊhɑrˈmoʊniəs/","extraExplanation":["“coharmonious”由前缀 co-（共同、一起）+ harmonious（和谐的）构成，意思比单独的 “harmonious” 更强调“彼此之间的和谐、相互契合”。","这个词在日常口语里不算常见，更常见的表达有 “harmonious with,” “in harmony,” “compatible,” “well-matched”。写作中使用时，通常出现在设计、音乐、团队协作、生态/系统等语境。"]}
{"word":"coharmoniously","summary":{"en":"“Coharmoniously” means “in harmony together; working or sounding well together.”","zh":"“coharmoniously”意为“和谐地一起；彼此协调一致地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In harmony together; in a way that different parts or people work or sound well together.","zh":"和谐地一起；以不同部分或人彼此配合、协调一致的方式。"},"examples":[{"en":"The choir and the orchestra performed coharmoniously, creating a full, balanced sound.","zh":"合唱团和管弦乐队和谐地一起演出，营造出饱满而均衡的音色。"},{"en":"These design elements should blend coharmoniously rather than compete for attention.","zh":"这些设计元素应该和谐地融合在一起，而不是互相抢夺注意力。"}]}],"synonyms":["harmoniously","in harmony","in sync","cooperatively","in concert"],"phonetic":"/ˌkoʊhɑrˈmoʊniəsli/","extraExplanation":["“coharmoniously”并不常见，更常见的写法是带连字符的“co-harmoniously”，或直接用“harmoniously”。它多出现在音乐、设计、团队协作等语境中，用来强调“共同/彼此”达到和谐。","词根提示：co- 表示“共同”，harmoniously 表示“和谐地”。所以它比单独的 “harmoniously” 更强调“彼此之间一起协调”。"]}
{"word":"coharmonize","summary":{"en":"Coharmonize means to harmonize together—either to make things fit well together or to be in harmony together (a rare word).","zh":"coharmonize 指“共同和谐/共同协调”——既可指使……协调，也可指彼此处于和谐状态（较少见）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Uncommon) To harmonize together; to make parts or people fit well with each other in sound, style, or purpose.","zh":"（不常用）共同和谐；使不同部分或不同人彼此协调，在声音、风格或目标上配合得当。"},"examples":[{"en":"The choir director helped the voices coharmonize during rehearsal.","zh":"合唱团指挥在排练时帮助各声部共同和谐起来。"},{"en":"Their ideas coharmonized into one clear plan.","zh":"他们的想法相互协调，最终形成了一个清晰的方案。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Uncommon) To be in harmony together; to blend well.","zh":"（不常用）共同处于和谐状态；融合得很好。"},"examples":[{"en":"The strings and piano coharmonize beautifully in this passage.","zh":"在这一段里，弦乐与钢琴配合得非常和谐。"}]}],"synonyms":["harmonize","blend","mesh","coordinate","integrate","fit together"],"phonetic":"/ˌkoʊˈhɑrməˌnaɪz/","extraExplanation":["“co-”表示“共同、一起”，加在“harmonize（使和谐/和声）”前，强调“彼此一起协调”。这个词在现代英语里很少见，更常用的是“harmonize (with)”或“work/fit well together”。","使用场景常见于音乐（声部、乐器的配合）或比喻（观点、计划、团队协作的协调）。"]}
{"word":"Cohasset","summary":{"en":"Cohasset is a U.S. place name, most commonly referring to the coastal town in Massachusetts.","zh":"Cohasset 是美国地名，最常指马萨诸塞州的海滨小镇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a coastal town in Norfolk County, Massachusetts, near Boston, known for its harbor and seaside scenery.","zh":"（美国）马萨诸塞州诺福克县的海滨小镇，靠近波士顿，以港湾与海岸风景闻名。"},"examples":[{"en":"They spent a weekend in Cohasset and walked along the rocky shore.","zh":"他们在 Cohasset 过了一个周末，还沿着多岩的海岸散步。"},{"en":"Cohasset is a small town on the South Shore of Massachusetts.","zh":"Cohasset 是马萨诸塞州南岸的一个小镇。"}]},{"partOfSpeech":"n.","definition":{"en":"a city in Itasca County, Minnesota, in the United States.","zh":"（美国）明尼苏达州伊塔斯卡县的一座城市。"},"examples":[{"en":"He grew up near Cohasset, Minnesota, not far from Grand Rapids.","zh":"他在明尼苏达州 Cohasset 附近长大，离大急流城（Grand Rapids）不远。"}]}],"phonetic":"/koʊˈhæsɪt/","extraExplanation":["“Cohasset”源自当地原住民语言（常被认为与马萨诸塞一带的阿尔冈昆语族有关），常见解释是与“长而多岩的地方/石头多的海岸”相关。作为地名，它在口语里通常不加冠词（说“in Cohasset”，而不是“in the Cohasset”）。"]}
{"word":"COHb","summary":{"en":"COHb is the abbreviation for carboxyhemoglobin, indicating carbon monoxide bound to hemoglobin in blood.","zh":"COHb是“碳氧血红蛋白”的缩写，表示血液中一氧化碳与血红蛋白结合的比例/状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"carboxyhemoglobin: a form of hemoglobin that has carbon monoxide (CO) bound to it, reducing the blood’s ability to carry oxygen.","zh":"碳氧血红蛋白：一氧化碳（CO）与血红蛋白结合形成的物质，会降低血液携氧能力。"},"examples":[{"en":"The lab reported an elevated COHb level, suggesting carbon monoxide exposure.","zh":"检验报告显示COHb水平升高，提示可能接触了一氧化碳。"},{"en":"Firefighters may have their COHb checked after smoke inhalation.","zh":"消防员在吸入烟雾后，可能会检查COHb水平。"},{"en":"High COHb can cause headache, dizziness, and confusion.","zh":"COHb过高可能导致头痛、头晕和意识混乱。"}]}],"synonyms":["carboxyhemoglobin","HbCO"],"phonetic":"/ˌsiː oʊ ˌeɪtʃ biː/","extraExplanation":["COHb通常作为医学缩写出现在化验单、急诊记录或职业健康检查中，用来评估一氧化碳中毒或暴露程度。","与普通含氧血红蛋白不同，CO与血红蛋白的结合力很强，会“抢占”携氧位置，因此即使吸入空气中氧气正常，也可能出现缺氧症状。","相关写法还可能见到HbCO（同义缩写）或直接写carboxyhemoglobin（全称）。"]}
{"word":"Cohbath","summary":{"en":"“Combat” means to fight against something (verb) or a battle/armed fighting (noun).","zh":"“combat”可作动词表示“对抗/遏制”，作名词表示“战斗/交战”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to fight or struggle against someone or something; to try to stop or reduce something bad","zh":"与……战斗/对抗；努力遏制或减少不好的事物"},"examples":[{"en":"They worked together to combat wildfires.","zh":"他们一起努力对抗野火。"},{"en":"This medicine helps combat infection.","zh":"这种药有助于对抗感染。"},{"en":"The government is trying to combat inflation.","zh":"政府正努力遏制通货膨胀。"}]},{"partOfSpeech":"n.","definition":{"en":"a fight or battle, especially between armed forces; also, a strong struggle or conflict","zh":"战斗；（尤指武装）交战；也可指激烈的冲突/斗争"},"examples":[{"en":"The soldiers saw combat during the war.","zh":"这些士兵在战争中经历过战斗。"},{"en":"The movie shows hand-to-hand combat.","zh":"这部电影展示了徒手格斗。"}]}],"synonyms":["fight","battle","struggle","oppose","resist"],"phonetic":"/kəmˈbæt/","extraExplanation":["“Cohbath”不是常见的英文单词，较可能是拼写错误。最接近、最常见的词是 **combat**（对抗/战斗）。如果你想表达的是宗教中的“安息日”，你可能在找 **Sabbath**。你可以告诉我你想表达的中文意思或使用场景，我可以帮你确认正确拼写。"]}
{"word":"Cohberg","summary":{"en":"“Cohberg” is an uncommon proper name, often a variant or misspelling of “Coburg.”","zh":"“Cohberg”是不常见的专有名词，常见情况是“Coburg”的变体拼写或误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare proper name (surname or place name). In English, it is uncommon and is often a misspelling or variant spelling of similar names such as “Coburg” (a town in Germany) or “Saxe-Coburg.”","zh":"一个较少见的专有名词（可能是姓氏或地名）。在英语里并不常见，常见情况是拼写误差或与类似名称的变体拼写有关，例如“Coburg”（德国的科堡市）或“Saxe-Coburg（萨克森-科堡）”。"},"examples":[{"en":"I couldn’t find much information on “Cohberg”—it may be a variant spelling of “Coburg.”","zh":"我几乎查不到“Cohberg”的资料——它可能是“Coburg”的一种变体拼写。"},{"en":"Her last name is written as Cohberg in this record, but other documents list it as Coberg/Coburg.","zh":"这份记录里她的姓写作Cohberg，但其他文件写成Coberg/Coburg。"}]}],"phonetic":"/ˈkoʊbɝːɡ/","extraExplanation":["“Cohberg”不是常见英语词条，更像是专名（人名/地名/品牌名）或转写造成的拼法差异。","如果你是在历史或欧洲王室语境里看到它，很可能与“Coburg（科堡）”有关：例如“Saxe-Coburg and Gotha（萨克森-科堡-哥达）”是一个著名的王朝/家族名称。","为了给出更准确的释义，我需要你提供它出现的句子、领域（人名/地名/公司名/书名等）或原文截图。"]}
{"word":"Cohbert","summary":{"en":"“Cohbert” isn’t a standard English word; it’s likely a misspelling (often “cohort” or “covert”) or a name.","zh":"“Cohbert” 不是标准英文词；多半是拼写错误（常见为 “cohort” 或 “covert”）或人名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“Cohbert” is not a standard English word. It is most likely a misspelling of “cohort” (a group of people) or “covert” (secret/hidden), or it may be a surname (e.g., “Colbert”).","zh":"“Cohbert” 不是标准英文单词。它很可能是 “cohort”（一群人/同伴群体）或 “covert”（秘密的/隐蔽的）的拼写错误；也可能是姓氏（如 “Colbert”）。"},"examples":[{"en":"Did you mean “cohort”? My cohort at university studies together every week.","zh":"你是不是想写 “cohort”？我大学里的同届同学每周都会一起学习。"},{"en":"Did you mean “covert”? The reporter investigated a covert operation.","zh":"你是不是想写 “covert”？那位记者调查了一次秘密行动。"}]}],"synonyms":["cohort","covert"],"phonetic":"/ˈkoʊ.hɔrt/","extraExplanation":["如果你能告诉我它出现的句子或语境（例如你在哪篇文章/视频里看到的），我可以更准确判断你想表达的是 “cohort” 还是 “covert”，或是否是人名/地名。"]}
{"word":"Cohby","summary":{"en":"“Cohby” is usually a personal name (a spelling variant of Kobe/Coby/Colby).","zh":"“Cohby” 通常是人名（Kobe/Coby/Colby 的变体拼写）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Cohby: a given name (proper noun), usually a modern spelling variant of “Kobe/Coby/Colby.” It is used for people’s names rather than as a common dictionary word.","zh":"Cohby：人名（专有名词），通常是 “Kobe / Coby / Colby” 的现代变体拼写。多用于名字，而不是常见词汇。"},"examples":[{"en":"Cohby is starting first grade this year.","zh":"Cohby 今年要上一年级了。"},{"en":"Is “Cohby” your first name or a nickname?","zh":"“Cohby” 是你的名字还是昵称？"}]}],"synonyms":["Kobe","Coby","Colby"],"phonetic":"/ˈkoʊbi/","extraExplanation":["“Cohby”不是标准英语词典里常见的单词，更多见于个性化取名拼写。发音通常跟 “Kobe/Coby” 类似。","如果你是在某个文本、游戏ID、品牌或特定语境里看到 “Cohby”，告诉我原句/上下文，我可以更准确判断它是否是人名、昵称，还是某个专门术语。"]}
{"word":"Cohdwell","summary":{"en":"“Cohdwell” is not a standard word; it’s likely a misspelling of the name “Caldwell/Coldwell.”","zh":"“Cohdwell”不是标准词，更可能是姓名/地名“Caldwell/Coldwell”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“Cohdwell” is not a standard English word. It is most likely a misspelling of the surname “Caldwell” (or sometimes “Coldwell”), used as a family name or place name.","zh":"“Cohdwell”不是标准英语单词，更可能是姓氏“Caldwell”（有时也写作“Coldwell”）的拼写错误，用作人名姓氏或地名。"},"examples":[{"en":"I think “Cohdwell” might be a misspelling of “Caldwell.”","zh":"我觉得“Cohdwell”可能是把“Caldwell”拼错了。"},{"en":"Ms. Caldwell will join the meeting at 3 p.m.","zh":"Caldwell女士会在下午三点参加会议。"}]}],"phonetic":"/ˈkɔldwɛl/","extraExplanation":["在英语里，像Caldwell/Coldwell这类词更常见于“专有名词”（人名姓氏、公司名、地名），一般不按普通词汇那样解释词义。","如果你是从邮件、名单或地址里看到“Cohdwell”，建议你核对原始拼写或告诉我出现它的句子/场景，我可以更准确判断你想查的是哪一个名称（例如Caldwell还是Coldwell）。"]}
{"word":"Cohe","summary":{"en":"Cohere means to stick together or to make sense as a unified, logically connected whole.","zh":"cohere 表示（物理上）黏合在一起，或（逻辑上）前后一致、连贯成一个整体。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to stick together physically, or to fit together logically as a clear, unified whole","zh":"（物理上）黏在一起、结合；（思想/文章等）连贯一致、成为一个整体"},"examples":[{"en":"The glue helps the pieces cohere into a single model.","zh":"胶水让这些零件黏合成一个完整的模型。"},{"en":"Her argument doesn’t cohere because the reasons don’t match the conclusion.","zh":"她的论证不够连贯，因为理由与结论对不上。"},{"en":"The story finally coheres in the last chapter.","zh":"故事在最后一章终于变得连贯成形。"}]}],"synonyms":["stick together","hold together","unite","fit together","make sense"],"phonetic":"/koʊˈhɪr/","extraExplanation":["你输入的“Cohe”看起来像是不完整的开头；常见完整词是 cohere（动词：连贯/黏合）。同一词族还有 coherent（adj. 连贯的）、cohesion（n. 凝聚力/连贯性）、cohesive（adj. 有凝聚力的）。如果你想查的是其中某个词，我也可以分别给你更精确的释义与例句。","cohere 常用于两类语境：1）材料/群体“黏在一起、团结”；2）文章/观点“前后一致、说得通”。写作课或学术写作里常说 an essay should cohere（文章要连贯）。"]}
{"word":"cohead","summary":{"en":"A co-head is a joint leader who shares the top role with another person.","zh":"co-head 指与他人共同担任最高领导职位的联合负责人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who shares the top leadership role of a group, department, or project with someone else; a joint leader","zh":"与他人共同担任某个团队、部门或项目最高领导角色的人；联合负责人"},"examples":[{"en":"She is co-head of the research team, working alongside Dr. Lee.","zh":"她是研究团队的联合负责人，与李博士一起工作。"},{"en":"The company appointed two co-heads to lead the new Asia division.","zh":"公司任命两位联合负责人来领导新的亚洲事业部。"}]}],"synonyms":["co-leader","joint head","co-chair"],"phonetic":"/ˌkoʊˈhɛd/","extraExplanation":["“co-”表示“共同、联合”，因此 co-head 强调“共同担任负责人”。在正式职场语境中常见于组织架构或任命公告里。","拼写上常见 co-head（带连字符），也有人写作 cohead 或 cohead(s)。在简历、邮件签名等正式写法里，co-head 更常见。"]}
{"word":"coheaded","summary":{"en":"“Coheaded” means led something together with another person (or people), or describes something jointly led.","zh":"“coheaded”表示与他人共同领导/共同负责，或形容“共同领导的”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense / past participle of “co-head”) to lead or be in charge of something together with one or more other people.","zh":"（co-head 的过去式/过去分词）与他人共同领导、共同负责某事。"},"examples":[{"en":"She coheaded the research team with a senior professor.","zh":"她与一位资深教授共同领导该研究团队。"},{"en":"The new initiative was coheaded by the marketing and product directors.","zh":"这项新计划由市场总监和产品总监共同牵头。"}]},{"partOfSpeech":"adj.","definition":{"en":"jointly led; having two (or more) leaders sharing responsibility (often written “co-headed”).","zh":"共同领导的；由两位（或多位）负责人共同负责的（常写作 co-headed）。"},"examples":[{"en":"It was a coheaded project, so decisions required agreement from both leads.","zh":"这是一个共同负责的项目，所以决策需要两位负责人一致同意。"},{"en":"They formed a co-headed committee to balance perspectives.","zh":"他们成立了一个共同主席制的委员会，以平衡不同观点。"}]}],"synonyms":["co-led","jointly led","led together","shared leadership"],"phonetic":"/ˌkoʊˈhɛdɪd/","extraExplanation":["“coheaded”常见于简历、新闻或正式写作中；更常见的拼写是带连字符的“co-headed”（尤其作形容词时），例如：a co-headed team / a co-headed initiative。","相关词：co-lead（更口语/常用）、jointly lead（更正式/清晰）。如果担心读者不熟悉“co-head”，可以改写为“jointly led”或“co-led”。"]}
{"word":"coheading","summary":{"en":"“Coheading” usually means a shared heading/title for related items, or the act of jointly leading something.","zh":"“Coheading”通常指用于相关内容的共同标题/并列标题，也可指与他人共同领导（联合负责）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a shared or joint heading (title) used for two related sections, items, or topics in a document, list, or index","zh":"（文件、列表或索引中）共同标题；并列标题（用于涵盖两个相关部分/条目）"},"examples":[{"en":"The report uses a coheading for “Costs and Benefits” to keep the discussion together.","zh":"这份报告用“成本与收益”作为共同标题，把讨论放在一起。"},{"en":"Under the coheading “Safety & Training,” you’ll find both policies and workshop dates.","zh":"在共同标题“安全与培训”下，你会看到政策和培训日期。"}]},{"partOfSpeech":"v.","definition":{"en":"the act of leading or heading something together with another person (often written as co-heading in formal writing)","zh":"与他人共同领导；联合负责（常在正式写作中写作 co-heading）"},"examples":[{"en":"She is coheading the new project with the marketing director.","zh":"她正在与市场总监共同领导这个新项目。"},{"en":"Coheading the committee requires good communication and clear roles.","zh":"共同负责委员会需要良好沟通和明确分工。"}]}],"synonyms":["joint heading","shared heading","umbrella heading","co-lead","co-chair"],"phonetic":"/koʊˈhɛdɪŋ/","extraExplanation":["在排版、目录（table of contents）和索引（index）里，coheading 常用来指“一个标题统摄两个并列主题”，相当于把相关内容放在同一“伞形标题”下，便于读者查找与理解。","拼写上常见 co-heading（带连字符）与 coheading（不带连字符）两种形式；学术/出版语境里带连字符更常见。"]}
{"word":"coheads","summary":{"en":"Coheads are people who share leadership as joint heads of a group or project.","zh":"coheads 指共同担任某团队或项目负责人的人（联合主管）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who share the top leadership role of a group, department, or project (joint heads)","zh":"共同负责人；联合主管（共同担任某团队/部门/项目最高领导职责的人）"},"examples":[{"en":"The lab has two coheads who divide responsibilities for research and funding.","zh":"这个实验室有两位共同负责人，他们分担科研和经费方面的职责。"},{"en":"She was appointed one of the coheads of the new product team.","zh":"她被任命为新产品团队的共同负责人之一。"}]}],"synonyms":["co-heads","co-leaders","joint heads","co-leads","co-chairs"],"phonetic":"/ˈkoʊˌhɛdz/","extraExplanation":["“coheads”通常写作 **co-heads**（更常见）或 **coheads**（较少见），意思是两人或多人“共同担任负责人”。","在组织语境里也常用 **co-chair(s)**（共同主席）或 **co-lead(s)**（共同带领者/负责人），语气更口语或更常见。"]}
{"word":"coheartedness","summary":{"en":"Coldheartedness means being cruel or lacking sympathy.","zh":"Coldheartedness 指“冷酷无情、缺乏同情心”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being unkind, uncaring, or lacking sympathy for others’ feelings","zh":"冷酷无情；缺乏同情心（对他人的感受漠不关心）"},"examples":[{"en":"People were shocked by his coldheartedness after the accident.","zh":"事故发生后，他的冷酷无情让人们很震惊。"},{"en":"Her coldheartedness made it hard for others to trust her.","zh":"她的冷酷让别人很难信任她。"}]}],"synonyms":["cruelty","heartlessness","callousness","ruthlessness"],"phonetic":"/ˈkoʊldˌhɑrdɪdnəs/","extraExplanation":["“coheartedness”并不是常见英文单词。你可能想写的是 **coldheartedness**（冷酷无情），也可能是 **wholeheartedness**（全心全意、真诚投入）。如果你告诉我你想表达的中文意思或提供一句原句，我可以帮你确认最合适的词。","构词上，**cold-hearted**（冷的心）是形容词，表示“冷酷的”；加上名词后缀 **-ness** 变成名词 **coldheartedness**，表示“冷酷（这种特质）”。"]}
{"word":"coheir","summary":{"en":"A coheir is someone who inherits something together with others.","zh":"coheir 指与他人一起继承财产或权利的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who inherits or has a legal right to inherit something together with one or more other people","zh":"（与他人）共同继承人；共继承人"},"examples":[{"en":"After their mother died, the two sisters became coheirs to the family home.","zh":"母亲去世后，两姐妹成为那套祖宅的共同继承人。"},{"en":"The will named three coheirs, each receiving one-third of the estate.","zh":"遗嘱指定了三位共同继承人，每人继承遗产的三分之一。"}]}],"synonyms":["joint heir","co-inheritor","heir (general)"],"phonetic":"/ˈkoʊ.her/","extraExplanation":["“co-”表示“共同、一起”。因此 coheir 强调“与别人一起继承”，在法律、遗嘱、财产分配等语境中更常见。","在日常英语里，人们更常用 “joint heirs / heirs” 来表达；coheir 比较正式、偏法律用语。"]}
{"word":"coheiress","summary":{"en":"A coheiress is a woman who shares an inheritance with others.","zh":"coheiress 指与他人共同继承遗产的女性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female co-heir; a woman who shares an inheritance with one or more other people","zh":"女共同继承人；与他人共同分得遗产的女性"},"examples":[{"en":"After their father died, the two sisters became coheiresses to the estate.","zh":"父亲去世后，两姐妹成了这份遗产的共同继承人。"},{"en":"She was named coheiress along with her brother in the will.","zh":"遗嘱中写明她与哥哥为共同继承人。"}]}],"synonyms":["co-heiress","female co-heir","coheir (gender-neutral)"],"phonetic":"/ˌkoʊˈhɛrəs/","extraExplanation":["“coheiress”由前缀 co-（共同、一起）+ heiress（女继承人）构成，常见于法律文件、家族财产分配以及历史/文学语境中。日常口语里更常说 “one of the heirs（继承人之一）” 或 “she shares the inheritance（她分得一部分遗产）”。","在英美传统中，“heiress”有时也带有社会文化色彩，暗示“继承了大量财产的女性”，因此在小说或历史叙述里常用于描写家族财富、婚姻与社会地位的关系。"]}
{"word":"coheiresses","summary":{"en":"Coheiresses are women who inherit something together as joint heirs.","zh":"coheiresses 指“共同继承人（女性复数）”，即多位女性作为共同继承者一起继承财产或头衔。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Women who inherit property or a title together (each one is a co-heiress).","zh":"共同继承人（女性复数）：指两位或多位女性一起继承同一份财产、地产或头衔；每个人都是一位“共同女继承人”。"},"examples":[{"en":"The estate was divided equally among the three coheiresses.","zh":"这份产业被平均分给了三位共同女继承人。"},{"en":"In the novel, the sisters become coheiresses after their father’s death.","zh":"在小说里，父亲去世后姐妹俩成了共同女继承人。"}]}],"synonyms":["joint heiresses","co-heiresses"],"phonetic":"/ˌkoʊˈɛrəsɪz/","extraExplanation":["“coheiress”常见于英国历史、家族谱系和法律/地产语境，尤其是在没有男性继承人时，女儿们可能作为共同继承人分得土地或权利。英语里也常写作“co-heiress”（带连字符）。","在一些旧式用法中，“heiress/coheiress”有时会带有“拥有可观财产的女性”的社会含义；现代英语更倾向把它当作中性法律/继承术语来使用。"]}
{"word":"coheirs","summary":{"en":"Coheirs are people who share an inheritance together.","zh":"coheirs 指共同继承同一份遗产（或权利）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who inherit something together (shared heirs), often the same estate or property","zh":"共同继承人；一起继承同一份遗产/财产的人"},"examples":[{"en":"After their mother died, the three siblings became coheirs to the family house.","zh":"母亲去世后，三兄妹成了祖宅的共同继承人。"},{"en":"The will named his two daughters as coheirs of the business.","zh":"遗嘱指定他的两个女儿为公司资产的共同继承人。"},{"en":"The coheirs agreed to sell the land and split the money equally.","zh":"共同继承人同意卖掉那块地并平分款项。"}]}],"synonyms":["joint heirs","co-heirs","heirs (in common)"],"phonetic":"/koʊˈerz/","extraExplanation":["“co-”表示“共同、一起”。“coheir”常见于法律与遗产语境（如遗嘱、继承权、遗产分配）。在正式写法中也常见连字符形式“co-heir(s)”。","在一些宗教或文学语境里，coheirs 也可比喻“共同分享某种权利/命运的人”（例如“coheirs of the kingdom”意为“共同承受/共享天国的人”），但日常最常用的还是“共同继承人”。"]}
{"word":"coheirship","summary":{"en":"Coheirship means joint inheritance—the condition of being coheirs who share an estate or property.","zh":"coheirship 指共同继承：多人作为共同继承人共享遗产或财产的状态/关系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or relationship of being a coheir; joint inheritance with one or more other people.","zh":"共同继承（与他人一起成为继承人）的状态或关系。"},"examples":[{"en":"After their father died, the siblings entered coheirship and shared the estate.","zh":"父亲去世后，兄弟姐妹成为共同继承人，一起分配遗产。"},{"en":"The will created coheirship among the three children.","zh":"遗嘱让三个孩子成为共同继承人。"}]}],"synonyms":["joint inheritance","coheir status","shared inheritance"],"phonetic":"/ˌkoʊˈɛrˌʃɪp/","extraExplanation":["这个词比较少见，常见于法律或正式文书语境。更常用的说法是“co-ownership of an inheritance（对遗产的共同拥有）”或直接说“they are coheirs（他们是共同继承人）”。","词形上：co-（共同）+ heir（继承人）+ -ship（表示“身份/状态/关系”的名词后缀，如 friendship 友谊、membership 会员身份）。"]}
{"word":"cohelper","summary":{"en":"“Cohelper” means a fellow helper—someone who helps together with others.","zh":"“cohelper”指共同帮忙的人，即与他人一起协助的帮手。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who helps someone together with one or more other people; a fellow helper or co-worker (not very common; often written as “co-helper”).","zh":"与他人一起帮忙的人；共同协助者、同伴帮手（不太常见，常写作“co-helper”）。"},"examples":[{"en":"Thanks to my cohelper, we finished the event setup in an hour.","zh":"多亏了我的共同帮手，我们一小时就把活动布置完成了。"},{"en":"She asked a cohelper to hold the ladder while she fixed the sign.","zh":"她请一位共同协助者扶着梯子，好让她修好招牌。"}]}],"synonyms":["co-helper","fellow helper","assistant","helper","co-worker"],"phonetic":"/koʊˈhɛlpɚ/","extraExplanation":["“co-”是英语里很常见的前缀，意思是“共同、一起”（例如: co-worker 同事, co-founder 共同创办人）。因此 cohelper 字面意思就是“共同帮忙的人”。在正式写作中更常用 co-worker / assistant / helper，或用连字符写作 co-helper。"]}
{"word":"cohelpership","summary":{"en":"Cohelpership means shared help or a joint helper role; it is uncommon in everyday English.","zh":"cohelpership 指共同帮助或共同担任帮助者的关系/角色；在日常英语中较少见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state, role, or arrangement of helping someone together with one or more other people; shared support or assistance (an uncommon word).","zh":"与他人共同帮助某人（或某项工作）的状态、角色或安排；共同协助（较少见的词）。"},"examples":[{"en":"In the project, her cohelpership with the senior designer made the deadline possible.","zh":"在这个项目中，她与资深设计师的共同协助让按期完成成为可能。"},{"en":"The organization depends on cohelpership—experienced volunteers guiding newcomers.","zh":"这个组织依靠“共同协助”——有经验的志愿者带领新加入的人。"}]}],"synonyms":["collaboration","partnership","teamwork","support"],"phonetic":"/ˌkoʊˈhɛlpərʃɪp/","extraExplanation":["“cohelpership”在现代英语中非常少见，更常见的表达是“collaboration（合作）”“support（支持）”“partnership（伙伴关系）”或更具体的“co-leadership（共同领导）/teamwork（团队合作）”。","这个词的构词方式是 co-（共同）+ helper（帮助者）+ -ship（表示“身份/状态/关系”，如 friendship 友谊、leadership 领导力）。因此它强调的是“共同作为帮助者的关系/状态”。","在宗教或团体事工语境里，偶尔会用来指“同工关系/共同服事”的概念；正式写作中建议改用更常见的词以避免读者困惑。"]}
{"word":"Coheman","summary":{"en":"“Coheman” is not a standard English word; it’s likely a misspelling or a proper name.","zh":"“Coheman”不是标准英语词汇；更可能是拼写错误或专有名词（如人名）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a name.","zh":"不是标准英语单词，可能是拼写错误或人名。"},"examples":[{"en":"I couldn’t find “coheman” in a standard English dictionary—did you mean “coherent” or “cohesion”?","zh":"我在常见英语词典里找不到“coheman”——你是不是想写“coherent（连贯的）”或“cohesion（凝聚力）”？"}]}],"phonetic":"/koʊˈhimæn/","extraExplanation":["“cohe-”常让人联想到 cohesion（凝聚力）、cohesive（有凝聚力的）、coherent（连贯的、条理清晰的）。如果你能提供一句包含该词的原句，或说明是人名/地名/品牌名，我可以更准确地解释。"]}
{"word":"Cohen","summary":{"en":"Cohen is a Jewish-origin surname and can also refer to a Jewish priest (kohen) in religious contexts.","zh":"Cohen 是一个源自犹太文化的姓氏，也可在宗教语境中指犹太教祭司（kohen）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surname of Jewish origin, historically linked to the priestly class (Kohanim) in Judaism.","zh":"一个源自犹太文化的姓氏，历史上常与犹太教的祭司阶层（Kohanim）有关。"},"examples":[{"en":"Mr. Cohen moved to Chicago for work.","zh":"科恩先生因为工作搬到了芝加哥。"},{"en":"Many people with the surname Cohen have Jewish family roots.","zh":"许多姓 Cohen 的人都有犹太家族渊源。"}]},{"partOfSpeech":"n.","definition":{"en":"A term used to refer to a Jewish priest (a Kohen), especially in religious or historical contexts.","zh":"（多用于宗教或历史语境）指犹太教的祭司（Kohen）。"},"examples":[{"en":"In the ceremony, a kohen (sometimes written as Cohen) recited a blessing.","zh":"在仪式中，一位 kohen（有时也写作 Cohen）诵读了祝福。"}]}],"synonyms":["Kohen"],"phonetic":"/ˈkoʊən/","extraExplanation":["“Cohen”来自希伯来语“kohen”（意为“祭司”）。在犹太传统中，Kohanim 被认为是古代祭司亚伦（Aaron）的后裔，因此这个姓氏常带有家族与宗教身份的历史含义。","拼写变体很常见，例如：Cohen、Kohen、Kohn、Cohn。不同地区、不同移民记录会导致拼写差异。","在英语文化中，“Cohen”也是不少名人的姓，例如加拿大歌手兼诗人 Leonard Cohen；但作为词汇本身，它主要是专有名词（姓氏/身份称呼）。"]}
{"word":"cohen","summary":{"en":"Cohen is a common Jewish surname, historically associated with priestly lineage; it can also refer to famous people with that name (e.g., Leonard Cohen).","zh":"Cohen是常见的犹太姓氏，历史上与祭司家族血统有关；也可用来指叫Cohen的著名人物（如莱昂纳德·科恩）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a common Jewish surname, originally linked to families traditionally believed to descend from the biblical priestly class (kohanim)","zh":"一个常见的犹太姓氏，历史上常与传统上被认为源自《圣经》祭司阶层（kohanim）的家族有关"},"examples":[{"en":"Ms. Cohen is our new history teacher.","zh":"Cohen女士是我们的新历史老师。"},{"en":"Many people with the surname Cohen have Jewish heritage.","zh":"许多姓Cohen的人有犹太背景。"}]},{"partOfSpeech":"n.","definition":{"en":"a particular person named Cohen (often used to refer to a well-known figure), e.g., Leonard Cohen, the Canadian singer-songwriter and poet","zh":"名为Cohen的某个人（常用来指著名人物），例如加拿大创作歌手、诗人莱昂纳德·科恩（Leonard Cohen）"},"examples":[{"en":"I’ve been listening to Leonard Cohen’s music lately.","zh":"我最近一直在听莱昂纳德·科恩的音乐。"},{"en":"In class, we read a poem by Cohen.","zh":"课上我们读了一首科恩的诗。"}]}],"phonetic":"/ˈkoʊən/","extraExplanation":["“Cohen”来自希伯来语“kohen”（意为“祭司”）。在犹太传统中，“Kohen/Cohen”与祭司家族（复数：kohanim）有关，因此它既是姓氏，也带有文化与宗教背景。常见拼写变体包括：Cohn、Kohn、Kogan 等。"]}
{"word":"cohenite","summary":{"en":"Cohenite is a rare iron-carbide mineral (Fe₃C), best known from iron meteorites; it’s essentially natural cementite.","zh":"Cohenite（柯亨石）是一种罕见的铁碳化物矿物（Fe₃C），常见于铁陨石；本质上是天然的渗碳体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral made of iron carbide (Fe₃C), found especially in iron meteorites and sometimes in very iron-rich rocks; essentially a naturally occurring form of cementite.","zh":"一种罕见矿物，为铁的碳化物（Fe₃C），主要见于铁陨石中，也可出现在富铁岩石里；本质上相当于“天然的渗碳体（cementite）”。"},"examples":[{"en":"Scientists identified cohenite grains inside an iron meteorite sample.","zh":"科学家在一块铁陨石样品中鉴定出了柯亨石（cohenite）颗粒。"},{"en":"The presence of cohenite suggests the material formed under very reducing conditions rich in iron and carbon.","zh":"柯亨石的存在通常暗示该物质在富铁、富碳且强还原的条件下形成。"}]}],"synonyms":["cementite","iron carbide"],"phonetic":"/ˈkoʊənaɪt/","extraExplanation":["“cohenite”一词来自人名 Cohen（科恩），用来纪念与陨石研究相关的学者；它在地球上较少见，在陨石学与行星科学中更常被提到。","在材料/冶金语境里，你可能更常看到近义词“cementite（渗碳体）”。不过“cohenite”通常强调它作为天然矿物（尤其来自陨石）的身份。"]}
{"word":"Cohens","summary":{"en":"“Cohens” usually means people with the last name Cohen; in some contexts it can also refer to multiple members of the Jewish priestly line (more often called “Kohanim”).","zh":"“Cohens”通常指姓 Cohen 的人；在某些语境中也可指多个犹太祭司家族后裔（更常用“Kohanim”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of Cohen: people with the surname Cohen (a common Jewish family name).","zh":"Cohen 的复数：指姓氏为 Cohen 的人（常见的犹太姓）。"},"examples":[{"en":"Two Cohens live in our apartment building.","zh":"我们公寓楼里住着两位姓 Cohen 的人。"},{"en":"The Cohens are coming over for dinner tonight.","zh":"Cohen 一家今晚会来吃晚饭。"}]},{"partOfSpeech":"n.","definition":{"en":"(Also written as “Cohens”) A way to refer to multiple members of the Jewish priestly line traditionally called Kohanim (plural of Kohen), though English more often uses “Kohanim.”","zh":"（也可写作 Cohens）指多个传统上称为 Kohanim（Kohen 的复数）的犹太祭司家族后裔；不过英语里更常用 “Kohanim”。"},"examples":[{"en":"In some communities, the Cohens have specific roles in certain blessings.","zh":"在一些社群中，祭司后裔（Cohens/Kohanim）在某些祝福仪式里有特定角色。"},{"en":"The museum exhibit explained the history of the Kohanim (sometimes called “Cohens” in English).","zh":"博物馆展览介绍了 Kohanim（英语里有时也称作“Cohens”）的历史。"}]}],"synonyms":["the Cohen family","Kohanim"],"phonetic":"/ˈkoʊənz/","extraExplanation":["“Cohen”源自希伯来语“kohen（祭司）”。作为姓氏时非常常见，不一定表示本人严格属于祭司家族谱系；在宗教语境中谈到祭司家族时，更标准的英文复数常写作“Kohanim”。","拼写上还常见变体：Cohn, Coen, Kohn 等。使用时注意：这是族裔/宗教相关称呼，最好根据对方自称或具体语境选择用词。"]}
{"word":"cohens","summary":{"en":"“Cohens” is the plural of “Cohen,” meaning either people with the surname Cohen or (in Jewish contexts) members of a priestly lineage.","zh":"“Cohens”是“Cohen”的复数，可指姓 Cohen 的人，也可在犹太传统语境中指祭司世系成员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of Cohen: people with the surname Cohen (members of the Cohen family).","zh":"Cohen 的复数：姓 Cohen 的人（Cohen 家族成员）。"},"examples":[{"en":"Two Cohens live next door, but they aren’t related to us.","zh":"隔壁住着两位姓 Cohen 的人，但他们和我们没有亲戚关系。"},{"en":"The Cohens invited us over for dinner.","zh":"Cohens 一家邀请我们去吃晚饭。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of Cohen (also spelled Kohen): members of the Jewish priestly lineage in Judaism.","zh":"Cohen（也拼作 Kohen）的复数：犹太教中被认为属于祭司世系的人（祭司家族成员）。"},"examples":[{"en":"In some communities, Cohens have certain traditional roles in synagogue services.","zh":"在一些社群里，Cohens 在会堂礼拜中有一些传统角色。"},{"en":"He was told his family were Cohens and kept that tradition in mind.","zh":"他被告知自己家族属于 Cohens，并一直记着这份传统。"}]}],"synonyms":["Kohanim (Jewish-context term)"],"phonetic":"/ˈkoʊənz/","extraExplanation":["“Cohen”在英语里既常见作姓氏（如作家 Leonard Cohen），也与犹太传统有关：希伯来语中相当于“祭司”。在宗教语境中，Cohens 常与“Kohanim（祭司们）”相关；但在日常生活里，你更多会看到它只是一个普通姓氏。","拼写提示：如果你看到“Cohen’s”，那是所有格，表示“Cohen 的/科恩的”（例如：Cohen’s book）。而“Cohens”通常表示复数“姓 Cohen 的人”。"]}
{"word":"coherald","summary":{"en":"A rare word meaning a fellow herald, or to act as a herald together with someone else.","zh":"较少见：指“同任传令官”，也可作动词表示“与他人共同担任传令官”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fellow herald; a person who serves together with another herald, especially in ceremonies or matters of coats of arms.","zh":"（尤指典礼或纹章事务中的）同任传令官；与另一位传令官一起任职的人。"},"examples":[{"en":"Two coheralds announced the procession at the coronation ceremony.","zh":"两位同任传令官在加冕典礼上宣布了游行队伍的出场。"},{"en":"The document was verified by the king of arms and his coherald.","zh":"这份文件由最高纹章官及其同任传令官核验。"}]},{"partOfSpeech":"v.","definition":{"en":"to serve or act as a herald jointly with someone else.","zh":"与他人共同担任（或履行）传令官的职责。"},"examples":[{"en":"She coheralded the event, reading the official titles aloud.","zh":"她与他人共同担任传令官，在活动中宣读了正式头衔。"}]}],"synonyms":["fellow herald","co-announce (contextual)","joint herald (contextual)"],"phonetic":"/koʊˈhɛrəld/","extraExplanation":["“herald”在中古欧洲常指负责宣布消息、主持礼仪、以及管理与记录贵族“纹章（coat of arms）”的官员。“co-”表示“共同、一起”，因此“coherald”多见于历史、纹章学或仪式语境，属于较少见的书面用词。"]}
{"word":"cohere","summary":{"en":"Cohere means either (1) stick together physically or (2) fit together logically into a clear whole.","zh":"cohere 可指（1）物理上黏合、凝聚在一起，也可指（2）逻辑上前后一致、整体连贯。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to stick together physically; to form a unified mass","zh":"（物理上）黏在一起；凝聚成整体"},"examples":[{"en":"The wet sand will cohere if you press it firmly.","zh":"湿沙如果用力压一压，会凝聚在一起。"},{"en":"Add a little water so the mixture can cohere.","zh":"加一点水，让混合物能黏合成团。"}]},{"partOfSpeech":"vi.","definition":{"en":"to be logically consistent and make sense as a whole","zh":"（逻辑上）连贯一致；前后通顺、成整体"},"examples":[{"en":"His explanation doesn’t cohere with the evidence.","zh":"他的解释与证据对不上，前后不一致。"},{"en":"The plot begins to cohere near the end of the novel.","zh":"小说接近结尾时，情节才逐渐变得连贯起来。"}]}],"synonyms":["stick together","hold together","cling","unite","fit together","make sense","be consistent","hang together"],"phonetic":"/koʊˈhɪr/","extraExplanation":["“cohere”常用于较正式的写作或评论，尤其是谈论论证、故事结构、观点是否“连贯”。口语里也常用 “make sense” 或 “fit together”。","常见搭配：cohere with（与……一致/吻合）；cohere into（逐渐整合成……）。","词源来自拉丁语 *cohaerere*（一起黏住），相关词：cohesion（凝聚力、连贯性）、coherent（连贯的）。"]}
{"word":"cohered","summary":{"en":"“Cohered” means “stuck together” or “became logically unified,” and it’s the past form of “cohere.”","zh":"“cohered”是“cohere”的过去式/过去分词，表示“黏合在一起”或“（逻辑上）变得连贯统一”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense / past participle of “cohere”: to stick together or form a united whole (physically or figuratively).","zh":"“cohere”的过去式/过去分词：黏在一起；（事物在结构或逻辑上）连贯一致，形成整体。"},"examples":[{"en":"After heating, the mixture cohered into a smooth paste.","zh":"加热后，混合物黏合成了光滑的糊状。"},{"en":"Her ideas cohered into a clear plan by the end of the meeting.","zh":"会议结束时，她的想法整合成了清晰的计划。"},{"en":"The team cohered quickly because everyone shared the same goal.","zh":"因为大家目标一致，团队很快就凝聚起来了。"}]}],"synonyms":["stuck together","held together","unified","came together","gelled"],"phonetic":"/koʊˈhɪrd/","extraExplanation":["“cohered”常见于较正式或学术语境。日常口语里描述“想法变得有条理/连贯”，也常用：make sense, come together, fit together。","相关词：cohere（动词 原形），coherent（形容词“连贯的”），cohesion（名词“凝聚力/内聚性”），cohesive（形容词“有凝聚力的/紧密的”）。"]}
{"word":"coherence","summary":{"en":"Coherence means clear, logical unity; in science it can also mean wave/laser phase alignment.","zh":"Coherence 指条理清晰、逻辑统一的“连贯性”；在科学中也可指波/激光的“相干性”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being clear, logical, and easy to understand because all the parts fit together well (in speech, writing, or ideas).","zh":"（讲话、写作或想法的）连贯性；条理清晰、逻辑一致，整体容易理解的特质。"},"examples":[{"en":"The essay has good coherence: each paragraph supports the main idea.","zh":"这篇文章连贯性很好：每一段都在支持中心思想。"},{"en":"Her explanation lacked coherence, so the audience got confused.","zh":"她的解释缺乏连贯性，所以听众感到困惑。"}]},{"partOfSpeech":"n.","definition":{"en":"In science and technology, the property of waves (especially light/lasers) staying in step with a consistent phase, allowing strong interference effects.","zh":"（科学/技术）相干性：波（尤其是光/激光）保持稳定相位关系，从而产生明显干涉效应的性质。"},"examples":[{"en":"Lasers are useful because they produce light with high coherence.","zh":"激光很有用，因为它能产生高度相干的光。"},{"en":"The experiment depends on the coherence of the signal over time.","zh":"该实验取决于信号随时间保持相干性。"}]}],"synonyms":["clarity","consistency","unity","logic"],"phonetic":"/koʊˈhɪrəns/","extraExplanation":["在写作与口语中，coherence 常与 cohesion（衔接）一起出现：coherence 更强调“整体是否讲得通、逻辑是否一致”；cohesion 更强调“句子之间用代词、连接词、重复关键词等手段是否连接得顺”。","常见搭配：coherence in writing（写作连贯性）、maintain coherence（保持连贯）、lack coherence（缺乏连贯）。"]}
{"word":"coherences","summary":{"en":"“Coherences” is the plural of “coherence,” meaning logical clarity/connectedness (and, more technically, measures of signal/wave coherence).","zh":"“coherences”是“coherence”的复数，常指逻辑清晰与前后连贯；在技术语境下也可指多种“相干性”指标。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of coherence) the quality of being clear, logical, and well organized; how well ideas “stick together.” Example: The essay’s coherences are strong, so it’s easy to follow. / 这篇文章的“连贯性”（多方面表现）很强，所以很容易读懂。 Example: We looked at the coherences between the paragraphs. / 我们查看了各段之间的连贯性。","zh":"（coherence 的复数）指“连贯性、条理性、一致性”等品质；强调内容是否清楚、合逻辑、结构是否紧密。例：这篇文章的连贯性（多方面）很强，所以很容易读懂。例：我们查看了各段之间的连贯性。"},"examples":[{"en":"The report improved in coherences after we reorganized the sections.","zh":"我们重新调整章节后，这份报告在连贯性方面有所提升。"},{"en":"Good transitions help create coherences across the whole presentation.","zh":"好的过渡能让整场演讲更连贯。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common, technical) in physics/signal processing, different kinds or measures of “coherence,” meaning how well waves/signals stay in step (phase-related consistency). Example: The experiment compared coherences at different frequencies. / 实验比较了不同频率下的相干性（coherence）。","zh":"（较少见，偏技术）在物理/信号处理中指不同类型或指标的“相干性”，即波或信号在相位等方面保持一致的程度。例：实验比较了不同频率下的相干性。"},"examples":[{"en":"The researchers measured coherences between two brain signals.","zh":"研究人员测量了两种脑信号之间的相干性。"}]}],"synonyms":["consistencies","connections","unity","logic","cohesion"],"phonetic":"/koʊˈhɪrəns/","extraExplanation":["“coherences”在日常写作中不算常见；谈论写作或表达时，更常用不可数名词“coherence”（例如：The essay has good coherence）。但当你要强调“多种连贯方式/不同层面的连贯性”，或在学术语境中谈“多个相干指标”时，才更可能用复数“coherences”。"]}
{"word":"coherency","summary":{"en":"Coherency means clarity and logical connection in ideas or writing; it can also (less commonly) mean technical coherence in signals/waves.","zh":"coherency 指思想或文章的清晰与逻辑连贯；也可（较少见）指波/信号等的技术性“相干”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being clear, logical, and well organized; ideas “stick together” in a way that makes sense","zh":"连贯性；条理性；一致性（观点或内容前后衔接清晰、合乎逻辑）"},"examples":[{"en":"The coherency of her argument made the conclusion easy to accept.","zh":"她的论证很有连贯性，所以结论让人容易接受。"},{"en":"To improve coherency, add transitions between paragraphs.","zh":"要提高连贯性，可以在段落之间加过渡句。"}]},{"partOfSpeech":"n.","definition":{"en":"(technical, less common) the quality of waves or signals being in phase and forming a stable pattern; coherence","zh":"（技术用语，较少见）相干性；相位一致性（波或信号保持稳定的相位关系）"},"examples":[{"en":"Engineers tested the coherency of the laser beam.","zh":"工程师测试了激光束的相干性。"}]}],"synonyms":["coherence","consistency","logical flow","clarity"],"phonetic":"/koʊˈhɪrənsi/","extraExplanation":["在现代英语里，表示“连贯性/一致性”时更常用的是 **coherence**；**coherency** 也正确，但更偏正式或较少见。写作课里通常会讲 **coherence**（篇章连贯）和 **cohesion**（衔接手段，如代词、连接词）这两个概念：coherence 更强调“意思是否顺”、cohesion 更强调“语言形式如何连接”。"]}
{"word":"coherent","summary":{"en":"“Coherent” means logically connected and easy to follow, or (of a person/speech) able to think and speak clearly.","zh":"“coherent”表示“连贯、合乎逻辑、容易理解”，也可指（人/言语）“清醒且表达有条理”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Logical and consistent; easy to understand because the parts fit together well.","zh":"连贯的；合乎逻辑且一致的；因为各部分衔接得当而容易理解。"},"examples":[{"en":"She gave a coherent explanation of what happened.","zh":"她对发生的事情做出了连贯清楚的解释。"},{"en":"Your essay is clear, but it needs a more coherent structure.","zh":"你的文章很清楚，但结构需要更连贯。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of speech or a person) Able to think clearly and speak in an organized way, especially after confusion or illness.","zh":"（指言语或人）能清晰思考并有条理地表达，尤其指从混乱或生病后恢复清醒。"},"examples":[{"en":"After a few minutes, he became coherent enough to answer questions.","zh":"过了几分钟，他清醒到足以回答问题。"},{"en":"The witness was coherent and detailed in her testimony.","zh":"证人的证词条理清楚、细节充分。"}]}],"synonyms":["logical","consistent","clear","well-organized","connected"],"phonetic":"/koʊˈhɪrənt/","extraExplanation":["“coherent”常和“incoherent（语无伦次的/不连贯的）”成对使用；写作里常见搭配有 coherent argument（连贯的论证）, coherent narrative（连贯的叙述）, coherent structure（连贯的结构）。","写作建议：想让文章更coherent，可以用清晰的主题句、过渡词（however, therefore, for example）和一致的时态/观点来增强衔接。","文学/正式写作中，“coherent”常用来评价思想或叙事是否“成体系”，例如：a coherent vision（一个自洽的愿景/构想）。"]}
{"word":"coherently","summary":{"en":"“Coherently” means in a clear, logical, connected way (especially when speaking or writing).","zh":"“coherently”表示以清晰、合乎逻辑、前后连贯的方式表达（尤其指说话或写作）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a clear, logical, and well-organized way, so that ideas are easy to understand and follow.","zh":"连贯地；有条理地；清晰而合乎逻辑地（使观点容易理解、容易跟上）。"},"examples":[{"en":"She explained the plan coherently, step by step.","zh":"她把计划讲得很连贯，一步一步说明。"},{"en":"To write coherently, connect your sentences with clear transitions.","zh":"想写得连贯，要用清楚的过渡把句子连接起来。"},{"en":"He was tired but still spoke coherently during the interview.","zh":"他很累，但在采访中仍然说得很清楚、很有条理。"}]}],"synonyms":["clearly","logically","consistently","articulately"],"phonetic":"/koʊˈhɪrəntli/","extraExplanation":["“coherently”来自形容词“coherent”（连贯的）。常用于描述“表达/写作/论证”是否清晰有逻辑。","常见搭配：speak coherently（说得清楚有条理）、write coherently（写得连贯）、argue coherently（论证得有逻辑）、think coherently（思路清晰）。","对比：coherently 强调“逻辑与连贯”；clearly 强调“清楚”；fluently 强调“流利（语言速度与顺畅）”，不一定有逻辑。"]}
{"word":"coherer","summary":{"en":"A coherer is an early device for detecting radio waves in the first wireless receivers.","zh":"coherer 指最早用于无线电接收的无线电波探测器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A very early radio-wave detector used in the first wireless (radio) receivers; it worked by changing its electrical resistance when radio signals were present.","zh":"一种非常早期的无线电波探测器，用于最早的无线（收音）接收机；它通过在接收到无线电信号时改变电阻来工作。"},"examples":[{"en":"Early wireless sets used a coherer to detect faint radio signals.","zh":"早期的无线电设备使用 coherer 来探测微弱的无线电信号。"},{"en":"The coherer was later replaced by more reliable detectors.","zh":"coherer 后来被更可靠的检波器所取代。"}]}],"synonyms":["radio-wave detector","wireless detector","early radio detector"],"phonetic":"/koʊˈhɪrər/","extraExplanation":["coherer 常出现在无线电史与电报史的资料里，属于19世纪末到20世纪初的技术名词。它与法国科学家 Édouard Branly（布朗利）和无线电先驱 Guglielmo Marconi（马可尼）的早期实验常被一起提到。","其基本结构通常是装有金属屑（metal filings）的玻璃管；无线电信号会让金属屑“更容易导电”（电阻下降），从而让电路产生可检测的变化。使用后往往需要“敲击”使金属屑恢复到原来的状态，因此在实际操作上不够稳定。"]}
{"word":"coherers","summary":{"en":"“Coherers” most commonly means early radio-wave detectors (plural of coherer), a historical term in wireless communication.","zh":"“Coherers”通常指早期无线电通信中使用的电波探测器（coherer 的复数），属于历史/技术用语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of coherer: an early radio-wave detector used in the first wireless (radio) receivers, usually a small tube of metal filings whose electrical resistance changed when radio signals arrived.","zh":"coherer 的复数：早期无线电接收机中使用的一种电波探测器，常见结构是装有金属屑的小管子，受到无线电信号影响时电阻会发生变化，从而把信号“检测”出来。"},"examples":[{"en":"Early radio experimenters used coherers to detect Morse code signals.","zh":"早期的无线电实验者用 coherers 来检测摩尔斯电码信号。"},{"en":"The museum display shows coherers from the late 1800s and explains how they worked.","zh":"博物馆展柜展示了 19 世纪末的 coherers，并解释了它们的工作原理。"}]},{"partOfSpeech":"n.","definition":{"en":"Less common: things or people that cohere (stick together or form a unified whole).","zh":"较少见：指能够“凝聚/连贯在一起”的事物或人（即彼此结合或形成统一整体的东西/人）。"},"examples":[{"en":"In this metaphor, the team members are the coherers that hold the project together.","zh":"在这个比喻里，团队成员是让项目凝聚在一起的“coherers”。"}]}],"synonyms":["radio detectors","wireless detectors","coherer tubes"],"phonetic":"/koʊˈhɪrərz/","extraExplanation":["coherer 主要出现在无线电早期历史中（19 世纪末到 20 世纪初）。它常由金属屑（如铁屑、镍屑）构成，接收到电波时金属屑会“更容易导电”（电阻降低），从而让电报信号被检测出来。使用后往往需要轻敲使金属屑恢复原状，因此一些装置会配有自动“敲击器”(decoherer)。","词源上与动词 cohere（连贯、凝聚）有关：coherer 的命名来自“金属屑在电波作用下变得更‘凝聚/导通’”这一现象。"]}
{"word":"coheres","summary":{"en":"“Cohere(s)” means to stick together physically or to be logically consistent as a whole.","zh":"“coheres”表示（物理上）黏合/凝聚在一起，或（思想、论述、情节等）逻辑连贯、整体一致。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"sticks together; forms a united whole","zh":"黏在一起；凝聚成一个整体"},"examples":[{"en":"The wet sand coheres and is easy to shape into a castle.","zh":"湿沙会凝聚在一起，很容易堆成沙堡。"},{"en":"Add a little water so the mixture coheres.","zh":"加一点水，让混合物更容易黏合成团。"}]},{"partOfSpeech":"vi.","definition":{"en":"is logically connected and makes sense as a whole","zh":"前后逻辑连贯；整体上说得通"},"examples":[{"en":"Her argument coheres, even if I don’t fully agree with it.","zh":"她的论点逻辑是连贯的，即使我不完全同意。"},{"en":"The plot coheres better after the final chapter.","zh":"读完最后一章后，情节更连贯了。"}]}],"synonyms":["stick together","hold together","cling","coincide","fit together","make sense"],"phonetic":"/koʊˈhɪrz/","extraExplanation":["“coheres”是动词“cohere”的第三人称单数现在时（he/she/it coheres）。常见搭配：cohere with（与……一致/连贯）、cohere into（凝聚成……）。","和“adhere”相比：adhere更强调“贴/附着在表面上”或“遵守规则”（adhere to a rule）；cohere更强调“内部凝聚成整体”或“逻辑上连成一体”。"]}
{"word":"coheretic","summary":{"en":"Coheretic is a rare word meaning a fellow heretic or someone sharing the same heretical beliefs.","zh":"coheretic 是个罕见词，指“同为异端者”，或（少见作形容词）“同持异端观点的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person considered a fellow heretic; someone who shares the same (supposedly) heretical beliefs as another person","zh":"同为异端者；（被认为）持有同样“异端”信仰的人"},"examples":[{"en":"In the pamphlet, he attacked his former friends as coheretics.","zh":"在那本小册子里，他把以前的朋友攻击成“同为异端者”。"},{"en":"She was labeled a coheretic simply for agreeing with the reformers.","zh":"她只是赞同改革者，就被贴上“同为异端者”的标签。"}]},{"partOfSpeech":"adj.","definition":{"en":"sharing the same heretical beliefs (rare)","zh":"（罕见）同持异端观点的"},"examples":[{"en":"They were accused of coheretic teachings.","zh":"他们被指控传播同属“异端”的教义。"}]}],"synonyms":["fellow heretic","heretical ally","dissenter (near)","nonconformist (near)"],"phonetic":"/ˌkoʊˈhɛrətɪk/","extraExplanation":["这个词很少见，多出现在宗教争论、历史文献或带批判色彩的写作里。它由 co-（“共同、一起”）+ heretic（“异端者”）组成，意思接近“同伙/同道的异端”。现代英语里更常用 fellow heretic、like-minded heretic，或在中性语境下改用 dissenter（持不同意见者）、nonconformist（不墨守成规者）等更不带宗教审判意味的词。"]}
{"word":"cohering","summary":{"en":"Cohering means sticking together as a whole, or (of ideas) fitting together logically and forming a clear, unified message.","zh":"cohering 指（物理上）黏在一起形成整体，或（思想/表达上）前后一致、连贯成体系。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(present participle of cohere) sticking together physically; clinging as a mass.","zh":"（cohere 的现在分词）在物理上黏在一起；作为整体聚在一起、不散开。"},"examples":[{"en":"The wet sand was cohering, so we could build a small wall.","zh":"湿沙子能黏在一起，所以我们能堆一堵小墙。"},{"en":"The rice wasn’t cohering well, so it fell apart when I tried to shape it.","zh":"米饭不太黏成团，所以我想捏成形时就散了。"}]},{"partOfSpeech":"vi.","definition":{"en":"(present participle of cohere) fitting together logically; being consistent and forming a clear whole (of ideas, arguments, or stories).","zh":"（cohere 的现在分词）（观点/论证/故事）前后一致、合乎逻辑，能形成清晰整体。"},"examples":[{"en":"Her explanation is cohering now that we know the timeline.","zh":"现在我们知道时间线了，她的解释就前后一致了。"},{"en":"The essay is cohering better after you add a clearer topic sentence.","zh":"你加上更清晰的主题句后，这篇文章整体更连贯了。"},{"en":"The team’s plan is cohering into a simple, workable strategy.","zh":"团队的计划正在整合成一个简单可行的策略。"}]},{"partOfSpeech":"adj.","definition":{"en":"forming a unified, connected whole; coherent.","zh":"形成统一、连贯整体的；连贯的。"},"examples":[{"en":"We need a cohering theme to connect the different chapters.","zh":"我们需要一个能把不同章节串起来的主线主题。"},{"en":"A cohering message helps people understand what you truly mean.","zh":"一个连贯的信息能帮助人们理解你真正的意思。"}]}],"synonyms":["sticking together","clinging","holding together","uniting","consistent","connected","coherent"],"phonetic":"/koʊˈhɪrɪŋ/","extraExplanation":["“cohere”常用在两种语境：①物理上“黏/聚在一起”（类似 but not the same as “adhere” 更强调“粘在某个表面上”）；②逻辑上“前后一致、成体系”（写作里很常见：ideas cohere）。名词是 “cohesion”（凝聚力/连贯性），形容词是 “coherent”（连贯的）。"]}
{"word":"coheritage","summary":{"en":"Coheritage means heritage shared by multiple groups or places.","zh":"coheritage 指多个群体或地区共同拥有的（文化）遗产。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"shared cultural heritage that belongs to two or more groups, communities, or nations","zh":"（两个或多个群体、社区或国家）共同拥有的文化遗产；共享遗产"},"examples":[{"en":"The museum exhibition focused on the coheritage of coastal communities around the sea.","zh":"这场博物馆展览聚焦于环海沿岸社区的共同遗产。"},{"en":"Food and music can be part of our coheritage, even if we speak different languages.","zh":"即使我们说不同语言，食物和音乐也可能是我们的共享遗产的一部分。"}]}],"synonyms":["shared heritage","common heritage","joint heritage","collective heritage"],"phonetic":"/ˌkoʊˈhɛrɪtɪdʒ/","extraExplanation":["“coheritage”由前缀 co-（共同、一起）+ heritage（遗产）构成，意思直观，但在日常英语里并不算常用，更常见的表达是“shared heritage”或“common heritage”。","该词多见于文化研究、博物馆学、遗产保护、国际合作等语境，用来强调遗产不只属于单一国家或族群，而是跨边界、跨社群共同形成与共享的。"]}
{"word":"coheritor","summary":{"en":"A coheritor is someone who inherits something together with others (a co-heir).","zh":"coheritor 指与他人共同继承遗产的人（共同继承人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who inherits something together with one or more other people; a co-heir","zh":"与他人共同继承遗产的人；共同继承人"},"examples":[{"en":"After their mother died, the two sisters became coheritors of the house.","zh":"母亲去世后，两姐妹成了那栋房子的共同继承人。"},{"en":"As a coheritor, he had to sign the papers before the property could be sold.","zh":"作为共同继承人，他必须签署文件后房产才能出售。"}]}],"synonyms":["co-heir","joint heir","co-inheritor"],"phonetic":"/ˌkoʊˈhɛrɪtər/","extraExplanation":["“coheritor”多见于法律或较正式的书面语，日常英语里更常用“co-heir”或“joint heir”。","构词上由前缀“co-”（共同）+ “heir/herit-”（继承）组成，含义直观：与他人一起继承。"]}
{"word":"cohert","summary":{"en":"Cohort means a group of people, especially one defined by shared characteristics or the same time period.","zh":"Cohort 指一群人，尤指在同一时期内共享某种特征或经历的群体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group of people who share a common characteristic or experience within a particular time period (often used in education, medicine, and social science)","zh":"在同一时期内共享某种特征或经历的一群人（常用于教育、医学与社会科学）"},"examples":[{"en":"The study followed a cohort of 500 students from middle school to college.","zh":"这项研究跟踪了500名学生的一个队列，从初中一直到大学。"},{"en":"Patients in the older cohort showed different symptoms than the younger group.","zh":"较年长队列的患者表现出的症状与较年轻组不同。"}]},{"partOfSpeech":"n.","definition":{"en":"a group of people who do something together or are closely connected","zh":"一起行动或关系密切的一群人；同伴群体"},"examples":[{"en":"She arrived at the meeting with a cohort of colleagues.","zh":"她和一群同事一起到达了会议现场。"},{"en":"He was surrounded by his cohorts on the team.","zh":"他被队友同伴们围在中间。"}]}],"synonyms":["group","class","batch","peer group","band"],"phonetic":"/ˈkoʊ.hɔrt/","extraExplanation":["你输入的“cohert”常见是拼写错误，正确拼写通常是“cohort”。","“cohort”在学术语境里很常见，尤其是“birth cohort（出生队列）”“student cohort（学生队列）”。","历史上“cohort”源自拉丁语，原指古罗马军团中的一个“步兵大队”，后来引申为“群体/同伴”。"]}
{"word":"cohesibility","summary":{"en":"Cohesibility means the ability of a substance to hold together (be cohesive).","zh":"Cohesibility 指物质“能凝聚/黏合在一起”的内聚性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the ability of parts of the same material or substance to stick together; the quality of being cohesive","zh":"（同一种物质内部的）内聚性；能黏在一起的性质"},"examples":[{"en":"Water has high cohesibility, which is why it forms round droplets on a leaf.","zh":"水的内聚性很强，所以它会在叶子上形成圆圆的水滴。"},{"en":"The cohesibility of the dough affects how well it holds together when you knead it.","zh":"面团的内聚性会影响你揉面时它能否很好地黏合在一起。"},{"en":"Scientists studied the cohesibility of the new polymer to see whether it would crack easily.","zh":"科学家研究这种新型聚合物的内聚性，以判断它是否容易开裂。"}]}],"synonyms":["cohesion","cohesiveness","internal cohesion"],"phonetic":"/koʊˌhiːzəˈbɪləti/","extraExplanation":["“cohesibility”在日常英语中不算常用，更常见的是“cohesion”（内聚力/凝聚力）或形容词“cohesive”（黏合的；有凝聚力的）。在材料科学、化学、工程等语境里会更常见。","注意区分：cohesion 指同种物质之间的吸引；adhesion 指不同物质之间的附着（如胶水粘在玻璃上）。"]}
{"word":"cohesible","summary":{"en":"“Cohesible” means able to stick together or form cohesion, often used to describe materials.","zh":"“cohesible”表示“可黏聚的、能内聚成一体的”，常用于描述材料或物质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to stick together; capable of forming cohesion (especially in materials or substances).","zh":"可黏聚的；能内聚成一体的（尤指材料或物质）。"},"examples":[{"en":"Clay is highly cohesible when it is slightly wet.","zh":"黏土在微湿时非常可黏聚。"},{"en":"For a strong brick, the particles must be cohesible under pressure.","zh":"要做出结实的砖，颗粒在压力下必须能黏聚在一起。"}]}],"synonyms":["cohesive","cohering","self-binding"],"phonetic":"/koʊˈhiːsəbəl/","extraExplanation":["“cohesible”比较少见，更常见的是“cohesive”（有凝聚力的／黏聚的）或在科学语境中用“cohesion”（内聚力）来表达。","词根来自“cohere”（黏附、连结在一起），“-ible”表示“能够……的”，所以字面意思是“能够黏在一起的”。"]}
{"word":"cohesion","summary":{"en":"Cohesion means “sticking together” as a united whole, or (in writing) the linking features that connect ideas smoothly.","zh":"cohesion指“凝聚、内聚、团结”，也指写作中通过代词、连接词等实现的“语篇衔接”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state of sticking together or forming a united whole; strong connection within a group or between parts.","zh":"凝聚（力）；内聚；（群体或各部分之间的）团结与紧密联系。"},"examples":[{"en":"Team cohesion improved after they started meeting every week.","zh":"他们开始每周开会后，团队凝聚力提高了。"},{"en":"Good cohesion between the chapters makes the book easier to follow.","zh":"章节之间良好的衔接让这本书更容易读懂。"}]},{"partOfSpeech":"n.","definition":{"en":"In writing and speaking, the use of words and structures that connect ideas smoothly (for example, pronouns, linking words, repetition, and transition phrases).","zh":"（语篇）衔接；连贯手段：通过代词、连接词、重复、过渡表达等让意思顺畅连接。"},"examples":[{"en":"Using pronouns like “it” and “they” can create cohesion in a paragraph.","zh":"用“it”“they”等代词能增强段落的衔接性。"},{"en":"The essay has clear cohesion because each sentence links to the next.","zh":"这篇文章衔接清晰，因为每句话都连接到下一句。"}]}],"synonyms":["unity","togetherness","bonding","solidarity","connectedness","textual linkage"],"phonetic":"/koʊˈhiːʒən/","extraExplanation":["“cohesion”常和“coherence（连贯）”一起出现：cohesion更偏向“表面可见的连接手段”（例如连接词、指代、重复），coherence更强调“整体是否讲得通、逻辑是否清楚”。一篇文章可能cohesion很好（连接词很多），但coherence仍然不强（论点不清晰）。","常见搭配：team/social cohesion（团队/社会凝聚力），community cohesion（社区凝聚力），textual cohesion（语篇衔接），increase/strengthen cohesion（增强凝聚力/衔接）。","词源提示：来自拉丁语cohaerere，意为“粘在一起”。理解为“把东西黏成一个整体”很直观。"]}
{"word":"cohesionless","summary":{"en":"“Cohesionless” means lacking unity or connection—physically not holding together, or logically not flowing well.","zh":"“cohesionless”指缺乏凝聚或连贯：要么东西难以黏合成一体，要么思路/结构不连贯。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Lacking cohesion; not sticking together or not forming a unified, well-connected whole (physically or in ideas/writing).","zh":"缺乏凝聚力的；不黏合的；（观点/文章）不连贯的、缺少整体性的。"},"examples":[{"en":"The essay felt cohesionless, jumping from topic to topic without clear transitions.","zh":"这篇文章显得不连贯，话题跳来跳去，缺少清晰的过渡。"},{"en":"Without a shared goal, the team became cohesionless and worked in separate directions.","zh":"没有共同目标，团队就失去凝聚力，各做各的。"},{"en":"After the sauce boiled too long, it turned grainy and cohesionless.","zh":"酱汁煮太久后变得颗粒感很重，难以融合成一体。"}]}],"synonyms":["incohesive","disjointed","fragmented","disconnected","scattered"],"phonetic":"/koʊˈhiːʒənləs/","extraExplanation":["“cohesion”常用于两类语境：①写作/演讲（连贯性、衔接）；②群体与社会（团队凝聚力）；③物理/材料（黏合、内聚）。因此“cohesionless”既可以说文章结构散乱，也可以说团队缺乏向心力。","更常见的表达有“lacking cohesion / incohesive / disjointed”。“cohesionless”本身相对少见，但含义直观。"]}
{"word":"cohesions","summary":{"en":"“Cohesions” is the plural of “cohesion,” meaning unity/sticking together in groups or the linking devices that connect ideas in writing.","zh":"“cohesions”是“cohesion”的复数，指凝聚/黏合在一起的状态，或写作中连接句子与观点的衔接手段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural form of “cohesion”: the way parts of something stick together or stay united as a group; also, the grammatical/lexical links that connect sentences and ideas in writing","zh":"“cohesion”的复数：指事物各部分黏合、结合在一起的状态；也指写作中用语法或词汇手段把句子与观点连接起来的“衔接”"},"examples":[{"en":"Strong team cohesions helped the players stay united under pressure.","zh":"强大的团队凝聚力让队员们在压力下依然团结一致。"},{"en":"In academic writing, cohesions like “however,” “therefore,” and pronouns help readers follow the argument.","zh":"在学术写作中，“however（然而）”“therefore（因此）”以及代词等衔接手段能帮助读者跟上论证思路。"}]}],"synonyms":["unity","togetherness","solidarity","bond","cohesiveness"],"phonetic":"/koʊˈhiʒən/","extraExplanation":["学习写作时常把 cohesion 和 coherence 放在一起说：cohesion 更偏“形式上的连接”（连接词、代词指代、重复关键词等），coherence 更偏“意义上的连贯”（观点组织是否清楚、逻辑是否顺）。","在科学/工程语境中，cohesion 常指材料内部分子之间的“内聚力”；而 adhesion 指不同材料之间的“附着力”。"]}
{"word":"cohesive","summary":{"en":"Cohesive means well-connected and unified, used for writing (clear flow) or groups (strong unity).","zh":"cohesive 指“连贯一致、紧密结合成整体”，常用于写作的衔接流畅或群体的团结有凝聚力。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Forming a unified whole; sticking together well in meaning, structure, or relationships.","zh":"有凝聚力的；连贯一致的；紧密结合成整体的。"},"examples":[{"en":"The team felt more cohesive after they started meeting every morning.","zh":"团队开始每天早上开会后，感觉更有凝聚力了。"},{"en":"She revised the essay to make the argument more cohesive.","zh":"她修改了文章，让论点更连贯一致。"},{"en":"Good transitions help a paragraph feel cohesive.","zh":"好的过渡句能让段落更连贯。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of a group or society) united by shared goals, values, or close connections.","zh":"（指群体或社会）因共同目标、价值观或紧密联系而团结的。"},"examples":[{"en":"A cohesive community often supports newcomers quickly.","zh":"有凝聚力的社区通常会很快支持新来的人。"},{"en":"The coach built a cohesive squad by encouraging trust.","zh":"教练通过鼓励信任打造了一支团结的队伍。"}]}],"synonyms":["unified","coherent","tight-knit","connected","integrated"],"phonetic":"/koʊˈhiːsɪv/","extraExplanation":["“cohesive”来自“cohere”（黏在一起、连贯），常用于两类语境：\n1) 写作/表达：cohesive essay/paragraph（衔接自然、逻辑顺）；\n2) 团队/人际：cohesive team/community（团结、配合默契）。\n写作中常搭配：cohesive devices（衔接手段，如代词指代、连接词、重复关键词等）。"]}
{"word":"cohesively","summary":{"en":"Cohesively means “in a connected, unified way,” especially in writing, speaking, or teamwork.","zh":"cohesively 表示“连贯地、形成统一整体地”，常用于写作表达或团队协作。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is well connected and makes a clear, unified whole (in ideas, writing, speech, or a group).","zh":"以连贯的方式；使内容（观点、文章、发言或团队）紧密相连、形成清晰统一整体地。"},"examples":[{"en":"She explained the plan cohesively, so everyone understood the main steps.","zh":"她把计划讲得很连贯，所以大家都理解了主要步骤。"},{"en":"The essay is written cohesively, with each paragraph supporting the central idea.","zh":"这篇文章写得很连贯，每一段都在支持中心观点。"},{"en":"The team worked cohesively during the emergency.","zh":"在紧急情况下，团队配合得很默契。"}]}],"synonyms":["coherently","smoothly","consistently","in a unified way"],"phonetic":"/koʊˈhiːsɪvli/","extraExplanation":["“cohesively”来自形容词“cohesive”（有凝聚力的、连贯的）。常见搭配：write/speak cohesively（写/说得连贯），work cohesively（合作默契）。","写作语境里，它强调“段落与段落之间、句子与句子之间”逻辑衔接自然；团队语境里，更接近“协同一致、配合紧密”。"]}
{"word":"cohesiveness","summary":{"en":"Cohesiveness means the quality of being tightly connected and forming a unified whole.","zh":"Cohesiveness 指各部分联系紧密、形成整体的“凝聚性/连贯性”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being well connected and forming a unified whole (in a group, text, plan, or system)","zh":"（团队、文章、计划或系统）联系紧密、浑然一体的特性；凝聚性；连贯性"},"examples":[{"en":"The cohesiveness of the team improved after they started sharing goals and giving regular feedback.","zh":"他们开始共享目标并定期反馈后，团队的凝聚性提高了。"},{"en":"Good transitions between paragraphs increase the cohesiveness of an essay.","zh":"段落之间良好的衔接能增强文章的连贯性。"},{"en":"The policy lacked cohesiveness because different departments wrote separate rules.","zh":"这项政策缺乏整体性，因为不同部门各写各的规定。"}]}],"synonyms":["cohesion","unity","togetherness","coherence"],"phonetic":"/ˌkoʊˈhiːsɪvnəs/","extraExplanation":["“Cohesiveness”来自形容词“cohesive”（有凝聚力的、连贯的），其词根与“cohere”（黏在一起、前后一致）相关。常用于写作（论证是否连贯）、组织管理（团队是否团结）、以及科学/工程（结构是否紧密）。","常见搭配：team/social cohesiveness（团队/社会凝聚力），text/argument cohesiveness（文本/论证连贯性），lack cohesiveness（缺乏整体性），improve/increase cohesiveness（提升凝聚性）。","近义词区分：cohesion更常见、更偏“凝聚/内聚”的概念（也常用于物理或社会学）；coherency/coherence更偏“逻辑清晰、前后一致”。"]}
{"word":"Cohette","summary":{"en":"“Cohette” is usually a misspelling of “coquette,” meaning a flirtatious person who enjoys attention.","zh":"“Cohette”通常是“coquette”的误拼，指爱调情、喜欢吸引注意力的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common misspelling) A person—usually a woman in traditional usage—who flirts in a playful way and enjoys attracting attention, often without serious romantic intent.","zh":"（常见拼写错误）指（传统用法多指女性）卖弄风情、爱调情、享受吸引注意力的人，往往并非认真投入感情。"},"examples":[{"en":"In the novel, she is described as a coquette who charms everyone at the party.","zh":"在小说里，她被描写成一个在派对上迷倒众人的“卖弄风情者”。"},{"en":"He mistook her friendly teasing for coquette behavior.","zh":"他把她友好的打趣误当成了卖弄风情的调情。"}]}],"synonyms":["flirt","tease","seductress"],"phonetic":"/koʊˈkɛt/","extraExplanation":["“Cohette”通常不是标准英语单词，多半是把 **coquette** 拼错了。标准拼法：**coquette**（名词）；对应形容词：**coquettish**（卖弄风情的）。","用法提醒：**coquette** 带有一定评判色彩（可能暗示轻浮或不真诚），在正式或当代语境中形容真人时要注意礼貌与场合。"]}
{"word":"cohhian","summary":{"en":"“cohhian” is not a recognized English word; it’s likely a misspelling or a proper name.","zh":"“cohhian”不是常见英语词汇；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word (likely a misspelling or a name). If you meant a different spelling, share the sentence or the intended word and I can define it.","zh":"不是标准英语单词（更可能是拼写错误或人名/地名）。如果你想表达的是另一个拼写，请提供句子或目标词，我可以帮你准确释义。"},"examples":[{"en":"I couldn’t find “cohhian” in a dictionary—could you share the full sentence?","zh":"我在词典里找不到“cohhian”——你能把完整句子发我吗？"},{"en":"Did you mean “Cochran,” “Cohen,” or “Caucasian”?","zh":"你是不是想写“Cochran”“Cohen”或“Caucasian”？"}]}],"phonetic":"/kɑːˈhiːən/","extraExplanation":["“cohhian”看起来像是键入时多按了字母（例如多了 h），或者是专有名词（人名/姓氏/网名）。最常见的处理方式是：\n1）给出你看到它的上下文句子；\n2）确认是否为人名（例如 Cohen / Cochran 等）；\n3）如果你想表达的是某个族群或形容词，也可能是对 “Caucasian（高加索人的；白种人的）” 的误拼。\n把上下文发来后，我可以根据语境给出最准确的词义、用法和例句。"]}
{"word":"cohibit","summary":{"en":"Cohabit means to live together (often as an unmarried couple), and more generally to exist together.","zh":"cohabit 指（常指未婚情侣）同居，也可泛指事物并存。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"To live together in the same home, especially in a romantic relationship without being married.","zh":"（尤指未婚情侣）同居；共同生活在同一住所。"},"examples":[{"en":"They decided to cohabit before getting married.","zh":"他们决定先同居一段时间再结婚。"},{"en":"Some couples cohabit for years.","zh":"有些情侣同居多年。"}]},{"partOfSpeech":"vi.","definition":{"en":"To exist or occur together in the same place or at the same time.","zh":"共存；并存（在同一地点或同一时间发生）。"},"examples":[{"en":"Different cultural traditions can cohabit in one city.","zh":"不同的文化传统可以在一座城市中并存。"}]}],"synonyms":["live together","share a home","coexist"],"phonetic":"/koʊˈhæbɪt/","extraExplanation":["“cohibit” 不是常见英语单词，通常是把 **cohabit** 拼错了。日常写作和考试中建议使用 cohabit。","cohabit 常见于社会新闻、法律与关系讨论中；有些地区会用 “cohabiting partner”（同居伴侣）等表达，但法律权利因国家/地区而异。"]}
{"word":"cohibition","summary":{"en":"Cohibition is a rare formal noun meaning restraint or suppression—keeping something from happening.","zh":"cohibition 是一个罕见的正式名词，意为“抑制、压制”，即阻止某事发生。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, formal) restraint or suppression; the act of keeping something from happening or being expressed.","zh":"（罕见，正式用语）抑制；禁止；压制（使某事不发生或不被表达的行为）。"},"examples":[{"en":"The policy was criticized as a cohibition of free speech.","zh":"这项政策被批评为对言论自由的压制。"},{"en":"In times of war, governments sometimes justify the cohibition of public gatherings.","zh":"在战争时期，政府有时会以安全为由限制公众集会。"}]}],"synonyms":["restraint","suppression","inhibition","prohibition","curb"],"phonetic":"/ˌkoʊ.əˈbɪʃ.ən/","extraExplanation":["“cohibition”非常罕见，多见于旧式/法律或宗教语境；现代英语更常用“inhibition”（抑制）或“prohibition”（禁止）。","词形上可联想到拉丁语词根 *-hibit*（“hold/keep back” 向后挡住），同一词根也出现在 inhibit / prohibit 中。"]}
{"word":"cohibitive","summary":{"en":"Cohibitive is a rare adjective meaning restraining or prohibiting (often better expressed by “prohibitive” in modern English).","zh":"Cohibitive 是个罕用形容词，意为“抑制的/禁止的”，现代英语里通常用 prohibitive 更自然。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Tending to restrain or stop something; serving to prohibit.","zh":"（罕用）倾向于约束或阻止某事的；起禁止作用的。"},"examples":[{"en":"Some people find the price of the course cohibitive and choose a cheaper option.","zh":"有些人觉得这门课的价格太“抑制性/阻碍性”了，于是选择了更便宜的方案。"},{"en":"Strict rules can have a cohibitive effect on creativity in the classroom.","zh":"过于严格的规定可能会对课堂创造力产生抑制性的影响。"}]},{"partOfSpeech":"adj.","definition":{"en":"(linguistics, rare) Relating to expressions that forbid an action (similar to “prohibitive,” as in negative commands).","zh":"（语言学，罕用）与“禁止做某事”的表达有关的（类似 prohibitive，用于否定命令/禁止式）。"},"examples":[{"en":"In some descriptions of grammar, a cohibitive form is used to tell someone not to do something.","zh":"在某些语法描述中，“cohibitive（禁止式）”形式用来表示让别人不要做某事。"}]}],"synonyms":["prohibitive","restrictive","inhibiting","deterrent","preventive"],"phonetic":"/koʊˈhɪbɪtɪv/","extraExplanation":["“cohibitive”非常少见，日常英语里几乎都用 **prohibitive**（禁止的；过高而让人却步的，如 prohibitive cost）。","词源上与拉丁语 **cohibēre**（抑制、约束）有关，因此它的核心含义更接近“抑制/约束”，而不是单纯的“法律禁止”。写作时若想自然地表达“太贵而让人却步”，优先用 **prohibitive**。"]}
{"word":"cohibitor","summary":{"en":"Cohibitor is a rare noun meaning something or someone that restrains or holds back.","zh":"Cohibitor 是个罕见名词，表示“抑制、约束或阻止”的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing that restrains, checks, or holds something back (rare/old-fashioned).","zh":"抑制者；约束者；阻止某事发展的人或事物（罕见/较旧用法）。"},"examples":[{"en":"In older writing, fear was described as a cohibitor of action.","zh":"在较旧的写作中，恐惧被描述为行动的抑制者。"},{"en":"Strong rules can act as a cohibitor, preventing risky behavior.","zh":"严格的规则可以起到约束作用，防止冒险行为。"}]}],"synonyms":["restrainer","deterrent","check","constraint"],"phonetic":"/koʊˈhɪbɪtɚ/","extraExplanation":["“cohibitor”非常少见，通常只在较老或较正式的文字里出现。现代英语里更常用的表达是 “restraint / deterrent / check”，或用动词 “restrain / curb / inhibit”。","它和常见词 “inhibitor（抑制剂/抑制因素）”很容易混淆：inhibitor 在日常与科技语境中更常见（如化学中的“抑制剂”）。如果你想表达“抑制因素/抑制剂”，多半应该用 inhibitor。"]}
{"word":"Cohin","summary":{"en":"Cohin is usually a rare surname spelling, often treated as a variant of Cohen.","zh":"Cohin 通常是较少见的姓氏拼写，多被视为 Cohen 的变体。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a rare spelling of the surname “Cohen”; used as a family name (proper noun).","zh":"罕见的姓氏拼写形式，常被视为 “Cohen” 的变体；用作人名（专有名词）。"},"examples":[{"en":"My teacher’s last name is Cohin.","zh":"我老师的姓是 Cohin。"},{"en":"In the credits, she is listed as Maya Cohin.","zh":"在演职员表里，她被写作 Maya Cohin。"}]}],"synonyms":["Cohen"],"phonetic":"/ˈkoʊən/","extraExplanation":["“Cohin” 不是常见英文单词，更常见的拼写是 “Cohen”（常见于犹太/希伯来传统姓氏，历史上与祭司阶层有关）。如果你其实想查的是印度城市 “Cochin”（今常称 Kochi）或别的词，请告诉我上下文（句子/国家/人名），我可以按你真正要的词条解释。"]}
{"word":"cohitre","summary":{"en":"“cohitre” isn’t a standard English word; you may mean “cohere” (to stick together; to be coherent).","zh":"“cohitre” 不是标准英语词；你可能想写 “cohere”（凝聚；连贯）。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Likely intended word) to stick together or form a united whole; to be logical and consistent (especially of ideas, writing, or an argument).","zh":"（可能是你想输入的词）黏在一起、凝聚成整体；（尤指观点/文章/论证）前后一致、合乎逻辑。"},"examples":[{"en":"The team didn’t cohere until they agreed on one clear goal.","zh":"团队直到同意一个明确目标后才真正凝聚起来。"},{"en":"Your essay will cohere better if you add a topic sentence to each paragraph.","zh":"如果你给每段加上主题句，你的文章会更连贯。"},{"en":"The plot doesn’t quite cohere in the final chapter.","zh":"故事情节在最后一章不太连贯。"}]}],"synonyms":["stick together","unite","hold together","make sense","be consistent"],"phonetic":"/koʊˈhɪr/","extraExplanation":["“cohitre” 不是常见或标准的英语单词，可能是拼写错误。最接近且常用的词之一是 **cohere**（凝聚；连贯）。","如果你想表达的是“同一群人/队列”，你可能在找 **cohort**；如果是“同居”，可能是 **cohabit**。你可以告诉我你想表达的中文意思或给我一句上下文，我可以帮你精准匹配。"]}
{"word":"Cohl","summary":{"en":"Cohl is a French surname, best known from Émile Cohl, a pioneer of early animation.","zh":"Cohl 是一个法语姓氏，最常指早期动画先驱埃米尔·科尔（Émile Cohl）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a French surname; most famously, Émile Cohl (1857–1938), an early pioneer of animated film","zh":"一个法语姓氏；最著名的是埃米尔·科尔（Émile Cohl，1857–1938），早期动画电影的重要先驱"},"examples":[{"en":"Émile Cohl is often called one of the fathers of animation.","zh":"埃米尔·科尔常被称为“动画之父”之一。"},{"en":"We watched a short film by Cohl in class to learn about early animation.","zh":"我们在课上看了一部科尔的短片来了解早期动画。"}]}],"phonetic":"/koʊl/","extraExplanation":["“Cohl”通常指法国动画先驱Émile Cohl。他在1908年的作品《Fantasmagorie（幻影集）》常被认为是最早的动画短片之一，特点是黑白线条画、充满变形与想象力的连贯动作。","注意拼写：英语里“kohl”指一种眼线/眼影用的深色化妆品（如中东和南亚常见的眼妆），与“Cohl”（姓氏）只是在发音上可能相近，但意义不同。"]}
{"word":"Cohla","summary":{"en":"“Cohla” is usually a name/brand spelling, or a misspelling of “cola” or “koala,” depending on context.","zh":"“Cohla”多为名字/品牌式拼写，或是 “cola / koala” 的误拼，具体含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare or nonstandard spelling, usually used as a name (e.g., a person’s name, username, or brand name). It is not a common dictionary word in English.","zh":"一种少见或非标准的拼写，通常作为名字使用（如人名、用户名或品牌名）。它不是常见的英语词典词汇。"},"examples":[{"en":"Cohla is the name she uses online.","zh":"Cohla 是她在网上使用的名字。"},{"en":"The artist goes by Cohla on social media.","zh":"这位艺术家在社交媒体上使用 Cohla 作为名字。"}]},{"partOfSpeech":"other","definition":{"en":"Often a misspelling of “cola” (a sweet carbonated drink) or “koala” (an Australian animal), depending on context.","zh":"根据语境，常见为 “cola”（可乐类碳酸甜饮料）或 “koala”（考拉，澳大利亚动物）的误拼。"},"examples":[{"en":"Did you mean cola, like Coca-Cola?","zh":"你是想说 cola（可乐），比如 Coca-Cola 吗？"},{"en":"Did you mean koala, the animal from Australia?","zh":"你是想说 koala（考拉）这种来自澳大利亚的动物吗？"}]}],"synonyms":["cola","koala"],"phonetic":"/ˈkoʊlə/","extraExplanation":["“Cohla”本身在英语中不算常见标准词，因此最准确的理解要看你看到它的具体场景（例如：人名/账号名/产品名/歌词/地名等）。如果你能发一句原句或告诉我它出现在哪里，我可以帮你判断更可能是哪一个意思与读音。"]}
{"word":"Cohleen","summary":{"en":"“Cohleen” is a less common spelling of the female name “Colleen,” linked to Irish usage.","zh":"“Cohleen”是女性名字“Colleen”的较少见拼写形式，与爱尔兰用法有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A female given name (more commonly spelled “Colleen”), especially in Irish or Irish-American contexts.","zh":"女性名字（更常见拼写为“Colleen”），常见于爱尔兰或爱尔兰裔美国人语境。"},"examples":[{"en":"Cohleen moved to Boston for college.","zh":"Cohleen 去波士顿上大学了。"},{"en":"Is “Cohleen” your legal name, or is it a nickname?","zh":"“Cohleen”是你的法定姓名，还是昵称？"}]}],"synonyms":["Colleen"],"phonetic":"/kɑˈlin/","extraExplanation":["“Cohleen”较少见，通常被认为是“Colleen”的变体拼写。“Colleen”源自爱尔兰语 *cailín*，意思是“女孩、年轻女子”。","在英语世界里，人名的拼写常因家庭传统、发音习惯或个性化选择而变化；因此“Cohleen”可能是刻意采用的独特拼写，并不一定是错误。"]}
{"word":"Cohlette","summary":{"en":"“Cohlette” is most likely a variant spelling of the French name “Colette.”","zh":"“Cohlette”多半是法语名字“Colette”的一种变体拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A female given name (and sometimes a surname), usually a variant spelling of “Colette,” of French origin.","zh":"女性名字（有时也作姓氏），常被视为法语名字“Colette”的变体拼写。"},"examples":[{"en":"Cohlette introduced herself on the first day of class.","zh":"Cohlette 在开学第一天做了自我介绍。"},{"en":"Her parents chose the spelling “Cohlette” to make the name feel unique.","zh":"她的父母选择拼作“Cohlette”，让这个名字更独特。"}]}],"synonyms":["Colette","Collette"],"phonetic":"/koʊˈlɛt/","extraExplanation":["“Cohlette”并不是常见的英语词汇，更常见的是法语名字“Colette”。在英语世界里，人们有时会用不同拼写（如Cohlette/Colette/Collette）来体现个性，但读音通常相近。","著名的“Colette”是法国作家西多妮-加布里埃尔·科莱特（Colette），她的作品常描写女性成长与情感生活；因此这个名字在文化上也常带有法式、文艺的联想。"]}
{"word":"Cohlier","summary":{"en":"Likely intended as *collier*: a coal miner, or (historically) a coal-carrying ship.","zh":"很可能指 *collier*：煤矿工人；或（历史用法）运煤船。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a coal miner; someone whose job is to mine coal","zh":"煤矿工人；采煤工"},"examples":[{"en":"His grandfather was a collier who worked underground for thirty years.","zh":"他的祖父是一名煤矿工人，在井下工作了三十年。"},{"en":"The novel describes the hard life of colliers in a mining town.","zh":"这部小说描写了矿城里煤矿工人的艰辛生活。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) a ship used for carrying coal","zh":"（历史用法）运煤船"},"examples":[{"en":"In the 1800s, colliers carried coal from northern England to London.","zh":"在19世纪，运煤船把煤从英格兰北部运到伦敦。"},{"en":"The harbor was crowded with fishing boats and colliers.","zh":"港口里挤满了渔船和运煤船。"}]}],"synonyms":["coal miner","miner","coalman","coal ship"],"phonetic":"/ˈkɑːljər/","extraExplanation":["“Cohlier”很可能是拼写错误，常见正确拼写是 **collier**。","collier 源自与“coal（煤）”相关的词根；在英国文学和历史语境中更常见（如描写矿区生活的作品）。","Collier 也可作姓氏（如作家 Wilkie Collins 的时代也常见这一姓），但作为词汇本身最常指“煤矿工人”或“运煤船”。"]}
{"word":"Cohligan","summary":{"en":"“Cohligan” is not standard; it is most likely meant to be “hooligan,” meaning a violent or disorderly troublemaker.","zh":"“Cohligan”不是标准拼写；通常应为“hooligan”，意为（常成群）闹事的流氓/混混。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely a misspelling of “hooligan”) a person who behaves in a loud, violent, or destructive way, especially as part of a group.","zh":"（很可能是“hooligan”的拼写错误）指（常成群）吵闹、粗暴、甚至打砸捣乱的人；流氓、混混。"},"examples":[{"en":"The police arrested several hooligans after the match.","zh":"比赛后警方逮捕了几名闹事的流氓。"},{"en":"A small group of hooligans vandalized the station late at night.","zh":"深夜一小群混混破坏了车站。"}]}],"synonyms":["thug","rowdy","troublemaker","lout","delinquent"],"phonetic":"/ˈhuːlɪɡən/","extraExplanation":["“Cohligan”不是常见英文单词；在英文语境中最接近、最常用的对应词是“hooligan”。如果你是在姓名、品牌名、地名或某个作品里看到“Cohligan”，它也可能是专有名词（例如姓氏或绰号），这时含义要看具体上下文。","“hooligan”常见于体育文化语境（如足球/球迷骚乱），也可泛指任何参与打砸或扰乱秩序的人。"]}
{"word":"Cohn","summary":{"en":"Cohn is a surname, often a variant of Cohen, with roots meaning “priest.”","zh":"Cohn 是一个姓氏，常被视为 Cohen 的变体，词源与“祭司/司祭”有关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a surname (family name), most commonly found among Jewish families; it is often a variant of “Cohen,” originally meaning “priest.”","zh":"一个姓氏（家族姓），在犹太家庭中较常见；常被视为“Cohen”的变体，原意与“祭司/司祭”有关。"},"examples":[{"en":"Ms. Cohn will lead today’s meeting.","zh":"Cohn 女士将主持今天的会议。"},{"en":"I saw the name Cohn on the list of authors.","zh":"我在作者名单上看到了 Cohn 这个名字。"}]}],"synonyms":["Cohen","Kohn"],"phonetic":"/koʊn/","extraExplanation":["“Cohn / Cohen / Kohn”等拼写常见于同一姓氏的不同转写方式（与地区语言、移民登记、拼写习惯有关），因此同一家庭在不同文件中可能出现不同拼法。","在英语里它通常读作 /koʊn/，写作大写首字母（Cohn），用于指人名或家族名；一般不加冠词（不说“a Cohn”除非强调“一个姓Cohn的人”）。"]}
{"word":"coho","summary":{"en":"Coho is a Pacific salmon species, commonly called coho salmon or silver salmon.","zh":"Coho 指一种太平洋鲑鱼，常称 coho salmon 或 silver salmon（银鲑）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of salmon (fish) from the Pacific Ocean, also called “silver salmon,” often eaten as food","zh":"一种太平洋鲑鱼，也叫“银鲑 / 银大马哈鱼（coho salmon）”，常作为食用鱼"},"examples":[{"en":"We grilled coho for dinner with lemon and herbs.","zh":"我们晚餐烤了银鲑，配柠檬和香草。"},{"en":"Coho salmon return to rivers to spawn.","zh":"银鲑会回到河流里产卵。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, especially in the U.S. Northwest) coho salmon","zh":"（非正式用法，尤其在美国西北地区）指银鲑（coho salmon）"},"examples":[{"en":"The market has fresh coho today.","zh":"今天市场上有新鲜的银鲑。"}]}],"synonyms":["coho salmon","silver salmon"],"phonetic":"/ˈkoʊhoʊ/","extraExplanation":["“coho”常见于北美英语，尤其是与渔业、烹饪、户外钓鱼相关的语境。更正式的说法是“coho salmon”。","在菜单或超市标签上，你也可能看到“silver salmon（银鲑）”，指的通常就是coho。"]}
{"word":"cohob","summary":{"en":"Cohob is a rare spelling of cohoba, a hallucinogenic ritual snuff used by Indigenous Caribbean peoples (especially the Taíno).","zh":"cohob 是 cohoba 的少见拼写，指加勒比原住民（尤指泰诺人）在仪式中使用的一种致幻鼻吸粉末。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a variant spelling of “cohoba”: a hallucinogenic snuff (powder) used in Indigenous Caribbean rituals, especially by the Taíno people.","zh":"“cohoba”的拼写变体：一种在加勒比地区原住民（尤指泰诺人 Taíno）仪式中使用的致幻鼻吸粉末（鼻烟）。"},"examples":[{"en":"The museum label explained that cohob (cohoba) was used in Taíno ceremonies.","zh":"博物馆的说明牌解释说，cohob（cohoba）曾用于泰诺人的仪式。"},{"en":"Historical accounts mention leaders inhaling cohob to enter a trance.","zh":"一些历史记载提到，首领会吸入cohob以进入恍惚/出神状态。"}]}],"synonyms":["cohoba","yopo (related term)"],"phonetic":"/ˈkoʊhɑb/","extraExplanation":["cohob 较少见，更常见的拼写是 cohoba（也常与 yopo 相关联）。它通常指由含致幻成分的植物（常被认为与 Anadenanthera peregrina 等有关）制成的粉末，通过鼻吸用于宗教/占卜等仪式场景。","这是带有特定文化背景的词，讨论时通常会提到泰诺人（Taíno）及其在哥伦布时代前后的加勒比历史语境。"]}
{"word":"cohoba","summary":{"en":"Cohoba is a traditional hallucinogenic snuff used in Caribbean Indigenous rituals, and it can also refer to the tree whose seeds make the snuff.","zh":"cohoba 指加勒比原住民仪式中使用的传统致幻鼻烟，也可指其种子来源的科霍巴树。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hallucinogenic snuff (powder) traditionally used in Caribbean Indigenous rituals, made from the seeds of the cohoba tree (Anadenanthera peregrina)","zh":"（加勒比地区原住民传统仪式中使用的）致幻鼻烟/粉末，通常由“科霍巴树”（Anadenanthera peregrina）的种子制成"},"examples":[{"en":"The Taíno are known for using cohoba in religious ceremonies.","zh":"泰诺人以在宗教仪式中使用科霍巴致幻鼻烟而闻名。"},{"en":"Archaeologists found cohoba inhalers and bowls at the site.","zh":"考古学家在遗址发现了用于吸入科霍巴粉末的器具和容器。"}]},{"partOfSpeech":"n.","definition":{"en":"the cohoba tree, a South American tree whose seeds can be used to make the snuff","zh":"科霍巴树；一种南美洲树木，其种子可用于制作同名致幻鼻烟"},"examples":[{"en":"The cohoba grows in warm regions of South America and the Caribbean.","zh":"科霍巴树生长在南美洲及加勒比的温暖地区。"}]}],"synonyms":["yopo (related snuff, sometimes used loosely)","hallucinogenic snuff"],"phonetic":"/koʊˈhoʊbə/","extraExplanation":["“cohoba”一词常出现在关于泰诺（Taíno）文化与加勒比殖民早期记载的语境中。历史资料中，cohoba 往往与萨满/祭司、占卜、与神灵沟通等仪式联系在一起。","它指“粉末”和“树”两种事物；在阅读人类学或历史文本时，可根据上下文判断：若出现 inhale/snuff/ceremony 等词，多半指粉末；若出现 grow/tree/seeds 等词，多半指植物。","该词涉及致幻物质与宗教实践，讨论时应尊重原住民文化与历史背景。"]}
{"word":"cohobate","summary":{"en":"Cohobate means to distill a liquid again, often by returning the distillate to the still and repeating the process.","zh":"cohobate 指将液体再次蒸馏，常见做法是把馏出液倒回蒸馏器中重复蒸馏。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to distill a liquid again (especially by pouring the condensed liquid back and repeating the distillation)","zh":"（尤指把蒸馏得到的冷凝液倒回去）再次蒸馏；重蒸馏"},"examples":[{"en":"The chemist cohobated the mixture to obtain a purer solvent.","zh":"化学家对混合物进行重蒸馏，以获得更纯的溶剂。"},{"en":"In older manuals, you may see instructions to cohobate the distillate several times.","zh":"在较早的操作手册中，你可能会看到“将馏出液重蒸馏数次”的指示。"}]}],"synonyms":["redistill","distill again","redistillation"],"phonetic":"/koʊˈhoʊbeɪt/","extraExplanation":["这个词多见于较旧的化学、药学和炼金术语境；现代实验室更常用的说法是 “redistill / distill again（再蒸馏）”。","词源来自拉丁语，核心意思与“把液体重新倒回去再加热蒸馏”有关，因此常与 “distillate（馏出液）”“still（蒸馏器）”等词搭配。"]}
{"word":"cohobated","summary":{"en":"“Cohobated” means redistilled repeatedly (heated and condensed again) to purify or concentrate a liquid; it’s a rare, old-fashioned chemistry/alchemy term.","zh":"“cohobated”指（在化学/炼金术语境中）将液体反复加热并冷凝回收、再蒸馏，以提纯或浓缩；属于较少见的旧式术语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry, alchemy) Redistilled after being heated and then condensed again, often repeatedly, to purify or concentrate a liquid.","zh":"（化学/炼金术）指液体被加热后再冷凝回收，并（常常）重复蒸馏，以提纯或浓缩。"},"examples":[{"en":"The mixture was cohobated several times to remove impurities.","zh":"为了去除杂质，这种混合物被反复回流蒸馏（cohobated）了好几次。"},{"en":"In older lab notes, the spirit is described as cohobated until it became clear.","zh":"在较早的实验记录里，这种酒精溶液被写作“反复回流蒸馏”，直到变得澄清。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense / past participle of “cohobate”: to redistill by repeatedly heating and condensing a liquid (often pouring the condensed liquid back over the residue).","zh":"“cohobate”的过去式/过去分词：指通过反复加热与冷凝来再蒸馏（常把冷凝液再倒回残渣上继续蒸馏）。"},"examples":[{"en":"The herbal extract was cohobated to intensify its aroma.","zh":"这种草本萃取液经过反复回流蒸馏，以增强香气。"},{"en":"After the solution had cohobated, the remaining liquid was more concentrated.","zh":"溶液反复回流蒸馏后，剩余液体更浓了。"}]}],"synonyms":["redistilled","refluxed","distilled repeatedly","purified","concentrated"],"phonetic":"/koʊˈhoʊbeɪtɪd/","extraExplanation":["这个词非常少见，多出现在早期化学/炼金术文本或旧式实验记录中。现代实验语境里更常见的表达是“redistilled / refluxed / distilled repeatedly（再蒸馏/回流/反复蒸馏）”。","词源与拉丁语 *cohobare*（反复倒回、再蒸馏）有关，强调“把冷凝后的液体再倒回去继续蒸馏”的循环过程。"]}
{"word":"cohobates","summary":{"en":"A rare technical verb meaning to repeatedly distill a liquid and return the distillate to the original material.","zh":"一个罕见的技术性动词，指反复蒸馏并将馏出液倒回原料继续蒸馏。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to distill (a liquid) and then pour the condensed liquid back over the same material, repeating the process (used in chemistry, pharmacy, and older alchemy texts).","zh":"（化学/药学/炼金术旧用语）对液体进行蒸馏后，将冷凝液再倒回原料上反复蒸馏（回流蒸馏、反复回蒸）。"},"examples":[{"en":"The chemist cohobated the solvent to concentrate the extract.","zh":"化学家用回流蒸馏法反复蒸馏溶剂，以浓缩提取物。"},{"en":"In older manuals, herbal spirits were often cohobated several times.","zh":"在较早的手册里，草本蒸馏液常常会被反复回蒸好几次。"}]}],"synonyms":["reflux","redistill","distill again"],"phonetic":"/ˈkoʊ.həˌbeɪt/","extraExplanation":["“cohobates”通常是动词“cohobate”的第三人称单数（he/she/it cohobates），也可能被当作复数形式使用，但在现代英语里这个词非常罕见，多见于专业或历史文献。","词源来自拉丁语“co-（一起）+ habere（拥有/持有）”，引申为“把蒸馏出来的液体再‘合在一起’倒回去”。在现代实验室里，更常见的说法是“reflux (回流)”或“redistill (重新蒸馏)”。"]}
{"word":"cohobating","summary":{"en":"Cohobating means distilling a liquid again and again (or, less commonly, boiling it down to concentrate it).","zh":"cohobating 指对液体反复再蒸馏（较少用：把液体煮到浓缩）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to distill a liquid again (especially in chemistry or older alchemy), often by pouring the distillate back over the same material and repeating the process","zh":"（尤用于化学或早期炼金术中）对液体进行再蒸馏；常指把馏出液倒回原材料上反复蒸馏"},"examples":[{"en":"The chemist was cohobating the mixture to improve its purity.","zh":"化学家对混合物进行再蒸馏，以提高纯度。"},{"en":"In older texts, cohobating was described as repeating the distillation several times.","zh":"在较早的文献里，“cohobating”被描述为把蒸馏重复多次。"}]},{"partOfSpeech":"vt.","definition":{"en":"to evaporate or boil a liquid down to concentrate it (less common)","zh":"（较少用）把液体煮沸/蒸发至浓缩"},"examples":[{"en":"They cohobated the herbal liquid until only a small, strong extract remained.","zh":"他们把草药液煮到浓缩，只剩下一点点浓稠的提取物。"}]}],"synonyms":["redistilling","distilling again","distilling repeatedly","re-distilling","concentrating (by boiling)"],"phonetic":"/koʊˈhoʊbeɪtɪŋ/","extraExplanation":["这个词很少见，多出现在化学史、炼金术或古老的实验记录中。其核心概念是“反复蒸馏/循环蒸馏”：把蒸出来的液体（馏出液）再倒回去继续蒸，以求更纯或更强的效果。现代化学里通常会用更常见的表达，如 “redistill” 或 “distill repeatedly”。"]}
{"word":"cohobation","summary":{"en":"Cohobation means repeated distillation where the distillate is poured back and distilled again.","zh":"cohobation 指将馏出液倒回原料中反复蒸馏的过程（回流蒸馏/反复蒸馏）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of repeatedly distilling a liquid and pouring the distillate back onto the original material (often to concentrate it or extract more compounds).","zh":"回流蒸馏；反复蒸馏并将馏出液倒回原料中（常用于浓缩或进一步提取成分）。"},"examples":[{"en":"In early laboratory practice, cohobation was used to strengthen herbal extracts by repeated distillation.","zh":"在早期的实验室实践中，人们用回流蒸馏通过反复蒸馏来增强草本提取物的浓度。"},{"en":"The chemist performed cohobation, returning the distillate to the flask several times.","zh":"化学家进行了回流蒸馏，多次把馏出液倒回烧瓶中。"}]}],"synonyms":["redistillation","repeated distillation","refluxing (related)"],"phonetic":"/ˌkoʊhəˈbeɪʃən/","extraExplanation":["这是一个较少见、偏历史与专业的术语，常见于早期化学与炼金术文献。它强调“反复进行同一轮蒸馏，并把馏出部分再倒回去”这一操作思路。现代实验中更常用更具体的说法（如 reflux/回流、redistillation/再蒸馏），但在阅读古典化学或历史资料时仍可能遇到 cohobation。"]}
{"word":"cohobator","summary":{"en":"A cohobator is someone who repeatedly distills a substance, an old term from early chemistry/alchemy.","zh":"cohobator 指反复蒸馏某种物质的人，是源自早期化学/炼金术的古旧用词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who repeatedly distills or re-distills a substance (especially in older chemistry/alchemy).","zh":"（尤指旧时化学/炼金术中）反复进行蒸馏或再蒸馏的人。"},"examples":[{"en":"In early laboratories, a cohobator might distill the same liquid many times to make it purer.","zh":"在早期实验室里，cohobator 可能会把同一种液体蒸馏很多次来提高纯度。"},{"en":"The alchemist hired a cohobator to keep the still running day and night.","zh":"那位炼金术士雇了个 cohobator，让蒸馏器日夜不停地运转。"}]}],"synonyms":["distiller","alchemist (historical context)","chemist (broad/modern)"],"phonetic":"/koʊˈhoʊbeɪtər/","extraExplanation":["这是一个非常罕见、偏古旧的词，常见于炼金术或早期化学语境。它来自动词 cohobate（反复蒸馏/再蒸馏），而 -or 表示“做……的人”。现代英语里通常会说 distiller（蒸馏者）或 chemist（化学家），不会在日常场景用 cohobator。"]}
{"word":"Cohoctah","summary":{"en":"Cohoctah is a Michigan place name.","zh":"Cohoctah 是密歇根州的地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name in Michigan, USA (an unincorporated community and also the name of nearby local areas such as Cohoctah Township).","zh":"美国密歇根州的一个地名（一个非建制社区，也常指附近的地方行政区名，如 Cohoctah Township）。"},"examples":[{"en":"She grew up near Cohoctah in Livingston County, Michigan.","zh":"她在密歇根州利文斯顿县的 Cohoctah 附近长大。"},{"en":"We drove through Cohoctah on the way to Howell.","zh":"我们去豪厄尔（Howell）的路上开车经过了 Cohoctah。"}]}],"phonetic":"/koʊˈhɑktə/","extraExplanation":["“Cohoctah”属于专有名词（地名），在英文里通常不翻译，只在中文中按读音音译或直接保留英文拼写。","这类密歇根州地名常与当地原住民语言有关；不过“Cohoctah”的具体词源在常见资料中不一定有一致、权威的解释。"]}
{"word":"Cohocton","summary":{"en":"Cohocton is a proper name used mainly for a place in western New York and for the nearby Cohocton River.","zh":"Cohocton主要是专有地名，指纽约州西部的一个地方，也可指附近的科霍克顿河。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a village (hamlet) and town name in western New York State, U.S.; it is also used for the nearby Cohocton River.","zh":"美国纽约州西部的一个地名（村落/小镇名）；也可指附近的科霍克顿河（Cohocton River）。"},"examples":[{"en":"We drove through Cohocton on our way to the Finger Lakes.","zh":"我们去手指湖（Finger Lakes）的路上开车经过了科霍克顿（Cohocton）。"},{"en":"The Cohocton River flows through a quiet rural area.","zh":"科霍克顿河流经一片安静的乡村地区。"}]}],"synonyms":["(no true synonyms; it is a place name)"],"phonetic":"/koʊˈhɑk.tən/","extraExplanation":["“Cohocton”是专有名词，常见用法是作为地名，因此一般不加冠词（不说 *the Cohocton*，除非指“Cohocton River”这种具体的河流名称，河流通常要加 the：*the Cohocton River*）。","该词源自美洲原住民语言（常见说法与易洛魁语族有关），在英语中保留了音译拼写；不同资料对其原始词根解释可能略有差异。"]}
{"word":"Cohoes","summary":{"en":"Cohoes is a city in eastern New York State, known in part for Cohoes Falls.","zh":"Cohoes（科霍斯）是美国纽约州东部的一座城市，部分因科霍斯瀑布而知名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a city in eastern New York State (near Albany), located where the Mohawk River meets the Hudson River","zh":"美国纽约州东部的一座城市（靠近奥尔巴尼），位于莫霍克河与哈德逊河的交汇处"},"examples":[{"en":"Cohoes is just north of Albany and close to Troy.","zh":"科霍斯在奥尔巴尼以北，离特洛伊很近。"},{"en":"Many people visit Cohoes to see the Cohoes Falls on the Mohawk River.","zh":"很多人去科霍斯是为了看莫霍克河上的科霍斯瀑布。"}]}],"phonetic":"/kəˈhoʊz/","extraExplanation":["“Cohoes”是地名，常见搭配有：Cohoes, New York（纽约州科霍斯）、Cohoes Falls（科霍斯瀑布）。","词源通常被认为来自莫霍克语（Mohawk）或相关的易洛魁语系词汇，和“瀑布/落水之处”这一地理特征有关，因此当地著名景点就是瀑布。"]}
{"word":"cohog","summary":{"en":"Cohog is another spelling of quahog, a large edible hard-shell clam from the Atlantic coast of North America.","zh":"cohog 是 quahog 的另一种拼写，指北美大西洋沿岸一种可食用的大型硬壳蛤蜊。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large hard-shell clam found along the Atlantic coast of North America, often eaten (also spelled “quahog”).","zh":"（北美大西洋沿岸的）一种大型硬壳蛤蜊，常被食用（也拼作 quahog）。"},"examples":[{"en":"We ordered chowder made with quahog (cohog) clams.","zh":"我们点了用 quahog（cohog）蛤蜊做的蛤蜊浓汤。"},{"en":"Local fishers harvest quahogs from the bay.","zh":"当地渔民在海湾里捕捞 quahog 蛤蜊。"}]}],"synonyms":["quahog","hard clam"],"phonetic":"/ˈkwɑː.hɑːɡ/","extraExplanation":["“cohog”是“quahog”的变体拼写，在新英格兰（美国东北部）沿海地区更常见。“quahog”一词来自当地原住民语言（如纳拉甘西特语）对这种蛤蜊的称呼。","在美式餐饮文化里，quahog 常出现在“clam chowder（蛤蜊浓汤）”“stuffed clams（烤酿蛤蜊）”等菜名中。"]}
{"word":"cohogs","summary":{"en":"Cohogs are large hard clams (quahogs), common on the U.S. Atlantic coast and used in dishes like chowder.","zh":"Cohogs 指大型硬壳蛤（quahog），常见于美国大西洋沿岸，常用于蛤蜊浓汤等料理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large hard clam found along the Atlantic coast of North America (especially common in New England); often eaten raw, steamed, or used in chowder","zh":"（北美大西洋沿岸的）硬壳蛤／圆蛤（常见于新英格兰地区）；可生吃、蒸食或做杂烩浓汤"},"examples":[{"en":"We ordered a dozen cohogs at the raw bar.","zh":"我们在生蚝吧点了一打硬壳蛤。"},{"en":"Cohogs are often chopped and added to clam chowder.","zh":"硬壳蛤常被切碎后加入蛤蜊浓汤（杂烩浓汤）里。"},{"en":"The beach is known for its cohogs and other shellfish.","zh":"这片海滩以硬壳蛤和其他贝类而闻名。"}]}],"synonyms":["quahog","hard clam","clam"],"phonetic":"/ˈkoʊ.hɔːɡ/","extraExplanation":["“cohog(s)”多见于美国东北部口语/地方写法，和更常见的“quahog”指同一种贝类（hard clam）。在菜单或海鲜市场里也常写作“quahogs”。","在新英格兰饮食文化中，quahog/hard clam很常见：小个的常叫“littlenecks / cherrystones”，更大的有时会被称作“chowder clams”（适合做浓汤）。"]}
{"word":"cohol","summary":{"en":"Alcohol most commonly means ethanol in drinks, and in chemistry it also means a class of compounds with an -OH group.","zh":"alcohol 常指饮料中的酒精（乙醇）；在化学中也指含 -OH 羟基的一类化合物（醇类）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A liquid such as ethanol found in beer, wine, and spirits; also the drinks that contain it.","zh":"酒精（乙醇）；也可指含酒精的饮料（如啤酒、葡萄酒、烈酒）"},"examples":[{"en":"This medicine should not be mixed with alcohol.","zh":"这种药不应该和酒精一起使用。"},{"en":"He decided to stop drinking alcohol for a month.","zh":"他决定一个月不喝酒。"}]},{"partOfSpeech":"n.","definition":{"en":"A group of chemicals (in chemistry) that contain a hydroxyl group (-OH).","zh":"（化学）醇类：含有羟基（-OH）的一类有机化合物"},"examples":[{"en":"Ethanol is an alcohol used in hand sanitizers.","zh":"乙醇是一种用于免洗洗手液的醇。"},{"en":"Some alcohols can be poisonous if swallowed.","zh":"有些醇类若吞咽可能有毒。"}]}],"synonyms":["liquor","booze","spirits","ethanol"],"phonetic":"ˈæl.kə.hɔl","extraExplanation":["“cohol”本身不是常见的英语单词，更像是你想输入“alcohol”的后半部分，或在口语/打字中省略了开头。标准用法一般写作 alcohol。","词源提示：alcohol 源自阿拉伯语（al-kuḥl），后来在欧洲语言中逐渐演变为“精华/蒸馏物”，再发展为现代的“酒精”。"]}
{"word":"coholder","summary":{"en":"A coholder is someone who shares ownership or a formal role with others.","zh":"coholder 指与他人共同拥有某物或共同担任正式职务的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who shares ownership, a position, or a responsibility with one or more others; a joint holder","zh":"共同持有人；与他人共同拥有某物、共同担任某职务或共同承担责任的人"},"examples":[{"en":"She is a coholder of the patent with her research partner.","zh":"她与研究伙伴共同持有这项专利。"},{"en":"Both spouses are coholders of the bank account.","zh":"夫妻双方都是该银行账户的共同持有人。"},{"en":"The two companies became coholders of the trademark after the merger.","zh":"合并后，两家公司成为该商标的共同持有人。"}]}],"synonyms":["co-holder","joint holder","co-owner","joint owner"],"phonetic":"/ˌkoʊˈhoʊldər/","extraExplanation":["“coholder”常写作“co-holder”，也更常用“joint holder”（共同持有人）或“co-owner”（共同所有人）。在法律、金融、专利/商标等语境中更常见。"]}
{"word":"coholders","summary":{"en":"“Coholders” means people who share holding/ownership or a legal right together.","zh":"“coholders”指共同持有人：与他人一起共同持有/共有某项权利或财产的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who share ownership, a position, a title, or legal rights/responsibilities with one or more others (plural of “coholder”)","zh":"共同持有人；与他人共同拥有某项财产、职位、头衔或法律权利/义务的人（“coholder”的复数）"},"examples":[{"en":"The account coholders must both sign to close the bank account.","zh":"要关闭这个银行账户，账户共同持有人必须都签字。"},{"en":"The two coholders of the patent agreed to license it together.","zh":"这项专利的两位共同持有人同意一起进行授权许可。"},{"en":"As coholders of the lease, they are both responsible for paying rent on time.","zh":"作为租约的共同持有人，他们都要负责按时交房租。"}]}],"synonyms":["joint owners","co-owners","joint holders","shared holders"],"phonetic":"/ˈkoʊˌhoʊldərz/","extraExplanation":["“co-”表示“共同、一起”（例如 co-worker 同事，co-founder 共同创办人）。“coholder”常见于法律、金融、公司文件中，用来强调“权利与责任共享”。日常口语里，人们也常说 joint owner（共同所有者）或 account holder(s)（账户持有人）。"]}
{"word":"cohomology","summary":{"en":"Cohomology is a mathematical method for describing and classifying the global structure of spaces, especially their “holes,” using algebra.","zh":"上同调是一种用代数来描述并分类空间整体结构（尤其是“洞”）的数学方法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Mathematics) A tool in algebraic topology and related fields that assigns algebraic objects (like groups or vector spaces) to a space, in order to measure and classify its “holes” and global structure.","zh":"（数学）代数拓扑及相关领域中的一种工具：把代数对象（如群或向量空间）分配给一个空间，用来度量并分类该空间的“洞”以及整体结构。"},"examples":[{"en":"Cohomology helps mathematicians detect holes in a topological space.","zh":"上同调帮助数学家识别一个拓扑空间中的“洞”。"},{"en":"They computed the cohomology of the torus to understand its structure.","zh":"他们计算了环面的上同调来理解它的结构。"},{"en":"In differential geometry, de Rham cohomology connects calculus with topology.","zh":"在微分几何中，de Rham 上同调把微积分与拓扑联系起来。"}]}],"synonyms":["cohomology theory","topological invariant"],"phonetic":"/ˌkoʊ.həˈmɑː.lə.dʒi/","extraExplanation":["“co-”在这里不是“共同”的日常含义，而是数学中与“homology（同调）”相对的一套理论；两者密切相关，但构造方式不同（同调常用链复形，余/上同调常用上链复形或函数/形式）。","常见搭配：cohomology group（上同调群）、singular cohomology（奇异上同调）、de Rham cohomology（德拉姆上同调）、group cohomology（群上同调）。","在很多教材里，上同调比同调“更好用”，因为它有自然的乘法结构（cup product），能提供更丰富的不变量。"]}
{"word":"Cohong","summary":{"en":"Cohong: the Qing-era Guangzhou guild of licensed merchants that monopolized trade with foreigners under the Canton System.","zh":"Cohong：清代广州获准对外贸易的行商商团（公行），在广州一口通商制度下垄断与外国商人的贸易。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A guild (association) of officially licensed Chinese merchant houses in Guangzhou (Canton) during the Qing dynasty that held a monopoly on trade with Western merchants under the Canton System (18th–19th centuries).","zh":"清朝时期广州（Canton）对外贸易中由官方许可的行商商团（公行），在“广州一口通商/十三行制度”下垄断与西方商人的贸易（18—19世纪）。"},"examples":[{"en":"Under the Canton System, foreign traders could deal only through the Cohong.","zh":"在广州一口通商制度下，外国商人只能通过公行（Cohong）进行交易。"},{"en":"The Cohong merchants helped manage taxes, credit, and disputes between Chinese and foreign traders.","zh":"公行商人协助处理税费、赊账（信用）以及中外商人之间的纠纷。"}]}],"synonyms":["hong merchants","Canton Cohong","licensed merchant guild (historical)"],"phonetic":"/ˈkoʊhɔŋ/","extraExplanation":["“Cohong”常被写作 Cohong 或 co-hong，来源与粤语/早期英语转写有关；在历史书写中也常与“hong merchants（行商）”“Thirteen Factories（十三行商馆区）”“Canton System（广州一口通商制度）”一起出现。","公行并不是单一公司，而是一批获准对外贸易的商号；它们在清政府监管下承担担保与管理职责，因此在西方史料中常被描述为对外贸易的“中介与垄断者”。"]}
{"word":"cohorn","summary":{"en":"A cohorn is a small mortar used to fire shells in a high arc, especially in sieges.","zh":"cohorn 指一种小型短身迫击炮，主要用高抛弹道射击，常见于围城作战。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, short-barreled mortar (a type of artillery) used to fire shells at a high angle, often in sieges or for firing over walls; also called a cohorn mortar","zh":"（炮兵）一种短身小型迫击炮（又称 cohorn mortar），以高仰角发射炮弹，常用于围城战或越过城墙射击"},"examples":[{"en":"The fortress defenders set up a cohorn to lob shells over the outer wall.","zh":"守军架起一门 cohorn，把炮弹越过外墙抛射出去。"},{"en":"In the museum, you can see a cohorn mortar used during early modern sieges.","zh":"在博物馆里，你能看到一门早期近代围城战中使用过的 cohorn 迫击炮。"}]}],"synonyms":["cohorn mortar","mortar","siege mortar"],"phonetic":"ˈkoʊhɔrn","extraExplanation":["“cohorn”源自荷兰军事工程师梅诺·范·科霍恩（Menno van Coehoorn）的姓氏。他以改良要塞与围城战术闻名，因此这种常用于围攻、可抛射越障的短身迫击炮以他的名字命名。现代英语里更常见的说法是“cohorn mortar”。"]}
{"word":"cohors","summary":{"en":"Cohors is a Latin word used mainly in Roman-history contexts meaning a cohort (a unit of soldiers) or, rarely, an enclosure/courtyard.","zh":"Cohors 是拉丁语词，主要用于古罗马历史语境，指“罗马步兵大队（cohort）”；少见时也可指“围起来的庭院/圈地”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Roman military unit (a cohort), usually about one-tenth of a legion; by extension, a band or group of people acting together.","zh":"（古罗马）步兵大队（cohort），通常为一个军团的十分之一；引申为一起行动的一群人/团体。"},"examples":[{"en":"The historian writes that three cohors marched at dawn.","zh":"历史学家写道，三支 cohors 在黎明时分行军。"},{"en":"In the novel, the hero is rescued by a loyal cohors of soldiers.","zh":"在小说中，主人公被一支忠诚的士兵 cohors 所救。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, Latin sense) an enclosed yard or courtyard; a pen or enclosure.","zh":"（罕见，拉丁语本义）围起来的场地、庭院；畜栏/围栏。"},"examples":[{"en":"The manuscript glosses cohors as a farmyard enclosure.","zh":"那份手稿注释中将 cohors 解释为农场的围栏场地。"}]}],"synonyms":["cohort","troop","company","band"],"phonetic":"/ˈkoʊhɔːrz/","extraExplanation":["“cohors”是拉丁语形式，在英文里较少直接使用；更常见的英文形式是“cohort”。在古罗马军制中，cohort/cohors 是介于“century（百人队）”与“legion（军团）”之间的单位。","词源上它最初与“围起来的院子/圈地”有关，后来引申为“聚在一起的一群人”，再发展出军队单位的含义。现代英语里常用“cohort”表示“同伴/同组人（如同年级、同一群研究对象）”。"]}
{"word":"cohort","summary":{"en":"A cohort is usually a group that shares a common time or experience (like a graduating class or research group), and it can also mean companions/allies or a Roman military unit.","zh":"cohort 常指“同一批/同一届/同一研究组”的人群，也可指“同伙/伙伴”，或历史上的“罗马军队步兵大队”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group of people who share a common characteristic or experience (such as age, school year, job start date, or a medical study group).","zh":"一群具有共同特征或共同经历的人（如同龄人、同一届学生、同批入职者，或医学研究中的一组受试者）。"},"examples":[{"en":"Our cohort started university in 2023, so we share many of the same requirements.","zh":"我们这一届是2023年入学的，所以有很多相同的要求。"},{"en":"The study followed a cohort of 5,000 adults for ten years.","zh":"这项研究跟踪了5000名成年人组成的队列，持续了十年。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who supports or works with someone, often used in the plural to mean companions or associates (sometimes implying they are involved in something wrong).","zh":"同伙；伙伴；同伴（常用复数，可带有“参与不正当之事”的暗示）。"},"examples":[{"en":"The detective believed he had several cohorts who helped plan the robbery.","zh":"侦探认为他有几个同伙帮助策划了抢劫。"},{"en":"She refused to join his cohorts in spreading rumors.","zh":"她拒绝和他的那帮人一起散布谣言。"}]},{"partOfSpeech":"n.","definition":{"en":"Historically, a unit of soldiers in the ancient Roman army.","zh":"（历史）古罗马军团的一个步兵大队（cohort）。"},"examples":[{"en":"In the novel, a Roman cohort marches across the frontier.","zh":"在小说里，一支罗马步兵大队穿越边境行军。"}]}],"synonyms":["group","class","batch","peer group","companion","associate"],"phonetic":"/ˈkoʊ.hɔrt/","extraExplanation":["在现代英语里，cohort 最常见于教育与职场（“同届/同批”）以及统计、医学与社会科学研究（“队列研究 cohort study”）。中文里常译为“同届、同批、群体、队列”，具体看语境。","词源来自拉丁语 cohors，原意与“围场/院子”相关，后来引申为“围在一起的一群人”，再发展出“罗马军队编制单位”的历史义。"]}
{"word":"cohortation","summary":{"en":"Cohortation means a strong urging or encouraging speech that calls people to action.","zh":"cohortation 指有力的劝勉或呼吁性讲话，鼓励并敦促人们采取行动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strong, encouraging speech or message that urges people to do something (often used in formal, religious, or old-fashioned contexts).","zh":"（常用于正式、宗教或较古旧语境）有力的劝勉/鼓励性讲话或信息，敦促人们去做某事。"},"examples":[{"en":"The coach’s cohortation before the game lifted the team’s spirits.","zh":"比赛前教练的一番劝勉鼓舞了全队士气。"},{"en":"In the sermon, the priest offered cohortation to help people remain hopeful.","zh":"在布道中，牧师以劝勉之辞帮助人们保持希望。"}]}],"synonyms":["exhortation","encouragement","appeal","call to action"],"phonetic":"/ˌkoʊ.hɔrˈteɪ.ʃən/","extraExplanation":["“cohortation”较少用于日常口语，更常见于演讲、宗教写作、文学或学术语境。更常用的近义表达有 exhortation（劝告、劝勉）、encouragement（鼓励）、appeal（呼吁）。","词源上与拉丁语中“鼓动、劝说、敦促”的含义相关，因此它常带有“号召大家采取行动”的语气，而不仅仅是一般的安慰或称赞。"]}
{"word":"cohortative","summary":{"en":"Cohortative describes (or names) a grammar form meaning “let us …,” an encouragement that includes the speaker.","zh":"Cohortative 指（或指称）一种表示“让我们……”的语法形式，即包含说话者在内的劝勉/提议。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Grammar/Linguistics) Expressing an encouragement or proposal that includes the speaker, often meaning “let us …”.","zh":"（语法/语言学）表示包含说话者在内的劝勉、提议，常相当于“让我们……”。"},"examples":[{"en":"In English, “Let’s go” is a common way to express a cohortative idea.","zh":"在英语里，“Let’s go（我们走吧）”常用来表达“cohortative（让我们……）”的意思。"},{"en":"Some grammars discuss the cohortative form when analyzing commands and suggestions.","zh":"一些语法书在分析命令和建议时会讨论“cohortative（让我们……式）”。"}]},{"partOfSpeech":"n.","definition":{"en":"A cohortative form or construction in a language (a “let us …” expression).","zh":"（某种语言中的）cohortative 形式/结构；表示“让我们……”的表达。"},"examples":[{"en":"The teacher pointed out a cohortative in the text: “Let us remember.”","zh":"老师指出课文里有一个 cohortative（让我们……式）：“Let us remember（让我们记住）”。"},{"en":"In the analysis, the cohortative contrasts with the imperative “Go!”","zh":"在分析中，cohortative（让我们……）与祈使句“Go！（去！）”形成对比。"}]}],"synonyms":["exhortative","hortative","volitive"],"phonetic":"/koʊˈhɔrtətɪv/","extraExplanation":["“Cohortative”主要用于语言学，尤其常见于讨论闪米特语系（如希伯来语）时：它通常对应第一人称（常为复数）的“劝勉/提议式”，类似英语里用“Let’s + 动词”来表达“我们一起……吧”。","词源上与拉丁语 *cohortari*（“劝告、鼓励”）有关，因此它强调“鼓动大家一起做某事”，而不只是命令对方。"]}
{"word":"cohorting","summary":{"en":"Cohorting means grouping people together—especially in healthcare or schools—to manage them more safely or efficiently (often for infection control).","zh":"Cohorting指把人按共同特征分组，尤其用于医疗或学校中，以更安全或更高效地管理（常用于感染控制）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the practice of grouping people (or things) together because they share a common feature, especially in hospitals or schools (e.g., the same infection, risk level, or class).","zh":"将人（或事物）按共同特征进行分组的做法，尤指在医院或学校中（如同一种感染、相同风险等级或同一班级）。"},"examples":[{"en":"During flu season, the hospital used cohorting to keep infected patients in one area.","zh":"在流感季，医院采用“cohorting”把感染患者集中在同一区域。"},{"en":"The school considered cohorting students to reduce the number of close contacts.","zh":"学校考虑把学生分组（cohorting），以减少密切接触的人数。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “cohort”: to group people together as a cohort for easier management, study, or safety.","zh":"“cohort”的现在分词：把人组成一个群组（同伴群/队列），以便管理、研究或保障安全。"},"examples":[{"en":"They are cohorting new employees so training can be done in batches.","zh":"他们把新员工分组（cohorting），以便分批培训。"},{"en":"Clinics may be cohorting appointments to separate high-risk and low-risk patients.","zh":"诊所可能会把预约分组（cohorting），将高风险与低风险患者分开。"}]}],"synonyms":["grouping","clustering","batching","segregation (context-dependent)","zoning (healthcare)"],"phonetic":"/koʊˈhɔr.tɪŋ/","extraExplanation":["“cohorting”在医疗与公共卫生语境里非常常见，常译为“队列管理/分舱/分区/分组管理”。核心目的通常是感染控制：把同类患者（如同一病原体感染者）集中安置，减少交叉感染与资源浪费。","与“quarantine（隔离）”不同：quarantine多指对可能暴露但未确诊的人进行隔离；cohorting更强调“把同类人集中在一起”，可能是确诊者之间、同风险人群之间，或按班级/批次固定组合。","该词在新冠疫情后在学校与医院公告、政策文件中出现频率明显上升，例如“student cohorts（学生固定组）”“cohorted wards（队列病房）”。"]}
{"word":"cohorts","summary":{"en":"Cohorts are groups of people who share something in common, especially the same age period or experience; it can also mean companions or (sometimes negatively) a gang of followers.","zh":"cohorts 指具有共同特征的一群人（尤指同一年代或同一经历的一批人）；也可指同伴，或（有时贬义）一伙追随者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group of people who share a common characteristic, especially those born in the same period or who experience the same event (often used in research, education, and public health).","zh":"同群；（尤指）具有共同特征的一群人，常指同一出生年代的人或经历同一事件的一批人（常用于研究、教育、公共卫生等）。"},"examples":[{"en":"The study followed a cohort of children born in 2010.","zh":"这项研究跟踪了一批2010年出生的儿童。"},{"en":"Our cohort of new teachers meets every Friday for training.","zh":"我们这一届新教师每周五参加培训。"}]},{"partOfSpeech":"n.","definition":{"en":"A companion or partner; someone who goes with you (more formal or old-fashioned).","zh":"同伴；伙伴（较正式或略显古旧）。"},"examples":[{"en":"He arrived with his cohorts and began setting up the event.","zh":"他和同伴一起来到，开始布置活动。"}]},{"partOfSpeech":"n.","definition":{"en":"A group of supporters or followers; sometimes used negatively to suggest a gang or people involved in wrongdoing.","zh":"一伙支持者/追随者；有时带贬义，指一帮参与坏事的人。"},"examples":[{"en":"The leader and his cohorts tried to silence the critics.","zh":"那位领导和他的一伙人试图让批评者噤声。"}]}],"synonyms":["group","class","generation","peer group","companions","associates","followers"],"phonetic":"/ˈkoʊˌhɔrts/","extraExplanation":["“cohort”最常见于学术与数据分析语境，如“birth cohort（出生队列）”“customer cohort（用户分群/同批用户）”“cohort study（队列研究）”。在这些场景里，它强调“同一批、可比较的一组人”。","词源上与古罗马军队单位有关（一“cohort”原是军团中的一个分队）。因此它天然带有“整组的人”这种集体概念。","日常口语里更常说“group/class/people”，而“cohort”听起来更正式、偏书面或专业。"]}
{"word":"cohos","summary":{"en":"“Cohos” means coho salmon (plural).","zh":"“cohos”指银鲑（coho salmon）的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plural form of “coho”: a type of Pacific salmon (also called coho salmon or silver salmon).","zh":"“coho”的复数：一种太平洋鲑鱼（也叫银鲑／狗鲑的一种，常称“银鲑”）。"},"examples":[{"en":"In the fall, cohos return from the ocean to rivers to spawn.","zh":"秋天时，银鲑会从海洋回到河流里产卵。"},{"en":"The market sells fresh cohos when the salmon run is strong.","zh":"鲑鱼洄游旺盛时，市场会卖新鲜的银鲑。"}]}],"synonyms":["coho salmon","silver salmon"],"phonetic":"/ˈkoʊhoʊz/","extraExplanation":["在北美语境里，“coho”通常指“coho salmon”（学名 Oncorhynchus kisutch），是常见的野生与养殖食用鱼之一。","写作中更常见的是用 “coho salmon” 来避免歧义；“cohos”多见于渔业、生态或新闻报道中指“多条银鲑/多种群的银鲑”。"]}
{"word":"cohosh","summary":{"en":"Cohosh is a North American plant, especially black cohosh, often mentioned as a medicinal herb or supplement.","zh":"cohosh 指一种北美植物（常指黑升麻），常作为草药或保健补充剂被提及。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a North American woodland plant with tall flower spikes, often used as a medicinal herb (especially black cohosh).","zh":"一种北美林地植物，开高高的花穗，常被当作草药使用（尤指黑升麻 black cohosh）。"},"examples":[{"en":"Black cohosh is sometimes used as an herbal supplement for menopause symptoms.","zh":"黑升麻有时被用作缓解更年期症状的草本补充剂。"},{"en":"The shaded trail was lined with cohosh in late spring.","zh":"暮春时节，阴凉的小径旁长着一片升麻。"}]},{"partOfSpeech":"n.","definition":{"en":"a supplement or preparation made from cohosh, taken for supposed health benefits.","zh":"由升麻制成的补充剂或制剂，用于所谓的保健功效。"},"examples":[{"en":"She asked her doctor whether cohosh could interact with her medication.","zh":"她问医生升麻制剂是否会与她的药物相互作用。"}]}],"synonyms":["black cohosh","bugbane (for black cohosh, older/common name)"],"phonetic":"/ˈkoʊ.hɑːʃ/","extraExplanation":["“Cohosh”常见于两种植物名：black cohosh（黑升麻，学名 Actaea racemosa）与 blue cohosh（蓝升麻，Caulophyllum thalictroides）。两者不是同一种植物，用途与安全性也不同，容易被混淆。","关于草药：黑升麻在英文健康类文章中常与 menopause（更年期）一起出现，但研究结论并不一致；此外可能有副作用或与药物相互作用。若用于保健，应优先咨询专业医疗人士。","词源：该词来自北美原住民语言，经由早期英语借入；在日常英语中，“cohosh”通常指黑升麻。"]}
{"word":"cohoshes","summary":{"en":"“Cohoshes” means the plural of cohosh—North American plants (like black or blue cohosh), sometimes discussed in gardening and herbal-medicine contexts.","zh":"“cohoshes”是 cohosh 的复数，指北美的一类植物（如黑升麻、蓝升麻），常见于园艺与草药相关语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of cohosh: a tall North American woodland plant, especially black cohosh or blue cohosh, sometimes used in traditional herbal medicine.","zh":"cohosh 的复数：一种北美林地的高大植物，尤指黑升麻或蓝升麻；在传统草药中有时会被使用。"},"examples":[{"en":"Some gardeners grow cohoshes in shady, moist areas.","zh":"一些园艺爱好者会在阴凉、潮湿的地方种植升麻类植物（cohoshes）。"},{"en":"The field guide warned that different cohoshes look similar when not in flower.","zh":"野外图鉴提醒：不同种类的升麻在不开花时外形很像。"}]}],"synonyms":["black cohosh","blue cohosh","bugbane (for black cohosh)"],"phonetic":"/ˈkoʊhɑːʃɪz/","extraExplanation":["“cohosh”常见于“black cohosh（黑升麻）”与“blue cohosh（蓝升麻）”。它们是不同植物（属/科可能不同），功效与安全性也不相同，不能混用。","在英语语境中，cohosh 常与“herbal supplement（草本补充剂）”一起出现，尤其是 black cohosh。有些人用于更年期相关不适，但研究结论不一；且可能与药物相互作用，孕期/哺乳期或肝功能问题者尤需先咨询专业人士。","词源上，“cohosh”来自阿尔冈昆语系（Algonquian languages）的原住民用语，反映了北美原住民对本土植物的命名与传统知识。"]}
{"word":"cohost","summary":{"en":"A cohost is someone who hosts an event or show together with another host; it can also mean to host together.","zh":"cohost 指“联合主持人”，也可作动词表示“共同主持”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who shares the role of hosting an event or program with another host (for example, a TV show, podcast, or meeting).","zh":"与他人共同担任主持的人；联合主持人（如电视节目、播客或会议）。"},"examples":[{"en":"She is the cohost of a popular podcast about science.","zh":"她是一档热门科学播客的联合主持人。"},{"en":"Our cohosts welcomed the guests and introduced the speakers.","zh":"我们的联合主持人欢迎来宾并介绍演讲者。"}]},{"partOfSpeech":"v.","definition":{"en":"To host an event or program together with another person.","zh":"与他人共同主持（活动或节目）。"},"examples":[{"en":"He will cohost the awards ceremony this year.","zh":"今年他将联合主持颁奖典礼。"},{"en":"They cohost a weekly livestream for language learners.","zh":"他们联合主持一个面向语言学习者的每周直播。"}]}],"synonyms":["co-presenter","joint host","co-anchor","co-emcee"],"phonetic":"/ˈkoʊˌhoʊst/","extraExplanation":["“co-”是常见前缀，表示“共同、一起”（如 co-worker 同事、coauthor 合著者）。因此 cohost 直观含义就是“共同主持/共同担任主办方”。","在播客和直播语境里，cohost 通常指与主主持人一起固定出镜、一起推进话题的人；有时也会出现 guest cohost（客座联合主持）。"]}
{"word":"cohosted","summary":{"en":"“Cohosted” means hosted jointly with someone else, or describes something that had more than one host.","zh":"“cohosted”表示“与他人共同主持/共同主办”，也可形容“由多人联合主持/主办的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of “cohost”: to host something together with another person (or group).","zh":"“cohost”的过去式/过去分词：与他人共同主持（活动、节目、会议等）。"},"examples":[{"en":"She cohosted the awards ceremony with a famous actor.","zh":"她和一位著名演员共同主持了颁奖典礼。"},{"en":"The webinar was cohosted by two professors from different universities.","zh":"这场网络研讨会由两位来自不同大学的教授共同主持。"},{"en":"They cohosted a podcast episode about travel on a budget.","zh":"他们共同主持了一期关于省钱旅行的播客节目。"}]},{"partOfSpeech":"adj.","definition":{"en":"describing an event or program that was hosted jointly by more than one host.","zh":"（作形容词用）指由多人联合主持/共同主办的（活动或节目）。"},"examples":[{"en":"It was a cohosted event between the student union and the library.","zh":"这是学生会和图书馆共同主办的活动。"},{"en":"The cohosted show alternated between the two presenters each week.","zh":"这档联合主持的节目每周在两位主持人之间轮换。"}]}],"synonyms":["jointly hosted","co-presented","co-led"],"phonetic":"/koʊˈhoʊstɪd/","extraExplanation":["拼写上常见两种：cohosted 与 co-hosted（带连字符）。两者都对；在较正式或编辑规范较严格的写作中，co-hosted 更常见；在科技/社交媒体语境中，cohosted 也很常见。","常见搭配：cohost a show/podcast/webinar（共同主持节目/播客/研讨会）；cohost an event（共同主办活动）。注意：host 表示“主持/主办”，不是“主人”那个语感。"]}
{"word":"cohostess","summary":{"en":"A cohostess is a woman who shares hosting or presenting duties with another person.","zh":"cohostess 指与他人共同承担主持或主办工作的一位女性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A woman who shares hosting duties with someone else (for example, on a TV show, podcast, event, or meeting).","zh":"（与他人共同担任主持/接待工作的）女共同主持人；女联合主办人。"},"examples":[{"en":"She is the cohostess of a popular morning show.","zh":"她是一档热门晨间节目的女共同主持人。"},{"en":"The cohostess welcomed guests while the host gave the opening remarks.","zh":"女联合主持人负责迎接来宾，而主持人发表开场致辞。"}]},{"partOfSpeech":"n.","definition":{"en":"A woman who helps host a social event or gathering, sharing responsibilities such as greeting guests and organizing activities.","zh":"（协助主办聚会/活动的）女主人；女协办者。"},"examples":[{"en":"As cohostess, Maya handled the seating plan and introductions.","zh":"作为女协办者，玛雅负责座位安排和介绍来宾。"},{"en":"They thanked the hostess and cohostess for organizing the fundraiser dinner.","zh":"他们感谢女主人和女协办者组织了这场筹款晚宴。"}]}],"synonyms":["co-host (gender-neutral)","joint host","co-presenter","host (general)"],"phonetic":"/ˈkoʊˌhoʊstəs/","extraExplanation":["“cohostess”是带性别标记的词（-ess 常表示“女性”），现代英语里在很多场合更常用中性表达“co-host”来指任何性别的共同主持/联合主办者；在正式写作或强调性别不重要时，用“co-host”更自然。"]}
{"word":"cohostesses","summary":{"en":"“Cohostesses” means women who jointly host an event or program (female co-hosts).","zh":"“cohostesses”指共同主持/主办某活动或节目的女性（女性共同主持人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"women who share the role of hosting an event, show, or program with someone else; female co-hosts","zh":"与他人共同担任主持/主办的人；（女性）共同主持人/共同主办人"},"examples":[{"en":"The cohostesses welcomed guests at the charity dinner and introduced the speakers.","zh":"两位共同女主持在慈善晚宴上欢迎来宾，并介绍演讲者。"},{"en":"The TV show’s cohostesses took turns interviewing the athletes.","zh":"那档电视节目的两位共同女主持轮流采访运动员。"}]}],"synonyms":["co-hosts","co-hostesses","presenters","hosts"],"phonetic":"ˌkoʊˈhoʊstɪs","extraExplanation":["“cohostess”是较偏旧式、带性别标记的说法（hostess 指女性主持人）。现代英语里更常用性别中性的“co-host”（不分男女）来指共同主持人。","拼写上也常见“co-hostess / cohostess”。复数形式为“cohostesses / co-hostesses”。"]}
{"word":"cohosting","summary":{"en":"Cohosting means hosting something together with someone else.","zh":"cohosting 指与他人共同主持某个节目、活动或会议。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of hosting something together with one or more other people (e.g., a podcast, event, livestream, or meeting).","zh":"与一人或多人共同主持（如播客、活动、直播或会议）的行为。"},"examples":[{"en":"Cohosting the podcast with Maya makes the conversations more balanced.","zh":"和Maya一起共同主持这个播客，让对话更均衡。"},{"en":"They are cohosting a charity event this weekend.","zh":"他们这周末将共同主持一场慈善活动。"},{"en":"Thanks for cohosting the meeting and keeping us on schedule.","zh":"谢谢你共同主持会议并帮大家按时推进。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “cohost”: hosting something together with another person or group.","zh":"动词“cohost”的现在分词：与他人或团队一起主持。"},"examples":[{"en":"She’s cohosting tonight’s livestream, so she’ll answer audience questions too.","zh":"她今晚在共同主持直播，所以也会回答观众提问。"},{"en":"I’m cohosting the workshop, but my colleague will lead the hands-on part.","zh":"我在共同主持这场工作坊，但实操部分会由同事带领。"}]}],"synonyms":["co-hosting","joint hosting","shared hosting","co-presenting"],"phonetic":"/ˌkoʊˈhoʊstɪŋ/","extraExplanation":["“cohosting”来自“co-（共同）+ hosting（主持）”。常见写法有 cohosting（较常见于美式写作）和 co-hosting（更强调结构、也很常见）。对应的人称名词是 cohost / co-host（共同主持人）。","使用场景多见于播客、电视节目、直播、线上会议与活动策划等语境；比起“hosting”，它强调分工合作、轮流发言或共同引导流程。"]}
{"word":"cohosts","summary":{"en":"“Cohosts” means people who host something together, or (as a verb) the action of hosting together.","zh":"“cohosts”指共同主持的人（复数），也可作动词表示“共同主持”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who host a show, event, or program together with someone else (plural of “cohost”).","zh":"与他人一起主持节目或活动的人（“cohost”的复数）。"},"examples":[{"en":"The podcast’s cohosts take turns introducing each topic.","zh":"这档播客的联合主持人轮流介绍每个话题。"},{"en":"The cohosts welcomed the guests and explained the rules of the game.","zh":"联合主持人欢迎来宾并说明游戏规则。"}]},{"partOfSpeech":"v.","definition":{"en":"To host a show or event together with another person (third-person singular: “cohosts”).","zh":"与他人共同主持（第三人称单数：cohosts）。"},"examples":[{"en":"She cohosts a weekly radio show with her brother.","zh":"她和哥哥共同主持一档每周电台节目。"},{"en":"He cohosts the award ceremony every year.","zh":"他每年都共同主持颁奖典礼。"}]}],"synonyms":["joint hosts","co-presenters","co-anchors","co-moderators"],"phonetic":"/ˈkoʊhoʊst/","extraExplanation":["在写法上，“cohost”也常写作“co-host”。两者意思相同；正式写作有时更偏好带连字符的形式，但现代媒体与社交平台中不带连字符也很常见。"]}
{"word":"cohousing","summary":{"en":"Cohousing is a community living style combining private homes with shared spaces and cooperative neighbor life.","zh":"Cohousing（共居）是一种把独立住房与共享空间结合、并强调邻里协作的社区生活方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of intentional community where people live in private homes but share common spaces (like a kitchen, garden, or lounge) and collaborate on some daily activities and decisions.","zh":"一种“共居/合作居住”的社区模式：居民住在各自独立的住房里，但共享公共空间（如公共厨房、花园、活动室等），并在日常事务与社区决策上有一定程度的合作。"},"examples":[{"en":"They chose cohousing because they wanted privacy but also a supportive neighborhood.","zh":"他们选择共居社区，因为他们既想要隐私，也想要互相支持的邻里环境。"},{"en":"In the cohousing community, neighbors take turns cooking a shared dinner once a week.","zh":"在共居社区里，邻居们每周轮流做一次公共晚餐。"},{"en":"Cohousing can help reduce loneliness, especially for older adults.","zh":"共居模式能帮助减少孤独感，尤其对年长者很有帮助。"}]}],"synonyms":["intentional community","cooperative housing","community living","shared living"],"phonetic":"/ˈkoʊˌhaʊzɪŋ/","extraExplanation":["“cohousing”通常指一种有组织的“意向型社区”(intentional community)。它强调：私人居住空间 + 共享公共设施 + 社区协作治理（例如定期开会、共同制定规则）。","概念在20世纪后期在丹麦等地较早发展，后来在美国、加拿大等地也出现不同形式的共居社区。","常见相关词：cohousing community（共居社区）、common house（公共屋/公共空间）、shared amenities（共享设施）、intentional community（意向型社区）。"]}
{"word":"cohow","summary":{"en":"“Cohow” is a rare/variant spelling of “cahow,” meaning the Bermuda petrel, a protected seabird.","zh":"“cohow”多为“cahow”的少见变体拼写，指百慕大海燕（一种受保护的海鸟）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare seabird (the Bermuda petrel), usually spelled “cahow”; “cohow” is an uncommon variant spelling.","zh":"一种稀有海鸟（百慕大海燕），通常拼作“cahow”；“cohow”是不常见的变体拼写。"},"examples":[{"en":"Scientists worked for decades to protect the cahow (sometimes spelled cohow).","zh":"科学家们花了几十年时间保护百慕大海燕（有时也写作 cohow）。"},{"en":"The cahow is famous in Bermuda as a conservation success story.","zh":"百慕大海燕在百慕大以“保育成功案例”而闻名。"}]}],"synonyms":["cahow","Bermuda petrel"],"phonetic":"/kəˈhaʊ/","extraExplanation":["“cahow”指百慕大特有、曾一度被认为灭绝的海鸟——百慕大海燕（Bermuda petrel）。后来人们重新发现并开展长期保护工作，因此它常被用来象征“失而复得/自然保育的希望”。","如果你想表达的是别的词（例如拼写打错），你可以告诉我你看到它的句子或语境，我可以帮你确认真正的目标词。"]}
{"word":"cohue","summary":{"en":"Cohue is a regional name for an evergreen southern beech tree in Chile/Argentina, often spelled coihue.","zh":"Cohue 是智利/阿根廷一种常绿南极山毛榉的地区性名称，常写作 coihue。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in South America, especially Chile and Argentina) an evergreen southern beech tree (genus *Nothofagus*), valued for its timber; often spelled **coihue**.","zh":"（南美，尤指智利和阿根廷）一种常绿的南极山毛榉（*Nothofagus* 属）树木，木材有用；常见拼写为 **coihue / coihüe**。"},"examples":[{"en":"The trail passed through a forest of cohue trees.","zh":"这条步道穿过一片 cohue（南极山毛榉）树林。"},{"en":"Cohue wood is sometimes used for furniture and construction.","zh":"Cohue 的木材有时用于制作家具和建筑。"}]}],"synonyms":["coihue","southern beech","Nothofagus"],"phonetic":"/kɔɪˈweɪ/","extraExplanation":["“cohue”多被认为是西班牙语拼写变体；更常见的形式是 **coihue / coihüe**，词源来自马普切语（Mapudungun），是智利南部常见树种名称。英语里通常作为地区性植物名出现，在一般词典中不一定常收录。"]}
{"word":"cohune","summary":{"en":"Cohune is a Central American palm tree whose nuts can be pressed to make cohune oil.","zh":"cohune 指一种中美洲棕榈树，其果仁可榨取科胡内油。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tall Central American palm tree (Attalea cohune) whose hard nuts produce cohune oil, used for cooking and in soaps and candles","zh":"科胡内棕榈（Attalea cohune），一种中美洲高大的棕榈树；其坚硬果仁可榨取科胡内油，用于烹饪及制皂、制蜡烛等"},"examples":[{"en":"Cohune palms are common in parts of Belize and Guatemala.","zh":"在伯利兹和危地马拉的部分地区，科胡内棕榈很常见。"},{"en":"The community collected cohune nuts to press oil for soap-making.","zh":"社区收集科胡内棕榈果仁来榨油，用于制作肥皂。"}]}],"synonyms":["cohune palm","Attalea cohune"],"phonetic":"/koʊˈhuːni/","extraExplanation":["“cohune”一词多见于中美洲英语语境，常指“cohune palm（科胡内棕榈）”或其果仁/油。它在伯利兹、危地马拉、洪都拉斯等地较常见。","科胡内油（cohune oil）属于植物油，传统上用于食用、点灯、做蜡烛与肥皂；在一些文献里也会提到“cohune nuts（科胡内果仁）”作为油料来源。"]}
{"word":"cohunes","summary":{"en":"“cohunes” is not standard English; it’s usually a misspelling of “cojones,” slang for courage (literally “testicles” in Spanish) and often vulgar.","zh":"“cohunes”不是标准英语，通常是把“cojones”拼错了；它在英语俚语里多指“胆量/魄力”，字面为西班牙语“睾丸”，常带粗俗语感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard spelling) A misspelling of “cojones,” a Spanish-derived slang word used in English to mean “courage” or “nerve.” It is often considered vulgar.","zh":"（非标准拼写）常见为“cojones”的误拼。该词源自西班牙语，在英语口语中多指“胆量/勇气/魄力”，但通常被认为带粗俗色彩。"},"examples":[{"en":"It takes real cojones to speak up in that meeting.","zh":"在那种会议上敢站出来发言，真的很需要胆量。"},{"en":"The coach told the team to play with cojones.","zh":"教练让队员们踢得更有血性、更有胆魄。"}]},{"partOfSpeech":"n.","definition":{"en":"(Literal, Spanish) “Testicles.” In English, using it literally is usually crude and can sound offensive.","zh":"（字面义，西班牙语）“睾丸”。在英语里若按字面使用，通常比较粗俗，可能冒犯他人。"},"examples":[{"en":"That word literally means “testicles” in Spanish.","zh":"那个词在西班牙语里字面意思是“睾丸”。"}]}],"synonyms":["courage","guts","nerve","backbone"],"phonetic":"/koʊˈhoʊneɪz/","extraExplanation":["“cojones”在英语里多用于非正式、强调气势的场合（比如体育、电影台词），但因为字面含义带性器官指涉，正式场合或对不熟的人使用不太合适。更中性的替代表达有：courage, guts, nerve, backbone。","如果你本来想写的是别的词（例如姓氏、地名或品牌名），“cohunes”也可能是专有名词的拼写；你可以告诉我上下文句子，我可以帮你确认。"]}
{"word":"cohusband","summary":{"en":"A cohusband is one of two or more men married to the same woman.","zh":"cohusband 指一妻多夫关系中，与他人共同拥有同一位妻子的丈夫之一。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"one of two or more men who are married to the same woman (in a polyandrous marriage)","zh":"（一妻多夫制中）与他人共同拥有同一位妻子的丈夫之一"},"examples":[{"en":"In some polyandrous societies, a woman may have two cohusbands.","zh":"在一些实行一妻多夫制的社会里，一位女性可能有两位共夫。"},{"en":"He introduced the visitor as his cohusband, explaining their shared marriage.","zh":"他把来访者介绍为自己的共夫，并解释他们是同一段婚姻关系中的丈夫。"}]}],"synonyms":["co-husband","shared husband (context-dependent)"],"phonetic":"/ˈkoʊˌhʌzbənd/","extraExplanation":["“cohusband”更常写作带连字符的“co-husband”。这个词多见于人类学、社会学或法律/文化讨论，用来描述“一妻多夫（polyandry）”中的婚姻关系。","日常英语里很少用到；在跨文化话题中使用时，建议保持中性、尊重的语气，避免将其当作猎奇表达。","可对比：co-wife（共妻/同夫之妻，指一夫多妻中共享同一位丈夫的妻子之一）。"]}
{"word":"Cohutta","summary":{"en":"Cohutta is a U.S. place name, especially for the Cohutta Mountains and the Cohutta Wilderness in Georgia and Tennessee.","zh":"Cohutta 是美国地名，尤指乔治亚州与田纳西州的科胡塔山脉与科胡塔荒野保护区。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A place name in the U.S., most commonly referring to the Cohutta Mountains and the Cohutta Wilderness on the Georgia–Tennessee border.","zh":"美国的地名，最常见指乔治亚州与田纳西州交界的科胡塔山脉（Cohutta Mountains）以及科胡塔荒野保护区（Cohutta Wilderness）。"},"examples":[{"en":"We went hiking in the Cohutta Wilderness last weekend.","zh":"我们上周末去科胡塔荒野保护区徒步了。"},{"en":"The Cohutta Mountains are known for remote trails and dense forests.","zh":"科胡塔山脉以偏远的步道和茂密的森林而闻名。"}]},{"partOfSpeech":"other","definition":{"en":"A surname or given name (rare), based on the same place name.","zh":"姓氏或名字（较少见），来源于同一个地名。"},"examples":[{"en":"Cohutta is an unusual first name, but it’s memorable.","zh":"Cohutta 是个不太常见的名字，但很容易让人记住。"}]}],"synonyms":["Cohutta Mountains","Cohutta Wilderness"],"phonetic":"/koʊˈhʌtə/","extraExplanation":["“Cohutta”主要作为专有名词使用，因此通常不翻译，只按英文音译/原名保留。","该地名常被认为与切罗基（Cherokee）相关的地名传统有关；在旅行、徒步、露营语境中，你更常看到它出现在“Cohutta Wilderness / Cohutta Mountains”等搭配里。"]}

