{"word":"COI","summary":{"en":"COI is an abbreviation most commonly meaning “conflict of interest,” and in insurance/business contexts it can also mean “certificate of insurance” or “cost of insurance.”","zh":"COI 是一个缩写，最常见指“利益冲突”；在保险/商务语境中也可能指“保险证明”或“保险成本”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) conflict of interest: a situation where someone’s personal benefit could influence (or seem to influence) their professional judgment.","zh":"（缩写）利益冲突：个人利益可能影响（或看起来会影响）其专业判断的情况。"},"examples":[{"en":"The editor disclosed a COI because the author is a close friend.","zh":"这位编辑披露了COI，因为作者是他的亲密朋友。"},{"en":"To avoid a COI, she did not vote on the contract decision.","zh":"为了避免利益冲突，她没有参与合同决策的投票。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) certificate of insurance: a document proving that an insurance policy exists and summarizing its main coverage.","zh":"（缩写）保险证明（保险凭证）：证明某项保险已生效并概述主要保障内容的文件。"},"examples":[{"en":"The landlord asked for a COI before we moved in.","zh":"房东要求我们入住前提供COI（保险证明）。"},{"en":"Please email the COI showing general liability coverage.","zh":"请通过邮件发送显示一般责任险保障的COI。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) cost of insurance: the amount you pay for insurance coverage (often discussed in finance or loan contexts).","zh":"（缩写）保险成本：为获得保险保障而支付的费用（常见于金融或贷款语境）。"},"examples":[{"en":"The COI increased as the borrower got older.","zh":"随着借款人年龄增长，COI（保险成本）也上升了。"},{"en":"They compared COI across plans before choosing one.","zh":"他们在选择方案前比较了不同计划的COI。"}]}],"synonyms":["conflict of interest","insurance certificate","insurance cost"],"phonetic":"ˌsiː oʊ ˈaɪ","extraExplanation":["COI 是缩写，具体含义高度依赖语境：在公司合规、学术期刊、政府采购中，最常见是 conflict of interest（利益冲突）。","在房地产租赁、承包工程、活动场地等场景里，COI 常指 certificate of insurance（保险证明），通常由保险公司或经纪人出具。","读到 COI 时可以通过附近词判断：出现 disclose/declare/ethics/recuse 多半是“利益冲突”；出现 landlord/vendor/coverage/liability 多半是“保险证明”。"]}
{"word":"Coibita","summary":{"en":"“Coibita” is not standard English; in Portuguese it means “restrained/curbed/prevented.”","zh":"“Coibita”不是标准英语词；在葡萄牙语中意为“被抑制/被遏制/被制止的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not a standard English word. In Portuguese, “coibita” is the feminine form of the past participle/adjective from **coibir**, meaning “restrained; curbed; prevented.”","zh":"不是标准英语词。在葡萄牙语中，“coibita”是动词 **coibir** 的过去分词/形容词阴性形式，意思是“被抑制的；被遏制的；被制止的”。"},"examples":[{"en":"In the report (Portuguese), the spread of misinformation was **coibita** by stricter rules.","zh":"在这份报告（葡语）中，错误信息的传播因更严格的规定而被**遏制**。"},{"en":"She felt **coibita** and spoke very little during the meeting (Portuguese usage).","zh":"她感到很**拘束/被压抑**，在会议上几乎没怎么说话。（葡语用法）"}]}],"synonyms":["curbed","restrained","suppressed","inhibited"],"phonetic":"/koʊˈiːbɪtə/","extraExplanation":["“coibita”更常见于葡萄牙语（也可能出现在巴西葡语）语境中；在英语里通常不会这样用。如果你是在英语学习中看到它，很可能是：1）文本里夹杂了葡语；或 2）你想查的是拼写相近的英语词。","你可能想查的英语词：**cohabit**（同居）/ **inhibit**（抑制）/ **prohibit**（禁止）。如果你告诉我它出现的句子或语境，我可以帮你确认具体是哪一个。"]}
{"word":"coidentity","summary":{"en":"Coidentity means a shared or joint identity, often used in academic or theoretical writing.","zh":"Coidentity 指“共同身份/共认同”，多见于学术或理论写作中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a shared or joint identity; the state of being identified together as one identity or as closely linked identities","zh":"共同身份；共认同（指两个或多个个体/群体被视为拥有同一或紧密相连的身份）"},"examples":[{"en":"In the online community, fans developed a strong coidentity around the band’s music and values.","zh":"在这个线上社群里，粉丝围绕这支乐队的音乐和价值观形成了很强的共同身份认同。"},{"en":"The program encourages coidentity between local residents and newcomers through shared projects.","zh":"该项目通过共同的活动与项目，促进本地居民与新来者之间的共同身份感。"}]},{"partOfSpeech":"n.","definition":{"en":"in some academic contexts (especially logic or mathematics), a relation of being the same or equivalent in identity; identity considered in parallel with another","zh":"（学术语境，尤指逻辑/数学）共身份关系；并列地讨论“同一性/等同”的关系"},"examples":[{"en":"The paper discusses identity and coidentity as complementary ways to describe equivalence.","zh":"这篇论文把“同一性”和“共同一性（coidentity）”作为互补方式来描述等价关系。"}]}],"synonyms":["shared identity","common identity","collective identity","joint identity"],"phonetic":"/ˌkoʊaɪˈdɛntɪti/","extraExplanation":["“co-”表示“共同、一起”。“coidentity”并不是高频日常词，更常见的表达是“shared identity / common identity / collective identity”。在写作中若使用“coidentity”，通常带有学术或理论色彩，强调“共同建构的认同”。"]}
{"word":"coif","summary":{"en":"Coif means to style hair carefully, or a neat hairstyle; historically, it can also mean a close-fitting cap/hood.","zh":"coif 可指精心梳理头发（动词）或整齐的发型（名词）；在历史语境中也可指贴头帽/头套。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to style, arrange, or groom (someone’s hair) carefully, often to look neat or fashionable","zh":"（精心）梳理、整理（头发）；做发型"},"examples":[{"en":"She had her hair coifed for the wedding.","zh":"她为婚礼把头发精心做了造型。"},{"en":"The actor was coifed and ready for the red carpet.","zh":"那位演员已经打理好发型，准备走红毯。"}]},{"partOfSpeech":"n.","definition":{"en":"a carefully arranged hairstyle; a well-groomed head of hair","zh":"精心整理的发型；梳理得很整齐的头发"},"examples":[{"en":"His coif stayed perfect even in the wind.","zh":"即使有风，他的发型依然很完美。"},{"en":"She wore a sleek coif and simple makeup.","zh":"她梳了一个利落的发型，妆容很淡。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) a close-fitting cap or hood, often worn under a helmet in medieval times","zh":"（历史）贴头帽；（中世纪）常戴在头盔下的头套/软帽"},"examples":[{"en":"The knight pulled on a padded coif before putting on his helmet.","zh":"骑士戴上带衬垫的贴头帽后才戴头盔。"},{"en":"In the museum, you can see chain-mail coifs from the Middle Ages.","zh":"在博物馆里你可以看到中世纪的锁子甲头套。"}]}],"synonyms":["style","arrange","groom","do (one’s) hair","hairdo","hairstyle","coiffure"],"phonetic":"/kwɑf/","extraExplanation":["词源上，coif 来自法语（coiffe），与“头饰/发型”的概念有关。因此它既可指“做发型”（动词），也可指“发型本身”（名词）。","现代英语里更常见的是“做发型/发型”（多用于较正式或描写性的语境）；“中世纪贴头帽/锁子甲头套”的意思较偏历史语境。"]}
{"word":"coifed","summary":{"en":"“Coifed” usually means neatly and stylishly arranged (especially hair); less commonly, it means wearing a historical close-fitting cap (a coif).","zh":"“coifed”通常指（尤其头发）梳理得整齐、精心做过造型；较少见时指戴着一种历史上的贴头帽（coif）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of hair) styled or arranged neatly, often in a polished or fashionable way.","zh":"（头发）梳理整齐的；精心做过造型的（常带有精致、时髦的感觉）。"},"examples":[{"en":"She walked in with perfectly coifed hair and a crisp blazer.","zh":"她走进来时头发梳得一丝不乱，外套也很挺括。"},{"en":"His coifed look made him seem more formal than usual.","zh":"他精心打理的造型让他看起来比平时更正式。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common) wearing a coif—a close-fitting cap or head covering, especially in historical contexts.","zh":"（较少见）戴着贴头的帽子/头巾（coif，常见于历史语境）。"},"examples":[{"en":"In the portrait, the woman is coifed in a white linen cap.","zh":"在那幅肖像里，那位女子戴着白色亚麻贴头帽。"},{"en":"The actors were coifed to match the medieval costumes.","zh":"演员们戴上贴头帽，以配合中世纪服装。"}]}],"synonyms":["well-groomed","neatly styled","carefully arranged","sleek","polished"],"phonetic":"/kɔɪft/","extraExplanation":["“coifed”来自动词“to coif”（梳理、做发型），也与名词“coif”（贴头帽）有关。现代英语里最常用的是形容“头发精心打理”。在时尚、影视评论中常用来强调“看起来很精致、很上镜”。"]}
{"word":"coiffe","summary":{"en":"Coiffe means a styled hairstyle, or the act of styling hair (a less common, French-flavored form of coif).","zh":"coiffe 指发型或做发型（英语中较少见，带法语色彩，类似 coif）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often French-influenced) a hairstyle; the way someone’s hair is arranged, especially in a styled or formal way.","zh":"（常带法语色彩）发型；（尤指精心打理或正式的）头发造型。"},"examples":[{"en":"She changed her coiffe for the evening party.","zh":"为了晚宴，她换了一个发型。"},{"en":"The actor’s coiffe was styled to match the 1920s setting.","zh":"这位演员的发型被打理成与20世纪20年代背景相符的样式。"}]},{"partOfSpeech":"vt.","definition":{"en":"to arrange or style someone’s hair (often used in fashion or salon contexts).","zh":"为……梳理／做造型（常用于时尚或美发语境）。"},"examples":[{"en":"The stylist coiffed her hair into a neat updo.","zh":"造型师把她的头发盘成了利落的发髻。"},{"en":"He was coiffed and ready for the photo shoot.","zh":"他的发型已打理好，准备拍摄了。"}]}],"synonyms":["coif","hairstyle","hairdo","coiffure","style (hair)"],"phonetic":"/kwɑːf/","extraExplanation":["“coiffe”在英语里较少见，更常见的是拼写为“coif”（名词/动词）或“coiffure”（名词，指发型或发式设计）。在时尚、美容、文学描写中，用“coiffe/coiffed”会显得更“法式”、更精致。","来源上与法语 coiffer（梳理头发、戴头饰）有关；在英语语境里常带有“精心打理、沙龙造型”的联想。"]}
{"word":"coiffed","summary":{"en":"“Coiffed” means hair that has been carefully styled and looks neat; it can also mean “styled (hair)” as the past form of “coif.”","zh":"“coiffed”指头发被精心做过造型、显得整齐精致；也可作动词“coif”的过去式/过去分词，表示“把头发精心梳理/造型”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of hair) styled carefully and neatly; well-groomed.","zh":"（多指头发）精心打理过的；梳理整齐的；很讲究的。"},"examples":[{"en":"She arrived with perfectly coiffed hair.","zh":"她到场时头发梳得一丝不乱。"},{"en":"The actor’s coiffed look matched the formal event.","zh":"那位演员梳理整齐的造型很符合正式场合。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of “coif”: to style or arrange (hair) carefully.","zh":"“coif”的过去式/过去分词：把（头发）精心梳理、造型。"},"examples":[{"en":"The stylist coiffed her hair into soft waves.","zh":"造型师把她的头发做成柔和的波浪卷。"},{"en":"He had his hair coiffed before the photo shoot.","zh":"拍摄前他把头发精心做了造型。"}]}],"synonyms":["well-groomed","neatly styled","sleek","tidy","polished"],"phonetic":"/kwɑːft/","extraExplanation":["“coiffed”常出现在时尚、影视、社交媒体或人物描写里，语气偏“精致、讲究”，有时也带一点“刻意打扮得很完美”的感觉。","词源上与法语 coiffer（给头发戴帽/梳理）有关，所以在英语里常和发型、造型联系在一起。常见搭配：coiffed hair / neatly coiffed / perfectly coiffed。"]}
{"word":"coiffes","summary":{"en":"“Coiffes” means multiple “coiffes”—historical or ceremonial head coverings, often seen in traditional dress or religious contexts.","zh":"“Coiffes”是“coiffe”的复数，指多种历史或礼仪性的头部覆盖物，常见于传统服饰或宗教语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of coiffe: a close-fitting cap or head covering (often associated with historical or ceremonial dress, or a nun’s headdress)","zh":"coiffe 的复数：一种贴头的帽子或头部覆盖物（常见于历史/礼仪服饰，也可指修女的头巾）"},"examples":[{"en":"In the painting, several women wear white coiffes as part of their traditional costume.","zh":"在那幅画里，几位女性穿着传统服饰，头上戴着白色的 coiffes。"},{"en":"The museum display includes lace coiffes from the 1800s.","zh":"博物馆展柜里有一些19世纪的蕾丝 coiffes。"}]}],"synonyms":["headdresses","caps","bonnets","head coverings"],"phonetic":"/kwɑf/","extraExplanation":["“coiffe / coiffes”是从法语借入的词，常出现在历史、艺术、服饰研究语境中；日常英语里更常用更通用的说法如 cap、bonnet、headdress。","词形提示：coiffes 是复数；单数是 coiffe。有时你也会看到更常见的相关词 coif（既可作名词也可作动词，如 “to coif one’s hair”=把头发梳理成某种样式），但语体偏文学或正式。"]}
{"word":"coiffeur","summary":{"en":"A coiffeur is a (usually male) hairdresser or hairstylist, often in a salon context.","zh":"coiffeur 指（通常为男性的）理发师/美发师，常带有沙龙、时尚语境的意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person (usually a man) who cuts and styles hair; a hairdresser, especially in a salon.","zh":"（通常指男性的）理发师、美发师；尤指在美发沙龙里为人剪发造型的人。"},"examples":[{"en":"She booked an appointment with a coiffeur for a new haircut.","zh":"她预约了一位美发师，想换个新发型。"},{"en":"The coiffeur suggested a style that would suit his face shape.","zh":"美发师建议了一个更适合他脸型的发型。"}]}],"synonyms":["hairdresser","hairstylist","stylist","barber"],"phonetic":"/kwɑːˈfɝː/","extraExplanation":["“Coiffeur”是从法语借入英语的词，在英语里带有一点“高端/时尚/沙龙”的感觉；日常口语中更常说“hairdresser”或“stylist”。","词根与法语“coiffer”（给头发梳理、做造型）有关，所以常见于时尚、美容、美发语境。","女性形式在法语中是“coiffeuse”；英语里有时也会见到，但更常用性别中性的“hairdresser/stylist”。"]}
{"word":"coiffeurs","summary":{"en":"“Coiffeurs” means hairdressers (plural of “coiffeur”), often with a slightly French/formal tone in English.","zh":"coiffeurs 是“coiffeur”的复数，指发型师/理发师，在英语里常带一点法式或较正式的语感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “coiffeur”: hairdressers; people whose job is cutting and styling hair (often used in a slightly formal or French-styled way).","zh":"“coiffeur”的复数：理发师/发型师；以剪发与造型为职业的人（在英语中带一点法式、较正式的语感）。"},"examples":[{"en":"The hotel spa has two coiffeurs who can do quick blowouts before events.","zh":"酒店的水疗中心有两位发型师，可以在活动前做快速吹整造型。"},{"en":"Several coiffeurs from the salon volunteered to style hair for the charity show.","zh":"沙龙里的几位发型师自愿为慈善秀做发型。"}]}],"synonyms":["hairdressers","hairstylists","stylists"],"phonetic":"/kwɑˈfɝz/","extraExplanation":["“coiffeur”源自法语，在英语里比更常见的 hairdresser / stylist 更偏“法式、讲究”的风格，有时也会让人联想到高端沙龙或时尚圈。","在日常英语中，人们更常说 hairdresser（较通用）或 hairstylist/stylist（强调造型与时尚感）；barber 通常指主要给男性剪短发、修胡子的“理发店师傅”。"]}
{"word":"coiffeuse","summary":{"en":"Coiffeuse can mean (1) a female hairdresser (formal/old-fashioned) or (2) a dressing table/vanity with a mirror (often French/antique style).","zh":"coiffeuse 可指（1）女性理发师/女发型师（较正式或略旧式），也可指（2）带镜子的梳妆台（常见于法式/古董语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman who works as a hairdresser; a female hairstylist (a French loanword, used mainly in formal or old-fashioned contexts).","zh":"（女性）理发师；女发型师（法语外来词，多见于较正式或略带旧式的语境）。"},"examples":[{"en":"At the theater, her coiffeuse pinned up her hair in a classic style.","zh":"在剧院里，她的女发型师把她的头发盘成了经典发型。"},{"en":"The magazine praised the coiffeuse for creating elegant looks for the models.","zh":"杂志称赞那位女发型师为模特打造了优雅造型。"}]},{"partOfSpeech":"n.","definition":{"en":"a dressing table (vanity) with a mirror, often in a French or antique style.","zh":"（带镜子的）梳妆台；梳妆桌（常带法式或古典风格）。"},"examples":[{"en":"She placed her perfume bottles on the coiffeuse by the window.","zh":"她把香水瓶放在窗边的梳妆台上。"},{"en":"The antique coiffeuse came with a folding mirror and small drawers.","zh":"那张古董梳妆台配有可折叠的镜子和小抽屉。"}]}],"synonyms":["hairdresser","hairstylist","stylist","vanity","dressing table"],"phonetic":"/kwɑːˈfɜːz/","extraExplanation":["“coiffeuse”来自法语：在法语里更偏向“女发型师”，对应男性形式是“coiffeur”。英语里这两个词都较少见，日常更常说“hairdresser / hairstylist”。","表示“梳妆台”这一义项时，英语里也更常用“vanity”或“dressing table”。在家居、古董或法式风格的描述中更可能看到“coiffeuse”。"]}
{"word":"coiffeuses","summary":{"en":"Coiffeuses is the plural of coiffeuse, meaning either female hairdressers or (less commonly) French-style dressing tables with mirrors.","zh":"coiffeuses 是 coiffeuse 的复数，指女美发师，或（较少见）法式带镜梳妆台。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) women’s hairdressers; female hairstylists (singular: coiffeuse).","zh":"（复数）女美发师；女性发型师（单数：coiffeuse）。"},"examples":[{"en":"The salon hired two new coiffeuses before the holiday season.","zh":"这家沙龙在假日旺季前新雇了两位女美发师。"},{"en":"In old films, coiffeuses often set hair in elaborate styles.","zh":"在老电影里，女美发师常常把头发做成很复杂的造型。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) small dressing tables/vanities with a mirror, especially in a French or classic style (singular: coiffeuse).","zh":"（复数）带镜子的梳妆台（尤指法式或古典风格的）（单数：coiffeuse）。"},"examples":[{"en":"Antique coiffeuses with tri-fold mirrors are popular with collectors.","zh":"带三折镜的古董梳妆台很受收藏家欢迎。"},{"en":"They placed matching coiffeuses in each bedroom.","zh":"他们在每间卧室里都放了同款梳妆台。"}]}],"synonyms":["hairdressers","hairstylists","stylists","vanities","dressing tables"],"phonetic":"/kwɑːˈfɜːz/","extraExplanation":["“coiffeuse”源自法语，字面与“发型/梳头”有关。英语里它带有一点“法式、复古或时尚圈”的语感：日常口语更常说 hairdresser / hairstylist；而表示家具时，现代英语更常说 vanity / dressing table。","发音提示：开头更像“kwa-”，重音通常在第二音节（-fuse）。"]}
{"word":"coiffing","summary":{"en":"“Coiffing” means styling or arranging hair, often in a salon or fashion context.","zh":"“coiffing”指为头发梳理并造型，常见于美发或时尚语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of styling, arranging, or dressing someone’s hair (often in a salon or fashion context)","zh":"（常用于美发或时尚语境）为某人做发型、梳理并造型的行为"},"examples":[{"en":"She spent an hour on coiffing before the wedding photos.","zh":"拍婚纱照前，她花了一个小时做发型。"},{"en":"Backstage, the team is busy with makeup and coiffing.","zh":"后台团队正忙着化妆和做发型。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “coif”: styling or arranging hair","zh":"“coif”的现在分词：正在为头发造型、梳理头发"},"examples":[{"en":"The stylist is coiffing the model’s hair into soft waves.","zh":"造型师正在把模特的头发做成柔和的波浪卷。"},{"en":"He’s coiffing his hair carefully for the interview.","zh":"他正仔细打理头发准备面试。"}]}],"synonyms":["hair styling","styling hair","doing hair","fixing hair","grooming"],"phonetic":"/ˈkwɑːfɪŋ/","extraExplanation":["“coiffing”来自动词“coif”（做发型、梳理并造型）。它常见于时尚、美容、摄影等较“精致/正式”的语境里，日常口语更常说“do/style/fix (someone’s) hair”。","拼写上你可能也会看到“coifing”（少一个f），但“coiffing”更常用，带有法语来源的拼写风格（与“coiffure”相关）。"]}
{"word":"coiffure","summary":{"en":"A formal word for a hairstyle, especially one that is carefully styled.","zh":"较正式的“发型”一词，常指经过精心打理、设计的发型。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person’s hairstyle; the way the hair is cut and arranged","zh":"（头发的）发型；梳理、修剪后的造型"},"examples":[{"en":"I love her new coiffure—it looks elegant and modern.","zh":"我很喜欢她的新发型——看起来优雅又时髦。"},{"en":"For the wedding, she chose a simple coiffure with soft curls.","zh":"为了婚礼，她选了一个简单的发型，带有柔和的卷度。"}]}],"synonyms":["hairstyle","hairdo","style","updo"],"phonetic":"/kwɑːˈfjʊr/","extraExplanation":["“Coiffure”来自法语，语气比“hairstyle”更正式，也更常见于时尚、美容、杂志或较文艺的语境。日常口语里通常直接说“hairstyle”或“hair”。","在英语里它有时带一点“讲究、精心打理”的感觉，暗示不是随便扎一下，而是经过设计的发型。"]}
{"word":"coiffured","summary":{"en":"“Coiffured” means hair that is carefully styled and neatly arranged.","zh":"“coiffured”表示头发经过精心造型、梳理得整齐讲究。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of hair) arranged or styled carefully; having a neat, fashionable hairstyle.","zh":"（指头发）精心梳理过的；发型整齐、讲究的。"},"examples":[{"en":"She arrived with perfectly coiffured hair.","zh":"她到场时头发梳得一丝不苟。"},{"en":"The actor’s coiffured look matched the formal suit.","zh":"那位演员精心打理的发型与正式西装很搭。"}]}],"synonyms":["well-groomed","neatly styled","carefully styled","polished"],"phonetic":"/kwɑːˈfjʊrd/","extraExplanation":["“coiffured”来自法语词源，常用于较正式或带一点“讲究、上镜”的语气，常见搭配是coiffured hair / a coiffured look。","在日常口语里，更常用neatly styled、well-groomed或fixed her hair来表达类似意思；coiffured听起来更“时尚杂志/红毯”。"]}
{"word":"coiffures","summary":{"en":"“Coiffures” means hairstyles (plural), often implying carefully styled or fashionable hair; less commonly, it can mean headdresses.","zh":"“coiffures”指（复数）发型，常带“精心造型/时尚”的意味；较少见时也可指头饰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Hairstyles or the way hair is arranged, especially when it looks carefully styled or fashionable (plural of “coiffure”).","zh":"发型；梳理出的头发造型（“coiffure”的复数），常指精心打理、较时髦的发型。"},"examples":[{"en":"The models appeared on the runway with dramatic coiffures.","zh":"模特们以夸张的发型走上了T台。"},{"en":"In the old photos, you can see the elegant coiffures popular at the time.","zh":"在老照片里，你能看到当时流行的优雅发型。"}]},{"partOfSpeech":"n.","definition":{"en":"Head coverings or headdresses (a less common meaning).","zh":"头饰；头部覆盖物（较不常见的意思）。"},"examples":[{"en":"The costumes included ornate coiffures made of feathers and beads.","zh":"服装造型里包含用羽毛和珠子做成的华丽头饰。"}]}],"synonyms":["hairstyles","hairdos","hair arrangements","coifs","headdresses"],"phonetic":"/kwɑːˈfjʊrz/","extraExplanation":["“coiffure”来自法语，与“梳理头发/理发”有关，所以在时尚、戏剧、历史服饰语境中更常见，语气比普通的“hairstyle”更正式、更带“造型感”。","“coiffures”是复数形式；单数是“a coiffure”。日常口语里通常直接说“hairstyles”或“hair”。"]}
{"word":"coiffuring","summary":{"en":"Coiffuring means styling or arranging hair, often in a polished, formal way.","zh":"coiffuring 指做发型、梳理造型头发，常带有精致、正式的语感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of styling or arranging someone’s hair; hairdressing","zh":"（给人）做发型；梳理、造型头发的过程（理发/美发）"},"examples":[{"en":"The salon is known for careful coiffuring before weddings and photo shoots.","zh":"这家沙龙以婚礼和拍摄前细致的发型打造而出名。"},{"en":"Her morning coiffuring routine includes blow-drying and curling.","zh":"她早晨的发型打理流程包括吹干和卷发。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “coiffure”: to style or arrange hair (often in a polished, formal way)","zh":"“coiffure”的现在分词：给头发做造型、梳理（常带有精致、正式的感觉）"},"examples":[{"en":"She is coiffuring the model’s hair for the runway show.","zh":"她正在为走秀的模特做发型。"},{"en":"The stylist spent an hour coiffuring his hair into a neat, classic look.","zh":"造型师花了一个小时把他的头发打理成整洁的经典造型。"}]}],"synonyms":["hair styling","hairdressing","doing someone’s hair","grooming"],"phonetic":"/kwɑːˈfjʊrɪŋ/","extraExplanation":["“coiffuring”来源于法语词根（与 coiffure 同源），在现代英语里偏书面或时尚语境使用。日常口语更常说 doing my hair / styling my hair / hair styling。","语感上，“coiffure/coiffuring”常暗示更讲究、更“上镜”的造型（比如婚礼、舞台、杂志拍摄），而不只是随便梳头。"]}
{"word":"coifing","summary":{"en":"“Coifing” is a (less common) spelling related to “coif,” meaning styling hair or a neat hairstyle; historically it can also mean a close-fitting cap.","zh":"“coifing”是与“coif”相关的（较少见的）拼写，常指给头发做造型或一种利落的发型；在历史语境中也可指贴头软帽。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually written as “coiffing” or “coifing”) the act of arranging or styling hair; hair styling.","zh":"（通常写作“coiffing”或“coifing”）为头发造型、整理头发的动作；美发造型。"},"examples":[{"en":"She spent an hour coifing her hair before the interview.","zh":"面试前她花了一个小时整理头发。"},{"en":"The stylist is coifing the model for the photo shoot.","zh":"发型师正在为模特拍摄造型。"}]},{"partOfSpeech":"vt.","definition":{"en":"To arrange, comb, or style (someone’s hair) in a neat or fashionable way.","zh":"给（某人的）头发梳理并做造型；把头发整理得整齐或时髦。"},"examples":[{"en":"He coifs his hair carefully every morning.","zh":"他每天早上都会仔细打理头发。"},{"en":"The actor was coifed for the red-carpet event.","zh":"这位演员为走红毯做了发型。"}]},{"partOfSpeech":"n.","definition":{"en":"A hairstyle; the way hair is arranged (often used in journalism or fashion writing).","zh":"发型；头发的造型方式（常见于新闻或时尚写作）。"},"examples":[{"en":"Her short coif gives her a professional look.","zh":"她的短发造型让她看起来很干练。"},{"en":"He showed up with a new coif.","zh":"他带着一个新发型出现了。"}]},{"partOfSpeech":"n.","definition":{"en":"A close-fitting cap, often seen in historical clothing (less common in modern English).","zh":"紧贴头部的软帽（常见于历史服饰语境；现代较少用）。"},"examples":[{"en":"In the painting, the woman wears a white coif under her veil.","zh":"画中女子在面纱下戴着一顶白色贴头软帽。"}]}],"synonyms":["style","arrange","do (one’s) hair","hairdo","hairstyle"],"phonetic":"/kɔɪf/","extraExplanation":["“coif”常被用于时尚/娱乐报道里，指“利落的短发造型”。动词形式有时会写成“coiff”/“coiffing”（受法语拼写影响），但在英语里更常见的基础拼写是“coif”。","词源上与法语有关（coiffe），所以在美发行业里会看到更“法式”的拼写与用法。"]}
{"word":"coifs","summary":{"en":"“Coifs” usually means close-fitting caps (plural of coif), and it can also be the verb form meaning “styles hair neatly.”","zh":"“Coifs”通常指贴头帽/头巾（coif 的复数）；也可作动词，表示“把头发梳理得整齐有型”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “coif”: a close-fitting cap or head covering (often historical), sometimes worn under a helmet or as part of religious or ceremonial dress","zh":"“coif”的复数：贴头的帽子/头巾（多为历史用语），有时用于头盔内衬或宗教、仪式服饰的一部分"},"examples":[{"en":"Museum displays showed several medieval coifs made of linen.","zh":"博物馆展柜里展示了几顶亚麻制的中世纪贴头帽。"},{"en":"The reenactors wore coifs under their helmets for comfort.","zh":"复原表演者为了更舒适，在头盔里戴了贴头帽。"}]},{"partOfSpeech":"v.","definition":{"en":"third-person singular of “coif”: to arrange or style someone’s hair neatly (or to put on a coif)","zh":"“coif”的第三人称单数：把头发梳理得整齐有型（或给某人戴上贴头帽）"},"examples":[{"en":"She coifs her hair before every performance.","zh":"每次演出前她都会把头发打理好。"},{"en":"The stylist coifs the model’s hair into a smooth updo.","zh":"造型师把模特的头发梳成光滑的盘发。"}]}],"synonyms":["caps","head coverings","bonnets","hairdo","style"],"phonetic":"/kɔɪf/","extraExplanation":["“coif”最常见的画面感来自中世纪欧洲：一种贴头的亚麻帽，常作为头盔内衬或日常/宗教服饰。","在英国法律史中也出现过“Order of the Coif（贴头帽勋团/律师团体）”，与早期高级律师（serjeants-at-law）的标志性头饰有关；但在现代日常英语里，更多人把 coif 当作“发型/梳理头发”的用词。"]}
{"word":"coign","summary":{"en":"A literary word meaning “corner,” especially a corner that gives an advantage; also, less commonly, a building’s corner stone.","zh":"较文学化的“角落/突出角”，尤指能带来优势的位置；也可指建筑的墙角石（较少见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a corner or projecting angle, especially one that offers a good position or advantage (often used in the phrase “coign of vantage”).","zh":"（尤指能占据优势的位置的）角落；突出角（常见于短语“coign of vantage”）。"},"examples":[{"en":"From that coign of vantage on the hill, you can see the whole valley.","zh":"从山上那个有利的角落望去，你能看到整个山谷。"},{"en":"The photographer waited in a coign near the doorway to capture candid moments.","zh":"摄影师在门口附近找了个角落，等着抓拍自然瞬间。"}]},{"partOfSpeech":"n.","definition":{"en":"(architecture, less common) a quoin; an exterior corner stone or the corner of a building.","zh":"（建筑，较少用）墙角石；建筑物外角或墙角。"},"examples":[{"en":"The old church’s coigns were reinforced during the restoration.","zh":"修复时加固了那座老教堂的墙角石。"}]}],"synonyms":["corner","angle","nook","vantage point","quoin"],"phonetic":"/kɔɪn/","extraExplanation":["“Coign”读音与“coin（硬币）”相同，但意思不同。它是较文学化、较古老的词，现代日常英语更常用“corner”或“vantage point”。","常被引用的固定搭配是 Shakespeare 在《麦克白》（Macbeth）中用到的 “coign of vantage”，意思是“有利的制高点/优势位置”。"]}
{"word":"coigne","summary":{"en":"Coigne is an archaic word meaning a corner or projecting angle of a building; in “coign(e) of vantage,” it means a favorable viewpoint or position.","zh":"coigne 是古语，指建筑的角或突出棱角；在短语“coign(e) of vantage”中，指有利的视角或位置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic/Literary) a corner, projecting angle, or wedge-like edge of a building or wall; a “quoin.”","zh":"（古语/文学用语）建筑或墙的角、突出棱角；（石砌建筑的）墙角石/角石（quoin）。"},"examples":[{"en":"From the coigne of the old stone wall, you can see the whole valley.","zh":"从那堵旧石墙的墙角处，你能看到整个山谷。"},{"en":"They climbed to a high coigne to get a better view.","zh":"他们爬到一个较高的角落/棱角处，以便看得更清楚。"}]},{"partOfSpeech":"phrase","definition":{"en":"In the phrase “coign (or coigne) of vantage,” a favorable position or strategic viewpoint.","zh":"用于短语“coign/coigne of vantage”：有利位置；战略制高点/绝佳视角。"},"examples":[{"en":"The photographer found a coign of vantage on the hill.","zh":"摄影师在山坡上找到了一个绝佳的拍摄位置。"},{"en":"The team used the balcony as a coign of vantage over the crowd.","zh":"团队把阳台当作俯瞰人群的有利位置。"}]}],"synonyms":["corner","angle","quoin","vantage point","favorable position"],"phonetic":"/kɔɪn/","extraExplanation":["“coigne/coign”是非常少见的古英语拼写，现代更常见的是“coign（较少）”或直接用“corner / angle / vantage point”。它和“coin（硬币）”拼写接近，但意义不同。","著名文学用例出自莎士比亚《麦克白》（Macbeth）：“the temple-haunting martlet does approve, by his loved mansionry, that the heaven’s breath smells wooingly here: no jutty, frieze, buttress, nor coign of vantage, but this bird hath made his pendent bed…” 这里的“coign of vantage”指建筑上可供停栖的突出角落/有利位置。"]}
{"word":"coigned","summary":{"en":"“Coigned” is a rare word meaning “having corners/angled,” or the past form of the rare verb “coign.” It’s often confused with “coined.”","zh":"“coigned”很罕见，多指“有棱角的/有墙角的”，也可作罕见动词 coign 的过去式；常被误写成更常用的“coined”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Having corners or angles; formed with projecting corners (often used in older or poetic descriptions of buildings/structures).","zh":"（罕见）有棱角的；有墙角/突出角的（多见于较旧或较文学化的建筑描写）。"},"examples":[{"en":"The old tower looked coigned and uneven against the sky.","zh":"那座老塔在天空映衬下显得棱角分明、轮廓不齐。"},{"en":"They described a coigned stone wall that caught the afternoon light.","zh":"他们描写了一道有明显墙角的石墙，能接住午后的光。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past form of the rare verb “coign” (to form/provide with a corner or cornerpiece), used mainly in historical texts.","zh":"罕见动词 coign 的过去式/过去分词（使形成角/配上角石），主要见于历史文本。"},"examples":[{"en":"In some older descriptions, the façade is said to be coigned with stone blocks.","zh":"在一些较旧的描述里，会说立面用石块“做出墙角/角石”（coigned）。"}]}],"synonyms":["angular","cornered","jagged","projecting"],"phonetic":"/kɔɪnd/","extraExplanation":["“coigned”非常少见。很多学习者看到它其实是想找更常用的“coined”（意为“铸造硬币；创造新词/新说法”）。如果你是在写“a coined word/phrase（新造的词/说法）”，拼写应是 coined。","相关词根：coign / coin（读音相同）在较旧英语里可指“角、墙角、角石”。莎士比亚《麦克白》中有名句“coign of vantage”，意思是“有利的位置/制高点”。"]}
{"word":"coignes","summary":{"en":"“Coignes” is an archaic plural meaning the corners/angles of a building, and by extension a favorable position (“a coign of vantage”).","zh":"“coignes”是古语复数，指建筑物的角/墙角，也可引申为有利位置（a coign of vantage）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(archaic) corners or projecting angles of a building; also used for a “favorable corner/position” (as in “a coign of vantage”).","zh":"（古语）建筑物的角、凸出的墙角；也可引申为“有利的角落/位置”（如短语 a coign of vantage）。"},"examples":[{"en":"The castle rose from the rock, with sharp coignes catching the light.","zh":"城堡从岩石上耸立，尖锐的墙角在光线下格外显眼。"},{"en":"From that coign of vantage, she could see the whole street.","zh":"从那个有利的位置，她能看见整条街。"},{"en":"In Shakespeare’s Macbeth, “the air nimbly and sweetly recommends itself unto our gentle senses” around the “coign of vantage.”","zh":"在莎士比亚《麦克白》中，描写到“有利的墙角/位置”附近，空气“轻盈甜美地向我们的温和感官自荐”。"}]}],"synonyms":["corners","angles","nooks","vantage point","advantageous position"],"phonetic":"/kɔɪn/","extraExplanation":["“coignes”是复数形式，更常见的单数拼写是 coign 或 coigne，现代英语里非常少用。","它与建筑术语“quoin（墙角石/墙隅）”意义接近：都指建筑外墙的角或突出的角部。","著名搭配 a coign of vantage（有利的角落/制高点）最常被用来引申“有利位置、优势点”，在文学评论或较正式的写作中偶尔出现。"]}
{"word":"coigning","summary":{"en":"“Coining” usually means inventing a new word/phrase, and it can also mean minting money.","zh":"“coining”通常指“创造新词/新说法”，也可指“铸造货币”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(v.) present participle of coin: to invent or create something new, especially a new word or phrase.","zh":"（动词）coin 的现在分词：创造或发明新的东西，尤指新词或新说法。"},"examples":[{"en":"She is coining a new term for the trend.","zh":"她正在为这个潮流创造一个新词。"},{"en":"The writer kept coining vivid expressions.","zh":"这位作家不断创造生动的表达。"}]},{"partOfSpeech":"v.","definition":{"en":"(v.) to produce money officially; to mint.","zh":"（动词）正式铸造货币；造币。"},"examples":[{"en":"The government is coining new coins for the anniversary.","zh":"政府正在为周年纪念铸造新硬币。"},{"en":"In ancient times, kings controlled coining to show power.","zh":"在古代，国王通过控制铸币来显示权力。"}]},{"partOfSpeech":"n.","definition":{"en":"(n.) the act or process of inventing words/ideas or minting coins.","zh":"（名词）造词/发明说法或铸币的行为与过程。"},"examples":[{"en":"The coining of the phrase quickly caught on.","zh":"这个短语的创造很快就流行起来。"},{"en":"Coining was strictly regulated at the royal mint.","zh":"皇家铸币厂对铸币有严格管控。"}]}],"synonyms":["inventing","creating","minting","originating","devising"],"phonetic":"/ˈkɔɪnɪŋ/","extraExplanation":["“coigning”在现代英语里非常少见；多数情况下人们想写的是“coining”。“coin”既可指“硬币/铸造”，也常用于比喻“创造新词、新说法”。","另有一个容易混淆的词“coign /kɔɪn/”（名词）意为“角落、外角；有利位置”，常见于固定搭配“a coign of vantage”（有利的制高点/位置）。它与“coining（造词/铸币）”意义不同。"]}
{"word":"coigns","summary":{"en":"“Coigns” is an uncommon, literary plural meaning projecting corners/edges, often in “coign of vantage” (= a good viewpoint or advantageous position).","zh":"“Coigns”是较少见、偏文学的复数形式，指建筑物突出的角/棱；常见于“coign of vantage”，意为“有利观察点/优势位置”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of “coign”: an outer corner or projecting edge of a building or wall (often used in the phrase “coign of vantage,” meaning a good viewpoint or strategic position)","zh":"“coign”的复数：建筑物或墙体外侧突出的角、棱角（常见于短语“coign of vantage”，指“有利的观察点/有利位置”）"},"examples":[{"en":"From the castle’s coigns, the guards could see the whole valley.","zh":"从城堡突出的墙角处，守卫能看到整个山谷。"},{"en":"We found a coign of vantage on the hill to watch the parade.","zh":"我们在山坡上找到了一个有利位置来观看游行。"}]}],"synonyms":["corners","edges","projections","vantage point (for “coign of vantage”)"],"phonetic":"/kɔɪn/","extraExplanation":["“coign”在现代英语里比较少见，带有文学/古风色彩；更常用的说法是 corner（角落/拐角）、edge（边缘）、projection（凸出部分）。","经典出处之一是莎士比亚《麦克白》里出现的“coign of vantage”，常被用来指“便于观察或占优势的地方/时机”。"]}
{"word":"coigny","summary":{"en":"Coigny is a French proper name (surname/place name), commonly encountered in historical references such as the Duchesse de Coigny.","zh":"Coigny 是一个法国专有名词（姓氏/地名），常见于历史语境，如“德·科瓦尼公爵夫人”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a French proper name (surname and place name), most often seen in historical references such as the Duchesse de Coigny (Duchess of Coigny).","zh":"一个法国专有名词（既可作姓氏也可作地名），常见于历史语境，例如“德·科瓦尼公爵夫人（Duchesse de Coigny）”。"},"examples":[{"en":"In the memoirs, the Duchesse de Coigny describes life before the French Revolution.","zh":"在回忆录中，德·科瓦尼公爵夫人描述了法国大革命前的生活。"},{"en":"The character’s family name, Coigny, signals a French aristocratic background.","zh":"角色的姓“Coigny”暗示其具有法国贵族背景。"}]}],"phonetic":"/ˈkwɑːnji/","extraExplanation":["“Coigny”源自法语拼写，属于人名/地名这类专有名词，因此在英语里通常不翻译，只按需要音译或直接保留原拼写。","历史上较常被提到的是“Duchesse de Coigny（科瓦尼公爵夫人）”，与法国贵族社会及法国大革命前后的回忆、书信或传记作品有关。","在英语文本中遇到 Coigny，判断含义时可看上下文：若前面有头衔（Duke/Duchess、de 等）多半是家族名；若出现在地图、行政区信息里则可能是地名。"]}
{"word":"coigue","summary":{"en":"Coigue is a large evergreen beech tree from southern Chile and Argentina.","zh":"Coigue指一种原产于智利和阿根廷南部的常绿山毛榉大树。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large evergreen beech tree native to southern Chile and Argentina (species: Nothofagus dombeyi), valued for timber and common in temperate rainforests.","zh":"一种原产于智利与阿根廷南部的常绿山毛榉大乔木（学名：Nothofagus dombeyi），常见于温带雨林，木材可用。"},"examples":[{"en":"Coigue forests are common in the rainy regions of southern Chile.","zh":"在智利南部多雨地区，常见成片的coigue森林。"},{"en":"The cabin was built with coigue wood because it is strong and durable.","zh":"这间小屋用coigue木材建造，因为它坚固耐用。"},{"en":"On the hike, we saw tall coigue trees mixed with ferns and moss.","zh":"徒步时，我们看到高大的coigue与蕨类和苔藓混生。"}]}],"synonyms":["coigüe","Dombey’s beech","evergreen beech"],"phonetic":"/ˈkɔɪɡweɪ/","extraExplanation":["“coigue”常见写法也有“coigüe”（带变音符号 ü），来自马普切语（Mapudungun）的词源，在英文资料中多作为南美植物名使用。","在旅游、自然纪录片或木材贸易语境里更容易遇到这个词；如果写作时想更正式，可加上学名“Nothofagus dombeyi”。"]}
{"word":"coihue","summary":{"en":"Coihue is a large evergreen beech tree native to southern Chile and Argentina.","zh":"Coihue 指原产于智利与阿根廷南部的一种大型常绿山毛榉类乔木。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large evergreen beech tree native to southern Chile and Argentina (Nothofagus dombeyi), valued for its hard wood and common in Patagonian forests.","zh":"（柯伊韦树）一种原产于智利与阿根廷南部的常绿山毛榉类大乔木（Nothofagus dombeyi），木材坚硬，在巴塔哥尼亚森林中很常见。"},"examples":[{"en":"Coihue forests are common in parts of Patagonia.","zh":"在巴塔哥尼亚的部分地区，柯伊韦树林很常见。"},{"en":"The coihue is an evergreen tree with a tall, straight trunk.","zh":"柯伊韦树是常绿树，树干高而笔直。"},{"en":"Some furniture is made from coihue wood because it is strong.","zh":"有些家具使用柯伊韦木制作，因为它很结实。"}]}],"synonyms":["Nothofagus dombeyi","Chilean beech","Coihue beech"],"phonetic":"/kɔɪˈweɪ/","extraExplanation":["“Coihue”是西班牙语中来自马普切语（Mapuche）的一种树名，在智利与阿根廷尤其常见。英语里常写作 coihue，也可能见到变体拼写如 coigüe（含变音符）。","在英文语境中，它多出现在自然地理、林业、旅行写作或关于巴塔哥尼亚生态的文章里；作为外来词，读音在英语中可能会被英语化，常见近似读法是“koy-WEH”。"]}
{"word":"coil","summary":{"en":"“Coil” means a looped spiral shape (like a coil of wire) or the action of winding/curling into that shape.","zh":"“coil”指盘绕成圈/螺旋的一卷（如线圈），也指把东西盘起来或蜷缩、盘绕。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a series of loops (often of wire, rope, or tubing) wound into a circle or spiral shape","zh":"（线、绳、管等）盘绕成圈/螺旋的一卷；线圈"},"examples":[{"en":"He bought a coil of rope for camping.","zh":"他买了一卷绳子去露营。"},{"en":"The electrician checked the coil inside the motor.","zh":"电工检查了马达里的线圈。"}]},{"partOfSpeech":"vt.","definition":{"en":"to wind or twist something into loops or a spiral shape","zh":"把……盘成圈；使卷曲"},"examples":[{"en":"She coiled the hose neatly after watering the plants.","zh":"浇完花后，她把水管整齐地盘起来。"},{"en":"The snake coiled around the branch.","zh":"蛇盘在树枝上。"}]},{"partOfSpeech":"vi.","definition":{"en":"to form into a spiral or loops; to curl up","zh":"盘绕；蜷缩成一团"},"examples":[{"en":"The cat coiled up on the warm chair.","zh":"猫蜷在温暖的椅子上。"}]}],"synonyms":["spiral","loop","wind","curl"],"phonetic":"/kɔɪl/","extraExplanation":["“coil”既可用于日常物品（a coil of wire/rope/hose 一卷电线/绳子/水管），也常见于科技语境（electrical coil 电感线圈）。在描写动物时，“a snake coiled”有“盘踞、蓄势待发”的画面感。","在文学或写作中，coil 常用来营造紧张感或力量感：例如“anger coiled inside him”（愤怒在他心里盘旋/蓄积），带有“像弹簧一样越卷越紧”的隐喻。"]}
{"word":"coil sth. up with sth.","summary":{"en":"wind something into a tight coil and secure it using something else","zh":"把某物盘成圈，并用另一物固定住"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to wind or wrap one thing into a tight, circular shape (a coil), using another thing to wrap, tie, or bind it","zh":"用某物把某物盘起来/卷起来（通常盘成圈），并用另一物缠绕、捆绑或固定"},"examples":[{"en":"She coiled the rope up with a piece of tape so it wouldn’t unravel.","zh":"她用一段胶带把绳子盘起来，免得散开。"},{"en":"Coil the charging cable up with a Velcro strap before you put it in your bag.","zh":"把充电线用魔术贴扎带盘好再放进包里。"},{"en":"He coiled the garden hose up with a twist tie and hung it on the wall.","zh":"他用扎丝把花园水管盘好，然后挂在墙上。"}]}],"synonyms":["wind up","coil up","roll up","wrap up","bundle up","tie up"],"phonetic":"/kɔɪl/","extraExplanation":["常见结构：coil + 物 + up + with + 固定物（tape/strap/string/tie 等）。也常说：coil + 物 + up（不强调用什么固定）。","语感对比：wrap sth. up 强调“包/裹”；coil sth. up 强调“盘成圈（像弹簧、盘起来的绳子）”。"],"etymology":"“coil”来自中古法语/古法语 coil（意为“线圈、卷”），与拉丁语 colligere（“收集、聚拢”）有关；短语里 “up” 表示“整理好、收拢起来”，“with” 表示“用……来”。","mnemonic":["把 coil 想成“弹簧线圈”，盘起来就是 coil up。","with = “用……”，记成“用XX把它盘好固定住”。"]}
{"word":"coil-shaped","summary":{"en":"Coil-shaped describes something that looks like a coil—curved around in rings or turns, like a spring.","zh":"coil-shaped 指“线圈状的”，外形像弹簧/线圈一样盘绕成圈或呈螺旋。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the form of a coil (wound in rings or turns), like a spiral or helix.","zh":"呈线圈状的；像弹簧一样盘绕成圈或成螺旋/螺旋线形的。"},"examples":[{"en":"The coil-shaped spring inside the pen pushes the tip back in.","zh":"笔里面的线圈状弹簧会把笔尖顶回去。"},{"en":"Under the microscope, the bacteria looked coil-shaped.","zh":"在显微镜下，这种细菌看起来是线圈状的。"},{"en":"She wore a coil-shaped bracelet made of silver wire.","zh":"她戴着一个用银丝做成的线圈状手镯。"}]}],"synonyms":["coiled","spiral-shaped","helical","springlike"],"phonetic":"/ˈkɔɪl ˌʃeɪpt/","extraExplanation":["“coil-shaped”是由名词“coil（线圈；盘绕）”+ 过去分词“shaped（…形状的）”构成的复合形容词，常用连字符（hyphen）放在名词前作定语：a coil-shaped tube。放在名词后作表语时也可以写作 coil shaped，但在学术/技术写作中常保留连字符以避免歧义。","在科学语境中它常用来描述形态（如细菌、DNA、弹簧、管路），与“spiral-shaped（螺旋形）”“helical（螺旋的）”意义相近，但“coil-shaped”更强调“像线圈/弹簧那样盘绕成圈”的感觉。"]}
{"word":"Coila","summary":{"en":"Coila is mainly used as a name (person or place), not a standard English word with a fixed dictionary meaning.","zh":"Coila 主要作为人名或地名使用，并非具有固定词义的标准英语单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a proper name (usually a given name or surname); not a common English vocabulary word.","zh":"专有名词（通常是人名或姓氏）；不是常见的英语词汇。"},"examples":[{"en":"Coila is the name on the reservation form.","zh":"Coila 是预约表上的名字。"},{"en":"I met someone named Coila at the conference.","zh":"我在会议上认识了一位叫 Coila 的人。"}]},{"partOfSpeech":"other","definition":{"en":"(sometimes) used as a place name in different countries/regions; the exact meaning depends on the local language and history.","zh":"（有时）也用作地名；具体含义取决于当地语言和历史背景。"},"examples":[{"en":"They stopped in Coila during their road trip.","zh":"他们在自驾途中在 Coila 停了一下。"}]}],"phonetic":"/ˈkɔɪlə/","extraExplanation":["“Coila”在英语里通常被当作专有名词来使用（人名/地名），因此不像普通单词那样有固定、通用的词义。若你是在某个句子、地图或作品里看到它，提供上下文我可以帮你判断它指的是人名、地名，还是拼写变体（例如可能想写的是“coil a”或其它相近词）。"]}
{"word":"coilability","summary":{"en":"Coilability means how easily something can be coiled up neatly without kinking or damage.","zh":"Coilability 指某物能否轻松整齐地盘起来而不打结或受损的能力（盘绕性）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the ability of something (especially wire, cable, hose, or rope) to be coiled easily and neatly without kinking or damage","zh":"（尤指电线、电缆、软管或绳索）容易被盘绕并保持整齐、不打结或不受损的能力"},"examples":[{"en":"This cable has good coilability, so it stores well in a small bag.","zh":"这根电缆盘绕性很好，所以能收进小包里也不占地方。"},{"en":"Low coilability can cause kinks that shorten the life of a hose.","zh":"盘绕性差会导致软管打折起皱，从而缩短使用寿命。"},{"en":"The team tested coilability before choosing the wire for outdoor equipment.","zh":"团队在为户外设备选线材前先测试了盘绕性。"}]}],"synonyms":["coilability (technical)","ease of coiling","windability","coil performance"],"phonetic":"/ˌkɔɪləˈbɪləti/","extraExplanation":["“coilability”是由“coil（盘绕）+ -ability（……的能力）”构成的名词，常见于工程、制造、包装与物流语境，用来评价材料在收纳、运输和反复使用时是否容易盘起来。","在产品参数或质检报告里，它常与“flexibility（柔韧性）”“kink resistance（抗打折/抗折皱）”“memory（回弹/记忆性）”等一起出现：材料“记忆性”强时可能不易保持平整，影响盘绕效果。"]}
{"word":"coiled","summary":{"en":"“Coiled” describes something wound or curled in loops (like a spring), or it’s the past form of “coil.”","zh":"“coiled”表示“盘绕、蜷曲成圈”的状态，也可作动词“coil”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Wound into a spiral or ring shape; curled around itself like a spring or a snake.","zh":"盘绕成螺旋或环状的；像弹簧或蛇一样蜷曲、缠绕的。"},"examples":[{"en":"A coiled rope lay on the deck, ready to be used.","zh":"一卷盘好的绳子放在甲板上，随时可以使用。"},{"en":"The snake stayed coiled in the grass.","zh":"那条蛇在草丛里盘着不动。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “coil”: to wind something into loops or spirals, or to curl into a spiral shape.","zh":"“coil”的过去式/过去分词：把某物盘成圈；或（身体）蜷曲成螺旋状。"},"examples":[{"en":"She coiled the cable neatly and put it in the bag.","zh":"她把电缆整齐地盘好，放进包里。"},{"en":"The cat coiled its tail around its body.","zh":"猫把尾巴绕在身边。"}]}],"synonyms":["curled","wound","twisted","spiraled","looped"],"phonetic":"/kɔɪld/","extraExplanation":["“coiled”常见于描写“紧绷的准备状态”，尤其在文学里：像“a coiled spring（上紧的弹簧）”暗示力量被压缩、随时爆发。比如：He stood coiled with anger.（他压着怒火，随时可能爆发。）","相关搭配：coiled spring（上紧的弹簧/蓄势待发）、coiled snake（盘踞的蛇/危险）、coiled cable/rope（盘好的电缆/绳子）。"]}
{"word":"coiled spring","summary":{"en":"a spiral spring; or something tense and ready to react","zh":"螺旋弹簧；或形容紧绷、随时反应/爆发"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A spring made from wire wound into a tight spiral that stores energy and pushes back when compressed or stretched.","zh":"由金属丝盘成紧密螺旋、用于储存弹性势能并在压缩或拉伸后产生回弹力的弹簧（盘簧/螺旋弹簧）。"},"examples":[{"en":"The toy car uses a coiled spring to make it move forward.","zh":"这辆玩具车利用盘簧来驱动它向前走。"},{"en":"When you press the button, the coiled spring releases and the lid pops open.","zh":"你按下按钮后，盘簧释放力量，盖子会弹开。"}]},{"partOfSpeech":"phrase","definition":{"en":"(Figurative) A person or situation that is tense, tightly controlled, and ready to react suddenly.","zh":"（比喻）处于高度紧绷、被压抑但随时可能突然爆发的人或局面。"},"examples":[{"en":"He sat there like a coiled spring, ready to argue at any moment.","zh":"他坐在那里像一根绷紧的弹簧，随时都可能吵起来。"},{"en":"The city felt like a coiled spring after the shocking news.","zh":"这座城市在令人震惊的消息后，气氛像绷紧的弹簧一样紧张。"}]}],"synonyms":["coil spring","helical spring","spiral spring","spring","powder keg","ticking time bomb","on edge","wound up"],"phonetic":"/kɔɪld sprɪŋ/","extraExplanation":["常见搭配：a coiled spring（一个盘簧）；like a coiled spring（像绷紧的弹簧一样——形容人紧张、警觉、随时反应）。","近义比喻：powder keg（火药桶，强调可能爆发的危险）；ticking time bomb（定时炸弹，强调“迟早会爆”）。"],"etymology":"由 coil（盘绕）+ spring（弹簧）构成的名词短语；spring 原义与“跳/弹起”相关，引申为能“弹回”的机械零件。比喻义来自“被压缩后蓄力、随时弹出”的形象。","mnemonic":["把 coiled 理解为“圈起来的（卷起来的）”，看到 coil 就联想到“线圈/盘绕”。","想象把弹簧压缩后“蓄力”，一松手就“弹”——对应比喻义“绷着、随时爆发/行动”。"]}
{"word":"coiler","summary":{"en":"A coiler is a person, machine, or (less commonly) an animal that coils something into loops or a spiral.","zh":"coiler 指把东西盘成圈的人或机器；也可（较少见）指会盘起身体的动物（常指蛇）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or machine that coils something (winds it into loops or a spiral), such as wire, rope, or sheet metal","zh":"把某物盘成圈（绕成环或螺旋）的 人 或 机器（如盘绕电线、绳子或金属卷材）"},"examples":[{"en":"The coiler winds the cable neatly onto the drum.","zh":"盘绕机把电缆整齐地绕到卷筒上。"},{"en":"In the factory, a coiler turns hot steel into large coils.","zh":"在工厂里，卷绕机把热钢材卷成大钢卷。"}]},{"partOfSpeech":"n.","definition":{"en":"an animal or creature that coils its body (often said of snakes)","zh":"会把身体盘起来的动物（常指蛇）"},"examples":[{"en":"A coiler in the grass looked like a thick rope at first.","zh":"草丛里一条盘着的“卷曲者”（蛇）起初看起来像一根粗绳。"},{"en":"Some snakes are quiet coilers when they feel threatened.","zh":"有些蛇感到受威胁时会安静地盘起身体。"}]}],"synonyms":["winder","rewinder","spooler"],"phonetic":"/ˈkɔɪlər/","extraExplanation":["“coiler”来自动词 coil（盘绕、卷起）+ -er（表示“做……的人/物”）。在工业英语里，coiler 常指卷绕设备；日常语境中更常直接说 coil / coil up，或用 cable winder（电缆收卷器）来表达更具体的工具。"]}
{"word":"coilers","summary":{"en":"“Coilers” usually means people or machines that wind something into coils; in industry it often refers to machines that roll metal into large coils.","zh":"“Coilers”通常指把东西盘成圈的人或机器；在工业语境中常指把金属卷成大卷的卷取设备。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people or machines that coil something (wind it into loops or spirals).","zh":"把某物盘成圈（卷成螺旋/圈状）的人或机器。"},"examples":[{"en":"In the factory, the coilers wind the wire into neat rolls.","zh":"在工厂里，绕线机（或操作人员）把电线卷成整齐的线圈。"},{"en":"The cable coilers work quickly to pack the long cords safely.","zh":"收缆装置（或工人）动作很快，把长电缆安全地盘好。"}]},{"partOfSpeech":"n.","definition":{"en":"industrial machines that coil metal (such as sheet steel) into large rolls.","zh":"（工业）把金属（如钢板）卷成大卷的设备/机组。"},"examples":[{"en":"Hot strip mills send the steel through coilers at the end of the line.","zh":"热轧带钢生产线的末端会把钢带送入卷取机卷成钢卷。"}]}],"synonyms":["winders","coiling machines","reelers","spoolers"],"phonetic":"/ˈkɔɪlərz/","extraExplanation":["“coilers”是“coiler”的复数，来自动词“coil”（盘绕、卷成圈）。在日常英语里更常直接说“a coiling machine / a winder（绕线机）”，在制造业语境中“coiler”很常见。"]}
{"word":"coiling","summary":{"en":"“Coiling” means winding into loops/spirals or being in that spiral shape, and it can describe the action or the shape.","zh":"“coiling”表示盘绕成圈/螺旋的动作或状态，也可作形容词描述“盘绕的、蜿蜒的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of forming or lying in a spiral or circle (like a snake or a rope).","zh":"盘绕；卷成圈（像蛇或绳子一样）。"},"examples":[{"en":"The coiling of the rope made it easier to carry.","zh":"把绳子盘起来更方便携带。"},{"en":"We watched the coiling smoke rise from the campfire.","zh":"我们看着篝火的烟盘旋上升。"}]},{"partOfSpeech":"adj.","definition":{"en":"Forming into coils; winding around something; moving in a spiral way.","zh":"盘绕的；卷曲的；以螺旋方式缠绕/移动的。"},"examples":[{"en":"He picked up the coiling hose and put it away.","zh":"他拿起盘绕的水管并把它收好。"},{"en":"A coiling road climbed up the mountain.","zh":"一条蜿蜒盘旋的山路通向山上。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “coil”: to wind into a spiral or circle, or to wrap around something.","zh":"“coil”的现在分词：把……盘成圈/螺旋；缠绕在……上。"},"examples":[{"en":"She is coiling the cable neatly after using it.","zh":"用完后她把电缆整齐地盘起来。"},{"en":"The cat was coiling its tail around the chair leg.","zh":"那只猫把尾巴缠在椅子腿上。"}]}],"synonyms":["winding","curling","looping","spiraling","wrapping"],"phonetic":"/ˈkɔɪlɪŋ/","extraExplanation":["“coil”常让人联想到蛇的动作（盘起身子准备攻击或休息），所以在文学或描写性文字里，“coiling”常用来营造紧张、蓄势待发或缓慢流动的画面，例如“coiling shadows / coiling smoke（盘旋的影子/烟）”。","拼写小提示：coiling = coil + -ing。发音里会听到两个音节，类似“COY-ling”。"]}
{"word":"coiling-tailed","summary":{"en":"Coiling-tailed describes an animal with a tail that can curl or coil, often to grip or wrap around things.","zh":"coiling-tailed指（动物）有能卷曲、盘绕的尾巴，常用于抓握或缠绕。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a tail that can curl or coil, often used for gripping or wrapping around something.","zh":"（尾巴）能卷曲/盘绕的，常用于抓握或缠绕物体的。"},"examples":[{"en":"The coiling-tailed monkey wrapped its tail around the branch for balance.","zh":"这只卷尾猴把尾巴缠在树枝上来保持平衡。"},{"en":"In the illustration, the coiling-tailed creature looks ready to swing through the trees.","zh":"在插图里，这个卷尾的生物看起来随时能在树林间荡过去。"}]}],"synonyms":["curly-tailed","prehensile-tailed","curl-tailed"],"phonetic":"/ˈkɔɪlɪŋ teɪld/","extraExplanation":["“coiling-tailed”是一个复合形容词（带连字符），常见于动物描写或科普写作，用来强调“尾巴能卷起来/能缠绕”的外形特征。","英语里也常见不带连字符的写法“coiling tailed”，但在名词前作定语时（如coiling-tailed monkey）用连字符更清晰。若强调“能抓握的尾巴”，也常用更专业、常见的词“prehensile-tailed（抓握尾的）”。"]}
{"word":"coilingly","summary":{"en":"“Coilingly” means “in a twisting, spiraling, coiling way,” and can also describe something happening indirectly or windingly.","zh":"“coilingly”表示“以盘绕、螺旋扭转的方式”，也可比喻“迂回曲折地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a coiling way; with a twisting, spiraling movement (like a snake or a rope).","zh":"以盘绕的方式；带有扭转、螺旋式的运动（像蛇或绳子一样）。"},"examples":[{"en":"The vine climbed coilingly around the fence.","zh":"藤蔓以盘绕的方式沿着篱笆向上爬。"},{"en":"Smoke rose coilingly from the campfire.","zh":"烟从营火中螺旋般袅袅升起。"},{"en":"The river ran coilingly through the valley.","zh":"河流蜿蜒盘曲地穿过山谷。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Figurative) In an indirect, winding, or snakelike manner.","zh":"（比喻）以迂回曲折、蜿蜒（像蛇一样）的方式。"},"examples":[{"en":"The conversation moved coilingly from small talk to the real issue.","zh":"谈话从寒暄迂回地转向真正的问题。"},{"en":"His reasoning advanced coilingly, circling the point before stating it.","zh":"他的推理曲折推进，绕了一圈才点明要点。"}]}],"synonyms":["spirally","twistingly","windingly","snakelike"],"phonetic":"/ˈkɔɪlɪŋli/","extraExplanation":["“coilingly”较少见，多用于描写性文字（自然景物、动作、烟雾、水流等），强调“盘绕/蜿蜒”的视觉感。","构词：coil（盘绕）+ -ing + -ly（副词后缀）。日常表达更常用 “in a coil/spiral,” “in a twisting way,” 或 “windingly.”"]}
{"word":"coillen","summary":{"en":"“Coillen” is not a standard English word; it is most likely a misspelling of “colleen,” meaning an Irish girl or young woman.","zh":"“coillen”不是标准英语单词；多半是“colleen”的误拼，意思是“爱尔兰女孩/年轻女子”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended: “colleen”) an Irish girl or young woman; sometimes used as a female given name.","zh":"（很可能是“colleen”的误拼）爱尔兰女孩、年轻女子；也可作女性名字。"},"examples":[{"en":"In old Irish songs, a “colleen” often represents a young woman the singer loves.","zh":"在一些古老的爱尔兰歌曲里，“colleen”常常指歌者所爱的一位年轻女子。"},{"en":"She wore a green dress for the festival, like a storybook colleen.","zh":"她在节日穿了条绿色裙子，像童话里的爱尔兰少女。"}]}],"synonyms":["girl","lass","young woman"],"phonetic":"/kɑˈlin/","extraExplanation":["“colleen”来自爱尔兰盖尔语 cailín（意为“女孩”）。在英语里它带有一点文学/民谣色彩，常见于描写爱尔兰风情的歌曲、诗歌或故事中。","你输入的“coillen”不是常见英语单词；如果你想表达“盘绕/卷起”，更可能是 coiling（如: coiling rope 卷起的绳子）。"]}
{"word":"coillir","summary":{"en":"“Coil” means to wind into a spiral or a spiral-shaped loop (like a coil of rope or wire).","zh":"“Coil”指（使）盘绕成螺旋状，也指盘绕形成的一圈/一卷（如绳索或电线）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to wind or twist into a spiral (shape); to curl around something","zh":"（使）盘绕；卷成螺旋状；缠绕在某物上"},"examples":[{"en":"She coiled the rope neatly on the deck.","zh":"她把绳子整齐地盘在甲板上。"},{"en":"The snake coiled around the branch.","zh":"蛇盘绕在树枝上。"}]},{"partOfSpeech":"n.","definition":{"en":"a spiral or looped shape; a length of something (like rope or wire) wound into loops","zh":"螺旋形/盘绕形；（绳/电线等）盘成的一圈（或一卷）"},"examples":[{"en":"A coil of wire lay on the table.","zh":"桌上放着一卷电线。"},{"en":"The spring is made of a metal coil.","zh":"这个弹簧由金属螺旋圈制成。"}]}],"synonyms":["wind","wrap","curl","twist","loop","spiral"],"phonetic":"/kɔɪl/","extraExplanation":["“coillir”不是标准英语单词，常见于拼写误差。你可能想查的是 **coil**（盘绕/线圈）。","如果你在学法语，你可能想写的是法语动词 **cueillir**（采摘花、果实），但它不属于英语词汇。"]}
{"word":"coils","summary":{"en":"Coils are spiral loops (like a spring), and “coils” can also mean “winds into loops.”","zh":"coils 指螺旋状的圈（如弹簧/线圈），也可作动词表示“把……盘成圈”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Spiral loops or rings, like a spring or a rope wound in circles.","zh":"（复数）盘绕成的圈；线圈；像弹簧或绳子绕成的一圈圈。"},"examples":[{"en":"The heater has metal coils that glow red when it’s on.","zh":"加热器里有金属线圈，开启时会发红发亮。"},{"en":"A pile of coils of rope lay on the deck.","zh":"甲板上放着一堆盘好的绳圈。"}]},{"partOfSpeech":"v.","definition":{"en":"(third-person singular) To wind or form something into spiral loops.","zh":"（动词第三人称单数）把……盘成圈；卷成螺旋状。"},"examples":[{"en":"She coils the cable neatly after each use.","zh":"每次用完她都会把电缆整齐地盘好。"},{"en":"The snake coils around the branch.","zh":"蛇盘绕在树枝上。"}]}],"synonyms":["spirals","loops","springs","wind","wrap","curl"],"phonetic":"/kɔɪl/","extraExplanation":["“coil”在日常生活中常指“弹簧/线圈”（如加热丝、变压器线圈），也常用来描写“蛇盘绕”的动作与形态。作动词时常与 up / around 搭配：coil up（盘起来），coil around（盘绕在……上）。"]}
{"word":"coilsmith","summary":{"en":"A coilsmith is someone who makes metal coils or springs.","zh":"coilsmith 指制造金属线圈或弹簧的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person whose job is making metal coils or springs (often as a specialized craft or industrial role)","zh":"制造金属线圈或弹簧的人（常指专业手艺人或工业岗位）"},"examples":[{"en":"The factory hired a coilsmith to produce custom springs for small machines.","zh":"工厂雇了一位线圈匠来生产小型机器用的定制弹簧。"},{"en":"As a coilsmith, he checks the tension and shape of every coil before shipping.","zh":"作为线圈匠，他在发货前会检查每个线圈的张力和形状。"}]}],"synonyms":["spring maker","coil winder","metalworker"],"phonetic":"/ˈkɔɪlˌsmɪθ/","extraExplanation":["“coilsmith”由“coil（线圈/卷绕物）+ smith（铁匠/工匠）”构成，字面意思是“制作线圈的工匠”。","这个词在日常英语中不常见；更常见的表达是“spring maker（弹簧制造工）”“coil winder（绕线工）”或“metalworker（金工）”。在小说、游戏或品牌/用户名中也可能用作职业称号或角色名。"]}
{"word":"coily","summary":{"en":"“Coily” means tightly curled or spiral-shaped, especially describing hair or something like a spring.","zh":"“coily”指紧密卷曲或螺旋盘绕的，常用来形容头发或像弹簧一样的形状。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having many tight curls or coils; tightly curled or spiraled (often used for hair or fibers).","zh":"卷曲的；（常指头发或纤维）紧密盘绕成圈的。"},"examples":[{"en":"She has coily hair that shrinks when it dries.","zh":"她的头发很卷，干了之后会显得更短（有回缩）。"},{"en":"Coily strands can tangle easily, so gentle detangling helps.","zh":"卷曲的发丝容易打结，所以温和地梳开会更好。"}]},{"partOfSpeech":"adj.","definition":{"en":"Shaped like a coil or spring; winding in a spiral form.","zh":"像弹簧一样盘绕的；螺旋形的。"},"examples":[{"en":"The coily metal wire acts like a spring.","zh":"这根盘绕的金属丝像弹簧一样起作用。"},{"en":"A coily hose is easier to store in a small space.","zh":"盘绕的软管更容易收纳在小空间里。"}]}],"synonyms":["curly","kinky","spiral","wavy (less tight)","coiled"],"phonetic":"/ˈkɔɪli/","extraExplanation":["在描述头发时，coily 常用于自然卷发语境，尤其指非常紧密的小卷（有时与 curly 区分：curly 通常指较松的大卷，coily 更紧更密）。在尊重与包容的表达中，很多人会用 coily 或 natural hair 来正面描述发质。"]}
{"word":"coilyear","summary":{"en":"“coilyear” isn’t a standard word. You may mean “coil” (a spiral/loop; to wind into a spiral) or “coily” (tightly curled, often hair).","zh":"“coilyear”不是标准英语词。你可能想写“coil”（线圈/盘绕；盘成圈）或“coily”（紧卷的，常形容头发）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not a standard English word) “coilyear” is not found in major dictionaries. It may be a typo or two words joined together, such as “coil” + “year,” or it may be intended to be “coily hair.”","zh":"（不是标准英语单词）“coilyear”在主流词典中通常查不到，可能是拼写错误，或把两个词连在一起（如“coil + year”），也可能想写“coily hair（卷曲/紧卷的头发）”。"},"examples":[{"en":"I couldn’t find “coilyear” in the dictionary—did you mean “coily hair” or “coil year”?","zh":"我在词典里找不到“coilyear”——你是想写“coily hair”还是“coil year”吗？"}]},{"partOfSpeech":"n.","definition":{"en":"a spiral shape; a round loop (like a spring)","zh":"螺旋形；线圈；（像弹簧一样的）一圈圈的卷"},"examples":[{"en":"The wire was shaped into a coil.","zh":"这根金属丝被绕成了线圈。"},{"en":"A snake lay in a tight coil.","zh":"一条蛇盘成一团。"}]},{"partOfSpeech":"v.","definition":{"en":"to wind or twist into a spiral shape","zh":"把……盘成圈；卷起；绕成螺旋状"},"examples":[{"en":"She coiled the rope neatly.","zh":"她把绳子整齐地盘起来。"},{"en":"Smoke coiled up into the air.","zh":"烟雾盘旋着升到空中。"}]},{"partOfSpeech":"adj.","definition":{"en":"tightly curled (often describing hair)","zh":"（常形容头发）紧卷的；卷曲的"},"examples":[{"en":"He has short, coily hair.","zh":"他有一头短短的紧卷发。"},{"en":"Coily textures can shrink when they dry.","zh":"紧卷发质干了之后可能会显得更短（回缩）。"}]}],"synonyms":["spiral","loop","wind","curl"],"phonetic":"/kɔɪl/","extraExplanation":["“coily hair”在英语里常用来描述自然卷、紧卷的发质，尤其在谈论黑人发质与护发时很常见。这个表达通常是中性或积极的，但语境里要避免把卷发当作“凌乱/不整洁”的负面评价。","如果你想表达“盘绕的一年/卷曲的一年”，英语里一般不会说“coil year”。可以告诉我你想表达的中文或句子场景，我可以帮你改成自然英语。"]}
{"word":"Coimbatore","summary":{"en":"Coimbatore is a large industrial and educational city in Tamil Nadu, India.","zh":"Coimbatore（科印拜陀）是印度泰米尔纳德邦一座重要的工业与教育城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A major city in the Indian state of Tamil Nadu, known as an important center for textiles, engineering, and education.","zh":"印度泰米尔纳德邦的一座重要城市，以纺织业、工程制造和教育闻名。"},"examples":[{"en":"She moved to Coimbatore for a job in the textile industry.","zh":"她搬到科印拜陀，在纺织行业工作。"},{"en":"Coimbatore is often used as a base to visit nearby hill stations like Ooty.","zh":"科印拜陀常被用作前往附近山城（如乌蒂 Ooty）的出发地。"}]}],"phonetic":"/ˌkɔɪm.bəˈtɔr/","extraExplanation":["“Coimbatore”是英语常见拼写；在印度本地语境中也常见缩写“CBE”（机场代码）。","这座城市有时被称为“South India’s Manchester（南印度的曼彻斯特）”，强调其纺织与制造业传统；同时也是通往西高止山脉（Western Ghats）周边景点的交通枢纽。"]}
{"word":"Coimbra","summary":{"en":"Coimbra is a historic city in central Portugal and can also refer to its famous university.","zh":"Coimbra 是葡萄牙中部的历史名城，也可指其著名的科英布拉大学。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historic city in central Portugal, known for the University of Coimbra and its old town.","zh":"葡萄牙中部的一座历史名城，以科英布拉大学与古城区闻名。"},"examples":[{"en":"We spent a day in Coimbra visiting the university library.","zh":"我们在科英布拉待了一天，参观了大学图书馆。"},{"en":"Coimbra is often included in travel routes between Lisbon and Porto.","zh":"科英布拉常被纳入里斯本和波尔图之间的旅行路线。"}]},{"partOfSpeech":"n.","definition":{"en":"the University of Coimbra, one of the oldest universities in Europe (often referred to simply as “Coimbra” in context).","zh":"科英布拉大学（欧洲最古老的大学之一；在特定语境中也常直接简称为“Coimbra”）。"},"examples":[{"en":"She studied law at Coimbra.","zh":"她在科英布拉大学学习法律。"},{"en":"Coimbra has a long tradition of student songs and ceremonies.","zh":"科英布拉有悠久的学生歌唱与仪式传统。"}]}],"synonyms":["(for the university) University of Coimbra"],"phonetic":"/ˈkɔɪmbrə/","extraExplanation":["“Coimbra”在英语里通常指“城市”本身，但在学术或留学语境中也可能指“科英布拉大学”。","科英布拉大学的历史城区（University of Coimbra – Alta and Sofia）被列为联合国教科文组织世界遗产。","当地有一种与学生文化相关的音乐传统，常被称为“Coimbra fado（科英布拉法朵）”，风格与里斯本法朵有所不同。"]}
{"word":"coimmense","summary":{"en":"Coimmense means “equal in extent or size,” used in formal or academic writing.","zh":"coimmense 指“在范围或大小上相同”，多用于正式或学术写作。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(formal) Having the same extent, size, or dimensions as something else; equally large or wide.","zh":"（正式用语）与另一事物在范围、大小或尺寸上相同；同样广阔/同样大。"},"examples":[{"en":"The plateau is nearly coimmense with the entire region shown on the map.","zh":"这片高原的范围几乎与地图上显示的整个地区一样大。"},{"en":"In the report, the benefits were not coimmense with the costs.","zh":"在报告中，收益与成本并不相称（并非同等规模）。"}]}],"synonyms":["coextensive","coterminous","equal in extent","of the same size"],"phonetic":"/ˌkoʊɪˈmɛns/","extraExplanation":["“coimmense”非常少见，属于偏书面、学术或古典语体的词。更常见的替代词是“coextensive”（范围相同）或“equal in size/extent”（大小/范围相同）。","在哲学或神学语境中，它有时用来表达“在广延/范围上完全一致”的概念（例如讨论两个概念或属性的‘同样广延’）。"]}
{"word":"coimplicant","summary":{"en":"A technical logic term meaning a clause/term that is entailed by a Boolean expression (often similar to “implicate”).","zh":"逻辑中的专业术语，指被某个布尔表达式所蕴含（必然成立）的子句/项，常与 implicate 含义相近。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(logic / Boolean algebra) A term or clause that is logically implied (entailed) by a given expression or Boolean function; roughly, an “implicate,” sometimes used as the dual notion to an implicant.","zh":"（逻辑/布尔代数）由某个表达式或布尔函数在逻辑上所推出（蕴含/必然成立）的项或子句；大致相当于“implicate（被蕴含的子句）”，有时作为 implicant（蕴含项）的对偶概念来使用。"},"examples":[{"en":"If a Boolean function f always makes the clause C true, then C is a coimplicant of f.","zh":"如果布尔函数 f 在所有情况下都会使子句 C 为真，那么 C 就是 f 的一个 coimplicant。"},{"en":"In some texts, “coimplicant” is used for what other authors simply call an implicate.","zh":"在一些文献中，“coimplicant”用来表示其他作者所说的 implicate（被蕴含的子句）。"}]}],"synonyms":["implicate","entailed clause","logical consequence"],"phonetic":"/ˌkoʊˈɪmplɪkənt/","extraExplanation":["这是一个偏专业、较少见的术语，主要出现在数理逻辑与布尔函数化简（如数字电路设计、K-map/卡诺图相关讨论）中。","常见的一对概念是 implicant（能推出函数为真的“蕴含项”，常对应“与项/乘积项”）与 implicate（由函数推出必为真的“被蕴含子句”，常对应“或项/和项”）。coimplicant 有时就是用来强调这种“对偶（dual）”关系的说法。","不同教材/论文对该词的使用不完全一致；阅读时建议直接查看作者给出的形式化定义（例如是否写成 f ⇒ C，或用集合/代数不等式表示）。"]}
{"word":"coimplicate","summary":{"en":"Coimplicate means to involve or implicate two or more parties together, often in a crime or responsibility.","zh":"coimplicate 指把两方或多方一起牵连/卷入（常与犯罪或责任相关）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to implicate someone (or something) together with another person or thing; to involve jointly, often in wrongdoing or responsibility","zh":"把某人（或某事）与他人/他事一并牵连；共同牵涉（常指不当行为或责任）"},"examples":[{"en":"The evidence could coimplicate two employees in the theft.","zh":"这些证据可能会把两名员工一并牵连到盗窃案中。"},{"en":"Be careful—your statement might coimplicate your friend.","zh":"小心——你的陈述可能会把你朋友也牵连进去。"}]}],"synonyms":["implicate","involve","entangle","link","incriminate"],"phonetic":"/koʊˈɪmplɪˌkeɪt/","extraExplanation":["这个词比较少见，常出现在法律或正式写作中。含义接近 “implicate（牵连）+ co-（共同）”，强调“不是单独牵连一个人，而是连同另一个人一起被牵连”。写作中更常用的表达有：implicate both…, involve both…, link A and B to… 等。"]}
{"word":"coimplore","summary":{"en":"“Coimplore” means to implore or beg together with others.","zh":"“coimplore”表示与他人一起恳求、共同哀求。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to beg or plead together with someone else; to implore jointly","zh":"与他人一起恳求；共同哀求"},"examples":[{"en":"They coimplored the judge for mercy.","zh":"他们一起向法官恳求宽恕。"},{"en":"Neighbors coimplored the city to keep the library open.","zh":"邻居们一同恳求市政府不要关闭图书馆。"}]}],"synonyms":["implore together","beg together","plead together","join in pleading"],"phonetic":"/ˌkoʊɪmˈplɔr/","extraExplanation":["“co-”表示“共同、一起”（如 cooperate, coauthor），“implore”表示“恳求、哀求”。“coimplore”属于非常少见/偏书面或古旧的用词；日常更常用“implore/beg/plead together”或“join (someone) in pleading”。"]}
{"word":"coin","summary":{"en":"Coin means a metal piece used as money, and it can also mean to invent a new word or phrase.","zh":"coin 指“硬币”，也可作动词表示“创造新词/新说法”，还可指“铸币”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small flat piece of metal used as money","zh":"硬币；钱币（通常为金属制的小圆片）"},"examples":[{"en":"I found a coin on the sidewalk.","zh":"我在人行道上捡到一枚硬币。"},{"en":"Do you have any coins for the parking meter?","zh":"你有投停车计时器用的硬币吗？"},{"en":"He keeps loose coins in his pocket.","zh":"他口袋里放着一些散硬币。"}]},{"partOfSpeech":"vt.","definition":{"en":"to invent a new word, phrase, or name; to create (something new)","zh":"创造（新词/短语/名称）；首次提出（说法）"},"examples":[{"en":"Shakespeare coined many words that we still use today.","zh":"莎士比亚创造了许多至今仍在使用的词。"},{"en":"She coined the term “microbreak” for short rests during work.","zh":"她创造了“microbreak”（微休息）这个说法，指工作中的短暂休息。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make metal into coins; to mint","zh":"把（金属）铸成硬币；铸币"},"examples":[{"en":"The government coins new money each year.","zh":"政府每年都会铸造新货币。"},{"en":"In ancient times, rulers coined gold and silver into currency.","zh":"在古代，统治者把金银铸成货币。"}]}],"synonyms":["(n.) money","(n.) piece","(vt.) invent","(vt.) create","(vt.) mint"],"phonetic":"/kɔɪn/","extraExplanation":["“coin”作动词“创造新词/新说法”时很常见，常用搭配是 coin a term / coin a phrase（创造一个术语/短语）。","文化小知识：美国硬币常见面额有 penny（1美分）, nickel（5美分）, dime（10美分）, quarter（25美分）。不同国家对硬币的称呼和使用场景也会不同。"]}
{"word":"coin meter","summary":{"en":"a coin-operated device that charges by time or usage","zh":"投币式按时间或用量收费的装置"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device you put coins into to pay for a service for a set amount of time, especially a parking meter","zh":"投币计时/计费装置（尤指投币停车计时器）"},"examples":[{"en":"I ran back to feed the coin meter before it expired.","zh":"我赶在到期前跑回去给投币停车计时器续费。"},{"en":"This street uses coin meters, so bring some change.","zh":"这条街用投币计时器，所以带点零钱。"}]},{"partOfSpeech":"n.","definition":{"en":"a coin-operated meter that measures and charges for utilities or shared services (less common)","zh":"投币式计量/收费表（较少见，如公用设施或共享服务）"},"examples":[{"en":"In older buildings, a coin meter was sometimes used for electricity or gas.","zh":"在较老的建筑里，有时会用投币式电表或燃气表。"}]}],"synonyms":["parking meter","coin-operated meter","pay meter"],"phonetic":"/ˈkɔɪn ˌmiːtər/","extraExplanation":["在美式英语里，更常说 parking meter（停车计时器）或 pay meter（付费计时器）。coin meter 更像是口语里对“投币式计时器/收费器”的直观说法。","如果你想表达“给停车计时器投币续时间”，常用动词是 feed the meter（给表投币/续费）。"],"etymology":"由 coin（硬币）+ meter（计量/计时装置）构成的名词短语；字面意思是“用硬币驱动或支付的计量器”。","mnemonic":["coin=硬币；meter=“米/表”。想成“用硬币让‘表’开始计时/计费”。","联想中文“投币+计时器/计费表”，就是把 coin meter 直译成一个功能词组。"]}
{"word":"coin slot","summary":{"en":"a machine opening for inserting coins","zh":"机器上用于投入硬币的狭缝开口"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a narrow opening in a machine where you put a coin to make it work","zh":"（机器上的）投币口；硬币投入口"},"examples":[{"en":"Insert a coin into the coin slot to start the game.","zh":"把硬币投进投币口就能开始游戏。"},{"en":"The coin slot was jammed, so the vending machine wouldn’t accept money.","zh":"投币口卡住了，所以自动售货机不收钱。"}]}],"synonyms":["coin insert","coin inlet","coin chute","coin entry"],"phonetic":"/ˈkɔɪn slɑt/","extraExplanation":["在英式英语里也常说 coin slot；在一些场景中也会看到 coin slot / coin inlet / coin insert 等近义说法。现代机器更多使用读卡器或二维码，但街机、投币洗衣机、旧式停车计时器等仍常见。"],"etymology":"由 coin（硬币）+ slot（狭长的口/槽）组合而成的名词短语，用来指机器上专门放入硬币的开口。","mnemonic":["slot 有“槽/狭缝”的意思，可以联想中文“插槽”；coin slot 就是“硬币插槽”。"]}
{"word":"coin-like","summary":{"en":"Coin-like means shaped or looking like a coin—round and flat.","zh":"coin-like 表示“像硬币的”，指外形或外观圆而扁。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a coin in shape or appearance (usually round, flat, and metallic-looking).","zh":"像硬币的；外形或外观类似硬币的（通常指圆形、扁平、带金属质感）。"},"examples":[{"en":"The archaeologist found a small, coin-like disc near the pottery.","zh":"考古学家在陶器旁发现了一块小小的、像硬币一样的圆片。"},{"en":"Some mushrooms have coin-like caps that lie flat when they mature.","zh":"有些蘑菇成熟后菌盖会变得扁平，形状像硬币。"},{"en":"The machine uses coin-like tokens instead of real money.","zh":"这台机器使用像硬币一样的代币，而不是真正的货币。"}]}],"synonyms":["coin-shaped","round","circular","disk-like","medallion-like"],"phonetic":"/ˈkɔɪnˌlaɪk/","extraExplanation":["“coin-like”是由名词“coin（硬币）+ like（像……的）”构成的复合形容词，常用来做定语（放在名词前），描述形状或外观：coin-like object / coin-like spot。","在科学或说明性写作中很常见，用于描述“圆、扁、类似硬币的”结构；也可用于比喻，但多偏客观描写。"]}
{"word":"coin-making","summary":{"en":"Coin-making means the process of producing coins (minting) and can also describe things related to minting.","zh":"coin-making 指“铸币/制作硬币”的过程，也可作形容词表示“与铸币有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The process or business of producing coins (minting).","zh":"铸币；制作硬币的过程或行业。"},"examples":[{"en":"Coin-making requires strict quality control to keep every coin the same size and weight.","zh":"铸币需要严格的质量控制，确保每枚硬币的尺寸和重量一致。"},{"en":"In ancient times, coin-making was often controlled by the ruler to protect the value of money.","zh":"在古代，铸币常由统治者掌控，以保护货币价值。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to producing coins; used to describe tools, materials, or techniques for minting.","zh":"与铸币有关的；用于描述铸币的工具、材料或技术。"},"examples":[{"en":"The museum displayed coin-making equipment from the 1800s.","zh":"博物馆展出了19世纪的铸币设备。"},{"en":"They studied coin-making methods to see how counterfeits can be detected.","zh":"他们研究铸币方法，以了解如何识别假币。"}]}],"synonyms":["minting","coin production","coining (rare in this literal sense)"],"phonetic":"/ˈkɔɪn ˌmeɪkɪŋ/","extraExplanation":["“coin-making”更常见于说明性写作（如历史、博物馆展览、经济学语境）。在日常英语里，人们更常说“minting”或“coin production”。","注意不要和“coin money”（创造/编造一个新词或新说法）混淆：前者是“铸币”，后者是比喻用法，意思是“造新词/新说法”。"]}
{"word":"coin-related","summary":{"en":"“Coin-related” means connected with coins or coin-based money; it can also mean related to crypto “coins,” depending on context.","zh":"“Coin-related”表示与硬币或以硬币为基础的金钱有关；在加密货币语境中也可表示与“币种/代币”相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with coins (physical money), coinage, or money that involves coins.","zh":"与硬币（实体货币）、铸币或涉及硬币的金钱有关的。"},"examples":[{"en":"The museum has a coin-related exhibit about ancient Roman money.","zh":"博物馆有一个与硬币相关的展览，介绍古罗马货币。"},{"en":"Coin-related businesses include vending machines and coin laundries.","zh":"与硬币相关的行业包括自动售货机和投币式洗衣店。"}]},{"partOfSpeech":"adj.","definition":{"en":"Connected with cryptocurrencies that use the word “coin” (e.g., Bitcoin), or with crypto “coins” in general.","zh":"与加密货币中称为“coin”的币种（如比特币）或一般“币种”相关的。"},"examples":[{"en":"She follows coin-related news like Bitcoin price updates.","zh":"她关注与币相关的新闻，比如比特币价格更新。"},{"en":"Be careful with coin-related advice online; check reliable sources.","zh":"对网上与币相关的建议要小心；尽量核实可靠来源。"}]}],"synonyms":["coin-based","coin-associated","related to coins","coin-focused"],"phonetic":"/ˈkɔɪn rɪˌleɪtɪd/","extraExplanation":["“coin-related”是由名词coin + related组成的复合形容词，常用连字符，尤其在名词前作定语（coin-related problems）。在口语或非正式写作中也可能看到coin related（不加连字符），但正式写作更推荐用连字符以避免歧义。","注意语境：在传统金融语境里coin通常指“硬币”；在加密货币语境里coin常指“币种/代币”。"]}
{"word":"coin-shaped","summary":{"en":"Coin-shaped describes something that is flat and round like a coin.","zh":"coin-shaped 用来形容“像硬币一样扁平且圆”的形状。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape of a coin: flat and round, usually like a disk.","zh":"硬币形的；像硬币一样扁平且圆（通常呈圆盘状）。"},"examples":[{"en":"The pharmacist gave me a coin-shaped tablet.","zh":"药剂师给了我一片硬币形的药片。"},{"en":"A coin-shaped patch of sunlight fell on the floor.","zh":"地板上落着一块硬币形的阳光。"}]}],"synonyms":["round","disk-shaped","circular","flat and round"],"phonetic":"/ˈkɔɪn ˌʃeɪpt/","extraExplanation":["常见搭配：coin-shaped tablet（圆片药）、coin-shaped lesion（硬币状皮损，医学/皮肤科用语）、coin-shaped spot/mark（硬币状斑点/印记）。","结构提示：这是“名词 + -shaped”的复合形容词（如 heart-shaped, star-shaped）。通常要加连字符 coin-shaped；但在名词前作定语时也常见无连字符写法（较少见，尤其在非正式文本中）。"]}
{"word":"coin-stacking","summary":{"en":"Coin-stacking is stacking coins into a stable pile, or anything related to that activity.","zh":"coin-stacking 指把硬币叠成稳定的一叠（或与此活动相关的事物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity or skill of placing coins on top of each other to make a stable stack, often as a quick hand-skill game or challenge","zh":"把硬币一枚一枚叠起来形成稳定硬币塔的活动或技巧，常作为手部灵巧度的小游戏或挑战"},"examples":[{"en":"We played a coin-stacking challenge while waiting for the train.","zh":"我们等火车时玩了硬币叠叠乐的挑战。"},{"en":"Coin-stacking is harder than it looks because the coins can slip easily.","zh":"硬币叠起来比看起来难，因为硬币很容易打滑。"}]},{"partOfSpeech":"adj.","definition":{"en":"used to describe something related to stacking coins (e.g., a game, competition, or skill exercise)","zh":"用来形容与“叠硬币”有关的事物（如游戏、比赛或技能训练）"},"examples":[{"en":"The school ran a coin-stacking contest at the festival.","zh":"学校在节庆活动上举办了硬币叠叠乐比赛。"},{"en":"She bought a coin-stacking kit for her younger brother.","zh":"她给弟弟买了一套硬币叠叠乐的套装。"}]}],"synonyms":["coin stacking","stacking coins","coin-stacking game","coin-stacking challenge"],"phonetic":"/ˈkɔɪn ˌstækɪŋ/","extraExplanation":["“coin-stacking”常见于轻松的游戏/挑战语境，也可出现在训练手眼协调与精细动作的活动中（例如课堂活动、聚会小游戏）。","写法上常用连字符（coin-stacking）表示“叠硬币的/关于叠硬币的”。也可能写作 coin stacking（不加连字符），意思相同。"]}
{"word":"coinable","summary":{"en":"“Coinable” means able to be newly created—especially as a new word or term; less commonly, able to be made into coins/money.","zh":"“coinable”表示“可被创造出来的（尤指新词/术语）”；较少见时也指“可用于铸币/可换成钱的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be coined; capable of being newly created, especially as a new word, phrase, or term.","zh":"可被造出（铸造/创造）的；（尤指词语或术语）可被新造出来的。"},"examples":[{"en":"The author uses several coinable expressions that later became common in everyday speech.","zh":"这位作者用了好几个可被新造出来的表达，后来变成了日常常用语。"},{"en":"With new technology, many coinable terms appear quickly and spread online.","zh":"随着新技术出现，很多可新造的术语很快出现并在网上传播。"}]},{"partOfSpeech":"adj.","definition":{"en":"Able to be converted into money or used as money (rare).","zh":"可换成钱的；可当作货币使用的（较少见）。"},"examples":[{"en":"In theory, the metal was coinable, but it was too soft for real coins.","zh":"理论上这种金属可用于铸币，但太软，不适合真正的硬币。"}]}],"synonyms":["inventable","creatable","neologizable (rare)","mintable (for coins)"],"phonetic":"/ˈkɔɪnəbəl/","extraExplanation":["“coinable”来自动词“coin”（铸造；创造新词）+ 形容词后缀“-able”（能够……的）。在语言学习里更常见的是“coin a term/phrase”（创造一个术语/说法），所以“coinable”多用于讨论某个概念是否“好取名/好造词”。","与之相关的常用表达：“to coin a phrase”（常用于半开玩笑地说“借用一句话/让我造个说法”）。"]}
{"word":"coinage","summary":{"en":"Coinage means either (1) coins or the making of coins, or (2) the creation of a new word or phrase.","zh":"Coinage既指（1）硬币/铸币，也指（2）新词新短语的创造（造词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of making coins; a system or type of coins used in a country or period","zh":"铸币；（某国家/时期的）货币体系、硬币种类"},"examples":[{"en":"Ancient Rome had a wide variety of coinage made from gold, silver, and bronze.","zh":"古罗马有多种由金、银、铜铸成的铸币。"},{"en":"The museum displays coinage from the Han dynasty.","zh":"博物馆展出了汉代的铸币。"}]},{"partOfSpeech":"n.","definition":{"en":"the invention or creation of a new word, phrase, or expression","zh":"（新词、新短语的）创造；造词"},"examples":[{"en":"“Selfie” is a relatively recent coinage that quickly became common.","zh":"“selfie（自拍）”是一个相对较新的造词，很快就普及了。"},{"en":"Some coinages spread through social media and then enter dictionaries.","zh":"一些新造词先在社交媒体上传播，后来进入词典。"}]}],"synonyms":["currency","minting","new word","neologism"],"phonetic":"/ˈkɔɪnɪdʒ/","extraExplanation":["“coinage”来自动词“coin”（铸造/创造）。因此它既可以指“铸币”（把金属做成硬币），也可以比喻“造词”（把语言“铸造”出新表达）。","在语言学语境里，“coinage”常与“neologism（新词）”接近，但“coinage”更强调“创造出来的过程/产物”，而“neologism”更强调“新”这一属性。"]}
{"word":"coinages","summary":{"en":"Coinages are either newly invented words/expressions or the coins/minting produced in a particular place or time.","zh":"coinages 可指新造的词语/表达，也可指某地或某时期的铸币（硬币）及铸造行为。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"new words or expressions that someone invents (often used in writing, media, or everyday speech)","zh":"（某人）新造的词语或表达（常见于写作、媒体或日常用语）"},"examples":[{"en":"Internet slang produces new coinages every year.","zh":"网络俚语每年都会产生新的造词。"},{"en":"The novelist’s coinages made the dialogue feel fresh.","zh":"这位小说家的新造词让对话显得很新鲜。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or process of inventing a new word or phrase","zh":"造词；创造新词语的行为或过程"},"examples":[{"en":"The coinage of “selfie” spread quickly through social media.","zh":"“selfie（自拍）”这个词的创造很快通过社交媒体传播开来。"},{"en":"In linguistics class, we discussed coinage as a way languages grow.","zh":"在语言学课上，我们讨论了“造词”是语言发展的方式之一。"}]},{"partOfSpeech":"n.","definition":{"en":"the making of coins, or the coins produced in a particular place/time","zh":"铸币；（某地/某时期）铸造出来的硬币"},"examples":[{"en":"The museum displayed ancient Roman coinages.","zh":"博物馆展出了古罗马时期的硬币。"},{"en":"The mint increased coinage during the shortage.","zh":"在短缺时期，造币厂增加了铸币量。"}]}],"synonyms":["neologisms","new terms","new expressions","minting","coins"],"phonetic":"/ˈkɔɪnɪdʒ/","extraExplanation":["“coinage”既可指“新造的词”（语言层面），也可指“铸造硬币/硬币发行”（货币层面）。复数 coinages 常用于：①不同作者/群体的“新造词集合”；②不同国家或时期的“币制/铸币种类”。","词源上来自 coin（硬币/铸造）+ -age（表示“行为/结果/集合”的后缀）。英语里用“铸造”来比喻“造词”，因此同一个词连接了语言与货币两个领域。"]}
{"word":"coincide","summary":{"en":"“Coincide” means to happen at the same time, to match exactly, or (more formally) to agree.","zh":"“coincide”表示同时发生、完全一致，或（较正式）观点一致/赞同。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to happen at the same time; to occur together","zh":"（事件）同时发生；时间上重合"},"examples":[{"en":"The meeting coincides with my flight, so I can’t attend.","zh":"会议和我的航班时间重合，所以我参加不了。"},{"en":"This year, the holiday coincides with the start of the school term.","zh":"今年假期刚好与新学期开始重合。"}]},{"partOfSpeech":"vi.","definition":{"en":"to be the same or match exactly (in position, results, or details)","zh":"（位置、结果或细节）完全一致；相符合"},"examples":[{"en":"Our conclusions coincide with the data.","zh":"我们的结论与数据一致。"},{"en":"The two lines coincide at this point.","zh":"这两条线在这一点上重合。"}]},{"partOfSpeech":"vi.","definition":{"en":"to agree with someone’s opinion; to be in agreement","zh":"（观点）一致；赞同"},"examples":[{"en":"I coincide with you on the need for clearer rules.","zh":"关于需要更明确的规则这一点上，我赞同你。"},{"en":"Few experts coincide on the best solution.","zh":"很少有专家在最佳解决方案上达成一致。"}]}],"synonyms":["happen at the same time as","occur together","match","correspond","agree (formal)"],"phonetic":"/ˌkoʊɪnˈsaɪd/","extraExplanation":["“coincide”常见搭配：coincide with（与……同时发生/与……一致）。例如：Her birthday coincides with New Year’s Day.（她的生日正好是元旦。）","在“赞同”这个意思上，英语里更常用 agree (with)，而 coincide with someone（与某人意见一致）较正式、偏书面。"]}
{"word":"coincide with","summary":{"en":"to occur at the same time as, or to match/align with","zh":"与……同时发生；与……一致/重合"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to happen at the same time as something else","zh":"与……同时发生；恰好与……同一时间"},"examples":[{"en":"My vacation coincides with the Spring Festival this year.","zh":"我今年的假期刚好与春节同一时间。"},{"en":"The power outage coincided with the storm.","zh":"停电恰好发生在暴风雨期间。"}]},{"partOfSpeech":"phrase","definition":{"en":"to match, agree with, or be the same as something (ideas, results, descriptions)","zh":"与……一致；与……相符（观点、结果、描述等）"},"examples":[{"en":"His story doesn’t coincide with the evidence.","zh":"他的说法与证据不一致。"},{"en":"The survey results coincide with what teachers have been saying.","zh":"调查结果与老师们一直在说的情况相符。"}]},{"partOfSpeech":"phrase","definition":{"en":"to overlap or line up in the same place (often about lines, points, or areas)","zh":"重合；对齐（常指线、点或区域）"},"examples":[{"en":"In this diagram, the two lines coincide with each other.","zh":"在这张图里，两条线彼此重合。"},{"en":"Make sure the holes coincide with the screws.","zh":"确保孔位与螺丝对齐。"}]}],"synonyms":["happen at the same time as","occur simultaneously with","overlap with","align with","match","agree with","correspond with","concur with"],"phonetic":"/ˌkoʊɪnˈsaɪd wɪð/","extraExplanation":["常见搭配：coincide with + 时间/事件（同时发生）；coincide with + 观点/证据（相符）；coincide with + 线/点/位置（重合、对齐）。","与 happen to / occur 的区别：coincide with 强调“同时”或“相符/重合”，而不仅是“发生”。"],"etymology":"源自拉丁语 co-（一起）+ incidere（落下、发生），原意有“共同落下/同时发生”，后来引申为“相符、重合”。","mnemonic":["co- 表示“共同/一起”（像 cooperate），incide 可联想“落下/发生”→ 一起发生＝同时发生。","把 coincide 记成“co(一起)+inside(里面)”：两件事“在同一个时间/范围里”，就能 coincide。"]}
{"word":"coincided","summary":{"en":"“Coincided” means two things happened at the same time or matched/agreeed closely.","zh":"“coincided”表示两件事在时间上同时发生，或在内容/观点/细节上相符一致。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to happen at the same time as something else; to occur together","zh":"（与某事）同时发生；时间上巧合"},"examples":[{"en":"My visit coincided with her birthday.","zh":"我去拜访的时间刚好赶上她的生日。"},{"en":"The festival coincided with a week of heavy rain.","zh":"节日期间恰好遇上一整周的大雨。"}]},{"partOfSpeech":"vi.","definition":{"en":"to match or be the same; to agree (especially in opinions, results, or details)","zh":"相符；一致；（观点、结果、细节等）吻合"},"examples":[{"en":"Their stories coincided in every detail.","zh":"他们的说法在每个细节上都一致。"},{"en":"The test results coincided with the doctor’s expectations.","zh":"检测结果与医生的预期相符。"}]}],"synonyms":["happened at the same time","overlapped","matched","agreed","corresponded"],"phonetic":"/ˌkoʊɪnˈsaɪdɪd/","extraExplanation":["“coincided”是动词“coincide”的过去式/过去分词，常用于过去发生的巧合：A coincided with B。","常见搭配：coincide with（与……同时发生/一致）；it coincides that...（较少见，书面语）。注意不要和“coincidence（巧合，名词）”混淆。"]}
{"word":"coincidence","summary":{"en":"A coincidence is when things happen or match unexpectedly by chance, without a clear cause-and-effect link.","zh":"coincidence 指事情“碰巧发生/吻合”的巧合，强调偶然同时出现而非明确因果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A situation in which two or more events happen at the same time or in the same way by chance (not because one caused the other).","zh":"（巧合）两个或多个事件在同一时间发生或出现相似之处，但并非因果关系，而是出于偶然。"},"examples":[{"en":"It was a coincidence that we both wore the same color to the meeting.","zh":"我们俩开会时穿了同样的颜色只是巧合。"},{"en":"By coincidence, I met my old teacher on the subway.","zh":"真巧，我在地铁上遇到了以前的老师。"},{"en":"Some people see it as fate, but it may just be coincidence.","zh":"有些人觉得这是命运安排，但也可能只是巧合。"}]},{"partOfSpeech":"n.","definition":{"en":"The fact of two things matching or being similar at the same time, sometimes used in a more formal or academic way.","zh":"（更正式/学术）两件事在同一时刻相互符合或相似的情况（强调“同时发生的相符性”）。"},"examples":[{"en":"Researchers noted a coincidence between the rise in temperatures and the decline in ice coverage.","zh":"研究人员注意到气温上升与冰层覆盖下降之间出现了同步对应的现象。"},{"en":"There is a striking coincidence in their stories.","zh":"他们的故事之间有一种惊人的相似与吻合。"}]}],"synonyms":["chance","fluke","accident (in some contexts)","happenstance"],"phonetic":"/koʊˈɪnsɪdəns/","extraExplanation":["“coincidence”常和介词搭配使用：by coincidence（碰巧/凑巧）；a coincidence that...（……是巧合）；It’s no coincidence that...（……绝非偶然，常用来暗示背后有原因）。","注意区分：coincidence 强调“同时发生但未必有关联”；accident 强调“意外/事故”，通常带有不好的结果；chance 更泛指“偶然性/机会”。"]}
{"word":"coincidences","summary":{"en":"“Coincidences” means chance events that happen together or match unexpectedly; it can also mean exact matches in data or results.","zh":"“coincidences”指“巧合”（偶然同时发生或出人意料的相遇/一致），也可指数据或结果中的“重合/一致”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Events that happen at the same time (or in the same situation) by chance, not because one causes the other.","zh":"（复数）巧合：一些事件在同一时间（或同一情境）发生，但只是偶然，并非彼此造成。"},"examples":[{"en":"It was a coincidence that we both chose the same café on our first day in the city.","zh":"我们到这个城市第一天就选了同一家咖啡馆，真是巧合。"},{"en":"People often look for meaning in coincidences, even when there isn’t any.","zh":"人们常常想在巧合里寻找意义，即使其实并没有。"},{"en":"By coincidence, I ran into my old teacher at the airport.","zh":"很巧，我在机场碰到了以前的老师。"}]},{"partOfSpeech":"n.","definition":{"en":"A situation where two numbers or things match exactly (often used in math or science).","zh":"（复数）一致/重合：两个数字或事物完全相同（常用于数学或科学语境）。"},"examples":[{"en":"The two methods produced coincidences in the final results.","zh":"这两种方法在最终结果上出现了一致。"},{"en":"Researchers checked for coincidences between the two data sets.","zh":"研究人员检查了两组数据之间是否有重合之处。"}]}],"synonyms":["chance events","accidents (informal, not ‘accident’ as a crash)","random occurrences","matches","concurrences"],"phonetic":"/koʊˈɪnsɪdənsɪz/","extraExplanation":["“coincidences”是“coincidence”的复数。日常口语里也常说：It’s just a coincidence.（只是巧合而已。）","常见搭配：by coincidence（碰巧）、a strange/odd coincidence（奇怪的巧合）、pure coincidence（纯属巧合）。注意不要和“accident（事故）”混淆：accident通常指意外事件，可能造成伤害；coincidence强调“同时发生的偶然性”。"]}
{"word":"coincidency","summary":{"en":"“Coincidency” is a rare noun meaning the state of being a coincidence; most speakers use “coincidence.”","zh":"“coincidency”是个很少用的名词，表示“巧合的状态/巧合”；更常用、更标准的是“coincidence”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of happening at the same time, or of occurring together by chance; a coincidence (rare).","zh":"（罕用）同时发生或偶然同时出现的状态；巧合。"},"examples":[{"en":"Their arriving at the same moment felt like pure coincidentcy.","zh":"他们同一时刻到达，感觉完全是个巧合。"},{"en":"In everyday English, people usually say “coincidence,” not “coincidency.”","zh":"在日常英语里，人们通常说“coincidence”，而不是“coincidency”。"}]},{"partOfSpeech":"n.","definition":{"en":"agreement or correspondence between two things; similarity in results or meaning (rare).","zh":"（罕用）两者之间的一致、相符；结果或含义上的相似。"},"examples":[{"en":"There is a coincidentcy between the two reports’ conclusions.","zh":"两份报告的结论有一致之处。"}]}],"synonyms":["coincidence","chance occurrence","concurrence","agreement","correspondence"],"phonetic":"/koʊˈɪnsɪdənsi/","extraExplanation":["“coincidency”在现代英语中非常少见，写作和口语里更标准、更常用的是“coincidence”。如果你想表达“巧合/偶然一致”，一般用“a coincidence”或“by coincidence”。","常见搭配：“What a coincidence!”（真巧！），“It’s no coincidence that…”（……绝非巧合）。"]}
{"word":"coincident","summary":{"en":"Coincident means happening at the same time, or (more formally) exactly overlapping or matching.","zh":"coincident 表示“同时发生的”，也可表示（较正式/技术性）“重合的、完全一致的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening at the same time; simultaneous.","zh":"同时发生的；同一时间发生的。"},"examples":[{"en":"The concert and the festival are coincident this weekend.","zh":"音乐会和节日这个周末同时举行。"},{"en":"The coincident meetings made scheduling difficult.","zh":"同时进行的会议让排期变得困难。"}]},{"partOfSpeech":"adj.","definition":{"en":"Existing in the same place or matching exactly (often used in geometry or technical contexts).","zh":"位于同一位置的；完全重合的（常用于几何或技术语境）。"},"examples":[{"en":"In the diagram, the two circles are coincident.","zh":"在图中，这两个圆是重合的。"},{"en":"Their results were coincident with earlier findings.","zh":"他们的结果与早期发现完全一致。"}]}],"synonyms":["simultaneous","concurrent","overlapping","coexisting"],"phonetic":"/koʊˈɪn.sə.dənt/","extraExplanation":["易混词提示：coincident（同时发生/重合）≠ coincidence（巧合，名词）。比如：It was a coincidence.（那是个巧合。）但不能说 *It was a coincident.。"]}
{"word":"coincidental","summary":{"en":"“Coincidental” means something happens by chance at the same time, not because it was planned.","zh":"「coincidental」指事情同時發生是出於巧合，並非事先安排。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening by chance at the same time; not planned or arranged.","zh":"巧合的；同時發生但並非計畫或安排好的。"},"examples":[{"en":"It was coincidental that we arrived at the same café at the exact same time.","zh":"我們剛好同一時間到同一家咖啡館，這真是巧合。"},{"en":"Their similar outfits were coincidental—they didn’t coordinate.","zh":"他們穿得很像只是巧合，並沒有事先約好。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to or resulting from a coincidence (an event that happens by chance).","zh":"與巧合有關的；由巧合造成的。"},"examples":[{"en":"The timing seems more than coincidental.","zh":"這個時間點看起來不像只是巧合。"}]}],"synonyms":["accidental","by chance","fortuitous","unexpected"],"phonetic":"/koʊˌɪn.səˈdɛn.təl/","extraExplanation":["用法提醒：coincidental 常用來描述「事情/時間/相遇」的巧合；描述「人」時通常是指人的行為或安排看起來像巧合（例如：His visit was coincidental），而不是說一個人本身是“巧合的”。","常見搭配：purely coincidental（純屬巧合）、seem coincidental（看起來是巧合）、coincidental timing（巧合的時機/時間點）。","對比：coincidental（巧合的、偶然的）≠ ironical/ironic（諷刺的、出乎意料且帶有反差）。"]}
{"word":"coincidentally","summary":{"en":"“Coincidentally” means “by chance,” used when something happens in an unplanned but surprising way at the same time or in the same context.","zh":"“Coincidentally”表示“巧合地/碰巧地”，用于描述事情在没有计划的情况下同时或在同一情境中发生。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"By chance; happening at the same time or in the same situation without being planned.","zh":"巧合地；碰巧地（在没有事先计划的情况下，同时或在同一情境中发生）。"},"examples":[{"en":"Coincidentally, we both arrived at the station at exactly 8:00.","zh":"真巧，我们俩都在8点整到达了车站。"},{"en":"I was just thinking about her, and coincidentally she called me.","zh":"我正想着她，巧的是她就打电话来了。"},{"en":"Coincidentally, that book you recommended was already on my reading list.","zh":"真巧，你推荐的那本书本来就已经在我的阅读清单里了。"}]}],"synonyms":["by chance","unexpectedly","happenstance","as it happens"],"phonetic":"/koʊˌɪn.sɪˈdɛn.t̬əl.i/","extraExplanation":["“Coincidentally”常用于句首作插入语（Coincidentally, ...），语气偏中性，表达“巧合”而不强烈暗示“命中注定”。若想表达更强的“冥冥之中/注定”，英语里更常用“fate/fateful”等词（但语气更重）。","与“accidentally”不同：accidentally 强调“意外/不小心造成”，常带“失误”或“非故意”的意思；coincidentally 只强调“巧合同时发生”，不一定是错误或事故。"]}
{"word":"coincidently","summary":{"en":"Coincidentally means “by chance” (most common) or “at the same time” (less common). The common spelling is coincidentally.","zh":"Coincidentally 常表示“巧合地/碰巧”（最常见），也可表示“同时地”（较少见）。常见标准拼写为 coincidentally。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Commonly spelled: coincidentally) By chance; unexpectedly, in a way that seems surprising.","zh":"（常见拼写：coincidentally）巧合地；出乎意料地（带有“真巧”的语气）。"},"examples":[{"en":"Coincidentally, we were on the same flight to Seattle.","zh":"真巧，我们坐的是同一班去西雅图的飞机。"},{"en":"I was just thinking about you, and coincidentally you called.","zh":"我刚想到你，你就打电话来了，真是巧。"}]},{"partOfSpeech":"adv.","definition":{"en":"At the same time; simultaneously (a less common use in everyday conversation).","zh":"同时地；在同一时间发生地（口语中较少用）。"},"examples":[{"en":"Two events happened coincidentally on the same afternoon.","zh":"两件事在同一个下午同时发生。"},{"en":"The lights went out and the alarm rang coincidentally.","zh":"灯同时熄灭，警报也同时响了。"}]}],"synonyms":["by chance","unexpectedly","accidentally","as it happens","fortuitously"],"phonetic":"/koʊˌɪn.səˈdɛn.t̬əl.i/","extraExplanation":["“coincidently”通常被视为拼写错误；标准拼写是“coincidentally”。写作（邮件、作业、简历）中建议使用标准拼写。","“coincidentally”常用来引出一种“真巧”的信息，语气比“by chance”更像在强调巧合；如果只是客观描述，可以用“by chance / accidentally”。"]}
{"word":"coincidents","summary":{"en":"A coincidence is a surprising situation where events happen at the same time without a direct connection.","zh":"coincidence 指“巧合”：事件同时发生且看似意外，但没有直接联系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually plural: coincidences) A situation in which two or more events happen at the same time in a surprising way, without one causing the other.","zh":"（常用复数：coincidences）巧合：两件或多件事情在同一时间发生，看起来很意外，但彼此并无因果关系。"},"examples":[{"en":"It was a coincidence that we both wore the same jacket to school.","zh":"我们俩上学都穿了同一件外套，这真是巧合。"},{"en":"By coincidence, I ran into my old teacher at the airport.","zh":"真巧，我在机场碰到了以前的老师。"},{"en":"Some people believe there are no coincidences, but scientists often say chance plays a role.","zh":"有些人相信世上没有巧合，但科学家常说偶然性也会起作用。"}]}],"synonyms":["chance","accident","fluke","happenstance"],"phonetic":"/koʊˈɪnsɪdəns/","extraExplanation":["你输入的 **coincidents** 在现代英语里不常见。大多数情况下，你想表达的是 **coincidences**（coincidence 的复数，“巧合”）。\n\n**coincident** 才是常见的形容词，意思是“同时发生的；一致的”。例如：*coincident events*（同时发生的事件）。"]}
{"word":"coincider","summary":{"en":"“Coincider” is a rare noun meaning something that coincides (happens at the same time or matches closely). Most people use “coincide” or “coincidence” instead.","zh":"“coincider”是很少见的名词，指“同时发生或相符的事物”。更常用的是动词“coincide”或名词“coincidence”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A person or thing that coincides with another—happening at the same time, in the same place, or matching closely.","zh":"（罕见用法）与另一事物“同时发生、同处出现或高度吻合”的人或事物。"},"examples":[{"en":"In the report, the flu outbreak and the school closure were treated as coinciders.","zh":"在报告中，流感爆发和学校停课被视为“同时发生的事件”。"},{"en":"The researcher looked for coinciders between stress levels and sleep problems.","zh":"研究人员寻找压力水平与睡眠问题之间的“同步现象/相伴出现的因素”。"}]}],"synonyms":["simultaneous event","match","correspondent"],"phonetic":"/ˌkoʊɪnˈsaɪdər/","extraExplanation":["“coincider”在现代英语中非常少见，日常写作与考试里通常不用。你更可能想表达：\n1）动词 coincide /ˌkoʊɪnˈsaɪd/（同时发生；一致；相符）：e.g., The meeting coincides with my exam.\n2）名词 coincidence（巧合；同时发生）：e.g., What a coincidence!\n如果你是在写作或正式表达，建议用 coincide / coincidence，读者更容易理解。"]}
{"word":"coincides","summary":{"en":"“Coincides” means “happens at the same time” or “matches/agree,” usually used with “with.”","zh":"coincides 表示“同时发生”或“相符/一致”，常与 with 连用。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to happen at the same time as something else; to occur together","zh":"（事件）同时发生；与……在同一时间出现"},"examples":[{"en":"The concert coincides with the school holiday.","zh":"音乐会正好碰上学校假期。"},{"en":"Her birthday coincides with a major festival this year.","zh":"今年她的生日刚好和一个重要节日重合。"}]},{"partOfSpeech":"v.","definition":{"en":"to match or be the same in some way; to agree (with)","zh":"（想法、结果等）一致；相符；符合"},"examples":[{"en":"His story doesn’t coincide with the evidence.","zh":"他的说法与证据不一致。"},{"en":"Their opinions coincide on this point.","zh":"他们在这一点上的看法一致。"}]}],"synonyms":["happen at the same time","occur together","overlap","match","correspond","agree"],"phonetic":"/ˌkoʊɪnˈsaɪdz/","extraExplanation":["常见搭配：coincide with（与……同时发生/与……一致）；coincide in（在……方面一致）。","语气上，coincide 常用于较正式的书面或新闻语境；日常口语也可以用 happen at the same time 或 match/agree 来替换。","注意：coincide 本身通常不用于“人”作直接宾语（不说 *coincide someone*），多用不及物结构：A coincides with B。"]}
{"word":"coinciding","summary":{"en":"“Coinciding” means happening at the same time (most common) or overlapping exactly in position.","zh":"“coinciding”主要表示“同时发生/恰逢”，也可指“位置上重合/重叠”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening at the same time; occurring simultaneously.","zh":"同时发生的；在同一时间出现的。"},"examples":[{"en":"The festival is coinciding with the school holiday this year.","zh":"今年的节日正好与学校假期同时发生。"},{"en":"Her visit is coinciding with a busy week at work.","zh":"她的来访恰逢我工作最忙的一周。"}]},{"partOfSpeech":"adj.","definition":{"en":"Matching exactly in position or direction; overlapping.","zh":"（位置或方向）完全重合的；重叠的。"},"examples":[{"en":"Draw two coinciding circles on the page.","zh":"在纸上画两个完全重合的圆。"}]}],"synonyms":["simultaneous","concurrent","co-occurring","overlapping"],"phonetic":"/ˌkoʊ.ənˈsaɪ.dɪŋ/","extraExplanation":["“coinciding”来自动词“coincide”。在日常英语里，它最常用来表达“时间上刚好碰到/同时发生”，语气比“happen at the same time”更正式一些。","常见搭配：be coinciding with（与……同时发生/相 совп），例如：The meeting is coinciding with my flight.（会议和我的航班时间撞了。）"]}
{"word":"coinclination","summary":{"en":"“Coinclination” is a rare/nonstandard word meaning a shared inclination or common tendency.","zh":"“coinclination”较罕见/不太标准，意思是“共同的倾向或共有的偏好”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare or nonstandard) A shared inclination; a tendency that two or more people/things have in common.","zh":"（罕见或非标准用法）共同的倾向；两个人或多个人/事物共有的爱好或倾向。"},"examples":[{"en":"They discovered a coinclination toward quiet weekends and long hikes.","zh":"他们发现彼此都倾向于安静的周末和长途徒步。"},{"en":"A coinclination for teamwork helped the group succeed.","zh":"大家对团队合作的共同倾向帮助小组取得了成功。"}]}],"synonyms":["shared inclination","common inclination","mutual interest","common preference"],"phonetic":"ˌkoʊˌɪnkləˈneɪʃən","extraExplanation":["“coinclination”在现代英语里非常少见，很多情况下会被认为是拼写或用词不地道。更常见的表达有：\n- shared inclination / common inclination（共同的倾向）\n- mutual interest（共同兴趣）\n- common preference（共同偏好）","如果你原本想表达“巧合”，更常用的词是 coincidence（巧合）；如果想表达“个人的倾向/意愿”，用 inclination（倾向）更自然。"]}
{"word":"coincline","summary":{"en":"“Coincline” is not standard; you probably mean “coincide”: to occur at the same time or to match/agree.","zh":"“coincline”不是标准词；你可能想写“coincide”：表示“同时发生/撞期”或“相符/一致”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Likely misspelling) The standard English word is “coincide,” meaning to happen at the same time or to match/agree with something.","zh":"（可能是拼写错误）标准英文词更可能是“coincide”，意思是“同时发生”或“与……一致/相符”。"},"examples":[{"en":"The meeting date coincides with my final exam, so I can’t attend.","zh":"会议日期和我的期末考试撞期了，所以我参加不了。"},{"en":"Her story doesn’t coincide with the facts.","zh":"她的说法与事实不一致。"},{"en":"The two lines coincide on this part of the graph.","zh":"在图像的这一段，两条线重合。"}]}],"synonyms":["happen at the same time","occur together","match","agree","correspond"],"phonetic":"/ˌkoʊɪnˈsaɪd/","extraExplanation":["“coincline”并不是常见或标准的英文单词。最常见的目标词是“coincide”。拼写提示：co-（一起）+ incide（落下/发生），重音在 -cide：co-in-CIDE。","“coincide”常见用法：\n1) coincide with + 时间/事件（“与……同时发生/撞期”）\n2) coincide with + 信息/观点/事实（“与……一致”）\n3) 在数学/几何里表示“重合”。"]}
{"word":"coinclude","summary":{"en":"A rare verb meaning “to include together.”","zh":"一个罕用动词，意思是“共同包括/一并纳入”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare) to include together; to include something within the same group, set, or statement as something else.","zh":"（罕用）共同包括；把某事物与另一事物一起纳入同一组、同一集合或同一表述中。"},"examples":[{"en":"The report coinc ludes transportation costs with housing expenses to show the total cost of living.","zh":"这份报告把交通成本与住房支出一起纳入统计，以展示总体生活成本。"},{"en":"Some definitions coin clude both formal and informal uses of the word.","zh":"有些释义会把该词的正式与非正式用法一并纳入。"}]}],"synonyms":["include","encompass","incorporate","cover"],"phonetic":"/ˌkoʊɪnˈkluːd/","extraExplanation":["“coinclude”在现代英语中非常少见，很多情况下人们想表达的是“include”或“encompass”；如果你想说“同时发生/一致”，常用词是“coincide”。","拼写上常见混淆：coinclude（共同纳入）≠ coincide（同时发生/相符）≠ include（包括）。写作时更建议用更常见、更自然的表达来避免读者困惑。"]}
{"word":"coincorporate","summary":{"en":"“Coincorporate” means to incorporate things together into one whole, especially in formal contexts.","zh":"“Coincorporate”指把多个事物共同纳入并合并成一个整体，常用于正式语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to incorporate or combine two or more things into one whole; to merge them within the same structure (often used in formal or legal writing).","zh":"把两个或多个事物一同纳入同一整体；在同一结构中合并（常见于正式或法律语境）。"},"examples":[{"en":"The new policy coincorporates several older rules into a single document.","zh":"新政策把几项旧规定一并纳入同一份文件。"},{"en":"The proposal would coincorporate the two departments under one management team.","zh":"该提案将把两个部门合并并纳入同一管理团队之下。"}]}],"synonyms":["incorporate","combine","merge","integrate","unify"],"phonetic":"/ˌkoʊɪnˈkɔrpəˌreɪt/","extraExplanation":["这个词相对少见，更常见的表达是 incorporate together / combine / merge，或用 co‑incorporate（带连字符）强调“共同纳入”。","词形上由前缀 co‑（“共同”）+ incorporate（“纳入、合并”）构成，因此语气偏正式、书面化。"]}
{"word":"coindicant","summary":{"en":"“Coindicant” is not standard; you likely mean “coincident,” meaning ‘happening at the same time’ or ‘overlapping exactly.’","zh":"“coindicant” 不是标准用法；你很可能想写 “coincident”，表示“同时发生”或“完全重合”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “coincident.”","zh":"不是标准英语单词；很可能是把 “coincident” 拼错了。"},"examples":[{"en":"I think you meant “coincident,” not “coindicant.”","zh":"我想你想写的是 “coincident”，不是 “coindicant”。"}]},{"partOfSpeech":"adj.","definition":{"en":"(coincident) happening at the same time; occurring together.","zh":"（coincident）同时发生的；同时出现的。"},"examples":[{"en":"The power outage was coincident with the storm.","zh":"停电与暴风雨同时发生。"},{"en":"Two coincident events can feel meaningful, even if they are random.","zh":"两个同时发生的事件可能让人觉得很有意义，即使它们只是巧合。"}]},{"partOfSpeech":"adj.","definition":{"en":"(coincident) (especially in math/geometry) lying exactly on top of each other; sharing the same position or line.","zh":"（coincident）（尤指数学/几何）重合的；完全处在同一位置/同一直线上的。"},"examples":[{"en":"In the diagram, the two lines are coincident.","zh":"在图中，这两条线是重合的。"},{"en":"The points are coincident, so they appear as one point.","zh":"这些点是重合的，所以看起来像一个点。"}]}],"synonyms":["simultaneous","concurrent","overlapping","coinciding"],"phonetic":"/koʊˈɪnsɪdənt/","extraExplanation":["“coincident” 来自拉丁语词根：co-（共同）+ incidere（落在/发生），核心概念是“同时发生”或“重合”。","常见搭配：be coincident with（与……同时发生/一致）；coincident events（同时发生的事件）。","容易混淆：coincidence（n. 巧合）；coincide（v. 同时发生/重合）。"]}
{"word":"coindicate","summary":{"en":"Coindicate means to indicate something jointly with other signs or evidence.","zh":"coindicate 指与其他迹象或证据一起“共同表明/共同指向”某个结论。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to indicate something together with something else; to point to the same conclusion jointly","zh":"与其他事物一起表明（指示）；共同指向同一结论"},"examples":[{"en":"High fever and a stiff neck may coindicate a serious infection.","zh":"高烧和颈部僵硬可能共同表明一次严重感染。"},{"en":"Several clues coindicated that the document was forged.","zh":"几个线索共同表明这份文件是伪造的。"}]}],"synonyms":["jointly indicate","indicate together","suggest together","converge on"],"phonetic":"/koʊˈɪndɪkeɪt/","extraExplanation":["“coindicate”在现代英语里很少见，更多出现在较正式或学术/医学语境中，意思接近“共同表明”。日常写作里更常用的表达是“indicate together / jointly indicate / suggest”.","注意不要和“contraindicate（禁忌，不宜使用/实施）”混淆：contra- 表示“相反、对立”，而 co- 表示“共同、一起”。"]}
{"word":"coindication","summary":{"en":"Coindication is a rare/nonstandard term, often a misspelling of “contraindication” (a reason not to use a treatment).","zh":"coindication 属少见/非标准用法，常是 contraindication（禁忌证：不宜使用某治疗的理由）的误拼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/nonstandard) a co‑indication; sometimes used as a misspelling of “contraindication.” In medical writing, it may be intended to mean a condition or factor that affects whether a treatment should be used (often meaning a reason NOT to use it).","zh":"（少见/非标准用法）“共同适应证/共同指征”；也常被当作“contraindication（禁忌证）”的误拼。在医学语境中，常指影响某种治疗是否应使用的因素（很多时候实际想表达的是“不宜使用”的理由）。"},"examples":[{"en":"The label lists severe liver disease as a coindication for this drug (often written as “contraindication”).","zh":"说明书把严重肝病列为该药的 coindication（更常见写法是 contraindication，意为“禁忌证”）。"},{"en":"If you mean a reason not to prescribe it, the standard term is “contraindication.”","zh":"如果你想表达“不开这种药的理由”，标准术语是 contraindication（禁忌证）。"}]}],"synonyms":["contraindication","indication"],"phonetic":"/ˌkoʊ.ɪn.dɪˈkeɪ.ʃən/","extraExplanation":["在临床英语里最常见的一对术语是：indication（适应证：建议使用的情况） vs. contraindication（禁忌证：不建议/禁止使用的情况）。“coindication”不是常规标准术语，正式写作中建议改用这两个更明确的词。"]}
{"word":"coindwelling","summary":{"en":"Coindwelling means mutual indwelling—existing within one another, especially in theology.","zh":"coindwelling 指“互相内住”：彼此在对方之内地同在，尤常用于神学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(theology, philosophy) the idea that two or more persons or realities exist “in” one another in a deep, mutual way (often used for the Trinity or for a close spiritual union).","zh":"（神学/哲学）“互相内住、相互寓居”的观念：两个或多个位格/实在以一种深层、相互的方式彼此“在……之内”（常用于讨论三位一体或亲密的灵性联合）。"},"examples":[{"en":"Some Christian writers use coindwelling to describe the relationship between the Father, Son, and Holy Spirit.","zh":"一些基督教作者用 coindwelling 来描述圣父、圣子与圣灵之间的关系。"},{"en":"In her journal, she spoke of a coindwelling with God that brought her peace.","zh":"她在日记里写到与上帝的“互相内住”，这种体验带给她平安。"}]},{"partOfSpeech":"adj.","definition":{"en":"sharing a space or existing together within the same “inner” reality; mutually indwelling (rare).","zh":"共同居于（同一内在空间/现实之中）；彼此内住的（较少见用法）。"},"examples":[{"en":"The poem imagines two coindwelling voices inside one mind.","zh":"这首诗想象同一个心灵里有两种彼此内住的声音。"}]}],"synonyms":["mutual indwelling","shared indwelling","interpenetration","perichoresis"],"phonetic":"/ˌkoʊɪnˈdwɛlɪŋ/","extraExplanation":["这个词在现代英语里非常少见，更多出现在神学语境。它常与 perichoresis（“互渗/互含”，用来解释三位一体中彼此内在而又不混同）相关。","拆开看：co- 表示“共同、相互”，indwelling 表示“内住、寓居于内”。因此它的核心含义是“不是并排住在一起，而是彼此在对方之内的亲密同在”。","如果你在学术或宗教写作中使用，读者未必熟悉这个词；可以在首次出现时加括号解释，或改用更常见的表达：mutual indwelling / shared indwelling。"]}
{"word":"coined","summary":{"en":"“Coigned” most often means “created a new term/phrase,” and it can also mean “minted into coins” or describe something “newly invented.”","zh":"“coined”最常指“创造了新词/新说法”，也可指“铸造成硬币”，或作形容词表示“新造的”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"past tense / past participle of “coin”: to create (a new word, phrase, or idea), often so it becomes widely used.","zh":"“coin”的过去式/过去分词：创造（新词、新短语或新说法），并使其被广泛使用。"},"examples":[{"en":"She coined the term “digital detox.”","zh":"她创造了“数字排毒”这个说法。"},{"en":"The phrase was coined in the 1990s and quickly spread online.","zh":"这个短语在20世纪90年代被创造出来，并很快在网上传播。"}]},{"partOfSpeech":"vt.","definition":{"en":"past tense / past participle of “coin”: to make money into coins by minting it (usually used in formal or historical contexts).","zh":"“coin”的过去式/过去分词：把（金属）铸造成硬币（多用于正式或历史语境）。"},"examples":[{"en":"The mint coined millions of silver pieces for trade.","zh":"铸币厂铸造了数百万枚银币用于贸易。"},{"en":"In ancient times, rulers coined money to show their authority.","zh":"在古代，统治者铸币以显示权威。"}]},{"partOfSpeech":"adj.","definition":{"en":"newly invented; newly created (especially of a word or phrase).","zh":"新造的；新创造的（尤指词语或说法）。"},"examples":[{"en":"This is a newly coined expression.","zh":"这是一个新造的说法。"},{"en":"The article uses several coined words that may confuse beginners.","zh":"这篇文章用了几个自造词，可能会让初学者困惑。"}]}],"synonyms":["invented","created","made up","minted","newly created"],"phonetic":"/kɔɪnd/","extraExplanation":["“coin”除了“铸币”，在现代更常见的引申义是“创造新词/新说法”。因此你会常看到：coin a term（创造术语）、newly coined（新造的）。","常见搭配：coined phrase（新造短语）、coined word（自造词）、coined expression（新说法）。语域上偏书面或正式。"]}
{"word":"coiner","summary":{"en":"A coiner is someone who creates a new word/phrase, or someone who makes coins.","zh":"coiner 指新词/新说法的创造者，也可指铸币者（造币的人或机构）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who invents or first uses a new word or phrase (a neologism)","zh":"（新词或新说法的）创造者；首创者"},"examples":[{"en":"Shakespeare is often called a coiner of many English words.","zh":"莎士比亚常被称为许多英语词汇的创造者。"},{"en":"The coiner of the term explained why it was needed.","zh":"这个术语的创造者解释了为什么需要它。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or organization that makes coins; a mint worker","zh":"铸币者；铸币机构（或造币厂工作人员）"},"examples":[{"en":"In ancient times, the coiner stamped a ruler’s image onto metal discs.","zh":"在古代，铸币者会把统治者的形象压印在金属圆片上。"},{"en":"Counterfeiters tried to imitate official coiners.","zh":"伪造者试图模仿官方铸币者。"}]}],"synonyms":["inventor (of a term)","originator","creator","mint worker"],"phonetic":"/ˈkɔɪnɚ/","extraExplanation":["“coiner”来自动词“coin”，本义与“铸造硬币”有关；后来引申为“创造（新词/新说法）”，因为“造出一个新词”在比喻上像“铸出一枚新币”。","学习搭配：coin a term（创造术语）、coin a phrase（创造说法）；在语言学讨论里也常见“neologism（新词）”和“neologize（造新词）”。"]}
{"word":"coiners","summary":{"en":"“Coiners” can mean people who produce coins, people who invent new words/terms, or (less commonly) people who counterfeit coins.","zh":"“coiners”可指铸币者、造词/提出术语的人，也可（较少见）指伪造硬币的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who make coins or produce coins (usually for a government mint)","zh":"铸币者；造币者（通常指在官方造币厂铸造硬币的人或机构）"},"examples":[{"en":"The mint hired skilled coiners to produce the new quarter.","zh":"造币厂雇用了熟练的铸币者来生产新的25美分硬币。"},{"en":"Historically, coiners needed careful training to ensure each coin had the correct weight.","zh":"在历史上，铸币者需要经过严格训练，以确保每枚硬币重量准确。"}]},{"partOfSpeech":"n.","definition":{"en":"people who invent new words, phrases, names, or ideas (often used in the phrase “coin a term”)","zh":"新词/新说法的创造者；首创者（常见搭配：coin a term “创造一个术语”）"},"examples":[{"en":"Social media is full of coiners who create catchy slang.","zh":"社交媒体上有很多“造词者”，不断创造朗朗上口的俚语。"},{"en":"The coiners of the term tried to make the idea easier to discuss.","zh":"这个术语的创造者试图让这个概念更容易被讨论。"}]},{"partOfSpeech":"n.","definition":{"en":"people who make counterfeit coins (less common in modern use)","zh":"伪造硬币的人（现代用法中较少见）"},"examples":[{"en":"The police arrested several coiners for producing fake coins.","zh":"警方逮捕了几名伪造硬币的人，他们制作假硬币。"}]}],"synonyms":["minters","wordsmiths","neologists","inventors","counterfeiters"],"phonetic":"/ˈkɔɪnɚ/","extraExplanation":["“coiner”来自动词 coin，本义是“铸造（硬币）”。因为“把金属铸成新硬币”带有“从无到有制造新东西”的感觉，coin 也引申出“创造新词/新说法”（coin a word/phrase/term）。","在现代语境里，谈语言创新时常说“the coiner of the term（术语的提出者）”。而说铸币工作时更常见的是 mint worker / mint official，不过 coiner 仍可用。"]}
{"word":"coinfection","summary":{"en":"Coinfection means being infected with two or more pathogens at the same time.","zh":"Coinfection 指同時感染兩種或以上病原體（共同感染）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An infection in which a person or animal is infected with two or more pathogens (such as viruses, bacteria, or parasites) at the same time.","zh":"（同時）感染兩種或以上病原體（如病毒、細菌或寄生蟲）的情況。"},"examples":[{"en":"The doctor tested for flu and COVID-19 because coinfection can happen.","zh":"醫生同時檢測流感和新冠，因為可能出現共同感染。"},{"en":"Coinfection may make symptoms worse or harder to diagnose.","zh":"共同感染可能讓症狀更嚴重，或更難診斷。"}]},{"partOfSpeech":"n.","definition":{"en":"In ecology and veterinary/medical writing, the state of a host carrying multiple infectious agents at once.","zh":"（常見於醫學／獸醫與生態學寫作）宿主同時帶有多種感染性病原的狀態。"},"examples":[{"en":"Researchers tracked coinfection rates in wild birds.","zh":"研究人員追蹤野鳥的共同感染率。"},{"en":"Tick-borne coinfection can involve more than one germ transmitted by the same tick.","zh":"蜱媒共同感染可能包含同一隻蜱同時傳播的多種病原。"}]}],"synonyms":["co-infection","mixed infection","dual infection"],"phonetic":"/ˌkoʊ.ɪnˈfɛk.ʃən/","extraExplanation":["字面結構：co-（共同、一起）+ infection（感染）。因此 coinfection 強調「同一時間」有多種感染；而 sequential infection 則是先後感染、時間上分開。","常見搭配：coinfection with A and B / A–B coinfection（例如 flu–COVID coinfection）；也常搭配 rate（比例）、risk（風險）、diagnosis（診斷）、treatment（治療）。","語感提醒：在一般口語中人們更常說 “having both X and Y” 或 “infected with X and Y at the same time”。coinfection 更偏醫學／學術用語。"]}
{"word":"coinfeftment","summary":{"en":"A rare, historical Scots law term for a legal grant of joint title/possession of property (often to spouses).","zh":"罕见的历史苏格兰法律术语，指将财产（常见为土地）共同产权/占有权授予两人或多人的法律授予或文书。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scots law, historical) A joint infeftment: a legal act or document granting two or more people (often spouses) joint possession/title of land or property.","zh":"（苏格兰法律，历史用语）共同授封/共同占有的法律行为或文书：将土地或财产的占有权/产权共同授予两人或多人（常见于夫妻）。"},"examples":[{"en":"In older Scots records, a husband and wife might receive a coinfeftment of the family lands.","zh":"在较早的苏格兰档案中，夫妻可能会获得家族土地的共同授封（coinfeftment）。"},{"en":"The lawyer explained that coinfeftment was an outdated way to record joint ownership.","zh":"律师解释说，coinfeftment 是一种记录共同所有权的旧式做法。"}]}],"synonyms":["joint infeftment","joint title","joint ownership"],"phonetic":"/ˌkɔɪnˈfɛftmənt/","extraExplanation":["这是非常少见的历史法律词，主要见于苏格兰的不动产制度。词中含有 feft / infeftment（授封、就地产权“入占”）这一组旧法术语，现代语境通常改用 joint ownership / joint title / joint tenancy 等更常见表达。","不同资料对拼写可能略有差异（如 coinfeftment / co-infeftment）。若你是在某份古籍、契约或家谱材料里看到它，通常与“夫妻或多人共同取得土地权利”的登记方式有关。"]}
{"word":"coinfer","summary":{"en":"Coinfer means to infer something together or to reach a conclusion jointly (a rare word; often written as co-infer).","zh":"coinfer 指“共同推断/一起得出结论”（较少见，常写作 co-infer）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare) To infer or conclude something together with someone else, or to infer something jointly from the same evidence.","zh":"（较少见）与他人一起推断/得出结论；或基于同一证据共同推断出某事。"},"examples":[{"en":"From the data, the two researchers coinferred that the drug was effective.","zh":"根据这些数据，两位研究人员共同推断该药物有效。"},{"en":"We can coinfer his intent from his words and actions.","zh":"我们可以从他的言行共同推断出他的意图。"}]}],"synonyms":["jointly infer","infer together","draw the same conclusion","conclude jointly"],"phonetic":"/koʊɪnˈfɝ/","extraExplanation":["“coinfer”在现代英语里非常少见，更常写成“co-infer”（带连字符），强调“共同/一起”推断。日常写作中更自然的表达通常是“infer together”“jointly infer”或“draw the same conclusion”。","构词上，前缀“co-”表示“共同、一起”（如 cooperate 合作），加上“infer”（推断）形成“co-infer/coinfer”。"]}
{"word":"coinferred","summary":{"en":"Coinferred means “jointly inferred” (inferred together with something else), mainly used in academic/technical writing.","zh":"coinferred 指“联合推断出的/一起推断出的”，主要用于学术与技术写作。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(usually academic/technical) inferred together with something else, based on shared data or reasoning; jointly inferred.","zh":"（多用于学术/技术语境）与其他事物一起被推断出的；基于共同数据或推理而“联合推断”的。"},"examples":[{"en":"The model’s hidden states were coinferred from the same sensor readings.","zh":"模型的隐藏状态是根据同一组传感器读数联合推断出来的。"},{"en":"These parameters are coinferred rather than estimated separately.","zh":"这些参数是联合推断出来的，而不是分别估计的。"},{"en":"In the paper, the causal structure and the confounders are coinferred.","zh":"在这篇论文中，因果结构和混杂因素是一起被推断出来的。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of co-infer: to infer two or more things together from the same evidence.","zh":"co-infer 的过去式/过去分词：从同一证据同时推断出两件或多件事。"},"examples":[{"en":"The researchers coinferred the network and its community labels from the dataset.","zh":"研究人员从该数据集中同时推断出了网络结构及其社区标签。"},{"en":"We coinferred both the topic and the author’s stance using one classifier.","zh":"我们用一个分类器同时推断出了主题和作者立场。"}]}],"synonyms":["jointly inferred","inferred together","inferred jointly","co-estimated (close in meaning in some contexts)"],"phonetic":"/ˌkoʊ ɪnˈfɝd/","extraExplanation":["“coinferred”常写作“co-inferred”（加连字符更常见），多见于机器学习、统计、因果推断、计算语言学等领域，用来强调“不是先后分开推断，而是共同建模、共同推出”。","它不是日常英语高频词；在一般写作中可用“jointly inferred / inferred jointly / inferred together”替换以更易懂。"]}
{"word":"coinferring","summary":{"en":"Coinferring is a rare form meaning “inferring together” or making shared/parallel inferences.","zh":"coinferring是较少见的用法，意思是“共同推断”或“并行作出推断”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(rare) Inferring or concluding something together with someone else; making a shared inference.","zh":"（罕见）与他人一起推断/共同得出结论；共同推理。"},"examples":[{"en":"From the clues in the text, the students were coinferring the author’s message.","zh":"根据文章里的线索，学生们正在共同推断作者想表达的意思。"},{"en":"In the meeting, we kept coinferring what the client really needed.","zh":"在会议中，我们不断一起推断客户真正需要什么。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare, technical) Drawing an inference in parallel with another inference (for example, in logic or data analysis).","zh":"（罕见，偏技术）与另一条推断并行地得出推断（例如在逻辑或数据分析中）。"},"examples":[{"en":"The model is coinferring user intent and topic at the same time.","zh":"该模型在同时并行推断用户意图和话题。"}]}],"synonyms":["inferring together","making a joint inference","jointly inferring","co-inferencing"],"phonetic":"/ˌkoʊ ɪnˈfɝɪŋ/","extraExplanation":["“coinferring”在标准英语中非常少见，很多情况下可能是把“conferring（商议/授予）”或“inferring（推断）”拼错了。","如果你的意思是“商议/讨论”，更常用的是“conferring”；如果是“推断”，用“inferring”；若强调“共同推断”，更自然的说法通常是“inferring together”或“making a joint inference”。"]}
{"word":"coinfers","summary":{"en":"Conifer: a cone-bearing tree/plant like a pine or fir, often evergreen.","zh":"Conifer：针叶树/针叶植物，如松树或冷杉，常为常绿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of tree or plant that produces cones (not flowers) and usually stays green all year, such as pine or fir","zh":"一种会结球果（不靠开花结果）、通常四季常青的树或植物，如松树、冷杉等"},"examples":[{"en":"Pine trees are conifers, so they produce cones.","zh":"松树属于针叶树，所以会结松果（球果）。"},{"en":"Conifers are common in cold or mountainous areas.","zh":"针叶树在寒冷或多山地区很常见。"},{"en":"We decorated a small conifer as a Christmas tree.","zh":"我们把一棵小针叶树装饰成圣诞树。"}]}],"synonyms":["cone-bearing tree","evergreen (often, but not always)"],"phonetic":"/ˈkɑnɪfɚ/","extraExplanation":["你输入的“coinfers”很可能是拼写错误，常见目标词是“conifers”（针叶树，复数）。单数形式是“conifer”。","词源提示：conifer 来自拉丁语，含义是“bearing cones（结球果的）”。在日常语境里常与 pine（松树）、fir（冷杉）、spruce（云杉）、cedar（雪松）一起出现。"]}
{"word":"coinfinite","summary":{"en":"Coinfinite means a set has an infinite complement (in a given universal set).","zh":"coinfinite 表示（相对于某个全集）一个集合的补集是无限的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Mathematics) Describing a set whose complement (within a given universal set) is infinite; not “almost everything.”","zh":"（数学）指一个集合在某个给定的全集中，其补集是无限的；也就是它并非“只缺少有限多个元素”的那种集合。"},"examples":[{"en":"In the set of all natural numbers, the set of even numbers is coinfinite because the odd numbers are infinite.","zh":"在自然数全集中，偶数集合是 coinfinite（余无限的），因为奇数集合是无限的。"},{"en":"A coinfinite subset of N is neither finite nor does it leave only finitely many elements out.","zh":"N 的一个 coinfinite 子集既不是有限集，也不会只漏掉有限多个元素。"}]}],"synonyms":["co-infinite"],"phonetic":"/ˌkoʊˈɪnfənɪt/","extraExplanation":["“coinfinite”常写作“co-infinite”（带连字符），在集合论里与“cofinite（余有限）”相对：\n- cofinite：补集是有限的（等于“几乎包含了所有元素”）。\n- coinfinite：补集是无限的。\n使用时通常要先说明“相对于哪个全集（universal set）”。"]}
{"word":"coinfinity","summary":{"en":"Coinfinity is a made-up name combining “coin” and “infinity,” often used as a brand name, especially in crypto/fintech, to suggest “endless coins/value/possibilities.”","zh":"Coinfinity 是由“coin”和“infinity”拼成的自造名称，常作品牌名（尤其在加密/金融科技领域），表达“无限的币/价值/可能性”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A coined name (often used as a brand or project title) combining “coin” and “infinity,” suggesting unlimited coins, endless value, or long-term growth—commonly associated with cryptocurrency or fintech contexts.","zh":"一个自造名称（常见于品牌或项目名），由“coin（硬币/币）”和“infinity（无限）”组合而成，传达“无限的币/价值/增长”的含义，常与加密货币或金融科技语境相关。"},"examples":[{"en":"Coinfinity is launching a new wallet app for beginners.","zh":"Coinfinity 正在为初学者推出一款新的钱包应用。"},{"en":"The name “Coinfinity” is meant to suggest endless possibilities in digital money.","zh":"“Coinfinity” 这个名字意在表达数字货币的无限可能。"}]}],"synonyms":["coined name","brand name","portmanteau"],"phonetic":"/kɔɪnˈɪnfənəti/","extraExplanation":["“Coinfinity”不是传统词典里的常用词，更像是“coin + infinity”的拼成词（portmanteau），常用于品牌命名来传达“规模很大、潜力无限、长期增长”等积极联想。","在真实使用中，它可能指某一家公司的名称、一个加密项目、社区或产品；具体含义通常要看它出现的网页、应用或新闻语境。"]}
{"word":"coing","summary":{"en":"“Coin” means a piece of metal money, or (as a verb) to invent a new word/phrase or to make coins.","zh":"“coin”指“硬币”；作动词可指“创造新词/短语（造词）”，也可指“铸造硬币”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, flat piece of metal used as money","zh":"硬币；金属货币"},"examples":[{"en":"I found a coin on the sidewalk.","zh":"我在人行道上捡到一枚硬币。"},{"en":"Do you have any coins for the parking meter?","zh":"你有投停车计时器的硬币吗？"}]},{"partOfSpeech":"vt.","definition":{"en":"to invent a new word or phrase; to create a new term","zh":"创造（新词/短语）；造词"},"examples":[{"en":"The writer coined a new phrase that became popular online.","zh":"那位作家造了一个新短语，后来在网上火了。"},{"en":"The term “software” was coined in the 1950s.","zh":"“software（软件）”这个术语是在20世纪50年代创造出来的。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make coins by stamping metal (often used in formal or historical contexts)","zh":"铸造硬币（多用于正式或历史语境）"},"examples":[{"en":"In ancient times, the king ordered gold coins to be coined.","zh":"在古代，国王下令铸造金币。"}]}],"synonyms":["money (general)","create (a term)","invent","mint (coins)"],"phonetic":"/kɔɪn/","extraExplanation":["“coing”不是标准英文单词，最常见是把“coin”拼错了，或想写“coining”（造词/铸币的进行式或动名词）。如果你告诉我句子语境，我也可以帮你判断正确拼写。"]}
{"word":"coinhabit","summary":{"en":"Cohabit means to live together, especially as an unmarried couple; more generally, it can mean sharing the same living space or habitat.","zh":"cohabit 指共同居住，尤其指未婚伴侣同居；广义上也可指共享同一生活空间或栖息地。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to live together in the same home, especially as a couple without being married","zh":"（尤指未婚伴侣）同居；共同生活在同一住所"},"examples":[{"en":"They decided to cohabit before getting married.","zh":"他们决定先同居，再结婚。"},{"en":"In some cultures, cohabiting is common; in others, it is still controversial.","zh":"在一些文化中，同居很常见；在另一些文化中仍然有争议。"}]},{"partOfSpeech":"vi.","definition":{"en":"to live together in the same place (formal/biological use: animals living in the same habitat)","zh":"（较正式/生物学用法）共栖；在同一环境中共同生活"},"examples":[{"en":"Different species can cohabit in the same ecosystem.","zh":"不同物种可以在同一生态系统中共栖。"}]}],"synonyms":["live together","share a home","coexist"],"phonetic":"/koʊˈhæbɪt/","extraExplanation":["“coinhabit”一般不是标准英语拼写，常见正确形式是“cohabit”。“co-”表示“共同、一起”，所以词义核心是“一起居住”。","语体提示：在日常语境中谈恋爱关系时，“live together”更口语、更中性；“cohabit”更正式，常见于新闻、法律或学术写作。"]}
{"word":"coinhabitant","summary":{"en":"A coinhibitant is someone who lives in the same place as another person—a fellow resident.","zh":"coinhabitant 指与他人同住或同地居住的人，即“同住者/同地居民”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who lives in the same place (house, town, region, etc.) as another person; a fellow resident","zh":"与他人同住或同地居住的人；同住者；同地居民"},"examples":[{"en":"In the old boardinghouse, his coinhibitant was a retired sailor who told stories at dinner.","zh":"在那间老寄宿公寓里，他的同住者是一位退休水手，晚餐时总爱讲故事。"},{"en":"The festival brought coinhibitant families together in the main square.","zh":"节日让同地居民的家庭在主广场聚在一起。"}]}],"synonyms":["co-inhabitant","fellow resident","housemate","roommate"],"phonetic":"/koʊ ɪnˈhæbɪtənt/","extraExplanation":["“coinhabitant”较少见，更常见的写法是“co-inhabitant”或用更普通的词如“roommate（室友）”“housemate（同住者）”“fellow resident（同地居民）”。它通常用于较正式、法律或文学语境，强调“共同居住/同一地区居住”的关系，而不一定是朋友关系。"]}
{"word":"coinhabitor","summary":{"en":"A coinhabitor is someone who lives with another person, often a romantic partner.","zh":"coinhabitor 指与他人同住的人，常指同居伴侣。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who lives together with another person in the same home, especially a romantic partner; a cohabiting partner.","zh":"同居者；（尤指恋爱关系中的）同居伴侣。"},"examples":[{"en":"He introduced her to his friends as his coinhabitor.","zh":"他把她介绍给朋友，说她是他的同居伴侣。"},{"en":"Some forms ask whether you live with a spouse, partner, or coinhabitor.","zh":"有些表格会询问你是否与配偶、伴侣或同居者同住。"}]}],"synonyms":["cohabitant","cohabiter","live-in partner","housemate"],"phonetic":"/ˌkoʊɪnˈhæbɪtɚ/","extraExplanation":["“coinhabitor”不是常见词，更常用的是“cohabitant / cohabiter”（同居者）。它由前缀“co-（共同）”+“inhabit（居住）”构成，字面意思是“共同居住的人”。","在法律或正式文本中，表达“同居伴侣”时也常见“cohabiting partner”或“domestic partner”（具体含义因地区法律不同而不同）。"]}
{"word":"coinhere","summary":{"en":"“coinhere” isn’t a standard word; you probably want “cohere” or the phrase “coin here.”","zh":"“coinhere”不是标准词；你可能想写“cohere”或短语“coin here”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a typo for “cohere” (to stick together or make sense as a whole).","zh":"不是标准英文单词。很可能是把“cohere”（黏在一起；前后一致、成整体）拼错了。"},"examples":[{"en":"Your paragraph should cohere, with each sentence connected to the main idea.","zh":"你的段落应该前后一致，每句话都要围绕主旨。"},{"en":"The story doesn’t cohere because the timeline keeps changing.","zh":"这个故事不连贯，因为时间线一直在变。"}]},{"partOfSpeech":"phrase","definition":{"en":"If you meant “coin here” (two words), it can be an instruction meaning “put a coin here.”","zh":"如果你想写的是分开的“coin here”（两个词），它可以是指令，意思是“把硬币放在这里”。"},"examples":[{"en":"Coin here to start the machine.","zh":"在这里投币以启动机器。"},{"en":"Please place the coin here and press the button.","zh":"请把硬币放在这里，然后按按钮。"}]}],"synonyms":["cohere","stick together","hold together","make sense","be consistent"],"phonetic":"/ˌkɔɪnˈhɪr/","extraExplanation":["“cohere”常用于写作与论证：强调段落/观点之间有逻辑连接（coherence）。在日常口语里也可以形容计划或故事“讲得通”。"]}
{"word":"coinhered","summary":{"en":"Coinhere (past: coinhered) means to exist together in the same thing, closely and inseparably linked, often in philosophical writing.","zh":"Coinhere（过去式：coinhered）指两者在同一事物中共同存在并不可分割地联系在一起，常见于哲学写作。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(often in philosophy) to exist together in the same thing; to be closely and inseparably connected.","zh":"（常用于哲学语境）共同存在于同一事物之中；紧密且不可分割地关联在一起。"},"examples":[{"en":"In many accounts of personhood, rights and responsibilities coinhere.","zh":"在许多关于“人格”的论述中，权利与责任是共存并紧密相连的。"},{"en":"For the poet, beauty and sadness coinhere in the same image.","zh":"对诗人来说，美与忧伤在同一意象中共存。"}]}],"synonyms":["coexist","be intertwined","be inseparable","inhere together"],"phonetic":"/ˌkoʊ.ɪnˈhɪr/","extraExplanation":["你输入的“coinhered”通常是动词“coinhere / co-inhere”的过去式或过去分词（coinhered）。这个词很少见，多出现在哲学、神学或文学评论里，用来强调两种性质或概念“在同一对象中不可分地并存”。","词源上可理解为 co-（共同）+ inhere（内在于、固有于）。因此它比 coexist（共存）更强调“内在绑定、不可拆分”的关系。","拼写上常见两种：coinhere 和 co-inhere；含义基本相同。"]}
{"word":"coinherence","summary":{"en":"Coinherence is a formal theological noun meaning “mutual indwelling,” especially in discussions of the Trinity or Christ’s natures.","zh":"Coinherence 是一个正式的神学名词，意为“相互内在/互相内住”，常用于讨论三位一体或基督的神人二性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Theology, formal) mutual indwelling or interpenetration—when two or more realities exist “in” each other without losing their distinctness (often used for the persons of the Trinity, or the divine and human natures in Christ).","zh":"（神学，正式用语）相互内在／相互贯通——指两个或多个实体彼此“内住”而又不失各自区别（常用于三位一体的位格关系，或基督神人二性的关系）。"},"examples":[{"en":"Some theologians use coinherence to describe how the Father, Son, and Holy Spirit share one divine life.","zh":"一些神学家用 coinherence 来描述圣父、圣子、圣灵如何共享同一神性生命。"},{"en":"The term helps explain unity without collapse: distinct persons, yet complete coinherence.","zh":"这个术语有助于说明“合一而不混同”：位格有别，却完全相互内在。"}]}],"synonyms":["mutual indwelling","interpenetration","perichoresis (near equivalent)"],"phonetic":"/ˌkoʊɪnˈhɪrəns/","extraExplanation":["这个词在日常英语里非常少见，主要出现在基督教神学写作中。它常与希腊词 perichoresis（互渗／共融、互相内住）相关，用来表达“彼此进入对方之内，但不变成同一个东西”的关系。","拼写上可理解为 co-（共同）+ inherence（内在、固有性），强调“共同的内在性/互为内在”。"]}
{"word":"coinherent","summary":{"en":"Coinherent means “mutually indwelling,” used mainly in theology to say two or more realities exist within one another.","zh":"coinherent 指“彼此内在/互相内住”，主要用于神学语境，表示两者或多者相互存在于彼此之中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Theology, formal) existing within one another; mutually indwelling or interpenetrating.","zh":"（神学/正式用语）彼此内在、互相内住；相互渗透、共存于彼此之中。"},"examples":[{"en":"Some Christian theologians describe the Trinity as coinherent—each Person fully indwelling the others.","zh":"一些基督教神学家把“三位一体”描述为 coinherent——每一位格都完全内住于另外两位。"},{"en":"The text argues that divine love and divine life are coinherent, not separate qualities.","zh":"该文本主张神圣的爱与神圣的生命是 coinherent 的，并非彼此分离的属性。"}]}],"synonyms":["mutually indwelling","interpenetrating","inseparable (in context)","coexisting (in context)"],"phonetic":"/ˌkoʊ.ɪnˈhɪr.ənt/","extraExplanation":["这个词多见于基督教神学讨论（尤其与“三位一体”相关），常与名词 co-inherence（共在/互内）一起出现。意思接近 perichoresis（互相内住、互渗），用来强调“不是融合成一位，也不是彼此分离”，而是“彼此完全临在、互相贯通”。","词源上是 co-（共同、一起）+ inherent（内在的），因此字面就是“共同内在”。在日常英语里非常少用，更常见于学术或宗教写作。"]}
{"word":"coinheres","summary":{"en":"“Coinheres” means “exists together in the same thing; is jointly present,” and it’s the third-person singular form of “coinhere.”","zh":"“coinheres”意为“在同一事物中共同存在/共同依附”，是动词“coinhere”的第三人称单数形式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(third-person singular) to exist together in the same thing; to be jointly present or closely connected.","zh":"（第三人称单数）在同一事物中同时存在；共同依附；紧密相连。"},"examples":[{"en":"In the theory, mind and body coinheres in a single living person.","zh":"在这一理论中，心灵与身体在同一个活着的人身上共同存在。"},{"en":"Several meanings coinheres in this symbol, depending on the context.","zh":"这个符号在不同语境下会同时承载几层含义。"}]}],"synonyms":["coexist","inhere together","be jointly present","conjoin"],"phonetic":"/ˌkoʊɪnˈhɪrz/","extraExplanation":["“coinheres”是动词“coinhere”的第三人称单数形式（he/she/it coinheres）。该词较少见，常出现在哲学、神学或较正式的学术写作中，用来强调“共同存在/共同依附于同一主体”。","不要和更常用的“cohere”（连贯、黏合、相一致）混淆：cohere更偏“整体是否连贯一致”，coinhere更偏“多种性质/要素是否在同一事物中并存”。"]}
{"word":"coinhering","summary":{"en":"“Coinhering” means parts or ideas are tightly connected and form a coherent whole (or are inseparable by nature).","zh":"“coinhering”表示事物/观点彼此紧密关联、形成连贯整体（或本质上不可分离）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “cohere”) to exist or work together as a connected whole; to “stick together” in meaning or structure.","zh":"（cohere 的现在分词）指在意义、结构或逻辑上彼此连贯、结合在一起；“粘合/一致”。"},"examples":[{"en":"The evidence is coinhering, so the story feels believable.","zh":"这些证据彼此连贯，所以这个说法显得可信。"},{"en":"In a good paragraph, the ideas are coinhering instead of scattered.","zh":"在一段好的文字里，观点是彼此连贯的，而不是零散的。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common) existing together in an inseparable way; mutually connected by nature.","zh":"（较少见）指本质上共同存在、不可分离地相互关联。"},"examples":[{"en":"She described the mind and body as coinhering aspects of human life.","zh":"她把身心描述为人类生活中共同存在、相互关联的面向。"},{"en":"The novel shows coinhering themes of loss and hope.","zh":"这部小说呈现了“失去”和“希望”这两种相互交织的主题。"}]}],"synonyms":["cohering","interconnected","inseparable","closely linked","mutually dependent"],"phonetic":"ˌkoʊɪnˈhɪrɪŋ","extraExplanation":["“coinhere/coinhering”是比较书面、偏学术的词，常见于哲学、神学或文学批评里，强调“不是巧合地在一起”，而是“本质上就连在一起”。日常英语里更常用 cohere（连贯、一致）、fit together（契合）、hang together（说得通）。"]}
{"word":"coinheritance","summary":{"en":"Coinheritance means inheriting two or more genetic traits or variants together.","zh":"coinheritance 指同时遗传到两种或多种遗传性状或基因变异。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the situation in which two (or more) genetic traits or gene variants are inherited together in the same person","zh":"（遗传学）共同遗传；指一个人同时遗传到两种或多种遗传性状/基因变异的情况"},"examples":[{"en":"Doctors checked for the coinheritance of two blood disorders in the family.","zh":"医生检查这个家族是否存在两种血液疾病的共同遗传。"},{"en":"Coinheritance can change how severe a genetic condition becomes.","zh":"共同遗传可能会改变遗传性疾病的严重程度。"},{"en":"The report described coinheritance of a gene mutation and a protective variant.","zh":"报告描述了某个基因突变与一种保护性变异的共同遗传。"}]}],"synonyms":["co-inheritance","joint inheritance","combined inheritance"],"phonetic":"/ˌkoʊ.ɪnˈhɛr.ɪ.təns/","extraExplanation":["“coinheritance”常见于医学遗传学与科研论文中，尤其在讨论两种遗传变异同时存在时对表型（症状表现）或疾病风险的影响。例如：地中海贫血与G6PD缺乏等变异在同一个体内的共同遗传，可能让临床表现更复杂。","拼写也常见作“co-inheritance”（加连字符），含义相同。"]}
{"word":"coinheritor","summary":{"en":"A coinheritor is a co-heir—someone who shares an inheritance (sometimes used in religious contexts for shared spiritual inheritance).","zh":"coinheritor 指“共同继承人/共同后嗣”，即与他人共享遗产（也常用于宗教语境指共享属灵产业）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who shares an inheritance with one or more others; a co-heir.","zh":"共同继承人；与他人共同享有遗产继承权的人。"},"examples":[{"en":"After their mother died, the two sisters became coinheritors of the family house.","zh":"母亲去世后，两姐妹成了家族房产的共同继承人。"},{"en":"The will named three coinheritors, each receiving an equal share.","zh":"遗嘱指定了三位共同继承人，每人获得同等份额。"}]},{"partOfSpeech":"n.","definition":{"en":"(Religious/Biblical use) Someone who shares in a promised spiritual inheritance with another person or group, often said as “co-heir” (e.g., with Christ).","zh":"（宗教/《圣经》用法）与他人（或群体）共同分享应许的属灵产业的人，常表达为“与……同为后嗣/同作后嗣”（如“与基督同为后嗣”）。"},"examples":[{"en":"In the sermon, believers were described as coinheritors with Christ.","zh":"在讲道中，信徒被描述为与基督同为后嗣的共同继承人。"},{"en":"The passage emphasizes unity: they are coinheritors of the promise.","zh":"这段经文强调合一：他们同为应许的共同继承人。"}]}],"synonyms":["co-heir","coheir","joint heir","fellow heir"],"phonetic":"/ˌkoʊɪˈrɪtər/","extraExplanation":["“coinheritor”在现代英语中不算常见，更常见的写法是“co-heir”或“coheir”。在法律语境里指共同继承遗产的人；在基督教语境中常见于经文讨论（如《罗马书》8:17中“heirs… co-heirs with Christ”的表达），强调“共享产业/应许”。","构词上：co- 表示“共同”，heir 表示“继承人”。因此理解为“共同的继承人”很直观。"]}
{"word":"coining","summary":{"en":"Coining means either making coins or inventing new words/expressions (and by extension, something newly created).","zh":"Coining 指“铸造硬币”，也指“造词/创造新表达”（引申为创造新事物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of making metal money (coins), usually by a government or mint","zh":"铸造硬币的行为或过程（通常由政府或造币厂进行）"},"examples":[{"en":"The museum has an exhibit on ancient Roman coining techniques.","zh":"博物馆里有一个关于古罗马铸币技术的展览。"},{"en":"Modern coining uses machines to stamp designs onto metal blanks.","zh":"现代铸币使用机器把图案压印在金属坯上。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of inventing a new word, phrase, or expression; word creation","zh":"创造新词、新短语或新表达的行为；造词"},"examples":[{"en":"The coining of the word “selfie” spread quickly through social media.","zh":"“selfie（自拍）”这个词的创造通过社交媒体迅速传播。"},{"en":"Writers are famous for the coining of memorable phrases.","zh":"作家常因创造令人难忘的表达而出名。"}]},{"partOfSpeech":"adj.","definition":{"en":"inventing (a word, phrase, or idea); creating something new","zh":"（新词/新说法/新概念的）创造、发明的"},"examples":[{"en":"He has a talent for coining catchy slogans.","zh":"他很擅长创造朗朗上口的口号。"},{"en":"The novel is full of coining humor and fresh expressions.","zh":"这部小说充满创造性的幽默和新鲜的表达。"}]}],"synonyms":["minting","coinage","word creation","neologism","inventing"],"phonetic":"/ˈkɔɪnɪŋ/","extraExplanation":["“coining”来自动词 coin，原义与“铸币”有关，因为硬币要“被压印/成形”。后来引申为“铸造（语言）”，也就是“造词”。","语言学里，“造词”常与 neologism（新词）和 coinage（新造词/新说法）一起出现：neologism更强调“新词”这个结果；coining更强调“创造的过程”。","文化小贴士：英语里常说 Shakespeare coined many words（莎士比亚创造了许多词/用法），这是在谈文学与语言创新，并不一定表示他“第一次发明”了所有词，也可能是他最早的书面记录或推广者。"]}
{"word":"coinitial","summary":{"en":"Coinitial means “starting together” or “sharing the same beginning,” especially in academic contexts.","zh":"coinitial 表示“同时开始”或“共享相同开头（如词首音）”，多用于学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Beginning at the same time; having the same starting point in time or process.","zh":"同时开始的；在时间或过程上有相同起点的。"},"examples":[{"en":"The two projects were coinitial, but they developed in very different directions.","zh":"这两个项目同时启动，但发展方向截然不同。"},{"en":"Her symptoms were coinitial with the start of the new medication.","zh":"她的症状与开始服用新药同时出现。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Linguistics/phonetics) Sharing the same initial sound or beginning segment (for example, words that start with the same consonant or cluster).","zh":"（语言学/语音学）具有相同词首音或开头语音片段的（例如以相同辅音或辅音连缀开头的词）。"},"examples":[{"en":"“cat” and “cup” are coinitial because they begin with the /k/ sound.","zh":"“cat”和“cup”是同词首音的，因为它们都以/k/音开头。"},{"en":"The study grouped coinitial words to test how quickly learners recognize shared beginnings.","zh":"研究把同词首音的词分组，以测试学习者识别共同开头的速度。"}]}],"synonyms":["simultaneous","concurrent","coincident","coeval"],"phonetic":"/ˌkoʊɪˈnɪʃəl/","extraExplanation":["词源上是前缀 co-（“共同、一起”）+ initial（“最初的、开头的”）。在日常写作中较少见，更常出现在学术语境（如医学报告、语言学研究）里。"]}
{"word":"Coinjock","summary":{"en":"Coinjock is a small community in northeastern North Carolina, best known as a stop along the Intracoastal Waterway.","zh":"Coinjock 是美国北卡罗来纳州东北部的一个小社区，最常被提到的特点是位于美国内陆水道沿线、便于停靠补给。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small unincorporated community in Currituck County, northeastern North Carolina, USA, located near the Intracoastal Waterway (often known as a stopping point for boaters).","zh":"美国北卡罗来纳州（北卡）柯里塔克县（Currituck County）的一个小型非建制社区，靠近美国内陆水道（Intracoastal Waterway），常被视为船只停靠休整的地点。"},"examples":[{"en":"We spent the night in Coinjock while traveling down the Intracoastal Waterway.","zh":"我们沿着美国内陆水道南下时，在 Coinjock 过了一夜。"},{"en":"Coinjock is known among boaters as a convenient place to stop for fuel and food.","zh":"在船友圈里，Coinjock 以加油和补给方便而出名。"}]}],"phonetic":"/ˈkɔɪnˌdʒɑk/","extraExplanation":["“Coinjock”是地名（专有名词），通常首字母大写；在口语和写作里常与北卡外滩（Outer Banks）一带的航行、旅游、钓鱼等语境一起出现。","发音上一般重音在前：COIN-jock。第二部分“jock”在这里不是“运动员/运动迷”的意思，而只是地名构词的一部分。"]}
{"word":"coinmaker","summary":{"en":"A coinmaker is someone who makes coins, usually working at a mint.","zh":"coinmaker 指“铸币工/造币者”，通常在造币厂制作硬币。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who makes coins, especially as a skilled worker at a mint (an official place where money is produced).","zh":"铸币工；造币者（尤指在造币厂/铸币厂制作硬币的工匠或工作人员）。"},"examples":[{"en":"In ancient cities, a coinmaker often worked for the king or the state.","zh":"在古代城邦里，铸币工常常为国王或国家工作。"},{"en":"The museum shows tools a coinmaker used to stamp designs onto metal blanks.","zh":"博物馆展出了铸币工用来把图案压印到金属坯上的工具。"}]}],"synonyms":["moneyer","mint worker","coin minter"],"phonetic":"/ˈkɔɪnˌmeɪkər/","extraExplanation":["“coinmaker”常见于历史语境。现代更常用的相关词是“mint worker（造币厂工人）”“moneyer（历史上的铸币者/货币铸造者）”或“die engraver（模具雕刻师）”。","传统铸币流程大致包括：准备金属坯（blank）→用模具（die）压印图案→检验重量与成色。古代手工铸币的质量差异较大，因此“coinmaker”的信誉有时会影响货币的可信度。"]}
{"word":"coinmaking","summary":{"en":"Coinmaking means the craft or process of making coins.","zh":"Coinmaking 指“铸币/造币”的工艺或过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process or craft of producing coins (designing, stamping/striking, and finishing metal pieces for use as money).","zh":"铸币；造币（制作硬币的过程或工艺，包括设计、压印/敲制与后期处理）。"},"examples":[{"en":"Ancient coinmaking often used hand-hammered dies to strike metal blanks.","zh":"古代铸币常用手工雕刻的模具敲击金属坯来压印图案。"},{"en":"Modern coinmaking is usually done at a national mint with high-pressure machines.","zh":"现代造币通常在国家造币厂用高压机器完成。"}]}],"synonyms":["minting","coinage","coining"],"phonetic":"/ˈkɔɪnˌmeɪkɪŋ/","extraExplanation":["“Coinmaking”在日常英语里不算特别常见，更常用的相关词是“minting（铸造硬币）”“coinage（铸币/硬币体系）”和“the mint（造币厂）”。","在历史与考古语境中，coinmaking 常用来强调“工艺与技术”（如模具、敲制、压印、合金成分），而不是单纯指“货币本身”。"]}
{"word":"coinmate","summary":{"en":"Coinmate is most commonly a proper name for a cryptocurrency exchange platform.","zh":"Coinmate 通常指一个加密货币交易平台的品牌名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a brand name for a European cryptocurrency exchange platform where people can buy, sell, and store digital currencies (e.g., Bitcoin, Ethereum).","zh":"Coinmate：一家欧洲的加密货币交易平台品牌，人们可以在上面买卖并存放数字货币（如比特币、以太坊）。"},"examples":[{"en":"I used Coinmate to buy a small amount of Bitcoin.","zh":"我用 Coinmate 买了一小笔比特币。"},{"en":"Coinmate is a crypto exchange, so fees and verification rules may apply.","zh":"Coinmate 是加密货币交易所，所以可能会有手续费和身份验证规则。"}]}],"synonyms":["crypto exchange","cryptocurrency exchange","trading platform"],"phonetic":"/ˈkɔɪnˌmeɪt/","extraExplanation":["“Coinmate”通常作为专有名词（品牌/平台名）使用，而不是常见英文词汇。一般不写成“coin mate”（两个词）来表达“硬币伙伴”的意思。","加密货币交易平台常见相关词：exchange（交易所/交易平台）、wallet（钱包）、KYC（身份验证）、fee（手续费）、deposit/withdraw（充值/提现）。","如果你是在阅读新闻或App界面遇到它，通常指该公司/服务本身；具体可交易币种、合规要求与可用地区会因国家/地区而异。"]}
{"word":"coinmates","summary":{"en":"“Coinmates” is an informal term (often in crypto communities) meaning people connected by holding or supporting the same coin—fellow holders/investors.","zh":"“Coinmates”是非正式用语（常见于加密货币社群），指因共同持有/支持同一种币而结成的同伴——同持币者/同好。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, mainly online) People you feel connected to because you share an interest in a particular coin or cryptocurrency; fellow coin holders/investors.","zh":"（非正式，多见于网络）因共同关注或持有某种“币/加密货币”而产生认同的人；币圈同好、同持币者。"},"examples":[{"en":"My coinmates think this project has long-term potential.","zh":"我的 coinmates 觉得这个项目有长期潜力。"},{"en":"I asked my coinmates for advice before buying more.","zh":"在加仓之前，我向我的 coinmates 请教了建议。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) People who collect coins together or share a hobby related to coins.","zh":"（少见）一起集币/收藏硬币的人；有共同硬币相关爱好的人。"},"examples":[{"en":"At the coin show, I met a few coinmates who trade old pennies.","zh":"在钱币展上，我认识了几个会交换老便士的 coinmates。"}]}],"synonyms":["fellow holders","fellow investors","crypto community","coin friends"],"phonetic":"/ˈkɔɪn.meɪts/","extraExplanation":["“coinmate(s)”不是传统词典里的常见词，更像是网络自造词：coin（币/加密币）+ mate（伙伴）。在英文里，-mate 常用来表示“同伴/同学/室友”（如 classmate, roommate），所以 coinmates 带有“同一阵营/同好”的语气。","语域偏口语和社群内部用语，适合在聊天、论坛、社交媒体上使用；正式写作中更常用 crypto community / fellow investors / fellow holders。"]}
{"word":"coinquinate","summary":{"en":"A rare, formal verb meaning “to defile or contaminate; to make impure.”","zh":"一个罕见的正式动词，意为“玷污、污染；使不洁/不纯”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something dirty, impure, or morally tainted; to defile or contaminate (often used in a formal or literary tone).","zh":"使变脏、玷污；使不纯或在道德上被污染（多为正式或文学用语）。"},"examples":[{"en":"They believed that lies could coinquinate the mind.","zh":"他们认为谎言会玷污人的心智。"},{"en":"The river was coinquinated by industrial waste.","zh":"这条河被工业废弃物污染了。"},{"en":"She refused to coinquinate her reputation by joining the scheme.","zh":"她拒绝参与那场阴谋，免得玷污自己的名声。"}]}],"synonyms":["contaminate","pollute","defile","taint","sully"],"phonetic":"/koʊˈɪŋkwəˌneɪt/","extraExplanation":["“coinquinate”非常罕见，现代英语里更常用的是“contaminate / pollute / defile / taint”。它带有较强的书面语、古典或宗教/道德色彩，既可指“物理上的污染”，也常指“精神或道德上的玷污”。","词源来自拉丁语“coinquinare”（使污秽、使不洁），因此在严肃文本里会显得更“古雅”、更强调“被弄脏/被玷污”的感觉，而不只是一般的“变脏”。"]}
{"word":"Coins","summary":{"en":"“Coins” usually means metal money (plural of coin). It can also be the verb form of “coin,” meaning to invent a term or to mint money.","zh":"“Coins”通常指硬币（coin 的复数）；也可作动词 coin 的形式，表示“创造术语/新词”或“铸造货币”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small, flat pieces of metal used as money.","zh":"硬币；用作货币的小型扁平金属片。"},"examples":[{"en":"Do you have any coins for the vending machine?","zh":"你有投自动贩卖机的硬币吗？"},{"en":"She counted the coins in her pocket.","zh":"她数了数口袋里的硬币。"}]},{"partOfSpeech":"n.","definition":{"en":"Coins as a collection or an amount of money in coin form.","zh":"（总称）硬币；以硬币形式存在的一笔钱。"},"examples":[{"en":"The jar is full of coins.","zh":"罐子里装满了硬币。"},{"en":"I paid in coins because I didn’t have any bills.","zh":"我用硬币付了钱，因为我没有纸币。"}]},{"partOfSpeech":"vt.","definition":{"en":"To invent and start using a new word or phrase.","zh":"创造（新词或新说法）；首次提出并开始使用。"},"examples":[{"en":"He coined the term “smart city.”","zh":"他创造了“智慧城市”这个术语。"},{"en":"Social media often coins new slang.","zh":"社交媒体经常创造新的俚语。"}]},{"partOfSpeech":"vt.","definition":{"en":"To make coins (money) from metal, usually in an official place like a mint.","zh":"铸造硬币（通常在造币厂等官方机构）。"},"examples":[{"en":"The government coins money at the national mint.","zh":"政府在国家造币厂铸造货币。"},{"en":"In the past, kings coined gold and silver into currency.","zh":"过去，国王会把金银铸造成货币。"}]}],"synonyms":["change","metal money","currency (coins)","mint (as a verb)","invent (a term)"],"phonetic":"/kɔɪnz/","extraExplanation":["“coins”通常是名词复数，指多枚硬币；在口语里也常用来泛指“零钱”。","动词 coin 的意思是“创造（新词/术语）”或“铸造硬币”。新闻与学术写作里常见“coin a term（创造一个术语）”。"]}
{"word":"coins","summary":{"en":"“Coins” usually means more than one coin (metal money). It can also be the verb “coins,” meaning “creates a new term” or “makes coins.”","zh":"“coins”通常指多枚硬币（金属货币）；也可作动词“coins”，表示“创造新词/说法”或“铸造硬币”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of coin: small, flat pieces of metal used as money.","zh":"coin 的复数：硬币；用作货币的小而扁的金属片。"},"examples":[{"en":"I have a few coins in my pocket.","zh":"我口袋里有几枚硬币。"},{"en":"Do you have any coins for the parking meter?","zh":"你有投停车计时器的硬币吗？"},{"en":"She counted the coins carefully before paying.","zh":"她在付款前仔细数了数硬币。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular of coin (verb): to invent or create a new word, phrase, or idea; or to make metal into coins.","zh":"coin 的第三人称单数（动词）：（1）创造/新造一个词语或说法；（2）把金属铸造成硬币。"},"examples":[{"en":"He coins new phrases that quickly become popular online.","zh":"他会创造一些新说法，很快就在网上流行起来。"},{"en":"The mint coins millions of dollars each year.","zh":"造币厂每年铸造数百万美元的硬币。"}]}],"synonyms":["change","small change","metal money","currency","mint","invent (a term)","create (a phrase)"],"phonetic":"/kɔɪnz/","extraExplanation":["日常英语里，coins 常和 change（零钱）一起出现：coins 指“硬币”，change 更常指“找零/零钱”（可能包括硬币和纸币）。","coin 作动词时很常见于“coin a term/phrase”（创造术语/说法），例如：The journalist coined the term “fake news.”（那位记者创造了“假新闻”这个说法。）"]}
{"word":"coinspire","summary":{"en":"Conspire means to plan secretly with others, or for events to seem to work together to cause a result (often negative).","zh":"conspire 指与他人秘密共谋；也可指各种因素似乎“合力”造成某种结果（常为负面）。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"To secretly plan with other people to do something harmful, illegal, or dishonest.","zh":"（与他人）秘密共谋，密谋做有害、违法或不诚实的事。"},"examples":[{"en":"They conspired to steal money from the company.","zh":"他们密谋从公司偷钱。"},{"en":"Police said the group conspired to attack the building.","zh":"警方称该团伙密谋袭击这栋建筑。"},{"en":"She was accused of conspiring with her friend to cheat on the test.","zh":"她被指控与朋友合谋考试作弊。"}]},{"partOfSpeech":"vi.","definition":{"en":"To seem to work together (often by chance) to cause a result, usually a bad one.","zh":"（多指巧合地）似乎共同作用导致某种结果，常为不好的结果。"},"examples":[{"en":"Bad weather and heavy traffic conspired to make us late.","zh":"恶劣天气和严重拥堵“合力”导致我们迟到。"},{"en":"Everything seemed to conspire against him that day.","zh":"那天似乎所有事情都在跟他作对。"}]}],"synonyms":["plot","scheme","collude","hatch","band together"],"phonetic":"/kənˈspaɪr/","extraExplanation":["你输入的“coinspire”通常是“conspire”的拼写错误；正确拼写是 conspire。常见相关词：conspiracy（n. 阴谋；共谋）和 conspirator（n. 共谋者）。","用法提示：conspire 常与 with（与……共谋）或 to do（密谋做……）搭配：conspire with someone / conspire to do something。"]}
{"word":"coinstantaneity","summary":{"en":"Coinstantaneity means the fact of two or more events occurring at the same time.","zh":"coinstantaneity 指两个或多个事件在同一时间发生的事实或状态（同时性）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or fact of happening at the same time; simultaneity","zh":"同时发生（在同一时间发生）的状态；同时性"},"examples":[{"en":"The scientist tested whether the flashes were caused by the coinstantaneity of two signals.","zh":"科学家测试这些闪光是否由两个信号的同时发生造成。"},{"en":"In the story, the coinstantaneity of the two phone calls feels like fate.","zh":"在故事里，两通电话的同时响起让人觉得像命运安排。"},{"en":"The report notes the coinstantaneity of the power outage and the storm’s peak.","zh":"报告指出停电与暴风雨最强时刻是同时发生的。"}]}],"synonyms":["simultaneity","concurrency","simultaneousness","co-occurrence"],"phonetic":"/ˌkoʊˌɪnstənˈeɪniəti/","extraExplanation":["这是一个比较少见、偏学术的词，由 co-（共同）+ instantaneous（瞬时的）+ -ity（名词后缀）构成，常见的更自然表达是 simultaneity / simultaneous occurrence（同时性／同时发生）。","相关形容词是 coinstantaneous（同时发生的），例如：coinstantaneous events（同时发生的事件）。"]}
{"word":"coinstantaneous","summary":{"en":"“Coinstantaneous” means happening at the same time, often used in technical contexts.","zh":"“coinstantaneous”意为“同时发生的”，多见于科技语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening at the same time; simultaneous.","zh":"同时发生的；同时性的；同步的。"},"examples":[{"en":"The two signals were nearly coinstantaneous, arriving within a millisecond of each other.","zh":"两个信号几乎是同时到达的，时间差在一毫秒以内。"},{"en":"In the experiment, the flashes were designed to be coinstantaneous.","zh":"在实验中，这些闪光被设计为同时出现。"}]}],"synonyms":["simultaneous","concurrent","synchronous"],"phonetic":"/ˌkoʊˌɪnˌstænˈteɪniəs/","extraExplanation":["这个词比较少见，多用于科学/技术写作（如物理、工程、信号处理）。日常英语里更常用 simultaneous / at the same time。","构词上是 co-（共同、一起）+ instantaneous（瞬间的），强调“在同一瞬间发生”。如果允许有极小时间差，作者有时会写 nearly/approximately coinstantaneous。"]}
{"word":"coinstantaneously","summary":{"en":"“Coinstantaneously” means “at exactly the same moment; simultaneously,” but it’s rare and usually replaced by simpler words.","zh":"coinstantaneously 表示“在同一瞬间；同时”，但很少用，通常用 simultaneously / at the same time 来替代。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"At the same moment as something else; simultaneously (used to emphasize that two events happen together).","zh":"与另一件事在同一时刻发生；同时（用来强调两件事一起发生）。"},"examples":[{"en":"The lights went out and the alarm rang coinstantaneously.","zh":"灯熄灭的同时，警报也几乎在同一瞬间响了。"},{"en":"In the experiment, the two signals appeared coinstantaneously on the screen.","zh":"在实验中，两个信号在屏幕上同时出现。"}]}],"synonyms":["simultaneously","at the same time","concurrently","in tandem"],"phonetic":"/ˌkoʊˌɪnstənˈteɪniəsli/","extraExplanation":["这个词非常少见，更常用的表达是 simultaneously / at the same time / concurrently。日常写作与口语里几乎不用 coinstantaneously。","词形上可以拆成 co-（共同、一起）+ instantaneous（瞬间的）+ -ly（副词后缀），意思就是“在同一瞬间地”。在科学/技术语境里偶尔会用来加强“同一瞬间发生”的强调。"]}
{"word":"coinstantaneousness","summary":{"en":"Coinstantaneousness means the quality of occurring at exactly the same moment—perfect simultaneity.","zh":"coinstantaneousness 指“在完全同一时刻发生”的性质，即“完全同时性/同步性”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of happening at exactly the same time; complete simultaneity","zh":"同时发生（在完全同一时刻发生）的状态；完全同步性"},"examples":[{"en":"The experiment required the coinstantaneousness of two signals to measure the delay accurately.","zh":"这项实验需要两个信号完全同时出现，才能准确测量延迟。"},{"en":"In practice, perfect coinstantaneousness is difficult to achieve because of tiny timing differences.","zh":"在实际操作中，由于极细微的时间差，想实现完全同时发生往往很难。"}]}],"synonyms":["simultaneity","synchrony","concurrence","coincidence (in time)"],"phonetic":"/koʊˌɪn.stənˈteɪ.ni.əs.nəs/","extraExplanation":["这是一个非常少见、偏学术/技术的名词，通常会用更常见的词来表达，比如 simultaneity（同时性）、coincidence in time（时间上的一致）、at the same instant（在同一瞬间）。","构词上可以拆成 co-（共同）+ instantaneous（瞬间的/同时的）+ -ness（名词后缀），意思就是“共同的瞬间性”。在工程、物理、信号处理等讨论“同步”“时间对齐”时偶尔可能出现。"]}
{"word":"coinsurable","summary":{"en":"Coinsurable means “able to be jointly insured by more than one insurer,” especially under a co-insurance arrangement.","zh":"Coinsurable 指“可由多家保险公司共同承保的”，常见于共保安排。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Insurance) able to be insured by more than one insurer; suitable for co-insurance.","zh":"（保险）可由多个保险人共同承保的；适合共同保险（共保）的。"},"examples":[{"en":"Large commercial buildings are often coinsurable because the risk is too big for one company to carry alone.","zh":"大型商业建筑通常是可共同承保的，因为风险太大，单一公司难以独自承担。"},{"en":"The broker checked whether the shipment was coinsurable under a co-insurance arrangement.","zh":"经纪人确认该批货物是否能在共保安排下共同承保。"}]}],"synonyms":["co-insurable","jointly insurable"],"phonetic":"/koʊˈɪnˌʃʊrəbəl/","extraExplanation":["在保险语境中，coinsurable 通常出现在“共保/共同保险（co-insurance）”讨论里：当标的风险或保额很大时，可能由多家保险公司按比例分担责任与保费。它强调“适合由多家一起承保”的性质。注意不要和“coinsurance（共付额/共同保险条款）”混淆：后者在医疗保险里常指被保险人按比例自付的费用。"]}
{"word":"coinsurance","summary":{"en":"Coinsurance is the share of costs you pay (often a percentage) under an insurance plan, especially after meeting your deductible; it can also refer to a property-insurance rule about minimum coverage levels.","zh":"Coinsurance 指在保险中由你分担的费用比例（常见于达到免赔额后），也可指财产保险中关于最低投保比例的共同保险条款。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In insurance, the percentage of covered costs you pay after you’ve met your deductible (common in health insurance).","zh":"（保险）共同保险：在你达到免赔额（deductible）之后，你仍需按一定比例分担的医疗/理赔费用（常见于医疗保险）。"},"examples":[{"en":"After I met my deductible, my plan covered 80% and my coinsurance was 20%.","zh":"我达到免赔额后，保险支付80%，我的共同保险比例是20%。"},{"en":"The doctor visit was expensive because my coinsurance applied instead of a fixed copay.","zh":"这次看医生很贵，因为适用的是共同保险比例，而不是固定的自付额（copay）。"}]},{"partOfSpeech":"n.","definition":{"en":"In some property insurance policies, a rule requiring you to insure property for a certain percentage of its value; otherwise, the payout may be reduced.","zh":"（财产保险）共同保险条款：要求投保金额达到财产价值的一定比例，否则发生损失时赔付可能按比例减少。"},"examples":[{"en":"The policy had an 80% coinsurance requirement for the building.","zh":"这份保单对建筑物有80%的共同保险要求。"},{"en":"Because they underinsured the property, the coinsurance clause reduced the claim payment.","zh":"因为投保金额不足，共同保险条款降低了理赔金额。"}]}],"synonyms":["cost-sharing","out-of-pocket share","percentage share"],"phonetic":"/ˌkoʊɪnˈʃʊrəns/","extraExplanation":["在美国医疗保险语境里，coinsurance 通常和 copay（固定金额自付）一起出现：copay 是“每次固定付多少钱”，coinsurance 是“按比例付多少”。","常见写法是 co-insurance 或 coinsurance，意思相同；在保险文件中会用百分比表示（如 20% coinsurance）。"]}
{"word":"coinsure","summary":{"en":"“Coinsure” means to share insurance costs by paying a set percentage of covered expenses.","zh":"“Coinsure”指在保险中按约定比例分担已覆盖的费用（共同保险/共付比例）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to share the cost of an insurance loss with another party (often the policyholder), so each pays a percentage of the covered expenses","zh":"（在保险中）与另一方分担理赔费用（通常指投保人与保险公司按比例承担），各自支付一定比例的费用"},"examples":[{"en":"Many health plans require you to coinsure 20% of the bill after you meet the deductible.","zh":"许多医疗保险计划要求你在达到免赔额后，对账单进行20%的共同保险（自付比例）。"},{"en":"If the contract says you coinsure 30%, the insurer pays the remaining 70% of covered costs.","zh":"如果合同规定你承担30%的共同保险，那么保险公司将支付剩余70%的已覆盖费用。"}]}],"synonyms":["share the cost","cost-share"],"phonetic":"/ˌkoʊɪnˈʃʊr/","extraExplanation":["“coinsure”多见于保险条款与理赔说明中，常与“coinsurance（共同保险/共付比例）”一起出现。它强调的是在达到免赔额（deductible）之后，费用按比例分摊，而不是固定金额的自付（copay）。","在日常英语里更常说：“You pay 20% coinsurance.” 或直接用名词“coinsurance”，动词“coinsure”相对更偏书面与合同用语。"]}
{"word":"coinsured","summary":{"en":"Coinsured means “covered together under the same insurance policy,” or “to add someone as a co-insured.”","zh":"Coinsured指“在同一份保险单下共同被保障的”，也可指“把某人列为共同被保险人/方”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Insurance) covered by the same insurance policy as another person or entity; sharing insurance protection.","zh":"（保险）与他人/他方共同被同一份保险单保障的；共同被保险的。"},"examples":[{"en":"Her spouse is coinsured under her employer’s health plan.","zh":"她的配偶在她公司的健康保险计划下作为共同被保险人得到保障。"},{"en":"The hospital is coinsured on the liability policy for the study.","zh":"医院在该研究的责任保险单上是共同被保险方。"}]},{"partOfSpeech":"vt.","definition":{"en":"to include (someone or something) as a co-insured under an insurance policy.","zh":"将（某人或某物）列为共同被保险人/共同被保险方。"},"examples":[{"en":"The contract requires the landlord to coinsure the tenant on the property policy.","zh":"合同要求房东在财产保险单上将房客列为共同被保险方。"},{"en":"You can coinsure the new vehicle when you update the policy.","zh":"你更新保单时可以把新车辆列为共同被保险车辆。"}]}],"synonyms":["co-insured","jointly insured","covered under the same policy"],"phonetic":"/ˌkoʊɪnˈʃʊrd/","extraExplanation":["“coinsured”常见于保险合同/条款（尤其是财产险、责任险、健康险）。它指“同一份保单下的共同被保险人/方”，不一定等同于“共同支付费用”。","注意不要与“coinsurance（共同保险/共保比例）”混淆：coinsurance通常指理赔时由投保人按比例分担费用的机制（例如80/20）。","拼写上也常见“co-insured”（加连字符）这一写法，含义相同。"]}
{"word":"coinsurer","summary":{"en":"A coinsurer is an insurer that shares a policy’s risk and claim payments with other insurers.","zh":"coinsurer 指与其他保险公司共同承保并分担赔付责任的保险公司（共同保险人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an insurance company that shares the risk and cost of an insurance policy with another insurer (or several insurers)","zh":"共同保险人；与其他保险公司一起分担同一保单风险与赔付责任的保险公司"},"examples":[{"en":"Two coinsurers agreed to split the risk 50–50 under the policy.","zh":"两家共同保险人同意在该保单下以五五比例分担风险。"},{"en":"The coinsurer will pay its portion of the claim directly to the policyholder.","zh":"共同保险人将把其应承担的那部分理赔款直接支付给投保人。"}]}],"synonyms":["co-insurer","participating insurer","co-underwriter"],"phonetic":"/koʊˈɪnˌʃʊrɚ/","extraExplanation":["在英文保险语境里，coinsurer 常出现在“共同保险/共保（coinsurance or co-insurance）”“共保协议（coinsurance agreement）”等文件中，强调的是多家保险公司共同承保同一风险，各自按约定比例承担保费与赔付。","不要与“reinsurer（再保险人）”混淆：reinsurer 是向原保险公司提供再保险的一方，通常不直接面对投保人；coinsurer 则是并列承保者，通常与投保人同一张保单相关。"]}
{"word":"coinsures","summary":{"en":"“Coinsures” means “jointly insures” or “shares insurance risk with another insurer.”","zh":"“coinsures”意为“共同承保”，即与其他保险公司一起分担保险风险。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to insure something jointly with another insurer; to share an insurance risk together","zh":"（与另一家保险公司）共同承保；共同分担保险风险"},"examples":[{"en":"Two companies coinsure the factory, so the risk is shared.","zh":"两家公司共同承保这家工厂，因此风险被分摊。"},{"en":"The policy states that the building is coinsured by three insurers.","zh":"保单注明该建筑由三家保险公司共同承保。"}]}],"synonyms":["co-insure","jointly insure","share the risk"],"phonetic":"/ˌkoʊɪnˈʃʊrz/","extraExplanation":["“coinsures”是动词“co-insure”的第三人称单数（he/she/it coinsures）。在保险行业里更常见的相关名词是“coinsurance（共保/共同保险；或指被保险人按比例分担费用的‘共同保险比例’）”，但注意：动词co-insure通常指“保险公司之间共同承保”，而医疗或财产保险里常说的“coinsurance”多指投保人/被保险人需要按比例自付的部分。"]}
{"word":"coinsuring","summary":{"en":"“Coinsuring” means jointly providing insurance coverage with another insurer or party.","zh":"“coinsuring”指与他方共同承保、共同分担保险风险。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"jointly insuring something with another insurer (or sharing insurance coverage with another party); the present participle of “co-insure.”","zh":"与另一家保险公司共同承保（或与他方分摊保险责任）；动词“co-insure”的现在分词。"},"examples":[{"en":"Two companies are coinsuring the factory to spread the risk.","zh":"两家公司正在共同承保这家工厂，以分散风险。"},{"en":"The policy states that the building is coinsured by three insurers.","zh":"保单注明该建筑由三家保险公司共同承保。"},{"en":"Coinsuring large projects can make coverage more stable and affordable.","zh":"共同承保大型项目可以让保障更稳定、成本更可控。"}]}],"synonyms":["co-insuring","jointly insuring","sharing coverage"],"phonetic":"/ˌkoʊɪnˈʃʊrɪŋ/","extraExplanation":["“coinsuring / co-insuring”多用于保险行业语境，强调“共同承保/共同分担风险”。日常英语里更常见的相关词是“coinsurance（共保/共付比例）”，它常指被保险人按比例分担费用（如医疗保险中的自付比例），含义与“co-insure（共同承保）”不完全一样。"]}
{"word":"cointense","summary":{"en":"“Cointense” is not standard English; you likely mean “coincidence” (a chance event that happens at the same time as another).","zh":"“cointense” 不是标准英语；你可能想写 “coincidence”，表示“巧合/同时发生的偶然事件”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “coincidence.”","zh":"这不是标准英语单词；很可能是把 “coincidence（巧合）” 拼错了。"},"examples":[{"en":"“Cointense” isn’t in most English dictionaries—did you mean “coincidence”?","zh":"“cointense” 在大多数英语词典里找不到——你是不是想写 “coincidence”？"}]}],"synonyms":["chance","accident","happenstance"],"phonetic":"/koʊˈɪnsədəns/","extraExplanation":["“coincidence” 常见拼写错误包括：*coincidence* 写成 *coincidense / coincident / cointense* 等。正确拼写里有 **-cidence**（不是 -tense）。","“coincidence” 的常用搭配：**by coincidence**（碰巧）、**a strange coincidence**（奇怪的巧合）、**It’s no coincidence that...**（……绝非巧合）。","词源小提示：*co-*（一起）+ *incide*（落在/发生在同一点上），所以核心意思是“同时发生、碰到一起”。"]}
{"word":"cointension","summary":{"en":"Cointension means the shared inherent meaning (shared intension) between two expressions, mainly used in semantics/logic.","zh":"Cointension 指两个表达式共享的内涵意义（共同意涵），主要用于语义学/逻辑学。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In semantics and logic, the shared intension (shared inherent meaning or concept) of two expressions; what they mean in common, even if they refer to different things.","zh":"（语义学/逻辑学）两个表达式的“共同内涵/共同意涵”：它们在概念意义上重合的部分，即使它们指称的对象不同。"},"examples":[{"en":"“doctor” and “physician” have strong cointension because they share nearly the same core meaning.","zh":"“doctor”和“physician”有很强的共同内涵（cointension），因为它们的核心意义几乎相同。"},{"en":"Two words can share cointension but differ in tone or typical context.","zh":"两个词可能共享共同内涵，但在语气或常见语境上不同。"}]}],"synonyms":["shared intension","overlap in meaning","semantic overlap"],"phonetic":"/ˌkoʊɪnˈtɛnʃən/","extraExplanation":["这个词非常少见，多用于哲学、形式语义学、逻辑学的讨论。日常英语里更常用的说法是 “shared meaning（共同意义）”、“overlap in meaning（意义重叠）”，或在更专业的语境中用 “intension（内涵）/extension（外延）” 来说明。","intension 指“一个词/概念所包含的特征与条件”（内涵）；extension 指“它所涵盖的对象集合”（外延）。cointension 强调的是两个表达式在 intension 层面的重合。"]}
{"word":"cointensity","summary":{"en":"Cointensity means the joint/shared intensity of two things measured or happening together.","zh":"Cointensity 指两种事物（常为信号/光束/变量）同时发生或一起测量时的共同强度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the shared or joint intensity of two things (often two signals, beams, or variables), especially when they occur together or are measured together","zh":"（两种事物的）共同强度/联合强度；常指两个信号、光束或变量同时出现或被一起测量时的强度"},"examples":[{"en":"In optical experiments, researchers sometimes compare the cointensity of two beams to study interference.","zh":"在光学实验中，研究人员有时会比较两束光的共同强度来研究干涉现象。"},{"en":"The software plots cointensity so you can see where two signals become strong at the same time.","zh":"该软件会绘制共同强度，让你看出两个信号在何时同时变强。"}]}],"synonyms":["co-intensity","joint intensity","combined intensity"],"phonetic":"/koʊ.ɪnˈtɛn.sə.ti/","extraExplanation":["“cointensity”并不是日常英语中的常用词，更常见的写法是带连字符的“co-intensity”，意思相当于“joint intensity（联合强度）”。","在不同学科里它的具体计算方式可能不同：在物理/光学里可能与“强度（intensity）”的叠加或相关有关；在信号处理/统计语境中也可能指两个量的“共同强度分布”或“同时高强度的程度”。阅读论文时要结合作者给出的公式或定义。"]}
{"word":"cointer","summary":{"en":"“Cointer” is not a standard English word; it is most likely “counter,” meaning a surface (countertop/service counter) or an action/idea that opposes something.","zh":"“cointer”不是标准英语词，最可能是“counter”，意思是柜台/台面，或指反制、抵消、反对的行动或观点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely a misspelling) “counter”: a long, flat surface in a store, bank, or kitchen where people put things or are served.","zh":"（可能是拼写错误）counter：指商店、银行或厨房里用来放东西、结账或操作的长台面/柜台。"},"examples":[{"en":"Please pay at the counter.","zh":"请在柜台付款。"},{"en":"I left the groceries on the kitchen counter.","zh":"我把杂货放在厨房台面上。"}]},{"partOfSpeech":"n.","definition":{"en":"“counter”: an idea or action that opposes another one; a response against something.","zh":"counter：反对的意见/措施；对某事的反制、回应。"},"examples":[{"en":"The government announced new countermeasures.","zh":"政府宣布了新的反制措施。"},{"en":"She offered a counterargument in the meeting.","zh":"她在会议上提出了反驳意见。"}]},{"partOfSpeech":"vt.","definition":{"en":"“to counter”: to act against something in order to reduce its effect; to oppose or fight back.","zh":"counter：反制；抵消；对抗（以减弱其影响）。"},"examples":[{"en":"They worked to counter online rumors.","zh":"他们努力反制网络谣言。"},{"en":"Warm clothes help counter the cold.","zh":"保暖衣物有助于抵御寒冷。"}]},{"partOfSpeech":"adv.","definition":{"en":"“counter”: in the opposite direction or in opposition.","zh":"counter：相反方向地；对立地。"},"examples":[{"en":"The current flows counter to the wind.","zh":"水流逆风而行。"},{"en":"That decision runs counter to our plans.","zh":"那个决定与我们的计划相悖。"}]}],"synonyms":["oppose","resist","fight back","counteract","contradict","service counter","countertop"],"phonetic":"/ˈkaʊntɚ/","extraExplanation":["“cointer”本身不是常见英语单词。你可能想写的是：\n1）counter（最常见：柜台/反制）\n2）coin（硬币）+ 相关词：coined（创造新词/新说法）\n如果你告诉我句子原文，我可以帮你确认到底是哪一个词。"]}
{"word":"cointerest","summary":{"en":"Cointerest (more often written “co-interest”) means a shared interest or common stake.","zh":"cointerest（更常写作 co-interest）指“共同利益/共同关切”，即多方共享的利益或利害关系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a shared interest or common stake between two or more people or groups","zh":"共同利益；共同关切（两方或多方共享的利益或利害关系）"},"examples":[{"en":"The two companies have a cointerest in developing clean energy technology.","zh":"这两家公司在开发清洁能源技术方面有共同利益。"},{"en":"We should focus on our cointerest rather than our differences.","zh":"我们应该关注共同利益，而不是分歧。"}]},{"partOfSpeech":"adj.","definition":{"en":"sharing the same interest or benefit; having a common stake","zh":"有共同利益的；利益一致的"},"examples":[{"en":"They are cointerest partners in the project.","zh":"他们是这个项目中利益一致的合作伙伴。"}]}],"synonyms":["common interest","shared interest","mutual interest","common stake"],"phonetic":"/ˌkoʊˈɪntrəst/","extraExplanation":["“cointerest”在现代英语里非常少见，更常见的写法是带连字符的“co-interest”，或者直接用更自然的表达：common interest（共同兴趣/共同利益）、shared interest（共享利益）、mutual interest（共同利益）。","在法律或商业语境中，它通常更偏“共同利益/共同利害关系（stake）”，不只是“共同爱好”。如果你想表达“共同爱好”，用common interest in music这类说法更地道。"]}
{"word":"cointerred","summary":{"en":"Cointerred means buried together in the same grave or tomb.","zh":"cointerred 指“合葬的”，即葬在同一墓穴或陵墓中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of bodies) buried together in the same grave or tomb.","zh":"（指遗体）合葬的；葬在同一墓穴或陵墓中的。"},"examples":[{"en":"The married couple were cointerred in a single tomb.","zh":"这对夫妇被合葬在同一座墓中。"},{"en":"Archaeologists found several cointerred individuals, suggesting a family burial.","zh":"考古学家发现数位合葬者，暗示这可能是家族合葬。"}]},{"partOfSpeech":"vt.","definition":{"en":"to bury (someone) together with another person or group; to inter together.","zh":"将（某人）与他人一起埋葬；合葬。"},"examples":[{"en":"They asked to be cointerred after death.","zh":"他们希望去世后能合葬。"},{"en":"The records say the soldiers were cointerred in a mass grave.","zh":"记录显示这些士兵被合葬在一处万人坑（集体墓）中。"}]}],"synonyms":["buried together","interred together","jointly buried"],"phonetic":"/ˌkoʊ.ɪnˈtɝd/","extraExplanation":["“cointerred”来自动词“cointer”（co- 表示“共同”，inter 表示“埋葬”）。在现代英语里更常见的说法是 “buried together / interred together”，而“cointerred”较正式，常见于考古、历史记录或墓葬相关语境。"]}
{"word":"cointerring","summary":{"en":"“Cointerring” (more commonly written “co-interring”) means burying people together in the same grave.","zh":"“cointerring”（更常写作“co-interring”）指把人合葬在同一墓穴/同一块墓地。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare) burying two or more bodies together in the same grave; being buried together.","zh":"（罕见）把两具或多具遗体合葬；一同下葬。"},"examples":[{"en":"The family requested cointerring the couple in the same plot.","zh":"家属请求把这对夫妇合葬在同一块墓地里。"},{"en":"The records mention cointerring several relatives in one grave during the epidemic.","zh":"记录提到在疫情期间，数位亲属被合葬在同一座墓里。"}]}],"synonyms":["co-inter","bury together","inter together","be buried together"],"phonetic":"/ˌkoʊˈɪntərɪŋ/","extraExplanation":["“cointerring”多见于较正式或历史类英文写作中，更常见的写法是带连字符的 **co-interring**（co- + inter “埋葬”）。日常英语里通常会说 **bury together** 或 **be buried together**。","注意不要把 **inter**（埋葬，重音在第二音节 /ɪnˈtɜr/）和常见介词 **in** 混淆；**inter** 作为动词比较正式。"]}
{"word":"cointers","summary":{"en":"“Cointers” isn’t standard English; you probably mean “counters” (surfaces/devices/people for counting) or “counters” as a verb meaning “responds with opposition” or “neutralizes.”","zh":"“cointers”不是标准英语；你可能想写“counters”（台面/柜台；计数器/计数的人），或动词“counters”（反驳；抵消/克制）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not a standard English word.) Most likely a misspelling of “counters,” the plural of “counter,” or the verb “counter” in the 3rd-person singular.","zh":"（不是标准英语单词。）很可能是“counters”的拼写错误；“counters”可以是名词“counter”的复数，或动词“counter”的第三人称单数形式。"},"examples":[{"en":"I think you meant “counters” (with a U), not “cointers.”","zh":"我想你要写的是“counters”（有字母 U），不是“cointers”。"}]},{"partOfSpeech":"n.","definition":{"en":"(as “counters,” noun) Flat surfaces in a kitchen/shop for preparing food or serving customers; also, devices/people used for counting.","zh":"（作“counters”，名词）厨房或商店里的台面/柜台；也可以指“计数器”或“负责计数的人”。"},"examples":[{"en":"Please wipe the kitchen counters after cooking.","zh":"做完饭后请把厨房台面擦干净。"},{"en":"The cashier stood behind the counter, and the counters were busy all day.","zh":"收银员站在柜台后面，柜台那边一整天都很忙。"},{"en":"The lab uses digital counters to track how many samples arrive each hour.","zh":"实验室用数字计数器来记录每小时到达的样本数量。"}]},{"partOfSpeech":"v.","definition":{"en":"(as “counters,” verb) Responds to an argument or action with an opposing argument or action; resists or neutralizes something.","zh":"（作“counters”，动词）用反驳或对抗行动来回应；抵消、克制某事。"},"examples":[{"en":"She counters his point with clear evidence.","zh":"她用明确的证据反驳他的观点。"},{"en":"Regular exercise counters stress.","zh":"规律运动有助于抵消压力。"}]}],"synonyms":["countertops","worktops","counting devices","responds","rebuts","opposes","neutralizes"],"phonetic":"/ˈkaʊn.tɚz/","extraExplanation":["“cointers”常见原因是把“counters”误拼：英语里 /aʊ/ 这个音（如 out, count）有时会让学习者联想到“oi”的拼写，但在“count/counter”里标准拼写是 OU。","如果你想表达的是“指针/指示器”，也可能你本来想写的是“pointers”。你可以告诉我你要表达的句子，我可以帮你选最准确的词。"]}
{"word":"cointersecting","summary":{"en":"Cointersecting describes things (often lines/curves) that intersect at the same point or share a common intersection.","zh":"cointersecting 指（常见于直线/曲线等）在同一点相交或共享同一交点。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"intersecting at the same point or sharing a common intersection (used mostly in math/geometry and technical writing)","zh":"（多用于数学/几何与技术写作）在同一点相交的；共享同一交点的"},"examples":[{"en":"In the diagram, three cointersecting lines meet at point O.","zh":"在图中，三条共交的直线在点 O 相交。"},{"en":"The proof assumes two cointersecting circles with a shared intersection point.","zh":"该证明假设两条共交的圆有一个共同的交点。"}]}],"synonyms":["concurrent (lines)","intersecting at the same point","sharing a common intersection"],"phonetic":"/ˌkoʊˌɪntərˈsɛktɪŋ/","extraExplanation":["“co-”有“共同、一起”的意思；“cointersecting”=“一起相交/共同相交”。这个词在日常英语中很少见，更常见的表达是“intersecting at the same point / having a common intersection point”。","在不同学科里可能会看到近似说法：如“concurrent lines”（多条直线共点）更常用于几何；而“cointersecting”更像是把“共同”这一点直接写进“intersect”。"]}
{"word":"cointise","summary":{"en":"“Concise” means clear and brief—using few words but still complete.","zh":"“concise”指表达清楚且简短，用较少的词但信息完整。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Giving a lot of information clearly and in few words; brief but complete.","zh":"（表达）简明的；言简意赅的；用很少的词清楚地传达信息。"},"examples":[{"en":"Please keep your answer concise.","zh":"请把你的回答说得简明一些。"},{"en":"She wrote a concise summary of the report.","zh":"她把报告写成了一份简明的摘要。"},{"en":"The instructions are clear and concise.","zh":"说明清晰简明。"}]}],"synonyms":["brief","succinct","terse","to the point"],"phonetic":"/kənˈsaɪs/","extraExplanation":["你输入的“cointise”不是常见英文单词；最可能是把“concise”（简明的）拼错了。","“concise”常用于写作和口语建议：强调“少而精”，不是“简单/浅显”（simple）。"]}
{"word":"Cointon","summary":{"en":"Cointon is usually a proper noun (most often a surname) rather than a common English vocabulary word.","zh":"Cointon 通常是专有名词（多为姓氏），而不是常见英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A family name (surname).","zh":"姓氏（家族姓）。"},"examples":[{"en":"Dr. Cointon will speak at the conference tomorrow.","zh":"Cointon 医生明天将在会议上发言。"},{"en":"I met someone with the last name Cointon at work.","zh":"我在工作中遇到过一位姓 Cointon 的人。"}]},{"partOfSpeech":"other","definition":{"en":"A rare proper name that may appear as a place name or a personal name; not a common standard English word.","zh":"较少见的专有名词，可能用作地名或人名；不是常见的标准英语词汇。"},"examples":[{"en":"‘Cointon’ appears in the document as a name, not as a vocabulary word.","zh":"“Cointon” 在这份文件里是作为名字出现的，而不是词汇。"}]}],"synonyms":["(no direct synonyms; proper name)"],"phonetic":"ˈkɔɪn.tən","extraExplanation":["“Cointon”在英语里不属于常见词汇，更像是专有名词（人名/姓氏/地名）。如果你是在文章、地址或人名列表里看到它，通常不需要“翻译”，而是按名字使用。","发音可能会因地区与家族习惯而不同；如果你能提供一句原文或说明它出现的语境（人名/地名/公司名等），我可以给更贴近实际的读法与用法。"]}
{"word":"Cointreau","summary":{"en":"Cointreau is a French orange liqueur brand commonly used in cocktails.","zh":"Cointreau（君度）是法国橙味利口酒品牌，常用于调制鸡尾酒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand of French orange liqueur (a type of “triple sec”), often used in cocktails such as a Margarita or Cosmopolitan","zh":"君度（法国橙味利口酒品牌；一种“三秒橙酒”），常用于玛格丽特、柯梦波丹等鸡尾酒"},"examples":[{"en":"This Margarita recipe uses tequila, lime juice, and Cointreau.","zh":"这份玛格丽特配方用到龙舌兰、青柠汁和君度。"},{"en":"Could I get a Cosmopolitan with Cointreau instead of another orange liqueur?","zh":"我可以点一杯柯梦波丹，用君度来替代其他橙味利口酒吗？"}]}],"synonyms":["triple sec","orange liqueur"],"phonetic":"/ˈkwɑn.troʊ/","extraExplanation":["“Cointreau”是品牌名，通常首字母大写；在口语或酒吧点单中，有时也会被当作“橙味利口酒”的具体选择来提及。","它属于“triple sec（三秒橙酒）”风格：清澈、橙香明显、甜度适中，常用来提升鸡尾酒的柑橘香气与酒体层次。","文化小贴士：在欧美酒吧点单时，说“with Cointreau”表示你偏好这款特定品牌；如果只说“orange liqueur”，酒吧可能会用其他品牌替代。"]}
{"word":"cointreau","summary":{"en":"Cointreau is a French orange liqueur (triple sec) commonly used in cocktails.","zh":"Cointreau（君度）是法国橙味利口酒（triple sec），常用于调制鸡尾酒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand of clear French orange liqueur (triple sec) often used in cocktails.","zh":"君度（一种法国透明橙味利口酒/橙皮酒，属于 triple sec，常用于调制鸡尾酒）。"},"examples":[{"en":"She ordered a Margarita made with Cointreau.","zh":"她点了一杯用君度调的玛格丽特。"},{"en":"Add Cointreau for a clean orange flavor in the drink.","zh":"加一点君度，让酒有更干净的橙香味。"}]}],"synonyms":["triple sec","orange liqueur"],"phonetic":"/ˈkwɑnˌtroʊ/","extraExplanation":["“Cointreau”是品牌名，日常多作不可数名词使用（some Cointreau），也可指“一瓶/一杯君度”（a bottle/shot of Cointreau）。","它属于“triple sec（橙味干型利口酒）”家族，常见于经典配方如 Margarita、Cosmopolitan、Sidecar 等。发音中鼻化元音 /ɑ̃/ 在英语里通常读成接近“on/ahn”的音。"]}
{"word":"coinvent","summary":{"en":"Co-invent means to invent something together with others.","zh":"co-invent 指“与他人共同发明（某物）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to invent something together with one or more other people; to be a joint inventor of an idea, product, or method","zh":"与他人共同发明；作为共同发明人一起创造某个想法、产品或方法"},"examples":[{"en":"She co-invented a new water filter with two engineers.","zh":"她与两位工程师共同发明了一种新的净水过滤器。"},{"en":"They co-invented the process in the university lab.","zh":"他们在大学实验室共同发明了这项工艺。"},{"en":"He is listed as a co-inventor on the patent because he helped co-invent the design.","zh":"由于他参与共同发明该设计，他在专利上被列为共同发明人。"}]}],"synonyms":["jointly invent","invent together","collaborate (to invent)","develop together"],"phonetic":"/ˌkoʊ ɪnˈvɛnt/","extraExplanation":["“co-”表示“共同、一起”。拼写上常见为 co-invent（带连字符），也有人写作 coinvent；在正式写作与专利/学术语境中，带连字符更清晰。","在专利语境里，co-invent 常与 co-inventor（共同发明人）一起出现；是否算“共同发明”通常取决于是否对发明的关键构思作出实质性贡献。"]}
{"word":"coinventor","summary":{"en":"A co-inventor is someone who invents something together with others.","zh":"co-inventor 指与他人共同完成发明的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who invents something together with one or more other people; a joint inventor","zh":"与一人或多人共同发明某物的人；共同发明人"},"examples":[{"en":"She is the co-inventor of a new medical device.","zh":"她是一种新型医疗器械的共同发明人。"},{"en":"He and his colleague are listed as co-inventors on the patent.","zh":"他和同事被列为该专利的共同发明人。"},{"en":"As a co-inventor, you may share credit and legal rights to the invention.","zh":"作为共同发明人，你可能共享该发明的荣誉与法律权利。"}]}],"synonyms":["joint inventor","collaborating inventor","co-creator"],"phonetic":"/ˌkoʊ ɪnˈvɛntər/","extraExplanation":["更常见的拼写是 **co-inventor**（带连字符）或 **coinventor**（不带连字符也能见到，但相对少）。在正式文件（尤其是专利、合同、学术简历）里通常使用 **co-inventor**。","在专利语境中，**co-inventor** 通常指对“发明构思”有实质贡献的人；仅提供资金、执行实验或一般协助的人未必会被认定为共同发明人（具体以法律与机构规定为准）。"]}
{"word":"coinventors","summary":{"en":"“Coinventors” means people who invent something together (plural of co-inventor).","zh":"“coinventors”指共同发明某样东西的人（co-inventor 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who invent something together; joint inventors (plural).","zh":"共同发明者；联合发明人（复数）。"},"examples":[{"en":"The patent lists three co-inventors on the new battery design.","zh":"这项新电池设计的专利上列了三位共同发明者。"},{"en":"She and her professor were co-inventors of a medical device.","zh":"她和她的教授是某项医疗设备的共同发明者。"}]}],"synonyms":["joint inventors","collaborative inventors","co-creators (broader)"],"phonetic":"/ˌkoʊ ɪnˈvɛn.tɚz/","extraExplanation":["在专利语境里，co-inventor（共同发明人）通常指“对发明的构思有实质性贡献的人”。仅仅提供资金、管理项目、或按指示执行实验的人，一般不一定算共同发明人。","拼写上常见 co-inventors（带连字符）与 coinventors（不带连字符）。正式写作和专利文件里更常见 co-inventors。"]}
{"word":"coinvestigator","summary":{"en":"A co-investigator is a researcher who collaborates with the principal investigator on a study and takes responsibility for specific parts of the project.","zh":"co-investigator 指与首席研究员合作并负责项目部分工作的共同研究员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A researcher who works with the principal investigator (PI) on a study, sharing responsibility for parts of the project (such as designing methods, collecting data, or writing reports).","zh":"（研究项目中的）共同研究员；与首席研究员（PI）一起开展研究、分担项目部分职责的人。"},"examples":[{"en":"Dr. Lee is a co-investigator on the clinical trial, focusing on data analysis.","zh":"李博士是这项临床试验的共同研究员，主要负责数据分析。"},{"en":"The grant application lists one principal investigator and two co-investigators.","zh":"这份经费申请列出一名首席研究员和两名共同研究员。"}]}],"synonyms":["collaborating researcher","co-researcher","Co-I"],"phonetic":"/ˌkoʊ ɪnˈvɛstɪˌɡeɪtɚ/","extraExplanation":["“co-investigator”常见于学术研究与科研经费（grant）申请语境，表示与PI协作但通常不承担项目的最高管理与最终责任。不同机构对职责划分可能略有差异：有的会写作“Co-I”。","写法上也常见“co-investigator”或“coinvestigator”；正式文件里更常用带连字符的“co-investigator”。"]}
{"word":"coinvestigators","summary":{"en":"Co-investigators are research collaborators who work with the principal investigator on a project.","zh":"共同研究者是在项目中与首席研究员合作开展研究的合作者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who work with the main investigator (the principal investigator) on a research project; collaborators who share responsibility for parts of the study.","zh":"（研究项目中）与首席研究员（PI）共同开展研究的合作者；共同研究者，通常负责研究的某些部分并共同承担责任。"},"examples":[{"en":"The grant lists Dr. Lee as the principal investigator and three co-investigators from different universities.","zh":"该基金申请中，李博士是首席研究员，另有三位来自不同大学的共同研究者。"},{"en":"Co-investigators helped design the study and analyze the data.","zh":"共同研究者协助设计研究并分析数据。"}]}],"synonyms":["co-researchers","collaborators","co-investigators (Co-Is)","research partners"],"phonetic":"/ˌkoʊ ɪnˈvɛstɪˌɡeɪtərz/","extraExplanation":["在科研语境里常写作 co-investigator（有时也写作 coinvestigator）。在许多基金/课题申请中，PI（principal investigator）是主要负责人；co-investigator（也常缩写为 Co-I）通常负责某个工作包（如方法、数据、伦理、某个子课题等），在署名与管理上也可能承担相应义务。不同机构对 co-investigator 的具体权限与责任划分会略有差异。"]}
{"word":"coinvolve","summary":{"en":"“Coinvolve” means to involve people or things together in the same activity or situation.","zh":"“Coinvolve”指把人或事物共同牵涉在同一活动或情境中。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to involve someone or something together with others; to include as part of the same activity, decision, or situation","zh":"共同牵涉；使（某人/某事）一同参与或被包含在同一件事中"},"examples":[{"en":"The project coinvolves engineers, designers, and community members.","zh":"这个项目共同牵涉到工程师、设计师和社区成员。"},{"en":"Any policy change will coinvolve costs and benefits.","zh":"任何政策变化都会同时牵涉成本与收益。"}]}],"synonyms":["involve jointly","entail together","include","implicate"],"phonetic":"/ˌkoʊɪnˈvɑlv/","extraExplanation":["“coinvolve”由前缀 co-（表示“共同、一起”）+ involve 组成，语气比 involve 更强调“同时把多个对象一起牵扯进来/包含在内”。在正式写作（学术、政策、法律语境）中更常见；日常口语里通常用 involve / include / bring in 来表达。"]}
{"word":"coiny","summary":{"en":"“Coiny” means coin-like—having the look, shape, shine, or feel associated with coins (often used in descriptive writing).","zh":"“coiny”指“像硬币的”，常用于描写硬币般的形状、光泽、质感或与硬币相关的感觉（较偏描写性用法）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Coin-like; having the shape, shine, or look of a coin.","zh":"像硬币的；具有硬币的形状、光泽或外观的。"},"examples":[{"en":"The designer added small, coiny buttons to the jacket.","zh":"设计师在夹克上加了小小的、像硬币一样的纽扣。"},{"en":"In the light, the necklace showed a coiny shimmer.","zh":"在灯光下，这条项链泛着硬币般的微光。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to coins or money; suggesting currency.","zh":"与硬币或金钱有关的；带有“货币/钱”的意味的。"},"examples":[{"en":"The museum has a coiny smell—metal, old cases, and history.","zh":"博物馆里有种“硬币味”——金属、旧展柜和历史的气息。"},{"en":"He liked the coiny clink of change in his pocket.","zh":"他喜欢口袋里零钱叮当作响的那种“硬币感”。"}]}],"synonyms":["coin-like","coin-shaped","metallic","money-related"],"phonetic":"/ˈkɔɪni/","extraExplanation":["“coiny”并不是非常常见的日常词，更常见的说法是 coin-like / coin-shaped / metallic。它多见于较有画面感的描写（尤其是文学、评论、或讲述质感的文本），用来强调“像硬币一样的形状、反光、或叮当声”。","词形来自 coin（硬币）+ -y（表示“具有……特征的”），类似的构词还有: rainy（多雨的）、snowy（多雪的）。"]}
{"word":"coir","summary":{"en":"Coir is a strong fiber from coconut husks, used for ropes, mats, brushes, and gardening medium.","zh":"Coir 指来自椰子外壳的结实纤维，用于绳索、地垫、刷子以及园艺栽培介质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rough, strong natural fiber taken from the outer husk of a coconut, used to make rope, mats, brushes, and as a gardening growing medium (coco coir).","zh":"（椰壳）椰纤维；由椰子外壳纤维制成的粗而结实的天然纤维，用于制绳、地垫、刷子，也常用作园艺栽培介质（椰糠/椰纤土）。"},"examples":[{"en":"The doormat is made of coir, so it can handle a lot of dirt and water.","zh":"这块门垫是椰纤维做的，所以很耐脏、也不怕水。"},{"en":"Many gardeners use coir as a peat-free alternative for starting seeds.","zh":"很多园艺爱好者用椰纤维土来育苗，作为不含泥炭的替代品。"},{"en":"The fishermen repaired their nets with coir rope.","zh":"渔民用椰纤维绳修补渔网。"}]}],"synonyms":["coconut fiber","coco coir","coconut husk fiber"],"phonetic":"/kɔɪr/","extraExplanation":["“coir”常出现在园艺语境里，尤其是“coco coir”（椰纤土/椰糠）。它吸水性好、透气性也不错，常被拿来替代peat（泥炭），因为泥炭开采涉及生态争议。","词源上，“coir”来自印度南部语言（常见说法指向马拉雅拉姆语/泰米尔语里与“绳索”有关的词），反映了这种材料在沿海地区传统制绳和编织中的用途。"]}
{"word":"Coire","summary":{"en":"Coire is a Scottish Gaelic term for a glacial bowl-shaped mountain hollow (a corrie/cirque).","zh":"Coire 是苏格兰盖尔语词，指冰川形成的山体碗状凹地（即 corrie/cirque，常译为冰斗/圈谷）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(chiefly Scottish, geography) A bowl-shaped hollow on the side of a mountain formed by glacier erosion; a “corrie/cirque.”","zh":"（主要用于苏格兰的地理用语）冰川侵蚀形成的山坡“碗状凹地”；即“冰斗/冰蚀圈谷”（corrie/cirque）。"},"examples":[{"en":"We climbed past the loch into a steep coire beneath the ridge.","zh":"我们越过湖泊，攀进山脊下方一个陡峭的冰斗。"},{"en":"In winter, snow can linger in a coire long after the valley has thawed.","zh":"冬天里，冰斗里的积雪往往在山谷解冻很久后仍会停留。"}]}],"synonyms":["corrie","cirque","glacial cirque"],"phonetic":"/ˈkɔr.ə/","extraExplanation":["“coire”来自苏格兰盖尔语，在苏格兰高地的地名中很常见（例如 Coire an t-Sneachda）。英语里更常见的对应词是“corrie”（苏格兰用法）或“cirque”（更国际化/学术一些）。在徒步、攀登和地形描述中常用来指山体上被冰川“挖”出的半圆形盆地。"]}
{"word":"coire","summary":{"en":"A Scottish term for a bowl-shaped mountain hollow (glacial valley), and in Gaelic also a “cauldron.”","zh":"苏格兰用词：指冰川形成的碗状山地凹地；在盖尔语中也可指“大锅、釜”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scottish, geography) A steep-walled hollow on a mountainside, often formed by glacial erosion; a small bowl-shaped valley (also spelled “corrie,” similar to “cirque”).","zh":"（苏格兰·地理）山坡上陡峭的半圆形凹地，常由冰川侵蚀形成；碗状小山谷（也常拼作 corrie，含义接近 cirque）。"},"examples":[{"en":"We climbed past a rocky coire filled with snow even in late spring.","zh":"我们爬过一个岩石嶙峋的 coire，到了晚春里面仍积着雪。"},{"en":"The trail skirts the coire before rising to the ridge.","zh":"小径沿着 coire 的边缘走，然后再爬上山脊。"}]},{"partOfSpeech":"n.","definition":{"en":"(Scottish Gaelic) A cauldron or large kettle; used mainly in Gaelic or in names and traditional contexts.","zh":"（苏格兰盖尔语）大锅、釜；多见于盖尔语或地名、传统语境中。"},"examples":[{"en":"In old stories, a coire could be big enough to feed a whole clan.","zh":"在古老故事里，一个 coire 可能大到足以给整个氏族做饭。"}]}],"synonyms":["corrie","cirque","glacial bowl","hollow"],"phonetic":"/ˈkɔːri/","extraExplanation":["“coire”来自苏格兰盖尔语。作为英语里的地理词汇时，它常出现在苏格兰高地的地图、登山文章和地名中；在英式拼写里更常见的是“corrie”。","在地形学里，coire/corrie 与法语借词“cirque”非常接近：都指冰斗地形（冰川掏蚀形成的碗状谷）。不过在苏格兰语境中，用“coire/corrie”更有地方色彩。"]}
{"word":"coirs","summary":{"en":"Coirs are coconut-husk fibers used for products like mats, ropes, and gardening medium.","zh":"coirs 指椰子外壳纤维，用于门垫、绳索以及园艺栽培介质等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural: coirs) A rough, strong natural fiber from the husk of a coconut, used to make rope, mats, brushes, and stuffing.","zh":"（复数：coirs）椰壳纤维；从椰子外壳（椰壳、椰衣）中提取的粗而结实的天然纤维，用于制作绳索、地垫、刷子、填充物等。"},"examples":[{"en":"The doormat is made from coir, so it’s tough and good at scraping dirt off shoes.","zh":"这块门垫是椰壳纤维做的，所以很耐用，也很适合刮掉鞋底的泥。"},{"en":"Gardeners often use coir as a soil substitute to help hold moisture.","zh":"园艺爱好者常用椰壳纤维作栽培介质，帮助保持水分。"}]}],"synonyms":["coconut fiber","coco fiber","coco coir"],"phonetic":"ˈkɔɪər","extraExplanation":["“coir”在园艺语境中很常见，常写作“coco coir”（椰糠/椰纤维基质）。它通常被视为较环保的材料，因为属于椰子加工的副产品，并且可再生。","词形提示：你输入的“coirs”是名词复数；单数是“coir”。"]}
{"word":"coislander","summary":{"en":"A coislander is someone from the same island as you—a fellow island resident.","zh":"coislander 指“和你来自/住在同一座岛上的人”，即同岛居民。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who lives on or comes from the same island as someone else; a fellow island resident","zh":"同岛居民；同一个岛上的人（与另一个人来自/居住在同一座岛上）"},"examples":[{"en":"As coislanders, we share the same ferry schedule and the same storm warnings.","zh":"作为同岛居民，我们共用同一班渡轮时刻表，也会收到同样的风暴预警。"},{"en":"She greeted him warmly, happy to meet a coislander in a distant city.","zh":"她热情地跟他打招呼，在遥远的城市里遇到同岛的人让她很开心。"}]}],"synonyms":["co-islander","fellow islander","island neighbor"],"phonetic":"/koʊˈaɪləndər/","extraExplanation":["这个词更常见的写法是 **co-islander**（带连字符），强调“co-（共同、同一）+ islander（岛民）”。不带连字符的 **coislander** 也能理解，但在正式写作里相对少见。","常用于强调共同的地域身份与情感连接，类似于 *fellow islander*（同岛的人）、*island neighbor*（岛上邻居）。"]}
{"word":"coisns","summary":{"en":"“Cousin” means your aunt or uncle’s child; it can also mean something that is closely related or similar.","zh":"“cousin”指堂/表兄弟姐妹（姑/姨/叔/伯的孩子）；也可比喻指“同类/近亲”的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a child of your aunt or uncle (your parent’s sibling); someone in your extended family who is about the same generation as you","zh":"堂/表兄弟姐妹；（父母的兄弟姐妹的孩子）同辈的亲戚"},"examples":[{"en":"My cousin lives in New York.","zh":"我的表（堂）兄弟/姐妹住在纽约。"},{"en":"We’re cousins, so we see each other at family gatherings.","zh":"我们是表（堂）亲，所以会在家庭聚会时见面。"},{"en":"She invited all her cousins to her birthday party.","zh":"她邀请了所有堂/表兄弟姐妹来参加生日派对。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or thing that is related to another in some way; a ‘kind of’ similar type (often used in phrases like “a cousin of …”)","zh":"（比喻）同类的人/事物；有某种“亲缘/关联”的类似事物（常用于“a cousin of …”结构）"},"examples":[{"en":"Portuguese is a cousin of Spanish.","zh":"葡萄牙语和西班牙语算是“近亲”语言。"},{"en":"This fruit is a cousin of the orange.","zh":"这种水果和橙子是同一类/近亲。"}]}],"synonyms":["relative","family member"],"phonetic":"/ˈkʌzən/","extraExplanation":["你输入的“coisns”很可能是拼写错误，常见目标词是“cousins”（cousin 的复数）。正确拼写：cousin / cousins。","中文里常说“堂兄弟姐妹/表兄弟姐妹”，但英文 cousin 不区分“堂/表”，也不区分性别；需要时可说 male cousin / female cousin。"]}
{"word":"coissin","summary":{"en":"Cousin means your aunt’s or uncle’s child; it can also mean something closely related in the same “family” or type.","zh":"Cousin 指堂/表兄弟姐妹（姑姨舅叔的孩子）；也可比喻同类或密切相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a child of your aunt or uncle; a relative from the same family generation (not your brother or sister)","zh":"堂/表兄弟姐妹；（父母兄弟姐妹的）孩子，同辈亲戚（不是亲兄弟姐妹）"},"examples":[{"en":"My cousin lives in New York.","zh":"我表哥（或堂姐）住在纽约。"},{"en":"We’re cousins, so we see each other at family gatherings.","zh":"我们是堂/表亲，所以会在家庭聚会时见面。"},{"en":"She’s my first cousin on my mother’s side.","zh":"她是我妈妈那边的堂/表亲（第一代表/堂亲）。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or thing that is related to another in a similar way; something from the same “family” or type","zh":"同类事物；“表亲”般的相关事物（比喻：同一类型或有相似关系）"},"examples":[{"en":"Spanish and Italian are cousins—they’re both Romance languages.","zh":"西班牙语和意大利语算“表亲”——它们都是罗曼语族语言。"},{"en":"These two phones are cousins in design, but the new one is faster.","zh":"这两款手机在设计上像“表亲”，但新款更快。"}]}],"synonyms":["relative","kin","family member"],"phonetic":"/ˈkʌzən/","extraExplanation":["你输入的“coissin”很可能是拼写错误，常见正确拼法是 **cousin**。","英语里亲属称谓比较笼统，**cousin** 不区分堂/表，也不区分性别；需要时可加：**male cousin / female cousin**，或用更具体的说法说明来自父系/母系（on my father’s/mother’s side）。","在部分英语国家文化中，人们也会把关系很近的“表亲”当作朋友一样相处，所以日常对话里经常出现。"]}
{"word":"coistrel","summary":{"en":"A rare, old word meaning a stable boy/groom, or (as an insult) a contemptible fellow.","zh":"一个罕见的古语，可指马夫/马厩小厮，也可作辱骂指卑鄙之徒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) a groom or stable boy; a young man who takes care of horses.","zh":"（古语）马夫；马厩小厮；照料马匹的年轻仆役。"},"examples":[{"en":"In old stories, a coistrel might be sent to saddle the horses before dawn.","zh":"在一些古老故事里，coistrel 可能会在黎明前被派去给马备鞍。"},{"en":"The lord called for his coistrel to bring the mare to the gate.","zh":"领主叫马夫把母马牵到门口。"}]},{"partOfSpeech":"n.","definition":{"en":"(Archaic, insulting) a low or contemptible fellow; sometimes a cowardly person.","zh":"（古语，侮辱）卑鄙的人；下贱之徒；有时指胆小鬼。"},"examples":[{"en":"“You coistrel!” he shouted, using an old-fashioned insult.","zh":"“你这个 coistrel！”他喊道，用的是一种老式的辱骂。"},{"en":"The novel’s villain sneers at the hero as a coistrel.","zh":"小说里的反派轻蔑地称主角为 coistrel。"}]}],"synonyms":["groom","stable boy","stablehand","varlet","knave"],"phonetic":"/ˈkɔɪstrəl/","extraExplanation":["这个词在现代英语里非常少见，多出现在中世纪背景的文学、历史文本或仿古风格（historical/fantasy writing）中。","词义常从“马厩仆役/马夫”引申为“卑贱之人”，所以在语境里可能既是职业称呼，也可能是带轻蔑色彩的辱骂；遇到时要结合上下文判断。"]}
{"word":"coistrels","summary":{"en":"“Coistrels” is the plural of the archaic noun “coistrel,” meaning a contemptible person or a low-ranking servant.","zh":"“coistrels”是古词“coistrel”的复数，可指可鄙的人（无赖、恶棍）或地位低下的仆从/跟班。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) a low, rude, or dishonest person; a contemptible fellow (like “knave” or “scoundrel”).","zh":"（古义）卑鄙粗鲁或不诚实的人；可鄙的家伙（类似“无赖/恶棍”）。"},"examples":[{"en":"“You coistrel!” he shouted, using an old-fashioned insult.","zh":"“你这无赖！”他喊道，用的是一种很古老的骂人说法。"},{"en":"In some older stories, a coistrel is a petty troublemaker on the road.","zh":"在一些较老的故事里，coistrel 指在路上惹事生非的小混混。"}]},{"partOfSpeech":"n.","definition":{"en":"(Archaic) a low-ranking servant or follower, especially one considered clumsy or uncouth.","zh":"（古义）地位低下的仆从/跟班（常带“笨拙、粗鄙”的贬义）。"},"examples":[{"en":"The lord dismissed the coistrel for his careless manners.","zh":"领主因他举止粗鄙而辞退了那个跟班。"},{"en":"He began as a coistrel before rising to a better position.","zh":"他起初只是个低等随从，后来才有了更好的地位。"}]}],"synonyms":["knave","scoundrel","rascal","miscreant","lout"],"phonetic":"ˈkɔɪstrəl","extraExplanation":["你输入的 **coistrels** 多半是 **coistrel** 的复数形式（= coistrels）。这个词在现代英语里非常少见，更多出现在中古/早期现代英语语境中，带有强烈贬义。","在文学或戏剧台词里，它常作为“古风辱骂”出现，用来营造年代感（类似中文的“竖子/小人/无赖”一类的语气）。阅读时更重要的是抓住“轻蔑、看不起对方”的情绪色彩。"]}
{"word":"coistril","summary":{"en":"Coistril is an archaic noun meaning either a groom (horse attendant) or, more commonly, a contemptible person.","zh":"coistril 是一个古旧名词，可指“马夫/照料马的仆役”，更常见的引申义是“卑鄙可鄙的人（侮辱语）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rude, contemptible person; a knave (old-fashioned/archaic insult)","zh":"粗鲁卑鄙的人；无赖（古旧/文雅的侮辱语）"},"examples":[{"en":"He called the man a coistril and refused to speak to him again.","zh":"他骂那人是个 coistril，从此不再跟他说话。"},{"en":"In the old story, the coistril tricks the villagers with lies.","zh":"在这则旧故事里，那个无赖用谎言欺骗村民。"}]},{"partOfSpeech":"n.","definition":{"en":"a groom or servant who takes care of horses (historical use)","zh":"马夫；照料马匹的仆役（历史用法）"},"examples":[{"en":"The coistril led the horses back to the stable after the ride.","zh":"骑行结束后，马夫把马牵回马厩。"},{"en":"A coistril waited outside the inn, holding the reins.","zh":"一个马夫在旅店外等着，手里牵着缰绳。"}]}],"synonyms":["knave","scoundrel","wretch","lowlife","groom","stablehand"],"phonetic":"/ˈkɔɪstrəl/","extraExplanation":["这是一个非常古老、带有文学/历史色彩的词，现代英语里几乎不用；更常见的表达是 insult 用语如 “jerk / scoundrel / lowlife”，或职业用语 “groom / stablehand”。","词源大致与中古法语有关，早期含义偏向“马房里工作的低级仆役”，后来引申为带轻蔑意味的“卑鄙之人”。在莎士比亚等早期英语文学中能见到类似用法。"]}
{"word":"coistrils","summary":{"en":"“Coistrils” is an archaic word meaning “nostrils,” and in very old usage it can also be an insult.","zh":"“coistrils”是古义词，主要指“鼻孔”；在更古老用法中也可作旧式侮辱语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) nostrils; the openings of the nose (usually used in the plural).","zh":"（古义）鼻孔；鼻子的开口（通常用复数）。"},"examples":[{"en":"The smoke stung his coistrils as he ran from the fire.","zh":"他从火场跑出来时，烟熏得他鼻孔刺痛。"},{"en":"In old texts, “coistrils” simply means “nostrils.”","zh":"在古老的文本里，“coistrils”就是“nostrils（鼻孔）”的意思。"}]},{"partOfSpeech":"n.","definition":{"en":"(Very rare, old-fashioned insult) a base or contemptible person; sometimes connected with the idea of a “groom” or low servant in older usage.","zh":"（非常少见、旧式侮辱）卑鄙的人；在较早用法中有时与“马夫/低等仆役”的形象相关。"},"examples":[{"en":"He called the man a “coistril,” using an old insult from earlier English.","zh":"他用早期英语里的旧式骂人话称那人是“coistril”。"}]}],"synonyms":["nostrils","nares (formal)"],"phonetic":"/ˈkɔɪstrəl/","extraExplanation":["“coistrils/​coistrils”属于古英语/早期现代英语词汇，今天几乎不用于日常英语；更常见、最直接的现代对应词是“nostrils（鼻孔）”。","这个词在莎士比亚等早期作品里偶尔出现，读到时一般按“鼻孔”理解即可；若用于骂人，则属于非常古旧的侮辱语气，现代写作中多用于模仿古风或文学效果。","你输入的“coistrils”通常被视为复数形式；单数常见写法是“coistril”。"]}
{"word":"Coit","summary":{"en":"“Coit” is mainly a proper name (surname/place name); as a common word, it has a rare old meaning “to throw/cast.”","zh":"“Coit”主要用作专有名词（姓氏/地名）；作为普通词时有罕见的古义“投掷/掷出”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a surname (family name); also used in some place and building names (e.g., Coit Tower in San Francisco)","zh":"姓氏；也常用于地名或建筑名（如旧金山的 Coit Tower 科伊特塔）"},"examples":[{"en":"She met a historian named Dr. Coit.","zh":"她遇到了一位名叫科伊特博士的历史学家。"},{"en":"Coit Tower is a popular viewpoint in San Francisco.","zh":"科伊特塔是旧金山很受欢迎的观景点。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare, archaic) to throw or cast something; related to the old game “quoits” (throwing rings at a target)","zh":"（罕见，古义）投掷；与传统游戏“quoits（掷环/掷铁圈）”有关"},"examples":[{"en":"In older texts, you may see “coit” used for throwing a ring in a game.","zh":"在较老的文本中，你可能会看到 coit 用来表示在游戏中投掷圆环。"}]}],"synonyms":["(archaic verb) throw","cast"],"phonetic":"/kɔɪt/","extraExplanation":["“Coit”在现代英语里最常见的是专有名词（姓氏/地名），本身不太作为普通词汇使用。","“Coit Tower（科伊特塔）”以 Lillie Hitchcock Coit 命名，她是旧金山的慈善家；这座塔因壁画与城市景观而知名。"]}
{"word":"coit","summary":{"en":"“Coit” is a formal term meaning sexual intercourse, mainly used in medical or legal contexts.","zh":"“coit”是指“性交/性行为”的正式用语，主要见于医学或法律语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Formal) sexual intercourse; the act of having sex.","zh":"（正式/书面）性交；性行为。"},"examples":[{"en":"In medical writing, “coit” is a formal term for sexual intercourse.","zh":"在医学写作中，coit 是指“性交”的正式用语。"},{"en":"Some legal documents use the word “coit” when describing sexual acts.","zh":"一些法律文件会用 coit 来描述性行为。"}]},{"partOfSpeech":"v.","definition":{"en":"(Very rare, formal) to have sexual intercourse.","zh":"（很少用/正式）发生性行为；进行性交。"},"examples":[{"en":"The verb form is uncommon; most writers use “have sex” or “have intercourse.”","zh":"动词用法并不常见；多数写作者会用 “have sex” 或 “have intercourse”。"}]}],"synonyms":["sexual intercourse","intercourse","coitus","have sex"],"phonetic":"/kɔɪt/","extraExplanation":["“coit”常见于较旧的医学或法律语境；日常英语里一般不会说 coit，更自然的是 “have sex / have intercourse”。","它与拉丁语来源的词 “coitus” 意义接近；“coitus”也更常见于医学语境。使用时注意场合和语气，避免在不合适的情境里显得生硬或冒犯。"]}
{"word":"coital","summary":{"en":"“Coital” is a formal/medical adjective meaning “related to sexual intercourse.”","zh":"“coital”是偏正式、医学语境的形容词，意思是“与性交有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to sexual intercourse; used mainly in medical, biological, or formal writing.","zh":"与性交有关的；多用于医学、生物学或正式语境。"},"examples":[{"en":"The study measured coital frequency among adult couples.","zh":"该研究测量了成年伴侣的性交频率。"},{"en":"Some infections can be transmitted through coital contact.","zh":"有些感染可通过性交接触传播。"}]}],"synonyms":["sexual","intercourse-related","copulatory"],"phonetic":"/ˈkɔɪtəl/","extraExplanation":["“coital”语域偏正式、医学化；日常英语里更常用 “sexual” 或直接说 “intercourse” 来表达相近意思。","词源来自拉丁语 *coitus*（意为“交合、同床”），在学术文章、临床记录、性健康教育材料中较常见。"]}
{"word":"coitally","summary":{"en":"“Coitally” is an adverb meaning “in relation to sexual intercourse” or “during sexual intercourse,” used mainly in medical or formal contexts.","zh":"“coitally”是副词，意为“与性交有关/在性交过程中”，主要用于医学或正式语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to sexual intercourse; during sexual intercourse.","zh":"以与性交有关的方式；在性交过程中。"},"examples":[{"en":"The medication should not be used coitally unless your doctor advises it.","zh":"除非医生建议，否则这种药物不应在性交过程中使用。"},{"en":"Some infections can be transmitted coitally.","zh":"有些感染可能在性交过程中传播。"}]}],"synonyms":["sexually","during sex","in relation to intercourse"],"phonetic":"/ˈkɔɪtəli/","extraExplanation":["“coitally”来自名词“coitus”（性交），词源可追溯到拉丁语 coitus，原意是“聚集、结合”，在医学语境中专指“性交”。这个副词多见于医学、健康教育或法律文本中，日常口语更常用 “during sex / sexually”。"]}
{"word":"coition","summary":{"en":"“Coition” is a formal or medical word for sexual intercourse; in biology it can also mean mating/copulation.","zh":"“coition”是指性交的正式或医学用语；在生物学语境中也可指交配/交媾。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"sexual intercourse (a formal or medical term).","zh":"性交；性行为（较正式或医学用语）。"},"examples":[{"en":"The report uses the term “coition” to describe sexual intercourse in a clinical way.","zh":"这份报告用“coition”这个词以临床/医学的方式描述性交。"},{"en":"In many texts, “coition” appears in discussions of reproduction and sexual health.","zh":"在许多文章中，“coition”常出现在有关生殖与性健康的讨论里。"}]},{"partOfSpeech":"n.","definition":{"en":"(Biology) mating or copulation, especially in animals.","zh":"（生物）交配；交媾（尤指动物）。"},"examples":[{"en":"Researchers observed coition behavior in the species during spring.","zh":"研究人员观察到该物种在春季的交配行为。"}]}],"synonyms":["sexual intercourse","intercourse","copulation","mating"],"phonetic":"/ˈkoʊ.ɪ.ʃən/","extraExplanation":["“coition”在日常英语里不常用，更多见于医学、法律、学术写作。一般口语更常用“sex”或“sexual intercourse”（更中性/明确）。","词源来自拉丁语 coire，意为“聚在一起、结合”，因此带有较明显的“正式/书面”语气。"]}
{"word":"coitional","summary":{"en":"“Coitional” means “related to sexual intercourse,” mostly used in medical/formal contexts.","zh":"“coitional”表示“与性交有关的”，多见于医学或正式语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to sexual intercourse (coition); used mainly in medical or formal writing.","zh":"与性行为（性交）有关的；主要用于医学或正式语境。"},"examples":[{"en":"The doctor asked about coitional pain to help diagnose the problem.","zh":"医生询问是否有性交疼痛，以帮助诊断问题。"},{"en":"Some infections can cause bleeding during or after coitional activity.","zh":"一些感染可能导致性交过程中或之后出血。"}]}],"synonyms":["coital","sexual (more general)"],"phonetic":"/kɔɪˈʃənəl/","extraExplanation":["“coitional”来自名词“coition”（性交），常见于医学、心理学或法律文本中；在日常英语里更常用“sexual”或“during/after sex”等更通俗的表达。","拼写提醒：该词较少见，容易被误拼；如果你本来想查的是“cognitive / cognitional（认知的）”或“coital（性交的）”，告诉我语境我可以一起区分。"]}
{"word":"coitions","summary":{"en":"“Coitions” is the plural of “coition,” a formal/medical term for sexual intercourse.","zh":"“Coitions”是“coition”的复数，指性交/性行为，属于较正式或医学用语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"sexual intercourse (a formal or medical word).","zh":"性交；性行为（较正式或医学用语）。"},"examples":[{"en":"The report used the term “coition” to describe sexual intercourse.","zh":"报告用“coition”这个词来描述性交。"},{"en":"In medical writing, coition may be discussed in relation to fertility and contraception.","zh":"在医学写作中，coition 常用于讨论生育与避孕相关问题。"}]}],"synonyms":["sexual intercourse","sex (less formal)","copulation (formal)"],"phonetic":"/kɔɪˈʃən/","extraExplanation":["“coition”是比较正式、偏医学/法律语境的词，日常英语更常说“sex”或“sexual intercourse”。在不同文化与场合中，谈论性话题可能较敏感；正式写作中用该词可显得更中性、客观。","词源来自拉丁语“coitio”，与动词“coire”（意为“走到一起、结合”）有关，因此带有“结合、交合”的含义。"]}
{"word":"coitophobia","summary":{"en":"Coitophobia means a strong, sometimes debilitating fear of sexual intercourse.","zh":"Coitophobia 指对性行为（性交）的强烈、甚至影响生活的恐惧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an intense fear of sexual intercourse (a specific phobia)","zh":"对性行为（性交）的强烈恐惧（特定恐惧症）"},"examples":[{"en":"He avoided dating because of coitophobia and felt anxious when intimacy was mentioned.","zh":"因为有性交恐惧症，他回避约会，一提到亲密关系就感到焦虑。"},{"en":"Therapy helped her manage coitophobia and communicate her boundaries clearly.","zh":"心理治疗帮助她缓解性交恐惧症，并更清楚地表达自己的界限。"}]}],"synonyms":["fear of sex","sexual phobia","genophobia"],"phonetic":"/ˌkɔɪtəˈfoʊbiə/","extraExplanation":["这是一个医学/心理学用语，来自拉丁语词根：coitus（性交）+ -phobia（恐惧）。日常英语里更常用更委婉的说法是 “fear of sex” 或 “fear of intimacy（对亲密关系的恐惧）”，具体用哪个取决于害怕的是“性行为本身”还是“亲密关系”。","在真实交流中，这类词可能涉及隐私与创伤经历，使用时要注意语境与对方感受；在医疗或心理咨询场景中使用更合适。"]}
{"word":"coiture","summary":{"en":"Couture means high-end, often custom-made fashion (especially haute couture).","zh":"Couture 指高端时装，常指高级定制（haute couture）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"High-end fashion design and dressmaking, especially clothes made to order by top fashion houses (often called “haute couture”).","zh":"（尤指“高级定制”）高端时装设计与制衣；通常指由顶级时装屋为个人量身定做的服装。"},"examples":[{"en":"She dreams of working in couture in Paris one day.","zh":"她梦想有一天去巴黎从事高级时装（couture）工作。"},{"en":"The dress looks like couture—every detail is carefully finished.","zh":"这条裙子看起来像高级定制——每个细节都处理得很精致。"},{"en":"Couture pieces are often made by hand and take many hours to complete.","zh":"高级定制服装往往是手工制作的，需要很多小时才能完成。"}]},{"partOfSpeech":"n.","definition":{"en":"A fashion house or the couture industry as a whole.","zh":"（集合名词）时装屋（圈）；高级时装行业。"},"examples":[{"en":"Several members of the couture showed their collections this week.","zh":"本周有几家高级时装屋展示了他们的系列作品。"},{"en":"In couture, fabric choice matters as much as the silhouette.","zh":"在高级时装行业里，面料选择和廓形同样重要。"}]}],"synonyms":["high fashion","haute couture","dressmaking"],"phonetic":"/kuːˈtʊr/","extraExplanation":["你输入的 **coiture** 常见是把 **couture** 拼错了。英语里更常见的固定搭配是 **haute couture**（法语，意为“高级定制”）。","在法国，“haute couture（高级定制）”有相对严格的行业标准与资格要求（例如为私人客户量身制作、在巴黎设有工坊、达到一定数量的手工制作与发布规范等）。日常英语里也常把 couture 泛指“非常高级、精致的时装”。"]}
{"word":"coitus","summary":{"en":"Coitus is a formal/medical noun meaning sexual intercourse.","zh":"coitus 是表示“性交/性行为”的正式或医学名词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"sexual intercourse (a formal or medical term, often used in clinical, legal, or academic contexts).","zh":"性交；性行为（较正式或医学用语，常见于临床、法律或学术语境）。"},"examples":[{"en":"The doctor asked whether the patient had pain during coitus.","zh":"医生询问病人在性交时是否疼痛。"},{"en":"Some medications may affect comfort during coitus.","zh":"某些药物可能会影响性交时的舒适度。"}]}],"synonyms":["sexual intercourse","intercourse","sex"],"phonetic":"/ˈkoʊ.ɪ.təs/","extraExplanation":["语体提示：coitus 属于非常正式、偏医学/法律的词；日常英语里更常用 sex 或 sexual intercourse。因为话题较私密，使用时要注意场合与对象。"]}
{"word":"coituses","summary":{"en":"“Coituses” is the plural of “coitus,” meaning acts of sexual intercourse; it’s mainly used in formal or medical contexts.","zh":"“coituses”是“coitus”的复数，指多次性交行为，主要用于正式或医学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “coitus”: acts of sexual intercourse (a formal/medical term).","zh":"“coitus”的复数：性交行为（较正式/医学用语）。"},"examples":[{"en":"The study recorded the number of coituses reported by participants each month.","zh":"该研究记录了参与者每月报告的性交次数。"},{"en":"Some surveys ask about coituses to understand pregnancy risk.","zh":"一些调查会询问性交次数，以了解怀孕风险。"}]}],"synonyms":["sexual intercourse","sex (more common in everyday speech)","copulation (formal/biology)"],"phonetic":"/ˈkɔɪtəs/","extraExplanation":["“coitus”属于医学、法律或学术语域，日常英语更常说“sex”或“sexual intercourse”。在一般对话中直接用“coituses”可能显得生硬或过于正式。","复数形式“coituses”多见于研究报告、统计表、临床记录等语境，用来表示“次数/发生的行为”。"]}
{"word":"Coix","summary":{"en":"Coix is a botanical genus best known for Job’s tears, a grass grown for its bead-like, edible seeds.","zh":"Coix 指薏苡属，最常与“薏米/薏苡仁（Job’s tears）”相关：一种结出珠状可食种子的禾本科植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of grasses, best known for the species called Job’s tears, whose hard, bead-like seeds are used for food and sometimes for decoration.","zh":"薏苡属（禾本科的一属），最知名的是“薏苡仁/薏米（Job’s tears）”这一类植物；其坚硬、珠状的种子可食用，也常被用作装饰或串珠。"},"examples":[{"en":"Coix is cultivated in some parts of Asia for its edible grain, often called Job’s tears.","zh":"薏苡属植物在亚洲一些地区被栽培作粮食，其籽粒常被称为“薏米/薏苡仁（Job’s tears）”。"},{"en":"The seeds of Coix lacryma-jobi can be strung into beads for crafts.","zh":"薏苡（Coix lacryma-jobi）的种子可以串成珠子，用来做手工艺品。"}]}],"synonyms":["Job’s tears","Coix lacryma-jobi"],"phonetic":"/kɔɪks/","extraExplanation":["“Coix”是拉丁学名（属名），日常英语里更常见的是具体植物名“Job’s tears”。","在中文语境中，常见对应是“薏苡（yì yǐ）”；其可食用的籽粒称“薏米/薏仁/薏苡仁”。在一些饮食与传统文化中，薏米常被煮粥、煲汤或做甜品。","词源提示：Job’s tears（“约伯的眼泪”）来自《圣经》中约伯（Job）的名字，形容其种子外壳像泪滴形。"]}
{"word":"coix","summary":{"en":"Coix is the scientific name for a group of grasses, especially Job’s tears (adlay), whose seeds are used for food or beads.","zh":"Coix 指薏苡属，尤指薏仁/薏米（Job’s tears, adlay），其种子可食用或用于串珠。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of Asian grasses, especially the plant known as Job’s tears (Coix lacryma-jobi), whose hard seeds are used for beads and whose grains are sometimes eaten (also called adlay)","zh":"薏苡属（亚洲的一类禾本科植物），尤指“薏苡/薏仁”（Job’s tears），其坚硬种子可作珠子，籽粒也可食用（又称 adlay）"},"examples":[{"en":"In some Asian cuisines, coix (Job’s tears) is cooked like rice or barley.","zh":"在一些亚洲菜系里，coix（薏苡/薏仁，Job’s tears）会像米或大麦一样煮来吃。"},{"en":"The seeds of coix are sometimes used to make simple bracelets and ornaments.","zh":"coix 的种子有时会被用来做简单的手串和装饰品。"}]}],"synonyms":["Job’s tears","adlay","coix seed"],"phonetic":"/kɔɪks/","extraExplanation":["“Coix”是拉丁学名（属名），日常英语里更常说 Job’s tears 或 adlay。若你在食品包装上看到“coix seed / coix grain”，通常就是指“薏仁/薏米”。","Job’s tears 这个英文名来自《圣经》中约伯（Job）的“眼泪”意象，因为它的种子常呈泪滴状、外壳光亮坚硬。","在中英文语境里，“coix”更多出现在植物学、成分表或学术写作中；日常点餐或购物，用 Job’s tears / adlay 往往更容易被理解。"]}
{"word":"coixseed","summary":{"en":"Coixseed is the edible seed of the coix plant (Job’s tears), used in cooking and traditional herbal contexts.","zh":"Coixseed 指薏苡的种子（薏米/薏仁），常用于烹饪，也常出现在传统草本语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The seed (grain) of the coix plant (Job’s tears), used as food and also in herbal medicine.","zh":"薏苡的种子（也叫“薏米 / 薏仁 / 薏苡仁”，英文常称 Job’s tears），可作食物，也常用于草本/传统药用。"},"examples":[{"en":"In many Asian grocery stores, you can buy coixseed to cook in porridge or soup.","zh":"在很多亚洲超市里，你可以买到薏米（coixseed）来煮粥或煲汤。"},{"en":"Some people drink coixseed tea as a traditional wellness drink.","zh":"有些人会喝薏米茶作为传统的养生饮品。"}]}],"synonyms":["Job’s tears","coix seed","adlay (seed)"],"phonetic":"/ˈkoʊɪks siːd/","extraExplanation":["“coixseed”在英文里较少用作日常词，更常见的说法是“Job’s tears”（也可写作“Job’s-tears”）或“coix seed”。","中文里常见名称包括“薏米、薏仁、薏苡仁”。在饮食文化中常被用来煮糖水、粥品或与红豆等搭配；在传统草本语境中也会被提到。","拼写提示：有时会写成两个词“coix seed”。在正式或商品标签上也可能见到植物学名相关表述（如 Coix lacryma-jobi）。"]}

