{"word":"cojoin","summary":{"en":"“Cojoin” means to join together or unite; it’s a rare word today and often replaced by “conjoin” or “join.”","zh":"“cojoin”意为“结合、联合、连接”，但现代英语中较少用，常被“conjoin”或“join”等替代。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to join together; to unite or connect (often used like “conjoin,” and relatively rare in modern English).","zh":"（使）结合在一起；联合；连接（用法类似 conjoin，但在现代英语中较少见）。"},"examples":[{"en":"The report aims to cojoin data from hospitals and clinics into one system.","zh":"这份报告旨在把医院和诊所的数据合并到同一系统中。"},{"en":"Two rivers cojoin near the old bridge.","zh":"两条河在老桥附近汇合。"}]},{"partOfSpeech":"vt.","definition":{"en":"to join (two things) together; to connect closely.","zh":"把（两样东西）连接起来；使紧密结合。"},"examples":[{"en":"Engineers cojoined the two pipes to prevent leaks.","zh":"工程师把两根管道接在一起以防漏水。"}]}],"synonyms":["conjoin","join","unite","combine","link"],"phonetic":"/koʊˈdʒɔɪn/","extraExplanation":["“cojoin”在现代英语里比较少见，更常用的是“conjoin / join / unite / combine”。在正式写作中，除非你是在引用旧文献或刻意追求古典风格，一般建议用“conjoin”或更常见的词来表达。","词形上可理解为前缀“co-（共同）”+“join（连接）”，含义直观：共同连接、合并在一起。"]}
{"word":"cojoined","summary":{"en":"“Cojoined” means joined together or closely united (often formal).","zh":"“cojoined”表示“连接在一起的；紧密结合的”（偏正式用法）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Joined together; connected or linked as one unit.","zh":"连接在一起的；结合成一体的。"},"examples":[{"en":"The two rooms are cojoined by a wide archway.","zh":"两个房间通过一个宽拱门连在一起。"},{"en":"Their cojoined efforts helped the team finish the project on time.","zh":"他们的共同努力帮助团队按时完成了项目。"}]},{"partOfSpeech":"v.","definition":{"en":"Past participle of “cojoin”: to join or unite closely.","zh":"动词“cojoin”的过去分词：使紧密连接；使结合。"},"examples":[{"en":"The paths were cojoined near the river and continued as one trail.","zh":"这些小路在河边汇合，之后变成一条路。"}]}],"synonyms":["joined","connected","united","linked","combined"],"phonetic":"/koʊˈdʒɔɪnd/","extraExplanation":["“cojoined”较常见于较正式或书面语；日常表达里更常用“joined / connected”。","容易与“conjoined”混淆：医学上常说“conjoined twins（连体双胞胎）”。“cojoined”一般表示“共同连接/并合”，但“conjoined”在固定搭配中更常见。"]}
{"word":"cojoins","summary":{"en":"“cojoins” means “joins or connects together.”","zh":"“cojoins”表示“把……连接/结合在一起”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Third-person singular) to join or link two or more things together; to connect as parts of one whole.","zh":"（第三人称单数）把两个或多个事物连接/结合在一起；使成为一个整体。"},"examples":[{"en":"The new bridge cojoins the two sides of the river.","zh":"这座新桥把河的两岸连接在一起。"},{"en":"A hallway cojoins the kitchen and the dining room.","zh":"一条走廊把厨房和餐厅连在一起。"}]}],"synonyms":["joins","connects","links","unites","conjoins"],"phonetic":"/koʊˈdʒɔɪnz/","extraExplanation":["“cojoin”比较少见，更常用的表达是“join / connect / link”。在较正式或技术性的语境中（如法律、工程、学术写作）可能会见到，用来强调“共同连接、并合”。","拼写上与“conjoin（结合；并合）”很接近；日常英语里“conjoin”比“cojoin”更常见。注意不要把它当成名词使用。"]}
{"word":"cojones","summary":{"en":"A vulgar slang word meaning “testicles,” and by extension “courage/nerve.”","zh":"一个粗俗俚语，字面指“睾丸”，引申指“胆量/魄力”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(vulgar slang) Testicles; a crude word borrowed from Spanish.","zh":"（粗俗俚语）睾丸；从西班牙语借来的粗口说法。"},"examples":[{"en":"That word is vulgar—don’t say it at work or in class.","zh":"那个词很粗俗——在工作场合或课堂上别说。"},{"en":"The movie used a lot of crude language, including “cojones.”","zh":"那部电影用了很多粗口，其中就有“cojones”。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, vulgar) Courage or nerve; boldness (often in phrases like “have the cojones”).","zh":"（非正式，粗俗）胆量、魄力；敢作敢当（常见于短语“have the cojones”）。"},"examples":[{"en":"She had the cojones to speak up in the meeting.","zh":"她有胆量在会上直言不讳。"},{"en":"It takes cojones to admit you were wrong.","zh":"承认自己错了需要勇气。"}]}],"synonyms":["guts","nerve","backbone","balls (vulgar)"],"phonetic":"/koʊˈhoʊneɪz/","extraExplanation":["这个词在英语里通常被当作“粗俗/带攻击性”的俚语使用，语气更像男性化的挑衅或逞强。正式场合（工作、学校、公开演讲）一般不建议使用。","在西班牙语原意就是“睾丸”，英语里常被引申为“胆量”。若想更中性表达，可以用“courage / guts / nerve / backbone”。"]}
{"word":"cojudge","summary":{"en":"“Cojudge” means a fellow judge (co-judge) or the act of judging together, but it’s relatively uncommon in everyday English.","zh":"“cojudge”可指“同席法官/共同评委”，也可作动词表示“共同裁判/共同评审”，但在日常英语中较少见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A judge who serves together with another judge on the same case; a fellow judge (often written as “co-judge”).","zh":"与另一位法官共同审理同一案件的法官；同席法官（常写作“co-judge”）。"},"examples":[{"en":"The cojudge agreed with the final ruling.","zh":"同席法官同意最终裁决。"},{"en":"She served as co-judge in the international tribunal.","zh":"她在国际法庭担任同席法官。"}]},{"partOfSpeech":"v.","definition":{"en":"To judge or decide something together with another judge; to act as a joint judge.","zh":"与他人共同裁判；共同担任审判者并作出决定。"},"examples":[{"en":"Two experts will cojudge the competition.","zh":"两位专家将共同担任比赛评委并评分。"},{"en":"They cojudged the case and issued a shared opinion.","zh":"他们共同审理该案并发表联合意见。"}]}],"synonyms":["co-judge","fellow judge","joint judge","judge together"],"phonetic":"/ˌkoʊˈdʒʌdʒ/","extraExplanation":["“cojudge / co-judge”在现代英语中比较少见，更常见的法律写法是“co-judge”（带连字符）或更通用的表达如“a judge on the panel / a fellow judge”。","在比赛语境里，口语和写作中更自然的说法通常是“co-judge (a show)”或直接说“judge together / be a judge together”。"]}
{"word":"cojudices","summary":{"en":"“Prejudices” means unfair negative judgments or stereotypes about people or groups; it can also mean causing such bias.","zh":"“Prejudices”指对人或群体不公平的负面判断/刻板印象；也可指使人产生这种偏见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of prejudice) Unfair or unreasonable dislike or judgment of a person or group, often based on stereotypes rather than facts.","zh":"（prejudice 的复数）偏见；成见：对某人或某群体不公平、缺乏根据的反感或判断，常基于刻板印象而非事实。"},"examples":[{"en":"We should challenge prejudices against people from different cultures.","zh":"我们应该挑战对不同文化背景人群的偏见。"},{"en":"Her decision was influenced by old prejudices.","zh":"她的决定受到了旧有成见的影响。"},{"en":"Prejudices can make it hard to see the truth.","zh":"偏见会让人难以看清真相。"}]},{"partOfSpeech":"vt.","definition":{"en":"To cause someone to have a negative opinion unfairly; to bias someone against another person or idea.","zh":"使产生偏见；使（某人）带着不公平的负面看法；使偏向（不利于某人或某观点）。"},"examples":[{"en":"One bad rumor can prejudice people against a new coworker.","zh":"一个坏谣言就可能让大家对新同事产生偏见。"},{"en":"Try not to let one experience prejudice your judgment.","zh":"尽量别让一次经历影响（使偏向）你的判断。"}]}],"synonyms":["biases","preconceptions","stereotypes"],"phonetic":"/ˈprɛdʒədɪs/","extraExplanation":["你输入的“cojudices”不是常见英语单词，最可能是拼写错误，想写的是“prejudices”（偏见，prejudice 的复数）。","易混词：bias（偏向/偏见，较中性，可有“无意识倾向”之意）；discrimination（歧视，强调“行为/对待方式”的不公平）。prejudice 更强调“先入为主的看法/态度”。","常见搭配：racial prejudices（种族偏见）、prejudices against ...（对……的偏见）、overcome prejudices（克服偏见）。"]}
{"word":"cojuror","summary":{"en":"A cojuror is someone who swears an oath together with another person, mainly in older legal contexts.","zh":"cojuror 指与他人共同宣誓的人，主要见于较旧的法律语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who takes an oath together with someone else, especially in older legal or formal contexts (an “oath-helper” who supports another person’s claim by swearing it is true).","zh":"与他人一起宣誓的人，尤指较旧的法律/正式语境中为他人作“誓言担保”的人（通过共同宣誓来支持对方的主张）。"},"examples":[{"en":"In some medieval courts, an accused person could bring cojurors to swear to his good character.","zh":"在一些中世纪法庭上，被告可以带来 cojurors 一起宣誓证明其品行良好。"},{"en":"The historian noted that the practice of using cojurors gradually disappeared as evidence rules changed.","zh":"历史学者指出，随着证据规则变化，使用 cojurors 的做法逐渐消失。"}]}],"synonyms":["oath-helper","compurgator"],"phonetic":"/ˌkoʊˈdʒʊrɚ/","extraExplanation":["这个词由 co-（“共同”）+ juror（与拉丁语 iurare“宣誓”相关）构成，但它通常不是“陪审员同伴”的意思；更常见的历史含义是“与当事人一起宣誓作证的人”。","在英格兰早期法律中，与其说 cojuror 是“证人”，不如说是“宣誓担保人”：他们的宣誓用来支持当事人的信誉。现代司法更依赖书证、物证与证人证言，因此该制度基本被淘汰，词也较罕见。"]}
{"word":"cojusticiar","summary":{"en":"A cojusticiar is one of two people who jointly held the high medieval office of justiciar (royal chief judge/administrator).","zh":"cojusticiar 指与他人共同担任中世纪“justiciar（王室最高司法/行政官）”的人，即共任司法长官之一。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who shares the role of a justiciar (a high royal judge/administrator), especially in medieval England or Scotland; one of two joint justiciars","zh":"（尤指中世纪英格兰或苏格兰的）共任大法官/司法长官之一；与他人共同担任高级王室司法与行政官的人"},"examples":[{"en":"In some medieval kingdoms, the king appointed two cojusticiars to share the workload of royal justice.","zh":"在一些中世纪王国里，国王会任命两位共任司法长官来分担王室司法事务。"},{"en":"The chronicle mentions that the cojusticiar traveled with the court to hear disputes.","zh":"编年史提到，这位共任司法长官随宫廷巡行以审理纠纷。"}]}],"synonyms":["joint justiciar","co-justiciar (hyphenated)"],"phonetic":"/ˌkoʊ dʒʌˈstɪʃiər/","extraExplanation":["“Justiciar”是中世纪常见的官职名称，既涉及司法（主持审理、监督法庭），也常带有行政与财政管理色彩；“co-”表示“共同、联合”，因此cojusticiar多指两人并任、分掌权力或分区治理的安排。","该词主要见于历史研究、学术写作或译注中，现代日常英语几乎不用；写作时也常见连字符形式“co-justiciar”。"]}

