{"word":"ConA","summary":{"en":"ConA is short for concanavalin A, a lectin used in biology to bind sugars and stimulate T cells.","zh":"ConA是刀豆凝集素A（concanavalin A）的缩写，一种在生物学中用于结合糖类并刺激T细胞的凝集素。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Concanavalin A; a plant protein (lectin) used in biology to bind certain sugars and to stimulate immune T cells in experiments.","zh":"刀豆凝集素A；一种植物蛋白（凝集素），在生物学中常用于结合特定糖类，并在实验中刺激免疫T细胞。"},"examples":[{"en":"In the lab, we used ConA to activate T cells before measuring cytokine levels.","zh":"在实验室里，我们用ConA激活T细胞，然后测量细胞因子水平。"},{"en":"ConA binds to specific sugars on the cell surface, so it can help researchers study cell membranes.","zh":"ConA能结合细胞表面的特定糖类，因此可以帮助研究者研究细胞膜。"}]}],"synonyms":["concanavalin A","Con A"],"phonetic":"/ˌkɑnˈeɪ/","extraExplanation":["“ConA”是“concanavalin A”的常见缩写，来源于刀豆（jack bean，学名 Canavalia ensiformis）中的一种凝集素。","在科研语境里它常被当作试剂名使用（像专有名词一样），例如“ConA stimulation / ConA-treated cells”。","注意：这不是日常英语词汇，主要出现在免疫学、细胞生物学、生物化学等文献或实验记录中。"]}
{"word":"conable","summary":{"en":"Conable is mainly a surname; it is not a common English vocabulary word.","zh":"Conable 主要是一个姓氏，并不是常见的英语词汇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surname (family name), most commonly seen as a proper noun (e.g., Barber B. Conable Jr.). It is not a standard vocabulary word in modern English.","zh":"一个姓氏（专有名词），最常见于人名（例如 Barber B. Conable Jr.）。它不是现代英语里的常用词汇。"},"examples":[{"en":"Barber Conable served as president of the World Bank in the 1980s.","zh":"Barber Conable 在20世纪80年代担任世界银行行长。"},{"en":"I saw the name Conable in a history article.","zh":"我在一篇历史文章里看到了 Conable 这个名字。"}]}],"phonetic":"/ˈkɑːnəbəl/","extraExplanation":["“Conable”在常见英英词典中通常不会作为普通词条出现，更常见的是姓氏（proper noun）。如果你是在句子里看到它、但上下文不像人名，有可能是拼写误差。","你可能想查的是这些更常见的词（请告诉我原句我可以帮你判断）：capable（有能力的）、cognizable（可被认识/可依法受理的）、consolable（可安慰的）、reasonable（合理的）。"]}
{"word":"conacaste","summary":{"en":"Conacaste is a large Central American shade tree known for its ear-shaped seed pods (also called guanacaste).","zh":"conacaste 指中美洲一种大型遮荫乔木，以“象耳”状豆荚著名（也叫 guanacaste）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large tropical Central American tree (Enterolobium cyclocarpum) with wide spreading branches and distinctive ear-shaped seed pods; also called the guanacaste or elephant-ear tree.","zh":"（中美洲的）康纳卡斯特树／瓜纳卡斯特树（学名 Enterolobium cyclocarpum），一种大型热带乔木，树冠开展、豆荚呈“象耳”状。"},"examples":[{"en":"We rested under a conacaste tree to escape the midday sun.","zh":"我们在一棵康纳卡斯特树下休息，躲避正午的太阳。"},{"en":"The conacaste’s curved pods littered the ground after the dry season.","zh":"旱季过后，康纳卡斯特树弯曲的豆荚散落一地。"}]}],"synonyms":["guanacaste","elephant-ear tree"],"phonetic":"/ˌkoʊnəˈkɑːsteɪ/","extraExplanation":["“conacaste”常见于中美洲西班牙语地区（如萨尔瓦多、洪都拉斯、尼加拉瓜等）的日常称呼；英语里也会直接借用这个词来指这种树。","该词源头可追溯到纳瓦特尔语（Nahuatl），与“耳朵/耳形”相关：这种树的荚果弯曲、像耳朵，因此在民间名称里常出现“耳”这一意象。","在部分地区，这种树因树荫很大而常被用作村庄集会或休息的“遮荫树”；在哥斯达黎加，“guanacaste”还是一个省名，并被视为具有象征意义的树种。"]}
{"word":"conacre","summary":{"en":"Conacre is an Irish term for short-term renting of small plots of land, often for one growing season.","zh":"Conacre 指（尤在爱尔兰）短期租用小块土地的制度或租约，通常只租一个种植季。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a system (or a short-term contract) for renting a small piece of land—especially in Ireland—usually for one season, often to grow potatoes or other crops","zh":"（尤指爱尔兰的）短期租地制度/短期租约：租用一小块土地，通常只租一个种植季，多用于种土豆等作物"},"examples":[{"en":"In 19th-century Ireland, many poor families relied on conacre to grow potatoes.","zh":"在19世纪的爱尔兰，许多贫困家庭依靠短期租地（conacre）来种土豆。"},{"en":"He rented two acres on conacre for the spring planting.","zh":"他以短期租地（conacre）的方式租了两英亩地来进行春季播种。"}]}],"synonyms":["short-term land lease","seasonal tenancy","plot rental"],"phonetic":"/kɑnˈeɪkər/","extraExplanation":["conacre 是爱尔兰历史语境里常见的词，和当地的土地制度、贫困与农业密切相关。它通常指“季节性、短期、按块租地”，租户往往缺乏长期保障，容易受到租金波动与歉收影响。","在讨论爱尔兰历史（例如19世纪农村社会、土地问题与大饥荒背景）时，你可能会在学术文章或历史叙述中遇到 conacre。日常现代英语里较少用，更偏历史/地区性用词。"]}
{"word":"ConAgra","summary":{"en":"ConAgra is a U.S. packaged-food company name (now Conagra Brands).","zh":"ConAgra 是一家美国包装食品公司的名称（现称 Conagra Brands）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a U.S. packaged-food company and brand owner (full name: Conagra Brands), known for frozen foods, snacks, and pantry staples.","zh":"一家美国的包装食品公司与品牌集团（全名：Conagra Brands），以冷冻食品、零食和常温食品等产品闻名。"},"examples":[{"en":"ConAgra (now Conagra Brands) owns several well-known grocery brands in the U.S.","zh":"ConAgra（现名 Conagra Brands）在美国拥有多个知名的食品杂货品牌。"},{"en":"She bought a frozen meal made by a ConAgra brand.","zh":"她买了一份由 ConAgra 旗下品牌生产的冷冻餐。"}]}],"synonyms":["Conagra Brands"],"phonetic":"/kənˈæɡrə/","extraExplanation":["“ConAgra”通常作为专有名词使用，指公司或其旗下品牌；在新闻或商业语境中也常写作“Conagra Brands”。","读音上很多人会把重音放在中间：/kənˈæɡrə/（类似“kuhn-AG-ruh”）。","名称来源与农业（agriculture）相关；公司历史上由与粮食/农产品贸易相关的企业发展而来，因此名字带有“Agra”的农业联想。"]}
{"word":"Conagra","summary":{"en":"Conagra is the name of a major American packaged-food company.","zh":"Conagra 是一家美国大型包装食品公司的名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a U.S. food company (Conagra Brands) that makes and sells packaged foods, such as frozen meals and snacks.","zh":"一家美国食品公司（Conagra Brands），生产并销售各类包装食品，如冷冻餐、零食等。"},"examples":[{"en":"Conagra Brands owns several well-known packaged food brands.","zh":"Conagra Brands 旗下拥有多个知名的包装食品品牌。"},{"en":"The product label says it was manufactured by Conagra.","zh":"产品标签上写着由 Conagra 生产。"}]}],"synonyms":["Conagra Brands"],"phonetic":"/kəˈnɑːɡrə/","extraExplanation":["“Conagra”是专有名词，通常指公司名称而不是普通词汇；在新闻、商业报道或食品包装信息中更常见。","公司正式名称常见写法为“Conagra Brands”。在日常口语里也有人直接说“Conagra”来指代这家公司。"]}
{"word":"Conah","summary":{"en":"Conah is usually a rare personal name, not a common English word.","zh":"Conah 通常是一个少见的人名，并非常见英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare given name (proper noun). It is not a standard English vocabulary word; it most often appears as a personal name or an uncommon spelling variant of similar names (e.g., Conan, Conor, or Noah).","zh":"一个较少见的英文人名（专有名词）。它不是常见的英语词汇，更常见于个人姓名，或作为相近名字（如 Conan、Conor、Noah）的不常见拼写变体。"},"examples":[{"en":"Conah introduced himself at the meeting.","zh":"Conah 在会议上做了自我介绍。"},{"en":"I’m not sure how to spell Conah—could you confirm it?","zh":"我不确定 Conah 怎么拼——你能确认一下吗？"}]}],"phonetic":"/ˈkoʊnə/","extraExplanation":["“Conah”在英语世界里并不常见，因此很多时候需要结合上下文判断：它可能是某个人的名字、网名，或家族/地区的特殊拼写。","如果你本来想查的是“Conan”（如 Conan O’Brien）或“Noah”（常见人名，源自《圣经》中的挪亚），告诉我正确拼写或句子语境，我可以给出更准确的词源、含义和用法。"]}
{"word":"Conakry","summary":{"en":"Conakry is the capital city of Guinea in West Africa.","zh":"Conakry 指西非国家几内亚的首都科纳克里。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The capital and largest city of Guinea, a major port city on the Atlantic coast of West Africa.","zh":"科纳克里：几内亚的首都和最大城市，位于西非大西洋沿岸的重要港口城市。"},"examples":[{"en":"Conakry is the capital of Guinea.","zh":"科纳克里是几内亚的首都。"},{"en":"The ship docked at the port of Conakry after crossing the Atlantic.","zh":"这艘船横渡大西洋后停靠在科纳克里的港口。"}]}],"synonyms":["Conakry, Guinea (in context)"],"phonetic":"/ˈkoʊnəˌkriː/","extraExplanation":["科纳克里是几内亚的政治与经济中心，官方语言环境以法语为主，但当地也常使用富拉语（Fula）、马林克语（Maninka）等多种民族语言。","在新闻与历史语境中，科纳克里常被提到与“西非港口城市”“几内亚独立后首都发展”等主题相关。"]}
{"word":"Conal","summary":{"en":"Conal means cone-shaped or related to a cone; it’s a less common alternative to conical or cone-shaped.","zh":"Conal 表示“圆锥形的”或“与圆锥有关的”，比 conical 或 cone-shaped 更少见、更偏正式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Shaped like a cone, or relating to a cone.","zh":"圆锥形的；与圆锥（体）有关的。"},"examples":[{"en":"The conal shell has a pointed tip and a wide base.","zh":"这种圆锥形的贝壳顶部尖、底部宽。"},{"en":"A conal candle burns more evenly as it narrows.","zh":"圆锥形蜡烛越往上越细，燃烧起来更均匀。"}]}],"synonyms":["conical","cone-shaped"],"phonetic":"/ˈkoʊnəl/","extraExplanation":["“conal”在日常英语中比较少见，更常用的说法是“cone-shaped”（圆锥形的）或“conical”（圆锥形的）。","词源上来自“cone（圆锥）+ -al（……的）”，常见于较正式或技术性的描述（如生物学、几何、工程语境）。"]}
{"word":"conal","summary":{"en":"Conal means cone-shaped or related to a cone; it is less common than conical.","zh":"conal 指“圆锥形的/与圆锥有关的”，但比 conical 少见。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Cone-shaped; relating to a cone.","zh":"圆锥形的；与圆锥有关的。"},"examples":[{"en":"The conal shell spirals into a pointed tip.","zh":"这个圆锥形的贝壳螺旋上升，末端尖尖的。"},{"en":"Doctors sometimes describe the cornea as having a slightly conal curvature in certain conditions.","zh":"在某些情况下，医生有时会描述角膜呈轻微的圆锥形弯曲。"}]}],"synonyms":["conical","cone-shaped","tapered"],"phonetic":"/ˈkoʊnəl/","extraExplanation":["“conal”较少见，更常用的同义词是“conical”。在科学或医学语境里偶尔会看到“conal”（如描述形状或结构），但日常英语里用“conical”更自然。"]}
{"word":"conalbumin","summary":{"en":"Conalbumin is an egg-white protein (ovotransferrin) that binds iron and helps protect the egg.","zh":"Conalbumin 是蛋清中的一种蛋白质（卵转铁蛋白），能结合铁离子并帮助保护鸡蛋。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A protein found in egg white (also called ovotransferrin) that binds iron and helps protect the egg by limiting bacterial growth.","zh":"蛋清中的一种蛋白质（也称卵转铁蛋白），能结合铁离子，通过“夺走”细菌所需的铁来帮助抑制细菌生长、保护鸡蛋。"},"examples":[{"en":"Conalbumin is one of the major proteins in egg white.","zh":"卵白蛋白（conalbumin）是蛋清中的主要蛋白质之一。"},{"en":"Because it binds iron, conalbumin can help slow down bacterial growth.","zh":"由于能结合铁离子，conalbumin 可以帮助减缓细菌生长。"}]}],"synonyms":["ovotransferrin","egg-white transferrin"],"phonetic":"/ˌkɑn.ælˈbjuː.mɪn/","extraExplanation":["Conalbumin 更常见的名称是 ovotransferrin（卵转铁蛋白），属于转铁蛋白家族（transferrin family）。它通过“螯合/结合铁”让微生物更难获得必需营养，从而起到天然的抗菌防御作用。","在食品科学与营养学文献中，这个词多出现在“鸡蛋过敏原”“蛋白质分离/分析”“抗菌活性”“蛋白结构与热稳定性”等话题里。日常英语中很少使用。"]}
{"word":"Conall","summary":{"en":"Conall is a male Irish Gaelic given name, mainly used in Ireland and Scotland.","zh":"Conall 是源自爱尔兰盖尔语的男性名字，主要用于爱尔兰和苏格兰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a masculine given name of Irish Gaelic origin; used as a personal name (especially in Ireland and Scotland).","zh":"（男子名）康纳尔：源自爱尔兰盖尔语的人名；主要在爱尔兰和苏格兰使用。"},"examples":[{"en":"Conall is an Irish name, and you may hear it in Ireland or among Irish families abroad.","zh":"Conall 是一个爱尔兰名字，你可能在爱尔兰或海外的爱尔兰家庭中听到。"},{"en":"Conall introduced himself politely at the meeting.","zh":"Conall 在会议上礼貌地做了自我介绍。"}]}],"synonyms":["Connell","Conor","Connor"],"phonetic":"/ˈkɑnəl/","extraExplanation":["“Conall”源自古爱尔兰语名字（常被解释为与“强大/勇猛”相关的含义）。在凯尔特传统故事与爱尔兰早期历史人物中也能见到这个名字，因此带有一定的文化与历史色彩。","英语里这种词属于“专有名词”（proper noun），通常首字母大写。发音在不同地区会有细微差别，但常见读法接近“CON-uhl”。"]}
{"word":"conamarin","summary":{"en":"“Conamarin” is most likely a misspelling of **coumarin**, a naturally occurring fragrant compound used in perfumery and sometimes associated with cinnamon and tonka beans.","zh":"“conamarin”很可能是 **coumarin（香豆素）** 的拼写误差：一种天然存在的芳香化合物，常用于香水等，并与肉桂、零陵香豆等有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fragrant chemical compound found naturally in some plants (such as tonka beans, sweet clover, and cassia cinnamon), often used to create vanilla-like or “new-mown hay” scents in perfumes and flavorings","zh":"一种带香味的化合物，天然存在于某些植物中（如零陵香豆、甜苜蓿、桂皮等），常用于香水和香精中，气味类似香草或“新割的干草”香"},"examples":[{"en":"Coumarin gives tonka beans their sweet, warm smell.","zh":"香豆素让零陵香豆带有甜暖的香气。"},{"en":"Some perfumes use coumarin to add a soft, powdery note.","zh":"一些香水会用香豆素来增加柔和、粉感的香调。"},{"en":"Cassia cinnamon may contain more coumarin than Ceylon cinnamon.","zh":"桂皮（Cassia）中的香豆素含量可能比锡兰肉桂更高。"}]}],"synonyms":["coumarin","1,2-benzopyrone"],"phonetic":"/ˈkuːməˌrɪn/","extraExplanation":["你写的“conamarin”在英语中不太常见，更常见的拼写是 **coumarin（香豆素）**。如果你指的是药物或其他专有名词，也可能是拼写误差。","香豆素本身的气味常被描述为“香草/干草/甜暖”。历史上从甜苜蓿变质产生的相关物质研究，促进了抗凝血药物（如华法林 warfarin）的发展。","在食品法规中，香豆素作为“直接添加剂”在部分地区受到限制；但像肉桂等天然来源仍可能带来摄入量差异。"]}
{"word":"conamed","summary":{"en":"Co-named: jointly named or listed together (often in official documents).","zh":"Co-named：共同命名或共同列名（常见于正式文件）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Usually written as “co-named”) jointly named; listed together under the same name or as shared/combined names, especially in official documents.","zh":"（通常写作“co-named”）共同命名的；在文件中被一起列名或以共同/合并的名字出现的（多用于正式语境）。"},"examples":[{"en":"The policy lists Maria and her brother as co-named beneficiaries.","zh":"保单把玛丽亚和她的哥哥列为共同指定的受益人。"},{"en":"The apartment lease has two co-named tenants.","zh":"这份公寓租约上有两位共同列名的承租人。"},{"en":"In the program, the award is given to co-named winners.","zh":"在这个项目里，奖项颁给共同列名的获奖者。"}]}],"synonyms":["jointly named","named together","co-listed","joint"],"phonetic":"/ˌkoʊˈneɪmd/","extraExplanation":["“conamed”不是很常见的标准拼写，更常见的是带连字符的“co-named”。前缀“co-”表示“共同、一起”。在法律、保险、租约等正式文件中，你可能会看到“co-named beneficiary/tenant/insured（共同列名受益人/承租人/被保险人）”。日常口语里更常说“both named”“listed together”或“jointly named”。"]}
{"word":"Conan","summary":{"en":"Conan is a personal name and a well-known pop-culture reference (e.g., Conan the Barbarian, Conan O’Brien).","zh":"Conan 是人名，也常作为流行文化中的知名指代（如《野蛮人柯南》、主持人 Conan O’Brien）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name; also used as a surname.","zh":"男性名字；也可作姓氏。"},"examples":[{"en":"Conan is a popular name in some English-speaking countries.","zh":"Conan 在一些英语国家里是比较常见的名字。"},{"en":"My friend Conan just moved to Seattle.","zh":"我的朋友 Conan 刚搬到西雅图。"}]},{"partOfSpeech":"n.","definition":{"en":"a famous pop-culture name, especially referring to characters or titles such as Conan the Barbarian or the TV host Conan O’Brien.","zh":"流行文化中的知名名字，常指《野蛮人柯南》(Conan the Barbarian) 等角色/作品，或主持人 Conan O’Brien。"},"examples":[{"en":"He dressed up as Conan the Barbarian for Halloween.","zh":"万圣节他装扮成《野蛮人柯南》。"},{"en":"I watched an old interview on Conan last night.","zh":"昨晚我看了 Conan（奥布莱恩）的一段旧采访。"}]}],"synonyms":["(proper name) Conán","(related) Conan the Barbarian","(related) Conan O’Brien","(related) Detective Conan / Case Closed"],"phonetic":"/ˈkoʊnən/","extraExplanation":["“Conan”常被认为源自爱尔兰/盖尔语传统名字（如 Conán），在一些解释里与“狼”“猎犬”或“勇士”等意象相关；不同来源与辞典对词源细节可能略有差异。","在日本，“名侦探柯南”英文常写作 Detective Conan（也常见 Case Closed 这个英文片名），因此在亚洲语境里“Conan”也可能让人联想到这部作品。"]}
{"word":"conand","summary":{"en":"“Conand” isn’t a standard English word; it’s likely a typo (often “Conan” or “con”).","zh":"“conand”不是标准英文单词；更可能是拼写错误（常见为“Conan”或“con”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a typo or a username/brand name. Common possibilities include “Conan” (a name) or the phrase “con and …” (meaning “pros and …” in an argument).","zh":"不是标准英文单词，更可能是拼写错误、用户名或品牌名。常见可能包括“Conan”（人名）或短语“con and …”（在讨论中表示“反方/缺点 和 …”，类似“pros and cons”里的 cons）。"},"examples":[{"en":"I can’t find “conand” in a dictionary—did you mean “Conan” or “con and pro”?","zh":"我在词典里找不到“conand”——你是想写“Conan”还是“con and pro（正反方）”？"},{"en":"If you meant “Conan,” it’s a person’s name, like TV host Conan O’Brien.","zh":"如果你想写“Conan”，那通常是人名，比如电视主持人 Conan O’Brien。"},{"en":"If you meant “con,” it can mean a disadvantage: “One con is the price.”","zh":"如果你想写“con”，它可以表示缺点：“一个缺点是价格。”"}]}],"phonetic":"/ˈkoʊnən/","extraExplanation":["“conand”在英语中没有固定词义，所以最有效的是确认你的目标词：\n1) Conan：常见英文名（也常见于作品名，如《Conan the Barbarian》）。\n2) con：口语里常指“缺点/反对理由”（来自 pros and cons）。也可作动词 con（诈骗/哄骗），但语境不同。\n3) 如果你是想写 “con and …”，通常是在列举正反观点时把 “cons” 简写成 con（不太标准，但偶尔会见到）。\n把你看到这个词的句子发我，我可以帮你精准判断。"]}
{"word":"Conant","summary":{"en":"Conant is most commonly a surname (proper noun), and it can also appear in U.S. place or institution names.","zh":"Conant最常见是姓氏（专有名词），也可见于美国的地名或机构名称中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name), especially known from notable people such as James Bryant Conant (an American chemist and a former president of Harvard University).","zh":"一个姓氏（家族姓），常见于一些名人姓名中，例如詹姆斯·布赖恩特·科南特（美国化学家、哈佛大学前校长）。"},"examples":[{"en":"James B. Conant served as president of Harvard University from 1933 to 1953.","zh":"詹姆斯·B·科南特在1933年至1953年间担任哈佛大学校长。"},{"en":"In the article, Conant is cited as an early advocate of science education reform.","zh":"在这篇文章中，科南特被引用为早期推动科学教育改革的人之一。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name in the U.S. (used in names of streets, schools, or local landmarks), usually honoring someone with the surname Conant.","zh":"美国的一类地名用法（常见于街道、学校或地标名称中），通常是为纪念姓Conant的人而命名。"},"examples":[{"en":"The meeting will be held at Conant High School.","zh":"会议将在科南特高中举行。"},{"en":"Turn left onto Conant Street and continue for two blocks.","zh":"左转进入科南特街，继续走两个街区。"}]}],"synonyms":["(no true synonyms; it is a proper name)"],"phonetic":"/ˈkoʊnənt/","extraExplanation":["“Conant”主要作为专有名词使用（人名/地名），一般不翻译其含义，而是按音译为“科南特/科南”。","在学术与教育史语境中，最常被提到的是James B. Conant（詹姆斯·B·科南特）：他在二战时期参与科学与政策相关工作，战后也对美国科学教育与大学制度产生影响。"]}
{"word":"conant","summary":{"en":"Conant is most commonly a surname (and sometimes a first name).","zh":"Conant 最常见是姓氏（偶尔也作名字）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname), sometimes used in place names or institution names","zh":"姓氏（也常用于地名、建筑名或机构名）"},"examples":[{"en":"Her last name is Conant.","zh":"她的姓是 Conant。"},{"en":"The lecture will be held in Conant Hall.","zh":"讲座将在 Conant Hall 举行。"}]},{"partOfSpeech":"other","definition":{"en":"a given name (first name), usually masculine, but uncommon","zh":"名字（名），通常偏男性用法，但较少见"},"examples":[{"en":"Conant was listed as the author on the report.","zh":"报告上列出的作者名为 Conant。"}]}],"phonetic":"/ˈkoʊnənt/","extraExplanation":["“Conant”在现代英语里主要作为专有名词（人名/姓氏）出现，而不是常用词汇。最常见的场景是历史人物或机构命名。","较知名的人物之一是James Bryant Conant（詹姆斯·布赖恩特·科南特），曾任哈佛大学校长，并在美国科学与教育政策中有影响。你可能会在学校建筑、奖项或文章作者名中见到这个姓。"]}
{"word":"Conard","summary":{"en":"Conard is an archaic insult meaning “coward,” and it can also be a surname (sometimes a variant of Conrad).","zh":"Conard 可作古义侮辱词，意为“懦夫”，也可作姓氏（有时是 Conrad 的拼写变体）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(archaic, insulting) A coward; a person seen as weak or lacking courage.","zh":"（古义/侮辱性）懦夫；被认为胆小、缺乏勇气的人。"},"examples":[{"en":"He called his rival a conard and challenged him to prove his courage.","zh":"他骂对手是个懦夫，并要他证明自己的勇气。"},{"en":"In old texts, conard appears as a harsh insult similar to “coward.”","zh":"在一些旧文本中，conard 作为严厉的辱骂语出现，类似于“coward（懦夫）”。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname), sometimes a spelling variant of “Conrad.”","zh":"姓氏（有时被视为 Conrad 的一种拼写变体）。"},"examples":[{"en":"Ms. Conard will lead the meeting today.","zh":"康纳德女士今天将主持会议。"}]}],"synonyms":["coward","craven (literary)","timid person"],"phonetic":"/ˈkɑnɚd/","extraExplanation":["作为普通名词使用时，conard 在现代英语里很少见，带明显的冒犯意味，更常见的表达是 coward（懦夫）或 cowardly（胆小的）。","它的拼写容易让人联想到法语粗口 connard（“蠢货/混蛋”一类的侮辱词），但两者并不是现代英语里常用的对应词；阅读旧文献时更可能遇到 conard（“懦夫”）这个古义。"]}
{"word":"conarial","summary":{"en":"Conarial means “related to the pineal gland” and is a rare, old-fashioned anatomical term.","zh":"conarial 意为“与松果体有关”，是少见且偏旧式的解剖学术语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the pineal gland (also called the conarium) in the brain.","zh":"与松果体（也称 conarium）有关的；松果体的。"},"examples":[{"en":"In older anatomy texts, you may see the term conarial gland used for the pineal gland.","zh":"在一些较旧的解剖学教材中，你可能会看到用 conarial gland 来指松果体。"},{"en":"The doctor discussed a conarial cyst found on the MRI.","zh":"医生讨论了核磁共振中发现的松果体囊肿。"}]}],"synonyms":["pineal"],"phonetic":"/koʊˈnɛriəl/","extraExplanation":["“conarial”是非常少见、偏旧的医学/解剖学用词，更常见的现代用法是“pineal”（松果体的）。","词源与拉丁语 conarium 有关，conarium 原意与“松果（pine cone）”相关，因为松果体外形被认为像松果。"]}
{"word":"conario","summary":{"en":"A scenario is an imagined or described situation (often used for planning or discussion).","zh":"scenario 指“设想或描述的情景/情况”，常用于讨论、规划或预测。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a description of a possible series of events or a situation, especially one used to plan, predict, or discuss what might happen","zh":"（可能发生的）情景；设想的情况；（用于规划、预测或讨论的）事件发展过程"},"examples":[{"en":"Let’s imagine a worst-case scenario before we make a decision.","zh":"在做决定之前，我们先设想一下最坏的情景。"},{"en":"In this scenario, the company loses customers quickly.","zh":"在这种情景下，公司会很快失去客户。"},{"en":"The teacher gave us a real-life scenario to practice speaking English.","zh":"老师给了我们一个真实生活情景来练习英语口语。"}]},{"partOfSpeech":"n.","definition":{"en":"the written outline for a movie, TV show, or play (similar to a script, especially in some contexts)","zh":"（电影、电视或戏剧的）剧本大纲；分镜/脚本（某些语境中与 script 相近）"},"examples":[{"en":"She studied the scenario before the rehearsal.","zh":"排练前她先研究了剧本大纲。"},{"en":"The director asked for changes to the scenario.","zh":"导演要求修改脚本/大纲。"}]}],"synonyms":["situation","case","possibility","circumstance","hypothetical"],"phonetic":"/səˈnɛrioʊ/","extraExplanation":["“conario” 不是常见英文单词，比较像拼写错误。你可能想写的是 **scenario**（情景/设想）或 **contrary**（相反的）。如果你告诉我你想表达的中文意思或句子，我也可以帮你确认正确拼写。"]}
{"word":"conarium","summary":{"en":"Conarium is a rare anatomical term meaning the pineal gland (pineal body).","zh":"conarium 是较少见的解剖学用词，指松果体（松果体腺）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anatomy) The pineal gland (also called the pineal body), a small endocrine gland in the brain.","zh":"（解剖）松果体（也称松果体腺/松果体），位于大脑内的一种小型内分泌腺体。"},"examples":[{"en":"In older anatomy texts, the pineal gland is sometimes labeled the conarium.","zh":"在较早的解剖学教材中，松果体有时会标注为 conarium。"},{"en":"The conarium helps regulate sleep cycles through the hormone melatonin.","zh":"松果体（conarium）通过褪黑激素帮助调节睡眠节律。"}]}],"synonyms":["pineal gland","pineal body","epiphysis (cerebri)"],"phonetic":"/koʊˈnɛriəm/","extraExplanation":["这个词比较少见，多出现在旧式或拉丁化的解剖学/医学文献中；现代英语更常用 pineal gland 或 pineal body。","词源来自拉丁语 conarium，原意与“松果”有关，呼应松果体外形像松果。"]}
{"word":"Conasauga","summary":{"en":"Conasauga is mainly a U.S. place name, especially the Conasauga River in Georgia and Tennessee.","zh":"Conasauga主要是美国地名，尤其指乔治亚州与田纳西州的科纳索加河。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a river in northwestern Georgia and southeastern Tennessee in the U.S., known for rich freshwater biodiversity; it is a major headwater of the Coosa River system.","zh":"（美国）科纳索加河：位于乔治亚州西北部与田纳西州东南部的一条河流，以淡水生物多样性丰富著称，是库萨河水系的重要源头之一。"},"examples":[{"en":"The Conasauga River is famous for its many species of freshwater mussels.","zh":"科纳索加河以拥有许多淡水贻贝（淡水贝类）物种而闻名。"},{"en":"We drove through north Georgia and saw signs for the Conasauga.","zh":"我们开车穿过乔治亚州北部，看到了写着“Conasauga（科纳索加）”的路牌。"}]}],"synonyms":["Conasauga River"],"phonetic":"/ˌkoʊnəˈsɔːɡə/","extraExplanation":["“Conasauga”是地名（专有名词），通常指Conasauga River。发音里重音在第三个音节：-SAU-。","这个名称被认为源自原住民语言（常被提到与切罗基语有关），在美国东南部的地名中很常见：许多河流、山谷、社区都保留了原住民语言影响。","在环境与生态语境中，Conasauga常与“淡水蛤蜊/贻贝多样性”“河流保护”“水质与栖息地修复”等话题一起出现。"]}
{"word":"conation","summary":{"en":"Conation means the will or drive that leads to intentional action.","zh":"Conation 指促使人产生意图并付诸行动的“意志/意动”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the part of the mind involved in will, intention, and purposeful action (the drive to do something), often discussed alongside cognition (thinking) and emotion (feeling)","zh":"意动（心理学术语）：指与意志、意图和有目的的行动相关的心理成分（推动人去做某事的动力），常与认知（思考）和情绪（感受）并列讨论"},"examples":[{"en":"In some psychology models, conation explains why two people who know the same facts act differently.","zh":"在一些心理学模型中，意动可以解释为什么两个人知道同样的事实，却会做出不同的行动。"},{"en":"Her conation was strong: she set a goal and kept working even when progress was slow.","zh":"她的意动很强：她设定目标，即使进展缓慢也坚持努力。"}]}],"synonyms":["will","volition","drive","motivation","determination","willpower"],"phonetic":"/koʊˈneɪʃən/","extraExplanation":["“Conation”主要见于心理学、教育学与哲学语境，常与“cognition（认知）”和“affect（情感/情绪）”构成三分框架：认知=知道什么；情感=感觉如何；意动=想要并去做。","词源来自拉丁语 conari（“尝试、努力”），因此它强调“朝向行动的意志与努力”，比一般的“motivation（动机）”更偏向“意志/行动倾向”。","日常英语里较少用；写作时如果面向普通读者，常用 willpower, drive, motivation, determination 等更常见词替换。"]}
{"word":"conational","summary":{"en":"Conational means “from the same country,” and it can also mean “a person from the same country.”","zh":"conational 表示“同国的”，也可作名词指“同胞/同国人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"belonging to the same nation; from the same country (as someone else)","zh":"同国的；同一国家的（与某人来自同一国家）"},"examples":[{"en":"She felt more comfortable speaking with conational students during her first week abroad.","zh":"她在出国的第一周和同国的同学说话会更自在。"},{"en":"The embassy offered support to conational travelers after the storm.","zh":"暴风雨过后，大使馆为同国旅客提供了帮助。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from the same nation; a compatriot","zh":"同胞；同国人"},"examples":[{"en":"When he heard his accent, he realized the stranger was a conational.","zh":"他听到对方的口音后，意识到那个陌生人是同胞。"},{"en":"The program pairs new arrivals with conationals who can help them settle in.","zh":"这个项目把新来的人和能帮助他们安顿下来的同胞配对。"}]}],"synonyms":["compatriot","fellow citizen","countryman","countrywoman","fellow national"],"phonetic":"/koʊˈnæʃənəl/","extraExplanation":["“conational”常见于较正式的语境（如移民、领事/使馆服务、学术写作），日常口语里更常说“compatriot”（同胞）、“fellow citizen”（同国公民）或“someone from my country”（我同国家的人）。","词形结构：前缀“co-”有“共同、一起”的意思（如 co-worker 同事），加上“national”（国家的），合起来就是“同国的/同胞”。"]}
{"word":"conationalistic","summary":{"en":"Conationalistic means “related to conation,” i.e., will, motivation, and purposeful action (a rare academic word).","zh":"conationalistic 指“与意动/意志活动有关的”，涉及意志、动机与有目的的行动（较少见的学术用词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to conation (the part of the mind involved in will, motivation, and purposeful action).","zh":"与“意动/意志活动”（心理学中与意志、动机和有目的行为相关的心理过程）有关的。"},"examples":[{"en":"In some psychology texts, conationalistic factors are discussed alongside cognitive (thinking) and affective (feeling) factors.","zh":"在一些心理学教材中，会把 conationalistic（意动/意志相关）因素与 cognitive（认知、思考）因素、affective（情感、感觉）因素一起讨论。"},{"en":"The program tries to strengthen students’ conationalistic skills, such as persistence and goal-setting.","zh":"这个项目试图强化学生的意动/意志相关能力，例如坚持力和目标设定。"}]}],"synonyms":["conative","volitional","motivational"],"phonetic":"/ˌkɑnəˌneɪʃəˈlɪstɪk/","extraExplanation":["这个词在现代英语里非常少见，很多情况下你会看到更常用的词：conative（意动的、意志相关的）或 conation（意动/意志活动）。如果你是在学术文章里遇到 conationalistic，它通常就是“与意志、动机、行动倾向相关”的意思，而不是“nationalistic（民族主义的）”。注意拼写上也容易与 nationalistic 混淆。"]}
{"word":"conations","summary":{"en":"A connotation is the extra meaning or emotional “feel” a word suggests beyond its literal meaning.","zh":"connotation 指词语除字面义之外所带来的联想、暗示与情感色彩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extra feeling or idea that a word suggests, beyond its literal (dictionary) meaning","zh":"（词语的）内涵意义；联想意义（区别于字面/字典意义）"},"examples":[{"en":"The word “cheap” has a negative connotation, even if it simply means “low in price.”","zh":"“cheap”常带有负面内涵，尽管它字面上只是“价格低”。"},{"en":"In advertising, companies choose words with positive connotations to make products sound appealing.","zh":"在广告中，公司会选用带有积极内涵的词来让产品更吸引人。"}]},{"partOfSpeech":"n.","definition":{"en":"the set of associations a person or group commonly connects with a word, phrase, image, or idea","zh":"（群体或个人对词/短语/意象/观念的）常见联想与暗示"},"examples":[{"en":"For many people, “home” has connotations of warmth and safety.","zh":"对很多人来说，“home”会让人联想到温暖与安全。"},{"en":"That symbol carries different connotations in different cultures.","zh":"那个符号在不同文化中承载的联想意义不同。"}]}],"synonyms":["association","implication","undertone","shade of meaning","suggestion"],"phonetic":"/ˌkɑnəˈteɪʃən/","extraExplanation":["“connotation（内涵/联想）”常与“denotation（外延/字面义）”对比：denotation 是词典里最直接的意思；connotation 是它让人“感觉到/想到”的情绪色彩与暗示。","学习词汇时，注意“褒义/贬义/中性”往往属于 connotation。例如：slim（多为褒义：苗条） vs. skinny（常带贬义：瘦得不健康）。","你输入的“conations”很可能是拼写错误，正确拼写通常是“connotations”（复数）或“connotation”（单数）。"]}
{"word":"conative","summary":{"en":"Conative means related to striving/will to act, or (in language) aimed at influencing the addressee.","zh":"Conative 指与意志/努力行动有关；在语言学中也指旨在影响受话者的表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Psychology) relating to conation—wanting, striving, or the will to act (as opposed to thinking or feeling).","zh":"（心理学）与“意志/驱力（conation）”有关的；指想要、努力、采取行动的意志层面（不同于思考或情绪）。"},"examples":[{"en":"Motivation has cognitive, emotional, and conative aspects.","zh":"动机包含认知、情绪和意志（驱力）三个方面。"},{"en":"Her conative strength helped her keep practicing every day.","zh":"她的意志力让她坚持每天练习。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Linguistics/communication) aimed at influencing the listener/reader; directed toward the addressee (e.g., commands, requests, persuasion).","zh":"（语言学/传播学）指向受话者、旨在影响对方的（如命令、请求、劝说等）。"},"examples":[{"en":"Advertising often uses conative language to push people to buy.","zh":"广告常用“劝导式/呼吁式”的语言来促使人们购买。"},{"en":"“Please sit down” is a conative message because it tries to get the listener to act.","zh":"“请坐下”是典型的指向受话者的信息，因为它在促使对方行动。"}]}],"synonyms":["volitional","motivational","goal-directed","persuasive","addressee-oriented"],"phonetic":"ˈkɑnətɪv","extraExplanation":["“conative”来自拉丁语 conari（意为“尝试、努力”）。在心理学里常与 cognitive（认知的）和 affective（情感的）并列，帮助区分心理活动的三个侧面：想什么、感受什么、以及“想去做什么”。","在语言学中，常见于雅各布森（Roman Jakobson）的语言功能理论：conative function（呼唤/劝导功能）强调对受话者产生影响，常见形式包括祈使句、请求、号召语等。"]}
{"word":"conatural","summary":{"en":"Conatural means “sharing the same nature” or, less commonly, “innate/inborn,” and it’s usually formal.","zh":"conatural 指“同性质的/本性相同的”，较少见时也可指“天生的”，多用于正式语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having the same nature; similar in kind or character (often used in formal or philosophical writing).","zh":"同性质的；本性相同的；同类的（多用于较正式或哲学语境）。"},"examples":[{"en":"Justice and mercy can seem opposite, but some thinkers say they are conatural virtues in a good society.","zh":"正义与仁慈看似对立，但有些思想家认为它们是在良好社会中同性质的美德。"},{"en":"Her love of music felt conatural with her gentle personality.","zh":"她对音乐的热爱似乎与她温柔的性格同质相合。"}]},{"partOfSpeech":"adj.","definition":{"en":"innate; belonging to someone’s nature; inborn (a less common use).","zh":"天生的；本性的；与生俱来的（较少见用法）。"},"examples":[{"en":"He had a conatural curiosity that made him ask questions everywhere he went.","zh":"他有一种与生俱来的好奇心，走到哪里都会提问。"},{"en":"Teaching felt conatural to her, even before she had any training.","zh":"即使在受过任何训练之前，教学对她来说也像是天性使然。"}]}],"synonyms":["innate","inborn","natural","similar","kindred","congenial"],"phonetic":"/kɑˈnætʃərəl/","extraExplanation":["“conatural”较少见，常出现在哲学、神学或学术写作中，用来强调“在本质上同类/相契合”。词源来自拉丁语 con-（共同）+ naturalis（自然的）。在日常英语里更常用 similar, innate, inborn, natural 等词来表达相近意思。"]}
{"word":"conatus","summary":{"en":"Conatus means an inner drive or striving to persist in existence and develop, especially in philosophy (notably Spinoza).","zh":"Conatus 指“内在的自存努力／趋力”，即维持存在并发展自身的根本驱动，常见于哲学语境（尤其斯宾诺莎）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Philosophy) An inner striving or fundamental drive in a being to continue existing and to develop—often described as the effort to persist in one’s own nature.","zh":"（哲学）“自存努力／内在趋力”：指一个存在者维持自身存在并发展自身的根本冲动或努力，常被描述为“坚持成为自己”的力量。"},"examples":[{"en":"In Spinoza’s philosophy, conatus is the basic drive that makes each thing try to continue being what it is.","zh":"在斯宾诺莎的哲学中，conatus 是每个事物努力维持其自身存在的基本动力。"},{"en":"She used the idea of conatus to explain why people keep going even after repeated failures.","zh":"她用 conatus 这个概念来解释为什么人们即使屡次失败仍会继续坚持。"}]},{"partOfSpeech":"n.","definition":{"en":"(Psychology/biology, more general use) A tendency or impulse toward self-preservation, growth, or purposeful action.","zh":"（心理学／生物学等较一般用法）指趋向自我保存、成长或有目的行动的冲动或倾向。"},"examples":[{"en":"Some writers treat conatus as a natural impulse toward survival and improvement.","zh":"一些作者把 conatus 视为趋向生存与改进的自然冲动。"}]}],"synonyms":["striving","drive","impulse","self-preservation","will to live"],"phonetic":"/koʊˈneɪtəs/","extraExplanation":["Conatus 源自拉丁语，意为“努力、奋力尝试”。在英语里它多用于哲学语境，尤其与 17 世纪哲学家斯宾诺莎（Spinoza）相关：他用 conatus 指万物“努力持续其存在”的本性。","它在日常英语中不算常见，更像学术词；写作时通常需要给出上下文（如“Spinoza’s conatus”）来帮助读者理解。"]}
{"word":"Conaway","summary":{"en":"Conaway is most commonly a surname (family name) in English.","zh":"Conaway 最常见的用法是英语中的姓氏（家族姓）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname), used to identify someone’s family or lineage","zh":"姓氏（家族姓），用来表示一个人的家族或血缘来源"},"examples":[{"en":"Dr. Conaway will see you now.","zh":"康纳韦医生现在要见你。"},{"en":"My last name is Conaway.","zh":"我姓康纳韦。"}]},{"partOfSpeech":"other","definition":{"en":"a given name in some cases (less common), used as a personal name","zh":"人名（较少见），可用作个人名字"},"examples":[{"en":"Conaway was listed as the contact person on the form.","zh":"表格上填写的联系人是 Conaway。"}]}],"phonetic":"/ˈkɑnəˌweɪ/","extraExplanation":["“Conaway”通常作为英语世界中的姓氏出现。它的发音在不同家庭或地区可能会有小差异，但常见读法接近“CON-uh-way”。","在正式写作中，作为人名/姓氏时首字母必须大写：Conaway。若你是在特定文章或人名中看到它，也可能指某位具体人物（如运动员、学者等），需要结合上下文确认。"]}
{"word":"conaxial","summary":{"en":"Coaxial means sharing the same central axis; it also commonly refers to a coaxial cable used for signal transmission.","zh":"coaxial 指“同轴的、共轴的”；也常指“同轴电缆”，用于传输信号。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the same central axis; arranged around one shared axis.","zh":"共轴的；同轴的（共享同一条中心轴线的）。"},"examples":[{"en":"The two cylinders are coaxial, so they spin smoothly together.","zh":"这两个圆柱是同轴的，所以它们可以一起平稳旋转。"},{"en":"Make sure the holes are coaxial before inserting the rod.","zh":"插入杆之前要确保这些孔是同轴的。"}]},{"partOfSpeech":"n.","definition":{"en":"A coaxial cable, used to carry TV, internet, or radio signals.","zh":"同轴电缆（常用于传输电视、网络或无线电信号）。"},"examples":[{"en":"We need a longer coaxial to connect the modem to the wall outlet.","zh":"我们需要一根更长的同轴电缆把调制解调器连接到墙上的接口。"},{"en":"The technician replaced the old coaxial with a newer cable.","zh":"技术员把旧的同轴线换成了更新的电缆。"}]}],"synonyms":["collinear (similar idea in lines)","axial (related)","coax (informal for coaxial cable)"],"phonetic":"/koʊˈæk.si.əl/","extraExplanation":["你输入的“conaxial”很可能是“coaxial”的拼写错误；英语里更常见、标准的拼法是 coaxial。","co- 表示“共同”，axis 表示“轴”，所以 coaxial 字面意思就是“共享同一根轴线”。在工程/物理里常用来描述零件对准同一中心线。","在日常生活中，coaxial 最常见的搭配是 coaxial cable（同轴电缆），也常简写为 coax（如：a coax cable）。"]}

