{"word":"cone","summary":{"en":"A cone is a pointed shape (like a traffic cone) or a cone-shaped object (like an ice-cream cone); it can also mean to form into that shape.","zh":"cone 指圆锥体或锥形物（如交通锥、甜筒）；也可作动词，表示使成/形成锥形。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A shape with a circular base that narrows smoothly to a point (or to a small flat top).","zh":"圆锥体；一种底部为圆形、向上逐渐变尖（或到小平顶）的形状。"},"examples":[{"en":"A traffic cone warns drivers to slow down.","zh":"交通锥用来提醒司机减速。"},{"en":"The volcano has a cone shape.","zh":"那座火山呈圆锥形。"}]},{"partOfSpeech":"n.","definition":{"en":"A cone-shaped object, often used to hold or contain something.","zh":"锥形物（常用于盛装或承载某物的容器/物体）。"},"examples":[{"en":"She ordered an ice-cream cone.","zh":"她点了一个甜筒冰淇淋。"},{"en":"He rolled the paper into a cone and poured in the seeds.","zh":"他把纸卷成一个锥形，把种子倒了进去。"}]},{"partOfSpeech":"v.","definition":{"en":"To shape something into a cone or form a cone shape.","zh":"使成圆锥形；形成圆锥形。"},"examples":[{"en":"The potter coned the clay before centering it on the wheel.","zh":"陶艺师在把黏土放到拉坯机中心之前，先把它捏成圆锥状。"},{"en":"The flame coned upward in the wind.","zh":"火焰在风中向上收拢成锥形。"}]}],"synonyms":["conical shape","ice-cream cone","traffic cone","pylon"],"phonetic":"/koʊn/","extraExplanation":["“cone”在日常生活里最常见的联想是“traffic cone（交通锥）”和“ice-cream cone（甜筒）”。在科学语境中，它常用于几何（a right cone 直圆锥）以及生物（cone cells 视锥细胞，负责颜色与清晰视觉）。","词源来自拉丁语 conus（圆锥、松果），所以你也会看到与“松果”有关的表达，如 pine cone（松果）。"]}
{"word":"coned","summary":{"en":"“Coned” usually means either (1) shaped/formed into a cone, or (2) blocked/marked with traffic cones.","zh":"“Coned”常见含义是（1）做成/呈圆锥形；或（2）用路锥标示、围起或封锁区域。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “cone”: to shape something like a cone, or to mark/block an area using traffic cones.","zh":"“cone”的过去式/过去分词：把某物做成圆锥形；或用路锥（交通锥）标示/封锁某个区域。"},"examples":[{"en":"The chef coned the ice cream neatly for the customer.","zh":"厨师把冰淇淋整齐地做成甜筒的形状给顾客。"},{"en":"The police coned off the lane after the accident.","zh":"事故后警方用路锥把那条车道封了起来。"}]},{"partOfSpeech":"adj.","definition":{"en":"Shaped like a cone (wider at the base and narrowing to a point).","zh":"圆锥形的（底部较宽、向上逐渐变尖）。"},"examples":[{"en":"Some pine trees have a tall, coned shape.","zh":"有些松树呈高高的圆锥形。"},{"en":"The coned roof helps rainwater run off quickly.","zh":"圆锥形屋顶能让雨水更快流走。"}]}],"synonyms":["shaped","tapered","conical","blocked off","cordoned off"],"phonetic":"/koʊnd/","extraExplanation":["“coned off”在美式英语里很常见，指用橙色路锥把某个区域围起来，表示禁止通行或提醒危险。","名词“cone”可指圆锥体（几何）、松果、甜筒（ice-cream cone）以及路锥（traffic cone）。不同语境下“coned”的含义会随之变化。"]}
{"word":"coneen","summary":{"en":"“coneen” isn’t a standard English word; it’s likely a misspelling or a name.","zh":"“coneen” 不是标准英语单词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or a proper name (surname/place name). Common intended spellings include “convene,” “cone,” “coney,” or “keen.”","zh":"不是标准英语单词。更可能是拼写错误或专有名词（姓氏/地名）。常见可能想写的是 “convene（召集）”“cone（圆锥）”“coney（兔/野兔的旧称）”或 “keen（热衷的/敏锐的）”。"},"examples":[{"en":"I can’t find “coneen” in an English dictionary—did you mean “convene”?","zh":"我在英语词典里找不到 “coneen”——你是不是想写 “convene”？"},{"en":"If “Coneen” is a name, please share the sentence so I can explain it in context.","zh":"如果 “Coneen” 是人名/地名，请给我完整句子，我可以结合语境解释。"}]}],"synonyms":["convene","cone","coney","keen"],"phonetic":"/koʊˈniːn/","extraExplanation":["“coneen” 在常用英语词典中没有收录，所以很可能是拼写输入误差（例如把 v/n/ee 的组合打错），或是专有名词（姓氏、地名、品牌名）。","你可以把它放进一句话里（或告诉我你想表达的中文意思），我就能更准确地判断你要查的是哪个词，并给出发音、词性、释义和例句。"]}
{"word":"coneflower","summary":{"en":"A coneflower is an Echinacea plant with a cone-shaped center, common in gardens and herbal products.","zh":"Coneflower 指紫锥菊属植物，花心呈圆锥状，常见于花园栽培与草本制品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a flowering plant in the genus Echinacea, with purple or pink daisy-like flowers and a raised, cone-shaped center; often grown in gardens and sometimes used in herbal products","zh":"紫锥菊属（Echinacea）的开花植物，花形像雏菊，常见紫色或粉色，花心隆起呈“圆锥”状；常用于园艺栽培，也常见于草本制品中"},"examples":[{"en":"Coneflowers attract bees and butterflies, so they’re great for pollinator gardens.","zh":"紫锥菊会吸引蜜蜂和蝴蝶，很适合种在“传粉者花园”里。"},{"en":"She planted coneflowers along the fence because they’re hardy and easy to care for.","zh":"她在篱笆边种了紫锥菊，因为它们很耐养，也好打理。"},{"en":"Some people drink echinacea tea made from coneflower, but you should check with a doctor first.","zh":"有些人会喝用紫锥菊做的紫锥菊茶（echinacea tea），但最好先咨询医生。"}]}],"synonyms":["echinacea","purple coneflower"],"phonetic":"/ˈkoʊnˌflaʊɚ/","extraExplanation":["“Coneflower”这个名字来自它花朵中央凸起的“圆锥形”花心（cone + flower）。日常英语里它既可以指具体的园艺植物，也常在保健品语境中与“echinacea（紫锥菊）”一起出现；后者更偏向草本/成分名称。"]}
{"word":"Conehatta","summary":{"en":"Conehatta is a place name in Mississippi, USA (a small community in Newton County).","zh":"Conehatta 是美国密西西比州的地名（牛顿县的一个小社区）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A small community (census-designated place) in eastern Mississippi, USA, in Newton County.","zh":"美国密西西比州东部牛顿县的一个小社区（人口普查指定地区）。"},"examples":[{"en":"Conehatta is located in eastern Mississippi, not far from Meridian.","zh":"Conehatta 位于密西西比州东部，离梅里迪恩（Meridian）不远。"},{"en":"She drove through Conehatta on her way to visit family.","zh":"她在去探亲的路上开车经过了 Conehatta。"}]},{"partOfSpeech":"other","definition":{"en":"In local geography, a name used for nearby natural features (such as streams/creeks) associated with the Conehatta area.","zh":"在当地地理中，也可指与 Conehatta 地区相关的自然地貌名称（如附近的小溪/河道等）。"},"examples":[{"en":"The trail follows a creek near the Conehatta area.","zh":"这条步道沿着 Conehatta 附近的一条小溪延伸。"}]}],"phonetic":"/ˌkoʊnəˈhætə/","extraExplanation":["Conehatta 是一个专有名词（地名），日常对话里通常不会翻译，而是直接音译/保留英文拼写。写作时常见格式是 “Conehatta, Mississippi” 或 “Conehatta, MS”。","这类地名在美国南部不少与原住民语言或地方历史有关；如果你是从地图、新闻或家谱记录中看到它，通常指的就是密西西比州牛顿县的那个社区。"]}
{"word":"conehead","summary":{"en":"“Conehead” means a person with a cone-shaped head (often joking/insulting), or the famous cone-headed alien characters from SNL and the 1993 film.","zh":"“conehead”指“圆锥头”的人（常是玩笑或取笑），也指源自《周六夜现场》及1993年电影的经典“圆锥头外星人”角色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person whose head is shaped like a cone; often used humorously or as a teasing insult.","zh":"头部形状像圆锥的人；常带玩笑或取笑、侮辱的语气。"},"examples":[{"en":"The kid was teased as a “conehead” because his hair was styled into a point.","zh":"那个孩子因为把头发弄成尖尖的样子，被人取笑叫“conehead”。"},{"en":"Be careful—calling someone a conehead can sound mean.","zh":"注意，用“conehead”称呼别人可能显得很刻薄。"}]},{"partOfSpeech":"n.","definition":{"en":"(often capitalized) a fictional cone-headed alien character, especially from the U.S. TV comedy show Saturday Night Live and the film Coneheads (1993).","zh":"（常大写）虚构的“圆锥头外星人”角色，尤指美国喜剧节目《周六夜现场》及电影《Coneheads》（1993）中的人物。"},"examples":[{"en":"He dressed up as a Conehead for Halloween.","zh":"他万圣节打扮成了一个“Conehead”。"},{"en":"The Coneheads are a classic Saturday Night Live sketch.","zh":"“Coneheads”是《周六夜现场》里很经典的小品角色。"}]}],"synonyms":["pointy-head","cone-headed person","(joking) alien"],"phonetic":"/ˈkoʊnˌhɛd/","extraExplanation":["“conehead”在日常口语里有时用来取笑别人的外貌或发型，可能带有冒犯性；更礼貌的说法可以直接描述：“a pointed hairstyle / a cone-shaped head.”","作为流行文化梗，“Coneheads”源于美国《周六夜现场》（SNL）的喜剧短剧，后被改编成1993年的电影；台词和设定偏夸张荒诞，用来制造喜剧效果。"]}
{"word":"coneighboring","summary":{"en":"“Coneighboring” (usually written “co-neighboring”) means “next to each other; adjacent,” but it’s rare—most writers use “neighboring” or “adjacent.”","zh":"“coneighboring”（通常写作“co-neighboring”）意思是“彼此相邻、接壤”，但用法较少见；更常用“neighboring”或“adjacent”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"sharing a border or being next to the same place; neighboring together (a rare form, more commonly written as “neighboring” or “adjacent”).","zh":"与同一地点接壤或紧邻；共同相邻（较少见的写法，更常用“neighboring”或“adjacent”）。"},"examples":[{"en":"The co-neighboring towns often share a school district.","zh":"这些相邻的城镇经常共用同一个学区。"},{"en":"Wildlife moves freely between co-neighboring forests.","zh":"野生动物会在相邻的森林之间自由迁移。"}]}],"synonyms":["neighboring","adjacent","bordering","contiguous","nearby"],"phonetic":"/ˌkoʊˈneɪbərɪŋ/","extraExplanation":["“co-”是英语里常见的前缀，表示“共同、一起”（如 co-worker 同事、co-author 合著者）。因此 co-neighboring 的构词逻辑是“共同相邻”。不过这个词在现代英语中不常用，写作中通常直接用 neighboring、adjacent，或用短语 bordering each other / neighboring each other 来表达。"]}
{"word":"coneine","summary":{"en":"Coneine is a rare spelling of coniine, a poisonous alkaloid from poison hemlock.","zh":"Coneine 多为 coniine 的罕见拼写，指毒芹中的一种有毒生物碱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a poisonous alkaloid found in poison hemlock, historically known as the active toxin in “hemlock” poison","zh":"一种存在于毒芹（poison hemlock）中的有毒生物碱；历史上常被认为是“毒芹毒酒（hemlock）”的主要毒性成分"},"examples":[{"en":"Coneine (more commonly spelled coniine) is a toxic compound found in poison hemlock.","zh":"Coneine（更常见的拼写是 coniine）是一种存在于毒芹中的有毒化合物。"},{"en":"Even small amounts of coneine can affect the nervous system.","zh":"即使少量的 coneine 也可能影响神经系统。"}]}],"synonyms":["coniine"],"phonetic":"/ˈkoʊniˌaɪn/","extraExplanation":["“coneine”在现代英语里非常少见，多数情况下是“coniine”的旧拼写或误拼。标准写法通常为 **coniine**。","coniine 与“毒芹（poison hemlock）”联系紧密；在西方文化中，毒芹常因古希腊哲学家苏格拉底被处死的故事而被提及（传统叙述中，他饮下的“hemlock”被认为含有此类毒性成分）。","使用与安全：这是毒理/化学语境词汇，不用于日常对话；若在科普或新闻中看到，多与植物中毒、毒理学或历史叙述相关。"]}
{"word":"Conejos","summary":{"en":"“Conejos” is Spanish for “rabbits” (plural of conejo).","zh":"Conejos 是西班牙语，意思是“兔子”（conejo 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) “rabbits”; plural form of conejo.","zh":"（西班牙语）“兔子”；conejo 的复数形式。"},"examples":[{"en":"In the photo, you can see three conejos in the field.","zh":"在这张照片里，你可以看到田野里有三只兔子。"},{"en":"The menu says “tacos de conejo,” meaning rabbit tacos.","zh":"菜单上写着“tacos de conejo”，意思是兔肉玉米卷。"}]}],"synonyms":["rabbits","bunnies"],"phonetic":"/koʊˈneɪhoʊs/","extraExplanation":["“Conejos”是西班牙语复数：conejo（兔子）→ conejos（兔子们/多只兔子）。在英语语境中常出现在地名（如 Los Conejos）、人名/乐队名、餐饮菜单或西班牙语对话里。","英语里更常用 rabbit / bunny 来说“兔子”。如果你是在学西语：单数冠词常见 el conejo（这只兔子），复数是 los conejos（这些兔子）。"]}
{"word":"conelet","summary":{"en":"Conelet means a small cone or cone-shaped object.","zh":"conelet 指“小圆锥”或“圆锥形的小物体”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small cone or cone-shaped object; sometimes used for a small ice-cream cone or a small traffic/pylon-style cone","zh":"小圆锥；圆锥形小物体（有时也指迷你冰淇淋蛋筒或小型路锥）"},"examples":[{"en":"The coach set out bright conelets to mark the running route.","zh":"教练摆放了几个亮色的小路锥来标记跑步路线。"},{"en":"She bought a conelet of ice cream for her child.","zh":"她给孩子买了一个迷你冰淇淋蛋筒。"}]}],"synonyms":["small cone","mini cone","little cone"],"phonetic":"/ˈkoʊn.lət/","extraExplanation":["“conelet”由“cone（圆锥）+ -let（小……）”构成，-let 是英语里常见的“小词尾”，表示体积更小或更可爱，例如 leaflet（小册子/传单）、streamlet（小溪）。","这个词不算常用，很多场合更自然的表达是 “small cone” 或更具体的 “mini cone / small traffic cone”。"]}
{"word":"conelike","summary":{"en":"Conelike means cone-shaped—wide at the base and narrowing to a point.","zh":"conelike 意为“圆锥状的；像圆锥一样的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Shaped like a cone (wide at the base and narrowing to a point).","zh":"圆锥状的；像圆锥一样的（底部较宽、向上逐渐变尖）。"},"examples":[{"en":"The volcano has a conelike shape.","zh":"这座火山呈圆锥状。"},{"en":"A conelike pile of sand formed under the hourglass.","zh":"沙漏下方堆起了一座圆锥形的沙堆。"}]}],"synonyms":["cone-shaped","conical","tapered"],"phonetic":"/ˈkoʊnˌlaɪk/","extraExplanation":["“conelike”常见写法也有“cone-like”（更常见），尤其在科学、医学、工程写作中更偏好用连字符。两者含义相同。","在描述自然形状或解剖结构时很常用，例如“conelike bud（圆锥形花蕾）”“conelike structure（圆锥状结构）”。"]}
{"word":"Conelrad","summary":{"en":"CONELRAD was a U.S. Cold War emergency radio system designed to broadcast alerts while limiting enemy use of radio signals.","zh":"CONELRAD是美国冷战时期的紧急广播体系，用于在发布警报的同时降低敌方利用广播信号的可能性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a U.S. Cold War emergency broadcasting system (1951–1963) that, during a national security crisis, required most radio stations to stop normal broadcasting and instead share emergency information on specific AM frequencies to reduce the chance of enemy radio navigation or targeting.","zh":"美国冷战时期的紧急广播系统（1951–1963）。在国家安全危机时，大多数电台需停止正常节目，改为在特定AM频率上播发统一的紧急信息，以降低敌方利用广播信号进行导航或定位的风险。"},"examples":[{"en":"During the drill, the announcer said the station would switch to CONELRAD procedures.","zh":"演习期间，播音员说电台将切换到CONELRAD应急程序。"},{"en":"Some Cold War documentaries mention CONELRAD as the predecessor of today’s Emergency Alert System.","zh":"一些冷战纪录片会提到CONELRAD是如今紧急警报系统的前身。"}]}],"synonyms":["Emergency Broadcast System (EBS)","Emergency Alert System (EAS)","civil defense alert system","emergency broadcasting"],"phonetic":"/ˈkɑːnəlˌræd/","extraExplanation":["CONELRAD是缩写，来自“Control of Electromagnetic Radiation”（电磁辐射控制）。其核心做法是让正常广播停播或改在指定频点播出（常提到640与1240 kHz），并限制连续发射，以减少被敌方利用信号进行测向与轰炸定位的可能性。","1963年CONELRAD被更系统化的“Emergency Broadcast System (EBS)”取代，后来又发展为今天的“Emergency Alert System (EAS)”。","在流行文化与文学/影视中，CONELRAD常用来营造冷战核威胁氛围；有些老式收音机上会标注“CONELRAD”三角标记，提示紧急时要调到相应频率。"]}
{"word":"conelrad","summary":{"en":"CONELRAD was a Cold War U.S. emergency radio broadcast system for civil defense alerts.","zh":"CONELRAD是美国冷战时期用于民防警报的紧急无线电广播系统。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a U.S. Cold War–era emergency broadcasting system that used radio stations on specific AM frequencies to provide civil defense information during a national emergency (especially a nuclear attack).","zh":"（美国）冷战时期的紧急广播系统，通过让电台在特定AM频率播报民防信息，用于国家紧急状况（尤其核攻击）时的通知。"},"examples":[{"en":"During the Cold War, CONELRAD was meant to warn the public if the United States came under attack.","zh":"在冷战时期，CONELRAD的目的是在美国遭到攻击时向公众发出警报。"},{"en":"The novel mentions families listening for a CONELRAD alert late at night.","zh":"小说里提到一家人深夜守在收音机旁等待CONELRAD警报。"}]}],"synonyms":["civil defense radio alert system","Emergency Broadcast System (EBS)","Emergency Alert System (EAS)"],"phonetic":"/ˈkɑːnəlˌræd/","extraExplanation":["CONELRAD是缩写，来自“Control of Electromagnetic Radiation（电磁辐射管制）”。其核心做法之一是让广播电台停播或改在少数指定频率上播出（常见说法是640和1240 kHz），以减少敌方利用广播信号进行导航的可能性。","它大约在1950年代初开始使用，1963年被更现代的紧急广播系统（EBS，后发展为EAS）取代。如今多见于历史文本、冷战题材影视或复古科幻语境中。"]}
{"word":"conelrads","summary":{"en":"CONELRAD: a Cold War U.S. emergency broadcast system meant to prevent radio signals from aiding enemy navigation while still sending public alerts.","zh":"CONELRAD：美国冷战时期的紧急广播系统，在发布警报的同时减少广播信号被敌方用于导航。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"CONELRAD: a Cold War–era U.S. emergency broadcasting system designed to limit (“control”) radio transmissions so enemy aircraft could not use broadcast signals to navigate, while still allowing the government to send emergency messages to the public.","zh":"CONELRAD：美国冷战时期的紧急广播系统，目的是在发布紧急信息的同时“控制电磁辐射”，减少敌方利用广播信号进行导航定位的可能。"},"examples":[{"en":"During the Cold War, CONELRAD was created to reduce the risk of enemy bombers using radio stations as navigation beacons.","zh":"冷战时期建立了 CONELRAD，以降低敌方轰炸机把广播电台当作导航信标的风险。"},{"en":"The old emergency system before today’s EAS included CONELRAD and later the Emergency Broadcast System.","zh":"在今天的 EAS 之前，更早的紧急系统包括 CONELRAD，之后发展为“紧急广播系统”（EBS）。"}]}],"synonyms":["Emergency Broadcast System (EBS) (later system)","Emergency Alert System (EAS) (modern system)"],"phonetic":"/ˈkɑnəlræd/","extraExplanation":["你输入的“conelrads”很可能是拼写错误或复数形式；常见写法是 **CONELRAD**（全大写，因为它来自缩写）。它是 **Control of Electromagnetic Radiation** 的缩写，历史上主要用于美国 1950—1960 年代。","CONELRAD 之后被 **Emergency Broadcast System (EBS)** 取代，再后来发展为今天的 **Emergency Alert System (EAS)**。"]}
{"word":"conemaker","summary":{"en":"A conemaker is a person or machine that makes cones, often ice-cream cones.","zh":"conemaker 指制作圆锥形物品的人或机器，常指制作冰淇淋蛋筒的设备。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or machine that makes cones (especially ice‑cream cones or waffle cones).","zh":"制作圆锥形物品的人或机器（尤指制作冰淇淋蛋筒/华夫蛋筒的设备）。"},"examples":[{"en":"The bakery bought a new conemaker to produce waffle cones faster.","zh":"这家烘焙店买了一台新的蛋筒机，用来更快地生产华夫蛋筒。"},{"en":"She worked as a conemaker in a small factory that supplied ice‑cream shops.","zh":"她在一家为冰淇淋店供货的小工厂里做蛋筒制作工。"}]}],"synonyms":["cone maker","waffle cone maker","cone machine"],"phonetic":"/ˈkoʊnˌmeɪkər/","extraExplanation":["“conemaker”更常见的写法是两词：cone maker。合写多见于产品名、职位名或非正式用法。具体指什么“cone”，要看语境：常见是冰淇淋蛋筒/华夫蛋筒，也可能是交通锥、纸锥等。"]}
{"word":"conemaking","summary":{"en":"Conemaking is the process of making cone-shaped products; in textiles, it specifically means winding yarn onto cones.","zh":"Conemaking 指制作锥形制品；在纺织业中常特指把纱线卷绕成纱锥（筒子纱）的工序。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity or process of making cones (cone-shaped items), such as ice-cream cones, paper cones, or other cone-shaped products","zh":"制作锥形物（圆锥形制品）的过程或工作，例如冰淇淋甜筒、纸锥等"},"examples":[{"en":"The bakery added conemaking to its production line to supply ice-cream shops.","zh":"这家烘焙店把甜筒制作（conemaking）加入生产线，为冰淇淋店供货。"},{"en":"Conemaking requires careful shaping so every cone is the same size.","zh":"制作锥形物需要精细的成型，确保每个锥体大小一致。"}]},{"partOfSpeech":"n.","definition":{"en":"in textiles, the process of winding yarn into a cone shape for storage or for use on knitting or weaving machines","zh":"（纺织）把纱线卷绕成纱锥（筒子纱）的工序，用于储存或供针织/织布机器使用"},"examples":[{"en":"After dyeing, the yarn went to conemaking before it was shipped.","zh":"染色后，纱线会先进行卷绕成锥（conemaking），再出货。"},{"en":"Good conemaking helps the yarn feed smoothly into the knitting machine.","zh":"良好的卷绕成锥（conemaking）有助于纱线在针织机上顺畅喂入。"}]}],"synonyms":["cone making","cone production","cone forming","yarn coning"],"phonetic":"/ˈkoʊnˌmeɪkɪŋ/","extraExplanation":["“conemaking”常见于工业/技术语境，日常英语里更常写作“cone making”（分开写）。在纺织领域，它指把纱线卷成“纱锥/筒子纱”（cone），方便运输与机器供纱。"]}
{"word":"Conemaugh","summary":{"en":"Conemaugh is a proper name mainly referring to a river in western Pennsylvania and nearby place names.","zh":"Conemaugh 主要指美国宾夕法尼亚州西部的一条河，以及以这条河命名的周边地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a river in western Pennsylvania, USA; it joins the Allegheny River at Pittsburgh to form the Ohio River system.","zh":"（美国）宾夕法尼亚州西部的一条河流；在匹兹堡附近汇入阿勒格尼河，属于俄亥俄河水系。"},"examples":[{"en":"The Conemaugh River flows through Johnstown, Pennsylvania.","zh":"科尼莫河（Conemaugh River）流经宾夕法尼亚州的约翰斯敦。"},{"en":"After heavy rain, the Conemaugh can rise quickly and cause flooding.","zh":"暴雨后，科尼莫河水位可能迅速上涨并引发洪水。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name used in Pennsylvania (e.g., Conemaugh Township), especially in areas near the Conemaugh River.","zh":"宾夕法尼亚州的一些地名（如 Conemaugh Township/科尼莫镇区），多与科尼莫河周边地区有关。"},"examples":[{"en":"She grew up near Conemaugh Township and later moved to Pittsburgh.","zh":"她在科尼莫镇区附近长大，后来搬到了匹兹堡。"}]}],"synonyms":["Conemaugh River"],"phonetic":"/ˈkɑːnəˌmɔː/","extraExplanation":["“Conemaugh”常见读音接近“KAH-nuh-maw”。它是宾夕法尼亚州的典型地名之一，许多此类地名源自美洲原住民语言（多为阿尔冈昆语系），通常与当地自然地形、水域有关。","与该河相关的历史事件中，最广为人知的是1889年的“约翰斯敦洪水”（Johnstown Flood），灾区就在科尼莫河流域。学习相关文化背景时常会一起看到Conemaugh这个名字。"]}
{"word":"conemaugh","summary":{"en":"Conemaugh is a place name in western Pennsylvania, especially the Conemaugh River and nearby areas.","zh":"Conemaugh 是美国宾夕法尼亚州西部的地名，主要指科尼莫河及其周边地区。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a river in western Pennsylvania (USA), a tributary of the Kiskiminetas River; the name is also used for nearby places such as Conemaugh Township and Conemaugh Valley.","zh":"（美国宾夕法尼亚州西部的）科尼莫河；该名称也用于附近一些地方，如科尼莫镇（Conemaugh Township）与科尼莫谷地（Conemaugh Valley）。"},"examples":[{"en":"The Conemaugh River flows through the Johnstown area in western Pennsylvania.","zh":"科尼莫河流经宾夕法尼亚州西部的约翰斯敦一带。"},{"en":"Many towns in the Conemaugh Valley grew around coal and steel industries.","zh":"科尼莫谷地的许多城镇因煤炭与钢铁产业而发展起来。"}]}],"synonyms":["(no direct synonyms; it is a proper place name)"],"phonetic":"/ˈkɑnəˌmɔ/","extraExplanation":["“Conemaugh”源自美洲原住民语言（常被认为与阿尔冈昆语系有关），一般被解释为与“水獭（otter）”或“水獭出没的地方”相关；不同资料对具体词源说法略有差异。","该地区在美国历史上常与“约翰斯敦大洪水（Johnstown Flood, 1889）”的背景联系在一起：洪水与上游水库大坝决堤有关，影响了包括科尼莫河流域在内的城镇。"]}
{"word":"conenchyma","summary":{"en":"Collenchyma is a flexible supporting tissue in young parts of plants.","zh":"厚角组织是植物幼嫩部位中提供柔韧支撑的一种组织。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of plant tissue made of living cells with unevenly thickened cell walls, giving flexible support to young stems, leaf stalks, and leaf veins.","zh":"一种植物组织，由活细胞构成，细胞壁不均匀增厚，为幼嫩的茎、叶柄和叶脉提供有弹性的支撑。"},"examples":[{"en":"Collenchyma helps support young stems while they are still growing.","zh":"厚角组织帮助支撑仍在生长的幼嫩茎。"},{"en":"In many plants, collenchyma is found just under the epidermis.","zh":"在许多植物中，厚角组织位于表皮下方。"}]}],"synonyms":["supporting tissue (plant)"],"phonetic":"/kəˈlɛŋkɪmə/","extraExplanation":["你输入的“conenchyma”不是常见的标准拼写；在植物学里最接近、最常用的术语是“collenchyma（厚角组织）”。如果你是在课本或实验报告中看到该词，建议核对原文是否为拼写错误。","厚角组织与“sclerenchyma（厚壁组织）”常被对比：厚角组织细胞是活的、支撑更柔韧；厚壁组织细胞多为死细胞、壁更厚更硬，提供更坚硬的支撑。"]}
{"word":"conenose","summary":{"en":"Conenose is a noun for a “kissing bug,” a cone-headed blood-sucking insect that can sometimes spread Chagas disease.","zh":"Conenose 是名词，指“接吻虫/锥鼻虫”，一种头部呈锥形的吸血昆虫，有时可能传播查加斯病。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of blood-sucking insect (a “kissing bug”), especially one in the genus Triatoma, known for a cone-shaped head and for sometimes spreading Chagas disease","zh":"一种吸血昆虫（“接吻虫”），常指锥蝽属（Triatoma）的昆虫，因头部呈锥形而得名；有时可传播查加斯病"},"examples":[{"en":"The camper found a conenose bug near the sleeping bag.","zh":"露营者在睡袋旁发现了一只锥鼻虫（接吻虫）。"},{"en":"In some regions, conenose insects can carry parasites that cause Chagas disease.","zh":"在一些地区，锥鼻虫可能携带导致查加斯病的寄生虫。"}]}],"synonyms":["kissing bug","triatomine bug","Triatoma"],"phonetic":"/ˈkoʊnˌnoʊz/","extraExplanation":["“conenose”常见写法还有 conenose bug、cone-nose bug 或分开写 cone nose。它在北美英语里常用来指“kissing bug（接吻虫）”。","之所以叫“kissing bug”，是因为这种虫子常在夜间叮咬人的脸部（尤其嘴唇附近）。不过多数叮咬并不意味着一定会感染疾病；是否有风险与地区、虫种、以及是否携带寄生虫有关。","如果你是在家里或野外发现疑似 conenose 的虫子，常见建议是避免徒手捏碎，使用容器安全捕捉并联系当地的虫害防治或卫生部门确认。"]}
{"word":"conenoses","summary":{"en":"Conenoses are “kissing bugs”—blood-sucking insects with cone-shaped heads; some can spread Chagas disease.","zh":"conenoses 指“接吻虫/锥鼻虫”的复数：一种头部呈锥形的吸血昆虫，部分种类可能传播查加斯病。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural: conenoses) A conenose is a blood-sucking insect (a type of triatomine “kissing bug”) with a long, cone-shaped head; some species can spread Chagas disease.","zh":"（复数：conenoses）锥头虫/锥鼻虫：一种吸血昆虫（锥蝽科，俗称“接吻虫”），头部呈锥形；某些种类可能传播查加斯病。"},"examples":[{"en":"In some rural areas, conenoses may enter houses at night looking for blood meals.","zh":"在一些乡村地区，锥鼻虫可能在夜间进入房屋寻找吸血的机会。"},{"en":"The doctor asked whether she had been bitten by a conenose (kissing bug).","zh":"医生询问她是否被锥鼻虫（接吻虫）叮咬过。"}]}],"synonyms":["kissing bugs","triatomine bugs","assassin bugs (some species)"],"phonetic":"/ˈkoʊnˌnoʊz/","extraExplanation":["“conenose / cone-nose / conenose bug”在北美语境中常与“kissing bug（接吻虫）”并用。它们常在夜间叮咬人脸部周围，因此得名。","有些锥鼻虫可能携带寄生虫（Trypanosoma cruzi），与“Chagas disease（查加斯病）”有关；但并非所有叮咬都会导致感染，且不同地区风险差异很大。","你输入的“conenoses”是复数形式；单数是“conenose”。"]}
{"word":"conepate","summary":{"en":"“Constipate” means to cause constipation (difficulty passing stool).","zh":"“constipate”指“使便秘/导致排便困难”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone unable to pass stool easily; to cause constipation","zh":"使（某人）便秘；导致排便困难"},"examples":[{"en":"Some pain medicines can constipate you.","zh":"有些止痛药会让你便秘。"},{"en":"Too little fiber and water may constipate the body.","zh":"纤维和水分摄入太少可能会导致便秘。"}]},{"partOfSpeech":"vi.","definition":{"en":"(less common) to become constipated","zh":"（较少见）变得便秘"},"examples":[{"en":"If you travel and change your diet, you might constipate.","zh":"旅行时饮食变化，你可能会变得便秘。"}]}],"synonyms":["cause constipation","back up (informal)"],"phonetic":"/ˈkɑnstəˌpeɪt/","extraExplanation":["“conepate” 不是常见英语单词；你可能想查的是 **constipate**（使便秘）。如果你原本想表达“沉思/考虑”，可能是 **contemplate**。","在日常英语里，更常用形容词 **constipated**（便秘的）：e.g., “I feel constipated.”（我觉得便秘）。"]}
{"word":"conepates","summary":{"en":"“Conepates” is not a real word; you probably mean “constipates,” meaning “causes constipation.”","zh":"“conepates”不是英文单词；你可能想写“constipates”，意思是“导致便秘”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “constipates” (the third-person singular form of “constipate”).","zh":"不是标准英文单词。很可能是把“constipates”（动词 constipate 的第三人称单数）拼错了。"},"examples":[{"en":"I think you meant “constipates,” not “conepates.”","zh":"我觉得你想写的是“constipates”，不是“conepates”。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make someone constipated; to cause difficulty in passing stool","zh":"使（某人）便秘；导致排便困难"},"examples":[{"en":"Some pain medicines can constipate you.","zh":"有些止痛药会让人便秘。"},{"en":"Too little fiber sometimes constipates people.","zh":"膳食纤维太少有时会让人便秘。"}]}],"synonyms":["cause constipation","block up (informal)","make (someone) constipated"],"phonetic":"/ˈkɑnstəˌpeɪts/","extraExplanation":["“constipate”是比较正式的医学/健康用语；日常口语里更常说 “be constipated（便秘了）”。","“constipates”是现在时第三人称单数：He/She/It constipates…（它会导致便秘）。如果你要说“我便秘了”，通常说：I’m constipated."]}
{"word":"conepatl","summary":{"en":"“conepatl” isn’t recognized as a standard English word; please provide context or confirm the intended spelling.","zh":"“conepatl”不是标准英文词；请提供上下文或确认你想输入的正确拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a name/username, or a word from another language.","zh":"不是标准英语单词。可能是拼写错误、姓名/用户名，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “conepatl” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里查不到“conepatl”——你能把看到它的句子发我吗？"},{"en":"If you meant a different spelling, I can define it once you confirm the correct word.","zh":"如果你想输入的是另一个拼写，你确认正确单词后我就能解释它。"}]}],"extraExplanation":["我查不到“conepatl”作为常见英文词条。它看起来更像：\n1）拼写打错（例如多/少了字母）；\n2）专有名词（人名、地名、品牌、游戏ID）；\n3）其他语言的词（例如某些原住民语言或构词）。\n\n你可以告诉我：它出现的上下文句子、你想表达的意思，或你是否想查某个相近拼写（把你原本想打的词也发我）。我就能更准确地给出释义和例句。"]}
{"word":"conepatls","summary":{"en":"“conepatls” isn’t an English word; it’s likely a misspelling. Share the intended word or a sentence for an accurate lookup.","zh":"“conepatls”不是英文单词，可能是拼写错误。请提供你想要的词或一个例句以便准确查询。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It looks like a typo or misspelling, so I can’t give a reliable definition yet.","zh":"这不是一个标准的英文单词，看起来像是拼写错误或误输入，因此目前无法给出可靠释义。"},"examples":[{"en":"I couldn’t find “conepatls” in a dictionary—could you check the spelling?","zh":"我在词典里找不到“conepatls”，你能检查一下拼写吗？"},{"en":"Did you mean “cone petals” (petals shaped like a cone) or another word?","zh":"你想表达的是“cone petals”（锥形的花瓣）还是别的单词？"}]}],"extraExplanation":["你可以把你想表达的意思（中文也可以）发我，或提供一个完整句子，我就能更准确地判断你要查的词。","从字母形状看，可能是键盘误触/漏字导致的拼写：常见的接近候选可能是“cone petals”（短语）、“contemplates”（动词：沉思/考虑）等，但需要你的上下文来确认。"]}
{"word":"coner","summary":{"en":"“Coner” is usually a misspelling of “corner.”","zh":"“coner”通常是“corner”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A common misspelling of “corner.”","zh":"“corner”的常见拼写错误。"},"examples":[{"en":"I think you meant “corner,” not “coner.”","zh":"我想你想写的是“corner”，不是“coner”。"},{"en":"Please meet me at the corner of 5th and Main.","zh":"请在第五大道和主街的街角等我。"}]}],"synonyms":["corner"],"phonetic":"/ˈkɔrnər/","extraExplanation":["“Coner”在现代英语里通常不是标准词汇，多数情况下是把“corner（角落；拐角；使陷入困境）”拼错了。","少数情况下，“Coner/Conner”可能是姓氏（如人名或品牌名），这时要看上下文来判断。"]}
{"word":"cones","summary":{"en":"Cones are cone-shaped things: a geometric cone, items like traffic cones or ice-cream cones, or pine cones from trees.","zh":"cones 是 cone 的复数，可指几何上的圆锥体、像路锥/蛋筒这样的圆锥状物体，或树上的松果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A 3D shape with a circular base and a pointed top (apex).","zh":"（几何）圆锥体：底面为圆形、顶部为尖点的三维形状。"},"examples":[{"en":"A cone has one circular base and one point at the top.","zh":"圆锥体有一个圆形底面和一个顶部尖点。"},{"en":"The volcano was shaped like a cone.","zh":"那座火山的形状像个圆锥。"}]},{"partOfSpeech":"n.","definition":{"en":"A cone-shaped object, especially one used to hold food or mark an area (e.g., an ice-cream cone or a traffic cone).","zh":"圆锥状物体（尤指盛装食物的蛋筒或用于标示区域的路锥/交通锥）。"},"examples":[{"en":"I’d like a chocolate ice-cream cone, please.","zh":"我想要一个巧克力冰淇淋蛋筒。"},{"en":"Orange cones blocked off the road for construction.","zh":"橙色路锥把道路隔开用于施工。"}]},{"partOfSpeech":"n.","definition":{"en":"The cone of a pine or similar tree (a woody structure that contains seeds).","zh":"（植物）松果：松树等树木结的球果，内含种子。"},"examples":[{"en":"We collected pine cones in the park.","zh":"我们在公园里捡了松果。"},{"en":"The squirrel carried a cone up the tree.","zh":"松鼠叼着一个松果爬上了树。"}]},{"partOfSpeech":"vt.","definition":{"en":"To form or shape something into a cone.","zh":"把……做成圆锥形；使……呈圆锥状。"},"examples":[{"en":"Cone the paper and tape it to make a simple funnel.","zh":"把纸卷成圆锥并用胶带固定，就能做一个简易漏斗。"}]}],"synonyms":["conical shape","traffic marker","pine cone (for the tree meaning)"],"phonetic":"/koʊn/","extraExplanation":["“cones”是名词“cone”的复数形式，也可以是动词“cone”的第三人称单数（较少见）。","常见搭配：traffic cone（路锥/交通锥）、ice-cream cone（冰淇淋蛋筒）、pine cone（松果）、cone-shaped（圆锥形的）。"]}
{"word":"conessine","summary":{"en":"Conessine is a plant alkaloid from the kurchi tree, mainly used as a scientific term in pharmacology and herbal-medicine contexts.","zh":"Conessine 指来自抗痢木（kurchi）等植物的一种生物碱，主要用于药理与草药研究语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bitter alkaloid (natural chemical) found especially in the bark and seeds of the kurchi tree (Holarrhena antidysenterica), studied for possible medicinal effects (such as antimicrobial or antiparasitic activity).","zh":"一种苦味生物碱（天然化学物质），主要存在于“库尔奇树/抗痢木”(Holarrhena antidysenterica) 的树皮和种子中，常见于药理研究语境，研究其潜在药用作用（如抗菌、抗寄生虫等）。"},"examples":[{"en":"Researchers isolated conessine from Holarrhena bark and tested it against bacteria in the lab.","zh":"研究人员从霍拉瑞娜（抗痢木）树皮中分离出康尼辛（conessine），并在实验室中测试其对细菌的作用。"},{"en":"Conessine is not a common everyday word; you mostly see it in pharmacology or herbal medicine articles.","zh":"Conessine 不是日常常用词，你多在药理学或草药相关文章中见到它。"}]}],"synonyms":["(no common everyday synonym; related: alkaloid)"],"phonetic":"/kəˈnɛsiːn/","extraExplanation":["该词更偏“学术/医学”用语，常与印度传统草药（如 Ayurveda 体系中使用的 kurchi/抗痢木）相关；在现代语境里多用于描述从植物中分离出的具体化合物。","拼写提示：conessine 以 -ine 结尾，英语里常见于“生物碱/化学物质”名称（如 caffeine, nicotine），读起来也常接近“*seen*”的尾音。"]}
{"word":"Conestee","summary":{"en":"Conestee is a South Carolina place name (near Greenville), used for local parks, a reservoir, and the surrounding community.","zh":"Conestee 是美国南卡罗来纳州（格林维尔附近）的地名，常用于当地公园、水库及周边社区。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A place name in South Carolina (U.S.), especially used for areas near Greenville such as Conestee Park, Conestee Reservoir, and the Conestee community.","zh":"美国南卡罗来纳州的地名，常指格林维尔（Greenville）附近的区域，如 Conestee Park（康尼斯蒂公园）、Conestee Reservoir（康尼斯蒂水库）及 Conestee 社区。"},"examples":[{"en":"We went for a walk at Conestee Park after dinner.","zh":"晚饭后我们去康尼斯蒂公园散步。"},{"en":"The birds around Conestee Reservoir are great for photos.","zh":"康尼斯蒂水库一带的鸟类很适合拍照。"},{"en":"She lives near Conestee, just outside Greenville.","zh":"她住在康尼斯蒂附近，就在格林维尔市外。"}]}],"phonetic":"/ˌkɑnəsˈtiː/","extraExplanation":["“Conestee”多作为专有名词（地名）使用，通常不翻译或按音译处理。","如果你在新闻、地图或旅游信息中看到它，一般指格林维尔周边的公园/水库/社区等具体地点。","该地名的更早来源可能与当地历史或原住民语言有关，但不同资料说法不一；如果你需要，我可以根据你看到它的具体语境（例如地图链接或句子）进一步解释。"]}
{"word":"Conestoga","summary":{"en":"Conestoga is best known as the name of a heavy covered freight wagon from early America, and it is also a Pennsylvania place name (especially the Conestoga River).","zh":"Conestoga 最常指早期美国用于运货的大型有篷马车（康尼斯托加篷车），也可指宾夕法尼亚州的地名（尤指康尼斯托加河）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large, heavy covered wagon first built in Pennsylvania, used in the 1700s–1800s for hauling freight (and sometimes for long-distance travel); often called a “Conestoga wagon.”","zh":"（最早在宾夕法尼亚制造的）康尼斯托加篷车/货运篷车：一种大型、结实的有篷马车，18—19世纪常用于运货（有时也用于长途旅行）。"},"examples":[{"en":"The museum has a restored Conestoga wagon from the 1800s.","zh":"博物馆里有一辆修复好的19世纪康尼斯托加篷车。"},{"en":"Before trains became common, goods often traveled by Conestoga wagon.","zh":"在火车普及之前，货物常常靠康尼斯托加篷车运输。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name in Pennsylvania (e.g., the Conestoga River and communities named Conestoga).","zh":"康尼斯托加（美国宾夕法尼亚州的地名，如康尼斯托加河以及同名社区等）。"},"examples":[{"en":"They went fishing on the Conestoga River.","zh":"他们去康尼斯托加河钓鱼了。"},{"en":"Conestoga is near Lancaster County in Pennsylvania.","zh":"康尼斯托加在宾夕法尼亚州的兰开斯特县附近。"}]}],"synonyms":["Conestoga wagon","covered wagon","freight wagon","prairie schooner (similar, not identical)"],"phonetic":"/ˌkɑnəˈstoʊɡə/","extraExplanation":["“Conestoga”源自当地原住民部族名称（Conestoga people，常与萨斯奎哈诺克族群相关）。地名与马车名称都与宾夕法尼亚早期殖民与贸易路线有关。","Conestoga wagon 车身常做成“中间下凹、两头上翘”的形状，便于防止货物滑落；主要用于运货。它常与美国“西进运动”联系在一起，但真正大量走向西部的更常是更轻便的“prairie schooner（草原帆船）”。"]}
{"word":"conestoga","summary":{"en":"Conestoga usually refers to the historic Conestoga wagon, and it can also be a proper name for places in Pennsylvania.","zh":"Conestoga通常指历史上的“康尼斯托加篷车”，也可作为宾夕法尼亚州相关地名的专有名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large, heavy covered wagon first built in the Conestoga Valley of Pennsylvania, used in the 1700s–1800s to haul goods (and later linked with westward travel in the U.S.).","zh":"（美国）康尼斯托加篷车：最早在宾夕法尼亚州康尼斯托加谷制造的一种大型重型篷车，18–19世纪用于运输货物（后来也与美国向西拓荒的历史联系在一起）。"},"examples":[{"en":"Museums often display a Conestoga wagon with its tall canvas cover.","zh":"博物馆里常常展出带高高帆布篷的康尼斯托加篷车。"},{"en":"The merchant shipped flour and tools by Conestoga wagon across rough roads.","zh":"商人用康尼斯托加篷车把面粉和工具沿着崎岖道路运走。"}]},{"partOfSpeech":"n.","definition":{"en":"a name used for places and institutions (for example, the Conestoga River/Valley in Pennsylvania).","zh":"康尼斯托加：用于地名或机构名称（例如宾夕法尼亚州的康尼斯托加河/康尼斯托加谷）。"},"examples":[{"en":"They went hiking near the Conestoga River.","zh":"他们去康尼斯托加河附近徒步。"},{"en":"She studies at a school in the Conestoga Valley.","zh":"她在康尼斯托加谷的一所学校就读。"}]}],"synonyms":["Conestoga wagon","covered wagon","freight wagon"],"phonetic":"/ˌkɑnəˈstoʊɡə/","extraExplanation":["“Conestoga”来自宾夕法尼亚的康尼斯托加谷（Conestoga Valley）。在历史语境里，它最常让人想到“Conestoga wagon”（康尼斯托加篷车）：车身较大、底部弯曲，适合载重并防止货物滑落。","在美国西部拓荒故事中常见的“prairie schooner（草原帆船）”通常更轻便，主要用于移民长途迁徙；而Conestoga wagon更偏向商业运输。","读历史或文学作品时，看到“Conestoga”多半与殖民时期道路、商贸运输或早期拓荒背景有关。"]}
{"word":"Conesus","summary":{"en":"Conesus is a proper place name in western New York, especially Conesus Lake and the nearby community.","zh":"Conesus 是纽约州西部的地名，尤指康尼瑟斯湖及其附近社区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name in western New York State (U.S.), most commonly referring to Conesus Lake and the nearby Town/Hamlet of Conesus in Livingston County.","zh":"美国纽约州西部的地名，最常指利文斯顿县的康尼瑟斯湖（Conesus Lake）以及附近的康尼瑟斯镇/村（Town/Hamlet of Conesus）。"},"examples":[{"en":"We spent the weekend kayaking on Conesus Lake.","zh":"我们周末在康尼瑟斯湖划皮艇。"},{"en":"She grew up near Conesus, New York, before moving to Rochester.","zh":"她在纽约州康尼瑟斯附近长大，后来搬到罗切斯特。"}]}],"synonyms":["Conesus Lake (related name)"],"phonetic":"/kəˈniːsəs/","extraExplanation":["“Conesus”是专有名词，通常不翻译；写作时常见搭配是“Conesus Lake（康尼瑟斯湖）”。","该地名来源于美洲原住民语言（常被认为与易洛魁语系有关），因此拼写与读音和常见英语词根不太一致。"]}
{"word":"Conesville","summary":{"en":"Conesville is a U.S. place name, most often referring to towns/communities in Iowa or Ohio.","zh":"Conesville 是美国的地名，通常指爱荷华州或俄亥俄州的同名城镇/社区。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a place name (proper noun): the name of a small town or community in the United States, most commonly referring to Conesville, Iowa, or Conesville, Ohio.","zh":"地名（专有名词）：美国的一个小镇或社区名称，最常见指爱荷华州（Iowa）或俄亥俄州（Ohio）的 Conesville。"},"examples":[{"en":"I grew up near Conesville, Iowa, and we used to drive to Muscatine on weekends.","zh":"我在爱荷华州的 Conesville 附近长大，我们周末常开车去马斯卡廷（Muscatine）。"},{"en":"Conesville, Ohio is a small village in Coshocton County.","zh":"俄亥俄州的 Conesville 是科肖克顿县（Coshocton County）的一个小村庄。"}]}],"synonyms":["(no direct synonyms; use “Conesville, IA/OH” for clarity)"],"phonetic":"ˈkoʊnzvɪl","extraExplanation":["“Conesville”是由“Cone(s)”+“-ville（城镇）”构成的英语地名样式；在美国有不止一个同名地点，所以在写作或旅行信息中通常会加州名（如 Conesville, IA / Conesville, OH）来避免混淆。"]}
{"word":"Conetoe","summary":{"en":"Conetoe is most commonly a place name: a small town in Edgecombe County, North Carolina.","zh":"Conetoe 最常见是地名：美国北卡罗来纳州埃奇科姆县的一个小镇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small town (incorporated town) in Edgecombe County, North Carolina, USA.","zh":"美国北卡罗来纳州埃奇科姆县（Edgecombe County）的一个小镇（建制镇）。"},"examples":[{"en":"Conetoe is a small town in eastern North Carolina.","zh":"Conetoe 是北卡罗来纳州东部的一个小镇。"},{"en":"She drove through Conetoe on her way to Tarboro.","zh":"她去塔博罗（Tarboro）的路上开车经过了 Conetoe。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname), less common.","zh":"姓氏（较少见）。"},"examples":[{"en":"Mr. Conetoe spoke at the community meeting.","zh":"Conetoe 先生在社区会议上发言。"}]}],"phonetic":"ˈkɑːnəˌtoʊ","extraExplanation":["“Conetoe”在日常英语里最常见的是地名（专有名词）。地名在英语中通常不加冠词（不说 *the Conetoe*），但可以说 *in Conetoe*、*to Conetoe*。","关于名称来源：一些北卡地名与当地原住民语言有关，但“Conetoe”的确切词源在常见学习词典中不总是明确记载；如果你需要更权威的词源信息，通常要查地方历史资料或州/县档案。"]}
{"word":"Coney","summary":{"en":"“Coney” can mean an old-fashioned word for “rabbit,” and it’s also best known in “Coney Island,” a famous amusement beach area in New York City.","zh":"“Coney”既可指“兔子”（较旧用法），更常见于“Coney Island（科尼岛）”，指纽约著名的海滨游乐区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rabbit (an older or less common word, especially in British English); sometimes also used for the animal “pika.”","zh":"兔子（较旧或不太常用的说法，偏英式英语）；有时也指“鼠兔（pika）”。"},"examples":[{"en":"In older stories, a “coney” often means a rabbit.","zh":"在较老的故事里，“coney”常常指兔子。"},{"en":"The word “coney” is rarely used in everyday modern English.","zh":"“coney”在现代日常英语中很少使用。"}]},{"partOfSpeech":"n.","definition":{"en":"Coney Island: a famous beach and amusement area in Brooklyn, New York City.","zh":"科尼岛（Coney Island）：美国纽约市布鲁克林著名的海滨游乐区。"},"examples":[{"en":"We spent the afternoon at Coney Island riding the roller coasters.","zh":"我们在科尼岛坐过山车，玩了一下午。"},{"en":"Coney Island is known for its boardwalk, hot dogs, and summer crowds.","zh":"科尼岛以木栈道、热狗和夏季人潮而闻名。"}]}],"synonyms":["rabbit","bunny","Coney Island"],"phonetic":"/ˈkoʊni/","extraExplanation":["“Coney Island”在美国文化里很有代表性：常让人联想到复古游乐园、海边木栈道、烟火、以及经典的纽约热狗（如Nathan’s Famous）。在电影、歌曲和文学作品中也常被用来营造“热闹、怀旧、带点奇幻的城市海边”氛围。","发音与拼写提示：Coney读作两音节“KOH-nee”。很多学习者会把它读成类似“coney=cone”，但结尾是“-y”的/i/音。"]}
{"word":"coney","summary":{"en":"Coney can mean an old-fashioned “rabbit,” or (in the US) a chili-topped hot dog called a “Coney dog.”","zh":"coney既可指（古义）“兔子”，也可在美式英语中指浇辣肉酱的热狗（Coney dog）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) a rabbit; an old spelling of “cony.”","zh":"（古义）兔子；“cony”的旧拼法。"},"examples":[{"en":"In old stories, a “coney” often means a rabbit.","zh":"在旧故事里，“coney”常常指兔子。"},{"en":"The hunter tracked a coney into the bushes.","zh":"猎人追踪一只兔子进了灌木丛。"}]},{"partOfSpeech":"n.","definition":{"en":"(US, informal) a “Coney dog”: a hot dog topped with chili sauce (often with onions and mustard).","zh":"（美式非正式）“Coney dog / coney”：浇辣肉酱的热狗（常配洋葱和芥末）。"},"examples":[{"en":"Let’s grab a couple of coneys after the game.","zh":"比赛后我们去吃几根辣肉酱热狗吧。"},{"en":"Detroit is famous for its coneys.","zh":"底特律以辣肉酱热狗闻名。"}]}],"synonyms":["rabbit (for the animal sense)","Coney dog","chili dog (similar)"],"phonetic":"/ˈkoʊni/","extraExplanation":["“coney”表示“兔子”时属于较旧/文学化用法，现代英语更常用“rabbit”，“cony”也较少见。","表示热狗时通常与美国地名与饮食文化相关：名称常被认为与“Coney Island”有关，但“Coney dog”这一做法在美国中西部（如密歇根州底特律）尤其流行。"]}
{"word":"coneys","summary":{"en":"“Coneys” can mean either rabbits (an older word) or Coney hot dogs with meat sauce.","zh":"“Coneys”既可指兔子（较旧的说法），也可指浇肉酱的Coney热狗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"rabbits (plural of “coney,” an older/poetic word for a rabbit)","zh":"兔子（“coney”的复数；较古老或带文学色彩的“兔子”说法）"},"examples":[{"en":"In the fields, the farmer saw coneys dart into their burrows.","zh":"在田野里，农夫看见兔子飞快地钻进洞里。"},{"en":"The story describes foxes hunting coneys at dusk.","zh":"故事描写狐狸在黄昏时分捕猎兔子。"}]},{"partOfSpeech":"n.","definition":{"en":"Coney hot dogs (hot dogs topped with a meat sauce, often with onions and mustard), especially in the U.S.","zh":"“Coney”辣肉酱热狗（热狗上浇肉酱，常配洋葱和芥末），尤指美国常见做法"},"examples":[{"en":"We grabbed two coneys and a soda after the game.","zh":"比赛后我们买了两份Coney辣肉酱热狗和一杯汽水。"},{"en":"This diner is famous for its coneys with extra onions.","zh":"这家小餐馆以加大量洋葱的Coney辣肉酱热狗出名。"}]}],"synonyms":["rabbits","bunnies","coney dogs","chili dogs"],"phonetic":"/ˈkoʊni/","extraExplanation":["“coney”作“兔子”时属于较旧的英语用法，在现代日常英语里更常说“rabbit”。你可能会在圣经译本、古典文学或诗歌里见到它。","“Coney”作热狗名称与纽约的Coney Island（科尼岛）有关，但“Coney dog”在美国中西部（如密歇根、俄亥俄一带）也很常见，常见搭配说法有“Coney sauce / chili sauce（肉酱/辣椒肉酱）”。"]}
