{"word":"Cong","summary":{"en":"“Cong” is most often seen as an uncommon shorthand for “congrats,” an abbreviation for “Congress” (Cong.), or a Vietnamese given name.","zh":"“Cong”最常见的用法是（较少见的）“congrats”的简写、表示“Congress（国会）”的缩写（Cong.），或作为越南人名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(informal, texting) A shortened form of “congrats / congratulations.” (Less common than “congrats.”)","zh":"（非正式、短信用语）“congrats / congratulations（恭喜）”的缩写形式。（不如“congrats”常见）"},"examples":[{"en":"Cong! You passed the exam.","zh":"Cong！你考试通过了。"},{"en":"Cong on your new job!","zh":"Cong你找到新工作啦！"}]},{"partOfSpeech":"other","definition":{"en":"(often written “Cong.”) Abbreviation for “Congress” in some contexts (especially titles, references, or notes).","zh":"（常写作“Cong.”）在某些语境中是“Congress（国会）”的缩写（多见于标题、引用或注释）。"},"examples":[{"en":"See the report submitted to Cong. in 2024.","zh":"参见2024年提交给Cong.（国会）的报告。"},{"en":"He worked as a staffer on Capitol Hill (in Cong.).","zh":"他曾在国会山工作（在Cong.）。"}]},{"partOfSpeech":"other","definition":{"en":"A Vietnamese given name (often from “Công”), used as a personal name in English writing.","zh":"越南语人名（常源自“Công”），在英文中作为姓名拼写出现。"},"examples":[{"en":"Cong Nguyen will present the project today.","zh":"Cong Nguyen 今天将展示这个项目。"},{"en":"I met Cong at a conference in Hanoi.","zh":"我在河内的一个会议上认识了Cong。"}]}],"synonyms":["congrats","congratulations","Congress"],"phonetic":"/kɑŋ/","extraExplanation":["在英文里单独写“Cong”比较少见：表达“恭喜”更常用“Congrats!”；表达“国会”更常见直接写“Congress”或在正式资料里用“Cong.”。","作为越南人名时，“Cong”通常来自越南语“Công”（常与“功、工、功绩/劳动”等含义相关），英文中为方便输入可能省略声调。"]}
{"word":"cong","summary":{"en":"“Cong” most commonly refers (historically, informally) to the Viet Cong; it can also be a surname or an abbreviation for “Congress.”","zh":"“Cong”最常见（历史、非正式）指“越共”；也可作姓氏，或作“Congress（国会）”的缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, historical) A member of the Viet Cong (the communist-led guerrilla force in South Vietnam during the Vietnam War).","zh":"（非正式、历史用语）越共成员（越南战争时期南越的共产主义领导的游击力量成员）。"},"examples":[{"en":"Some war-era films refer to enemy fighters as “the Cong.”","zh":"一些战争年代的电影会把敌方战斗人员称作“the Cong（越共）”。"},{"en":"The term appears in older news reports about the Vietnam War.","zh":"这个词常出现在关于越南战争的旧新闻报道中。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname), found in several cultures (e.g., Vietnamese/Chinese communities).","zh":"一个姓氏，在一些文化中可见（例如越南/华人社群）。"},"examples":[{"en":"Ms. Cong will present the report today.","zh":"Cong 女士今天将做报告。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation used in some contexts for “congress” or “congressional.”","zh":"（缩写）在某些语境中表示“国会”或“国会的”。"},"examples":[{"en":"The memo uses “Cong.” to mean “Congress.”","zh":"这份备忘录用“Cong.”表示“Congress（国会）”。"}]}],"synonyms":["Viet Cong (neutral/standard)","NLF (National Liberation Front)","Congress (abbr. context)"],"phonetic":"/kɑŋ/","extraExplanation":["“the Cong”主要是越南战争时期英语里的口语/军中用法，带有明显时代色彩；在当代语境中可能显得粗略甚至冒犯。更中性、更准确的说法通常是“Viet Cong”或“the National Liberation Front (NLF)”。","如果你想表达中文拼音“cōng（葱/聪/从等）”或越南语人名“Công”，请告诉我具体语境（句子或你想表达的意思），我可以帮你对应到正确的英文词。"]}
{"word":"conga","summary":{"en":"“Conga” most commonly means a lively Afro-Cuban dance (often in a line) or a tall hand drum used in Latin music.","zh":"“conga”常指热烈的古巴康加舞（常排成一列）或拉丁音乐中使用的康加鼓。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lively Afro-Cuban dance (often done in a line) and the music for it, common at parties and celebrations","zh":"康加舞（常排成一列的热烈古巴舞）及其音乐，常见于派对和庆典"},"examples":[{"en":"At the wedding, everyone joined the conga line around the room.","zh":"在婚礼上，大家都加入了康加舞队列，绕着房间跳。"},{"en":"The band played conga music and the crowd started clapping to the beat.","zh":"乐队演奏康加音乐，人群跟着节拍拍手。"}]},{"partOfSpeech":"n.","definition":{"en":"a tall, narrow drum used in Latin music, played with the hands","zh":"康加鼓（一种拉丁音乐中常用的高而窄的手鼓）"},"examples":[{"en":"She learned basic rhythms on the conga.","zh":"她学会了康加鼓的基本节奏。"},{"en":"You can hear the conga clearly in salsa songs.","zh":"在萨尔萨歌曲里你能清楚听到康加鼓的声音。"}]}],"synonyms":["conga line","Latin hand drum"],"phonetic":"/ˈkɑŋɡə/","extraExplanation":["“conga”与古巴的黑人文化传统关系密切，后来在拉丁音乐（如salsa）中非常常见；派对里常说“conga line（康加舞队列）”，大家一边走一边跳，通常扶着前一个人的肩。"]}
{"word":"congaed","summary":{"en":"“congaed” is a nonstandard past tense meaning “danced the conga.”","zh":"“congaed”是“conga”的非标准过去式，表示“跳了康加舞”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Nonstandard past tense of “conga” (to do the conga dance), meaning “danced the conga.”","zh":"“conga”（跳康加舞）的非标准过去式，意思是“跳了康加舞”。"},"examples":[{"en":"We congaed around the room at the wedding reception.","zh":"我们在婚礼宴会上围着房间跳康加舞。"},{"en":"They congaed in a long line, laughing the whole time.","zh":"他们排成一长列跳康加舞，全程都在笑。"}]}],"synonyms":["danced the conga","did the conga"],"phonetic":"/ˈkɑːŋɡeɪd/","extraExplanation":["“congaed”在拼写上不太常见，很多写法会用“congaed”或更口语/非正式的“conga’d”。在正式写作里，更自然的表达常是：“did the conga”或“danced the conga”。","“conga”本来是舞蹈/音乐名（源自拉丁音乐文化），英语里把它当动词使用多见于轻松、派对语境。"]}
{"word":"congaing","summary":{"en":"“Congaing” means dancing the conga, usually in a conga line; it’s an uncommon, informal spelling.","zh":"“congaing”指跳康加舞（常为康加舞队），但这种拼写较少见、偏非正式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Informal/nonstandard spelling of the present participle of “conga,” meaning dancing the conga (often in a conga line).","zh":"“conga”的现在分词的非正式/不规范拼写，意思是跳康加舞（常指排成“康加舞队”一起跳）。"},"examples":[{"en":"We ended up congaing around the room after dinner.","zh":"晚饭后我们最后在房间里排成队跳起了康加舞。"},{"en":"They were congaing in a long line at the wedding reception.","zh":"他们在婚宴上排着长队跳康加舞。"}]}],"synonyms":["dancing the conga","doing the conga","forming a conga line"],"phonetic":"/ˈkɑŋɡəɪŋ/","extraExplanation":["“congaing”在现实写作里比较少见，更常见的表达是“dancing the conga”或“doing the conga / a conga line”。如果你是在正式场合写作，建议用这些更常见、更自然的说法。","“conga”原本指一种源自古巴、带有非洲节奏影响的舞蹈与音乐形式；在英语文化里，“conga line（康加舞队）”常出现在派对、婚礼等热闹场合，大家排成一列跟着音乐走动、摆动。"]}
{"word":"congas","summary":{"en":"Congas are tall hand drums used in Afro-Cuban and Latin music.","zh":"Congas 指用于非裔古巴与拉丁音乐的高筒形手鼓（康加鼓）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A set of tall, narrow drums (usually played in pairs or a small group) used in Afro-Cuban and Latin music, played with the hands.","zh":"康加鼓；一种高而窄的手鼓（常成对或成组演奏），常用于非裔古巴与拉丁音乐。"},"examples":[{"en":"The percussionist played congas during the salsa song.","zh":"那位打击乐手在萨尔萨歌曲中演奏康加鼓。"},{"en":"You can hear the congas clearly in the chorus.","zh":"你在副歌里能清楚听到康加鼓的声音。"}]}],"synonyms":["conga drums"],"phonetic":"/ˈkɑːŋɡəz/","extraExplanation":["“congas”通常是复数形式，指一组康加鼓；单数为“conga”。","康加鼓和“bongos（邦戈鼓）”不同：conga更高更大，音色更低沉厚实；bongo较小，常夹在膝间演奏，音色更明亮。","常见搭配：conga drums（康加鼓）、play the congas（打康加鼓）、conga rhythm/beat（康加节奏）。"]}
{"word":"Congdon","summary":{"en":"Congdon is most commonly an English-language surname; it can also appear as a place name.","zh":"Congdon 最常见为英语姓氏；也可作较少见的地名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname) of English origin","zh":"（英裔常见的）姓氏：康登 / 孔登（多用于人名）"},"examples":[{"en":"Ms. Congdon will lead the meeting today.","zh":"康登女士今天将主持会议。"},{"en":"I met Dr. Congdon at a conference.","zh":"我在一次会议上见到了康登博士。"}]},{"partOfSpeech":"other","definition":{"en":"a place name (less common), used in some English-speaking regions as a name for roads, neighborhoods, or landmarks","zh":"（较少见）地名：在一些英语地区可用作道路、社区或地标的名称"},"examples":[{"en":"The library is near Congdon Avenue.","zh":"图书馆在康登大道附近。"},{"en":"They live in the Congdon neighborhood.","zh":"他们住在康登社区。"}]}],"phonetic":"/ˈkɑŋdən/","extraExplanation":["“Congdon”多见于英语国家的人名（姓）。作为姓氏时，通常不翻译含义而是音译（如“康登/孔登”），具体译法会因地区与个人偏好而不同。","英语里读姓氏时一般重音在第一音节：CONG-don。遇到不确定的姓氏读音，最礼貌的做法是直接询问对方：“How do you pronounce your last name?”"]}
{"word":"conge","summary":{"en":"Congé means formal permission to leave or a leave of absence, and it is rare in modern everyday English.","zh":"congé 指正式的“准许离开”或“休假/告假”，在现代日常英语中较少见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"formal permission to leave; a leave of absence (now rare in everyday English).","zh":"（正式用语）准许离开；休假、告假（现代日常英语中较少见）。"},"examples":[{"en":"After the meeting, she asked the chair for her congé.","zh":"会议结束后，她向主持人请求准许离开。"},{"en":"The officer was granted congé for a family emergency.","zh":"那名军官因家庭紧急情况获准休假。"}]}],"synonyms":["leave","time off","permission to leave","leave of absence"],"phonetic":"/kɑnˈʒeɪ/","extraExplanation":["“congé”来自法语，原意与“休假/许可离开”有关，在英式或较正式、历史性的语境中偶尔出现（如军队、官场、旧文体）。现代更常用的表达是：leave, permission to leave, time off。","注意别和“congee（粥，米粥）”混淆；两者拼写和读音相近，但意思完全不同。"]}
{"word":"congeable","summary":{"en":"“Congeable” means ‘able to congeal/solidify,’ but it’s rare; “congealable” is the common form.","zh":"“congeable”意为“可凝固/可凝结的”，但用法罕见；更常用的形式是“congealable”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to congeal (to become semi-solid or solid, especially when cooled), or able to be made to congeal.","zh":"可凝结的；可凝固的（尤指冷却后变得半固体或固体，或可被使之凝固）。"},"examples":[{"en":"The sauce is congeable, so it will thicken as it cools.","zh":"这酱汁是可凝固的，所以冷却后会变稠。"},{"en":"Use a little gelatin if you want the mixture to be more congeable.","zh":"如果你想让混合物更容易凝固，可以加一点明胶。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare/Nonstandard) Used as a variant of “congealable.” In modern English, “congealable” is much more common.","zh":"（少见/不太规范）有时被当作“congealable（可凝固的）”的变体；现代英语中“congealable”更常用。"},"examples":[{"en":"This term is more often written as congealable in recipes and scientific writing.","zh":"在食谱和科学写作中，这个词更常写作 congealable。"}]}],"synonyms":["congealable","coagulable","jellable","solidifiable"],"phonetic":"/kənˈdʒiːləbəl/","extraExplanation":["“congeable”在当代英语里很少见，许多词典不收或标为罕用。学习与写作时更推荐用 congealable（可凝固的）或直接用动词 congeal（凝结/凝固）。","词根来自拉丁语 con-（一起）+ gelare（冻结），与 gel（凝胶）、gelatin（明胶）同源。"]}
{"word":"congeal","summary":{"en":"Congeal means to become thick/solid (especially when cooling) or to make ideas or support become unified and clear.","zh":"congeal 指（液体）因冷却而凝结变稠/变硬，也可指（比喻）使想法、计划或支持凝聚成形、变得统一清晰。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Of a liquid) to become thick or solid, often because it cools.","zh":"（液体）凝结、变稠或变成固体，常因冷却而发生。"},"examples":[{"en":"The gravy will congeal if you leave it out too long.","zh":"肉汁如果在外面放太久会凝结变稠。"},{"en":"Blood can congeal quickly in cold weather.","zh":"在寒冷天气里，血液可能很快凝结。"}]},{"partOfSpeech":"vt.","definition":{"en":"To make something form into a solid or a unified whole (often used metaphorically).","zh":"使某物凝结成形；（常作比喻）使观点、计划或团体成形并统一起来。"},"examples":[{"en":"After several meetings, their ideas began to congeal into a clear plan.","zh":"开了几次会后，他们的想法开始凝聚成一个清晰的计划。"},{"en":"The crisis helped congeal public support for reform.","zh":"这场危机促使公众对改革的支持凝聚起来。"}]}],"synonyms":["solidify","thicken","set","coagulate","gel","harden","crystallize"],"phonetic":"/kənˈdʒiːl/","extraExplanation":["“congeal”常见搭配：congeal into（凝结/凝聚成……），congeal around（围绕……凝聚）。","比喻用法很常见，强调“从散乱到成形/成体系”的过程，语气比“form”更带“逐渐变得固定”的感觉。","词源来自拉丁语，和“gel（凝胶）”同源，因此常用于描述像油脂、汤汁、血液这类会变稠或变硬的物质。"]}
{"word":"congealability","summary":{"en":"Congealability means how able something is to congeal—thicken or become solid, usually when cooled.","zh":"Congealability 指某物“能否/多容易凝结或凝固”，通常与冷却后变稠或变硬有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the ability of a substance to congeal (to thicken or become solid, especially when cooled)","zh":"（物质）可凝结性；可凝固性（尤指冷却后变稠或变硬的能力）"},"examples":[{"en":"The congealability of the sauce depends on how much fat and gelatin it contains.","zh":"这酱汁的可凝结性取决于它含有多少脂肪和明胶。"},{"en":"Scientists tested the oil’s congealability at low temperatures.","zh":"科学家测试了这种油在低温下的凝固倾向。"}]}],"synonyms":["solidifiability","ability to congeal","gelling tendency","coagulability"],"phonetic":"/kənˌdʒiːləˈbɪləti/","extraExplanation":["“congealability”是由 congeal（凝结/凝固）+ -ability（……的能力）构成的名词，常见于食品科学、化学、材料测试等语境。日常英语里更常说“how easily it congeals / solidifies（它多容易凝固）”。"]}
{"word":"congealable","summary":{"en":"Congealable describes something that can become solid or semi-solid when it cools.","zh":"congealable 指“可凝结的”，即物质冷却后会变成固体或半固体。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to become solid (or semi-solid) when cooled.","zh":"可凝结的；可因冷却而变硬（或半固化）的。"},"examples":[{"en":"Coconut oil is congealable at cooler room temperatures.","zh":"椰子油在较凉的室温下会凝固。"},{"en":"Use a container that can handle hot liquid that later becomes congealable.","zh":"使用能装热液体、且之后会凝固的容器。"}]}],"synonyms":["solidifiable","freezable","coagulable"],"phonetic":"/kənˈdʒiːləbl/","extraExplanation":["“Congealable”来自动词“congeal”（凝结、凝固），常用于描述油脂（fat/oil）、酱汁（gravy/sauce）、血液（blood）等在降温后变稠或变硬的性质。","在烹饪语境中，它常暗示“冷却后会结成一层”或“会变成果冻状/凝脂状”，例如汤放凉后表面出现的脂肪层。","相关词对比：solidify更偏“变成固体”的一般说法；congeal更强调从液态变稠、凝结成团或半固态的过程。"]}
{"word":"congealableness","summary":{"en":"Congealableness means a substance’s ability to congeal—thicken or become solid, often when cooled.","zh":"Congealableness 指物质“可凝结性”，即能变稠或变成固体（常因冷却）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or ability of a substance to congeal (to thicken or become solid, especially when cooled)","zh":"（物质的）可凝结性；可（因冷却等）变稠或变成固体的性质"},"examples":[{"en":"The congealableness of the fat increases in colder weather, so it turns solid quickly.","zh":"天气更冷时，脂肪的可凝结性更明显，所以很快就会变成固体。"},{"en":"They tested the congealableness of different sauces to see which would coat the food best.","zh":"他们测试了不同酱汁的可凝结性，看看哪一种最能均匀裹住食物。"}]}],"synonyms":["congealability","solidifiability","coagulability","ability to congeal"],"phonetic":"/kənˈdʒiːləbəlnəs/","extraExplanation":["这个词非常少见，多用于技术或较正式的描述；日常英语更常说 congealability、ability to congeal，或直接用形容词 congealable（“可凝结的”）。","构词提示：congeal（凝结）+ -able（能……的）+ -ness（……的性质）→ congealableness（“能凝结的性质/程度”）。"]}
{"word":"congealed","summary":{"en":"Congealed means thickened or partly solidified, usually after cooling; it’s also the past form of “congeal.”","zh":"congealed 指（多因冷却而）变稠、凝固的；也可作 congeal 的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having become thick, semi-solid, or firm (often from cooling), so it no longer flows easily.","zh":"（常因冷却而）凝固的、变稠成半固体的，不再容易流动的。"},"examples":[{"en":"The gravy congealed as it cooled on the table.","zh":"肉汁在桌上变凉后就凝固了。"},{"en":"There was a layer of congealed fat on top of the soup.","zh":"汤上面有一层凝固的油脂。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “congeal”: to become thick or solid; to cause something to thicken or solidify.","zh":"“congeal”的过去式/过去分词：变稠或凝固；（使某物）变稠或凝固。"},"examples":[{"en":"The sauce congealed quickly after we turned off the heat.","zh":"我们关火后，酱汁很快就凝固了。"},{"en":"Cold air congealed the melted wax on the candle.","zh":"冷空气使蜡烛上融化的蜡凝固了。"}]}],"synonyms":["solidified","thickened","set","coagulated"],"phonetic":"/kənˈdʒild/","extraExplanation":["“congealed”常用于食物语境（gravy 肉汁、fat 油脂、wax 蜡），带有“不新鲜、油腻、冷掉了”的联想；在写作里也可用于比喻，如“congealed emotions”（凝结的情感）来表达情绪变得僵硬、停滞。"]}
{"word":"congealedness","summary":{"en":"Congealedness means the condition of being congealed—thickened or solidified from a liquid, usually by cooling.","zh":"Congealedness 指“凝结/凝固的状态”，即液体通常因冷却而变稠或固化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being congealed (turned from a liquid into a thicker, semi-solid, or solid form, often because of cooling)","zh":"凝结（凝固）状态；指液体因冷却等原因变稠、半固化或固化的性质/程度"},"examples":[{"en":"The congealedness of the sauce shows it was left out too long and cooled down.","zh":"酱汁的凝结状态说明它放在外面太久，已经冷却变稠了。"},{"en":"In winter, the congealedness of cooking oil can surprise people in an unheated kitchen.","zh":"冬天在不供暖的厨房里，食用油的凝结程度常常会让人意外。"}]}],"synonyms":["solidification","thickening","setting","coagulation","gelation"],"phonetic":"/kənˈdʒiːldnəs/","extraExplanation":["“congealedness”来自动词 congeal（凝结、凝固），后缀 -ness 用来把形容词/过去分词形式变成名词，表示“……的状态/性质”。在日常英语中，人们更常说 the food congealed / the sauce has congealed，或用名词 congealment（较少见）来表达。"]}
{"word":"congealer","summary":{"en":"A congealer is usually an ingredient or substance that makes a liquid thicken or set; more generally, it can be anything that causes something to congeal.","zh":"congealer 通常指让液体变稠或凝固定型的“凝固剂”；更广义也可指任何导致凝结/凝固的因素。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance or ingredient that makes a liquid thicken or become firm (for example, gelatin used to set a dessert)","zh":"凝固剂；使液体变稠或变成固体的物质/成分（如用来让甜点定型的明胶）"},"examples":[{"en":"Gelatin is a common congealer in many chilled desserts.","zh":"明胶是许多冷藏甜点里常见的凝固剂。"},{"en":"The recipe calls for a congealer so the sauce will set properly.","zh":"这个食谱需要加入凝固剂，这样酱汁才能正确凝固定型。"}]},{"partOfSpeech":"n.","definition":{"en":"someone or something that causes something to congeal (to thicken or solidify)","zh":"使……凝结/凝固的人或事物"},"examples":[{"en":"Cold air can be a congealer, turning water into ice overnight.","zh":"冷空气可以成为“凝固者”，一夜之间把水变成冰。"},{"en":"In the fridge, time is the congealer that helps the mixture firm up.","zh":"在冰箱里，时间就是让混合物变硬定型的“凝固者”。"}]}],"synonyms":["gelling agent","thickener","solidifier","setting agent"],"phonetic":"/kənˈdʒiːlər/","extraExplanation":["“congealer”来自动词“congeal”（凝结、凝固）+ 后缀“-er”（表示“做某事的人/物”）。在日常英语里，更常见的说法是“thickener”（增稠剂）或“gelling agent”（凝胶剂/凝固剂）；“congealer”相对少见，但在烹饪或说明性文字中仍可能出现。"]}
{"word":"congealing","summary":{"en":"Congealing means becoming thick or semi-solid (often as something cools), or figuratively becoming fixed and clearly formed.","zh":"congealing 表示（液体）变稠/凝结成半固体；也可比喻（想法、计划、情绪等）逐渐定型、变得清晰。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"becoming thicker or turning from liquid to a semi-solid (for example, fat, sauce, jelly, or blood) as it cools or sits","zh":"（液体）逐渐变稠、凝结，变成半固体（如油脂、酱汁、果冻或血液），常因冷却或放置而发生"},"examples":[{"en":"The soup is congealing on the stove because the heat is too low.","zh":"火太小，汤在炉子上开始凝结变稠了。"},{"en":"Wipe the pan before the grease starts congealing.","zh":"趁油脂还没凝结，先把锅擦干净。"},{"en":"There was congealing blood around the cut.","zh":"伤口周围有正在凝结的血。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative) becoming fixed, settled, or clearly formed; coming together into a solid plan or idea","zh":"（比喻）逐渐定型、固定下来；（想法/计划）变得清晰并形成体系"},"examples":[{"en":"After a few meetings, the team’s ideas started congealing into a real plan.","zh":"开了几次会后，团队的想法开始凝聚成一个真正的计划。"},{"en":"Her vague worries were congealing into a specific fear.","zh":"她模糊的担忧逐渐凝结成一种明确的恐惧。"}]}],"synonyms":["thickening","solidifying","setting","coagulating","gelatinizing","forming","taking shape"],"phonetic":"/kənˈdʒiːlɪŋ/","extraExplanation":["“congealing”来自动词 congeal，常用于食物（油脂、肉汁、汤、果冻）等在温度下降后变稠或凝固的过程。","也常用于描写“血液凝结（congealing blood）”，在文学或新闻中往往带有较强的画面感与情绪色彩。","比喻用法很常见：ideas/feelings/plans congeal 表示“逐渐成形、定型”，语气比 form 更强调从模糊到清晰、从松散到稳固的过程。"]}
{"word":"congealment","summary":{"en":"Congealment means the process or result of a liquid becoming thick or solid, or the thick/clotted mass that forms.","zh":"Congealment 指液体变稠或凝固的过程/结果，也可指凝结后形成的块状物（凝结物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of becoming thick or solid (or the state of being thickened/solidified), especially when a liquid cools","zh":"（尤指液体冷却时）凝结、凝固的过程；或凝结/凝固的状态"},"examples":[{"en":"The congealment of the sauce happens quickly once it cools.","zh":"酱汁一旦冷却，很快就会发生凝结。"},{"en":"After a few minutes in the cold air, the congealment of the melted butter was obvious.","zh":"在冷空气中几分钟后，融化的黄油明显开始凝固。"}]},{"partOfSpeech":"n.","definition":{"en":"a thickened or clotted mass formed by congealing","zh":"凝结物；凝固后形成的块状物（如凝结的脂肪或血块）"},"examples":[{"en":"A congealment of fat floated on the surface of the soup.","zh":"一层凝结的油脂漂在汤面上。"},{"en":"The doctor examined the congealment in the wound to check for abnormal clotting.","zh":"医生检查伤口中的凝结物，以确认是否存在异常凝血。"}]}],"synonyms":["solidification","thickening","coagulation","clotting","gelation"],"phonetic":"/kənˈdʒiːlmənt/","extraExplanation":["词源提示：congeal 来自拉丁语，含“聚在一起、冻结”的意思；-ment 常把动词变成名词，表示“过程/结果”。因此 congealment 常强调“凝结这一过程”或“凝结后的结果（凝结物）”。","用法区分：日常写作里更常用 congealing（凝结过程）或 congealed（已凝结的）来描述状态；congealment 更偏正式、书面或医学/技术语境。"]}
{"word":"congeals","summary":{"en":"“Congeals” means becomes thick or semi-solid (or, figuratively, becomes fixed).","zh":"“congeals”表示（液体）变稠/凝固；也可比喻（想法、局势）逐渐定型、僵化。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of a liquid) to become thicker or semi-solid, often as it cools.","zh":"（液体）变稠或凝固，常因冷却而发生。"},"examples":[{"en":"The soup congeals if you leave it out too long.","zh":"汤如果在外面放太久会变稠甚至凝固。"},{"en":"Fat congeals on top of the stew after it cools.","zh":"炖菜冷却后，油脂会在表面凝结。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative) to become fixed, rigid, or less able to change; to form into a settled shape or idea.","zh":"（比喻）变得固定、僵化或不再容易改变；（想法/局势）定型。"},"examples":[{"en":"Over time, the plan congeals into a routine.","zh":"随着时间推移，这个计划逐渐定型成一种惯例。"},{"en":"Fear congealed into anger during the argument.","zh":"争吵中，恐惧逐渐凝结成愤怒。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cause something (especially a liquid) to thicken or become semi-solid.","zh":"使（尤指液体）变稠或凝固。"},"examples":[{"en":"Cold air congeals the melted butter quickly.","zh":"冷空气会让融化的黄油很快凝固。"}]}],"synonyms":["thicken","solidify","set","gel","harden","coagulate"],"phonetic":"/kənˈdʒilz/","extraExplanation":["“congeals”是动词“congeal”的第三人称单数（he/she/it congeals）。过去式/过去分词：congealed。","常见搭配：blood congeals（血液凝固/让人毛骨悚然）、fat congeals（油脂凝结）、ideas congeal（想法成形/定型）。","与“coagulate”相比：congeal更口语、范围更广（任何液体变稠/凝固，或比喻“定型”）；coagulate更偏医学/生物语境，常指血液或蛋白质“凝固”。"]}
{"word":"conged","summary":{"en":"**conged** is a rare form meaning “became thick/solid” (past of *conge*). In modern English, **congealed** is much more common.","zh":"**conged** 很少见，意思是“变稠/凝固了”（*conge* 的过去式）。现代英语更常用 **congealed**。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(rare) Past tense/past participle of **conge**: to become thick or solid (especially a liquid as it cools), or to make something do this.","zh":"（罕见）**conge** 的过去式/过去分词：使（液体）变稠或凝固；（液体）冷却后变稠或凝固。"},"examples":[{"en":"The sauce **conged** as it cooled on the stove.","zh":"酱汁在炉子上冷却时变稠凝固了。"},{"en":"Leave the fat overnight until it has **conged** into a firm layer.","zh":"把油脂放一夜，直到它凝固成一层硬硬的脂肪。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare, literary) Describing something that has thickened or solidified.","zh":"（罕见，文学用法）形容“已经变稠/凝固的”。"},"examples":[{"en":"He scraped the **conged** grease from the pan.","zh":"他把锅里已经凝固的油脂刮了下来。"}]}],"synonyms":["congealed","solidified","thickened","set"],"phonetic":"/kɑndʒd/","extraExplanation":["“conged”在现代英语里非常少见，更常用的是 **congealed**（凝固的/变稠的）或动词 **congeal**（凝固；使凝固）。如果你是在食谱、旧文学或较正式的写作里看到“conged”，通常就是“conge/congeal（凝固）”这个意思。","注意别和法语 **congé**（休假、假期）混淆：英语里偶尔会借用作 **congé**（如 *congé leave*），但那不是“conged”的常见来源。"]}
{"word":"congee","summary":{"en":"Congee is a rice porridge, common in many Asian cuisines, often eaten for breakfast or as comfort food when sick.","zh":"Congee 指米粥（亚洲常见），常作早餐或病中/清淡的暖胃食物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A thick rice porridge made by cooking rice in lots of water until it breaks down; commonly eaten in many Asian cuisines, often for breakfast or when someone is sick.","zh":"粥；（通常指亚洲常见的）米粥，把米用大量水煮到软烂成稠粥，常作早餐或病中食物。"},"examples":[{"en":"I had congee for breakfast with a boiled egg and scallions.","zh":"我早餐吃了粥，配水煮蛋和葱花。"},{"en":"When I caught a cold, my mom made ginger congee for me.","zh":"我感冒时，我妈妈给我煮了姜粥。"},{"en":"You can top congee with shredded chicken, pickles, or soy sauce.","zh":"你可以在粥上加鸡丝、腌菜或酱油作配料。"}]}],"synonyms":["rice porridge","rice gruel"],"phonetic":"/ˈkɑndʒi/","extraExplanation":["“Congee”在英语里主要指东亚与东南亚常见的“米粥/稀饭”，粤语里常对应“粥”(juk1)，普通话常说“粥”或更具体如“白粥、皮蛋瘦肉粥”。不同地区做法与口感差异很大：有的很稀，有的非常浓稠。","词源上，英语 congee 多被认为来自泰米尔语/马来语等南亚、东南亚语言中的相关词（在殖民贸易时期进入英语），所以它在英文菜单里常用于泛指“亚洲风格的米粥”。","文化用法上，英语里说 congee 往往带有“comfort food（暖胃、疗愈的家常食物）”的感觉，特别是提到生病、宿醉或想吃清淡食物时。"]}
{"word":"congeed","summary":{"en":"“Congeed” is an archaic past form meaning “dismissed/sent away” or “took leave.”","zh":"“congeed”是较古旧的过去式，常表示“被解雇/被遣散/被准许退下”或“告辞离开”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of (archaic) “congee”: to dismiss or discharge someone from service or duty; to send someone away with permission to leave.","zh":"（古语）“congee”的过去式/过去分词：解雇、遣散（某人）；准许某人离去、让某人告退。"},"examples":[{"en":"After the ceremony, the servants were congeed for the night.","zh":"仪式结束后，仆人们被准许退下休息。"},{"en":"The officer was congeed from duty due to illness.","zh":"那名军官因病被准许离岗。"}]},{"partOfSpeech":"vi.","definition":{"en":"past tense/past participle of (archaic) “congee”: to take one’s leave; to depart politely.","zh":"（古语）“congee”的过去式/过去分词：告辞；礼貌地离开。"},"examples":[{"en":"She congeed and left the room without a word.","zh":"她告辞后一句话也没说就离开了房间。"}]}],"synonyms":["dismissed","discharged","sent away","released","took leave","departed"],"phonetic":"/kənˈdʒid/","extraExplanation":["“congeed”很少见，属于偏古旧/文学用法，来源与法语“congé”（许可、告假、解雇）有关。","注意不要和常见的名词“congee”（米粥）混淆：米粥的“congee”读音和词义都不同，且一般不会写成“congeed”。如果你想表达“凝固”，更常用的是“congealed”（来自 congeal）。"]}
{"word":"congeeing","summary":{"en":"Congeeing means “becoming thick or solid,” especially as something cools, or (of blood) “clotting.”","zh":"congeeing 指“正在变稠或凝固”（常因冷却），也可指血液“正在凝结成血块”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of congeal) becoming thicker, more solid, or jelly-like (often as something cools).","zh":"（congeal 的现在分词）逐渐变稠、凝固，或变成果冻状（常因冷却）。"},"examples":[{"en":"The sauce is congeeing as it cools, so stir it gently.","zh":"酱汁在冷却时正在变稠凝固，所以轻轻搅拌一下。"},{"en":"After a few hours in the fridge, the fat starts congeeing on top of the soup.","zh":"在冰箱里放了几个小时后，脂肪开始在汤面上凝结。"}]},{"partOfSpeech":"v.","definition":{"en":"(of blood or a liquid in the body) clotting or thickening into a semi-solid mass.","zh":"（指血液或体液）凝结、凝固成半固态（形成血块）。"},"examples":[{"en":"The blood was congeeing around the cut.","zh":"血液正在伤口周围凝结。"},{"en":"Apply pressure to help stop the bleeding before it starts congeeing.","zh":"在血液开始凝结之前先按压止血。"}]}],"synonyms":["thickening","solidifying","setting","jelling","clotting"],"phonetic":"/kənˈdʒiɪŋ/","extraExplanation":["“congeeing”来自动词“congeal”（凝固）。它常见于写作或说明文里，强调“正在变稠/正在凝固”的过程。","拼写注意：congeal 去掉 -al 加 -ing 变为 congealing；但实际用法中也会出现 congeeing 这种拼写（较少见），多因读音与拼写类推造成。更常用、更标准的是 congealing。"]}
{"word":"congees","summary":{"en":"Congee is a thick rice porridge, commonly eaten in many Asian cuisines.","zh":"Congee 指（多见于亚洲菜系的）米粥/稀饭。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a thick rice porridge (often eaten for breakfast or when someone is sick), usually cooked until the rice breaks down and becomes soft","zh":"（常作早餐或生病时吃的）稠稠的米粥/稀饭，米粒煮到软烂化开"},"examples":[{"en":"I had chicken congee for breakfast.","zh":"我早餐吃了鸡肉粥。"},{"en":"When she had a cold, her grandmother made her congee with ginger.","zh":"她感冒时，奶奶给她煮了加姜的粥。"},{"en":"In this restaurant, congee comes with pickled vegetables and a soft-boiled egg.","zh":"这家餐厅的粥会配腌菜和溏心蛋。"}]}],"synonyms":["rice porridge","rice gruel","juk"],"phonetic":"/ˈkɑːndʒi/","extraExplanation":["“congee”常见于英语菜单，指亚洲风格的米粥。美式英语里多读作 /ˈkɑːndʒi/。","词源来自南亚/东南亚地区对“米粥”的称呼（常被认为与泰米尔语 *kanji* 等有关），因此在讲到中餐、港式“粥（juk）”、越南/新加坡等饮食时很常见。","你输入的 **congees** 通常是名词复数：*two congees*（两种/两份粥）。在日常英语里更常说 *two bowls of congee*（两碗粥）或直接用 congee 作不可数名词：*some congee*（一些粥）。"]}
{"word":"congeing","summary":{"en":"**congeeing** means becoming thick/solid (or making something do so), usually as it cools.","zh":"**congeeing** 指（通常因冷却而）正在变稠/凝固，或使某物变稠/凝固。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(present participle of **congeal**) becoming thick or solid, especially from cooling.","zh":"（**congeal** 的现在分词）变稠或凝固，尤指因冷却而凝结。"},"examples":[{"en":"The sauce is congeeing as it cools.","zh":"酱汁在变凉时正在变稠。"},{"en":"Fat can start congeeing on the surface of the soup.","zh":"油脂可能会开始在汤面上凝结。"}]},{"partOfSpeech":"vt.","definition":{"en":"making something thicken or solidify.","zh":"使某物变稠或凝固。"},"examples":[{"en":"Cold air is congeeing the oil into a semi-solid layer.","zh":"冷空气正使油凝成半固体的一层。"}]}],"synonyms":["thickening","solidifying","setting","coagulating"],"phonetic":"/kənˈdʒiːɪŋ/","extraExplanation":["你输入的 **congeing** 通常是拼写错误，更常见的正确拼法是 **congeeing**（来自动词 **congeal**）。","发音上常让人困惑：**congeal** /kənˈdʒiːl/ 的 -eal 变化成 **congeeing** 时写作 **-eeing**，读起来像 “jee-ing”。","常见搭配：**congeeing fat/grease**（凝固的油脂）、**congeeing sauce**（变稠的酱汁）。在写作里也可比喻“气氛/情绪凝结”：*The tension was congeeing in the room.*（紧张气氛在房间里凝聚/加剧）。"]}
{"word":"congelation","summary":{"en":"Congelation means the process of becoming solid (or the solid mass formed), often in technical or medical contexts.","zh":"Congelation 指“凝固/冻结的过程”，也可指“凝结物”，多见于技术或医学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The process of becoming solid or semi-solid, especially when a liquid thickens or freezes (often used in technical or medical contexts).","zh":"（尤指液体）凝固、冻结或变稠的过程（常用于技术或医学语境）。"},"examples":[{"en":"After the temperature dropped, the oil showed signs of congelation.","zh":"气温下降后，油开始出现凝固的迹象。"},{"en":"Doctors monitored the blood sample for abnormal congelation.","zh":"医生监测血样是否出现异常凝固。"}]},{"partOfSpeech":"n.","definition":{"en":"A mass or lump that has formed by congealing; something that has solidified.","zh":"凝结物；由凝固形成的一团（块）固体。"},"examples":[{"en":"A thin congelation formed on the surface of the sauce as it cooled.","zh":"酱汁冷却时，表面形成了一层薄薄的凝结物。"},{"en":"He scraped away the congelation of fat from the soup.","zh":"他把汤上凝结的油脂刮掉了。"}]}],"synonyms":["solidification","freezing","congealing","coagulation (esp. medical/chemical)"],"phonetic":"/ˌkɑn.dʒəˈleɪ.ʃən/","extraExplanation":["“congelation”较正式，日常更常说“freezing”（冻结）或“thickening/setting”（变稠/凝固）。","词源与拉丁语“congelare”（使冻结/凝固）有关；同源词有“congeal”（凝固）。在医学里可与“coagulation”（凝血/凝固）相关，但两者不完全等同：coagulation更强调化学或生理的凝固过程（如血液凝固）。"]}
{"word":"congelative","summary":{"en":"Concerning or causing freezing/congealing; a rare, somewhat old-fashioned word.","zh":"（较罕见/略旧）与冻结、凝结有关；或指“使之冻结/凝结”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"causing something (especially a liquid) to congeal or freeze; having a freezing/solidifying effect","zh":"使（尤指液体）凝结或冻结的；具有使之结冰/固化作用的"},"examples":[{"en":"The report mentioned a congested, cold, almost congelative wind coming off the river.","zh":"报告提到河面吹来一阵又冷又闷的风，几乎有种“冻住一切”的凝结感。"},{"en":"In older scientific writing, certain salts were described as having a “congelative” effect on solutions.","zh":"在较早的科学写作中，有些盐被描述为对溶液具有“促凝/致冻”的作用。"}]}],"synonyms":["freezing","congealing","solidifying","congealant"],"phonetic":"/kənˈdʒɛlətɪv/","extraExplanation":["“congelative”是较少见的词，来自拉丁语词根 con-（一起）+ gel-（冰、冻结），与 congeal（凝结）、congealed（凝固的）同源。现代英语里更常用的表达通常是 freezing、congealing、solidifying，或在科学语境中用 causing congelation/inducing freezing。","它有时出现在较文学化或较旧的描述中，用来强调“让事物仿佛被冻住/凝住”的感觉，而不一定是字面意义上的结冰。"]}
{"word":"congelifract","summary":{"en":"Conge​lifract is a rare literary adjective meaning “cracked or broken by freezing (frost).”","zh":"congelifract 是一个罕见的文学形容词，意思是“因冻结/霜冻而开裂或破碎的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare, literary) Broken or cracked by freezing; frost-shattered.","zh":"（罕见，文学用语）因冻结而破裂的；被霜冻（冻裂）弄碎的。"},"examples":[{"en":"The hikers crossed a field of congelifract rocks, split by winter ice.","zh":"徒步者穿过一片被冬季冰冻裂开的岩石地带。"},{"en":"In the poem, the old wall stands among congelifract stones and cold wind.","zh":"在诗中，古墙伫立在冻裂的石块与寒风之间。"}]}],"synonyms":["frost-shattered","frost-cracked","ice-split","weathered"],"phonetic":"/kənˈdʒɛləˌfrækt/","extraExplanation":["词源提示：来自拉丁语 con-（一起）+ gelu（冰、霜）+ fractus（破碎的）。常见于描写冬季自然景观的文学语境，日常英语里更常说 “frost-shattered / frost-cracked”。","用法提醒：它通常修饰“岩石、石块、地面、墙体”等会因结冰膨胀而开裂的事物。"]}
{"word":"congelifraction","summary":{"en":"Congelifraction is freeze–thaw action that breaks rock or soil.","zh":"Congelifraction 指反复冻融导致岩石或土壤破裂的作用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process in which water freezes and thaws repeatedly, causing materials (especially rock or soil) to crack, split, or break apart","zh":"反复冻融的过程；水结冰又融化，导致材料（尤指岩石或土壤）开裂、分裂或破碎"},"examples":[{"en":"In cold climates, congelifraction can slowly break rocks into smaller pieces.","zh":"在寒冷气候中，冻融作用会慢慢把岩石破碎成更小的碎块。"},{"en":"The cracks widened over winter due to repeated congelifraction.","zh":"由于反复冻融，裂缝在冬季变得更宽了。"}]}],"synonyms":["freeze-thaw weathering","frost weathering","frost wedging"],"phonetic":"/kənˌdʒiːləˈfrækʃən/","extraExplanation":["这是一个非常少见、偏学术的词，常见于地质学/地貌学语境。更常用的近义表达是“freeze-thaw weathering（冻融风化）”或“frost wedging（霜楔作用）”。","词源来自拉丁语：congelare（使冻结）+ fractio（破裂/断裂），字面意思接近“因冻结而破裂”。"]}
{"word":"congeliturbate","summary":{"en":"A humorous, nonstandard verb meaning “to congeal/freeze while being churned or disturbed.”","zh":"一个幽默的非标准动词，指“在被搅动/扰乱的同时凝固或冻结”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Nonstandard; humorous/nonce) To make something partly freeze or congeal while also stirring or disturbing it; to turn into a slushy, churned-up state.","zh":"（非标准；幽默/临时造词）使某物一边冻结/凝固、一边被搅动或扰乱；变成被搅得乱七八糟的半凝固（像冰沙、雪泥）状态。"},"examples":[{"en":"By the time we got there, the half-melted ice cream had basically congeliturbated into a gritty slush.","zh":"我们到那儿时，半融化的冰淇淋基本已经“congeliturbate”成一团粗糙的冰沙状了。"},{"en":"Don’t keep opening the freezer door—you’ll just congeliturbate the sauce instead of letting it set.","zh":"别老开冷冻室门——那样只会把酱料弄成半凝固又被扰乱的状态，而不是让它顺利凝住。"}]}],"synonyms":["congeal","solidify","slush up","churn","stir up"],"phonetic":"kənˌdʒiːləˈtɝːbeɪt","extraExplanation":["“congeliturbate”不是常见英语词，也通常不收录在主流词典里，更像是幽默的拼造词（nonce word）。它看起来由 **congeal/congel-（凝固、冻结）** + **turb-（搅动、浑浊、扰乱）** 之类的词根/联想拼成，用来夸张形容“又冻又被搅乱”的尴尬状态。","如果你是在某本书、游戏、网络梗或特定语境里看到它，欢迎贴出原句；我可以根据上下文给出更贴切的译法与用法建议。"]}
{"word":"congeliturbation","summary":{"en":"Congeliturbation is a rare literary noun meaning a “frozen” kind of confusion or turmoil—disturbance that feels stuck or immobilized.","zh":"congeliturbation 是一个罕见的文学名词，指带有“冻结、僵住”感的混乱或动荡：既不安又难以前进。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, literary) A state of confusion or disturbance that feels “frozen” or stuck; turmoil mixed with stiffness, numbness, or immobilization.","zh":"（罕见，文学用语）一种带有“冻结/僵住”感觉的混乱或骚动；既动荡又像被卡住、麻木、难以推进的状态。"},"examples":[{"en":"After the sudden blackout, the crowd fell into a kind of congeliturbation—moving, but somehow stuck.","zh":"突然停电后，人群陷入一种“congeliturbation”——在动，却又像卡住了一样。"},{"en":"His grief was not loud; it was a quiet congeliturbation that made every decision feel impossible.","zh":"他的悲伤并不张扬；而是一种安静的“congeliturbation”，让每个决定都变得难以做出。"}]}],"synonyms":["confusion","turmoil","disturbance","disarray","perturbation"],"phonetic":"/kənˌdʒɛləˈtɝːbeɪʃən/","extraExplanation":["这个词非常少见，通常被视为“造词/拼成词”（nonce word / portmanteau），由表示“冻结”的词根（如 congeal / congel-）与表示“骚动、混乱”的 -turbation（如 perturbation）拼合而来。","它常被提到与詹姆斯·乔伊斯（James Joyce）等现代主义文本的语言实验有关；在日常英语里几乎不会用到，更适合在文学分析、创意写作或模仿乔伊斯式语言时使用。"]}
{"word":"congenator","summary":{"en":"**Congenitor** means a parent/ancestor or the original source that something comes from (formal).","zh":"**Congenitor** 指“父母/祖先”，也可指“某事物的起源者、源头”（较正式）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended: **congenitor**) a parent, ancestor, or the original source of a family line or group.","zh":"（你可能想写的是 **congenitor**）父母之一；祖先；（家族/群体的）始祖、起源者。"},"examples":[{"en":"Her grandfather was a **congenitor** of the family’s farming tradition.","zh":"她的祖父是这个家族农耕传统的奠基者（始祖之一）。"},{"en":"Scientists sometimes refer to an early species as the **congenitor** of modern animals.","zh":"科学家有时把某种早期物种称为现代动物的“祖先物种”。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or thing that produces, originates, or gives rise to something (more formal usage).","zh":"（更正式用法）产生某事物的人或事物；起源、源头。"},"examples":[{"en":"Many people see fear as the **congenitor** of prejudice.","zh":"许多人认为恐惧是偏见的源头。"},{"en":"That small startup was the **congenitor** of an entire new industry.","zh":"那家小型初创公司成了一个全新行业的源头。"}]}],"synonyms":["ancestor","forebear","progenitor","origin","source"],"phonetic":"/kənˈdʒɛnɪtər/","extraExplanation":["“congenator”不是常见或标准拼写。你可能想查的是 **congenitor**（更常用），意思是“父母/祖先/起源者”。","词源提示：**congenitor** 来自拉丁语 *con-*（共同）+ *gen-*（生、产生），因此带有“生出、产生、起源”的含义。语体偏正式，写作中更常见。"]}
{"word":"congener","summary":{"en":"A congener is something closely related in the same kind or group (especially in biology or chemistry).","zh":"congener 指同类/同属的近缘事物（尤用于生物学或化学语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A thing (often an organism or chemical) that belongs to the same group, kind, or genus as another; something closely related in type.","zh":"（常指生物或化学物质）同类的事物；同属/同一类群中的成员；近缘物。"},"examples":[{"en":"Whales and dolphins are congeners in the same order of marine mammals.","zh":"鲸和海豚是同一类海洋哺乳动物中的近缘成员。"},{"en":"This congener has a similar structure but behaves differently in the experiment.","zh":"这种同系物结构相似，但在实验中的表现不同。"}]},{"partOfSpeech":"adj.","definition":{"en":"Belonging to the same kind, group, or genus; closely related.","zh":"同类的；同属的；近缘的。"},"examples":[{"en":"They compared two congener species to see how they adapted to different climates.","zh":"他们比较了两个同属物种，看看它们如何适应不同气候。"},{"en":"The lab tested several congener compounds with only small changes in their molecules.","zh":"实验室测试了几种同系化合物，它们的分子只略有差异。"}]}],"synonyms":["counterpart","relative","related species","kindred"],"phonetic":"/kənˈdʒɛnər/","extraExplanation":["在生物学里，congener常指“同属（同一genus）”的物种，例如同属的两种鸟。","在化学里，congener常指“同系物/同类化合物”，即结构很相似、只在某些部分（如碳链长度、取代基）不同的一组化合物。","词源：来自拉丁语 con-（共同）+ genus（种类/属）。因此它的核心意思就是“同一类/同一家族”。","近义表达（语境不同）：related species（相关物种）、counterpart（对应物）、member of the same genus（同属成员）。其中congener更偏学术/技术用语。"]}
{"word":"congeneracy","summary":{"en":"Congeneracy means a close relationship of being of the same kind—often, belonging to the same genus in biology.","zh":"Congeneracy 指“同类/同属的关系”，常用于生物学中表示“属于同一属”的亲缘或分类关系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being closely related, especially belonging to the same genus (in biology) or the same general kind","zh":"同属关系；同类性（尤指生物分类中属于同一属，或更广义上的同一类/相近类别）"},"examples":[{"en":"Researchers tested the congeneracy of several beetle species based on DNA evidence.","zh":"研究人员根据 DNA 证据检验了几种甲虫物种的同属关系。"},{"en":"Their debate focused on whether these plants show true congeneracy or only superficial similarity.","zh":"他们的讨论集中在这些植物是否体现真正的同属关系，还是仅仅外表相似。"}]}],"synonyms":["relatedness","kinship","affinity","similarity","congeneric relationship"],"phonetic":"/kənˈdʒɛnərəsi/","extraExplanation":["“congeneracy”较少见，学术写作中更常用形容词/名词形式如“congeneric (species)”（同属的物种）或直接说“congeners”（同属物种）。","词根来源：con-（共同）+ genus（属/种类）。在生物分类语境中，“genus”指“属”，因此该词常用于讨论分类学与亲缘关系。"]}
{"word":"congeneric","summary":{"en":"Congeneric means “of the same genus” (biology) or more generally “of the same kind; closely similar,” and it’s mainly used in formal/academic contexts.","zh":"congeneric 意为“同属的”（生物学）或更广义的“同类的、很相似的”，多用于正式/学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Belonging to the same genus; closely related in biological classification.","zh":"（生物分类）同属的；属于同一属、亲缘关系很近的。"},"examples":[{"en":"Lions and tigers are congeneric species because they belong to the genus Panthera.","zh":"狮子和老虎是同属物种，因为它们都属于豹属（Panthera）。"},{"en":"The paper compared congeneric plants to see how they adapted to different climates.","zh":"这篇论文比较了同属植物，看看它们如何适应不同气候。"}]},{"partOfSpeech":"adj.","definition":{"en":"Of the same kind or category; very similar in nature.","zh":"同类的；性质或类别非常相近的。"},"examples":[{"en":"The author groups congeneric themes—loss and renewal—throughout the novel.","zh":"作者在小说中贯穿了同类主题——失去与重生。"},{"en":"Researchers tested congeneric materials with similar chemical structures.","zh":"研究人员测试了同类材料，它们的化学结构相似。"}]}],"synonyms":["congenerous","related","similar","of the same genus","of the same kind"],"phonetic":"/kɑnˈdʒɛnərɪk/","extraExplanation":["“congeneric”常见于学术写作，尤其是生物学/生态学论文里，比日常口语更正式。","词源：con-（一起/共同）+ generic（同类的/属的）。在分类学里genus=“属”，所以它常被用来强调“同属”。","近义表达（按语境）：taxonomic语境可用“in the same genus / within the same genus”；泛指“同类”时可用“similar / of the same type”。"]}
{"word":"congenerical","summary":{"en":"Congeneric means “belonging to the same genus” (most common), and more loosely “of the same kind.”","zh":"congeneric 主要指“同属的（同一属的）”，也可较宽泛地指“同类的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Belonging to the same genus; closely related within a biological classification.","zh":"（生物分类）同属的；属于同一属的；同属近缘的。"},"examples":[{"en":"Lions and tigers are congeneric species because they belong to the genus Panthera.","zh":"狮子和老虎是同属物种，因为它们都属于豹属（Panthera）。"},{"en":"Researchers compared congeneric plants to see how traits change across species in the same genus.","zh":"研究人员比较了同属植物，以了解同一属内不同物种的性状如何变化。"}]},{"partOfSpeech":"adj.","definition":{"en":"Very similar in kind or category; sharing the same broad type (less common).","zh":"（较少见）同类的；同种类的；性质相近的。"},"examples":[{"en":"The study looked at congeneric forms of storytelling across different cultures.","zh":"这项研究考察了不同文化中同类的叙事形式。"},{"en":"We need congeneric examples to make a fair comparison.","zh":"我们需要同类的例子，才能做出公平的比较。"}]}],"synonyms":["same-genus","related","closely related","similar","of the same kind"],"phonetic":"/kənˈdʒɛnərɪk/","extraExplanation":["“congenerical”更常见被视为“congeneric”的少见变体或拼写错误；在学术写作（尤其是生物学/分类学）中通常用“congeneric”。","词源提示：con-（共同）+ generic（同类/属的），常出现在分类学表达中，如“congeneric species（同属物种）”。"]}
{"word":"congenerous","summary":{"en":"“Congenerous” means “of the same kind or class; similar.”","zh":"“Congenerous”意为“同类的、同种的；相似的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of things or people) belonging to the same kind, class, or group; similar in nature.","zh":"（事物或人）同类的；同种的；性质相近的。"},"examples":[{"en":"Lions and tigers are congenerous animals because they belong to the same cat family.","zh":"狮子和老虎是同类动物，因为它们同属猫科。"},{"en":"She compared two congenerous traditions from different regions to see what they shared.","zh":"她比较了来自不同地区的两种同类传统，看看它们有哪些共同点。"}]}],"synonyms":["similar","related","akin","of the same kind","cognate"],"phonetic":"/kənˈdʒɛnərəs/","extraExplanation":["这个词较正式、偏学术写作，常见于生物学（同属/同科的生物）、分类学、或讨论“同一类别”的观念比较。","词源上与拉丁语词根“gen-（出生、种类）”有关：con- 表示“共同”，-gener- 表示“种类/产生”，合起来就是“同一种类的”。"]}
{"word":"congenerousness","summary":{"en":"Congenerousness means the quality of being of the same kind or closely related in nature or origin.","zh":"Congenerousness 指“同类性”，即在种类、性质或来源上同种或密切相关的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being congenerous; similarity in kind, nature, or origin","zh":"同类性；同种/同源的性质；（在种类、性质或来源上的）相似性"},"examples":[{"en":"The congenerousness of the two traditions makes the comparison clearer.","zh":"这两种传统的同类性让比较更清晰。"},{"en":"Scientists discussed the congenerousness of these compounds before naming them.","zh":"科学家在给这些化合物命名之前讨论了它们的同类性。"}]}],"synonyms":["similarity","relatedness","kinship","affinity","congeniality"],"phonetic":"/kənˈdʒenərəsnəs/","extraExplanation":["“Congenerousness”来自形容词 congenerous（同类的、同种的），核心意思是“属于同一类/同一来源，因此相似”。在现代英语里更常见的表达是 similarity（相似性）、relatedness（关联性）或 the fact that they are congeneric（它们同属一类/同一属）。","词根提示：con- 表示“共同”，-gen- 与 “产生/种类”（如 generate, genus）有关，因此 congenerous 强调“同源同类”。"]}
{"word":"congeners","summary":{"en":"“Congeners” is the plural of “congener”: closely related things—especially related chemical compounds—or members of the same kind/group.","zh":"“congeners”是“congener”的复数：指彼此近缘的事物，尤指化学中的同系物；也可指同类/同族的成员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A thing (or substance) that is closely related to another; in chemistry, a related compound in the same family or series (often with similar structure and properties).","zh":"同类物；近缘物（尤指化学中同系物/同族化合物，结构与性质相近）。"},"examples":[{"en":"Chemists measured several congeners of the same pesticide to see which one was most toxic.","zh":"化学家测量了同一种农药的几个同系物，以比较哪一种毒性最大。"},{"en":"PCBs include many congeners that differ slightly in structure but can have very different health effects.","zh":"多氯联苯（PCB）包含许多同系物，它们结构差异很小，但对健康的影响可能差别很大。"}]},{"partOfSpeech":"n.","definition":{"en":"A person, animal, or plant that belongs to the same kind or group; a close relative or counterpart.","zh":"同类的人/动物/植物；近亲；同族成员。"},"examples":[{"en":"Humans and their primate congeners share many behaviors.","zh":"人类与其灵长类同族成员共享许多行为特征。"},{"en":"In the novel, the hero feels like an outsider among his wealthy congeners.","zh":"在小说中，主人公在富裕的同类人群中感到格格不入。"}]}],"synonyms":["related compounds","members of the same family","counterparts","kin","close relatives"],"phonetic":"/kənˈdʒɛnər/","extraExplanation":["“congener”来自拉丁语：con-（共同）+ genus（种类、族群），字面意思是“同一种类的”。","在环境科学/毒理学里常说“PCB congeners（多氯联苯同系物）”“dioxin congeners（二噁英同系物）”，强调同一类化学物质中不同“成员”的细微结构差异。"]}
{"word":"congenetic","summary":{"en":"“Congenetic” means present at birth or inborn (often used like “congenital,” but less common).","zh":"congenetic 意为“先天的/与生俱来的”（常与 congenital 同义，但更少见）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) present at birth; existing from the time of birth (often due to genes or fetal development).","zh":"（医学）先天的；出生时就存在的（常与基因或胎儿发育有关）。"},"examples":[{"en":"The doctor said the heart problem was congenetic, not caused by the accident.","zh":"医生说这个心脏问题是先天的，不是事故造成的。"},{"en":"Some congenetic conditions can be treated early if they are found in newborn screening.","zh":"一些先天疾病如果在新生儿筛查中发现，可以尽早治疗。"}]},{"partOfSpeech":"adj.","definition":{"en":"(General) inborn; naturally belonging to a person or thing from the start.","zh":"（一般）与生俱来的；从一开始就自然具备的。"},"examples":[{"en":"She had a congenetic sense of rhythm and learned music quickly.","zh":"她有与生俱来的节奏感，学音乐很快。"}]}],"synonyms":["congenital","inborn","innate","hereditary"],"phonetic":"ˌkɑn.dʒəˈnɛtɪk","extraExplanation":["“congenetic”在现代英语里不如“congenital”常见。医学语境中更常写congenital（先天的）。","注意区分：congenital强调“出生时就有”（可能由遗传或孕期环境导致）；genetic强调“由基因决定/可遗传”。有些疾病是congenital但不一定是genetic。"]}
{"word":"congenial","summary":{"en":"Convivial and easy to get along with, or suitable and compatible with someone’s needs or preferences.","zh":"既可指人“友善好相处”，也可指环境或条件“适合、合拍、相容”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Pleasant, friendly, and easy to get along with; (of a person) having a warm, likable manner.","zh":"令人愉快、友善、好相处的；（指人）和蔼可亲、讨人喜欢的。"},"examples":[{"en":"Our new neighbor is very congenial, so we often chat in the hallway.","zh":"我们的新邻居很友善好相处，所以我们经常在走廊里聊天。"},{"en":"She has a congenial personality that makes people feel comfortable.","zh":"她的性格很随和亲切，让人觉得很放松。"}]},{"partOfSpeech":"adj.","definition":{"en":"Suitable or compatible; (of conditions, ideas, or environments) matching what someone likes or needs.","zh":"适合的；相容的；（指环境、条件或想法）与某人的喜好或需求相契合的。"},"examples":[{"en":"The team worked best in a congenial environment where everyone shared ideas freely.","zh":"在一个氛围融洽、大家能自由分享想法的环境里，团队工作效率最高。"},{"en":"He chose a job with hours congenial to family life.","zh":"他选择了一份工作时间更适合家庭生活的工作。"}]}],"synonyms":["friendly","amiable","pleasant","agreeable","compatible","suitable"],"phonetic":"/kənˈdʒiːniəl/","extraExplanation":["“congenial”常见搭配：congenial person（合得来的人）、congenial atmosphere/environment（融洽的氛围/环境）、congenial company（投缘的伙伴/令人愉快的陪伴）。","词源提示：来自拉丁语词根 con-（一起）+ genus（种类），原意接近“同类/合得来”，所以既可形容“人很友善”，也可形容“环境/条件很合适”。","使用区别小贴士：congenial 更偏“气质/氛围上让人舒服、合拍”；friendly 更直白地表示“友好”。"]}
{"word":"congenialities","summary":{"en":"“Congenialities” means pleasant, friendly qualities or polite social niceties that make interactions comfortable.","zh":"“congenialities”指令人愉快、友善的特质，或社交中的礼貌寒暄与客套，使相处更舒服。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"pleasant, friendly qualities or behaviors that make someone enjoyable to be with; friendliness (plural form of “congeniality”).","zh":"令人愉快、友善的特质或举止，使人相处起来舒服；和气、亲切（“congeniality”的复数）。"},"examples":[{"en":"Her congenialities made new employees feel welcome on their first day.","zh":"她亲切友善的特质让新员工第一天就感到受欢迎。"},{"en":"At the dinner, he offered small congenialities—warm smiles and kind words—to ease the tension.","zh":"在晚宴上，他用一些友善的小举动——温暖的微笑和好听的话——来缓和紧张气氛。"}]},{"partOfSpeech":"n.","definition":{"en":"friendly social exchanges or polite gestures used to create a comfortable atmosphere (often: “exchange congenialities”).","zh":"（社交中）友好的寒暄、客套话或礼貌性的友善举动（常见搭配：exchange congenialities）。"},"examples":[{"en":"They exchanged congenialities before getting down to business.","zh":"他们先寒暄了几句，然后才开始谈正事。"},{"en":"A few congenialities helped the two sides start the meeting on a positive note.","zh":"几句友好的客套话让双方以积极的氛围开始会议。"}]}],"synonyms":["friendliness","amiability","agreeableness","warmth","cordiality","niceties","pleasantries"],"phonetic":"/kənˌdʒiːniˈælɪtiz/","extraExplanation":["“congenialities”来自形容词 congenial（合得来、令人愉快的）。注意它和 genial（和蔼的、亲切的）很像：genial 更强调“性格温暖”，congenial 更强调“相处合拍/环境适合”。","常见表达：exchange congenialities（互致寒暄/客套）、social congenialities（社交礼数、寒暄）。在正式写作里更常见单数 congeniality；复数 congenialities 常用来强调“多种友善举动/寒暄”。"]}
{"word":"congeniality","summary":{"en":"Congeniality means friendly harmony—an easy, pleasant way of getting along with others.","zh":"Congeniality 指“融洽、合得来”的友好和谐氛围或特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A pleasant, friendly feeling or quality that makes people get along well; the state of being congenial.","zh":"融洽；意气相投；让人相处愉快的友善氛围或品质。"},"examples":[{"en":"There was an easy congeniality in the team, so meetings stayed calm and productive.","zh":"团队里有一种轻松的融洽氛围，所以会议一直很平和、高效。"},{"en":"Her congeniality made newcomers feel welcome right away.","zh":"她的亲和与友善让新人立刻感到被欢迎。"}]}],"synonyms":["friendliness","affability","cordiality","compatibility","rapport","warmth"],"phonetic":"/kənˌdʒiːniˈælɪti/","extraExplanation":["“congeniality”来自形容词“congenial”（合得来、令人愉快的），词根含有“gen”（出生、天性）相关的含义，带有“天性相合、气质契合”的感觉。","在日常英语里，人们更常用“congenial”（adj.）或短语“get along well / good chemistry”来表达；“congeniality”较偏正式，常用于描述气氛、团队关系或社交场合的友好度。"]}
{"word":"congenialize","summary":{"en":"Conventional but uncommon verb meaning “to make something more friendly or compatible.”","zh":"较少见的动词，意思是“使更融洽/更合得来”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make (a person, situation, or relationship) more pleasant, friendly, or compatible","zh":"使（人、情境或关系）更融洽、更合得来、更令人愉快"},"examples":[{"en":"The manager tried to congenialize the workplace by encouraging open communication.","zh":"经理试图通过鼓励坦诚沟通来让工作环境更融洽。"},{"en":"A shared hobby can congenialize a group of strangers quickly.","zh":"共同的爱好能很快让一群陌生人变得更合得来。"}]}],"synonyms":["make congenial","harmonize","reconcile","smooth over","warm up"],"phonetic":"/kənˈdʒiːniəˌlaɪz/","extraExplanation":["“congenialize”在现代英语中比较少见，更常用的是“make … more congenial / create a friendly atmosphere / smooth things over”等表达。","词根提示：congenial（合得来的、融洽的）→ congenialize（使变得融洽）。拼写中含有“gen”（同类/出生/种类的含义），帮助理解“气质相投、相合”。","近义表达（更常见）：to warm things up（让气氛热起来），to foster rapport（促进融洽关系），to build camaraderie（建立情谊）。"]}
{"word":"congenially","summary":{"en":"“Congenially” means “in a friendly, pleasant way,” and sometimes “in a way that suits someone well.”","zh":"“congenially”主要表示“亲切友好地、愉快地”，也可表示“很合某人心意/很适合地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a friendly, pleasant, and agreeable way; warmly.","zh":"以友好、愉快、合得来的方式；亲切地。"},"examples":[{"en":"She greeted the new coworkers congenially and introduced herself.","zh":"她很亲切地向新同事打招呼，并做了自我介绍。"},{"en":"They chatted congenially over coffee after the meeting.","zh":"会议结束后，他们在咖啡时间愉快地聊天。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that suits someone’s tastes or mood; pleasantly (often used with “to”).","zh":"以符合某人的喜好或心情的方式；令人愉快地（常与“to”连用）。"},"examples":[{"en":"The relaxed pace of the trip suited her congenially.","zh":"旅行的慢节奏很合她的心意。"},{"en":"The calm environment was congenial to quiet study.","zh":"安静的环境很适合安静学习。（对应形容词 congenial 的常见搭配）"}]}],"synonyms":["warmly","pleasantly","amicably","cordially","genially"],"phonetic":"/kənˈdʒiːniəli/","extraExplanation":["“congenially”来自形容词“congenial”（合得来/令人愉快的）+ 副词后缀“-ly”。它既可以描述人的态度（友善地），也可以描述环境或条件“很合适/很对胃口”。","常见近义词语感区别：friendly（直接=友好）、warmly（更强调热情/温暖）、cordially（更正式、礼貌上的热情）。"]}
{"word":"congenialness","summary":{"en":"Congenialness means friendliness and pleasantness, or the quality of being compatible and well-suited.","zh":"congenialness 指亲切友善、令人愉快，也可指相合、合拍、适合的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being friendly, pleasant, and easy to get along with; warmth in personality or atmosphere.","zh":"（性格或氛围的）亲切、友善、令人愉快；让人容易相处的特质。"},"examples":[{"en":"Her congenialness made new coworkers feel welcome on the first day.","zh":"她的亲切友善让新同事第一天就感到被欢迎。"},{"en":"The small café had a quiet congenialness that encouraged people to stay and talk.","zh":"那家小咖啡馆有种安静而温暖的氛围，让人愿意留下来聊天。"}]},{"partOfSpeech":"n.","definition":{"en":"The quality of being compatible or well-suited to someone’s tastes, needs, or situation.","zh":"（与某人喜好、需求或情境）相合、合拍、适合的特质。"},"examples":[{"en":"He chose the job for its congenialness with his long-term goals.","zh":"他选择这份工作，是因为它与他的长期目标很契合。"},{"en":"They valued the congenialness of the neighborhood—quiet streets and helpful neighbors.","zh":"他们看重这个社区的宜居与合拍——街道安静、邻居乐于帮忙。"}]}],"synonyms":["friendliness","warmth","pleasantness","affability","cordiality","compatibility","suitability","congeniality"],"phonetic":"/kənˈdʒiːniəlnəs/","extraExplanation":["“congenialness”来自形容词“congenial”（合意的、友善的），词根含义与“同类/同伴（con-）+ 天性/气质（genial，源自拉丁语）”有关，所以既可以指“人很和气”，也可以指“事物很合拍、很适合”。","用法提示：更常见的表达是“congeniality”。“congenialness”可以用，但更偏口语或强调“这种特质本身”。"]}
{"word":"congenital","summary":{"en":"“Congenital” means present from birth; it can also mean inborn as part of someone’s nature.","zh":"“congenital”表示“先天的、出生时就有的”，也可指“天生的性格/特质”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Present from birth (especially a medical condition).","zh":"先天的；出生时就有的（尤指医学状况）。"},"examples":[{"en":"She has a congenital heart defect.","zh":"她有先天性心脏缺陷。"},{"en":"The doctor explained that the condition is congenital, not caused by anything the parents did.","zh":"医生解释说这种情况是先天的，并不是父母做了什么导致的。"}]},{"partOfSpeech":"adj.","definition":{"en":"Natural to someone’s character; inborn.","zh":"天生的；与生俱来的（性格或能力）。"},"examples":[{"en":"He’s a congenital optimist who always expects things to work out.","zh":"他是个天生的乐观主义者，总觉得事情会顺利。"},{"en":"Her congenital curiosity made her ask a lot of questions in class.","zh":"她与生俱来的好奇心让她在课堂上问了很多问题。"}]}],"synonyms":["inborn","innate","from birth","hereditary (not always)","constitutional"],"phonetic":"/kənˈdʒɛnɪt̬əl/","extraExplanation":["“Congenital”常用于医学语境，表示“出生时就存在”。注意它不等于“genetic（遗传的）”：先天（congenital）可以由遗传因素造成，也可能与孕期环境有关；而遗传（genetic）强调来自基因。","常见搭配：congenital heart defect（先天性心脏缺陷）、congenital disease/disorder（先天性疾病/障碍）、congenital malformation（先天畸形）。","词源提示：con-（一起）+ genitus（出生的），核心含义就是“与出生同时存在”。"]}
{"word":"congenitally","summary":{"en":"“Congenitally” means “from birth; in a way someone is born with,” often used in medical or formal contexts.","zh":"“congenitally”表示“先天性地、从出生起就有地”，多用于医学或正式语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is present from birth; because of a condition someone was born with (often used in medical contexts).","zh":"先天性地；由于出生时就存在的状况（常用于医学语境）。"},"examples":[{"en":"She is congenitally deaf, so she uses sign language.","zh":"她先天性失聪，所以她使用手语。"},{"en":"The baby was congenitally blind due to a genetic condition.","zh":"由于遗传疾病，这个婴儿先天性失明。"},{"en":"Some heart defects are congenitally present and need early treatment.","zh":"有些心脏缺陷是先天存在的，需要及早治疗。"}]}],"synonyms":["from birth","by birth","innately","naturally (context-dependent)"],"phonetic":"/kənˈdʒɛnɪtəli/","extraExplanation":["“congenitally”通常修饰形容词或过去分词，如 congenitally blind/deaf（先天性失明/失聪）、congenitally missing（先天缺失）。","词根提示：gen 表示“出生/产生”（同源于 generate），con- 有“一起/共同”的意思；整体含义可理解为“与出生一起带来的”。","注意语气与场合：该词多用于正式、医学或科普写作；日常口语里常改说 “born with … / from birth（天生……/从出生起）”。"]}
{"word":"congenitalness","summary":{"en":"Congenitalness means the state of being congenital—present from birth.","zh":"Congenitalness 指“先天性”，即出生时就存在的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being congenital (present from birth, often because of genes or conditions during pregnancy)","zh":"先天性；天生就有的状态（出生时就存在，常与遗传或孕期因素有关）"},"examples":[{"en":"Doctors discussed the congenitalness of the heart defect and how it might affect treatment.","zh":"医生讨论了这种心脏缺陷的先天性，以及它可能如何影响治疗方案。"},{"en":"Researchers studied the congenitalness of the condition to understand whether it appears at birth or develops later.","zh":"研究人员研究了该疾病的先天性，以判断它是出生时就存在还是后来才发展出来。"}]}],"synonyms":["congenitality","innateness","inborn nature"],"phonetic":"/kənˈdʒɛnɪtəl.nəs/","extraExplanation":["“congenitalness”在现代英语中很少见，听起来偏临时造词；更常用的是“congenitality”（先天性）或直接说“the congenital nature of … / the fact that … is congenital”。","“congenital”多用于医学语境，指“出生时就有”；它不一定等于“遗传的（hereditary）”。例如某些先天缺陷可能与孕期感染、环境因素有关，而不一定来自父母遗传。"]}
{"word":"congenite","summary":{"en":"“Congenital” means “present from birth,” and it can also describe a natural, inborn trait.","zh":"“congenital”表示“先天的、出生时就有的”，也可引申为“天生的性格/特质”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"born with a particular condition; present from birth (often used in medicine).","zh":"先天的；出生时就有的（常用于医学）。"},"examples":[{"en":"The baby was diagnosed with a congenital heart defect.","zh":"婴儿被诊断为先天性心脏缺陷。"},{"en":"Congenital hearing loss can sometimes be treated early.","zh":"先天性听力损失有时可以尽早治疗。"}]},{"partOfSpeech":"adj.","definition":{"en":"natural and long-lasting; seeming to be part of someone’s character from the beginning.","zh":"与生俱来的；天生的（形容性格或习惯等）。"},"examples":[{"en":"He is a congenital optimist who always expects the best.","zh":"他是个天生的乐观主义者，总是期待最好的结果。"}]}],"synonyms":["inborn","innate","hereditary","congenital"],"phonetic":"/kənˈdʒɛnɪtəl/","extraExplanation":["“congenite”在英语里非常少见，日常和学术写作中几乎都不用。多数情况下这是把“congenital（先天的）”拼错了。","“congenital”强调“出生时就存在”，不一定表示“遗传（genetic）”。例如某些先天缺陷可能与孕期环境有关，而不是基因直接造成。","常见搭配：congenital disease/defect/condition（先天性疾病/缺陷/状况）、congenital heart defect（先天性心脏缺陷）。"]}
{"word":"congeon","summary":{"en":"Congeon is a rare word meaning a clotted mass (especially of blood), or (rarely) to congeal.","zh":"congeon 是个很少用的词，指（尤指血液的）凝结块/血块；很少也可作动词表示“凝结”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/old-fashioned) A thick, clotted mass formed when a liquid (especially blood) congeals.","zh":"（罕见/旧用法）液体（尤指血液）凝结后形成的块状物；血块。"},"examples":[{"en":"The wound was covered with a dark congeon of dried blood.","zh":"伤口上覆着一层深色的凝结血块。"},{"en":"The doctor removed a small congeon from the cut.","zh":"医生从伤口里取出了一小块凝结物。"}]},{"partOfSpeech":"v.","definition":{"en":"(Very rare) To congeal; to become thick or solid.","zh":"（非常罕见）凝结；变稠或变硬。"},"examples":[{"en":"As the sauce cooled, it began to congeon.","zh":"酱汁冷却后开始凝结变稠。"}]}],"synonyms":["clot","coagulum","lump","mass"],"phonetic":"/kənˈdʒiən/","extraExplanation":["“congeon”在现代英语中非常少见，更常见的相关词是：\n- congeal（v.）“凝结”\n- congestion（n.）“拥堵；（鼻）充血”\n很多学习者看到“congeon”其实是想写 congeal 或 congestion。"]}
{"word":"Conger","summary":{"en":"Conger is a large sea eel (conger eel).","zh":"conger 指一种大型海鳗（conger eel）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large sea eel (a type of eel) found in the Atlantic and nearby seas; also called a conger eel","zh":"海鳗；康吉鳗（生活在大西洋等海域的一种大型海鳗）"},"examples":[{"en":"Fishermen pulled a conger from the net and measured its length.","zh":"渔民从网里拉出一条海鳗，并测量它的长度。"},{"en":"Conger eels often hide in rocks and feed at night.","zh":"海鳗常躲在岩石缝里，并在夜间觅食。"}]}],"synonyms":["conger eel","sea eel","eel"],"phonetic":"/ˈkɑŋɡɚ/","extraExplanation":["“Conger”主要指“conger eel（海鳗）”。在英国、爱尔兰、西班牙和葡萄牙等沿海地区，它也会出现在海鲜料理中。","不要把 conger 和动词 congregate（聚集）混淆：它们拼写相近，但意思完全不同。"]}
{"word":"conger","summary":{"en":"Conger means a large sea eel, especially the conger eel.","zh":"conger 指大型海鳗，尤其是“康吉鳗/海鳗（conger eel）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large eel (the conger eel) that lives in the sea; often used as food in some coastal cuisines","zh":"海鳗（康吉鳗）：一种生活在海里的大型鳗鱼；在一些沿海地区也会被当作食物"},"examples":[{"en":"A conger can grow very large and lives in rocky areas along the coast.","zh":"海鳗可能长得很大，常生活在沿海的岩石地带。"},{"en":"The fisherman pulled a conger from the net and warned everyone about its strong bite.","zh":"渔夫从网里拉出一条海鳗，并提醒大家它咬合力很强。"},{"en":"In some places, conger eel is cooked in stews or grilled.","zh":"在一些地方，海鳗会被用来炖煮或烧烤。"}]}],"synonyms":["conger eel","sea eel"],"phonetic":"/ˈkɑŋɡɚ/","extraExplanation":["“Conger”通常指“conger eel（海鳗/康吉鳗）”。在日常英语里，人们更常说完整的“conger eel”，单独说“conger”更偏向渔业、海洋生物或菜单语境。","词源来自拉丁语“conger”（一种鳗鱼），后来进入法语并被英语借用。","注意不要和“conga”（康加鼓/康加舞）混淆：拼写和发音相近，但意思完全不同。"]}
{"word":"congeree","summary":{"en":"Congeree means congee: a soft rice porridge.","zh":"Congeree 指 congee：稀饭／米粥。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Variant spelling of “congee”) a soft rice porridge (rice cooked with lots of water until it becomes thick and creamy), common in many Asian cuisines.","zh":"（“congee”的拼写变体）稀饭／粥：把米加大量水煮到软烂浓稠的一种米粥，在许多亚洲饮食中很常见。"},"examples":[{"en":"When I’m sick, I like to eat congeree with ginger and a little salt.","zh":"我生病时喜欢吃加姜和一点盐的粥（congeree）。"},{"en":"She made chicken congeree for breakfast.","zh":"她早餐做了鸡肉粥（congeree）。"}]}],"synonyms":["congee","rice porridge","rice gruel"],"phonetic":"/ˌkɑn.dʒiː/","extraExplanation":["“Congeree”在英语里不如更常见的拼写“congee”普遍；你在菜单、旧食谱或地区性写法中可能会看到它。","“Congee/congeree”来自南亚语言（常被认为与泰米尔语等词源有关），后来进入英语，用来指这种“米粥/稀饭”这一类食物。"]}
{"word":"congerie","summary":{"en":"Congeries means a mixed collection or heap of different things gathered together.","zh":"Congeries 指“杂集、混杂的一堆”，常用于较正式的表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A collection or group of different things gathered together, often in a mixed or somewhat messy way.","zh":"杂集；混杂的一堆（不同事物聚在一起，常带有“杂乱、拼凑”的感觉）。"},"examples":[{"en":"The museum exhibit was a congeries of photos, letters, and everyday objects from the war.","zh":"那个博物馆展览是一堆战争时期的照片、信件和日常物品的杂集。"},{"en":"Her desk had become a congeries of notebooks, receipts, and coffee cups.","zh":"她的桌子变成了笔记本、收据和咖啡杯混在一起的一堆。"}]}],"synonyms":["collection","assortment","jumble","hodgepodge","medley","mishmash"],"phonetic":"/ˈkɑndʒəˌriz/","extraExplanation":["“congeries”在正式写作中更常见，语气比“collection”更文学、更强调“杂乱地聚在一起”。","词源来自拉丁语 congerere（把东西堆在一起）。在学术或文学语境里，可用来形容“材料、观点、细节”等拼成的一团。","用法提示：它常搭配 of（a congeries of ...）。在现代英语中属于较少见但很有表现力的词。"]}
{"word":"congeries","summary":{"en":"Congeries means a piled-up collection or cluster of various things, often used in formal writing.","zh":"Congeries 指不同事物堆在一起的集合/一堆，偏正式书面用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A collection or mass of different things gathered together; a cluster.","zh":"（不同事物）聚集在一起的一团/一堆；集合体；簇。"},"examples":[{"en":"On her desk sat a congeries of papers, books, and coffee cups.","zh":"她的桌上堆着一堆纸张、书和咖啡杯。"},{"en":"The museum displayed a congeries of artifacts from several ancient cultures.","zh":"博物馆展出了一批来自多个古代文明的文物集合。"},{"en":"The city is a congeries of old neighborhoods and new skyscrapers.","zh":"这座城市是老街区与新摩天楼交织而成的集合体。"}]}],"synonyms":["collection","cluster","heap","mass","assortment","mixture"],"phonetic":"/kənˈdʒɪriz/","extraExplanation":["这是一个较正式、偏书面（学术/文学）用词，日常英语更常用 collection、mixture、heap、cluster、assortment 等。","词源来自拉丁语 congeries，来自动词 congerere（把……堆在一起）。在写作中常用来强调“杂而多、堆叠在一起”的感觉，而不一定是整齐分类的集合。"]}
{"word":"Congers","summary":{"en":"“Congers” means conger eels (plural).","zh":"“Congers” 指海鳗（conger eel）的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of conger: large sea eels (conger eels).","zh":"conger 的复数：海鳗（康吉鳗），一种体型较大的海洋鳗鱼。"},"examples":[{"en":"Congers hide in rocks and shipwrecks during the day.","zh":"海鳗白天会躲在岩石和沉船里。"},{"en":"The fisherman reported catching two large cong​ers offshore.","zh":"那位渔民说他在近海钓到了两条大海鳗。"}]}],"synonyms":["conger eels","eels"],"phonetic":"/ˈkɑŋɡɚ/","extraExplanation":["“conger / cong​er eel”常见于英国和欧洲沿海语境（如渔业、海洋生物）。在菜谱里也会出现（例如烤海鳗、炖海鳗），但与淡水的“eel（鳗鱼）”不是同一种。","拼写上以 -ers 结尾表示复数：one conger, two cong​ers。大写 “Congers” 也可能是姓氏或地名的一部分，但作为词汇学习时通常指这种海鳗的复数。"]}
{"word":"congers","summary":{"en":"“Congers” usually means conger eels (plural): large sea eels.","zh":"“congers”通常指海鳗（复数）：一种大型海水鳗鱼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) large sea eels (conger eels), often used as food.","zh":"（复数）海鳗（康吉鳗），一种大型海水鳗鱼，常被用作食物。"},"examples":[{"en":"Congers can grow very large and live in rocky coastal waters.","zh":"海鳗可能长得很大，常栖息在多岩的近海水域。"},{"en":"The fisherman sold congers at the market early in the morning.","zh":"渔夫一大早就在市场上卖海鳗。"}]},{"partOfSpeech":"v.","definition":{"en":"(third-person singular, rare) to gather or mass together into a group.","zh":"（第三人称单数，较少见）聚集；使成群。"},"examples":[{"en":"Over time, the small groups congers into a larger community.","zh":"随着时间推移，这些小团体聚成了更大的社群。"}]}],"synonyms":["conger eels","sea eels","eels"],"phonetic":"/ˈkɑŋɡɚ/","extraExplanation":["“congers”最常见是名词复数，来自“conger eel（海鳗/康吉鳗）”。在英式菜单或渔业语境里更常见。","注意不要和发音/拼写相近的“conjures（变出；召唤）”混淆：conger（海鳗）是名词；conjure 是动词。"]}
{"word":"Congerville","summary":{"en":"Congerville is a place name in Illinois, USA.","zh":"Congerville 是美国伊利诺伊州的一个地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small community (place name) in Illinois, USA; used as a proper noun","zh":"（专有名词）美国伊利诺伊州的一个小社区/地名"},"examples":[{"en":"Congerville is a quiet place in central Illinois.","zh":"Congerville 是伊利诺伊州中部一个安静的地方。"},{"en":"She grew up near Congerville before moving to Chicago.","zh":"她在 Congerville 附近长大，后来搬到了芝加哥。"}]}],"synonyms":["(no direct synonyms; it is a proper place name)"],"phonetic":"/ˈkɑŋɡərˌvɪl/","extraExplanation":["“Congerville”是美国地名，常见于地址、地图、新闻或个人经历叙述中。它通常指伊利诺伊州伍德福德县（Woodford County）一带的一个小型社区（未必是独立建制城市）。","发音上可拆成“Conger + ville”。其中“-ville”源自法语，常见于美国地名，表示“城镇/村落”（类似中文的“某某镇/村”）。"]}
{"word":"congery","summary":{"en":"“Congery” means a mixed collection or group of things, often implying clutter or a messy mix.","zh":"“Congery”指混杂的一堆/一群东西，常带有杂乱、堆放的感觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a collection or group of different things (often used to suggest the group is mixed, crowded, or not very well organized)","zh":"一堆；一群；杂糅在一起的集合（常暗示混杂、拥挤或不太整齐）"},"examples":[{"en":"The garage was filled with a congery of old tools, boxes, and broken furniture.","zh":"车库里堆满了各种旧工具、箱子和坏掉的家具。"},{"en":"On the table lay a congery of papers from different projects.","zh":"桌上摊着一堆来自不同项目的文件。"}]}],"synonyms":["collection","assortment","mixture","medley","jumble","heap"],"phonetic":"/ˈkɑŋɡəri/","extraExplanation":["这个词比较正式、偏书面，在现代日常口语中不算常见；有时带一点“杂乱拼凑”的语气。","词源上与“gather/collect（聚集、收集）”有关，来自拉丁语词根 con-（一起）+ greg-（群、集合）。"]}
{"word":"conges","summary":{"en":"“Conges” is usually the plural of “congé,” meaning official leave from work or a formal dismissal; it can also mean a jelly-like set dish in cooking (less common).","zh":"conges 通常是 congé 的复数，指准假/休假或正式解雇；在烹饪中也可指冻状冷盘或凝结的胶冻层（较少见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often plural) official leave from work; permission to be absent, or a formal dismissal.","zh":"（常用复数）准假；（正式）离职/被解雇的通知。"},"examples":[{"en":"She is on sick congé this week.","zh":"她这周在休病假。"},{"en":"After the argument, he was given his congé.","zh":"争吵之后，他被正式解雇了。"}]},{"partOfSpeech":"vt.","definition":{"en":"to dismiss someone formally; to send away or release from duty.","zh":"（正式）解雇；打发走；解除职务。"},"examples":[{"en":"The company congéed several employees during the downturn.","zh":"在经济不景气时，公司正式解雇了几名员工。"}]},{"partOfSpeech":"n.","definition":{"en":"(cooking, less common) a molded cold dish (similar to jelly/aspic), or the jelly/fat layer that sets on top of broth.","zh":"（烹饪，较少见）冻状冷盘；（汤上）凝结的胶冻/油脂层。"},"examples":[{"en":"The broth cooled and a thin congé formed on the surface.","zh":"汤放凉后，表面凝出一层薄薄的胶冻/油脂。"}]}],"synonyms":["leave","vacation","time off","dismissal","discharge"],"phonetic":"/kɑnˈʒeɪ/","extraExplanation":["“conges”多半是“congé”的复数写法；在法语里常写作“congés”，表示“休假/假期”，如“congés payés”（带薪休假）。","注意不要和“congee”（米粥）混淆：congee 指亚洲常见的米粥，拼写和发音都不同。","这个词在现代日常英语中偏正式、也较少见；更常用的说法是 leave, vacation, dismissal 等。"]}
{"word":"congession","summary":{"en":"Congestion means overcrowding or blockage (especially traffic), or a medical blockage like a stuffy nose.","zh":"Congestion 指拥堵/堵塞（常指交通），也可指医学上的堵塞，如鼻塞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Correct spelling: congestion) A condition in which something (like traffic or a system) is too crowded or blocked, so movement becomes slow or difficult.","zh":"（正确拼写：congestion）拥堵；堵塞（指交通或系统过于拥挤或被阻塞，导致通行缓慢或困难）。"},"examples":[{"en":"There was heavy traffic congestion during rush hour.","zh":"高峰时段交通严重拥堵。"},{"en":"We need to fix the road design to reduce congestion downtown.","zh":"我们需要改善道路设计来减少市中心的拥堵。"},{"en":"The accident caused congestion on the highway for miles.","zh":"这起事故导致高速公路拥堵了好几英里。"}]},{"partOfSpeech":"n.","definition":{"en":"In medicine, an unhealthy buildup of blood or fluid in a body part, often causing swelling or a blocked feeling (especially in the nose or chest).","zh":"（医学）充血；鼻塞/胸闷（血液或体液在身体某部位异常积聚，常引起肿胀或堵塞感）。"},"examples":[{"en":"He has nasal congestion from a cold.","zh":"他因为感冒而鼻塞。"},{"en":"Warm steam can help relieve congestion.","zh":"热蒸汽可以帮助缓解鼻塞。"}]}],"synonyms":["traffic jam","crowding","gridlock","blockage","clogging","stuffiness"],"phonetic":"/kənˈdʒɛstʃən/","extraExplanation":["你输入的“congession”常见原因是把 -st- 的拼写漏掉了；标准拼写是 congestion。可以把它拆开记：con-（一起）+ gest（堆积）+ -ion（名词后缀），整体就是“堆在一起导致堵塞”。"]}
{"word":"congest","summary":{"en":"“Congest” means to crowd or block a place (especially roads) or to cause nasal blockage from illness or allergies.","zh":"“congest”指（使）拥堵/堵塞（常指交通），也可指因感冒或过敏导致鼻塞、充血。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to become or make something too crowded or blocked, especially a road or area with too many vehicles or people","zh":"（使）拥堵；（使）堵塞（尤指道路、区域因车辆或人太多而不通畅）"},"examples":[{"en":"Morning traffic often congests the highway near downtown.","zh":"早高峰时，市中心附近的高速公路常常会拥堵。"},{"en":"Too many trucks can congest the narrow streets.","zh":"卡车太多会把狭窄的街道堵得水泄不通。"}]},{"partOfSpeech":"v.","definition":{"en":"to become blocked because of too much mucus, making it hard to breathe through the nose (often used with “be” or “get”)","zh":"（鼻子等）充血、堵塞（因分泌物过多而不通畅，常与 be/get 连用）"},"examples":[{"en":"I get congested when my allergies are bad.","zh":"过敏严重时我就会鼻塞。"},{"en":"The cold left him congested for a week.","zh":"这次感冒让他鼻塞了一周。"}]}],"synonyms":["jam","clog","block","choke","back up"],"phonetic":"/kənˈdʒɛst/","extraExplanation":["“congest”在交通语境里很常见，常与traffic/roads/streets/highway搭配：traffic is congested（交通很拥堵）；也可以说congested roads（拥堵的道路）。","健康语境里更常见的形容词是“congested”（鼻塞的、充血的），名词是“congestion”（拥堵/鼻塞）。","同义表达：交通—jam, clog, back up；鼻塞—stuffy, blocked nose。"]}
{"word":"congested","summary":{"en":"“Congested” means overcrowded or blocked, making movement or flow difficult (traffic, places, or your nose).","zh":"“congested”表示拥挤或堵塞，导致通行或流动困难（如交通、场所或鼻塞）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too crowded or full, so movement or flow becomes slow or difficult (often about roads, places, or body parts like the nose).","zh":"过于拥挤或堵塞，导致通行或流动变慢或困难（常指道路、场所，或身体部位如鼻子）。"},"examples":[{"en":"The streets are congested during rush hour.","zh":"高峰期街道很拥堵。"},{"en":"I can’t breathe well because my nose is congested.","zh":"我鼻子堵得厉害，呼吸不太顺。"},{"en":"The hospital was congested with patients after the accident.","zh":"事故发生后，医院挤满了病人。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to congestion: a blocked or overfilled condition (especially in medical or technical contexts).","zh":"与“充血/阻塞/拥塞”有关的（尤用于医学或技术语境）。"},"examples":[{"en":"The doctor listened to his congested lungs.","zh":"医生听诊了他充血、堵塞的肺部。"},{"en":"Use the report to identify congested network areas.","zh":"用这份报告来找出网络拥塞的区域。"}]}],"synonyms":["crowded","packed","jammed","blocked","clogged","stuffy"],"phonetic":"/kənˈdʒɛstɪd/","extraExplanation":["“congested”来自动词“congest”（使拥塞/使充满），常见搭配有：congested roads/traffic（拥堵的道路/交通）、congested city streets（拥挤的城市街道）、congested nose/sinuses（鼻塞/鼻窦堵塞）、congested lungs（肺部充血/淤积）。","日常口语中形容交通更常说“traffic is heavy”或“it’s really backed up”。医学鼻塞也常说“stuffy nose”。"]}
{"word":"congestedness","summary":{"en":"“Congestedness” means the state of being congested (blocked or overcrowded), though “congestion” is more common.","zh":"“congestedness”指“拥堵/阻塞的状态”，但更常用的词是“congestion”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or quality of being congested; heaviness or blockage caused by too much traffic, too many people, or too much fluid/mucus (in the body).","zh":"拥堵/阻塞的状态或性质；因交通、人群过多，或（身体）液体/黏液积聚而造成的堵塞、憋胀感。"},"examples":[{"en":"During rush hour, the downtown streets show extreme congestedness.","zh":"在高峰时段，市中心街道拥堵得很严重。"},{"en":"The doctor asked about his nasal congestedness and trouble breathing at night.","zh":"医生询问他鼻塞的情况以及夜间呼吸困难的问题。"}]}],"synonyms":["congestion","crowding","blockage","stuffiness"],"phonetic":"/kənˈdʒɛstɪdnəs/","extraExplanation":["“congestedness”在现代英语中比较少见，很多时候更常用、更自然的说法是“congestion”（拥堵/充血/鼻塞）或“crowding/traffic congestion”（人群/交通拥堵）。在医学语境也常用“nasal congestion”（鼻塞）。","构词：congested（拥堵的/充血的）+ -ness（名词后缀，表示“……的状态/性质”）。因此它强调“处于拥堵/阻塞的状态”。"]}
{"word":"congestible","summary":{"en":"“Congestible” means able to become blocked or medically congested.","zh":"“congestible”表示“可变得堵塞或（医学上）可发生充血/淤塞的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to become congested (blocked or crowded), especially in a medical sense (e.g., tissues, lungs, blood vessels).","zh":"可发生充血或阻塞的；（尤指医学上）容易变得淤塞/拥堵的（如组织、肺部、血管）。"},"examples":[{"en":"People with asthma may have more congestible airways during a cold.","zh":"哮喘患者在感冒时气道可能更容易出现淤塞。"},{"en":"Inflamed nasal tissue is highly congestible, which is why your nose can feel suddenly blocked.","zh":"发炎的鼻腔组织很容易充血肿胀，所以鼻子会突然感觉堵住。"}]}],"synonyms":["prone to congestion","susceptible to congestion","easily congested"],"phonetic":"/kənˈdʒɛstəbəl/","extraExplanation":["“congestible”在日常英语中不算常用，更常见的是用“congested（充血的/堵塞的）”或“prone to congestion（容易堵塞/充血的）”。","词根提示：congest- 来自“congestion（拥堵；充血）”，后缀 -ible 表示“能够……的”。多见于医学或技术性写作中。"]}
{"word":"congesting","summary":{"en":"“Congesting” means becoming or causing something to become crowded/blocked (traffic) or blocked in the body (medical congestion).","zh":"“Congesting”指正在变得或正在造成拥堵/堵塞（交通），或引起身体（如鼻子、胸部）的充血/阻塞。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"becoming crowded, blocked, or overfilled (often about traffic or roads)","zh":"变得拥挤、堵塞或过度挤满（常指交通、道路）"},"examples":[{"en":"Cars were congesting the highway during rush hour.","zh":"在高峰期，汽车把高速公路堵得水泄不通。"},{"en":"New construction is congesting the downtown streets.","zh":"新的施工让市中心街道变得更堵了。"}]},{"partOfSpeech":"v.","definition":{"en":"causing congestion in the body (a buildup that blocks normal flow, especially in the nose, chest, or lungs)","zh":"使身体出现“充血/阻塞”（尤其指鼻子、胸部或肺部的堵塞、痰多等）"},"examples":[{"en":"A cold can leave you congesting your nose and sinuses.","zh":"感冒可能会让你的鼻子和鼻窦变得堵塞。"},{"en":"The smoke was congesting his chest, making it hard to breathe.","zh":"烟雾让他的胸口发闷堵塞，呼吸变得困难。"}]}],"synonyms":["clogging","blocking","crowding","jamming","choking up"],"phonetic":"/kənˈdʒɛstɪŋ/","extraExplanation":["“congesting”是动词congest的现在分词/动名词形式，常用在进行时（is/are congesting）或作定语（congesting traffic）。更常见的形容状态表达是“congested”（e.g., congested roads / congested nose）。","交通语境里：congest = 使（道路/区域）拥堵；医学语境里：congest = 使（器官/通道）充血或堵塞。日常说“鼻塞”更常用be congested或have congestion。"]}
{"word":"congestion","summary":{"en":"Congestion means overcrowding that causes delay (often traffic) or blockage/too much fluid in the body (often nose or chest).","zh":"Congestion 指因过度拥挤导致的拥堵/延误（常见于交通），也指身体部位（常为鼻或胸）堵塞或充血、积液造成的不适。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A situation in which something (especially traffic) is too crowded, causing slow movement or delay.","zh":"（尤指交通）拥堵；因过于拥挤而导致移动缓慢或延误的情况。"},"examples":[{"en":"There was heavy traffic congestion on the highway this morning.","zh":"今天早上高速公路上交通严重拥堵。"},{"en":"The city is trying to reduce congestion by improving public transportation.","zh":"这座城市正通过改善公共交通来减少拥堵。"}]},{"partOfSpeech":"n.","definition":{"en":"A medical condition in which a part of the body (often the nose or lungs) becomes blocked or filled with fluid, making it hard to breathe.","zh":"（医学）充血；（常指鼻/肺）堵塞或积液，导致呼吸不畅。"},"examples":[{"en":"I have nasal congestion from a cold.","zh":"我感冒了，鼻子很堵。"},{"en":"The doctor listened to his chest for signs of congestion.","zh":"医生听了他的胸部，检查是否有充血（或肺部淤积）的迹象。"}]}],"synonyms":["crowding","traffic jam","blockage","stuffiness"],"phonetic":"/kənˈdʒɛstʃən/","extraExplanation":["在英语里，congestion 常见两大语境：1）交通（traffic congestion）；2）健康/医学（nasal congestion, chest congestion）。日常口语里说“鼻塞”更常用 nasal congestion 或直接说 a stuffy nose。","常见搭配：relieve congestion（缓解堵塞/充血），cause congestion（造成拥堵），ease congestion（缓解拥堵），congestion pricing（拥堵收费：在高峰期对进入特定区域的车辆收费以减少车流）。"]}
{"word":"congestions","summary":{"en":"“Congestions” is the plural of “congestion,” meaning bodily blockage (like a stuffy nose) or overcrowding—especially traffic jams.","zh":"“congestions”是“congestion”的复数，可指身体堵塞（如鼻塞/胸闷）或（尤指交通）拥堵、拥挤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"blockage or swelling in the body (especially the nose or chest) caused by too much fluid or mucus","zh":"（尤指鼻子或胸部的）充血、堵塞；（因黏液或体液过多导致的）鼻塞/胸闷"},"examples":[{"en":"I have nasal congestion, so it’s hard to breathe through my nose.","zh":"我鼻塞，所以很难用鼻子呼吸。"},{"en":"The doctor asked if she had any chest congestion or coughing.","zh":"医生问她有没有胸闷（胸部堵塞感）或咳嗽。"}]},{"partOfSpeech":"n.","definition":{"en":"a situation where a road or place is too crowded, causing slow movement (especially traffic)","zh":"（尤指交通）拥堵；（道路/场所）过于拥挤导致通行缓慢"},"examples":[{"en":"Morning traffic congestions often make the commute longer.","zh":"早高峰的交通拥堵常常让通勤时间变长。"},{"en":"The city is trying to reduce congestion by improving public transportation.","zh":"这座城市正通过改善公共交通来减少拥堵。"}]},{"partOfSpeech":"n.","definition":{"en":"overcrowding or too much of something in one area (more general use)","zh":"（更泛指）拥挤；过度集中；堆积"},"examples":[{"en":"There was congestion near the entrance because everyone arrived at once.","zh":"入口附近很拥挤，因为大家同时到达。"}]}],"synonyms":["blockage","stuffiness","obstruction","traffic jam","crowding","overcrowding"],"phonetic":"/kənˈdʒɛstʃən/","extraExplanation":["“congestions”是“congestion”的复数，但在很多场景里“congestion”常作不可数名词使用（如 traffic congestion, nasal congestion）。当你在新闻或报告里看到“congestions”，通常是在指“多处/多种拥堵或堵塞情况”。","医学语境中常见搭配：nasal congestion（鼻塞）、chest congestion（胸部堵塞感/痰多）。交通语境中更常说 traffic congestion（交通拥堵），也常用动词缓解表达：ease/reduce congestion（缓解/减少拥堵）。"]}
{"word":"congestive","summary":{"en":"Congestive means “causing or related to congestion,” and is often used in medical contexts (e.g., congestive heart failure).","zh":"congestive 表示“引起或与淤塞/充血有关的”，常用于医学语境（如“充血性心力衰竭”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Too full or blocked, especially in the nose, lungs, or blood vessels; causing or related to congestion.","zh":"（尤指鼻腔、肺或血管）充血的、淤塞的；与（鼻塞/充血/阻塞）有关的。"},"examples":[{"en":"I have a congestive cough and feel pressure in my chest.","zh":"我咳得很厉害（带痰、堵），而且胸口有压迫感。"},{"en":"A cold can make your nose congestive at night.","zh":"感冒会让你晚上鼻子更堵。"}]},{"partOfSpeech":"adj.","definition":{"en":"Used in medical terms to describe a condition involving fluid buildup or impaired circulation, especially in the heart.","zh":"（医学用语）用于描述与体液潴留或循环不良有关的情况，尤指心脏方面。"},"examples":[{"en":"The doctor mentioned congestive heart failure as a possible diagnosis.","zh":"医生提到“充血性心力衰竭”可能是一个诊断方向。"},{"en":"Congestive symptoms can include swelling in the legs and shortness of breath.","zh":"充血性（循环不良）症状可能包括腿部水肿和呼吸急促。"}]}],"synonyms":["blocked","congested","stuffy","obstructed","swollen"],"phonetic":"/kənˈdʒɛstɪv/","extraExplanation":["“congestive”常见于医学搭配，最典型的是 congestive heart failure（充血性心力衰竭，简称 CHF）。在日常表达里，更常说 “congested” 来形容“鼻塞/堵”：I’m congested. / a congested nose。","词根提示：con-（一起）+ gest（携带/堆积）→ “堆在一起、挤在一起”→ 引申为“淤塞、充血”。"]}
{"word":"congests","summary":{"en":"“Congests” means becomes blocked or crowded (traffic/places) or becomes blocked with fluid (the body).","zh":"“Congests”表示变得拥堵、堵塞（交通/场所），也可指身体因充血或积液而堵塞。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of a place, road, or system) to become blocked or crowded so that movement becomes slow or difficult; third-person singular of “congest.”","zh":"（地方、道路或系统）变得拥堵、堵塞，使通行变慢或困难；为动词“congest”的第三人称单数形式。"},"examples":[{"en":"The highway congests during rush hour.","zh":"高峰期这条高速公路会拥堵。"},{"en":"When too many people arrive at once, the entrance congests quickly.","zh":"当太多人同时到达时，入口很快就会被挤堵。"},{"en":"This narrow street congests easily after school.","zh":"这条狭窄的街道放学后很容易堵。"}]},{"partOfSpeech":"v.","definition":{"en":"(of the body) to become filled with too much blood or fluid, causing swelling or a “blocked” feeling (often used for the nose, chest, or lungs).","zh":"（身体）充血或积液过多而出现肿胀、堵塞感（常指鼻子、胸部或肺部）。"},"examples":[{"en":"My nose congests when the weather changes.","zh":"天气变化时我鼻子会堵。"},{"en":"In some illnesses, the lungs can congest with fluid.","zh":"在某些疾病中，肺部可能会因积液而淤塞。"}]}],"synonyms":["blocks","clogs","crowds","jams","chokes"],"phonetic":"/kənˈdʒɛsts/","extraExplanation":["“congests”是“congest”的第三人称单数（he/she/it congests）。常见搭配：traffic congests（交通拥堵）、streets congest（街道堵塞）、nose congests（鼻子堵）。日常说“鼻塞”更常用 be congested / nasal congestion。"]}
{"word":"congestus","summary":{"en":"“Congestus” is mainly used in meteorology to mean a towering cumulus cloud (cumulus congestus).","zh":"“Congestus”主要用于气象领域，指塔状积云（cumulus congestus，垂直发展强的积云）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Meteorology) A type of cumulus cloud with strong vertical growth (a tall, cauliflower-shaped “towering cumulus”), often a sign of rising warm, moist air and potential showers.","zh":"（气象）一种垂直发展很强的积云（高耸、呈“花椰菜状”的塔状积云），常表示暖湿空气强烈上升，可能带来阵雨。"},"examples":[{"en":"By late afternoon, cumulus congestus clouds were building over the hills.","zh":"到傍晚时，山丘上空开始堆积起塔状积云。"},{"en":"Pilots watch for congestus because it can signal developing thunderstorms nearby.","zh":"飞行员会留意塔状积云，因为它可能预示附近正在发展雷暴。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common) Describing clouds that are piled up or heaped together, especially in the phrase “cumulus congestus.”","zh":"（较少见）形容云层“堆积、聚集”的，尤用于短语“cumulus congestus（塔状积云）”。"},"examples":[{"en":"The forecast mentioned cumulus congestus forming after midday heating.","zh":"预报提到在午后增温后会形成塔状积云。"}]}],"synonyms":["towering cumulus","cumulus congestus"],"phonetic":"/kənˈdʒɛstəs/","extraExplanation":["“Congestus”源自拉丁语，意为“堆积起来的、聚集的”。在英语里它最常见于云的分类：**cumulus congestus**，中文常译为“塔状积云”或“浓积云”（不同资料可能略有差异）。它通常比普通积云更高、更厚，但还没有发展到成熟的积雨云（cumulonimbus）。"]}
{"word":"congiaries","summary":{"en":"“Congiaries” is the plural of “congiary,” meaning public gifts or handouts (money or goods), especially in ancient Rome.","zh":"“congiaries”是“congiary”的复数，指公开发放的赏赐/救济（钱或物资），尤见于古罗马语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a gift of money, grain, or other goods given publicly (especially in ancient Rome) by a ruler or government to the people; plural: congiaries","zh":"（尤指古罗马统治者或政府）向民众公开发放的赏赐、施舍或救济（如钱、粮食等）；复数：congiaries"},"examples":[{"en":"The emperor won popularity by distributing congiaries to the urban poor.","zh":"皇帝通过向城市贫民发放congiaries来赢得民心。"},{"en":"Historical records describe congiaries of grain during times of shortage.","zh":"史料记载，在短缺时期曾发放以谷物为主的congiaries。"}]}],"synonyms":["handouts","public dole","largesse","donations","alms (context-dependent)"],"phonetic":"/ˈkɑn.dʒiˌɛr.i/","extraExplanation":["“congiary”源自拉丁语 congiarium，原指按“congius（古罗马的容量单位）”计量发放的酒或油，后来引申为统治者向民众发放的金钱或物资。它常用于历史写作，带有“政治性施恩/笼络民心”的语感。"]}
{"word":"congiary","summary":{"en":"A congiary is a (usually public) gift or distribution of goods or money, especially in ancient Rome.","zh":"congiary 指（通常公开的）赏赐或物资/金钱的发放，尤常用于古罗马语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a gift or public distribution of money, food, or other goods (especially in ancient Rome, given by an emperor or a political leader to the people)","zh":"（尤指古罗马）统治者或政治领袖向民众发放的赏赐/施舍（如金钱、粮食等）"},"examples":[{"en":"The new emperor announced a congiary to celebrate his accession.","zh":"新皇帝宣布发放赏赐，以庆祝他即位。"},{"en":"Historians describe a congiary of grain during a time of shortage.","zh":"历史学家记载了在短缺时期一次发放粮食的赏赐。"}]},{"partOfSpeech":"n.","definition":{"en":"any generous gift or donation (formal, rare)","zh":"（正式用语，较少见）慷慨的赠与/捐赠"},"examples":[{"en":"The library received a congiary of rare books from a private collector.","zh":"图书馆收到一位私人收藏家捐赠的一批珍贵书籍。"}]}],"synonyms":["handout","largesse","donation","grant","alms"],"phonetic":"/ˈkɑndʒiˌɛri/","extraExplanation":["“congiary”多见于历史或文学语境，常与古罗马的公共政治生活相关：统治者通过向民众发放钱粮来赢得支持、庆祝胜利或稳定局势。","词源与拉丁语有关：原指按“congius（量器）”计量分发的酒或油，后来引申为“按份发放的赏赐”。","拼写提示：也常见变体“congiarium”（更偏拉丁原形、历史写法）。"]}
{"word":"congii","summary":{"en":"Congee is a thick rice porridge, often eaten for breakfast and served with savory toppings.","zh":"Congee 指稠米粥/稀饭，常作早餐，可搭配各种咸味配料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a thick rice porridge (often eaten for breakfast), usually served plain or with savory toppings like meat, fish, eggs, or pickles","zh":"（常作早餐的）稠米粥/稀饭，常配肉、鱼、蛋、腌菜等咸味配料一起吃"},"examples":[{"en":"I usually eat congee when I want something warm and easy to digest.","zh":"我想吃点暖和、好消化的东西时，通常会喝粥。"},{"en":"The restaurant serves congee with chicken and ginger.","zh":"这家餐厅的粥会配鸡肉和姜。"}]}],"synonyms":["rice porridge","jook"],"phonetic":"/ˈkɑndʒi/","extraExplanation":["你输入的“congii”在英语里不常见，最可能是拼写想写 **congee**（米粥）。在不同地区也常见写法/称呼：粤语常说 **jook**，闽南/台湾语境常见“稀饭”，普通话常说“粥”。","词源上，congee 来自葡萄牙语 *canja*（意为米粥/鸡粥），与亚洲多地饮食交流有关。"]}
{"word":"congius","summary":{"en":"Congius is a rare historical word meaning an ancient Roman unit for measuring liquids.","zh":"Congius 是一个较罕见的历史词，指古罗马用于计量液体的容量单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a unit of liquid measure in ancient Rome (about 3.3–3.5 liters, roughly 0.9 US gallons).","zh":"（古罗马）液体容量单位（约3.3–3.5升，约0.9美制加仑）。"},"examples":[{"en":"In ancient Rome, a congius was used to measure wine and other liquids.","zh":"在古罗马，congius 常用来计量葡萄酒等液体。"},{"en":"The inscription mentions a congius, showing the container’s standard size.","zh":"铭文中提到 congius，说明这个容器有标准容量。"}]}],"synonyms":["(no common modern synonym; roughly) liter","gallon (approx.)"],"phonetic":"/ˈkɑːndʒiəs/","extraExplanation":["这个词在现代英语里非常罕见，多见于历史、考古、古典学（Latin/Roman studies）或博物馆说明文字中。","congius 源自拉丁语，是罗马计量体系的一部分；不同资料会给出略有差异的现代换算值（大约3.3到3.5升），因为古代标准在不同时期/地区可能不完全一致。","如果你本来想查的是常见英语单词，可能是拼写有误；你可以告诉我上下文句子，我也可以帮你确认是否想表达 “conscious / congenial / congeal”等。"]}
{"word":"conglaciate","summary":{"en":"“Conglaciate” means to freeze or turn into ice (or to cause something to do so). It is rare and more formal than “freeze.”","zh":"“Conglaciate”表示“冻结、结成冰（或使之结冰）”。它很少见，语气比 freeze 更正式/书面。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Intransitive) To freeze or become solid, especially by turning into ice; to congeal.","zh":"（不及物）冻结、凝固；尤指结成冰。"},"examples":[{"en":"As temperatures fell overnight, the slush began to conglaciate into a thin sheet of ice.","zh":"夜里气温下降后，雪泥开始冻结成一层薄冰。"},{"en":"Moisture on the rocks can conglaciate quickly in strong wind.","zh":"岩石上的水汽在强风中会很快凝结成冰。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Transitive) To freeze (something) or cause it to congeal into ice.","zh":"（及物）使（某物）冻结；使凝结成冰。"},"examples":[{"en":"A sudden cold snap conglaciated the puddles across the path.","zh":"一阵突然的寒潮使小路上的水坑都结了冰。"},{"en":"The high-altitude air can conglaciate wet clothing within minutes.","zh":"高海拔的空气能在几分钟内把湿衣服冻硬。"}]}],"synonyms":["freeze","congeal","ice over","solidify"],"phonetic":"/kənˈɡleɪʃiˌeɪt/","extraExplanation":["这是一个非常少见、偏文学或科学写作风格的词，日常英语里更常用 freeze（冻结）或 congeal（凝固）。","词根来自拉丁语 glacies（冰），所以它带有“变成冰/形成冰”的感觉；在地质、气候或描写寒冷环境的文字中更可能出现。"]}
{"word":"conglobate","summary":{"en":"Conglobate means to form or gather into a rounded mass; it can also describe something that is clustered into a ball-like shape.","zh":"conglobate 指“聚成团/卷成球状”，也可形容“团状聚集的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to gather, roll, or form into a rounded mass (like a ball); to clump together","zh":"把……聚成团；卷成球状；使凝结成一团"},"examples":[{"en":"Dust and fibers can conglobate into small balls under a sofa.","zh":"灰尘和纤维会在沙发底下凝结成小团。"},{"en":"Over time, the wet sand conglobated into lumps that were easy to pick up.","zh":"时间久了，湿沙会聚成容易捡起的块状。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of things) gathered into a rounded mass; clustered together","zh":"（事物）聚成团的；球状聚集的"},"examples":[{"en":"The microscope showed conglobate clusters of cells.","zh":"显微镜显示细胞呈团状聚集。"}]}],"synonyms":["clump","cluster","gather","coalesce","agglomerate"],"phonetic":"/kənˈɡloʊbeɪt/","extraExplanation":["“conglobate”比较少见，更常见的表达是“clump together / form a ball / cluster”。它来自拉丁语 conglobare（con- ‘一起’ + globus ‘球’），字面意思是“聚成球”。在科学写作（如生物、医学、材料学）里偶尔会用来描述“团簇/聚集成团”的形态。"]}
{"word":"conglobated","summary":{"en":"“Conglobated” is a rare word meaning “clustered or formed into a rounded mass,” or it can be the past form of “conglobate.”","zh":"“conglobated”较罕见，意思是“聚成团/凝成球状”，也可作动词“conglobate”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Formed into a rounded mass; clustered together like a ball or lump.","zh":"（罕见）聚成团的；凝成球状或一团的。"},"examples":[{"en":"Dark clouds conglobated above the hills, promising rain.","zh":"乌云在山丘上空聚成一团，预示着要下雨。"},{"en":"Dust had conglobated in the corner of the room.","zh":"灰尘在房间角落里结成了一团。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense / past participle of “conglobate”: to gather or form into a rounded mass; to cluster.","zh":"“conglobate”的过去式/过去分词：使聚成团；（使）凝成球状；聚集。"},"examples":[{"en":"Moisture conglobated the fine powder into small lumps.","zh":"水分使细粉末凝结成一个个小团块。"},{"en":"Over time, the small groups conglobated into a single movement.","zh":"随着时间推移，这些小团体逐渐聚合成一个统一的运动。"}]}],"synonyms":["clumped","clustered","lumped","gathered","coalesced"],"phonetic":"/kənˈɡlɑː.beɪ.tɪd/","extraExplanation":["这个词在现代英语里非常少见，更常见的表达是 clumped (结块的/成团的)、clustered (聚集的)、gathered (聚拢的)。","词源来自拉丁语 con-（一起）+ globus（球、圆团），字面意思就是“聚成球/团”。在文学或较旧的科学写作中偶尔能见到。"]}
{"word":"conglobately","summary":{"en":"Conglobately means “in a clustered or ball-like way,” but it’s rare in modern English.","zh":"conglobately 意为“呈团聚/球状聚集地”，但在现代英语中很少用。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a rounded, ball-like, or clustered way; gathered into a compact mass.","zh":"以（球状）团聚的方式；聚成一团、聚合成紧密的一团。"},"examples":[{"en":"The dust collected conglobately in the corners of the room.","zh":"灰尘在房间角落里呈团状聚集。"},{"en":"Cells may grow conglobately, forming a small lump.","zh":"细胞可能会呈团块状生长，形成一个小结节。"}]}],"synonyms":["in clusters","in a lump","compactly","closely","in a ball"],"phonetic":"/kənˈɡlɑːbətli/","extraExplanation":["这个词非常少见，更多时候会用更常见的表达来替代，例如：in clusters（成簇地）、in a lump（成团地）、in a ball（成球状地）、compactly（紧密地）。","词根来自拉丁语 con-（共同、一起）+ globus（球、团），相关词有 conglobate（使聚成团/球状；团块状的）与 globular（球状的）。","在现代英语里，它偶尔出现在医学或生物学语境中，用来描述“团块/结节样”聚集的形态（如 conglobate acne 常译为“聚合性痤疮”）。"]}
{"word":"conglobating","summary":{"en":"“Conglobating” means forming or gathering into a rounded mass (clumping into a ball-like shape).","zh":"“Conglobating”表示“聚成一团/凝成球状或团块状”，常用于较正式或科学语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"forming or gathering into a rounded mass; rolling or grouping things into a ball-like shape","zh":"使（或正在）聚成一团；凝结成球状（或团块状）"},"examples":[{"en":"Dust was conglobating in the corners of the room.","zh":"灰尘正在房间的角落里聚成一团。"},{"en":"As the syrup cooled, it began conglobating into thick lumps.","zh":"糖浆冷却后开始凝成一块块黏稠的团块。"}]},{"partOfSpeech":"adj.","definition":{"en":"clustered or rounded into a mass; ball-shaped (describing a group or shape)","zh":"成团的；球状的（用来描述聚集或外形）"},"examples":[{"en":"They found conglobating clouds on the horizon, signaling a storm.","zh":"他们看到地平线处云层成团聚集，预示着暴风雨。"}]}],"synonyms":["clumping","coalescing","clustering","agglomerating"],"phonetic":"/kənˈɡloʊbeɪtɪŋ/","extraExplanation":["“conglobating”来自动词 conglobate（con- 表“共同/一起” + glob “球/团块”）。在现代英语里它比较少见，更常用的表达是 “clumping together / forming into a ball / gathering into a mass”。","在科学或较正式的写作中，它可能用来描述颗粒、细胞或物质“凝聚成团”的过程。日常口语中一般不用这个词。"]}
{"word":"conglobation","summary":{"en":"Conglobation means gathering into a mass/ball, or (in rhetoric) piling up points for emphasis.","zh":"Conglobation 指“聚成一团/一球”，也可指（修辞）“把论据集中堆叠以强调”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of gathering things together into a rounded mass or ball; clumping into a single whole","zh":"把事物聚拢成团、成球或成一团块的过程；凝聚成整体"},"examples":[{"en":"Dust and hair can form a conglobation under the bed.","zh":"灰尘和头发可能会在床底下聚成一团。"},{"en":"The report described the conglobation of cells into a small lump.","zh":"报告描述了细胞聚集成一个小肿块（小团块）。"}]},{"partOfSpeech":"n.","definition":{"en":"(rhetoric) the piling up or grouping of arguments, examples, or descriptions for emphasis; an accumulation","zh":"（修辞）为加强语气而把论点、例子或描述层层堆叠、集中罗列；累积"},"examples":[{"en":"The speaker used conglobation, listing problem after problem to build urgency.","zh":"演讲者用了“层层堆叠”的方式，一个问题接一个问题地列出，营造紧迫感。"},{"en":"In persuasive writing, conglobation can make a point feel overwhelming.","zh":"在说服性写作中，这种“集中罗列”能让观点显得更有压迫感、更难反驳。"}]}],"synonyms":["clumping","clustering","gathering","aggregation","accumulation"],"phonetic":"/ˌkɑŋɡləˈbeɪʃən/","extraExplanation":["词源提示：来自拉丁语 con-（一起）+ globus（球、团）。因此它的核心画面感就是“聚成一个球/一团”。","这是一个较少见、偏书面/学术的词。在一般日常英语里，更常用 clump, cluster, gather, lump, accumulation 等表达相近意思。","修辞义（把论据“堆起来”）在现代英语写作课或修辞学语境中更可能见到。"]}
{"word":"conglobe","summary":{"en":"“Conglobe” means to gather into one mass or form into a ball/globe; it’s rare and literary.","zh":"“Conglobe”表示“聚合成一体、聚成球/团”，较罕见且偏书面/文学用法。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to gather or combine things into a single mass; to form into a ball or globe (often used in a scientific or literary style)","zh":"把事物聚合成一体；使聚成球状/团状（常见于科学或文学语境，较少用）"},"examples":[{"en":"Dust and ice can conglobe in space and gradually become a small planet.","zh":"尘埃和冰在太空中可能会聚合，逐渐形成一颗小行星。"},{"en":"In the cold, the melted wax began to conglobe into a smooth lump.","zh":"在低温下，融化的蜡开始凝结聚成一个光滑的蜡团。"}]}],"synonyms":["coalesce","clump","cluster","aggregate","consolidate","gather"],"phonetic":"/kənˈɡloʊb/","extraExplanation":["“Conglobe”非常罕见，带有书面/古典色彩，来源于 con-（共同、聚合）+ globe（球体）。现代英语更常用的表达是 “gather together / clump together / form into a ball / coalesce”。"]}
{"word":"conglobed","summary":{"en":"Conglobed means gathered into a rounded mass or tightly clustered together (a literary word).","zh":"conglobed 指“聚成一团/球状”的（偏文学用语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Literary) Gathered or formed into a rounded mass; clustered together like a ball.","zh":"（文学用语）聚成一团的；形成球状/团块的；紧密聚集的。"},"examples":[{"en":"Mist hung over the river in conglobed patches.","zh":"雾气在河面上成团成片地凝结着。"},{"en":"The bees formed a conglobed cluster around the queen.","zh":"蜜蜂围着蜂王聚成一团。"},{"en":"At the top of the hill, clouds looked conglobed and heavy.","zh":"在山顶，云看起来团团堆积，沉沉压着。"}]}],"synonyms":["clustered","clumped","massive","bunched (up)","rounded","globular"],"phonetic":"/kənˈɡloʊbd/","extraExplanation":["“conglobed”比较少见，多见于文学或较正式的描写；它是动词“conglobe”（使成球状、使聚成一团）的过去分词作形容词使用。","词根与“globe（地球；球体）”同源，来自拉丁语 globus（球、团）。用它可以强调“像球一样聚拢成块”的视觉感。"]}
{"word":"conglobes","summary":{"en":"Conglobe means to form or gather into a round mass; it can also mean a round mass itself (rare).","zh":"Conglobe 指（使）聚成球状/团块；也可指球状团块本身（较少见）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to gather or form into a round mass; to make something into a ball or globe (often used in literary or scientific writing).","zh":"（使）聚成一团；（使）形成球状/团块（多见于文学或较旧的科学文体）。"},"examples":[{"en":"Clouds conglobed into a dark mass over the hills.","zh":"云层在山丘上方聚成一大片乌云。"},{"en":"The dust conglobed into small clumps after the rain.","zh":"下雨后，灰尘结成了小团块。"},{"en":"Heat can make droplets conglobe into larger beads.","zh":"热量会使小液滴聚合成更大的水珠。"}]},{"partOfSpeech":"n.","definition":{"en":"a round mass or cluster; something shaped like a ball (rare).","zh":"球状团块；圆形聚集体（少见）。"},"examples":[{"en":"A conglobe of mist sat low on the water.","zh":"一团雾气低低地停在水面上。"},{"en":"They watched a conglobe of insects swirl under the lamp.","zh":"他们看着灯下聚成一团的昆虫盘旋。"}]}],"synonyms":["clump","cluster","mass","gather","coalesce","glomerate"],"phonetic":"/kənˈɡloʊb/","extraExplanation":["“conglobes”通常是动词第三人称单数（He/She/It conglobes...）或名词复数（conglobes）。更常见的现代替换说法有：gather into a ball, clump together, form a mass。","词源上可理解为 con-（一起）+ globe（球体），因此核心画面就是“聚到一起变成球/团”。"]}
{"word":"conglobing","summary":{"en":"“Conglobing” means clumping or gathering into a round mass (a rare, formal word).","zh":"“conglobing”指“聚成球状/结成团块”，是较罕用、偏正式的说法。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(rare) Forming into a round mass; gathering or clumping together into a ball-like shape.","zh":"（罕用）把……聚成球状；使……结成团块。"},"examples":[{"en":"The dust was conglobing into small balls under the damp air.","zh":"在潮湿的空气里，灰尘正在结成一个个小团球。"},{"en":"Heat can make fat conglobing on the surface of the soup.","zh":"加热会让油脂在汤面上凝结成团。"}]}],"synonyms":["clumping","coalescing","congealing","gathering","lumping together"],"phonetic":"/kənˈɡloʊbɪŋ/","extraExplanation":["“conglobing”通常是动词“conglobe”的现在分词/动名词形式，但这个词在现代英语里非常少见，多见于较旧或较书面的描写（尤其是医学/生物/化学里描述“凝结成团”）。","更常见、更自然的表达包括：clumping together（结块）、coalescing（聚合/合并）、forming into a ball（形成球状）、congealing（凝固成块）。"]}
{"word":"conglobulate","summary":{"en":"“Conglobulate” means to gather into a compact, rounded mass or to clump together (formal/rare).","zh":"“conglobulate”指“聚成紧密的团块/球状”，较正式且少见。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to gather or form into a compact round mass; to clump together","zh":"聚成一团；凝结成球状（或紧密的一团）"},"examples":[{"en":"Dust can conglobulate into little balls when it mixes with moisture.","zh":"灰尘和湿气混在一起时，可能会凝成一个个小团。"},{"en":"After the storm, seaweed conglobulated along the shoreline.","zh":"暴风雨过后，海藻在海岸线上聚成一堆堆。"}]}],"synonyms":["clump (together)","cluster","gather","coalesce","aggregate"],"phonetic":"/kənˈɡlɑːbjəˌleɪt/","extraExplanation":["“conglobulate”较为罕见、偏书面或科学语境。日常英语更常用：clump (together)、cluster、gather (into a ball/mass)。","词源来自拉丁语：con-（一起）+ globus（球、团）。因此它常带有“变成球状/团块状”的画面感。"]}
{"word":"conglomerate","summary":{"en":"“Conglomerate” most often means a large business group owning many companies in different industries; it can also mean a mixed collection or the act of combining into one whole.","zh":"“Conglomerate”最常指跨行业拥有多家公司的大型企业集团；也可指由不同部分组成的混合体，或表示把不同事物合并成整体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large company made up of many smaller companies in different industries, usually owned and controlled as one group.","zh":"（由多家不同行业的公司组成、通常由同一集团控制的）企业集团；联合企业"},"examples":[{"en":"The conglomerate owns businesses in banking, media, and food production.","zh":"这家企业集团在银行、媒体和食品生产等领域都有业务。"},{"en":"After the merger, the brand became part of a global conglomerate.","zh":"合并后，这个品牌成了某个全球性企业集团的一部分。"}]},{"partOfSpeech":"v.","definition":{"en":"To bring together different things—often companies or parts—into one larger whole.","zh":"使（不同事物，尤指公司或业务）联合成一体；合并成更大的整体"},"examples":[{"en":"Several small firms conglomerated to compete with bigger rivals.","zh":"几家小公司联合起来，以便与更大的竞争对手抗衡。"},{"en":"The company conglomerated its regional offices into one headquarters.","zh":"公司把各地办事处整合到一个总部里。"}]},{"partOfSpeech":"n.","definition":{"en":"A thing made of many different parts stuck or packed together; a mixture.","zh":"（由多种不同部分黏结或聚合而成的）混合物；聚合体"},"examples":[{"en":"The report was a conglomerate of notes, charts, and personal opinions.","zh":"这份报告是笔记、图表和个人观点拼在一起的混合体。"},{"en":"The museum described the style as a conglomerate of influences.","zh":"博物馆称这种风格是多种影响的聚合体。"}]}],"synonyms":["group","corporation","holding company","combine","merge","amalgamate","mixture"],"phonetic":"/kənˈɡlɑːməɹət/","extraExplanation":["词源提示：con- 表示“共同”，-glomer- 来自拉丁语 glomus（“线团、团块”）。所以它的核心感觉是“把许多东西聚成一团”。","用法区分：在商业语境中，conglomerate（企业集团）通常指跨行业、多元化经营的公司集团；如果是同一行业内整合并扩张，更常用 group 或 corporation，或在反垄断语境中讨论 merger / acquisition（并购）。"]}
{"word":"conglomerated","summary":{"en":"“Conglomerated” means combined or merged into a single whole; it can also describe conglomerate rock in geology.","zh":"“conglomerated”表示“合并/整合成整体的”；在地质中也可指“由砾石胶结成的砾岩”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) Formed by combining many different parts, things, or groups into one whole; mixed together.","zh":"（形容词）由许多不同部分、事物或群体合并而成的；混合在一起的。"},"examples":[{"en":"The company is a conglomerated business with interests in media, finance, and retail.","zh":"这家公司是一家综合性企业，业务涵盖媒体、金融和零售。"},{"en":"After the merger, two separate teams became a single conglomerated department.","zh":"合并之后，两个独立团队变成了一个整合后的部门。"}]},{"partOfSpeech":"v.","definition":{"en":"(v.) Past tense/past participle of “conglomerate”: to bring together into a single mass or group; to merge.","zh":"（动词）“conglomerate”的过去式/过去分词：把……聚合成一体；合并。"},"examples":[{"en":"Several small firms conglomerated into one larger organization.","zh":"几家小公司合并成了一家更大的机构。"},{"en":"Data from multiple sources was conglomerated into one report for the meeting.","zh":"来自多个来源的数据被汇总成一份报告，用于会议。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adj., geology) Made of rounded stones or gravel naturally cemented together (conglomerate rock).","zh":"（形容词，地质）由圆砾或碎石自然胶结而成的（砾岩）。"},"examples":[{"en":"The cliff is made of conglomerated rock, with pebbles visible in the surface.","zh":"这段悬崖由砾岩构成，表面能看到许多小卵石。"}]}],"synonyms":["combined","merged","integrated","amalgamated","consolidated"],"phonetic":"/kənˈɡlɑməˌreɪtɪd/","extraExplanation":["词源提示：conglomerate 来自拉丁语 con-（一起）+ glomerare（团成一团），与 glomerulus（肾小球）同源，都有“聚成团”的意象。","用法提示：conglomerated 常见于商务/学术语境，表示“并入、整合后的”。日常口语里更常用 combined / merged / mixed。"]}
{"word":"conglomerates","summary":{"en":"“Conglomerates” most often means large diversified business groups; it can also mean certain mixed-stone rocks, and it can be the verb form meaning “combines into a group.”","zh":"“Conglomerates”最常指多元化经营的大型企业集团；也可指地质上的砾岩；还可作动词形式，表示“合并/整合成集团”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Large companies formed by combining many different businesses; large business groups that operate in several unrelated industries.","zh":"由许多不同业务合并而成的巨型公司；跨多个（常常不相关）行业经营的大型企业集团。"},"examples":[{"en":"Many media conglomerates also own film studios, TV networks, and publishing companies.","zh":"许多媒体集团同时拥有电影制片厂、电视台和出版社。"},{"en":"The government investigated whether the conglomerates had too much market power.","zh":"政府调查这些大型企业集团是否拥有过大的市场力量。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular form of “conglomerate”: to combine different companies or parts into one large group.","zh":"“conglomerate”的第三人称单数：把不同公司或部门合并成一个大型集团。"},"examples":[{"en":"The firm conglomerates its smaller brands under one umbrella name.","zh":"这家公司把较小的品牌整合到同一个母品牌之下。"},{"en":"When an industry conglomerates, a few big players may dominate the market.","zh":"当一个行业发生集团化整合时，少数巨头可能主导市场。"}]},{"partOfSpeech":"n.","definition":{"en":"In geology, rocks made of many rounded stones (pebbles) naturally cemented together.","zh":"【地质】由许多圆磨砾石自然胶结在一起形成的砾岩。"},"examples":[{"en":"The cliff layer contains conglomerates formed by ancient river deposits.","zh":"这处悬崖的岩层含有由古代河流沉积形成的砾岩。"}]}],"synonyms":["corporate groups","multinationals","holding companies","big business","combine"],"phonetic":"/kənˈɡlɑməreɪts/","extraExplanation":["在商业语境里，conglomerate 常带有“多元化经营”的意味：集团可能同时做食品、金融、房地产等彼此不太相关的行业，用来分散风险或扩大规模。","词源上来自拉丁语 con-（一起）+ glomerare（聚成团），核心感觉是“把许多东西聚拢成一团/一体”。"]}
{"word":"conglomeratic","summary":{"en":"Conlomeratic is a rare adjective, mainly used in geology, meaning “related to or resembling conglomerate rock,” and more loosely “mixed from many parts.”","zh":"conglomeratic 是个较罕见的形容词，主要用于地质学，表示“与砾岩有关/类似砾岩的”，引申可指“杂糅拼凑的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare; geology) Made of, relating to, or resembling a conglomerate (a rock made of rounded pebbles cemented together).","zh":"（罕见；地质）由砾岩构成的；与砾岩有关的；类似砾岩的（砾石被胶结在一起形成的岩石）。"},"examples":[{"en":"The cliff shows a conglomeratic layer filled with rounded stones.","zh":"这处悬崖露出一层砾岩性岩层，里面充满圆润的卵石。"},{"en":"Geologists mapped conglomeratic deposits along the ancient river channel.","zh":"地质学家沿着古河道绘制了砾岩性沉积物的分布图。"}]},{"partOfSpeech":"adj.","definition":{"en":"(uncommon; figurative) Mixed together in a rough, “lumpy” way; made from many different parts.","zh":"（不常用；引申）杂糅的、混合拼凑的；由许多不同部分组成但不够统一的。"},"examples":[{"en":"The museum’s early collection felt conglomeratic—interesting but not well organized.","zh":"这家博物馆的早期馆藏给人一种杂糅感——很有趣，但组织得不够清晰。"}]}],"synonyms":["conglomerate","pebbly (geology)","composite","mixed","heterogeneous"],"phonetic":"/kənˌɡlɑməˈrætɪk/","extraExplanation":["“conglomeratic”在日常英语里非常少见，更多出现在地质学写作中。一般写作中更常用的是“conglomerate”（名词：砾岩/企业集团；形容词：混合的）。","如果你想表达“企业集团的”，英语里通常说“conglomerate company / conglomerate group”，或用“conglomerate”（作形容词）；而不是“conglomeratic”。"]}
{"word":"conglomerating","summary":{"en":"“Conglomerating” means combining separate things—ideas, data, groups, or companies—into one larger whole.","zh":"“Conglomerating”表示把分散的事物（想法、数据、群体或公司）合并成一个更大的整体。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"combining different things into one larger group, mass, or whole","zh":"把不同的事物合并成一个更大的整体、集合或团块"},"examples":[{"en":"The report is conglomerating data from several hospitals into one national database.","zh":"这份报告正在把几家医院的数据汇总到一个全国数据库中。"},{"en":"Over time, small communities began conglomerating into a single city.","zh":"随着时间推移，小社区逐渐合并成一座城市。"}]},{"partOfSpeech":"v.","definition":{"en":"(business) joining or buying different companies so they operate under one corporate group","zh":"（商业）把不同公司合并或收购，组成同一个企业集团"},"examples":[{"en":"The firm is conglomerating several brands to reduce costs and share resources.","zh":"这家公司正在把几个品牌整合到同一集团，以降低成本并共享资源。"},{"en":"After conglomerating with a competitor, the company expanded into new markets.","zh":"与竞争对手合并后，公司进入了新市场。"}]}],"synonyms":["combining","merging","consolidating","aggregating","amalgamating"],"phonetic":"/kənˈɡlɑːməˌreɪtɪŋ/","extraExplanation":["“conglomerating”是动词“conglomerate”的现在分词/动名词形式。它既可以指一般意义上的“聚合、合并”，也常用于商业语境，指“组成/形成企业集团（conglomerate）”。","词源上与拉丁语 con-（一起）+ glomus（团、球）有关，核心画面感是“把许多东西聚成一团/一块”。"]}
{"word":"conglomeration","summary":{"en":"Conglomeration means a mixed group of different things, or a large corporate group made from several companies.","zh":"conglomeration 指不同事物杂糅而成的整体，也可指由多家公司组成（常跨行业）的企业集团。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group of different things (or people) brought together into one whole, often in a mixed or not very organized way","zh":"由不同事物（或人）混合聚在一起形成的整体，常带有“杂糅、拼合”的感觉"},"examples":[{"en":"The city is a conglomeration of cultures, languages, and food traditions.","zh":"这座城市是多元文化、语言和饮食传统的汇合体。"},{"en":"His desk was a conglomeration of books, cables, and half-finished notes.","zh":"他的桌子上杂乱地堆着书、本线和写到一半的笔记。"}]},{"partOfSpeech":"n.","definition":{"en":"a large business formed by joining together several different companies, often in different industries","zh":"由多家（常跨行业的）公司合并或组成的大型企业集团"},"examples":[{"en":"The media conglomeration owns TV stations, newspapers, and streaming services.","zh":"这家媒体集团拥有电视台、报纸和流媒体服务。"},{"en":"After the merger, the conglomeration expanded into finance and health care.","zh":"合并后，这个企业集团扩展到了金融和医疗领域。"}]}],"synonyms":["collection","mixture","assemblage","aggregation","business conglomerate"],"phonetic":"/kənˌɡlɑːməˈreɪʃən/","extraExplanation":["词源提示：con- 表示“共同、一起”，glom-/glomer- 与“团块、球团”有关，-ation 表示“过程/结果”。整体给人一种“把不同东西团在一起”的画面。","用法对比：conglomeration 常强调“混杂地聚合”；collection 更中性（收藏/集合）；combination 强调“组合方式”；mixture 强调“混合后的成分”。商业语境里，常见同义表达是 business conglomerate（企业集团）。","文学/报道中常用于强调现代社会的“多元拼贴感”或“大公司跨行业扩张”的现象，语气可中性也可略带批评（暗示过度集中或杂糅）。"]}
{"word":"conglomerations","summary":{"en":"“Conglomerations” means mixed groups or masses formed by combining different parts, or large business groups made from many companies.","zh":"“conglomerations”指由不同成分组合而成的聚合体/混合体，也可指由多家公司组成的大型企业集团。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Groups of different things gathered or stuck together into a larger whole.","zh":"由不同事物聚集、黏合或组合在一起形成的整体；混合聚合体。"},"examples":[{"en":"The beach was covered with conglomerations of shells, seaweed, and driftwood after the storm.","zh":"暴风雨过后，海滩上满是贝壳、海藻和漂流木的混合堆积物。"},{"en":"In the museum, the artist displayed conglomerations of metal scraps and glass.","zh":"在博物馆里，这位艺术家展出了金属碎片与玻璃组合而成的聚合物。"}]},{"partOfSpeech":"n.","definition":{"en":"Large companies formed by joining together many smaller companies, often in different industries.","zh":"由多家（常跨行业的）公司合并组成的大型企业集团。"},"examples":[{"en":"Several media conglomerations control many TV channels and news sites.","zh":"一些媒体企业集团掌控着许多电视频道和新闻网站。"},{"en":"As conglomerations grow, they may face more government regulation.","zh":"当企业集团扩大时，可能会面临更多政府监管。"}]}],"synonyms":["clusters","collections","assemblages","mixtures","corporate groups","conglomerates"],"phonetic":"/kənˌɡlɑːməˈreɪʃənz/","extraExplanation":["“conglomerations”是复数形式，单数是“conglomeration”。","在地质学里，conglomeration也可指“砾岩/砾质岩”（由圆砾等被胶结在一起形成的岩石），属于更专门的用法。"]}
{"word":"conglomerative","summary":{"en":"Conglomerative means “formed by combining many different parts into one whole,” and it can also describe conglomerate rock in geology.","zh":"Conglomerative 指“由许多不同部分聚合而成的”；在地质语境中也可指“砾岩（由砾石胶结而成）的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made up of many different parts or elements that are joined together; formed by combining things into a whole.","zh":"由许多不同部分或要素结合而成的；通过聚合、合并形成整体的。"},"examples":[{"en":"The report gives a conglomerative picture of public opinion by combining several surveys.","zh":"这份报告把多项调查合并起来，呈现出公众意见的综合图景。"},{"en":"Her essay takes a conglomerative approach, mixing history, interviews, and personal stories.","zh":"她的文章采用一种综合式写法，把历史、访谈和个人故事混合在一起。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Geology) Related to a conglomerate rock, made of rounded pebbles or fragments cemented together.","zh":"（地质）与砾岩有关的；由圆磨砾石或碎屑胶结在一起形成的。"},"examples":[{"en":"The cliffs contain conglomerative layers with visible pebbles embedded in the rock.","zh":"这些峭壁中有砾岩层，能看到岩石里嵌着的砾石。"}]}],"synonyms":["composite","combined","mixed","heterogeneous","aggregated"],"phonetic":"/kənˈɡlɑːmɚˌeɪtɪv/","extraExplanation":["“conglomerative”来自“conglomerate（聚合体/联合企业/砾岩）”，核心意思是“聚合在一起”。在日常英语里它相对少见，人们更常用“composite（复合的）”“mixed（混合的）”“combined（结合的）”。在学术写作中偶尔用来强调“由不同来源汇聚而成”的特征。"]}
{"word":"conglomerator","summary":{"en":"A rare noun meaning someone or something that combines separate parts into a larger whole.","zh":"一个较少见的名词，指把不同部分合并成更大整体的人或物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person, company, or thing that conglomerates—combines different parts, businesses, or materials into one larger whole","zh":"把不同部分、企业或材料“合并成一体”的人、公司或装置；聚合者、并合者"},"examples":[{"en":"The startup acted as a conglomerator, buying small apps and merging them into one platform.","zh":"这家初创公司像个“并购整合者”，收购小型应用并把它们合并到一个平台上。"},{"en":"In the report, the parent company is described as the conglomerator behind several unrelated brands.","zh":"报告中把母公司描述为多个不相关品牌背后的“集团整合者”。"}]}],"synonyms":["aggregator","consolidator","combiner","merger (company)","acquirer"],"phonetic":"/kənˈɡlɑːməˌreɪtər/","extraExplanation":["“conglomerator”在现代英语里比较少见，更常用的是动词/名词“conglomerate”（合并；企业集团）或名词“conglomerate company / conglomerate”（企业集团）。在正式写作中，很多场景用“acquirer”（收购方）、“aggregator”（聚合平台/整合者）、“consolidator”（整合者、并表者）会更自然。"]}
{"word":"conglomeritic","summary":{"en":"“Conglomeritic” is a geology adjective meaning “related to or resembling conglomerate rock.”","zh":"“Conglomeritic”是一个地质学形容词，意思是“与砾岩有关的；类似砾岩的；砾岩性的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Geology) Made of, resembling, or relating to conglomerate rock (a sedimentary rock with rounded pebbles or gravel cemented together).","zh":"（地质）由砾岩构成的；类似砾岩的；与砾岩有关的（砾岩是一种由圆磨砾石/卵石被胶结在一起形成的沉积岩）。"},"examples":[{"en":"The river terrace exposes a conglomeritic layer with rounded pebbles.","zh":"河流阶地露出一层砾岩状地层，里面有圆磨的卵石。"},{"en":"Conglomeritic deposits often indicate high-energy water flow, such as fast rivers.","zh":"砾岩性沉积物常常表明水动力较强，比如湍急的河流环境。"}]}],"synonyms":["conglomerate (adj.)","pebbly","gravelly"],"phonetic":"/kənˌɡlɑːməˈrɪtɪk/","extraExplanation":["“Conglomeritic”是地质学术语，日常英语里很少用。它通常用来修饰rock/layer/bed/deposit/sediment（岩石/地层/层/沉积物/沉积物质），强调其颗粒较粗、含砾成分多、外观或成因接近“conglomerate（砾岩）”。","常见对比：conglomeritic（砾岩性的，含砾或类似砾岩）≠ conglomerate（名词：砾岩；也可作形容词表示“砾岩的/聚合的”）。在论文或地质报告中，“conglomeritic sandstone（砾岩质砂岩）”表示砂岩里夹杂较多砾石。"]}
{"word":"conglutin","summary":{"en":"Conglutin is a technical noun meaning a type of protein found especially in lupin seeds.","zh":"Conglutin 是一个专业名词，指主要存在于羽扇豆种子中的一种蛋白质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of seed storage protein found especially in lupin (lupine) seeds; often discussed in nutrition and food science.","zh":"一种种子贮藏蛋白，常见于羽扇豆（鲁冰花属、lupin/lupine）种子中；多见于营养学与食品科学语境。"},"examples":[{"en":"Some studies look at lupin conglutin to understand how it affects blood sugar after meals.","zh":"一些研究会关注羽扇豆的 conglutin，以了解它对餐后血糖的影响。"},{"en":"The product label mentions lupin protein; in research papers, you may see specific names like conglutin.","zh":"产品标签可能写“羽扇豆蛋白”；而在论文里，你可能会看到更具体的名称，比如 conglutin。"}]}],"synonyms":["lupin protein","seed storage protein"],"phonetic":"/kənˈɡluːtɪn/","extraExplanation":["conglutin 不是日常英语词汇，主要出现在生物化学、营养学、食品科学文献中，常与“lupin/羽扇豆蛋白”“过敏原（allergen）”“功能性蛋白”等话题一起出现。","词源上与拉丁语中表示“黏合/胶合”的词根有关（与 coagulate 等词在“凝聚/结块”的意象上相近），但在现代用法里它更多是一个专门的蛋白名称。"]}
{"word":"conglutinant","summary":{"en":"Conglutinant means “glue-like” (adj.) or “an adhesive substance” (n.).","zh":"conglutinant 指“具有黏合作用的”（形容词）或“黏合剂/黏着物”（名词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) Causing things to stick together; acting like a glue or adhesive.","zh":"（形容词）使物体黏合在一起的；起“胶水/黏着剂”作用的。"},"examples":[{"en":"The conglutinant resin helped the broken pieces hold together.","zh":"这种具有黏合作用的树脂帮助断裂的碎片粘在一起。"},{"en":"In the lab, a conglutinant agent was added to bind the particles.","zh":"在实验室里加入了一种黏合剂来把颗粒结合起来。"}]},{"partOfSpeech":"n.","definition":{"en":"(n.) A substance that makes materials stick together; an adhesive.","zh":"（名词）黏合物；黏着剂；胶黏剂。"},"examples":[{"en":"They used a natural conglutinant made from plant sap.","zh":"他们使用了一种由植物汁液制成的天然黏合剂。"},{"en":"Early bookbinders sometimes relied on animal-based conglutinants.","zh":"早期装订工有时会依赖动物性黏合剂。"}]}],"synonyms":["adhesive","glue-like","binding","cementing","binder"],"phonetic":"/kənˈɡluːtənənt/","extraExplanation":["这个词比较少见，多见于较正式或专业语境（如生物学、材料、古籍装订等）。日常英语里更常用 adhesive / glue / binder。","词源来自拉丁语 conglutinare（使黏合），与 glutin-（胶、黏性）有关，也能帮助你理解 gluten（麸质）这个词同样源自“黏”。"]}
{"word":"conglutinate","summary":{"en":"Conglutinate means to stick together (or make things stick together) into a single mass, often used in scientific or medical contexts.","zh":"Conglutinate 指（自身）黏合/凝结成一团，或使某物黏合成一体，常用于医学或科学语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of a material or tissue) to stick together into a mass; to glue or clump together.","zh":"（材料或组织）黏合成一团；凝结、结块。"},"examples":[{"en":"The damp powder began to conglutinate in the jar.","zh":"这份潮湿的粉末在罐子里开始结块。"},{"en":"After the inflammation, the tissues may conglutinate and form adhesions.","zh":"发炎后，组织可能会黏连并形成粘连。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cause something to stick together; to cement or bind into one mass.","zh":"使……黏合在一起；把……胶合/粘成一体。"},"examples":[{"en":"Heat can conglutinate small particles into larger lumps.","zh":"加热会使小颗粒黏合成更大的块状物。"},{"en":"The paste conglutinated the fibers, making the surface tougher.","zh":"糊状物把纤维黏合在一起，使表面更结实。"}]}],"synonyms":["adhere","clump","coagulate","agglutinate","cement"],"phonetic":"/kənˈɡluːtənˌeɪt/","extraExplanation":["这个词在日常口语中很少见，更常见于医学/生物学或较正式的书面语（例如描述“组织粘连”“颗粒凝聚”）。","词源来自拉丁语 con-（共同）+ gluten（胶、黏性物），同根词包括 gluten（面筋；黏性物）、conglutination（黏合；凝聚）。"]}
{"word":"conglutinated","summary":{"en":"“Conglutinated” means stuck or glued together into a clump; it’s a formal/scientific word.","zh":"“Conglutinated”表示“粘结在一起、凝结成团”，多用于正式或科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Stuck together into a mass; clumped or glued together (often used in biology or technical writing).","zh":"（常用于生物或技术语境）粘结在一起的；凝结成团的。"},"examples":[{"en":"The spores were conglutinated into a sticky clump.","zh":"孢子粘结成了一团黏糊糊的块状物。"},{"en":"After the solution cooled, small particles became conglutinated at the bottom of the tube.","zh":"溶液冷却后，小颗粒在试管底部凝结成团。"}]},{"partOfSpeech":"v.","definition":{"en":"Past participle of “conglutinate”: to cause things to stick together; to unite by glue-like adhesion.","zh":"“conglutinate”的过去分词：使……粘在一起；使……胶合、黏合。"},"examples":[{"en":"The resin conglutinated the fibers into a single sheet.","zh":"树脂把纤维黏合成一整张片材。"},{"en":"In some fungi, cells can be conglutinated by a gelatinous substance.","zh":"在某些真菌中，细胞会被胶状物质黏结在一起。"}]}],"synonyms":["stuck together","clumped","glued","matted","agglutinated"],"phonetic":"/kənˈɡluːtənˌeɪtɪd/","extraExplanation":["该词较正式，日常英语中更常用 **stuck together / clumped together / glued together / matted** 来表达类似意思。","词源上与拉丁语 *gluten*（“胶、黏性物”）有关，因此常见于描述“像胶一样把东西粘在一起”的科学语境（如显微观察、化学沉淀、生物组织等）。"]}
{"word":"conglutinating","summary":{"en":"Conglutinating usually describes something that joins parts together; in linguistics, it refers to agglutinative word-building by adding clear, separate morphemes.","zh":"Conglutinating 通常指“黏合/凝结在一起的”；在语言学中指黏着型构词：通过添加意义清晰、彼此分离的语素来构成词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(linguistics) Forming words by joining many small parts (morphemes) together, with each part usually having a clear, separate meaning.","zh":"（语言学）用许多小的语素“黏合/拼接”来构成词，每个部分通常都有清晰、独立的意义。"},"examples":[{"en":"Turkish is often described as a conglutinating (agglutinative) language.","zh":"土耳其语常被描述为一种黏着型（黏合式/粘着式）的语言。"},{"en":"In conglutinating languages, a single word can express what would be a whole sentence in English.","zh":"在黏着型语言中，一个词可能表达英语里需要一整句才能表达的意思。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common) Joining or sticking together; causing things to glue together.","zh":"（较少见）使……黏在一起的；黏合的；凝结在一起的。"},"examples":[{"en":"A conglutinating substance can bind small particles into a solid mass.","zh":"一种黏合性物质可以把小颗粒黏结成一个固体块。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “conglutinate”: to join or glue together (often used in technical or formal contexts).","zh":"“conglutinate”的现在分词：使……黏合在一起/凝结在一起（常见于技术或正式语境）。"},"examples":[{"en":"Heat is conglutinating the resin and fibers into a stronger material.","zh":"热量正在把树脂和纤维黏合成更坚固的材料。"}]}],"synonyms":["agglutinative","adhesive","binding","gluing"],"phonetic":"/kənˈɡluːtənˌeɪtɪŋ/","extraExplanation":["在语言学里，更常用的术语是 **agglutinative（黏着型）**，而 **conglutinating** 属于较少见但含义相近的说法。黏着型语言的典型特点是“一个语素通常对应一个语法意义”，比如表示时态、人称、格、数等的成分会像积木一样一个个加在词根后面。与之对比：**fusional（屈折型）**语言常常“一个词尾同时表达多个语法意义”。"]}
{"word":"conglutination","summary":{"en":"Conglutination means sticking or gluing together, especially the clumping of particles, cells, or tissues.","zh":"Conglutination 指“黏合/黏连在一起”，尤其可指颗粒、细胞或组织的凝集结块。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of sticking or gluing things together; a union formed by adhesion","zh":"（事物）黏合、胶合在一起的过程；黏附形成的结合体"},"examples":[{"en":"Heat can cause conglutination of small particles into larger lumps.","zh":"加热会使小颗粒发生黏结，形成更大的团块。"},{"en":"The lab noted conglutination of the sample after the solution cooled.","zh":"实验室记录到溶液冷却后样本出现黏合现象。"}]},{"partOfSpeech":"n.","definition":{"en":"(biology/medicine) a clumping or sticking together of cells or tissues, especially by a sticky substance","zh":"（生物/医学）细胞或组织的凝集、黏连（常因黏性物质导致）"},"examples":[{"en":"The report described conglutination of red blood cells in the test tube.","zh":"报告描述了试管中红细胞发生凝集。"},{"en":"Inflammation sometimes leads to conglutination of nearby tissues.","zh":"炎症有时会导致邻近组织发生黏连。"}]}],"synonyms":["adhesion","clumping","agglutination","cohesion","sticking together"],"phonetic":"/kənˌɡluːt̬əˈneɪʃən/","extraExplanation":["词源上来自拉丁语 con-（一起）+ glutinare（用胶黏合），与英文 glue（胶水）、gluten（麸质；也有“黏性”联想）同源，核心感觉都是“黏在一起”。","在日常英语里 conglutination 比较少见，更常见的替代表达有 sticking together / clumping / adhesion；在医学与生物语境中也常用 agglutination（凝集，常指细胞/颗粒在反应中“聚成团”）。","阅读学术文章时，如果看到 conglutination，通常是在描述“因为黏性或胶状物质导致的黏连/结块”，强调“胶一样的黏合”这一点。"]}
{"word":"conglutinative","summary":{"en":"Describing a language/word formation style where words are formed by attaching multiple clear, meaningful parts (morphemes).","zh":"指通过连接多个清晰可分、各自带意义的词素来构词的语言或构词方式（常近似于“黏着型”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Linguistics) Describing a language or word formation style in which words are built by “gluing together” several clearly separable parts (morphemes), each usually carrying one grammatical meaning.","zh":"（语言学）指一种语言或构词方式：通过把多个清晰可分的词素“粘合”在一起构成词，每个词素通常表达一个语法意义。"},"examples":[{"en":"Turkish is often described as a conglutinative language because it adds many suffixes to a word stem.","zh":"土耳其语常被描述为黏着型（conglutinative）语言，因为它会在词干后加上许多后缀。"},{"en":"In a conglutinative system, you can often identify the meaning of each ending separately.","zh":"在黏着型系统中，你通常可以把每个词尾的意义单独辨认出来。"}]}],"synonyms":["agglutinative","morpheme-based","affixal"],"phonetic":"/kənˈɡluːtɪnətɪv/","extraExplanation":["“Conglutinative”常用于介绍语言类型（language typology）。更常见、也更标准的术语是“agglutinative（黏着语的）”。两者意思非常接近：强调词素像积木一样一段段拼接、边界清晰。","词源上与拉丁语 glutin-（“胶、黏合”）有关，因此有“粘在一起”的形象比喻。","在实际英语写作里，这个词较少见，学术场合多用 agglutinative；如果你在论文或课堂中看到 conglutinative，通常是在用“黏合式”的比喻来说明同一概念。"]}
{"word":"conglution","summary":{"en":"Conclusion means the end of something, or an opinion/decision reached after thinking.","zh":"Conclusion 指某事的结尾，也指经过思考得出的结论或决定。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the end of something (such as a story, event, or process); the finishing part","zh":"结尾；结束部分（如故事、事件或过程的最后部分）"},"examples":[{"en":"The conclusion of the movie was surprising.","zh":"电影的结尾很令人惊讶。"},{"en":"We’re nearing the conclusion of the meeting.","zh":"会议快要结束了。"}]},{"partOfSpeech":"n.","definition":{"en":"a judgment or opinion reached after thinking carefully; a decision you arrive at","zh":"结论；推断（经过思考后得出的判断或观点）"},"examples":[{"en":"After looking at the evidence, she came to the conclusion that he was telling the truth.","zh":"看过证据后，她得出结论：他说的是真话。"},{"en":"What conclusion did you draw from the data?","zh":"你从数据中得出了什么结论？"}]},{"partOfSpeech":"n.","definition":{"en":"an agreement or settlement (especially in formal or legal contexts)","zh":"（尤指正式或法律语境中的）协议；和解；达成的结果"},"examples":[{"en":"The two sides reached a conclusion after weeks of talks.","zh":"经过数周谈判，双方达成了协议。"}]}],"synonyms":["ending","finish","result","decision","judgment","inference"],"phonetic":"/kənˈkluʒən/","extraExplanation":["你输入的 **conglution** 很可能是拼写错误。最常见的目标词是 **conclusion**（结论/结尾）。","记忆小提示：**conclusion** 来自 *conclude*（结束；下结论）。常见搭配有 **come to a conclusion**（得出结论）、**in conclusion**（总之，用于结尾总结）。"]}
{"word":"Congo","summary":{"en":"Congo usually refers to either of two Central African countries, and it can also mean the Congo River or the wider Congo region/basin.","zh":"Congo 通常指中非的两个国家之一，也可指刚果河或更广义的刚果地区/刚果盆地。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A name used for two neighboring countries in Central Africa: the Republic of the Congo (capital: Brazzaville) and the Democratic Republic of the Congo (capital: Kinshasa).","zh":"中非的两个相邻国家的名称：刚果共和国（首都布拉柴维尔）与刚果民主共和国/刚果（金）（首都金沙萨）。"},"examples":[{"en":"She is traveling to the Democratic Republic of the Congo for a research project.","zh":"她要去刚果民主共和国做研究项目。"},{"en":"The Republic of the Congo and the DRC are different countries with different capitals.","zh":"刚果共和国和刚果民主共和国是不同的国家，首都也不同。"}]},{"partOfSpeech":"n.","definition":{"en":"The Congo River, a major river in Central Africa.","zh":"刚果河：中非的一条重要河流。"},"examples":[{"en":"The Congo River is one of the deepest rivers in the world.","zh":"刚果河是世界上最深的河流之一。"}]},{"partOfSpeech":"n.","definition":{"en":"The Congo region or Congo Basin area in Central Africa (often discussed in geography, ecology, or history).","zh":"刚果地区/刚果盆地（常用于地理、生态或历史语境）。"},"examples":[{"en":"The Congo Basin contains vast tropical rainforests.","zh":"刚果盆地拥有广阔的热带雨林。"}]}],"synonyms":["Republic of the Congo","Democratic Republic of the Congo","DR Congo","Congo River","Congo Basin"],"phonetic":"/ˈkɑŋɡoʊ/","extraExplanation":["英语里单独说“Congo”容易引起歧义，因为它可能指两个国家之一。为避免混淆，常见写法是：Democratic Republic of the Congo（DRC，中文常写“刚果（金）”）和 Republic of the Congo（中文常写“刚果（布）”）。","与之相关的形容词/国籍词是 Congolese（“刚果的；刚果人”），可指两个国家的人或事物，具体要看上下文。","在文学与历史语境中，“the Congo”有时不仅是地名，也会指殖民历史、探险叙事或雨林生态（如约瑟夫·康拉德《黑暗之心》常被提及）。"]}
{"word":"congo","summary":{"en":"Congo commonly refers to either of two Central African countries, and it can also mean the Congo River or the Congo Basin.","zh":"Congo（刚果）常指中非两个国家之一，也可指刚果河或刚果盆地。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a name used for two countries in Central Africa: the Democratic Republic of the Congo (DRC) and the Republic of the Congo","zh":"“刚果”常指中非的两个国家：刚果民主共和国（刚果（金），DRC）和刚果共和国（刚果（布））"},"examples":[{"en":"She worked on a public health project in the Democratic Republic of the Congo.","zh":"她在刚果民主共和国参与了一个公共卫生项目。"},{"en":"Brazzaville is the capital of the Republic of the Congo.","zh":"布拉柴维尔是刚果共和国的首都。"}]},{"partOfSpeech":"n.","definition":{"en":"the Congo River, a major river in Central Africa","zh":"刚果河：中非的一条重要河流"},"examples":[{"en":"The Congo River is one of the deepest rivers in the world.","zh":"刚果河是世界上最深的河流之一。"}]},{"partOfSpeech":"n.","definition":{"en":"the Congo Basin, a large rainforest region around the Congo River","zh":"刚果盆地：围绕刚果河的大型热带雨林地区"},"examples":[{"en":"The Congo Basin is home to many unique plants and animals.","zh":"刚果盆地拥有许多独特的动植物。"}]}],"synonyms":["Democratic Republic of the Congo","Republic of the Congo","Congo River","Congo Basin"],"phonetic":"/ˈkɑːŋɡoʊ/","extraExplanation":["“Congo”在新闻和日常英语里有时会让人混淆，因为它可能指两个不同的国家。写作或正式场合常用全名来避免歧义：Democratic Republic of the Congo（DRC，常译“刚果（金）”，首都KInshasa金沙萨）与Republic of the Congo（常译“刚果（布）”，首都Brazzaville布拉柴维尔）。","在文学与流行文化中，“the Congo”有时也被用来泛指中非的丛林与河流地区（更接近“Congo Basin”的意象），但这种用法可能带有刻板印象；更准确的表达会具体说Congo River或Congo Basin。"]}
{"word":"congoes","summary":{"en":"“Congoes” is not common modern English; it’s usually a misspelling of “Congos,” meaning more than one “Congo.”","zh":"“congoes”在现代英语中不常见，通常是把“Congos”误写了，表示不止一个“Congo（刚果）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural form of “Congo” (the name of a country/region). In modern English, this spelling is uncommon; people usually write “the Congo” (for the region/river) or use specific country names.","zh":"“Congo”的复数形式（国家/地区名称）。但在现代英语里这种拼写不常见；更常见的说法是“the Congo”（指地区/河流），或直接用具体国名。"},"examples":[{"en":"Historically, writers sometimes spoke of “the two Congos,” meaning two different countries in the Congo region.","zh":"历史写作中，有时会说“the two Congos”，指刚果地区的两个不同国家。"},{"en":"Today, it’s clearer to say “the Republic of the Congo” and “the Democratic Republic of the Congo.”","zh":"如今更清晰的说法是“the Republic of the Congo（刚果共和国）”和“the Democratic Republic of the Congo（刚果民主共和国）”。"}]}],"synonyms":["Congos (more common spelling)"],"phonetic":"/ˈkɑŋɡoʊz/","extraExplanation":["“congoes”很可能是把“Congos”误写成了“congoes”。如果你想表达“刚果人”，英语通常用“Congolese”（既可作形容词也可作名词，如：Congolese music / a Congolese）。","如果你指的是两国并列，常见表达是“the two Congos”，但在正式/清晰写法中，更推荐直接写全称：Republic of the Congo 与 Democratic Republic of the Congo。"]}
{"word":"Congoese","summary":{"en":"Congolese means “from the Congo,” and it can describe people or things related to either Congo country; it can also mean a person from there.","zh":"Congolese 指“来自刚果（地区/国家）”，可形容与两个“刚果”国家相关的人或事物，也可指刚果人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Spelling note) The usual spelling is “Congolese,” meaning related to the Congo region, especially the people, languages, or culture of the Democratic Republic of the Congo or the Republic of the Congo.","zh":"（拼写提示）常见拼写是“Congolese”，表示与刚果地区有关，尤指刚果民主共和国或刚果共和国的人民、语言或文化。"},"examples":[{"en":"I met a Congolese student at the language exchange.","zh":"我在语言交流活动中认识了一位刚果学生。"},{"en":"Congolese music is popular across Africa and beyond.","zh":"刚果音乐在非洲乃至更广范围都很受欢迎。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from the Democratic Republic of the Congo or the Republic of the Congo.","zh":"刚果人（来自刚果民主共和国或刚果共和国的人）。"},"examples":[{"en":"She is Congolese and speaks French at school.","zh":"她是刚果人，在学校说法语。"},{"en":"Many Congolese live in Kinshasa, the capital of the DRC.","zh":"许多刚果人住在刚果（金），也就是刚果民主共和国的首都。"}]}],"synonyms":["from the Congo"],"phonetic":"/ˌkɑŋɡəˈliz/","extraExplanation":["你输入的“Congoese”一般被视为拼写错误；标准拼写是“Congolese”。","“Congolese”可能指两国之一：刚果民主共和国（DRC，首都金沙萨 Kinshasa）或刚果共和国（首都布拉柴维尔 Brazzaville）。如果需要更明确，可以说“from the DRC / from the Republic of the Congo”。"]}
{"word":"congoese","summary":{"en":"“Congolese” means “from the Congo” (adj.) or “a person from the Congo” (n.). “Congoese” is a common misspelling.","zh":"“Congolese”表示“刚果的”（形容词）或“刚果人”（名词）；“congoese”常为拼写错误。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Congo, or to its people, languages, or cultures (especially the Democratic Republic of the Congo or the Republic of the Congo).","zh":"与刚果有关的；刚果（人、语言或文化）的（常指刚果民主共和国或刚果共和国）。"},"examples":[{"en":"Congolese music is famous for its dance rhythms.","zh":"刚果音乐以其舞曲节奏而闻名。"},{"en":"She studies Congolese history in college.","zh":"她在大学里学习刚果历史。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from the Congo (or of Congolese origin).","zh":"刚果人；刚果裔人士。"},"examples":[{"en":"Many Congolese speak more than one language.","zh":"许多刚果人会说不止一种语言。"},{"en":"He is Congolese, but he grew up in the U.S.","zh":"他是刚果人，但在美国长大。"}]}],"synonyms":["Congolese"],"phonetic":"/ˌkɑŋɡəˈliːz/","extraExplanation":["“Congoese”通常被视为拼写错误；标准拼写是 **Congolese**。","“Congolese”可以指两个国家的国民/事物：**刚果民主共和国**（DR Congo, 首都金沙萨）和 **刚果共和国**（Republic of the Congo, 首都布拉柴维尔）。在写作中如果需要更清楚，可说 “from DR Congo / from the Republic of the Congo”。"]}
{"word":"Congolese","summary":{"en":"Congolese means “from Congo” (either the DRC or the Republic of the Congo) or “a person from Congo.”","zh":"Congolese 指“刚果的/与刚果有关的”（可指刚果民主共和国或刚果共和国），也可指“刚果人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"from or relating to the Democratic Republic of the Congo or the Republic of the Congo, or to their people, languages, or culture.","zh":"（与）刚果民主共和国或刚果共和国（及其）人民、语言或文化有关的；刚果的。"},"examples":[{"en":"She studies Congolese music and dance.","zh":"她研究刚果的音乐与舞蹈。"},{"en":"Congolese cuisine often includes cassava and plantains.","zh":"刚果菜肴常见木薯和大蕉。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from the Democratic Republic of the Congo or the Republic of the Congo.","zh":"刚果人（指来自刚果民主共和国或刚果共和国的人）。"},"examples":[{"en":"Many Congolese live in Kinshasa, a very large city.","zh":"许多刚果人生活在金沙萨，这是一座非常大的城市。"},{"en":"He is Congolese and speaks French at school.","zh":"他是刚果人，在学校说法语。"}]}],"phonetic":"/ˌkɑːŋɡəˈliːz/","extraExplanation":["“Congolese”对应两個國家：剛果民主共和國（首都金沙薩，常簡稱 DRC）和剛果共和國（首都布拉柴維爾）。因為兩國名稱相近，英文寫作中常用 “DRC/Republic of the Congo” 來避免混淆。","文化與語言方面，“Congolese”很廣泛：兩國都有法語作官方語言之一，也有多種本地語言（例如林加拉語 Lingala、基孔戈語 Kikongo 等）。因此在描述時可更具體，如 “Congolese Lingala songs”（剛果林加拉語歌曲）。"]}
{"word":"congolese","summary":{"en":"Congolese means “from or related to the Congo,” and it can refer to either of the two countries named Congo (DRC or Republic of the Congo).","zh":"Congolese 意为“来自/与刚果有关”，可指刚果民主共和国或刚果共和国（需结合语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Democratic Republic of the Congo (DRC) or the Republic of the Congo, or to their people, languages, or culture","zh":"与刚果民主共和国（DRC）或刚果共和国有关的；与其人民、语言或文化有关的"},"examples":[{"en":"Congolese music has influenced many modern African pop styles.","zh":"刚果音乐影响了许多现代非洲流行音乐风格。"},{"en":"She studies Congolese history in her African studies class.","zh":"她在非洲研究课上学习刚果历史。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from the Democratic Republic of the Congo or the Republic of the Congo","zh":"刚果人（指来自刚果民主共和国或刚果共和国的人）"},"examples":[{"en":"He is Congolese and speaks French at work.","zh":"他是刚果人，在工作中说法语。"},{"en":"Many Congolese live in Kinshasa, one of Africa’s largest cities.","zh":"许多刚果人居住在金沙萨，这是非洲最大的城市之一。"}]}],"synonyms":["from the Congo","Congolese (DRC)","Congolese (Congo-Brazzaville)"],"phonetic":"/ˌkɑŋɡəˈliz/","extraExplanation":["“Congolese”容易引起混淆，因为世界上有两个国家名称都含“Congo”：刚果民主共和国（首都金沙萨，常简称 DRC）和刚果共和国（首都布拉柴维尔）。英语里“Congolese”可以指两者中的任意一方，具体要看上下文。","在需要更精确时，英语常说“DRC”/“the Democratic Republic of the Congo”或“the Republic of the Congo”，也会用“Congolese (DRC)”或“Congolese (Congo-Brazzaville)”来避免歧义。"]}
{"word":"Congoleum","summary":{"en":"Congoleum is a trademark name for vinyl/linoleum-style floor covering, sometimes used casually to mean that type of flooring.","zh":"Congoleum 是一种乙烯基/油毡类地板的商标名，口语中有时也泛指这类地板。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand name for resilient floor covering (especially sheet vinyl or linoleum), sometimes used informally to mean this kind of flooring in general.","zh":"（商标）一种弹性地板材料的品牌名（尤指卷材乙烯基地板或油毡）；在口语中有时也被用来泛指这类地板。"},"examples":[{"en":"The kitchen floor is covered with Congoleum, so it’s easy to wipe clean.","zh":"厨房地面铺的是 Congoleum，所以很容易擦干净。"},{"en":"In older apartments, you might see Congoleum laid over the original wood floor.","zh":"在一些老公寓里，你可能会看到在原木地板上面又铺了一层 Congoleum。"}]}],"synonyms":["vinyl flooring","linoleum","sheet flooring","floor covering"],"phonetic":"/kɑnˈɡoʊliəm/","extraExplanation":["“Congoleum”最早是美国一家地板材料公司的商标名，常见于20世纪的住宅装修语境。后来在某些地区，它会像“Xerox/复印机”那样，被人用来泛指某类地板材料，但在正式写作里最好把它当作品牌名（首字母大写），或改用更通用的说法：vinyl flooring / linoleum / sheet flooring。"]}
{"word":"congoleum","summary":{"en":"Congoleum is a brand name often used to mean a linoleum- or vinyl-like floor covering.","zh":"Congoleum 是一个品牌名，常被用来泛指类似油毡或乙烯基地板的地面铺材。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Trademark) a type of durable floor covering, similar to linoleum or vinyl flooring, often sold in sheets or tiles.","zh":"（商标名）一种耐用的地板铺材，类似油毡或乙烯基地板，常以卷材或地板砖形式出售。"},"examples":[{"en":"They covered the kitchen floor with Congoleum because it was easy to clean.","zh":"他们用 Congoleum 铺了厨房地面，因为很容易清洁。"},{"en":"Old apartments sometimes have Congoleum in the hallway instead of wood.","zh":"老公寓的走廊有时铺的是 Congoleum，而不是木地板。"}]}],"synonyms":["linoleum","vinyl flooring","resilient flooring","floor covering"],"phonetic":"/kɑŋˈɡoʊliəm/","extraExplanation":["“Congoleum”最初是美国公司/品牌名，常被当作普通名词用来指“类似油毡（linoleum）的地板材料”。在日常英语里，它通常出现在家装、房屋租赁、维修等语境。","在书面写作中，如果不是特指品牌，常用更通用的说法：“linoleum”（油毡）或“vinyl flooring”（乙烯基地板）。"]}
{"word":"Congonhas","summary":{"en":"Congonhas is a proper name in Brazil: a city in Minas Gerais, and commonly the name people use for São Paulo–Congonhas Airport.","zh":"Congonhas 是巴西的专有名词：既可指米纳斯吉拉斯州的一座城市，也常用来指圣保罗孔戈尼亚斯机场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A municipality (city) in the state of Minas Gerais, Brazil, known historically for gold mining and for the Baroque sanctuary and sculptures by Aleijadinho.","zh":"巴西米纳斯吉拉斯州的一座城市（市镇），历史上以淘金/矿业以及巴洛克风格的圣地与雕塑（如阿莱雅迪尼奥的作品）而闻名。"},"examples":[{"en":"Many travelers visit Congonhas to see the Sanctuary of Bom Jesus de Matosinhos.","zh":"许多游客去孔戈尼亚斯（Congonhas）参观博姆热苏斯·德·马托辛纽斯圣地。"},{"en":"Congonhas is in Minas Gerais, a region famous for colonial-era art and architecture.","zh":"孔戈尼亚斯位于米纳斯吉拉斯州，该地区以殖民时期的艺术与建筑闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"(Commonly) Short for São Paulo–Congonhas Airport, a major domestic airport in São Paulo, Brazil.","zh":"（常用）指圣保罗孔戈尼亚斯机场（São Paulo–Congonhas Airport），巴西圣保罗市的重要国内航线机场。"},"examples":[{"en":"My flight to Rio departs from Congonhas, not Guarulhos.","zh":"我去里约的航班从孔戈尼亚斯机场起飞，不是从瓜鲁柳斯机场。"},{"en":"Congonhas is popular for quick business trips within Brazil.","zh":"孔戈尼亚斯机场很适合巴西国内的短途商务出行。"}]}],"synonyms":["São Paulo–Congonhas Airport (CGH)","Congonhas Airport"],"phonetic":"/kɑnˈɡoʊnjəs/","extraExplanation":["“Congonhas”在英语里通常作为专有名词使用：要么指米纳斯吉拉斯州的城市，要么在旅行语境中指圣保罗的孔戈尼亚斯机场。读到句子时可以靠上下文判断：出现“flight/airport/terminal”等词，多半是机场；出现“Minas Gerais/sanctuary/baroque”等词，多半是城市。"]}
{"word":"congoni","summary":{"en":"“Congoni” isn’t a common English word; it’s likely a name or a misspelling.","zh":"“congoni”不是常见英语词，可能是专有名词或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. “Congoni” is most likely (1) a proper name (e.g., a surname/place name), or (2) a misspelling of another word.","zh":"不是标准英语词。“congoni”更可能是（1）专有名词（如姓氏/地名），或（2）其他单词的拼写错误。"},"examples":[{"en":"I couldn’t find “congoni” in major English dictionaries—do you mean a name or another word?","zh":"我在主要英语词典里找不到“congoni”——你是指名字还是想拼另一个词？"},{"en":"Could you share the sentence where you saw “congoni”? That will help identify it.","zh":"你能把你看到“congoni”的句子发一下吗？这样更容易判断。"}]}],"synonyms":["Congo","conga","congenial"],"extraExplanation":["如果你想查的是类似拼写的英文词，常见的可能是：\n- Congo（刚果）\n- conga（康加鼓；康加舞）\n- congenial（令人愉快的；性格相投的）\n把你原句或截图发来，我可以帮你精确判断是哪一个，并给出正确释义与用法。"]}
{"word":"congos","summary":{"en":"“Congos” usually means the two countries called Congo, or multiple things named Congo.","zh":"“Congos”通常指“两个刚果”（同名的两个国家），也可泛指多个名为 Congo 的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of Congo; often used to refer to the two countries in Central Africa that share the name Congo (the Republic of the Congo and the Democratic Republic of the Congo).","zh":"Congo 的复数；常用来指中非同名的两个国家：刚果共和国（布拉柴维尔）与刚果民主共和国（金沙萨）。"},"examples":[{"en":"News reports sometimes talk about “the Congos” to compare the two neighboring countries.","zh":"新闻报道有时会用“the Congos（两个刚果）”来比较这两个相邻国家。"},{"en":"Trade between the Congos has been affected by border policies.","zh":"两个刚果之间的贸易会受到边境政策影响。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of Congo; can also mean multiple things named “Congo,” such as the Congo River or places/organizations with that name.","zh":"Congo 的复数；也可指多个名为“Congo”的事物，例如刚果河，或带有“Congo”名称的地名/机构等。"},"examples":[{"en":"The map labels different Congos, including the Congo River and the two countries.","zh":"这张地图标注了不同的“Congo”，包括刚果河以及两个国家。"}]}],"synonyms":["the two Congos","Congo-Brazzaville and Congo-Kinshasa","DRC and the Republic of the Congo"],"phonetic":"/ˈkɑŋɡoʊ/","extraExplanation":["“the Congos”这种说法最常见的语境是区分两个国家：\n1) the Republic of the Congo（刚果共和国，首都 Brazzaville 布拉柴维尔）\n2) the Democratic Republic of the Congo（刚果民主共和国，常简称 DRC，首都 Kinshasa 金沙萨）。\n因为两国首都隔着刚果河相望，所以也常被叫作“Congo-Brazzaville”和“Congo-Kinshasa”。","注意不要和 conga（康加鼓/康加舞）混淆：发音和拼写接近，但意思完全不同。"]}
{"word":"congou","summary":{"en":"“Congou” is not a standard English word; you probably mean “Congo,” the Congo River or either of the two Central African countries.","zh":"“congou”不是标准英语词；你可能想写“Congo”，指刚果河或中非两个名为刚果的国家之一。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Likely intended) Congo: a name used for the Congo River and for two countries in Central Africa (the Republic of the Congo and the Democratic Republic of the Congo).","zh":"（很可能是想写）Congo：可指刚果河，也可指中非的两个国家名称（刚果共和国与刚果民主共和国）。"},"examples":[{"en":"The Congo River is one of the deepest rivers in the world.","zh":"刚果河是世界上最深的河流之一。"},{"en":"She traveled to the Democratic Republic of the Congo for a research project.","zh":"她因研究项目前往刚果民主共和国。"},{"en":"Brazzaville is the capital of the Republic of the Congo.","zh":"布拉柴维尔是刚果共和国的首都。"}]}],"phonetic":"/ˈkɑːŋɡoʊ/","extraExplanation":["“congou”在英语里不是常见拼写；更常见的是“Congo”。如果你想查的是别的词（例如人名、品牌名、游戏名或网络用语），可以告诉我它出现的句子或语境，我可以更准确地解释。","注意区分两个国家：Republic of the Congo（刚果共和国，首都Brazzaville）与Democratic Republic of the Congo（刚果民主共和国，常简称DRC，首都Kinshasa）。在新闻与历史语境中，DRC过去也常被称为“Zaire（扎伊尔）”。"]}
{"word":"congous","summary":{"en":"Congruous means “matching/appropriate,” and in math it can mean “identical in shape and size.”","zh":"congruous 表示“协调一致/合适”；在数学中还可表示“全等（形状和大小相同）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of something) suitable, matching, or consistent with something else; not awkward or out of place.","zh":"（事物）适合的；协调一致的；与……相符的；不突兀的。"},"examples":[{"en":"His calm tone was congruous with the serious situation.","zh":"他冷静的语气与严肃的局势很相符。"},{"en":"The modern furniture looks congruous in this bright, open room.","zh":"这套现代家具放在这个明亮通透的房间里很协调。"}]},{"partOfSpeech":"adj.","definition":{"en":"(in geometry, of figures) exactly the same in shape and size.","zh":"（几何）全等的（形状和大小完全相同）。"},"examples":[{"en":"The two triangles are congruous, so their corresponding sides are equal.","zh":"这两个三角形是全等的，所以对应边相等。"}]}],"synonyms":["consistent","compatible","appropriate","fitting","harmonious"],"phonetic":"/ˈkɑŋɡruəs/","extraExplanation":["你输入的“congous”不是常见英语单词；最可能是拼写成 **congruous**（少了字母 r 和 u 的位置不对）。","词源来自拉丁语 *congruus*，意为“相配的、合适的”。在日常英语里常与介词 **with** 连用：**be congruous with**（与……一致/相符）。"]}
{"word":"congrats","summary":{"en":"“Congrats” is an informal way to say “congratulations.”","zh":"“congrats”是“congratulations（恭喜）”的非正式说法。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A casual way to say “congratulations,” used to express praise or happiness for someone’s achievement or good news.","zh":"“congratulations”的非正式说法，用来表达对他人成就或好消息的祝贺、称赞。"},"examples":[{"en":"Congrats on your new job!","zh":"恭喜你找到新工作！"},{"en":"Congrats—you did a great presentation.","zh":"恭喜你——你的展示做得很棒。"},{"en":"Congrats! I’m really happy for you.","zh":"恭喜！我真替你开心。"}]}],"synonyms":["congratulations","well done","nice one","good for you"],"phonetic":"/kənˈɡræts/","extraExplanation":["“congrats”是“congratulations”的口语缩写，常见于聊天、短信、社交媒体和轻松场合。正式场合（例如邮件给上级、正式贺信）更推荐用“Congratulations on …”。","语气提示：对朋友或同龄人说“Congrats!”很自然；对长辈或正式对象可以用更完整、更礼貌的表达，如“Congratulations on your promotion.”"]}
{"word":"congratulable","summary":{"en":"“Congratulable” means “deserving congratulations.” It’s correct but uncommon; speakers often choose “commendable” or “congratulatory.”","zh":"“congratulable”意为“值得祝贺的”。这个词正确但较少用，日常更常见“commendable（值得称赞的）”或“congratulatory（表示祝贺的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Deserving praise or congratulations; worth congratulating.","zh":"值得称赞或祝贺的；可被祝贺的。"},"examples":[{"en":"Finishing your first marathon is a congratulable achievement.","zh":"完成你的第一次马拉松是一项值得祝贺的成就。"},{"en":"Her promotion is congratulable, but she stayed humble.","zh":"她的晋升值得祝贺，但她依然很谦逊。"}]}],"synonyms":["commendable","praiseworthy","laudable","worthy of congratulations"],"phonetic":"/kənˈɡrætʃələˌbəl/","extraExplanation":["“congratulable”在现代英语中比较少见，日常表达更常用“congratulations on …”“congratulatory”（表示祝贺的）或“praiseworthy / commendable”（值得称赞的）。","构词上：congratulate（祝贺）+ -able（“可以……的 / 值得……的”），字面意思就是“值得被祝贺的”。"]}
{"word":"congratulant","summary":{"en":"“Congratulant” means “expressing congratulations” (adj.) or “a person who offers congratulations” (n.), but it is relatively uncommon in modern English.","zh":"“congratulant”可作形容词表示“祝贺的”，也可作名词表示“祝贺者”，但在现代英语中较少见。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"expressing congratulations; offering praise for someone’s success or good news.","zh":"表示祝贺的；向他人的成功或喜讯致贺的。"},"examples":[{"en":"She sent a congratulant message after hearing about his promotion.","zh":"听说他升职后，她发了一条表示祝贺的信息。"},{"en":"The coach gave a short but congratulant speech to the team.","zh":"教练给队员们做了一个简短但充满祝贺的讲话。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who congratulates someone.","zh":"祝贺者；向别人道贺的人。"},"examples":[{"en":"Several congratulants gathered outside the office to greet the new director.","zh":"几位祝贺者聚集在办公室外迎接新主任。"}]}],"synonyms":["congratulatory","complimentary","laudatory","congratulator"],"phonetic":"/kənˈɡrætʃələnt/","extraExplanation":["“congratulant”在现代英语里比较少见，更常用的是形容词“congratulatory”（祝贺的）或名词“congratulator”（祝贺的人）。在正式写作中，用“congratulatory message/letter/speech”会更自然。"]}
{"word":"congratulat","summary":{"en":"“Congratulate” means to express happiness and praise to someone for good news or success.","zh":"“Congratulate”表示因某人的好消息或成功而向其表达高兴与称赞，即“祝贺”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to tell someone you are happy about their success, achievement, or good news; to praise them warmly","zh":"祝贺；向某人表示祝贺（对其成功、成就或喜事表示高兴并称赞）"},"examples":[{"en":"I congratulated her on passing the exam.","zh":"我祝贺她通过了考试。"},{"en":"They congratulated him for winning first place.","zh":"他们祝贺他获得第一名。"},{"en":"Please congratulate your team—everyone worked hard.","zh":"请祝贺你的团队——大家都很努力。"}]},{"partOfSpeech":"vt.","definition":{"en":"(reflexive) to feel pleased with yourself about something you did","zh":"（反身用法）为自己做成某事而感到得意/自喜"},"examples":[{"en":"He congratulated himself on making a smart decision.","zh":"他为自己做了一个明智的决定而暗自得意。"},{"en":"Don’t congratulate yourself too soon—the work isn’t finished.","zh":"别高兴得太早——工作还没完成。"}]}],"synonyms":["praise","compliment","applaud","commend"],"phonetic":"/kənˈɡrætʃəˌleɪt/","extraExplanation":["你输入的“congratulat”通常是拼写未完成或少了结尾的形式；正确拼写是 **congratulate**。","常见搭配：**congratulate someone on something**（更常用）或 **congratulate someone for something**（也可以，但频率稍低）。注意不要说 *congratulate to someone*。"]}
{"word":"congratulate","summary":{"en":"“Congratulate” means to express happiness and praise to someone for a success or good news, often with “congratulate someone on something.”","zh":"“Congratulate”表示向某人道贺、称赞对方的成功或好消息，常用结构是“congratulate someone on something”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to tell someone you are happy about their success or good news; to praise them and say “well done.”","zh":"向某人表示祝贺；为对方的成功或好消息感到高兴并称赞（如说“做得好”）。"},"examples":[{"en":"I congratulated her on getting the job.","zh":"我祝贺她找到了这份工作。"},{"en":"They congratulated us for winning the match.","zh":"他们祝贺我们赢得了比赛。"},{"en":"Please congratulate him on his graduation.","zh":"请祝贺他毕业。"}]},{"partOfSpeech":"vt.","definition":{"en":"to feel pleased or proud about something you have achieved (often used as “congratulate yourself”).","zh":"为自己的成就感到满意/自豪（常用作“congratulate yourself”）。"},"examples":[{"en":"She congratulated herself on staying calm during the interview.","zh":"她为自己在面试中保持冷静而感到自豪。"}]}],"synonyms":["praise","compliment","felicitate","hail"],"phonetic":"/kənˈɡrætʃəˌleɪt/","extraExplanation":["常见搭配：congratulate someone on something（更常用：祝贺某人某事）；congratulate someone for something（也可用，但在现代英语里通常不如 on 常见）。","易混词：celebrate（庆祝活动本身）vs. congratulate（对“人”表示祝贺）。例如：We celebrated the victory. / We congratulated the team.","语气与文化：英语里对他人成功说“Congratulations!”很自然；正式一点可说“Congratulations on your promotion.”，更亲近可说“Congrats!”。"]}
{"word":"congratulated","summary":{"en":"“Congratulated” is the past form of “congratulate,” meaning you told someone you were pleased about their success or good news.","zh":"“congratulated”是“congratulate”的过去式/过去分词，表示你因对方的成功或好消息而向其表示祝贺。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to tell someone you are happy about their success or a special event (past tense or past participle of “congratulate”)","zh":"向某人表示祝贺、为对方的成功或喜事感到高兴（congratulate 的过去式/过去分词）"},"examples":[{"en":"She congratulated him on passing the exam.","zh":"她祝贺他通过了考试。"},{"en":"We congratulated our friend on her new job.","zh":"我们祝贺朋友找到了新工作。"},{"en":"He was congratulated by his teammates after the match.","zh":"比赛后，他受到了队友们的祝贺。"}]},{"partOfSpeech":"vt.","definition":{"en":"to formally praise or express approval to someone for an achievement (often in public or official situations)","zh":"（常用于正式或公开场合）对某人的成就表示赞扬或祝贺"},"examples":[{"en":"The principal congratulated the students for their hard work.","zh":"校长表扬并祝贺学生们的努力。"},{"en":"She congratulated the team in her speech.","zh":"她在演讲中向团队表示祝贺。"}]}],"synonyms":["praised","applauded","complimented","commended"],"phonetic":"/kənˈɡrætʃəˌleɪtɪd/","extraExplanation":["“congratulated”常与介词 on 连用：congratulated + 人 + on + 事情（成就/喜事）。例如：congratulated me on my promotion。","注意区分：congratulate（祝贺某人）≠ celebrate（庆祝某事）。常见表达：Congratulations!（恭喜！）是名词复数形式的固定用法。"]}
{"word":"congratulates","summary":{"en":"“Congratulates” means “says congratulations to someone” (he/she/it form of congratulate).","zh":"“congratulates”表示“向某人表示祝贺”，是 congratulate 的第三人称单数形式。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Third-person singular of “congratulate”) to tell someone you are pleased about their success, good news, or special event.","zh":"（动词 congratulate 的第三人称单数）向某人表示祝贺，因其成功、好消息或重要事件而表达喜悦。"},"examples":[{"en":"She congratulates him on passing the exam.","zh":"她祝贺他通过了考试。"},{"en":"The manager congratulates the team for finishing the project early.","zh":"经理祝贺团队提前完成了项目。"},{"en":"He congratulates his sister on her new job.","zh":"他祝贺妹妹找到新工作。"}]}],"synonyms":["praises","compliments","applauds","salutes"],"phonetic":"/kənˈɡrætʃəˌleɪts/","extraExplanation":["“congratulates”用于一般现在时，主语是第三人称单数（he/she/it 或单数名词）时使用：He congratulates… / My dad congratulates…","常见搭配：congratulate someone on something（因某事祝贺某人）；也可见 congratulate someone for doing something（因做了某事而祝贺某人），但考试、获奖、结婚等更常用 on。","易混：celebrate 是“庆祝活动/庆贺某事”（celebrate a win / celebrate Christmas）；congratulate 是“对某人说祝贺”（congratulate a person）。"]}
{"word":"congratulating","summary":{"en":"“Congratulating” means expressing praise and happiness to someone for their success or good news.","zh":"“congratulating”表示为他人的成功或好消息表达祝贺与高兴。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"praising someone and expressing happiness about their success or good news (present participle/gerund form of “congratulate”)","zh":"祝贺某人，表达对其成功或好消息的高兴（“congratulate”的现在分词/动名词形式）"},"examples":[{"en":"I’m congratulating you on your promotion.","zh":"我正在祝贺你升职。"},{"en":"She walked up to him, congratulating him on winning the race.","zh":"她走向他，祝贺他赢得比赛。"},{"en":"Congratulating others is a simple way to build good relationships.","zh":"祝贺别人是建立良好关系的一个简单方式。"}]}],"synonyms":["praising","celebrating","commending","applauding"],"phonetic":"/kənˈɡrætʃəˌleɪtɪŋ/","extraExplanation":["“congratulating”常见搭配：congratulate + 人 + on + 事情（congratulate you on your new job）。注意不要说“congratulate for”。","语气区别：congratulate（祝贺具体成就/好消息） vs. praise/compliment（称赞能力或外表）。例如：Congratulations on your graduation!（祝贺毕业）/ You look great today.（夸你今天很好看）","日常口语里更常直接说“Congratulations!”；写邮件/正式场合可用：Congratulations on… / Please accept my congratulations on…"]}
{"word":"congratulation","summary":{"en":"Congratulation means an expression of happiness and praise for someone’s success; in everyday English, people usually say “congratulations” (plural).","zh":"congratulation 指对他人成功或喜讯的祝贺；日常英语更常用复数 congratulations 作为固定祝贺用语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an expression of praise and happiness for someone’s good news or success","zh":"（对他人喜讯或成功的）祝贺；恭喜的话"},"examples":[{"en":"Please accept my congratulations on your new job.","zh":"请接受我对你新工作的祝贺。"},{"en":"He sent a message of congratulations after she won the award.","zh":"她获奖后，他发来一条祝贺信息。"}]}],"synonyms":["congratulations","praise","compliments","best wishes"],"phonetic":"/kənˌɡrætʃəˈleɪʃən/","extraExplanation":["日常英语里更常用复数形式 “congratulations”（作为固定祝贺用语），比如：Congratulations! / Congratulations on your graduation. 单数 “a congratulation” 比较少见，通常出现在更正式、强调“一次祝贺表达/一封贺信”的语境中。","常见搭配：congratulations on + 名词/动名词（on your promotion / on winning）。"]}
{"word":"congratulational","summary":{"en":"Congratulational means ‘expressing congratulations,’ but it is uncommon; congratulatory is more natural.","zh":"congratulational 意为“表示祝贺的”，但很少用；更常见、更地道的是 congratulatory。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or expressing congratulations; used to congratulate someone.","zh":"与祝贺有关的；表示祝贺的；用于向他人道贺的。"},"examples":[{"en":"She sent him a congratulational message after he got the job.","zh":"他拿到那份工作后，她给他发了一条祝贺的信息。"},{"en":"The mayor gave a congratulational speech to the graduating students.","zh":"市长向毕业生发表了一段祝贺致辞。"}]}],"synonyms":["congratulatory","felicitous"],"phonetic":"/kənˌɡrætʃəˈleɪʃənəl/","extraExplanation":["“congratulational”在现代英语中非常少见，写作和正式场合更常用“congratulatory”。比如更自然的搭配是“a congratulatory message/speech/note”。","词形来源上，它由“congratulation（祝贺）+ -al（形容词后缀）”构成；但实际使用频率低，所以母语者看到时可能觉得生硬或不地道。"]}
{"word":"congratulations","summary":{"en":"“Congratulations” is a common phrase to celebrate someone’s success or happy news.","zh":"“Congratulations”是英语里最常用的祝贺用语，用来庆祝他人的成功或喜事。"},"definitions":[{"partOfSpeech":"int.","definition":{"en":"An expression used to tell someone you are happy about their success or good news.","zh":"用于向别人表达你为他们的成功或好消息感到高兴的祝贺用语。"},"examples":[{"en":"Congratulations on your new job!","zh":"恭喜你找到新工作！"},{"en":"Congratulations! You did it.","zh":"恭喜！你做到了。"},{"en":"Congratulations on graduating from college.","zh":"恭喜你大学毕业。"}]}],"synonyms":["Congrats","Well done","Good for you"],"phonetic":"/kənˌɡrætʃəˈleɪʃənz/","extraExplanation":["“Congratulations”在英语里非常常见，既可以单独说“Congratulations!”（语气更兴奋、直接），也常用“Congratulations on + 名词/动名词”来说明祝贺的具体事情，如“on passing the exam / on your promotion”。","在更正式的场合（邮件、贺卡）里也可以写：\"Congratulations on your achievement.\" 或 \"Please accept my congratulations.\""]}
{"word":"congratulator","summary":{"en":"A congratulator is a person who congratulates someone.","zh":"congratulator 指“祝贺者”，即向别人表示祝贺的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who congratulates someone; someone who expresses praise or good wishes for another person’s success or happy event","zh":"祝贺者；向他人的成功或喜事表示祝贺、称赞或致意的人"},"examples":[{"en":"After the award ceremony, she was surrounded by congratulators.","zh":"颁奖典礼结束后，许多人围着她向她道贺。"},{"en":"He is a warm, sincere congratulator who always celebrates other people’s wins.","zh":"他是个热情真诚的祝贺者，总会为别人的胜利而高兴。"}]}],"synonyms":["well-wisher","supporter","admirer"],"phonetic":"/kənˈɡrætʃəˌleɪtər/","extraExplanation":["“congratulator”在现代英语中不算常用，更自然的说法通常是“someone who congratulated me/him/her”或“well-wisher（祝福者）”。在正式或文学语境里偶尔会看到，用来强调“来祝贺的人群”。","词形来源：congratulate（祝贺）+ -or（表示“做某事的人”）。类似构词：creator（创造者）、educator（教育者）。"]}
{"word":"congratulatorily","summary":{"en":"“Congratulatorily” means “in a way that expresses congratulations.”","zh":"“congratulatorily”表示“以祝贺的方式；表示祝贺地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that expresses congratulations or praise for someone’s success or good news.","zh":"以祝贺的方式；表示对他人成功或喜讯的祝贺与赞扬。"},"examples":[{"en":"She smiled congratulatorily and shook his hand after the performance.","zh":"演出结束后，她带着祝贺的微笑与他握手。"},{"en":"The coach spoke congratulatorily to the team for their hard work.","zh":"教练用祝贺的语气表扬球队的努力。"},{"en":"He nodded congratulatorily when he heard she got the job.","zh":"听说她拿到工作后，他点头表示祝贺。"}]}],"synonyms":["congratulatingly","approvingly","praisefully"],"phonetic":"/kənˌɡrætʃəˈleɪtərəli/","extraExplanation":["“congratulatorily”是由形容词/动词相关形式“congratulatory / congratulate”加上副词后缀“-ly”构成，表示“以……的方式”。在日常口语里更常用的是直接说“congratulations!”或用短语“in a congratulatory way / tone”。","常见搭配：smile/speak/nod congratulatorily（祝贺地微笑/说话/点头）；look at someone congratulatorily（用祝贺的眼神看着某人）。"]}
{"word":"congratulatory","summary":{"en":"“Congratulatory” means expressing congratulations or praise for someone’s success or happy news.","zh":"“congratulatory” 意为“表示祝贺的”，用于祝贺他人的成功或喜事。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Expressing praise and good wishes because someone has achieved something or reached a happy event.","zh":"表示祝贺的；因某人取得成就或遇到喜事而表达称赞与祝福的。"},"examples":[{"en":"She sent a congratulatory message after he got the job.","zh":"他找到工作后，她发来了一条祝贺信息。"},{"en":"The mayor gave a congratulatory speech to the winning team.","zh":"市长向获胜的队伍发表了祝贺致辞。"}]}],"synonyms":["congratulant","praising","complimentary","laudatory"],"phonetic":"/kənˌɡrætʃəˈleɪtɔri/","extraExplanation":["常见搭配：congratulatory message/speech/letter/remarks（祝贺信息/演讲/信/讲话）。","语气提示：congratulatory 通常比较正式，日常更常说 Congratulations! 或 I’m happy for you.","相关词：congratulate（v. 祝贺），congratulations（n. 祝贺的话，常用复数）。"]}
{"word":"congredient","summary":{"en":"“Congredient” means “agreeing or consistent,” but it is rare; “congruent” or “consistent” is more common today.","zh":"“congredient”意为“一致的/相符的”，但很少用；现代英语更常见“congruent”或“consistent”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"agreeing; consistent or compatible with something else (often used in formal or older writing).","zh":"一致的；相符的；与……相容的（多用于正式或较旧的书面语）。"},"examples":[{"en":"His actions were not congredient with his promises.","zh":"他的行为与他的承诺并不一致。"},{"en":"The results are congredient with earlier studies.","zh":"这些结果与先前的研究相符。"}]}],"synonyms":["congruent","consistent","compatible","in accord","harmonious"],"phonetic":"/kənˈɡriːdiənt/","extraExplanation":["“congredient”较少见，现代英语更常用近义词“congruent /ˈkɑŋɡruənt/”或“consistent/compatible”。在学术写作中表达“与……一致/相符”，常用搭配是“consistent with / in line with”。","词源上与拉丁语“con-（一起）+ gradi（行走/步伐）”相关，核心意象是“步调一致”，因此引申为“相符、协调”。"]}
{"word":"congree","summary":{"en":"“Congree” is usually a nonstandard spelling for “agree” (or sometimes “concur/match”). Use “agree” in normal writing.","zh":"“congree”通常是“agree”的非标准拼写（有时也被用来表示“相符/一致”）。正常写作建议用“agree”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Nonstandard; often a misspelling) to agree; to have the same opinion as someone.","zh":"（非标准用法；常见拼写错误）同意；与某人观点一致。"},"examples":[{"en":"I congree with you. (Better: I agree with you.)","zh":"我 congree 你。（更好：I agree with you.）"},{"en":"Do you congree that we should leave now? (Better: Do you agree…?)","zh":"你 congree 我们现在该走吗？（更好：Do you agree…?）"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare/archaic) to be in harmony or correspond; to match.","zh":"（罕见/古旧）一致；相符；相协调。"},"examples":[{"en":"His actions did not congree with his words. (More common today: did not match / did not agree with)","zh":"他的行为与他的言辞不相符。（更常用：did not match / did not agree with）"}]}],"synonyms":["agree","concur","match","correspond","be consistent with"],"phonetic":"/kənˈɡriː/","extraExplanation":["“congree”在现代标准英语里很少见，写作中通常会被当作拼写错误。最常见的正确词是：\n- **agree**（同意）：I agree with you.\n- **concur**（更正式的“同意”）：I concur.\n如果你想表达“相符/一致”，也常用：**match / correspond / be consistent with**。"]}
{"word":"congreet","summary":{"en":"“Congreet” is a rare, old-fashioned verb meaning “to greet” or “to greet one another.”","zh":"“Congreet”是一个罕见的古语动词，意思是“问候（某人）”或“彼此问候”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare/archaic) to greet or salute (someone), often meaning to greet warmly or to greet one another.","zh":"（罕见/古语）向（某人）致意、问候；也可指彼此相互问候。"},"examples":[{"en":"They congreeted each other at the gate before the ceremony began.","zh":"仪式开始前，他们在门口彼此问候。"},{"en":"The host congreeted the guests with a smile and a handshake.","zh":"主人微笑着握手问候来宾。"}]}],"synonyms":["greet","salute","welcome"],"phonetic":"/kənˈɡrit/","extraExplanation":["“congreet”在现代英语里几乎不使用，多见于较老的文学或宗教/正式文体中。学习时更实用的常用词是 greet（问候）或 welcome（欢迎）。","它容易被误读为 concrete（混凝土；具体的）或 congratulate（祝贺）。如果你本来想查的是其中一个词，也可以告诉我，我可以给你它们的详细词条和用法对比。"]}
{"word":"congregable","summary":{"en":"Congegable means “able or suitable to gather together,” and more rarely “sociable.”","zh":"congregable 指“可聚集的、适合集合的”，较少见也可指“合群的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to gather into a group; suitable for meeting or assembling together","zh":"可聚集的；适合聚会或集合的"},"examples":[{"en":"The garden is a congregable space where neighbors can meet and talk.","zh":"这座花园是个可聚集的空间，邻居们可以在这里见面聊天。"},{"en":"After the lecture, students looked for a congregable area to continue the discussion.","zh":"讲座结束后，学生们寻找一个适合集合的地方继续讨论。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of a person) inclined to gather with others; sociable (rare)","zh":"（指人）爱与人相聚的；合群的（较少见）"},"examples":[{"en":"She’s naturally congregable, so she enjoys clubs and community events.","zh":"她天生很合群，所以喜欢参加社团和社区活动。"}]}],"synonyms":["gatherable","assemblable","sociable","gregarious"],"phonetic":"/ˈkɑŋɡrəɡəbəl/","extraExplanation":["“congregable”在现代英语中比较少见，更多时候人们会用更常见的词来表达相同意思，比如描述“空间适合聚集”会说 *a good place to gather*，描述“人很合群”会说 *sociable* 或 *gregarious*。","词根来自拉丁语 *congregare*（集合到一起），其中 *con-* 表示“共同”，*grex/gregis* 表示“群、群体”（也见于 *gregarious*）。"]}
{"word":"congreganist","summary":{"en":"A Congregationalist is a Protestant who belongs to a church tradition where each local congregation governs itself.","zh":"Congregationalist 指公理会信徒；该新教传统强调地方教会（会众）自治。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Congregational Church (Congregationalism), a Protestant tradition in which each local church governs itself independently","zh":"公理会（Congregationalism）成员；一种新教传统，强调每个地方教会自治、独立治理"},"examples":[{"en":"Her grandparents were Congregationalists and attended a small church in New England.","zh":"她的祖父母是公理会信徒，在新英格兰参加一间小教会的礼拜。"},{"en":"Congregationalists often value local decision-making in church matters.","zh":"公理会通常重视教会事务由地方自行决策。"}]}],"synonyms":["Congregational Church member","Congregationalist Christian","Protestant (general)"],"phonetic":"/kənˌɡriɡəˈʃənəlɪst/","extraExplanation":["你输入的拼写“congreganist”更常见的标准拼写是 **Congregationalist**。","公理会的核心特点是“**会众自治**”（congregational polity）：每个教会通常自行选立牧师、管理财务与事务，而不是由主教或中央机构统一管理。","在英美历史语境中，公理会常与早期新英格兰清教徒传统有关；阅读历史文本时常出现。"]}
{"word":"congregant","summary":{"en":"A congregant is an individual member of a congregation, especially someone who attends a church regularly.","zh":"congregant 指会众中的个人成员，尤指经常参加教会礼拜的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who regularly attends and is considered a member of a church or other place of worship.","zh":"（教堂或其他礼拜场所的）会众成员；经常参加礼拜的人。"},"examples":[{"en":"The pastor greeted each congregant after the Sunday service.","zh":"周日礼拜结束后，牧师向每位会众成员问候。"},{"en":"As a congregant, she volunteers with the church’s food pantry.","zh":"作为会众成员，她在教会的食品救助站做志愿者。"},{"en":"The congregants sat quietly during the prayer.","zh":"祷告时，会众安静地坐着。"}]}],"synonyms":["church member","worshipper","attendee","parishioner"],"phonetic":"/ˈkɑŋɡrɪɡənt/","extraExplanation":["“congregant”来自拉丁语词根，和“congregation（会众；教会团体）”同源。它强调“个体成员”，而“congregation”更常指“整个会众/团体”。","在英语里这个词最常用于基督教语境，但也可以泛指其他宗教礼拜场所的成员。日常口语中也可用更普通的说法：church member（教会成员）或 attendee（参加者）。"]}
{"word":"congregants","summary":{"en":"Congregants are members of a religious congregation—people who attend worship services; sometimes it can mean any gathered group (less common).","zh":"congregants 指会众/信众（参加宗教礼拜的人）；较少情况下也可泛指聚集的人群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who regularly attend and worship at a particular church, synagogue, mosque, or other religious community.","zh":"（某教堂/会堂/清真寺等）固定参加礼拜或宗教活动的会众、信众。"},"examples":[{"en":"The pastor greeted the congregants after the service.","zh":"礼拜结束后，牧师向会众打招呼。"},{"en":"Several congregants volunteered to serve meals to the community.","zh":"几位会众自愿为社区提供餐食。"},{"en":"The congregants sang together during the hymn.","zh":"会众在圣歌时一起歌唱。"}]},{"partOfSpeech":"n.","definition":{"en":"More general: people who gather as an audience or group (less common than the religious meaning).","zh":"（较少用）泛指聚集在一起的一群人、听众。"},"examples":[{"en":"The speaker thanked the congregants for coming to the memorial.","zh":"演讲者感谢前来参加追思会的人们。"},{"en":"Congregants filled the hall before the talk began.","zh":"讲座开始前，大厅里坐满了聚集而来的人。"}]}],"synonyms":["worshippers","churchgoers","members","attendees"],"phonetic":"/ˈkɑŋɡrəɡənts/","extraExplanation":["“congregants”来自动词“congregate”（聚集），常用于宗教语境，强调“某个固定会众/教会成员”，比“people”更正式、更有群体归属感。","易混词：\"congregation\"是“会众（整体）/礼拜人群（集合名词）”，\"congregants\"是其中的“个体成员（复数）”。"]}
{"word":"congregate","summary":{"en":"Congregate means “to gather together,” especially people forming a group in one place; it can also mean “to bring together.”","zh":"Congregate 指“聚集、集合”，多用于人群在某处聚在一起；也可指“使聚集、使集中”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to come together in a group, especially in a public place","zh":"（尤指在公共场所）聚集；集合"},"examples":[{"en":"Fans congregated outside the stadium before the game.","zh":"比赛前，球迷们聚集在体育场外。"},{"en":"People often congregate in the kitchen during parties.","zh":"聚会时，人们常常在厨房里聚在一起。"}]},{"partOfSpeech":"vt.","definition":{"en":"to bring people or things together into one place or group","zh":"使聚集；把……集中到一起"},"examples":[{"en":"The event helped congregate local artists and small businesses.","zh":"这场活动促成了本地艺术家和小商家聚到一起。"},{"en":"The teacher congregated the students near the door for a quick headcount.","zh":"老师把学生集中到门口，快速点名。"}]}],"synonyms":["gather","assemble","cluster","collect","meet"],"phonetic":"/ˈkɑŋɡrəˌɡeɪt/","extraExplanation":["词源上与“教会会众”有关：congregate 来自拉丁语 con-（一起）+ greg-（群、群体），同源词包括 congregation（会众；聚会）和 gregarious（合群的）。因此它常用于描述“人群自然地聚在一起”的场景。","语体与搭配：congregate 比 meet/gather 更强调“多人在同一地点形成群体”的画面感，常见搭配有 congregate outside/around/near…（聚在……外/周围/附近）。","文学/正式语境中也常见：如“congregate in the square（聚集在广场）”用来描写人群汇集的场面，带一点叙述性或较正式的语气。"]}
{"word":"congregated","summary":{"en":"“Congregated” means people or things came together (or were gathered) in one place.","zh":"“congregated”表示人或事物聚集、集合在同一处（也可作形容词表示“聚集的”）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of “congregate”) to come together and form a group, especially in a public place.","zh":"（congregate 的过去式/过去分词）聚集；集合（尤指在公共场所成群地聚在一起）。"},"examples":[{"en":"People congregated outside the theater after the show.","zh":"演出结束后，人们聚集在剧院外面。"},{"en":"Students congregated in the hallway, waiting for the next class.","zh":"学生们聚集在走廊里，等着下一节课。"},{"en":"The birds congregated near the lake at dusk.","zh":"黄昏时鸟群聚集在湖边。"}]},{"partOfSpeech":"adj.","definition":{"en":"Gathered together in one place; grouped.","zh":"聚集的；集结在一起的。"},"examples":[{"en":"A congregated crowd filled the square.","zh":"聚集的人群挤满了广场。"},{"en":"We spoke to the congregated members before the meeting started.","zh":"会议开始前，我们和聚集到场的成员聊了聊。"}]}],"synonyms":["gathered","assembled","clustered","grouped","collected"],"phonetic":"/ˈkɑŋɡrəˌɡeɪtɪd/","extraExplanation":["“congregate”来自拉丁语 con-（一起）+ greg-（群、群体，和 group / gregarious 同源），所以本义就是“成群地聚在一起”。","在语体上，“congregate”比“gather”更正式一些，常用于新闻、公告或描述人群在某处聚集的场景。"]}
{"word":"congregates","summary":{"en":"“Congregates” means “comes together in a group,” and is the third-person singular form of “congregate.”","zh":"“congregates”表示“聚集、集合”，是动词“congregate”的第三人称单数形式。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(third-person singular of “congregate”) to come together and form a group, often in a public place.","zh":"（动词“congregate”的第三人称单数）聚集；集合（常在公共场所）"},"examples":[{"en":"After school, students congregates—sorry, congregate—near the gate to chat.","zh":"放学后，学生们常在校门口聚在一起聊天。"},{"en":"In winter, birds congregate around areas with more food.","zh":"冬天，鸟类会在食物更多的地方聚集。"}]},{"partOfSpeech":"vt.","definition":{"en":"(less common) to bring people together into a group.","zh":"（较少见）使人群聚集；召集"},"examples":[{"en":"The organizer congregates volunteers at the main entrance before the event begins.","zh":"活动开始前，组织者在主入口处召集志愿者。"}]}],"synonyms":["gathers","assembles","clusters","crowds","collects"],"phonetic":"/ˈkɑŋɡrəˌɡeɪts/","extraExplanation":["“congregates”是动词第三人称单数形式：he/she/it congregates。其他常见形式：congregate（原形/复数主语）、congregated（过去式/过去分词）、congregating（现在分词）。","常见搭配：congregate around/near/outside（在……周围/附近/外面聚集）。","词源与“congregation（会众；集会）”相关，在宗教语境里可指信徒聚集；日常英语中也很常用来表示人群在某处“聚在一起”。"]}
{"word":"congregating","summary":{"en":"“Congregating” means people are gathering together in one place, often forming a crowd.","zh":"“congregating”指人们聚集到同一地点，常形成一群人或人群。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(present participle of “congregate”) coming together and gathering in a group, often in a public place.","zh":"（congregate 的现在分词）聚集在一起；集合成群，常指在公共场所聚拢。"},"examples":[{"en":"People were congregating outside the station after the concert.","zh":"演唱会结束后，人们在车站外聚集。"},{"en":"Students kept congregating in the hallway, so the teacher asked them to move along.","zh":"学生们一直在走廊里聚集，老师就让他们往前走。"}]},{"partOfSpeech":"vi.","definition":{"en":"(less common) gathering together for a religious purpose, such as worship.","zh":"（较少见）为宗教目的（如礼拜）而聚集。"},"examples":[{"en":"Families were congregating for Sunday service.","zh":"家家户户在为周日礼拜聚集。"}]}],"synonyms":["gathering","assembling","grouping","crowding","massing"],"phonetic":"/ˈkɑŋɡrəˌɡeɪtɪŋ/","extraExplanation":["“congregate”源自拉丁语词根，和“congregation（会众/人群）”有关，因此它常带有“人群聚拢、集中到某处”的感觉，比“gather”更正式一些。","在公共安全或管理语境里常见：例如标识里会写“Do not congregate here（请勿在此聚集）”。"]}
{"word":"congregatio","summary":{"en":"*Congregatio* is a Latin noun meaning “a gathering/assembly,” and it is the origin of the English word “congregation.”","zh":"*Congregatio* 是拉丁语名词，意为“聚集、集会”，也是英语 “congregation（会众/集会）” 的词源。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Latin word meaning “a gathering/assembly; a group brought together,” especially used in older church or scholarly writing as the source of the English word “congregation.”","zh":"拉丁语词，意为“聚集、集会；聚在一起的一群人”，常见于较早的教会或学术语境中，也是英语 congregation（会众/集会）的词源。"},"examples":[{"en":"In medieval texts, *congregatio* can refer to a community of believers.","zh":"在中世纪文献中，*congregatio* 可指信徒的团体（会众/社群）。"},{"en":"The English word “congregation” comes from Latin *congregatio*.","zh":"英语 “congregation” 源自拉丁语 *congregatio*。"}]}],"synonyms":["assembly","gathering","group","community"],"phonetic":"/ˌkɑːŋɡrɪˈɡeɪʃən/","extraExplanation":["从构词上看，*con-* 表示“共同、一起”，*greg-* 与“群、群体”（如英语 *gregarious* 合群的）有关；因此 *congregatio* 的核心意思就是“聚成一群”。","现代英语里更常用的对应词是 **congregation**（常指教堂里的会众，或泛指聚集的人群）。如果你是在查英文单词，通常建议用拼写 **congregation**。"]}
{"word":"congregation","summary":{"en":"A congregation is a group of people gathered together, most commonly for religious worship.","zh":"congregation 指聚集在一起的一群人，最常指宗教礼拜中的会众。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group of people gathered together, especially for a religious service (such as in a church, synagogue, or mosque).","zh":"（尤指宗教礼拜时聚集的）会众；会堂/教堂里的信众"},"examples":[{"en":"The congregation stood and sang together.","zh":"会众起立一起唱诗。"},{"en":"After the service, the pastor greeted members of the congregation.","zh":"礼拜结束后，牧师向会众致意。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of gathering together; an assembly of people for a particular purpose.","zh":"聚集；集会（为某种目的而集合的人群或行为）"},"examples":[{"en":"A congregation of reporters waited outside the courthouse.","zh":"一群记者聚集在法院外等候。"},{"en":"Large congregations are not allowed in this area after midnight.","zh":"午夜后此区域不允许大规模聚集。"}]}],"synonyms":["assembly","gathering","group","crowd","churchgoers"],"phonetic":"/ˌkɑŋɡrəˈɡeɪʃən/","extraExplanation":["“congregation”常与宗教语境强关联，最常见搭配包括：the congregation（会众整体）、members of the congregation（会众成员）、address the congregation（对会众讲话）。","词源来自拉丁语“congregare”（聚在一起），其中“grex/ gregis”有“羊群、群体”的意思，因此带有“聚成一群”的意象。英语里也有相关词如“gregarious”（合群的）。","文化上，“congregation”在不同宗教中都可用：教堂的会众、犹太会堂的会众、清真寺礼拜者等；用在非宗教场合时，语气通常比“crowd”更正式。"]}
{"word":"congregational","summary":{"en":"Congregational means “related to a congregation (group of worshippers)” or, with a capital C, “related to the Congregational (Congregationalist) Protestant tradition.”","zh":"congregational 表示“与会众（礼拜聚会的人群）有关的”；首字母大写时可指“与公理宗/公理会这一新教传统有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to a congregation (a group of people gathered for religious worship), especially in a church setting.","zh":"与（宗教）会众/会众集体有关的；尤指与教堂礼拜中的会众有关的。"},"examples":[{"en":"Congregational singing is an important part of many church services.","zh":"会众合唱是许多教会礼拜中的重要环节。"},{"en":"The pastor spoke directly to the congregational audience.","zh":"牧师直接对会众听众讲话。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to Congregationalism, a Protestant tradition in which each local church governs itself independently.","zh":"与公理宗（Congregationalism，一种强调地方教会自治的新教传统）有关的。"},"examples":[{"en":"She grew up in a Congregational church in New England.","zh":"她在新英格兰的公理宗教会中长大。"},{"en":"Congregational polity emphasizes local decision-making.","zh":"公理宗的教会治理强调地方自治与本地决策。"}]}],"synonyms":["communal","collective","church-related","parish (context-dependent)"],"phonetic":"/kənˌɡɹiˈɡeɪʃənəl/","extraExplanation":["“congregational”来自“congregation”（会众、聚会的人群）。日常语境里常见搭配有：congregational singing（会众合唱）、congregational prayer（会众祷告）、congregational meeting（会众/教会成员大会）。","注意大小写：小写 congregational 通常表示“一般意义上的会众的”；大写 Congregational 常用于特指与“公理宗/公理会”相关的宗派或教会。"]}
{"word":"Congregationalism","summary":{"en":"A Protestant tradition where each local church is self-governing.","zh":"一种强调地方教会（会众）自治的新教教会传统。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Protestant Christian church tradition in which each local congregation governs itself independently, rather than being controlled by bishops or a central church authority.","zh":"（新教）公理宗：一种教会传统，强调每个地方教会（会众）独立自治，不受主教制度或中央教会权威统一管辖。"},"examples":[{"en":"Congregationalism teaches that each congregation can choose its own pastor.","zh":"公理宗主张每个会众可以自行选聘牧师。"},{"en":"In Congregationalism, major decisions are often made by a vote of the members.","zh":"在公理宗中，重大决定通常由会友投票表决。"}]}],"synonyms":["congregational polity","independent church governance"],"phonetic":"/kənˌɡriːɡəˈʃənəˌlɪzəm/","extraExplanation":["公理宗（Congregationalism）在英语世界常与英格兰清教徒传统有关，强调“会众之约”（covenant community）与信徒共同参与治理。它对北美早期新英格兰地区（New England）的宗教与社会组织影响很大。","词形提示：congregation（会众、教堂会友）+ -al（形容词后缀）+ -ism（主义/体系）→ 表示“以会众为核心的教会制度/思想”。","相关对比：它常被拿来与 episcopacy（主教制）与 presbyterianism（长老制）对比：主教制由主教层级管理；长老制由长老会议等代表性机构治理；公理宗更强调地方教会自治。"]}
{"word":"congregationalism","summary":{"en":"Congregationalism is a church tradition where each local congregation governs itself, and it also refers to the beliefs and practices of Congregational churches.","zh":"Congregationalism 指公理宗制度：地方教会自治；也可指公理宗教会的相关信仰与实践。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Christian church system in which each local congregation governs itself independently, rather than being controlled by bishops or a central authority","zh":"公理宗制度；一种基督教教会体制：每个地方教会（会众）自治，不受主教或中央机构直接统辖"},"examples":[{"en":"Congregationalism emphasizes the authority of the local church in making decisions.","zh":"公理宗强调地方教会在作决定时的权威与自主。"},{"en":"In Congregationalism, members often vote on key issues like hiring a pastor.","zh":"在公理宗体制中，会友常常就重要事务投票，例如聘任牧师。"}]},{"partOfSpeech":"n.","definition":{"en":"the beliefs and practices associated with Congregational churches, especially in Britain and the United States","zh":"公理宗的信仰与实践（尤指英国与美国的公理宗教会传统）"},"examples":[{"en":"Her family has a long history of Congregationalism in New England.","zh":"她的家族在新英格兰地区有很长的公理宗传统。"},{"en":"The lecture compared Congregationalism with Presbyterian and Episcopal traditions.","zh":"那场讲座比较了公理宗与长老宗、圣公会传统。"}]}],"synonyms":["congregational polity","church autonomy","independent church governance"],"phonetic":"/kənˌɡriːɡəˈʃənəˌlɪzəm/","extraExplanation":["公理宗（Congregationalism）在英语世界常与“地方教会自治”联系最紧密：每个教会通常自行决定信仰告白、礼拜方式、财务与领袖任命等，彼此之间可以有联盟或协会，但一般不具备强制性的上下级管辖。","历史上，它与16—17世纪英国的新教改革、以及清教徒（Puritans）移民北美有密切关联，特别影响了美国新英格兰地区的宗教与社会生活。","相关对比：Episcopal/Anglican（主教制）强调主教体系；Presbyterian（长老制）强调由长老会等代表机构治理；Congregational（公理制）强调会众与地方教会的自主决策。"]}
{"word":"Congregationalist","summary":{"en":"A Congregationalist is a person (or describes a church) in a Christian tradition where local churches govern themselves.","zh":"Congregationalist 指公理会教徒（或公理会的），强调地方教会由会众自治、自行治理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of a Christian church tradition in which each local church is largely independent and governs itself","zh":"公理会教徒；属于一种基督教传统的信徒，该传统强调每个地方教会基本独立并自行治理"},"examples":[{"en":"Her grandparents were Congregationalists in New England.","zh":"她的祖父母是新英格兰的公理会教徒。"},{"en":"Many Congregationalists emphasize local decision-making in church matters.","zh":"许多公理会信徒强调教会事务由地方教会自行决定。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Congregationalism or to churches governed by their local congregation","zh":"公理会的；与公理宗（或由地方会众自治的教会体制）有关的"},"examples":[{"en":"They attended a Congregationalist church on Sundays.","zh":"他们周日去一所公理会教堂做礼拜。"},{"en":"The school has Congregationalist roots.","zh":"这所学校有公理会背景。"}]}],"synonyms":["member of a Congregational church","Congregational (adj.)","Puritan (historical context)"],"phonetic":"/kənˌɡriːɡəˈʃənəlɪst/","extraExplanation":["“Congregationalist”与“Congregationalism（公理宗/公理会主义）”相关，核心观念是“会众自治”：每个地方教会（congregation）在信仰与治理上有较高自主权，而不是由主教或中央机构统一管理。","在美国文化语境中，这个词常与新英格兰早期殖民历史有关；许多早期清教徒社群发展出公理会传统，对当地教育与公共生活影响较大（例如一些早期学院与教会网络）。","现代用法中，它既可指具体宗派成员，也可更宽泛地指“以地方会众自治为治理特色的教会传统”。不同国家/地区的组织名称可能不同，需结合具体教会名称理解。"]}
{"word":"congregationalist","summary":{"en":"A Congregationalist is a Protestant Christian whose church is governed locally by its own congregation.","zh":"Congregationalist 指公理会信徒：一种强调地方教会由本会众自治的新教传统。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of a Protestant Christian church that is governed by each local congregation (church community) rather than by bishops or a central authority","zh":"公理会（宗派）成员；一种新教传统，强调每个地方教会自治，而不是由主教或中央机构管理"},"examples":[{"en":"Her grandparents were Congregationalists in New England.","zh":"她的祖父母在新英格兰是公理会信徒。"},{"en":"The town’s Congregationalist church played a central role in community life.","zh":"镇上的公理会教堂在社区生活中起着核心作用。"}]}],"synonyms":["member of a Congregational church","Congregational Church member"],"phonetic":"/kənˌɡrɛɡəˈʃənəlɪst/","extraExplanation":["“Congregationalist”与“congregational（会众治理的）”有关：核心理念是“地方教会自治”（local autonomy），重大事务由会众或长老在本地决定。","历史上，公理会在英格兰与北美殖民地（尤其新英格兰）影响很大；在美国语境中，它常与早期清教徒传统、地方社区教会和公民社会的发展联系在一起。","相关词：Congregationalism（公理制/公理会制度），congregation（会众；教会会众）。注意拼写：Congregationalist（人/成员），Congregational（形容词）。"]}
{"word":"congregationalists","summary":{"en":"Congregationalists are people who belong to Congregational churches, which emphasize the independence of each local congregation.","zh":"Congregationalists 指公理宗（公理会）的信徒，强调各地方教会的自治独立。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Members of Congregational churches—a Protestant Christian tradition in which each local church (congregation) governs itself rather than being controlled by bishops or a central authority.","zh":"公理宗信徒；公理会成员——一种新教基督教传统，强调每个地方教会（会众）自治，而不是由主教或中央机构统一管辖。"},"examples":[{"en":"Many Congregationalists value local decision-making in church life.","zh":"许多公理宗信徒重视教会生活中的地方自治与本地决策。"},{"en":"In early New England, Congregationalists played a major role in community and education.","zh":"在早期的新英格兰地区，公理宗信徒在社区治理与教育方面发挥了重要作用。"}]}],"synonyms":["members of Congregational churches","Congregational church members"],"phonetic":"/ˌkɑŋɡrəˈɡeɪʃənəlɪsts/","extraExplanation":["“Congregationalists”常用于英美历史语境，尤其与17世纪英格兰的清教徒传统、以及北美新英格兰殖民地（如马萨诸塞）有关。","该传统的核心观念是“会众自治”（congregational polity）：每个地方教会在教义解释、牧师聘任、管理事务上拥有较大独立性。","在美国宗教史中，部分公理宗教会后来与其他教派合并发展，例如一些与归正宗或其他新教团体产生联合；因此在不同地区可能有不同组织名称。"]}
{"word":"congregationalize","summary":{"en":"Congregationalize means to make a church or organization operate under congregational (local, member-led) governance, or to shift toward that system.","zh":"Congregationalize 指把教会/组织改为或转向“会众自治”的会众制（公理制）治理。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something organized around, suited to, or governed by a congregation (a local church community), especially in the Congregationalist tradition","zh":"使某事物按“会众制/公理制”（由当地会众自治）来组织、运作或管理；使之成为会众制的（尤指公理宗传统）"},"examples":[{"en":"Some reformers wanted to congregationalize the church so that each local group could choose its own leaders.","zh":"一些改革者希望把教会改为会众制，这样每个地方团体都可以自行选出领袖。"},{"en":"The proposal aimed to congregationalize decision-making rather than leave power with a central authority.","zh":"该提案旨在让决策更会众化，而不是把权力留在中央权威手中。"}]},{"partOfSpeech":"vi.","definition":{"en":"to adopt or shift toward congregational governance in a church or religious organization","zh":"（教会/宗教组织）实行或转向会众制治理"},"examples":[{"en":"Over time, the community congregationalized and began voting on major changes.","zh":"随着时间推移，该团体转向会众制，并开始对重大变更进行投票表决。"}]}],"synonyms":["adopt congregational governance","decentralize (in church governance)","make member-led"],"phonetic":"/kənˌɡriːɡəˈʃəˌnaɪz/","extraExplanation":["这个词非常少见，多见于宗教史、教会治理或学术讨论中。它由“congregation（会众）”加动词后缀“-ize”构成，意思类似“使……化/使……采取某种制度”。日常英语里更常用的表达是“adopt congregational governance（采用会众制治理）”或“become Congregational（成为公理宗/会众制）”。"]}
{"word":"congregationally","summary":{"en":"“Congregationally” means “as a congregation; with the whole group participating,” especially in a worship setting.","zh":"“congregationally”意为“以会众（群体）共同参与的方式”，尤用于宗教礼拜场景。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that involves a congregation (a group of people gathered for worship or a community acting together).","zh":"以会众（聚会敬拜的一群人）或群体共同参与的方式；以集体（会众）形式。"},"examples":[{"en":"The hymn was sung congregationally, with everyone joining in.","zh":"这首赞美诗是以会众齐唱的方式唱的，大家都一起加入。"},{"en":"They prayed congregationally at the end of the service.","zh":"礼拜结束时，他们以会众共同祷告的方式祷告。"}]}],"synonyms":["collectively","as a group","in unison","communally"],"phonetic":"/ˌkɑŋɡrəˈɡeɪʃənəli/","extraExplanation":["“congregationally”多见于宗教语境，尤其描述“会众一起做某事”，如齐唱（congregational singing）、共同祷告等。","它也可与“Congregational”相关（指某些教会的组织传统/教会体制），但在日常用法里更常见的是泛指“以会众共同参与的方式”。"]}
{"word":"Congregationer","summary":{"en":"A congregationer is a person who belongs to or attends a congregation, especially in a church.","zh":"congregationer 指会众成员，尤其是教会礼拜或宗教聚会的参加者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A member of a congregation; a person who regularly attends a particular church or religious assembly.","zh":"会众成员；某个教会或宗教聚会的参加者（常指经常参加的人）。"},"examples":[{"en":"As a congregationer, she volunteers every Sunday after the service.","zh":"作为会众的一员，她每个星期天礼拜后都会做志愿服务。"},{"en":"The pastor thanked the congregationers for supporting the food drive.","zh":"牧师感谢会众成员对食物募捐活动的支持。"}]}],"synonyms":["congregant","member of the congregation","churchgoer"],"phonetic":"/ˌkɑŋɡrəˈɡeɪʃənər/","extraExplanation":["“congregationer”在现代英语中不太常见，更常用的说法是“member of the congregation”或“congregant”。在写作和新闻报道中，“congregant”更自然。"]}
{"word":"congregationer","summary":{"en":"A congregationer is a person who is part of a religious congregation and attends its services.","zh":"congregationer 指宗教会众，即参加礼拜/聚会的成员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who belongs to and regularly attends a church or other religious congregation; a member of a congregation.","zh":"（教会或宗教）会众；经常参加礼拜/聚会的信徒。"},"examples":[{"en":"The congregationer greeted the pastor after Sunday service.","zh":"这位会众在周日礼拜后向牧师致意。"},{"en":"As a new congregationer, she joined a small Bible study group.","zh":"作为新来的会众，她加入了一个小型查经小组。"}]}],"synonyms":["congregant","church member","member of the congregation","parishioner"],"phonetic":"/ˌkɑŋɡrəˈɡeɪʃənər/","extraExplanation":["“congregationer”在现代英语中不算常用；更常见的说法是“member of the congregation”或直接说“congregant”。但在一些宗教语境、较正式或较旧的用法中仍可见。"]}
{"word":"congregationist","summary":{"en":"A Congregationist is a member of a self-governing Protestant church tradition (Congregationalism), or something related to that tradition.","zh":"Congregationist 指公理宗（会众制）信徒，也可作形容词表示“与公理宗相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who belongs to, supports, or follows Congregationalism (a Protestant Christian tradition in which each local church governs itself).","zh":"公理宗（会众制）信徒；属于或支持公理宗的人（新教传统之一，强调每个地方教会自治）"},"examples":[{"en":"Her grandparents were Congregationists in New England.","zh":"她的祖父母在新英格兰是公理宗信徒。"},{"en":"The town’s early leaders were mostly Congregationists.","zh":"这个小镇早期的领袖大多是公理宗人士。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Congregationalism or to Congregationist churches.","zh":"与公理宗（会众制）有关的；公理宗教会的"},"examples":[{"en":"They attended a Congregationist service on Sunday.","zh":"他们周日参加了公理宗的礼拜。"},{"en":"The museum has records of Congregationist communities.","zh":"博物馆保存着公理宗社群的档案记录。"}]}],"synonyms":["Congregationalist","member of a Congregational church","Protestant (broader)"],"phonetic":"ˌkɑŋɡrɪˈɡeɪʃənɪst","extraExplanation":["“Congregationist / Congregationalist”都常见：前者多指个人（信徒/成员），后者也常指传统或教会体系（Congregationalism）。日常使用中两者有时会互换，但写作时更推荐用“Congregationalism（公理宗传统）/ Congregational church（公理宗教会）”来表达制度或教会。","历史文化上，公理宗在英格兰清教徒运动中发展，并对北美殖民时期的新英格兰（如马萨诸塞）影响很大；强调地方教会由会众共同决定事务，而非由主教或中央教会层级统一管理。"]}
{"word":"congregations","summary":{"en":"“Congregations” means groups/communities of people gathered together, most often for religious worship, but sometimes for any shared purpose.","zh":"“Congregations”指聚集在一起的人群/团体，最常指宗教礼拜的会众，也可泛指因共同目的而定期聚集的团体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"groups of people gathered together, especially for religious worship (plural of \"congregation\")","zh":"聚会的人群（尤指宗教礼拜的会众；“congregation”的复数）"},"examples":[{"en":"The church has two congregations: one meets in the morning and one in the evening.","zh":"这座教堂有两个会众：一个上午聚会，一个晚上聚会。"},{"en":"Different congregations organized food drives for families in need.","zh":"不同的会众组织了食品募捐来帮助有需要的家庭。"}]},{"partOfSpeech":"n.","definition":{"en":"communities of people who regularly meet and share a common purpose (not necessarily religious)","zh":"定期聚集、因共同目的而形成的团体（不一定是宗教团体）"},"examples":[{"en":"The city supports several congregations of artists and musicians.","zh":"这座城市支持多个艺术家和音乐人的团体。"},{"en":"Online congregations can form around hobbies like gaming or cooking.","zh":"网络上也会围绕游戏或烹饪等爱好形成“社群/团体”。"}]}],"synonyms":["assemblies","gatherings","communities","churches (in religious context)","fellowships"],"phonetic":"/ˌkɑŋɡrəˈɡeɪʃənz/","extraExplanation":["“congregation”在英语里最常见的语境是宗教：既可以指“会众”（参加礼拜的人），也可以指“一个地方教会/教会团体”（例如某个教堂的成员整体）。复数“congregations”常用于谈多个教会团体或多个聚会人群。","词根来自拉丁语，含义与“聚集到一起”有关；因此在非宗教语境中也可用来表示因共同兴趣或目标而形成的团体，但正式程度通常比“group/community”更高一点。"]}
{"word":"congregative","summary":{"en":"Concerning or causing people/things to gather into a group (rare in modern use).","zh":"表示与聚集有关或促使聚集（现代用法较少见）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"tending to gather people or things into a group; relating to coming together as a crowd or assembly.","zh":"倾向于把人或事物聚集在一起的；与聚集、集会有关的。"},"examples":[{"en":"Festivals have a congregative effect on small towns, bringing neighbors together.","zh":"节日对小镇有一种“聚集效应”，把邻居们聚到一起。"},{"en":"The new park became a congregative space where families met on weekends.","zh":"新公园成了一个具有“聚集性”的空间，周末很多家庭会来相聚。"}]}],"synonyms":["gathering","assembling","collective","group-forming"],"phonetic":"/kɑnˈɡrɛɡətɪv/","extraExplanation":["“congregative”在现代英语中比较少见，更常用的是“congregating”（正在聚集的）或“congregational”（与教会会众/会众制度有关的）。","词根来自拉丁语 con-（一起）+ greg-（群、群体），同根词有：congregate（聚集）、gregarious（合群的）。"]}
{"word":"congregativeness","summary":{"en":"Congregativeness means a tendency to gather with others or be social in groups.","zh":"Congregativeness 指“喜欢群聚、与他人结伴”的倾向或性质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the tendency or quality of gathering together in a group; sociability or gregariousness","zh":"群聚性；爱结群、喜欢与人聚在一起的倾向（社交性/合群性）"},"examples":[{"en":"Humans often show strong congregativeness, especially during festivals and celebrations.","zh":"人类常常表现出很强的群聚性，尤其是在节日和庆典期间。"},{"en":"The park’s design encourages congregativeness by providing open spaces and benches.","zh":"这个公园的设计通过提供开阔空间和长椅来促进人们聚集与交流。"}]}],"synonyms":["gregariousness","sociability","sociality","tendency to congregate"],"phonetic":"/kənˈɡriːɡətɪvnəs/","extraExplanation":["“congregativeness”是比较少见、偏书面/学术的名词，来自 congregate（聚集）+ -iveness（表示“性质/倾向”的名词后缀）。日常英语里更常用 gregariousness（合群/爱社交）或 sociability（社交性）。"]}
{"word":"congregator","summary":{"en":"A congregator is someone who gathers with others, sometimes specifically a person attending a religious congregation.","zh":"congregator 指聚集的人，有时特指参加宗教聚会的会众成员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who gathers with others in a group; someone who congregates.","zh":"聚集者；聚集在一起的人。"},"examples":[{"en":"During the festival, congregators filled the town square.","zh":"节日期间，聚集者挤满了城镇广场。"},{"en":"The park is popular with congregators on warm evenings.","zh":"天气温暖的傍晚，这座公园很受聚集者欢迎。"}]},{"partOfSpeech":"n.","definition":{"en":"A member of a religious congregation (a person who attends a church, synagogue, etc.).","zh":"（宗教）会众成员；参加教会/会堂等聚会的人。"},"examples":[{"en":"Congregators listened quietly to the sermon.","zh":"会众安静地聆听布道。"},{"en":"After the service, congregators talked outside the church.","zh":"礼拜结束后，会众在教堂外交谈。"}]}],"synonyms":["gatherer","attendee","participant","congregant (religious)","worshipper (religious)"],"phonetic":"/ˈkɑŋɡɹəˌɡeɪtɚ/","extraExplanation":["“Congregator”来自动词“congregate”（聚集）。在现代英语里，它不如“member of the congregation / worshipper / attendee”常见；新闻或正式写作中偶尔用来指“聚集的人群”。","在宗教语境里更常见的表达是“congregant”（会众成员）。如果你要说“教会的会众”，用“congregant(s)”通常更地道。"]}
{"word":"congresional","summary":{"en":"“Congresional” is a misspelling; the correct word is “congressional,” meaning related to (especially U.S.) Congress.","zh":"“congresional”是拼写错误；正确形式为“congressional”，意思是“与（尤指美国）国会有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Correct spelling: **congressional**) relating to a congress, especially the U.S. Congress (the national law-making body).","zh":"（正确拼写：**congressional**）与“国会”有关的，尤指与美国国会（国家立法机构）有关的。"},"examples":[{"en":"The senator spoke at a congressional hearing.","zh":"这位参议员在一场国会听证会上发言。"},{"en":"Congressional leaders met to discuss the budget.","zh":"国会领导人会面讨论预算。"},{"en":"She works for a congressional committee.","zh":"她在一个国会委员会工作。"}]}],"synonyms":["legislative","parliamentary","of Congress"],"phonetic":"/kənˈɡrɛʃənəl/","extraExplanation":["“congresional”常见于拼写错误；标准拼写是 **congressional**（中间有两个 s）。","在美国语境中，**Congress** 通常特指联邦立法机构（参议院 + 众议院）。因此 **congressional** 常出现在新闻里，如 *congressional hearing/committee/election* 等固定搭配。"]}
{"word":"Congreso","summary":{"en":"“Congreso” means “congress”: either a national law‑making body or a large formal conference.","zh":"“Congreso”意为“国会”或“大会/会议”（大型正式会议）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a congress; the national law‑making body in some countries (especially the U.S. Congress)","zh":"国会；（某些国家的）立法机关（尤指美国国会）"},"examples":[{"en":"The bill is now in Congress for debate.","zh":"这项法案正在国会中辩论。"},{"en":"In Spanish, “Congreso” often refers to the lower house, like the Congreso de los Diputados in Spain.","zh":"在西班牙语中，“Congreso”常指下议院，例如西班牙的“众议院（Congreso de los Diputados）”。"}]},{"partOfSpeech":"n.","definition":{"en":"a large formal meeting (a conference), especially for professionals or academics","zh":"（大型正式的）会议；大会；学术/行业会议"},"examples":[{"en":"She presented her research at an international congreso.","zh":"她在一次国际大会上展示了她的研究成果。"},{"en":"We’re going to a medical congress next week.","zh":"我们下周要参加一个医学大会。"}]}],"synonyms":["Congress","legislature","parliament","conference","convention","assembly"],"phonetic":"/ˈkɑŋɡrəs/","extraExplanation":["“Congreso”是西班牙语名词，常见对应英语的“Congress”（国会）或“conference/congress”（大会）。在新闻或正式文件中，如果指某个国家的具体机构，通常会大写（如“El Congreso”）。","词源上与英语“congress”同源，来自拉丁语，核心含义是“聚集在一起（开会/商议）”。"]}
{"word":"congreso","summary":{"en":"“Congreso” is Spanish for “congress” (a law-making body) or a “conference/convention.”","zh":"“congreso”是西语，意思是“国会/立法机关”，也可指“大会/会议/代表大会”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) a congress; the national law-making body (like the U.S. Congress)","zh":"（西语）国会；立法机关（类似美国的“国会”）"},"examples":[{"en":"The bill was debated in the congreso.","zh":"这项法案在国会里被辩论。"},{"en":"Members of the congreso voted on the new reform.","zh":"国会议员对这项新改革进行了投票。"}]},{"partOfSpeech":"n.","definition":{"en":"(Spanish) a conference or convention where people meet for a specific purpose","zh":"（西语）大会；会议；代表大会（为特定目的召开的集会）"},"examples":[{"en":"She presented her research at an international congreso.","zh":"她在一场国际大会上展示了她的研究成果。"},{"en":"They organized a congreso on public health.","zh":"他们组织了一场关于公共卫生的大会。"}]}],"synonyms":["congress","conference","convention","assembly"],"phonetic":"/kɑnˈɡreɪsoʊ/","extraExplanation":["“congreso”是西班牙语词，在不同国家的政治体系中可能指不同机构：例如在一些国家它可以泛指国家立法机关（有时包含参议院、众议院等），也可以特指某一院或“国会大厦/国会系统”。","英语里更常用的对应词是“Congress”（国会）或“conference/convention/congress”（会议/大会）。在学术语境中，英语的“congress”也能表示大型专业会议，和西语“congreso”很接近。"]}
{"word":"Congress","summary":{"en":"“Congress” most often means the U.S. national legislature; more generally, it can mean a formal conference or meeting.","zh":"“Congress”最常指美国国会；也可泛指正式的大会或会议。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the national lawmaking body of the United States, made up of the Senate and the House of Representatives","zh":"（美国）国会；国家立法机关，由参议院和众议院组成"},"examples":[{"en":"Congress passed a new bill on healthcare.","zh":"国会通过了一项新的医疗法案。"},{"en":"The President addressed Congress in a televised speech.","zh":"总统在电视讲话中向国会发表讲话。"}]},{"partOfSpeech":"n.","definition":{"en":"a formal meeting or conference where people gather to discuss a topic (often professional or political)","zh":"（正式的）大会；会议（常指专业或政治领域的代表会议）"},"examples":[{"en":"She presented her research at an international congress.","zh":"她在一次国际大会上展示了她的研究成果。"},{"en":"The city hosted a medical congress this year.","zh":"这座城市今年举办了一场医学大会。"}]}],"synonyms":["legislature","parliament (general)","assembly","conference","convention"],"phonetic":"/ˈkɑŋ.ɡrəs/","extraExplanation":["在美式英语里，“Congress”（首字母大写）通常特指美国国会；小写“congress”更常指一般性的“大会/会议”。","美国国会是两院制（bicameral）：Senate（参议院）与 House of Representatives（众议院）。很多新闻里会用“on Capitol Hill（在国会山）”来代指国会活动。"]}
{"word":"congress","summary":{"en":"“Congress” most commonly means the U.S. national legislature, and more generally it can mean a large formal conference.","zh":"“Congress”最常指美国国会（联邦立法机关）；也可泛指大型正式会议或大会。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the national law-making body of the United States (made up of the Senate and the House of Representatives)","zh":"（美国）国会；国家立法机关（由参议院和众议院组成）"},"examples":[{"en":"Congress passed a new bill on healthcare.","zh":"国会通过了一项新的医疗法案。"},{"en":"The President will address Congress tonight.","zh":"总统今晚将向国会发表讲话。"}]},{"partOfSpeech":"n.","definition":{"en":"a formal meeting or series of meetings where people discuss a particular topic (often international or professional)","zh":"（讨论某一主题的）大会；会议（常指国际性或专业性会议）"},"examples":[{"en":"She presented her research at a medical congress.","zh":"她在医学大会上展示了她的研究成果。"},{"en":"Delegates met at an international congress to discuss climate policy.","zh":"代表们在一次国际大会上讨论气候政策。"}]}],"synonyms":["legislature","parliament (general sense)","assembly","conference","convention"],"phonetic":"/ˈkɑŋɡrəs/","extraExplanation":["“Congress”来自拉丁语 con-（一起）+ gradi（行走、前进），原义接近“走到一起”，所以也可指“大会、会议”。","在美国语境里，“Congress”几乎默认指联邦立法机构；而“a congress”更常指某个主题的会议（如 a science congress）。","常见搭配：Congressional (adj.)（国会的）；congressman/congresswoman（众议员，口语中也常用 member of Congress）。"]}
{"word":"congressed","summary":{"en":"“Congressed” is a rare past form of “congress,” meaning “met/assembled in a formal conference,” or less commonly “brought together.”","zh":"“congressed”是较少见的“congress”的过去式/过去分词，表示“（正式）集会/开大会”，较少也可表示“把……召集到一起”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"met or assembled together (especially in a formal meeting or conference); past tense/past participle of “congress” (rare).","zh":"（尤指正式会议/大会）聚会、集会；“congress”的过去式/过去分词（较少用）。"},"examples":[{"en":"Leaders from several countries congressed to discuss trade.","zh":"多个国家的领导人聚集开会讨论贸易。"},{"en":"The delegates congressed in Geneva for the annual talks.","zh":"代表们在日内瓦集会参加年度会谈。"}]},{"partOfSpeech":"vt.","definition":{"en":"brought together into one group or gathering; past tense/past participle of “congress” (rare).","zh":"把……召集到一起、使……聚合；“congress”的过去式/过去分词（较少用）。"},"examples":[{"en":"The organizer congressed experts from different fields into one panel.","zh":"组织者把不同领域的专家召集到同一个讨论小组。"}]}],"synonyms":["met","gathered","assembled","convened"],"phonetic":"/ˈkɑŋɡrɛst/","extraExplanation":["“congressed”在现代英语里很少见。日常更常用的表达是：people/representatives **met**, **gathered**, **assembled**, 或 **held a congress/conference**。","注意不要和美国的“Congress（国会）”混淆：写新闻或日常表达时，通常说 **Congress passed a bill**（国会通过法案），而不是用动词 *congress*。","这个动词来自名词 *congress*（大会、会议），整体语感偏正式、书面化。"]}
{"word":"congresser","summary":{"en":"“Congresser” is a rare word meaning a member of the U.S. Congress; “member of Congress” or “congressperson” is much more common.","zh":"“congresser”是个很少见的词，意思是“美国国会议员”；更常用的说法是“member of Congress”或“congressperson”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon) A member of the U.S. Congress; a congressperson (especially a Representative or Senator).","zh":"（不常用）美国国会议员；国会成员（尤指众议员或参议员）。"},"examples":[{"en":"The congresser promised to support the new education bill.","zh":"这位国会议员承诺支持新的教育法案。"},{"en":"Local voters wrote letters to their congresser about the policy change.","zh":"当地选民就政策变化给他们的国会议员写了信。"}]}],"synonyms":["member of Congress","congressperson","congressman","congresswoman","Representative","Senator"],"phonetic":"/kənˈɡrɛsər/","extraExplanation":["“congresser”在现代英语中非常少见，实际写作与新闻里更常用的是：**member of Congress**（最常见、正式）、**congressperson**（性别中性）、**congressman / congresswoman**（更传统、带性别）。","在美式英语里，日常表达中也常说 **Representative (Rep.)** 指“众议员”，**Senator (Sen.)** 指“参议员”。如果你不确定对方属于哪一院，用 **member of Congress** 最稳妥。"]}
{"word":"congresses","summary":{"en":"“Congresses” is the plural of “congress,” meaning either large formal meetings or (often in U.S. contexts) different terms/sessions of the U.S. Congress.","zh":"“Congresses”是“congress”的复数，可指大型正式大会；在美国语境中常指不同届次/任期的美国国会。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a formal meeting or series of meetings where representatives discuss and decide on important issues; also, the organization or event itself","zh":"（代表参加的）大会；（一系列）正式会议，用来讨论并决定重要议题；也可指该组织或会议活动本身"},"examples":[{"en":"Scientists from many countries attended international congresses to share new research.","zh":"许多国家的科学家参加国际大会，分享新的研究成果。"},{"en":"The city often hosts large congresses at the convention center.","zh":"这座城市经常在会展中心举办大型大会。"}]},{"partOfSpeech":"n.","definition":{"en":"the plural of “Congress,” often meaning different sessions or terms of the U.S. Congress (the national law-making body)","zh":"“Congress（美国国会）”的复数，常指美国国会的不同届次/任期（国家立法机构）"},"examples":[{"en":"Across different Congresses, the law has been debated many times.","zh":"在不同届国会中，这项法律已被多次辩论。"},{"en":"Some bills pass quickly in one Congress but fail in the next.","zh":"有些法案在某一届国会很快通过，但在下一届却失败。"}]}],"synonyms":["assemblies","conventions","conferences","summits"],"phonetic":"/ˈkɑŋɡrəsɪz/","extraExplanation":["“Congress”在美国语境里通常特指美国国会（由参议院 Senate 和众议院 House of Representatives 组成）。说“different Congresses”时，往往是在谈不同的国会届次（两年一届）。","在更广泛的英语里，“a congress”常指大型正式会议（类似 conference，但语气更“正式/代表性更强”，也常见于学术或国际组织场合）。"]}
{"word":"congressing","summary":{"en":"“Congressing” means meeting formally in an assembly or negotiating together; it’s the -ing form of the rare verb “congress.”","zh":"“congressing”指以正式会议/代表大会的方式集会或商议、谈判；是较少见动词“congress”的 -ing 形式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"meeting or gathering in a formal group (such as a congress or assembly); the -ing form of “congress.”","zh":"（以正式会议/代表大会形式）开会、集会；“congress”的现在分词/动名词形式。"},"examples":[{"en":"Delegates are congressing this week to discuss the new policy.","zh":"代表们本周正在开会讨论新政策。"},{"en":"The countries began congressing to negotiate a peace agreement.","zh":"这些国家开始举行会议来谈判和平协议。"}]},{"partOfSpeech":"v.","definition":{"en":"bringing people or groups together in discussion or negotiation; taking part in such a meeting.","zh":"使各方聚在一起进行商议/谈判；参与正式商议。"},"examples":[{"en":"The minister spent months congressing regional leaders to reduce tensions.","zh":"部长花了几个月召集各地区领导人商谈以缓和紧张局势。"},{"en":"Congressing with experts, the committee revised its recommendations.","zh":"委员会与专家们商议后，修改了建议。"}]}],"synonyms":["meeting","gathering","convening","assembling","conferring","negotiating"],"phonetic":"/kənˈɡrɛsɪŋ/","extraExplanation":["“congress”作动词在现代英语里不常见，更常用的表达是：meet (in conference), hold a congress, convene, gather, negotiate。你在正式写作中看到“congressing”时，通常带一点“庄重/正式开会”的语气。","拼写上容易和美国的名词“Congress（国会）”混淆：动词congress并不等于“在国会里开会”，而是泛指“像代表大会那样集会/商议”。"]}
{"word":"congressional","summary":{"en":"“Congressional” means related to a congress—most commonly the U.S. Congress—or to congressional districts/elections.","zh":"“congressional”表示“与国会有关的”，最常指与美国国会有关，也可指与国会选区或国会选举相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to a congress, especially the U.S. Congress (the national law-making body).","zh":"与国会有关的；（尤指）与美国国会（国家立法机关）有关的。"},"examples":[{"en":"The bill faced strong congressional opposition.","zh":"这项法案遭到国会方面的强烈反对。"},{"en":"She testified at a congressional hearing.","zh":"她在国会听证会上作证。"},{"en":"The president met with congressional leaders to discuss the budget.","zh":"总统与国会领导人会面讨论预算。"}]},{"partOfSpeech":"adj.","definition":{"en":"Of or belonging to a congressional district or election (especially in the U.S.).","zh":"与（美国）国会选区或国会选举有关的。"},"examples":[{"en":"He launched his campaign for a congressional seat.","zh":"他发起竞选，争取一个国会议席。"},{"en":"The debate focused on key issues in the congressional race.","zh":"辩论聚焦于这场国会选举中的关键议题。"}]}],"synonyms":["legislative","parliamentary (more common in the UK context)"],"phonetic":"/kənˈɡrɛʃənəl/","extraExplanation":["在美国语境中，“congressional”通常特指美国国会（Congress），由参议院（Senate）和众议院（House of Representatives）组成，因此常见搭配有：congressional hearing（国会听证会）、congressional committee（国会委员会）、congressional leaders（国会领导层）。","“Congress”与“Congressional”在新闻里出现频率很高；如果你看到“congressional district”，指的是众议院选区（每个选区选出一名众议员）。"]}
{"word":"congressionalist","summary":{"en":"A congressionalist is someone aligned with or supportive of Congress, especially the U.S. Congress (a relatively uncommon word).","zh":"congressionalist 指支持或倾向（尤其是美国）国会的人（相对少用的词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who supports or is aligned with Congress (especially the U.S. Congress); a pro-Congress politician or advocate","zh":"支持或拥护（尤其是美国）国会的人；亲国会的政治人物或倡导者"},"examples":[{"en":"The editorial praised the mayor as a congressionalist who worked closely with lawmakers in Washington.","zh":"这篇社论称赞市长是亲国会的人物，能与华盛顿的立法者密切合作。"},{"en":"During the debate, congressionalists argued that only Congress should control spending.","zh":"在辩论中，亲国会一方主张只有国会才应当掌握财政支出。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical/less common) someone connected with a “Congress” movement or party in a particular country or period","zh":"（历史用法/较少见）与某一国家或某一时期名为“Congress（国民大会/国会）”的运动或政党有关的人"},"examples":[{"en":"In older texts, the term sometimes appears in discussions of party factions and congressionalists.","zh":"在较早的文本中，这个词有时会出现在有关党派派系与“亲国民大会/亲国会”人士的讨论里。"}]}],"synonyms":["pro-Congress advocate","Congress supporter","pro-legislative","member of Congress (not the same, but often what people mean)"],"phonetic":"/kənˈɡrɛʃənəlɪst/","extraExplanation":["“congressionalist”在现代英语里不算常用词；表达“国会议员”更常见的是“member of Congress / congressman / congresswoman / representative / senator”。如果想表达“支持国会、倾向国会权力”的立场，也更常用“pro-Congress”或更具体的政治描述。","词形结构：congress + -ional + -ist。-ist 常表示“……主义者/支持者/从事者”。因此它更像“拥护国会的人”，而不一定等同于“国会议员”。"]}
{"word":"congressionally","summary":{"en":"“Congressional” + “-ly”: meaning “in a way that involves or is authorized by the U.S. Congress.”","zh":"“congressional（国会的）”加“-ly”，表示“以涉及或由（美国）国会授权的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that involves the U.S. Congress, or is decided, authorized, or done by Congress.","zh":"以（美国）国会的方式；由国会参与、决定、授权或实施地。"},"examples":[{"en":"The funding was congressionally approved before it could be spent.","zh":"这笔资金在支出前必须经过国会批准。"},{"en":"The agency is congressionally mandated to publish an annual report.","zh":"该机构被国会要求必须发布年度报告。"},{"en":"They argued that the program should be congressionally reviewed.","zh":"他们主张该项目应接受国会审查。"}]}],"synonyms":["by Congress","legislatively","under congressional authority"],"phonetic":"/kənˈɡrɛʃənəli/","extraExplanation":["“congressionally”多见于新闻、法律与政府文件，通常与 approve（批准）、mandate（授权/强制要求）、fund（拨款）、authorize（授权）、oversee（监督）等动词搭配。","它主要指美国的 Congress（国会）。在其他国家语境里一般不会用这个词，而会用如 “parliamentarily”（议会地，较少见）或直接说 “by Parliament / by the legislature”。"]}
{"word":"congressionist","summary":{"en":"A congressionist is a member or supporter of a congress, especially a national legislature; it can also be used as an adjective meaning “related to congress.”","zh":"congressionist 指国会的成员或支持者（常指国家立法机关），也可作形容词表示“与国会有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of a congress (a national law-making group), or someone who supports the work or policies of a congress","zh":"国会议员；（广义）国会的成员；或支持国会工作/政策的人"},"examples":[{"en":"Several congressionists spoke against the proposed budget cuts.","zh":"几位国会议员发言反对拟议的预算削减。"},{"en":"As a congressionist, she focused on healthcare and education.","zh":"作为一名国会议员，她主要关注医疗和教育。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to or typical of a congress or its members","zh":"国会的；与国会议员有关的；国会式的"},"examples":[{"en":"They held a meeting to discuss congressionist priorities for the next session.","zh":"他们开会讨论下次会期的国会优先事项。"},{"en":"The article criticized congressionist decision-making.","zh":"这篇文章批评了国会式的决策方式。"}]}],"synonyms":["member of Congress","legislator","lawmaker","representative","senator"],"phonetic":"/kənˈɡrɛʃənɪst/","extraExplanation":["“congressionist”在现代英语里不算常用；在美国语境中更常见的说法是“member of Congress”“Congressperson”（性别中立）或“Congressman/Congresswoman”。","在印度语境里，“congressionist”有时也指“印度国大党（Indian National Congress）的成员/支持者”，需要结合上下文判断。"]}
{"word":"congressist","summary":{"en":"A U.S. Congress member; more commonly said as “member of Congress” or “congressman/congresswoman.”","zh":"美国国会议员；更常见表达为“member of Congress”或“congressman/congresswoman”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person elected to the U.S. Congress, especially a member of the U.S. House of Representatives (also used informally for a senator).","zh":"美国国会议员，尤指众议院议员（口语中有时也泛指参议员）。"},"examples":[{"en":"She wrote to her congressist about student loan policy.","zh":"她写信给她所在选区的国会议员，讨论学生贷款政策。"},{"en":"The congressist held a town hall to answer questions from residents.","zh":"这位国会议员举行了选民见面会，回答居民的问题。"}]}],"synonyms":["member of Congress","congressman","congresswoman","U.S. representative","lawmaker","legislator"],"phonetic":"/ˈkɑŋɡrəsɪst/","extraExplanation":["“congressist”在英语里能被理解，但更常见、更标准的说法是“member of Congress”或“congressman / congresswoman”。如果想用更中性、更正式的表达，推荐使用“a U.S. representative”（众议员）或“a U.S. senator”（参议员）。","词形提示：美国“Congress”由两院组成：House of Representatives（众议院）和Senate（参议院）。严格说“congressman/congresswoman”通常指众议员；“senator”指参议员。"]}
{"word":"congressive","summary":{"en":"Conpressive (rare) means “related to a congress,” especially the U.S. Congress.","zh":"congressive（罕用）指“与大会/会议有关的”，尤其可指“与美国国会有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Relating to a congress: a formal meeting, conference, or the U.S. Congress.","zh":"（罕用）与“大会/会议”有关的；与（美国）国会有关的。"},"examples":[{"en":"The article used the rare adjective “congressive” to describe debates in Congress.","zh":"这篇文章用较罕见的形容词“congressive”来描述国会中的辩论。"},{"en":"They discussed conpressive matters at a congress of scientists. (Better: “congress-related” or “congressional.”)","zh":"他们在科学家大会上讨论与大会相关的事务。（更常用：congress-related 或 congressional。）"}]}],"synonyms":["congressional","congress-related","legislative"],"phonetic":"/kənˈɡrɛsɪv/","extraExplanation":["“congressive”在现代英语里非常少见，日常写作中通常用“congressional”（指美国国会的）或“of/related to the congress”（与大会/会议有关的）来表达。","词根来自“congress”（大会、会议、国会）。如果你看到“congressive”，往往是较旧的用法，或作者刻意用较冷门的词。"]}
{"word":"congressman","summary":{"en":"A congressman is a (male) member of the U.S. House of Representatives; sometimes it can refer more generally to a male member of a congress/legislature.","zh":"congressman 指（美国）众议员（男性），有时也泛指国会/立法机构的男性议员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a man who is a member of the U.S. House of Representatives (one of the two parts of the U.S. Congress)","zh":"（美国）众议员；美国国会众议院议员（男性）"},"examples":[{"en":"She wrote to her congressman to ask for help with a visa problem.","zh":"她写信给她所在选区的众议员，请他帮忙处理签证问题。"},{"en":"The congressman voted for the new education bill.","zh":"这位众议员投票支持新的教育法案。"}]},{"partOfSpeech":"n.","definition":{"en":"(more generally, sometimes used) a male member of a national congress or legislature","zh":"（较泛指）国会议员/立法机构议员（男性；有时也这样用）"},"examples":[{"en":"In some countries, a congressman may serve on a committee that reviews budgets.","zh":"在一些国家，国会议员可能在审查预算的委员会任职。"}]}],"synonyms":["Representative","member of Congress","congressperson","legislator"],"phonetic":"/ˈkɑŋɡrəs.mən/","extraExplanation":["在美国语境里，“congressman”通常特指“众议院议员（House Representative）”。更正式、更中性的说法常用“member of Congress”或直接说“Representative + 姓”（如“Representative Smith”）。对应的“参议员”是“senator”。","“Congress”由两院组成：众议院（House of Representatives）和参议院（Senate）。因此“congressman”并不等同于“senator”。","现代英语里，为避免性别限定，常见替代词包括“congressperson”（较少见但明确中性）以及“representative”（最常用、最自然）。"]}
{"word":"congressmen","summary":{"en":"“Congressmen” means members of the U.S. Congress (often men; commonly used but not fully gender-neutral).","zh":"“Congressmen”指美国国会议员（常指男性；常用但不完全性别中性）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A male member of the U.S. Congress (especially the House of Representatives); often used in everyday speech to mean any member of Congress, though the gender-neutral term is “member of Congress” or “representative.”","zh":"（尤指美国众议院的）男国会议员；口语中也常泛指国会议员，但更中性、正式的说法是“member of Congress（国会议员）”或“representative（众议员）”。"},"examples":[{"en":"The congressmen voted on the new budget proposal.","zh":"这些国会议员对新的预算提案进行了投票。"},{"en":"Several congressmen met with local leaders to discuss disaster relief.","zh":"几位国会议员与当地领导会面，讨论灾后救助。"},{"en":"In formal writing, many people prefer “members of Congress” instead of “congressmen.”","zh":"在正式写作中，许多人更喜欢用“members of Congress”而不是“congressmen”。"}]}],"synonyms":["members of Congress","representatives","lawmakers","legislators"],"phonetic":"/ˈkɑŋɡrəsˌmɛn/","extraExplanation":["在美国语境里，“Congress”由参议院（Senate）和众议院（House of Representatives）组成。严格来说，“congressman”多指众议员；参议员用“senator”。日常口语里有人用“congressman”泛指国会议员，但为了性别包容与准确性，常改用“member of Congress / representative / congressperson”。","复数“congressmen”对应单数“congressman”。如果要强调女性，常见“congresswoman”；更中性的复数可用“members of Congress”。"]}
{"word":"Congresso","summary":{"en":"“Congresso” is the Italian/Portuguese form of “Congress,” often kept in official names.","zh":"“Congresso”是意大利语/葡萄牙语的“国会/大会”说法，常在官方名称中保留。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(mainly in Italian or Portuguese) a congress; an official meeting or national law-making body. In English, people usually say “Congress” or “conference.”","zh":"（主要见于意大利语或葡萄牙语）“国会；代表大会/会议”。英语里通常用“Congress”或“conference”表达。"},"examples":[{"en":"Brazil’s Congresso Nacional meets in Brasília.","zh":"巴西的国民议会（Congresso Nacional）在巴西利亚开会。"},{"en":"The article uses the Portuguese word “Congresso,” but in English it would be “Congress.”","zh":"这篇文章用了葡语“Congresso”，但用英语说就是“Congress（国会）”。"}]}],"synonyms":["Congress","conference","assembly","parliament"],"phonetic":"/kənˈɡrɛsoʊ/","extraExplanation":["“Congresso”不是常见英语词，一般只在专有名词（机构名称、活动名称）或引用外语语境时出现。","拼写上与英语“Congress”相近，都来自拉丁语词根，核心含义是“聚集、集会”。"]}
{"word":"congresso","summary":{"en":"Congresso (Portuguese/Italian) means “congress”: either a large formal conference or a country’s legislature (often Brazil’s National Congress).","zh":"“congresso”（葡语/意语）相当于英语 congress，可指大型正式会议，也可指一国的立法机关（常见于巴西“国会”语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Portuguese/Italian) a congress: a large formal meeting or conference, often for a profession, political group, or organization.","zh":"（葡萄牙语/意大利语）“congresso”指“大会/代表大会/会议”：由某个行业、政党或组织召开的大型正式会议。"},"examples":[{"en":"She is presenting her research at the congresso next week.","zh":"她下周会在大会上展示她的研究。"},{"en":"The party held its annual congresso in the capital.","zh":"该政党在首都召开了年度代表大会。"}]},{"partOfSpeech":"n.","definition":{"en":"(in Portuguese, often capitalized) the national legislature of some countries; in Brazil, Congresso usually refers to the National Congress.","zh":"（葡语中常大写）某些国家的国家立法机关；在巴西语境里，Conresso 常指“巴西国会（National Congress）”。"},"examples":[{"en":"The bill was debated in the Congresso.","zh":"这项法案在国会中被辩论。"},{"en":"Thousands protested outside the Congresso building.","zh":"成千上万人在国会大楼外抗议。"}]}],"synonyms":["conference","convention","assembly","legislature","parliament"],"phonetic":"/ˈkɑŋɡrɛs/","extraExplanation":["“congresso”不是常见英语拼写，通常是葡萄牙语或意大利语形式。英语里对应的词是 congress（会议/代表大会）或 Congress（美国国会/某国国会，取决于语境）。","在新闻语境中，若你看到葡语写作“Congresso”，常常特指巴西的“国民议会”（National Congress），由众议院和联邦参议院组成。"]}
{"word":"congresswoman","summary":{"en":"A female member of the U.S. Congress (usually the House).","zh":"美国国会女性议员（通常指众议院议员）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman who is a member of the U.S. Congress, especially the House of Representatives; often used as a title.","zh":"美国国会议员（女性），尤指众议院议员；也常作称呼或头衔。"},"examples":[{"en":"I wrote a letter to my congresswoman about the new education bill.","zh":"我给我的女国会议员写信，谈了新的教育法案。"},{"en":"Congresswoman Lee spoke at the community meeting.","zh":"李女议员在社区会议上发言。"}]}],"synonyms":["Representative","member of Congress","lawmaker"],"phonetic":"/ˈkɑŋɡrəsˌwʊmən/","extraExplanation":["在美国政治语境里，“congresswoman”通常指联邦众议院的女性议员（Representative）。严格说“Congress”也包括参议院（Senate），但女性参议员更常被称为“senator”。","越来越多场合会用更中性的说法“member of Congress”或“Representative”，以避免性别标记；不过“congresswoman”在新闻和日常用法中仍很常见。"]}
{"word":"congresswomen","summary":{"en":"“Congresswomen” means women who serve as members of the U.S. Congress.","zh":"“Congresswomen”指在美国国会任职的女性议员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Women who are members of the U.S. Congress (either the House of Representatives or the Senate).","zh":"（美国）国会女议员；国会议员中的女性（可指众议员或参议员）。"},"examples":[{"en":"Several congresswomen spoke about education funding.","zh":"几位国会女议员就教育经费发表了意见。"},{"en":"The bill was introduced by a group of congresswomen from different states.","zh":"这项法案由来自不同州的一群国会女议员提出。"}]}],"synonyms":["women members of Congress","female lawmakers","congresswomen (plural of congresswoman)"],"phonetic":"/ˈkɑŋɡrəsˌwɪmən/","extraExplanation":["在美国英语里，传统上“congressman”常被当作泛指“国会议员”，但在强调性别或尊重当事人偏好时，会用“congresswoman”（女议员）或更中性的“member of Congress / representative / senator”。","“congresswomen”是复数形式；单数是“congresswoman”。注意：众议院成员常说“representative/Rep.”，参议院成员说“senator/Sen.”。"]}
{"word":"Congreve","summary":{"en":"Congreve is usually a proper name: most often the playwright William Congreve, and sometimes it refers to things named after Sir William Congreve (e.g., the Congreve rocket).","zh":"Congreve通常是专有名词：最常指剧作家威廉·康格里夫；也可指以威廉·康格里夫爵士命名的事物（如康格里夫火箭）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"William Congreve (1670–1729), an English playwright and poet, famous for witty Restoration comedies.","zh":"威廉·康格里夫（1670–1729），英国剧作家与诗人，以机智犀利的王政复辟时期（Restoration）喜剧著称。"},"examples":[{"en":"We read a scene from Congreve’s play The Way of the World in class.","zh":"我们在课上读了康格里夫的戏剧《世界的方式》中的一场戏。"},{"en":"Congreve is known for sharp dialogue and social satire.","zh":"康格里夫以犀利对白和社会讽刺而闻名。"}]},{"partOfSpeech":"adj.","definition":{"en":"(also in compounds) Referring to inventions linked to Sir William Congreve, especially the early 19th‑century “Congreve rocket.”","zh":"（也用于复合词）指与威廉·康格里夫爵士相关的发明，尤指19世纪早期的“康格里夫火箭”。"},"examples":[{"en":"The museum has a display about the Congreve rocket used in early warfare.","zh":"博物馆有一处展览介绍早期战争中使用的康格里夫火箭。"},{"en":"Some history texts mention Congreve rockets in the War of 1812.","zh":"一些历史教材会提到1812年战争中的康格里夫火箭。"}]}],"synonyms":["(proper name) William Congreve","Congreve rocket"],"phonetic":"/kənˈɡriːv/","extraExplanation":["“Congreve”在英语里最常见的文化指向是剧作家William Congreve，他的喜剧属于英国“王政复辟喜剧”（Restoration comedy）传统：语言机智、节奏快、常讽刺上流社会的婚恋与道德。","另一个常见指向是军事实物“Congreve rocket”（康格里夫火箭），与发明改良火箭武器的Sir William Congreve（1772–1828）相关；在历史语境中出现时通常与19世纪初的战争有关。"]}
{"word":"congreve","summary":{"en":"Congreve most often refers to William Congreve, a major English Restoration playwright; it is also used as a surname.","zh":"Congreve 多指英国王政复辟时期的重要剧作家威廉·康格里夫；也可作姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"William Congreve (1670–1729), an English playwright and poet best known for witty Restoration comedies such as The Way of the World.","zh":"威廉·康格里夫（1670–1729），英国剧作家与诗人，以机智犀利的王政复辟时期喜剧（如《世情》）最为著名。"},"examples":[{"en":"In our literature class, we read Congreve’s play The Way of the World.","zh":"在文学课上，我们读了康格里夫的戏剧《世情》。"},{"en":"Congreve is famous for sharp dialogue and social satire.","zh":"康格里夫以犀利对白和社会讽刺而闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"Congreve (surname): a family name, often referring to people connected to the English-speaking world.","zh":"Congreve（姓氏）：一个家族姓，在英语世界中可指不同人物。"},"examples":[{"en":"Her last name is Congreve, spelled C-O-N-G-R-E-V-E.","zh":"她的姓是 Congreve，拼作 C-O-N-G-R-E-V-E。"}]}],"synonyms":["William Congreve","Restoration comedy (context)","The Way of the World (context)"],"phonetic":"/ˈkɑŋɡriv/","extraExplanation":["“Congreve”最常在文学语境中指威廉·康格里夫。他属于英国“王政复辟喜剧”（Restoration comedy）传统，作品以机智对白、对上流社会礼仪与婚恋交易的讽刺见长。","你可能在英语名句中遇到与他相关的内容：常被引用的“Hell hath no fury like a woman scorned”出自他1677年的戏剧《The Mourning Bride》，中文常译为“被轻蔑的女人怒火最盛/地狱也不及……”（不同译本略有差异）。"]}
{"word":"congrid","summary":{"en":"A technical verb meaning to regrid/resample data onto a new grid.","zh":"一个技术用动词，指把数据重新网格化/重采样到新的网格上。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(computing, data science) to resample or interpolate data onto a new grid (for example, changing the resolution of an image or a climate dataset).","zh":"（计算机/数据科学）把数据重新采样或插值到新的网格上（例如改变图像或气候数据的分辨率）。"},"examples":[{"en":"We congrid the satellite data to a 1° × 1° grid before comparing it with the model.","zh":"在与模型比较之前，我们先把卫星数据 congrid 到 1° × 1° 的网格上。"},{"en":"After congrid-ing the array, the image looks smoother but may lose some detail.","zh":"对数组做 congrid 之后，图像更平滑了，但可能会丢失一些细节。"}]}],"synonyms":["regrid","resample","interpolate"],"phonetic":"/kɑnˈɡrɪd/","extraExplanation":["“congrid”不是日常英语词汇，更常见的通用说法是 regrid / resample / interpolate（重新网格化/重采样/插值）。","它常出现在编程或科研工具/代码中（例如处理栅格化数据、图像或数值模式输出），写法有时来自特定软件/函数名，因此在词典里不一定能查到。"]}
{"word":"Congridae","summary":{"en":"Congridae is the scientific family name for conger eels.","zh":"Congridae 是“海鳗科”的科学名称，指海鳗及其近缘种组成的一科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of marine eels (the conger eels), including the European conger and related species found in oceans worldwide","zh":"海鳗科；一类海洋鳗鱼的科（海鳗/康吉鳗一类），分布于全球海域"},"examples":[{"en":"Congridae includes several species of conger eels that live in coastal waters.","zh":"海鳗科包含多种海鳗类物种，常生活在近海水域。"},{"en":"Some Congridae are caught for food, but they can be difficult to handle because of their strong bodies.","zh":"有些海鳗科鱼类会被捕捞食用，但它们身体强壮，处理起来不太容易。"}]}],"synonyms":["conger eel family"],"phonetic":"/kɑnˈɡriːdiː/","extraExplanation":["“Congridae”是生物分类学中的“科名”，常用于学术文章、科普读物和海洋生物资料中；日常英语更常说“conger eel（海鳗）”。","词源上与“conger（海鳗）”有关；在拉丁化的科学命名中，动物“科”名常以“-idae”结尾（如 Felidae 猫科、Canidae 犬科）。"]}
{"word":"congridae","summary":{"en":"Congridae is the scientific family name for conger eels.","zh":"Congridae 是“海鳝科”的科学名称，指海鳝等一类鱼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of marine ray-finned fishes known as conger eels.","zh":"海鳝科；一类海洋辐鳍鱼，通常称为海鳝（conger eels）的分类学科名。"},"examples":[{"en":"The European conger belongs to the family Congridae.","zh":"欧洲海鳝属于海鳝科（Congridae）。"},{"en":"Many Congridae species live in deep water and hide in rocky crevices.","zh":"许多海鳝科物种生活在深海，并躲在岩石缝隙中。"}]}],"synonyms":["conger eel family"],"phonetic":"/kɑŋˈɡraɪdi/","extraExplanation":["“Congridae”是生物分类学用语（科名），常见于科普文章、海洋生物学教材或物种名录中。英文里常首字母大写表示正式科名。","后缀“-idae”常用于动物“科”的拉丁化命名（如 Felidae 猫科、Canidae 犬科）。"]}
{"word":"congrio","summary":{"en":"Congrio is a Spanish loanword meaning “conger eel,” used in English mainly in food and cultural contexts.","zh":"Congrio 是西班牙语借词，意思是“海鳗（康吉鳗）”，在英语中主要用于饮食与文化语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a conger eel; in English it is mostly used as a loanword from Spanish, especially when talking about Latin American or Spanish food.","zh":"海鳗（康吉鳗/海鳗的一种）；在英语中多作为西班牙语借词使用，常见于谈论西语地区的饮食或菜名时。"},"examples":[{"en":"The menu listed congrio (conger eel) as the catch of the day.","zh":"菜单上写着今日鲜鱼是 congrio（海鳗）。"},{"en":"In Chile, people may cook congrio in a soup or stew.","zh":"在智利，人们可能把 congrio 做成汤或炖菜。"}]}],"synonyms":["conger eel"],"phonetic":"/kɑnˈɡri.oʊ/","extraExplanation":["“congrio”主要是西班牙语词，在英语里并不常见，常见于餐厅菜单、旅行写作或介绍拉美饮食的文章中。","在智利文化语境里，“caldillo de congrio”（海鳗汤）很有名；诗人巴勃罗·聂鲁达（Pablo Neruda）写过《Oda al caldillo de congrio》（《海鳗汤颂》），使这道菜更具文化象征。"]}
{"word":"congroid","summary":{"en":"“Congroid” is a dated and potentially offensive term from older racial classifications related to the Congo region.","zh":"“Congroid”是旧式人种分类中的用词，与刚果地区相关，但已过时且可能冒犯。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(dated, offensive) Used in old racial/anthropological classifications to describe people thought to be from, or to resemble, populations of the Congo Basin in Central Africa.","zh":"（过时且可能冒犯）旧式人种/人类学分类用语，用来描述被认为来自刚果盆地（中非）或被认为“类似”该地区人群的人。"},"examples":[{"en":"The article used terms like “congroid,” which modern anthropology considers outdated and inappropriate.","zh":"那篇文章使用了“congroid”等词，而现代人类学认为这类说法过时且不恰当。"},{"en":"Many museums now revise older labels that described groups as “congroid” or similar categories.","zh":"许多博物馆如今会修订旧标签，避免用“congroid”等类别来描述群体。"}]},{"partOfSpeech":"n.","definition":{"en":"(dated, offensive) A person described using that old Congo-based racial category.","zh":"（过时且可能冒犯）按上述旧式“刚果人种”类别来称呼的人。"},"examples":[{"en":"You may see “congroid” in historical texts, but it’s better to use specific ethnic, national, or regional terms today.","zh":"你可能会在历史文本中看到“congroid”，但如今更建议使用具体的民族、国家或地区称呼。"}]}],"synonyms":["Congo-related","Central African (context-dependent)"],"phonetic":"/ˈkɑŋ.ɡrɔɪd/","extraExplanation":["这个词与19—20世纪早期的“人种类型学”有关，把复杂多样的人群简化为少数“种族类型”。这种做法在学术上已被广泛批评，也容易造成刻板印象与歧视。现代写作通常改用更准确的地理、国家或民族名称（如“刚果盆地地区的人群”“某具体民族/国家”）。"]}
{"word":"congrue","summary":{"en":"“Congrue” means to agree with or fit well with something; it’s a rare, formal/literary word.","zh":"“congrue”表示“与……一致/相符、协调”；属于较少见、偏正式或文学的用词。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to agree with, match, or be consistent with something; to fit well together","zh":"（与某事）一致；相符；协调；相配"},"examples":[{"en":"Her explanation doesn’t congrue with the facts we found.","zh":"她的解释与我们发现的事实不一致。"},{"en":"The design congrues nicely with the building’s old style.","zh":"这个设计与大楼的古典风格很协调。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare, literary) suitable or fitting; in harmony","zh":"（罕见／文学用法）适合的；恰当的；和谐的"},"examples":[{"en":"He chose words congrue to the solemn occasion.","zh":"他选择了与庄重场合相称的措辞。"}]}],"synonyms":["agree (with)","match","fit (with/in)","align (with)","correspond (with/to)","be consistent with"],"phonetic":"/kənˈɡruː/","extraExplanation":["“congrue”在现代英语里比较少见，更常用的是“agree with / match / be consistent with / fit (in) / align with”。","词源来自拉丁语 con-（一起）+ gruere（同意、契合），与常见词“congruent（全等的；一致的）”“congruity（协调；一致性）”同源。","用法提示：在正式写作中用“congrue with”表示“与……一致/相符”；口语更自然用“match”或“go with”。"]}
{"word":"congruence","summary":{"en":"Congruence means agreement or a good fit; in geometry, it means two shapes are exactly the same size and shape.","zh":"Congruence 指“一致/相符、很合拍”；在几何中指“全等”，即两个图形大小形状完全相同。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being in agreement or fitting well together; harmony or consistency between things","zh":"一致；相符；协调（事物之间彼此吻合、没有冲突）"},"examples":[{"en":"There was a surprising congruence between what he said and what he did.","zh":"他言行之间有一种令人惊讶的一致。"},{"en":"Good leaders create congruence between a company’s values and its everyday decisions.","zh":"优秀的领导者会让公司的价值观与日常决策保持一致。"}]},{"partOfSpeech":"n.","definition":{"en":"(geometry) the relationship between two shapes that are exactly the same in size and shape, even if they are rotated or flipped","zh":"（几何）全等（两个图形大小和形状完全相同，即使旋转或翻转也一样）"},"examples":[{"en":"Students learned how to prove the congruence of two triangles.","zh":"学生学习了如何证明两个三角形全等。"},{"en":"If two figures have congruence, one can be placed on the other perfectly.","zh":"如果两个图形全等，一个可以完全覆盖在另一个上。"}]}],"synonyms":["agreement","consistency","harmony","alignment","conformity"],"phonetic":"/kənˈɡruəns/","extraExplanation":["词源来自拉丁语 con-（一起）+ gruere（同意、相合），核心感觉是“彼此能对得上”。","常见搭配：congruence between A and B（A 与 B 的一致）；a sense of congruence（一种协调感）。","近义词区分：consistency（持续一致，强调时间维度）；harmony（和谐，强调感觉与关系）；agreement（同意，常用于观点与立场）。"]}
{"word":"congruences","summary":{"en":"Congruences are cases of exact matching (especially in geometry), or general agreement/consistency; in math they can mean modular equivalence.","zh":"congruences 指“全等（几何）”或更广义的“一致/相符”；在数学中也可指“同余（模意义下的等价）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Geometry) the state of two shapes being exactly the same in size and shape (they match when you slide, rotate, or flip one).","zh":"（几何）全等：两个图形在大小和形状上完全相同（通过平移、旋转或翻折可以重合）。"},"examples":[{"en":"The teacher asked us to prove the congruence of two triangles.","zh":"老师让我们证明两个三角形的全等。"},{"en":"If two figures have congruence, their corresponding sides are equal.","zh":"如果两个图形全等，它们的对应边相等。"}]},{"partOfSpeech":"n.","definition":{"en":"agreement or harmony between things; a good fit or consistency.","zh":"一致；协调；相符（指事物之间很契合、很一致）。"},"examples":[{"en":"There is a strong congruence between what she says and what she does.","zh":"她的言行非常一致。"},{"en":"The report shows congruence between the survey results and earlier research.","zh":"报告显示问卷结果与早期研究相一致。"}]},{"partOfSpeech":"n.","definition":{"en":"(Math) a relationship showing that two numbers leave the same remainder when divided by a number (modulo).","zh":"（数学）同余：两个数除以同一个数时余数相同的关系（模运算）。"},"examples":[{"en":"In modular arithmetic, 17 and 5 are in congruence modulo 12.","zh":"在模运算中，17 和 5 对 12 同余。"},{"en":"We use congruences to simplify calculations in number theory.","zh":"我们用同余来简化数论中的计算。"}]}],"synonyms":["agreement","consistency","harmony","alignment","match","equivalence"],"phonetic":"/kənˈɡruːəns/","extraExplanation":["“congruences”是名词复数；单数是“congruence”。在日常英语里，它常表示“（观点/行为/数据）一致、相符”；在数学与几何语境中更常见，分别指“同余”和“全等”。","词源来自拉丁语 con-（一起）+ gruere（一致、同意），核心含义一直是“彼此吻合、能对上”。在写作中，学术语体比口语更常用；口语里有时会用更简单的词如 “match / fit / agreement”。"]}
{"word":"congruencies","summary":{"en":"“Congruencies” means multiple matches/agreements, or (in math) multiple congruence relationships (congruent shapes or modular equivalences).","zh":"“Congruencies”指多个一致/相符之处；也可指（数学中的）多个全等或同余关系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) agreements or matches between things; situations where two things fit well together in meaning, style, or results.","zh":"（复数）一致性；相符之处；两件事在意义、风格或结果上很匹配的情况。"},"examples":[{"en":"There are many congruencies between the two reports, especially in their final conclusions.","zh":"两份报告有很多相符之处，尤其是在最终结论上。"},{"en":"She looked for congruencies between what he said and what he actually did.","zh":"她在寻找他所说的话和他实际行动之间的一致性。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural, mathematics) relationships showing that figures have the same shape and size, or that numbers are equivalent under a given rule (a “congruence”).","zh":"（复数，数学）全等关系；或在某个规则下数的等价关系（同余）。"},"examples":[{"en":"In geometry, we prove congruencies between triangles using side and angle information.","zh":"在几何中，我们用边和角的信息来证明三角形之间的全等关系。"},{"en":"The lesson introduced modular congruencies like 17 ≡ 2 (mod 5).","zh":"这节课介绍了模运算的同余关系，例如 17 ≡ 2（mod 5）。"}]}],"synonyms":["agreements","matches","correspondences","consistencies","alignments","congruences"],"phonetic":"/kənˈɡruən.siz/","extraExplanation":["“Congruencies”是名词复数，单数是“congruency”（较少用）或更常见的“congruence”。日常写作里更常看到“congruence”。","数学里：几何的“congruence”通常译为“全等”；数论里“congruence”常译为“同余”。两者中文不同，但英文同一个词，注意根据上下文判断。"]}
{"word":"congruency","summary":{"en":"Congruency means agreement or a good match—often between words and actions, or between shapes in geometry.","zh":"Congruency 指一致或匹配，常用于描述言行一致，或几何中的“全等”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being consistent and in agreement; a good match between things (such as ideas, words, actions, or shapes)","zh":"一致性；相符；匹配（指想法、语言与行为或形状之间的契合）"},"examples":[{"en":"There is a high level of congruency between what she says and what she does.","zh":"她说的和做的高度一致。"},{"en":"The therapist looked for congruency between the patient’s feelings and their facial expressions.","zh":"治疗师会观察病人的感受与面部表情是否一致。"},{"en":"In geometry, congruency means two shapes are the same size and shape.","zh":"在几何中，“congruency”指两个图形大小和形状完全相同。"}]}],"synonyms":["consistency","agreement","alignment","match","fit"],"phonetic":"/kənˈɡruənsi/","extraExplanation":["“congruency”常见于较正式或学术语境（心理学、教育学、商业沟通、数学/几何）。日常口语里更常用“consistency”“match”“fit”。","几何中的“congruency”强调“全等”（大小和形状都相同），不同于“similarity（相似）”只要求形状相同、大小可不同。","词源来自拉丁语前缀“con-（一起）”+“gruere（同意/协调）”；相关形容词是“congruent（相符的）”。"]}
{"word":"congruent","summary":{"en":"Congruent means “matching/consistent,” and in geometry it means “the same size and shape.”","zh":"Congruent 表示“相符/一致”；在几何中表示“全等（大小和形状相同）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of things or ideas) matching or agreeing well with each other; consistent and in harmony.","zh":"（事物或想法）相符的；一致的；协调的。"},"examples":[{"en":"Your actions should be congruent with your values.","zh":"你的行为应该与你的价值观相一致。"},{"en":"The data is congruent with what we observed in the field.","zh":"这些数据与我们在现场观察到的情况一致。"},{"en":"Her calm tone wasn’t congruent with the angry message.","zh":"她平静的语气与那条愤怒的信息不相符。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Geometry) having the same size and shape, even if turned or flipped.","zh":"（几何）全等的（大小和形状相同，即使旋转或翻转也一样）。"},"examples":[{"en":"These two triangles are congruent, so their corresponding sides are equal.","zh":"这两个三角形是全等的，所以对应边相等。"},{"en":"If two circles are congruent, they have the same radius.","zh":"如果两个圆全等，它们的半径相同。"}]}],"synonyms":["consistent","compatible","in agreement","harmonious","matching"],"phonetic":"/ˈkɑnɡruənt/","extraExplanation":["“congruent”常见于两类语境：日常/学术写作里表示“与……一致”（常搭配 with：be congruent with）；数学里表示“全等”。","在心理学与沟通中也常说“言行一致/表里一致”（例如情绪表达与语言信息一致），用来强调真实、可信或不矛盾。","相关词：congruence（名词：一致性/全等关系），incongruent（形容词：不一致的/不协调的）。"]}
{"word":"congruential","summary":{"en":"Congruential mainly means “related to modular congruence in math”; less commonly, it can mean “consistent or in agreement.”","zh":"congruential主要指“与数学中的同余（模运算）相关”；较少见时也可指“相一致、相符合”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to congruence in mathematics, especially to equations that are equal “modulo” a number (modular arithmetic).","zh":"（数学）与“同余”有关的，尤指在模运算（取模）下相等的关系或方程。"},"examples":[{"en":"A congruential equation like x ≡ 2 (mod 5) means x differs from 2 by a multiple of 5.","zh":"像 x ≡ 2 (mod 5) 这样的同余方程表示：x 与 2 的差是 5 的倍数。"},{"en":"The paper studies congruential properties of prime numbers.","zh":"这篇论文研究素数的同余性质。"}]},{"partOfSpeech":"adj.","definition":{"en":"Agreeing or consistent in a way that fits well together (a less common, more general sense).","zh":"（较少见）一致的；相符合的；相协调的。"},"examples":[{"en":"Her actions were congruential with her stated values.","zh":"她的行为与她所宣称的价值观相一致。"}]}],"synonyms":["modular (math)","congruent (related)","consistent (general sense)"],"phonetic":"/kənˌɡruˈɛnʃəl/","extraExplanation":["“congruential”最常见于数学语境，来自“congruence（同余）”。在初等数论里，同余写作 a ≡ b (mod n)，读作“a 与 b 在模 n 下同余”。","你可能会在“linear congruential generator（线性同余发生器，LCG）”中见到它：这是一种用递推公式产生伪随机数的经典方法。"]}
{"word":"congruently","summary":{"en":"“Congruently” means ‘in a way that matches or is consistent’; in math, ‘in a way that is congruent (same shape and size).’","zh":"“congruently”表示“以相符/一致的方式”；在数学中表示“以全等（形状大小相同）的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that matches, agrees, or is consistent with something else; in harmony.","zh":"以一致的方式；与……相符、相一致地；协调地。"},"examples":[{"en":"The results align congruently with our original hypothesis.","zh":"结果与我们最初的假设相一致。"},{"en":"She acted congruently with her values, even under pressure.","zh":"即使在压力下，她的行为也与自己的价值观保持一致。"},{"en":"The new policy fits congruently into the company’s long-term plan.","zh":"新政策与公司的长期规划相契合。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Math) In a way that is exactly the same in shape and size (able to match perfectly when placed on top of each other).","zh":"（数学）以全等的方式；形状和大小完全相同（可完全重合）地。"},"examples":[{"en":"In the diagram, the two triangles are congruently related.","zh":"在图中，这两个三角形是全等关系。"},{"en":"The pieces must be cut congruently to fit the pattern.","zh":"这些部件必须切割得完全一致，才能匹配这个样式。"}]}],"synonyms":["consistently","in line with","accordingly","harmoniously","compatibly"],"phonetic":"/kənˈɡruːəntli/","extraExplanation":["“congruently”来自形容词“congruent”（一致的/全等的）。在日常英语里更常用“consistently”“in line with”“in agreement with”等表达；“congruently”偏正式、书面，常见于学术写作、心理学（言行一致）、以及数学语境。"]}
{"word":"congruism","summary":{"en":"Congruism is a Catholic theological doctrine about God giving grace in fitting circumstances so it becomes effective while respecting human freedom.","zh":"合宜主义是天主教神学中的一种学说，强调天主在与人相称的处境中赐下恩宠，使其产生效果，同时尊重人的自由意志。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Catholic theology) a view that God’s grace becomes effective because God gives it in circumstances suited (“congruous”) to a person, so the person freely cooperates with it.","zh":"（天主教神学）“合宜主义/相称主义”：一种观点，认为天主的恩宠之所以产生有效结果，是因为天主把恩宠赐在与某人性情与处境“相称/合宜”的情境中，使人能在自由意志下与恩宠合作。"},"examples":[{"en":"Congruism tries to explain how grace can be effective without forcing the human will.","zh":"合宜主义试图解释：恩宠如何能产生效力，同时又不强迫人的意志。"},{"en":"In some discussions, congruism is presented as a middle position between Thomism and Molinism.","zh":"在一些讨论中，合宜主义被视为介于托马斯主义与莫利纳主义之间的立场。"}]}],"synonyms":["Molinist congruism","a form of Molinism"],"phonetic":"/ˈkɑŋɡruˌɪzəm/","extraExplanation":["“Congruism”是较少见的术语，多出现在关于“恩宠与自由意志”关系的神学史讨论里，常与耶稣会传统、莫利纳主义（Molinism）以及“有效恩宠/充足恩宠”等概念并置。","词根提示：congruous（合宜的、相称的）+ -ism（主义、学说）。因此它的核心意思是：天主在“合适的情境”中施予恩宠，使人更可能自由地回应。"]}
{"word":"congruist","summary":{"en":"“Congruist” is not standard; you probably want “congruent” or “congruous” (= matching, consistent).","zh":"“congruist”不是标准用词；多半想写“congruent”或“congruous”（相符、一致）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “congruent” or “congruous,” meaning ‘matching, consistent, or in agreement.’","zh":"不是标准英语单词。很可能是把“congruent”或“congruous”拼错了，意思是“相符的、一致的、协调的”。"},"examples":[{"en":"Your goals should be congruent with your daily habits.","zh":"你的目标应该与你的日常习惯一致。"},{"en":"His actions were not congruous with his promises.","zh":"他的行为与他的承诺并不一致。"}]},{"partOfSpeech":"other","definition":{"en":"(Rare/incorrect use) If someone writes “congruist,” they may be trying to refer to a person who seeks agreement/consistency, but English normally does not use this form; use “supporter,” “advocate,” or rephrase with “consistent.”","zh":"（少见/不规范用法）如果有人写“congruist”，可能想表达“追求一致/协调的人”，但英语通常不用这种形式；更常用“supporter / advocate”，或改用“consistent”等表达。"},"examples":[{"en":"Better: She is an advocate for consistent policies.","zh":"更自然：她主张政策要保持一致。"}]}],"synonyms":["consistent","compatible","in agreement","matching"],"phonetic":"/ˈkɑŋɡruənt/","extraExplanation":["“congru-”这个词根来自拉丁语，和“agree / match（相符）”的概念有关。常见正确词形：\n- congruent（常用于数学/更正式语境：线、角、图形等“全等/一致”；也可泛指“与……一致”）\n- congruous（更常用于一般语境：观点、行为、风格等“协调、相称”）\n如果你告诉我你看到“congruist”的句子原文，我可以帮你判断作者想用哪个词。"]}
{"word":"congruistic","summary":{"en":"“Congruistic” is not a standard English word; it is usually a mistaken or coined form meaning “related to congruence.” Most likely you want “congruent” or “congruous.”","zh":"“congruistic” 不是标准英语词，多半是误拼或自造词，可理解为“与一致/相符（congruence）有关”。更可能想用的是 “congruent” 或 “congruous”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Nonstandard or rare word. In most contexts, people likely mean “congruent” (matching/consistent) or “congruous” (appropriate/fit). If used as a coined term, it would mean “relating to congruence (agreement or matching).”","zh":"非标准或非常罕见的词。在大多数语境里，人们更可能想表达 “congruent”（一致/相符）或 “congruous”（得体/合适）。如果把它当作自造词使用，通常可理解为“与一致性/相符性（congruence）有关的”。"},"examples":[{"en":"I couldn’t find “congruistic” in standard dictionaries; did you mean “congruent”?","zh":"我在常见词典里找不到 “congruistic”；你是不是想说 “congruent”?"},{"en":"The results are congruent with the theory.","zh":"结果与该理论一致。"},{"en":"Her comment felt congruous with the serious mood of the meeting.","zh":"她的评论与会议严肃的氛围很相称（得体）。"}]}],"synonyms":["congruent","congruous","consistent","compatible","in agreement"],"phonetic":"/kənˈɡruːɪstɪk/","extraExplanation":["“congruistic”不是常见英语单词，可能是拼写误差或临时造词。最常见的目标词：\n- congruent：强调“彼此一致、相符、相匹配”（常用于研究、数据、观点与证据等）。\n- congruous：强调“得体、合适、相称”（更偏日常或文学语气）。\n如果你告诉我你看到它的句子/出处（学术论文、语言学、数学等），我可以更精确判断应改成哪个词。"]}
{"word":"congruities","summary":{"en":"“Congruities” means points of agreement or things that fit well together (plural of “congruity”).","zh":"“congruities”是“congruity”的复数，指一致之处、协调相符之处（有时也指得体、恰当）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"things that match or fit well together; points of agreement or harmony","zh":"（复数）一致之处；协调之处；相符之处"},"examples":[{"en":"We noticed many congruities between the two reports, especially in the timeline.","zh":"我们发现两份报告在很多地方相符，尤其是时间线。"},{"en":"The congruities in their stories made the witness seem more reliable.","zh":"他们说法中的一致之处让证人显得更可信。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) appropriateness; suitability of something to its context","zh":"（较少见）得体；恰当；与情境相称"},"examples":[{"en":"The editor praised the congruities of tone and subject in the essay.","zh":"编辑称赞这篇文章在语气和主题上的得体与契合。"},{"en":"In formal speeches, congruities of language matter a lot.","zh":"在正式演讲中，用词是否得体非常重要。"}]}],"synonyms":["agreements","matches","consistencies","harmonies","correspondences"],"phonetic":"/kənˈɡruːətiz/","extraExplanation":["“congruities”是名词“congruity”的复数。更常见的近义词表达有 agreement（一致）、consistency（前后一致）、harmony（协调）。","相关词：congruous（adj. 相符的、协调的）；incongruity（n. 不协调、不相符）。数学里常见的是“congruence（全等/同余）”，含义更偏技术性。"]}
{"word":"congruity","summary":{"en":"Congruity means appropriateness and harmony, or exact matching in a formal sense.","zh":"Congruity 指“合适、协调一致”，也可指（更正式/几何意义上的）“完全一致、全等”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being appropriate and fitting well with something; harmony or agreement between parts","zh":"（与某事物）相称、合适；协调一致"},"examples":[{"en":"There is a strong congruity between the brand’s message and its actions.","zh":"这个品牌的理念与它的行动高度一致。"},{"en":"The simple music had a pleasing congruity with the quiet scene.","zh":"朴素的音乐与安静的场景很协调。"}]},{"partOfSpeech":"n.","definition":{"en":"the quality of matching or coinciding exactly (especially in geometry or formal comparisons)","zh":"（尤其在几何或严格比较中）完全相同；重合；全等"},"examples":[{"en":"The engineer checked the congruity of the two measurements.","zh":"工程师检查了两次测量结果是否完全一致。"},{"en":"In geometry, students learn about congruity between shapes.","zh":"在几何中，学生会学习图形之间的全等关系。"}]}],"synonyms":["harmony","consistency","agreement","fitness","appropriateness","conformity","congruence"],"phonetic":"/kənˈɡruːəti/","extraExplanation":["“congruity”常见于较正式的书面语，比起日常口语更常见。日常表达里，你也可以用“fit / match / consistency / harmony”等词来替换。","词源上与“congruent（相一致的）”同源，核心含义都是“契合、相配”。在文学或评论写作中，它常用来评价“风格与内容是否相称”（例如语言风格与主题、人物行为与身份等）。"]}
{"word":"congruous","summary":{"en":"Congruous means “matching or appropriate,” and in geometry it means “same size and shape.”","zh":"congruous 表示“协调/相称/一致”；在几何中表示“全等（大小和形状相同）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Suitable or matching in a way that feels natural and appropriate; in agreement with something.","zh":"（与某事物）协调一致的；合适的；相符的。"},"examples":[{"en":"His calm tone was congruous with the seriousness of the situation.","zh":"他冷静的语气与事态的严肃性很相符。"},{"en":"The modern sofa looked congruous in the newly renovated apartment.","zh":"这张现代沙发放在新装修的公寓里很协调。"},{"en":"Her actions were congruous with her values.","zh":"她的行为与她的价值观一致。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Geometry) Having the same size and shape (even if turned or flipped).","zh":"（几何）全等的（大小与形状相同，即使旋转或翻转也一样）。"},"examples":[{"en":"These two triangles are congruous, so their corresponding sides are equal.","zh":"这两个三角形全等，所以对应边相等。"},{"en":"In this figure, the congruous circles have the same radius.","zh":"在这幅图中，这些全等的圆半径相同。"}]}],"synonyms":["appropriate","fitting","suitable","consistent","compatible","harmonious"],"phonetic":"/ˈkɑŋɡruəs/","extraExplanation":["“congruous”在日常英语里常用于正式或书面语，强调“合拍、得体”，常见搭配有：congruous with（与……一致/相称）、a congruous match（很般配的组合）。","词源上与“agree/fit（相符/契合）”的概念相关。学习时可与近义词区分：appropriate（合适的，偏“得体”）、consistent（前后一致，偏“逻辑/立场”）、compatible（兼容，偏“能一起使用/相处”）。"]}
{"word":"congruously","summary":{"en":"“Congruously” means “in a matching, fitting, or consistent way,” often used in formal writing.","zh":"“Congruously”表示“以相称/契合/一致的方式”，多用于较正式的表达。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that matches well; suitably and appropriately for the situation.","zh":"以相称的方式；恰当地、合适地（与情境或目的相符合）。"},"examples":[{"en":"The simple design fits congruously with the brand’s clean image.","zh":"这个简洁的设计与品牌干净利落的形象非常相称。"},{"en":"Her calm response worked congruously with the seriousness of the meeting.","zh":"她冷静的回应与会议的严肃氛围很契合。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Formal) In a way that is consistent or in agreement with something (an idea, rule, or set of facts).","zh":"（较正式）以一致/相符的方式（与某种观点、规则或事实相一致）。"},"examples":[{"en":"The new policy operates congruously with existing safety standards.","zh":"新政策与现有的安全标准一致地执行。"},{"en":"His actions were not congruously aligned with his stated values.","zh":"他的行为与他宣称的价值观并不一致。"}]}],"synonyms":["appropriately","suitably","fittingly","consistently","in harmony"],"phonetic":"/ˈkɑːŋɡruəsli/","extraExplanation":["“congruously”来自形容词“congruous”（相称的、符合的）+ 副词后缀“-ly”。常见搭配有：congruously with（与……相称/一致）。","它语气偏正式，日常口语中常用“appropriately / suitably / consistently”来表达类似意思。"]}
{"word":"congruousness","summary":{"en":"Congruousness means the quality of being appropriate, harmonious, or consistent with something else.","zh":"Congruousness 指“恰当、协调或一致”的性质（与某事物相符、相称）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being appropriate, consistent, or in harmony with something else; suitability","zh":"（与他物）相称、协调、一致的性质；恰当性"},"examples":[{"en":"The congruousness of his calm tone with the serious topic made people listen carefully.","zh":"他平静的语气与严肃的话题很相称，让人们更愿意认真听。"},{"en":"We questioned the congruousness of wearing sneakers to a formal wedding.","zh":"我们怀疑穿运动鞋参加正式婚礼是否得体。"},{"en":"The report checks the congruousness between the data and the conclusions.","zh":"这份报告会核对数据与结论之间是否一致。"}]}],"synonyms":["appropriateness","suitability","consistency","harmony","compatibility"],"phonetic":"/kənˈɡruːəsnəs/","extraExplanation":["“Congruousness”来自形容词“congruous（协调的、恰当的）”+ 名词后缀“-ness（……的性质）”。在日常英语中更常用“appropriateness（得体）/ consistency（一致性）/ harmony（协调）”等词来表达类似意思；“congruousness”相对更书面、更学术。","注意区分“congruous”和“congruent”：前者更偏“合适/得体/协调”（常用于语言、行为、风格、论点等）；后者在数学里很常见，表示“全等/同余”，在普通语境里也可表示“相符”。"]}
{"word":"congustable","summary":{"en":"“Congustable” is not standard English; it’s likely a misspelling (often of “disgusting” or “digestible”).","zh":"“congustable”不是标准英语词，更可能是拼写错误（常见可能是“disgusting”或“digestible”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or a nonstandard/rare form.","zh":"这不是标准英语单词，更可能是拼写错误或非常不常见的非标准形式。"},"examples":[{"en":"I couldn’t find “congustable” in a dictionary—did you mean “disgusting” or “digestible”?","zh":"我在词典里查不到“congustable”——你想写的是“disgusting（令人恶心的）”还是“digestible（易消化的）”吗？"},{"en":"Please share the full sentence where you saw “congustable,” and I can help you choose the right word.","zh":"请把你看到“congustable”的完整句子发我，我可以帮你判断应该用哪个正确单词。"}]}],"synonyms":["disgusting","digestible"],"phonetic":"/kənˈɡʌstəbəl/","extraExplanation":["“congustable”看起来像把某个常见词拼错了。最可能的目标词包括：\n1) disgusting（令人反感的/恶心的）\n2) digestible（易消化的；也可指“易理解的”信息）\n3) congestible（可被“充满/堵塞”的；很少用）\n把你原句贴出来，我可以根据语境帮你准确改成合适的词。"]}
