{"word":"conk","summary":{"en":"“Conk” is an informal verb meaning to stop working, to hit (often on the head), or to suddenly fall asleep/lose consciousness (often as “conk out”).","zh":"“conk”是口语动词，可指（机器）坏掉、（常指）敲打头部，也可指突然睡着/昏倒（常用conk out）。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Informal) To stop working, often because of a mechanical or technical failure.","zh":"（非正式）停止运转；（机器、设备等）出故障。"},"examples":[{"en":"My laptop conked out in the middle of the meeting.","zh":"我的笔记本电脑在会议进行到一半时突然坏了。"},{"en":"The old car conked out on the highway.","zh":"那辆旧车在高速公路上抛锚了。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Informal) To hit someone, especially on the head.","zh":"（非正式）敲打；（尤指）打某人的头。"},"examples":[{"en":"He conked his head on the low doorway.","zh":"他在矮门口把头磕了一下。"},{"en":"The kid conked the ball right at my forehead by accident.","zh":"那孩子不小心把球砸到了我的额头上。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Informal, often humorous) To fall asleep, especially suddenly.","zh":"（非正式，常带幽默）睡着；（尤指）突然睡着。"},"examples":[{"en":"I conked out on the sofa after dinner.","zh":"晚饭后我在沙发上睡着了。"},{"en":"She was so tired she conked out during the movie.","zh":"她太累了，电影看到一半就睡着了。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Informal) To die; to lose consciousness.","zh":"（非正式）死亡；失去知觉。"},"examples":[{"en":"In the story, the villain conks out at the end.","zh":"在故事里，反派最后死了。"},{"en":"He nearly conked out from the heat.","zh":"他热得差点昏过去。"}]}],"synonyms":["break down","stop working","hit","knock","pass out","fall asleep"],"phonetic":"/kɑŋk/","extraExplanation":["“conk”很口语，常见搭配是 **conk out**：既可以指“机器坏了”，也可以指“人累到睡着/昏倒”。语境通常能区分：谈设备多是“故障”，谈人多是“睡着/失去知觉”。","词源上与“打一下（尤其打头）”的拟声/口语用法有关，所以也引申出“被打到昏、突然倒下/睡着”等含义。"]}
{"word":"conkanee","summary":{"en":"“Conkanee” is not standard English; it’s likely a misspelling of “Kokanee” or “conk.”","zh":"“conkanee”不是标准英语词，通常是把“Kokanee”或“conk”误写成了它。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most often seen as a misspelling or playful/phonetic spelling of another word or name (for example, “Kokanee” or “conk”).","zh":"不是标准英语单词。它最常见于拼写错误或戏仿/按发音拼写的写法（例如把“Kokanee”或“conk”写成“conkanee”）。"},"examples":[{"en":"I can’t find “conkanee” in a dictionary—did you mean “Kokanee” or “conk”?","zh":"我在词典里找不到“conkanee”——你是想写“Kokanee”还是“conk”吗？"},{"en":"The label says “Kokanee,” but I accidentally typed “conkanee.”","zh":"标签上写的是“Kokanee”，但我不小心打成了“conkanee”。"}]}],"phonetic":"/kɑnˈkeɪni/","extraExplanation":["“Kokanee”在北美更常见：既可以指一种红鲑（kokanee salmon），也可能是某些品牌名称（例如啤酒品牌）。如果你是在菜单、酒水单、钓鱼/鱼类内容里看到的，很可能原词是“Kokanee”。","如果你想表达动词“conk”（常见于口语），通常意思是“（机器）坏了/停转”或“（人）昏倒、睡着”。例如：The engine conked out.（发动机熄火了。）","如果你告诉我你看到“conkanee”的句子或语境（在哪里看到的、前后文是什么），我可以更准确判断你要查的词。"]}
{"word":"conked","summary":{"en":"“Conked” is the informal past form of “conk,” meaning stopped working suddenly, hit (often on the head), or fell asleep from tiredness.","zh":"“conked”是非正式用法，为“conk”的过去式/过去分词，可指突然坏掉/停止运转、（尤指头部）被敲到，或累到睡着。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(informal) Past tense/past participle of “conk”: to stop working or fail suddenly (often for machines, cars, devices).","zh":"（非正式）“conk”的过去式/过去分词：突然停止运转、出故障（常指机器、汽车、设备）。"},"examples":[{"en":"My laptop conked out in the middle of the video call.","zh":"我笔记本电脑在视频通话中间突然坏了。"},{"en":"The old car conked out on the highway.","zh":"那辆旧车在高速上抛锚了。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal) To hit someone, especially on the head, usually not seriously.","zh":"（非正式）敲打、击打（尤指打到头上，通常不严重）。"},"examples":[{"en":"He bumped the shelf and conked his head.","zh":"他撞到架子，把头磕了一下。"},{"en":"Someone accidentally conked me on the shoulder with a backpack.","zh":"有人不小心用背包撞了我的肩膀一下。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal) To fall asleep, often from tiredness.","zh":"（非正式）睡着（常因太累）。"},"examples":[{"en":"I was so tired I conked out as soon as I got home.","zh":"我太累了，一到家就睡着了。"},{"en":"The baby conked out in the car seat.","zh":"宝宝在汽车座椅里睡着了。"}]}],"synonyms":["broke down","stopped working","failed","hit","bumped","dozed off","fell asleep"],"phonetic":"kɑŋkt","extraExplanation":["“conked”常见于口语，尤其在短语“conked out”里：既可指“（机器）坏掉”，也可指“（人）累到睡着”。具体意思要看上下文。","“conk”在英式与美式口语中都能见到，但整体语气偏随意；正式写作里可用“stopped working / broke down / fell asleep”。"]}
{"word":"conker","summary":{"en":"A conker is the shiny brown seed of a horse chestnut tree, especially one used in the British game ‘conkers.’","zh":"Conker 指七叶树（马栗树）的棕色种子，尤其指用来玩英国传统游戏“打马栗（conkers）”的那种。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hard, shiny brown seed (nut) from a horse chestnut tree, often used in a traditional British children’s game where the seeds are tied to strings and hit against each other.","zh":"（七叶树/马栗树的）坚硬有光泽的棕色种子（俗称“马栗/七叶树果”），常用于英国传统儿童游戏：把果子系在绳子上互相敲击比拼。"},"examples":[{"en":"We collected conkers in the park and threaded them onto strings.","zh":"我们在公园里捡了马栗（conkers），还把它们穿到绳子上。"},{"en":"In autumn, the ground was covered with conkers and spiky shells.","zh":"秋天时，地上到处都是马栗和带刺的外壳。"},{"en":"The kids played conkers after school, trying to break each other’s conker.","zh":"孩子们放学后玩打马栗（conkers），看谁能把对方的果子敲碎。"}]}],"synonyms":["horse chestnut (seed)","buckeye (AmE, related)"],"phonetic":"/ˈkɑŋ.kɚ/","extraExplanation":["“Conker(s)”在英式英语里很有文化辨识度：很多英国人会把它和秋天、开学季、校园游戏联系在一起。传统玩法是把果子烤一烤或涂点东西让它更硬（做法各地不同，也常被认为“有点作弊”）。","注意：conker 指的是 horse chestnut（七叶树/马栗树）的种子，不是可食用的 sweet chestnut（栗子）。Horse chestnut 一般不当食物吃。"]}
{"word":"conkers","summary":{"en":"Conkers are horse chestnuts, especially used in a traditional UK children’s game where conkers on strings are hit until one breaks.","zh":"Conkers 指七叶树（马栗树）的果实，也指英国传统儿童游戏：把果实系在绳上互相敲击，直到一方被打碎。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Horse chestnuts (the hard brown seeds of the horse chestnut tree), especially used by children in a traditional game.","zh":"七叶树（马栗树）的果实（硬棕色种子），尤指儿童用来玩传统游戏的“康克尔”果。"},"examples":[{"en":"The kids collected conkers in the park after school.","zh":"孩子们放学后在公园里捡康克尔果（七叶树果实）。"},{"en":"We drilled a hole in a conker and tied it to a string.","zh":"我们在一颗康克尔果上钻孔，再用绳子穿起来。"},{"en":"In autumn, the sidewalks are covered with fallen conkers.","zh":"秋天时，人行道上满是掉落的七叶树果实。"}]},{"partOfSpeech":"n.","definition":{"en":"A traditional children’s game (common in the UK) in which two players hit each other’s conkers (on strings) until one breaks.","zh":"（英国常见的）“康克尔”传统儿童游戏：两人各用一颗系在绳子上的果实互相敲击，直到一方的果实被打碎。"},"examples":[{"en":"They played conkers during recess.","zh":"他们在课间玩康克尔游戏。"},{"en":"My conker cracked on the third hit.","zh":"我的康克尔果在第三下就裂了。"}]}],"synonyms":["horse chestnuts","the conkers game"],"phonetic":"/ˈkɑŋkərz/","extraExplanation":["“conkers”在英国文化里很有童年味道：多见于秋季（fall/autumn），孩子们捡到七叶树果实后把它穿绳，用来互相敲击比“谁更耐打”。","注意：horse chestnut（马栗）和可食用的 chestnut（板栗/栗子）不是同一种。马栗通常不可食用。","词源上与“conk”（重击、敲打）有关，因此很贴合“互相敲击”的玩法。"]}
{"word":"conking","summary":{"en":"“Conking” is the -ing form of “conk,” commonly meaning a machine stops working suddenly, or (informally) someone hits their head or falls asleep from exhaustion.","zh":"“conking”是“conk”的 -ing 形式，最常见指机器突然坏掉/停止运转；口语中也可指撞到头或累到很快睡着。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Present participle of “conk”) to stop working or fail suddenly (used for machines, cars, phones, etc.).","zh":"（conk 的现在分词）（用于机器、汽车、手机等）突然坏掉；突然停止运转。"},"examples":[{"en":"My laptop is conking again, so I need to save my work often.","zh":"我的笔记本电脑又开始突然罢工了，所以我得经常保存。"},{"en":"The engine started conking on the highway.","zh":"发动机在高速路上开始出故障了。"}]},{"partOfSpeech":"v.","definition":{"en":"(Present participle of “conk”) to hit someone, especially on the head (informal).","zh":"（conk 的现在分词）（非正式）敲打；（尤指）打到头上。"},"examples":[{"en":"He turned too quickly and conked his head on the cabinet door.","zh":"他转得太快，头撞到橱柜门上了。"},{"en":"Be careful—you might be conking people with that long umbrella.","zh":"小心点——你那把长伞可能会撞到别人。"}]},{"partOfSpeech":"v.","definition":{"en":"(Present participle of “conk”) to fall asleep quickly, usually from tiredness (informal).","zh":"（conk 的现在分词）（非正式）（因疲惫）很快睡着。"},"examples":[{"en":"After the trip, I was conking out on the sofa by 9 p.m.","zh":"旅行回来后，我晚上九点就瘫在沙发上睡着了。"},{"en":"The kids were conking out in the back seat.","zh":"孩子们在后座很快就睡着了。"}]}],"synonyms":["breaking down","failing","stopping","crashing","conking out"],"phonetic":"/kɑŋk/","extraExplanation":["“conk”在口语里很常见：机器“conk out”表示“抛锚/罢工”；人“conk out”表示“累到睡着”。在英式英语里也可指用拳头把人打晕（更粗鲁，使用时注意语境）。"]}
{"word":"Conklin","summary":{"en":"Conklin is a proper noun most commonly used as a surname.","zh":"Conklin 通常是专有名词，最常见用法是姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name), common in the United States; it may also be used in names of businesses, schools, or places.","zh":"姓氏（家族姓），在美国较常见；也常用于企业、学校或地名等名称中。"},"examples":[{"en":"Ms. Conklin will lead the meeting today.","zh":"Conklin 女士今天将主持会议。"},{"en":"I found an article by Conklin in the local newspaper.","zh":"我在当地报纸上看到一篇 Conklin 写的文章。"}]}],"phonetic":"/ˈkɑŋklɪn/","extraExplanation":["“Conklin”通常作为专有名词使用（姓氏），一般不翻译，只音译或直接保留拼写。在英文写作中，姓氏首字母必须大写：Conklin。","如果你是在阅读/看剧时遇到它，往往是角色的姓；在正式场合可用“Mr./Ms./Dr. Conklin”。如果你愿意提供上下文（句子或图片），我也可以帮你判断它指的是人名、地名还是机构名。"]}
{"word":"conks","summary":{"en":"“Conks” is the 3rd-person singular of “conk” (“stops working”) or the plural of “conk” (“nose,” informal).","zh":"“conks”可以是动词“conk”的第三人称单数（突然停止运作），也可以是名词“conk”（鼻子，口语）的复数。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of a machine, vehicle, or body part) to stop working suddenly; to fail.","zh":"（机器、车辆或身体部位）突然停止运作；出故障。"},"examples":[{"en":"My old laptop conks out if I open too many tabs.","zh":"我的旧笔记本电脑如果开太多标签页就会罢工。"},{"en":"The car conked out on the highway.","zh":"车在高速路上抛锚了。"}]},{"partOfSpeech":"vt.","definition":{"en":"to hit someone on the head (often lightly); to bonk.","zh":"敲（某人）的头（通常不太重）；轻打。"},"examples":[{"en":"He accidentally conked me on the head with the door.","zh":"他不小心用门撞了我的头一下。"},{"en":"She conked the ball with her bat.","zh":"她用球棒击打了球。"}]},{"partOfSpeech":"n.","definition":{"en":"a nose (informal, often humorous).","zh":"鼻子（非正式，常带幽默感）。"},"examples":[{"en":"He has a big conk, but it suits his face.","zh":"他鼻子挺大，但很配他的脸。"},{"en":"He broke his conk playing soccer.","zh":"他踢足球时把鼻子撞伤了。"}]}],"synonyms":["break down","fail","stop working","conk out","bonk","hit","nose"],"phonetic":"/kɑŋks/","extraExplanation":["“conks”既可以是动词“conk”的第三人称单数（He conks out easily.），也可以是名词“conk”的复数（big conks）。","“conk out”很常见，语气偏口语：可指机器坏了，也可指人“累到睡着/昏睡过去”。在某些语境里也可委婉指“去世”，但需要根据上下文判断，避免误解。"]}
{"word":"conky","summary":{"en":"Conky is best known as a Linux desktop system monitor; more rarely, conky can mean a bit crazy or odd.","zh":"Conky 最常见的意思是 Linux 桌面系统监视器；较少见时，conky 可表示有点疯癫或古怪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lightweight system monitor for Linux that displays real-time information (CPU, memory, network, etc.) on the desktop.","zh":"（Linux 上的）轻量级系统监视器，可在桌面上实时显示 CPU、内存、网络等信息。"},"examples":[{"en":"I use Conky to show CPU temperature and RAM usage on my desktop.","zh":"我用 Conky 在桌面上显示 CPU 温度和内存占用。"},{"en":"After editing the Conky config file, the layout changed immediately.","zh":"我编辑了 Conky 的配置文件后，布局立刻就变了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal, uncommon) slightly crazy, odd, or eccentric.","zh":"（非正式、较少见）有点疯癫的；古怪的；怪异的。"},"examples":[{"en":"That idea sounds a bit conky, but it might work.","zh":"这个想法听起来有点怪，但也许行得通。"},{"en":"He has a conky sense of humor.","zh":"他的幽默感有点怪。"}]}],"synonyms":["(Linux tool) system monitor","desktop monitor","(adj.) weird","quirky","eccentric"],"phonetic":"/ˈkɑŋki/","extraExplanation":["在技术语境里，“Conky”通常指开源桌面系统监视工具，常见于 Linux。它高度可自定义：用户会编辑配置文件（如 conky.conf）来决定显示哪些信息、字体、颜色与位置。","作为形容词的“conky”在日常英语中并不常见；如果你想表达“有点疯/怪”，更常用的是 “crazy / weird / quirky”。"]}

