{"word":"CONN","summary":{"en":"“conn” most commonly means to scam or trick someone; “Conn.” can also be the abbreviation for Connecticut.","zh":"“conn”最常指“诈骗/哄骗”；“Conn.”也可作美国康涅狄格州的缩写。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to trick or persuade someone into doing something by using deception; to scam","zh":"（用欺骗手段）哄骗；诈骗；骗取"},"examples":[{"en":"He tried to conn older people out of their savings.","zh":"他试图骗取老年人的积蓄。"},{"en":"Don’t let anyone conn you into signing papers you don’t understand.","zh":"别让任何人哄骗你签下你不理解的文件。"}]},{"partOfSpeech":"n.","definition":{"en":"a trick or scam; an act of deceiving someone (less common than the verb)","zh":"骗局；诈骗（作名词时不如动词常见）"},"examples":[{"en":"It sounded like a conn from the start.","zh":"从一开始听起来就像个骗局。"}]},{"partOfSpeech":"other","definition":{"en":"(abbreviation) Connecticut, a U.S. state; often written as “Conn.”","zh":"（缩写）美国康涅狄格州；常写作“Conn.”"},"examples":[{"en":"She lives in Hartford, Conn.","zh":"她住在康涅狄格州的哈特福德。"},{"en":"The conference is in New Haven, Conn.","zh":"会议在康涅狄格州的新黑文举行。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal abbreviation) connection; a personal contact or network link","zh":"（非正式缩写）关系；人脉；联系（connection）"},"examples":[{"en":"Do you have a conn at that company?","zh":"你在那家公司有人脉吗？"}]}],"synonyms":["scam","trick","con","swindle","deceive"],"phonetic":"/kɑn/","extraExplanation":["“conn（骗人）”常被认为与“con（con artist）”同源，con来自“confidence（信任）”，暗示骗子先取得你的信任再下手。","“Conn.”作为州名缩写较正式，常见于地址、新闻或学术写法；单写“CONN”也可能出现在表格、标签或全大写文本中。"]}
{"word":"Conn","summary":{"en":"“Conn” most commonly means to trick someone (or a trick itself). It can also be an abbreviation for Connecticut.","zh":"“Conn”最常见表示“欺骗/诈骗（或骗局）”，也可作康涅狄格州（Connecticut）的简称。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to trick or cheat someone, usually by gaining their trust first; to swindle","zh":"（通常先取得信任后）欺骗；诈骗；骗取"},"examples":[{"en":"He conned the tourists into buying fake tickets.","zh":"他骗游客买了假票。"},{"en":"She realized too late that she had been conned.","zh":"她意识到时已经太晚了——她被骗了。"},{"en":"Don’t let anyone con you out of your money.","zh":"别让任何人把你的钱骗走。"}]},{"partOfSpeech":"n.","definition":{"en":"a trick or fraud; a swindle","zh":"骗局；诈骗"},"examples":[{"en":"The whole investment offer turned out to be a conn.","zh":"那项投资邀约结果是个骗局。"},{"en":"It sounded like a conn from the beginning.","zh":"从一开始听起来就像个骗局。"}]},{"partOfSpeech":"other","definition":{"en":"short for “Connecticut” (a U.S. state), used in writing and names","zh":"Connecticut（美国康涅狄格州）的简称，常用于书面或名称中"},"examples":[{"en":"She lives in Conn., near Hartford.","zh":"她住在康涅狄格州（Conn.），靠近哈特福德。"},{"en":"The university is based in Conn.","zh":"这所大学位于康涅狄格州。"}]}],"synonyms":["swindle","cheat","trick","deceive","scam"],"phonetic":"/kɑn/","extraExplanation":["“conn”表示“诈骗”时，常与“con”有关（con = confidence trick，先获取信任再行骗）。在口语和新闻里更常见的拼写是“con”，而“conn”也常被当作动词/名词使用。","注意区分：conn/con（诈骗） vs. “con”作为前缀（如: pros and cons 中的 con = 反对/缺点）。","另外，“conn”在航海英语里还可指“掌舵/指挥航行”（to conn a ship），但日常学习中不如“诈骗”义常见。"]}
{"word":"conn","summary":{"en":"“Conn” most often appears as an informal short form of “connection,” especially in tech contexts; it can also mean “to steer/direct a ship” in nautical English.","zh":"“conn”最常见是“connection（连接）”的非正式缩写（尤其在科技语境）；在航海英语中也可作动词，意为“指挥/掌舵航行”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) a connection; a link between people, things, or systems (often used in tech writing).","zh":"（非正式）连接；联系；（常见于科技语境）指系统或网络之间的连接。"},"examples":[{"en":"Check your internet conn before joining the meeting.","zh":"参加会议前先检查一下你的网络连接（conn）。"},{"en":"The app lost its conn to the server.","zh":"这个应用和服务器的连接（conn）断了。"}]},{"partOfSpeech":"v.","definition":{"en":"(nautical) to direct or steer a ship; to be in charge of navigation at a particular moment.","zh":"（航海）指挥（船只航行）；掌舵/负责当下的航行指令。"},"examples":[{"en":"The officer will conn the ship into the harbor.","zh":"那名军官将指挥船只驶入港口。"},{"en":"She was conning the vessel while the captain monitored the charts.","zh":"她在指挥船只航行，船长则在查看海图。"}]}],"synonyms":["connection (for the abbreviation)","link","network connection","steer (nautical)","direct (nautical)"],"phonetic":"/kɑn/","extraExplanation":["“conn”作“连接”多见于口语、短信、聊天或技术笔记里，是“connection”的缩写；正式写作通常用“connection”。","航海里“to conn”是一个专门用语，意思是“指挥船的航向/速度等操作”，常见搭配有“conn the ship”。"]}
{"word":"connach","summary":{"en":"“Connach” is usually a misspelling of Connacht/Connaught, a province in western Ireland.","zh":"“connach”通常是 Connacht/Connaught 的误拼，指爱尔兰西部的一个省。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A misspelling or variant spelling of **Connacht** (also spelled **Connaught**), one of the four provinces of Ireland in the west of the country.","zh":"常见拼写错误或变体拼写，通常指 **Connacht**（也可拼作 **Connaught**），爱尔兰西部的四大省之一。"},"examples":[{"en":"I think you mean **Connacht**—it’s a province in western Ireland.","zh":"我想你要写的是 **Connacht**——它是爱尔兰西部的一个省。"},{"en":"Galway is a major city in Connacht.","zh":"戈尔韦（Galway）是 Connacht 的重要城市。"}]}],"synonyms":["Connacht","Connaught"],"phonetic":"/ˈkɑnək(t)/","extraExplanation":["“Connach”在英语里不算标准拼写；更常见的是 **Connacht**（现代常用拼法）或 **Connaught**（较旧的英语拼法）。","Connacht 常被英语使用者读作接近“CON-uhkt / CON-uh”，末尾的 -t 在口语中有时很轻或不明显。"]}
{"word":"Connacht","summary":{"en":"Connacht is a province in western Ireland; it can also refer to the rugby team/region that represents it.","zh":"Connacht（康诺特）是爱尔兰西部的一个传统省份；也可指代表该地区的橄榄球队/赛区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"One of the four traditional provinces of Ireland, located in the west of the country (including counties such as Galway, Mayo, Sligo, Roscommon, and Leitrim).","zh":"爱尔兰四大传统省份之一，位于爱尔兰西部（通常包括戈尔韦、梅奥、斯莱戈、罗斯康芒、利特里姆等郡）。"},"examples":[{"en":"She grew up in Connacht and moved to Dublin for university.","zh":"她在康诺特长大，后来去都柏林上大学。"},{"en":"Connacht is known for its Atlantic coastline and rural landscapes.","zh":"康诺特以大西洋海岸线和乡村风光闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"(Sports) An Irish rugby team/region representing the province of Connacht, often used in names like “Connacht Rugby.”","zh":"（体育）代表康诺特省的爱尔兰橄榄球队/赛区，常见于“Connacht Rugby（康诺特橄榄球）”等名称中。"},"examples":[{"en":"Connacht are playing Leinster this weekend.","zh":"康诺特队这周末要对阵伦斯特队。"},{"en":"He bought a Connacht Rugby jersey.","zh":"他买了一件康诺特橄榄球队球衣。"}]}],"synonyms":["the province of Connacht","Connacht Rugby"],"phonetic":"/ˈkɑːnɑːt/","extraExplanation":["“Connacht”是英语拼写；在爱尔兰语中写作“Connachta”。英文里常见的发音以第一个音节重读。","爱尔兰历史上的“省（province）”更多是文化与传统区域概念；现代行政区划主要以“郡（county）”为单位。","在文学与旅游语境中，Connacht常让人联想到爱尔兰西部的盖尔语文化、海岸与乡村意象。"]}
{"word":"connaisseur","summary":{"en":"A connoisseur is someone with expert knowledge and refined taste, especially in areas like wine, food, or art.","zh":"connoisseur 指对某领域（如美食、葡萄酒、艺术等）有专业知识并且品味高雅的鉴赏家/行家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person with expert knowledge and refined taste, especially in food, wine, art, music, or other things that can be appreciated and judged.","zh":"鉴赏家；行家（尤指对美食、葡萄酒、艺术、音乐等有专业知识与高雅品味的人）。"},"examples":[{"en":"She’s a wine connoisseur who can identify the region from a single sip.","zh":"她是葡萄酒鉴赏家，喝一口就能分辨出产区。"},{"en":"The museum hired a connoisseur to evaluate the painting’s authenticity.","zh":"博物馆聘请了一位鉴赏专家来评估这幅画的真伪。"},{"en":"He’s a connoisseur of jazz and loves introducing friends to classic albums.","zh":"他是爵士乐的行家，很喜欢把经典专辑介绍给朋友。"}]}],"synonyms":["expert","specialist","authority","aficionado","gourmet"],"phonetic":"/ˌkɑnəˈsɝ/","extraExplanation":["“connoisseur”来自法语，常用于较正式的语境，带有“懂得欣赏、品味精细”的意味。它不仅指“知道很多”，更强调“有判断力的品味”。","近义词对比：\"expert\"更偏“专业能力/技能”；\"enthusiast\"偏“热爱但未必专业”；\"aficionado\"多指某领域的资深爱好者（如电影、斗牛等），语气比connoisseur稍随意。"]}
{"word":"Connally","summary":{"en":"Connally is a surname, best known in U.S. history through John Connally, a Texas politician connected to the 1963 JFK assassination event.","zh":"Connally 是一个姓氏，在美国历史中常因德州政治人物约翰·康纳利而广为人知（与1963年肯尼迪遇刺事件相关）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A family name (surname). In U.S. history it is most commonly associated with John Connally, a Texas politician who was wounded in the 1963 assassination of President John F. Kennedy while riding in the same car.","zh":"一个英文姓氏。在美国历史语境中，最常让人想到的是约翰·康纳利（John Connally），德州政治人物；1963年肯尼迪总统遇刺时，他在同车中也中弹受伤。"},"examples":[{"en":"Connally is a common surname in the United States, especially in historical and political contexts.","zh":"Connally 是美国常见的姓氏，尤其在历史和政治语境中经常出现。"},{"en":"Governor Connally served as the governor of Texas in the early 1960s.","zh":"康纳利州长在20世纪60年代初担任德克萨斯州州长。"}]}],"phonetic":"/ˈkɑnəli/","extraExplanation":["“Connally”多作为专有名词使用（姓氏/人名）。如果你是在阅读美国近现代史或关于肯尼迪遇刺的材料里看到它，通常指 John Connally（1927–1993）：曾任德州州长、美国财政部长；1963年在达拉斯随行时受伤，因此经常在相关叙述中被提及。","读音上常见重音在第一音节：CONN-uh-lee。中文常译作“康纳利/康纳里”（译法会因地区或资料来源略有差异）。"]}
{"word":"Connaraceae","summary":{"en":"Connaraceae is a tropical plant family name used in botany.","zh":"Connaraceae 指“金莲木科”，是植物学中常用的热带植物科名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of tropical flowering plants (the Connaraceae family), including woody vines, shrubs, and small trees; many species grow in rainforests and some have medicinal or local uses.","zh":"（植物）金莲木科：一类热带开花植物科，成员多为木质藤本、灌木或小乔木；常见于热带雨林，有些物种具有药用或地方性用途。"},"examples":[{"en":"Connaraceae is a plant family found mainly in tropical regions.","zh":"金莲木科主要分布在热带地区。"},{"en":"In botany class, we learned that Connaraceae includes vines and small trees.","zh":"在植物学课上，我们学到金莲木科既有藤本也有小乔木。"},{"en":"Researchers compared leaf traits across several Connaraceae species.","zh":"研究人员比较了多种金莲木科植物的叶片特征。"}]}],"synonyms":["the Connaraceae family","connaraceous plants"],"phonetic":"/kəˌnɑrəˈsiːi/","extraExplanation":["“Connaraceae”是植物分类学中的“科名”，常用于学术写作、植物志（flora）或标本标签中。日常英语里不常见，但在生物/生态/药用植物相关语境会出现。","词形特征：以“-aceae”结尾通常表示“某某科”（植物科名的标准拉丁化后缀），例如 Rosaceae（蔷薇科）、Fabaceae（豆科）。","读音提示：重音通常落在“-RA-”附近，整体更像“kuh-NAR-uh-see-ee”。"]}
{"word":"connaraceae","summary":{"en":"Connaraceae is a scientific name for a tropical plant family (shrubs, trees, and woody vines).","zh":"Connaraceae 指金虎尾科，是一个以热带灌木、乔木和木质藤本为主的植物科名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A botanical family of mostly tropical shrubs, trees, and woody vines (lianas), including the genus Connarus.","zh":"（植物学）金虎尾科：主要分布在热带的灌木、乔木和木质藤本植物的一科，包含金虎尾属（Connarus）等。"},"examples":[{"en":"Connaraceae plants are found mainly in tropical regions of Africa, Asia, and the Americas.","zh":"金虎尾科植物主要分布在非洲、亚洲和美洲的热带地区。"},{"en":"In the rainforest survey, the team recorded several lianas from the Connaraceae family.","zh":"在雨林调查中，团队记录了几种属于金虎尾科的木质藤本植物。"}]}],"synonyms":["the Connaraceae family","Connaraceae (plant family)"],"phonetic":"/ˌkɑnəˈreɪsiˌi/","extraExplanation":["“Connaraceae”是植物分类学中的“科名”，常见于学术文章、植物志、自然纪录片或生物多样性调查报告中；日常英语里不常用。","科名通常以代表属（这里是 Connarus）的名称为基础构成；在正式写作中常与“family（科）”连用，如“the Connaraceae family”。"]}
{"word":"connaraceae-related","summary":{"en":"An adjective meaning “related to the plant family Connaraceae.”","zh":"形容词：表示“与牛栓藤科（Connaraceae）有关/属于该科”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to, belonging to, or characteristic of the plant family Connaraceae (a tropical family of flowering plants).","zh":"与牛栓藤科（Connaraceae，一类热带开花植物的科）有关的；属于或具有该科特征的。"},"examples":[{"en":"Researchers identified several Connaraceae-related species in the rainforest plot.","zh":"研究人员在雨林样地中鉴定出几种与牛栓藤科有关的物种。"},{"en":"The paper discusses Connaraceae-related compounds found in leaf extracts.","zh":"论文讨论了在叶片提取物中发现的与牛栓藤科相关的化合物。"}]}],"synonyms":["related to Connaraceae","Connaraceae-associated","Connaraceae-specific"],"phonetic":"/kəˌnærəˈseɪsiˌrɪˌleɪtɪd/","extraExplanation":["“Connaraceae-related”常见于植物学、分类学、生态学与天然产物化学等学术写作中，用来把某个物种、特征或化合物与“牛栓藤科”这一分类单元联系起来。","在一般英语中更常说“related to the Connaraceae (family)”；带连字符的形式多用于标题、关键词或需要简洁修饰名词时（如“Connaraceae-related taxa/compounds”）。","Connaraceae是热带分布的被子植物科；如果你的语境是物种鉴定或系统发育研究，搭配词常见有：species、taxa（类群）、genus（属）、lineage（谱系）、traits（性状）。"]}
{"word":"connaraceous","summary":{"en":"A botanical adjective meaning “of or related to the plant family Connaraceae.”","zh":"植物学形容词，意为“牛栓藤科（Connaraceae）的/与其有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the plant family Connaraceae (a tropical group of shrubs, trees, and woody vines).","zh":"与牛栓藤科（Connaraceae，一类热带灌木、乔木与木质藤本植物）有关的。"},"examples":[{"en":"The botanist described the specimen as a connaraceous vine found in lowland rainforest.","zh":"植物学家把这株标本描述为一种生长在低地雨林的牛栓藤科木质藤本。"},{"en":"Connaraceous species are most common in tropical regions.","zh":"牛栓藤科的物种最常见于热带地区。"}]}],"synonyms":["of the Connaraceae family","connaraceae-related"],"phonetic":"/ˌkɑnəˈreɪʃəs/","extraExplanation":["这是一个偏学术、分类学用词，主要出现在植物学论文、植物志（flora）或标本鉴定记录中。日常英语里很少使用。","词根来自植物科名 Connaraceae；很多“某某科的”形容词都用“-aceous”结尾（表示“……的/与……有关的”，如 rosaceous 表示“蔷薇科的”）。"]}
{"word":"connarite","summary":{"en":"“Connarite” is not a recognized standard English word; it’s likely a misspelling or a proper/specialized name.","zh":"“connarite”不是常见标准英语词；更可能是拼写错误或专有/专业名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not found as a standard English word in major dictionaries; it may be a misspelling, a proper name, or a very specialized term (e.g., a brand/user name/mineral name).","zh":"在主要英语词典中未收录为常见词；可能是拼写错误、专有名词，或非常专业的小众术语（如品牌名/用户名/矿物名等）。"},"examples":[{"en":"I couldn’t find “connarite” in a dictionary—could you share a sentence with it?","zh":"我在词典里找不到“connarite”，你可以给我一个包含它的句子吗？"},{"en":"Is “connarite” a person’s name or a product name?","zh":"“connarite”是人名还是产品名？"}]}],"phonetic":"N/A","extraExplanation":["目前“connarite”不像是常见英语单词（也不属于常见拼写变体）。如果你是从某篇文章/游戏/化学或地质资料里看到的，它可能是专有名词或专业术语的转写。","你可以告诉我：①它出现的句子/段落；②你想表达的意思；③是否可能是拼写接近的词（例如 Connor / Conner / -ite 结尾的矿物名）。我就能更准确地给出释义与发音。"]}
{"word":"Connarus","summary":{"en":"Connarus is a scientific (botanical) name: a genus of tropical plants in the Connaraceae family.","zh":"Connarus 是植物学的学名：金虎尾科中的一个热带植物属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical shrubs and small trees in the Connaraceae family (a scientific plant name, usually written in italics: Connarus).","zh":"（植物学）金虎尾科（Connaraceae）的一属热带灌木或小乔木的属名（学名，通常用斜体书写：Connarus）。"},"examples":[{"en":"Connarus is a genus found in tropical regions, especially in parts of South America and Southeast Asia.","zh":"Connarus 是一种分布在热带地区的植物属，常见于南美部分地区和东南亚。"},{"en":"The field guide listed Connarus under the Connaraceae family.","zh":"这本野外植物指南把 Connarus 列在金虎尾科（Connaraceae）之下。"}]}],"synonyms":["Connaraceae (related family name)"],"phonetic":"/kəˈnærəs/","extraExplanation":["“Connarus”主要作为拉丁学名使用，而不是日常英语词汇；在英文文章中常以斜体 Connarus 出现，首字母大写表示“属名”（genus）。","如果你是在其他语境中看到“Connarus”（例如人名、品牌名或拼写变体），可以把原句或截图发来，我可以帮你判断它具体指什么。"]}
{"word":"connarus","summary":{"en":"Connarus is a scientific (botanical) genus name for certain tropical flowering plants.","zh":"Connarus 是一个植物学属名，指一类热带开花植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical flowering plants (family Connaraceae), found mainly in Africa, Asia, and the Americas.","zh":"（植物学）金莲木科（Connaraceae）的一属热带开花植物，主要分布于非洲、亚洲及美洲的热带地区。"},"examples":[{"en":"Some Connarus species grow as woody vines or small trees in tropical forests.","zh":"一些 Connarus 属的物种在热带森林中以木质藤本或小乔木的形态生长。"},{"en":"The researcher collected a leaf sample from a Connarus plant for identification.","zh":"研究人员从一株 Connarus 植物上采集叶片样本用于鉴定。"}]}],"synonyms":["(no common everyday synonym; it is a scientific genus name)"],"phonetic":"/kəˈnɑrəs/","extraExplanation":["“Connarus”通常是学名（拉丁化名称），写作属名时首字母要大写：Connarus；指某个具体物种时会跟一个小写的种加词，例如 Connarus paniculatus。","它不算常见日常英语词汇，多见于植物学、生态学或科普文章中。"]}
{"word":"connascency","summary":{"en":"Connascency means “growing/born together,” especially a natural fusion of parts formed during development.","zh":"Connascency 指“共同生长/共同生成”，尤指发育过程中自然形成的组织或结构融合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology) the state of growing or being born together; especially the natural fusion or close union of body parts that developed together.","zh":"（生物）共同生长或共同生成的状态；尤指在发育过程中自然形成的融合或紧密结合（如器官或组织连在一起）。"},"examples":[{"en":"Some plants show connascency of petals, forming a tube-like flower.","zh":"有些植物的花瓣会出现共同生长（connascency），从而形成管状花冠。"},{"en":"The report described connascency of two tissues that normally remain separate.","zh":"报告描述了两种通常应分离的组织发生了共同生长并融合的情况。"}]}],"synonyms":["congenital fusion","fusion","union","adnation (botany)"],"phonetic":"/kəˈnæsənsi/","extraExplanation":["词源提示：connascency 来自拉丁语 con-（一起）+ nasci（出生、生长），字面意思是“共同出生/共同生长”。因此它常用于解剖学、植物学等语境，强调“发育过程中自然连在一起”，而不一定是后天受伤或手术造成的粘连。"]}
{"word":"connascent","summary":{"en":"Connascent means “born together” or “fused from the beginning,” especially in biology and botany.","zh":"connascent 指“同生的/与生俱来的”，尤指生物或植物结构从发育早期就连生或合生。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Born together; existing from birth as a natural or inborn part of something (often used in biology/botany).","zh":"同生的；与生俱来的；从一开始就自然存在的（常用于生物学/植物学语境）。"},"examples":[{"en":"Some plants have connascent leaves that appear fused at the base from the start.","zh":"有些植物的叶片是同生的，从一开始叶基部就像融合在一起。"},{"en":"The report describes a connascent structure rather than something formed later by growth.","zh":"报告描述的是一种同生结构，而不是后来生长形成的。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Botany, more specific) Joined or fused from the earliest stage of development, not by later attachment.","zh":"（植物学，更具体）在发育早期就连生/合生的，并非后期黏连在一起。"},"examples":[{"en":"The petals are connascent, forming a single tube.","zh":"花瓣是合生的，形成一个花冠筒。"},{"en":"Connascent stamens can make identification of a species easier.","zh":"合生的雄蕊有时能让物种鉴定更容易。"}]}],"synonyms":["innate","inborn","congenital","fused","united"],"phonetic":"/kəˈnæsənt/","extraExplanation":["这个词比较罕见，多见于学术写作（尤其是植物形态学）。它强调“从一开始就一起长/一起形成”，区别于后期由于黏连、愈合或生长挤压而“变得连在一起”的情况。","词源上可拆为 con-（一起）+ nascent（正在出生/产生的），整体带有“同生、共生”的含义。"]}
{"word":"connatal","summary":{"en":"Connatal means “present from birth; inborn,” and is a less common synonym of congenital/innate.","zh":"connatal 意为“先天的、与生俱来的”，较少见，近义于 congenital/innate。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"existing from birth; inborn (often used in biology or psychology, similar to “congenital” or “innate”).","zh":"先天的；与生俱来的（常用于生物学或心理学语境，类似 congenital/innate）。"},"examples":[{"en":"The study suggests that some connatal traits may influence how infants respond to stress.","zh":"研究表明，一些先天特质可能会影响婴儿对压力的反应。"},{"en":"Doctors ruled out connatal heart defects after the screening.","zh":"筛查后，医生排除了先天性心脏缺陷的可能。"}]}],"synonyms":["congenital","innate","inborn","inherent"],"phonetic":"/kəˈneɪtəl/","extraExplanation":["“connatal”较少见，常出现在学术写作中；日常英语里更常用“congenital”（先天性的，尤指疾病/缺陷）或“innate”（与生俱来的，多指能力/特质）。","词源上与拉丁语natal（出生）有关，前缀con-/com-有“共同、一起”的含义，引申为“从出生起就伴随的”。","使用提醒：谈医学上的“先天性疾病/缺陷”时，用“congenital”更自然；谈性格、倾向、能力等更抽象的“天生”特质时，用“innate”更常见。"]}
{"word":"connate","summary":{"en":"Connate most commonly means “sharing the same origin,” especially of words; less commonly it means “inborn/from birth.”","zh":"connate 最常指“同源的”（尤其指词语）；较少见时指“与生俱来的/天生的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Linguistics) Related by origin; derived from the same ancestral word or root.","zh":"（语言学）同源的；源自同一个祖先词或词根的。"},"examples":[{"en":"English “mother” and German “Mutter” are connate words.","zh":"英语 mother 和德语 Mutter 是同源词。"},{"en":"These two verbs look different today, but they are connate in origin.","zh":"这两个动词如今看起来不同，但起源同源。"}]},{"partOfSpeech":"adj.","definition":{"en":"Born together; existing from birth; innate (often used in older or formal writing).","zh":"（较正式/较旧用法）同生的；与生俱来的；天生的。"},"examples":[{"en":"Some writers spoke of “connate” talents, meaning abilities present from birth.","zh":"一些作者谈到“connate”天赋，意为与生俱来的能力。"},{"en":"The poet described courage as connate, not learned.","zh":"诗人把勇气描述为天生的，而不是后天学来的。"}]}],"synonyms":["cognate","related","kindred","inborn","innate"],"phonetic":"/ˈkɑː.neɪt/","extraExplanation":["“connate”来自拉丁语 con-（一起）+ natus（出生的）。在现代英语里最常见于语言学语境，意思接近“cognate（同源的）”。在一般写作中更常用 cognate；connate 的“天生的”含义较少见、偏文雅。"]}
{"word":"connate-leaved","summary":{"en":"A botanical adjective meaning the leaves are joined (fused) together at their bases.","zh":"一个植物学形容词，指叶子（常为对生叶）在基部连合/愈合在一起。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having leaves that are connate: joined together at their bases (often in opposite pairs) so they appear fused into one.","zh":"（植物）对生叶在基部连合（愈合）在一起，常看起来像一片叶子。"},"examples":[{"en":"The plant has connate-leaved nodes, with each pair of leaves fused around the stem.","zh":"这种植物的节上为连叶（连合叶），每对叶子在茎周围愈合在一起。"},{"en":"Look for connate-leaved pairs—two opposite leaves joined at the base.","zh":"可以观察是否有连叶：两片对生叶在基部相连。"}]}],"synonyms":["connate","fused-leaved","united-leaved"],"phonetic":"/kɑˈneɪt liːvd/","extraExplanation":["“connate-”来自拉丁语词根 con-（共同）+ natus（出生），在植物学里表示“天生长在一起/连合”。因此 connate-leaved 强调的是“叶片在形成时就连在一起”，而不是后来黏住或缠在一起。","常见于野外识别描述：例如“对生叶基部连合、形成杯状或似穿茎”的外观。需要注意它与“perfoliate（穿茎叶）”相近但不完全相同：perfoliate 更强调茎看起来穿过叶片中央的效果。"]}
{"word":"connately","summary":{"en":"Connately means “innately; from birth,” and is a rare, academic word related to connate.","zh":"connately 意为“先天地、与生俱来地”，较少见，多用于学术语境，源自 connate。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an inborn or innate way; existing from birth rather than learned or acquired later.","zh":"先天（与生俱来）地；出生时就存在，而非后天习得或获得地。"},"examples":[{"en":"Some birds respond connately to certain warning calls.","zh":"有些鸟对特定的警戒叫声会先天地做出反应。"},{"en":"The study explores whether empathy is connately present or shaped by culture.","zh":"这项研究探讨同理心是先天存在，还是由文化塑造。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that is naturally joined, related, or originating together (used mainly in biology and academic writing).","zh":"（多用于生物学/学术语境）以自然相连、同源或共同起源的方式。"},"examples":[{"en":"These structures are connately fused during early development.","zh":"这些结构在早期发育阶段先天地融合在一起。"},{"en":"The paper argues the two traits are connately linked.","zh":"论文认为这两种特征是先天关联的。"}]}],"synonyms":["innately","inherently","by nature","naturally","from birth"],"phonetic":"/kəˈneɪtli/","extraExplanation":["“connately”比较少见，更多时候人们会用更常用的副词来表达同样意思，比如：innately（先天地）、by nature（本性上）、from birth（从出生起）。","它来自形容词“connate”，源于拉丁语 con-（一起）+ natus（出生）。学术写作里常见“connate + 名词/动词（如 connate fusion）”来描述“先天融合/同源”的概念。"]}
{"word":"connateness","summary":{"en":"Connateness means the quality of being innate, or (in biology/botany) being fused together from early development.","zh":"connateness 指“与生俱来/先天性”，也可指（生物/植物）在早期发育中“连生、合生”的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being inborn or naturally present; innateness","zh":"天生的状态；与生俱来的性质"},"examples":[{"en":"Some philosophers discuss the connateness of certain moral ideas.","zh":"一些哲学家讨论某些道德观念是否具有与生俱来的性质。"},{"en":"The study examined whether language ability shows connateness or is mainly learned.","zh":"这项研究考察语言能力是天生的，还是主要靠后天学习。"}]},{"partOfSpeech":"n.","definition":{"en":"(biology/botany) the condition of being joined or fused together from birth or early development","zh":"（生物/植物）先天连生、合生的状态（从出生或早期发育起就连接/融合在一起）"},"examples":[{"en":"In some flowers, the connateness of petals forms a tube.","zh":"在一些花中，花瓣的合生会形成花筒。"},{"en":"Botanists noted the connateness of the leaf bases near the stem.","zh":"植物学家注意到叶基部在茎附近的合生现象。"}]}],"synonyms":["innateness","inbornness","innate quality","congenital nature","fusion (in botany, related)"],"phonetic":"/kəˈneɪtnəs/","extraExplanation":["“connateness”来自形容词“connate”（意为“天生的；连生的”），词源可追溯到拉丁语 con-（一起）+ natus（出生的）。在日常英语里较少见，更常用的是“innateness”（天生/先天性）或直接用“innate”。"]}
{"word":"connation","summary":{"en":"Connotation is the implied or emotional meaning a word suggests beyond its literal definition.","zh":"Connotation 指词语除字面义外所带的“内涵/联想/情感色彩”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the emotional, cultural, or implied meaning that a word suggests, beyond its basic dictionary meaning","zh":"（词语的）内涵意义；联想意义：除了字面/字典义之外，词语所带有的情感色彩、文化暗示或言外之意"},"examples":[{"en":"“Cheap” has a negative connotation, while “affordable” sounds more positive.","zh":"“cheap”常带负面内涵，而“affordable”听起来更偏正面。"},{"en":"The word “home” carries warm connotations of safety and family.","zh":"“home”常让人联想到安全与家庭，带有温暖的内涵。"}]},{"partOfSpeech":"n.","definition":{"en":"an associated idea or quality that a word or phrase brings to mind","zh":"联想出的观念或特质；由某个词/短语引发的相关想法"},"examples":[{"en":"For some readers, the color white has connotations of purity.","zh":"对一些读者来说，白色会让人联想到“纯洁”。"}]}],"synonyms":["implication","association","undertone","overtones","suggestion"],"phonetic":"/ˌkɑnəˈteɪʃən/","extraExplanation":["你输入的“connation”更常见的正确拼写是 **connotation**（中间有“o-ta”）。","学习时常和 **denotation** 对比：denotation 是“字面/指称义”（词典里最直接的意思）；connotation 是“情感与联想”（褒贬色彩、文化暗示、语气）。例如：childlike（多为褒义：天真）与 childish（多为贬义：幼稚）指称义相近，但内涵不同。","写作与阅读中，作者会利用 connotation 来塑造语气与人物形象：同一事实用不同词表达，会带来不同态度与情绪。"]}
{"word":"connatural","summary":{"en":"Connatural means “inborn or inherent,” or more formally “of the same nature; naturally akin.”","zh":"connatural 指“与生俱来、固有的”，更正式时也可指“同一性质的、天然相近的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Naturally belonging to someone or something; inborn; inherent.","zh":"天生属于……的；与生俱来的；固有的。"},"examples":[{"en":"A sense of curiosity is connatural to many children.","zh":"好奇心对很多孩子来说是与生俱来的。"},{"en":"In his novels, loneliness feels connatural to the main characters.","zh":"在他的小说里，孤独感仿佛是主角们固有的一部分。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Philosophy / formal) Of the same nature; naturally akin or closely related.","zh":"（哲学/正式）同一性质的；本性相近的；天然类似的。"},"examples":[{"en":"Some thinkers argue that reason is connatural with human nature.","zh":"一些思想家认为理性与人性本质相近。"},{"en":"These two values may seem different, but they are connatural in practice.","zh":"这两种价值观看似不同，但在实践中却有天然的相似性。"}]}],"synonyms":["innate","inherent","inborn","intrinsic","natural"],"phonetic":"/kɑˈnætʃərəl/","extraExplanation":["“connatural”比较正式、书面，日常英语里更常用 inherent（固有的）、innate（先天的）、inborn（天生的）来表达类似意思。","词源上 con- 表示“共同/一起”，natural 表示“自然的/本性的”，合起来有“本性上同属于……/自然相合”的感觉，常见于哲学、神学或文学评论。"]}
{"word":"connaturality","summary":{"en":"Connaturality means an inborn natural affinity or compatibility; in philosophy/theology, it can mean an innate disposition toward certain truths or values.","zh":"Connaturality 指与生俱来的亲和力或相容性；在哲学/神学语境中也可指对某些真理或价值的内在禀赋与自然倾向。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a natural, inborn compatibility or affinity between people, things, or ideas; a “fit” that feels inherent rather than learned","zh":"（人与人、事物或观念之间）与生俱来的相容性、天然的契合/亲和力；不是后天学来的“合得来”"},"examples":[{"en":"She felt an immediate connaturality with the small coastal town, as if she belonged there.","zh":"她立刻觉得自己和那座海边小镇有一种天然的契合感，仿佛本就属于那里。"},{"en":"Their teamwork showed a rare connaturality—each person’s strengths naturally matched the other’s.","zh":"他们的合作展现出少见的天然默契——彼此的长处自然互补。"}]},{"partOfSpeech":"n.","definition":{"en":"(philosophy/theology) an innate disposition that makes someone naturally inclined toward certain truths, values, or ways of acting","zh":"（哲学/神学）一种内在禀赋或天性，使人自然倾向于某些真理、价值或行为方式"},"examples":[{"en":"Some writers describe moral understanding as rooted in connaturality rather than in formal argument.","zh":"有些作者认为，道德理解的根源在于“内在的契合/天赋的领会”，而非严格的论证。"},{"en":"In spiritual writing, connaturality can mean a heart-level grasp of goodness developed through lived practice.","zh":"在灵修写作中，connaturality 可以指通过生活实践而形成的、发自内心对善的领会。"}]}],"synonyms":["affinity","compatibility","natural fit","kinship","rapport"],"phonetic":"/ˌkɑnˌnætʃəˈræləti/","extraExplanation":["词源上，connaturality 来自拉丁语前缀 con-（一起）+ natura（自然/本性），字面意思接近“共同的本性”。","它在日常英语里比较少见，更常出现在学术写作或较正式的文风中。一般口语更常用 affinity（亲和力）、chemistry（化学反应/合拍）、natural fit（天然契合）。"]}
{"word":"connaturalize","summary":{"en":"Connaturalize means to make something feel natural or part of someone’s nature (a rare, formal verb).","zh":"connaturalize 指使某事变得“自然而然”、像是人的本性一样（较罕见且正式的动词）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something feel natural, inborn, or perfectly fitting (especially an idea, habit, or attitude); to naturalize or internalize so it seems part of one’s nature","zh":"使某事物显得自然、天生或非常契合（尤指观念、习惯或态度）；使之“内化”为仿佛本性的一部分"},"examples":[{"en":"Over time, the new routine became connaturalized, and she followed it without thinking.","zh":"随着时间推移，这套新作息被“内化”了，她几乎不假思索就会照做。"},{"en":"Some schools try to connaturalize curiosity by rewarding questions, not just correct answers.","zh":"一些学校试图通过奖励提问而不只奖励正确答案来让好奇心变得“自然而然”。"}]}],"synonyms":["internalize","naturalize","ingrain","instill","habituate"],"phonetic":"/kəˈnætʃ(ə)rəˌlaɪz/","extraExplanation":["这个词很少见，多出现在哲学、神学或较正式的学术写作里。它由 con-（“共同、一起”）+ natural（“自然的、本性的”）+ -ize（“使成为……”）构成，强调“让某种东西与人的本性/习惯融为一体”。日常英语里更常用 internalize（内化）、naturalize（使自然化）、ingrain（使根深蒂固）来表达相近意思。"]}
{"word":"connaturally","summary":{"en":"Connaturally means “by nature; innately,” often used in formal English.","zh":"connaturally 表示“天生地；本性使然地”，多用于较正式的英语表达。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a natural or inherent way; as part of someone’s or something’s nature.","zh":"天生地；本性使然地；与生俱来地。"},"examples":[{"en":"She is connaturally curious, always asking questions.","zh":"她天生就很有好奇心，总是在提问题。"},{"en":"Some people are connaturally optimistic, even in difficult times.","zh":"有些人即使在困难时期也天生乐观。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that is naturally fitting or consistent (often used in formal writing).","zh":"自然地相符合；顺理成章地（常见于较正式的表达）。"},"examples":[{"en":"His role as a mentor connaturally followed from his years of experience.","zh":"他多年经验使他担任导师这一角色显得顺理成章。"}]}],"synonyms":["innately","inherently","naturally","by nature","instinctively"],"phonetic":"/kəˈnætʃ(ə)rəli/","extraExplanation":["词源提示：connaturally 来自 con-（“共同、一起”）+ natural（“自然的”），字面上有“与某种天性一起生成”的感觉，所以常用来强调“不是后天学来的，而是本来就如此”。","语体与用法：这个词比较书面、偏正式。日常口语里更常用 naturally, inherently, by nature, instinctively 来表达类似意思。"]}
{"word":"connaturalness","summary":{"en":"Connaturalness means an inborn, natural fit or harmony with something; in formal writing it can also mean an innate disposition that helps someone grasp certain virtues or truths.","zh":"Connaturalness 指与某事物天生契合/自然相合；在正式（哲学/神学）语境中也可指一种与生俱来的倾向，使人更容易领会某些德性或真理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being connatural; an inborn or natural harmony/fit between a person (or thing) and a quality, action, or way of life","zh":"（与某种品质/行为/生活方式）天生契合的状态；出于本性的自然相合/相配"},"examples":[{"en":"She felt a connaturalness with teaching, as if it was what she had always been meant to do.","zh":"她觉得自己与教学有一种天生的契合，仿佛这就是她一直注定要做的事。"},{"en":"Their shared values created a quiet connaturalness between them.","zh":"他们共同的价值观在彼此之间形成了一种安静的自然相合。"}]},{"partOfSpeech":"n.","definition":{"en":"(formal, philosophy/theology) an innate tendency or “built-in” orientation that makes someone naturally receptive to certain truths or virtues","zh":"（正式用法；哲学/神学）一种与生俱来的倾向或“内在指向”，使人对某些真理或德性天然更能领会或接受"},"examples":[{"en":"Some writers say moral education is helped by connaturalness—people grasp goodness not only by reasoning but also by character.","zh":"一些作者认为，道德教育会受到“天生领会力”的帮助：人们理解善不仅靠推理，也靠品格。"},{"en":"In spiritual writing, connaturalness can mean knowing something through lived affinity rather than through analysis alone.","zh":"在灵修写作中，“connaturalness”可以指通过生活中的亲和与体验来认识某事，而不只是靠分析。"}]}],"synonyms":["innateness","natural affinity","inborn fit","congeniality","natural harmony"],"phonetic":"/kəˈnætʃrəl.nəs/","extraExplanation":["“connaturalness”来自形容词“connatural”（与生俱来的；本性相合的）+ 名词后缀“-ness”。它较少用于日常口语，更常见于学术、哲学或神学语境。","相关词：connatural（adj. 本性相合的）、connaturally（adv. 本性地）。在宗教/哲学文本中，它有时与“通过品格与体验获得的认识”相对，区别于纯粹理性推导的认识。"]}
{"word":"connature","summary":{"en":"“Connature” means to be naturally connected with something, often implying it as part of its nature.","zh":"“connature”表示与某事天生相关，常带“必然暗示/意味着”的意思，较正式。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to be naturally connected with something; to imply or suggest something as part of its nature","zh":"（与某事）天生相关；含有、暗示（作为其本质的一部分）"},"examples":[{"en":"For many people, leadership connatures responsibility.","zh":"对很多人来说，领导力天生就意味着责任。"},{"en":"In his essays, the author argues that freedom connatures risk.","zh":"在他的随笔中，作者认为自由必然伴随着风险。"}]},{"partOfSpeech":"vi.","definition":{"en":"to share the same nature or character","zh":"具有相同的本性或特质"},"examples":[{"en":"Honesty and trust connature in healthy relationships.","zh":"在健康的人际关系中，诚实与信任往往同根同源。"}]}],"synonyms":["imply","entail","be associated with","be linked to","go hand in hand with"],"phonetic":"/kəˈnætʃər/","extraExplanation":["“connature”较偏正式，多见于学术写作或哲学/伦理讨论中；日常英语里更常用“be associated with”“imply”“go hand in hand with”。","词源来自拉丁语 con-（共同）+ nature（本性/天性），核心感觉是“天生就连在一起”。"]}
{"word":"Connaught","summary":{"en":"Connaught is the traditional English name for Ireland’s western province, also known as Connacht.","zh":"Connaught 是爱尔兰西部省份的传统英文名，也称 Connacht（康诺特）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditional province in the west of Ireland (one of the four provinces), including counties such as Galway and Mayo; also spelled “Connacht.”","zh":"爱尔兰西部的传统省份（四大省之一），包括戈尔韦、梅奥等郡；也常拼作“Connacht”（康诺特）。"},"examples":[{"en":"She grew up in Connaught, near the Atlantic coast.","zh":"她在康诺特长大，靠近大西洋海岸。"},{"en":"The novel is set in rural Connaught in the early 1900s.","zh":"这部小说背景设定在20世纪初的康诺特乡村地区。"}]},{"partOfSpeech":"n.","definition":{"en":"Historically, the medieval Irish kingdom/region corresponding roughly to the same area.","zh":"历史上指与该地区大致相当的中世纪爱尔兰王国/地域。"},"examples":[{"en":"In medieval sources, Connaught appears as a powerful regional kingdom.","zh":"在中世纪文献中，康诺特常被描写为一个强大的地区王国。"}]}],"synonyms":["Connacht"],"phonetic":"/ˈkɑnɔt/","extraExplanation":["“Connaught”是英语中较传统、偏英式的拼法；现代在爱尔兰更常见、也更贴近爱尔兰语原名的拼法是“Connacht”。","在文学与历史叙述里，这个地名常带有“爱尔兰西部”“乡村/盖尔文化传统”等联想（具体仍取决于语境）。"]}
{"word":"connaught","summary":{"en":"Connaught is the traditional name (now often spelled Connacht) for the western province of Ireland; it can also mean “from or relating to that region.”","zh":"Connaught（现代常写作 Connacht）是爱尔兰西部省份的传统名称；也可作形容词表示“来自该地区的/与该地区有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A province in the west of Ireland (modern spelling: Connacht), traditionally including counties like Galway, Mayo, Sligo, Leitrim, and Roscommon.","zh":"爱尔兰西部的一个省（现代常拼作 Connacht），传统上包括戈尔韦、梅奥、斯莱戈、利特里姆、罗斯康芒等郡。"},"examples":[{"en":"She grew up in Connaught and later moved to Dublin for work.","zh":"她在康诺特长大，后来为了工作搬到都柏林。"},{"en":"We drove across Connaught to reach the Atlantic coast.","zh":"我们穿越康诺特，抵达大西洋海岸。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to Connaught/Connacht or its people, culture, or dialects.","zh":"与康诺特/康诺赫特（Connacht）及其居民、文化或方言有关的。"},"examples":[{"en":"They performed Connaught folk songs at the festival.","zh":"他们在节庆上演唱了康诺特民歌。"},{"en":"The museum has a small collection of Connaught art.","zh":"那家博物馆有一小批康诺特地区的艺术收藏。"}]}],"synonyms":["Connacht"],"phonetic":"/ˈkɑːnɔːt/","extraExplanation":["“Connaught”是较传统或旧式的英文拼写；在现代爱尔兰语与当代英文语境中，更常见的拼写是“Connacht”。两者指同一地区。","该词来自爱尔兰语“Connachta”，与早期爱尔兰的部族/王国名称有关，因此在历史、地理、文学或旅游文本中都可能出现。","在英国历史语境里也可能见到头衔“Duke of Connaught”（康诺特公爵），指与该地名相关的贵族称号。"]}
{"word":"Conneaut","summary":{"en":"Conneaut is a place name, most commonly a city in Ohio on Lake Erie; it can also refer to Conneaut Creek.","zh":"Conneaut 是一个地名，最常指伊利湖畔的俄亥俄州城市；也可指 Conneaut Creek（科尼奥特溪）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a city in northeastern Ohio, U.S., on Lake Erie (in Ashtabula County).","zh":"美国俄亥俄州东北部的一座城市，位于伊利湖畔（阿什塔比拉县）。"},"examples":[{"en":"Conneaut is known for its lakeside views and small-town feel.","zh":"Conneaut 以湖滨景色和小镇氛围而闻名。"},{"en":"We drove along Lake Erie and stopped in Conneaut for lunch.","zh":"我们沿着伊利湖开车，在 Conneaut 停下来吃午饭。"}]},{"partOfSpeech":"n.","definition":{"en":"(also Conneaut Creek) a creek/stream in Pennsylvania and Ohio that flows into Lake Erie.","zh":"（也指 Conneaut Creek）一条流经宾夕法尼亚州和俄亥俄州、最终注入伊利湖的溪流。"},"examples":[{"en":"Conneaut Creek runs through farmland before reaching Lake Erie.","zh":"Conneaut Creek 穿过农田后汇入伊利湖。"},{"en":"They went fishing near Conneaut Creek after the rain.","zh":"雨后他们在 Conneaut Creek 附近钓鱼。"}]}],"synonyms":["Conneaut Creek","Lake Erie (region)"],"phonetic":"/ˈkɑniˌɔt/","extraExplanation":["“Conneaut”通常被认为源自当地原住民语言（常被解释为与“河流/溪流”有关的意思），因此既可指地名，也常见于水系名称（如 Conneaut Creek）。","作为专有名词，英文书写首字母大写（Conneaut）。在口语中，人们通常直接把它当作地名使用，不需要冠词：如“in Conneaut”。"]}
{"word":"Conneautville","summary":{"en":"Conneautville is a borough (small town) in Crawford County, Pennsylvania, USA.","zh":"Conneautville 是美国宾夕法尼亚州克劳福德县的一个自治镇（小镇）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small borough (town) in northwestern Pennsylvania, USA, in Crawford County.","zh":"美国宾夕法尼亚州西北部克劳福德县的一个小镇（自治镇/borough），名为康尼奥特维尔。"},"examples":[{"en":"She grew up in Conneautville, Pennsylvania.","zh":"她在宾夕法尼亚州的康尼奥特维尔长大。"},{"en":"Conneautville is a quiet place with a small-town feel.","zh":"康尼奥特维尔很安静，有典型小镇的氛围。"}]}],"phonetic":"/kəˈniːətˌvɪl/","extraExplanation":["“Conneautville”是地名（专有名词），常见于美国地址、地图、新闻与个人背景介绍中。","它的前半部分“Conneaut-”与当地的 Conneaut Creek（康尼奥特溪）有关；“Conneaut”被认为源自美洲原住民语言，但不同资料对其精确词源与含义的解释可能不一致。"]}
{"word":"connect","summary":{"en":"“Connect” means to link things or people, make contact, or understand a relationship between ideas; it can also mean to bond with someone.","zh":"“connect”表示把事物/人连接起来、取得联系、理解关联，也可表示与某人建立情感联系（聊得来）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to join or link people, things, or places so they work together or can communicate","zh":"连接；把人、物或地点连在一起，使其协同工作或能够沟通"},"examples":[{"en":"Connect the printer to your laptop with a USB cable.","zh":"用USB线把打印机连接到你的笔记本电脑上。"},{"en":"This bridge connects the island to the mainland.","zh":"这座桥把岛屿和大陆连接起来。"}]},{"partOfSpeech":"vt.","definition":{"en":"to contact someone (by phone, email, online, etc.)","zh":"联系（某人）；（通过电话、邮件、网络等）取得联系"},"examples":[{"en":"I tried to connect with her by email, but she hasn’t replied.","zh":"我试着通过邮件联系她，但她还没回复。"}]},{"partOfSpeech":"vt.","definition":{"en":"to understand that two ideas or events are related; to see the relationship","zh":"把……联系起来；理解两件事之间有关联"},"examples":[{"en":"I didn’t connect his cough with the allergy at first.","zh":"一开始我没有把他的咳嗽和过敏联系起来。"},{"en":"Kids often connect stories to their own experiences.","zh":"孩子们常常把故事和自己的经历联系起来。"}]},{"partOfSpeech":"vi.","definition":{"en":"to feel a friendly or emotional bond with someone; to “click”","zh":"与……产生共鸣/建立情感联系；合得来"},"examples":[{"en":"We connected right away because we both love cooking.","zh":"我们因为都喜欢做饭，一下子就聊得来。"}]}],"synonyms":["link","join","attach","contact","relate"],"phonetic":"/kəˈnɛkt/","extraExplanation":["常见搭配：connect A to/with B（把A与B连接）；connect with sb（与某人建立联系/产生共鸣，语气更偏“合得来”）；connect the dots（把线索联系起来，弄明白真相）。","在科技语境里，connect 既可以指“物理连接”（线缆、接口），也可以指“网络连接/接通”（电话接通、Wi‑Fi连上）。"]}
{"word":"connect ... to ...","summary":{"en":"to join something with something else or relate one thing to another","zh":"把某物与另一物连接起来，或把两者联系起来"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to join or link one thing with another (physically, electronically, or logically)","zh":"把一个东西与另一个东西连接起来（物理、电子或逻辑上的连接）"},"examples":[{"en":"Connect the printer to your laptop with a USB cable.","zh":"用USB线把打印机连接到你的笔记本电脑上。"},{"en":"Please connect these two wires to the battery.","zh":"请把这两根电线接到电池上。"},{"en":"The app connects your phone to the speaker automatically.","zh":"这个应用会自动把你的手机连接到音箱。"}]},{"partOfSpeech":"phrase","definition":{"en":"to show or understand the relationship between two ideas, events, or facts","zh":"把两个想法、事件或事实联系起来；看出它们之间的关联"},"examples":[{"en":"It’s hard to connect his cough to the new medicine.","zh":"很难把他的咳嗽和新药联系起来。"},{"en":"She connected the sudden silence to his angry look.","zh":"她把突然的沉默和他生气的眼神联系起来。"},{"en":"Try to connect what you learned today to your real life.","zh":"试着把你今天学到的东西和现实生活联系起来。"}]}],"synonyms":["link ... to ...","attach ... to ...","join ... to ...","tie ... to ...","relate ... to ...","associate ... with ..."],"phonetic":"/kəˈnɛkt/","extraExplanation":["用法要点：connect A to B 强调“把A接到B上/把A连到B”，常见于设备、线路、交通等；如果强调“与……有关/联系”，英语里也很常用 connect A with B（尤其在英式英语中更常见）。","常见结构：connect A to B；be connected to…（与……相连/有关联）；connect…to the internet（连接网络）；connect the dots（把线索串起来/看出联系，常作比喻）。"],"etymology":"connect 来自拉丁语 connectere（con- “一起” + nectere “绑/系/连接”），原义是“把东西绑在一起”，后来扩展为“建立联系、关联”。","mnemonic":["con- 表示“一起”（像中文“共/同”），nect 像“拧/捏”把东西拧到一起 → “连接”。","联想：网线把电脑“拴到”路由器上 → connect A to B。"]}
{"word":"connect ... with","summary":{"en":"link or associate things; make contact and communicate","zh":"连接或关联事物；取得联系并沟通"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to join or link one thing to another (physically or technically)","zh":"把一物与另一物连接起来（物理上或技术上）"},"examples":[{"en":"Connect the printer with the computer using a USB cable.","zh":"用USB线把打印机和电脑连接起来。"},{"en":"The bridge connects the island with the mainland.","zh":"这座桥把岛屿和大陆连接起来。"}]},{"partOfSpeech":"phrase","definition":{"en":"to show or believe that two things are related; to associate A with B","zh":"把两件事联系起来；认为A与B有关"},"examples":[{"en":"Many people connect stress with poor sleep.","zh":"很多人把压力和睡眠不好联系在一起。"},{"en":"I always connect this song with my high school days.","zh":"我总把这首歌和高中时光联系在一起。"},{"en":"Don’t connect her quietness with rudeness.","zh":"别把她的安静和不礼貌联系在一起。"}]},{"partOfSpeech":"phrase","definition":{"en":"to contact someone and start communicating; to reach someone and talk","zh":"与某人取得联系并开始交流；联系上"},"examples":[{"en":"I tried to connect with customer service, but the line was busy.","zh":"我试着联系客服电话，但线路一直占线。"},{"en":"It’s easier to connect with coworkers when you ask questions and listen.","zh":"多提问并倾听，会更容易和同事建立沟通与联系。"}]}],"synonyms":["link","join","attach","associate","relate","tie","hook up","reach","get in touch"],"phonetic":"/kəˈnɛkt/","extraExplanation":["常见结构：connect A with B（把A与B连接/联系起来）。也可用 connect A to B，偏“把A接到B上”；connect with 更常见于“与人沟通/建立共鸣”。"],"etymology":"源自拉丁语 connectere（con- “一起” + nectere “系上、绑住”），原意是“绑在一起”，后来引申为“联系、关联、沟通”。","mnemonic":["con- 表示“一起”，想成“把两样东西一起接上”。","nect 和“neck（脖子）”联想：像用“脖子上的围巾”把两端系在一起→连接。"]}
{"word":"connect ... with ...","summary":{"en":"link or associate two things; join them so they work together","zh":"把两者联系/关联起来；或连接使其协同工作"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to link one thing or person to another; to associate them so people see a relationship","zh":"把某事/某人与另一事/另一人联系起来；把两者关联起来"},"examples":[{"en":"People often connect rainy days with feeling sleepy.","zh":"人们常把下雨天和犯困联系在一起。"},{"en":"The police connected the suspect with the stolen car.","zh":"警方把嫌疑人和被盗车辆联系起来。"},{"en":"She connects this song with her childhood.","zh":"她把这首歌和自己的童年联系在一起。"}]},{"partOfSpeech":"phrase","definition":{"en":"to join things so they work together as a system (especially in technology or networks)","zh":"（尤指技术/网络中）把事物连接起来，使其成为一个系统并能协同工作"},"examples":[{"en":"Connect the printer with your laptop using a USB cable.","zh":"用USB线把打印机和笔记本电脑连接起来。"},{"en":"The bridge connects the island with the mainland.","zh":"这座桥把岛屿和大陆连接起来。"}]}],"synonyms":["link","associate","relate","tie","connect","join","couple","hook up","bridge"],"phonetic":"/kəˈnɛkt/","extraExplanation":["常见句型：connect A with B（把A与B联系/连接起来）。A和B也可互换：connect B with A。","和 connect to 的区别：connect to 更常说“连接到某个点/系统/网络”（如 connect to Wi‑Fi）；connect with 更强调“把两者连在一起”或“建立联系/合作”（如 connect with customers）。在英美英语中两者有时会混用，但含义侧重不同。","在“关联”这个意思里，常搭配 be connected with（与……有关）：The illness is connected with smoking（这种病与吸烟有关）。"],"etymology":"connect 来自拉丁语 connectere（con- “一起” + nectere “绑、系”），本义是“绑在一起”，后来引申为“联系、连接”。","mnemonic":["con- 表示“一起”，nect- 可联想“系/绑”（像“纽带”）：把两样东西“绑在一起”就是“连接/联系”。","把 with 记成“和……一起”：connect A with B = 让A和B在一起（连接/关联）。"]}
{"word":"connect A to B","summary":{"en":"to link or relate two things so they work together or show a relationship","zh":"把两者连接起来或建立联系"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to join A and B so they are linked or able to work together (physically, electronically, or logically)","zh":"把A和B连接起来，使它们在物理上、电子上或逻辑上相连/能一起工作"},"examples":[{"en":"Connect the printer to the computer with a USB cable.","zh":"用USB线把打印机连接到电脑。"},{"en":"The bridge connects the island to the mainland.","zh":"这座桥把岛屿和大陆连接起来。"},{"en":"Please connect your phone to Wi‑Fi before updating.","zh":"更新前请先把手机连接到Wi‑Fi。"}]},{"partOfSpeech":"phrase","definition":{"en":"to relate A and B by showing a clear relationship (cause, idea, meaning, or pattern)","zh":"把A和B联系起来，指出它们之间的关系（原因、观点、含义或规律）"},"examples":[{"en":"I didn’t connect his symptoms to the allergy at first.","zh":"起初我没把他的症状和过敏联系起来。"},{"en":"Students connect the story to their own experiences.","zh":"学生把故事和自己的经历联系起来。"}]}],"synonyms":["link","join","attach","hook up","tie","relate","associate","couple"],"phonetic":"/kəˈnɛkt/","extraExplanation":["常见结构：connect A to B（把A接到B上）；connect A with B（把A和B联系/关联起来，或把A与B连接在一起，语气更“并列”）。","被动也常见：A is connected to B（A与B相连/有关）。","日常口语里“接通电话”常说 connect me to…（把我转接到……）或 put me through to…（更口语/电话场景）。"],"etymology":"来自拉丁语 connectere，con-（一起）+ nectere（绑、系、连接）。英语里 connect 表示“连接/联系”，结构 connect A to B 强调把A接到B上。","mnemonic":["con- 表示“一起/共同”，nect 类似“拧/系”的感觉：把两样东西“拧在一起”→连接。","联想中文：把A“接到”B上＝connect A to B（to 像“到/向”）。"]}
{"word":"connect A with B","summary":{"en":"link A and B; make them related or joined","zh":"把A与B连接或联系起来"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to join A and B so they become linked or work together (physically, by a wire/pipe, or as ideas/people)","zh":"把A和B连接起来，使它们在物理上或概念上建立联系/协同"},"examples":[{"en":"Connect your phone with the speaker using Bluetooth.","zh":"用蓝牙把你的手机和音箱连接起来。"},{"en":"The teacher connected the story with the history lesson.","zh":"老师把这个故事和历史课联系起来。"},{"en":"We need to connect the new road with the highway.","zh":"我们需要把新路和高速公路连接起来。"}]},{"partOfSpeech":"phrase","definition":{"en":"to introduce A to B so they can communicate or cooperate","zh":"把A介绍给B认识，使双方建立联系或合作"},"examples":[{"en":"Can you connect me with the hiring manager?","zh":"你能把我引荐给招聘经理吗？"},{"en":"I’ll connect you with our customer support team.","zh":"我会把你转接到我们的客服团队。"}]}],"synonyms":["link A with B","join A to B","attach A to B","tie A to B","associate A with B","relate A to B","connect A to B"],"phonetic":"/kəˈnɛkt eɪ wɪð biː/","extraExplanation":["常见搭配：connect A with B（强调把两者联系起来）；connect A to B（更常用于物理连接，如电缆/管道，也可用于抽象连接）。","在商务/电话语境里，connect someone with someone 常表示“转接/引荐”。","名词 connection 表示“连接、关系、人脉”。"],"etymology":"源自拉丁语 connectere（con- “一起” + nectere “绑、系”），原义是“绑在一起”，后来引申为“联结、联系”。","mnemonic":["con- 表“共同/一起”，nect- 可联想“系结(连接)”：把两样东西“拴在一起”。","把 with 理解为“和……一起”：connect A with B = 让A和B在一起。"]}
{"word":"connect it to a computer","summary":{"en":"attach a device to a computer so it can work or transfer data","zh":"把设备连到电脑上以便使用或传输数据"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to attach a device (or something) to a computer so they can communicate or work together, usually with a cable or wireless connection","zh":"把某个设备（或物品）连接到电脑上，让它们能通信或一起工作，通常通过数据线或无线连接"},"examples":[{"en":"Connect it to a computer with a USB cable, then install the driver.","zh":"用USB数据线把它连接到电脑上，然后安装驱动。"},{"en":"If the screen stays black, try connecting it to a different computer.","zh":"如果屏幕一直是黑的，试试把它连接到另一台电脑。"},{"en":"Once you connect it to a computer, you can transfer the photos.","zh":"把它连接到电脑后，你就可以传输照片了。"}]}],"synonyms":["plug it into a computer","hook it up to a computer","link it to a computer","attach it to a computer"],"phonetic":"/kəˈnɛkt ɪt tə ə kəmˈpjuːtɚ/","extraExplanation":["“it”指代前面提到的设备/物品（如相机、手机、打印机、硬盘等）。","常见搭配：connect it to a computer（连接到电脑上）；connect it to the internet（连接到互联网）。","口语中也常说：hook it up to a computer（把它接到电脑上，较口语）。"],"etymology":"“connect”来自拉丁语 connectere，原意是“把……绑在一起、连接在一起”。现代英语里常用于设备之间建立有线或无线连接。","mnemonic":["把 connect 记成“con(一起)+nect(连结)”→“连到一起”。","联想中文“连接”：连=connect，接=plug in / attach，合起来就是“连上并接上”。"]}
{"word":"connect people","summary":{"en":"bring people together or enable communication between them","zh":"把人联系起来，或让人之间建立沟通连接"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to bring people together so they can meet, communicate, or build relationships","zh":"把人们联系在一起，使他们认识、沟通或建立关系"},"examples":[{"en":"This community center connects people from different neighborhoods.","zh":"这个社区中心把来自不同街区的人们联系在一起。"},{"en":"Her job is to connect people who can help each other.","zh":"她的工作是把能够互相帮助的人联系起来。"},{"en":"Social media can connect people across long distances.","zh":"社交媒体可以把相隔很远的人联系起来。"}]},{"partOfSpeech":"phrase","definition":{"en":"to enable people to communicate by phone, video call, or online systems","zh":"让人们通过电话、视频或网络系统建立通信连接"},"examples":[{"en":"Could you connect me with the sales team?","zh":"你能帮我接通销售团队吗？"},{"en":"The app connects people with local doctors in minutes.","zh":"这个应用能在几分钟内把用户和本地医生连接起来。"}]}],"synonyms":["bring people together","link people","introduce","network","put in touch","bridge","unite"],"phonetic":"/kəˈnɛkt ˈpipəl/","etymology":"“connect”来自拉丁语 connectere（con- 表“共同” + nectere 表“绑、系”），原意是“把东西绑在一起”，后来引申为“建立联系/沟通”。“people”来自拉丁语 populus（人民、民众）。","mnemonic":["con- = “一起”，nect = “系/连”（联想“脐带/纽带”把人连起来）→ connect people = 把人用“纽带”连接起来。","记成“connect = 可耐克特（连起来）”，connect people = 让人们“可耐克特”地互相联系。"]}
{"word":"connect the dots","summary":{"en":"Understand by linking separate clues or facts.","zh":"把零散线索串联起来而理解真相或关系。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"To understand the hidden meaning or the full situation by linking separate facts, clues, or events.","zh":"把零散的信息联系起来，从而理解隐含意义或完整情况。"},"examples":[{"en":"After reading the emails, she finally connected the dots and realized he had been lying.","zh":"读完那些邮件后，她终于把线索串起来，意识到他一直在撒谎。"},{"en":"It took the team a week to connect the dots between the bug reports and the new update.","zh":"团队花了一周才把漏洞报告和新更新联系起来。"}]},{"partOfSpeech":"phrase","definition":{"en":"To explain how separate ideas or events are related, so others can understand the logic.","zh":"把不同的想法或事件之间的关系讲清楚，让别人理解其中的逻辑。"},"examples":[{"en":"Can you connect the dots for me? I’m not sure how these two issues are related.","zh":"你能帮我把逻辑串起来吗？我不确定这两个问题有什么关系。"},{"en":"The speaker connected the dots between diet, sleep, and learning performance.","zh":"演讲者把饮食、睡眠和学习表现之间的关系讲明白了。"}]}],"synonyms":["figure out","piece together","put two and two together","make sense of","draw conclusions","see the connection"],"phonetic":"/kəˈnɛkt ðə dɑts/","extraExplanation":["常见语气是“突然明白了”的那一刻：强调从碎片信息→整体理解。","既可用于私人推理（发现真相），也可用于工作表达（把因果关系讲清楚）。"],"etymology":"源自“连点成画”的益智游戏/儿童涂画（connect-the-dots）：把编号的点依次连线就会出现一幅完整图案。后来引申为“把零碎线索串联起来得出结论”。","mnemonic":["想象小时候的“连点成画”：点=线索，连起来=真相/图案就出现了。","把 dots 联想到“点点滴滴的信息”，connect 就是“串起来”。"]}
{"word":"connect to","summary":{"en":"to link, access, or relate something to another thing","zh":"连接到；连上（网络/设备）；与……联系起来"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to join or link one thing with another (physically or by a system such as electricity or pipes)","zh":"把一个东西与另一个东西连接起来（实体连接或通过电、管道等系统连接）"},"examples":[{"en":"Connect the printer to your laptop with a USB cable.","zh":"用USB线把打印机连接到你的笔记本电脑上。"},{"en":"The water tank is connected to the house by a pipe.","zh":"水箱通过管道与房子相连。"}]},{"partOfSpeech":"phrase","definition":{"en":"to access a network, website, device, or service by establishing a communication link","zh":"通过建立通信连接来访问网络、网站、设备或服务"},"examples":[{"en":"My phone can’t connect to the Wi‑Fi.","zh":"我的手机连不上Wi‑Fi。"},{"en":"Try restarting the router and connecting to the network again.","zh":"试着重启路由器，然后再连接网络。"}]},{"partOfSpeech":"phrase","definition":{"en":"to relate something to something else; to see a relationship between ideas, events, or people","zh":"把……与……联系起来；看出想法、事件或人物之间的关联"},"examples":[{"en":"I didn’t connect his comments to the meeting last week until now.","zh":"直到现在我才把他的评论和上周的会议联系起来。"},{"en":"It’s hard to connect this symptom to stress.","zh":"很难把这个症状和压力联系起来。"}]}],"synonyms":["link to","attach to","join to","hook up to","plug into","log on to","access","relate to","associate with"],"phonetic":"/kəˈnɛkt tu/","extraExplanation":["常见搭配：connect A to B（把A连接到B）；be connected to（与……有关/相连）。","口语中常说：connect to Wi‑Fi / connect to the internet；而 connect with 更偏“与人建立联系、产生共鸣”。"],"etymology":"connect 来自拉丁语 connectere（con- “共同/一起” + nectere “捆绑、系上”），原意是“绑在一起”，后来引申为“连接、联结（实体或抽象）”。to 表示“朝向/到……”。","mnemonic":["con- = 一起；nect ≈ “拧/系/绑”（想象把两根线“系在一起”→连接）。","记搭配：A connect to B = A 连到 B（to 表“到/向”）。"]}
{"word":"connect to the Internet","summary":{"en":"Get online by linking to the Internet.","zh":"通过连接互联网来上网。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"To link a device or system to the Internet so it can send and receive data online.","zh":"将设备或系统连接到互联网，以便在线收发数据。"},"examples":[{"en":"I can’t connect to the Internet on this laptop.","zh":"这台笔记本电脑连不上网。"},{"en":"Try restarting the router to connect to the Internet again.","zh":"试着重启路由器，让它重新联网。"}]}],"synonyms":["get online","go online","log on","connect online"],"phonetic":"/kəˈnɛkt tu ði ˈɪntɚˌnɛt/","extraExplanation":["我无法替你“真正联网”或访问实时网页内容，但我可以帮你排查为什么连不上网，或给出不同设备（Windows/macOS/iPhone/Android）的连接步骤。","如果你是想让我去网上查资料：我不能直接浏览互联网；你可以把网页内容、截图或关键信息发来，我可以帮你总结、翻译或分析。"],"etymology":"由动词 connect（连接）+ 介词 to（到）+ 名词 Internet（互联网）组成；Internet 在当代英语中常特指全球互联网络。","mnemonic":["把它拆开记：connect=连接，to=到，Internet=互联网 → “连接到互联网”。","联想中文“联网”：connect to the Internet ≈ 联网。"]}
{"word":"connect with","summary":{"en":"to get in touch, build a relationship, or relate emotionally","zh":"取得联系、建立关系或产生共鸣"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to communicate or form a relationship with someone; to get in touch","zh":"与某人建立联系；取得联系；沟通"},"examples":[{"en":"I’ll connect with you after the meeting to confirm the details.","zh":"我会在会后和你联系，确认细节。"},{"en":"She quickly connected with her new coworkers.","zh":"她很快就和新同事建立了良好的关系。"},{"en":"If you have questions, connect with our support team.","zh":"如果你有问题，请联系我们的客服团队。"}]},{"partOfSpeech":"phrase","definition":{"en":"to relate to something emotionally or understand it because it feels familiar","zh":"在情感上产生共鸣；觉得“能理解/对得上”"},"examples":[{"en":"A lot of readers connect with the main character’s loneliness.","zh":"很多读者对主角的孤独感产生共鸣。"},{"en":"I didn’t connect with that movie—it felt too slow for me.","zh":"我对那部电影没共鸣——对我来说节奏太慢了。"}]},{"partOfSpeech":"phrase","definition":{"en":"to make contact successfully (by phone, video call, or online); to reach someone","zh":"（电话/视频/网络）接通；联系上；成功联络到"},"examples":[{"en":"I tried calling, but I couldn’t connect with him.","zh":"我试着打电话，但一直联系不上他。"},{"en":"We finally connected with the doctor on a video call.","zh":"我们终于通过视频电话联系上了医生。"}]},{"partOfSpeech":"phrase","definition":{"en":"to link or join with something; to be connected (often about systems, places, or parts)","zh":"与……连接；与……衔接（常指系统、地点或部件）"},"examples":[{"en":"This bus connects with the subway at the next station.","zh":"这趟公交在下一站与地铁换乘衔接。"},{"en":"The app connects with your calendar automatically.","zh":"这个应用会自动连接你的日历。"}]}],"synonyms":["get in touch with","reach out to","contact","communicate with","relate to","identify with","resonate with","link up with","connect to"],"phonetic":"/kəˈnɛkt wɪð/","extraExplanation":["常见搭配：connect with someone（联系某人/与某人合得来）、connect with an audience（与观众产生共鸣）、connect with a service/device（与服务/设备连接）。","语气区别：get in touch with 更口语、强调“联系一下”；connect with 更强调“建立联系/产生共鸣/接通成功”。"],"etymology":"源自拉丁语 connectere（con- “一起” + nectere “绑、系、连”），本义是“把东西连到一起”，后来引申为“与人建立联系/产生共鸣”。","mnemonic":["con- 表示“一起”，nect 像“连结的结/纽带”：把你和别人“连在一起”= connect with。","联想中文“连接/联络/共鸣”三件事：先连接（物理/网络）→再联络（联系上）→最后共鸣（心连上）。"]}
{"word":"connect with sb.","summary":{"en":"get in touch or build rapport with someone","zh":"与某人取得联系或建立融洽关系"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to get in touch with someone (by phone, email, social media, etc.)","zh":"与某人取得联系（通过电话、邮件、社交媒体等）"},"examples":[{"en":"I’ll connect with you after the meeting to confirm the details.","zh":"会议结束后我会联系你确认细节。"},{"en":"She connected with him on LinkedIn and sent a short message.","zh":"她在领英上加了他并发了一条简短消息。"}]},{"partOfSpeech":"phrase","definition":{"en":"to build a friendly relationship or feel mutual understanding with someone","zh":"与某人建立融洽关系；产生共鸣、互相理解"},"examples":[{"en":"The teacher quickly connected with her students.","zh":"这位老师很快就和学生们建立了良好关系。"},{"en":"I didn’t really connect with him—we have very different interests.","zh":"我和他不太合得来——我们兴趣差异很大。"}]}],"synonyms":["contact","get in touch","reach out","communicate","follow up","relate to","bond with","click with"],"phonetic":"/kəˈnɛkt/","extraExplanation":["常见搭配：connect with sb (联系/建立关系)；connect to sth（连接到某物/网络）。注意介词：对“人”多用 with，对“设备/系统/地点”多用 to。","语域提示：在职场邮件里，connect with sb 很常见，语气比 contact sb 稍微更“合作/跟进”的感觉，例如：Let’s connect next week."],"etymology":"connect 来自拉丁语 connectere，意为“把……绑在一起、连接”。现代英语中既可指“物理/网络连接”，也常引申为“与人建立联系或关系”。","mnemonic":["con-（一起）+ nect（可联想“连结”）：把你和对方“连到一起”，就表示“联系/建立联系”。","把它记成“跟某人连上线”：connect with sb = 跟某人搭上线、取得联系。"]}
{"word":"connectability","summary":{"en":"Connectability means the ability or ease of being able to connect, especially between devices, systems, or people.","zh":"Connectability 指“可连接性/连接能力”，常用于描述设备、系统或人之间是否容易实现连接。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or ability of something to connect to something else (physically, technically, or socially)","zh":"（某物）可连接性；连接能力（可在物理、技术或社交层面与其他事物连接）"},"examples":[{"en":"The connectability of these two cables depends on whether the plugs match.","zh":"这两根线是否能连接，取决于插头是否匹配。"},{"en":"In team projects, connectability matters because people need to share ideas easily.","zh":"在团队项目中，可连接性很重要，因为人们需要容易地分享想法。"}]},{"partOfSpeech":"n.","definition":{"en":"(technology) how easily a device, app, or system can connect and communicate with other devices or networks","zh":"（科技）互联互通能力；联网/联接便利性（设备、应用或系统与其他设备或网络连接并通信的容易程度）"},"examples":[{"en":"Good Wi‑Fi improves the connectability of smart home devices.","zh":"良好的 Wi‑Fi 会提升智能家居设备的互联互通能力。"},{"en":"The new update increased the app’s connectability with third‑party services.","zh":"这次更新增强了该应用与第三方服务的互联能力。"}]}],"synonyms":["connectivity","compatibility","interoperability","linkability"],"phonetic":"/kəˌnɛk.təˈbɪl.ə.ti/","extraExplanation":["“connectability”由 connect + -able + -ity 构成，字面意思是“可被连接的性质/程度”。在日常英语中更常见的表达是 connectivity（连接性/网络连接能力），但在强调“是否能连接、能不能兼容”时也会用 connectability。"]}
{"word":"connectable","summary":{"en":"Connectable means “able to be connected,” often used in tech/product contexts.","zh":"Connectable 意为“可连接的”，常用于科技或产品说明语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to be connected or joined to something else (physically, digitally, or logically).","zh":"可连接的；能与其他事物相连或接合的（物理、数字或逻辑层面都可以）。"},"examples":[{"en":"Make sure the cable is connectable to your laptop’s port.","zh":"确保这根线缆能连接到你笔记本电脑的接口。"},{"en":"The app is connectable to several fitness trackers.","zh":"这个应用可以连接多种健身追踪器。"}]},{"partOfSpeech":"adj.","definition":{"en":"(computing/tech) able to connect to a network or device, especially without special extra steps.","zh":"（计算机/科技）可联网的；可与设备或网络建立连接的（通常指无需复杂额外步骤）。"},"examples":[{"en":"This printer is connectable via Wi‑Fi or USB.","zh":"这台打印机可通过 Wi‑Fi 或 USB 连接。"},{"en":"Check whether the speaker is connectable to Bluetooth.","zh":"检查这款音箱是否能连接蓝牙。"}]}],"synonyms":["compatible","attachable","linkable","joinable"],"phonetic":"/kəˈnɛktəbəl/","extraExplanation":["“connectable”由 connect + -able 构成，-able 表示“能够……的”。在日常写作中更常见的说法有“can be connected / compatible / works with”。“connectable”在产品说明、技术文档里更常用。"]}
{"word":"connectant","summary":{"en":"“Connectant” means a connector—especially a linking word in linguistics—or something that connects.","zh":"“connectant”指连接成分（尤其是语言学里的连接词），也可作形容词表示“起连接作用的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Linguistics) A connecting word or element that links parts of a sentence or discourse, such as a conjunction or discourse marker.","zh":"（语言学）连接词/连接成分：用来把句子或语篇中的部分连接起来的词或成分，如连词或话语标记。"},"examples":[{"en":"In “I was tired, so I went home,” the connectant “so” shows the result.","zh":"在“I was tired, so I went home”中，连接词“so”表示结果。"},{"en":"Teachers often highlight connectants like “however” and “therefore” to improve writing flow.","zh":"老师常会强调“however”“therefore”等连接成分，以提升写作的衔接与流畅度。"}]},{"partOfSpeech":"adj.","definition":{"en":"Connecting; serving to link two things together.","zh":"连接的；起连接作用的。"},"examples":[{"en":"The report adds a short connectant paragraph between the two sections.","zh":"这份报告在两部分之间加了一段起连接作用的过渡段。"}]}],"synonyms":["connector","linking word","conjunction","transition","discourse marker"],"phonetic":"/kəˈnɛk.tənt/","extraExplanation":["“connectant”在现代日常英语中不常用，更常见的说法是“connector / linking word / conjunction / discourse marker”。它多见于语言学、修辞学或较正式的写作分析语境。"]}
{"word":"connected","summary":{"en":"Connected means linked together or related; also can mean online or having strong social/professional connections.","zh":"connected 表示“连接/关联的”，也可指“已联网的”或“人脉广、有门路的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Joined or linked together; having a relationship so that things affect each other.","zh":"连接在一起的；有关联的（彼此会相互影响）。"},"examples":[{"en":"The two buildings are connected by a glass bridge.","zh":"两栋楼由一座玻璃桥连接在一起。"},{"en":"Stress and sleep problems are often connected.","zh":"压力和睡眠问题常常有关联。"}]},{"partOfSpeech":"adj.","definition":{"en":"Able to access the internet or a network; online.","zh":"联网的；可接入网络的；在线的。"},"examples":[{"en":"Make sure your laptop is connected to Wi‑Fi.","zh":"确保你的笔记本电脑已连接到 Wi‑Fi。"},{"en":"I can’t join the meeting—I’m not connected right now.","zh":"我现在没法参加会议——我目前没联网。"}]},{"partOfSpeech":"adj.","definition":{"en":"Knowing useful people and having good social or professional relationships.","zh":"人脉广的；有门路的（在社交或职场关系上很“吃得开”）。"},"examples":[{"en":"She’s well connected in the film industry.","zh":"她在电影圈人脉很广。"},{"en":"He got the interview through a connected friend.","zh":"他通过一个有门路的朋友拿到了面试机会。"}]},{"partOfSpeech":"v.","definition":{"en":"(Past tense/past participle of connect) Joined, linked, or put into contact.","zh":"（connect 的过去式/过去分词）连接了；联系了；使接触了。"},"examples":[{"en":"I connected the printer to my computer.","zh":"我把打印机连接到了电脑上。"},{"en":"The counselor connected me with a support group.","zh":"咨询师把我介绍给了一个互助小组。"}]}],"synonyms":["linked","related","joined","networked","associated"],"phonetic":"/kəˈnɛktɪd/","extraExplanation":["“connected”常见两种语法来源：一是形容词（表示“有联系的/联网的/有人脉的”），二是动词 connect 的过去式/过去分词（表示“已经连接/联系”）。在口语里，形容词用法很常见：I’m connected. 通常指“我联网了/我在线”。","社交含义的“well connected”在英语文化里经常带有“关系很硬/有背景”的意味，语气可能中性也可能略带批评，取决于上下文。"]}
{"word":"connected to","summary":{"en":"related or linked; joined to (physically, digitally, or socially)","zh":"与……相关或相连；（物理/数字/社会关系上）连接到……"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"related to or associated with something; having a clear relationship","zh":"与……有关；和……相关"},"examples":[{"en":"Her stomach pain may be connected to stress.","zh":"她的胃痛可能和压力有关。"},{"en":"This chapter is closely connected to the main theme of the book.","zh":"这一章和全书的主题密切相关。"}]},{"partOfSpeech":"phrase","definition":{"en":"linked physically or electronically; able to communicate or work together (often about devices, networks, or systems)","zh":"（物理或电子方式）连接到……；（设备/网络）已接入、可联通"},"examples":[{"en":"Make sure the printer is connected to the Wi‑Fi network.","zh":"确保打印机已连接到无线网络。"},{"en":"The microphone is connected to the computer by a cable.","zh":"麦克风通过电缆连接到电脑。"}]},{"partOfSpeech":"phrase","definition":{"en":"having an affiliation or relationship with a person, organization, or event (sometimes implying involvement)","zh":"与（某人/组织/事件）有关系；有关联（有时暗示牵涉其中）"},"examples":[{"en":"He was connected to the company through his uncle.","zh":"他通过叔叔与那家公司有关系。"},{"en":"Police said the suspect may be connected to the thefts.","zh":"警方表示嫌疑人可能与这些盗窃案有关。"}]}],"synonyms":["related to","linked to","associated with","tied to","attached to","involved with","affiliated with"],"phonetic":"/kəˈnɛktɪd tə/","extraExplanation":["常见结构：be connected to + 名词/动名词（与……有关）；connect A to B（把A连接到B）。","语气差别：connected to 表“有关联/相关”；related to 更中性、更书面；associated with 常用于“与某事物常常一起出现/有关联”。","在科技语境里，connected to 常指“已接入/联通”（网络、蓝牙、账户等）。"],"etymology":"来自拉丁语 connectere（con- “一起” + nectere “绑、系、连接”），原意是“把东西绑在一起”，后来引申为“关联、联系”。","mnemonic":["con- = “一起”，nect = “绑/连”（想成“拧在一起”）：合起来就是“连到一起 → 有关联”。","联想“网络已连上(connected)”：connected to Wi‑Fi = 连到Wi‑Fi。"]}
{"word":"connected to a person's","summary":{"en":"relating to an individual person; private or individual","zh":"与个人有关的；私人或个人层面的"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"related to one particular person; belonging to or concerning an individual (not a group)","zh":"与某个特定的人有关的；个人的；属于某人的"},"examples":[{"en":"This is a personal matter, so I’d rather not discuss it at work.","zh":"这是个人的事情，所以我不想在工作场合讨论。"},{"en":"Please don’t share my personal information online.","zh":"请不要把我的个人信息发到网上。"},{"en":"She keeps a personal diary to record her thoughts.","zh":"她写个人日记来记录自己的想法。"}]},{"partOfSpeech":"adj.","definition":{"en":"private or intimate; about someone’s feelings, body, or relationships","zh":"私人的；涉及隐私或亲密关系的"},"examples":[{"en":"He asked some very personal questions.","zh":"他问了一些很私人的问题。"},{"en":"It’s personal to me because it involves my family.","zh":"这对我来说很私人，因为涉及我的家人。"}]},{"partOfSpeech":"adj.","definition":{"en":"done by one person for their own use or comfort (often: personal best / personal use)","zh":"供个人使用的；个人层面的（常见于：个人最好成绩/自用）"},"examples":[{"en":"I bought it for personal use, not for resale.","zh":"我买这个是自用，不是为了转卖。"},{"en":"He set a new personal best in the 5K.","zh":"他在5公里赛中创造了个人最好成绩。"}]}],"synonyms":["individual","private","own","intimate","confidential"],"phonetic":"/ˈpɝːsənəl/","etymology":"源自拉丁语 persona（“人、角色”），经由法语进入英语；最初与“人物/身份”有关，后来引申为“个人的、私人的”。","mnemonic":["把 personal 拆成 person（人）+ -al（……的）→“人的/个人的”。","联想“个人信息=personal information（个人+信息）”，看到 personal 就想到“隐私/个人”。"]}
{"word":"connected to each other","summary":{"en":"interlinked; mutually related","zh":"相互连接；彼此关联"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"linked or joined so that each part relates to the others; interconnected","zh":"彼此连接的；相互关联的；互相联系的"},"examples":[{"en":"The villages are connected to each other by small roads.","zh":"这些村庄通过小路彼此相连。"},{"en":"These ideas are connected to each other, so you should study them together.","zh":"这些观点彼此关联，所以你应该一起学习。"},{"en":"In a healthy team, people feel connected to each other.","zh":"在健康的团队里，人们会感到彼此有连接感。"}]}],"synonyms":["interconnected","linked","joined","related","associated","connected","interlinked"],"phonetic":"/kəˈnɛktɪd tə itʃ ˈʌðər/","extraExplanation":["常见结构：be connected to + 名词/代词（表示“与……相连/相关”）。“to each other”强调“双方/多方互相”，相当于“mutually”。","在口语里也常说“connected with each other”，意思相近；“connected to”更常用于“物理连接/网络连接”，但也可用于抽象关系。"],"etymology":"“connected”来自拉丁语词根 connectere（con- “一起” + nectere “绑/系/连接”），原意是“绑在一起”，后来引申为“有关联”。","mnemonic":["把 con- 记成“共同/一起（共）”，nect 记成“连接（连）”：con+nect → “共同连接”。","联想中文固定搭配“彼此相连/相互关联”，对应 to each other（彼此）。"]}
{"word":"connected to the Internet","summary":{"en":"online and able to access the web","zh":"已联网、可上网"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"able to access the Internet; online (with an Internet connection).","zh":"能连接并访问互联网的；在线的（有网络连接）。"},"examples":[{"en":"Make sure your phone is connected to the Internet before you download the app.","zh":"下载这个应用前，先确认你的手机已连接到互联网。"},{"en":"If you’re not connected to the Internet, the map may not update.","zh":"如果你没有连接到互联网，地图可能不会更新。"},{"en":"The printer works only when it’s connected to the Internet.","zh":"这台打印机只有在连接到互联网时才能工作。"}]}],"synonyms":["online","on the Internet","internet-connected","web-connected","have Internet access"],"phonetic":"/kəˈnɛktɪd tə ði ˈɪntɚˌnɛt/","extraExplanation":["常见近义表达：online（在线的）、on the Internet（在网上）、connected to Wi‑Fi（连上Wi‑Fi，强调无线网络）、have Internet access（有网络访问权限）。","英美日常中更口语的说法常是：Are you online? / I’m not online right now.（你在线吗？/ 我现在没联网。）","注意区别：connected to the Internet（有外网连接）≠ connected to a network（连接到局域网/公司内网，可能没外网）。"],"etymology":"这是现代科技语境中的固定搭配：connect（连接）+ to（到）+ the Internet（互联网）。随着互联网普及，这种表达在日常英语中变得非常常见。","mnemonic":["把它拆开记：connected（连上了）+ to（到）+ the Internet（互联网）→“连到互联网”。","联想手机状态栏：出现“Wi‑Fi/4G/5G”并能打开网页＝connected to the Internet（已联网）。"]}
{"word":"connected with","summary":{"en":"related to; associated with","zh":"与……有关；相关"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"related to something; associated with it (often used in formal writing)","zh":"与……有关；与……相关（常用于较正式表达）"},"examples":[{"en":"This rise in prices may be connected with the recent shortage of oil.","zh":"这次价格上涨可能与近期石油短缺有关。"},{"en":"His research is connected with climate change and public health.","zh":"他的研究与气候变化和公共健康相关。"}]},{"partOfSpeech":"phrase","definition":{"en":"having a personal or business relationship with someone or an organization","zh":"与某人或某机构有关系；有联系（人际/业务关系）"},"examples":[{"en":"She is connected with several charities in the city.","zh":"她与城里的几家慈善机构有联系。"},{"en":"The suspect was connected with a local gang.","zh":"嫌疑人被认为与当地帮派有关联。"}]}],"synonyms":["related to","associated with","linked to","tied to","in connection with","in relation to","having to do with","involved with","affiliated with"],"phonetic":"kəˈnɛktɪd wɪð","extraExplanation":["常见搭配：be connected with + 名词（与……有关）。语气偏正式，写作/新闻中很常见。","近义表达区分：connected with 强调“有关联/牵涉”；connected to 更强调“连接到/通向”（也可表示相关，但更口语、更偏“连接”感）。例如：The printer is connected to my laptop（打印机连接到电脑）。The problem is connected with stress（问题与压力有关）。"],"etymology":"“connect”来自拉丁语 connectere（con- “一起” + nectere “绑、系”），原义有“把……连在一起”。“connected with”在现代英语中常引申为“与……有关联/相关”。","mnemonic":["把它想成“连（connect）在一起（with）”：两件事被“连起来”，就表示“有关联”。","con- 表示“一起”，nect- 可联想“系/绑”，合起来就是“连在一起→有关联”。"]}
{"word":"connectedly","summary":{"en":"Connectedly means “in a connected or coherent way,” linking ideas or facts rather than treating them separately.","zh":"connectedly 指“以相互关联或连贯的方式”，强调把观点或事实联系起来而非割裂处理。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a connected way; as part of the same system, relationship, or chain of ideas.","zh":"以相互关联的方式；作为同一系统、关系或思路链条的一部分。"},"examples":[{"en":"We should discuss these issues connectedly, not as separate problems.","zh":"我们应该把这些问题联系起来讨论，而不是当作彼此独立的问题。"},{"en":"The author explains the events connectedly so the reader can see cause and effect.","zh":"作者把事件有条理地联系起来解释，让读者看出因果关系。"}]},{"partOfSpeech":"adv.","definition":{"en":"Coherently; in a clear, logically linked manner (especially in writing or speaking).","zh":"连贯地；以清晰、逻辑衔接的方式（尤用于写作或口语表达）。"},"examples":[{"en":"She couldn’t speak connectedly after the long night without sleep.","zh":"熬了一整夜没睡后，她说话已经难以连贯。"},{"en":"Try to present your argument more connectedly, step by step.","zh":"尽量把你的论点讲得更连贯一些，一步一步来。"}]}],"synonyms":["coherently","logically","in a connected way","in relation","in connection"],"phonetic":"/kəˈnɛktɪdli/","extraExplanation":["“connectedly”在现代英语里比较少见，更常用的替代表达是“coherently / in a connected way / in connection with”。如果你写作想更自然，通常用“coherently”表示“连贯地”，用“in connection with”表示“与……有关”。"]}
{"word":"connectedness","summary":{"en":"Connectedness means the state or feeling of being linked—especially a sense of belonging or relationship between people, things, or ideas.","zh":"Connectedness 指“相互连接/关联的状态或感觉”，常强调人与人之间的连结感与归属感，也可指事物或概念之间的关联。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being connected or linked to other people, things, or ideas; a sense that relationships and connections exist","zh":"连接（联系）的状态；与他人、事物或想法相互关联的感觉"},"examples":[{"en":"The internet increases connectedness between people across the world.","zh":"互联网增强了世界各地人们之间的连结感。"},{"en":"In the essay, the author explains the connectedness of all living things.","zh":"在这篇文章里，作者解释了所有生物之间的相互关联。"},{"en":"Regular team meetings improved the group’s connectedness and trust.","zh":"定期团队会议提升了团队的连结感与信任。"}]},{"partOfSpeech":"n.","definition":{"en":"(psychology, sociology) a feeling of belonging and close relationship with a community or group","zh":"（心理学/社会学）归属感；与群体或社区的亲密联系感"},"examples":[{"en":"Volunteering can build connectedness in a neighborhood.","zh":"志愿服务可以增强社区的归属感与连结感。"},{"en":"Students reported stronger connectedness when teachers learned their names.","zh":"当老师记住学生名字时，学生表示连结感更强。"}]}],"synonyms":["connection","connectedness","linkage","relationship","bond","interconnectedness","belonging"],"phonetic":"/kəˈnɛktɪdnəs/","extraExplanation":["connectedness 通常是不可数名词，常见搭配有：social connectedness（社会连结感）、sense of connectedness（连结感）、connectedness between A and B（A 与 B 的关联）。在学术写作中，它经常用于讨论人际关系、社区、自然生态或系统之间的“相互依存”。"]}
{"word":"connecter","summary":{"en":"“Connecter” is usually a misspelling of “connector”: a device that connects parts, a linking word/phrase in writing, or a person who brings people together.","zh":"“connecter”通常是“connector”的误拼：可指连接器/接头、写作中的连接词/衔接表达，或牵线搭桥的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device, plug, or piece of hardware that joins two parts (especially in electronics, cables, or plumbing) so they work together","zh":"连接器；接头（尤指电子设备、电缆或管道中用来把两部分连接起来的装置）"},"examples":[{"en":"This cable needs a USB-C connector.","zh":"这根线需要一个 USB-C 接口/连接器。"},{"en":"Make sure the connector is firmly attached before turning on the power.","zh":"通电前要确保连接器已经牢牢接好。"}]},{"partOfSpeech":"n.","definition":{"en":"a word or phrase that links ideas in speech or writing (e.g., “however,” “because,” “in addition”)","zh":"连接词；衔接表达（用于连接句子或观点的词/短语，如“however”“because”“in addition”）"},"examples":[{"en":"Use connectors like “however” to show contrast.","zh":"用“however”这类连接词来表示对比。"},{"en":"“Because” is a connector that introduces a reason.","zh":"“because”是用来引出原因的连接词。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who helps bring people together or create useful contacts (networking)","zh":"牵线人；搭桥的人（帮助建立人脉或促成联系的人）"},"examples":[{"en":"She’s a great connector who introduces talented people to the right teams.","zh":"她很会牵线搭桥，能把有才华的人介绍给合适的团队。"}]}],"synonyms":["connector","link","coupler","adapter","joiner","conjunction","networker"],"phonetic":"/kəˈnɛktɚ/","extraExplanation":["“connecter”在现代英语里不常见；大多数情况下你要找的是“connector”。在一些旧用法中，“connecter”可指“连接的人/物”，但在科技与日常表达里通常都用“connector”。","如果你是在法语语境看到“connecter/connecteur”，对应英文更常用“connector”。"]}
{"word":"connectere","summary":{"en":"Connectere is a Latin verb meaning “to bind together; to connect,” mainly seen today in etymology or classical-language contexts.","zh":"connectere 是拉丁语动词，意思是“绑在一起；连接”，如今主要用于词源学或古典语言语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Latin) to bind or fasten together; to connect, link, or join.","zh":"（拉丁语）把……绑在一起；连接、联结、结合。"},"examples":[{"en":"The Latin verb connectere is the source of the English word connect.","zh":"拉丁语动词 connectere 是英文 connect 的词源。"},{"en":"In classical texts, connectere can describe tying things together with rope.","zh":"在古典文本中，connectere 可用来表示用绳子把东西绑在一起。"}]}],"synonyms":["link","join","bind","fasten","connect"],"phonetic":"/kəˈnɛk.təˌreɪ/","extraExplanation":["connectere 是拉丁语不定式，常见词源拆解为 con-（“一起、共同”）+ nectere（“绑、系、缚”）。它体现了“把分开的东西系在一起”的核心意象，这个意象也延续到英语 connect 的现代含义（人际、网络、概念上的“连接”）。","在英语学习中，你更常遇到的是 connect / connection / connective 等词；connectere 主要出现在词源学、古典语言或学术讨论里。"]}
{"word":"connecters","summary":{"en":"Connectors are either devices that join things (like cable plugs) or words/phrases that link ideas in writing and speech.","zh":"Connectors 既可以指连接设备的“接头/连接器”，也可以指写作或口语中连接观点的“连接词/过渡表达”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device or part used to join two things together (especially cables, pipes, or pieces of equipment)","zh":"连接器；接头（用于把两样东西连接在一起，尤指电缆、管道或设备部件）"},"examples":[{"en":"This cable needs a different connector to fit the port.","zh":"这条线需要换一种接头才能插进这个接口。"},{"en":"Make sure the connectors are clean and dry before you plug it in.","zh":"插上之前要确保接头干净、干燥。"}]},{"partOfSpeech":"n.","definition":{"en":"a word or phrase that links ideas in writing or speech (for example, “however,” “because,” or “in addition”)","zh":"连接词；衔接表达（用于在口语或写作中连接观点，如“however / because / in addition”等）"},"examples":[{"en":"Use connectors like “however” and “therefore” to show contrast or result.","zh":"用“however”“therefore”等连接词来表达转折或结果。"},{"en":"Good connectors make your paragraph easier to follow.","zh":"好的衔接词能让段落更容易读懂。"}]}],"synonyms":["link","joining piece","coupling","adapter","transition word","linking word"],"phonetic":"/kəˈnɛktɚ/","extraExplanation":["你输入的“connecters”更常见的标准拼写是“connectors”（美式更常见；英式也常用 connector）。也有人写“connecter”，但相对少见，尤其在技术语境里通常写 connector。","在写作课里说的“connectors”通常指“linking words / transition words（过渡词）”，不一定是硬件“连接器”。看上下文判断即可。"]}
{"word":"connectibility","summary":{"en":"Connectibility means the ability or quality of being able to connect.","zh":"Connectibility 指“可连接性”，即能够连接或被连接的能力/特性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or capability of being connected or able to connect (people, things, systems, or devices)","zh":"可连接性；连接的能力（指人、事物、系统或设备能够被连接或能够连接他者的特性）"},"examples":[{"en":"In a remote area, phone connectibility can be poor because there are few cell towers.","zh":"在偏远地区，由于基站很少，手机的可连接性可能很差。"},{"en":"The app’s success depends on its connectibility with popular services like email and calendars.","zh":"这款应用的成功取决于它与邮箱、日历等常用服务的可连接性。"}]}],"synonyms":["connectability","connectivity","linkability","compatibility (in some contexts)"],"phonetic":"/kəˌnɛktəˈbɪləti/","extraExplanation":["“connectibility”在现代英语中相对少见，更常见的拼写是“connectability”。两者意思基本相同。","在科技语境里，它常用来谈网络/设备之间是否容易建立连接；在更抽象的语境里，也可指人与人、想法与想法之间“容易建立联系”的特性。"]}
{"word":"connectible","summary":{"en":"“Connectible” means “able to be connected or linked.”","zh":"“connectible”表示“可连接的、可联结的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be connected, joined, or linked (physically, electronically, or logically).","zh":"可连接的；可接通的；可联结的（可指物理、电气或逻辑上的连接）。"},"examples":[{"en":"Make sure the cable is connectible to your laptop’s port.","zh":"确认这根线缆能连接到你笔记本电脑的接口上。"},{"en":"The two systems are connectible through an API.","zh":"这两个系统可以通过 API 连接起来。"},{"en":"These parts aren’t connectible without an adapter.","zh":"没有转换头，这些部件无法连接。"}]}],"synonyms":["connectable","linkable","joinable","attachable"],"phonetic":"/kəˈnɛktəbəl/","extraExplanation":["“connectible”是“connectable”的较少见拼写/用法变体，意思相同。日常写作与技术文档里更常见的是“connectable”。","在工程或计算机语境里，常见搭配有：connectible to/with（可与……连接）、connectible through/via（可通过……连接）。"]}
{"word":"connectibly","summary":{"en":"“Connectibly” (rare) means “in a connectable/linkable way,” and sometimes “in a logically connected way.”","zh":"“connectibly”（较少见）意为“以可连接/可关联的方式”，有时也指“逻辑上连贯地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that can be connected or linked; so that connection is possible.","zh":"以可连接的方式；能够被连接或关联。"},"examples":[{"en":"These two parts fit connectibly if you align the arrows.","zh":"如果你对齐箭头，这两部分就能以可连接的方式拼接在一起。"},{"en":"The software stores data connectibly, so different systems can share it.","zh":"这个软件以可连接的方式存储数据，因此不同系统可以共享。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Rare) In a logically related or coherent way; with a clear connection between ideas.","zh":"（较少见）以有逻辑关联的方式；前后连贯地。"},"examples":[{"en":"Try to explain your points connectibly, step by step.","zh":"尽量把你的观点讲得有逻辑关联，一步一步来。"},{"en":"The writer connects events connectibly, making the story easy to follow.","zh":"作者把事件关联得很连贯，让故事更容易读懂。"}]}],"synonyms":["in a connectable way","linkably","compatibly","coherently"],"phonetic":"/kəˈnɛktəbli/","extraExplanation":["“connectibly”不是常见词，更自然的表达通常是：\n- “in a way that can be connected”（以可连接的方式）\n- “connectable/compatible/interoperable”（可连接/兼容/可互通）\n在写作中如果不确定读者是否认识该词，建议用更常见的替换说法。"]}
{"word":"Connecticut","summary":{"en":"Connecticut is a U.S. state in New England, in the northeastern United States.","zh":"Connecticut 是美国新英格兰地区（东北部）的一个州。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A state in the northeastern U.S. (New England), known for its coastline on Long Island Sound and for being between New York and Massachusetts.","zh":"美国东北部（新英格兰地区）的一个州，濒临长岛海峡，位于纽约州与马萨诸塞州之间。"},"examples":[{"en":"Hartford is the capital of Connecticut.","zh":"哈特福德是康涅狄格州的首府。"},{"en":"She moved from New York to Connecticut for a quieter suburban life.","zh":"她从纽约搬到康涅狄格州，想过更安静的郊区生活。"}]}],"synonyms":["CT","the Constitution State"],"phonetic":"/kəˈnɛtɪkət/","extraExplanation":["“Connecticut”这个名字来源于美洲原住民（多认为是阿尔冈昆语系）对当地河流的称呼，常被解释为“长潮汐河/长河”。拼写里有很多不发音或弱读的字母，所以常见发音是 /kəˈnɛtɪkət/。","Connecticut 的别称是“The Constitution State（宪法之州）”，与早期殖民地时期的《基本法令》（Fundamental Orders，常被视为美国早期宪政文件之一）有关。"]}
{"word":"connecticut","summary":{"en":"Connecticut is a U.S. state in New England, between New York and Massachusetts.","zh":"Connecticut（康涅狄格州）是美国新英格兰地区的一个州，位于纽约州与马萨诸塞州之间。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A state in the northeastern United States (in the New England region), known for cities like Hartford (the capital) and New Haven, and for being between New York and Massachusetts.","zh":"美国东北部新英格兰地区的一个州，首府是哈特福德（Hartford），著名城市还有纽黑文（New Haven），地理位置介于纽约州与马萨诸塞州之间。"},"examples":[{"en":"She lives in Connecticut but works in New York City.","zh":"她住在康涅狄格州，但在纽约市工作。"},{"en":"Yale University is in New Haven, Connecticut.","zh":"耶鲁大学位于康涅狄格州的纽黑文。"}]}],"phonetic":"/kəˈnɛtɪkət/","extraExplanation":["“Connecticut”这个州名来自原住民语言（常被解释为“长潮汐河/长河”的意思），与当地重要河流——康涅狄格河（Connecticut River）有关。","美式英语里“Connecticut”的常见读音重音在第二个音节；拼写里有很多不发音的字母，对学习者来说容易拼错。可以把它记成：Con-nect-i-cut（但实际发音更像“kuh-NEH-ti-kit”）。","文化上，康涅狄格常被认为兼具“新英格兰传统”和“纽约都市圈通勤郊区”的特点：很多居民在纽约工作、在康州居住。"]}
{"word":"connecting","summary":{"en":"“Connecting” means linking or joining; it can also describe a transfer connection in travel (a connecting flight) or something physically linking two places (a connecting hallway).","zh":"“Connecting”表示“连接、联系”；也可指旅行中的“转乘/衔接”（如转机航班），或指连接两处的实体通道（如连通走廊）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"the present participle of “connect”: linking or joining people, things, ideas, or places so they work together or have contact","zh":"“connect”的现在分词：把人、事物、想法或地点连接起来，使它们相连或产生联系"},"examples":[{"en":"I’m connecting the printer to my laptop.","zh":"我正在把打印机连接到我的笔记本电脑上。"},{"en":"She’s connecting the dots and realizing what really happened.","zh":"她把线索串起来，开始意识到到底发生了什么。"},{"en":"We’re connecting with customers through social media.","zh":"我们通过社交媒体与客户建立联系。"}]},{"partOfSpeech":"adj.","definition":{"en":"linking one step to another as part of a journey or process (especially about travel)","zh":"（尤指旅行中）“转乘/衔接的”：把行程的一个环节与下一个环节衔接起来"},"examples":[{"en":"I have a connecting flight in Chicago.","zh":"我在芝加哥转机。"},{"en":"Take the connecting train to the airport.","zh":"乘坐衔接的列车去机场。"}]},{"partOfSpeech":"adj.","definition":{"en":"providing a link between things, such as roads, rooms, or passages","zh":"“连接的/联通的”：用于连接道路、房间或通道等"},"examples":[{"en":"There’s a connecting hallway between the two buildings.","zh":"两栋楼之间有一条连通的走廊。"},{"en":"They booked connecting rooms for the family.","zh":"他们为家人订了连通房。"}]}],"synonyms":["linking","joining","hooking up","bridging","relating"],"phonetic":"/kəˈnɛktɪŋ/","extraExplanation":["“connecting flight”指“转机航班”（通常需要在中途机场换飞机，但行程连续）。常见搭配还有：connecting train（换乘列车）、connecting room(s)（连通房）、connecting line/route（衔接线路）。","在表达“与人建立联系/沟通”时，英语常用 connect with / connect to：connect with更强调“产生共鸣/建立关系”，connect to更强调“物理或系统上的连接”（如设备、网络）。"]}
{"word":"connecting flight","summary":{"en":"a transfer flight where you change planes","zh":"需要换乘的航班（转机航班）"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a flight that is part of a journey in which you change planes at an airport to continue to your final destination","zh":"（旅途中）需要在中途机场换乘继续前往目的地的航班（联程航班/转机航班）"},"examples":[{"en":"My connecting flight leaves from Gate 22, so I have to hurry.","zh":"我的转机航班从22号登机口出发，所以我得赶快。"},{"en":"We missed our connecting flight because the first plane was delayed.","zh":"因为第一段航班延误，我们错过了转机航班。"},{"en":"Do we need to pick up our bags for the connecting flight?","zh":"转机时我们需要取行李再托运吗？"}]}],"synonyms":["transfer flight","connecting service","linking flight","inbound connection"],"phonetic":"/kəˈnɛktɪŋ flaɪt/","extraExplanation":["常见相关词：layover（经停/中转等待时间），transfer（转机/换乘），direct flight（直飞），nonstop flight（不停站直飞）。","机场广播里常说“connecting passengers”（转机旅客）。“connecting flight”通常指你要去赶的下一段航班。","转机是否需要“recheck baggage（重新托运行李）”取决于航司、是否联程出票、是否入境转机等，最好看登机牌或问柜台。"],"etymology":"“connect”来自拉丁语 *connectere*（把……连在一起），在旅行语境里指“航段之间衔接”。“connecting flight”字面意思是“衔接的航班”，引申为“需要换乘的下一段航班”。","mnemonic":["把它拆开记：connecting=“衔接的/要接上的”，flight=“航班”→“要接上的下一班飞机”=转机航班。","联想中文“接驳/接上下一段”：connecting 就是“接上”，所以是“接上下一段的航班”。"]}
{"word":"connecting-flight","summary":{"en":"a transfer flight taken after changing planes","zh":"换乘后的下一段航班；转机航班"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a flight that you take after the first flight in a trip, usually after changing planes at an airport (a transfer)","zh":"（旅途中）需要在中途机场换乘后搭乘的下一段航班；转机航班"},"examples":[{"en":"Our first flight is delayed, so we might miss our connecting flight.","zh":"我们的第一段航班延误了，所以我们可能赶不上转机航班。"},{"en":"Do we have to pick up our bags before the connecting flight?","zh":"转机前我们需要先取行李吗？"},{"en":"She booked a connecting flight through Chicago to save money.","zh":"她订了经芝加哥转机的航班来省钱。"}]}],"synonyms":["transfer flight","connection","connecting service","onward flight"],"phonetic":"/kəˈnɛktɪŋ flaɪt/","extraExplanation":["常见相关表达：connection（转机/衔接）、layover（中途停留时间，通常较短）、stopover（中途停留，通常较长且可能过夜）、direct flight（直飞：中途不停）、nonstop flight（不经停直飞）。","在机场广播或登机口信息里，connecting flight 有时也写作 “connecting service” 或直接标注下一段航班号与登机口。"],"etymology":"由 connect（连接、衔接）+ flight（航班）组成；最初用于描述“行程之间的衔接”，后在航空出行语境中固定指“转机的下一段航班”。","mnemonic":["把 connecting 理解成“连接下一段”，所以 connecting flight 就是“连接行程的下一段航班”=转机航班。","联想：手机“连接 Wi‑Fi”才能继续上网；你要“连接下一段航班”才能继续旅行。"]}
{"word":"CONNECTION","summary":{"en":"Connection means a link or relationship; it can also refer to joining points, travel transfers, internet/phone links, or helpful contacts (connections).","zh":"Connection 指“联系/关联”，也可指“连接点”、旅途“换乘/转机”、网络/电话“连接”，以及“人脉/关系”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A relationship or link between people, ideas, things, or events.","zh":"（人与人、事物、想法、事件之间的）联系；关联；关系。"},"examples":[{"en":"There is a strong connection between exercise and good health.","zh":"运动和良好健康之间有很强的关联。"},{"en":"I have a personal connection to this city because I grew up here.","zh":"我和这座城市有个人联系，因为我在这里长大。"},{"en":"The detective looked for a connection between the two crimes.","zh":"侦探在寻找两起案件之间的关联。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of joining or linking things together; a point where things are joined.","zh":"连接（动作）；连接点；接头。"},"examples":[{"en":"Check the connection between the cable and the router.","zh":"检查电缆和路由器之间的连接。"},{"en":"The plumber fixed the pipe connection.","zh":"水管工修好了管道接头。"}]},{"partOfSpeech":"n.","definition":{"en":"A travel link between parts of a journey, such as a flight, train, or bus that you take after another one.","zh":"（旅程中的）换乘；转机；接驳班次。"},"examples":[{"en":"Our flight was delayed, and we missed our connection in Chicago.","zh":"我们的航班延误了，结果错过了在芝加哥的转机。"},{"en":"Is there a direct train, or do I need to make a connection?","zh":"有直达火车吗，还是需要换乘？"}]},{"partOfSpeech":"n.","definition":{"en":"A network link for communication, especially on the internet or by phone.","zh":"（网络或电话的）连接；联机；通讯线路。"},"examples":[{"en":"The Wi‑Fi connection is unstable today.","zh":"今天的 Wi‑Fi 连接不稳定。"},{"en":"I lost my internet connection during the meeting.","zh":"开会时我断网了。"}]},{"partOfSpeech":"n.","definition":{"en":"A useful contact or person who can help you (often used in plural: connections).","zh":"（能提供帮助的）人脉；关系（常用复数 connections）。"},"examples":[{"en":"She got the interview through her connections.","zh":"她通过人脉拿到了面试机会。"},{"en":"In that industry, connections can matter a lot.","zh":"在那个行业里，人脉可能非常重要。"}]}],"synonyms":["link","relationship","association","tie","bond","contact","network","transfer"],"phonetic":"/kəˈnɛkʃən/","extraExplanation":["“Connection”来自拉丁语 *connectere*（把……连在一起），核心含义是“连接、关联”。在日常英语里，它既可指抽象的“关系/关联”，也常见于具体场景：网络连接（internet connection）、旅途换乘（make a connection）、以及“人脉”（have good connections）。","常见搭配：make a connection（建立联系/实现换乘）；a close/strong connection（紧密联系）；connection to/with（与……的联系）；lose/regain a connection（断开/恢复连接）。","写作与阅读中常见表达：draw a connection between A and B（指出A与B的关联）；there is no connection（毫无关联）。"]}
{"word":"connection","summary":{"en":"Connection means a link/relationship, a joining point, a helpful contact, or a travel transfer.","zh":"connection 可指关联/关系、连接处、（可提供帮助的）人脉，以及旅途中的换乘。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a relationship or link between people, things, events, or ideas; something that joins them together","zh":"联系；关联；（人或事物之间的）关系；把它们连接起来的纽带"},"examples":[{"en":"There is a strong connection between exercise and good health.","zh":"运动与健康之间有很强的关联。"},{"en":"She felt an immediate connection with the new classmates.","zh":"她和新同学立刻产生了亲近感。"}]},{"partOfSpeech":"n.","definition":{"en":"a physical or technical joining; the place or part where two things are joined","zh":"连接（处）；接头；接口；（两个东西的）连接部分"},"examples":[{"en":"Check the cable connection if the screen is black.","zh":"如果屏幕是黑的，请检查电缆连接。"},{"en":"The plumber fixed a leaking connection under the sink.","zh":"水管工修好了水槽下漏水的连接处。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or organization that can help you get information, opportunities, or support (often through networks)","zh":"人脉；关系户；可提供信息/机会/帮助的人或机构（常指通过社交网络）"},"examples":[{"en":"He got the interview through a connection at the company.","zh":"他通过公司里的一位人脉拿到了面试机会。"}]},{"partOfSpeech":"n.","definition":{"en":"a planned change from one train/flight/bus to another during a journey","zh":"（旅途中的）换乘；联程衔接"},"examples":[{"en":"We have a 40-minute connection in Chicago.","zh":"我们在芝加哥有40分钟的换乘时间。"}]}],"synonyms":["link","relationship","association","tie","contact"],"phonetic":"/kəˈnɛkʃən/","extraExplanation":["词源提示：connection 来自 connect（连接）+ -ion（名词后缀），核心含义是“把两者连在一起”。因此它既可指抽象的“关联/关系”，也可指具体的“接头/连接处”，还常延伸为“人脉/关系”和旅行中的“换乘”。","常见搭配：make a connection（建立联系/形成关联），have a connection with/to（与……有联系），internet/Wi‑Fi connection（网络连接），miss a connection（误了换乘）。"]}
{"word":"connection with","summary":{"en":"related to; concerning; associated with.","zh":"与……有关；关于；与……相关联。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"used to show a relationship or association between things; “related to” or “in relation to.”","zh":"用于表示事物之间的联系或关联；“与……有关 / 与……相关 / 关于……”。"},"examples":[{"en":"I’m calling in connection with your job application.","zh":"我打电话是想就你的求职申请联系你。"},{"en":"There were complaints in connection with the new policy.","zh":"有人就新政策提出了投诉。"},{"en":"Police are questioning him in connection with the theft.","zh":"警方正在就这起盗窃案与他有关的情况对他进行问询。"}]}],"synonyms":["related to","in relation to","concerning","regarding","associated with","connected to"],"phonetic":"/kəˈnɛkʃən wɪð/","extraExplanation":["常见于较正式的书面语、邮件、公告或新闻报道中：in connection with…（就……而言/与……有关）。","口语中更常用：about, regarding, related to, connected to 等。"],"etymology":"“connection”源自拉丁语词根，核心含义是“把……连在一起”；与介词“with”搭配后，固定用来表达“与……存在关联”。","mnemonic":["把它理解成“连接（connection）+ 和（with）”：和某事“连接在一起”＝与某事有关。"]}
{"word":"connectional","summary":{"en":"Connectional means “related to how things are connected,” and it can also describe a church system based on cooperation among congregations (especially in Methodism).","zh":"connectional 表示“与连接/联系方式有关的”，也可指一种强调各教会会众之间协作与共同治理的教会制度（尤见于卫理宗）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a connection, network, or the way things are linked together.","zh":"与连接、网络或事物之间的联系方式有关的；联系性的。"},"examples":[{"en":"The study focuses on the connectional structure of the brain.","zh":"这项研究关注大脑的连接性结构。"},{"en":"Good teamwork depends on connectional ties between departments.","zh":"良好的团队合作依赖部门之间的联系纽带。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Especially in some Christian traditions) relating to a church system that emphasizes cooperation and shared authority among local churches.","zh":"（尤指某些基督教传统中）与“联合制/联系制”的教会治理方式有关的；强调各地方教会之间协作与共同治理。"},"examples":[{"en":"Methodist churches often describe their governance as connectional.","zh":"卫理公会常把其治理方式描述为联系制（联合制）。"},{"en":"They held a connectional meeting to coordinate missions across regions.","zh":"他们召开联系制会议以协调跨地区的宣教工作。"}]}],"synonyms":["connected","relational","networked","interconnected","interdependent"],"phonetic":"/kəˈnɛkʃənəl/","extraExplanation":["“connectional”在宗教语境里常与卫理宗（Methodism）相关，强调各地方教会不是完全独立运作，而是通过年议会/总议会等机制共享资源、互相监督并共同决策。这个用法在日常英语中较少见，但在教会治理讨论中很常见。"]}
{"word":"connectionalism","summary":{"en":"Connectionalism usually means “connectionism,” a network-based theory of mind and learning; it can also refer to a church governance system (especially Methodist) linking congregations through shared structures.","zh":"connectionalism 通常指“连接主义/连接论”（以网络连接解释心智与学习）；也可指一种教会治理制度（尤指卫理公会）——通过共同结构把各堂会联结起来。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A theory in cognitive science and AI that explains learning and thinking as patterns of activation and connections in networks (often modeled as artificial neural networks).","zh":"（认知科学/人工智能中的）连接主义：用“网络中的连接与激活模式”来解释学习与思维的理论（常用人工神经网络来建模）。"},"examples":[{"en":"Connectionalism suggests that the brain processes information through many simple units working together.","zh":"连接主义认为，大脑通过许多简单单元协同工作来处理信息。"},{"en":"In this course, we compare connectionalism with symbolic approaches to cognition.","zh":"在这门课里，我们把连接主义与符号主义的认知方法进行比较。"},{"en":"Modern deep learning is often discussed as a practical success of connectionalism.","zh":"现代深度学习常被视为连接主义在实践上的成功。"}]},{"partOfSpeech":"n.","definition":{"en":"A system of church organization (especially in Methodism) in which local congregations are linked and governed through a wider network of conferences and shared leadership.","zh":"（尤指卫理公会的）联会制/联系体制：各地方教会通过更大范围的年议会等组织相互联结，并由共同的制度与领导来治理。"},"examples":[{"en":"Methodist connectionalism emphasizes shared responsibility across congregations.","zh":"卫理公会的联会制强调各堂会之间的共同责任。"},{"en":"Because of connectionalism, resources can be distributed to support smaller churches.","zh":"由于联会制，资源可以被调配来支持较小的教会。"}]}],"synonyms":["connectionism (common in cognitive science)","neural-network approach","Methodist connectional polity"],"phonetic":"/kəˈnɛkʃənəˌlɪzəm/","extraExplanation":["词形提示：connectionalism 来自 connection（连接）+ -al（形容词后缀）+ -ism（“主义/体系”）。在学术语境里，它多指认知科学的“连接主义”；在宗教语境里，则常指卫理公会等强调“彼此联结、共同治理”的教会制度。","相关学术对比：连接主义常与 symbolic/representational approaches（符号主义/表征主义）对比；前者强调分布式网络与学习，后者更强调规则与符号操作。"]}
{"word":"connectionism","summary":{"en":"Connectionism is the idea that learning and thinking come from patterns in networks of many simple connected units, and it also refers to neural-network-based approaches in AI.","zh":"联结主义认为学习与思考源于大量简单连接单元所构成网络中的模式，也可指人工智能中基于神经网络的学习方法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A theory in cognitive science and psychology that explains thinking and learning as the result of many simple units (like neurons) working together in a network.","zh":"一种认知科学与心理学理论，认为思考与学习是由许多简单单元（类似神经元）在网络中共同作用而产生的。"},"examples":[{"en":"Connectionism suggests that the brain learns patterns through networks of connected units.","zh":"联结主义认为，大脑通过由相互连接的单元组成的网络来学习模式。"},{"en":"In connectionism, knowledge is often represented as strengths of connections rather than clear rules.","zh":"在联结主义中，知识常常被表示为连接强度，而不是明确的规则。"}]},{"partOfSpeech":"n.","definition":{"en":"An approach in artificial intelligence and machine learning that builds models inspired by neural networks to learn from data.","zh":"一种人工智能与机器学习方法，使用受神经网络启发的模型从数据中学习。"},"examples":[{"en":"Early neural-network research was strongly influenced by connectionism.","zh":"早期的神经网络研究深受联结主义影响。"},{"en":"Some language models were first developed using connectionist ideas about learning from examples.","zh":"一些语言模型最初就是基于联结主义“从例子中学习”的思想发展起来的。"}]}],"synonyms":["neural network approach","parallel distributed processing (PDP)","network-based learning"],"phonetic":"/kəˈnɛkʃəˌnɪzəm/","extraExplanation":["“Connectionism”常与“symbolic AI（符号主义/符号人工智能）”对比：符号主义强调清晰规则与符号推理；联结主义强调通过大量样例训练，让系统在网络连接权重中“学出”规律。","在语言学习研究中，联结主义常用于解释儿童如何从大量输入中逐渐掌握语法与词汇，而不一定依赖先天的明确规则。"]}
{"word":"connectionless","summary":{"en":"“Connectionless” describes a system (especially a network protocol) that sends data without first establishing a persistent connection.","zh":"“Connectionless”指（尤指网络协议）在发送数据前无需建立持续连接的“无连接”方式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(In computing and telecommunications) not requiring a continuous, dedicated connection before data is sent; each message is sent independently.","zh":"（计算机与通信）无连接的；发送数据前不需要先建立持续的专用连接；每条消息独立发送。"},"examples":[{"en":"UDP is a connectionless protocol often used for live video and online games.","zh":"UDP 是一种无连接协议，常用于直播视频和网络游戏。"},{"en":"Connectionless communication can be faster, but it may not guarantee delivery.","zh":"无连接通信可能更快，但不一定保证送达。"},{"en":"The network supports both connection-oriented and connectionless services.","zh":"该网络同时支持面向连接和无连接的服务。"}]}],"synonyms":["stateless","datagram-based","non-connection-oriented"],"phonetic":"/kəˈnɛkʃənləs/","extraExplanation":["在网络里，“connectionless（无连接）”并不等于“没有网络连接”，而是指通信前不需要像电话那样先“建立会话/握手”。典型对比：TCP 是面向连接（connection-oriented），UDP 是无连接（connectionless）。","无连接方式通常开销更小、延迟更低，适合对速度敏感且能容忍少量丢包的场景（如语音/视频、游戏、DNS 查询）；如果需要可靠传输，通常要用面向连接协议或在应用层自己做重传与校验。"]}
{"word":"connections","summary":{"en":"Connections means relationships/contacts, links between ideas or things, or physical joining points; it can also mean influential contacts.","zh":"connections 可指人际关系/人脉、事物或观点之间的联系、物理连接处，也可指有影响力的关系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Relationships or contacts between people, often used for social or professional networking.","zh":"人与人之间的关系或人脉（常指社交或职场中的联系）。"},"examples":[{"en":"Her connections in the industry helped her find a job quickly.","zh":"她在业内的人脉帮助她很快找到了工作。"},{"en":"Building connections takes time and trust.","zh":"建立人脉需要时间和信任。"}]},{"partOfSpeech":"n.","definition":{"en":"Links or associations between things or ideas (how one thing relates to another).","zh":"事物或观点之间的联系、关联（说明彼此如何相关）。"},"examples":[{"en":"The article explores the connections between sleep and memory.","zh":"这篇文章探讨了睡眠与记忆之间的联系。"},{"en":"I can’t see any connections between these two events.","zh":"我看不出这两件事之间有什么关联。"}]},{"partOfSpeech":"n.","definition":{"en":"Physical joining points where parts are connected, especially in electricity or machines.","zh":"连接处；接头（尤指电路或机器的连接点）。"},"examples":[{"en":"Check the connections if the device won’t turn on.","zh":"如果设备打不开，请检查连接处。"},{"en":"Loose connections can cause the light to flicker.","zh":"松动的接头会导致灯闪烁。"}]},{"partOfSpeech":"n.","definition":{"en":"Influential contacts that can provide advantages, opportunities, or special access.","zh":"（能带来机会或便利的）有影响力的人脉、关系。"},"examples":[{"en":"He got the tickets through his connections.","zh":"他通过关系弄到了票。"},{"en":"In some places, connections matter more than qualifications.","zh":"在某些地方，关系比资历更重要。"}]}],"synonyms":["relationships","contacts","links","ties","associations","network","contacts in high places"],"phonetic":"/kəˈnɛkʃənz/","extraExplanation":["“connections”常用来谈“networking（建立人脉）”。语气可中性，但也可能暗示“走关系/靠关系”，是否带负面要看语境。","与“relationship(s)”相比：relationship更强调稳定的人际关系（朋友、恋人、同事等）；connections更强调“联系网络”或“有用的联系人”。"]}
{"word":"connections of work","summary":{"en":"Professional networking or workplace links.","zh":"职业人脉或工作关联。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Professional relationships you have through your job (people you know at work or in your industry).","zh":"通过工作建立的职业人脉（在单位或行业里认识的人与关系）。"},"examples":[{"en":"She found her new job through her work connections.","zh":"她通过工作人脉找到了新工作。"},{"en":"Building strong work connections can help you learn faster and get support.","zh":"建立良好的工作人脉可以帮助你更快学习并获得支持。"},{"en":"Try to keep in touch with old work connections after you change jobs.","zh":"换工作后也尽量和以前的工作人脉保持联系。"}]},{"partOfSpeech":"phrase","definition":{"en":"Links or relationships between tasks, ideas, or departments in a workplace (how things at work are connected).","zh":"工作中的关联（任务、想法或部门之间如何相互联系）。"},"examples":[{"en":"The training explains the connections of work between sales and customer service.","zh":"这次培训讲解了销售与客服之间的工作关联。"},{"en":"Once you see the connections of work, the whole process becomes clearer.","zh":"一旦你看清工作的关联，整个流程就更清楚了。"}]}],"synonyms":["work connections","professional connections","network","contacts","industry connections","relationships","links"],"phonetic":"/kəˈnɛkʃənz əv wɝk/","extraExplanation":["更自然的表达：work connections（工作人脉）、professional connections（职业人脉）、connections at work（在职场中的关系）。","注意介词：谈“人脉”时常说 through my connections（通过我的人脉）；谈“关联”时常说 connections between A and B（A和B之间的联系）。"],"etymology":"“connection”来自拉丁语 connectere（连在一起），经由法语进入英语；在现代英语中常用来指“联系/关系/人脉”。“connections of work”是较直译的说法，更常见的是“work connections”或“professional connections”。","mnemonic":["把 connection 想成“连线”：工作中的“连线”=人脉/关联。","联想中文“关系网”：connections 就像一张网，把工作里的资源和信息连起来。"]}
{"word":"connectival","summary":{"en":"Connectival means “serving to connect; connective,” but it is rare in modern English.","zh":"connectival 意为“起连接作用的；连接性的”，但在现代英语中较少使用，通常用 connective。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Serving to connect or link things together; connective.","zh":"（罕用）起连接作用的；用于把事物连在一起的；连接性的。"},"examples":[{"en":"In some older grammar books, words like “and” or “but” were described as connectival elements.","zh":"在一些较早的语法书里，像 and 或 but 这样的词会被称为 connectival 成分。"},{"en":"The writer used short, connectival phrases to guide the reader from one idea to the next.","zh":"作者用简短的 connectival 短语来引导读者从一个观点过渡到下一个观点。"}]}],"synonyms":["connective","linking","joining"],"phonetic":"/kəˈnɛktɪvəl/","extraExplanation":["connectival 属于比较少见的词，多见于较旧的语法/语言学写作或非常正式的学术语境。现代英语里更常用 connective（adj./n.）来表达“连接的/连接词”。","词源上它和 connect（连接）同根：connect + -ive（构成形容词）+ -al（进一步形容词化）。在实际写作中，用 connective 通常更自然、更容易被理解。"]}
{"word":"connective","summary":{"en":"Connective means “linking.” It can describe something that connects, or it can be a word/phrase that links ideas in speaking and writing.","zh":"Connective 意为“连接的”。既可作形容词表示起连接作用，也可作名词指连接词/连接短语，用来衔接句子和观点。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"An adjective meaning “linking or joining things together,” especially in language or logic.","zh":"形容词，表示“连接的、起连接作用的”，常用于语言或逻辑中。"},"examples":[{"en":"Use connective words like “however” and “therefore” to show the relationship between ideas.","zh":"使用“however（然而）”“therefore（因此）”这类连接词来表示观点之间的关系。"},{"en":"The essay needs more connective phrases to make the paragraphs flow smoothly.","zh":"这篇文章需要更多连接性短语，让段落衔接更顺畅。"}]},{"partOfSpeech":"n.","definition":{"en":"A noun meaning a word or phrase that connects parts of a sentence or ideas in a text (often called a linking word).","zh":"名词，指“连接词/连接短语”，用于连接句子成分或连接文章中的观点。"},"examples":[{"en":"“And,” “but,” and “because” are common connectives in English.","zh":"“and（和）”“but（但是）”“because（因为）”是英语里常见的连接词。"},{"en":"Try adding a connective at the start of the sentence, such as “For example,” to introduce evidence.","zh":"试着在句首加一个连接短语，比如“For example（例如）”，来引出证据。"}]}],"synonyms":["linking","connecting","connector","linking word","transition"],"phonetic":"/kəˈnɛktɪv/","extraExplanation":["在写作与阅读中，connectives 常被称为“linking words/phrases（连接词/连接短语）”。它们不只是“把句子连起来”，更重要的是告诉读者逻辑关系：转折（however）、因果（therefore/because）、补充（moreover）、举例（for example）、对比（in contrast）等。","在语法学里，connective 有时也特指“连接副词/连接成分”（如 therefore, however），它们连接句子或段落意义，但不一定像连词（and, but）那样在语法结构上把两个从句“并列/从属”起来。日常学习中可以先把它们统称为“连接表达”。"]}
{"word":"connective tissue","summary":{"en":"supporting material that links parts together (in the body or as a metaphor).","zh":"用于支撑并连接各部分的组织或（比喻）纽带。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A body tissue that supports, connects, or separates other tissues and organs (for example, tendon, ligament, cartilage, fat, and bone).","zh":"结缔组织：一种在人体内起到支撑、连接或分隔其他组织与器官作用的组织（如肌腱、韧带、软骨、脂肪和骨组织等）。"},"examples":[{"en":"Tendons and ligaments are types of connective tissue.","zh":"肌腱和韧带都是结缔组织的一种。"},{"en":"Doctors said the swelling was caused by inflammation in the connective tissue.","zh":"医生说肿胀是由结缔组织发炎引起的。"}]},{"partOfSpeech":"phrase","definition":{"en":"Something that links parts together in a system, story, or argument; a unifying link.","zh":"（比喻）连接要素：把系统、故事或论证中的各部分联系起来的纽带。"},"examples":[{"en":"Trust became the connective tissue of the whole team.","zh":"信任成了整个团队的“黏合剂”。"},{"en":"In the novel, memory is the connective tissue between past and present.","zh":"在这部小说里，记忆是连接过去与现在的纽带。"}]}],"synonyms":["connective","link","bond","glue","unifier","tendon","ligament"],"phonetic":"/kəˈnɛktɪv ˈtɪʃu/","extraExplanation":["医学语境里常见搭配：connective tissue disease（结缔组织病）、connective tissue disorder（结缔组织疾病/障碍）。","比喻用法在英语里很常见，意思接近中文的“纽带/黏合剂/中枢线索”，多用于谈团队文化、制度、叙事结构等。"],"etymology":"“connective”来自拉丁语 connectere（连接），-ive 表示“具有……性质的”；“tissue”源自法语 tissu（编织的布），后来引申为“（生物）组织”。合起来原指“把结构连在一起的组织”，医学中固定用法为“结缔组织”。","mnemonic":["把 connective 理解成“connect（连接）+ -ive（…的）”，就是“用来连接的”；tissue 可联想到“组织/织物”，合起来就是“连接用的组织”。","记忆比喻义：把它想成“把零散东西黏起来的组织”，对应中文“黏合剂/纽带”。"]}
{"word":"connective-tissue","summary":{"en":"Connective tissue is body tissue that connects/supports other tissues; figuratively, it means the link that holds parts of something together.","zh":"connective tissue 指连接与支撑身体结构的结缔组织；也可比喻为把事物各部分凝聚在一起的纽带或关键联系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strong, supportive body tissue (like tendons, ligaments, cartilage, or fat) that connects, holds together, or supports other tissues and organs.","zh":"结缔组织：一种有支撑和连接作用的身体组织（如肌腱、韧带、软骨或脂肪），用来连接、固定或支撑其他组织和器官。"},"examples":[{"en":"Tendons are made of connective tissue that attaches muscle to bone.","zh":"肌腱由结缔组织构成，把肌肉连接到骨头上。"},{"en":"Damage to connective tissue can cause joint pain and stiffness.","zh":"结缔组织受损可能导致关节疼痛和僵硬。"}]},{"partOfSpeech":"n.","definition":{"en":"A unifying link or common factor that holds parts of a story, argument, group, or idea together (used figuratively).","zh":"（比喻）纽带；联系：把故事、论证、群体或想法的各部分凝聚在一起的共同因素或联系。"},"examples":[{"en":"Trust is the connective tissue of a strong team.","zh":"信任是强大团队的“结缔组织”（凝聚纽带）。"},{"en":"The author uses memory as the connective tissue linking the chapters.","zh":"作者用“记忆”作为贯穿各章的连接线。"}]}],"synonyms":["binding tissue","supporting tissue","link","glue","thread","unifying factor"],"phonetic":"/kəˈnɛktɪv ˈtɪʃu/","extraExplanation":["在医学里，connective tissue（结缔组织）常被当作一个大类，包含多种组织：如tendon（肌腱）、ligament（韧带）、cartilage（软骨）、bone（骨组织也常被归入结缔组织的一种）以及adipose tissue（脂肪组织）。","在日常英语写作中，把“connective tissue”用于比喻很常见，尤其在商业、组织管理、写作与社会话题中，表示“让整体运转、把各部分粘合起来的关键因素”。这种比喻来自其生理功能：连接与支撑。","常见搭配：connective tissue disease（结缔组织病，泛指一类影响结缔组织的疾病，如某些自身免疫疾病）。"]}
{"word":"connective-tissue-forming","summary":{"en":"An adjective meaning “able to form connective tissue,” used mainly in medical/scientific writing.","zh":"形容词，表示“能够形成结缔组织的”，主要用于医学/科研语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology/medicine) Able to form or produce connective tissue (the body’s supporting tissue such as collagen, tendons, and ligaments).","zh":"（生物/医学）能够形成或产生结缔组织的（结缔组织是人体的支撑性组织，如胶原、肌腱、韧带等）。"},"examples":[{"en":"Fibroblasts are connective-tissue-forming cells that help repair wounds.","zh":"成纤维细胞是结缔组织形成细胞，能帮助修复伤口。"},{"en":"The researchers tested a connective-tissue-forming scaffold for tissue engineering.","zh":"研究人员测试了一种用于组织工程的结缔组织形成支架。"}]}],"synonyms":["connective-tissue-producing","fibrogenic","collagen-forming"],"phonetic":"/kəˈnɛktɪv ˈtɪʃuː ˈfɔːrmɪŋ/","extraExplanation":["这是一个由多个词用连字符连接的复合形容词，常见于学术论文或医学说明中，用来在名词前作定语（如 connective-tissue-forming cells/scaffold）。口语里更常说“cells that form connective tissue（能形成结缔组织的细胞）”。","注意：connective tissue（结缔组织）是固定搭配，通常不写成 connective-tissue（除非像这里一样作为复合定语放在名词前）。"]}
{"word":"connective-tissue-related","summary":{"en":"Connected with the body’s connective tissue and conditions involving it.","zh":"指与人体结缔组织及其相关疾病/问题有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to connective tissue (the body’s supporting tissue such as collagen, tendons, ligaments, cartilage, and fascia).","zh":"与结缔组织有关的（结缔组织是身体的支持性组织，如胶原、肌腱、韧带、软骨和筋膜等）。"},"examples":[{"en":"The doctor suspects a connective-tissue-related disorder.","zh":"医生怀疑这是与结缔组织有关的疾病。"},{"en":"Her joint pain may be connective-tissue-related rather than caused by an injury.","zh":"她的关节疼痛可能与结缔组织有关，而不是受伤造成的。"},{"en":"Some rashes are connective-tissue-related and need a specialist’s evaluation.","zh":"有些皮疹与结缔组织有关，需要专科医生评估。"}]}],"synonyms":["related to connective tissue","connective tissue–associated","connective tissue–linked","CTD-related"],"phonetic":"/kəˈnɛktɪv ˈtɪʃu rɪˈleɪtɪd/","extraExplanation":["这个词常见于医学语境，通常用来把某种“症状/疾病/问题”归因到结缔组织系统（例如免疫相关的结缔组织病）。在日常英文里更常直接说“related to connective tissue”或用更具体的疾病名（如 lupus/RA/Ehlers-Danlos syndrome）。"]}
{"word":"connectively","summary":{"en":"“Connectively” means “in a linking/connecting way,” often referring to linking ideas in writing or using connectives like “and/or/but.”","zh":"“connectively”表示“以连接、衔接的方式”，常指写作中衔接观点，或在逻辑/语言学中使用 and/or/but 等连接词来表达关系。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that connects things; by linking ideas, sentences, or parts together.","zh":"以连接的方式；通过把观点、句子或部分衔接起来。"},"examples":[{"en":"The speaker answered the questions connectively, linking each point to the next.","zh":"演讲者用连接性的方式回答问题，把每个要点衔接到下一个。"},{"en":"Try to write connectively so your paragraph flows smoothly.","zh":"尽量用衔接性的写法，让段落读起来更顺畅。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Logic/Linguistics) In a way that uses connectives (words like “and,” “or,” “but”) to show relationships between statements.","zh":"（逻辑/语言学）以使用连接词（如 and、or、but）的方式来表达命题或句子之间的关系。"},"examples":[{"en":"The two clauses are connectively related by “because.”","zh":"这两个分句通过“because”在连接词意义上相关。"},{"en":"In formal writing, ideas are often organized connectively with words like “however” and “therefore.”","zh":"在正式写作中，观点常用“however”“therefore”等词进行连接式组织。"}]}],"synonyms":["coherently","in a connected way","with transitions","linkedly"],"phonetic":"/kəˈnɛktɪvli/","extraExplanation":["“connectively”比较少见，很多场合母语者更常用“in a connected way / in a coherent way / with transitions”。在语言学或逻辑学讨论“connectives（连接词）”时，“connectively”会更自然、更准确。"]}
{"word":"connectives","summary":{"en":"“Connectives” are linking words/phrases (and, but, because, however, therefore) that connect ideas; in logic, they also mean symbols/words that connect statements.","zh":"“Connectives” 指连接词/连接短语（如 and, but, because, however, therefore）用来衔接观点；在逻辑中也指连接命题的连接词或符号。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Words or short phrases used to link sentences, ideas, or parts of a text so the meaning flows clearly (e.g., “however,” “therefore,” “in addition”).","zh":"用于连接句子、观点或文章结构的词或短语，使表达更连贯清晰（如 however, therefore, in addition）。"},"examples":[{"en":"Using connectives like “because” and “so” helps explain cause and effect.","zh":"使用 because 和 so 这类连接词可以帮助说明因果关系。"},{"en":"Add a connective such as “however” to show contrast between the two ideas.","zh":"可以加上 however 这样的连接词来表示两个观点的转折。"}]},{"partOfSpeech":"n.","definition":{"en":"In formal logic or mathematics, linking words or symbols that join statements (such as “and,” “or,” “not,” and “if…then”).","zh":"在逻辑或数学中，用来连接命题的连接词或符号（如 and, or, not, if…then）。"},"examples":[{"en":"In logic, “and” and “or” are common connectives.","zh":"在逻辑中，and 和 or 是常见的连接词。"},{"en":"The truth of the statement depends on the connective used.","zh":"该陈述的真假取决于所使用的连接词。"}]}],"synonyms":["linking words","transition words","connectors","conjunctions (partly)","logical operators (logic)"],"phonetic":"/kəˈnɛktɪvz/","extraExplanation":["在英语写作与口语中，connectives 常与 “linking words / transition words” 同类，常见功能包括：补充（in addition）、对比（however）、因果（therefore/because）、举例（for example）、总结（in conclusion）。适当使用能让段落更有条理，但也要避免过度堆砌。"]}
{"word":"connectivity","summary":{"en":"Connectivity means how well something is connected, especially in networks, transportation, or relationships.","zh":"Connectivity 指“连通性/互联性”，强调连接的程度与是否顺畅，常用于网络、交通和人际关系等语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being connected; the ability of people, devices, places, or ideas to link and communicate with each other","zh":"连通性；互联性：人、设备、地点或想法彼此连接与沟通的状态或能力"},"examples":[{"en":"The subway expansion improved connectivity between the suburbs and downtown.","zh":"地铁扩建提升了郊区与市中心之间的连通性。"},{"en":"In rural areas, poor internet connectivity can limit online learning.","zh":"在农村地区，较差的网络连通性会限制线上学习。"},{"en":"The novel explores human connectivity—how strangers influence one another.","zh":"这部小说探讨人与人之间的联结——陌生人如何彼此影响。"}]},{"partOfSpeech":"n.","definition":{"en":"(technology) the quality of a network or system that allows devices to access services and exchange data reliably","zh":"（科技）网络连接质量：让设备可靠地访问服务并交换数据的网络/系统性能"},"examples":[{"en":"The app checks your connectivity before it uploads photos.","zh":"这个应用会在上传照片前检查你的网络连接状况。"},{"en":"We installed a new router to boost Wi‑Fi connectivity.","zh":"我们安装了新路由器来提升 Wi‑Fi 连接质量。"}]},{"partOfSpeech":"n.","definition":{"en":"(biology/ecology) the degree to which habitats or populations are linked, affecting movement and gene flow","zh":"（生物/生态）栖息地连通度：不同栖息地或种群彼此连接的程度，影响迁移与基因交流"},"examples":[{"en":"Wildlife corridors increase connectivity between forest patches.","zh":"野生动物廊道提高了不同森林斑块之间的连通度。"}]}],"synonyms":["connection","connectedness","linkage","network access","interconnectivity"],"phonetic":"/ˌkɑnɛkˈtɪvɪti/","extraExplanation":["“connectivity”常见于三类语境：①日常/城市与人际关系（交通更方便、人更容易来往）；②科技网络（信号强弱、网络是否稳定）；③生态学（栖息地是否连成一片、动物是否能迁移）。学习时可结合语境判断它指的是“连接的状态”还是“连接的质量/能力”。","词形来源：connect（连接）+ -ive（构成形容词）→ connective（连接的）+ -ity（名词后缀，表示性质/状态）→ connectivity（连通性/互联性）。"]}
{"word":"connector","summary":{"en":"A connector is something (or someone) that links things together—often a device like a cable connector, or a person who connects people and groups.","zh":"connector指“起连接作用的人或物”——常见为电缆/设备的连接器，也可指把人和团队联系起来的联络者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person, company, or thing that links two or more people, groups, systems, or ideas so they can work together or communicate","zh":"连接者；联络人；（公司/事物）起连接作用的东西，使不同的人、群体或系统能协作或沟通"},"examples":[{"en":"She acts as a connector between the design team and the engineers.","zh":"她充当设计团队和工程团队之间的联络人。"},{"en":"Good managers are connectors who help people share information quickly.","zh":"优秀的管理者是“连接者”，能帮助大家快速共享信息。"}]},{"partOfSpeech":"n.","definition":{"en":"a device or part used to join things together, especially wires, cables, pipes, or computer/network equipment","zh":"连接器；接头；（尤指电线、电缆、管道或电脑/网络设备的）连接部件"},"examples":[{"en":"Make sure the cable connector is firmly attached.","zh":"请确认电缆接头已牢固连接。"},{"en":"This laptop has a USB-C connector.","zh":"这台笔记本电脑有一个 USB-C 接口（连接器）。"}]},{"partOfSpeech":"n.","definition":{"en":"a word, symbol, or element that links parts of language or logic (for example, in grammar or mathematics)","zh":"连接词；连接符号；（语法或逻辑中）起连接作用的词、符号或要素"},"examples":[{"en":"In the sentence, “and” is a connector that joins two ideas.","zh":"在句子中，“and”是连接两个想法的连接词。"},{"en":"In math, “+” is a connector showing addition.","zh":"在数学里，“+”是表示加法的连接符号。"}]}],"synonyms":["link","bridge","adapter","coupler","interface","go-between"],"phonetic":"/kəˈnɛktɚ/","extraExplanation":["“connector”在职场语境里常指“善于把人和资源串起来的人”（人脉型角色），类似于“networker”，但connector更强调“把不同圈子/部门连接起来并促成合作”。","技术语境中，connector常与“port / interface / plug / socket”一起出现：port偏“接口位置”，plug/socket偏“插头/插座”，connector是更泛的“连接部件/接头”。"]}
{"word":"connector-like","summary":{"en":"Connector-like means “similar to a connector” or “serving as a connector.”","zh":"connector-like 表示“像连接器的”或“起连接作用的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling or functioning like a connector (something that links, joins, or connects parts together).","zh":"像连接器的；起到连接作用的（用于把部分连接或组合在一起）。"},"examples":[{"en":"The device has a connector-like port for attaching extra sensors.","zh":"这个设备有一个类似连接器的接口，用来接入额外的传感器。"},{"en":"A connector-like piece joins the two tubes so they don’t leak.","zh":"一个起连接作用的零件把两根管子接在一起，防止漏水。"}]}],"synonyms":["connector-type","connector-shaped","connecting","linking"],"phonetic":"/kəˈnɛktɚ laɪk/","extraExplanation":["“connector-like”是由名词connector（连接器/连接件）+ “-like”（像……一样）组成的复合形容词，常用连字符表示它作为一个整体来修饰后面的名词。","在工程、电子、写作结构（如“连接词”）等语境中都可能出现：既可以指外形像连接器，也可以强调“连接/衔接”的功能。"]}
{"word":"connectors","summary":{"en":"“Connectors” can mean physical connecting parts (like cable connectors) or linking words/phrases that connect ideas in writing and speech.","zh":"“connectors”既可指物理上的连接器/接头，也可指写作和口语中用来衔接观点的连接词/过渡语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device or part used to join two things together, especially in electronics, machines, or cables.","zh":"连接器；接头（用于把两样东西连接在一起，尤指电子设备、机器或电缆）"},"examples":[{"en":"This cable has a loose connector, so the signal keeps cutting out.","zh":"这根线的连接器有点松，所以信号总是断断续续。"},{"en":"Make sure the charger connector is clean and dry.","zh":"确保充电器接口干净且干燥。"}]},{"partOfSpeech":"n.","definition":{"en":"A word or phrase that links ideas in speaking or writing (for example, “however,” “because,” “in addition”).","zh":"连接词；衔接语（用于在口语或写作中连接观点，例如“however”“because”“in addition”）"},"examples":[{"en":"Using connectors like “however” and “therefore” makes your writing easier to follow.","zh":"使用“however”“therefore”等连接词会让你的文章更容易理解。"},{"en":"Try adding a connector to show cause: “because,” “since,” or “so.”","zh":"试着加一个表示原因的连接词：“because”“since”或“so”。"}]}],"synonyms":["links","couplers","adapters","joiners","transition words","linking words"],"phonetic":"/kəˈnɛktərz/","extraExplanation":["在英语写作课里，connectors 常指“话语衔接词/过渡词”（discourse connectors）。它们帮助读者理解句子之间的关系：对比（however/yet），因果（because/so/therefore），补充（also/in addition），举例（for example），总结（in short/to sum up）。"]}
{"word":"connects","summary":{"en":"“connects” means “joins/links,” “relates ideas,” “contacts,” or “links devices,” and is the third-person singular form of “connect.”","zh":"“connects”表示“连接/接通、联系（观点）、联系上某人或连接设备网络”，是“connect”的第三人称单数形式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(third-person singular of connect) to join or link people, things, or places so they are together or can work as one.","zh":"（connect 的第三人称单数）把人、物或地点连接/接通在一起，使其成为整体或能协同运作。"},"examples":[{"en":"The bridge connects the island to the mainland.","zh":"这座桥把岛和大陆连接起来。"},{"en":"This hallway connects the kitchen and the living room.","zh":"这条走廊连接厨房和客厅。"},{"en":"The new road connects several small towns.","zh":"这条新公路连接了好几个小镇。"}]},{"partOfSpeech":"v.","definition":{"en":"to form a relationship between ideas; to see how one thing is related to another.","zh":"把观点联系起来；理解事物之间的关联。"},"examples":[{"en":"She connects his words with what happened yesterday.","zh":"她把他的话和昨天发生的事联系起来。"},{"en":"I can’t connect this paragraph to the main topic.","zh":"我没法把这一段和主题联系起来。"}]},{"partOfSpeech":"v.","definition":{"en":"to succeed in contacting someone (by phone, email, etc.).","zh":"（通过电话、邮件等）联系上某人。"},"examples":[{"en":"He connects with the client every Friday.","zh":"他每周五都会和客户联系。"},{"en":"I tried to call, but I couldn’t connect.","zh":"我试着打电话，但没能接通。"}]},{"partOfSpeech":"v.","definition":{"en":"to make a device or system link to another device, network, or the internet.","zh":"（设备/系统）连接到另一设备、网络或互联网。"},"examples":[{"en":"My laptop connects to Wi‑Fi automatically.","zh":"我的笔记本会自动连接 Wi‑Fi。"},{"en":"This cable connects the monitor to the computer.","zh":"这根线把显示器连接到电脑。"}]}],"synonyms":["links","joins","attaches","ties","relates","contacts","hooks up"],"phonetic":"/kəˈnɛkts/","extraExplanation":["“connects”是动词“connect”的第三人称单数形式，主语是he/she/it或单数名词时常用：The app connects… / My phone connects…","在口语里，“connect (with someone)”常表示“与某人建立联系/产生共鸣”，带有人际关系或情感上的“连结”意味。"]}
{"word":"conned","summary":{"en":"“Conned” means “tricked/cheated” (past form of con), often to get money or make someone do something.","zh":"“conned”是“con”的过去式/过去分词，表示“被骗/被诈骗/被哄骗”，常指为钱或让人做某事而欺骗。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of “con”: to trick or cheat someone, especially to get money or an advantage","zh":"“con”的过去式/过去分词：欺骗、诈骗某人（尤其为了钱或获得好处）"},"examples":[{"en":"He conned people out of their savings by pretending to be an investment expert.","zh":"他假装是投资专家，骗走了人们的积蓄。"},{"en":"I realized I’d been conned when the “free trial” suddenly charged my card.","zh":"当“免费试用”突然扣了我的卡费时，我才意识到自己被骗了。"},{"en":"She felt embarrassed after being conned by a fake online seller.","zh":"被假网店卖家骗了之后，她感到很尴尬。"}]},{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of “con” (informal): to persuade someone to do something by using charm or dishonest pressure","zh":"“con”的过去式/过去分词（非正式）：用花言巧语或不诚实的方式哄骗/说服某人去做某事"},"examples":[{"en":"They conned me into signing a contract I didn’t fully understand.","zh":"他们哄骗我签了一个我没完全理解的合同。"},{"en":"He conned his friend into lending him money again.","zh":"他又骗朋友借钱给他。"}]}],"synonyms":["tricked","cheated","scammed","deceived","fooled"],"phonetic":"/kɑnd/","extraExplanation":["“con”常见于短语：con someone (into doing something)（骗某人去做某事）、con someone out of money/time（把某人的钱/时间骗走）。","词源与“confidence trick（骗局）”有关：con artist 指“骗子/诈骗犯”。在新闻与日常口语中很常见，语气通常偏负面。"]}
{"word":"Connee","summary":{"en":"“Connee” is not a standard English word; it’s most likely a misspelling of the name “Connie.”","zh":"“Connee”不是常见英语词；最可能是名字“Connie”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A likely misspelling of “Connie,” a female given name (often a nickname for Constance, sometimes Cornelia or other names).","zh":"常见为“Connie”的拼写错误；Connie 是女性名字，通常是 Constance 的昵称（也可能来自 Cornelia 等名字）。"},"examples":[{"en":"I think you meant Connie, not Connee.","zh":"我想你是想写 Connie，不是 Connee。"},{"en":"Connie is short for Constance in many English-speaking countries.","zh":"在许多英语国家，Connie 常是 Constance 的简称。"}]}],"synonyms":["Connie","Constance (full form)"],"phonetic":"/ˈkɑni/","extraExplanation":["“Connie”在英语里更常见，作为昵称使用很普遍，语气亲切、日常。正式场合（证件、邮件抬头）通常会用全名 Constance；熟人之间更常用 Connie。","如果你指的是某个品牌、地名、账号名或特定作品里的专有名词“Connee”，也可能是刻意的拼写变体；可以告诉我上下文（句子/出处），我可以更准确解释。"]}
{"word":"Connel","summary":{"en":"Connel is usually a surname (often a variant of Connell), sometimes a male given name, and it can also be a place name.","zh":"Connel 通常是姓氏（常为 Connell 的变体拼写），有时也用作男性名字，并且也可能是地名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname). It is also commonly seen as the spelling “Connell.”","zh":"一个姓氏（家族姓）。也常见拼写为“Connell”。"},"examples":[{"en":"Mr. Connel will join the meeting at 3 p.m.","zh":"Connel 先生将于下午三点参加会议。"},{"en":"Her last name is Connel, spelled C-O-N-N-E-L.","zh":"她的姓是 Connel，拼作 C-O-N-N-E-L。"}]},{"partOfSpeech":"other","definition":{"en":"a male given name (less common), related to the Irish name “Connell/Conall.”","zh":"一个男性名字（不太常见），与爱尔兰名字“Connell/Conall”有关。"},"examples":[{"en":"Connel was named after his grandfather.","zh":"Connel 是以他祖父的名字命名的。"},{"en":"Connel moved to California for work.","zh":"Connel 为工作搬到了加州。"}]},{"partOfSpeech":"other","definition":{"en":"a place name (e.g., Connel, a village area in Scotland).","zh":"一个地名（例如苏格兰的 Connel 一带/村庄地区）。"},"examples":[{"en":"They stayed near Connel while visiting the Scottish Highlands.","zh":"他们游览苏格兰高地时住在 Connel 附近。"}]}],"synonyms":["Connell","Conall"],"phonetic":"/ˈkɑnəl/","extraExplanation":["“Connel”更常被当作“Connell”的变体拼写。若你是在写人名、邮箱或证件信息，最好向当事人确认具体拼写。","与爱尔兰语名字“Conall/Connell”有关：传统含义常被解释为“强壮/勇敢”等（不同来源略有差异）。"]}
{"word":"Connell","summary":{"en":"Connell is mainly a surname (often Irish) and is also used as a first name.","zh":"Connell 主要用作姓氏（常见于爱尔兰裔），也可用作名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), often of Irish origin.","zh":"姓氏（常见于爱尔兰裔），作“康奈尔/康奈尔（等译名）”等音译使用。"},"examples":[{"en":"Sally Connell is our new project manager.","zh":"萨莉·康奈尔是我们的新项目经理。"},{"en":"I read an article by Dr. Connell.","zh":"我读了一篇康奈尔博士写的文章。"}]},{"partOfSpeech":"n.","definition":{"en":"a given name (first name), used for people of any gender but more commonly for men in English-speaking contexts.","zh":"人名（名字），英语语境中可用于任何性别，但更常见于男性。"},"examples":[{"en":"Connell moved to Chicago after college.","zh":"康奈尔大学毕业后搬去了芝加哥。"},{"en":"My cousin is named Connell.","zh":"我表弟（/堂兄弟）叫康奈尔。"}]}],"synonyms":["O’Connell (related surname)"],"phonetic":"/ˈkɑnəl/","extraExplanation":["“Connell”多被视为爱尔兰姓氏，常见解释是源自盖尔语姓氏形式（如 O’Connell 的一支/相关写法），与家族名传统有关。不同地区对它的读音可能略有差异，但在美式英语里通常重音在第一音节。","作为专有名词（人名/姓氏）时，一般不译义，只做音译；正式场合可直接保留拼写 Connell。"]}
{"word":"Connelley","summary":{"en":"Connelley is mainly used as a surname, often a spelling variant of the Irish surname Connelly.","zh":"Connelley 主要用作姓氏，常见为爱尔兰姓 Connelly 的一种拼写变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), most often an English spelling variant of the Irish surname Connelly","zh":"一个姓氏（家族姓），常见为爱尔兰姓 Connelly 的英语拼写变体"},"examples":[{"en":"Ms. Connelley will lead the meeting today.","zh":"Connelley 女士今天将主持会议。"},{"en":"My teacher’s last name is Connelley.","zh":"我老师的姓是 Connelley。"}]}],"synonyms":["Connelly","Conley","Connolly"],"phonetic":"/kəˈnɛli/","extraExplanation":["“Connelley”通常被认为是爱尔兰姓氏的变体拼写，常与 “Connelly / O’Connelly” 等形式相关。在英文世界里，姓氏的拼写常因移民登记、口音、文书记录等原因出现不同版本。","作为专有名词（人名/姓氏），它一般不翻译，只按读音音译或直接保留原拼写。正式场合首次出现可加称谓（Mr./Ms./Dr.）。"]}
{"word":"connellite","summary":{"en":"Connellite is a rare blue copper mineral usually found as needle-like crystals in oxidized copper deposits.","zh":"Connellite（康奈石）是一种罕见的蓝色含铜矿物，常以针状晶体产于铜矿床氧化带。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare blue mineral (a hydrated copper sulfate-chloride) found in oxidized copper deposits; often occurs as delicate needle-like crystals.","zh":"一种罕见的蓝色矿物（含水的铜硫酸盐-氯化物），常见于铜矿床的氧化带，常以细长针状晶体出现。"},"examples":[{"en":"The museum displayed a vivid blue connellite from a copper mine in Chile.","zh":"博物馆展出了一块来自智利铜矿的鲜蓝色康奈石（connellite）。"},{"en":"Under a hand lens, the connellite appeared as tiny radiating needles.","zh":"用放大镜观察时，康奈石呈现为放射状的细小针晶。"}]}],"synonyms":["(no common everyday synonyms; mineral name)"],"phonetic":"/ˈkɑnəlaɪt/","extraExplanation":["“connellite”是矿物学专有名词，通常不用于日常英语；在学术语境中常见搭配有：connellite crystals（康奈石晶体）、connellite needles（康奈石针晶）、connellite from + 地点（产自……的康奈石）。","词源上多以人名或研究者命名的矿物较常见；实际阅读中你更可能在矿物目录、博物馆标签或地质学文章里遇到它。"]}
{"word":"Connellsville","summary":{"en":"Connellsville is a city in southwestern Pennsylvania, USA.","zh":"Connellsville 是美国宾夕法尼亚州西南部的一座城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in southwestern Pennsylvania, USA, in Fayette County, located along the Youghiogheny River.","zh":"美国宾夕法尼亚州西南部费耶特县的一座城市，位于约吉奥格尼河（Youghiogheny River）沿岸。"},"examples":[{"en":"Connellsville is about an hour southeast of Pittsburgh by car.","zh":"康奈尔斯维尔（Connellsville）开车到匹兹堡东南方向大约一小时。"},{"en":"She grew up in Connellsville, Pennsylvania.","zh":"她在宾夕法尼亚州的康奈尔斯维尔长大。"}]}],"phonetic":"/ˈkɑnəlzˌvɪl/","extraExplanation":["“Connellsville”是专有名词（地名），通常首字母大写；在口语中常直接说“Connellsville”或更明确地说“Connellsville, Pennsylvania”。","该地历史上与煤炭与炼焦工业（coke/steel-related industry）有联系，也因河谷地形与周边户外活动而为人所知。"]}
{"word":"Connelly","summary":{"en":"Connelly is a surname (family name), most often associated with Irish heritage.","zh":"Connelly 是一个姓氏（家族姓），常与爱尔兰血统相关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a surname (family name), most commonly of Irish origin","zh":"康纳利（Connelly）：姓氏（家族姓），多见于爱尔兰裔人名"},"examples":[{"en":"Michael Connelly is a well-known American crime novelist.","zh":"迈克尔·康纳利（Michael Connelly）是一位知名的美国犯罪小说家。"},{"en":"Ms. Connelly will lead today’s meeting.","zh":"康纳利女士将主持今天的会议。"}]}],"synonyms":["Connolly (variant spelling)"],"phonetic":"/kəˈnɛli/","extraExplanation":["“Connelly”多被认为源自爱尔兰盖尔语姓氏（如 Ó Conghaile 等变体），后来在英语世界中拼写固定为 Connelly/Connolly 等不同形式。","在英语里，姓氏通常不翻译其“字面意思”，使用音译更常见（如“康纳利”）。在正式写作中，姓氏首字母需大写：Connelly。","常见相关拼写：Connolly（更常见的一种变体）、Conley（不同姓氏但拼写相近）。"]}
{"word":"Connemara","summary":{"en":"Connemara is a region on Ireland’s west coast (County Galway), also known in the term “Connemara pony.”","zh":"Connemara（康尼马拉）是爱尔兰西海岸戈尔韦郡的一片地区，也常见于“Connemara pony（康尼马拉小马）”这一说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rugged coastal region in County Galway, on the west coast of Ireland, known for its mountains, lakes, peat bogs, and Irish-speaking (Gaeltacht) communities.","zh":"爱尔兰西海岸戈尔韦郡的一个粗犷海岸地区，以山地、湖泊、泥炭沼泽以及爱尔兰语社群（盖尔特赫特地区）闻名。"},"examples":[{"en":"We drove through Connemara to see the mountains and the Atlantic coastline.","zh":"我们开车穿过康尼马拉，去看那里的群山和大西洋海岸线。"},{"en":"Connemara is famous for its wild scenery and traditional Irish culture.","zh":"康尼马拉以原始壮阔的风景和传统的爱尔兰文化而著名。"}]},{"partOfSpeech":"n.","definition":{"en":"(In expressions like “Connemara pony”) A breed of pony originating from Connemara, valued for being strong, calm, and versatile.","zh":"（如“Connemara pony”）康尼马拉小马：起源于康尼马拉地区的一种小马品种，以健壮、温顺且用途广而受欢迎。"},"examples":[{"en":"She learned to ride on a Connemara pony.","zh":"她骑术入门是在一匹康尼马拉小马上学会的。"},{"en":"Connemara ponies are popular for trekking and jumping.","zh":"康尼马拉小马很受欢迎，常用于野外骑行和障碍跳跃。"}]}],"phonetic":"/ˌkɑnəˈmɑrə/","extraExplanation":["“Connemara”通常读作重音落在最后一部分（-MA-ra）。它是地名专有名词，英语写作中首字母大写。","康尼马拉常出现在文学与歌曲里，用来唤起“西爱尔兰”的意象：辽阔、荒野感、海风、石墙与泥炭地等。对学习者来说，把它当作一个带有浓厚地域文化色彩的地名来理解最自然。"]}
{"word":"Conner","summary":{"en":"“Conner” is usually a personal name (a variant of “Connor”); it can also mean the person who directs a ship (nautical).","zh":"“Conner”通常是人名/姓氏（“Connor”的变体）；也可指（航海）指挥船只航行的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name or family name (proper noun), a variant spelling of “Connor.”","zh":"人名或姓氏（专有名词），常被视为“Connor”的一种拼写变体。"},"examples":[{"en":"Conner is my classmate; he’s good at math.","zh":"Conner 是我的同学，他数学很好。"},{"en":"Ms. Conner will call you back this afternoon.","zh":"Conner 女士今天下午会回你电话。"}]},{"partOfSpeech":"n.","definition":{"en":"(nautical) a person who directs or steers a ship; someone who “conns” the ship.","zh":"（航海）指挥或引导船只航行的人；负责“con（指挥航向）”的人。"},"examples":[{"en":"The conner gave calm orders as the ship entered the harbor.","zh":"船进港时，指挥航行的人沉着地下达指令。"},{"en":"In training, you learn how to be the conner on the bridge.","zh":"训练中，你会学习如何在舰桥上担任航行指挥。"}]}],"synonyms":["Connor (name variant)","ship’s conning officer (nautical)"],"phonetic":"/ˈkɑnɚ/","extraExplanation":["“Conner/Connor”在英语世界里很常见，尤其在美国。它常被认为与爱尔兰语姓氏来源有关（常见解释是与“猎犬/狼犬”相关的含义），但在日常使用中主要就是一个名字/姓氏，不必深究字面意思。","注意拼写：Conner 和 corner（角落）只差一个字母，但读音和意思不同。学习时可用“corner=角落”来帮助区分。"]}
{"word":"conner","summary":{"en":"“Conner” is usually a name (variant of Connor). As a vocabulary word, it’s rare and can mean a person who studies/memorizes something; it’s also commonly a misspelling of “corner.”","zh":"“Conner”多为人名（Connor 的变体拼写）。作为词汇用法较罕见，可指用功钻研/背诵的人；也常被误写来代替“corner（角落/拐角）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A person who “conns” (studies or memorizes something), especially a law student (old-fashioned usage).","zh":"（罕见）指“用功背诵/钻研”的人，尤其指学习法律的学生（较旧式用法）。"},"examples":[{"en":"In older writing, a conner of law meant someone who studied legal texts closely.","zh":"在较旧的写法里，a conner of law 指认真钻研法律文本的人。"},{"en":"She was praised as a diligent conner of grammar.","zh":"她被称赞为勤奋钻研语法的人。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname or given name (variant spelling of “Connor”).","zh":"姓氏或名字（“Connor”的一种拼写变体）。"},"examples":[{"en":"Conner is his family name.","zh":"Conner 是他的姓。"},{"en":"I met someone named Conner at school.","zh":"我在学校认识了一个叫 Conner 的人。"}]},{"partOfSpeech":"other","definition":{"en":"Often a misspelling of “corner” (the place where two lines or surfaces meet).","zh":"常见为“corner”的拼写错误（两条线或两个面相交的角落/拐角）。"},"examples":[{"en":"Did you mean “corner” (e.g., the corner of the room)?","zh":"你是不是想写“corner”（比如：房间的角落）？"},{"en":"Turn left at the next corner.","zh":"在下一个拐角左转。"}]}],"synonyms":["Connor","corner (common intended word)","student (rare sense)","scholar (rare sense)"],"phonetic":"/ˈkɑnɚ/","extraExplanation":["“conner”在现代英语里不算常用词汇。你在作业或日常表达里如果是想说“角落/拐角”，通常应该写 **corner**。","作为人名时，**Conner/Connor** 比较常见；Connor 源自爱尔兰盖尔语姓氏（常被解释为“某某的后代/后裔”一类的构词方式），在英语国家常见于姓名。"]}
{"word":"Conners","summary":{"en":"“Conners” is mainly a surname; it’s also known as the family name in the TV series Roseanne / The Conners.","zh":"“Conners”主要是姓氏；也常指电视剧《Roseanne / The Conners》中主角家庭的姓。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname); also the plural form of the given name “Conner.”","zh":"姓氏；也可指名字“Conner”的复数（多个叫 Conner 的人）。"},"examples":[{"en":"Ms. Conners will lead today’s meeting.","zh":"Conners 女士将主持今天的会议。"},{"en":"There are two Conners in our class, so we use their first names to avoid confusion.","zh":"我们班有两位姓 Conners 的同学，所以我们用名字来区分。"}]},{"partOfSpeech":"n.","definition":{"en":"(pop culture) the surname of the main family in the American TV series Roseanne and its follow-up The Conners.","zh":"（流行文化）美国电视剧《Roseanne / 罗斯安家庭生活》及其衍生剧《The Conners / 康纳一家》中主角家庭的姓氏。"},"examples":[{"en":"The show focuses on the everyday struggles of the Conners.","zh":"这部剧聚焦康纳一家日常生活中的压力与挑战。"},{"en":"He started watching The Conners after finishing Roseanne.","zh":"他看完《Roseanne》后开始追《The Conners》。"}]}],"synonyms":["Connor (variant spelling, often as a surname)"],"phonetic":"/ˈkɑnɚz/","extraExplanation":["“Conners”常见于英语国家的姓氏系统里。它有时与爱尔兰姓氏 O’Connor / Connor 的拼写变体相关（不同家族、不同移民记录会导致不同拼法）。","在正式写作中，若指一个家族，可说 “the Conners family”；若指复数的人（多个姓 Conners 的人），则直接用复数 “the Conners.”"]}
{"word":"conners","summary":{"en":"“Corner” means a place where two sides/streets meet, a quiet/hidden part of a place, or (as a verb) to trap or pressure someone.","zh":"“Corner”可指拐角/街角，也可指房间等的角落；作动词时表示把人（或动物）逼入困境、困住或逼问。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A point or area where two sides, edges, streets, or lines meet (often forming an angle).","zh":"（两条边、两条线或两条街）相交的角/拐角处。"},"examples":[{"en":"Turn left at the corner.","zh":"在拐角处左转。"},{"en":"There’s a coffee shop on the corner of Main Street and 2nd Avenue.","zh":"在主街和第二大道的街角有一家咖啡店。"}]},{"partOfSpeech":"n.","definition":{"en":"A hidden or small place, or a part of something that is not easily noticed.","zh":"（不显眼的）角落；偏僻处；隐蔽的地方。"},"examples":[{"en":"I found the missing key in the corner of the drawer.","zh":"我在抽屉的角落里找到了那把丢失的钥匙。"},{"en":"She sat quietly in a corner of the room.","zh":"她安静地坐在房间的一个角落里。"}]},{"partOfSpeech":"vt.","definition":{"en":"To trap someone or something so they cannot escape or avoid answering.","zh":"把……逼入困境；把……困住；逼问得无处可逃。"},"examples":[{"en":"The reporters cornered him after the meeting.","zh":"会议结束后，记者们把他围住追问。"},{"en":"I felt cornered and didn’t know what to say.","zh":"我感觉被逼到墙角，不知道该说什么。"}]}],"synonyms":["angle","edge","nook","trap","pin down"],"phonetic":"/ˈkɔrnər/","extraExplanation":["你输入的“conners”更常见是拼写错误，通常想写的是“corners”（corner 的复数）。“Conners”也可能是英文姓氏（例如某些人的姓）。如果你是想查姓氏或特定用法，可以告诉我上下文句子。"]}
{"word":"Connersville","summary":{"en":"Connersville is a city in Indiana, USA.","zh":"Connersville 是美国印第安纳州的一座城市。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A city in eastern Indiana, USA (Fayette County).","zh":"美国印第安纳州东部的一座城市（费耶特县）。"},"examples":[{"en":"She grew up in Connersville, Indiana.","zh":"她在印第安纳州的康纳斯维尔长大。"},{"en":"The meeting is in Connersville next week.","zh":"下周会议在康纳斯维尔举行。"}]}],"phonetic":"/ˈkɑnɚzˌvɪl/","extraExplanation":["“Connersville”是地名（专有名词），常见用法是直接当作地点名称使用：in/near/from Connersville。","发音上常见重音在第一个音节：CON-nerz-vil。","该地以历史上的工业与交通发展而闻名，日常语境中多用于描述居住地、行程、新闻地点等。"]}
{"word":"Connerville","summary":{"en":"Connerville is a proper noun used as a place name, especially for Connerville, Oklahoma.","zh":"Connerville 是专有名词，作为地名使用，尤其指美国俄克拉荷马州的 Connerville。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name (proper noun), used for a small community or town called Connerville (most commonly referring to Connerville, Oklahoma, USA).","zh":"地名（专有名词），指名为 Connerville 的社区或城镇（最常见指美国俄克拉荷马州的 Connerville）。"},"examples":[{"en":"Connerville is a small community in southern Oklahoma.","zh":"Connerville 是俄克拉荷马州南部的一个小社区。"},{"en":"We drove through Connerville on our way to the lake.","zh":"我们去湖边的路上开车经过了 Connerville。"}]}],"phonetic":"/ˈkɑnərˌvɪl/","extraExplanation":["Connerville 作为地名时，通常不需要翻译；中文里多用音译或直接保留英文拼写。","美国许多以 -ville 结尾的地名源自法语词根，意思大致是“城镇/聚落”，常用来表示“某某的城镇”（如以家族姓氏或当地人物命名）。"]}
{"word":"Connett","summary":{"en":"“Connett” is usually a surname; you may mean “connect,” which means to link things, contact someone, or feel a bond.","zh":"“Connett”通常是姓氏；你可能想查“connect”，意思是连接、联系或产生共鸣。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not a standard English word) “Connett” is most commonly a surname (family name). In everyday English, people often mean “connect.”","zh":"（不是常见英语单词）“Connett”最常见的是姓氏。在日常英语中，人们常想表达的是“connect（连接/联系）”。"},"examples":[{"en":"Ms. Connett will lead the meeting today.","zh":"Connett 女士今天将主持会议。"},{"en":"Did you mean “connect” (to link things or to contact someone)?","zh":"你是想说“connect”（把东西连接起来或与某人联系）吗？"}]},{"partOfSpeech":"vt.","definition":{"en":"To join or link two or more things together.","zh":"把两个或多个事物连接在一起。"},"examples":[{"en":"Connect the cable to the laptop.","zh":"把电缆连接到笔记本电脑上。"},{"en":"This bridge connects the two towns.","zh":"这座桥连接了两个城镇。"}]},{"partOfSpeech":"vi.","definition":{"en":"To contact someone or communicate with them; to build a relationship.","zh":"与某人联系、沟通；建立关系。"},"examples":[{"en":"I’ll connect with you after class.","zh":"下课后我再联系你。"},{"en":"It’s easy to connect with people who share your hobbies.","zh":"和有共同爱好的人建立联系很容易。"}]},{"partOfSpeech":"vi.","definition":{"en":"To understand or feel a bond with someone or something (often emotionally).","zh":"（常指情感上）理解并产生共鸣/建立情感纽带。"},"examples":[{"en":"I really connected with the main character in the book.","zh":"我非常能与书中的主角产生共鸣。"},{"en":"She connects with her audience through simple stories.","zh":"她用简单的故事与观众建立共鸣。"}]}],"synonyms":["link","join","attach","contact","reach (out to)","relate to"],"phonetic":"/kəˈnɛkt/","extraExplanation":["如果你是在看人名（比如作者、同事、学生名单），“Connett”多半就是姓氏，不需要翻译。","如果你想查的是“connect”，常见搭配有：connect A to B（把A连接到B）、connect with someone（与某人联系/产生共鸣）、connect the dots（把线索串起来，弄明白）。"]}
{"word":"connex","summary":{"en":"Connex means “connected or related,” used mainly in formal contexts.","zh":"connex 表示“相连的/有关联的”，主要用于较正式语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected; related or linked (often used in formal writing, and more common in British English).","zh":"相连的；有关联的（多用于正式语体，英式英语更常见）。"},"examples":[{"en":"These issues are connex with wider social changes.","zh":"这些问题与更广泛的社会变化有关联。"},{"en":"The two cases are not directly connex.","zh":"这两个案件并没有直接关联。"}]}],"synonyms":["connected","related","linked","associated"],"phonetic":"/kəˈnɛks/","extraExplanation":["“connex”是“connected”的较少见/较正式的同义词，来源于拉丁语系词根（con- 表示“共同/一起”）。在现代日常英语中更常用 connected / related / linked。","在商业语境里 Connex/Connexxion 也常作为公司名或品牌名出现（此时通常大写），含义多与“连接、网络、交通”等相关。作为品牌名时不一定等同于词典义。"]}
{"word":"connexare","summary":{"en":"“Connexare” is not standard English; it’s a Latin-style form meaning “to connect/link.” Usually, write “connect.”","zh":"“connexare”不是标准英语，更像拉丁化形式，意为“连接/联系”。通常应写“connect”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not standard modern English) A Latin-based form meaning “to connect; to link together.” It may appear as a scholarly/neo-Latin term, a name element, or a misspelling of English “connect/connexion.”","zh":"（非现代标准英语）一个拉丁语系形式，意思是“连接；把……连在一起”。可能出现在学术/新拉丁语语境、名称构词中，或是英语 connect/connexion 的误拼。"},"examples":[{"en":"This word isn’t common in English; in most cases you should write “connect” instead of “connexare.”","zh":"这个词在英语里不常见；多数情况下应写“connect”，而不是“connexare”。"},{"en":"In some academic notes, a Latin-style term like “connexare” may be used to mean “to link concepts together.”","zh":"在一些学术笔记里，类似“connexare”的拉丁化词形可能用来表示“把概念联系起来”。"}]}],"synonyms":["connect","link","join","tie","bind"],"phonetic":"/kəˈnɛk.sɑːreɪ/","extraExplanation":["“Connex-”这一词根与英语的 connect、connection、connexion 同源，来自拉丁语 connectere（con- “共同” + nectere “系、绑、连”）。因此你看到“connexare”时，通常可以把它理解为“连接”的拉丁化表达，但在正式英语写作中不建议使用。","如果你是在某篇文章、游戏、品牌名或特定学科材料里看到 connexare，它可能是作者的创作词、拉丁风格拟词，或拼写变体。若你能提供原句/截图，我可以帮你判断它在该语境中的确切含义。"]}
{"word":"connexes","summary":{"en":"Connexes is a rare, formal word meaning “connected/related,” and it can also appear in math/logic (e.g., “connex relation”).","zh":"Connexes 是较罕见且偏正式的用法，意思是“相连的/相关的”；在数学或逻辑中也可能出现（如 connex relation）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare, formal) Connected; linked together; having a close relationship.","zh":"（罕见，正式）相连的；有关联的；关系密切的。"},"examples":[{"en":"The report discusses economic issues and the connexes social problems behind them.","zh":"这份报告讨论了经济问题以及其背后相关联的社会问题。"},{"en":"These two ideas are connexes, so it helps to study them together.","zh":"这两个观点彼此关联，所以一起学习会更有帮助。"}]},{"partOfSpeech":"adj.","definition":{"en":"(mathematics/logic, rare) Having the property that any two elements can be compared or are connected by a relation (often used in the phrase “connex relation”).","zh":"（数学/逻辑，罕见）具有“可比/相连”性质的（常见于短语“connex relation（可比关系/连通关系）”）。"},"examples":[{"en":"In logic, a connex relation means for any two elements, one relates to the other.","zh":"在逻辑中，connex relation 指任意两个元素之间，总有一个与另一个满足该关系。"}]}],"synonyms":["connected","linked","related","associated"],"phonetic":"/kəˈnɛks/","extraExplanation":["“connexes”通常是形容词“connex”的复数形式（修饰复数名词时用），在现代英语里很少见，更常用的是“connected / related / linked”。","容易和“connects”（动词 connect 的第三人称单数：他/她/它连接）混淆：\n- connexes（形容词，罕见）：connected\n- connects（动词）：links/joins"]}
{"word":"connexion","summary":{"en":"“Connexion” is an older/less common spelling of “connection,” meaning a link, relationship, or network/travel connection.","zh":"“connexion”是“connection”的较旧/较少见拼写，表示连接、联系/关联，或网络与交通上的衔接。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A connection; a link or relationship between people, things, or ideas (older/less common spelling of “connection”).","zh":"连接；联系；关联（“connection”的较旧/较少见拼写）。"},"examples":[{"en":"There is a clear connexion between diet and health.","zh":"饮食与健康之间有明显的关联。"},{"en":"She used her family connexions to find an internship.","zh":"她利用家族人脉找到了实习机会。"}]},{"partOfSpeech":"n.","definition":{"en":"A network or travel link (e.g., an internet link, a train/flight transfer).","zh":"网络或交通上的连接/衔接（如网络连接、火车/航班转乘）。"},"examples":[{"en":"My internet connexion is unstable today.","zh":"我今天的网络连接不太稳定。"},{"en":"We missed our connexion in Chicago and arrived late.","zh":"我们在芝加哥错过了转机，所以到得很晚。"}]}],"synonyms":["connection","link","relationship","association","tie"],"phonetic":"/kəˈnɛkʃən/","extraExplanation":["“connexion”在现代美式英语里几乎不用；更标准、更常见的拼写是“connection”。你会在英式英语的旧书、法律/历史文本，或受法语拼写影响的写作中见到“connexion”。","在含义上，“connexion”与“connection”基本相同；写作时如果不是刻意模仿旧式/英式风格，建议用“connection”。"]}
{"word":"connexional","summary":{"en":"Connexional means “relating to connections,” especially the Methodist church system where local churches are linked under a wider organization.","zh":"Connexional 指“与联系/连接有关”，尤指卫理宗等教会采用的联会制：地方教会在更大组织下彼此相连。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to connection(s) or an organized network of relationships; often used about church organization (especially Methodism) based on linked local groups under a wider “connection.”","zh":"与“联系/连接”或关系网络有关的；也常指（尤指卫理公会的）“联会制/连结制”教会组织：地方教会彼此相连，并受更大范围的联会统筹。"},"examples":[{"en":"The church has a connexional structure, so local congregations share leadership and resources.","zh":"这间教会采取 connexional（联会制）结构，所以各地方会众共享领导与资源。"},{"en":"Methodists often describe their governance as connexional rather than purely congregational.","zh":"卫理宗常把自己的治理方式称为 connexional（联会制），而不只是“会众自治制”。"}]}],"synonyms":["connectional","connected","interconnected","networked"],"phonetic":"/kəˈnɛkʃənəl/","extraExplanation":["“connexional”是较少见的拼写，常见于英式英语或教会语境；在现代通用写法中更常见的是“connectional”。在卫理宗传统里，“the Connexion/Connection”可指整个教会的联会体系，因此该词常出现在宗教组织与治理的讨论中。"]}
{"word":"connexionalism","summary":{"en":"Connexionalism is a church-governance system that links congregations under shared oversight, especially in Methodist traditions.","zh":"Connexionalism 指一种将各地教会在共同监督下联结起来的教会治理制度，尤见于卫理公会传统。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a system of church organization in which local congregations are linked together under shared rules and oversight (common in Methodist traditions); also the belief that this connected structure is the best way to govern a church","zh":"一种教会组织制度：各地会众在共同规则与监督下彼此联结（常见于卫理公会传统）；也指主张这种“联结制”最适合治理教会的观念"},"examples":[{"en":"The denomination follows connexionalism, so decisions are made through conferences rather than by a single local church.","zh":"该宗派实行联结制，因此重大决定通常通过（教会）年议会/大会作出，而不是由某一个地方教会单独决定。"},{"en":"Connexionalism emphasizes accountability between ministers and congregations across regions.","zh":"联结制强调不同地区的牧者与会众之间的彼此负责与监督。"}]}],"synonyms":["connectionalism","connectional polity","connexionism"],"phonetic":"/kəˈnɛkʃənəˌlɪzəm/","extraExplanation":["“connexionalism”是英式拼写（connex-），美式更常见写法是“connectionalism”。两者含义相同。","这一术语常与卫理公会（Methodism）的“conference（议会/年议会）”制度一起出现，强调地方教会不是完全独立，而是属于一个相互联结、共同治理的整体。","注意不要与“connectionism（连接主义）”混淆：后者多用于心理学/人工智能领域，指用“神经网络式连接”解释认知的理论。"]}
{"word":"connexionism","summary":{"en":"Connexionism is a theory/approach that explains cognition and learning through networks of connected units (often like neural networks).","zh":"联结主义是一种理论/方法，用连接成网络的单元（常类似神经网络）来解释认知与学习。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A theory in psychology and cognitive science that explains learning and thinking as patterns of connections in a network (often modeled like a brain’s neural network).","zh":"（心理学与认知科学中的）联结主义：认为学习与思维来自网络中“连接关系/权重”的变化，常用类似神经网络的模型来解释。"},"examples":[{"en":"Connexionism suggests that the mind works through many simple units connected together.","zh":"联结主义认为心智是由许多简单单元相互连接并共同运作的。"},{"en":"In a connexionist model, learning happens when the strengths of connections change.","zh":"在联结主义模型中，学习发生在连接强度发生变化时。"}]},{"partOfSpeech":"n.","definition":{"en":"A network-based approach to modeling language, memory, or perception, often contrasted with rule-based or symbolic approaches.","zh":"一种用“网络”来建模语言、记忆或知觉的方法，常与“基于规则/符号”的方法形成对比。"},"examples":[{"en":"Some researchers use connexionism to model how children learn word meanings.","zh":"一些研究者用联结主义来模拟儿童如何学习词义。"},{"en":"The paper compares a rule-based grammar with a connexionist approach.","zh":"这篇论文比较了基于规则的语法与联结主义方法。"}]}],"synonyms":["connectionism","neural-network approach","parallel distributed processing (PDP)"],"phonetic":"/kəˈnɛkʃənɪzəm/","extraExplanation":["“connexionism”是“connectionism”的一种拼写变体（较常见于英式或较早期学术写法），在当代英语学术写作中“connectionism”更常见。","在文化与学术语境中，联结主义常与“符号主义/规则系统”（symbolic, rule-based models）对照；前者强调从大量数据与连接权重中“涌现”出能力，后者强调明确的规则与符号操作。","相关领域常见搭配：connexionist model（联结主义模型）、neural network（神经网络）、distributed representation（分布式表征）、parallel distributed processing / PDP（并行分布式处理）。"]}
{"word":"connexions","summary":{"en":"Connexions is a variant spelling of connections, meaning links/relationships, useful contacts, or travel connections.","zh":"Connexions 是 connections 的拼写变体，意思可指联系/关系、人脉，或交通换乘/接驳。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Links or relationships between people, things, or ideas; the ways they are related.","zh":"（人、事物或想法之间的）联系；关联；关系。"},"examples":[{"en":"There is a strong connexion between diet and health.","zh":"饮食和健康之间有很强的关联。"},{"en":"The report explains the connexions between climate change and extreme weather.","zh":"这份报告解释了气候变化与极端天气之间的联系。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or group you know who can help you (a useful social or professional contact).","zh":"（可提供帮助的）人脉；关系；熟人圈。"},"examples":[{"en":"She found the job through her connexions in the industry.","zh":"她通过自己在业内的人脉找到了这份工作。"},{"en":"Good connexions can open doors, but skills still matter.","zh":"好的人脉能打开机会之门，但能力仍然重要。"}]},{"partOfSpeech":"n.","definition":{"en":"A link between travel routes or services (such as trains or flights).","zh":"（交通线路或服务之间的）接驳；换乘；联运。"},"examples":[{"en":"We missed our connexion in Chicago and had to rebook.","zh":"我们在芝加哥错过了换乘，只能改签。"},{"en":"This route offers convenient connexions to other cities.","zh":"这条线路提供到其他城市的便捷接驳。"}]}],"synonyms":["connections","links","relationships","ties","associations","network","contacts"],"phonetic":"/kəˈnɛkʃənz/","extraExplanation":["“connexions”是“connections”的另一种拼写（较常见于英式英语、旧式拼写或特定出版物/学术写作中）。在美式英语里通常写作“connections”。意思基本相同。"]}
{"word":"connexities","summary":{"en":"Connexities means the connectedness or interrelated connections of things; it’s the plural of connexity and is often technical.","zh":"Connexities 指“连通性/相互关联的连接”，是 connexity 的复数，常用于学术或技术语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of *connexity*: the state of being connected; the degree or pattern of interrelated connections (often in technical or academic writing).","zh":"*connexity* 的复数：连通性；相互连接、相互关联的状态或程度（常见于学术/技术语境）。"},"examples":[{"en":"Researchers compared the connexities of different social networks.","zh":"研究人员比较了不同社交网络的连通性。"},{"en":"In topology, certain connexities describe how parts of a space join together.","zh":"在拓扑学中，一些“连通性”用来描述空间各部分如何连接在一起。"}]}],"synonyms":["connectivity","connectedness","interconnectedness","linkage"],"phonetic":"/kəˈnɛksəti/","extraExplanation":["“connexities”来自较少见的拼写 *connexity*（connex-），在现代英语里更常用的是 *connectivity*（连接度/连通性）。在数学（尤其拓扑学）或较旧的学术文体中，你可能会看到 *connexity/connexities*。","拼写差异提示：*connex-* 是较传统/英式色彩的拼写变体；在美式与当代通用写作中，通常建议用更常见的 *connectivity*，除非你的领域（例如某些数学文本）固定使用 *connexity*。"]}
{"word":"connexity","summary":{"en":"Connexity means connectedness—especially the mathematical idea of whether a space, network, or relation is connected.","zh":"Connexity 指“连通性/连接性”，尤其常用于数学中描述空间、网络或关系是否连通。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(General, less common) The state or quality of being connected; connectedness.","zh":"（较少见）连接的状态或性质；连通性。"},"examples":[{"en":"In a complex supply chain, connexity between partners matters for speed and reliability.","zh":"在复杂的供应链中，合作伙伴之间的连通性会影响速度与可靠性。"},{"en":"The report highlights the need for better connexity among regional transport systems.","zh":"报告强调需要加强区域交通系统之间的连通性。"}]},{"partOfSpeech":"n.","definition":{"en":"(Mathematics: topology/graph theory/logic) A property describing whether parts of a space, network, or relation are connected (e.g., whether a graph is connected).","zh":"（数学：拓扑/图论/逻辑）描述空间、网络或关系是否相互连通的一种性质（例如图是否为连通图）。"},"examples":[{"en":"We first prove connexity of the network, then analyze shortest paths.","zh":"我们先证明该网络的连通性，再分析最短路径。"},{"en":"Connexity is a basic idea in topology: it asks whether a space can be split into separate pieces.","zh":"连通性是拓扑学的基本概念：它关注一个空间能否被分成彼此分离的部分。"}]}],"synonyms":["connectedness","connectivity","interconnectedness","linkage"],"phonetic":"/kəˈnɛksəti/","extraExplanation":["“connexity”多见于学术语境，是“connectivity / connectedness（连通性/连接性）”的较少见拼写与用法。现代英语里更常用“connectivity”来谈网络/交通/系统之间的连接程度；在数学里常用“connectedness”或直接说“a graph is connected”。","词根提示：来自拉丁语“nect-（系、绑、连）”；拼写“connex-”与“connect-”相关，历史上都出现过，但当代通用写法通常偏向“connect-”。"]}
{"word":"connexiva","summary":{"en":"Connexiva is not a common everyday English word; it usually appears as a rare form meaning “connected/linking,” or as a proper name (brand/company).","zh":"Connexiva 不是日常常用英语词；多见于罕见用法表示“连接的/起连接作用的”，或作为专有名词（品牌/公司名）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Connected; linking things together; relating to a connection.","zh":"（罕见用法）有连接性的；把事物连在一起的；与“连接”有关的。"},"examples":[{"en":"In some older texts, a “connexive” tissue is described as tissue that links structures together.","zh":"在一些较旧的文本中，“connexive” tissue 指连接不同结构的组织。"},{"en":"The author uses a connexive argument to show how the ideas fit together.","zh":"作者用一种“连接性的”论证来说明这些观点如何相互契合。"}]},{"partOfSpeech":"other","definition":{"en":"A proper name (e.g., a company/product name). Meaning depends on the organization using it.","zh":"专有名词（如公司/产品名）。“含义”取决于具体机构的命名与业务。"},"examples":[{"en":"Connexiva provides digital services for small businesses.","zh":"Connexiva 为小型企业提供数字化服务。"}]}],"synonyms":["connective","connecting","linked","related"],"phonetic":"/kəˈnɛk.sɪ.və/","extraExplanation":["“Connexiva”在现代英语里并不是常见词，更常见的相关词是 connective（连接的；连接词）和 connexive（罕见拼写/用法）。connex- 来自拉丁语，意为“绑在一起、连在一起”。","在逻辑学里有术语 connexive logic（连接逻辑），用 connexive 表示某些“与蕴含/否定关系更紧密”的逻辑系统；但这属于较专业领域。","如果你是在某个网页、论文或产品里看到 Connexiva，它很可能是品牌/机构名，建议结合上下文（行业、句子）来确定具体指什么。"]}
{"word":"connexive","summary":{"en":"Connexive means “connecting/related to connection,” and in logic it refers to logics that require a strong link in ‘if…then…’ statements.","zh":"connexive 表示“连接的/有关联的”；在逻辑学中指强调“如果……那么……”前后必须有紧密关联的连接逻辑。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) Relating to connection; connecting; showing a link between things.","zh":"（较少用）与连接有关的；起连接作用的；表示事物之间有联系的。"},"examples":[{"en":"In her essay, she used connexive phrases to link each paragraph smoothly.","zh":"在她的文章里，她用一些起连接作用的短语，让每一段衔接得很顺畅。"},{"en":"The author’s argument is clear because each point has a connexive relation to the next.","zh":"作者的论证很清晰，因为每个观点与下一个观点之间都有连接性的关系。"}]},{"partOfSpeech":"adj.","definition":{"en":"(logic) Describing a family of logics that emphasize a strong connection between a conditional statement (“if…then…”) and its antecedent and consequent.","zh":"（逻辑学）指“连接逻辑”（connexive logic）一类逻辑体系，强调条件句“如果……那么……”与其前件、后件之间必须有较强的关联。"},"examples":[{"en":"Connexive logic rejects some conditionals that standard logic would allow.","zh":"连接逻辑会否定一些在标准逻辑中仍被允许的条件命题。"},{"en":"In a connexive system, ‘If A, then not A’ is often treated as problematic.","zh":"在连接逻辑体系中，“如果A，那么非A”常被视为有问题的条件命题。"}]}],"synonyms":["connective","linking","related","associative"],"phonetic":"/kəˈnɛksɪv/","extraExplanation":["“connexive”源自拉丁语词根，和“connect（连接）/connection（连接）”同源。在现代英语里更常见的是“connective（连接的；连接词的）”。在逻辑学语境中，“connexive logic”是专门术语，因此你更可能在哲学、逻辑教材或论文里看到它。"]}
{"word":"connexivum","summary":{"en":"Connexivum is a Latin-based medical term meaning “connective tissue.”","zh":"Connexivum 是拉丁来源的医学用语，意思是“结缔组织”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anatomy/Histology, Latin-based term) connective tissue; the supporting tissue that connects, binds, or separates other tissues and organs.","zh":"（解剖/组织学，拉丁来源用语）结缔组织；一种用于连接、支持或分隔其他组织与器官的组织。"},"examples":[{"en":"In older anatomy texts, you may see the Latin term connexivum used for connective tissue.","zh":"在较早的解剖学教材里，你可能会看到用拉丁词 connexivum 指“结缔组织”。"},{"en":"Inflammation can spread through the connexivum between muscle fibers.","zh":"炎症可能会沿着肌纤维之间的结缔组织扩散。"}]}],"synonyms":["connective tissue","connective tissue (Latin term)"],"phonetic":"/kəˈnɛk.sɪ.vəm/","extraExplanation":["这个词更常见于拉丁文或较旧的医学/解剖学文献，而现代英文通常直接写 connective tissue（结缔组织）。","词源上与“连接”有关，和英语 connect、connection 属于同一词根概念（都围绕“把东西连在一起”）。阅读文献时看到 connexivum，基本可等同理解为 connective tissue。"]}
{"word":"connexure","summary":{"en":"Connexure means a connection or relationship, but it is rare and old-fashioned; “connection” is the usual modern word.","zh":"Connexure 表示“联系/关联”，但很罕用且偏旧式；现代更常用 connection。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a connection or relationship between people, things, or ideas (rare; an old-fashioned spelling/variant of “connection/connexion”).","zh":"（罕用）联系；关联；关系（“connection/connexion”的旧式或变体拼写）。"},"examples":[{"en":"Scientists studied the connexure between air pollution and asthma.","zh":"科学家研究了空气污染与哮喘之间的关联。"},{"en":"There is a close connexure between language and culture.","zh":"语言与文化之间有密切的联系。"}]}],"synonyms":["connection","linkage","relationship","association","tie"],"phonetic":"/kəˈnɛkʃər/","extraExplanation":["“connexure”在现代英语中非常少见，多数场合建议用更常见的“connection”（美式/通用）或“connexion”（较偏英式、也较少见）。","词根上与拉丁语“connectere”（连接）有关；拼写中的“-x-”常见于较旧或较英式的变体（如 connexion）。"]}
{"word":"connexus","summary":{"en":"Connexus is most commonly a proper name for an organization or platform; rarely, it can mean a connection or bond.","zh":"Connexus 最常见是机构或平台的专有名称；少见情况下可表示“连接/纽带”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand or organization name (proper noun), often used for companies, schools, or online learning systems; it suggests the idea of “connection” or “network.”","zh":"（专有名词）品牌或机构名称，常见于公司、学校或在线学习系统；含义多带“连接/网络”的联想。"},"examples":[{"en":"Connexus is the platform our school uses for online courses.","zh":"Connexus 是我们学校用来上网课的平台。"},{"en":"I contacted Connexus customer support to reset my account.","zh":"我联系了 Connexus 客服来重置账号。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare/formal) a connection or linking together; a bond.","zh":"（少见/较正式）连接；联结；纽带。"},"examples":[{"en":"The report discussed the connexus between education and opportunity.","zh":"报告讨论了教育与机会之间的联系。"},{"en":"She described a strong connexus among the members of the team.","zh":"她形容团队成员之间有很强的纽带。"}]}],"synonyms":["connection","link","nexus","network"],"phonetic":"/kəˈnɛksəs/","extraExplanation":["“Connexus”看起来源自拉丁语词根 *connect-*（连接），与 *connection / connect / nexus* 同源；因此很多机构会用它做品牌名来表达“互联、协作、网络化”的感觉。","在实际英语里，“Connexus”更常见的是专有名词（平台/公司名）。如果你想表达普通意义的“联系/关联”，更自然的词通常是 **connection** 或 **link**；更偏正式可用 **nexus**。"]}
{"word":"Conney","summary":{"en":"“Conney” is usually a variant or misspelling of “coney,” meaning a rabbit; in older Bible English it can mean the rock hyrax; it can also (dated) mean a gullible person.","zh":"“Conney”多为“coney”的变体拼写或误拼：常指兔子；在较老的《圣经》英语中也可指蹄兔；另外（过时）还可指轻信、好骗的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rabbit (especially in older or literary English); also a common spelling in some place names","zh":"兔子（尤用于较古老或文学语境；也常见于一些地名的拼写）"},"examples":[{"en":"In older stories, the hunter chased a coney through the brush.","zh":"在较老的故事里，猎人追着一只兔子（coney）穿过灌木丛。"},{"en":"Coney Island is a famous beach area in New York City.","zh":"Coney Island（科尼岛）是纽约市著名的海滨地区。"}]},{"partOfSpeech":"n.","definition":{"en":"(in some older Bible translations) the rock hyrax, a small animal that lives among rocks; not a rabbit","zh":"（某些较老的《圣经》译本中）蹄兔/岩狸，一种生活在岩石间的小动物；并不是兔子"},"examples":[{"en":"In the King James Bible, “coney” refers to an animal living in rocky places.","zh":"在《钦定版圣经》中，“coney”指的是生活在岩石地带的动物。"}]},{"partOfSpeech":"n.","definition":{"en":"(dated, informal) a person who is easily tricked; a gullible person","zh":"（过时/非正式）容易受骗的人；轻信的人"},"examples":[{"en":"Don’t be a coney—check the facts before you pay.","zh":"别当冤大头——付款前先核实事实。"}]}],"synonyms":["rabbit","bunny","hare (not exact)","gull (dated, for the person sense)"],"phonetic":"/ˈkoʊni/","extraExplanation":["“Conney”常被当作“coney”的变体拼写或误拼；更常见的标准拼写是 coney。","词源上 coney 来自古法语/拉丁语，原义与“兔类”有关；但在一些古老文本（尤其是《圣经》）里，它指的其实是“蹄兔（rock hyrax）”，这是因为早期译者对动物对应关系的理解与现代不同。","与文化相关的固定搭配：Coney Island（纽约“科尼岛”）的名字里就保留了 coney 这一拼写。"]}
{"word":"Conni","summary":{"en":"Conni is usually a female name, a variant of Connie, often a nickname for Constance.","zh":"Conni 通常是女性名字，是 Connie 的变体拼写，常作 Constance 的昵称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a female given name (also used as a nickname), usually a variant spelling of “Connie,” often short for “Constance” (and sometimes “Cornelia” or “Concetta”).","zh":"女性名字（也可作昵称），常见于“Connie”的变体拼写；通常是“Constance（康斯坦斯，意为坚定/恒常）”的昵称，也有时是“Cornelia / Concetta”等名字的昵称。"},"examples":[{"en":"Conni is my cousin; she lives in Chicago.","zh":"Conni 是我表姐；她住在芝加哥。"},{"en":"Her full name is Constance, but everyone calls her Conni.","zh":"她的全名是 Constance，但大家都叫她 Conni。"},{"en":"Please ask Conni if she can join the meeting at 3 p.m.","zh":"请问一下 Conni 能不能在下午三点参加会议。"}]}],"synonyms":["Connie","Constance (full form)"],"phonetic":"/ˈkɑni/","extraExplanation":["“Conni/Connie”在英语里更常见的拼法是“Connie”。如果你是在德国或德语语境中看到“Conni”，它也可能指儿童读物/动画系列《Meine Freundin Conni》（中文常译“我的朋友康妮/康尼”）的主角名。","发音上在美式英语里通常读作重音在前：CON-nee。正式场合如果不确定对方偏好的拼写或发音，可以礼貌地确认。"]}
{"word":"Connie","summary":{"en":"Connie is a personal name, commonly a nickname for Constance.","zh":"Connie 是人名，常见为 Constance 的昵称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name, usually a nickname for names like Constance (and sometimes Cornelia or Conrad); used for girls more often than boys in modern English.","zh":"人名“Connie”，常作 Constance（有时也作 Cornelia 或 Conrad）的昵称；现代英语里更常用于女性。"},"examples":[{"en":"Connie is short for Constance in many English-speaking families.","zh":"在许多英语家庭里，Connie 是 Constance 的昵称。"},{"en":"I met Connie at the library after class.","zh":"下课后我在图书馆遇到了 Connie。"}]}],"synonyms":["Constance","Cornelia","Conrad"],"phonetic":"/ˈkɑni/","extraExplanation":["“Connie”在英语里属于比较口语、亲切的昵称（nickname）。在正式文件或职场名片上，有些人会用全名 Constance，但在日常生活中更常用 Connie。","在美国语境中，“Connie”给人的感觉通常偏友好、随和，也带一点点上世纪中后期常见英文名的气质（但现在仍有人使用）。"]}
{"word":"connie","summary":{"en":"Connie is a common female first name, often a nickname for Constance.","zh":"Connie 是常见的女性英文名，常用作 Constance 的昵称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name, often used as a nickname for Constance (and sometimes other names like Cornelia).","zh":"女性名字；常作 Constance（有时也作 Cornelia 等）的昵称。"},"examples":[{"en":"Connie is my older sister.","zh":"Connie 是我的姐姐。"},{"en":"Her full name is Constance, but everyone calls her Connie.","zh":"她的全名是 Constance，但大家都叫她 Connie。"}]}],"synonyms":["Constance (related full form)"],"phonetic":"/ˈkɑni/","extraExplanation":["“Connie”在英语语境里通常给人比较亲切、随和的感觉，常见于20世纪中后期的美国英语姓名中。","它既可以出现在正式文件（如护照、简历）中，也常作为日常称呼使用；如果对方自我介绍为“Connie”，一般直接称呼 Connie 即可。","一些知名人物：Connie Chung（美国记者）、Connie Francis（美国歌手）。"]}
{"word":"connies","summary":{"en":"“Connies” most commonly means multiple people named Connie. Much more rarely, it can mean rabbits in old/dialect usage.","zh":"“Connies”最常见是指多位名叫 Connie 的人；很少见的情况下，在旧式/方言用法中可指“兔子”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people named Connie (plural of the given name “Connie”)","zh":"名叫 Connie 的人（人名 Connie 的复数）"},"examples":[{"en":"Two Connies work in our office, so we use their last names to avoid confusion.","zh":"我们办公室有两位叫 Connie 的人，所以我们用她们的姓来避免混淆。"},{"en":"The Connies in my family are my aunt and my cousin.","zh":"我家里叫 Connie 的人是我阿姨和我表妹。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, rare) rabbits; “connies” is sometimes used as a plural of “connie,” a dialect form related to “coney” (rabbit)","zh":"（非正式、较少见）兔子；“connies”有时作“connie”的复数用法，“connie”是与“coney（兔子）”相关的方言形式"},"examples":[{"en":"The old book mentioned “connies” hiding in the bushes.","zh":"那本旧书提到“connies（兔子）”躲在灌木丛里。"}]}],"synonyms":["people named Connie","rabbits (rare)"],"phonetic":"/ˈkɑniz/","extraExplanation":["“Connie”常见于英语国家作女性名字，一般是“Constance”的昵称，也可能是“Concetta”等名字的昵称。写作“Connies”通常就是指多位叫Connie的人。","表示“兔子”的用法更偏旧式/方言色彩；现代英语更常用“rabbit”。"]}
{"word":"conning","summary":{"en":"“Conning” can mean swindling someone, studying something closely (often memorizing), or (in nautical use) directing a ship’s movement.","zh":"“conning”可指诈骗他人、认真研读/背诵，或（航海用语）指挥船只航行。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"trying to trick someone in order to get money or an advantage; swindling (present participle of “con”).","zh":"欺骗、诈骗（“con”的现在分词），指为了钱或利益而骗别人。"},"examples":[{"en":"He was arrested for conning elderly people out of their savings.","zh":"他因骗取老年人的积蓄而被捕。"},{"en":"The email looked official, but it was just someone conning users into giving their passwords.","zh":"那封邮件看起来很官方，但其实是有人在诱骗用户交出密码。"}]},{"partOfSpeech":"v.","definition":{"en":"studying something carefully, especially to learn it by heart (present participle of “con”).","zh":"认真研读、背诵（“con”的现在分词），尤其指为了记住而学习。"},"examples":[{"en":"She spent the afternoon conning vocabulary for the test.","zh":"她花了一下午背考试要用的词汇。"},{"en":"He was conning the map before the hike.","zh":"出发徒步前，他在仔细研究地图。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of directing or steering a ship; navigation control (more common in the form “conning,” “the conn,” or “to con” a ship).","zh":"指挥/操纵船只航行的行为；掌舵与导航控制（常见于“the conn/ to con a ship”等说法）。"},"examples":[{"en":"The officer took over conning as the ship entered the harbor.","zh":"船只进港时，那名军官接手指挥航行。"},{"en":"Good conning depends on clear communication and careful attention.","zh":"良好的航行指挥依赖清晰沟通与高度专注。"}]}],"synonyms":["swindling","deceiving","scamming","studying","memorizing","navigating"],"phonetic":"/ˈkɑnɪŋ/","extraExplanation":["“conning”有两条常见来源与用法：\n1) 来自动词 con（诈骗），口语里很常见，如 con artist（骗子）。\n2) 来自动词 con（用功背诵/研读），在现代英语里偏书面或旧式一些。\n另外在航海语境中常见 conn / con（指挥船只航行）这一套表达；潜艇上的 conning tower（指挥塔）也来自这个航海用法。"]}
{"word":"conniption","summary":{"en":"“Conniption” means a sudden outburst of anger or panic, often said in a humorous way.","zh":"“Conniption”指突然的暴怒或惊恐式情绪爆发，常带夸张/幽默语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sudden, uncontrollable burst of anger, panic, or strong emotion (often used humorously).","zh":"（常带幽默语气的）突然的暴怒、惊恐或情绪失控。"},"examples":[{"en":"When he saw the broken vase, he had a conniption.","zh":"他看到花瓶被打碎时，突然大发雷霆。"},{"en":"My mom will have a conniption if I come home after midnight.","zh":"如果我半夜才回家，我妈肯定会气炸。"}]}],"synonyms":["fit","tantrum","outburst","meltdown","hissy fit"],"phonetic":"/kəˈnɪpʃən/","extraExplanation":["“Conniption”主要是美式口语，用来夸张地形容“气到失控/吓到抓狂”，语气常偏戏谑，不如“rage/anger”正式。","常见搭配：have a conniption（大发雷霆/情绪崩溃）、throw a conniption（更强调“发作”）。","词源不太确定，普遍认为属于19世纪美国英语中的俚语/幽默造词，并非来自一个明确的拉丁或法语词根。"]}
{"word":"conniptions","summary":{"en":"Conniptions means sudden strong upset—especially anger or panic—often said in a humorous, informal way.","zh":"Conniptions 指突然的强烈情绪失控（尤其是暴怒或恐慌），常用于幽默、非正式语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sudden fit of anger, panic, or strong upset (often used humorously or informally)","zh":"（常为幽默或口语用法）突然的暴怒、恐慌或强烈的情绪失控"},"examples":[{"en":"My mom will have conniptions if she sees this mess.","zh":"我妈要是看到这么乱，肯定会气炸。"},{"en":"He had conniptions when he realized he’d lost his passport.","zh":"他发现护照丢了时，顿时慌得不行。"},{"en":"Don’t get conniptions—there’s still plenty of time.","zh":"别急得不行——时间还很充足。"}]}],"synonyms":["fit","tantrum","meltdown","panic","hissy fit"],"phonetic":"/kəˈnɪpʃənz/","extraExplanation":["“have conniptions”是最常见的搭配，语气多为夸张、带点调侃，表示“气坏了/急坏了”。在正式写作中不太常用，更常见于口语、轻松的文章或对话。","词源上它看起来像医学词（与“seizure/抽搐”之类相关），但现代英语里主要是非正式表达，用来形容情绪上的“发作”，不一定真有身体抽搐。"]}
{"word":"connivance","summary":{"en":"Connivance means secretly allowing wrongdoing or secretly cooperating in a dishonest plan.","zh":"connivance 指对不当行为的暗中纵容，或对不正当计划的暗中合谋。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Secret approval of something wrong or illegal; turning a blind eye so it can happen.","zh":"对不正当或违法之事的暗中默许；装作没看见，让事情发生。"},"examples":[{"en":"The fraud continued for years with the connivance of a few managers.","zh":"这场诈骗在几个经理的暗中默许下持续了多年。"},{"en":"No policy can work if there is connivance at the top.","zh":"如果高层暗中纵容，再好的政策也无法奏效。"}]},{"partOfSpeech":"n.","definition":{"en":"Secret cooperation in a plan, often dishonest; collusion.","zh":"暗中合谋、暗中串通（通常带有不诚实或不正当的意味）。"},"examples":[{"en":"Investigators looked for evidence of connivance between the bidder and the official.","zh":"调查人员寻找投标人和官员之间暗中串通的证据。"},{"en":"Their connivance helped them avoid responsibility.","zh":"他们的暗中合谋让他们得以逃避责任。"}]}],"synonyms":["complicity","collusion","tacit approval","cooperation","conspiracy"],"phonetic":"/kəˈnaɪvəns/","extraExplanation":["词源上与拉丁语“眨眼/闭眼”（connivere）有关，因此常用来表达“睁一只眼闭一只眼”的纵容含义。","语体偏正式、常见于新闻、法律或道德批评语境中；比“approval（赞同）”更强调不光彩与隐秘性。"]}
{"word":"connivances","summary":{"en":"Connivances means secret cooperation or tacit approval—often letting wrongdoing happen; less commonly, secret plots.","zh":"connivances 指暗中配合或默许纵容（常让不当行为发生）；较少见时也指合谋的阴谋。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Secret cooperation or indirect help, often for something wrong or unfair; turning a blind eye and letting it happen.","zh":"暗中纵容或默许（常指对不正当、不公平之事）；睁一只眼闭一只眼。"},"examples":[{"en":"The illegal sales continued with the connivances of a few officials.","zh":"非法交易在少数官员的暗中纵容下继续进行。"},{"en":"Without his connivance, the cheating scheme would have failed.","zh":"没有他的暗中配合，这个作弊计划就会失败。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) Secret plots or schemes carried out together with others.","zh":"（较少见）合谋、暗中策划的阴谋或诡计。"},"examples":[{"en":"The report described a network of connivances to hide the truth.","zh":"报告描述了一个合谋隐瞒真相的网络。"}]}],"synonyms":["collusion","complicity","tacit approval","tolerance","turning a blind eye"],"phonetic":"/kəˈnaɪvəns/","extraExplanation":["“connivances”是名词复数，单数形式是“connivance”。常用于正式或新闻语体，带有明显的负面评价，强调“默许/纵容”或“暗中配合”。","词源上来自拉丁语词根，含义接近“闭上眼睛”，所以常与“turn a blind eye”在意义上相近，但“connivance”更正式、更强调与他人暗中配合或对错误行为的放任。"]}
{"word":"connivancy","summary":{"en":"Connivancy means secret cooperation or tacit permission in wrongdoing.","zh":"Connivancy 指对不当行为的暗中勾结或默许纵容。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"secret cooperation in doing something wrong, illegal, or dishonest; a willingness to overlook wrongdoing","zh":"（对不正当/违法/不诚实行为的）暗中勾结；纵容、默许（对错误行为睁一只眼闭一只眼）"},"examples":[{"en":"The investigation suggested connivancy between the contractor and the inspector.","zh":"调查显示承包商与检查员之间可能存在暗中勾结。"},{"en":"The fraud continued for years with the connivancy of a few insiders.","zh":"这起欺诈在少数内部人员的纵容下持续了多年。"}]}],"synonyms":["collusion","complicity","conspiracy","tacit approval"],"phonetic":"/kəˈnaɪvənsi/","extraExplanation":["词源提示：connivancy 来自拉丁语词根，原意与“眨眼、假装没看见”有关，所以它常带有“明知不对却装作不知道”的意味。","常见搭配：with the connivancy of…（在……的纵容/默许下）；connivancy between A and B（A与B的勾结）。语气偏正式，常用于法律、新闻、政治语境。"]}
{"word":"connivant","summary":{"en":"Connivant describes someone who secretly cooperates with wrongdoing or knowingly allows it.","zh":"connivant指对不当行为暗中勾结或明知却默许纵容的人/态度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"secretly cooperating with someone’s wrongdoing; seeming to allow something wrong to happen (often for personal benefit).","zh":"（对不当行为）暗中勾结的；纵容默许的（常为谋取私利）。"},"examples":[{"en":"The reporter accused the officials of being connivant in the corruption scandal.","zh":"记者指责官员在腐败丑闻中暗中勾结。"},{"en":"Some neighbors felt the manager was connivant, turning a blind eye to the illegal parties.","zh":"一些邻居觉得管理员是在纵容，对非法派对睁一只眼闭一只眼。"}]}],"synonyms":["complicit","collusive","conniving","in cahoots","underhanded"],"phonetic":"/kəˈnaɪvənt/","extraExplanation":["“connivant”多用于较正式的语境（新闻、法律、文学评论），语气偏负面，强调“明知不对仍暗中配合或放任”。","词根与“connive”相关：connive意为“纵容/暗中共谋”。搭配常见：be connivant in/with（在……中共谋/纵容）。","近义词细微区别：complicit更强调“共犯/参与”；collusive强调“串通”；lenient只是“宽容”，不一定包含暗中配合的意味。"]}
{"word":"connivantly","summary":{"en":"Connivantly means “in a secret, dishonest way” or “by quietly allowing wrongdoing.”","zh":"connivantly 表示“暗中算计地”或“对不当行为暗中默许/纵容地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a secretive and dishonest way, especially to gain an advantage","zh":"以暗中算计、（多指不诚实地）谋取私利的方式"},"examples":[{"en":"He smiled connivantly, as if he knew something he wasn’t telling us.","zh":"他露出一抹狡黠的笑，好像知道些什么却不肯说。"},{"en":"They spoke connivantly in the corner, planning how to avoid responsibility.","zh":"他们在角落里鬼鬼祟祟地低声交谈，盘算着如何逃避责任。"}]},{"partOfSpeech":"adv.","definition":{"en":"in secret agreement with someone, especially by quietly allowing something wrong to happen","zh":"暗中默许地；与人暗中勾结地（尤指对不当之事睁一只眼闭一只眼）"},"examples":[{"en":"The manager watched connivantly while the rules were broken.","zh":"经理暗中默许地看着规章被人破坏。"},{"en":"Some officials acted connivantly, letting the corruption continue.","zh":"一些官员暗中包庇，让腐败持续下去。"}]}],"synonyms":["connivingly","deviously","schemingly","underhandedly","covertly"],"phonetic":"/kəˈnaɪv(ə)ntli/","extraExplanation":["“connivantly”较少见，更常用的是“connivingly”。两者意思相同。","相关常用搭配是“connive at + 名词/动名词”，意思是“对……睁一只眼闭一只眼；纵容”。例如：The school should not connive at cheating.（学校不应纵容作弊。）","词源上，“connive”原有“闭眼、假装没看见”的含义，因此后来引申出“默许、纵容（尤其是不正当行为）”。"]}
{"word":"connive","summary":{"en":"“Connive” means to secretly allow wrongdoing or to plot together in a dishonest way.","zh":"“Connive”指暗中纵容不当行为，或与他人勾结密谋。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to secretly allow something wrong or illegal to happen; to cooperate quietly (often by pretending not to notice)","zh":"（常指假装没看见）暗中纵容；默许（不当或违法的事）"},"examples":[{"en":"The officials were accused of conniving at corruption.","zh":"这些官员被指控暗中纵容腐败。"},{"en":"She refused to connive in the plan to cheat customers.","zh":"她拒绝参与并默许那个欺骗顾客的计划。"}]},{"partOfSpeech":"v.","definition":{"en":"to plot or scheme in secret; to work together in a dishonest way","zh":"密谋；暗中策划（通常带有不诚实的意味）"},"examples":[{"en":"A small group connived to remove their rival from power.","zh":"一小群人密谋把对手赶下台。"},{"en":"They connived with others to manipulate the results.","zh":"他们与他人勾结操纵结果。"}]}],"synonyms":["collude","conspire","abet","be complicit","turn a blind eye"],"phonetic":"/kəˈnaɪv/","extraExplanation":["“connive”语气较强，常带有道德批评：不是单纯“同意”，而是“明知不对却放任/配合”。常见搭配：connive at（对…视而不见、纵容），connive with（与…勾结）。","词源上与“wink/close one’s eyes（眨眼/闭眼）”的意象有关，因此常用于“装作没看到”的纵容语境。"]}
{"word":"connived","summary":{"en":"“Connived” means secretly allowing wrongdoing (often “connived at”) or scheming dishonestly.","zh":"“connived”表示暗中纵容不当/违法行为（常用 connive at），或不正当地密谋策划。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(usually with “at”) to secretly allow something wrong or illegal to happen, often by pretending not to notice; to tacitly cooperate","zh":"（常与 at 连用）对错误或违法之事装作没看见而默许；暗中纵容/串通"},"examples":[{"en":"The manager connived at the cheating because it improved the team’s results.","zh":"经理为了让团队成绩更好，对作弊行为睁一只眼闭一只眼。"},{"en":"Several officials connived at the illegal payments.","zh":"几名官员对非法付款行为暗中纵容/串通。"}]},{"partOfSpeech":"v.","definition":{"en":"to plan or scheme (especially something dishonest)","zh":"（尤指不正当的）密谋；策划"},"examples":[{"en":"They connived to remove their rival from power.","zh":"他们密谋把对手赶下台。"},{"en":"She realized she had been connived against by people she trusted.","zh":"她意识到自己被信任的人暗中算计了。"}]}],"synonyms":["colluded","conspired","schemed","plotted","winked at","tolerated"],"phonetic":"/kəˈnaɪvd/","extraExplanation":["“connived”是动词 connive 的过去式/过去分词。语气通常偏负面，常见结构是 connive at + 名词（对某事纵容），或 connive to do / connive with sb（与某人共谋）。","在新闻、法律或正式写作中很常见，强调“明知不对却放任/暗中配合”，比 “ignore” 更强、更带道德批评。"]}
{"word":"connivence","summary":{"en":"“Connivence” usually means (and is often spelled “connivance”) secret cooperation or tacit permission for wrongdoing.","zh":"“connivence”（常写作 connivance）指对不当行为的暗中勾结或默许纵容。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly spelled “connivance”) secret cooperation in something dishonest or illegal; being involved by helping, encouraging, or quietly allowing it.","zh":"（常拼作 connivance）暗中勾结；对不诚实或违法之事的默许、纵容（通过协助、鼓励或睁一只眼闭一只眼来参与）。"},"examples":[{"en":"The fraud continued for years with the connivance of a few insiders.","zh":"在少数内部人员的暗中纵容下，这起诈骗持续了多年。"},{"en":"The manager denied any connivance in the bribery scheme.","zh":"经理否认自己与这起行贿计划有任何勾结。"},{"en":"Her silence was seen as connivance, not neutrality.","zh":"她的沉默被视为纵容，而不是中立。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) a willingness to look away and not stop bad behavior; tacit permission.","zh":"（较不常见）对不良行为的放任；默认许可（明知却不制止）。"},"examples":[{"en":"There was an air of connivence whenever he bullied new staff.","zh":"每当他欺负新员工时，周围总有一种默许纵容的氛围。"},{"en":"Rules mean little if enforced with connivence.","zh":"如果执法充满放任，规则就意义不大。"}]}],"synonyms":["connivance","collusion","complicity","tacit approval","acquiescence"],"phonetic":"/kəˈnaɪvəns/","extraExplanation":["“connivence”在现代英语里更常被当作拼写错误；标准拼写通常是 connivance。两者都来自拉丁语词根，核心含义是“假装没看见/闭一只眼”，所以常带有道德上的负面评价。","搭配常见：with the connivance of sb（在某人的纵容/默许下）；deny connivance（否认勾结/纵容）。","与 convenience（便利）完全不同：convenience 是“方便”，而 connivance/connivence 是“纵容、勾结”。"]}
{"word":"connivent","summary":{"en":"Connivent means secretly allowing or cooperating with wrongdoing, often by pretending not to notice; it can also describe a ‘knowing’ look.","zh":"connivent 指对不当行为暗中纵容/默许（假装没看见而放任），也可形容带越界意味的“心照不宣”的表情或态度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Willing to let something wrong, dishonest, or illegal happen, often by pretending not to notice; secretly cooperating.","zh":"（对不正当/违法之事）纵容的；默许的；（假装没看见以便）暗中配合的。"},"examples":[{"en":"The manager was connivent in the fraud and ignored obvious warning signs.","zh":"经理对这起诈骗案纵容默许，还无视明显的警示迹象。"},{"en":"Some officials were accused of being connivent with organized crime.","zh":"一些官员被指控与有组织犯罪暗中勾结。"}]},{"partOfSpeech":"adj.","definition":{"en":"Showing a quiet, shared understanding—often about doing something that breaks rules (a “knowing” look or attitude).","zh":"（常含越界意味的）心照不宣的；会意的（表情/态度）。"},"examples":[{"en":"She gave him a connivent smile, and they slipped out early.","zh":"她给了他一个会意的微笑，两人便提前溜走了。"},{"en":"There was a connivent glance between the students during the test.","zh":"考试时学生之间交换了一个心照不宣的眼神。"}]}],"synonyms":["complicit","acquiescent","collusive","in cahoots (with)","tacit"],"phonetic":"/kəˈnaɪvənt/","extraExplanation":["这个词比较正式，常见于新闻、法律或文学语境，带明显的负面评价，暗示“明知不对却默认/配合”。","词源来自拉丁语，核心意思是“闭上眼睛”，所以常与“假装没看见”“纵容”联系在一起。","常见搭配：connivent in (a crime/fraud)（在某罪行中暗中纵容/参与）；connivent with (someone)（与某人暗中勾结）。近义词：complicit, acquiescent, collusive；反义词：vigilant, strict, outspoken."]}
{"word":"connivently","summary":{"en":"Conveniently means ‘in a convenient/easy way’ or ‘at a suitable (sometimes suspiciously perfect) time.’","zh":"Conveniently 表示“方便地/便利地”，也可表示“在合适的（有时带点‘恰好得可疑’的）时间/地点”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that is easy, useful, or does not cause problems; in a convenient way","zh":"方便地；便利地（以容易、有用或不麻烦的方式）"},"examples":[{"en":"You can conveniently pay online or by card in the store.","zh":"你可以方便地在线支付，或在店里刷卡。"},{"en":"The hotel is conveniently located near the subway station.","zh":"这家酒店位置很方便，靠近地铁站。"}]},{"partOfSpeech":"adv.","definition":{"en":"at a suitable time, place, or moment (sometimes implying something happens “at just the right time”)","zh":"在合适的时间/地点；恰好（有时暗含“正好赶上”的感觉）"},"examples":[{"en":"She conveniently forgot to mention the extra fee.","zh":"她“恰好”忘了提那笔额外费用。"},{"en":"A taxi arrived conveniently just as it started raining.","zh":"刚开始下雨，一辆出租车就恰好来了。"}]}],"synonyms":["handily","easily","readily","at a convenient time","at the right time"],"phonetic":"/kənˈviːniəntli/","extraExplanation":["你输入的 **connivently** 通常是拼写错误，最常见想表达的是 **conveniently**（方便地）。","注意：如果你想表达“狡猾地/暗中纵容地”，可能是在找 **connivingly**（与 connive 有关），但它远不如 conveniently 常用。"]}
{"word":"conniver","summary":{"en":"Conniver means a scheming person who secretly helps with a dishonest plan; it can also be the verb “to connive” (to conspire).","zh":"conniver 指暗中参与不正当计划的共谋者；也可对应动词 connive，表示“暗中共谋”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who secretly helps to plan or carry out something dishonest or harmful; a schemer.","zh":"暗中合谋做坏事的人；阴谋家。"},"examples":[{"en":"The detective believed the thief had a conniver inside the company.","zh":"侦探认为小偷在公司里有个内应（合谋者）。"},{"en":"She refused to be a conniver in their plan to cheat customers.","zh":"她拒绝当他们欺骗顾客计划的共谋者。"}]},{"partOfSpeech":"v.","definition":{"en":"To secretly plan with someone, especially to do something dishonest; to conspire.","zh":"暗中策划（尤指不正当之事）；共谋。"},"examples":[{"en":"They connived to hide the money from the authorities.","zh":"他们共谋把钱藏起来，躲过当局的调查。"},{"en":"He connived with a coworker to falsify the report.","zh":"他与同事串通伪造报告。"}]}],"synonyms":["schemer","plotter","conspirator","accomplice"],"phonetic":"/kəˈnaɪvər/","extraExplanation":["“conniver / connive”常带强烈负面含义，强调“暗中、偷偷地”参与不正当计划；比“plan”更隐秘，比“cooperate”更不光明。","在新闻、法律或悬疑小说里很常见：例如“a conniver in a fraud（诈骗案的共谋者）”。相关搭配：connive at（对不当行为装作没看见、纵容）——如“The manager connived at the cheating.”（经理对作弊行为睁一只眼闭一只眼）。"]}
{"word":"connivers","summary":{"en":"“Connivers” means people who secretly scheme (and less commonly, people who quietly tolerate wrongdoing).","zh":"“connivers”指暗中策划的人（较少见也可指对不当行为默许纵容的人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who secretly plan something dishonest or unfair; schemers","zh":"暗中策划不诚实或不公平事情的人；阴谋家；策划者"},"examples":[{"en":"The police believed the connivers were working together to fake the documents.","zh":"警方认为这些阴谋者在合谋伪造文件。"},{"en":"In the novel, a few connivers manipulate the election from behind the scenes.","zh":"在小说里，少数阴谋家在幕后操纵选举。"}]},{"partOfSpeech":"n.","definition":{"en":"people who quietly allow something wrong to happen (less common)","zh":"对错误或不当行为选择默许的人（较少见）"},"examples":[{"en":"He criticized the connivers who stayed silent while the rules were broken.","zh":"他批评那些在规则被破坏时保持沉默、选择默许的人。"}]}],"synonyms":["schemers","plotters","intriguers","conspirators"],"phonetic":"/kəˈnaɪvɚz/","extraExplanation":["“connivers”是“conniver”的复数。它来自动词“connive”，原意有“装作没看见、纵容（常指不当行为）”，后来更常用来指“暗中合谋、密谋”。因此“conniver”既可以指“阴谋策划者”，也可以（较少见）指“默许纵容者”。","语气与使用场景：conniver通常带强烈负面含义，常出现在新闻、法律语境或悬疑/政治题材的写作中。日常口语里更常用schemer（阴谋家）或plotter（密谋者）。"]}
{"word":"connivery","summary":{"en":"Connivery is an uncommon word meaning secret cooperation or quiet tolerance of wrongdoing.","zh":"Connivery 是较少见的词，指对不当行为的暗中纵容或同谋。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"secret cooperation in wrongdoing; the act of quietly allowing something dishonest or illegal to happen","zh":"（对不当或非法行为的）暗中纵容；同谋；包庇"},"examples":[{"en":"The fraud continued for years with the connivery of several employees.","zh":"这场诈骗能持续多年，离不开几名员工的暗中包庇。"},{"en":"Her success came from talent, not connivery.","zh":"她的成功来自才能，而不是暗箱操作。"}]},{"partOfSpeech":"n.","definition":{"en":"a secret plot or scheme; underhand dealing (less common)","zh":"（不常用）阴谋；暗中策划；鬼鬼祟祟的勾当"},"examples":[{"en":"The novel is full of court connivery and betrayal.","zh":"这部小说充满了宫廷阴谋与背叛。"}]}],"synonyms":["connivance","collusion","complicity","conspiracy"],"phonetic":"/kəˈnaɪvəri/","extraExplanation":["“connivery”在现代英语里很少见，更多时候会用“connivance”（纵容/默许）或“collusion”（串通）来表达类似意思。","它和动词“connive”有关：connive at sth 表示“对某事装作没看见、默许其发生”，常用于负面语境。"]}
{"word":"connives","summary":{"en":"“Connives” means secretly cooperating in wrongdoing or deliberately allowing wrongdoing to happen.","zh":"“connives”表示暗中同谋做坏事，或故意纵容不当行为发生。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to secretly cooperate in something wrong or dishonest; to be involved in a scheme","zh":"（暗中）同谋；串通做坏事"},"examples":[{"en":"The officials connived with the contractor to hide the extra costs.","zh":"官员和承包商暗中串通，掩盖额外费用。"},{"en":"He connives at tax fraud by helping people create fake receipts.","zh":"他通过帮人伪造收据，在逃税欺诈中同谋。"}]},{"partOfSpeech":"vi.","definition":{"en":"to deliberately ignore or allow something wrong to happen (often used with “connive at”)","zh":"（故意）纵容；默许（常与 connive at 连用）"},"examples":[{"en":"The manager connived at the bullying because the bully got results.","zh":"经理因为霸凌者“有业绩”，就故意纵容欺凌。"},{"en":"Parents should not connive at cheating, even if the child is under pressure.","zh":"父母不应纵容作弊，即使孩子压力很大。"},{"en":"The school was accused of conniving at the cover-up.","zh":"学校被指责默许掩盖真相的行为。"}]}],"synonyms":["collude","conspire","scheme","plot","be complicit","turn a blind eye"],"phonetic":"/kəˈnaɪvz/","extraExplanation":["“connive”语气通常偏负面，带有“明知不对却暗中配合/默许”的道德判断；比“ignore/overlook（没注意或不小心放过）”更强调“故意”。","常见搭配：connive at + 不当行为（connive at corruption / connive at cheating）。也可说 connive with + 人（与某人串通）。","词源来自拉丁语，原意与“眨眼/使眼色”相关，因此带出“暗中示意、心照不宣地配合”的感觉。"]}
{"word":"conniving","summary":{"en":"Conniving describes someone who secretly plans or secretly permits dishonest wrongdoing.","zh":"conniving 指暗中策划或暗中纵容不诚实/不法之事，带强烈贬义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Secretly planning to do something dishonest or unfair in order to get what you want; scheming.","zh":"暗中策划（常指不诚实或不公平）以达到目的；阴谋的、狡诈的。"},"examples":[{"en":"Some employees felt the manager was conniving and only cared about personal gain.","zh":"一些员工觉得那位经理很阴险，只在乎个人利益。"},{"en":"He gave a conniving smile, as if he had already planned the whole trick.","zh":"他露出一抹狡黠的笑，仿佛早就把整套把戏计划好了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Secretly allowing something wrong or illegal to happen; cooperating with wrongdoing (often followed by “in” or “with”).","zh":"暗中纵容/默许不当或违法之事；与不法行为暗中串通（常与 in / with 连用）。"},"examples":[{"en":"The official was accused of conniving in the fraud.","zh":"那名官员被指控暗中纵容这起欺诈。"},{"en":"They were charged with conniving with smugglers.","zh":"他们被控与走私者暗中勾结。"}]}],"synonyms":["scheming","devious","sly","underhanded","plotting"],"phonetic":"/kəˈnaɪvɪŋ/","extraExplanation":["“conniving”来自动词 connive，常见搭配是：connive at（对……装作没看见、默认）、connive in（参与、纵容）、connive with（与……勾结）。","语气通常明显负面，常用来描述“暗地里盘算/纵容”的人或行为；与 scheming（阴谋的）、devious（狡猾的）意思接近。"]}
{"word":"connivingly","summary":{"en":"“Connivingly” means “in a secret, dishonest, scheming way.”","zh":"“connivingly”意为“暗中不诚实、阴谋算计地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a secretly dishonest or scheming way, often to get an advantage.","zh":"以暗中不诚实、阴谋算计的方式（常为获取利益或占便宜）。"},"examples":[{"en":"He smiled connivingly as the others argued.","zh":"当其他人争吵时，他阴险地笑着。"},{"en":"She spoke connivingly, trying to turn the team against their leader.","zh":"她说话带着挑拨算计，想让团队反对他们的领导。"}]}],"synonyms":["schemingly","cunningly","slyly","deviously"],"phonetic":"/kəˈnaɪvɪŋli/","extraExplanation":["“connivingly”来自动词“connive”（默许/纵容；暗中图谋、共谋）。在现代英语里，这个副词多用来形容一种“暗中使坏、耍手段”的语气或神态，带有明显负面评价。","常见搭配：smile/look connivingly（阴险地笑/看）、speak connivingly（带着算计地说）。","近义词细微区别：cunningly（狡猾地，可能偏“聪明计谋”不一定邪恶）；slyly（狡黠地、偷偷摸摸地，语气有时较轻）；schemingly（策划阴谋地，更强调“计划”。）"]}
{"word":"connixation","summary":{"en":"Connixation is a very rare/obsolete word meaning “connection; a linking together.”","zh":"Connixation 是一个非常罕见/旧用的词，意思是“连接；联结；关联”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/obsolete) a connection or linking together; the state of being connected.","zh":"（罕见/旧用）连接；联结；相互关联的状态。"},"examples":[{"en":"In modern English, people usually write “connection,” not “connixation.”","zh":"在现代英语里，人们通常写“connection”，而不是“connixation”。"},{"en":"The essay discussed the connixation between language and culture.","zh":"这篇文章讨论了语言与文化之间的关联。"}]}],"synonyms":["connection","link","association","relation","tie","bond"],"phonetic":"/ˌkɑːnɛkˈseɪʃən/","extraExplanation":["“connixation”非常少见，多见于旧文本或非标准拼写；在日常写作与考试中建议使用标准形式 **connection**（或英式较旧拼写 **connexion**）。","它来自表示“连接/系在一起”的拉丁语词根 *nect-*（如 *connect*）。因此含义与 **connection / linking** 基本一致。"]}
{"word":"Connochaetes","summary":{"en":"Connochaetes is the scientific genus name for wildebeests (gnus).","zh":"Connochaetes 是角马（牛羚）的角马属学名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific genus name for wildebeests (gnus), large African antelopes.","zh":"角马属（学名），指角马/牛羚这一类生活在非洲的大型羚羊。"},"examples":[{"en":"In the Serengeti, Connochaetes migrate in huge herds each year.","zh":"在塞伦盖蒂，角马属动物每年都会以巨大的族群迁徙。"},{"en":"The genus Connochaetes includes the blue wildebeest and the black wildebeest.","zh":"角马属包括蓝角马和黑角马。"}]}],"synonyms":["wildebeest","gnu"],"phonetic":"/ˌkɑnəˈkiːtiz/","extraExplanation":["“Connochaetes”是生物学里的拉丁化学名，日常英语更常说“wildebeest”或“gnu”。","词源来自希腊语词根，表示“胡须（或鬃毛）”与“毛发”，用来描写角马颈部与下颌处较明显的毛。","在英文自然纪录片、动物学论文、博物馆说明牌中更常见；普通对话里用它可能显得很学术。"]}
{"word":"connochaetes","summary":{"en":"Connochaetes is the scientific genus name for wildebeests.","zh":"Connochaetes 是“角马”的科学属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific genus name for the wildebeests (large African antelopes), including the blue wildebeest and the black wildebeest","zh":"角马属（角马的科学属名），指非洲的大型羚羊类动物，包括蓝角马与黑角马"},"examples":[{"en":"Connochaetes is the genus that includes the blue wildebeest.","zh":"Connochaetes 是包含蓝角马的那个属。"},{"en":"In East Africa, Connochaetes gnu are famous for their long migrations.","zh":"在东非，角马（Connochaetes gnu）以长距离迁徙而闻名。"}]}],"synonyms":["wildebeest","gnu"],"phonetic":"/ˌkɑnəˈkiːtiːz/","extraExplanation":["这是拉丁化的学名（科学分类用语）。在日常英语里，人们通常说 wildebeest（角马），而不是用 Connochaetes。","词源来自希腊语成分：konnos（“胡须”之意）+ chaite（“鬃毛/毛发”），用来描述角马头颈部的毛发特征。"]}
{"word":"connoissance","summary":{"en":"Connoissance is a rare, old-fashioned noun meaning knowledge or familiarity (acquaintance).","zh":"connoissance 是一个罕见的古体名词，表示“知识/熟悉（相识、熟知）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/archaic) Knowledge or familiarity with something; acquaintance (often used in the phrase “a person of connoissance”).","zh":"（罕见/古体）对某事的了解或熟悉；相识、熟知（常见于短语“a person of connoissance”，指“有见识的人”）。"},"examples":[{"en":"He was described as a man of connoissance in art and literature.","zh":"他被形容为在艺术与文学方面很有见识的人。"},{"en":"Her connoissance of local customs helped her avoid mistakes.","zh":"她对当地风俗的熟悉帮助她避免了失礼。"}]}],"synonyms":["knowledge","familiarity","expertise","acquaintance"],"phonetic":"/ˌkɑːnəˈsɑːns/","extraExplanation":["“connoissance”在现代英语里非常少见，多被视为“connaissance”的旧拼法/变体；当代写作更常用：knowledge（知识）、familiarity（熟悉）、expertise（专长）、acquaintance（认识/相识）。","注意不要和“reconnaissance /ˌrɛkəˈnɑːsəns/（侦察）”混淆；两者拼写相近，但含义与使用场景不同。"]}
{"word":"connoisseur","summary":{"en":"A connoisseur is an expert who can recognize and judge quality, especially in food, wine, or the arts.","zh":"connoisseur 指能辨识并评判品质的行家/鉴赏家，尤用于美食、葡萄酒或艺术领域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who knows a lot about a particular subject (especially food, wine, art, or music) and can judge its quality.","zh":"行家；鉴赏家（尤指懂得品鉴食物、葡萄酒、艺术或音乐并能判断品质的人）。"},"examples":[{"en":"She’s a connoisseur of Italian wine and can explain the differences between regions.","zh":"她是意大利葡萄酒的鉴赏家，能解释不同产区的差别。"},{"en":"Even as a beginner, you can learn to appreciate coffee like a connoisseur.","zh":"即使是初学者，你也可以学习像行家一样欣赏咖啡。"},{"en":"The museum tour is designed for both casual visitors and art connoisseurs.","zh":"这场博物馆导览既适合普通观众，也适合艺术鉴赏家。"}]}],"synonyms":["expert","specialist","aficionado","enthusiast","critic"],"phonetic":"/ˌkɑnəˈsɝ/","extraExplanation":["词源来自法语 connoisseur，源于 connaître（“了解、认识”）。因此 connoisseur 的核心不是“收藏很多”，而是“懂得鉴别好坏”。","常见搭配：a connoisseur of wine/coffee/art/music；也常与品评动词连用，如 judge, appreciate, savor（更偏“品味、细细享受”）。","语气提示：connoisseur 往往带有“有品味、很专业”的正面含义；但在某些语境中也可能带一点“讲究、挑剔”的味道，需看上下文。"]}
{"word":"connoisseurs","summary":{"en":"Connoisseurs are people with refined knowledge and taste who can judge quality in a specific area (often art, food, or wine).","zh":"connoisseurs 指某领域的鉴赏家/行家，具有品味与经验，能判断品质（常用于艺术、食物、葡萄酒等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who know a lot about a particular subject (especially art, food, wine, music, etc.) and can judge its quality.","zh":"（某领域的）鉴赏家；行家（尤指艺术、食物、葡萄酒、音乐等，能品评优劣的人）。"},"examples":[{"en":"Wine connoisseurs can often identify the region just by the aroma.","zh":"葡萄酒鉴赏家常常只凭香气就能判断产区。"},{"en":"She’s a connoisseur of modern art and visits galleries every weekend.","zh":"她是现代艺术的行家，每个周末都去逛画廊。"}]},{"partOfSpeech":"n.","definition":{"en":"(Sometimes used humorously) Someone who strongly appreciates a particular kind of experience or thing.","zh":"（有时带幽默感）“很懂/很爱某类东西的人”，强调特别会享受或很有品味。"},"examples":[{"en":"He’s a connoisseur of cheap street tacos.","zh":"他可是便宜街头塔可的“资深爱好者/行家”。"},{"en":"I’m a connoisseur of long naps on rainy days.","zh":"我最懂得在雨天睡长觉的快乐。"}]}],"synonyms":["experts","specialists","aficionados","gourmets"],"phonetic":"/ˌkɑnəˈsɝz/","extraExplanation":["“Connoisseur”来自法语 connoisseur，和动词 “know/recognize（懂得/识别）”有关，常用于强调“能分辨品质、懂门道”的品味与经验。","常见搭配：a connoisseur of + 名词（a connoisseur of coffee/art/jazz）。复数是 connoisseurs。","相关词：expert（专家，偏专业能力）、aficionado（狂热爱好者，偏热爱）、gourmet（美食家，偏食物/烹饪）。"]}
{"word":"connoisseurship","summary":{"en":"Connoisseurship means expert, refined judgment—especially in art, wine, and other things people ‘appreciate’ in a skilled way.","zh":"Connoisseurship 指对艺术、葡萄酒等可供“鉴赏”的事物所具备的专业、精细的判断力与鉴别能力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Expert knowledge and refined judgment about art, food, wine, music, or other things, often shown through careful tasting, viewing, or comparison.","zh":"（对艺术、食物、葡萄酒、音乐等的）鉴赏力；行家眼光与专业判断，常通过细致品尝、观看或比较表现出来。"},"examples":[{"en":"Her connoisseurship of wine helped the restaurant build a stronger menu.","zh":"她对葡萄酒的鉴赏力帮助餐厅打造了更出色的酒单。"},{"en":"The museum values connoisseurship when identifying the true artist of a painting.","zh":"博物馆在鉴定一幅画的真实作者时很重视鉴赏学的判断。"}]}],"synonyms":["expertise","discerning taste","critical judgment","appreciation"],"phonetic":"/ˌkɑnəˈsɝʃɪp/","extraExplanation":["“Connoisseurship”来自“connoisseur（鉴赏家、行家）+ -ship（表示身份、性质、技能的名词后缀）”。它常用于艺术史、古董鉴定、葡萄酒与美食评论等语境，强调通过经验与训练形成的“懂行的判断力”。","语感上，“connoisseurship”比“taste（品味）”更专业、更学术；也比“expertise（专长）”更突出“鉴赏/辨识真伪与优劣”的能力。"]}
{"word":"Connolly","summary":{"en":"Connolly is usually an Irish-origin surname, and less commonly a first name.","zh":"Connolly 通常是一个源自爱尔兰的姓氏，也较少用作名字。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a surname (family name), most commonly Irish in origin.","zh":"一个姓氏（家族姓），最常见为爱尔兰起源。"},"examples":[{"en":"James Connolly was an important figure in Irish history.","zh":"詹姆斯·康诺利是爱尔兰历史上的重要人物。"},{"en":"Ms. Connolly will lead today’s meeting.","zh":"康诺利女士将主持今天的会议。"}]},{"partOfSpeech":"other","definition":{"en":"a given name (first name), used less commonly.","zh":"一个名字（名），使用频率相对较低。"},"examples":[{"en":"Connolly is his first name, not his last name.","zh":"Connolly 是他的名，不是姓。"}]}],"phonetic":"/ˈkɑnəli/","extraExplanation":["“Connolly”常被认为来自爱尔兰盖尔语姓氏体系，常见拼法还有 Connolly / Connelly 等，不同拼法往往与家族分支或地区习惯有关。","历史上较有名的同名人物包括爱尔兰工运与独立运动领袖 James Connolly；在阅读历史或新闻文本时，看到 Connolly 往往指具体人物的姓。"]}
{"word":"Connor","summary":{"en":"Connor is most commonly used as a male first name, and it can also be a surname.","zh":"Connor 最常见的是男性名字（名），也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (first name), common in English-speaking countries","zh":"男性名字（名），在英语国家中较常见"},"examples":[{"en":"Connor is my classmate in English class.","zh":"Connor 是我英语课的同学。"},{"en":"Connor said he would call me after work.","zh":"Connor 说他下班后会给我打电话。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname)","zh":"姓氏"},"examples":[{"en":"Dr. Connor will see you at 2 p.m.","zh":"Connor 医生会在下午两点见你。"},{"en":"Her last name is Connor.","zh":"她的姓是 Connor。"}]}],"synonyms":["Conor","Conner"],"phonetic":"/ˈkɑnɚ/","extraExplanation":["“Connor”常被认为源自爱尔兰/盖尔语传统名字，常见写法还有“Conor”。","一些词源解释认为它来自古爱尔兰语（如 Conchobhar），常被解释为与“猎犬/狼”等意象相关（不同资料说法略有差异）。","在正式书写中，姓名首字母需要大写：Connor；在点名或表格里常见格式如“Connor, James”（姓在前）。"]}
{"word":"Connors","summary":{"en":"Connors is most commonly a surname (last name). Less commonly, it can mean more than one person named Connor.","zh":"Connors 最常见是姓氏（英文的“康纳斯”）。较少见时也可表示多个叫 Connor 的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname); a person whose last name is Connors.","zh":"姓氏；“Connors”这个姓的人。"},"examples":[{"en":"Dr. Connors will see you now.","zh":"康纳斯医生现在要见你了。"},{"en":"My neighbor, Ms. Connors, is a teacher.","zh":"我的邻居康纳斯女士是一名老师。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) the plural form of Connor (a given name), meaning several people named Connor.","zh":"（较少见）Connor 的复数形式，指好几个叫 Connor 的人。"},"examples":[{"en":"There are two Connors in my class, so we use their last names.","zh":"我班里有两个叫 Connor 的同学，所以我们用他们的姓来区分。"}]}],"synonyms":["(surname) O'Connor","Connor"],"phonetic":"/ˈkɑnɚz/","extraExplanation":["“Connors”多见于英语国家的姓氏，常被认为与爱尔兰/盖尔语姓氏有关，和名字/姓氏“Connor”“O’Connor”有渊源。不同家族的拼写与来源可能不完全相同。","在流行文化里，“Connors”也可能指作品中的人物姓氏（例如电视剧/电影角色），具体含义要看上下文。"]}
{"word":"connotate","summary":{"en":"Connotate means to suggest extra meanings or feelings beyond a word’s literal meaning.","zh":"Connotate 指词语除字面义外，还会暗示或引发额外的含义与情感联想。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to suggest or imply an additional meaning or feeling beyond the basic, literal meaning of a word or phrase","zh":"（词语）除字面意思外，还暗示或引申出额外的含义、情感或联想"},"examples":[{"en":"The word “home” can connotate warmth and safety, not just a place to live.","zh":"“home”这个词不仅指居住的地方，还可能暗示温暖与安全感。"},{"en":"In some contexts, “cheap” connotates low quality.","zh":"在某些语境中，“cheap”会让人联想到质量低。"},{"en":"The color white may connotate purity in some cultures.","zh":"在一些文化中，白色可能象征（暗示）纯洁。"}]}],"synonyms":["imply","suggest","evoke","carry (connotations)","hint"],"phonetic":"/ˈkɑnəˌteɪt/","extraExplanation":["“connotate”常见于语言学与写作分析中，强调“联想义/隐含义”。日常写作里更常用形容词“connotative”（如：connotative meaning）或动词短语“have/ carry connotations”（如：The word carries negative connotations）。","对比：denote = “字面指称”；connotate = “引发联想/暗示的情感或附加意义”。例如“childlike”常带正面联想（天真），而“childish”常带负面联想（幼稚）。"]}
{"word":"connotation","summary":{"en":"Connotation is the implied meaning or emotional feeling a word or symbol suggests beyond its literal definition.","zh":"Connotation指词语或符号在字面意义之外所暗示的情感色彩与联想意义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An implied or suggested meaning or feeling that a word carries in addition to its basic dictionary meaning (denotation).","zh":"（词语的）内涵意义；联想意义（除字面/本义之外带来的暗示、情感或态度）"},"examples":[{"en":"The word “slim” has a positive connotation, but “skinny” can sound negative.","zh":"“slim”通常带有积极的内涵，而“skinny”可能听起来偏负面。"},{"en":"In marketing, companies choose brand names with warm, friendly connotations.","zh":"在营销中，公司会选择带有温暖、友好联想的品牌名。"}]},{"partOfSpeech":"n.","definition":{"en":"A secondary idea or association linked to something (not only a word), often shaping how people interpret it.","zh":"（不仅限于词语的）附带联想；引申含义（影响人们理解的次要关联）"},"examples":[{"en":"For some people, the color white has religious connotations.","zh":"对一些人来说，白色带有宗教方面的联想。"},{"en":"The phrase had political connotations that made the audience uneasy.","zh":"这句话带有政治联想，让听众感到不安。"}]}],"synonyms":["implication","association","undertone","suggestion"],"phonetic":"/ˌkɑnəˈteɪʃən/","extraExplanation":["“connotation”常与“denotation（外延/字面意义）”对比：denotation是词典里最直接的意思；connotation是情感色彩、态度、文化联想。","同一个概念在不同文化中可能有不同connotation。例如“ambitious”在职场语境里多为褒义（有上进心），但在某些语境里也可能被理解为“野心勃勃”（略贬）。","常见搭配：positive/negative connotation（褒义/贬义内涵），carry a connotation（带有……含义），have connotations of…（让人联想到……）。"]}
{"word":"connotational","summary":{"en":"Connotational describes the implied emotional or cultural associations of a word, beyond its literal meaning.","zh":"connotational 指词语的“内涵/联想意义”，强调字面意思之外的情感或文化暗示。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to the feelings, associations, or implied meanings that a word suggests beyond its literal (dictionary) meaning.","zh":"与“内涵意义/联想意义”有关的；指一个词除了字面（词典）意思之外所引发的情感、联想或暗示。"},"examples":[{"en":"The word “slim” is connotationally more positive than “skinny,” even though both can mean “thin.”","zh":"虽然“slim”和“skinny”都可能表示“瘦”，但从内涵意义上说，“slim”的褒义更强。"},{"en":"In advertising, writers choose connotational language to make a product feel trustworthy or exciting.","zh":"在广告中，写作者会选择带有内涵色彩的措辞，让产品显得更可信或更令人兴奋。"}]}],"synonyms":["associative","suggestive","implied"],"phonetic":"/ˌkɑnəˈteɪʃənəl/","extraExplanation":["“connotational”来自“connotation”（内涵/联想意义）。学习时常与“denotational / denotation”（外延/字面意义）对比：denotation讲“字面指什么”，connotation讲“让人感觉像什么”。","它常用于写作与语言分析（如文学、新闻、广告、演讲）：同义词之间的“褒贬/语气/文化联想”差异，通常就是connotational差异。"]}
{"word":"connotations","summary":{"en":"Connotations are the extra feelings, associations, or implied meanings a word or expression carries beyond its literal meaning.","zh":"Connotations 指词语或表达在字面义之外所带来的联想、情感色彩或隐含意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An idea, feeling, or association that a word suggests in addition to its basic (dictionary) meaning.","zh":"（词语除字面/词典义之外）所带来的联想、暗示或情感色彩。"},"examples":[{"en":"The word “home” has warm connotations for many people.","zh":"对很多人来说，“home（家）”带有温暖的联想。"},{"en":"Although “slim” and “skinny” both mean “thin,” their connotations are different.","zh":"虽然“slim”和“skinny”都表示“瘦”，但它们的褒贬色彩不同。"}]},{"partOfSpeech":"n.","definition":{"en":"The implied meaning or tone of something (such as a phrase, a gesture, or an action).","zh":"（短语、手势、行为等的）言外之意、隐含意味或语气。"},"examples":[{"en":"His comment had negative connotations, even if he didn’t mean to insult anyone.","zh":"他的话带有负面意味，即使他并不想侮辱任何人。"},{"en":"In that context, the joke took on political connotations.","zh":"在那个语境里，这个玩笑带上了政治意味。"}]}],"synonyms":["associations","implications","overtones","undertones","suggestions"],"phonetic":"/ˌkɑnəˈteɪʃənz/","extraExplanation":["“connotation”常与“denotation（字面义/本义）”对比：denotation是词典里直接指向的意思；connotation是由文化、语境、个人经验带来的情感或价值判断。","学习写作或口语表达时，注意同义词的connotations：比如“childlike（天真可爱）”通常偏褒义，而“childish（幼稚）”常偏贬义。","“connotation(s)”在学术写作、媒体分析、文学评论中很常见，用来讨论语言如何“暗示”态度与立场。"]}
{"word":"connotative","summary":{"en":"Connotative describes the emotional or implied associations a word or expression carries beyond its literal meaning.","zh":"connotative 指词语或表达在字面意义之外所包含的情感色彩、联想或暗示。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the feelings, associations, or implied meanings a word carries beyond its basic dictionary meaning.","zh":"（词语）与“内涵意义/联想意义”有关的；指一个词除基本字面义之外所带来的情感色彩、联想或暗示。"},"examples":[{"en":"The word “home” has strong connotative meaning because it suggests warmth and safety.","zh":"“home（家）”这个词有很强的内涵意义，因为它让人联想到温暖和安全。"},{"en":"In advertising, writers choose connotative words to create a positive image.","zh":"在广告中，文案会选择带有积极内涵的词来塑造正面形象。"}]},{"partOfSpeech":"adj.","definition":{"en":"Suggesting or implying something (often used when describing language, tone, or symbolism).","zh":"（多用于描述语言、语气或象征）带有暗示意味的；能引发特定联想的。"},"examples":[{"en":"Her connotative tone made it sound like a warning, not a suggestion.","zh":"她带有暗示意味的语气让这听起来像警告，而不是建议。"},{"en":"The poem uses connotative images to hint at loneliness.","zh":"这首诗用带有暗示性的意象来暗示孤独。"}]}],"synonyms":["associative","suggestive","implied","evocative"],"phonetic":"/kəˈnɑtəˌtɪv/","extraExplanation":["“connotative”来自“connotation（内涵、联想）”。常与“denotative（外延的、字面意义的）”对比：denotation=字典里的直接含义；connotation=情感色彩与社会文化联想。","学习时可用“同义词但内涵不同”的例子：slim（褒义：苗条） vs. skinny（贬义：瘦得不健康）；childlike（褒义：天真） vs. childish（贬义：幼稚）。"]}
{"word":"connotatively","summary":{"en":"“Connotatively” means “in a way that implies extra feelings or associations beyond the literal meaning.”","zh":"“connotatively”表示“从内涵/联想意义上来说”，强调超出字面意思的情感或暗示。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that suggests additional feelings, associations, or implied meanings beyond the literal meaning of a word.","zh":"以“内涵意义/联想意义”的方式；指一个词除了字面意思外还暗示的情感、态度或联想。"},"examples":[{"en":"The word “childlike” is connotatively positive, but “childish” is often negative.","zh":"“childlike（像孩子般天真）”在内涵上偏正面，但“childish（幼稚）”常带负面含义。"},{"en":"He connotatively praised her by calling her “resourceful,” implying admiration.","zh":"他称她“resourceful（足智多谋）”，在内涵上是在赞美她，暗示钦佩。"},{"en":"That phrase is connotatively political, even if it sounds neutral on the surface.","zh":"这个说法即使表面中性，内涵上也带有政治意味。"}]}],"synonyms":["by implication","implicitly","suggestively"],"phonetic":"/kəˈnɑtəˌtɪvli/","extraExplanation":["“connotatively”来自“connotation（内涵/联想）”。学习时常与“denotatively（按字面意义）”对比：denotation是词典里的直接意义，connotation是人们因文化、语境、情感而产生的“额外感觉”。","很多词的“内涵”会因文化和时代变化而不同。例如同义词在字面相近，但内涵可能更正式、更粗鲁、更亲密或带偏见；写作和口语中选择词语时，常要考虑connotatively是否合适。"]}
{"word":"connote","summary":{"en":"“Connote” means to imply an extra idea or emotion beyond a word’s literal meaning.","zh":"“connote”指一个词在字面意义之外还“暗示/带有”某种联想意义或情感色彩。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to suggest or imply an idea or feeling in addition to a word’s basic, literal meaning","zh":"（除字面意思外）暗示、意味着（某种想法或情感）；含有……的含义"},"examples":[{"en":"The word “home” connotes warmth and safety, not just a building.","zh":"“home”这个词不仅指一栋房子，还暗示温暖和安全感。"},{"en":"In English, “slim” often connotes something positive, while “skinny” can sound negative.","zh":"在英语里，“slim”常带褒义，而“skinny”可能听起来带贬义。"},{"en":"Her smile connoted confidence.","zh":"她的微笑透露出自信。"}]}],"synonyms":["imply","suggest","indicate","hint at","carry (a meaning)"],"phonetic":"/kəˈnoʊt/","extraExplanation":["“connote”常和“denote”对比：denote 指“字面意义/指称什么”，connote 指“联想意义/隐含什么”。例如：\"childlike\" 通常含褒义（天真可爱），\"childish\" 常含贬义（幼稚）。","写作与阅读里常说“positive/negative connotations（褒义/贬义联想）”。理解词的 connotation 能帮助你把语气拿捏得更自然、更礼貌。"]}
{"word":"connoted","summary":{"en":"“Connoted” means “implied or suggested extra meaning beyond the literal sense.”","zh":"“connoted”意为“暗示/带有字面之外的含义或情感联想”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"Past tense / past participle of “connote”: to suggest or imply an additional meaning, feeling, or idea beyond the literal meaning of a word, phrase, or action.","zh":"“connote”的过去式/过去分词：指（词语、短语或行为）除了字面意思之外，还“暗示/带有”额外的含义、情感或联想。"},"examples":[{"en":"The word “cheap” often connoted low quality, even when the price was simply affordable.","zh":"“cheap”这个词常常暗示质量低，即使它只是表示“价格实惠”。"},{"en":"In that era, wearing black connoted mourning.","zh":"在那个时代，穿黑色往往暗示在哀悼。"},{"en":"His smile connoted confidence rather than friendliness.","zh":"他的微笑暗示的是自信，而不一定是友好。"}]}],"synonyms":["implied","suggested","carried (a meaning)","evoked","signaled"],"phonetic":"/kəˈnoʊtɪd/","extraExplanation":["“connote”常与“denote”对比：denote 指“字面指称/本义”，connote 指“隐含意义/情感色彩/联想”。例如：home denotes “a place to live”（住处），but connotes “warmth, safety, family”（温暖、安全、家庭感）。","语境里常见搭配：a word/term connotes…, the color/gesture connoted…；在学术写作或文本分析（文学、媒体、修辞）中非常常用。"]}
{"word":"connotes","summary":{"en":"“Connotes” means “suggests an additional meaning or feeling beyond the literal meaning.”","zh":"“Connotes”表示“除字面意思外，还暗示/隐含额外含义或情感色彩”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(of a word, phrase, image, or action) to suggest or imply an additional meaning or feeling beyond the literal meaning.","zh":"（词语、短语、图像或行为）除字面意思外，还“暗示/隐含”某种额外的意义或情感。"},"examples":[{"en":"The word “home” connotes warmth and safety for many people.","zh":"对很多人来说，“home（家）”这个词暗示着温暖和安全感。"},{"en":"In English, “slim” often connotes something positive, while “skinny” can sound negative.","zh":"在英语里，“slim（苗条）”常带褒义暗示，而“skinny（瘦得皮包骨）”可能带贬义感觉。"},{"en":"Her silence connotes disagreement, even though she didn’t say no.","zh":"她的沉默暗示着不同意，尽管她没有说“不”。"}]},{"partOfSpeech":"vt.","definition":{"en":"to have an associated idea or emotional tone (used mainly in discussions of language and style).","zh":"（多用于语言与文体讨论）具有某种联想义或情感色彩。"},"examples":[{"en":"That phrase connotes old-fashioned manners.","zh":"那个短语带有“老派礼仪”的联想色彩。"},{"en":"The color white connotes purity in many Western cultures.","zh":"在许多西方文化中，白色常联想到纯洁。"}]}],"synonyms":["implies","suggests","indicates","evokes","signals","carries (the idea of)"],"phonetic":"kəˈnoʊts","extraExplanation":["“connote（暗示/隐含）”常与“denote（指称/字面意思）”对比：denote讲“它字面上是什么”，connote讲“它让人联想到什么、带什么情绪色彩”。例如：rose denotes一种花；rose can connote love/romance（爱情/浪漫）。","你输入的“connotes”是动词第三人称单数：He/She/It connotes ...；原形是 connote。"]}
{"word":"connoting","summary":{"en":"“Connoting” means suggesting an extra meaning or feeling beyond the literal one.","zh":"“connoting”指“暗示/带有言外之意或情感联想”，超出字面意思。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"suggesting an additional idea, feeling, or association beyond the literal meaning of a word or thing","zh":"（词语或事物）除了字面意思之外，还“暗示/带有”某种额外的含义、情感或联想"},"examples":[{"en":"The word “home” is connoting warmth and safety, not just a building.","zh":"“home”这个词在暗示温暖与安全，而不只是“一栋房子”。"},{"en":"In the ad, the color gold is connoting luxury and success.","zh":"在广告里，金色在暗示奢华与成功。"},{"en":"Her tone was connoting annoyance even though her words were polite.","zh":"尽管她说话很客气，但她的语气在暗示不耐烦。"}]}],"synonyms":["implying","suggesting","hinting at","carrying (an idea)","evoking"],"phonetic":"/kəˈnoʊtɪŋ/","extraExplanation":["“connoting”是动词 connote 的现在分词/进行时形式。常见搭配：A is connoting B（A暗示B）；be connoting…（带有…意味）。","学习时可以和 denote 对比：denote 指“字面/直接所指”，connote 指“言外之意/情感色彩/文化联想”。比如 slim（苗条）常褒义，skinny（瘦得皮包骨）常带贬义——这就是不同的 connotation。"]}
{"word":"connotive","summary":{"en":"Connotive describes a word or expression that suggests extra feelings or associations beyond its literal meaning.","zh":"connotive 指词语除了字面义，还会暗示额外的情感或联想意义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Carrying an implied meaning, feeling, or association in addition to the basic (dictionary) meaning.","zh":"（除基本字面义外）还带有暗示的含义、情感或联想的；含有“言外之意”的。"},"examples":[{"en":"The word “cheap” can sound connotive, suggesting low quality, not just low price.","zh":"“cheap”这个词常带有联想意义，可能暗示“质量差”，而不只是“价格低”。"},{"en":"Try to choose neutral, less connotive words in formal writing.","zh":"在正式写作中尽量选择更中性、联想色彩更少的词。"}]}],"synonyms":["suggestive","implied","associative","evocative"],"phonetic":"/kəˈnoʊ.t̬ə.t̬ɪv/","extraExplanation":["“connotive”来自“connotation”（内涵、联想义）。语言学习里常用来对比：denotative（外延/字面义） vs. connotive（内涵/联想义）。例如“childlike”（偏正面：天真）和“childish”（偏负面：幼稚）字面都跟“孩子”有关，但connotation不同。","这个词在学术写作、语言学、批评性阅读里很常见，用来提醒你：词语不只“是什么意思”，还可能“让人感觉什么”。"]}
{"word":"connotively","summary":{"en":"Connotively means “in a way that carries implied meanings or emotional associations beyond the literal meaning.”","zh":"connotively 指“从言外之意/联想含义上来说”，强调超出字面意义的情感或暗示。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that suggests extra ideas or feelings beyond the literal meaning (through connotation).","zh":"以“带有言外之意/联想含义”的方式；不仅是字面意思，还暗示额外的情感或评价。"},"examples":[{"en":"The word “childish” is connotively negative, even if it literally relates to a child.","zh":"“childish”这个词在联想含义上偏负面，尽管字面上与“孩子”有关。"},{"en":"She chose her words carefully, knowing they could be understood connotively.","zh":"她很谨慎地选词，因为她知道这些话可能会被从言外之意来理解。"}]}],"synonyms":["implicitly","suggestively","by implication","associatively"],"phonetic":"/kəˈnoʊt̬ətɪvli/","extraExplanation":["“connotively”来自 connotation（联想意义、含蓄意义），常用于语言学、写作与批评中，用来区分 denotatively（字面意义上）与 connotively（联想意义上）。","常见搭配：connotively positive/negative（联想上偏褒/偏贬）；understand/read something connotively（从言外之意理解/解读）。"]}
{"word":"conns","summary":{"en":"“Conns” is most often an informal short form of “connections,” especially in tech; it can also mean plural “conn” (a scam) or the verb form meaning to steer/direct a ship.","zh":"“conns”最常见是“connections（连接）”的非正式缩写（技术语境常用）；也可指 conn 的复数（骗局/骗子），或作动词表示“指挥/操纵船只航行”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"informal: connections (especially internet/network connections)","zh":"非正式：连接；网络连接（尤指网络/互联网连接数）"},"examples":[{"en":"The server can handle 10,000 conns at once.","zh":"这台服务器一次可以处理一万个连接。"},{"en":"We’re seeing more conns from mobile devices today.","zh":"今天我们看到来自移动设备的连接更多。"}]},{"partOfSpeech":"n.","definition":{"en":"plural of conn: a scam or a person who tricks others (a confidence trick/artist)","zh":"conn 的复数：骗局；骗子（通过取得信任来行骗的人）"},"examples":[{"en":"Old conns often rely on gaining your trust first.","zh":"老练的骗局往往先设法获取你的信任。"}]},{"partOfSpeech":"v.","definition":{"en":"third-person singular of conn: to direct or steer a ship (naval use)","zh":"conn 的第三人称单数：指挥/操纵船只航行（航海用语）"},"examples":[{"en":"The officer conns the ship through the narrow channel.","zh":"军官指挥船只通过狭窄航道。"}]}],"synonyms":["connections","links","sessions","scams","cons"],"phonetic":"/kɑnz/","extraExplanation":["“conns”常见于技术/日志/聊天中的缩写，尤其指“connections（连接数）”。在正式写作里通常写全称“connections”。","航海用语里，to conn（有时写作 con）指“指挥舵手/导航”，意思接近“to direct/steer”。","表示“骗局/骗子”的 conn 来自“confidence（信任）”相关用法：confidence trick（骗局）、con artist（骗子）。"]}
{"word":"connu","summary":{"en":"“Connu” is a French word meaning “known / familiar,” and it is also the past participle of “connaître” (“to know; to be acquainted with”).","zh":"“connu”是法语词，意思是“已知的/熟悉的”，也可作为“connaître（认识；了解）”的过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(French) known; familiar; recognized (masculine singular form).","zh":"（法语）已知的；熟悉的；被认可的（阳性单数形式）。"},"examples":[{"en":"This fact is well known (bien connu) to historians.","zh":"这个事实对历史学家来说是众所周知的（bien connu）。"},{"en":"He is known for his kindness (connu pour sa gentillesse).","zh":"他因善良而出名/为人所知（connu pour sa gentillesse）。"}]},{"partOfSpeech":"other","definition":{"en":"(French grammar) past participle of the verb \"connaître\" (“to know; to be acquainted with”).","zh":"（法语语法）动词“connaître”（认识；了解）的过去分词。"},"examples":[{"en":"I have known her for years. (Je l’ai connue / Je l’ai connu.)","zh":"我认识她很多年了。（Je l’ai connue / Je l’ai connu.）"},{"en":"Have you ever known such a place? (As-tu connu un endroit pareil ?)","zh":"你曾经见识过/了解过这样的地方吗？（As-tu connu un endroit pareil ?）"}]}],"synonyms":["known","familiar","recognized","well-known"],"phonetic":"/kɔˈny/","extraExplanation":["“connu”常见于法语中，表示“（某人/某事）为人所知”。它是阳性单数；如果主语是女性用“connue”，复数为“connus/connues”。","在法语里，“connaître”多指“认识某人、了解某事物（通过经验/接触）”；而“savoir”更偏“知道一个事实/信息”。例如：Je connais Paris.（我熟悉巴黎。） vs Je sais où c’est.（我知道它在哪里。）"]}
{"word":"connubial","summary":{"en":"“Connubial” is a formal adjective meaning “connected with marriage or the relationship between spouses.”","zh":"“connubial”是较正式的形容词，意思是“与婚姻有关的；与夫妻关系相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to marriage; referring to a husband and wife relationship.","zh":"与婚姻有关的；指夫妻关系的。"},"examples":[{"en":"They enjoyed a quiet connubial life in the countryside.","zh":"他们在乡下过着安静的夫妻生活。"},{"en":"The novel explores connubial love and loyalty.","zh":"这部小说探讨了婚姻中的爱情与忠诚。"}]}],"synonyms":["marital","wedded","spousal","nuptial"],"phonetic":"/kəˈnuːbiəl/","extraExplanation":["“connubial”比较正式，常见于文学、法律或较书面的语境。日常口语里更常用“marital”或“wedded”。","词源来自拉丁语“connubialis”（与婚姻有关），与“nuptial”（婚礼/婚姻的）同属较正式的近义表达。"]}
{"word":"connubialism","summary":{"en":"Connubialism means marriage or married life (rare usage).","zh":"connubialism 指“婚姻；婚后生活”，属于较少见的用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or practice of being married; married life (a rare word).","zh":"婚姻状态；已婚生活（较少见的词）。"},"examples":[{"en":"In the novel, he fled connubialism and chose a wandering life instead.","zh":"在小说里，他逃避婚姻生活，转而选择漂泊的日子。"},{"en":"They spoke of connubialism as a partnership built on trust.","zh":"他们把婚姻生活谈成一种建立在信任上的伙伴关系。"}]}],"synonyms":["marriage","married life","matrimony","wedlock"],"phonetic":"/kəˈnuːbiəlɪzəm/","extraExplanation":["这个词很少在日常英语里使用，更常见的表达是 marriage、married life、matrimony。","词根来自拉丁语 connubium（合法婚姻、结婚权利），其中 con- 表示“共同”，nub- 与“结婚/婚礼”相关（可联想 nuptial = 婚礼的）。在写作中用它会显得偏文学或古风。"]}
{"word":"connubiality","summary":{"en":"Connubiality means the state of being married, and more rarely, married sexual relations; it is formal/literary.","zh":"connubiality 指“婚姻状态/婚姻生活”，较少情况下也指“夫妻性关系”，语体偏正式或文学化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or quality of being married; the condition of marriage, especially in a formal or literary way.","zh":"婚姻状态；已婚的性质（多为正式或文学用语）。"},"examples":[{"en":"The novel explores love, duty, and the pressures of connubiality.","zh":"这部小说探讨了爱情、责任以及婚姻生活带来的压力。"},{"en":"They spoke openly about the challenges of connubiality after moving abroad.","zh":"他们坦诚谈到移居国外后婚姻生活的挑战。"}]},{"partOfSpeech":"n.","definition":{"en":"Sexual relations between married partners (a formal, less common meaning).","zh":"夫妻之间的性关系（较少见、偏正式的含义）。"},"examples":[{"en":"The article used old-fashioned language to discuss connubiality and family life.","zh":"那篇文章用比较老派的措辞来讨论夫妻生活与家庭生活。"}]}],"synonyms":["marriage","married life","matrimony","wedlock","conjugal life"],"phonetic":"/kəˌnuːbiˈæləti/","extraExplanation":["“connubiality”语体偏正式，日常英语更常说 marriage / married life（婚姻/婚姻生活）或 relationship（关系）。","词源来自拉丁语 connubium（合法婚姻），常见相关形容词是 connubial（婚姻的；夫妻的），例如 connubial bliss（婚后幸福）。"]}
{"word":"connubially","summary":{"en":"Connubially means “in a marital way; as husband and wife,” and it is formal and uncommon in everyday speech.","zh":"connubially 表示“在婚姻/夫妻关系上；以夫妻身份”，语气正式，日常使用不多。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to marriage; as a married couple.","zh":"以婚姻的方式；以夫妻关系的方式；在婚姻关系上。"},"examples":[{"en":"They were connubially united for over thirty years.","zh":"他们以夫妻身份结合了三十多年。"},{"en":"The novel follows two people who grow closer, first emotionally and then connubially.","zh":"这部小说描写两个人先在情感上走近，之后再进入婚姻。"}]}],"synonyms":["matrimonially","maritally","conjugally","as husband and wife"],"phonetic":"/kəˈnuːbiəli/","extraExplanation":["“connubially”是较正式、较少见的副词，常出现在文学、法律或学术语境中，用来强调“与婚姻/夫妻关系有关”，日常英语更常说“as husband and wife / in marriage / matrimonially”。","词根来自拉丁语：con-（一起）+ nub-（与“新娘/结婚”相关）。因此它带有“结合为婚”的含义，语气偏书面。"]}
{"word":"connubiate","summary":{"en":"Connubiate is a rare verb meaning “to marry” or “to unite closely as if by marriage.”","zh":"Connubiate 是个罕用动词，意思是“结婚/联姻”，也可引申为“像联姻一样紧密结合”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare) To marry; to join in marriage.","zh":"（罕用）结婚；成婚。"},"examples":[{"en":"In older writing, two families might be said to connubiate to strengthen an alliance.","zh":"在较早的写法中，可能会说两个家族“connubiate（联姻）”以巩固同盟。"},{"en":"The novel describes nobles who connubiate for political reasons rather than love.","zh":"小说描写贵族因政治原因而非爱情而“connubiate（联姻/结婚）”。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare) To unite closely, as if by marriage; to form a close partnership.","zh":"（罕用）紧密结合；如同联姻般结成密切关系。"},"examples":[{"en":"The author says tradition and modernity can connubiate in a healthy society.","zh":"作者说，在健康的社会中，传统与现代可以“connubiate（相融/紧密结合）”。"}]}],"synonyms":["marry","wed","intermarry","unite","join"],"phonetic":"/kəˈnuːbiˌeɪt/","extraExplanation":["“connubiate”非常少见，更常见的说法是“marry”（结婚）或“intermarry”（通婚/联姻）。在正式或文学语境里，有时会用“connubial”（婚姻的；夫妻的）或名词“connubium/connubium”（古典/法律语境中指合法婚姻权或婚姻关系）。","词源来自拉丁语“connubium”，意为“婚姻、结婚的权利”。因此它常带一点“联姻、结盟”的味道，而不只是日常口语中的“结婚”。"]}
{"word":"connubium","summary":{"en":"Connubium is a formal word for marriage, and in Roman law it means the legal right to marry.","zh":"connubium 是一个正式用语，指“婚姻”；在罗马法中也指“通婚权”（合法结婚的权利）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Formal) Marriage; the state or bond of being married.","zh":"（正式/文雅）婚姻；婚姻关系（婚配的结合）。"},"examples":[{"en":"In the novel, the king’s connubium is presented as a political alliance, not a love match.","zh":"在小说中，国王的婚姻被描写成政治联盟，而不是爱情结合。"},{"en":"They spoke of connubium as a sacred bond that joined two families.","zh":"他们谈到婚姻是一种神圣的纽带，把两个家族联结在一起。"}]},{"partOfSpeech":"n.","definition":{"en":"(Roman law, historical) The legal right to marry—especially the right to contract a lawful Roman marriage between certain groups.","zh":"（历史/罗马法）通婚权：在特定群体之间缔结合法罗马婚姻的法律资格/权利。"},"examples":[{"en":"Some allied communities were granted connubium with Roman citizens.","zh":"一些同盟城邦被授予与罗马公民的通婚权。"},{"en":"Without connubium, a couple’s union might not be recognized as a lawful Roman marriage.","zh":"没有通婚权，这对伴侣的结合可能不被承认为合法的罗马婚姻。"}]}],"synonyms":["marriage","matrimony","wedlock"],"phonetic":"/kəˈnuːbiəm/","extraExplanation":["“connubium”源自拉丁语，常见于历史、法律或文学语境；日常英语里更常用“marriage”或“matrimony”。","在罗马法语境中，它不仅指“结婚”这件事，更强调“法律上有资格结婚”的权利（例如不同城邦、身份阶层之间是否允许合法通婚）。"]}
{"word":"connumerate","summary":{"en":"Connumerate means to count or list things together, or to include something among a numbered group (rare and formal).","zh":"connumerate 指“把事物一起计数/列举”或“把……算作某个编号群体的一员”，属于罕见且正式的用词。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to count or list items together; to include something as part of a numbered group (a rare, formal word).","zh":"把……一起计数/列举；把……算作某个编号群体的一部分（罕见、较正式用词）。"},"examples":[{"en":"The editor connumerated the missing pages with the rest of the chapter notes.","zh":"编辑把缺失的页码与该章其余注释一起编号/列出。"},{"en":"In the report, these small costs are connumerated with the main expenses.","zh":"在报告中，这些小额费用也被算作主要支出的一部分。"}]}],"synonyms":["enumerate","count","list","include","number among"],"phonetic":"/kəˈnuːməˌreɪt/","extraExplanation":["这个词非常少见，现代英语里更常用 count, enumerate, list, include (as), number among 等表达。","词源可理解为 con-（一起）+ numerate（计数/编号），因此有“合并计数/共同编号”的意思。拼写上偶见 connumerate / connumerate 两种写法，但都属冷僻用词。"]}
{"word":"connumeration","summary":{"en":"Connumeration is a rare noun meaning a combined counting or a combined list.","zh":"connumeration 是个很少见的名词，指“合并清点/合计”或“合并列举的清单”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) The act of counting or numbering together; a combined count.","zh":"（罕见）把事物一起计数、合并编号；合计。"},"examples":[{"en":"The clerk made a connumeration of the boxes and the crates before loading the truck.","zh":"装车前，文员把箱子和板条箱一起清点了一遍。"},{"en":"After a quick connumeration, we realized one book was missing.","zh":"快速清点后，我们发现少了一本书。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A combined list or enumeration.","zh":"（罕见）合并后的清单；合并列举。"},"examples":[{"en":"The report includes a connumeration of all costs, grouped by department.","zh":"报告包含一份合并列出的全部费用清单，并按部门分组。"}]}],"synonyms":["enumeration","count","counting","tally","reckoning"],"phonetic":"/kɑˌnuːməˈreɪʃən/","extraExplanation":["这个词在现代英语里非常少见，很多情况下会被当作拼写错误。写作或考试中更常用的是：\n- enumeration（列举；清点）\n- count / counting（计数）\n如果你本来想写的是 commemoration（纪念活动）或 conglomeration（聚集成团），告诉我具体语境我可以帮你确认。"]}
{"word":"connusable","summary":{"en":"Confusable means ‘easy to confuse with something else.’ It can also be a noun meaning a confusingly similar item (often used in fonts or cybersecurity).","zh":"Confusable 表示“容易与其他东西混淆的”。也可作名词，指“易混淆项”（常见于字体或网络安全语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Easily confused with something else because it looks, sounds, or is spelled similarly.","zh":"因为外形、读音或拼写相似而容易与其他事物混淆的。"},"examples":[{"en":"Some letters are confusable, like O and 0 in certain fonts.","zh":"有些字母很容易混淆，比如在某些字体里 O 和 0。"},{"en":"The two words are confusable in speech because they sound similar.","zh":"这两个词在口语中容易混淆，因为它们听起来很像。"}]},{"partOfSpeech":"n.","definition":{"en":"A word, character, or item that is likely to be mistaken for another.","zh":"（词、字符或物品）容易被误认为另一个的东西；易混淆项。"},"examples":[{"en":"In security, a ‘confusable’ can be used to trick readers into clicking a fake link.","zh":"在网络安全中，“易混淆字符”可能被用来欺骗读者点击假链接。"},{"en":"Teachers often point out common confusables for language learners.","zh":"老师常会指出语言学习者常见的易混淆项。"}]}],"synonyms":["easily confused","similar-looking","ambiguous","deceptive (in some contexts)"],"phonetic":"/kənˈfjuːzəbəl/","extraExplanation":["你写的“connusable”通常是拼写错误；更常见、标准的词是 **confusable**。","在网络安全里，confusable 常指“外观很像的字符”（如拉丁字母 a 和某些其他字母表中的类似字符），可能被用于伪装域名或账号名。"]}
{"word":"Conny","summary":{"en":"“Conny” is most commonly a personal name/nickname (often like “Connie”); in UK informal slang it can also mean “condom.”","zh":"“Conny”最常见是人名/昵称（类似更常见的拼写“Connie”）；在英国的非正式俚语中也可指“安全套”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A given name or nickname (usually for women), often short for Constance or sometimes used for Connor/Conrad; also a surname in some contexts.","zh":"人名/昵称（多用于女性），常为 Constance 的简称；有时也可用于 Connor/Conrad 等名字的昵称；在某些语境中也可作姓氏。"},"examples":[{"en":"Conny is short for Constance in her family.","zh":"在她家里，Conny 是 Constance 的简称。"},{"en":"I met Conny at a conference in New York.","zh":"我在纽约的一次会议上认识了 Conny。"}]},{"partOfSpeech":"n.","definition":{"en":"(British slang, informal) A condom.","zh":"（英式俚语，非正式）安全套。"},"examples":[{"en":"(UK informal) He forgot to bring a conny.","zh":"（英式非正式）他忘了带安全套。"}]}],"synonyms":["Connie","Constance (related name)","nickname (category)"],"phonetic":"/ˈkɑni/","extraExplanation":["“Conny”更常见的拼写是“Connie”。如果你指的是某个人的名字，两种拼写都可能出现，但“Connie”更普遍。","英式俚语义（指安全套）带有明显的口语/粗俗色彩，不适合正式场合；在美式英语中不常用。"]}
{"word":"conny","summary":{"en":"“Conny” is usually a personal name or nickname, short for several longer names depending on context.","zh":"“Conny”通常是人名或昵称，可能是多个较长名字的简称，需结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a given name or nickname (a short, friendly name), often for names like Connor, Conrad, Cornelia, or Constance, depending on the country and family.","zh":"人名或昵称（亲昵称呼），常见于 Connor、Conrad、Cornelia、Constance 等名字的简写或爱称；具体来源因地区与家庭而异。"},"examples":[{"en":"Conny is short for Cornelia in her family.","zh":"在她家里，Conny 是 Cornelia 的昵称。"},{"en":"Everyone calls him Conny at school, but his full name is Conrad.","zh":"在学校大家都叫他 Conny，但他的全名是 Conrad。"}]}],"synonyms":["nickname","short name"],"phonetic":"/ˈkɑni/","extraExplanation":["“Conny”更常见于口语或熟人之间的称呼，单独作为英文词汇（像普通名词/动词那样）并不常见。","不同语言和地区里，“Conny”可能对应不同全名：例如在德语环境中可作 Cornelia/Conrad 的昵称；在英语环境里也可能来自 Connor/Constance 等。","如果你是在某个句子或聊天里看到“conny”，也可能是人名、网名或拼写变体；给我上下文我可以帮你判断。"]}

