{"word":"conocarp","summary":{"en":"Conocarp is a tropical coastal tree/shrub (often Conocarpus) widely used for hedges and landscaping in warm climates.","zh":"conocarp 指一种热带海岸树/灌木（常指 *Conocarpus*），在温暖地区常用于绿篱与景观种植。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical coastal tree or shrub (often referring to the genus *Conocarpus*, especially *Conocarpus erectus*), commonly planted as an ornamental hedge or street tree in warm climates","zh":"一种热带海岸树木或灌木（常指“纽扣红树/海滨纽扣木”属 *Conocarpus*，尤其是 *Conocarpus erectus*），在温暖地区常用作绿篱或行道树"},"examples":[{"en":"Many parks in hot coastal cities plant conocarp as a windbreak and shade tree.","zh":"很多炎热的海滨城市会种植 conocarp 作为防风和遮荫树。"},{"en":"The gardener trimmed the conocarp hedge to keep it neat.","zh":"园丁修剪了 conocarp 绿篱，让它看起来整齐。"}]}],"synonyms":["Conocarpus","buttonwood","Conocarpus erectus"],"phonetic":"/ˈkoʊnoʊkɑrp/","extraExplanation":["“conocarp”常见于园林、苗木或口语中作为简称；在正式英文里更常写作属名 *Conocarpus*，或直接写具体物种名 *Conocarpus erectus*（英文常名：buttonwood）。","这种植物耐热、耐盐风，在一些中东与热带地区被大量用于道路绿化；不过也有人担心它在部分地区可能带来花粉/气味或生态适应性方面的争议，具体取决于当地环境与管理方式。"]}
{"word":"Conocarpus","summary":{"en":"Conocarpus is the scientific genus name for certain tropical coastal trees/shrubs, especially buttonwood.","zh":"Conocarpus 是热带海岸树木/灌木的植物属名，最常见代表是纽扣木（buttonwood）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical coastal trees and shrubs (mangrove associates), especially the buttonwood (Conocarpus erectus).","zh":"一种热带海岸树木或灌木的属名（常与红树林生态相关），其中最常见的是钮扣红树/纽扣木（Conocarpus erectus）。"},"examples":[{"en":"Buttonwood (Conocarpus erectus) is often planted in coastal landscapes because it tolerates salt spray.","zh":"纽扣木（Conocarpus erectus）常被种在海岸景观中，因为它耐盐雾。"},{"en":"The report lists Conocarpus among species used for shoreline stabilization.","zh":"报告将 Conocarpus 列为用于海岸线固沙护岸的树种之一。"}]}],"synonyms":["buttonwood (common name, esp. Conocarpus erectus)"],"phonetic":"/ˌkoʊnoʊˈkɑrpəs/","extraExplanation":["Conocarpus 是植物分类学中的“属”（genus）名，写作首字母大写、斜体（Conocarpus）；具体物种名需要加上种加词，如 *Conocarpus erectus*。日常英语里，人们更常用俗名 buttonwood（纽扣木）来指代最常见的那一种。","词源上可拆为希腊语元素：kōnos（“圆锥、球果状”）+ karpos（“果实”），与其果实形态有关。"]}
{"word":"conocarpus","summary":{"en":"Conocarpus is a genus of salt-tolerant coastal trees, especially the buttonwood.","zh":"Conocarpus 指一类耐盐的海岸树木属，最常指纽扣树（buttonwood）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of coastal trees and shrubs (family Combretaceae), best known for the buttonwood tree, often found in mangrove-edge or salty shoreline habitats.","zh":"海岸树木/灌木的一个属（使君子科），最有名的是“纽扣树”（buttonwood），常生长在红树林边缘或盐分较高的海岸环境。"},"examples":[{"en":"Conocarpus grows well in salty, windy coastal areas.","zh":"Conocarpus 在多盐、多风的海岸地区生长良好。"},{"en":"The landscaping plan includes Conocarpus as a drought-tolerant shade tree.","zh":"景观设计方案把 Conocarpus 作为耐旱的遮荫树种。"}]}],"synonyms":["buttonwood (common name for some species)"],"phonetic":"/ˌkoʊnoʊˈkɑrpəs/","extraExplanation":["Conocarpus 常见物种是 Conocarpus erectus（英文常叫 buttonwood）。它并不总是被归为“真正的红树林”，但常生长在红树林带的边缘地带，能耐盐、耐风、耐贫瘠土壤，因此在热带/亚热带沿海城市绿化中很常见。","在一些地区（如中东部分城市）Conocarpus 被大量种植作行道树；但如果种植密度高、修剪不当，可能出现过敏、落叶或维护成本等争议，具体取决于当地气候与管理方式。"]}
{"word":"Conocephalum","summary":{"en":"Conocephalum is the scientific name of a genus of liverworts that grow in damp, shady habitats.","zh":"Conocephalum 是一种苔类（地钱）植物属的学名，常见于阴湿环境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of liverworts (simple, flat, non-vascular plants) often found on damp soil or rocks; a common species is Conocephalum conicum.","zh":"一种地钱纲的苔类植物属（扁平、无维管束的植物），常见于潮湿的土壤或岩石上；常见种有圆头地钱（Conocephalum conicum）。"},"examples":[{"en":"Conocephalum often grows in shaded, moist places near streams.","zh":"Conocephalum 常生长在溪流附近阴凉潮湿的地方。"},{"en":"In our ecology lab, we observed Conocephalum thalli under a microscope.","zh":"在生态学实验课上，我们用显微镜观察了 Conocephalum 的叶状体。"}]}],"synonyms":["liverwort (general term)","Conocephalum conicum (a common species)"],"phonetic":"/ˌkoʊnoʊˈsɛfələm/","extraExplanation":["词源提示：Conocephalum 来自希腊语词根，含义接近“圆锥（cono-）+ 头（-cephal-）”，指其外形特征；这是拉丁化的学名，日常英语中多用于生物学/植物学语境。","学习提示：作为学名，通常首字母大写、斜体书写（Conocephalum）；若指某一物种则用二名法，如 *Conocephalum conicum*。"]}
{"word":"conocephalum","summary":{"en":"*Conocephalum* is a scientific genus name for certain liverworts that grow in moist places.","zh":"*Conocephalum* 是植物学上的属名，指一类常生于潮湿环境的地钱苔类植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of thalloid liverworts (a type of non-vascular plant), especially known from the species *Conocephalum conicum*, often found on damp rocks and streambanks","zh":"地钱苔属（苔类植物的一属，属不具维管束的植物），其中以*Conocephalum conicum*（常见于潮湿岩石与溪流岸边）最为人熟知"},"examples":[{"en":"We found *Conocephalum* growing in a thin, green sheet on wet stones near the waterfall.","zh":"我们在瀑布附近的湿石头上发现了成片薄薄的绿色地钱苔属植物。"},{"en":"In the lab, the sample was identified as *Conocephalum* based on its flat thallus and surface pattern.","zh":"在实验室里，研究者根据其扁平的叶状体和表面纹理把样本鉴定为地钱苔属。"}]}],"synonyms":["liverwort (general term)","thalloid liverwort (general category)"],"phonetic":"/ˌkoʊnoʊsəˈfiːləm/","extraExplanation":["这是一个拉丁化的科学属名，常用于植物学/生态学写作；日常英语里并不常见，多出现在野外记录、论文或标本标签中。","词源来自希腊语：*kōnos*（圆锥、锥体）+ *kephalē*（头），大意是“锥形的头部”，指其生殖结构外形。"]}
{"word":"Conocephalus","summary":{"en":"Conocephalus is the scientific genus name for certain katydids known as coneheads.","zh":"Conocephalus 是一类螽斯的属名，常见俗称为“锥头螽斯（coneheads）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of katydids (long-horned grasshoppers), often called “coneheads” because many species have a pointed, cone-shaped head","zh":"一种螽斯（长角蝗总科）属名，许多种因头部呈尖锥状而常被俗称为“锥头螽斯 / 锥头纺织娘（conehead）”"},"examples":[{"en":"Conocephalus species are common in grassy fields and wetlands.","zh":"Conocephalus 属的物种常见于草地和湿地。"},{"en":"The researcher recorded the mating calls of Conocephalus at night.","zh":"研究人员在夜间记录了 Conocephalus 的求偶鸣声。"}]}],"synonyms":["conehead","conehead katydid"],"phonetic":"/ˌkɑːnoʊˈsɛfələs/","extraExplanation":["词源：Conocephalus 来自希腊语词根：kōnos（锥体、圆锥）+ kephalē（头），字面意思是“锥形的头”，用来描述这类昆虫常见的尖锥状头部外形。","用法提示：这是生物学拉丁化的“属名”，英语写作中通常首字母大写并使用斜体（Conocephalus）。在口语或科普中更常用俗名 conehead / conehead katydid。"]}
{"word":"conocephalus","summary":{"en":"Conocephalus is a scientific genus name for conehead katydids—katydids known for their cone-shaped head.","zh":"Conocephalus 是“锥头螽”（一种螽斯/纺织娘类昆虫）的属名，常因其头部呈锥形而得名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific name used for certain insects, especially a genus of conehead katydids (bush-crickets) with a pointed, cone-shaped head","zh":"（生物学名）指某些昆虫的学名用法，尤指“锥头螽”（纺织娘/灌木蟋蟀的一类）的一个属名，其特征常是头部前端呈锥形突起"},"examples":[{"en":"The researcher identified the specimen as Conocephalus based on its cone-shaped head.","zh":"研究人员根据其锥形头部特征，将标本鉴定为 Conocephalus（锥头螽属）。"},{"en":"Some Conocephalus species are common in grassy fields and wetlands.","zh":"一些 Conocephalus（锥头螽属）的物种常见于草地和湿地。"}]}],"synonyms":["conehead katydid (common name)","conehead (informal common name)"],"phonetic":"/ˌkoʊnoʊˈsɛfələs/","extraExplanation":["词源：来自希腊语 konos（“圆锥”）+ kephalē（“头”），字面意思就是“锥形头”。","使用场景：多见于昆虫学、生态调查、物种名录等正式语境；日常英语里更常说 conehead katydid（锥头螽）或 conehead。","提示：作为属名（genus）时，通常首字母大写并用斜体书写：Conocephalus；谈论某个具体物种时常见写法如 Conocephalus sp.（未定种）或 Conocephalus discolor（举例）。"]}
{"word":"conoclinium","summary":{"en":"Conoclinium is a botanical genus name for mistflowers in the aster family.","zh":"Conoclinium 是菊科雾花（mistflower）的一类植物的属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering plants in the aster family (Asteraceae), commonly called mistflowers; some species (such as blue mistflower) are grown as garden ornamentals.","zh":"一种菊科（Asteraceae）开花植物的属，常被称为“雾花/雾花属”（mistflower）；其中一些种（如蓝雾花）常作观赏植物栽培。"},"examples":[{"en":"Blue mistflower belongs to the genus Conoclinium.","zh":"蓝雾花属于雾花属（Conoclinium）。"},{"en":"In late summer, Conoclinium attracts many butterflies with its soft, fluffy blooms.","zh":"在夏末，雾花属植物柔软绒状的花常吸引许多蝴蝶。"}]}],"synonyms":["mistflower (genus)"],"phonetic":"/ˌkɑːnəˈklaɪniəm/","extraExplanation":["这是一个植物学“属名”（genus name），在日常英语中并不常用；更常见的说法是用俗名 mistflower，或直接说某个具体物种名（例如 Conoclinium coelestinum，常见俗名 blue mistflower）。","词源上常被解释为来自希腊语成分：cono-（与“圆锥/锥形”有关）+ -clinium（与“床/斜躺”有关的词根），用来描述植物某些结构的形态特征；不过一般学习者无需死记词源，知道它是拉丁化的植物属名即可。"]}
{"word":"conocuneus","summary":{"en":"“Conocuneus” is not a standard English word; it is likely a misspelling of “cuneus” or “precuneus.”","zh":"“conocuneus”不是常见标准英语词；很可能是“cuneus”或“precuneus”的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in major dictionaries; it is likely a misspelling or a very specialized term. Many people who type this may mean “cuneus” (a wedge-shaped area, especially in anatomy) or “precuneus” (a brain region).","zh":"在主流英语词典中并非常见词；更可能是拼写错误或极小众的专业术语。很多人输入它可能想写的是“cuneus（楔叶/楔形部位，常见于解剖学）”或“precuneus（楔前叶，大脑区域）”。"},"examples":[{"en":"I can’t find “conocuneus” in a dictionary—did you mean “cuneus” or “precuneus”?","zh":"我在词典里找不到“conocuneus”——你是不是想写“cuneus”或“precuneus”？"},{"en":"If you share the sentence where you saw it, I can help identify the correct word.","zh":"如果你把它出现的句子发我，我可以帮你判断正确的词。"}]}],"synonyms":["cuneus","precuneus"],"phonetic":"/ˌkoʊnoʊˈkjuːniəs/","extraExplanation":["“cuneus”常见于解剖学：指枕叶内侧的“楔叶”（与视觉处理有关）；在更一般的英语里也可指“楔形/楔状结构”。“precuneus”则是顶叶内侧的“楔前叶”，在注意、记忆与自我相关加工等研究中常被提到。","你可能是从医学/神经科学教材、论文、或解剖图谱中看到这个词。请提供上下文（句子、段落或截图），我可以更准确地确认你要找的是哪个术语，并给出标准拼写与用法。"]}
{"word":"conodont","summary":{"en":"Conodonts are tiny tooth-like fossils used by geologists to date and correlate rock layers.","zh":"牙形石是微小的牙齿状化石，地质学家常用它们来为岩层定年并进行地层对比。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tiny, tooth-like fossil (often a microscopic element) from an extinct eel-like marine animal; conodonts are widely used to date and correlate ancient rock layers","zh":"牙形石（化石）：来自已灭绝的鳗状海洋生物的微小“牙齿状”化石（常为显微镜下可见的碎片），常用于测定与对比古老岩层的年代"},"examples":[{"en":"Geologists found conodonts in the limestone and used them to estimate the rock’s age.","zh":"地质学家在石灰岩中发现了牙形石，并用它们来估算岩层的年代。"},{"en":"Under a microscope, the conodont element looks like a tiny curved tooth.","zh":"在显微镜下，牙形石的碎片看起来像一颗微小的弯曲牙齿。"},{"en":"This formation is rich in conodont fossils from the Paleozoic Era.","zh":"这套地层含有大量来自古生代的牙形石化石。"}]}],"synonyms":["conodont element","index fossil (context)"],"phonetic":"/ˈkɑnəˌdɑnt/","extraExplanation":["“conodont”来自希腊语词根：kōnos（圆锥）+ odous/odont-（牙齿），字面意思是“圆锥形的牙”。","牙形石常作为“标准化石/指相化石”（index fossil）使用，因为它们分布广、演化快、在海相沉积中保存较多，因此很适合做地层对比与年代划分。","学习时常见搭配：conodont fossils（牙形石化石）、conodont elements（牙形石个体/碎片）、conodont biostratigraphy（牙形石生物地层学）。"]}
{"word":"conodonts","summary":{"en":"Conodonts are tiny tooth-like microfossils used by geologists to date and compare ancient rock layers.","zh":"Conodonts（牙形石）是微小的牙齿状微体化石，常用于地质定年与地层对比。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small, tooth-like fossil parts from an extinct group of eel-like animals; they are important microfossils used to date and correlate ancient rock layers (especially Paleozoic–Triassic).","zh":"一种来自已灭绝的鳗鱼状动物的微小“牙齿状”化石部件；常作为重要的微体化石，用于给古老岩层（尤其是古生代—三叠纪）定年并进行地层对比。"},"examples":[{"en":"Geologists use conodonts to date limestone layers in the field.","zh":"地质学家会利用牙形石来给野外的石灰岩地层定年。"},{"en":"Under the microscope, conodonts look like tiny, sharp teeth.","zh":"在显微镜下，牙形石看起来像微小而尖锐的牙齿。"},{"en":"This rock sample contains conodonts, suggesting it formed in a marine environment long ago.","zh":"这块岩石样品含有牙形石，暗示它很久以前形成于海洋环境。"}]}],"synonyms":["microfossils","index fossils"],"phonetic":"/ˈkɑnəˌdɑnts/","extraExplanation":["“conodonts”是复数形式；单数为“conodont”。中文常译为“牙形石”。","牙形石常用于“生物地层学”（biostratigraphy）：因为它们演化快、分布广，所以能帮助判断岩层的大致年代，并在不同地区的地层之间建立对应关系。","在科普或地学写作中，你可能会看到搭配：conodont fossils（牙形石化石）、conodont elements（牙形石元素/构件）、conodont biostratigraphy（牙形石生物地层学）。"]}
{"word":"conoid","summary":{"en":"Conoid means cone-like in shape; it can be an adjective (“conoid structure”) or a noun (“a conoid form”), and in geometry it can refer to a specific type of ruled surface.","zh":"Conoid 指“圆锥状/类似圆锥的”。既可作形容词（如 conoid structure），也可作名词（如 a conoid form）；在几何中还可指一类特定的直纹曲面。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a shape or solid that is cone-like (similar to a cone)","zh":"圆锥状的形体；类似圆锥的形状"},"examples":[{"en":"The museum roof has a conoid form, narrowing toward the top.","zh":"博物馆的屋顶呈圆锥状，向顶部逐渐变窄。"},{"en":"Some seashells have a smooth conoid shape.","zh":"一些贝壳具有光滑的圆锥状外形。"}]},{"partOfSpeech":"adj.","definition":{"en":"cone-shaped; having the form of a cone or nearly a cone","zh":"圆锥形的；近似圆锥的"},"examples":[{"en":"The surgeon described the structure as conoid in appearance.","zh":"外科医生把这个结构描述为外观呈圆锥形。"},{"en":"A conoid mound rose from the center of the field.","zh":"田地中央隆起了一座圆锥形的小丘。"}]},{"partOfSpeech":"n.","definition":{"en":"(geometry, more technical) a ruled surface formed by a straight line moving so that it always intersects a fixed line (the axis) and a fixed curve","zh":"（几何，较专业）圆锥面的一类：一条直线运动时始终与一条固定直线（轴）和一条固定曲线相交而形成的曲面"},"examples":[{"en":"In analytic geometry, a conoid can be described with equations that generate a ruled surface.","zh":"在解析几何中，圆锥面的一类可以用生成直纹曲面的方程来描述。"}]}],"synonyms":["cone-shaped","conical","cone-like"],"phonetic":"ˈkoʊnɔɪd","extraExplanation":["词源来自“cone（圆锥）+ -oid（……状的）”，-oid 表示“像……一样/……形的”，常见于 cuboid（长方体的）、spheroid（类球体）等词。","在医学里 conoid 也可能出现在解剖描述中，表示某结构“呈圆锥状”（例如某些韧带形态），通常属于形容词用法。"]}
{"word":"conoidal","summary":{"en":"Conoidal means cone-shaped or cone-like, often used in technical or scientific contexts.","zh":"conoidal 指“圆锥形/类似圆锥的”，多用于技术或科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape of a cone or closely resembling a cone; conical.","zh":"圆锥形的；近似圆锥形的。"},"examples":[{"en":"The seeds were packed inside a conoidal shell.","zh":"种子被包在一个近似圆锥形的外壳里。"},{"en":"In the diagram, the conoidal surface narrows smoothly toward the top.","zh":"在图中，这个圆锥状表面向顶部平滑收窄。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Technical) Relating to a conoid—a cone-like geometric surface or a cone-shaped structure in anatomy.","zh":"（术语）与“conoid（圆锥状体/圆锥面）”有关的；指一种类似圆锥的几何曲面或解剖结构。"},"examples":[{"en":"The model includes a conoidal section used to simplify the geometry.","zh":"该模型包含一个圆锥状截面，用于简化几何结构。"},{"en":"The report mentions the conoidal ligament in the shoulder area.","zh":"报告提到了肩部的圆锥韧带。"}]}],"synonyms":["conical","cone-shaped","conoid","tapered"],"phonetic":"/kəˈnɔɪdəl/","extraExplanation":["词源上可拆为 con-（来自拉丁语 conus“圆锥”）+ -oidal（“……形的/类似……的”）。因此它常见于数学、工程、解剖等语境，比日常词 conical 更偏专业。","用法提示：日常描述物体形状通常用 conical；在学术或技术文本中，conoidal 更常用来强调“类似圆锥”或“与 conoid 概念相关”。"]}
{"word":"conoidally","summary":{"en":"“Conoidally” means “in a cone-like (conoidal) shape or manner,” often used in scientific or technical descriptions.","zh":"“conoidally”意为“呈圆锥状地/以圆锥状方式”，多见于科学或技术性描述。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a conoidal (cone-like) way; having the shape, form, or arrangement of a conoid.","zh":"以圆锥状（近似圆锥体/圆锥面）的方式；呈圆锥形地；按圆锥形结构分布地。"},"examples":[{"en":"The fibers are arranged conoidally, narrowing toward the tip.","zh":"这些纤维呈圆锥状排列，向尖端逐渐变窄。"},{"en":"Under the microscope, the structure expands conoidally from the base.","zh":"在显微镜下，这个结构从底部开始呈圆锥状扩展开来。"}]}],"synonyms":["conically","in a cone-like manner"],"phonetic":"/kəˈnɔɪdli/","extraExplanation":["“conoid”常见于数学/几何与生物学等语境，指“类似圆锥”的形状或曲面；因此 conoidally 多用于较正式的学术写作（如解剖学、材料科学、工程描述），日常英语中很少使用。","词形关系：conoid（n./adj. 圆锥体/圆锥状的）→ conoidal（adj. 圆锥状的）→ conoidally（adv. 圆锥状地）。"]}
{"word":"Conoidea","summary":{"en":"Conoidea is a scientific name for a superfamily of predatory marine snails, including cone snails, many with venom.","zh":"Conoidea 是一个科学分类名称，指包含芋螺等在内的掠食性海洋螺类超科，其中许多具有毒液装置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a superfamily of mostly predatory marine snails (sea gastropods) that includes cone snails and their relatives, many of which have a venom apparatus.","zh":"（生物分类）新腹足目中的一个海螺类超科，主要为掠食性海洋腹足类动物，包括芋螺（cone snails）及其近缘类群；其中许多具有毒液注射装置。"},"examples":[{"en":"Scientists study Conoidea because some species produce powerful venoms.","zh":"科学家研究 Conoidea（芋螺超科），因为其中一些物种会产生强效毒素。"},{"en":"Cone snails are a well-known group within Conoidea.","zh":"芋螺（cone snails）是 Conoidea（芋螺超科）中最知名的一类。"}]}],"synonyms":["cone snail superfamily","conoids"],"phonetic":"ˌkoʊnɔɪˈdiːə","extraExplanation":["Conoidea 是生物学中的分类名称（超科），常见于动物学、海洋生物学与分类学论文中；日常英语里几乎不会用到。","该类群以“毒齿/毒镖（类似鱼叉的齿舌）+毒腺”闻名，尤其芋螺属（Conus）的一些物种对人类有危险；但其毒素也被用于药物研究（如镇痛相关研究）。","词形上常见写法为首字母大写（Conoidea），因为它是正式的分类单元名称。","相关常见词：cone snail（芋螺），venom（毒液），gastropod（腹足类），taxonomy（分类学）。"]}
{"word":"Conoidea-related","summary":{"en":"“Conoidea-related” means connected with the Conoidea group of marine snails (in biology).","zh":"“Conoidea-related”指“与 Conoidea（海洋螺类的一个总科）有关的”，多用于生物学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with or involving Conoidea (a large superfamily of mostly predatory sea snails, including many cone-like marine gastropods).","zh":"与 Conoidea（海洋腹足类的一大总科，多为捕食性海螺，常含锥形种类）有关的。"},"examples":[{"en":"The museum has a display of Conoidea-related shells from the Indo-Pacific.","zh":"博物馆展出了来自印度—太平洋地区的多种与 Conoidea 有关的贝壳。"},{"en":"Researchers are studying Conoidea-related venom peptides for possible medical use.","zh":"研究人员正在研究与 Conoidea 有关的毒液肽，以探索潜在的医疗用途。"}]}],"synonyms":["related to Conoidea","Conoidea-associated","Conoidea-linked","Conoidean (adj., in some scientific contexts)"],"phonetic":"/ˌkoʊnɔɪˈdiːə rɪˌleɪtɪd/","extraExplanation":["“Conoidea”是软体动物分类学中的“总科”（superfamily）名称，常出现在学术语境（生物分类、生态、毒素研究）中。","英语里“X-related”表示“与X有关的/相关的”，多用于较正式或科技写作；若是更自然口语，可说“related to Conoidea”或“connected with Conoidea”。"]}
{"word":"conoidean","summary":{"en":"Conoidean means “cone-shaped” or “related to a conoid,” mostly used in technical writing.","zh":"conoidean 指“圆锥形的”或“与圆锥体有关的”，多见于专业语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Cone-shaped; having the form of a conoid (a cone-like solid).","zh":"圆锥形的；呈圆锥体（近似圆锥的立体）形状的。"},"examples":[{"en":"Under the microscope, the structure looked distinctly conoidean.","zh":"在显微镜下，这个结构看起来明显呈圆锥形。"},{"en":"Some anatomy terms describe tissues as conoidean when they narrow smoothly to a point.","zh":"一些解剖学术语会用“圆锥形”来描述逐渐变细并收尖的组织。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to a conoid structure, especially in technical contexts (geometry, anatomy).","zh":"与圆锥体结构有关的（多用于几何学、解剖学等专业语境）。"},"examples":[{"en":"The report used conoidean to describe the overall profile of the surface.","zh":"报告用“conoidean”来描述该表面的整体轮廓。"},{"en":"In anatomy notes, a student may see terms like “conoid/conoidean” when reading about cone-like parts of the body.","zh":"在解剖学笔记中，学生在阅读身体中呈圆锥状的结构时，可能会见到“conoid/conoidean”等词。"}]}],"synonyms":["conical","conoid","cone-shaped"],"phonetic":"/ˌkoʊnɔɪˈdiːən/","extraExplanation":["“conoidean”是非常少见的形容词，日常英语里几乎不用；更常见的是 conical（圆锥形的）或 conoid（圆锥体的/圆锥形的）。","词源上与希腊语中表示“圆锥”的词根有关（konos ‘cone’ + -oid ‘…形状的’），因此整体含义就是“像圆锥一样的”。"]}
{"word":"conoidic","summary":{"en":"Conoidic means cone-like in shape, used mostly in technical descriptions.","zh":"conoidic 指“圆锥状/类似圆锥体的”，多用于科技或学术描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"shaped like a conoid (a cone-like solid), or having a cone-like form","zh":"圆锥状的；类似圆锥体（conoid）的形状"},"examples":[{"en":"Under the microscope, the crystal shows a conoidic outline.","zh":"在显微镜下，这种晶体呈现出圆锥状的轮廓。"},{"en":"Some plants produce conoidic buds in early spring.","zh":"有些植物在早春会长出圆锥状的芽。"}]}],"synonyms":["conical","cone-shaped","conoid"],"phonetic":"/kəˈnɔɪdɪk/","extraExplanation":["“conoidic”属于偏学术/技术用词，常见于解剖学、植物学、矿物学等语境，用来描述“像圆锥体那样”的形状。","词源上可理解为 conoid（圆锥体、圆锥状物）+ -ic（形容词后缀，表示“……的/像……的”）。日常英语更常用 conical（圆锥形的）或 cone-shaped（像圆锥的）。"]}
{"word":"conoidical","summary":{"en":"Conoidical means cone-shaped or cone-like, mainly in technical contexts.","zh":"conoidical 意为“圆锥形的/类似圆锥的”，多见于专业或技术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape of a cone; conical or cone-like (often used in technical or scientific descriptions).","zh":"呈圆锥形的；类似圆锥的（多用于科技或专业描述）。"},"examples":[{"en":"The shell has a conoidical form, narrowing toward the tip.","zh":"这个贝壳呈圆锥状，向尖端逐渐变窄。"},{"en":"A conoidical structure can help guide airflow in some designs.","zh":"在某些设计中，圆锥状结构有助于引导气流。"}]}],"synonyms":["conical","cone-shaped","conoidal","tapered"],"phonetic":"/kəˈnɔɪdɪkəl/","extraExplanation":["“conoidical”在现代英语里比较少见，更常见的写法是“conical”（圆锥形的）或“conoidal”（圆锥状的、近似圆锥的，偏技术用语）。如果你是在论文、说明书或旧文献里看到“conoidical”，通常可按“conical/cone-like”来理解。","词根提示：con-（来自 cone 圆锥）+ -oid（“……形的/类似……的”）+ -ical（形容词后缀），整体意思就是“像圆锥的”。"]}
{"word":"conoidically","summary":{"en":"“Conoidically” means “in a cone-like (conoid) shape or manner.”","zh":"“conoidically”意为“以类圆锥（conoid）形状/方式；呈类圆锥形地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a conoidical way; with a shape or form resembling a conoid (a cone-like geometric form).","zh":"以圆锥体/类圆锥（conoid）方式；呈类圆锥形地。"},"examples":[{"en":"The shell curves conoidically, narrowing toward the tip.","zh":"贝壳呈类圆锥形弯曲，向尖端逐渐变窄。"},{"en":"The structure rises conoidically from a broad base to a pointed top.","zh":"该结构从宽阔的底部以类圆锥形向上延伸到尖顶。"}]}],"synonyms":["conically","in a cone-like way"],"phonetic":"/kəˈnɔɪdɪkli/","extraExplanation":["“conoidically”非常少见，多见于几何、工程或生物形态描述。更常用的说法是“conically”（圆锥形地）或用形容词“conoidal / conical”（类圆锥的/圆锥的）来表达。","“conoid”在数学上可指由直线生成的锥状曲面/立体（类锥体），在不同学科里用法可能略有差异；写作时最好配合图示或明确说明你指的是哪一种“类圆锥”形态。"]}
{"word":"conoids","summary":{"en":"“Conoids” is the plural of “conoid,” meaning cone-like shapes or cone-shaped structures, often used in geometry or anatomy.","zh":"“Conoids”是“conoid”的复数，表示圆锥状的形状或结构，常见于几何学或解剖学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of conoid: a cone-like shape (especially in geometry) or a cone-shaped structure (especially in anatomy).","zh":"conoid 的复数：指“圆锥状/似圆锥的形状”（多用于几何学），或“圆锥形的结构”（多用于解剖学）。"},"examples":[{"en":"In the diagram, the conoids are shown as cone-like surfaces.","zh":"在这张示意图中，conoids 被画成圆锥状的曲面。"},{"en":"Some anatomy texts mention conoids as cone-shaped parts or projections.","zh":"一些解剖学教材会提到 conoids，指圆锥形的部位或突起。"}]}],"synonyms":["cone-like forms","conical shapes","conical structures"],"phonetic":"/ˈkoʊnɔɪd/","extraExplanation":["词源上，conoid 来自 cone（圆锥）+ -oid（“……状/类似……”的后缀）。所以 conoid 字面意思就是“圆锥状的”。","在数学里，conoid 可指一类“由直线生成的曲面”（一种特殊曲面），但日常阅读里更常见的是泛指“圆锥状/似圆锥的形状”。具体含义通常要看学科语境（几何/解剖/工程）。"]}
{"word":"Conolophus","summary":{"en":"Conolophus is the scientific genus name for the Galápagos land iguanas.","zh":"Conolophus 是“加拉帕戈斯陆鬣蜥”这一类动物的科学属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of large land iguanas native to the Galápagos Islands (includes the Galápagos land iguanas).","zh":"（生物）加拉帕戈斯群岛特有的一属陆生鬣蜥（含加拉帕戈斯陆鬣蜥等）。"},"examples":[{"en":"Conolophus is a genus found only in the Galápagos Islands.","zh":"Conolophus 是只分布于加拉帕戈斯群岛的一属动物。"},{"en":"Researchers monitor Conolophus populations to understand island ecosystem health.","zh":"研究人员监测 Conolophus 的种群，以了解岛屿生态系统的健康状况。"},{"en":"The Galápagos land iguana belongs to the genus Conolophus.","zh":"加拉帕戈斯陆鬣蜥隶属于 Conolophus 这一属。"}]}],"synonyms":["Galápagos land iguana (genus)","land iguana (scientific context)"],"phonetic":"/ˌkoʊnəˈloʊfəs/","extraExplanation":["这是一个拉丁化的科学属名，常见于生物学/生态学文章与博物馆说明牌中；日常英语里更常说 “Galápagos land iguana(s)”（加拉帕戈斯陆鬣蜥）。","词源可追溯到希腊语成分：cono-（与“圆锥/锥形”相关）+ -lophus（与“冠/嵴、羽冠”相关），常用来暗示外形特征（如隆起的嵴）。"]}
{"word":"conolophus","summary":{"en":"Conolophus is the scientific genus name for the Galápagos land iguanas.","zh":"Conolophus 是加拉帕戈斯陆鬣蜥的科学属名（学名属）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific genus name for the Galápagos land iguanas (large lizards native to the Galápagos Islands), including species such as the Galápagos land iguana.","zh":"加拉帕戈斯陆鬣蜥的一个生物学属名（学名属），指原产于加拉帕戈斯群岛的大型蜥蜴类群，包括如加拉帕戈斯陆鬣蜥等物种。"},"examples":[{"en":"Researchers surveyed Conolophus populations on several Galápagos islands.","zh":"研究人员在加拉帕戈斯的几座岛屿上调查了 Conolophus（陆鬣蜥属）的种群。"},{"en":"The genus Conolophus is closely associated with the Galápagos ecosystem.","zh":"Conolophus（陆鬣蜥属）与加拉帕戈斯生态系统密切相关。"}]}],"synonyms":["Galápagos land iguana (genus)","land iguana"],"phonetic":"/kəˈnɑləfəs/","extraExplanation":["“Conolophus”是拉丁化的科学命名，常用于学术写作与自然纪录片中；日常英语里更常说“Galápagos land iguana(s)”（加拉帕戈斯陆鬣蜥）。","作为属名（genus），Conolophus在书写时通常首字母大写并用斜体（如 *Conolophus*）；表示多个物种时可说“the genus *Conolophus*”。"]}
{"word":"conominee","summary":{"en":"A co-nominee is someone nominated together with another person.","zh":"co-nominee 指与他人一起被提名的人（共同被提名者）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is nominated together with another person (a joint nominee).","zh":"与他人一起被提名的人；共同被提名者。"},"examples":[{"en":"She was named co-nominee for the award along with her teammate.","zh":"她和队友一起被提名为该奖项的共同候选人。"},{"en":"The two co-nominees agreed to share the speaking time.","zh":"两位共同被提名者同意分配发言时间。"}]}],"synonyms":["joint nominee","co-candidate","fellow nominee"],"phonetic":"/koʊˌnɑməˈni/","extraExplanation":["“conominee”不是常见标准拼写，更常见的写法是带连字符的“co-nominee”。在新闻报道、奖项提名、选举语境中更常见。","前缀“co-”表示“共同、一起”（如 co-worker 同事，co-founder 联合创始人）。"]}
{"word":"Conon","summary":{"en":"Conon is mainly a proper name, referring to several notable figures in ancient Greek history, especially an astronomer (Conon of Samos) and an Athenian naval general.","zh":"Conon主要是专有名词，可指古希腊史上几位人物，尤其常见的是天文学家“萨摩斯的科农”和雅典海军将领“科农”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a masculine given name (rare in modern English), historically used in Greek and later Christian contexts.","zh":"男性名字（现代英语中较少见），在古希腊及后来的基督教语境中出现过。"},"examples":[{"en":"Conon is an uncommon name today, but it appears in several ancient historical records.","zh":"Conon 这个名字在今天并不常见，但在一些古代史料中能看到。"},{"en":"The museum label mentions Conon as the author of a lost work.","zh":"博物馆的说明牌提到 Conon 是某部佚作的作者。"}]},{"partOfSpeech":"other","definition":{"en":"Conon of Samos: an ancient Greek astronomer and mathematician, remembered for work on astronomy and for being associated with the story of “Berenice’s Hair” (a constellation/asterism).","zh":"萨摩斯的科农（Conon of Samos）：古希腊天文学家、数学家，以天文学研究闻名，并与“贝勒妮丝的头发”（星座/星群）的故事相关。"},"examples":[{"en":"Conon of Samos worked in Alexandria and contributed to Greek astronomy.","zh":"萨摩斯的科农在亚历山大里亚活动，并对希腊天文学有所贡献。"},{"en":"The poet Callimachus connects Conon with the tale behind “Berenice’s Hair.”","zh":"诗人卡利马科斯把科农与“贝勒妮丝的头发”背后的故事联系在一起。"}]},{"partOfSpeech":"other","definition":{"en":"Conon (Athenian general): an Athenian naval commander (5th–4th century BCE) known for fighting Sparta and helping rebuild Athenian power after the Peloponnesian War.","zh":"科农（雅典将领）：公元前5—4世纪的雅典海军统帅，以对抗斯巴达、并在伯罗奔尼撒战争后帮助雅典恢复势力而知名。"},"examples":[{"en":"In some histories, Conon is credited with restoring Athens’ naval strength.","zh":"在一些史书中，科农被认为重振了雅典的海军力量。"},{"en":"Conon later appears in accounts of the Corinthian War.","zh":"科农后来也出现在关于科林斯战争的记载中。"}]}],"synonyms":["(proper name) none"],"phonetic":"ˈkoʊnən","extraExplanation":["“Conon”在英语里通常作为专有名词使用，因此更像“人名条目”而不是普通词汇。不同领域（天文学/古希腊史）会指向不同的Conon。","发音在英语中常读作/ˈkoʊnən/（重音在第一音节）。如果你是在特定文章或课本里看到它，我可以根据上下文帮你判断指的是哪一位Conon。"]}
{"word":"cononintelligent","summary":{"en":"Non-intelligent means ‘not intelligent’ or ‘not having human-like intelligence,’ but it can sound rude when used about people.","zh":"non-intelligent 表示“不聪明的”或“不具有人类般智能的”；用于评价人时可能显得不礼貌。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not intelligent; lacking the ability to think, learn, or understand well.","zh":"不聪明的；缺乏良好思考、学习或理解能力的。"},"examples":[{"en":"It’s unkind to call someone non-intelligent; it’s better to talk about specific skills.","zh":"说别人“不聪明”不太友善；更好的方式是谈具体能力。"},{"en":"The test doesn’t measure intelligence, so it can’t prove someone is non-intelligent.","zh":"这个测试不衡量智力，所以无法证明某人“不聪明”。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not having human-like intelligence (often used for machines, animals, or systems).","zh":"不具有人类般智能的（常用于机器、动物或系统）。"},"examples":[{"en":"A basic calculator is a non-intelligent device—it follows fixed rules.","zh":"基础计算器是“非智能”的设备——它只按固定规则运行。"},{"en":"Some people call traditional software ‘non-intelligent’ to contrast it with AI.","zh":"有人把传统软件称为“非智能”的，以对比人工智能。"}]}],"synonyms":["unintelligent","not smart","nonthinking (for systems)","simple (for devices)"],"phonetic":"/ˌnɑn ɪnˈtɛlɪdʒənt/","extraExplanation":["你输入的“cononintelligent”看起来不是常见英文单词，可能想写的是 non-intelligent（或 nonintelligent）。","在形容人时，non-intelligent 带有较强的负面评价，语气可能显得冒犯。更常见、更礼貌的表达是: not very good at math / needs more practice / struggles with reading 等，强调具体方面而不是给人贴标签。","写法上 non-intelligent、nonintelligent 都可见；美式写作里，前缀 non- 加形容词有时会加连字符，尤其在正式写作或避免误读时。"]}
{"word":"Conopholis","summary":{"en":"Conopholis is a genus of North American parasitic plants (broomrapes), especially known for the species Conopholis americana.","zh":"Conopholis 指北美的一属寄生植物（列当类），最常见的是美洲锥花列当 Conopholis americana。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of parasitic flowering plants in the broomrape family (Orobanchaceae), found in North America; its best-known species is Conopholis americana (often called squawroot).","zh":"锥花列当属：列当科（Orobanchaceae）的一属寄生性开花植物，分布于北美；其中最常见的物种是美洲锥花列当（Conopholis americana，常被称为“squawroot”）。"},"examples":[{"en":"Conopholis grows without chlorophyll, drawing nutrients from the roots of oak trees.","zh":"锥花列当属植物没有叶绿素，会从橡树的根部吸取养分。"},{"en":"We spotted Conopholis near the base of an old oak in the forest.","zh":"我们在森林里一棵老橡树的树根附近看到了锥花列当属植物。"}]}],"synonyms":["broomrape (family term)","Conopholis americana (species name)","bear corn (common name for C. americana)","squawroot (older common name for C. americana)"],"phonetic":"/kəˈnɑfəlɪs/","extraExplanation":["读音提示：学术场合常按词根分读为 con-OFF-oh-liss。","词源小知识：Conopholis 来自希腊语词根，cono-（“圆锥形”）+ -pholis（与“鳞片”相关），常用来形容它花序/苞片呈鳞片状、整体像小圆锥的外观。","文化与用词提醒：Conopholis americana 的俗名 “squawroot” 在英语中常被认为带有对原住民女性的不尊重色彩；更中性的说法可用 “bear corn” 或直接用学名。"]}
{"word":"conopholis","summary":{"en":"Conopholis is a genus of parasitic, cone-like plants (like squawroot) that grow on oak roots in eastern North America.","zh":"Conopholis 指一类寄生在橡树根上的松果状植物属（如 squawroot），主要见于北美东部。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of unusual, non-green parasitic plants (e.g., squawroot) that live attached to oak roots, found in eastern North America.","zh":"一种奇特的寄生植物属（如“橡根寄生草/松果草”squawroot），无绿色叶绿素，常寄生在橡树根上，主要分布于北美东部。"},"examples":[{"en":"In early spring, Conopholis can appear as short, cone-shaped spikes near oak trees.","zh":"早春时，Conopholis 可能会在橡树附近冒出短短的、像松果一样的穗状体。"},{"en":"Because it lacks chlorophyll, Conopholis gets nutrients by parasitizing oak roots.","zh":"由于缺乏叶绿素，Conopholis 通过寄生橡树根部来获取养分。"}]}],"synonyms":["squawroot","bear corn"],"phonetic":"/ˌkɑːnəˈfoʊlɪs/","extraExplanation":["“Conopholis”常见的英文俗名是 squawroot（也叫 bear corn）。其中 squaw 一词在当代英语里可能被视为对美洲原住民女性的冒犯性称呼，因此很多科普或自然写作更倾向使用 bear corn 或直接用学名 Conopholis。","它在林地里看起来像松果或蜡质的蘑菇群，但并不是蘑菇；这是开花植物的一种寄生形态，常在橡树林地、落叶层较厚的地方出现。"]}
{"word":"conopid","summary":{"en":"A conopid is a fly in the family Conopidae, often a wasp-like parasitic fly.","zh":"conopid 指锥蝇科的一种蝇，常呈黄蜂拟态，许多种类为寄生性昆虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fly of the family Conopidae (a type of parasitic fly, often called a “thick-headed fly”).","zh":"锥蝇科（Conopidae）的一种蝇；常称“厚头蝇”（这类蝇多为寄生性昆虫）。"},"examples":[{"en":"A conopid fly hovered near the flowers, looking a bit like a small wasp.","zh":"一只锥蝇科的蝇在花旁盘旋，看起来有点像小黄蜂。"},{"en":"Some conopids lay eggs in bees, and the larvae develop inside the host.","zh":"有些锥蝇科昆虫会把卵产在蜜蜂体内，幼虫在宿主体内发育。"}]}],"synonyms":["conopid fly","thick-headed fly"],"phonetic":"/kəˈnoʊpɪd/","extraExplanation":["“conopid”来自昆虫分类学：Conopidae（锥蝇科）。在自然观察或科普文章中更常见到“conopid fly / thick-headed fly”这种说法，而不是单独用“conopid”。","锥蝇科成虫常拟态黄蜂或蜜蜂（外形像、飞行方式也像），这有助于它们接近宿主或避免天敌；但它们一般不是黄蜂，不会像黄蜂那样主动攻击人。"]}
{"word":"Conopidae","summary":{"en":"Conopidae: a family of flies known as thick-headed flies, often associated with bees and wasps.","zh":"Conopidae：双翅目中的一个科，俗称厚头蝇科/厚头蝇，常与蜜蜂、黄蜂等昆虫有关（许多为寄生性）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of flies (in the order Diptera), commonly called thick-headed flies; many species are parasitoids of bees and wasps.","zh":"一种苍蝇的科（双翅目），常被称为“厚头蝇科/厚头蝇”；许多种类会寄生（寄生性幼虫）于蜜蜂或黄蜂等膜翅目昆虫体内。"},"examples":[{"en":"Conopidae are often seen hovering around flowers, where they may ambush bees.","zh":"厚头蝇科常在花朵附近盘旋，有时会伺机接近蜜蜂。"},{"en":"The researcher recorded a Conopidae larva developing inside a wasp host.","zh":"研究人员记录到一只厚头蝇科幼虫在黄蜂宿主体内发育。"}]}],"synonyms":["thick-headed flies"],"phonetic":"/kəˈnɑːpɪdiː/","extraExplanation":["“Conopidae”是拉丁化的科学名称，通常在英文里当作单数或复数使用（例如：*Conopidae is/are…*，写作时以你的语境与期刊风格为准）。","常见英文俗名是 **thick-headed flies**（厚头蝇），名称来自它们头部外形较宽厚。","它们与人类日常生活的关联多出现在生态与传粉研究中：成虫常访花，但幼虫阶段可能会影响蜜蜂、黄蜂等昆虫种群。"]}
{"word":"conopidae","summary":{"en":"Conopidae: a family of flies (“thick-headed flies”), many of which parasitize bees and wasps.","zh":"Conopidae：厚头蝇科，一类蝇；许多物种寄生于蜜蜂、黄蜂等昆虫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of flies (in the order Diptera), often called thick-headed flies; many species are parasitic on bees and wasps.","zh":"一种昆虫纲双翅目中的蝇类科（常称“厚头蝇”）；许多种类会寄生在蜜蜂、黄蜂等膜翅目昆虫体内。"},"examples":[{"en":"Conopidae are sometimes seen hovering around flowers where bees feed.","zh":"厚头蝇科的昆虫有时会在蜜蜂取食的花朵周围盘旋。"},{"en":"Some Conopidae species lay eggs on bees, and the larvae develop inside the host.","zh":"某些厚头蝇科物种会把卵产在蜜蜂身上，幼虫在宿主体内发育。"}]}],"synonyms":["thick-headed flies"],"phonetic":"/kəˈnɑpɪdi/","extraExplanation":["“Conopidae”是拉丁化的生物分类名称，指“厚头蝇科”。日常英文里更常用的俗名是 thick-headed flies。","词源可追溯到希腊语“kōnōps（蚊/小飞虫）”，用于指代外形像细小飞虫的一类昆虫。","在生态学语境中常被提到，因为它们与传粉昆虫（如蜜蜂、黄蜂）存在寄生关系，可能影响授粉群落结构。"]}
{"word":"conoplain","summary":{"en":"Complain means to express dissatisfaction or to report a problem/pain.","zh":"Complain 表示表达不满、抱怨，或诉说问题/不适。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to say that you are unhappy or not satisfied about something; to express a problem or pain","zh":"抱怨；投诉；（因不舒服而）诉说"},"examples":[{"en":"She complained about the noisy neighbors.","zh":"她抱怨邻居太吵。"},{"en":"If your food is cold, you can complain to the manager.","zh":"如果你的食物是凉的，你可以向经理投诉。"},{"en":"He complained of a headache all day.","zh":"他一整天都说头疼。"}]}],"synonyms":["grumble","moan","protest","object","criticize"],"phonetic":"/kəmˈpleɪn/","extraExplanation":["你输入的“conoplain”很可能是拼写错误，正确拼写是 **complain**。","常见搭配：**complain about**（抱怨某事）、**complain to**（向某人/机构投诉）、**complain of**（诉说疼痛/不适，如 complain of a headache）。","语气区别：**complain** 常带负面情绪；更正式、偏“提出问题/投诉”的表达可以用 **make a complaint**（提出投诉）或 **file a complaint**（正式投诉）。"]}
{"word":"conopodium","summary":{"en":"Conopodium is a botanical genus in the carrot family, best known for the pignut plant with an edible tuber.","zh":"Conopodium 是伞形科的一个植物属，最知名的是有可食用块茎的“猪坚果/地栗”（pignut）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small plants in the carrot family (Apiaceae), especially the pignut (Conopodium majus), which has an edible underground tuber.","zh":"（植物）锥果属：伞形科的一属小型植物，尤指“猪坚果/地栗”（Conopodium majus），其地下块茎可食用。"},"examples":[{"en":"In some parts of Britain, children used to dig up pignuts (Conopodium) as a snack.","zh":"在英国的一些地区，孩子们过去会挖“猪坚果/地栗”（锥果属植物）当零食吃。"},{"en":"The field guide lists Conopodium majus as a common woodland plant.","zh":"这本野外指南把 Conopodium majus 列为常见的林地植物。"}]}],"synonyms":["pignut (for Conopodium majus)"],"phonetic":"ˌkɑːnəˈpoʊdiəm","extraExplanation":["“Conopodium”是植物学拉丁名，常见于野外植物图鉴与学术语境；日常英语里更常用具体物种名“pignut（猪坚果/地栗）”。","该属名源自希腊语词根，含“圆锥/球果（cono-）”与“足/柄（-podium）”之意，指其形态特征。注意：可食用并不等于可随意采食，野外采摘需确认鉴定、遵守当地法规并注意生态影响。"]}
{"word":"Conopophaga","summary":{"en":"Conopophaga is a genus of South American birds called gnateaters.","zh":"Conopophaga 指南美洲“蚊食鸟”的一个属（蚊食鸟属）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small South American forest birds known as gnateaters (family Conopophagidae).","zh":"（鸟类）蚊食鸟属：南美洲森林中的一属小型鸟类，俗称“蚊食鸟”，隶属蚊食鸟科（Conopophagidae）。"},"examples":[{"en":"Scientists recorded a Conopophaga species calling at dawn in the Atlantic Forest.","zh":"科学家在大西洋沿岸森林里记录到一种蚊食鸟属（Conopophaga）鸟类在黎明时的鸣叫。"},{"en":"In this field guide, Conopophaga is listed under the gnateaters.","zh":"在这本野外鸟类图鉴中，Conopophaga 被归在“蚊食鸟（gnateaters）”类群下。"}]}],"synonyms":["gnateater","Conopophagidae"],"phonetic":"/ˌkɑːnəˈpɑːfəɡə/","extraExplanation":["词源小贴士：Conopophaga 来自希腊语 konops（蚊/小飞虫）+ phagein（吃），字面意思是“吃蚊虫的”。","这是一个生物分类学名称（属名），通常用于学术写作、鸟类图鉴与观察记录中；日常英语更常用通俗名 gnateater（蚊食鸟）来指这一类鸟。"]}
{"word":"conopophaga","summary":{"en":"Conopophaga is the scientific genus name for South American gnateaters—small forest birds that mainly eat insects.","zh":"Conopophaga 是南美洲食蚊鸟（食虫林下鸟）的一种科学属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small South American birds (gnateaters) in the family Conopophagidae, known for living in forest understory and eating insects","zh":"（鸟类）食蚊鸟属：南美洲的一类小型林下鸟，隶属食蚊鸟科（Conopophagidae），以捕食昆虫为主"},"examples":[{"en":"Researchers recorded the call of a Conopophaga species deep in the Atlantic Forest.","zh":"研究人员在大西洋沿岸森林深处记录到一种食蚊鸟属（Conopophaga）鸟类的叫声。"},{"en":"The guidebook lists Conopophaga among the understory insect-eaters of Brazil.","zh":"这本鸟类指南把食蚊鸟属（Conopophaga）列为巴西林下的食虫鸟之一。"}]}],"synonyms":["gnateater (common name, not the same taxonomic rank)"],"phonetic":"ˌkɑːnoʊˈpɑːfəɡə","extraExplanation":["这是拉丁化的学名（属名），常用于生物分类、生态研究和观鸟资料中；日常英语里更常说“gnateater（食蚊鸟）”。","词源可拆为希腊语词根：cono-（锥形/圆锥）+ -phaga（吃、吞食，见于 -phage / -phagous），暗示其取食方式或形态特征，但具体命名动机需结合原始命名文献。"]}
{"word":"Conopophagidae","summary":{"en":"Conopophagidae is the scientific family name for the South American “gnateaters.”","zh":"Conopophagidae 指“蚊食鸟科”，即南美洲“食蚊鸟（gnateaters）”的鸟类科名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of small South American forest birds known as the gnateaters, in the order Passeriformes.","zh":"（鸟类）蚊食鸟科：南美洲森林中的一类小型鸟，英文俗称“gnateaters（食蚊鸟）”，隶属雀形目。"},"examples":[{"en":"Conopophagidae are found in tropical forests, where they forage close to the ground.","zh":"蚊食鸟科主要分布在热带森林里，常在近地面觅食。"},{"en":"The birdwatching guide lists several Conopophagidae species in the Amazon basin.","zh":"观鸟指南列出了亚马孙流域的几种蚊食鸟科物种。"}]}],"synonyms":["gnateaters","Conopophagidae (gnateater family)"],"phonetic":"/kəˌnɑːnoʊˈfeɪdʒɪˌdiː/","extraExplanation":["“Conopophagidae”是生物分类学（拉丁化）的科名，常见俗名是“gnateaters”。词源来自希腊语：kōnōps（蚊/蚋一类的小飞虫）+ phagein（吃）。因此中文可意译为“食蚊（小飞虫）鸟”。","作为科名，书写时首字母大写（Conopophagidae），表示一个分类单元；谈具体某一种时通常用属名+种加词（如 Conopophaga 某某）。"]}
{"word":"conopophagidae","summary":{"en":"Conopophagidae is the scientific family name for South American birds known as gnateaters.","zh":"Conopophagidae 是“蚋食鸟（gnateaters）”这一类南美洲鸟的科学分类学科名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of small South American birds commonly called gnateaters (genus Conopophaga), found in forests and thickets.","zh":"（鸟类）蚋食鸟科：南美洲的一科小型鸟类，常见英文俗名为“gnateaters（蚋食鸟）”，主要分布于森林与灌丛环境。"},"examples":[{"en":"Conopophagidae are mostly found in South American forest habitats.","zh":"蚋食鸟科的鸟类多见于南美洲的森林栖息地。"},{"en":"In some checklists, Conopophagidae includes the genus Conopophaga.","zh":"在一些鸟类名录中，蚋食鸟科包含 Conopophaga（蚋食鸟属）。"}]}],"synonyms":["gnateaters","gnateater family"],"phonetic":"/ˌkoʊ.nəˌfɑː.dʒəˈdaɪ.di/","extraExplanation":["“Conopophagidae”是动物学（鸟类学）里的拉丁化学名，结尾“-idae”表示“科”（family）。","常见的英语通俗名是“gnateaters”（直译“吃蚋/小飞虫的鸟”），但它们并不只吃蚋，也会取食多种小型无脊椎动物。","在非专业英文写作中，更常用通俗名；在论文、物种名录、博物馆标本标签里更常用“Conopophagidae”。"]}
{"word":"Conor","summary":{"en":"Conor is a male given name (and sometimes a surname), especially common in Ireland; it’s a spelling variant of Connor.","zh":"Conor 是常见的男性名字（有时也作姓），在爱尔兰尤其常见；是 Connor 的一种拼写变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (first name), especially common in Ireland; a spelling variant of “Connor.”","zh":"男性名字（名），在爱尔兰尤其常见；是“Connor”的一种拼写变体。"},"examples":[{"en":"Conor is my classmate from Dublin.","zh":"Conor 是我来自都柏林的同学。"},{"en":"How do you spell your name—Conor or Connor?","zh":"你的名字怎么拼——Conor 还是 Connor？"},{"en":"Conor said he’ll call me after work.","zh":"Conor 说他下班后会给我打电话。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname), less common than its use as a first name.","zh":"姓氏（不如作为名字常见）。"},"examples":[{"en":"Ms. Conor will lead today’s meeting.","zh":"Conor 女士将主持今天的会议。"}]}],"synonyms":["Connor"],"phonetic":"/ˈkɑnər/","extraExplanation":["“Conor”多被认为来自爱尔兰盖尔语名字（常与“Connor”同源）。传统释义常解释为“猎犬的爱好者/爱犬之人”（lover of hounds），也有来源解释与“智慧、意志”等含义相关，但在现代英语环境中通常把它当作人名使用即可。","在英语国家，Conor 与 Connor 都常见；Conor 更偏爱尔兰拼法，而 Connor 在美国、英国也非常普遍。正式场合如果不确定拼写，礼貌做法是询问对方如何拼写名字。"]}
{"word":"conor","summary":{"en":"Conor is a common Irish male name (a variant spelling of Connor) and can also be a surname.","zh":"Conor 是常见的爱尔兰男性名字（Connor 的变体拼写），也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a masculine given name, especially common in Ireland; a spelling variant of “Connor.”","zh":"男性名字，尤其常见于爱尔兰；是“Connor”的一种拼写变体。"},"examples":[{"en":"Conor is an Irish name.","zh":"Conor 是一个爱尔兰名字。"},{"en":"My classmate Conor moved to New York last year.","zh":"我的同学 Conor 去年搬到了纽约。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname), less common than the given name.","zh":"姓氏（不如作为名字常见）。"},"examples":[{"en":"Ms. Conor will lead today’s meeting.","zh":"Conor 女士将主持今天的会议。"}]}],"synonyms":["Connor","Conner"],"phonetic":"ˈkɑnɚ","extraExplanation":["“Conor/Connor”源自盖尔语（爱尔兰语/苏格兰盖尔语）传统名字（常追溯到古爱尔兰语 Conchobhar），常见释义与“猎犬”“狼”等意象相关（如“爱犬者/爱狼者”之类的解释）；不同来源对精确词根解释略有差异。","在现代文化里，因爱尔兰知名人物（如综合格斗选手 Conor McGregor）而更广为人知。拼写上 Conor 与 Connor 常被视为同名的不同写法。"]}
{"word":"Conorhinus","summary":{"en":"Conorhinus is an older genus name for certain kissing bugs; in modern usage these insects are usually classified as Triatoma and related genera.","zh":"Conorhinus 是某些“接吻虫”的旧属名；现代用法中它们多归入 Triatoma 等近缘属。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former scientific genus name for certain blood-sucking “kissing bugs” (triatomine insects); today these insects are usually classified in the genus Triatoma and related genera.","zh":"某些吸血“接吻虫”（锥蝽亚科昆虫）的旧属名；如今多已改归为刺客椿象属 Triatoma 及其近缘属。"},"examples":[{"en":"In older medical texts, Conorhinus may be used for insects now called Triatoma (kissing bugs).","zh":"在较早的医学文献中，Conorhinus 有时用来指如今称为 Triatoma 的昆虫（接吻虫）。"},{"en":"The paper lists Conorhinus as a synonym, reflecting historical changes in insect classification.","zh":"论文把 Conorhinus 列为同义名，反映了昆虫分类在历史上的变化。"}]}],"synonyms":["Triatoma","kissing bug","triatomine bug"],"phonetic":"/ˌkoʊ.nəˈraɪ.nəs/","extraExplanation":["Conorhinus 属名常见于19世纪到20世纪早期的昆虫学与热带病学资料中。现代分类学更常使用 Triatoma（刺客椿象属）及“triatomine bug（锥蝽）”等说法。","这些昆虫因常在人的口鼻周围叮咬而得名“kissing bug（接吻虫）”。部分种类可传播查加斯病（Chagas disease），但风险与地区、物种和居住环境密切相关。"]}
{"word":"conorhinus","summary":{"en":"Conorhinus is an older scientific name for some kissing bugs, now usually classified as Triatoma.","zh":"Conorhinus 是某些“接吻虫/锥蝽”的旧学名，如今多归入锥蝽属 Triatoma。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former scientific name for certain blood-feeding “kissing bugs” (in the assassin bug family), now generally classified in the genus Triatoma; some species can transmit Chagas disease","zh":"某些吸血“接吻虫”（刺客蝽科）曾用的旧属名/旧学名，如今通常归入锥蝽属（Triatoma）；其中一些物种可传播查加斯病"},"examples":[{"en":"Older medical papers may mention Conorhinus when discussing kissing bugs.","zh":"较早的医学文献在讨论“接吻虫”时可能会使用 Conorhinus 这个名称。"},{"en":"Today, many insects once labeled Conorhinus are classified as Triatoma species.","zh":"如今，过去被标为 Conorhinus 的许多昆虫被归类为锥蝽属（Triatoma）的物种。"}]}],"synonyms":["Triatoma","kissing bug","assassin bug"],"phonetic":"/ˌkɑnəˈraɪnəs/","extraExplanation":["Conorhinus 属名在历史上曾用于一些“接吻虫/锥蝽”，但现代分类学多已改用 Triatoma。阅读旧文献时，看到 Conorhinus 通常可以理解为与 Triatoma 相关的旧称。","“接吻虫”之所以得名，是因为它们常在夜间叮咬人脸部周围；其传播查加斯病的关键并非唾液，而是虫粪污染伤口或黏膜这一途径。"]}
{"word":"conormal","summary":{"en":"Conormal is a technical adjective in math meaning “related to the normal (perpendicular) direction,” especially for conormal vectors/covectors and the conormal bundle.","zh":"Conormal 是数学中的专业形容词，表示“与法向（垂直方向）有关”，常见于共法向量/共法余向量与共法丛等概念。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Math, geometry) Relating to a normal direction; especially describing a vector/covector or space that is perpendicular to a surface (or tangent space).","zh":"（数学/几何）与“法向”有关；尤指描述与某个曲面（或切空间）垂直的向量/余向量或空间。"},"examples":[{"en":"In differential geometry, a conormal vector is perpendicular to the tangent space of the surface.","zh":"在微分几何中，conormal 向量与曲面的切空间垂直。"},{"en":"The conormal bundle collects all conormal covectors along a submanifold.","zh":"conormal bundle（共法丛）把子流形上所有的共法余向量汇集在一起。"}]}],"synonyms":["normal to","perpendicular to","orthogonal (often close in meaning)"],"phonetic":"/ˌkoʊˈnɔrməl/","extraExplanation":["“conormal”在一般英语里很少见，主要出现在数学（微分几何、偏微分方程、代数几何）和物理的学术写作中。日常语境中通常不会用到。","词形上可理解为 co-（共同/对应）+ normal（法向的）；很多教材里会把 conormal 与 normal（法向量）一起讲：normal 常指“垂直于曲面”的向量，而 conormal 常指与切向方向成零作用（annihilate tangent vectors）的“余向量/一形式”，两者在度量（metric）下可互相对应。"]}
{"word":"conoscente","summary":{"en":"Conoscente is an Italian word meaning “acquaintance,” and it can also mean “known/familiar” as an adjective.","zh":"conoscente 是意大利语，常指“熟人”，也可作形容词表示“熟悉的/已知的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person you know, but not a close friend; an acquaintance","zh":"认识但不算亲近的那种人；熟人"},"examples":[{"en":"She’s not a close friend—just a conoscente from work.","zh":"她不是密友，只是一个工作上认识的熟人。"},{"en":"I ran into an old conoscente at the station.","zh":"我在车站偶遇一位老熟人。"}]},{"partOfSpeech":"adj.","definition":{"en":"known or familiar (used as an adjective in Italian)","zh":"已知的；熟悉的（意大利语中的形容词用法）"},"examples":[{"en":"That name sounds conoscente to me.","zh":"那个名字听起来我很熟悉。"},{"en":"The streets felt conoscente after a few days in the city.","zh":"在城里待了几天后，这些街道让人觉得很熟悉。"}]}],"synonyms":["acquaintance","casual acquaintance","familiar","known"],"phonetic":"/koʊ.noʊˈʃɛn.teɪ/","extraExplanation":["“conoscente”来自意大利语动词“conoscere”（认识、了解）。它在语感上通常比“amico”（朋友）更疏远，强调“认识/打过交道”而非亲密关系。","英语里最接近的常用对应词是“acquaintance”。如果你想表达“点头之交”，也可以用“a casual acquaintance”。"]}
{"word":"conoscenti","summary":{"en":"Conoscenti means people with expert knowledge and refined taste in a field, especially the arts.","zh":"Conoscenti 指某一领域（尤指艺术等）的内行/鉴赏家群体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who are knowledgeable about a particular subject (especially art, music, food, or fashion), often with refined taste.","zh":"（尤指艺术、音乐、美食或时尚等领域的）行家、鉴赏家、内行人士（常带有“品味高、懂门道”的含义）。"},"examples":[{"en":"The gallery’s opening night was full of art-world conoscenti.","zh":"画廊开幕之夜来了很多艺术圈的行家。"},{"en":"This small restaurant is famous among the local food conoscenti.","zh":"这家小餐馆在本地美食行家圈里很有名。"},{"en":"Her film was praised by critics and conoscenti alike.","zh":"她的电影同时受到影评人和内行人士的称赞。"}]}],"synonyms":["experts","connoisseurs","insiders","cognoscenti","authorities"],"phonetic":"/ˌkoʊnəˈʃɛn(t)i/","extraExplanation":["这是意大利语借词：conoscente（熟人/知情者），复数形式为 conoscenti。英语里通常把它当作复数名词使用，常搭配定冠词 the（the conoscenti）来表示“懂行的一群人”。","语气上常带一点“圈内人/懂品味的人”的感觉，有时也可能隐含“精英小圈子”的意味。写作中多见于艺术、文化评论与新闻报道。"]}
{"word":"conoscope","summary":{"en":"A conoscope is an optical instrument used to observe light interference patterns, especially in polarizing microscopy.","zh":"Conoscope（锥光镜）是一种用于观察光干涉图样的光学仪器，常用于偏光显微镜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an optical device (often used with a polarizing microscope) for observing interference patterns of light, especially to study crystals and other birefringent materials","zh":"锥光镜（常与偏光显微镜配合使用的光学装置），用于观察光的干涉图样，尤其用于研究晶体等双折射材料"},"examples":[{"en":"In mineralogy class, we used a conoscope to view interference figures in thin sections of minerals.","zh":"在矿物学课上，我们用锥光镜观察矿物薄片中的干涉图样。"},{"en":"The technician adjusted the polarizing microscope and inserted the conoscope to check the crystal’s optical properties.","zh":"技术员调整了偏光显微镜并加入锥光镜，以检查晶体的光学性质。"}]}],"synonyms":["interference microscope attachment","polarizing microscope accessory"],"phonetic":"/ˈkoʊnəˌskoʊp/","extraExplanation":["“Conoscope”由“cono-（锥形）”+“-scope（观察器）”构成，字面意思是“观察锥形光束的仪器”。它常见于偏光显微镜与晶体光学中，用来观察所谓的 interference figure（干涉图），以判断晶体的光轴、光性等特征。"]}
{"word":"conoscopic","summary":{"en":"Conoscopic means related to viewing interference patterns with convergent polarized light, especially in polarizing microscopy.","zh":"conoscopic 指与会聚偏振光观察干涉图（干涉图样）有关的，常用于偏光显微镜/光学矿物学。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a conoscope or to the observation of interference patterns (interference figures) produced by convergent polarized light, especially in optical mineralogy and microscopy.","zh":"与锥光镜（conoscope）有关的；指利用会聚偏振光观察干涉图样（干涉图）的，常用于光学矿物学与显微镜观察。"},"examples":[{"en":"In the polarizing microscope, we switched to conoscopic mode to view the crystal’s interference figure.","zh":"在偏光显微镜下，我们切换到锥光观察（conoscopic）模式来查看晶体的干涉图。"},{"en":"Conoscopic observation can help determine whether a mineral is uniaxial or biaxial.","zh":"锥光观察（conoscopic）可以帮助判断矿物是单轴晶还是双轴晶。"}]}],"synonyms":["interference-figure (related)"],"phonetic":"ˌkɑnəˈskɑpɪk","extraExplanation":["“Conoscopic”常见于地质/材料相关课程与论文，尤其是偏光显微镜（polarizing microscope）里与“orthoscopic（正交光/平行光观察）”相对：orthoscopic多看晶体的外观与颜色等整体特征；conoscopic则用会聚光在后焦面形成干涉图，用来推断晶体的光性（如单轴/双轴、光轴方向等）。","词源上来自希腊语词根：cono-（圆锥）+ -scopic（观察的），字面意思就是“用圆锥形光束来观察”。"]}
{"word":"conourish","summary":{"en":"“Conourish” is not standard English; you likely mean “nourish” or “cherish.”","zh":"“conourish”不是标准英语词；你可能想写“nourish（滋养/培养）”或“cherish（珍爱/珍惜）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling of “nourish” (to feed and help something grow) or possibly “cherish” (to love and protect).","zh":"不是标准英语单词。很可能是拼写错误，原意可能是 “nourish”（滋养、培养）或 “cherish”（珍爱、爱护）。"},"examples":[{"en":"I can’t find “conourish” in standard dictionaries; did you mean “nourish”?","zh":"在常见词典里找不到 “conourish”；你是不是想写 “nourish”？"},{"en":"Good food and sleep help nourish the body.","zh":"好的食物和睡眠能滋养身体。"},{"en":"She cherishes her friendships.","zh":"她珍惜自己的友谊。"}]}],"extraExplanation":["“nourish”更偏“提供营养/促进成长”（既可指身体，也可指精神：nourish confidence/hope）。\n“cherish”更偏“珍爱、爱护、珍惜”（多用于感情、人、回忆、机会等）。\n如果你把原句发我（包含前后文），我可以帮你确定你想表达的是哪一个词，并给出更地道的改写。"]}
{"word":"Conover","summary":{"en":"Conover is most commonly a surname, and it can also be the name of certain places in the U.S.","zh":"Conover 最常见是姓氏，也可作美国部分地区的地名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname) used for people; also used as a given name in some cases","zh":"康诺弗（姓氏；有时也用作名字）"},"examples":[{"en":"Barbara Conover is my coworker.","zh":"芭芭拉·康诺弗是我的同事。"},{"en":"I met Mr. Conover at the conference.","zh":"我在会议上见到了康诺弗先生。"}]},{"partOfSpeech":"other","definition":{"en":"a place name (proper noun), used for some towns/areas in the United States","zh":"康诺弗（地名；美国一些城镇/地区的名称）"},"examples":[{"en":"They drove through Conover on the way to Hickory.","zh":"他们去希科里（Hickory）的路上经过了康诺弗（Conover）。"},{"en":"Conover, North Carolina is a small city in Catawba County.","zh":"北卡罗来纳州的康诺弗（Conover）是卡托巴县的一个小城市。"}]}],"phonetic":"/ˈkɑnˌoʊvɚ/","extraExplanation":["“Conover”通常是专有名词，因此在句子里一般要大写。作为姓氏时，常见搭配是 Mr./Ms. Conover（康诺弗先生/女士）或 the Conovers（康诺弗一家）。","读音在不同家庭/地区可能略有差异，但在美式英语中多读作重音在第一音节。"]}
{"word":"Conowingo","summary":{"en":"Conowingo usually refers to a place in northeastern Maryland or to the nearby Conowingo Dam on the Susquehanna River.","zh":"Conowingo通常指美国马里兰州东北部的地名，或指苏斯奎哈纳河上的科诺温戈大坝。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a small community and area in northeastern Maryland, USA, on the Susquehanna River, best known for the Conowingo Dam.","zh":"美国马里兰州东北部苏斯奎哈纳河畔的一个小社区与地区，因“科诺温戈大坝（Conowingo Dam）”而最出名。"},"examples":[{"en":"We stopped near Conowingo to watch birds along the Susquehanna River.","zh":"我们在科诺温戈附近停下来看苏斯奎哈纳河边的鸟。"},{"en":"Conowingo is famous for winter eagle watching near the dam.","zh":"科诺温戈因大坝附近的冬季观鹰活动而闻名。"}]},{"partOfSpeech":"other","definition":{"en":"the Conowingo Dam, a large hydroelectric dam on the Susquehanna River near the Maryland–Pennsylvania border.","zh":"科诺温戈大坝：位于苏斯奎哈纳河上、靠近马里兰州与宾夕法尼亚州交界处的一座大型水力发电大坝。"},"examples":[{"en":"The Conowingo Dam generates electricity for the region.","zh":"科诺温戈大坝为该地区发电。"},{"en":"Many photographers visit Conowingo Dam to capture bald eagles in flight.","zh":"许多摄影师会去科诺温戈大坝拍摄飞翔中的白头海雕。"}]}],"synonyms":["Conowingo Dam","Conowingo, Maryland"],"phonetic":"/ˌkɑːnəˈwɪŋɡoʊ/","extraExplanation":["“Conowingo”是专有名词（地名/设施名），日常英语里通常不翻译，只在中文里音译为“科诺温戈”。","它常与自然生态与观鸟文化联系在一起，尤其是白头海雕（bald eagle）摄影与观赏。","名称一般认为源自当地原住民语言传统；在写作或报道中常与“Susquehanna River（苏斯奎哈纳河）”“hydroelectric（水力发电）”等词搭配出现。"]}
{"word":"Conoy","summary":{"en":"Conoy is the name of a Native American people historically associated with the Potomac River area, often linked with the Piscataway.","zh":"Conoy 指历史上与波托马克河流域相关的美洲原住民群体名称，常与 Piscataway（皮斯卡塔韦）有关联。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Native American people historically living along the Potomac River (in what is now Maryland and Virginia); the name is often used for or connected with the Piscataway people.","zh":"康诺伊族：历史上居住在波托马克河流域（今马里兰州与弗吉尼亚州一带）的美洲原住民群体；该名称常与皮斯卡塔韦族（Piscataway）相关或被交替使用。"},"examples":[{"en":"The Conoy lived in the Chesapeake Bay region before and during early European colonization.","zh":"在欧洲殖民初期前后，康诺伊族生活在切萨皮克湾地区。"},{"en":"Some historical records refer to the group as Conoy, while others use Piscataway.","zh":"一些历史文献称其为康诺伊族，而另一些则使用皮斯卡塔韦族这一名称。"}]}],"synonyms":["Piscataway (often related/overlapping in usage)"],"phonetic":"/ˈkoʊnɔɪ/","extraExplanation":["“Conoy”多见于历史与人类学语境，属于族名/人群名称；在不同年代与不同文献中，拼写与指代范围可能不完全一致。阅读相关资料时，可留意作者是否把Conoy当作Piscataway的别称、分支，或是同一联盟内不同群体的称呼。"]}
{"word":"conoy","summary":{"en":"Conoy most commonly refers to a Native American people historically along the lower Potomac River (often linked with the Piscataway). It can also be a U.S. place name, such as Conoy Township, Pennsylvania.","zh":"Conoy 通常指历史上生活在波托马克河下游一带的美洲原住民（常与皮斯卡塔韦人相关/重叠）；也可作美国地名，如宾夕法尼亚州的科诺伊镇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Native American people (and their language) historically living along the lower Potomac River in what is now Maryland; often treated as the same group as, or closely related to, the Piscataway.","zh":"科诺伊人：历史上居住在今马里兰州波托马克河下游一带的美洲原住民族群（及其语言）；常被视为与皮斯卡塔韦人同一群体或关系密切。"},"examples":[{"en":"The Conoy lived along the Potomac River and traded with neighboring tribes.","zh":"科诺伊人曾居住在波托马克河沿岸，并与周边部族进行贸易。"},{"en":"Some sources describe the Conoy as part of the Piscataway communities.","zh":"一些资料把科诺伊人描述为皮斯卡塔韦社群的一部分。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name (proper noun), especially Conoy Township in Pennsylvania, USA.","zh":"（专有名词）地名：美国的“Conoy”，尤其指宾夕法尼亚州的科诺伊镇（Conoy Township）。"},"examples":[{"en":"She moved to Conoy Township for a quieter life near the river.","zh":"她搬到科诺伊镇，想在河边过更安静的生活。"}]}],"synonyms":["Piscataway","Conoy Indians"],"phonetic":"/ˈkoʊnɔɪ/","extraExplanation":["“Conoy”常见于历史与民族志文献，指波托马克河流域的原住民群体。不同文献可能用“Conoy”“Kanawha/Canoy”等不同拼写，且与“Piscataway（皮斯卡塔韦）”的关系在分类上常有重叠。","如果你是想查一个普通英语单词，可能是拼写误差：常见近形词有“convoy（护送车队）”“conroy（姓氏）”。你可以告诉我你的句子或语境，我能帮你确认。"]}

