{"word":"conubium","summary":{"en":"Conubium is a rare word meaning the legal right to marry (especially in Roman law), and by extension a lawful marriage or close union.","zh":"Conubium 是个较少见的词，主要指（尤指古罗马法中的）结婚的法律权利/资格，也可引申为合法婚姻或紧密结合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the legal right or capacity to marry (especially in ancient Roman law); a lawful marriage union","zh":"（尤指古罗马法中的）结婚的法律权利/资格；合法婚姻关系"},"examples":[{"en":"In Roman law, conubium determined whether a marriage was legally recognized.","zh":"在古罗马法中，conubium 决定一段婚姻是否被法律承认。"},{"en":"Without conubium, their union could be treated as informal rather than a legal marriage.","zh":"如果没有 conubium，他们的结合可能被视为非正式关系，而非合法婚姻。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative or rare) a close union or alliance, especially between groups","zh":"（引申/少见）紧密的结合或联盟（尤指群体之间）"},"examples":[{"en":"The writer described the cultural conubium of two communities living side by side.","zh":"作者把两个相邻而居的社群的文化融合称作 conubium。"}]}],"synonyms":["right to marry","legal marriage","matrimony","marriage (legal)","union"],"phonetic":"/kəˈnuːbiəm/","extraExplanation":["这个词来自拉丁语 conubium，常见于历史、法律或古典研究语境。它在古罗马社会里与“公民身份、婚姻合法性、子女身份继承”等问题紧密相关：并非所有人都自动拥有 conubium，不同阶层或不同城邦之间的通婚权可能受到限制。"]}
{"word":"Conularia","summary":{"en":"Conularia is an extinct marine fossil genus with a distinctive cone/pyramid-shaped shell.","zh":"Conularia 是一种已灭绝的海洋化石属，以锥形/金字塔形外壳为特征。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extinct genus of marine animals known only from fossils, with a distinctive cone- or pyramid-shaped shell; commonly called a conulariid.","zh":"一种已灭绝的海洋动物属（仅见于化石），具有明显的锥形或金字塔形外壳；常被称为“锥形壳类（conulariid）”。"},"examples":[{"en":"The museum’s Ordovician display includes a Conularia fossil with clear ridges along its shell.","zh":"博物馆的奥陶纪展区里有一块 Conularia 化石，外壳上的棱纹很清晰。"},{"en":"In paleontology class, we learned that Conularia is known from its distinctive cone-shaped remains.","zh":"在古生物学课上，我们了解到 Conularia 主要因其独特的锥形遗骸而为人所知。"}]}],"synonyms":["conulariid"],"phonetic":"/ˌkɑn.jəˈlɛri.ə/","extraExplanation":["“Conularia”多见于古生物学与地质学语境，指一类生活在古生代海洋中的生物化石。它们常呈四棱锥或锥形外壳，表面有纵向或横向纹饰，因此在化石中相对容易辨认。","关于它们“到底属于哪一大类动物”的位置，学界历史上有过不同看法；许多资料把它们与刺胞动物（如水母类）联系起来，但在科普与课堂里通常把重点放在它们的化石外形特征与地层年代上。"]}
{"word":"conularia","summary":{"en":"Conularia (conularia) is an extinct marine fossil animal, known for its four-sided cone-shaped shell.","zh":"Conularia（conularia）指一种已灭绝的海洋化石动物，以四棱锥形外壳为典型特征。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extinct marine animal known only from fossils; a member of the conulariids (genus Conularia), typically with a four-sided, cone-shaped protective shell.","zh":"一种已灭绝的海洋动物，只能从化石中得知；属于锥形化石动物（如锥形螺属 Conularia），通常具有四棱的锥形外壳（保护结构）。"},"examples":[{"en":"Conularia fossils are often found in Paleozoic rocks.","zh":"锥形螺（Conularia）的化石常见于古生代岩层中。"},{"en":"The specimen’s four-sided shell suggests it may be a conularia.","zh":"这个标本的四棱外壳表明它可能属于锥形螺（conularia）。"}]}],"synonyms":["Conularia (genus)","conulariid"],"phonetic":"/ˌkɑn.jəˈlɛr.i.ə/","extraExplanation":["“conularia / Conularia”多用于古生物学与地质学语境，日常英语中很少见。词根来自拉丁语 conulus（“小圆锥”），指它典型的锥形外壳外观。","关于它在生物分类上的位置，科学界曾有不同观点；常见的科普说法是它可能与刺胞动物（如水母类）有亲缘关系，但具体归属仍以不同研究为准。"]}
{"word":"conule","summary":{"en":"Conule means a small cone-shaped structure, mainly used in scientific descriptions.","zh":"Conule 指“小锥状结构/小圆锥体”，主要用于科学描述。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small cone-shaped structure; a tiny cone (often used in biology/anatomy).","zh":"小圆锥体；小锥状结构（常用于生物学/解剖学语境）。"},"examples":[{"en":"Under the microscope, the sponge’s surface is covered with tiny conules.","zh":"在显微镜下，这种海绵的表面布满了微小的锥状突起（conules）。"},{"en":"The shell has small conules along the ridge.","zh":"贝壳的脊部有一些小锥状突起。"}]}],"synonyms":["small cone","conelet","conical projection"],"phonetic":"/ˈkoʊnjuːl/","extraExplanation":["“Conule”在日常英语里很少见，更常见于生物学（尤其是海绵等无脊椎动物的形态描述）或解剖学文章中，表示“锥形的小突起/小结构”。","词源上与拉丁语中表示“圆锥”的词根有关；可以把它理解为“cone（圆锥）+ -ule（小……）”，即“一个小圆锥”。"]}
{"word":"conumerary","summary":{"en":"“Supernumerary” means extra—more than the required number; it can also mean an extra person, especially an additional worker or a non-speaking performer.","zh":"“Supernumerary”表示“超出规定数量的、额外的”；也可指“编外人员/额外人员”，尤其是额外雇员或无台词群演。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Extra; more than the usual or required number (often used for people in a group).","zh":"超出编制的；额外的；人数（或数量）超过通常或规定的（常指人员）。"},"examples":[{"en":"The hospital hired a few supernumerary nurses during flu season.","zh":"流感季节医院额外雇了几名编外护士。"},{"en":"There were supernumerary staff at the event, so some had no specific tasks.","zh":"活动现场工作人员超编，所以有些人没有具体任务。"}]},{"partOfSpeech":"n.","definition":{"en":"An extra person who is not part of the main group, especially in a job or a performance (such as an opera or film).","zh":"编外人员；额外人员（尤指工作单位中的编外岗位，或歌剧/电影中的群众演员等）。"},"examples":[{"en":"He started as a supernumerary in the opera, standing silently in the crowd scenes.","zh":"他从歌剧里的群众演员做起，在群戏里安静地站着。"},{"en":"The company kept a supernumerary on the team to cover sick days.","zh":"公司在团队里留了一名编外人员，用来顶替病假。"}]}],"synonyms":["extra","additional","spare","excess","surplus"],"phonetic":"/ˌsuːpərˈnuːməˌreri/","extraExplanation":["你输入的“conumerary”不是常见英语单词；很可能想写的是 supernumerary。它来自拉丁语：super-（在上、超出）+ numerus（数字/数量），字面意思就是“超过数量的”。","在英式英语里，supernumerary 常用于“编外人员/超编岗位”（如 supernumerary police officer）；在表演艺术中也指“无台词的群演/跑龙套”（有时简写为 super）。"]}
{"word":"conumerous","summary":{"en":"“Conumerous” isn’t a standard word; you probably mean “numerous,” meaning “many.”","zh":"“conumerous” 不是标准单词；你可能想写 “numerous”，意思是“许多的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “numerous.”","zh":"这不是标准英语单词，很可能是把 “numerous” 拼错了。"},"examples":[{"en":"I couldn’t find “conumerous” in the dictionary—did you mean “numerous”?","zh":"我在词典里找不到 “conumerous”，你是不是想写 “numerous”？"}]},{"partOfSpeech":"adj.","definition":{"en":"Many; a large number of.","zh":"许多的；数量很多的。"},"examples":[{"en":"She has numerous friends in the city.","zh":"她在这座城市里有很多朋友。"},{"en":"Numerous studies show that sleep is important.","zh":"大量研究表明睡眠很重要。"}]}],"synonyms":["many","countless","plentiful","abundant","a large number of"],"phonetic":"/ˈnuːmərəs/","extraExplanation":["“Numerous”更正式一些，常见于写作和新闻：numerous reasons / numerous problems / numerous studies。","口语里也可以用更常见的替换：many（一般）、a lot of（口语）、tons of（更口语、夸张）。"]}
{"word":"conundrum","summary":{"en":"Conundrum means a confusing, hard-to-solve problem or dilemma; less commonly, it can mean a riddle.","zh":"Conundrum 指令人困惑、难以解决的难题或两难处境；较少情况下也可指谜语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A confusing and difficult problem or situation that is hard to solve.","zh":"令人困惑且难以解决的问题或处境。"},"examples":[{"en":"Choosing between two good job offers was a real conundrum for her.","zh":"在两份都很好的工作邀约之间做选择对她来说真是个难题。"},{"en":"We faced a conundrum: save money now or invest for the future.","zh":"我们遇到一个两难：现在省钱还是为未来投资。"}]},{"partOfSpeech":"n.","definition":{"en":"A riddle or puzzle, often with a clever or tricky answer. (Less common today.)","zh":"谜语或智力题（常带机智或刁钻的答案；如今较少用）。"},"examples":[{"en":"The old book included a conundrum with a surprising answer.","zh":"那本旧书里有一道谜语，答案出人意料。"}]}],"synonyms":["dilemma","predicament","puzzle","quandary"],"phonetic":"/kəˈnʌndrəm/","extraExplanation":["“conundrum”最常见的语境是日常或职场里的“棘手难题/两难处境”。它比“problem”更强调“让人左右为难、难以抉择或没有明显解法”的感觉。","词源并不完全确定；在英语里它曾与“riddle（谜语）”的含义相近，但现代英语里更常用来指“难题/困境”。","常见搭配：a real conundrum（真是个难题）；pose/present a conundrum（提出/带来难题）；face a conundrum（面对难题）。"]}
{"word":"conundrumize","summary":{"en":"A rare, informal verb meaning “to make something into a confusing problem or puzzle.”","zh":"一个罕见的非正式动词，表示“把事情弄成让人困惑的难题/谜题”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare, informal) To turn something into a conundrum; to make it confusing or difficult to solve (often used humorously).","zh":"（罕见，非正式）把某事变成“难题/谜题”；让事情变得更复杂、更难弄明白（常带幽默语气）。"},"examples":[{"en":"Don’t conundrumize a simple question—just answer yes or no.","zh":"别把一个简单的问题“难题化”——直接回答是或不是就行。"},{"en":"The new rules conundrumized the process for everyone.","zh":"新规定把流程搞得更复杂，让大家都更难操作。"}]}],"synonyms":["complicate","confuse","make into a conundrum","muddle","overcomplicate"],"phonetic":"/kəˈnʌndrəmˌaɪz/","extraExplanation":["“conundrumize”不是常见标准词，更像是把名词 conundrum（难题、谜）加上动词后缀 -ize 临时造出来的词，意思是“使……变得像难题一样”。在写作或口语里常用于夸张、吐槽或开玩笑的语境。更自然的表达通常是：complicate（使复杂化）、confuse（使困惑）、turn into a conundrum（变成难题）。"]}
{"word":"conundrums","summary":{"en":"“Conundrums” is the plural of “conundrum,” meaning difficult, confusing problems or puzzles.","zh":"“conundrums”是“conundrum”的复数，指“令人困惑的难题或谜题”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A difficult problem or question that is confusing and may not have a clear answer; a puzzle.","zh":"难题；谜题（令人困惑、往往没有明确答案的问题）。"},"examples":[{"en":"Choosing between two good job offers is a conundrum.","zh":"在两份都不错的工作邀约之间做选择是个难题。"},{"en":"The story begins with a conundrum: who is telling the truth?","zh":"故事以一个谜题开场：到底谁在说真话？"}]}],"synonyms":["puzzle","riddle","dilemma","problem","quandary"],"phonetic":"/kəˈnʌn.drəm/","extraExplanation":["“conundrum”常用于描述“进退两难”的情况，类似于“dilemma”，但语气更强调“令人困惑、像谜一样难想清楚”。","在文学或推理作品中，它常指需要读者/角色去解开的“谜团”。"]}
{"word":"conurbation","summary":{"en":"A conurbation is a continuous urban area created when nearby towns or cities expand and merge.","zh":"conurbation 指邻近城镇或城市扩张并连成一片的连续都市区（城市群）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large urban area formed when nearby towns or cities grow and join together into one continuous built-up region","zh":"（由邻近城镇或城市扩张并连成一片的）城市群；连绵都市区"},"examples":[{"en":"The Greater London conurbation includes many smaller towns that have grown together over time.","zh":"大伦敦城市群包括许多随着时间发展而逐渐连成一体的小城镇。"},{"en":"Traffic and housing policy are often planned at the level of the conurbation, not just one city.","zh":"交通和住房政策常常以城市群为单位来规划，而不只是针对某一座城市。"}]}],"synonyms":["urban area","built-up area","metropolitan area","megalopolis"],"phonetic":"/kɑnˌɝː.bəˈreɪ.ʃən/","extraExplanation":["“conurbation”常用于城市规划、地理与新闻写作，语气较正式。它强调“原本分开的城镇/城市因为扩张而连接成连续建成区”。","词源可拆为 con-（共同、一起）+ urban（城市的）+ -ation（名词后缀），字面意思就是“共同城市化的结果”。","常见搭配：a major/large conurbation（大型城市群）；the conurbation of A and B（A与B连成的都市区）。与“metropolitan area（都会区）”相比，conurbation更强调“城市带连成一片”的形态特征。"]}
{"word":"conurbations","summary":{"en":"Conurbations are large continuous urban regions created when nearby cities or towns expand and join together.","zh":"conurbations 指相邻城镇或城市扩张后连接成片的连续城市建成区（城市群/大都市区）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large urban area formed when several towns or cities grow and merge into one continuous built-up region.","zh":"（由多个城镇或城市扩张后）连成一片的“大都市区/城市群”，形成连续的城市建成区。"},"examples":[{"en":"The Greater Tokyo Area is one of the world’s biggest conurbations.","zh":"东京都市圈是世界上最大的城市群之一。"},{"en":"Jobs and transport links often pull people toward conurbations.","zh":"就业机会和交通连接常常吸引人们流向大都市区。"},{"en":"Housing costs can rise quickly in large conurbations.","zh":"在大型城市群里，住房成本可能上涨得很快。"}]}],"synonyms":["urban area","continuous urban area","built-up area","metropolitan region","city cluster"],"phonetic":"/ˌkɑn.ɚˈbeɪ.ʃənz/","extraExplanation":["“Conurbation”常用于地理、城市规划与新闻报道，强调“多个城市连成一片”的现象，而不只是单一城市本身。","词源上可拆解理解：con-（一起）+ urban（城市的）+ -ation（名词后缀），直观表达“城市聚合/连城”。","与相关词的区别：metropolitan area（都会区/大都会圈，范围可能更广，含郊区与通勤圈）；urban sprawl（城市蔓延，强调无序扩张）；megacity（特大城市，强调人口规模，通常指单一城市）。"]}
{"word":"conure","summary":{"en":"A conure is a small or medium-sized, often colorful parrot, commonly kept as a pet.","zh":"conure 指一种中小型、常色彩鲜艳的鹦鹉，常被当作宠物饲养。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small to medium-sized parrot, often brightly colored, commonly kept as a pet (especially in the Americas).","zh":"一种中小型鹦鹉，羽色常很鲜艳，常被当作宠物饲养（尤其在美洲常见）。"},"examples":[{"en":"My friend has a green-cheeked conure that loves to whistle.","zh":"我朋友养了一只绿颊锥尾鹦鹉，很喜欢吹口哨。"},{"en":"Conures can be noisy, so they may not be the best pet for a quiet apartment.","zh":"锥尾鹦鹉可能会很吵，所以不一定适合安静的公寓。"}]}],"synonyms":["parrot","parakeet"],"phonetic":"/ˈkɑn.jʊr/","extraExplanation":["“conure”是鸟类爱好者和宠物市场里很常见的名称，多指南美洲、 中美洲一些体型较小的鹦鹉。常见的宠物种类包括 green-cheeked conure（绿颊锥尾鹦鹉）、sun conure（太阳锥尾鹦鹉）等。","拼写提示：conure 读音里有“yur”（/ˈkɑn.jʊr/）的感觉，注意不是 *conjure*（施魔法/变出）。"]}
{"word":"Conuropsis","summary":{"en":"Conuropsis is a scientific genus name best known for the extinct Carolina parakeet.","zh":"Conuropsis 是一个科学属名，最知名的是已灭绝的卡罗来纳长尾鹦鹉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus name for an extinct type of parakeet; it is best known for the Carolina parakeet (Conuropsis carolinensis).","zh":"（生物）一种已灭绝的长尾鹦鹉属名；最著名的成员是卡罗来纳长尾鹦鹉（Conuropsis carolinensis）。"},"examples":[{"en":"Conuropsis is the genus that includes the extinct Carolina parakeet.","zh":"Conuropsis 是包含已灭绝的卡罗来纳长尾鹦鹉的属。"},{"en":"Scientists study museum specimens of Conuropsis to learn about extinction and habitat loss.","zh":"科学家研究 Conuropsis 的博物馆标本，以了解灭绝与栖息地丧失。"}]}],"synonyms":["Carolina parakeet (Conuropsis carolinensis)","(taxonomic) genus name"],"phonetic":"/kəˈnʊrəpsɪs/","extraExplanation":["Conuropsis 是拉丁化的学名（属名），常见于学术文章、博物馆标签与自然史写作中，日常英语里很少单独使用。","该属最常被提及的物种是 Carolina parakeet（卡罗来纳长尾鹦鹉），曾分布于美国东部，20 世纪初灭绝；它常被用作讨论人类活动、森林砍伐与捕猎如何导致物种消失的案例。","词形中常见后缀 -opsis 有“外观、类似……的样子”之意，属于科学命名中常见的构词方式。"]}
{"word":"conuropsis","summary":{"en":"Conuropsis is the scientific genus name for an extinct North American parakeet, including the Carolina parakeet.","zh":"Conuropsis 是一种已灭绝的北美长尾鹦鹉的属名，包括卡罗来纳长尾鹦鹉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific genus name for an extinct North American parakeet; it includes the Carolina parakeet (Conuropsis carolinensis).","zh":"（生物）一种已灭绝的北美长尾鹦鹉属名；其中包括卡罗来纳长尾鹦鹉（Conuropsis carolinensis）。"},"examples":[{"en":"Conuropsis is best known because it includes the Carolina parakeet, a species that went extinct in the early 1900s.","zh":"Conuropsis 之所以有名，主要因为它包括卡罗来纳长尾鹦鹉——一种在20世纪初灭绝的物种。"},{"en":"Scientists still discuss why Conuropsis disappeared, pointing to habitat loss and hunting.","zh":"科学家至今仍在讨论 Conuropsis 消失的原因，常提到栖息地丧失和捕猎。"}]}],"synonyms":["Carolina parakeet (as the best-known member of the genus)"],"phonetic":"/kəˌnʊəˈrɑːpsɪs/","extraExplanation":["Conuropsis 是拉丁化的学名（属名），通常出现在生物学、博物馆展牌或学术写作里；日常英语里人们更常说 “Carolina parakeet（卡罗来纳长尾鹦鹉）”。","拼写提示：这是专名，首字母常写大写（Conuropsis）。在生物分类里，属名用斜体书写更规范（Conuropsis），物种名则是属名+种加词（Conuropsis carolinensis）。"]}
{"word":"Conurus","summary":{"en":"Conurus is an old scientific genus name for some conures (parakeets), largely replaced by newer classifications.","zh":"Conurus 是锥尾鹦鹉等一些鹦鹉的旧科学属名，如今多已被较新的分类所取代。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology) A former scientific genus name for certain small-to-medium parrots (conures), now mostly classified under other genera such as Aratinga or Psittacara.","zh":"（动物学）某些中小型鹦鹉（锥尾鹦鹉/小葵花类的一支）的旧属名；如今多已改归入其他属，如 Aratinga 或 Psittacara。"},"examples":[{"en":"In older bird books, the sun conure was sometimes listed under the genus Conurus.","zh":"在较早的鸟类书籍里，太阳锥尾鹦鹉有时会被列在 Conurus 这个属名下。"},{"en":"Modern taxonomy no longer uses Conurus for most living species.","zh":"现代分类学对大多数现存物种已不再使用 Conurus 这个属名。"}]}],"synonyms":["conure","parakeet","Aratinga","Psittacara"],"phonetic":"/kəˈnʊrəs/","extraExplanation":["Conurus 常见于较旧的动物分类文献中；如果你在博物馆标签、老式鸟类图鉴或学术旧文里看到它，通常表示“锥尾鹦鹉/Conure 一类”的旧分类。","英语常用名 conure（锥尾鹦鹉）与 Conurus 有渊源：conure 这个词就是从该拉丁化学名演变而来。"]}
{"word":"conurus","summary":{"en":"Conurus is an outdated genus name for some parrots; today people usually say “conure,” and scientists use other genus names.","zh":"Conurus 是一些鹦鹉的旧属名；如今更常用通俗名 conure，学术分类也多改用其他属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former scientific genus name for certain small-to-medium parrots (now usually classified in other genera, such as Aratinga); related to the common name conure.","zh":"（旧）某些中小型鹦鹉的属名（旧分类），现在多已并入其他属（如 Aratinga）；与常见名 conure（锥尾鹦鹉/长尾鹦鹉）有关。"},"examples":[{"en":"In older bird books, some parakeets were listed under the genus Conurus.","zh":"在较早的鸟类书籍中，一些长尾鹦鹉曾被归入 Conurus 属。"},{"en":"Modern taxonomy no longer uses Conurus for most species; many are now placed in Aratinga.","zh":"现代分类学多数情况下不再使用 Conurus；很多物种现在归入 Aratinga 属。"}]}],"synonyms":["conure","parakeet"],"phonetic":"/kəˈnʊrəs/","extraExplanation":["“Conurus”属于较旧的鸟类分类用法，今天在日常英语里更常见的是“conure”（锥尾鹦鹉/长尾鹦鹉）这个通俗名称。","词源常被解释为来自希腊语：kōnos（锥形）+ oura（尾巴），指这类鹦鹉较尖长、呈“锥形感”的尾羽。"]}
{"word":"CONUS","summary":{"en":"CONUS means the Continental United States (the adjoining 48 states + Washington, D.C.).","zh":"CONUS指“美国本土”，即相连的48州加华盛顿特区。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(U.S. acronym) the Continental United States: the 48 adjoining states and Washington, D.C., not including Alaska, Hawaii, or U.S. territories.","zh":"（美国缩写）美国本土（CONUS）：指相连的48个州和华盛顿特区，不包括阿拉斯加、夏威夷及美国海外领地。"},"examples":[{"en":"This shipping rate applies to CONUS addresses only.","zh":"此运费仅适用于美国本土（CONUS）地址。"},{"en":"He was reassigned from overseas to a CONUS base.","zh":"他从海外被调回美国本土（CONUS）的基地。"},{"en":"Delivery is free within CONUS, but extra fees apply to Alaska and Hawaii.","zh":"美国本土（CONUS）内免运费，但阿拉斯加和夏威夷需额外收费。"}]}],"synonyms":["continental U.S.","the continental United States","the Lower 48 (informal)"],"phonetic":"ˈkoʊnəs","extraExplanation":["CONUS常见于军队、政府公文、物流与电商条款中，用来区分“美国本土”与海外/外派地区。","与CONUS相对的常见缩写是OCONUS（Outside the Continental United States，指美国本土以外地区，如阿拉斯加、夏威夷、关岛、海外基地等）。","口语里人们有时会说“the Lower 48（本土48州）”，但它不包含华盛顿特区；CONUS通常包含D.C.。"]}
{"word":"conus","summary":{"en":"CONUS means the continental U.S.—the 48 adjoining states.","zh":"CONUS 指美国本土大陆地区，即相连的48个州。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the continental United States: the 48 adjoining U.S. states (not including Alaska, Hawaii, or U.S. territories)","zh":"美国本土（大陆）地区：指相连的48个州（不包括阿拉斯加、夏威夷以及美国海外领地）"},"examples":[{"en":"He is stationed in CONUS this year, not overseas.","zh":"他今年驻扎在美国本土，不在海外。"},{"en":"Shipping is cheaper within CONUS than to Hawaii.","zh":"在美国本土范围内运输比寄到夏威夷更便宜。"},{"en":"This discount applies to CONUS orders only.","zh":"此折扣仅适用于美国本土订单。"}]}],"synonyms":["continental United States","the contiguous U.S.","the Lower 48 (informal)"],"phonetic":"/ˈkoʊnəs/","extraExplanation":["CONUS 是 “Continental United States” 的缩写，常见于美国军方、政府文件、物流/电商运费说明等场景。","常与 OCONUS（Outside the Continental United States，美国本土以外）对比使用；OCONUS 通常包括阿拉斯加、夏威夷、波多黎各、关岛等地区以及海外驻地。","口语中有人也会说 “the Lower 48”（本土48州），含义接近，但更偏非正式表达。"]}
{"word":"conusable","summary":{"en":"“Conusable” is not standard; the correct word is usually “confusable,” meaning “easy to mix up.”","zh":"“conusable”不是标准拼写；通常应为“confusable”，意思是“容易混淆的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Not standard) Usually a misspelling of “confusable.”","zh":"（非标准用法）通常是“confusable”的拼写错误。"},"examples":[{"en":"“Conusable” is not commonly used in dictionaries; you probably mean “confusable.”","zh":"“conusable”在词典中不常见；你可能想写“confusable”。"}]},{"partOfSpeech":"adj.","definition":{"en":"Able to be easily confused with something else; similar enough that people may mistake one for the other.","zh":"容易与其他事物混淆的；相似到让人可能把一个误认为另一个。"},"examples":[{"en":"The letters O and 0 are confusable in some fonts.","zh":"在某些字体里，字母 O 和数字 0 很容易混淆。"},{"en":"These two words are confusable for learners because they sound alike.","zh":"这两个词对学习者来说容易混淆，因为它们听起来很像。"},{"en":"The app warns you about confusable characters in passwords.","zh":"这个应用会提醒你密码里有容易混淆的字符。"}]}],"synonyms":["confusing","similar-looking","easily mistaken"],"phonetic":"/kənˈfjuzəbəl/","extraExplanation":["“confusable”常见于语言学习、排版/字体设计、网络安全等语境：例如“confusable letters/characters（易混淆的字母/字符）”。","相关词：confuse（使困惑/混淆）、confusion（混乱）、confusing（令人困惑的）。","在拼写上，confusable 来自 confuse + -able（“可以被……的/容易……”），表示“容易被混淆的”。"]}
{"word":"conusance","summary":{"en":"Conusance is a formal, old-fashioned word meaning either (1) legal jurisdiction or (2) knowledge/awareness (similar to “cognizance”).","zh":"Conusance 是一个正式且较古旧的词，主要指（1）法律上的管辖权，或（2）对某事的知晓/意识到（近似 cognizance）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Law, formal/archaic) The authority of a court or person to deal with a matter; jurisdiction.","zh":"（法律，正式/古旧）对某事进行审理或处理的权限；司法管辖权。"},"examples":[{"en":"The statute grants the tribunal conusance over disputes between employers and employees.","zh":"该法令授予仲裁机构对劳资纠纷的管辖权。"},{"en":"In older texts, you may see “court of conusance,” meaning a court with jurisdiction over a case.","zh":"在较旧的文本中，你可能会看到“court of conusance”，指对某案件有管辖权的法院。"}]},{"partOfSpeech":"n.","definition":{"en":"(Formal/archaic) Knowledge of something; awareness or notice.","zh":"（正式/古旧）对某事的知晓；意识到；获悉。"},"examples":[{"en":"The manager had no conusance of the error until the report was published.","zh":"直到报告发布前，经理都未察觉该错误。"},{"en":"Please bring this information to their conusance as soon as possible.","zh":"请尽快让他们知悉这条信息。"}]}],"synonyms":["cognizance","jurisdiction","authority","awareness","knowledge","notice"],"phonetic":"/ˈkɑːnjəzəns/","extraExplanation":["“conusance”是较古旧的拼写形式，与更常见的“cognizance”同源、意义高度重叠。在现代英语中多用“cognizance”，法律语境里也常直接用“jurisdiction”（管辖权）或“authority”（权限）。","词源上可追溯到中古法语/诺曼法语中表示“认识、知晓”的词形（类似 *conoissance*），因此既可表示“知晓”，也可在法律语境中引申为“受理/管辖某案的权力”。"]}
{"word":"conusant","summary":{"en":"A consonant is a non-vowel speech sound (and often the letter representing it). As an adjective, it can mean “related to consonants” or “in agreement.”","zh":"consonant 指“辅音”（以及常用来表示辅音的字母）；作形容词可表示“与辅音有关的”，也可表示“与……一致/和谐的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(noun) A speech sound made by blocking or narrowing the airflow in the mouth or throat, such as /t/, /s/, or /m/ (not a vowel). In writing, it also refers to a letter that usually represents such a sound.","zh":"（名词）辅音：发音时气流在口腔或咽喉处被阻挡或变窄而形成的语音，如 /t/、/s/、/m/（不是元音）。在书写中也指通常表示这种声音的字母。"},"examples":[{"en":"In English, “b” is a consonant and “a” is a vowel.","zh":"在英语里，“b”是辅音，“a”是元音。"},{"en":"The word “stop” begins with the consonant sound /s/.","zh":"单词“stop”以辅音音 /s/ 开头。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective) Related to or containing consonants; also, in a broader sense, in agreement or harmony with something.","zh":"（形容词）与辅音有关的；（更广义）与某事一致、和谐的。"},"examples":[{"en":"Try practicing consonant sounds like /θ/ and /ð/ slowly.","zh":"试着慢慢练习像 /θ/ 和 /ð/ 这样的辅音音。"},{"en":"Her actions were consonant with her values.","zh":"她的行为与她的价值观一致。"}]}],"synonyms":["nonvowel (sound)","agreement (adj. sense: consonance)","harmony (adj. sense)"],"phonetic":"/ˈkɑn.sə.nənt/","extraExplanation":["你输入的“conusant”应为拼写错误，正确拼写是 consonant。","在英语学习里常说“a consonant letter”与“a consonant sound”不完全一样：字母是书写符号，发音是语音。比如字母“c”在 cat 里发 /k/，在 city 里发 /s/。"]}
{"word":"conusee","summary":{"en":"A consignee is the person or company that receives a shipped delivery.","zh":"consignee 指运输到货后负责接收货物的个人或公司（收货人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the person or company that receives goods that are shipped (especially in business or international trade)","zh":"（尤指商贸/国际运输中）收货人；收货公司"},"examples":[{"en":"The consignee must sign for the shipment when it arrives.","zh":"货到时，收货人必须签收。"},{"en":"On the invoice, the consignee is listed as the buyer’s warehouse in Los Angeles.","zh":"在发票上，收货方填写的是买家位于洛杉矶的仓库。"}]}],"synonyms":["recipient","addressee"],"phonetic":"/ˌkɑn.səˈniː/","extraExplanation":["你输入的“conusee”很可能是拼写错误。最接近且常见的单词是 **consignee**（收货人）。在物流/贸易文件中常和 **consignor**（发货人）成对出现：consignor 发货给 consignee。","在提单（bill of lading, B/L）等单证里，consignee 一栏通常写最终收货方或其代理；不同贸易条款下，实际提货人有时也可能是“to order”（凭指示/凭背书提货）。"]}
{"word":"conuses","summary":{"en":"“Conuses” is a rare plural of “conus,” used mostly in scientific or medical contexts; in everyday English, “cones” is more common.","zh":"“conuses”是“conus”的少见复数形式，多用于医学或生物等学术语境；日常英语中更常用“cones”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “conus”: a cone-shaped structure, especially in anatomy (e.g., the end of the spinal cord) or biology (a cone snail in the genus Conus).","zh":"“conus”的复数：指圆锥状结构，尤用于解剖学（如脊髓末端的圆锥部）或生物学（指芋螺属 Conus 的圆锥螺）。"},"examples":[{"en":"In the report, the doctor noted that the conuses looked normal on the scan.","zh":"在报告中，医生指出扫描显示这些圆锥部结构看起来正常。"},{"en":"Some conuses (cone snails) have venom that can be dangerous to humans.","zh":"一些圆锥螺（芋螺属）带有毒液，可能对人类有危险。"}]}],"synonyms":["cones (general meaning)"],"phonetic":"ˈkoʊnəsɪz","extraExplanation":["“conuses”在日常英语里很少见；更常见的是用“cones”表示普通的“圆锥/甜筒”。","如果你想表达“使困惑”，你可能想写的是“confuses”（例如：This word confuses me. 这个词让我困惑）。","“Conus”在学术语境中常见：医学里有 conus medullaris（脊髓圆锥），生物学里 Conus 是一个属名（圆锥螺/芋螺属）。"]}
{"word":"conusor","summary":{"en":"Connoisseur means an expert who can appreciate and judge quality, especially in art, food, or wine.","zh":"Connoisseur 指“行家/鉴赏家”，尤指能欣赏并评判艺术、食物或葡萄酒等品质的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who knows a lot about a particular subject (especially art, food, wine, music, etc.) and can judge its quality.","zh":"行家；鉴赏家（对某一领域很懂，尤其是艺术、食物、葡萄酒、音乐等，能判断品质的人）。"},"examples":[{"en":"She’s a connoisseur of Italian wine and can explain the flavors clearly.","zh":"她是意大利葡萄酒的行家，能把风味讲得很清楚。"},{"en":"Only a true connoisseur would notice the small differences between these paintings.","zh":"只有真正的鉴赏家才会注意到这些画作之间的细微差别。"}]}],"synonyms":["expert","specialist","aficionado","enthusiast","authority"],"phonetic":"/ˌkɑnəˈsɝ/","extraExplanation":["你输入的“conusor”不是常见英文单词；最可能想写的是 connoisseur（行家/鉴赏家）。常见拼写错误包括把中间的 nn 或结尾 -sseur 写错。","connoisseur 来自法语，用在英文里常带有“懂行、品味好、会鉴别优劣”的语气，通常是褒义。","搭配很常见：a connoisseur of wine/coffee/art/cheese（……的鉴赏家/行家）。"]}
{"word":"conutrition","summary":{"en":"Conutrition (more often “co-nutrition”) is a rare technical word meaning shared or mutually supported nutrition, especially between organisms.","zh":"Conutrition（更常写作 co-nutrition）是少见的专业用词，指共同/互相支持的营养供给，常用于描述生物之间的协同营养。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare/technical term (often written “co-nutrition”) meaning nourishment or nutrient support that is shared or provided together—especially when two organisms or systems help feed each other or benefit from combined nutrition.","zh":"一个较少见/偏专业的词（常写作“co-nutrition”），指“共同营养/协同营养”——尤其用于描述两个生物或系统通过共享或互相提供营养而共同受益。"},"examples":[{"en":"In some lab studies, bacteria grow better through co-nutrition, exchanging nutrients that each one lacks.","zh":"在一些实验研究中，细菌会通过共同营养而生长得更好，彼此交换各自缺乏的营养物质。"},{"en":"The paper discusses co-nutrition between microbes living in the same environment.","zh":"这篇论文讨论了生活在同一环境中的微生物之间的协同营养关系。"}]}],"synonyms":["co-nutrition","mutual nutrition","nutritional support"],"phonetic":"/ˌkoʊnuˈtrɪʃən/","extraExplanation":["“conutrition”不是常见的标准拼写；更常见的是连字符形式“co-nutrition”。在日常英语中，人们通常直接说“nutrition（营养）”、“diet（饮食）”、“nutritional support（营养支持）”。","如果你原本想查的是“contribution（贡献）”或“malnutrition（营养不良）/undernutrition（营养不足）”，把你要表达的句子发我，我可以帮你确认正确单词与用法。"]}
{"word":"conuzee","summary":{"en":"“conuzee” isn’t a recognized English word; it’s probably a misspelling or a proper name.","zh":"“conuzee”不是常见英语词，通常是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“conuzee” is not a standard English word. It is likely a misspelling or a name/brand.","zh":"“conuzee”不是标准英语单词，可能是拼写错误，或是人名/品牌名。"},"examples":[{"en":"I can’t find “conuzee” in an English dictionary—could you check the spelling?","zh":"我在英语词典里查不到“conuzee”——你能确认一下拼写吗？"},{"en":"If you tell me the sentence you saw it in, I can guess the intended word.","zh":"如果你把它出现的句子发我，我可以帮你推测原本想表达的单词。"}]}],"extraExplanation":["你可能想输入的是下列词之一（看起来字母形状/发音容易混）：\n1) connoisseur（美食/艺术“鉴赏家、行家”）\n2) confuse（“使困惑；混淆”）\n3) conduce（较正式：“促成；有助于”）\n\n把你看到的原句贴出来，或告诉我你想表达的中文意思（比如“困惑/行家/有帮助”），我就能给出准确词条、发音和例句。"]}
{"word":"conuzor","summary":{"en":"“Conuzor” is not a standard English word; it’s probably a misspelling. Context suggests you may mean “connoisseur” or “conductor.”","zh":"“conuzor”不是标准英文单词，可能是拼写错误；结合语境，你可能想写 “connoisseur” 或 “conductor”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a name/username. You may have meant a similar-looking word such as “connoisseur,” “conductor,” or “confuser” (depending on context).","zh":"不是标准英文单词。更可能是拼写错误，或是人名/用户名。根据语境，你可能想写的是 “connoisseur”（鉴赏家）、“conductor”（指挥/导体/售票员）、或 “confuser”（使人困惑的人/事，较少用）。"},"examples":[{"en":"I couldn’t find “conuzor” in an English dictionary—did you mean “connoisseur”?","zh":"我在英文词典里找不到 “conuzor”——你是不是想写 “connoisseur”？"},{"en":"If you mean someone who knows a lot about wine, the word is “connoisseur.”","zh":"如果你指很懂葡萄酒的人，用 “connoisseur”（鉴赏家）。"},{"en":"If you mean the person who leads an orchestra, the word is “conductor.”","zh":"如果你指带领管弦乐团的人，用 “conductor”（指挥）。"}]}],"phonetic":"N/A","extraExplanation":["“conuzor”看起来像是把某个词拼错了。你可以把原句发我，我能根据上下文更准确判断你想表达的词。","三个最常见的可能：\n1) connoisseur（鉴赏家/行家，常用于美食、葡萄酒、艺术）\n2) conductor（乐团指挥；火车上的乘务员/售票员；物理里的“导体”）\n3) confuser（较少见；更常说 confusing thing/person 或 someone who confuses others）"]}
