{"word":"cony","summary":{"en":"Cony is an old word for a rabbit, and in some Bible contexts it refers to a hyrax.","zh":"Cony 是“兔子”的古老说法；在某些《圣经》语境中也指“蹄兔”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic or literary) a rabbit, especially a wild rabbit.","zh":"（古语/文学用语）兔子，尤指野兔。"},"examples":[{"en":"In older stories, hunters tracked the cony through the brush.","zh":"在较早的故事里，猎人穿过灌木丛追踪野兔。"},{"en":"The hillside was once full of conies.","zh":"那座山坡曾经遍布野兔。"}]},{"partOfSpeech":"n.","definition":{"en":"(Biblical or zoological use) a hyrax (a small, rabbit-like mammal) in the Middle East and Africa.","zh":"（《圣经》或动物学用法）蹄兔（中东和非洲的一种小型哺乳动物，外形有点像兔子）。"},"examples":[{"en":"Some Bible translations use “cony” to refer to the hyrax.","zh":"一些《圣经》译本用“cony”指代蹄兔。"},{"en":"The cony hides among rocks to stay safe.","zh":"蹄兔躲在岩石间以保证安全。"}]}],"synonyms":["rabbit","hare (related)","hyrax (Bible/zoology)","coney"],"phonetic":"/ˈkoʊni/","extraExplanation":["“cony”读音与更常见的拼写“coney”相同/相近；现代英语里谈“兔子”通常用 rabbit 或 hare，“cony/coney”多见于古旧文学、地名或《圣经》语境。","在《圣经》语境中，“cony”并不是“兔子”，而常被解释为“蹄兔（hyrax）”；它外形像兔子但与兔子亲缘关系并不近。"]}
{"word":"conycatcher","summary":{"en":"Conycatcher is an old word meaning either a rabbit-catcher or, more commonly in historical slang, a swindler who tricks naive people.","zh":"Conycatcher 是旧词，既可指“捕兔人”，也更常在历史俚语中指“专骗天真者的骗子”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who catches rabbits (conies); a rabbit-catcher.","zh":"捕兔人；抓野兔的人。"},"examples":[{"en":"In old hunting records, a conycatcher supplied rabbits for the kitchen.","zh":"在旧时的狩猎记录中，捕兔人会为厨房提供野兔。"},{"en":"The estate hired a conycatcher to control the rabbit population.","zh":"庄园雇了捕兔人来控制兔子数量。"}]},{"partOfSpeech":"n.","definition":{"en":"(archaic slang) a swindler or con artist who tricks a naive person.","zh":"（古语俚语）骗子；专门欺骗天真者的诈骗者。"},"examples":[{"en":"He warned his friend about conycatchers who played confidence tricks in the city.","zh":"他提醒朋友要小心城里用“套信任”手法行骗的骗子。"},{"en":"The pamphlet described how a conycatcher lured victims with friendly talk.","zh":"那本小册子描述了骗子如何用热情攀谈来引诱受害者。"}]}],"synonyms":["rabbit-catcher","poacher","swindler","con artist","cheat","fraudster"],"phonetic":"/ˈkoʊniˌkætʃɚ/","extraExplanation":["“Cony”在早期英语里指“兔子”，也可比喻“容易上当的人”。因此“conycatcher”既可直译为“抓兔子的人”，也在16世纪伦敦的黑话里引申为“专骗‘小白’的骗子”。","16世纪作家Robert Greene写过一系列揭露骗术的小册子（常被称为“cony-catching pamphlets”），让这个词在英国文史语境里常带有“揭露江湖骗术”的味道。"]}
{"word":"conyger","summary":{"en":"Conyger is a rare/archaic word meaning a rabbit warren, and it also appears as a surname.","zh":"Conyger 是一个罕见/古语词，意思是“兔园（兔窝群）”，也常见作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(archaic) a rabbit warren; a place where rabbits are kept or breed.","zh":"（古语）兔园；兔子繁殖或饲养的地方（兔窝群）。"},"examples":[{"en":"The old estate once had a conyger behind the stone wall.","zh":"那座老庄园过去在石墙后面有一处兔园。"},{"en":"In the story, the hunter searched near the conyger at dusk.","zh":"故事里，猎人黄昏时在兔园附近搜寻。"}]},{"partOfSpeech":"n.","definition":{"en":"a surname (family name) derived from the older word for “rabbit warren.”","zh":"姓氏（源自“兔园/兔窝群”的旧词）。"},"examples":[{"en":"Ms. Conyger signed the letter at the bottom.","zh":"科尼杰女士在信末签了名。"}]}],"synonyms":["rabbit warren","warren"],"phonetic":"/ˈkʌnɪdʒər/","extraExplanation":["“conyger”在现代英语里非常少见，多见于历史/文学语境或地名、姓氏。它与古词“cony/coney（兔子）”有关，整体指“养兔或兔子聚居的地方”，相当于现代更常用的“rabbit warren”。在日常写作中通常不建议用它，除非你在读古文、家族史或描述历史场景。"]}
{"word":"conylene","summary":{"en":"“Conylene” is not a standard English word; it’s likely a misspelling or a rare technical/chemical-looking term.","zh":"“conylene” 不是标准常见英语词；更可能是拼写错误或罕见的技术/化学类词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it may be a misspelling or a very rare/technical term (often seen in chemistry-like names ending in “-ylene”).","zh":"不是常见英语词典里的标准词；可能是拼写错误，或是非常少见/技术性的术语（常见于以 “-ylene” 结尾的化学类名称）。"},"examples":[{"en":"I can’t find “conylene” in a dictionary—could you share the sentence where you saw it?","zh":"我在词典里找不到 “conylene”——你能把看到它的句子发我吗？"},{"en":"Maybe you meant a similar word, like “consonant” or a chemical name ending in “-ylene.”","zh":"你可能想写的是相近的词，比如 “consonant（辅音）”，或某个以 “-ylene” 结尾的化学名称。"}]}],"phonetic":"/ˈkɑnəˌliːn/","extraExplanation":["“ -ylene ” 常见于化学命名中，通常与某种烯烃/基团或相关化合物有关（例如 ethylene）。但 “conylene” 本身不属于常见、固定的英语词汇拼写。","如果你是从教材、论文、产品名或配方表里看到的，这个词可能是专有名词（商标/材料名）或 OCR 识别错误。提供上下文（前后一句、学科领域）我才能更准确判断。"]}
{"word":"conynge","summary":{"en":"“Conynge” is an old spelling of “cunning,” meaning either crafty/deceptive cleverness (common modern sense) or, in older use, knowledge and learning.","zh":"“conynge”是“cunning”的古体拼写：既可指“狡猾/诡计式的聪明”（现代常见义），也可在古义中指“学识、知识、技艺”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(archaic spelling) Clever in a way that may be tricky or deceptive; crafty. (Modern spelling: **cunning**.)","zh":"（古体拼写）狡猾的；诡计多端的；有点“耍心机”的聪明。（现代拼写：**cunning**。）"},"examples":[{"en":"In old texts, a “conynge” person might be described as clever but untrustworthy.","zh":"在古代文本中，“conynge”的人可能被形容为聪明但不太可信。"},{"en":"The fox is often shown as conynge—able to trick others.","zh":"狐狸常被描写成“conynge”——能骗过别人。"}]},{"partOfSpeech":"n.","definition":{"en":"(archaic) Knowledge, learning, or skill; ability gained through study or experience.","zh":"（古义）学识；知识；技艺；通过学习或经验获得的能力。"},"examples":[{"en":"Some Middle English writers used “conynge” to mean learning or scholarship.","zh":"一些中古英语作者用“conynge”表示“学问/学识”。"},{"en":"She had conynge in music and could teach others.","zh":"她在音乐上很有“conynge（学识/技艺）”，还能教别人。"}]}],"synonyms":["cunning","crafty","sly","wily","clever"],"phonetic":"/ˈkʌnɪŋ/","extraExplanation":["“conynge”常见于中古英语/早期近代英语文本，是现代英语“cunning”的旧拼写之一。更早可追溯到表示“知道、会做”的动词来源（类似“to know / to be able to do”），所以它既能指“学识/技能”，也逐渐发展出“狡黠、善于算计的聪明”这一更常见的现代含义。","阅读古文时要根据上下文判断：若和“learning / scholarship / books”这类语境连用，多半是“学识”；若在故事里形容人物/动物善于骗术或诡计，则更接近现代“cunning（狡猾）”。"]}
{"word":"Conyngham","summary":{"en":"Conyngham is a surname, usually a historical spelling variant of Cunningham.","zh":"Conyngham 是一个姓氏，通常是 Cunningham 的历史拼写变体。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname), an older or less common spelling of “Cunningham,” found especially in Irish and British records.","zh":"一个姓氏（家族姓），是 “Cunningham（坎宁安）” 的较旧或较少见拼写形式，常见于爱尔兰与英国的历史记录中。"},"examples":[{"en":"Her last name is Conyngham, a variant of Cunningham.","zh":"她的姓是 Conyngham，是 Cunningham 的一种拼写变体。"},{"en":"The letter was signed “Conyngham” at the bottom.","zh":"信的末尾署名为 “Conyngham”。"}]}],"synonyms":["Cunningham"],"phonetic":"ˈkʌnɪŋəm","extraExplanation":["Conyngham 多见于较早的文献、家谱与地名/人名记录中；在现代英语语境里更常见的拼写是 Cunningham。","这种拼写差异常与历史上的抄写习惯、地区口音以及标准拼写尚未统一有关。"]}
{"word":"conyrin","summary":{"en":"Conyrin is a rare scientific term for a poisonous alkaloid found in hemlock.","zh":"Conyrin 是一个较少见的科学术语，指毒芹中的一种有毒生物碱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a poisonous alkaloid (also spelled conyrine) found in hemlock (Conium maculatum).","zh":"一种有毒生物碱（也拼作 conyrine），存在于毒芹（Conium maculatum）中。"},"examples":[{"en":"Hemlock contains several toxic alkaloids, including conyrin.","zh":"毒芹含有多种有毒生物碱，包括 conyrin。"},{"en":"The report mentioned conyrin as one of the compounds responsible for hemlock’s harmful effects.","zh":"报告提到 conyrin 是导致毒芹危害作用的化合物之一。"}]}],"synonyms":["conyrine","hemlock alkaloid"],"phonetic":"/kəˈnaɪriːn/","extraExplanation":["“conyrin / conyrine”是较少见的专业词，更多出现在化学、毒理学或植物学语境中；日常英语里几乎不会用到。","词源与毒芹属名 Conium 有关。历史上毒芹因其毒性而著名，在西方文化中常被提到（例如古希腊对毒芹毒液的记载）。"]}
{"word":"conyrine","summary":{"en":"Conyrine is a rare scientific word for a toxic alkaloid found in hemlock.","zh":"Conyrine 是一个较少见的科学术语，指毒芹中的一种有毒生物碱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a poisonous alkaloid found in hemlock (Conium maculatum), related to coniine; used mainly as a scientific/chemical term.","zh":"毒芹（Conium maculatum，斑点毒芹）中发现的一种有毒生物碱，与“coniine（毒芹碱）”相关；主要用于科学与化学语境。"},"examples":[{"en":"Researchers identified conyrine among several alkaloids in hemlock extracts.","zh":"研究人员在毒芹提取物中鉴定出包括 conyrine 在内的多种生物碱。"},{"en":"Because conyrine is toxic, it is handled only under strict laboratory safety rules.","zh":"由于 conyrine 有毒，它只能在严格的实验室安全规范下处理。"}]}],"synonyms":["(related) coniine","hemlock alkaloid"],"phonetic":"/ˈkɑːnɪraɪn/","extraExplanation":["“conyrine”是比较少见的专业词，日常英语几乎不使用，更多出现在化学分析、毒理学或植物化学的资料里。","它常与“hemlock（毒芹）”“alkaloid（生物碱）”“coniine（毒芹碱）”等词一起出现；在阅读科普或论文时，看到这些搭配有助于理解语境。"]}
{"word":"conyza","summary":{"en":"Conyza is a plant genus (daisy family) often known as horseweed or fleabane, and some species are common weeds.","zh":"Conyza 是菊科植物的一个属，常被称为 horseweed 或 fleabane，其中一些种类是常见杂草。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering plants in the daisy family (Asteraceae), commonly called horseweed or fleabane; some species are common weeds.","zh":"一种菊科（Asteraceae）开花植物的属名，常见俗名有“horseweed（马草）/ fleabane（飞蓬）”；其中一些种类是常见杂草。"},"examples":[{"en":"Conyza canadensis (horseweed) often appears along roadsides and in fields.","zh":"Conyza canadensis（马草/加拿大飞蓬）常出现在路边和田地里。"},{"en":"Farmers may treat conyza as a troublesome weed because it spreads quickly.","zh":"农民可能把 conyza 当成麻烦的杂草，因为它扩散很快。"}]}],"synonyms":["horseweed","fleabane"],"phonetic":"/kəˈnaɪzə/","extraExplanation":["Conyza 是植物学中的拉丁化属名，日常英语里更常用 horseweed 或 fleabane 来指代具体植物。","词源上与希腊语中表示“跳蚤/驱跳蚤的植物”的词有关，因此英语俗名 fleabane（flea + bane“克星/祸害”）也暗示它曾被认为可驱虫。"]}

