{"word":"COQ","summary":{"en":"COQ most commonly means “Cost of Quality” in business/engineering; it can also refer to “coenzyme Q,” especially CoQ10, in health contexts.","zh":"COQ最常见指“质量成本（Cost of Quality）”；在健康语境中也可能指“辅酶Q”，尤其是CoQ10（辅酶Q10）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Cost of Quality,” meaning the total cost related to preventing, finding, and fixing quality problems in a product or service","zh":"“Cost of Quality（质量成本）”的缩写，指为预防、发现与修复质量问题而产生的总成本"},"examples":[{"en":"The factory reduced COQ by improving training and inspection.","zh":"工厂通过加强培训和检验来降低COQ（质量成本）。"},{"en":"High COQ often means the process needs better control.","zh":"COQ过高往往说明流程需要更好的控制。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “coenzyme Q,” especially CoQ10, a natural substance in the body that helps cells produce energy (often sold as a supplement)","zh":"“辅酶Q”的缩写，尤指CoQ10（辅酶Q10），人体内天然存在、帮助细胞产生能量的物质（也常作为保健品出售）"},"examples":[{"en":"Some people take CoQ10 as a dietary supplement.","zh":"有些人会把CoQ10作为膳食补充剂来服用。"},{"en":"Ask a doctor before starting CoQ10 if you take other medications.","zh":"如果你正在服用其他药物，开始服用CoQ10前应先咨询医生。"}]}],"synonyms":["Cost of Quality","CoQ10","coenzyme Q"],"phonetic":"/ˌsiː oʊ ˈkjuː/","extraExplanation":["COQ在不同领域含义差别很大：在制造业/质量管理里最常见的是“质量成本”，通常会分成预防成本、鉴定成本（检验/测试）、内部失败成本（出厂前返工报废）、外部失败成本（客户退货、保修、召回等）。","在健康/营养语境中，CoQ常指CoQ10。英文里也常写作“CoQ10”（而不是单独COQ），读法通常是“C-O-Q ten”。"]}
{"word":"coque","summary":{"en":"Coque means a protective shell/casing, or (in cooking) a crisp pastry shell for fillings.","zh":"coque 指保护性的外壳/壳体；在烹饪中也可指用来装馅的酥皮壳。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hard outer shell or protective casing (often used in design or engineering, from French usage)","zh":"（常用于设计或工程语境）硬质外壳、保护壳（源自法语用法）"},"examples":[{"en":"The designer created a lightweight coque to protect the device.","zh":"设计师做了一个轻量的保护壳来保护这台设备。"},{"en":"Some cars use a strong coque structure to improve safety.","zh":"有些汽车使用坚固的壳体结构来提升安全性。"}]},{"partOfSpeech":"n.","definition":{"en":"a crisp pastry shell, sometimes shaped like a boat, used for fillings (also seen in culinary French terms)","zh":"（烹饪）酥脆的点心外壳（有时做成小船形），用来装馅料"},"examples":[{"en":"They served seafood in a buttery coque.","zh":"他们把海鲜装在黄油味的酥皮壳里端上来。"},{"en":"Fill each coque with cream and fresh fruit.","zh":"把奶油和新鲜水果装进每一个酥皮壳里。"}]}],"synonyms":["shell","casing","housing","outer shell","pastry shell","tart shell"],"phonetic":"/koʊk/","extraExplanation":["“coque”是法语借词，字面意思与“壳/外壳”相关；英语里多出现在较专业或较“法式”的语境（如工业设计、法餐菜单）。日常英语更常说：shell / casing（外壳），或 pastry shell / tart shell（酥皮壳/挞壳）。","在法语或受法语影响的表达中，你可能会看到“monocoque”（整体式壳体结构），常用于赛车、自行车、飞机等领域。"]}
{"word":"coquecigrue","summary":{"en":"Coquecigrue means an absurd imaginary creature, or by extension an impossible or nonsensical idea.","zh":"Coquecigrue 指荒诞虚构的怪物，引申为不可能或荒谬的想法/说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an imaginary or ridiculous creature; something absurd or impossible (often used to criticize a far-fetched idea).","zh":"荒诞虚构的怪物；荒谬不可能之物（常用来讽刺离谱的想法）。"},"examples":[{"en":"Calling that plan a coquecigrue is a polite way of saying it will never work.","zh":"把那个计划称为 coquecigrue，是一种委婉地说它根本行不通的方式。"},{"en":"The story is full of coquecigrues—fun to read, but not meant to be taken seriously.","zh":"这个故事里充满了各种 coquecigrues——读起来有趣，但不该当真。"}]},{"partOfSpeech":"n.","definition":{"en":"nonsense; a bizarre or meaningless notion or statement (rare).","zh":"胡言乱语；荒诞无意义的说法（较少见）。"},"examples":[{"en":"He dismissed the rumor as pure coquecigrue.","zh":"他把那条谣言斥为纯粹的胡扯。"}]}],"synonyms":["chimera","absurdity","nonsense","fantasy","myth"],"phonetic":"/koʊk.siˈɡruː/","extraExplanation":["这个词源自法语，多见于较“书面/文学化”的语境，日常英语里非常少用。它常被用来制造一种“古怪、机智、带点嘲讽”的效果。","在法国文艺复兴作家拉伯雷（Rabelais）的作品语境中，这类词常用来表达夸张、荒诞与讽刺；因此在英语里使用 coquecigrue 往往也带有“刻意文艺/戏谑”的风格。"]}
{"word":"coquelicot","summary":{"en":"Coquelicot means the bright red corn poppy, and it can also describe a vivid poppy-red color.","zh":"Coquelicot 指鲜红的田野罂粟花（虞美人），也可用来形容“虞美人红/罂粟红”的颜色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bright red wild poppy (the corn poppy), often seen in European fields; its flower is also used as a symbol of remembrance for war casualties","zh":"一种鲜红色的野生罂粟花（常指“虞美人/田野罂粟”），常见于欧洲田野；其花也常被用作纪念战争死难者的象征"},"examples":[{"en":"In spring, coquelicots can cover the fields with a vivid red carpet.","zh":"春天里，田野罂粟（coquelicot）会把原野铺成一片鲜红。"},{"en":"She wore a coquelicot pin on her coat for a remembrance ceremony.","zh":"她在纪念仪式上把一枚虞美人（coquelicot）胸针别在外套上。"}]},{"partOfSpeech":"adj.","definition":{"en":"having the bright poppy-red color associated with the coquelicot flower","zh":"虞美人红的；鲜艳的罂粟红的"},"examples":[{"en":"He chose a coquelicot scarf to brighten up his outfit.","zh":"他选了一条虞美人红（coquelicot）的围巾来提亮穿搭。"},{"en":"The designer used coquelicot accents in the collection.","zh":"设计师在这一系列中加入了虞美人红（coquelicot）的点缀色。"}]}],"synonyms":["corn poppy","poppy","poppy-red","scarlet"],"phonetic":"/ˌkoʊkliˈkoʊ/","extraExplanation":["“Coquelicot”是法语借词（在英语中多用于文学、时尚、艺术语境），日常英语更常说“(corn) poppy”或直接说“poppy-red”。","它与一战纪念文化有关：红色罂粟花在英联邦国家常被用作“Remembrance poppy”（纪念罂粟花）的意象，尤其与《In Flanders Fields（佛兰德斯战场）》这首诗的文化联想相关。"]}
{"word":"Coquelin","summary":{"en":"Coquelin is a French surname, especially associated with the famed actor Benoît-Constant Coquelin, the original stage Cyrano.","zh":"Coquelin 是一个法国姓氏，英语里最常指著名演员伯努瓦-康斯坦·科克兰——《西哈诺·德·贝热拉克》首演的主角扮演者。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A French surname, best known in English through Benoît-Constant Coquelin (1841–1909), a celebrated French stage actor who created the title role in Edmond Rostand’s play *Cyrano de Bergerac* (1897).","zh":"法国姓氏；在英语语境中最常见的指代是法国著名舞台演员伯努瓦-康斯坦·科克兰（Benoît-Constant Coquelin，1841–1909），他在埃德蒙·罗斯丹的戏剧《西哈诺·德·贝热拉克》（1897）首演中饰演并“首创”了主角西哈诺。"},"examples":[{"en":"Coquelin became famous for playing Cyrano de Bergerac on stage.","zh":"科克兰因在舞台上饰演西哈诺·德·贝热拉克而闻名。"},{"en":"In some theatre histories, Coquelin is mentioned as a star of the Comédie-Française tradition.","zh":"在一些戏剧史著作中，科克兰被提到是法兰西喜剧院传统中的明星演员。"}]},{"partOfSpeech":"other","definition":{"en":"More generally, anyone with the family name Coquelin (a French last name).","zh":"更一般地指姓 Coquelin 的人（法国姓氏）。"},"examples":[{"en":"The article quoted Dr. Coquelin about language learning.","zh":"那篇文章引用了科克兰博士对语言学习的看法。"}]}],"synonyms":["(proper name) Coquelin (family name)"],"phonetic":"/ˈkoʊklɪn/","extraExplanation":["这是法语姓氏，法语读法里常带有鼻化元音（听起来不像英语的“n”那样清晰收尾），但在英语里通常会被英语化读成 /ˈkoʊklɪn/。","在文学与戏剧语境中提到 Coquelin，最常见的文化关联就是《西哈诺·德·贝热拉克》首演与19世纪末法国戏剧界。"]}
{"word":"coqueluche","summary":{"en":"Coqueluche most commonly means whooping cough; more rarely it can mean a sudden fashion or fad.","zh":"Coqueluche 最常指“百日咳”；较少见时也可指“一时的流行/风尚”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Whooping cough; a contagious respiratory illness that causes severe coughing fits (medical term, from French).","zh":"百日咳；一种具有传染性的呼吸道疾病，会引起剧烈的阵发性咳嗽（医学用语，源自法语）。"},"examples":[{"en":"The child was diagnosed with coqueluche and had coughing fits at night.","zh":"孩子被诊断为百日咳，晚上会出现阵发性剧烈咳嗽。"},{"en":"Vaccination greatly reduces the risk of coqueluche in infants.","zh":"接种疫苗能大大降低婴儿患百日咳的风险。"}]},{"partOfSpeech":"n.","definition":{"en":"Something that is suddenly very fashionable; a fad (rare in modern English; closer to French usage).","zh":"一时非常流行的事物；风尚、潮流（现代英语中较少见，更接近法语用法）。"},"examples":[{"en":"In the 1890s, some newspapers called the new dance craze a coqueluche.","zh":"在19世纪90年代，一些报纸把新的舞蹈热潮称为一种“coqueluche”（时尚风潮）。"}]}],"synonyms":["whooping cough","pertussis","fad","craze"],"phonetic":"/ˈkɑːkəluːʃ/","extraExplanation":["“coqueluche”是法语词，在英语里主要作为医学借词使用，指“百日咳”（英语更常用 whooping cough）。","发音结尾的“-luche”常读作类似“luush/loosh”的音；拼写看起来像法语，读法与英语拼读规则不完全一致。"]}
{"word":"coquet","summary":{"en":"Coquet means flirtatious or teasingly romantic; it can also mean a (rare) male flirt, and as a verb it means to flirt.","zh":"coquet 指“卖弄风情/轻佻调情的”；也可指（较少见的）爱调情的男子；作动词则表示“调情”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"flirtatious in a playful way; behaving as if you are romantically interested (often without serious intention)","zh":"卖弄风情的；轻佻调情的（常带不太认真的意味）"},"examples":[{"en":"He gave a coquet smile and walked away.","zh":"他露出一个轻佻的笑容就走开了。"},{"en":"Her coquet manner made some people uncomfortable.","zh":"她那种卖弄风情的举止让一些人感到不自在。"}]},{"partOfSpeech":"n.","definition":{"en":"a man who flirts; a male flirt (rare, somewhat old-fashioned)","zh":"爱调情的男子（较少见、略显旧式）"},"examples":[{"en":"In the novel, he is portrayed as a charming coquet.","zh":"在小说里，他被刻画成一个迷人的花花公子。"}]},{"partOfSpeech":"v.","definition":{"en":"to flirt; to behave in a teasing romantic way (rare)","zh":"调情；以挑逗的方式示好（较少见）"},"examples":[{"en":"He liked to coquet with compliments at parties.","zh":"他喜欢在聚会上用恭维话来撩拨别人。"}]}],"synonyms":["flirtatious","teasing","playful","coquettish"],"phonetic":"/koʊˈkeɪ/","extraExplanation":["“coquet”来自法语，常被视为较文学、较旧式的用词。现代英语里更常见的是“coquettish（卖弄风情的）”和“coquette（爱调情的女人）”。","这个词有时带轻微贬义或批评意味，表示“故意撩拨、并不认真”。使用时注意语境与礼貌。"]}
{"word":"coquetoon","summary":{"en":"A rare, old-fashioned word meaning a flirtatious woman (or flirtatious).","zh":"一个罕见、旧式的词，指“爱调情的女子”（也可形容“卖弄风情的”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare, old-fashioned) A flirtatious young woman; a coquette.","zh":"（罕见、旧式用法）轻佻爱调情的年轻女子；卖弄风情的女子。"},"examples":[{"en":"In the novel, the charming coquetoon plays with every admirer’s feelings.","zh":"在小说里，那位迷人的轻佻女子玩弄着每个追求者的感情。"},{"en":"He called her a coquetoon, but the word sounds old-fashioned today.","zh":"他称她为“轻佻女子”，但这个词如今听起来很老派。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare, old-fashioned) Showing playful flirting; coquettish.","zh":"（罕见、旧式用法）卖弄风情的；带挑逗意味的（同 coquettish）。"},"examples":[{"en":"She gave him a coquetoon smile and looked away.","zh":"她对他露出一个带挑逗意味的微笑，然后移开视线。"}]}],"synonyms":["coquette","flirt","coquettish","tease"],"phonetic":"/ˌkoʊkəˈtuːn/","extraExplanation":["这个词在现代英语里非常少见，多见于较老的文学作品或带“复古/讽刺”语气的写作中。日常表达里更常用：coquette（名词，爱调情的女子）、flirt（名词/动词，调情的人/调情）、coquettish（形容词，卖弄风情的）。","词源上与法语 coquette（“卖弄风情的女子”）有关；词尾 -oon 在英语里有时带“指小/带点贬义或戏谑”的感觉，因此该词常含轻微贬义，使用时要注意礼貌与语境。"]}
{"word":"coquetries","summary":{"en":"Coquetries means acts of flirtation or playful teasing meant to attract attention.","zh":"coquetries 指“卖弄风情、调情”的一系列举动或方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Flirtatious behavior or playful attempts to attract attention, often in a light or teasing way (plural: different acts or styles of flirting).","zh":"卖弄风情；轻佻的调情举动（复数：指不同的调情行为或方式）。"},"examples":[{"en":"His constant coquetries made the conversation feel more like a game than a serious talk.","zh":"他不断的卖弄风情让对话更像一场游戏，而不是认真的谈话。"},{"en":"In the novel, her coquetries distract the men around her, but she stays in control.","zh":"在小说里，她的调情举动让周围的男人分心，但她始终掌控局面。"}]}],"synonyms":["flirtations","teasing","coquetry","flirting","allure"],"phonetic":"/ˈkoʊkətri/","extraExplanation":["“coquetry”来自法语 *coquette*（爱卖弄风情的女子）。在较正式或文学语境中更常见；日常口语里更常用 *flirting* 来表达“调情/暧昧”。","“coquetries”作复数时，常带有一种“各种小手段/一连串举动”的感觉，有时也可能带轻微批评意味，需注意语气与场合。"]}
{"word":"coquetry","summary":{"en":"Coquetry means flirtatious, playful behavior or a manner that suggests flirting, often in a somewhat literary or formal tone.","zh":"coquetry 指调情、卖弄风情的行为或风格，语气较书面，有时带一点“刻意撩拨”的意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Flirtatious behavior—playfully trying to attract attention or romantic interest, often without serious intention.","zh":"调情；卖弄风情——以玩笑、挑逗的方式吸引他人的注意或好感，常常不一定认真。"},"examples":[{"en":"Her coquetry at the party made some people think she was interested, but she was just being playful.","zh":"她在派对上的调情让一些人以为她有意思，但她只是爱开玩笑、逗逗人。"},{"en":"He mistook friendly conversation for coquetry.","zh":"他把友好的聊天误以为是调情。"}]},{"partOfSpeech":"n.","definition":{"en":"A light, playful style or manner (especially in talk, dress, or social behavior) that suggests flirtation.","zh":"（言谈、穿着或社交举止中的）轻佻、俏皮的风格，带有暧昧或挑逗的意味。"},"examples":[{"en":"The novel describes the coquetry of fashionable city life.","zh":"这本小说描写了时髦都市生活中的轻佻与卖弄风情。"}]}],"synonyms":["flirtation","teasing","coquettishness"],"phonetic":"/ˈkoʊkətri/","extraExplanation":["词源上与法语 coquet（爱卖弄风情的、爱调情的）有关，常用于较“文学/正式”的语境；日常口语里更常说 flirting / flirtation。","语气提示：coquetry 往往带一点“刻意撩拨、爱卖弄”的暗示，可能是中性也可能略带批评；用在描述他人时要注意礼貌与场合。"]}
{"word":"coquets","summary":{"en":"“Coquets” is the plural of “coquet,” meaning flirtatious people (often in older/literary style), or it can relate to the verb “to coquet,” meaning to flirt playfully.","zh":"“coquets”是“coquet”的复数，指（偏旧/文学语体的）调情者；也关联动词“to coquet”，表示轻佻地调情。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People (often women, in older usage) who flirt in a playful way and enjoy attracting attention.","zh":"（常见于较旧用法）喜欢卖弄风情、逗人倾慕的调情者（常指女性）。"},"examples":[{"en":"In the novel, the coquets charm guests at every party.","zh":"在小说里，这些调情者在每场派对上都能迷倒宾客。"},{"en":"He warned his friend not to trust the coquets at court.","zh":"他警告朋友不要轻信宫廷里的那些风流人物。"}]},{"partOfSpeech":"vi.","definition":{"en":"To flirt in a light, playful way; to act as if romantically interested without serious intent.","zh":"（以轻佻、玩笑的方式）调情；卖弄风情（多无认真承诺之意）。"},"examples":[{"en":"She likes to coquet with strangers when she feels confident.","zh":"她自信时喜欢和陌生人调情。"},{"en":"He coqueted with the idea of quitting his job, but never did.","zh":"他一度“玩味/试探”过辞职的想法，但最终没有付诸行动。"}]}],"synonyms":["flirts","teases","coquettes","philanderers (often for men)","flirt (verb)"],"phonetic":"/koʊˈkɛts/","extraExplanation":["“coquet(s)”来自法语 *coquet*（原意带有“爱出风头、爱显摆”的感觉）。现代英语里更常见的词是 **flirt**；“coquet/coquette”常带有文学、复古或略带评判的语气。","注意性别色彩：传统上 **coquette** 更常指女性调情者；但现代写作中为避免刻板印象，通常用更中性的 **flirt** 或直接描述行为。"]}
{"word":"coquette","summary":{"en":"A coquette is someone (usually a woman) who flirts playfully, often enjoying attention without serious intent.","zh":"coquette 指（多指女性）爱卖弄风情、喜欢调情的人或带调情意味的举止，常含评价色彩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A woman who flirts in a playful way, often without a serious intention to start a relationship.","zh":"轻佻卖弄风情的女子；爱调情的女人（常带“不太认真”的意味）。"},"examples":[{"en":"He thought she was a coquette, always smiling and flirting with everyone.","zh":"他觉得她是个爱卖弄风情的人，总是对谁都笑、都调情。"},{"en":"In the novel, the coquette enjoys attention more than commitment.","zh":"在小说里，这个轻佻女子更享受被关注，而不是承诺与稳定。"}]},{"partOfSpeech":"adj.","definition":{"en":"Playfully flirtatious; behaving like a coquette.","zh":"（举止）卖弄风情的；轻佻调情的。"},"examples":[{"en":"She gave him a coquette glance and walked away.","zh":"她朝他抛了个风情万种的眼神就走开了。"},{"en":"His coquette smile made the conversation feel like a game.","zh":"他那带点调情意味的笑让对话像在玩游戏。"}]}],"synonyms":["flirt","tease","seductress"],"phonetic":"/koʊˈkɛt/","extraExplanation":["“coquette”源自法语，带有较强的文化色彩：常见于文学或较正式的语境，描写一种“以暧昧与吸引为乐”的社交姿态。现代日常口语里更常用 flirt / flirty。","语气提示：这个词往往带评价意味，可能暗含“轻浮、爱玩弄感情”的批评；使用时注意场合与对他人的尊重。","相关表达：a flirt（爱调情的人，更中性）、tease（故意逗弄/吊人胃口，语气可能更尖锐）、play hard to get（欲擒故纵）。"]}
{"word":"coquetted","summary":{"en":"“Coquetted” means “flirted playfully” (or “toyed with an idea”)—it’s the past form of “coquet.”","zh":"“coquetted”表示“卖弄风情地调情/轻佻地示好”，也可比喻“试探性地接近某个想法”；是 coquet 的过去式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of “coquet”) to flirt in a playful way, often by acting charming or teasing to attract attention.","zh":"（动词 coquet 的过去式/过去分词）卖弄风情；（以俏皮、挑逗的方式）调情，吸引注意。"},"examples":[{"en":"At the party, she coquetted with several guests but stayed polite and lighthearted.","zh":"在派对上，她和几位宾客调情式地打趣，但依然保持礼貌和轻松。"},{"en":"He coquetted with the idea of quitting his job, but he wasn’t serious yet.","zh":"他一度“暧昧”地考虑过辞职这个想法，但还没有认真下决定。"}]}],"synonyms":["flirted","teased","played coy","toyed (with)","trifled (with)"],"phonetic":"/koʊˈkɛtɪd/","extraExplanation":["“coquet”来自法语，常带有“俏皮、卖弄风情”的语气；在现代英语里比“flirt”更文学、更少见，语感也更“轻佻/含蓄”。","注意拼写：动词原形是 coquet（不常用），过去式/过去分词是 coquetted（英式有时也见 coqueted）。","除了指人与人之间的调情，“coquet with + 名词/想法”也可比喻“对某个想法若即若离地考虑、试探性接近”。"]}
{"word":"coquettes","summary":{"en":"“Coquettes” means flirtatious women (plural of “coquette”), often with a slightly critical tone.","zh":"“coquettes”是“coquette”的复数，指爱调情、爱卖弄风情的女性，语气常略带批评或讽刺。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of coquette: women (or girls) who flirt in a playful way, often to attract attention or admiration.","zh":"coquette 的复数：指爱调情、爱卖弄风情以吸引关注或仰慕的女性（或女孩）。"},"examples":[{"en":"In the novel, the coquettes charm the men at every party.","zh":"在小说里，那些爱调情的女子在每场聚会上都把男人迷得团团转。"},{"en":"He warned his friend not to be distracted by coquettes.","zh":"他提醒朋友别被那些爱卖弄风情的女人分心。"},{"en":"The actress played one of the coquettes in the salon scene.","zh":"那位女演员在沙龙场景中饰演其中一位风情女子。"}]}],"synonyms":["flirts","teases","flirtatious women","sirens (literary)"],"phonetic":"/koʊˈkɛts/","extraExplanation":["“coquette”来自法语，原意与“调情、卖弄风情”有关；在英语里常带一点批评或讽刺色彩，暗示对方以暧昧吸引注意，而不一定认真。","现代语境中，这个词多用于文学描写、历史题材或较正式/讽刺的语气；日常口语里更常用“flirt / flirtatious person”。","传统上多指女性；若要更中性表达，可说“flirts”（复数）或“a flirt”（单数）。"]}
{"word":"coquetting","summary":{"en":"Coquetting means flirting playfully or acting in a way meant to attract attention, often without serious commitment.","zh":"coquetting 指带玩笑或若即若离意味的调情，也可指以轻佻炫示的方式吸引关注。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"flirting in a playful way; behaving as if you are romantically interested (often without serious intent)","zh":"（带点玩笑意味地）调情；卖弄风情（常不一定认真）"},"examples":[{"en":"She was coquetting with the new coworker at the office party.","zh":"在办公室派对上，她正和新来的同事打情骂俏。"},{"en":"He kept coquetting with the idea of asking her out, but he never did.","zh":"他一直在“试探”约她出去的想法，但始终没有真的开口。"}]},{"partOfSpeech":"v.","definition":{"en":"trying to attract attention or admiration in a light, showy way","zh":"（轻佻或炫示地）博取关注/赞赏"},"examples":[{"en":"The brand is coquetting with luxury styling to appeal to young buyers.","zh":"这个品牌正用带点“轻奢”风格来吸引年轻买家。"},{"en":"In the speech, the politician was coquetting with popularity rather than discussing policy.","zh":"在演讲中，这位政治人物更像是在迎合人气，而不是讨论政策。"}]}],"synonyms":["flirting","teasing","bantering","toying (with)","leading on"],"phonetic":"/koʊˈkɛtɪŋ/","extraExplanation":["“coquetting”是动词“coquet”的现在分词/动名词形式（coquet → coquetting）。常用于较文雅或文学化语境，比“flirting”更带“卖弄风情、若即若离”的感觉。","词源来自法语“coquet”（原意与“爱打扮、爱卖弄”的气质有关）。在文学作品里，常用来描写人物以暧昧手段试探他人或操控社交氛围。","拼写注意：英美写法通常为 coquetting（双 t）。与“coquette”（名词：爱卖弄风情的女子/善于调情的人）有关。"]}
{"word":"coquettish","summary":{"en":"“Coquettish” describes playful, teasing flirtation—often a charming but sometimes slightly affected way of seeking attention.","zh":"“coquettish”指带点俏皮挑逗的调情或引人注意的姿态，常可爱但也可能带点做作或轻佻的含义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Flirtatious in a playful, teasing way; acting like you want attention (often used about a woman, and sometimes implying it’s a bit affected or not fully sincere).","zh":"（多指女性）卖弄风情的；轻佻调情的；带点做作地引人注意的。"},"examples":[{"en":"She gave him a coquettish smile and looked away.","zh":"她给了他一个卖弄风情的微笑，然后把目光移开。"},{"en":"The dress is elegant, not coquettish.","zh":"这条裙子很优雅，并不轻佻。"},{"en":"His coquettish tone made the conversation awkward at work.","zh":"他那种轻佻的语气让工作场合的对话变得尴尬。"}]}],"synonyms":["flirtatious","teasing","playful","provocative","saucy"],"phonetic":"/ˈkɑːkətɪʃ/","extraExplanation":["这个词常带“评价色彩”：既可以只是“俏皮地调情”，也可能暗含“有点做作/不太真诚”。在正式或职场语境里用它形容别人，可能显得不礼貌或带有性别刻板印象，使用时要注意场合。","词源上与法语有关，常见于描写人物神态、眼神、微笑、语气等的文学或叙述性写作中。"]}
{"word":"coquettishly","summary":{"en":"“Coquettishly” means in a playful, flirtatious, attention-seeking way.","zh":"“coquettishly”表示以俏皮、卖弄风情、带点调情的方式（常有吸引注意的意味）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a playful, flirtatious way, often meant to attract attention without showing serious romantic commitment.","zh":"以卖弄风情、俏皮调情的方式；常带有吸引注意但不一定认真投入感情的意味。"},"examples":[{"en":"She smiled coquettishly and looked away.","zh":"她风情地一笑，然后把目光移开。"},{"en":"He spoke coquettishly, teasing his friend for fun.","zh":"他说话带点暧昧的俏皮语气，逗朋友玩。"},{"en":"The character coquettishly pretends to be uninterested.","zh":"这个角色故作矜持、带点撩人的感觉，假装不感兴趣。"}]}],"synonyms":["flirtatiously","playfully","seductively","teasingly"],"phonetic":"/koʊˈkɛtɪʃli/","extraExplanation":["“coquettishly”来自形容词“coquettish”，而“coquette/coquet”源自法语，常用来形容一种带点“撩而不定”的轻佻/卖俏风格。写作中它既可中性（俏皮、迷人），也可能带轻微贬义（刻意勾引、做作），要看语境。"]}
{"word":"coquettishness","summary":{"en":"Coquettishness means flirtatious, teasing charm—sometimes playful, sometimes suggesting insincerity.","zh":"coquettishness 指带挑逗意味的俏皮妩媚与调情姿态；可褒可贬，既可指迷人，也可能暗含轻浮或不真诚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of behaving in a flirtatious, teasing, and playful way, often to attract attention","zh":"（为吸引注意而表现出的）卖弄风情、轻佻的调情姿态；妩媚（常带一点“撩人但不认真”的感觉）"},"examples":[{"en":"Her coquettishness made the conversation feel light and playful.","zh":"她的卖弄风情让谈话显得轻松又带点暧昧的玩笑感。"},{"en":"The character’s coquettishness is charming at first, but later it seems insincere.","zh":"这个角色起初的轻佻调情很讨喜，但后来显得不太真诚。"}]},{"partOfSpeech":"n.","definition":{"en":"a style or manner (in speech, dress, writing, or art) that suggests flirtation or playful charm","zh":"（在言谈、穿着、写作或艺术中呈现的）带调情意味的俏皮风格；妩媚的姿态/笔触"},"examples":[{"en":"The poem carries a hint of coquettishness without becoming vulgar.","zh":"这首诗带着一丝妩媚的俏皮，却不流于粗俗。"},{"en":"She added a touch of coquettishness to her outfit with a ribbon and bright lipstick.","zh":"她用丝带和亮色口红给穿搭添了一点俏皮妩媚的感觉。"}]}],"synonyms":["flirtatiousness","playfulness","teasing charm","coquetry"],"phonetic":"/koʊˈkɛtɪʃnəs/","extraExplanation":["“coquettishness”来自形容词“coquettish”（卖弄风情的、爱调情的），其词根与法语“coquette”（爱卖弄风情的女子）有关。这个词在语气上常带有评价色彩：可以是“迷人、俏皮”，也可能暗示“轻浮、不够真诚”。使用时注意场合，描述他人时有时会显得主观或带批评。"]}
{"word":"coquicken","summary":{"en":"Coquicken is a rare, old-fashioned verb meaning “to revive/enliven” or “to become lively.”","zh":"Coquicken 是非常少见的古语动词，表示“使复苏/使更有生气”或“变得有生气”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Archaic) To make something come to life or become more lively; to revive or enliven.","zh":"（古语）使……有生气/复苏；使……活跃起来。"},"examples":[{"en":"The spring rain seemed to coquicken the sleeping garden.","zh":"春雨似乎让沉睡的花园重新焕发生机。"},{"en":"Her music coquickened the room, and people began to talk and smile.","zh":"她的音乐让整个房间活跃起来，人们开始交谈和微笑。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Archaic) To become lively or full of life; to quicken.","zh":"（古语）变得更有生气；加快；复苏。"},"examples":[{"en":"As dawn arrived, the city slowly coquickened.","zh":"黎明到来时，城市慢慢苏醒并热闹起来。"}]}],"synonyms":["quicken","enliven","revive","animate","invigorate"],"phonetic":"/koʊˈkwɪkən/","extraExplanation":["“coquicken”非常少见，多见于较早期的文学或诗歌语境。词中“quicken”本义与“生命/活力（quick）”相关，后来也引申为“加快”。前缀“co-”常有“共同、一起”的感觉，但在这个词里更多像是旧式构词，现代英语里通常直接用“quicken / enliven / revive”。"]}
{"word":"Coquilhatville","summary":{"en":"Coquilhatville is the historical (colonial-era) name for today’s city of Mbandaka in the Democratic Republic of the Congo.","zh":"Coquilhatville 是刚果民主共和国城市姆班达卡（Mbandaka）的历史旧称（多见于殖民时期）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former name of Mbandaka, a city in northwestern Democratic Republic of the Congo, used mainly during the Belgian colonial period.","zh":"刚果民主共和国西北部城市姆班达卡（Mbandaka）的旧称，主要用于比利时殖民时期。"},"examples":[{"en":"Coquilhatville was renamed Mbandaka after Congo’s independence.","zh":"刚果独立后，Coquilhatville 更名为姆班达卡（Mbandaka）。"},{"en":"The diary describes travel by river to Coquilhatville in the early 1900s.","zh":"这本日记描述了20世纪初沿河前往 Coquilhatville 的旅程。"}]}],"phonetic":"/koʊˈkiːəl.viːl/","extraExplanation":["该地名来自比利时殖民官员卡米耶·科基亚（Camille Coquilhat）的姓氏，因此在历史文献、老地图或殖民时期记录中更常见。","在现代语境中，日常与官方用法通常使用 Mbandaka；使用 Coquilhatville 往往带有“历史时期/殖民时期”的指向。"]}
{"word":"coquilla","summary":{"en":"Coquilla is a South American palm and, more commonly, its hard nut used to make buttons and small carved items.","zh":"Coquilla 指一种南美棕榈，更常指其坚硬果仁，可用于制作纽扣和小型雕刻工艺品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a South American palm tree (especially in the genus Attalea) whose hard nuts are used to make small items such as buttons and ornaments","zh":"（南美的一种）棕榈树（常指阿塔利亚属 Attalea），其坚硬果仁可用来制作纽扣、装饰品等小物件"},"examples":[{"en":"These buttons are made from coquilla nuts, not plastic.","zh":"这些纽扣是用 coquilla 果仁做的，不是塑料。"},{"en":"Coquilla palms grow in parts of South America.","zh":"coquilla 棕榈生长在南美的一些地区。"}]},{"partOfSpeech":"n.","definition":{"en":"the hard nut/seed of the coquilla palm, used as a material for carving and turning (similar to “vegetable ivory”)","zh":"coquilla 棕榈的坚硬果仁/种子，可作为雕刻、车制材料（类似“植物象牙”）"},"examples":[{"en":"The artisan carved a small pendant from coquilla.","zh":"工匠用 coquilla 果仁雕了一个小吊坠。"},{"en":"Coquilla is sometimes described as a kind of vegetable ivory.","zh":"coquilla 有时被称为一种“植物象牙”。"}]}],"synonyms":["coquilla nut","vegetable ivory (similar material)","palm nut"],"phonetic":"/koʊˈkiːjə/","extraExplanation":["“Coquilla”常见于工艺/材料语境，尤其指果仁本身可用作纽扣、珠子、雕刻材料。和“tagua（象牙棕榈果）”一样，英文里有时会把这类坚硬植物果仁统称为“vegetable ivory（植物象牙）”，强调它们可替代象牙用于小型工艺品。","拼写容易与西语单词混淆；在英文材料/手工艺领域看到 coquilla，多半指这种棕榈果仁材料或其来源的棕榈树。"]}
{"word":"coquillage","summary":{"en":"Coquillage means shellwork—artistic decoration made from seashells (and less commonly, a collection of seashells).","zh":"coquillage 指“贝壳装饰工艺/贝壳拼贴艺术”，较少见时也可指“贝壳收藏”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"shellwork; decoration or art made from seashells (often arranged in patterns or used to cover objects).","zh":"贝壳装饰艺术；用海贝制作或镶嵌而成的装饰/工艺（常用贝壳拼贴成图案或覆盖在物品表面）。"},"examples":[{"en":"The museum displayed 18th-century frames covered in coquillage.","zh":"博物馆展出了18世纪用贝壳装饰（coquillage）覆盖的画框。"},{"en":"She learned coquillage to decorate mirrors with tiny shells.","zh":"她学习贝壳装饰工艺（coquillage），用小贝壳来装饰镜子。"}]},{"partOfSpeech":"n.","definition":{"en":"a collection of seashells; seashells gathered for display or study (less common).","zh":"贝壳收藏；为展示或研究而收集的海贝（较少见）。"},"examples":[{"en":"His coquillage included shells from the Mediterranean and the Caribbean.","zh":"他的贝壳收藏（coquillage）里有来自地中海和加勒比海的贝壳。"}]}],"synonyms":["shellwork","seashell decoration","shell ornamentation","shell art"],"phonetic":"/ˌkoʊkiˈjɑːʒ/","extraExplanation":["“coquillage”来自法语，原意与“贝壳/贝类”相关。在英语里多用于艺术与装饰语境，指“贝壳装饰工艺”，常见于古典室内装潢、镜框、相框、壁龛等的贝壳拼贴。","发音里结尾“‑age”常读作 /ɑːʒ/（类似 garage 的一种读法），中间的“‑ill‑”会让很多学习者不确定；可把它整体记成“ko-kee-YAHZH”。"]}
{"word":"Coquille","summary":{"en":"Coquille usually means a shell (especially a scallop shell) or a shell-shaped dish, and it can also refer to a French baked seafood dish.","zh":"Coquille通常指贝壳（尤指扇贝壳）或贝壳形器皿，也可指法式贝壳海鲜焗菜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a shell, especially a scallop shell; by extension, a shell-shaped dish or decoration","zh":"贝壳（尤指扇贝壳）；引申为贝壳形的餐盘或装饰品"},"examples":[{"en":"The museum displayed a delicate gold coquille as a symbol of the sea.","zh":"博物馆展出了一件精致的金色贝壳形装饰品，象征海洋。"},{"en":"Serve the seafood in a coquille to keep the classic French style.","zh":"用贝壳形烤皿盛装海鲜，更有经典的法式风格。"}]},{"partOfSpeech":"n.","definition":{"en":"a French-style seafood dish baked and served in a shell or shell-shaped dish (often seen as “coquille St. Jacques”)","zh":"（法式）贝壳海鲜焗菜（常见作“coquille St. Jacques / 扇贝焗”），通常放在贝壳或贝壳形烤皿中烤制上桌"},"examples":[{"en":"I ordered coquille St. Jacques for dinner.","zh":"我晚餐点了扇贝焗（coquille St. Jacques）。"},{"en":"The chef finished the coquille with a light breadcrumb topping.","zh":"主厨在贝壳焗菜上铺了薄薄一层面包屑作收尾。"}]},{"partOfSpeech":"n.","definition":{"en":"a size of printing type (historically about 8-point)","zh":"（排版/印刷）一种字体字号（历史上约等于8点）"},"examples":[{"en":"The old book was set in coquille type, which looks small to modern readers.","zh":"那本旧书用coquille字号排版，对现代读者来说看起来偏小。"}]}],"synonyms":["shell","scallop shell","shell-shaped dish","coquille St. Jacques"],"phonetic":"/koʊˈkiːl/","extraExplanation":["“Coquille”来自法语，原意是“贝壳”。在英语里常用于烹饪语境，指用贝壳或贝壳形烤皿盛装并烤制的菜肴；“coquille St. Jacques”字面是“圣雅各贝壳”，与扇贝菜及其贝壳摆盘传统有关。","作为文化小知识：扇贝壳也常被视为“朝圣之路”（Camino de Santiago）的象征物之一，因此在欧洲文化中带有旅行与朝圣的联想。"]}
{"word":"coquille","summary":{"en":"Coquille most often refers to a shell-shaped dish (or seafood served in it); less commonly, it can mean a typographical error.","zh":"Coquille 最常指贝壳形餐盘（或其中的海鲜料理）；较少见时也可指排印错误。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scallop-shell shape; also a shell-shaped dish (or the food served in it), often used for seafood","zh":"扇贝壳形状；也指扇贝壳形餐盘（或盛在其中的食物），常用于海鲜菜"},"examples":[{"en":"The shrimp were served in a coquille with a creamy sauce.","zh":"虾仁配奶油酱装在扇贝壳形的盘中端上来。"},{"en":"We ordered coquilles Saint-Jacques for an appetizer.","zh":"我们点了“圣雅克扇贝”（coquilles Saint-Jacques）作开胃菜。"}]},{"partOfSpeech":"n.","definition":{"en":"(publishing, less common in English) a typographical error; a misprint","zh":"（出版领域，英语中较少用）排印错误；印刷错误"},"examples":[{"en":"The editor found a coquille in the title and corrected it before printing.","zh":"编辑在标题里发现了一个排印错误，并在印刷前改正了。"},{"en":"That sentence has a coquille—one letter is missing.","zh":"那句话有个排印错误——少了一个字母。"}]}],"synonyms":["shell-shaped dish","scallop shell","typo","misprint","printer’s error"],"phonetic":"/koʊˈkiːl/","extraExplanation":["“Coquille”来自法语，原意是“贝壳”。在餐饮语境里常见于法式菜名，尤其是 coquilles Saint-Jacques（扇贝料理），通常指用贝壳形器皿盛装、带奶油或芝士酱的海鲜菜。","在法语出版/排版中，“coquille”也常用来指“错字/排印错误”。英语里更常说 typo 或 misprint，但在与法语或出版行业相关的语境中仍可能看到 coquille。"]}
{"word":"coquilles","summary":{"en":"Coquilles is the plural of coquille, meaning either typographical errors or shell-shaped dishes/seafood served in shells.","zh":"Coquilles 是 coquille 的复数，可指“排版/印刷的小错误”，也可指“贝壳形餐具或贝壳盛装的海鲜菜”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) small mistakes in printed text or writing; typographical errors.","zh":"（复数）印刷或书写中的小错误；排版错误；笔误。"},"examples":[{"en":"The editor found a few coquilles in the first edition.","zh":"编辑在第一版里发现了几处笔误。"},{"en":"Please check the menu for coquilles before we print it.","zh":"印菜单前请检查一下有没有排版错误。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) shell-shaped dishes, or dishes of seafood served in shells (especially in French-style cooking).","zh":"（复数）贝壳形烤盘；或用贝壳盛装的海鲜菜（尤指法式做法）。"},"examples":[{"en":"They served scallops as coquilles at the restaurant.","zh":"那家餐厅把扇贝做成了贝壳装的法式菜。"},{"en":"The recipe suggests baking the seafood in individual coquilles.","zh":"食谱建议把海鲜分别放在贝壳形小烤盘里烤。"}]}],"synonyms":["typos","misprints","printing errors","shell dishes","coquille (singular)"],"phonetic":"/koʊˈkilz/","extraExplanation":["“Coquille(s)”来自法语，原意是“贝壳”。在英语里，它既可以指真正的贝壳/贝壳形餐具，也常用于出版与校对领域，表示“印刷/排版的小错误”。","在烹饪语境中，你可能会看到经典菜名 *coquilles Saint-Jacques*（圣雅克扇贝），通常指奶油酱焗扇贝并盛在贝壳（或贝壳形器皿）中。"]}
{"word":"coquimbite","summary":{"en":"Coquimbite is a hydrated iron(III) sulfate mineral, often forming yellowish crusts in acidic, dry environments.","zh":"Coquimbite（科金比石）是一种含结晶水的三价铁硫酸盐矿物，常在酸性且较干燥的环境中形成黄颜色的结壳沉积。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a yellow to reddish mineral: a hydrated iron(III) sulfate (a type of sulfate mineral) that can form as an evaporation product in arid, acidic environments such as mine drainage areas","zh":"一种黄至红褐色的矿物：含结晶水的三价铁硫酸盐（硫酸盐类矿物），常在干旱、酸性环境（如矿山酸性排水附近）因蒸发而形成"},"examples":[{"en":"Coquimbite may appear as a yellow crust on rocks near an acidic mine drainage site.","zh":"在酸性矿山排水附近，coquimbite 可能以黄色结壳的形式出现在岩石表面。"},{"en":"The geologist identified coquimbite as a hydrated iron sulfate mineral.","zh":"地质学家鉴定出 coquimbite 是一种含水的铁硫酸盐矿物。"}]}],"synonyms":["hydrated ferric sulfate (mineral)"],"phonetic":"/koʊˈkɪmˌbaɪt/","extraExplanation":["coquimbite 这个名称与智利的科金博（Coquimbo）地区有关：很多矿物会以首次发现地或典型产地来命名。","它通常出现在非常酸性的氧化环境中，常与其他硫酸盐矿物一起出现；在野外观察时，多见为粉末状或结壳状沉积。"]}
{"word":"Coquimbo","summary":{"en":"Coquimbo is a city and also the name of a region in Chile.","zh":"Coquimbo（科金博）既指智利的一座城市，也指智利的一个大区名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A port city in north-central Chile, on the Pacific coast, known for its harbor, beaches, and as a gateway to the Elqui Valley.","zh":"科金博：智利中北部太平洋沿岸的港口城市，以海港、海滩闻名，也是前往埃尔基山谷（Elqui Valley）的门户。"},"examples":[{"en":"We flew to La Serena and then took a bus to Coquimbo.","zh":"我们飞到拉塞雷纳（La Serena），然后坐巴士去科金博。"},{"en":"Coquimbo’s port plays an important role in the region’s trade.","zh":"科金博的港口在该地区的贸易中扮演重要角色。"}]},{"partOfSpeech":"n.","definition":{"en":"The Coquimbo Region, an administrative region of Chile whose capital is La Serena.","zh":"科金博大区：智利的一个行政大区，首府是拉塞雷纳（La Serena）。"},"examples":[{"en":"Astronomy tourism is popular in Chile’s Coquimbo Region because of its clear skies.","zh":"由于天空晴朗，智利的科金博大区很适合天文旅游。"},{"en":"The Elqui Valley is located in the Coquimbo Region.","zh":"埃尔基山谷位于科金博大区。"}]}],"phonetic":"/koʊˈkɪmboʊ/","extraExplanation":["“Coquimbo”是西班牙语地名；在英语里通常保留原拼写并首字母大写。","读音中重音常落在第二个音节（kim），对英语学习者来说可以先抓住“ko-KIM-bo”这种节奏。"]}
{"word":"coquin","summary":{"en":"Coquin is a French-derived word meaning a playful rascal; it can also describe someone as mischievous or roguish.","zh":"Coquin 源自法语，常指“淘气鬼/小坏蛋”，也可形容“顽皮、坏坏的（多为玩笑语气）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from French) a playful rascal; a mischievous or slightly wicked person (often used jokingly).","zh":"（源自法语）小坏蛋；淘气鬼；有点“坏但可爱”的人（常为开玩笑的说法）。"},"examples":[{"en":"You little coquin—who hid my keys?","zh":"你这个小坏蛋——谁把我的钥匙藏起来了？"},{"en":"In the story, the coquin tricks the adults but means no real harm.","zh":"故事里，这个淘气鬼捉弄大人，但并无恶意。"}]},{"partOfSpeech":"adj.","definition":{"en":"mischievous; roguish; playfully “naughty.”","zh":"淘气的；顽皮的；带点“坏坏的（但开玩笑的）”。"},"examples":[{"en":"He gave a coquin smile and walked away.","zh":"他露出一个坏坏的笑容就走开了。"},{"en":"The child’s coquin grin told everyone a prank was coming.","zh":"孩子那淘气的坏笑让大家知道恶作剧要来了。"}]}],"synonyms":["rascal","scamp","imp","rogue","mischief-maker"],"phonetic":"/ˈkoʊkæn/","extraExplanation":["“Coquin”是法语词，在英语里属于比较少见的外来词，语气通常偏俏皮、调侃，类似 rascal / scamp / imp。使用时要注意语境：在亲密或轻松场合可以很可爱；在正式场合可能显得不自然或被误解。","在法语里它也可带更负面的“无赖/卑鄙的人”含义，但英语借用时更常取轻松的“淘气鬼”语感。"]}
{"word":"coquina","summary":{"en":"Coquina is a shell-rich limestone often found near coasts and used as building stone.","zh":"Coquina 指富含贝壳碎片的石灰岩，常见于海岸附近，也可用作建筑石材。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of soft, porous limestone made mostly of broken shells and coral fragments, often used as a building stone.","zh":"一种由大量贝壳碎片和珊瑚碎屑胶结形成的松软多孔石灰岩，常被用作建筑石材。"},"examples":[{"en":"The old fort was built from coquina, so cannonballs often sank into the walls instead of shattering them.","zh":"那座古老的要塞是用贝壳石灰岩（coquina）建的，所以炮弹常常陷进墙里，而不是把墙炸碎。"},{"en":"On some beaches, you can find coquina rock full of tiny shell pieces.","zh":"在一些海滩上，你能看到充满细小贝壳碎片的贝壳石灰岩（coquina）。"}]}],"synonyms":["shell limestone","bioclastic limestone"],"phonetic":"/koʊˈkiːnə/","extraExplanation":["“coquina”来自西班牙语，意思是“贝壳类/小贝壳”。在美国佛罗里达州（如圣奥古斯丁附近）很有名，常见于沿海地层与历史建筑。","由于coquina较软且有弹性，早期战斗中炮弹可能嵌入墙体而不易造成碎裂，因此在军事建筑史上常被提及。"]}
{"word":"coquinas","summary":{"en":"“Coquinas” means plural coquina: a shell-fragment limestone often used as a building stone.","zh":"“coquinas”是 coquina 的复数：一种由贝壳碎片胶结形成的石灰岩，常用于建筑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A soft limestone made mostly of cemented shell fragments; often used as a building stone. (“Coquinas” is the plural of “coquina.”)","zh":"（coquina 的复数）一种由大量贝壳碎片胶结而成的松软石灰岩；常被用作建筑石材。"},"examples":[{"en":"The walls were built from coquina, a rock made of packed shell fragments.","zh":"这些墙是用 coquina 建成的，这是一种由密集贝壳碎片组成的岩石。"},{"en":"On the beach, you can sometimes find coquinas exposed where waves have worn away the sand.","zh":"在海滩上，有时海浪冲刷掉沙子后会露出 coquinas。"},{"en":"Geologists study coquinas to learn about ancient coastal environments.","zh":"地质学家研究 coquinas，以了解古代海岸环境。"}]}],"synonyms":["shell limestone","coquinoid limestone","shelly limestone"],"phonetic":"/koʊˈkiːnəz/","extraExplanation":["“Coquina”来自西班牙语，原意与“贝壳”有关；在英语里专指一种由贝壳碎屑胶结形成的石灰岩。","在美国佛罗里达州（如圣奥古斯丁一带）很有名：当地历史建筑曾使用 coquina，因为它相对柔软、能吸收炮弹冲击，不像硬石那样容易碎裂。","不要和海滩上的小贝类“coquina clams（小蛤/小贝）”混淆：那是动物；这里的 coquina/coquinas 指岩石。"]}
{"word":"coquita","summary":{"en":"Coquita is a Spanish-based word meaning “little coconut,” often used as an affectionate nickname; it can also be used as a name or, regionally, for a small coconut/coconut sweet.","zh":"Coquita 源自西班牙语，意为“小椰子”，常用作亲昵昵称；也可作名字使用，在部分地区还可指小椰子/椰子甜点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Spanish, informal) “Little coconut”; used as a nickname/term of endearment, and sometimes used regionally to refer to a small coconut or a coconut sweet.","zh":"（源自西班牙语，非正式）“小椰子”；可作昵称/爱称，在一些地区也可指小椰子或椰子类甜点。"},"examples":[{"en":"Her family calls her Coquita as a sweet nickname.","zh":"她家人用 Coquita 当作亲昵的昵称来叫她。"},{"en":"In some places, people might say coquita for a small coconut.","zh":"在某些地方，人们可能用 coquita 指“小椰子”。"}]},{"partOfSpeech":"n.","definition":{"en":"A feminine given name or nickname used in Spanish-speaking communities (spelling varies).","zh":"西语社群中使用的女性名字或昵称（拼写可能不同）。"},"examples":[{"en":"Coquita is what everyone calls her at home, but her legal name is longer.","zh":"家里大家都叫她 Coquita，但她的法定名字更长。"}]}],"synonyms":["little coconut","nickname (term of endearment)","diminutive (Spanish)"],"phonetic":"/koʊˈkiːtə/","extraExplanation":["“coquita”常见于西班牙语语境：-ita 是很常见的指小/亲昵的后缀（如 casa→casita 小房子）。因此 coquita 往往带有“可爱、亲近”的语气。","在英文语境里看到 Coquita，多半是人名/昵称或带文化色彩的用法；具体指“椰子甜点”或“某种小椰子”时，通常取决于当地说法与家族/社区习惯。"]}
{"word":"Coquitlam","summary":{"en":"Coquitlam is a city near Vancouver in British Columbia, Canada.","zh":"Coquitlam（高贵林）是加拿大BC省温哥华附近的一座城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in British Columbia, Canada, just east of Vancouver, in the Metro Vancouver region.","zh":"加拿大不列颠哥伦比亚省（BC省）的一座城市，位于温哥华以东，属于大温哥华地区（Metro Vancouver）。"},"examples":[{"en":"She lives in Coquitlam and commutes to downtown Vancouver.","zh":"她住在高贵林（Coquitlam），通勤去温哥华市中心。"},{"en":"We took the SkyTrain to Coquitlam for dinner.","zh":"我们坐天车（SkyTrain）去高贵林吃晚饭。"},{"en":"Coquitlam is known for parks and easy access to nature.","zh":"高贵林以公园多、亲近自然而闻名。"}]}],"synonyms":["Coquitlam, BC","City of Coquitlam"],"phonetic":"/koʊˈkwɪtləm/","extraExplanation":["“Coquitlam”是专有名词，常见用法包括：in Coquitlam（在高贵林）、to Coquitlam（去高贵林）、Coquitlam City Hall（高贵林市政厅）。","美式英语里常听到近似“koh-KWIT-lum”的读法；但人名/地名在不同口音中会有细微差异。","名称来源与当地原住民语言有关（历史上与当地原住民族群及地理环境联系紧密），在正式场合使用正确拼写与尊重当地称呼很重要。"]}
{"word":"coquitlam","summary":{"en":"Coquitlam is a city in Metro Vancouver, British Columbia, Canada.","zh":"Coquitlam 是加拿大不列颠哥伦比亚省大温哥华地区的一座城市（中文常译“高贵林”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in Metro Vancouver, British Columbia, Canada, known for its parks, suburban neighborhoods, and access to nature.","zh":"加拿大不列颠哥伦比亚省（BC）大温哥华地区的一座城市，以公园、郊区社区与亲近自然的环境而闻名。"},"examples":[{"en":"I live in Coquitlam, so my commute to downtown Vancouver takes about 40 minutes.","zh":"我住在高贵林（Coquitlam），所以去温哥华市中心通勤大约要40分钟。"},{"en":"We went hiking near Coquitlam on the weekend.","zh":"周末我们去高贵林附近徒步了。"}]}],"phonetic":"/koʊˈkwɪtləm/","extraExplanation":["“Coquitlam”是地名专有名词，常见于加拿大语境；中文常译为“高贵林”。","读音里重音通常在第二音节（-KWIT-），很多学习者会把中间的 /kw/ 念得太轻。","该地名与当地原住民（First Nations）语言与历史有关；在提到地名来源时，保持尊重与准确表述会更合适。"]}
{"word":"coquito","summary":{"en":"Coquito is a Puerto Rican coconut holiday drink, often made with rum and warm spices.","zh":"Coquito 是波多黎各的椰香节日饮品，常加入朗姆酒与香料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditional Puerto Rican coconut-based holiday drink, usually mixed with rum and spices (similar to eggnog but made with coconut).","zh":"波多黎各传统的椰香节日饮品，常加入朗姆酒和香料（类似蛋酒，但以椰子为主）。"},"examples":[{"en":"My friend brought homemade coquito to the Christmas party.","zh":"我朋友带了自制的 coquito 去参加圣诞派对。"},{"en":"Some families make coquito without alcohol so kids can drink it too.","zh":"有些家庭会做不含酒精的 coquito，这样孩子也能喝。"}]}],"synonyms":["coconut eggnog","Puerto Rican eggnog"],"phonetic":"/koʊˈkiːtoʊ/","extraExplanation":["Coquito 在西语里字面意思接近“小椰子/椰子小饮”，在波多黎各与加勒比文化中很有代表性，尤其常见于感恩节到圣诞节、新年期间的家庭聚会。","常见做法会用椰奶/椰浆（coconut milk/cream）、炼乳（condensed milk）、香草、肉桂与朗姆酒；不同家庭会有“祖传配方”，也常装瓶当作节日礼物。","在美国本土的拉丁裔社群（尤其纽约、新泽西、佛州等地）也很常见；点餐或社交场合提到 coquito，通常带有温暖的节庆与家族传统的文化意味。"]}
{"word":"coquitos","summary":{"en":"Coquitos can mean coconut cookies or Puerto Rican coconut-rum holiday drinks, depending on context.","zh":"Coquitos 可能指椰子饼干，也可能指波多黎各的椰香朗姆节庆饮品，需看语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural) Small coconut cookies, especially a Latin American style made with shredded coconut; often called “coconut macaroons” in English.","zh":"（复数）椰子小饼干，尤指拉丁美洲常见的椰丝饼；英语里常被称为“coconut macaroons（椰蓉马卡龙/椰子小圆饼）”。"},"examples":[{"en":"My neighbor brought coquitos—chewy coconut cookies—for the holiday party.","zh":"邻居带来了 coquitos（嚼劲十足的椰子饼干）参加节日聚会。"},{"en":"These coquitos are made with shredded coconut, sugar, and egg whites.","zh":"这些 coquitos 用椰丝、糖和蛋白做成。"}]},{"partOfSpeech":"n.","definition":{"en":"(Plural) Puerto Rican coconut rum drinks (plural of coquito), often served at Christmas; similar to eggnog.","zh":"（复数）波多黎各的椰香朗姆节庆饮品（coquito 的复数），圣诞节常喝，口感类似蛋奶酒。"},"examples":[{"en":"At Christmas, my family makes coquitos with coconut milk and rum.","zh":"圣诞节时，我家会用椰奶和朗姆酒做 coquitos。"},{"en":"She poured two coquitos for the guests and sprinkled cinnamon on top.","zh":"她给客人倒了两杯 coquitos，上面撒了些肉桂粉。"}]}],"synonyms":["coconut macaroons","coquito (drink)","coconut cookies"],"phonetic":"/koʊˈkiːtoʊs/","extraExplanation":["“Coquitos”来自西班牙语：coquito 是 coco（椰子）的指小词，字面有“椰子小可爱/小椰子”的感觉。不同地区用法不一：有的地方更常指椰子饼干，有的地方（尤其波多黎各）更常指节庆椰子朗姆饮品。","在英语语境里，如果你在食谱/节庆派对上看到 coquitos，需要结合上下文判断是“饼干”还是“饮品”；出现 rum（朗姆酒）、Christmas（圣诞）、eggnog（蛋奶酒）时，多半指饮品。"]}
