{"word":"COT","summary":{"en":"A cot is a small simple bed, often portable; in British English it can also mean a baby’s bed (US: crib).","zh":"cot 指简易小床（常可折叠、便携）；在英式英语里也可指婴儿床（美式多说 crib）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, simple bed (often portable), especially for camping or temporary use","zh":"（尤指露营或临时使用的）简易小床；行军床；折叠床"},"examples":[{"en":"We slept on cots in the gym during the storm.","zh":"暴风雨期间，我们在体育馆里睡行军床。"},{"en":"Bring a cot if you don’t want to sleep on the floor.","zh":"如果你不想睡地板，就带一张折叠床。"}]},{"partOfSpeech":"n.","definition":{"en":"a baby’s bed with high sides (more common in British English; often called a “crib” in American English)","zh":"婴儿床（英式英语更常用；美式英语多说 crib）"},"examples":[{"en":"The baby is asleep in her cot.","zh":"宝宝在她的婴儿床里睡着了。"},{"en":"They put a soft blanket in the cot.","zh":"他们在婴儿床里放了一条柔软的毯子。"}]}],"synonyms":["camp bed","folding bed","crib (for baby bed in US)"],"phonetic":"/kɑt/","extraExplanation":["在美式英语里，cot 最常指“行军床/折叠床”（camping cot）。而“婴儿床”更常说 crib（如：baby crib）。在英式英语里，cot 常用来指“婴儿床”。所以在跨文化交流中，最好根据场景补充说明（camping cot / baby cot）。"]}
{"word":"cot","summary":{"en":"Cot most commonly means a small bed (for a baby or a folding camp bed). It can also mean a simple cottage or shelter.","zh":"Cot 最常见指小床（婴儿床或折叠行军床）；也可指简陋的小屋/棚屋。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, simple bed, especially for a baby; also a light folding bed used for camping (BrE often: camp bed).","zh":"（尤指婴儿用的）小床；也指轻便的折叠床/行军床（英式英语常说 camp bed）。"},"examples":[{"en":"The baby is asleep in her cot.","zh":"宝宝在她的小床里睡着了。"},{"en":"We brought a cot for the camping trip.","zh":"我们露营时带了一张折叠床。"}]},{"partOfSpeech":"n.","definition":{"en":"a small, plain shelter or house, usually in the countryside (often in compounds like “shepherd’s cot”).","zh":"（通常在乡下的）简陋小屋/棚屋（常用于复合词，如 shepherd’s cot）。"},"examples":[{"en":"A lonely cot stood near the edge of the field.","zh":"田边矗立着一间孤零零的小屋。"}]},{"partOfSpeech":"v.","definition":{"en":"to lie down or sleep (rare; usually used with “to cot down”).","zh":"躺下或睡觉（较少见；常用 cot down）。"},"examples":[{"en":"We cotted down in the living room after the long drive.","zh":"长途开车后，我们在客厅里躺下休息。"}]}],"synonyms":["crib","camp bed","folding bed","bunk","cottage (small house sense)"],"phonetic":"/kɑt/","extraExplanation":["在美式英语里，婴儿床更常说 crib；而 cot 在美式里常让人想到“折叠床/行军床”。在英式英语里，cot 很常用来指“婴儿床”。","词源上 cot 与古英语/日耳曼语中“棚屋、小屋”的词有关，所以它也能表示“简陋的小屋”。"]}
{"word":"Cotabato","summary":{"en":"Cotabato is a Philippine place name, usually referring to Cotabato Province in Mindanao and sometimes to the area around Cotabato City.","zh":"Cotabato 是菲律宾地名，通常指棉兰老岛的哥打巴托省，有时也指哥打巴托市周边相关地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name in the Philippines, commonly referring to a province in Mindanao (North Cotabato, now officially “Cotabato Province”) and/or the area historically associated with Cotabato City.","zh":"菲律宾的地名，常指棉兰老岛的一個省份（北哥打巴托，现官方名为“哥打巴托省”）以及/或历史上与哥打巴托市相关的地区。"},"examples":[{"en":"Cotabato is located on the island of Mindanao in the southern Philippines.","zh":"哥打巴托位于菲律宾南部的棉兰老岛。"},{"en":"She traveled from Davao to Cotabato for a family visit.","zh":"她从达沃前往哥打巴托探亲。"},{"en":"Cotabato City is nearby, but it is administratively separate from Cotabato Province.","zh":"哥打巴托市就在附近，但在行政上与哥打巴托省是分开的。"}]}],"synonyms":["Cotabato Province","Cotabato City","Mindanao"],"phonetic":"/ˌkoʊtəˈbɑːtoʊ/","extraExplanation":["“Cotabato”常让学习者困惑的点在于它既可能指“省”，也可能指“哥打巴托市（Cotabato City）”。日常英语里，人们会根据上下文判断具体所指；较正式写法常用“Cotabato Province”或直接写现行省名（如在新闻/政府语境中）。","词源常被认为与马京达瑙语（Maguindanaon）中表示“石头堡垒/石头城”的说法有关，反映当地历史与地理特征。"]}
{"word":"cotabulate","summary":{"en":"Cotabulate means to put data into a table together, often by combining sources or by cross-tabulating two variables.","zh":"Cotabulate 指把数据一起制成表格，常见于合并数据或做交叉列表（交叉表）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to tabulate (arrange in a table) information together, often by combining results from different sources or categories","zh":"把（信息）一起列表整理；将来自不同来源或类别的数据合并成表"},"examples":[{"en":"After each team finished its report, the manager cotabulated the numbers into one summary table.","zh":"每个团队完成报告后，经理把数字一起汇总成一张总表。"},{"en":"We cotabulated the survey results from three cities to compare overall trends.","zh":"我们把三个城市的调查结果合并列表，以比较总体趋势。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cross-tabulate: to organize data so you can compare two variables in the same table (e.g., age by preference)","zh":"（统计）做交叉列表；把两个变量放在同一张表里对照比较（如“年龄 × 偏好”）"},"examples":[{"en":"The researcher cotabulated age and reading habits to see whether the pattern changed by generation.","zh":"研究者把年龄和阅读习惯做交叉列表，看看不同世代是否有差异。"},{"en":"In the spreadsheet, you can cotabulate department and cost type to spot where money is going.","zh":"在电子表格里，你可以把部门和费用类型做交叉列表，找出钱花到哪里去了。"}]}],"synonyms":["tabulate together","combine (in a table)","cross-tabulate","compile","aggregate"],"phonetic":"/ˌkoʊˈtæb.jəˌleɪt/","extraExplanation":["“cotabulate”较少见，更常见的说法是“tabulate together / combine tables”或在统计语境下用“cross-tabulate（做交叉表）”。","在学术研究、市场调查、数据分析写作中更可能出现；日常口语里通常不会用这个词。"]}
{"word":"cotan","summary":{"en":"“cotan” is a less common way to write the trigonometric function cotangent (cot).","zh":"“cotan”是三角函数“余切”（cotangent，常写作 cot）的较不常见写法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the cotangent (cot) trigonometric function; in a right triangle, cot(θ) = adjacent ÷ opposite; also equal to 1 ÷ tan(θ).","zh":"（三角函数）余切（cot）；在直角三角形中 cot(θ)=邻边÷对边；也等于 1÷tan(θ)。"},"examples":[{"en":"In a right triangle, cotan(θ) equals the adjacent side divided by the opposite side.","zh":"在直角三角形中，cotan(θ) 等于邻边除以对边。"},{"en":"Since cotan(θ) = 1/tan(θ), you can use it when tangent is hard to compute directly.","zh":"因为 cotan(θ)=1/tan(θ)，当正切不容易直接计算时可以用它来转换。"},{"en":"The calculator label is usually “cot,” not “cotan.”","zh":"计算器上通常标的是“cot”，而不是“cotan”。"}]}],"synonyms":["cot","cotangent"],"phonetic":"/koʊˈtæn/","extraExplanation":["“cotan”常见于教材、笔记或旧式写法，现代数学里更常写作“cot”。","在单位圆定义中，cot(θ)=cos(θ)/sin(θ)；因此当 sin(θ)=0（例如 0°, 180°）时，cot(θ) 无定义。","作为函数名，“cotangent”是正式全称；“cot”是最常用缩写，“cotan”较少见但可理解为同一个意思。"]}
{"word":"cotangent","summary":{"en":"Cotangent (cot) is a trigonometric ratio: cos(θ)/sin(θ) = 1/tan(θ), or adjacent/opposite in a right triangle.","zh":"Cotangent（余切，cot）是三角比：cos(θ)/sin(θ)=1/tan(θ)，在直角三角形中为邻边/对边。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In trigonometry, the cotangent of an angle (cot) is a ratio: cos(θ) ÷ sin(θ), equal to 1 ÷ tan(θ). In a right triangle, it is adjacent side ÷ opposite side (for the given angle).","zh":"（三角学）余切（cot）是一个比值：cos(θ) ÷ sin(θ)，也等于 1 ÷ tan(θ)。在直角三角形中（针对某个角），它等于 邻边 ÷ 对边。"},"examples":[{"en":"To find cotangent, you can divide cosine by sine: cot(θ) = cos(θ)/sin(θ).","zh":"要求余切，可以用余弦除以正弦：cot(θ) = cos(θ)/sin(θ)。"},{"en":"In this right triangle, the cotangent of angle A is adjacent over opposite.","zh":"在这个直角三角形里，A 角的余切等于邻边比对边。"},{"en":"Since tan(θ) = 2, the cotangent is 1/2.","zh":"因为 tan(θ) = 2，所以 cot(θ) = 1/2。"}]}],"synonyms":["cot"],"phonetic":"/koʊˈtændʒənt/","extraExplanation":["“cotangent”常在数学课本或科学、工程语境中出现，日常口语里比较少用。通常缩写为“cot”。","余切在坐标几何中也可理解为某些线段斜率的相关比值；在函数图像里，y = cot(x) 是周期函数，但在 sin(x)=0 的点（如 0、π、2π…）无定义。"]}
{"word":"cotangential","summary":{"en":"Cotangential means “related to the cotangent (cot) function in trigonometry.”","zh":"cotangential 指“与三角函数余切（cot）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to or involving the cotangent function in trigonometry; sharing the same cotangent value.","zh":"与（三角函数的）余切有关的；涉及余切的；具有相同余切值的。"},"examples":[{"en":"In a right triangle, a cotangential relationship can be written using adjacent over opposite.","zh":"在直角三角形中，余切相关的关系可以用“邻边/对边”来表示。"},{"en":"The teacher asked us to solve a cotangential equation using trig identities.","zh":"老师让我们用三角恒等式解一个与余切有关的方程。"}]}],"synonyms":["cotangent-related","cotangent","trigonometric"],"phonetic":"/ˌkoʊtænˈdʒɛnʃəl/","extraExplanation":["“cotangential”是数学/三角学用语，来自“cotangent（余切）+ -ial/-al（形容词后缀）”。日常英语中不常见，更常用的是“cotangent”本身或短语“involving the cotangent function（涉及余切函数的）”。","余切函数记作 cot(x)，通常定义为 tan(x) 的倒数：cot(x)=cos(x)/sin(x)=1/tan(x)（在 sin(x)≠0 时）。"]}
{"word":"cotangents","summary":{"en":"Cotangents are cotangent values/functions for angles (plural of cotangent).","zh":"cotangents 是“余切”的复数，指多个角的余切值/余切函数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Mathematics) The plural of cotangent: trigonometric functions equal to 1 divided by the tangent of an angle (cot(x) = 1/tan(x)), or in a right triangle, adjacent side divided by opposite side.","zh":"（数学）cotangent 的复数：余切函数，等于角的正切的倒数（cot(x)=1/tan(x)）；在直角三角形中也可表示为“邻边/对边”。"},"examples":[{"en":"In trigonometry class, we learned that cotangents are the reciprocals of tangents.","zh":"在三角学课上，我们学到余切（cotangents）是正切（tangents）的倒数。"},{"en":"The graph compares sines, cosines, tangents, and cotangents on the same axes.","zh":"这张图在同一坐标轴上比较了正弦、余弦、正切和余切。"}]}],"synonyms":["cotangent","cot","cotangent function"],"phonetic":"/koʊˈtændʒənt/","extraExplanation":["“cotangent”常写作“cot”。在单位圆/三角函数中：cot(θ)=cos(θ)/sin(θ)，所以当sin(θ)=0（例如θ=0°, 180°）时cot(θ)无定义。","在英文里，数学术语的复数常用于泛指一类对象或多条曲线/多个角度对应的值，如“tangents and cotangents”。"]}
{"word":"cotans","summary":{"en":"“cotan” is a common math abbreviation for the cotangent function; “cotans” is its plural form.","zh":"“cotan”是余切函数的常见数学缩写；“cotans”是其复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(math) The cotangent function; “cotan(x)” is a common abbreviation for cotangent of x.","zh":"（数学）余切函数；“cotan(x)”常用作 cotangent（x 的余切）的缩写。"},"examples":[{"en":"In trigonometry, cotan(x) equals cos(x) divided by sin(x).","zh":"在三角学中，cotan(x) 等于 cos(x) 除以 sin(x)。"},{"en":"The worksheet asks you to simplify cotan(45°).","zh":"练习题要求你化简 cotan(45°)。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) “Cotans” means more than one value or expression of the cotangent function (e.g., for different angles).","zh":"（复数）“cotans”指多个余切值或余切表达式（例如不同角度对应的余切）。"},"examples":[{"en":"We compared the cotans of several angles to see the pattern.","zh":"我们比较了几个角的 cotans 来观察规律。"},{"en":"The table lists sines, cosines, tangents, and cotans.","zh":"表格列出了正弦、余弦、正切和余切。"}]}],"synonyms":["cot","cotangent"],"phonetic":"/koʊˈtæn/","extraExplanation":["“cotan”多见于数学笔记或教材中的简写；更正式的写法是“cot(x)”或直接写“cotangent(x)”。","余切与正切互为倒数：cot(x)=1/tan(x)（在 tan(x) 不为 0 时）。它也常出现在微积分里，例如 d/dx(cot x) = −csc²x。"]}
{"word":"cotarius","summary":{"en":"A rare historical term for a medieval cotter: a peasant tenant with a small cottage and small holding, owing rent or labor.","zh":"一个罕见的历史词，指中世纪的“住小屋的小佃农”（cotter）：拥有小屋和少量土地，需交租或服劳役。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical, rare) A medieval peasant or tenant who held a small cottage and a small piece of land in return for rent and/or labor; a cotter.","zh":"（历史用语，较少见）中世纪的佃农/小农户：拥有小屋（cottage）及少量土地，以交租或服劳役为代价；相当于 cotter。"},"examples":[{"en":"In some manorial records, the cotarius owed several days of labor each week to the lord.","zh":"在一些庄园档案中，cotarius 每周要为领主服好几天劳役。"},{"en":"The village listed three cotarii who lived on the edge of the fields.","zh":"村庄名册上记有三户 cotarii，住在田地边缘。"}]}],"synonyms":["cotter","cottar","cottager (historical sense)"],"phonetic":"/koʊˈtɛriəs/","extraExplanation":["“cotarius”（常见复数 cotarii）多见于中世纪拉丁文或英格兰庄园制度（manorial system）的文书记录，属于偏学术/档案语境的词。现代英语日常更常用 “cotter / cottar” 或直接说 “tenant farmer”。","词源上与 “cot（小屋）/ cottage（小屋、农舍）”同源，强调其土地规模小、地位低于较富裕的自由佃农（如 yeoman）这一社会背景。"]}
{"word":"cotarnin","summary":{"en":"Cotarnin is a rare scientific noun meaning a specific chemical compound (an alkaloid derivative) mainly mentioned in pharmacology/chemistry contexts.","zh":"Cotarnin 是较少见的科研名词，指一种特定的化学化合物（生物碱衍生物），多见于药理学/化学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (an alkaloid derivative) historically studied in pharmacology; it is related to substances found in opium poppy chemistry and has been used mainly in research contexts rather than everyday medicine.","zh":"一种化学化合物（生物碱衍生物），历史上在药理学中被研究；与罂粟/鸦片相关的化学体系有关，主要用于科研语境，而非日常医疗用语。"},"examples":[{"en":"Cotarnin appears in older pharmacology texts as a compound studied for its biological effects.","zh":"在较早的药理学文献中，cotarnin 常被提到，用于研究其生物效应。"},{"en":"The paper measured cotarnin levels using laboratory analysis rather than clinical tests.","zh":"该论文使用实验室分析而非临床检测来测量 cotarnin 的含量。"}]}],"synonyms":["cotarnine"],"phonetic":"/koʊˈtɑrniːn/","extraExplanation":["“cotarnin”更常见的拼写是 **cotarnine**（以 -e 结尾），不同资料可能出现拼写差异。若你是在课本/论文里看到这个词，可以对照原文的拼写与上下文确认。","这是偏专业的化学/药理学词汇，日常英语中几乎不会用到；阅读时可把它当作“某种特定化学物质的名称”来理解即可。"]}
{"word":"cotarnine","summary":{"en":"Cotarnine is a specialized chemistry/pharmacology term for an alkaloid derived from noscapine, sometimes noted historically for anti-bleeding use in certain salts.","zh":"Cotarnine（可他宁）是化学/药学专门词，指一种由那可汀（noscapine）衍生的生物碱，历史上其某些盐类曾被提到具有止血用途。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (an alkaloid) originally obtained from the opium alkaloid noscapine (also called narcotine), used mainly in laboratory and some medical contexts (for example, in certain salts as a hemostatic/anti-bleeding agent).","zh":"一种化学化合物（生物碱），最初可由鸦片生物碱那可汀（noscapine，也称narcotine）衍生获得，主要用于实验室及部分医疗场景（例如其某些盐类曾用作止血/抗出血药）。"},"examples":[{"en":"Cotarnine is studied as a derivative of noscapine found in opium poppy chemistry.","zh":"可他宁（cotarnine）常作为源自那可汀（noscapine）的衍生物，在鸦片罂粟相关化学研究中被讨论。"},{"en":"In older medical texts, cotarnine salts may be mentioned as agents used to help control bleeding.","zh":"在较早的医学文献中，可能会提到可他宁的盐类曾被用作帮助控制出血的药物。"}]}],"synonyms":["cotarnine chloride","cotarnine (alkaloid)"],"phonetic":"/koʊˈtɑːrniːn/","extraExplanation":["“cotarnine”属于药学/化学专门词汇，日常英语中很少使用；更常见于论文、药典或老式医学资料中。","历史上常见的相关形式是“cotarnine chloride（可他宁氯化物）”等盐类，被描述为“styptic（止血剂）”；现代临床使用情况因地区与指南不同而差异很大，阅读资料时建议结合年代与来源判断。","词源上与鸦片生物碱研究有关：noscapine（narcotine）在化学转化/代谢研究中可得到多种衍生物，“cotarnine”是其中一个名称。"]}
{"word":"Cotati","summary":{"en":"Cotati is a city in Sonoma County, Northern California.","zh":"Cotati 是美国加州北部索诺马县的一座城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small city in Sonoma County, Northern California, U.S.","zh":"（美国）加利福尼亚州北部索诺马县的一座小城市——科塔蒂（Cotati）。"},"examples":[{"en":"Cotati is located about 45 miles north of San Francisco.","zh":"科塔蒂位于旧金山以北大约45英里处。"},{"en":"We stopped in Cotati for lunch on our way to the coast.","zh":"我们去海岸的路上在科塔蒂停下来吃了午饭。"}]}],"phonetic":"/koʊˈtɑːti/","extraExplanation":["Cotati 是专有名词（地名），英语里通常大写。日常使用时多出现在地址、旅游、新闻或校名中（例如与当地的 Sonoma State University 周边地区相关）。","“Cotati”这个名字一般被认为源自当地原住民语言（常见说法与 Coast Miwok 等群体有关），但具体词源与含义在不同资料中可能有差异；如果你需要写作或引用，建议以当地历史机构或市政网站的说明为准。"]}
{"word":"cotbetty","summary":{"en":"“cotbetty” isn’t a recognized English word; it’s likely a typo or a username/compound form.","zh":"“cotbetty”不是常见英语词；更可能是拼写错误、用户名或拼合形式。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a typo, a username/handle, or a combined form of two words (for example, “cot” + “Betty”).","zh":"不是标准英语单词。可能是拼写错误、用户名/网名，或把两个词拼在一起（例如“cot”+“Betty”）。"},"examples":[{"en":"I couldn’t find “cotbetty” in an English dictionary—did you mean “cot” or “Betty”?","zh":"我在英语词典里找不到“cotbetty”——你是不是想写“cot”或“Betty”？"},{"en":"The account name “cotbetty” appears to be a username rather than a vocabulary word.","zh":"“cotbetty”这个账号名看起来更像用户名，而不是词汇单词。"}]}],"phonetic":"/kɑt ˈbɛti/","extraExplanation":["这个词在常见英英词典中没有收录。为了帮你更准确，我需要你确认：\n1）你是在哪看到的（聊天、小说、游戏、品牌、社交媒体）？\n2）它是否应该有空格或连字符（如“cot Betty”“cot-betty”）？\n3）你想查的是不是其中一部分：\n- cot /kɑt/：婴儿床；简易行军床\n- Betty /ˈbɛti/：女性名“贝蒂”\n把上下文句子发我，我可以按真实用法解释。"]}
{"word":"cotch","summary":{"en":"Cotch means a wedge/block used to stop or steady something (often a wheel), or the act of securing something with such a wedge.","zh":"cotch 指用来阻挡或固定物体（常指车轮）的楔块/止轮块，也可作动词表示用楔块把物体卡住、固定住。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wedge, block, or pin used to stop or steady something (especially a wheel)","zh":"（尤指车轮的）楔块、止轮木或销子，用来阻止或固定物体"},"examples":[{"en":"They put a wooden cotch under the wheel so the cart wouldn’t roll.","zh":"他们在车轮下塞了一块木楔块（cotch），防止手推车滑动。"},{"en":"Before unloading, make sure the wheels have a cotch in place.","zh":"卸货前，先确认车轮已经垫好止轮块（cotch）。"}]},{"partOfSpeech":"v.","definition":{"en":"to stop, steady, or secure something by using a wedge or block","zh":"用楔块/止轮块把某物卡住、固定住"},"examples":[{"en":"Cotch the wheel before you work underneath the trailer.","zh":"在拖车底下作业前，先把轮子用楔块卡住固定。"},{"en":"The door was cotched open with a stone.","zh":"门用一块石头顶住（cotched open）保持打开。"}]}],"synonyms":["chock","wedge","block","brace","secure"],"phonetic":"/kɑtʃ/","extraExplanation":["“cotch”在现代英语里比较少见，常见于较旧的书面语、方言或特定行业语境（如车轮防滑/固定）。日常更常用的是“chock”（止轮块）或“to chock a wheel”。","它的用法和“chock”非常接近：名词可指止轮块，动词可指用止轮块固定。读到旧文本里看到“cotch”，可以先按“chock/stop/secure”来理解。"]}
{"word":"Cote","summary":{"en":"A “cote” is a small shelter or enclosure for animals, especially pigeons or sheep.","zh":"“cote”指动物用的小棚或圈舍，尤指鸽舍或羊圈等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small shelter or pen for animals (especially birds like pigeons, or sheep); often used in compounds like “dovecote” or “sheepcote.”","zh":"（动物的）小棚/圈舍（尤指鸽舍或羊圈）；常见于复合词，如 dovecote（鸽舍）、sheepcote（羊圈）。"},"examples":[{"en":"They kept pigeons in a small cote behind the barn.","zh":"他们把鸽子养在谷仓后面的一个小鸽舍里。"},{"en":"The shepherd repaired the sheepcote before winter.","zh":"牧羊人在冬天前修好了羊圈。"}]}],"synonyms":["pen","shed","coop (for chickens)","dovecote (specific)","fold (for sheep)"],"phonetic":"/koʊt/","extraExplanation":["“Cote”在现代英语里较少单独使用，更常出现在复合词里：dovecote（养鸽子的棚/舍）、sheepcote（羊圈）、hen-cote（鸡舍）。","词源上与“cot”（小屋、简陋住处）有关，都有“遮蔽、栖身之处”的意思。"]}
{"word":"cote","summary":{"en":"Cote means a small shelter—often a sheepfold or a bird house (dovecote).","zh":"cote 指小型棚舍，常指羊圈或鸽舍等鸟舍。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small shelter or simple building for animals, especially sheep (a sheepfold).","zh":"（尤指羊的）圈、棚、畜舍；羊圈。"},"examples":[{"en":"The farmer led the sheep back to the cote before dark.","zh":"农夫在天黑前把羊赶回羊圈。"},{"en":"They repaired the old cote after the storm.","zh":"暴风雨后，他们修好了旧羊棚。"}]},{"partOfSpeech":"n.","definition":{"en":"A shelter or coop for birds, especially a dovecote (a house for pigeons/doves).","zh":"（尤指鸽子的）鸽舍、鸽棚。"},"examples":[{"en":"A few pigeons rested quietly in the cote.","zh":"几只鸽子安静地待在鸽舍里。"},{"en":"The castle once had a stone dovecote.","zh":"那座城堡曾经有一座石制鸽舍。"}]},{"partOfSpeech":"n.","definition":{"en":"A small, plain shelter or hut.","zh":"（简陋的）小屋、棚屋。"},"examples":[{"en":"He slept in a little cote near the fields.","zh":"他睡在田边的一间小棚屋里。"}]}],"synonyms":["pen","shed","coop","sheepfold","dovecote"],"phonetic":"/koʊt/","extraExplanation":["“cote”是较偏文学或旧式用法的词，在现代日常英语里更常见的是“pen / shed / coop”，而表示鸽舍时常直接说“dovecote”。","词源上来自古法语/拉丁语系，核心含义是“棚、窝、简易的遮蔽处”，所以既可指羊圈，也可指鸟舍。"]}
{"word":"Coteau","summary":{"en":"A geographic term meaning a ridge or gently sloping upland, often seen in place names.","zh":"地理词，指山脊或缓坡高地，常见于地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a ridge or line of hills; a gently sloping upland or high bank (often used in geography and place names).","zh":"（地理）丘陵脊、山脊；缓坡的高地或高岸（常用于地名）"},"examples":[{"en":"The trail follows the coteau above the river valley.","zh":"这条步道沿着河谷上方的丘陵脊延伸。"},{"en":"Farmers planted wheat on the coteau because the ground was drier.","zh":"农民在这片高地上种小麦，因为地势更干燥。"},{"en":"Many towns on the Canadian Prairies sit along a coteau.","zh":"加拿大草原地区的许多城镇都坐落在一条丘陵带上。"}]}],"synonyms":["ridge","hill","upland","rise","escarpment"],"phonetic":"/koʊˈtoʊ/","extraExplanation":["“coteau”源自法语，字面意思是“山坡/小丘”。在北美（尤其加拿大、美国北部平原地区）的地名和地貌描述中较常见，例如某些地区会用它指一条较长的丘陵带或高地边缘。日常口语中不算高频词，更常见的对应词是 ridge / hill / upland。"]}
{"word":"coteau","summary":{"en":"Coteau means a small hill or ridge, especially a raised upland area on the North American prairies.","zh":"coteau 指小丘或山脊，尤指北美大草原上高于周围地势的高地/台地。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small hill or ridge; a raised area of land (often used in place names).","zh":"小丘；山脊；隆起的高地（常见于地名中）"},"examples":[{"en":"They hiked up the coteau to get a better view of the valley.","zh":"他们爬上那道山脊，以便更好地俯瞰山谷。"},{"en":"The town sits on a coteau above the river.","zh":"小镇坐落在河流上方的一片高地上。"}]},{"partOfSpeech":"n.","definition":{"en":"In the Great Plains of North America, an upland area or plateau-like ridge rising above surrounding flat prairie.","zh":"（北美大平原地区）高于周围平坦草原的高地或台地状山脊"},"examples":[{"en":"Winds can be stronger on the coteau than down on the prairie floor.","zh":"在高地（coteau）上风往往比草原低地更大。"},{"en":"The farm lies near the Missouri Coteau, where the land gently rises.","zh":"农场靠近密苏里高地（Missouri Coteau），那里的地势缓缓抬升。"}]}],"synonyms":["ridge","hill","upland","rise","escarpment","plateau"],"phonetic":"/koʊˈtoʊ/","extraExplanation":["“coteau”来自法语，原意与“山坡/高地”有关。在加拿大和美国北部的地理名称里很常见（例如 Missouri Coteau），多由法语探险者或制图者命名。","在地理语境中它常指“比周围更高、起伏较缓的高地/台地”，不一定是陡峭的山。"]}
{"word":"coteaux","summary":{"en":"“Coteaux” (French) means hillsides/slopes, especially vineyard slopes, often seen in wine-region names.","zh":"“coteaux”（法语）指山坡/坡地，尤指葡萄园坡地，常见于葡萄酒产区名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Hillsides or slopes (especially vineyard-covered slopes), often used in place names or when talking about wine regions.","zh":"山坡；丘陵斜坡（常指葡萄园覆盖的坡地），常用于地名或葡萄酒产区语境。"},"examples":[{"en":"The wine comes from the coteaux above the river, where the vines get plenty of sun.","zh":"这款酒来自河流上方的山坡葡萄园，那里的葡萄藤日照充足。"},{"en":"They hiked along the coteaux and looked down over the valley.","zh":"他们沿着山坡徒步，俯瞰山谷。"}]}],"synonyms":["hillsides","slopes","hillslopes","vineyard slopes"],"phonetic":"/koʊˈtoʊ/","extraExplanation":["“coteaux”是法语名词“coteau”（小山坡、坡地）的复数形式，英语里多见于葡萄酒标签、产区名称或与法国地理相关的文本中，如“Coteaux du Layon”“Coteaux Champenois”。","发音和拼写在英文语境中常保持法语风格；在一般日常英语里，更常用“hillsides / slopes”。"]}
{"word":"coted","summary":{"en":"“Coted” is a rare/literary word meaning “having a cote (a small shelter/pen),” or the past form of “cote.”","zh":"“coted”较为罕见，多用于文学或历史语境，意为“有圈舍/小棚的”，也可作动词“cote”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Literary/rare) Provided with a cote (a small shelter or pen, especially for birds or sheep); often used in compounds like “dove-coted.”","zh":"（文学/罕见）有“cote”（小棚/圈舍，尤指鸽舍或羊圈）的；常见于合成词，如“dove-coted（有鸽舍的）”。"},"examples":[{"en":"The old manor stood dove-coted and quiet at the edge of the fields.","zh":"那座老庄园静静立在田野边，带着鸽舍。"},{"en":"A coted fold once kept the sheep safe from the wind.","zh":"从前那座带圈舍的羊栏曾让羊群免受寒风侵袭。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “cote” (to place or keep in a cote; to provide with a shelter).","zh":"“cote”的过去式/过去分词：把……置于圈舍/小棚中；为……建小棚或提供遮蔽处。"},"examples":[{"en":"The birds were coted for the night to protect them from predators.","zh":"为了防止天敌，鸟儿夜里被关进鸽舍。"},{"en":"In older writing, farmers sometimes wrote that they had coted their sheep.","zh":"在较早的文字里，农民有时会写他们把羊关进羊圈（coted their sheep）。"}]}],"synonyms":["sheltered","penned","housed","enclosed"],"phonetic":"/ˈkoʊtɪd/","extraExplanation":["“coted”在现代英语里非常少见，多出现在文学描写或历史语境中。日常写作里人们更常见的是拼写相近的“coated”（有涂层的/被覆盖的），例如：a sugar-coated pill（裹糖衣的药片）。如果你原本想表达“覆盖/涂层”，通常应写“coated”。","“cote”指小型圈舍或棚，常与鸟类（dovecote 鸽舍）或羊（sheepcote 羊圈）相关，因此“coted”也常以合成词形式出现，如 dove-coted。"]}
{"word":"coteen","summary":{"en":"Coteen is a rare/older word for a strong, thick cotton cloth; today people usually say “cotton.”","zh":"coteen是较少见/较旧的词，指结实厚棉布；现代英语通常用“cotton”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong, thick cotton cloth (often used for work clothes); an older or less common spelling of “cotton.”","zh":"一种结实、较厚的棉布（常用于耐磨的工作服等）；也可视为“cotton（棉/棉布）”的较旧或较少见拼写。"},"examples":[{"en":"The tailor recommended coteen because it holds up well for everyday wear.","zh":"裁缝推荐用coteen，因为它很耐穿，适合日常穿着。"},{"en":"Work trousers were sometimes made from coteen for extra durability.","zh":"工装裤过去有时会用coteen制作，以增加耐用性。"}]}],"synonyms":["cotton","cotton cloth","twill (cotton)","canvas (cotton)"],"phonetic":"/koʊˈtin/","extraExplanation":["“coteen”在现代英语里非常少见，更常见的是“cotton”（棉；棉布）。如果你是在阅读旧书、纺织品目录或历史文本里看到它，通常指一种较厚实的棉布。","拼写上也可能是把“cotton”误写成了“coteen”。如果你能提供句子语境，我也可以帮你确认具体含义。"]}
{"word":"coteful","summary":{"en":"“Coteful” is not a standard word; it is usually a misspelling of “coatful,” meaning as much as a coat can hold, or figuratively “a lot of.”","zh":"“coteful”不是标准英语词，通常是“coatful”的误拼，表示“一外套能装下的量”，也可引申为“很多”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard spelling) Usually meant as “coatful”: as much as a coat (especially a pocket or the lap of a coat) can hold.","zh":"（非标准拼写）通常指“coatful”：一件外套（尤其是口袋或衣襟）所能装下的量。"},"examples":[{"en":"He came back with a coatful of chestnuts.","zh":"他回来时外套里装了满满一兜栗子。"},{"en":"She gathered a coatful of fallen leaves for the compost.","zh":"她捧了一外套兜的落叶去堆肥。"}]},{"partOfSpeech":"phrase","definition":{"en":"By extension, “a coatful of …” can mean a large amount of something (informal, vivid).","zh":"引申义：“a coatful of …”可表示“很多/一大堆……”（非正式、形象的说法）。"},"examples":[{"en":"He showed up with a coatful of excuses.","zh":"他带着一大堆借口出现了。"},{"en":"The report is a coatful of details, but the conclusion is clear.","zh":"报告里细节一大堆，但结论很清楚。"}]}],"synonyms":["armful","handful","a lot of","a large amount of"],"phonetic":"/ˈkoʊtˌfʊl/","extraExplanation":["“coteful”在英语里不常见，通常是把“coatful”（最常见）或“cote”相关词拼错了。常用写法是“a coatful of + 名词”。","“coatful”更偏口语/叙述性表达，用来营造“装得满满”的画面感；正式写作里常用“a large amount of / a lot of”。"]}
{"word":"cotehardie","summary":{"en":"A close-fitting medieval tunic or dress, especially common in 14th-century Europe.","zh":"一种中世纪（尤14世纪）常见的紧身长袍或连衣裙。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A close-fitting medieval tunic or dress (often with buttons), worn by both men and women in Europe, especially in the 14th century.","zh":"（中世纪欧洲的）紧身长袍/连衣裙（常带纽扣），男女皆可穿，尤盛行于14世纪。"},"examples":[{"en":"In the museum, the mannequin wore a 14th-century cotehardie with a row of tiny buttons down the front.","zh":"在博物馆里，人体模型穿着一件14世纪的cotehardie，前襟有一排小纽扣。"},{"en":"The reenactors chose wool cotehardies to match the clothing styles of medieval towns.","zh":"历史重演者选择了羊毛cotehardie，以贴近中世纪城镇的服饰风格。"}]}],"synonyms":["fitted medieval tunic","fitted medieval gown"],"phonetic":"/ˌkoʊtəˈhɑrdi/","extraExplanation":["发音与来源：cotehardie 来自中古法语，cote- 与“外衣/长袍”相关；整体指一种“贴身剪裁”的衣服。英语里多用于历史、服装研究、博物馆说明或中世纪题材文学/影视的服装描述。","用法提示：这是很专门的词。日常英语通常会说 “a fitted medieval tunic/dress”。在阅读历史小说或看展览时遇到它，理解为“中世纪紧身长袍/裙装”就够了。","相关词可联想：tunic（束腰外衣/长袍）、gown（长袍/礼服）、doublet（紧身短上衣，较常见于更晚时期）、surcoat（外罩衣）。"]}
{"word":"cotele","summary":{"en":"“Cotele” is not standard English; it’s likely a misspelling (often of “coterie”).","zh":"“cotele”不是标准英语，可能是拼写错误（常见是把“coterie”拼错）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most often seen as a misspelling or a mistaken form (many learners actually mean “coterie”).","zh":"不是标准英语单词。它常见于拼写错误或误用（很多学习者想写的是“coterie”）。"},"examples":[{"en":"“Cotele” isn’t found in most English dictionaries—did you mean “coterie” (a small, close group)?","zh":"“cotele”在大多数英语词典里找不到——你是不是想写“coterie”（小圈子、小团体）？"},{"en":"If you share the sentence you wrote, I can help identify the intended word.","zh":"如果你把原句发出来，我可以帮你判断你真正想用的词。"}]}],"phonetic":"/ˈkoʊtəl/","extraExplanation":["最可能的目标词是 **coterie**（/ˈkoʊtəri/）：意思是“关系密切的小圈子/小团体”，常用于社交、文学或政治语境，如 *a coterie of writers*（一群作家小圈子）。\n也可能是输入法/拼写导致的误写。把你的上下文句子贴出来，我可以给出更准确的纠正与替换建议。"]}
{"word":"coteline","summary":{"en":"Coteline is a (somewhat uncommon) word for a cotton-and-linen blended fabric.","zh":"Coteline 指一种（较少见说法的）棉麻混纺面料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fabric made from a blend of cotton and linen (or sometimes a cotton-linen weave), often used for light clothing or household textiles","zh":"棉麻混纺布（由棉与亚麻混合制成的布料，常用于轻薄衣物或家用纺织品）"},"examples":[{"en":"The summer dress was made of coteline, so it felt cool and breathable.","zh":"这件夏装是棉麻混纺布做的，所以穿起来凉爽又透气。"},{"en":"They chose coteline for the tablecloth because it looked like linen but was easier to care for.","zh":"他们选用棉麻混纺布做桌布，因为它看起来像亚麻，但更好打理。"}]}],"synonyms":["cotton-linen blend","cotton-linen fabric","linen blend"],"phonetic":"/ˈkɑtəˌlin/","extraExplanation":["“coteline”多见于纺织品、服装史或面料说明中，属于相对少见的词；现代商品描述里更常直接写“cotton-linen blend（棉麻混纺）”。","词源上与法语面料名称有关（常与“cotton/linen”的组合概念联系在一起），在较早的英文资料里可见。"]}
{"word":"coteller","summary":{"en":"“Coteller” is a rare spelling variant of “cutler,” meaning someone who makes or sells knives and cutting tools.","zh":"“coteller”是“cutler”的罕见拼写变体，指制作或出售刀具等切割工具的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(rare/variant spelling) A cutler; a person who makes or sells knives and other cutting tools.","zh":"（罕见/拼写变体）刀具匠；制作或出售刀、剪等刀具的人。"},"examples":[{"en":"In old records, a coteller might be listed as a maker of knives for the town market.","zh":"在一些旧档案里，coteller 可能被登记为为集市制作刀具的人。"},{"en":"She bought a carving knife from a local coteller.","zh":"她从当地的 coteller 那里买了一把雕刻刀。"}]}],"synonyms":["cutler","knife maker","bladesmith"],"phonetic":"/ˈkʌtlɚ/","extraExplanation":["“coteller”在现代英语中几乎不用，更常见、标准的拼写是“cutler”。在历史文本或姓氏/地名记录里偶尔会看到这种拼写变体。"]}
{"word":"cotemporane","summary":{"en":"Contemporary means “from the same time” or “modern/present-day,” and it can also mean a person from the same period.","zh":"Contemporary 表示“同时代的/当代的”，也可指“同时代的人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Living, happening, or created at the same time as something else; belonging to the present time.","zh":"与某事物处于同一时代的；同时发生/被创作的；当代的。"},"examples":[{"en":"Shakespeare was contemporary with the early scientific revolution in Europe.","zh":"莎士比亚与欧洲早期科学革命处于同一时代。"},{"en":"We visited a contemporary art museum featuring artists working today.","zh":"我们参观了一家当代艺术博物馆，展出了今天仍在创作的艺术家作品。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who lived or worked at the same time as another person.","zh":"同时代的人；同辈。"},"examples":[{"en":"Darwin’s contemporaries did not all accept his theory immediately.","zh":"达尔文的同时代人并非都立刻接受他的理论。"}]}],"synonyms":["modern","present-day","current","coeval"],"phonetic":"/kənˈtɛmpəˌrɛri/","extraExplanation":["你输入的 **cotemporane** 很可能是拼写不完整或拼写错误。最常见、标准的词是 **contemporary**。","较少见的拼法 **cotemporary** 偶尔会出现（尤其在英式旧用法中），意思与 contemporary 基本相同，但在现代英语里通常建议用 **contemporary**。"]}
{"word":"cotemporanean","summary":{"en":"Contemporaneous means happening or existing at the same time, especially a record made at the time of an event.","zh":"contemporaneous 指“同时发生/存在；同一时期的”，也常指“事件发生当时写下的记录/笔记”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Existing, happening, or created at the same time as something else; belonging to the same period.","zh":"与另一事物同时存在、同时发生或同时创作的；属于同一时期的。"},"examples":[{"en":"The diary is contemporaneous with the war, so it offers a firsthand view of daily life.","zh":"这本日记与战争同时期，因此提供了对日常生活的第一手观察。"},{"en":"Police prefer contemporaneous notes because they are written immediately after an event.","zh":"警方更偏好同时记录的笔记，因为它们是在事件发生后立刻写下的。"}]},{"partOfSpeech":"adj.","definition":{"en":"Written or recorded at the time an event happens (often used in law, history, and reporting).","zh":"（常用于法律、历史与新闻语境）在事件发生当时写下或记录的。"},"examples":[{"en":"The judge asked for contemporaneous records of the transactions.","zh":"法官要求提供交易发生当时的记录。"},{"en":"Her contemporaneous emails helped confirm the timeline.","zh":"她当时写的邮件有助于确认时间线。"}]}],"synonyms":["simultaneous","concurrent","coexisting","same-period","synchronous"],"phonetic":"/kənˌtɛm.pəˈreɪ.ni.əs/","extraExplanation":["你写的“cotemporanean”不是常见标准拼写。更常见的词是 **contemporaneous**（形容词）。另有较少见的变体拼写 **cotemporaneous**，意思相同；但在考试、论文或正式写作中建议用 **contemporaneous**。","词源上与 *con-*（共同）+ *tempor-*（时间）有关，所以核心概念就是“同一时间/同一时期”。","常见搭配：**contemporaneous with**（与……同时期）、**contemporaneous record/notes**（当时记录）。"]}
{"word":"cotemporaneous","summary":{"en":"Conemporaneous means occurring or existing at the same time.","zh":"contemporaneous 指“同时发生或处于同一时期的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"existing, happening, or living at the same time (often used in formal or academic writing).","zh":"同时期的；同一时代发生/存在的（常用于较正式或学术语境）。"},"examples":[{"en":"The diary is contemporaneous with the war, so it’s a valuable historical source.","zh":"这本日记与那场战争处于同一时期，因此是很有价值的历史资料。"},{"en":"Researchers compared contemporaneous news reports from different countries.","zh":"研究人员比较了不同国家在同一时期的新闻报道。"},{"en":"Her poems are not contemporaneous with Shakespeare’s; they were written much later.","zh":"她的诗并非与莎士比亚同时期；它们写得晚得多。"}]}],"synonyms":["simultaneous","coexisting","coeval","concurrent"],"phonetic":"/kənˌtɛmpəˈreɪniəs/","extraExplanation":["你输入的拼写是“cotemporaneous”，更常见、标准的拼写是 **contemporaneous**。","**contemporaneous** 通常强调“在时间上同时发生/同一时期”，比 **contemporary**（当代的、现代的；也可指“同一时代的人/物”）更“时间对齐”与更偏正式。"]}
{"word":"cotemporaneously","summary":{"en":"Contemporaneously means “at the same time” or “in the same period.”","zh":"Contemporaneously 表示“同时”或“处于同一时期”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"At the same time; during the same period as something else.","zh":"同时；在同一时期（与另一事件或事物发生/存在）。"},"examples":[{"en":"The two interviews were conducted contemporaneously to ensure fair comparisons.","zh":"两场采访同时进行，以确保比较公平。"},{"en":"Several artists worked contemporaneously, but in very different styles.","zh":"有几位艺术家生活在同一时期，但风格截然不同。"}]}],"synonyms":["simultaneously","at the same time","concurrently","in parallel"],"phonetic":"/kənˌtɛmpəˈreɪniəsli/","extraExplanation":["你输入的拼写“cotemporaneously”不常见，标准拼写通常是 **contemporaneously**（来自 contemporary“当代的/同时期的”）。","这个词多用于较正式的写作（学术、法律、新闻报道）。日常口语里更常用 **at the same time** 或 **simultaneously**。"]}
{"word":"cotemporaries","summary":{"en":"Contemporaries are people (or things) from the same time period, especially the same generation or field.","zh":"contemporaries 指同一时期的人（或事物），尤指同一代或同一领域的同时代者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who live at the same time as someone else (often in the same field or generation).","zh":"同时代的人；同辈人（常指同一领域或同一代的人）。"},"examples":[{"en":"Shakespeare and his contemporaries helped shape modern English drama.","zh":"莎士比亚和他的同时代人共同塑造了现代英语戏剧。"},{"en":"Many of her contemporaries became famous writers too.","zh":"她的许多同辈人也成了著名作家。"}]},{"partOfSpeech":"n.","definition":{"en":"People or things that exist or happen at the same time.","zh":"同时期存在的人或事物；同期的事物。"},"examples":[{"en":"The museum compares ancient tools with their contemporaries from other regions.","zh":"博物馆将古代工具与其他地区同期的工具作比较。"},{"en":"These paintings look simple compared with their contemporaries.","zh":"这些画与同时期的作品相比显得更简洁。"}]}],"synonyms":["peers","people of the same generation","equals","counterparts"],"phonetic":"/kənˈtɛm.pəˌrɛr.iz/","extraExplanation":["你输入的 **cotemporaries** 常见是拼写错误；标准拼写是 **contemporaries**（在 n 前有 **n**）。","**contemporary / contemporaries** 既可指“同时代的人”，也可指“同时期的事物/作品”。在写作中常用于历史、文学、艺术对比：*X and his/her contemporaries*（X 与其同时代人）。"]}
{"word":"cotemporarily","summary":{"en":"Contemporarily means “at the same time / in the same period,” and sometimes “in a modern, present-day style.”","zh":"contemporarily 表示“同时/在同一时期”，有时也表示“以当代（现代）的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"at the same time; during the same period","zh":"同时；在同一时期"},"examples":[{"en":"The two artists worked contemporarily, but they never met.","zh":"这两位艺术家生活在同一时期并同时创作，但他们从未见过面。"},{"en":"These letters were written contemporarily with the events they describe.","zh":"这些信件是在所描述事件发生的同时写下的。"}]},{"partOfSpeech":"adv.","definition":{"en":"in a modern or present-day way","zh":"以当代的方式；以现代的风格"},"examples":[{"en":"The museum tries to present classic stories contemporarily so younger visitors connect with them.","zh":"博物馆试图用当代方式呈现经典故事，让年轻访客更有共鸣。"},{"en":"She designs traditional patterns contemporarily, using simpler shapes and colors.","zh":"她用更简洁的形状与颜色，把传统图案做出当代风格。"}]}],"synonyms":["simultaneously","at the same time","in the same period","in a modern way","modernly"],"phonetic":"/kənˈtɛmpəˌrɛrəli/","extraExplanation":["你输入的“cotemporarily”更常见的标准拼写是 **contemporarily**（有一个 *n*）。在正式写作中建议使用标准拼写。","词根提示：*con-*（一起）+ *temporary*（时间相关的）→ 表达“同一时间/同一时期”；引申为“当代地、现代地”。"]}
{"word":"cotemporary","summary":{"en":"Contemporary means “modern/current” or “from the same time,” and as a noun it means a person from the same time period.","zh":"Contemporary 表示“当代的/现代的、当前的”或“同一时期的”；作名词指“同时代的人/同辈”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) belonging to the same time (especially the present); modern or happening now","zh":"（形容词）同一时期的（尤指当代的）；现代的；正在发生的"},"examples":[{"en":"Contemporary music often mixes different styles.","zh":"当代音乐常常融合不同风格。"},{"en":"She writes contemporary novels set in big cities.","zh":"她写以大城市为背景的当代小说。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adj.) created in the present time (used for art, literature, design, etc.)","zh":"（形容词）（用于艺术、文学、设计等）当代创作的；现代风格的"},"examples":[{"en":"The museum has a contemporary art section.","zh":"这家博物馆有当代艺术展区。"},{"en":"We chose a contemporary design for the living room.","zh":"我们为客厅选择了现代风格的设计。"}]},{"partOfSpeech":"n.","definition":{"en":"(n.) a person who lives or exists at the same time as another person","zh":"（名词）同时代的人；同辈"},"examples":[{"en":"Shakespeare and Marlowe were contemporaries.","zh":"莎士比亚和马洛是同时代的人。"},{"en":"He was admired by many of his contemporaries.","zh":"他受到许多同辈人的敬佩。"}]}],"synonyms":["modern","current","present-day","up-to-date","peer"],"phonetic":"/kənˈtɛmpəˌrɛri/","extraExplanation":["你输入的 **cotemporary** 通常是 **contemporary** 的常见拼写错误：正确拼写是 **contemporary**（中间是 **-nt-**）。","**contemporary** 作形容词很常见（当代的、现代的）；作名词时多用于比较正式或历史/文学语境（“同时代的人”）。","在艺术语境里，**contemporary art**（当代艺术）不一定等于 **modern art**（现代艺术）；后者常指特定历史时期的艺术流派。"]}
{"word":"cotenancy","summary":{"en":"Cotenancy means shared tenancy or co-ownership of property; in malls it can also mean a lease clause tied to another tenant (often an anchor) staying open.","zh":"cotenancy 指共同租住或共有财产；在商业地产中也可指与其他租户（常为主力店）是否营业挂钩的联租条款。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Joint tenancy or shared ownership/occupancy of property by two or more people (co-tenants), who hold rights at the same time.","zh":"（不动产的）共同租住；共有（由两人或多人同时作为共同承租人或共有人，享有同一财产的权利）。"},"examples":[{"en":"After their father passed away, the siblings held the house in cotenancy.","zh":"父亲去世后，兄弟姐妹以共有的方式持有这套房子。"},{"en":"The lease lists both roommates, creating a cotenancy arrangement.","zh":"租约上写了两位室友的名字，形成共同租住的安排。"}]},{"partOfSpeech":"n.","definition":{"en":"In commercial leasing, a situation where one tenant’s lease obligations depend on another tenant (often an “anchor tenant”) remaining open or operating.","zh":"（商业租赁）联租条款/联营租赁情形：某租户的租约义务取决于另一租户（常为“主力店”）继续营业或开业。"},"examples":[{"en":"The small shop negotiated cotenancy protection if the anchor grocery store closed.","zh":"这家小店谈下了联租保护条款：如果主力超市关店，小店可以获得相应保障。"},{"en":"Cotenancy clauses are common in shopping malls to manage risk for smaller tenants.","zh":"购物中心里常见联租条款，用来帮助小租户管理风险。"}]}],"synonyms":["co-ownership","joint tenancy","shared tenancy","tenancy in common (related)","cotenancy clause (commercial)"],"phonetic":"/ˌkoʊˈtɛnənsi/","extraExplanation":["“cotenancy”常见于法律与房地产语境。日常口语中，人们更常说“co-ownership（共有）”“joint ownership（共同所有）”“shared tenancy（共同租住）”。","在英美法里，表示“共有”的常见类型包括：joint tenancy（共同共有，可能带有生存者取得权）与 tenancy in common（按份共有）。具体权利差异很大，遇到合同/继承问题通常需要看当地法律与文件条款。","商业地产里的“cotenancy clause（联租条款）”常与“anchor tenant（主力店）”绑定：如果主力店撤出，其他店可能获得减租、解约或其他救济。"]}
{"word":"cotenant","summary":{"en":"A cotenant is someone who shares ownership or property rights with another person.","zh":"cotenant 指与他人共同拥有或共同享有房产/土地权利的人（法律用语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who shares legal ownership or the right to use a property with one or more other people.","zh":"与他人共同拥有或共同享有某项不动产（房屋、土地等）权利的人；共有人。"},"examples":[{"en":"After their parents died, the three siblings became cotenants of the family house.","zh":"父母去世后，三兄妹成了祖屋的共同共有人。"},{"en":"As a cotenant, you can usually use the whole property, but you must respect the other owner’s rights.","zh":"作为共有人，你通常可以使用整处房产，但必须尊重其他共有人的权利。"}]}],"synonyms":["co-owner","joint owner","tenant in common (related)","joint tenant (related)"],"phonetic":"/ˌkoʊˈtɛnənt/","extraExplanation":["“Cotenancy”是相关名词，指“共同共有/共同租赁（共同占有）”的法律关系。不同地区的法律会区分不同类型的共同共有方式（例如是否有“生存者取得权”）。日常英语里也常用“co-owner（共同所有人）”来表达类似意思，但“cotenant”更偏法律/房产文件用语。","拼写上也常见连字符形式“co-tenant”。在房地产语境中，cotenant有时也用于商业地产，指与主力店（anchor tenant）同处一个购物中心的“其他店铺租户（共同租户）”，但严格说这是“共同租户”的行业用法。"]}
{"word":"cotenants","summary":{"en":"Cotenants are people who share the same lease (renting) or share legal ownership of a property.","zh":"cotenants 指共同承租（同一租约）的人，或在法律上共同拥有同一房产的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who share the same rented home or apartment; roommates who are on the lease together.","zh":"共同承租人；一起租同一套房子/公寓的人（通常共同签租约）。"},"examples":[{"en":"All cotenants must sign the lease before moving in.","zh":"所有共同承租人都必须签好租约才能入住。"},{"en":"If one cotenant moves out early, the others may still be responsible for the rent.","zh":"如果某个共同承租人提前搬走，其他人可能仍需承担房租责任。"}]},{"partOfSpeech":"n.","definition":{"en":"People who share ownership rights in the same property (a legal/real estate term).","zh":"共有不动产的人（法律/房地产用语，指对同一房产享有共同权利的人）。"},"examples":[{"en":"The siblings became cotenants of the family house after their parents died.","zh":"父母去世后，兄妹几人成为祖屋的共有权人。"},{"en":"A cotenant usually cannot sell the entire property without the other owners’ agreement.","zh":"共有权人通常不能在未经其他共有者同意的情况下出售整套房产。"}]}],"synonyms":["co-tenants","joint tenants (legal, not always the same)","roommates (informal, renting context)","co-owners (ownership context)"],"phonetic":"/ˌkoʊˈtɛnənts/","extraExplanation":["“cotenants”通常是“cotenant”的复数。也常写作“co-tenant”。","在日常生活中，它多指“共同签租约的人”；在法律语境中，更常指“共有产权的人”。具体含义要看上下文（租赁 lease vs. 产权 ownership）。"]}
{"word":"cotenure","summary":{"en":"Cotenure means shared holding—two or more people jointly hold a position, office, or property.","zh":"Cotenure 指“共同持有/共同任期”，即两人或多人共同拥有某职位、职务或财产。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the condition of holding a position, office, or property jointly with another person (shared tenure or shared holding)","zh":"与他人共同持有某职位、职务或财产的状态（共同任期/共同占有）"},"examples":[{"en":"Under cotenure, two trustees share responsibility for managing the land.","zh":"在共同持有（cotenure）制度下，两位受托人共同负责管理这片土地。"},{"en":"The agreement sets out how decisions will be made during cotenure.","zh":"该协议规定了在共同任期/共同持有期间如何做出决策。"}]},{"partOfSpeech":"n.","definition":{"en":"a system or arrangement in which two or more people jointly hold something (especially a legal or institutional arrangement)","zh":"一种由两人或多人共同持有的制度或安排（尤指法律或机构层面的安排）"},"examples":[{"en":"Some communities use cotenure to recognize shared rights to resources.","zh":"一些社区使用共同持有制度来承认对资源的共享权利。"},{"en":"The policy proposes cotenure as a way to balance competing interests.","zh":"该政策提出以共同持有作为平衡不同利益的方式。"}]}],"synonyms":["joint tenure","joint ownership","shared tenure","co-ownership"],"phonetic":"/ˌkoʊˈtɛn.jɚ/","extraExplanation":["“cotenure”常见于较正式的语境，尤其是法律、土地/财产权或机构治理文件中；日常英语里更常用“joint ownership（共同所有）”“shared tenure（共同任期）”等更直白的说法。","词形上可写作“co-tenure”（带连字符）以强调“co-（共同）+ tenure（持有/任期）”。在不同地区或不同制度文件中拼写可能不完全一致。"]}
{"word":"coterell","summary":{"en":"“Coterell” is probably a misspelling of “coterie,” meaning a small, often exclusive group.","zh":"“coterell” 很可能是 “coterie” 的拼写错误，意思是“小圈子、志同道合的一群人（常带排他意味）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended word) a small, close-knit group of people who share the same interests or spend time together, often seen as a somewhat exclusive circle.","zh":"（可能是你想查的词）志趣相投、关系紧密的一小群人；（常带一点）小圈子、排他的小团体。"},"examples":[{"en":"She’s part of a coterie of writers who meet every Friday night.","zh":"她属于一个每周五晚上聚会的作家小圈子。"},{"en":"The professor had a coterie of devoted students who followed his work closely.","zh":"这位教授有一群忠实的学生小团体，密切关注他的研究。"},{"en":"He felt left out because the office coterie made plans without him.","zh":"他觉得被冷落了，因为办公室的小圈子背着他做计划。"}]}],"synonyms":["clique","circle","inner circle","group"],"phonetic":"/ˈkoʊtəri/","extraExplanation":["“coterell” 不是常见的标准英文单词拼写。最接近且常用的词是 **coterie**（小圈子）。","如果你原本想输入的是人名/姓氏（如 **Cotterell / Cottrell**），那通常是专有名词而不是词汇；告诉我上下文（句子、出处、你想表达的意思），我可以帮你确认。"]}
{"word":"coterie","summary":{"en":"Coterie means a small, close-knit group, often with a sense of exclusiveness.","zh":"Coterie 指关系紧密的小圈子/小团体，常带有一定的排他性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, close group of people who spend time together, often because they share the same interests; sometimes the group can feel exclusive to outsiders","zh":"（常因兴趣相同而聚在一起的）小圈子、小团体；有时带有“排他、外人难以进入”的意味"},"examples":[{"en":"She joined a coterie of writers who met every Friday to share new poems.","zh":"她加入了一个作家小圈子，每周五聚会分享新诗。"},{"en":"A small coterie of advisers influenced the mayor’s decisions.","zh":"一小群顾问影响了市长的决策。"},{"en":"He felt uncomfortable because the coterie seemed closed to newcomers.","zh":"他觉得不自在，因为那个小团体似乎不欢迎新人。"}]}],"synonyms":["clique","circle","inner circle","set"],"phonetic":"/ˈkoʊtəri/","extraExplanation":["“coterie”常带一点点社交语气：不仅是“群体”，更像“关系很紧密的圈子”。在写作里，它比“group”更有画面感，暗示内外有别。","近义词细微区别：clique（小圈子，常更明显偏负面、排他）；circle（圈子，更中性，如“a circle of friends”）；inner circle（核心圈，更强调权力/亲近）。"]}
{"word":"coteries","summary":{"en":"“Coteries” means small, close (often exclusive) groups of people with shared interests; it is the plural of “coterie.”","zh":"“coteries”指由共同兴趣或背景组成的（常较排他性的）小圈子，是“coterie”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, close group of people who share the same interests, social background, or opinions, often seen as somewhat exclusive.","zh":"（常带排他性的）小圈子；小团体；志同道合的密友圈。"},"examples":[{"en":"A coterie of writers met every Thursday to share new poems.","zh":"一群写作者每周四聚在一起分享新诗。"},{"en":"She felt the office coterie made it hard for newcomers to join conversations.","zh":"她觉得办公室里的小圈子让新人很难融入聊天。"}]}],"synonyms":["cliques","circles","inner circles","set","in-group"],"phonetic":"/ˈkoʊtəriz/","extraExplanation":["“coteries”是“coterie”的复数形式。常用于描述社交圈、艺术圈或职场里关系紧密、对外不太开放的小团体。","语气上多为中性到略带贬义：强调“亲密/共同兴趣”的同时，也可能暗示“排外、圈内人文化”。"]}
{"word":"coterminal","summary":{"en":"“Coterminal” describes angles that share the same terminal side (they differ by multiples of 360° or 2π).","zh":"“coterminal”用于描述共终边角：终边相同、角度相差 360°（或 2π）的整数倍。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of an angle, in mathematics) sharing the same terminal side as another angle; differing by a whole-number multiple of 360° (or 2π radians).","zh":"（数学中指角）与另一个角的终边重合；相差 360° 的整数倍（或 2π 弧度的整数倍）。"},"examples":[{"en":"30° and 390° are coterminal angles because they end in the same direction.","zh":"30° 和 390° 是共终边角，因为它们的终边方向相同。"},{"en":"To find a coterminal angle between 0° and 360°, add or subtract 360° until it fits.","zh":"要找一个在 0° 到 360° 之间的共终边角，就不断加或减 360°，直到落在范围内。"}]}],"synonyms":["equivalent (angle)","sharing the same terminal side"],"phonetic":"/ˌkoʊˈtɝːmɪnəl/","extraExplanation":["“coterminal”主要用于三角学/预备微积分语境；在日常英语里很少用。","词形：co-（共同）+ terminal（终点的）。在角的语境中，terminal side 指“终边”。","常见搭配：coterminal angles（共终边角）；find coterminal angles（求共终边角）；a positive/negative coterminal angle（正/负的共终边角）。"]}
{"word":"coterminous","summary":{"en":"Coterminous means “sharing the same boundary” or “ending at the same time,” often used in geography, law, and contracts.","zh":"coterminous 指“边界相同/共边界”或“期限一致/同时结束”，常用于地理、法律和合同语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Sharing the same boundaries or ending at the same point in space (e.g., two areas that touch along a border).","zh":"（空间上）边界相同的；共边界的（例如两个地区沿同一条边界相接）。"},"examples":[{"en":"The two counties are coterminous, so they share a long border.","zh":"这两个郡是共边界的，所以它们共享很长的一段边界。"},{"en":"Their land is coterminous with the national park.","zh":"他们的土地与国家公园的边界重合。"}]},{"partOfSpeech":"adj.","definition":{"en":"Occurring during the same time period; coextensive in time.","zh":"（时间上）同时发生的；同一时期的。"},"examples":[{"en":"The reforms were coterminous with a period of rapid economic growth.","zh":"这些改革与经济快速增长时期同时发生。"},{"en":"Her contract is coterminous with the project and ends when the project ends.","zh":"她的合同与项目期限一致，项目结束合同也结束。"}]}],"synonyms":["conterminous","coextensive","adjacent","concurrent","simultaneous"],"phonetic":"/koʊˈtɝːmənəs/","extraExplanation":["这个词常见于法律、地理和行政语境，尤其是描述“辖区边界一致”（coterminous boundaries）或“任期/合同与某项目同起同止”（coterminous with the project）。","词源可理解为 co-（共同）+ terminus（边界/终点）。在英式英语里有时也写作 coterminous / coterminus；美式写法以 coterminous 更常见。","近义词选择：空间上更常用 adjacent（相邻的，不一定共边界）或 conterminous（共边界的，偏正式）；时间上可用 concurrent / simultaneous（同时的）。"]}
{"word":"coterminously","summary":{"en":"Coterminously means “at the same time” or “with the same boundary/endpoint,” often in formal contexts.","zh":"coterminously意为“同时地”或“边界/终点相同地”，多用于正式语境（如合同、政策、区划）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that happens or exists at the same time; simultaneously.","zh":"同时地；同一时期地；并行地。"},"examples":[{"en":"The two contracts will expire coterminously at the end of 2026.","zh":"这两份合同将在2026年底同时到期。"},{"en":"The program runs coterminously with the academic year.","zh":"该项目与学年同步进行。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that shares the same boundary or endpoint (often used in law, politics, or geography).","zh":"（常用于法律/政治/地理）以边界或终点相同的方式；共界地；同终点地。"},"examples":[{"en":"The new voting district was drawn so it would align coterminously with the county line.","zh":"新的选区被划定为与县界完全重合。"},{"en":"Her term as director was set to end coterminously with the board’s term.","zh":"她的主任任期被设定为与董事会任期同时结束。"}]}],"synonyms":["simultaneously","concurrently","coextensively (formal)","in tandem"],"phonetic":"/koʊˈtɝːmənəsli/","extraExplanation":["“coterminously”来自形容词“coterminous”，由前缀“co-（共同）”+“terminus（终点/界限）”构成，因此既可强调“时间上同时结束/开始”，也可强调“空间上边界重合”。","在日常口语中较少见，更常出现在合同、政策文件、行政区划、学术写作等正式语境。口语里常用“at the same time / simultaneously”替代。"]}
{"word":"coterminousness","summary":{"en":"Coterminousness means the quality of sharing the same boundaries or extent.","zh":"coterminousness 指与他物具有相同边界或相同范围的性质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being coterminous (having the same boundaries, limits, or extent as something else)","zh":"（与另一事物）同界、同范围、同边界的状态或性质"},"examples":[{"en":"The coterminousness of the two districts makes shared services easier to manage.","zh":"两个行政区同界的性质让共享公共服务更容易管理。"},{"en":"Lawyers argued about the coterminousness of the lease area and the city boundary.","zh":"律师们就租赁区域与城市边界是否同界展开争论。"}]}],"synonyms":["coextensiveness","coincidence of boundaries","conterminousness"],"phonetic":"/koʊˈtɝːmənəsnəs/","extraExplanation":["“coterminousness”来自形容词“coterminous”（同界的、范围相同的）加名词后缀“-ness”。常见于地理、行政区划、法律（辖区、合同范围）等较正式语境。","有时你会看到拼写“conterminous”（尤其在美式英语中也常用），意思基本相同；美国地理语境里常说“the coterminous U.S.”指“美国本土48州（不含阿拉斯加和夏威夷）”。"]}
{"word":"cotery","summary":{"en":"Coterie means a small, close (sometimes exclusive) group with shared interests.","zh":"Coterie 指志趣相投的亲密小团体，常带“有点排他的小圈子”意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, close group of people who spend time together, often sharing the same interests (sometimes suggesting they are a bit exclusive)","zh":"（常带一点“排他”意味的）小圈子；志趣相投的亲密小团体"},"examples":[{"en":"She became part of a coterie of writers who met every Friday.","zh":"她加入了一个每周五聚会的作家小圈子。"},{"en":"A coterie of fans waited outside the theater after the show.","zh":"演出结束后，一小群铁粉在剧院外等着。"},{"en":"He wasn’t invited—only the coterie got the inside information.","zh":"他没被邀请——只有那个小圈子才拿得到内部消息。"}]}],"synonyms":["clique","inner circle","set","group","circle"],"phonetic":"/ˈkoʊtəri/","extraExplanation":["你输入的“cotery”更常见的标准拼写是 coterie。","coterie 往往暗示“圈内人/自己人”的感觉：可以是中性的“朋友圈、同好圈”，也可能带轻微负面，表示小团体有点排外或形成小圈子文化。"]}
{"word":"cotes","summary":{"en":"“Cotes” means small animal shelters/pens (especially for sheep) or pigeon houses; it’s the plural of “cote.”","zh":"“cotes”指小型牲畜棚/圈（尤指羊圈）或鸽舍，是“cote”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “cote”: a small shelter or pen for animals (especially sheep), or a pigeon house (dovecote).","zh":"“cote”的复数：小型牲畜棚/圈（尤指羊圈），或鸽舍（dovecote）。"},"examples":[{"en":"In the old countryside, sheep were kept in stone cotes overnight.","zh":"在旧时乡村，羊常在夜里关在石砌的羊圈里。"},{"en":"The village still has a few cotes for pigeons behind the barns.","zh":"村里谷仓后面仍有几处鸽舍。"}]}],"synonyms":["pens","folds","shelters","dovecotes","sheepfolds"],"phonetic":"/koʊts/","extraExplanation":["“cote”这个词在现代日常英语里不算常见，更常出现在乡村生活、历史描写或文学作品中。更常见的相关词有：sheepfold（羊圈）、pen（圈栏）、shed（棚/小屋）、dovecote（鸽舍）。","在一些经典文本或较古旧的用法里，你可能会看到“cotes”用来营造田园、牧歌式氛围（例如描写牧人、羊群、乡野夜晚等）。"]}
{"word":"Cotesfield","summary":{"en":"Cotesfield is mainly used as a U.S. place name (especially in Nebraska).","zh":"Cotesfield 主要作为美国地名使用（尤其在内布拉斯加州）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name (proper noun), referring especially to Cotesfield, an unincorporated community in Nebraska, USA","zh":"地名（专有名词），常指美国内布拉斯加州的 Cotesfield（一个未建制社区）"},"examples":[{"en":"She drove through Cotesfield on her way across central Nebraska.","zh":"她穿过 Cotesfield，继续横跨内布拉斯加州中部。"},{"en":"Cotesfield appears on some local maps, even though it’s very small.","zh":"尽管 Cotesfield 很小，它仍出现在一些本地地图上。"}]}],"phonetic":"/ˈkoʊtsfiːld/","extraExplanation":["这是一个较少见的地名，所以在不同地图、资料里可能会出现“是否仍作为社区被标注”的差异。","作为专有名词，通常首字母大写：Cotesfield。若你是在书名、家谱或小说里看到它，也可能是以地名来营造地域感。"]}
{"word":"Cotesian","summary":{"en":"Cotesian = relating to Roger Cotes, especially his mathematical formulas (often Newton–Cotes rules).","zh":"Cotesian＝与罗杰·科茨有关的，尤指数学中的相关公式（常见为牛顿—科茨法则）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Roger Cotes (1682–1716), an English mathematician; especially relating to ideas or formulas associated with his work (often seen in numerical integration as the Newton–Cotes formulas).","zh":"与英国数学家罗杰·科茨（Roger Cotes，1682–1716）有关的；尤指数值计算中与其相关的思想或公式（常见于牛顿—科茨求积公式）。"},"examples":[{"en":"The paper compares several Cotesian (Newton–Cotes) quadrature rules for approximating integrals.","zh":"这篇论文比较了几种科茨式（牛顿—科茨）求积法则，用于近似计算积分。"},{"en":"We used a Cotesian approach to estimate the area under the curve from evenly spaced data points.","zh":"我们用科茨式方法，根据等间距数据点来估计曲线下的面积。"}]}],"synonyms":["Newton–Cotes","Cotes’","Cotes-related"],"phonetic":"/koʊˈtiːʒən/","extraExplanation":["“Cotesian”是一个较少见、偏学术的形容词，来源于数学家Roger Cotes的姓氏。你更常在教材或论文里看到“Newton–Cotes formulas / Newton–Cotes rules（牛顿—科茨公式/法则）”，而不是单独用“Cotesian”。","Roger Cotes与艾萨克·牛顿同一时期，曾担任剑桥大学普拉米安天文学教授（Plumian Professor of Astronomy）。他的名字常因数值积分（用离散点近似积分）相关方法而被提及。"]}
{"word":"cotesian","summary":{"en":"Cartesian means related to Descartes (his philosophy) or to coordinate geometry (the x–y plane).","zh":"Cartesian 指与笛卡尔（其哲学）有关，或指坐标几何（x–y 平面、坐标系）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to René Descartes or to his system of philosophy and method of reasoning (clear, logical thinking).","zh":"与勒内·笛卡尔（René Descartes）或其哲学体系、推理方法（清晰、逻辑性的思考方式）有关的。"},"examples":[{"en":"She took a Cartesian approach, doubting each claim until it was proven.","zh":"她采取了笛卡尔式的方法，对每个观点都先怀疑，直到被证明为止。"},{"en":"In philosophy class, we discussed Cartesian skepticism.","zh":"在哲学课上，我们讨论了笛卡尔式怀疑论。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to coordinate geometry using the x-, y- (and z-) axes, commonly used in math and science.","zh":"与用 x、y（以及 z）轴表示的坐标几何有关的；常用于数学和科学。"},"examples":[{"en":"Plot the points on a Cartesian plane.","zh":"把这些点画在笛卡尔平面上。"},{"en":"The robot’s position is described in Cartesian coordinates.","zh":"机器人的位置用笛卡尔坐标来表示。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who follows Descartes’s philosophy or method.","zh":"笛卡尔哲学或方法的追随者。"},"examples":[{"en":"Some Cartesians argued that mind and body are separate.","zh":"一些笛卡尔学派的人认为心灵与身体是分离的。"}]}],"synonyms":["Descartes-related","coordinate","rectangular (coordinates)"],"phonetic":"/kɑrˈtiʒən/","extraExplanation":["你输入的“cotesian”常见是拼写误差，更标准的拼写是 **Cartesian**（笛卡尔的）。","“Cartesian coordinates / Cartesian plane”在中文里通常译为“笛卡尔坐标 / 笛卡尔平面”；在日常英语中，数学语境下这个用法最常见。"]}
{"word":"coth","summary":{"en":"“coth” is not standard English; it is usually a misspelling of “cloth.”","zh":"“coth”不是标准英语；通常是把“cloth（布料）”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling of “cloth.”","zh":"不是标准英语单词；最常见情况是把“cloth（布料）”拼错了。"},"examples":[{"en":"I think you mean “cloth”: a piece of cloth for cleaning glasses.","zh":"你可能想写“cloth”：一块用来擦眼镜的布。"},{"en":"The word “coth” is usually a typo in English writing.","zh":"在英文写作里，“coth”通常是拼写错误。"}]}],"synonyms":["cloth (likely intended)"],"phonetic":"/kɑθ/","extraExplanation":["在英语中更常见的是“cloth”/klɔθ/（布料）或“cot”（小床）。如果你是在查威尔士语（Welsh），“coth”可以表示“老的/旧的”，但那不属于英语词汇。你也可以告诉我你看到它的句子，我能帮你判断实际想表达的词。"]}
{"word":"cotham","summary":{"en":"Cotham is most commonly a place name (a district in Bristol, England) and can also be a surname.","zh":"Cotham 常见用法是地名（英国布里斯托尔的一个城区），也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A district (neighborhood) in Bristol, England.","zh":"（英国）英格兰布里斯托尔市的一个城区/街区（Cotham）。"},"examples":[{"en":"She lives in Cotham, not far from the University of Bristol.","zh":"她住在科瑟姆（Cotham），离布里斯托尔大学不远。"},{"en":"We met for coffee in Cotham before walking into the city center.","zh":"我们在科瑟姆（Cotham）喝咖啡碰面，然后步行去市中心。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname).","zh":"姓氏（Cotham）。"},"examples":[{"en":"Ms. Cotham will join the meeting at 3 p.m.","zh":"Cotham 女士将在下午三点参加会议。"}]}],"phonetic":"/ˈkɑtəm/","extraExplanation":["Cotham 作为地名主要出现在英国布里斯托尔（Bristol）。在新闻、地址、学校招生范围、房地产信息里常见。","发音在英国当地常接近“COT-um”（类似“科特姆”），但不同地区的人可能会有轻微差异。"]}
{"word":"cothamore","summary":{"en":"“Cothamore” is not a standard English vocabulary item; it’s most likely used as a proper name, and its meaning depends on context.","zh":"“Cothamore”不是标准英语词汇；更可能是专有名词，用法与含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it most often appears as a proper name (e.g., a surname, fictional name, username, or place/property name). Meaning depends on the specific context.","zh":"不是常见词典里的标准英语词；多见作专有名词（如姓氏、虚构人名、网名或地名/房产名）。具体含义取决于语境。"},"examples":[{"en":"I couldn’t find an English definition for “Cothamore,” but it may be a family name or a place name.","zh":"我查不到“Cothamore”的常规定义，但它可能是姓氏或地名。"},{"en":"If “Cothamore” is the name of a character, its meaning is whatever the author assigns to it.","zh":"如果“Cothamore”是角色名，它的含义通常由作者设定。"}]}],"phonetic":"/ˌkɑːθəˈmɔr/","extraExplanation":["“cothamore”看起来像自造词或专有名词拼写。由于缺少上下文（比如出自哪本书/哪段话/哪个国家的地名），无法给出可靠的词源与固定释义。","如果你是想查某个相近拼写的单词，请把原句贴出来；我也可以帮你判断是否为拼写错误，并给出最可能的目标词。"]}
{"word":"cothe","summary":{"en":"“cothe” is usually a misspelling of “clothe,” meaning to dress someone or put on clothes (more formal than “dress”).","zh":"“cothe”通常是“clothe”的误拼，意思是“给某人穿衣/穿衣”，语气较正式。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Likely intended) to dress someone or cover something with clothing.","zh":"（多半是想写）给某人穿衣；用衣物覆盖某物。"},"examples":[{"en":"Parents should clothe their children warmly in winter.","zh":"父母冬天应该给孩子穿暖和。"},{"en":"The charity helps clothe families in need.","zh":"这个慈善机构帮助有需要的家庭获得衣物。"}]},{"partOfSpeech":"v.","definition":{"en":"to put on clothes; to become dressed.","zh":"穿衣；穿上衣服。"},"examples":[{"en":"He washed quickly and clothed before work.","zh":"他匆匆洗漱后穿好衣服去上班。"}]}],"synonyms":["dress","wear","garb","attire","cover"],"phonetic":"/kloʊð/","extraExplanation":["“cothe”在英语里通常不是标准拼写，最常见的对应词是“clothe”。","“clothe”比较正式，日常更常说：dress (someone)、put on clothes、wear。例如：She dressed the baby. / He put on a jacket.","变形：clothe–clothed–clothed（也可作 archaic/较旧式：clad 作过去分词，如：The mountains were clad in snow. 意为“被雪覆盖”。）"]}
{"word":"cotheorist","summary":{"en":"A co-theorist is someone who creates or develops a theory with another person.","zh":"co-theorist 指与他人共同提出或发展理论的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who develops or proposes a theory together with another person (or others); a joint theorist","zh":"与他人一起提出或发展某种理论的人；共同理论提出者"},"examples":[{"en":"She is credited as a co-theorist of the new model in the journal article.","zh":"在那篇期刊论文中，她被署名为该新模型的共同理论提出者。"},{"en":"The two co-theorists disagreed on how to test their idea.","zh":"这两位共同理论提出者在如何检验他们的观点上意见不一。"}]}],"synonyms":["joint theorist","collaborator (in theory)","coauthor (of a theory)"],"phonetic":"/ˌkoʊˈθiərɪst/","extraExplanation":["“co-”是常见前缀，表示“共同、一起”（如 coauthor 共同作者，cofounder 共同创办人）。写作中常见连字符形式“co-theorist”，不加连字符“cotheorist”也能见到但较少、更不规范。"]}
{"word":"Cotherstone","summary":{"en":"Cotherstone is mainly a place name: a village in County Durham, England; it is also the name of an 1843 Epsom Derby-winning racehorse.","zh":"Cotherstone主要是地名：英国英格兰达勒姆郡的一个村庄；它也可指一匹在1843年赢得埃普瑟姆德比的赛马。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a village in County Durham, England (in the Teesdale area), used as a place name.","zh":"英国英格兰达勒姆郡（蒂斯河谷一带）的一个村庄名，用作地名。"},"examples":[{"en":"She grew up near Cotherstone in Teesdale.","zh":"她在蒂斯河谷的科瑟斯通（Cotherstone）附近长大。"},{"en":"We stopped in Cotherstone for a short walk before dinner.","zh":"晚饭前我们在科瑟斯通停下来散了会儿步。"}]},{"partOfSpeech":"n.","definition":{"en":"the name of a famous British Thoroughbred racehorse (winner of the Epsom Derby in 1843).","zh":"一匹著名的英国纯血赛马的名字（1843年赢得埃普瑟姆德比）。"},"examples":[{"en":"In a lecture on Derby history, the speaker mentioned Cotherstone (1843).","zh":"在一场关于德比历史的讲座中，演讲者提到了Cotherstone（1843年冠军）。"}]}],"synonyms":["(place) —","(racehorse) —"],"phonetic":"/ˈkʌðərstoʊn/","extraExplanation":["这是专有名词（proper noun），通常首字母大写；用作地名时，一般不加冠词（说“in Cotherstone”，不说“in the Cotherstone”）。","英语地名里常见的 -stone、-ton、-ham 等结尾多与古英语/北欧语系地名构词有关；Cotherstone 的具体词源有不同解释，但日常使用中把它当作固定地名记忆即可。"]}
{"word":"cothish","summary":{"en":"“cothish” is not a standard modern English word; it’s probably a misspelling (often of “Scottish”) or a very rare form.","zh":"“cothish”不是标准的现代英语单词；多半是拼写错误（常见为“Scottish”），或极少见的形式。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in modern dictionaries; it is likely a misspelling or a rare/obsolete form.","zh":"现代英语词典中通常不收录；很可能是拼写错误，或非常少见/过时的形式。"},"examples":[{"en":"I couldn’t find “cothish” in a dictionary—did you mean “Scottish” or “couthish”?","zh":"我在词典里找不到“cothish”——你是想写“Scottish（苏格兰的）”还是“couthish（较少见）”吗？"}]}],"phonetic":"ˈkoʊθɪʃ","extraExplanation":["“cothish”最常见的情况是拼错了单词。可能的目标词包括：\n1) Scottish：意为“苏格兰的；苏格兰人（的）”。\n2) couthish：极少见，通常可理解为“有点couth（得体/文雅）的”。注意：couth本身在现代英语里多出现在反义词uncouth（粗俗的）中，单独用couth较少。\n\n如果你告诉我这个词出现的句子或上下文（例如一整句话），我可以更准确判断你想查的是哪个词。"]}
{"word":"cothon","summary":{"en":"Cothon is a rare noun meaning either the famous Carthaginian inner naval harbor basin or an ancient Greek (Spartan) drinking cup.","zh":"cothon是个少见名词，可指迦太基著名的军港内港港池，也可指古希腊（斯巴达）的饮酒杯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a man-made harbor basin (often circular), especially the famous naval harbor of ancient Carthage; also used more generally for a fortified inner harbor.","zh":"（多为人工开凿的）港池/内港（常呈圆形），尤指古代迦太基著名的军港；也可泛指设防的内港。"},"examples":[{"en":"Archaeologists have studied the Carthaginian cothon to understand how its navy was organized.","zh":"考古学家研究迦太基的cothon（军港港池），以了解其海军如何组织。"},{"en":"The city’s trade ships used the outer harbor, while the cothon was reserved for military vessels.","zh":"商船使用外港，而cothon则留给军舰使用。"}]},{"partOfSpeech":"n.","definition":{"en":"an ancient Greek drinking cup (especially associated with Sparta), often described as a simple, practical vessel.","zh":"古希腊的饮酒杯（尤与斯巴达相关），常被描述为朴素、实用的器皿。"},"examples":[{"en":"In some histories, Spartans are said to have used a cothon for drinking.","zh":"一些史料称斯巴达人用cothon饮酒。"},{"en":"The museum label described the small vessel as a cothon from classical Greece.","zh":"博物馆标签把这个小器皿描述为古典希腊的cothon（饮酒杯）。"}]}],"synonyms":["naval harbor","harbor basin","inner harbor","Spartan cup"],"phonetic":"/ˈkoʊθɑn/","extraExplanation":["“cothon”来自希腊语 *kothon*（也常见拼写 *kothōn*）。在英语中它既可指“斯巴达饮酒杯”，也可指“迦太基的圆形军港港池”。后者在历史与考古写作中更常见，尤其谈到迦太基海军与港口工程时。","阅读历史/考古文章时，可以根据上下文判断：如果出现 Carthage/harbor/naval/fleet 等词，通常是“港池”；如果出现 Sparta/cup/drink 等词，通常是“酒杯”。"]}
{"word":"cothouse","summary":{"en":"A (rare) word for a small, simple cottage, especially in older Scottish/British usage.","zh":"一个较少见的词，指简陋的小屋/茅舍，尤见于较旧的苏格兰/英式用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, simple cottage; (especially in Scotland or older British English) a poor person’s small dwelling.","zh":"（尤指苏格兰或较旧的英式英语）简陋的小屋、茅舍；常指贫困者的住处。"},"examples":[{"en":"They rented a quiet cothouse near the edge of the village.","zh":"他们在村子边上租了一间安静的小茅舍。"},{"en":"In old records, the family is listed as living in a cothouse on the estate.","zh":"在旧档案中，这家人被记载为住在庄园里的一间小屋。"}]}],"synonyms":["cottage","hut","shack"],"phonetic":"/ˈkɑtˌhaʊs/","extraExplanation":["这个词通常可理解为“cot + house”。其中 cot 在古英语/苏格兰语语境里可指“小屋、棚屋”（不同于现代更常见的“婴儿床/行军床”含义），所以 cothouse 往往带有“简陋、贫穷”的色彩。","在现代日常英语里不算常用；更常见的说法是 cottage、hut、small house。阅读英国或苏格兰背景的旧文本、地方志、家谱记录时更可能遇到。"]}
{"word":"cothurn","summary":{"en":"A cothurn is a thick-soled boot from ancient tragedy, and by extension can mean tragic drama or a lofty tragic style.","zh":"cothurn 指古代悲剧演员穿的厚底高筒靴；引申可指悲剧作品或悲剧式的崇高庄严风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A high, thick-soled boot (buskin) worn by actors in ancient Greek and Roman tragedy, used to make them look taller and more imposing.","zh":"（古希腊/罗马悲剧演员穿的）厚底高筒靴（buskin），用来让演员显得更高、更庄严。"},"examples":[{"en":"In ancient Greek tragedy, leading actors often wore a cothurn to appear taller on stage.","zh":"在古希腊悲剧中，主角演员常穿 cothurn（厚底高筒靴），让自己在舞台上显得更高。"},{"en":"The museum displayed a reconstructed cothurn alongside other theatrical costumes.","zh":"博物馆展示了一只复原的 cothurn，并与其他戏剧服装一同陈列。"}]},{"partOfSpeech":"n.","definition":{"en":"(Literary) Tragic drama or a lofty, high style associated with tragedy.","zh":"（文学用法）悲剧（作品/题材）；或带有悲剧色彩的崇高、庄严的文体。"},"examples":[{"en":"The critic complained that the speech leaned too much toward cothurn and sounded unnatural.","zh":"评论家抱怨那段演讲太“悲剧腔”（过于庄严夸张），听起来不自然。"},{"en":"Some poets tried to imitate the cothurn of classical tragedy in their language.","zh":"有些诗人试图在语言上模仿古典悲剧的“cothurn”式崇高风格。"}]}],"synonyms":["buskin","cothurnus","tragic style","tragic drama"],"phonetic":"/ˈkɑːθɝːn/","extraExplanation":["“cothurn”来自拉丁语 *cothurnus*，再往前与希腊语有关，指悲剧演员穿的厚底靴。因为这种靴子象征悲剧舞台的“崇高/庄严”，所以后来在文学批评里也可引申指“悲剧风格”。","对比：古典传统里常用“cothurn（厚底靴）=悲剧”的意象来对照“sock（薄底便鞋）=喜剧”的意象（喜剧演员更常被说成穿轻便的鞋）。"]}
{"word":"cothurnal","summary":{"en":"Cothurnal is a rare literary adjective meaning “tragic/solemn,” originally linked to the high-soled boots of ancient Greek tragic actors.","zh":"cothurnal 是一个罕见的文学形容词，意为“悲剧性的/庄重的”，源自古希腊悲剧演员所穿的高底靴。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(literary, rare) Related to tragedy; solemn and tragic in style or mood.","zh":"（文学用语，罕见）与悲剧有关的；风格或气氛庄重而悲怆的。"},"examples":[{"en":"The play’s cothurnal tone made the audience fall silent.","zh":"这部戏的悲剧性氛围让观众安静了下来。"},{"en":"He preferred cothurnal stories over light comedies.","zh":"他更喜欢悲剧故事，而不是轻松喜剧。"}]},{"partOfSpeech":"adj.","definition":{"en":"(historical/literary) Wearing or relating to the high-soled boots traditionally worn by actors in ancient Greek tragedy.","zh":"（历史/文学）指（穿）古希腊悲剧演员传统所穿的高底靴；或与这种靴子有关的。"},"examples":[{"en":"In classical references, cothurnal figures appear larger and more imposing on stage.","zh":"在古典文献中，穿高底靴的悲剧人物在舞台上显得更高大、更威严。"},{"en":"The costume design used cothurnal footwear to suggest a tragic hero.","zh":"服装设计用高底靴来暗示这是一位悲剧英雄。"}]}],"synonyms":["tragic","solemn","grave","melancholy","stately"],"phonetic":"/kɑːˈθɝːnəl/","extraExplanation":["cothurnal 来自“cothurnus”（古罗马/古希腊戏剧中的厚底靴）。在英语里它既可以指这种“悲剧靴”，也引申为“悲剧性的、庄严的”。","这是一个很书面、很少见的词；日常英语里更常用 tragic, solemn, grave 等。","文学语境中常见对比：cothurnus（悲剧靴） vs. sock（喜剧演员的软鞋），用来象征悲剧与喜剧两种风格。"]}
{"word":"cothurnate","summary":{"en":"Cothurnate means lofty, solemn, and classically “tragic” in style, especially in language or drama.","zh":"cothurnate 指文风或表达高昂庄严、带古典悲剧式崇高感（多用于评论语言/戏剧）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Lofty, grand, and solemn in style—especially in language, drama, or poetry; “tragic” in a classical, high-register way.","zh":"（文体、戏剧或诗歌等）高昂庄严的；带有古典悲剧式的崇高风格的。"},"examples":[{"en":"The critic dismissed the speech as cothurnate and out of touch with ordinary people.","zh":"评论家认为这篇演讲过于庄严高调，脱离普通人的生活。"},{"en":"Her cothurnate diction made the simple story sound like a tragedy on stage.","zh":"她那种崇高庄严的措辞把一个简单故事讲得像舞台悲剧一样。"}]}],"synonyms":["lofty","elevated","grand","solemn","high-flown","pompous"],"phonetic":"/kəˈθɝːneɪt/","extraExplanation":["“cothurnate”源自拉丁语/希腊语的“cothurnus”（古希腊悲剧演员穿的高底靴）。这种靴子让演员“显得更高”，因此这个词引申为“文风高大、庄严、悲剧式的崇高”。","该词非常少见，多见于文学批评或修辞评论；日常英语中更常用的替代说法有 lofty, grand, elevated, high-flown。"]}
{"word":"cothurned","summary":{"en":"“Cothurned” means wearing the high boot of ancient tragedy, or (figuratively) having a lofty, tragic style.","zh":"“cothurned”指穿古希腊悲剧高靴；也可引申为风格庄严悲壮、崇高夸饰。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(literary) Wearing a cothurnus (a high boot), especially linked to ancient Greek tragedy; by extension, grand, tragic, or lofty in style.","zh":"（文学用语）穿着“cothurnus”（古希腊悲剧演员穿的高筒厚底靴）；引申为（文风/气势）庄严悲壮的、夸张崇高的。"},"examples":[{"en":"In the painting, the actor stands cothurned, ready for a role in Greek tragedy.","zh":"在那幅画里，演员穿着悲剧高靴（cothurnus），准备出演古希腊悲剧。"},{"en":"Some critics found the speech too cothurned—more grand than sincere.","zh":"一些评论家觉得那篇演讲过于“cothurned”——气势很大，却不够真诚。"}]}],"synonyms":["tragic","lofty","high-flown","grandiose","stately"],"phonetic":"/koʊˈθɝnd/","extraExplanation":["“Cothurned”来自“cothurnus”（古罗马/古希腊的高筒厚底靴）。在古希腊戏剧中，悲剧演员常穿这种鞋来显得更高、更有威严；因此英语里它也比喻“悲剧性的庄重”“高亢夸饰的风格”。","与之相对的概念常被提到的是“sock”（轻喜剧演员的软底鞋），因此在文学批评里会用“cothurned”（悲剧、崇高）对比“sock”（喜剧、轻松）。"]}
{"word":"cothurni","summary":{"en":"Cothurni are the thick-soled boots of ancient tragic actors, and by extension a lofty tragic style.","zh":"cothurni 指古代悲剧演员穿的厚底靴，也可引申为崇高的悲剧风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural) high, thick-soled boots (buskins) worn by actors in ancient Greek and Roman tragedy, often associated with a dignified or “elevated” tragic style.","zh":"（复数）古希腊、古罗马悲剧演员穿的高筒厚底靴（悲剧靴），常象征庄严、崇高的悲剧风格。"},"examples":[{"en":"In ancient tragedy, the actor’s cothurni made him appear taller and more imposing on stage.","zh":"在古代悲剧中，演员穿的 cothurni 让他在舞台上显得更高、更有气势。"},{"en":"Some critics say the novel puts on cothurni—its language feels too lofty for the story.","zh":"有些评论家说这部小说“穿上了 cothurni”——语言对故事来说过于高调、夸张。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, literary) a grand, elevated tragic manner or style (as if wearing the boots of tragedy).","zh":"（比喻，文学用法）宏大、崇高的悲剧语调或写作风格（仿佛穿上悲剧靴）。"},"examples":[{"en":"The speech aims for cothurni, but the audience prefers something more natural.","zh":"这段演讲试图追求 cothurni 式的崇高感，但观众更喜欢自然一点的表达。"}]}],"synonyms":["buskins","tragic boots","lofty style","elevated diction"],"phonetic":"/kəˈθɝːnˌaɪ/","extraExplanation":["cothurni 是拉丁语 cothurnus 的复数形式；英语里也常见单数 cothurnus。","在古典戏剧传统中，悲剧演员穿的厚底高靴与喜剧演员的低鞋形成对比，因此 cothurni 常被用来象征“悲剧/崇高风格”。","文学评论中说某作品“wears the cothurni（穿上悲剧靴）”，通常是在暗示它刻意追求高雅庄严，甚至有点做作。"]}
{"word":"cothurnian","summary":{"en":"Cothurnian means lofty and solemn in a tragic, classical style.","zh":"cothurnian 指“悲剧式的、崇高庄严的（古典风格）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Literary) Lofty, grand, and solemn in style; often describing tragic drama or high-flown language.","zh":"（文学用语）风格崇高、庄严、宏伟的；常用来形容悲剧或辞藻高亢的语言。"},"examples":[{"en":"The novel’s ending is intentionally cothurnian, aiming for the dignity of Greek tragedy.","zh":"这部小说的结尾刻意采用cothurnian式的崇高笔调，力求呈现希腊悲剧的庄严感。"},{"en":"Some readers found the speech too cothurnian for such an ordinary event.","zh":"有些读者觉得这段演讲对这样一个普通事件来说过于cothurnian、太高调了。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A tragic actor, or something associated with classical tragedy.","zh":"（罕见）悲剧演员；或与古典悲剧相关的事物。"},"examples":[{"en":"In old criticism, the hero is treated as a cothurnian figure rather than an everyday person.","zh":"在旧式评论中，这位主人公被当作cothurnian式的悲剧人物来写，而不是普通人。"}]}],"synonyms":["lofty","grand","solemn","tragic","high-flown","elevated"],"phonetic":"/kəˈθɝːniən/","extraExplanation":["词源与文化背景：cothurnian 来自拉丁语 cothurnus（希腊语 kothornos），指古希腊悲剧演员穿的高底靴（类似“增高靴”），用来让演员显得更高大、更庄严。因此这个词引申为“悲剧式的、崇高庄严的、辞藻高亢的”。在文学评论里，它常用来评价某种写作或演说是否“过于高调/过于宏大”。"]}
{"word":"cothurnni","summary":{"en":"Cothurni are the thick-soled boots of ancient tragic actors, and by extension refer to tragedy or a lofty tragic style.","zh":"Cothurni 指古代悲剧演员穿的厚底靴，并可引申为“悲剧”或“崇高的悲剧风格”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural noun) High, thick-soled boots worn by actors in ancient Greek and Roman tragedies; also used figuratively to mean “tragic drama” or a lofty tragic style.","zh":"（复数名词）古希腊、古罗马悲剧演员穿的厚底高筒靴；也可引申指“悲剧/悲剧风格”，带有庄严、崇高的意味。"},"examples":[{"en":"In ancient tragedy, actors wore cothurni to appear taller and more imposing.","zh":"在古代悲剧中，演员穿 cothurni 来显得更高、更有威势。"},{"en":"Some critics say his early poems wear the cothurni—grand, tragic, and formal in tone.","zh":"一些评论家说他早期的诗像“穿着 cothurni”——语气宏大、悲壮而正式。"}]}],"synonyms":["buskins","tragic boots","tragic style"],"phonetic":"/koʊˈθɝːnaɪ/","extraExplanation":["你输入的拼写 **cothurnni** 常见为 **cothurni**（复数），其单数是 **cothurnus**。这类靴子因厚底而让演员“增高”，便于远处观众观看，也逐渐成了“悲剧舞台/崇高悲剧风格”的象征。","在文学批评里，和 cothurni 相对的常是 **sock**（喜剧演员穿的轻便鞋），用来对比“悲剧（cothurni）”与“喜剧（sock）”的风格。"]}
{"word":"cothurns","summary":{"en":"Cothurns are thick-soled boots from ancient tragedy, often symbolizing tragic drama.","zh":"Cothurns 指古代悲剧演员穿的厚底靴，也常象征悲剧戏剧风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Thick-soled boots worn by actors in ancient Greek and Roman tragedy to make them appear taller; often used as a symbol of tragic drama.","zh":"（古希腊/古罗马悲剧演员穿的）厚底高靴，用来显得更高；也常被用作“悲剧戏剧”的象征。"},"examples":[{"en":"In ancient Greek tragedy, leading actors sometimes wore cothurns to increase their height on stage.","zh":"在古希腊悲剧中，主要演员有时会穿 cothurns（厚底高靴）来让自己在舞台上显得更高。"},{"en":"The museum display included masks and cothurns from classical theater traditions.","zh":"博物馆的展品包括古典戏剧传统中的面具和 cothurns（厚底高靴）。"}]}],"synonyms":["buskins (in theater context)","tragic boots"],"phonetic":"/ˈkɑːθɚnz/","extraExplanation":["“cothurns”是复数形式；单数是“cothurn”（也常见拼写“cothurnus”）。","在文学评论或艺术评论里，“cothurns”有时作为隐喻，指“悲剧风格/庄严高昂的表达方式”，与象征喜剧的“buskins/滑稽元素”等形成对比。"]}
{"word":"cothurnus","summary":{"en":"Cothurnus is a thick-soled boot worn by ancient tragic actors, and by extension a literary symbol for tragedy or a lofty tragic style.","zh":"Cothurnus 指古代悲剧演员穿的厚底靴，也可引申指“悲剧”或“悲剧式的高昂文体”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A high, thick-soled boot worn by actors in ancient Greek and Roman tragedy, used to make them look taller.","zh":"（古希腊、古罗马悲剧演员穿的）厚底高筒靴，用来显得更高大。"},"examples":[{"en":"In the museum, a replica cothurnus shows how tragic actors appeared larger than life.","zh":"在博物馆里，一只仿制的 cothurnus 展示了悲剧演员如何显得高大如神。"},{"en":"The lead actor stepped into his cothurnus before the performance began.","zh":"演出开始前，男主角穿上了他的 cothurnus。"}]},{"partOfSpeech":"n.","definition":{"en":"(Literary) Tragic drama or a lofty, elevated style associated with tragedy.","zh":"（文学用法）悲剧；或带有悲剧色彩的庄重、高昂文体。"},"examples":[{"en":"The poem avoids the cothurnus and speaks in a simple, everyday voice.","zh":"这首诗避开了“cothurnus 式”的高调悲壮，而用朴素日常的语气来写。"},{"en":"Some critics felt the speech put on the cothurnus—too grand for the occasion.","zh":"一些评论家觉得这段演讲“穿上了 cothurnus”——对这个场合来说太过隆重夸张。"}]}],"synonyms":["buskin","tragic style","lofty style"],"phonetic":"/kəˈθɝːnəs/","extraExplanation":["词源与文化背景：cothurnus 来自拉丁语，源头可追溯到希腊语 kothornos（κόθορνος）。在古典戏剧里，悲剧演员常穿厚底靴以增加身高与舞台威仪，因此这个词后来也常被借喻为“悲剧风格/高亢文体”。","使用提示：现代英语中该词非常少见，多出现在文学批评、古典学或戏剧史语境里；日常表达里更常用 tragic style / lofty style 等。"]}
{"word":"cothy","summary":{"en":"“cothy” is not a standard spelling; it usually points to “couthy,” meaning friendly, warm, and cozy.","zh":"“cothy”不是标准拼写；通常指向“couthy”，表示亲切、温暖、舒适的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard spelling) likely a misspelling or variant of “couthy,” meaning pleasantly friendly and cozy; homely in a warm, comfortable way.","zh":"（非标准拼写）多半是“couthy”的误拼或变体，意思是亲切友善、温暖舒适；有一种朴实但让人放松的“居家感”。"},"examples":[{"en":"The small café felt cot(h)y—warm, quiet, and welcoming.","zh":"那家小咖啡馆很“coty/couthy”——温暖、安静又让人觉得被欢迎。"},{"en":"She has a cot(h)y way of talking that puts people at ease.","zh":"她说话很“coty/couthy”，让人很放松。"}]}],"synonyms":["cozy","homely","friendly","welcoming","snug"],"phonetic":"/ˈkuːði/","extraExplanation":["“cothy”本身不是常见的标准英语拼写；在英语学习或写作中，建议改用更常见的词：\n- 若想表达“舒适温暖”，通常用 **cozy**。\n- 若想表达“亲切、朴实、让人自在（带一点英伦/苏格兰风格的用法）”，可用 **couthy**（更贴近你输入的拼法）。\n\n“couthy”常被认为源自苏格兰英语（Scots），带有“家常、亲切、朴实而舒服”的语感。"]}
{"word":"cotice","summary":{"en":"A rare heraldry term meaning a narrow diagonal band on a coat of arms, often alongside a larger band.","zh":"一个少见的纹章学术语，指盾徽上的狭窄斜带，常与较宽的斜带并列出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Heraldry) A narrow diagonal band on a coat of arms, usually placed alongside (as a border to) a broader band such as a bend.","zh":"（纹章学）盾徽上的一条狭窄斜带，常用来与较宽的斜带（如 bend 斜带）并列，起到陪衬或边饰的作用。"},"examples":[{"en":"The shield shows a bend with two cotices on either side.","zh":"这面盾徽上有一条斜带，两侧各有一条狭窄斜带（cotices）。"},{"en":"In the description, the bend is coticed in gold.","zh":"在纹章描述中，这条斜带以金色的狭窄斜带作陪衬（coticed in gold）。"}]}],"synonyms":["cotise","cote (heraldry, related)"],"phonetic":"/ˈkoʊtɪs/","extraExplanation":["“cotice”在现代英语里非常少见，多见于纹章学/家族徽章的专业语境；更常见的拼写是“cotise”（名词）或“cotised/cotised”（形容词/过去分词，用来表示“带有狭窄陪衬斜带的”）。","如果你是在日常英语中看到“cotice”，它也可能是拼写错误；常见的近似词包括 notice（通知/注意）或 cottage（小屋），需要结合上下文判断。"]}
{"word":"coticed","summary":{"en":"“Noticed” means you became aware of something or paid attention to it.","zh":"“noticed”表示你注意到、察觉到某事，或开始在意某人/某事。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “notice”: to become aware of something by seeing, hearing, or thinking about it.","zh":"“notice”的过去式和过去分词：通过看到、听到或思考而注意到、察觉到某事。"},"examples":[{"en":"I noticed a strange sound coming from the kitchen.","zh":"我注意到厨房里传来一个奇怪的声音。"},{"en":"She noticed that he looked tired today.","zh":"她注意到他今天看起来很累。"},{"en":"No one noticed the small typo in the email.","zh":"没有人注意到邮件里的那个小拼写错误。"}]},{"partOfSpeech":"v.","definition":{"en":"to pay attention to someone or something (often implying it matters socially or emotionally).","zh":"留意、在意（常带有社交或情感上的“重视/被注意到”的含义）。"},"examples":[{"en":"He finally noticed her after weeks of trying to talk to him.","zh":"她试着跟他说话好几周后，他终于注意到她了。"},{"en":"Kids notice when adults are stressed.","zh":"孩子会察觉到大人有压力。"}]}],"synonyms":["observed","saw","recognized","realized","detected","spotted"],"phonetic":"/ˈnoʊtɪst/","extraExplanation":["你输入的“coticed”很可能是拼写错误，正确拼写通常是“noticed”（notice 的过去式）。英语里 c 和 n 在键盘上位置接近，容易打错。"]}
{"word":"coticing","summary":{"en":"“coticing” is likely a misspelling of “noticing,” meaning becoming aware of something or paying attention.","zh":"“coticing” 很可能是 “noticing” 的拼写错误，意思是“注意到/察觉到；留意”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"noticing (present participle/gerund of “notice”): becoming aware of something; seeing, hearing, or realizing something.","zh":"noticing（notice 的现在分词/动名词）：注意到；察觉到；意识到某事。"},"examples":[{"en":"I’m noticing a strange smell in the kitchen.","zh":"我注意到厨房里有一股奇怪的味道。"},{"en":"Noticing small details can help you learn faster.","zh":"注意到细小的细节能帮助你学得更快。"},{"en":"She kept noticing that he looked tired lately.","zh":"她一直注意到他最近看起来很累。"}]},{"partOfSpeech":"n.","definition":{"en":"noticing (as a noun/gerund): the act of paying attention and becoming aware.","zh":"noticing（作动名词使用）：注意与察觉的行为。"},"examples":[{"en":"Noticing is the first step to changing a habit.","zh":"注意到问题是改变习惯的第一步。"},{"en":"Her noticing of patterns made her good at the game.","zh":"她善于察觉规律，所以很擅长这个游戏。"}]}],"synonyms":["seeing","observing","recognizing","realizing","spotting"],"phonetic":"/ˈnoʊtɪsɪŋ/","extraExplanation":["“coticing” 不是常见英文单词，最可能是把 “noticing” 拼错了（把 n 写成了 c）。如果你原本想表达“涂层/包覆”，可能要用 “coating”。你可以告诉我原句，我可以帮你确认最合适的词。"]}
{"word":"coticular","summary":{"en":"Cuticular (often misspelled as “coticular”) means “related to the cuticle,” especially the skin around nails or a protective outer layer in biology.","zh":"Cuticular（常被误写为“coticular”）意为“与角质层有关”，常指指甲周围的表皮角质，或生物学中起保护作用的外层。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the cuticle (the thin outer layer of skin, especially around the nails, or a protective outer layer on plants/insects).","zh":"与角质层有关的；与表皮的薄外层有关的（常指指甲周围的表皮，亦可指植物/昆虫的保护外层）。"},"examples":[{"en":"Dry hands can cause cuticular cracking around the nails.","zh":"手部干燥会导致指甲周围的角质层开裂。"},{"en":"This lotion helps soften cuticular skin before a manicure.","zh":"这款乳液有助于在做美甲前软化指缘角质。"},{"en":"Some insects have a waxy cuticular layer that helps prevent water loss.","zh":"一些昆虫有蜡质的角质层，有助于减少水分流失。"}]}],"synonyms":["cuticle-related","epidermal","keratinous"],"phonetic":"/kjuːˈtɪkjələr/","extraExplanation":["“coticular”在常见英语词典中并不常见，很多情况下是把“cuticular”拼错了（少写/错写了u）。如果你是在医学、美容（美甲/护肤）或生物学语境里看到它，通常应为cuticular。"]}
{"word":"cotidal","summary":{"en":"Cotidal means “having the same tidal timing or stage,” often used in oceanography (e.g., cotidal lines on tidal maps).","zh":"cotidal 指“潮时/潮相相同”，常用于海洋学语境（如潮汐图上的同潮线）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Occurring at the same time as the tide (especially high tide) at another place; having the same tidal timing.","zh":"与另一地点的潮汐（尤指高潮）在时间上同时发生的；潮时相同的。"},"examples":[{"en":"These two harbors are nearly cotidal, so high tide reaches them at almost the same time.","zh":"这两个港口几乎是同潮的，所以高潮到达它们的时间几乎一样。"},{"en":"Scientists compare cotidal stations to see how the tide wave moves along the coast.","zh":"科学家会比较同潮测站，以观察潮波如何沿海岸传播。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to a line on a map that connects points where the tide is at the same stage (same tidal phase) at a given time (a cotidal line).","zh":"（地图上）与“同潮线”有关的：连接在某一时刻潮汐处于同一阶段（同一潮相）的各点的线。"},"examples":[{"en":"The cotidal map shows cotidal lines across the bay.","zh":"这张潮汐图显示了海湾上的同潮线。"},{"en":"Engineers used cotidal lines to estimate when peak currents would occur at different sites.","zh":"工程师利用同潮线来估计不同地点的最大潮流会在何时出现。"}]}],"synonyms":["simultaneous (in tidal timing)","in-phase (tidal)","synchronous (tidal)"],"phonetic":"/koʊˈtaɪd(ə)l/","extraExplanation":["cotidal 常见于海洋学与水文测量语境。词形来自 co-（“共同、一起”）+ tidal（“潮汐的”）。","相关名词：cotidal line（同潮线），用于表示潮汐波传播时“同一潮相”的位置；常与 co-range line（同潮差线，连接潮差相同的点）一起出现在潮汐图上。"]}
{"word":"cotillage","summary":{"en":"Cotillage is a rare/obsolete noun meaning a cluster of cottages or a small cottage settlement.","zh":"Cotillage 是罕见/过时名词，指一片小屋群或由小屋组成的小聚落。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/obsolete) A group or cluster of small cottages; a small settlement made up of cottages.","zh":"（罕见/已过时）一片小屋群；由小屋组成的小聚落。"},"examples":[{"en":"From the hill you could see a cotillage of stone cottages near the river.","zh":"从山上能看到河边一片石头小屋群。"},{"en":"The old record mentions a cotillage built for farm workers.","zh":"那份旧档案提到曾为农场工人建过一片小屋聚落。"}]}],"synonyms":["hamlet","settlement","cluster of cottages"],"phonetic":"/kəˈtɪlɪdʒ/","extraExplanation":["“cotillage”不是现代英语里的常用词，很多学习者更可能是想写“cotillion”（交际舞会/方阵舞）或“cottage”（小屋）。如果你能提供看到它的句子或出处（书名/网页链接/上下文），我可以帮你确认它在那段文本中到底指什么，以及是否为拼写变体或误拼。"]}
{"word":"Cotillard","summary":{"en":"Cotillard is a French surname, commonly recognized from actress Marion Cotillard.","zh":"Cotillard 是一个法国姓氏，英语中常因女演员玛丽昂·歌迪亚而为人熟知。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A French surname, best known in English through the actress Marion Cotillard.","zh":"法国姓氏；在英语语境中最广为人知的是因法国女演员玛丽昂·歌迪亚（Marion Cotillard）而出名。"},"examples":[{"en":"Marion Cotillard won an Academy Award for her performance in La Vie en Rose.","zh":"玛丽昂·歌迪亚因在《玫瑰人生》（La Vie en Rose）中的表演获得了奥斯卡奖。"},{"en":"I recognized Cotillard immediately because of her roles in French and Hollywood films.","zh":"我一下就认出了歌迪亚，因为她在法国电影和好莱坞电影里都演过很多角色。"}]}],"phonetic":"/ˌkoʊtiˈjɑr/","extraExplanation":["“Cotillard”是法语姓氏。英语里遇到它时，常作为专有名词（人名的一部分）使用；在正式写作中通常首字母大写。","英语使用者对该姓的读法往往会按英语习惯近似发音；如果想更贴近法语原音，可留意法语里词尾的“r”更偏喉音。"]}
{"word":"cotillion","summary":{"en":"A cotillion is a formal group dance, or the social event where it is performed—often linked with etiquette and traditional society.","zh":"cotillion 指一种正式的集体社交舞，或举办这种舞蹈的舞会活动；常与礼仪训练和传统上流社交场合相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A formal group dance (or a social event/ball) in which people perform set figures, traditionally popular in Europe and later in the United States.","zh":"一种正式的集体舞（也可指举办这种舞蹈的社交舞会/舞会活动），有固定的舞步与队形；传统上流行于欧洲，后来也传入美国。"},"examples":[{"en":"They attended a cotillion at the country club to learn formal dances.","zh":"他们去乡村俱乐部参加 cotillion，学习正式的社交舞。"},{"en":"In some communities, a cotillion is a youth program that teaches etiquette and dancing.","zh":"在一些社区里，cotillion 也是一种青少年课程，教授礼仪与舞蹈。"},{"en":"The novel describes a glittering cotillion where gossip spread as quickly as the music.","zh":"小说描写了一场华丽的 cotillion，流言蜚语像音乐一样迅速传开。"}]}],"synonyms":["formal dance","ball","dance event","social dance"],"phonetic":"/kəˈtɪljən/","extraExplanation":["Cotillion 源自法语 *cotillon*，原意与“裙子/裙摆”有关，可能暗示舞步与衣裙摆动的画面。后来在英语世界里，它既可指一种“固定队形的社交舞”，也常指带有礼仪训练性质的“舞会/社交课程”（尤其在美国南方与部分上流社交传统中更常见）。","文化上，cotillion 常与“礼仪、体面、社交规范”联系在一起；当你在文学作品或影视剧里看到它，通常用来营造“传统、上流社交圈、规矩很多的场合”的氛围。"]}
{"word":"cotillions","summary":{"en":"Cotillions are formal social dance events (or the traditional dance itself), often linked with learning partner dances and etiquette.","zh":"cotillions指正式社交舞会/舞蹈活动（或指这种传统舞蹈本身），常与学习舞步和礼仪相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A formal social dance or ball (often for young people), where participants learn or perform dances and practice social etiquette.","zh":"（常为年轻人举办的）正式社交舞会/舞蹈活动，通常包含学跳舞与社交礼仪训练。"},"examples":[{"en":"She attended a cotillion to learn basic ballroom dances and formal manners.","zh":"她参加了一个cotillion，学习基础的交际舞和正式礼仪。"},{"en":"The local club hosts a cotillion every spring for high school students.","zh":"当地俱乐部每年春天都会为高中生举办cotillion活动。"}]},{"partOfSpeech":"n.","definition":{"en":"A traditional French dance (later adapted in English-speaking countries), historically a kind of group dance similar to early forms of square dancing.","zh":"一种传统的法国群舞（后来在英语国家演变/改编），历史上与早期方块舞类似。"},"examples":[{"en":"In the 18th century, the cotillion was popular in European salons.","zh":"在18世纪，cotillion在欧洲沙龙中很流行。"},{"en":"They demonstrated an old-style cotillion as part of the heritage festival.","zh":"他们在传统文化节上展示了一段旧式cotillion。"}]}],"synonyms":["ball","dance","formal dance","social","square dance (historical/related)"],"phonetic":"/kəˈtɪljən/","extraExplanation":["“cotillion”源自法语，原本指一种群舞；在美国（尤其南方一些地区），“a cotillion”常指面向青少年的礼仪与社交舞课程/舞会，有时与“debutante ball（名媛初次亮相舞会）”文化相关，但并不完全等同。","你输入的是复数“cotillions”，常用于泛指多场此类活动，或在谈论历史舞蹈时指不同形式/不同场合的cotillion。"]}
{"word":"cotillon","summary":{"en":"Cotillon is a formal social dance and the event where it’s performed; it can also mean a formal ball or an etiquette class for teens (especially in the U.S. South).","zh":"cotillon 指一种正式社交舞及其舞会活动；也可指正式舞会，或（尤指美国南部）面向青少年的礼仪课程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A formal social dance (and the event where it is danced), popular in the 18th–19th centuries; also used today for a formal ball or a class that teaches manners and social etiquette (especially in the U.S. South).","zh":"一种正式的社交舞（以及举行这种舞会的活动），在18—19世纪较流行；现在也可指正式舞会，或（尤指美国南部）教授礼仪与社交规范的“礼仪课/成人礼课程”。"},"examples":[{"en":"They attended a winter cotillon at the country club.","zh":"他们参加了乡村俱乐部的冬季正式舞会（cotillon）。"},{"en":"In some towns, teens take cotillon classes to practice etiquette and social dancing.","zh":"在一些城镇，青少年会上cotillon礼仪课，练习社交礼仪和舞步。"},{"en":"The novel describes an elegant cotillon with candles, music, and strict rules of politeness.","zh":"小说描写了一场优雅的cotillon舞会：烛光、音乐，以及严格的礼仪规范。"}]}],"synonyms":["cotillion","formal ball","dance (event)","etiquette class"],"phonetic":"/kəˈtɪljən/","extraExplanation":["词源来自法语 *cotillon*，原意与“裙子/衬裙”有关，后来转指一种社交舞与舞会。英语里更常见的拼写是 **cotillion**；**cotillon** 属于较少见或法语风格的拼写。","在美国语境中，*cotillon* 有时不单指“舞会”，还指面向青少年的礼仪课程（会包含餐桌礼仪、社交礼节与基本舞步），因此翻译时可根据上下文选“舞会/社交舞”或“礼仪课”。"]}
{"word":"cotillons","summary":{"en":"Cotillons are formal social dances/events, or modern etiquette-and-dance programs; less commonly, the word can mean a petticoat.","zh":"Cotillons 指社交舞/舞会或现代的礼仪与舞蹈课程；较少见时也可指女式衬裙。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a formal social dance (and the event featuring it), popular especially in the 18th–19th centuries; also, in modern U.S. use, a class or program that teaches teenagers manners, social skills, and ballroom dancing","zh":"（18—19世纪流行的）社交舞/舞会；（现代美国）“礼仪舞会/礼仪课程”，常教青少年礼仪、社交技巧与交际舞"},"examples":[{"en":"In the novel, the town’s winter cotillon was the highlight of the social calendar.","zh":"在小说里，小镇的冬季社交舞会是社交日程的重头戏。"},{"en":"She signed up for cotillion to learn basic etiquette and partner dancing.","zh":"她报名参加礼仪舞会课程，学习基本礼仪和双人舞。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a woman’s petticoat or underskirt, especially an ornamental one","zh":"（较少见）女式衬裙/内裙，尤指装饰性较强的"},"examples":[{"en":"The costume included a bright cotillon under the dress.","zh":"那套服装在裙子里面配了一条亮色的衬裙。"}]}],"synonyms":["ball","dance","formal dance","etiquette class","debutante event","petticoat"],"phonetic":"/kəˈtɪljən/","extraExplanation":["“cotillons”是“cotillon”的复数。历史上它源自法语 *cotillon*（原意与裙子有关），后来也指一种社交舞与舞会。","在美国一些地区，“cotillion”常指面向青少年的礼仪与社交培训活动（不一定真的穿正式舞会服装，但常包含社交舞与餐桌礼仪）。"]}
{"word":"coting","summary":{"en":"Coating means a covering layer, or the process of covering something with a layer.","zh":"Coating 指“涂层/包层”，也可指“涂覆（覆盖）的过程”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a layer of paint, chocolate, icing, metal, or other material that covers a surface to protect it or change how it looks/feels","zh":"（覆盖在表面的）涂层；包层；外层（如油漆层、巧克力层、糖霜层、金属镀层等）"},"examples":[{"en":"The pan has a nonstick coating that makes it easier to clean.","zh":"这口锅有不粘涂层，所以更容易清洗。"},{"en":"A thin coating of dust covered the bookshelf.","zh":"书架上覆盖着薄薄一层灰尘。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or process of covering something with a protective or decorative layer","zh":"涂覆；包覆（给物体覆盖保护层或装饰层的过程）"},"examples":[{"en":"The coating of the pipes helps prevent rust.","zh":"给管道做涂覆有助于防锈。"},{"en":"After coating the cake with icing, she added fruit on top.","zh":"给蛋糕抹上糖霜后，她又在上面放了水果。"}]},{"partOfSpeech":"adj.","definition":{"en":"covered with a layer of something (often used before a noun)","zh":"（作定语）涂有……的；包裹着……的"},"examples":[{"en":"She wore a chocolate-coating apron from the candy shop.","zh":"她穿着糖果店的那条“沾着巧克力涂层”的围裙。"},{"en":"We used a coating spray on the wooden table.","zh":"我们在木桌上用了涂层喷剂。"}]}],"synonyms":["covering","layer","finish","film"],"phonetic":"/ˈkoʊtɪŋ/","extraExplanation":["你输入的“coting”通常是“coating”的拼写错误。英语里更常见的是 coating（涂层/涂覆）。","coating 来自动词 coat（给……上涂层/覆盖），常见搭配有: protective coating（保护涂层）, nonstick coating（不粘涂层）, coating spray（涂层喷剂）, coat sth with sth（用……覆盖……）。"]}
{"word":"Cotinga","summary":{"en":"A cotinga is a tropical American rainforest bird, often brightly colored.","zh":"cotinga 指产于美洲热带雨林、常有鲜艳羽色的伞鸟（伞鸟科）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical American bird (family Cotingidae), often brightly colored; many species live in the rainforests of Central and South America.","zh":"伞鸟（伞鸟科 Cotingidae）：产于中美洲与南美洲热带地区的一类鸟，许多种类羽色鲜艳，常见于雨林。"},"examples":[{"en":"We saw a bright blue cotinga high in the canopy.","zh":"我们在树冠层高处看到一只亮蓝色的伞鸟。"},{"en":"Cotingas are rainforest birds known for their striking colors and calls.","zh":"伞鸟是雨林鸟类，以醒目的羽色和叫声而闻名。"}]}],"synonyms":["cotinga bird","cotingid"],"phonetic":"ˌkoʊˈtɪŋɡə","extraExplanation":["“cotinga”一词来自南美洲原住民语言（常被认为与图皮语族相关），最初用来指代这些当地常见的鸟类，后来被英语与科学命名吸收。","伞鸟科中有些物种（如雄鸟）色彩非常鲜艳，常作为生态旅游观鸟的“明星物种”。但在日常英语里，“cotinga”主要是鸟类名称，不常用于比喻义。"]}
{"word":"cotinga","summary":{"en":"A cotinga is a tropical Central/South American bird, often known for brightly colored males.","zh":"cotinga 指一种中南美洲热带的伞鸟类鸟，常以雄鸟羽色鲜艳著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tropical bird from Central and South America (family Cotingidae), often with very bright-colored males.","zh":"一种生活在中南美洲热带地区的鸟（伞鸟科/伞鸟类），雄鸟常有非常鲜艳的羽色。"},"examples":[{"en":"We saw a brilliant blue cotinga high in the canopy during our rainforest walk.","zh":"我们在雨林徒步时看到一只亮蓝色的伞鸟在树冠层高处活动。"},{"en":"Some cotingas are famous among birdwatchers because the males’ colors look almost unreal.","zh":"有些伞鸟在观鸟者中很有名，因为雄鸟的颜色鲜艳得几乎不真实。"}]}],"synonyms":["cotingid (more technical)"],"phonetic":"/koʊˈtɪŋɡə/","extraExplanation":["“Cotinga”常用于鸟类学与观鸟语境，指伞鸟科（Cotingidae）的一类鸟，并不是某一种单独的鸟名；不同种的外形与习性差异很大，但很多种以雄鸟的高饱和度色彩著名。","在英文里通常写作小写 cotinga；也可出现在具体物种名中，如 “blue cotinga”。中文常译为“伞鸟”（也有人按具体种另译）。"]}
{"word":"cotingid","summary":{"en":"“cotingid” isn’t a standard English word; it most likely means “coding.”","zh":"“cotingid” 不是标准英语单词；最可能是指 “coding（编程）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Likely a misspelling of “coding”: the activity of writing instructions (code) for computers.","zh":"很可能是 “coding” 的拼写错误：为计算机编写指令（代码）的活动。"},"examples":[{"en":"She is learning coding to build her own app.","zh":"她正在学习编程来做自己的应用。"},{"en":"Coding can be challenging at first, but practice helps.","zh":"编程一开始可能很难，但练习会有帮助。"}]},{"partOfSpeech":"v.","definition":{"en":"To write computer code; to program.","zh":"编写计算机代码；进行编程。"},"examples":[{"en":"He codes in Python every day.","zh":"他每天用 Python 写代码。"},{"en":"I’m coding a simple website for my class.","zh":"我正在为课程写一个简单的网站。"}]}],"synonyms":["programming","writing code","software development"],"phonetic":"/ˈkoʊdɪŋ/","extraExplanation":["“cotingid” 不是常见英语单词。如果你想查的是别的词，可能是：\n- coating（涂层/涂覆）\n- code/coding（代码/编程）\n- coating ID（涂层编号/标识）——更像是技术或表格里的字段名\n你可以告诉我你在哪句话或哪个场景里看到 “cotingid”，我可以更准确判断。"]}
{"word":"Cotingidae","summary":{"en":"Cotingidae is the scientific family name for cotingas—tropical birds from Central and South America.","zh":"Cotingidae 是“伞鸟（cotingas）”的鸟类科级学名，主要分布在中美洲和南美洲热带地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of tropical birds in Central and South America, known as cotingas, including many species with bright colors and distinctive calls.","zh":"（鸟类）伞鸟科：主要分布在中美洲和南美洲的热带鸟类科，成员统称伞鸟（cotingas），许多种类色彩鲜艳、叫声独特。"},"examples":[{"en":"The bellbird is a famous member of the family Cotingidae.","zh":"钟伞鸟（bellbird）是伞鸟科（Cotingidae）中很有名的成员。"},{"en":"In the Amazon rainforest, researchers recorded several Cotingidae species by their calls.","zh":"在亚马逊雨林里，研究人员通过叫声记录到多种伞鸟科（Cotingidae）鸟类。"}]}],"synonyms":["cotingas (common name)"],"phonetic":"/ˌkoʊtɪnˈɡɪdi/","extraExplanation":["“Cotingidae”是拉丁化的学名，常用于生物学、观鸟与自然纪录片语境；日常英语里更常说“cotingas（伞鸟）”。","该科以新热带界（Neotropics）为主，包含如钟伞鸟（bellbirds）、伞鸟（umbrella birds）等；不少物种有明显的性二型（雄鸟更艳丽）与夸张的求偶展示。","读写提示：学名在英文中通常首字母大写且斜体书写（Cotingidae），复数形式一般不变。"]}
{"word":"cotingidae","summary":{"en":"Cotingidae is the bird family of cotingas, tropical forest birds found in Central and South America.","zh":"Cotingidae 指“伞鸟科”，是分布于中美洲与南美洲热带森林的一类鸟。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of tropical New World birds known as cotingas, many of which live in Central and South American forests and include brightly colored species.","zh":"伞鸟科（Cotingidae）：一类分布于新大陆热带地区（主要在中美洲与南美洲）的鸟类科，成员常被称为伞鸟/伞鸟类（cotingas），其中不少物种羽色鲜艳，常见于森林环境。"},"examples":[{"en":"The researcher recorded several Cotingidae species during the rainforest survey in Peru.","zh":"研究人员在秘鲁的雨林调查中记录到了数种伞鸟科（Cotingidae）鸟类。"},{"en":"Some birds in the Cotingidae family are famous for their striking colors and display calls.","zh":"伞鸟科中的一些鸟以醒目的羽色和求偶展示叫声而闻名。"}]}],"synonyms":["cotingas (members of the family)"],"phonetic":"/koʊˈtɪŋɡɪdi/","extraExplanation":["“Cotingidae”是动物分类学中的“科名”（family name），对应中文常译为“伞鸟科”。在正式写作中常用拉丁学名（如Cotingidae），日常表达更常说“cotingas（伞鸟类）”。","读音提示：词尾“-idae”在生物分类学中常表示“科”，英语里通常读作“eye-dee/ih-dee”一类的结尾音（不同地区和学者会有细微差异）。"]}
{"word":"cotingoid","summary":{"en":"Cotingoid means “cotinga-related or cotinga-like”; it can also (rarely) mean a cotinga-like bird.","zh":"cotingoid 指“与伞鸟有关或像伞鸟的”；也可（较少见）指伞鸟或类似伞鸟的鸟。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adjective) Related to or resembling a cotinga (a group of tropical American birds).","zh":"（形容词）与伞鸟（美洲热带的一类鸟）有关的；像伞鸟的。"},"examples":[{"en":"The guide described the species as cotingoid because of its bright plumage and forest habitat.","zh":"向导把这种鸟称为“伞鸟型（cotingoid）”，因为它羽色鲜艳且生活在森林里。"},{"en":"Some older field notes use “cotingoid” for birds that look like cotingas but aren’t in the cotinga family.","zh":"一些较早的野外记录用“cotingoid”指那些看起来像伞鸟、但并不属于伞鸟科的鸟。"}]},{"partOfSpeech":"n.","definition":{"en":"(noun) A bird that is a cotinga or a cotinga-like bird (rare in modern use).","zh":"（名词）伞鸟或类似伞鸟的鸟（现代用法较少见）。"},"examples":[{"en":"In museum labels from the 1800s, “cotingoid” sometimes appears as a broad category name.","zh":"在19世纪的博物馆标签中，“cotingoid”有时会作为一个很宽泛的类别名称出现。"}]}],"synonyms":["cotinga-like","cotingid (technical)","-oid (as a suffix meaning “-like”)"],"phonetic":"/koʊˈtɪŋɡɔɪd/","extraExplanation":["“cotingoid”来自“cotinga（伞鸟）+ -oid（……状的/类似……的）”。在现代鸟类分类与科普写作中更常用的是“cotinga-like（像伞鸟的）”或直接写具体科名/属名；“cotingoid”多见于较旧或较学术化的描述。","如果你是想查“cotinoid / cotingid / cotingine”等相近词，也可能是拼写差异；告诉我句子语境我可以帮你确认更准确的词。"]}
{"word":"Cotinus","summary":{"en":"Cotinus: a plant genus commonly known as the smoke tree/smokebush.","zh":"Cotinus：黄栌属，常称烟树/黄栌（smoke tree）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of shrubs or small trees (in the sumac family) known for their airy, “smoky” flower clusters; commonly called smoke tree or smokebush.","zh":"黄栌属（漆树科）植物的属名，为灌木或小乔木；因花序呈轻烟般的绒雾状，常称“烟树/黄栌（smoke tree）”。"},"examples":[{"en":"Cotinus is often planted in gardens for its smoky-looking blooms.","zh":"黄栌属植物常用于园林种植，因为它的花序看起来像一团“烟雾”。"},{"en":"In autumn, some Cotinus varieties turn brilliant red or purple.","zh":"秋天时，一些黄栌属品种会变成鲜艳的红色或紫色。"},{"en":"The landscaper recommended Cotinus for a sunny, well-drained spot.","zh":"景观设计师建议把黄栌属植物种在阳光充足、排水良好的地方。"}]}],"synonyms":["smoke tree","smokebush"],"phonetic":"/koʊˈtaɪnəs/","extraExplanation":["“Cotinus”是拉丁化的植物学属名，常见的英文俗名是“smoke tree / smokebush”，因为开花后形成蓬松细碎的花梗，看起来像树上冒出一团烟雾。","在英语语境里写作时，属名通常首字母大写（Cotinus），表示分类单位；具体某个物种会写成双名法，如 *Cotinus coggygria*（常见园艺黄栌）。"]}
{"word":"cotinus","summary":{"en":"Cotinus is a genus of ornamental shrubs/small trees called smoke trees, famous for their smoke-like flower clusters.","zh":"Cotinus 指黄栌属（烟树/烟雾树），以如烟般蓬松的花序而闻名的观赏灌木或小乔木。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of shrubs or small trees (the smoke tree/smokebush) known for its airy, smoke-like flower clusters; also used to refer to a plant from this genus","zh":"黄栌属（烟树/烟雾树）：一种灌木或小乔木属，以轻飘如烟的花序著称；也可指该属的某一种植物"},"examples":[{"en":"Cotinus is often planted for its smoky pink flower plumes in summer.","zh":"黄栌常因夏季粉色、如烟的花序而被栽种观赏。"},{"en":"The garden features a Cotinus near the entrance for bold color and texture.","zh":"花园入口附近种了一株黄栌，用来增强色彩和质感。"}]}],"synonyms":["smoke tree","smokebush","smoketree"],"phonetic":"/koʊˈtaɪnəs/","extraExplanation":["“Cotinus”是植物学上的拉丁学名，英语里常见的俗名是“smoke tree / smokebush（烟树/烟雾树）”。常见种包括欧洲黄栌（Cotinus coggygria）和美洲黄栌（Cotinus obovatus）。","词源上常与希腊语“kotinos（野橄榄）”相关；在园艺语境里，人们也常用“smoke”来形容其花序像烟雾一样蓬松。"]}
{"word":"cotise","summary":{"en":"Cotise is a rare heraldry term meaning a thin strip that borders a main band (like a bend), or the act of adding such strips.","zh":"Cotise 是少见的纹章学词，指在主要图带（如斜带）旁的细边饰，也可指“加上这种细边饰”的动作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In heraldry, a narrow strip (or pair of strips) that runs alongside a main band such as a bend, usually as a decorative border.","zh":"（纹章学）指沿着主要斜带（如 bend 斜带）两侧的一条（或一对）狭窄细带，常用作装饰性的边饰。"},"examples":[{"en":"The shield shows a bend cotised with two thin lines on either side.","zh":"这面盾徽上有一条斜带，斜带两侧各有一条细线作 cotise（边饰）。"},{"en":"In the drawing, the main stripe is emphasized by a cotise on each side.","zh":"在这幅图中，主条带两侧各加一条 cotise，从而突出主体。"}]},{"partOfSpeech":"v.","definition":{"en":"To add a cotise (a narrow bordering strip) to a heraldic ordinary, especially to place thin lines alongside a bend.","zh":"（纹章学）给纹章的主要图带加上 cotise（狭窄边饰），尤指在斜带两侧加细带。"},"examples":[{"en":"The artist cotised the bend to make it stand out more clearly.","zh":"艺术家在斜带两侧加了 cotise，让它更清晰醒目。"}]}],"synonyms":["cottise","coty (related heraldic term)"],"phonetic":"/koʊˈtiːz/","extraExplanation":["cotise 属于纹章学（heraldry）用语，在日常英语里非常少见；更多时候你会看到拼写变体 cottise / cottised。","来源与法语有关：cotise 表示“细带、边条”。在盾徽描述（blazon）里，cotise 常用来说明某条主要图带被两条更细的线条“夹着/陪衬”。"]}
{"word":"cotised","summary":{"en":"Cotised is mainly a heraldry term meaning “flanked by two narrow parallel stripes.” It can also be the past form of cotise.","zh":"cotised 主要是纹章学用语，表示“主带两侧各配一条窄细带”。也可作 cotise 的过去式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Heraldry) Describes a band (especially a bend) that has a narrow stripe on each side, as decoration or emphasis.","zh":"（纹章学）形容一条带状纹（尤其是斜带）两侧各有一条更窄的细带相伴，用作装饰或强调。"},"examples":[{"en":"The shield shows a bend cotised in gold.","zh":"这面盾徽上有一条金色的斜带，并在两侧各配有一条更窄的金色细带。"},{"en":"A pale cotised can make the central stripe look stronger and more formal.","zh":"在主竖带两侧加上细带（cotised）会让中间的竖带更醒目、更庄重。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of cotise: to add cotises (narrow parallel stripes) beside a band in a coat of arms; in some contexts, to contribute money into a shared fund (rare in English, influenced by French usage).","zh":"cotise 的过去式/过去分词：在纹章图案中给一条带状纹两侧加上平行细带；在某些语境中也可指“分摊/凑钱”（英语中较少见，受法语用法影响）。"},"examples":[{"en":"The designer cotised the bend to match the family’s older arms.","zh":"设计者在斜带两侧加上细带，以呼应家族更早期的纹章。"},{"en":"We cotised for the farewell gift at work.","zh":"我们在公司里凑钱买离别礼物。"}]}],"synonyms":["(heraldry) fimbriated (related but not identical)","(heraldry) bordered (general)","flanked"],"phonetic":"ˈkoʊtaɪzd","extraExplanation":["“cotised”最常见于纹章学（heraldry）描述：cotise/cotised来自法语词源，指在主带（如bend 斜带、pale 竖带等）两侧加两条更窄的平行线条（cotises）。日常英语里几乎不会用到。","“凑钱/分摊”这个动词用法更像法语 cotiser 的影响；在英语中属于少见或地区/语境很特定的用法，看到时可结合上下文判断。"]}
{"word":"cotising","summary":{"en":"“Cotising” is usually a misspelling of “quoting.” In French-influenced contexts, it can also mean paying contributions/dues into a shared fund.","zh":"“cotising” 通常是把 “quoting（引用）” 拼错了；在受法语影响的语境中，也可指缴纳分摊款/会费等。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard spelling; most often a misspelling of “quoting” (repeating someone’s exact words or citing a text).","zh":"一种不规范拼写；最常见是把 “quoting”（引用、引述原话/原文）拼错了。"},"examples":[{"en":"Are you quoting the teacher, or is that your own idea?","zh":"你是在引用老师的话，还是你自己的想法？"},{"en":"Please use quotation marks when quoting a sentence.","zh":"引用一句话时请使用引号。"}]},{"partOfSpeech":"v.","definition":{"en":"(In some communities influenced by French) “cotising” may be used to mean paying contributions/dues into a shared fund (e.g., social insurance, a group fund).","zh":"（在受法语影响的语境中）“cotising” 有时被用来表示缴纳分摊款/会费/社保类缴费（把钱缴入共同基金）。"},"examples":[{"en":"Many workers are cotising every month for social insurance.","zh":"很多员工每月都在缴纳社保类费用。"},{"en":"We’re cotising to buy a gift for our coworker.","zh":"我们在凑钱给同事买礼物。"}]}],"synonyms":["quoting","citing","paying dues","paying contributions","chipping in"],"phonetic":"/ˈkoʊtəˌzaɪzɪŋ/","extraExplanation":["“cotising” 在标准英语里不常见；如果你是在英语写作/考试中看到或想表达“引用”，通常应写 quoting。","第二个用法多见于受法语影响的英语环境（来自法语动词 cotiser“缴费、分摊”）。在更地道的英语里，可用 pay contributions / pay dues / chip in 来表达。"]}
{"word":"cotitular","summary":{"en":"Cotitular means a joint holder/co-owner of a right, account, contract, or position (common in legal and financial contexts).","zh":"cotitular 指“共同持有人/共同权利人”，常用于法律、金融（如共同账户）等语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a co-holder of a title, right, or official position; someone who shares ownership or responsibility with another person (often used in legal, banking, or insurance contexts).","zh":"共同持有人；与他人共同拥有某项权利、头衔或职位的人（常见于法律、银行或保险语境）。"},"examples":[{"en":"Both spouses are cotitulars of the bank account, so either one can access it.","zh":"夫妻双方都是该银行账户的共同持有人，所以任何一方都可以使用。"},{"en":"She is a cotitular of the lease, which means she shares responsibility for the rent.","zh":"她是租约的共同承租人，这意味着她要共同承担房租责任。"}]},{"partOfSpeech":"adj.","definition":{"en":"shared by two or more holders (describing a position, right, or document held jointly).","zh":"共同持有的；由两人或多人共同拥有的（用于描述共同持有的职位、权利或文件）。"},"examples":[{"en":"They signed a cotitular agreement for the property.","zh":"他们签署了一份该房产的共同持有协议。"}]}],"synonyms":["joint holder","co-owner","co-holder","co-account holder","co-tenant"],"phonetic":"/koʊˌtiːtuˈlɑr/","extraExplanation":["“cotitular”是西班牙语（也见于一些法律/行政文本），由“co-（共同）+ titular（持有人/权利人）”组成。英语里更常用的对应说法是“co-owner / joint holder / co-holder / co-account holder（共同账户持有人）/ co-policyholder（共同投保人）”。","在银行语境里，“cotitular”通常强调账户是共同名义（joint account），权利和责任可能是对等的；但具体权限（例如是否两人都能单独取款）仍取决于账户类型与合同条款。"]}
{"word":"cotland","summary":{"en":"Scotland: a country in the northern UK with its own culture and history.","zh":"Scotland：英国北部的一个组成国，拥有独特的文化与历史。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A country in the northern part of the United Kingdom, known for its capital Edinburgh, its largest city Glasgow, and traditions such as kilts and bagpipes.","zh":"苏格兰：位于英国北部的一个国家（英国的组成国之一），以首府爱丁堡、最大城市格拉斯哥以及如短裙（kilt）、风笛等传统闻名。"},"examples":[{"en":"Edinburgh is the capital of Scotland.","zh":"爱丁堡是苏格兰的首府。"},{"en":"My family traveled around Scotland and visited the Highlands.","zh":"我家人去苏格兰旅行，参观了苏格兰高地。"},{"en":"Scotland is part of the UK, but it has its own culture and history.","zh":"苏格兰是英国的一部分，但它有自己独特的文化和历史。"}]}],"synonyms":["Scottish (adj.)","the Highlands (region)","the UK (related term)"],"phonetic":"ˈskɑtlənd","extraExplanation":["你输入的“cotland”很可能是拼写错误，正确拼写是 **Scotland**（首字母大写）。","苏格兰是“联合王国（UK）”的组成国之一（另外还有英格兰、威尔士、北爱尔兰）。日常口语里常说“in Scotland / Scottish”。","形容词/国籍：**Scottish**（苏格兰的/苏格兰人）；名词：**a Scot**（苏格兰人）。"]}
{"word":"Cotman","summary":{"en":"Cotman is a surname, best known as the name of English artist John Sell Cotman.","zh":"Cotman 是一个姓氏，最常见于指英国艺术家约翰·塞尔·科特曼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surname; most famously referring to **John Sell Cotman (1782–1842)**, an English watercolor painter and printmaker known for landscapes and architectural scenes.","zh":"一个姓氏；最著名的指 **约翰·塞尔·科特曼（1782–1842）**，英国水彩画家与版画家，以风景画和建筑题材闻名。"},"examples":[{"en":"We studied Cotman’s watercolor landscapes in art class.","zh":"我们在美术课上学习了科特曼的水彩风景画。"},{"en":"This museum has a small collection of works by Cotman.","zh":"这家博物馆收藏了一小部分科特曼的作品。"}]}],"phonetic":"/ˈkɑt.mən/","extraExplanation":["“Cotman”作为专有名词时，常见于艺术史语境，尤其与英国19世纪“诺里奇画派（Norwich School）”相关。科特曼的作品以清晰的构图、柔和而克制的色彩著称，常描绘英国乡村与古建筑。"]}
{"word":"cotman","summary":{"en":"Cotman is mainly used as a surname, and it can also refer specifically to the English artist John Sell Cotman.","zh":"Cotman 主要作姓氏使用，也可特指英国艺术家约翰·塞尔·科特曼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"（英）姓氏：科特曼。"},"examples":[{"en":"My teacher’s last name is Cotman.","zh":"我老师的姓是 Cotman（科特曼）。"},{"en":"The Cotman family has lived in this town for generations.","zh":"科特曼家族在这个镇上已经住了好几代。"}]},{"partOfSpeech":"n.","definition":{"en":"John Sell Cotman (1782–1842), an English landscape painter and etcher associated with the Norwich School of painters.","zh":"约翰·塞尔·科特曼（1782–1842）：英国风景画家与版画家，常被归入“诺里奇画派”。"},"examples":[{"en":"We studied Cotman’s watercolor landscapes in art class.","zh":"我们在美术课上学习了科特曼的水彩风景画。"},{"en":"The museum has a small collection of Cotman prints.","zh":"这家博物馆收藏了一小批科特曼的版画作品。"}]}],"synonyms":["(surname)","John Sell Cotman"],"phonetic":"/ˈkɑt.mən/","extraExplanation":["“Cotman”更常见于人名/姓氏语境，而不是普通词汇。若你是在读艺术史，最常指 John Sell Cotman：他以清淡、结构感强的水彩风景著名，题材常见英国乡村、建筑与海岸景色。","“Norwich School（诺里奇画派）”是19世纪英国地方风景画的重要群体之一，强调对自然光影与地方景色的观察；Cotman 是其中较有代表性的艺术家之一。"]}
{"word":"coto","summary":{"en":"“Coto” is most often a loanword referring to an Indonesian Makassar-style beef soup; in Spanish-influenced contexts it can mean a restricted preserve such as a hunting estate.","zh":"“coto”多见作外来词，指印尼望加锡风味的牛肉汤；在受西语影响的语境中也可指限制进入的保护地，如狩猎庄园。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Loanword, Indonesian cuisine) A traditional beef-and-offal soup from Makassar (South Sulawesi), often served with rice cakes (ketupat) and topped with fried shallots.","zh":"（外来词，印尼料理）一种源自印尼苏拉威西南部望加锡的传统牛肉（常含内脏）汤，常配米饭或粽叶米糕（ketupat）食用，并撒炸红葱头。"},"examples":[{"en":"I tried coto Makassar at an Indonesian restaurant, and it was rich and spicy.","zh":"我在一家印尼餐馆尝了望加锡牛肉汤（coto Makassar），味道浓郁又带辣。"},{"en":"Coto is usually served with ketupat rather than plain bread.","zh":"Coto 通常会配 ketupat（米糕）而不是普通面包。"}]},{"partOfSpeech":"n.","definition":{"en":"(From Spanish, used in English contexts) A preserve or restricted area, especially a private hunting estate.","zh":"（源自西班牙语，用于英语语境）保护地或限制进入的区域，尤指私人狩猎场/狩猎庄园。"},"examples":[{"en":"The tour guide explained that the land was once a coto de caza (hunting preserve).","zh":"导游解释说这片土地过去曾是 coto de caza（狩猎保护区/狩猎场）。"},{"en":"Access to the coto was limited to members.","zh":"进入这个 coto 仅限会员。"}]}],"synonyms":["coto Makassar","hunting preserve"],"phonetic":"/ˈtʃoʊtoʊ/","extraExplanation":["“coto”在英语里并不算常见词，更常见于菜单、旅行介绍或引用原语言（如印尼语/西班牙语）的场景。","印尼菜里常见固定搭配是“coto Makassar”（望加锡牛肉汤）；西语里常见搭配是“coto de caza”（狩猎保护区/狩猎场）。"]}
{"word":"cotoin","summary":{"en":"“Cotton” means the soft fiber used to make cloth, and it can also describe something made from that fiber.","zh":"“Cotton”指用来纺织的棉纤维（棉花），也可作形容词表示“棉制的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a soft white fiber that grows around the seeds of the cotton plant, used to make thread and cloth","zh":"棉花（棉纤维）；生长在棉籽周围的柔软白色纤维，用来纺线和做布料"},"examples":[{"en":"This shirt is made of 100% cotton.","zh":"这件衬衫是100%纯棉的。"},{"en":"Cotton is comfortable to wear in hot weather.","zh":"炎热天气穿棉质衣服很舒服。"}]},{"partOfSpeech":"adj.","definition":{"en":"made of cotton; relating to cotton fiber or cloth","zh":"棉制的；与棉纤维或棉布有关的"},"examples":[{"en":"I prefer cotton socks because they breathe well.","zh":"我更喜欢棉袜，因为透气性好。"},{"en":"Use a cotton towel to dry your hands.","zh":"用棉毛巾擦干手。"}]}],"synonyms":["cotton fiber","cotton cloth","lint"],"phonetic":"/ˈkɑtən/","extraExplanation":["你输入的“cotoin”在英语里不常见，通常是把“cotton（棉花；棉质）”拼错了。常见拼写是 cotton（双 t），发音里最后的 -on 常弱读成类似“ən”。"]}
{"word":"Cotolaurel","summary":{"en":"“Cotolaurel” most likely refers to “Coto Laurel,” a barrio (community) in Ponce, Puerto Rico.","zh":"“Cotolaurel”很可能指“Coto Laurel”，即波多黎各庞塞市的一个社区/行政区（barrio）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A place name: a community (barrio) in Ponce, Puerto Rico, often written as two words: “Coto Laurel.”","zh":"地名：波多黎各庞塞（Ponce）的一个社区/行政区（barrio），常写作两个词：“Coto Laurel”。"},"examples":[{"en":"Coto Laurel is a barrio of Ponce in southern Puerto Rico.","zh":"Coto Laurel 是波多黎各南部庞塞市的一个行政区。"},{"en":"She lives in Coto Laurel, not far from downtown Ponce.","zh":"她住在 Coto Laurel，离庞塞市中心不远。"}]}],"phonetic":"/ˈkoʊtoʊ lɔˈrɛl/","extraExplanation":["“Coto Laurel”看起来像把西班牙语地名连写成了一个词（Cotolaurel）。在英语资料中更常见的写法是分开写：Coto Laurel。","在波多黎各，barrio 是一种行政分区，类似“区/社区”的概念。","词源上，“Laurel”在西班牙语里常指“月桂/桂冠”（也可指月桂树）；“coto”在西班牙语中可有“界定的区域/保留地”等含义，但作为地名时不一定直译。"]}
{"word":"Cotonam","summary":{"en":"“Cotonam” is not a common English dictionary word; it’s likely a name or a misspelling.","zh":"“Cotonam”不是常见英语词汇；更可能是专有名词或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a proper name (a person, place, brand) or a misspelling of a similar-looking word.","zh":"不是标准英语词汇。可能是专有名词（人名、地名、品牌等），或是与某个相近拼写单词的拼写错误。"},"examples":[{"en":"I couldn’t find “Cotonam” in an English dictionary—where did you see it?","zh":"我在英语词典里查不到“Cotonam”——你是在哪里看到的？"},{"en":"If Cotonam is a company name, please share the sentence so I can explain it.","zh":"如果 Cotonam 是公司名，请把完整句子发我，我可以结合语境解释。"}]}],"phonetic":"/ˈkoʊtənæm/","extraExplanation":["“Cotonam”在常见英语词典中通常查不到。最常见的情况是：①专有名词（例如品牌/人名/机构名）；②拼写接近其他词，例如 cotton（棉花）、Cotonou（科托努，贝宁城市）等。","如果你把它出现的句子、来源（书/网页/聊天）、以及你想表达的意思发我，我可以帮你判断它到底是什么词（或应该改成哪个词），并给出准确释义与用法。"]}
{"word":"cotonam","summary":{"en":"Not a standard English word; likely a misspelling (probably “cotton”).","zh":"不是标准英文词；很可能是拼写错误（可能想写“cotton”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“cotonam” is not a standard English word. It is most likely a misspelling of “cotton” (a soft natural fiber) or a similar-looking word.","zh":"“cotonam”不是标准英文单词。它很可能是“cotton”（棉花/棉布）的拼写错误，或与其相近的词。"},"examples":[{"en":"I couldn’t find “cotonam” in an English dictionary—did you mean “cotton”?","zh":"我在英文词典里找不到“cotonam”——你是不是想写“cotton”？"}]}],"phonetic":"/ˈkɑtən/","extraExplanation":["“cotonam”看起来最像把“cotton”拼错了（常见错误：少写/多写字母）。如果你想表达“棉质的/纯棉”，常用说法是：cotton (n./adj.)，例如 cotton shirt（棉衬衫）、100% cotton（100%纯棉）。","也可能你想写的是某个专有名词（人名、地名、品牌名）。如果你能提供句子上下文或你想表达的中文意思，我可以更准确地判断。"]}
{"word":"Cotoneaster","summary":{"en":"Cotoneaster is a common ornamental shrub with small leaves and colorful berries.","zh":"Cotoneaster 指常见的观赏灌木（栒子属），叶小并会结颜色鲜艳的浆果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a shrub (genus *Cotoneaster*) with small leaves and clusters of red, orange, or black berries, often grown as an ornamental plant or groundcover","zh":"栒子属（Cotoneaster）的灌木；叶小、常结成串的红/橙/黑色浆果，常作观赏植物或地被植物栽培"},"examples":[{"en":"The cotoneaster along the wall turns bright with red berries in autumn.","zh":"墙边的栒子到了秋天会结满鲜红的浆果，很醒目。"},{"en":"Many gardeners plant cotoneaster as a low hedge because it’s easy to shape.","zh":"很多园艺爱好者把栒子种成低矮的绿篱，因为比较容易修剪造型。"},{"en":"Birds often eat the berries from cotoneaster shrubs in winter.","zh":"冬天时，鸟类常会来吃栒子灌木上的浆果。"}]}],"synonyms":["cotoneaster shrub","ornamental shrub"],"phonetic":"/koʊˈtoʊniˌæstər/","extraExplanation":["读音拆分可记为：co-to-ne-as-ter（重音常在“to”附近）。","Cotoneaster 常见于庭院与公园绿化，可作地被、绿篱或盆景；不同品种习性差异较大（有的匍匐、有的直立）。","词源来自拉丁语，和“cotton（棉花）”同源的部分指“像绒毛一样的质感”，后半部分与“aster（星状花）”相关的构词传统相似，但这里主要作为植物学属名使用。"]}
{"word":"cotoneaster","summary":{"en":"Cotoneaster is a garden shrub known for small leaves, small flowers, and bright berries.","zh":"Cotoneaster 指一种常见园林灌木，以小叶、小花和鲜艳浆果著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a shrub (often used in gardens) with small leaves, white or pink flowers, and bright red/orange berries","zh":"栒子属植物（常见园林灌木），叶片较小，开白色或粉色小花，结红色或橙色浆果"},"examples":[{"en":"We planted cotoneaster along the fence because it stays green and has colorful berries in winter.","zh":"我们沿着篱笆种了栒子，因为它常绿，而且冬天会结出好看的果子。"},{"en":"Birds often eat the berries of cotoneaster in late fall.","zh":"深秋时鸟类常会吃栒子的浆果。"}]}],"synonyms":["(no exact synonym; related: shrub, ornamental shrub, groundcover)"],"phonetic":"/ˌkoʊtəˈniːæstər/","extraExplanation":["“Cotoneaster”常见于园艺语境，中文常译作“栒子”（也有人称“栒子属”）。不同品种有匍匐型（作地被）和直立型（作绿篱或观果灌木）。","发音里常见的学习点是重音通常在第三音节：/ˌkoʊtəˈniːæstər/。","注意：栒子的“果子”在植物学上多被称为“梨果”（pome），园艺上通常直接说“berries（浆果）”。"]}
{"word":"cotonia","summary":{"en":"“Cotonia” isn’t a common English word; it’s usually a proper name or a misspelling (often of “cottony”).","zh":"“cotonia”不是常见英语单词；通常是专有名词用法，或是拼写错误（常见为“cottony”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare or nonstandard word in English; most often seen as a proper name (for example, in scientific or brand/context-specific uses), not a common dictionary entry.","zh":"在英语中很少见或不规范的词；多见于专有名词（例如科研命名、品牌/项目名等特定语境），并非常见词典词条。"},"examples":[{"en":"I couldn’t find “cotonia” in a standard English dictionary—can you share the sentence where you saw it?","zh":"我在常见英语词典里找不到“cotonia”——你能把它出现的句子发我吗？"},{"en":"In this article, Cotonia is used as a project name, not a regular English word.","zh":"在这篇文章里，Cotonia 是项目名称，并不是普通英语单词。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Common confusion) A misspelling of “cottony,” meaning soft and fuzzy like cotton.","zh":"（常见混淆）可能是“cottony”的拼写错误，意思是“像棉花一样柔软、蓬松的”。"},"examples":[{"en":"The plant has a cottony white coating on its leaves.","zh":"这种植物的叶子上有一层棉絮状的白色覆盖物。"},{"en":"After the wash, the towel felt cottony and soft.","zh":"洗完后，这条毛巾摸起来很柔软、很像棉的质感。"}]}],"synonyms":["(if you meant cottony) fuzzy","(if you meant cottony) downy","(if you meant cottony) woolly"],"phonetic":"/koʊˈtoʊniə/","extraExplanation":["“cotonia”不是常见英语词汇。如果你是在生物/植物学材料里看到的，它可能是某个拉丁学名或属名的写法（也可能是拼写变体或误写）。如果你把原句或截图发来，我可以根据上下文判断它究竟指什么。","如果你的本意是表达“棉絮状的/像棉一样的”，英语最常用的是 cottony（如：cottony texture / cottony coating）。"]}
{"word":"cotonier","summary":{"en":"Cotonier is a rare noun meaning a cotton plant or cotton-related tree, often influenced by French usage.","zh":"Cotonier是一个少见名词，指棉花植物或与棉有关的树木，多受法语用法影响。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cotton plant (especially in older or regional usage); sometimes used for a cotton tree or cottonwood in places influenced by French.","zh":"棉花植物（尤指较旧或地区性用法）；在受法语影响的地区有时也指“棉树/棉白杨”等类似植物。"},"examples":[{"en":"In some old travel writing, a “cotonier” is mentioned as a plant cultivated for cotton.","zh":"在一些较早的游记中，“cotonier”被提到是一种为产棉而种植的植物。"},{"en":"They said the cotonier grew well in the warm, coastal climate.","zh":"他们说这种“cotonier”在温暖的沿海气候里长得很好。"}]}],"synonyms":["cotton plant","cotton tree","cottonwood","cotonnier"],"phonetic":"/ˌkoʊtənˈjɛr/","extraExplanation":["“cotonier”在现代标准英语里非常少见，很多时候是法语“cotonnier”（与棉花有关的、棉花树/棉花植物）进入英语后的拼写或转写形式，也可能是拼写误差。更常见的英语表达是“cotton plant / cotton tree / cottonwood（视具体植物而定）”。","如果你是在某篇文章、家谱记录或地名里看到它，最好提供上下文（句子或地区），因为在加勒比、路易斯安那等受法语影响的语境里，它可能指特定的本地树种，而不一定是农作物棉花。"]}
{"word":"Cotonou","summary":{"en":"Cotonou is Benin’s largest city and main port, often functioning as the country’s de facto capital.","zh":"科托努是贝宁最大的城市和主要港口，常作为事实上的首都/政治经济中心。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a major city and the largest port of Benin (West Africa); it is widely treated as the country’s de facto political and economic center (many government offices are there), while Porto-Novo is the official capital.","zh":"科托努（贝宁西非城市）：贝宁最大的港口与重要城市，常被视为事实上的政治与经济中心（许多政府机构设在此），而官方首都是波多诺伏（Porto-Novo）。"},"examples":[{"en":"I flew into Cotonou and then traveled north to visit Pendjari National Park.","zh":"我飞到科托努，然后向北去参观彭贾里国家公园。"},{"en":"Cotonou is known for its busy port and large open-air markets.","zh":"科托努以繁忙的港口和大型露天市场而闻名。"},{"en":"Many embassies and ministries are located in Cotonou even though the capital is Porto-Novo.","zh":"虽然首都是波多诺伏，但许多大使馆和部委设在科托努。"}]}],"synonyms":["(no direct synonyms; related: Benin, Porto-Novo, West Africa)"],"phonetic":"/ˌkoʊtəˈnuː/","extraExplanation":["“Cotonou”通常被英语当作专有名词使用，首字母大写；作为地名一般不加冠词（不说 *the Cotonou*）。","名称常被认为源自当地方言（如丰语 Fon）相关表达；不同资料对词源解释略有差异，但都指向当地语言与地理/聚落历史背景。","文化与旅游语境中，科托努常与“丹托帕市场（Dantokpa Market）”“科托努港（Port of Cotonou）”等搭配出现。"]}
{"word":"Cotopaxi","summary":{"en":"Cotopaxi most commonly refers to a famous active volcano in Ecuador; it can also refer to an outdoor-gear brand named after the volcano.","zh":"Cotopaxi 最常指厄瓜多尔著名的活火山；也可指以该火山命名的户外品牌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a high, snow-capped stratovolcano in the Andes of Ecuador, known as one of the world’s highest active volcanoes.","zh":"科托帕希火山：厄瓜多尔安第斯山脉的一座高海拔、终年积雪的层状火山，被认为是世界上海拔最高的活火山之一。"},"examples":[{"en":"Cotopaxi is a famous volcano near Quito, Ecuador.","zh":"科托帕希火山是厄瓜多尔首都基多附近的一座著名火山。"},{"en":"Many travelers visit Cotopaxi National Park to hike and see the volcano.","zh":"很多游客会去科托帕希国家公园徒步并观赏火山。"}]},{"partOfSpeech":"n.","definition":{"en":"a U.S. brand that makes outdoor bags and gear, named after the Ecuadorian volcano.","zh":"（Cotopaxi）一家美国户外品牌，生产背包等装备，名字来自厄瓜多尔的科托帕希火山。"},"examples":[{"en":"She bought a Cotopaxi backpack for school and weekend trips.","zh":"她买了一个 Cotopaxi 的背包，用于上学和周末出行。"},{"en":"Cotopaxi is known for colorful outdoor gear.","zh":"Cotopaxi 以色彩鲜艳的户外装备而闻名。"}]}],"synonyms":["Mount Cotopaxi","Cotopaxi Volcano"],"phonetic":"/ˌkoʊtəˈpɑːksi/","extraExplanation":["“Cotopaxi”来自厄瓜多尔当地语言（常被认为与克丘亚语有关），常被解释为与“月亮/光亮”相关的含义，但不同来源对词源细节说法不一。","作为专有名词，写作首字母大写：Cotopaxi。用于指品牌时也通常大写。","在英语写作中，你也会看到它出现在文学与旅行写作里，比如在描写安第斯山脉风景或厄瓜多尔文化背景时提到这座火山。"]}
{"word":"cotorment","summary":{"en":"“cotorment” isn’t a standard word; it’s probably “torment,” meaning great suffering (noun) or to cause great suffering (verb).","zh":"“cotorment”不是标准英语词；很可能是“torment”，意思是“极大痛苦”（名词）或“使极其痛苦/折磨”（动词）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Not a standard English word) Likely a misspelling of “torment.”","zh":"（不是标准英语词）很可能是“torment”的拼写错误。"},"examples":[{"en":"I couldn’t find “cotorment” in a dictionary—did you mean “torment”?","zh":"我在词典里找不到“cotorment”——你是不是想写“torment”？"}]},{"partOfSpeech":"n.","definition":{"en":"Severe mental or physical suffering; great pain or worry.","zh":"（身心的）极大痛苦；折磨。"},"examples":[{"en":"The loss was a source of deep torment for him.","zh":"这次失去对他来说是深深的痛苦。"},{"en":"She lived in torment, worrying about her family’s safety.","zh":"她一直在担忧家人的安全中煎熬。"}]},{"partOfSpeech":"vt.","definition":{"en":"To cause someone great pain, suffering, or anxiety; to torture or bother cruelly.","zh":"使（某人）痛苦不堪；折磨；（残忍地）烦扰。"},"examples":[{"en":"His guilt continued to torment him.","zh":"他的内疚持续折磨着他。"},{"en":"Don’t torment the cat by pulling its tail.","zh":"别拽猫尾巴折磨它。"}]}],"synonyms":["torture","agony","misery","anguish","harass","afflict"],"phonetic":"/ˈtɔrˌmɛnt/","extraExplanation":["“torment”作名词和动词时重音不同：名词常读 /ˈtɔrˌmɛnt/（重音在前），动词常读 /tɔrˈmɛnt/（重音在后）。虽然拼写一样，但读法常变化。","在文学里，“torment”常用来描写内心的煎熬（guilt/jealousy/fear 等），比一般的 “pain” 更强调长期、强烈、难以摆脱的痛苦。"]}
{"word":"cotoro","summary":{"en":"“Cotoro” isn’t standard English; it’s likely Spanish-related (often linked to “cotorro,” ‘parrot’/‘talkative person’) or a proper name.","zh":"“Cotoro”不是标准英语；多半与西语有关（常见联想到“cotorro”：鹦鹉/话多的人），或是一个专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. Most likely a misspelling or variant of the Spanish word “cotorro/cotorra,” meaning a parrot (and sometimes, informally, a very talkative person).","zh":"不是标准英语单词。更可能是西班牙语“cotorro/cotorra”的拼写变体或误拼，意思是“鹦鹉”（口语中也可指“很爱说话的人”）。"},"examples":[{"en":"I think you mean Spanish “cotorro,” which means “parrot.”","zh":"我觉得你想写的是西班牙语“cotorro”，意思是“鹦鹉”。"},{"en":"In some places, “cotorro” can also describe someone who talks a lot.","zh":"在一些地区，“cotorro”也可以形容一个人很爱说话。"}]},{"partOfSpeech":"other","definition":{"en":"(Proper noun) “Cotoro” may also be a place name or brand name in Spanish-speaking contexts; meaning depends on where you saw it.","zh":"（专有名词）“Cotoro”也可能是西语语境里的地名或品牌名；具体含义取决于你在哪里看到它。"},"examples":[{"en":"Could you share the sentence or a screenshot where you saw “Cotoro”?","zh":"你可以分享一下包含“Cotoro”的句子或截图吗？"}]}],"synonyms":["parrot (for Spanish “cotorro”)","chatterbox (informal meaning)"],"phonetic":"/koʊˈtoʊroʊ/","extraExplanation":["“cotorro/cotorra”是常见的西班牙语词：指一种鹦鹉；在口语里也常被引申为“话多的人”。如果你在英文文本里看到“cotoro”，通常是借用西语、专名（地名/店名/用户名）或拼写误差。","如果你告诉我它出现的国家/语境（比如社交媒体、歌词、地名、聊天内容），我可以更准确判断它到底指什么。"]}
{"word":"cotoros","summary":{"en":"“Cotoros” usually means “parrots” (Spanish plural), used mainly in Spanish-speaking or Latin American contexts.","zh":"“cotoros”通常指“鹦鹉”（西班牙语复数），多见于西语/拉美语境的英文中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"parrots; in Spanish, “cotoros” is the plural of “cotorro/cotorra,” meaning a parrot (often a small, talkative parrot). In English it may appear in Spanish-speaking contexts as a loanword.","zh":"鹦鹉；在西班牙语中，cotoros 是 cotorro/cotorra 的复数，意思是“鹦鹉”（常指较小、很爱叫/很爱学舌的那种）。在英语里通常只会在西语语境中作为外来词出现。"},"examples":[{"en":"We saw green cotoros in the trees near the plaza.","zh":"我们在广场附近的树上看到了绿色的 cotoros（鹦鹉）。"},{"en":"In some Caribbean Spanish, people might call a very chatty person a “cotorro.”","zh":"在一些加勒比地区的西班牙语里，人们可能会用 “cotorro” 来形容特别爱说话的人。"}]}],"synonyms":["parrots","parakeets"],"phonetic":"/koʊˈtɔːroʊz/","extraExplanation":["“cotoros”不是常见英语词，更多是西班牙语复数形式出现在英文文本里（比如旅行记录、移民社区、拉美文化相关内容）。如果你是在英语文章里看到它，通常就是指当地的鹦鹉。","不同地区用法会有差异：在某些地方 cotorro/cotorra 也可带一点俚语色彩，指“话多、爱唠叨的人”（类似英语的 chatterbox）。"]}
{"word":"cotorture","summary":{"en":"“cotorture” is a rare, nonstandard form meaning to torture someone jointly with others (or the act of doing so).","zh":"“cotorture”是罕见的非标准写法，意思是与他人一起折磨/施加酷刑（或指这种共同施虐行为）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Nonstandard/rare) to torture someone together with another person; to participate jointly in torture.","zh":"（非标准/罕见用法）与他人一起折磨/拷打某人；共同参与施加酷刑。"},"examples":[{"en":"The report claims the guards cotortured prisoners during interrogations.","zh":"报告称狱警在审讯中共同对囚犯施加酷刑。"},{"en":"He was accused of helping to cotorture detainees.","zh":"他被指控协助他人共同折磨被拘留者。"}]},{"partOfSpeech":"n.","definition":{"en":"(Nonstandard/rare) the act of torturing someone together with others; joint torture.","zh":"（非标准/罕见用法）共同施加酷刑的行为；联合作恶式的折磨。"},"examples":[{"en":"The case involved allegations of cotorture by multiple officers.","zh":"该案件涉及多名警员共同施加酷刑的指控。"}]}],"synonyms":["torture together","joint torture","collaborate in torture","participate in torture"],"phonetic":"/koʊˈtɔrtʃər/","extraExplanation":["“cotorture”不是常见英语词，通常不会出现在正规词典里。更自然的表达一般是：\n- “torture (someone) together” （一起折磨/拷打）\n- “joint torture” / “torture carried out by multiple people” （多人实施的酷刑）\n- 如果你想表达“共同施虐者”，常用 “co-torturer” 或 “accomplice in torture”。\n\n这个词涉及暴力与人权议题，正式写作中建议使用更标准、明确的表述以避免歧义。"]}
{"word":"Cotoxo","summary":{"en":"“Cotoxo” is not a standard English word; it’s likely a proper name or made-up term whose meaning depends on where you saw it.","zh":"“Cotoxo”不是常见英语词汇；更可能是专有名词或自造词，具体含义取决于出现的语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name or coined term (e.g., a username, brand, place name, or product name). It is not a standard English vocabulary word, so its meaning depends on context.","zh":"专有名词或自造词（例如用户名、品牌名、地名或产品名）。它不是常见的英语词汇，因此含义取决于具体语境。"},"examples":[{"en":"I saw “Cotoxo” on a website, but I’m not sure what it refers to.","zh":"我在一个网站上看到“Cotoxo”，但不确定它指的是什么。"},{"en":"Cotoxo might be a brand name rather than an English word.","zh":"Cotoxo 可能是品牌名，而不是英语单词。"}]}],"synonyms":["proper name","brand name","username"],"phonetic":"/koʊˈtoʊksoʊ/","extraExplanation":["“Cotoxo”在主流英语词典中并不是常见词条。它更像是：1）人名/昵称（username/gamertag），2）品牌或产品名，3）地名，或4）某个词的拼写误差。","如果你能提供一句包含它的原句、来源（网站/游戏/社交媒体/国家地区）、或你想表达的意思，我可以帮你判断它可能来自哪种语言、是否是某个词的变体，以及更自然的英文表达方式。"]}
{"word":"cotoxo","summary":{"en":"“cotoxo” is not a recognized English word in standard dictionaries; it likely needs context or a corrected spelling.","zh":"“cotoxo”不是词典中常见的英语词；可能需要语境或更正拼写才能确定含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling, a name/brand, or a word from another language.","zh":"不是标准英语单词；可能是拼写错误、专有名词（人名/品牌/地名），或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “cotoxo” in major English dictionaries—could it be a typo?","zh":"我在主要英语词典里找不到“cotoxo”——会不会是拼写错误？"},{"en":"Can you share the full sentence where you saw “cotoxo”?","zh":"你能把你看到“cotoxo”的完整句子发我吗？"}]}],"extraExplanation":["“cotoxo”在英语里没有常见、固定的词义记录。为了更准确帮你：\n1）请告诉我它出现的语境（整句/截图/哪本书或哪个网站）。\n2）它是否可能是拼错：比如想写“cortex”（大脑皮层/皮质）、“cotton”（棉花）、“Cato”等？\n3）如果是人名、账号名、品牌名或外语词（如西班牙语/葡萄牙语/土著语言），也请告诉我来源地区或领域（音乐、游戏、医学、地名等）。"]}
{"word":"cotquean","summary":{"en":"Cotquean is an old, insulting word for a man who does or meddles in household work seen as women’s work.","zh":"Cotquean 是一个过时且带侮辱的词，指做或爱管传统上被视为女性家务的人（尤其是男人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Old-fashioned, often insulting) a man who does work or takes an interest in tasks traditionally associated with women, especially household or child-care matters.","zh":"（过时且常带侮辱）指做或爱管传统上被认为是“女人的事”的男人，尤指家务、照看孩子等。"},"examples":[{"en":"In the old play, he is mocked as a cotquean for staying home to mind the children.","zh":"在那出老戏里，他因为留在家照看孩子而被嘲笑成 cotquean。"},{"en":"The word cotquean was used to shame men who enjoyed cooking and managing the household.","zh":"cotquean 这个词曾被用来羞辱那些喜欢做饭、打理家务的男人。"}]}],"synonyms":["henpecked man (not exact)","househusband (neutral, modern)","busybody (general)"],"phonetic":"/kɑtˈkwiːn/","extraExplanation":["这是一个非常过时的贬义词，反映了早期英语社会对性别角色的刻板期待；现代英语里一般不建议使用。","词源常被解释为 cot（小屋/家）+ quean（古义为“女人”，后来也可作贬称），合起来带有“像女人一样管家”的嘲讽意味。","在文学与戏剧中偶尔可见（尤见于早期近代英语作品），通常用于刻画或讥讽不符合传统男性角色的人物。"]}
{"word":"cotqueans","summary":{"en":"A dated, often insulting word for a man seen as doing women’s work or being “womanish.”","zh":"一个过时且常带侮辱的词，指被认为在做“女人的活”或“女性化”的男人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(dated, often insulting) A man who does work traditionally associated with women (especially housework), or who meddles in women’s affairs; an effeminate or “womanish” man.","zh":"（过时，常带侮辱）指做传统上被认为是“女人做的事”（尤指家务）的男人，或爱插手女性事务的男人；也可指被贬称为“娘娘腔/女性化”的男人。"},"examples":[{"en":"In the old pamphlet, he’s mocked as a cotquean for cooking and minding the children.","zh":"在那本旧小册子里，他因做饭、照看孩子而被嘲讽为 cotquean。"},{"en":"The play uses the word “cotquean” to show how harshly men were judged for breaking gender roles.","zh":"那部戏用“cotquean”来展现：男性一旦打破性别分工，会受到多么苛刻的评判。"}]}],"synonyms":["(dated) househusband","(informal, often insulting) sissy","effeminate man","meddler"],"phonetic":"/kɑtˈkwiːn/","extraExplanation":["这是一个历史色彩很强的贬义词，多见于16–17世纪英语。现代英语中几乎不用；如果需要表达“男性做家务/育儿”，更中性的说法是 stay-at-home dad, househusband, or a man who does the cooking/childcare。","词源上常被解释为 cot（小屋/家）+ quean（古义为“女人”，后来也带贬义），整体反映了当时对性别分工的刻板观念。"]}
{"word":"cotraitor","summary":{"en":"Cotraitor (more commonly written co-traitor) means a fellow traitor—someone who betrays together with another person.","zh":"cotraitor（更常写作 co-traitor）指“同伙叛徒”，即与他人一起背叛的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who betrays a group, country, or cause together with someone else; a fellow traitor","zh":"与他人一起背叛团体、国家或事业的人；同伙叛徒"},"examples":[{"en":"The court described them as co-traitors who had planned the leak together.","zh":"法庭称他们为同伙叛徒，曾一起策划泄密。"},{"en":"In the novel, he realizes his closest friend is his co-traitor.","zh":"在小说中，他意识到自己最亲密的朋友竟是同伙叛徒。"}]}],"synonyms":["co-traitor","fellow traitor","accomplice (in betrayal)","collaborator (in a betrayal)"],"phonetic":"/ˌkoʊˈtreɪtɚ/","extraExplanation":["“cotraitor”更常见的写法是“co-traitor”（带连字符），意思是“共同背叛者/同伙叛徒”。在新闻、历史叙述或法律语境里更可能出现。","前缀“co-”表示“共同、一起”（如 co-worker 同事，co-author 合著者）。因此 co-traitor 直译为“共同的叛徒/与人合谋背叛的人”。"]}
{"word":"cotransduction","summary":{"en":"Cotransduction is when a bacteriophage transfers two (or more) linked bacterial genes together in one transduction event.","zh":"共转导指噬菌体在一次转导中把两个（或更多）彼此连锁的细菌基因一起转移。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In bacterial genetics) the transfer of two or more nearby (linked) genes together from one bacterium to another by a bacteriophage, because those genes are packaged into the same phage particle.","zh":"（细菌遗传学）由噬菌体介导、把两个或多个彼此相邻（连锁）的基因一起从一个细菌转移到另一个细菌的过程；原因是这些基因被装入同一个噬菌体颗粒中。"},"examples":[{"en":"The two genes are close on the chromosome, so their cotransduction frequency is high.","zh":"这两个基因在染色体上距离很近，所以它们的共转导频率很高。"},{"en":"Researchers used cotransduction to map the order of mutations in E. coli.","zh":"研究人员利用共转导来绘制大肠杆菌突变的排列顺序。"}]}],"synonyms":["linked transduction"],"phonetic":"/ˌkoʊtrænzˈdʌkʃən/","extraExplanation":["“cotransduction”常用于“基因定位/作图（mapping）”：如果两个标记（genes/alleles）越近，就越可能在同一次转导中一起被带走，因此“共转导频率（cotransduction frequency）”可以用来估计它们的相对距离。","词源上，co- 表示“共同/一起”，transduction 指“（噬菌体介导的）转导”。常见相关术语：generalized transduction（普遍性转导）、specialized transduction（专一性转导）、linkage（连锁）。"]}
{"word":"cotransfuse","summary":{"en":"Cotransfuse means to transfuse blood (or blood components) in a coordinated way at the same time as another transfusion or treatment.","zh":"cotransfuse 指在医疗操作中与另一项输血或治疗同时、协调地进行输血/输注。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to transfuse blood or blood components into a patient at the same time as another transfusion or another substance (often in a coordinated clinical procedure)","zh":"（医学）与另一项输血或其他治疗同时进行地输注血液或血液成分（常指在协调的临床操作中）"},"examples":[{"en":"The patient was cotransfused with packed red blood cells and plasma during surgery.","zh":"手术期间，患者同时输注了浓缩红细胞和血浆。"},{"en":"In emergency care, doctors may cotransfuse platelets while controlling bleeding.","zh":"在急救中，医生可能在控制出血的同时联合输注血小板。"}]}],"synonyms":["co-transfuse","transfuse concurrently","administer (blood products) simultaneously"],"phonetic":"/ˌkoʊtrænsˈfjuz/","extraExplanation":["这是一个医学专业用词，常见于临床记录、研究论文或输血方案描述中；在日常英语里很少使用。","构词：co-（共同、同时）+ transfuse（输血/输注）。通常强调“同时/联合进行”的操作或方案。","使用场景常与“massive transfusion protocol（大量输血方案）”“component therapy（成分输血）”等概念相关。"]}
{"word":"cotranslator","summary":{"en":"A cotranslator is someone who translates a work together with another translator.","zh":"cotranslator 指与他人共同完成翻译工作的译者（共同译者）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who translates a text together with another translator; a co-worker in translation.","zh":"与另一位译者一起翻译文本的人；翻译合作伙伴。"},"examples":[{"en":"I worked with a cotranslator to translate the novel into English.","zh":"我和一位共同译者合作，把这本小说译成英文。"},{"en":"The cotranslator checked my draft for style and tone.","zh":"共同译者检查了我的译稿的文体和语气。"}]},{"partOfSpeech":"n.","definition":{"en":"A tool or system that translates content alongside another translator or translation process (less common).","zh":"与另一位译者或翻译流程并行协作的翻译工具或系统（较少见）。"},"examples":[{"en":"The app can act as a cotranslator by suggesting alternative phrasing.","zh":"这个应用可以充当“共同译者”，提供不同的措辞建议。"}]}],"synonyms":["co-translator","translation partner","co-translator (collaborator)","collaborating translator"],"phonetic":"/koʊˈtrænzleɪtər/","extraExplanation":["“co-”表示“共同、一起”（如 coauthor 合著者，coworker 同事）。因此 cotranslator 字面意思就是“共同翻译的人”。","在出版或影视字幕等项目中，cotranslator 常指两位译者分工合作（例如按章节/场景分配），再互相校对以统一术语、风格和语气。"]}
{"word":"cotranspire","summary":{"en":"Cotranspire means “to occur together at the same time,” and it can also mean “to transpire together” in a plant-science context.","zh":"cotranspire 指“共同发生、同时发生”；在植物学语境中也可指“共同蒸腾”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(of events or actions) to happen at the same time; to occur together.","zh":"（事件或行为）同时发生；共同发生。"},"examples":[{"en":"Several changes cotranspired during the transition period.","zh":"在过渡时期，几个变化同时发生。"},{"en":"A power outage and a heavy storm cotranspired, causing delays.","zh":"停电和暴风雨同时发生，导致了延误。"}]},{"partOfSpeech":"vi.","definition":{"en":"(botany) to transpire together, especially when different plants or plant parts release water vapor at the same time.","zh":"（植物）共同蒸腾；尤指不同植物或部位在同一时间释放水蒸气。"},"examples":[{"en":"In the greenhouse, the crops cotranspired more on hot afternoons.","zh":"在温室里，作物在炎热的下午蒸腾得更同步、更明显。"},{"en":"Leaves and stems may cotranspire under strong light.","zh":"在强光下，叶片和茎可能会一起蒸腾。"}]}],"synonyms":["co-occur","coincide","happen together","concur"],"phonetic":"/ˌkoʊtrænˈspaɪr/","extraExplanation":["这个词比较少见，多用于较正式或学术语境。结构上是前缀 co-（“共同、一起”）+ transpire（“发生；（植物）蒸腾”）。日常英语里更常用 co-occur / coincide 来表达“同时发生”。"]}
{"word":"cotransubstantiate","summary":{"en":"A rare theological verb meaning “to become of the same substance with another,” often used in Eucharistic discussions.","zh":"一个罕见的神学动词，意为“与另一者成为同一实体/同一本质”，常用于圣餐教义讨论。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Theology) To become of the same substance as something else; to share one substance with another, especially in discussions of Christ’s presence in the Eucharist.","zh":"（神学）与另一个事物成为“同一实体/同一本质”；与其共享同一“实体”，常见于关于圣餐中基督临在方式的讨论。"},"examples":[{"en":"Some theologians used the verb “cotransubstantiate” to describe a view in which Christ’s body is present alongside the bread.","zh":"一些神学家用动词“cotransubstantiate”来描述一种观点：基督的身体与饼同时临在。"},{"en":"The author argues that the elements do not cotransubstantiate, but remain bread and wine in substance.","zh":"作者主张这些圣礼元素并不会“cotransubstantiate”，在实体上仍是饼和酒。"}]}],"synonyms":["share the same substance (with)","be consubstantial (with)","consubstantiate (rare/related)"],"phonetic":"/ˌkoʊˌtrænzəbˈstænʃiˌeɪt/","extraExplanation":["这个词非常罕见，多出现在神学/宗教历史写作中。结构上是 co-（共同）+ transubstantiate（“化质”，指实体改变）。它常被拿来与“transubstantiation（化质说，天主教传统术语）”和“consubstantiation（共质说，常与路德宗相关的说法，但用法也有争议）”做对比；具体含义会因作者立场不同而略有差异。阅读时建议结合上下文与该作者所处的教派/传统来理解。"]}
{"word":"cotrespasser","summary":{"en":"A cotrespasser is someone who trespasses together with another person.","zh":"cotrespasser 指与他人一起实施擅自侵入等侵权行为的共同侵入者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who commits a trespass together with another person; a joint wrongdoer in a trespass (often written “co-trespasser”).","zh":"与他人一起实施侵入他人土地/权益等侵权行为的人；共同侵入者（常写作 co-trespasser）。"},"examples":[{"en":"Both protesters who climbed the fence were treated as cotrespassers.","zh":"两名翻越围栏的抗议者都被视为共同侵入者。"},{"en":"The court found the driver and the passenger to be cotrespassers because they entered the private field together.","zh":"法院认定司机和乘客因共同进入私人田地而构成共同侵入者。"}]}],"synonyms":["co-trespasser","joint trespasser","joint tortfeasor"],"phonetic":"/ˌkoʊˈtrɛsˌpæsər/","extraExplanation":["这是一个偏法律用语，多见于英美侵权法（tort law）语境，强调“共同参与同一侵权行为的人”。常见拼写是 co-trespasser（带连字符或分开写）。","在法律讨论中，它常与“joint tortfeasor（共同侵权人）”接近，但 cotrespasser更聚焦在“trespass（侵入/擅入）”这一类侵权。"]}
{"word":"cotrine","summary":{"en":"“cotrine” is likely a misspelling; the intended word is usually “citrine,” a yellow gemstone (quartz).","zh":"“cotrine”很可能是拼写错误；通常想表达的是“citrine（黄水晶）”，一种黄色的石英宝石。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Cotrine is not a standard English word in common dictionaries; it may be a misspelling of “citrine.”","zh":"“cotrine”不是常见的标准英语词；它很可能是“citrine（黄水晶）”的拼写错误。"},"examples":[{"en":"I couldn’t find “cotrine” in the dictionary—did you mean “citrine”?","zh":"我在词典里找不到“cotrine”——你是不是想写“citrine”？"},{"en":"If you mean “citrine,” it’s a yellow variety of quartz.","zh":"如果你指的是“citrine”，它是一种黄色的石英。"}]},{"partOfSpeech":"n.","definition":{"en":"citrine: a yellow to orange variety of the gemstone quartz.","zh":"citrine：黄到橙色的石英宝石品种，常译为“黄水晶”。"},"examples":[{"en":"She wore a citrine ring that glowed warmly in the light.","zh":"她戴着一枚黄水晶戒指，在光线下泛着温暖的光泽。"},{"en":"Citrine is often used in jewelry because it’s bright and durable.","zh":"黄水晶常用于珠宝，因为它颜色明亮且耐用。"}]}],"synonyms":["yellow quartz","gemstone quartz"],"phonetic":"/ˈsɪtriːn/","extraExplanation":["“citrine”读音以 /s/ 开头（像 city 的开头音），而不是 /k/。词源来自法语 citrin，和 citron（香橼/柠檬类水果）有关，因其黄色而得名。"]}
{"word":"cotripper","summary":{"en":"“Cotripper” is an informal/nonstandard form of “co-tripper,” meaning a person who travels on the same trip with you.","zh":"“cotripper”多为“co-tripper”的非标准写法，意思是与你同一趟出行的旅伴。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A nonstandard or informal spelling of “co-tripper,” meaning someone who goes on a trip with you; a travel companion on the same trip.","zh":"“co-tripper”的非标准/口语拼写，指与你一起出行的人；同游者、旅伴。"},"examples":[{"en":"I’m looking for a co-tripper to share hotel costs.","zh":"我想找个同游者一起分担酒店费用。"},{"en":"My co-tripper handled the maps while I drove.","zh":"我的旅伴负责看地图，我来开车。"}]}],"synonyms":["travel companion","trip buddy","travel buddy","fellow traveler"],"phonetic":"/ˌkoʊˈtrɪpər/","extraExplanation":["“cotripper”并不是常见的标准拼写；更常见的写法是“co-tripper”（带连字符）或更自然的表达如“travel companion / trip buddy”。","在英语里，前缀“co-”表示“共同、一起”（如 co-worker 同事、co-author 合著者）。因此 co-tripper 直观含义就是“同一趟旅行的人”。"]}
{"word":"cotrustee","summary":{"en":"A co-trustee is a trustee who shares responsibility for managing a trust with someone else.","zh":"cotrustee（常写作 co-trustee）指与他人共同承担管理信托责任的受托人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who shares the legal responsibility of managing a trust together with one or more other trustees.","zh":"（与他人）共同管理信托并承担法律责任的受托人；共同受托人。"},"examples":[{"en":"After their mother died, the two sisters became co-trustees of the family trust.","zh":"母亲去世后，两姐妹成为家族信托的共同受托人。"},{"en":"The bank served as co-trustee to help manage investments and paperwork.","zh":"银行担任共同受托人，协助管理投资和相关文件。"},{"en":"As a co-trustee, he must act in the beneficiaries’ best interests.","zh":"作为共同受托人，他必须以受益人的最大利益为原则行事。"}]}],"synonyms":["co-trustee","joint trustee","trustee (in shared role)"],"phonetic":"/ˌkoʊ.trʌˈstiː/","extraExplanation":["“co-”表示“共同、一起”。cotrustee 常写作 co-trustee（更常见的拼写）。","在信托（trust）中，trustee（受托人）负责依照信托文件管理财产并履行“受托义务”（例如谨慎管理、避免利益冲突、如实记录与披露等）。共同受托人通常需要协作决定事项；具体是否必须一致同意，取决于信托文件和当地法律。","不要与 beneficiary（受益人）混淆：受益人是享有信托利益的人；共同受托人是负责管理的人。"]}
{"word":"COTS","summary":{"en":"COTS means “commercial off-the-shelf”: ready-made products or solutions purchased as-is rather than custom-built.","zh":"COTS 指“商用现成品”：按原样购买即可使用的成品/方案，而非定制开发。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"commercial off-the-shelf; describing a ready-made product that is bought as-is (not custom-built), often in business, government, or engineering contexts","zh":"商用现成品（直接购买即可使用的成品）；形容不做定制开发、按原样采购使用的产品，常见于企业/政府/工程领域"},"examples":[{"en":"We chose a COTS solution instead of building software from scratch.","zh":"我们选择了COTS现成方案，而不是从零开发软件。"},{"en":"The team integrated COTS components to reduce cost and development time.","zh":"团队集成了COTS现成组件，以降低成本并缩短开发时间。"}]},{"partOfSpeech":"n.","definition":{"en":"a COTS product (or set of products); a ready-made item purchased from the market rather than custom-made","zh":"COTS产品（或一类产品）；指从市场上直接购买、非定制的成品"},"examples":[{"en":"Most of the system is built from COTS, with only a few custom modules.","zh":"系统大部分由COTS成品构成，只少量模块是定制的。"},{"en":"Using COTS can speed up deployment, but you may sacrifice flexibility.","zh":"使用COTS能加快上线，但可能会牺牲灵活性。"}]}],"synonyms":["off-the-shelf","ready-made","commercially available","prebuilt"],"phonetic":"/kɑts/","extraExplanation":["COTS 是缩写，完整写法是 Commercial Off-The-Shelf。常用于“采购/招标/系统集成/军工与政府项目”等语境，强调“现成可买、风险与周期更可控”。","与 COTS 相对的常见说法有：custom-built / bespoke（定制开发）、in-house（内部自研）。在写作中常见搭配：COTS software, COTS hardware, COTS components, COTS solution。","读法上既有人按字母读“C-O-T-S”，也有人直接读成一个词，类似“cots”。"]}
{"word":"cots","summary":{"en":"“Cots” is the plural of “cot”: a simple portable bed, or (especially in British English) a baby’s bed.","zh":"“cots”是“cot”的复数：指简易便携床（行军床/折叠床），或（尤指英式英语）婴儿床。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, simple bed, especially a portable bed for camping or temporary sleeping (often a folding cot).","zh":"（尤指便携式的）简易床；行军床；折叠床（常用于露营或临时睡眠）。"},"examples":[{"en":"We set up two cots in the cabin for extra guests.","zh":"我们在小木屋里放了两张行军床，给额外的客人睡。"},{"en":"The shelter provided blankets and cots for everyone.","zh":"收容所为每个人提供了毯子和简易床。"}]},{"partOfSpeech":"n.","definition":{"en":"A baby’s bed with high sides (also called a crib in American English).","zh":"婴儿床（美式英语更常说 crib）。"},"examples":[{"en":"The baby was sleeping quietly in her cot.","zh":"宝宝在她的婴儿床里安静地睡着。"},{"en":"They bought a new cot before the baby arrived.","zh":"宝宝出生前他们买了新的婴儿床。"}]}],"synonyms":["folding bed","camp bed","crib (baby bed)","portable bed"],"phonetic":"/kɑts/","extraExplanation":["“cot”在英式英语里常指“婴儿床”，而在美式英语里“cot”更常指“行军床/折叠床”，婴儿床通常说“crib”。因此读到英剧或英式写作时要特别注意语境。"]}
{"word":"Cotsen","summary":{"en":"Cotsen is mainly a surname and is often seen in the names of U.S. academic institutes and library collections.","zh":"Cotsen 主要是一个姓氏，常见于美国高校研究机构或图书馆馆藏的名称中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), best known in the U.S. from institutions and collections named after Lloyd E. Cotsen (e.g., the Cotsen Institute of Archaeology at UCLA, and the Cotsen Children’s Library at Princeton University).","zh":"一个姓氏（家族名）。在美国较为知名，多见于以 Lloyd E. Cotsen 命名的机构与收藏（如 UCLA 的 Cotsen Institute of Archaeology、普林斯顿大学的 Cotsen Children’s Library）。"},"examples":[{"en":"She did research through the Cotsen Institute of Archaeology at UCLA.","zh":"她通过加州大学洛杉矶分校的 Cotsen 考古研究所进行研究。"},{"en":"The rare picture books are housed in the Cotsen Children’s Library.","zh":"这些珍稀绘本收藏在 Cotsen 儿童图书馆。"}]}],"phonetic":"/ˈkɑtsən/","extraExplanation":["“Cotsen”通常不是普通英文词汇，而是专有名词（姓氏/机构名）。在阅读学术或图书馆相关材料时，常以大写形式出现，并与特定大学或馆藏关联。","发音上一般重音在第一音节：COT-sen。不同地区或家庭可能有细微差异，但常见读法接近 /ˈkɑtsən/。"]}
{"word":"cotset","summary":{"en":"Cotset is a rare spelling of cosset, meaning to pamper/overprotect, or someone/animal that is pampered.","zh":"cotset 是 cosset 的罕见拼写，指“溺爱/娇惯”，也可指被娇惯的人或动物。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare spelling) to pamper or overprotect someone; to treat them with too much care and attention.","zh":"（罕见拼写）溺爱；娇惯；过度保护某人。"},"examples":[{"en":"She tends to cotset her youngest child, doing everything for him.","zh":"她往往会溺爱最小的孩子，什么事都替他做。"},{"en":"If you cotset employees too much, they may not learn to handle challenges independently.","zh":"如果你过度照顾员工，他们可能学不会独立应对挑战。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare spelling) a person or animal that is pampered; especially (historically) a hand‑reared lamb kept as a pet.","zh":"（罕见拼写）被娇惯的人或动物；尤指（历史用法）人工喂养、当宠物养的小羊。"},"examples":[{"en":"The farmer’s children kept a lamb as a cotset.","zh":"农夫的孩子们把一只小羊当作宠物养着。"},{"en":"He was the family’s cotset and never had to do chores.","zh":"他是家里的掌上明珠，从不用做家务。"}]}],"synonyms":["pamper","spoil","coddle","indulge"],"phonetic":"/ˈkɑsɪt/","extraExplanation":["“cotset”在现代英语中非常少见，多数情况下是“cosset”的变体拼写或误拼。写作与考试更建议使用更常见的拼法“cosset”。","“cosset/cotset”常带有轻微负面含义：不是单纯“照顾”，而是“过度照顾到让对方缺乏独立性”。"]}
{"word":"cotsetla","summary":{"en":"“Cotsetla” isn’t a recognized standard English word; it’s likely a name, a non-English term, or a misspelling.","zh":"“cotsetla”不是常见标准英语词；更可能是名字、外来语，或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Unknown or not found in standard English dictionaries. It may be a misspelling, a proper noun (e.g., a place or name), or a word from another language.","zh":"在常见英文词典中未找到该词。可能是拼写错误、专有名词（如地名/人名），或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “cotsetla” in a dictionary—could it be a name or a typo?","zh":"我在词典里找不到“cotsetla”——它会不会是名字或拼写错误？"},{"en":"If you share the sentence where you saw it, I can help identify the intended word.","zh":"如果你把它出现的句子发我，我可以帮你判断原本想表达的词。"}]}],"phonetic":"/ˌkɑtˈsɛtlə/","extraExplanation":["目前“cotsetla”不像是常见英语单词。为了更准确地帮你：\n1）请提供它出现的完整句子/段落；\n2）它是人名、地名、品牌名，还是你听到的发音？\n3）你是否想查类似拼写：\"Cotswold\"（英国地名/地区）、\"cotton\"、\"coastal\"、或西语/葡语来源的词？"]}
{"word":"cotsetland","summary":{"en":"Likely a misspelling of “the Cotswolds,” a countryside region in England.","zh":"很可能是 “the Cotswolds（科茨沃尔德）” 的误拼，指英格兰的乡村地区。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Cotsetland is not a standard English word; it is most likely a misspelling of “the Cotswolds” or “Cotswold,” a rural area in south-central England known for charming villages and honey-colored stone houses.","zh":"Cotsetland 不是标准英语词；它很可能是 “the Cotswolds / Cotswold” 的拼写错误，指英格兰中南部的一片乡村地区，以古朴村庄和蜂蜜色石屋闻名。"},"examples":[{"en":"We’re planning a weekend trip to the Cotswolds (sometimes misspelled as “cotsetland”).","zh":"我们计划去科茨沃尔德（有时会被误拼为“cotsetland”）周末旅行。"},{"en":"Many visitors come to the Cotswolds for quiet countryside walks.","zh":"很多游客来科茨沃尔德享受安静的乡村徒步。"}]}],"synonyms":["the Cotswolds","Cotswold"],"phonetic":"/ˈkɑtsˌwoʊld/","extraExplanation":["更常见的写法是 **the Cotswolds**（复数形式，指整个地区）或 **Cotswold**（作定语，如 Cotswold stone / Cotswold village）。","读音通常按 “COTS-wold” 来分：前半像 *cots*（小床/睡垫的复数），后半 *wold* 表示“丘陵高地/荒原”，多见于英国地名。"]}
{"word":"cotsetle","summary":{"en":"“cotsetle” is not a recognized English word; it’s probably a misspelling—please confirm the intended word or share a sentence.","zh":"“cotsetle”不是标准英语词；可能是拼写错误——请确认目标词或提供例句。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or typing error; please confirm the intended word (for example: “coastline,” “cocktail,” “costly,” or “cotswold”).","zh":"不是标准英语单词。很可能是拼写/输入错误；请确认你想查的词（例如：coastline“海岸线”、cocktail“鸡尾酒”、costly“昂贵的”、Cotswold“科茨沃尔德地区”）。"},"examples":[{"en":"I couldn’t find “cotsetle” in a dictionary—did you mean “cocktail”?","zh":"词典里找不到“cotsetle”——你是不是想写“cocktail（鸡尾酒）”？ "},{"en":"Could you use “cotsetle” in a full sentence so I can guess the right word?","zh":"你能把“cotsetle”放进一个完整句子里吗？这样我更容易判断你想表达的词。"}]}],"extraExplanation":["“cotsetle”在常见英语词典与语料中都不属于标准拼写。最有效的方式是：1）你提供上下文句子；2）说明你想表达的中文意思；3）如果是人名/地名/品牌名，也请告诉我来源（书/游戏/产品/地理位置等），我就能更准确地给出正确拼写与释义。"]}
{"word":"Cotswold","summary":{"en":"Cotswold refers to a picturesque rural region in England (often “the Cotswolds”) and can also describe the area’s characteristic style.","zh":"Cotswold 指英格兰一处风景如画的乡村地区（常说 the Cotswolds），也可作形容词表示该地区典型的风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hilly rural area in south-central England, famous for honey-colored limestone villages and scenic countryside (often called “the Cotswolds”).","zh":"英格兰中南部的丘陵乡村地区，以蜂蜜色石灰岩村庄和田园风光闻名（常称“科茨沃尔德地区 / the Cotswolds”）。"},"examples":[{"en":"We spent a weekend in the Cotswolds visiting small villages and walking through fields.","zh":"我们在科茨沃尔德地区待了一个周末，逛小村庄、穿过田野徒步。"},{"en":"Many tourists go to the Cotswolds for its quiet countryside and stone cottages.","zh":"很多游客去科茨沃尔德地区，是为了享受宁静的乡村和石头小屋。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to this area, especially its style of stone houses, villages, or countryside scenery.","zh":"与科茨沃尔德地区有关的；尤指其石头房屋、村庄风格或乡村景观。"},"examples":[{"en":"They stayed in a Cotswold cottage with a garden.","zh":"他们住在一间科茨沃尔德风格的小屋里，带花园。"},{"en":"The hotel is designed in a Cotswold style, using local limestone.","zh":"这家酒店采用科茨沃尔德风格设计，使用当地石灰岩。"}]}],"synonyms":["the Cotswolds","Cotswold Hills"],"phonetic":"/ˈkɑːtsˌwoʊld/","extraExplanation":["“Cotswold”常见两种写法：单数作整体概念（the Cotswold area），更常见的是复数专名“the Cotswolds”，指整片地区。","词源大致与古英语有关：cot（小屋）+ wold（丘陵高地/荒原），所以可理解为“有小屋的高地/丘陵地带”。","在旅行与文化语境中，它常象征“典型英式田园风光”，因此也会引申出“Cotswold stone / Cotswold cottage”等搭配。"]}
{"word":"cotswold","summary":{"en":"Cotswold/Cotswolds refers to a scenic region in England and, by extension, the countryside style associated with it.","zh":"Cotswold/Cotswolds 指英格兰一处风景优美的地区，也可引申指与该地相关的英式乡村风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a region in south-central England (especially in Gloucestershire and nearby counties), famous for rolling hills and villages built with honey-colored limestone; often used as a travel/cultural reference","zh":"英格兰中南部的科茨沃尔德地区（主要在格洛斯特郡及周边郡），以起伏丘陵与蜂蜜色石灰岩村庄闻名；常作为旅游与文化语境中的地名"},"examples":[{"en":"We spent a weekend in the Cotswolds visiting small villages and walking the hills.","zh":"我们在科茨沃尔德过了一个周末，逛小村庄、走山路。"},{"en":"Many postcards show the honey-colored stone cottages typical of the Cotswolds.","zh":"很多明信片都会展示科茨沃尔德典型的蜂蜜色石头小屋。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Cotswolds region, especially its style of architecture and countryside scenery","zh":"与科茨沃尔德地区相关的；尤指当地的建筑风格与乡村景观"},"examples":[{"en":"They rented a Cotswold cottage with a stone roof and a small garden.","zh":"他们租了一间科茨沃尔德风格的小屋，有石板屋顶和小花园。"},{"en":"The hotel’s rooms have a quiet, Cotswold feel.","zh":"这家酒店的房间有一种安静的科茨沃尔德氛围。"}]}],"synonyms":["the Cotswolds","Cotswold Hills"],"phonetic":"/ˈkɑtsˌwoʊld/","extraExplanation":["“Cotswolds”通常以复数形式出现，指这片丘陵地区；“Cotswold”可作形容词（如 Cotswold stone, Cotswold village）。","它在英国文化中常带有“田园、古朴、英式乡村生活”的联想，因此在旅游文案与小说场景描写里很常见。"]}
{"word":"Cotswolds","summary":{"en":"The Cotswolds is a famous countryside region in England known for hills and charming stone villages.","zh":"Cotswolds（科茨沃尔德）是英格兰著名的乡村地区，以丘陵与迷人的石头村庄闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scenic rural region in south-central England, famous for rolling hills, honey-colored limestone villages, and traditional countryside charm","zh":"英格兰中南部的科茨沃尔德地区，以起伏丘陵、蜂蜜色石灰岩村庄与典型英伦乡村风貌而闻名"},"examples":[{"en":"We spent a weekend in the Cotswolds visiting small villages and gardens.","zh":"我们在科茨沃尔德度过了一个周末，游览小村庄和花园。"},{"en":"Many people travel to the Cotswolds to see the stone cottages and peaceful countryside.","zh":"很多人去科茨沃尔德是为了看石头小屋和宁静的田园风光。"}]}],"synonyms":["the Cotswolds area","Cotswold Hills","English countryside"],"phonetic":"/ˈkɑtsˌwoʊldz/","extraExplanation":["“Cotswolds”通常被当作专有名词使用，前面常加定冠词：the Cotswolds；说“在科茨沃尔德”常用 in the Cotswolds。","这里的“wolds”是古英语词根，意思接近“起伏的高地/丘陵”；“cot”与“cottage（小屋）”同源，整体带有“丘陵牧场/乡村高地”的历史意味。","它并不是单一城市，而是一片跨郡的地区（常与Gloucestershire等地联系在一起），常见旅游点包括Bibury、Bourton-on-the-Water、Stow-on-the-Wold等。"]}
{"word":"Cott","summary":{"en":"“Cott” is most commonly a surname; as a common vocabulary word, you may be looking for “cot.”","zh":"“Cott”最常见是英语姓氏；如果作为常用词，很可能你想查的是“cot”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A family name (surname).","zh":"（人名）科特（常见于英语国家的姓氏）。"},"examples":[{"en":"Ms. Cott will lead today’s meeting.","zh":"科特女士将主持今天的会议。"},{"en":"I saw the name Cott on the guest list.","zh":"我在宾客名单上看到了“Cott”这个姓。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare/archaic) A spelling variant found in some names or old texts, related to “cot,” meaning a small shelter or simple house.","zh":"（罕见/较古老用法）一种旧式拼写变体，与“cot”有关，可指小棚屋或简陋小屋。"},"examples":[{"en":"In some old records, “cott” appears as a variant spelling.","zh":"在一些旧档案里，“cott”会作为变体拼写出现。"}]}],"synonyms":["(surname) family name","cot (possible intended word)","last name"],"phonetic":"/kɑt/","extraExplanation":["“Cott”在日常英语里更常见的是姓氏；如果你想查的是日常单词，很可能是拼写成了“cot”（婴儿床/简易床）或“cott(on)”（棉花/棉的）。你也可以告诉我你看到它的句子，我能更准确判断意思。"]}
{"word":"cott","summary":{"en":"“Cott” is most commonly a surname; it can also be a rare variant spelling of “cot” (a small simple bed).","zh":"“Cott”最常见是姓氏；也可（很少见）作为“cot”（简易小床/折叠床）的变体拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname)","zh":"姓氏（人名）"},"examples":[{"en":"Dr. Cott will see you now.","zh":"Cott 医生现在会见你。"},{"en":"My teacher’s last name is Cott.","zh":"我老师的姓是 Cott。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a less common spelling of “cot,” meaning a small, simple bed (often a folding bed used for camping)","zh":"（罕见）“cot”的不常见拼写：指简易小床（常见于露营的折叠床）"},"examples":[{"en":"He slept on a cot during the trip.","zh":"旅行期间他睡在一张简易折叠床上。"},{"en":"The clinic had a cot in the corner for patients to rest.","zh":"诊所角落里有一张简易床供病人休息。"}]}],"synonyms":["(for cot) camp bed","folding bed","crib (for babies)"],"phonetic":"/kɑt/","extraExplanation":["“Cott”在日常英语里不常见，最常见的情况是作为姓氏出现。","如果你想查的是“cot”（简易床/行军床），拼写少一个 t：cot。两者读音相同（/kɑt/），但“cott”作为“cot”的拼写在现代英语中很少见。","如果你是在特定文本里看到全大写“COTT”，也可能是某个机构或术语的缩写；可以提供上下文我再帮你判断。"]}
{"word":"cotta","summary":{"en":"Cotta usually means a short white church vestment; it is also seen as part of “terracotta/terra-cotta” (baked clay).","zh":"cotta 通常指教会礼仪用的短白袍；也常见于“terracotta/terra-cotta（赤陶、烧制黏土）”这一词中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a short, white liturgical garment (similar to a short surplice) worn by clergy or altar servers in some Christian churches, especially Catholic and Anglican traditions","zh":"（宗教）短白袍：一种礼仪服饰，类似较短的白色法衣/短白袍，常见于天主教与圣公会等教会，由神职人员或辅祭穿着"},"examples":[{"en":"The altar servers wore cottas over their cassocks.","zh":"辅祭们在长袍外穿着短白袍（cotta）。"},{"en":"In some Anglican churches, a cotta is worn during the service.","zh":"在一些圣公会教堂里，礼拜时会穿短白袍（cotta）。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common, usually in compounds) baked clay; used especially in the phrase “terra-cotta/terracotta”","zh":"（较少单独使用，多见于复合词）烧制黏土；尤见于“terra-cotta/terracotta（陶土、赤陶）”"},"examples":[{"en":"The pot was made of terra-cotta (terracotta).","zh":"这个陶罐是用赤陶（terra-cotta/terracotta）制成的。"},{"en":"Terracotta tiles are popular for warm, earthy colors.","zh":"赤陶瓦因其温暖朴实的色调而很受欢迎。"}]}],"synonyms":["surplice","vestment","terracotta"],"phonetic":"/ˈkɑtə/","extraExplanation":["在英语里，单独写“cotta”最常见的意思是宗教礼仪服饰（短白袍）。表示“赤陶”的时候，英语更常用完整形式“terracotta/terra-cotta”，而不太把“cotta”单独当作“陶土”来用。"]}
{"word":"cottabus","summary":{"en":"Cottabus is an ancient Greek drinking game where you flick wine dregs at a target, often at a symposium.","zh":"Cottabus 是一种古希腊酒宴上的饮酒游戏：把酒滴/酒渣甩向目标，有时带有调情或许愿意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient Greek drinking game in which players flicked drops of wine (the dregs) from a cup at a target, often while flirting or making a love wish.","zh":"一种古希腊的饮酒游戏：玩家把杯中酒渣/酒滴甩向目标，有时还会配合调情或许下爱情愿望。"},"examples":[{"en":"At the symposium, the guests played cottabus and laughed as the wine splashed the target.","zh":"在酒宴（symposium）上，宾客们玩起了 cottabus，酒滴溅到靶子上时大家笑成一团。"},{"en":"He tried cottabus to impress his friends, but his aim was terrible.","zh":"他想用玩 cottabus 来给朋友们留下好印象，但准头很差。"}]}],"synonyms":["ancient Greek drinking game","symposium game"],"phonetic":"/ˈkɑtəbəs/","extraExplanation":["Cottabus 常见于古希腊“酒宴”（symposium）文化：男性宾客一边饮酒、聊天、听音乐或看表演，一边进行带点竞技和调情意味的游戏。","玩法因地区而异：有的版本是把酒滴甩向放在杆子上的小盘或金属片，击中后会发出声响；也有版本是把酒滴投进碗或杯子里。","在英文里这是一个较罕见的古典学词汇，多出现在讨论古希腊生活、文学或考古的文章中。"]}
{"word":"cottae","summary":{"en":"A cottage is a small, often cozy house, usually in the countryside; it can also mean a vacation home.","zh":"cottage 指（多在乡村的）小屋/小别墅，也可指度假屋。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small house, especially in the countryside; often simple and cozy","zh":"（尤指乡村的）小屋；小别墅（通常朴素、温馨）"},"examples":[{"en":"They rented a cottage by the lake for the weekend.","zh":"他们周末在湖边租了一间小屋。"},{"en":"My grandparents live in a quiet cottage in the countryside.","zh":"我祖父母住在乡间一所安静的小屋里。"},{"en":"The cottage has a small garden and a stone path.","zh":"这间小屋有个小花园和一条石子路。"}]},{"partOfSpeech":"n.","definition":{"en":"a vacation home (especially in Canada and some parts of the U.S.)","zh":"度假屋（尤用于加拿大及美国部分地区）"},"examples":[{"en":"We’re going up to the cottage for summer vacation.","zh":"我们暑假要去度假屋住一阵。"},{"en":"Their cottage is where the whole family meets every July.","zh":"他们的度假屋是全家每年七月聚会的地方。"}]}],"synonyms":["small house","cabin","bungalow","vacation home"],"phonetic":"/ˈkɑtɪdʒ/","extraExplanation":["你输入的“cottae”很可能是拼写错误，正确拼写通常是“cottage”。","“cottage”在英语文化里常带有“温馨、朴素、田园风”的感觉；在旅游广告中也常用来营造宁静的乡村度假氛围。"]}
{"word":"cottage","summary":{"en":"A cottage is a small, often cozy house—usually in the countryside or used as a vacation home.","zh":"cottage 指小而温馨的房子，多在乡村；在一些地区也常指度假小屋。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small house, especially in the countryside; often simple and cozy","zh":"（尤指乡村的）小屋；常给人朴素、温馨的感觉"},"examples":[{"en":"They rented a cottage by the lake for the weekend.","zh":"他们租了一间湖边小屋过周末。"},{"en":"The old stone cottage had a small garden in front.","zh":"那座老石头小屋前面有个小花园。"}]},{"partOfSpeech":"n.","definition":{"en":"a small vacation home (often near the sea, a lake, or in the countryside), especially in Canada and some other regions","zh":"（尤在加拿大等地常用）度假小屋；常在海边、湖边或乡间"},"examples":[{"en":"In the summer, my family stays at our cottage.","zh":"夏天我们家会住在我们的度假小屋里。"}]}],"synonyms":["cabin","hut","bungalow","small house"],"phonetic":"/ˈkɑtɪdʒ/","extraExplanation":["“Cottage”常带有一种文化意象：温暖、朴素、亲近自然。英式语境里更像“乡村小屋”；北美（尤其加拿大）里也常指家里在湖边/林间的“度假屋”。","常见搭配：a cozy cottage（温馨小屋）、a seaside/lakeside cottage（海边/湖边小屋）、a thatched cottage（茅草屋顶的小屋）。"]}
{"word":"cottaged","summary":{"en":"“Cottaged” means “having cottages” or “cottage-like in style,” and is most often used in descriptive writing (property, landscape, décor).","zh":"“cottaged”表示“有小屋的”或“小屋风格的”，多用于房产、景观或装饰等描写性语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having one or more cottages; characterized by cottages (often describing a property, landscape, or village).","zh":"有小屋（茅屋/乡间小屋）的；以小屋为特色的（常形容地产、景观或村庄）。"},"examples":[{"en":"The estate includes a cottaged lane lined with old stone houses.","zh":"这座庄园里有一条“有许多小屋的”小路，两旁是古老的石屋。"},{"en":"They bought a cottaged property so relatives could stay in separate small houses.","zh":"他们买了一处带多间小屋的房产，这样亲戚可以分别住在不同的小屋里。"}]},{"partOfSpeech":"adj.","definition":{"en":"Cottage-like in style; resembling a cottage (rustic, cozy, simple).","zh":"小屋风格的；像乡间小屋一样质朴、温馨、简朴的。"},"examples":[{"en":"The café has a cottaged look, with wooden beams and a small garden.","zh":"这家咖啡馆有一种“小屋式”的感觉：木梁结构，还有一个小花园。"},{"en":"She prefers cottaged interiors—soft lighting and warm colors.","zh":"她更喜欢“小屋风”的室内装饰：柔和的灯光和温暖的色调。"}]}],"synonyms":["cottage-style","rustic","cozy","rural","with cottages"],"phonetic":"/ˈkɑtɪdʒd/","extraExplanation":["“cottaged”不是特别常见的日常用词，更常见的表达是“with cottages / cottage-style / rustic”。它多出现在房产描述、旅游文案或较有文学感的描写里，用来强调“有小屋分布”或“呈现乡间小屋的气质”。","注意不要和“cottage cheese（茅屋奶酪/农家奶酪）”混淆；那是固定搭配，与“cottaged”无直接关系。"]}
{"word":"cottager","summary":{"en":"A cottager is someone who lives in a cottage, often implying a rural or traditional setting.","zh":"cottager 指住在乡间小屋（cottage）里的人，常带有乡村或传统生活的语感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who lives in a cottage (a small, simple house, often in the countryside).","zh":"住在小屋（cottage）里的人；乡间小屋的住户。"},"examples":[{"en":"The cottager grows vegetables behind the cottage.","zh":"这位住小屋的人在屋后种菜。"},{"en":"Local cottagers opposed the plan to build a large hotel near the lake.","zh":"当地的小屋住户反对在湖边建大型酒店的计划。"}]}],"synonyms":["cottage dweller","resident","inhabitant"],"phonetic":"/ˈkɑtɪdʒɚ/","extraExplanation":["“Cottager”常见于英式英语或较文学、历史化的语境中，带有“乡村生活/田园氛围”的感觉；在现代日常英语里，人们更常说“someone who lives in a cottage”或直接说“resident/neighbor”。","在英国历史上，“cottager”有时也与较低社会阶层的乡村住户相关（例如租住简陋小屋、可能拥有很少土地的人），所以在阅读旧文学或历史文本时会带有一点时代色彩。"]}
{"word":"cottagers","summary":{"en":"“Cottagers” means people who live in a cottage or people staying in cottages for holidays.","zh":"“cottagers”指住在小屋里的人，也可指住在度假小屋里的人（视语境而定）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who live in a cottage (a small house, often in the countryside).","zh":"住在小屋（通常是乡间的小房子）里的人；小屋居民。"},"examples":[{"en":"The cottagers decorated their gardens with roses and vegetables.","zh":"小屋居民用玫瑰和蔬菜装点他们的花园。"},{"en":"In the story, the cottagers welcome the traveler and offer warm food.","zh":"在故事里，小屋居民欢迎旅人并提供热食。"}]},{"partOfSpeech":"n.","definition":{"en":"People who stay in cottages for holidays, especially in tourist areas.","zh":"（尤指旅游区）住在度假小屋里的人；度假小屋住客。"},"examples":[{"en":"In summer, the beaches are busy with cottagers and campers.","zh":"夏天海滩上满是住度假小屋的人和露营者。"},{"en":"The town’s shops depend on cottagers during the holiday season.","zh":"这个小镇的商店在假期很依赖度假小屋住客。"}]}],"synonyms":["cottage residents","villagers","holidaymakers (in context)","vacationers (in context)"],"phonetic":"/ˈkɑːtɪdʒərz/","extraExplanation":["“cottagers”是“cottager”的复数。它既可指长期住在乡间小屋的人，也可指在湖区/海边租住度假小屋的人，具体要看语境。","在英美文学中，“cottagers”常用来营造朴素、田园、邻里互助的氛围（例如描写村庄生活、自然环境与简单的日常）。"]}
{"word":"cottages","summary":{"en":"“Cottages” means small houses, especially in the countryside or used for vacations.","zh":"“cottages”指小房子，尤指乡间小屋或度假小屋。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"small houses, often in the countryside or used as vacation homes (plural of “cottage”)","zh":"小屋；乡间小别墅；度假小屋（“cottage”的复数）"},"examples":[{"en":"We rented two cottages by the lake for the weekend.","zh":"我们周末在湖边租了两间小屋。"},{"en":"The village has rows of white stone cottages.","zh":"这个村庄有一排排白色石头小屋。"},{"en":"Some cottages are old, but they’re warm and comfortable inside.","zh":"有些小屋很古老，但里面温暖又舒适。"}]}],"synonyms":["small houses","cabins","bungalows","chalets"],"phonetic":"/ˈkɑtɪdʒ/","extraExplanation":["“cottage”常让人联想到乡村生活与温馨、朴素的居住环境；在英美文化中也常指度假时租住的独立小屋。","相关常见搭配：cottage cheese（茅屋奶酪/颗粒奶酪）；cottage industry（家庭手工业/小规模产业）。"]}
{"word":"Cottageville","summary":{"en":"“Cottageville” is a proper place name for a town/community.","zh":"“Cottageville”是城镇/社区的地名（专有名词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name (proper noun): a town or community called “Cottageville.” It refers to a specific location, not a common English word.","zh":"地名（专有名词）：“Cottageville”是某个城镇或社区的名称，指特定地点，不是普通英文词汇。"},"examples":[{"en":"I grew up in Cottageville, and I still visit my family there every summer.","zh":"我在Cottageville长大，每年夏天我都会回去看望家人。"},{"en":"The meeting will be held at the library in Cottageville.","zh":"会议将在Cottageville的图书馆举行。"}]}],"synonyms":["(no true synonyms; use the specific official place name)"],"phonetic":"/ˈkɑtɪdʒˌvɪl/","extraExplanation":["“Cottageville”通常由 cottage（小屋、乡间小别墅）+ -ville（城镇、村庄；常见于地名后缀，源自法语/拉丁语）构成，所以字面上有“有许多小屋的城镇/小屋镇”的感觉，但作为地名时主要功能是指代具体地点。","如果你指的是美国某个具体的Cottageville（例如在南卡罗来纳州或西弗吉尼亚州等地也可能出现同名地名），不同地点的文化与历史会不一样；告诉我你指的州/国家，我可以补充更准确的背景。"]}
{"word":"cottagey","summary":{"en":"“Cottagey” means cozy, rustic, cottage-like in a pleasant, homey way.","zh":"“cottagey”指“有小屋般的温馨质朴风格”，通常带褒义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the cozy, small, rustic charm of a cottage; simple and homey in a pleasant way.","zh":"有小屋般的温馨质朴感；带点乡村、简朴而舒适的气质（通常是褒义）。"},"examples":[{"en":"The room felt cottagey, with its wooden beams and floral curtains.","zh":"这个房间有种小屋风：木梁配上碎花窗帘，很温馨。"},{"en":"They chose a cottagey café for brunch—quiet, warm, and unpretentious.","zh":"他们选了一家很“小屋风”的咖啡馆吃早午餐——安静、暖和、不做作。"}]}],"synonyms":["cozy","rustic","homey","cottage-like","country-style"],"phonetic":"/ˈkɑːtɪdʒi/","extraExplanation":["“cottagey”是由“cottage（小屋）+ -y”构成的口语/非正式形容词，常用来形容装修风格、氛围或地方给人的感觉（cozy、rustic、homey）。在写作中更常见的替代词有“cottage-like”或“cottage-style”。","它与“homely”要区分：在美式英语里“homely”常指“相貌不漂亮”，而“homey”才更接近“温馨、有家的感觉”。“cottagey”通常偏向审美与风格上的“乡村温馨”。"]}
{"word":"cottar","summary":{"en":"A cottar is a historical term for a poor tenant laborer/farmer living in a cottage, especially in Scotland or Ireland.","zh":"cottar 指历史上（尤苏格兰、爱尔兰）住在小屋里的贫苦佃农或雇农，通常几乎没有土地。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in Scotland or Ireland, historical) a poor tenant farmer or laborer who lived in a small cottage and usually had little or no land.","zh":"（尤指苏格兰或爱尔兰，历史用语）茅舍佃户；住在小屋里的贫苦佃农或雇农，通常几乎没有土地或只有很少土地。"},"examples":[{"en":"In the novel, the cottar works on the laird’s land in exchange for a small cottage.","zh":"在小说里，这位茅舍佃户为地主耕作，以换取一间小屋居住。"},{"en":"Many cottars relied on seasonal work to feed their families.","zh":"许多茅舍佃户依靠季节性工作来养家糊口。"}]}],"synonyms":["cotter","tenant farmer","farm laborer","peasant (historical)"],"phonetic":"/ˈkɑtər/","extraExplanation":["“cottar”多见于英伦文学与历史语境，带有阶层与土地制度的背景色彩：他们往往处于地主（laird/landlord）之下，生活来源可能是给地主干活、缴租，或在小块地上自给自足。","拼写变体：在一些资料中也可见“cotter”。阅读旧文学时两者常可互换，但“cottar”更常见于苏格兰语境。"]}
{"word":"cottars","summary":{"en":"“Cottars” means poor rural tenants or farm workers (historically, especially in Scotland/Ireland) who lived in small cottages and worked small plots of land.","zh":"“cottars”指（历史上尤指苏格兰/爱尔兰的）住在小茅屋、耕作少量土地的贫穷佃农或农工。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of cottar: a person (especially in Scotland or Ireland, historically) who lived in a small cottage and worked a small piece of land, often as a poor tenant or farm laborer.","zh":"cottar 的复数：指（尤见于历史上的苏格兰或爱尔兰）住在小茅屋里、耕作少量土地的人，通常是贫穷的佃农或农业雇工。"},"examples":[{"en":"In the old records, cottars are listed separately from larger tenant farmers.","zh":"在旧档案里，cottars 常被单独列出，与拥有较大农地的佃农区分开来。"},{"en":"The novel describes cottars struggling to pay rent after a bad harvest.","zh":"小说描写了歉收后，cottars 为付房租而苦苦挣扎。"}]}],"synonyms":["cotters","tenant farmers","farm laborers","cottagers"],"phonetic":"/ˈkɑtɚz/","extraExplanation":["“cottar/cottar(s)”多见于英伦史料与文学语境，带有明显的历史与阶层色彩；在现代日常英语里更常用的对应词是 “tenant farmer（佃农）”“farm laborer（农工）” 或 “cottager（住在乡间小屋的人）”，但这些词不一定包含“贫困、依附于地主”的历史意味。","拼写上也常见 “cotter/cotters”。在一些文本里两者几乎可互换，但具体用法会随地区与年代而不同。"]}
{"word":"cottas","summary":{"en":"“Cottas” is the plural of “cotta,” a short white robe worn by clergy or choir members over a cassock.","zh":"“Cottas”是“cotta”的复数，指神职人员或唱诗班穿在长袍外的短白罩衣。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a short white robe worn over a cassock by some clergy and choir members in certain Christian churches (plural: cottas)","zh":"（某些基督教教会中）神职人员或唱诗班穿在长袍（cassock）外面的短白罩衣（复数：cottas）"},"examples":[{"en":"The altar servers put on cottas before the service began.","zh":"辅祭员在礼拜开始前穿上短白罩衣。"},{"en":"He wore a cassock with a cotta during the choir rehearsal.","zh":"他在合唱团排练时穿着长袍外加短白罩衣。"}]}],"synonyms":["surplice","choir robe","vestment"],"phonetic":"/ˈkɑtə/","extraExplanation":["“cottas”是名词“cotta”的复数形式。","cotta 常见于天主教、圣公会等礼仪传统中，通常是白色、较短、带袖的罩衣，穿在黑色或深色的 cassock 外面；和更长、较宽的 surplice（白衣/法衣）相近但长度与样式常不同。","这个词在日常英语中不常见，多出现在宗教礼仪、教堂音乐（choir）或历史服饰语境里。"]}
{"word":"Cottbus","summary":{"en":"Cottbus is a city in eastern Germany (Brandenburg), near Berlin.","zh":"Cottbus（科特布斯）是德国东部勃兰登堡州的一座城市，靠近柏林。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in eastern Germany (state of Brandenburg), near the Spree River, known for its theater, university, and nearby Spreewald region.","zh":"德国东部勃兰登堡州的一座城市，靠近施普雷河，以剧院、大学以及附近的施普雷森林（Spreewald）地区闻名。"},"examples":[{"en":"Cottbus is about an hour southeast of Berlin by train.","zh":"从火车来看，科特布斯距离柏林东南方向大约一小时。"},{"en":"She studied at Brandenburg University of Technology in Cottbus.","zh":"她在科特布斯的勃兰登堡工业大学学习。"}]}],"phonetic":"/ˈkɑt.bʊs/","extraExplanation":["Cottbus 是英文/德文常用写法；在德语中写作 Cottbus，读音大致接近“KOT-booss”。","这座城市所在地区有索布人（Sorbs）少数民族文化传统，因此你也可能看到它的下索布语名称：Chóśebuz。"]}
{"word":"cotte","summary":{"en":"A medieval long tunic/inner robe, often worn under armor or other clothing.","zh":"中世纪的一种长上衣/内袍，常穿在盔甲或外衣内层。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Historical) A long tunic or inner robe worn in medieval Europe, often under armor or under an outer garment (such as a surcoat).","zh":"（历史用语）中世纪欧洲常穿的一种长上衣/内袍，常穿在盔甲里面或外袍（如罩袍）里面。"},"examples":[{"en":"The knight pulled on a padded cotte before fastening his armor.","zh":"骑士先穿上一件有衬垫的 cott e，然后再系上盔甲。"},{"en":"In the museum, you can see a wool cotte similar to what ordinary townspeople wore.","zh":"在博物馆里，你可以看到一件羊毛 cott e，和当时普通城镇居民穿的很像。"}]}],"synonyms":["tunic","(medieval) gown","surcoat (related)"],"phonetic":"/kɑt/","extraExplanation":["“cotte”多见于历史写作、服装史、角色扮演/奇幻作品的考据语境，现代日常英语里很少用。","它与“coat（外套）”看起来相似，但“cotte”指的是中世纪的“内层长袍/长衫”，不等同于现代外套。","相关词：surcoat（罩袍，穿在盔甲外）、tunic（束腰短袍/长衫，更通用）、gown（长袍/礼服，语义更广）。"]}
{"word":"cotted","summary":{"en":"“Cotted” is a rare word meaning either “living in/provided with cottages” or the past form of “cot,” meaning “placed in a small bed (cot).”","zh":"“cotted”很少见，可指“住在/配有小屋的”，也可作“cot”的过去式，表示“把人安置在小床/行军床上”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Having a cottage; living in or provided with small cottages.","zh":"（罕见）有小屋的；住在（或配有）小屋里的。"},"examples":[{"en":"The workers were cotted near the estate, each family in a small house.","zh":"工人们被安置在庄园附近的小屋里，每户一间。"},{"en":"In older rural writing, you may see “cotted” describing people settled in cottages.","zh":"在较早的乡村题材写作中，你可能会看到“cotted”用来形容人们住在小屋里。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “cot” (rare): to place someone in a cot (a small bed), especially in a hospital or camp setting.","zh":"“cot”的过去式/过去分词（少见）：把某人安置在行军床/小床上（常见于医院或营地语境）。"},"examples":[{"en":"The patients were cotted in the hallway during the emergency.","zh":"紧急情况下，病人被安置在走廊的行军床上。"},{"en":"They had already cotted the children before the storm arrived.","zh":"暴风雨来之前，他们已经把孩子们安置在小床上了。"}]}],"synonyms":["housed","sheltered","bedded","lodged"],"phonetic":"/ˈkɑtɪd/","extraExplanation":["“cotted”在现代英语里非常少见，更常见的是名词“cot”（行军床/小床）或“cottage”（小屋）。如果你是在写作或阅读中遇到它，通常需要靠上下文判断：谈住房/乡村生活，多半是“住在小屋里”；谈医院/营地用床位，多半是“把人安置在行军床上”。","如果你的意思是“有很多小屋的/像小屋一样的”，现代更自然的表达是“cottage-like”或“with cottages”。"]}
{"word":"Cottekill","summary":{"en":"Cottekill is a place name in New York (a hamlet), and it can also refer to a local creek.","zh":"Cottekill 是纽约州的一个地名（小村落/聚落），也可能指当地的 Cottekill Creek（小溪）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hamlet (small community) in Ulster County, New York, in the Hudson Valley region.","zh":"美国纽约州阿尔斯特县（哈德逊河谷地区）的一个小村落/聚落（hamlet）。"},"examples":[{"en":"She grew up in Cottekill, New York, before moving to the city.","zh":"她在纽约州的 Cottekill 长大，后来搬去了城市。"},{"en":"The trail starts near Cottekill and follows the creek for a while.","zh":"这条步道从 Cottekill 附近开始，有一段沿着小溪走。"}]},{"partOfSpeech":"n.","definition":{"en":"(also used locally for) Cottekill Creek, a small stream in the same area.","zh":"（当地也常指）Cottekill Creek：该地区的一条小溪/支流。"},"examples":[{"en":"After heavy rain, Cottekill Creek can rise quickly.","zh":"大雨之后，Cottekill Creek 的水位可能很快上涨。"},{"en":"They took photos by the bridge over Cottekill Creek.","zh":"他们在 Cottekill Creek 上方的桥边拍了照。"}]}],"phonetic":"/ˈkɑtəˌkɪl/","extraExplanation":["“Cottekill”是地名（专有名词），在日常英语中通常不翻译，而是直接用原拼写。","地名里的“kill”常见于纽约州及周边，源自早期荷兰语，意思是“小溪/河道”（例如 Catskill, Fishkill）。这和英语动词 kill（杀死）没有关系。"]}
{"word":"Cottenham","summary":{"en":"Cottenham is most commonly a place name: a village in Cambridgeshire, England. It can also be a surname.","zh":"Cottenham 常见用法是地名：英国英格兰剑桥郡的一个村庄；也可作英文姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a village in Cambridgeshire, England, north of Cambridge","zh":"（英国）英格兰剑桥郡的一个村庄，位于剑桥市以北"},"examples":[{"en":"She grew up in Cottenham, just a short drive from Cambridge.","zh":"她在Cottenham长大，离剑桥开车不远。"},{"en":"We took a bus from Cambridge to Cottenham.","zh":"我们从剑桥坐公交车到Cottenham。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname) of English origin","zh":"一个英语来源的姓氏"},"examples":[{"en":"Dr. Cottenham will speak at the meeting tomorrow.","zh":"Cottenham博士将于明天在会议上发言。"}]}],"synonyms":["(as a place name) Cottenham, Cambridgeshire"],"phonetic":"/ˈkɑtənəm/","extraExplanation":["Cottenham 是典型的英格兰地名，词源常被解释为古英语元素组合：cot（小屋、农舍）+ hām（家园、聚落），整体可理解为“有小屋的聚落/农舍聚居地”。","读作三音节更自然：COT-en-ham / COT-en-əm。英语地名里结尾 -ham 常弱读成 /-əm/。"]}
{"word":"Cotter","summary":{"en":"“Cotter” most commonly means a small pin used to fasten and secure parts (often in machines); it can also be a surname.","zh":"“Cotter”最常见的意思是用于固定零件的销钉（常见于机械）；也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small metal pin (often split) used to secure a bolt, nut, or other part so it cannot slip out or loosen","zh":"（机械中常见的）开口销/制销，用来固定螺栓、螺母或零件，防止滑出或松动"},"examples":[{"en":"Make sure the cotter is in place before you ride the bike.","zh":"骑车前先确认开口销已经装好。"},{"en":"The mechanic replaced the cotter pin to keep the wheel from coming loose.","zh":"修理工更换了开口销，防止车轮松动。"}]},{"partOfSpeech":"n.","definition":{"en":"(also Cotter) a family name (surname)","zh":"（也作 Cotter）姓氏"},"examples":[{"en":"Ms. Cotter will lead today’s meeting.","zh":"科特女士将主持今天的会议。"},{"en":"The article was written by James Cotter.","zh":"这篇文章由詹姆斯·科特撰写。"}]}],"synonyms":["cotter pin","split pin","fastening pin","retaining pin"],"phonetic":"/ˈkɑtər/","extraExplanation":["在工程/维修语境里更常见的是固定搭配 cotter pin（开口销）。英式英语中有时也说 split pin，指同一种常见的分叉金属销。","作为姓氏 Cotter 在英语国家中较常见，常被认为与爱尔兰姓名来源有关。"]}
{"word":"cotter","summary":{"en":"A cotter is a pin (often a cotter pin/split pin) used to fasten parts so they don’t slip; it can also mean to fasten with such a pin.","zh":"cotter 指用于固定部件、防止滑脱的销（常指开口销 cotter pin），也可作动词表示“用开口销固定”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A wedge-shaped pin (often metal) used to fasten parts of a machine or structure together, typically by passing through a hole to prevent a shaft, wheel, or joint from slipping out of place.","zh":"（常为金属的）楔形销/固定销，用来把机器或结构的部件固定在一起，通常穿过孔来防止轴、轮或连接处滑脱。"},"examples":[{"en":"The mechanic replaced the worn cotter to secure the wheel on the axle.","zh":"技师更换了磨损的开口销/固定销，把车轮牢牢固定在车轴上。"},{"en":"Make sure the cotter is fully inserted before you tighten the nut.","zh":"拧紧螺母前，确保固定销已经完全插入。"}]},{"partOfSpeech":"vt.","definition":{"en":"To fasten or secure something with a cotter pin.","zh":"用固定销（开口销）把……固定住。"},"examples":[{"en":"Cotter the linkage so it won’t come loose during operation.","zh":"把连杆用开口销固定好，免得运转时松脱。"}]},{"partOfSpeech":"n.","definition":{"en":"A type of fastener: a split pin (cotter pin) that is inserted through a hole and then bent back to hold it in place.","zh":"一种紧固件：开口销（cotter pin），穿过孔后把两股掰开，用来防止脱落。"},"examples":[{"en":"He bent the ends of the cotter pin after pushing it through the bolt.","zh":"他把开口销穿过螺栓后，将两端掰开固定。"}]}],"synonyms":["pin","cotter pin","split pin","fastener"],"phonetic":"/ˈkɑtɚ/","extraExplanation":["在美式英语里，单独说 cotter 往往指“cotter pin（开口销）”，在汽车、自行车、农机等场景很常见；在一些英式或工程语境中，cotter 也可泛指“楔形销/楔”，用于把零件楔紧固定。","相关词：axle（车轴）、nut（螺母）、bolt（螺栓）、linkage（连杆机构）、secure（固定/确保安全）。"]}
{"word":"cottered","summary":{"en":"“Cottered” means fastened or locked in place with a cotter pin/wedge; it’s also the past participle of “cotter.”","zh":"“cottered”指“用开口销/楔形销固定的”，也可作动词“cotter”的过去分词，表示“用销子固定”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Fastened or secured with a cotter (a pin or wedge used to keep a part from sliding or coming loose).","zh":"用开口销（或楔形销）固定的；用销子防松/防脱的。"},"examples":[{"en":"The wheel was held in place by a cottered pin.","zh":"车轮用开口销固定在位。"},{"en":"Make sure the cottered joint is tight before you start the machine.","zh":"启动机器前，确认用销子固定的接头已经紧固。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “cotter”: to fasten with a cotter pin or wedge.","zh":"“cotter”的过去式/过去分词：用开口销或楔形销固定。"},"examples":[{"en":"He cottered the bolt so it wouldn’t back out.","zh":"他用开口销把螺栓固定住，防止它松脱。"},{"en":"All the moving parts were cottered and checked for safety.","zh":"所有运动部件都已用销子固定并检查过安全性。"}]}],"synonyms":["pinned","fastened","secured","locked in place","wedged"],"phonetic":"/ˈkɑtərd/","extraExplanation":["“cotter”在机械语境里常指“开口销/保险销”（cotter pin）：一种穿过孔位后掰开两端的金属销，用来防止螺母、轴或连接件在震动中松动。","“cottered”多见于工程、汽车、自行车、家具组装说明等文本里，属于偏技术用词；日常口语里更常说“secured with a pin / pinned in place（用销固定）”。"]}
{"word":"cotterel","summary":{"en":"Cotterel is a rare word meaning a small cotter (a fastening pin or wedge), and it can also appear as a surname/spelling variant (Cotterel/Cotterell).","zh":"cotterel 是个罕见词，主要指“小楔销/固定销”（cotter 的小称）；也可能作为姓氏或拼写变体（Cotterel/Cotterell）出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small cotter (a wedge-shaped pin used to fasten two parts of a machine or structure together); a small fastening pin/wedge","zh":"（机械或结构中用来固定零件的）小楔销；小固定销（cotter 的小称）"},"examples":[{"en":"The mechanic replaced the cotterel to keep the joint from slipping.","zh":"机械师更换了楔销小件，以防连接处滑脱。"},{"en":"Make sure the cotterel is seated firmly before tightening the bolt.","zh":"在拧紧螺栓前，确保楔销小件已牢固就位。"}]},{"partOfSpeech":"n.","definition":{"en":"a rare spelling variant or surname form (often seen as Cotterell/Cotterel), used as a family name rather than a common vocabulary word","zh":"罕见的拼写变体或姓氏形式（常见为 Cotterell/Cotterel），多作人名而非常用词汇"},"examples":[{"en":"In the credits, she is listed as Maya Cotterel.","zh":"在片尾字幕中，她被列为玛雅·科特勒尔（Cotterel）。"}]}],"synonyms":["cotter","cotter pin","pin","fastener"],"phonetic":"/ˈkɑtərəl/","extraExplanation":["“cotterel”在现代英语里非常少见；在工程/维修语境中，更常用的词是“cotter pin”（开口销）或“cotter”（楔销）。不同地区与行业对紧固件的叫法会有差异，查零件时最好结合图片或标准型号（如尺寸、材质、是否为开口销等）。"]}
{"word":"Cotterell","summary":{"en":"Cotterell is most commonly a surname (last name).","zh":"Cotterell 最常见的用法是英语姓氏（名的“姓”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), used to identify a person or family; it may also be used as a place name or business name in some contexts.","zh":"一个姓氏（家族姓），用来指代个人或家族；在某些语境中也可能作为地名或机构/公司名称使用。"},"examples":[{"en":"Ms. Cotterell will lead the meeting today.","zh":"Cotterell 女士今天将主持会议。"},{"en":"I found an article written by Dr. Cotterell.","zh":"我找到了一篇由 Cotterell 博士写的文章。"},{"en":"Is “Cotterell” the correct spelling of your last name?","zh":"“Cotterell”是你姓氏的正确拼写吗？"}]}],"synonyms":["(no true synonyms; proper name)"],"phonetic":"/ˈkɑtərəl/","extraExplanation":["“Cotterell”通常作为专有名词使用（姓氏首字母大写）。在英语国家，姓氏常用于正式场合（如邮件称呼、学术引用、法律文件）。","它也可能有不同拼写变体（例如 Cotterill / Cottrell 等），在口头交流时可主动确认拼写（How do you spell your last name?）。"]}
{"word":"cottering","summary":{"en":"Cottering means fastening or locking parts in place using a cotter (often a cotter pin) so they don’t come loose.","zh":"Cottering 指用开口销/楔销把零件锁定固定，防止松脱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of fastening or securing something with a cotter (a pin/wedge used to keep parts from slipping apart)","zh":"用开口销/楔销（cotter）把零件固定住、防止松脱的动作或过程"},"examples":[{"en":"After aligning the hole, the mechanic finished cottering the joint so it wouldn’t loosen.","zh":"把孔对齐后，技师完成了对接头的开口销固定，防止它松动。"},{"en":"Proper cottering keeps the wheel assembly safe during operation.","zh":"正确的开口销固定能在运转时保证轮组安全。"}]},{"partOfSpeech":"v.","definition":{"en":"fastening or securing (something) with a cotter","zh":"用开口销/楔销固定（某物）"},"examples":[{"en":"They are cottering the nut to prevent it from backing off.","zh":"他们正在用开口销固定螺母，防止它自行松脱。"},{"en":"Be careful when cottering the linkage—make sure the pin is fully in place.","zh":"给连杆做开口销固定时要小心——确保销子完全到位。"}]}],"synonyms":["pinning","securing","fastening","locking"],"phonetic":"/ˈkɑtərɪŋ/","extraExplanation":["“Cotter”在机械语境里通常指“开口销/楔销”，用来把螺母、销轴或连接件锁住，防止震动导致松动。日常英语里更常看到名词短语 cotter pin（开口销）。","在英式英语中，cotter 也可能指某些“楔形销/销钉”结构；在美式语境里，遇到车轮、连杆、螺母等场景时，多半就是指 cotter pin 这类防松固定件。"]}
{"word":"cotterite","summary":{"en":"Cotterite most commonly means a person from a place called Cotter; in some older geology contexts it can also appear as a rare mineral term whose meaning depends on the source.","zh":"Cotterite 最常见指来自名为 Cotter 的地方的人；在一些较旧的地质语境中也可能作为少见的矿物名称出现，具体含义需看来源与语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who lives in or comes from a place called Cotter (used like “Brooklynite”).","zh":"（类似“Brooklynite”的用法）来自或居住在名为 Cotter 的地方的人。"},"examples":[{"en":"She’s a proud Cotterite and talks about her hometown all the time.","zh":"她很以自己是 Cotter 人为傲，经常谈起自己的家乡。"},{"en":"Many Cotterites came to the festival downtown.","zh":"很多 Cotter 当地人参加了市中心的节庆活动。"}]},{"partOfSpeech":"n.","definition":{"en":"A rare or older term used in some geology/mineralogy writing for a mineral; the exact meaning depends on the source and context.","zh":"在部分地质/矿物学文献中出现的少见或较旧的矿物名称；具体指哪一种矿物会因资料与语境而异。"},"examples":[{"en":"The report mentions cotterite, but the author doesn’t clearly define it.","zh":"报告里提到 cotterite，但作者并没有清楚说明它指的是什么。"},{"en":"In older notes, “cotterite” appears as a mineral name that needs verification.","zh":"在较旧的笔记里，“cotterite”作为矿物名称出现，但需要进一步核实。"}]}],"synonyms":["resident of Cotter","person from Cotter"],"phonetic":"/ˈkɑtərˌaɪt/","extraExplanation":["后缀 -ite 在英语里常有两种常见用途：①表示“某地的人/居民”（如 New Yorker, Brooklynite）；②用于矿物名称（如 granite 里的 -ite 相关词形很常见）。","如果你在科学文章里看到 cotterite，建议结合上下文（作者、年代、地区、是否给出化学式/晶体信息）判断它是否为某个矿物的旧称、地方性用名或拼写变体。"]}
{"word":"cotters","summary":{"en":"“Cotters” is the plural of “cotter”: most often a fastening pin/wedge (especially a cotter pin), and in historical British/Scottish/Irish contexts, a small tenant or cottager.","zh":"“cotters”是“cotter”的复数：最常指用于固定的销钉/楔子（尤指开口销），也可在英/苏/爱历史语境中指小佃农或住小屋的租户。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A metal pin or wedge used to fasten parts in place (for example, a “cotter pin” that locks a nut or shaft so it won’t loosen).","zh":"（机械）开口销/销钉：用于固定零件、防止松动的金属销或楔子（如 cotter pin）。"},"examples":[{"en":"Make sure the cotter pin is fully inserted before you drive the car.","zh":"开车前要确认开口销已经完全插好。"},{"en":"The mechanic replaced the worn cotter that held the joint together.","zh":"修理工更换了固定连接处的磨损销钉。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical, mainly British/Scottish/Irish) A person who lived in a small cottage and often rented a little land; a cottager or small tenant.","zh":"（历史用法，主要英格兰/苏格兰/爱尔兰）住在小屋里、通常租少量土地的人；佃农/小农。"},"examples":[{"en":"In some old records, cotters are listed separately from larger farmers.","zh":"在一些旧档案中，cotters 会与较大的农场主分开登记。"},{"en":"The novel describes cotters struggling through a hard winter.","zh":"小说描写了佃农们艰难度过严冬。"}]}],"synonyms":["cotter pin","split pin","fastening pin","cottager (historical sense)","tenant (historical sense)"],"phonetic":"/ˈkɑtər/","extraExplanation":["“cotters”是“cotter”的复数。日常英语里更常见的是机械含义，尤其搭配“cotter pin（开口销）”。","历史含义多见于英国与爱尔兰相关的历史、文学或家谱材料中；现代口语里不常用。"]}
{"word":"cotterway","summary":{"en":"“Cotterway” is usually a proper name (surname or place name), not a common English vocabulary word.","zh":"“Cotterway”通常是专有名词（姓氏或地名），并非常见英语词汇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A proper name (surname or place/street name). In general English, “Cotterway” is not a common dictionary word; it’s most often used as a name.","zh":"专有名词（姓氏或地名/街道名）。“Cotterway”在一般英语中不是常见词典词条，更常见于人名或地名。"},"examples":[{"en":"Our new neighbor is Ms. Cotterway.","zh":"我们的新邻居是科特韦女士。"},{"en":"The package was delivered to Cotterway Drive.","zh":"包裹送到了科特韦大道。"}]},{"partOfSpeech":"other","definition":{"en":"(Rare/unclear) Used occasionally online as a nonstandard spelling; meaning depends on context and may be a typo or brand/user name.","zh":"（罕见/不明确）偶尔在网络上作为非标准拼写出现；具体含义取决于语境，可能是拼写错误、品牌名或用户名。"},"examples":[{"en":"I couldn’t find a definition for “cotterway” without more context.","zh":"在没有更多语境的情况下，我找不到“cotterway”的明确释义。"}]}],"phonetic":"/ˈkɑtərˌweɪ/","extraExplanation":["“Cotterway”不属于常见英语词汇。如果你是在文章/歌词/游戏/技术文档里看到它，建议你把原句或截图发来，我可以根据上下文判断它是：①人名/地名；②品牌或用户名；③把别的词拼错了。","如果你想查的其实是相近词：\n- cotter pin（开口销/制销，用于固定零件）\n- coterie（小圈子/小团体）\n- causeway（堤道/高架路）\n提供上下文后我也能帮你确认是哪一个。"]}
{"word":"cottid","summary":{"en":"Cotid means “daily; everyday,” but it’s rare in modern English (quotidian is more common).","zh":"Cotid 表示“每日的、日常的”，但在现代英语中较罕用（更常见的是 quotidian）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) happening every day; daily; everyday.","zh":"（罕用）每天发生的；日常的；每日的。"},"examples":[{"en":"He kept a cotid journal to record small changes in his mood.","zh":"他写日常日记来记录情绪上的细微变化。"},{"en":"The report focuses on the cotid routines of workers in the city.","zh":"这份报告关注城市工人的日常作息。"}]}],"synonyms":["daily","everyday","quotidian","day-to-day"],"phonetic":"/ˈkoʊtɪd/","extraExplanation":["“cottid”很可能是拼写误差；更常见的形式是 **cotid**（罕用）或 **quotidian**（常见，意为“日常的”）。","**cotid** 来自拉丁语 *cotidie*（每天），在现代英语里多见于较文学/学术的语境，日常表达更常用 **daily / everyday**。","你也可能在词典里见到缩写 **cotid.**，表示“每天的（daily）”。"]}
{"word":"Cottidae","summary":{"en":"Cottidae is the scientific family name for sculpins—mostly bottom-dwelling fishes.","zh":"Cottidae 是杜父鱼科的学名，指一类多栖息海底的杜父鱼（sculpins）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of mostly bottom-dwelling marine (and some freshwater) fishes known as sculpins, often found in cold or temperate waters.","zh":"（鱼类）杜父鱼科：多为栖息在海底（也有少数淡水）的鱼类，英文常称 sculpins（杜父鱼/鲉形鱼类），多见于寒冷或温带水域。"},"examples":[{"en":"Many tidepool sculpins belong to the family Cottidae.","zh":"许多潮池里的杜父鱼属于杜父鱼科（Cottidae）。"},{"en":"The biologist recorded several Cottidae species near the rocky shore.","zh":"这位生物学家在岩石海岸附近记录了几种杜父鱼科的物种。"}]}],"synonyms":["sculpins (family)"],"phonetic":"/ˈkɑtɪdi/","extraExplanation":["“Cottidae”是拉丁化的科名，来自属名“Cottus”（常见杜父鱼属）。在生物分类学里，科名常以“-idae”结尾，表示“……科”。","日常英语里更常用普通名“sculpins”来指这类鱼；“Cottidae”更常出现在学术文章、野外调查记录或物种名录中。"]}
{"word":"cottidae","summary":{"en":"Cottidae is the scientific name for the sculpin family of fishes.","zh":"Cottidae 是“杜父鱼科/杜父鱼科（sculpin family）”的科学名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a biological family of mostly marine fishes known as sculpins, found mainly in cold northern waters (order Scorpaeniformes).","zh":"杜父鱼科；一种主要为海水鱼的生物分类“科”，成员常被称为“杜父鱼/鮋形杜父鱼（sculpins）”，多分布在北方寒冷海域（隶属鲉形目）。"},"examples":[{"en":"The Cottidae include many bottom-dwelling sculpins that blend into rocks and sand.","zh":"杜父鱼科包含许多栖息海底的杜父鱼，它们能与岩石和沙地融为一体。"},{"en":"In field guides, Cottidae is often listed as the sculpin family.","zh":"在野外鱼类图鉴中，Cottidae 常被标注为“杜父鱼科/杜父鱼科（sculpin family）”。"}]}],"synonyms":["sculpin family","sculpins"],"phonetic":"/ˈkɑːtɪdiː/","extraExplanation":["“Cottidae”是拉丁化的科学名称，通常首字母大写并用斜体书写（如 *Cottidae*），表示生物分类层级中的“科”。","口语或一般科普写作中，人们更常说“sculpins（杜父鱼）”来指该科的成员；“Cottidae”更常见于学术论文、图鉴与分类学语境。"]}
{"word":"cottier","summary":{"en":"A historical term for a cottage-dweller, especially a poor tenant farmer renting a cottage (often in Ireland).","zh":"历史用语：住在小屋里的人；尤指（常见于爱尔兰的）租住小屋的贫苦佃农。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who lives in a small cottage, especially a poor tenant farmer who rents a cottage (and sometimes a small plot of land)","zh":"住在小屋里的人；（尤指旧时）租住小屋的贫苦佃农（有时也租一小块地）"},"examples":[{"en":"In the 1800s, many Irish cottiers lived on tiny rented plots and struggled to pay rent.","zh":"在19世纪，许多爱尔兰的 cottier 住在很小的租地上，艰难地交房租。"},{"en":"The novel describes a cottier family surviving on potatoes and seasonal work.","zh":"小说描写了一个 cottier 家庭靠土豆和季节性工作维生。"}]}],"synonyms":["cottager","tenant farmer","crofter"],"phonetic":"/ˈkɑːtiər/","extraExplanation":["这个词带有明显的历史语境，常见于描述18—19世纪爱尔兰、苏格兰等地的农村社会。cottier 往往租住简陋小屋、依赖小块土地和零工维生，社会地位较低。","与 crofter（苏格兰高地的“小佃农”，常带有固定小农场的概念）相比，cottier 更强调“只租小屋/极小地块、生活更贫困”的阶层。"]}
{"word":"cottierism","summary":{"en":"Cottierism is a historical system of poor tenant farming (especially in Ireland) marked by small plots and insecure rent/tenure.","zh":"Cottierism 指（尤指爱尔兰历史上的）贫困佃农租种小块土地、租期与地租都缺乏保障的制度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A land-tenure system (especially in historical Ireland) in which poor tenant farmers (“cottiers”) rented small plots, often paying rent through labor or a share of the crop, usually with insecure, short-term tenancy.","zh":"（尤指历史上的爱尔兰）佃农制：贫穷的小佃农（cottier）租种小块土地，常以劳役或收成交租，租期不稳、缺乏保障。"},"examples":[{"en":"Cottierism kept many rural families in poverty because rents could rise suddenly.","zh":"佃农制使许多农村家庭长期陷于贫困，因为地租可能突然上涨。"},{"en":"In accounts of 19th-century Ireland, cottierism is often linked to land insecurity and hunger.","zh":"在对19世纪爱尔兰的记述中，佃农制常与土地无保障和饥饿联系在一起。"}]}],"synonyms":["cottier system","tenant-farming system","peasant tenancy"],"phonetic":"/ˈkɑːtiərɪzəm/","extraExplanation":["“Cottierism”主要出现在关于爱尔兰社会史与土地制度的讨论中，特别是18—19世纪。许多佃农租地规模很小、租约短、缺乏稳定权利，容易受到歉收、租金上涨或被驱逐的影响。","词根提示：cottier 来自 cot（小屋、棚屋）一类的概念，指住在小屋里的贫苦佃农；-ism 表示“制度/现象”。","在文学与社会批评写作中，它常被用来讨论殖民时期的土地结构、阶级不平等，以及与大饥荒前后农村贫困相关的背景。"]}
{"word":"cottiers","summary":{"en":"Cottiers are small-cottage tenants (often poor farmers), mainly mentioned in historical Irish/Scottish contexts.","zh":"cottiers 指（多见于爱尔兰/苏格兰历史语境中的）租住小屋、常带少量土地的贫困佃农。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tenant who rented a small cottage (often with a little land) and typically lived by farming or laboring; common in older Irish and Scottish history.","zh":"（尤指旧时爱尔兰、苏格兰的）小屋佃农；租住小屋（常带少量土地）并以务农或劳作维生的人。"},"examples":[{"en":"In 19th-century Ireland, many cottiers struggled to pay rent after poor harvests.","zh":"在19世纪的爱尔兰，许多小屋佃农在歉收后难以支付地租。"},{"en":"The novel describes a village of cottiers living in one-room cottages.","zh":"小说描写了一个由小屋佃农组成的村庄，他们住在一间房的小屋里。"}]}],"synonyms":["tenant farmer","smallholder","peasant (historical context)"],"phonetic":"/ˈkɑːtiər/","extraExplanation":["“cottier”来自“cottage（小屋）”。这个词多见于历史、社会学或文学语境，常与爱尔兰大饥荒前后的农村阶层、土地制度有关。现代日常英语里很少用，读到时可理解为“靠租小屋/小地块维生的贫困佃农”。","拼写与形态：单数 cottier，复数 cottiers（你输入的是复数）。"]}
{"word":"cottiest","summary":{"en":"“Cottiest” means “most cottage-like,” describing something very small, cozy, simple, and rustic.","zh":"“cottiest”意为“最具乡村小屋风格/氛围的”，强调小巧、温馨、朴素、质朴的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Most like a cottage; having the strongest “cottage-like” feeling (small, simple, cozy, rustic).","zh":"最像小屋（乡村小屋）风格的；最具“小屋感”（小巧、朴素、温馨、质朴）的。"},"examples":[{"en":"Of all the houses on the street, this one feels the cottiest, with its small porch and flower boxes.","zh":"这条街上所有房子里，这一栋最有小屋风格：小门廊加上窗台花箱。"},{"en":"She chose the cottiest room for reading—soft light, warm blankets, and a little wooden table.","zh":"她选了最有小屋氛围的房间来阅读——柔和的灯光、暖毯子和一张小木桌。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) Most suitable for or typical of cottages/cottage life.","zh":"（较少见）最适合小屋生活的；最符合小屋生活特点的。"},"examples":[{"en":"A small garden and a kettle on the stove are the cottiest comforts for a quiet weekend.","zh":"一个小花园和炉子上的水壶，是安静周末里最有“小屋感”的舒适元素。"}]}],"synonyms":["most cottage-like","rustiest","coziest","most quaint","most homey"],"phonetic":"/ˈkɑtiɪst/","extraExplanation":["“cottiest”是形容词“cotty”的最高级（cotty → cottier → cottiest），但在现代英语里非常少见。更常见的表达是“most cottage-like”“most rustic”“coziest（最舒适温暖的）”“most homely（英式英语里可指温馨的；美式英语里homely常指‘相貌普通’）”。","在家居与审美语境中，类似概念常用“cottagecore（田园小屋风）”“cottage-style（乡村小屋风格）”来表达。"]}
{"word":"cottiform","summary":{"en":"Cottiform means “shaped like a cotta,” i.e., broad and flaring like a short robe (rare, technical).","zh":"Cottiform 指“像 cotta（短款法衣）那样的形状”，常暗示下部外展、呈短袍状（罕见、偏术语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, technical) Having the shape of a cotta (a short, loose clerical robe); broad and flaring outward, like a small tunic.","zh":"（罕见/术语）呈“cotta（短款宽松的教士外衣）”那样的形状；通常指上部较窄、下部外展、像小短袍一样的轮廓。"},"examples":[{"en":"In older anatomical descriptions, a structure may be called cottiform if it widens and flares toward the bottom.","zh":"在较早的解剖学描述中，如果某个结构下部逐渐变宽并外展，可能会被称为 cottiform。"},{"en":"The author described the shell opening as cottiform, meaning it looked like a small flaring garment.","zh":"作者把贝壳的开口描述为 cottiform，意思是它像一件下摆外展的小短袍。"}]}],"synonyms":["cotta-shaped","flaring","tuniclike","robe-shaped"],"phonetic":"/ˈkɑtɪˌfɔrm/","extraExplanation":["词源上可拆为 **cotta（短外衣/法衣）+ -form（“……形状的”）**。因此它多见于较旧或较专业的写作（如形态学、解剖学、博物学描述），日常英语几乎不用。阅读时可把它理解为“像短袍那样下摆外扩的形状”。"]}
{"word":"cottise","summary":{"en":"A heraldry term meaning a thin stripe placed parallel to a main band or figure on a coat of arms.","zh":"纹章学用语：指与主纹章带状图形平行的一条细窄陪衬饰带。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Heraldry) A narrow band (a thin stripe) placed alongside and parallel to a main band or other heraldic figure, used as a decorative border or accompaniment.","zh":"（纹章学）紧贴并平行于主纹章图形（如斜带、横带等）的一条细窄饰带，用作陪衬或装饰性边带。"},"examples":[{"en":"In the coat of arms, the bend is cottised by two thin lines.","zh":"在这枚纹章中，斜带两侧各有一条细线作陪衬（即被两条“cottise”夹衬）。"},{"en":"The shield shows a pale cottise on each side for emphasis.","zh":"盾面上主竖带两侧各加一条细窄陪衬带，以增强视觉效果。"}]}],"synonyms":["(heraldry) narrow stripe","(heraldry) edging (near-parallel)"],"phonetic":"/kɑˈtiːz/","extraExplanation":["“cottise”是较少见的纹章学术语，常见搭配是“a bend cottised”（斜带两侧各有细窄陪衬带）或“cottised”（表示“带有两条细窄陪衬带”的形容词/过去分词用法）。","词源上与法语纹章术语有关（类似 *cotice* 一类形式）。在现代日常英语里几乎不用，主要出现在纹章说明（blazon）或相关历史文献中。"]}
{"word":"Cottle","summary":{"en":"“Cottle” is most commonly a surname; rarely, it can be an archaic spelling of “cuttle” (cuttlefish).","zh":"“Cottle”最常见为姓氏；少数情况下是“cuttle（乌贼）”的古旧拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname).","zh":"（常见于英语国家的）姓氏。"},"examples":[{"en":"Dr. Cottle will see you now.","zh":"Cottle 医生现在可以见你了。"},{"en":"Her last name is Cottle.","zh":"她的姓是 Cottle。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare/archaic) an old spelling or variant of “cuttle” (a cuttlefish).","zh":"（罕见/古旧）“cuttle”的旧拼写或变体，指“乌贼/墨鱼”。"},"examples":[{"en":"In older texts, you may see “cottle” used where we would now write “cuttlefish.”","zh":"在较旧的文本里，你可能会看到用“cottle”来表示我们现在写的“cuttlefish（乌贼）”。"}]}],"synonyms":["(surname) —","(archaic noun) cuttle","cuttlefish"],"phonetic":"/ˈkɑtəl/","extraExplanation":["在现代英语里，Cottle 更常见的是姓氏；作为普通名词“cottle”非常少见，通常只会出现在古旧拼写、方言或历史文本中。"]}
{"word":"Cottleville","summary":{"en":"Cottleville is a city in Missouri, USA, near St. Louis.","zh":"Cottleville 是美国密苏里州圣路易斯附近的一座城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in St. Charles County, Missouri, in the United States (part of the St. Louis metropolitan area).","zh":"美国密苏里州圣查尔斯县的一座城市（属于圣路易斯都会区的一部分）。"},"examples":[{"en":"We drove to Cottleville for dinner after work.","zh":"下班后我们开车去科特尔维尔吃晚饭。"},{"en":"Cottleville is a small community near St. Louis.","zh":"科特尔维尔是圣路易斯附近的一个小社区。"}]}],"synonyms":["Cottleville, MO"],"phonetic":"/ˈkɑtəlˌvɪl/","extraExplanation":["“Cottleville”是专有名词（地名），一般不翻译含义，中文多按读音译作“科特尔维尔”。","它位于密苏里州东部、靠近圣路易斯；写作时常与“Missouri / MO”或“St. Charles County”一起出现以便读者定位。"]}
{"word":"cottoid","summary":{"en":"Cottoid is a very rare adjective meaning “terracotta-like” or “resembling baked clay.”","zh":"cottoid 是非常罕见的形容词，意为“赤陶般的/类似烧制陶土的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) resembling terracotta or baked clay; having a baked-clay look or color.","zh":"（罕见）类似陶土/赤陶（terracotta）的；带有烧制陶土的质感或颜色。"},"examples":[{"en":"The designer chose a cottoid tile to give the kitchen a warm, rustic feel.","zh":"设计师选用了带赤陶质感的瓷砖，让厨房呈现温暖、质朴的氛围。"},{"en":"In the afternoon light, the walls took on a cottoid hue.","zh":"在午后的光线下，墙面呈现出一种赤陶般的色调。"}]}],"synonyms":["terracotta","clay-colored","earthen","rust-colored"],"phonetic":"/ˈkɑtɔɪd/","extraExplanation":["“cottoid”非常少见，不属于常用词汇；很多情况下可能是写作者临时造词，或想表达“terracotta-like / clay-colored（赤陶般的/陶土色的）”。","如果你是在材料、室内设计或艺术语境里看到它，更常见、也更地道的表达是：terracotta, terracotta-colored, clay-colored, earthen（带泥土色调的）。","词形上 -oid 常表示“……状/类似……”，如 android（类人）、asteroid（小行星）。因此 cottoid 可理解为“像 cotto（意大利语，‘烤/烧制’；也常见于 cotto tile 指赤陶砖）一样的”。"]}
{"word":"Cotton","summary":{"en":"Cotton is a natural fiber (and fabric) used for clothing; informally, to “cotton on (to)” means to understand or notice something.","zh":"Cotton 指棉花/棉纤维或棉布；口语中 “cotton on (to)” 表示开始明白或察觉到某事。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a soft, white natural fiber from the cotton plant, used to make thread, fabric, and other products","zh":"棉花；棉纤维（来自棉花植物的柔软白色天然纤维，用于纺线、织布等）"},"examples":[{"en":"This shirt is made of 100% cotton.","zh":"这件衬衫是100%纯棉的。"},{"en":"Cotton is comfortable to wear in hot weather.","zh":"棉质衣物在热天穿起来很舒服。"}]},{"partOfSpeech":"n.","definition":{"en":"cloth made from cotton fiber","zh":"棉布；棉织物"},"examples":[{"en":"She bought a roll of cotton for sewing.","zh":"她买了一卷棉布来缝纫。"},{"en":"Light cotton curtains let in soft sunlight.","zh":"轻薄的棉质窗帘能让柔和的阳光透进来。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal) to begin to understand something or to start liking someone or something","zh":"（非正式）开始明白；开始喜欢/接受（某人或某事）"},"examples":[{"en":"It took me a while to cotton on to the joke.","zh":"我过了一会儿才明白那个笑话。"},{"en":"He didn’t cotton to the new plan at first.","zh":"他一开始并不喜欢/不太接受这个新计划。"}]}],"synonyms":["fiber","cloth","fabric","catch on (to)","figure out"],"phonetic":"/ˈkɑtən/","extraExplanation":["“cotton on (to sth)”常见于英式口语，意思是“突然明白、察觉到”。在美式英语里也能听到，但更常用的表达包括“figure out”“catch on”“realize”。","棉花在英语文化与历史中常与纺织业、农业与贸易联系紧密；在阅读历史文本时，cotton 可能涉及工业革命、南方种植园等背景（具体语境需结合文章判断）。"]}
{"word":"cotton","summary":{"en":"Cotton is a natural soft fiber used for fabric; it can also mean cotton cloth, and as a verb it can mean to like or understand (cotton to).","zh":"Cotton 常指棉花/棉纤维，也可指棉布；作动词时（cotton to）可表示喜欢、接受或领会。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a soft, white natural fiber that grows around the seeds of the cotton plant, used to make cloth and thread","zh":"棉花；棉纤维（长在棉籽周围的柔软白色天然纤维，用于纺线和织布）"},"examples":[{"en":"This shirt is made of 100% cotton.","zh":"这件衬衫是100%纯棉的。"},{"en":"Cotton is used to make towels, jeans, and bedsheets.","zh":"棉花常用来做毛巾、牛仔裤和床单。"}]},{"partOfSpeech":"n.","definition":{"en":"cloth or thread made from cotton fiber","zh":"棉布；棉线（由棉纤维制成的布料或线）"},"examples":[{"en":"She bought cotton to sew a summer dress.","zh":"她买了棉布来缝一条夏装连衣裙。"}]},{"partOfSpeech":"v.","definition":{"en":"to begin to like, understand, or agree with someone or something (often used with “to”)","zh":"喜欢上；理解并接受；赞同（常与 to 连用）"},"examples":[{"en":"I didn’t cotton to his rude attitude.","zh":"我不喜欢他那种粗鲁的态度。"},{"en":"She quickly cottoned to the new routine.","zh":"她很快就适应并理解了新的日常安排。"}]}],"synonyms":["cotton fiber","cotton cloth","take to","catch on (to)"],"phonetic":"/ˈkɑtən/","extraExplanation":["“Cotton”作名词时在美国文化与历史中很常见：棉花曾长期是美国南方的重要经济作物，也与奴隶制历史紧密相关。阅读历史材料时，常会看到“cotton plantations（棉花种植园）”“cotton gin（轧棉机）”等词。","动词用法“to cotton to”较偏口语、带一点老派色彩，意思接近“take to/like”或“catch on to（领会）”。"]}
{"word":"cottonade","summary":{"en":"Cottonade is a strong cotton fabric, often twill-woven, used especially for practical clothing.","zh":"Cottonade 指一种结实的棉质布料（常为斜纹织），多用于耐穿的实用服装。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sturdy fabric made mainly of cotton, often woven in a twill pattern and sometimes used as a cheaper substitute for wool or for work clothes","zh":"一种结实的棉质布料，常为斜纹织法，有时用作羊毛的较便宜替代品或用于工作服"},"examples":[{"en":"The jackets were made of cottonade, so they were durable and easy to wash.","zh":"这些夹克是用棉斜纹布（cottonade）做的，所以很耐穿也容易清洗。"},{"en":"In the past, cottonade was common for everyday clothing because it cost less than wool.","zh":"过去棉斜纹布很常用于日常衣物，因为它比羊毛更便宜。"}]}],"synonyms":["cotton twill","twill","drill (fabric)","denim (similar fabric)"],"phonetic":"/ˌkɑtənˈeɪd/","extraExplanation":["cottonade 是一个较少见、偏历史/纺织领域的词，常出现在旧式服装、贸易或历史文本中。","词形来自 cotton（棉）+ 类似 “-ade” 的构词形式，用来表示一种制品/材料；现代更常见的近义表达是 “cotton twill（棉斜纹布）” 或按用途称 “workwear fabric（工装面料）”。"]}
{"word":"cottonbush","summary":{"en":"“Cottonbush” is a common name for a shrub/plant with cotton-like fluff; the exact species depends on the region.","zh":"“cottonbush”是带棉絮状绒毛的灌木/植物的俗名；具体指哪种植物因地区而异。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a shrub or small plant commonly called a “cottonbush,” usually because it has soft, cotton-like fibers or fluffy seed heads (the exact species can vary by region).","zh":"“cottonbush（棉灌木/棉丛）”的俗名，通常指一种灌木或小型植物，因为它带有像棉花一样柔软的纤维或蓬松的种子绒；具体指哪一种植物会因地区而不同。"},"examples":[{"en":"In late summer, the cottonbush looks like it’s covered in white fluff.","zh":"到了夏末，cottonbush 看起来像被一层白色绒毛覆盖。"},{"en":"Some parks remove cottonbush near paths because the fluffy seeds spread easily.","zh":"有些公园会在小路附近清除 cottonbush，因为它的绒毛种子很容易扩散。"}]}],"synonyms":["cotton bush","fluff-seeded shrub","downy shrub"],"phonetic":"ˈkɑtənˌbʊʃ","extraExplanation":["“cottonbush”多为口语化的植物俗名，不像学名那样唯一对应某个物种。不同国家/地区可能用它指代不同植物（常见特征是“棉絮状”的花或种子）。如果你能提供出现它的句子或所在地区/语境，我可以帮你更精确地对应可能的植物。","拼写上也常见分开写作 cotton bush。"]}
{"word":"Cottondale","summary":{"en":"Cottondale is a U.S. place name, most often referring to a community in Alabama.","zh":"Cottondale 是美国的地名，最常指阿拉巴马州的一个社区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name in the United States (most commonly referring to Cottondale, Alabama), used as a proper noun for a town or community.","zh":"美国的地名（最常见指阿拉巴马州的 Cottondale），作为专有名词表示一个城镇或社区。"},"examples":[{"en":"She grew up in Cottondale, Alabama, before moving to Birmingham.","zh":"她在阿拉巴马州的 Cottondale 长大，后来搬到伯明翰。"},{"en":"We stopped in Cottondale for gas on our way to Tuscaloosa.","zh":"去塔斯卡卢萨的路上，我们在 Cottondale 停下来加油。"}]}],"synonyms":["(proper noun) — no true synonyms; often specified as “Cottondale, Alabama” or “Cottondale, Florida”"],"phonetic":"/ˈkɑtənˌdeɪl/","extraExplanation":["Cottondale 是专有名词，通常不翻译；写作时首字母大写。","这个地名常见于美国南方，名称里 cotton（棉花）反映了当地历史上与棉花种植或棉花产业的关联。","美国不止一个地方叫 Cottondale（例如阿拉巴马州、佛罗里达州等）。在地址或说明中常与州名/县名一起出现以避免混淆。"]}
{"word":"cottoned","summary":{"en":"“Cottoned” most often appears in “cotton on” (realize/understand) and “cotton to” (start to like).","zh":"“Cottoned”多见于“cotton on”（终于明白/察觉）和“cotton to”（开始喜欢/有好感）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Usually in the phrase “cotton on”) to realize or understand something, often after a delay.","zh":"（常用于短语“cotton on”）终于明白/意识到某事，常带“后知后觉”的感觉。"},"examples":[{"en":"She finally cottoned on that the meeting had been canceled.","zh":"她终于意识到会议被取消了。"},{"en":"It took me a while to cotton on to what he meant.","zh":"我花了一会儿才明白他是什么意思。"}]},{"partOfSpeech":"v.","definition":{"en":"(Usually in the phrase “cotton to”) to begin to like someone or something; to take to someone/something.","zh":"（常用于短语“cotton to”）开始喜欢/欣赏某人或某物；对……产生好感。"},"examples":[{"en":"The new puppy cottoned to my brother right away.","zh":"那只新小狗立刻就喜欢上了我哥哥。"},{"en":"I didn’t cotton to the idea at first, but now it makes sense.","zh":"我一开始并不喜欢这个想法，但现在觉得有道理了。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare, literal) to stick, cling, or become closely attached (as if with cotton).","zh":"（较少见，字面义）黏住、缠住；紧紧附着（像棉絮一样）。"},"examples":[{"en":"Lint cottoned to the sweater after it came out of the dryer.","zh":"毛衣从烘干机里拿出来后粘上了绒毛。"}]}],"synonyms":["caught on","figured out","realized","took to","warmed to"],"phonetic":"/ˈkɑtənd/","extraExplanation":["“cottoned”是动词“cotton”的过去式/过去分词。现代英语里它最常见于口语短语：\n- cotton on (to sth)：终于明白、察觉\n- cotton to sb/sth：开始喜欢、对……有好感\n这两个用法都偏英式英语，在美式英语里也能听到，但有时会用“catch on”“figure out”“take to”来替换。"]}
{"word":"cottonee","summary":{"en":"Cottony means ‘like cotton’—soft, fluffy, or giving a dry ‘cotton in the mouth’ feeling.","zh":"Cottony 意为“像棉花一样”——柔软蓬松，或形容嘴巴干、像含着棉花的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the texture or appearance of cotton; soft, fluffy, or fibrous.","zh":"像棉花一样的；柔软蓬松的；带纤维感的。"},"examples":[{"en":"The clouds looked cottony in the afternoon light.","zh":"下午的光线下，云看起来像棉花一样蓬松。"},{"en":"She wore a cottony sweater that felt soft against her skin.","zh":"她穿着一件带棉絮般柔软触感的毛衣，贴着皮肤很舒服。"},{"en":"After the medicine, I had a cottony feeling in my mouth.","zh":"吃了药以后，我嘴里有种干干的、像塞了棉花一样的感觉。"}]}],"synonyms":["fluffy","soft","downy","woolly","fibrous"],"phonetic":"/ˈkɑtəni/","extraExplanation":["“cottonee”一般不是标准拼写；你很可能想写的是 **cottony**。在口语里也常说 “a cotton mouth / cottonmouth”（嘴巴很干、像含着棉花）。","词尾 **-y** 常表示“具有……的特征”（如 *cloudy* 多云的，*dusty* 多灰尘的），所以 *cottony* 就是“具有棉花特征的”。"]}
{"word":"cottoneer","summary":{"en":"A cottoneer is someone who works in the cotton business, especially as a cotton merchant.","zh":"cottoneer 指从事棉花行业的人，尤指棉花商人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who grows, processes, manufactures, or trades cotton (especially a cotton merchant or someone in the cotton industry)","zh":"从事棉花种植、加工、制造或贸易的人（尤指棉花商人或棉业从业者）"},"examples":[{"en":"In the 1800s, many cottoneers became wealthy as global demand for cotton increased.","zh":"在19世纪，随着全球对棉花需求上升，许多棉业从业者变得富有。"},{"en":"The cottoneer negotiated prices with buyers from overseas.","zh":"那位棉花商与海外买家谈判价格。"},{"en":"She studied how cottoneers shaped the local economy.","zh":"她研究棉业从业者如何影响当地经济。"}]}],"synonyms":["cotton merchant","cotton trader","cotton dealer","cotton manufacturer"],"phonetic":"/ˌkɑtənˈɪr/","extraExplanation":["“cottoneer”由 cotton（棉花）+ 后缀 -eer 组成，-eer 常表示“从事某种职业的人”（如 engineer、auctioneer）。这个词在现代日常英语中不算常见，更常见的表达是 cotton merchant（棉花商）、cotton trader（棉花交易商）或 cotton manufacturer（棉纺/棉花制造业者）。","在历史与社会语境里，棉花产业与殖民贸易、工业革命以及美国南方的种植园经济等议题密切相关；阅读相关文本时，理解这一背景有助于把握作者的态度与时代氛围。"]}
{"word":"cottoner","summary":{"en":"Cottoner usually means a person who works with cotton; more rarely, it can mean a machine used to process cotton.","zh":"Cottoner 通常指从事棉花相关工作的人；较少情况下也可指加工棉花的机器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who grows, picks, or works with cotton (often in farming or the cotton industry)","zh":"种植、采摘或从事棉花相关工作的人（多指农业或棉纺行业从业者）"},"examples":[{"en":"In the early 1900s, many cottoners in the South worked long days during harvest season.","zh":"在20世纪初，美国南部许多采棉工在收获季要工作很长时间。"},{"en":"The museum tells the story of cottoners and mill workers who helped build the local economy.","zh":"这家博物馆讲述了棉花从业者和纺织工人如何推动当地经济发展的故事。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a machine or tool used in processing cotton, especially for cleaning or preparing fibers","zh":"（罕见）用于加工棉花的机器或工具，尤指清理或预处理棉纤维的设备"},"examples":[{"en":"The factory replaced its old cottoner with a modern fiber-cleaning system.","zh":"工厂用现代的纤维清洁系统替换了旧式棉花处理机。"}]}],"synonyms":["cotton farmer","cotton picker","cotton worker","mill worker"],"phonetic":"/ˈkɑtənər/","extraExplanation":["“cottoner”在现代英语里不算常见；更常见的说法有“cotton farmer（棉农）”“cotton picker（采棉工/采棉机）”“cotton gin（轧花机）”。","词形上是“cotton + -er”，表示“从事棉花相关的人/物”。在阅读历史题材（如美国南方农业、纺织工业）时更可能遇到这个词。"]}
{"word":"Cottonian","summary":{"en":"Cottonian usually means “connected with Sir Robert Cotton and the Cotton manuscripts/collection.”","zh":"Cottonian 通常指“与科顿爵士及其科顿手稿/藏书有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Sir Robert Cotton (1571–1631), his library/collection, or manuscripts once owned by him (often called the Cotton manuscripts).","zh":"（形容词）与罗伯特·科顿爵士（Sir Robert Cotton）及其图书馆/藏书有关的；尤指曾归其收藏的“科顿手稿”（Cotton manuscripts）。"},"examples":[{"en":"The British Library holds many Cottonian manuscripts, including the famous Beowulf manuscript.","zh":"大英图书馆保存着许多科顿手稿，其中包括著名的《贝奥武夫》手稿。"},{"en":"The scholar compared Cottonian and other medieval sources to check the wording of the text.","zh":"这位学者把科顿手稿与其他中世纪资料进行对照，以核对文本措辞。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a person connected with Cotton’s library or a specialist in the Cotton manuscripts.","zh":"（较少用）与科顿图书馆有关的人；研究科顿手稿的专家。"},"examples":[{"en":"As a Cottonian, she was familiar with the catalog system used for the collection.","zh":"作为研究科顿手稿的人，她很熟悉该藏书使用的编目体系。"}]}],"synonyms":["Cotton (attributive)","of the Cotton collection","Cotton manuscript-related"],"phonetic":"/kɑˈtoʊniən/","extraExplanation":["“Cottonian”来自人名 Cotton + 形容词后缀 -ian（表示“与……有关/属于……的人或事物”）。","科顿手稿的编号常用“书柜/层板/书号”的方式（例如：Cotton Vitellius A.xv），这是英美中世纪文献研究里很常见的引用格式。"]}
{"word":"cottonian","summary":{"en":"Cottonian usually means “connected with Sir Robert Cotton or the Cotton (Cottonian) Library manuscripts.”","zh":"Cottonian通常指“与罗伯特·科顿爵士或科顿（科顿文库）手稿收藏有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Sir Robert Cotton (1571–1631) or to the Cotton (Cottonian) Library and its famous manuscript collection.","zh":"与罗伯特·科顿爵士（Sir Robert Cotton）或“科顿（Cottonian）图书馆/科顿文库”及其著名手稿收藏有关的。"},"examples":[{"en":"The Cottonian manuscripts include some of the most important early English texts.","zh":"科顿文库的手稿包含了一些最重要的早期英语文本。"},{"en":"Scholars often cite a Cottonian source when discussing Anglo-Saxon England.","zh":"学者在讨论盎格鲁-撒克逊时期的英格兰时，常会引用科顿文库的资料。"}]},{"partOfSpeech":"n.","definition":{"en":"A person connected with, studying, or working on the Cottonian manuscripts or collection (rare).","zh":"与科顿文库手稿/收藏有关的人；研究或整理科顿文库的人（较少用）。"},"examples":[{"en":"As a Cottonian, she spent years transcribing damaged parchment pages.","zh":"作为一名研究科顿文库的人，她花了多年誊写受损的羊皮纸页面。"}]}],"synonyms":["Cotton","Cotton-library (contextual)","manuscript-related (contextual)"],"phonetic":"/kɑˈtoʊniən/","extraExplanation":["“Cottonian”最常见于学术写作与图书馆编目语境，指英国收藏家Sir Robert Cotton建立并传世的手稿收藏。","科顿文库里有许多重量级文献，例如《贝奥武夫》（Beowulf）所在的手稿常被称为“Cotton Vitellius A.xv”（这类编号体系也常被视作“Cottonian”相关背景知识）。"]}
{"word":"cottoning","summary":{"en":"“Cottoning” most often appears in “cotton on/to,” meaning to realize/understand something or to start liking something.","zh":"“Cottoning”多见于短语“cotton on/to”，表示“意识到/明白”或“开始喜欢上”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of cotton) to begin to understand what is happening; to realize something (often in the phrase “cotton on”).","zh":"（cotton 的现在分词）开始明白发生了什么；意识到某事（常用于短语“cotton on”）。"},"examples":[{"en":"She finally started cottoning on to the joke.","zh":"她终于开始明白这个笑话的点了。"},{"en":"It took me a while to cotton on that he was teasing me.","zh":"我过了一会儿才意识到他是在逗我。"}]},{"partOfSpeech":"v.","definition":{"en":"(present participle of cotton) to start to like someone or something; to take to something (often “cotton to”).","zh":"（cotton 的现在分词）开始喜欢某人或某物；渐渐对……产生好感（常用于“cotton to”）。"},"examples":[{"en":"He’s cottoning to the new teacher.","zh":"他开始喜欢这位新老师了。"},{"en":"I never really cottoned to that TV show.","zh":"我一直没怎么喜欢那部电视剧。"}]}],"synonyms":["catching on","realizing","figuring out","taking to","warming to"],"phonetic":"/ˈkɑtənɪŋ/","extraExplanation":["“cotton to/on”是偏口语的用法，在英式英语中更常见一些。意思不是“棉花”，而是引申为“（像棉花一样）黏上、贴近”，进一步发展成“对……产生好感/开始理解”。","常见搭配：cotton on (to something)＝察觉/明白；cotton to (someone/something)＝喜欢上/对……有好感。"]}
{"word":"cottonization","summary":{"en":"Cottonization is an industrial process that modifies certain plant fibers to behave more like cotton for easier spinning and blending.","zh":"Cottonization（棉化）指一种工业处理工艺，使某些植物纤维更像棉纤维，从而更易纺纱与混纺。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The industrial process of making plant fibers (especially flax, hemp, jute, or other bast fibers) more like cotton—shorter, softer, cleaner, and easier to spin on cotton machinery.","zh":"（工业）将植物纤维（尤指亚麻、工业大麻、黄麻等韧皮纤维）处理得更像棉纤维——更短、更柔软、更洁净，从而更适合用棉纺设备纺纱的过程。"},"examples":[{"en":"Cottonization helps flax fibers run more smoothly on cotton spinning machines.","zh":"棉化处理能让亚麻纤维在棉纺机上运行得更顺畅。"},{"en":"The mill uses mechanical cottonization to reduce fiber length and remove woody bits.","zh":"该工厂采用机械棉化处理来缩短纤维并去除木质杂质。"},{"en":"After cottonization, the hemp is blended with cotton to make softer fabric.","zh":"棉化处理后，工业大麻纤维会与棉混纺，以做出更柔软的面料。"}]}],"synonyms":["cottonizing (process)","fiber cottonization","cottonized-fiber processing"],"phonetic":"/ˌkɑtənəˈzeɪʃən/","extraExplanation":["“cottonization”主要用于纺织与材料工程语境，日常英语里不常见。常见搭配：cottonization process（棉化工艺）、mechanical/chemical cottonization（机械/化学棉化）、cottonized flax/hemp（棉化亚麻/棉化大麻）。","概念上，它并不是“变成棉花”，而是通过梳理、切断、脱胶/去木质化等处理，让原本较长、较硬、含胶质的韧皮纤维更接近棉纤维的可纺性，便于与棉混纺或直接走棉纺体系。"]}
{"word":"cottonize","summary":{"en":"Cottonize means to make a fiber/material more cotton-like (soft and spinnable), or to become cotton-like.","zh":"Cottonize 指把纤维/材料处理成更像棉（更柔软、更适合纺纱），也可指材料变得棉絮状。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to treat a fiber or material so that it becomes softer, more like cotton, or suitable for spinning like cotton (often in textile manufacturing).","zh":"（纺织业）对纤维/材料进行处理，使其更柔软、更像棉，或变得适合像棉一样纺纱。"},"examples":[{"en":"The factory cottonized flax so it could be spun on cotton equipment.","zh":"工厂把亚麻进行棉化处理，使其可以用棉纺设备来纺纱。"},{"en":"Some recycled fibers are cottonized to improve softness and usability.","zh":"一些回收纤维会进行棉化处理，以提升柔软度和可用性。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become soft, fluffy, or cotton-like in texture.","zh":"变得柔软、蓬松，呈现棉絮状质地。"},"examples":[{"en":"After repeated washing, the fabric began to cottonize at the surface.","zh":"反复清洗后，这种布料表面开始出现棉絮化的现象。"},{"en":"Low-quality yarn may cottonize and pill more easily.","zh":"质量较差的纱线更容易棉絮化并起球。"}]}],"synonyms":["soften","make cotton-like","process (fibers)","cottonise"],"phonetic":"/ˈkɑːtənˌaɪz/","extraExplanation":["“cottonize / cottonise”多见于纺织与材料领域，属于相对专业的用词；日常英语里更常用“make it softer / make it more cotton-like / soften the fibers”等表达。","棉化处理常用于亚麻（flax）、黄麻（jute）、大麻纤维（hemp）等：通过机械开松、化学或酶处理等手段，让纤维更短更柔、更易梳理，从而能在棉纺系统中加工。"]}
{"word":"cottonless","summary":{"en":"“Cottonless” means made without cotton or containing no cotton.","zh":"“cottonless”表示“不含棉/不用棉制成的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not containing cotton; made without cotton; lacking cotton.","zh":"不含棉的；不用棉制成的；缺少棉的。"},"examples":[{"en":"The clinic uses cottonless gauze for patients with sensitive skin.","zh":"这家诊所给皮肤敏感的病人使用不含棉的纱布。"},{"en":"I bought cottonless socks because I wanted a fabric that dries faster.","zh":"我买了不含棉的袜子，因为我想要更快干的面料。"}]}],"synonyms":["cotton-free","non-cotton","without cotton"],"phonetic":"/ˈkɑtənləs/","extraExplanation":["“cottonless”不是特别常见的日常词，更常出现在产品说明或技术/医疗语境里（如 cottonless swabs 不含棉的棉签/拭子）。","后缀 “-less” 表示“没有……/缺少……”。例如：wireless（无线的）、sugarless（无糖的）、homeless（无家可归的）。"]}
{"word":"cottonmouth","summary":{"en":"“Cottonmouth” most commonly means a venomous water snake in North America; it can also mean an extremely dry mouth.","zh":"“cottonmouth”最常指北美一种有毒的水蝮（棉口蛇）；也可指严重口干。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A venomous North American pit viper (a type of water moccasin) that often lives near water; it may show a white mouth interior as a warning display.","zh":"（北美）棉口蛇／水蝮（一种有毒的响尾蝮亚科蝰蛇），常栖息在水边；张口时会露出白色口腔作为警告。"},"examples":[{"en":"We saw a cottonmouth sunning itself on a log near the creek.","zh":"我们看到一条棉口蛇在小溪旁的木头上晒太阳。"},{"en":"If you’re hiking near wetlands, watch where you step—cottonmouths can be hard to spot.","zh":"在湿地附近徒步时要注意脚下——棉口蛇有时不容易发现。"}]},{"partOfSpeech":"n.","definition":{"en":"A very dry mouth (often from dehydration, anxiety, illness, or certain medicines).","zh":"口干舌燥（常因缺水、焦虑、生病或某些药物引起）。"},"examples":[{"en":"After the long flight, I had terrible cottonmouth and drank two bottles of water.","zh":"长途飞行后我口干得厉害，喝了两瓶水。"},{"en":"Public speaking gives me cottonmouth, so I keep water nearby.","zh":"公开演讲会让我口干，所以我会把水放在旁边。"}]}],"synonyms":["water moccasin","dry mouth"],"phonetic":"/ˈkɑtənˌmaʊθ/","extraExplanation":["“Cottonmouth”作蛇名时，也常被称为“water moccasin”。它得名于张口防御时露出的白色口腔内壁，看起来像“棉花”。","作“口干”义时更偏口语，在医疗语境也可能会用到（例如某些药物的副作用），但更正式的说法常用“dry mouth”。"]}
{"word":"cottonmouths","summary":{"en":"“Cottonmouths” can mean (1) venomous water-dwelling snakes in North America, or (2) the condition of having a very dry mouth.","zh":"“cottonmouths”可指（1）北美水边生活的有毒蛇类“棉口蛇/水蝮”，也可指（2）“口干”的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A venomous North American pit viper (also called a water moccasin) that often lives near water; known for showing a white, “cotton-like” mouth when threatened.","zh":"一种北美有毒的蝮蛇（也叫水蝮、棉口蛇），常生活在水边；受威胁时会张口露出白色、像“棉花”的口腔内壁。"},"examples":[{"en":"Cottonmouths are often found near swamps, ponds, and slow-moving rivers in the southeastern U.S.","zh":"在美国东南部，棉口蛇常出没于沼泽、池塘和水流缓慢的河段附近。"},{"en":"The hiker backed away slowly after spotting a cottonmouth on the bank.","zh":"徒步者在岸边发现一条棉口蛇后，慢慢后退。"}]},{"partOfSpeech":"n.","definition":{"en":"Dry mouth (a lack of saliva), often caused by dehydration, anxiety, or certain medicines.","zh":"口干（唾液分泌不足），常由缺水、焦虑或某些药物引起。"},"examples":[{"en":"After the long flight, she had a bad case of cottonmouth.","zh":"长途飞行后，她口干得厉害。"},{"en":"Coffee can make my cottonmouth worse if I don’t drink enough water.","zh":"如果不喝够水，咖啡会让我更口干。"}]}],"synonyms":["water moccasins","dry mouth"],"phonetic":"/ˈkɑtənˌmaʊðz/","extraExplanation":["“cottonmouth”既可以指蛇，也可以指“口干”。在口语里说“I have cottonmouth”通常是指口干；而在自然、户外或动物语境中说“a cottonmouth”多半指蛇。","蛇的“棉口”来自其受威胁时张口露出白色口腔内壁的特征；中文里常译作“棉口蛇”，也常见名称“水蝮（water moccasin）”。","复数形式是 cottonmouths：/ˈkɑtənˌmaʊðz/（在句中常读作以 z 结尾的音）。"]}
{"word":"cottonocracy","summary":{"en":"“Cottonocracy” means the cotton-plantation elite who dominated the pre–Civil War American South, or the system of their rule.","zh":"“cottonocracy”指（美国内战前南方）掌控权力的棉花种植园主精英集团，或他们的统治体系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small group of powerful cotton plantation owners (especially in the pre–Civil War American South) who dominated politics, society, and the economy; the system of their rule.","zh":"（尤指美国内战前南方）掌控政治、社会与经济的棉花种植园主统治集团；也指他们的统治体制。"},"examples":[{"en":"In many history books, “cottonocracy” describes the planters whose wealth and influence shaped Southern politics.","zh":"在许多历史书中，“cottonocracy”指那些用财富与影响力塑造南方政治的种植园主。"},{"en":"The rise of the cottonocracy was closely tied to slavery and the global demand for cotton.","zh":"“棉花贵族”的兴起与奴隶制度以及全球对棉花的需求密切相关。"}]}],"synonyms":["planter elite","planter class","Southern planters","slaveholding elite"],"phonetic":"/ˌkɑtənˈɑkrəsi/","extraExplanation":["这个词由 cotton（棉花）+ -ocracy（“……统治/政体”，如 democracy 民主、aristocracy 贵族统治）构成，带有明显的批判或讽刺色彩，常用于历史写作与社会评论。","语境上通常指19世纪美国南方的“大种植园主阶层”（planter elite）。他们的经济基础依赖棉花出口与被奴役劳动，因此该词常与 slavery（奴隶制度）、plantation system（种植园制度）一起出现。","相关近义表达（更常见/更中性）：planter class（种植园主阶层）、Southern planters（南方种植园主）；相关词：slaveholding elite（蓄奴精英，偏批判）。"]}
{"word":"Cottonopolis","summary":{"en":"“Cottonopolis” is a historical nickname for Manchester, highlighting its 19th-century dominance in the cotton-textile industry.","zh":"“Cottonopolis”是曼彻斯特的历史性绰号，强调其在19世纪棉纺织业的全球主导地位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a nickname for Manchester, England, especially in the 19th century, when it was a world center of cotton manufacturing and trade","zh":"“棉都”；对英格兰曼彻斯特（Manchester）的绰号，尤指19世纪其作为全球棉纺织制造与贸易中心的时期"},"examples":[{"en":"In the 1800s, Manchester was often called Cottonopolis because of its huge textile mills.","zh":"在19世纪，曼彻斯特因庞大的纺织工厂而常被称为“Cottonopolis（棉都）”。"},{"en":"The museum explains how Cottonopolis shaped the city’s growth and working-class life.","zh":"博物馆讲解了“棉都”如何塑造这座城市的发展与工人阶级生活。"}]}],"synonyms":["Manchester (historical nickname)","the cotton city"],"phonetic":"/ˌkɑtənˈɑpəlɪs/","extraExplanation":["“Cottonopolis”由 cotton（棉花）+ -opolis（源自希腊语，意为“城市”，也见于 metropolis“大都会”）构成，字面是“棉花之城”。","这个称呼常与工业革命联系在一起：曼彻斯特的棉纺业依赖全球供应链，尤其与美国南部棉花生产、跨大西洋贸易以及当时的社会问题（如劳工处境、殖民与奴隶制背景）有关。现代写作中使用该词，往往带有历史回望与批判反思的语气。"]}
{"word":"cottonopolis","summary":{"en":"“Cottonopolis” is a historical nickname for Manchester, highlighting its 19th‑century dominance in the cotton industry.","zh":"“Cottonopolis”是曼彻斯特的历史性别称，强调其在19世纪棉纺工业中的主导地位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a nickname for the city of Manchester (especially in the 19th century), referring to its central role in the cotton industry during the Industrial Revolution","zh":"“棉花之都/棉纺之都”，指（尤其在19世纪）工业革命时期以棉纺工业闻名的英国曼彻斯特的别称"},"examples":[{"en":"Manchester was once called “Cottonopolis” because its mills and merchants dominated the cotton trade.","zh":"曼彻斯特曾被称为“Cottonopolis”，因为它的工厂和商人主导了棉花贸易。"},{"en":"In Victorian writing, “Cottonopolis” often contrasts industrial wealth with harsh factory life.","zh":"在维多利亚时代的写作中，“Cottonopolis”常用来对比工业财富与严酷的工厂生活。"}]}],"synonyms":["Manchester (historical nickname)","the cotton capital (descriptive)"],"phonetic":"/ˌkɑːtənˈɑːpəlɪs/","extraExplanation":["“Cottonopolis”由 cotton（棉花）+ -polis（源自希腊语，意为“城市”）构成，字面意思是“棉花城市”。","它常带有历史与文化语气：一方面指工业繁荣与全球贸易网络，另一方面也让人想到烟雾、拥挤、工人劳动与社会问题等工业革命阴影。","使用场景多见于历史书写、城市研究、博物馆展陈、文学/新闻评论中；现代口语里不常用，但在谈曼彻斯特工业史时很有辨识度。"]}
{"word":"cottonpickin","summary":{"en":"“Cotton-pickin’” is an informal American intensifier meaning “damn/blasted,” and literally refers to picking cotton; it can carry uncomfortable historical associations, so use with care.","zh":"“cotton-pickin’”在美式口语中常作加强语气的词，意思近似“该死的/烦人的”，字面义是“采棉花的”；因历史联想可能令人不适，使用需谨慎。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) Used as an intensifier to show annoyance, impatience, or emphasis; similar to “damn,” “blasted,” or “darn.”","zh":"（非正式）作强调语，用来表示恼火、不耐烦或加强语气；类似“damn / blasted / darn（该死的）”。"},"examples":[{"en":"Where are my cotton-pickin’ keys?","zh":"我的该死的钥匙在哪儿？"},{"en":"I’ve been waiting all cotton-pickin’ day.","zh":"我等了一整天（真是烦死了）。"}]},{"partOfSpeech":"adj.","definition":{"en":"(literal) Related to picking cotton (removing cotton from the plant), especially by hand.","zh":"（字面）与“采棉花/摘棉花”有关，尤指用手采摘。"},"examples":[{"en":"Cotton-pickin’ work is tough and slow.","zh":"采棉花的活又累又慢。"}]}],"synonyms":["darn","blasted","damn (stronger)","annoying","pesky"],"phonetic":"ˈkɑtən ˌpɪkɪn","extraExplanation":["“cotton-pickin’”来自“picking cotton（采棉花）”。在美国英语里它常被当作温和的咒骂/感叹（minced oath），用来替代更粗鲁的脏话（如“goddamn”）。","文化敏感点：因为美国历史上采棉花与奴隶制和种族压迫有关，这个说法在某些场合可能让人不适，甚至被视为带有种族暗示。对不熟悉的听众、正式场合或跨文化交流中，建议改用更中性的表达（如“darn,” “really,” “so,” “very,” “annoying”）。"]}
{"word":"cottonpicking","summary":{"en":"“Cotton-picking” literally means related to harvesting cotton, and informally it can be a mild swear-like intensifier (often “cotton-pickin’”) meaning “damn/annoying.”","zh":"“cotton-picking”字面指“采棉的/与采棉有关的”；口语中也可作轻度咒骂或强调语气（常说cotton-pickin’），相当于“该死的/讨厌的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the harvesting of cotton (picking cotton from the plant).","zh":"与采摘棉花（从棉株上摘棉）有关的；采棉的。"},"examples":[{"en":"Cotton-picking season starts in late summer in some regions.","zh":"在一些地区，采棉季从夏末开始。"},{"en":"She took a cotton-picking job during the harvest.","zh":"她在收获期做了一份采棉的工作。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal) Used as a mild swear-word or intensifier meaning “damn” or “blasted,” often said as “cotton-pickin’.”","zh":"（非正式）作轻度咒骂或加强语气用语，相当于“该死的/讨厌的”，常口语作“cotton-pickin’”。"},"examples":[{"en":"Where are my cotton-picking keys?","zh":"我的该死的钥匙在哪儿？"},{"en":"Turn off that cotton-pickin’ alarm!","zh":"把那讨厌的闹钟关掉！"},{"en":"He’s always late for cotton-pickin’ meetings.","zh":"他开会总是迟到，真让人恼火。"}]}],"synonyms":["cotton-harvesting","damn (informal)","blasted (informal)","bloomin' (informal)"],"phonetic":"/ˈkɑtənˌpɪkɪŋ/","extraExplanation":["“cotton-picking / cotton-pickin’”作为加强语气的用法带有明显的美式口语、乡村/南方方言色彩，语气通常比直接说“damn”更“委婉”，但仍是不正式表达。","由于“cotton picking（采棉）”在美国历史上与奴隶制和佃农制度等背景有关，这个词在某些语境下可能让人联想到沉重历史；对不熟悉的人群或正式场合建议避免，用更中性的表达（如 “really / very / annoying”）会更稳妥。","常见拼写与形式：cotton-picking（较正式拼写）；cotton-pickin’（口语省音，更像情绪化的抱怨）。"]}
{"word":"Cottonport","summary":{"en":"Cottonport is a town name in Louisiana, USA.","zh":"Cottonport 是美国路易斯安那州的一个城镇地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small town (municipality) in Avoyelles Parish, Louisiana, in the United States","zh":"美国路易斯安那州阿沃耶尔斯县（Avoyelles Parish）的一个小镇（市镇）"},"examples":[{"en":"Cottonport is a small community in central Louisiana.","zh":"Cottonport 是路易斯安那州中部的一个小社区。"},{"en":"She grew up near Cottonport, Louisiana.","zh":"她在路易斯安那州 Cottonport 附近长大。"}]}],"synonyms":["(no true synonym; it is a proper place name)"],"phonetic":"/ˈkɑtənˌpɔrt/","extraExplanation":["“Cottonport”是专有名词，常见于美国地名中；书写时通常首字母大写。","词形可直观理解为 cotton（棉花）+ port（港口/集散地），反映了美国南方历史上与棉花贸易、运输相关的命名习惯；但它并不一定表示真正的海港。"]}
{"word":"cottons","summary":{"en":"“Cottons” is usually the plural of “cotton,” meaning cotton fiber/cloth (often different types), and it can also be the verb form in “cotton to,” meaning to start liking or understanding something.","zh":"“Cottons”通常是“cotton”的复数，指棉花/棉布（常表示不同种类）；也可作动词（多见于“cotton to”），表示开始喜欢、接受或逐渐理解。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of cotton: soft white fiber used to make thread and cloth; also cloth made from this fiber.","zh":"cotton 的复数：棉花（纤维）；也指棉布/棉织物。"},"examples":[{"en":"These shirts are made from high-quality cottons.","zh":"这些衬衫用的是高品质的棉料。"},{"en":"The factory imports cottons from several countries.","zh":"这家工厂从多个国家进口棉花/棉料。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) plural of cotton referring to different varieties/types of cotton plants or cotton fiber.","zh":"（较少见）指不同品种/类型的棉花（植物或纤维）。"},"examples":[{"en":"Researchers compared cottons that grow well in dry climates.","zh":"研究人员比较了适合干旱气候生长的不同棉花品种。"}]},{"partOfSpeech":"v.","definition":{"en":"third-person singular of cotton (usually in the phrase “cotton to”): to begin to like or understand someone or something; to take to.","zh":"cotton 的第三人称单数（常用于短语 cotton to）：开始喜欢/接受，或逐渐理解、适应。"},"examples":[{"en":"He quickly cottons to new teammates.","zh":"他很快就和新队友熟络起来/开始喜欢上新队友。"},{"en":"She didn’t cotton to the idea at first.","zh":"她起初并不认同/接受这个想法。"}]}],"synonyms":["cotton fabrics","cotton cloths","varieties","types","take to","warm to","grow on"],"phonetic":"/ˈkɑtənz/","extraExplanation":["在英语里，“cotton”作物质名词时通常不可数（cotton fabric / cotton fiber）。但在商业、纺织或分类语境中，常用复数“cottons”表示“不同种类的棉料/棉布”或“不同来源/等级的棉花”。","动词短语“cotton to”略带口语或偏老派的感觉，意思接近“take to / warm to / get used to”。"]}
{"word":"cottonseed","summary":{"en":"Cottonseed is the seed of the cotton plant, used especially for oil and animal feed after processing.","zh":"cottonseed 指棉花的种子，常用于榨油和制作动物饲料（通常需加工）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The small seed of the cotton plant, used to produce cottonseed oil, animal feed, and other products (often after processing).","zh":"棉籽；棉花的种子，用于榨棉籽油、做饲料及其他工业用途（通常需加工处理）。"},"examples":[{"en":"Cottonseed oil is often used in cooking and food processing.","zh":"棉籽油常用于烹饪和食品加工。"},{"en":"After the cotton is removed, the remaining cottonseed can be processed for feed.","zh":"棉花纤维被分离后，剩下的棉籽可以加工成饲料。"}]}],"synonyms":["cotton seed"],"phonetic":"/ˈkɑːtənˌsiːd/","extraExplanation":["“cottonseed”在农业与食品语境中很常见：棉籽可以被压榨成棉籽油；棉籽粕（cottonseed meal）常用于动物饲料。需要注意的是，未经处理的棉籽含有一种天然物质（如棉酚 gossypol），对某些动物或人可能不适合大量摄入，因此一般会经过加工处理。"]}
{"word":"cottonseeds","summary":{"en":"Cottonseeds are the seeds of the cotton plant, used in farming and for products such as cottonseed oil.","zh":"Cottonseeds 指棉花的种子，用于农业（播种等）以及生产棉籽油等产品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Seeds of the cotton plant, used for planting, animal feed (after processing), and making products like cottonseed oil.","zh":"棉籽；棉花植物的种子，可用于播种、（经处理后）作饲料，也可用来生产棉籽油等产品。"},"examples":[{"en":"After the cotton was ginned, the factory stored the cottonseeds separately.","zh":"棉花轧去纤维后，工厂把棉籽单独储存起来。"},{"en":"Cottonseeds are often processed to produce cottonseed oil for cooking and food manufacturing.","zh":"棉籽常被加工成棉籽油，用于烹饪和食品加工。"},{"en":"Some farmers sell cottonseeds as a byproduct to feed cattle, but they must be properly treated for safety.","zh":"一些农民把棉籽作为副产品出售来喂牛，但必须经过适当处理以确保安全。"}]}],"synonyms":["cottonseed","seeds of the cotton plant"],"phonetic":"/ˈkɑtənˌsidz/","extraExplanation":["“cottonseed”是单数，“cottonseeds”是复数；在农业与食品语境中很常见。","棉籽含有一种天然成分gossypol（棉酚），未经处理不适合人或某些动物直接食用；工业上通常会脱毒/精炼后再用于饲料或榨油。"]}
{"word":"cottontail","summary":{"en":"A cottontail is a small rabbit with a white, cotton-like tail; informally it can also mean a fluffy white tail on a costume or toy.","zh":"cottontail 指尾巴像棉花团一样白的棉尾兔；非正式用法也可指服装或玩具上的蓬松白尾巴。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small rabbit, especially the common North American rabbit with a tail that looks like a white puff of cotton.","zh":"（尤指北美常见的）棉尾兔；因尾巴像一团白色棉花而得名。"},"examples":[{"en":"We saw a cottontail hopping across the yard at dusk.","zh":"黄昏时我们看到一只棉尾兔跳过院子。"},{"en":"A cottontail froze when it heard the dog bark.","zh":"那只棉尾兔听到狗叫时立刻停住不动。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) A fluffy white tail, like the tail of a cottontail rabbit.","zh":"（非正式）像棉尾兔尾巴一样的蓬松白尾巴。"},"examples":[{"en":"The costume had a little cottontail on the back.","zh":"那套服装背后有一个小小的“棉尾球”尾巴。"}]}],"synonyms":["rabbit","bunny","cottontail rabbit"],"phonetic":"/ˈkɑtənˌteɪl/","extraExplanation":["“cottontail”常用来指“棉尾兔”（多为北美的棉尾兔属），在英语里也经常出现在童话、儿童读物和自然观察类写作中，给人一种可爱、胆小、在草丛间迅速蹦跳的形象。","在文化语境里，复活节（Easter）相关的兔子形象常让人联想到“white fluffy tail”，因此“cottontail”也会被用来形容服装或玩具上的小白绒球尾巴。"]}
{"word":"cottontails","summary":{"en":"Cottontails are common North American wild rabbits with fluffy white tails.","zh":"cottontails 指棉尾兔：北美常见的野兔，尾巴像白棉球。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A cottontail rabbit; a common wild rabbit in North America, named for its fluffy white tail that looks like a cotton ball.","zh":"棉尾兔（北美常见的野兔，因尾巴像一团白棉花而得名）。"},"examples":[{"en":"We saw a cottontail in the backyard at dusk.","zh":"黄昏时我们在后院看到一只棉尾兔。"},{"en":"Cottontails freeze when they sense danger.","zh":"棉尾兔察觉到危险时常会突然僵住不动。"},{"en":"The garden fence helps keep cottontails away from the lettuce.","zh":"花园围栏能帮助把棉尾兔挡在生菜外。"}]}],"synonyms":["cottontail rabbit","rabbit (general)","bunny (informal)"],"phonetic":"/ˈkɑtənˌteɪlz/","extraExplanation":["“cottontail”最常指北美的棉尾兔（如东部棉尾兔 eastern cottontail）。在英语里也可把“cotton tail”当作对动物白尾巴的形象描述，但日常使用中通常就是指这种兔子。","词源直观：cotton（棉花）+ tail（尾巴），强调尾巴像白棉球。复数是 cottontails。"]}
{"word":"Cottonton","summary":{"en":"“Cottonton” is not a standard English word; it’s likely a misspelling or a proper name.","zh":"“Cottonton”不是标准英文词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a misspelling or a proper name (for example, a business name, username, or a place name).","zh":"不是标准英文词；更可能是拼写错误或专有名词（如公司名、用户名或地名）。"},"examples":[{"en":"I couldn’t find “Cottonton” in an English dictionary—did you mean “cotton” or “Cottontown”?","zh":"我在英文词典里找不到“Cottonton”——你是不是想写“cotton（棉花）”或“Cottontown（棉花镇/地名）”？"},{"en":"If “Cottonton” is a brand name, please share the context or a sentence where you saw it.","zh":"如果“Cottonton”是品牌名，请告诉我你在哪里看到它，或给我一个包含它的句子。"}]}],"phonetic":"ˈkɑtənˌtɑn","extraExplanation":["“Cottonton”在常见英文语料和词典中几乎不出现，因此更像是：①把“cotton（棉花）”拼错了；②把“Cottontown（常见作地名/店名）”拼错了；③某个自创词或专有名词。","如果你想查的是“cotton”，它常见意思是“棉花；棉布”，也可形容触感“柔软的”。把你要表达的中文意思或原句发我，我可以帮你确认最可能的正确拼法。"]}
{"word":"cottontop","summary":{"en":"“Cottontop” most commonly means a white-haired person, and it can also mean a cotton-top tamarin (a small monkey with a white crest).","zh":"“cottontop”常指白发的人；也可指白头狨（头顶有白色冠毛的小型猴类）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person (often an older person) with white or very light hair, compared to cotton.","zh":"（常指年长者）白发或浅色头发的人，因头发像棉花一样而得名。"},"examples":[{"en":"The neighborhood kids helped the cottontops carry groceries home.","zh":"社区里的孩子们帮那些白发老人把杂货提回家。"},{"en":"He’s a proud cottontop now, but he still hikes every weekend.","zh":"他现在已经是个“白发老头”了，但每个周末仍然去徒步。"}]},{"partOfSpeech":"n.","definition":{"en":"A small South American monkey with a distinctive white crest, short for “cotton-top tamarin.”","zh":"一种南美小型猴类，头顶有明显白色冠毛；“cotton-top tamarin（白头狨）”的简称。"},"examples":[{"en":"The zoo’s cottontops are known for their loud calls.","zh":"动物园的白头狨以叫声响亮而出名。"},{"en":"Scientists study cottontops to learn more about social behavior.","zh":"科学家研究白头狨以更多了解社会行为。"}]}],"synonyms":["whitehead","gray-haired person","senior","cotton-top tamarin"],"phonetic":"/ˈkɑtənˌtɑp/","extraExplanation":["“cottontop”在日常口语里有时带点亲昵或开玩笑的语气，用来形容白发（像棉花一样）。不过在不熟的人面前可能显得不够正式，建议用“older adult / senior / elderly person”或直接说“someone with white hair”。","动物学里更常见的完整名称是“cotton-top tamarin”。它们原产于哥伦比亚，头顶白色“爆炸头”状冠毛非常显眼，也常出现在保护与濒危动物的语境中。"]}
{"word":"Cottontown","summary":{"en":"Cottontown is mainly a place name (notably in South Carolina), and it can also mean a town connected with the cotton industry.","zh":"Cottontown 主要是地名（尤其指美国南卡罗来纳州的一个社区），也可泛指与棉花产业相关的城镇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name (proper noun), especially Cottontown, an unincorporated community in Richland County, South Carolina, U.S.","zh":"地名（专有名词）：尤其指美国南卡罗来纳州里奇兰县的一个非建制社区 Cottontown（科顿敦）。"},"examples":[{"en":"She lives near Cottontown in Columbia, South Carolina.","zh":"她住在南卡罗来纳州哥伦比亚市附近的 Cottontown。"},{"en":"We drove through Cottontown on our way to downtown Columbia.","zh":"我们去哥伦比亚市中心的路上开车经过了 Cottontown。"}]},{"partOfSpeech":"n.","definition":{"en":"(more generally) a town associated with cotton growing, processing, or trade; a “cotton town.”","zh":"（泛指）与棉花种植、加工或贸易相关的城镇；“棉花城/棉镇”。"},"examples":[{"en":"In the 1800s, many Southern communities became cottontowns because cotton was a major crop.","zh":"在19世纪，许多美国南方社区因为棉花是主要作物而成了“棉花城”。"},{"en":"The museum explains how the region changed from farms into a busy cottontown.","zh":"博物馆讲解了这个地区如何从农田发展成繁忙的“棉花城”。"}]}],"synonyms":["cotton town","cotton-growing town"],"phonetic":"/ˈkɑtənˌtaʊn/","extraExplanation":["“Cottontown”字面意思是“棉花镇”。在美国，很多地名来自当地的主要产业或作物；因此它既可能是具体地名，也可能被当作普通描述词使用（常写作 cotton town 或 cottontown）。","作为地名时通常要大写（Cottontown）；作为普通名词时一般不大写。"]}
{"word":"cottonweed","summary":{"en":"Cottonweed is a weed-like plant named for its cottony, fluffy appearance, often referring to Froelichia species.","zh":"Cottonweed 指因外观看起来像棉絮而得名的杂草状植物，常指 Froelichia 属的某些物种。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A weedy plant with soft, cotton-like hairs or fluffy seed heads; often refers to species in the genus Froelichia (sometimes called “snakecotton”).","zh":"一种带有棉絮状绒毛或蓬松种子头的杂草；常用来指一些弗罗伊利希亚属（Froelichia）的植物（有时也叫“snakecotton”）。"},"examples":[{"en":"The pasture was dotted with cottonweed after the dry summer.","zh":"干燥的夏天过后，牧场上到处都是棉絮草。"},{"en":"Pull the cottonweed before it sets seed and spreads.","zh":"趁棉絮草结籽扩散前把它拔掉。"}]}],"synonyms":["Froelichia","snakecotton"],"phonetic":"/ˈkɑtənˌwid/","extraExplanation":["“cottonweed”不是非常常见的日常词，更常出现在园艺、农业或野外植物识别的语境里。它通常是按外观取名：花序或种子部分看起来像一团“棉絮”。","在北美的一些地区，“cottonweed”可能特指Froelichia属的某些植物；不同地区对同一俗名的指代可能不完全一致。若需要精确识别，最好结合拉丁学名或当地植物名录。"]}
{"word":"cottonwick","summary":{"en":"A cotton wick is the cotton thread inside a candle or lamp that draws fuel and supports the flame.","zh":"cotton wick 指蜡烛或油灯内部的棉质灯芯，用来吸取燃料并维持火焰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wick made of cotton, used in candles or oil lamps to draw up fuel and keep a flame burning steadily","zh":"棉芯；（蜡烛或油灯的）棉质灯芯，用来吸油/蜡并维持火焰稳定燃烧"},"examples":[{"en":"This candle uses a cotton wick, so it burns with a steady flame.","zh":"这支蜡烛用的是棉芯，所以火焰燃烧得很稳定。"},{"en":"Trim the cotton wick to about 1/4 inch before lighting the candle.","zh":"点蜡烛前把棉芯修剪到大约四分之一英寸。"}]}],"synonyms":["wick","candlewick","cotton candlewick"],"phonetic":"/ˈkɑtən wɪk/","extraExplanation":["“cottonwick”更常见的写法是两个词：cotton wick。在产品说明（蜡烛、香薰蜡、煤油灯等）里也常见写成复合词或作为型号/材料描述出现。","棉芯与“wooden wick（木芯）”常被对比：棉芯通常更安静、火焰更稳定；木芯可能会发出轻微噼啪声，带来“壁炉感”。"]}
{"word":"cottonwood","summary":{"en":"A cottonwood is a poplar tree known for its cotton-like seed fluff, often found near water in North America.","zh":"cottonwood 指一种杨树（棉杨/棉白杨），以会飘散像棉絮的种子著称，北美常见且多生长在水边。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of poplar tree (genus Populus) known for releasing soft, cotton-like seeds in late spring or summer","zh":"杨属（Populus）的一类树（常译“棉白杨/棉杨”），因在春末夏初会飘散像棉絮一样的种子而得名"},"examples":[{"en":"In early summer, cottonwood fluff floated through the air like snow.","zh":"初夏时，棉杨的絮状种子在空中飘着，像下雪一样。"},{"en":"Cottonwoods often grow near rivers and streams in the western United States.","zh":"在美国西部，棉杨常生长在河流和溪流附近。"},{"en":"We picnicked in the shade of a tall cottonwood.","zh":"我们在一棵高大的棉杨树荫下野餐。"}]}],"synonyms":["poplar","cottonwood tree","Populus"],"phonetic":"/ˈkɑtənˌwʊd/","extraExplanation":["“cottonwood”主要是北美常见的树名，常指几种杨树（如Eastern cottonwood, Fremont cottonwood）。因雌株会产生带棉絮状绒毛的种子，随风飘散，视觉上很显眼。","在美国文化语境里，cottonwood常与“河岸、溪谷、开阔的西部风景”联系在一起；在一些文学作品或歌曲中也用来营造乡野、边疆或故土的意象。","小提醒：飘飞的“棉絮”其实是种子上的绒毛，不是棉花；对过敏人群来说，真正引发过敏的更多是花粉而非这些绒毛，但绒毛会刺激眼鼻、让人感觉不适。"]}
{"word":"cottonwoods","summary":{"en":"Cottonwoods are North American poplar trees, often near rivers, known for their cotton-like seed fluff.","zh":"Cottonwoods 指北美常见的杨树类（棉白杨等），多生长在河边，并以飘散棉絮状种子闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of poplar tree (genus Populus) common in North America, often found near rivers; it produces fluffy, cotton-like seeds in late spring or early summer","zh":"一种北美常见的杨树（胡杨属/杨属 Populus），常见于河岸等湿地；春末夏初会飘出像棉絮一样的种子"},"examples":[{"en":"Cottonwoods line the riverbank and provide shade in summer.","zh":"河岸边长着一排棉白杨，夏天能提供树荫。"},{"en":"In early summer, cottonwood fluff can fill the air like snow.","zh":"初夏时，棉白杨的飞絮会像雪一样飘满空气。"},{"en":"We picnicked under the cottonwoods during our road trip.","zh":"公路旅行时，我们在棉白杨树下野餐。"}]}],"synonyms":["poplars","Populus trees"],"phonetic":"/ˈkɑtənˌwʊdz/","extraExplanation":["“Cottonwood(s)”在日常英语里通常指北美的棉白杨类树木；之所以叫 cottonwood，是因为它的种子带有白色绒毛，像棉花一样会随风飘散。","常见搭配：cottonwood tree（棉白杨树）、cottonwood fluff/seed fluff（杨絮/飞絮）、under the cottonwoods（在棉白杨树下）。","文化语境：在美国西部与大平原地区，cottonwoods 常作为河谷、牧场或乡村景观的标志性树种出现在游记与文学描写中，常带有“河边、家园、夏日树荫”的意象。"]}
{"word":"cottony","summary":{"en":"Cottony means cotton-like—soft, fluffy, and light; it can also describe puffy white appearances (clouds) or a dreamy, foggy feeling in your head.","zh":"Cottony 指“像棉花一样”的感觉——柔软、蓬松、轻盈；也可形容云等“棉絮般”的外观，或比喻头脑发蒙、恍惚的状态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Soft and light like cotton; fluffy or downy in texture.","zh":"像棉花一样柔软轻盈的；蓬松的、绒毛般的。"},"examples":[{"en":"The kitten’s cottony fur felt warm against my hand.","zh":"小猫绒绒的毛摸起来很暖。"},{"en":"She wrapped herself in a cottony blanket on the cold night.","zh":"寒冷的夜里，她裹着一条柔软蓬松的毯子。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Often about clouds, smoke, or plants) Having a puffy, white, cotton-like look.","zh":"（常形容云、烟或植物）呈现鼓鼓的、偏白、像棉絮一样的外观。"},"examples":[{"en":"Cottony clouds drifted across the blue sky.","zh":"棉絮般的云在蓝天上飘过。"},{"en":"The plant has cottony white tufts along its stems.","zh":"这种植物的茎上长着一簇簇棉絮状的白色绒团。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Pleasantly vague, dreamy, or numb, as if your head or thoughts are wrapped in cotton.","zh":"（比喻）迷迷糊糊的、恍惚的或麻木的；像脑子被棉花裹住一样不清醒。"},"examples":[{"en":"After the long flight, he felt cottony-headed and slow to think.","zh":"长途飞行后，他觉得头脑发蒙，反应很慢。"}]}],"synonyms":["fluffy","downy","soft","fuzzy","puffy","woolly"],"phonetic":"/ˈkɑːtəni/","extraExplanation":["“cottony”常见于描写触感与外观（如clouds, fur, blanket），也可延伸为心理/生理感受（如cottony-headed=头脑发蒙）。它比“soft”更强调“像棉絮那样蓬松、轻飘、带点绒感”的画面。","文学或描写性文本里，它常用来营造温柔、朦胧、轻盈的氛围，例如“cottony clouds”会让人联想到白而松软的云层。"]}
{"word":"cottrel","summary":{"en":"Cottrel is a rare, old word for a cottage tenant/farm laborer, and it is also used as a surname.","zh":"Cottrel 是一个少见的古语词，可指住在小屋里租少量土地的佃户/农场雇工；也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) A cottar/cotter: a person who lived in a small cottage and rented a little land, often working as a farm laborer.","zh":"（古语）佃农/茅屋佃户：住在小屋里、租用少量土地的人，常兼做农场雇工。"},"examples":[{"en":"In old records, a cottrel might rent a cottage and a small plot from a local landowner.","zh":"在旧档案里，cottrel 可能向地主租一间小屋和一小块地。"},{"en":"The village lists farmers, craftsmen, and a few cottrels who worked seasonally.","zh":"村里的名册列有农民、工匠，以及一些季节性务农的佃户（cottrels）。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname).","zh":"姓氏（人名）。"},"examples":[{"en":"Ms. Cottrel signed the letter at the bottom of the page.","zh":"Cottrel 女士在页面底部签了名。"},{"en":"The author’s last name is Cottrel.","zh":"这位作者的姓是 Cottrel。"}]}],"synonyms":["cotter","cottar","tenant farmer"],"phonetic":"/ˈkɑtrəl/","extraExplanation":["“cottrel”在现代英语中很少见，更多是历史文本或档案里的拼写变体，常与“cotter / cottar（佃农、茅屋佃户）”相关。不同地区与年代的拼写可能不一致（例如结尾 -el / -er）。","作为姓氏时，Cottrel 多见于英语国家的人名系统里，可能源自职业、居住地或家族历史的转写。"]}
{"word":"Cottrell","summary":{"en":"Cottrell is usually a surname, and it can also appear in scientific terms named after someone with that name.","zh":"Cottrell 通常是一个英语姓氏；在科学文献中也可能作为人名冠名词出现在术语里。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"（常见于英语国家的）姓氏：科特雷尔 / 科特瑞尔（音译）"},"examples":[{"en":"My professor’s last name is Cottrell.","zh":"我教授的姓是 Cottrell。"},{"en":"The paper was written by Dr. Cottrell.","zh":"这篇论文是 Cottrell 医生写的。"}]},{"partOfSpeech":"other","definition":{"en":"(in science, as an eponym) used in names of concepts named after a person called Cottrell, especially in chemistry and materials science.","zh":"（科学中作人名冠名词）用于以 Cottrell 命名的概念名称，尤见于化学与材料科学领域"},"examples":[{"en":"We used the Cottrell equation to analyze the current over time.","zh":"我们用 Cottrell 方程来分析电流随时间的变化。"},{"en":"The “Cottrell atmosphere” helps explain how dislocations interact with impurities.","zh":"“Cottrell 氛围”有助于解释位错如何与杂质相互作用。"}]}],"synonyms":["Cotterell (variant spelling)"],"phonetic":"/ˈkɑːtrəl/","extraExplanation":["“Cottrell”多见于英语姓氏，常被音译为“科特雷尔/科特瑞尔”。作为姓氏，它的拼写固定，但读音在不同地区可能略有差异；学习中把它当作专有名词处理即可。","在理工科文献里，你可能遇到以人名命名的术语：例如电化学中的 Cottrell equation（描述扩散控制下电流随时间衰减的关系），以及材料学中的 Cottrell atmosphere（杂质原子在位错附近聚集的现象）。这些通常是“人名 + 名词”的结构。"]}
{"word":"Cottus","summary":{"en":"Cottus is the scientific genus name for certain freshwater sculpins.","zh":"Cottus 是某些淡水杜父鱼（sculpins）的科学属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small freshwater fish (sculpins) found mainly in cold, clear rivers and streams; used as the scientific (Latin) genus name in biology","zh":"（生物学）杜父鱼属：一种小型淡水鱼类（杜父鱼/鮋形鱼的一类）的属名，多见于寒冷清澈的河流与溪流；常作为拉丁学名中的属名使用"},"examples":[{"en":"Cottus is a genus of sculpins that often live on the bottom of streams.","zh":"Cottus 是杜父鱼属，这类鱼常生活在溪流底部。"},{"en":"The paper identified the specimen as Cottus, based on fin shape and head structure.","zh":"论文根据鳍的形状和头部结构，将该标本鉴定为 Cottus 属。"}]}],"synonyms":["sculpin (genus)","freshwater sculpin","bullhead (informal, varies by region)"],"phonetic":"/ˈkɑtəs/","extraExplanation":["“Cottus”多见于学术与科普语境，常作为拉丁学名的一部分出现（属名首字母大写，如 Cottus）。在日常英语里，人们更常说“sculpin（杜父鱼）”或具体物种名。","词源上属于拉丁化的学名形式；读音在英语中通常按拉丁学名的英语读法处理。"]}
{"word":"cottus","summary":{"en":"Cottus is the scientific genus name for certain freshwater sculpins.","zh":"Cottus 是某些淡水杜父魚（sculpins）的科學屬名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small freshwater fish (sculpins), found mainly in cold streams and lakes in the Northern Hemisphere.","zh":"（生物）鮋科的一個屬（Cottus），多為生活在北半球寒冷溪流與湖泊中的小型淡水魚（常稱為杜父魚/鮋魚類的一種，英語常見名為 sculpin）。"},"examples":[{"en":"The researchers identified the specimen as a Cottus species based on its head shape and fins.","zh":"研究人員根據頭部形狀和魚鰭特徵，將該標本鑑定為 Cottus 屬的物種。"},{"en":"In some mountain streams, Cottus fish live under rocks where the water stays cool.","zh":"在一些山區溪流中，Cottus 屬的魚會躲在石頭下方生活，因為那裡水溫較低。"}]}],"synonyms":["sculpin","freshwater sculpin"],"phonetic":"/ˈkɑtəs/","extraExplanation":["「Cottus」是拉丁化的學名，用於科學分類（屬名）。日常英語更常用的說法是「sculpin」（杜父魚/鮋魚類），而「Cottus」多出現在生物學、環境調查、物種鑑定等語境。"]}
{"word":"cotty","summary":{"en":"Cotty is a Scottish informal word meaning “cramped” or “awkward/tricky,” and it can also be a rare name or nickname.","zh":"Cotty 是苏格兰英语里的非正式词，常指“狭窄局促”或“棘手别扭”，也可能是少见的人名/昵称。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Scottish English, informal) Cramped or confined; not spacious or comfortable.","zh":"（苏格兰英语，非正式）狭窄的；局促的；不太舒适的。"},"examples":[{"en":"The kitchen’s a bit cotty, but it’s clean and warm.","zh":"这个厨房有点局促，但很干净也很暖和。"},{"en":"We were all squeezed into a cotty little room.","zh":"我们都挤在一间很小、很局促的房间里。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Scottish English, informal) Awkward or difficult to deal with; tricky.","zh":"（苏格兰英语，非正式）难对付的；棘手的；别扭的。"},"examples":[{"en":"It’s cotty trying to park here on a busy day.","zh":"忙的时候在这里停车很棘手。"},{"en":"The latch is cotty—give it a hard push.","zh":"这个门闩有点别扭——用力推一下。"}]},{"partOfSpeech":"n.","definition":{"en":"A rare personal name or nickname (often seen as a surname or a shortened form in some communities).","zh":"较少见的人名或昵称（也可能作为姓氏出现，或在某些社群里是缩略称呼）。"},"examples":[{"en":"Cotty is sometimes used as a nickname in family circles.","zh":"Cotty 有时会在家庭圈子里当昵称使用。"}]}],"synonyms":["cramped","tight","confined","awkward","tricky","fiddly"],"phonetic":"/ˈkɑti/","extraExplanation":["“cotty”主要见于苏格兰方言（Scots/Scottish English）语境，在标准美式/英式英语里不算常用。如果你是在书里、影视台词或苏格兰朋友聊天中看到，多半是形容地方“很挤/不宽敞”，或事情“有点难搞/不顺手”。","不同地区对它的具体语感可能略有差异；如果你能提供一句原句，我可以帮你更准确判断是“局促”还是“棘手”的用法。"]}
{"word":"Cotuit","summary":{"en":"Cotuit is a place name on Cape Cod, Massachusetts—commonly referring to the village (and sometimes the nearby Cotuit Bay area).","zh":"Cotuit 是美国马萨诸塞州科德角的地名，通常指科图伊特村，有时也泛指附近的科图伊特湾一带。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a village in the town of Barnstable on Cape Cod, Massachusetts, USA.","zh":"美国马萨诸塞州科德角（Cape Cod）巴恩斯特布尔镇（Barnstable）下属的一个村庄（地名：科图伊特）。"},"examples":[{"en":"She spends her summers in Cotuit on Cape Cod.","zh":"她夏天会在科德角的科图伊特度过。"},{"en":"We drove from Hyannis to Cotuit for dinner by the water.","zh":"我们从海恩尼斯开车去科图伊特，在水边吃晚饭。"}]},{"partOfSpeech":"n.","definition":{"en":"the area around Cotuit Bay (a coastal bay/harbor area near the village), often referred to by the same name in local use.","zh":"科图伊特湾（Cotuit Bay）及其周边的海湾/港湾区域；在当地口语中也常直接称作“Cotuit”。"},"examples":[{"en":"Sailing in Cotuit is popular when the weather is calm.","zh":"天气平静时，在科图伊特一带航行很受欢迎。"},{"en":"The Cotuit Bay beaches are quiet in the early morning.","zh":"清晨的科图伊特湾海滩很安静。"}]}],"synonyms":["(proper noun; no direct synonyms)"],"phonetic":"/koʊˈtuːɪt/","extraExplanation":["“Cotuit”主要作为专有名词（地名）使用，通常不翻译；书写时首字母大写。","如果你在菜单或旅游信息中看到“Cotuit oysters / Cotuit oyster”，多半是指产自科图伊特湾附近水域的牡蛎（属于产地称呼，而不是一种通用的牡蛎品种名）。"]}
{"word":"cotuit","summary":{"en":"Cotuit is a village on Cape Cod, Massachusetts; it can also refer to local institutions there (like the Cotuit Kettleers).","zh":"Cotuit（科图伊特）是美国马萨诸塞州科德角的一个村庄；也可指当地相关机构或球队（如 Cotuit Kettleers）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A village in the town of Barnstable on Cape Cod, Massachusetts, known for its coastal setting on Cotuit Bay.","zh":"美国马萨诸塞州科德角（Cape Cod）巴恩斯特布尔镇（Barnstable）下属的一个海湾村庄，以科图伊特湾（Cotuit Bay）等海岸景观闻名。"},"examples":[{"en":"We rented a small cottage in Cotuit for the weekend.","zh":"我们周末在科图伊特租了一间小木屋。"},{"en":"Cotuit is a quiet part of Cape Cod compared with some busier beach towns.","zh":"和一些更热闹的海滨小镇相比，科图伊特算是科德角比较安静的地方。"}]},{"partOfSpeech":"n.","definition":{"en":"In local usage, the name can also refer to community institutions in Cotuit, such as the Cotuit Center for the Arts or the Cotuit Kettleers (a summer baseball team).","zh":"在当地语境中，“Cotuit”也常指与该社区相关的机构或事物，例如科图伊特艺术中心（Cotuit Center for the Arts）或科图伊特“水壶队”（Cotuit Kettleers，一支夏季棒球队）。"},"examples":[{"en":"He plays for Cotuit in the Cape Cod Baseball League each summer.","zh":"他每年夏天都会在科德角棒球联盟为科图伊特队效力。"},{"en":"We saw a concert at Cotuit Center for the Arts.","zh":"我们在科图伊特艺术中心看了一场音乐会。"}]}],"phonetic":"/kəˈtuːɪt/","extraExplanation":["“Cotuit”是专有名词（地名）。在美国英语里，谈到科德角时常把它当作一个具体社区来称呼；在对话中也可能用它来指代当地的活动、机构或球队（例如“Cotuit Kettleers”）。","词源一般认为来自当地原住民语言（常见说法与马萨诸塞一带的原住民语言相关），许多科德角地名都有类似来源；日常使用中不需要了解词源也能正确理解。"]}
{"word":"cotula","summary":{"en":"Cotula is a botanical genus in the daisy family, including low-growing plants sometimes used as ground cover (e.g., “brass buttons”).","zh":"Cotula 是菊科的一属植物，包含一些低矮生长、可作地被的种类（如俗称“brass buttons”的植物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small flowering plants in the daisy family (Asteraceae), often low-growing; some species are used as ground cover or ornamentals (for example, “brass buttons”).","zh":"（植物）菊科（Asteraceae）的一属小型开花植物，常为低矮匍匐生长；部分种类可作地被或观赏植物（如常见名“黄铜纽扣草/纽扣菊”）。"},"examples":[{"en":"Cotula is often grown as a hardy ground cover in rock gardens.","zh":"Cotula 常被当作耐寒的地被植物种在岩石花园里。"},{"en":"The gardener replaced the lawn with cotula to reduce mowing.","zh":"园丁用 cotula 替代草坪，以减少修剪次数。"}]}],"synonyms":["brass buttons (common name for some species)"],"phonetic":"/kɑˈtuːlə/","extraExplanation":["“Cotula”是拉丁化的植物学名称，常见于园艺与植物学语境；在日常英文里更常用的是具体物种名（如 *Cotula coronopifolia*）或俗名（如 “brass buttons”）。","发音重音通常落在第二个音节：co-TU-la。不同地区可能有轻微读音差异，但学术/园艺交流中以上读法最常见。"]}
{"word":"Cotulla","summary":{"en":"Cotulla is a city in South Texas, USA (the county seat of La Salle County).","zh":"Cotulla 是美国德克萨斯州南部的一座城市（拉萨尔县县治）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small city in South Texas, the county seat of La Salle County (U.S.).","zh":"（美国）德克萨斯州南部的一座小城，拉萨尔县（La Salle County）的县治。"},"examples":[{"en":"We stopped in Cotulla to get gas on the way to Laredo.","zh":"我们去拉雷多（Laredo）的路上在科图拉（Cotulla）停下来加油。"},{"en":"Cotulla is known locally as a gateway to the South Texas brush country.","zh":"在当地，科图拉常被视为通往德州南部灌木荒野地带的入口。"}]}],"phonetic":"/kəˈtuːlə/","extraExplanation":["Cotulla 属于专有名词（地名），在英语里通常不加冠词，直接说“in Cotulla / to Cotulla”。","该地名与西班牙语背景有关：这座城以 19 世纪的商人/殖民者 Joseph Cotulla 命名，因此在德州和美墨边境文化圈里常见类似的西班牙语/拉丁语系姓氏地名。"]}
{"word":"cotunnite","summary":{"en":"Cotunnite is a rare mineral form of lead(II) chloride (PbCl₂).","zh":"Cotunnite 指一种稀有的氯化铅（PbCl₂）矿物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral made of lead(II) chloride (PbCl₂), typically found near volcanoes and in very dry, salty environments.","zh":"一种稀有矿物，主要成分为氯化铅（PbCl₂），常见于火山附近或极度干燥、含盐环境中。"},"examples":[{"en":"Cotunnite is a lead chloride mineral that can form in volcanic fumaroles.","zh":"氯化铅矿（cotunnite）是一种氯化铅矿物，可在火山喷气孔（fumaroles）中形成。"},{"en":"The sample was identified as cotunnite based on its chemistry and crystal shape.","zh":"研究人员根据其化学成分和晶体形态将该样品鉴定为氯化铅矿（cotunnite）。"}]}],"synonyms":["lead(II) chloride (mineral form)","lead chloride mineral"],"phonetic":"/koʊˈtʌnaɪt/","extraExplanation":["“Cotunnite”是矿物学名称，不是日常英语常用词，常出现在地质、矿物学与材料化学语境中。","该矿物名称来自意大利解剖学家 Domenico Cotugno（科图尼奥），属于以人名命名的矿物。由于含铅，标本和粉尘应避免入口或吸入，实验与收藏需注意安全。"]}
{"word":"Coturnix","summary":{"en":"Coturnix is the scientific genus name for several Old World quails.","zh":"Coturnix 是旧大陆多种鹌鹑的属名（学名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small Old World quail (family Phasianidae), including the common quail and the Japanese quail, often studied and raised in captivity.","zh":"鹌鹑属（Coturnix）：旧大陆的一类小型鹌鹑（属雉科），包括普通鹌鹑与日本鹌鹑等，常被饲养或用于科研。"},"examples":[{"en":"The Japanese quail (Coturnix japonica) is commonly used in biology research.","zh":"日本鹌鹑（Coturnix japonica）常用于生物学研究。"},{"en":"In the field guide, Coturnix is listed under the quail section.","zh":"在野外鸟类图鉴里，Coturnix 被列在鹌鹑一栏。"},{"en":"The farm raises Coturnix quail for eggs.","zh":"这家农场饲养鹌鹑属（Coturnix）的鹌鹑来产蛋。"}]}],"synonyms":["quail genus","Old World quail (scientific context)"],"phonetic":"/koʊˈtɝːnɪks/","extraExplanation":["“Coturnix”是拉丁化的学名，英语写作中常用斜体表示属名（Coturnix），而具体物种用“属名+种加词”，如 *Coturnix japonica*（日本鹌鹑）。","日常英语里更常说“quail（鹌鹑）”，只有在学术、兽医、养殖或鸟类图鉴等语境中才会直接用“Coturnix”。"]}
{"word":"coturnix","summary":{"en":"Coturnix is the scientific genus name for certain quails (small birds).","zh":"Coturnix 是某些鹌鹑（小型鸟类）的科学属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small Old World quails (birds), including the common quail and the Japanese quail.","zh":"（鸟类）鹌鹑属：旧大陆一类体型较小的鹌鹑的属名，包括普通鹌鹑和日本鹌鹑等。"},"examples":[{"en":"Coturnix quails are sometimes kept for eggs and research.","zh":"鹌鹑属的鹌鹑有时会被饲养来产蛋或用于研究。"},{"en":"The Japanese quail (Coturnix japonica) is widely raised on farms.","zh":"日本鹌鹑（Coturnix japonica）在养殖场里很常见。"}]}],"synonyms":["quail","Japanese quail"],"phonetic":"/koʊˈtɝːnɪks/","extraExplanation":["“Coturnix”是拉丁化的动物学属名，常见于学术文章、科普书和鸟类图鉴里；日常英语更常说“quail（鹌鹑）”。","在生物分类中，属名首字母要大写（Coturnix），物种名要小写并常用斜体（如 Coturnix japonica）。"]}
{"word":"cotutor","summary":{"en":"A cotutor is someone who tutors together with another tutor; it can also mean to tutor jointly.","zh":"cotutor 指与他人共同进行辅导的“共同导师”，也可作动词表示“共同辅导”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who shares the job of tutoring with another tutor; a joint tutor (often for the same student or course).","zh":"与另一位导师共同承担辅导工作的人；共同导师（常指辅导同一位学生或同一门课程）。"},"examples":[{"en":"My cotutor and I meet every Friday to plan next week’s lessons.","zh":"我和我的共同导师每周五见面，一起规划下周的课程。"},{"en":"The student has a math cotutor and a writing cotutor.","zh":"这位学生有一位数学共同导师和一位写作共同导师。"}]},{"partOfSpeech":"v.","definition":{"en":"To tutor together with another person; to co-teach or co-mentor in a tutoring setting.","zh":"与他人一起辅导；在辅导情境中共同教学或共同指导。"},"examples":[{"en":"We cotutor a small group of beginners after school.","zh":"我们放学后一起辅导一个初学者小组。"},{"en":"Two graduate students cotutored the course review sessions.","zh":"两名研究生一起辅导了课程复习课。"}]}],"synonyms":["co-tutor","joint tutor","co-instructor","co-mentor"],"phonetic":"/ˌkoʊˈtuːtər/","extraExplanation":["“cotutor”更常见的写法是带连字符的“co-tutor”。在正式写作中，如果你的学校/机构有统一用法，优先跟随其风格指南。","这个词在日常英语里不算特别常用，有时人们会改说“co-tutor”或更通用的“co-teach / co-mentor”。"]}
{"word":"cotwal","summary":{"en":"Cotwal (more commonly spelled kotwal) is a historical South Asian term for a town/district police chief or local magistrate.","zh":"Cotwal（更常拼作 kotwal）是南亚地区的历史用语，指城镇/地区的警察长官或地方治安官。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asia, historical) A police chief or local magistrate in a town or district, especially in India under earlier administrations.","zh":"（南亚，历史用语）城镇或地区的警察长官；地方治安官（尤指旧时印度行政体系中的“科特瓦尔/警长”）。"},"examples":[{"en":"In the old records, the kotwal was responsible for keeping order in the city.","zh":"在旧档案中，科特瓦尔负责维持城市秩序。"},{"en":"The traveler reported his stolen bag to the kotwal at the nearest station.","zh":"那位旅人到最近的衙署/警署向科特瓦尔报失了被偷的包。"}]}],"synonyms":["kotwal","police chief","constable (historical context)"],"phonetic":"/ˈkoʊtˌwɑl/","extraExplanation":["“cotwal”更常见的拼写是 **kotwal**（也见 *cutwal*）。该词源自南亚语言（常与印地语/乌尔都语 *kotwāl* 相关），在历史语境中指掌管治安、巡逻、拘留等事务的地方官员。现代英语里多用于历史叙述、殖民时期文献或文学作品描写。"]}
{"word":"cotwin","summary":{"en":"A cotwin is one of a pair of twins—your twin sibling, especially in scientific contexts.","zh":"cotwin 指双胞胎中的一个、某人的孪生兄弟/姐妹，尤其常见于科研语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"One of a pair of twins; a person's twin sibling (often used in medical or research writing).","zh":"双胞胎中的一个；某人的孪生兄弟/姐妹（常用于医学或研究语境）。"},"examples":[{"en":"In the study, each participant was compared with their cotwin.","zh":"在这项研究中，每位参与者都与其同胞胎（cotwin）进行比较。"},{"en":"She asked her cotwin to come to the appointment too.","zh":"她请她的同胞胎也一起来赴约。"},{"en":"Identical twins share more genes than fraternal twins, but each person still differs from their cotwin in some ways.","zh":"同卵双胞胎共享更多基因，但每个人在某些方面仍与自己的同胞胎不同。"}]}],"synonyms":["twin","twin sibling","twin brother","twin sister"],"phonetic":"/ˈkoʊtwɪn/","extraExplanation":["“cotwin”也常写作“co-twin”，其中“co-”表示“共同、一起”。在日常口语里更常说“twin (brother/sister)”或直接说“my twin”。","在遗传学、心理学与流行病学研究中很常见“cotwin control study”（同胞胎对照研究）：用一对双胞胎互相作对照，帮助区分遗传与环境因素的影响。"]}
{"word":"cotwinned","summary":{"en":"“Cotwinned” (more often “co-twinned”) means “paired/twinned with another,” especially for towns/cities or closely matched counterparts.","zh":"“cotwinned”（更常写作“co-twinned”）指“与另一方结成双生/结对关系”，常用于姐妹城市或紧密对应的对象。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(past participle/adj.) Twinned together; paired with another person, place, or thing as a “twin,” often meaning closely linked or matched.","zh":"（过去分词/形容词）与另一人/地/物“结成双生（姐妹）关系”的；成对的；紧密对应的。"},"examples":[{"en":"The two cities are cotwinned, so they host student exchanges every year.","zh":"这两座城市是姐妹城市（结成双生关系），所以每年都会举办学生交流。"},{"en":"In the story, the heroine feels cotwinned with her brother in both talent and trouble.","zh":"在故事里，女主角觉得自己与哥哥在才华与麻烦上都像是“同胞双生”。"}]},{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of co-twin) To make two things “twins”; to formally link or pair them as counterparts.","zh":"（co-twin 的过去式/过去分词）使两者成为“双生/姐妹/对应体”；正式结对、建立对应关系。"},"examples":[{"en":"The council cotwinned the town with a partner community overseas.","zh":"市政委员会把这座小镇与海外的伙伴社区结成了姐妹城镇。"},{"en":"Several schools were cotwinned to share teachers and resources.","zh":"几所学校被结对合作，以共享教师与资源。"}]}],"synonyms":["twinned","paired","linked","matched","sister-city (context)"],"phonetic":"/koʊˈtwɪnd/","extraExplanation":["“cotwinned”更常见的写法是带连字符的 **co-twinned**（或动词 **co-twin**）。在日常语境里，它常与城市交流相关，接近 **twin towns / sister cities（姐妹城市）** 的概念。","如果你是在材料科学/晶体学文章里看到的，**twinned** 也可能指“晶体孪晶”的结构；但 **co-twinned** 作为拼写在普通英语里相对少见，具体含义要看上下文。"]}
{"word":"cotwist","summary":{"en":"“cotwist” (usually written “co-twist”) means to twist strands together, especially in textiles/ropes, or the combined twist itself.","zh":"“cotwist”（多写作“co-twist”）指把多股材料合捻在一起（常见于纺织/绳索），也可指这种合捻形成的捻度。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Uncommon) To twist two or more strands together at the same time; to twist together with another strand or thread.","zh":"（不常见）将两股或多股材料同时拧在一起；与另一股线/纤维一起合捻。"},"examples":[{"en":"Some yarns are co-twisted to make them stronger.","zh":"有些纱线会进行合捻以增强强度。"},{"en":"The manufacturer co-twists two fibers to improve durability.","zh":"厂家将两种纤维合捻以提高耐用性。"}]},{"partOfSpeech":"n.","definition":{"en":"(Uncommon) A twist made by twisting strands together; a combined twist in yarn, rope, or cable.","zh":"（不常见）合捻形成的捻度/捻纹；纱线、绳索或电缆中的复合捻。"},"examples":[{"en":"A tighter co-twist can reduce fraying.","zh":"更紧的合捻可以减少起毛/磨损。"}]}],"synonyms":["twist together","ply","intertwine","twine"],"phonetic":"/koʊ twɪst/","extraExplanation":["“cotwist”在日常英语中非常少见，更常写作带连字符的“co-twist”。如果你是在材料、纺织、绳索或电缆的语境里看到它，通常就是“合捻/一起拧”。","如果你想表达一般意义上的“把……拧在一起”，更常用的动词是“twist together”或“twist into”。也可能是拼写错误（例如想写“coexist”“cow twist”等），你可以把原句发我，我能帮你确认。"]}
{"word":"Coty","summary":{"en":"Coty is most commonly a beauty and fragrance company/brand name; it can also refer to François Coty, the French perfumer behind the name.","zh":"Coty 常指美妆与香氛公司/品牌名称；也可指同名的法国调香师弗朗索瓦·科蒂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A global beauty company and brand name best known for perfumes, cosmetics, and fragrances (Coty Inc.).","zh":"科蒂：一家全球美妆公司/品牌名称，以香水、化妆品与香氛产品闻名（Coty Inc.）。"},"examples":[{"en":"Coty makes a wide range of fragrances and makeup products.","zh":"科蒂生产多种香水和化妆品。"},{"en":"She bought a perfume made by Coty at the duty-free shop.","zh":"她在免税店买了一款科蒂出品的香水。"}]},{"partOfSpeech":"n.","definition":{"en":"François Coty (1874–1934), a French perfumer and entrepreneur, often credited as a key figure in modern perfumery and perfume marketing.","zh":"弗朗索瓦·科蒂（1874–1934）：法国调香师与企业家，常被认为是现代香水工业与香水营销的重要人物。"},"examples":[{"en":"François Coty helped shape the modern perfume business.","zh":"弗朗索瓦·科蒂推动了现代香水行业的发展。"}]}],"phonetic":"/ˈkoʊti/","extraExplanation":["“Coty”通常读作 /ˈkoʊti/，在日常语境中多指品牌或公司名。作为专有名词，首字母大写；提到公司时也可写作“Coty Inc.”。","该品牌名称来自创始人 François Coty。历史上，他因把“香氛+精美瓶身设计+大众化营销”结合起来而广为人知，对香水的商业化与流行文化传播影响很大。"]}
{"word":"cotyl","summary":{"en":"A rare noun meaning a cup-shaped socket in anatomy, or an ancient cup/unit of measure.","zh":"一个较少见的名词：可指解剖学中的“杯状关节窝”，也可指古代的杯子或容量单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anatomy) A cup-shaped cavity in a bone where another bone fits, forming a joint (especially the hip socket).","zh":"（解剖）骨头上杯状的窝/腔，用来容纳另一块骨头形成关节（尤指髋关节的关节窝）。"},"examples":[{"en":"The femoral head fits into the cotyl to form the hip joint.","zh":"股骨头嵌入关节窝（cotyl），形成髋关节。"},{"en":"In some textbooks, the hip socket is described as a deep cotyl.","zh":"在一些教材中，髋臼会被描述为一个很深的“杯状关节窝”（cotyl）。"}]},{"partOfSpeech":"n.","definition":{"en":"(History) An ancient cup or a unit of liquid measure based on a cup.","zh":"（历史）古代的杯子；或以“杯”为基础的液体容量单位。"},"examples":[{"en":"The recipe mentions a cotyl of wine, using an old unit of measure.","zh":"这个配方提到“一杯（cotyl）葡萄酒”，使用的是古老的计量单位。"},{"en":"A cotyl was sometimes used to describe a small drinking cup in ancient writings.","zh":"在古代文字中，cotyl 有时用来指一个小酒杯。"}]}],"synonyms":["cotyle","cotylus","acetabulum","socket"],"phonetic":"/ˈkɑtəl/","extraExplanation":["cotyl 源自希腊语 kotylē（意为“杯子、杯状物”）。因此它在解剖学里常用来比喻“像杯子一样的骨窝”（如髋臼），在历史语境里也可指“杯”或以杯为基准的容量。","现代英语里更常见的相关词是 cotyle / cotylus（同源词），医学或解剖学文章中出现频率比 cotyl 更高。"]}
{"word":"cotyla","summary":{"en":"Cotyla means a cup-shaped socket (especially the hip socket) or an ancient Greek “cup” measure of capacity.","zh":"cotyla 可指杯状的骨性关节窝（尤指髋臼），也可指古希腊的“杯”这一容量单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anatomy) A cup-shaped cavity or socket in a bone; especially the hip socket (acetabulum).","zh":"（解剖）骨头上杯状的凹窝/关节窝；尤指髋臼（髋关节的窝）。"},"examples":[{"en":"In anatomy texts, the hip’s socket may be described as a cotyla (the acetabulum).","zh":"在一些解剖学教材中，髋部的关节窝可能会被称为 cotyla（即髋臼）。"},{"en":"The rounded head of the femur fits into the cotyla to form the hip joint.","zh":"股骨头嵌入 cotyla（关节窝）中形成髋关节。"}]},{"partOfSpeech":"n.","definition":{"en":"(History) An ancient Greek unit of capacity (a “cup”), used for measuring liquids and dry goods.","zh":"（历史）古希腊的容量单位（“一杯”），用于计量液体或谷物等。"},"examples":[{"en":"A recipe from antiquity might call for a cotyla of wine or oil.","zh":"古代的配方可能会写“加一 cotyla 的酒或橄榄油”。"},{"en":"Scholars sometimes convert a cotyla into modern milliliters for clarity.","zh":"学者有时会把 cotyla 换算成现代的毫升以便理解。"}]}],"synonyms":["acetabulum","socket","cup (measure)"],"phonetic":"/ˈkɑːtɪlə/","extraExplanation":["词源来自希腊语 kotýlē，意为“杯子/杯状物”。因此它既能指“像杯子一样的骨性凹窝”，也能指“杯”这一容量概念。","作为容量单位时，不同城邦和时代的数值会有差异；在现代资料中常被近似换算（大约在四分之一升左右），具体以所引用的史料体系为准。"]}
{"word":"cotylar","summary":{"en":"Cotylar means “related to a cup-shaped joint cavity,” especially the hip socket (acetabulum).","zh":"cotylar 指“与关节杯状凹（杯状窝）有关的”，尤指髋关节的髋臼。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a cup-shaped cavity in a joint—especially the hip socket (the acetabulum).","zh":"（解剖）与关节的“杯状窝/杯状凹”有关的，尤指髋关节的髋臼（acetabulum，髋臼窝）。"},"examples":[{"en":"The surgeon inspected the cotylar rim of the hip socket.","zh":"外科医生检查了髋臼边缘（髋关节的杯状窝边缘）。"},{"en":"Damage to the cotylar surface can affect how smoothly the joint moves.","zh":"杯状关节面受损会影响关节活动的顺畅度。"}]}],"synonyms":["acetabular","cotyloid"],"phonetic":"/ˈkɑtələr/","extraExplanation":["这个词比较少见，多用于医学/解剖学语境。词根来自希腊语 kotylē（意为“杯子”），强调“杯状”的形状；因此常与髋臼（hip socket/acetabulum）相关。常见近义/相关词：acetabular（髋臼的）、cotyloid（杯状窝的，较旧用法）。"]}
{"word":"cotyle","summary":{"en":"Cotyle is a rare anatomical term meaning a small cup-shaped socket in a bone, especially the hip socket.","zh":"Cotyle 是较少见的解剖学词，指骨头上杯状的小凹窝/关节臼，尤指髋臼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small cup-shaped cavity or socket in a bone, especially the hip socket (acetabulum) or other similar anatomical “cup.”","zh":"（解剖）杯状的小凹窝／骨臼；常指髋臼（髋关节的“杯状”窝），也可指其他类似的骨性“杯”。"},"examples":[{"en":"In anatomy class, we learned that the hip joint fits into a cup-like socket called a cotyle.","zh":"在解剖课上，我们学到髋关节嵌入一个像杯子一样的关节窝，叫 cotyle。"},{"en":"The report described damage around the cotyle of the pelvis.","zh":"报告描述了骨盆髋臼（cotyle）周围的损伤。"}]}],"synonyms":["acetabulum","socket","cup-shaped cavity"],"phonetic":"/ˈkɑːtəl/","extraExplanation":["这个词比较少见，多出现在解剖学、医学或古典学术写作中。来源与希腊语有关，原意接近“杯、杯状容器”，所以在解剖里用来指“杯状的窝/臼”。现代医学英语更常用的是 acetabulum（髋臼）；cotyle 往往带有更“书面/古典”的风格。"]}
{"word":"cotyledon","summary":{"en":"A cotyledon is a seed leaf—one of the first leaves to appear when a seed germinates.","zh":"cotyledon 指“子叶”，即种子发芽时最先出现的叶之一。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A seed leaf: one of the first leaves that appears when a plant seed starts to grow (germinate).","zh":"子叶：种子开始发芽时最先出现的叶（幼叶）之一。"},"examples":[{"en":"After the seed sprouted, two cotyledons opened and turned green in the light.","zh":"种子发芽后，两片子叶展开，在光照下变绿。"},{"en":"The cotyledons often provide stored food to the young plant before true leaves grow.","zh":"在真叶长出之前，子叶常为幼苗提供储存的养分。"}]}],"synonyms":["seed leaf"],"phonetic":"/ˌkɑt̬əˈlidn̩/","extraExplanation":["“cotyledon”常用于基础植物学：双子叶植物（dicots）通常有两片子叶，单子叶植物（monocots，如玉米、草类）通常只有一片子叶。这是常见的分类线索之一，但现代分类也会结合DNA等证据。","词源来自希腊语 kotylēdōn，原意与“杯状/凹形”有关；早期观察者可能用它来形容某些子叶或胚结构的形状。"]}
{"word":"cotyledonal","summary":{"en":"Cotyledonal means “related to the cotyledon (seed leaf) of a plant embryo.”","zh":"cotyledonal 意为“与子叶（种子胚中的种子叶）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a cotyledon (a seed leaf in an embryo of a flowering plant), or to the stage/structures involving cotyledons.","zh":"子叶的；与子叶（种子胚中的“种子叶”）有关的；与子叶阶段/结构相关的。"},"examples":[{"en":"Cotyledonal tissue stores nutrients that help the seedling grow after germination.","zh":"子叶组织储存营养，帮助幼苗在发芽后生长。"},{"en":"The researchers compared cotyledonal and true leaves under a microscope.","zh":"研究人员在显微镜下比较了子叶和真叶。"}]}],"synonyms":["cotyledonary","seed-leaf (related, informal)"],"phonetic":"/ˌkɑːtəˈliːdənəl/","extraExplanation":["“cotyledonal”多见于植物学、农业与生物学论文或教材，日常英语里很少用。","相关核心词：cotyledon（子叶）。双子叶植物（dicot）通常有两片子叶；单子叶植物（monocot）通常有一片子叶。","常见搭配：cotyledonal leaves（子叶）、cotyledonal node（子叶节）、cotyledonal stage（子叶期）。"]}
{"word":"cotyledonar","summary":{"en":"Cotyledonary means “related to cotyledons,” the first seed leaves of a plant embryo.","zh":"cotyledonary 意为“子叶的；与子叶有关的”，子叶是植物胚胎最早出现的“种子叶”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Relating to a cotyledon (a “seed leaf”) or to cotyledons.","zh":"（植物学）与子叶（“种子叶”）有关的；子叶的。"},"examples":[{"en":"The cotyledonary leaves emerge first when many seedlings sprout.","zh":"许多幼苗发芽时，最先长出来的是子叶。"},{"en":"Researchers compared cotyledonary growth under different light levels.","zh":"研究人员比较了不同光照条件下子叶的生长情况。"}]}],"synonyms":["seed-leaf (related)","embryonic (plant, related)"],"phonetic":"/ˌkɑtɪˈliːdənˌɛri/","extraExplanation":["“cotyledonar”多半是拼写误差，标准形式通常是 **cotyledonary**（子叶的）。相关名词 **cotyledon** 指“子叶”，是种子萌发后最早出现的叶状结构之一。","子叶常用于基础分类概念：**monocot**（单子叶植物）通常有1片子叶，如禾本科；**dicot/eudicot**（双子叶/真双子叶植物）通常有2片子叶，如豆科。子叶有时主要负责储存/提供养分，有时也会进行光合作用。"]}
{"word":"cotyledonary","summary":{"en":"“Cotyledonary” means “related to the cotyledons (seed leaves) of a plant embryo.”","zh":"“cotyledonary”意为“与植物胚的子叶（种子叶）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a cotyledon (a “seed leaf”), especially the cotyledons of a plant embryo inside a seed.","zh":"与子叶（“种子叶”）有关的，尤指种子中植物胚的子叶。"},"examples":[{"en":"Cotyledonary leaves often look different from the plant’s true leaves.","zh":"子叶常常看起来与植物的真叶不同。"},{"en":"The cotyledonary stage is an early part of a seedling’s development.","zh":"子叶期是幼苗发育的早期阶段。"}]}],"synonyms":["seed-leaf (related)","embryonic-leaf (related)"],"phonetic":"/ˌkɑt̬əlɪˈdoʊnəri/","extraExplanation":["“cotyledonary”来自“cotyledon（子叶）+ -ary（……的）”。常见于植物学/农业学语境，如“cotyledonary node（子叶节）”“cotyledonary stage（子叶期）”。","子叶的功能因植物类型而异：有的主要负责储存并提供养分，有的会在幼苗出土后短暂进行光合作用。"]}
{"word":"cotyledonoid","summary":{"en":"Cotyledonoid means “cotyledon-like,” describing something that resembles a seed leaf in form.","zh":"cotyledonoid 表示“似子叶的”，用于描述外形像种子子叶的结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a cotyledon (a seed leaf), especially in shape or structure.","zh":"似子叶的；在形状或结构上像子叶的（子叶是种子萌发后最先出现的“叶”）。"},"examples":[{"en":"Under the microscope, the fungus formed cotyledonoid lobes that looked like tiny seed leaves.","zh":"在显微镜下，这种真菌形成了似子叶的裂片，看起来像微小的种子叶。"},{"en":"The report describes a cotyledonoid appearance at the base of the sprout.","zh":"报告描述幼芽基部呈现似子叶的外观。"}]}],"synonyms":["cotyledon-like","cotyledonous (context-dependent)"],"phonetic":"/ˌkɑtəlˈiːdəˌnɔɪd/","extraExplanation":["“cotyledonoid”由“cotyledon（子叶）+ -oid（……状的/类似的）”构成，常见于植物学、真菌学或病理/形态学描述中，用来强调“看起来像子叶”的外形特征，而不一定真的与子叶有同一来源或功能。"]}
{"word":"cotyledonous","summary":{"en":"An adjective meaning “having or relating to cotyledons (seed leaves),” often used in classifying plants as monocotyledonous or dicotyledonous.","zh":"形容词，意为“具有/与子叶（种子叶）有关的”，常用于按子叶数量将植物分为单子叶或双子叶。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having cotyledons (seed leaves) in the embryo; relating to plants classified by the number of seed leaves (e.g., monocotyledonous or dicotyledonous).","zh":"具有子叶（种子叶）的；与胚中的子叶有关的；用于按子叶数量（如单子叶、双子叶）对植物进行分类的。"},"examples":[{"en":"Most grasses are monocotyledonous, meaning they have one cotyledon in the seed.","zh":"大多数禾本科植物是单子叶植物，意思是种子里只有一片子叶。"},{"en":"Beans are dicotyledonous, so their seedlings usually show two seed leaves at first.","zh":"豆类是双子叶植物，所以幼苗通常一开始会出现两片子叶。"}]}],"synonyms":["seed-leaved","monocotyledonous","dicotyledonous"],"phonetic":"/ˌkɑt̬.əl.ɪˈdiː.nəs/","extraExplanation":["“cotyledonous”常见于生物学/植物学写作与教材中，日常英语里更常直接说“monocot”或“dicot”（单子叶/双子叶）。","词源上与“cotyledon（子叶）”有关；在植物分类中，子叶数量常与叶脉形态、根系类型、花部结构等特征一起用于概括区分（例如：单子叶多为平行叶脉，双子叶多为网状叶脉，但也有例外）。"]}
{"word":"cotyledons","summary":{"en":"Cotyledons are the seed leaves of a plant—early leaves in the embryo that often feed and support the seedling.","zh":"Cotyledons 指“子叶”，是植物胚中的最早叶片，常在发芽初期为幼苗提供养分与支持。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A seed leaf: one of the first leaves of a plant embryo inside a seed, often appearing as the first leaves when the seed sprouts.","zh":"子叶：种子里植物胚的“胚叶/种子叶”，常在发芽时最先长出来，看起来像最早的叶子。"},"examples":[{"en":"Beans and peas have two cotyledons, so they are dicots.","zh":"豆类（如菜豆、豌豆）有两片子叶，所以它们属于双子叶植物。"},{"en":"When the seed germinates, the cotyledons may provide food for the young plant.","zh":"种子发芽时，子叶可能为幼苗提供养分。"},{"en":"In some seedlings, the cotyledons look different from the true leaves that grow later.","zh":"有些幼苗的子叶外形和后来长出的真叶不一样。"}]}],"synonyms":["seed leaves","seed leaf"],"phonetic":"/ˌkɑːt̬əlˈiːdənz/","extraExplanation":["“cotyledon”常用于生物学/植物学语境。基础分类里常见“单子叶植物（monocots）”与“双子叶植物（dicots）”，分别通常有一片或两片子叶（现代分类更复杂，但入门这样理解很实用）。","词源来自希腊语，原意与“杯状/凹形”有关，因为早期观察者觉得子叶形状像小杯。"]}
{"word":"Cotyleus","summary":{"en":"Cotyleus is mainly seen as a scientific Latin genus name; very rarely it can be understood from its roots as meaning “cup-shaped.”","zh":"Cotyleus 主要作为生物分类学中的拉丁化属名出现；极少情况下可从词根理解为“杯状的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a scientific (Latin) genus name used in taxonomy for certain animals; its exact meaning depends on the field and species being classified.","zh":"（生物分类学）一种拉丁化的属名，用于某些动物的分类；具体指哪一类生物要看使用它的学科与物种语境。"},"examples":[{"en":"In the paper, the specimens were assigned to the genus Cotyleus.","zh":"在论文中，这些标本被归入 Cotyleus 属。"},{"en":"Cotyleus is written in italics because it is a genus name.","zh":"Cotyleus 要用斜体书写，因为它是属名。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare, from Greek/Latin roots) cup-shaped; relating to a cup-like cavity or socket.","zh":"（罕见；源自希腊语/拉丁语词根）杯状的；与杯状的凹陷或“窝/臼”有关的。"},"examples":[{"en":"Some anatomical terms come from roots meaning “cup-shaped.”","zh":"一些解剖学术语源自表示“杯状”的词根。"},{"en":"The word is related to roots used in terms for socket-like structures.","zh":"这个词与一些表示“窝状/臼状”结构的术语词根有关。"}]}],"synonyms":["(taxonomy) genus name","(adj., rare) cup-shaped"],"phonetic":"/kɑːˈtɪliəs/","extraExplanation":["Cotyleus 作为属名时，属于“新拉丁语（Neo-Latin）”命名体系的一部分：属名首字母大写、通常斜体；如果后面再加一个小写的种加词（species epithet），就构成双名法（如 Genus species）。","词根上常见的关联是希腊语 kotýlē（意为“杯、杯状器皿”），因此在医学/生物学术语里常会引申出“杯状、窝状、臼状”的含义。若你告诉我它出现在哪本书/哪篇论文里（或给我一句原文），我可以帮你确定它具体指的生物类群或更准确的释义。"]}
{"word":"cotyliform","summary":{"en":"Cotyliform means “cup-shaped,” especially in scientific descriptions.","zh":"Cotyliform 指“杯状的”，常用于科学或学术描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Cup-shaped; shaped like a small cup or hollow cavity.","zh":"杯状的；呈小杯或凹陷腔形的。"},"examples":[{"en":"Some flowers have cotyliform petals that collect rainwater.","zh":"有些花的花瓣呈杯状，会聚集雨水。"},{"en":"Under the microscope, the fossil shows a cotyliform depression.","zh":"在显微镜下，这块化石显示出一个杯状凹陷。"}]}],"synonyms":["cup-shaped","cuplike","concave","caliciform"],"phonetic":"/ˌkɑtɪˈlɪfɔrm/","extraExplanation":["这个词很少出现在日常英语中，多见于生物学、植物学、动物解剖学与古生物学等学术写作，用来精确描述“像小杯子一样的形状”。","词根来源于希腊语 kotylē（意为“杯、小碗”）+ -form（“形状”）。与更常见的 cup-shaped / cuplike 相比，cotyliform 更偏正式、技术性。"]}
{"word":"cotyligerous","summary":{"en":"A rare botanical adjective meaning “bearing cotyledons (seed leaves).”","zh":"一个少见的植物学形容词，意为“具有/带有子叶（种子叶）的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having or bearing cotyledons (seed leaves), especially describing a seed or embryo that shows cotyledons.","zh":"（植物）具有或带有子叶（种子叶）的；常用于描述能看到子叶的种子或胚。"},"examples":[{"en":"Under the microscope, the embryo is clearly cotyligerous.","zh":"在显微镜下，这个胚显然是有子叶的。"},{"en":"The botanist compared cotyligerous embryos in several related species.","zh":"这位植物学家比较了几个近缘物种的有子叶胚。"},{"en":"Cotyligerous development is a key stage in early seed growth.","zh":"有子叶的发育是种子早期生长的关键阶段。"}]}],"synonyms":["cotyledonary","cotyledonous","with cotyledons"],"phonetic":"/ˌkɑtɪlˈɪdʒərəs/","extraExplanation":["这是一个非常少见、偏学术的词，主要见于较旧的植物学文献。现代更常用的相关表达是 cotyledonary（子叶的）、with cotyledons（带子叶的），或在分类语境中用 monocot/dicot（单子叶/双子叶）来讨论。","词源上 cotyl- 来自希腊语，和“杯状/凹陷”有关（可联想 cotyle），-gerous 表示“携带/产生/负载”（如 danger-ous 不是同一词缀，但 -gerous 与 “bear/carry” 概念相关）。"]}
{"word":"cotyliscus","summary":{"en":"A rare scientific term meaning a small cup-like cavity or socket, used mostly in older anatomy/zoology writing.","zh":"一个罕见的科学用语，指小的杯状凹陷或关节窝，多见于较早期的解剖/动物学文献。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, anatomy/zoology) A small cup-shaped cavity or socket; a diminutive form of “cotylus/cotyle” (a cup or socket), sometimes used in older scientific descriptions.","zh":"（罕见；解剖/动物学）小的杯状凹陷或关节窝；为“cotylus/cotyle（杯、窝）”的指小形式，常见于较早期的科学描述。"},"examples":[{"en":"In older anatomy texts, the hip socket may be described with terms related to cotylus, such as cotyliscus.","zh":"在较早期的解剖学教材里，髋关节窝有时会用与 cotylus 相关的词来描述，例如 cotyliscus。"},{"en":"The researcher noted a shallow cotyliscus-like depression on the bone surface.","zh":"研究者注意到骨表面有一个浅浅的、类似小杯状凹陷（cotyliscus）的结构。"}]}],"synonyms":["cotyle","cotylus","acetabulum (context-dependent)"],"phonetic":"/ˌkɑtəˈlɪskəs/","extraExplanation":["这个词非常少见，更多出现在拉丁化的解剖/动物学术语传统里，而不是现代日常英语或常用医学英语。","词源上与希腊语 kotylē（“杯、杯状容器”）有关，因此含义通常围绕“杯状”“窝状”“关节窝/凹陷”来理解。阅读旧文献时，可把它当作“cotyle / acetabulum（髋臼、关节窝）”这类概念的近缘或指小表达。"]}
{"word":"cotyloid","summary":{"en":"“Cotyloid” means cup-shaped, especially describing the socket-like hip cavity in anatomy.","zh":"“Cotyloid”意为“杯状的”，多用于解剖学，尤指髋臼等类似关节窝的结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Cup-shaped; shaped like a deep hollow or socket (especially used in anatomy, e.g., the hip socket).","zh":"杯状的；呈深凹窝/关节窝形的（尤用于解剖学，如髋臼/髋关节窝）。"},"examples":[{"en":"The femoral head fits into the cotyloid cavity of the pelvis.","zh":"股骨头嵌入骨盆的杯状关节窝（髋臼）中。"},{"en":"In anatomy texts, “cotyloid” often describes a socket-like structure.","zh":"在解剖学教材里，“cotyloid”常用来形容类似关节窝的结构。"}]}],"synonyms":["cup-shaped","socket-shaped","acetabular"],"phonetic":"/ˈkɑt̬əˌlɔɪd/","extraExplanation":["“cotyloid”是比较少见、偏医学/解剖学的词，常见搭配有：cotyloid cavity（髋臼/髋臼窝）、cotyloid notch（髋臼切迹）。在现代医学英语里，更常用的词是 acetabular（髋臼的）。","词源来自希腊语 kotylē（小杯/杯状容器）+ -oid（“像……的、……形的”），所以字面意思就是“像小杯一样的”。"]}
{"word":"cotyloidal","summary":{"en":"Cotyloidal means cup-shaped, especially describing the acetabulum (hip socket).","zh":"Cotyloidal 指“杯状的”，尤用于描述髋臼（髋关节的关节窝）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Cup-shaped; especially relating to the acetabulum (the cup-like socket of the hip joint).","zh":"杯状的；尤指与髋臼（髋关节中杯状的关节窝）有关的。"},"examples":[{"en":"The report described a cotyloidal lesion near the hip socket.","zh":"报告描述了髋臼附近的杯状（cotyloidal）病灶。"},{"en":"The femoral head fits into the cotyloidal cavity of the pelvis.","zh":"股骨头嵌入骨盆的髋臼杯状关节窝中。"}]}],"synonyms":["acetabular","cotyloid","cup-shaped"],"phonetic":"/ˌkɑt̬əˈlɔɪdəl/","extraExplanation":["“cotyloidal”在现代英语里较少见，更常见的相关词是“cotyloid”（也可作形容词）或“acetabular”（髋臼的）。医学/解剖学语境中，cotyloid/cotyloidal多用来强调“杯状结构”，尤其指髋臼的形态。","词源上与希腊语“kotylē（小杯、杯状器）”有关，因此它常带有“像杯子一样凹陷、可容纳”的形状含义。"]}
{"word":"Cotylophora","summary":{"en":"Cotylophora is a Latinized scientific genus name used in taxonomy, mainly seen in biology.","zh":"Cotylophora 是拉丁化的生物“属名”，主要出现在生物学与分类学语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific genus name used in biological classification (taxonomy); it refers to a particular group of organisms rather than a common everyday English word","zh":"（生物分类学中的）属名：用于指代某一类生物的科学名称，不是日常英语常用词"},"examples":[{"en":"Cotylophora is mentioned in some taxonomic lists, but it is not a word you would usually see outside biology.","zh":"Cotylophora 会出现在一些分类名录中，但在生物学以外的语境里一般不会见到。"},{"en":"The paper compares species that were once placed in Cotylophora with related genera.","zh":"这篇论文比较了曾被归入 Cotylophora 的物种与相关属之间的差异。"}]}],"synonyms":["genus name","taxonomic genus","scientific name"],"phonetic":"/ˌkɑtɪˈlɑfərə/","extraExplanation":["这是拉丁化的学名形式（genus name）。学名在英文里通常首字母大写并用斜体书写：*Cotylophora*。","词根常见解释来自希腊语：*kotylē*（“杯、杯状物”）+ *-phora*（“携带、承载”），常用于表示“带有……形状/结构”的命名方式。","不同数据库或不同时期的分类系统里，*Cotylophora* 可能会被视为有效属名、异名（synonym）或被并入其他属；具体含义需要结合你看到它的学科领域（植物、动物、寄生虫等）与出处来确认。"]}
{"word":"cotylophora","summary":{"en":"Cotylophora is a scientific genus name used in biological classification (often seen in zoological/parasitology contexts).","zh":"Cotylophora 是生物分类学中的属名（常见于动物学/寄生虫学语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scientific name) A genus name used in biology; it refers to an organism group recognized in scientific classification (most commonly recorded in zoological contexts for parasitic flatworms).","zh":"（科学名称）生物分类学中的“属名”；用于指代一个被科学分类系统认可的生物类群（常见记录多见于动物学语境，如某些寄生扁形动物）。"},"examples":[{"en":"The paper reports Cotylophora specimens collected from livestock in a rural area.","zh":"论文报告了在农村地区从家畜体内采集到的 Cotylophora 标本。"},{"en":"Under the microscope, the parasite was identified as Cotylophora based on its anatomical features.","zh":"在显微镜下，根据其解剖特征，这种寄生虫被鉴定为 Cotylophora。"}]}],"synonyms":["(no common everyday synonyms; scientific name)"],"phonetic":"/ˌkɑːtɪˈlɑːfərə/","extraExplanation":["这个词更像是“拉丁学名/属名”，一般不用于日常英语对话，而出现在论文、标本记录、寄生虫学或分类学资料中。","需要提醒：Cotylophora 在资料中有时会与非常接近的名称（如 Cotylophoron）混淆或被误写；如果你是在文章/图片里看到的，建议提供上下文或原句，我可以帮你确认具体指的是哪一类生物以及常见中文名。"]}
{"word":"cotylophorous","summary":{"en":"Cotylophorous means “bearing cup-shaped (sucker-like) structures,” used mainly in scientific biology writing.","zh":"Cotylophorous 指“带有杯状（吸盘状）结构的”，主要用于生物学等学术写作。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Technical, biology) Having or bearing cup-shaped structures called cotyles (suckers) or cotyledon-like “cup” parts; sucker-bearing / cup-bearing.","zh":"（生物学术语）具有或带有称为 cotyle（杯状吸盘/杯状结构）或类似子叶的“杯状”部分；带杯状结构的、带吸盘的。"},"examples":[{"en":"Some parasites are described as cotylophorous because they have cup-like suckers used to attach to a host.","zh":"一些寄生动物被描述为 cotylophorous，因为它们有杯状吸盘，用来附着在宿主上。"},{"en":"The paper uses cotylophorous to describe an organism with several small, cup-shaped attachment organs.","zh":"论文用 cotylophorous 来描述一种具有多个小型杯状附着器官的生物。"}]}],"synonyms":["cup-bearing","sucker-bearing"],"phonetic":"/ˌkɑːtɪˈlɑːfərəs/","extraExplanation":["词源提示：cotylo- 来自希腊语 kotylē（“杯、杯状容器”），-phorous 表示“携带、具有”。因此 cotylophorous 字面意思就是“带杯状结构的”。","这是较少见的学术描写词，常出现在动物学/寄生虫学等文献中，用来形容“有杯状吸附结构”的形态特征。不同领域对 cotyle 的具体指代可能略有差异，阅读时以文章给出的解剖定义为准。"]}
{"word":"cotylopubic","summary":{"en":"“Cotylopubic” is an anatomical adjective meaning “connected with the acetabulum and the pubis.”","zh":"“cotylopubic”是解剖学形容词，意思是“与髋臼和耻骨相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to both the acetabulum (hip socket) and the pubis (front part of the pelvic bone).","zh":"（解剖）与髋臼（髋关节窝）和耻骨（骨盆前部）两者有关的。"},"examples":[{"en":"The surgeon identified a cotylopubic structure near the anterior hip joint.","zh":"外科医生在髋关节前方附近辨认出一个与髋臼—耻骨相关的结构。"},{"en":"Some anatomy texts mention the cotylopubic region when describing pelvic attachments.","zh":"一些解剖学教材在描述骨盆附着点时会提到髋臼—耻骨相关区域。"}]}],"synonyms":["acetabulopubic"],"phonetic":"/ˌkɑtɪloʊˈpjuːbɪk/","extraExplanation":["这是一个较少见、偏专业的解剖学形容词，常见于描述“连接/邻近髋臼与耻骨”的结构（例如韧带、纤维束或附着点）。","词源上，cotylo- 来自希腊语 kotylē（“杯、窝”），在解剖中常指髋臼；-pubic 与 pubis（耻骨）相关。"]}
{"word":"cotylosacral","summary":{"en":"Cotylosacral means “related to the hip socket (acetabulum) and the sacrum.”","zh":"cotylosacral 指“与髋臼（髋关节窝）和骶骨相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the cotylus (hip socket/acetabulum) and the sacrum (the bone at the base of the spine).","zh":"与髋臼（髋关节的“窝”）以及骶骨（脊柱底部的骨骼）有关的。"},"examples":[{"en":"The report mentioned cotylosacral pain near the back of the hip.","zh":"报告提到靠近髋部后侧的髋臼—骶骨相关疼痛。"},{"en":"The doctor examined the cotylosacral region to check for joint or ligament problems.","zh":"医生检查了髋臼—骶骨相关区域，以查看是否存在关节或韧带问题。"}]}],"synonyms":["acetabulosacral","hip-sacro (informal/rare)"],"phonetic":"/ˌkɑːtɪloʊˈseɪkrəl/","extraExplanation":["这是一个较少见的解剖/医学形容词，多用于描述“髋臼（cotylus/acetabulum）与骶骨（sacrum）附近或相关结构”的位置、疼痛或病变范围。","词源提示：cotyl- 来自希腊语，原意与“杯/窝”有关，在解剖学里常指髋臼（acetabulum）；sacral 指骶骨或骶部。"]}
{"word":"cotylosaur","summary":{"en":"A cotylosaur is an early, primitive reptile known from Paleozoic fossils; the term is common in older scientific writing.","zh":"cotylosaur 指古生代化石中发现的一类早期原始爬行动物；该术语在较早的科学文献中更常见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An early, primitive reptile from the late Paleozoic era, traditionally grouped as a basal (very early) reptile and often discussed in relation to the ancestors of later reptiles.","zh":"一种早期、原始的爬行动物，生活在古生代晚期；传统上被归为非常早期的爬行动物类群，常在讨论后来爬行动物的祖先时提到。"},"examples":[{"en":"Cotylosaurs are often mentioned when scientists talk about the earliest evolution of reptiles.","zh":"科学家讨论爬行动物最早的演化时，常会提到“cotylosaurs”。"},{"en":"In some older textbooks, cotylosaur fossils are used to illustrate primitive reptile features.","zh":"在一些较旧的教材里，会用“cotylosaur”的化石来说明原始爬行动物的特征。"}]}],"synonyms":["primitive reptile","early reptile (general)"],"phonetic":"/ˌkɑːtɪloʊˈsɔːr/","extraExplanation":["“cotylosaur”常见于较早的古生物学分类体系中；现代分类里，这个词更多作为历史用语或非正式的总称来使用，因为相关动物的亲缘关系已被更精细地重新划分。","词源来自希腊语词根：kotylē（“杯形/凹形”之意）+ sauros（“蜥蜴/爬行动物”），名称与某些骨骼结构的形态描述有关。"]}
{"word":"Cotylosauria","summary":{"en":"Cotylosauria is an older scientific term for some early, primitive reptiles, now rarely used in modern classification.","zh":"Cotylosauria（杯龙类）是较旧的科学术语，指早期、原始爬行动物的一类；现代分类中已较少使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an old scientific name for a group of early, primitive reptiles (now mostly considered part of the larger group Amniota); often used in older textbooks and fossil studies","zh":"（旧称）杯龙类：早期、原始爬行动物的一类（现代分类多不再单独使用，常并入更大的“羊膜动物”范围），多见于较早的教材与化石研究文献"},"examples":[{"en":"Older paleontology books sometimes describe Cotylosauria as the earliest true reptiles.","zh":"较早的古生物学书有时把杯龙类描述为最早的真正爬行动物。"},{"en":"In modern classification, the term Cotylosauria is used less often than Amniota.","zh":"在现代分类中，“杯龙类”这个术语不如“羊膜动物”常用。"}]}],"synonyms":["primitive reptiles","early amniotes (approx.)"],"phonetic":"ˌkɑːtɪloʊˈsɔːriə","extraExplanation":["“Cotylosauria”是历史上曾使用的分类名称，常用来指一些早期的“原始爬行动物/爬行形类”。随着系统发生学（按演化关系分类）发展，学界更倾向使用更精确、可反映亲缘关系的术语（如 Amniota 羊膜动物、Sauropsida 蜥形类等），因此该词在新文献中相对少见。","词源来自希腊语：cotyl-（杯、杯状）+ -sauria（蜥蜴/爬行动物），带有“杯状结构的蜥蜴类”这类早期命名风格。"]}
{"word":"cotylosauria","summary":{"en":"Cotylosauria is an outdated scientific term for some early primitive reptiles; modern classifications usually use more specific group names.","zh":"Cotylosauria 是用于某些早期原始爬行动物的旧式科学术语；现代分类通常改用更具体的类群名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an older scientific name for a group of early, primitive reptiles (often treated as stem reptiles), now mostly replaced by other classifications such as Captorhinomorpha or broader terms like early amniotes","zh":"“Cotylosauria（杯椎龙类/杯椎龙亚纲）”是早期、较原始爬行动物的一种旧式科学分类名称（常被视为“爬行动物的基干类群”），如今多已被其他分类（如 Captorhinomorpha）或更宽泛的术语（如早期羊膜动物）所取代"},"examples":[{"en":"Older textbooks sometimes use Cotylosauria to describe very early reptiles from the Paleozoic era.","zh":"较早的教科书有时会用 Cotylosauria 来指称古生代的非常早期爬行动物。"},{"en":"In modern research papers, you’re more likely to see specific groups named instead of Cotylosauria.","zh":"在现代研究论文中，比起 Cotylosauria，更常见的是直接使用更具体的类群名称。"}]}],"synonyms":["early reptiles","stem reptiles","Captorhinomorpha (in some modern classifications)"],"phonetic":"/ˌkɑːtəloʊˈsɔːriə/","extraExplanation":["这是一个“历史性的分类名”，在不同年代、不同作者的体系里覆盖范围可能不一致，所以阅读老文献时要注意作者具体把哪些化石类群归入 Cotylosauria。","词源上可拆为 cotylo-（意为“杯/杯状”）+ -sauria（蜥蜴/爬行动物类），属于典型的古生物学拉丁/希腊构词方式。","如果你在学习演化史：Cotylosauria 常被用来泛指“早期爬行动物/早期羊膜动物的某些基干支系”，但现代系统发育分类更强调谱系关系，因此更倾向使用更明确的支系名称。"]}
{"word":"cotylosaurian","summary":{"en":"An academic adjective meaning “connected with early cotylosaurs,” primitive reptile-like animals in the Paleozoic.","zh":"学术用形容词，指“与杯椎龙类（早期类爬行动物四足动物）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to, or resembling the cotylosaurs—an early group of reptile-like tetrapods from the late Paleozoic era (often discussed as early reptiles or close relatives of reptiles).","zh":"与（或类似于）“杯椎龙类/杯椎龙形类”（cotylosaurs）有关的——一种生活在古生代晚期的早期类爬行动物四足动物（常被讨论为早期爬行动物或与爬行动物很近的近亲）。"},"examples":[{"en":"Some textbooks use “cotylosaurian” to describe primitive reptile features in early fossils.","zh":"一些教材用“cotylosaurian”来描述早期化石中较原始的爬行动物特征。"},{"en":"The paper compares cotylosaurian skull anatomy with that of later reptiles.","zh":"这篇论文比较了cotylosaurian的头骨结构与后期爬行动物的差异。"}]}],"synonyms":["cotylosaur-like","primitive reptilian","early reptile (context-dependent)"],"phonetic":"/ˌkɑːtɪloʊˈsɔːriən/","extraExplanation":["这是一个很偏学术的古生物学/比较解剖学用词，常见于论文或教材里。日常英语几乎不会用到。","“Cotylosaur”在较旧的分类体系中较常见；现代研究更常用更精确的类群名称（例如与“爬行动物基干/羊膜动物早期演化”相关的具体支系）。因此你可能在老教材或历史文献里更常见到“cotylosaurian”。"]}
{"word":"cotype","summary":{"en":"A cotype is one of the original specimens used to describe a species, especially when no single holotype was chosen (often called a syntype).","zh":"cotype 指描述物种时使用的原始标本之一，尤其在未指定正模时（常等同于 syntype，并模标本）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology, taxonomy) A specimen that is part of the original material used to describe and name a species, especially when no single holotype was designated; also called a syntype.","zh":"（生物学/分类学）共同模式标本：在描述并命名某一物种时所依据的一组原始标本之一，尤其是在未指定单一正模（holotype）时；也常称为“同型标本/并模标本”（syntype）。"},"examples":[{"en":"The museum holds two cotypes of the butterfly described in 1898.","zh":"这家博物馆保存着1898年所描述那种蝴蝶的两件共同模式标本。"},{"en":"Because the author did not name a holotype, the specimens in the series were treated as cotypes.","zh":"由于作者没有指定正模，这一系列标本就被视为共同模式标本。"}]}],"synonyms":["syntype","type specimen"],"phonetic":"/ˈkoʊtaɪp/","extraExplanation":["“cotype”主要见于较早或部分文献；现代分类学更常用“syntype（并模标本）”。如果后来研究者从这些并模中选出一个作为“lectotype（选模）”，其余标本称为“paralectotype（副选模）”。"]}
{"word":"cotypes","summary":{"en":"“Cotypes” are multiple reference specimens used together to describe a species when no single holotype was designated.","zh":"“Cotypes”指在未指定单一正模标本时，用来共同描述并命名物种的多份参考标本。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of cotype) In biological taxonomy, two or more specimen examples that were used together to describe and name a species when no single “holotype” (one main reference specimen) was chosen.","zh":"（cotype 的复数）在生物分类学中，用来共同描述并命名某一物种、且未指定单一“正模标本”（holotype）时所依据的两份或多份标本。"},"examples":[{"en":"The original paper listed three cotypes collected from different islands.","zh":"原始论文列出了来自不同岛屿的三份共模标本（cotypes）。"},{"en":"Researchers re-examined the cotypes to confirm the species’ diagnostic features.","zh":"研究人员重新检视这些共模标本，以确认该物种的鉴别特征。"}]}],"synonyms":["syntypes"],"phonetic":"/ˈkoʊtaɪp/","extraExplanation":["“cotype”在较旧的分类学文献里较常见；现代动物命名法规（ICZN）更常用的对应术语是“syntype（同模标本）”，指在未指定正模时，发表时所依据的一组标本。不同学科与年代的用词可能略有差异，阅读论文时可留意作者采用的命名法规与术语表。","发音以单数 cotype（/ˈkoʊtaɪp/）为准，复数 cotypes 只是加 -s。"]}
{"word":"Cotys","summary":{"en":"“Cotys” usually means the plural or possessive form of “Coty,” most commonly referring to Coty Inc., a beauty and fragrance company.","zh":"“Cotys”通常是“Coty”的复数或所有格形式；“Coty”最常指美妆与香水公司科蒂集团（Coty Inc.）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Cotys: plural form of “Coty,” or the possessive form (“Coty’s”). “Coty” is most commonly a proper name, especially the name of an international beauty and fragrance company (Coty Inc.).","zh":"Cotys：通常是“Coty”的复数形式，或表示所有格（即“Coty’s”）的写法。“Coty”多用作专有名词，最常见的是指一家国际美妆与香水公司（科蒂集团，Coty Inc.）。"},"examples":[{"en":"Cotys are often found in the cosmetics aisle, but “Coty” is usually written as a brand name, not as a common noun.","zh":"Cotys 有时会被当作“科蒂产品”来泛指，但“Coty”通常作为品牌名使用，而不是普通名词。"},{"en":"The report compared Coty’s sales with other beauty companies’ sales.","zh":"这份报告把科蒂（Coty）的销售额与其他美妆公司的销售额作了对比。"}]}],"synonyms":["Coty (proper name)","Coty’s (possessive form)"],"phonetic":"ˈkoʊti","extraExplanation":["“Cotys”本身在日常英语里不算常见词形：多数情况下你会看到“Coty”（品牌名）或“Coty’s”（所有格，如“Coty’s products”科蒂的产品）。如果你是在句子里看到“Cotys”，很可能是：①把品牌名当作可数名词的复数来用（较口语/非正式）；②省略了撇号的所有格拼写错误，原意是“Coty’s”。"]}
{"word":"cotys","summary":{"en":"“cotys” is usually a nonstandard way to write the plural of “Coty” or to refer to the Coty brand; the standard forms are “Coty,” “Cotys” (rare), and “Coty’s” (possessive).","zh":"“cotys”多为非规范写法：通常指“Coty”的复数或泛指Coty品牌；更规范的写法是“Coty”（常用）、“Cotys”（较少见）以及所有格“Coty’s”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"plural form of Coty (a company name) or Coty (a surname); also used as a possessive form in writing (e.g., “Coty’s”).","zh":"Coty 的复数（公司名或姓氏）；也常被当作所有格写法使用（如“Coty’s”）。"},"examples":[{"en":"Many investors follow Cotys in the beauty industry, but the usual spelling is “Coty,” not “Cotys.”","zh":"很多投资者会关注美妆行业里的“Cotys”，但更常见、规范的写法是“Coty”，而不是“Cotys”。"},{"en":"I bought Coty’s perfume last week. (possessive)","zh":"我上周买了 COTY 的香水。（所有格）"}]},{"partOfSpeech":"other","definition":{"en":"informal/creative spelling some people use online to refer to Coty products or the Coty brand in general.","zh":"网络上较随意/创意的拼写，用来泛指 Coty 这个品牌或其产品。"},"examples":[{"en":"She posted a review of “cotys” fragrances on her blog.","zh":"她在博客上发了对“cotys”香氛的测评。"}]}],"synonyms":["Coty","Coty’s","Coty products"],"phonetic":"/ˈkoʊti/","extraExplanation":["“Coty”通常指香水与美妆公司 Coty Inc.（常写作 COTY）。在英文里：\n- 复数：Cotys（不太常见，更多时候直接说 “Coty products/brands”）\n- 所有格：Coty’s（表示“Coty 的……”）\n如果你是想查常见英文单词，可能是拼错了；你也可以告诉我你原本想表达的词或句子，我可以帮你纠正。"]}
{"word":"Cotyttia","summary":{"en":"Cotyttia: an ancient Greek night festival honoring the Thracian goddess Cotys, often described as secret and ecstatic.","zh":"Cotyttia：古希腊为色雷斯女神科提斯举行的夜间庆典，常被描述为神秘、狂喜式的宗教活动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ancient Greece) A nocturnal religious festival held in honor of Cotys (Kotys), a Thracian goddess, often linked in Greek writing with ecstatic rites and secrecy.","zh":"（古希腊）为色雷斯女神科提斯（Cotys/Kotys）举行的夜间宗教节庆；在希腊文献中常被描述为带有狂喜式仪式与神秘色彩的庆典。"},"examples":[{"en":"Some ancient writers mention the Cotyttia as a secret night festival associated with ecstatic worship.","zh":"一些古代作家提到，Cotyttia 是一种带有秘密性质、在夜间进行并与狂喜式崇拜相关的节庆。"},{"en":"In classical studies, the Cotyttia is often discussed alongside other mystery-like rites in the Greek world.","zh":"在古典学研究中，Cotyttia 常与希腊世界其他类似“秘仪”的宗教仪式一起讨论。"}]}],"synonyms":["festival of Cotys","Kotyttia (variant spelling)"],"phonetic":"/kəˈtɪtiə/","extraExplanation":["“Cotyttia”来自女神名 Cotys（也拼作 Kotys）。在英语里它多作为古典学术语出现，指与该女神相关的节庆，而不是现代常用词。","古代资料对该节庆的描述可能带有外来宗教（色雷斯/希腊边缘地区）被希腊主流文化“他者化”的视角，因此现代研究常会谨慎看待其“放纵、淫乱”等标签化说法。"]}
{"word":"cotyttia","summary":{"en":"Cotyttia refers to an ancient nocturnal festival/rite for the Thracian goddess Cotys, often described in classical sources as an ecstatic secret ritual.","zh":"Cotyttia 指古代祭祀色雷斯女神科提斯的夜间节庆/祭仪，古典文献中常将其描述为带狂喜与秘密性质的仪式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ancient history) A nocturnal festival/ritual in honor of Cotys (also spelled Kotys), a Thracian goddess; in Greek and Roman writing it is often described as an ecstatic, secretive rite.","zh":"（古代史）祭祀色雷斯女神科提斯（Cotys/ Kotys）的夜间节庆/仪式；在希腊与罗马文献中常被描写为狂喜式、带秘密性质的祭仪。"},"examples":[{"en":"Some ancient authors mention the Cotyttia as a late-night rite associated with ecstatic dancing.","zh":"一些古代作者提到 Cotyttia 是与狂喜式舞蹈相关的深夜祭仪。"},{"en":"In classical studies, “Cotyttia” may appear when discussing Greek views of foreign cults.","zh":"在古典学讨论中，“Cotyttia”常出现在谈论希腊人如何看待外来宗教崇拜的语境里。"}]}],"synonyms":["rites of Cotys","cult of Cotys","orgiastic rites (context-dependent)"],"phonetic":"/koʊˈtɪtiə/","extraExplanation":["“Cotyttia”主要见于古典文献与学术写作，不是现代日常英语词汇。它通常被用来指一类仪式/节庆，而不是一个普通的“节日名称”。","词形来源：Cotys（女神名）+ -ia（常见的名词后缀，用来表示与某事相关的活动/事物）。","阅读时的小提示：古代作者对“外来”宗教仪式的描写常带有偏见或夸张色彩（例如强调“放纵”“淫乱”等），现代研究会更谨慎地看待这些描述。"]}
