{"word":"covado","summary":{"en":"Covado is an old Portuguese/Brazilian length unit similar to a cubit, often used for measuring cloth.","zh":"Covado 是葡萄牙/巴西旧制长度单位，类似“肘尺”，常用于量布等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historical Portuguese (and Brazilian) unit of length, roughly comparable to a cubit (the length from the elbow to the tip of the middle finger).","zh":"（葡萄牙及巴西旧制）长度单位，约相当于“肘尺”（从手肘到中指指尖的长度）。"},"examples":[{"en":"The fabric was measured in covados in older Portuguese records.","zh":"在较早的葡萄牙文献中，布料常用 covado 来丈量。"},{"en":"Merchants once sold cloth by the covado rather than by the meter.","zh":"商人过去常按 covado 而不是按米来卖布。"}]}],"synonyms":["cubit","ell","old unit of length"],"phonetic":"/koʊˈvɑːdoʊ/","extraExplanation":["“covado”不是现代常用英语词，多出现在历史、贸易、度量衡或翻译语境中；在现代葡语里更常见的对应词是“côvado”。","不同地区与不同时期的 covado 具体长度可能不一致（像许多旧制单位一样会有地方差异），阅读史料时常需要看当时的换算标准。"]}
{"word":"covalence","summary":{"en":"Covalence is a type of chemical bonding where atoms share electrons.","zh":"covalence 指原子通过共享电子形成的共价键类型或性质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) The kind of chemical bonding in which atoms share pairs of electrons.","zh":"（化学）共价（键）的性质或类型：原子通过共享电子对形成的化学键。"},"examples":[{"en":"Water (H₂O) forms because oxygen and hydrogen share electrons in covalence.","zh":"水（H₂O）之所以形成，是因为氧和氢通过共价共享电子。"},{"en":"Covalence is common in many molecules such as methane (CH₄) and carbon dioxide (CO₂).","zh":"共价在许多分子中很常见，比如甲烷（CH₄）和二氧化碳（CO₂）。"}]}],"synonyms":["covalency","covalent bonding"],"phonetic":"/koʊˈveɪləns/","extraExplanation":["“covalence”在现代英语中相对少见，更常用的是“covalent bond（共价键）”或“covalency（共价性）”。在考试或教材里，你更可能看到“covalent”。","共价键通常发生在非金属原子之间；与“ionic bond（离子键）”不同，共价键不是“转移电子”，而是“共享电子”。","相关概念：单键/双键/三键（shared electron pairs 的数量不同）；以及“electronegativity（电负性）”差异会影响共价键的极性（polar/nonpolar）。"]}
{"word":"covalences","summary":{"en":"“Covalences” means plural instances of covalence—covalent bonding formed by sharing electron pairs.","zh":"“covalences”指“covalence”的复数：通过共享电子对形成的共价键合/共价性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) Covalent bonding; the property of atoms sharing pairs of electrons to form a chemical bond. “Covalences” is the plural of “covalence.”","zh":"（化学）共价键合；原子通过共享电子对形成化学键的性质。“covalences”是“covalence（共价性/共价键合）”的复数。"},"examples":[{"en":"Single, double, and triple covalences differ in how many electron pairs are shared.","zh":"单键、双键和三键的共价键合差异在于共享了多少对电子。"},{"en":"Carbon can form several covalences, which helps it build long chains and rings.","zh":"碳可以形成多种共价键合，这使它能够构成长链和环状结构。"}]}],"synonyms":["covalent bonding","covalency","covalent bond"],"phonetic":"/koʊˈveɪləns/","extraExplanation":["在现代教材中，更常见的说法是“covalent bond（共价键）”或“covalency（共价性）”。“covalence”这个词在一些旧式或特定语境中会出现，但日常学习与写作里用前两者更自然。"]}
{"word":"covalency","summary":{"en":"Covalency is the number of covalent bonds an atom forms in a molecule.","zh":"Covalency 指原子在分子中形成的共价键数量（共价数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the number of chemical bonds an atom can form with other atoms; a measure of an atom’s combining power in a molecule","zh":"（原子的）共价数；指一个原子能与其他原子形成的共价键数量，用来表示原子在分子中的结合能力"},"examples":[{"en":"Carbon usually has a covalency of four in organic molecules.","zh":"在有机分子中，碳通常具有四的共价数。"},{"en":"Oxygen often shows a covalency of two, forming two covalent bonds.","zh":"氧常见的共价数是二，会形成两个共价键。"}]}],"synonyms":["bonding capacity","valence (in covalent bonding context)"],"phonetic":"/koʊˈveɪlənsi/","extraExplanation":["在基础化学里，covalency 通常等同于“形成的共价键的数目”。它与 valency（化合价/价）有关，但有时会分开使用：valency 更广义，可能包含离子键情形；covalency 更强调“共价键”这一种成键方式。","与 oxidation state（氧化态）不同：氧化态是把键当作“完全离子化”来分配电子后的记账结果；covalency 是实际形成了多少条共价键。"]}
{"word":"covalent","summary":{"en":"Covalent describes a type of chemical bonding where atoms share electrons; it can also be used figuratively for a very strong connection.","zh":"covalent 指“共价的”，主要用于化学中表示原子通过共享电子成键；也可引申指非常紧密的联系。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Relating to a chemical bond in which atoms share one or more pairs of electrons.","zh":"（化学）指共价键的：原子通过共享一对或多对电子而形成的化学键。"},"examples":[{"en":"Water (H₂O) contains covalent bonds between hydrogen and oxygen.","zh":"水（H₂O）中，氢和氧之间存在共价键。"},{"en":"A covalent compound often forms between nonmetal elements.","zh":"共价化合物通常由非金属元素之间形成。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative, less common) Very closely linked or bound together; strongly connected.","zh":"（引申义，较少见）紧密相连的；关系非常牢固的。"},"examples":[{"en":"In that team, trust and responsibility felt almost covalent.","zh":"在那个团队里，信任与责任几乎像“共价”一样紧密相连。"},{"en":"Their shared experience created a covalent bond between them.","zh":"共同的经历在他们之间形成了牢固的纽带。"}]}],"synonyms":["shared-electron (chemistry)","strongly linked (figurative)","tightly connected (figurative)"],"phonetic":"/koʊˈveɪlənt/","extraExplanation":["“covalent”常用于科学写作与课堂语境，和“ionic（离子的）”并列对比：ionic bond 是“电子转移”，covalent bond 是“电子共享”。","词源：co-（共同）+ valence（化合价/价），字面意思是“共同的价”，用来表达原子共同参与成键。"]}
{"word":"covalently","summary":{"en":"“Covalently” means “by forming covalent bonds (sharing electrons).”","zh":"“covalently”意为“以共价方式（通过共享电子形成共价键）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that involves a covalent bond—atoms sharing pairs of electrons.","zh":"以共价方式；涉及共价键（原子通过共享电子对形成的键）的方式。"},"examples":[{"en":"In water, oxygen is covalently bonded to hydrogen.","zh":"在水中，氧与氢通过共价键相连。"},{"en":"The drug binds covalently to the enzyme, so the effect can last longer.","zh":"这种药物与酶发生共价结合，因此作用可能持续更久。"}]}],"synonyms":["by covalent bonding","covalent-bondedly"],"phonetic":"/koʊˈveɪləntli/","extraExplanation":["“covalently”常见于化学、生物化学与材料科学文章里，表示“通过共享电子形成的结合方式”。与之相对的是“ionically（离子地）”，指通过电子转移产生带电离子后靠静电吸引结合。","在生物化学语境中，“covalently binds”往往暗示结合更强、更难逆转（但并非永远不可逆），因此在谈药物作用机制、蛋白修饰（如共价修饰）时很常见。"]}
{"word":"Covarecan","summary":{"en":"“Covarecan” is not a common English dictionary word; it’s likely a proper name or a misspelling.","zh":"“Covarecan”不是常见的英语词典词条；更可能是专有名词或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in major dictionaries; it may be a proper name (e.g., a surname/place/brand) or a misspelling of another word.","zh":"不是主要英语词典中的标准词；可能是专有名词（如姓氏/地名/品牌），或是其他词的拼写错误。"},"examples":[{"en":"I couldn’t find “Covarecan” in an English dictionary—could you share a sentence where you saw it?","zh":"我在英语词典里找不到“Covarecan”——你能提供你看到它的句子吗？"},{"en":"“Covarecan” might be a family name or a product name rather than an English vocabulary word.","zh":"“Covarecan”可能是姓氏或产品名，而不是英语词汇。"}]}],"phonetic":"/ˌkoʊvəˈriːkən/","extraExplanation":["从拼写来看，Covarecan 更像专有名词或外来语（也可能来自罗马尼亚语等语言的姓氏/地名）。如果你告诉我它出现的语境（句子、领域、国家/地区、是否人名/公司名），我可以帮你判断它最可能指什么，以及是否对应某个常见英文词（例如 covariant、covariate 等统计学术语）。"]}
{"word":"covarecan","summary":{"en":"“covarecan” is not a recognized English word; it may be a misspelling (often of “covariance” or “covariant”).","zh":"“covarecan”不是常见或标准英语词；可能是拼写错误（常见为“covariance”或“covariant”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling or a name. In English dictionaries, “covarecan” does not have an established meaning.","zh":"不是标准英语单词；更可能是拼写错误或专有名词。在英语词典中通常找不到“covarecan”的固定释义。"},"examples":[{"en":"I couldn’t find “covarecan” in an English dictionary—did you mean “covariance”?","zh":"我在英语词典里找不到“covarecan”——你是不是想写“covariance（协方差）”？"}]}],"phonetic":"/ˌkoʊ.vəˈriː.kæn/","extraExplanation":["“covarecan”很像拼写误差。最常见的可能是：\n1) covariance /koʊˈvɛriəns/（统计学：协方差）\n2) covariant /koʊˈvɛriənt/（形容词：协变的；随…共同变化的）\n如果你能提供：它出现的句子、学科背景（统计/编程/数学/人名地名）、或正确拼写的截图，我可以给出准确释义和例句。"]}
{"word":"Covarecas","summary":{"en":"“Covarecas” is not a recognized English vocabulary word; it’s likely a proper name or a misspelling.","zh":"“Covarecas”不是常见英语词汇，更可能是专名或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It most likely is a proper name (e.g., a surname, username, brand, or place name) or a misspelling of another word.","zh":"不是标准英语单词。更可能是专有名称（如姓氏、用户名、品牌或地名），或是某个英文词的拼写错误。"},"examples":[{"en":"I couldn’t find “Covarecas” in an English dictionary—where did you see it?","zh":"我在英语词典里查不到“Covarecas”——你是在哪里看到的？"},{"en":"If “Covarecas” is a person’s name, its meaning depends on the language/culture it comes from.","zh":"如果“Covarecas”是人名，它的含义取决于它所属的语言/文化背景。"}]}],"phonetic":"/ˌkoʊvəˈrɛkɑz/","extraExplanation":["“Covarecas”看起来像专名或外来语拼写（可能来自某种语言的姓名/地名），因此在英语词典中通常不会作为普通词条出现。","如果你把它当作英文词来查，请提供：1）原句或截图；2）它出现的领域（游戏/社交媒体/论文/地名等）；3）你想表达的意思或可能的正确拼写。我可以据此判断它是不是某个英文词（例如 covariance、coveralls 等）被拼错。"]}
{"word":"covarecas","summary":{"en":"“covarecas” is not a standard English word; it’s likely a misspelling or a non-English/proper noun term.","zh":"“covarecas”不是标准英语词，可能是拼写错误或非英语/专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a word from another language.","zh":"不是标准英语单词，可能是拼写错误或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “covarecas” in an English dictionary—did you mean “cover” or “cavernous”?","zh":"我在英语词典里找不到“covarecas”——你是不是想写“cover（覆盖/封面）”或“cavernous（像洞穴一样的/巨大的）”？ "},{"en":"If you tell me the sentence you saw it in, I can help identify the intended word.","zh":"如果你把它出现的句子发我，我可以帮你判断原本想表达的词。"}]}],"extraExplanation":["“covarecas”在常见英语词典中没有收录。最常见的情况是：\n1）拼写打错（多打/少打字母）；\n2）专有名词（人名、地名、品牌名）；\n3）其他语言的词（例如西班牙语、罗马尼亚语等）。\n\n建议你：把它出现的完整句子、语境（文章主题/截图），以及你想表达的大概意思发来，我就能更准确地帮你对照可能的正确词。"]}
{"word":"covariable","summary":{"en":"A covariable is a variable that varies together with another variable; in many statistics contexts, people more often say “covariate.”","zh":"covariable 指与另一变量共同变化的变量；在许多统计语境中更常用的说法是 covariate（协变量）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A variable that changes together with another variable (especially in mathematics), often used to describe variables that are related or jointly varying.","zh":"（尤指数学中）与另一变量一起变化的变量；用于描述彼此相关、共同变化的变量。"},"examples":[{"en":"In the formula, x is a covariable of y because changing x changes y.","zh":"在这个公式中，x 是 y 的协变量，因为 x 的变化会引起 y 的变化。"},{"en":"We studied two covariables to see how temperature and pressure change together.","zh":"我们研究了两个协变量，以观察温度和压力如何一起变化。"}]}],"synonyms":["covariate (common in statistics)","related variable","associated variable"],"phonetic":"/ˌkoʊˈvɛriəbəl/","extraExplanation":["“covariable”在一般英语里不算常见，更常见的是统计学里的“covariate（协变量）”，指在模型中作为控制变量/解释变量加入的变量（例如回归中的控制变量）。如果你是在统计或机器学习语境中想表达“协变量”，通常应优先用“covariate”。","在更偏数学的语境里，“covariable”有时用来强调“共同变化”的关系（co- + variable）。不同教材/领域用法可能不一致，写作时最好根据你所在课程或论文的习惯用词选择。"]}
{"word":"covariables","summary":{"en":"“Covariables” are variables included to control for or explain factors that may influence an outcome in a statistical analysis.","zh":"“Covariables（协变量）”指在统计分析中加入、用来控制或解释可能影响结果因素的变量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In statistics, variables that are included in an analysis (often a regression or experiment) to help explain, adjust for, or control differences that might affect the outcome.","zh":"在统计学中，指在分析（常见于回归或实验）里加入的变量，用来解释、校正或控制可能影响结果的差异。"},"examples":[{"en":"The researchers added age and income as covariables to control for background differences.","zh":"研究人员把年龄和收入作为协变量加入，以控制背景差异。"},{"en":"After adjusting for covariables, the treatment effect became smaller.","zh":"在校正协变量之后，治疗效果变小了。"},{"en":"Common covariables in health studies include sex, smoking status, and body mass index.","zh":"健康研究中常见的协变量包括性别、吸烟状况和体重指数。"}]}],"synonyms":["covariates","control variables","explanatory variables"],"phonetic":"/koʊˈvɛriəbəlz/","extraExplanation":["“covariable(s)”在统计语境里常与“covariate(s)”互换使用；很多教材与论文更常用covariate。","协变量通常不是研究的主要“处理/干预变量”（treatment），而是用来减少混杂（confounding）、提高比较的公平性与估计的准确性。","在实验或回归中加入协变量常被称为“adjust for covariables / control for covariables（校正/控制协变量）”。"]}
{"word":"covariance","summary":{"en":"Covariance is a statistical measure of how two variables (or asset returns) move together.","zh":"Covariance（协方差）是衡量两个变量（或资产收益）是否同向/反向一起变动的统计指标。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A measure in statistics of how two variables change together (whether they tend to increase/decrease at the same time). A positive covariance means they often move in the same direction; a negative covariance means they often move in opposite directions.","zh":"统计学中衡量两个变量如何一起变化的指标（它们是否倾向于同时上升/下降）。协方差为正表示常同向变动；为负表示常反向变动。"},"examples":[{"en":"The covariance between study time and test scores was positive, so more studying generally came with higher scores.","zh":"学习时间与考试成绩的协方差为正，因此学习越多通常分数越高。"},{"en":"If stock A goes up when stock B goes down, their covariance may be negative.","zh":"如果股票A上涨时股票B下跌，它们的协方差可能为负。"}]},{"partOfSpeech":"n.","definition":{"en":"In finance and data analysis, the value used to describe how the returns of two assets move together; often used when building a portfolio and estimating risk.","zh":"在金融与数据分析中，用来描述两种资产收益率如何共同变动的数值；常用于构建投资组合并估计风险。"},"examples":[{"en":"Portfolio risk depends on each asset’s volatility and the covariance between their returns.","zh":"投资组合风险取决于各资产的波动性以及它们收益之间的协方差。"},{"en":"Analysts compute a covariance matrix to summarize relationships among many stocks.","zh":"分析师会计算协方差矩阵来概括多只股票之间的关系。"}]}],"synonyms":["co-variation","joint variability","covariation"],"phonetic":"/ˌkoʊˈvɛriəns/","extraExplanation":["协方差的单位会随着变量的单位而变化（例如“小时×分数”），因此不便于直接比较强弱。常见做法是把协方差标准化得到“相关系数（correlation）”，其取值在 -1 到 1 之间，更直观。","在数学/统计课本里常见写法：Cov(X, Y)。当 Cov(X, Y)=0 时表示“线性不相关”（uncorrelated），但不一定代表完全没有任何关系（仍可能存在非线性关系）。"]}
{"word":"covariant","summary":{"en":"Covariant means “changing together” (general use) or “transforming according to a specific rule under coordinate changes” (math/physics).","zh":"covariant 指“一起变化/协同变化”（一般用法），或指“在坐标变换下按特定规则变化的（协变）”（数理用法）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Changing in a linked way with something else; varying together.","zh":"（与另一事物）协同变化的；共同变化的。"},"examples":[{"en":"In the study, income and education level are covariant: as one rises, the other often rises too.","zh":"在这项研究中，收入和受教育程度是协同变化的：一个上升时，另一个也常常上升。"},{"en":"The chart shows that temperature and electricity use are covariant during the summer.","zh":"图表显示夏季气温和用电量会一起变化。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Math/physics) Transforming in a specific way when the coordinate system changes, following the standard (covariant) rule.","zh":"（数/物）协变的：当坐标系改变时，按特定（协变）规则进行变换的。"},"examples":[{"en":"A covariant vector changes predictably when you rotate the coordinate system.","zh":"当你旋转坐标系时，协变向量会按可预测的方式变化。"},{"en":"In tensor calculus, some components are covariant and others are contravariant.","zh":"在张量计算中，有些分量是协变的，有些是逆变的。"}]}],"synonyms":["co-varying","correlated (general sense)","mutually varying"],"phonetic":"/koʊˈvɛriənt/","extraExplanation":["“covariant”常见于两大语境：\n1）统计/日常学术写作中，指“两个变量一起变化”（类似“相关”，但强调“随之变化”的关系，不一定说明因果）。\n2）数学与物理（尤其张量、相对论）中，“协变/逆变”描述对象在坐标变换下的变换规则；通常与前缀“co-（共同）”的直观含义相呼应，但技术含义更严格。","词形提示：co-（共同）+ variant（变化的）。相关词：covary（vi. 一起变化）, covariance（n. 协方差）, contravariant（adj. 逆变的）。"]}
{"word":"covariate","summary":{"en":"A covariate is a variable included in statistical analysis to account for its influence on the outcome.","zh":"covariate 指在统计分析中纳入模型、用来控制其对结果影响的变量（协变量）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A variable that may influence the outcome you are studying, and is included in an analysis to control for its effect.","zh":"（统计/研究中）可能影响研究结果的变量；在分析中加入它以控制其影响（协变量）。"},"examples":[{"en":"In the regression model, age was included as a covariate because it affects blood pressure.","zh":"在回归模型中把年龄作为协变量加入，因为它会影响血压。"},{"en":"They adjusted for income as a covariate when comparing health outcomes across neighborhoods.","zh":"在比较不同社区的健康结果时，他们把收入作为协变量进行校正。"}]},{"partOfSpeech":"n.","definition":{"en":"In experiments, a measured factor (not the main treatment) that is related to the response and helps reduce noise when analyzed statistically.","zh":"（实验中）与反应变量相关、但不是主要处理因素的测量因素；在统计分析中可帮助降低误差/噪声。"},"examples":[{"en":"In an education study, students’ pre-test scores can be used as a covariate to make the comparison fairer.","zh":"在教育研究中，学生的前测成绩可以作为协变量，使比较更公平。"},{"en":"Using baseline weight as a covariate improved the precision of the treatment effect estimate.","zh":"把基线体重作为协变量提高了对治疗效应估计的精确度。"}]}],"synonyms":["control variable","predictor","explanatory variable","independent variable"],"phonetic":"/koʊˈvɛriət/","extraExplanation":["“covariate”常见于回归（regression）、方差分析/协方差分析（ANOVA/ANCOVA）等语境。它不一定是“原因”，更多是分析时需要“控制/校正”的相关因素。","易混点：covariate（协变量）≠ confounder（混杂因素）。混杂因素通常指会同时影响“自变量”和“因变量”、可能导致因果解释偏差的变量；协变量更宽泛，指被纳入模型用于调整的变量（可能是混杂因素，也可能只是提高精度的控制变量）。","词形提示：co-（一起）+ variate（变化的变量），字面意思是“与……一起变化的变量”。"]}
{"word":"covariates","summary":{"en":"Covariates are variables included in an analysis to account for factors that may affect the outcome.","zh":"Covariates 指在分析中纳入、用来控制或解释会影响结果的变量（协变量）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Variables that may influence an outcome and are included in analysis to control for their effects or explain differences.","zh":"可能影响结果的变量；在分析中纳入以控制其影响或解释差异的因素。"},"examples":[{"en":"In the study, age and income were used as covariates when analyzing health outcomes.","zh":"在这项研究中，分析健康结果时把年龄和收入作为协变量。"},{"en":"Adding covariates can help reduce bias when comparing two groups.","zh":"加入协变量可以在比较两组时帮助减少偏差。"}]}],"synonyms":["control variables","predictors","explanatory variables"],"phonetic":"/koʊˈvɛriəts/","extraExplanation":["“Covariate”常见于统计学、流行病学、心理学与机器学习语境。直观理解：它不是你主要关心的“自变量/处理因素”，但它会和结果一起变化，若不纳入可能让结论不公平（混杂）。","在回归模型里，covariates 往往就是“控制变量/解释变量”。不过在实验设计中也有人把“treatment（处理）”与“covariates（协变量）”区分开：treatment 是研究者操控的，covariates 是被观测到的背景特征。","单复数：covariate（单数），covariates（复数）。发音重音通常在第一个音节。"]}
{"word":"covariation","summary":{"en":"Covariation means two things change together; in statistics it refers to variables varying together (related to covariance/correlation).","zh":"Covariation 指两者共同变化；在统计学中指变量一起变化的趋势（与协方差/相关有关）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A change that happens in two (or more) things together—when one varies, the other tends to vary as well.","zh":"（两种或多种事物的）共同变化、协同变动——当一个发生变化时，另一个也倾向于跟着变化。"},"examples":[{"en":"Researchers found covariation between hours of sleep and mood.","zh":"研究人员发现睡眠时长与情绪之间存在共同变化。"},{"en":"In economics, there is often covariation between inflation and interest rates.","zh":"在经济学中，通货膨胀与利率之间经常出现协同变动。"},{"en":"The chart suggests covariation, but it does not prove one causes the other.","zh":"这张图表暗示两者共同变化，但并不能证明其中一个导致另一个。"}]},{"partOfSpeech":"n.","definition":{"en":"In statistics/psychology, the tendency for two variables to vary together (often measured by covariance or correlation).","zh":"（统计学/心理学）两个变量一起变化的趋势（常用“协方差”或“相关系数”等指标来衡量）。"},"examples":[{"en":"Covariation is summarized by covariance, which can be positive or negative.","zh":"共同变化可用协方差来概括，它可能为正也可能为负。"},{"en":"People often look for covariation to infer relationships between events.","zh":"人们常通过寻找共同变化来推断事件之间可能存在关联。"}]}],"synonyms":["co-variation","joint variation","cofluctuation","comovement"],"phonetic":"/ˌkoʊˌvɛriˈeɪʃən/","extraExplanation":["词形拆解：co- 表示“共同”，variation 表示“变化”，合起来就是“共同变化”。","易混词：covariation（共同变化，概念） vs. covariance（协方差，统计量/计算结果） vs. correlation（相关，常指标准化后的相关系数或一般相关关系）。","学习提示：看到 covariation 时，先想到“同步变化”，但要注意“相关不等于因果”（correlation ≠ causation）。"]}
{"word":"Covarrubias","summary":{"en":"Covarrubias is usually a Spanish surname; it can also refer to a historic town in northern Spain.","zh":"Covarrubias 通常是一个西班牙语姓氏；也可指西班牙北部一座历史小镇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Spanish-language surname (family name), often associated with notable writers, artists, and scholars.","zh":"一个西班牙语姓氏（家族姓），常与一些知名作家、艺术家和学者相关联。"},"examples":[{"en":"Miguel Covarrubias was a Mexican artist and illustrator known for his caricatures.","zh":"米格尔·科瓦鲁维亚斯（Miguel Covarrubias）是墨西哥艺术家与插画家，以漫画肖像作品闻名。"},{"en":"The book mentioned Covarrubias as an important early lexicographer in Spain.","zh":"这本书提到科瓦鲁维亚斯（Covarrubias）是西班牙早期重要的词典编纂者。"}]},{"partOfSpeech":"n.","definition":{"en":"a small town in northern Spain (Castile and León), known for its historic architecture.","zh":"西班牙北部（卡斯蒂利亚-莱昂大区）的一个小镇，以历史建筑闻名。"},"examples":[{"en":"They stopped in Covarrubias during their road trip through Burgos province.","zh":"他们在穿越布尔戈斯省的自驾途中在科瓦鲁维亚斯（Covarrubias）停留。"}]}],"phonetic":"ˌkoʊvəˈruːbiəs","extraExplanation":["“Covarrubias”通常为专有名词（人名/地名）。在英文文本里常见于西班牙或拉丁美洲语境：\n- 塞巴斯蒂安·德·科瓦鲁维亚斯（Sebastián de Covarrubias，16–17世纪）编写过早期西班牙语词典/语源辞书，对西语词汇研究影响较大。\n- 米格尔·科瓦鲁维亚斯（Miguel Covarrubias，20世纪）以插画、漫画肖像与对巴厘文化的研究而知名。\n读英文时可根据上下文判断指“某位名人”还是“西班牙小镇”。"]}
{"word":"covary","summary":{"en":"Covary means two or more things (especially variables in data) change together in a related way.","zh":"Covary 指两个或多个事物（尤其是数据中的变量）以相关的方式一起变化。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Of two or more variables) to change together in a related way—when one changes, the other tends to change too.","zh":"（两个或更多变量）一起变化、共同变动；当一个变化时，另一个也倾向于随之变化。"},"examples":[{"en":"In the data, exercise time and heart health seem to covary: more exercise is linked to better results.","zh":"在数据中，运动时间和心脏健康似乎会共同变化：运动越多，结果往往越好。"},{"en":"Temperature and electricity use often covary during summer months.","zh":"在夏季，气温和用电量常常会一起变化。"}]},{"partOfSpeech":"vi.","definition":{"en":"To vary in a corresponding way with something else; to show a statistical association (not necessarily cause and effect).","zh":"与另一事物相应地变化；呈现统计上的相关（不一定代表因果关系）。"},"examples":[{"en":"Stress levels covary with sleep quality, but that doesn’t prove one causes the other.","zh":"压力水平与睡眠质量呈相关变化，但这并不能证明两者存在因果关系。"},{"en":"The researcher tested whether income would covary with education level.","zh":"研究者检验了收入是否会与受教育程度呈相关变化。"}]}],"synonyms":["correlate","vary together","be associated"],"phonetic":"/koʊˈvɛri/","extraExplanation":["“covary”常用于统计学、心理学、经济学等学术语境，强调“共同变化/相关变化”。它比“change together”更正式、更偏科研写作。","常见相关词：covariance（协方差，名词）、correlate（相关，动词/名词）。学习时要注意：covary/correlate 描述的是“相关”，不自动等于“因果”。"]}
{"word":"covassal","summary":{"en":"“Covassal” is a rare historical word meaning a fellow vassal under the same lord.","zh":"“covassal”是罕见的历史词，指同属一位领主的“同为封臣的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fellow vassal; someone who holds land or owes service to the same lord (rare, historical).","zh":"同为封臣的人；与某人同属一位领主、同样承担封建义务的封臣（罕见，历史用语）。"},"examples":[{"en":"In the medieval charter, two covassals promised to support each other in a dispute over boundaries.","zh":"在那份中世纪特许状中，两位同为封臣的人承诺在边界争议中互相支持。"},{"en":"He appealed to his covassals for military aid when the region was attacked.","zh":"当该地区遭到攻击时，他向同为封臣的人请求军事援助。"}]}],"synonyms":["fellow vassal","co-vassal"],"phonetic":"/ˌkoʊˈvæsəl/","extraExplanation":["“covassal”通常可理解为“co- + vassal（封臣）”，用于描述封建制度下彼此同属一位领主的封臣关系。这个词在现代英语中非常少见，更多会在历史研究、翻译中世纪文献或仿古写作里出现。","相关背景：欧洲中世纪封建制度中，vassal（封臣）对lord（领主）负有军事或其他服务义务，并以土地等作为回报；“covassal”强调的是同一体系内的“同僚/同级封臣”关系。"]}
{"word":"cove","summary":{"en":"A cove is usually a small, sheltered bay; less commonly, it can mean to curve inward and form a hollow.","zh":"cove 通常指隐蔽的小海湾；较少见时也可作动词，表示向内凹/形成凹陷。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, sheltered bay or inlet along a coast, often with calm water","zh":"（海岸边的）小海湾；小港湾（通常较隐蔽、风浪较小）"},"examples":[{"en":"They anchored their boat in a quiet cove for the night.","zh":"他们把船停在一个安静的海湾里过夜。"},{"en":"A narrow path led down to a hidden cove.","zh":"一条狭窄的小路通向一个隐蔽的小海湾。"},{"en":"We swam in the cove because the water was calmer there.","zh":"我们在海湾里游泳，因为那里的水更平静。"}]},{"partOfSpeech":"v.","definition":{"en":"to form a rounded hollow or curve inward; to make something concave","zh":"（使）内凹；凹入；成弧形凹陷"},"examples":[{"en":"The rock face coves inward, creating a natural shelter.","zh":"岩壁向内凹进去，形成了天然的遮蔽处。"},{"en":"Years of erosion have coved the cliff into a shallow hollow.","zh":"多年的侵蚀使悬崖凹成了一个浅浅的凹陷。"}]}],"synonyms":["inlet","small bay","sheltered bay"],"phonetic":"/koʊv/","extraExplanation":["“cove”最常见指海边“隐蔽的小海湾”。它常出现在旅行、海岸地理和文学描写中，用来营造安静、安全、与世隔绝的氛围。","名词“cove”与动词“cove”相关：海湾往往是海岸线“向内凹”的地方，所以动词义是“凹进去/使成凹形”。动词用法较少，更多见于地理或描写性写作。","相关词：bay（海湾，通常更大更常见）、inlet（狭长水湾/水道入口，更偏地理术语）、cav(e) / cavern（洞穴，概念不同但都与“凹/空”有关）。"]}
{"word":"coved","summary":{"en":"“Coved” most often means having a smooth inward curve (a cove), especially in ceilings or molding; it can also be the past form of “cove.”","zh":"“coved”最常指带有内凹弧面（cove）的，多用于天花或线脚；也可作动词“cove”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Architecture) Having a concave, curved surface (a “cove”), especially where a wall meets a ceiling.","zh":"（建筑）带有“凹弧面/凹槽”（cove）的，尤指墙与天花交接处的内凹弧形过渡。"},"examples":[{"en":"The living room has a coved ceiling that makes the space feel softer and higher.","zh":"客厅有内凹弧形的顶角（coved ceiling），让空间感觉更柔和、更显高。"},{"en":"They installed coved molding along the top of the walls.","zh":"他们在墙顶安装了内凹弧形的线脚（coved molding）。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of “cove”: to shape or form into a cove (a hollow or concave curve).","zh":"“cove”的过去式/过去分词：把……做成凹槽或内凹弧形。"},"examples":[{"en":"The edges were carefully coved to hide the lighting strip.","zh":"边缘被仔细做成内凹弧形，用来隐藏灯带。"},{"en":"The carpenter coved the joint so it would be easier to clean.","zh":"木工把接缝处做成凹弧面，这样更容易清洁。"}]}],"synonyms":["concave","hollowed","curved inward","cove-shaped"],"phonetic":"/koʊvd/","extraExplanation":["在室内设计里，coved 常见搭配有：coved ceiling（弧形顶角/内凹顶）、coved molding（弧形线脚）、coved baseboard（弧形踢脚线）。它强调“内凹的弧面过渡”，与 beveled（斜切的）或 flat（平的）不同。","词源上，cove 本义与“凹处/小湾”相关；建筑里的 cove 借用了“凹进去的空间/曲面”的形象来命名。"]}
{"word":"Covel","summary":{"en":"Covel is most commonly a surname (a family name). It can also be used as a place or building name depending on context.","zh":"Covel 最常见的用法是姓氏（人名）。在不同语境下，它也可能是地名或建筑/机构名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname); a proper noun used to identify a person or family","zh":"姓氏（人名）；用来指代某个人或家族的专有名词"},"examples":[{"en":"Ms. Covel will join the meeting at 3 p.m.","zh":"Covel 女士会在下午三点参加会议。"},{"en":"I found an article written by someone named Covel.","zh":"我找到一篇作者署名为 Covel 的文章。"}]},{"partOfSpeech":"other","definition":{"en":"a name that may also appear as a place name or part of an organization’s name (depending on context)","zh":"也可能作为地名或机构名称的一部分出现（具体含义取决于语境）"},"examples":[{"en":"The event is held at Covel Hall.","zh":"活动在 Covel Hall 举行。"},{"en":"She lives near Covel Road.","zh":"她住在 Covel Road 附近。"}]}],"synonyms":["family name","surname","last name"],"phonetic":"/ˈkʌvəl/","extraExplanation":["“Covel”通常被当作专有名词使用（如姓氏、建筑物名或地名）。如果你是在某个具体文本里看到它（邮件签名、地址、学校建筑等），把前后句贴出来会更容易判断它指的是“人名”还是“地点/机构名”。","在英语里，姓氏一般首字母大写；发音和具体家族来源有关，但学习者在日常交流中把它当作“姓氏”理解通常就够用了。"]}
{"word":"Covell","summary":{"en":"Covell is most commonly a surname, and it can also appear in place or building names that honor someone with that surname.","zh":"Covell 最常见是姓氏；也常用于地名或建筑名，表示该地点以姓为 Covell 的人命名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"姓氏（人名中的姓）。"},"examples":[{"en":"Ms. Covell will lead today’s meeting.","zh":"Covell 女士将主持今天的会议。"},{"en":"I emailed Dr. Covell to ask a question about the assignment.","zh":"我给 Covell 博士发邮件，询问作业问题。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name used for some buildings, streets, or locations (for example, “Covell Hall” or “Covell Boulevard”), usually named after a person with the surname Covell.","zh":"地名/建筑名用法（如“Covell Hall”“Covell Boulevard”等），通常来自以 Covell 这个姓氏命名。"},"examples":[{"en":"Let’s meet outside Covell Hall at 3 p.m.","zh":"我们下午三点在 Covell Hall 外面见。"},{"en":"The bus stops near Covell Boulevard.","zh":"公交车在 Covell Boulevard 附近停。"}]}],"phonetic":"/koʊˈvɛl/","extraExplanation":["“Covell”主要作为英语世界的姓氏使用，日常写作中首字母大写。发音时重音一般在第二个音节（-vell）。","如果你在校园或城市里看到“Covell + 名词（Hall/Library/Blvd 等）”，通常表示以某位 Covell 家族成员或捐赠者命名的地点。"]}
{"word":"covelline","summary":{"en":"Covelline is a less common name for covellite, a blue copper sulfide mineral (CuS).","zh":"Covelline是“covellite（辉铜矿）”的较少见名称，指一种蓝色的铜硫化物矿物（CuS）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a blue to indigo mineral made of copper sulfide (CuS); a less common name for covellite.","zh":"一种呈蓝色到靛蓝色的铜硫化物矿物（CuS）；“covellite（辉铜矿）”的较少见别称。"},"examples":[{"en":"The sample’s deep-blue sheen suggests covelline (covellite).","zh":"这块样品呈深蓝色光泽，可能是covelline（辉铜矿）。"},{"en":"Covelline can form as a secondary mineral in the oxidation zone of copper deposits.","zh":"在铜矿床的氧化带中，covelline可作为次生矿物形成。"}]}],"synonyms":["covellite","copper sulfide (mineral)"],"phonetic":"/ˈkʌvəˌlaɪn/","extraExplanation":["“Covelline”通常被视为“covellite”的拼写变体或旧称，来源于意大利矿物学家Niccolò Covelli的姓氏。","在地质语境中更常用的标准名称是“covellite（辉铜矿）”；若写作“covelline”，多见于某些旧文献、标本标签或非标准用法。"]}
{"word":"covellite","summary":{"en":"Covellite is a rare deep-blue copper sulfide mineral (CuS).","zh":"Covellite（铜蓝矿）是一种罕见的深蓝色硫化铜矿物（CuS）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare blue mineral made mainly of copper sulfide (CuS). It is sometimes found in ore deposits and can be used as a source of copper.","zh":"一种较少见的蓝色矿物，主要成分为硫化铜（CuS）。常见于矿床中，有时可作为铜的矿石来源之一。"},"examples":[{"en":"The rock sample contained covellite, visible as a deep blue coating.","zh":"这块岩石样品含有铜蓝矿，可以看到一层深蓝色的覆盖物。"},{"en":"In some copper mines, covellite appears alongside other copper sulfide minerals.","zh":"在一些铜矿中，铜蓝矿会与其他硫化铜矿物一起出现。"}]}],"synonyms":["copper sulfide (mineral)","CuS (mineral)"],"phonetic":"/koʊˈvɛlaɪt/","extraExplanation":["“covellite”源自意大利矿物学家Niccolò Covelli的姓氏（19世纪），因此属于以人名命名的矿物名称。","铜蓝矿常以鲜明的靛蓝/蓝紫色和金属光泽被辨识；在英文科普或地质描述中，常见搭配有“deep blue”“metallic luster（金属光泽）”“copper sulfide（硫化铜）”。"]}
{"word":"Covelo","summary":{"en":"“Covelo” is most commonly a place name in Northern California; it can also be a surname.","zh":"“Covelo”最常见是美国加州北部的地名；也可作姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a small community (unincorporated town) in Mendocino County, Northern California, U.S.","zh":"美国加利福尼亚州北部门多西诺县的一个小社区（非建制城镇/小镇）"},"examples":[{"en":"He grew up near Covelo in Mendocino County.","zh":"他在门多西诺县的 Covelo 附近长大。"},{"en":"We drove through Covelo on the way to the mountains.","zh":"我们去山里路上开车经过了 Covelo。"}]},{"partOfSpeech":"other","definition":{"en":"a family name (surname).","zh":"一个姓氏（人名）"},"examples":[{"en":"Ms. Covelo will lead the meeting today.","zh":"Covelo 女士今天将主持会议。"}]}],"phonetic":"/koʊˈvɛloʊ/","extraExplanation":["Covelo 常被读作 /koʊˈvɛloʊ/（重音在第二个音节）。在美国语境中，它最常见的是地名：位于加州门多西诺县的 Round Valley（圆谷）地区附近。","如果你是在地图、新闻或旅行语境里看到 Covelo，通常指这个地方；如果出现在人名列表或署名中，则更可能是姓氏。"]}
{"word":"coven","summary":{"en":"A coven is a group or meeting of witches, mainly in folklore or fantasy contexts.","zh":"coven 指女巫的团体或集会，主要见于民俗传说或奇幻语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A secret or private gathering of witches (often in stories or folklore), sometimes described as a group that practices magic together.","zh":"（多见于故事/民俗中）女巫的秘密集会或团体；一起进行巫术活动的女巫群体。"},"examples":[{"en":"In the movie, the heroine joins a coven to learn protective spells.","zh":"在电影里，女主加入了一个女巫团体来学习保护性的咒语。"},{"en":"Local legends spoke of a coven meeting in the forest at night.","zh":"当地传说说有一群女巫会在夜晚的森林里聚会。"}]}],"synonyms":["witches’ circle","witches’ gathering"],"phonetic":"/ˈkʌvən/","extraExplanation":["“coven”常见于西方文学、神话与流行文化（如万圣节题材、奇幻作品）。在现代语境中也可能被某些新异教/巫术实践者用来指自己的小团体，但使用时要注意语境与尊重，避免把现实宗教实践一概等同于刻板的“邪恶女巫”形象。","词源上常被认为来自表示“聚会、集会”的古法语/拉丁语系词根，因此核心含义就是“集会/团体”。"]}
{"word":"Covena","summary":{"en":"“Coven” means a group of witches (often in folklore or fiction).","zh":"“Coven”指女巫的团体或集会（多见于民俗或文学/影视作品）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group or gathering of witches (especially in stories, folklore, or modern pagan traditions).","zh":"女巫的集会；女巫团体（常见于故事、民俗或当代异教传统语境中）。"},"examples":[{"en":"In the novel, a coven meets in the forest at midnight.","zh":"在小说里，一个女巫团体在午夜的森林里聚会。"},{"en":"People in the village feared the coven, even though it was only a rumor.","zh":"村里的人害怕那个“女巫集会”，尽管那只是传闻。"}]}],"synonyms":["witches’ circle","witches’ gathering"],"phonetic":"/ˈkʌvən/","extraExplanation":["“Covena”在英语里不算常见标准词形；你可能想查的是“coven”。“coven”多用于文学、恐怖/奇幻作品或民俗语境，现实生活中提到时通常带有文化与宗教背景（例如某些新异教/威卡传统会用这个词来指小组）。","常见搭配：a coven of witches（女巫团体）、join a coven（加入团体）、a secret coven（秘密集会）。"]}
{"word":"covenable","summary":{"en":"“Covenable” is a very rare/old word meaning “suitable” or “proper.”","zh":"“covenable”是非常少见/古旧用法，意思是“合适的、恰当的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic or very rare) Suitable; proper; fitting for a particular purpose or situation.","zh":"（古义或非常少见）合适的；恰当的；适宜于某种用途或情境的。"},"examples":[{"en":"Please choose a covenable time for the meeting.","zh":"请选一个合适的时间开会。"},{"en":"He wore clothing covenable to the weather.","zh":"他穿了适合天气的衣服。"},{"en":"It is covenable to speak quietly in a library.","zh":"在图书馆里小声说话是恰当的。"}]}],"synonyms":["suitable","appropriate","proper","fitting","convenient"],"phonetic":"/kəˈviːnəbəl/","extraExplanation":["“covenable”在现代英语中几乎不用，常被视为“convenable / convenient / suitable”的古拼写或变体。更自然的现代表达通常是：suitable（合适的）、appropriate（恰当的）、proper（得体的），或 convenient（方便的，强调时间/地点上的便利）。","如果你是在旧书、法律/宗教文献或方言材料里见到它，多半表示“合宜、得当”的意思；日常写作建议改用上面的现代词。"]}
{"word":"covenably","summary":{"en":"“Covenably” is an archaic adverb meaning “suitably; properly; in a fitting way.”","zh":"“covenably”是一个古语副词，意思是“合宜地；恰当地；得体地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Archaic) In a suitable, proper, or fitting way; appropriately.","zh":"（古语）以适当、合宜、得体的方式；恰当地。"},"examples":[{"en":"He spoke covenably for the occasion, neither too boldly nor too softly.","zh":"他在那种场合讲话很得体，既不太冒进也不太轻声。"},{"en":"The matter was handled covenably, with care and respect.","zh":"这件事处理得很合宜，既谨慎又尊重人。"}]}],"synonyms":["suitably","properly","appropriately","fittingly"],"phonetic":"/ˈkʌvənəbli/","extraExplanation":["“covenably”在现代英语中几乎不用，主要见于中古英语/早期近代英语文本。它与古形容词“covenable / convenable”（意为“合适的、相称的”）同源，和现代词“convenient（方便的）”“appropriate（恰当的）”在语义上相近。","阅读古文或宗教/法律旧文本时遇到它，通常可译为“suitably / properly / fittingly”。在现代写作中建议改用这些更常见的表达。"]}
{"word":"covenance","summary":{"en":"Covenance means a formal agreement or a contract rule (often legal); it’s a rarer form of the more common word “covenant.”","zh":"covenance 指正式协议或合同中的约定条款（多用于法律语境）；它是更常见的 covenant 的较少见形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a formal agreement or promise between people or groups (often written, or treated as legally binding)","zh":"（通常为书面的、被视为具有法律约束力的）正式协议；契约；承诺"},"examples":[{"en":"The two companies entered into a covenance to share research and profits.","zh":"两家公司签订了一份契约，同意共享研究成果和利润。"},{"en":"In some communities, homeowners must follow a neighborhood covenance about noise and building changes.","zh":"在一些社区，房主必须遵守关于噪音和房屋改建的社区契约。"}]},{"partOfSpeech":"n.","definition":{"en":"a rule in a contract—especially in property or business—that requires someone to do something or not do something","zh":"（合同中的）约定条款（尤指房地产或商业中要求“必须做/不得做”的条款）"},"examples":[{"en":"The lease included a covenance not to keep pets in the apartment.","zh":"租约包含一项不得在公寓养宠物的约定条款。"},{"en":"Breaking the covenance could lead to legal action.","zh":"违反该约定条款可能会引发法律诉讼。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare) to make a formal promise or agreement","zh":"（较少用）立约；订立正式承诺或协议"},"examples":[{"en":"They covenanced to support each other during difficult times.","zh":"他们立约在困难时期互相支持。"}]}],"synonyms":["covenant","agreement","contract","pact","promise","pledge","stipulation","clause"],"phonetic":"/ˈkʌvənəns/","extraExplanation":["“covenance”较少见，更常见的形式是“covenant”。在法律/房地产语境中，日常英语通常用“covenant”来指“契约/限制性条款（restrictive covenant）”。","词源上与“covenant”同源，来自表示“同意、约定”的法语/拉丁语系词根。"]}
{"word":"covenant","summary":{"en":"A covenant is a serious, often written agreement or promise; in religion it can mean a sacred agreement between God and people. It can also be a verb meaning “to formally promise.”","zh":"covenant 指严肃、常为书面的协议或承诺；在宗教中指上帝与人之间的神圣盟约。也可作动词，表示“正式立约/承诺”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A formal and serious agreement or promise, especially one written in a legal document.","zh":"（尤指写入法律文件的）正式而严肃的协议／契约／承诺。"},"examples":[{"en":"The lease includes a covenant that the tenant will not keep pets.","zh":"租约中有一条契约：房客不得养宠物。"},{"en":"They made a covenant to support each other through difficult times.","zh":"他们立下承诺，要在困难时期互相扶持。"}]},{"partOfSpeech":"n.","definition":{"en":"In the Bible and religion, a sacred agreement between God and people.","zh":"（宗教/《圣经》用语）上帝与人之间的神圣盟约。"},"examples":[{"en":"The Old Testament describes the covenant between God and Abraham.","zh":"《旧约》描述了上帝与亚伯拉罕之间的盟约。"},{"en":"Some Christians speak of Jesus establishing a new covenant.","zh":"一些基督徒会说耶稣建立了“新约”。"}]},{"partOfSpeech":"v.","definition":{"en":"To make a formal promise or agreement (often used with “to” or “with”).","zh":"订立正式契约；立下正式承诺（常与 to / with 连用）。"},"examples":[{"en":"The parties covenanted to share the costs of repairs.","zh":"双方订立契约，同意共同承担维修费用。"},{"en":"She covenanted with her business partner to act in good faith.","zh":"她与商业伙伴约定要诚信行事。"}]}],"synonyms":["agreement","contract","pledge","promise","commitment","pact","oath"],"phonetic":"/ˈkʌvənənt/","extraExplanation":["在法律英语里，covenant 常见于不动产、租赁、公司合同中，指“具有约束力的条款/约定”（如：restrictive covenant 限制性条款，covenant not to compete 竞业禁止约定）。","在文化与文学语境中，covenant 带有较强的庄重色彩，常用于宣誓式的承诺；宗教语境里尤为常见，如《圣经》的 Old Covenant（旧约）与 New Covenant（新约）也影响了英语中“盟约/神圣约定”的用法。"]}
{"word":"Covenant-israel","summary":{"en":"“Covenant Israel” is a religious phrase meaning Israel as a people bound to God by a sacred covenant, with responsibilities and identity shaped by that covenant.","zh":"“Covenant Israel”是宗教用语，指因与上帝立下神圣盟约而与上帝相连的以色列民，其身份与责任由该盟约所塑造。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(In the Bible/Jewish tradition) the people of Israel understood as being in a special relationship—based on a sacred promise (a covenant)—with God.","zh":"（《圣经》/犹太传统中）“盟约中的以色列”，指因与上帝立下神圣“盟约/约定”而被理解为与上帝有特殊关系的以色列民。"},"examples":[{"en":"In many Bible studies, “covenant Israel” refers to Israel as God’s chosen people under the covenant.","zh":"在许多圣经学习中，“covenant Israel”指在盟约之下、作为上帝选民的以色列。"},{"en":"The prophets often called covenant Israel back to faithfulness when the people broke the covenant.","zh":"先知常在百姓违背盟约时呼唤“盟约中的以色列”回转、重新忠诚。"}]},{"partOfSpeech":"phrase","definition":{"en":"More broadly, a theological idea that Israel’s identity and responsibilities are defined by covenant commitments (laws, worship, ethics).","zh":"更广义上，一个神学概念：以色列的身份与责任由盟约的承诺（律法、敬拜、伦理）所界定。"},"examples":[{"en":"Some writers contrast covenant Israel with political Israel to focus on spiritual identity rather than modern government.","zh":"有些作者将“covenant Israel”与“政治意义上的以色列”作对比，以强调属灵身份而非现代政权。"},{"en":"The essay argues that covenant Israel is shaped by commandments and community practices.","zh":"文章主张“盟约中的以色列”由诫命与群体生活实践所塑造。"}]}],"synonyms":["covenant people","God’s chosen people","Israel under the covenant","the people of Israel (biblical context)"],"phonetic":"/ˈkʌvənənt ˈɪzreɪəl/","extraExplanation":["“Covenant”常译为“盟约/圣约”。在《旧约》中最常被提到的相关盟约包括：亚伯拉罕之约（身份与应许）、西奈/摩西之约（律法与生活规范）、大卫之约（王权与后续应许）。不同宗派/学者对“covenant Israel”的用法会有差异：有的强调历史民族，有的强调信仰与遵行盟约的群体。","写作时注意大小写：作为宗教概念时常写作 Covenant Israel；一般性描述则可用小写。你写的“Covenant-israel”更像标签或复合词，正式英文里通常不加连字符。"]}
{"word":"covenantal","summary":{"en":"Covenantal means “connected to a covenant,” especially a binding promise or agreement (often religious).","zh":"covenantal 指“与盟约/契约有关的”，尤指具有约束力的承诺或协议（常见于宗教语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to a covenant: a formal, binding agreement or promise, often with religious or legal importance.","zh":"与“盟约/契约”有关的：指正式且具有约束力的协议或承诺，常带有宗教或法律的重要性。"},"examples":[{"en":"In many religions, marriage is seen as a covenantal relationship, not just a contract.","zh":"在许多宗教中，婚姻被视为一种盟约式的关系，而不只是合同。"},{"en":"The document describes covenantal duties between the community and its leaders.","zh":"这份文件描述了社区与其领袖之间的盟约式义务。"}]}],"synonyms":["of a covenant","contractual (not exact)","binding"],"phonetic":"/ˌkʌvəˈnæntəl/","extraExplanation":["“covenant”常见于《圣经》与神学语境（如“旧约/新约”分别对应 Old/New Covenant 或 Old/New Testament 的观念）。因此“covenantal”在英语中经常带有“神圣的、道德上必须履行的承诺”的意味，比一般的“contractual（合同式的）”更强调关系、忠诚与长期责任。","在学术与公共讨论中，你可能会看到“covenantal community（盟约共同体）”“covenantal theology（盟约神学）”。与之相对的说法常是“contract-based/contractual（以合同为基础的）”，强调交易与条款。"]}
{"word":"covenantally","summary":{"en":"Covenantally means “in a covenant-based way,” often used in religious, ethical, or legal contexts to stress binding promises and responsibilities.","zh":"covenantally 意为“以盟约/圣约为基础地、以圣约性的方式”，常用于宗教、伦理或法律语境，强调具约束力的承诺与责任。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to a covenant (a formal, binding agreement or promise), especially one with moral, legal, or religious force.","zh":"以“圣约/盟约”（正式且具约束力的协议或承诺，常带有道德、法律或宗教效力）相关的方式；以圣约性的方式。"},"examples":[{"en":"They argued that marriage should be understood covenantally, not just as a contract.","zh":"他们主张婚姻应以“盟约/圣约”的方式来理解，而不只是契约。"},{"en":"In this tradition, the community sees itself as covenantally responsible for one another.","zh":"在这一传统中，群体认为彼此之间负有圣约性的责任。"}]},{"partOfSpeech":"adv.","definition":{"en":"By means of a covenant; according to the terms of a covenant.","zh":"通过盟约/圣约；按照盟约/圣约的条款。"},"examples":[{"en":"The two parties were covenantally bound to share the land’s water rights.","zh":"双方通过盟约性的约束共同分享土地的用水权。"}]}],"synonyms":["by covenant","under a covenant","covenant-based","contractually (similar but usually more legal/less moral-religious)"],"phonetic":"/ˌkʌvənˈæn(t)əli/","extraExplanation":["“covenantally”是较少见的副词，多见于神学、宗教研究与伦理讨论（如“covenantal relationship 圣约关系”“covenant theology 圣约神学”）。它通常强调一种“带承诺与责任的关系”，语气往往比单纯的contractually（按合同地）更具道德/信仰色彩。","词形来源：covenant（盟约/契约）+ -al（形容词后缀）→ covenantal（圣约性的）+ -ly（副词后缀）→ covenantally（以圣约性的方式）。"]}
{"word":"covenanted","summary":{"en":"“Covenanted” means formally promised or bound by a covenant (a legally or religiously binding agreement).","zh":"“Covenanted”指以契约/盟约形式作出正式承诺，或受此类具有约束力的协议所约束。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of “covenant”) to make a formal, binding promise or agreement, especially in legal or religious contexts.","zh":"（动词 covenant 的过去式/过去分词）订立正式且具有约束力的承诺或协议，常见于法律或宗教语境。"},"examples":[{"en":"The parties covenanted to keep the information confidential.","zh":"双方以契约形式承诺对信息保密。"},{"en":"In the old document, the land was covenanted to remain a public garden.","zh":"在那份旧文件中，土地被以契约规定必须一直作为公共花园。"}]},{"partOfSpeech":"adj.","definition":{"en":"Bound or required by a formal promise (a covenant); pledged by contract.","zh":"受契约/誓约约束的；以合同形式承诺的。"},"examples":[{"en":"They were covenanted to provide safe housing for all tenants.","zh":"他们受契约约束，必须为所有租户提供安全住房。"},{"en":"The covenanted obligations were written into the lease.","zh":"契约性义务被写入租约中。"}]}],"synonyms":["contracted","pledged","bound","stipulated"],"phonetic":"/ˈkʌvənəntɪd/","extraExplanation":["“covenant”在英语里有两条常见文化脉络：一是法律用语（如租约中的限制性条款 restrictive covenant），强调“具有法律约束力的承诺”；二是宗教语境（尤其是《圣经》里的“上帝与人立约”），强调“神圣的盟约/誓约”。因此“covenanted”往往带有比普通“promised”更正式、更强约束力的意味。"]}
{"word":"covenantee","summary":{"en":"A legal term for the person who receives a promise (benefit) in a covenant.","zh":"法律术语：在契约（covenant）中接受承诺、享受利益的一方（受约人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In law, the person (or party) to whom a promise in a contract—especially a formal “covenant”—is made; the one who receives the benefit of the covenant.","zh":"（法律）受约人；契约（尤指正式“covenant”）中承诺的接受方/受益方。"},"examples":[{"en":"Under the agreement, the landlord is the covenantee and the tenant is the covenantor.","zh":"根据该协议，房东是受约人（covenantee），房客是立约人（covenantor）。"},{"en":"The covenantee may sue if the covenant is broken.","zh":"如果契约条款被违反，受约人可以提起诉讼。"}]}],"synonyms":["promisee","beneficiary (of a covenant)","party receiving the promise"],"phonetic":"/ˌkʌvənənˈtiː/","extraExplanation":["“Covenantee”常见于法律写作，与“covenantor”（作出承诺的一方）相对。日常英语里更常用“the party receiving the promise / the beneficiary of the covenant（接受承诺的一方/契约受益人）”。","在财产法语境中，covenant 也可指不动产上的限制或义务（如不得养宠物、必须维护外观等）；其中享有该限制/义务利益的一方就是 covenantee。"]}
{"word":"Covenanter","summary":{"en":"A Covenanter is mainly a 17th‑century Scottish Presbyterian who signed and defended the Covenants; more broadly, it can mean someone who supports a (religious) covenant.","zh":"Covenanter主要指17世纪苏格兰签署并捍卫“盟约”的长老会盟约派人士；广义也可指支持或遵守（宗教）盟约的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Scottish Presbyterian in the 1600s who signed the National Covenant (1638) and related agreements to defend their church and resist certain royal/religious policies.","zh":"（历史）17世纪苏格兰的长老会信徒／支持者，签署《国家盟约》（1638）等文件，以捍卫本国教会并反对部分王室与宗教政策。"},"examples":[{"en":"Many Covenanters opposed the king’s attempts to control the Scottish church.","zh":"许多盟约派反对国王试图控制苏格兰教会。"},{"en":"In some histories, the Covenanters are remembered for their resistance and persecution.","zh":"在一些历史记载中，盟约派因其抵抗与遭受迫害而被人们记住。"},{"en":"The novel mentions a Covenanter meeting held in secret.","zh":"小说提到一次秘密举行的盟约派集会。"}]},{"partOfSpeech":"n.","definition":{"en":"More generally (often capitalized), a person who makes or supports a covenant (a solemn promise or agreement), especially a religious one.","zh":"（较泛）立约者；支持或遵守盟约（庄严承诺／协议）的人，尤指宗教性的盟约。（常大写）"},"examples":[{"en":"The sermon spoke of believers as Covenanters who keep their promises to God.","zh":"讲道把信徒称为“立约者”，强调要守住对上帝的承诺。"},{"en":"In older religious writing, “Covenanter” can refer to someone devoted to a covenant tradition.","zh":"在较早的宗教文本中，Covenanter可指忠于“盟约传统”的人。"}]}],"synonyms":["Scottish Presbyterian (historical)","Covenanting Presbyterian (historical)","signer of the Covenant (contextual)"],"phonetic":"/ˈkʌvənˌæn.tɚ/","extraExplanation":["“Covenanter”主要是苏格兰历史语境中的专有称呼，常与17世纪的宗教与政治冲突相关，尤其是《国家盟约》（National Covenant, 1638）与《庄严同盟与盟约》（Solemn League and Covenant, 1643）。","文学与文化中常见的相关词：the Covenanters（盟约派群体）、Covenanting movement（盟约运动）、Covenant（盟约／庄严誓约）。在阅读历史或小说时，若看到大写Coventanter，通常指该历史群体。"]}
{"word":"covenanter","summary":{"en":"A “covenanter” is usually a member/supporter of the 17th‑century Scottish Covenanters, or more generally someone who makes a solemn covenant.","zh":"covenanter 通常指17世纪苏格兰“盟约派”的成员/支持者；广义上也指订立庄严盟约的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who made (or supported) a formal religious and political agreement called a “Covenant,” especially in 17th‑century Scotland, often connected with Presbyterianism and resistance to royal control of the church.","zh":"“盟约派成员；签约者”：指参与或支持签署宗教与政治“盟约（Covenant）”的人，尤指17世纪苏格兰的盟约运动，多与长老会传统及反对王权控制教会有关。"},"examples":[{"en":"Many Covenanters refused to accept the king’s authority over the church.","zh":"许多盟约派成员拒绝接受国王对教会的控制。"},{"en":"The novel mentions Covenanters meeting in secret to worship.","zh":"小说提到盟约派成员秘密集会敬拜。"}]},{"partOfSpeech":"n.","definition":{"en":"More generally, someone who enters into a covenant (a solemn agreement or promise).","zh":"更广义：与他人订立盟约（庄严的协议或承诺）的人。"},"examples":[{"en":"In older religious writing, the believer may be described as a covenanter with God.","zh":"在较早的宗教著作中，信徒可能被描述为与上帝立约的人。"}]}],"synonyms":["signatory","pledger","covenant-maker"],"phonetic":"/ˈkʌvənəntər/","extraExplanation":["“Covenanter”最常见的历史指向是苏格兰的盟约派（Scottish Covenanters）。1638年的《国家盟约》（National Covenant）与1643年的《庄严同盟与盟约》（Solemn League and Covenant）是核心文本。","在英语文学中，Walter Scott 的历史小说（如《Old Mortality》）常描写盟约派与当时政治宗教冲突；因此在阅读历史小说或英国史材料时会遇到该词。","词形拆解：covenant（盟约/契约）+ -er（做……的人）。注意它不是现代日常词汇，更多出现在历史、宗教学与文学语境中。"]}
{"word":"covenanting","summary":{"en":"“Covenanting” means making a formal, binding promise (a covenant), and it can also refer to the historic Scottish Covenanters movement.","zh":"“Covenanting”指订立具有约束力的正式契约/誓约；也可指与苏格兰历史上的“盟约派/盟约者”运动相关。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"making or entering into a formal agreement (a covenant); promising or committing by a binding pledge","zh":"订立（或签署）正式契约；以有约束力的誓约作出承诺"},"examples":[{"en":"The two organizations are covenanting to share data responsibly.","zh":"这两个组织正在订立协议，承诺负责任地共享数据。"},{"en":"By covenanting to the plan, the partners agreed to follow the same rules.","zh":"通过对该计划作出契约式承诺，合作方同意遵守同一套规则。"}]},{"partOfSpeech":"adj.","definition":{"en":"(historical) relating to the Scottish Covenanters, a 17th‑century Presbyterian movement that signed religious and political covenants","zh":"（历史）与苏格兰“盟约派/盟约者”（17世纪长老会运动）有关的；指他们签署宗教与政治盟约的"},"examples":[{"en":"Covenanting communities met in secret when authorities tried to stop their worship.","zh":"当局试图阻止他们的礼拜时，盟约派社群曾秘密聚会。"},{"en":"Some museums display covenanting documents from 17th‑century Scotland.","zh":"一些博物馆展出17世纪苏格兰的盟约派文献。"}]}],"synonyms":["agreeing (formal)","pledging","committing","contracting (legal)"],"phonetic":"/ˈkʌvənəntɪŋ/","extraExplanation":["“covenanting”通常是动词“covenant”的现在分词/动名词形式（表示“立约、缔约、正式承诺”）。在法律或宗教语境中更常见，语气比一般的“agree/agreeing”更正式、更强调约束力。","历史用法中，“Covenanting”常与苏格兰的Covenanters相关，尤其涉及《国家盟约》（National Covenant, 1638）与《庄严同盟与盟约》（Solemn League and Covenant, 1643）。在相关文本里，它既可作形容词（covenanting people），也可指该运动的活动。"]}
{"word":"covenantor","summary":{"en":"A covenantor is the party who makes a covenant—someone who formally promises to do (or not do) something, especially in legal agreements.","zh":"covenantor 指订立契约并作出正式承诺的一方，常用于法律协议中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or organization that makes a formal promise or agreement (a covenant), especially in legal documents.","zh":"（尤指法律文件中）立下正式承诺或订立契约的一方；契约人。"},"examples":[{"en":"In the contract, the covenantor promises to maintain the building in good condition.","zh":"在合同中，契约人承诺将建筑物保持良好状态。"},{"en":"The lender required the covenantor to provide quarterly financial reports.","zh":"贷款方要求契约人每季度提供财务报告。"}]}],"synonyms":["promisor","contracting party","party to a covenant","obligor"],"phonetic":"/ˈkʌvənəntər/","extraExplanation":["“covenantor”是较正式的法律用语，常见于房地产、贷款协议、保密协议等场景，指“作出契约承诺的一方”。与之相对的词常见有“covenantee”（受诺方/受益方），但实际文件里也可能直接用“party”“borrower”“tenant”等更具体的称呼。","词源上来自“covenant（契约/约定）+ -or（做某事的人）”。拼写上有时也会见到较少用的变体“covenantor/covenanter”，其中“covenanter”在历史语境里还可指苏格兰宗教政治运动相关成员。"]}
{"word":"covenants","summary":{"en":"“Covenants” are formal, binding agreements or promised obligations, especially in contracts, property rules, or religious contexts.","zh":"“covenants”指具有约束力的正式契约/盟约，常见于合同、房产限制条款或宗教语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Formal, binding agreements or promises, especially written ones (often used in law, contracts, or real estate).","zh":"（正式的）契约；盟约；具有法律约束力的协议或承诺（常见于法律、合同、房地产等语境，通常为书面）。"},"examples":[{"en":"The contract includes several covenants that both sides must follow.","zh":"这份合同包含若干条双方都必须遵守的契约条款。"},{"en":"Homeowners must obey the neighborhood covenants about noise and building changes.","zh":"房主必须遵守社区关于噪音和建筑改动的契约规定。"}]},{"partOfSpeech":"n.","definition":{"en":"In religious contexts, solemn promises between God and people, or between groups (often translated as “covenant”).","zh":"（宗教语境）盟约；立约（指上帝与人之间或群体之间庄严的约定）。"},"examples":[{"en":"In the Bible, the idea of a covenant is central to the relationship between God and humanity.","zh":"在《圣经》中，“盟约”的概念是上帝与人类关系的核心。"},{"en":"They spoke about the covenant as a commitment that shapes moral life.","zh":"他们谈到盟约是一种塑造道德生活的承诺。"}]},{"partOfSpeech":"n.","definition":{"en":"Promises or restrictions written into property rules (e.g., limits on use, appearance, or building).","zh":"（房产/土地）限制性条款；不动产契约限制（例如对用途、外观或建造的限制）。"},"examples":[{"en":"The deed has covenants that prevent running a business from the property.","zh":"地契里有契约条款，禁止在该房产内经营生意。"},{"en":"Check the covenants before you build a fence or add a room.","zh":"在你建围栏或加建房间之前，先查看契约限制条款。"}]}],"synonyms":["agreements","contracts","pledges","promises","commitments","stipulations"],"phonetic":"/ˈkʌvənənts/","extraExplanation":["“covenants”是“covenant”的复数。日常英语里更常见的搭配有：make/enter into a covenant（订立契约）、breach a covenant（违背契约）、covenant terms/clauses（契约条款）。","法律与房地产语境中，covenant常带有“必须做/不得做”的约束性承诺；宗教语境中则更强调“庄严、神圣的约定”。","文学与文化中常见的固定说法包括：the Old Covenant / the New Covenant（旧约/新约的观念，与《旧约》《新约》相关）。"]}
{"word":"Coveney","summary":{"en":"Coveney is mainly an Irish surname (a last name).","zh":"Coveney 主要是一个爱尔兰姓氏（英文里的 last name）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), most commonly Irish; used to refer to people with this last name (e.g., Irish politician Simon Coveney).","zh":"姓氏（家族名），多见于爱尔兰；用来指姓 Coveney 的人（例如爱尔兰政治人物 Simon Coveney）。"},"examples":[{"en":"Simon Coveney is an Irish politician.","zh":"Simon Coveney 是一位爱尔兰政治人物。"},{"en":"Ms. Coveney will join the meeting at 3 p.m.","zh":"Coveney 女士将在下午三点参加会议。"}]}],"phonetic":"/ˈkʌvni/","extraExplanation":["“Coveney”通常被当作专有名词（姓氏）使用，日常对话里不作为普通词汇来表达“意思”。","发音在英语语境中常见为“CUV-nee”（大致类似“卡夫尼/卡芙尼”的感觉），具体读法可能因地区或个人习惯略有差异。"]}
{"word":"covens","summary":{"en":"“Covens” is the plural of “coven,” meaning groups of witches or witchcraft practitioners.","zh":"“covens”是“coven”的复数，指女巫（或巫术实践者）的团体／集会。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group or gathering of witches (especially in stories, folklore, or modern pagan/Wiccan contexts).","zh":"女巫的集会／团体（常见于故事、民间传说，或现代异教／威卡等语境）。"},"examples":[{"en":"In the novel, the coven meets in the forest at midnight.","zh":"在小说里，女巫团在午夜的森林里聚会。"},{"en":"Some TV shows portray covens as secret communities with their own rules.","zh":"一些电视剧把女巫团描绘成有自己规则的秘密社群。"},{"en":"She joined a coven to study modern witchcraft and rituals.","zh":"她加入了一个女巫团来学习现代巫术与仪式。"}]}],"synonyms":["witches’ group","witches’ circle","witches’ gathering"],"phonetic":"/ˈkʌvənz/","extraExplanation":["“covens”是“coven”的复数形式；单数是coven，表示一个女巫团体。","在历史上，“coven”常与欧洲猎巫时期的指控与审判相关；在当代，有些人会用它来指自愿组成的灵性/宗教小团体（例如某些Wiccan团体）。使用时要注意语境与尊重当事人的自我认同。","常见搭配：a coven of witches（女巫团）；join a coven（加入女巫团）；coven meeting（女巫集会）。"]}
{"word":"covent","summary":{"en":"“Covent” is best known from “Covent Garden” in London; as a standalone word it’s rare and can be an old form of “convent.”","zh":"“Covent”最常见于伦敦地名“Covent Garden”；单独作为词时较少见，可指“convent（修道院）”的旧式写法/形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A short form used in the name “Covent Garden,” a well-known area in London (often associated with markets, shops, street performers, and nearby theaters).","zh":"（专有名词）用于地名“Covent Garden（科文特花园）”中的简写/组成部分，指伦敦一处著名街区（常与集市、商店、街头表演及周边剧院联系在一起）。"},"examples":[{"en":"We spent the afternoon in Covent Garden watching street performers.","zh":"我们下午在科文特花园看街头艺人表演。"},{"en":"Let’s meet near Covent Garden station.","zh":"我们在科文特花园地铁站附近见面吧。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare/old-fashioned) An archaic spelling or shortened form of “convent” (a religious community and the building where members live, especially nuns).","zh":"（罕见/旧式）“convent”的古旧拼写或缩写形式，指修道院/女修道院（修会团体及其居住的建筑，尤指修女）。"},"examples":[{"en":"In older texts, you may see “covent” used where modern English would use “convent.”","zh":"在较老的文本里，你可能会看到用“covent”来表示现代英语中的“convent”。"},{"en":"The novel mentions a covent on the hill (meaning a convent).","zh":"小说里提到山上的一座“covent”（意思是修道院）。"}]}],"synonyms":["Covent Garden","convent"],"phonetic":"ˈkʌv.ənt","extraExplanation":["“Covent Garden”这个名字里的“Covent”来自更早期对“convent garden（修道院的菜园/花园）”的写法演变；因此它常被视为历史拼写/地名成分，而不是现代英语里常用的独立词。"]}
{"word":"coventrate","summary":{"en":"“Coventrate” is not a standard English word; it is likely a misspelling of “concentrate” (focus; or a concentrated substance).","zh":"“coventrate”不是标准英文词；很可能是“concentrate”的拼写错误（集中注意力；或指浓缩物）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Most likely) a misspelling of “concentrate”: to direct all your attention or effort to one thing.","zh":"（很可能）“concentrate”的拼写错误：把注意力或精力集中在一件事上。"},"examples":[{"en":"I can’t concentrate with so much noise.","zh":"这么吵我没法集中注意力。"},{"en":"She concentrated on finishing her homework before dinner.","zh":"她专心在晚饭前完成作业。"}]},{"partOfSpeech":"n.","definition":{"en":"“Concentrate”: a substance made stronger by removing water or adding more of the active ingredient; a condensed form of something.","zh":"“concentrate”：浓缩物；通过去除水分或增加有效成分而变得更浓的物质；浓缩形式。"},"examples":[{"en":"Add one spoon of juice concentrate to water.","zh":"往水里加一勺浓缩果汁。"},{"en":"This cleaner is sold as a concentrate.","zh":"这种清洁剂以浓缩液形式出售。"}]},{"partOfSpeech":"v.","definition":{"en":"“Concentrate”: to become stronger or more intense in one area or group.","zh":"“concentrate”：（人或事物）聚集在某处；（影响、力量等）集中并增强。"},"examples":[{"en":"Most of the population is concentrated in the capital city.","zh":"大多数人口集中在首都。"},{"en":"The storm’s power concentrated over the warm ocean.","zh":"风暴的力量在温暖的海面上集中增强。"}]}],"synonyms":["focus","pay attention","center","condense"],"phonetic":"/ˈkɑn.sənˌtreɪt/","extraExplanation":["“coventrate”不是常见英文单词，最接近且最常用的目标词通常是“concentrate”。如果你想表达的是“集中注意力/浓缩物”，用 concentrate。","拼写提示：concentrate = con- + cen + trate（常见错误是把“concen-”写成“coven-”）。"]}
{"word":"coventries","summary":{"en":"“Coventries” is the plural of Coventry (the city name), and rarely it can mean cases of social ostracism from the idiom “send someone to Coventry.”","zh":"“Coventries”是“Coventry（考文垂）”的复数；较少见时也可指源自习语“send someone to Coventry”的“被孤立/被冷处理”的情况。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the city of Coventry in central England (plural form used when talking about the name as a common noun, multiple places, or multiple references to the city).","zh":"英国英格兰中部城市“考文垂”（Coventry）的复数形式；可用于指多个同名地点，或对该城市的多次提及。"},"examples":[{"en":"The itinerary included two Coventries—one in England and one in the United States.","zh":"行程里有两个叫“考文垂”的地方——一个在英国，一个在美国。"},{"en":"Historians compare the Coventries of different eras: medieval, industrial, and modern.","zh":"历史学家会比较不同时代的考文垂：中世纪、工业时期与现代。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) instances of being deliberately ignored or socially excluded—linked to the idiom “to send someone to Coventry.”","zh":"（少见）被故意无视、排斥的情况；源自习语“send someone to Coventry”（把某人“冷处理/孤立起来”）。"},"examples":[{"en":"After the argument, he experienced a kind of social Coventry at work.","zh":"争吵之后，他在工作中经历了一种被孤立的状态。"},{"en":"The new student feared being sent to Coventry for speaking differently.","zh":"新生担心因为口音不同而被同学孤立。"}]}],"synonyms":["Coventry (proper noun)","social exclusion","ostracism","the silent treatment"],"phonetic":"/ˈkʌvəntri/","extraExplanation":["“send someone to Coventry / be in Coventry”是英式表达，意思是“集体不理某人、把某人当空气”。常见解释是源自英国内战时期或更早的传说：被送到考文垂的人会遭到当地人冷漠对待，因此引申为“被孤立”。","学习提示：如果你只是想表达“有很多来自考文垂的人/事”，更自然的说法通常是“people from Coventry / things in Coventry”。“Coventries”本身在日常英语里不常见。"]}
{"word":"coventrize","summary":{"en":"Coventrize means to devastate—especially to destroy a city by heavy bombing, or figuratively to ruin something completely.","zh":"Coventrize 指“（尤指以猛烈轰炸）摧毁城市”，也可比喻“彻底毁掉某事”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to destroy a city or area by heavy bombing; to devastate completely","zh":"（尤指用猛烈轰炸）摧毁一座城市或地区；彻底毁灭"},"examples":[{"en":"During the war, people feared their town might be coventrized by air raids.","zh":"战争期间，人们担心他们的城镇会在空袭中被“考文垂化”（遭到毁灭性轰炸）。"},{"en":"The report warned that modern weapons could coventrize entire neighborhoods in minutes.","zh":"报告警告说，现代武器可能在几分钟内就把整片社区夷为平地。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative) to ruin something completely, as if by bombing","zh":"（比喻）把某事彻底毁掉，仿佛被轰炸一般"},"examples":[{"en":"One careless comment can coventrize years of trust.","zh":"一句不小心的评论就可能毁掉多年建立的信任。"},{"en":"The scandal coventrized the company’s reputation overnight.","zh":"这场丑闻让公司的声誉一夜之间崩塌。"}]}],"synonyms":["devastate","obliterate","raze","level","destroy"],"phonetic":"ˈkʌvənˌtraɪz","extraExplanation":["“coventrize”源自英国城市Coventry（考文垂）。二战期间（1940年）该城在德军空袭中遭到严重破坏，因此英语里出现了把“像考文垂那样被毁”的含义。","该词带有强烈的战争与历史语境，现代英语中较少使用，更多见于历史叙述、评论或强调“毁灭性打击”的修辞表达。","相关词形与近义表达：to devastate, to raze, to obliterate, to level (a city), to reduce to rubble。"]}
{"word":"Coventry","summary":{"en":"Coventry is a city in England; it also appears in the idiom “send someone to Coventry,” meaning to deliberately ignore someone.","zh":"Coventry（考文垂）是英格兰的一座城市；也出现在习语“send someone to Coventry”中，意为故意无视、孤立某人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in the West Midlands of England, known historically for industry (especially cars) and for its role in World War II history.","zh":"英格兰西米德兰兹郡的一座城市（考文垂），历史上以工业（尤其汽车制造）以及二战相关历史而闻名。"},"examples":[{"en":"Coventry is about 20 miles southeast of Birmingham.","zh":"考文垂大约在伯明翰东南方向20英里处。"},{"en":"They visited Coventry to see the cathedral and museums.","zh":"他们去考文垂参观了大教堂和博物馆。"}]},{"partOfSpeech":"n.","definition":{"en":"In the expression “send someone to Coventry,” a state of being deliberately ignored and excluded.","zh":"在短语“send someone to Coventry（把某人‘送去考文垂’）”中，指被人刻意无视、孤立、排斥的状态。"},"examples":[{"en":"After the argument, he was sent to Coventry at work—no one spoke to him.","zh":"争吵之后，他在公司被“送去考文垂”——没人跟他说话。"},{"en":"She felt like she’d been sent to Coventry when her friends stopped replying.","zh":"朋友们不再回复后，她感觉自己被“送去考文垂”了。"}]}],"phonetic":"/ˈkʌvəntri/","extraExplanation":["“send someone to Coventry”是英国英语里比较有名的习语，核心意思是“集体冷处理/冷暴力式排斥”。它和城市本身没有必然联系，但在文化上已固定搭配。","考文垂在二战中曾遭到大规模空袭，旧教堂遗址与新建的大教堂并存，常被用来象征“毁灭后的重建与和解”。"]}
{"word":"coventry","summary":{"en":"Coventry is a city in England; in the idiom “send someone to Coventry,” it means to deliberately ignore and socially exclude someone.","zh":"Coventry是英国的一座城市；在习语“send someone to Coventry”中，表示故意无视并在社交上孤立某人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a city in the West Midlands of England, known historically for medieval industry and, in modern times, for its post–World War II rebuilding and cathedral.","zh":"考文垂：英国英格兰西米德兰兹郡的一座城市；历史上以中世纪工业闻名，现代也因二战后的重建与新旧大教堂而知名。"},"examples":[{"en":"Coventry is about a 20-minute train ride from Birmingham.","zh":"考文垂离伯明翰坐火车大约20分钟。"},{"en":"The Coventry Cathedral is a famous symbol of reconciliation after the war.","zh":"考文垂大教堂是战后和解的著名象征。"}]},{"partOfSpeech":"phrase","definition":{"en":"(in the idiom “send someone to Coventry”) to deliberately ignore someone and exclude them from social interaction as a punishment.","zh":"（用于习语“send someone to Coventry”）故意冷落某人、把某人排除在社交之外，作为一种惩罚或抵制。"},"examples":[{"en":"After the argument, they sent him to Coventry for a week and wouldn’t speak to him.","zh":"争吵之后，他们冷落了他一周，都不跟他说话。"},{"en":"No one said it directly, but I felt like I’d been sent to Coventry.","zh":"没人明说，但我感觉自己被“集体无视”了。"}]}],"synonyms":["(idiom meaning) ostracize","(idiom meaning) give someone the cold shoulder","(idiom meaning) shun"],"phonetic":"/ˈkʌvəntri/","extraExplanation":["“send someone to Coventry”是英式英语里较常见的说法，语气偏文学/习语，日常口语里也可用更直白的表达，如：ignore someone, give someone the cold shoulder, ostracize someone。","关于该习语的来源有多种说法（常与英国内战时期的传闻相关），但并没有完全确定的单一出处；学习时把它理解为“被集体冷处理/孤立”最实用。"]}
{"word":"cover","summary":{"en":"Cover means to put something over something else, to include a topic, to report news, to pay for costs, or to take someone’s place; as a noun, it’s a protective or decorative outer layer.","zh":"cover 可指“覆盖/遮住、涵盖内容、新闻报道、承担费用、替班/掩护”；作名词指“覆盖物/封面/外层”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To place something over or on top of something else; to protect or hide it by putting a layer over it.","zh":"覆盖；盖住；用某物遮住以保护或隐藏。"},"examples":[{"en":"Cover the soup so it stays warm.","zh":"把汤盖上，这样它能保温。"},{"en":"Clouds covered the sun.","zh":"云遮住了太阳。"},{"en":"She covered her mouth when she laughed.","zh":"她笑的时候捂住了嘴。"}]},{"partOfSpeech":"vt.","definition":{"en":"To include or deal with a topic, area, or time period; to give information about it.","zh":"涵盖；涉及；（内容）包括或讨论某主题/范围/时期。"},"examples":[{"en":"This course covers basic grammar and pronunciation.","zh":"这门课涵盖基础语法和发音。"},{"en":"The report covers sales from January to June.","zh":"这份报告涵盖一月至六月的销售情况。"}]},{"partOfSpeech":"vt.","definition":{"en":"To report on events as a journalist; to follow and write or broadcast news about them.","zh":"（记者）报道；采访跟进并发布新闻。"},"examples":[{"en":"He covered the election for a local newspaper.","zh":"他为一家地方报纸报道了选举。"},{"en":"We are covering the storm live.","zh":"我们正在对这场风暴进行现场直播报道。"}]},{"partOfSpeech":"vt.","definition":{"en":"To pay for something, especially a cost or bill; to provide money for it.","zh":"支付（费用）；承担（开销）。"},"examples":[{"en":"Don’t worry—I’ll cover dinner.","zh":"别担心——晚餐我请。"},{"en":"Does insurance cover this treatment?","zh":"保险能报销/覆盖这项治疗吗？"}]},{"partOfSpeech":"vt.","definition":{"en":"To protect someone by taking their place or watching for danger; to support them when needed.","zh":"（工作/行动中）顶替；照应；掩护；在需要时支持某人。"},"examples":[{"en":"Can you cover my shift on Friday?","zh":"你周五能替我上班吗？"},{"en":"I’ll cover for you if the manager asks.","zh":"如果经理问起，我会帮你打圆场/顶一下。"}]},{"partOfSpeech":"n.","definition":{"en":"Something that goes over or in front of another thing for protection or decoration (for example, a book cover or a blanket).","zh":"覆盖物；封面；罩子；（如书的封面、毯子等）。"},"examples":[{"en":"The book has a beautiful cover.","zh":"这本书的封面很漂亮。"},{"en":"Pull the cover up if you’re cold.","zh":"如果你冷，把被子/毯子拉上来。"}]}],"synonyms":["hide","protect","include","report","pay for","substitute for"],"phonetic":"/ˈkʌvər/","extraExplanation":["“Cover”在英语里非常常用，含义从“物理上的遮盖”扩展到“内容上的涵盖”和“责任上的承担/替班”。学到它时，可以按三条主线记：盖住（cover the pot）、包括（cover the topic）、负责/付钱（cover the cost / cover my shift）。","常见搭配：cover up（掩盖真相/遮住）、cover for someone（替某人顶班/打掩护）、be covered in/with（被……覆盖：The table is covered with papers. 桌上堆满了纸）。","“Cover”作名词还常指音乐里的“翻唱”（a cover of a song），以及媒体里的“封面报道/封面人物”（cover story）。这些用法在流行文化和新闻语境中很常见。"]}
{"word":"coverable","summary":{"en":"Coverable means “able to be covered,” especially “eligible to be covered by insurance or a policy.”","zh":"Coverable 意为“可被覆盖的”，尤指“符合保险/条款承保或报销范围的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be covered (physically), or able to be included/protected by something such as insurance or a policy.","zh":"可被覆盖的（物理上）；或可被纳入/可被保障的（如保险、条款的承保范围内）。"},"examples":[{"en":"The stain is coverable with a layer of paint.","zh":"这个污渍可以用一层油漆盖住。"},{"en":"Most routine checkups are coverable under this health plan.","zh":"大多数常规体检在这份健康保险计划下属于可报销/可承保范围。"},{"en":"Damage from floods may not be coverable without extra insurance.","zh":"如果没有额外保险，洪水造成的损失可能不在承保范围内。"}]}],"synonyms":["insurable","eligible","included","protected"],"phonetic":"/ˈkʌvərəbəl/","extraExplanation":["“coverable”是由动词“cover（覆盖；承担费用；报道）”加形容词后缀“-able（能够……的）”构成，表示“能够被……的”。在日常英语里，它常见于较正式或专业语境（尤其是保险、报销、政策条款），口语中也常用“covered”或“can be covered”来表达同样意思。","在保险语境中，“coverable”强调“是否符合条款、是否在范围内”；而“covered”更多描述“已被纳入/已经给付”。例如：Is it coverable?（是否在范围内） vs. It’s covered.（它被涵盖/可以报销）。"]}
{"word":"coverage","summary":{"en":"Coverage means the range or extent of protection, inclusion, reporting, or signal/service area—most commonly used for insurance, media, and phone/network service.","zh":"Coverage 表示“覆盖/保障/涵盖的范围或程度”，最常见用于保险保障、媒体报道以及手机/网络信号覆盖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(General) The extent to which something is protected, included, provided, or dealt with; the amount or range of support or service you get.","zh":"（一般）覆盖范围；保障/包含/提供的程度；服务或支持的范围。"},"examples":[{"en":"This plan offers good coverage for hospital visits.","zh":"这个计划对住院就诊提供很好的保障（覆盖）。"},{"en":"We need broader coverage of the topic in our report.","zh":"我们的报告需要更全面地涵盖这个主题。"}]},{"partOfSpeech":"n.","definition":{"en":"(Insurance) Protection provided by an insurance policy against specific risks or costs.","zh":"（保险）保险保障；保单对特定风险或费用的赔付范围。"},"examples":[{"en":"Check whether your policy includes dental coverage.","zh":"查看你的保单是否包含牙科保障。"},{"en":"The damage wasn’t covered because it was outside the coverage.","zh":"这次损失不赔，因为不在保障范围内。"}]},{"partOfSpeech":"n.","definition":{"en":"(Media) Reporting of an event or issue by news organizations.","zh":"（媒体）报道；对事件或议题的新闻呈现。"},"examples":[{"en":"The storm received nationwide media coverage.","zh":"这场风暴得到了全国性的媒体报道。"},{"en":"Her speech got a lot of coverage online.","zh":"她的演讲在网上获得了大量报道/关注。"}]},{"partOfSpeech":"n.","definition":{"en":"(Signal/Network) The area where a phone, radio, or internet signal can be received reliably.","zh":"（信号/网络）信号覆盖；可稳定接收信号的区域。"},"examples":[{"en":"There’s poor cell coverage in the mountains.","zh":"山里手机信号覆盖很差。"},{"en":"This carrier has better coverage in rural areas.","zh":"这家运营商在农村地区的覆盖更好。"}]},{"partOfSpeech":"n.","definition":{"en":"(Sports, especially American football/basketball) The act of guarding a player or an area to prevent passes or scoring.","zh":"（体育，尤指美式橄榄球/篮球）防守；盯防；区域防守。"},"examples":[{"en":"The defense switched to man-to-man coverage.","zh":"防守改成了人盯人。"},{"en":"He blew the coverage and left a receiver open.","zh":"他防守漏人，让接球手空位。"}]}],"synonyms":["protection","scope","range","inclusion","reporting","signal area"],"phonetic":"/ˈkʌvərɪdʒ/","extraExplanation":["在英语里，coverage 的核心意思是“覆盖到哪里、管到什么程度”。所以它既可以指“保险保障范围”，也可以指“新闻报道范围/量”，还可以指“信号覆盖区域”，甚至在体育里指“防守覆盖”。判断含义时，优先看搭配：insurance coverage（保险保障）、media/news coverage（媒体报道）、cell/network coverage（信号覆盖）、defensive coverage（防守）。"]}
{"word":"coverages","summary":{"en":"Coverages is the plural of coverage, meaning insurance protections, coverage ranges (like signal/service), or media reporting.","zh":"Coverages 是 coverage 的复数，可指保险保障项目、（信号/服务等）覆盖范围，或媒体报道。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of coverage) protection provided by an insurance policy; the specific risks or services an insurance plan pays for.","zh":"（coverage 的复数）保险保障范围；保险条款所涵盖的风险或服务。"},"examples":[{"en":"This policy offers several coverages, including collision and theft.","zh":"这份保单提供多项保障范围，包括碰撞险和盗抢险。"},{"en":"Before you sign, compare the coverages and the deductibles.","zh":"签字前请比较各项保障范围和免赔额。"}]},{"partOfSpeech":"n.","definition":{"en":"(Plural of coverage) the extent or area that something reaches or includes, such as a service signal, mapping, or a program.","zh":"（coverage 的复数）覆盖范围；可覆盖到的区域或内容（如信号、地图、服务等）。"},"examples":[{"en":"Mobile coverages vary a lot in rural areas.","zh":"在乡村地区，手机信号覆盖范围差异很大。"},{"en":"Check the Wi‑Fi coverages on each floor of the building.","zh":"查看大楼每一层的 Wi‑Fi 覆盖范围。"}]},{"partOfSpeech":"n.","definition":{"en":"(Plural of coverage) news reporting or attention given to events in the media.","zh":"（coverage 的复数）媒体报道；媒体关注。"},"examples":[{"en":"The election received heavy media coverages on TV and online.","zh":"这次选举在电视和网络上都获得了大量报道。"},{"en":"Different newspapers gave different coverages of the same story.","zh":"不同报纸对同一新闻给出了不同的报道。"}]}],"synonyms":["insurance benefits","policy protections","coverage areas","media reports","reporting"],"phonetic":"ˈkʌvərɪdʒɪz","extraExplanation":["“coverage”在保险英语里非常常见，通常可数：a coverage / several coverages，指不同“险种/保障项目”（如医疗、碰撞、责任险等）。日常语境里表示“覆盖范围/媒体报道”时也可用复数，强调“不同范围/不同报道”。","在写作中，“media coverage”更常见；用“coverages”时，多用于对比或列举不同媒体/不同角度的多种报道。"]}
{"word":"coverall","summary":{"en":"Coverall most commonly means protective one-piece work clothing (often said as “coveralls”). It can also mean “comprehensive; covering everything.”","zh":"coverall 最常指连体工作/防护服（常说 coveralls）；也可作形容词表示“全面的、包罗万象的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(usually plural) A one-piece piece of work clothing that covers the body and regular clothes, often worn for protection; also called “coveralls.”","zh":"（通常用复数）连体工作服/防护服，用来覆盖身体和日常衣物，常用于保护；也常说 coveralls。"},"examples":[{"en":"He put on coveralls before fixing the car.","zh":"他在修车前穿上了连体工作服。"},{"en":"The factory provides coveralls for all workers.","zh":"工厂为所有工人提供连体工作服。"},{"en":"Wear coveralls to keep paint off your clothes.","zh":"穿上连体防护服，避免油漆弄脏衣服。"}]},{"partOfSpeech":"adj.","definition":{"en":"Including everything; general and complete (often used before a noun, like “a coverall policy”).","zh":"包罗万象的；全面的（常作定语，如“全面政策”）。"},"examples":[{"en":"They need a coverall plan for safety, training, and repairs.","zh":"他们需要一个涵盖安全、培训和维修的全面计划。"},{"en":"There is no coverall rule that fits every situation.","zh":"没有一条放之四海而皆准的通用规则。"}]}],"synonyms":["coveralls","jumpsuit","overalls","protective suit","all-purpose","comprehensive"],"phonetic":"/ˈkʌvərˌɔl/","extraExplanation":["“coverall(s)”在美式英语里更常见的说法是复数 coveralls（即使只指一件衣服也常用复数），指连体工作服；如果你想表达“覆盖所有情况的”，多用于正式或商务语境，如 coverall policy/term/solution。"]}
{"word":"coveralled","summary":{"en":"“Coveralled” means wearing coveralls; it can also (rarely) be the past form of “coverall.”","zh":"“coveralled”主要表示“穿着连体工作服”；也可（较少见）作动词“coverall”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Wearing coveralls (a one-piece protective work garment).","zh":"穿着连体工作服（用于保护的工装）。"},"examples":[{"en":"The coveralled mechanic slid under the car to check the leak.","zh":"穿着连体工装的修车师傅钻到车底检查漏油。"},{"en":"Coveralled workers moved quickly through the factory floor.","zh":"穿着连体工作服的工人们在车间里快速穿梭。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare) Past tense/past participle of “coverall”: to dress someone in coveralls or to put on coveralls.","zh":"（少见）动词“coverall”的过去式/过去分词：给某人穿上连体工作服；穿上连体工作服。"},"examples":[{"en":"He had coveralled before heading into the paint booth.","zh":"他在进喷漆房之前已经穿上了连体工作服。"},{"en":"The crew was coveralled and ready for the cleanup.","zh":"队员们都已换上连体工作服，准备开始清理。"}]}],"synonyms":["wearing coveralls","dressed in coveralls","in coveralls"],"phonetic":"/ˈkʌvərˌɔld/","extraExplanation":["“coveralled”在日常英语里不算常见，更常见的表达是：\n- “wearing coveralls”（穿着连体工作服）\n- “dressed in coveralls”（穿着连体工装）\n“coveralls”在美式英语里常指工厂、维修、农场、油漆作业等场景的防护服。"]}
{"word":"coveralls","summary":{"en":"Coveralls are protective one-piece work clothes worn over regular clothing.","zh":"coveralls 指穿在外面保护内衣的连体工作服。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a one-piece piece of clothing worn over other clothes to protect them while doing work (often made of denim or thick fabric)","zh":"（工作时穿的）连体工作服；工装连体衣（穿在外面用来保护里面的衣服）"},"examples":[{"en":"He put on his coveralls before fixing the car.","zh":"他在修车前穿上了连体工作服。"},{"en":"The mechanics wear blue coveralls at this garage.","zh":"这家修车厂的机修工穿蓝色连体工装。"}]},{"partOfSpeech":"n.","definition":{"en":"(general) protective work clothing, especially for dirty or heavy jobs","zh":"（统称）工作防护服；干脏活、重活时穿的工装"},"examples":[{"en":"Bring gloves and coveralls if you’re going to paint.","zh":"如果你要去刷漆，带上手套和工装。"},{"en":"Coveralls help keep dust off your clothes.","zh":"工装能帮你把灰尘挡在外面，不弄脏衣服。"}]}],"synonyms":["overalls","jumpsuit","work suit","workwear"],"phonetic":"/ˈkʌvərɔlz/","extraExplanation":["“coveralls”来自“cover（覆盖）+ all（全部）”，字面意思是“把全身都覆盖住的衣服”。在美式英语里很常见，指连体工作服；而“overalls”在美式英语里也常见，但更容易指“背带工装裤”（上衣和裤子不是连体）。"]}
{"word":"coverchief","summary":{"en":"Coverchief is a rare/old form of “kerchief,” meaning a small cloth used as a headscarf or handkerchief.","zh":"coverchief是“kerchief（头巾/方巾）”的罕见或较旧拼写，指可当头巾或手帕用的小方布。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Variant/rare spelling) a kerchief: a small square of cloth worn on the head/neck or used as a handkerchief.","zh":"（罕见/变体拼写）头巾/方巾：一块小方布，可系在头上或脖子上，也可当手帕使用。"},"examples":[{"en":"She tied a coverchief over her hair to keep the dust out.","zh":"她把一条coverchief系在头发上，防止灰尘进去。"},{"en":"In old stories, a woman might wave a coverchief as a signal.","zh":"在旧故事里，女人可能挥动一条coverchief作为信号。"}]}],"synonyms":["kerchief","headscarf","handkerchief","scarf"],"phonetic":"/ˈkɝːtʃɪf/","extraExplanation":["“coverchief”多见于较早期或非标准拼写，现代英语更常用“kerchief”。它由“cover（覆盖）+ chief（古义：头/首）”的构词联想而来，意思接近“用来遮盖头部的布”。","与“handkerchief”有重叠：handkerchief更偏“手帕”，kerchief更偏“头巾/围巾式小方巾”。"]}
{"word":"covercle","summary":{"en":"Couvercle: a sealing cap rock in geology; rarely, a lid/cover.","zh":"couvercle：地质学中指封盖层；少见用法指盖子/盖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Geology) An impermeable “cap rock” layer that seals a reservoir (such as oil or gas) and prevents fluids from escaping.","zh":"（地质学）盖层／封盖层：一层不透水（不透气）的“盖岩”，封住油气等储层，防止流体外泄。"},"examples":[{"en":"A thick shale couvercle helped trap natural gas in the reservoir.","zh":"一层厚的页岩盖层有助于把天然气封存在储层里。"},{"en":"If the couvercle is fractured, hydrocarbons may leak upward.","zh":"如果盖层出现裂隙，油气可能向上泄漏。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare; from French) A lid or cover, especially a small one.","zh":"（罕见；源自法语）盖子；盖（尤指较小的盖）。"},"examples":[{"en":"He lifted the couvercle of the dish to check what was inside.","zh":"他掀开盘子的盖子看看里面有什么。"},{"en":"The jar’s couvercle didn’t fit tightly, so the contents went stale.","zh":"罐子的盖子不太密封，所以里面的东西变不新鲜了。"}]}],"synonyms":["cap rock","seal","impermeable layer","lid (rare sense)","cover (rare sense)"],"phonetic":"/ˈkuːvərkəl/","extraExplanation":["你输入的“covercle”不是常见的英语拼写；更常见的形式是 **couvercle**（源自法语）。在日常英语里几乎不用来表示“盖子”，但在地质/油气领域会见到它表示“封盖层（cap rock）”。如果你想表达普通的“盖子”，更自然的词是 **lid** 或 **cover**。"]}
{"word":"Coverdale","summary":{"en":"Coverdale is a proper name—most commonly a surname, and in history it often refers to Miles Coverdale and the 1535 Coverdale Bible.","zh":"Coverdale 是专有名词，常见为姓氏；在历史语境中多指迈尔斯·科弗代尔及1535年的《科弗代尔圣经》。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname); often used as a proper noun","zh":"科弗代尔（姓氏）；常作专有名词使用"},"examples":[{"en":"My history teacher’s last name is Coverdale.","zh":"我的历史老师姓科弗代尔。"},{"en":"The letter was signed “J. Coverdale.”","zh":"信件署名为“J. 科弗代尔”。"}]},{"partOfSpeech":"n.","definition":{"en":"Miles Coverdale (1488–1569), an English church leader and Bible translator; the name is especially associated with the Coverdale Bible (1535)","zh":"迈尔斯·科弗代尔（1488–1569）：英国宗教人物与《圣经》译者；尤与《科弗代尔圣经》（1535）相关"},"examples":[{"en":"Coverdale helped produce an early English translation of the Bible.","zh":"科弗代尔参与了早期英文《圣经》译本的制作。"},{"en":"In class we compared the Coverdale Bible with later translations.","zh":"课堂上我们把《科弗代尔圣经》和后来的译本做了比较。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name (e.g., Coverdale in Canada); used as a proper noun for locations","zh":"科弗代尔（地名，例如加拿大的 Coverdale）；作地点专有名词"},"examples":[{"en":"They drove through Coverdale on the way to the coast.","zh":"他们去海边的路上开车经过了科弗代尔。"}]}],"synonyms":["(surname)","Miles Coverdale","the Coverdale Bible"],"phonetic":"/ˈkʌvərˌdeɪl/","extraExplanation":["“Coverdale”最常在历史与宗教语境中出现，指16世纪英国宗教改革时期的重要人物迈尔斯·科弗代尔（Miles Coverdale）。他主持或参与的《科弗代尔圣经》（1535）是最早的完整英文《圣经》译本之一，对后来的英文圣经传统与宗教英语表达有影响。","读到“the Coverdale Bible”时通常特指1535年版本；在学术写作中也会把“Coverdale”当作人名来指代其译本风格或版本传统（类似说“Shakespeare”指莎士比亚的作品）。"]}
{"word":"covered","summary":{"en":"“Covered” usually means “having something on top,” “included/handled,” or “insured,” and it is also the past form of “cover.”","zh":"covered 常指“被覆盖的/被遮住的”，也可指“被包含/被讲到的”或“（保险）承保的”；同时它也是 cover 的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having something over it; protected, hidden, or filled by a layer of something.","zh":"被覆盖的；有东西盖在上面（因此被保护、被遮住或被铺满）的。"},"examples":[{"en":"The mountains were covered with snow.","zh":"群山被白雪覆盖。"},{"en":"Keep the food covered to stop flies.","zh":"把食物盖好，防止苍蝇。"}]},{"partOfSpeech":"adj.","definition":{"en":"Included or dealt with (in a plan, report, class, or discussion).","zh":"被包含的；被涉及/被讲到的（在计划、报告、课程或讨论中）。"},"examples":[{"en":"We covered the basics in today’s lesson.","zh":"我们今天的课讲了基础内容。"},{"en":"Is this topic covered in the exam?","zh":"这个话题考试会考到吗？"}]},{"partOfSpeech":"adj.","definition":{"en":"Protected by insurance; paid for by an insurance plan.","zh":"（保险）承保的；由保险支付/报销的。"},"examples":[{"en":"This medicine is covered by my insurance.","zh":"这种药在我的保险报销范围内。"},{"en":"Dental care isn’t fully covered for many people.","zh":"很多人的牙科并不是全额报销的。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense and past participle of “cover”: to place something over; to include; to report on; to protect.","zh":"“cover”的过去式/过去分词：覆盖；包括；报道；保护。"},"examples":[{"en":"She covered the pot with a lid.","zh":"她用锅盖盖住了锅。"},{"en":"The journalist covered the election.","zh":"记者报道了这次选举。"}]}],"synonyms":["hidden","coated","blanketed","included","protected","insured"],"phonetic":"/ˈkʌvɚd/","extraExplanation":["“covered”在英语里很常见，既可以指“物理上盖住”（covered with snow），也常用于抽象含义：\n- 学习/会议/报道：cover a topic（讲到某个话题）、cover an event（报道某事件）\n- 保险：be covered（在报销范围内）\n遇到句子时可以先判断是“被什么盖住/充满”（covered with + 名词）还是“内容被涉及/被报销”。"]}
{"word":"coverer","summary":{"en":"A coverer is someone or something that covers (physically or by doing coverage/covering a shift).","zh":"coverer 指“覆盖者/覆盖物”，也可指“报道者”或“代班的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or thing that covers something (for example, something used to put over an object for protection).","zh":"覆盖者；覆盖物（指人或物，用来盖住或保护某物）。"},"examples":[{"en":"Put the coverer over the food to keep flies away.","zh":"把覆盖物盖在食物上，防止苍蝇飞过来。"},{"en":"The plant’s leaves act as a natural coverer for the soil.","zh":"植物的叶子像天然的覆盖物，保护土壤。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who covers an event or story, often as a reporter; someone who fills in for another person’s duties.","zh":"（新闻等）报道者；（工作）替补/代班者。"},"examples":[{"en":"She worked as a coverer for local elections.","zh":"她负责报道地方选举。"},{"en":"We need a coverer for the night shift while he’s sick.","zh":"他生病期间，我们需要一个人来代班夜班。"}]}],"synonyms":["cover","lid","wrapper","protector","reporter","substitute","fill-in"],"phonetic":"/ˈkʌvərər/","extraExplanation":["“coverer”由动词 cover（覆盖/报道/代班）+ 后缀 -er 构成，-er 常表示“做某事的人/物”。不过在日常英语里，表示“覆盖物”更常用 cover, lid, wrapper, blanket 等；表示“代班的人”更常说 substitute 或 fill-in；表示“报道者”更常用 reporter 或 correspondent。"]}
{"word":"coverers","summary":{"en":"“Coverers” is the plural of “coverer,” meaning things that cover/protect something, or (less commonly) people who cover news or events.","zh":"“coverers”是“coverer”的复数，指用于覆盖/保护的东西，或（较少见）指采访报道新闻或事件的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or things that cover something (protect, hide, or put a layer over it).","zh":"覆盖某物的人或物（用来保护、遮挡，或在表面加一层）。"},"examples":[{"en":"The patio furniture came with waterproof coverers to keep the rain off.","zh":"露台家具附带防水覆盖物，用来防雨。"},{"en":"In winter, plant coverers can protect young seedlings from frost.","zh":"冬天，植物覆盖物可以保护幼苗免受霜冻。"}]},{"partOfSpeech":"n.","definition":{"en":"People who cover news or events; reporters (less common, usually “reporters” or “correspondents”).","zh":"报道新闻或事件的人；记者（较少见，通常说 reporter 或 correspondent）。"},"examples":[{"en":"War coverers faced strict travel rules and serious safety risks.","zh":"战地报道人员面临严格的出行规定和严重的安全风险。"},{"en":"The event drew many media coverers from around the country.","zh":"这场活动吸引了全国各地的许多媒体采访人员。"}]}],"synonyms":["covers","coverings","protective covers","reporters","correspondents"],"phonetic":"/ˈkʌvərɚ/","extraExplanation":["“coverer”是由动词 cover（覆盖/遮盖/报道）加上表示“做某事的人/物”的后缀 -er 构成。更自然常见的表达通常是：物→cover(s), covering(s)；人（新闻报道）→reporter(s), correspondent(s)。"]}
{"word":"coverian","summary":{"en":"“Coverian” is usually a proper name or a misspelling, not a common English vocabulary word.","zh":"“Coverian”通常是专有名词或拼写误差，并非常见英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; most often encountered as a proper name (e.g., a surname) or as a misspelling/variant of a different word.","zh":"不是英语常用词典中的标准词；最常见的情况是作为专有名词（如姓氏）出现，或是其他单词的拼写错误/变体。"},"examples":[{"en":"I couldn’t find “coverian” in standard dictionaries—do you mean a person’s name (Coverian) or another word?","zh":"我在常用词典里找不到“coverian”——你是指人名（Coverian），还是想写另一个单词？"},{"en":"The paper mentions the Coverian group (a name), not a general English vocabulary word.","zh":"这篇论文提到的是 Coverian 团队（名称），而不是一个通用英文词汇。"}]}],"synonyms":["(if you meant) covariant","(if you meant) covariance","covering"],"phonetic":"/kʌˈvɪriən/","extraExplanation":["“coverian”很可能是拼写误差。最常见的相近目标词有：\n1) covariant /koʊˈvɛriənt/（数学/物理：协变的）；\n2) covariance /koʊˈvɛriəns/（协方差）；\n3) covering（覆盖物；覆盖的）。\n如果你把原句/截图发我，我可以根据上下文判断你真正想查的词，并给出准确释义与用法。"]}
{"word":"covering","summary":{"en":"“Covering” most commonly means a protective layer/material; it can also describe something used for covering, or (in media) the reporting of an event.","zh":"“covering”最常指“覆盖层/遮盖物”；也可作形容词表示“用于遮盖的”；在媒体语境中还可指“报道”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a layer or material that covers, protects, or hides something","zh":"覆盖层；罩物；用来遮盖、保护或隐藏某物的一层材料"},"examples":[{"en":"Put a covering over the food to keep flies away.","zh":"给食物盖上覆盖物，防止苍蝇飞。"},{"en":"The sofa has a fabric covering that you can remove and wash.","zh":"这张沙发有可拆洗的布套（覆盖层）。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of something) covering; used to cover or protect","zh":"覆盖的；用于遮盖或保护的"},"examples":[{"en":"Wear a covering layer if the weather turns cold.","zh":"如果天气变冷，就穿一层外套来遮挡保暖。"},{"en":"The workers used covering sheets to protect the floor from paint.","zh":"工人用遮盖布保护地板不被油漆弄脏。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of reporting on an event or topic (journalism/media)","zh":"（新闻/媒体）报道；采写"},"examples":[{"en":"Her covering of the election was clear and fair.","zh":"她对选举的报道清晰而公正。"},{"en":"We need more local covering of community issues.","zh":"我们需要更多对社区议题的本地报道。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “cover”: putting something over; including; protecting; or reporting on (depending on context)","zh":"“cover”的现在分词：覆盖；包含；保护；或（新闻）报道（依语境而定）"},"examples":[{"en":"She is covering the pot with a lid.","zh":"她正用锅盖盖住锅。"},{"en":"The insurance is covering most of the cost.","zh":"保险正在承担大部分费用。"},{"en":"He’s covering the story for a TV station.","zh":"他在为电视台报道这条新闻。"}]}],"synonyms":["cover","covering layer","covering material","cover-up","protection","coating","wrap","covering sheet","coverage"],"phonetic":"ˈkʌvərɪŋ","extraExplanation":["“covering”常见两种语法身份：\n1) 名词：a covering = “一个覆盖物/遮盖物”。\n2) 形容词/分词：covering + 名词，表示“用来遮盖的/覆盖的”，如 covering layer（覆盖层）。\n另外，它也可能是动词cover的现在分词，用于进行时（is covering）或作补充说明。"]}
{"word":"coverings","summary":{"en":"“Coverings” means things that cover or protect something; it can also refer to natural outer layers (fur, feathers) or insurance coverages.","zh":"“coverings”指用于覆盖或保护的物品/覆盖层；也可指动物体表覆盖物（毛、羽毛等）或保险中的不同承保项目。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Things that cover or protect something (the plural of “covering”), such as layers, materials, or objects placed over a surface.","zh":"覆盖物；遮盖物（“covering”的复数），指用来覆盖或保护某物的材料、层或物体。"},"examples":[{"en":"The sofa had protective coverings to keep it clean.","zh":"沙发上有保护性覆盖物，用来保持清洁。"},{"en":"Remove the coverings before using the machine.","zh":"使用机器前请先移除遮盖物。"},{"en":"Snow and ice are natural winter coverings for the ground.","zh":"雪和冰是冬季地面天然的覆盖层。"}]},{"partOfSpeech":"n.","definition":{"en":"Outer layers on the body or on animals, such as skin, fur, feathers, or hair (used in biology or general description).","zh":"（身体或动物的）外层覆盖物，如皮肤、毛、羽毛或头发（常用于生物或描述）。"},"examples":[{"en":"Birds have feather coverings that help them stay warm.","zh":"鸟类有羽毛覆盖层，帮助它们保暖。"},{"en":"Reptiles have scaly coverings.","zh":"爬行动物有鳞片覆盖层。"}]},{"partOfSpeech":"n.","definition":{"en":"Materials or topics included in insurance or official protection (as in “insurance coverage,” often used in plural in formal contexts).","zh":"（保险或正式保障的）承保项目；保障范围（如 insurance coverage，在正式语境中可用复数）。"},"examples":[{"en":"Check your policy to understand the different coverages and limits.","zh":"查看你的保单，了解不同的承保项目和限额。"},{"en":"The plan offers coverages for accidents and theft.","zh":"该方案提供意外和盗窃的保障项目。"}]}],"synonyms":["covers","coverings","coatings","layers","wrappings","protective layers","outer layers"],"phonetic":"/ˈkʌvərɪŋz/","extraExplanation":["“coverings”通常就是“covering（覆盖物）”的复数，强调“有多种/多个覆盖物”。在保险语境里，虽然更常见的是“coverage（保障范围）”，但在美式英语中也常用“coverages”来指不同的承保项目（例如碰撞险、盗抢险等）。"]}
{"word":"coverir","summary":{"en":"Cover means to put something over something else, or to include/report on something; as a noun it can be a protective layer (like a lid or book cover) or a song remake.","zh":"cover 可表示“覆盖/遮盖”“涵盖/涉及”“（记者）报道”；作名词可指“盖子/封面等覆盖物”，也可指“翻唱”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to place something over or on top of another thing, often to protect or hide it","zh":"覆盖；盖住（常为保护或遮挡）"},"examples":[{"en":"Cover the soup so it stays warm.","zh":"把汤盖起来，这样能保温。"},{"en":"Snow covered the roads overnight.","zh":"一夜之间，积雪覆盖了道路。"}]},{"partOfSpeech":"v.","definition":{"en":"to include or deal with a topic, area, or time period","zh":"涵盖；涉及（某主题/范围/时期）"},"examples":[{"en":"This course covers basic English grammar.","zh":"这门课涵盖基础英语语法。"},{"en":"The report covers the years 2020 to 2025.","zh":"这份报告涵盖2020到2025年。"}]},{"partOfSpeech":"v.","definition":{"en":"to report on an event or story as a journalist; to follow it closely","zh":"报道（新闻/事件）；跟踪采访"},"examples":[{"en":"She covered the election for a local newspaper.","zh":"她为地方报纸报道了这次选举。"},{"en":"We’re covering the storm live.","zh":"我们正在直播报道这场风暴。"}]},{"partOfSpeech":"n.","definition":{"en":"something that goes over or around an object to protect it or hide it","zh":"罩；套；盖子；封面（用来保护或遮挡的东西）"},"examples":[{"en":"Put the cover back on the container.","zh":"把容器的盖子盖回去。"},{"en":"The book has a blue cover.","zh":"这本书有一个蓝色封面。"}]},{"partOfSpeech":"n.","definition":{"en":"a new performance or recording of a song originally done by someone else","zh":"翻唱（他人原唱歌曲的新版本）"},"examples":[{"en":"Their cover of the song became popular online.","zh":"他们对这首歌的翻唱在网上走红了。"}]}],"synonyms":["hide","shield","protect","include","report","lid","case"],"phonetic":"/ˈkʌvɚ/","extraExplanation":["你输入的“coverir”不是常见英文单词，可能是拼写错误，想写的是“cover”。如果你其实想表达法语“couvrir”（覆盖）或西语“cubrir”（覆盖），也都对应英文的“cover”。","在音乐里，名词 cover 指“翻唱版本”，动词 cover 也可以表示“翻唱/改编”一首歌。"]}
{"word":"coverless","summary":{"en":"“Coverless” means “without a cover.”","zh":"“coverless”意思是“没有封面/盖子/覆盖物的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no cover; not covered (for example, a book without a cover or a container without a lid).","zh":"没有封面（或盖子、覆盖物）的；未被覆盖的（如没有封皮的书、没有盖子的容器）。"},"examples":[{"en":"I found a coverless book on the bus and turned it in to the driver.","zh":"我在公交车上捡到一本没有封皮的书，就交给了司机。"},{"en":"The coverless pot let steam escape quickly.","zh":"这个没有盖子的锅让蒸汽很快就散出去了。"},{"en":"He kept the coverless notebook in a plastic bag to protect it.","zh":"他把那本没有封面的笔记本放进塑料袋里保护起来。"}]}],"synonyms":["uncovered","without a cover","cover-free","bare"],"phonetic":"/ˈkʌvər.ləs/","extraExplanation":["“coverless”在日常英语中不算常见，更常见的表达是“without a cover / with no cover / uncovered”。不过它在描述实物状态（书、盒子、容器等）时很直观。注意不要和“uncovered”（未覆盖的）或“sleeveless”（无袖的）混淆。"]}
{"word":"coverlet","summary":{"en":"A coverlet is a small, often decorative bedcover placed on top of other bedding.","zh":"coverlet 指较小、常带装饰性的床罩/薄毯，通常铺在其他寝具上方。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small bedcover, often a decorative blanket or quilt used on top of other bedding.","zh":"床罩；（常为装饰性的）薄毯、被面（铺在其他寝具上方）"},"examples":[{"en":"She spread a blue coverlet over the bed to make the room look brighter.","zh":"她在床上铺了一条蓝色的床罩，让房间看起来更明亮。"},{"en":"In the old photo, a patchwork coverlet is draped across the foot of the bed.","zh":"在那张老照片里，一条拼布床罩搭在床尾。"}]}],"synonyms":["bedspread","quilt","bedcover","blanket"],"phonetic":"/ˈkʌvərlɪt/","extraExplanation":["“coverlet”常见于较文学或较正式的语境，比日常口语中的“blanket / bedspread”更带一点“旧式、精致”的感觉。","词源上与“cover（覆盖）”有关，后缀“-let”有“小的”意味，所以可以理解为“较小的覆盖物”。","相关词对比：bedspread（床罩，常更大更厚、覆盖整张床）；quilt（被子/绗缝被，强调缝制工艺）；blanket（毯子，更通用）。"]}
{"word":"coverlets","summary":{"en":"Coverlets are lightweight bed coverings, often used for warmth or decoration; this is the plural form of coverlet.","zh":"coverlets 是 coverlet 的复数，指轻薄的床上覆盖物（薄被/床罩），常用于保暖或装饰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A coverlet; a lightweight bed covering (often decorative), used on top of sheets or as a thin blanket.","zh":"（床上的）薄被子；床罩（通常较轻、偏装饰性，可铺在床单上方或当作薄毯使用）"},"examples":[{"en":"She folded the coverlet neatly at the foot of the bed.","zh":"她把薄被整齐地叠好，放在床尾。"},{"en":"In summer we use a cotton coverlet instead of a heavy comforter.","zh":"夏天我们用棉质床罩代替厚羽绒被。"}]}],"synonyms":["bedspread","quilt","throw","blanket"],"phonetic":"/ˈkʌvərlɪts/","extraExplanation":["“Coverlet”常指比“comforter/duvet（厚被）”更薄、更轻的床上覆盖物，很多时候也带有装饰功能，类似“bedspread（床罩）”，但语感上更强调“轻薄的一层”。","词形：coverlets 是 coverlet 的复数形式。日常购物/家居语境里也常见搭配：quilt（绗缝被）、throw（沙发毯/盖毯）、bedspread（床罩）、comforter（厚被）。"]}
{"word":"Coverley","summary":{"en":"Coverley most commonly refers to the name in “Sir Roger de Coverley,” a famous fictional country gentleman from *The Spectator*, and also to a traditional English country dance named after him.","zh":"Coverley 最常见是“Sir Roger de Coverley”中的名字：出自《旁观者》的著名虚构英国乡绅；也可指以他命名的传统英格兰乡村舞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in \"Sir Roger de Coverley\") A fictional English country gentleman, created by Joseph Addison (with Richard Steele), famous from essays in *The Spectator* (1711–1712).","zh":"（见“Sir Roger de Coverley”）由约瑟夫·艾迪生（与理查德·斯蒂尔）塑造的虚构英国乡绅形象，出自《旁观者》（1711–1712）随笔，极为著名。"},"examples":[{"en":"In *The Spectator*, Sir Roger de Coverley is warm-hearted but old-fashioned.","zh":"在《旁观者》里，罗杰·德·卡弗利爵士心地善良，但有些守旧。"},{"en":"The character of Coverley is often used to represent the \"gentle country squire\" in early English literature.","zh":"“卡弗利”这一人物常被用来代表早期英国文学中的“乡村绅士”形象。"}]},{"partOfSpeech":"n.","definition":{"en":"A traditional English country dance (also called the \"Sir Roger de Coverley\"), often performed at Christmas or at the end of a party; closely related to the American dance \"Virginia reel.\"","zh":"一种传统英格兰乡村舞（也叫“Sir Roger de Coverley”），常在圣诞节或聚会结束时跳；与美国的“Virginia reel（弗吉尼亚轮舞）”很相近。"},"examples":[{"en":"They ended the holiday party with the Sir Roger de Coverley dance.","zh":"他们用“Sir Roger de Coverley”乡村舞为节日聚会收尾。"},{"en":"If you know the Virginia reel, Coverley will feel familiar.","zh":"如果你会跳 Virginia reel（弗吉尼亚轮舞），Coverley 会让你觉得很熟悉。"}]}],"synonyms":["Sir Roger de Coverley","Coverley dance","English country dance"],"phonetic":"/ˈkʌvərli/","extraExplanation":["“Coverley”单独出现时，通常是“Sir Roger de Coverley”的简称；更完整、更常见的词条是 Sir Roger de Coverley。","《旁观者》（The Spectator）是一份18世纪初英国的重要刊物，Addison 与 Steele 用一系列人物（包括 Sir Roger）来评论社会、礼仪与道德，因此这个名字在英语文化中带有“传统、乡绅气质、旧式礼仪”的联想。","作为舞名时，“Sir Roger de Coverley”常被当作一种“最后的舞”（last dance），象征热闹的集体收尾。"]}
{"word":"coverlid","summary":{"en":"“Cover lid” means a lid/top that covers a container’s opening.","zh":"“cover lid”指用来盖住容器开口的盖子/顶盖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A lid or top that covers the opening of a container (often used in packaging, storage, or lab contexts).","zh":"（容器的）盖子；覆盖开口的顶盖（常见于包装、收纳或实验场景）。"},"examples":[{"en":"Make sure the cover lid is tight before you shake the bottle.","zh":"摇瓶子之前，确保盖子拧紧。"},{"en":"The food stayed fresh because the container had a secure cover lid.","zh":"因为容器有牢固的盖子，食物保持新鲜。"}]}],"synonyms":["lid","cover","cap","top"],"phonetic":"/ˈkʌvər lɪd/","extraExplanation":["“cover lid”更常写作两个词（cover lid）或写成“cover-lid”。单写作“coverlid”多见于产品说明、零件名称、工程图纸或非正式拼写。日常英语里更常用“lid”“cover”或更具体的“cap”（多指瓶盖）。"]}
{"word":"coverlids","summary":{"en":"Cover lids are lids or protective covers that close or shield something.","zh":"cover lids 指用于封闭或保护某物的盖子/防护盖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lid that covers and closes a container, opening, or device (plural: cover lids)","zh":"（容器、开口或装置的）盖子/上盖（复数：cover lids）"},"examples":[{"en":"Please put the cover lids back on the jars after you use them.","zh":"用完后请把罐子的盖子盖回去。"},{"en":"The box comes with two cover lids to keep dust out.","zh":"这个盒子配有两个上盖，用来防尘。"}]},{"partOfSpeech":"n.","definition":{"en":"protective caps or panels used to shield parts of a machine or product","zh":"（机器或产品的）防护盖/保护罩"},"examples":[{"en":"Remove the cover lids before cleaning the filter.","zh":"清洁滤网前先取下防护盖。"},{"en":"The technician checked the cover lids to make sure they were securely fastened.","zh":"技术人员检查了保护罩，确保固定牢靠。"}]}],"synonyms":["lids","caps","covers","tops","closures"],"phonetic":"/ˈkʌvɚ lɪdz/","extraExplanation":["“cover lids”更常写成两个词（cover + lids）。单写成“coverlids”不太常见，多见于产品说明、零件清单或厂内用语。","如果你想表达“眼皮”，英语通常用“eyelids”，而不是“coverlids”。"]}
{"word":"covers","summary":{"en":"“Covers” most often means “puts something over” (verb) or “protective outer layers” (plural noun).","zh":"“Covers”常见意思是“覆盖/遮盖”（动词）或“外罩、封面等保护层”（名词复数）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(verb) Third-person singular of “cover”: to place something over, on top of, or around something to protect it, hide it, or keep it warm/dry.","zh":"（动词）“cover”的第三人称单数：覆盖在……上，用来保护、遮挡或保暖/防潮。"},"examples":[{"en":"She covers the food with plastic wrap to keep it fresh.","zh":"她用保鲜膜把食物盖起来保持新鲜。"},{"en":"The report covers safety rules and emergency steps.","zh":"这份报告涵盖安全规则和应急步骤。"},{"en":"He covers his mouth when he coughs.","zh":"他咳嗽时会捂住嘴。"}]},{"partOfSpeech":"n.","definition":{"en":"(noun, plural) Protective outer layers or pages, especially for books, phones, furniture, or beds.","zh":"（名词复数）外罩/封面等保护层，常指书的封面、手机壳、家具罩、床罩等。"},"examples":[{"en":"I like books with hard covers because they last longer.","zh":"我喜欢精装书，因为更耐用。"},{"en":"These sofa covers are washable.","zh":"这些沙发罩可以清洗。"},{"en":"Bring extra covers if the nights are cold.","zh":"如果夜里冷，就多带几条毯子/被子。"}]}],"synonyms":["protects","hides","shields","includes","wraps","coats"],"phonetic":"/ˈkʌvɚz/","extraExplanation":["“cover”很常见的引申义是“涵盖（内容/范围）”，比如 news coverage（新闻报道）和 the course covers…（课程涵盖……）。","在日常口语里，cover 还可以表示“代班/顶班”：Can you cover for me?（你能替我顶一下吗？）这里的 covers 指动词形式变化，不是名词“封面”。"]}
{"word":"coversed","summary":{"en":"“coversed” is not standard; it’s usually a misspelling of “conversed” (= talked with).","zh":"“coversed”不是标准拼法；通常是把“conversed”（=交谈过）拼错了。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Likely intended) past tense/past participle of “converse”: to talk with someone; to have a conversation.","zh":"（可能想写）“converse”的过去式/过去分词：与某人交谈；进行谈话。"},"examples":[{"en":"We conversed for a while after the meeting.","zh":"会议结束后，我们聊了一会儿。"},{"en":"She conversed politely with the guests.","zh":"她礼貌地和客人交谈。"},{"en":"They had conversed by email before they met in person.","zh":"他们在见面之前就通过邮件交流过。"}]},{"partOfSpeech":"other","definition":{"en":"Note: “coversed” is not a standard English word; it is most often a misspelling of “conversed.”","zh":"注意：“coversed”不是标准英语单词；最常见情况是把“conversed”拼错了。"},"examples":[{"en":"Incorrect: We coversed yesterday.  Correct: We conversed yesterday.","zh":"错误：We coversed yesterday. 正确：We conversed yesterday."}]}],"synonyms":["talked","chatted","spoke","communicated"],"phonetic":"/kənˈvɝst/","extraExplanation":["“converse”常见作动词，意思是“交谈”；写作更正式一些，日常口语更常用“talk (to/with)”或“chat (with)”。","如果你本来想表达“覆盖/包含”，可能要用“covered”（cover的过去式），例如：The insurance covered the cost.（保险覆盖了费用。）"]}
{"word":"coverside","summary":{"en":"“coverside” means the outside cover face/side of a book or similar item, especially in printing/design contexts.","zh":"“coverside”指书本等物品的外侧封面那一面，常用于印刷/设计语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The outside face of something that has a cover (especially a book, magazine, or notebook), such as the front cover or back cover side.","zh":"有封面的物品（尤指书、杂志、笔记本）的外侧封面那一面，例如封面或封底那一侧。"},"examples":[{"en":"The coverside is scratched, but the pages are fine.","zh":"封面那一侧被刮花了，但内页没问题。"},{"en":"Please print the title on the front coverside.","zh":"请把标题印在正面封面那一侧。"}]},{"partOfSpeech":"n.","definition":{"en":"In printing/design, the side intended to carry cover artwork or main branding (contrasted with the inside).","zh":"（印刷/设计）指用来放封面图像或主要品牌信息的那一面（相对于内侧）。"},"examples":[{"en":"Use a thicker paper stock for the coverside.","zh":"封面那一面要用更厚的纸张。"},{"en":"The logo should appear on the coverside, not on the inside.","zh":"标志应该放在封面那一面，而不是内侧。"}]}],"synonyms":["cover side","front cover","back cover","cover page","outside cover"],"phonetic":"/ˈkʌvərˌsaɪd/","extraExplanation":["“coverside”不是非常常见的单词形式，更常见的写法是两个词（cover side）或加连字符（cover-side）。在日常英语里，人们也更常说“front cover / back cover / cover page”。"]}
{"word":"coversine","summary":{"en":"Coversine is a rarely used trig function meaning 1 − sin(x).","zh":"coversine 是一个较少使用的三角函数，表示 1 − sin(x)。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Mathematics) A trigonometric function defined as coversine(x) = 1 − sin(x).","zh":"（数学）一个三角函数，定义为 coversine(x) = 1 − sin(x)（1 减去正弦值）。"},"examples":[{"en":"In some older math tables, you may see coversine(x) listed as 1 − sin(x).","zh":"在一些较旧的数学函数表中，你可能会看到 coversine(x) 被列为 1 − sin(x)。"},{"en":"Because coversine is not commonly used today, most people write 1 − sin(x) directly instead.","zh":"由于 coversine 现在不太常用，大多数人会直接写 1 − sin(x)。"}]}],"synonyms":["1 − sin(x)"],"phonetic":"/ˈkʌvərˌsaɪn/","extraExplanation":["coversine 属于一组“古典三角函数命名”，和 versine（1−cos x）、haversine（(1−cos x)/2）类似。它们曾更常出现在旧式航海、测量和对数/三角函数表中，用来把某些计算写得更方便。现代教材与计算器里通常不会单列 coversine，而是直接用 1−sin(x) 表达。"]}
{"word":"coverslip","summary":{"en":"A thin clear cover placed over a specimen on a microscope slide.","zh":"覆盖在显微镜载玻片样本上的薄透明盖片（盖玻片）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A thin, transparent piece of glass or plastic placed over a specimen on a microscope slide to flatten it, protect it, and improve viewing.","zh":"（显微镜）盖玻片：覆盖在载玻片上方的薄而透明的玻璃或塑料片，用来压平样本、保护样本并提升观察效果。"},"examples":[{"en":"Place a coverslip over the drop of water so you can see the cells clearly.","zh":"把盖玻片盖在那滴水上，这样你就能清楚看到细胞。"},{"en":"Be careful not to trap air bubbles under the coverslip.","zh":"小心别让气泡被困在盖玻片下面。"},{"en":"The student cracked the coverslip by pressing too hard.","zh":"学生按得太用力，把盖玻片压裂了。"}]}],"synonyms":["cover glass","cover slip"],"phonetic":"/ˈkʌvərˌslɪp/","extraExplanation":["在实验室里常见的搭配有：microscope slide（载玻片）+ coverslip（盖玻片）。两者一起使用：样本放在载玻片上，再用盖玻片覆盖。","盖玻片的常见规格会用毫米表示（如 18×18 mm），并且非常薄，操作时通常用镊子夹取以避免沾指纹或折断。"]}
{"word":"coverslut","summary":{"en":"A slang term for someone who chooses or buys books mainly because they love the cover design (humorous but contains a potentially offensive word).","zh":"指因迷恋封面设计而主要凭封面选书/买书的人（带玩笑语气，但含有可能冒犯的词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, informal) A person who is strongly attracted to book covers and may buy or choose books mainly because of the cover design (often used humorously within reading communities).","zh":"（俚语，非正式）指特别迷恋书籍封面设计的人，可能主要因为封面好看就买书或选书（在读书圈里常带自嘲/玩笑语气）。"},"examples":[{"en":"I’m a total coverslut—I picked this novel just because the cover was gorgeous.","zh":"我完全是个“封面控”——我选这本小说就是因为封面太好看了。"},{"en":"As a coverslut, I’m easily tempted by special editions and shiny foil covers.","zh":"作为“封面控”，我很容易被特别版和闪闪发亮的烫金封面诱惑。"}]}],"synonyms":["cover lover","cover-based buyer","judge a book by its cover (humorous)"],"phonetic":"/ˈkʌvɚˌslʌt/","extraExplanation":["这个词由“cover（封面）+ slut”构成。“slut”在英语里本来是很强烈、带羞辱性的词（通常指性方面的辱骂），因此“coverslut”虽然在部分阅读社群中常被当作玩笑/自嘲用语，但在不熟悉语境或正式场合可能显得粗鲁或冒犯。更中性、安全的说法可以用：cover lover（封面爱好者）、cover-based buyer（看封面买书的人）、I judge books by their covers（我常看封面选书）。"]}
{"word":"covert","summary":{"en":"Covert usually means “secret/hidden,” especially actions done to avoid being noticed.","zh":"Covert 通常表示“秘密的/隐蔽的”，多指为了不被发现而进行的行为或活动。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Hidden or secret, especially done to avoid being noticed.","zh":"隐蔽的；秘密的（尤指为了不被察觉而进行的）。"},"examples":[{"en":"The journalist reported on covert operations overseas.","zh":"这位记者报道了海外的秘密行动。"},{"en":"They held a covert meeting to discuss the plan.","zh":"他们秘密开会讨论这个计划。"}]},{"partOfSpeech":"vt.","definition":{"en":"To cover or hide something; to disguise (less common in modern English).","zh":"遮盖；隐藏；掩饰（现代英语中较少见）。"},"examples":[{"en":"The spy covertly concealed the document in his coat.","zh":"间谍悄悄把文件藏在外套里。"},{"en":"Her smile could not covert her disappointment.","zh":"她的微笑无法掩饰她的失望。"}]}],"synonyms":["secret","hidden","clandestine","undercover","stealthy"],"phonetic":"/ˈkoʊvɝt/","extraExplanation":["“covert”常与“overt（公开的）”成对出现：covert=暗地里进行的；overt=公开进行的。","常见搭配：covert action/operation（秘密行动）、covert surveillance（秘密监视）、covert support（暗中支持）。","易混淆词：covert（隐蔽的） vs. covered（被覆盖的） vs. covertly（副词：秘密地）。","词源提示：来自法语/拉丁语“cover（覆盖）”相关的词根，所以核心感觉是“盖住→不让人看见”。"]}
{"word":"covertical","summary":{"en":"Covertical means “vertically aligned”—on the same vertical line or axis (a technical term).","zh":"covertical 指“竖直对齐/在同一竖直线上”（偏专业用语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Technical) Lying on or sharing the same vertical line or axis; aligned directly above and below one another.","zh":"（专业用语）在同一条竖直线上；共用同一竖直轴线；上下对齐。"},"examples":[{"en":"In the diagram, the two sensors are covertical, so their readings can be compared at the same horizontal position.","zh":"在图中，这两个传感器共竖直对齐，因此可以在同一水平位置比较它们的读数。"},{"en":"Make sure the holes are covertical before you drill, or the bolt won’t pass through smoothly.","zh":"钻孔前要确保这些孔在同一竖直线上，否则螺栓就不容易顺利穿过。"},{"en":"The architect checked that the windows on each floor were covertical to keep the facade balanced.","zh":"建筑师检查每层的窗户是否上下对齐，以保持立面均衡。"}]}],"synonyms":["vertically aligned","in vertical alignment","collinear (vertical context)","aligned"],"phonetic":"/ˌkoʊˈvɝːtɪkəl/","extraExplanation":["“co-”表示“共同、一起”，加上“vertical（竖直的）”构成“covertical”。该词比较少见，多出现在几何、工程制图、建筑、测量等需要强调“上下在同一直线/同一竖直方向对齐”的语境中。日常英语里更常用的表达是“vertically aligned”“in vertical alignment”或“one directly above the other”。"]}
{"word":"covertly","summary":{"en":"“Covertly” means doing something secretly or in a concealed way to avoid being noticed.","zh":"“covertly”表示为了不被察觉而秘密地、隐蔽地做某事。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a secret or hidden way, especially to avoid being noticed.","zh":"秘密地；隐蔽地（尤指为了不被发现）。"},"examples":[{"en":"They covertly recorded the conversation.","zh":"他们秘密录下了那段对话。"},{"en":"The company covertly collected users’ location data.","zh":"这家公司暗中收集了用户的定位数据。"},{"en":"She covertly slipped the note into his bag.","zh":"她悄悄把纸条塞进了他的包里。"}]}],"synonyms":["secretly","quietly","stealthily","surreptitiously"],"phonetic":"/koʊˈvɝːtli/","extraExplanation":["“covertly”常带有“刻意隐藏、避免暴露”的语气，常见于新闻报道或正式写作中（如：covert operations 秘密行动；covert surveillance 秘密监视）。","与之相近的词：secretly（秘密地，语气更中性）、stealthily（鬼鬼祟祟/悄无声息地，强调动作轻巧不被察觉）、undercover（卧底地/暗中进行，常与执法或调查相关）。","词源上，covert 与 cover（覆盖）同源，核心意象是“被遮住、看不见”。"]}
{"word":"covertness","summary":{"en":"Covertness means the state or quality of being hidden or secret.","zh":"covertness 指“隐蔽性、秘密性”，强调不公开、不易被察觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being hidden, secret, or not openly shown or acknowledged.","zh":"隐蔽性；秘密性；不公开、不显露的特质"},"examples":[{"en":"The operation depended on covertness to avoid public attention.","zh":"这次行动依靠隐蔽性来避免公众注意。"},{"en":"There was a sense of covertness in the way they exchanged messages.","zh":"他们交换信息的方式带着一种隐秘感。"},{"en":"In some workplaces, covertness about pay can cause mistrust.","zh":"在一些职场里，对薪资的遮掩可能会引发不信任。"}]}],"synonyms":["secrecy","concealment","hiddenness","clandestineness"],"phonetic":"/ˈkoʊvərtnəs/","extraExplanation":["“covertness”来自形容词“covert”（秘密的、隐蔽的），常见于“covert operation（秘密行动）”“covert surveillance（秘密监视）”等搭配。","与“secrecy（保密、秘密状态）”相比，“covertness”更强调“隐藏在表面之下、不易被察觉”的特征；与“privacy（隐私）”不同，它不一定带有正当或个人权利的意味，有时语气偏中性或略带负面。","相关词：covert（adj. 隐蔽的）；overt（adj. 公开的，常作反义词）；covertly（adv. 秘密地）。"]}
{"word":"coverts","summary":{"en":"“Coverts” is the plural of “covert,” meaning hidden shelters (especially in nature), and “covert” also means secret or concealed.","zh":"“coverts”是“covert”的复数，常指（自然中）隐蔽的藏身处；“covert”也可作形容词，表示“秘密的/隐蔽的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Secret, hidden, or not openly acknowledged.","zh":"秘密的；隐蔽的；不公开承认的"},"examples":[{"en":"They carried out a covert investigation to protect the witnesses.","zh":"他们进行了秘密调查，以保护证人。"},{"en":"The article mentioned covert support for the group.","zh":"文章提到对该组织的暗中支持。"}]},{"partOfSpeech":"n.","definition":{"en":"A hidden shelter or thicket where animals (or people) can hide; a place of concealment.","zh":"（动物或人）藏身处；隐蔽的灌木丛/栖身处"},"examples":[{"en":"The deer disappeared into the covert at the edge of the woods.","zh":"那只鹿消失在林边的灌木藏身处里。"},{"en":"Birds nest in dense coverts to stay safe from predators.","zh":"鸟类会在浓密的隐蔽处筑巢，以躲避天敌。"}]}],"synonyms":["secret","hidden","clandestine","undercover","concealed","hiding place","thicket"],"phonetic":"/ˈkoʊvɚt/","extraExplanation":["“coverts”通常是名词复数，指多个“藏身处/隐蔽处”；在军事或情报语境里更常见的是形容词用法，如“covert operations（秘密行动）”。","注意读音：covert 在美式英语里常读作 /ˈkoʊvɚt/（重音在前）。"]}
{"word":"coverture","summary":{"en":"Coverture is a historical legal doctrine in which a married woman’s legal rights and property were largely absorbed into her husband’s.","zh":"Coverture 指一种历史上的法律原则：已婚妇女的法律权利与财产在很大程度上被视为由丈夫掌控或“合并”于丈夫之下。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Law, historical) The legal status of a married woman in which her rights and property were controlled by her husband; she had limited independent legal identity.","zh":"（法律，历史用语）“夫权制/婚姻覆盖原则”：已婚妇女在法律上被视为由丈夫“代表”，其财产权与许多法律权利受丈夫控制，独立法律人格受到限制。"},"examples":[{"en":"Under coverture, a married woman often could not own property in her own name.","zh":"在“夫权制”下，已婚妇女往往不能以自己的名义拥有财产。"},{"en":"Many reforms in the 1800s weakened coverture by giving married women more property rights.","zh":"19世纪的许多改革通过赋予已婚妇女更多财产权来削弱“夫权制”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A covering or shelter; the act or state of being covered.","zh":"（罕见）覆盖物；遮蔽、庇护；被覆盖的状态。"},"examples":[{"en":"The old text uses coverture to mean a protective covering.","zh":"那本旧文献里用 coverture 表示“保护性的覆盖”。"}]}],"synonyms":["marital unity (historical)","legal disability (historical)","covering (rare)"],"phonetic":"/ˈkʌvɚtʃɚ/","extraExplanation":["“Coverture”常出现在英美法史、女性史与文学讨论中（尤其是18—19世纪背景的作品）。它与“feme covert”（受丈夫覆盖的已婚妇女）相对，“feme sole”指法律上相对独立的女性（如未婚或某些情况下的寡妇）。","它并不只是“结婚”本身，而是指一种具体的法律安排：婚后女性的财产、签约、诉讼等能力可能被限制。不同地区与不同时期的具体规则并不完全相同。"]}
{"word":"coverup","summary":{"en":"Cover-up means hiding the truth about something wrong or embarrassing; it can be a noun (the act) or a verb (to hide it).","zh":"Cover-up 指掩盖错误、罪行或尴尬真相；可作名词（掩盖行为）或动词（掩盖）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an attempt to hide a mistake, crime, or embarrassing truth so that people won’t find out","zh":"（为避免被发现而）掩盖错误、罪行或尴尬真相的行为；隐瞒"},"examples":[{"en":"The report said the company’s apology was part of a cover-up.","zh":"报告称这家公司的道歉是掩盖真相的一部分。"},{"en":"Police investigated whether there was a cover-up after the accident.","zh":"事故发生后，警方调查是否有人试图掩盖真相。"},{"en":"People lost trust when the cover-up became public.","zh":"掩盖行为曝光后，人们失去了信任。"}]},{"partOfSpeech":"vt.","definition":{"en":"to hide or try to hide the truth about something bad or embarrassing","zh":"掩盖（坏事或尴尬之事）的真相；试图隐瞒"},"examples":[{"en":"They tried to cover up the error instead of fixing it.","zh":"他们试图掩盖错误，而不是去修正它。"},{"en":"He covered up what happened because he was afraid.","zh":"他因为害怕而掩盖了发生的事。"}]}],"synonyms":["concealment","hide","conceal","whitewash","sweep under the rug"],"phonetic":"/ˈkʌvərˌʌp/","extraExplanation":["拼写上常见两种：名词更常写作 cover-up（尤其指“丑闻中的掩盖/隐瞒”），动词短语通常写作 cover up。新闻报道里常见搭配：a cover-up scandal（掩盖丑闻）、alleged cover-up（被指称的掩盖行为）。","语气上，cover up 往往带有强烈的负面含义，暗示“故意隐瞒、误导他人”，比 hide 更强调“不让公众或相关人员知道”。"]}
{"word":"coverups","summary":{"en":"Coverups are either (1) attempts to hide the truth (cover-ups) or (2) garments worn to cover the body, especially over a swimsuit.","zh":"coverups 可指（1）掩盖真相的行为（cover-ups），也可指（2）遮盖身体的衣物，尤指泳装外搭。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Attempts to hide a mistake, wrongdoing, or embarrassing fact; acts of concealing the truth.","zh":"掩盖（错误、不当行为或令人尴尬事实）的行为；隐瞒真相。"},"examples":[{"en":"The investigation revealed a cover-up after the accident.","zh":"调查揭露了事故发生后的掩盖行为。"},{"en":"She refused to take part in a cover-up at work.","zh":"她拒绝参与公司里的掩盖行为。"},{"en":"Journalists reported possible cover-ups by officials.","zh":"记者报道称官员可能进行了掩盖。"}]},{"partOfSpeech":"n.","definition":{"en":"Clothing or an item used to cover the body, especially worn over a swimsuit (often written as “cover-up”).","zh":"罩衫/外搭等遮盖身体的衣物，尤指泳装外穿的罩衫（常写作 cover-up）。"},"examples":[{"en":"She wore a light cover-up over her swimsuit.","zh":"她在泳装外面穿了一件轻薄的罩衫。"},{"en":"Bring a cover-up if you plan to walk around the hotel.","zh":"如果你打算在酒店里走动，带一件外搭比较方便。"}]}],"synonyms":["concealments","suppression","whitewash","camouflage","wraps","sarongs","robes"],"phonetic":"/ˈkʌvərˌʌps/","extraExplanation":["“cover-up”的复数是“cover-ups”，你写的“coverups”属于不加连字符的写法，也很常见（尤其在非正式文本中）。","在“掩盖”这个含义里，cover-up 常出现在新闻、政治或职场语境，语气偏负面，强调有人刻意隐瞒或误导。"]}
{"word":"covery","summary":{"en":"A rare/old word meaning a covering or a sheltered place (like “cover”).","zh":"一个罕见/古旧词，意为“覆盖物”或“遮蔽处”（类似 cover）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/archaic) A covering; something that covers or protects.","zh":"（罕见/古义）覆盖物；用来遮盖或保护的东西。"},"examples":[{"en":"The old book had a leather covery to protect it from dust.","zh":"那本旧书有一个皮革封套（covery），用来防尘。"},{"en":"They sought covery from the rain beneath the porch.","zh":"他们在门廊下躲雨，寻求遮蔽（covery）。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare/archaic, hunting) A sheltered place where animals hide; a cover.","zh":"（罕见/古义，狩猎）动物藏身的隐蔽处；掩蔽处。"},"examples":[{"en":"The deer stayed close to the covery at the edge of the woods.","zh":"鹿待在森林边缘的隐蔽处（covery）附近。"},{"en":"The hunters waited quietly near the covery.","zh":"猎人们在隐蔽处（covery）附近安静地等待。"}]}],"synonyms":["cover","covering","shelter","concealment"],"phonetic":"/ˈkʌvəri/","extraExplanation":["“covery”在现代英语里非常少见，多数情况下人们会用更常见的“cover”（遮盖物/掩蔽处）或“covering”（覆盖物）。","学习与写作中若看到“covery”，要留意语境：可能是古文/诗歌用法，也可能是把“recovery”（恢复、复苏）拼错了。"]}
{"word":"coves","summary":{"en":"“Coves” is the plural of “cove,” meaning small sheltered bays (and sometimes small nook-like spaces).","zh":"“coves”是“cove”的复数，指较小、受遮蔽的海湾（有时也指隐蔽的小角落）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of cove: small sheltered bays along a coast, often partly enclosed by rocks or cliffs","zh":"cove 的复数：海岸边较小、受遮蔽的海湾，常被岩石或悬崖部分环绕"},"examples":[{"en":"The kayakers explored hidden coves along the shoreline.","zh":"划皮艇的人沿着海岸探索隐蔽的小海湾。"},{"en":"We stopped at a quiet cove to swim and eat lunch.","zh":"我们在一个安静的小海湾停下来游泳、吃午饭。"},{"en":"From the cliff, you can see several coves with clear blue water.","zh":"从悬崖上你能看到好几个水清澈湛蓝的小海湾。"}]},{"partOfSpeech":"n.","definition":{"en":"(also plural of cove) small sheltered inlets or nook-like spaces, not necessarily by the sea","zh":"（也可作 cove 的复数）较隐蔽的小凹处/角落，不一定在海边"},"examples":[{"en":"The library has little coves for quiet reading.","zh":"这座图书馆有一些适合安静阅读的小角落。"},{"en":"They set up a chair in a cove beside the fireplace.","zh":"他们在壁炉旁的一个小角落放了一把椅子。"}]}],"synonyms":["bays","inlets","small bays","nooks","alcoves"],"phonetic":"/koʊv/","extraExplanation":["“cove”在日常英语里最常见的意思是“（被遮蔽的）小海湾”。旅游介绍、地理描写和海边活动（如浮潜、划船）中非常常见。","发音上注意结尾是/v/音：cove /koʊv/，复数 coves 读作 /koʊvz/（虽然本条只给一个音标）。","相关搭配：hidden cove（隐蔽海湾）、sheltered cove（避风小海湾）、sea cove（海湾/海蚀湾）。文学或风景描写中常用来营造“安静、隐秘、与世隔绝”的氛围。"]}
{"word":"Covesville","summary":{"en":"Covesville is a place name: a small community in Albemarle County, Virginia.","zh":"Covesville 是地名：美国弗吉尼亚州阿尔伯马尔县的一个小社区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small unincorporated community in Albemarle County, Virginia, United States.","zh":"美国弗吉尼亚州阿尔伯马尔县的一个小型非建制社区（地名）。"},"examples":[{"en":"She grew up near Covesville, Virginia, before moving to Richmond.","zh":"她在弗吉尼亚州的科夫斯维尔（Covesville）附近长大，后来搬去了里士满。"},{"en":"We passed through Covesville on the drive south from Charlottesville.","zh":"我们从夏洛茨维尔向南开车时路过了科夫斯维尔。"}]}],"synonyms":["(none; proper place name)"],"phonetic":"/ˈkoʊvzˌvɪl/","extraExplanation":["“Covesville”是专有名词（地名），在英文里通常不加冠词：说“in Covesville / near Covesville”，而不是“in the Covesville”。","它不是常用词汇，更多出现在地址、旅游路线、新闻或个人经历叙述中；写作时可补充州名“Virginia”帮助读者定位。"]}
{"word":"covet","summary":{"en":"“Covet” means to strongly desire something, often something that belongs to someone else, with a sense of wanting to possess it.","zh":"“covet”指强烈渴望某物，常指觊觎他人之物，带有想占为己有的意味。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to strongly desire something, especially something that belongs to someone else","zh":"（尤指对他人的东西）垂涎；觊觎；非常渴望"},"examples":[{"en":"He covets his neighbor’s new car.","zh":"他很眼馋邻居的新车。"},{"en":"It’s normal to admire success, but don’t covet what others have.","zh":"欣赏成功很正常，但别去觊觎别人的东西。"},{"en":"She covets a quieter life in the countryside.","zh":"她非常向往更安静的乡村生活。"}]}],"synonyms":["desire","crave","envy","yearn for","long for"],"phonetic":"/ˈkʌvɪt/","extraExplanation":["“covet”常带有道德或情感色彩，暗示一种不恰当的、带占有欲的渴望，尤其是对不属于自己的东西。","它在《圣经》中很常见，比如“Thou shalt not covet”（不可贪恋/不可贪图），因此在英语里也常与“贪心、占有欲、嫉妒”这类主题相连。","常见搭配：covet someone’s job/house/reputation（觊觎别人的工作/房子/名声）；covet attention（渴望关注）；covet a prize/award（渴望奖项）。"]}
{"word":"covetable","summary":{"en":"Covetable means highly wanted because it seems valuable, attractive, or prestigious.","zh":"Covetable 指“非常抢手、令人垂涎”的，因为它看起来有价值、有吸引力或有声望。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Strongly desired because it is attractive, valuable, rare, or brings status.","zh":"令人垂涎的；人人想要的（因其有吸引力、价值高、稀有或能带来地位）。"},"examples":[{"en":"That company has a covetable reputation for great customer service.","zh":"那家公司在优质客服方面享有令人羡慕的口碑。"},{"en":"She landed a covetable internship at a top tech firm.","zh":"她拿到了一家顶尖科技公司的热门实习机会。"},{"en":"The neighborhood is covetable because it’s safe, quiet, and close to good schools.","zh":"这个社区很抢手，因为它安全、安静，而且离好学校很近。"}]}],"synonyms":["desirable","highly sought-after","prized","in-demand","much-wanted"],"phonetic":"/ˈkʌvɪtəbəl/","extraExplanation":["“covetable”来自动词“covet”（渴望得到，常带有“羡慕甚至不该贪求”的意味）。因此它常用于描述别人也很想要的东西，比如工作机会、房子、名声、客户名单等。","语气上，“covetable”比“desirable”更强调“让人眼红、抢手”，在商业与媒体报道中很常见。也常见搭配：covetable job/title/position, covetable address, covetable prize, covetable collection.","在一些文化或宗教语境里，“covet”与“贪念/觊觎”有关（例如《十诫》中“不可贪恋…”），但日常使用“covetable”多为中性，强调受欢迎与稀缺。"]}
{"word":"coveted","summary":{"en":"“Coveted” describes something that many people really want because it is valuable, rare, or prestigious.","zh":"“coveted”指某物因珍贵、稀缺或有声望而“备受渴望/受追捧”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"strongly desired or greatly wanted by many people, often because it is rare, valuable, or brings status","zh":"备受渴望的；人人想要的（常因稀有、有价值或带来身份地位）"},"examples":[{"en":"She finally got a coveted spot at a top university.","zh":"她终于拿到了顶尖大学一个人人想要的名额。"},{"en":"The restaurant earned a coveted Michelin star.","zh":"这家餐厅获得了一颗令人梦寐以求的米其林星。"},{"en":"That neighborhood is one of the city’s most coveted areas to live in.","zh":"那个社区是这座城市最受追捧的居住区域之一。"}]}],"synonyms":["desired","sought-after","prized","highly valued"],"phonetic":"/ˈkʌvɪtɪd/","extraExplanation":["“coveted”来自动词“covet”（渴望得到），语气通常比“want”更强，常暗示“非常想要、带点羡慕甚至不太光明正大地想占有”。日常写作里多用来形容名额、职位、奖项、资源等“稀缺且有吸引力”的东西。","常见搭配：coveted prize（梦寐以求的奖项）、coveted position（抢手的职位）、coveted title（令人向往的头衔）、highly coveted（极其抢手/备受追捧）。"]}
{"word":"coveter","summary":{"en":"A coveter is a person who strongly desires something, often something that belongs to someone else.","zh":"coveter 指强烈渴望某物的人，常含“觊觎他人之物”的负面意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who strongly desires (especially something that belongs to someone else); someone who covets","zh":"觊觎者；垂涎者（尤其指想得到属于他人的东西的人）"},"examples":[{"en":"A coveter of other people’s success often forgets to build their own skills.","zh":"总是觊觎别人成功的人，常常会忘了提升自己的能力。"},{"en":"He wasn’t a thief, but he was a coveter of anything expensive.","zh":"他不是小偷，但对任何昂贵的东西都很垂涎。"}]}],"synonyms":["envier","desirer","craver","one who covets"],"phonetic":"/ˈkʌvədər/","extraExplanation":["“coveter”来自动词“covet”（渴望、觊觎）。在英文里更常用的是动词“covet”，名词“coveter”相对少见，写作时也可用“someone who covets…”来表达。","这个词常带有负面色彩，暗示“贪念/不该有的欲望”，尤其是对他人所有物、地位或关系的渴望。"]}
{"word":"coveters","summary":{"en":"“Coveters” are people who envy and strongly want to possess something that belongs to someone else.","zh":"“coveters”指那些觊觎他人之物、眼红并想占有的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who strongly desire something that belongs to someone else; people who envy and want to possess it","zh":"觊觎者；贪恋他人之物的人；眼红并想占有的人"},"examples":[{"en":"Jealous coveters spread rumors because they want what others have.","zh":"嫉妒的觊觎者会散布谣言，因为他们想要别人拥有的东西。"},{"en":"Online coveters may copy someone’s style, job, or lifestyle instead of building their own path.","zh":"网络上的觊觎者可能会照搬别人的风格、工作或生活方式，而不是走出自己的路。"}]}],"synonyms":["envyers","the jealous","would-be possessors","greedy people"],"phonetic":"/ˈkʌvɪtərz/","extraExplanation":["“covet”带有明显的道德评判色彩：不只是“很想要”，而是“想要别人拥有的东西”，常与嫉妒、贪念相关。","在宗教与文学语境中常出现，例如《圣经》十诫里有“不可贪恋”（do not covet），因此“coveter(s)”在正式语体里常带“贪恋他人之物的人”的批评意味。","和普通的“want/desire”不同：want/desire 可以是中性；covet 往往暗示不恰当、越界或不道德的渴望。"]}
{"word":"coveting","summary":{"en":"Coveting means strongly wanting something, often something that belongs to someone else, sometimes with envy.","zh":"coveting 指强烈想要某物，常指觊觎他人之物，可能带嫉妒意味。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Wanting something strongly, especially something that belongs to someone else (often with envy).","zh":"（尤指对他人之物）非常想要、觊觎；常带嫉妒意味。"},"examples":[{"en":"He was coveting his neighbor’s new car.","zh":"他在觊觎邻居的新车。"},{"en":"She caught herself coveting her friend’s promotion.","zh":"她发现自己在羡慕并渴望朋友的升职。"}]},{"partOfSpeech":"v.","definition":{"en":"Feeling a strong desire for something (not necessarily owned by others).","zh":"强烈渴望某物（不一定是别人的）。"},"examples":[{"en":"Many students are coveting a chance to study abroad.","zh":"许多学生渴望有机会出国留学。"},{"en":"The team is coveting a spot in the finals.","zh":"这支队伍渴望拿到决赛席位。"}]},{"partOfSpeech":"adj.","definition":{"en":"Strongly wanting something, especially something someone else has (present participle used as an adjective).","zh":"（作形容词）觊觎的；垂涎的（尤指对他人之物）。"},"examples":[{"en":"He gave a coveting look at the limited-edition sneakers.","zh":"他对那双限量球鞋投去垂涎的目光。"}]}],"synonyms":["desiring","craving","yearning for","envying","wanting"],"phonetic":"/ˈkʌvɪtɪŋ/","extraExplanation":["“covet”在英语里常带有道德评判色彩：不仅是“想要”，还暗含“想要别人拥有的东西”。在《圣经·十诫》中有“Thou shalt not covet”（不可贪恋/不可贪图他人之物），因此在正式或文学语境里，“covet”比“want”更强烈，也更容易让人联想到“贪念/觊觎”。","常见搭配：covet + 名词（covet a job/position/opportunity）；covet + someone’s + 名词（covet someone’s success/house）。","相关词对比：desire（中性“渴望”） vs. envy（“嫉妒”，更强调情绪） vs. covet（“觊觎/贪恋”，更强调想占有，常指别人拥有的）。"]}
{"word":"covetingly","summary":{"en":"“Covetingly” means “in a way that shows a strong, often jealous desire for something (especially someone else’s).”","zh":"“covetingly”表示“以强烈、常带嫉妒的渴望方式（尤指觊觎他人的东西）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that shows a strong (often unhealthy or jealous) desire for something, especially something that belongs to someone else.","zh":"以一种强烈（常带不健康或嫉妒色彩）的渴望方式，尤指渴望别人的东西。"},"examples":[{"en":"He looked covetingly at his coworker’s new phone.","zh":"他眼巴巴地看着同事的新手机，满是觊觎。"},{"en":"She spoke covetingly about her friend’s promotion.","zh":"她谈起朋友的升职时语气里带着羡慕又有点觊觎。"},{"en":"The child stared covetingly at the cake on the table.","zh":"孩子直勾勾地盯着桌上的蛋糕，特别想要。"}]}],"synonyms":["covetously","enviously","greedily"],"phonetic":"ˈkʌvɪtɪŋli","extraExplanation":["“covetingly”在现代英语里比较少见，更常用的副词是“covetously”。两者意思基本相同。","“covet”在英美文化中常带道德意味，常见于《圣经》十诫里的“Thou shalt not covet”（不可贪恋/不可觊觎），所以“covetingly”也常暗示不该有的欲望。"]}
{"word":"covetise","summary":{"en":"Covetise is an archaic noun meaning greedy desire for what others have.","zh":"covetise 是较古老的名词，指贪求他人之物的欲望（贪婪）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an old-fashioned word meaning strong desire for something that belongs to someone else; greed (especially for money or possessions)","zh":"（古语/旧式用法）贪求他人之物的强烈欲望；贪婪（尤指对金钱或财物）"},"examples":[{"en":"His covetise made him unhappy even when he had enough.","zh":"他的贪欲让他即使拥有足够的东西也不快乐。"},{"en":"The story warns that covetise can destroy trust between friends.","zh":"这个故事警告说，贪欲会破坏朋友之间的信任。"}]}],"synonyms":["greed","covetousness","avarice"],"phonetic":"/ˈkʌvətɪs/","extraExplanation":["“covetise”在现代英语中很少用，更常见的是“covetousness（贪婪/贪求）”或“greed（贪婪）”。","它与动词“covet（觊觎、贪求）”同源，常带有道德批评色彩：想要不属于自己的东西。","在宗教/古典文本语境里更常见（例如谈到“coveting”这一禁戒），现代写作通常会改用更常用词。"]}
{"word":"covetiveness","summary":{"en":"“Covetiveness” means an intense desire to possess what others have, often implying greed or envy.","zh":"“covetiveness”指对他人之物的强烈占有欲，常含贪婪或嫉羡之意。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strong, often unhealthy desire to possess something that belongs to someone else; greed or envy about another person’s belongings, success, or advantages.","zh":"对他人拥有之物的强烈（常带不健康色彩的）占有欲；对别人的财物、成就或优势的贪求与嫉羡。"},"examples":[{"en":"His covetiveness over his coworker’s promotion damaged their relationship.","zh":"他对同事升职的觊觎与嫉羡伤害了他们的关系。"},{"en":"The story warns that covetiveness can lead people to betray their values.","zh":"这个故事警示：贪求与觊觎可能让人背弃自己的价值观。"}]}],"synonyms":["covetousness","greed","envy","desire","acquisitiveness"],"phonetic":"/ˈkʌvɪtɪvnəs/","extraExplanation":["“covetiveness”来自动词“to covet”（渴望占有、觊觎）+ 名词后缀“-ness”（表示性质/状态）。更常见的名词是“covetousness”。两者意思相近，但“covetousness”更常用于正式写作与宗教/道德语境。","“covet”在英语里常带道德评判色彩：不是单纯“想要”，而是“想占有本不属于自己的东西”。在《圣经》十诫中有“Thou shalt not covet …”（不可贪恋/不可觊觎），因此该词常与“贪婪、嫉妒、道德诱惑”等主题相关。"]}
{"word":"covetous","summary":{"en":"Covetous describes a greedy or improper desire for something someone else has.","zh":"Covetous 指对他人拥有之物的贪图与觊觎，常带有不当或贪婪的意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Wanting something that belongs to someone else, often in a way that feels greedy or improper.","zh":"觊觎他人的东西；贪图（通常带有不正当或贪婪的意味）。"},"examples":[{"en":"He gave a covetous look at his friend’s new phone.","zh":"他用一种觊觎的眼神看着朋友的新手机。"},{"en":"Try not to be covetous of other people’s success; focus on your own progress.","zh":"别总觊觎别人的成功；把注意力放在自己的进步上。"},{"en":"She felt covetous when she saw her neighbor’s beautiful garden.","zh":"她看到邻居漂亮的花园时，心里有点眼红。"}]}],"synonyms":["envious","jealous","greedy","grasping"],"phonetic":"/ˈkʌvətəs/","extraExplanation":["“covetous”常带有道德评判色彩，意思不仅是“很想要”，还暗示这种想要可能不太正当或过度贪婪。日常口语里更常用“jealous / envious / greedy”来表达类似意思；“covetous”更正式、更书面。","文化/文学背景：在《圣经》（十诫）中有“Thou shalt not covet”（不可贪恋/不可觊觎），指不要贪图邻人的房屋、配偶或财物，因此这个词常与“贪念、欲望、道德约束”联系在一起。","词形提示：动词是“covet”（渴望得到，尤指别人拥有的东西）；名词可用“covetousness”（贪恋、觊觎）。"]}
{"word":"covetously","summary":{"en":"“Covetously” means “in a way that shows greedy or envious desire for something that belongs to someone else.”","zh":"“covetously”表示“以贪求、觊觎的方式”，指对他人所有之物表现出强烈而常带嫉妒的渴望。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that shows you strongly want something that belongs to someone else (often with envy).","zh":"以贪求、觊觎的方式（常带有嫉妒意味地想要别人的东西）。"},"examples":[{"en":"He looked covetously at his neighbor’s new car.","zh":"他贪婪地看着邻居的新车。"},{"en":"She spoke covetously about her friend’s promotion.","zh":"她带着觊觎（酸酸的）语气谈起朋友的升职。"},{"en":"Don’t stare covetously at other people’s food.","zh":"别贪嘴似的盯着别人的食物看。"}]}],"synonyms":["greedily","enviously","longingly"],"phonetic":"/ˈkʌvɪtəsli/","extraExplanation":["“covetously”来自动词“covet”（觊觎、贪求），常用于道德或宗教语境，强调“想要不属于自己的东西”这一点。例如《圣经》十诫里有“不可贪恋（covet）你邻舍的…”的说法，因此这个词常带有“并不正当/不应当”的评价色彩。","语气对比：仅仅“want”是中性；“desire”更正式；“envy”强调嫉妒别人的拥有；“covet”强调强烈想占有，尤其是别人的东西。"]}
{"word":"covetousness","summary":{"en":"Covetousness means an intense, morally disapproved desire for what someone else has.","zh":"Covetousness 指对他人之物强烈而常被视为不道德的觊觎与贪求。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strong, sometimes unhealthy desire for something that belongs to someone else; greed or envy focused on another person’s possessions or advantages.","zh":"对他人所有之物（财物、地位、机会等）的强烈渴望；带有贪婪或嫉妒色彩的觊觎之心。"},"examples":[{"en":"His covetousness made him resent his friend’s success instead of celebrating it.","zh":"他的觊觎与嫉妒让他对朋友的成功心生怨气，而不是为对方开心。"},{"en":"The novel shows how covetousness can poison family relationships.","zh":"这部小说展现了觊觎之心如何毒化家庭关系。"},{"en":"She tried to let go of covetousness and feel gratitude for what she had.","zh":"她努力放下觊觎之心，转而对自己拥有的东西心怀感恩。"}]}],"synonyms":["greed","envy","avarice","cupidity","desire","want"],"phonetic":"/ˈkʌvətəsnəs/","extraExplanation":["“covetousness”常见于宗教或道德语境，尤其与《圣经》“不可贪恋”（You shall not covet）相关，强调对“属于他人之物”的不当欲望，而不只是一般的“想要”。","词根来自“covet”（渴望、觊觎）+ “-ous”（多……的）+ “-ness”（名词后缀）。日常英语里更常用“greed”（贪婪）或“envy”（嫉妒）；“covetousness”更正式、带道德批评意味。"]}
{"word":"covets","summary":{"en":"“Covets” means “strongly wants something that belongs to someone else,” often with jealousy.","zh":"“covets”指“强烈渴望得到属于别人的东西”，常带嫉妒或不健康的占有欲。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to strongly want something that belongs to someone else (often in an unhealthy or jealous way)","zh":"渴望（尤指不健康或带嫉妒地）得到属于别人的东西"},"examples":[{"en":"He covets his neighbor’s new car.","zh":"他觊觎邻居的新车。"},{"en":"She covets her coworker’s position at the company.","zh":"她觊觎同事在公司的职位。"},{"en":"Don’t covet what others have; focus on what you can build.","zh":"别觊觎他人所拥有的；专注于你能创造的东西。"}]}],"synonyms":["desire","crave","envy","begrudge","yearn for"],"phonetic":"/ˈkʌvɪts/","extraExplanation":["“covet”常带有道德或负面评价，强调对“别人拥有的东西”的强烈占有欲，语气比“want”更重、更不健康。","在英语文化中它常出现在《圣经》“Ten Commandments（十诫）”里：You shall not covet.（不可贪恋/不可觊觎。）因此在正式或文学语境里更常见。"]}
{"word":"covey","summary":{"en":"A covey is a small group of birds (especially quail), and by extension a small group of people.","zh":"covey 指（尤指鹌鹑等）一小群鸟，也可引申为一小群人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small group of birds, especially quail or partridges, seen together on the ground or flying up as a group","zh":"（尤指鹌鹑、山鹑等）一小群鸟；（常一起在地面活动或突然成群飞起）"},"examples":[{"en":"A covey of quail burst out of the grass when we walked by.","zh":"我们走过时，一群鹌鹑从草丛里突然飞起。"},{"en":"The hunter waited quietly as a covey moved through the field.","zh":"猎人安静地等着那群鸟穿过田地。"}]},{"partOfSpeech":"n.","definition":{"en":"a small group of people, often viewed as a set or cluster","zh":"（常指一组、成串的）一小群人"},"examples":[{"en":"A covey of reporters gathered outside the courthouse.","zh":"一群记者聚集在法院外。"},{"en":"She arrived with a covey of friends from work.","zh":"她和一群公司的朋友一起来了。"}]}],"synonyms":["flock","group","cluster","bunch"],"phonetic":"/ˈkʌvi/","extraExplanation":["“covey”常见于英美关于狩猎与乡村自然的语境，尤其指“鹌鹑的一群”。在文学或新闻写作里，它也会被借用来形容“一群人”，带一点形象化、略带修辞的感觉。"]}
{"word":"coveys","summary":{"en":"“Coveys” means groups of birds (especially quail), or figuratively, small groups of people.","zh":"“Coveys”指（尤指鹌鹑等的）几群鸟；也可比喻为一小群人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of covey: a small flock of birds (especially quail or partridge) that stay together.","zh":"covey 的复数：一小群成群活动的鸟（尤指鹌鹑或山鹑等）。"},"examples":[{"en":"We surprised a covey of quail in the tall grass.","zh":"我们在高草丛里惊起了一群鹌鹑。"},{"en":"At dawn, several coveys moved across the field.","zh":"黎明时，几群鸟穿过了田野。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) a small group of people, often with a shared purpose or identity.","zh":"（比喻）一小群人，常指有共同目的或身份的一伙人。"},"examples":[{"en":"A covey of reporters waited outside the courthouse.","zh":"一群记者守在法院外面等候。"},{"en":"A covey of interns gathered around the manager for instructions.","zh":"一群实习生围在经理身边听安排。"}]}],"synonyms":["flocks","groups","bands","clusters"],"phonetic":"/ˈkʌviz/","extraExplanation":["“covey”最常见于英美文学或自然写作里，带有一种“鸟群贴近地面、一起行动”的画面感；用来形容人群时，语气往往略带观察者的笔触，有时也会带一点轻微的讽刺或调侃。","“coveys”是复数形式：one covey（一群），two coveys（两群）。如果要表达“很多群”，更自然的说法通常是“several coveys / many coveys”。"]}
{"word":"covibrate","summary":{"en":"“Covibrate” means to vibrate or resonate together, or figuratively to be emotionally in sync.","zh":"“Covibrate”指与他物一起振动/共振，也可比喻为情绪或想法上同频、合拍。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to vibrate together with something else; to resonate in the same rhythm or frequency (often used in technical or poetic contexts).","zh":"与另一事物一起振动；在同一节奏或频率上共振（多用于技术或诗意语境）。"},"examples":[{"en":"When the bass hits, the floor and the windows can covibrate.","zh":"当低音响起时，地板和窗户可能会一起振动。"},{"en":"The two strings begin to covibrate, creating a richer sound.","zh":"两根弦开始共振，产生更饱满的声音。"},{"en":"In a team with good chemistry, people’s energy can covibrate.","zh":"在默契很好的团队里，人们的能量会同频共振。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative) to feel aligned emotionally with someone or something; to “be on the same wavelength.”","zh":"（比喻）在情绪或想法上与某人/某事一致；“同频”“同一频道”。"},"examples":[{"en":"I covibrate with the message of the film.","zh":"我很能与这部电影的主题产生共鸣。"},{"en":"She covibrates with people who value honesty.","zh":"她更容易和重视诚实的人合拍。"}]}],"synonyms":["resonate","vibrate together","oscillate in sync","be in sync","be on the same wavelength"],"phonetic":"/ˌkoʊˈvaɪbreɪt/","extraExplanation":["“covibrate”不是非常常见的标准词，更像是由前缀 co-（一起、共同）+ vibrate（振动）组合出来的创新用法。学术写作中更常见的表达是 “vibrate together”“resonate”“oscillate in sync”。","在物理/声学语境里，它强调“同步振动/共振”；在身心灵或日常比喻里，常用来表达“同频、共鸣、合拍”。正式场合使用时，建议根据读者选择更常见的词（如 resonate）。"]}
{"word":"covibration","summary":{"en":"Covibration means two parts or systems vibrating together, often because they are coupled and affect each other.","zh":"covibration 指两个部件或系统因耦合而一起振动，并相互影响。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a vibration that happens together with another vibration, often because two parts or systems are mechanically linked (coupled) and influence each other","zh":"与另一种振动同时发生的振动；常因两个部件/系统相互连接（耦合）而彼此影响"},"examples":[{"en":"Engine covibration can make the dashboard shake at certain speeds.","zh":"发动机的共振动可能会让仪表盘在某些车速下发抖。"},{"en":"The test checks whether covibration between the motor and the frame increases noise.","zh":"该测试检查电机与机架之间的共振动是否会增加噪音。"}]}],"synonyms":["coupled vibration","co-vibration","mutual vibration","vibration coupling"],"phonetic":"/ˌkoʊvaɪˈbreɪʃən/","extraExplanation":["“covibration”不是日常英语中的常用词，更常见的表达是“coupled vibration（耦合振动）”“co-vibration（共振动/共同振动）”或根据语境直接说“vibrate together（一起振动）”。","在工程/物理语境里，这个词通常强调“两个振动相互影响”，可能导致噪声、疲劳损伤或共振放大等问题。","书面或技术写作中有时会用连字符写作“co-vibration”。查资料或检索论文时，建议同时搜索这几种写法以提高命中率。"]}
{"word":"Covid","summary":{"en":"COVID is a contagious illness caused by SARS‑CoV‑2; it can also refer to the COVID‑19 pandemic period.","zh":"COVID指由SARS‑CoV‑2引起的传染病，也可指新冠疫情时期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an infectious disease caused by the coronavirus SARS‑CoV‑2, often affecting the respiratory system","zh":"由新冠病毒（SARS‑CoV‑2）引起的传染病，常影响呼吸系统"},"examples":[{"en":"She got COVID last week and had a fever and cough.","zh":"她上周得了新冠，发烧还咳嗽。"},{"en":"Older adults may be at higher risk of severe COVID.","zh":"老年人发生重症新冠的风险可能更高。"},{"en":"He tested positive for COVID, so he stayed home to rest.","zh":"他新冠检测呈阳性，所以在家休息。"}]},{"partOfSpeech":"n.","definition":{"en":"the global outbreak and related public-health period beginning in 2019 (often: the COVID pandemic)","zh":"2019年开始的全球暴发及相关公共卫生时期（常说：新冠疫情）"},"examples":[{"en":"Many classes moved online during the COVID pandemic.","zh":"在新冠疫情期间，很多课程转到线上。"},{"en":"Travel rules changed a lot during COVID.","zh":"新冠疫情期间，旅行规定变化很大。"}]}],"synonyms":["COVID-19","coronavirus disease","the COVID pandemic"],"phonetic":"/ˈkoʊvɪd/","extraExplanation":["“COVID”是“Coronavirus Disease 2019”的缩写，常写作COVID或COVID‑19，口语里也有人说“Covid”。","更正式的说法常用“COVID‑19”（强调2019年发现/命名）；日常交流中直接说“COVID”很常见。","相关常见搭配：get/have COVID（得新冠）、test positive/negative for COVID（检测阳性/阴性）、long COVID（长新冠/长期症状）。"]}
{"word":"COVID toes","summary":{"en":"“COVID toes” refers to chilblain-like red/purple, swollen toes (sometimes fingers) reported during the pandemic, possibly related to COVID-19 in some cases.","zh":"“COVID toes（新冠脚趾）”指疫情期间被报道的冻疮样脚趾红紫、肿胀等皮损，部分病例可能与新冠有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A skin condition reported during the COVID-19 pandemic, where toes (and sometimes fingers) become red or purple, swollen, and sometimes painful or itchy, resembling chilblains; it has been linked in some cases to COVID-19 infection or immune response.","zh":"一种在新冠疫情期间被报道的皮肤症状：脚趾（有时手指）出现红紫色、肿胀、疼痛或瘙痒，外观类似“冻疮样”皮损；部分病例可能与新冠感染或免疫反应有关。"},"examples":[{"en":"She noticed purple, sore patches on her toes and wondered if it was COVID toes.","zh":"她发现脚趾上有紫色、酸痛的斑块，怀疑是不是“新冠脚趾”。"},{"en":"The doctor said COVID toes can look like chilblains and may appear even without other symptoms.","zh":"医生说“新冠脚趾”看起来像冻疮样皮损，而且可能在没有其他症状时也会出现。"}]}],"synonyms":["chilblain-like lesions","COVID-related chilblains","pernio-like rash"],"phonetic":"/ˈkoʊvɪd toʊz/","extraExplanation":["“COVID toes”是媒体和临床讨论中常见的非正式说法，不是严格的诊断名称；医生有时会用“冻疮样病变（chilblain-like lesions）”来描述外观。","研究结论并不完全一致：有些人确实在感染新冠前后出现类似皮疹，但也有人核酸/抗体阴性却出现相同皮损；可能与免疫反应、微血管炎症等因素相关。","一般可自限，但若出现脚趾剧烈疼痛、明显肿胀发热、溃破化脓、发黑/麻木、或伴随呼吸困难、胸痛等全身症状，应尽快就医。"]}
{"word":"COVID-19","summary":{"en":"COVID-19 is a contagious disease caused by SARS‑CoV‑2; it can also refer to the pandemic period starting in 2019.","zh":"COVID-19 是由 SARS‑CoV‑2 引起的传染病；也可指自 2019 年开始的新冠大流行/疫情时期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a contagious disease caused by the coronavirus SARS‑CoV‑2, first identified in 2019, that can affect the respiratory system and sometimes other parts of the body","zh":"由冠状病毒 SARS‑CoV‑2 引起的传染病，2019 年首次被发现，可影响呼吸系统，有时也会影响身体其他部位"},"examples":[{"en":"COVID-19 spreads mainly through respiratory droplets and aerosols.","zh":"COVID-19 主要通过呼吸道飞沫和气溶胶传播。"},{"en":"He tested positive for COVID-19 and stayed home to recover.","zh":"他的新冠检测呈阳性，于是在家休息康复。"},{"en":"Many schools switched to online classes during the COVID-19 pandemic.","zh":"在新冠疫情期间，许多学校改为线上上课。"}]},{"partOfSpeech":"n.","definition":{"en":"the global pandemic (and related public-health period) caused by COVID‑19, especially from 2019 onward","zh":"由新冠肺炎引发的全球性大流行（以及相关的公共卫生时期），尤指 2019 年以来"},"examples":[{"en":"Travel habits changed a lot during COVID-19.","zh":"在新冠疫情期间，人们的出行习惯改变很大。"},{"en":"Small businesses faced new challenges because of COVID-19.","zh":"由于新冠疫情，小企业面临新的挑战。"}]}],"synonyms":["coronavirus disease 2019","COVID","the COVID-19 pandemic"],"phonetic":"/ˌkoʊvɪd naɪnˈtiːn/","extraExplanation":["“COVID-19”是缩写，来自英文全称“Coronavirus Disease 2019”（2019 冠状病毒病）。其中“CO”= corona（冠状），“VI”= virus（病毒），“D”= disease（疾病），“19”指 2019 年。","日常英文里既可以把 COVID-19 当作“疾病名称”（have COVID-19 / get COVID-19），也常用来指“疫情时期/大流行”（during COVID-19）。正式写法常用全大写“COVID-19”，口语和新闻里也会看到“Covid-19”。","常见搭配：COVID-19 vaccine（新冠疫苗）、COVID-19 test（新冠检测）、post-COVID（后疫情/感染后）、long COVID（长新冠）。"]}
{"word":"covido","summary":{"en":"“Covido” is not standard English; it is usually a misspelling of “COVID / COVID-19.”","zh":"“covido”不是标准英语，通常是“COVID / COVID-19”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or uncommon form in English; most often a misspelling of “COVID” or “COVID-19,” the disease caused by the coronavirus SARS‑CoV‑2.","zh":"在英语中不是标准或常见的词；最常见是把“COVID”或“COVID-19”（由冠状病毒 SARS‑CoV‑2 引起的疾病）拼写错写成“covido”。"},"examples":[{"en":"I think you meant “COVID,” not “covido.”","zh":"我想你要写的是“COVID”，不是“covido”。"},{"en":"COVID-19 changed how many people work and study.","zh":"COVID-19 改变了许多人的工作和学习方式。"}]}],"synonyms":["COVID","COVID-19"],"phonetic":"ˈkoʊvɪd","extraExplanation":["“COVID”来自“coronavirus disease”的缩写：CO（corona）+ VI（virus）+ D（disease），再加上“19”表示 2019 年首次被报告。英语里正式写法常见为“COVID-19”或简称“COVID”。","如果你在社交媒体或口语里看到“covido”，有时只是非正式拼写或打字错误；也可能在其他语言/昵称中出现，但在标准英语词典中通常不作为正式词条。"]}
{"word":"Coviello","summary":{"en":"Coviello is most commonly an Italian-origin surname used as a family name or in names of organizations.","zh":"Coviello 最常见的是意大利来源的姓氏，用作人的姓或机构/商号名称的一部分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an Italian-origin surname (family name). It is used as a last name for people and may also appear in business names (e.g., a law firm, restaurant, or company) named after the family.","zh":"一个源自意大利的姓氏（家族名）。常用作人的姓，也可能出现在以家族命名的商号中（如律所、餐馆或公司）。"},"examples":[{"en":"Dr. Coviello will speak at the conference tomorrow.","zh":"Coviello 医生明天将在会议上发言。"},{"en":"I emailed Ms. Coviello about the appointment.","zh":"我给 Coviello 女士发邮件询问预约事宜。"},{"en":"Coviello & Partners is a small firm in town.","zh":"Coviello & Partners 是镇上一家小型事务所。"}]}],"phonetic":"/ˌkoʊviˈɛloʊ/","extraExplanation":["“Coviello”通常首字母大写，因为它多为专有名词（姓氏或机构名称）。","发音在英语环境中可能因地区略有差异；如果你指的是某位具体人物/品牌/地名，我也可以根据语境补充更精确的解释与用法。"]}
{"word":"coviello","summary":{"en":"Coviello is most commonly a surname (a family name), often associated with Italian heritage.","zh":"Coviello 最常见的用法是姓氏（家族姓），常与意大利背景相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), often of Italian origin; used to refer to a person or family named Coviello","zh":"科维耶洛（姓氏），常见于意大利语背景；用于指姓 Coviello 的个人或家族"},"examples":[{"en":"Dr. Coviello will speak at the conference tomorrow.","zh":"科维耶洛博士明天将在会议上发言。"},{"en":"I emailed Ms. Coviello about the appointment.","zh":"我给科维耶洛女士发邮件讨论预约的事。"},{"en":"The Coviello family moved to New Jersey years ago.","zh":"科维耶洛一家多年前搬到了新泽西。"}]}],"phonetic":"/ˌkoʊviˈɛloʊ/","extraExplanation":["“Coviello”通常是意大利姓氏，在英语语境里多作为专有名词使用：首字母大写（Coviello），一般不加冠词（不说 *the Coviello*，除非指“科维耶洛一家/科维耶洛家族”）。","读音在英语里可能会因地区而略有差异；遇到本人时，以对方自报读法为准是最礼貌的做法。"]}
{"word":"covillager","summary":{"en":"Covillager means a fellow villager—someone from the same village as you.","zh":"covillager 指“同村人/同一个村庄的村民”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who lives in the same village as you; a fellow villager.","zh":"与你住在同一个村庄的人；同村人。"},"examples":[{"en":"I met one of my covillagers at the market in town.","zh":"我在镇上的集市遇到了一个同村人。"},{"en":"The festival is a time when covillagers come together to share food and stories.","zh":"节日是同村人聚在一起分享食物和故事的时刻。"}]}],"synonyms":["co-villager","fellow villager","someone from my village","villagemate"],"phonetic":"/koʊ ˈvɪlɪdʒɚ/","extraExplanation":["“covillager”通常写作 **co-villager**（或 **co-villager** / **co-villagers**），由前缀 **co-**（“共同、一起”）+ **villager**（“村民”）构成。它在日常英语里不算常见，更常用的表达是 **fellow villager**、**someone from my village**。","在一些语境中（尤其是谈家乡、人际关系或移民社区），“同村/同乡”的概念常用来强调熟人网络、互助关系和共同的地方身份。"]}
{"word":"Covillea","summary":{"en":"Covillea is an older botanical genus name, mainly seen in historical sources, for the creosote bush (now usually Larrea).","zh":"Covillea 是较旧的植物学属名，主要见于历史资料，指克里奥索特灌木（现多归为 Larrea）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a former scientific genus name for the creosote bush; now usually classified in the genus Larrea (especially Larrea tridentata).","zh":"（植物学）旧属名，曾用于指“油脂灌木/克里奥索特灌木”（creosote bush）；现多归入拉瑞亚属 Larrea（尤指 Larrea tridentata）。"},"examples":[{"en":"Older plant books may list the creosote bush as Covillea tridentata.","zh":"较早的植物书可能把克里奥索特灌木写作 Covillea tridentata。"},{"en":"In modern taxonomy, Covillea is generally treated as a synonym of Larrea.","zh":"在现代分类学中，Covillea 通常被视为 Larrea 的异名（同物异名）。"}]}],"synonyms":["Larrea","Larrea tridentata","creosote bush"],"phonetic":"/kəˈvɪliə/","extraExplanation":["“Covillea”来自美国植物学家 Frederick Vernon Coville 的姓氏，用来纪念他；后来随着分类研究更新，这个属名多被并入 Larrea，因此你在新资料里更常看到 Larrea tridentata（克里奥索特灌木）。","在阅读英文资料时，如果看到“Covillea tridentata”，可把它理解为“Larrea tridentata 的旧称”，常出现在旧版图鉴、历史文献或标本标签中。"]}
{"word":"covillea","summary":{"en":"*Covillea* is an older scientific name linked to the creosote bush, now usually called *Larrea tridentata*.","zh":"*Covillea* 是与油木（creosote bush）相关的旧学名，现多用 *Larrea tridentata*。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former scientific genus name for the creosote bush (now usually classified as *Larrea tridentata*), a desert shrub common in the southwestern United States and northern Mexico.","zh":"（植物学）一种旧的属名，曾用来指“克里奥索特灌木/油木”（现多归入*Larrea tridentata*，常见于美国西南与墨西哥北部的沙漠灌木）。"},"examples":[{"en":"In older botanical books, the creosote bush may be listed as *Covillea tridentata*.","zh":"在较早的植物学书籍中，油木可能会被写作*Covillea tridentata*。"},{"en":"The label says *Larrea tridentata*, but some historical sources used the name *Covillea*.","zh":"标签上写的是*Larrea tridentata*，但一些历史资料曾使用*Covillea*这个名称。"}]}],"synonyms":["Larrea","Larrea tridentata","creosote bush"],"phonetic":"/koʊˈvɪliə/","extraExplanation":["“Covillea”主要出现在植物分类学的历史文献里；现代常用的学名是*Larrea tridentata*。","这个名称源自人名（常与美国植物学家 Frederick Vernon Coville 相关），属于“以人物命名”的学术拉丁名传统。","如果你是在自然观察、园艺或古籍里看到它，通常可以把它理解为“creosote bush（油木/克里奥索特灌木）”的旧称。"]}
{"word":"covin","summary":{"en":"Covin is an old-fashioned word meaning a secret, dishonest conspiracy or collusion.","zh":"Covin 是较古老的词，指秘密且不正当的合谋或勾结。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a secret agreement or conspiracy to do something dishonest or illegal; collusion","zh":"秘密的合谋；共谋（常指不诚实或违法的勾结）"},"examples":[{"en":"The court found evidence of covin between the two companies to fix prices.","zh":"法院发现两家公司之间有合谋操纵价格的证据。"},{"en":"They acted in covin to deceive investors.","zh":"他们暗中勾结来欺骗投资者。"}]}],"synonyms":["conspiracy","collusion","plot","scheme"],"phonetic":"/ˈkʌvɪn/","extraExplanation":["“covin”是较古老、偏法律/文书用语，现代英语里更常用“conspiracy”“collusion”“fraud”“plot”等。","词源上与拉丁语“convenire（聚到一起、达成一致）”有关，因此带有“私下凑在一起串通”的含义。"]}
{"word":"Covina","summary":{"en":"Covina is a city in Los Angeles County, Southern California.","zh":"Covina（科维纳）是美国加州南部洛杉矶县的一座城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a city in Los Angeles County, in Southern California (U.S.), east of downtown Los Angeles.","zh":"科维纳：美国加利福尼亚州南部洛杉矶县的一座城市，位于洛杉矶市中心以东。"},"examples":[{"en":"She grew up in Covina and commuted to Los Angeles for work.","zh":"她在科维纳长大，上班通勤到洛杉矶。"},{"en":"Let’s meet at a café in Covina this weekend.","zh":"这周末我们在科维纳的一家咖啡馆见吧。"}]}],"synonyms":["Covina, California"],"phonetic":"/kəˈviːnə/","extraExplanation":["“Covina”是专有名词（地名），日常英语里通常不用冠词（不说 *the Covina*）。常见说法包括：in Covina（在科维纳）、from Covina（来自科维纳）、Covina, California（加州科维纳）。","科维纳附近还有一个城市叫“West Covina（西科维纳）”，名称相近但属于不同城市。写作或出行时要注意区分。"]}
{"word":"covine","summary":{"en":"Covine is an archaic Scots legal word meaning secret collusion or conspiracy to deceive, often involving fraud.","zh":"Covine 是苏格兰法律中的古词，指暗中勾结、共谋以欺骗他人，常与诈骗有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scots law, archaic) A secret agreement to deceive others; collusion or conspiracy, often to commit fraud.","zh":"（苏格兰法律，古义）为欺骗他人而秘密串通的协议；共谋、勾结（常指诈骗）。"},"examples":[{"en":"The court found evidence of covine between the two merchants.","zh":"法院发现两名商人之间存在勾结（covine）的证据。"},{"en":"He claimed the contract was signed in covine and should be voided.","zh":"他主张该合同是在串通（covine）下签订的，应被撤销。"}]},{"partOfSpeech":"phrase","definition":{"en":"in covine (phrase): acting together in secret to cheat or trick someone.","zh":"in covine（短语）：暗中合谋，一起欺骗或算计某人。"},"examples":[{"en":"They worked in covine to inflate the prices.","zh":"他们暗中合谋抬高价格。"}]}],"synonyms":["collusion","conspiracy","plot","fraudulent scheme"],"phonetic":"/ˈkʌvɪn/","extraExplanation":["“covine”在现代日常英语中几乎不用，更多见于苏格兰法律语境或历史文本中，意义接近“collusion / conspiracy（勾结、共谋）”。","词源一般认为来自古法语（Old French）相关词，指“结盟、合伙”，后来在法律语境里常带有“为不正当目的而串通”的负面含义。"]}
{"word":"coving","summary":{"en":"Coving is decorative molding along the wall–ceiling joint, or the work of installing it.","zh":"coving 指墙面与天花交界处的装饰线脚，也可指安装这种线脚的工作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Decorative molding (a shaped strip) placed along the joint where a wall meets a ceiling, often curved to soften the corner.","zh":"（室内装修）檐口线脚；天花与墙面交界处的装饰线条（常为弧形，用来柔化直角）"},"examples":[{"en":"We added coving to the living room to give it a more finished look.","zh":"我们在客厅加装了檐口线脚，让整体看起来更精致。"},{"en":"The old house still has original coving and ceiling roses.","zh":"这栋老房子还保留着原来的檐口线脚和天花玫瑰花饰。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of fitting or installing coving.","zh":"安装檐口线脚的工作；做檐口线脚的过程"},"examples":[{"en":"Coving is easier if you measure carefully and use a miter box for the corners.","zh":"如果认真测量并用斜切盒处理转角，安装檐口线脚会更容易。"},{"en":"They hired a professional for the coving because the ceilings weren’t level.","zh":"因为天花不平，他们请了专业人士来做檐口线脚。"}]}],"synonyms":["crown molding","cornice","molding","trim"],"phonetic":"/ˈkoʊvɪŋ/","extraExplanation":["“coving”在英式英语里更常用；美式英语里常听到的近义说法是“crown molding”（顶角线/皇冠线脚）。两者很接近，但“coving”常强调弧形过渡，而“crown molding”形状可能更复杂、更“皇冠状”。","在装修语境中常见搭配：install/fix coving（安装线脚）、paint the coving（给线脚刷漆）、coving corners（处理转角）。"]}
{"word":"covings","summary":{"en":"Covings are decorative moldings along the wall–ceiling edge (plural of coving).","zh":"covings 指墙与天花板交界处的装饰线脚（coving 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of coving) Curved molding (decorative trim) that covers the angle where a wall meets a ceiling.","zh":"（coving 的复数）檐口线脚；墙与天花板交界处用于遮盖并装饰转角的弧形/斜面装饰条。"},"examples":[{"en":"The room looks taller after we added covings along the ceiling.","zh":"沿着天花板加了檐口线脚后，房间看起来更高了。"},{"en":"The painter taped the covings to protect them from splashes.","zh":"油漆工把檐口线脚贴上遮蔽胶带，防止油漆飞溅。"}]}],"synonyms":["crown molding","crown moulding","cornice","molding"],"phonetic":"/ˈkoʊvɪŋz/","extraExplanation":["“Coving”多用于英式或建筑/室内装饰语境；在美式英语里常见近义词是“crown molding / crown moulding（顶角线）”。","语境提示：说“install/fit coving（安装线脚）”、“paint the coving（给线脚刷漆）”、“plaster coving（石膏线）”都很常见。"]}
{"word":"Covington","summary":{"en":"Covington is most commonly the name of a U.S. city (especially Covington, Kentucky) and can also be a surname.","zh":"Covington 常见为美国城市地名（尤指肯塔基州科文顿），也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a proper name used for several places (especially towns/cities) in the United States; most commonly refers to Covington, Kentucky, a city across the river from Cincinnati, Ohio","zh":"专有名词：美国多个城镇/城市的地名；最常见的指“肯塔基州科文顿市（Covington, Kentucky）”，位于河对岸，与俄亥俄州辛辛那提相邻"},"examples":[{"en":"We took a short drive from Cincinnati to Covington to see the riverfront.","zh":"我们从辛辛那提出发，开车很快就到科文顿，去看河边风景。"},{"en":"She grew up in Covington, Kentucky, before moving to Chicago.","zh":"她在肯塔基州的科文顿长大，后来搬到了芝加哥。"}]},{"partOfSpeech":"n.","definition":{"en":"a surname (family name)","zh":"姓氏：科文顿（Covington）"},"examples":[{"en":"Mr. Covington will join the meeting at 2 p.m.","zh":"科文顿先生将在下午两点参加会议。"}]}],"phonetic":"/ˈkʌvɪŋtən/","extraExplanation":["“Covington”在美国不止一个地方使用：除了肯塔基州科文顿外，路易斯安那州、乔治亚州、田纳西州等也有同名城镇。遇到这类地名时，写作或阅读中通常会加州名来避免混淆（例如 Covington, LA）。","作为地名或姓氏时通常不翻译含义，中文多采用音译“科文顿”。"]}
{"word":"covinous","summary":{"en":"“Covinous” means dishonest and greedy, especially involving scheming or fraud for gain.","zh":"“covinous”指贪婪且不诚实的，尤指通过阴谋或欺诈牟利。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Dishonest and greedy, especially in a way that tries to get money or advantage by trickery (like fraud or scheming).","zh":"贪婪且不诚实的；尤指用欺骗、阴谋等手段谋取钱财或利益的（近似“诈骗式的贪婪”）。"},"examples":[{"en":"The contract was written in a covinous way to cheat small suppliers.","zh":"这份合同写得很“covinous”，意在欺骗小供应商。"},{"en":"He warned her about covinous people who target new immigrants with fake jobs.","zh":"他提醒她提防那些“covinous”的人，他们用虚假的工作来专门坑骗新移民。"},{"en":"The judge described the scheme as covinous and harmful to the public.","zh":"法官形容这场骗局既贪婪又不诚实，对公众有害。"}]}],"synonyms":["fraudulent","deceitful","scheming","dishonest","greedy"],"phonetic":"/ˈkʌvənəs/","extraExplanation":["“covinous”是非常少见、偏法律/古典风格的词，来自“covin”（旧法语/中古英语，意为“共谋、串通、欺诈”）。在法律语境里常用来形容为非法获利而进行的“串通、诈骗、阴谋”。","现代英语里更常用的替代词包括：fraudulent（欺诈的）、deceitful（欺骗的）、scheming（爱耍阴谋的）、avaricious/greedy（贪婪的）。其中“fraudulent”最接近“covinous”的法律味道。"]}
{"word":"covinously","summary":{"en":"“Covinously” means “fraudulently or by secret collusion,” mainly in archaic legal English.","zh":"“covinously”意为“以欺诈或暗中串通的方式”，主要见于较古老的法律英语。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a deceitful, fraudulent, or secretly collusive way (often used in older legal writing).","zh":"以欺诈的、骗取的或暗中串通的方式（常见于较早的法律文本中）。"},"examples":[{"en":"The court found that the contract was obtained covinously, so it could not be enforced.","zh":"法院认定该合同系以欺诈方式取得，因此不得强制执行。"},{"en":"He transferred the property covinously to avoid paying his creditors.","zh":"他为逃避向债权人付款而暗中欺诈性地转移财产。"}]}],"synonyms":["fraudulently","deceitfully","dishonestly","collusively"],"phonetic":"/ˈkʌvɪnəsli/","extraExplanation":["“covinously”源自名词“covin”（古英语法律用语），意为“欺诈、串通”。在现代英语里非常少见，通常会用“fraudulently”（欺诈地）、“deceitfully”（欺骗地）或“collusively”（串通地）来替代。","它常出现在旧式的判决书、契约或法律评论中，用来强调行为不仅是“骗人”，还带有“暗中合谋/串通”的意味。"]}
{"word":"covins","summary":{"en":"Covin (plural: covins) means secret collusion or conspiracy, especially to commit fraud (an archaic legal term).","zh":"covin（复数 covins）指秘密串通或共谋，尤指为诈骗而合谋（偏古语的法律术语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic, legal) A secret agreement or collusion—especially a conspiracy to cheat or defraud someone.","zh":"（古语／法律用语）秘密串通；共谋（尤指为欺骗或诈骗他人而合谋）。"},"examples":[{"en":"The contract was voided because the court found evidence of covin.","zh":"由于法院发现有串通共谋的证据，该合同被判无效。"},{"en":"They were accused of covin to hide assets from creditors.","zh":"他们被指控串通转移资产以逃避债权人。"},{"en":"The judge warned that any covin in the bidding process would be punished.","zh":"法官警告：招标过程中任何串通行为都将受到惩处。"}]}],"synonyms":["collusion","conspiracy","plot","fraud","deceit"],"phonetic":"/ˈkʌvɪn/","extraExplanation":["“covin”的复数是“covins”。这个词在现代英语里比较少见，常出现在旧式法律文本中，含义接近“collusion（串通）/ conspiracy（阴谋）”。","词源来自盎格鲁-法语（Anglo-French）“covine”，与“convene/come together（聚在一起）”的概念相关，但语义发展为“暗中聚在一起做坏事”。"]}
{"word":"covisit","summary":{"en":"“Covisit” (more commonly “co-visit”) means to visit somewhere together with someone.","zh":"“covisit”（更常见写作“co-visit”）指与他人一起去拜访或参观。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to visit a place or event together with someone; to make a joint visit (often written as “co-visit”).","zh":"与他人一起拜访/参观；共同访问（常写作“co-visit”）。"},"examples":[{"en":"The two teachers co-visited the class to observe the lesson.","zh":"两位老师一起去听课观察。"},{"en":"We co-visited the museum during the conference break.","zh":"我们在会议间隙一起参观了博物馆。"}]},{"partOfSpeech":"v.","definition":{"en":"to visit the same place again at the same time as someone else (less common; context-dependent).","zh":"与他人在同一时间再次访问同一地点（较少见，需看语境）。"},"examples":[{"en":"If you co-visit the site next week, we can compare notes afterward.","zh":"如果你下周也去现场，我们之后可以对照记录。"}]}],"synonyms":["visit together","make a joint visit","visit with","accompany"],"phonetic":"/ˌkoʊˈvɪzɪt/","extraExplanation":["“covisit”并不是非常常见或标准化的拼写，更常见的写法是带连字符的“co-visit”。在正式写作中，也可以改用更自然的表达：visit together / make a joint visit / visit with someone。","“co-”这个前缀表示“共同、一起”（如 co-worker 同事，co-author 合著者）。因此“co-visit”字面意思就是“共同拜访/共同参观”。"]}
{"word":"covisitor","summary":{"en":"A covisitor is someone who visits the same place or event with another person at the same time.","zh":"covisitor 指与他人同时到访同一地点或活动的“同访者/同行访客”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who visits a place or attends an event at the same time as another person; a fellow visitor","zh":"与他人同时到访某地或一同参加活动的人；同访者、同行访客"},"examples":[{"en":"We met our co-visitor at the museum entrance and toured the exhibits together.","zh":"我们在博物馆门口遇到同行的访客，然后一起参观了展品。"},{"en":"Each patient is allowed one co-visitor during visiting hours.","zh":"探视时间内，每位病人可允许一名同行探视者。"}]}],"synonyms":["fellow visitor","companion","co-visitor","visitor"],"phonetic":"koʊˈvɪzɪtər","extraExplanation":["“co-”是英语常见前缀，表示“共同、一起”（如 co-worker 同事、coauthor 合著者）。因此 covisitor / co-visitor 直观含义就是“共同来访的人”。","这个词在日常口语中不算常见；更自然的说法常是 “a fellow visitor,” “someone who visited with me,” 或 “a companion.”"]}
{"word":"covite","summary":{"en":"“Covite” is a rare, informal word for someone who has COVID-19 or is connected to a COVID outbreak.","zh":"“covite”是一个较少见的非正式说法，指感染新冠或与新冠疫情相关的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, rare) A person who has COVID-19 or is associated with COVID-19 (for example, someone infected or part of a COVID outbreak).","zh":"（非正式、较少见）感染新冠（COVID-19）的人，或与新冠事件有关的人（例如病例或疫情中的相关人员）。"},"examples":[{"en":"A few covites from the office had to isolate at home.","zh":"办公室里有几位感染新冠的人不得不在家隔离。"},{"en":"The clinic set up a separate waiting area for covites.","zh":"诊所为新冠患者设立了单独的候诊区。"}]}],"synonyms":["COVID patient","COVID case","person with COVID","COVID-19 patient"],"phonetic":"/ˈkoʊ.vaɪt/","extraExplanation":["“covite”并不是主流标准词汇，更常见的是说 “COVID patient / COVID case / person with COVID”。","词尾 “-ite” 在英语里常用来表示“……的人/追随者/成员”（如 “Mennonite”“Israelite”），所以有人会把 “COVID” 加上 “-ite” 造出 “covite”。","如果你本来想查的是 “COVID”，拼写是 C-O-V-I-D，读音 /ˈkoʊ.vɪd/，意思是“新冠肺炎/新冠病毒疾病”。"]}
{"word":"covolume","summary":{"en":"Covolume usually means the fundamental-region (unit-cell) volume of a lattice; less commonly, it refers to an excluded-volume parameter in real-gas models.","zh":"covolume 通常指格的基本域（晶胞/单位胞）体积；较少情况下指真实气体模型中的排除体积相关参数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Mathematics, geometry) The volume of a fundamental region (fundamental domain) of a lattice; informally, the “unit cell volume” that measures how densely the lattice fills space.","zh":"（数学/几何）格（lattice）的基本区域（基本域）的体积；通俗说就是“晶胞体积/单位胞体积”，用来衡量格在空间中的填充密度。"},"examples":[{"en":"In three dimensions, the covolume of a lattice equals the absolute value of the determinant of its basis matrix.","zh":"在三维中，格的 covolume 等于其基矩阵行列式的绝对值。"},{"en":"A smaller covolume means the lattice points are packed more densely.","zh":"covolume 越小，格点分布越密。"}]},{"partOfSpeech":"n.","definition":{"en":"(Physics/chemistry, less common in everyday English) A parameter related to the excluded volume of molecules in a real-gas model (often connected to the van der Waals constant b).","zh":"（物理/化学，日常较少见）与真实气体模型中分子“排除体积”相关的参数（常与范德华常数 b 有关）。"},"examples":[{"en":"In some texts, “covolume” is used for the excluded-volume term in the van der Waals equation.","zh":"在一些教材里，covolume 用来指范德华方程中的排除体积项。"},{"en":"The covolume helps account for the finite size of gas molecules.","zh":"covolume 用于反映气体分子并非点粒子、具有有限大小。"}]}],"synonyms":["fundamental domain volume","unit cell volume","determinant (of a lattice)"],"phonetic":"/ˈkoʊˌvɑːljuːm/","extraExplanation":["拼写提示：更常见的写法是 **co-volume**（带连字符）或 **co-volume of a lattice**；在几何与数论语境下最常用。","词源/理解方式：前缀 **co-** 常表示“与……对应/互补”。在格的语境里，covolume 可以理解为“与格点密度相对应的体积尺度”：密度越高，covolume 越小。"]}
{"word":"covotary","summary":{"en":"“Co-votary” means a fellow devotee—someone who shares the same devotion or cause (rare, literary).","zh":"“co-votary/covotary”指“同道的奉献者/信徒”，即与你同样崇敬或支持某人、某事业的人（较罕见，偏文学）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A fellow devotee or companion who shares the same cause, person, or ideal; a co-worshipper (rare, often literary).","zh":"（罕见/文学用语）同道的信徒；同样效忠或崇敬某人/某理念的人；同伴（一起“奉献/敬仰”的人）。"},"examples":[{"en":"She found a co-votary in him—someone equally devoted to the project.","zh":"她在他身上找到了同道者——一个同样投入这个项目的人。"},{"en":"In the poem, the speaker addresses his co-votaries of love.","zh":"在诗中，叙述者向他“爱情的同道者们”致意。"}]}],"synonyms":["fellow devotee","fellow believer","ally","kindred spirit","supporter"],"phonetic":"/koʊ ˈvoʊtəri/","extraExplanation":["“covotary”更常见的写法是 **co-votary**（也可见作 co-votary / co-votaries）。它由前缀 **co-**（“共同、一起”）+ **votary**（“虔诚的追随者/奉献者”）构成。","这个词在现代日常英语中很少用，更多出现在较古典或诗歌式的表达里。日常表达里更常用 **fellow supporter / fellow believer / kindred spirit / ally** 等。"]}
