{"word":"cow","summary":{"en":"A cow is usually an adult female cattle; it can also be a verb meaning “to intimidate.” As slang, it can be an offensive insult for a woman.","zh":"cow 通常指成年母牛；作动词可表示“恐吓、威吓”。在俚语中也可作对女性的侮辱性称呼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A fully grown female bovine (cattle), especially one kept for milk or meat.","zh":"（尤指已成年的）母牛；奶牛（也可泛指饲养的牛）"},"examples":[{"en":"The cow is grazing in the field.","zh":"那头母牛正在田里吃草。"},{"en":"They keep cows for milk and cheese.","zh":"他们养奶牛来生产牛奶和奶酪。"},{"en":"The farmer brought the cow into the barn.","zh":"农夫把母牛赶进了谷仓。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, often rude) A word used to insult a woman.","zh":"（非正式且常带侮辱）用来骂女性的词"},"examples":[{"en":"That insult is offensive—please don’t use it.","zh":"那种骂人的话很冒犯——请不要使用。"},{"en":"In many workplaces, calling someone that could get you disciplined.","zh":"在很多职场里，用那种话骂人可能会受到处分。"}]},{"partOfSpeech":"vi.","definition":{"en":"To give birth to a calf (used for cattle).","zh":"（牛）产犊；生小牛"},"examples":[{"en":"The heifer will cow in early spring.","zh":"那头小母牛会在早春产犊。"},{"en":"They moved her to a quiet pen to cow safely.","zh":"他们把它转到安静的圈里，好让它安全产犊。"}]},{"partOfSpeech":"vt.","definition":{"en":"To frighten or intimidate someone into doing what you want.","zh":"威吓；恐吓（使人屈服）"},"examples":[{"en":"He tried to cow his opponent with threats.","zh":"他试图用威胁来恐吓对手。"},{"en":"Don’t let their anger cow you into silence.","zh":"别让他们的愤怒把你吓得不敢说话。"}]}],"synonyms":["bovine","cattle","dairy cow","intimidate","frighten","bully"],"phonetic":"/kaʊ/","extraExplanation":["“cow”（母牛）这个名词非常常见；但把它用来形容女性通常是强烈贬义，在英语文化中容易引发冲突，建议学习者避免使用。","动词“cow”（恐吓）在书面语或正式语境里更常见（如新闻、文学）。读音与名词相同，但含义完全不同。","相关搭配：a dairy cow（奶牛）、a herd of cows（一群牛）、to milk a cow（给牛挤奶）、cash cow（“摇钱树/现金奶牛”，指持续带来利润的事物）。"]}
{"word":"cow-lick","summary":{"en":"A cowlick is a swirl or stubborn section of hair that sticks up because it grows in a different direction.","zh":"cowlick 指因头发生长方向不同而形成的发旋或总是翘起、难以梳平的一撮头发。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a section of hair that grows in a different direction from the rest, causing a small swirl or a lock that sticks up and is hard to comb flat","zh":"（头发的）发旋；翘起的一撮头发（生长方向与其他头发不同，常很难梳平）"},"examples":[{"en":"He has a cowlick at the front of his hairline, so his bangs always stick up.","zh":"他发际线前面有个发旋，所以刘海总是翘起来。"},{"en":"No matter how much gel she uses, her cowlick won’t lie flat.","zh":"不管她用多少发胶，她那撮翘起的头发还是压不平。"},{"en":"The barber asked if I wanted to cut around the cowlick or keep it longer.","zh":"理发师问我想绕开发旋剪短一点，还是把那一块留长。"}]}],"synonyms":["hair whorl","swirl","tuft"],"phonetic":"/ˈkaʊˌlɪk/","extraExplanation":["“cowlick”这个词很形象：据说来自“牛舔过的毛”那种逆向、打旋儿的效果，所以用来比喻头发某一处怎么梳都不太服帖。日常口语里很常见，也可以写作 cow-lick（较少见）。"]}
{"word":"cow-like","summary":{"en":"“Cow-like” means resembling a cow; it can be neutral in description but may sound insulting when used about people.","zh":"“cow-like”表示“像牛的”；用于客观描写时较中性，但形容人时可能带侮辱意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a cow in appearance, shape, movement, or sound (often used in a descriptive or sometimes rude/insulting way).","zh":"像牛的；具有牛的外形、动作或叫声的（多用于描写，有时也带有粗鲁/侮辱意味）。"},"examples":[{"en":"The artist painted a cow-like creature with a wide face and slow steps.","zh":"画家画了一个牛一样的生物，脸很宽，步子很慢。"},{"en":"The statue’s cow-like eyes give it a calm, gentle look.","zh":"雕像那双牛似的眼睛让它看起来很平静、温和。"},{"en":"Be careful: calling someone “cow-like” can sound insulting.","zh":"要小心：说某人“像牛一样”可能听起来是在侮辱人。"}]}],"synonyms":["bovine","oxlike","cowish"],"phonetic":"/ˈkaʊˌlaɪk/","extraExplanation":["“cow-like”是由名词cow（牛）+ -like（像……的）构成的复合形容词，常用连字符（hyphen）。在科学或写作中可作中性描述（如“cow-like body”），但用于形容人时容易带贬义，暗示“笨拙、迟钝、粗壮”等，因此语境很重要。"]}
{"word":"cow-related","summary":{"en":"“Cow-related” means connected with cows or things involving cows.","zh":"“cow-related”表示“与牛或涉及牛的事物有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with cows (their body, milk, farming, behavior, etc.).","zh":"与牛（奶牛/黄牛）的身体、牛奶、饲养或相关事物有关的。"},"examples":[{"en":"The museum has a small cow-related exhibit about dairy farming.","zh":"博物馆有一个小型的与奶牛相关的展览，介绍乳品业。"},{"en":"She is writing a cow-related article on how to care for calves.","zh":"她正在写一篇与牛相关的文章，讲如何照顾小牛。"}]},{"partOfSpeech":"adj.","definition":{"en":"Used to describe jokes, comments, or content that mentions cows (often in a light or humorous way).","zh":"（常带轻松/幽默语气）指提到“牛”的笑话、评论或内容。"},"examples":[{"en":"His presentation included a few cow-related jokes to keep everyone relaxed.","zh":"他的演讲里穿插了几个“牛”相关的笑话，让大家放松。"},{"en":"The chat group is full of cow-related memes today.","zh":"今天群聊里全是“牛”相关的梗图。"}]}],"synonyms":["cow-associated","cattle-related","bovine-related","dairy-related"],"phonetic":"/ˈkaʊ rɪˌleɪtɪd/","extraExplanation":["“cow-related”是形容词的合成结构（名词 cow + related）。在写作中通常用连字符（hyphen）来清楚地修饰后面的名词：cow-related topics。若放在名词后作表语，也可写作 cow related（较少见）：The issues are cow related。"]}
{"word":"cow-shaped","summary":{"en":"“Cow-shaped” means shaped like a cow.","zh":"“cow-shaped”表示“形状像牛的；牛形的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape or outline of a cow (often describing an object, toy, or design).","zh":"牛形的；形状像牛的（常用于描述物品、玩具或设计）。"},"examples":[{"en":"The shop sells cow-shaped cookies and pig-shaped candies.","zh":"那家店卖牛形饼干和猪形糖果。"},{"en":"She bought a cow-shaped mug as a funny gift.","zh":"她买了一个牛形马克杯当作搞笑礼物。"}]}],"synonyms":["cowlike","bovine-shaped","cow-form"],"phonetic":"ˈkaʊ ˌʃeɪpt","extraExplanation":["“cow-shaped”是常见的复合形容词（compound adjective），通常要加连字符：cow-shaped + 名词（cow-shaped toy）。如果放在名词后面作表语，也可以写成不加连字符的形式，但加连字符更清晰：The toy is cow-shaped（也常见写法：cow shaped）。"]}
{"word":"cow-wheat","summary":{"en":"Cow-wheat is a wild plant (Melampyrum) found in woodland areas, named from old folk beliefs and not actually related to wheat.","zh":"Cow-wheat 指林地常见的牛麦草属野生植物（Melampyrum），名称源自旧时民间说法，与小麦并无亲缘关系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wild woodland plant (genus *Melampyrum*) with small yellow flowers, once thought to be eaten by cows or to affect milk; often found in Europe.","zh":"牛麦草（玄参科牛麦草属 *Melampyrum* 的野生林地植物），开小黄花；过去人们以为牛会吃它或它会影响牛奶，常见于欧洲。"},"examples":[{"en":"We saw cow-wheat growing along the shady edge of the forest.","zh":"我们在森林阴凉的边缘看到牛麦草在生长。"},{"en":"Cow-wheat is a common name for several *Melampyrum* species.","zh":"“cow-wheat”是几种牛麦草属（*Melampyrum*）植物的俗名。"}]}],"synonyms":["melampyrum","common cow-wheat","yellow cow-wheat"],"phonetic":"/ˈkaʊˌwiːt/","extraExplanation":["“cow-wheat”是复合名词：cow（牛）+ wheat（小麦）。它并不是小麦，而是野花/野草的俗名。之所以这样命名，多半与民间传说有关：有人认为它会被牛吃，或会影响牛奶的颜色与品质。","在英国与欧洲的自然写作中，cow-wheat常用来营造“林地、树荫、野花”的意象；常见的具体种类包括“common cow-wheat”（普通牛麦草）等。"]}
{"word":"cowage","summary":{"en":"Cowage is a tropical climbing plant (velvet bean) and can also mean the itchy hairs/powder from its pods.","zh":"Cowage 指一种热带攀援植物（天鹅绒豆/黧豆），也可指其荚果上的致痒刺毛或粉末。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tropical climbing plant (also called velvet bean) whose seed pods are covered with tiny hairs that can cause intense itching.","zh":"一种热带攀援植物（也叫“天鹅绒豆/黧豆”），其荚果表面有细小刺毛，接触皮肤会引起强烈瘙痒。"},"examples":[{"en":"Be careful with cowage pods—the hairs can make your skin itch for hours.","zh":"小心黧豆（cowage）的荚果——上面的细毛会让皮肤痒上好几个小时。"},{"en":"In some tropical regions, cowage grows wild along fences and trees.","zh":"在一些热带地区，黧豆会沿着篱笆和树木野生生长。"}]},{"partOfSpeech":"n.","definition":{"en":"The irritating hairs (or powder made from them) from cowage pods, used historically as an itch-producing substance.","zh":"黧豆荚果上的刺激性刺毛（或由其制成的粉末）；历史上曾被用作“致痒物”。"},"examples":[{"en":"The prank involved sprinkling a little cowage on someone’s collar.","zh":"那个恶作剧是在别人的衣领上撒了一点黧豆刺毛粉。"},{"en":"Old medical texts mention cowage as a strong skin irritant.","zh":"一些旧医学文献提到黧豆刺毛是一种很强的皮肤刺激物。"}]}],"synonyms":["velvet bean","mucuna","itching powder"],"phonetic":"/ˈkaʊ.ɪdʒ/","extraExplanation":["“cowage”在现代英语里比较少见，更常见的相关名称是“velvet bean”，学名常见为 *Mucuna pruriens*。","这种植物的荚果刺毛含有会刺激皮肤的成分，民间有时用来做恶作剧（类似“itching powder”）。接触后应避免揉搓，尽快用清水冲洗并更换衣物。"]}
{"word":"cowages","summary":{"en":"Cowages are a tropical vine (cowhage/velvet bean) and the itchy hairs from its pods.","zh":"Cowages 指一种热带藤本植物（cowhage/velvet bean）及其豆荚上会引起瘙痒的细毛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually in botany) A tropical climbing plant whose seed pods are covered with itchy hairs; mucuna (often called cowhage or velvet bean).","zh":"（多用于植物学）一种热带攀缘植物，豆荚上有会引起瘙痒的细毛；黧豆属植物（常称 cowhage 或 velvet bean）。"},"examples":[{"en":"Cowages grow in warm climates and can climb over fences and trees.","zh":"Cowages 生长在温暖气候中，能攀爬覆盖篱笆和树木。"},{"en":"The pods of cowages are known for their irritating hairs.","zh":"Cowages 的豆荚以其刺激皮肤的细毛而闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"The itchy hairs from the seed pods of this plant, sometimes used in prank “itching powder.”","zh":"这种植物豆荚上的致痒细毛；有时被用作恶作剧用的“痒痒粉”。"},"examples":[{"en":"The prank used cowages to make a harmless but very itchy powder.","zh":"这个恶作剧用 cowages 做成一种无害但很痒的粉末。"},{"en":"Avoid touching cowages with bare skin because the hairs can cause intense itching.","zh":"不要徒手接触 cowages，因为那些细毛会引起强烈瘙痒。"}]}],"synonyms":["cowhage","cowitch","velvet bean","mucuna"],"phonetic":"/ˈkaʊɪdʒ/","extraExplanation":["“cowages”是较少见的拼写与复数形式；更常见的拼写是“cowhage”。在现代英语里多出现在植物学、自然科普或历史语境中。","这种植物常与“velvet bean（天鹅绒豆）/ Mucuna pruriens”相关；其豆荚细毛会刺激皮肤产生明显瘙痒，因此也与“itching powder（痒痒粉）”的文化梗有关，但现实中接触可能引发不适，需避免。"]}
{"word":"cowal","summary":{"en":"“cowal” is not a standard English word; it is most likely “cowl,” meaning a hood/hooded cloak or a covering, and it can also mean “to cover with a hood.”","zh":"“cowal”不是标准英文词；最可能是“cowl”，意思是兜帽/兜帽披风或护罩，也可作动词表示“用兜帽遮住/罩住”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard) Likely a misspelling of “cowl.” A “cowl” is a hood or hooded cloak, especially one worn by monks, or a hood-like covering on clothing or equipment.","zh":"（非标准拼写）多半是 “cowl” 的误拼。“cowl” 指兜帽或带兜帽的披风（尤指修道士所穿），也可指衣物或设备上的罩盖/护罩。"},"examples":[{"en":"The monk pulled his cowl forward to hide his face.","zh":"修道士把兜帽拉到前面，遮住了脸。"},{"en":"The jacket has a deep cowl that keeps the wind out.","zh":"这件夹克有个很深的兜帽，可以挡风。"}]},{"partOfSpeech":"v.","definition":{"en":"To cover or hood something; to put a cowl on.","zh":"给某物罩上兜帽/罩盖；把……用兜帽遮住。"},"examples":[{"en":"She cowled her head with a scarf before going outside.","zh":"她出门前用围巾把头罩住。"}]}],"synonyms":["hood","cloak","covering","hooded cloak"],"phonetic":"/kaʊl/","extraExplanation":["“cowal”在现代英语里不是常见标准词汇；如果你是在阅读、听写或打字时看到/输入了它，很可能原词是“cowl”（兜帽/风帽）。","如果你想查的是专有名词（比如姓氏、地名、品牌名）“Cowal”，也可能指苏格兰的Cowal半岛（Cowal Peninsula）。你可以告诉我你看到这个词的句子，我可以帮你精确判断。"]}
{"word":"Cowan","summary":{"en":"“Cowan” is most commonly a surname. As a rare common noun (often Scottish or Masonic), “cowan” means an unqualified outsider or intruder.","zh":"“Cowan”最常见是姓氏。作为较少见的普通名词（多见于苏格兰或共济会语境），“cowan”指不合格的外行/冒牌工匠或闯入窥探者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"姓氏（家族姓）。"},"examples":[{"en":"Professor Cowan will give a talk on Friday.","zh":"Cowan 教授将于周五做讲座。"},{"en":"My neighbor’s last name is Cowan.","zh":"我邻居的姓是 Cowan。"}]},{"partOfSpeech":"n.","definition":{"en":"(Scottish, old-fashioned) an untrained or unqualified worker, especially someone who pretends to be a stonemason.","zh":"（苏格兰用法，较旧）未经训练或不合格的工人，尤指冒充石匠的人。"},"examples":[{"en":"The guild refused to hire a cowan for the job.","zh":"行会拒绝雇用不合格的冒牌工人来做这份工作。"},{"en":"He was criticized as a cowan because he had no proper training.","zh":"他因没有正规训练而被批评为“外行/冒牌工匠”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Freemasonry) a person who is not a Mason but tries to gain access to Masonic secrets or meetings; an intruder.","zh":"（共济会用语）非共济会员却试图进入会所或获取秘密的人；闯入者。"},"examples":[{"en":"They checked visitors carefully to keep out any cowans.","zh":"他们仔细核查来访者，以防闯入者混入。"},{"en":"In the novel, a cowan tries to listen outside the lodge door.","zh":"在小说里，一个外人试图在会所门外偷听。"}]}],"synonyms":["surname","outsider","intruder","impostor","unqualified worker"],"phonetic":"/ˈkaʊən/","extraExplanation":["“cowan”这个普通名词来自苏格兰英语，常带贬义，暗指“外行冒充内行”。在共济会语境中，它也指“非会员的闯入者/窥探者”。作为大写的“Cowan”更常见的是姓氏，用法上通常不需要特殊解释。"]}
{"word":"cowan","summary":{"en":"Cowan means an outsider—especially someone not initiated into Freemasonry; historically, it could also mean an untrained worker doing skilled work without proper training.","zh":"Cowan 指“外人”，尤指共济会中未入会或未正式受礼的人；历史上也可指未经训练却从事技术活的工人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in Freemasonry) a person who is not a member or who is not properly initiated; an outsider.","zh":"（尤指共济会中）未入会或未正式受礼的人；外人。"},"examples":[{"en":"The lodge rules said that no cowan could attend the meeting.","zh":"会所的规章规定外人（cowan）不得参加会议。"},{"en":"He worried that a cowan might overhear their private discussion.","zh":"他担心会有外人（cowan）偷听他们的私下谈话。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) an untrained or unqualified worker, especially someone doing a skilled trade without proper training (such as stonework).","zh":"（历史用法）未经训练或不合格的工人；尤指未受正规训练却从事技术工种（如石工）的人。"},"examples":[{"en":"The guild tried to keep cowans from doing work reserved for trained masons.","zh":"行会试图阻止那些未受训的外行（cowan）去做只属于合格石匠的工作。"}]}],"synonyms":["outsider","nonmember","intruder","uninitiated person"],"phonetic":"/ˈkaʊən/","extraExplanation":["“cowan”最常见于共济会（Freemasonry）语境，带有“非成员/未受入会仪式者”的含义，常用于强调“圈内”与“圈外”的界限。日常英语里很少使用，更多见于历史、文学或讨论共济会文化的文章中。","词源一般认为与苏格兰英语有关，早期可指“未经正规训练的石匠/做粗活的人”，后来在共济会语境中固定为“未入会者”。"]}
{"word":"Cowanesque","summary":{"en":"Cowanesque is a U.S. place name, especially a community and a river in northern Pennsylvania.","zh":"Cowanesque 是美国地名，尤指宾夕法尼亚州北部的一个社区及同名河流。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name in the United States, most commonly referring to Cowanesque (a community) and Cowanesque River in northern Pennsylvania.","zh":"美国的地名，最常见指宾夕法尼亚州北部的 Cowanesque（社区）以及 Cowanesque River（科瓦内斯克河）。"},"examples":[{"en":"We drove through Cowanesque on our way to Wellsboro, Pennsylvania.","zh":"我们去宾夕法尼亚州威尔斯伯勒的路上经过了 Cowanesque。"},{"en":"Fishing is popular along parts of the Cowanesque River.","zh":"在科瓦内斯克河的部分河段钓鱼很受欢迎。"}]}],"phonetic":"/ˌkoʊwəˈnɛsk/","extraExplanation":["这是一个源自美洲原住民语言的地名（常见于宾州许多河流与城镇名），具体词源在不同资料里可能有差异。学习时可把它当作专有名词：一般不翻译，只在中文里按音译或直接保留英文拼写。","读法上通常重音在第三音节附近：co-wan-ESK。地图、路牌、新闻中出现时，往往和 Pennsylvania（宾夕法尼亚州）、Tioga County（泰奥加县）或 Cowanesque River 一起出现。"]}
{"word":"Cowansville","summary":{"en":"Cowansville is a town in Quebec, Canada.","zh":"Cowansville 是加拿大魁北克省的一个城镇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A town in Quebec, Canada (in the Eastern Townships region), known for its small-town character and surrounding countryside.","zh":"加拿大魁北克省的一个城镇（位于“东部乡镇”地区），以小镇氛围与周边乡村景致闻名。"},"examples":[{"en":"Cowansville is about an hour’s drive from Montreal.","zh":"Cowansville 距离蒙特利尔开车大约一小时。"},{"en":"She grew up in Cowansville before moving to the city for university.","zh":"她在 Cowansville 长大，后来为了上大学搬到城市。"}]}],"phonetic":"/ˈkaʊənzˌvɪl/","extraExplanation":["“Cowansville”是专有名词（地名），通常首字母大写；写作中可直接当作地点使用，例如“in Cowansville / from Cowansville”。","它位于魁北克省的Estrie（Eastern Townships，东部乡镇）一带；该地区历史上与英法移民、双语文化背景有关，因此你可能会在英文与法文语境中同时看到这个地名。"]}
{"word":"coward","summary":{"en":"“Coward” means a person who lacks courage and avoids danger because of fear.","zh":"“coward”指因害怕而缺乏勇气、逃避危险或困难的人（语气较重）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is not brave; someone who is too afraid to face danger or difficulty","zh":"懦夫；胆小鬼：不勇敢的人；因害怕而不敢面对危险或困难的人"},"examples":[{"en":"He felt like a coward for not speaking up when his friend was bullied.","zh":"朋友被欺负时他没有站出来说话，觉得自己像个懦夫。"},{"en":"Calling someone a coward is a strong insult in many cultures.","zh":"在很多文化里，说别人是“懦夫”是一种很重的侮辱。"}]}],"synonyms":["scaredy-cat","wimp","weakling"],"phonetic":"/ˈkaʊ.ɚd/","extraExplanation":["“coward”语气很重，常带羞辱或道德评判；日常更委婉可说：not brave, afraid, hesitant。","固定搭配：a coward at heart（本性胆小）；act like a coward（像懦夫一样行事）。","相关词：courage（勇气，名词）；cowardly（胆小的，形容词）。注意：cowardly是形容词，coward是名词。"]}
{"word":"cowardice","summary":{"en":"Cowardice means a lack of courage—being too afraid to face danger or difficulty.","zh":"Cowardice 指“缺乏勇气/怯懦”，因害怕而不敢面对危险或困难。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Lack of courage; the habit of being too afraid to face danger, difficulty, or pain.","zh":"怯懦；胆小怕事（因害怕而不敢面对危险、困难或痛苦的状态或习惯）。"},"examples":[{"en":"He was ashamed of his cowardice during the fire drill.","zh":"他为自己在消防演习中的怯懦感到羞愧。"},{"en":"Cowardice often comes from fear of failure or rejection.","zh":"怯懦常常源于对失败或被拒绝的恐惧。"},{"en":"She saw leaving the team without explanation as an act of cowardice.","zh":"她认为不作解释就离开团队是一种怯懦的行为。"}]}],"synonyms":["timidity","fearfulness","pusillanimity","spinelessness"],"phonetic":"/ˈkaʊɚdɪs/","extraExplanation":["“cowardice”通常带有强烈的道德批评色彩，语气比“fear（害怕）”更重，常用于评价行为或人格。更中性、体贴的表达可以用“lack of confidence（缺乏自信）”“hesitation（犹豫）”“anxiety（焦虑）”。","词根关联：coward（懦夫）+ -ice（名词后缀，表示状态/性质），类似：justice（正义）、service（服务）。","文学/文化中常见对比：cowardice vs. courage（勇气）。例如许多战争题材或英雄故事会用“cowardice”来突出人物在关键时刻的退缩与内心冲突。"]}
{"word":"cowardices","summary":{"en":"“Cowardices” means multiple acts or instances of cowardice.","zh":"“cowardices”指多次或多件懦弱（胆怯）的行为/表现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural of cowardice; repeated cases or acts of lacking courage (often used to criticize someone’s behavior)","zh":"cowardice 的复数；多次/多件“懦弱、胆怯”的表现（常用于批评某人的行为）"},"examples":[{"en":"History remembers both acts of bravery and cowardices.","zh":"历史既会记住勇敢的行为，也会记住那些懦弱之举。"},{"en":"He apologized for the cowardices he showed when his friends needed him.","zh":"他为朋友需要他时自己表现出的懦弱道了歉。"}]}],"synonyms":["acts of cowardice","instances of cowardice","cravenness","timidity (in behavior)"],"phonetic":"ˈkaʊərdɪs","extraExplanation":["“cowardice”通常是不可数名词（表示一种性格/品质），更常见说法是：cowardice（不可数）或 acts of cowardice。使用复数“cowardices”时，强调“多次懦弱行为/具体事件”，语气往往更强烈、更带批评。"]}
{"word":"cowardish","summary":{"en":"Cowardish means showing a lack of courage; it is uncommon today and is usually replaced by cowardly.","zh":"cowardish 指胆怯、缺乏勇气；现代用法较少，通常用 cowardly 代替。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Showing fear or a lack of courage in a way that seems unpleasant or shameful (often used to criticize someone’s behavior).","zh":"（常带批评）胆怯的、懦弱的；表现出令人反感或可耻的缺乏勇气。"},"examples":[{"en":"It was cowardish to blame others for your mistake instead of apologizing.","zh":"把错误怪到别人身上而不道歉，这种做法很懦弱。"},{"en":"He made a cowardish excuse to avoid the difficult conversation.","zh":"他找了个很怯懦的借口来逃避那场艰难的谈话。"}]}],"synonyms":["cowardly","timid","craven","spineless"],"phonetic":"/ˈkaʊ.ɚ.dɪʃ/","extraExplanation":["“cowardish”在现代英语中并不常见，更常用的是“cowardly”。“cowardish”听起来更像临时造词或较旧/较文学化的用法，语气通常带贬义，用来强调“像懦夫一样”。","词形上，“-ish”常表示“有点……的/带……特征的”（如 childish=孩子气的），所以“cowardish”字面是“带有懦夫特征的”。在正式写作或日常交流中，用“cowardly”更自然。"]}
{"word":"cowardize","summary":{"en":"Cowardize is a rare verb meaning “to make someone cowardly” or “to act like a coward.”","zh":"Cowardize 是个罕用动词，表示“使人变得懦弱”或“表现得像懦夫”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare) To make someone cowardly; to weaken someone’s courage.","zh":"（罕用）使某人变得懦弱；削弱某人的勇气。"},"examples":[{"en":"Constant humiliation can cowardize even confident people.","zh":"长期的羞辱甚至会让原本自信的人变得懦弱。"},{"en":"The leader’s threats were meant to cowardize the witnesses into silence.","zh":"那位领导的威胁意在把证人吓得不敢出声。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Rare) To behave like a coward; to lose courage and avoid action.","zh":"（罕用）表现得像懦夫；胆怯退缩、逃避行动。"},"examples":[{"en":"He cowardized when it was time to speak up.","zh":"轮到他站出来发声时，他却退缩了。"},{"en":"Don’t cowardize—ask for help if you need it.","zh":"别退缩——需要的话就求助。"}]}],"synonyms":["intimidate","demoralize","discourage","chicken out","back down","cower"],"phonetic":"/ˈkaʊ.ɚd.aɪz/","extraExplanation":["“cowardize”在现代英语中非常少见，很多母语者也不常用。更常见、更自然的表达包括：\n- 使人变得胆怯：“make someone (feel) afraid / intimidate / demoralize”\n- 行为懦弱：直接用“act like a coward / chicken out / back down”。\n在写作或正式表达中，用更常见的动词通常更清晰。"]}
{"word":"cowardliness","summary":{"en":"Cowardliness means a lack of courage—being fearful and avoiding difficult or risky situations.","zh":"Cowardliness 指“缺乏勇气/胆怯”，即害怕并回避困难或有风险的情境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"lack of courage; a tendency to be afraid and avoid danger, pain, or difficulty","zh":"懦弱；胆怯；缺乏勇气，倾向于害怕并回避危险、痛苦或困难"},"examples":[{"en":"He was ashamed of his cowardliness and wished he had spoken up.","zh":"他为自己的懦弱感到羞愧，希望当时能站出来说话。"},{"en":"Cowardliness can look like staying silent when someone is being bullied.","zh":"懦弱有时表现为看到别人被欺负却保持沉默。"},{"en":"The story contrasts her bravery with his cowardliness.","zh":"这个故事用她的勇敢来对比他的胆怯。"}]}],"synonyms":["cowardice","timidity","fearfulness","cravenness"],"phonetic":"/ˈkaʊ.ɚd.li.nəs/","extraExplanation":["“cowardliness”是名词，意思接近“缺乏勇气的状态/表现”。日常更常用的词是“cowardice”（更正式/常见），形容词是“cowardly”（胆小的、懦弱的）。","语气与评价：这个词通常带有强烈的负面评判，用来指责某人的行为或性格；在较敏感的情境中，也可以改用更中性的表达，比如“fear,” “anxiety,” “hesitation,” 或“lack of confidence”（恐惧/焦虑/犹豫/缺乏自信）。"]}
{"word":"cowardly","summary":{"en":"Cowardly means lacking courage; it describes a person or action seen as fearfully avoiding risk or responsibility.","zh":"Cowardly 指缺乏勇气，形容人或行为因害怕而逃避风险或责任，常带负面评价。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Fearful and not brave; avoiding danger or difficulty in a way people judge as lacking courage.","zh":"胆小的；怯懦的；因害怕而逃避危险或困难（常带负面评价）。"},"examples":[{"en":"It was cowardly to abandon your friends when they needed you.","zh":"朋友需要你的时候你却离开，这很怯懦。"},{"en":"He gave a cowardly excuse and refused to apologize.","zh":"他找了个胆怯的借口，拒绝道歉。"},{"en":"She felt ashamed of her cowardly reaction during the emergency.","zh":"在紧急情况下她的怯懦反应让她感到羞愧。"}]},{"partOfSpeech":"adj.","definition":{"en":"Showing a lack of courage; timid or easily frightened (sometimes used to describe actions, not just people).","zh":"表现出缺乏勇气的；畏缩的；容易受惊的（也可形容行为而不只形容人）。"},"examples":[{"en":"The attack was cowardly because it targeted people who couldn’t defend themselves.","zh":"这次袭击很卑怯，因为它针对的是无法自卫的人。"},{"en":"Don’t make a cowardly choice just to avoid a hard conversation.","zh":"别为了躲开艰难的谈话而做出怯懦的选择。"}]}],"synonyms":["timid","fearful","craven","spineless","chickenhearted"],"phonetic":"/ˈkaʊərdli/","extraExplanation":["“cowardly”通常带有强烈的道德评判色彩，比“afraid / scared”（只是“害怕”）更指责人“缺乏勇气”。描述行为时也很常见，如“a cowardly act”。在更中性的表达中，可以用“timid”（偏“胆怯/羞怯”）或“hesitant”（偏“犹豫”）来弱化指责。"]}
{"word":"cowardness","summary":{"en":"“Cowardness” means a lack of courage, but “cowardice” is the more common word.","zh":"“cowardness”表示“怯懦、缺乏勇气”，但更常用、更地道的说法是“cowardice”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Lack of courage; fearfulness that makes someone avoid danger, difficulty, or responsibility.","zh":"怯懦；缺乏勇气；因害怕而逃避危险、困难或责任的状态。"},"examples":[{"en":"He regretted his cowardness and apologized for not speaking up.","zh":"他后悔自己的怯懦，并为没有站出来发声而道歉。"},{"en":"She saw his silence as cowardness, but he said he was trying to stay safe.","zh":"她把他的沉默看作怯懦，但他说自己是在尽量保证安全。"}]}],"synonyms":["cowardice","timidity","fearfulness"],"phonetic":"/ˈkaʊ.ɚd.nəs/","extraExplanation":["“cowardness”在英语里能被理解，但更常见、更自然的名词是“cowardice”。写作或正式场合一般用“cowardice”。例如：His cowardice disappointed his friends.（他的怯懦让朋友失望。）","语气提示：评价别人“cowardice/cowardness”通常比较强烈、带指责意味；更中性的表达可以用“fear”/“anxiety”/“lack of confidence”（恐惧/焦虑/缺乏自信）来描述感受或原因。"]}
{"word":"cowards","summary":{"en":"“Cowards” means people who are not brave; the plural form of “coward.”","zh":"“cowards”意为“懦夫；胆小鬼”，是“coward”的复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “coward”: people who are not brave; people who avoid danger or difficulty because of fear.","zh":"“coward”的复数：懦夫；胆小鬼（因害怕而逃避危险或困难的人）。"},"examples":[{"en":"The bullies called anyone who disagreed with them cowards.","zh":"那些霸凌者把任何不同意他们的人都骂成懦夫。"},{"en":"She refused to say they were cowards, because she knew they were terrified.","zh":"她拒绝说他们是懦夫，因为她知道他们是真的很害怕。"},{"en":"History often remembers leaders who ran away as cowards.","zh":"历史常把逃跑的领导者记作懦夫。"}]}],"synonyms":["wimps","weaklings","chickens (informal)","quitters (informal)"],"phonetic":"/ˈkaʊɚdz/","extraExplanation":["“coward”既可以作名词（懦夫），也可以作形容词（胆小的，如 a coward act=怯懦的行为）。但“cowards”通常只作名词复数使用。","语气提示：coward/cowards 是较强的贬义词，直接对别人说可能很冒犯；更中性的说法有 scared, afraid, not ready, lacking confidence 等。"]}
{"word":"cowardy","summary":{"en":"Cowardly means not brave; it can describe a person/action (adj.) or the way someone acts (adv.).","zh":"Cowardly 表示“不勇敢、懦弱的”；既可作形容词描述人/行为，也可作副词描述做事方式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a person or action) lacking courage; showing fear in a shameful way.","zh":"（指人或行为）胆小的；懦弱的；因害怕而显得可耻的。"},"examples":[{"en":"It was cowardly to blame someone else for your mistake.","zh":"把错误怪到别人身上是很懦弱的做法。"},{"en":"He felt ashamed of his cowardly reaction.","zh":"他为自己懦弱的反应感到羞愧。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a fearful, not brave way.","zh":"胆怯地；不勇敢地。"},"examples":[{"en":"The attacker cowardly ran away when people shouted.","zh":"当人们大喊时，袭击者胆怯地逃跑了。"}]}],"synonyms":["timid","fearful","spineless","craven"],"phonetic":"/ˈkaʊɚdli/","extraExplanation":["“cowardy”一般被视为“cowardly”的拼写错误或非标准用法。标准拼写是：cowardly。","词根提示：coward（懦夫）+ -ly（构成形容词/副词）→ cowardly（懦弱的/胆怯地）。","语气提醒：cowardly是强烈的批评词，带道德评价；如果想更委婉，可用“timid”（胆怯的）或“fearful”（害怕的）。"]}
{"word":"Cowarts","summary":{"en":"“Cowarts” is usually a misspelling of “coward” (or plural “cowards”), meaning a person (or behavior) that is not brave and avoids danger out of fear.","zh":"“Cowarts” 通常是 “coward”（或复数 “cowards”）的拼写错误，意思是因害怕而不勇敢、回避危险的“懦夫/胆小的人”，也可形容“怯懦的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is not brave and avoids danger or difficulty because of fear","zh":"懦夫；胆小的人（因害怕而回避危险或困难）"},"examples":[{"en":"Don’t call him a coward—he’s just scared.","zh":"别叫他懦夫——他只是害怕。"},{"en":"She refused to be a coward and spoke up in the meeting.","zh":"她拒绝当胆小的人，在会议上勇敢发言。"},{"en":"In many stories, the coward learns to be brave.","zh":"在很多故事里，胆小的人会学会勇敢。"}]},{"partOfSpeech":"adj.","definition":{"en":"not brave; showing fear and avoiding risk","zh":"胆小的；怯懦的（表现出害怕并回避风险）"},"examples":[{"en":"That was a coward act: lying to avoid responsibility.","zh":"那是个怯懦的行为：为了逃避责任而撒谎。"},{"en":"He made a coward choice and left his friend alone.","zh":"他做了个胆小的选择，把朋友丢下不管。"}]}],"synonyms":["wimp","chicken","scaredy-cat","timid person","faintheart"],"phonetic":"/ˈkaʊ.ɚd/","extraExplanation":["你输入的 “Cowarts” 常见是拼写错误，正确拼法通常是 **cowards**（coward 的复数）或 **coward**（单数）。","用法提示：**coward** 多用于批评或强烈评价，语气可能很伤人。更中性的说法有 **not brave**, **afraid**, **scared**。"]}
{"word":"cowbane","summary":{"en":"Cowbane is a poisonous plant that is dangerous—sometimes deadly—to cows and other livestock.","zh":"cowbane 指对牛等牲畜有毒、可能致命的植物（常为某些毒芹类植物的俗称）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a poisonous plant (often hemlock water-dropwort or related species) that can kill cows and other livestock if eaten","zh":"牛毒草；（常指水芹毒草/毒水芹等）一种有毒植物，牛等牲畜误食可致死"},"examples":[{"en":"Farmers removed cowbane from the pasture to protect the herd.","zh":"农民把牧场里的牛毒草清除掉，以保护牛群。"},{"en":"The vet suspected cowbane poisoning after the cows began to stagger and collapse.","zh":"牛开始摇晃、倒地后，兽医怀疑是牛毒草中毒。"}]}],"synonyms":["poisonous plant","hemlock (in some contexts)","water hemlock (in some contexts)"],"phonetic":"/ˈkaʊˌbeɪn/","extraExplanation":["“cowbane”由 cow（牛）+ bane（祸害、致命之物）构成，是一种“俗名/民间名”，并不对应唯一的单一物种；在不同地区可能指不同的有毒植物（常见与毒芹类、毒水芹类相关）。阅读资料或野外识别时，最好结合拉丁学名（scientific name）确认具体是哪一种。","在文学或叙述性写作中，bane 常被用作带有强烈否定色彩的词根/词语，如 “the bane of my life”（我人生中的祸害/克星）。因此 cowbane 也带有明显的“对牛致命的东西”的语感。"]}
{"word":"cowbanes","summary":{"en":"Cowbanes = the plural of cowbane, a poisonous plant harmful to livestock.","zh":"cowbanes 是 cowbane 的复数，指对牲畜（尤其牛）有毒的植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a poisonous plant (often referring to water hemlock) that can harm or kill livestock if eaten; “cowbanes” is the plural form.","zh":"一种有毒植物（常指毒芹/水毒芹一类，如 water hemlock），牲畜误食可能中毒甚至死亡；“cowbanes”为其复数形式。"},"examples":[{"en":"Ranchers tried to clear cowbane from the wet pasture to protect the cattle.","zh":"牧场主试着把潮湿牧场里的牛毒草清除掉，以保护牛群。"},{"en":"The guide warned us not to touch wild plants like cowbane near the stream.","zh":"向导提醒我们不要碰溪边像牛毒草这样的野生植物。"}]}],"synonyms":["water hemlock","poison hemlock (sometimes, regionally)"],"phonetic":"/ˈkaʊˌbeɪn/","extraExplanation":["“cowbane”由 cow（牛）+ bane（祸害、克星）构成，字面意思是“对牛有害的东西”。在不同地区，它可能被用来指不同的有毒野草，但常见的对应是 water hemlock（毒芹类），属于非常危险的植物。","如果你是在文学或历史语境中看到 cowbane，它通常用来营造“荒野/沼泽地带的危险”或“自然中的隐患”这类氛围。"]}
{"word":"cowbarn","summary":{"en":"A cow barn is a farm building where cows are kept and cared for.","zh":"cow barn 指饲养和照料牛的农用建筑（牛棚/牛舍）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a barn (farm building) used to keep cows, store their feed, and sometimes milk them","zh":"牛棚；牛舍（用来饲养奶牛/肉牛、存放饲料，有时也用于挤奶的农用建筑）"},"examples":[{"en":"The cows stay in the cow barn at night to keep warm.","zh":"晚上牛待在牛棚里取暖。"},{"en":"We cleaned the cow barn before the vet arrived.","zh":"兽医来之前，我们把牛棚打扫了一遍。"},{"en":"The smell near the cow barn can be strong in summer.","zh":"夏天牛棚附近的味道可能会很重。"}]}],"synonyms":["cow shed","cowshed","dairy barn","barn"],"phonetic":"/ˈkaʊˌbɑrn/","extraExplanation":["“cow barn”更常见的写法是分开写；也有人写作“cowbarn”或用连字符“cow-barn”，但在一般英语写作中“cow barn”最自然。","在北美农业语境中，现代奶牛场常用“dairy barn”（奶牛棚/挤奶牛舍）；更具体的挤奶区域也可叫“milking parlor”（挤奶厅）。"]}
{"word":"cowbell","summary":{"en":"A cowbell is either a bell worn by a cow or a bell-shaped percussion instrument used in music.","zh":"cowbell 指牛脖子上戴的牛铃，也指音乐中使用的铃形打击乐器“牛铃”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A bell worn on a cow’s neck so people can hear and find the animal, especially when it is grazing.","zh":"（系在牛脖子上的）牛铃；牛颈铃，用来让人听到并找到放牧中的牛。"},"examples":[{"en":"The farmer put a cowbell on the lead cow so the herd was easier to track.","zh":"农夫把牛铃系在领头牛身上，这样更容易追踪整群牛。"},{"en":"We could hear the soft cowbell ringing from the hillside.","zh":"我们能听到山坡上传来轻轻的牛铃声。"}]},{"partOfSpeech":"n.","definition":{"en":"A handheld percussion instrument shaped like a bell, used in many styles of music (for example, Latin and rock).","zh":"（打击乐器）牛铃，一种手持敲击的金属铃形乐器，常见于拉丁音乐和摇滚等。"},"examples":[{"en":"The percussionist added a bright cowbell rhythm to the song.","zh":"打击乐手给这首歌加上了明亮的牛铃节奏。"},{"en":"In salsa bands, cowbell patterns help drive the groove.","zh":"在萨尔萨乐队里，牛铃的节奏型能推动整体律动。"}]}],"synonyms":["bell","cattle bell","percussion bell"],"phonetic":"/ˈkaʊˌbɛl/","extraExplanation":["“cowbell”在英语文化里还有个流行梗：美国喜剧节目《Saturday Night Live》里有段经典短剧《More Cowbell》（2000），让“more cowbell（再来点牛铃）”变成一种幽默说法，意思是“再加点劲/再加点某种元素让它更带感”。"]}
{"word":"cowbells","summary":{"en":"Cowbells are bells associated with cows—either real bells worn by animals or the metal percussion instrument used in music.","zh":"Cowbells 指与牛有关的铃：既可指牛脖子上的铃铛，也可指音乐中的金属牛铃打击乐器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A bell worn around a cow’s (or other grazing animal’s) neck so people can hear where it is.","zh":"（牛或其他放牧动物）脖子上戴的铃铛，用来通过声音判断动物的位置。"},"examples":[{"en":"The hikers heard cowbells in the distance and realized they were near a pasture.","zh":"徒步者听到远处的牛铃声，意识到他们靠近一片牧场。"},{"en":"Farmers use cowbells to help find animals in fog or at night.","zh":"农民会用牛铃帮助在大雾或夜晚寻找动物。"}]},{"partOfSpeech":"n.","definition":{"en":"(Music) A percussion instrument—often a metal bell—hit with a stick to make a sharp, ringing sound.","zh":"（音乐）一种打击乐器——通常是金属铃形器——用棒敲击发出清脆的金属响声。"},"examples":[{"en":"The song’s rhythm is driven by cowbells and drums.","zh":"这首歌的节奏由牛铃和鼓推动。"},{"en":"In some Latin music, the cowbell keeps a steady beat.","zh":"在一些拉丁音乐里，牛铃负责保持稳定的节拍。"}]}],"synonyms":["bells","percussion (music)","animal bell"],"phonetic":"/ˈkaʊbɛlz/","extraExplanation":["“cowbell”最初指真实给牛戴的铃，后来也指外形类似的打击乐器。音乐里的cowbell常见于拉丁音乐、放克（funk）和摇滚等风格。","拼写与数：单数 cowbell；复数 cowbells。发音重音通常在前：COW-bell。"]}
{"word":"cowberries","summary":{"en":"Cowberries are small red lingonberries often used in Nordic cooking, especially in jams and sauces.","zh":"Cowberries 指小红色的越橘（常同 lingonberry），常用于北欧料理中的果酱和酱汁。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small red berry (lingonberry) that grows on low evergreen shrubs, especially in northern Europe and other cold regions; often used in jams, sauces, and desserts","zh":"越橘；红莓（常指北欧常见的 lingonberry），一种长在低矮常绿灌木上的小红果，常用于果酱、酱汁和甜点"},"examples":[{"en":"In Sweden, people often serve cowberries with meatballs.","zh":"在瑞典，人们常把越橘酱配着肉丸一起吃。"},{"en":"She made a tart jam from wild cowberries.","zh":"她用野生越橘做了酸甜的果酱。"}]}],"synonyms":["lingonberries","lingonberry"],"phonetic":"/ˈkaʊˌbɛriz/","extraExplanation":["“cowberry”在英式英语中常见；美式英语里更常听到“lingonberry”。两者通常指同一种或非常接近的植物果实。","在北欧饮食文化中，越橘常被做成果酱或“lingonberry sauce”，搭配野味、肉类（如麋鹿、鹿肉）或瑞典肉丸；味道偏酸，需要加糖调和。"]}
{"word":"cowberry","summary":{"en":"A cowberry is a small red berry (lingonberry), commonly used in Northern European foods like jams and sauces.","zh":"cowberry 指越橘（红越橘/lingonberry），一种小红浆果，常用于北欧的果酱和酱汁等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small red edible berry (lingonberry) from a low evergreen shrub; often used in jams, sauces, and drinks, especially in Northern Europe","zh":"越橘；一种长在低矮常绿灌木上的小型红色可食用浆果，常用于果酱、酱汁和饮品（在北欧尤为常见）"},"examples":[{"en":"In Sweden, cowberry jam is often served with meatballs.","zh":"在瑞典，越橘果酱常常和肉丸一起吃。"},{"en":"She picked cowberries in the forest and made a tart sauce.","zh":"她在森林里采了越橘，做了酸甜的酱汁。"}]}],"synonyms":["lingonberry","red whortleberry"],"phonetic":"/ˈkaʊˌbɛri/","extraExplanation":["“Cowberry”在英式英语里常指lingonberry（学名Vaccinium vitis-idaea），中文常译为“越橘/红越橘”。在北欧饮食文化中非常常见，味道偏酸，常与肉类搭配以解腻。","词源上含有“cow-”，并不是“牛吃的莓”那么简单；更多是旧称或方言用法。日常场景中，你也会看到“lingonberry”这个更国际化的说法。"]}
{"word":"cowbind","summary":{"en":"Cowbind is a common name for a twining bindweed that can tangle and smother other plants.","zh":"Cowbind 是一种会攀援缠绕、容易压制其他植物的旋花类杂草的俗称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a climbing weed (hedge bindweed) with white or pale pink trumpet-shaped flowers; often considered a troublesome plant because it wraps around and smothers other plants","zh":"（植物）田旋花/篱旋花（常见俗名 cowbind），一种会攀援缠绕的杂草，开白色或淡粉色喇叭状花；常因缠住并压制其他植物而被视为害草"},"examples":[{"en":"Cowbind can quickly cover a fence if you don’t pull it out early.","zh":"如果不早点拔掉，cowbind 很快就会爬满篱笆。"},{"en":"The gardener removed cowbind to protect the young tomatoes.","zh":"园丁清除了 cowbind，保护刚长出来的番茄苗。"}]}],"synonyms":["bindweed","hedge bindweed","wild morning-glory"],"phonetic":"/ˈkaʊ.baɪnd/","extraExplanation":["“cowbind”是英语里较少见的俗名，多见于英式用法，常指 hedge bindweed（篱旋花，学名 Calystegia sepium）。其中 bind 指“缠绕、捆住”，形象地写出它会把其他植物“缠住”的特性。"]}
{"word":"cowbinds","summary":{"en":"Cowbinds are bindweed vines (plural), known for twining growth and funnel-shaped flowers.","zh":"Cowbinds 指“缠绕生长的旋花类藤本植物”（cowbind 的复数），常开漏斗状花。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of cowbind: a climbing vine (a type of bindweed) with twining stems and funnel-shaped flowers, often found in hedges and fields and sometimes considered a weed.","zh":"cowbind 的复数：一种蔓生缠绕植物（旋花类/田旋花一类），茎会缠绕攀附，开漏斗状花，常见于篱笆和田野，有时被视为杂草。"},"examples":[{"en":"The fence was covered in cowbinds, their white flowers opening in the morning.","zh":"篱笆被 cowbinds 覆盖着，早晨时它们的白花会绽放。"},{"en":"Farmers often pull up cowbinds because the vines can choke young plants.","zh":"农民常把 cowbinds 拔掉，因为藤蔓可能会“缠死”幼苗。"}]}],"synonyms":["bindweeds","hedge bindweeds","bindweed"],"phonetic":"/ˈkaʊbaɪndz/","extraExplanation":["“cowbind”是民间俗名，常用来指 bindweed（旋花/牵牛花的近亲，常见如 hedge bindweed）。名字里的 bind 表示“缠绕、捆住”，暗示这种藤蔓会缠住其他植物；cow- 可能与其在牧场/农田常见有关。不同地区对同一类植物的俗名可能不一致。"]}
{"word":"cowbird","summary":{"en":"A cowbird is a North American bird known for laying its eggs in other birds’ nests; figuratively, it can mean a person who benefits from others without contributing.","zh":"cowbird 指一种北美牛鹂，以把蛋产在别的鸟巢里而闻名；比喻义可指借力占便宜、贡献很少的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a North American bird that often lays its eggs in other birds’ nests (a “brood parasite”), so the other birds raise the cowbird chick","zh":"一种北美鸟类（常见为牛鹂），常把蛋产在其他鸟的巢里（“巢寄生/育雏寄生”），让别的鸟代为孵化并抚养幼鸟"},"examples":[{"en":"Cowbirds often lay their eggs in the nests of smaller songbirds.","zh":"牛鹂常把蛋产在较小鸣禽的巢里。"},{"en":"The conservation group removed cowbird eggs to protect the endangered warbler.","zh":"保护组织移除牛鹂的蛋，以保护濒危的莺类。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, figurative) someone who takes advantage of others’ work or support without contributing much","zh":"（非正式、比喻）借别人之力占便宜、自己贡献很少的人"},"examples":[{"en":"He acted like a cowbird, taking credit for the team’s work.","zh":"他像只“牛鹂”一样，把团队的功劳据为己有。"},{"en":"Don’t be a cowbird—help out if you’re going to be part of the project.","zh":"别当“牛鹂”——既然加入项目就要出力。"}]}],"synonyms":["brown-headed cowbird","brood parasite","freeloader (figurative)","parasite (figurative)"],"phonetic":"/ˈkaʊ.bɝd/","extraExplanation":["“Cowbird”最常指褐头牛鹂（brown-headed cowbird）。它们常跟着牛群或野牛活动，捕食牲畜惊起的昆虫，因此得名。","牛鹂的“巢寄生”在生态学里很常被提到：它们把蛋放进别的鸟巢里，宿主鸟往往会把牛鹂雏鸟一起养大；这对某些稀有鸟种会造成压力，所以保育工作中有时会控制牛鹂数量。"]}
{"word":"cowbirds","summary":{"en":"Cowbirds are blackbirds famous for laying eggs in other birds’ nests.","zh":"Cowbirds（牛鹂）是以把卵产在其他鸟巢中、让别的鸟代孵育而著名的黑鹂科鸟类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of blackbird (family Icteridae) known for laying its eggs in other birds’ nests (brood parasitism).","zh":"一种黑鹂科鸟类（牛鹂），以把卵产在其他鸟类的巢里、让别的鸟代为孵育（巢寄生/育雏寄生）而闻名。"},"examples":[{"en":"Cowbirds often lay their eggs in the nests of smaller songbirds.","zh":"牛鹂常把卵产在体型较小的鸣禽巢里。"},{"en":"Some conservation projects try to protect endangered birds from cowbirds.","zh":"一些保护项目会设法保护濒危鸟类，避免它们受到牛鹂的影响。"}]}],"synonyms":["brown-headed cowbirds","cowbird (singular)"],"phonetic":"/ˈkaʊˌbɝdz/","extraExplanation":["“Cowbird（牛鹂）”这个名字源于它们过去常跟着牛群活动，在地面寻找被惊起的昆虫。","cowbirds 最常指“棕头牛鹂（brown-headed cowbird）”，在北美较常见。","它们的“育雏寄生”行为会让寄主鸟的雏鸟竞争不过牛鹂雏鸟，因此在生态与保育话题中经常出现。"]}
{"word":"cowboy","summary":{"en":"A cowboy is mainly a cattle worker in the American West, and the word can also mean Western style or (informally) someone reckless or unprofessional.","zh":"cowboy 主要指美国西部的“牛仔”（牧牛的人），也可指“牛仔风格”，口语中还可指“鲁莽或不专业的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person (traditionally in the American West) who takes care of cattle, usually on horseback.","zh":"（传统上指美国西部的）牛仔；放牛、看管牛群的人，常骑马工作。"},"examples":[{"en":"The cowboy rode out at dawn to check the herd.","zh":"牛仔在黎明时骑马出去查看牛群。"},{"en":"Many classic Western movies feature cowboys and wide open plains.","zh":"许多经典西部片都有牛仔和一望无际的平原。"}]},{"partOfSpeech":"n.","definition":{"en":"A style or image associated with cowboys, especially in clothing and culture (boots, hats, Western music).","zh":"牛仔风格；与牛仔形象相关的文化或穿着（如靴子、牛仔帽、西部音乐）。"},"examples":[{"en":"She wore a cowboy hat and boots for the festival.","zh":"她为节日戴了牛仔帽、穿了牛仔靴。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who behaves in a reckless, uncontrolled, or unofficial way (often criticizing unsafe behavior).","zh":"鲁莽行事的人；不按规矩、可能不安全地做事的人（常带批评意味）。"},"examples":[{"en":"Some people called him a cowboy driver because he took dangerous risks on the road.","zh":"有人说他是“鲁莽司机”，因为他在路上冒很危险的险。"}]}],"synonyms":["cowhand","ranch hand","cattle herder","wrangler"],"phonetic":"/ˈkaʊˌbɔɪ/","extraExplanation":["“Cowboy”在美国文化里常被浪漫化为“自由、独立、坚韧”的象征，这种形象在“Western（西部片）”、乡村音乐和时尚中很常见。","在英式英语里，cowboy 也常用作贬义，指“不专业、乱来的人”（如 cowboy builder 指不靠谱的施工队）。语境不同，褒贬差异很大。"]}
{"word":"cowboys","summary":{"en":"“Cowboys” is the plural of “cowboy”: a cattle herder in the American West; informally, it can also mean a reckless rule-breaker.","zh":"“cowboys”是“cowboy”的复数：指（美国西部的）牛仔；非正式语境中也可指鲁莽、不守规矩的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A cowboy is a person (traditionally in the American West) who herds and takes care of cattle, usually on horseback.","zh":"cowboy 指（传统上美国西部的）牛仔，主要负责放牧、照看牛群，通常骑马工作。"},"examples":[{"en":"Cowboys on the ranch started work before sunrise.","zh":"牧场上的牛仔天没亮就开始工作。"},{"en":"He learned to ride like a real cowboy.","zh":"他学会了像真正的牛仔一样骑马。"}]},{"partOfSpeech":"n.","definition":{"en":"In modern informal use, a cowboy can mean someone who behaves in a reckless or irresponsible way, often ignoring rules (especially in business or politics).","zh":"在现代非正式用法中，cowboy 也可指“鲁莽的人/不守规矩的人”，常暗示不负责任、无视规则（尤用于商业或政治语境）。"},"examples":[{"en":"The company fired him for being a cowboy with other people’s money.","zh":"公司因为他拿别人的钱乱来、太不负责任而解雇了他。"},{"en":"Some voters dislike cowboy politics.","zh":"一些选民不喜欢那种鲁莽的“牛仔式政治”。"}]}],"synonyms":["cattle herder","ranch hand","cowhand","wrangler"],"phonetic":"/ˈkaʊˌbɔɪ/","extraExplanation":["“Cowboy”是美国文化的重要符号：常和开阔的西部、独立精神、勇敢与自由联系在一起，因此在电影、音乐（如乡村音乐）和文学里很常见。","语感提醒：第二个“鲁莽的人”含义带明显贬义，使用时要看场合，避免无意中冒犯。"]}
{"word":"cowbrute","summary":{"en":"“cowbrute” is a very rare/nonstandard word, usually meaning a cow (harsh tone) or, as an insult, a brutish person.","zh":"“cowbrute”非常罕见/不标准，常指“牛”（语气粗硬）或作侮辱语指“粗暴的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard/rare) A cow; a bovine animal (often used in a rough, contemptuous way rather than as a neutral farm word).","zh":"（非标准/罕见）指“牛；母牛”等牛类动物（语气往往较粗鲁或带轻蔑，不如常用的 cow 中性）。"},"examples":[{"en":"The farmer led the cowbrute into the barn before the storm hit.","zh":"暴风雨来临前，农夫把那头牛赶进了牛棚。"},{"en":"In old-fashioned writing, someone might say “cowbrute” to sound harsh or mocking.","zh":"在一些旧式写法里，有人可能用“cowbrute”来制造粗硬、嘲讽的语气。"}]},{"partOfSpeech":"n.","definition":{"en":"(Insult, very rare) A person described as brutish and low, sometimes implying a cowardly bully; not common in modern English.","zh":"（侮辱语，很罕见）形容一个人粗暴卑劣，有时含“欺软怕硬的恶棍/懦弱的霸凌者”之意；现代英语中几乎不用。"},"examples":[{"en":"Don’t act like a cowbrute—apologize and fix what you broke.","zh":"别像个粗野的家伙一样——道歉并把你弄坏的东西修好。"},{"en":"The novel’s villain is painted as a cowbrute who scares others but fears real consequences.","zh":"小说把反派写成一个欺负别人却害怕真正后果的恶人。"}]}],"synonyms":["cow","bovine","brute","bully","thug"],"phonetic":"/ˈkaʊ.bɹuːt/","extraExplanation":["“cowbrute”不是现代英语里的常用词，很多情况下更可能是拼写错误、个人造词，或把“cow brute”（牛一样的畜生/粗人）连写在一起。写作或考试中建议用更常见的词：cow（牛）、brute（粗暴的人/畜生）、bully（霸凌者）、thug（暴徒）、lout（粗鲁的人）。"]}
{"word":"cowbyre","summary":{"en":"Cowbyre means a cowshed—a place where cows are kept, common in British (especially Scottish/Northern) English.","zh":"cowbyre 指“牛棚/牛舍”，在英式英语中较常见，尤其带有苏格兰与英格兰北部的地方色彩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a building or shed where cows are kept; a cowshed","zh":"牛棚；牛舍"},"examples":[{"en":"The farmer walked to the cowbyre at dawn to milk the cows.","zh":"农夫天一亮就走到牛棚去挤牛奶。"},{"en":"The old stone cowbyre was renovated into a small workshop.","zh":"那座老石头牛舍被翻修成了一个小工坊。"}]}],"synonyms":["cowshed","byre","barn (general)","cattle shed"],"phonetic":"/ˈkaʊ.baɪr/","extraExplanation":["“Cowbyre”是英式（尤其苏格兰与英格兰北部）用法，带有乡村、传统农业的语感。现代日常英语里更常见的是“cowshed”或更通用的“barn（谷仓/畜棚）”。","词源上，“byre”来自古英语/古诺斯语系，意为“牲畜棚、牛舍”。在文学或描写乡村生活的文字中，你可能会看到它用来营造地方色彩。"]}
{"word":"cowcatcher","summary":{"en":"A cowcatcher is the metal guard on the front of a train that pushes obstacles off the tracks; it can also mean a person or thing that clears the way.","zh":"cowcatcher 指火车机车前端用来推开障碍物的金属排障器；也可引申为为他人“开路清障”的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A metal frame on the front of a locomotive (train engine), shaped to push obstacles (like animals or debris) off the tracks.","zh":"（火车机车前端的）排障器；（俗称）牛挡、排牛器：一种金属框架，用来把轨道上的障碍物（如牲畜、杂物）推开。"},"examples":[{"en":"The old steam locomotive had a large cowcatcher on the front.","zh":"那台老式蒸汽机车前面有一个很大的排障器。"},{"en":"In early railroad days, cowcatchers helped clear livestock from the tracks.","zh":"在早期铁路时代，排障器有助于把牲畜从轨道上清开。"}]},{"partOfSpeech":"n.","definition":{"en":"By extension, something that leads the way and clears obstacles for a group or project.","zh":"引申义：开路先锋；清障者（指为团队或项目在前面开路、扫清阻碍的人或事物）。"},"examples":[{"en":"She acted as a cowcatcher for the team, handling problems before they reached others.","zh":"她充当团队的“开路先锋”，在问题影响到别人之前就先处理掉。"},{"en":"Good planning can be a cowcatcher that prevents small issues from becoming crises.","zh":"好的规划就像“排障器”，能防止小问题演变成危机。"}]}],"synonyms":["pilot (rail)","obstacle guard","trailblazer (figurative)","pathbreaker (figurative)"],"phonetic":"/ˈkaʊˌkætʃɚ/","extraExplanation":["“cowcatcher”这个词带有明显的历史场景：19世纪北美铁路穿越牧场与荒野，轨道上常出现牛、羊等牲畜或杂物，于是机车前方装上楔形/栅格状装置来“推开”障碍。","引申用法多见于比喻语境，强调“在前面清障、保护后方”。在正式写作中更常用“trailblazer / pathbreaker / obstacle-clearer”等表达；“cowcatcher”更有画面感，略口语化或带复古色彩。"]}
{"word":"cowcatchers","summary":{"en":"Cowcatchers are guards on the front of locomotives that push obstacles off the track; informally, it can mean people/things that clear the way by dealing with problems first.","zh":"cowcatchers 指火车机车前端用于推开轨道障碍物的排障装置；非正式用法中也可比喻为替他人先行排除麻烦、开路的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of cowcatcher) A metal guard on the front of a locomotive (train engine) that pushes obstacles off the tracks.","zh":"（cowcatcher 的复数）火车机车前端的金属护栏/排障器，用来把轨道上的障碍物推开。"},"examples":[{"en":"Old Western movies often show a steam train with cowcatchers at the front.","zh":"老西部电影里常能看到蒸汽火车前面装着牛挡/排障器。"},{"en":"The engineer checked the cowcatchers for damage after the train hit debris.","zh":"火车撞到碎片后，司机检查了前端的排障器是否受损。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, figurative) People or things that clear the way for someone else by dealing with problems first.","zh":"（非正式，比喻）为别人“开路”的人或事物，先行处理麻烦与阻碍。"},"examples":[{"en":"In negotiations, the assistant acted as a cowcatcher, handling complaints before they reached the manager.","zh":"在谈判中，助理充当“开路者”，先把抱怨处理掉，不让它们直接到经理那里。"},{"en":"Good planning can be a cowcatcher that removes obstacles early.","zh":"好的规划就像“排障器”，能提前清除障碍。"}]}],"synonyms":["pilot (figurative)","path-clearer (figurative)","obstacle remover (figurative)","locomotive guard","track deflector"],"phonetic":"/ˈkaʊˌkætʃərz/","extraExplanation":["“cowcatcher”这个词来自早期铁路时代：火车速度变快后，需要在机车前方装一个楔形或栅栏状装置，把牲畜、石块或其他杂物从轨道上推开，以减少脱轨风险。","在英美文化中，“cowcatcher”常让人联想到19世纪蒸汽机车和“西部拓荒”题材影视作品；因此它也容易被用作比喻，表示“替别人挡事/排雷/开路”的角色。"]}
{"word":"Cowden","summary":{"en":"“Cowden” is usually a surname or a place name; in medical contexts it may refer to Cowden syndrome.","zh":"“Cowden”通常是姓氏或地名；在医学语境中也可能指 Cowden 综合征。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name).","zh":"一个姓氏（家族姓）。"},"examples":[{"en":"Dr. Cowden will see you now.","zh":"Cowden 医生现在要见你。"},{"en":"Her last name is Cowden.","zh":"她的姓是 Cowden。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name, used for several towns/villages (for example in the U.K.).","zh":"一个地名，可指若干城镇/村庄（例如英国的一些地方）。"},"examples":[{"en":"They moved to Cowden for a quieter life.","zh":"他们搬到 Cowden 过更安静的生活。"},{"en":"Cowden is a small village with a local pub.","zh":"Cowden 是个小村庄，有一家当地酒吧。"}]},{"partOfSpeech":"n.","definition":{"en":"short for “Cowden syndrome,” a rare inherited condition linked to a higher risk of certain tumors/cancers.","zh":"“Cowden 综合征”的简称，一种罕见的遗传性疾病，与某些肿瘤/癌症风险升高相关。"},"examples":[{"en":"The doctor mentioned Cowden syndrome and recommended genetic counseling.","zh":"医生提到 Cowden 综合征，并建议进行遗传咨询。"},{"en":"She was tested for PTEN-related conditions such as Cowden syndrome.","zh":"她接受了与 PTEN 相关疾病（如 Cowden 综合征）的检测。"}]}],"synonyms":["Cowden syndrome (medical)"],"phonetic":"/ˈkaʊdən/","extraExplanation":["“Cowden syndrome”在医学上常与PTEN基因变异相关；日常对话里单独说“Cowden”通常是姓氏或地名。若在医疗语境听到该词，建议结合上下文确认是否指综合征，并以专业医生意见为准。"]}
{"word":"cowdie","summary":{"en":"“Cowdie” is usually a name; it isn’t a common standard English word, so its meaning depends on context.","zh":"“Cowdie”通常是人名；并非常见标准英语词，具体含义需看语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare or nonstandard word in English; most often seen as a personal name (nickname or surname) spelled “Cowdie.” It is not a common dictionary word, so meaning usually depends on the person or context.","zh":"英语里较少见、非标准的词；更多情况下作为人名（昵称或姓氏）出现，写作“Cowdie”。它不是常见词典词，因此含义通常取决于具体语境或个人用法。"},"examples":[{"en":"I got an email from someone named Cowdie.","zh":"我收到了一封来自一个叫 Cowdie 的人的邮件。"},{"en":"Cowdie is listed as a family name in that record.","zh":"在那份记录里，Cowdie 被列为姓氏。"}]}],"synonyms":["(as a name) nickname","surname"],"phonetic":"/ˈkaʊdi/","extraExplanation":["“cowdie”不是现代标准英语中的常用词。如果你是在聊天、游戏ID、方言文本或某个地区/社群里看到的，它可能是：1）人名/网名；2）自造词；3）对其他单词的误拼（例如想写某个听起来像 /ˈkaʊdi/ 的词）。\n如果你把原句发我（前后各一两句），我可以更准确判断它在你看到的语境里是什么意思。"]}
{"word":"Cowdrey","summary":{"en":"Cowdrey is mainly an English surname, and it may also refer to the famous cricketer Colin Cowdrey in sports contexts.","zh":"Cowdrey 主要是英语姓氏；在体育语境中也可能特指著名板球运动员 Colin Cowdrey。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), originally from England; used to refer to a person with this last name.","zh":"姓氏（家族姓），源自英国；用于指姓 Cowdrey 的人。"},"examples":[{"en":"My teacher, Ms. Cowdrey, is from London.","zh":"我的老师 Cowdrey 女士来自伦敦。"},{"en":"The email was signed “J. Cowdrey.”","zh":"这封邮件的署名是“J. Cowdrey”。"}]},{"partOfSpeech":"n.","definition":{"en":"(in sports history) the surname of Sir Colin Cowdrey, a famous English cricketer; sometimes mentioned in cricket writing.","zh":"（体育史）著名英国板球运动员 Colin Cowdrey 爵士的姓；在板球文章中有时会被提及。"},"examples":[{"en":"Cowdrey is remembered as one of England’s great cricket captains.","zh":"Cowdrey 被认为是英格兰最杰出的板球队长之一。"},{"en":"The commentator compared the player’s style to Cowdrey’s.","zh":"解说员把这名球员的风格和 Cowdrey 作了比较。"}]}],"phonetic":"ˈkaʊdri","extraExplanation":["“Cowdrey”主要作为专有名词使用（人名/姓氏）。在英语写作里，姓氏通常不需要加冠词（不说“the Cowdrey”来指一个人），但复数形式“the Cowdreys”可以表示“一家人”（Cowdrey 一家）。","它也可能出现在地名或机构名中，尤其作为英国姓氏的变体拼写（与一些类似拼写的英国地名/姓氏有关）。"]}
{"word":"cowdriosis","summary":{"en":"Cowdriosis is a tick-borne disease of ruminants, also known as heartwater.","zh":"Cowdriosis 指反刍动物的蜱传播疾病，也叫“心水病”（heartwater）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tick-borne infectious disease of cattle and other ruminants (also called heartwater), caused by the bacterium Ehrlichia ruminantium, common in parts of Africa and some tropical regions","zh":"（牛等反刍动物的）蜱传播传染病（亦称“心水病”heartwater），由反刍动物埃里希体（Ehrlichia ruminantium）引起，常见于非洲及部分热带地区"},"examples":[{"en":"In some regions, cowdriosis is controlled by tick management and careful animal movement.","zh":"在一些地区，牛心水病（cowdriosis）的控制主要依靠防蜱管理和谨慎调运牲畜。"},{"en":"Veterinarians may suspect cowdriosis when a goat has fever and neurological signs after heavy tick exposure.","zh":"当山羊在大量蜱叮咬后出现发热和神经症状时，兽医可能会怀疑是牛心水病（cowdriosis）。"}]}],"synonyms":["heartwater","heartwater disease","ehrlichiosis (ruminants)"],"phonetic":"/ˌkaʊˌdriˈoʊsɪs/","extraExplanation":["“cowdriosis”这个词来自旧的分类名称 Cowdria ruminantium（后来多归入 Ehrlichia ruminantium），因此在较新的资料中你也会更常看到“heartwater”或“ehrlichiosis (of ruminants)”等说法。","它主要是兽医学/畜牧业用语，日常英语里很少使用；写作或检索资料时，搭配关键词“heartwater disease”通常更容易找到信息。"]}
{"word":"cowed","summary":{"en":"“Cowed” describes someone who is intimidated into submission; it is also the past form of the verb “cow” meaning to bully or frighten someone into obeying.","zh":"“cowed”指因恐惧或威逼而畏缩、屈服；也可作动词“cow（恐吓、威逼）”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"frightened or intimidated into obedience; lacking confidence because someone has scared or pressured you","zh":"被吓住的；被威逼而屈服的；因恐惧或压力而显得畏缩、没信心的"},"examples":[{"en":"He looked cowed after the boss yelled at him in front of everyone.","zh":"老板当众对他大吼之后，他看起来被吓住了。"},{"en":"The cowed puppy hid under the table when it heard thunder.","zh":"小狗听到雷声后被吓得躲到桌子底下。"},{"en":"She refused to be cowed by their threats and kept speaking up.","zh":"她拒绝被他们的威胁吓倒，仍然继续发声。"}]},{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of “cow”: to intimidate or frighten someone into submission","zh":"“cow”的过去式/过去分词：恐吓或威逼某人使其屈服"},"examples":[{"en":"They tried to cow him into silence.","zh":"他们试图恐吓他，让他闭嘴。"},{"en":"The critics were not cowed by the angry comments online.","zh":"批评者没有被网上的愤怒言论吓倒。"}]}],"synonyms":["intimidated","bullied","daunted","subdued","cowed down"],"phonetic":"/kaʊd/","extraExplanation":["“cowed”常用来形容人在权威、威胁、霸凌或强势气场下变得畏缩、不敢反抗。它的核心语气比“scared”更强调“被压制到顺从”。","注意不要和名词“cow（奶牛）”混淆：这里的动词 cow（恐吓）来源于古英语/古诺斯语中“使人像牛一样低头”的意象（强调压制与驯服）。","常见搭配：be cowed by（被……吓住/压制）、cow someone into doing something（威逼某人做某事）。"]}
{"word":"cowedly","summary":{"en":"“Cowedly” means “in a frightened, intimidated way.”","zh":"“cowedly”表示“怯懦地、畏缩地（因受威吓而胆怯）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a timid, fearful, or intimidated way; lacking confidence because you feel frightened or overpowered.","zh":"怯懦地；畏缩地；因害怕或被压制而缺乏自信地。"},"examples":[{"en":"He spoke cowedly when the manager criticized him.","zh":"经理批评他时，他怯怯地说话。"},{"en":"The child looked cowedly at the barking dog.","zh":"孩子怯生生地看着那只吠叫的狗。"},{"en":"She nodded cowedly and stepped back.","zh":"她怯怯地点了点头，然后后退了一步。"}]}],"synonyms":["timidly","fearfully","meekly","submissively","cringingly"],"phonetic":"/ˈkaʊdli/","extraExplanation":["“cowedly”来自动词“to cow”，意思是“威吓、使畏缩”。它常用于书面语或较正式的叙述中，表达一种被压迫后的胆怯姿态。","学习提示：不要和“cow”（奶牛）混淆；这里的“cow”是动词，发音相同但含义不同。更常见的搭配是形容词“cowed”或短语“be cowed into (doing) something”（被吓得只好去做某事）。"]}
{"word":"coween","summary":{"en":"“coween” is not a standard modern English word; it’s likely a misspelling or a name. Context is needed to identify the intended word.","zh":"“coween”不是现代标准英语词汇；更可能是拼写错误或人名。需要上下文才能判断你想表达的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard/rare word in modern English; most learners will not encounter it in everyday reading. It is often a misspelling or mistaken hearing of a more common word (e.g., “cowing,” “Colleen,” “cuisine,” or the surname “Cowen”).","zh":"现代英语中非常少见/不规范的词；日常阅读里通常不会遇到。很多情况下它是更常见词的拼写错误或听错（例如 cowing、Colleen、cuisine，或姓氏 Cowen）。"},"examples":[{"en":"I couldn’t find “coween” in a standard dictionary—could you share the sentence you saw it in?","zh":"我在标准词典里查不到“coween”——你能把它出现的句子发我吗？"},{"en":"If you meant “cowing,” it describes intimidating someone into obedience.","zh":"如果你想写的是“cowing”，它表示用威吓让某人屈服。"}]}],"phonetic":"/koʊˈwiːn/","extraExplanation":["“coween”本身不像是常用英语词汇。最有效的办法是看上下文：它可能是（1）拼写错误；（2）人名/姓氏（如 Cowen）；（3）某个品牌名、游戏ID或网络用语。把原句贴出来，我可以帮你准确判断。","如果你是在口语里听到类似发音/koʊˈwiːn/，常见的可能目标包括：cuisine（/kwɪˈziːn/，菜系）、Colleen（/kɑˈliːn/，人名）、cowing（/ˈkaʊ.ɪŋ/，威吓）。发音接近但不完全相同，需要结合句子确认。"]}
{"word":"Cowell","summary":{"en":"Cowell is mainly used as an English surname (a family name).","zh":"Cowell 主要作为英语姓氏（家族名）使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), used for people (e.g., Simon Cowell).","zh":"考威尔（姓氏），用于指代某个家族/个人（例如：Simon Cowell 西蒙·考威尔）。"},"examples":[{"en":"Simon Cowell is a well-known TV judge.","zh":"西蒙·考威尔是一位知名的电视评委。"},{"en":"Ms. Cowell will speak at the meeting today.","zh":"考威尔女士今天会在会议上发言。"}]}],"phonetic":"/ˈkaʊ.əl/","extraExplanation":["“Cowell”主要作为英语世界的姓氏使用。日常交流中，姓氏常用于正式场合（如工作邮件、点名、介绍他人）或与头衔搭配（Mr./Ms./Dr. Cowell）。","词源上，它可能与古英语/地名或职业性称呼有关，但在现代英语里通常不需要追溯词源即可理解：把它当作专有名词（人名的一部分）即可。","文化提示：在娱乐新闻与流行文化中，“Cowell”常让人联想到电视选秀节目评委 Simon Cowell；但不特指时，它只是一个普通姓氏。"]}
{"word":"Cowen","summary":{"en":"Cowen is most commonly a surname, and it can also be a place name (notably a town in West Virginia).","zh":"Cowen 最常见作姓氏，也可作地名（尤其指西弗吉尼亚州的一个小镇）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name), found especially in English-speaking countries","zh":"姓氏（家族姓），在英语国家较常见"},"examples":[{"en":"Mr. Cowen will lead the meeting today.","zh":"Cowen 先生今天将主持会议。"},{"en":"Her last name is Cowen.","zh":"她的姓是 Cowen。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name, especially Cowen, West Virginia (a small town in the United States)","zh":"地名，尤其指美国西弗吉尼亚州的 Cowen 镇（小城镇）"},"examples":[{"en":"They drove through Cowen, West Virginia on their way south.","zh":"他们南下途中开车经过了西弗吉尼亚州的 Cowen。"}]}],"synonyms":["(surname)","(proper noun)"],"phonetic":"/ˈkaʊən/","extraExplanation":["Cowen 作为姓氏常被认为与爱尔兰/苏格兰的盖尔语姓氏有关（不同家族的来源可能不同），在英语里通常读作“COW-ən”（第一音节重读）。","英文里像 Cowen 这种专有名词（人名/地名）一般首字母大写；如果你指的是某家机构或品牌（例如公司名），也会用同样的拼写与大写形式。"]}
{"word":"cower","summary":{"en":"“Cower” means to shrink back or crouch down in fear, pain, or shame; it can also be the fearful posture itself.","zh":"“cower”指因恐惧、疼痛或羞愧而畏缩蜷缩；也可指这种畏缩的姿态。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to bend down or shrink back in fear, pain, or shame, often trying to avoid being seen or hurt","zh":"（因恐惧、疼痛或羞愧而）蜷缩、畏缩，常带有想躲开伤害或不被注意的意味"},"examples":[{"en":"The child cowered behind his mother when the dog barked.","zh":"狗一叫，孩子就躲在妈妈身后畏缩起来。"},{"en":"She cowered as the thunder crashed outside the window.","zh":"窗外雷声炸响时，她吓得缩成一团。"},{"en":"He cowered under the harsh criticism, unable to respond.","zh":"在严厉的批评下，他畏缩不前，无法回应。"}]},{"partOfSpeech":"n.","definition":{"en":"a crouching, shrinking posture that shows fear or submission","zh":"畏缩的姿势；蜷缩（表现出恐惧或屈从）"},"examples":[{"en":"The bully enjoyed seeing the cower of smaller kids.","zh":"那个霸凌者喜欢看到小孩畏缩的样子。"},{"en":"Her body fell into a cower when he raised his voice.","zh":"他一提高嗓门，她的身体就变成了畏缩的姿态。"}]}],"synonyms":["flinch","cringe","crouch","shrink back","huddle"],"phonetic":"/ˈkaʊ.ɚ/","extraExplanation":["“cower”常带有强烈的画面感：身体缩小、退后、躲避，通常是出于恐惧或受压迫时的反应。它的语气往往偏负面，暗示“被吓到/被压制”。","近义词辨析：\n- “flinch”更像是瞬间的“抽动/一缩”，常因突然的疼痛或惊吓；\n- “crouch”只是“蹲下/猫腰”的动作，不一定因为害怕；\n- “cringe”常含“尴尬、羞愧或害怕”的退缩，有时也带“觉得难堪”。"]}
{"word":"cowered","summary":{"en":"“Cowered” means “shrunk back or crouched in fear.”","zh":"“cowered”表示“因害怕而退缩、蜷缩”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to bend down or shrink back in fear or to avoid danger","zh":"（因害怕或躲避危险而）蜷缩、退缩、缩着身子"},"examples":[{"en":"The dog cowered under the table when it heard thunder.","zh":"狗听到雷声时，吓得缩在桌子底下。"},{"en":"He cowered behind the door as the shouting got louder.","zh":"随着喊叫声越来越大，他躲在门后瑟缩着。"}]}],"synonyms":["cringe","flinch","shrink back","crouch","quail"],"phonetic":"/ˈkaʊ.ɚ/","extraExplanation":["“cowered”是动词“cower”的过去式/过去分词，常用来描述一种明显的身体反应：把身体缩小、蜷起、向后退，以表达恐惧或顺从。","语气上，“cower”比“hide（躲藏）”更强调“害怕/不敢面对”，也常见于描写权力压迫、霸凌等情境。","常见搭配：cower in fear（吓得缩起来）、cower under/behind something（缩在……下面/后面）。"]}
{"word":"cowerer","summary":{"en":"A “cowerer” is a person who cowers—someone who shrinks back or hides from fear.","zh":"“cowerer”指“畏缩的人”，因恐惧而退缩或躲避的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who cowers (someone who shrinks back or hides because of fear or shame).","zh":"畏缩的人；因害怕或羞愧而退缩、躲藏的人。"},"examples":[{"en":"The bully laughed at the cowerer hiding behind the lockers.","zh":"那个霸凌者嘲笑躲在储物柜后面畏缩的人。"},{"en":"In the movie, he goes from a cowerer to someone who stands up for others.","zh":"在电影里，他从一个畏缩的人变成了会为他人挺身而出的人。"},{"en":"Don’t call her a cowerer—she was scared and needed time to feel safe.","zh":"别叫她“畏缩的人”——她只是害怕，需要时间才能感到安全。"}]}],"synonyms":["someone who cowers","frightened person","cringer","coward (stronger/insulting)"],"phonetic":"/ˈkaʊərər/","extraExplanation":["“cowerer”由动词“cower（畏缩）”加上表示“做某事的人”的后缀“-er”构成，意思直观，但在日常英语里并不算常用。更常见的表达是“someone who cowers”或更具体的描述（如“a frightened person”）。","注意语气：把人称为“cowerer”往往带有贬义或指责（暗示懦弱）。在现实交流中，描述行为（“He cowered”）通常比给人贴标签更礼貌。"]}
{"word":"cowerers","summary":{"en":"“Cowerers” means people who shrink back in fear; it often implies cowardice.","zh":"“cowerers”指因害怕而畏缩退缩的人，常暗含“懦弱/胆小”的批评意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who cower (who shrink back in fear); timid or cowardly people (often said with criticism)","zh":"会畏缩的人；因害怕而退缩的人；懦弱的人（常带批评意味）"},"examples":[{"en":"The bullies laughed at the cowerers in the corner.","zh":"恶霸嘲笑角落里那些畏缩的人。"},{"en":"He refused to be one of the cowerers and spoke up calmly.","zh":"他拒绝做一个畏缩的人，而是冷静地说了出来。"},{"en":"In the story, the hero saves the villagers, not the cowerers who hide and do nothing.","zh":"在故事里，英雄拯救的是村民，而不是那些躲起来什么也不做的畏缩者。"}]}],"synonyms":["cowards","the timid","scaredy-cats","the fearful","cravens"],"phonetic":"/ˈkaʊərərz/","extraExplanation":["“cowerers”是“cowerer”的复数；更常见的基本词是动词“to cower”（因恐惧而蜷缩/退缩）。","语气上，“cowerer(s)”通常带贬义，强调“害怕到退缩、缺乏勇气”的感觉；日常中更常用“coward(s)”或直接说“people who cower”。","词形提示：cower（v.）→ cowering（adj./现在分词，表示“畏缩的/畏缩着的”）→ cowerer（n.）。"]}
{"word":"cowering","summary":{"en":"“Cowering” describes someone shrinking back or crouching down because they feel afraid or intimidated.","zh":"“cowering”指因恐惧或被威吓而退缩、蜷缩（常呈自我保护的姿势）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"hiding or shrinking back in fear, often while trying to protect yourself.","zh":"因害怕而蜷缩、退缩或躲避，常带有自我保护的姿态。"},"examples":[{"en":"The dog was cowering under the table during the thunderstorm.","zh":"雷暴时，那只狗躲在桌子下面瑟缩着。"},{"en":"He stood cowering behind his friend when the bully approached.","zh":"恶霸走近时，他缩在朋友身后，怯怯地躲着。"},{"en":"She saw a child cowering in the corner and spoke gently to him.","zh":"她看到一个孩子蜷缩在角落里，便温柔地和他说话。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of shrinking back or lowering your body because of fear or intimidation.","zh":"（因恐惧或威吓而）退缩、蜷缩、畏缩的动作。"},"examples":[{"en":"His cowering made it clear he felt threatened.","zh":"他的畏缩表明他感到受到了威胁。"},{"en":"The teacher noticed the student's cowering and asked what was wrong.","zh":"老师注意到那名学生在畏缩，就问他怎么了。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “cower”: to shrink back or crouch down in fear.","zh":"“cower”的现在分词：因害怕而退缩或蹲伏。"},"examples":[{"en":"They were cowering in the hallway until the shouting stopped.","zh":"他们一直在走廊里蜷缩着，直到喊叫声停止。"},{"en":"The cat is cowering because it heard a loud noise.","zh":"那只猫在畏缩，因为它听到了巨响。"}]}],"synonyms":["shrinking","cringing","huddling","crouching","cowering in fear"],"phonetic":"/ˈkaʊərɪŋ/","extraExplanation":["“cower”常用来描写身体姿势上的“缩成一团/蹲伏”，带有强烈的恐惧、屈从或被威吓的感觉；语气通常偏负面，暗示对方处于弱势或被压迫。","常见搭配：cower in fear（吓得发抖/畏缩）、cower in the corner（缩在角落里）、cower behind someone（躲在某人身后）。","与“hide”相比，cower更强调“因为害怕而缩着不敢动”的姿态；与“cringe”相比，cower更像“整个人蜷缩/蹲下”，而cringe常指“本能地缩一下、退一下”或“因尴尬而退缩”。"]}
{"word":"coweringly","summary":{"en":"“Coweringly” means “in a frightened, shrinking way.”","zh":"“coweringly”意为“畏缩地、退缩地（因为害怕而缩起来的样子）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a frightened, shrinking way; as if trying to make yourself smaller to avoid danger or punishment.","zh":"以畏缩、退缩的方式；像是为了躲避危险或惩罚而把自己缩小。"},"examples":[{"en":"The dog backed away coweringly when it heard the thunder.","zh":"狗听到雷声时畏缩地往后退。"},{"en":"He spoke coweringly to his boss after making a mistake.","zh":"他犯错后对老板说话时显得很畏缩。"},{"en":"The child looked up coweringly, expecting to be scolded.","zh":"孩子畏缩地抬头看着，像是在等着挨骂。"}]}],"synonyms":["fearfully","timidly","cringingly","shrinking","abjectly"],"phonetic":"/ˈkaʊərɪŋli/","extraExplanation":["“coweringly”来自动词“to cower”（畏缩、缩成一团），常用来描写因恐惧、羞愧或压力而表现出的身体姿态或语气。它带有较强的画面感，常见于文学描写、叙事写作中，比普通的“fearfully”（害怕地）更强调“缩起来、退缩”的动作感。"]}
{"word":"cowers","summary":{"en":"“Cowers” usually means “shrinks back in fear,” describing someone or an animal crouching or acting submissively.","zh":"“cowers”通常表示“因恐惧而畏缩/蹲缩”，形容人或动物退缩、躲避，且有时带“怯懦屈服”的意味。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to crouch down or shrink back in fear, pain, or embarrassment","zh":"因害怕、疼痛或尴尬而蹲缩、畏缩（退缩）"},"examples":[{"en":"The dog cowered behind the sofa when it heard thunder.","zh":"狗听到雷声后，缩到沙发后面发抖。"},{"en":"He cowered as the bully shouted at him.","zh":"恶霸对他大吼时，他畏缩了。"}]},{"partOfSpeech":"v.","definition":{"en":"a person behaves in a fearful, submissive way (often used with disapproval)","zh":"以胆怯、卑躬屈膝的方式行事（常含贬义）"},"examples":[{"en":"She refused to cower before unfair demands.","zh":"她拒绝在不公平的要求面前低头退缩。"},{"en":"Don’t cower just because someone is loud.","zh":"别因为对方声音大就畏缩。"}]}],"synonyms":["cringe","flinch","shrink back","recoil","quail"],"phonetic":"/ˈkaʊ.ɚz/","extraExplanation":["“cowers”通常是动词“cower”的第三人称单数（He/She/It cowers）或名词“cower”的复数（较少见）。最常见的是动词用法：强调身体上的“缩成一团、往后躲”，常与 fear（恐惧）、thunder（雷声）、bully（霸凌者）等情境搭配。","语气区别：cower 比 “be afraid” 更形象、更强烈；也常带有“懦弱/屈服”的评价色彩。"]}
{"word":"Cowes","summary":{"en":"Cowes is a place name: most commonly a sailing town on the Isle of Wight in England, and also a tourist town on Phillip Island in Victoria, Australia.","zh":"Cowes 是地名：最常指英国怀特岛以帆船运动闻名的城镇；也可指澳大利亚维州菲利普岛上的旅游小镇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a town on the Isle of Wight, England, known for sailing and yachting (especially the Cowes Regatta / Cowes Week)","zh":"（英国）怀特岛上的一座城镇，以帆船与游艇运动闻名（尤其是考斯帆船周/考斯赛艇节）"},"examples":[{"en":"Cowes is famous for its sailing events every summer.","zh":"考斯以每年夏天的帆船赛事而闻名。"},{"en":"We took the ferry to the Isle of Wight and spent the afternoon in Cowes.","zh":"我们坐渡轮去了怀特岛，并在考斯度过了一个下午。"}]},{"partOfSpeech":"n.","definition":{"en":"a small town in Victoria, Australia, on Phillip Island, popular with tourists","zh":"（澳大利亚）维多利亚州菲利普岛上的一座小镇，是热门旅游地"},"examples":[{"en":"We stayed in Cowes on Phillip Island to visit the penguin parade.","zh":"我们住在菲利普岛的考斯，为了去看企鹅归巢。"}]}],"phonetic":"/kaʊz/","extraExplanation":["“Cowes”是专有名词（地名），写作首字母大写。英语里常见搭配有：Cowes Week（考斯帆船周，世界知名的帆船赛事与节庆）、Cowes Yacht Haven（游艇码头/停泊地）等。","发音是单音节，结尾是清晰的 /z/ 音，和“cows（奶牛，复数）”同音，写作与含义完全不同，阅读时要注意大小写与语境。"]}
{"word":"cowes","summary":{"en":"Cowes is a town in England on the Isle of Wight, well known for sailing, especially Cowes Week.","zh":"Cowes（考斯）是英国怀特岛上的一个城镇，以帆船运动闻名，尤其是“考斯帆船周”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a town on the Isle of Wight, England, known for sailing and yacht races (especially Cowes Week).","zh":"英国英格兰怀特岛（Isle of Wight）上的一个城镇，以帆船运动和游艇比赛闻名（尤其是 Cowes Week 考斯帆船周）。"},"examples":[{"en":"Cowes is famous for sailing events every summer.","zh":"考斯每年夏天都以帆船赛事而闻名。"},{"en":"They took a ferry to Cowes from Southampton.","zh":"他们从南安普敦坐渡轮去考斯。"},{"en":"Cowes Week attracts sailors from around the world.","zh":"考斯帆船周吸引来自世界各地的水手。"}]}],"synonyms":["(proper name; no direct synonym)"],"phonetic":"/kaʊz/","extraExplanation":["“Cowes”通常作为专有名词使用，首字母大写；在地图和交通信息中很常见（如渡轮、港口、码头）。","Cowes 与 East Cowes（东考斯）隔着梅迪纳河（River Medina）相望，两地合起来常被认为是一个重要的航海与游艇中心。","Cowes Week（考斯帆船周）是英国历史最悠久、最著名的帆船赛事之一，因此在新闻、旅游与体育语境中经常看到 “Cowes”。"]}
{"word":"Coweta","summary":{"en":"Coweta is a U.S. place name (notably in Georgia and Oklahoma) and also a historical name linked to the Muscogee (Creek) community/town.","zh":"Coweta 是美国地名（常指乔治亚州与俄克拉荷马州的相关地区），也与马斯科吉（克里克）族的历史城镇/社区有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name in the U.S., most commonly referring to Coweta County in Georgia or the city of Coweta in Oklahoma.","zh":"美国的地名，最常见指乔治亚州的科威塔县（Coweta County）或俄克拉荷马州的科威塔市（Coweta）。"},"examples":[{"en":"She moved to Coweta County, Georgia for a job near Atlanta.","zh":"她为了在亚特兰大附近工作搬到了乔治亚州的科威塔县。"},{"en":"The festival was held in Coweta, Oklahoma.","zh":"那个节日在俄克拉荷马州的科威塔市举行。"}]},{"partOfSpeech":"n.","definition":{"en":"a historical name connected to the Muscogee (Creek) people, especially the Coweta (Koweta) town/community that was an important center in Creek history.","zh":"与马斯科吉（克里克）族相关的历史名称，尤指克里克历史上重要的科威塔（Coweta/Koweta）城镇/社区。"},"examples":[{"en":"Coweta was one of the important towns in Muscogee (Creek) history.","zh":"科威塔是马斯科吉（克里克）历史上重要的城镇之一。"},{"en":"The museum exhibit discussed Coweta and other Creek communities.","zh":"博物馆展览介绍了科威塔以及其他克里克社区。"}]}],"phonetic":"/kaʊˈiːtə/","extraExplanation":["“Coweta”常见读音是 /kaʊˈiːtə/（类似“kye-WEE-tuh”）。作为专有名词，它在英文中通常不翻译，直接音译为“科威塔”。","词源与北美原住民马斯科吉（Muscogee/Creek）文化有关：Coweta（也常见拼写 Koweta）曾是克里克族的重要城镇与政治文化中心之一。","在美国，许多县、市、道路等以原住民地名命名；在写作中可通过上下文（如 Georgia / Oklahoma / County / City）判断具体指哪个地方。"]}
{"word":"Cowey","summary":{"en":"“Cowey” is most commonly a surname; in some regional dialects it can also mean “timid” or “easily frightened.”","zh":"“Cowey”最常见是姓氏；在少数地方方言中也可表示“胆小的、容易受惊的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A family name (surname).","zh":"姓氏（人名）。"},"examples":[{"en":"Ms. Cowey will speak at the meeting tomorrow.","zh":"Cowey 女士将会在明天的会议上发言。"},{"en":"The email was signed, “J. Cowey.”","zh":"邮件落款是“J. Cowey”。"}]},{"partOfSpeech":"adj.","definition":{"en":"In some Scottish or Northern English dialects: timid; easily frightened.","zh":"（苏格兰或英格兰北部方言）胆小的；容易受惊的。"},"examples":[{"en":"He’s a bit cowey around big dogs.","zh":"他见到大狗会有点胆小。"},{"en":"Don’t be cowey—just ask the teacher.","zh":"别胆怯——去问老师就好。"}]}],"synonyms":["timid","shy","easily frightened","fearful"],"phonetic":"/ˈkaʊi/","extraExplanation":["“Cowey”作为形容词用法较少见，多被视为方言词，常与“cowy / cowie”相关，含“害怕、胆小”的意思；在标准英语写作中一般不用，更多见于口语、方言文学或人物对话。","如果你是在姓名、地名或品牌中看到“Cowey”，通常应按专有名词理解，其具体含义取决于人物/家族背景，而不等同于方言形容词的意思。"]}
{"word":"cowfish","summary":{"en":"A tropical box-shaped fish with horn-like spines; a kind of boxfish.","zh":"一种体形像盒子、带“角”状突起的热带海鱼，属于箱鲀类（boxfish）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of tropical marine fish with a box-shaped body and horn-like spines; also called a boxfish.","zh":"一种热带海鱼，身体像盒子一样呈方形/箱形，常有像角一样的突起；也常被称为“箱鲀/盒子鱼（boxfish）”。"},"examples":[{"en":"We saw a cowfish near the coral reef, drifting slowly with the current.","zh":"我们在珊瑚礁附近看到一条牛角鱼，随着海流慢慢漂着。"},{"en":"The cowfish’s “horns” help it look intimidating to predators.","zh":"牛角鱼的“角”能让它看起来更吓人，从而震慑捕食者。"}]}],"synonyms":["boxfish","horned boxfish"],"phonetic":"/ˈkaʊˌfɪʃ/","extraExplanation":["“cowfish”这个名字来自它的外形：头部或身体前方常有两根像牛角一样的突起（不同种类外观会有差异）。","在水族馆或潜水语境中常见。需要注意的是，有些箱鲀类（包括常被叫作cowfish的种类）在强烈压力下可能释放毒素，现实中多用于科普提醒。","常见相关词：boxfish（箱鲀/盒子鱼），horned cowfish（长角牛角鱼/角箱鲀）。"]}
{"word":"cowfishes","summary":{"en":"“Cowfishes” means more than one cowfish—a tropical, box-shaped fish with horn-like bumps.","zh":"“cowfishes”指不止一条 cowfish（箱鲀/箱鱼类的一种），热带海鱼，身体像盒子，常有角状突起。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A plural form of cowfish: a type of tropical marine fish with a box-shaped body and horn-like bumps, known for moving slowly and sometimes releasing toxins when stressed.","zh":"cowfish 的复数：一种热带海洋鱼类，身体呈“盒状”，头部常有像牛角的突起；行动较慢，受惊或压力大时有时会释放毒素。"},"examples":[{"en":"Cowfishes are often seen in coral reefs, drifting calmly near the rocks.","zh":"在珊瑚礁里常能看到 cowfishes，在岩石附近悠闲地漂游。"},{"en":"Some aquariums avoid keeping cowfishes with other fish because they can release toxins if stressed.","zh":"一些水族馆会避免把 cowfishes 和其他鱼混养，因为它们在压力下可能释放毒素。"}]}],"synonyms":["cowfish","boxfish"],"phonetic":"/ˈkaʊˌfɪʃɪz/","extraExplanation":["“cowfish”之所以得名，通常是因为头部两侧的角状突起让人联想到牛角；常见种类包括 longhorn cowfish（长角箱鲀）。","拼写提示：cowfish 的复数通常加 -es → cowfishes。日常资料里你也可能看到不规则写法 cowfish（既可作单数也可作复数），但在严格写作中 cowfishes 更清晰。"]}
{"word":"cowflap","summary":{"en":"A humorous word for a flat piece of cow dung (a cowpat).","zh":"指扁平的牛粪（牛粪饼），多为口语、带幽默色彩的说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a flat piece of cow dung (often seen in fields); a cowpat","zh":"牛粪饼；（田野里常见的）扁平牛粪"},"examples":[{"en":"Watch your step—there’s a cowflap right in the middle of the path.","zh":"小心脚下——路中央就有一坨牛粪饼。"},{"en":"After the rain, the cowflaps made the field smell strong.","zh":"下雨后，田里那些牛粪饼味道更重了。"}]}],"synonyms":["cowpat","cow pie","dung","manure"],"phonetic":"/ˈkaʊˌflæp/","extraExplanation":["“cowflap”主要见于英式英语的口语或幽默用法；在更常见的说法里，人们更常说“cowpat”（英式）或“cow pie”（美式口语）。","这个词带有比较形象、略带玩笑的感觉，通常用于描述乡间路上不小心踩到的“扁平牛粪”。"]}
{"word":"cowflaps","summary":{"en":"Cowflaps are pieces or piles of cow dung on the ground (a cowpat).","zh":"cowflaps 指地上的牛粪块/牛粪堆（相当于 cowpat）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a piece or pile of cow dung (cow manure) on the ground; a cowpat","zh":"（地上的）牛粪块；牛粪堆（英式口语）"},"examples":[{"en":"Watch your step—there are cowflaps all over this field.","zh":"小心脚下——这块田里到处都是牛粪块。"},{"en":"The kids laughed when someone nearly stepped in a cowflap.","zh":"有人差点踩到一坨牛粪时，孩子们笑了起来。"}]}],"synonyms":["cowpat","cow pie","cow dung","manure","dung"],"phonetic":"/ˈkaʊ.flæp/","extraExplanation":["“cowflap”多见于英式/乡村语境，带一点幽默或口语色彩；更中性的常用说法是“cowpat”（英式）或“cow dung / manure”（更正式）。在北美也有人说“cow pie”（口语）。"]}
{"word":"cowflop","summary":{"en":"“Cowflop” means a pile of cow dung (cow poop), an informal word often used when talking about fields or farms.","zh":"“cowflop”指一坨牛粪（牛的粪便团），多用于谈论牧场或田野的非正式说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a pile or pat of cow dung (cow poop), usually found in fields; informal.","zh":"（牛的）粪便团、牛粪饼（常见于牧场/田野；非正式说法）。"},"examples":[{"en":"Watch your step—there’s a cowflop right in the middle of the path.","zh":"小心脚下——路中间就有一坨牛粪。"},{"en":"The kids laughed when they saw the dog trying to sniff a cowflop.","zh":"孩子们看到狗想去闻牛粪时笑了起来。"}]}],"synonyms":["cow pat","cow dung","cow manure","manure"],"phonetic":"/ˈkaʊˌflɑp/","extraExplanation":["“cowflop”多见于英式口语/非正式语境，美式英语里更常说“cow pat”或直接说“cow manure / cow dung”。","这个词带一点幽默、轻松的语气，但在正式写作中不太合适。"]}
{"word":"cowflops","summary":{"en":"Cowflops are flat pieces of cow dung on the ground, often mentioned when walking in fields.","zh":"Cowflops 指地上的扁平牛粪（牛粪饼），常在走田野时提到。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(usually plural) A flat, soft piece of cow dung on the ground; a cow pat.","zh":"（通常用复数）牛在地上排出的扁平、软的粪便；牛粪饼。"},"examples":[{"en":"Watch your step—there are cowflops all over the field.","zh":"小心脚下——草地上到处都是牛粪饼。"},{"en":"After the rain, the cowflops were even harder to avoid.","zh":"下雨后，牛粪饼更难躲开了。"}]}],"synonyms":["cow pat","cow dung","manure","droppings"],"phonetic":"/ˈkaʊˌflɑps/","extraExplanation":["“cowflop”较常见于英式英语、口语或带幽默感的表达；更中性常用的说法是“cow pat”或“cow dung”。","该词常用复数“cowflops”，因为在牧场/田野里通常会看到不止一处。"]}
{"word":"cowgate","summary":{"en":"Cowgate is a place name—most famously a historic street/area in Edinburgh, Scotland, often associated with nightlife and venues.","zh":"Cowgate 是地名，最常指苏格兰爱丁堡的一条历史街区，也常让人联想到夜生活与演出场地。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a street name and place name, especially Cowgate, a historic street/area in Edinburgh, Scotland","zh":"（专有名词）街道名/地名，尤指苏格兰爱丁堡的 Cowgate（考盖特街/区域），一条历史悠久的街道与周边地带"},"examples":[{"en":"We walked down Cowgate to reach the Old Town pubs.","zh":"我们沿着 Cowgate 往下走，去老城的酒吧。"},{"en":"The festival venues near Cowgate can get very busy in August.","zh":"八月时，Cowgate 附近的节庆场地会非常拥挤。"}]},{"partOfSpeech":"other","definition":{"en":"by extension, the nightlife district around Cowgate in Edinburgh (known for clubs and music venues)","zh":"引申义：爱丁堡 Cowgate 一带的夜生活区域（以俱乐部和音乐场地闻名）"},"examples":[{"en":"They’re going out in Cowgate tonight for live music.","zh":"他们今晚要去 Cowgate 那边听现场音乐。"},{"en":"Cowgate is popular with students on weekends.","zh":"周末时 Cowgate 很受学生欢迎。"}]}],"phonetic":"/ˈkaʊ.ɡeɪt/","extraExplanation":["“Cowgate”常被直译为“牛门/牛关口”，但在很多英国地名里，-gate 源自古诺斯语（Old Norse）的 *gata*，意思更接近“街/路”，不一定指“门”。因此 Cowgate 更像是“赶牛走的街/牛道”这类历史含义。","作为专有地名，通常大写为 Cowgate；如果说“in Cowgate / on Cowgate”，语境往往是爱丁堡旧城区（Old Town）及其夜生活文化。"]}
{"word":"Cowgill","summary":{"en":"Cowgill is usually a surname, and it can also be a place name in Cumbria, England.","zh":"Cowgill 通常是英文姓氏，也可作英国坎布里亚郡的地名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname).","zh":"（姓氏）考吉尔；科吉尔（常见英美姓氏）"},"examples":[{"en":"Dr. Cowgill will speak at the conference today.","zh":"考吉尔博士今天会在会议上发言。"},{"en":"My teacher’s last name is Cowgill.","zh":"我老师的姓是 Cowgill。"}]},{"partOfSpeech":"other","definition":{"en":"a place name, especially Cowgill, a small hamlet in Cumbria, England.","zh":"（地名）Cowgill：英国英格兰坎布里亚郡的一个小村落/聚落"},"examples":[{"en":"They stayed near Cowgill while hiking in Cumbria.","zh":"他们在坎布里亚徒步时住在 Cowgill 附近。"},{"en":"Cowgill is a quiet rural spot in northern England.","zh":"Cowgill 是英格兰北部一个安静的乡村地点。"}]}],"phonetic":"/ˈkaʊɡɪl/","extraExplanation":["“Cowgill”也可能指语言学中的“Cowgill’s Law（考吉尔定律）”，以美国历史语言学家 Warren Cowgill（沃伦·考吉尔）命名；它是印欧语历史音变研究中的一条假说/规律。日常英语里单独看到 Cowgill，多半还是姓氏或地名。"]}
{"word":"cowgirl","summary":{"en":"A cowgirl is a woman associated with ranch life and horseback riding, or a Western-style female character/performer.","zh":"cowgirl 指从事牧场与骑马工作的女牛仔，也可指西部牛仔风格的女性形象或表演者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A woman or girl who rides horses and does ranch work, especially in the American West.","zh":"（尤指美国西部的）女牛仔；从事牧场工作、擅长骑马的女性。"},"examples":[{"en":"She grew up on a ranch and became a skilled cowgirl.","zh":"她在牧场长大，成了一位骑术高超的女牛仔。"},{"en":"The cowgirl guided the cattle across the river.","zh":"这位女牛仔带领牛群渡过河流。"}]},{"partOfSpeech":"n.","definition":{"en":"A female performer or character styled like a Western cowboy (often in rodeos, shows, costumes, or popular culture).","zh":"（表演、角色或流行文化中的）西部牛仔风格的女性形象；女牛仔演员。"},"examples":[{"en":"She dressed as a cowgirl for the themed party.","zh":"她为主题派对打扮成女牛仔。"},{"en":"The singer appeared on stage in a cowgirl outfit.","zh":"这位歌手穿着女牛仔装登台。"}]}],"synonyms":["female cowboy","ranch hand (female)","rodeо performer"],"phonetic":"/ˈkaʊˌɡɝl/","extraExplanation":["“cowgirl”与“cowboy”源自美国牧场文化（ranch culture）与赶牛工作。今天它既可指真实从事牧场与骑马工作的人，也常用于服装、音乐与影视等场景中的“西部风格”形象。","在现代语境中，“cowgirl”通常是中性或正面的称呼，但在特定语境里也可能被用来强调造型或人设（image/persona），不一定表示真实职业。"]}
{"word":"cowgirls","summary":{"en":"“Cowgirls” is the plural of “cowgirl”: women who work in ranch/cattle life or who perform/compete in Western rodeo culture.","zh":"“Cowgirls” 是 “cowgirl” 的复数：指从事牧场放牧生活的女牛仔，或参与西部牛仔竞技（rodeo）表演/比赛的女性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A woman who works with cattle, horses, and ranch life (especially in the American West), often riding horses and doing ranch tasks.","zh":"女牛仔；从事牧场生活、放牧与骑马等工作的女性（尤指美国西部）。"},"examples":[{"en":"My aunt was a cowgirl on a ranch in Texas when she was young.","zh":"我阿姨年轻时在德州的牧场当过女牛仔。"},{"en":"The cowgirls rode out early to check the cattle.","zh":"女牛仔们一大早骑马出去查看牛群。"}]},{"partOfSpeech":"n.","definition":{"en":"A female performer or competitor in Western-style entertainment or sports, such as rodeos.","zh":"（西部风格表演或运动中的）女牛仔；（如牛仔竞技表演 rodeo 的）女选手。"},"examples":[{"en":"She became a famous rodeo cowgirl after winning several events.","zh":"她在赢得多项赛事后成了一位有名的牛仔竞技女选手。"},{"en":"The festival featured music, dancing, and cowgirls doing trick riding.","zh":"节日上有音乐、舞蹈，还有女牛仔表演特技骑术。"}]}],"synonyms":["women ranchers","rodeo performers","female cowhands"],"phonetic":"/ˈkaʊˌɡɝlz/","extraExplanation":["在美国文化里，cowgirl 常让人联想到“西部拓荒”“自由独立”“骑马与牧场生活”等形象。现实中也确实有许多女性从事牧场工作，或参与 rodeo（牛仔竞技表演/比赛）。","词形：cowgirls 是 cowgirl 的复数。注意与 cowboys（男牛仔）对应。"]}
{"word":"cowgram","summary":{"en":"Cowgram is another name for horse gram, a South Asian legume used as food and animal feed.","zh":"Cowgram 是 horse gram（马豆/牛豆）的别称，指南亚常见的一种豆科作物，可食用也可作饲料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a legume plant (horse gram), grown especially in South Asia, whose seeds are used for food and animal feed","zh":"（尤指南亚种植的）牛豆/马豆（horse gram，一种豆科植物）；其种子可作食物或饲料"},"examples":[{"en":"In parts of India, cowgram is cooked into soups and stews.","zh":"在印度的一些地区，cowgram 会被煮成汤或炖菜。"},{"en":"Farmers sometimes grow cowgram as fodder for cattle.","zh":"农民有时会种植 cowgram 作为牛的饲料。"}]}],"synonyms":["horse gram"],"phonetic":"/ˈkaʊˌɡræm/","extraExplanation":["cowgram 常见同义词是 horse gram（马豆）。在英语语境里，cowgram 多出现在南亚农业、饮食或营养相关的文章中，属于相对少见的词。","它的种子常被用来做豆类料理（如粥、汤、咖喱等），也可能被磨成粉使用；在农业上也可作饲料或覆盖作物（cover crop）。"]}
{"word":"cowgrass","summary":{"en":"Cowgrass is a clover-type forage plant grown to feed cattle.","zh":"Cowgrass 指一种三叶草类的饲草植物，用来喂牛等家畜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of clover (often a form of red clover) grown as pasture or hay for feeding cattle","zh":"一种苜蓿/三叶草（常指红三叶草的某类品种），多用于牧草或干草来饲喂牛等家畜"},"examples":[{"en":"Farmers planted cowgrass to improve pasture for dairy cows.","zh":"农民种植 cowgrass 来改良牧场，给奶牛提供更好的饲草。"},{"en":"The field was seeded with cowgrass and other forage plants.","zh":"这块地播种了 cowgrass 和其他饲用植物。"}]}],"synonyms":["red clover","cow clover","clover (forage)"],"phonetic":"/ˈkaʊˌɡræs/","extraExplanation":["“cowgrass”多见于英式/农牧语境，是一种“饲草名”（forage crop name），并不是日常生活里很常用的词。不同地区对它指代的具体三叶草品种可能略有差异，但核心意思是“供牛吃的牧草（常为红三叶草一类）”。"]}
{"word":"cowhage","summary":{"en":"Cowhage is a tropical vine (Mucuna pruriens) and also refers to the itching hairs on its seed pods.","zh":"Cowhage 指一种热带藤本植物（Mucuna pruriens），也可指其豆荚上的致痒刺毛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tropical climbing plant (Mucuna pruriens) whose seed pods are covered with tiny irritating hairs; also called cowitch.","zh":"一种热带攀援植物（荨麻豆/黧豆，学名 Mucuna pruriens），其豆荚表面有细小刺毛会引起皮肤强烈瘙痒；也叫 cowitch。"},"examples":[{"en":"Be careful not to touch cowhage pods—they can make your skin itch for hours.","zh":"小心别碰到 cowhage 的豆荚——会让皮肤痒上好几个小时。"},{"en":"The field guide lists cowhage (cowitch) as a common vine in this region.","zh":"这本野外指南把 cowhage（cowitch）列为本地区常见的藤本植物。"}]},{"partOfSpeech":"n.","definition":{"en":"The irritating hairs (itching powder) from the seed pods of this plant.","zh":"这种植物豆荚上的刺毛（可作“痒粉/痒痒粉”使用）。"},"examples":[{"en":"Some prank “itching powder” was made from dried cowhage hairs.","zh":"有些恶作剧用的“痒痒粉”是用晒干的 cowhage 刺毛做的。"},{"en":"The doctor asked if his rash could have been caused by cowhage exposure.","zh":"医生问他的皮疹是否可能是接触了 cowhage 刺毛造成的。"}]}],"synonyms":["cowitch","cowage","itching powder","Mucuna pruriens"],"phonetic":"ˈkaʊˌhɑːdʒ","extraExplanation":["cowhage 常见拼写变体有 cowage、cowitch。它的刺毛会引发强烈瘙痒，主要是机械刺激与活性成分共同作用，因此不建议直接接触或吸入粉尘。","在一些传统医学与现代研究中，Mucuna pruriens 的种子因含有左旋多巴（L-DOPA）而受到关注，但这属于药用/保健范畴，使用前应咨询专业人士。"]}
{"word":"cowhages","summary":{"en":"Cowhages are the itchy hairs from velvet bean pods, or the velvet bean plant itself.","zh":"Cowhages 指黧豆（velvet bean）荚果上的致痒刺毛，也可指这种植物本身。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The itchy hairs (tiny bristles) from the seed pods of the tropical velvet bean plant, used to cause itching (sometimes in pranks or older medical testing).","zh":"（热带）黧豆/天蚕豆（velvet bean）荚果上的刺毛，会引起强烈瘙痒；（旧时）有时用于恶作剧或医学测试。"},"examples":[{"en":"Be careful—cowhages can cause intense itching if they touch your skin.","zh":"小心——cowhages 一碰到皮肤就可能引起很强的瘙痒。"},{"en":"The old story mentioned cowhages being used as a prank in school.","zh":"那则旧故事里提到有人在学校用 cowhages 搞恶作剧。"}]},{"partOfSpeech":"n.","definition":{"en":"The velvet bean plant itself (Mucuna pruriens), especially in contexts discussing botany or traditional uses.","zh":"黧豆/天蚕豆（Mucuna pruriens）这种植物本身（多用于植物学或传统用途相关语境）。"},"examples":[{"en":"Cowhage grows in warm climates and produces pods covered with irritating hairs.","zh":"Cowhage 生长在温暖地区，结的荚果外面有会刺激皮肤的刺毛。"}]}],"synonyms":["cowitch","itching powder (similar idea)","velvet bean (plant name)"],"phonetic":"/ˈkaʊˌhɪdʒ/","extraExplanation":["“Cowhage”也常写作“cowhage/cowhage plant”，并有同义词“cowitch”。这个词在现代日常英语里不常见，更多出现在植物学、旧式记载或特定地区的用法中。","它的“itchy hairs（刺毛）”之所以让人痒，是因为细小毛刺容易扎进皮肤并刺激皮肤表层；因此在英文里常与“itch（痒）”“prank（恶作剧）”等词一起出现。"]}
{"word":"cowhand","summary":{"en":"A cowhand is a ranch worker who takes care of cattle—essentially a cowboy in a work/job sense.","zh":"cowhand 指牧场里照看牛群的雇工，职业意义上相当于“牛仔”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cowboy; a person hired to work with cattle on a ranch (often doing riding, herding, and other outdoor work)","zh":"牛仔；牧场里受雇照看牛群的工人（常负责骑马、赶牛等户外工作）"},"examples":[{"en":"The cowhand rode out at dawn to check the herd.","zh":"牛仔天一亮就骑马出去查看牛群。"},{"en":"She worked as a cowhand on a cattle ranch in Wyoming.","zh":"她在怀俄明州的一个牧牛场当牛仔。"}]}],"synonyms":["cowboy","ranch hand","cattle hand","herdsman"],"phonetic":"/ˈkaʊˌhænd/","extraExplanation":["“cowhand”主要用于美国西部语境，强调“牧场雇工”的身份；比“cowboy”更中性、更像职业称呼，而“cowboy”除了职业含义外，有时也带有更强的西部文化形象。","词源上是“cow（牛）+ hand（工人/帮手）”。在英语里，hand 常用于表示“工人/劳力”，如 farmhand（农场工人）、deckhand（甲板水手）。","在西部题材小说与电影里，cowhand 常与 ranch（牧场）、herd（牛群）、range（牧场/草原放牧地）等词一起出现。"]}
{"word":"cowhands","summary":{"en":"Cowhands are ranch workers who look after cattle.","zh":"cowhands 指照料牛群的牧场雇工（牛仔/牛仔女）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A ranch worker (cowboy/cowgirl) who helps take care of cattle, often by riding horses, herding, feeding, and doing general ranch chores.","zh":"牧场雇工；牛仔/牛仔女（照料牛群的牧场工作人员，常骑马放牧、赶牛、喂养并做杂务）。"},"examples":[{"en":"The cowhands rode out at dawn to check the herd.","zh":"牧场雇工们天一亮就骑马出去查看牛群。"},{"en":"During branding season, extra cowhands were hired to help.","zh":"在烙印季节，牧场会雇更多雇工来帮忙。"},{"en":"The ranch owner thanked the cowhands for working through the storm.","zh":"牧场主感谢雇工们在暴风雨中仍坚持工作。"}]}],"synonyms":["ranch hands","cowboys","cowgirls","cattle hands"],"phonetic":"/ˈkaʊˌhændz/","extraExplanation":["“cowhand”在美国西部语境中很常见，带有“牧场文化/牛仔文化”的色彩。它通常比“cowboy”更强调“雇员/工人”的身份，而不只是浪漫化的“牛仔”形象。","复数形式为“cowhands”。常见相关词：ranch hand（牧场工人，更泛）、wrangler（管马/赶牛的人）、herder（牧民/放牧者）。"]}
{"word":"cowheart","summary":{"en":"“Cowheart” most commonly means a cowboy or cattle ranch worker; less commonly, it can mean the heart of a cow as food.","zh":"“cowheart”最常指牛仔或牧场牧牛工人；较少情况下也可指作为食材的牛心。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A cowboy; a person (often a ranch worker) who herds, tends, and works with cattle.","zh":"牛仔；（常指牧场工人）负责放牧、照料并管理牛群的人。"},"examples":[{"en":"The cowheart rode out at dawn to check the cattle.","zh":"牛仔黎明就骑马出发去查看牛群。"},{"en":"Many cowhearts spent weeks on the range during cattle drives.","zh":"许多牛仔在赶牛途中会在牧场草原上待上好几周。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) The heart of a cow, used as food in some cuisines.","zh":"（较少用）牛的心脏；可作为某些料理的食材。"},"examples":[{"en":"The butcher set aside a cowheart for the stew.","zh":"肉贩把一个牛心留出来用来炖煮。"}]}],"synonyms":["cowboy","ranch hand","cowpoke","cattleman"],"phonetic":"/ˈkaʊˌhɑrt/","extraExplanation":["“cowheart”带有明显的美国西部（American West）色彩，常见于西部题材小说、电影或口述历史中，用来强调在牧场上长期与牛群打交道的“牧牛人/牛仔”的生活与身份。日常英语里更常用“cowboy”或“ranch hand”。"]}
{"word":"cowhearted","summary":{"en":"“Cowhearted” means very timid or cowardly (a literary/less common word).","zh":"“cowhearted”意为“非常胆小、怯懦的”（较文学化、较少见）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Literary, informal) Very timid or cowardly; lacking courage.","zh":"（文学/口语，较少用）非常胆小或怯懦的；缺乏勇气的。"},"examples":[{"en":"He felt too cowhearted to speak up in the meeting.","zh":"他觉得自己太胆小了，在会议上不敢发言。"},{"en":"Don’t be cowhearted—ask for help if you need it.","zh":"别那么怯懦——需要的话就开口求助。"},{"en":"The hero refuses to act cowhearted when danger appears.","zh":"危险出现时，英雄拒绝表现得怯懦。"}]}],"synonyms":["cowardly","timid","faint-hearted","spineless","chicken-hearted"],"phonetic":"/ˈkaʊˌhɑr.tɪd/","extraExplanation":["“cowhearted”也常写作“cow-hearted”。这里的“cow”用的是引申义：在英语文化里，牛有时被用来象征温顺、缺乏攻击性（并不总是负面），因此“cowhearted”带有“胆小/没胆量”的贬义色彩。","这个词在现代日常英语中不算常见，更常用的是“cowardly”“timid”“faint-hearted”。如果你在文学作品或较夸张的口语里见到它，通常是在强调某人的怯懦。"]}
{"word":"cowheel","summary":{"en":"Cowheel is the heel/foot part of a cow, commonly used in slow-cooked dishes for its gelatin.","zh":"Cowheel 指牛的蹄部/脚踝附近部位，常用来慢炖，因胶质丰富。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The heel (lower leg/ankle and foot area) of a cow, often cooked slowly for its gelatin-rich meat and skin.","zh":"牛的蹄部（小腿下端到脚/蹄一带），常用于慢炖，因为含有丰富胶质（明胶质）。"},"examples":[{"en":"In some Caribbean dishes, cowheel is simmered for hours until it becomes tender.","zh":"在一些加勒比海菜肴里，牛蹄会炖上好几个小时，直到变得软烂。"},{"en":"The soup gets thick and silky because cowheel releases gelatin as it cooks.","zh":"汤会变得浓稠顺滑，因为牛蹄在烹煮时会释放胶质。"}]}],"synonyms":["cow heel","cow foot","beef foot"],"phonetic":"/ˈkaʊˌhil/","extraExplanation":["“cowheel”常见于加勒比海与非洲裔饮食语境（如牙买加等地的炖汤/炖菜）。在美式英语中更常见的说法是“cow heel”（分开写）或具体写作“beef heel/heel of beef”，有时也会与“cow foot / beef foot（牛脚/牛蹄）”混用；不同地区对部位切分略有差异。"]}
{"word":"cowherb","summary":{"en":"Cowherb is a common name for a pink-flowered field plant (Vaccaria hispanica), known historically for its soapy properties.","zh":"Cowherb 指一种田野里常见、开粉红花的植物（Vaccaria hispanica），历史上因含皂苷而有“起泡/像肥皂”的用途。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wild plant with small pink flowers (Vaccaria hispanica), sometimes found in fields; its leaves or seeds were historically used in folk medicine and as a mild soap because they contain saponins.","zh":"牛草（牛繁缕，学名 Vaccaria hispanica），一种开粉红色小花的野生植物，常见于田野；因含皂苷，过去有时用于民间药用或作简易“肥皂”清洁。"},"examples":[{"en":"Cowherb sometimes grows among wheat and other crops.","zh":"牛草有时会混生在小麦等农作物田里。"},{"en":"The field guide lists cowherb as an introduced weed in some regions.","zh":"那本野外图鉴把牛草列为某些地区的外来杂草。"},{"en":"In old texts, cowherb is mentioned for its soapy sap.","zh":"在一些旧文献中，牛草因带“起泡”的汁液而被提及。"}]}],"synonyms":["cow soapwort","Vaccaria hispanica"],"phonetic":"/ˈkaʊˌhɝːb/","extraExplanation":["“cowherb”是传统英文俗名之一，现代更常见的叫法包括“cow soapwort”。俗名在不同地区可能指向不同植物，但在植物学语境里多指 Vaccaria hispanica。","词源上，“cow-”常用于民间植物名（并不一定表示牛爱吃），有时暗示这种植物常出现在牧场/农田，或与家畜相关的用途与想象。"]}
{"word":"cowherbs","summary":{"en":"cowherbs: a rare plural form meaning cattle herders; sometimes a regional folk name for plants associated with cows.","zh":"cowherbs：罕见用法，多指“放牛的人”（cowherd 的变体）；也可能是某些地区对“牛常吃的野草/植物”的俗称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) People who take care of cows; cattle herders. (Plural of “cowherb,” a less common variant form of “cowherd.”)","zh":"（罕见）放牛的人；牧牛人。（“cowherb”的复数；常见形式是“cowherd”。）"},"examples":[{"en":"In old rural stories, cowherbs guided the cattle back to the village at dusk.","zh":"在一些古老的乡村故事里，放牛人会在黄昏时把牛群赶回村子。"},{"en":"The poem mentions cowherbs and milkmaids to show everyday country life.","zh":"诗里提到放牛人和挤奶女工，用来呈现日常的乡村生活。"}]},{"partOfSpeech":"n.","definition":{"en":"(Folk/region-specific, uncommon) Wild plants or “herbs” associated with cows, often as fodder; the exact plant can differ by place.","zh":"（民间/地域用法，不常见）与牛有关的野草或“草药”，常指可当饲料的植物；具体指哪一种会因地区而不同。"},"examples":[{"en":"Some locals called the roadside greens cowherbs because cattle would graze on them.","zh":"有些当地人把路边的绿草叫作 cowherbs，因为牛会去吃这些草。"},{"en":"The field guide notes that the name “cowherbs” is used loosely and varies by region.","zh":"野外植物指南提到，“cowherbs”这个名称用得很宽泛，而且各地指代不一。"}]}],"synonyms":["cowherds","cattle herders","herders","drovers"],"phonetic":"/ˈkaʊˌhɝbz/","extraExplanation":["“cowherbs”在现代英语里非常少见；很多时候是把更常见的“cowherd(s)”（放牛人/牧牛人）误写成“cowherb(s)”。如果你是在阅读古诗、民间故事或方言材料里看到它，第一义（放牛的人）更可能。","如果语境在谈植物、饲料或田野辨识，“cowherbs”可能是民间俗名（类似“cow parsley”等），但这种用法缺乏统一标准，需要结合地区与上下文确认具体植物。"]}
{"word":"cowherd","summary":{"en":"A cowherd is someone who herds and cares for cows; it can also refer to the mythic “Cowherd” in the Chinese story of the Cowherd and the Weaver Girl.","zh":"cowherd 指放牛/牧牛的人；在文化语境中也可指中国“牛郎织女”传说中的“牛郎”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who looks after and herds cows (cattle), especially on a farm or ranch.","zh":"放牛的人；牧牛人（照看并赶牛群的人，尤指在农场或牧场）"},"examples":[{"en":"The cowherd moved the cattle to a new pasture before sunset.","zh":"放牛人日落前把牛群赶到新的牧场。"},{"en":"In the old story, a cowherd and a weaver girl fall in love across the Milky Way.","zh":"在古老的故事里，牛郎与织女隔着银河相爱。"}]}],"synonyms":["herdsman","cattle herder","cowboy (context-dependent)"],"phonetic":"/ˈkaʊhɝd/","extraExplanation":["“cowherd”由 cow（牛）+ herd（放牧/牧群）构成，意思直观。英语里也常用“herder”表示放牧的人，如 shepherd（牧羊人）、goatherd（牧山羊的人）。","在中文文化语境中，“牛郎”常被译作 cowherd，最典型的是“牛郎织女”传说（七夕）。英语里提到这个故事时，cowherd 常带有神话/文学色彩。","注意区分：cowboy 指美国文化中骑马放牧的“牛仔”，cowherd 更中性，强调“照看牛群的人”，不一定有牛仔那种形象。"]}
{"word":"cowherds","summary":{"en":"Cowherds are people who take care of and guide cows, especially while they graze.","zh":"cowherds 指照看、放牧并引导牛群的人（牧牛人、放牛的人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People whose job is to look after and guide cows (often taking them to graze).","zh":"放牛的人；牧牛人（负责照看、放牧牛群的人）。"},"examples":[{"en":"In the early morning, the cowherds led the cattle to the fields.","zh":"清晨，牧牛人把牛群赶到田野里。"},{"en":"The village relied on cowherds to keep the cows safe while they grazed.","zh":"村子依靠牧牛人来保护放牧时的牛群安全。"}]}],"synonyms":["herders","cattle herders","cowboys (US, often on ranches)","drovers (moving cattle, often long-distance)"],"phonetic":"ˈkaʊˌhɝdz","extraExplanation":["“cowherds”是复数形式；单数是“cowherd”。词由“cow（牛）+ herd（牧群/放牧）”组成，herd在这里指“放牧、看管牲畜”。","在不同文化语境中，类似角色常见于牧区与传统农村社会；在一些文学作品里，cowherds常用来营造“田园/牧歌式（pastoral）”的氛围。"]}
{"word":"cowhide","summary":{"en":"Cowhide means a cow’s hide or leather made from it; it can also mean a cowhide whip in some contexts.","zh":"cowhide 指牛皮或由牛皮制成的皮革；在某些语境中也可指牛皮鞭。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Leather made from a cow’s skin; it is often thick and durable.","zh":"牛皮（由牛皮制成的皮革，通常厚实耐用）。"},"examples":[{"en":"He bought a cowhide belt because it lasts a long time.","zh":"他买了一条牛皮皮带，因为很耐用。"},{"en":"The chair was upholstered in dark brown cowhide.","zh":"这把椅子用深棕色的牛皮做了软包。"}]},{"partOfSpeech":"n.","definition":{"en":"The hide (skin) of a cow, especially before it is processed into leather.","zh":"（尤指未加工成皮革前的）牛皮、牛的皮张。"},"examples":[{"en":"The ranch sold cowhides to a local tannery.","zh":"牧场把牛皮卖给了当地的制革厂。"},{"en":"The cowhide was cleaned and prepared for tanning.","zh":"这张牛皮被清洗并准备进行鞣制。"}]},{"partOfSpeech":"n.","definition":{"en":"A whip made of cowhide leather (a “cowhide whip”).","zh":"牛皮鞭（用牛皮制成的鞭子）。"},"examples":[{"en":"In old Western stories, a cowboy might carry a cowhide at his side.","zh":"在一些老西部故事里，牛仔可能会在身旁带着一条牛皮鞭。"}]}],"synonyms":["leather (general)","hide","cowskin"],"phonetic":"/ˈkaʊˌhaɪd/","extraExplanation":["“hide”在英语里既可指“（动物的）皮、皮张”，也常用来指“皮革原料”。“cowhide”更强调来源是牛（cow），比“leather”更具体。","“cowhide”也常见于“cowhide rug”（牛皮地毯/牛皮毯）等搭配，常用于装饰风格中，带有乡村、牧场或复古的氛围。","与之相关的词：tannery（制革厂）、tanning（鞣制）、upholster / upholstery（给家具做软包/装潢）。"]}
{"word":"cowhided","summary":{"en":"“Cowhided” is a rare form meaning either “made/covered with cowhide” (adj.) or the past tense of “cowhide,” meaning “whipped with a cowhide strap.”","zh":"“cowhided”较少见，可指“牛皮制/用牛皮包裹的”（形容词），也可作动词 cowhide 的过去式，表示“用牛皮鞭抽打”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Made of cowhide; covered or bound with cowhide leather.","zh":"（少见）牛皮制的；用牛皮包裹或装订的。"},"examples":[{"en":"He carried a cowhided bag that looked tough and weatherproof.","zh":"他带着一个牛皮包，看起来结实又防风雨。"},{"en":"The journal was cowhided and stitched by hand.","zh":"这本日记是牛皮装订的，而且是手工缝制的。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of cowhide (verb): to whip or beat someone with a cowhide strap.","zh":"cowhide（动词）的过去式/过去分词：用牛皮鞭（皮带）抽打、鞭打某人。"},"examples":[{"en":"In the old story, the thief was cowhided as punishment.","zh":"在那个旧故事里，小偷被用牛皮鞭抽打作为惩罚。"},{"en":"The novel describes a man who was cowhided by his captors.","zh":"小说描写了一个男人被抓他的人用牛皮鞭抽打。"}]}],"synonyms":["(adj.) leather","(adj.) cowhide-bound","(v.) whipped","(v.) flogged","(v.) lashed"],"phonetic":"/ˈkaʊˌhaɪdɪd/","extraExplanation":["“cowhided”很少作为独立词出现在现代英语里。你更常见到名词/动词原形“cowhide”（牛皮；牛皮鞭）或形容词“cowhide”（牛皮的）。如果你想表达“牛皮做的”，更自然的写法通常是“cowhide”或“made of cowhide”。","作为动词“cowhide”（用牛皮鞭抽打）带有明显的历史与暴力语境，现代写作中多见于历史叙述、文学作品或报道引用，日常对话里很少用。"]}
{"word":"cowhides","summary":{"en":"Cowhides are the skins of cows, often used as leather or processed materials.","zh":"cowhides 指牛的皮，常作为皮革或加工材料使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The hides (skins) of cows, especially when used as leather or processed for making products.","zh":"牛皮；母牛的皮（尤指作为皮革或加工后用于制作物品的牛皮）"},"examples":[{"en":"The artisan bought cowhides to make durable belts and bags.","zh":"这位工匠买了牛皮来做耐用的皮带和包。"},{"en":"In the market, cowhides were hanging to dry in the sun.","zh":"在集市上，牛皮被挂着在太阳下晾干。"}]}],"synonyms":["hides","cowhide leather","leather (general)"],"phonetic":"/ˈkaʊˌhaɪdz/","extraExplanation":["“cowhides”是复数形式，单数是“cowhide”。在日常英语里，如果强调材料本身，也常说“cowhide leather”（牛皮革）。","有时“hide”指未鞣制的生皮；“leather”更常指已经鞣制、可直接用于制作的皮革。不同语境下可用词不同：rawhide（生皮/硬皮）≠ leather（皮革）。"]}
{"word":"cowhiding","summary":{"en":"Cowhiding most commonly means beating someone with a cowhide strap (an old-fashioned punishment). It can also rarely refer to cowhide leather.","zh":"Cowhiding 最常指用牛皮鞭/皮带抽打某人的行为（较旧式的体罚）。也可罕见地指牛皮革。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of beating someone with a strip of cowhide (a leather whip or strap); a harsh physical punishment","zh":"用牛皮鞭/皮带抽打某人的行为；一种严厉的体罚"},"examples":[{"en":"In older stories, the bully threatened him with cowhiding if he spoke up again.","zh":"在一些旧故事里，恶霸威胁说如果他再敢顶嘴就要用牛皮鞭抽他。"},{"en":"The novel describes a public cowhiding as a symbol of humiliation and control.","zh":"小说把当众用牛皮鞭抽打写成羞辱与控制的象征。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) leather made from a cow’s hide; cowhide leather","zh":"（罕见）牛皮革；牛皮材质"},"examples":[{"en":"The shop sold belts made of tough cowhiding.","zh":"那家店卖用结实牛皮做的皮带。"}]},{"partOfSpeech":"v.","definition":{"en":"to beat or whip someone with a cowhide strap","zh":"用牛皮鞭/皮带抽打（某人）"},"examples":[{"en":"He bragged that he would cowhide anyone who insulted his family.","zh":"他夸口说谁敢侮辱他家人，他就用牛皮鞭抽谁。"}]}],"synonyms":["whipping","beating","flogging","lashing"],"phonetic":"/ˈkaʊˌhaɪdɪŋ/","extraExplanation":["“cowhide”原指牛皮，也指用牛皮做的鞭子/皮带；“cowhiding”多见于较旧的英文文本（19世纪报道、小说等），通常带有暴力、羞辱、私刑或体罚的历史语境。现代英语里更常用更中性的说法如 “whipping / beating / flogging”。"]}
{"word":"cowhorn","summary":{"en":"Cowhorn means a cow’s horn, often used or crafted as a container or tool (especially a traditional powder horn).","zh":"cowhorn 指“牛角”，常见于用牛角制成的容器或工具（尤其是传统的火药角）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A horn from a cow, especially used as a container (for powder, salt, etc.) or made into a simple tool or musical horn.","zh":"牛角；（尤指）用牛角制成的容器（如火药角、盐角等）或简单工具/号角。"},"examples":[{"en":"He carried gunpowder in a cowhorn while traveling through the woods.","zh":"他在林中行走时用牛角（火药角）装火药。"},{"en":"A polished cowhorn hung on the wall as a souvenir.","zh":"一只抛光的牛角挂在墙上当纪念品。"}]},{"partOfSpeech":"adj.","definition":{"en":"Made of, shaped like, or using a cow’s horn.","zh":"牛角制的；牛角形的；使用牛角的。"},"examples":[{"en":"The museum displayed a cowhorn powder flask from the 1700s.","zh":"博物馆展出了一只18世纪的牛角火药瓶。"},{"en":"She played a cowhorn instrument in a folk performance.","zh":"她在民俗表演中演奏牛角制的乐器。"}]}],"synonyms":["cow horn","horn","powder horn"],"phonetic":"/ˈkaʊhɔrn/","extraExplanation":["在北美殖民时期与边疆文化中，cowhorn 常指“火药角”（powder horn）：用牛角掏空、装上木塞，用来携带火药。相关物件在历史书写与民间传说里较常见。","拼写上也常见分写或带连字符：cow horn / cow-horn。实际阅读中遇到的多半是名词用法。"]}
{"word":"cowhouse","summary":{"en":"A cowhouse is a building where cows are kept (a cowshed/cow barn).","zh":"cowhouse 指饲养牛的建筑，即牛舍/牛棚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a building or shelter where cows are kept; a cowshed (cow barn).","zh":"牛舍；牛棚（饲养牛的建筑或棚屋）。"},"examples":[{"en":"The farmer led the cows back to the cowhouse before it got dark.","zh":"天黑前，农夫把牛赶回了牛舍。"},{"en":"The cowhouse needs to be cleaned every morning to keep the animals healthy.","zh":"为了保持牲畜健康，牛舍需要每天早上清理。"}]}],"synonyms":["cowshed","cow barn","byre","barn"],"phonetic":"/ˈkaʊˌhaʊs/","extraExplanation":["“cowhouse”在现代英语中不算常见，更常见的写法是分开的“cow house”，或用更通用的词“cowshed”（英式常用）/“cow barn”（美式更常见）。在一些地区或旧式用法里也会看到“byre”（较文学/英式，意为牛棚）。"]}
{"word":"Cowichan","summary":{"en":"Cowichan refers to an Indigenous Coast Salish people and also to places in British Columbia; it’s also used in “Cowichan sweater,” a traditional thick wool knit.","zh":"Cowichan 可指加拿大温哥华岛的海岸萨利希原住民族群，也可指不列颠哥伦比亚省的地名；还常见于 “Cowichan sweater”，指传统厚羊毛针织衫。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an Indigenous Coast Salish people on Vancouver Island, British Columbia, Canada (often referring to the Cowichan Tribes).","zh":"加拿大不列颠哥伦比亚省温哥华岛上的海岸萨利希原住民族群（常指科威琴部落 Cowichan Tribes）。"},"examples":[{"en":"The Cowichan are known for rich traditions in carving and weaving.","zh":"科威琴族以雕刻与编织等传统文化闻名。"},{"en":"She attended an event hosted by the Cowichan Tribes.","zh":"她参加了由科威琴部落主办的活动。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name used for several locations in British Columbia, especially the Cowichan Valley and Cowichan River area on Vancouver Island.","zh":"加拿大不列颠哥伦比亚省的地名，常指温哥华岛上的科威琴谷（Cowichan Valley）及科威琴河一带。"},"examples":[{"en":"We drove through Cowichan Valley to visit wineries and farms.","zh":"我们开车穿过科威琴谷，去参观酒庄和农场。"},{"en":"Cowichan is a popular area for hiking and kayaking.","zh":"科威琴一带很适合徒步和划皮划艇。"}]},{"partOfSpeech":"n.","definition":{"en":"(often in “Cowichan sweater”) a thick, hand-knit wool sweater traditionally made in the Cowichan style, often with bold geometric patterns.","zh":"（常用于 “Cowichan sweater”）科威琴风格的厚实手工羊毛针织衫，常带有醒目的几何图案。"},"examples":[{"en":"He wore a Cowichan sweater on the cold ferry ride.","zh":"他在寒冷的渡轮上穿着一件科威琴毛衣。"},{"en":"Cowichan sweaters are prized for warmth and craftsmanship.","zh":"科威琴毛衣因保暖与工艺精良而备受喜爱。"}]}],"synonyms":["Cowichan Tribes","Cowichan Valley","Cowichan sweater"],"phonetic":"ˈkaʊɪtʃən","extraExplanation":["“Cowichan”是加拿大原住民相关的专有名词，使用时通常要尊重其自称与具体社群名称；在更正式的语境中，人们也会提到 Quw’utsun（部分社群的自称/书写形式）或直接说 Cowichan Tribes。","“Cowichan sweater”（科威琴毛衣）与当地原住民的编织传统相关；现代市场上也有仿制品，若在意文化与工艺来源，可关注是否为本地或原住民工匠制作。"]}
{"word":"cowichan","summary":{"en":"Cowichan refers to a First Nation and region on Vancouver Island, and also to a traditional thick wool “Cowichan sweater.”","zh":"Cowichan 指温哥华岛上的原住民民族与地区，也可指传统厚羊毛开衫“Cowichan 毛衣”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a First Nation (Indigenous people) and related communities/territory on Vancouver Island, British Columbia, Canada; also used for the Cowichan River and Cowichan Valley.","zh":"（加拿大不列颠哥伦比亚省温哥华岛的）科威尚（Cowichan）原住民民族及其相关社区/传统领地；也可指科威尚河与科威尚谷。"},"examples":[{"en":"The Cowichan people have a long history on Vancouver Island.","zh":"Cowichan 族在温哥华岛有悠久的历史。"},{"en":"We drove through the Cowichan Valley on our way north.","zh":"我们一路向北，开车经过了 Cowichan 谷地。"}]},{"partOfSpeech":"n.","definition":{"en":"a thick, hand-knit wool cardigan, traditionally made by Coast Salish knitters; often called a “Cowichan sweater.”","zh":"科威尚毛衣（Cowichan sweater）：一种厚实的手工羊毛开衫，传统上由海岸萨利希（Coast Salish）编织者制作。"},"examples":[{"en":"He wore a Cowichan sweater to stay warm by the ocean.","zh":"他穿着一件 Cowichan 毛衣，在海边保暖。"},{"en":"Authentic Cowichan sweaters are usually heavy and very warm.","zh":"正宗的 Cowichan 毛衣通常很厚实，也非常保暖。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to the Cowichan people, language, or region.","zh":"与 Cowichan 族、其语言或其地区有关的。"},"examples":[{"en":"She bought yarn at a Cowichan craft market.","zh":"她在 Cowichan 的手工市集买了毛线。"},{"en":"The museum features Cowichan art and weaving traditions.","zh":"博物馆展出 Cowichan 的艺术与编织传统。"}]}],"synonyms":["Cowichan Valley","Cowichan River","Cowichan sweater","Coast Salish (related context)"],"phonetic":"/ˈkaʊɪtʃən/","extraExplanation":["“Cowichan”常被用来指一个原住民民族、一个地区（Cowichan Valley）、以及一种传统针织开衫（Cowichan sweater）。谈到毛衣时，很多人会特别强调“由当地原住民编织者制作/出品”的版本，以尊重其文化来源与手工传统。"]}
{"word":"Cowiche","summary":{"en":"Cowiche is a place name in Yakima County, Washington, and it also names nearby features like Cowiche Creek and Cowiche Canyon.","zh":"Cowiche 是美国华盛顿州亚基马县的一处地名，也可指当地的考伊奇溪与考伊奇峡谷等地理景观。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small unincorporated community and surrounding area in Yakima County, Washington, in the Cowiche Valley (U.S.).","zh":"（美国）华盛顿州亚基马县的一个非建制小社区及其周边地区，位于考伊奇谷（Cowiche Valley）。"},"examples":[{"en":"She lives near Cowiche, about a short drive from Yakima.","zh":"她住在考伊奇（Cowiche）附近，离亚基马（Yakima）开车不远。"},{"en":"The road into Cowiche passes orchards and open valley land.","zh":"通往考伊奇的路会经过果园和开阔的谷地。"}]},{"partOfSpeech":"n.","definition":{"en":"the name of local geographic features in the same region, especially Cowiche Creek and Cowiche Canyon.","zh":"该地区若干地理景观的名称，尤其指考伊奇溪（Cowiche Creek）和考伊奇峡谷（Cowiche Canyon）。"},"examples":[{"en":"They hiked along Cowiche Canyon Trail in the spring.","zh":"他们在春天沿着考伊奇峡谷步道徒步。"},{"en":"Snowmelt can raise the water level in Cowiche Creek.","zh":"融雪可能会抬高考伊奇溪的水位。"}]}],"synonyms":["Cowiche Valley","Cowiche Creek","Cowiche Canyon"],"phonetic":"/ˈkaʊ.wɪtʃ/","extraExplanation":["“Cowiche”是地名（专有名词），常见于华盛顿州中部的地理与旅游语境中（如徒步、河谷、果园农业等）。","该词的拼写与读音在当地较固定，但因为是地名，不同说话者可能会有轻微读音差异。","一般认为它与当地原住民语言有关（常被归为亚基马/雅卡马地区的原住民语言来源），用于指代河谷与溪流一带。"]}
{"word":"Cowie","summary":{"en":"“Cowie” is most commonly a surname; in Scottish informal speech it can mean a small cow or a pet name for a cow.","zh":"“Cowie”最常见是姓氏；在苏格兰非正式口语中也可指“小母牛/对母牛的昵称”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scottish, informal) A small cow; a pet name for a cow.","zh":"（苏格兰方言，非正式）小母牛；对母牛的昵称。"},"examples":[{"en":"The bairn fed the cowie by hand.","zh":"那孩子亲手喂那头小母牛。"},{"en":"Grandad kept a wee cowie behind the house.","zh":"爷爷在房子后面养了一头小母牛。"}]},{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A family name (surname).","zh":"（专有名词）姓氏：Cowie。"},"examples":[{"en":"Her last name is Cowie.","zh":"她的姓是 Cowie。"},{"en":"Dr. Cowie will see you now.","zh":"Cowie 医生现在见你。"}]}],"synonyms":["(Scottish) wee cow","(as a surname) family name"],"phonetic":"/ˈkaʊi/","extraExplanation":["“cowie”作为“小母牛/牛的昵称”的用法主要见于苏格兰英语（Scots）与地方口语；在现代标准英语里更常见的是把 Cowie 当作姓氏。","发音通常按“cow + -ie（小词尾/昵称后缀）”来理解：-ie 在英语里常用来表达亲昵或“小”（如 dog → doggie）。"]}
{"word":"cowier","summary":{"en":"“Cowier” is a rare comparative adjective meaning “more cow-like.” In informal speech it can also echo the insulting sense of “cow,” which may be offensive.","zh":"“Cowier”是少见的比较级形容词，意思是“更像牛的”。在非正式语境中也可能带有“cow”作辱骂时的含义，因此可能冒犯他人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) More like a cow; more bovine in appearance or behavior.","zh":"（少见）更像牛的；更具牛的外形或习性特征的。"},"examples":[{"en":"With the oversized spots and slow chewing, the costume looked cowier than before.","zh":"因为夸张的斑点和慢吞吞的咀嚼动作，那套服装看起来比之前更像牛了。"},{"en":"They added a bell and made the character’s walk cowier for the comedy scene.","zh":"他们加了个铃铛，让角色走路更“牛味儿”，用在喜剧场景里。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal, sometimes offensive when used about a person) More like a “cow” in the insulting sense: ruder, nastier, or more unpleasant.","zh":"（非正式；用于形容人时有冒犯性）更像骂人话里的“cow”：更粗鲁、更刻薄或更令人讨厌。"},"examples":[{"en":"After the argument, his comments got cowier and more personal.","zh":"争吵之后，他的话变得更难听、更针对个人了。"},{"en":"Try not to use words like that—calling someone “cowier” can be hurtful.","zh":"尽量别用那种说法——说别人“更像cow/更讨厌”会伤人。"}]}],"synonyms":["more cow-like","more bovine","more cattle-like","ruder (informal sense)","meaner (informal sense)"],"phonetic":"/ˈkaʊiər/","extraExplanation":["“cowier”通常是形容词“cowy”（像牛的）的比较级，但“cowy/cowier”在现代英语里都很少见，更常见的表达是“more cow-like”或“more bovine”。","英式英语里“cow”可作贬义名词来骂人（多指女性，语气粗鲁），因此由此延伸出的用法容易带有性别与人身攻击色彩；学习时更建议用中性词如“meaner / ruder / more unpleasant”。"]}
{"word":"cowiest","summary":{"en":"“Cowiest” means “most cow-like,” and can also jokingly mean “most rustic/country-looking.”","zh":"“cowiest”表示“最像牛的”，也可开玩笑地指“最乡土/最农场风的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Most like a cow in appearance, behavior, or sound; extremely “cow-like.” (Superlative of cowy, often humorous.)","zh":"最像牛的；最“牛里牛气”的（外表、行为或叫声等方面；cowy 的最高级，常带幽默感）。"},"examples":[{"en":"Of all the costumes, his was the cowiest—complete with horns and a big bell.","zh":"在所有服装里，他那套最像牛——还有角和一只大铃铛。"},{"en":"That long, slow “moo” was the cowiest sound I’ve ever heard.","zh":"那声又长又慢的“哞——”是我听过最牛的声音。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal) Most rustic, plain, or unsophisticated in a way that suggests “country” or “farm” life.","zh":"（非正式）最土气的、最朴素的、最不讲究的（带有“乡下/农场气”联想）。"},"examples":[{"en":"He teased his friend for wearing the cowiest boots to the city party.","zh":"他笑朋友去城里聚会还穿了最“乡下”的那双靴子。"},{"en":"This is the cowiest diner in town, and I mean that as a compliment.","zh":"这是镇上最“农场风”的小餐馆——我这是在夸它。"}]}],"synonyms":["most cow-like","bovinelike","rustic","country-looking","homespun"],"phonetic":"/ˈkaʊiɪst/","extraExplanation":["“cowiest”是由形容词“cowy”（像牛的）构成的最高级：cowy → cowier → cowiest。这个词本身不算常见，多用于口语、玩笑或描写风格。","拼写规则：以辅音字母 + y 结尾的形容词变比较级/最高级时，常把 y 变成 i，再加 -er/-est（如 happy → happier → happiest）。"]}
{"word":"cowing","summary":{"en":"“Cowing” means intimidating or subduing someone (the -ing form of the verb “cow”).","zh":"“cowing”指“恐吓、压制他人”（动词 cow 的 -ing 形式）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(present participle of “cow”) intimidating someone; making someone feel afraid or less confident.","zh":"（动词 cow 的现在分词）恐吓、压制；让人害怕或失去信心。"},"examples":[{"en":"The manager’s cowing tone made the new employee afraid to speak up.","zh":"经理那种压人的语气让新员工不敢开口。"},{"en":"She refused to be cowing or cruel, even when she was angry.","zh":"即使生气，她也拒绝用恐吓或刻薄的方式对人。"},{"en":"The dictator kept control through threats and cowing tactics.","zh":"独裁者通过威胁和压制性的手段来维持统治。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or process of intimidating or subduing someone.","zh":"恐吓、压制的行为或过程。"},"examples":[{"en":"The group’s cowing of witnesses made it hard to learn the truth.","zh":"那群人对证人的恐吓让真相难以查清。"},{"en":"Cowing is sometimes used to silence criticism.","zh":"恐吓有时被用来让批评噤声。"}]}],"synonyms":["intimidating","bullying","subduing","daunting","overawing"],"phonetic":"/ˈkaʊɪŋ/","extraExplanation":["“cow”作动词时意为“恐吓、压制”，和名词“cow（母牛）”只是拼写相同、意义不同。日常更常见的是用被动结构：be cowed（被吓住/被压制）。","语气提示：cowing带有“以强压弱、让人不敢反抗”的负面意味；如果只是“让人紧张/害怕”，也可用frightening、scaring等更中性的词。"]}
{"word":"cowinner","summary":{"en":"A co-winner is someone who wins together with another person or team, sharing the same prize or title.","zh":"co-winner 指与他人或他队一起获胜、共同分享同一奖项或头衔的“并列/共同获胜者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or team that wins together with another person or team (sharing the same prize or title)","zh":"共同获胜者；并列冠军（与他人/他队一起分享同一奖项或头衔的人或队伍）"},"examples":[{"en":"The two finalists were declared co-winners after the judges couldn’t break the tie.","zh":"由于评委无法分出胜负，两位决赛选手被宣布为并列冠军。"},{"en":"She was a co-winner of the book award, sharing the prize money with another author.","zh":"她是该图书奖的并列获奖者，与另一位作者共同分享奖金。"}]}],"synonyms":["co-winner","joint winner","shared winner","tied winner"],"phonetic":"/koʊ ˈwɪnər/","extraExplanation":["“cowinner”更常见的写法是 **co-winner**（带连字符），也可写作 **co-winner(s)**。在正式写作中，带连字符更清晰，表示“共同/并列”的意思。","常见搭配：**co-winner of + 奖项/比赛**（……的并列获胜者），例如：co-winner of the championship。","含义通常与 **joint winner**（共同获胜者）或 **tied winner**（并列获胜者）接近，具体用哪个取决于文体与语境。"]}
{"word":"cowinners","summary":{"en":"Co-winners are two or more people/teams who share a win or prize.","zh":"cowinners 指两人或多人（或队伍）共享同一胜利或奖项的“共同获胜者/并列冠军”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who win something together (for example, two or more winners sharing the same prize or title)","zh":"共同获胜者；并列冠军（指两人或多人一起赢得同一奖项或头衔）"},"examples":[{"en":"The two teams were declared co-winners after the final ended in a tie.","zh":"决赛以平局结束后，两支队伍被宣布为并列冠军。"},{"en":"They were co-winners of the science fair and shared the scholarship.","zh":"他们是科学展的共同获胜者，并分享了奖学金。"}]}],"synonyms":["joint winners","shared winners","tied winners"],"phonetic":"/ˌkoʊˈwɪnərz/","extraExplanation":["“co-”表示“共同、一起”。常见写法有 co-winners（带连字符）或 co winners（较少见）；在新闻报道和正式写作中更常用带连字符的形式。","如果是指“并列第一/并列冠军”，也常见说法：joint winners / tied winners。"]}
{"word":"cowish","summary":{"en":"Cowish means “cow-like,” sometimes humorously descriptive, but it can also be a rare insult meaning dull or clumsy.","zh":"cowish 表示“像牛的”，可作幽默描写；也可作罕见贬义，指迟钝或笨拙。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like a cow; bovine in appearance or behavior (often used humorously or descriptively).","zh":"像牛的；具有母牛/牛类特征的（常带幽默或描写色彩）。"},"examples":[{"en":"The cowish calf followed its mother everywhere, calm and slow.","zh":"那只很“牛气”的小牛犊到处跟着妈妈，安静又慢吞吞。"},{"en":"He gave a cowish stare, as if he didn’t understand the joke.","zh":"他露出一种“牛一样”的愣愣表情，好像没听懂这个玩笑。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare, usually insulting) Dull, clumsy, or stupid in a way stereotypically associated with cows.","zh":"（罕见，常带侮辱）笨拙的、迟钝的；像刻板印象中“牛一样”不灵光的。"},"examples":[{"en":"The critic called the performance cowish and heavy.","zh":"评论家说这场表演笨重迟钝，毫无灵气。"},{"en":"Don’t use “cowish” to describe people—it can sound rude.","zh":"别用“cowish”形容人——听起来会很无礼。"}]}],"synonyms":["bovine","cowlike","oxlike","slow","clumsy","dull"],"phonetic":"/ˈkaʊɪʃ/","extraExplanation":["“cowish”不是常用词，更常见的说法是“bovine”（更正式）或用更具体的形容词如“slow / clumsy / dull”。","词尾“-ish”常表示“有点像……”“带点……的感觉”（如 childish, sheepish）。因此 cow + ish = “有点像牛的”。","在英美语境里，把人比作牛/母牛可能带有贬义或冒犯意味；写作或交流时建议谨慎使用，尤其避免指向真实人物的外貌。"]}
{"word":"cowishness","summary":{"en":"Cowishness means timidity or meekness (rare), and sometimes a cow-like look or manner.","zh":"cowishness 指胆怯、温顺软弱（较少见），有时也指像牛一样的神态或特征。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being timid, meek, or lacking courage (as if easily “cowed”).","zh":"怯懦、胆小、缺乏勇气的状态（仿佛很容易被吓住、被压制）。"},"examples":[{"en":"He apologized again and again, and his cowishness made it hard to argue with him.","zh":"他一再道歉，那种怯懦的样子让人都不太忍心再跟他争了。"},{"en":"The manager took advantage of her cowishness and pushed extra work onto her.","zh":"经理利用她的胆小软弱，把额外的工作都推给了她。"}]},{"partOfSpeech":"n.","definition":{"en":"the quality of seeming like a cow; a bovine or dull-looking manner (rare).","zh":"像牛一样的特征或神态；带有牛般迟钝/呆滞的样子（较少见）。"},"examples":[{"en":"In the cartoon, the character’s cowishness is shown through wide eyes and slow movements.","zh":"在那部动画里，角色用睁大的眼睛和缓慢的动作表现出一种“牛气”的呆态。"}]}],"synonyms":["timidity","meekness","cowardice","submissiveness","bashfulness"],"phonetic":"/ˈkaʊɪʃnəs/","extraExplanation":["“cowishness”是比较少见、偏文学/玩笑式的构词：cow（牛）+ -ish（有点像……的）+ -ness（……的状态）。在实际英语里，更常见的表达是“timidity / meekness / cowardice”（胆怯/温顺/懦弱）。","注意区分：cow（名词“牛”）和 cow（动词“恐吓、压制”）。如果语境在谈“被吓住”，通常更接近动词 cow 的含义，因此“cowishness”多指“容易被吓住的胆怯”。"]}
{"word":"cowitch","summary":{"en":"Cowitch is a tropical plant whose pods have hairs that cause itching; it can also mean itching powder made from those hairs.","zh":"Cowitch 指一种荚果刺毛会引起瘙痒的热带植物，也可指由其刺毛制成的“痒痒粉”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical vine (Mucuna pruriens) whose seed pods have tiny irritating hairs that cause intense itching; the hairs are sometimes used to make “itching powder.”","zh":"（cowitch / cowhage）一种热带藤本植物（黧豆 Mucuna pruriens），其荚果上有细小刺毛，会引起强烈瘙痒；这些刺毛有时被用来制作“痒痒粉”。"},"examples":[{"en":"Touching cowitch pods can make your skin itch for hours.","zh":"碰到 cowitch 的荚果可能会让皮肤痒上好几个小时。"},{"en":"Someone played a prank with cowitch powder, and everyone started scratching.","zh":"有人用 cowitch 痒痒粉恶作剧，结果大家都开始挠个不停。"}]}],"synonyms":["cowhage","Mucuna pruriens","itching powder"],"phonetic":"/ˈkaʊˌɪtʃ/","extraExplanation":["cowitch 也常拼作 cowhage（读音相近），在北美英语里两种拼写都能见到。","它的刺毛含有会刺激皮肤与黏膜的成分（常提到的包括 mucunain），所以不要用手直接揉眼睛或接触口鼻；若不慎接触，可用胶带轻轻粘除刺毛并用清水冲洗。","在一些语境中它会出现在“整人/恶作剧”的文化背景里（itching powder），但对过敏体质或皮肤敏感的人可能造成更严重反应，现实中不建议使用。"]}
{"word":"cowk","summary":{"en":"“cowk” isn’t a standard English word; it’s likely a misspelling of a similar-looking word (e.g., “cork,” “cook,” or “cow”).","zh":"“cowk”不是标准英语词，通常是拼写错误，可能想写“cork / cook / cow”等相近单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; commonly a misspelling or typo (often intended to be “cork,” “cook,” “cow,” or “cock”).","zh":"不是标准英语单词；常见于拼写错误或输入失误（通常可能想写“cork / cook / cow / cock”）。"},"examples":[{"en":"I can’t find “cowk” in the dictionary—did you mean “cork” or “cook”?","zh":"我在词典里找不到“cowk”——你是想写“cork（软木塞）”还是“cook（做饭）”？"}]}],"extraExplanation":["“cowk”在英语里没有通用、规范的词义，因此更像是拼写错误。你可以告诉我你的句子或想表达的意思，我就能帮你确认正确单词。","常见可能词：\n- cork /kɔrk/：软木塞；（用软木塞）塞住\n- cook /kʊk/：做饭；厨师\n- cow /kaʊ/：母牛\n- cock /kɑk/：公鸡；也有粗俗含义（指男性生殖器），使用时要注意场合与语气。"]}
{"word":"cowkeeper","summary":{"en":"A cowkeeper is someone who looks after cows, often on a farm.","zh":"cowkeeper 指照看牛（尤其是奶牛/牛群）的人，多在农场语境使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person whose job is to take care of cows (feeding, herding, and sometimes milking them).","zh":"照看奶牛/牛群的人（负责喂养、放牧，有时也包括挤奶）。"},"examples":[{"en":"The cowkeeper led the herd back to the barn at sunset.","zh":"日落时，牛倌把牛群赶回了牛棚。"},{"en":"In the village, the cowkeeper knew every cow by name.","zh":"在村里，牛倌能叫出每头牛的名字。"},{"en":"She worked as a cowkeeper on a dairy farm during the summer.","zh":"夏天她在一家奶牛场当牛倌。"}]}],"synonyms":["cowherd","herdsman","dairyman","cattleman"],"phonetic":"/ˈkaʊˌkiːpər/","extraExplanation":["“cowkeeper”在现代英语里不算常见，更常见的说法是 **cowherd**（牛倌/牧牛人）、**herdsman**（牧人/放牧者）或在奶牛场语境中用 **dairy worker / dairyman**（奶牛场工人/奶农）。","构词很好理解：**cow**（牛）+ **keeper**（看管者）。在文学或较旧的乡村语境中更容易见到这种合成词。"]}
{"word":"cowkine","summary":{"en":"“cowkine” isn’t a standard word; it’s likely a misspelling of “cocaine” or a mix-up with “kine” (old plural of cow).","zh":"“cowkine”不是标准词；可能是把“cocaine”拼错，或误写成了“kine”（cow 的古复数）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling of “cocaine” (a drug) or a confusion with “kine” (an old/poetic plural of “cow,” meaning cattle).","zh":"不是标准英语单词。很可能是把“cocaine（可卡因，一种毒品）”拼错了，或与“kine（古/诗意用法，cow 的复数，指牛群/牲畜）”混淆了。"},"examples":[{"en":"Did you mean “cocaine”? That spelling is common in typos.","zh":"你是不是想写“cocaine”？这个拼法很常见于打字错误。"},{"en":"In older writing, you may see “kine” meaning cattle.","zh":"在较老的写作中，你可能会看到“kine”表示牛群/牲畜。"}]}],"extraExplanation":["“kine”是古英语/诗歌或圣经风格中偶尔出现的复数形式（相当于现代英语的“cows”或“cattle”），在当代口语与常规写作里几乎不用。","如果你本来想查的是“cocaine”，我也可以提供该词的发音、常见用法与更安全的学习例句（不会涉及使用方法）。请回复确认你想要哪一个词。"]}
{"word":"cowl","summary":{"en":"A cowl is usually a hood on a cloak or robe; it can also mean a protective hood/cover on a machine, and as a verb it means to cover with a hood.","zh":"cowl 通常指斗篷或长袍上的兜帽；也可指机器上的保护罩盖；作动词表示用兜帽遮盖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hood, especially one attached to a cloak or robe, that covers the head and sometimes the neck or shoulders.","zh":"（尤指长袍或斗篷上的）兜帽；罩头（常覆盖头部，有时连同颈肩）"},"examples":[{"en":"The monk pulled up his cowl before entering the cold chapel.","zh":"修士在进入寒冷的礼拜堂前把兜帽拉了起来。"},{"en":"Her cloak had a deep cowl that shadowed her face.","zh":"她的斗篷有一个很深的兜帽，把脸都遮在阴影里。"}]},{"partOfSpeech":"n.","definition":{"en":"A covering or hood-shaped part on a machine or vehicle that protects an engine or opening (often used as “cowling”).","zh":"（机器或交通工具上的）罩盖/罩壳（用于保护发动机或开口；常用 cowling）"},"examples":[{"en":"The mechanic removed the cowl to inspect the engine.","zh":"修理工拆下罩盖来检查发动机。"}]},{"partOfSpeech":"v.","definition":{"en":"To cover or hood (someone or something), especially as if with a hood.","zh":"给……戴上兜帽；遮盖（尤指像用兜帽一样罩住）"},"examples":[{"en":"In the story, the figure was cowled in a dark robe.","zh":"在故事里，那个人披着黑袍、戴着兜帽。"}]}],"synonyms":["hood","cowling","covering"],"phonetic":"/kaʊl/","extraExplanation":["“cowl”常让人联想到中世纪修士的服饰（monk’s cowl），在文学与电影中也常用来营造神秘、隐匿身份的氛围。","工程语境里更常见的是“cowling”（如 engine cowling），但口语或简写中有时也会说“cowl”。"]}
{"word":"cowl-like","summary":{"en":"Cowl-like means shaped like a hood or draping covering around the head/neck.","zh":"cowl-like 指“兜帽状的；像罩帽一样垂坠并包裹头颈的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Shaped like a cowl (a hood or loose covering that drapes around the head/neck).","zh":"像兜帽（cowl；一种宽松垂坠、包住头部或颈部的罩帽）一样的；兜帽状的。"},"examples":[{"en":"The statue’s cowl-like hood cast a deep shadow over its face.","zh":"雕像那顶兜帽状的头罩在脸上投下了很深的阴影。"},{"en":"She wore a coat with a cowl-like collar that wrapped around her neck.","zh":"她穿的外套有个兜帽状的领子，能把脖子围起来。"}]}],"synonyms":["hooded","hoodlike","capped","mantled","draped"],"phonetic":"/ˈkaʊlˌlaɪk/","extraExplanation":["“cowl”在英语里常指两类东西：①修道士/僧侣穿的罩帽式头巾或连帽长袍的一部分；②衣物上的“垂坠式大领口/兜帽领”（cowl neck）。因此“cowl-like”常用来形容“像兜帽那样包裹、下垂、形成阴影或遮蔽感”的形状与效果。","在文学或描写中，cowl-like 常带一点“神秘、隐匿、庄重或阴影笼罩”的意象，比如形容披风、兜帽、云层或建筑的遮檐。"]}
{"word":"cowl-shaped","summary":{"en":"Cowl-shaped means shaped like a hood (a cowl), often forming a hooded, curved covering.","zh":"cowl-shaped 指“兜帽形的”，外形像风帽/兜帽一样向前弯覆、形成罩口。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape of a cowl (a hood or hood-like covering), often curving forward or forming a hooded opening.","zh":"呈“兜帽/风帽”形的；像兜帽一样向前弯覆、形成罩口的。"},"examples":[{"en":"The jacket has a cowl-shaped collar that drapes softly around the neck.","zh":"这件夹克有一个兜帽形的领口，柔软地垂在脖子周围。"},{"en":"A cowl-shaped vent helps direct smoke upward and away from the wall.","zh":"兜帽形的通风罩有助于把烟气向上引导并远离墙面。"},{"en":"In the diagram, the cowl-shaped structure protects the opening beneath it.","zh":"在示意图中，这个兜帽形结构保护了它下方的开口。"}]}],"synonyms":["hood-shaped","hooded","cowl-like","hoodlike"],"phonetic":"/ˈkaʊl ˌʃeɪpt/","extraExplanation":["“cowl”原指修士或僧侣穿的连帽外衣（兜帽部分也可称cowl），因此“cowl-shaped”常用来描述“像兜帽一样罩住/包覆开口”的外形。这个形容词在服装设计、建筑/通风设备以及解剖学描述中都比较常见。"]}
{"word":"cowl-staff","summary":{"en":"Cowl-staff is an archaic word for a monk’s or pilgrim’s staff, and it can also symbolize setting out on a wandering life (often in “take up the cowl-staff”).","zh":"cowl-staff 是古语，指与修士或朝圣者相关的行杖；也可象征踏上漂泊之路（常见于“take up the cowl-staff”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) A staff (walking stick) traditionally associated with a monk, friar, or pilgrim—especially one wearing a cowl (a hooded robe).","zh":"（古语）与修士、托钵僧或朝圣者相关的手杖/行杖，尤指穿戴兜帽长袍（cowl）的人所持的杖。"},"examples":[{"en":"In old stories, the pilgrim leaned on his cowl-staff as he crossed the hills.","zh":"在古老的故事里，朝圣者翻越山丘时倚着他的朝圣杖（cowl-staff）。"},{"en":"The painting shows a hooded friar with a cowl-staff in his hand.","zh":"这幅画描绘了一位戴兜帽的修士，手里拿着一根行杖（cowl-staff）。"}]},{"partOfSpeech":"phrase","definition":{"en":"(In older writing, often in the phrase “take up the cowl-staff”) To set out like a pilgrim or wandering religious beggar; by extension, to begin a life of wandering.","zh":"（旧时用法，常见于短语“take up the cowl-staff”）像朝圣者或游行的托钵修士那样出发；引申为开始漂泊的生活。"},"examples":[{"en":"After the scandal, he ‘took up the cowl-staff’ and disappeared from the town.","zh":"丑闻之后，他“拿起朝圣杖（take up the cowl-staff）”离开小镇，从此不见踪影。"},{"en":"The poem uses “cowl-staff” as a symbol of leaving home behind.","zh":"这首诗用“cowl-staff”象征离乡与远行。"}]}],"synonyms":["pilgrim’s staff","walking stick","staff","beggar’s staff"],"phonetic":"/ˈkaʊl stæf/","extraExplanation":["“cowl-staff”由 cowl（兜帽长袍，常见于中世纪修会服饰）+ staff（手杖）组成，因此带有明显的中世纪宗教与朝圣文化色彩。","现代英语中几乎不日常使用，多见于古书、历史小说或诗歌里，用来营造“修士/朝圣者/漂泊者”的意象。"]}
{"word":"cowle","summary":{"en":"“Cowle” is a rare spelling of “cowl,” meaning a hood (especially a monk’s hood) or a hood-like cover.","zh":"“cowle”多为“cowl”的少见拼写，指兜帽（尤指修士兜帽）或类似兜帽的罩子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/variant spelling) a hood or loose covering for the head and neck, especially on a monk’s robe; also any hood-like cover on clothing or equipment.","zh":"（少见/变体拼写）兜帽；（尤指）修士长袍上的连帽；也可指衣物或设备上的任何“像兜帽一样的罩子”。"},"examples":[{"en":"In some old texts, you may see “cowle” used where modern English would write “cowl.”","zh":"在一些旧文本里，你可能会看到用“cowle”，而现代英语通常写作“cowl”。"},{"en":"The monk pulled up his cowl (cowle) to shield his face from the wind.","zh":"修士把兜帽（cowl/cowle）拉起来，挡住风吹到脸上。"}]}],"synonyms":["cowl","hood","covering"],"phonetic":"/kaʊl/","extraExplanation":["“cowle”不是现代英语里常用的标准拼写，更常见的是“cowl”。如果你是在小说、古英语风格文本、姓氏/地名或特殊行业术语里看到“cowle”，最好结合上下文确认是否就是“cowl（兜帽）”，或是否为专名（如人名/地名）。"]}
{"word":"cowled","summary":{"en":"Cowled means “wearing a hood/cowl” or “having a hood-like covering.”","zh":"cowled 表示“戴着兜帽的”，也可指“带兜帽状罩盖的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Wearing a cowl (a hood or hooded cloak), or having the head/face partly covered by a hood.","zh":"戴着兜帽（或连帽斗篷）的；（头部/脸部）被兜帽部分遮住的。"},"examples":[{"en":"A cowled monk walked quietly through the monastery.","zh":"一位戴着兜帽的修士安静地走过修道院。"},{"en":"The cowled figure stood in the doorway, hard to recognize.","zh":"那个戴兜帽的人影站在门口，很难辨认。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having a hood-shaped covering or protective top (used for objects, animals, or structures).","zh":"带有罩盖/罩形顶盖的；有“兜帽状”覆盖物的（可用于物体、动物或结构）。"},"examples":[{"en":"The streetlamp had a cowled top to direct the light downward.","zh":"那盏路灯有一个罩形顶盖，把光线引导向下。"},{"en":"The engine’s cowled intake helps protect it from rain and debris.","zh":"发动机带罩的进气口有助于防雨防杂物。"}]}],"synonyms":["hooded","cloaked","shrouded","covered"],"phonetic":"/kaʊld/","extraExplanation":["“cowled”来自名词 cowl，最常见的画面是中世纪修士/僧侣穿的兜帽长袍，因此在文学或影视里常用来营造“神秘、隐匿身份、宗教氛围”。","在技术或描述物体时，cowled 常指“带罩的、带外壳的”，强调罩盖的形状像兜帽并具有遮挡或保护作用。"]}
{"word":"cowleech","summary":{"en":"Cowleech is an old word mainly meaning a person who treats sick cows (a cattle veterinarian); more rarely, it can mean a leech that sucks blood from cattle.","zh":"Cowleech 是个旧词，主要指“给牛看病的人（牛的兽医）”；更少见时也可指“附在牛身上吸血的水蛭”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(old-fashioned) A person who treats sick cows; a cattle doctor (veterinarian).","zh":"（旧式用法）给牛看病的人；兽医（尤指治疗牛的）。"},"examples":[{"en":"In the village, people called the cowleech when a cow stopped eating.","zh":"在村里，牛不吃东西时，人们就会去请“cowleech”（给牛看病的人）。"},{"en":"Before modern veterinary clinics, a cowleech often learned by experience and local tradition.","zh":"在现代兽医诊所出现之前，“cowleech”常常靠经验和地方传统来学习治牛。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) A leech that attaches to cattle and sucks blood.","zh":"（罕见）会附在牛身上吸血的水蛭。"},"examples":[{"en":"The farmer checked the cow’s legs for cowleeches after it stood in the pond.","zh":"牛在池塘里站过之后，农夫检查它的腿上有没有吸血的水蛭。"}]}],"synonyms":["veterinarian","vet","cattle doctor","cow doctor"],"phonetic":"/ˈkaʊˌlitʃ/","extraExplanation":["“leech”在古英语里也有“医生/医者”的意思（和古词 lǣce 有关），所以“cowleech”并不一定是“水蛭”，更常见的历史含义是“治牛的医者/兽医”。现代英语更常说 veterinarian / vet / cattle doctor。"]}
{"word":"cowleeching","summary":{"en":"Cowleeching is an archaic word for treating or healing cattle—cattle veterinary work.","zh":"cowleeching 是古义词，指给牛治病的工作/技术，即牛的兽医治疗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) The practice of treating or healing cows (cattle); veterinary care for cattle.","zh":"（古义）给牛（家畜）治病、疗伤；牛的兽医治疗（牛医术）。"},"examples":[{"en":"In old farming records, cowleeching was listed as a separate trade from general medicine.","zh":"在旧时的农场记录里，“cowleeching（牛医术）”常被列为一种独立行业，与普通医疗区分开。"},{"en":"He learned cowleeching from his father and traveled from farm to farm to treat sick cattle.","zh":"他跟父亲学牛医术，走村串户给生病的牛看病。"}]}],"synonyms":["cattle veterinary care","large-animal veterinary work","bovine medicine"],"phonetic":"/ˈkaʊˌlitʃɪŋ/","extraExplanation":["“leech”在古英语里曾指“医生/医者”，因为过去医生常用水蛭放血疗法（bloodletting）。因此“cow leech”就是“给牛看病的人（牛医/兽医）”，cowleeching 指与之相关的行当或技术。","这个词今天非常少见；现代英语更常说 “veterinary care for cattle / cattle veterinary work / a large-animal vet（大型动物兽医）”。"]}
{"word":"Cowles","summary":{"en":"Cowles is most commonly used as a surname; less commonly, it can be a place name.","zh":"Cowles 最常见用作姓氏；较少情况下也可作地名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname).","zh":"（常见）姓氏：考尔斯／考尔兹（Cowles）。"},"examples":[{"en":"Ms. Cowles will lead the meeting this afternoon.","zh":"考尔斯女士将主持今天下午的会议。"},{"en":"I found an article by Cowles in the university archive.","zh":"我在大学档案里找到一篇署名为考尔斯的文章。"}]},{"partOfSpeech":"other","definition":{"en":"a place name used for some locations (less common).","zh":"（较少见）地名：某些地区也用 Cowles 作为地名。"},"examples":[{"en":"They drove through Cowles on their way to the mountains.","zh":"他们去山里路上开车经过了 Cowles。"}]}],"synonyms":["(surname) —","(place name) —"],"phonetic":"/kaʊlz/","extraExplanation":["“Cowles”在英语里最常见是姓氏。英语姓氏常来源于职业、地名或祖先名字；该姓的具体来源可能因家族而异。","学术与历史语境中，你可能会见到“The Cowles Commission”（考尔斯委员会），与20世纪经济学与计量经济学发展有关；此处的 Cowles 也是姓氏。"]}
{"word":"Cowlesville","summary":{"en":"Cowlesville is a U.S. place name, referring to a small community (e.g., in New York).","zh":"Cowlesville 是美国的一个地名，常指一个小型社区（如纽约州的 Cowlesville）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name (proper noun), used for a small community in the United States (for example, Cowlesville in New York State).","zh":"地名（专有名词），用于指美国的一个小型社区/聚居地（例如纽约州的 Cowlesville）。"},"examples":[{"en":"Cowlesville is a small community in western New York.","zh":"Cowlesville 是纽约州西部的一个小社区。"},{"en":"I drove through Cowlesville on my way to Buffalo.","zh":"我去布法罗的路上开车经过了 Cowlesville。"}]}],"synonyms":["(no true synonyms; proper place name)"],"phonetic":"/ˈkaʊlzˌvɪl/","extraExplanation":["“Cowlesville”属于典型的美国地名构词：姓氏（Cowles）+ “-ville”（表示“城镇/聚居地”）。这类地名常源于早期定居者、地主或地方家族的姓氏。","在地址或地图中，它通常指“hamlet / unincorporated community”（小聚居点/非建制社区），可能没有独立市政府机构，行政上隶属于更大的城镇或县。"]}
{"word":"Cowley","summary":{"en":"Cowley is usually a surname or an English place name (notably an area of Oxford); it can also refer to the English poet Abraham Cowley.","zh":"Cowley 通常是一个姓氏或英国地名（尤其指牛津的 Cowley 区）；也可能指英国诗人亚伯拉罕·考利。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A surname (family name).","zh":"一个姓氏（家族姓）。"},"examples":[{"en":"Her last name is Cowley.","zh":"她的姓是 Cowley。"},{"en":"I met Dr. Cowley at the conference.","zh":"我在会议上见到了 Cowley 博士。"}]},{"partOfSpeech":"other","definition":{"en":"A place name in England, especially Cowley (an area of Oxford), and also other smaller places with the same name.","zh":"英国的地名，尤其指牛津的 Cowley（一个地区）；也可能指其他同名小地方。"},"examples":[{"en":"He lives in Cowley, Oxford.","zh":"他住在牛津的 Cowley 区。"},{"en":"We took the bus through Cowley Road.","zh":"我们坐公交经过 Cowley Road。"}]},{"partOfSpeech":"other","definition":{"en":"Abraham Cowley (1618–1667), an English poet and essayist; the name may refer to him in literature or history contexts.","zh":"亚伯拉罕·考利（1618–1667），英国诗人、散文家；在文学或历史语境中可能指他。"},"examples":[{"en":"The lecture mentioned Cowley as a 17th-century poet.","zh":"讲座提到 Cowley 是一位 17 世纪诗人。"},{"en":"She wrote a short paper on Cowley’s poems.","zh":"她写了一篇关于 Cowley 诗歌的短论文。"}]}],"phonetic":"/ˈkaʊli/","extraExplanation":["“Cowley”常见于英国语境：一方面是姓氏；另一方面是地名（如牛津的 Cowley 区以及 Cowley Road）。如果你在地图、地址、新闻里看到它，多半是地名；在人物介绍、作者署名、学术引用里则多半是姓或指诗人 Abraham Cowley。","读音通常重音在前：COW-lee。作为专有名词，首字母要大写。"]}
{"word":"cowlick","summary":{"en":"A cowlick is a stubborn swirl or tuft of hair that grows in a different direction and won’t lie flat.","zh":"cowlick 指一撮顽固的翘发/发旋，头发朝不同方向生长，常常怎么梳都不平。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tuft or section of hair that grows in a different direction from the rest, often sticking up or forming a swirl (commonly on the crown or near the hairline).","zh":"（头发的）翘发；乱翘的一撮；发旋（某一撮头发与其他方向不同，常在头顶或发际线处打转或翘起）。"},"examples":[{"en":"I always wake up with a cowlick on the back of my head.","zh":"我总是起床后后脑勺会有一撮翘发。"},{"en":"Her bangs kept separating because of a small cowlick near her forehead.","zh":"因为额头附近有个小发旋，她的刘海总是分开。"},{"en":"The barber asked if I had any cowlicks before cutting my hair short.","zh":"理发师在把我头发剪短前先问我有没有翘发（发旋）。"}]}],"synonyms":["hair whorl","swirl","tuft (of hair)","cow-lick (variant spelling)"],"phonetic":"/ˈkaʊˌlɪk/","extraExplanation":["“cowlick”是一个很生活化的词，常用来形容“怎么梳都不服帖”的那撮头发。词源来自一种形象说法：像被牛舔过（lick）一样，毛发被舔得朝奇怪的方向倒伏或翘起。","在理发/造型语境里，cowlick很重要：剪得越短越容易显出来；造型时常用吹风机、定型产品或改变分缝来“驯服”它。","相关常见说法：hair whorl（更中性/偏专业：发旋）、bedhead（睡乱的头发，不一定是发旋）。"]}
{"word":"cowlicks","summary":{"en":"Cowlicks are sections of hair that naturally grow in a different direction and won’t lie flat.","zh":"cowlicks 指头发自然逆向生长、很难梳平的“旋儿/翘发”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small section of hair that grows in a different direction from the rest, often sticking up and being hard to comb flat.","zh":"（头发的）旋儿；一撮逆着方向生长、常常翘起且很难梳平的头发。"},"examples":[{"en":"He has a cowlick at the front, so his bangs never lie flat.","zh":"他前额有个旋儿，所以刘海怎么也贴不平。"},{"en":"I tried gel, but the cowlick kept sticking up.","zh":"我试了发胶，但那撮旋儿还是一直翘着。"}]}],"synonyms":["hair whorl","whorl","tuft"],"phonetic":"/ˈkaʊˌlɪk/","extraExplanation":["“cowlick”常被用来形容头顶或额前那种“总是翘起”的头发。词源带有形象比喻：像被小牛舔过一样乱翘（lick=舔）。","复数是 cowlicks。日常生活里更口语的说法也可以是“a stubborn cowlick（很顽固的旋儿）”。"]}
{"word":"cowlike","summary":{"en":"Cowlike means “like a cow,” often implying a heavy, slow, or placid look or manner.","zh":"cowlike 意为“像牛的”，常暗示笨重、迟缓或温顺的神态/行为。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a cow in appearance or behavior (often describing a heavy, slow, or placid look).","zh":"像牛的；具有牛的外貌或行为特征（常用来形容笨重、迟缓或温顺的样子）。"},"examples":[{"en":"The cartoon drew the monster with a cowlike face and big, gentle eyes.","zh":"漫画把怪物画成一张牛一般的脸，还有一双又大又温和的眼睛。"},{"en":"He gave a cowlike stare, calm and a little blank.","zh":"他投来一种牛一般的凝视，平静但有点发愣。"}]}],"synonyms":["bovine","oxlike"],"phonetic":"/ˈkaʊˌlaɪk/","extraExplanation":["“cowlike”通常是描述性的中性词，但在形容人时有时会带一点贬义（暗示“迟钝、呆滞”或“不够机灵”）。如果你想更礼貌，可以换成“gentle-looking（看起来温和）”“placid（平静温顺的）”。","构词：cow + -like（“像……一样”）。类似的词还有“childlike（孩子般的）”“catlike（猫一般的）”。"]}
{"word":"cowling","summary":{"en":"Cowling means a protective outer cover around an engine or machinery, especially on aircraft or vehicles.","zh":"cowling 指包覆发动机或机械部件的防护外壳/整流罩，常见于航空与车辆领域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A protective cover (often streamlined) around an engine or other machinery, especially on an aircraft or vehicle.","zh":"（尤指飞机或车辆上）包覆发动机或机械部件的防护外壳；（常为）流线型整流罩。"},"examples":[{"en":"The mechanic removed the cowling to inspect the engine.","zh":"技师拆下发动机罩来检查引擎。"},{"en":"Ice built up on the aircraft’s cowling during the flight.","zh":"飞行途中，飞机的发动机整流罩上结了冰。"},{"en":"The new design improves airflow around the cowling.","zh":"新设计改善了发动机罩周围的气流。"}]}],"synonyms":["engine cover","engine shroud","nacelle (aviation, related)","fairing (related)"],"phonetic":"/ˈkaʊlɪŋ/","extraExplanation":["“cowling”来自“cowl”（兜帽/罩），引申为“像兜帽一样罩住某物的外壳”。在航空英语里很常见，通常指包住发动机的外罩，用于保护、导流散热并减少阻力。"]}
{"word":"cowlings","summary":{"en":"Cowlings are protective outer covers around engines or machine parts, especially on aircraft, boats, and motorcycles.","zh":"cowlings 指发动机或机械部件的外罩/整流罩，常见于飞机、船只和摩托车。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A protective covering (usually metal) around an engine or machine part, especially on an airplane, motorcycle, or boat, designed to streamline airflow and/or protect components.","zh":"（常为金属的）发动机或机械部件的外罩；尤指飞机、摩托车或船只上的整流罩/发动机罩，用于减少阻力并保护部件。"},"examples":[{"en":"The mechanic removed the cowling to inspect the engine.","zh":"机械师拆下发动机罩来检查引擎。"},{"en":"Cracks in the airplane’s cowling can affect airflow and safety.","zh":"飞机整流罩上的裂纹会影响气流与安全。"},{"en":"The boat’s cowling keeps spray and debris away from the motor.","zh":"船的发动机外罩能防止浪花和杂物溅入马达。"}]}],"synonyms":["engine cover","engine cowl","shroud","housing","fairing (related)"],"phonetic":"/ˈkaʊlɪŋz/","extraExplanation":["“cowlings”是“cowling”的复数形式。单数常用来指飞机的“engine cowling（发动机整流罩）”，在航空语境里也可能简称为“the cowling”。","词源上与“cowl（兜帽/罩袍）”同源，核心概念都是“罩住、包覆”的外壳，因此也可用于更广义的机械外罩（如摩托车的整流罩 fairing 的一部分）。"]}
{"word":"Cowlitz","summary":{"en":"Cowlitz most commonly refers to a river in Washington State, and also to the Cowlitz people (and by extension their culture/language) and local place names like Cowlitz County.","zh":"Cowlitz 最常指美国华盛顿州的考利茨河；也指考利茨族（以及其文化/语言），并用于相关地名，如考利茨县。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a river in southwestern Washington State, U.S., flowing into the Columbia River (often used in place names such as Cowlitz River).","zh":"（美国）华盛顿州西南部的一条河流，汇入哥伦比亚河（常见于地名，如“Cowlitz River 考利茨河”）。"},"examples":[{"en":"We went fishing on the Cowlitz River after work.","zh":"下班后我们去考利茨河钓鱼了。"},{"en":"The flood warnings included communities along the Cowlitz.","zh":"洪水预警涵盖了考利茨河沿岸的社区。"}]},{"partOfSpeech":"n.","definition":{"en":"a Native American people traditionally living in what is now southwestern Washington; also used to refer to their language and culture.","zh":"考利茨族：传统上居住在今美国华盛顿州西南部的原住民族；也可指其语言与文化。"},"examples":[{"en":"The museum hosted an exhibit on Cowlitz history and traditions.","zh":"博物馆举办了关于考利茨族历史与传统的展览。"},{"en":"She attended a community event organized by the Cowlitz Indian Tribe.","zh":"她参加了由考利茨印第安部族组织的社区活动。"}]},{"partOfSpeech":"n.","definition":{"en":"a county in Washington State named after the river and people (Cowlitz County).","zh":"考利茨县：美国华盛顿州的一个县，名称来自考利茨河与考利茨族（Cowlitz County）。"},"examples":[{"en":"He works for the public health department in Cowlitz County.","zh":"他在考利茨县的公共卫生部门工作。"},{"en":"Housing prices vary across Cowlitz County.","zh":"考利茨县各地的房价差异很大。"}]}],"phonetic":"/ˈkaʊlɪts/","extraExplanation":["“Cowlitz”是专有名词，常见于美国西北部（Pacific Northwest）的地名与族名。读写时要注意首字母大写。","词源来自当地原住民语言（与萨利希语族相关的地区语言传统），因此拼写与发音不完全符合常见英语拼读规则：常读作 /ˈkaʊlɪts/（类似“COW-lits”）。"]}
{"word":"cowlitz","summary":{"en":"Cowlitz is most commonly a proper name in Washington State: a river, a county, and the Cowlitz Native people.","zh":"Cowlitz 多为美国华盛顿州的专有名词：指考利茨河、考利茨县，以及考利茨原住民族群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a river in southwestern Washington State, USA, flowing into the Columbia River","zh":"（美国）华盛顿州西南部的一条河，汇入哥伦比亚河"},"examples":[{"en":"The Cowlitz River is popular for fishing and boating.","zh":"考利茨河很受钓鱼和划船爱好者欢迎。"},{"en":"After heavy rain, the Cowlitz can rise quickly.","zh":"大雨之后，考利茨河的水位可能会迅速上涨。"}]},{"partOfSpeech":"n.","definition":{"en":"a county in southwestern Washington State (Cowlitz County)","zh":"（美国）华盛顿州西南部的一个县（考利茨县）"},"examples":[{"en":"She works in Longview in Cowlitz County.","zh":"她在考利茨县的朗维尤工作。"}]},{"partOfSpeech":"n.","definition":{"en":"a Native American people of the Pacific Northwest (the Cowlitz people), and related community names","zh":"（美国太平洋西北地区的）考利茨原住民（族群名称），也用于相关社群名称"},"examples":[{"en":"The museum has exhibits about the history of the Cowlitz people.","zh":"博物馆有关于考利茨族历史的展览。"}]}],"synonyms":["Cowlitz River","Cowlitz County","Cowlitz people"],"phonetic":"/ˈkaʊlɪts/","extraExplanation":["“Cowlitz”常见于地名与族名：如 Cowlitz River（考利茨河）、Cowlitz County（考利茨县）。在美国语境中多为专有名词，书写首字母通常大写。","词源与当地原住民语言有关；不同资料对其确切来源解释不一，但都与太平洋西北地区原住民历史与地理密切相关。"]}
{"word":"cowls","summary":{"en":"Cowls are hoods (especially on monks’ robes) or hood-like coverings on things like chimneys or engines; “to cowl” means to cover or hide like with a hood.","zh":"cowls 指兜帽（尤指修士长袍上的兜帽）或类似兜帽的罩（如烟囱帽、引擎罩）；作动词表示用兜帽遮住或掩盖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a loose hood (often part of a monk’s robe) that covers the head and sometimes the shoulders","zh":"（常指修士长袍上的）兜帽；连帽披肩（可覆盖头部，有时也盖住肩部）"},"examples":[{"en":"The monk pulled his cowl forward to hide his face from the cold wind.","zh":"修士把兜帽拉到前面，挡住寒风、遮住脸。"},{"en":"In the painting, each figure wears a dark cowl and a long robe.","zh":"在那幅画里，每个人物都穿着深色兜帽和长袍。"}]},{"partOfSpeech":"n.","definition":{"en":"a covering or hood-like part on a machine or building (for example, on a chimney or an engine)","zh":"（机器或建筑上的）罩；风帽（如烟囱帽、引擎罩等）"},"examples":[{"en":"Birds kept nesting near the chimney, so they installed a metal cowl.","zh":"鸟总在烟囱附近筑巢，所以他们装了一个金属烟囱帽。"},{"en":"Steam rose from beneath the engine cowl.","zh":"蒸汽从引擎罩下面冒出来。"}]},{"partOfSpeech":"v.","definition":{"en":"to cover with a hood or to hide as if with a hood","zh":"给……戴兜帽；（像用兜帽一样）遮住、掩盖"},"examples":[{"en":"Her hair was cowled by the scarf.","zh":"她的头发被围巾罩住了。"},{"en":"The statue’s face was cowled in shadow.","zh":"雕像的脸隐在阴影里。"}]}],"synonyms":["hood","cap","covering","mantle","shroud"],"phonetic":"/kaʊl/","extraExplanation":["“cowl”在英语里常带有中世纪修道院的文化联想：戴着兜帽的修士形象经常出现在宗教绘画、文学与影视作品中，用来传达“隐匿、沉静、神秘”等气氛。","工程/建筑语境中，“cowl”多指“罩、风帽”，常见搭配如 chimney cowl（烟囱帽）用来防雨、防倒灌、改善通风。"]}
{"word":"cowlstaff","summary":{"en":"An old word for a carrying pole used to transport a large tub or bucket (a cowl).","zh":"旧词：用于搬运大桶/容器（cowl）的挑杆/抬杆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A long pole used (often by two people) to carry a cowl—a large tub, bucket, or vessel—by hanging it between the ends of the pole.","zh":"（旧用语）扁担/挑杆：用一根长杆（常由两人抬），把“cowl”（大桶、木桶或容器）挂在两端之间来搬运。"},"examples":[{"en":"In old accounts of village work, two laborers carried water with a cowlstaff.","zh":"在一些旧时乡村劳作的记载中，两名工人用 cowlstaff 抬水。"},{"en":"The museum labels the wooden pole as a cowlstaff once used for moving heavy tubs.","zh":"博物馆说明牌把这根木杆标注为 cowlstaff，过去用来搬运沉重的桶。"}]}],"synonyms":["carrying pole","yoke","pole","cowl-staff"],"phonetic":"/ˈkaʊlˌstæf/","extraExplanation":["这是一个非常古旧、少见的词，现代英语里几乎不用；更常见的说法会根据地区用 yoke（扁担/轭）或 pole 来描述。","cowl 在这里不是“僧帽/兜帽”的意思，而是指“大桶/容器”。因此 cowlstaff 的核心概念是“用于搬运桶的杆”。","也常写作 cowl-staff。阅读古文、地方志或历史记录时更可能遇到。"]}
{"word":"cowman","summary":{"en":"Cowman means a person—traditionally a man—who looks after cattle, especially on a ranch.","zh":"cowman 指照看牛群的人（传统上多指男性），尤其在牧场环境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A man who tends cattle, especially on a ranch; a cowboy or cattle herder.","zh":"牧牛人；照看牛群的人（尤指牧场里），相当于牛仔或赶牛人。"},"examples":[{"en":"The cowman rode out at dawn to check the cattle.","zh":"牧牛人天一亮就骑马出去查看牛群。"},{"en":"She interviewed a cowman who had worked on the ranch for thirty years.","zh":"她采访了一位在牧场工作了三十年的牧牛人。"}]},{"partOfSpeech":"n.","definition":{"en":"A person (sometimes specifically a man) who works in cattle farming or the cattle industry.","zh":"从事养牛业的人（有时特指男性）。"},"examples":[{"en":"Local cowmen met to discuss cattle prices and grazing land.","zh":"当地的养牛人聚在一起讨论牛价和放牧地。"},{"en":"The region has long been shaped by cowmen and ranching culture.","zh":"这个地区长期受养牛人和牧场文化影响。"}]}],"synonyms":["cowboy","cowhand","herdsman","cattleman","ranch hand"],"phonetic":"/ˈkaʊmən/","extraExplanation":["“cowman”在现代口语中不如“cowboy”“ranch hand”常见，更偏传统/地区用法（如美国西部或英式语境）。","性别用法上，字面含义是“男牧牛人”，但当代写作中若想更中性，可用“cattle worker / ranch worker / ranch hand”。","相关词：cowhand（牧场雇工/牛仔，较常见）、herdsman（牧人，偏通用）、cattleman（养牛业者/牧场主，常指经营者或行业人士）。"]}
{"word":"cowmen","summary":{"en":"“Cowmen” means men who work with cattle (cowboys/cattle herders) or people who raise cattle (cattle ranchers).","zh":"“cowmen”指放牧、照料牛群的牧牛人/牛仔，也可指从事养牛业的养牛人或牧场主。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Men who work with cattle, especially by herding and caring for cows on a ranch; cowboys or cattle herders (plural of “cowman”).","zh":"放牛人、牧牛人；在牧场放牧并照料牛群的男人（“cowman”的复数），也可指牛仔/赶牛人。"},"examples":[{"en":"The cowmen drove the cattle across the river before sunset.","zh":"放牛人们在日落前把牛群赶过了河。"},{"en":"In old Western stories, cowmen often ride for days to find lost calves.","zh":"在老西部故事里，牧牛人常常骑马好几天去找走失的小牛。"}]},{"partOfSpeech":"n.","definition":{"en":"People (often men) who raise cattle as a business; cattle ranchers or cattle breeders (plural of “cowman,” sometimes used more broadly).","zh":"从事养牛业的人（常指男性）；养牛场主/养牛人（“cowman”的复数，有时用得更广）。"},"examples":[{"en":"Local cowmen met to discuss feed prices and water rights.","zh":"当地的养牛人聚在一起讨论饲料价格和用水权。"},{"en":"The drought hit the cowmen hard this year.","zh":"今年的干旱让养牛人损失很大。"}]}],"synonyms":["cowboys","cattlemen","cattle herders","ranchers","herdsmen"],"phonetic":"/ˈkaʊmən/","extraExplanation":["“cowman”在美式语境里常与“cowboy”意义接近，但侧重点不同：cowboy更强调骑马赶牛、在牧场工作的形象；cowman有时更偏向“从事养牛业的人”，包括牧场主或专业养牛者。","在美国文学与电影的“Western（西部题材）”中，cowmen/cowboys常作为19世纪末牧场与拓荒文化的代表形象出现。"]}
{"word":"Cown","summary":{"en":"“Cown” is not a common modern English word; it’s usually a typo (often for “crown”) or a surname.","zh":"“Cown”不是常见的现代英语词；多半是拼写错误（常见把“crown”写错）或用作姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An uncommon or nonstandard spelling in modern English; often a misspelling of “crown” or a mistaken form related to “cow.”","zh":"在现代英语中非常少见或不规范的拼写；常见于把“crown（王冠）”拼错，或与“cow（奶牛）”混淆而产生的误写。"},"examples":[{"en":"I think “cown” is a typo—did you mean “crown”?","zh":"我觉得“cown”可能是打错了——你是不是想写“crown”？"},{"en":"The spellchecker flagged “cown” as an unknown word.","zh":"拼写检查把“cown”标成了未知词。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname).","zh":"姓氏（人名）。"},"examples":[{"en":"Ms. Cown will join the meeting at 3 p.m.","zh":"Cown 女士会在下午三点参加会议。"}]}],"phonetic":"/kaʊn/","extraExplanation":["“Cown”在日常英语里不算常用词。如果你是想表达“王冠/加冕”，通常应为 crown /kraʊn/；如果你是想写“奶牛”，应为 cow /kaʊ/。你可以告诉我你的句子，我帮你确认应该用哪个词。"]}
{"word":"coworker","summary":{"en":"A coworker is someone you work with.","zh":"coworker 指“同事、一起工作的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person you work with, especially in the same company or workplace (not necessarily a close friend).","zh":"同事；一起工作的人（不一定是朋友）。"},"examples":[{"en":"I’ll ask my coworker to cover my shift.","zh":"我会请我的同事帮我代班。"},{"en":"She’s a new coworker in the marketing team.","zh":"她是市场团队的新同事。"},{"en":"I try to be polite to all my coworkers.","zh":"我尽量对所有同事都保持礼貌。"}]}],"synonyms":["colleague","teammate","workmate"],"phonetic":"/ˈkoʊˌwɝkɚ/","extraExplanation":["“Coworker”在美式英语里非常常见，语气中性，既可指同部门也可指同公司的人；如果是同一办公室/同一组的人，也常说“colleague”（更偏正式）或“teammate”（强调同一团队、一起完成任务）。","拼写上常见两种：coworker 与 co-worker。现代写法更常不加连字符。"]}
{"word":"coworkers","summary":{"en":"“Coworkers” means the people you work with.","zh":"“coworkers”指与你一起工作的人，也就是“同事”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People you work with, especially in the same organization or workplace (often on the same team or in the same office).","zh":"同事；一起工作的人（通常指同一公司或同一工作场所的人）。"},"examples":[{"en":"I had lunch with my coworkers after the meeting.","zh":"会议结束后我和同事一起吃了午饭。"},{"en":"She gets along well with her coworkers.","zh":"她和同事相处得很好。"},{"en":"Please be respectful to your coworkers in the chat.","zh":"请在聊天里尊重你的同事。"}]}],"synonyms":["colleagues","workmates","teammates"],"phonetic":"/ˈkoʊˌwɝːkɚz/","extraExplanation":["“coworker(s)”在美式英语中非常常见，语气中性、偏口语；英式英语里也常用“colleague(s)”，但“colleague”通常更正式一些。","拼写上也常见“co-worker / co worker”，但现在更常写作一个词“coworker”。"]}
{"word":"coworking","summary":{"en":"Coworking is working in a shared office space, often used by freelancers and small teams.","zh":"Coworking 指在共享办公空间里工作，常见于自由职业者和小团队。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a way of working in a shared office space, where people from different companies or jobs work near each other and may share facilities","zh":"共享办公：在同一办公空间里工作的一种方式，来自不同公司或职业的人在同一环境中办公，并共享设施"},"examples":[{"en":"Coworking is popular with freelancers who don’t want to work from home every day.","zh":"共享办公很受自由职业者欢迎，因为他们不想每天都在家工作。"},{"en":"Our startup uses a coworking space downtown to save money.","zh":"我们的创业团队在市中心使用共享办公空间来节省成本。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to a shared office space used by people from different organizations","zh":"与共享办公空间有关的；共享办公的"},"examples":[{"en":"They held a meetup in a coworking office near the station.","zh":"他们在车站附近的一家共享办公点举办了聚会。"},{"en":"She prefers a coworking environment because it feels more social.","zh":"她更喜欢共享办公的环境，因为更有社交氛围。"}]}],"synonyms":["shared office","flexible workspace","co-working (variant spelling)"],"phonetic":"/ˈkoʊˌwɝːkɪŋ/","extraExplanation":["“Coworking”通常指一种办公模式，也常指具体的地点“coworking space（共享办公空间）”。在口语里也会说：I work at a coworking space（我在共享办公空间办公）。","常见相关词：freelancer（自由职业者）、remote work（远程工作）、hot desk（不固定工位）、shared office（共享办公室）。","文化语境：共享办公在大城市和科技/创意行业较常见，强调灵活租期、社群活动与资源共享。"]}
{"word":"cowpat","summary":{"en":"A cowpat is a flat piece of cow dung found on the ground, especially in fields.","zh":"cowpat 指地上扁平的一团牛粪，常见于牧场或田野。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a flat, round piece of cow dung (manure) on the ground","zh":"（地上的）牛粪饼；牛粪团"},"examples":[{"en":"Be careful where you step—there’s a cowpat in the grass.","zh":"走路小心点——草里有一坨牛粪。"},{"en":"The field was dotted with cowpats after the cattle moved through.","zh":"牛群走过后，田里到处都是牛粪饼。"}]}],"synonyms":["cow dung","cow manure","cow pie"],"phonetic":"/ˈkaʊˌpæt/","extraExplanation":["“Cowpat”多用于英式英语（英国等地）口语或书面描写，带有乡村/牧场语境；在美式英语里更常见的说法是“cow pie”或更直接的“cow dung”。","词由“cow（牛）+ pat（轻拍、扁平的一团）”组成，形象地描述牛粪落地后扁平、圆团的外观。"]}
{"word":"cowpath","summary":{"en":"Cowpath means a narrow trail made by cows, and it can also mean a habitual “old way” of doing things.","zh":"Cowpath指牛走出来的窄小路径，也可比喻人们习惯沿用、不加思考的“老路”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A narrow path made by cows repeatedly walking the same route; often a small trail across fields or countryside.","zh":"（牛反复走出来的）牛径；乡间田野里的小路、窄道。"},"examples":[{"en":"We followed a cowpath through the meadow to the river.","zh":"我们沿着穿过草地的牛径走到河边。"},{"en":"The old cowpath became a hiking trail over time.","zh":"那条老牛径久而久之变成了徒步小径。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) A habitual, traditional way of doing something—the “well-worn path” people follow without thinking much.","zh":"（比喻）墨守成规的做法；人们不加思考就沿用的老路、惯例。"},"examples":[{"en":"If we always follow the cowpath, we’ll never innovate.","zh":"如果我们总是走老路，就永远无法创新。"},{"en":"She refused to take the cowpath and tried a new approach.","zh":"她不愿走老路，改用一种新方法。"}]}],"synonyms":["cattle path","trail","footpath","track","beaten path","rut"],"phonetic":"/ˈkaʊˌpæθ/","extraExplanation":["“cowpath”常用于乡村/自然写作，带有朴素、田园的意象。比喻义里，它接近“rut（老套、惯性）”或“beaten track（老路）”，常用于谈创新与思维定势。","文学与文化上，英语里常用“path/track/trail”来象征人生选择；“cowpath”因为是动物踩出的路，更强调“习惯造成的路线”，而不一定是经过规划的道路。"]}
{"word":"cowpats","summary":{"en":"Cowpats are flat, round pieces of cow dung found on the ground, especially in fields.","zh":"cowpats 指地上扁圆形的牛粪饼，常见于草地和牧场。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a flat, round piece of cow dung (cow poop), usually found on grass or in fields","zh":"（多见于草地/牧场的）牛粪饼、牛粪团"},"examples":[{"en":"Watch your step—there are cowpats all over the field.","zh":"小心脚下——田里到处都是牛粪饼。"},{"en":"The children laughed when someone nearly stepped in a cowpat.","zh":"有人差点踩到牛粪饼时，孩子们笑了起来。"}]}],"synonyms":["cow dung","cow pie","manure (general)"],"phonetic":"/ˈkaʊˌpæt/","extraExplanation":["“cowpat”在英式英语里更常见；美式英语里更常说“cow pie”或直接说“cow poop/dung”。","这个词常出现在乡村、牧场、徒步等语境里，语气偏口语、带点幽默感；在正式写作里可用“cow dung”。","复数形式是“cowpats”。"]}
{"word":"cowpea","summary":{"en":"A cowpea is a bean/legume (including black-eyed peas) eaten as a food crop.","zh":"cowpea 指一种可食用的豆类作物（包括黑眼豆等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of bean (a legume) with edible seeds, often used in soups, stews, and salads; it includes varieties such as black-eyed peas","zh":"豇豆／牛豌豆：一种豆科植物的食用豆类种子，常用于汤、炖菜、沙拉等；包括黑眼豆等品种"},"examples":[{"en":"In many Southern U.S. dishes, cowpeas are cooked with rice or greens.","zh":"在美国南部的许多菜里，牛豌豆常和米饭或绿叶菜一起煮。"},{"en":"She made a hearty stew with cowpeas, tomatoes, and spices.","zh":"她用牛豌豆、番茄和香料做了一锅浓郁的炖菜。"},{"en":"Black-eyed peas are a popular kind of cowpea.","zh":"黑眼豆是一种很常见的牛豌豆。"}]}],"synonyms":["black-eyed pea","southern pea"],"phonetic":"/ˈkaʊ.piː/","extraExplanation":["“Cowpea”在英语里既可指这种作物本身，也常指它的干豆（可食用的种子）。在不同地区，你可能还会看到它被称为“black-eyed peas（黑眼豆）”或与“yardlong beans（长豆角）”混用；但严格来说，它们是同一物种的不同品种/栽培类型。","在美国文化中，black-eyed peas（作为cowpea的一种）常与新年习俗相关：在一些南方家庭里，新年吃黑眼豆象征好运。"]}
{"word":"cowpeas","summary":{"en":"Cowpeas are edible beans (a warm-climate legume), including black-eyed peas.","zh":"Cowpeas 指可食用的豆类作物（耐热的豆科植物），包括黑眼豆等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of legume (bean) with edible seeds, commonly grown in warm climates; includes varieties like black-eyed peas.","zh":"一种豆科作物（豆子），种子可食用，常在温暖地区种植；包括“黑眼豆”等品种。"},"examples":[{"en":"In many parts of the American South, cowpeas are cooked with rice or greens.","zh":"在美国南部的许多地方，牛豇豆常与米饭或绿叶菜一起烹调。"},{"en":"The farmer planted cowpeas because they can handle heat and improve the soil.","zh":"农民种牛豇豆是因为它们耐热，还能改良土壤。"}]}],"synonyms":["black-eyed peas","southern peas"],"phonetic":"/ˈkaʊ.piːz/","extraExplanation":["cowpea 常用复数 cowpeas 来指这种作物或其豆子。它和中文里常说的“豇豆/长豆角”在日常翻译里容易混用：cowpea 更偏“豇豆属（Vigna unguiculata）的作物及其豆粒”，而“长豆角”通常指其一种长荚品种（yardlong bean）。","在文化语境中，cowpeas（尤其 black-eyed peas 黑眼豆）在美国南部饮食中很常见；例如“新年吃黑眼豆求好运”的传统常被提到。"]}
{"word":"cowpen","summary":{"en":"A cowpen is a place (usually fenced) where cows are kept.","zh":"cowpen 指关牛、养牛的地方，通常是有围栏的牛栏/牛圈。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fenced area or shelter where cows are kept; a cattle pen","zh":"牛栏；关牛的围栏（畜栏）"},"examples":[{"en":"The cows are in the cowpen behind the barn.","zh":"牛在谷仓后面的牛栏里。"},{"en":"He cleaned the cowpen early every morning.","zh":"他每天一大早就打扫牛栏。"}]}],"synonyms":["cow pen","cattle pen","cowshed","byre","barn"],"phonetic":"/ˈkaʊˌpɛn/","extraExplanation":["“cowpen”是由“cow（牛）+ pen（围栏/圈）”组合而成的复合词。更常见的说法包括“cowshed（牛棚）”“cattle pen（牛栏/牛圈）”“barn（谷仓/畜舍）”，具体用哪个取决于是否强调“围起来的圈”还是“有屋顶的棚”。","在不同地区农业语境中也可能写作“cow pen”（两词），含义相同。"]}
{"word":"Cowper","summary":{"en":"Cowper most commonly refers to William Cowper, an English poet and hymn writer; it can also be a surname used in eponymous terms like “Cowper’s glands.”","zh":"Cowper 最常指英国诗人、圣诗作者威廉·考珀；也可作姓氏，并用于如“考珀腺（Cowper’s glands）”这类以人名命名的术语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"William Cowper (1731–1800), an English poet and hymn writer known for clear, natural language and for poems about everyday life and nature.","zh":"威廉·考珀（William Cowper，1731–1800），英国诗人、圣诗作者，以清晰自然的语言以及描写日常生活与自然的诗作闻名。"},"examples":[{"en":"We read Cowper in class to see how 18th-century poets wrote about ordinary life.","zh":"我们在课上读考珀的作品，看看18世纪诗人如何书写普通人的日常生活。"},{"en":"Cowper’s poems often sound simple, but they can be emotionally powerful.","zh":"考珀的诗常常听起来朴素，但情感力量很强。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname; it also appears in some set terms, such as “Cowper’s glands” (a medical/anatomy term named after a person).","zh":"一个姓氏；也会出现在一些固定术语中，例如“Cowper’s glands（考珀腺）”（以人物命名的医学/解剖学术语）。"},"examples":[{"en":"The professor mentioned Cowper’s glands during the anatomy lecture.","zh":"教授在解剖课上提到了考珀腺。"}]}],"phonetic":"/ˈkaʊpər/","extraExplanation":["在英语文学语境里，提到“Cowper”多半指诗人威廉·考珀。他与18世纪英国诗歌传统有关，写作风格偏口语化、贴近日常，也常被用来对比更“华丽”或更“古典”的诗风。","考珀也写过影响很大的圣诗（hymns）。因此在宗教或赞美诗语境中看到 Cowper，往往与圣诗传统相关。","“Cowper’s glands（考珀腺）”属于以人名命名的解剖学术语；遇到这种形式（人名 + ’s + 名词）时，通常表示“某某发现/描述的结构或疾病”。"]}
{"word":"cowper","summary":{"en":"Cowper most often refers to the English poet William Cowper, or (in anatomy) to Cowper’s glands (bulbourethral glands).","zh":"Cowper 常指英国诗人威廉·考珀；在解剖学中也常指 Cowper’s glands（库珀腺/尿道球腺）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper name) William Cowper (1731–1800), an English poet known for clear, everyday language and poems about nature and rural life.","zh":"（专有名词）威廉·考珀（1731–1800），英国诗人，以清晰朴素的语言以及描写自然与乡村生活的诗作闻名。"},"examples":[{"en":"We read a short poem by Cowper in our literature class.","zh":"我们在文学课上读了一首考珀的短诗。"},{"en":"Cowper’s writing often sounds simple, but it can be deeply emotional.","zh":"考珀的写作常常听起来朴素，但可能情感很深。"}]},{"partOfSpeech":"n.","definition":{"en":"(Anatomy, usually in “Cowper’s glands”) the bulbourethral glands—two small glands in the male reproductive system that produce fluid before ejaculation.","zh":"（解剖学，常见于“Cowper’s glands”）尿道球腺（又称库珀腺）——男性生殖系统中的一对小腺体，可在射精前分泌液体。"},"examples":[{"en":"The textbook mentions Cowper’s glands when describing the male reproductive system.","zh":"教材在介绍男性生殖系统时提到了库珀腺。"},{"en":"Cowper’s glands are also called the bulbourethral glands.","zh":"库珀腺也叫尿道球腺。"}]}],"synonyms":["bulbourethral gland"],"phonetic":"/ˈkuːpər/","extraExplanation":["“Cowper”既可能指诗人姓名，也常出现在医学/生物课本里的名词短语“Cowper’s glands（库珀腺）”。在阅读时可以根据上下文判断：文学语境多半是诗人，医学语境多半是腺体。"]}
{"word":"Cowper-esque","summary":{"en":"Cowper-esque means “in the style of William Cowper,” often calm, reflective, and nature-centered.","zh":"Cowper-esque 指“具有威廉·考珀风格的”，常带平静、沉思、以自然为中心的气质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"In the style of (or reminiscent of) William Cowper—typically meaning calm, reflective, morally serious, and nature-focused in tone.","zh":"具有（或让人想起）英国诗人威廉·考珀（William Cowper）风格的；通常指语气平静、沉思、带有道德关怀并偏向自然题材的。"},"examples":[{"en":"The essay ends with a Cowper-esque meditation on quiet rural life.","zh":"这篇文章以一种带有考珀式的、对宁静乡村生活的沉思作结。"},{"en":"Her poem feels Cowper-esque: simple language, gentle humor, and deep feeling.","zh":"她的诗带有考珀式的味道：语言朴素、幽默温和，却情感深沉。"}]}],"synonyms":["Cowper-like","pastoral","reflective","meditative","nature-focused"],"phonetic":"/ˈkuːpər ɛsk/","extraExplanation":["“Cowper-esque”来自诗人 William Cowper（1731–1800）的姓 + 后缀 “-esque”（表示“……风格的/……式的”）。写作中也常见拼写为 “Cowperesque”（不加连字符）。通常用于文学评论或风格描述，带有一定文化/文学背景色彩。","Cowper 的作品常与英国乡村、日常生活的细节、温和的讽刺与道德反思联系在一起；因此说某作品 “Cowper-esque”，多在强调这种“朴素、自然、内省、带温柔道德感”的气质。"]}
{"word":"Cowper-like","summary":{"en":"Cowper-like means “in the style or spirit of the poet William Cowper,” often calm, reflective, and nature-focused.","zh":"Cowper-like 指“具有诗人William Cowper式的风格或气质”，常带有宁静、沉思、偏自然与日常题材的意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling the English poet William Cowper (1731–1800) in style, tone, or subject matter—often meaning calm, reflective, morally thoughtful writing, especially about everyday life and nature.","zh":"具有英国诗人威廉·考珀（William Cowper，1731–1800）风格或气质的；常指平静、沉思、带有道德关怀的写作，尤其写日常生活与自然。"},"examples":[{"en":"The essay’s gentle humor and love of the countryside feel Cowper-like.","zh":"这篇文章温和的幽默感和对乡村的热爱很有“考珀式”的味道。"},{"en":"Her Cowper-like lines focus on small, ordinary moments rather than grand heroics.","zh":"她那些“考珀式”的诗句关注的是平凡的小片刻，而非宏大的英雄叙事。"},{"en":"The poem is Cowper-like in its quiet faith and reflective mood.","zh":"这首诗在安静的信仰与沉思的氛围上很“考珀式”。"}]}],"synonyms":["Cowperesque","pastoral","reflective","gentle","nature-focused"],"phonetic":"/ˈkaʊpər laɪk/","extraExplanation":["“Cowper-like”是一个较文学化的形容词，常见于文学评论或赏析文章里，用来把某人的文风与18世纪英国诗人William Cowper作比较。","Cowper以清晰自然的语言、对自然与日常生活的描写、以及较温和的宗教与道德思考闻名；因此“Cowper-like”往往带有“朴素、宁静、反思、亲近自然”的暗示。","发音提示：Cowper 常读作“KAU-per”（与 cow /kaʊ/ 开头同音）。"]}
{"word":"Cowperian","summary":{"en":"An adjective meaning “in the style of (or relating to) the English poet William Cowper.”","zh":"形容词：指“与英国诗人威廉·考珀有关的；具有考珀风格的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to, characteristic of, or in the style of William Cowper (1731–1800), an English poet and hymn writer (often suggesting clear, moral, nature-focused, or gently reflective writing).","zh":"与英国诗人、圣诗作者威廉·考珀（William Cowper，1731–1800）有关的；具有考珀风格的（常指语言清澈、道德反思、关注自然与日常生活、语气温和沉静）。"},"examples":[{"en":"The essay praises the poem’s Cowperian attention to everyday life and simple rural scenes.","zh":"这篇文章称赞这首诗具有考珀式的特点：关注日常生活与朴素的乡村景象。"},{"en":"Her Cowperian tone is gentle and thoughtful rather than dramatic.","zh":"她的语气很“考珀式”——温和、沉思，而不是戏剧化。"}]}],"synonyms":["Cowper-like","in Cowper’s style","Cowper-esque"],"phonetic":"/kaʊˈpɪriən/","extraExplanation":["“Cowperian”来自诗人 William Cowper 的姓氏 + 形容词后缀 -ian，表示“某人（或其作品）的风格/特征”。","Cowper 以描写自然、乡村生活与个人内心体验而闻名，作品常兼具朴素的语言与道德/宗教思考；他也写过一些广为传唱的英文赞美诗（hymns）。","在文学评论中，“Cowperian”常用于说明一种不夸张、较口语化、带有人文关怀与自然观察的写作气质。"]}
{"word":"cowperian","summary":{"en":"Cowperian means “connected with or typical of the English poet William Cowper,” especially his reflective, nature-centered style.","zh":"Cowperian 指“与英国诗人威廉·考珀有关的或具有其风格的”，常含沉思、自然书写等特征。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or characteristic of William Cowper (1731–1800), an English poet known for reflective, nature-focused, and morally serious writing.","zh":"与英国诗人威廉·考珀（William Cowper，1731–1800）有关的；具有其作品风格特点的（常指沉思、自然书写、道德关怀等）。"},"examples":[{"en":"The essay discusses Cowperian themes such as faith, melancholy, and everyday life.","zh":"这篇论文讨论了具有考珀风格的主题，如信仰、忧郁与日常生活。"},{"en":"Her calm, observational tone feels almost Cowperian in its attention to simple details.","zh":"她平静而细致的观察语气，对简单细节的关注几乎带有考珀式的味道。"}]}],"synonyms":["Cowper-like","in the style of William Cowper"],"phonetic":"/kuːˈpɪriən/","extraExplanation":["“Cowperian”通常用于文学评论语境。William Cowper 的姓 Cowper 常读作“Cooper”（类似 /ˈkuːpər/），因此 Cowperian 的读音也遵循这一传统读法。","Cowper 代表作常被提及的有《The Task》与《Olney Hymns》（与 John Newton 合作）。谈到“Cowperian”风格时，评论者常指其对乡村/自然与内心情绪的细腻描写，以及带有道德或宗教思考的笔调。"]}
{"word":"cowperitis","summary":{"en":"Cowperitis is inflammation of the Cowper’s (bulbourethral) glands.","zh":"Cowperitis 指库珀腺（尿道球腺）发炎。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Inflammation of the Cowper’s glands (bulbourethral glands), two small glands near the base of the penis that produce a lubricating fluid.","zh":"库珀腺（尿道球腺）发炎；库珀腺位于阴茎根部附近，会分泌润滑液。"},"examples":[{"en":"The doctor suspected cowperitis because of pain near the base of the penis and discomfort during urination.","zh":"医生因患者阴茎根部附近疼痛并伴随排尿不适而怀疑是库珀腺炎。"},{"en":"Antibiotics may be used if cowperitis is caused by a bacterial infection.","zh":"如果库珀腺炎由细菌感染引起，可能会使用抗生素治疗。"}]}],"synonyms":["bulbourethral gland inflammation","inflammation of the Cowper’s glands"],"phonetic":"/ˌkaʊpəˈraɪtɪs/","extraExplanation":["“Cowper’s glands”中文常译为“库珀腺/尿道球腺”，属于男性生殖系统的一部分，主要分泌少量透明润滑液（有时称“前列腺液/尿道球腺液”的一部分），在性唤起时帮助润滑尿道。","该词是医学术语，较少出现在日常英语中。常见相关症状可能包括会阴或阴茎根部疼痛、排尿疼痛、分泌物等；具体诊断与治疗需由专业医生评估。"]}
{"word":"cowpie","summary":{"en":"Cowpie means cow dung; informally it can also mean something messy or badly made.","zh":"cowpie 指牛粪；口语中也可指又糟又乱或做得很差的东西。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A piece of cow dung (feces), usually seen as a flat, round lump on the ground.","zh":"牛粪（牛的排泄物），常见为地上一团扁平、圆形的粪便。"},"examples":[{"en":"Watch your step—there’s a cowpie in the grass.","zh":"小心脚下——草地上有一坨牛粪。"},{"en":"The kids laughed when someone accidentally stepped on a cowpie.","zh":"有人不小心踩到牛粪时，孩子们笑了起来。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, joking) Something messy, unpleasant, or poorly made.","zh":"（非正式、玩笑说法）乱糟糟、令人不快或做得很差的东西。"},"examples":[{"en":"He called the first draft a cowpie and started over.","zh":"他把第一稿称作“一坨牛粪”，然后重新开始。"},{"en":"Some critics said the movie was a cowpie, but others enjoyed it.","zh":"有些影评人说这部电影很烂，但也有人看得很开心。"}]}],"synonyms":["cow dung","cow pat","manure (general)","droppings","(slang) crap"],"phonetic":"/ˈkaʊˌpaɪ/","extraExplanation":["“cowpie”是美式英语里比较口语、带点幽默感的说法；字面上是“牛的馅饼”，但实际指牛粪，因为形状常常扁圆像一张“饼”。","在农场、乡村场景的英语叙述里很常见；在比喻义用法中，语气可能偏损人或吐槽，使用时注意场合与关系。"]}
{"word":"cowpies","summary":{"en":"Cowpies are pieces of cow dung, often dried into flat, round patties on the ground.","zh":"Cowpies 指牛粪块，常见为地上干燥后扁圆像饼的一团。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"pieces or lumps of cow dung (cow feces), especially when dropped on the ground and dried into a flat, round “patty.”","zh":"牛粪块；牛屎饼（牛排泄物，常指落在地上后变干、扁圆像“饼”的一块）"},"examples":[{"en":"Watch your step—there are cowpies all over the trail.","zh":"小心脚下——小路上到处都是牛粪块。"},{"en":"The field was dotted with dried cowpies.","zh":"田野里零星散布着干掉的牛屎饼。"}]}],"synonyms":["cow pats","cowpats","cow manure","cow dung"],"phonetic":"/ˈkaʊˌpaɪz/","extraExplanation":["“Cowpie”是美式英语里很常见、带点口语和幽默感的说法，画面感强：像“派/饼（pie）”一样扁圆。正式场合更常用“cow manure / cow dung”。","在一些乡村地区，干牛粪曾被用作燃料（类似“dung cakes”），但“cowpie”本身多用于描述地上的粪块或作为玩笑用语。"]}
{"word":"cowplop","summary":{"en":"A humorous, informal word for a lump of cow dung.","zh":"一个偏幽默、非正式的词，指一坨牛粪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A soft lump or pile of cow dung (cow manure), usually found on the ground in fields; often used humorously or informally.","zh":"（常为幽默/非正式）牛粪、牛屎团（通常在草地或牧场地面上）。"},"examples":[{"en":"Watch your step—there’s a cowplop right in the middle of the path.","zh":"小心脚下——路中间有一坨牛粪。"},{"en":"The kids laughed when the ball landed in a cowplop.","zh":"球掉进牛粪里时，孩子们都笑了。"},{"en":"After the hike, his boots were covered in cowplop.","zh":"徒步后，他的靴子上全是牛粪。"}]}],"synonyms":["cow pat","cowpie","cow dung","manure"],"phonetic":"/ˈkaʊˌplɑp/","extraExplanation":["“cowplop”在英式英语里更常见，语气偏口语、带点搞笑的感觉；更中性的说法是“cow dung / manure”。","相关近义词里，“cowpat”（英式）和“cowpie”（美式）都指牛粪饼/牛粪团，常出现在乡村、牧场语境中。"]}
{"word":"cowplops","summary":{"en":"“Cowplops” is an informal plural word meaning cow droppings (cow dung).","zh":"“cowplops”是非正式的复数说法，意思是牛的粪便（牛粪）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Cow droppings; a pile or lump of cow dung (plural).","zh":"（非正式）牛粪；一坨牛屎（复数）。"},"examples":[{"en":"Watch your step—there are cowplops all over the field.","zh":"小心脚下——这片田里到处都是牛粪。"},{"en":"The kids laughed when they saw fresh cowplops by the barn.","zh":"孩子们看到谷仓旁新鲜的牛粪时笑了起来。"}]}],"synonyms":["cow patties","cow pies","cow dung","manure","droppings"],"phonetic":"ˈkaʊˌplɑps","extraExplanation":["“cowplops”通常被理解为“cowplop”的复数形式，但它不是非常标准的词；更常见的说法是“cow patties / cow pies / cow dung / manure”。在口语里用“cowplop(s)”会带一点幽默、轻松甚至嫌弃的语气。","如果你是在书面写作或正式场合，建议用“manure”（肥料/粪肥）或“cow dung”（牛粪）来表达更中性、准确。"]}
{"word":"cowpock","summary":{"en":"Cowpock means a cowboy, usually in casual Western-style speech; it’s a less common spelling of cowpoke.","zh":"cowpock 指“牛仔/牧牛人”，多用于随意或带西部风格的表达；是 cowpoke 的不常见拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cowboy; a person who herds cattle (often used in a casual or slightly humorous way)","zh":"牛仔；牧牛的人（常为口语，略带幽默或随意语气）"},"examples":[{"en":"A few cowpocks rode into town at dusk.","zh":"黄昏时分，几个牛仔骑马进了镇。"},{"en":"He likes old Western movies where the cowpocks save the day.","zh":"他喜欢老西部片，片里的牛仔总能拯救局面。"}]}],"synonyms":["cowboy","cowpoke","cattleman","ranch hand"],"phonetic":"/ˈkaʊˌpoʊk/","extraExplanation":["“cowpock”更常见的拼写是“cowpoke”。两者意思相同，“cowpoke/cowpock”在美式英语里多用于口语或带一点复古“西部风”的语境。","词源常被认为与“poke”（戳、赶）有关，指赶牛的人；在美国西部文化中，“cowboy/cowpoke”常出现在西部小说、电影与民谣里，形象包含骑马、放牧、套索等。"]}
{"word":"cowpoke","summary":{"en":"Cowpoke means a cowboy, especially in an old-fashioned or playful American-West style.","zh":"Cowpoke 指“牛仔”，带有美国西部风格，常显得复古或略带玩笑语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A cowboy; a person who herds and takes care of cattle, especially in the American West (often used in a slightly old-fashioned or humorous way).","zh":"牛仔；放牧、照料牛群的人，尤指美国西部（常带有旧式或幽默的语气）。"},"examples":[{"en":"The movie follows a young cowpoke learning to ride and rope.","zh":"这部电影讲述了一位年轻牛仔学习骑马和套索的故事。"},{"en":"A couple of cowpokes rode into town at sunset.","zh":"几位牛仔在日落时骑马进了镇子。"},{"en":"Don’t worry—this cowpoke knows these trails like the back of his hand.","zh":"别担心——这位牛仔对这些小道了如指掌。"}]}],"synonyms":["cowboy","ranch hand","cattleman","cowhand"],"phonetic":"/ˈkaʊ.poʊk/","extraExplanation":["“cowpoke”是美式英语里带有西部风格的词，语感比“cowboy”更口语、更带点复古。常见于西部小说、老电影、乡村音乐或调侃式表达。","词源上常被解释为与“poke”（小袋子、包）有关：早期赶牛的人会在身上带一个小袋子装随身物品，因此得名。现代英语里它更多是形象化称呼，而不强调字面含义。"]}
{"word":"cowpokes","summary":{"en":"“Cowpokes” is the plural of “cowpoke,” meaning cowboys—people who work with cattle on horseback, especially in the American West.","zh":"“Cowpokes”是“cowpoke”的复数，意思是“牛仔”，指（尤指美国西部）骑马放牧、管理牛群的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A cowboy; a person (usually in the American West) who rides horses and works with cattle, often on a ranch.","zh":"牛仔；（多指美国西部）骑马放牧、管理牛群的人，常在牧场工作。"},"examples":[{"en":"In old Western movies, cowpokes ride into town on horseback.","zh":"在老西部电影里，牛仔常常骑马进城。"},{"en":"The ranch hired a few cowpokes to help move the cattle.","zh":"牧场雇了几个牛仔来帮忙赶牛。"}]}],"synonyms":["cowboys","ranch hands","cattlemen"],"phonetic":"/ˈkaʊ.poʊk/","extraExplanation":["“Cowpoke”是比较口语、带有“西部牛仔风”的说法，常见于西部片、牛仔小说或带幽默/复古语气的表达。","在当代日常英语里，人们更常说“cowboy”或更具体的“ranch hand”（牧场工人）。"]}
{"word":"cowpony","summary":{"en":"A cowpony is a cowboy’s working horse used to handle cattle.","zh":"cowpony 指牛仔用来放牧、驱赶或套牛的“工作马/牧牛马”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong, agile horse (often smaller than a typical saddle horse) used by cowboys to work cattle, especially for herding and roping","zh":"（牛仔用的）牧牛马；赶牛用的马（通常较结实灵活，个头可能比一般骑乘马略小，用于放牧、驱赶或套牛）"},"examples":[{"en":"The cowboy saddled his cowpony before heading out to check the herd.","zh":"牛仔在出去查看牛群前，先给他的牧牛马上了鞍。"},{"en":"A good cowpony stays calm when a rope snaps tight.","zh":"一匹好的牧牛马在套索猛地绷紧时也能保持镇定。"}]}],"synonyms":["cow horse","ranch horse","working horse"],"phonetic":"/ˈkaʊˌpoʊni/","extraExplanation":["“Cowpony”来自美国西部牧场文化：cow（牛）+ pony（矮种马/小马）。不过它不一定真的是“pony（按身高标准的小马）”，更多强调“用于牧牛工作的骑乘马”，讲究敏捷、耐力和对牛群动作的反应。","在影视或西部小说里，cowpony常用来突出“老派牛仔/牧场工作”的氛围；比起泛泛的“horse”，它更有“干活的马、牧场用马”的味道。"]}
{"word":"cowpox","summary":{"en":"Cowpox is a mild pox disease mainly in cows, and it is historically important because it helped lead to early smallpox vaccination.","zh":"牛痘主要发生在牛身上，通常较轻；它在历史上很重要，因为它促成了早期的天花疫苗接种。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mild infectious disease in cows that causes blister-like sores; it can sometimes infect humans and usually causes only mild illness","zh":"牛痘：一种发生在牛身上的较轻微传染病，会引起水疱样皮疹；有时也会感染人类，通常症状较轻"},"examples":[{"en":"The farmer noticed cowpox lesions on the cows’ udders.","zh":"农民注意到奶牛乳房上出现了牛痘的皮损。"},{"en":"Cowpox can occasionally spread to humans through direct contact with infected animals.","zh":"牛痘有时会通过与感染动物的直接接触传播给人类。"}]},{"partOfSpeech":"n.","definition":{"en":"the virus or infection used historically to help protect people from smallpox (especially in early vaccination efforts)","zh":"（历史用法）用于帮助预防天花的病毒/感染（尤其指早期疫苗接种中使用的牛痘相关感染）"},"examples":[{"en":"Early vaccination work was inspired by the observation that cowpox exposure could protect against smallpox.","zh":"早期的疫苗接种研究受到一个观察的启发：接触牛痘可能对预防天花有保护作用。"},{"en":"In history lessons, cowpox is often mentioned alongside the beginnings of vaccination.","zh":"在历史课中，牛痘常与疫苗接种的起源一起被提及。"}]}],"synonyms":["vaccinia (historical/technical)","pox (general)"],"phonetic":"/ˈkaʊ.pɑks/","extraExplanation":["“cowpox”与疫苗史密切相关：18世纪末，英国医生Edward Jenner注意到挤奶女工感染牛痘后较不容易得天花，从而推动了“vaccination（接种疫苗）”概念的发展。","词源上是“cow（牛）+ pox（痘疮）”。“pox”在旧时英语里常指起疱疹/脓疱的疾病（如smallpox天花、chickenpox水痘）。"]}
{"word":"cowpoxes","summary":{"en":"“Cowpoxes” is the plural of “cowpox,” meaning multiple cowpox infections/cases.","zh":"“cowpoxes”是“cowpox（牛痘）”的复数，表示多起牛痘感染/病例。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Cowpox infections (the disease cowpox), often referring to multiple cases.","zh":"牛痘感染（牛痘这种疾病）；常指多个病例。"},"examples":[{"en":"Before modern vaccines, cowpoxes were discussed in medical reports because they could protect against smallpox.","zh":"在现代疫苗出现之前，医学报告里常会讨论牛痘病例，因为它们可能对天花有保护作用。"},{"en":"The researcher recorded several cowpoxes in the herd after new animals were introduced.","zh":"引入新动物后，研究人员记录到牛群里出现了多起牛痘感染。"}]}],"synonyms":["cases of cowpox","cowpox cases"],"phonetic":"/ˈkaʊ.pɑksɪz/","extraExplanation":["“cowpoxes”是名词“cowpox”的复数形式，表示“多起牛痘感染/多例牛痘”。日常英语里更常见的说法是“cases of cowpox”（牛痘病例）。","牛痘在英语文化中常被提到，是因为爱德华·詹纳（Edward Jenner）观察到感染过牛痘的人往往不易得天花，并据此发展出早期的“vaccination（接种）”。“vaccine”一词与拉丁语“vacca（母牛）”有关。","注意区分：cowpox（牛痘）与 smallpox（天花）不同；如今在人类中较少见，但在讨论历史、防疫或动物传染病时仍会出现。"]}
{"word":"cowpunch","summary":{"en":"Cowpunch means a cowboy (or the work of being one), especially someone who herds and handles cattle in the American West.","zh":"Cowpunch 指（美国西部的）牛仔/牧牛工，也可作动词表示从事放牧、赶牛等牛仔工作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cowboy (especially in the American West), often one who works with cattle on a ranch","zh":"（尤指美国西部的）牛仔；牧牛工（常指在牧场赶牛、照看牛群的人）"},"examples":[{"en":"In old Western stories, a cowpunch rides for days to move a herd to market.","zh":"在老式西部故事里，cowpunch 常常要骑马好几天把牛群赶到集市。"},{"en":"He worked as a cowpunch on a Texas ranch during the summer.","zh":"他夏天在德州牧场当过牧牛工。"}]},{"partOfSpeech":"v.","definition":{"en":"to work as a cowboy, especially to herd and handle cattle","zh":"当牛仔；放牧、赶牛并处理与牛相关的工作"},"examples":[{"en":"He spent a few years cowpunching before moving to the city.","zh":"他在进城前当了几年牛仔。"}]}],"synonyms":["cowboy","ranch hand","cattle herder","cowhand"],"phonetic":"/ˈkaʊˌpʌntʃ/","extraExplanation":["“cowpunch”多见于美国西部题材的小说、电影与历史叙述中，带有一种复古/口语的“西部味道”。现代英语里更常用“cowboy”“ranch hand”“cattle herder”。","词源上，“punch”在这里与“赶、驱使牲畜”的动作有关（而不一定是“用拳打”），体现了早期牧场工作中的行话。"]}
{"word":"cowpuncher","summary":{"en":"A cowpuncher is a cowboy or ranch worker who herds and handles cattle, especially in the American West.","zh":"cowpuncher 指牛仔/牧场工人，主要在美国西部语境中指放牧、赶牛并处理牛群的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cowboy; a person who works on a cattle ranch, especially in the American West (often an old-fashioned or literary word).","zh":"牛仔；在牧场放牧、赶牛的人（尤指美国西部，常带有旧式或文学色彩）。"},"examples":[{"en":"The novel opens with a cowpuncher riding alone across the prairie.","zh":"小说开篇写一名牛仔独自骑马穿越大草原。"},{"en":"He earned money as a cowpuncher during the summer roundups.","zh":"他在夏季赶牛集结时当牛仔赚钱。"}]}],"synonyms":["cowboy","ranch hand","cattleman","cowhand"],"phonetic":"/ˈkaʊˌpʌntʃər/","extraExplanation":["“cowpuncher”常见于美国“Old West（西部拓荒时代）”语境，带点复古味道；现代更常用“cowboy”“ranch hand”。","词面意思是“赶牛/驱牛的人”。其中“punch”在口语里可表示“催赶、驱动”，不一定是“用拳头打”。","在文学或西部片叙述中，用“cowpuncher”能营造粗犷、浪漫化的西部氛围。"]}
{"word":"cowpunchers","summary":{"en":"Cowpunchers = cowboys; people who work with cattle, especially in the American West.","zh":"cowpunchers＝牛仔；指从事放牧、赶牛等牛群工作的牧工（尤指美国西部）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A cowpuncher is a cowboy—someone who herds, drives, and cares for cattle (especially in the American West). “Cowpunchers” is the plural form.","zh":"cowpuncher 指“牛仔”——放牧、赶牛、照料牛群的人（尤指美国西部）。cowpunchers 是其复数形式。"},"examples":[{"en":"In the old days, cowpunchers could spend weeks driving cattle to market.","zh":"过去，牛仔们可能要花好几周把牛群赶到市场。"},{"en":"The movie shows cowpunchers camping on the open range.","zh":"这部电影展示了牛仔们在辽阔的牧场露营。"},{"en":"Modern cowpunchers often use trucks and GPS, not just horses.","zh":"现代牛仔常用卡车和 GPS，不再只靠马匹。"}]}],"synonyms":["cowboys","cattle hands","ranch hands","drovers"],"phonetic":"/ˈkaʊˌpʌntʃərz/","extraExplanation":["“cowpuncher”是比较带“西部风味”的词，常见于小说、电影或历史语境；日常更常用“cowboy”。","词源上，“puncher”在这里不是“打拳的人”，而是旧时口语里指“赶牲畜的人/牧工”的用法。"]}
{"word":"cowquake","summary":{"en":"A playful word meaning an earthquake-like shake caused by cows (especially a herd moving or stampeding).","zh":"一个俏皮的自造词，指由牛（尤其牛群移动或奔跑）造成的“像地震一样的震动”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(humorous, informal) A small earthquake-like shake or vibration imagined as being caused by cows—especially a herd moving, jumping, or stampeding.","zh":"（幽默／非正式）像地震一样的轻微震动，被想象成由牛造成的——尤其指一群牛移动、跳动或奔跑引起的震动。"},"examples":[{"en":"When the herd ran toward the gate, the ground felt like a cowquake.","zh":"牛群朝大门跑去时，地面感觉像发生了“牛震”。"},{"en":"I woke up to a cowquake—our neighbor’s cows were stamping around in the barn.","zh":"我被一阵“牛震”吵醒了——邻居家的牛在牛棚里跺来跺去。"}]}],"synonyms":["stampede shake","tremor","rumble"],"phonetic":"/ˈkaʊˌkweɪk/","extraExplanation":["这是一个自造词（portmanteau/混成词）：cow（牛）+ quake（地震/震动）。在新闻或学术语境中不常见，多用于玩笑、夸张描述或网络表达。","如果想更自然一些，也可以直接说：The ground shook because the cows were running.（地面因牛在奔跑而震动。）"]}
{"word":"cowrie","summary":{"en":"A cowrie is a small shiny sea shell, often used for decoration, and historically it was also used as money in some regions.","zh":"cowrie 指一种小而光亮的海螺壳，常用于装饰；在一些地区的历史上也曾被当作货币使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, shiny sea snail shell (often from the tropics), sometimes used as decoration or jewelry","zh":"宝贝壳；一种小而光亮的海螺壳（多见于热带），常用于装饰或首饰"},"examples":[{"en":"She made a bracelet with cowrie shells.","zh":"她用宝贝壳做了一条手链。"},{"en":"Cowries are often sold in beach markets as souvenirs.","zh":"宝贝壳常在海边市场作为纪念品出售。"}]},{"partOfSpeech":"n.","definition":{"en":"a cowrie shell used as money in some places in the past","zh":"（旧时）用作货币的宝贝壳"},"examples":[{"en":"In parts of Africa and Asia, cowries were once used as currency.","zh":"在非洲和亚洲的一些地区，宝贝壳曾经被用作货币。"},{"en":"The museum displayed strings of cowries that served as payment.","zh":"博物馆展出了成串的宝贝壳，它们曾用来支付。"}]}],"synonyms":["cowry shell","shell"],"phonetic":"/ˈkaʊri/","extraExplanation":["“cowrie”常见于历史与人类学语境：宝贝壳因外形耐用、便于携带与计数，在部分地区长期充当交换媒介。","在英语里也常写作“cowry”（较常见拼写）；复数可写“cowries”。"]}
{"word":"cowrie-like","summary":{"en":"“Cowrie-like” means resembling a cowrie shell—smooth, shiny, and often oval with a slit-like groove.","zh":"“cowrie-like”意为“像宝贝壳的”——常见特点是光滑、有光泽、椭圆，并带有裂缝/沟槽状的线条。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a cowrie shell (a small, glossy sea shell), often in shape (oval/rounded with a slit-like opening) or smooth, shiny appearance.","zh":"像宝贝壳（cowrie，一种小而光亮的海贝）的；常指外形（椭圆、圆润、带裂缝状开口）或表面光滑、有光泽。"},"examples":[{"en":"The pendant was cowrie-like, smooth and oval with a narrow groove down the center.","zh":"这枚吊坠像宝贝壳一样，光滑椭圆，中间有一道狭长的沟槽。"},{"en":"She described the seed as cowrie-like—small, pale, and polished-looking.","zh":"她形容那颗种子像宝贝壳：小小的、颜色浅，看起来像被打磨过一样发亮。"}]}],"synonyms":["cowrie-shaped","shell-like","oval","smooth","glossy"],"phonetic":"/ˈkaʊriˌlaɪk/","extraExplanation":["“cowrie”指宝贝壳（宝贝），历史上在非洲、南亚等地曾被广泛用作货币或装饰品。因此在写作或艺术评论里，“cowrie-like”有时不仅描述形状，也会带出“海洋/饰物/古老贸易与财富象征”的联想。"]}
{"word":"cowrie-shaped","summary":{"en":"Cowrie-shaped means shaped like a cowrie shell—smooth, oval, and often with a slit-like opening.","zh":"cowrie-shaped 指“宝贝螺形状的”，外观多为光滑椭圆，并常带有狭长裂缝状开口。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape or appearance of a cowrie (a small, smooth, glossy sea shell), often oval and slightly domed with a narrow slit-like opening.","zh":"呈宝贝螺（光滑有光泽的小海螺壳）形状的；通常为椭圆、略拱起，底部有狭长裂缝状开口。"},"examples":[{"en":"She wore a cowrie-shaped pendant on a simple chain.","zh":"她戴着一条简约项链，上面坠着一个宝贝螺形状的吊坠。"},{"en":"The artist carved a cowrie-shaped motif into the wooden panel.","zh":"艺术家在木板上雕刻了一个宝贝螺形图案。"},{"en":"In the museum display, the cowrie-shaped beads were placed beside real shells for comparison.","zh":"在博物馆展柜里，宝贝螺形珠子与真实贝壳并排摆放以便对比。"}]}],"synonyms":["cowrie-like","shell-shaped","oval","ovoid"],"phonetic":"/ˈkaʊri ʃeɪpt/","extraExplanation":["“cowrie”指宝贝螺（宝贝），这种贝壳在非洲、亚洲与印度洋地区常被用作装饰，也曾在一些社会中充当货币或象征财富与护身之物。因此在艺术、珠宝或考古语境里，“cowrie-shaped”常暗示一种具有传统或历史意味的外形设计。"]}
{"word":"cowries","summary":{"en":"Cowries are small sea shells, often used for decoration, and historically they were also used as money in some cultures.","zh":"Cowries 指宝贝壳：常用于装饰；在一些文化中历史上也曾作为货币使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small, shiny sea snails (or their shells), often used as decoration or jewelry.","zh":"宝贝（贝）：一种小而有光泽的海螺（或其贝壳），常用作装饰品或首饰。"},"examples":[{"en":"She wore a necklace made of cowries.","zh":"她戴着一条用宝贝壳串成的项链。"},{"en":"The museum displayed cowries collected from the Indian Ocean.","zh":"博物馆展出了从印度洋采集来的宝贝壳。"}]},{"partOfSpeech":"n.","definition":{"en":"Cowry shells used as money in some places in the past (a form of “shell currency”).","zh":"（历史上）用作货币的宝贝壳（贝币；一种“贝壳货币”）。"},"examples":[{"en":"In some regions, cowries were traded like coins.","zh":"在一些地区，宝贝壳曾像硬币一样用于交易。"},{"en":"The story mentions paying with cowries instead of cash.","zh":"故事里提到用宝贝壳而不是现金来付款。"}]}],"synonyms":["cowry shells","shells","shell currency"],"phonetic":"/ˈkaʊriz/","extraExplanation":["“cowry”的复数常见有两种：cowries（更常用）和 cowry shells（更直观）。","宝贝壳在非洲、西印度群岛、南亚与东南亚等地区曾广泛流通，因耐用、易携带、外形统一而适合作为交换媒介；在一些文化中也与财富、护身符或仪式有关。","词源来自印地语/乌尔都语等南亚语言（如 कौड़ी/kaurī），后来进入英语。"]}
{"word":"cowrite","summary":{"en":"Cowrite (more commonly written “co-write”) means to write something together with another person or group.","zh":"cowrite（更常写作 co-write）指与他人一起写作、合著。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to write something together with one or more other people; to be a joint author","zh":"与他人共同写作；合著"},"examples":[{"en":"She co-wrote the song with her brother.","zh":"她和哥哥一起合写了这首歌。"},{"en":"The two researchers co-wrote a paper on climate change.","zh":"两位研究人员合著了一篇关于气候变化的论文。"},{"en":"I’m co-writing a short story with a friend online.","zh":"我正在和朋友在网上共同写一篇短篇小说。"}]}],"synonyms":["co-write","coauthor","collaborate (on writing)","write together"],"phonetic":"/ˌkoʊˈraɪt/","extraExplanation":["“cowrite”更常见的标准写法是“co-write”（带连字符）或“coauthor”（多用于学术语境）。在正式写作中，建议使用“co-write”。","“co-”表示“共同、一起”，因此“co-write”强调多位作者合作完成同一作品。"]}
{"word":"cowrites","summary":{"en":"“cowrites” means “writes together with someone else” (he/she/it form of co-write).","zh":"“cowrites”表示“与他人共同写作”，是 co-write 的第三人称单数形式（he/she/it）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Third-person singular present) to write something together with another person; to collaborate as a writer.","zh":"（动词第三人称单数现在时）与他人共同写作；合作撰写。"},"examples":[{"en":"She cowrites a weekly newsletter with her colleague.","zh":"她和同事共同撰写每周一期的简报。"},{"en":"He cowrites the screenplay, but the director makes final changes.","zh":"他与人合写剧本，但导演会做最终修改。"}]}],"synonyms":["collaborates (on)","co-authors","writes jointly","teams up to write"],"phonetic":"/ˌkoʊˈraɪts/","extraExplanation":["“cowrites”来自动词“co-write”（常写作 co-write 或 cowrite），意思是“与他人合写”。在正式出版或影视署名中，常见写法是带连字符的“co-write”。","注意时态：I/you/we/they co-write（合写），he/she/it cowrites（他/她/它合写），过去式/过去分词 co-wrote 或 co-written（部分用法中也可见 co-writed，但较不常见）。"]}
{"word":"cowroid","summary":{"en":"“Cowroid” is not standard English; it’s usually a misspelling/teasing form of “coward,” meaning a person who is not brave.","zh":"“cowroid”不是标准英文，多为“coward（懦夫/胆小鬼）”的拼写错误或戏谑写法，指不勇敢的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(nonstandard, informal) A misspelling or playful variant of “coward,” used as an insult for someone who is not brave or avoids danger or responsibility.","zh":"（非标准、非正式）“coward（懦夫）”的拼写错误或戏谑变体，常用作骂人，指不勇敢、逃避危险或责任的人。"},"examples":[{"en":"Stop being a cowroid and tell the truth.","zh":"别当个“cowroid”（懦夫）了，说实话。"},{"en":"People online sometimes write “cowroid” to mock someone they think is scared.","zh":"在网上，人们有时会用“cowroid”来嘲讽他们觉得胆小的人。"}]}],"synonyms":["coward","chicken (informal)","wimp (informal)","timid person"],"phonetic":"/ˈkaʊərd/","extraExplanation":["“cowroid”不是标准英文词汇，最常见的情况是把“coward”拼错（或故意拼成怪样子来嘲讽）。正式写作或考试中不要用它，建议用“coward”。","如果你想表达“胆小/懦弱”，也可以根据语气改用：scared（害怕的）、timid（胆怯的）、not brave（不勇敢）、chicken（口语：胆小鬼，略贬）。"]}
{"word":"cowrote","summary":{"en":"“cowrote” means “wrote together with someone else.”","zh":"“cowrote”表示“与他人共同写作/合写”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense of co-write: wrote something together with one or more other people.","zh":"co-write 的过去式：与他人一起合写、共同创作某个作品。"},"examples":[{"en":"She cowrote the song with her brother.","zh":"她和哥哥一起合写了这首歌。"},{"en":"The two researchers cowrote a paper on climate change.","zh":"两位研究人员合写了一篇关于气候变化的论文。"},{"en":"He cowrote the screenplay, but he didn’t direct the film.","zh":"他共同编写了剧本，但没有执导这部电影。"}]}],"synonyms":["co-wrote","coauthored","wrote together","collaborated on writing"],"phonetic":"/ˌkoʊˈroʊt/","extraExplanation":["“cowrote”来自动词“co-write”（也常写作“co-write / coauthor”）。写作中更正式、常见的说法是“co-wrote”（带连字符）或“coauthored”。","“cowrote”容易被误读为“cow + wrote”，所以在正式文本里通常用“co-wrote”来更清晰。"]}
{"word":"cowry","summary":{"en":"A cowry is a small shiny shell, famous for being used as money in some cultures and for decoration.","zh":"cowry 指小而光亮的宝贝壳，以曾作贝币以及用于装饰而著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, shiny sea snail shell that was traditionally used as money in parts of Africa and Asia, and is also used for decoration or jewelry","zh":"宝贝（壳）；一种小而光亮的海螺壳，传统上在非洲和亚洲部分地区曾用作货币，也常用于装饰或首饰"},"examples":[{"en":"Cowry shells were once used as currency in several regions of West Africa.","zh":"在西非一些地区，宝贝壳曾经被用作货币。"},{"en":"She wore a necklace made of cowries.","zh":"她戴着一串用宝贝壳做的项链。"},{"en":"The museum displayed cowries alongside other trade goods.","zh":"博物馆把宝贝壳与其他贸易品一起展出。"}]}],"synonyms":["cowrie","cowry shell","shell (general)"],"phonetic":"/ˈkaʊri/","extraExplanation":["“cowry”常指“宝贝（壳）”，在历史与人类学语境中很常见：它们因外形耐用、大小相近、便于携带与计数，在一些社会中成为“贝币”。","拼写上也常见复数形式“cowries”。","文化语境提示：在不同地区，宝贝壳不仅与“钱”有关，也可能与身份、仪式、装饰传统相关；在阅读相关文本时可以根据语境判断侧重点是“货币”还是“装饰/文化象征”。"]}
{"word":"cows","summary":{"en":"“Cows” usually means adult female cattle (plural), and informally can refer to cattle in general; as a verb, it means to intimidate someone.","zh":"“cows”通常指“母牛”的复数，口语中也可泛指牛群；作动词时意为“威吓、恐吓”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “cow”: an adult female bovine animal, especially kept for milk or for breeding.","zh":"“cow”的复数：母牛（成年雌性牛），常用于产奶或繁殖。"},"examples":[{"en":"The cows are grazing in the field.","zh":"母牛们正在田里吃草。"},{"en":"Dairy farms keep cows for milk.","zh":"奶牛场养母牛来产奶。"}]},{"partOfSpeech":"n.","definition":{"en":"In casual use, “cows” can also mean cattle in general (though “cattle” is the more accurate word).","zh":"在口语中，“cows”有时也泛指牛群/牛（尽管更准确的说法通常是“cattle”）。"},"examples":[{"en":"There are cows on that ranch, including bulls and calves.","zh":"那个牧场有一群牛，包括公牛和小牛。"}]},{"partOfSpeech":"vt.","definition":{"en":"To intimidate or frighten someone into doing what you want (usually used with “into”).","zh":"威吓、恐吓某人使其就范（常与“into”连用）。"},"examples":[{"en":"They tried to cow him into silence.","zh":"他们试图恐吓他保持沉默。"}]}],"synonyms":["cattle (general term)","bovines (more formal)","intimidate (verb sense)","frighten (verb sense)"],"phonetic":"/kaʊz/","extraExplanation":["日常英语里，如果你想表达“牛（这个物种/牛群）”，常用不可数名词 cattle，而不是 cows。cows 更准确地指“母牛”。","常见搭配：dairy cows（奶牛/乳用母牛）、beef cattle（肉牛）、a herd of cattle（牛群）、to graze（吃草）。"]}
{"word":"cowshard","summary":{"en":"A dialect word meaning a piece of cow dung (cow droppings).","zh":"一个方言词，指牛粪块/牛的粪便。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a piece of dried cow dung; a cow dropping (dialectal).","zh":"（方言）牛粪块；牛的粪便（常指干了的一块）。"},"examples":[{"en":"Watch your step—there are cowshards all over the trail.","zh":"小心脚下——小路上到处都是牛粪块。"},{"en":"In the old story, the children used dried cowshards as fuel for the fire.","zh":"在那个老故事里，孩子们用晒干的牛粪块当柴火。"}]}],"synonyms":["cow pat","cow dung","manure","droppings"],"phonetic":"/ˈkaʊˌʃɑrd/","extraExplanation":["“cowshard”属于较少见的方言/乡村用词，在现代日常英语里更常说“cow pat”（英式）或“cow dung / manure”（较通用、偏正式）。","这个词由“cow（牛）+ shard（碎片、碎块）”构成，所以字面意思就是“牛粪的碎块/一块”。在农牧区语境（牧场、乡村小路、田野）更容易遇到。"]}
{"word":"cowsharn","summary":{"en":"“Cowsharn” is not a recognized standard English word; it’s likely a misspelling of another word.","zh":"“cowsharn”不是标准英语词，可能是把别的单词拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It appears to be a misspelling or a nonstandard spelling; you may have meant a different word (see notes below).","zh":"这不是标准英语单词。它看起来像拼写错误或非标准拼写；你可能想输入另一个词（见下方提示）。"},"examples":[{"en":"I can’t find “cowsharn” in an English dictionary—did you mean “cowhorn” or “cowshed”?","zh":"我在英语词典里找不到“cowsharn”——你是想写“cowhorn（牛角）”还是“cowshed（牛棚）”吗？"},{"en":"If you tell me the sentence where you saw “cowsharn,” I can help identify the intended word.","zh":"如果你把看到“cowsharn”的原句发给我，我可以帮你判断原本想表达的词。"}]}],"phonetic":"/ˈkaʊʃɑrn/","extraExplanation":["“cowsharn”很可能是以下词的误拼之一：\n1) cowhorn（牛角；也可作形容词/名词修饰，如 cowhorn handle 牛角柄）\n2) cowshed（牛棚）\n3) cowherd（放牛人；与“coward 懦夫”易混）\n\n如果你能提供：①你想表达的中文意思，或②出现它的上下文句子/截图，我可以给出最准确的词条与用法。"]}
{"word":"cowshed","summary":{"en":"A cowshed is a farm building where cows are kept.","zh":"cowshed 指“牛棚/牛舍”，是用来饲养或安置奶牛的农场建筑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a simple farm building where cows are kept (for shelter, feeding, or milking)","zh":"牛棚；牛舍（用来圈养、遮风避雨、喂养或挤奶的简易农场建筑）"},"examples":[{"en":"The farmer led the cows into the cowshed before the storm.","zh":"暴风雨来临前，农夫把奶牛赶进牛棚。"},{"en":"It smells like hay in the cowshed.","zh":"牛棚里有股干草的味道。"}]}],"synonyms":["cow barn","dairy barn","barn"],"phonetic":"/ˈkaʊˌʃɛd/","extraExplanation":["“cowshed”在英式英语中更常见；美式英语里常用“barn”（谷仓/畜棚）或更具体的“cow barn / dairy barn”（奶牛棚）。"]}
{"word":"cowsheds","summary":{"en":"“Cowsheds” means farm sheds/buildings where cows are kept (plural of “cowshed”).","zh":"“cowsheds”指养牛的棚屋/牛棚，是“cowshed”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a simple building (shed) on a farm used for keeping cows, often for shelter, feeding, or milking","zh":"牛棚；养牛用的简易棚屋（常用于遮蔽、喂养或挤奶）"},"examples":[{"en":"The cows were moved into the cowshed when it started raining.","zh":"开始下雨时，牛被赶进了牛棚。"},{"en":"He cleaned the cowshed every morning before feeding the animals.","zh":"他每天早上喂动物前都会清理牛棚。"}]}],"synonyms":["cow barns","dairy barns","byres (BrE)","barns (general)"],"phonetic":"/ˈkaʊˌʃɛdz/","extraExplanation":["“cowsheds”是“cowshed”的复数形式。英式英语中更常见“cowshed”，而美式英语里也常用“barn（谷仓/畜棚）”或更具体的“cow barn / dairy barn（奶牛棚）”。","词源上，cow（牛）+ shed（棚屋/简易房）。shed通常指结构简单、用于存放或遮蔽的建筑。"]}
{"word":"cowshot","summary":{"en":"“Cowshot” (more commonly “cow shot”) is an informal cricket term for a big, not-very-technical slog, often toward midwicket; it can also mean any wild but forceful hit.","zh":"“cowshot”（更常写作“cow shot”）是板球里的非正式说法，指靠蛮力、技术不够规范的大力击球（常打向中门一带）；也可泛指任何乱但很用力的击打。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Cricket, informal) A powerful but unskilled-looking hit—usually a slog across the line—often played to a full ball and sent toward the leg side (around midwicket).","zh":"（板球，非正式）“牛打”（cow shot）：一种力量很大但看起来不太正规、技术含量不高的击球，通常横着球路猛抡，把球打向腿侧（多在中门附近）。"},"examples":[{"en":"He missed the proper drive and went for a cowshot over midwicket.","zh":"他没打出标准的正面击球，改用“牛打”把球抡过了中门。"},{"en":"The crowd cheered, but the coach didn’t like that cowshot.","zh":"观众在欢呼，但教练不喜欢他那一下“牛打”。"}]},{"partOfSpeech":"n.","definition":{"en":"(By extension) Any wild, improvised, very forceful shot or hit.","zh":"（引申）任何随性、动作不规范但很用力的击打/一击。"},"examples":[{"en":"That was a total cowshot—somehow it still went in.","zh":"那一下完全是乱抡的“牛打”，居然还是进了。"},{"en":"He played a cowshot of a swing and nearly lost his balance.","zh":"他挥出一记乱抡式的大力一击，差点失去平衡。"}]}],"synonyms":["slog","heave","wild swing"],"phonetic":"/ˈkaʊˌʃɑt/","extraExplanation":["“cow shot”是英联邦板球语境里很常见的说法，带一点调侃意味：强调“靠蛮力”“不够优雅/不够标准”的击球，而不一定代表完全犯规。","更常见的写法是分开写作 cow shot；连写 cowshot 也能见到，但相对少。"]}
{"word":"cowshut","summary":{"en":"Cowshut means an enclosed place (field or pen) for keeping cows, mainly in older or regional English.","zh":"cowshut 指关牛的围场/圈地（多见于古语或方言）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an enclosed field, pasture, or pen where cows are kept (old-fashioned or regional English).","zh":"（古语或方言）关牛的围场、牧场或牛栏。"},"examples":[{"en":"The cows were brought back to the cowshut at dusk.","zh":"黄昏时，牛被赶回了牛围场。"},{"en":"In older records, the farm is described as having a small cowshut behind the barn.","zh":"在较早的记录里，这个农场被描述为谷仓后面有一小块牛的围栏/圈地。"}]}],"synonyms":["cow pen","cattle pen","cow yard","paddock"],"phonetic":"/ˈkaʊˌʃʌt/","extraExplanation":["“cowshut”在现代英语里很少使用，常见于英国某些地区的旧用法或历史文本。这里的“shut”不是“关闭”的动词，而是较古老的名词/词素，用来表示“围起来的地方、圈地”。","别和“cowshed”（牛棚、牛舍）混淆：cowshut 更强调“围场/圈地”，而 cowshed 指“有屋顶的棚舍”。"]}
{"word":"cowskin","summary":{"en":"Cowskin means a cow’s skin/hide, especially used as leather, and it can also describe items made from it.","zh":"cowskin 指牛的皮（兽皮），尤指用于皮革；也可作形容词表示“牛皮制的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The skin or hide of a cow, especially when prepared as leather.","zh":"牛皮；（尤指）加工成皮革后的牛皮。"},"examples":[{"en":"These boots are made of cowskin leather.","zh":"这双靴子是用牛皮革做的。"},{"en":"The bag has a tough cowskin surface that resists scratches.","zh":"这个包的牛皮表面很结实，不容易刮花。"}]},{"partOfSpeech":"adj.","definition":{"en":"Made from cowskin (used before a noun).","zh":"牛皮的；由牛皮制成的（用于名词前）。"},"examples":[{"en":"She bought a cowskin jacket for winter.","zh":"她买了一件牛皮夹克过冬。"}]}],"synonyms":["cowhide","leather (general)","hide"],"phonetic":"/ˈkaʊˌskɪn/","extraExplanation":["“cowskin”在日常英语里不如“cowhide”常见；在商品描述中更常看到“cowhide leather / genuine cowhide”。","注意区分：skin（皮）常指较薄、常用于小动物皮革；hide（兽皮）更常用于牛、马等较厚的皮。说牛皮时“cowhide”更地道。"]}
{"word":"cowskins","summary":{"en":"Cowskins are the hides of cows, often used as material for leather products.","zh":"Cowskins 指牛的皮（牛皮），常用于制作皮革制品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the skins (hides) of cows, especially when prepared or used to make leather goods","zh":"牛皮；牛的皮（尤指处理后用来制作皮革制品的牛皮）"},"examples":[{"en":"The artisan bought cowskins to make belts and bags.","zh":"这位工匠买了牛皮来做皮带和包。"},{"en":"In the market, cowskins were piled next to wool and other animal products.","zh":"在集市上，牛皮堆放在羊毛和其他动物产品旁边。"}]}],"synonyms":["cowhides","cowhide","hides","leather (when processed)"],"phonetic":"/ˈkaʊˌskɪnz/","extraExplanation":["“cowskin(s)”在日常英语里不如“cowhide”常见；在谈皮革材料时，更常说cowhide leather（牛皮革）。","在一些历史或民俗语境中，cowskins也可能指用牛皮制作的物品（如鼓面、皮袋），但现代购物/材料说明通常用cowhide来表达更自然。"]}
{"word":"cowslip","summary":{"en":"Cowslip is a spring-blooming yellow wildflower; it can also mean a pale yellow color.","zh":"cowslip 指春季开花的黄色野花（黄花九轮草）；也可指淡黄色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small yellow wildflower (Primula veris) that blooms in spring; often found in meadows and fields.","zh":"黄花九轮草（报春花的一种，Primula veris）；春季开花，常见于草地和田野。"},"examples":[{"en":"Cowslips cover the meadow in early spring.","zh":"早春时，草地上开满了黄花九轮草。"},{"en":"We picked a few cowslips and put them in a small vase.","zh":"我们摘了几朵黄花九轮草，插在一个小花瓶里。"}]},{"partOfSpeech":"adj.","definition":{"en":"A pale yellow color, like the flower.","zh":"淡黄色（像黄花九轮草花朵的颜色）。"},"examples":[{"en":"She wore a cowslip dress with a light, sunny tone.","zh":"她穿了一件淡黄色的连衣裙，色调轻盈明亮。"}]}],"synonyms":["primrose","wildflower","pale yellow"],"phonetic":"/ˈkaʊˌslɪp/","extraExplanation":["“cowslip”在英国英语里更常见，常让人联想到春天、乡野与田园风景。在文学中，它经常作为“春天来临”的意象出现。","词源上常被解释为来自“cow slop”（牛的粪便/泥泞处），因为这种花常见于放牧草地；这带有朴素的乡村色彩，并非贬义。"]}
{"word":"cowslip-covered","summary":{"en":"Describes land or a surface filled or covered with cowslip flowers.","zh":"形容地面或草地被黄花九轮草（cowslip）覆盖、遍布其花。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with cowslips (a small yellow wildflower), suggesting a meadow or ground filled with these flowers.","zh":"长满（或覆盖着）黄花九轮草/黄花报春花（cowslip，一种黄色野花）的；形容地面或草地遍布这种花。"},"examples":[{"en":"We walked across a cowslip-covered meadow in late spring.","zh":"我们在晚春穿过一片开满黄花九轮草的草地。"},{"en":"The hillside was cowslip-covered, bright with small yellow blooms.","zh":"山坡上长满了黄花九轮草，小小的黄花让整片山坡都亮了起来。"}]}],"synonyms":["flower-covered","wildflower-covered","bloom-covered","blossom-covered"],"phonetic":"/ˈkaʊˌslɪp ˌkʌvɚd/","extraExplanation":["“Cowslip”指一种春季常见的黄色野花（常见于欧洲草地与林缘），英语文学里常用来营造“春天、乡野、柔和明亮”的画面。复合形容词“cowslip-covered”多见于描写自然景色的写作中。","文学提示：cowslip 在莎士比亚作品中出现过（常用于精灵、花草与春景的意象），所以带有一点古典、诗意的色彩。"]}
{"word":"cowslip-filled","summary":{"en":"Covered or packed with cowslip flowers, often in poetic nature descriptions.","zh":"遍布黄花九轮草花的；常用于带有田园诗意的自然描写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"filled with cowslips (pale yellow primrose flowers), often used to describe fields, meadows, or places richly covered with them.","zh":"长满黄花九轮草（cowslip，一种淡黄色报春花）的；遍布黄花九轮草的（常用于描写田野、草地等）。"},"examples":[{"en":"They walked through a cowslip-filled meadow in late spring.","zh":"他们在晚春穿过一片开满黄花九轮草的草地。"},{"en":"A cowslip-filled bank lined the path beside the stream.","zh":"小溪旁的小路边是一道开满黄花九轮草的河岸。"},{"en":"The poem opens with a quiet, cowslip-filled landscape.","zh":"这首诗以一幅宁静、遍布黄花九轮草的景致开篇。"}]}],"synonyms":["cowslip-covered","cowslip-strewn","full of cowslips","primrose-filled"],"phonetic":"/ˈkaʊˌslɪp fɪld/","extraExplanation":["“cowslip”指一种报春花属植物（常见为Primula veris），花色多为柔和的黄色，在英国文学与田园描写中很常见，带有“春天、乡野、清新”的意象。","“cowslip-filled”是由名词+cowslip与形容词化的“-filled”构成的复合形容词，常用于较文学、抒情的描写；日常口语里也可用“full of cowslips / covered in cowslips”。"]}
{"word":"cowslip-yellow","summary":{"en":"Cowslip-yellow means a soft, pale yellow like the cowslip flower.","zh":"cowslip-yellow 指像九轮草花那样柔和的浅黄色。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"A pale yellow color like the flowers of the cowslip (a type of primrose).","zh":"像黄花九轮草（cowslip，一种报春花）花朵那样的浅黄色、柔黄。"},"examples":[{"en":"She wore a cowslip-yellow dress that looked soft in the afternoon light.","zh":"她穿着一件九轮草黄的裙子，在午后光线下显得很柔和。"},{"en":"The old cottage had cowslip-yellow curtains in the kitchen.","zh":"那间老小屋的厨房挂着九轮草黄的窗帘。"}]}],"synonyms":["pale yellow","primrose-yellow","butter-yellow","soft yellow"],"phonetic":"/ˈkaʊˌslɪp ˌjɛloʊ/","extraExplanation":["“cowslip-yellow”常见于文学或较描写性的英语中，用来表达一种“柔和、带点春天感”的淡黄色，比“bright yellow（亮黄）”更温柔。","cowslip（九轮草）在英国文化里常与春天、田野花朵联系在一起，所以这个颜色词也常带有自然、乡村、复古的气质。"]}
{"word":"cowslipped","summary":{"en":"Cowslipped is a literary adjective meaning ‘covered with cowslips’ or ‘pale yellow like cowslip flowers.’","zh":"cowslipped 是偏文学的形容词，表示“长满黄花九轮草（cowslip）的”或“像黄花九轮草那样淡黄色的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Literary) Covered with or full of cowslips (a small pale-yellow wildflower); growing where cowslips grow.","zh":"（文学用语）长满黄花九轮草（报春花的一种，cowslip） 的；遍布黄花九轮草的。"},"examples":[{"en":"In early spring, the meadow looked cowslipped and bright after the rain.","zh":"初春雨后，草地上开满黄花九轮草，显得明亮动人。"},{"en":"They walked along a cowslipped bank beside the river.","zh":"他们沿着河边长满黄花九轮草的岸坡散步。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Literary) Having the pale yellow color associated with cowslip flowers.","zh":"（文学用语）呈黄花九轮草那种淡黄色的。"},"examples":[{"en":"A cowslipped light fell across the fields at dusk.","zh":"黄昏时分，一抹淡黄的光洒在田野上。"},{"en":"She wore a cowslipped ribbon in her hair.","zh":"她在头发上系了一条淡黄色的丝带。"}]}],"synonyms":["cowslip-covered","cowslip-filled","cowslip-yellow (for color)","pale yellow"],"phonetic":"/ˈkaʊˌslɪpt/","extraExplanation":["“cowslipped”是由花名“cowslip”（黄花九轮草/报春花的一种）加上后缀“-ed”构成的形容词，常见于诗歌或描写自然景色的文字中，用来营造春天、田野、柔和色调的意象。","在现代日常英语中更常说“full of cowslips / covered with cowslips”或直接用“cowslip-yellow”来表达颜色；“cowslipped”更偏文学、复古风格。"]}
{"word":"cowslips","summary":{"en":"Cowslips are yellow wild primrose flowers, often seen in European spring meadows.","zh":"cowslips 指黄色的野生报春花（黄花九轮草），常见于欧洲春季草地。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A cowslip: a small wild primrose plant with drooping yellow flowers, common in European meadows (often called “cowslip primrose”).","zh":"黄花九轮草；一种野生报春花（花朵下垂的黄色小花），常见于欧洲草地。"},"examples":[{"en":"In spring, cowslips bloom across the meadow.","zh":"春天里，草地上开满了黄花九轮草。"},{"en":"She picked a small bunch of cowslips for the table.","zh":"她采了一小束黄花九轮草放在桌上。"}]}],"synonyms":["primroses","wild primroses"],"phonetic":"/ˈkaʊˌslɪps/","extraExplanation":["“cowslips”是“cowslip”的复数。词源里有“cow（牛）+ slip（滑/落）”的民间解释，常被理解为“牛踩过的湿草地/牛粪附近长的花”，因此它带有一种英国乡野、田园春天的联想。","在英国文化与文学中，cowslip常出现在描写春天与乡村景色的作品里；例如莎士比亚《仲夏夜之梦》中提到“cowslips tall”，用来营造梦幻的自然意象。","注意不要和“buttercup（金凤花/毛茛）”混淆：两者都黄，但cowslip通常是一簇下垂的小钟形花。"]}
{"word":"cowson","summary":{"en":"“Cowson” is a rare, old-fashioned insult meaning a cowardly or contemptible person; it can also be a surname.","zh":"“Cowson”是罕见的古语辱骂词，指懦弱或令人鄙视的人；也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic, insulting) A contemptuous term for a cowardly or despicable person; literally “cow’s son.”","zh":"（古语，侮辱性）对懦弱或卑劣之人的蔑称；字面义为“母牛的儿子”。"},"examples":[{"en":"He called the guard a cowson for refusing to fight.","zh":"他骂那个守卫是个 cowson，因为他拒绝战斗。"},{"en":"In some old texts, “cowson” appears as a harsh insult during quarrels.","zh":"在一些旧文本里，“cowson”常在争吵中作为很难听的辱骂词出现。"}]},{"partOfSpeech":"n.","definition":{"en":"A rare surname (family name).","zh":"（罕见）姓氏。"},"examples":[{"en":"Ms. Cowson signed the letter at the bottom.","zh":"Cowson 女士在信末签了名。"}]}],"synonyms":["coward","wretch","scoundrel","rascal","milksop"],"phonetic":"/ˈkaʊsən/","extraExplanation":["“cowson”在现代英语里几乎不用作普通词汇；作为辱骂词属于古语/文学性用法，实际交流中很少见，也容易显得粗鲁或不合时宜。","如果你在古书或戏剧里看到它，它通常用来表达轻蔑、挑衅或激怒对方的语气。现代更常见的对应表达会是“coward”等。"]}
{"word":"cowsucker","summary":{"en":"A vulgar slang insult for a person, used to show strong contempt.","zh":"一个粗俗的俚语侮辱词，用来强烈表达对某人的鄙视。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, vulgar) A very rude insult for a person; someone seen as contemptible or worthless.","zh":"（俚语，粗俗）对人的极其侮辱性称呼；指被认为卑鄙、无用或令人鄙视的人。"},"examples":[{"en":"He got angry and called the referee a cowsucker.","zh":"他很生气，骂裁判是“cowsucker”。"},{"en":"That word is offensive—don’t use it at school or at work.","zh":"那个词很冒犯——别在学校或工作场合用。"}]}],"synonyms":["jerk","asshole","bastard","loser","creep"],"phonetic":"/ˈkaʊˌsʌkɚ/","extraExplanation":["这个词属于强烈粗俗的侮辱语，带有明显的人身攻击意味；在正式场合或公共交流中使用容易引发冲突、被视为骚扰或歧视性语言。","它的字面结构是“cow + sucker（吮吸者）”，通过把人描述成做出令人反感的行为来达到羞辱效果；英语中有不少类似构词的脏话（如“X-sucker”），语气通常都很重。","更安全的替代说法可以用：jerk（讨厌的人）、idiot（笨蛋，较冒犯）、creep（怪人）、rude person（没礼貌的人）等，视语境选择更合适的强度。"]}
{"word":"cowtail","summary":{"en":"Cowtail can mean a cow’s tail, or (in the U.S.) a chewy caramel candy with a cream center.","zh":"cowtail 可以指“牛的尾巴”，也可以（在美国）指一种奶油夹心的软焦糖糖果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the tail of a cow","zh":"牛的尾巴"},"examples":[{"en":"Flies kept landing on the cowtail, so the cow kept swishing it back and forth.","zh":"苍蝇总落在牛尾巴上，所以牛不停地甩来甩去。"},{"en":"The farmer held the cowtail gently while checking the animal’s health.","zh":"农夫轻轻抓住牛尾巴，检查这头牛的健康状况。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially in the U.S.) a chewy caramel candy with a cream filling, often sold under the brand name Cow Tales","zh":"（尤指美国）一种夹心软焦糖糖果，常见品牌名为 Cow Tales（牛尾糖）"},"examples":[{"en":"He bought a cowtail at the gas station for a quick snack.","zh":"他在加油站买了一根牛尾糖当零食。"},{"en":"Cowtail candies are sweet and chewy, with a creamy center.","zh":"牛尾糖很甜、很有嚼劲，中间有奶油夹心。"}]}],"synonyms":["cow’s tail","cattle tail","caramel candy (for the candy meaning)"],"phonetic":"/ˈkaʊˌteɪl/","extraExplanation":["拼写上常见三种：cowtail、cow tail、cow-tail。写成两个词（cow tail）更容易被理解为“牛的尾巴”；写成一个词（cowtail）在口语或商品语境里更可能指糖果。","糖果义多与美国品牌名 Cow Tales 相关：严格来说是专有名词（品牌），但在口语中有时也被泛化用来指类似的夹心焦糖条。"]}
{"word":"cowthwort","summary":{"en":"“Cowthwort” is not a standard modern English word; it’s likely a misspelling or a rare historical/dialect form (possibly related to old plant-name “-wort” words).","zh":"“cowthwort”不是现代标准英语词；更可能是拼写错误或罕见的历史/方言形式（可能与古老植物名后缀“-wort”有关）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling or a very rare dialect/archival form. In modern dictionaries, “cowthwort” is generally not recorded as an established entry.","zh":"不是标准英语词；很可能是拼写错误或极罕见的方言/旧式写法。现代词典中通常不把“cowthwort”作为规范词条收录。"},"examples":[{"en":"I couldn’t find “cowthwort” in major dictionaries—could you check the spelling or share the sentence it’s from?","zh":"我在主流词典里找不到“cowthwort”——你能确认一下拼写或提供它所在的句子吗？"},{"en":"It may be a mistaken spelling of a plant name such as “cowwort” or something similar.","zh":"它可能是某个植物名称（如“cowwort”等）的误拼。"}]}],"synonyms":["(possible intended word) cowwort","(related pattern) -wort plant names"],"phonetic":"ˈkaʊθwɝt","extraExplanation":["从构词看，“-wort”在古英语/中古英语里常见于植物名，意思接近“草本植物、药草”（如 St John’s wort）。如果这是从旧文本、民间植物名或家谱/地名材料里来的词，很可能属于冷僻的地方用法或抄写误差。","你可以把原句或来源贴出来（书名/年代/地区），我可以更准确判断它是：①误拼；②某个已知植物名的变体；③专有名词（姓氏/地名）的误读。"]}
{"word":"cowtongue","summary":{"en":"Cowtongue most commonly means beef tongue used as food; in some regions it can also mean a plant with tongue-shaped rough leaves.","zh":"cowtongue 最常指可食用的牛舌；在某些地区也可指叶片像舌头、表面粗糙的植物俗名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the tongue of a cow (beef tongue), often cooked and eaten as food","zh":"牛的舌头（牛舌），常被烹调食用"},"examples":[{"en":"They served tacos filled with braised cowtongue.","zh":"他们端上了用炖牛舌做馅的塔可。"},{"en":"Cowtongue is usually simmered until tender, then sliced.","zh":"牛舌通常会先小火煮到软嫩，再切片食用。"}]},{"partOfSpeech":"n.","definition":{"en":"(regional) a common name for certain plants with rough, tongue-shaped leaves (the exact species varies by place)","zh":"（地方用法）某些叶片粗糙、形似舌头的植物俗名（具体指哪种植物因地区而异）"},"examples":[{"en":"In some areas, people call that weed “cowtongue” because of its fuzzy leaves.","zh":"在一些地方，人们因为那种杂草的叶子毛茸茸的，就叫它“cowtongue（牛舌草）”。"}]}],"synonyms":["beef tongue","ox tongue","tongue"],"phonetic":"/ˈkaʊˌtʌŋ/","extraExplanation":["烹饪语境里更常见的说法是“beef tongue”（牛舌）；菜单上也可能写“tongue”。如果你在读植物百科或地方口语里看到“cowtongue”，它可能是某种“叶子像舌头、表面粗糙”的植物俗名，最好结合产地或拉丁学名确认。"]}
{"word":"cowtown","summary":{"en":"Cowtown is an informal noun meaning a town known for cattle ranching or, sometimes, a specific nickname for Wichita, Kansas.","zh":"Cowtown 是非正式名词，指以牧牛业闻名的城镇；也可特指堪萨斯州的威奇托（Wichita）的昵称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Informal) A town strongly associated with cattle ranching, stockyards, or the cattle trade; a place seen as rural or unsophisticated.","zh":"（非正式）以牧牛、牲畜市场或牛只贸易闻名的城镇；也可带点贬义，指“乡下、不够时髦的地方”。"},"examples":[{"en":"Before the tech boom, people dismissed the city as a cowtown.","zh":"在科技热潮之前，人们常把这座城市贬称为“牛仔小镇”。"},{"en":"He grew up in a cowtown where everyone knew the rodeo schedule.","zh":"他在一个“牛镇”长大，那里人人都知道牛仔竞技的时间表。"},{"en":"Don’t call it a cowtown—there’s a lot of culture here now.","zh":"别再叫这里“牛镇”了——这里现在很有文化气息。"}]},{"partOfSpeech":"n.","definition":{"en":"A nickname for certain U.S. cities with a cattle-history reputation (especially Wichita, Kansas, often called “Cowtown”).","zh":"美国一些因畜牧业历史而得名的城市昵称（尤其指堪萨斯州威奇托 Wichita，常被称为“Cowtown”）。"},"examples":[{"en":"We spent the weekend in Cowtown, visiting the Old Cowtown Museum in Wichita.","zh":"我们在“Cowtown”过周末，参观了威奇托的“Old Cowtown Museum（老牛镇博物馆）”。"},{"en":"Cowtown pride is part of Wichita’s local identity.","zh":"“Cowtown”的自豪感是威奇托本地认同的一部分。"}]}],"synonyms":["cattle town","ranch town","stockyard town"],"phonetic":"/ˈkaʊ.taʊn/","extraExplanation":["“cowtown”多用于口语或带态度的表达：可以是中性（说明与牧牛业有关），也可能带一点轻视，暗示地方“土”“不够现代”。使用时注意语气与场合。","在美国历史语境里，一些城市因19世纪的牛群驱赶（cattle drives）、铁路集散、牲畜市场而兴起，因此出现“Cowtown”这类绰号。威奇托（Wichita, Kansas）是最常见的专名用法之一。"]}
{"word":"cowweed","summary":{"en":"Cowweed is a regional common name for different pasture weeds, often plants found where cows graze.","zh":"cowweed 是地方性俗称，泛指牧场里常见的杂草/野草，常与牛放牧环境有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a common name for various wild plants that grow in pastures and fields and are considered weeds, especially those eaten by cows or found where cattle graze (the exact species depends on the region).","zh":"（俗名）牛草；牛吃的野草；泛指牧场或田野里被当作杂草的植物（具体指哪一种植物因地区而异）。"},"examples":[{"en":"The farmer sprayed the field to control cowweed in the pasture.","zh":"农夫给牧场喷药来控制牛草（杂草）。"},{"en":"After a wet spring, cowweed spread quickly along the fence line.","zh":"潮湿的春天过后，牛草很快沿着篱笆边蔓延开来。"}]}],"synonyms":["pasture weed","weed","wild plant"],"phonetic":"ˈkaʊˌwid","extraExplanation":["“cowweed”不是一个严格的植物学名称，而是地方性的俗称：在不同国家或地区，它可能指不同的野草/杂草种类。阅读农业、园艺或自然观察类文章时，最好结合上下文（地点、图片、拉丁学名）来确认具体是哪一种植物。"]}
{"word":"cowwheat","summary":{"en":"Cowwheat is a wildflower (Melampyrum) found in woods and heaths, known for being partly parasitic on other plants’ roots.","zh":"Cowwheat 指牛麦属野花，常见于林地和荒原，并以半寄生于其他植物根系而著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A plant of the genus *Melampyrum* (especially *Melampyrum pratense*), a wildflower that often grows in woods and heaths; it is partly parasitic on the roots of other plants.","zh":"牛麦属（*Melampyrum*）植物（尤指草地牛麦 *Melampyrum pratense*），一种常见于林地和荒原的野花；它会半寄生在其他植物根部获取养分。"},"examples":[{"en":"We found cowwheat growing along the edge of the pine woods.","zh":"我们在松树林边发现了牛麦。"},{"en":"In late summer, cowwheat’s small yellow flowers can be seen in shady places.","zh":"夏末时，在阴凉处能看到牛麦的小黄花。"}]}],"synonyms":["melampyrum","common cowwheat","yellow cow-wheat"],"phonetic":"/ˈkaʊˌwiːt/","extraExplanation":["“cowwheat”是英式英语里较常见的植物俗名，多见于自然观察、植物志和乡野写作中；它不是“小麦”，名字里的“wheat”更多是民间命名习惯。","牛麦属植物常被称为“半寄生植物”：能进行光合作用，但也会从邻近植物根系“借”一部分水分和矿物质。"]}
{"word":"cowy","summary":{"en":"“Cowy” is an uncommon adjective meaning “cow-like.”","zh":"“cowy”是一个不常用的形容词，意思是“像牛的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Uncommon) Like a cow; having the appearance or behavior of a cow.","zh":"（不常用）像牛的；具有牛的外貌或举止的。"},"examples":[{"en":"The calf had big, cowy eyes.","zh":"那头小牛有一双大大的、像牛一样的眼睛。"},{"en":"In the cartoon, the character made a slow, cowy chew.","zh":"在动画片里，这个角色慢吞吞地像牛一样咀嚼。"}]}],"synonyms":["cowlike","bovine"],"phonetic":"/ˈkaʊi/","extraExplanation":["“cowy”在现代英语里比较少见，多用于轻松、描写性的语境（尤其是写动物或带一点幽默的文字）。","更常见的表达是“cow-like”（像牛的）或用具体特征来写，比如“large gentle eyes”（大而温柔的眼睛）、“slow chewing”（慢慢咀嚼）。"]}
{"word":"cowyard","summary":{"en":"A farm enclosure where cows are kept or gathered, often before milking.","zh":"农场里圈养或集中奶牛的围场，常用于挤奶前集合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A yard or enclosed area on a farm where cows are kept, gathered, or milked.","zh":"牛场；牛圈外的围场（农场里用来圈养、集中或挤奶的露天院子/围栏区）。"},"examples":[{"en":"The cows were waiting quietly in the cowyard before milking.","zh":"挤奶前，奶牛安静地在牛场里等待。"},{"en":"Please close the gate when you leave the cowyard.","zh":"离开牛圈外的围场时，请把门关上。"}]}],"synonyms":["cattle yard","corral","holding pen","cow pen"],"phonetic":"/ˈkaʊ.jɑrd/","extraExplanation":["“cowyard”更常见于英式或乡村语境，有时也写作“cow yard”。在美式英语中，人们更常说“cattle yard”“holding pen”“corral”（围栏/圈栏）或在挤奶场景里说“milking parlor”（挤奶厅）。","词源结构很直观：cow（牛）+ yard（院子/围场）。它通常指户外围起来的区域，而不是室内的“barn”（牛棚/畜棚）。"]}

