{"word":"CP","summary":{"en":"“CP” is a context-dependent abbreviation, commonly meaning a romantic pairing in fandoms, and it can also mean cerebral palsy, competitive programming, or child protection.","zh":"“CP”是强语境缩写，常指粉丝圈的“配对/情侣”，也可指脑瘫、竞赛编程或儿童保护等。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “couple/pairing,” especially in fandoms, meaning two people who are (or are imagined to be) in a romantic relationship.","zh":"（缩写）“couple/pairing”的简称，常见于追星、二次元等圈子，指两个人被认为或被想象成一对（情侣/配对）。"},"examples":[{"en":"This drama’s CP is really popular online.","zh":"这部剧的CP在网上特别火。"},{"en":"I don’t ship that CP, but I see why others do.","zh":"我不嗑那对CP，但我能理解别人为什么嗑。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “cerebral palsy,” a medical condition that affects movement and muscle control.","zh":"（缩写）“cerebral palsy（脑瘫）”的简称，一种影响运动与肌肉控制的疾病。"},"examples":[{"en":"The clinic provides therapy for children with CP.","zh":"这家诊所为患有CP的孩子提供康复治疗。"},{"en":"CP can affect movement in different ways.","zh":"CP对运动能力的影响因人而异。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “competitive programming,” contests where people solve algorithm and coding problems under time limits.","zh":"（缩写）“competitive programming（竞赛编程/算法竞赛）”的简称，指在限时内解决算法与编程题目的比赛。"},"examples":[{"en":"She practices CP problems every day to improve her speed.","zh":"她每天练CP题来提升速度。"},{"en":"CP contests often require strong algorithms knowledge.","zh":"CP比赛通常需要扎实的算法基础。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “child protection” (or “child protective services”), referring to systems and agencies that help keep children safe.","zh":"（缩写）“child protection（儿童保护）/ child protective services（儿童保护服务机构）”的简称，指保障儿童安全的制度或机构。"},"examples":[{"en":"The school followed CP procedures to report concerns.","zh":"学校按照CP流程上报了疑虑。"},{"en":"CP services investigate reports of child neglect.","zh":"CP机构会调查有关忽视儿童的举报。"}]}],"synonyms":["pairing","couple (fandom)","ship (v., fandom)"],"phonetic":"/ˌsiːˈpiː/","extraExplanation":["“CP”属于高度依赖语境的缩写：在中文互联网里最常见的是“嗑CP”（喜欢/支持某对配对）；在英文环境中也会用“ship a CP / favorite CP”表示支持某对CP。","在医学或公共服务语境中，建议第一次出现时写全称（如 cerebral palsy / child protection），之后再用CP，以避免误解。"]}
{"word":"CPA","summary":{"en":"CPA most commonly means Certified Public Accountant; in marketing, it can mean cost per action/acquisition.","zh":"CPA最常指美国“注册会计师”；在营销投放中也可指按行动/获客计费（获客成本）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Certified Public Accountant: a licensed accounting professional in the U.S. who can audit financial statements and provide advanced accounting and tax services.","zh":"注册会计师（美国常用）：通过统一考试并取得执照的专业会计人员，可进行审计并提供高级会计与税务服务。"},"examples":[{"en":"She’s studying to become a CPA after graduation.","zh":"她毕业后正在备考，想成为一名CPA（注册会计师）。"},{"en":"Our company hired a CPA to handle taxes and financial reports.","zh":"我们公司请了一位CPA来处理税务和财务报表。"}]},{"partOfSpeech":"n.","definition":{"en":"Cost per action (or cost per acquisition): an online advertising metric meaning the cost for each desired result (like a purchase or sign-up).","zh":"（广告/营销）按行动计费/按获客计费：指每产生一次目标结果（如购买、注册）所花的成本。"},"examples":[{"en":"We lowered our CPA by improving the landing page.","zh":"我们通过优化落地页降低了CPA（获客成本）。"},{"en":"The campaign’s CPA is too high, so we need to adjust targeting.","zh":"这次投放的CPA太高了，我们需要调整定向。"}]}],"synonyms":["Certified Public Accountant","accountant","cost per acquisition","cost per action"],"phonetic":"/ˌsiː piː ˈeɪ/","extraExplanation":["在美国语境中，CPA最常指“Certified Public Accountant（注册会计师）”。在简历、公司职位（如“CPA preferred”）或会计事务所语境里几乎都是这个意思。","在数字营销/投放语境（如广告平台报表、KPI讨论）里，CPA常指“cost per action/acquisition”。需要结合上下文判断。","写法上通常全大写“CPA”。复数可写“CPAs”。"]}
{"word":"CPC","summary":{"en":"CPC is an abbreviation most commonly meaning cost per click in digital marketing; it can also mean the Communist Party of China or (less commonly) Code of Civil Procedure, depending on context.","zh":"CPC 是缩写，最常见指数字营销中的“按点击付费单价”；也可指“中国共产党”，或（较少见）“民事诉讼法/民事诉讼程序规则”，需结合语境判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(business/marketing) Cost per click: the amount an advertiser pays each time someone clicks an online ad.","zh":"（商业/营销）按点击付费单价：广告主每次有人点击网络广告时支付的费用。"},"examples":[{"en":"Our CPC went up after we changed the keywords.","zh":"我们更换关键词后，CPC 上升了。"},{"en":"Lowering CPC can help you get more traffic with the same budget.","zh":"降低 CPC 可以在同样预算下带来更多流量。"}]},{"partOfSpeech":"n.","definition":{"en":"(politics) Communist Party of China: the ruling political party of the People’s Republic of China.","zh":"（政治）中国共产党：中华人民共和国的执政党。"},"examples":[{"en":"The CPC held a meeting to discuss policy priorities.","zh":"中国共产党召开会议讨论政策重点。"},{"en":"In news articles, CPC often appears in discussions of China’s government and politics.","zh":"在新闻报道中，CPC 常出现在有关中国政府与政治的讨论里。"}]},{"partOfSpeech":"n.","definition":{"en":"(law/other, less common) Code of Civil Procedure: a set of rules for how civil lawsuits are handled in court (meaning varies by country/region).","zh":"（法律/其他，较少见）民事诉讼法/民事诉讼程序规则：法院处理民事案件的一套规则（各国家/地区内容不同）。"},"examples":[{"en":"The judge cited the CPC when explaining the filing deadline.","zh":"法官在说明提交期限时引用了 CPC（民事诉讼程序规则）。"},{"en":"Always check which CPC a document refers to in your jurisdiction.","zh":"务必确认文件中所指的是你所在法域的哪一部 CPC。"}]}],"synonyms":["cost per click (for the marketing sense)","PPC (related term: pay-per-click)"],"phonetic":"/ˌsiː piː ˈsiː/","extraExplanation":["“CPC”是缩写，具体含义高度依赖语境：在广告投放/电商数据里最常指 cost per click；在政治新闻里常指 Communist Party of China；在法律文件里也可能指 Code of Civil Procedure。阅读时可以通过同一句中的关键词（如 ads, keywords, campaign / policy, party / court, lawsuit）来快速判断。"]}
{"word":"CPCU","summary":{"en":"CPCU = Chartered Property Casualty Underwriter, a respected professional credential in the property-and-casualty insurance field.","zh":"CPCU指特许财产与意外险核保师，是财产与意外险领域较受认可的专业资格认证。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a professional designation meaning “Chartered Property Casualty Underwriter,” earned by insurance professionals (especially in property-and-casualty insurance) after completing required coursework and exams.","zh":"专业资格认证缩写，指“Chartered Property Casualty Underwriter（特许财产与意外险核保师）”，保险从业者（尤其是财产与意外险领域）通过相关课程与考试后获得。"},"examples":[{"en":"She earned her CPCU to advance her career in property-and-casualty insurance.","zh":"她取得了CPCU资格，以在财产与意外险领域提升职业发展。"},{"en":"Our claims manager is a CPCU, so he has strong training in coverage and risk management.","zh":"我们的理赔经理拥有CPCU资格，因此在保险责任范围与风险管理方面训练扎实。"},{"en":"You’ll often see “CPCU” after someone’s name on LinkedIn or business cards.","zh":"你常会在领英或名片上看到别人名字后面写着“CPCU”。"}]}],"synonyms":["Chartered Property Casualty Underwriter","CPCU designation","P&C credential"],"phonetic":"/ˌsi pi ˌsi ˈju/","extraExplanation":["CPCU常作为姓名后的头衔使用（类似学历或证照标注），例如：Alex Chen, CPCU。","它主要与美国的财产险与意外险（P&C insurance）行业相关，强调保险条款理解、承保（underwriting）、理赔（claims）与风险管理（risk management）等能力。"]}
{"word":"CPD","summary":{"en":"CPD usually means Continuing Professional Development—ongoing training to keep and improve professional skills.","zh":"CPD 通常指 Continuing Professional Development（持续专业发展）——用于保持并提升职业技能的持续培训与学习。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Continuing Professional Development: ongoing learning and training that helps people maintain and improve their skills for their job or profession.","zh":"持续专业发展：为保持并提升工作/职业技能而进行的持续学习与培训。"},"examples":[{"en":"Teachers are required to complete a certain number of CPD hours each year.","zh":"教师通常被要求每年完成一定数量的 CPD 学时。"},{"en":"This workshop counts as CPD for nurses.","zh":"这场工作坊可计入护士的 CPD 学分/时数。"},{"en":"I keep a CPD record to show what courses I’ve taken.","zh":"我会保存一份 CPD 记录，用来证明我参加过哪些课程。"}]}],"synonyms":["professional development","continuing education","in-service training","ongoing training"],"phonetic":"/ˌsiː piː ˈdiː/","extraExplanation":["CPD 常见于英国、澳大利亚等英语环境的职场与行业监管语境（例如教师、护士、会计、工程师），通常与“需要完成的学时/学分”“年度要求”“资质续证/注册更新”一起出现。","在日常书写中多写作大写缩写：CPD；口语里常读作字母 “C-P-D”。有些机构也会用“CPD points/credits/hours”（学分/时数）来量化。"]}
{"word":"CPE","summary":{"en":"CPE most commonly refers to Cambridge’s advanced English exam (now called C2 Proficiency), but it can also mean customer premises equipment or continuing professional education.","zh":"CPE最常指剑桥高级英语考试（现名C2 Proficiency），也可指用户终端设备或继续专业教育。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Cambridge) Certificate of Proficiency in English: a very advanced English exam (C2 level) from Cambridge English; today it is officially called “C2 Proficiency.”","zh":"（剑桥）英语熟练证书考试：剑桥英语的一项最高级别英语考试（C2级）；如今官方名称为“C2 Proficiency（C2熟练）”。"},"examples":[{"en":"She passed the CPE and can study at an English-speaking university easily.","zh":"她通过了CPE，现在去英语国家大学学习会轻松很多。"},{"en":"I’m preparing for the CPE to prove my English is at C2 level.","zh":"我在准备CPE，以证明我的英语达到了C2水平。"},{"en":"Many people still say “CPE,” even though the exam is now called C2 Proficiency.","zh":"尽管考试现在叫C2 Proficiency，很多人仍然习惯说“CPE”。"}]},{"partOfSpeech":"n.","definition":{"en":"Customer premises equipment: equipment (like a modem or router) located at a customer’s home or business and used to access a service (often telecom or internet).","zh":"用户终端设备：安装在用户家里或公司，用于接入服务（常见于通信/互联网）的设备，如调制解调器、路由器等。"},"examples":[{"en":"The internet provider replaced the CPE to fix the connection problem.","zh":"网络运营商更换了用户终端设备（CPE）来解决连接问题。"},{"en":"This router is the CPE installed in our office.","zh":"这个路由器就是安装在我们办公室的CPE。"}]},{"partOfSpeech":"n.","definition":{"en":"Continuing professional education: ongoing learning/training professionals do to maintain or improve job skills (often required for licenses).","zh":"继续专业教育：职业人士为保持或提升技能而进行的持续学习/培训（常与执照或资格维持要求相关）。"},"examples":[{"en":"Doctors often need CPE credits to renew their licenses.","zh":"医生通常需要继续专业教育（CPE）学分来续证。"},{"en":"The company offers CPE courses every quarter.","zh":"公司每个季度都会提供CPE课程。"}]}],"synonyms":["C2 Proficiency","Cambridge Proficiency","customer premises equipment","continuing professional education"],"phonetic":"/ˌsiː piː ˈiː/","extraExplanation":["在英语学习语境中，“CPE”最常指剑桥考试体系里原来的“Certificate of Proficiency in English”。目前官方更常用的名称是“C2 Proficiency”，但很多教材、论坛和考生仍会用旧简称“CPE”。","如果你是在备考讨论里看到“CPE”，通常就是指“剑桥C2级别”的这门考试；在IT/通信领域看到“CPE”，更可能是“用户终端设备”。"]}
{"word":"CPFF","summary":{"en":"CPFF most commonly means the Federal Reserve’s Commercial Paper Funding Facility; outside finance, it may be a context-specific abbreviation.","zh":"CPFF最常见含义是美联储的“商业票据融资机制”；在非金融语境中也可能是依上下文而定的缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(acronym, finance) Commercial Paper Funding Facility: a temporary U.S. Federal Reserve program that buys commercial paper to keep short-term credit flowing in financial crises.","zh":"（缩写，金融）商业票据融资机制：美国联邦储备在金融危机时期设立的临时项目，通过购买商业票据来维持短期融资与信用流动。"},"examples":[{"en":"During the 2008 crisis, the Fed created the CPFF to support the commercial paper market.","zh":"在2008年金融危机期间，美联储设立了CPFF来支持商业票据市场。"},{"en":"Some companies relied on CPFF-backed liquidity when short-term funding dried up.","zh":"当短期融资枯竭时，一些公司依赖CPFF提供的流动性支持。"}]},{"partOfSpeech":"other","definition":{"en":"(general) CPFF can also be an organization or internal abbreviation whose meaning depends on context (e.g., a company name, project code, or school club).","zh":"（泛指）CPFF也可能是某个机构名称或内部缩写，其具体含义取决于上下文（例如公司名、项目代号或社团名）。"},"examples":[{"en":"What does CPFF stand for in this document?","zh":"在这份文件里，CPFF代表什么？"},{"en":"Our team’s CPFF is listed on the schedule, but the full name isn’t explained.","zh":"日程表上写着我们团队的CPFF，但没有解释全称。"}]}],"synonyms":["Commercial Paper Funding Facility (spelled out)"],"phonetic":"/si pi ɛf ɛf/","extraExplanation":["在金融语境里，CPFF最常指美联储在2008年推出的应急工具，用来稳定“商业票据（commercial paper）”这一短期融资市场；2020年疫情冲击时也曾重启类似机制。读到CPFF时，最有效的判断方法是看同段落是否出现“Fed / Federal Reserve、commercial paper、liquidity（流动性）、credit market（信贷市场）”等关键词。"]}
{"word":"CPH","summary":{"en":"“CPH” most commonly means Copenhagen Airport’s code; it can also mean “cost per hire” in business contexts.","zh":"“CPH”最常见指哥本哈根机场代码；在商业语境中也可指“每次招聘成本”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) The IATA airport code for Copenhagen Airport (Kastrup) in Denmark; often used on tickets, luggage tags, and flight schedules to mean “Copenhagen.”","zh":"（缩写）丹麦哥本哈根机场（凯斯楚普机场）的国际航空运输协会（IATA）机场代码；常见于机票、行李牌和航班信息中，表示“哥本哈根”。"},"examples":[{"en":"My flight arrives at CPH at 7:40 p.m.","zh":"我的航班晚上7:40到达CPH（哥本哈根机场）。"},{"en":"The cheapest route was JFK → CPH → Oslo.","zh":"最便宜的路线是JFK→CPH→奥斯陆。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev., business) Cost per hire (the cost to recruit one employee).","zh":"（缩写，商业）每次招聘成本（招聘到一名员工的成本）。"},"examples":[{"en":"We reduced CPH by improving our referral program.","zh":"我们通过改进内推项目降低了CPH（每次招聘成本）。"},{"en":"The report compares CPH across departments.","zh":"这份报告比较了各部门的CPH（每次招聘成本）。"}]}],"synonyms":["Copenhagen Airport","Kastrup Airport","cost per hire"],"phonetic":"/ˌsiː piː ˈeɪtʃ/","extraExplanation":["在旅行语境里，CPH最常见，属于机场三字代码（如LAX、JFK）。在不同专业领域（如人力资源/市场/医疗记录）里，CPH也可能代表其他术语，所以看上下文很关键。"]}
{"word":"CPI","summary":{"en":"CPI most commonly means the Consumer Price Index, a key measure of inflation; in marketing it can mean cost per impression.","zh":"CPI最常指“消费者物价指数”，用于衡量通胀；在营销语境中也可指“每次展示成本”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Consumer Price Index: a number that tracks changes in the prices of a “basket” of common goods and services, used to measure inflation.","zh":"消费者物价指数：用一篮子常见商品与服务的价格变化来衡量通货膨胀的指标。"},"examples":[{"en":"The CPI rose 0.3% in January, suggesting inflation is still persistent.","zh":"1月CPI上涨0.3%，表明通胀仍然较顽固。"},{"en":"Wages didn’t keep up with the CPI, so many families felt poorer.","zh":"工资没跟上CPI的增长，所以很多家庭感觉更拮据。"}]},{"partOfSpeech":"n.","definition":{"en":"(Marketing) Cost per impression: the cost of showing an online ad one time (often measured per 1,000 impressions as CPM).","zh":"（营销）每次展示成本：线上广告每展示一次的成本（常见按每千次展示计费，即CPM）。"},"examples":[{"en":"Our CPI dropped after we improved the ad targeting.","zh":"我们优化定向后，CPI下降了。"},{"en":"The platform reports CPI and CPM for each campaign.","zh":"平台会为每个活动提供CPI和CPM数据。"}]},{"partOfSpeech":"n.","definition":{"en":"(General/business) An abbreviation used in different fields for different terms; the meaning depends on the context (e.g., finance, marketing, inspections).","zh":"（通用/商业）在不同行业代表不同含义的缩写；具体意思取决于语境（如金融、营销、检验等）。"},"examples":[{"en":"In this report, CPI refers to the Consumer Price Index, not advertising costs.","zh":"在这份报告里，CPI指消费者物价指数，而不是广告成本。"}]}],"synonyms":["Consumer Price Index","headline CPI","core CPI","cost per impression"],"phonetic":"/ˌsiː piː ˈaɪ/","extraExplanation":["在新闻与经济讨论中，CPI最常见的含义是“消费者物价指数”，常被用来判断通胀高低，并影响利率、房贷、汇率等预期。","CPI通常分为“总体CPI（headline CPI）”和“核心CPI（core CPI，剔除食品与能源等波动较大的项目）”。很多分析会更关注核心CPI来观察长期趋势。","不同国家/机构计算CPI的方法与“篮子”构成会有差异，因此跨国比较时要注意口径。"]}
{"word":"CPIO","summary":{"en":"CPIO is an acronym most commonly meaning Chief Privacy Officer; it can also mean Chief Public Information Officer in government or emergency contexts.","zh":"CPIO是一个缩写，最常见指“首席隐私官”；在政府或应急场景中也可指“首席公共信息官”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Chief Privacy Officer: the senior leader responsible for an organization’s privacy strategy and compliance (how personal data is collected, used, protected, and shared).","zh":"首席隐私官：负责组织整体隐私战略与合规的高层管理者（包括个人数据的收集、使用、保护与共享）。"},"examples":[{"en":"Our CPIO updated the company’s privacy policy to meet new regulations.","zh":"我们的CPIO更新了公司的隐私政策，以符合新法规。"},{"en":"If you have questions about how your data is used, contact the CPIO’s office.","zh":"如果你对数据如何被使用有疑问，可以联系首席隐私官办公室。"}]},{"partOfSpeech":"other","definition":{"en":"Chief Public Information Officer: a senior official (often in government or emergency management) who communicates official information to the public and media.","zh":"首席公共信息官：负责向公众与媒体发布官方信息的高级官员（常见于政府或应急管理部门）。"},"examples":[{"en":"During the storm, the CPIO held daily press briefings.","zh":"在暴风雨期间，CPIO每天举行新闻发布会。"},{"en":"The CPIO clarified the evacuation instructions on local TV.","zh":"CPIO在本地电视上澄清了撤离指示。"}]}],"synonyms":["CPO (Chief Privacy Officer)","privacy officer","public information officer (PIO)","spokesperson"],"phonetic":"/ˌsiːpiːaɪˈoʊ/","extraExplanation":["“CPIO”通常读作字母串：C-P-I-O。在不同机构里它可能代表不同职位名称；判断具体含义时，可以看上下文（公司/政府部门、隐私/媒体沟通等）。"]}
{"word":"CPL","summary":{"en":"CPL most commonly means “cost per lead” (marketing) or “commercial pilot license” (aviation).","zh":"CPL 最常见指“每条线索成本”（营销）或“商用飞行员执照”（航空）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Cost per lead: a marketing metric showing how much money you spend to get one potential customer (one “lead”).","zh":"每条潜在客户线索成本：一种营销指标，表示获得一个潜在客户（线索）需要花多少钱。"},"examples":[{"en":"Our CPL dropped after we improved the landing page.","zh":"我们优化落地页后，CPL 降低了。"},{"en":"This campaign has a high CPL, so we may pause the ads.","zh":"这个活动的 CPL 很高，所以我们可能会暂停投放。"}]},{"partOfSpeech":"n.","definition":{"en":"Commercial Pilot License: an official license that allows someone to be paid to fly an aircraft.","zh":"商用飞行员执照：允许飞行员以驾驶航空器为职业并获得报酬的官方执照。"},"examples":[{"en":"She earned her CPL and started flying charter flights.","zh":"她考取了 CPL，开始飞包机航班。"},{"en":"To apply, you must meet the flight-hour requirements for a CPL.","zh":"要申请，你必须满足获取 CPL 的飞行小时数要求。"}]},{"partOfSpeech":"n.","definition":{"en":"(Computing) Current privilege level: a CPU setting that shows what level of access a program has.","zh":"（计算机）当前特权级：处理器中的一个设置，表示程序拥有多高的访问权限。"},"examples":[{"en":"The system checks the CPL before allowing the instruction.","zh":"系统会在允许该指令前检查 CPL。"},{"en":"User programs typically run at a lower CPL than the kernel.","zh":"用户程序通常在比内核更低的 CPL 下运行。"}]}],"synonyms":["cost per lead","commercial pilot license","CPM","CPC","CPA"],"phonetic":"/ˌsiː piː ˈɛl/","extraExplanation":["“CPL”是缩写，不同领域含义差异很大。营销语境里常与“CPA（每次获客成本）”“CPC（每次点击成本）”一起出现；航空语境里常与“PPL（私用飞行员执照）”“ATPL（航线运输飞行员执照）”并列。理解时最关键是看上下文：广告/投放/线索→多半是Cost per lead；飞行执照/小时/训练→多半是Commercial Pilot License。"]}
{"word":"Cpl","summary":{"en":"“Cpl” most commonly means “corporal” (a military rank). In casual texting, it can also mean “couple.”","zh":"“Cpl”最常见是“corporal（下士）”的缩写；在非正式聊天中也可能表示“couple（几个/一对）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “corporal,” a low-ranking noncommissioned officer in the army or similar forces","zh":"“corporal（下士）”的缩写，指军队等组织中的一种较低级别的士官军衔"},"examples":[{"en":"Cpl. Davis reported to the duty officer at 0800.","zh":"下士（Cpl.）Davis 于 8:00 向值班军官报到。"},{"en":"Ask Cpl. Chen for the equipment checklist.","zh":"去找下士（Cpl.）陈要装备清单。"}]},{"partOfSpeech":"other","definition":{"en":"(informal, in texting) sometimes used as a shortened form of “couple,” meaning two or a small number","zh":"（非正式，聊天用语）有时是 “couple” 的简写，表示“两三个/一对/少量”"},"examples":[{"en":"I’ll be there in a cpl minutes.","zh":"我几分钟后到。"},{"en":"Let’s grab a cpl of snacks for the trip.","zh":"我们带点零食上路吧。"}]}],"synonyms":["corporal","cpl. (variant spelling)"],"phonetic":"/ˈkɔːrpərəl/","extraExplanation":["在正式英文写作中，军衔缩写通常带点号：Cpl.；但在军队内部文件或某些格式中也可能不加点号（Cpl）。是否需要大写取决于是否作为头衔使用：Cpl. Davis（大写） vs. a corporal（小写）。","“Cpl=couple”的用法主要见于非正式短信/网络聊天，不建议用于正式邮件或学术写作。"]}
{"word":"CPM","summary":{"en":"CPM is an abbreviation most commonly meaning ad cost per 1,000 impressions, but it can also mean Critical Path Method or counts per minute depending on context.","zh":"CPM 是一个缩写，最常见指广告“每千次展示成本”，也可能指项目管理“关键路径法”或科研中的“每分钟计数”，需结合语境判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Cost per mille (in advertising): the cost to show an ad 1,000 times (1,000 impressions).","zh":"（广告）CPM：每千次展示成本，指广告展示 1,000 次（1,000 次曝光）所需的费用。"},"examples":[{"en":"We chose CPM bidding because we mainly want more brand exposure.","zh":"我们选择 CPM 出价，因为我们主要想提高品牌曝光。"},{"en":"The campaign’s CPM dropped after we improved our targeting.","zh":"我们优化定向后，这个活动的 CPM 降低了。"}]},{"partOfSpeech":"n.","definition":{"en":"Critical Path Method (in project management): a planning method used to find the longest sequence of dependent tasks and the earliest finish date.","zh":"（项目管理）关键路径法：一种用于找出任务依赖关系中最长路径、并推算最早完工时间的计划方法。"},"examples":[{"en":"Using CPM, we identified which tasks could not be delayed.","zh":"用 CPM 我们找出了哪些任务不能延期。"},{"en":"The CPM chart shows the project will finish in twelve weeks.","zh":"CPM 图表显示项目将于 12 周内完成。"}]},{"partOfSpeech":"n.","definition":{"en":"Counts per minute (in science/medicine): the number of detected events in one minute, often for radiation measurement.","zh":"（科学/医学）每分钟计数：一分钟内检测到的事件次数，常用于辐射检测。"},"examples":[{"en":"The technician recorded 120 CPM on the detector.","zh":"技术员在探测器上记录到 120 CPM。"}]},{"partOfSpeech":"n.","definition":{"en":"In some contexts, CPM can also mean cycles per minute (machine speed) or characters per minute (typing speed).","zh":"在某些语境中，CPM 也可指每分钟转数（机器速度）或每分钟字符数（打字速度）。"},"examples":[{"en":"The motor runs at 1,800 CPM in this setting.","zh":"在这个设置下，电机以每分钟 1,800 转（CPM）运行。"},{"en":"Her typing speed is about 300 CPM.","zh":"她的打字速度大约是每分钟 300 个字符（CPM）。"}]}],"synonyms":["cost per thousand (for advertising CPM)","critical path method (full term)"],"phonetic":"/ˌsiː piː ˈɛm/","extraExplanation":["CPM 是缩写，具体含义要看场景：做广告投放时最常见的是“每千次展示成本”；在项目管理课或工程领域常见的是“关键路径法”；在实验室或辐射监测中则常指“每分钟计数”。看到 CPM 时，优先根据行业（广告/项目/科研）判断。"]}
{"word":"CPMP","summary":{"en":"CPMP is an initialism with multiple possible meanings; most often it refers to a project-management certification title, but the exact meaning depends on context.","zh":"CPMP 是一个可能有多种含义的缩写；最常见指项目管理类认证称号，但具体含义需结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an initialism that can refer to several things; most commonly used to mean a project-management certification title (e.g., “Certified Project Management Professional” or similar, depending on the organization).","zh":"一个首字母缩写，可能代表多种含义；最常见的用法是指某种项目管理相关的认证称号（例如“Certified Project Management Professional/项目管理专业认证”等，具体以颁发机构为准）。"},"examples":[{"en":"She added CPMP to her resume after passing the certification exam.","zh":"她通过认证考试后，把 CPMP 写进了简历。"},{"en":"Our company prefers candidates with CPMP or PMP credentials.","zh":"我们公司更倾向于拥有 CPMP 或 PMP 资质的候选人。"}]},{"partOfSpeech":"other","definition":{"en":"(in some fields/organizations) a specific program name, model, or role title abbreviated as CPMP; the exact meaning depends on the industry and context.","zh":"（在某些行业/机构中）某个项目名称、模型或职位名称的缩写；具体含义取决于行业与语境。"},"examples":[{"en":"In this document, CPMP refers to the internal training program.","zh":"在这份文件中，CPMP 指公司内部培训项目。"},{"en":"Could you clarify what CPMP stands for in your report?","zh":"你能说明一下你的报告里 CPMP 代表什么吗？"}]}],"synonyms":["(related) PMP","(related) CAPM","project management certification"],"phonetic":"/ˌsiː piː ˌɛm piː/","extraExplanation":["“CPMP”不是像“NASA”那样固定唯一的缩写，常见于证书、课程、内部项目或职位名称。遇到不确定时，可以直接问：\"What does CPMP stand for here?\" 或在文档开头查找是否有缩写表（abbreviations/glossary）。","如果你告诉我你看到 CPMP 的场景（简历、课程、行业、国家/机构名称），我可以更准确地解释它具体指哪一个。"]}
{"word":"CPO","summary":{"en":"CPO is an acronym that commonly means Chief Product Officer, Chief Procurement Officer, Certified Pre-Owned (cars), or cost per order, depending on context.","zh":"CPO 是缩写，常见含义包括首席产品官、首席采购官、认证二手车，以及每单成本，需结合语境判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Chief Product Officer: a senior executive responsible for a company’s product vision, strategy, and development.","zh":"首席产品官：负责公司产品愿景、战略与产品开发的高管。"},"examples":[{"en":"The CPO worked with engineering and design to define the product roadmap.","zh":"首席产品官与工程和设计团队合作制定产品路线图。"},{"en":"Our CPO focuses on improving user experience and long-term product strategy.","zh":"我们的首席产品官专注于提升用户体验和长期产品战略。"}]},{"partOfSpeech":"n.","definition":{"en":"Chief Procurement Officer: a senior executive in charge of purchasing, suppliers, and procurement strategy.","zh":"首席采购官：负责采购、供应商管理与采购战略的高管。"},"examples":[{"en":"The CPO negotiated a new contract with key suppliers.","zh":"首席采购官与关键供应商谈判签订了新合同。"},{"en":"As CPO, she reduced costs by improving the procurement process.","zh":"作为首席采购官，她通过优化采购流程降低了成本。"}]},{"partOfSpeech":"adj.","definition":{"en":"Certified Pre-Owned (cars): used vehicles that have been inspected and approved by a manufacturer or dealer, often with a warranty.","zh":"认证二手车：经厂商或经销商检测认证、通常带保修的二手车。"},"examples":[{"en":"He bought a CPO sedan that came with an extended warranty.","zh":"他买了一辆认证二手轿车，附带延长保修。"},{"en":"CPO cars usually cost more than regular used cars but feel less risky.","zh":"认证二手车通常比普通二手车更贵，但风险更低。"}]},{"partOfSpeech":"n.","definition":{"en":"Cost per order: a metric showing how much it costs (especially in marketing/ads) to get one order.","zh":"每单成本：衡量获得一笔订单所需成本（常用于营销/广告）的指标。"},"examples":[{"en":"We lowered our CPO by improving targeting in our ads.","zh":"我们通过优化广告定向降低了每单成本。"},{"en":"If CPO is higher than profit per order, the campaign won’t be sustainable.","zh":"如果每单成本高于每单利润，这个活动就难以长期维持。"}]}],"synonyms":["Chief Product Officer","Chief Procurement Officer","Certified Pre-Owned","cost per order"],"phonetic":"/ˌsiː piː ˈoʊ/","extraExplanation":["“CPO”是缩写，在不同领域含义差异很大：科技/互联网公司里最常见的是 Chief Product Officer；制造业/供应链语境里常见 Chief Procurement Officer；汽车销售常把 Certified Pre-Owned 写成 CPO；电商或投放数据里则可能指 cost per order。阅读时最好结合行业、句子里的关键词（product/procurement/car/ads）来判断。"]}
{"word":"CPP","summary":{"en":"CPP most commonly refers to C++ (a programming language), but it can also mean a marketing metric (cost per purchase) or a security certification (Certified Protection Professional).","zh":"CPP 最常见指 C++（编程语言），也可能指营销指标“每次购买/转化成本”，或安保领域认证“Certified Protection Professional”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"C++: a widely used programming language (based on C) for building high-performance software such as operating systems, games, and embedded systems.","zh":"C++：一种广泛使用的编程语言（基于 C 语言），常用于开发高性能软件，如操作系统、游戏和嵌入式系统。"},"examples":[{"en":"He learned CPP/C++ to write faster programs for robotics.","zh":"他学习了 CPP/C++ 来为机器人编写更快的程序。"},{"en":"This game engine is written in C++ for performance.","zh":"这个游戏引擎用 C++ 编写以获得更好的性能。"}]},{"partOfSpeech":"n.","definition":{"en":"CPP: cost per purchase (or cost per conversion), a marketing metric meaning how much money you spend to get one purchase/conversion.","zh":"CPP：每次购买成本（或每次转化成本），一种营销指标，表示获得一次购买/转化所花的成本。"},"examples":[{"en":"Our CPP dropped after we improved the landing page.","zh":"我们优化落地页后，CPP 降低了。"},{"en":"The team tracks CPA and CPP to compare campaigns.","zh":"团队会跟踪 CPA 和 CPP 来对比不同广告活动。"}]},{"partOfSpeech":"n.","definition":{"en":"CPP: Certified Protection Professional, a professional certification in security management.","zh":"CPP：注册保护专业人士（Certified Protection Professional），安保/安全管理领域的一种专业认证。"},"examples":[{"en":"She earned her CPP credential to advance in security management.","zh":"她获得了 CPP 认证，以便在安全管理领域晋升。"}]}],"synonyms":["C++","C plus plus","cost per purchase (in marketing context)","Certified Protection Professional (in security context)"],"phonetic":"/ˌsiː plʌs ˈplʌs/","extraExplanation":["在日常交流里，“CPP”最常指编程语言 C++；很多人把 “C++”口语读作“see plus plus”。名字里的“++”来自编程中的自增运算符，暗示它是对 C 的“增强版”。","如果你是在广告/投放语境里看到 CPP，它往往指“每次购买/转化成本”。要看同一句话里是否出现 campaign、ads、conversion、ROAS 等词来判断。"]}
{"word":"CPR","summary":{"en":"CPR is an emergency lifesaving technique (and also the name of related training/certification).","zh":"CPR 指“心肺复苏”，也可指相关培训或证书。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"cardiopulmonary resuscitation: an emergency first-aid technique that uses chest compressions (and sometimes rescue breaths) to keep blood and oxygen moving when someone’s heart has stopped or they are not breathing normally.","zh":"心肺复苏：一种紧急急救技术，通过胸外按压（有时配合人工呼吸）在心跳骤停或呼吸不正常时维持血液循环与供氧。"},"examples":[{"en":"The lifeguard started CPR until the ambulance arrived.","zh":"救生员在救护车到达前开始进行心肺复苏。"},{"en":"Do you know how to do CPR?","zh":"你会做心肺复苏吗？"},{"en":"The instructor taught hands-only CPR (chest compressions only).","zh":"教练教了“徒手心肺复苏”（只做胸外按压）。"}]},{"partOfSpeech":"n.","definition":{"en":"a CPR class, training, or certification.","zh":"心肺复苏课程/培训/证书（口语中也常这样用）。"},"examples":[{"en":"I’m taking CPR next weekend.","zh":"我下周末要去上心肺复苏课。"},{"en":"Her CPR certification expires this year.","zh":"她的心肺复苏证书今年到期。"}]}],"synonyms":["cardiopulmonary resuscitation","resuscitation","hands-only CPR","chest compressions"],"phonetic":"/ˌsi pi ˈɑr/","extraExplanation":["“CPR”是缩写，字母逐个读：C-P-R。美式发音常读作 /ˌsi pi ˈɑr/（也可听到更慢的逐字母读法）。","在英语语境里常见搭配：do/perform CPR（实施心肺复苏）、start CPR（开始）、CPR training/class（培训/课程）、CPR certification（证书）。","实际急救中通常会先呼叫急救电话（美国常说 911），并根据培训指导进行按压；是否做人工呼吸会因场景与受训内容而不同（例如“hands-only CPR”更常用于公众培训）。"]}
{"word":"CPS","summary":{"en":"CPS is an abbreviation; most commonly it means Child Protective Services in the U.S., but it can also mean counts per second, clicks/characters per second, or cost per sale depending on context.","zh":"CPS是缩写；最常见指美国的儿童保护服务机构（Child Protective Services），也可能指每秒计数、每秒点击/字符，或每笔成交成本，需结合语境判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(U.S.) Child Protective Services: a government agency that investigates reports of child abuse or neglect and helps protect children.","zh":"（美国）儿童保护服务机构：负责调查儿童虐待或忽视举报，并采取措施保护儿童的政府部门。"},"examples":[{"en":"The school reported the situation to CPS.","zh":"学校把情况报告给了CPS。"},{"en":"CPS can arrange support services for families.","zh":"CPS可以为家庭安排支持性服务。"}]},{"partOfSpeech":"n.","definition":{"en":"Counts per second (science/engineering): the number of detected events or signals in one second.","zh":"每秒计数（科学/工程）：一秒内检测到的事件或信号数量。"},"examples":[{"en":"The detector reads 120 CPS under normal conditions.","zh":"在正常条件下，探测器读数为每秒120次（120 CPS）。"},{"en":"We measured CPS to compare signal strength.","zh":"我们通过测量CPS来比较信号强度。"}]},{"partOfSpeech":"n.","definition":{"en":"Clicks/characters per second (computing/gaming/typing): the number of clicks or typed characters in one second.","zh":"每秒点击/每秒字符（计算机/游戏/打字）：一秒内点击或输入的字符数量。"},"examples":[{"en":"My CPS goes up when I practice aim training.","zh":"我练习瞄准训练后，我的CPS会提高。"},{"en":"Her typing speed is about 6 CPS.","zh":"她的打字速度大约是每秒6个字符（6 CPS）。"}]},{"partOfSpeech":"n.","definition":{"en":"Cost per sale (marketing): the amount spent to generate one sale.","zh":"每笔成交成本（营销）：为了促成一笔成交所花费的成本。"},"examples":[{"en":"We lowered our CPS by improving ad targeting.","zh":"我们通过优化广告定向降低了CPS。"},{"en":"Track CPS alongside conversion rate.","zh":"把CPS与转化率一起跟踪。"}]}],"synonyms":["Child Protective Services (when used in that sense)","counts per second (when used in that sense)","cost per sale (when used in that sense)"],"phonetic":"/ˌsiː piː ˈɛs/","extraExplanation":["“CPS”是缩写，具体含义强烈依赖语境（政府社会服务、科研数据、游戏/打字速度、营销指标等）。在美国新闻或学校/家庭相关语境里，最常见的是“Child Protective Services（儿童保护服务）”。如果你告诉我句子或领域，我可以帮你确定最准确的意思。"]}
{"word":"CPSR","summary":{"en":"CPSR is an acronym most commonly meaning a government review of a contractor’s purchasing system, but in some contexts it can refer to a child-protection report/referral.","zh":"CPSR是缩写，最常见指政府对承包商采购体系的审查；在某些语境中也可能指与儿童保护相关的报告/转介。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(U.S. government contracting) Contractor Purchasing System Review: an official audit/review of a contractor’s purchasing system, often done by the U.S. government to check compliance and controls.","zh":"（美国政府承包/军工采购）承包商采购体系审查：政府对承包商采购制度与流程进行的正式审计/评估，用于检查合规性与内部控制。"},"examples":[{"en":"The company passed its CPSR and can now manage more subcontract purchases without extra approvals.","zh":"公司通过了CPSR，现在可以在不增加额外审批的情况下管理更多分包采购。"},{"en":"We’re preparing policies and files in advance of the CPSR.","zh":"我们正在为CPSR提前准备制度文件和采购档案。"}]},{"partOfSpeech":"other","definition":{"en":"(Social services, informal) Child Protective Services report/referral: a report made to child protection authorities about suspected child abuse or neglect (meaning varies by state/agency).","zh":"（社会服务/非正式用法）儿童保护服务报告/转介：向儿童保护机构提交的关于疑似虐待或忽视儿童的报告（具体含义因地区与机构而异）。"},"examples":[{"en":"The teacher filed a CPSR after noticing repeated unexplained injuries.","zh":"老师注意到多次无法解释的伤痕后提交了CPSR。"},{"en":"If you’re unsure, ask your supervisor what the CPSR process is in your area.","zh":"如果不确定，询问主管你所在地区的CPSR流程是什么。"}]}],"synonyms":["Contractor Purchasing System Review","purchasing system audit","child protection report","referral"],"phonetic":"/ˌsiː piː ɛs ˈɑr/","extraExplanation":["“CPSR”是缩写，在不同领域含义差异很大。最常见的专业用法之一是美国政府合同领域的“Contractor Purchasing System Review”。在社会服务语境里，有些人会用它指与儿童保护相关的报告/转介，但各州、各机构的正式名称不一定叫CPSR。","如果你能告诉我你看到CPSR的句子、行业（如军工采购/教育/社工/医疗等）或国家地区，我可以给出更准确的释义与用法。"]}
{"word":"CPSU","summary":{"en":"CPSU most commonly means the Communist Party of the Soviet Union.","zh":"CPSU 最常见的意思是“苏联共产党”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Communist Party of the Soviet Union, the ruling political party of the USSR from 1917 to 1991","zh":"苏联共产党（CPSU），1917—1991年间统治苏联（USSR）的执政党"},"examples":[{"en":"After Stalin’s death, the CPSU began a period of political change.","zh":"斯大林去世后，苏共（CPSU）开始进入一段政治变革时期。"},{"en":"In many history books, the CPSU is described as the center of Soviet power.","zh":"在许多历史书中，苏共（CPSU）被描述为苏联权力的核心。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare/technical) central processing and storage unit; sometimes used to describe a computer system’s main processing and memory/storage components","zh":"（较少见/技术用法）中央处理与存储单元；有时用来指计算机系统的主要处理与存储（内存/存储）部分"},"examples":[{"en":"This manual uses CPSU to refer to the central processing and storage unit of the device.","zh":"这本手册用 CPSU 来指该设备的中央处理与存储单元。"}]}],"synonyms":["Communist Party of the Soviet Union","Soviet Communist Party","the Soviet Party"],"phonetic":"ˌsiː piː ɛs ˈjuː","extraExplanation":["在英语里，CPSU 最常见的含义几乎总是“Communist Party of the Soviet Union（苏联共产党）”。阅读历史、政治类文章时如果看到 CPSU，通常不需要猜其他意思。","发音多为逐个字母读（C-P-S-U）。常见相关缩写：USSR（苏联）、KGB（苏联国家安全机构）。"]}
{"word":"CPT","summary":{"en":"CPT is an abbreviation most commonly meaning a U.S. medical billing code set (Current Procedural Terminology) or an international shipping term (Carriage Paid To).","zh":"CPT是缩写，最常见指美国医疗收费编码（Current Procedural Terminology）或国际贸易术语“运费付至”（Carriage Paid To）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(medicine, U.S.) Current Procedural Terminology: a standardized set of codes used to describe medical services and procedures for billing and insurance.","zh":"（美国医疗）CPT（Current Procedural Terminology，现行医疗服务项目代码）：用于描述医疗服务与操作的标准化编码体系，常用于收费与保险理赔。"},"examples":[{"en":"The clinic billed the visit using a CPT code for an office consultation.","zh":"诊所用“门诊咨询”的CPT代码为这次就诊开账单。"},{"en":"Insurance may deny the claim if the CPT code is incorrect.","zh":"如果CPT代码不正确，保险可能会拒赔这笔申请。"}]},{"partOfSpeech":"other","definition":{"en":"(shipping & trade) Carriage Paid To: an Incoterm meaning the seller pays transport costs to the named destination, while risk transfers to the buyer when goods are handed to the carrier.","zh":"（国际贸易/物流）CPT（Carriage Paid To，运费付至）：一种国际贸易术语，卖方负责支付运费至指定目的地，但货物交给承运人后风险转移给买方。"},"examples":[{"en":"We agreed on CPT Los Angeles, so the seller pays the freight to Los Angeles.","zh":"我们约定CPT洛杉矶，因此卖方支付运费到洛杉矶。"},{"en":"Under CPT terms, risk transfers once the goods are delivered to the carrier.","zh":"在CPT条款下，货物交给承运人后风险就转移了。"}]},{"partOfSpeech":"other","definition":{"en":"(education) Common Proficiency Test: a general name for a standardized language/skills test used by some schools or programs.","zh":"（教育）CPT（Common Proficiency Test，常见能力/熟练度测验）：一些学校或项目对标准化能力测试的统称。"},"examples":[{"en":"Applicants must pass the CPT before enrolling in the advanced course.","zh":"申请者必须通过CPT才能进入高级课程。"},{"en":"Her CPT score met the program’s minimum requirement.","zh":"她的CPT成绩达到了项目的最低要求。"}]}],"synonyms":["Current Procedural Terminology","Carriage Paid To","CPT code"],"phonetic":"/ˌsiː piː ˈtiː/","extraExplanation":["“CPT”是缩写，含义高度依赖领域。最常见的两种是：美国医疗账单里的CPT代码，以及国际贸易术语Incoterms里的CPT（Carriage Paid To）。","如果你是在医院账单、保险理赔单、或医生诊所收据上看到“CPT”，几乎一定指医疗编码；如果是在合同、报关或运输条款里看到，则多半指贸易术语。你可以告诉我看到它的句子/场景，我可以帮你确定具体意思。"]}
{"word":"CPU","summary":{"en":"CPU usually means “central processing unit,” the main processor that runs a computer; it can also be used figuratively as the “brain” of a system.","zh":"CPU 通常指“中央处理器”，是运行计算机的核心处理器；也可作比喻，表示某个系统的“大脑/控制中心”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"central processing unit: the main part of a computer that executes instructions and performs calculations (often called the “processor”).","zh":"中央处理器：计算机中执行指令、进行运算的核心部件（常称“处理器”）。"},"examples":[{"en":"My laptop’s CPU is fast enough for video editing.","zh":"我笔记本的 CPU 速度够快，可以用来剪视频。"},{"en":"This program uses a lot of CPU, so the fan gets loud.","zh":"这个程序很吃 CPU，所以风扇会很吵。"},{"en":"The CPU works with memory (RAM) to run applications.","zh":"CPU 会和内存（RAM）一起协作来运行应用程序。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative, informal) the “brain” or control center of a system or organization.","zh":"（比喻、非正式）某个系统或组织的“大脑”、控制中心。"},"examples":[{"en":"In this setup, the main server acts like the CPU of the whole network.","zh":"在这个架构里，主服务器就像整个网络的 CPU。"},{"en":"She’s basically the CPU of the team—she coordinates everything.","zh":"她基本就是团队的“CPU”——负责统筹所有事情。"}]}],"synonyms":["central processing unit","processor","microprocessor (more technical)"],"phonetic":"/ˌsiː piː ˈjuː/","extraExplanation":["CPU 是缩写（initialism），通常逐字母读作 “C-P-U”。常见搭配：CPU usage（CPU 使用率）、CPU temperature（CPU 温度）、CPU-intensive（吃 CPU 的/CPU 密集型的）。","日常口语中，人们也会说 “processor” 指代 CPU；在购买电脑时常看到 Intel/AMD 等品牌和型号（如 i5、Ryzen 5）来区分性能档次。"]}
{"word":"cpus","summary":{"en":"“CPUs” means more than one CPU (central processing unit), the computer’s main processor chip.","zh":"“CPUs”指多个 CPU（中央处理器），也就是计算机的主要处理器芯片。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of CPU: central processing units; the main chips in computers that execute instructions and coordinate other hardware.","zh":"CPU 的复数：中央处理器；计算机中负责执行指令并协调其他硬件工作的核心芯片。"},"examples":[{"en":"This server has 2 CPUs and 64 GB of RAM.","zh":"这台服务器有 2 颗 CPU 和 64GB 内存。"},{"en":"Modern phones use CPUs designed to save power.","zh":"现代手机使用为省电而设计的 CPU。"}]}],"synonyms":["processors","central processing units"],"phonetic":"/ˌsiː piː ˈjuːz/","extraExplanation":["“CPU”是缩写（central processing unit）。写作“CPUs”是最常见的复数形式；也有人写作“CPU’s”，但那通常表示所有格（例如：the CPU’s speed = CPU 的速度），不建议用来表示复数。","口语里有时会把“CPU”泛指“处理器/芯片”，但严格说还会区分 CPU、GPU（图形处理器）等。"]}
{"word":"cputime","summary":{"en":"CPU time is the time the CPU actually spends running a program’s instructions.","zh":"CPU 时间指 CPU 实际用于执行程序指令的时间。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The amount of time a computer’s CPU (central processing unit) spends actively executing a program’s instructions (not including time waiting for input/output or sleeping).","zh":"CPU 时间：计算机的 CPU（中央处理器）实际用于执行某个程序指令的时间（通常不包括等待 I/O、睡眠等非执行时间）。"},"examples":[{"en":"The program looks slow, but its CPU time is low because it waits for the database.","zh":"这个程序看起来很慢，但它的 CPU 时间很低，因为它一直在等待数据库返回结果。"},{"en":"We reduced CPU time by optimizing the loop.","zh":"我们通过优化循环减少了 CPU 时间。"},{"en":"The job was killed after it exceeded the CPU time limit.","zh":"该任务因为超过 CPU 时间限制而被终止。"}]}],"synonyms":["processor time","compute time","CPU usage time"],"phonetic":"/ˈsiː piː juː taɪm/","extraExplanation":["在性能分析里，CPU time 常与 wall-clock time（实际经过时间/“钟表时间”）对比：wall-clock time 包含等待磁盘/网络/锁等时间，而 CPU time 更接近“纯计算”开销。","很多系统会区分 user CPU time（用户态执行时间）与 system CPU time（内核态执行时间）。在竞赛或服务器配额中，CPU time limit 指允许使用的 CPU 计算时间上限。","写法上更常见的是 “CPU time”（两个词），但在日志、变量名或命令输出里也常见 cputime / cpu_time 这样的形式。"]}
{"word":"CPW","summary":{"en":"CPW is an abbreviation most commonly meaning Colorado Parks and Wildlife, or cost per wear in fashion contexts.","zh":"CPW 是一个缩写，最常见指科罗拉多州公园与野生动物局，或在穿搭语境中指“每次穿着成本”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbr.) Colorado Parks and Wildlife, the state agency that manages wildlife, state parks, hunting and fishing in Colorado.","zh":"（缩写）科罗拉多州公园与野生动物局：负责科罗拉多州野生动物与州立公园管理，以及狩猎、钓鱼等事务的政府机构。"},"examples":[{"en":"CPW issued new fishing regulations for this season.","zh":"CPW 发布了本季新的钓鱼规定。"},{"en":"You can buy a hunting license through CPW’s website.","zh":"你可以通过 CPW 官网购买狩猎许可证。"}]},{"partOfSpeech":"n.","definition":{"en":"(abbr.) cost per wear: a way to calculate how much each use of a clothing item effectively costs (price ÷ number of times worn).","zh":"（缩写）每次穿着成本：用来计算一件衣服平均每穿一次相当于花了多少钱（价格 ÷ 穿着次数）。"},"examples":[{"en":"That coat was expensive, but the CPW is low because I wear it all winter.","zh":"那件外套很贵，但因为我整个冬天都穿，所以每次穿着成本（CPW）很低。"},{"en":"I compare CPW when deciding between two pairs of shoes.","zh":"在两双鞋之间做选择时，我会比较 CPW（每次穿着成本）。"}]},{"partOfSpeech":"n.","definition":{"en":"(abbr.) completed prisoner’s work: a UK/Irish prison term for work done by prisoners (often stamped on items).","zh":"（缩写）囚犯完成的劳动：英/爱地区监狱用语，指由囚犯完成的工作（常见于物品印章/标记）。"},"examples":[{"en":"The old box had a CPW stamp on the bottom.","zh":"这个旧盒子底部有一个 CPW 的印章。"},{"en":"In some records, CPW marked items made in prison workshops.","zh":"在一些记录里，CPW 用来标记由监狱工坊制作的物品。"}]}],"phonetic":"/ˌsiː piː ˈdʌbəl.juː/","extraExplanation":["“CPW”是缩写，含义高度依赖语境：如果在美国科罗拉多州的户外/许可证/公园信息里，通常指 Colorado Parks and Wildlife；在时尚穿搭、理性消费或二手平台讨论里，常指 cost per wear。","如果你告诉我它出现的场景（例如一封邮件、地图、账单、社交媒体或衣物标签），我可以帮你确定最可能的意思。"]}
