{"word":"CQ","summary":{"en":"“CQ” most commonly means an open radio call (“calling any station”) in ham radio; it can also mean “Charge of Quarters” (a duty shift), and more rarely “congratulations” online.","zh":"“CQ”最常见指火腿无线电的通用呼叫“呼叫任意电台”；也可指军队等的值班岗位/班次（Charge of Quarters）；更少见作网络“congratulations（恭喜）”缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An international radio call meaning “calling any station,” used especially by amateur (ham) radio operators to invite anyone to reply.","zh":"（无线电呼叫）“呼叫任意电台/呼叫所有电台”，常见于业余（火腿）无线电，用来邀请任何人回应。"},"examples":[{"en":"CQ CQ CQ, this is K1ABC calling and standing by.","zh":"CQ CQ CQ，我是 K1ABC 呼叫，等待应答。"},{"en":"He called CQ on 20 meters but didn’t get a reply.","zh":"他在 20 米波段呼叫 CQ，但没有收到回应。"}]},{"partOfSpeech":"other","definition":{"en":"Charge of Quarters: a duty shift (often in the military) where someone is responsible for monitoring a barracks/dorm area, answering calls, and handling issues.","zh":"（军队等）值更/值班（Charge of Quarters）：负责看管营区/宿舍、接电话并处理突发情况的值班岗位或班次。"},"examples":[{"en":"I have CQ tonight, so I can’t go out.","zh":"我今晚要值 CQ，所以不能出去。"},{"en":"Report to CQ if there’s an emergency after lights out.","zh":"熄灯后如果有紧急情况，就去找 CQ 值班员。"}]},{"partOfSpeech":"other","definition":{"en":"A casual abbreviation for “congratulations” in some online/chat contexts (less common).","zh":"在部分网络聊天中作“congratulations（恭喜）”的缩写（不太常见）。"},"examples":[{"en":"CQ on your new job!","zh":"恭喜你拿到新工作！"}]}],"synonyms":["open call (radio)","general call (radio)"],"phonetic":"/si kju/","extraExplanation":["无线电里的“CQ”最常见：它最早来自电报时代的通用呼叫信号，后来沿用到语音/数字通信里，意思相当于“有人在吗？任何台都可以回答”。","军队语境里的 CQ（Charge of Quarters）主要见于美军等英语环境，口语里会说“have CQ / on CQ”，表示“轮到我值班”。"]}
{"word":"cq","summary":{"en":"CQ is most commonly a ham-radio general call meaning “calling any station.”","zh":"CQ 最常见用法是火腿无线电里的通用呼叫，表示“呼叫任何电台/有谁在吗”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A general call in amateur (ham) radio meaning “calling any station” or “is anyone there?”","zh":"业余（火腿）无线电中的通用呼叫，意思是“呼叫所有台/有谁在吗？”"},"examples":[{"en":"CQ CQ CQ, this is K1ABC calling.","zh":"CQ CQ CQ，这里是 K1ABC 呼叫。"},{"en":"He called CQ to see if any stations were listening.","zh":"他呼叫 CQ，看看有没有电台在收听。"}]},{"partOfSpeech":"other","definition":{"en":"The title of a well-known amateur radio magazine, CQ (as in CQ Magazine).","zh":"一本知名业余无线电杂志的名称《CQ》（如 CQ Magazine）。"},"examples":[{"en":"She learned a lot from articles in CQ.","zh":"她从《CQ》杂志的文章中学到了很多。"}]}],"synonyms":["general call (radio)","calling all stations"],"phonetic":"/siː kjuː/","extraExplanation":["“CQ”最早来自电报通信中的通用呼叫代码，意思接近“呼叫所有电台/任何电台请回答”。在业余无线电里常听到“CQ CQ CQ, this is [呼号] calling”。","书写上常用大写“CQ”。在无线电语境之外，“CQ”也可能是不同领域的缩写（例如公司/文件缩写），需要结合上下文判断。"]}
{"word":"CQED","summary":{"en":"CQED most often refers to circuit quantum electrodynamics (cQED), and less commonly to cavity quantum electrodynamics.","zh":"CQED 通常指电路量子电动力学（cQED），较少情况下指腔量子电动力学。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for circuit quantum electrodynamics: a field of quantum physics that studies how superconducting electrical circuits interact with single photons (microwave light), often used in quantum computing research.","zh":"“电路量子电动力学”的缩写：量子物理中的一个领域，研究超导电路与单个光子（常为微波光）如何相互作用，常用于量子计算研究。"},"examples":[{"en":"Our lab uses cQED to couple a superconducting qubit to a microwave resonator.","zh":"我们实验室用 cQED 把超导量子比特与微波谐振腔耦合起来。"},{"en":"Many modern quantum processors are built on cQED architectures.","zh":"许多现代量子处理器都基于 cQED 架构。"}]},{"partOfSpeech":"other","definition":{"en":"less commonly, an abbreviation for cavity quantum electrodynamics: the study of how atoms (or qubits) interact with light inside an optical or microwave cavity.","zh":"较少见地，也可指“腔量子电动力学”的缩写：研究原子（或量子比特）在光学/微波腔内与光相互作用的领域。"},"examples":[{"en":"The paper compares cavity QED experiments with cQED systems on a chip.","zh":"这篇论文比较了腔 QED 实验与芯片上的 cQED 系统。"},{"en":"In cavity QED, the cavity enhances the interaction between light and matter.","zh":"在腔 QED 中，腔体会增强光与物质的相互作用。"}]}],"synonyms":["cQED","circuit QED","cavity QED","quantum electrodynamics (QED)"],"phonetic":"/ˌsiː kjuː iː ˈdiː/","extraExplanation":["在学术写作里更常见的写法是 **cQED**（小写 c + 大写 QED），用来强调是“circuit（电路）”QED；而 **cavity QED**（腔 QED）通常直接写全称或写作 cavity QED。单独写 **CQED** 容易产生歧义，最好根据上下文确认具体指哪一个。"]}

