{"word":"CRL","summary":{"en":"CRL is an abbreviation most commonly meaning Certificate Revocation List (cybersecurity) or Crown-rump length (pregnancy ultrasound), depending on context.","zh":"CRL是缩写，最常见含义是“证书吊销列表”（网络安全）或“头臀长”（产科超声），具体看语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Certificate Revocation List: a list published by a certificate authority (CA) that shows which digital certificates have been canceled before their expiration date.","zh":"（网络安全）证书吊销列表：由证书颁发机构（CA）发布的名单，用来列出哪些数字证书在到期前已被撤销/吊销。"},"examples":[{"en":"The browser checked the CRL to see whether the website’s certificate had been revoked.","zh":"浏览器会检查CRL，看网站的证书是否已被吊销。"},{"en":"If the CRL can’t be reached, some systems may block the connection for security reasons.","zh":"如果无法访问CRL，一些系统出于安全原因可能会阻止连接。"}]},{"partOfSpeech":"n.","definition":{"en":"Crown-rump length: a measurement of a fetus from the top of the head (crown) to the bottom of the torso (rump), often used in early pregnancy ultrasound dating.","zh":"（医学/产科）头臀长：从胎儿头顶部到臀部的长度测量，常用于早孕期超声评估孕周。"},"examples":[{"en":"The doctor estimated the pregnancy date based on the CRL.","zh":"医生根据CRL来估算孕周。"},{"en":"A small change in CRL can affect the estimated due date.","zh":"CRL的细微变化可能会影响预产期的估算。"}]},{"partOfSpeech":"n.","definition":{"en":"Carriage return and line feed: a control-character combination that marks a new line in some text systems.","zh":"（计算机）回车+换行：在一些文本系统中用于表示换行的一组控制字符。"},"examples":[{"en":"Windows text files often use CRL (more commonly written as CRLF) for line breaks.","zh":"Windows文本文件的换行常用CRL（更常写作CRLF）。"}]}],"synonyms":["revocation list (for Certificate Revocation List)","CRLF (for carriage return + line feed, related)"],"phonetic":"/ˌsiː ɑːr ˈɛl/","extraExplanation":["CRL最常见是两个领域：网络安全（Certificate Revocation List）和产科超声（Crown-rump length）。看到CRL具体指哪个，通常要看上下文：如果和证书、浏览器、TLS/SSL、CA一起出现，多半是“证书吊销列表”；如果和孕周、超声、胎儿测量一起出现，多半是“头臀长”。","在计算机文本里，更标准的写法通常是“CRLF”（carriage return + line feed），所以如果你看到的是CRL，可能是简写、笔误或特定系统/文档的写法。"]}
{"word":"crl","summary":{"en":"CRL most commonly means “Certificate Revocation List” in cybersecurity; it can also mean “Center for Research Libraries.”","zh":"CRL最常见指网络安全中的“证书吊销列表”，也可指“研究图书馆中心”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) Certificate Revocation List: a list published by a Certificate Authority that shows which digital certificates are no longer trusted (revoked) before they expire.","zh":"（缩写）证书吊销列表：由证书颁发机构发布的列表，列出在到期前已被吊销、因此不再可信的数字证书。"},"examples":[{"en":"Our browser checks the CRL to see whether the website’s certificate has been revoked.","zh":"我们的浏览器会检查 CRL，看看该网站的证书是否已被吊销。"},{"en":"If the CRL can’t be reached, some systems may fail the secure connection.","zh":"如果无法访问 CRL，一些系统可能会让安全连接失败。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev.) Center for Research Libraries: a U.S.-based nonprofit that supports libraries by sharing research materials and services.","zh":"（缩写）研究图书馆中心：美国的非营利机构，通过共享馆藏与服务来支持各类图书馆的研究需求。"},"examples":[{"en":"The university library uses CRL resources for hard-to-find international newspapers.","zh":"大学图书馆会使用 CRL 的资源来获取不易找到的国际报纸。"},{"en":"You can request the item through CRL via interlibrary loan.","zh":"你可以通过馆际互借向 CRL 申请借阅该资料。"}]}],"synonyms":["certificate revocation list (full form)","CRL list (informal)"],"phonetic":"/ˌsiː ɑːr ˈɛl/","extraExplanation":["“CRL”通常不是一个普通单词，而是首字母缩写。最常见的是网络安全里的 Certificate Revocation List，常与“CA（证书颁发机构）”“SSL/TLS（加密连接）”一起出现。","读法一般按字母读：C-R-L。在技术文档里也常见与“OCSP（在线证书状态协议）”对比：OCSP是在线查询单个证书状态，CRL是下载一份被吊销证书的列表。"]}
{"word":"CRLF","summary":{"en":"CRLF is a two-character newline (carriage return + line feed), common in Windows and many network protocols.","zh":"CRLF 是由回车+换行组成的两字符换行符，常见于 Windows 和许多网络协议。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(computing) An end-of-line marker made of two characters: carriage return (CR) followed by line feed (LF), widely used in Windows text files and many internet protocols.","zh":"（计算机）由两个字符组成的行结束标记：回车（CR）+ 换行（LF），常见于 Windows 文本文件以及许多网络协议。"},"examples":[{"en":"On Windows, many text files use CRLF for line breaks.","zh":"在 Windows 上，很多文本文件用 CRLF 来换行。"},{"en":"This server expects CRLF at the end of each command.","zh":"这个服务器要求每条命令末尾必须是 CRLF。"},{"en":"Convert CRLF to LF before running the script on Linux.","zh":"在 Linux 上运行脚本前，把 CRLF 转换成 LF。"}]}],"synonyms":["newline","line break","end-of-line (EOL)","CR+LF"],"phonetic":"/ˌsiː ɑr ɛl ˈɛf/","extraExplanation":["CRLF 是两个控制字符的组合：CR（Carriage Return）和 LF（Line Feed）。在 ASCII 里，CR 常对应十进制 13（\\r），LF 常对应十进制 10（\\n）。","不同系统的换行约定不同：Windows 常用 CRLF；Linux/Unix 多用 LF；老式 Mac（OS 9 及更早）常用 CR。","在 Git、编辑器或终端里，如果出现“^M”或格式错乱，常见原因之一就是 CRLF/LF 不一致；通常可以通过设置“行尾格式（EOL）”或启用自动转换来解决。"]}
