{"word":"CRP","summary":{"en":"CRP usually means C-reactive protein, a blood marker that rises with inflammation or infection.","zh":"CRP通常指C反应蛋白，是在炎症或感染时会升高的血液指标。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"C-reactive protein: a substance made by the liver that rises in the blood when there is inflammation or infection. It is often measured in a blood test (CRP test).","zh":"C反应蛋白：由肝脏产生的一种物质，当身体出现炎症或感染时，血液中的水平会升高。常通过血液检查（CRP检测）来测量。"},"examples":[{"en":"The doctor ordered a CRP test to check for inflammation.","zh":"医生开了CRP检查来判断是否有炎症。"},{"en":"Her CRP level was high, so they looked for an infection.","zh":"她的CRP数值偏高，所以医生进一步寻找感染原因。"},{"en":"After treatment, his CRP dropped back to normal.","zh":"治疗后，他的CRP下降并恢复到正常范围。"}]}],"synonyms":["C-reactive protein","inflammation marker","CRP test"],"phonetic":"/ˌsiː ɑr ˈpiː/","extraExplanation":["CRP在医疗语境里非常常见，通常写在化验单上。它是“炎症指标”，但不指向某一种特定疾病：升高可能来自细菌/病毒感染、免疫性疾病、外伤/手术后、某些慢性炎症等，需要结合症状与其他检查一起判断。","你也可能看到“hs-CRP（高敏CRP）”，多用于评估心血管风险（在没有明显感染时的低水平炎症）。不同实验室参考范围可能不同，解读时以医生和本院标准为准。","读法通常按字母念：C-R-P。写作中首次出现时常写全称 C-reactive protein (CRP)。"]}
{"word":"crpe","summary":{"en":"Crepe (crêpe) most commonly means a thin French pancake; it can also mean a thin, slightly crinkled fabric.","zh":"crepe（也写作 crêpe）最常指法式薄煎饼；也可指一种轻薄、略起皱的布料（绉纱）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very thin French-style pancake, often filled with sweet or savory ingredients","zh":"（法式）可丽饼；一种很薄的煎饼，常包甜或咸的馅料"},"examples":[{"en":"I ordered a crepe with strawberries and whipped cream.","zh":"我点了一份草莓加奶油的可丽饼。"},{"en":"They make savory crepes with ham and cheese.","zh":"他们会做火腿奶酪咸味可丽饼。"}]},{"partOfSpeech":"n.","definition":{"en":"a light, thin cloth with a slightly rough, crinkled surface, used for clothing or decorations","zh":"绉纱；一种轻薄、表面略起皱的布料，用于服装或装饰"},"examples":[{"en":"She wore a black crepe dress to the memorial.","zh":"她在追思仪式上穿了一件黑色绉纱连衣裙。"},{"en":"The curtains are made of soft crepe fabric.","zh":"窗帘是用柔软的绉纱布做的。"}]}],"synonyms":["crêpe","thin pancake","(fabric) crinkled cloth"],"phonetic":"/kreɪp/","extraExplanation":["“crepe”也常写作带重音符号的法语形式“crêpe”，在英语里两者都常见，读音相同。","注意不要和“crap”（粗口：糟糕的东西）混淆；拼写和含义完全不同。","在部分语境里，丧葬相关的“黑绉纱（black crepe）”有哀悼含义，属于较传统的用法。"]}
