{"word":"CRS","summary":{"en":"CRS is an initialism with multiple meanings; the most common are Common Reporting Standard (tax reporting), Congressional Research Service (U.S. Congress research), and Cytokine Release Syndrome (medical).","zh":"CRS 是一个多义缩写；最常见的含义包括共同申报准则（税务申报）、美国国会研究处（政策研究）和细胞因子释放综合征（医学）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for several different things; the exact meaning depends on context (finance, government, medicine, etc.)","zh":"缩写，可代表多种含义；具体指什么取决于语境（金融、政府、医学等）"},"examples":[{"en":"What does CRS stand for in this document?","zh":"这份文件里的 CRS 代表什么？"},{"en":"CRS can mean different things in different fields, so please clarify the context.","zh":"CRS 在不同领域可能含义不同，请说明语境。"}]},{"partOfSpeech":"other","definition":{"en":"Common Reporting Standard: an international tax-information reporting system used to help countries share financial account information","zh":"共同申报准则：一种国际税务信息申报与交换标准，用于各国之间共享金融账户信息"},"examples":[{"en":"Many banks ask customers for CRS self-certification forms.","zh":"很多银行会要求客户填写 CRS 税务居民自我证明表。"},{"en":"Under CRS, financial institutions may report account details to tax authorities.","zh":"在 CRS 之下，金融机构可能会向税务机关申报账户信息。"}]},{"partOfSpeech":"other","definition":{"en":"Congressional Research Service: a U.S. government agency that provides nonpartisan research and analysis to Congress","zh":"美国国会研究处：为美国国会提供无党派研究与分析的政府机构"},"examples":[{"en":"The CRS published a report summarizing the policy options.","zh":"CRS 发布了一份报告，总结了政策选项。"},{"en":"Members of Congress often request CRS analysis before votes.","zh":"国会议员在投票前常会请求 CRS 提供分析。"}]},{"partOfSpeech":"other","definition":{"en":"Cytokine Release Syndrome: a potentially serious immune reaction, sometimes a side effect of certain cancer immunotherapies","zh":"细胞因子释放综合征：一种可能较严重的免疫反应，有时是某些癌症免疫疗法的副作用"},"examples":[{"en":"Doctors monitor patients closely for CRS after CAR T-cell therapy.","zh":"在 CAR-T 细胞治疗后，医生会密切监测患者是否出现 CRS。"},{"en":"Fever and low blood pressure can be signs of CRS.","zh":"发热和低血压可能是 CRS 的表现。"}]},{"partOfSpeech":"other","definition":{"en":"Course: sometimes used as a short form in school schedules (less formal)","zh":"课程：有时在学校课表里用作简写（较不正式）"},"examples":[{"en":"CRS: Intro to Biology (Mon/Wed).","zh":"CRS：生物导论（周一/周三）。"}]}],"synonyms":["initialism","abbreviation"],"phonetic":"/si ɑr ɛs/","extraExplanation":["在邮件、表格或报告里看到“CRS”，最常见的两类语境是：金融合规（Common Reporting Standard，银行要你填写税务居民信息）和美国公共政策（Congressional Research Service，美国国会研究处的报告）。医学语境下的 CRS（Cytokine Release Syndrome）也很常见，尤其在 CAR-T 等免疫治疗相关材料里。若你把包含 CRS 的整句话/截图发来，我可以帮你确定最准确的含义。"]}
{"word":"crs","summary":{"en":"CRS is usually read as the letters “C-R-S” and most often means “course” in school contexts, but it can also stand for several different terms in finance, charities, or medicine.","zh":"CRS通常按字母读作“C-R-S”。在学校语境里常指“课程”，但在金融、慈善或医疗等领域也可能代表不同术语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “course,” especially in school schedules, catalogs, or timetables.","zh":"“course（课程）”的缩写，常见于课表、课程目录或时间表。"},"examples":[{"en":"CRS 101 meets on Mondays and Wednesdays.","zh":"CRS 101（课程101）在周一和周三上课。"},{"en":"Check the CRS list before you register.","zh":"选课前先查看课程（CRS）列表。"}]},{"partOfSpeech":"other","definition":{"en":"an acronym used for several different terms depending on the field (common ones include “Common Reporting Standard,” “Catholic Relief Services,” and “chronic rhinosinusitis”).","zh":"在不同领域代表不同含义的首字母缩略词（常见如“共同申报准则”“天主教救济服务会”“慢性鼻-鼻窦炎”等）。"},"examples":[{"en":"Banks may collect tax information under CRS (Common Reporting Standard).","zh":"银行可能会根据CRS（共同申报准则）收集税务信息。"},{"en":"She volunteers with CRS (Catholic Relief Services).","zh":"她在CRS（天主教救济服务会）做志愿者。"},{"en":"The doctor diagnosed him with CRS (chronic rhinosinusitis).","zh":"医生诊断他患有CRS（慢性鼻-鼻窦炎）。"}]}],"synonyms":["course (as an abbreviation)","acronym"],"phonetic":"/ˌsiː ɑːr ˈɛs/","extraExplanation":["“CRS”非常依赖语境：在学校最常见是“course/课程”的缩写；在金融与税务语境里常指Common Reporting Standard；在医疗语境里可能指chronic rhinosinusitis。你可以告诉我你看到“crs”的句子或场景，我可以帮你确定最可能的意思。"]}
{"word":"CRSAB","summary":{"en":"“CRSAB” is an initialism with meaning that depends on context; it is not a common fixed English word.","zh":"“CRSAB”是一个首字母缩略词，含义取决于语境，并非英语中常见的固定词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation/initialism. “CRSAB” is not a widely standardized English word, and its meaning depends on the specific field (e.g., a company name, school program, technical term).","zh":"一个缩写/首字母缩略词。“CRSAB”并不是英语里广泛通用、固定含义的词，它的意思通常取决于具体领域（例如公司名、学校项目、技术术语等）。"},"examples":[{"en":"What does CRSAB stand for in this document?","zh":"在这份文件里，CRSAB代表什么？"},{"en":"I saw “CRSAB” in the email, but there was no explanation.","zh":"我在邮件里看到“CRSAB”，但没有任何解释。"}]}],"synonyms":["acronym","initialism","abbreviation"],"phonetic":"/ˌsiː ɑːr ˌɛs eɪ ˈbiː/","extraExplanation":["缩写词在不同场景可能完全不同含义。为了准确解释，请告诉我它出现的上下文（例如：哪一行业/哪句话/哪份文件、是否与学校/医疗/工程/公司有关）。我也可以根据你提供的一整句来推断最可能的释义。"]}
