{"word":"CRT","summary":{"en":"CRT is an abbreviation most commonly meaning either “cathode-ray tube” (old TV/monitor technology) or “Critical Race Theory” (an academic framework about race and law); it can also mean other things in specialized contexts.","zh":"CRT 是一个缩写，最常见指“阴极射线管”（老式电视/显示器技术）或“批判性种族理论”（研究种族与法律的学术框架）；在特定领域也可能有其他含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"cathode-ray tube: an older type of television/monitor screen that uses electron beams inside a glass tube to create images.","zh":"阴极射线管：一种较早的电视/显示器屏幕技术，通过玻璃管内的电子束成像。"},"examples":[{"en":"My grandparents still had a heavy CRT TV in the living room.","zh":"我祖父母客厅里以前还有一台很重的阴极射线管电视。"},{"en":"CRT monitors were common before flat-screen LCDs became popular.","zh":"在平板液晶屏普及之前，CRT 显示器很常见。"}]},{"partOfSpeech":"n.","definition":{"en":"Critical Race Theory: an academic approach that examines how laws and social institutions can produce and maintain racial inequality.","zh":"批判性种族理论：一种学术研究取向，探讨法律与社会制度如何造成并延续种族不平等。"},"examples":[{"en":"In the seminar, we read articles related to CRT and civil rights law.","zh":"在研讨课上，我们阅读了与 CRT 和民权法相关的文章。"},{"en":"The school board debated what “CRT” means and whether it belongs in the curriculum.","zh":"学区委员会讨论了“CRT”的含义，以及它是否应纳入课程。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a job title or credential in healthcare, such as Certified Respiratory Therapist (meaning depends on the country/organization).","zh":"（较少见）医疗领域的职位或证书缩写，例如“认证呼吸治疗师”（具体含义因国家/机构而异）。"},"examples":[{"en":"The hospital listed “CRT” as a preferred qualification for the respiratory therapy role.","zh":"医院在呼吸治疗岗位招聘中把“CRT”列为优先资格。"}]}],"synonyms":["cathode-ray tube","picture tube","tube TV","Critical Race Theory"],"phonetic":"/ˌsiː ɑːr ˈtiː/","extraExplanation":["同一个缩写“CRT”在不同语境里意思差别很大：科技/怀旧电子产品里通常指“阴极射线管”；在美国公共讨论与教育政策语境里常被用来指“批判性种族理论”，但媒体或政治话语有时会把它泛化成“任何与种族/历史相关的教学内容”，因此理解时要看具体说话场景。","口语里读缩写时通常逐个字母读：C-R-T。写作时第一次出现最好把全称拼出来（cathode-ray tube / Critical Race Theory），避免误解。"]}
{"word":"CRTC","summary":{"en":"CRTC most commonly means Canada’s federal communications regulator (broadcasting and telecom).","zh":"CRTC 最常见指加拿大联邦通信监管机构（广播与电信）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Canada) The Canadian Radio-television and Telecommunications Commission: the federal agency that regulates broadcasting (TV/radio) and telecommunications (phone/internet) in Canada.","zh":"（加拿大）加拿大广播电视和电信委员会：负责监管加拿大广播（电视/广播）与电信（电话/互联网）等领域的联邦机构。"},"examples":[{"en":"The CRTC requires some streaming services to contribute to Canadian content.","zh":"CRTC 要求一些流媒体服务为加拿大本土内容（Canadian content）做出贡献。"},{"en":"The company filed a complaint with the CRTC about telecom billing practices.","zh":"该公司就电信计费做法向 CRTC 提出了投诉。"}]},{"partOfSpeech":"other","definition":{"en":"(General) An acronym that may refer to different things in specialized fields (for example, tech or education), depending on the context.","zh":"（泛指）在不同专业领域中可能代表不同含义的缩写，具体含义取决于语境（如科技或教育领域）。"},"examples":[{"en":"In this report, CRTC refers to the Canadian regulator, not a classroom tool.","zh":"在这份报告中，CRTC 指的是加拿大监管机构，而不是课堂工具。"}]}],"synonyms":["Canadian communications regulator","Canada’s broadcast and telecom regulator"],"phonetic":"/ˌsiː ɑːr tiː ˈsiː/","extraExplanation":["在加拿大的新闻或政策讨论里，CRTC 最常见、默认的含义就是该监管机构。它常涉及的话题包括：加拿大内容配额（CanCon）、媒体与平台监管、广播牌照、以及电信服务的价格/竞争等。","如果你是在某个特定行业或课程里看到 CRTC（例如教育科技、工程/硬件文档），它也可能是其他缩写；最好提供一句原文或上下文，我可以帮你精确判定。"]}
{"word":"crts","summary":{"en":"“crts” usually means “CRTs,” the plural of CRT (most often cathode-ray tube screens; sometimes Critical Race Theory).","zh":"“crts”通常指“CRTs”，即 CRT 的复数（最常见指阴极射线管显示器；有时指批判种族理论）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of CRT; cathode-ray tubes—older television/computer monitor screens that used electron beams to create images.","zh":"CRT 的复数；阴极射线管——较早期电视/电脑显示器使用的成像管，通过电子束形成画面。"},"examples":[{"en":"The lab still uses CRTs for some legacy equipment.","zh":"实验室仍在一些老旧设备上使用 CRT 显示器。"},{"en":"CRTs are bulky but can handle certain retro game visuals well.","zh":"CRT 虽然笨重，但对某些复古游戏的画面表现很好。"}]},{"partOfSpeech":"n.","definition":{"en":"(sometimes) plural of CRT; Critical Race Theory—an academic framework for analyzing how racism can be embedded in laws and institutions.","zh":"（有时）CRT 的复数；批判种族理论——一种学术框架，用来分析种族主义如何可能嵌入法律与制度之中。"},"examples":[{"en":"The class discussed different critiques of CRTs and other theories.","zh":"课堂讨论了对批判种族理论及其他理论的不同批评。"},{"en":"People often use “CRT” differently in media than in academic writing.","zh":"媒体中对“CRT”的用法常与学术写作不同。"}]}],"synonyms":["cathode-ray tubes","tube monitors"],"phonetic":"/ˌsiː ɑːr ˈtiːz/","extraExplanation":["“crts”常见于非正式输入，可能是“CRTs”（CRT 的复数）或把“certs（证书）/carts（购物车）”打错了。你想查的是哪一个？如果你告诉我上下文（比如电脑显示器、社会议题、考试证书或网购），我可以给出更准确的释义。"]}

