{"word":"CS","summary":{"en":"CS most often means computer science or customer service, depending on context.","zh":"CS 最常见指计算机科学或客户服务，具体含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"abbreviation for “computer science,” the study of computers, programming, and how information is processed.","zh":"“computer science（计算机科学）”的缩写，指研究计算机、编程与信息处理的学科。"},"examples":[{"en":"She’s majoring in CS and learning Python this semester.","zh":"她主修 CS（计算机科学），这学期在学 Python。"},{"en":"Many CS jobs involve problem-solving and coding.","zh":"很多 CS 相关工作都需要解决问题和写代码。"}]},{"partOfSpeech":"other","definition":{"en":"abbreviation for “customer service,” help and support provided to customers by a company.","zh":"“customer service（客户服务/客服）”的缩写，指公司为客户提供的帮助与支持。"},"examples":[{"en":"Please contact CS if your package is missing.","zh":"如果你的包裹丢了，请联系 CS（客服）。"},{"en":"CS will refund you within 3–5 business days.","zh":"CS（客服）会在 3–5 个工作日内给你退款。"}]},{"partOfSpeech":"other","definition":{"en":"abbreviation for “case,” used in some notes or records to refer to a particular situation or file.","zh":"“case（案件/个案/案例）”的缩写，在某些记录或备注中用于指代某个具体个案或档案。"},"examples":[{"en":"The doctor reviewed the CS before making a decision.","zh":"医生在做决定前查看了这个 CS（个案/病例记录）。"}]}],"synonyms":["computer science","customer service","support"],"phonetic":"/ˌsiːˈɛs/","extraExplanation":["“CS”在英语里最常见的两种意思是“Computer Science”和“Customer Service”。具体指哪一个，通常靠语境判断：出现在学校/专业/编程相关内容里，多半是计算机科学；出现在购物/订单/退款/售后场景里，多半是客服。","读法通常是把两个字母分别读出来：C-S。正式写作中，第一次出现时最好写全称（computer science / customer service），后面再用CS。"]}
{"word":"cs","summary":{"en":"“CS” most commonly means Computer Science or customer service; it can also mean the chemical symbol Cs (cesium).","zh":"“CS”最常见指计算机科学或客户服务；也可指化学符号 Cs（铯）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"abbreviation for Computer Science (the study of computers, programming, and computation)","zh":"Computer Science 的缩写；计算机科学（研究计算机、编程与计算的学科）"},"examples":[{"en":"She’s majoring in CS at university.","zh":"她在大学主修 CS（计算机科学）。"},{"en":"This job prefers candidates with a CS degree.","zh":"这份工作更偏好有 CS（计算机科学）学位的候选人。"}]},{"partOfSpeech":"other","definition":{"en":"abbreviation for customer service (help and support for customers)","zh":"customer service 的缩写；客户服务（为顾客提供帮助与支持）"},"examples":[{"en":"Please contact CS if your order hasn’t arrived.","zh":"如果你的订单还没到，请联系 CS（客服）。"},{"en":"CS will respond within 24 hours.","zh":"CS（客服）会在 24 小时内回复。"}]},{"partOfSpeech":"other","definition":{"en":"chemical symbol for cesium, a soft, silver-gold metal element","zh":"化学元素“铯”的符号（Cs），一种柔软的银金色金属元素"},"examples":[{"en":"Cs is the chemical symbol for cesium.","zh":"Cs 是化学元素铯的符号。"},{"en":"Cesium (Cs) is used in atomic clocks.","zh":"铯（Cs）用于原子钟。"}]},{"partOfSpeech":"other","definition":{"en":"(formal writing) abbreviation of “cases,” used after Latin-derived terms like “e.g.” or “in re” in legal contexts","zh":"（正式写作/法律语境）“cases”的缩写，常见于某些法律/拉丁表达之后"},"examples":[{"en":"The report summarizes several CS cited in the appendix.","zh":"报告总结了附录中引用的若干案例（CS）。"}]}],"synonyms":["Computer Science","customer service","cesium (Cs)"],"phonetic":"/ˌsiːˈɛs/","extraExplanation":["“CS”最常见的两种意思是：计算机科学（Computer Science）和客户服务（customer service）。具体含义通常看语境：出现在学校/专业/编程相关时多为计算机科学；出现在订单、退款、投诉、售后等语境时多为客服。","作为化学符号时写作“Cs”（注意大小写），专指元素“铯”。","口语里读字母音：\"C-S\"。如果你告诉我你看到“cs”的句子或场景，我可以帮你判断是哪一种。"]}
{"word":"CSA","summary":{"en":"CSA is an abbreviation that most often means Community Supported Agriculture, but it can also mean the Canadian Space Agency or the Confederate States of America, depending on context.","zh":"CSA是一个缩写，最常见指“社区支持农业”，也可能指“加拿大航天局”或“美利坚联盟国”，需结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) Community Supported Agriculture: a system where people buy a “share” of a local farm’s harvest in advance and receive regular produce during the season.","zh":"（缩写）社区支持农业：消费者提前购买本地农场的“份额”，在生产季定期收到农产品的一种模式。"},"examples":[{"en":"We joined a CSA to get fresh vegetables every week.","zh":"我们加入了CSA，这样每周都能收到新鲜蔬菜。"},{"en":"Many CSAs let members pick up a farm box at a local drop-off point.","zh":"很多CSA让成员在当地取货点领取农场蔬菜箱。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) Canadian Space Agency: Canada’s national space agency.","zh":"（缩写）加拿大航天局：加拿大的国家航天机构。"},"examples":[{"en":"The CSA works with international partners on space missions.","zh":"加拿大航天局（CSA）与国际伙伴合作开展太空任务。"},{"en":"She hopes to work at the CSA as an engineer.","zh":"她希望以工程师身份在CSA工作。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) Confederate States of America: the 11 southern states that formed a separate government during the U.S. Civil War (1861–1865).","zh":"（缩写）美利坚联盟国：美国内战（1861–1865）期间由南方11个州组成的分离政权。"},"examples":[{"en":"The museum has documents from the CSA era.","zh":"这家博物馆收藏有南方联盟（CSA）时期的文件。"},{"en":"In history class, we studied the CSA and the causes of the Civil War.","zh":"在历史课上，我们学习了南方联盟（CSA）以及内战的成因。"}]}],"synonyms":["abbr.","initialism"],"phonetic":"/ˌsiː ɛs ˈeɪ/","extraExplanation":["“CSA”是常见缩写，具体含义高度依赖语境：在食物/农场/订菜箱的语境里多指“Community Supported Agriculture”；在航天新闻里多指“Canadian Space Agency”；在美国历史语境里可能指“Confederate States of America”。写作或正式场合建议第一次出现时写全称并在括号里标注（CSA），以避免歧义。","发音通常按字母读（C-S-A），而不是读成一个单词。","提到“Confederate States of America”时需注意其与奴隶制度及美国内战相关，在公共场合或跨文化交流中可能带有敏感性，最好保持客观历史语气并说明讨论目的。"]}
{"word":"CSAB","summary":{"en":"CSAB is an abbreviation most commonly referring to India’s Central Seat Allocation Board, but it can also mean different advisory boards depending on context.","zh":"CSAB 是缩写，最常见指印度的“中央座位分配委员会”，也可能在不同机构中代表不同的顾问委员会名称，需结合语境判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbr.) Central Seat Allocation Board: an Indian government-organized counseling/allotment system for assigning seats in certain technical colleges (especially NITs/IIITs/GFTIs) after entrance exams.","zh":"（缩写）中央座位分配委员会：印度用于部分理工院校（如 NIT/IIIT/GFTI 等）招生“志愿填报与分配”的官方统筹系统/机构。"},"examples":[{"en":"I registered for CSAB to join the special round after the main counseling ended.","zh":"主轮结束后，我报名了 CSAB，参加补录/特别轮分配。"},{"en":"CSAB publishes the schedule for choice filling and seat allotment online.","zh":"CSAB 会在网上公布填志愿与分配结果的时间表。"}]},{"partOfSpeech":"n.","definition":{"en":"(abbr.) A set of initials used by different organizations for different names (for example, a “Child Safety Advisory Board” or “Community School Advisory Board”), depending on the institution.","zh":"（缩写）不同机构可能用 CSAB 代表不同名称（例如“儿童安全顾问委员会”“社区学校顾问委员会”等），具体含义取决于所在单位。"},"examples":[{"en":"Our district’s CSAB meets monthly to review student safety policies.","zh":"我们学区的 CSAB 每月开会，审查学生安全政策。"},{"en":"If you’re not sure what CSAB means in a document, check the glossary or the organization’s website.","zh":"如果不确定文件里的 CSAB 指什么，可以查术语表或该机构官网。"}]}],"synonyms":["initialism","acronym"],"phonetic":"/ˌsiːˌɛsˌeɪˈbiː/","extraExplanation":["CSAB 是首字母缩写，单独看并不唯一。不同国家/领域可能有不同展开形式；如果你告诉我它出现的语境（国家、学校/公司、文件标题或一句原文），我可以帮你锁定最准确的含义。"]}
{"word":"CSACC","summary":{"en":"CSACC is an acronym; its exact meaning depends on the context where it appears.","zh":"CSACC 是一个缩写；具体含义要看它出现的语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An acronym whose meaning depends on context; it is not a common standalone English word. It often appears as an organization name, program title, or technical abbreviation (for example, a council/commission, an academic center, or a professional association).","zh":"一个缩写，其含义取决于具体语境；它不是常见的独立英语单词。通常作为机构名称、项目名称或技术缩写出现（例如某种委员会/中心/协会等）。"},"examples":[{"en":"I saw “CSACC” in the report, but the document didn’t explain what it stands for.","zh":"我在报告里看到“CSACC”，但文件没有说明它代表什么。"},{"en":"Could you tell me what CSACC means in this email thread?","zh":"你能告诉我在这串邮件里 CSACC 是什么意思吗？"}]}],"synonyms":["acronym","abbreviation","initialism"],"phonetic":"/ˌsiː ˌɛs ˌeɪ ˌsiː ˌsiː/","extraExplanation":["“CSACC”不是固定对应某一个广泛通用的英文词义，常见情况是某个机构/项目的首字母缩写。要准确解释，需要你提供上下文（例如它出现的行业：教育、医疗、政府、IT；或它所在的句子/全文标题）。你可以把原句贴出来，我可以帮你从语境推断最可能的全称与含义。"]}
{"word":"CSACS","summary":{"en":"CSACS is usually an abbreviation; the meaning depends on context.","zh":"CSACS通常是缩写；具体意思需看上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation (acronym/initialism). Its exact meaning depends on the field or organization using it.","zh":"一个缩写（首字母缩略词/字母缩写）。具体含义取决于使用它的领域或机构。"},"examples":[{"en":"In this email, “CSACS” is an internal department abbreviation—ask the sender what it stands for.","zh":"在这封邮件里，“CSACS”是内部部门缩写——可以问发件人它代表什么。"},{"en":"Different universities may use “CSACS” to name a program or committee, so context matters.","zh":"不同大学可能用“CSACS”命名某个项目或委员会，所以要看上下文。"}]}],"synonyms":["abbrev.","acronym","initialism"],"phonetic":"/ˌsiːˌɛsˌeɪˌsiːˈɛs/","extraExplanation":["“CSACS”不是一个在通用英语里固定、广泛认可的单词，更常见的是某个机构/项目/系统的简称。要准确释义，通常需要你提供上下文（例如：出现在哪个国家/学校/公司、完整句子、相关行业）。","读法上，英文里这种缩写常按字母逐个读（C-S-A-C-S），也有人会把它当成一个“词”来读；具体以该组织的习惯为准。","如果你把它发给我时能附上一句话或说明所在领域（如教育、医学、政府、IT等），我可以把最可能的全称和含义列出来并给出更贴切的例句。"]}
{"word":"CSAR","summary":{"en":"CSAR means “combat search and rescue,” a military operation to rescue personnel from hostile areas.","zh":"CSAR指“战斗搜救”，是在敌对区域救援军事人员的行动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"combat search and rescue; a military mission to locate, protect, and recover personnel (often aircrew) from hostile or dangerous areas.","zh":"战斗搜救；一种军事行动，用于在敌对或高风险区域寻找、保护并救回人员（常见为飞行员/机组人员）。"},"examples":[{"en":"The downed pilot was recovered during a CSAR mission.","zh":"这名被击落的飞行员在一次CSAR任务中被救回。"},{"en":"CSAR teams train to operate under enemy fire and difficult weather.","zh":"CSAR队伍训练在敌火和恶劣天气下执行任务。"},{"en":"The briefing covered CSAR procedures and emergency radio codes.","zh":"简报讲解了CSAR流程和紧急无线电代码。"}]}],"synonyms":["combat search and rescue","SAR (related)","personnel recovery (related)"],"phonetic":"/ˌsiː ɛs eɪr/","extraExplanation":["CSAR通常读作字母“C-S-A-R”，多用于空军、海军航空等语境，强调“战斗环境”下的救援。","它与SAR（search and rescue，普通搜救）不同：SAR常指民用或非战斗环境（如海上、山区）；CSAR则需要更强的武装护航、压制威胁、通信与身份识别等配套。","相关术语：PR（personnel recovery，人员救援/回收）是更大的概念，CSAR可视为PR在战斗条件下的一种典型任务形态。"]}
{"word":"csardas","summary":{"en":"A Hungarian folk dance (and its music) that typically changes from slow to fast.","zh":"一种匈牙利民间舞（及其舞曲），常见特点是从慢板逐渐转为快板。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lively Hungarian folk dance and the music for it, usually starting slowly and then becoming fast and energetic","zh":"匈牙利的一种民间舞（及其舞曲），通常先慢后快，节奏越来越热烈"},"examples":[{"en":"The violinist played a csardas, beginning with a slow, dramatic intro and ending in a fast whirl.","zh":"小提琴手演奏了一段恰尔达什舞曲，先是缓慢而戏剧性的开场，最后以快速旋转的段落收尾。"},{"en":"They performed a csardas at the cultural festival to represent Hungarian tradition.","zh":"他们在文化节上表演了恰尔达什舞，以展现匈牙利传统。"}]}],"synonyms":["Hungarian folk dance","csárdás"],"phonetic":"/ˈtʃɑr.dɑʃ/","extraExplanation":["“csardas”更常见的拼写是带重音的匈牙利语“csárdás”。英语里常省略重音符号。","这种舞/曲的典型结构是“lassú（慢）→ friss（快）”：先抒情、拉长音，再突然加速，气氛热烈。","在古典音乐与轻歌剧里也常出现“csárdás”风格（例如舞会或吉普赛风情的场景中），用来营造匈牙利/中欧民俗色彩。"]}
{"word":"CSB","summary":{"en":"CSB is a common abbreviation that often means the Christian Standard Bible; it can also refer to the U.S. Chemical Safety Board or India’s Central Security Bureau, depending on context.","zh":"CSB 是常见缩写，通常指《基督教标准版圣经》；也可能指美国化学事故调查机构或印度中央安全局，需根据语境判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Christian Standard Bible: a modern English translation of the Bible (often shortened to CSB), published for clear, readable contemporary English.","zh":"《基督教标准版圣经》：一种现代英文圣经译本（常简称 CSB），以清晰、易读的当代英语为特点。"},"examples":[{"en":"She reads the CSB because the language feels clear and modern.","zh":"她读 CSB，因为它的语言感觉清晰、现代。"},{"en":"Our study group uses the CSB translation this year.","zh":"我们的小组今年使用 CSB 这个译本。"}]},{"partOfSpeech":"n.","definition":{"en":"U.S. Chemical Safety and Hazard Investigation Board: an independent U.S. government agency that investigates serious chemical accidents; often called the CSB.","zh":"美国化学安全与危险事故调查委员会：一个独立的美国政府机构，负责调查严重化学事故；常简称 CSB。"},"examples":[{"en":"The CSB released a report on the refinery explosion.","zh":"CSB 发布了关于炼油厂爆炸的报告。"},{"en":"According to the CSB, better training could reduce the risk of accidents.","zh":"据 CSB 称，更好的培训可以降低事故风险。"}]},{"partOfSpeech":"n.","definition":{"en":"Central Security Bureau: in India, a government agency responsible for providing security to high-level officials; often shortened to CSB.","zh":"中央安全局：印度负责为高级官员提供安保的政府机构；常简称 CSB。"},"examples":[{"en":"The official was assigned CSB protection during the visit.","zh":"该官员在访问期间被安排由 CSB 提供安保。"}]}],"synonyms":["Christian Standard Bible (CSB)","Chemical Safety Board (CSB)"],"phonetic":"/ˌsiːˌɛsˈbiː/","extraExplanation":["“CSB”是缩写，具体含义高度依赖语境：宗教场景（读经/查经）多指《Christian Standard Bible》；安全生产或化工事故新闻多指美国的化学事故调查机构；涉及印度政要安保时可能指印度的 Central Security Bureau。","如果你告诉我你看到“CSB”的句子或领域（宗教/新闻/政府/学校等），我可以帮你锁定最准确的意思。"]}
{"word":"CSC","summary":{"en":"“CSC” is an acronym with several common meanings, such as Certified ScrumMaster, Customer Service Center, or a Computer Science course code/department.","zh":"“CSC”是一个常见缩写，可能表示认证Scrum Master、客户服务中心，或计算机科学的课程代码/院系等，具体取决于上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Certified ScrumMaster (a professional certification for people who work with Scrum in agile project management).","zh":"认证Scrum Master（敏捷项目管理Scrum框架中的一种职业认证）。"},"examples":[{"en":"She earned her CSC to help her move into an agile coach role.","zh":"她取得了CSC认证，帮助自己转型做敏捷教练。"},{"en":"Some companies prefer applicants with a Scrum certification like CSC.","zh":"有些公司更偏好拥有像CSC这类Scrum认证的求职者。"}]},{"partOfSpeech":"other","definition":{"en":"Customer Service Center (a department or office that handles customer questions and support).","zh":"客户服务中心（负责处理客户咨询与支持的部门/窗口）。"},"examples":[{"en":"Please contact the CSC if you need help with your order.","zh":"如果你的订单需要帮助，请联系客户服务中心（CSC）。"},{"en":"The bank’s CSC is open from 9 a.m. to 6 p.m.","zh":"这家银行的客户服务中心（CSC）营业时间是上午9点到下午6点。"}]},{"partOfSpeech":"other","definition":{"en":"Common abbreviation for a school subject/department: Computer Science (often written as CS; sometimes seen as CSC in course codes).","zh":"计算机科学（更常写作CS；在一些课程代码里也可能见到CSC）。"},"examples":[{"en":"I’m taking CSC101 this semester.","zh":"这学期我选了CSC101。"},{"en":"The CSC department offers courses in programming and data structures.","zh":"计算机相关院系（CSC）开设编程和数据结构等课程。"}]},{"partOfSpeech":"other","definition":{"en":"Acronym used by specific organizations (name varies by country/company), e.g., a company or government agency called “CSC.”","zh":"某些机构/公司/政府部门名称的缩写（不同国家和单位含义不同），名称可能就叫“CSC”。"},"examples":[{"en":"He works at CSC as a systems engineer.","zh":"他在一家名为CSC的机构做系统工程师。"},{"en":"Check the email signature to see what CSC stands for in that context.","zh":"看一下邮件签名，就能知道在这个语境里CSC具体指什么。"}]}],"synonyms":["C-S-C (spelled out)"],"phonetic":"/ˌsiː ɛs ˈsiː/","extraExplanation":["“CSC”是缩写（initialism），通常按字母读：C-S-C。它没有单一固定含义，最可靠的判断方式是看上下文：例如出现在简历/招聘信息里可能指认证；出现在客服页面可能指客户服务中心；出现在课程表里可能是课程代码。","如果你能告诉我它出现在哪里（例如邮件、课程号、证书、公司名称、聊天内容），我可以帮你锁定最准确的含义。"]}
{"word":"csc","summary":{"en":"CSC is an initialism with several common meanings, such as computer science, customer service center, civil service commission, or Certified ScrumMaster, depending on context.","zh":"CSC 是一个缩写，常见含义包括计算机科学、客户服务中心、公务员委员会或认证 ScrumMaster，具体取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “computer science,” the study of computers, programming, and how information is processed.","zh":"“computer science（计算机科学）”的缩写，指研究计算机、编程以及信息处理方式的学科。"},"examples":[{"en":"She’s majoring in CSC and wants to become a software engineer.","zh":"她主修 CSC（计算机科学），想成为一名软件工程师。"},{"en":"This CSC course covers data structures and algorithms.","zh":"这门 CSC 课程涵盖数据结构和算法。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Customer Service Center,” a place/department that helps customers with questions or problems.","zh":"“Customer Service Center（客户服务中心）”的缩写，指为客户解答问题、处理投诉或提供支持的部门/地点。"},"examples":[{"en":"Please contact the CSC if your order hasn’t arrived.","zh":"如果你的订单还没到，请联系 CSC（客户服务中心）。"},{"en":"The CSC is open from 9 a.m. to 6 p.m.","zh":"CSC（客服中心）营业时间是上午 9 点到下午 6 点。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation used in some countries/organizations for “Civil Service Commission,” an agency related to government hiring and civil-service rules.","zh":"在一些国家或机构中，“Civil Service Commission（公务员委员会/文官委员会）”的缩写，常与政府招录和公务员制度相关。"},"examples":[{"en":"The CSC announced new rules for government recruitment.","zh":"CSC（公务员委员会）发布了新的政府招录规定。"},{"en":"You may need CSC approval before the appointment is finalized.","zh":"任命最终确定前，你可能需要 CSC 的批准。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Certified ScrumMaster,” a common certification in Agile project management.","zh":"“Certified ScrumMaster（认证 Scrum Master）”的缩写，是敏捷项目管理中常见的认证。"},"examples":[{"en":"He earned his CSC to move into a Scrum Master role.","zh":"他考取了 CSC（认证 ScrumMaster）来转做 Scrum Master。"},{"en":"Some job posts list CSC as preferred.","zh":"一些招聘信息会写明优先考虑持有 CSC 的人。"}]}],"synonyms":["computer science (CS)","customer service (CS)","Scrum Master (SM)"],"phonetic":"/ˌsiː ˌɛs ˈsiː/","extraExplanation":["“CSC”不是单一含义的普通词，而是缩写（initialism）。在邮件、课程代码、政府文件或招聘信息里很常见，但具体指什么要看上下文（例如学校专业、客服系统、政府机构或证书）。","发音通常按字母读：C-S-C。写作时有时会全大写（CSC），也可能出现在课程编号中（如 CSC 101）。"]}
{"word":"csch","summary":{"en":"“csch” is the standard math abbreviation for the hyperbolic cosecant: csch(x)=1/sinh(x).","zh":"“csch”是“双曲余割”的常用数学缩写：csch(x)=1/sinh(x)。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation in mathematics for the hyperbolic cosecant function, equal to 1/sinh(x).","zh":"数学中“双曲余割”函数的缩写，等于 1/sinh(x)。"},"examples":[{"en":"In many textbooks, csch(x) means 1/sinh(x).","zh":"在很多教材里，csch(x) 表示 1/sinh(x)。"},{"en":"Different authors may write csch(x) or cosech(x) for the same function.","zh":"不同作者可能用 csch(x) 或 cosech(x) 来表示同一个函数。"}]}],"synonyms":["cosech","hyperbolic cosecant"],"phonetic":"/ˈkoʊˌsɛtʃ/","extraExplanation":["“csch”常见于微积分、微分方程与工程数学的公式中，是“hyperbolic cosecant（双曲余割）”的符号写法。","它和三角函数的“csc(x)=1/sin(x)”形式类似，只是把 sin 换成了双曲正弦 sinh。","读法因地区/教材不同而异：不少人会把 csch 读作“co-sech”，也有人直接按字母拼读。"]}
{"word":"CSD","summary":{"en":"CSD is an abbreviation; common meanings include Customer Service Department and (in some schools) Computer Science Department.","zh":"CSD是缩写；常见含义包括客户服务部（Customer Service Department）以及（部分学校中）计算机科学系/学院（Computer Science Department）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Customer Service Department,” the part of a company that helps customers with questions, orders, returns, or complaints.","zh":"“Customer Service Department（客户服务部/客服部门）”的缩写，指公司里负责解答咨询、处理订单/退换货与投诉等的部门。"},"examples":[{"en":"Please contact the CSD if you have any questions about your order.","zh":"如果你对订单有任何疑问，请联系CSD（客服部门）。"},{"en":"The CSD handled my refund request within two days.","zh":"CSD在两天内处理了我的退款申请。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation used in some schools for “Computer Science Department,” the academic department that teaches and researches computer science.","zh":"在一些学校中是“Computer Science Department（计算机科学系/学院）”的缩写，指教授与研究计算机科学的院系。"},"examples":[{"en":"I’m taking this programming class through the CSD.","zh":"我这门编程课是通过CSD（计算机科学系）修的。"},{"en":"The CSD is hosting a talk on artificial intelligence.","zh":"CSD正在举办一场关于人工智能的讲座。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation that can mean different things depending on the field (for example, “Central Standard Time” is usually written as CST, not CSD).","zh":"一个在不同领域可能代表不同含义的缩写（例如“Central Standard Time”通常写作CST而不是CSD）。"},"examples":[{"en":"In this document, CSD refers to the Computer Science Department.","zh":"在这份文件里，CSD指计算机科学系。"},{"en":"Could you spell out CSD the first time you use it?","zh":"你能在第一次使用时把CSD全称写出来吗？"}]}],"synonyms":["customer service","CS (customer service)","help desk (similar idea)"],"phonetic":"/ˌsiː ɛs ˈdiː/","extraExplanation":["“CSD”不是一个固定唯一含义的英语单词，更常见于机构名称或专业领域的缩写。正式写作里通常建议第一次出现时写全称（例如：Customer Service Department (CSD)），后文再用缩写，以免读者误解。","如果你告诉我你看到CSD的具体场景（公司邮件、学校公告、医学/工程/法律文件等），我可以帮你锁定最准确的含义。"]}
{"word":"CSDC","summary":{"en":"CSDC is an abbreviation usually read as “C-S-D-C.” In many finance contexts, it refers to China Securities Depository and Clearing Corporation Limited.","zh":"CSDC 是一个通常读作“C-S-D-C”的缩写；在许多金融语境中，它指中国证券登记结算有限责任公司（中证登）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation that is usually read as individual letters (“C-S-D-C”); its meaning depends on the field or context","zh":"一个通常按字母逐个读出来的缩写（“C-S-D-C”）；具体含义取决于领域与语境"},"examples":[{"en":"What does CSDC stand for in this document?","zh":"这份文件里的 CSDC 是什么缩写？"},{"en":"Please define CSDC the first time you use it in the report.","zh":"请在报告中第一次使用 CSDC 时先写出它的全称。"}]},{"partOfSpeech":"other","definition":{"en":"China Securities Depository and Clearing Corporation Limited (the central securities depository and clearing house for mainland China’s securities markets)","zh":"中国证券登记结算有限责任公司（中国大陆证券市场的中央证券登记托管与结算机构）"},"examples":[{"en":"Many A-share settlements are processed through CSDC.","zh":"许多 A 股交易的结算会通过中证登（CSDC）处理。"},{"en":"The notice cites requirements issued by CSDC.","zh":"该通知引用了中证登（CSDC）发布的要求。"}]}],"synonyms":["abbreviation","initialism"],"phonetic":"/ˌsiː ɛs ˌdiː ˈsiː/","extraExplanation":["CSDC 作为缩写在不同国家/行业可能对应不同机构或术语；最常见的一种用法是在中文金融语境中指“China Securities Depository and Clearing（中证登）”。如果你告诉我它出现的句子或领域（金融、IT、学校/课程等），我可以帮你确认最准确的释义。"]}
{"word":"CSE","summary":{"en":"CSE is an abbreviation with several common meanings; the most frequent are Computer Science and Engineering and Customer Support Executive, but it can also mean Common Stock Equity (finance) or Child Sexual Exploitation (a sensitive term).","zh":"CSE 是一个多义缩写；最常见指“计算机科学与工程”或“客户支持专员”，也可能指金融中的“普通股股东权益”，或敏感语境下的“儿童性剥削”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Computer Science and Engineering (an academic field or university department that combines computer science with engineering).","zh":"计算机科学与工程（大学专业或院系名称，将计算机科学与工程学结合）。"},"examples":[{"en":"She is majoring in CSE at the university.","zh":"她在大学主修 CSE（计算机科学与工程）。"},{"en":"The CSE department offers courses in programming and hardware design.","zh":"CSE 院系开设编程和硬件设计等课程。"}]},{"partOfSpeech":"n.","definition":{"en":"Customer Support Executive (a job title for someone who handles customer service and support).","zh":"客户支持专员/客户服务主管（负责客户服务与支持的职位名称）。"},"examples":[{"en":"Please contact our CSE if you need help with your account.","zh":"如果你的账号需要帮助，请联系我们的 CSE（客户支持专员）。"},{"en":"As a CSE, he answers customer questions by phone and email.","zh":"作为一名 CSE，他通过电话和邮件解答客户问题。"}]},{"partOfSpeech":"n.","definition":{"en":"Common Stock Equity (a finance term referring to shareholders’ equity from common stock).","zh":"普通股股东权益（金融术语，指来自普通股的股东权益）。"},"examples":[{"en":"The report shows an increase in CSE this quarter.","zh":"报告显示本季度 CSE（普通股股东权益）有所增长。"},{"en":"Investors often compare a company’s debt to its CSE.","zh":"投资者常把公司的债务与其 CSE 作比较。"}]},{"partOfSpeech":"n.","definition":{"en":"Child Sexual Exploitation (a term used by authorities and NGOs for the sexual exploitation of minors).","zh":"儿童性剥削（政府机构与公益组织用于指未成年人遭受性剥削的术语）。"},"examples":[{"en":"The organization trains staff to recognize signs of CSE.","zh":"该机构培训员工识别 CSE（儿童性剥削）的迹象。"},{"en":"The policy includes procedures for reporting suspected CSE.","zh":"该政策包含举报疑似 CSE 的流程。"}]}],"synonyms":["Computer Science and Engineering","Customer Support Executive","Common Stock Equity","Child Sexual Exploitation"],"phonetic":"/ˌsiː ɛs ˈiː/","extraExplanation":["“CSE”是缩写，具体含义高度依赖场景：在大学与求职语境里常指“Computer Science and Engineering”；在公司客服系统里可能指“Customer Support Executive”；在财务报表里可能指“Common Stock Equity”。","在英国及部分国际公共服务/媒体语境中，“CSE”也常指“Child Sexual Exploitation”，属于敏感话题。阅读或写作时建议首次出现先写全称（例如：Child Sexual Exploitation, CSE），以避免误解并保持表达清晰。","发音通常按字母读（C-S-E）。"]}
{"word":"csect","summary":{"en":"“csect” is usually a nonstandard abbreviation for “cross-section,” and in IBM assembly “CSECT” means a control section.","zh":"“csect”通常是“cross-section（横截面）”的非标准缩写；在 IBM 汇编中大写“CSECT”指控制段。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(informal abbreviation) cross-section; the shape or view you get when something is cut straight across.","zh":"（非正式缩写）“cross-section（横截面/剖面）”；指把物体横向切开后看到的形状或截面。"},"examples":[{"en":"The pipe’s csect is circular, so it can handle pressure evenly.","zh":"这根管子的 csect（横截面）是圆形的，所以能更均匀地承受压力。"},{"en":"Check the beam’s csect area before calculating the load.","zh":"在计算承载力之前，先检查梁的 csect 面积。"}]},{"partOfSpeech":"other","definition":{"en":"(computing, IBM mainframe assembly) CSECT: a “control section,” a named block of code/data treated as a unit by the assembler and linker.","zh":"（计算机/IBM 主机汇编）CSECT： “control section（控制段）”，指在汇编与链接时作为一个单元处理的、带名称的代码/数据块。"},"examples":[{"en":"This module has two CSECTs: one for code and one for constants.","zh":"这个模块有两个 CSECT：一个放代码，一个放常量。"},{"en":"The label at the start of the CSECT becomes the section name.","zh":"CSECT 起始处的标签会成为该段的名称。"}]}],"synonyms":["cross-section","x-section","x-sect","CSECT (control section)"],"phonetic":"/siː sɛkt/","extraExplanation":["“csect”本身不是常见的通用英语单词，更常见的写法是 **cross-section**（也常简写为 **x-section / x‑sect**）。在工程、力学、制图语境中，你更可能看到 cross-section。","第二个含义（IBM 汇编的 CSECT）属于专业术语，通常写成全大写 **CSECT**。如果你告诉我你看到它的句子或领域（工程/编程/其他），我可以帮你确定具体意思。"]}
{"word":"csects","summary":{"en":"“csects” isn’t a standard word; it’s likely a typo for “sects” (groups/denominations within a religion or movement).","zh":"“csects”不是标准单词；很可能是“sects”（宗派/派别）的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “sects” (plural of “sect”), meaning groups within a religion, ideology, or movement.","zh":"不是标准英语单词。很可能是把“sects”（“sect”的复数）拼错了，指宗教、思想或某种运动内部的不同派别/宗派。"},"examples":[{"en":"Different sects of the same religion may have different traditions.","zh":"同一宗教的不同宗派可能有不同的传统。"},{"en":"The book describes how new sects formed over time.","zh":"这本书描述了新的宗派如何随着时间形成。"}]}],"synonyms":["denominations","factions","branches","splinter groups"],"phonetic":"/sɛkts/","extraExplanation":["“sect”常用于描述宗教中的“教派/宗派”，也可用于政治或思想团体中的“小派别”。如果你原本想输入的是“insects”（昆虫），请告诉我语境，我可以给你对应词条与例句。"]}
{"word":"Csel","summary":{"en":"CSEL is usually an acronym; its meaning depends on context.","zh":"CSEL通常是缩略词，具体意思取决于上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely an acronym/initialism (a short form made from first letters), and its meaning depends on the context (school, technology, business, etc.).","zh":"不是标准英语单词。更可能是一个首字母缩略词（由多个词的首字母组成），具体含义需要看使用场景（学校、科技、商业等）。"},"examples":[{"en":"I saw “CSEL” in the document, but it wasn’t defined—do you know what it stands for?","zh":"我在文件里看到“CSEL”，但没有解释——你知道它代表什么吗？"},{"en":"Different organizations use CSEL to mean different things, so context matters.","zh":"不同机构可能用 CSEL 表示不同意思，所以要看上下文。"}]}],"synonyms":["initialism","acronym"],"phonetic":"/siː ɛs iː ɛl/","extraExplanation":["“CSEL”常见读法是把每个字母念出来（类似“FBI”）。如果你能告诉我它出现的领域/句子（例如学校名称、课程、软件功能、职位、论文标题等），我可以帮你锁定最可能的全称和准确中文含义。"]}
{"word":"CSF","summary":{"en":"CSF usually means cerebrospinal fluid (the fluid around the brain and spinal cord).","zh":"CSF通常指脑脊液（包围并保护大脑与脊髓的液体）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"abbreviation for “cerebrospinal fluid,” the clear liquid that surrounds and protects the brain and spinal cord.","zh":"“cerebrospinal fluid（脑脊液）”的缩写；指包围并保护大脑和脊髓的透明液体。"},"examples":[{"en":"The doctor tested the CSF to check for infection.","zh":"医生检测了脑脊液（CSF）以检查是否有感染。"},{"en":"CSF helps cushion the brain from sudden movement.","zh":"脑脊液（CSF）有助于缓冲大脑，减少突然运动带来的冲击。"},{"en":"A lumbar puncture can collect CSF for analysis.","zh":"腰椎穿刺可以抽取脑脊液（CSF）进行化验分析。"}]}],"synonyms":["cerebrospinal fluid","spinal fluid"],"phonetic":"/ˌsiː.ɛsˈɛf/","extraExplanation":["“CSF”在医学语境中最常见，读作字母：C-S-F。常出现在检验报告或病历里。","在非医学领域，“CSF”也可能代表其他意思（如某些行业术语或组织名）。如果你告诉我上下文（课程/工作/文章领域），我可以帮你确定具体含义。"]}
{"word":"CSI","summary":{"en":"CSI most often means crime scene investigation (or a crime scene investigator). It can also refer to the TV show “CSI” or, in business, Customer Satisfaction Index.","zh":"CSI最常指“犯罪现场勘查”（或“犯罪现场勘查员”）。也可指电视剧《CSI》，或在商业领域指“顾客满意度指数”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"crime scene investigation; the process of collecting and analyzing evidence at the place where a crime happened (also used for the unit or job).","zh":"犯罪现场勘查；在犯罪发生地点收集、记录并分析证据的过程（也可指相关部门或工作）。"},"examples":[{"en":"The police called in CSI to collect fingerprints and DNA.","zh":"警方叫来犯罪现场勘查人员（CSI）采集指纹和DNA。"},{"en":"CSI work requires careful documentation of every detail at the scene.","zh":"犯罪现场勘查工作需要对现场的每个细节进行仔细记录。"}]},{"partOfSpeech":"n.","definition":{"en":"a crime scene investigator; a person trained to examine a crime scene and gather evidence.","zh":"犯罪现场勘查员；负责勘查现场并采集证据的专业人员。"},"examples":[{"en":"She works as a CSI for the county police department.","zh":"她在县警局担任犯罪现场勘查员（CSI）。"},{"en":"The CSI photographed the room before anything was moved.","zh":"在移动任何物品之前，勘查员先对房间进行了拍照。"}]},{"partOfSpeech":"n.","definition":{"en":"(TV) “CSI: Crime Scene Investigation,” an American television series about forensic investigations; sometimes “CSI” refers to the whole TV franchise.","zh":"（电视）《CSI：犯罪现场调查》，一部美国刑侦/法证题材电视剧；有时“CSI”也泛指该系列剧。"},"examples":[{"en":"I started watching CSI because I like forensic dramas.","zh":"我开始看《CSI》是因为我喜欢法证题材的剧。"},{"en":"That plot twist feels like something from CSI.","zh":"那个反转剧情很像《CSI》里的桥段。"}]},{"partOfSpeech":"n.","definition":{"en":"(business/marketing) Customer Satisfaction Index; a measure used to show how satisfied customers are.","zh":"（商业/营销）顾客满意度指数；用于衡量顾客满意程度的指标。"},"examples":[{"en":"Our CSI improved after we shortened delivery times.","zh":"我们缩短配送时间后，顾客满意度指数（CSI）提高了。"},{"en":"The report compares CSI scores across different regions.","zh":"报告对比了不同地区的CSI评分。"}]}],"synonyms":["crime scene investigation","crime scene investigator","forensics (general)","customer satisfaction index (business)"],"phonetic":"/ˌsiː ɛs ˈaɪ/","extraExplanation":["在日常英语里，“CSI”最常见的含义是犯罪现场相关（crime scene investigation / investigator）。在正式写作中，第一次出现时常会先写全称再括号标注缩写：“crime scene investigation (CSI)”。","作为缩写读字母音：C-S-I。复数有时写作“CSIs”（多个勘查员/多起案件的勘查）。","受电视剧影响，“CSI effect（CSI效应）”是常见说法，指陪审员或公众因影视作品而对法证证据抱有不现实的期待。"]}
{"word":"csi","summary":{"en":"CSI most commonly refers to crime scene investigation (or a crime scene investigator) and is also the name of a famous U.S. TV show.","zh":"CSI最常指“犯罪现场勘查/取证”（或“犯罪现场勘查员”），也可指美国知名电视剧《CSI》。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Crime Scene Investigation; the process of collecting and analyzing evidence at a place where a crime happened (also used for the unit or field of work).","zh":"犯罪现场勘查；指在犯罪发生地点搜集与分析证据的工作流程（也可泛指相关部门/领域）。"},"examples":[{"en":"The police called CSI to process the scene and collect fingerprints.","zh":"警方叫来犯罪现场勘查人员处理现场并采集指纹。"},{"en":"CSI teams often work with forensic labs to analyze DNA evidence.","zh":"犯罪现场勘查团队常与法医实验室合作分析DNA证据。"}]},{"partOfSpeech":"n.","definition":{"en":"A crime scene investigator; a person who works in crime scene investigation (informal, often used in TV/news).","zh":"犯罪现场勘查员；从事现场勘查取证的人（口语，常见于新闻/影视）。"},"examples":[{"en":"She works as a CSI for the county police department.","zh":"她在县警局当犯罪现场勘查员。"},{"en":"The CSI photographed the room before anything was moved.","zh":"勘查员在移动任何东西之前先拍摄了房间。"}]},{"partOfSpeech":"other","definition":{"en":"“CSI: Crime Scene Investigation,” a popular American TV series (and related spin-offs) about forensic investigation.","zh":"《CSI：犯罪现场调查》，美国热门电视剧（及其衍生剧），题材为法庭科学与刑侦取证。"},"examples":[{"en":"I started watching CSI because I like mystery shows.","zh":"我开始看《CSI》是因为我喜欢悬疑剧。"},{"en":"That scene feels like something from CSI.","zh":"那场面很像《CSI》里的情节。"}]}],"synonyms":["forensics","crime lab","forensic investigation","crime scene unit"],"phonetic":"/ˌsiː ˈaɪ/","extraExplanation":["在日常英语里，CSI 多数与“犯罪现场勘查/取证”有关；写作中常全称写作 crime scene investigation（或 crime scene investigator），之后再用 CSI。","发音通常按字母读（C-S-I）。复数可写 CSIs（读作“C-S-iz”）。","除刑侦语境外，CSI 也可能是其他领域缩写（如 Customer Satisfaction Index 顾客满意度指数），需结合上下文判断。"]}
{"word":"CSIRO","summary":{"en":"CSIRO is Australia’s national science agency (Commonwealth Scientific and Industrial Research Organisation).","zh":"CSIRO 是澳大利亚国家级科研机构（英联邦科学与工业研究组织）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Australia’s national science agency; the Commonwealth Scientific and Industrial Research Organisation, which conducts research and innovation in areas like agriculture, environment, health, and technology.","zh":"澳大利亚国家级科研机构；全称为“英联邦科学与工业研究组织（CSIRO）”，在农业、环境、健康与科技等领域开展科研与创新。"},"examples":[{"en":"CSIRO researchers developed new tools to monitor bushfire smoke and air quality.","zh":"CSIRO 的研究人员开发了新的工具来监测丛林火灾烟雾和空气质量。"},{"en":"She applied for a graduate program at CSIRO in Canberra.","zh":"她申请了位于堪培拉的 CSIRO 研究生项目。"},{"en":"According to CSIRO, the project could help farmers use water more efficiently.","zh":"CSIRO 表示，该项目可能帮助农民更高效地用水。"}]}],"synonyms":["Commonwealth Scientific and Industrial Research Organisation","Australia’s national science agency"],"phonetic":"/ˈsiː aɪ ˌɛs aɪ ˌɑːr ˈoʊ/","extraExplanation":["CSIRO 是澳大利亚最知名的科研机构之一，常与大学、政府和企业合作，把科研成果转化为实际应用。","读法通常按字母逐个读：C-S-I-R-O；在新闻与学术写作中常直接用缩写而不再写全称。"]}
{"word":"CSIS","summary":{"en":"CSIS most commonly refers to a U.S. think tank (Center for Strategic and International Studies), but in Canada it can mean the Canadian Security Intelligence Service.","zh":"CSIS 最常见指美国智库“战略与国际研究中心”，但在加拿大语境中也可指“加拿大安全情报局”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(US) Center for Strategic and International Studies: a Washington, D.C.–based think tank that researches foreign policy, security, and global issues.","zh":"（美国）战略与国际研究中心：位于华盛顿特区的智库，研究外交政策、安全与全球议题。"},"examples":[{"en":"I read a CSIS report on U.S.–China relations for my class.","zh":"我为课程阅读了一份关于中美关系的 CSIS 报告。"},{"en":"According to CSIS, cybersecurity is a growing national security concern.","zh":"根据 CSIS 的说法，网络安全是日益重要的国家安全问题。"}]},{"partOfSpeech":"n.","definition":{"en":"(Canada) Canadian Security Intelligence Service: Canada’s domestic intelligence agency, responsible for investigating threats to national security.","zh":"（加拿大）加拿大安全情报局：加拿大的国内情报机构，负责调查对国家安全的威胁。"},"examples":[{"en":"CSIS works with other agencies to monitor national security threats in Canada.","zh":"CSIS 与其他机构合作，监测加拿大的国家安全威胁。"},{"en":"The news article mentioned a CSIS investigation.","zh":"新闻文章提到了一项 CSIS 调查。"}]}],"synonyms":["think tank","intelligence agency","policy institute"],"phonetic":"/ˌsiː ɛs aɪ ˈɛs/","extraExplanation":["“CSIS”是缩写，通常按字母逐个读（C-S-I-S）。在国际新闻与学术文章中最常见的是美国智库“战略与国际研究中心”；在加拿大语境里则多指“加拿大安全情报局”。判断含义时可以看文章是否在谈“报告/研究”（多为智库）或“调查/情报执法”（多为情报机构）。"]}
{"word":"csk","summary":{"en":"CSK is most commonly the abbreviation for the cricket team Chennai Super Kings; it can also mean Customer Service Knowledge in some workplaces.","zh":"CSK 最常见指板球队 Chennai Super Kings；在一些职场语境中也可指 Customer Service Knowledge（客户服务知识/知识库）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Chennai Super Kings,” a professional cricket team in the Indian Premier League (IPL).","zh":"“Chennai Super Kings（钦奈超级国王队）”的缩写；印度超级联赛（IPL）的一支职业板球队。"},"examples":[{"en":"CSK won the IPL title again this season.","zh":"CSK 这个赛季又赢得了 IPL 冠军。"},{"en":"He’s a big CSK fan and never misses a match.","zh":"他是 CSK 的铁杆粉丝，从不错过比赛。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation used in workplaces or tech contexts for “Customer Service Knowledge,” meaning information or documents used to help support customers (usage varies by company).","zh":"在职场或技术语境中，“Customer Service Knowledge（客户服务知识/知识库内容）”的缩写；指用于支持客户的信息或文档（不同公司用法可能不同）。"},"examples":[{"en":"Please check the CSK article before replying to the customer.","zh":"回复客户前请先查看 CSK 知识库文章。"},{"en":"We need to update CSK so agents have the latest steps.","zh":"我们需要更新 CSK，这样客服人员就有最新的操作步骤。"}]}],"phonetic":"/ˌsiː ɛs ˈkeɪ/","extraExplanation":["“CSK”在不同语境里含义差异很大：如果你在看体育新闻、社交媒体或聊天里提到比赛，最常见通常是 IPL 球队 Chennai Super Kings。","作为字母缩写读法一般是逐个字母读：C-S-K（而不是读成一个单词）。"]}
{"word":"CSL","summary":{"en":"CSL is an abbreviation most commonly meaning “Chinese as a Second Language,” but it can also mean “(Community/College) Service Learning” or other terms depending on context.","zh":"CSL是缩写，最常见指“汉语作为第二语言”，也可能指“（社区/大学）服务学习”等，需结合语境判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abbreviation for “Chinese as a Second Language,” referring to learning/teaching Chinese for non-native speakers.","zh":"“Chinese as a Second Language（汉语作为第二语言）”的缩写，指面向非母语者的汉语学习与教学。"},"examples":[{"en":"She enrolled in a CSL program to improve her Mandarin.","zh":"她报名参加了CSL课程来提高普通话水平。"},{"en":"The university offers CSL classes for international students.","zh":"这所大学为国际学生开设CSL课程。"}]},{"partOfSpeech":"n.","definition":{"en":"an abbreviation used in some schools for “College/Community Service Learning,” courses that combine academic study with volunteering or community work.","zh":"在一些学校里，CSL可指“College/Community Service Learning（服务学习）”，把课程学习与志愿服务/社区实践结合起来。"},"examples":[{"en":"This CSL course requires 20 hours of community service.","zh":"这门CSL课程要求完成20小时的社区服务。"},{"en":"Through CSL, students apply what they learn in real community projects.","zh":"通过CSL，学生把课堂所学应用到真实的社区项目中。"}]},{"partOfSpeech":"n.","definition":{"en":"an abbreviation with other meanings depending on context (for example, a lab name, an organization, or a sports league).","zh":"在不同语境下也可能有其他含义（例如某个实验室名称、组织名称或体育联赛等）。"},"examples":[{"en":"What does CSL stand for in your company’s email?","zh":"在你们公司的邮件里，CSL代表什么？"}]}],"synonyms":["Chinese as a Second Language","Service Learning","Community Service Learning"],"phonetic":"/ˌsiː ɛs ˈɛl/","extraExplanation":["CSL是缩写，具体含义高度依赖场景：在语言教育领域常见为“汉语作为第二语言”；在北美高校里也常见为“服务学习（Service Learning）”。如果你告诉我出现它的句子或领域（学校、公司、游戏、课程大纲等），我可以帮你确定最准确的释义。"]}
{"word":"CSM","summary":{"en":"CSM is an abbreviation most commonly meaning Customer Success Manager, but it can also mean Certified ScrumMaster or (in U.S. Army contexts) Command Sergeant Major.","zh":"CSM 是缩写，最常见指“客户成功经理”，也可能指“认证 ScrumMaster”，或（在美国陆军语境中）指“总军士长”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Customer Success Manager: a person in a company (often software/tech) who helps customers use a product well, solve problems, and get value so they keep renewing.","zh":"客户成功经理：公司（常见于软件/科技行业）中负责帮助客户用好产品、解决问题、实现价值并促进续费的人。"},"examples":[{"en":"Our CSM scheduled a training session to help the team onboard quickly.","zh":"我们的 CSM 安排了一次培训，帮助团队快速上手。"},{"en":"If you have questions about your renewal, contact your CSM.","zh":"如果你对续费有疑问，请联系你的 CSM。"}]},{"partOfSpeech":"other","definition":{"en":"Certified ScrumMaster: a certification/title for someone trained in the Scrum framework who supports a Scrum Team and helps remove obstacles.","zh":"认证 ScrumMaster：指接受 Scrum 框架培训并获得认证的人/头衔，帮助团队运作并移除障碍。"},"examples":[{"en":"She became a CSM to better facilitate Scrum meetings.","zh":"她为了更好地主持 Scrum 会议而考取了 CSM。"},{"en":"The job post says CSM certification is preferred.","zh":"招聘信息写着优先考虑有 CSM 认证。"}]},{"partOfSpeech":"other","definition":{"en":"Command Sergeant Major: a senior enlisted rank/role in the U.S. Army who advises the commander and leads enlisted soldiers.","zh":"（美国陆军）总军士长：高级士官军衔/职位，负责为指挥官提供建议并领导士兵（士官与士兵）。"},"examples":[{"en":"The CSM addressed the unit about discipline and readiness.","zh":"总军士长对全体部队就纪律和战备情况进行了讲话。"},{"en":"He served as the battalion CSM for two years.","zh":"他担任营总军士长两年。"}]}],"synonyms":["Customer Success Manager","Certified ScrumMaster","Command Sergeant Major"],"phonetic":"/ˌsiː ɛs ˈɛm/","extraExplanation":["“CSM”最常见于职场与项目管理语境：科技行业里通常指 Customer Success Manager；敏捷/软件开发语境里常指 Certified ScrumMaster。军队语境（尤其美国陆军）才更可能指 Command Sergeant Major。看邮件签名、职位名称、讨论主题（续费/客户 vs. Scrum/敏捷 vs. 军衔/部队）通常就能判断。"]}
{"word":"CSMA","summary":{"en":"CSMA is a method that lets multiple devices share a network channel by listening first and transmitting only when the channel seems free.","zh":"CSMA 是一种让多台设备通过“先监听、再发送”来共享网络信道的通信方法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a networking method (a type of MAC protocol) where devices first listen to see if a shared communication channel is free (“carrier sense”) before sending data, so multiple devices can share the same medium more efficiently.","zh":"一种网络通信方法（介质访问控制协议的一种）：设备在发送数据前先监听共享信道是否空闲（“载波侦听”），从而让多个设备更高效地共享同一传输介质。"},"examples":[{"en":"Ethernet originally used CSMA to let many computers share one cable.","zh":"早期的以太网使用 CSMA，让多台电脑共享一根网线。"},{"en":"With CSMA, a device checks the channel before it transmits.","zh":"在 CSMA 中，设备会在发送前先检查信道是否空闲。"}]}],"synonyms":["Carrier Sense Multiple Access","MAC protocol","random access protocol"],"phonetic":"/ˌsiː ɛs ɛm ˈeɪ/","extraExplanation":["CSMA 是 “Carrier Sense Multiple Access” 的缩写，常见读法是按字母读。它是“先听后说”的思路：先侦听信道有没有人在用。","在以太网里经常会一起提到 CSMA/CD（Collision Detection，碰撞检测）：发送时如果检测到冲突就停止并重传；在 Wi‑Fi 里常见的是 CSMA/CA（Collision Avoidance，碰撞避免）：尽量在发送前通过等待、随机退避等方式减少冲突。","现代交换式以太网（家用路由器/交换机那种“每口一条线”）基本不再依赖共享介质上的 CSMA 机制，但在讲网络基础和历史时仍很重要。"]}
{"word":"CSMACA","summary":{"en":"CSMACA is an acronym/initialism; its meaning depends on context.","zh":"CSMACA 是一个首字母缩略词；具体含义需结合上下文判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An acronym/initialism (a word made from the first letters of other words). The exact meaning of “CSMACA” depends on the field or organization using it.","zh":"一个首字母缩略词/字母缩写（由多个词的首字母组成）。CSMACA 的具体含义取决于它所处的领域或组织。"},"examples":[{"en":"I saw “CSMACA” in a document, but it wasn’t defined anywhere.","zh":"我在一份文件里看到“CSMACA”，但哪里都没有解释它的意思。"},{"en":"What does CSMACA stand for in this context?","zh":"在这个语境里，CSMACA 代表什么？"}]}],"synonyms":["initialism","acronym","abbreviation"],"phonetic":"/ˌsiːˌɛsˌɛmˌeɪˌsiːˌeɪ/","extraExplanation":["“CSMACA”不是一个广为人知的通用英语单词，更像是某个机构、课程、证书、项目或内部系统的缩写。不同领域可能有不同展开方式。","为了帮你准确解释：你是在哪儿看到 CSMACA 的（学校/公司/论文/签证材料/软件界面等）？它前后一句话是什么？给我一点上下文我就能更精确地释义。"]}
{"word":"CSMACD","summary":{"en":"CSMACD is a platform-specific abbreviation for a customized MACD indicator; its exact meaning depends on the source.","zh":"CSMACD 通常指某个平台/作者自定义的 MACD 变体缩写；准确含义需看具体来源。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation used in some trading/technical-analysis platforms for a modified version of the MACD (Moving Average Convergence/Divergence) indicator; the exact settings or method can vary by software or author.","zh":"一些交易/技术分析平台中使用的缩写，指一种“改良版”的 MACD（指数平滑异同移动平均线）指标；具体算法与参数可能因软件或作者而不同。"},"examples":[{"en":"This strategy uses CSMACD to confirm trend direction before entering a trade.","zh":"这个策略用 CSMACD 在进场前确认趋势方向。"},{"en":"Check the indicator description—CSMACD may be calculated differently on different platforms.","zh":"看一下指标说明：不同平台上的 CSMACD 计算方式可能不同。"}]}],"synonyms":["MACD","moving average crossover indicator","technical indicator"],"phonetic":"/ˌsiː ɛs ˌɛm eɪ siː ˈdiː/","extraExplanation":["CSMACD 不是像 “MACD” 那样高度标准化的通用术语，更像是某个软件、指标作者或量化社区对 MACD 的“自定义变体”命名。常见的改动包括：对快慢均线做额外平滑、改变周期参数、加入过滤条件（如只在某种趋势下给信号）、或改变柱状图/信号线的生成方式。","如果你能提供它出现的平台（例如 TradingView 指标名称、某个脚本链接、券商软件截图或公式），我可以帮你准确解释它的计算公式、信号含义以及如何解读。"]}
{"word":"csmp","summary":{"en":"CSMP is an acronym (initialism). Its meaning depends on context; one common technical expansion is “Cyclic Static Memory Partitioning.”","zh":"CSMP 是首字母缩写，具体含义取决于上下文；在技术领域较常见的一种解释是“Cyclic Static Memory Partitioning（循环静态内存分区）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation that can stand for different things depending on the field (it is not a common standalone English word). Most often, it is used as initials for an organization, a course/program name, or a technical term.","zh":"一个缩写，含义取决于具体领域（它不是常见的独立英文单词）。多用于机构名称、课程/项目名称或技术术语的首字母缩写。"},"examples":[{"en":"I saw “CSMP” in the document, but the meaning wasn’t explained.","zh":"我在文件里看到“CSMP”，但没有解释它的含义。"},{"en":"In emails, people sometimes write CSMP as an abbreviation for a specific program or department.","zh":"在邮件里，人们有时用 CSMP 作为某个项目或部门的缩写。"}]},{"partOfSpeech":"other","definition":{"en":"(Computing/engineering, common) Cyclic Static Memory Partitioning: a technique used in some systems to manage memory efficiently by repeating fixed memory patterns.","zh":"（计算机/工程领域，较常见）Cyclic Static Memory Partitioning：一种在某些系统中用于高效管理内存的技术，通过周期性重复固定的内存分区模式来实现。"},"examples":[{"en":"The paper compares CSMP with other memory allocation methods.","zh":"这篇论文将 CSMP 与其他内存分配方法进行比较。"},{"en":"CSMP can reduce overhead when the workload pattern repeats regularly.","zh":"当工作负载模式规律重复时，CSMP 可以降低系统开销。"}]}],"synonyms":["initialism","acronym","abbreviation"],"phonetic":"/ˌsiːˌɛsˌɛmˈpiː/","extraExplanation":["“CSMP”属于首字母缩写，单独看很难确定唯一含义。你如果告诉我它出现的场景（例如：公司/学校、计算机论文、网络安全、医疗、项目管理等），我可以给出最准确的释义与更贴切的例句。","读法通常是逐个字母读：C-S-M-P（不是一个按拼读规则发音的单词）。"]}
{"word":"CSN","summary":{"en":"CSN is an acronym most commonly referring to Crosby, Stills & Nash, but it can also mean College of Southern Nevada or Customer Service Number depending on context.","zh":"CSN 是一个缩写，最常见指乐队 Crosby, Stills & Nash；也可能指内华达南方学院或客服号码，需看语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(acronyism) The American folk-rock supergroup Crosby, Stills & Nash (often written as CSN).","zh":"（缩写）美国民谣摇滚超级组合 Crosby, Stills & Nash（常写作 CSN）。"},"examples":[{"en":"My dad still listens to CSN on vinyl.","zh":"我爸爸现在还会用黑胶听 CSN。"},{"en":"“Suite: Judy Blue Eyes” is a classic CSN track.","zh":"《Suite: Judy Blue Eyes》是 CSN 的经典曲目。"}]},{"partOfSpeech":"other","definition":{"en":"(acronym) College of Southern Nevada, a public community college in Nevada, USA.","zh":"（缩写）内华达南方学院（College of Southern Nevada），美国内华达州的一所公立社区学院。"},"examples":[{"en":"She’s taking nursing prerequisites at CSN.","zh":"她正在 CSN 上护理专业的先修课。"},{"en":"I applied to CSN for the fall semester.","zh":"我申请了 CSN 的秋季学期。"}]},{"partOfSpeech":"other","definition":{"en":"(business) Customer Service Number (a phone number used to reach customer support).","zh":"（商业）客服号码（Customer Service Number，用于联系客户支持的电话号码）。"},"examples":[{"en":"If your package is missing, call the CSN on the receipt.","zh":"如果你的包裹丢了，就打收据上的客服号码（CSN）。"},{"en":"The website lists a CSN for billing questions.","zh":"网站上列出了一个处理账单问题的客服号码（CSN）。"}]}],"synonyms":["Crosby, Stills & Nash (CSN)","College of Southern Nevada (CSN)","Customer Service Number (CSN)"],"phonetic":"/ˌsiːˌɛsˈɛn/","extraExplanation":["CSN 是一个常见缩写，具体含义高度依赖语境：音乐聊天里更可能指乐队 Crosby, Stills & Nash；学校/地区语境里可能指 College of Southern Nevada；客服/订单场景里可能指 Customer Service Number。遇到缩写不确定时，可以补问：它出现在什么文件、哪个领域或哪个句子里？"]}
{"word":"CSNET","summary":{"en":"CSNET is short for Computer Science Network, an early academic network that connected U.S. universities and influenced the development of the Internet.","zh":"CSNET是Computer Science Network的缩写，指早期连接美国高校的学术网络，对互联网的发展产生了影响。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(acronym) Computer Science Network: an early U.S. academic computer network (1980s) that connected university and research computer science departments and helped pave the way for today’s Internet.","zh":"（缩写）Computer Science Network（计算机科学网络）：美国1980年代早期的学术计算机网络，用于连接高校与科研机构的计算机科学部门，被视为互联网发展的重要铺垫之一。"},"examples":[{"en":"CSNET helped computer science researchers share email and files across universities in the early 1980s.","zh":"在1980年代早期，CSNET帮助计算机科学研究人员在不同大学之间共享电子邮件和文件。"},{"en":"Before NSFNET became widespread, many departments relied on CSNET for network access.","zh":"在NSFNET广泛普及之前，许多院系依赖CSNET来获得网络连接。"}]}],"synonyms":["ARPANET","NSFNET","BITNET"],"phonetic":"/ˌsiːˈɛsˌnɛt/","extraExplanation":["CSNET通常读作字母加“net”（类似“C-S-net”）。它在1981年前后启动，由美国国家科学基金会（NSF）等支持，主要服务学术界的计算机科学社群。","在当时并不是所有学校都能直接接入ARPANET；CSNET通过更开放的接入方式（包括与电话拨号、邮件网关等技术结合）让更多大学能进行跨校通信。","从历史脉络看，CSNET与ARPANET、BITNET、NSFNET等一起构成了“互联网前史”中关键的学术网络体系。"]}
{"word":"csnet","summary":{"en":"CSNET is the Computer Science Network—an early academic network that helped spread email and networking in U.S. universities.","zh":"CSNET指“计算机科学网络”，是早期学术网络之一，促进了美国高校电子邮件与联网的普及。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A early U.S. academic computer network (Computer Science Network) that connected university computer science departments and helped expand access to email and networking beyond ARPANET in the 1980s.","zh":"美国早期的学术计算机网络（Computer Science Network，计算机科学网络），在20世纪80年代连接大学计算机系，推动电子邮件与联网从ARPANET扩展到更多高校与研究机构。"},"examples":[{"en":"In the early 1980s, some universities joined CSNET to get reliable academic email connectivity.","zh":"在20世纪80年代初，一些大学加入CSNET，以获得可靠的学术电子邮件连接。"},{"en":"CSNET played an important role in the growth of networking in U.S. higher education.","zh":"CSNET在美国高等教育网络的发展中发挥了重要作用。"}]}],"synonyms":["Computer Science Network"],"phonetic":"/ˌsiːˈɛsˌnɛt/","extraExplanation":["CSNET常被理解为“Computer Science Network”的缩写，读作字母：C-S-NET。它起源于将更多计算机系（不一定能直接接入ARPANET的单位）连接起来的需求，是互联网发展史中从军方/少数研究网络走向更广泛学术网络的重要一步。","在阅读网络史资料时，CSNET常与ARPANET、NSFNET等并列出现：ARPANET更早、更偏研究/军方背景；NSFNET后来成为更大规模的学术骨干网络；CSNET则起到过渡与扩展的作用。"]}
{"word":"CSO","summary":{"en":"CSO is an abbreviation that most often means Chief Security Officer, but it can also mean Chief Strategy Officer, Chief Sales Officer, Customer Service Officer, or civil society organization depending on context.","zh":"CSO是一个缩写，最常见指首席安全官，但也可能指首席战略官、首席销售官、客户服务人员/主管或公民社会组织，需结合语境判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abbreviation for a senior executive title, most commonly Chief Security Officer (head of an organization’s security)","zh":"常见缩写，指一种高管头衔，最常见为“首席安全官”（负责组织的安全事务）"},"examples":[{"en":"The CSO presented the new cybersecurity plan to the board.","zh":"首席安全官向董事会展示了新的网络安全计划。"},{"en":"If there’s a data breach, the CSO leads the response with IT and legal teams.","zh":"如果发生数据泄露，首席安全官会与IT和法务团队一起领导应对。"}]},{"partOfSpeech":"n.","definition":{"en":"an abbreviation for other executive titles, especially Chief Strategy Officer (responsible for long-term strategy)","zh":"也可指其他高管头衔，尤其是“首席战略官”（负责长期战略）"},"examples":[{"en":"Our CSO is focused on expansion in Asia over the next three years.","zh":"我们的首席战略官专注于未来三年在亚洲扩张。"},{"en":"The CEO and CSO met to review the company’s growth strategy.","zh":"CEO和首席战略官开会审查公司的增长战略。"}]},{"partOfSpeech":"n.","definition":{"en":"an abbreviation used in some organizations for Chief Sales Officer (leads sales) or Customer Service Officer (handles customer service)","zh":"在部分机构中也可指“首席销售官”（负责销售）或“客户服务专员/主管”（处理客服）"},"examples":[{"en":"The CSO set ambitious sales targets for the quarter.","zh":"首席销售官为本季度设定了雄心勃勃的销售目标。"},{"en":"Please contact the CSO if you have questions about your account.","zh":"如对账户有疑问，请联系客户服务人员（CSO）。"}]},{"partOfSpeech":"n.","definition":{"en":"in public policy and NGOs, an abbreviation for civil society organization","zh":"在公共政策与非政府领域中，指“公民社会组织”"},"examples":[{"en":"Several CSOs joined the discussion on climate policy.","zh":"多家公民社会组织参与了气候政策讨论。"},{"en":"The report was written with input from local CSOs.","zh":"这份报告吸收了本地公民社会组织的意见。"}]}],"synonyms":["Chief Security Officer","Chief Strategy Officer","Chief Sales Officer","Customer Service Officer","civil society organization"],"phonetic":"/ˌsiː ɛs ˈoʊ/","extraExplanation":["“CSO”通常按字母读作“C-S-O”。具体指哪一种，要看行业语境：科技/信息安全场景多指Chief Security Officer；公司治理与规划场景常指Chief Strategy Officer；销售团队里可能是Chief Sales Officer；政府/国际组织文件中常见civil society organization。遇到不确定时，可在邮件里写全称第一次出现（例如：Chief Security Officer (CSO)）。"]}
{"word":"CSOC","summary":{"en":"CSOC most commonly means “Cybersecurity Operations Center,” a group that monitors and responds to cyber threats; in some contexts it can mean a customer service/support operations center.","zh":"CSOC 最常见指“网络安全运营中心”，负责监控并响应网络威胁；在某些语境中也可指客户服务/支持运营中心。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Acronym) Cybersecurity Operations Center: a team or facility that continuously monitors an organization’s networks and systems to detect, investigate, and respond to cyber threats.","zh":"（缩写）网络安全运营中心：负责 24/7 监控组织的网络与系统、发现并分析安全事件、并进行响应处置的团队或机构。"},"examples":[{"en":"Our company’s CSOC flagged suspicious login attempts and blocked the account.","zh":"我们公司的 CSOC 标记了可疑的登录尝试，并封禁了该账户。"},{"en":"After the phishing attack, the CSOC led the incident response and wrote a report.","zh":"钓鱼攻击发生后，CSOC 牵头进行事件响应并撰写了报告。"}]},{"partOfSpeech":"n.","definition":{"en":"(Acronym, less common) Customer Service Operations Center / Customer Support Operations Center: a centralized team that manages customer support workflows, staffing, and service quality.","zh":"（缩写，较少见）客户服务运营中心/客户支持运营中心：集中管理客服流程、排班与服务质量的团队或部门。"},"examples":[{"en":"The CSOC updated the ticketing rules to reduce response time.","zh":"CSOC 更新了工单规则以缩短响应时间。"},{"en":"Please contact the CSOC if you have an urgent support escalation.","zh":"如需紧急升级支持，请联系 CSOC。"}]}],"synonyms":["SOC (Security Operations Center)","Cyber SOC","Security operations center"],"phonetic":"/ˌsiːˌɛsˌoʊˈsiː/","extraExplanation":["CSOC 在不同公司/行业里含义可能不同。科技与安全领域里更常指 “Cybersecurity Operations Center”，相当于在 SOC（Security Operations Center，安全运营中心）前面加上 C（Cyber）。判断含义时可看上下文是否提到 threat/incident/alert（威胁/事件/告警）或 customer/ticket/support（客户/工单/支持）。"]}
{"word":"CSP","summary":{"en":"CSP is an acronym that commonly means Content Security Policy (web security), Cloud Service Provider (cloud computing), Certified Scrum Professional (Agile certification), or Communicating Sequential Processes (concurrency model).","zh":"CSP 是一个缩写，常见含义包括：内容安全策略（网页安全）、云服务提供商（云计算）、认证 Scrum 专家（敏捷认证）以及通信顺序进程（并发模型）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Content Security Policy: a web security standard that helps prevent attacks like cross-site scripting (XSS) by controlling which sources of content (scripts, images, etc.) a browser is allowed to load.","zh":"内容安全策略（Content Security Policy）：一种网页安全标准，通过限制浏览器允许加载的内容来源（脚本、图片等）来帮助防止跨站脚本（XSS）等攻击。"},"examples":[{"en":"We added a strict CSP to block unsafe inline scripts.","zh":"我们添加了严格的 CSP 来阻止不安全的内联脚本。"},{"en":"The browser refused to load the script because of the site’s CSP.","zh":"由于网站的 CSP，浏览器拒绝加载该脚本。"}]},{"partOfSpeech":"other","definition":{"en":"Cloud Service Provider: a company that offers cloud computing services such as storage, servers, or databases.","zh":"云服务提供商（Cloud Service Provider）：提供云计算服务（如存储、服务器或数据库）的公司。"},"examples":[{"en":"Our CSP hosts the database in a US data center.","zh":"我们的 CSP 在美国的数据中心托管数据库。"},{"en":"Before switching CSPs, compare pricing and security features.","zh":"在更换 CSP 之前，先比较价格和安全功能。"}]},{"partOfSpeech":"other","definition":{"en":"Certified Scrum Professional: an advanced certification for experienced Scrum practitioners (commonly used in Agile project management).","zh":"认证 Scrum 专家（Certified Scrum Professional）：面向有经验的 Scrum 从业者的高级认证（常用于敏捷项目管理）。"},"examples":[{"en":"She became a CSP after several years as a Scrum Master.","zh":"她担任 Scrum Master 多年后获得了 CSP 认证。"},{"en":"Some companies list CSP as a preferred qualification for Agile roles.","zh":"一些公司会把 CSP 列为敏捷岗位的优先条件。"}]},{"partOfSpeech":"other","definition":{"en":"Communicating Sequential Processes: a theory/model in computer science for describing concurrent systems and communication between processes.","zh":"通信顺序进程（Communicating Sequential Processes）：计算机科学中的一种理论/模型，用于描述并发系统以及进程间通信。"},"examples":[{"en":"The course introduces CSP to explain how concurrent programs communicate safely.","zh":"这门课用 CSP 来解释并发程序如何安全地通信。"}]}],"synonyms":["acronym","initialism"],"phonetic":"/ˌsiː ˌɛs ˈpiː/","extraExplanation":["“CSP”是高度依赖语境的缩写。在网页/浏览器报错或安全头（HTTP header）里，几乎总是指 Content Security Policy；在云计算采购或架构讨论里更常指 Cloud Service Provider；在敏捷/项目管理招聘或证书里常指 Certified Scrum Professional；在计算机理论或并发编程课程/论文里可能指 Communicating Sequential Processes。","读到“CSP”时可以用线索快速判断：出现“script-src、default-src、nonce、XSS”等词→多半是安全策略；出现“AWS/Azure/GCP、region、SLA、data center”等→多半是云服务商；出现“Scrum Master、Agile、certification”等→多半是敏捷认证。"]}
{"word":"csp","summary":{"en":"CSP is an abbreviation with several meanings; most commonly it refers to Content Security Policy in web security.","zh":"CSP 是一个多义缩写；最常见的含义是在网页安全中指“内容安全策略”（Content Security Policy）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Content Security Policy: a web security standard that helps prevent attacks (like XSS) by controlling which sources a webpage is allowed to load scripts, images, styles, etc. from.","zh":"内容安全策略：一种网页安全标准，通过限制网页可加载脚本、图片、样式等资源的来源来帮助防止攻击（如 XSS）。"},"examples":[{"en":"We added a CSP header to block inline scripts.","zh":"我们添加了 CSP 头来阻止内联脚本。"},{"en":"A strict CSP can reduce the risk of cross-site scripting.","zh":"严格的 CSP 可以降低跨站脚本攻击的风险。"}]},{"partOfSpeech":"other","definition":{"en":"Certified Safety Professional: a professional certification for people working in workplace safety and health.","zh":"注册安全工程师/安全专业认证：面向从事职业安全与健康工作的人员的一种专业认证（具体名称因地区而异）。"},"examples":[{"en":"She earned her CSP to advance her career in safety management.","zh":"她获得了 CSP 认证，以在安全管理领域发展职业。"}]},{"partOfSpeech":"other","definition":{"en":"Cloud Service Provider: a company that provides cloud computing services (such as servers, storage, and databases).","zh":"云服务提供商：提供云计算服务（如服务器、存储、数据库等）的公司。"},"examples":[{"en":"Our CSP offers data storage in multiple regions.","zh":"我们的云服务提供商在多个地区提供数据存储。"}]}],"synonyms":["(for Content Security Policy) security header","(for Cloud Service Provider) cloud provider"],"phonetic":"/ˌsiː ɛs ˈpiː/","extraExplanation":["“CSP”最常见于技术语境，尤其是前端/网络安全里的 Content Security Policy。它通常以 HTTP 响应头或 HTML 标签形式出现，例如：Content-Security-Policy: ...","由于是缩写，它的具体含义高度依赖上下文（公司、行业、对话主题）。如果你告诉我你在哪看到它（例如浏览器报错、课程、工作文件），我可以帮你精确解释。"]}
{"word":"CSPAN","summary":{"en":"C-SPAN is a U.S. TV network known for live, largely unedited coverage of Congress and public affairs.","zh":"C-SPAN 是美国电视网络，以对国会与公共事务的直播、较少剪辑的报道风格而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a U.S. public service TV network that broadcasts government proceedings and political events, especially live coverage of Congress, hearings, speeches, and policy discussions.","zh":"美国的公共服务电视网络，主要播出政府运作与政治事件，尤其是对国会会议、听证会、演讲与政策讨论的直播与录播。"},"examples":[{"en":"I watched the Senate hearing on C-SPAN.","zh":"我在 C-SPAN 上看了参议院听证会。"},{"en":"C-SPAN often shows long, unedited speeches and debates.","zh":"C-SPAN 经常播出较长、未经剪辑的演讲与辩论。"},{"en":"If you want to follow U.S. politics closely, C-SPAN is a useful source.","zh":"如果你想更密切地关注美国政治，C-SPAN 是个很有用的来源。"}]}],"synonyms":["Cable-Satellite Public Affairs Network","C-Span"],"phonetic":"/ˈsiː spæn/","extraExplanation":["C-SPAN 是 “Cable-Satellite Public Affairs Network” 的缩写，常写作 C‑SPAN 或 C-SPAN。它以“尽量少解说、少剪辑”的直播风格著称，让观众直接看到政府运作过程。","在美国文化语境里，说“on C-SPAN”通常暗示内容偏正式、偏政治、信息量大但节奏较慢，常见于国会辩论、听证会、总统或官员讲话等场景。"]}
{"word":"CSR","summary":{"en":"CSR most commonly means corporate social responsibility, but it can also mean customer service representative or certificate signing request depending on context.","zh":"CSR最常见指“企业社会责任”，也可能指“客服代表”或“证书签名请求”，需根据语境判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"corporate social responsibility: a company’s efforts to act ethically and contribute positively to society and the environment, beyond making profits.","zh":"企业社会责任：公司在追求利润之外，采取道德经营并对社会与环境做出积极贡献的实践与理念。"},"examples":[{"en":"The company publishes a CSR report every year to show its environmental and community efforts.","zh":"这家公司每年发布CSR报告，展示其在环保和社区方面的努力。"},{"en":"Strong CSR policies can improve a brand’s reputation and employee morale.","zh":"良好的CSR政策可以提升品牌声誉与员工士气。"}]},{"partOfSpeech":"n.","definition":{"en":"customer service representative: a person whose job is to help customers with questions, orders, or problems (often in retail or call centers).","zh":"客服代表：负责解答客户问题、处理订单或解决投诉等的工作人员（常见于零售或呼叫中心）。"},"examples":[{"en":"Please contact a CSR if you need to change your shipping address.","zh":"如果你需要更改收货地址，请联系一位客服代表（CSR）。"},{"en":"The CSR apologized and offered a refund for the delayed delivery.","zh":"客服代表（CSR）道歉并对延迟送达提供了退款。"}]},{"partOfSpeech":"n.","definition":{"en":"certificate signing request: a file sent to a certificate authority to apply for an SSL/TLS certificate (used in web security).","zh":"证书签名请求：向证书颁发机构提交、用于申请SSL/TLS证书的文件（用于网站安全）。"},"examples":[{"en":"Generate a CSR before you request an SSL certificate for your website.","zh":"在为网站申请SSL证书之前，先生成CSR（证书签名请求）。"},{"en":"The admin submitted the CSR to the certificate authority.","zh":"管理员把CSR提交给了证书颁发机构。"}]}],"synonyms":["corporate responsibility","business responsibility","sustainability (related)","customer support agent (for customer service representative)"],"phonetic":"ˌsiː ɛs ˈɑːr","extraExplanation":["“CSR”是缩写，具体含义高度依赖语境。商业新闻/ESG话题里，最常见是“企业社会责任”；在电商、客服系统、工单里常指“客服代表”；在IT/网络安全文档里常指“证书签名请求”。","书写上可见“CSR report（企业社会责任报告）”“CSR team（企业社会责任团队）”“talk to a CSR（联系一位客服）”“create/generate a CSR（生成证书签名请求）”。首次在正式写作中使用时，建议先写全称再写缩写（例如：corporate social responsibility (CSR)）。"]}
{"word":"CSRG","summary":{"en":"CSRG is an acronym with multiple possible meanings; its exact expansion depends on context (often “Computer Security Research Group” or “Corporate Social Responsibility Group”).","zh":"CSRG 是一个可能有多种展开形式的缩写；具体含义取决于上下文（常见为“计算机安全研究组”或“企业社会责任小组/部门”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An acronym/initialism for several different organizations or terms; the exact meaning depends on the context (e.g., business, academia, government).","zh":"一个缩写/首字母缩略词；具体含义取决于使用场景（如商业、学术、政府等）。"},"examples":[{"en":"What does CSRG stand for in this document?","zh":"在这份文件里，CSRG 代表什么？"},{"en":"CSRG can mean different things, so please share the full name or a sentence around it.","zh":"CSRG 可能有多种含义，请提供全称或它所在的句子。"}]},{"partOfSpeech":"other","definition":{"en":"(Common in tech) Computer Security Research Group: a team or lab focused on cybersecurity research.","zh":"（科技领域常见）Computer Security Research Group：专注于网络安全研究的团队或实验室。"},"examples":[{"en":"She joined the CSRG to study malware detection.","zh":"她加入了 CSRG 研究恶意软件检测。"},{"en":"The CSRG published a new report on secure authentication.","zh":"CSRG 发布了一份关于安全认证的新报告。"}]},{"partOfSpeech":"other","definition":{"en":"(Common in business) Corporate Social Responsibility Group: a department that manages a company’s social and environmental responsibility efforts.","zh":"（商业领域常见）Corporate Social Responsibility Group：负责企业社会与环境责任项目的部门/小组。"},"examples":[{"en":"The CSRG organized a volunteer day for employees.","zh":"CSRG 组织了一次员工志愿者活动日。"},{"en":"Talk to the CSRG about sustainability goals.","zh":"关于可持续发展目标可以咨询 CSRG。"}]}],"synonyms":["initialism","acronym"],"phonetic":"/siː ɛs ɑːr dʒiː/","extraExplanation":["CSRG 不是固定词义的“单词”，更像缩写。要准确解释，最有效的方法是看它出现的领域与上下文：它在公司公告里更可能指“企业社会责任小组”，在论文/实验室网页里更可能指“计算机安全研究组”。","如果你把 CSRG 出现的完整句子贴出来（或告诉我来源：学校/公司/网站/国家地区），我可以帮你判断最可能的展开形式与中文译法。"]}
{"word":"CSRI","summary":{"en":"CSRI is an abbreviation; most commonly it refers to the Corporate Social Responsibility Index, and in some job titles it can mean Customer Service Representative I (level 1).","zh":"CSRI 是一个缩写；最常见指“企业社会责任指数”，在部分岗位名称中也可指“客户服务代表一级（初级）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation (initialism) often used for Corporate Social Responsibility Index (a metric that ranks or scores a company’s performance in social responsibility/ESG-related areas).","zh":"常见缩写（字母词），常指“企业社会责任指数”（用于对企业在社会责任/ESG 等方面的表现进行评分或排名的指标）。"},"examples":[{"en":"The report compares the CSRI scores of major tech companies.","zh":"这份报告比较了各大科技公司的 CSRI 评分。"},{"en":"Our goal is to improve our CSRI ranking by strengthening labor and environmental policies.","zh":"我们的目标是通过加强劳工与环保政策来提升 CSRI 排名。"}]},{"partOfSpeech":"other","definition":{"en":"in some workplaces, an abbreviation for Customer Service Representative I (an entry-level customer service job title; “I” means level 1).","zh":"在一些职场语境中，可指 Customer Service Representative I（客户服务代表一级/初级岗位；“I”表示第一级）。"},"examples":[{"en":"She was hired as a CSRI and later promoted to CSRII.","zh":"她以 CSRI（客服代表一级）的岗位入职，后来晋升为 CSRII。"},{"en":"The CSRI handles basic inquiries and routes complex cases to specialists.","zh":"CSRI 负责基础咨询，并把复杂问题转交给专员处理。"}]}],"synonyms":["CSR index","ESG rating (related)","CSR I (job-title variant)"],"phonetic":"/ˌsiː ɛs ɑːr ˈaɪ/","extraExplanation":["CSRI 是缩写，具体含义高度依赖领域（商业/ESG、HR 职级、科研项目等都可能用到）。如果你告诉我出处（例如论文、职位描述、报告标题或一句原文），我可以帮你锁定最准确的释义与用法。"]}
{"word":"CSRS","summary":{"en":"CSRS most commonly means the U.S. Civil Service Retirement System, a federal employee pension plan (mainly for those hired before 1984).","zh":"CSRS最常指美国“联邦文职人员退休制度”，是一套联邦雇员养老金计划（主要覆盖1984年前入职者）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Civil Service Retirement System, a U.S. federal government pension program for many civilian employees hired before 1984","zh":"（美国）联邦文职人员退休制度（Civil Service Retirement System），主要适用于1984年之前入职的许多联邦文职雇员的养老金体系"},"examples":[{"en":"My grandmother retired under CSRS after working for the federal government for 30 years.","zh":"我奶奶在联邦政府工作了30年后，按CSRS制度退休。"},{"en":"CSRS employees typically do not pay into Social Security for that federal job.","zh":"CSRS雇员通常不会为那份联邦工作缴纳（或参加）社会保障（Social Security）。"},{"en":"The HR office explained the differences between CSRS and FERS during onboarding.","zh":"人力资源部门在入职培训时解释了CSRS和FERS的区别。"}]}],"synonyms":["Civil Service Retirement System"],"phonetic":"siː ɛs ɑːr ɛs","extraExplanation":["CSRS在美国职场语境里几乎总是指“Civil Service Retirement System（联邦文职人员退休制度）”，常见于联邦机构的人事文件、福利说明、退休计划选择等。","与FERS（Federal Employees Retirement System）相比，CSRS通常被认为是“较老的一套制度”，覆盖范围主要是1984年前入职者；很多后入职员工一般在FERS体系下。","读法上在口语里通常按字母逐个念：C-S-R-S。写作时常直接用缩写“CSRS”，正式文件也会先写全称再括号标注缩写。"]}
{"word":"CSS","summary":{"en":"CSS (Cascading Style Sheets) is used to style and lay out web pages.","zh":"CSS（层叠样式表）用于设置网页的样式与布局。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Cascading Style Sheets: a language used to control how web pages look (layout, colors, fonts, spacing), usually used with HTML.","zh":"层叠样式表：一种用来控制网页外观（布局、颜色、字体、间距等）的语言，通常与 HTML 一起使用。"},"examples":[{"en":"I used CSS to change the font size and color of the headings.","zh":"我用 CSS 改了标题的字体大小和颜色。"},{"en":"The HTML adds the content, and the CSS controls the design.","zh":"HTML 负责内容，CSS 负责样式设计。"},{"en":"This website looks clean because its CSS is well organized.","zh":"这个网站看起来很清爽，因为它的 CSS 写得很有条理。"}]}],"synonyms":["style sheet","web styling","Cascading Style Sheets"],"phonetic":"ˌsiː ˌɛs ˈɛs","extraExplanation":["CSS 是缩写，读作三个字母：C-S-S。全称 Cascading Style Sheets，其中 cascading（层叠）强调“样式会按优先级叠加覆盖”：比如更具体的选择器、后写的规则、或带 !important 的规则可能会覆盖其他规则。","常见写法是把 CSS 写在单独的 .css 文件里，然后在 HTML 里用 <link> 引入；也可以写在 <style> 标签中或写成行内样式（一般不推荐大量使用）。","在日常学习中，经常会一起出现的相关概念有：selector（选择器）、property（属性）、value（值）、class、id、responsive design（响应式设计）、Flexbox、Grid。"]}
{"word":"CST","summary":{"en":"CST is an abbreviation most commonly meaning Central Standard Time (North America) or China Standard Time (UTC+8); it can also mean Certified Surgical Technologist.","zh":"CST 是一个缩写，最常指（北美）中部标准时间或（中国）标准时间（UTC+8）；也可指“认证外科手术技师”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Central Standard Time: the time zone used in parts of the United States and Canada (UTC−6; UTC−5 during daylight saving time in many places).","zh":"（北美）中部标准时间：美国和加拿大部分地区使用的时区（协调世界时 UTC−6；许多地区实行夏令时时为 UTC−5）。"},"examples":[{"en":"The meeting is at 3:00 p.m. CST.","zh":"会议在下午3点（CST）举行。"},{"en":"Please convert 9 a.m. CST to your local time.","zh":"请把上午9点（CST）换算成你当地时间。"}]},{"partOfSpeech":"other","definition":{"en":"China Standard Time: the official time used in China (UTC+8).","zh":"（中国）标准时间：中华人民共和国全国统一使用的时间（UTC+8）。"},"examples":[{"en":"Our office hours are 9 a.m.–6 p.m. CST (China).","zh":"我们的办公时间是中国标准时间上午9点到下午6点。"},{"en":"The livestream starts at 8 p.m. CST (UTC+8).","zh":"直播将于中国标准时间晚上8点（UTC+8）开始。"}]},{"partOfSpeech":"other","definition":{"en":"Certified Surgical Technologist: a professional certification/title for people who assist in surgical operations (especially in the U.S.).","zh":"注册/认证外科手术技师：在手术中协助医生的专业人员认证/头衔（尤指美国）。"},"examples":[{"en":"She works as a CST in the operating room.","zh":"她在手术室担任CST（外科手术技师）。"},{"en":"He’s studying for the CST exam.","zh":"他正在准备CST考试。"}]}],"synonyms":["CT (for Central Time, in some contexts)"],"phonetic":"/ˌsiː ɛs ˈtiː/","extraExplanation":["“CST”最常见的歧义来自“时区”：北美的 Central Standard Time（UTC−6）和中国的 China Standard Time（UTC+8）缩写完全相同。写作时常用补充方式避免误会，例如写成 “CST (US)” / “CST (China)” 或直接写 “UTC−6” / “UTC+8”。","在国际沟通中，北美中部时间也常写作 “CT”（Central Time），并根据是否夏令时用 “CST/CDT” 区分；如果不确定对方是否实行夏令时，写 UTC 偏移最清楚。"]}
{"word":"cst","summary":{"en":"“CST” is an abbreviation most commonly used for time zones (Central Standard Time or China Standard Time); it can also mean certain professional certifications depending on context.","zh":"“CST”常见是时区缩写（美国中部标准时间或中国标准时间）；也可能在特定语境中表示某些职业证书/头衔。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Central Standard Time (time zone), usually UTC−6; used in parts of the U.S., Canada, and Mexico (often written as “CST”).","zh":"（时区）美国中部标准时间，通常为 UTC−6；用于美国、加拿大和墨西哥部分地区（常写作 “CST”）。"},"examples":[{"en":"The meeting is at 3 p.m. CST.","zh":"会议时间是中部标准时间下午三点（CST）。"},{"en":"Please convert 9 a.m. CST to your local time.","zh":"请把中部标准时间上午九点（CST）换算成你当地时间。"}]},{"partOfSpeech":"other","definition":{"en":"China Standard Time (time zone), UTC+8; the official time used across mainland China (also written as “CST,” though “China Standard Time” is often clarified to avoid confusion).","zh":"（时区）中国标准时间，UTC+8；中国大陆通用的官方时间（也可写作 “CST”，但常会注明以免与美国中部时间混淆）。"},"examples":[{"en":"Our China office works on CST (UTC+8).","zh":"我们中国办公室使用中国标准时间（CST，UTC+8）。"},{"en":"The livestream starts at 8 p.m. CST (China Standard Time).","zh":"直播将在晚上八点开始（CST，中国标准时间）。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation for a title or certification in some fields (for example, “Certified Surgical Technologist”). The exact meaning depends on the context (medicine, jobs, resumes, etc.).","zh":"在某些领域中用作头衔或证书的缩写（例如“认证外科技术员”Certified Surgical Technologist）。具体含义取决于语境（医疗、招聘、简历等）。"},"examples":[{"en":"She is a CST in the operating room.","zh":"她在手术室担任认证外科技术员（CST）。"},{"en":"The job listing prefers candidates with a CST credential.","zh":"该招聘信息优先考虑持有 CST 证书的候选人。"}]}],"synonyms":["Central Standard Time","China Standard Time","UTC−6","UTC+8"],"phonetic":"/siː ɛs tiː/","extraExplanation":["“CST”最容易引起误解的是时区含义：同样三个字母，在北美常指 Central Standard Time（UTC−6），在中文语境里也可能指 China Standard Time（UTC+8）。写作时建议加上城市/国家或 UTC 偏移量，例如 “CST (UTC−6)” 或 “China Standard Time (UTC+8)”。"]}
{"word":"CSTC","summary":{"en":"CSTC is an initialism with multiple possible meanings; you must use surrounding context to know what it refers to.","zh":"CSTC 是一个可能有多种含义的首字母缩写，需要结合上下文才能确定具体指什么。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation (initialism) that can stand for different organizations or departments; the exact meaning depends on the context.","zh":"一个缩写（首字母缩略词），可能代表不同的机构或部门；具体含义取决于语境。"},"examples":[{"en":"What does CSTC stand for in this document?","zh":"在这份文件里，CSTC 代表什么？"},{"en":"Please spell out CSTC the first time you use it in your report.","zh":"请在报告中第一次使用 CSTC 时写出全称。"}]},{"partOfSpeech":"other","definition":{"en":"Canadian Society for Technical Communication (a professional association related to technical communication).","zh":"加拿大技术传播协会（与技术写作/技术传播相关的专业组织）。"},"examples":[{"en":"She joined CSTC to meet other technical communicators.","zh":"她加入了 CSTC 来结识其他技术传播从业者。"},{"en":"CSTC hosted a webinar on clear documentation.","zh":"CSTC 举办了一场关于清晰文档写作的网络讲座。"}]},{"partOfSpeech":"other","definition":{"en":"Customer Service and Technical Support Center (a common internal department name in companies).","zh":"客户服务与技术支持中心（公司内部部门名称的一种常见用法）。"},"examples":[{"en":"If the app crashes, contact CSTC for technical support.","zh":"如果应用崩溃了，请联系 CSTC 获取技术支持。"},{"en":"Your ticket has been forwarded to CSTC for review.","zh":"你的工单已转交 CSTC 进行处理。"}]}],"synonyms":["acronym","initialism","abbreviation"],"phonetic":"/ˌsiː ɛs tiː ˈsiː/","extraExplanation":["CSTC 通常按字母逐个读（initialism），读作“C-S-T-C”。不同公司/学校/机构可能用 CSTC 表示不同部门或项目名称；最可靠的方法是查看文件中的首次全称、页脚、或向作者确认。"]}
{"word":"CSU","summary":{"en":"CSU is an abbreviation. Most commonly it means Colorado State University, but it can also refer to other units or organizations depending on context.","zh":"CSU是缩写。最常见指科罗拉多州立大学，但也可能在不同语境中代表其他机构或部门。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Colorado State University (a public university in Fort Collins, Colorado, USA).","zh":"科罗拉多州立大学（美国科罗拉多州柯林斯堡的一所公立大学）。"},"examples":[{"en":"She got her master’s degree at CSU in Fort Collins.","zh":"她在柯林斯堡的CSU读了硕士。"},{"en":"CSU is known for programs in veterinary medicine and environmental science.","zh":"CSU以兽医学和环境科学等专业闻名。"}]},{"partOfSpeech":"other","definition":{"en":"(In general use) an abbreviation for various organizations or units, depending on the context (e.g., Customer Service Unit, Central State University, Channel Service Unit).","zh":"（泛用）在不同语境下可指不同机构或部门的缩写（如：客户服务部门、中央州立大学、渠道服务单位等）。"},"examples":[{"en":"Please contact the CSU for help with your account.","zh":"如需账户帮助，请联系CSU（客户服务部门）。"},{"en":"In this report, CSU stands for Customer Service Unit.","zh":"在这份报告中，CSU代表Customer Service Unit（客户服务部门）。"}]}],"synonyms":["C-S-U"],"phonetic":"/ˌsiː ɛs ˈjuː/","extraExplanation":["“CSU”是缩写，真正含义高度依赖场景与地区。最常见的一种用法是在美国指“Colorado State University（科罗拉多州立大学）”。在公司或技术文档里，常见做法是第一次出现时写全称并注明：CSU = ___。","读法通常按字母读作“C-S-U”，口语里很常见。若你告诉我你看到CSU的句子/领域（学校、公司、IT、物流等），我可以帮你准确判定它的意思。"]}
{"word":"csw","summary":{"en":"“CSW” is an abbreviation (said as the letters C-S-W) with multiple possible meanings; the correct one depends on context.","zh":"“CSW”是一个字母缩写（读作C-S-W），可能有多种含义，需要结合上下文确定。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"CSW (abbr.): a written abbreviation that can stand for different things depending on the field (common meanings include “Certified Social Worker” and “Clinical Social Worker”).","zh":"CSW（缩写）：在不同领域可能代表不同含义的缩写（常见含义包括“认证社会工作者”或“临床社会工作者”等）。"},"examples":[{"en":"The job ad says applicants must be a CSW or equivalent.","zh":"招聘广告说申请者必须是CSW或同等资质。"},{"en":"She added “CSW” after her name on her professional profile.","zh":"她在职业资料里把“CSW”加在姓名后面。"}]},{"partOfSpeech":"other","definition":{"en":"CSW (abbr., tech): sometimes used to mean “client-side web” or other web/software terms in informal notes (meaning varies by team/company).","zh":"CSW（缩写，技术语境）：有时在非正式记录中指“客户端网页（client-side web）”或其他与网页/软件相关的说法（具体含义因团队/公司而异）。"},"examples":[{"en":"Can you check the CSW logs to see why the page is slow?","zh":"你能查一下CSW日志看看页面为什么变慢吗？"},{"en":"This issue looks like a CSW bug, not a server problem.","zh":"这个问题看起来是CSW端的bug，不是服务器问题。"}]}],"synonyms":["abbr.","initialism"],"phonetic":"/ˌsiː ˌɛs ˈdʌbəl.juː/","extraExplanation":["“CSW”属于字母缩写，通常需要根据上下文判断具体意思。建议你告诉我：它出现在哪个场景（工作、学校、医疗、软件、聊天）以及前后一句话，我可以帮你锁定最准确的释义。","读法一般按字母逐个读（C-S-W），写作时多为大写。"]}
