{"word":"CT","summary":{"en":"CT most commonly means “computed tomography (CT scan),” but it can also mean the U.S. state Connecticut or certain technical terms depending on context.","zh":"CT最常见指“计算机断层扫描（CT检查）”，也可能指美国康涅狄格州，或在特定技术语境中代表其他术语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) Computed tomography: a medical imaging test that uses X-rays to create detailed cross‑section pictures of the body; also called a “CT scan.”","zh":"（缩写）计算机断层扫描：一种医学影像检查，用X光生成身体的断层/横截面图像；也常说“CT检查/CT扫描”。"},"examples":[{"en":"The doctor ordered a CT scan to check for internal bleeding.","zh":"医生安排做CT检查来确认是否有内出血。"},{"en":"Her CT showed no signs of a stroke.","zh":"她的CT结果显示没有中风迹象。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) Connecticut: a state in the northeastern United States; postal abbreviation “CT.”","zh":"（缩写）美国康涅狄格州；美国邮政缩写为“CT”。"},"examples":[{"en":"He lives in Hartford, CT.","zh":"他住在康涅狄格州的哈特福德。"},{"en":"Please ship the package to New Haven, CT.","zh":"请把包裹寄到康涅狄格州纽黑文。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) In business/engineering, CT can mean “cycle time” (the time to complete one cycle of a process) or “current transformer” (an electrical device for measuring current). Meaning depends on the field.","zh":"（缩写）在商业/工程语境中，CT有时指“cycle time（周期时间/节拍时间）”或“current transformer（电流互感器）”。具体含义取决于领域。"},"examples":[{"en":"We reduced CT on the assembly line from 45 seconds to 30 seconds.","zh":"我们把生产线的周期时间从45秒降到30秒。"},{"en":"The technician replaced the CT to get accurate current readings.","zh":"技术员更换了电流互感器以获得准确的电流读数。"}]}],"synonyms":["CT scan","computed tomography","Connecticut"],"phonetic":"/si ti/","extraExplanation":["“CT”属于首字母缩略词（initialism），常读作字母音“C-T”。在不同场景里含义差别很大：医院里几乎默认是“CT（断层扫描）”；在美国地址里多指“康涅狄格州”；在工厂/电气工程文件里才可能指“cycle time / current transformer”。如果你告诉我具体语境（医疗、地址、工程等），我可以给你更贴近用法的解释与搭配。"]}
{"word":"ct","summary":{"en":"“CT” most commonly means a medical CT scan (computed tomography) or the U.S. state abbreviation for Connecticut.","zh":"“CT”最常见指医学上的CT扫描（计算机断层扫描），或美国康涅狄格州（Connecticut）的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Abbreviation for “computed tomography,” a medical imaging test (often called a “CT scan”).","zh":"“computed tomography（计算机断层扫描）”的缩写；常说“CT 扫描”。"},"examples":[{"en":"The doctor ordered a CT scan to check for internal bleeding.","zh":"医生安排做 CT 扫描来检查是否有内出血。"},{"en":"I had a CT of my chest at the hospital.","zh":"我在医院做了胸部 CT。"}]},{"partOfSpeech":"other","definition":{"en":"Postal abbreviation for the U.S. state of Connecticut.","zh":"美国康涅狄格州（Connecticut）的邮政缩写。"},"examples":[{"en":"Her address ends with “Hartford, CT.”","zh":"她的地址最后写着“哈特福德，CT”。"},{"en":"I’m traveling from NY to CT this weekend.","zh":"这个周末我要从纽约去康州（CT）。"}]}],"synonyms":["CT scan","computed tomography","Connecticut"],"phonetic":"/si ti/","extraExplanation":["“CT”多写成大写，因为它通常是缩写（initialism），读作字母音 /si ti/，口语里也常直接说“a CT”表示“一次CT检查”。","在医学语境里，“CT”有时会与“CAT scan”同义（较旧说法）；在日常英语里更常见的说法是“CT scan”。","在地址或地图里，“CT”几乎总是指美国州名 Connecticut；具体含义通常靠上下文判断。"]}
{"word":"CTA","summary":{"en":"CTA most often means “call to action” in marketing; it can also mean a medical CT angiography scan or the Chicago Transit Authority.","zh":"CTA 最常见指营销中的“行动号召”；也可指医学上的 CT 血管造影，或芝加哥交通局。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(marketing, social media) “Call to action”: a short instruction that tells people what to do next (for example, click, buy, sign up).","zh":"（营销/社媒）“行动号召”：用一句简短指令告诉受众下一步要做什么（如点击、购买、注册）。"},"examples":[{"en":"End your post with a clear CTA like “Sign up today.”","zh":"在帖子结尾加一个清晰的 CTA，比如“今天就注册”。"},{"en":"Our CTA button says “Get started.”","zh":"我们的 CTA 按钮写着“开始使用”。"}]},{"partOfSpeech":"n.","definition":{"en":"(medicine) “Computed tomography angiography”: a CT scan used to view blood vessels.","zh":"（医学）“CT 血管造影”：用 CT 成像来观察血管的检查。"},"examples":[{"en":"The doctor ordered a CTA to check for a blocked artery.","zh":"医生安排了 CTA 来检查动脉是否堵塞。"},{"en":"CTA can help detect aneurysms in some patients.","zh":"CTA 可以帮助部分患者发现动脉瘤。"}]},{"partOfSpeech":"n.","definition":{"en":"“Chicago Transit Authority”: the public transportation agency for Chicago (buses and trains).","zh":"“芝加哥交通局”：负责芝加哥公共交通（公交与地铁/轻轨）的机构。"},"examples":[{"en":"I take the CTA Blue Line to the airport.","zh":"我坐 CTA 蓝线去机场。"},{"en":"CTA service is delayed due to maintenance.","zh":"由于维修，CTA 运营延误。"}]}],"synonyms":["call to action","prompt","instruction","next step"],"phonetic":"/ˌsiː tiː ˈeɪ/","extraExplanation":["CTA 是缩写，不同领域含义不同：营销里最常见的是 call to action；医疗场景里常指 CT 血管造影；在芝加哥本地语境里常指 Chicago Transit Authority。阅读时可根据上下文（广告/按钮、医院检查、城市交通）判断。","营销里的 CTA 常以动词开头（Sign up / Buy now / Learn more），通常放在标题、按钮或结尾，用来提高转化率。"]}
{"word":"CTC","summary":{"en":"CTC is an abbreviation most commonly meaning “cost to company,” the employer’s total cost for an employee.","zh":"CTC 是缩写，最常见的意思是“Cost to Company”，即公司为员工承担的总成本。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) “cost to company”: the total cost an employer spends on an employee (often includes base salary plus benefits, bonuses, taxes, etc.).","zh":"（缩写）“Cost to Company（CTC）”：公司为一名员工承担的总成本（通常包括基本工资、福利、奖金、税费等）。"},"examples":[{"en":"My CTC is $80,000, including salary and benefits.","zh":"我的 CTC 是 8 万美元，包括工资和福利。"},{"en":"The offer letter lists the CTC and the take-home pay separately.","zh":"录用信把 CTC 和到手工资分开写。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev.) “Certified to Coach”: a credential showing someone is formally qualified as a coach (used in some sports/fitness programs).","zh":"（缩写）“Certified to Coach”：表示某人通过认证、具备教练资格的证书（在一些体育/健身项目中使用）。"},"examples":[{"en":"She completed the training and became CTC last year.","zh":"她完成培训，去年获得了 CTC 教练认证。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev.) “common traffic channel / control” (in some technical contexts): a shared channel used for coordination (meaning varies by field).","zh":"（缩写）（某些技术语境）“公共通信/控制通道”：用于协调的共享通道（具体含义会因领域而变）。"},"examples":[{"en":"Check the manual—CTC here refers to a shared control channel.","zh":"查看说明书——这里的 CTC 指的是共享控制通道。"}]}],"synonyms":["(for “cost to company”) total compensation (similar, not identical)","compensation package (broader)"],"phonetic":"ˌsiː tiː ˈsiː","extraExplanation":["“CTC”是缩写，含义高度依赖语境。求职/人力资源场景里最常见的是“Cost to Company”。在印度、新加坡等地的招聘沟通中尤其常见：CTC 往往是“公司总支出”，不等于“到手工资（take-home pay）”。","如果你是在聊天、邮件或某个行业文档里看到 CTC，最好结合上下文（招聘/体育认证/通信技术等）来判断，必要时直接问对方“CTC stands for what here?”。"]}
{"word":"CTD","summary":{"en":"CTD is an abbreviation that commonly means Cumulative Trauma Disorder (medicine), Crash to Desktop (computing), or C-terminal domain (biology), depending on context.","zh":"CTD 是缩写，常见含义包括：医学的“累积性创伤障碍”、计算机/游戏的“崩溃回到桌面”，以及生物学的“C端结构域”，需结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(medicine) Cumulative Trauma Disorder: an injury caused by repeated small stresses over time, often from repetitive movements at work.","zh":"（医学）累积性创伤障碍：由长期重复的小压力造成的损伤，常见于工作中的重复性动作。"},"examples":[{"en":"The doctor said my wrist pain may be CTD from typing all day.","zh":"医生说我手腕疼可能是因为整天打字导致的CTD。"},{"en":"Good posture and breaks can help prevent CTD.","zh":"良好的姿势和休息间隔可以帮助预防CTD。"}]},{"partOfSpeech":"other","definition":{"en":"(computing/gaming) Crash to Desktop: when a program suddenly closes and returns you to the computer’s desktop without a normal exit.","zh":"（计算机/游戏）崩溃回到桌面：程序突然关闭，未正常退出就回到桌面界面。"},"examples":[{"en":"My game keeps CTD-ing after the new update.","zh":"新更新后我的游戏一直CTD（崩溃回桌面）。"},{"en":"Try updating your graphics driver if you get a CTD.","zh":"如果出现CTD，试试更新显卡驱动。"}]},{"partOfSpeech":"other","definition":{"en":"(biology) C-terminal domain: the end portion of a protein (the “C-terminus”), often important for the protein’s function.","zh":"（生物）C端结构域：蛋白质末端（C端）的一段区域，常与蛋白功能有关。"},"examples":[{"en":"The mutation affects the CTD of the protein and changes how it works.","zh":"这个突变影响了蛋白的CTD，从而改变它的功能。"},{"en":"Researchers studied how the CTD binds to other molecules.","zh":"研究人员分析了CTD如何与其他分子结合。"}]}],"synonyms":["abbrev.","acronym"],"phonetic":"/ˌsiː tiː ˈdiː/","extraExplanation":["CTD 是缩写，真正含义高度依赖语境：在医院/职业病讨论里多指“累积性创伤”；在电脑或游戏论坛里多指“崩溃回到桌面”；在科研论文（尤其分子生物学）里常指“C端结构域”。判断技巧：看周围词（疼痛/工伤 vs. 更新/驱动 vs. 蛋白/突变）。"]}
{"word":"cte","summary":{"en":"CTE is an abbreviation that most commonly means a SQL Common Table Expression, but it can also refer to a brain disease (chronic traumatic encephalopathy) or Career and Technical Education.","zh":"CTE 是一个缩写，最常见指 SQL 的公共表表达式，但也可指慢性创伤性脑病或职业与技术教育。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(computing, databases) Common Table Expression: a temporary named result set used in SQL (often introduced with WITH) to make complex queries easier to read and reuse.","zh":"（计算机/数据库）公共表表达式：SQL 中用于临时命名结果集的一种写法（常用 WITH 引入），帮助把复杂查询写得更清晰、可复用。"},"examples":[{"en":"Use a CTE to break the query into steps, then select from it at the end.","zh":"用 CTE 把查询拆成几个步骤，最后再从它进行选择。"},{"en":"The report query uses two CTEs: one for filtering users and one for calculating totals.","zh":"这条报表查询用了两个 CTE：一个用来筛选用户，一个用来计算总计。"}]},{"partOfSpeech":"n.","definition":{"en":"(medicine) Chronic Traumatic Encephalopathy: a degenerative brain disease linked to repeated head impacts, often discussed in contact sports.","zh":"（医学）慢性创伤性脑病：与反复头部撞击相关的退行性脑疾病，常在橄榄球、拳击等对抗性运动中被讨论。"},"examples":[{"en":"Researchers are studying the long-term risks of CTE in athletes.","zh":"研究人员正在研究运动员患 CTE 的长期风险。"},{"en":"He donated his brain for CTE research after retirement.","zh":"他退役后捐献了大脑用于 CTE 研究。"}]},{"partOfSpeech":"n.","definition":{"en":"(education) Career and Technical Education: programs that teach job-ready skills and career pathways (often in high schools and community colleges).","zh":"（教育）职业与技术教育：教授就业技能与职业路径的课程与项目（常见于高中和社区学院）。"},"examples":[{"en":"She enrolled in a CTE program in welding.","zh":"她报名参加了焊接方向的 CTE 项目。"},{"en":"The school expanded CTE offerings to include healthcare and IT.","zh":"学校扩展了 CTE 课程，新增了医疗和信息技术方向。"}]}],"synonyms":["Common Table Expression","WITH clause (SQL)","chronic traumatic encephalopathy","Career and Technical Education"],"phonetic":"/ˌsiː tiː ˈiː/","extraExplanation":["“CTE”是缩写，在不同领域含义差别很大。写作或口语中第一次出现时，通常要先写全称再括号标注缩写（例如：Common Table Expression (CTE)），避免误解。","发音上很多人直接逐个字母读：C-T-E。不同语境下听者会自动联想到本行业最常见的那个含义（程序员多指 SQL；体育/医学语境多指脑病；教育政策语境多指职业教育）。"]}
{"word":"Cteatus","summary":{"en":"“Cteatus” isn’t a recognized English word; it’s likely a misspelling or a name.","zh":"“Cteatus” 不是可识别的英语单词；更可能是拼写错误或名字。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“Cteatus” is not a standard English word. It is most likely a misspelling of a real word (for example, “created” or “creator”), or it may be a username/proper name.","zh":"“Cteatus” 不是标准英语单词。它很可能是某个真实单词的拼写错误（例如 “created / creator”），或是用户名/专有名称。"},"examples":[{"en":"I couldn’t find “Cteatus” in an English dictionary—did you mean “created”?","zh":"我在英语词典里找不到 “Cteatus”——你是不是想写 “created”？"},{"en":"If “Cteatus” is a username, it may not have a dictionary meaning.","zh":"如果 “Cteatus” 是用户名，它可能没有词典里的固定含义。"}]}],"extraExplanation":["如果你想查的是 **created**（动词 create 的过去式/过去分词，意为“创造；创建；创作”），请回复我：你想要哪个词（created / creator / create / Cretaceous 等）以及它出现的句子，我可以给你最贴切的释义和例句。"]}
{"word":"ctelette","summary":{"en":"Côtelette (often written cotelette) means a small chop/cutlet of meat, usually lamb or pork, mainly used in cooking/menu contexts.","zh":"côtelette（常写作 cotelette）指小块的肉排/带骨肉排（多为羊或猪），主要出现在烹饪或菜单语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small cut of meat (especially a lamb or pork chop/cutlet), often cooked by frying or grilling","zh":"（尤指羊或猪的）小块带骨肉排；肉排（常用煎、烤等方式烹调）"},"examples":[{"en":"For dinner, we had lamb côtelettes with rosemary.","zh":"晚餐我们吃了迷迭香烤小羊排。"},{"en":"The menu lists “pork côtelettes” as a house specialty.","zh":"菜单上写着“猪肉排”是本店招牌。"}]}],"synonyms":["cutlet","chop","lamb chop","pork chop"],"phonetic":"/ˌkoʊtˈlɛt/","extraExplanation":["“ctelette”很可能是拼写错误，常见正确写法是法语借词 **côtelette**（也可不带重音写作 **cotelette**）。在英文菜单或烹饪语境里偶尔会用这个法语形式，但更常见、更通用的英文说法是 **cutlet** 或 **chop**。","法语里的重音符号 **ô** 在英文中常被省略（写成 *cotelette*），读音通常也会更英语化。"]}
{"word":"Ctenacanthus","summary":{"en":"Ctenacanthus is an extinct genus of prehistoric sharks known from fossils, especially spines and teeth.","zh":"Ctenacanthus 是一种已灭绝的史前鲨鱼属，主要通过棘刺和牙齿等化石为人所知。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of extinct prehistoric sharks (cartilaginous fish) known mainly from their fossil spines and teeth, especially from the Carboniferous period.","zh":"一种已灭绝的史前鲨鱼属（软骨鱼类），主要通过其化石棘刺和牙齿为人所知，常见于石炭纪地层。"},"examples":[{"en":"Ctenacanthus fossils are often identified by distinctive fin spines.","zh":"Ctenacanthus 的化石常通过其独特的鳍棘来辨认。"},{"en":"In the museum display, Ctenacanthus is shown as an early relative of modern sharks.","zh":"在博物馆展陈中，Ctenacanthus 被展示为现代鲨鱼的早期近亲之一。"}]}],"synonyms":["(no true synonyms; scientific genus name)"],"phonetic":"ˌtɛnəˈkænθəs","extraExplanation":["这是一个古生物学/地质学里的学名（拉丁化的属名）。词源来自希腊语：cten- 表示“梳子/梳齿”，acanthus 表示“刺/棘”，整体含义大致是“具梳状棘刺的（鲨）”。","该属常见于石炭纪（约3.59亿—2.99亿年前）相关沉积地层；由于完整骨骼较少，研究上常依赖鳍棘和牙齿等硬组织化石来分类与推断生态。"]}
{"word":"ctenacanthus","summary":{"en":"Ctenacanthus: an extinct genus of Paleozoic sharks known from fossils, especially spines.","zh":"Ctenacanthus：一种古生代已灭绝的鲨类属，主要通过化石（尤其棘刺）为人所知。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of extinct sharks known from fossil remains (especially distinctive spines), common in the Paleozoic Era.","zh":"一属已灭绝的鲨类（多以化石遗骸、尤其是特征性棘刺为人所知），主要见于古生代。"},"examples":[{"en":"Ctenacanthus is known mainly from fossils found in ancient marine rocks.","zh":"Ctenacanthus 主要是通过发现于古老海相岩层中的化石而为人所知。"},{"en":"The museum display included a reconstruction of Ctenacanthus based on spine fossils.","zh":"博物馆展柜里有一个根据棘刺化石复原的 Ctenacanthus 模型。"}]}],"synonyms":["ctenacanth shark","extinct shark genus"],"phonetic":"ˌtɛnəˈkænθəs","extraExplanation":["词源提示：Ctenacanthus 来自希腊语词根 *kten-*（“梳子、梳齿”）与 *acanth-*（“刺、棘”），名称强调其带“梳状/刺状”特征的棘刺。","它通常被归入“栉棘鲨类”（ctenacanthiform sharks）等古老鲨形类群，生活年代大致在石炭纪到二叠纪之间（约距今3亿年前左右），常见于海洋沉积地层的化石记录中。"]}
{"word":"ctene","summary":{"en":"“Ctene” isn’t a standard English word; it’s usually a typo for “octene” or related to the root “cten-” (comb).","zh":"“ctene”不是标准英语词；多为“octene（辛烯）”的拼写错误，或与表示“梳状”的词根“cten-”有关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in general dictionaries. It is most often seen as (1) a typo for “octene” (a chemical name), or (2) part of the scientific root “cten-” meaning “comb,” as in “ctenophore.”","zh":"“ctene”不是常见的标准英语词条。它最常见的情况是：(1) 把化学名词“octene（辛烯）”拼错了；或(2) 作为科学词根“cten-（梳/栉、像梳子的）”的一部分，如“ctenophore（栉水母）”。"},"examples":[{"en":"I can’t find “ctene” in a dictionary—did you mean “octene” in a chemistry context?","zh":"我在词典里找不到“ctene”——你是不是在化学语境里想写“octene（辛烯）”？"},{"en":"Words like “ctenophore” use the root “cten-,” related to comb-like structures.","zh":"像“ctenophore（栉水母）”这类词使用“cten-”词根，和“像梳子一样的结构”有关。"}]}],"phonetic":"/ˈsiːtiːn/","extraExplanation":["如果你能告诉我它出现的句子或领域（化学/生物/游戏ID/人名等），我可以更精准地确认你想查的是哪一个词：\n- chemistry：你可能想写的是 **octene**（辛烯）或其他“...-ene”结尾的烯烃名。\n- biology：你可能遇到的是 **cten-** 词根（如 ctenophore）。"]}
{"word":"ctenidia","summary":{"en":"Ctenidia are comb-like gills of mollusks used mainly for breathing and often for filter-feeding.","zh":"ctenidia 指软体动物的栉鳃（梳齿状鳃），主要用于呼吸，常也用于滤食。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Comb-like gills in many mollusks (such as snails and clams), used for breathing and often for filter-feeding.","zh":"（许多软体动物如蜗牛、蛤等的）栉鳃/栉鳃状鳃，用于呼吸，常也用于滤食。"},"examples":[{"en":"Bivalves use their ctenidia to filter tiny food particles from the water.","zh":"双壳类动物用栉鳃从水中过滤微小的食物颗粒。"},{"en":"In some snails, the ctenidia sit inside the mantle cavity and help with respiration.","zh":"在一些蜗牛中，栉鳃位于外套腔内，帮助进行呼吸。"}]}],"synonyms":["ctenidium (singular)","gills (general term)"],"phonetic":"/tniˈdɪiə/","extraExplanation":["“ctenidia”通常被当作复数形式使用；单数常见为“ctenidium”。","词源来自希腊语“ktenis/kteis”（意为“梳子”），强调这种鳃呈“梳齿状/栉状”的结构。","这是生物学/动物学术语，多见于软体动物解剖、海洋生物学与生态学的文章中。"]}
{"word":"ctenidial","summary":{"en":"Ctenidial means “related to a mollusk’s comb-like gills (ctenidia).”","zh":"ctenidial 表示“与软体动物梳状鳃（栉鳃，ctenidium）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a ctenidium (a comb-like gill) in many mollusks and some other aquatic invertebrates.","zh":"与栉鳃（ctenidium，一种“梳状”的鳃）有关的；栉鳃的（常见于许多软体动物及部分水生无脊椎动物）。"},"examples":[{"en":"Many snails breathe using ctenidial gills inside the mantle cavity.","zh":"许多蜗牛在外套膜腔内用栉鳃进行呼吸。"},{"en":"The diagram labels the ctenidial filaments that help filter oxygen from water.","zh":"图中标注了栉鳃的鳃丝，它们帮助从水中滤取氧气。"}]}],"synonyms":["branchial (more general)","gill-related (informal)"],"phonetic":"/tɪˈnɪdiəl/","extraExplanation":["“ctenidial”来自希腊语词根 *kten-*，意思是“梳子”，因为栉鳃常呈梳状、排列整齐的结构。","在动物学/海洋生物学语境里，它通常与解剖结构一起出现，如“ctenidial gill（栉鳃）”“ctenidial filaments（栉鳃鳃丝）”。日常英语中很少用，属于专业术语。"]}
{"word":"ctenidium","summary":{"en":"A ctenidium is a comb-like structure; in mollusks it commonly refers to a gill.","zh":"ctenidium 指梳状结构；在软体动物中常特指鳃。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology) A comb-like anatomical structure, especially a row of small projections. In many mollusks, a ctenidium is a gill used for breathing (and sometimes for filtering food).","zh":"（生物学）梳状的解剖结构，尤其指一排细小突起。在许多软体动物中，ctenidium 指用于呼吸（有时也用于滤食）的鳃。"},"examples":[{"en":"In many snails, the ctenidium functions as the main gill for respiration.","zh":"在许多蜗牛中，ctenidium 是进行呼吸的主要鳃。"},{"en":"The researcher examined the ctenidium under a microscope to compare gill structure between species.","zh":"研究人员在显微镜下观察 ctenidium，以比较不同物种的鳃结构。"}]}],"synonyms":["gill (in mollusks)","gill comb","comb-like structure"],"phonetic":"/tɛˈnɪdiəm/","extraExplanation":["词源来自希腊语 *kteis*（属格 *ktenos*），意思是“梳子”，因此该词常用来强调“梳齿状/栉状”的形态特征。","该词多用于动物学与无脊椎动物学语境；复数形式常见为 **ctenidia**（尤其在软体动物的鳃结构描述中）。"]}
{"word":"cteniform","summary":{"en":"Cteniform means “comb-shaped,” especially describing biological structures like certain fish scales.","zh":"cteniform 意为“梳状的”，尤其用于描述生物结构（如某些鱼类的梳鳞）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comb-shaped; having structures arranged like the teeth of a comb (often used in biology).","zh":"梳状的；像梳子齿一样排列的（常用于生物学描述）。"},"examples":[{"en":"Some fish have cteniform scales with tiny comb-like edges.","zh":"有些鱼有梳鳞（cteniform scales），鳞片边缘带有细小的梳齿状突起。"},{"en":"Under the microscope, the surface looks cteniform rather than smooth.","zh":"在显微镜下，这个表面看起来呈梳状，而不是光滑的。"}]}],"synonyms":["comb-shaped","pectinate"],"phonetic":"/ˈtiːnəˌfɔrm/","extraExplanation":["词源提示：cteniform 来自希腊语词根 cten-（意为“梳子”）+ -form（意为“……形状的”）。在生物学里最常见的搭配是 cteniform scales（梳鳞），用来与 cycloid scales（圆鳞，边缘较光滑）区分。"]}
{"word":"ctenii","summary":{"en":"Ctenii are comb-like spines/ridges on some arthropods; a rare, technical plural used in scientific contexts.","zh":"Ctenii 指某些节肢动物身上的梳齿状刺或脊，是少见的科学语境复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"comb-like spines or ridges (specialized “combs”) found on some animals—especially insects and other arthropods; a technical plural form used in scientific writing.","zh":"（动物学/昆虫学术语）某些动物（尤指昆虫及其他节肢动物）身上呈“梳齿状”的刺、脊或梳状结构；科学写作中使用的复数形式。"},"examples":[{"en":"Under the microscope, the flea’s ctenii look like tiny comb teeth.","zh":"在显微镜下，跳蚤的 ctenii 看起来像微小的梳齿。"},{"en":"The presence or absence of ctenii can help identify the species.","zh":"是否具有 ctenii 有助于鉴定物种。"}]}],"synonyms":["ctenidia","comb-like spines","combs (technical)"],"phonetic":"/ˈtiːni.aɪ/","extraExplanation":["“ctenii”在普通英语中非常少见，通常出现在生物分类或形态学描述里。更常见的相关术语是 **ctenidium / ctenidia**（梳状结构/其复数）。","词根来自希腊语 **ktenos**，意为“梳子”。在昆虫学中常见于描述跳蚤、某些甲虫等体表的梳状刺列，用于保护、固定或与宿主毛发/羽毛的摩擦相关。"]}
{"word":"cteninidia","summary":{"en":"Actinidia is the plant genus that includes kiwifruit vines.","zh":"Actinidia 指猕猴桃属，即包含猕猴桃（奇异果）藤本植物的一个植物属。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of climbing plants (vines) that includes the kiwifruit; the group of plants kiwifruit comes from","zh":"猕猴桃属（藤本植物的一属），猕猴桃/奇异果就来源于这一属的植物"},"examples":[{"en":"Kiwifruit is produced from several species in the genus Actinidia.","zh":"猕猴桃（奇异果）来自猕猴桃属（Actinidia）中的多个物种。"},{"en":"Actinidia vines need support, like a trellis, to grow well.","zh":"猕猴桃属的藤本需要支架（比如棚架）来更好地生长。"}]}],"synonyms":["kiwifruit genus"],"phonetic":"/ˌæk.tɪˈnɪd.i.ə/","extraExplanation":["你输入的“cteninidia”很可能是拼写错误；正确拼写通常是 **Actinidia**（首字母大写，表示属名）。","在英语里，**Actinidia**是拉丁化的生物学名称，日常交流中更常说 **kiwifruit**（猕猴桃/奇异果）或 **kiwi**（口语，但在正式场合也可能指新西兰人）。"]}
{"word":"ctenizid","summary":{"en":"A “ctenizid” is a trapdoor spider (or related to one) in the family Ctenizidae.","zh":"“ctenizid”指栉蛛科的陷阱门蛛（或与其相关的）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of trapdoor spider (family Ctenizidae), known for building a silk-lined burrow with a hinged “trapdoor.”","zh":"栉蛛科（Ctenizidae）的一类“陷阱门蛛”（捕鸟蛛类的近亲之一），以挖掘衬丝洞穴并制作可开合的“活门”而闻名。"},"examples":[{"en":"A ctenizid can stay hidden for hours, waiting to ambush insects at the edge of its burrow.","zh":"栉蛛科的陷阱门蛛可以潜伏好几个小时，在洞口边缘伏击昆虫。"},{"en":"The researcher recorded how the ctenizid repaired its trapdoor after rain.","zh":"研究人员记录了这只栉蛛科蜘蛛在下雨后如何修补它的洞门。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to trapdoor spiders of the family Ctenizidae.","zh":"与栉蛛科（Ctenizidae）陷阱门蛛有关的；栉蛛科的。"},"examples":[{"en":"They found ctenizid burrows along the dry hillside.","zh":"他们在干燥的山坡上发现了栉蛛科蜘蛛的洞穴。"},{"en":"The guide compared ctenizid spiders with other burrowing species.","zh":"向导把栉蛛科蜘蛛与其他掘洞物种作了比较。"}]}],"synonyms":["trapdoor spider","Ctenizidae spider"],"phonetic":"/ˈtɛnɪzaɪd/","extraExplanation":["“ctenizid”主要用于生物学/昆虫学（更准确说是蛛形纲）语境，日常英语里很少见。常见搭配有：ctenizid spider（栉蛛科蜘蛛）、ctenizid burrow（栉蛛科蜘蛛洞穴）。","词源提示：来自分类学名称 Ctenizidae（栉蛛科）。这类蜘蛛常被统称为 trapdoor spiders（陷阱门蛛），因为它们会用丝和土制作可伪装的“门”。"]}
{"word":"cteno","summary":{"en":"cteno- is a scientific word part meaning “comb; comb-like,” especially in biology.","zh":"cteno- 是科学构词成分，表示“梳子/栉（状）”“梳齿状的”，多见于生物学术语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a combining form meaning “comb” or “comb-like,” used mainly in biology to name structures with a rowed, comb-like appearance","zh":"构词成分，意为“梳子/栉（状）”“呈梳齿状的”，多用于生物学中指具有梳齿般排列的结构"},"examples":[{"en":"Ctenophores are marine animals also called “comb jellies.”","zh":"Ctenophore（栉水母）是一类海洋动物，也常被称为“comb jelly（梳状水母）”。"},{"en":"Some fish have ctenoid scales, which look like they have tiny comb-teeth on the edge.","zh":"有些鱼有 ctenoid scales（栉鳞），边缘看起来像带有细小的梳齿。"}]}],"synonyms":["comb-","pecten-"],"phonetic":"/ˈtiːnoʊ/","extraExplanation":["cteno- 来自希腊语 kteis/kténos（意为“梳子”）。在英语里，这类词首的 c 往往不发音，所以 cteno- 常读作“TEE-no-”。","常见相关词：ctenophore（栉水母/梳状水母）、ctenoid（栉状的；栉鳞的）。也可对比 pecten-（同样与“梳状/栉状”有关，见于 pectinate 等词）。"]}
{"word":"Ctenocephalus","summary":{"en":"Ctenocephalus is the scientific genus name for several common fleas, including the cat flea.","zh":"Ctenocephalus 是若干常见跳蚤（如猫蚤）的栉头蚤属学名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of fleas that includes common pests such as the cat flea and dog flea.","zh":"（昆虫学）栉头蚤属：一种跳蚤的属，包括常见害虫如猫蚤和犬蚤。"},"examples":[{"en":"Ctenocephalus felis (the cat flea) is a common cause of itching in pets.","zh":"Ctenocephalus felis（猫蚤）是宠物瘙痒的常见原因之一。"},{"en":"The vet identified the fleas as belonging to the genus Ctenocephalus.","zh":"兽医鉴定这些跳蚤属于栉头蚤属（Ctenocephalus）。"}]}],"synonyms":["cat flea (in common speech, for Ctenocephalus felis)","dog flea (in common speech, for Ctenocephalus canis)"],"phonetic":"/ˌtiːnoʊsəˈfæləs/","extraExplanation":["这是一个学名（拉丁化的属名），在日常英语中更常直接说 cat flea（猫蚤）或 dog flea（犬蚤）。在科学写作里，属名首字母大写并斜体：Ctenocephalus。","词源来自希腊语：cteno- 表示“梳子/栉”，cephalus 表示“头”，指这种跳蚤头部有“梳状刺”（像小梳子一样的结构），是分类鉴定的重要特征之一。"]}
{"word":"ctenocephalus","summary":{"en":"Ctenocephalus is a rare/historical genus name referring to “comb-headed” fleas, often mentioned in older scientific or veterinary sources.","zh":"Ctenocephalus 是一个较少使用/历史上的跳蚤属名，字面有“栉头（梳头）”之意，常见于较早的科学或兽医资料中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a (historical or less commonly used) scientific genus name for certain fleas; often associated with the “comb-headed” fleas found on mammals (now more commonly classified under related genera such as Ctenocephalides).","zh":"（较少使用或历史上的）某些跳蚤的属名；常指“梳头（有栉）”的跳蚤类群，现代分类中更常归入近缘属（如 Ctenocephalides）。"},"examples":[{"en":"Older veterinary texts sometimes mention Ctenocephalus when discussing fleas on cats and dogs.","zh":"一些较早的兽医资料在讨论猫狗身上的跳蚤时会提到 Ctenocephalus。"},{"en":"The name Ctenocephalus refers to fleas with a comb-like structure near the head.","zh":"Ctenocephalus 这个名字指的是头部附近带有“梳状结构”的跳蚤。"}]}],"synonyms":["Ctenocephalides (related/modern classification)"],"phonetic":"/ˌtɛnəˈsɛfələs/","extraExplanation":["词源提示：cteno- 来自希腊语，意思是“梳子/栉”，-cephalus 来自“头”。因此字面含义接近“梳头的/栉头的（有梳状结构的头部）”。","分类学提示：在现代昆虫分类中，你更常见到的相关名称是 Ctenocephalides（例如常见的猫蚤 Ctenocephalides felis）。不同资料可能因年代或分类体系而出现名称差异。"]}
{"word":"ctenocyst","summary":{"en":"A ctenocyst is a sticky prey-capturing cell in comb jellies (ctenophores).","zh":"ctenocyst 指栉水母用来黏住并捕获猎物的黏捕细胞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a specialized sticky (adhesive) cell found in comb jellies (ctenophores), used to capture prey; also called a colloblast","zh":"栉水母（ctenophore，俗称“梳状水母/栉水母”）体表的一种专门“黏捕”细胞，用黏性物质粘住猎物；也称 colloblast（黏捕细胞）"},"examples":[{"en":"Comb jellies catch small plankton with ctenocysts on their tentacles.","zh":"栉水母用触手上的 ctenocyst（黏捕细胞）去捕捉小型浮游生物。"},{"en":"Unlike jellyfish stinging cells, ctenocysts work mainly by sticking to prey.","zh":"不同于水母的刺细胞，ctenocyst 主要靠“黏住”猎物来起作用。"}]}],"synonyms":["colloblast"],"phonetic":"/ˈtɛnəˌsɪst/","extraExplanation":["词源提示：cteno- 来自希腊语，意思是“梳子/梳状”，指栉水母的“梳板”（ctenes）；-cyst 表示“囊/胞”。这个词常见于动物学与海洋生物学文献中。","学习对比：栉水母主要用 colloblast/ctenocyst（黏捕细胞）粘住猎物；而刺胞动物（如水母、海葵）使用 cnidocyte（刺细胞）释放刺丝。"]}
{"word":"ctenodactyl","summary":{"en":"A ctenodactyl is a small North African/Middle Eastern desert rodent, also known as a gundi.","zh":"ctenodactyl 指北非/中东地区的一类小型沙漠啮齿动物，也叫 gundi（冈迪鼠）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small desert rodent (family Ctenodactylidae), found mainly in North Africa and parts of the Middle East; also called a gundi.","zh":"栉齿鼠（栉齿鼠科的一类小型沙漠啮齿动物），主要分布于北非及中东部分地区；也常称为 gundi（冈迪鼠）。"},"examples":[{"en":"The ctenodactyl lives among rocky desert slopes and shelters in crevices.","zh":"栉齿鼠生活在多岩石的沙漠山坡上，并在岩缝中躲藏。"},{"en":"A gundi is a type of ctenodactyl adapted to dry, hot environments.","zh":"冈迪鼠是一种栉齿鼠，适应干燥炎热的环境。"}]}],"synonyms":["gundi"],"phonetic":"/ˌtiːnəˈdæk.tɪl/","extraExplanation":["“ctenodactyl”来自希腊语词根：cteno-（意为“梳子、栉状”）+ dactyl（意为“手指/趾”），指它们足部具有类似“梳齿”的结构，有助于梳理毛发或适应栖息环境。","这个词多见于动物学/生物学语境，日常英语里更常用“gundi”。"]}
{"word":"Ctenodipterini","summary":{"en":"Ctenodipterini is a scientific (Latinized) zoological tribe name, used to group closely related genera in taxonomy.","zh":"Ctenodipterini 是动物分类学中拉丁化的“族名”，用于把近缘的多个属归为一组。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a taxonomic tribe name used in zoological classification (a group of closely related genera within a family), especially in scientific writing; it refers to the tribe that includes the genus Ctenodipterus and related genera (the exact placement depends on the animal group being discussed in a given source).","zh":"（动物分类学）“族”（tribe）的名称，用于科学分类中指同一科内关系较近的一组属；通常指包含 Ctenodipterus 属及其近缘属的“族”（具体隶属的类群需以所引用的文献为准）。"},"examples":[{"en":"The paper revises several genera within Ctenodipterini based on wing and antenna characters.","zh":"该论文依据翅和触角特征，修订了 Ctenodipterini 族内的若干属。"},{"en":"Ctenodipterini is listed as a tribe under the family in this catalog, but its limits have changed over time.","zh":"在这本目录中，Ctenodipterini 被列为该科下的一个族，但它的界定范围随着时间有所变化。"}]}],"synonyms":["(no true synonym; taxonomy names are proper scientific names)"],"phonetic":"/ˌtiːnoʊdɪpˈtɛrɪnaɪ/","extraExplanation":["这是一个拉丁化的分类单元名称：词尾 -ini 常见于动物命名法规中的“族名”（tribe name），通常来自某个模式属（这里多半是 Ctenodipterus）的词干 + -ini。","不同研究者可能会因新证据（形态或分子数据）调整“族”的范围与归属，所以在阅读时最好同时查看该名称所在的“科/亚科/族”层级与引用来源。"]}
{"word":"ctenodipterini","summary":{"en":"Ctenodipterini is a scientific (Latinized) plural noun meaning a zoological tribe name, most often encountered in entomology taxonomy.","zh":"Ctenodipterini 是一个科学拉丁化的复数名词，表示动物分类学中的“族”名，最常见于昆虫分类语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a taxonomic tribe name (plural) used in zoology—especially in entomology—for a group of closely related organisms (often used for a tribe within a beetle family/subfamily).","zh":"（动物分类学用语，复数）“族”（tribe）的名称之一，用于表示一群亲缘关系较近的生物（常见于昆虫学中，用来指某个甲虫类群中的一个“族”）。"},"examples":[{"en":"In the catalog, Ctenodipterini is listed as a tribe within the classification of certain beetles.","zh":"在这本名录里，Ctenodipterini 被列为某些甲虫分类体系中的一个“族”。"},{"en":"The paper compares diagnostic features of several genera placed in Ctenodipterini.","zh":"论文比较了被归入 Ctenodipterini 的几个属的鉴别特征。"}]}],"synonyms":["(no common everyday synonyms; often paraphrased as “the tribe Ctenodipterini”)"],"phonetic":"/ˌtiːnoʊdɪpˈtɛrənaɪ/","extraExplanation":["这是一个非常专业的拉丁化分类名称，通常不会出现在日常英语里，多见于昆虫学/动物分类学论文、物种名录或博物馆数据库。","词尾 **-ini** 在动物命名法规中常用来表示“族”（tribe），其上一级常见为 **-inae**（亚科），再上一级 **-idae**（科）。因此看到 *Ctenodipterini* 往往可以推测它是一个“族”的复数名称。","该词对应的具体类群位置会因不同的分类系统或研究更新而调整；如果你告诉我它出现在哪篇文章/哪个数据库条目里，我可以帮你确认它在那里的具体分类层级（科/亚科/族）与相关属名。"]}
{"word":"ctenodont","summary":{"en":"Ctenodont describes comb-like teeth; it can also refer to an animal characterized by such teeth.","zh":"ctenodont 指“梳齿状的牙齿（或具有此类牙齿的特征）”，也可指具有这种牙齿的动物（多见于学术语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of an animal) having comb-like or closely ridged teeth.","zh":"（动物）具有梳状、呈细密齿状脊的牙齿（梳齿状的）。"},"examples":[{"en":"Some fossil mammals are described as ctenodont because their teeth have comb-like ridges.","zh":"一些化石哺乳动物会被描述为 ctenodont，因为它们的牙齿带有梳状的细密脊。"},{"en":"The specimen’s ctenodont teeth suggest it was adapted for a specialized diet.","zh":"该标本的 ctenodont 梳齿状牙齿表明它可能适应了某种特殊的食性。"}]},{"partOfSpeech":"n.","definition":{"en":"An animal (often in scientific or fossil contexts) noted for having ctenodont teeth.","zh":"（多用于科学或古生物语境）指具有梳齿状牙齿的动物。"},"examples":[{"en":"Researchers compared the ctenodont with other small mammals from the same period.","zh":"研究人员将这种“ctenodont”动物与同一时期的其他小型哺乳动物进行比较。"}]}],"synonyms":["comb-toothed","pectinate-toothed"],"phonetic":"/ˈtiːnəˌdɑnt/","extraExplanation":["词源提示：cteno- 来自希腊语，意为“梳子”，-dont 来自希腊语 odous/odont-，意为“牙齿”。因此 ctenodont 字面意思就是“梳子状的牙齿”。","这是偏学术/专业的词，常见于动物学、古生物学文章或标本描述中；日常英语里较少使用。"]}
{"word":"Ctenodontidae","summary":{"en":"Ctenodontidae is the scientific family name of an extinct group of rodents, known from fossils.","zh":"Ctenodontidae 指“栉齿鼠科”，一种已灭绝的啮齿动物科名，主要见于化石研究。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific family name for an extinct group of rodents (small mammals related to mice and squirrels), known from fossils","zh":"（生物学分类）栉齿鼠科：一种已灭绝的啮齿动物科名，仅见于化石记录"},"examples":[{"en":"Ctenodontidae is known mainly from fossil teeth and skull fragments.","zh":"栉齿鼠科主要依据牙齿和头骨碎片等化石被认识。"},{"en":"The museum display includes a diagram showing where Ctenodontidae fits in rodent evolution.","zh":"博物馆展板上有一张示意图，展示栉齿鼠科在啮齿动物演化中的位置。"}]}],"phonetic":"/ˌtɛnəˈdɑːn.tɪ.diː/","extraExplanation":["词源拆解：cteno- 表示“梳子/栉状”，odont- 表示“牙齿”，-idae 是动物“科”的拉丁化后缀；整体含义可理解为“（牙齿呈栉状特征的）某某科”。","这是一个偏学术的拉丁学名，常出现在古生物学、系统分类学论文或博物馆说明中；日常英语里几乎不会用到。"]}
{"word":"ctenodontidae","summary":{"en":"Ctenodontidae is the scientific family name for gundis, small rodents mainly from North Africa.","zh":"Ctenodontidae 是冈迪鼠（gundis）的科学科名，指主要分布在北非的一类小型啮齿动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of small, rock-dwelling rodents (gundis) found mainly in North Africa.","zh":"一种啮齿目动物科（栉齿鼠科/冈迪鼠科），体型小，多栖息于岩石地带，主要分布在北非。"},"examples":[{"en":"Gundis belong to the family Ctenodontidae.","zh":"冈迪鼠属于栉齿鼠科（Ctenodontidae）。"},{"en":"Some Ctenodontidae live in rocky deserts and hide in crevices.","zh":"有些栉齿鼠科动物生活在多岩石的荒漠中，会躲在岩缝里。"}]}],"synonyms":["gundi family"],"phonetic":"/ˌtiːnoʊˈdɑːntɪdiː/","extraExplanation":["“Ctenodontidae”是生物分类学中的“科名”，常用于动物学、生态学或博物馆标签中；日常英语里更常见的俗名是“gundi（冈迪鼠）”。","词源上可拆为希腊语词根 cteno-（意为“梳子、栉”）+ odont-（意为“牙”）+ -idae（动物科名后缀），暗示其牙齿结构特征是分类依据之一。"]}
{"word":"Ctenodus","summary":{"en":"Ctenodus is an extinct genus of fossil lungfish, especially known from the Carboniferous period.","zh":"Ctenodus 是一种已灭绝的肺鱼属，主要以石炭纪化石而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of extinct lungfish (dipnoans) known from fossils, especially from the Carboniferous period.","zh":"一种已灭绝的肺鱼属（双呼吸类），主要见于化石记录，尤以石炭纪地层为常见。"},"examples":[{"en":"Scientists identified the fossil as Ctenodus based on its distinctive tooth plates.","zh":"科学家根据其独特的齿板把这块化石鉴定为 Ctenodus。"},{"en":"In the museum display, Ctenodus is shown as an early relative of modern lungfish.","zh":"在博物馆展柜中，Ctenodus 被展示为现代肺鱼的早期近亲。"}]}],"synonyms":["(no common everyday synonyms; related: lungfish, dipnoan)"],"phonetic":"ˈtɛnəˌdəs","extraExplanation":["词源提示：Ctenodus 来自希腊语词根 cten-（“梳子”，指梳状结构）+ -odus/-odon（“牙齿”），常用来强调其化石牙齿/齿板的形态特征。","背景知识：它属于古代的肺鱼类群（Dipnoi）。肺鱼的特点是既能用鳃呼吸，也能用“肺”样结构吸气；Ctenodus 常见于古生代（尤其石炭纪）沉积层的化石记录。","使用场景：这是古生物学/地质学中的专有名词，日常英语中几乎不使用；写作时通常首字母大写并用斜体表示属名（Ctenodus）。"]}
{"word":"ctenodus","summary":{"en":"Ctenodus is an extinct genus of lungfish known from fossils.","zh":"Ctenodus 是一种已灭绝的肺鱼属，以化石记录闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Ctenodus: a genus of extinct lungfish (a type of lobe-finned fish) known from fossil records, especially from the late Devonian to Carboniferous periods.","zh":"Ctenodus：一种已灭绝的肺鱼属（肉鳍鱼的一类），以化石记录闻名，主要出现在泥盆纪晚期到石炭纪。"},"examples":[{"en":"Fossils of Ctenodus help scientists understand early lungfish evolution.","zh":"Ctenodus 的化石有助于科学家了解早期肺鱼的演化。"},{"en":"The museum display included tooth plates attributed to Ctenodus.","zh":"博物馆展柜里有被归属于 Ctenodus 的齿板化石。"}]}],"synonyms":["lungfish (general term)","dipnoan (broader group)"],"phonetic":"ˈtɛnəˌdoʊdəs","extraExplanation":["这是一个古生物学里的拉丁化学名（属名），常见于论文、化石目录或博物馆说明牌中；一般不用于日常英语对话。","词源来自希腊语：ktenos（梳子）+ odous/odont-（牙齿），指它具有像“梳齿”一样的齿板（tooth plates）结构，用来磨碎食物。","相关学习词：lungfish（肺鱼）、dipnoan（肺鱼类/双呼吸类）、fossil（化石）、genus（属）、Carboniferous（石炭纪）。"]}
{"word":"ctenoid","summary":{"en":"Ctenoid describes (or names) a type of fish scale with a comb-like, toothed edge.","zh":"ctenoid 指（或名词化指）一种边缘像梳子、有细齿状突起的鱼鳞——栉鳞。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of fish scales) having a comb-like rear edge with small tooth-like projections; relating to this type of scale.","zh":"（鱼鳞）栉鳞的；指一种后缘像梳子一样、带有细小齿状突起的鱼鳞类型。"},"examples":[{"en":"Perch and many other bony fish have ctenoid scales.","zh":"鲈鱼和许多其他硬骨鱼都有栉鳞。"},{"en":"Under the microscope, the ctenoid scale shows tiny comb-like spines along its edge.","zh":"在显微镜下，栉鳞的边缘能看到细小的梳齿状棘突。"}]},{"partOfSpeech":"n.","definition":{"en":"a ctenoid scale (a fish scale with a comb-like edge).","zh":"栉鳞；指边缘呈梳齿状的鱼鳞。"},"examples":[{"en":"The sample contained both cycloid scales and a few ctenoids.","zh":"样本里既有圆鳞，也有少量栉鳞。"}]}],"synonyms":["comb-toothed (edge)","ctenoid scale"],"phonetic":"/ˈtiːnɔɪd/","extraExplanation":["“ctenoid”开头的 c- 通常不发音，常见读法类似 “TEE-noyd”。","词源来自希腊语 *kteis*（意为“梳子”），用来形容这种鱼鳞后缘像梳子一样的结构。","与之常一起出现的对比词是 **cycloid**（圆鳞）：圆鳞边缘较光滑；栉鳞边缘有细齿/棘突，摸起来更粗糙。"]}
{"word":"ctenoidean","summary":{"en":"Ctenoidean means “having or relating to ctenoid (comb-edged) fish scales.”","zh":"ctenoidean 指“具有或与栉鳞（后缘呈梳齿状的鱼鳞）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to ctenoid scales—comb-like fish scales with tiny spines or serrations along the rear edge (common in many perch-like fishes).","zh":"与“栉鳞（ctenoid scales）”有关的——一种鱼鳞，后缘带有细小的梳齿状刺或锯齿（常见于许多鲈形鱼类）。"},"examples":[{"en":"Perch often have ctenoidean scales that feel rough when you stroke them from tail to head.","zh":"鲈鱼常有栉鳞，从尾向头摸会觉得粗糙。"},{"en":"The field guide notes a ctenoidean texture on the fish’s flanks.","zh":"野外图鉴指出这条鱼体侧具有栉鳞的触感。"}]}],"synonyms":["ctenoid","comb-edged","serrated (edge)"],"phonetic":"/tɪˈnɔɪdiən/","extraExplanation":["“cteno-”来自希腊语 kteis/ktenos，意为“梳子”。因此 ctenoid/ctenoidean 都带有“梳齿状”的形象，用来描述鱼鳞后缘一排细小齿状突起。","在鱼类学里更常见的词是 ctenoid（栉鳞的）；ctenoidean 通常作为形容词变体使用，意思基本相同，常出现在较正式或学术性的描述中。","栉鳞常与 cycloid scales（圆鳞、边缘较光滑）对比：前者摸起来更“粗”，后者更“滑”。"]}
{"word":"Ctenoidei","summary":{"en":"Ctenoidei refers to a fish taxonomic group characterized by ctenoid (comb-edged) scales.","zh":"Ctenoidei 指一类以具有栉鳞（边缘呈梳齿状的鳞片）为特征的鱼类分类群名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A taxonomic group (often treated as a subdivision) of bony fishes that have ctenoid scales—scales with tiny comb-like edges.","zh":"一种硬骨鱼的分类群（常被视为亚类群/分支），其特征是具有栉鳞（边缘带细小“梳齿”状突起的鳞片）。"},"examples":[{"en":"Many perch-like fishes are associated with groups such as Ctenoidei because of their ctenoid scales.","zh":"许多鲈形鱼类常与 Ctenoidei 这类群联系在一起，因为它们具有栉鳞。"},{"en":"In some older biology texts, Ctenoidei appears as a name used in classifying bony fishes by scale type.","zh":"在一些较旧的生物学教材中，Ctenoidei 作为按鳞片类型来分类硬骨鱼的名称出现。"}]}],"synonyms":["ctenoid fishes (context-dependent)","group with ctenoid scales (descriptive)"],"phonetic":"/tɛˈnɔɪdiˌaɪ/","extraExplanation":["词源提示：ctenoid 来自希腊语词根，含义与“梳子（comb）”有关，指栉鳞后缘像细梳齿一样有小突起；-ei（或 -e(i)）常见于一些拉丁化/希腊化的分类学复数或类群名称。","使用提醒：Ctenoidei 属于较偏“分类学/文献用名”，在不同年代或不同分类体系中，其等级与包含范围可能有所变化；现代文献更常直接说 ctenoid scales（栉鳞）或用更具体的类群名称。"]}
{"word":"ctenoidei","summary":{"en":"Ctenoidei is a (mostly historical) fish group defined by having ctenoid, comb-edged scales.","zh":"Ctenoidei（栉鳞类）多指一种较偏历史/专门用法的鱼类分类群，其特征是具有边缘呈梳齿状的栉鳞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a taxonomic group of fishes characterized by ctenoid (“comb-edged”) scales; often used in older or specialized classifications for many spiny-rayed bony fishes.","zh":"（鱼类分类名）栉鳞类：以具有栉鳞（边缘像梳齿一样的鳞片）为特征的一类鱼；多见于较早或较专门的分类体系中，常泛指许多具硬棘的辐鳍鱼类。"},"examples":[{"en":"In some older textbooks, many perch-like fishes were placed in Ctenoidei because of their ctenoid scales.","zh":"在一些较早的教材里，许多鲈形类鱼因为具有栉鳞而被归入栉鳞类（Ctenoidei）。"},{"en":"The specimen’s comb-edged scales suggest it belongs to a ctenoid-type group such as Ctenoidei in historical classifications.","zh":"该标本的鳞片边缘呈梳齿状，提示它在历史分类中可能归入类似栉鳞类（Ctenoidei）的栉鳞型群。"}]}],"synonyms":["ctenoid fishes","ctenoid fish group"],"phonetic":"/ˌtiːnɔɪˈdi.aɪ/","extraExplanation":["词源提示：cten- 来自希腊语，意为“梳子”，对应“栉鳞（ctenoid scales）”边缘像梳齿一样的细小棘突；-oidei 表示“……类/……群”。","使用提醒：Ctenoidei 不是所有现代鱼类系统分类中都常用的正式阶元名称；在阅读论文或旧版教材时更常见。现代文献里更常直接说 ctenoid scales（栉鳞）或用更具体的目/科/属来分类。"]}
{"word":"ctenoidian","summary":{"en":"Ctenoidian means “having or relating to ctenoid (comb-edged) fish scales.”","zh":"ctenoidian 指“具有或与栉鳞（后缘带梳齿状小齿的鱼鳞）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a ctenoid scale (a fish scale with tiny comb-like teeth on the rear edge).","zh":"与栉鳞有关的；指一种鱼鳞，其后缘有细小的梳齿状突起（像梳子一样）。"},"examples":[{"en":"Perch and many other spiny-finned fish have ctenoid (ctenoidian) scales.","zh":"鲈鱼以及许多有硬棘鳍的鱼类都有栉鳞（ctenoid/ctenoidian scales）。"},{"en":"Under the microscope, the scale’s back edge looked distinctly ctenoidean.","zh":"在显微镜下，这片鳞的后缘明显呈栉鳞特征。"}]}],"synonyms":["ctenoid","ctenoidean","comb-edged (describing scales)"],"phonetic":"/ˌtiːnɔɪˈdiən/","extraExplanation":["“cteno-”来自希腊语 *ktenos*，意思是“梳子”。“ctenoid/ctenoidean/ctenoidian”都可用来表达“有梳齿状边缘的”。在鱼类学里常见的鳞片类型有“cycloid（圆鳞）”和“ctenoid（栉鳞）”；栉鳞的后缘带小齿，摸起来常更粗糙。","拼写提示：更常见的形式是 **ctenoid**（名词/形容词）或 **ctenoidean**（形容词）。你输入的 **ctenoidian** 属于较少见的变体，但含义基本相同。"]}
{"word":"ctenolium","summary":{"en":"“ctenolium” is not a common English word; it’s likely a misspelling or a scientific (Latin) term.","zh":"“ctenolium”不是常见英语词；更可能是拼写错误或科学（拉丁）术语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in general dictionaries; it is most likely a misspelling or a Latin/scientific name (e.g., used in biology).","zh":"不是常见英语词典里的标准词；更可能是拼写错误或拉丁/科学名称（如生物学中使用）。"},"examples":[{"en":"I couldn’t find “ctenolium” in a regular English dictionary—can you share the sentence or the field (biology, medicine, etc.)?","zh":"我在一般英语词典里找不到“ctenolium”——你能提供原句或所属领域（生物、医学等）吗？"},{"en":"If this is a species or genus name, the spelling needs to match the original scientific source exactly.","zh":"如果这是物种名或属名，拼写必须与原始科学来源完全一致。"}]}],"phonetic":"/ˌtiːnəˈliːəm/","extraExplanation":["“cteno-”是一个常见的科学词根，源自希腊语，意思与“梳子/栉状结构”有关（如 ctenophore“栉水母”一词里常见且 c 不发音）。因此你输入的“ctenolium”很可能与某个生物学术语或分类名称有关。","如果你本来想查的是另一个词，可能的近似拼写包括：ctenidium（某些软体动物的栉状鳃结构）、ctenium/ctenium-like（较少见的形态学用法）等。请把上下文句子或原文截图发来，我可以帮你确认准确词形与含义。"]}
{"word":"Ctenophora","summary":{"en":"Ctenophora is the scientific name for the phylum of comb jellies—transparent marine animals that swim with rows of cilia.","zh":"Ctenophora 是“栉水母门”的学名，指一类用成排纤毛游泳的透明海洋动物（梳状水母）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a phylum of marine animals known as comb jellies (ctenophores), with rows of tiny beating “comb” plates (cilia) used for swimming; many are transparent and bioluminescent.","zh":"栉水母门：一种海洋动物门类，俗称“栉水母/梳状水母（comb jellies）”，体表有成排像梳子一样摆动的纤毛板用于游泳；许多种类透明并会发光。"},"examples":[{"en":"Ctenophora are often seen drifting in coastal waters at night, sometimes glowing softly.","zh":"栉水母门动物常在夜间的近海水域漂浮，有时会发出柔和的光。"},{"en":"In a marine biology class, we learned that Ctenophora capture prey with sticky cells rather than stinging cells.","zh":"在海洋生物课上，我们学到栉水母门动物用黏性细胞捕食，而不是用刺细胞。"}]}],"synonyms":["comb jellies","ctenophores"],"phonetic":"ˌtiːnəˈfɔrə","extraExplanation":["“Ctenophora”常用于科学分类（一个“门”），对应的个体动物常称为“ctenophore（栉水母）/comb jelly（梳状水母）”。","词源来自希腊语：kteis（梳子）+ phoros（携带者），指它们身上成排的“栉板”（梳状纤毛带），在光照下常会呈现彩虹般的闪光。","它们与水母（刺胞动物门，Cnidaria）不同：栉水母门通常没有刺细胞（nematocysts），而多用黏细胞（colloblasts）来粘住猎物。"]}
{"word":"ctenophora","summary":{"en":"Ctenophora: the phylum of marine animals known as comb jellies.","zh":"ctenophora：指“栉水母门”，也就是梳状水母（comb jellies）所属的动物类群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group (phylum) of marine animals commonly called comb jellies, with rows of tiny hair-like structures that beat like “combs” to help them swim","zh":"栉水母门（栉水母）：一类海洋动物，常称“栉水母/梳状水母（comb jellies）”，身体表面有一排排像梳子一样摆动的纤毛带，用来游泳"},"examples":[{"en":"Ctenophora are often transparent and can glow in the dark ocean.","zh":"栉水母门的动物常常是透明的，在黑暗的海水中还可能发光。"},{"en":"In our marine biology class, we compared Ctenophora with jellyfish and learned they are different groups.","zh":"在海洋生物课上，我们把栉水母和水母作比较，发现它们属于不同的类群。"},{"en":"Some Ctenophora are predators that catch small plankton with sticky cells.","zh":"一些栉水母是捕食者，会用黏性的细胞捕捉小型浮游生物。"}]}],"synonyms":["comb jellies","ctenophores"],"phonetic":"/təˈnɑːfəɹə/","extraExplanation":["“Ctenophora”来自希腊语：ktenos（梳子）+ phoros（携带/承载），字面意思是“带梳子的”，指它们身上成排的“栉板”（comb rows）。","学习时容易和“jellyfish（水母，刺胞动物门）”混淆：栉水母不是水母，许多栉水母没有刺细胞（nematocysts），而是用黏细胞（colloblasts）粘住猎物。"]}
{"word":"ctenophoral","summary":{"en":"Ctenophoral means “related to ctenophores (comb jellies).”","zh":"ctenophoral 意为“与栉水母（comb jellies）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to ctenophores (comb jellies), a group of marine animals that swim using rows of tiny “comb” cilia.","zh":"与栉水母（comb jellies，一类海洋动物）有关的；指栉水母的，这类动物通过成排的“梳状”纤毛游动。"},"examples":[{"en":"Scientists recorded ctenophoral movement by filming the comb rows under blue light.","zh":"科学家在蓝光下拍摄梳状纤毛带，记录栉水母的运动。"},{"en":"The sample likely came from a ctenophoral species common in coastal waters.","zh":"该样本很可能来自一种常见于近海水域的栉水母。"}]}],"synonyms":["ctenophore-related","comb-jelly (used informally)"],"phonetic":"/ˌtiːnəˈfɔːrəl/","extraExplanation":["“ctenophoral”多见于生物学/海洋学的学术写作中，日常英语里更常说“ctenophore”或“comb jelly”。","词根提示：cteno- 来自希腊语，意为“梳子”，指栉水母体表成排的“梳状纤毛带”（comb rows）。"]}
{"word":"ctenophoran","summary":{"en":"A ctenophoran is a comb jelly: a transparent marine animal that swims using comb-like rows of cilia.","zh":"ctenophoran 指“栉水母/栉水母类”（comb jelly），一种透明的海洋动物，靠梳状纤毛带游动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A comb jelly (a marine invertebrate animal in the phylum Ctenophora), usually transparent and moving with rows of tiny beating cilia that look like “combs.”","zh":"栉水母（栉水母门的海洋无脊椎动物），通常透明，靠一排排像“梳子”的纤毛摆动游动。"},"examples":[{"en":"Scientists observed a ctenophoran drifting near the surface at night.","zh":"科学家观察到一只栉水母在夜间漂浮在海面附近。"},{"en":"Unlike jellyfish, many ctenophorans use sticky cells to catch prey.","zh":"与水母不同，许多栉水母会用黏细胞来捕捉猎物。"}]}],"synonyms":["comb jelly","ctenophore"],"phonetic":"/ˌtɛnəˈfɔrən/","extraExplanation":["词源：ctenophoran 来自希腊语 cten-（“梳子”）+ -phora（“携带”），字面意思是“带梳子的”，指它们体表有八条“栉板”（像梳齿一样的纤毛带），游动时常会出现彩虹般的闪光效果。","学习提示：英语里更常见的通俗说法是 comb jelly；ctenophoran 更偏学术/科普写作。拼写中 cten- 的 c 通常不发音。"]}
{"word":"ctenophore","summary":{"en":"A ctenophore is a comb jelly: a jelly-like marine animal that swims with rows of tiny “comb” cilia.","zh":"ctenophore 指“栉水母/栉海蜇（comb jelly）”：一种胶状的海洋动物，靠一排排“梳状”纤毛带游动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, jelly-like marine animal (often called a comb jelly) that swims using rows of tiny hair-like structures (\"combs\").","zh":"一种生活在海洋中的胶状小动物（常称“栉水母/栉海蜇”，英文也叫 comb jelly），靠身体表面的“梳状纤毛带”划水游动。"},"examples":[{"en":"Ctenophores are often mistaken for jellyfish, but they belong to a different group.","zh":"栉水母常被误认为水母，但它们属于不同的类群。"},{"en":"At night, some ctenophores glow softly in the water.","zh":"夜里，有些栉水母会在水中发出柔和的光。"}]}],"synonyms":["comb jelly","sea gooseberry"],"phonetic":"/ˈtiːnəˌfɔr/","extraExplanation":["词源来自希腊语：cteno- 表示“梳子”，-phore 表示“携带/承载”，合起来指“带梳状结构的动物”，因为它们身体上有一排排像梳齿的纤毛带（comb rows）。","常见学习提示：ctenophore 以“ct”开头，c 通常不发音，读音更像“TEEN-uh-for”。","与水母的区别（常见误解）：栉水母通常靠纤毛带游泳，而水母主要靠收缩伞状身体推进；另外它们在生物分类上也不同。"]}
{"word":"ctenophoric","summary":{"en":"Ctenophoric means ‘related to comb jellies (ctenophores)’ or ‘comb-structured,’ mainly used in scientific writing.","zh":"ctenophoric 指“与栉水母有关的”或“具有梳状结构的”，主要用于科学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or characteristic of ctenophores (comb jellies), especially their comb-like rows of cilia used for swimming.","zh":"与栉水母（ctenophores，俗称“梳状水母/栉水母”）有关的；尤指它们用于游泳的“梳状纤毛带（栉板）”这一特征。"},"examples":[{"en":"Ctenophoric locomotion depends on eight shimmering rows of cilia.","zh":"栉水母式（ctenophoric）的运动依赖八排闪光的纤毛带。"},{"en":"The researchers compared ctenophoric development with that of cnidarians like jellyfish.","zh":"研究人员将栉水母类（ctenophoric）的发育与刺胞动物（如水母）的发育进行了比较。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having or resembling comb-like structures (ctenes), especially in a biological or anatomical description.","zh":"（生物/解剖学）具有或类似梳状结构（ctenes/“栉”）的。"},"examples":[{"en":"Under the microscope, the specimen showed a ctenophoric pattern along the body surface.","zh":"在显微镜下，这个标本在体表呈现出梳状（ctenophoric）的排列模式。"},{"en":"The paper describes a ctenophoric arrangement of hair-like projections.","zh":"论文描述了毛状突起呈梳状（ctenophoric）的排列。"}]}],"synonyms":["ctenophore-related","ctenophoran","comb-like"],"phonetic":"/ˌtɛnəˈfɔrɪk/","extraExplanation":["词源提示：cteno- 来自希腊语 kteis/ktenos，意为“梳子”；-phoric 来自 -phoros，意为“携带/具有”。因此 ctenophoric 字面意思是“带梳状结构的”。","使用场景：该词多见于海洋生物学、动物学与演化研究文献中，用来描述“栉水母”或“梳状结构”。日常英语中很少使用。"]}
{"word":"ctenophorous","summary":{"en":"Ctenophorous means “comb-bearing,” especially describing organisms (like comb jellies) with rows of comb-like plates.","zh":"ctenophorous 意为“具栉（梳）状结构的”，常用于描述栉水母等具有成排梳板的生物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having or bearing comb-like structures (ctenes), especially referring to animals like comb jellies (ctenophores) that have rows of tiny “comb” plates used for swimming.","zh":"具栉状（梳状）结构的；栉（梳）状纤毛板（ctenes）发达的（尤指栉水母等具有成排“梳板”用于游动的动物）。"},"examples":[{"en":"Ctenophorous animals move through the water using shimmering rows of comb plates.","zh":"栉状结构发达的动物会用闪烁的成排梳板在水中游动。"},{"en":"In the lab, we observed a ctenophorous jelly drifting near the surface.","zh":"在实验室里，我们观察到一只具栉状结构的栉水母在水面附近漂浮。"}]}],"synonyms":["comb-bearing","ctene-bearing","ctenophore-like"],"phonetic":"/təˈnɑːfərəs/","extraExplanation":["词源提示：ctenophorous 来自希腊语词根 *cteno-*（意为“梳子、栉”）+ *-phorous*（“携带的、具有……的”，同源于 *-phore*）。因此字面意思就是“带梳子的/带栉的”。","使用场景：这是生物学/动物学中的描述性形容词，日常英语很少用；更常见的相关名词是 **ctenophore**（栉水母，comb jelly）。"]}
{"word":"Ctenoplana","summary":{"en":"Ctenoplana is a scientific genus name for flattened, bottom-dwelling comb jellies (ctenophores).","zh":"Ctenoplana 是一个学名属名，指一类扁平、底栖的栉水母（栉水母门动物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small, flattened marine comb jellies (ctenophores) that live on the sea floor rather than drifting in open water","zh":"栉水母门（栉水母，comb jellies）中的一个属；体形扁平、常栖息在海底（底栖）而非在水体中漂浮的海洋动物"},"examples":[{"en":"Ctenoplana species are benthic comb jellies often found creeping on seaweed or rocks.","zh":"Ctenoplana 属的物种是底栖栉水母，常见于海藻或岩石表面缓慢移动。"},{"en":"In a marine biology class, we compared Ctenoplana with drifting comb jellies that swim in open water.","zh":"在海洋生物课上，我们把 Ctenoplana 与在开放水域游动、漂浮生活的栉水母作了比较。"}]}],"synonyms":["comb jelly (general term)","ctenophore (general term)"],"phonetic":"/ˌtɛnəˈpleɪnə/","extraExplanation":["这是一个拉丁化的学名（属名），日常英语里更常用的上位词是 comb jelly（栉水母）或 ctenophore（栉水母动物）。","词源上常被解释为来自希腊语 cteno-（“梳子/栉”，指其“栉板”结构）与 -plana（“平的/扁平的”相关），对应其扁平、底栖的形态特点。"]}
{"word":"ctenoplana","summary":{"en":"Ctenoplana is a scientific genus name for certain small marine comb jellies.","zh":"Ctenoplana 是某些小型海洋栉水母的科学属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of small marine comb jellies (ctenophores) that are often flattened and disk-shaped, living in the ocean.","zh":"栉水母的一属（属名：Ctenoplana）；一种海洋栉水母，通常体形扁平、呈圆盘状，生活在海中。"},"examples":[{"en":"Ctenoplana is a type of comb jelly found in marine environments.","zh":"Ctenoplana 是一种生活在海洋环境中的栉水母。"},{"en":"The researcher observed a Ctenoplana specimen under a microscope.","zh":"研究人员在显微镜下观察了一只 Ctenoplana 标本。"}]}],"synonyms":["comb jelly","ctenophore"],"phonetic":"/ˌtiːnəˈpleɪnə/","extraExplanation":["“Ctenoplana”是拉丁化的科学属名，常见于生物分类、海洋生物学与学术写作中；日常英语里更常用的上位类群名称是“comb jelly（栉水母）”或“ctenophore（栉水母门动物）”。","词源提示：cteno- 表示“梳、栉”（指栉水母的“梳板”结构），-plana 与“平、扁平”相关，呼应其常见的扁平盘状体形。"]}
{"word":"Ctenostomata","summary":{"en":"Ctenostomata is a scientific name for an order of soft-bodied bryozoans (moss animals), usually living in colonies attached to marine surfaces.","zh":"Ctenostomata 是苔藓动物的一目，常为柔软体、群体生活，多附着在海洋中的各种表面。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a taxonomic group (an order) of bryozoans (“moss animals”) that generally have soft bodies and a flexible, non-calcified outer covering, often found encrusting seaweed, shells, or rocks","zh":"（生物分类）一类苔藓动物（又称“苔藓虫”“海苔虫”）的分类群（目），通常体壁较柔软，外被多为不钙化、较有弹性的外皮，常附着在海藻、贝壳或岩石等基质上"},"examples":[{"en":"Ctenostomata are bryozoans that often form delicate colonies on seaweed.","zh":"Ctenostomata 是一类苔藓动物，常在海藻上形成细致的群体。"},{"en":"In this survey, several Ctenostomata species were recorded from shallow coastal waters.","zh":"在这次调查中，研究人员在浅海沿岸水域记录到了多种 Ctenostomata 物种。"}]}],"synonyms":["ctenostomes"],"phonetic":"/ˌtiːnoʊˈstɑːmətə/","extraExplanation":["词源提示：Ctenostomata 来自希腊语，cteno- 表示“梳子”，stoma 表示“口”。名称与其口部结构（常被描述为与“梳状/齿状”有关的特征）相关。","用法提示：该词多见于动物学/海洋生物学文献中，常作为分类名使用；写作中通常首字母大写，表示一个正式的分类单元。"]}
{"word":"ctenostomata","summary":{"en":"Ctenostomata are mostly soft-bodied bryozoans that usually do not have a hard, calcified skeleton.","zh":"Ctenostomata 指多为柔软体、通常缺少坚硬钙化骨骼的一类苔藓动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group (order/suborder) of soft-bodied bryozoans (“moss animals”) that usually lack a hard, calcified skeleton and often have a flexible, tube-like covering.","zh":"一种（目/亚目）柔软的苔藓动物（又称“苔藓虫”）类群，通常没有坚硬的钙化骨骼，常具有柔软的管状外被。"},"examples":[{"en":"Many ctenostomata form delicate colonies on seaweeds and rocks in shallow water.","zh":"许多 Ctenostomata 会在浅海的海藻和岩石上形成细致的群体。"},{"en":"Because ctenostomata are not strongly calcified, they may be harder to preserve as fossils.","zh":"由于 Ctenostomata 不太钙化，它们可能更难以形成化石保存下来。"}]}],"synonyms":["ctenostomes"],"phonetic":"/ˌtiːnəˈstoʊmətə/","extraExplanation":["这是一个生物分类学术语，常见于海洋生物学与无脊椎动物学的论文或图鉴中。日常英语里很少用到。","词源上与希腊语有关：cteno- 表示“梳状/梳齿”，-stomata 表示“口/开口（复数）”，与其某些结构的“梳状开口”特征相关。","更常见的替代表达是 ctenostomes（指该类群的成员）。"]}
{"word":"ctenostomatous","summary":{"en":"A scientific adjective describing bryozoans with a comb-like mouth opening; related to Ctenostomata.","zh":"用于生物学的形容词，指口部开口呈梳状的苔藓虫；与栉口目（Ctenostomata）相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of certain bryozoans/moss animals) having a comb-like structure at the opening of the mouth; relating to the group Ctenostomata.","zh":"（指某些苔藓虫/海苔虫）口部开口处具有梳状结构的；与“栉口目（Ctenostomata）”有关的。"},"examples":[{"en":"Ctenostomatous bryozoans often have soft bodies compared with many other bryozoans.","zh":"栉口目的苔藓虫相较于许多其他苔藓虫，身体常更柔软。"},{"en":"The researcher identified a ctenostomatous species by its comb-like mouth opening.","zh":"研究人员通过其梳状的口部开口鉴定出一种栉口目的物种。"}]}],"synonyms":["ctenostome (adj.)"],"phonetic":"/ˌtɛnoʊˈstɑmətəs/","extraExplanation":["词源提示：cteno- 来自希腊语 *kteis/kténos*（“梳子”），-stoma 来自希腊语 *stóma*（“嘴、口”），合起来就是“梳状的口”。","使用语境：这是生物学/动物学中的专业形容词，多见于学术论文、物种描述或分类学材料；日常英语里几乎不使用。"]}
{"word":"ctenostome","summary":{"en":"a soft-bodied, non-calcified bryozoan (member of Ctenostomata)","zh":"栉口目成员；一种软体、非钙化的苔藓动物"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of bryozoan (moss animal) that has a soft body wall and lacks a hard, calcified skeleton; a member of the group Ctenostomata","zh":"一种苔藓动物（外肛动物），体壁柔软、没有钙化的硬骨骼；指“栉口目（Ctenostomata）”的成员"},"examples":[{"en":"Ctenostomes often form delicate colonies on seaweed, shells, or rocks.","zh":"栉口目苔藓动物常在海藻、贝壳或岩石上形成细致的群体。"},{"en":"Because the colony is not calcified, a ctenostome may be harder to preserve as a fossil.","zh":"由于群体不钙化，栉口目苔藓动物往往不容易保存成化石。"}]}],"synonyms":["ctenostomatous bryozoan","member of Ctenostomata"],"phonetic":"/ˈtiːnəˌstoʊm/","extraExplanation":["词源来自希腊语：cteno- 表示“梳子/栉”（常指“栉状结构”），-stome 表示“口”。该类群名称与其触手冠（lophophore）等结构的形态特征相关。","在入门生物学或海洋生态学语境里，它通常与“bryozoan/ectoproct（苔藓动物/外肛动物）”一起出现，用来区分“软体、非钙化”的类群与“钙化、较坚硬”的苔藓动物类群。"]}
{"word":"CTERM","summary":{"en":"CTERM is usually an abbreviation meaning either the C-terminus of a protein (biology) or “contract term(s)” (business), depending on context.","zh":"CTERM通常是缩写，常见含义要么指蛋白质的C端（生物学），要么指“合同期限/条款”（商务），需结合上下文判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(biology) the C-terminus (C-terminal end) of a protein or peptide—the end with a free carboxyl group (-COOH).","zh":"（生物学）蛋白质或肽链的C端（C-terminal end、羧基端）——带有游离羧基（-COOH）的一端。"},"examples":[{"en":"This mutation changes the last 10 amino acids at the CTERM of the protein.","zh":"这个突变改变了该蛋白质CTERM（C端）的最后10个氨基酸。"},{"en":"The antibody was designed to bind the protein’s CTERM region.","zh":"这种抗体被设计用来结合该蛋白质的CTERM（C端）区域。"}]},{"partOfSpeech":"other","definition":{"en":"(business/contract writing, informal) abbreviation for “contract term(s)”—the agreed conditions or length of a contract.","zh":"（商务/合同写作，非正式）“contract term(s)”的缩写——指合同期限或合同条款/约定条件。"},"examples":[{"en":"Please review the CTERM before you sign.","zh":"签字前请先审阅CTERM（合同条款/期限）。"},{"en":"CTERM: 12 months, renewable upon agreement.","zh":"CTERM：12个月，经双方同意可续签。"}]}],"synonyms":["C-terminus","C-terminal","C-term","contract term(s)"],"phonetic":"/ˌsiːˈtɝːm/","extraExplanation":["“CTERM”不是一个非常标准、通用的英语单词，更常见的是写作“C-term / C-terminus / C-terminal”（生物学）或直接写“contract term(s)”（合同）。在论文、实验记录里如果看到CTERM，通常指蛋白质的C端；在公司邮件或表格里，则可能是内部缩写，具体以文件上下文为准。"]}
{"word":"Ctesiphon","summary":{"en":"Ctesiphon is an ancient city near modern Baghdad, historically a major Persian imperial capital.","zh":"Ctesiphon（泰西封）是靠近今巴格达的古城，历史上曾是重要的波斯帝国都城。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient city on the Tigris River near modern Baghdad (in present-day Iraq), famous for being a major capital of the Parthian and Sasanian Persian empires.","zh":"一座古代城市，位于底格里斯河畔、靠近今巴格达（今伊拉克）。它曾是帕提亚帝国与萨珊帝国的重要都城。"},"examples":[{"en":"Ctesiphon was one of the most important cities of the late ancient Near East.","zh":"泰西封是古代晚期近东地区最重要的城市之一。"},{"en":"The famous arch at Ctesiphon is often linked to Sasanian imperial architecture.","zh":"泰西封著名的拱门常被认为与萨珊王朝的帝国建筑风格有关。"}]}],"synonyms":["Tisfun (variant form)"],"phonetic":"ˈtɛsɪfɑn","extraExplanation":["“Ctesiphon”是英语中对该城希腊-拉丁传统名称的拼写，中文常译作“泰西封”。它与罗马帝国长期对峙的波斯诸帝国关系密切，因此在西方历史写作中常作为“罗马—波斯边境战争”的关键地名出现。","遗址最著名的地标是巨大的砖拱建筑“泰西封拱门”（Taq Kasra），常被用于介绍萨珊时期的工程与宫殿建筑。","在文学与历史叙述里，Ctesiphon常被用来象征“东方帝国的都城/权力中心”，类似于在欧洲语境中提到“Rome（罗马）”或“Constantinople（君士坦丁堡）”的象征作用。"]}
{"word":"Ctesippus","summary":{"en":"Ctesippus is a Greek male name, best known as a character in Plato’s *Euthydemus*.","zh":"Ctesippus 是一个古希腊男性名字，最著名的用法是指柏拉图《尤西弗德谟》中的人物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A male Greek personal name; in classical literature, Ctesippus is best known as a character in Plato’s dialogue *Euthydemus* (a young man involved in a debate with sophists).","zh":"一个古希腊男性人名；在古典文学中，“Ctesippus”最常见的指代是柏拉图对话篇《尤西弗德谟》（*Euthydemus*）中的人物（一位参与与智者辩论的青年）。"},"examples":[{"en":"In Plato’s *Euthydemus*, Ctesippus challenges the sophists’ wordplay.","zh":"在柏拉图的《尤西弗德谟》中，Ctesippus 质疑智者们的诡辩和文字游戏。"},{"en":"The name Ctesippus appears in discussions of ancient Greek philosophy and rhetoric.","zh":"在关于古希腊哲学与修辞的讨论中，经常会提到名字 Ctesippus。"}]}],"synonyms":["Ctesippos (variant transliteration)"],"phonetic":"/ˈtɛsɪpəs/","extraExplanation":["“Ctesippus”是拉丁化/英语化的古希腊人名，常见于古典文本与学术写作中，日常英语里几乎不会用作普通词汇。","在《尤西弗德谟》中，他与苏格拉底及两位智者（Euthydemus、Dionysodorus）同场，常被用来展示“诡辩（sophistry）”如何通过偷换概念制造似是而非的结论。","该名也可见不同转写（如 Ctesippos），属于从希腊字母转写到拉丁字母时的拼写差异。"]}
{"word":"Ctesius","summary":{"en":"Ctesius is a rare spelling of the ancient Greek historian Ctesias.","zh":"Ctesius 是古希腊历史学家 Ctesias（克特西亚斯）的一种少见拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper name) A rare variant/Latinized spelling used to refer to Ctesias, an ancient Greek physician and historian (5th century BCE) known for writings about Persia and India.","zh":"（专有名词）一种较少见的拼写/拉丁化写法，用来指代克特西亚斯（Ctesias）：公元前5世纪的古希腊医生兼历史学家，以记述波斯与印度的作品著名。"},"examples":[{"en":"Some older sources spell the historian’s name as Ctesius, but modern books usually use Ctesias.","zh":"一些较早的资料把这位历史学家的名字写作 Ctesius，但现代书籍通常写作 Ctesias。"},{"en":"Ctesius (Ctesias) is often mentioned when discussing Greek accounts of the Persian court.","zh":"在讨论希腊人对波斯宫廷的记载时，经常会提到 Ctesius（Ctesias）。"}]}],"synonyms":["Ctesias"],"phonetic":"/ˈtiːsiəs/","extraExplanation":["“Ctesius”在现代英语里非常少见，多出现在旧译、旧版百科或拉丁化的人名索引中。更常见、也更标准的形式是“Ctesias”。","克特西亚斯（Ctesias）据说曾在波斯宫廷担任医师，作品《Persica》（《波斯史》）与《Indica》（《印度志》）多以转述与传闻为主，因此在学术讨论中常被拿来比较“故事性”和“史料可靠性”。"]}
{"word":"ctetology","summary":{"en":"Ctetology is a rare word meaning the study or theory of property and ownership.","zh":"ctetology 指关于财产与所有权的研究或理论，是一个较少见的词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the study or theory of property (especially acquired wealth) and ownership; a rare term used in philosophy, law, or economics contexts","zh":"财产学；关于财产（尤指后天获得的财富）与所有权的研究或理论（较罕见，多见于哲学、法律或经济学语境）"},"examples":[{"en":"In his early essays, he sketched a kind of ctetology focused on how private property shapes society.","zh":"在他早期的文章中，他勾勒出一种“财产学”，重点讨论私有财产如何塑造社会。"},{"en":"The seminar compared political theory with ctetology, asking what it means to “own” land.","zh":"研讨课把政治理论与财产学作比较，讨论“拥有”土地究竟意味着什么。"}]}],"synonyms":["theory of property","property theory","property rights","ownership studies"],"phonetic":"/ˌtiːtəˈtɑːlədʒi/","extraExplanation":["这个词非常少见，更多时候人们会用更常见的表达，如 the theory of property（财产理论）、property rights（财产权）、ownership（所有权）等。","词源上常被解释为来自希腊语词根，和“获得的财产/占有”相关；因此它强调“占有/所有”这一概念，而不只是一般意义上的“钱或财富”。"]}
{"word":"ctf","summary":{"en":"CTF usually means “Capture the Flag,” either a real-world team game or a cybersecurity competition to find hidden “flags” (secret codes).","zh":"CTF 通常指“Capture the Flag（夺旗赛）”，既可指现实团队游戏，也可指网络安全竞赛：通过找到隐藏的“flag”（密钥/代码）得分。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Capture the Flag: a game or competition where players try to take the other team’s “flag” (or a virtual flag) while protecting their own.","zh":"夺旗赛：一种游戏或竞赛形式，玩家要在保护己方“旗帜”（或虚拟旗帜）的同时，设法夺取对方旗帜。"},"examples":[{"en":"We played CTF at summer camp and had to sneak into the other team’s area to grab their flag.","zh":"我们在夏令营玩夺旗赛，需要偷偷潜入对方区域去夺旗。"},{"en":"In an online CTF, you might solve puzzles to find a hidden flag string.","zh":"在网络夺旗赛中，你可能需要解谜来找到隐藏的 flag 字符串。"}]},{"partOfSpeech":"n.","definition":{"en":"(Cybersecurity) A contest where you solve security or programming challenges to find “flags” (secret codes) and score points.","zh":"（网络安全）一种竞赛：通过解决安全或编程题目找到“flag”（隐藏的密钥/代码）来得分。"},"examples":[{"en":"She joined a CTF to practice web security and reverse engineering.","zh":"她参加 CTF 来练习 Web 安全和逆向工程。"},{"en":"Our team won the CTF by finding the flag in the binary challenge.","zh":"我们队通过在二进制题里找到 flag 赢得了 CTF。"}]}],"synonyms":["Capture the Flag","cybersecurity challenge","hacking competition"],"phonetic":"/ˌsiː tiː ˈɛf/","extraExplanation":["“CTF”最常见是缩写：Capture the Flag。既可以指现实中的团队夺旗游戏，也可以指网络安全领域的竞赛形式。","网络安全 CTF 里常见题型包括：Web、Pwn（漏洞利用）、Crypto（密码学）、Reverse（逆向）、Forensics（取证）等；“flag”通常是一段特定格式的字符串，用来提交得分。","口语中一般直接读字母：C-T-F（而不是读成一个单词）。"]}
{"word":"ctg","summary":{"en":"CTG is an abbreviation most commonly meaning cardiotocography (fetal heart and contraction monitoring); in other contexts it can mean “category” or other initials depending on context.","zh":"CTG最常见是胎心宫缩监测（cardiotocography）的缩写；在其他语境中也可能表示“分类/类别”或其他首字母缩写，需结合上下文判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for cardiotocography: a medical test that records a baby’s heart rate and the mother’s uterine contractions during pregnancy/labor","zh":"cardiotocography（胎心宫缩监测）的缩写：一种在孕期或分娩时记录胎儿心率与子宫收缩的医学检查"},"examples":[{"en":"The doctor ordered a CTG to monitor the baby during labor.","zh":"医生安排做CTG来在分娩过程中监测胎儿情况。"},{"en":"Her CTG results were normal, so she was able to go home.","zh":"她的CTG结果正常，所以可以回家。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for a category (often used online or in filenames), short for “category”","zh":"“类别/分类”的缩写（常见于网络或文件命名中），相当于category"},"examples":[{"en":"Put this file in the CTG folder for invoices.","zh":"把这个文件放到发票的CTG（分类）文件夹里。"},{"en":"Choose the correct CTG before submitting the form.","zh":"提交表格前请选择正确的CTG（类别）。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation that can mean different things depending on the field (e.g., company/team initials); the intended meaning usually comes from context","zh":"在不同领域可能代表不同含义的缩写（如公司/团队名称首字母）；具体意思通常要看上下文"},"examples":[{"en":"CTG will present the quarterly report tomorrow.","zh":"CTG明天将做季度报告展示。"},{"en":"I’m not sure what CTG stands for here—can you clarify?","zh":"我不确定这里的CTG指什么——你能说明一下吗？"}]}],"synonyms":["cardiotocography","fetal monitoring (contextual)","category (contextual)"],"phonetic":"/ˌsiː tiː ˈdʒiː/","extraExplanation":["“CTG”在医疗英语里最常见，尤其在产科场景中几乎默认指胎心宫缩监测（cardiotocography）。日常聊天或网络语境中，如果没有怀孕/分娩相关信息，就需要根据上下文判断是否是“category/分类”、组织名称缩写等。","读法通常按字母读：C-T-G。写作时可全大写（CTG），有时也会写作ctg（更像文件名/标签）。"]}
{"word":"ctge","summary":{"en":"“CTGE” is not a common English word; it’s usually a context-specific abbreviation.","zh":"“CTGE”不是常见英语单词，通常是依赖语境的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An initialism (a set of letters) that does not have a single, widely accepted meaning in general English; it is usually used as a specific abbreviation within a particular field, organization, or document.","zh":"一个首字母缩写（由字母组成），在通用英语中没有公认、固定的含义；通常只在特定领域、组织或文件语境中作为缩写使用。"},"examples":[{"en":"I couldn’t find a common dictionary meaning for “CTGE”—can you share the sentence or the topic?","zh":"我在词典里找不到“CTGE”的常见含义——你能提供它出现的句子或主题吗？"},{"en":"In many reports, letter strings like CTGE are explained the first time they appear.","zh":"在很多报告里，像 CTGE 这样的字母缩写会在首次出现时被解释清楚。"}]}],"synonyms":["abbreviation","initialism","acronym"],"phonetic":"/ˌsiːtiːdʒiːˈiː/","extraExplanation":["“CTGE”更像是某个专业领域或机构内部用的缩写，而不是日常英语单词。没有上下文时，无法判断它具体代表什么。","你可以把它出现的完整句子、所属领域（比如医学/工程/学校/公司）或它的全称（如果有）发我，我就能帮你确定准确意思与用法。"]}
{"word":"Cthrine","summary":{"en":"“Cthrine” is not a standard English word; it is usually a misspelling or rare variant of the name “Catherine.”","zh":"“Cthrine”不是标准英语单词；通常是名字“Catherine”的拼写错误或罕见变体。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A misspelling or uncommon variant of the female given name “Catherine” (also spelled Katherine, Kathryn, Cathrine).","zh":"女性名字“Catherine”的拼写错误或罕见变体（也常见拼写为 Katherine、Kathryn、Cathrine）。"},"examples":[{"en":"I think “Cthrine” is a typo—did you mean “Catherine”?","zh":"我觉得“Cthrine”可能是打错了——你是想写“Catherine”吗？"},{"en":"Her name is Catherine, but some documents spelled it as “Cthrine.”","zh":"她叫 Catherine，但有些文件把它拼成了“Cthrine”。"}]}],"synonyms":["Catherine","Katherine","Kathryn","Cathrine"],"phonetic":"/ˈkæθərɪn/","extraExplanation":["“Cthrine”这一拼写在英语里非常不常见，日常使用中通常会被视为拼写错误。更常见的形式是 Catherine / Katherine / Kathryn / Cathrine。","Catherine 这个名字常被认为与希腊语词根有关，传统上常被解释为与“纯洁（pure）”的含义相关；在英语文化中也因多位历史人物与圣人而广为流传。"]}
{"word":"ctimo","summary":{"en":"“ctimo” isn’t a recognized English word; please provide context so I can identify what you meant.","zh":"“ctimo”不是常见英语词；请提供上下文以便我判断你想表达的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a typo, a username, an acronym, or a name.","zh":"不是标准英语单词；更可能是拼写错误、用户名、缩写或专有名词。"},"examples":[{"en":"I couldn’t find “ctimo” in an English dictionary—could you share the sentence it appears in?","zh":"我在英语词典里找不到“ctimo”——你能把它出现的句子发我吗？"},{"en":"Maybe you meant “timid” or “c-time”?","zh":"你是不是想写“timid（胆小的）”或“c-time（某种写法/术语）”？"}]}],"phonetic":"/ˈsiː tiːmoʊ/","extraExplanation":["“ctimo”本身不像常见英语词汇。最常见的情况是：1）键盘误触/拼写错误；2）缩写（不同领域含义不同）；3）人名/网名。","如果你告诉我它出现的语境（例如一句话、学科领域、或你想表达的中文意思），我可以帮你判断最可能的正确单词并给出词义与用法。","你也可以检查是否想输入：timo（人名）、timid（胆小的）、c-time / see time（口语里可能表示“见面时间/上课时间”等，但不固定）。"]}
{"word":"CTIO","summary":{"en":"CTIO usually refers to a top executive in charge of an organization’s technology strategy and innovation.","zh":"CTIO通常指负责组织技术战略与创新的高管职位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abbreviation for a senior executive role, most commonly “Chief Technology and Innovation Officer” (sometimes “Chief Technology and Information Officer”), responsible for technology strategy and innovation in an organization","zh":"一个高层管理职位的缩写，最常见指“首席技术与创新官”（有时也指“首席技术与信息官”），负责组织的技术战略与创新推进"},"examples":[{"en":"Our CTIO is leading the company’s AI roadmap for the next two years.","zh":"我们的CTIO正在主导公司未来两年的AI路线图。"},{"en":"The CTIO works with product and engineering teams to turn new ideas into services.","zh":"CTIO与产品和工程团队合作，把新点子落地成服务。"}]}],"synonyms":["CTO","CIO","Chief Innovation Officer"],"phonetic":"/ˌsiː tiː aɪ ˈoʊ/","extraExplanation":["“CTIO”不是一个固定、全球统一的头衔缩写，不同机构可能有不同展开方式。最常见的两种是：Chief Technology and Innovation Officer（更强调创新与技术落地）和 Chief Technology and Information Officer（更强调信息/IT治理与技术战略）。","在正式写作或简历里，首次出现时建议写全称并在括号中注明缩写，例如：Chief Technology and Innovation Officer (CTIO)，以避免歧义。"]}
{"word":"ction","summary":{"en":"“-ction” is a common ending in English nouns, usually meaning an action/process or its result, and is often pronounced like “-kshun.”","zh":"“-ction”是英语名词里常见的词尾，通常表示“行为/过程”或“结果”，读音常类似“-kshun”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(common spelling unit/suffix) Used at the end of many nouns to mean “the act or process of doing something” or “the result of an action,” often pronounced like “-kshun.”","zh":"（常见拼写片段/后缀）出现在许多名词词尾，表示“做某事的行为/过程”或“行动的结果”，读音常类似“-kshun”。"},"examples":[{"en":"The word “action” ends in -ction and means “the act of doing.”","zh":"“action”以-ction结尾，意思是“做某事的行为”。"},{"en":"“Election” (e- + -lection) is the process of choosing leaders.","zh":"“election”（e- + -lection）指“选举领导人的过程”。"},{"en":"“Production” is the process of making goods.","zh":"“production”指“生产商品的过程”。"}]}],"phonetic":"/kʃən/","extraExplanation":["“-ction”本身通常不单独作为一个英语单词使用，更常见的情况是：你可能想查的是“action”。如果你是在学拼读/词缀，可以把-ction理解为很多名词里常见的词尾拼写模式，发音多为 /kʃən/（类似“kshun”），常与动词或拉丁来源的词根相关。","常见同类结尾还有：-sion（decision）、-tion（nation）、-xion（connexion/connection）。它们在拼写上不同，但结尾的发音经常相近，学习时可以一起对比记忆。"]}
{"word":"CTM","summary":{"en":"CTM is an abbreviation. Common meanings include “Customer-to-Manufacturer” (business) and “close to me” (informal texting).","zh":"CTM是缩写。常见含义包括商业中的“客户直达制造商”，以及聊天中的“离我很近/在我附近”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(business, supply chain) Customer-to-Manufacturer: a model where customers’ orders or needs go directly to a manufacturer (often cutting out middlemen).","zh":"（商业/供应链）Customer-to-Manufacturer（客户直达制造商）：指客户的订单或需求直接传达给制造商的模式（常用于减少中间环节）。"},"examples":[{"en":"The brand shifted to a CTM model so customers could customize products directly with the factory.","zh":"这个品牌转向CTM模式，让客户可以直接与工厂定制产品。"},{"en":"CTM can reduce inventory because items are made closer to demand.","zh":"CTM可以减少库存，因为产品更接近需求才生产。"}]},{"partOfSpeech":"other","definition":{"en":"(texting, informal) Close to me: used in messages to mean “nearby / in my area.”","zh":"（短信/网络用语）Close to me：在消息中表示“离我很近/在我附近”。"},"examples":[{"en":"Is there a good café CTM?","zh":"我附近（CTM）有好咖啡馆吗？"},{"en":"Send me restaurants CTM.","zh":"给我发一些我附近（CTM）的餐馆。"}]},{"partOfSpeech":"n.","definition":{"en":"(general) An abbreviation with multiple meanings; used as initials in different fields (e.g., finance, law, medicine, tech).","zh":"（泛用）一个在不同领域有多种含义的缩写（如金融、法律、医学、科技等常用首字母缩写）。"},"examples":[{"en":"In this document, CTM stands for “Contract Template Management.”","zh":"在这份文件里，CTM代表“合同模板管理”。"},{"en":"CTM can mean different things, so check the context.","zh":"CTM可能有不同含义，要看上下文。"}]}],"synonyms":["abbrev.","acronym","initialism"],"phonetic":"/ˌsiː tiː ˈɛm/","extraExplanation":["CTM是首字母缩写，具体含义高度依赖语境（你是在看聊天信息、供应链/电商资料、还是某个专业文件？）。如果你把原句或所在领域发我，我可以帮你锁定最准确的释义。"]}
{"word":"CTMS","summary":{"en":"CTMS most commonly means “Clinical Trial Management System,” software for managing clinical trial operations.","zh":"CTMS 最常指“临床试验管理系统”，用于管理临床试验的运营与流程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Clinical Trial Management System: software used to plan, track, and manage clinical trials (e.g., study sites, participants, timelines, data, and reporting).","zh":"临床试验管理系统：用于规划、追踪并管理临床试验的软件（如研究中心、受试者、时间线、数据与报告等）。"},"examples":[{"en":"Our company uses a CTMS to track site activation and patient enrollment.","zh":"我们公司用 CTMS 来追踪研究中心启动情况和受试者入组进度。"},{"en":"The sponsor asked us to update the CTMS before the monitoring visit.","zh":"赞助方要求我们在监查访视前更新 CTMS。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) Any system called a “CTMS” in a specific field (the exact meaning depends on the organization or context).","zh":"（较少见）某些领域或机构内部把某个系统简称为“CTMS”（具体含义取决于单位或语境）。"},"examples":[{"en":"In this hospital, CTMS refers to their internal training management portal.","zh":"在这家医院里，CTMS 指他们的内部培训管理平台。"}]}],"synonyms":["Clinical Trial Management System","clinical trial software (general)"],"phonetic":"/ˌsiː tiː ˌɛm ˈɛs/","extraExplanation":["在医药/生物科技行业里，CTMS 最常指 Clinical Trial Management System（临床试验管理系统）。它常与 EDC（电子数据采集系统）、eTMF（电子试验主文件）等一起出现：CTMS 更偏“项目/运营管理”，EDC 更偏“受试者数据录入与核查”。","读法通常按字母读：C-T-M-S。正式写作中第一次出现时常写全称：Clinical Trial Management System (CTMS)。"]}
{"word":"ctn","summary":{"en":"“ctn” is usually an abbreviation for “carton” in shipping; less commonly it’s informal texting for “can’t.”","zh":"“ctn”通常是物流中的“carton（纸箱/箱）”缩写；较少情况下在聊天中用作“can’t（不能）”的速记。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) carton; used in shipping and inventory to mean a box or package (often a cardboard container).","zh":"（缩写）carton（纸箱/箱）；常用于物流、仓储和清单中，表示一箱（通常是纸箱包装）。"},"examples":[{"en":"Please label each ctn with the destination address.","zh":"请在每个 ctn（纸箱）上贴好目的地地址标签。"},{"en":"The order includes 12 ctn of bottled water.","zh":"这批订单包含 12 ctn 瓶装水（即 12 箱）。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., informal texting) can’t.","zh":"（缩写，非正式短信/聊天）can’t（不能/不会）。"},"examples":[{"en":"Sry, I ctn make it tonight.","zh":"抱歉，我今晚 ctn（不能）去。"},{"en":"I ctn remember his name.","zh":"我 ctn（想不起来）他的名字。"}]}],"synonyms":["carton (for shipping use)","box"],"phonetic":"/ˌsiː tiː ˈɛn/","extraExplanation":["在正式英语写作中不建议用“ctn”表示“can’t”，它更像聊天速记，容易让不熟悉的人看不懂。","在物流/外贸文件里“ctn”非常常见，常与数量单位一起出现：e.g., “2 ctns”（两箱）。也可能出现在“CTN NO.”（Carton Number，箱号）等字段中。"]}
{"word":"CTNE","summary":{"en":"CTNE is an initialism most often meaning “Certified Telecommunications Network Engineer,” but its exact meaning can vary by context.","zh":"CTNE 通常指“认证电信网络工程师”，但具体含义会因语境而异。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation that most commonly refers to “Certified Telecommunications Network Engineer,” a professional certification/title in telecommunications and networking (usage varies by industry).","zh":"一个缩写，最常见指“Certified Telecommunications Network Engineer（认证电信网络工程师）”，用于电信与网络领域的职业认证/头衔（不同领域含义可能不同）。"},"examples":[{"en":"He listed CTNE on his résumé to show he had a telecom networking certification.","zh":"他在简历上写了 CTNE，用来表明自己有电信网络方面的认证。"},{"en":"Our vendor assigned a CTNE to help design the network wiring plan.","zh":"供应商安排了一位 CTNE 来协助设计网络布线方案。"}]},{"partOfSpeech":"other","definition":{"en":"(general) an initialism used in names of programs, courses, departments, or projects related to communication/telecom and network engineering; exact meaning depends on context.","zh":"（泛指）用于通信/电信与网络工程相关的项目、课程、部门或计划名称的首字母缩写；具体含义取决于语境。"},"examples":[{"en":"The brochure mentions CTNE, but it doesn’t explain what the letters stand for.","zh":"宣传册里提到 CTNE，但没有解释这几个字母代表什么。"},{"en":"In this university, CTNE is the track for communication and network engineering.","zh":"在这所大学里，CTNE 是通信与网络工程方向的简称。"}]}],"synonyms":["Certified Telecommunications Network Engineer","telecom network engineer (contextual)"],"phonetic":"ˌsiː tiː ɛn ˈiː","extraExplanation":["CTNE 是首字母缩写，不同公司/学校/行业可能有不同扩展含义。若你告诉我它出现的场景（例如证书、课程名称、医疗报告、公司部门、聊天语境等），我可以帮你确认最准确的释义与用法。"]}
{"word":"CTO","summary":{"en":"CTO = Chief Technology Officer, the executive who leads a company’s technology strategy and engineering.","zh":"CTO指Chief Technology Officer（首席技术官），负责公司技术战略与工程团队领导。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Chief Technology Officer: the top executive responsible for a company’s technology strategy, engineering direction, and technical leadership.","zh":"首席技术官：负责公司技术战略、工程方向与技术领导的最高管理者之一。"},"examples":[{"en":"Our CTO set a new roadmap for the mobile app and the backend platform.","zh":"我们的CTO为移动应用和后端平台制定了新的路线图。"},{"en":"She joined the startup as CTO to lead the engineering team.","zh":"她以CTO身份加入这家初创公司，带领工程团队。"}]},{"partOfSpeech":"n.","definition":{"en":"A person holding the role/title of Chief Technology Officer.","zh":"担任首席技术官（CTO）这一职位的人。"},"examples":[{"en":"Ask the CTO whether we should build it in-house or buy a solution.","zh":"问问CTO我们应该自研还是采购解决方案。"}]}],"synonyms":["Chief Technology Officer","tech chief","technology head"],"phonetic":"/ˌsiː tiː ˈoʊ/","extraExplanation":["在不同公司里，CTO的职责可能与CEO/COO/CIO有重叠：一般来说CTO更偏“技术与产品工程落地”，CIO更偏“内部信息系统与IT运营”。初创公司里CTO常常也会亲自写代码、搭建架构；大公司CTO更多做技术战略、组织与人才建设。","常见搭配：CTO role（CTO职责）、CTO office（CTO办公室/技术管理团队）、interim CTO（临时CTO）、fractional CTO（兼职/外部CTO）。"]}
{"word":"cto","summary":{"en":"CTO = Chief Technology Officer, the executive in charge of a company’s technology and engineering direction.","zh":"CTO = 首席技术官，负责公司技术与研发方向的高管。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Chief Technology Officer: a top executive responsible for a company’s technology strategy, engineering direction, and technical leadership.","zh":"首席技术官：负责公司技术战略、工程方向与技术领导的高层管理人员。"},"examples":[{"en":"Our CTO approved the plan to migrate the product to cloud infrastructure.","zh":"我们的CTO批准了把产品迁移到云基础设施的计划。"},{"en":"She started as a software engineer and later became the CTO of the startup.","zh":"她从软件工程师做起，后来成为那家初创公司的CTO。"},{"en":"The CEO and CTO meet weekly to align business goals with the tech roadmap.","zh":"CEO和CTO每周开会，让业务目标与技术路线图保持一致。"}]}],"synonyms":["chief technology officer","chief technologist","head of technology","tech lead (informal)"],"phonetic":"/ˌsiː tiː ˈoʊ/","extraExplanation":["“CTO”是英文缩写，通常读作字母音“C-T-O”。在不同公司里职责会有差异：有的CTO更偏技术战略与架构（technology/architecture），有的更偏研发团队管理（engineering management）。","在招聘或组织架构中，CTO常与“CIO（首席信息官）”区分：CIO更偏内部信息系统与IT管理；CTO更偏产品技术与对外竞争的技术能力。"]}
{"word":"ctor","summary":{"en":"“ctor” is an informal programming abbreviation for “constructor.”","zh":"“ctor”是在编程语境中对“constructor（构造函数）”的非正式缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(programming, informal) A constructor; an abbreviation used in code comments, variable names, or documentation (common in C++/C#/Java contexts).","zh":"（编程，非正式）构造函数；在代码注释、变量名或文档中对 constructor 的缩写（常见于 C++/C#/Java 等语境）。"},"examples":[{"en":"The class has a default ctor and a copy ctor.","zh":"这个类有一个默认构造函数（default ctor）和一个拷贝构造函数（copy ctor）。"},{"en":"Move the setup code into the ctor so every object starts correctly.","zh":"把初始化代码放到构造函数（ctor）里，这样每个对象一开始就会正确。"}]}],"synonyms":["constructor","initializer"],"phonetic":"/ˈsiː.tɔr/","extraExplanation":["“ctor”通常读作“C-tor”，是程序员写作中的缩略语，不是正式英语词汇；在正式文档里更常写全称 constructor。","常见搭配：default ctor（默认构造函数）、copy ctor（拷贝构造函数）、move ctor（移动构造函数）。"]}
{"word":"ctr","summary":{"en":"CTR most commonly means click-through rate, a metric showing how often people click after seeing something online.","zh":"CTR 最常见指 click-through rate（点击率），表示用户看到内容后点击的频率。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Abbreviation) click-through rate: the percentage of people who click a link, ad, or email after seeing it.","zh":"（缩写）点击率：看到链接、广告或邮件后点击的人所占的百分比。"},"examples":[{"en":"Our ad campaign has a CTR of 3.2% this week.","zh":"我们这周的广告点击率是 3.2%。"},{"en":"A higher CTR usually means the headline is more attractive.","zh":"更高的点击率通常说明标题更吸引人。"},{"en":"We changed the button color to improve CTR.","zh":"我们更改了按钮颜色来提升点击率。"}]}],"synonyms":["click-through rate"],"phonetic":"/ˌsiː tiː ˈɑːr/","extraExplanation":["CTR 常见于数字营销、数据分析和产品增长领域。基本计算方式：CTR = clicks ÷ impressions × 100%。","在不同平台（搜索广告、社交媒体、邮件）里，CTR 的“好坏”标准差异很大，通常要结合行业基准、受众和投放目标一起看。"]}
{"word":"ctrl","summary":{"en":"“Ctrl” most commonly means the Control key on a keyboard, used in shortcut key combinations; it can also mean “control” in technical notes.","zh":"“Ctrl”最常指键盘上的 Control（控制）键，用于各种快捷键组合；也可在技术说明中表示“control（控制/管理）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"short for “Control”; the Ctrl key on a computer keyboard, used (often with another key) to perform shortcuts","zh":"“Control”的缩写；电脑键盘上的 Ctrl（控制）键，常与其他按键组合使用以执行快捷操作"},"examples":[{"en":"Press Ctrl + C to copy the text.","zh":"按 Ctrl + C 复制文字。"},{"en":"Use Ctrl + F to find a word on the page.","zh":"用 Ctrl + F 在页面中查找单词。"},{"en":"My laptop’s Ctrl key is stuck.","zh":"我笔记本电脑的 Ctrl 键卡住了。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “control” in instructions, labels, or technical writing (meaning to control/manage something)","zh":"在说明、标签或技术文本中作“control（控制/管理）”的缩写"},"examples":[{"en":"Adjust the volume with the audio ctrl on the panel.","zh":"用面板上的音频控制（ctrl）调节音量。"},{"en":"This setting gives you full ctrl over notifications.","zh":"这个设置让你完全控制通知。"}]}],"synonyms":["Control key","control (abbr.)"],"phonetic":"si ti ɑr ɛl","extraExplanation":["在不同系统里常见快捷键：Windows/Linux 多用 Ctrl 组合键；macOS 更常用 Command（⌘）来做同类操作，但 Ctrl 在 macOS 里仍用于某些功能（如 Ctrl+点击相当于右键）。","书写上常见形式有 Ctrl、CTRL；口语里通常按字母读作 “C-T-R-L”。"]}
{"word":"CTS","summary":{"en":"“CTS” is an abbreviation most commonly meaning carpal tunnel syndrome (medicine) or clear to send (tech); its meaning depends on context.","zh":"“CTS”是缩写，最常见指（医学）腕管综合征或（技术）Clear To Send 信号；具体含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(medicine) Carpal tunnel syndrome: a condition where a nerve in the wrist is compressed, causing pain, numbness, or tingling in the hand.","zh":"（医学）腕管综合征：手腕处的神经受到压迫，引起手部疼痛、麻木或刺痛等症状。"},"examples":[{"en":"My doctor thinks my hand numbness is caused by CTS.","zh":"医生认为我手麻是腕管综合征（CTS）引起的。"},{"en":"People who type a lot sometimes worry about CTS.","zh":"经常打字的人有时会担心腕管综合征（CTS）。"}]},{"partOfSpeech":"other","definition":{"en":"(technology/communication) Clear To Send: a signal meaning a device is ready to receive data (often paired with RTS, “Request To Send”).","zh":"（科技/通信）Clear To Send（允许发送/可接收）：表示设备已准备好接收数据的信号（常与 RTS“请求发送”配对使用）。"},"examples":[{"en":"The modem waits for CTS before it starts sending data.","zh":"调制解调器会等到 CTS 信号后才开始发送数据。"},{"en":"If CTS is low, the connection may pause to avoid overflow.","zh":"如果 CTS 信号为低，连接可能会暂停以避免数据溢出。"}]},{"partOfSpeech":"other","definition":{"en":"A common abbreviation that can also stand for other things depending on the field (for example, “Certified Technology Specialist” or names of organizations).","zh":"一个常见缩写，在不同领域也可能代表其他含义（例如“认证技术专家”，或某些机构名称等）。"},"examples":[{"en":"In this job post, CTS means “Certified Technology Specialist.”","zh":"在这则招聘信息里，CTS 指“认证技术专家”。"},{"en":"Ask what CTS stands for in this context, because it can vary.","zh":"最好先确认这里的 CTS 具体指什么，因为含义会因语境而变。"}]}],"synonyms":["carpal tunnel syndrome","clear to send (CTS)"],"phonetic":"/siː tiː ɛs/","extraExplanation":["缩写在英文里非常依赖语境：同一个“CTS”在医学最常见指腕管综合征；在通信/硬件资料里常指“Clear To Send”流控信号。读到缩写时可以先看主题（医疗、计算机、招聘等）来判断。","发音通常按字母读（C-T-S），写作时首次出现常会先写全称再写缩写，例如：carpal tunnel syndrome (CTS)。"]}
{"word":"cts","summary":{"en":"CTS is an abbreviation most commonly meaning either carpal tunnel syndrome (medical) or clear to send (computing/telecom).","zh":"CTS是一个缩写，最常见的意思是“腕管综合征”（医疗）或“Clear To Send/允许发送信号”（计算机与通信）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) carpal tunnel syndrome: a condition that causes pain, numbness, or tingling in the hand and wrist because a nerve is squeezed in the wrist.","zh":"（缩写）腕管综合征：因手腕处神经受压而导致手和手腕疼痛、麻木或刺痛的疾病。"},"examples":[{"en":"My doctor thinks I have CTS from using the mouse all day.","zh":"医生认为我因为整天用鼠标而得了CTS（腕管综合征）。"},{"en":"CTS symptoms often get worse at night.","zh":"CTS（腕管综合征）的症状常常在夜里更严重。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev., computing/telecom) clear to send: a signal meaning a device is ready to receive data.","zh":"（缩写，计算机/通信）Clear To Send（允许发送/可接收）：表示设备已准备好接收数据的信号。"},"examples":[{"en":"If CTS is low, the modem won’t accept more data.","zh":"如果CTS为低电平，调制解调器就不会接收更多数据。"},{"en":"The serial port uses RTS/CTS for flow control.","zh":"串口使用RTS/CTS进行流量控制。"}]}],"synonyms":["carpal tunnel syndrome","clear to send","RTS/CTS (flow control)"],"phonetic":"/ˌsiːtiːˈɛs/","extraExplanation":["“CTS”是缩写，常见于两类语境：医疗（腕管综合征）和计算机/通信（串口握手信号）。写作或聊天时，如果不确定对方理解哪一个，最好第一次写出全称：carpal tunnel syndrome 或 clear to send。"]}
{"word":"CTSS","summary":{"en":"CTSS is an initialism; its meaning depends on context (commonly “Connecticut State Standards” in education or a “carpal tunnel syndrome severity/score/scale” measure in medicine).","zh":"CTSS 是首字母缩略词，具体含义取决于语境（教育中常指“康涅狄格州学习标准”，医学中也可指“腕管综合征严重度/评分/量表”等指标）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Connecticut State Standards” (U.S. education), a set of learning goals used in Connecticut.","zh":"“Connecticut State Standards（康涅狄格州课程/学习标准）”的缩写（美国教育领域），指康州采用的一套学习目标与要求。"},"examples":[{"en":"The district aligned its curriculum with the CTSS for math and English.","zh":"该学区把数学和英语课程与 CTSS（康州州标准）对齐。"},{"en":"Teachers use CTSS to plan lessons and assessments.","zh":"老师会用 CTSS 来规划课堂教学与测评。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation used in medicine for “carpal tunnel syndrome severity/score/scale,” referring to how serious carpal tunnel syndrome is (meaning varies by hospital or study).","zh":"医学中可指“carpal tunnel syndrome severity/score/scale（腕管综合征严重程度/评分/量表）”的缩写，用来表示腕管综合征有多严重（不同医院或研究的具体写法可能不同）。"},"examples":[{"en":"The patient’s CTSS improved after wearing a wrist splint.","zh":"佩戴护腕夹板后，患者的 CTSS（腕管综合征严重度指标）有所改善。"},{"en":"The study compared CTSS before and after surgery.","zh":"该研究比较了手术前后的 CTSS 变化。"}]},{"partOfSpeech":"other","definition":{"en":"a general initialism used in organizations and projects; the exact meaning depends on the field (education, healthcare, IT, etc.).","zh":"一种通用首字母缩略词；具体含义取决于领域（教育、医疗、IT 等）。"},"examples":[{"en":"In this report, CTSS refers to the project’s support system.","zh":"在这份报告里，CTSS 指该项目的支持系统。"},{"en":"Please define CTSS the first time you use it in the document.","zh":"请在文件中首次使用 CTSS 时先写出全称并说明含义。"}]}],"synonyms":["abbreviation","initialism","acronym"],"phonetic":"/ˌsiːtiːˈɛsˌɛs/","extraExplanation":["“CTSS”不是一个固定词，而是缩写，常见读法是逐个字母读：/ˌsiːtiːˈɛsˌɛs/。由于不同领域可能有不同全称（甚至同一领域也可能不统一），最稳妥的做法是：在第一次出现时写出全称（spelled-out form），并在括号里标注缩写（abbreviation）。","如果你告诉我它出现的语境（例如学校文件、医学报告、IT 系统、论文标题等），我可以帮你锁定最可能的全称、中文译法以及更贴切的例句。"]}
{"word":"CTT","summary":{"en":"CTT is an initialism; its meaning depends on context (often “Certified Translation/Translator” in language services).","zh":"CTT 是一个首字母缩略写法；含义取决于语境（在语言服务领域常指“认证翻译/认证译员”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"CTT: an initialism (a set of letters) whose meaning depends on the field; it is not a single standard English word.","zh":"CTT：一个首字母缩略写法（由字母组成），具体含义取决于使用领域；它不是一个固定、唯一的英语单词。"},"examples":[{"en":"What does CTT mean in this document?","zh":"这份文件里的 CTT 是什么意思？"},{"en":"CTT can stand for different things in different industries.","zh":"在不同行业里，CTT 可能代表不同含义。"}]},{"partOfSpeech":"other","definition":{"en":"(common use in language services) CTT: “Certified Translation/Translator” (used to refer to certified translation or a certified translator, depending on context).","zh":"（语言服务领域较常见）CTT：“Certified Translation/Translator”（可指“认证翻译/公证翻译”或“认证译员”，需看语境）。"},"examples":[{"en":"Please provide a CTT for your birth certificate.","zh":"请提供你出生证明的认证翻译件。"},{"en":"We hired a CTT to translate the legal contract.","zh":"我们请了一位认证译员来翻译这份法律合同。"}]}],"synonyms":["initialism","abbreviation"],"phonetic":"/si ti ti/","extraExplanation":["“CTT”不是像“NASA”那样全球通用、含义稳定的缩写；它更像是“在某个圈子里大家约定俗成的写法”。如果你告诉我它出现的场景（例如：聊天、公司邮件、医学、游戏、翻译、学校作业等），我可以帮你锁定最可能的含义并给更贴切的例句。"]}
{"word":"CTTC","summary":{"en":"CTTC is usually an abbreviation; in texting it often means “cut to the chase” (get to the point).","zh":"CTTC通常是缩写；在聊天语境里常指“cut to the chase”（直奔主题）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(internet/texting, abbreviation) “cut to the chase”: say the most important point without extra details.","zh":"（网络/短信缩写）“cut to the chase”：直奔主题，别铺垫太多。"},"examples":[{"en":"CTTC—what do you actually want from me?","zh":"CTTC——你到底想让我做什么？"},{"en":"Can you CTTC and tell me the final decision?","zh":"你能不能CTTC，直接告诉我最终决定？"}]},{"partOfSpeech":"other","definition":{"en":"(general) An abbreviation whose meaning depends on the field (for example, a company name, an organization, a course title, or a technical term).","zh":"（通用）一个缩写，具体含义取决于使用领域（例如公司名、机构名、课程名或技术术语）。"},"examples":[{"en":"What does CTTC stand for in this document?","zh":"在这份文件里，CTTC代表什么？"},{"en":"CTTC can mean different things in different industries.","zh":"在不同的行业里，CTTC可能代表不同的意思。"}]}],"synonyms":["get to the point","be direct","skip the details"],"phonetic":"ˌsiː tiː tiː ˈsiː","extraExplanation":["“CTTC”不是一个像“NASA”那样固定唯一含义的常见缩写；最常见的网络用法之一是把短语“cut to the chase”缩写成CTTC，用来让对方别绕圈、直接说重点。","如果你能告诉我它出现的场景（聊天记录/工作邮件/课程大纲/某个行业），我可以把对应的准确全称和中文翻译补充完整。"]}
{"word":"CTTN","summary":{"en":"CTTN is a casual texting abbreviation meaning “can’t talk right now” (sometimes “can’t talk, typing now”).","zh":"CTTN 是非正式聊天缩写，意思多为“现在不能聊/不能说话”（偶尔指“不能说话，我在打字”）。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(texting abbreviation) “Can’t talk (right) now.” Used to say you are not available to speak or chat at the moment.","zh":"（短信/聊天缩写）“现在不能聊/不能说话。”用来表示此刻不方便交流。"},"examples":[{"en":"CTTN—I'm in a meeting. I'll call you later.","zh":"CTTN——我在开会，晚点再打给你。"},{"en":"Sorry, CTTN. Can I message you after class?","zh":"抱歉，CTTN。下课后我再发消息可以吗？"}]},{"partOfSpeech":"phrase","definition":{"en":"Less common: “Can’t talk, typing now.” Used to say you’re busy typing and can’t talk at the same time.","zh":"较少见：“不能说话，我正在打字。”表示你在忙着打字，暂时不方便说话/语音。"},"examples":[{"en":"CTTN, sending the details now.","zh":"CTTN，我现在把细节发给你。"}]}],"synonyms":["BRB (related)","TTYL (related)","AFK (related)"],"phonetic":"/ˌsiː tiː tiː ˈɛn/","extraExplanation":["这是网络聊天/短信里的缩写，常见于比较随意的场合（朋友、同学）。在正式邮件或工作沟通中不太建议使用，可以改成：\"I can’t talk right now.\" / \"I’m not available at the moment.\"","读法通常按字母念：C-T-T-N。不同圈子里第二种解释（Can’t talk, typing now）更少见，具体含义可结合上下文判断。"]}
{"word":"ctum","summary":{"en":"“ctum” is not a standard English word; it’s likely a fragment or a typo.","zh":"“ctum”不是标准英语单词；更可能是词的一部分或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word by itself. “ctum” is usually seen as a fragment inside other words (often from Latin-based spellings), or it may be a typo.","zh":"“ctum”本身不是标准英语单词。它通常只是出现在其他单词里的片段（常见于源自拉丁语的拼写中），也可能是输入错误。"},"examples":[{"en":"“ctum” isn’t a standalone word in English—could you share the full word or sentence?","zh":"“ctum”在英语里不是独立单词——你能提供完整单词或句子吗？"},{"en":"Some words contain similar letter groups, like “factum” (Latin) or English words ending in “-ct” such as “product.”","zh":"有些词会包含类似字母组合，例如拉丁语“factum”，或英语里以“-ct”结尾/相关的词，如“product（产品）”。"}]}],"phonetic":"/ktəm/","extraExplanation":["“ctum”很可能是你想查的词的一部分（例如更长的单词结尾或中间片段），或是拼写少了前后字母。把它放进一个句子里，或告诉我你原本想输入的完整单词，我就能给出准确释义与用法。"]}
{"word":"CTV","summary":{"en":"CTV most commonly refers to the Canadian TV network, or to connected TV in streaming/advertising contexts.","zh":"CTV 最常指加拿大电视网；在串流/广告语境中也常指“联网电视”（connected TV）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) Canadian Television: a major English-language television network in Canada, also the name of the company/brand (CTV).","zh":"（缩写）加拿大电视网：加拿大主要的英语电视网络之一，也是其公司/品牌名称（CTV）。"},"examples":[{"en":"I watched the hockey game on CTV last night.","zh":"我昨晚在 CTV 上看了冰球比赛。"},{"en":"CTV News is reporting heavy snow in Ontario.","zh":"CTV 新闻正在报道安大略省有大雪。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev.) connected TV: TV content watched through the internet on a smart TV or streaming device (common in advertising and media).","zh":"（缩写）联网电视：通过智能电视或串流设备在电视上观看互联网内容（广告与媒体行业常用）。"},"examples":[{"en":"Our ads performed better on CTV than on mobile.","zh":"我们的广告在 CTV（联网电视）上的效果比在手机上更好。"},{"en":"CTV viewing increased as more people used streaming apps.","zh":"随着更多人使用串流应用，CTV 观看量增加了。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev., less common) cable television: TV service delivered through cables by a cable company.","zh":"（缩写，较少见）有线电视：由有线电视公司通过电缆提供的电视服务。"},"examples":[{"en":"They canceled CTV and switched to streaming.","zh":"他们取消了有线电视，改用串流。"}]}],"synonyms":["Canadian Television","connected TV","streaming TV"],"phonetic":"/ˌsiː tiː ˈviː/","extraExplanation":["“CTV”最常见的理解取决于语境：在加拿大相关话题里通常指加拿大电视网（Canadian Television）；在市场营销/广告投放语境里，CTV 更常指 connected TV（联网电视广告）。","读作字母：C-T-V。写作时通常全大写。"]}
