{"word":"CW","summary":{"en":"“CW” most often means “content warning,” and can also mean “coursework” or “clockwise,” depending on context.","zh":"“CW”最常见表示“内容警告”，也可能指“课程作业”或“顺时针”，需结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) content warning: a note telling readers/viewers that something may include disturbing or sensitive material.","zh":"（缩写）内容警告：提示读者/观众接下来的内容可能包含令人不适或敏感材料的说明。"},"examples":[{"en":"CW: violence in the next scene.","zh":"内容警告：下一幕含有暴力内容。"},{"en":"The post begins with a CW for self-harm.","zh":"这篇帖子开头加了一个关于自残的内容警告。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) coursework: the regular class assignments and work done during a course.","zh":"（缩写）课程作业：在一门课中需要完成的日常作业与学习任务。"},"examples":[{"en":"My CW is due on Friday.","zh":"我的课程作业周五截止。"},{"en":"CW counts for 40% of the final grade.","zh":"课程作业占期末总评的40%。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) clockwise: moving in the same direction as the hands of a clock.","zh":"（缩写）顺时针方向：与钟表指针转动方向一致的方向。"},"examples":[{"en":"Turn the knob CW to tighten it.","zh":"把旋钮顺时针拧紧。"},{"en":"The fans rotate CW at high speed.","zh":"风扇以高速顺时针旋转。"}]}],"synonyms":["content warning","TW (trigger warning)","clockwise (CW)"],"phonetic":"/ˌsiː ˈdʌbəl.juː/","extraExplanation":["“CW”在网络平台上最常见的用法是“content warning（内容警告）”，也常写作“TW（trigger warning）”。不同社群对是否需要加CW/TW的习惯不同，但用意通常是给他人选择是否继续阅读/观看的空间。","在工程、绘图、健身器材说明等语境里，“CW/CCW”常成对出现：CW=clockwise（顺时针），CCW=counterclockwise（逆时针）。"]}
{"word":"CWA","summary":{"en":"CWA most commonly means the U.S. Clean Water Act; in other contexts it can have different meanings (e.g., a welding credential).","zh":"CWA 最常见指美国《清洁水法》；在其他语境下也可能代表不同含义（如焊接认证）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abbreviation for the Clean Water Act, a major U.S. federal law that regulates water pollution and protects rivers, lakes, wetlands, and other waters.","zh":"“清洁水法”（Clean Water Act）的缩写：美国重要的联邦法律，用于管控水污染并保护河流、湖泊、湿地等水体。"},"examples":[{"en":"The factory was fined for violating the CWA.","zh":"这家工厂因违反《清洁水法》（CWA）而被罚款。"},{"en":"Under the CWA, companies may need permits to discharge wastewater.","zh":"根据《清洁水法》（CWA），企业排放废水可能需要许可证。"},{"en":"The nonprofit sued to enforce the CWA and protect the local wetland.","zh":"该非营利组织提起诉讼以推动执行《清洁水法》（CWA），保护当地湿地。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) an abbreviation that can stand for different things depending on the field, such as Certified Welding Associate (a welding credential).","zh":"（较不常见）在不同领域可代表不同含义的缩写，例如 Certified Welding Associate（焊接相关认证）。"},"examples":[{"en":"He listed CWA on his résumé as a welding credential.","zh":"他在简历上写了 CWA，表示一种焊接认证。"}]}],"synonyms":["Clean Water Act (spelled out)"],"phonetic":"ˌsiː ˌdʌbəl.juː ˈeɪ","extraExplanation":["在美国语境里，CWA 最常指 1972 年通过并多次修订的《清洁水法》。它与环保署（EPA）及“排放许可”（permit）等概念常一起出现。","如果你是在某个特定行业/课程/公司文件里看到 CWA，我也可以根据上下文帮你判断它具体指什么（例如环保、焊接、商业组织名等）。"]}
{"word":"cwacian","summary":{"en":"Likely meant: Caucasian — relating to the Caucasus region, or (in U.S. usage) describing a White person.","zh":"你可能想查：Caucasian——指与高加索地区有关，或（在美国常用）指白人/白人的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Caucasus region (an area between the Black Sea and the Caspian Sea).","zh":"与高加索地区有关的（位于黑海与里海之间）。"},"examples":[{"en":"The Caucasian mountains are known for their dramatic landscapes.","zh":"高加索山脉以壮丽的景色闻名。"},{"en":"She studies languages spoken in the Caucasian region.","zh":"她研究高加索地区使用的语言。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Common in the U.S.) Describing a person who is White; used in official forms or everyday speech.","zh":"（在美国常见）指“白人”的；常见于表格或日常表达。"},"examples":[{"en":"The form asks whether you are Caucasian, Black, Asian, or Hispanic/Latino.","zh":"表格会询问你是否为白人、黑人、亚裔或西语裔/拉丁裔。"},{"en":"He is Caucasian, and his partner is Korean American.","zh":"他是白人，他的伴侣是韩裔美国人。"}]},{"partOfSpeech":"n.","definition":{"en":"A White person (especially in American English).","zh":"（尤指美式英语）白人。"},"examples":[{"en":"The group included Caucasians, Latinos, and Asian Americans.","zh":"这个群体包括白人、拉丁裔和亚裔美国人。"}]}],"synonyms":["White (U.S. usage)","of the Caucasus","Caucasus-related"],"phonetic":"/kɔˈkeɪʒən/","extraExplanation":["你输入的“cwacian”不是常见英语单词；最可能是拼写错误，常见目标词是 **Caucasian**。如果你本来想查的是别的词（例如 Croatian/Canadian 等），告诉我上下文句子我可以再确认。","“Caucasian”在现代英语里常被用来指“白人”，但“按种族划分人类”的旧式分类在学术上已被认为过时且可能带来刻板印象。在正式写作或更敏感的场合，可根据语境改用更具体的表述（如 “White,” “of European descent,” 或直接说明国籍/族裔）。"]}
{"word":"CWC","summary":{"en":"CWC is an abbreviation with multiple meanings; online it may mean “content warning/caution,” but in professional texts it can refer to specific terms like “California Water Code.”","zh":"CWC是一个多义缩写；网络上可能表示“内容警告/提醒”，在专业文本中也可能指如“加州水法典”等特定术语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) In online communities, “CWC” is sometimes used to mean “content warning/caution,” a note that the following text may include sensitive topics.","zh":"（缩写）在网络社群中，“CWC”有时表示“内容警告/提醒”，提示接下来的内容可能包含敏感话题。"},"examples":[{"en":"CWC: This post discusses self-harm.","zh":"内容警告：这篇帖子会谈到自残。"},{"en":"Please add a CWC before sharing graphic details.","zh":"分享可能令人不适的细节前请加上内容警告。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) “CWC” can also refer to a specific organization, law, or term depending on context (for example, “California Water Code” in legal writing).","zh":"（缩写）“CWC”也可能指特定机构、法律或专业术语，具体含义取决于语境（例如法律语境中的“California Water Code/加州水法典”）。"},"examples":[{"en":"The regulation is defined under the CWC.","zh":"该规定在CWC（加州水法典）中有定义。"},{"en":"In this report, CWC refers to the California Water Code.","zh":"在本报告中，CWC指加州水法典。"}]}],"synonyms":["CW (in some online contexts, meaning “content warning”)"],"phonetic":"/ˌsiː dʌbəl.juː ˈsiː/","extraExplanation":["“CWC”是缩写，常见于不同领域但含义差异很大。要准确解释，需要你提供使用场景（例如：聊天/社交媒体、法律文件、医学/工程、游戏等）或给出完整句子。"]}
{"word":"cwellan","summary":{"en":"“cwellan” is not a recognized standard English word; it’s likely a misspelling or a proper name.","zh":"“cwellan”不是标准英语词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username, or a proper name (e.g., a surname/place name).","zh":"不是标准英语单词；可能是拼写错误、用户名，或专有名词（如姓氏/地名）。"},"examples":[{"en":"I can’t find “cwellan” in an English dictionary—did you mean another word?","zh":"我在英语词典里找不到“cwellan”——你是不是想写另一个词？"},{"en":"“Cwellan” looks like a name rather than a common English word.","zh":"“Cwellan”看起来更像是名字，而不是常见英语词。"}]}],"extraExplanation":["“cwellan”在常见英语词典中没有收录。如果你是想查某个发音相近的词，可以告诉我上下文（整句话/你想表达的意思），我可以帮你定位。","常见可能的输入偏差包括：dwell on（反复想着/详谈）、swollen（肿胀的）、Cullen（常见姓氏）等；但需要你的语境来确认。"]}
{"word":"cwen","summary":{"en":"“cwen” is usually a misspelling of “Qwen,” an AI language model name.","zh":"“cwen”通常是“Qwen”的误拼，指一种 AI 大语言模型名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A misspelling or variant spelling of “Qwen,” a family of large language models (LLMs) released by Alibaba Cloud; used as a proper name in AI discussions.","zh":"“Qwen”的常见误拼或变体写法；指阿里云发布的一系列大语言模型（LLM），在人工智能语境中作为专有名称使用。"},"examples":[{"en":"Some users type “cwen” when they actually mean “Qwen.”","zh":"有些人输入“cwen”，其实是想表达“Qwen”。"},{"en":"The article compares Cwen/Qwen with other AI models.","zh":"这篇文章把 Cwen/Qwen 与其他 AI 模型进行对比。"}]}],"synonyms":["Qwen"],"phonetic":"/kwɛn/","extraExplanation":["“Qwen”常被认为与“千问（Qianwen）”相关，中文语感是“问很多问题/有很多回答”的意思；在英文语境里通常写作 Qwen。","如果你是在代码、论文或模型名称里看到“cwen”，建议核对是否应为“Qwen”，因为大小写与拼写会影响检索与引用准确性。"]}
{"word":"cwencan","summary":{"en":"“cwencan” isn’t a recognized English vocabulary word; it’s likely a name/username or transliteration, so its meaning depends on context.","zh":"“cwencan”不是常见英文词汇，更可能是名字/用户名或音译写法，含义需结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most likely a personal name, username, or a transliteration/romanization (e.g., from another language). Meaning depends on the person or context.","zh":"不是标准英文单词；更可能是人名、用户名，或来自其他语言的音译/罗马化拼写。具体含义取决于人物或语境。"},"examples":[{"en":"My online handle is Cwencan.","zh":"我的网名是 Cwencan。"},{"en":"I saw “cwencan” in the file name, but I’m not sure what it refers to.","zh":"我在文件名里看到了“cwencan”，但不确定它指什么。"}]}],"synonyms":["handle","username","ID","screen name"],"phonetic":"/ˈsiːwɛnˌkæn/","extraExplanation":["从拼写看，“cwencan”不像常见英文构词，更像用户名/ID，或把中文（如拼音）等语言转写成拉丁字母后的形式。","如果你想查询的是某个英文单词，请确认拼写（例如是否想输入某个常见词），或告诉我它出现的句子/场景，我可以据此给出更准确的词义与用法。"]}
{"word":"CWI","summary":{"en":"CWI most commonly means “Certified Welding Inspector,” a credential/title for professionals who inspect welds.","zh":"CWI最常见指“Certified Welding Inspector（焊接检验师）”，用于检验焊接质量的职业认证/头衔。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Certified Welding Inspector (a professional certification for people who inspect welding work and ensure it meets codes and safety standards).","zh":"焊接检验师认证／持证焊接检验员（用于检验焊接质量、确保符合规范与安全标准的职业认证/头衔）。"},"examples":[{"en":"The project requires a CWI to verify weld quality before delivery.","zh":"该项目要求由CWI在交付前验证焊缝质量。"},{"en":"She became a CWI after several years of welding inspection experience.","zh":"她在从事焊接检验多年后取得了CWI资格。"}]},{"partOfSpeech":"other","definition":{"en":"(Less common) A set of initials that can stand for different phrases depending on the field (for example, in medicine, education, or IT).","zh":"（较不常见）在不同领域可能代表不同短语的一组首字母缩写（如医学、教育或信息技术等语境）。"},"examples":[{"en":"In this document, CWI means “Certified Welding Inspector.”","zh":"在这份文件中，CWI指“Certified Welding Inspector（焊接检验师）”。"},{"en":"Could you clarify what CWI stands for in your report?","zh":"你能说明一下在你的报告里CWI代表什么吗？"}]}],"synonyms":["Certified Welding Inspector","welding inspector"],"phonetic":"/ˌsiː ˌdʌbəl.juː ˈaɪ/","extraExplanation":["“CWI”最常见的专业含义是美国焊接学会（AWS）体系里的 Certified Welding Inspector，常见于工程、制造、管道、造船等行业的招聘与施工文件。","因为缩写在不同专业里可能重名，写作时建议首次出现用全称+缩写（例如：Certified Welding Inspector (CWI)），之后再单独用CWI。"]}
{"word":"cwi","summary":{"en":"CWI most commonly means “Certified Welding Inspector,” a credential for inspecting weld quality and safety.","zh":"CWI 最常见指“认证焊接检验员”，用于表示具备焊接质量与安全检验资格的认证/人员。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Certified Welding Inspector: a professional certification (especially from the American Welding Society) for people qualified to inspect welds and welding work for safety and quality.","zh":"认证焊接检验员：一种职业认证（尤其指美国焊接学会 AWS 的认证），表示持证人具备对焊缝与焊接工作进行质量与安全检验的能力。"},"examples":[{"en":"Our project requires a CWI to approve the welds before we continue.","zh":"我们的项目需要一名 CWI 在我们继续施工前对焊缝进行验收。"},{"en":"She earned her CWI certification to work on bridge inspections.","zh":"她获得了 CWI 认证，以便从事桥梁焊接检验工作。"}]}],"synonyms":["AWS CWI","welding inspector (general term)"],"phonetic":"/ˌsiː ˌdʌbəlˌjuː ˈaɪ/","extraExplanation":["“CWI”是缩写/首字母词，不同领域可能代表不同含义；在工程、制造、建筑与焊接行业里，最常见的是“Certified Welding Inspector（认证焊接检验员）”。","在口语中通常逐个字母读作“C-W-I”，写邮件或简历时也常直接写“CWI certification / AWS CWI”。如果你告诉我你的使用场景（例如简历、工程文件、聊天），我也可以帮你确认是否是这个意思。"]}
{"word":"cwic","summary":{"en":"CWIC usually means “Concordance With Immediate Context,” a corpus display that shows a word with nearby context to study real usage.","zh":"CWIC 通常指“Concordance With Immediate Context”，一种语料库展示方式：把词放在附近上下文中，便于观察真实用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(acronym, corpus linguistics) “Concordance With Immediate Context”: a way of showing a word or phrase in real sentences, with a small amount of text before and after it so you can study usage.","zh":"（缩写，语料库语言学）“Concordance With Immediate Context”：一种把某个词或短语放在真实句子中展示的方法，左右提供少量上下文，方便观察它的用法。"},"examples":[{"en":"In CWIC view, you can quickly compare how “run” is used in different sentences.","zh":"在 CWIC 视图里，你可以快速比较“run”在不同句子中的用法。"},{"en":"Our teacher asked us to check the CWIC lines for “take responsibility.”","zh":"老师让我们查看“take responsibility”的 CWIC 例句行。"},{"en":"CWIC helps learners notice common patterns like “depend on” and “interested in.”","zh":"CWIC 能帮助学习者注意到像“depend on”和“interested in”这样的常见搭配模式。"}]}],"synonyms":["KWIC","concordance","context view","corpus concordance"],"phonetic":"/ˌsiː dʌbəl.juː aɪ ˈsiː/","extraExplanation":["CWIC 常见于语料库检索、词典编纂、语言教学等场景，形式上类似更常见的 KWIC（Key Word In Context），都是通过“上下文中的关键词”来观察搭配、语法和语义差异。不同工具/平台对缩写的具体释义可能略有差别；如果你是在某个软件里看到 CWIC，告诉我软件或截图，我可以按该平台的定义解释。"]}
{"word":"cwicu","summary":{"en":"“cwicu” is a nonstandard texting abbreviation, commonly meaning “can’t wait to see you.”","zh":"“cwicu”是非标准的聊天缩写，常见意思是“等不及要见到你”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An informal text/chat abbreviation (not standard English), most often used to mean “can’t wait to see you.”","zh":"一种非标准英语的短信/聊天缩写，最常见的意思是“等不及要见到你/迫不及待想见你”。"},"examples":[{"en":"CWICU tomorrow!","zh":"明天CWICU！（明天见，我等不及了！）"},{"en":"Miss you—cwicu soon.","zh":"想你了——希望很快cwicu（很快见到你）。"}]}],"synonyms":["can't wait to see you","see you soon","miss you—see you soon"],"phonetic":"/ˌsi ˌdʌbəl.ju ˌaɪ ˌsi ˈju/","extraExplanation":["“cwicu”并不是通用、固定含义的缩写，更多出现在非常口语、熟人之间的聊天里；不同圈子可能会赋予不同含义。若你是在特定平台/群聊里看到它，最好结合上下文或直接问对方确认。"]}
{"word":"cwierc","summary":{"en":"“cwierc” is not an English word; it’s probably a typo or from another language. Share the context to identify the intended word.","zh":"“cwierc”不是英语单词；多半是拼写错误或来自其他语言。提供上下文句子可帮助确认你想表达的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a typo or a transliteration from another language.","zh":"不是标准英语单词，可能是拼写错误或来自其他语言的音译/转写。"},"examples":[{"en":"I couldn't find “cwierc” in an English dictionary—did you mean “civic” or “cower”?","zh":"我在英语词典里找不到“cwierc”——你想写的是“civic（公民的）”还是“cower（畏缩）”吗？"},{"en":"Please share the sentence where you saw “cwierc,” and I can help you identify the intended word.","zh":"请把你看到“cwierc”的句子发我，我可以帮你判断它原本想表达的单词。"}]}],"phonetic":"/ˈkwiːrk/","extraExplanation":["“cwierc”很像波兰语“ćwierć”的无重音写法，意思是“四分之一/一刻钟”。如果你是在波兰语语境里看到的，也可能不是英语词。","也可能只是键盘误按或拼写接近的英语词：civic（公民的）、cower（畏缩）、quirk（怪癖/古怪之处）、wince（畏缩/皱眉）等。把上下文句子贴出来我能更准确判断。"]}
{"word":"cwifer","summary":{"en":"“Cipher” usually means a secret code (and can also mean to encode/decode). Less commonly, it means zero or someone/something insignificant.","zh":"“Cipher”常指“密码/密文（系统）”，也可作动词表示“加密/解密”。较少见时可指“0”或“无足轻重的人/事”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly spelled “cipher”) a secret code or a method of writing messages so that only certain people can read them.","zh":"（常拼作“cipher”）密码；把信息写成只有特定人能读懂的编码方式。"},"examples":[{"en":"The spy used a cipher to send secret messages.","zh":"间谍用密码来发送秘密信息。"},{"en":"We learned a simple cipher in class by shifting each letter forward.","zh":"我们在课上学了一种简单的密码：把每个字母向后（或向前）移动。"}]},{"partOfSpeech":"v.","definition":{"en":"to encode or decode a message using a cipher; to write in secret code.","zh":"用密码给信息编码/解码；用暗号书写。"},"examples":[{"en":"They ciphered the instructions so no one else could understand them.","zh":"他们把指令加密了，这样别人就看不懂。"},{"en":"Can you cipher this text for me?","zh":"你能帮我把这段文字加密吗？"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) the number zero; also a person or thing of little importance.","zh":"（较少用）数字0；也可指无足轻重的人或事物。"},"examples":[{"en":"In some old texts, “cipher” means zero.","zh":"在一些旧文本里，“cipher”表示数字0。"},{"en":"He felt like a cipher in the huge company.","zh":"在那家大公司里，他觉得自己无足轻重。"}]}],"synonyms":["code","encryption","cryptogram","encode","encrypt"],"phonetic":"/ˈsaɪfɚ/","extraExplanation":["“cwifer” 不是常见英语单词拼写。我推测你想查的是 “cipher”。如果你是在特定语境（游戏ID、姓氏、地名、其他语言词）里看到 “cwifer”，把原句发我，我可以更准确判断。","词源小贴士：cipher 来自阿拉伯语 sifr（意为“零”），后来在欧洲语言中既指“0”，也引申为“密码/密文”。","相关词：encrypt（加密）、decrypt（解密）、code（代码/编码）、ciphertext（密文）、plaintext（明文）。"]}
{"word":"Cwikielnik","summary":{"en":"Cwikielnik is most commonly used as a Polish last name.","zh":"Cwikielnik 最常见的用法是作为波兰姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a Polish surname (family name).","zh":"一个波兰姓氏（家族姓）。"},"examples":[{"en":"My classmate’s last name is Cwikielnik.","zh":"我同学的姓是 Cwikielnik。"},{"en":"In the email signature, she wrote: Anna Cwikielnik.","zh":"在邮件签名里，她写的是：Anna Cwikielnik。"}]}],"synonyms":["(no direct synonyms; it’s a proper name)"],"phonetic":"/tsviˈkyel.nik/","extraExplanation":["这是一个专有名词（姓氏），通常首字母大写：Cwikielnik。","它看起来像波兰语拼写：字母组合“cw”在波兰语里常接近英语里“tsv/tsf”的感觉，“w”常更接近英语的“v”。因此英语使用者读起来可能会觉得不直观。","在英语语境中，遇到不确定的姓氏读音，最礼貌的做法是先询问对方：“How do you pronounce your last name?”（你的姓怎么读？）"]}
{"word":"cwilt","summary":{"en":"“cwilt” is not a common dictionary word; it’s usually a context-specific abbreviation or a username.","zh":"“cwilt”不是常见词典词汇；多为依语境而定的缩写或用户名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; usually seen as a username, handle, or an abbreviation/initialism whose meaning depends on context.","zh":"不是标准英语单词；通常作为用户名、代号，或某个缩写/首字母词出现，具体含义取决于语境。"},"examples":[{"en":"The email was signed “cwilt,” but the message didn’t explain what it stood for.","zh":"邮件署名为“cwilt”，但内容没有说明它代表什么。"},{"en":"I couldn’t find “cwilt” in a dictionary; it may be someone’s screen name.","zh":"我在词典里查不到“cwilt”；它可能是某人的网名。"}]}],"phonetic":"/si wɪlt/","extraExplanation":["“cwilt”本身不像常见英语词汇，更像是缩写或用户名。若你是在某篇文章、游戏、课程资料或公司文件里看到它，最可靠的方法是查看上下文（它出现在哪个领域、前后句在说什么），或询问原作者/提供者它的全称。","如果你本来想查的是 **wilt**（常见词，意为“枯萎/凋谢；（人）失去精神/变得无力”），也可以告诉我句子，我能帮你确认是否拼写有误。"]}
{"word":"Cwlth","summary":{"en":"“Cwlth” is a common abbreviation for “Commonwealth,” especially in Australian official contexts.","zh":"“Cwlth”常用作“Commonwealth”的缩写，尤其多见于澳大利亚的官方语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an informal written abbreviation for “Commonwealth,” especially used in Australian government, law, and business contexts.","zh":"“Commonwealth（联邦；英联邦）”的非正式书面缩写，尤其常见于澳大利亚的政府、公文、法律与商业语境中。"},"examples":[{"en":"This regulation applies under Cwlth law (Commonwealth law).","zh":"这项规定适用于澳大利亚联邦法律（Cwlth law）。"},{"en":"Cwlth funding will support the project next year.","zh":"联邦拨款（Cwlth funding）将于明年支持该项目。"}]}],"synonyms":["Commonwealth"],"phonetic":"/ˈkɑmənˌwɛlθ/","extraExplanation":["“Cwlth”在澳大利亚非常常见：如“Cwlth Act（联邦法案）”“Cwlth Gov（联邦政府）”。在一般英语写作中不常用，正式场合更常写全称“Commonwealth”。","注意：在不同国家/语境里，“Commonwealth”可能指“英联邦”（成员国共同体）或国家内部的“联邦”。澳大利亚语境中，“Cwlth”通常指澳大利亚联邦政府或联邦层级的法律。"]}
{"word":"cwm","summary":{"en":"A “cwm” is a steep mountain hollow, often a glacial cirque, especially seen in Welsh place names.","zh":"“cwm”指山中的陡峭凹地，常为冰川形成的冰斗地形，尤常见于威尔士地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a steep-sided hollow or basin in a mountain, often formed by glacial erosion; a cirque (common in Welsh place names).","zh":"（山中的）陡峭凹地/盆地，常由冰川侵蚀形成；相当于“冰斗”（常见于威尔士地名中）。"},"examples":[{"en":"The trail climbed past a quiet cwm beneath the ridge.","zh":"小径爬升，经过山脊下方一处安静的冰斗地形。"},{"en":"Geologists mapped several cwms carved by ancient glaciers.","zh":"地质学家绘制了多处由古冰川雕刻形成的冰斗地形。"}]}],"synonyms":["cirque","corrie","coomb"],"phonetic":"/kuːm/","extraExplanation":["“cwm”源自威尔士语，常用于英国地名中（尤其是威尔士），表示山谷里的凹地或盆地。在英语地理/地质语境里，它多指类似“cirque/ corrie”的冰川地貌。拼写里没有传统元音字母，因此常被提到作为“几乎不含元音的英语单词”之一。"]}
{"word":"Cwmbran","summary":{"en":"Cwmbran is a town in South Wales (Torfaen), near Newport.","zh":"Cwmbran 是英国威尔士南部（托法恩）的一座城镇，靠近纽波特。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A town in Torfaen, South Wales, near Newport, known for its post-war development and shopping center.","zh":"英国威尔士南部托法恩（Torfaen）的一座城镇，靠近纽波特（Newport），以战后规划发展及购物中心而闻名。"},"examples":[{"en":"Cwmbran is about a 30-minute drive from Cardiff, depending on traffic.","zh":"从加的夫（Cardiff）开车到Cwmbran大约30分钟，视路况而定。"},{"en":"She moved to Cwmbran for work and commutes to Newport.","zh":"她因为工作搬到Cwmbran，并通勤到纽波特。"}]}],"synonyms":["a town in South Wales","a Welsh town"],"phonetic":"/ˈkʊmˌbræn/","extraExplanation":["“Cwmbran”来自威尔士语：cwm 表示“山谷”（在英文里也会借用作地名/词语），bran 常被解释为“乌鸦”。整体常被理解为“乌鸦之谷”。","发音提示：开头的 cwm 在威尔士语里类似英文 “coom”（/kʊm/），不是按英语字母读成 /k-w-m/。","它是专有名词（地名），通常首字母大写；在英文地址、旅行介绍、新闻中会出现。"]}
{"word":"cwms","summary":{"en":"“Cwms” means steep mountain hollows/valleys (plural of “cwm”), often in Welsh or glacial landscapes.","zh":"“cwms”指陡峭的山谷凹地（cwm 的复数），常见于威尔士或冰川地貌语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of cwm: steep-sided mountain valleys or bowl-shaped hollows, especially in Wales or in glaciated mountains (similar to a cirque).","zh":"cwm 的复数：陡峭山谷或半圆形（碗状）的山间凹地，尤指威尔士或冰川作用形成的山区地形（类似“冰斗/圈谷”）。"},"examples":[{"en":"Snow lingered in the cwms long after spring arrived.","zh":"即使春天到了，积雪仍在那些山间冰斗（cwms）里久久不化。"},{"en":"The hikers crossed a ridge and looked down into two shadowy cwms.","zh":"徒步者翻过山脊，俯瞰两处阴影笼罩的山谷凹地（cwms）。"}]}],"synonyms":["valleys","mountain hollows","cirques","glacial hollows"],"phonetic":"/kʊmz/","extraExplanation":["“cwm”来自威尔士语，常见于英国（尤其威尔士）地名与地理描写中。虽然拼写里有 w，但英语里通常把它读作接近“oom”的音（/kʊm/），复数“cwms”读作 /kʊmz/。在地理/登山语境中，它常指冰川侵蚀形成的“圈谷/冰斗”（英语也常用 cirque）。"]}
{"word":"CWO","summary":{"en":"CWO is an abbreviation most commonly meaning “Chief Warrant Officer,” and in business/construction it can also mean “Change Work Order.”","zh":"CWO是一个缩写，最常见指“Chief Warrant Officer（首席准尉）”，在商业/工程中也可指“Change Work Order（变更工单）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) Chief Warrant Officer (a military rank, especially in the U.S. armed forces).","zh":"（缩写）准尉长／首席准尉（军衔，尤指美国军队中的军衔称谓）。"},"examples":[{"en":"She was promoted to CWO after several years as a warrant officer.","zh":"她担任准尉多年后晋升为CWO（首席准尉）。"},{"en":"The unit’s CWO briefed the team on aircraft maintenance procedures.","zh":"该分队的CWO向团队讲解了飞机维护流程。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., business/construction) Change Work Order (a formal document that changes the scope, cost, or schedule of a project).","zh":"（缩写，商业/工程）变更工单／变更令（用于正式变更项目范围、成本或工期的文件）。"},"examples":[{"en":"The contractor submitted a CWO to cover the extra materials.","zh":"承包商提交了CWO（变更工单）以涵盖额外材料费用。"},{"en":"No work will begin until the CWO is approved.","zh":"在CWO获批之前不会开工。"}]}],"synonyms":["Chief Warrant Officer","Change Work Order"],"phonetic":"/ˌsiː dʌbəlˌjuː ˈoʊ/","extraExplanation":["“CWO”是首字母缩写（initialism），通常逐个字母读作“C-W-O”，而不是读成一个单词。","在不同领域含义差异很大：军队语境里最常见的是“Chief Warrant Officer”；工程/项目管理语境里常见“Change Work Order”。阅读或写作时最好在首次出现处写全称以避免误解。"]}
{"word":"cwo","summary":{"en":"CWO is an abbreviation for Chief Warrant Officer, a senior warrant-officer rank/title used especially in U.S. military contexts.","zh":"CWO是Chief Warrant Officer（首席/主任准尉）的缩写，主要用于美军等军事语境中，表示较高级准尉军衔/称呼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for Chief Warrant Officer (a senior warrant-officer rank in some military forces, especially the U.S. Army)","zh":"“Chief Warrant Officer”的缩写（首席/主任准尉；在一些国家军队中，尤其是美国陆军的一种较高级准尉军衔）"},"examples":[{"en":"She was promoted to CWO after years as a warrant officer.","zh":"她当了多年准尉后，被晋升为CWO（首席准尉）。"},{"en":"The CWO briefed the team on equipment maintenance.","zh":"CWO向团队简要说明了装备维护事项。"}]},{"partOfSpeech":"other","definition":{"en":"a job title used for certain warrant officers (e.g., CWO2, CWO3) in U.S. military rank systems","zh":"在美军军衔体系中用于某些准尉级别的称呼/简称（如CWO2、CWO3等）"},"examples":[{"en":"He pinned on CWO3 last month.","zh":"他上个月佩戴了CWO3（三级首席准尉）的军衔。"},{"en":"Ask the CWO if the helicopter is mission-ready.","zh":"问问那位CWO直升机是否已具备任务出动状态。"}]}],"synonyms":["Chief Warrant Officer","warrant officer (general term)"],"phonetic":"/ˌsiː dʌbəl.juː ˈoʊ/","extraExplanation":["“CWO”通常出现在军事或政府文件、简历、军营对话中；在日常英语里不常用。","美国军衔里“warrant officer（准尉）”常被理解为介于士兵/军士与委任军官之间的专业技术军官；“Chief Warrant Officer”往往强调更高资历与专业领导能力。","不同国家/军种对准尉体系不完全相同；在读到“CWO”时，最好结合上下文确认具体指的是哪一类职务或等级（如CWO2、CWO4等）。"]}
{"word":"cwrite","summary":{"en":"“cwrite” is not standard English; it’s often a typo or a piece of technical shorthand.","zh":"“cwrite”不是标准英语；常见情况是拼写错误或技术语境下的简写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; usually a typo or a technical shorthand (e.g., “C write” meaning “write in the C programming language” or “write to C: drive”).","zh":"不是标准英语单词；通常是拼写错误或技术缩写（例如“C write”表示“用 C 语言编写/写入”，或“写入 C: 盘”）。"},"examples":[{"en":"I think you meant “rewrite,” not “cwrite.”","zh":"我觉得你想写的是“rewrite”，不是“cwrite”。"},{"en":"In some dev chats, people say “C write” to mean writing code in C.","zh":"在一些开发者聊天里，有人会说“C write”来表示用 C 语言写代码。"}]}],"synonyms":["rewrite","write","code in C"],"phonetic":"/ˈsiː raɪt/","extraExplanation":["“cwrite”在一般英语语料中很少见，因此在写作/考试/正式沟通里不建议使用。","如果你本来想表达“重写”，常见正确拼写是 rewrite；如果想表达“写”，用 write。","如果你是在编程语境看到的，请告诉我原句（或截图/上下文），我可以帮你判断它具体指“写入文件/写入磁盘/用C语言编写”等哪一种。"]}
{"word":"CWRU","summary":{"en":"CWRU = Case Western Reserve University, a private research university in Cleveland, Ohio.","zh":"CWRU指凯斯西储大学，美国俄亥俄州克利夫兰的一所私立研究型大学。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Case Western Reserve University, a private research university in Cleveland, Ohio, USA (often written as an acronym).","zh":"凯斯西储大学（Case Western Reserve University），美国俄亥俄州克利夫兰的一所私立研究型大学（常用缩写表示）。"},"examples":[{"en":"She was accepted to CWRU for biomedical engineering.","zh":"她被CWRU（凯斯西储大学）的生物医学工程专业录取了。"},{"en":"CWRU is known for strong programs in engineering and medicine.","zh":"CWRU以工程和医学等强势专业而闻名。"},{"en":"I’m visiting CWRU’s campus in Cleveland this weekend.","zh":"这周末我要去克利夫兰参观CWRU的校园。"}]}],"synonyms":["Case Western","Case Western Reserve University"],"phonetic":"/ˌsiː dʌbəl.juː ɑr juː/","extraExplanation":["CWRU通常读作字母缩写“C-W-R-U”（按字母逐个读），也有人在口语或写作中直接说“Case Western”。","学校名称来自两所机构的历史渊源：Case Institute of Technology 与 Western Reserve University，后来合并形成今天的CWRU。","在申请/简历/学术交流语境中，写“CWRU”很常见；正式场合首次出现时也可先写全称，再括号注明CWRU。"]}
{"word":"cwt","summary":{"en":"cwt = “hundredweight,” used for quoting weights and prices; it can mean 100 lb (US) or 112 lb (traditional UK).","zh":"cwt 是 hundredweight（担）的缩写，用于重量/价格标注；在美国多指 100 磅，在英国传统上指 112 磅。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abbreviation for “hundredweight,” a unit of weight used in trade and shipping (especially for goods like grain, coal, or produce).","zh":"“hundredweight（英美旧制重量单位）”的缩写，常用于贸易与运输计价（如谷物、煤、农产品等）。"},"examples":[{"en":"The invoice lists the shipment as 25 cwt of potatoes.","zh":"发票上写这批土豆的重量是 25 cwt。"},{"en":"Freight rates were quoted per cwt.","zh":"运费按每 cwt 报价。"}]},{"partOfSpeech":"n.","definition":{"en":"(US) a “short hundredweight” equal to 100 pounds (about 45.36 kg).","zh":"（美国）“短担”= 100 磅（约 45.36 千克）。"},"examples":[{"en":"In the U.S., 10 cwt equals 1,000 pounds.","zh":"在美国，10 cwt 等于 1,000 磅。"}]},{"partOfSpeech":"n.","definition":{"en":"(UK, historical) a “long hundredweight” equal to 112 pounds (about 50.80 kg).","zh":"（英国，历史用法）“长担”= 112 磅（约 50.80 千克）。"},"examples":[{"en":"Older British records may use cwt meaning 112 pounds.","zh":"较早的英国记录里，cwt 可能表示 112 磅。"}]}],"synonyms":["hundredweight","short hundredweight (US)","long hundredweight (UK, historical)"],"phonetic":"/ˈhʌndrədweɪt/","extraExplanation":["cwt 之所以看起来不像 “hundredweight” 的缩写，是因为它来自旧写法 “centum weight”（拉丁语 centum=一百）。为了避免把缩写写成 “ct”（容易与其他缩写混淆），保留了 c，并用 w 表示 weight，最后加 t。","实际使用中要特别注意地区差异：美国多指 100 磅（short cwt），英国传统上指 112 磅（long cwt）。在现代国际贸易里通常会改用 kg/tonne 来避免误解。"]}
{"word":"cwurd","summary":{"en":"“cwurd” isn’t a standard English word; it’s most likely a misspelling of “curd,” meaning the solid lumps formed when milk separates.","zh":"“cwurd”不是标准英文词；它很可能是“curd”的拼写错误，指牛奶分离时形成的凝乳/凝块。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely a misspelling) curd: a thick, soft lump that forms when milk separates into solid parts (used to make cheese, yogurt, etc.).","zh":"（可能是拼写错误）curd：牛奶凝结后形成的凝乳/凝块（常用于制作奶酪、酸奶等）。"},"examples":[{"en":"Heat the milk until it forms curds and whey.","zh":"把牛奶加热，直到它分离成凝乳和乳清。"},{"en":"The soup looked strange because the cream curdled into curds.","zh":"这汤看起来很奇怪，因为奶油结成了凝块。"}]},{"partOfSpeech":"v.","definition":{"en":"curd (of milk): to separate into thick lumps; to curdle.","zh":"（牛奶）凝结成块；结成凝乳（curdle）。"},"examples":[{"en":"The milk may curd if you add lemon juice.","zh":"如果你加柠檬汁，牛奶可能会凝结。"},{"en":"Don’t boil it too hard, or it will curd.","zh":"别把它煮得太猛，不然会结块。"}]}],"synonyms":["curd (standard spelling)","coagulated milk solids","curds"],"phonetic":"/kɝd/","extraExplanation":["“cwurd”不是常见的标准英文单词，更多时候像是把“curd”（凝乳）拼错了。","如果你其实想查的是别的词（例如“c-word”这种委婉说法，或某个名字/缩写），把完整句子或正确拼写发我，我可以按语境解释。"]}
