{"word":"CZ","summary":{"en":"“CZ” usually refers to the Czech Republic or its domain “.cz,” and it can also mean the letters C and Z.","zh":"“CZ”通常指捷克（或其域名“.cz”），也可表示字母 C 和 Z。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation for the Czech Republic (especially in sports results, travel, and country codes).","zh":"捷克共和国的缩写（常见于体育赛果、旅行信息和国家代码）。"},"examples":[{"en":"Our flight itinerary lists the destination as CZ (Czech Republic).","zh":"我们的航班行程单上把目的地写成 CZ（捷克）。"},{"en":"In the tournament table, CZ finished second.","zh":"在锦标赛积分表里，CZ 获得第二名。"}]},{"partOfSpeech":"other","definition":{"en":"The internet country code top-level domain (ccTLD) for the Czech Republic: “.cz”.","zh":"捷克的国家及地区顶级域名（ccTLD）：“.cz”。"},"examples":[{"en":"Many Czech websites end with .cz.","zh":"许多捷克网站的域名以 .cz 结尾。"},{"en":"The company uses a .cz domain for its local site.","zh":"这家公司用 .cz 域名作为其本地网站。"}]},{"partOfSpeech":"other","definition":{"en":"A way to say the letters “C” and “Z” (often used in names, brands, or initials).","zh":"字母 “C” 和 “Z” 的连读说法（常用于姓名、品牌或首字母）。"},"examples":[{"en":"Her initials are C.Z.","zh":"她的姓名首字母是 C.Z。"},{"en":"The model name is written as CZ-7.","zh":"这个型号写作 CZ-7。"}]}],"synonyms":["Czech Republic","Czechia",".cz","CZE"],"phonetic":"/siː ziː/","extraExplanation":["“CZ”在正式国家代码里常见于捷克：互联网域名是“.cz”，车牌国家识别码也常用“CZ”。另外，国际标准里捷克的两字母国家代码是“CZ”，三字母是“CZE”。在日常英文里，如果你要写“捷克”，更常见的还是直接写“Czech Republic”或“Czechia”。"]}
{"word":"Czajer","summary":{"en":"Czajer is most commonly a Polish-origin surname used as a family name.","zh":"Czajer 最常见的是一个波兰来源的姓氏，用作家族姓/姓。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A Polish-origin surname (family name). In English contexts, it most often appears as a last name.","zh":"一个波兰来源的姓氏（家族姓）。在英语语境中最常见的用法是作为姓/家族名出现。"},"examples":[{"en":"Ms. Czajer will join the meeting at 3 p.m.","zh":"Czajer 女士将于下午三点参加会议。"},{"en":"I saw the name Czajer on the class list.","zh":"我在班级名单上看到了 Czajer 这个名字。"}]}],"phonetic":"/ˈtʃaɪər/","extraExplanation":["“Czajer”看起来像波兰语姓氏。波兰语里字母组合“cz”通常发类似英语“ch”的音，所以英语读者常把它近似读成“CHAI-er/CHAI-yer”。","作为姓氏时，它一般不翻译成某个英文单词；在写作中通常保持原拼写（Czajer），首字母大写。若你指的是某位特定人物或品牌/公司名，也可能需要根据具体背景来解释。"]}
{"word":"Czanne","summary":{"en":"Cézanne is a famous French painter; it can also mean his paintings or his artistic style.","zh":"Cézanne 指著名法国画家塞尚；也可指他的作品或“塞尚风格”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually written “Cézanne”) Paul Cézanne (1839–1906), a major French painter whose work helped bridge Impressionism and modern art.","zh":"（通常写作“Cézanne”并带重音符号）保罗·塞尚（1839–1906），法国重要画家，其作品连接了印象派与现代艺术。"},"examples":[{"en":"Cézanne’s paintings of Mont Sainte-Victoire are among his most famous works.","zh":"塞尚描绘圣维克多山的系列画作是他最著名的作品之一。"},{"en":"Many art historians say Cézanne influenced modern artists like Picasso.","zh":"许多艺术史学者认为塞尚影响了毕加索等现代艺术家。"}]},{"partOfSpeech":"n.","definition":{"en":"Cézanne’s artworks or artistic style (used when talking about his paintings in general).","zh":"塞尚的作品或其艺术风格（用于泛指他的画作或风格）。"},"examples":[{"en":"The museum has three Cézannes on display this month.","zh":"这家博物馆本月展出了三幅塞尚的作品。"},{"en":"Her still life feels very Cézanne—solid shapes and careful color.","zh":"她的静物画很有“塞尚风”——形体扎实、用色讲究。"}]}],"synonyms":["Paul Cézanne"],"phonetic":"/seɪˈzɑːn/","extraExplanation":["“Czanne”多半是“Cézanne”的拼写误差；法语原写带重音符号“é”。英语里常直接写Cezanne/Cézanne，读音以重音落在第二音节为主。","塞尚以静物、风景（尤其是圣维克多山）和人物画闻名；他强调用色块与结构来“建构”形体，因此常被称为现代绘画的重要先驱之一。"]}
{"word":"Czar","summary":{"en":"Czar means the Russian emperor (pre-1917) and, informally, someone put in charge of a major policy area.","zh":"Czar指俄国革命前的沙皇，也可非正式指负责某重大政策领域的“总负责人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a ruler of Russia (an emperor), especially before the 1917 Russian Revolution; also spelled “tsar.”","zh":"（沙皇）俄国的皇帝/最高统治者，尤指1917年俄国革命前；也拼作“tsar”。"},"examples":[{"en":"Nicholas II was the last czar of Russia.","zh":"尼古拉二世是俄国最后一位沙皇。"},{"en":"Many history books discuss the power of the czar and the nobility.","zh":"许多历史书会讨论沙皇与贵族的权力。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) a person appointed to be in charge of a major government program or policy area.","zh":"（非正式）被任命负责某项重大政府计划或政策领域的人（常见于新闻用语）。"},"examples":[{"en":"The city appointed a “housing czar” to coordinate solutions to the housing crisis.","zh":"该市任命了一位“住房沙皇”来统筹解决住房危机。"},{"en":"Reporters asked the new drug czar about prevention and treatment plans.","zh":"记者就预防与治疗计划向新任“禁毒沙皇”提问。"}]}],"synonyms":["tsar","emperor","autocrat","policy chief"],"phonetic":"/zɑr/","extraExplanation":["“Czar/tsar”源自拉丁语“Caesar”（凯撒），经斯拉夫语系演变而来，因此在不同语言与英文中常见两种拼写：czar与tsar。","现代英语里把“czar”借用为比喻，常见于媒体标题，表示“强势的总负责人/统筹者”，但它不是正式官职名称，语气偏新闻化或带一点夸张。"]}
{"word":"czar","summary":{"en":"Czar means the former Russian emperor, or (informally) a powerful official in charge of a specific policy area.","zh":"czar 指旧俄国的“沙皇”，也可指（非正式）负责某一领域、权力较大的政策主管。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A powerful ruler; especially the former emperor of Russia.","zh":"沙皇；（尤指）旧俄国的皇帝。"},"examples":[{"en":"Nicholas II was the last czar of Russia.","zh":"尼古拉二世是俄罗斯最后一位沙皇。"},{"en":"The museum has an exhibit about the czars and their palaces.","zh":"博物馆有一处关于沙皇及其宫殿的展览。"}]},{"partOfSpeech":"n.","definition":{"en":"(In modern politics and media) An official in charge of a specific issue, often with broad authority.","zh":"（现代政治与媒体用语）“事务主管/总管”：负责某一领域、权力较大的官员。"},"examples":[{"en":"The government appointed a drug czar to coordinate national policy.","zh":"政府任命了一位“禁毒总管”来统筹全国政策。"},{"en":"Critics questioned how much power the new border czar would have.","zh":"批评者质疑新的“边境事务主管”会有多大权力。"}]}],"synonyms":["tsar","emperor","autocrat","chief","overseer","policy chief"],"phonetic":"/zɑr/","extraExplanation":["拼写与用法：czar 也常写作 tsar。两种拼写都常见；tsar 更接近俄语音译，czar 在美式英语里也很常用。","语气与语境：第二个意思多见于新闻标题与政治语境，带有“强势统筹者/一把手”的意味，有时也带一点讽刺或夸张。"]}
{"word":"czardas","summary":{"en":"A Hungarian dance (and its music) that typically begins slowly and speeds up dramatically.","zh":"匈牙利传统舞蹈及其舞曲，典型特点是先慢后快、节奏逐渐加速。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lively traditional Hungarian folk dance, usually starting slowly and then becoming very fast; also the music written for this dance style","zh":"恰尔达什舞（匈牙利传统民间舞）；也指为这种舞蹈风格创作的音乐，通常先慢后快、越跳越快"},"examples":[{"en":"The orchestra played a czardas, and the tempo suddenly sped up near the end.","zh":"乐团演奏了一段恰尔达什舞曲，结尾时速度突然加快。"},{"en":"She performed a czardas in a bright skirt, beginning with slow, dramatic steps.","zh":"她穿着鲜艳的裙子跳起恰尔达什舞，先以缓慢而富有戏剧性的步伐开场。"},{"en":"I recognized the melody from Monti’s famous “Csárdás.”","zh":"我认出了那段旋律，它出自蒙蒂那首著名的《恰尔达什》。"}]}],"synonyms":["Hungarian folk dance","Csárdás"],"phonetic":"/ˈtsɑrˌdɑʃ/","extraExplanation":["“czardas”也常见拼写为匈牙利语“csárdás”。这个词来自“csárda”（乡间小酒馆/客栈），因为这种舞曲和舞蹈常在这样的场所流行。","在西方古典音乐语境里，人们常用“(Monti’s) Csárdás”指意大利作曲家维托里奥·蒙蒂（Vittorio Monti）的那首炫技小品（常见于小提琴、吉他等改编），虽然它并非严格的民间原生态作品，但模仿了“先慢后快”的典型结构。"]}
{"word":"czardases","summary":{"en":"“Czardases” is the plural of “czardas,” a Hungarian dance/music that speeds up from slow to fast.","zh":"“czardases”是“czardas”的复数，指一种由慢到快逐渐加速的匈牙利舞蹈/舞曲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lively Hungarian folk dance (and its music), usually starting slowly and then speeding up; “czardases” is the plural form.","zh":"一种匈牙利民间舞（及其音乐），通常先慢后快、越跳越急；“czardases”为其复数形式。"},"examples":[{"en":"The orchestra played a czardas, and the tempo gradually became faster and faster.","zh":"乐队演奏了一段恰尔达什舞曲，速度逐渐越来越快。"},{"en":"In the ballet, the dancers performed several czardases to show Hungarian color.","zh":"在芭蕾中，舞者跳了几段恰尔达什来表现匈牙利风情。"}]}],"synonyms":["csardas","Hungarian folk dance","Hungarian dance"],"phonetic":"/tʃɑrˈdɑʃ/","extraExplanation":["“czardas / czardases”是英语里较旧或较常见于古典音乐语境的拼写；匈牙利语原写作“csárdás”（含重音符号á）。","恰尔达什常见结构是“lassú（慢段）→ friss（快段）”，因此你会听到从抒情到炫技、越来越快的变化。","古典音乐里很有名的作品是意大利作曲家Vittorio Monti的《Csárdás》，许多小提琴家会把它当作技巧展示曲。"]}
{"word":"czardom","summary":{"en":"Czardom means rule by a czar, especially Russia’s autocratic tsarist system before 1917.","zh":"czardom 指沙皇统治的制度，尤指1917年以前俄国的专制沙皇政体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A system of government ruled by a czar (tsar), especially the autocratic government of Russia before 1917.","zh":"由沙皇（tsar）统治的政体，尤指1917年以前俄国的专制沙皇统治制度。"},"examples":[{"en":"Many historians describe late imperial Russia as a society shaped by czardom and strict social hierarchy.","zh":"许多历史学家把帝俄末期描述为一个受沙皇专制与严格社会等级制度塑造的社会。"},{"en":"Writers and reformers criticized czardom for limiting political freedom and suppressing opposition.","zh":"作家和改革者批评沙皇专制限制政治自由、镇压反对声音。"}]}],"synonyms":["tsardom","autocracy","despotism","absolute monarchy"],"phonetic":"/ˈzɑrˌdəm/","extraExplanation":["“czar”也常拼作“tsar”，指俄国历史上的“沙皇”。“czardom”在英语里多用于历史与政治语境，带有“专制、集权”的评价色彩。","在现代英语中，“czar”还可引申为某领域由政府任命、负责协调的“主管/特派专员”（如“drug czar”），但“czardom”通常不用于这个现代引申义。"]}
{"word":"czardoms","summary":{"en":"“Czardoms” is the plural of “czardom,” meaning either lands ruled by a czar or periods/systems of czarist (often autocratic) rule.","zh":"“czardoms” 是 “czardom”的复数，指由沙皇统治的领土，或沙皇统治的时期/制度（常带有专制色彩）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of czardom: a territory or realm ruled by a czar (or czarina).","zh":"czardom 的复数：由沙皇（或女沙皇）统治的领土、国家或帝国。"},"examples":[{"en":"In the 1700s, several European powers watched the expansion of Russian czardoms with concern.","zh":"在18世纪，多个欧洲强国对俄罗斯各个沙皇领地的扩张感到担忧。"},{"en":"The map shows the borders of different czardoms over time.","zh":"这张地图展示了不同时期各个沙皇统治地区的边界变化。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of czardom: a political system or period of rule under a czar, often emphasizing absolute or autocratic power.","zh":"czardom 的复数：沙皇统治的制度或时期，常强调专制、集权的统治方式。"},"examples":[{"en":"Many reforms were attempted, but the czardoms kept tight control over politics and the press.","zh":"虽然尝试过多次改革，但沙皇政权仍对政治和新闻出版保持严格控制。"},{"en":"Some historians compare different czardoms to understand how autocracy shaped society.","zh":"一些历史学家比较不同的沙皇统治时期，以理解专制如何塑造社会。"}]}],"synonyms":["tsardoms","czarist realms","autocracies","absolute monarchies"],"phonetic":"/ˈzɑrdəmz/","extraExplanation":["“czar / tsar（沙皇）”一词源自拉丁语 *Caesar*（凯撒），后来在斯拉夫语中演变为表示“皇帝/君主”。英语里常见两种拼写：*czar*（较常见于美式英语）与 *tsar*（常见于英式英语或学术写作）。","现代英语里 *czar* 也可引申为“某领域的强势负责人/主管”（如 *drug czar*），但 *czardom* 多用于历史语境，表示“沙皇统治/沙皇国家”。"]}
{"word":"czarevich","summary":{"en":"A czarevich is the tsar’s son who is the heir to the throne in imperial Russia.","zh":"czarevich 指沙皇俄国时期沙皇的儿子、皇位继承人（皇太子/王储）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in imperial Russia) the son and heir apparent of the tsar; the crown prince.","zh":"（沙皇俄国）沙皇之子、皇位继承人；皇太子（王储）。"},"examples":[{"en":"The czarevich was educated by private tutors at the royal court.","zh":"皇太子在宫廷里由私人教师授课。"},{"en":"In many histories, the czarevich is portrayed as a symbol of the empire’s future.","zh":"在许多历史著作中，皇太子常被描绘为帝国未来的象征。"}]}],"synonyms":["tsarevich","crown prince","heir apparent"],"phonetic":"/ˌzɑrəˈvi(t)ʃ/","extraExplanation":["“czarevich”来自俄语“цесаревич / царевич”，在英文里也常见拼写变体：tsarevich、tsarevitch。现代英语写作中，“tsarevich”更常用于学术或较严格的转写。","它特指俄罗斯帝国时期的头衔（直到1917年革命）。最常被提到的历史人物之一是阿列克谢·尼古拉耶维奇（Alexei Nikolaevich），尼古拉二世之子。","读历史或文学译作时，注意它通常不等同于一般意义的“prince（王子）”，而更接近“crown prince（王储）/ heir apparent（法定继承人）”。"]}
{"word":"czarevitch","summary":{"en":"A czarevitch is the son of a Russian tsar, especially the heir to the throne.","zh":"czarevitch 指俄罗斯沙皇之子，尤指皇位继承人（皇太子）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the son of a Russian tsar, especially the official heir to the throne","zh":"（俄罗斯）沙皇之子；尤指皇位继承人（皇太子）"},"examples":[{"en":"In the novel, the czarevitch is sent away for safety during the revolution.","zh":"在小说里，革命期间皇太子被送走以确保安全。"},{"en":"Rumors spread that the czarevitch had survived the attack.","zh":"谣言四起，说皇太子在袭击中幸存了下来。"}]}],"synonyms":["tsarevich","czarewitch","tsarevitch"],"phonetic":"ˈzɑrɪˌvɪtʃ","extraExplanation":["“czarevitch”也常写作“tsarevich”。两者都来自俄语“царевич”，意思是“沙皇的儿子”；在历史语境中通常特指被正式认定的继承人。","在英语历史与文学作品中，它常出现在与俄国帝制、宫廷政治、以及19—20世纪初俄国革命相关的叙事里。最常被提到的具体人物之一是末代沙皇尼古拉二世的儿子阿列克谢（Alexei），他在英文资料中有时会被称为“the Czarevitch”。","拼写“cz-”是较旧的转写习惯；现代英文更常见“ts-”。读到不同拼法时，一般可视为同一个头衔。"]}
{"word":"czarevna","summary":{"en":"Czarevna means a Russian princess, especially the daughter of a tsar.","zh":"czarevna指俄罗斯的“沙皇之女（公主）”，有时在特定语境下也可能指沙皇的妻子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Russian imperial title meaning a tsar’s daughter (a princess); sometimes also used for the tsar’s wife, similar to “tsarina,” depending on historical context.","zh":"俄罗斯帝国时期的头衔，通常指沙皇的女儿（公主）；在某些历史语境中也可指沙皇的妻子（类似“沙皇后/女沙皇”），但需看具体用法。"},"examples":[{"en":"In the novel, the czarevna is portrayed as a sheltered princess living inside the palace.","zh":"在小说里，这位czarevna被描写成住在宫廷里、与世隔绝的公主。"},{"en":"The museum label mentioned a portrait of a czarevna from the Romanov era.","zh":"博物馆的说明牌提到一幅罗曼诺夫王朝时期czarevna的肖像。"}]}],"synonyms":["tsarevna","grand duchess (contextual)","Russian princess (general)"],"phonetic":"/ˌzɑːrˈɛv.nə/","extraExplanation":["“czarevna”也常见拼写为“tsarevna”。“cz/ts”都用来转写俄语“ц”(大致类似英语的“ts”音)。在英语历史文献或文学作品里，两种拼写都可能出现。","语境提示：更严格地说，“tsarevna/czarevna”多指“沙皇之女”；“tsaritsa/tsarina”更常指“沙皇之妻”。但在翻译或旧文献里，称谓有时会混用，因此阅读时要结合上下文判断。"]}
{"word":"czarevnas","summary":{"en":"Czarevnas means Russian imperial princesses—the daughters of a czar (tsar).","zh":"czarevnas 指俄国沙皇的女儿，即俄国皇室公主（czarevna 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of czarevna: a daughter of a Russian czar (tsar); a Russian imperial princess.","zh":"czarevna 的复数：俄国沙皇（tsar/czar）的女儿；俄国皇室公主。"},"examples":[{"en":"In the novel, the czarevnas are educated by foreign tutors at court.","zh":"在小说里，这些沙皇公主在宫廷中由外国家庭教师授课。"},{"en":"Portraits of the czarevnas hung along the palace corridor.","zh":"宫殿走廊里挂着一排沙皇公主的肖像。"}]}],"synonyms":["tsarevnas","Russian princesses"],"phonetic":"/ˌtsɑˈrɛv.nəz/","extraExplanation":["“czarevna”常见的另一种拼写是“tsarevna”，都是从俄语头衔音译而来。英文里“czar/tsar”指“沙皇”，后缀“-evna”表示女性称号，因此“czarevna/tsarevna”特指“沙皇的女儿（公主）”。","这个词多见于历史写作、文学作品、童话与芭蕾（如一些俄国宫廷题材故事）中，带有明显的俄国帝制文化语境。"]}
{"word":"czarewitch","summary":{"en":"Czarewitch means the (historical) Russian crown prince—the tsar’s son, especially the heir.","zh":"czarewitch 指（历史上的）俄国沙皇之子，尤指皇位继承人，即沙俄的王储。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) The son of a Russian tsar, especially the heir to the throne; the Russian crown prince.","zh":"（历史用语）俄国沙皇之子，尤指皇位继承人；俄国的皇太子/王储。"},"examples":[{"en":"Before the Russian Revolution, the czarewitch was seen as the future ruler of Russia.","zh":"在俄国革命之前，沙皇太子被视为俄罗斯未来的统治者。"},{"en":"The novel mentions the czarewitch as a symbol of the old imperial system.","zh":"小说把沙皇太子写作旧帝国制度的象征。"}]}],"synonyms":["tsarevich","tsarevitch","crown prince","heir to the throne"],"phonetic":"/ˈzɑrɪˌvɪtʃ/","extraExplanation":["“czarewitch”是较旧的英语拼写形式，更常见的现代拼写是“tsarevich/tsarevitch”。","词源来自俄语“tsarevich”（字面意思接近“沙皇之子”），常用于指末代沙皇尼古拉二世的儿子阿列克谢（Alexei）。","使用场景多见于历史书、文学作品或谈论沙俄皇室制度时；日常英语里更常用“crown prince（王储）”来表达相近概念。"]}
{"word":"czarian","summary":{"en":"Czarian means “related to a czar/tsar or czar-style autocratic rule” (and rarely, a supporter of it).","zh":"czarian 指“与沙皇或沙皇式专制统治有关的”（也可罕见指其支持者）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a czar (tsar) or the system of government ruled by a czar, especially the old Russian Empire; often implying strong, autocratic rule.","zh":"与沙皇（czar/tsar）或沙皇统治体制有关的，尤指旧俄帝国；常带有“专制、强势集权”的含义。"},"examples":[{"en":"Some historians describe the late Russian Empire as a czarian state with a powerful ruler and limited political freedom.","zh":"一些历史学家把晚期俄帝国描述为一种“沙皇式”的国家：统治者权力巨大，政治自由有限。"},{"en":"The novel paints a dark picture of czarian bureaucracy and censorship.","zh":"这部小说刻画了沙皇时代官僚体系与审查制度的阴暗面。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) A supporter of a czar or of czar-style rule.","zh":"（罕见）支持沙皇或支持“沙皇式统治”的人。"},"examples":[{"en":"In the debate, he was criticized as a czarian for defending absolute monarchy.","zh":"在辩论中，他因维护君主专制而被批评为“沙皇派”。"}]}],"synonyms":["tsarist","czarist","imperial","autocratic"],"phonetic":"/ˈzɑriən/","extraExplanation":["“czarian”在现代英语里很少见，更常见的对应词是“tsarist / czarist”（沙皇的；沙皇统治的）。","拼写上“czar”和“tsar”都指俄国“沙皇”，只是转写体系不同：在英语里两种拼法都能见到，但“tsar/tsarist”在学术写作里更常见一些。","比喻用法中（尤其在新闻评论里），类似“czar-like / czarist”可用来形容某个领导者或机构“权力过大、决策高度集中”。"]}
{"word":"czaric","summary":{"en":"Czaric means “connected with a czar (tsar) or the czars’ rule,” especially in Russia.","zh":"czaric 指“与沙皇或沙皇统治有关的”（尤指俄国）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to a czar (tsar) or to the government, power, or time of the czars—especially in Russia.","zh":"与沙皇（俄国君主）有关的；与沙皇统治、权力或沙皇时代（尤指俄国）有关的。"},"examples":[{"en":"Many novels describe life in czaric Russia before the revolution.","zh":"许多小说描写了革命前沙皇俄国的生活。"},{"en":"The reforms were limited by czaric authority.","zh":"改革受到沙皇权威的限制。"}]}],"synonyms":["tsarist","czarist","imperial (Russian)"],"phonetic":"/ˈzɑrɪk/","extraExplanation":["“czaric”较少见，更常用的是“tsarist / czarist”（沙皇制度的、沙皇主义的）或“of the tsars”。","拼写上“czar”和“tsar”都表示“沙皇”，差别主要来自不同的转写方式；现代英语中“tsar”在学术和新闻写作里更常见。","英语里“czar”也可引申指“某领域的主管/专员”（如“drug czar”），但“czaric”通常仍指历史上的沙皇相关。"]}
{"word":"czarina","summary":{"en":"A czarina is the empress of Russia or the wife of a czar.","zh":"czarina 指俄国的女沙皇（女皇），也可指沙皇的妻子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the empress of Russia; a female ruler with the title corresponding to a czar","zh":"（俄国的）女沙皇；女皇（与“czar/tsar”相对应的女性统治者称号）"},"examples":[{"en":"Catherine the Great is one of the most famous czarinas in Russian history.","zh":"叶卡捷琳娜大帝是俄罗斯历史上最著名的女沙皇之一。"},{"en":"In the novel, the czarina appears as a powerful but cautious leader.","zh":"在小说里，这位女沙皇被描写成强大但谨慎的统治者。"}]},{"partOfSpeech":"n.","definition":{"en":"the wife of a czar (even if she does not rule herself)","zh":"沙皇的妻子（即使本人不亲自执政也可这样称呼）"},"examples":[{"en":"At the ceremony, the czar and the czarina greeted the diplomats.","zh":"在典礼上，沙皇和皇后（女沙皇）向外交官致意。"},{"en":"The czarina’s role at court was both political and symbolic.","zh":"这位女沙皇在宫廷中的角色既具有政治性，也具有象征意义。"}]}],"synonyms":["tsarina","empress","queen consort"],"phonetic":"/zəˈriːnə/","extraExplanation":["“czarina”也常拼作“tsarina”，两者读音相同，都是从俄语称号转写而来；现代英语中“tsar/tsarina”在学术或新闻语境里更常见。","历史语境中常见的“czarina”包括 Catherine the Great（叶卡捷琳娜大帝）。在文学作品里（如描写俄国宫廷或帝国政治的小说）也会用该词来营造历史氛围。"]}
{"word":"czarinas","summary":{"en":"“Czarinas” means female czars/empresses (plural), especially in Russian history; also spelled “tsarinas.”","zh":"“czarinas”指“女沙皇/俄国女皇”（复数），多用于俄国历史语境；也常拼作“tsarinas”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of czarina: a female czar—especially an empress of Russia (the wife of a czar or a woman ruling as a czar).","zh":"czarina 的复数：女沙皇；（尤指）俄国女皇/沙皇之妻，或以沙皇身份统治的女性。"},"examples":[{"en":"The museum displayed portraits of Russian czarinas in formal dress.","zh":"博物馆展出了身着礼服的俄国女沙皇画像。"},{"en":"Several czarinas supported charities and education reforms in their time.","zh":"一些女沙皇在其时代支持慈善事业和教育改革。"}]}],"synonyms":["tsarinas","empresses","queens"],"phonetic":"/zɑˈrinə/","extraExplanation":["“czarina”也常拼作“tsarina”。“czar/tsar”来自拉丁语“Caesar（凯撒）”，在俄国历史语境中指最高统治者，因此“czarina/tsarina”常用于谈论俄罗斯帝国时期的女性统治者或皇后。","在现代英语里，“czar”有时会引申为“主管某领域的要员/专员”（如“drug czar”），但“czarina”这种引申用法相对少见。"]}
{"word":"czarinian","summary":{"en":"Czarinian means “connected with a czarina or the Russian czarist court,” and it’s a rare, literary-sounding adjective.","zh":"czarinian 指“与女沙皇或沙皇时代的俄国宫廷相关的”，属于较少见、偏文学化的形容词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a czarina (a female czar/empress of Russia) or to the Russian imperial court under a czar.","zh":"与女沙皇（俄国女皇/女沙皇）或与沙皇统治时期的俄国宫廷相关的。"},"examples":[{"en":"The museum displayed czarinian jewelry from the Russian court.","zh":"博物馆展出了来自俄国宫廷的女沙皇式珠宝。"},{"en":"In the novel, the heroine lives a czarinian life of strict etiquette and luxury.","zh":"在小说中，女主角过着一种讲究礼仪又奢华的女沙皇式生活。"}]}],"synonyms":["tsarist","czarist","imperial Russian","courtly"],"phonetic":"/zɑˈrɪniən/","extraExplanation":["“czarinian”是非常少见的词，更常见的说法是：**tsarist/czarist**（沙皇统治的、沙皇制度的）或 **imperial Russian**（俄国帝国时期的）。","拼写上 **czar** 和 **tsar** 都指“沙皇”，只是不同的英语转写习惯；现代英语里两者都能见到，但学术写作常用 **tsar**。","**czarina/tsarina** 指“女沙皇/沙皇的妻子或女皇”。“czarinian”通常带有一种文学化、复古的语感，用来营造“俄国宫廷风”的氛围。"]}
{"word":"czarish","summary":{"en":"Czarish means “like a czar”: autocratic and domineering.","zh":"czarish 指“像沙皇一样”：专断、专制、盛气凌人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like a czar (tsar); autocratic, domineering, or exercising absolute authority.","zh":"像沙皇（tsar）的；专断的、专制的、独断专行的。"},"examples":[{"en":"Employees complained about his czarish management style.","zh":"员工抱怨他的管理风格很专断。"},{"en":"The committee rejected the proposal because it gave one person czarish power.","zh":"委员会否决了该提案，因为它会让一个人拥有近乎专制的权力。"},{"en":"She disliked the czarish tone of the email and asked for a more respectful message.","zh":"她不喜欢那封邮件里专横的语气，要求改得更尊重一些。"}]}],"synonyms":["autocratic","authoritarian","domineering","dictatorial","imperious"],"phonetic":"/ˈzɑːrɪʃ/","extraExplanation":["“czarish”来自“czar/tsar（沙皇）”。英语里两种拼写都常见：czar更常用于比喻义（如“drug czar”毒品事务主管），tsar更偏历史语境（俄国沙皇）。","这个词通常带贬义，用来批评某人“说了算”、不愿听取意见、以权压人。写作或新闻评论中更常见，日常口语里多用“bossy / authoritarian / domineering”。"]}
{"word":"czarism","summary":{"en":"Czarism means government by a czar—especially the autocratic rule of Russian tsars—and can also mean a criticized tendency toward centralized authoritarian power.","zh":"czarism 指沙皇制度/沙皇专制（尤指俄国沙皇时期的专制统治），也可引申指被批评的高度集权威权倾向。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A system of government ruled by a czar (tsar), especially the autocratic rule of the Russian tsars before 1917.","zh":"沙皇制度；沙皇专制（尤指1917年前俄罗斯沙皇的专制统治）"},"examples":[{"en":"Many history books describe czarism as an autocratic system with strong central control.","zh":"许多历史书把沙皇制度描述为一种高度集权的专制体制。"},{"en":"Revolutionary movements in Russia grew partly in reaction to czarism.","zh":"俄国的革命运动部分是在反对沙皇专制的背景下发展起来的。"}]},{"partOfSpeech":"n.","definition":{"en":"A political attitude or approach that favors strong, centralized, authoritarian leadership (used more generally or critically).","zh":"（引申、常带批评）推崇强人政治/高度集权威权领导的政治倾向"},"examples":[{"en":"Critics warned that the policy could lead to a new kind of czarism.","zh":"批评者警告说，这项政策可能导致一种新的“沙皇式”集权。"},{"en":"He accused the administration of czarism, saying too much power was in one office.","zh":"他指责政府搞“沙皇式统治”，认为权力过度集中在一个部门/办公室。"}]}],"synonyms":["tsarism","autocracy","despotism","authoritarianism","dictatorship"],"phonetic":"/ˈzɑːrɪzəm/","extraExplanation":["“czarism”源自“czar/tsar（沙皇）+ -ism（主义/制度）”。在英语里更常见的拼写是“tsarism”，但“czarism”也可用，尤其在美式拼写或历史语境中。","历史语境里它通常特指俄国罗曼诺夫王朝时期的专制体制；在现代政治评论中作比喻用法时，往往带贬义，强调权力过度集中、缺乏制衡。"]}
{"word":"czarisms","summary":{"en":"Czarism means the autocratic system of rule under a czar, especially in pre-1917 Russia, and by extension any strongly centralized authoritarian rule.","zh":"Czarism指沙皇统治/沙皇制度（尤指1917年前俄国的专制体制），也可引申为任何高度集权的专制统治方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the system of government under a czar (tsar), especially the autocratic rule of the Russian emperors before 1917","zh":"沙皇制度；沙皇统治（尤指1917年以前俄国皇帝的专制统治）"},"examples":[{"en":"Many history books describe how czarism shaped Russian society before the 1917 Revolution.","zh":"许多历史书会描述沙皇制度如何在1917年革命前影响俄罗斯社会。"},{"en":"Opponents of czarism demanded political reforms and greater civil rights.","zh":"反对沙皇制度的人要求政治改革与更多公民权利。"}]},{"partOfSpeech":"n.","definition":{"en":"more generally, a style of rule that is highly centralized and authoritarian","zh":"（泛指）高度集权、带有专制色彩的统治方式"},"examples":[{"en":"Critics warned that the new leader’s policies could slide into czarism.","zh":"批评者警告说，新领导人的政策可能会滑向“沙皇式”的专断统治。"},{"en":"The article uses “czarism” as a metaphor for unchecked executive power.","zh":"这篇文章用“czarism（沙皇式统治）”作比喻，指缺乏制衡的行政权力。"}]}],"synonyms":["autocracy","despotism","absolutism","authoritarianism","dictatorship"],"phonetic":"/ˈzɑrɪzəm/","extraExplanation":["“czarism”源自“czar/tsar（沙皇）”，该词与拉丁语“Caesar（凯撒）”同源，后来在英语中常用来指俄国沙皇时代的专制体制。","你输入的“czarisms”是复数形式（多个“czarism”的例子或不同的“沙皇式做法/倾向”）。实际写作中更常见单数“czarism”，或用形容词“czarist（沙皇的/沙皇主义的）”。"]}
{"word":"czarist","summary":{"en":"Czarist means “connected with the Russian tsar or tsarist government,” especially before 1917.","zh":"czarist 指“与俄国沙皇或沙皇政体有关的”，尤指1917年以前。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a czar (tsar) or the system of government ruled by a czar, especially in Russia before 1917.","zh":"与沙皇（tsar）有关的；沙皇统治时期的（尤指1917年以前的俄国）。"},"examples":[{"en":"Czarist Russia had strong central authority under the tsar.","zh":"沙皇俄国在沙皇统治下拥有强大的中央集权。"},{"en":"Many writers criticized czarist policies for limiting political freedoms.","zh":"许多作家批评沙皇时期的政策限制政治自由。"}]}],"synonyms":["tsarist","imperial (Russian)","autocratic (contextual)"],"phonetic":"/ˈzɑrɪst/","extraExplanation":["“czarist”常用于历史与政治语境，指俄国沙皇体制（常被描述为专制/高度集权）。与之相关的常见搭配有：czarist regime（沙皇政权）、czarist autocracy（沙皇专制）、czarist police（沙皇秘密警察/警察系统）。","拼写上英美都常见“czarist”；在学术或历史书写中也常见“tsarist”，其中“tsar”更贴近俄语转写。"]}
{"word":"czaristic","summary":{"en":"An adjective meaning “of or like a czar/tsar,” especially referring to the autocratic rule of imperial Russia.","zh":"形容词，指“与沙皇/沙皇制度有关的”，尤指俄罗斯帝国时期的专制统治。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to a czar (tsar) or the system of government ruled by a czar, especially the autocratic rule of imperial Russia.","zh":"与沙皇（tsar）或沙皇统治制度有关的，尤指俄罗斯帝国时期的专制统治。"},"examples":[{"en":"Many history books describe the czaristic government as highly centralized and authoritarian.","zh":"许多历史书把沙皇专制政府描述为高度集权、带有威权色彩。"},{"en":"The novel is set in late czaristic Russia, just before the revolution.","zh":"这部小说背景设在革命前夕的晚期沙皇俄国。"}]}],"synonyms":["tsarist","autocratic","authoritarian"],"phonetic":"/zɑːrˈɪstɪk/","extraExplanation":["“czaristic”常见于历史、政治学语境，谈论“沙皇制度”（tsarism）或“沙皇时代”。现代英语里更常见的拼写是“tsarist/tsaristic”；“czar”多用于传统或历史拼写。","在当代政治评论中，有时会把某些领导风格形容为“czaristic”，带有“强人政治、个人集权”的批评意味，使用时注意语气和场合。"]}
{"word":"czarists","summary":{"en":"Czarists are supporters of a czar (tsar) and the old Russian imperial monarchy, especially before 1917.","zh":"Czarists 指支持沙皇（俄国皇帝）及旧俄罗斯帝国君主制度的人，尤指1917年革命前的沙皇派。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who support or belong to the system of rule by a czar (tsar), especially supporters of the old Russian imperial monarchy before the 1917 Revolution.","zh":"沙皇制度的支持者/拥护者；（尤指）1917年俄国革命前俄罗斯帝国旧沙皇君主制的拥护者。"},"examples":[{"en":"After the revolution, czarists were often blamed for the old regime’s problems.","zh":"革命之后，沙皇派常被指责为旧政权问题的根源。"},{"en":"The novel describes clashes between czarists and revolutionary groups in the streets.","zh":"这部小说描写了街头沙皇派与革命团体之间的冲突。"}]}],"synonyms":["tsarists","royalists (in the Russian context)","imperial loyalists"],"phonetic":"/ˈzɑrɪsts/","extraExplanation":["“czarists”也常写作“tsarists”。“czar/tsar”源自“Caesar（凯撒）”，在历史上是俄罗斯皇帝的称号。","在英语历史与政治语境里，czarist 常带有“保皇、反革命、支持专制旧秩序”的含义，使用时带有一定立场色彩。","相关词：czarism/tsarism（沙皇制度、沙皇主义）；anti-czarist（反沙皇的）；the Romanovs（罗曼诺夫王朝，常与沙皇统治一起出现）。"]}
{"word":"czaritza","summary":{"en":"Czaritza means a Russian empress or the wife of a tsar; it’s an uncommon spelling of tsaritsa/tsarina.","zh":"Czaritza 指俄罗斯女皇或沙皇的妻子，是 tsaritsa/tsarina 的不常见拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the wife of a Russian tsar; a Russian empress (a less common spelling of “tsaritsa/tsarina”).","zh":"俄罗斯沙皇的妻子；俄罗斯女皇（“tsaritsa/tsarina”的较少见拼写）。"},"examples":[{"en":"The novel describes the czaritza’s life inside the imperial court.","zh":"这部小说描写了这位女皇在皇室宫廷中的生活。"},{"en":"Many people remember the last czaritza, Alexandra, from stories about the Romanov family.","zh":"许多人从有关罗曼诺夫王朝的故事中记得最后一位女皇亚历山德拉。"}]}],"synonyms":["tsarina","tsaritsa","empress (of Russia)"],"phonetic":"/zɑˈritsə/","extraExplanation":["“czaritza”是英语里对俄语“царица”的转写之一，更常见的拼法是“tsaritsa”或“tsarina”。","在历史语境中，它通常指俄罗斯帝国时期沙皇的配偶（皇后/女皇）；在文学作品中也常被用来营造“帝俄宫廷”的氛围。"]}
{"word":"czaritzas","summary":{"en":"“czaritzas” is the plural of “czaritsa/tsaritsa,” meaning Russian empresses or the wives of czars.","zh":"“czaritzas”是“czaritsa/tsaritsa”的复数，指俄罗斯的皇后或沙皇的妻子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of czaritsa/tsaritsa) the wife of a czar; a Russian empress.","zh":"（czaritsa/tsaritsa 的复数）沙皇的妻子；俄罗斯的皇后（女皇/皇后）。"},"examples":[{"en":"The novel describes the intrigues at court surrounding the czar and the czaritzas.","zh":"这部小说描写了围绕沙皇及其皇后们的宫廷阴谋。"},{"en":"Portraits of the czaritzas were used to project power and tradition.","zh":"皇后们的肖像被用来展现权威与传统。"}]}],"synonyms":["tsaritsas","czarinas","empresses"],"phonetic":"/zɑˈriːtsəz/","extraExplanation":["“czaritsa/tsaritsa”来自俄语“царица”，意思是“女沙皇/皇后”。英语里常见两套拼写：czar-（受德语/早期转写影响）与 tsar-（更接近现代常用转写）。","在历史语境中，它通常指俄罗斯帝国时期沙皇的配偶（例如尼古拉二世的妻子亚历山德拉常被称为 tsaritsa）。在文学与历史写作中也可能泛指“皇后们/沙皇的妻子们”。"]}
{"word":"czarowitch","summary":{"en":"Czarowitch is an older spelling for tsarevich/czarevich, meaning the (heir) son of a Russian czar.","zh":"czarowitch 是较旧拼写，指俄国沙皇之子，尤指皇位继承人（皇太子）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Historical) the son of a czar (tsar), especially the official heir to the Russian throne; a tsarevich.","zh":"（史）沙皇之子，尤指俄国皇位的正式继承人；皇太子（亦作 tsarevich / czarevich）。"},"examples":[{"en":"Before the revolution, the czarowitch was expected to be trained for leadership from childhood.","zh":"在革命之前，皇太子从小就被期望接受治国的训练。"},{"en":"The novel mentions the czarowitch attending a grand ceremony at the palace.","zh":"小说提到皇太子在宫中参加一场盛大的典礼。"}]}],"synonyms":["tsarevich","czarevich","heir apparent (contextual)"],"phonetic":"/ˈzɑrəvɪtʃ/","extraExplanation":["“czarowitch”是较旧的英语拼写，来源于对俄语“царевич”（常转写为 tsarevich / czarevich，意为“沙皇之子/皇太子”）的不同音译方式。现代英语中更常见的是“tsarevich”或“czarevich”。","在文化作品中也能见到这种拼写，例如歌剧/轻歌剧《Der Zarewitsch》（莱哈尔作曲）在英文资料里有时会出现“Czarowitch”等变体拼法。"]}
{"word":"czarowitz","summary":{"en":"Czarowitz is usually a surname (a last name), not a standard English word.","zh":"Czarowitz 通常是一个姓氏，并非标准英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A family name (surname). It is not a common English vocabulary word; it’s typically used as a last name, often with Slavic/Eastern European roots.","zh":"一个姓氏（家族姓）。它不是常见的英语词汇，通常作为英文里的姓使用，常见于有斯拉夫/东欧背景的家族。"},"examples":[{"en":"Ms. Czarowitz will lead today’s meeting.","zh":"Czarowitz 女士将主持今天的会议。"},{"en":"I saw the name Czarowitz on the office directory.","zh":"我在办公室通讯录上看到了 Czarowitz 这个名字。"}]}],"phonetic":"/ˈzɑroʊvɪts/","extraExplanation":["拼写里常见的 -witz / -vitz / -ovich / -owitz 等结尾，通常与斯拉夫语系姓氏的转写有关；不同移民记录或地区习惯可能导致拼写变化。","注意不要把它当作英语普通名词使用；在写作中一般需要大写（Czarowitz），并按“姓氏”来理解。","如果你是在某本书、电影字幕或文件里见到这个词，它很可能指某个人名；没有固定的“词义”，意义主要来自具体人物或家族背景。"]}
{"word":"Czarra","summary":{"en":"“Czarra” is not a common standard English word; it’s usually a name or a variant/misspelling of “czar/tsar.”","zh":"“Czarra”不是常见标准英语词；通常是人名，或是“czar/tsar”的变体/误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare or nonstandard form; most often it is a misspelling or stylized spelling of “czar/tsar” (a powerful ruler) or a surname/brand name.","zh":"一个较少见或非标准的拼写；通常是“czar/tsar（沙皇/权势人物）”的误拼或风格化拼写，也可能是姓氏或品牌名。"},"examples":[{"en":"I couldn’t find “Czarra” in a standard dictionary; did you mean “czar” or “tsar”?","zh":"我在常见词典里找不到“Czarra”；你是不是想写“czar”或“tsar”？"},{"en":"In some usernames or product names, people use unusual spellings like “Czarra” for style.","zh":"在一些用户名或产品名中，人们会用像“Czarra”这样不寻常的拼写来增加风格感。"}]},{"partOfSpeech":"n.","definition":{"en":"(If used as a proper name) A family name or given name; its meaning depends on the person or context.","zh":"（若作为专有名词）人名或姓氏；具体含义取决于人物或语境。"},"examples":[{"en":"Czarra Johnson will speak at the event tomorrow.","zh":"Czarra Johnson 将在明天的活动上发言。"},{"en":"I saw “Czarra” listed as a character’s name in the credits.","zh":"我在字幕表里看到“Czarra”被列为一个角色名字。"}]}],"synonyms":["czar","tsar"],"phonetic":"/ˈzɑːrə/","extraExplanation":["“czar/tsar”来自俄语“царь”（沙皇），词源可追溯到拉丁语“Caesar（凯撒）”。现代英语里，czar/tsar 也常比喻“某领域的掌权者/负责人”，如“drug czar（禁毒主管）”。如果你是在文章或新闻里看到“Czarra”，很可能是误拼或刻意改写。"]}
{"word":"Czars","summary":{"en":"“Czars” means powerful rulers (especially Russia’s emperors) or, informally, powerful officials in charge of a policy area.","zh":"“czars”指拥有极大权力的统治者（尤指俄国沙皇），也可非正式指负责某一政策领域、权力很大的官员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “czar”: a ruler with very great power, especially the emperors of Russia before 1917.","zh":"“czar”的复数：拥有极大权力的统治者，尤指1917年之前俄国的沙皇（皇帝）。"},"examples":[{"en":"The czars ruled Russia for centuries before the revolution.","zh":"革命之前，沙皇统治俄国长达数个世纪。"},{"en":"Many stories describe life under the Russian czars.","zh":"许多故事描写了俄国沙皇统治下的生活。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) Powerful officials put in charge of a specific policy area (e.g., “drug czar,” “energy czar”).","zh":"（非正式）负责某一政策领域、权力很大的官员（如“drug czar 禁毒主管”“energy czar 能源主管”）。"},"examples":[{"en":"The government appointed a new drug czar to fight trafficking.","zh":"政府任命了一位新的禁毒主管来打击贩运。"},{"en":"Critics said the “housing czar” had too much authority.","zh":"批评者说这位“住房主管”权力过大。"}]}],"synonyms":["tsars","autocrats","monarchs","rulers","policy chief","chief","commissioner"],"phonetic":"/zɑr/","extraExplanation":["“czar/tsar”源自俄语“царь”，与拉丁语“Caesar（凯撒）”同源，因此带有“至高统治者”的历史色彩。英语里也常用作比喻，表示某人对某领域有很大掌控力，但语气有时带一点讽刺或夸张。","拼写方面：英式常见“tsar(s)”，美式也常见“czar(s)”。两者意思相同。"]}
{"word":"czars","summary":{"en":"“Czars” is the plural of “czar”: (1) the former emperors of Russia; (2) a powerful person in charge of a specific area, often in government or business.","zh":"“czars”是“czar”的复数：① 1917年前的俄国皇帝（沙皇）；② 引申为负责某一领域、权力很大的主管/负责人（常见于政府或商业语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A czar (also spelled tsar) is the emperor of Russia before 1917; “czars” is the plural form.","zh":"czar（也拼作 tsar）指1917年以前的俄国皇帝；czars 为复数。"},"examples":[{"en":"Nicholas II was the last Russian czar.","zh":"尼古拉二世是俄国最后一位沙皇（czar）。"},{"en":"Many history books describe life under the czars.","zh":"许多历史书描述了沙皇统治下的生活。"}]},{"partOfSpeech":"n.","definition":{"en":"In modern English, an influential person in charge of a particular area (often government or business), even if the role is informal.","zh":"在现代英语中，指负责某一领域、很有权力/影响力的人（常用于政府或商业语境，职位有时并非正式）。"},"examples":[{"en":"The city appointed a “housing czar” to coordinate policy.","zh":"该市任命了一位“住房主管/住房沙皇”来统筹政策。"},{"en":"She became the company’s marketing czar after the merger.","zh":"合并后，她成了公司市场事务的“总管/一把手”。"}]}],"synonyms":["tsars","emperors","rulers","autocrats","bosses","chiefs"],"phonetic":"/zɑrz/","extraExplanation":["“czar”常见另一种拼法是“tsar”，都来自俄语词“царь”，意为“君主/皇帝”。英语里用“czar”作比喻时，通常带有“权力很大、能拍板”的语气。","在新闻英语中，“drug czar / border czar / energy czar”等表达很常见，通常指政府指定的协调负责人，不一定是正式官职。"]}
{"word":"czarship","summary":{"en":"Czarship means the rule or authority of a czar, and more generally any highly centralized, strong personal control (including the informal “government czar” role).","zh":"Czarship 指沙皇的统治/权力，也可泛指强势个人集权的控制（也包括媒体所说的政府“事务总管/专员”职位）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the position, power, or period of rule of a czar (tsar); by extension, any very strong, centralized authority led by one person","zh":"沙皇（tsar/czar）的职位、权力或统治时期；引申为由一人高度集权、强势掌控的统治/权力结构"},"examples":[{"en":"The novel describes life under czarship in nineteenth-century Russia.","zh":"这部小说描写了19世纪俄国沙皇统治下的生活。"},{"en":"Many people criticized the reforms as a return to czarship.","zh":"许多人批评这些改革是回到“沙皇式专制”。"}]},{"partOfSpeech":"n.","definition":{"en":"an informal term for the authority or office of a government “czar,” a powerful coordinator appointed to manage a specific issue","zh":"（非正式）政府“事务总管/专员（czar）”的权力或职务；指被任命来统筹某一重大议题的强势协调角色"},"examples":[{"en":"The administration created a new cybersecurity czarship to coordinate policy across agencies.","zh":"政府设立了新的网络安全“总管”职位，以便跨部门协调政策。"},{"en":"Critics argued the czarship lacked clear legal limits.","zh":"批评者认为这个“总管”职位缺乏明确的法律边界。"}]}],"synonyms":["autocracy","despotism","absolute rule","dictatorship"],"phonetic":"/ˈzɑrˌʃɪp/","extraExplanation":["“czarship”来自“czar/tsar（沙皇）+ -ship（表示身份、职位或状态的后缀）”。英语里既可拼作“tsarship”也可拼作“czarship”。","在美国政治语境中，“czar”常被媒体用作非正式称呼（如“drug czar”），表示权力集中、负责统筹的官员或角色；这种用法带有评价色彩，有时暗示“权力过大”或“缺乏监督”。"]}
{"word":"CZE","summary":{"en":"CZE is a common country-code abbreviation for the Czech Republic (Czechia).","zh":"CZE 是捷克（捷克共和国/捷克）的常见国家代码缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation used as a country code for the Czech Republic (Czechia), especially in sports and international listings (e.g., IOC/Olympics, FIFA, some datasets).","zh":"“CZE”常用作捷克（Czech Republic / Czechia）的国家代码缩写，常见于体育赛事（如奥运/国际比赛）或国际名单与数据表中。"},"examples":[{"en":"CZE won two medals in the men’s events.","zh":"CZE（捷克队）在男子项目中赢得了两枚奖牌。"},{"en":"In this dataset, CZE stands for the Czech Republic.","zh":"在这份数据中，CZE 代表捷克共和国。"}]}],"synonyms":["Czech Republic","Czechia","CZ"],"phonetic":"/siː ziː iː/","extraExplanation":["“CZE”属于三字母国家缩写的一种：在奥运会等场景里是捷克奥委会代码；在足球等比赛或统计表中也常见。需要注意：ISO 3166-1 的三字母代码通常写作 “CZE”，两字母代码是 “CZ”。日常英语写作中更常直接写 “Czech Republic” 或 “Czechia”。"]}
{"word":"Czech","summary":{"en":"Czech can mean “from the Czech Republic” (adj.), a Czech person (n.), or the Czech language (n.).","zh":"Czech 可表示“捷克的”（形容词）、“捷克人”（名词）或“捷克语”（名词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Czech Republic, its people, or its language.","zh":"与捷克共和国、捷克人或捷克语有关的；捷克的。"},"examples":[{"en":"Czech food often includes soups, dumplings, and roasted meats.","zh":"捷克菜常见汤、团子（面团/饺子类）和烤肉。"},{"en":"She studies Czech history at university.","zh":"她在大学学习捷克历史。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from the Czech Republic.","zh":"捷克人；来自捷克共和国的人。"},"examples":[{"en":"Two Czechs joined our international team this year.","zh":"今年我们国际团队来了两位捷克人。"}]},{"partOfSpeech":"n.","definition":{"en":"the Slavic language spoken in the Czech Republic.","zh":"捷克语（捷克共和国使用的斯拉夫语）。"},"examples":[{"en":"He can speak Czech and English.","zh":"他会说捷克语和英语。"},{"en":"This sign is written in Czech.","zh":"这个标牌是用捷克语写的。"}]}],"synonyms":["Czechia (for the country, not the adjective)"],"phonetic":"/tʃɛk/","extraExplanation":["“Czech”的发音以 /tʃ/ 开头，像英文“chess”的开头音。","在英语里，“Czech”既可指“捷克的”（形容词），也可指“捷克人/捷克语”（名词）。根据句子位置判断：放在名词前多为形容词（Czech culture），单独作主语/宾语常为名词（He speaks Czech）。","“Czech”来自“Čech（捷克人）”一词的英文写法；“Czech Republic”现今也常简称为“Czechia”（捷克）。"]}
{"word":"czech","summary":{"en":"Czech means “from the Czech Republic” (adjective), and it can also mean a Czech person or the Czech language (nouns).","zh":"Czech 可作形容词表示“捷克的”；也可作名词表示“捷克人”或“捷克语”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Czech Republic, or to its people, language, or culture.","zh":"与捷克共和国有关的；捷克人、捷克语或捷克文化的。"},"examples":[{"en":"Czech food often includes dumplings and rich sauces.","zh":"捷克菜常见有面团饺子（dumplings）和浓郁的酱汁。"},{"en":"She studies Czech history at university.","zh":"她在大学学习捷克历史。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from the Czech Republic.","zh":"捷克人；来自捷克共和国的人。"},"examples":[{"en":"Two Czechs joined our hiking group.","zh":"两位捷克人加入了我们的徒步小组。"},{"en":"He’s a Czech living in New York.","zh":"他是一位住在纽约的捷克人。"}]},{"partOfSpeech":"n.","definition":{"en":"the Slavic language spoken in the Czech Republic.","zh":"捷克语（在捷克共和国使用的斯拉夫语）。"},"examples":[{"en":"I can read a little Czech, but speaking is hard.","zh":"我能读一点捷克语，但说起来很难。"},{"en":"This app helps you practice Czech pronunciation.","zh":"这个应用可以帮助你练习捷克语发音。"}]}],"synonyms":["Bohemian (historical/region-specific)"],"phonetic":"/tʃɛk/","extraExplanation":["“Czech”在英语里通常要大写（Czech），因为它既是国籍/族群称谓，也是语言名称。","国家名称方面：Czech Republic（捷克共和国）是完整国名；Czechia（捷克）是更短的英文国名形式，近年来更常见。","发音提示：/tʃɛk/ 开头像“ch” in “check”，末尾是清晰的 /k/ 音。"]}
{"word":"Czech Republic","summary":{"en":"a Central European country; Czechia.","zh":"中欧国家；也称“捷克（Czechia）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a country in Central Europe; officially called the Czech Republic (now commonly called Czechia).","zh":"中欧国家；官方名称为“捷克共和国”（如今也常称“捷克”）。"},"examples":[{"en":"Prague is the capital of the Czech Republic.","zh":"布拉格是捷克共和国的首都。"},{"en":"She studied abroad in the Czech Republic for a semester.","zh":"她在捷克共和国留学了一个学期。"}]}],"synonyms":["Czechia"],"phonetic":"/tʃɛk rɪˈpʌblɪk/","extraExplanation":["用法提示：正式场合（外交文件、新闻标题等）常见“the Czech Republic”；更短、更口语或体育场合常用“Czechia”。两者都指同一国家。","注意冠词：一般说“the Czech Republic”（有 the），但说“Czechia”通常不加 the。"],"etymology":"“Czech”来自“捷克人/捷克语”的名称；“Republic”源自拉丁语 res publica，意为“公共事务/共和国”。该国1993年由捷克斯洛伐克和平分离后形成。近年来“Czechia”作为较短的英文国名更常见。","mnemonic":["把 Czech 看成“check”（检查）→ 去“Check”一下中欧的国家：捷克。","Republic = re-（再/回）+ public（公众）→ “公众的国家”= 共和国。"]}
{"word":"Czech-inspired","summary":{"en":"Influenced by Czech culture or style.","zh":"受捷克文化或风格影响的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having design ideas, style, or cultural elements influenced by the Czech Republic (Czech culture), especially in art, design, food, music, or architecture","zh":"受捷克（捷克文化）影响的；带有捷克风格/元素的（常用于艺术、设计、饮食、音乐或建筑）"},"examples":[{"en":"The café has a Czech-inspired menu with dumplings and mushroom soup.","zh":"这家咖啡馆有一份捷克风味的菜单，有面团饺子和蘑菇汤。"},{"en":"She wore a Czech-inspired dress with traditional embroidery patterns.","zh":"她穿了一件受捷克传统刺绣图案启发的连衣裙。"},{"en":"They designed a Czech-inspired apartment using warm wood and simple, elegant lines.","zh":"他们用温暖的木质材料和简洁优雅的线条，设计了一个带捷克风格的公寓。"}]}],"synonyms":["Czech-influenced","Czech-style","Czech-inspired design"],"phonetic":"/tʃɛk ɪnˈspaɪərd/","extraExplanation":["“Czech-inspired”常见于设计与文化语境，意思是“受捷克影响/借鉴捷克元素”，并不表示“完全捷克制造”或“原汁原味”。如果想表达更强的真实性，可以用“authentic Czech（正宗捷克的）”或“Czech-style（捷克风格的）”。","与捷克相关的灵感来源可能包括：布拉格与中欧建筑（如新艺术风格/哥特元素）、波西米亚（Bohemian）地区的玻璃与水晶工艺、传统民俗刺绣与图案，以及捷克饮食（如knedlíky面团饺子、goulash炖菜等）。"]}
{"word":"Czech-like","summary":{"en":"Czech-like means “similar to something Czech,” such as the language, culture, accent, or style.","zh":"Czech-like 表示“带有捷克特色、类似捷克的”，可指语言、文化、口音或风格等。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling the Czech language, people, culture, or typical things from the Czech Republic.","zh":"类似捷克的；具有捷克（语言/人民/文化/风格）特征的。"},"examples":[{"en":"The melody has a Czech-like folk rhythm that feels bright and danceable.","zh":"这段旋律有一种“捷克式”的民谣节奏，听起来明快又适合跳舞。"},{"en":"She spoke with a Czech-like accent, but she was actually Slovak.","zh":"她的口音听起来有点像捷克口音，但其实她是斯洛伐克人。"},{"en":"The town square has a Czech-like charm, with pastel buildings and a clock tower.","zh":"这个城镇广场有种类似捷克的迷人气质：粉彩建筑加上一座钟楼。"}]}],"synonyms":["Czech-style","Czech-inspired","Czech-sounding"],"phonetic":"/tʃɛk laɪk/","extraExplanation":["“Czech-like”是由“Czech（捷克的）+ -like（像……一样）”组成的形容词，常用来描述“风格/感觉/特征相似”，并不表示“就是捷克的”。如果要表达国籍或真正来源，更常用“Czech”（如：Czech food / Czech writer）。","用来描述人时要注意语气：说“a Czech-like accent”通常是中性描述；但如果用于刻板印象（比如把某种行为说成“很捷克”）可能让人不舒服。更礼貌的做法是具体说明你指的是语言、建筑风格、音乐风格等。"]}
{"word":"Czechia","summary":{"en":"Czechia is the short official name for the Czech Republic, a country in Central Europe.","zh":"Czechia 是 Czech Republic（捷克共和国）的英文官方简称，位于中欧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A country in Central Europe; the short official English name of the Czech Republic.","zh":"中欧国家；“Czech Republic（捷克共和国）”的英文官方简称。"},"examples":[{"en":"Prague is the capital city of Czechia.","zh":"布拉格是捷克的首都。"},{"en":"She traveled through Czechia and Austria by train.","zh":"她坐火车穿越了捷克和奥地利。"},{"en":"Czechia joined the European Union in 2004.","zh":"捷克于2004年加入欧盟。"}]}],"synonyms":["the Czech Republic"],"phonetic":"/ˈtʃɛkiə/","extraExplanation":["“Czechia”读作 /ˈtʃɛkiə/，重音在第一个音节，开头的“ch”像英语“check”里的 /tʃ/。","“Czechia”是较新的英文简称（2016年起在国际组织中更常见），但“the Czech Republic”仍然非常常用，尤其在正式场合。两者都正确；日常写作中如果想更简洁，可以用“Czechia”。","中文里通常说“捷克”；“捷克共和国”更偏正式。"]}
{"word":"Czechic","summary":{"en":"Czechic means ‘Czech’ or ‘having Czech characteristics,’ but it’s less common than Czech.","zh":"Czechic 意为“捷克的/具有捷克特色的”，但在现代英语中不如 Czech 常用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Czech Republic, the Czech people, or the Czech language; Czech in character or style.","zh":"与捷克共和国、捷克人或捷克语有关的；具有捷克特色的。"},"examples":[{"en":"She studies Czechic history and culture at university.","zh":"她在大学学习捷克的历史与文化。"},{"en":"The museum has a small collection of Czechic folk art.","zh":"这家博物馆有一小批捷克民间艺术收藏。"}]}],"synonyms":["Czech"],"phonetic":"/ˈtʃɛkɪk/","extraExplanation":["“Czechic”在现代英语中相对少见；更常见、更自然的表达通常是“Czech”（如 Czech culture / Czech language / Czech people）。如果你在学术或文学语境里看到“Czechic”，一般就是用来强调“具有捷克风格/特征”。","注意不要与“Czechoslovak”（捷克斯洛伐克的，指历史上的国家或相关人事物）混淆。"]}
{"word":"czechic","summary":{"en":"Czechic is a rare adjective meaning “related to Czech,” and it is also used in linguistics for the Czech–Slovak subgroup.","zh":"Czechic 是较少见的形容词，意为“与捷克有关”；在语言学中也可指“捷克—斯洛伐克”分支。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Czech people, the Czech language, or Czech culture (a rare word; most people say “Czech”).","zh":"与捷克人、捷克语或捷克文化有关的（较少见；更常用的是 “Czech”）。"},"examples":[{"en":"She studies Czechic culture, especially traditional music.","zh":"她研究捷克文化，尤其是传统音乐。"},{"en":"The museum has a small Czechic art collection.","zh":"这家博物馆有一小部分捷克艺术收藏。"}]},{"partOfSpeech":"adj.","definition":{"en":"In linguistics, relating to the Czech–Slovak (Czechic) subgroup of West Slavic languages.","zh":"（语言学）与西斯拉夫语族中的捷克—斯洛伐克（Czechic）支有关的。"},"examples":[{"en":"Czech and Slovak are often discussed together as Czechic languages in West Slavic studies.","zh":"在西斯拉夫语研究中，捷克语和斯洛伐克语常被一起讨论为 Czechic 语言。"}]}],"synonyms":["Czech","Czechoslovak (historical/political context)"],"phonetic":"/ˈtʃɛkɪk/","extraExplanation":["“Czechic”在日常英语里非常少见；描述国家、语言或人的时候，最自然的说法通常是“Czech”（如：Czech food / Czech language / a Czech writer）。","在语言学语境中，“Czechic”更可能出现，用来指“捷克—斯洛伐克”这一分支（与如波兰语等同属西斯拉夫语族但不同支系的语言作对比）。"]}
{"word":"Czechification","summary":{"en":"Czechification means the process or policy of making something (or someone) more Czech in language, culture, or national identity.","zh":"Czechification 指“捷克化”：使某事物（或群体）在语言、文化或民族认同上更趋向捷克的过程或政策。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of making something more Czech in language, culture, style, or identity; the adoption or imposition of Czech characteristics","zh":"（语言、文化、风格或身份的）捷克化；使某事物更具有捷克特征的过程（也可指被动地被“捷克化”）"},"examples":[{"en":"Some place names underwent Czechification after the border changes.","zh":"在边界变化之后，一些地名经历了捷克化。"},{"en":"The school’s Czechification included switching textbooks into Czech.","zh":"这所学校的捷克化包括把教材改为捷克语版本。"}]},{"partOfSpeech":"n.","definition":{"en":"(politics, history) a policy or movement aimed at assimilating people or institutions into Czech language and national identity","zh":"（政治、历史）旨在让群体或机构同化为捷克语言与民族认同的政策或运动"},"examples":[{"en":"Critics argued the new rules were a form of Czechification of public administration.","zh":"批评者认为这些新规定是一种对公共行政体系的捷克化。"},{"en":"Historical debates discuss whether certain reforms encouraged Czechification of minorities.","zh":"历史讨论常谈到某些改革是否促进了少数族群的捷克化。"}]}],"synonyms":["Czechization","assimilation","cultural assimilation","language shift"],"phonetic":"/ˌtʃɛkəfəˈkeɪʃən/","extraExplanation":["“Czechification”多用于历史与政治语境，常见于讨论中欧地区的语言政策、地名改写（把德语/匈牙利语等拼写改为捷克语形式）、教育与行政体系的语言转换等话题。","构词法：Czech + -ification（表示“使……化/……的过程”）。类似构词还有“Anglicification / Russification / Germanization”等，语气可能中性也可能带批评色彩，取决于语境是否涉及强制同化。"]}
{"word":"Czechisation","summary":{"en":"Czechisation means making something more Czech in language, culture, or identity, often used in historical or political contexts.","zh":"Czechisation 指使某事物在语言、文化或身份认同上更“捷克化”的过程/政策，常用于历史或政治语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process or policy of making something more Czech in language, culture, or identity (especially in government, schools, place names, or public life)","zh":"（尤指在政府、学校、地名或公共生活中）使某事物在语言、文化或身份认同上更“捷克化”的过程或政策"},"examples":[{"en":"Some critics argued that the reforms led to Czechisation of public administration.","zh":"一些批评者认为这些改革导致了公共行政的捷克化。"},{"en":"The Czechisation of place names was controversial in multilingual regions.","zh":"在多语地区，地名的捷克化引发了争议。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of adopting Czech styles, habits, or characteristics (by a person, group, or institution)","zh":"（个人、群体或机构）采用捷克的风格、习惯或特征的行为"},"examples":[{"en":"Over time, the community experienced gradual Czechisation in daily speech.","zh":"随着时间推移，这个社区在日常用语上逐渐发生捷克化。"},{"en":"Writers debated whether Czechisation strengthened national identity or reduced diversity.","zh":"作家们讨论捷克化是强化民族认同还是削弱多样性。"}]}],"synonyms":["Czechization","nationalization (context-dependent)","linguistic assimilation (context-dependent)","cultural assimilation (context-dependent)"],"phonetic":"/ˌtʃɛkɪˈzeɪʃən/","extraExplanation":["“Czechisation”（也常拼作 Czechization）多出现在历史与政治语境中，尤其与奥匈帝国末期及一战后“捷克斯洛伐克”时期有关，用来描述语言政策、教育体系、官僚体系或地名标准化等方面向“捷克语/捷克文化”倾斜的做法。","这个词有时带中性描述意味（强调国家整合或标准化），也可能带批评意味（强调对少数族群语言与文化空间的挤压）。具体态度通常取决于语境与作者立场。","相关变体：英式拼法更常见 -isation；美式更常见 -ization。两者意思相同。"]}
{"word":"Czechish","summary":{"en":"Czechish is an informal adjective meaning “Czech-like” or a nonstandard way some people say “Czech.”","zh":"Czechish 是非正式形容词，表示“有点捷克风/像捷克的”，也常被用作不太标准的“Czech（捷克的）”说法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) Related to the Czech Republic or Czech people; Czech-like.","zh":"（非正式）与捷克（共和国/人）有关的；有点“捷克风格/捷克味”的。"},"examples":[{"en":"The menu is Czechish, with dumplings and rich sauces.","zh":"这份菜单有点捷克风，有饺子和浓郁的酱汁。"},{"en":"His accent sounds Czechish, but I’m not sure.","zh":"他的口音听起来有点像捷克口音，但我不确定。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal, sometimes incorrect) Used when someone means “Czech” but uses a less standard form.","zh":"（非正式，有时不规范）有人想说“捷克的（Czech）”，但用了不太标准的说法。"},"examples":[{"en":"She said “Czechish,” but the correct adjective is “Czech.”","zh":"她说“Czechish”，但更标准的形容词是“Czech”。"},{"en":"Is “Czechish” a real word? People usually say “Czech.”","zh":"“Czechish”算是正式单词吗？人们通常说“Czech”。"}]}],"synonyms":["Czech-like","somewhat Czech","Czech (standard)"],"phonetic":"/ˈtʃɛkɪʃ/","extraExplanation":["“Czechish”不是最常见或最标准的用法。正式表达一般用“Czech”（捷克的/捷克人）。","后缀 -ish 常表示“有点像、带点……的感觉”（例如: greenish=有点绿）。所以 Czechish 往往是在说“带点捷克风格”，或在不确定时的模糊说法。","在谈论国籍/族群时，为了礼貌与准确，建议优先用标准形式“Czech”，避免让人感觉随意或不尊重。"]}
{"word":"czechish","summary":{"en":"Czech-ish = somewhat Czech; similar to Czech culture, language, or style (informal).","zh":"czechish（常写作 Czech-ish）= 有点捷克的；类似捷克文化、语言或风格（非正式）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) Somewhat Czech; having a few Czech features, or resembling Czech culture, language, or style.","zh":"（非正式）有点捷克的；带有一些捷克特色的；类似捷克文化、语言或风格的。"},"examples":[{"en":"The menu is Czech-ish, but it also includes a lot of German dishes.","zh":"这份菜单有点捷克风，但也包含很多德国菜。"},{"en":"His last name sounds Czech-ish to me.","zh":"他的姓氏听起来对我来说有点像捷克的。"},{"en":"They decorated the room in a Czech-ish folk style.","zh":"他们把房间装饰成一种带点捷克民俗风的风格。"}]}],"synonyms":["somewhat Czech","Czech-inspired","vaguely Czech","kind of Czech"],"phonetic":"/ˈtʃɛkɪʃ/","extraExplanation":["“Czech-ish”是把国家形容词“Czech（捷克的）”加上后缀“-ish（有点……的）”形成的口语表达，表示“不完全、只是有点像”。在正式写作中更常用“somewhat Czech / Czech-inspired / vaguely Czech”。","谈论人或身份时，用“-ish”可能让人觉得不够尊重或显得随便（例如用来评价某人“看起来很……-ish”）。如果语境严肃，建议用更中性的表达。"]}
{"word":"Czechization","summary":{"en":"Czechization means the process of making something more Czech in language, culture, or official use.","zh":"Czechization 指“捷克化”，即在语言、文化或官方使用上使某事物更具捷克特征的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of making something Czech in language, culture, identity, or administration (for example, changing names, using the Czech language, or promoting Czech customs)","zh":"“捷克化”：使某事物在语言、文化、身份或行政管理上更具“捷克特征”的过程（如改用捷克语、改地名/人名、推广捷克习俗等）"},"examples":[{"en":"The government’s policy led to the Czechization of public schools, where Czech replaced German as the main language of instruction.","zh":"政府的政策推动了公立学校的捷克化，在那里捷克语取代德语成为主要教学语言。"},{"en":"Some residents welcomed Czechization as a return to local tradition, while others felt it weakened minority rights.","zh":"一些居民把捷克化视为回归本土传统，而另一些人则认为这削弱了少数族群的权利。"}]}],"synonyms":["Bohemization","Czechification","nationalization (context-dependent)"],"phonetic":"/ˌtʃɛkɪzəˈkeɪʃən/","extraExplanation":["“Czechization”常见于历史与政治语境，尤其与中欧地区多民族共存时期有关（如奥匈帝国末期、第一次世界大战后成立的捷克斯洛伐克，以及二战前后）。它通常指制度或社会层面的“以捷克语与捷克文化为主导”的转变。","该词带有明显的价值色彩：在支持者笔下可能意味着“民族复兴/本土化”，在批评者笔下可能暗示“同化压力/对少数族群不利”。阅读史料时要留意作者立场与具体政策内容。"]}
{"word":"czechization","summary":{"en":"Czechization means making something more Czech in language, culture, or identity, often used in historical or political contexts.","zh":"Czechization指“捷克化”，即使某事物在语言、文化或身份认同上更偏向捷克，常见于历史或政治语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process or policy of making something more Czech in language, culture, identity, or administration (for example, changing place names into Czech or promoting Czech language use)","zh":"“捷克化”：使某事物在语言、文化、身份或行政管理上更偏向捷克的过程或政策（例如把地名改为捷克语形式，或推动使用捷克语）"},"examples":[{"en":"The government promoted Czechization in schools by expanding Czech-language education.","zh":"政府通过扩大捷克语教育，在学校中推动捷克化。"},{"en":"Some local residents opposed the Czechization of place names, saying it erased their history.","zh":"一些当地居民反对地名的捷克化，认为这抹去了他们的历史。"}]}],"synonyms":["Czechisation","Czechification","assimilation","nationalization"],"phonetic":"/ˌtʃɛkɪˈzeɪʃən/","extraExplanation":["“Czechization”多用于历史、政治与社会学语境，常带有“同化/国族化”的意味，语气可能中性（描述政策）也可能带批评（强调对少数族群语言与文化的压力）。","拼写上英式英语更常见Czechisation；相关表达还有Czechification（较少见）。在讨论时可用更中性的说法，如“the spread of the Czech language / Czech language policy”。"]}
{"word":"Czecho-Slovak","summary":{"en":"Czecho-Slovak means ‘related to Czechoslovakia or the Czech and Slovak peoples,’ and can also mean a person from that (former) country.","zh":"Czecho-Slovak指“与捷克斯洛伐克或捷克与斯洛伐克民族有关的”，也可指“（原）捷克斯洛伐克人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Czechoslovakia (a former country in Central Europe) or to the Czech and Slovak peoples/cultures","zh":"与捷克斯洛伐克（中欧的前国家）或捷克人与斯洛伐克人的民族、文化有关的"},"examples":[{"en":"Czecho-Slovak history in the 20th century is closely tied to both World Wars.","zh":"20世纪的捷克斯洛伐克历史与两次世界大战密切相关。"},{"en":"She is researching Czecho-Slovak literature from the interwar period.","zh":"她在研究两次世界大战之间时期的捷克斯洛伐克文学。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from Czechoslovakia (historical use) or someone of Czech and/or Slovak background","zh":"捷克斯洛伐克人（历史用法）；或具有捷克和/或斯洛伐克背景的人"},"examples":[{"en":"Many Czecho-Slovaks immigrated to the U.S. in the late 19th and early 20th centuries.","zh":"许多捷克斯洛伐克人在19世纪末到20世纪初移民到美国。"},{"en":"He grew up in a Czecho-Slovak community where people spoke Czech and Slovak at home.","zh":"他在一个捷克斯洛伐克人社区长大，人们在家里说捷克语和斯洛伐克语。"}]}],"synonyms":["Czechoslovak"],"phonetic":"/ˌtʃɛkoʊˈsloʊvæk/","extraExplanation":["“Czecho-Slovak”是较老的拼写/写法，常见于历史文献（尤其是20世纪早期），强调“捷克（Czecho-）+斯洛伐克（-Slovak）”两个民族的结合。现代英语里更常见的写法是不加连字符的“Czechoslovak”。","“Czechoslovakia（捷克斯洛伐克）”在1918年成立，1993年和平分离为“Czech Republic（捷克共和国）”和“Slovakia（斯洛伐克）”。因此在当代语境中，描述国籍时通常分别用“Czech”或“Slovak”。"]}
{"word":"Czecho-Slovakia","summary":{"en":"Czecho-Slovakia is an older/hyphenated form of “Czechoslovakia,” a former country that later became the Czech Republic and Slovakia.","zh":"Czecho-Slovakia 是“Czechoslovakia（捷克斯洛伐克）”的较旧/带连字符写法，指后来分成捷克共和国与斯洛伐克的那个已不存在的国家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former country in Central Europe (1918–1992) that later split into the Czech Republic and Slovakia","zh":"捷克斯洛伐克：中欧的一个已不存在的国家（1918—1992），后来分裂为捷克共和国与斯洛伐克"},"examples":[{"en":"My grandfather emigrated from Czecho-Slovakia in the 1930s.","zh":"我祖父在20世纪30年代从捷克斯洛伐克移民出来。"},{"en":"After 1993, Czecho-Slovakia no longer existed; it became two countries.","zh":"1993年以后，捷克斯洛伐克不复存在；它变成了两个国家。"}]}],"synonyms":["Czechoslovakia","Československo"],"phonetic":"/ˌtʃɛkoʊ sloʊˈvɑːkiə/","extraExplanation":["“Czecho-Slovakia”是较早或强调“两部分联合”的拼写方式（带连字符）；更常见的现代英文写法是不带连字符的“Czechoslovakia”。","该国在一战后于1918年成立，二战前后与冷战时期经历多次政治变动；1993年以相对和平的方式分成捷克共和国（Czech Republic）和斯洛伐克（Slovakia），常被称为“天鹅绒分离（Velvet Divorce）”。","在阅读历史、家谱或旧文件时可能会看到这个写法；若谈现代地理位置或国籍，通常直接用“Czech”或“Slovak”。"]}
{"word":"Czecho-Slovakian","summary":{"en":"Czecho-Slovakian means “of or from Czechoslovakia” (a former country), or a person from there; it’s mainly used in historical contexts.","zh":"Czecho-Slovakian 指“与捷克斯洛伐克（旧国家）有关的/来自那里的”，也可指捷克斯洛伐克人；多用于历史语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Czechoslovakia (the former country in Central Europe) or to its people, language, or culture.","zh":"与捷克斯洛伐克（中欧的旧国家）及其人民、语言或文化有关的。"},"examples":[{"en":"My grandfather collected old Czecho-Slovakian stamps from the 1930s.","zh":"我祖父收藏了20世纪30年代的旧捷克斯洛伐克邮票。"},{"en":"The museum has a section on Czecho-Slovakian history between the World Wars.","zh":"博物馆有一部分介绍两次世界大战之间的捷克斯洛伐克历史。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Czechoslovakia.","zh":"捷克斯洛伐克人。"},"examples":[{"en":"In that novel, the main character is a Czecho-Slovakian living abroad.","zh":"那本小说里，主角是一位旅居海外的捷克斯洛伐克人。"}]}],"synonyms":["Czechoslovak (more common spelling)"],"phonetic":"/ˌtʃɛkoʊsloʊˈvɑːkiən/","extraExplanation":["“Czecho-Slovakian / Czechoslovak”多用于历史语境：1918–1992年的国家“Czechoslovakia（捷克斯洛伐克）”。1993年起分为“the Czech Republic（捷克）”与“Slovakia（斯洛伐克）”。谈现代人或事物时，通常更准确地说“Czech（捷克的/捷克人）”或“Slovak（斯洛伐克的/斯洛伐克人）”。","拼写上：英语里更常见的是“Czechoslovak”（不加连字符）；“Czecho-Slovakian”带连字符较偏旧式或强调“捷克—斯洛伐克”两部分的写法。"]}
{"word":"Czechosl","summary":{"en":"Czechoslovakia was a former Central European country (1918–1992) that later became the Czech Republic and Slovakia.","zh":"Czechoslovakia 指“捷克斯洛伐克”，一个曾存在于1918—1992年的中欧国家，后来分裂为捷克共和国和斯洛伐克。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former country in Central Europe that existed from 1918 to 1992; it later separated into the Czech Republic and Slovakia","zh":"捷克斯洛伐克（中欧的前国家，存在于1918—1992年，后分裂为捷克共和国与斯洛伐克）"},"examples":[{"en":"Czechoslovakia split peacefully into the Czech Republic and Slovakia in 1993.","zh":"捷克斯洛伐克在1993年和平分裂为捷克共和国和斯洛伐克。"},{"en":"My grandfather was born in Czechoslovakia, but his hometown is now in Slovakia.","zh":"我祖父出生在捷克斯洛伐克，但他的家乡现在属于斯洛伐克。"},{"en":"In history class, we learned about Czechoslovakia during the Cold War.","zh":"在历史课上，我们学习了冷战时期的捷克斯洛伐克。"}]}],"synonyms":["the former Czechoslovak state","Czech Republic (successor state)","Slovakia (successor state)"],"phonetic":"/ˌtʃɛkoʊsloʊˈvɑːkiə/","extraExplanation":["你输入的“Czechosl”很可能是想写完整的“Czechoslovakia”。它是历史国名，现代地图上不再作为国家出现。","常见文化/历史背景：1993年的和平分裂常被称为“Velvet Divorce（天鹅绒离婚）”，对应1989年的“Velvet Revolution（天鹅绒革命）”。","形容词形式常见为“Czechoslovak（捷克斯洛伐克的）”，如：Czechoslovak history（捷克斯洛伐克历史）。"]}
{"word":"Czechoslovak","summary":{"en":"Czechoslovak refers to the people, culture, or (historically) language of former Czechoslovakia.","zh":"Czechoslovak 指与旧捷克斯洛伐克的人民、文化（以及历史上所说的语言）有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from (or connected to) former Czechoslovakia; also, the language once associated with that country (now more commonly referred to as Czech or Slovak).","zh":"（与）旧捷克斯洛伐克有关的人；也可指曾与该国相关的语言（现在更常说“捷克语”或“斯洛伐克语”）。"},"examples":[{"en":"Her grandparents were Czechoslovak and later became citizens of the Czech Republic.","zh":"她的祖父母来自旧捷克斯洛伐克，后来成为捷克共和国公民。"},{"en":"Many Czechoslovak writers were influential in Central European literature.","zh":"许多捷克斯洛伐克作家在中欧文学中很有影响力。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to former Czechoslovakia, its people, or its culture.","zh":"与旧捷克斯洛伐克及其人民或文化有关的。"},"examples":[{"en":"He studies Czechoslovak history, especially the period before 1993.","zh":"他研究捷克斯洛伐克历史，尤其是1993年之前的时期。"},{"en":"The museum has a Czechoslovak film collection from the 1960s.","zh":"这家博物馆收藏了许多20世纪60年代的捷克斯洛伐克电影。"}]}],"synonyms":["Czech","Slovak"],"phonetic":"/ˌtʃɛkoʊˈsloʊvæk/","extraExplanation":["“Czechoslovak”主要用于指1918—1992年的国家“Czechoslovakia（捷克斯洛伐克）”。1993年该国和平分裂为“Czech Republic（捷克共和国）”和“Slovakia（斯洛伐克）”，也被称为“Velvet Divorce（天鹅绒分离）”。因此在当代语境中，描述个人国籍或语言时更常用“Czech/Slovak”或“Czech language/Slovak language”。","在文化语境里仍常见“Czechoslovak New Wave（捷克斯洛伐克新浪潮电影）”等固定说法，尤其指20世纪60年代的重要电影运动。"]}
{"word":"Czechoslovakia","summary":{"en":"Czechoslovakia was a Central European country (1918–1992) that later split into the Czech Republic and Slovakia; the word is also used historically to describe things related to that former state.","zh":"Czechoslovakia（捷克斯洛伐克）是一个曾存在于1918–1992年的中欧国家，后分裂为捷克共和国和斯洛伐克；该词也可历史性地用作形容词，指与该前国家有关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A former country in Central Europe that existed from 1918 to 1992; it later peacefully split into two independent countries: the Czech Republic and Slovakia (often called the “Velvet Divorce”).","zh":"中欧的一个已不存在的国家，存在于1918年至1992年；后来和平分裂为两个独立国家：捷克共和国和斯洛伐克（常被称为“天鹅绒分离”）。"},"examples":[{"en":"Czechoslovakia was formed after World War I in 1918.","zh":"捷克斯洛伐克于1918年第一次世界大战后成立。"},{"en":"After 1993, Czechoslovakia no longer existed; the Czech Republic and Slovakia became separate countries.","zh":"1993年以后，捷克斯洛伐克不复存在；捷克共和国和斯洛伐克成为两个独立国家。"},{"en":"My grandmother grew up in what was then Czechoslovakia.","zh":"我祖母成长在当时的捷克斯洛伐克。"}]},{"partOfSpeech":"adj.","definition":{"en":"A way to refer to people, culture, language varieties, or products connected with the former state (often used historically).","zh":"指与该前国家有关的人、文化、语言变体或产品（多用于历史语境）。"},"examples":[{"en":"He collects Czechoslovakian stamps from the 1930s.","zh":"他收藏20世纪30年代的捷克斯洛伐克邮票。"},{"en":"The museum has a section on Czechoslovakian history and art.","zh":"博物馆有一个关于捷克斯洛伐克历史与艺术的展区。"}]}],"synonyms":["the former Czechoslovak state","Czechoslovak Republic (historical)"],"phonetic":"/ˌtʃɛkoʊsloʊˈvɑːkiə/","extraExplanation":["“Czechoslovakia”由“Czech（捷克）”和“Slovakia（斯洛伐克）”组合而来，中文常译作“捷克斯洛伐克”。","历史文化常识：1968年的“布拉格之春（Prague Spring）”与1989年的“天鹅绒革命（Velvet Revolution）”常在英语历史课本与新闻资料中出现，均与当时的捷克斯洛伐克相关。","用法提醒：现代语境中谈到当今国家时，通常应说“the Czech Republic / Czechia”和“Slovakia”，除非你明确在谈历史时期。"]}
{"word":"Czechoslovakian","summary":{"en":"Czechoslovakian means “of/from Czechoslovakia” (historical) or a person from that former country.","zh":"Czechoslovakian 表示“与/来自捷克斯洛伐克（历史上的国家）有关”，也可指“捷克斯洛伐克人（历史用法）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Czechoslovakia (a former country in Central Europe) or its people, culture, or language.","zh":"与捷克斯洛伐克（中欧的一个前国家）或其人民、文化、语言有关的。"},"examples":[{"en":"She collects Czechoslovakian posters from the 1960s.","zh":"她收藏20世纪60年代的捷克斯洛伐克海报。"},{"en":"The museum has a small Czechoslovakian section about daily life before 1989.","zh":"博物馆里有一个小型捷克斯洛伐克展区，介绍1989年以前的日常生活。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Czechoslovakia (historical).","zh":"捷克斯洛伐克人（历史用法）。"},"examples":[{"en":"In the novel, the main character is a Czechoslovakian living abroad.","zh":"在这部小说里，主角是一位旅居海外的捷克斯洛伐克人。"}]}],"synonyms":["Czechoslovak","Czech (modern, for Czech Republic)","Slovak (modern, for Slovakia)"],"phonetic":"/ˌtʃɛkoʊsloʊˈvɑːkiən/","extraExplanation":["“Czechoslovakian”指的是1993年之前的国家“Czechoslovakia（捷克斯洛伐克）”。1993年该国和平分裂为“Czech Republic（捷克）”与“Slovakia（斯洛伐克）”，所以谈到当代的人或事通常说“Czech / Slovak”。","在英语里，“Czechoslovak”更常见也更中性；“Czechoslovakian”也能用，但有时显得更旧式或不那么常用。","文化语境中常见的相关词：Prague Spring（布拉格之春，1968）、Velvet Revolution（天鹅绒革命，1989）、Velvet Divorce（天鹅绒分离，1993，指和平分裂）。"]}
{"word":"czechoslovakian","summary":{"en":"Czechoslovakian refers to Czechoslovakia (a former country) or a person from there; today it’s mainly used in historical contexts.","zh":"Czechoslovakian 指与“捷克斯洛伐克”（已解体的旧国家）有关或来自那里的人；如今主要用于历史语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Czechoslovakia (a former country in Central Europe that later became the Czech Republic and Slovakia).","zh":"捷克斯洛伐克人（来自“捷克斯洛伐克”的人；该国已解体，分为捷克共和国与斯洛伐克）。"},"examples":[{"en":"My grandmother was Czechoslovakian, and she spoke Czech at home.","zh":"我奶奶是捷克斯洛伐克人，她在家里说捷克语。"},{"en":"He has Czechoslovakian roots, but his family now lives in Canada.","zh":"他有捷克斯洛伐克血统，但他家现在住在加拿大。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Czechoslovakia, or to the people and culture of that former country.","zh":"与捷克斯洛伐克（旧国）有关的；与其人民或文化有关的。"},"examples":[{"en":"They collected Czechoslovakian stamps from the 1960s.","zh":"他们收藏了20世纪60年代的捷克斯洛伐克邮票。"},{"en":"Czechoslovakian history is often taught together with Czech and Slovak history.","zh":"捷克斯洛伐克历史常与捷克和斯洛伐克历史一起讲授。"}]}],"synonyms":["Czechoslovak"],"phonetic":"/ˌtʃɛkoʊˌsloʊˈvɑːkiən/","extraExplanation":["“Czechoslovakian”现在多用于历史语境（如旧护照、邮票、电影、体育记录等），因为捷克斯洛伐克已于1993年和平分裂为“Czech Republic（捷克共和国）”和“Slovakia（斯洛伐克）”，常称“Velvet Divorce（天鹅绒分离）”。","在现代日常表达中，如果你指当代国籍或身份，通常更准确说“Czech（捷克人/捷克的）”或“Slovak（斯洛伐克人/斯洛伐克的）”。"]}
{"word":"czechoslovakians","summary":{"en":"Czechoslovakians = people from Czechoslovakia (1918–1992).","zh":"Czechoslovakians 指“捷克斯洛伐克人”，即来自1918–1992年存在的捷克斯洛伐克的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people from Czechoslovakia (a country in Central Europe that existed from 1918 to 1992)","zh":"捷克斯洛伐克人；来自捷克斯洛伐克（1918–1992年存在于中欧的国家）的人"},"examples":[{"en":"Many Czechoslovakians immigrated to the United States in the 20th century.","zh":"20世纪有许多捷克斯洛伐克人移民到美国。"},{"en":"Her grandparents were Czechoslovakians who later became citizens of the Czech Republic.","zh":"她的祖父母原本是捷克斯洛伐克人，后来成为捷克共和国公民。"}]}],"synonyms":["Czechoslovaks"],"phonetic":"/ˌtʃɛkoʊsloʊˈvɑkiənz/","extraExplanation":["“Czechoslovakians”是复数形式；单数是“a Czechoslovakian”（也常见写法“Czechoslovak”作名词/形容词）。","由于捷克斯洛伐克在1993年和平分裂为“Czech Republic（捷克共和国）”和“Slovakia（斯洛伐克）”，今天更常用的称呼是“Czechs（捷克人）”和“Slovaks（斯洛伐克人）”。在谈历史（如两次世界大战、冷战时期）时才更常用“Czechoslovakian(s)”。","在一些语境里，用“Czechoslovak”更地道、更简洁；“Czechoslovakian”也正确，但相对更长、更少见。"]}
{"word":"Czechoslovaks","summary":{"en":"Czechoslovaks = people from the former country of Czechoslovakia (Czech and Slovak people together).","zh":"Czechoslovaks 指来自旧国家“捷克斯洛伐克”的人，常概括捷克人与斯洛伐克人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people from Czechoslovakia (a former country in Central Europe); especially the Czech and Slovak peoples considered together","zh":"捷克斯洛伐克人（中欧已不存在的国家“捷克斯洛伐克”的国民）；尤指把捷克人与斯洛伐克人合称的一群人"},"examples":[{"en":"Many Czechoslovaks left the country during the Cold War.","zh":"冷战期间，许多捷克斯洛伐克人离开了这个国家。"},{"en":"After 1993, some older Czechoslovaks still used the old name out of habit.","zh":"1993年之后，一些年纪较大的捷克斯洛伐克人仍因习惯而使用旧国名。"}]}],"synonyms":["Czechoslovak people","Czechs and Slovaks"],"phonetic":"ˌtʃɛkoʊˈsloʊvɑks","extraExplanation":["“Czechoslovaks”是复数形式；单数是“a Czechoslovak”。形容词也常用“Czechoslovak”，如“Czechoslovak history（捷克斯洛伐克历史）”。","捷克斯洛伐克（Czechoslovakia）在1993年和平分裂为捷克共和国（Czech Republic / Czechia）与斯洛伐克（Slovakia）。因此在现代语境中，谈到现今国籍时更常用“Czechs（捷克人）”和“Slovaks（斯洛伐克人）”。"]}
{"word":"czechoslovaks","summary":{"en":"“Czechoslovaks” means people from the former country of Czechoslovakia, often used in historical contexts.","zh":"“Czechoslovaks”指曾经的国家“捷克斯洛伐克”的国民，多用于历史语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people from Czechoslovakia (a former country in Central Europe), or people of Czech or Slovak origin—especially in historical contexts before 1993","zh":"捷克斯洛伐克人（中欧曾经的国家“捷克斯洛伐克”的国民），或指捷克/斯洛伐克血统的人——多用于1993年之前的历史语境"},"examples":[{"en":"After World War II, many Czechoslovaks rebuilt their cities and industries.","zh":"二战后，许多捷克斯洛伐克人重建了他们的城市和工业。"},{"en":"The museum has letters written by Czechoslovaks who immigrated to the United States.","zh":"这座博物馆收藏了捷克斯洛伐克移民写给美国亲友的信件。"},{"en":"In older books, you may see “Czechoslovaks” used as one group, even though there are both Czechs and Slovaks.","zh":"在较旧的书里，你可能会看到把“捷克斯洛伐克人”当作一个整体来写，尽管其中既有捷克人也有斯洛伐克人。"}]}],"synonyms":["Czechs and Slovaks (modern, more specific)","people of Czechoslovakia"],"phonetic":"/ˌtʃɛkoʊˈsloʊvɑks/","extraExplanation":["“Czechoslovaks”通常出现在历史与政治语境中：1918年第一次世界大战后成立“捷克斯洛伐克”，1993年和平分离为“捷克共和国（Czech Republic）”与“斯洛伐克（Slovakia）”。因此，现代语境里更常分别说“Czechs”和“Slovaks”。","拼写提示：单数是“Czechoslovak”，复数是“Czechoslovaks”。"]}
{"word":"czechs","summary":{"en":"“Czechs” means Czech people (plural); it can also be used informally to mean “Czech” as an adjective.","zh":"“Czechs”指“捷克人”（复数）；也可（较少见）用于表示“捷克的”相关事物，但形容词更常写作“Czech”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People from the Czech Republic; the Czech people (plural of “Czech”).","zh":"捷克人；捷克人民（“Czech”的复数）"},"examples":[{"en":"Many Czechs speak English, especially in larger cities like Prague.","zh":"许多捷克人会说英语，尤其是在布拉格等大城市。"},{"en":"The Czechs are known for traditions like puppetry, classical music, and strong beer culture.","zh":"捷克人以木偶戏、古典音乐以及浓厚的啤酒文化等传统而闻名。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the Czech Republic, its people, or the Czech language (often written as “Czech” as an adjective).","zh":"与捷克共和国、捷克人民或捷克语有关的（作形容词时通常写作“Czech”）"},"examples":[{"en":"We tried Czech food, including dumplings and roast pork.","zh":"我们尝了捷克菜，包括饺子（面团团子）和烤猪肉。"},{"en":"She is studying Czech history in college.","zh":"她在大学学习捷克历史。"}]}],"synonyms":["Czech people","people of the Czech Republic"],"phonetic":"/tʃɛks/","extraExplanation":["“Czechs”通常要大写，因为它是国籍/族群称呼（demonym）。单数是“a Czech”。","国家名称常见两种：正式的“the Czech Republic”（捷克共和国）与较短的“Czechia”（捷克）。在日常口语里两者都能见到。","名词“Czech”也可指“捷克语”（例如：I’m learning Czech. 我在学捷克语）。"]}
{"word":"Czerniak","summary":{"en":"“Czerniak” is a Polish word meaning melanoma, and it is also used as a Polish surname.","zh":"“Czerniak”在波兰语中指黑色素瘤，也可作为波兰姓氏使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Polish, “czerniak” means melanoma (a serious type of skin cancer).","zh":"在波兰语中，“czerniak”指“黑色素瘤”（一种严重的皮肤癌）。"},"examples":[{"en":"In Polish medical texts, “czerniak” refers to melanoma.","zh":"在波兰语医学资料中，“czerniak”用来指黑色素瘤。"},{"en":"The doctor warned about “czerniak” and the need for early detection.","zh":"医生提醒要警惕“czerniak（黑色素瘤）”，并强调早期发现的重要性。"}]},{"partOfSpeech":"n.","definition":{"en":"A Polish surname (family name).","zh":"一个波兰姓氏（家族姓）。"},"examples":[{"en":"Czerniak is a common surname in Poland.","zh":"Czerniak是波兰较常见的姓氏之一。"},{"en":"Her last name is Czerniak, so people sometimes ask about its origin.","zh":"她的姓是Czerniak，所以人们有时会问这个姓的来源。"}]}],"synonyms":["melanoma (English equivalent, medical meaning)"],"phonetic":"/ˈtʃɛrniæk/","extraExplanation":["“Czerniak”来自波兰语词根“czarn-”（与“黑色/黑的”有关），因此在医学语境里用来指“黑色素瘤”（与色素、黑色外观相关）。","在英语里“Czerniak”通常不会当作普通词使用，更常见的是作为人名（姓氏）出现；如果你在英文文章里看到它，常需要根据上下文判断是在谈医学术语（波兰语）还是在指某个人。"]}
{"word":"Czerniakov","summary":{"en":"Czerniakov usually refers to Adam Czerniaków, chairman of the Jewish Council in the Warsaw Ghetto during WWII, known for his diary and his 1942 death amid deportation orders.","zh":"Czerniakov通常指亚当·切尔尼亚库夫：二战期间华沙犹太区犹太委员会主席，以日记闻名，并在1942年遣送命令压力下自尽。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Adam Czerniaków (1880–1942), a Polish-Jewish engineer and public official who served as chairman of the Jewish Council (Judenrat) in the Warsaw Ghetto under Nazi occupation; he is widely remembered for his diary and for taking his own life in 1942 when ordered to cooperate with the deportation of Jewish children.","zh":"亚当·切尔尼亚库夫（1880–1942），波兰犹太裔工程师与公职人员；纳粹占领期间担任华沙犹太区“犹太委员会”（Judenrat）主席。人们常因其日记以及在被迫配合遣送犹太儿童时于1942年自尽而记住他。"},"examples":[{"en":"Czerniaków’s diary is often used as a firsthand source on daily life and impossible moral choices in the Warsaw Ghetto.","zh":"切尔尼亚库夫的日记常被用作研究华沙犹太区日常生活与艰难道德抉择的第一手资料。"},{"en":"In many history classes, Czerniaków is discussed when talking about the Judenräte and the pressures they faced.","zh":"在不少历史课上，谈到犹太委员会及其所承受的压力时会提到切尔尼亚库夫。"}]}],"synonyms":["Adam Czerniaków"],"phonetic":"/tʃɛr.niˈa.kɔf/","extraExplanation":["“Czerniaków”是波兰姓氏；英语里常见写法为Czerniakow（省略变音符号）。他的名字也常以“Adam Czerniaków”完整出现。","语境提示：在英文资料中，他常与“Warsaw Ghetto（华沙犹太区）”“Judenrat/Judenräte（犹太委员会/委员会体系）”“deportations（遣送）”等词一起出现。","文学/史料提及：其日记常以书名形式出现，如《The Diary of Adam Czerniakow》（不同版本标题略有差异），属于重要的历史见证文本。"]}
{"word":"Czernowitz","summary":{"en":"Czernowitz is the historical name (often German) for today’s Chernivtsi, a city in western Ukraine.","zh":"Czernowitz是乌克兰西部城市切尔诺夫策（Chernivtsi）的历史名称（常见于德语/历史语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A historical name for the city now called Chernivtsi, in western Ukraine. The name “Czernowitz” is often used in historical or literary contexts, especially when discussing the Austro-Hungarian period.","zh":"乌克兰西部城市“切尔诺夫策（Chernivtsi）”的历史称呼。“Czernowitz”常用于历史或文学语境，尤其是在讨论奥匈帝国时期时。"},"examples":[{"en":"My grandmother’s letters mention Czernowitz, which is now known as Chernivtsi in Ukraine.","zh":"我祖母的信里提到Czernowitz，这座城市如今在乌克兰叫Chernivtsi（切尔诺夫策）。"},{"en":"The novel is set in Czernowitz during the Austro-Hungarian Empire.","zh":"这部小说以奥匈帝国时期的Czernowitz为背景。"},{"en":"Many maps from the early 1900s label the city as Czernowitz.","zh":"许多20世纪初的地图把这座城市标为Czernowitz。"}]}],"synonyms":["Chernivtsi","Cernăuți"],"phonetic":"/ˈzɛr.nə.vɪts/","extraExplanation":["“Czernowitz”是德语/历史拼写，在不同年代与政权下，这座城市也常见其他名称：德语Czernowitz、罗马尼亚语Cernăuți、乌克兰语Chernivtsi（切尔诺夫策）。因此在阅读历史资料时，看到不同写法通常指同一地点。","这座城市以多语言、多族群文化著称，历史上曾有重要的犹太社群与德语文化传统；诗人保罗·策兰（Paul Celan）就出生在这里。在文学与回忆录中使用“Czernowitz”，往往带有特定时代氛围与文化记忆。"]}
{"word":"Czerny","summary":{"en":"Czerny usually refers to Carl Czerny or to his widely used piano studies.","zh":"Czerny通常指卡尔·车尔尼本人，或泛指他广泛使用的钢琴练习曲/教材。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) Carl Czerny (1791–1857), an Austrian pianist, teacher, and composer, especially known for piano studies (études) used in classical training.","zh":"（专有名词）卡尔·车尔尼（1791–1857），奥地利钢琴家、教师与作曲家，尤以用于古典钢琴训练的练习曲（练习教材）闻名。"},"examples":[{"en":"My teacher assigned a Czerny study to improve my finger independence.","zh":"老师布置了一首车尔尼练习曲来提高我的手指独立性。"},{"en":"Many beginners start with Czerny before moving on to Chopin études.","zh":"很多初学者会先练车尔尼，再进阶到肖邦练习曲。"}]},{"partOfSpeech":"n.","definition":{"en":"(Common usage) A piano exercise book or study by Czerny (often said as “a Czerny”).","zh":"（常见用法）指车尔尼的某本钢琴练习教材或其中的练习曲（常说“a Czerny”）。"},"examples":[{"en":"I’m practicing a Czerny every day for ten minutes.","zh":"我每天练十分钟车尔尼练习。"},{"en":"She brought her Czerny to the lesson.","zh":"她上课带了车尔尼练习教材。"}]}],"synonyms":["Carl Czerny","Czerny études","piano studies"],"phonetic":"/ˈtsɛrni/","extraExplanation":["“Czerny”常在钢琴学习语境中出现，尤其是《作品599》《作品849》《作品299》等编号练习，被用来训练手指灵活性、音阶/琶音、连奏与断奏等基本功。","车尔尼也是贝多芬的学生之一，并曾教过李斯特（Franz Liszt）。因此他在音乐史上常被视为连接古典与浪漫钢琴传统的重要人物。"]}
{"word":"Czestochowa","summary":{"en":"Czestochowa is a city in southern Poland, famous as a major Catholic pilgrimage destination (Jasna Góra and the Black Madonna).","zh":"琴斯托霍瓦是波兰南部城市，以重要的天主教朝圣地闻名（雅斯纳古拉修道院与“黑圣母”圣像）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in southern Poland, known internationally as an important Catholic pilgrimage site because it is home to the Jasna Góra Monastery and the icon of the Black Madonna.","zh":"波兰南部的一座城市，以天主教朝圣地闻名；这里有雅斯纳古拉修道院（Jasna Góra Monastery）和“黑圣母”（Black Madonna）圣像。"},"examples":[{"en":"Millions of pilgrims travel to Czestochowa each year.","zh":"每年有数以百万计的朝圣者前往琴斯托霍瓦。"},{"en":"Our tour of Czestochowa included a visit to the Jasna Góra Monastery.","zh":"我们在琴斯托霍瓦的行程包括参观雅斯纳古拉修道院。"}]}],"synonyms":["Częstochowa (Polish spelling)"],"phonetic":"/ˌtʃɛstəˈkoʊvə/","extraExplanation":["“Czestochowa”是波兰语地名；在英语里常见的拼写是不加波兰语符号的 Czestochowa（波兰语原拼写为 Częstochowa）。英语发音差异较多，你可能也会听到接近“ches-toh-KOH-vuh / -vah”的读法。","这座城市在欧洲宗教与历史文化中影响很大，尤其与雅斯纳古拉修道院及“黑圣母”圣像相关；在波兰文化语境里，它常被当作“信仰与民族认同”的象征之一。"]}
{"word":"czigany","summary":{"en":"Czigany is a Hungarian-derived word meaning a Romani person (“Gypsy”), and it can also be an adjective or a surname; it’s mostly seen in historical or name/title contexts.","zh":"Czigany源自匈牙利语，指罗姆人（“吉普赛人”），也可作形容词或姓氏；多见于历史语境或人名/标题中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Hungarian) a Romani person; “Gypsy” (often felt as old-fashioned or potentially offensive in English—use with care).","zh":"（源自匈牙利语）罗姆人；“吉普赛人”（在英语里常被视为过时或可能带冒犯意味，用词需谨慎）。"},"examples":[{"en":"In some older translations, “czigany” is used to mean a Romani person.","zh":"在一些较旧的译本里，“czigany”用来表示罗姆人。"},{"en":"Many writers today prefer “Roma” or “Romani” instead of terms like “czigany.”","zh":"如今许多写作者更倾向用“Roma/ Romani”，而不是“czigany”等称呼。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Roma/Romani people (rare in modern English; usually seen in titles, names, or historical contexts).","zh":"与罗姆人/罗姆文化有关的（现代英语中较少见，多出现在书名、作品名或历史语境）。"},"examples":[{"en":"The program included a czigany folk melody.","zh":"节目里包含了一段罗姆民谣旋律。"}]},{"partOfSpeech":"n.","definition":{"en":"a Hungarian surname (a family name).","zh":"匈牙利姓氏（人名）。"},"examples":[{"en":"Czigany is also used as a last name in Hungary.","zh":"Czigany在匈牙利也用作姓氏。"}]}],"synonyms":["Roma","Romani","Romany","Gypsy (use with care)"],"phonetic":"/ˈtsiːɡɑːn/","extraExplanation":["“czigany”常见于匈牙利语拼写（现代更常写作“cigány”）。其中“cz”是较旧的匈牙利拼写习惯，对应的发音接近英语里“ts-”。","在英语语境中，涉及族群称呼时更推荐使用“Roma / Romani（罗姆人/罗姆语族）”。“Gypsy/吉普赛”在一些场合可能被认为带刻板印象或冒犯意味；如果是作品标题、历史引用或自称语境，需要结合具体语境判断。"]}
{"word":"CZK","summary":{"en":"CZK is the currency code for the Czech koruna (Czech Republic).","zh":"CZK 是捷克共和国官方货币“捷克克朗”的货币代码。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"The ISO 4217 currency code for the Czech koruna, the official currency of the Czech Republic.","zh":"捷克克朗（Czech koruna）的国际标准货币代码（ISO 4217），为捷克共和国的官方货币。"},"examples":[{"en":"The hotel costs 2,500 CZK per night.","zh":"这家酒店每晚价格是 2,500 捷克克朗（CZK）。"},{"en":"You can exchange euros to CZK at the airport.","zh":"你可以在机场把欧元兑换成捷克克朗（CZK）。"},{"en":"The price is listed in CZK, not in EUR.","zh":"这个价格标的是 CZK，不是 EUR。"}]}],"synonyms":["Czech koruna","koruna","Kč"],"phonetic":"/si zi keɪ/","extraExplanation":["“CZK”是国际通用的三位货币代码（ISO 4217），常见于银行、换汇、机票酒店预订、外汇报价等场景。","捷克克朗在捷克语中叫“koruna česká”，常见货币符号为“Kč”。日常写法可能出现“100 Kč”或“100 CZK”。","口语读法通常按字母读：C-Z-K。写作中它一般全大写，且不加复数形式（不写成“CZKs”）。"]}
{"word":"Czstochowa","summary":{"en":"Częstochowa is a city in southern Poland, famous for the Jasna Góra Monastery and the Black Madonna pilgrimage site.","zh":"琴斯托霍瓦是波兰南部城市，以雅斯纳古拉修道院和“黑色圣母”朝圣地闻名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A city in southern Poland, best known for the Jasna Góra Monastery and the revered icon of the Black Madonna, making it a major Catholic pilgrimage destination.","zh":"波兰南部城市，以“雅斯纳古拉修道院（Jasna Góra）”及受崇敬的“黑色圣母”圣像闻名，是重要的天主教朝圣地。"},"examples":[{"en":"Many pilgrims travel to Częstochowa each year to visit Jasna Góra.","zh":"每年都有许多朝圣者前往琴斯托霍瓦参观雅斯纳古拉修道院。"},{"en":"Częstochowa is located in the Silesian Voivodeship in southern Poland.","zh":"琴斯托霍瓦位于波兰南部的西里西亚省。"}]}],"synonyms":["Czestochowa","Częstochowa (Jasna Góra)"],"phonetic":"/ˌtʃɛnstoʊˈkoʊvə/","extraExplanation":["拼写提示：你写的“Czstochowa”通常是省略了波兰语变音符号后的写法；标准拼写为“Częstochowa”（ę 发鼻化元音）。英语里也常见不带符号的 “Czestochowa”。","文化背景：这里的雅斯纳古拉修道院（Jasna Góra）收藏“黑色圣母（Black Madonna）”圣像，在波兰历史与民族认同中具有象征意义，因此城市常与朝圣、宗教节庆和大型集会联系在一起。","发音说明：英语使用者常用近似读法；更接近波兰语时，“Częst-”起首的辅音群较紧凑，且“cz”类似英语 “ch”。"]}
{"word":"Czur","summary":{"en":"“Czur” is usually a Polish-origin surname used as a proper name.","zh":"“Czur”通常是一个波兰语背景的姓氏，用作专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A surname (family name), most commonly of Polish origin.","zh":"一个姓氏（家族姓），常见于波兰语背景。"},"examples":[{"en":"Professor Czur published a paper on computer security.","zh":"Czur 教授发表了一篇关于计算机安全的论文。"},{"en":"I met someone named Czur at the conference.","zh":"我在会议上认识了一个姓 Czur 的人。"}]},{"partOfSpeech":"other","definition":{"en":"A given name or place name in some contexts, but this is uncommon; it is usually a surname.","zh":"在少数语境中也可能作为名字或地名出现，但并不常见；通常还是姓氏。"},"examples":[{"en":"Czur appears as a family name in several records.","zh":"在一些记录中，Czur 以姓氏形式出现。"}]}],"synonyms":["(no true synonyms; it is a proper name)"],"phonetic":"/tʃʊr/","extraExplanation":["“Cz-”是波兰语中很常见的拼写组合，发音往往不像英语里的 /k/ 或 /s/。很多波兰姓氏进入英语语境后，实际读音会因家族习惯或英语化而变化。","如果你是在特定文章、游戏、小说或人名名单里看到“Czur”，可以告诉我上下文（句子/来源），我可以更准确地判断它指的是人名、地名还是专有名词。"]}

