{"word":"D","summary":{"en":"D is the fourth letter of the alphabet; it can also mean a low passing grade or the musical note D.","zh":"D是英语字母表第四个字母；也可表示较低但可能及格的成绩等级，或音乐中的D音。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the fourth letter of the English alphabet","zh":"英语字母表中的第四个字母"},"examples":[{"en":"“D” comes after “C” and before “E.”","zh":"“D”在“C”之后、在“E”之前。"},{"en":"Write your name in capital letters, starting with D.","zh":"用大写字母写你的名字，以D开头。"}]},{"partOfSpeech":"n.","definition":{"en":"a grade that is low but still a passing grade in some schools","zh":"（一些学校里）较低但仍可能算及格的成绩等级：D"},"examples":[{"en":"He got a D on the math test.","zh":"他数学考试得了D。"},{"en":"A D is not great, but it may still be a passing grade.","zh":"D不算好，但可能仍然算及格。"}]},{"partOfSpeech":"n.","definition":{"en":"the musical note D","zh":"（音乐）D音；Re（固定唱名）"},"examples":[{"en":"Play a D on the piano.","zh":"在钢琴上弹一个D音。"},{"en":"This song starts on D.","zh":"这首歌从D音开始。"}]}],"synonyms":["dee"],"phonetic":"/diː/","extraExplanation":["字母D常用来表示事物的序号或等级（如“Plan D / Option D”表示第四个方案）。","在口语里，字母D通常读作 /diː/，有时为强调会说成“capital D（大写D） / lowercase d（小写d）”。"]}
{"word":"d","summary":{"en":"D (or d) is the 4th letter of the English alphabet and can also mean a school grade, a musical note, a common abbreviation, or the Roman numeral for 500.","zh":"D（或d）是英语字母表的第4个字母，也可表示成绩等级、音乐音名、常见缩写，或罗马数字500。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the 4th letter of the English alphabet","zh":"英文字母表中的第4个字母（D/d）"},"examples":[{"en":"“D” comes after “C” and before “E.”","zh":"“D”在“C”后面，在“E”前面。"},{"en":"Write your name in capital letters, then write a small “d.”","zh":"先用大写字母写你的名字，然后写一个小写“d”。"}]},{"partOfSpeech":"n.","definition":{"en":"a grade that is low and usually just above failing in many schools","zh":"（成绩）D等：较低的及格边缘分数（通常高于不及格）"},"examples":[{"en":"He got a D on the math test.","zh":"他的数学考试得了D。"},{"en":"A D may be passing, but it usually means you need to improve.","zh":"D可能算及格，但通常意味着你需要提高。"}]},{"partOfSpeech":"n.","definition":{"en":"the musical note ‘D’ (a pitch name in Western music)","zh":"（音乐）D音：西方音乐中的音名“D”"},"examples":[{"en":"This song starts on D.","zh":"这首歌从D音开始。"},{"en":"Try playing a D major chord.","zh":"试着弹一个D大和弦。"}]},{"partOfSpeech":"n.","definition":{"en":"an abbreviation used in many fields (for example: ‘D’ = ‘day’ in some schedules; ‘D’ can also refer to ‘diameter’ in technical contexts)","zh":"缩写：在不同领域代表不同含义（如某些日程表里表示“天”；技术语境中可表示“直径”等）"},"examples":[{"en":"Delivery: 3–5 D (meaning 3–5 days) on some shipping notes.","zh":"某些物流备注里：3–5 D（表示3到5天）。"},{"en":"In engineering notes, D can mean diameter.","zh":"在工程笔记里，D可以表示直径。"}]},{"partOfSpeech":"n.","definition":{"en":"the Roman numeral for 500 (written as ‘D’)","zh":"罗马数字“D”，表示500"},"examples":[{"en":"In Roman numerals, D = 500.","zh":"在罗马数字中，D=500。"}]}],"synonyms":["dee","D","d"],"phonetic":"/diː/","extraExplanation":["“D/d”本身常读作 /diː/（像单词“dee”）。在实际阅读中，大写D和小写d可能代表不同含义，需看上下文（如成绩、音乐、技术符号、缩写等）。","在医学、法律、学术或网络文本里，“D”也可能是某个专有名词或术语的缩写（例如维生素D：vitamin D）。遇到不确定的缩写，最可靠的方法是查看该文本的说明或同一段落中的首次全称。"]}
{"word":"D'Aeth","summary":{"en":"D'Aeth is a surname, often used (especially in fiction) with a pronunciation like “death.”","zh":"D'Aeth 是一个姓氏，常见于（尤其是虚构作品中）并常被读作与“death（死亡）”同音。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname), sometimes used in fiction; often pronounced like “death.”","zh":"一个姓氏（家族姓），有时也用于小说或影视作品中；常被读作与“death（死亡）”同音。"},"examples":[{"en":"Dr. D'Aeth will see you now.","zh":"D'Aeth 医生现在会见你。"},{"en":"In the novel, the villain’s name is D'Aeth, hinting at danger.","zh":"在小说里，反派名叫 D'Aeth，暗示着危险。"}]}],"phonetic":"/dɛθ/","extraExplanation":["D'Aeth 这种拼写看起来像法语姓氏里常见的 D'（相当于“de/来自……”的缩写），但在英语语境中常被作者当作文字游戏：写作 D'Aeth、读起来像 death，用来营造阴森或不祥的感觉。","如果你是在特定作品、人物或家族谱系里看到 D'Aeth，它的实际读音也可能因地区或个人而不同；最稳妥的方式是参考该作品的官方发音或当事人自述。"]}
{"word":"D'Amboise","summary":{"en":"D’Amboise is a French name meaning “from Amboise,” used as a surname and as an origin-marking noble-style form.","zh":"D’Amboise 是一个法语姓名形式，意为“来自昂布瓦兹”，常作姓氏，也可表示与昂布瓦兹的出身或关联。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A French surname (and noble-style name) meaning “from Amboise,” used by several notable historical figures.","zh":"一个法语姓氏（也常见于带贵族风格的姓名），字面意思是“来自昂布瓦兹（Amboise）”，历史上有多位知名人物使用。"},"examples":[{"en":"Cardinal Georges d’Amboise was a powerful minister under King Louis XII of France.","zh":"乔治·达朗布瓦兹（红衣主教）在法国国王路易十二时期是一位权势很大的大臣。"},{"en":"The book mentions the d’Amboise family in connection with Renaissance politics.","zh":"这本书提到达朗布瓦兹家族，与文艺复兴时期的政治有关。"}]},{"partOfSpeech":"other","definition":{"en":"“d’Amboise” can function like “of Amboise,” indicating a connection to the town of Amboise in the Loire Valley (France).","zh":"“d’Amboise”也可理解为“来自/属于昂布瓦兹”，表示与法国卢瓦尔河谷的城镇昂布瓦兹（Amboise）有关联。"},"examples":[{"en":"In older texts, d’Amboise often signals a person’s origin or family seat.","zh":"在较早的文本中，d’Amboise常用来提示一个人的出身地或家族领地。"},{"en":"She visited Amboise and later recognized the name d’Amboise in a museum label.","zh":"她参观了昂布瓦兹，后来在博物馆的说明牌上认出了d’Amboise这个名字。"}]}],"synonyms":["Amboise","de Amboise","d’"],"phonetic":"/dæmˈbwɑːz/","extraExplanation":["d’ 是法语介词 de（“来自/属于”）在元音或哑音 h 前的缩写形式，所以写作 d’Amboise（中间有撇号）。在英语写作里通常保留这种拼写（包括大小写与撇号），也常按法语习惯把它当作姓氏的一部分。","Amboise（昂布瓦兹）位于法国卢瓦尔河谷，以昂布瓦兹城堡（Château d’Amboise）等文艺复兴历史闻名；因此 d’Amboise 在历史、艺术史或法国史语境中较常见。"]}
{"word":"D'Amour","summary":{"en":"D’Amour is a French surname meaning “of love,” and it’s also used in titles to mean “of love/about love.”","zh":"D’Amour 既可作法语姓氏（意为“关于爱/属于爱”），也常用于标题中表达“关于爱/充满爱”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(as a proper name) A French surname or family name meaning “of love.”","zh":"（作专有名词）法语姓氏，字面意思是“属于爱/关于爱的”。"},"examples":[{"en":"The author listed on the cover is Marie D’Amour.","zh":"封面上标注的作者是玛丽·达穆尔（D’Amour）。"},{"en":"In the credits, you’ll see the name D’Amour spelled with an apostrophe.","zh":"在演职员表里，你会看到 D’Amour 这个带撇号的拼写。"}]},{"partOfSpeech":"phrase","definition":{"en":"(from French, used in English titles) “of love; about love,” often used to add a romantic or French tone in names of books, songs, perfumes, or menu items.","zh":"（源自法语，常见于英文标题中）“关于爱/充满爱”，常用来给书名、歌名、香水名或菜名增添法式浪漫感。"},"examples":[{"en":"The restaurant serves a dessert called “Crêpes d’amour.”","zh":"这家餐厅有一道甜点叫“爱的可丽饼（Crêpes d’amour）”。"},{"en":"They named the album “Letters d’Amour” to sound romantic.","zh":"他们把专辑命名为“情书（Letters d’Amour）”，听起来更浪漫。"},{"en":"The boutique sells a fragrance labeled “Rose d’Amour.”","zh":"这家精品店卖一款标着“玫瑰之爱（Rose d’Amour）”的香水。"}]}],"synonyms":["of love","about love","amour (French for “love”)"],"phonetic":"/dəˈmʊr/","extraExplanation":["“D’Amour”来自法语缩合：de + amour → d’amour（在以元音开头的词前，de 常缩写为 d’）。因此它可以是姓氏，也常作为法语短语出现在各类命名中，传达“关于爱/充满爱”的意象。","英文里使用时通常保留撇号（’），但在系统不支持特殊字符时也可能写成 Damour。"]}
{"word":"D'Andre","summary":{"en":"D'Andre is a personal first name, often a spelling variant of DeAndre/De'Andre.","zh":"D'Andre 是一个英文名，常见为 DeAndre/De'Andre 的变体拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A given name (first name), most common in the U.S.; often a variant spelling of “DeAndre/De'Andre,” built from “De-” + “Andre.”","zh":"一个英文名字（名），在美国较常见；常被视为 “DeAndre/De'Andre” 的变体拼写，由 “De-” + “Andre” 组合而来。"},"examples":[{"en":"D'Andre is starting on the basketball team this season.","zh":"D'Andre 这赛季将作为篮球队首发。"},{"en":"My coworker, D'Andre, will join the meeting at 3 p.m.","zh":"我的同事 D'Andre 会在下午三点参加会议。"}]}],"synonyms":["DeAndre","De'Andre","Dandre","Andre"],"phonetic":"/diˈɑn.dreɪ/","extraExplanation":["带撇号（'）的拼写在英文人名里并不少见，它通常不影响读音，更多是为了体现名字的独特性或家族/个人偏好的写法。","“Andre/André”源自希腊语词根，和“Andrew”同源，常被解释为“男子气概、勇敢”（这类“名字含义”多为传统来源说明，并非当代使用时必然强调的意义）。","开头的 “D'” 有时会让人联想到法语里的 d'（de 的省略，意为“……的”），但在许多美国人名中它更像是一种构词与风格选择，不一定表示法语语法意义。"]}
{"word":"D'Annunzio","summary":{"en":"D’Annunzio: an important Italian writer (and political figure) known for ornate, decadent-style literature.","zh":"D’Annunzio：重要的意大利作家（兼政治人物），以华丽、带颓废派色彩的文学风格闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Gabriele D’Annunzio (1863–1938), an influential Italian poet, novelist, playwright, and political figure, known for richly musical language and decadent themes in literature.","zh":"加布里埃莱·邓南遮（1863–1938），意大利重要诗人、小说家、剧作家与政治人物，以华丽、富音乐性的语言和“颓废派”气质的文学主题著称。"},"examples":[{"en":"In class we read a few poems by D’Annunzio to compare Italian Decadent writing with French Symbolism.","zh":"课堂上我们读了邓南遮的几首诗，用来比较意大利颓废派写作与法国象征主义。"},{"en":"Some critics say D’Annunzio’s style is beautiful but intentionally excessive.","zh":"一些评论家说邓南遮的文风很美，但刻意追求铺张与浓烈。"}]}],"synonyms":["Gabriele D’Annunzio"],"phonetic":"/dəˈnʌntsioʊ/","extraExplanation":["“D’”是意大利姓氏中的缩写，来自“di”（意为“……的/来自……”），常见于人名（如 D’Annunzio、D’Artagnan）。在英文里通常把它当作姓氏整体来称呼：D’Annunzio。","邓南遮不仅是文学名人，也与意大利民族主义政治活动有关；在英语语境里提到他时，常同时指向“颓废派文学风格”与其复杂的历史争议。"]}
{"word":"D'Arcy","summary":{"en":"D’Arcy is a French-origin name meaning “from Arcy,” used mainly as a surname and sometimes as a given name; it can also appear as a variant spelling of Darcy in literary contexts.","zh":"D’Arcy 是源自法语、意为“来自阿尔西”的人名，多作姓氏，也可作名字；在文学语境中也可能作为 Darcy 的变体拼写出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a personal name (surname or given name). It comes from French “d’Arcy,” meaning “from Arcy” (a place name), and is used in English-speaking countries as a last name and sometimes a first name.","zh":"人名（姓氏或名字）。源自法语“d’Arcy”，本义为“来自阿尔西（Arcy，一地名）”。在英语国家常作姓氏，也偶尔作名字。"},"examples":[{"en":"Mr. D’Arcy will speak at the meeting tomorrow.","zh":"达西先生明天将在会议上发言。"},{"en":"Her first name is D’Arcy, but she goes by Darcy at work.","zh":"她的名字是达西（D’Arcy），但她在工作中用 Darcy 这个写法。"}]},{"partOfSpeech":"n.","definition":{"en":"(in literature) a spelling variant of “Darcy,” especially associated with the character Mr. Darcy in Jane Austen’s novel *Pride and Prejudice*.","zh":"（文学中）“Darcy”的一种拼写变体，常让人联想到简·奥斯汀小说《傲慢与偏见》中的达西先生（Mr. Darcy）。"},"examples":[{"en":"Some editions or references may write the name as D’Arcy instead of Darcy.","zh":"有些版本或资料可能会把名字写成 D’Arcy，而不是 Darcy。"}]}],"synonyms":["Darcy"],"phonetic":"/ˈdɑrsi/","extraExplanation":["“D’Arcy”里的撇号（’）来自法语姓氏写法，常见结构是 d’ + 元音开头的词，相当于“de”（表示“来自/属于”）。例如：d’Artagnan。","在英文书写中，这类姓名有时会被简化为“Darcy”。在正式文件（护照、合同、论文引用）中通常应尊重本人或原文的拼写（是否保留撇号与大小写）。"]}
{"word":"D'Arrest","summary":{"en":"D’Arrest is a proper name best known in astronomy, referring to the astronomer Heinrich Louis d’Arrest and to objects named after him (especially Comet d’Arrest, 6P/d’Arrest).","zh":"D’Arrest 是一个专有名词，最常见于天文学：既可指天文学家海因里希·路易·达雷斯特，也可指以他命名的天体（尤其是达雷斯特彗星 6P/d’Arrest）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(proper noun) A surname best known in astronomy, referring to the Danish-German astronomer Heinrich Louis d’Arrest (1822–1875).","zh":"（专有名词）一个姓氏，在天文学中最常见，指丹麦裔德国语天文学家海因里希·路易·达雷斯特（Heinrich Louis d’Arrest，1822–1875）。"},"examples":[{"en":"D’Arrest helped confirm Neptune’s position soon after it was predicted.","zh":"达雷斯特在海王星被预测出来后不久，协助确认了它的位置。"},{"en":"In astronomy history, D’Arrest is remembered for careful observation and computation.","zh":"在天文学史中，达雷斯特以细致的观测和计算而被人记住。"}]},{"partOfSpeech":"n.","definition":{"en":"(astronomy) Used in names of objects connected to him, such as the periodic comet 6P/d’Arrest (“Comet d’Arrest”).","zh":"（天文学）用于与他相关的天体名称中，例如周期彗星 6P/d’Arrest（“达雷斯特彗星”）。"},"examples":[{"en":"6P/d’Arrest returns on a regular schedule as a periodic comet.","zh":"6P/d’Arrest 是一颗周期彗星，会按相对规律的周期回归。"},{"en":"The telescope was pointed toward the region where Comet d’Arrest was expected to appear.","zh":"望远镜对准了预计达雷斯特彗星会出现的区域。"}]}],"synonyms":["6P/d’Arrest","Comet d’Arrest"],"phonetic":"/dɑˈrɛst/","extraExplanation":["“D’Arrest”里的 d’ 来自法语/拉丁语传统写法，相当于“of/from”，在姓氏中常见（如 d’Artagnan）。英文中通常保留这个写法与大小写。","学术写作中常见拼写：d’Arrest（d 小写、A 大写）。在句首有时也会写作 D’Arrest。","如果你在论文或科普中看到 6P/d’Arrest，这里的 6P 表示它是第 6 颗被确认的周期彗星（periodic comet）。"]}
{"word":"D'Attoma","summary":{"en":"D’Attoma is an Italian last name.","zh":"D’Attoma 是一个意大利姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an Italian surname (family name).","zh":"一个意大利姓氏（家族姓）。"},"examples":[{"en":"Ms. D’Attoma will speak at the conference tomorrow.","zh":"D’Attoma 女士明天将在会议上发言。"},{"en":"I saw the name D’Attoma on the guest list.","zh":"我在嘉宾名单上看到了 D’Attoma 这个名字。"}]}],"synonyms":["(no true synonyms; it is a proper name)"],"phonetic":"/dəˈtoʊmə/","extraExplanation":["“D’”是意大利语姓氏中常见的缩写形式，相当于“di”（意为“……的 / 来自……”）。因此像 D’Attoma 这类姓氏常带有家族来源或所属的含义。","在英文书写中，这类姓氏的撇号（’）通常保留；按人名规则首字母大写：D’Attoma。若在句首或标题中，也通常保持这种写法。","发音在不同地区或家族中可能略有差异；若是指具体某位人物（如运动员、学者等），最好以本人或权威媒体的读法为准。"]}
{"word":"D'Avenant","summary":{"en":"D’Avenant is best known as Sir William D’Avenant, a 17th-century English poet and playwright who helped revive English theater after the Civil War.","zh":"D’Avenant 通常指17世纪英国诗人、剧作家威廉·达夫南特爵士，他在英国内战后推动戏剧复兴而著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) Sir William D’Avenant (1606–1668), an English poet, playwright, and theatrical manager, best known for his epic poem *Gondibert* and for helping restore English theater after the English Civil War.","zh":"（专有名词）威廉·达夫南特爵士（1606–1668），英国诗人、剧作家与戏剧经营者，以史诗《贡迪伯特》以及在英国内战后推动戏剧复兴而闻名。"},"examples":[{"en":"D’Avenant played an important role in bringing public theater back to London after years of closure.","zh":"达夫南特在伦敦剧院停演多年后，对公共戏剧的复兴起了重要作用。"},{"en":"Some writers in D’Avenant’s time admired his attempt to create a grand English epic in *Gondibert*.","zh":"达夫南特同时代的一些作家欣赏他在《贡迪伯特》中创作宏大英语史诗的尝试。"}]}],"synonyms":["Sir William D’Avenant"],"phonetic":"ˈdævənənt","extraExplanation":["达夫南特活跃于英国“复辟时期”（Restoration）前后。清教徒政权时期伦敦剧院一度关闭，他后来通过获得特许、组织演出等方式，推动了英格兰戏剧重新走向公开舞台。","他曾担任“桂冠诗人”（Poet Laureate），这一职务相当于英国官方的宫廷诗人。","关于他与莎士比亚的关系：历史上流传他可能是莎士比亚的教子，甚至有传闻称他是莎士比亚私生子，但都缺乏确凿证据；更可靠的是，他在后世莎剧改编与戏剧传统延续上具有影响。"]}
{"word":"D'ewart","summary":{"en":"“D’ewart” is usually a proper name, most commonly a surname (and sometimes a place name).","zh":"“D’ewart”通常是专有名词，多见于姓氏（有时也可作地名）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname); sometimes spelled “Dewart” (without the apostrophe).","zh":"姓氏（家族姓）；有时写作 “Dewart”（不加撇号）。"},"examples":[{"en":"Ms. Dewart will lead the meeting today.","zh":"Dewart 女士今天将主持会议。"},{"en":"How do you spell your last name, D’ewart or Dewart?","zh":"你的姓怎么拼写，是 D’ewart 还是 Dewart？"}]},{"partOfSpeech":"other","definition":{"en":"a place name (used for some small communities), e.g., in the United States.","zh":"地名（用于一些小型聚居地/社区），例如在美国。"},"examples":[{"en":"They drove through Dewart on the way to Lewisburg.","zh":"他们去刘易斯堡的路上开车经过了 Dewart。"}]}],"synonyms":["Dewart","Dewar"],"phonetic":"/ˈduːwɑːrt/","extraExplanation":["“D’ewart”这种带撇号的拼法在英语里不算常见；很多时候只是个人/家族选择的写法，或由移民登记、手写记录等因素造成的变体。","如果你指的是某个人名或品牌名（例如特定地区的家族、企业、校名等），“D’ewart”通常没有固定“词义”，主要是作为专有名词使用。你也可以告诉我出现它的句子或场景，我可以帮你判断最可能的含义和读法。"]}
{"word":"D'Iberville","summary":{"en":"D’Iberville is usually a proper name referring to Pierre Le Moyne d’Iberville, a French-Canadian explorer and military leader; it is also used for North American place names honoring him.","zh":"D’Iberville 通常指法裔加拿大探险家与军事人物皮埃尔·勒穆瓦纳·迪贝维尔；也常作为北美一些纪念他而命名的地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper name) Pierre Le Moyne d’Iberville (1661–1706), a French-Canadian naval officer and explorer known for founding French Louisiana’s first permanent settlement and for campaigns in Hudson Bay and Newfoundland.","zh":"（专有名词）皮埃尔·勒穆瓦纳·迪贝维尔（1661–1706），法裔加拿大海军军官与探险家，以在哈德逊湾与纽芬兰的军事行动及建立法属路易斯安那最早的永久定居点而闻名。"},"examples":[{"en":"D’Iberville led French expeditions in Hudson Bay during the struggle with England.","zh":"迪贝维尔在与英国的角力中率领法国远征队进入哈德逊湾。"},{"en":"In some histories of Louisiana, D’Iberville is described as a key founder figure.","zh":"在一些路易斯安那史著中，迪贝维尔被描述为重要的奠基人物。"}]},{"partOfSpeech":"n.","definition":{"en":"(Place name, U.S.) A city name (e.g., D’Iberville, Mississippi) and other locations in North America named in honor of d’Iberville.","zh":"（美国地名）北美一些以“D’Iberville”为名的城镇或地点（例如密西西比州的迪贝维尔市），多为纪念迪贝维尔而命名。"},"examples":[{"en":"She grew up near D’Iberville, Mississippi, on the Gulf Coast.","zh":"她在墨西哥湾沿岸、密西西比州的迪贝维尔附近长大。"},{"en":"Several landmarks in Louisiana and Mississippi carry the name D’Iberville.","zh":"路易斯安那和密西西比有多处地标使用“D’Iberville”这个名字。"}]}],"synonyms":["Pierre Le Moyne d’Iberville","d’Iberville"],"phonetic":"/diˈbɝːvil/","extraExplanation":["“d’”是法语缩写，来自“de（……的/来自）”，常见于法语姓氏中；“Iberville”一般被视为家族/封地或称号的一部分。","在英语资料里，你也可能看到拼写与大小写变化，如 d’Iberville / D’Iberville；正式写作中通常保留撇号并按原文拼写。"]}
{"word":"D'Ignazio","summary":{"en":"D'Ignazio is an Italian-origin surname used as a proper family name.","zh":"D'Ignazio 是源自意大利的姓氏，用作家族名/人名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an Italian-origin surname (family name); in English contexts it is used as a proper name for a person or family.","zh":"（源自意大利的）姓氏；在英语语境中作为人名/家族名使用。"},"examples":[{"en":"Professor D'Ignazio will speak at the conference tomorrow.","zh":"D'Ignazio 教授明天将在会议上发言。"},{"en":"I emailed Ms. D'Ignazio to ask about the assignment.","zh":"我给 D'Ignazio 女士发邮件询问作业情况。"}]}],"phonetic":"/diɡˈnɑːzioʊ/","extraExplanation":["D'Ignazio 常见于意大利裔姓氏中：D' 是“di（of/from，……的）”的缩写，整体大致有“属于/来自 Ignazio（伊格纳齐奥）家族”的含义。","英文写作中要保留撇号：D'Ignazio。按字母排序时，通常会被算作以 D 开头；称呼个人时可用 Mr./Ms./Dr. D'Ignazio。"]}
{"word":"D'Inzeo","summary":{"en":"D’Inzeo is an Italian surname, often recognized from famous Olympic show jumpers.","zh":"D’Inzeo 是意大利姓氏，常因著名的奥运马术障碍赛骑手而被熟知。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a proper name (Italian surname), most famously associated with the Italian equestrian family of show jumpers Raimondo D’Inzeo and Piero D’Inzeo.","zh":"专有名词（意大利姓氏）。最知名的用法常指意大利马术障碍赛家族中的“D’Inzeo”兄弟：Raimondo D’Inzeo 与 Piero D’Inzeo。"},"examples":[{"en":"I’m reading about Piero D’Inzeo, a legendary Italian show jumper.","zh":"我在读关于 Piero D’Inzeo 的资料，他是意大利传奇障碍赛骑手。"},{"en":"The article mentions Raimondo D’Inzeo and his Olympic medals.","zh":"文章提到 Raimondo D’Inzeo 以及他的奥运奖牌。"}]}],"phonetic":"/dɪnˈzeɪoʊ/","extraExplanation":["“D’”是意大利语中“di”的省略形式，常见于姓氏里，含义大致相当于“来自……的/……家的”。因此 D’Inzeo 可以理解为一个带有家族或来源色彩的姓氏形式。","在英语语境中，这类带撇号的姓氏通常保留原拼写（D’Inzeo），但读音会因说话者而略有英语化；正式场合可参考本人或权威媒体的读法。"]}
{"word":"D'Oria","summary":{"en":"D’Oria is most commonly used as an Italian-origin surname (a family name).","zh":"D’Oria 最常见的用法是一个源自意大利语背景的姓氏（家族名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a proper name (surname), likely of Italian origin; used to refer to a person or family named D’Oria.","zh":"一个专有名词（姓氏），多见于意大利语背景；用于指姓 D’Oria 的个人或家族。"},"examples":[{"en":"Ms. D’Oria will lead today’s meeting.","zh":"D’Oria 女士将主持今天的会议。"},{"en":"I saw the name D’Oria on the guest list.","zh":"我在宾客名单上看到了 D’Oria 这个名字。"}]}],"phonetic":"/ˈdɔːriə/","extraExplanation":["在一些意大利姓氏里，D’（= di 的缩写）常带有“……的/来自……”的含义，类似英语里的“of”。因此 D’Oria 可能历史上表示“来自 Oria（地名）的人”或“Oria 家族的人”。","英语里带撇号的姓氏（如 D’Oria）通常保留原语言的拼写；在文件录入时要注意撇号可能导致系统检索或排序差异（例如有的系统会忽略或替换撇号）。"]}
{"word":"D'Urfey","summary":{"en":"D’Urfey is best known as Thomas D’Urfey, a Restoration-era English playwright and songwriter.","zh":"D’Urfey 通常指托马斯·德尔菲，一位英国复辟时期的剧作家与歌曲作者。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Thomas D’Urfey (1653–1723), an English playwright, songwriter, and poet, known for popular comic plays and songs in the Restoration period.","zh":"托马斯·德尔菲（Thomas D’Urfey，1653–1723），英国剧作家、歌曲作者与诗人，以复辟时期的通俗喜剧和歌曲闻名。"},"examples":[{"en":"D’Urfey wrote many lively songs that were performed in London theaters.","zh":"德尔菲写了许多活泼的歌曲，在伦敦剧院里演出。"},{"en":"Some anthologies of Restoration music include pieces by D’Urfey.","zh":"一些复辟时期音乐选集会收录德尔菲的作品。"}]}],"synonyms":["Thomas D’Urfey"],"phonetic":"/ˈdɝfi/","extraExplanation":["“D’Urfey”里的 D’ 源自法语/诺曼语风格的姓氏写法，常表示“of/from（来自……）”。英语里这类姓氏有时会出现大小写和标点的不同写法（如 D'Urfey / D’Urfey）。","他生活在英国“复辟时期（Restoration, 1660 之后）”，当时戏剧与歌曲娱乐非常兴盛，作品往往更偏都市、讽刺和通俗趣味。学习相关文学史时，可能会在讨论舞台音乐、喜剧传统或通俗歌谣时遇到他的名字。"]}
{"word":"D-borneol","summary":{"en":"D-borneol is a particular stereochemical form (enantiomer) of borneol, a camphor-scented terpene alcohol used mainly in fragrances and sometimes in medicinal or research contexts.","zh":"D-龙脑是龙脑的一种特定立体异构体（对映体），带有樟脑样气味，主要用于香精香料，也可出现在医药或科研语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a specific “right-handed” (dextro) form of borneol, a naturally occurring terpene alcohol used in fragrances and sometimes in medicine","zh":"D-龙脑：龙脑（borneol）的一种“右旋”（dextro）立体异构体，是天然存在的萜类醇，常用于香精香料，也可能用于部分医药/研究用途"},"examples":[{"en":"D-borneol is added to some fragrance formulas for a fresh, camphor-like note.","zh":"在一些香精配方中会加入D-龙脑，用来提供清新、类似樟脑的气味。"},{"en":"In the lab, D-borneol can be discussed as one enantiomer of borneol.","zh":"在实验室里，D-龙脑常被作为龙脑的一种对映体来讨论。"}]}],"synonyms":["(+)-borneol","d-borneol","borneol"],"phonetic":"/ˌdiː ˈbɔrniˌɔl/","extraExplanation":["“D-”通常表示该分子属于一组特定的立体构型（常与旋光方向/对映体相关）。日常使用中也可能写作 d-borneol 或 (+)-borneol；但不同命名体系（D/L 与 (+)/(−)）并不总是一一对应，具体要看化学定义与测量结果。","龙脑在中文语境里常被称为“冰片/龙脑”，在传统用法中多指具有清凉、樟脑样气味的相关成分；不过具体“冰片”可能涉及不同来源与成分标准，阅读产品/药典时需注意标注。"]}
{"word":"D-Day","summary":{"en":"“D-Day” most commonly refers to June 6, 1944 (the Normandy landings). It can also mean any crucial day when a major plan begins.","zh":"“D-Day”最常指1944年6月6日的诺曼底登陆；也可泛指重大计划开始的关键日。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the day (June 6, 1944) when Allied forces began the Normandy landings in World War II; often written as “D-Day.”","zh":"（特指）1944年6月6日二战中盟军在法国诺曼底登陆作战开始的那一天；常写作“D-Day”。"},"examples":[{"en":"D-Day marked the beginning of the Allied invasion of Nazi-occupied Western Europe.","zh":"D-Day标志着盟军开始进攻纳粹占领的西欧。"},{"en":"Many films and books depict what soldiers experienced on D-Day.","zh":"许多电影和书籍描绘了士兵在D-Day的经历。"}]},{"partOfSpeech":"n.","definition":{"en":"a planned day when an important operation, attack, or event begins; the deadline or launch day (often used in business or everyday speech).","zh":"（引申）某项重大行动/计划开始的预定日期；关键日、启动日（常用于商业或日常表达）。"},"examples":[{"en":"The team is working overtime because D-Day for the product launch is next Monday.","zh":"因为产品发布的D-Day是下周一，团队正在加班。"},{"en":"After months of training, D-Day finally arrived.","zh":"经过数月训练，关键的D-Day终于到了。"}]}],"synonyms":["the Normandy landings","launch day","the big day","day of reckoning"],"phonetic":"/ˈdiː deɪ/","extraExplanation":["“D-Day”里的“D”原本只是“Day（那一天）”的缩写，用来指军事行动开始的日期；类似的还有“H-Hour（行动开始的小时）”。","历史语境中，首字母大写并加连字符的“D-Day”通常特指1944年诺曼底登陆；小写或泛用语境里则更多表示“关键日/行动日”。","文化作品中常见引用：如电影《Saving Private Ryan（拯救大兵瑞恩）》开头就再现了D-Day登陆场景。"]}
{"word":"D-day","summary":{"en":"D-Day most commonly means June 6, 1944 (Normandy landings), and more generally any planned start day for a major operation or an important day after preparation.","zh":"D-Day最常指1944年6月6日的诺曼底登陆日；也可泛指重大行动的预定开始日，或（口语）经过准备后到来的关键日。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the day on which the Allied forces landed in Normandy, France, during World War II (June 6, 1944).","zh":"（二战）诺曼底登陆日：1944年6月6日盟军在法国诺曼底登陆的那一天。"},"examples":[{"en":"In many history books, D-Day refers to June 6, 1944, the start of the Normandy landings.","zh":"在许多历史书里，D-Day指的就是1944年6月6日，即诺曼底登陆开始的那一天。"},{"en":"Veterans gathered to remember D-Day and those who served.","zh":"老兵们聚集在一起纪念D-Day以及所有参战的人。"}]},{"partOfSpeech":"n.","definition":{"en":"the planned day when a military operation begins; the date an important operation is scheduled to start.","zh":"（军事）行动开始日：计划发动军事行动的那一天；某项重要行动预定开始的日期。"},"examples":[{"en":"The commander moved D-Day forward because of the weather forecast.","zh":"由于天气预报，指挥官把D-Day提前了。"},{"en":"Supplies must arrive before D-Day.","zh":"物资必须在D-Day之前到位。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) the day something important happens, especially after a lot of preparation.","zh":"（非正式）关键日/大日子：经过长期准备后某件大事发生的那天。"},"examples":[{"en":"After months of training, D-Day finally arrived: the marathon.","zh":"经过几个月训练，D-Day终于到了：马拉松比赛日。"},{"en":"It’s D-Day for our product launch—everyone is nervous but excited.","zh":"今天是我们产品发布的关键日——大家既紧张又兴奋。"}]}],"synonyms":["the Normandy landings (specific)","invasion day","launch day","start date","the big day"],"phonetic":"/ˈdiː deɪ/","extraExplanation":["“D-Day”里的D原本只是“Day（某一天）”的缩写，用于军事计划中表示“行动开始那天”，与“具体日期”无关；类似的还有“H-Hour（H时）”，表示行动开始的具体时刻。","因为1944年诺曼底登陆影响巨大，“D-Day”在大众语境中常被专指1944年6月6日。写作时如果要表达“泛指的开始日”，可用小写“d-day”或直接说“the operation’s start date”，以避免歧义。"]}
{"word":"D-flat","summary":{"en":"D-flat (D♭) is the note a half step below D, and it can also describe keys or scales based on that note.","zh":"D-flat（D♭）是比D低半音的音名，也可用于描述以D♭为主音的调性或音阶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A musical note one semitone (half step) lower than D; written as D♭.","zh":"（音乐）D降半音的音；写作 D♭（比D低半音）。"},"examples":[{"en":"This melody starts on D-flat.","zh":"这段旋律从D♭开始。"},{"en":"Play a D-flat, then move up to D.","zh":"先弹D♭，然后上行到D。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing a key, chord, or scale based on the note D♭ (e.g., D-flat major/minor).","zh":"（用于描述调性/和弦/音阶）以D♭为主音的，如D♭大调/小调。"},"examples":[{"en":"The piece is in D-flat major.","zh":"这首曲子是D♭大调。"},{"en":"Practice the D-flat major scale slowly.","zh":"慢慢练习D♭大调音阶。"}]}],"synonyms":["D♭","Db"],"phonetic":"/ˌdiː ˈflæt/","extraExplanation":["在钢琴上，D♭通常对应“黑键”——位于D和E之间的那一个黑键（更准确地说是“两个黑键”这一组中靠左的那个）。","D♭与C♯在十二平均律里听起来相同（同音异名，enharmonic），但在乐谱写法与和声语境中会根据调性选择写成D♭或C♯。"]}
{"word":"D-notice","summary":{"en":"A UK government notice asking the media not to publish sensitive information, mainly for national security.","zh":"英國政府向媒體提出的通知/建議，要求不要公開敏感資訊，主要出於國安考量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(UK) an official request to the media not to publish or broadcast certain information, usually for national security reasons (also called a “DSMA-Notice”).","zh":"（英國）政府向媒體發出的正式請求，要求不要刊登或播出某些資訊，通常因為國家安全（也稱「DSMA-Notice」）。"},"examples":[{"en":"The newspaper received a D-notice and delayed publishing the story.","zh":"那家報紙收到 D-notice 後，延後刊登那則報導。"},{"en":"Editors debated whether the report violated the D-notice guidance.","zh":"編輯們討論那份報導是否違反了 D-notice 的指引。"}]}],"synonyms":["DSMA-Notice","media advisory","publication advisory"],"phonetic":"/ˈdiː ˌnoʊtɪs/","extraExplanation":["D-notice 是英國特有的用法，現在正式名稱多為「DSMA-Notice」（Defence and Security Media Advisory Notice）。它通常是「建議/請求」而非直接的法律禁令，但媒體多半會配合以避免危害安全或引發法律風險。","在日常英文中，這個詞帶有鮮明的英國政治與新聞文化背景；在美國語境較少見，通常會說「government advisory to the press」或更一般的「publication ban」（但後者常是法庭命令，性質不同）。"]}
{"word":"D-sharp","summary":{"en":"D-sharp (D♯) is the note one half step above D.","zh":"D-sharp（D♯）是比D高半音的音。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A musical note a semitone (half step) higher than D; written as D♯.","zh":"音乐音名“D升（D♯）”，比D高一个半音（半音阶的一步）。"},"examples":[{"en":"The melody starts on D-sharp and then moves up to E.","zh":"旋律从D升开始，然后上行到E。"},{"en":"On the piano, D-sharp is the black key between D and E.","zh":"在钢琴上，D升是D和E之间的黑键。"},{"en":"The singer struggled to hit the D-sharp cleanly.","zh":"歌手很难把D升唱得干净准确。"}]}],"synonyms":["D♯","D sharp","Re sharp"],"phonetic":"/ˈdiː ˌʃɑrp/","extraExplanation":["D♯（D升）在“十二平均律”里与E♭（E降）通常是同一个音高，叫“等音（enharmonic）”；但在乐理分析或和声功能上，作曲家会根据调性与和弦写成D♯或E♭，用来表达不同的走向与意义。","在记谱中，“♯”表示把音提高半音；所以D-sharp就是“D + 升号”。口语里也常说“D sharp”。"]}
{"word":"D-state","summary":{"en":"“D-state” most commonly means an atomic/electronic energy state labeled D (angular momentum l or L = 2), especially in spectroscopy.","zh":"“D-state”最常见指光谱学中标记为 D 的原子/电子能级状态（角动量 l 或 L = 2）。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Physics/Chemistry) An electronic or atomic energy state labeled “D,” usually meaning the electrons have orbital angular momentum quantum number l = 2 (or total orbital angular momentum L = 2 in spectroscopic term symbols).","zh":"（物理/化学）标记为“D”的电子/原子能级状态，通常表示电子的轨道角动量量子数 l = 2（或在光谱项符号中总轨道角动量 L = 2）。"},"examples":[{"en":"The atom was excited from the S-state to a D-state during the experiment.","zh":"在实验中，这个原子从 S 态被激发到 D 态。"},{"en":"Transitions involving a D-state often show up in spectroscopy data.","zh":"涉及 D 态的跃迁常常会出现在光谱数据中。"}]},{"partOfSpeech":"phrase","definition":{"en":"(General scientific writing) Any “state” named or categorized with the label D within a specific model or system (the exact meaning depends on the field and author).","zh":"（一般科研写作）在某个模型或系统中被标记为 D 的一种“状态”（具体含义取决于学科与作者定义）。"},"examples":[{"en":"In this model, the system enters the D-state after two consecutive failures.","zh":"在这个模型里，系统在连续两次失败后进入 D 状态。"},{"en":"The paper defines the D-state as the degraded operating mode.","zh":"论文将 D 状态定义为性能下降的运行模式。"}]}],"synonyms":["D state","D term","l=2 state","L=2 state"],"phonetic":"/ˈdiː steɪt/","extraExplanation":["在原子光谱的传统命名里，常见有 S、P、D、F… 这些字母对应角动量：S=0，P=1，D=2，F=3。这个体系来自早期对谱线“锐/主/漫/基”的历史命名，后来与量子角动量对应起来，所以你会在“D-state”“D term”“3D2”等写法中看到它。","写作中带连字符的 “D-state” 和不带连字符的 “D state” 通常意思相同；连字符更多是排版习惯，用来强调它是一个整体术语。"]}
{"word":"D.A.","summary":{"en":"D.A. is most commonly an abbreviation for District Attorney in the U.S.; it can also mean other titles or degrees depending on context.","zh":"D.A. 最常见是（美国）District Attorney 的缩写；也可能在不同语境中表示其他职称或学位。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"District Attorney: the chief local government lawyer who prosecutes criminal cases for a county or district (common in the U.S.).","zh":"（美国常用）地方检察官：负责代表政府在某个县/地区提起刑事公诉的主要检察官。"},"examples":[{"en":"The D.A. decided to file charges after reviewing the evidence.","zh":"地方检察官在审查证据后决定提起指控。"},{"en":"Witnesses met with the D.A.’s office before the trial.","zh":"审判前，证人和地方检察官办公室见了面。"},{"en":"The defendant accepted a plea deal offered by the D.A.","zh":"被告接受了地方检察官提出的认罪协商方案。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation used in some contexts for job titles or degrees (less common), such as data analyst or Doctor of Arts; the exact meaning depends on the field.","zh":"在某些领域中作缩写（较不常见），例如数据分析师（data analyst）或文学/艺术博士（Doctor of Arts）；具体含义取决于语境。"},"examples":[{"en":"She works as a D.A. on the business intelligence team (data analyst).","zh":"她在商业智能团队做数据分析师（D.A.）。"},{"en":"He earned a D.A. in humanities (Doctor of Arts).","zh":"他获得了人文学科的（Doctor of Arts）学位。"}]}],"synonyms":["district attorney","prosecutor","DA"],"phonetic":"/ˌdiːˈeɪ/","extraExplanation":["在美国新闻、法庭剧和法律语境里，D.A. 最常指 District Attorney。它通常是县一级或地区一级的检察机关负责人，负责决定是否起诉、提出哪些指控、以及在法庭上代表“人民/政府”进行公诉。","英美体系中职位名称不完全对应：英国更常见的是 CPS（Crown Prosecution Service）及“prosecutor”。因此看到 D.A. 时，默认把它理解为“美国地方检察官”往往最稳妥。"]}
{"word":"D.B.E.","summary":{"en":"DBE = Dame Commander of the Order of the British Empire (a UK honor, written after a person’s name).","zh":"DBE＝大英帝国勋章女司令（英国荣誉头衔缩写，常写在姓名后）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(UK honors) Dame Commander of the Order of the British Empire, a high rank in the British honors system for notable national or international contributions. The letters “DBE” are written after a recipient’s name as a title/award indicator.","zh":"（英国荣誉）大英帝国勋章女司令（Dame Commander of the Order of the British Empire），英国授勋体系中的较高等级，用于表彰对国家或国际社会有杰出贡献的人。“DBE”常作为姓名后的头衔缩写使用。"},"examples":[{"en":"Judi Dench, DBE, is one of Britain’s most celebrated actors.","zh":"朱迪·丹奇（Judi Dench），DBE，是英国最受推崇的演员之一。"},{"en":"Her name appears as “Dr. Anita Patel, DBE” in the program.","zh":"在节目单上，她的名字写作“Dr. Anita Patel, DBE”。"},{"en":"After receiving a DBE, she was formally addressed as “Dame.”","zh":"获授DBE后，她在正式场合可被称为“Dame（爵士夫人）”。"}]}],"synonyms":["Dame Commander","Order of the British Empire (DBE)","post-nominal letters: DBE"],"phonetic":"/ˌdiː biː ˈiː/","extraExplanation":["DBE属于“Order of the British Empire（大英帝国勋章）”体系中的一个等级，男性对应常见写法是KBE（Knight Commander）。更低一级常见的是CBE/OBE/MBE。","“DBE”多用于书面场合作为姓名后的“post-nominal letters（姓名后缀荣衔）”。在称呼上，获授DBE者通常可用“Dame + 名（first name）”的形式（如Dame Judi）。"]}
{"word":"D.C.","summary":{"en":"“D.C.” most commonly refers to Washington, D.C. (the U.S. capital); it can also mean “direct current” in electricity.","zh":"“D.C.”最常指华盛顿特区（美国首都）；在电学语境中也可指“直流电”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Abbreviation) Washington, D.C.; the District of Columbia, the federal capital area of the United States.","zh":"（缩写）华盛顿特区；美国的联邦首都辖区“哥伦比亚特区”（District of Columbia）。"},"examples":[{"en":"I’m flying to D.C. for a conference next week.","zh":"我下周要飞去华盛顿特区参加会议。"},{"en":"Many national museums are in D.C., like the Smithsonian museums.","zh":"很多国家级博物馆都在华盛顿特区，比如史密森学会的博物馆群。"},{"en":"She works for a nonprofit based in D.C.","zh":"她在一家总部位于华盛顿特区的非营利机构工作。"}]},{"partOfSpeech":"other","definition":{"en":"(Abbreviation) direct current; an electric current that flows in one direction (opposite of AC).","zh":"（缩写）直流电；电流沿一个方向流动（相对于 AC 交流电）。"},"examples":[{"en":"This device runs on 12V DC.","zh":"这个设备使用 12 伏直流电。"},{"en":"Batteries provide DC power.","zh":"电池提供直流电。"}]}],"synonyms":["Washington, D.C.","District of Columbia","DC","direct current"],"phonetic":"/ˌdiːˈsiː/","extraExplanation":["在美国日常语境里，“D.C.”最常指“Washington, D.C.”。它不属于任何一个州，位于马里兰州（Maryland）和弗吉尼亚州（Virginia）之间。","写作时常见形式有“Washington, DC”（不带点）、“Washington, D.C.”（带点）。两种都常见，选一种风格并保持一致即可。"]}
{"word":"D.C.L.","summary":{"en":"D.C.L. most commonly means “Doctor of Civil Law,” a law doctorate (often honorary in some universities). In other documents it may be an institution-specific abbreviation, so context matters.","zh":"D.C.L. 最常见指“Doctor of Civil Law（民法法学博士）”这一法学博士头衔（在部分大学常为荣誉博士）；在其他文件中也可能是机构自定义缩写，需结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Doctor of Civil Law: a doctoral degree (often an honorary doctorate) in law, especially at some British and Commonwealth universities.","zh":"（法学）民法法学博士：一种法学博士学位（在某些英联邦院校常见为荣誉博士），常用于学术或正式头衔。"},"examples":[{"en":"She received a D.C.L. from the university for her contributions to international law.","zh":"她因对国际法的贡献获得该大学授予的 D.C.L.（荣誉）博士。"},{"en":"His name appears as “John Smith, D.C.L.” in the program.","zh":"节目单上他的名字写作“John Smith, D.C.L.”。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation used in some contexts for “District of Columbia Law” or similar institution-specific/legal references (meaning depends on the document).","zh":"在部分语境中指“哥伦比亚特区法律”等与机构/法律相关的缩写（具体含义取决于文件或单位的写法）。"},"examples":[{"en":"The form asks whether your training meets D.C.L. requirements.","zh":"表格询问你的培训是否符合 D.C.L.（某项与特区法律相关的）要求。"},{"en":"Check the glossary: D.C.L. is defined differently in this manual.","zh":"查看术语表：在这本手册里 D.C.L. 的定义不同。"}]}],"synonyms":["Doctor of Civil Law","DCL"],"phonetic":"ˌdiː ˌsiː ˈɛl","extraExplanation":["“D.C.L.”最常见、最稳定的含义是学位头衔 Doctor of Civil Law，尤其在英国牛津等院校传统中出现；在美国语境里不如 J.D. 常见，因此看到时建议结合学校、颁授场合或姓名后缀判断。","如果出现在政府/法律文件中，也可能是某个机构自定义的缩写（例如与 District of Columbia 相关的法律项目）。遇到不确定的用法，通常可在文件的缩写表（abbreviations/glossary）里找到解释。"]}
{"word":"D.C.M.","summary":{"en":"D.C.M. is an abbreviation; most commonly it means the British Distinguished Conduct Medal, but it can stand for other terms depending on the context.","zh":"D.C.M. 是一个缩写；最常见指英国的“杰出行为勋章”，但在不同语境下也可能代表其他含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbr.) Distinguished Conduct Medal: a British military medal awarded for bravery in the field (especially in the Army).","zh":"（缩写）杰出行为勋章：英国军队授予的军功勋章，表彰战场上的英勇行为（尤指陆军）。"},"examples":[{"en":"He was awarded the D.C.M. for bravery during the campaign.","zh":"他因在战役中的英勇表现而获颁 D.C.M.（杰出行为勋章）。"},{"en":"The museum has a display of medals, including a D.C.M.","zh":"博物馆展出了多种勋章，其中包括一枚 D.C.M.。"}]},{"partOfSpeech":"n.","definition":{"en":"(abbr., less common) Digital content management: systems or practices for organizing and delivering digital content (often written without periods as DCM).","zh":"（缩写，较少见）数字内容管理：用于整理、管理与分发数字内容的系统或做法（更常写作 DCM，不加句点）。"},"examples":[{"en":"Our team is updating the DCM system for the website.","zh":"我们团队正在升级网站的数字内容管理（DCM）系统。"},{"en":"Ask IT which DCM tool we should use.","zh":"去问一下 IT 我们该用哪种 DCM（数字内容管理）工具。"}]},{"partOfSpeech":"n.","definition":{"en":"(abbr.) An initialism that can mean different things in different fields; the exact meaning depends on context.","zh":"（缩写）在不同领域可能代表不同含义；具体意思需要根据上下文判断。"},"examples":[{"en":"In this report, D.C.M. is defined on the first page.","zh":"在这份报告里，D.C.M. 的含义在第一页就有说明。"},{"en":"Could you clarify what D.C.M. stands for here?","zh":"你能说明一下这里的 D.C.M. 具体指什么吗？"}]}],"synonyms":["DCM (without periods)","Distinguished Conduct Medal"],"phonetic":"/ˌdiː siː ˈɛm/","extraExplanation":["“Distinguished Conduct Medal（杰出行为勋章）”是英国历史上重要的英勇勋章之一，主要授予士兵与准尉级别的军人，用来表彰战场上的勇敢行为。它在 19 世纪中期设立，后来随着英国荣誉制度调整逐步停止颁授。","英文里写缩写时，加不加句点（D.C.M. vs DCM）常取决于机构风格或出版规范；现代写作中越来越常见不加句点的形式。"]}
{"word":"D.D.","summary":{"en":"“D.D.” is a common abbreviation with different meanings, especially Doctor of Divinity, due diligence, or direct debit (context matters).","zh":"“D.D.” 是常见缩写，常指神学博士、尽职调查或自动扣款等，具体含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Doctor of Divinity,” an advanced degree/title in theology (often honorary).","zh":"“神学博士（Doctor of Divinity）”的缩写，一种神学领域的高级学位/头衔（常为荣誉授予）。"},"examples":[{"en":"He received a D.D. from the seminary for his lifelong service.","zh":"他因一生的服务而从神学院获得了神学博士（D.D.）头衔。"},{"en":"The speaker was introduced as Rev. James Lee, D.D.","zh":"主持人介绍他为詹姆斯·李牧师（Rev. James Lee, D.D.）。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “due diligence,” the careful checking/investigation done before making a business decision (e.g., buying a company).","zh":"“尽职调查（due diligence）”的缩写，指在商业决策前进行的认真核查与调查（如并购前）。"},"examples":[{"en":"We’re in D.D. now, reviewing the company’s contracts.","zh":"我们正在做尽职调查（D.D.），审查这家公司的合同。"},{"en":"The deal depends on the results of D.D.","zh":"这笔交易取决于尽职调查（D.D.）的结果。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “direct debit,” a banking method where money is taken automatically from an account to pay bills.","zh":"“直接扣款/自动扣款（direct debit）”的缩写，指银行自动从账户扣款支付账单。"},"examples":[{"en":"My rent is paid by D.D. on the first of every month.","zh":"我的房租每月一号通过自动扣款（D.D.）支付。"},{"en":"Please set up D.D. to avoid late payments.","zh":"请设置自动扣款（D.D.），以免逾期。"}]},{"partOfSpeech":"other","definition":{"en":"(informal) an abbreviation meaning “drunk driving,” i.e., driving under the influence of alcohol; more commonly written as DUI in the U.S.","zh":"（非正式）“酒驾（drunk driving）”的缩写；在美国更常写作 DUI。"},"examples":[{"en":"He was arrested for D.D. after failing a breath test.","zh":"他因酒驾（D.D.）吹气测试不合格而被捕。"},{"en":"In the U.S., people usually say “DUI” instead of “D.D.”","zh":"在美国，人们通常说 “DUI”，而不是 “D.D.”。"}]}],"synonyms":["Doctor of Divinity","due diligence","direct debit","DUI (U.S. usage for drunk driving)"],"phonetic":"/ˌdiː ˈdiː/","extraExplanation":["“D.D.” 含义非常依赖语境：在宗教/学术名衔里常指 Doctor of Divinity；在商业文件里常指 due diligence；在银行账单里可能是 direct debit。看到 “D.D.” 时，最好结合行业、句子和周围词判断。","书写上常见为大写加句点（D.D.），也有人写作 DD。发音通常是逐字母读 “D” “D”。"]}
{"word":"D.D.S.","summary":{"en":"D.D.S. is the abbreviation for Doctor of Dental Surgery, a dental degree used after a dentist’s name.","zh":"D.D.S. 是 Doctor of Dental Surgery（牙科外科博士）的缩写，常用于牙医姓名后。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for Doctor of Dental Surgery, a professional doctoral degree for dentists (used after a person’s name).","zh":"Doctor of Dental Surgery（牙科外科博士）的缩写，是牙医常见的专业博士学位（常写在人名后）。"},"examples":[{"en":"My dentist is Alicia Chen, D.D.S.","zh":"我的牙医是Alicia Chen（陈艾丽西亚），D.D.S.（牙科外科博士）。"},{"en":"The clinic’s sign says “Robert Lee, D.D.S.”","zh":"诊所的招牌写着“Robert Lee, D.D.S.”。"}]}],"synonyms":["Doctor of Dental Surgery","D.M.D."],"phonetic":"/ˌdiːˌdiːˈɛs/","extraExplanation":["在美国，D.D.S. 和 D.M.D.（Doctor of Dental Medicine，牙科医学博士）在执业资格与课程要求上通常等同，主要差别多与学校传统命名有关。","书写格式上常用逗号加学位缩写：姓名, D.D.S.；读出来时通常逐字母读“D-D-S”。"]}
{"word":"D.F.","summary":{"en":"“D.F.” most commonly refers to Mexico City’s former federal district (Distrito Federal), but it can also mean “Dear Friend” or other terms depending on context.","zh":"“D.F.”最常见指墨西哥城旧称的联邦区（Distrito Federal），也可能表示“Dear Friend（亲爱的朋友）”等其他含义，需看语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) the Spanish abbreviation for “Distrito Federal,” formerly the official name for Mexico City’s federal district; often used to mean Mexico City.","zh":"（缩写）西班牙语“Distrito Federal（联邦区）”的缩写，曾是墨西哥城联邦区的官方名称；常用来指“墨西哥城”。"},"examples":[{"en":"She moved from Guadalajara to the D.F. for work.","zh":"她为了工作从瓜达拉哈拉搬到了D.F.（墨西哥城）。"},{"en":"I spent a week in the D.F. visiting museums and street markets.","zh":"我在D.F.待了一周，参观博物馆和逛街市。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev.) “Dear Friend,” used in informal messages or letters to address someone (less common today).","zh":"（缩写）“Dear Friend（亲爱的朋友）”，用于非正式短信或书信的称呼（如今较少见）。"},"examples":[{"en":"D.F., thanks for checking in—I'm doing better now.","zh":"D.F.，谢谢你关心——我现在好多了。"},{"en":"The note began, “D.F., I hope you’re well.”","zh":"便条开头写着：“D.F.，希望你一切都好。”"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev., context-dependent) can stand for different terms such as “Defense Force” or a degree title; the meaning depends on the field and location.","zh":"（缩写，依语境而定）也可能表示如“Defense Force（防卫部队）”或某些学位名称等；具体含义取决于领域与地区。"},"examples":[{"en":"He served in the DF for two years.","zh":"他在DF（某防卫部队）服役了两年。"},{"en":"In this document, “DF” is defined in the list of abbreviations.","zh":"在这份文件里，“DF”的含义在缩写表中有说明。"}]}],"synonyms":["DF","Distrito Federal","CDMX (related)"],"phonetic":"ˌdi ˈɛf","extraExplanation":["在墨西哥语境里，el D.F. 是非常常见的说法，指“墨西哥城”。2016年后官方更常用“CDMX（Ciudad de México）”，但日常口语里仍有人说 D.F.。","英文里缩写有时写作“DF”或“D.F.”；是否加点取决于写作风格。若不确定含义，最安全的做法是看上下文或查原文是否有缩写表（abbreviations list）。"]}
{"word":"D.F.C.","summary":{"en":"D.F.C. most commonly means “Distinguished Flying Cross,” a military medal for exceptional service or bravery in aerial flight; it can also be other initials depending on context.","zh":"D.F.C. 最常指“Distinguished Flying Cross（杰出飞行十字勋章）”，用于表彰空中飞行中的卓越功绩或英勇行为；也可能是其他名称的缩写，需结合上下文判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Distinguished Flying Cross: a military decoration awarded for heroism or extraordinary achievement while participating in aerial flight (especially in the U.S. and the U.K.).","zh":"（军）杰出飞行十字勋章：授予在航空飞行中表现英勇或取得卓越功绩者的军事勋章（尤见于美国和英国）。"},"examples":[{"en":"She was awarded the D.F.C. for rescuing civilians during an air mission.","zh":"她因在一次空中任务中营救平民而被授予 D.F.C.。"},{"en":"His service record notes “D.F.C.” among his wartime honors.","zh":"他的服役档案在战争时期的荣誉中注明了“D.F.C.”。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation that can also stand for other things depending on context (for example, a company name, an organization, or a sports club); you usually need surrounding text to know the intended meaning.","zh":"在不同语境下也可能代表其他含义的缩写（如公司名、机构名或体育俱乐部等）；通常需要上下文才能确定具体所指。"},"examples":[{"en":"What does D.F.C. mean in this document?","zh":"在这份文件里 D.F.C. 是什么意思？"},{"en":"The initials D.F.C. here refer to a local football club, not the medal.","zh":"这里的 D.F.C. 指的是本地的足球俱乐部，而不是勋章。"}]}],"synonyms":["DFC","Distinguished Flying Cross"],"phonetic":"ˌdiː ɛf ˈsiː","extraExplanation":["在英语里带点号的缩写（D.F.C.）常见于正式写作或历史材料，读作逐个字母（D-F-C）。也有人不加点写成 DFC。","作为勋章名称时，D.F.C. 最常指“Distinguished Flying Cross”。英国与美国都使用该名称，但具体设立时间、授予对象与制度细节有所不同；阅读传记/战争史时可结合国家与年代判断。"]}
{"word":"D.J.","summary":{"en":"D.J. usually means a disc jockey (DJ), someone who plays recorded music for an audience; it can also be a person’s initials.","zh":"D.J.通常指“唱片骑师/ DJ”，为观众播放录制音乐的人；也可用作人名首字母。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a disc jockey: someone who selects and plays recorded music for an audience, especially on the radio or at parties/clubs; often also speaks to the crowd.","zh":"（电台或派对/夜店的）唱片骑师、DJ：为观众挑选并播放录制音乐的人，常常也会与观众互动讲话。"},"examples":[{"en":"The D.J. played dance music all night.","zh":"DJ整晚都在放舞曲。"},{"en":"We hired a D.J. for the wedding reception.","zh":"我们为婚礼晚宴请了一位DJ。"},{"en":"The radio D.J. introduced the next song.","zh":"电台DJ介绍了下一首歌。"}]},{"partOfSpeech":"n.","definition":{"en":"used as initials for a person’s name (for example, someone named David James).","zh":"用作人名的首字母缩写（例如名叫David James的人可写作D.J.）。"},"examples":[{"en":"D.J. said he would arrive at 8 p.m.","zh":"D.J.说他会在晚上八点到。"},{"en":"My friend D.J. is great at basketball.","zh":"我的朋友D.J.篮球打得很棒。"}]}],"synonyms":["DJ","disc jockey","radio host (context-dependent)"],"phonetic":"/ˈdiːˌdʒeɪ/","extraExplanation":["“DJ”来自“disc jockey”。早期在电台播放黑胶唱片（disc），主持人像“骑师（jockey）”一样熟练操控播放流程，因此得名。后来DJ文化在派对、夜店、嘻哈与电子音乐场景中发展出“打碟、混音、带动气氛”等更广义的工作内容。","写法上常见“DJ”（不加点）和“D.J.”（带点）两种；现代媒体与海报更常用“DJ”。"]}
{"word":"D.O.","summary":{"en":"D.O. most commonly means a U.S. physician (Doctor of Osteopathic Medicine). In science, it can also mean dissolved oxygen in water.","zh":"D.O. 最常指美国的医生头衔之一：整骨医学博士；在科学领域也可指水中的溶解氧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbrev.) Doctor of Osteopathic Medicine: a fully licensed physician in the U.S. who can practice medicine and surgery, similar to an M.D., with additional training that emphasizes the body’s musculoskeletal system and hands-on diagnosis/treatment.","zh":"（缩写）整骨医学博士：美国的正式执业医师学位与头衔之一，可行医与手术，类似 M.D.（医学博士），并额外强调肌肉骨骼系统与手法诊疗。"},"examples":[{"en":"My primary care doctor is a D.O., and she also does hands-on treatment for back pain.","zh":"我的家庭医生是 D.O.，她也会用手法治疗背痛。"},{"en":"After his name badge, it says “Jordan Lee, D.O.”","zh":"他的胸牌名字后面写着“Jordan Lee, D.O.”"}]},{"partOfSpeech":"n.","definition":{"en":"(abbrev., science/medicine) dissolved oxygen: the amount of oxygen mixed into water (important for fish, water quality, and lab tests).","zh":"（缩写，科学/医学）溶解氧：溶在水中的氧气含量（与鱼类生存、水质与实验检测有关）。"},"examples":[{"en":"Low D.O. levels can stress fish in a pond.","zh":"池塘里的溶解氧（D.O.）过低会让鱼受压。"},{"en":"We measured the river’s D.O. every morning.","zh":"我们每天早上测量河水的溶解氧（D.O.）。"}]}],"synonyms":["osteopathic doctor","Doctor of Osteopathic Medicine","DO","dissolved oxygen"],"phonetic":"ˌdiː ˈoʊ","extraExplanation":["在美国语境里，D.O. 和 M.D. 都是“医生”。D.O. 学校通常会额外训练一种称为 OMM/OMT 的手法评估与治疗（例如针对肌肉与关节的操作），但他们同样可以开药、做手术、进入各科住院医师训练。","写法上既可写 D.O. 也可写 DO；放在姓名后面表示头衔（如 “Alex Chen, D.O.”）。读音常说成字母音 “D-O”。"]}
{"word":"D.O.A.","summary":{"en":"D.O.A. most commonly means “dead on arrival,” and informally can mean “doomed from the start.”","zh":"D.O.A. 最常指“到达时已死亡（dead on arrival）”，口语中也可引申为“从一开始就注定失败”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person, especially in medical or police reports) dead when arriving at a hospital or scene; dead on arrival.","zh":"（尤用于医疗或警方记录）到达医院或现场时已死亡的；到达时死亡（dead on arrival）。"},"examples":[{"en":"The patient was pronounced D.O.A. at the emergency room.","zh":"病人到急诊室时被宣布为 D.O.A.（到达时已死亡）。"},{"en":"Police said the victim was D.O.A. when officers arrived.","zh":"警方表示，警员到达时受害者已 D.O.A.（到达时死亡）。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal, figurative) already failed or certain to fail from the start.","zh":"（非正式，引申）从一开始就注定失败的；一上来就“凉了”的。"},"examples":[{"en":"Without funding, the proposal was D.O.A.","zh":"没有资金支持，这个提案从一开始就注定失败（D.O.A.）。"},{"en":"Their plan sounded D.O.A. the moment they explained it.","zh":"他们一解释，我就觉得这个计划一开始就 D.O.A.（没戏）。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or case described as “dead on arrival.”","zh":"被描述为“到达时已死亡（dead on arrival）”的人（或病例）。"},"examples":[{"en":"The report listed two D.O.A.s from the crash.","zh":"报告列出事故中有两名 D.O.A.（到达时已死亡者）。"}]}],"synonyms":["dead on arrival","lifeless on arrival","doomed","a lost cause"],"phonetic":"/ˌdiː.oʊˈeɪ/","extraExplanation":["D.O.A. 是缩写，最常见对应 dead on arrival，常见于急救、医院、警方通报等正式语境。用于真实死亡事件时较敏感，日常聊天里用作“注定失败”时要注意场合，避免让人联想到悲剧。","书面上可写作 DOA 或 D.O.A.；读音通常按字母读。"]}
{"word":"D.O.M.","summary":{"en":"D.O.M. is an abbreviation that most commonly means “Document Object Model” in web development; it can also mean “Date of Manufacture” or “Day of Month,” depending on context.","zh":"D.O.M. 是缩写，最常见于网页开发中表示“文档对象模型”；也可能指“生产日期”或“几号”，需结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(computing) Document Object Model: a standard way to represent and interact with a web page’s structure (HTML/XML) as a tree of objects, so scripts (like JavaScript) can read or change it.","zh":"（计算机）文档对象模型：用“对象树”的方式表示网页（HTML/XML）结构的标准，让脚本（如 JavaScript）可以读取或修改页面。"},"examples":[{"en":"JavaScript can change the DOM to update the page without reloading.","zh":"JavaScript 可以修改 DOM，让页面不刷新也能更新内容。"},{"en":"This button is missing because it was removed from the DOM.","zh":"这个按钮不见了，因为它被从 DOM 中移除了。"}]},{"partOfSpeech":"other","definition":{"en":"(religion, history) Dominican Order (often written O.P.; sometimes referred to as D.O.M. in older contexts): a Catholic religious order founded in the 1200s, also called the Order of Preachers.","zh":"（宗教/历史）多明我会（又称“传道会”）：天主教的一个修会，成立于 13 世纪。某些旧资料里可能见到 D.O.M. 的相关写法/指称。"},"examples":[{"en":"Some medieval texts mention the Dominican Order’s schools and preaching.","zh":"一些中世纪文本会提到多明我会的学校与传教活动。"}]},{"partOfSpeech":"other","definition":{"en":"(manufacturing, labeling) Date of Manufacture: the date something was made (seen on product labels or serial-number information).","zh":"（制造/标签）生产日期：产品的制造日期（常见于标签或序列号信息）。"},"examples":[{"en":"Check the DOM on the package to make sure it’s not an old batch.","zh":"查看包装上的 DOM（生产日期），确认不是旧批次。"},{"en":"The warranty starts from the DOM printed on the label.","zh":"保修期从标签上印的 DOM（生产日期）开始计算。"}]},{"partOfSpeech":"other","definition":{"en":"(date writing) Day of month: the number of the day in a date (e.g., 13 in Feb 13).","zh":"（日期写法）日（号）：日期中的“几号”（例如 2 月 13 日里的 13）。"},"examples":[{"en":"Enter your birth date as month, DOM, and year.","zh":"请输入生日：月份、日（DOM）和年份。"}]}],"synonyms":["DOM","Document Object Model","Date of Manufacture","Day of Month"],"phonetic":"ˌdiː oʊ ˈɛm","extraExplanation":["“D.O.M.”是缩写，具体含义高度依赖语境：在网页/编程里几乎总是“Document Object Model”；在产品标签或质量文件里常指“Date of Manufacture（生产日期）”；在表格/数据库的日期字段里可能指“Day of Month（几号）”。如果你告诉我你看到它的场景（网页代码、产品包装、宗教/历史文章、表格字段等），我可以帮你锁定最准确的意思与用法。"]}
{"word":"D.P.","summary":{"en":"D.P. most commonly means Director of Photography (DP) in film/TV; it can also stand for other terms depending on context.","zh":"D.P. 最常见指影视中的摄影指导（Director of Photography/DP）；也可能在不同语境中代表其他含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(film/TV) Abbreviation for Director of Photography; the person responsible for the camera and lighting choices that shape the look of a movie or show.","zh":"（影视）“Director of Photography（摄影指导）”的缩写；负责镜头与灯光等影像风格的人。"},"examples":[{"en":"The D.P. worked with the director to create a darker, more realistic style.","zh":"摄影指导（D.P.）与导演合作，打造更暗、更写实的风格。"},{"en":"Ask the D.P. about the lighting setup for this scene.","zh":"问问摄影指导这场戏的灯光布置。"}]},{"partOfSpeech":"n.","definition":{"en":"A written abbreviation used in some contexts for other terms (meaning depends on the field), such as data processing or (in politics) Democratic Party.","zh":"在不同领域可表示不同含义的缩写（需看语境），例如“data processing（数据处理）”或政治语境中的“Democratic Party（民主党）”。"},"examples":[{"en":"The report lists D.P. requirements for the new system (data processing).","zh":"报告列出了新系统的数据处理（D.P.）需求。"},{"en":"In this article, D.P. refers to the Democratic Party.","zh":"在这篇文章里，D.P. 指民主党。"}]}],"synonyms":["DP","Director of Photography","cinematographer (often used similarly)"],"phonetic":"/ˌdiː ˈpiː/","extraExplanation":["“D.P.”最常见于英语影视行业，通常也写作“DP”（不加句点）。正式片尾字幕里常见“Director of Photography”。","因为缩写在不同行业可能完全不同，遇到“D.P.”时最好结合上下文（例如电影拍摄、IT、政治等）来判断含义。"]}
{"word":"D.P.H.","summary":{"en":"D.P.H. most commonly refers to the degree “Doctor of Public Health.”","zh":"D.P.H. 最常见指“公共卫生博士”（Doctor of Public Health）学位。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Abbrev.) Doctor of Public Health (a professional doctoral degree in public health).","zh":"（缩写）公共卫生博士（公共卫生领域的专业博士学位）。"},"examples":[{"en":"She earned a D.P.H. and now works in disease prevention.","zh":"她获得了公共卫生博士（D.P.H.）学位，现在从事疾病预防工作。"},{"en":"The job posting preferred candidates with an M.P.H. or D.P.H.","zh":"该招聘信息优先考虑拥有公共卫生硕士（M.P.H.）或公共卫生博士（D.P.H.）的人选。"}]},{"partOfSpeech":"other","definition":{"en":"(Less common) An abbreviation that may vary by field; its meaning depends on the context (e.g., a program name, an organization, or a technical measurement).","zh":"（较少见）在不同领域可能代表不同含义；需要结合上下文判断（例如项目名称、机构名称或技术指标）。"},"examples":[{"en":"In this report, D.P.H. is defined on the first page.","zh":"在这份报告中，D.P.H. 的含义在第一页有定义。"},{"en":"Could you clarify what D.P.H. stands for in this email?","zh":"你能说明一下这封邮件里 D.P.H. 代表什么吗？"}]}],"synonyms":["DrPH","DPH"],"phonetic":"ˌdiː piː ˈeɪtʃ","extraExplanation":["在英语里，带点的缩写（如 D.P.H.）常见于学位、头衔或机构名称。不同国家/学校更常用的写法可能是 DrPH（Doctor of Public Health），也可能直接写成 DPH（不加点）。","如果你是在医疗/疫苗、工程或公司内部文件里看到 D.P.H.，含义可能不是“公共卫生博士”。最好提供一句原文或所在领域，我可以帮你准确判定。"]}
{"word":"D.P.W.","summary":{"en":"DPW usually means the Department of Public Works in the U.S., a government office that maintains roads and other public infrastructure.","zh":"DPW 通常指美国的公共工程部门（Department of Public Works），负责道路等公共基础设施与市政服务的维护。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbr.) Department of Public Works; a local government agency responsible for maintaining public infrastructure and services (roads, trash collection, snow removal, water systems, etc.).","zh":"（缩写）公共工程部门；负责维护公共基础设施与市政服务的地方政府机构（如道路维护、垃圾清运、除雪、供水系统等）。"},"examples":[{"en":"Call the DPW if there’s a fallen tree blocking the road.","zh":"如果有倒树挡路，可以打电话给公共工程部门（DPW）。"},{"en":"The DPW plows the streets early after a big snowstorm.","zh":"大暴风雪过后，公共工程部门（DPW）会很早开始铲雪清路。"},{"en":"A DPW truck was repairing the water main near our building.","zh":"一辆公共工程部门（DPW）的车在我们楼附近维修主供水管。"}]}],"synonyms":["Public Works Department","municipal services department"],"phonetic":"/ˌdiː piː ˈdʌbəl.juː/","extraExplanation":["在美国的城镇或城市里，DPW 很常见，常出现在市政车辆、路牌、公告和新闻里。不同地区 DPW 的具体职责会有差异，但通常与“道路/公共设施维护”和“市政服务”相关。","书写上常见 DPW 或 D.P.W. 两种形式；口语里一般直接读字母（“D-P-W”）。"]}
{"word":"D.S.","summary":{"en":"“D.S.” is an abbreviation read as “dee-ess.” Most often it means Doctor of Science (a doctoral degree) or Nintendo DS (a handheld game console), depending on context.","zh":"“D.S.”是缩写，读作“dee-ess”。最常见含义是 Doctor of Science（博士学位）或 Nintendo DS（任天堂掌机），具体取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"the letters “D.S.” said as an abbreviation; used in different fields with different meanings (most commonly “Doctor of Science” or “Nintendo DS,” depending on context).","zh":"“D.S.” 作为缩写读作字母音，在不同领域有不同含义（最常见的是“理学博士/博士学位”或“任天堂DS掌机”，具体看语境）。"},"examples":[{"en":"He earned a D.S. in engineering after years of research.","zh":"他经过多年研究，获得了工程领域的 D.S.（博士学位）。"},{"en":"I used to play Pokémon on my D.S. when I was a kid.","zh":"我小时候常在我的 D.S.（任天堂DS）上玩《宝可梦》。"}]},{"partOfSpeech":"n.","definition":{"en":"Doctor of Science (a doctoral degree in some universities).","zh":"Doctor of Science：部分高校使用的一种博士学位名称。"},"examples":[{"en":"Her title includes a D.S. from a European university.","zh":"她的头衔里包括一所欧洲大学授予的 D.S.（博士学位）。"}]},{"partOfSpeech":"n.","definition":{"en":"Nintendo DS (a handheld game console by Nintendo).","zh":"Nintendo DS：任天堂推出的掌上游戏机。"},"examples":[{"en":"My brother still keeps his old Nintendo D.S.","zh":"我弟弟还留着他那台旧的任天堂 D.S.。"}]},{"partOfSpeech":"adj.","definition":{"en":"in some writing/editing contexts, “D.S.” can mean “double-spaced” (typed with a blank line between lines).","zh":"在部分写作/排版语境中，“D.S.”可指 double-spaced（双倍行距）。"},"examples":[{"en":"Please submit the essay D.S. so it’s easier to read.","zh":"请用 D.S.（双倍行距）提交论文，这样更容易阅读。"}]}],"synonyms":["D.Sc. (Doctor of Science)","DS (Nintendo DS)","Ph.D. (a more common doctoral degree abbreviation)"],"phonetic":"di ˈɛs","extraExplanation":["“D.S.”非常依赖语境：在学位场景里常指 Doctor of Science；在游戏话题里多指 Nintendo DS。看到缩写时，最好结合句子主题、大小写、是否带“Nintendo”等线索判断。","不同学校对博士学位缩写不一：常见的是 Ph.D.（Doctor of Philosophy），而 D.S./D.Sc. 在某些学校或国家更常用。"]}
{"word":"D.S.C.","summary":{"en":"D.S.C. is an abbreviation with several meanings; most commonly it refers to the U.S. Distinguished Service Cross, but it can also mean digital still camera or differential scanning calorimetry depending on context.","zh":"D.S.C. 是一个多义缩写；最常见指美国“杰出服役十字勋章”，也可能指“数码静态相机”或“差示扫描量热法”，需根据语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) Distinguished Service Cross: a major U.S. military decoration for extraordinary heroism in combat (especially in the U.S. Army).","zh":"（缩写）杰出服役十字勋章：美国重要军事勋章之一，用于表彰在作战中表现出非凡英勇（尤指美国陆军）。"},"examples":[{"en":"He was awarded the D.S.C. for bravery under fire.","zh":"他因在炮火下的英勇表现而获颁 D.S.C.（杰出服役十字勋章）。"},{"en":"The museum displays a soldier’s medals, including a D.S.C.","zh":"博物馆展出了这名士兵的勋章，其中包括 D.S.C."}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) digital still camera: a camera that takes digital photos (less common today; often just called a “digital camera”).","zh":"（缩写）数码静态相机：用于拍摄数码照片的相机（如今较少用这种缩写，更常说 digital camera）。"},"examples":[{"en":"In the early 2000s, many people switched from film to a D.S.C.","zh":"在 2000 年代初，很多人从胶片相机换成了 D.S.C.（数码静态相机）。"},{"en":"This guide explains how to transfer photos from your D.S.C. to a computer.","zh":"本指南说明如何把 D.S.C. 里的照片传到电脑上。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., science) differential scanning calorimetry: a lab technique used to measure how materials absorb or release heat as temperature changes.","zh":"（缩写，理科）差示扫描量热法：一种实验室技术，用于测量材料在温度变化时吸放热的情况。"},"examples":[{"en":"They used D.S.C. to study the melting point of the polymer.","zh":"他们用 D.S.C. 来研究该聚合物的熔点。"},{"en":"The report includes D.S.C. curves for each sample.","zh":"报告包含每个样品的 D.S.C. 曲线。"}]}],"synonyms":["DSC"],"phonetic":"/diː ɛs siː/","extraExplanation":["“D.S.C.”是首字母缩写，具体含义高度依赖语境（军队、消费电子、材料/化学等）。在阅读时可看周围关键词：如 medal/heroism/Army 多半指勋章；camera/photo 指相机；polymer/melting point/curve 指量热分析。","书写上常见两种形式：带点的“D.S.C.”和不带点的“DSC”，不同机构/国家习惯不同。口语里通常按字母念“D-S-C”。"]}
{"word":"D.S.M.","summary":{"en":"D.S.M. (more commonly written DSM) is an abbreviation; most often it refers to the Diagnostic and Statistical Manual of Mental Disorders, but it can also mean District Sales Manager or certain tech terms depending on context.","zh":"D.S.M.（更常写作 DSM）是缩写；最常指《精神障碍诊断与统计手册》，也可能根据语境表示“区域销售经理”或某些科技术语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abbreviation for the Diagnostic and Statistical Manual of Mental Disorders (a reference book used by mental-health professionals to describe and classify mental disorders).","zh":"《精神障碍诊断与统计手册》（精神健康专业人士用来描述并分类精神障碍的参考手册）的缩写。"},"examples":[{"en":"The therapist explained that the diagnosis follows the DSM criteria.","zh":"治疗师解释说，这个诊断是依据 DSM 的标准。"},{"en":"In many classes, students learn how the DSM organizes different disorders.","zh":"在很多课程里，学生会学习 DSM 如何把不同的障碍进行分类。"}]},{"partOfSpeech":"n.","definition":{"en":"an abbreviation for District Sales Manager (a manager responsible for sales in a specific region).","zh":"区域销售经理（负责某个地区销售工作的经理）的缩写。"},"examples":[{"en":"Our DSM will visit the store next week to review sales results.","zh":"我们的区域销售经理下周会来店里查看销售结果。"},{"en":"She was promoted from sales rep to DSM after two strong years.","zh":"她连续两年业绩很强，从销售代表升职为区域销售经理。"}]},{"partOfSpeech":"n.","definition":{"en":"an abbreviation for Direct Stream Memory (a type of computer memory interface).","zh":"直接流内存（计算机中的一种内存接口/技术）的缩写。"},"examples":[{"en":"Some older servers used DSM to connect storage and memory more efficiently.","zh":"一些较旧的服务器使用 DSM 来更高效地连接存储与内存。"}]}],"synonyms":["DSM"],"phonetic":"/ˌdiːˌɛsˈɛm/","extraExplanation":["“D.S.M.”更常见的写法是“DSM”（不加点）。在心理学/精神医学语境里，DSM通常默认指《精神障碍诊断与统计手册》；在商业邮件或组织架构里，DSM也可能指“区域销售经理”。如果你能提供出现它的句子或领域（医学、职场、科技等），我可以帮你锁定最准确的含义。"]}
{"word":"D.S.O.","summary":{"en":"D.S.O. usually means the Distinguished Service Order, a British military medal for distinguished combat leadership.","zh":"D.S.O. 通常指英国“杰出服务勋章”，用于表彰战斗中的杰出领导与服役表现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbr.) Distinguished Service Order: a British military decoration awarded for distinguished leadership and service in combat, traditionally to army officers (and later to other ranks). People who receive it may use the letters “DSO” after their name.","zh":"（缩写）英国“杰出服务勋章”：英国军功勋章之一，用于表彰在战斗中的杰出领导与服役表现。获授者姓名后可加写“DSO”。"},"examples":[{"en":"He was awarded the D.S.O. for bravery and leadership during the campaign.","zh":"他因在那次战役中的英勇与领导力而获授 D.S.O.（杰出服务勋章）。"},{"en":"Captain James Smith, D.S.O., later wrote a memoir about the war.","zh":"詹姆斯·史密斯上尉（D.S.O.）后来写了关于那场战争的回忆录。"}]}],"synonyms":["Distinguished Service Order","DSO"],"phonetic":"/ˌdiː ɛs ˈoʊ/","extraExplanation":["在英式英语中，这个缩写常写作“DSO”或带点的“D.S.O.”，属于“荣誉称号后缀”（post-nominal letters），常见于正式文件、人物传记、军史写作中。","它是英国的勋章体系之一，设立于一战前后时期；学习阅读战争题材作品或历史资料时，看到姓名后跟“DSO”通常表示该人物受过此勋章。"]}
{"word":"D.V.","summary":{"en":"“D.V.” usually means “God willing” (Latin *Deo volente*), used when talking about future plans with uncertainty.","zh":"“D.V.”通常表示“若上帝愿意/若天意允许”（拉丁语 *Deo volente*），用于谈未来计划时表达不确定性。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) the letters “D.V.”, most commonly short for Latin *Deo volente*, meaning “God willing” or “if it is God’s will.” It’s used to express hope that something will happen in the future, but with the understanding that it depends on factors beyond human control.","zh":"（缩写）“D.V.”两个字母，最常见是拉丁语 *Deo volente* 的缩写，意思是“若上帝愿意 / 若天意允许（God willing）”。用来表示对未来事情的期望，但也承认结果不完全由人掌控。"},"examples":[{"en":"We will meet again next summer, D.V.","zh":"若上帝愿意，我们明年夏天再见。"},{"en":"The repair should be finished by Friday, D.V.","zh":"如果顺利（若天意允许），维修应该在周五前完成。"}]}],"synonyms":["God willing","if all goes well","hopefully","Inshallah (similar idea in Arabic)"],"phonetic":"/ˌdiːˈviː/","extraExplanation":["“D.V.”来自拉丁语 *Deo volente*（直译“上帝愿意”）。在较传统或宗教色彩较强的英语写作中，尤其是书信、日记或较旧的文本里更常见；现代日常口语里多用 “hopefully / if all goes well / God willing”。","在不同语境里“D.V.”也可能代表别的缩写（如姓名、机构名等），需要看上下文判断；但在表示“若上帝愿意”的用法中，通常出现在谈未来计划的句末。"]}
{"word":"D.V.M.","summary":{"en":"D.V.M. means Doctor of Veterinary Medicine, the professional degree for veterinarians, and it can also refer to a veterinarian as a title.","zh":"D.V.M. 指“兽医学博士”，是兽医的专业学位，也可作为姓名后的头衔来指一位兽医。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Doctor of Veterinary Medicine: a professional doctoral degree for veterinarians (animal doctors).","zh":"兽医学博士：兽医（动物医生）的专业博士学位。"},"examples":[{"en":"She earned her D.V.M. from a university in California.","zh":"她在加州的一所大学获得了兽医学博士（D.V.M.）学位。"},{"en":"The program trains students to diagnose and treat animals after they receive the D.V.M.","zh":"该项目在学生获得D.V.M.学位后，训练他们为动物进行诊断和治疗。"}]},{"partOfSpeech":"n.","definition":{"en":"A veterinarian (animal doctor), especially when used as a title after someone’s name.","zh":"兽医（动物医生），尤其指在姓名后作为头衔使用时。"},"examples":[{"en":"Please contact Maria Chen, D.V.M., for pet health questions.","zh":"如有宠物健康问题，请联系兽医 Maria Chen（D.V.M.）。"},{"en":"Our clinic’s D.V.M. will see your dog this afternoon.","zh":"我们诊所的兽医（D.V.M.）今天下午会为你的狗看诊。"}]}],"synonyms":["veterinarian","vet","Doctor of Veterinary Medicine","V.M.D."],"phonetic":"/di vi ˈɛm/","extraExplanation":["D.V.M. 是美国最常见的“兽医专业博士”缩写，通常写在姓名后（如：Alex Rivera, D.V.M.）。在一些国家或地区也可能看到同等学位缩写如 V.M.D.（常见于宾夕法尼亚大学），含义与 D.V.M. 基本相同。","读法常按字母读：“D-V-M”。在正式写作中一般带点号（D.V.M.），但也常见不带点号（DVM）。"]}
{"word":"D/A","summary":{"en":"D/A most commonly means “digital-to-analog” (signal conversion). In some business documents, it can also mean “days after.”","zh":"D/A最常见指“数模（digital-to-analog）”转换；在部分商务文件中也可指“……天后（days after）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) Digital-to-analog: relating to the conversion of digital signals/data into an analog (continuous) signal.","zh":"（缩写）数模：指把数字信号/数据转换为模拟（连续）信号。"},"examples":[{"en":"This speaker has a built-in D/A converter (DAC) for better sound quality.","zh":"这款音箱内置数模转换器（DAC），音质更好。"},{"en":"The audio interface handles A/D and D/A conversion.","zh":"这块音频接口负责模数（A/D）和数模（D/A）转换。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) Days after: used in shipping, finance, or contracts to mean a number of days after a specific event/date (often seen as “30 D/A,” etc.).","zh":"（缩写）……天后：用于航运、金融或合同中，表示在某个事件/日期之后的若干天（常见如“30 D/A”等）。"},"examples":[{"en":"Payment terms: 30 D/A from the invoice date.","zh":"付款条件：自发票日期起30天后付款（30 D/A）。"},{"en":"The contract says delivery is due 10 D/A after approval.","zh":"合同写明：批准后10天内（10 D/A）交付。"}]}],"synonyms":["DAC (digital-to-analog converter)","digital-to-analog"],"phonetic":"/ˌdiˈeɪ/","extraExplanation":["“D/A”在工程与音频领域最常见，通常直接说成“D-A”，也常写作“DAC”（digital-to-analog converter，数模转换器）。\n在合同/物流语境里，“D/A”表示“days after”，但不同公司可能有更常用的写法（如“days after date / days after sight”等），正式文件里最好对照条款定义确认含义。"]}
