{"word":"DC","summary":{"en":"“DC” is a common abbreviation meaning Washington, D.C., direct current (electricity), or DC Comics (Detective Comics).","zh":"“DC”常见含义包括：华盛顿特区、直流电，以及DC漫画（Detective Comics）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) Washington, D.C.; the capital city of the United States (District of Columbia).","zh":"（缩写）华盛顿特区；美国首都（哥伦比亚特区）。"},"examples":[{"en":"I’m flying to DC for a conference next week.","zh":"我下周要飞去DC参加会议。"},{"en":"DC has many free museums, like the Smithsonian.","zh":"DC有很多免费博物馆，比如史密森学会的博物馆群。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev.) direct current: electric current that flows in one direction (often used with batteries and electronics).","zh":"（缩写）直流电：电流沿一个方向流动（常见于电池和电子设备）。"},"examples":[{"en":"This charger outputs 5V DC.","zh":"这个充电器输出5伏直流电。"},{"en":"Most batteries provide DC power.","zh":"大多数电池提供直流电。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev.) Detective Comics: a U.S. comic-book publisher/brand best known for Batman (often seen as “DC Comics”).","zh":"（缩写）侦探漫画（Detective Comics）：美国漫画出版社/品牌，以蝙蝠侠等作品闻名（常见说法为“DC Comics”）。"},"examples":[{"en":"Batman is a DC character.","zh":"蝙蝠侠是DC的角色。"},{"en":"She collects DC Comics graphic novels.","zh":"她收藏DC漫画的图像小说。"}]}],"synonyms":["Washington, D.C.","District of Columbia","direct current","DC Comics"],"phonetic":"/ˌdiːˈsiː/","extraExplanation":["“DC”作为“华盛顿特区”时，口语里常直接说“D.C.”或“DC”，写作中也常见“Washington, D.C.”来避免与美国的华盛顿州（Washington State）混淆。","“DC”表示“直流电”时，经常与“AC（交流电）”对比出现：AC=alternating current。","“DC（漫画）”在品牌语境里常写作“DC Comics”。在日常对话里说“DC”通常也能被理解为该漫画公司。"]}
{"word":"dc","summary":{"en":"“DC” most commonly means Washington, D.C. (the U.S. capital). It can also mean direct current in electricity, or DC Comics.","zh":"“DC”最常指华盛顿特区（美国首都）。也可指电学中的直流电，或 DC 漫画公司。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Washington, D.C.; the capital city of the United States (the “D.C.” stands for “District of Columbia”).","zh":"华盛顿特区；美国首都（D.C. 是 “District of Columbia / 哥伦比亚特区” 的缩写）。"},"examples":[{"en":"I’m traveling to D.C. for a school trip.","zh":"我要去华盛顿特区参加学校旅行。"},{"en":"She works for the government in D.C.","zh":"她在华盛顿特区为政府工作。"}]},{"partOfSpeech":"n.","definition":{"en":"Direct current; an electric current that flows in one direction (opposite of AC).","zh":"直流电；电流沿一个方向流动（与交流电 AC 相对）。"},"examples":[{"en":"This flashlight runs on DC power from batteries.","zh":"这个手电筒靠电池提供的直流电供电。"},{"en":"Many laptops use DC from an adapter.","zh":"很多笔记本电脑通过适配器使用直流电。"}]},{"partOfSpeech":"n.","definition":{"en":"DC Comics; a major American comic-book publisher (known for Batman, Superman, etc.).","zh":"DC 漫画；美国大型漫画出版公司（以蝙蝠侠、超人等著名）。"},"examples":[{"en":"He’s a big fan of DC superheroes.","zh":"他是 DC 超级英雄的铁杆粉丝。"},{"en":"Batman is a character from DC Comics.","zh":"蝙蝠侠是 DC 漫画里的角色。"}]}],"synonyms":["Washington, D.C.","District of Columbia","direct current"],"phonetic":"/ˌdiːˈsiː/","extraExplanation":["书写上常见两种形式：D.C.（带句点，更正式）和 DC（更简洁，常用于标题、品牌名或科技语境）。在表示美国首都时，完整说法是 “Washington, D.C.”，用来和美国的华盛顿州（Washington State）区分。","在电学里，DC 通常与 AC（alternating current，交流电）成对出现：电池输出一般是 DC，而家庭插座供电多为 AC。"]}
{"word":"DCA","summary":{"en":"DCA most commonly means the airport code for Ronald Reagan Washington National Airport; it can also mean dollar-cost averaging in investing, or a deferred compensation agreement in workplace benefits.","zh":"DCA最常见指罗纳德·里根华盛顿国家机场的机场代码；也可指投资中的DCA定投（平均成本法），或职场福利中的递延薪酬协议（视机构而定）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) Ronald Reagan Washington National Airport (IATA airport code), serving Washington, D.C.","zh":"（缩写）罗纳德·里根华盛顿国家机场的三字代码（IATA），服务美国首都华盛顿特区。"},"examples":[{"en":"My flight lands at DCA at 6 p.m.","zh":"我的航班晚上6点降落在DCA。"},{"en":"DCA is closer to downtown than IAD.","zh":"DCA比IAD更靠近市中心。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev., finance) dollar-cost averaging: investing a fixed amount regularly to reduce the impact of market ups and downs.","zh":"（缩写，金融）定投／平均成本法：定期投入固定金额，以降低市场波动带来的影响。"},"examples":[{"en":"She uses DCA to invest in index funds every month.","zh":"她每月用DCA（定投）买指数基金。"},{"en":"DCA can help you avoid trying to time the market.","zh":"DCA可以帮助你避免去“择时”踩点市场。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev.) Used in some workplaces for “Deferred Compensation Agreement/Arrangement,” a plan to receive part of your pay later (meaning varies by organization).","zh":"（缩写）在一些公司/机构中指“递延薪酬协议/安排”，把部分收入延后领取（不同组织含义可能不同）。"},"examples":[{"en":"Ask HR what DCA means in your benefits package.","zh":"问问人力资源，你们福利方案里的DCA具体指什么。"},{"en":"He signed a DCA as part of his executive compensation.","zh":"他在高管薪酬中签了一份DCA（递延薪酬安排）。"}]}],"synonyms":["Reagan National (airport)","Washington National Airport","dollar-cost averaging","D.C. airport code"],"phonetic":"/ˌdiː siː ˈeɪ/","extraExplanation":["“DCA”是缩写，实际含义高度依赖语境。旅行/机票语境里几乎总是指华盛顿国家机场；投资理财语境里常指“定投（dollar-cost averaging）”。看到DCA时，建议结合句子主题（航班、机场、基金、福利等）来判断。"]}
{"word":"dca","summary":{"en":"“DCA” is an abbreviation most commonly meaning dollar-cost averaging (regular investing), and it can also refer to Reagan National Airport (code DCA) or certain audio equipment terms.","zh":"“DCA”是一个缩写，最常见指投资中的定期定额/平均成本法；也可指里根国家机场（代码DCA）或某些音频设备术语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) dollar-cost averaging: an investment strategy of investing a fixed amount of money at regular times, regardless of price, to reduce the impact of market ups and downs.","zh":"（缩写）定期定额投资/平均成本法：不管价格涨跌，按固定周期投入固定金额，以降低市场波动对买入成本的影响。"},"examples":[{"en":"I use DCA to invest in index funds every month.","zh":"我用DCA的方式每月定投指数基金。"},{"en":"With DCA, you buy more shares when prices are low and fewer when prices are high.","zh":"用DCA时，价格低会买到更多份额，价格高则买到更少。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) Ronald Reagan Washington National Airport (IATA code: DCA), an airport near Washington, D.C.","zh":"（缩写）罗纳德·里根华盛顿国家机场（IATA机场代码：DCA），位于美国首都华盛顿附近。"},"examples":[{"en":"My flight arrives at DCA at 6 p.m.","zh":"我的航班下午6点到达DCA。"},{"en":"DCA is closer to downtown than IAD.","zh":"DCA比IAD更靠近市中心。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) In audio, DCA can mean “digitally controlled amplifier/attenuator,” a device that changes volume using digital control.","zh":"（缩写）在音频领域，DCA可指“数字控制放大器/衰减器”，用数字方式控制音量的设备。"},"examples":[{"en":"On this mixer, each DCA fader controls a group of channels.","zh":"在这台调音台上，每个DCA推子控制一组通道。"}]}],"synonyms":["dollar-cost averaging","regular investing","systematic investment plan"],"phonetic":"ˌdiː siː ˈeɪ","extraExplanation":["“DCA”是缩写，含义高度依赖语境。日常最常见的是投资里的 dollar-cost averaging（定投/平均成本法）以及机场代码 DCA（里根国家机场）。如果你告诉我你在哪个场景看到“DCA”（理财、机票、音频设备、作业/考试等），我可以给出更精准的解释和用法。"]}
{"word":"DCB","summary":{"en":"DCB is a context-dependent abbreviation; common meanings include a chemical term (dichlorobenzene) and a computing term (Data Control Block).","zh":"DCB 是一个依语境而定的缩写；常见含义包括化学领域的“二氯苯”（dichlorobenzene）以及计算机领域的“数据控制块”（Data Control Block）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation that can mean different things depending on the context (field-specific).","zh":"一个缩写，具体意思取决于语境（常见于不同专业领域）。"},"examples":[{"en":"In this report, DCB refers to a chemical used in manufacturing.","zh":"在这份报告中，DCB 指的是一种用于制造业的化学品。"},{"en":"Please define DCB the first time you use it in a document.","zh":"在文件中第一次使用 DCB 时，请先把全称写出来并说明含义。"}]},{"partOfSpeech":"other","definition":{"en":"(Chemistry) Short for dichlorobenzene, a family of chemicals used in industry (often seen on labels and safety sheets).","zh":"（化学）dichlorobenzene 的缩写，指二氯苯（一类工业化学品，常见于标签和安全资料中）。"},"examples":[{"en":"The safety sheet lists DCB as a regulated substance.","zh":"安全资料表将 DCB 列为受监管物质。"},{"en":"Workers should avoid breathing in fumes from DCB.","zh":"工人应避免吸入 DCB 的气体。"}]},{"partOfSpeech":"other","definition":{"en":"(Computing/Mainframes) Short for Data Control Block, a structure that stores information about a dataset or file.","zh":"（计算机/大型机）Data Control Block 的缩写，指“数据控制块”，用于保存数据集或文件的信息。"},"examples":[{"en":"The program reads the file using a DCB.","zh":"该程序通过 DCB 来读取文件。"},{"en":"If the DCB settings are wrong, the output may be corrupted.","zh":"如果 DCB 的设置不正确，输出可能会损坏。"}]}],"synonyms":["abbrev.","initialism","acronym"],"phonetic":"/ˌdiː siː ˈbiː/","extraExplanation":["DCB 不是一个通用日常词汇，更像“首字母缩写”。在学习或工作写作中，最好在第一次出现时写出全称（例如 dichlorobenzene 或 Data Control Block），因为不同领域的人看到 DCB 可能会理解成完全不同的东西。","如果你告诉我它出现的场景（化学品标签、论文、代码、公司内部文件等），我可以帮你锁定最可能的含义并给更贴切的例句。"]}
{"word":"dcb","summary":{"en":"“DCB/dcb” is usually an abbreviation; its meaning depends on context.","zh":"“DCB/dcb”通常是缩写；具体含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation with multiple possible meanings; without context, the intended meaning is unclear.","zh":"一个可能代表多种含义的缩写；缺少语境时无法确定具体意思。"},"examples":[{"en":"I saw “DCB” in the document, but I need more context to know what it stands for.","zh":"我在文件里看到“DCB”，但需要更多语境才能知道它代表什么。"},{"en":"In different fields, “DCB” can mean very different things.","zh":"在不同领域里，“DCB”可能有完全不同的意思。"}]}],"phonetic":"/diː siː biː/","extraExplanation":["“DCB/dcb”常见于专业或特定场景的缩写。它可能出现在商业/金融、医疗、工程、计算机等领域，但没有上下文无法可靠翻译。","你可以告诉我：你在哪里看到它（句子/截图/行业）？我就能给出准确释义、用法和相关表达。"]}
{"word":"dcbname","summary":{"en":"“dcbname” is usually a system-specific label (field/variable/username), not a common English word.","zh":"“dcbname”通常是系统/代码里的特定字段名或标识符，不是常见英语词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often seen as an identifier (e.g., a username, file name, database field, or code variable) meaning “DCB name” or “name related to DCB,” depending on the system.","zh":"不是标准英语单词；最常见于标识符（如用户名、文件名、数据库字段名或代码变量名），含义通常是“DCB 的名称/与 DCB 相关的名称”，具体取决于所在系统。"},"examples":[{"en":"Please enter your dcbname to log in.","zh":"请填写你的 dcbname 以登录。"},{"en":"The API returns dcbname as a string field in the user profile.","zh":"该 API 在用户资料中返回名为 dcbname 的字符串字段。"},{"en":"Rename the variable from dcbname to displayName for clarity.","zh":"为更清晰起见，把变量 dcbname 改名为 displayName。"}]}],"phonetic":"/ˌdiː siː ˈbiː neɪm/","extraExplanation":["“dcbname”更像是系统内部约定的缩写字段名（acronym + name）。DCB 可能代表某个组织、部门、产品、功能模块等；没有上下文无法确定它的准确含义。","如果你是在某个网站/表单/报错信息里看到它，发我完整句子或截图（可遮住隐私），我可以根据上下文帮你判断它具体指什么。"]}
{"word":"DCC","summary":{"en":"“DCC” is an abbreviation with several meanings; common ones include Data Center Consolidation (IT) and the U.S. D.C. Circuit court (law).","zh":"“DCC”是多义缩写；常见含义包括（IT）数据中心整合，以及（法律）美国 D.C. Circuit 联邦上诉法院。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Computing) Data Center Consolidation: combining multiple server rooms or data centers into fewer, more efficient sites.","zh":"（计算机）数据中心整合：把多个机房/数据中心合并为更少、更高效的地点。"},"examples":[{"en":"Our company started a DCC project to reduce power and cooling costs.","zh":"我们公司启动了数据中心整合（DCC）项目，以降低供电和制冷成本。"},{"en":"DCC often includes moving services to the cloud or to a main data center.","zh":"DCC 通常包括把服务迁移到云上或迁到一个主数据中心。"}]},{"partOfSpeech":"other","definition":{"en":"(Law, US) U.S. Court of Appeals for the District of Columbia Circuit (often written “D.C. Circuit”): a federal appeals court in Washington, D.C.","zh":"（美国法律）哥伦比亚特区联邦巡回上诉法院（常写作 D.C. Circuit）：位于华盛顿特区的联邦上诉法院。"},"examples":[{"en":"The case was appealed to the DCC / D.C. Circuit.","zh":"该案件被上诉到 DCC（D.C. Circuit）。"},{"en":"The D.C. Circuit hears many cases involving federal agencies.","zh":"D.C. Circuit 审理很多与联邦机构相关的案件。"}]},{"partOfSpeech":"other","definition":{"en":"(Finance/Banking) Demand Credit Card: a type of credit card product name used by some banks or systems (usage varies by region).","zh":"（金融/银行）即期信用卡/需求信用卡：部分银行或系统使用的产品名称（各地用法不一）。"},"examples":[{"en":"Ask the bank what “DCC” means on your statement, because it can vary.","zh":"账单上出现“DCC”时，最好问银行具体含义，因为不同地区/机构可能不一样。"}]},{"partOfSpeech":"other","definition":{"en":"(Gaming/Online) Dungeon Crawl Classics: a tabletop role-playing game title, often abbreviated as DCC.","zh":"（游戏/网络）《Dungeon Crawl Classics》：一款桌面角色扮演游戏，常简称 DCC。"},"examples":[{"en":"We’re running a DCC session this weekend.","zh":"我们这周末要跑一场 DCC 团。"}]}],"synonyms":["abbreviation","acronym"],"phonetic":"/ˌdiː siː ˈsiː/","extraExplanation":["“DCC”是缩写，具体含义高度依赖语境。你可以看它出现的场景：\n- IT/企业项目文件里：常指 Data Center Consolidation（数据中心整合）。\n- 美国法律新闻/判决书里：更可能指 D.C. Circuit（有时口头也会简称成 DCC，但更常见写法是 D.C. Circuit）。\n- 银行/刷卡相关：也可能是某些系统或产品缩写；如果你是想问刷卡“动态货币转换”，那通常写作 DCC = Dynamic Currency Conversion（动态货币转换），你可以确认一下是否指这个。"]}
{"word":"DCCO","summary":{"en":"“DCCO” is an acronym; its exact meaning depends on context (often an internal or industry abbreviation).","zh":"“DCCO”是一个首字母缩略词；确切含义取决于上下文（常见于机构内部或行业用语）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation (acronym). “DCCO” does not have one single, widely accepted meaning in general English; its meaning depends on the field (business, law, IT, etc.).","zh":"一个缩写（首字母缩略词）。“DCCO”在通用英语里没有唯一、广泛公认的固定含义；具体意思取决于使用领域（商业、法律、IT 等）。"},"examples":[{"en":"What does DCCO stand for in this document?","zh":"在这份文件里，DCCO 代表什么？"},{"en":"I saw “DCCO” in an email—can you share the context or the full sentence?","zh":"我在邮件里看到 “DCCO”——你能提供上下文或完整句子吗？"}]},{"partOfSpeech":"other","definition":{"en":"(Common in some organizations/IT) Data Center Change Order: a formal request/record to change something in a data center (equipment, configuration, cabling, etc.).","zh":"（一些组织/IT 场景常见）Data Center Change Order：数据中心变更单/变更申请，用于正式记录或申请对数据中心设备、配置、布线等的改动。"},"examples":[{"en":"Please submit a DCCO before moving any servers in the data center.","zh":"在数据中心移动任何服务器之前，请先提交一份 DCCO。"},{"en":"The DCCO was approved, so the maintenance window is confirmed.","zh":"DCCO 已获批准，因此维护时间窗口已确认。"}]},{"partOfSpeech":"other","definition":{"en":"(Sometimes in law/corrections) District Court Community Order: a court-issued community-based order (wording varies by country/region).","zh":"（有时见于法律/矫正语境）District Court Community Order：地区法院签发的社区矫正/社区管理类命令（不同国家或地区用法与措辞可能不同）。"},"examples":[{"en":"He was placed on a DCCO instead of serving jail time.","zh":"他被判处执行 DCCO，而不是入狱服刑。"},{"en":"The conditions of the DCCO include regular check-ins and community service.","zh":"该 DCCO 的条件包括定期报到和社区服务。"}]}],"synonyms":["acronym","abbreviation","initialism"],"phonetic":"/ˌdiː siː siː ˈoʊ/","extraExplanation":["“DCCO”更像是机构内部或行业缩写，而不是日常英语单词。最可靠的做法是：看它出现的领域（邮件主题、合同条款、系统工单、法院文件等），或在首次出现处找是否有括号解释（例如：DCCO (Data Center Change Order)）。","如果你把看到的完整句子/段落贴出来，我可以帮你根据上下文判断最可能的展开和中文译法。"]}
{"word":"DCCS","summary":{"en":"DCCS is a letter-by-letter abbreviation. Its meaning depends on context (often a specific system, department, or service name).","zh":"DCCS 是按字母读的缩写，具体指什么取决于语境（常见为某种系统、部门或服务名称）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation pronounced by saying the letters “D-C-C-S.” Its exact meaning depends on the field (technology, government, healthcare, etc.).","zh":"一个按字母逐个读出来的缩写（“D-C-C-S”）。具体含义取决于使用领域（科技、政府、医疗等）。"},"examples":[{"en":"What does DCCS stand for in this document?","zh":"这份文件里的 DCCS 代表什么？"},{"en":"Please define DCCS the first time you use it in a report.","zh":"请在报告中第一次使用 DCCS 时先写出全称并解释。"}]},{"partOfSpeech":"other","definition":{"en":"In IT/engineering contexts, DCCS can refer to a “Data Center Cooling System” (a system that keeps a data center’s servers from overheating).","zh":"在 IT/工程语境中，DCCS 有时指 “Data Center Cooling System”（数据中心冷却/制冷系统，用来防止服务器过热）。"},"examples":[{"en":"The DCCS was upgraded to reduce energy use in the data center.","zh":"我们升级了 DCCS，以降低数据中心的能耗。"},{"en":"If the DCCS fails, server temperatures can rise quickly.","zh":"如果 DCCS 故障，服务器温度可能会迅速上升。"}]},{"partOfSpeech":"other","definition":{"en":"In some organizations, DCCS may be used as a name for a specific department or service (for example, a local “Department/Division of Child(ren) and Community Services,” depending on region).","zh":"在某些机构里，DCCS 也可能是某个部门/服务的简称（例如各地名称不一的“儿童与社区服务部门/处”等）。"},"examples":[{"en":"She works at DCCS as a case manager.","zh":"她在 DCCS 做个案管理工作。"},{"en":"Contact DCCS for information about community support programs.","zh":"如需了解社区支持项目，请联系 DCCS。"}]}],"synonyms":["acronym","abbreviation","initialism"],"phonetic":"/ˌdiː siː siː ˈɛs/","extraExplanation":["“DCCS”这类全大写缩写在英语里非常常见，但往往没有唯一固定含义。最稳妥的做法是：在正式写作中第一次出现时写出全称（full name）并在括号里标注缩写，例如：Data Center Cooling System (DCCS)。","如果你把 DCCS 出现的句子、行业（例如：数据中心、学校、政府机构、医院）或所在国家/地区告诉我，我可以给出更准确的对应全称与用法。"]}
{"word":"DCD","summary":{"en":"DCD most commonly means Developmental Coordination Disorder; in other contexts it can stand for different technical terms.","zh":"DCD 最常见指“发展性协调障碍”；在其他语境中也可能是不同专业术语的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for Developmental Coordination Disorder, a condition that affects motor coordination (sometimes called dyspraxia in the UK).","zh":"“发展性协调障碍”的缩写，一种影响动作协调能力的状况（在英国有时也称为 dyspraxia，“运动失用/动作计划障碍”）。"},"examples":[{"en":"My son was diagnosed with DCD, so he gets extra support for handwriting and sports at school.","zh":"我儿子被诊断为 DCD，所以学校在书写和体育方面会给他额外支持。"},{"en":"Occupational therapy can help children with DCD practice everyday skills like tying shoelaces.","zh":"职业治疗可以帮助 DCD 儿童练习系鞋带等日常技能。"}]},{"partOfSpeech":"other","definition":{"en":"(less common, depends on field) an initialism used for other technical meanings; the intended meaning usually comes from the context (e.g., medicine, engineering, gaming).","zh":"（较少见，取决于领域）在不同专业里可能代表其他意思；通常需要根据上下文判断（如医学、工程、游戏等）。"},"examples":[{"en":"In this report, DCD refers to a specific device code, not the medical condition.","zh":"在这份报告里，DCD 指的是某个设备代码，而不是医学上的疾病。"},{"en":"If you see DCD in a message, check the topic or the document’s glossary.","zh":"如果你在信息里看到 DCD，先看主题或文档术语表来确认含义。"}]}],"synonyms":["Developmental Coordination Disorder","dyspraxia"],"phonetic":"/di si di/","extraExplanation":["在英语里，DCD 通常作为“首字母缩略词（initialism）”，读作每个字母的名称。医学语境中最常见的是 Developmental Coordination Disorder。","不同国家/地区用词有差异：英国日常交流中有时会用 dyspraxia 来指代相近概念，但在正式诊断和文件里常见 DCD。","如果你告诉我你在哪个场景看到 DCD（比如医学报告、学校沟通、通信/工程文档、游戏聊天等），我可以帮你锁定最准确的含义。"]}
{"word":"DCE","summary":{"en":"DCE is an abbreviation with several meanings; most commonly it refers to Data Communications Equipment in networking.","zh":"DCE是一个多义缩写；最常见的是网络领域的“数据通信设备”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Networking) Data Communications Equipment: a device (such as a modem or CSU/DSU) that connects a user’s device to a communication line and provides signal conversion/clocking.","zh":"（网络）数据通信设备：把用户设备连接到通信线路的设备（如调制解调器、CSU/DSU），并提供信号转换/时钟等功能。"},"examples":[{"en":"In a serial connection, the router is usually the DTE, and the modem is the DCE.","zh":"在串行连接中，路由器通常是DTE，而调制解调器是DCE。"},{"en":"Check the DCE end of the cable if the link has no clock signal.","zh":"如果链路没有时钟信号，检查电缆的DCE端。"}]},{"partOfSpeech":"other","definition":{"en":"(Computing, less common today) Distributed Computing Environment: a set of tools/standards for building distributed systems across networks.","zh":"（计算机，如今较少见）分布式计算环境：一套用于在网络上构建分布式系统的工具与标准。"},"examples":[{"en":"The company used DCE services to manage authentication across multiple machines.","zh":"这家公司用DCE服务来管理多台机器之间的身份验证。"},{"en":"DCE was an early approach to making networked applications work together.","zh":"DCE是早期让网络应用协同工作的方案之一。"}]},{"partOfSpeech":"other","definition":{"en":"(Science) Dichloroethane: a chemical compound often abbreviated as DCE (e.g., 1,2-dichloroethane).","zh":"（科学）二氯乙烷：一种化学物质，常缩写为DCE（如1,2-二氯乙烷）。"},"examples":[{"en":"The lab stored DCE in a ventilated cabinet for safety.","zh":"实验室为安全起见，把DCE存放在通风柜里。"},{"en":"Avoid breathing DCE vapors and follow the safety guidelines.","zh":"避免吸入DCE蒸气，并遵守安全规范。"}]},{"partOfSpeech":"other","definition":{"en":"(Research) Discrete Choice Experiment: a survey method (DCE) used to study how people choose between options with different features.","zh":"（研究）离散选择实验：一种问卷研究方法（DCE），用于分析人们在不同特征的选项之间如何做选择。"},"examples":[{"en":"They ran a DCE to learn which product features customers value most.","zh":"他们做了一个DCE来了解顾客最看重哪些产品特征。"},{"en":"In the DCE, participants chose between two service packages with different prices.","zh":"在DCE中，参与者在两个不同价格的服务套餐中做选择。"}]}],"synonyms":["data communications equipment","distributed computing environment","dichloroethane","discrete choice experiment"],"phonetic":"/ˌdiː siː ˈiː/","extraExplanation":["“DCE”是缩写，具体含义高度依赖领域与上下文：在网络设备/串口线缆语境里最常见的是“Data Communications Equipment”；在学术论文里也可能指“Discrete Choice Experiment”。如果你告诉我句子或领域（网络/化学/研究等），我可以帮你锁定最准确的释义。"]}
{"word":"DCH","summary":{"en":"DCH is an abbreviation whose meaning depends on context; it often refers to a hospital/medical system or a public-health department.","zh":"DCH 是一个依语境而定的缩写，常见指医院/医疗体系或公共卫生部门。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An initialism used in names of hospitals or medical systems (for example, a regional medical center). The exact meaning depends on the organization.","zh":"常见于医院或医疗体系名称中的缩写（例如某地区医疗中心）。具体含义取决于机构。"},"examples":[{"en":"She was taken to DCH for emergency care.","zh":"她被送到 DCH 接受急救。"},{"en":"DCH announced new visiting hours.","zh":"DCH 公布了新的探视时间。"}]},{"partOfSpeech":"other","definition":{"en":"An initialism that can also stand for a government or public-health office in some places (for example, a Department of Community Health). Meaning varies by location.","zh":"在一些地区也可指政府或公共卫生机构的缩写（例如“社区健康部”）。含义因地区而异。"},"examples":[{"en":"The DCH released updated vaccination guidelines.","zh":"DCH 发布了更新后的疫苗接种指南。"},{"en":"Check the DCH website for local health alerts.","zh":"查看 DCH 网站了解本地健康提醒。"}]}],"synonyms":["abbreviation","initialism","acronym (general)"],"phonetic":"/diː siː eɪtʃ/","extraExplanation":["“DCH”不是一个固定词义的单词，而是字母缩写（initialism）。在阅读或写作时，通常需要在第一次出现时把全称写出来（例如：DCH Regional Medical Center），之后再用 DCH。","如果你告诉我你看到 DCH 的场景（医院名称、文件标题、聊天语境、国家/城市），我可以帮你锁定最可能的全称与含义。"]}
{"word":"DChE","summary":{"en":"DChE is an abbreviation most often meaning “Doctor of Chemical Engineering,” and sometimes “Department/Division of Chemical Engineering,” depending on context.","zh":"DChE 通常是“化学工程博士”的缩写，也可能指“化学工程系/学院”，需根据语境判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbr.) Doctor of Chemical Engineering: a professional doctoral degree in chemical engineering (less common than a PhD).","zh":"（缩写）化学工程博士：化学工程领域的一种职业型博士学位（不如 PhD 常见）。"},"examples":[{"en":"She earned a DChE after several years of industry research.","zh":"她在进行多年行业研究后获得了化学工程博士（DChE）。"},{"en":"The program offers a DChE focused on applied chemical-process design.","zh":"该项目提供侧重应用化工过程设计的 DChE 学位。"}]},{"partOfSpeech":"n.","definition":{"en":"(abbr., context-dependent) Department (or Division) of Chemical Engineering, especially in university documents.","zh":"（缩写，依语境而定）化学工程系/化学工程学院（常见于高校文件）。"},"examples":[{"en":"Please submit the form to the DChE office by Friday.","zh":"请在周五前把表格交到化学工程系（DChE）办公室。"},{"en":"He works at DChE, University of X.","zh":"他在 X 大学的化学工程系（DChE）工作。"}]}],"synonyms":["Doctor of Chemical Engineering","Department of Chemical Engineering","Division of Chemical Engineering"],"phonetic":"/ˌdiːˌsiːˌeɪtʃˈiː/","extraExplanation":["“DChE”并不是全球统一的标准缩写：在不同国家/学校，可能指学位（Doctor of Chemical Engineering），也可能指院系（Department/Division of Chemical Engineering）。判断含义时重点看上下文：出现“earned/degree/program”等多半是学位；出现“office/department/at DChE”等多半是院系。","如果你是在求职或申请材料里写学位，最好第一次出现时写全称：Doctor of Chemical Engineering (DChE)，避免被误解为院系名称。"]}
{"word":"DCI","summary":{"en":"DCI is an abbreviation that most often means Drum Corps International, but it can also mean Detective Chief Inspector (UK police) or data center infrastructure (IT).","zh":"DCI 是一个缩写，最常见指 Drum Corps International（国际鼓号军团协会）；也可能指英国警衔 Detective Chief Inspector，或 IT 中的数据中心基础设施。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in music/performing arts) an abbreviation for Drum Corps International, a U.S. organization and competition circuit for marching drum corps.","zh":"（尤用于音乐/表演艺术）“Drum Corps International（国际鼓号军团协会）”的缩写；美国行进打击乐/鼓号军团的组织与赛事体系。"},"examples":[{"en":"My cousin marched in a DCI corps last summer.","zh":"我表哥去年夏天参加了一个 DCI 鼓号军团巡演。"},{"en":"DCI finals are held every August.","zh":"DCI 总决赛通常在每年八月举行。"}]},{"partOfSpeech":"n.","definition":{"en":"(UK) an abbreviation for Detective Chief Inspector, a senior rank in British police forces.","zh":"（英式）“Detective Chief Inspector（刑侦总督察/高级刑警督察）”的缩写；英国警队中的较高警衔。"},"examples":[{"en":"The DCI led the investigation into the missing person case.","zh":"这位 DCI 负责领导失踪人口案件的调查。"},{"en":"In many British crime dramas, a DCI is the main investigator.","zh":"在许多英式犯罪剧里，DCI 常是主办案件的主要调查官。"}]},{"partOfSpeech":"n.","definition":{"en":"a common abbreviation in technology/business for “data center infrastructure,” meaning the physical and digital systems that run a data center (power, cooling, servers, networking, etc.).","zh":"（科技/商业常用）“data center infrastructure（数据中心基础设施）”的缩写；指支撑数据中心运行的软硬件系统（供电、制冷、服务器、网络等）。"},"examples":[{"en":"We’re upgrading our DCI to improve reliability.","zh":"我们正在升级数据中心基础设施，以提高可靠性。"},{"en":"The report reviews DCI costs such as cooling and power.","zh":"报告评估了数据中心基础设施成本，比如制冷和供电。"}]}],"synonyms":["an acronym","an abbreviation"],"phonetic":"/ˌdiː siː ˈaɪ/","extraExplanation":["“DCI”是高度多义的缩写，在不同领域含义差别很大。常见场景包括：表演艺术圈（Drum Corps International）、英式警务体系（Detective Chief Inspector）、以及IT/机房领域（data center infrastructure）。如果你告诉我你看到“DCI”的句子或领域（音乐/警察/IT等），我可以帮你锁定最准确的意思。"]}
{"word":"DCL","summary":{"en":"DCL is an abbreviation most often meaning Data Control Language in SQL (permission control), but it can also mean Digital Command Language (OpenVMS) or the Roman numeral 650.","zh":"DCL 是缩写，最常见指 SQL 中的 Data Control Language（权限控制），也可能指 OpenVMS 的 Digital Command Language，或罗马数字 650。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Computing, databases) Data Control Language: the part of SQL used to control access/permissions, such as granting or revoking user privileges.","zh":"（计算机/数据库）数据控制语言：SQL 中用来管理访问权限的部分，例如授予或撤销用户权限。"},"examples":[{"en":"The DBA used DCL commands like GRANT and REVOKE to manage permissions.","zh":"数据库管理员用 DCL 命令（如 GRANT、REVOKE）来管理权限。"},{"en":"If you can’t read the table, ask whether your DCL privileges were revoked.","zh":"如果你读不了那张表，先确认你的 DCL 权限是否被撤销了。"}]},{"partOfSpeech":"other","definition":{"en":"(Computing) Digital Command Language: the command-line language/shell used on OpenVMS systems.","zh":"（计算机）数字命令语言：OpenVMS 系统上使用的命令行语言/命令解释器。"},"examples":[{"en":"On OpenVMS, many administrative tasks are done through DCL scripts.","zh":"在 OpenVMS 上，许多管理任务通过 DCL 脚本完成。"}]},{"partOfSpeech":"other","definition":{"en":"(Roman numerals) DCL = 650.","zh":"（罗马数字）DCL 表示 650。"},"examples":[{"en":"In Roman numerals, DCL equals 650.","zh":"用罗马数字表示时，DCL 等于 650。"}]}],"synonyms":["Data Control Language","permission control (SQL)","Digital Command Language"],"phonetic":"ˌdiː siː ˈɛl","extraExplanation":["“DCL”最常见于技术语境（尤其是数据库/SQL）。在不同领域它可能代表不同短语，因此写作时通常会在第一次出现时先写全称（如 Data Control Language, DCL），避免歧义。"]}
{"word":"dclass","summary":{"en":"“dclass” is an informal spelling/short form meaning “to declassify; to remove secrecy from official information.”","zh":"“dclass”多为非正式写法/简写，意思是“解密；取消保密级别并公开官方信息”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(informal) To declassify; to remove the “secret/confidential” status from official information so it can be made public.","zh":"（非正式）解密；取消文件的“机密/保密”级别，使其可以公开。"},"examples":[{"en":"The agency agreed to declass the report after a public request.","zh":"在公众申请后，该机构同意将这份报告解密。"},{"en":"People online are asking the government to declass more documents.","zh":"网上很多人在呼吁政府解密更多文件。"}]},{"partOfSpeech":"vt.","definition":{"en":"(informal) To release or publish information that was previously kept secret (often used in online discussions).","zh":"（非正式）公开曾被保密的信息（常见于网络语境）。"},"examples":[{"en":"If they ever declass what happened, it would change the story.","zh":"如果他们有一天公开当时发生的事，故事就会变样。"},{"en":"The journalist tried to get the files declassed.","zh":"这位记者试图让这些文件被解密公开。"}]}],"synonyms":["declassify","unseal","release","disclose"],"phonetic":"/ˌdiːˈklæs/","extraExplanation":["“dclass”本身不是最标准的拼写，更常见的正式动词是 **declassify**（解密）。在论坛、社交媒体或聊天中，人们有时会把 **declassify** 简写成 **declass** 或写成 **dclass**。","常见搭配：**declassify/declass documents/files/report**（解密文件/档案/报告）；常见语境与政府信息公开、历史档案、情报资料有关。"]}
{"word":"DCLU","summary":{"en":"“DCLU” is an initialism whose meaning depends on context.","zh":"“DCLU”是逐字母读的缩写，具体含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"DCLU is an initialism (an abbreviation read letter by letter). It does not have one fixed meaning in general English; its meaning depends on the field or context (e.g., a company name, a project code, a technical abbreviation).","zh":"DCLU 是一个首字母缩略词（通常逐字母读）。它在通用英语里没有唯一固定含义，具体意思取决于领域或语境（例如公司名、项目代号、技术缩写等）。"},"examples":[{"en":"I saw “DCLU” in the report, but the document didn’t explain what it stands for.","zh":"我在报告里看到“DCLU”，但文件没有说明它代表什么。"},{"en":"Can you tell me what DCLU means in this email thread?","zh":"你能告诉我在这段邮件讨论里 DCLU 是什么意思吗？"}]}],"synonyms":["initialism","abbreviation","acronym (general term)"],"phonetic":"/di si ɛl ju/","extraExplanation":["这种缩写词在不同领域可能代表完全不同的短语（例如某个部门名称、系统模块、课程项目、组织名称等）。如果你把它出现的句子/截图发我，或告诉我领域（比如计算机、医学、学校、公司内部系统），我可以更准确地给出对应释义。"]}
{"word":"DCM","summary":{"en":"DCM is an abbreviation that most commonly means dilated cardiomyopathy (medicine) or dichloromethane (chemistry), and sometimes content/data management (business/tech).","zh":"DCM 是缩写，最常见指（医学）扩张型心肌病或（化学）二氯甲烷；在商业/技术语境中也可能指内容/数据管理。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(medicine) Dilated cardiomyopathy: a disease in which the heart muscle becomes enlarged and weak, so it pumps blood less effectively.","zh":"（医学）扩张型心肌病：心肌变得扩张、变薄并无力，导致心脏泵血效率下降的一种疾病。"},"examples":[{"en":"The doctor diagnosed him with DCM after an echocardiogram.","zh":"医生在做完超声心动图后诊断他患有 DCM（扩张型心肌病）。"},{"en":"DCM can cause fatigue, shortness of breath, and swelling in the legs.","zh":"DCM 可能引起乏力、呼吸急促以及腿部水肿。"}]},{"partOfSpeech":"other","definition":{"en":"(chemistry) Dichloromethane: a colorless, volatile solvent used in labs and industry; also called methylene chloride.","zh":"（化学）二氯甲烷：一种无色、易挥发的溶剂，常用于实验室和工业；也叫“亚甲基氯化物/甲撑氯”。"},"examples":[{"en":"Use DCM in a fume hood because it evaporates quickly.","zh":"使用 DCM 时要在通风橱里操作，因为它挥发很快。"},{"en":"The sample was extracted with DCM before analysis.","zh":"分析前先用 DCM 对样品进行了萃取。"}]},{"partOfSpeech":"other","definition":{"en":"(business/tech) Data (or Digital) Content Management: systems and processes for organizing, storing, and controlling content or data.","zh":"（商业/技术）数据（或数字）内容管理：用于组织、存储与控制内容或数据的系统与流程。"},"examples":[{"en":"Our team uses a DCM tool to manage product images and documents.","zh":"我们团队用 DCM 工具来管理产品图片和文档。"},{"en":"Better DCM helps employees find the latest files faster.","zh":"更好的 DCM 能帮助员工更快找到最新版文件。"}]}],"synonyms":["dilated cardiomyopathy (for medical DCM)","dichloromethane","methylene chloride","content management"],"phonetic":"/ˌdiː siː ˈɛm/","extraExplanation":["“DCM”是缩写，具体意思高度依赖语境：在医院/兽医领域常指扩张型心肌病；在有机化学与实验室语境里常指二氯甲烷；在IT/企业管理语境里可能指（数字/数据）内容管理。","如果你告诉我你在哪个领域（医学、化学、IT、汽车/电机等）看到的“DCM”，我可以给出更准确的释义与更贴合的例句。"]}
{"word":"DCMG","summary":{"en":"DCMG most commonly refers to a British honor title: Dame Commander of the Order of St Michael and St George.","zh":"DCMG 最常见的意思是英国荣誉称号：圣迈克尔及圣乔治勋章女爵级司令。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Dame Commander of the Order of St Michael and St George,” a British honor (mainly for diplomatic or overseas service).","zh":"“圣迈克尔及圣乔治勋章女爵级司令（女爵指挥官）”的缩写，是英国的一种荣誉称号（多与外交或海外服务相关）。"},"examples":[{"en":"She was appointed DCMG for her work in international diplomacy.","zh":"她因在国际外交方面的工作而被授予 DCMG。"},{"en":"The report lists several new DCMGs in this year’s honors.","zh":"报告列出了今年授勋名单中的几位新任 DCMG。"}]},{"partOfSpeech":"other","definition":{"en":"(rare/unclear) an abbreviation that may stand for different things in different fields; the intended meaning depends on context.","zh":"（较少见/不明确）在不同领域可能代表不同含义的缩写；具体意思取决于上下文。"},"examples":[{"en":"What does DCMG mean in this email?","zh":"这封邮件里的 DCMG 是什么意思？"},{"en":"In British news, DCMG usually refers to an honor.","zh":"在英国新闻语境中，DCMG 通常指一种荣誉称号。"}]}],"synonyms":["Dame Commander (of the Order of St Michael and St George)","British honor (title)"],"phonetic":"/ˌdiː siː ˌem ˈdʒiː/","extraExplanation":["DCMG 属于英国“圣迈克尔及圣乔治勋章”（Order of St Michael and St George）的等级之一：通常有 CMG、KCMG/DCMG、GCMG 等。KCMG 是男爵级司令（Knight Commander），对应女性是 DCMG（Dame Commander）。","在新闻或人物介绍里，名字后面出现的字母（如 “Jane Smith, DCMG”）是一种“头衔/荣誉缩写”，类似学位或勋衔标注。","如果你是在公司、医学、游戏或某个专业领域看到 DCMG，它也可能是内部缩写。给我一句原文或领域（比如“医学/企业/学校/游戏/英国授勋”），我可以帮你精确判断。"]}
{"word":"DCMS","summary":{"en":"DCMS is an acronym most commonly referring to the UK Department for Culture, Media and Sport, but it can also mean a Distributed Control and Monitoring System in technical contexts.","zh":"DCMS 是一个缩写，最常见指英国文化、媒体与体育部；在技术语境中也可能指分布式控制与监控系统。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(UK) Department for Culture, Media and Sport (a government department).","zh":"（英国）文化、媒体与体育部（政府部门）。"},"examples":[{"en":"The DCMS announced new funding for community sports programs.","zh":"DCMS 宣布为社区体育项目提供新的资助。"},{"en":"She works as a policy adviser at the DCMS.","zh":"她在 DCMS 担任政策顾问。"}]},{"partOfSpeech":"other","definition":{"en":"(Tech/industry) Distributed Control and Monitoring System; a system used to control and monitor equipment or processes.","zh":"（技术/工业）分布式控制与监控系统；用于控制并监测设备或流程的系统。"},"examples":[{"en":"The factory upgraded its DCMS to improve safety monitoring.","zh":"这家工厂升级了它的 DCMS，以加强安全监测。"},{"en":"Engineers use the DCMS dashboard to track alarms in real time.","zh":"工程师使用 DCMS 仪表板来实时追踪报警信息。"}]}],"synonyms":["Department for Culture, Media and Sport (UK)","control and monitoring system (generic)"],"phonetic":"/ˌdiː siː em ˈɛs/","extraExplanation":["“DCMS”是缩写，不同领域含义可能不同。最常见的公共语境是英国政府部门（Department for Culture, Media and Sport），但在工程/IT语境中也可能指某类“控制与监控系统”。阅读时可通过上下文（政府、政策、文化体育 vs. 工厂、设备、监控）来判断。"]}
{"word":"DCMU","summary":{"en":"DCMU is a herbicide (also called diuron) commonly used in research to block Photosystem II and stop photosynthesis.","zh":"DCMU 是一种除草剂（也称 diuron/敌草隆），常用于科研中阻断光系统 II，从而抑制光合作用。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an acronym for a herbicide (chemical name: 3-(3,4-dichlorophenyl)-1,1-dimethylurea) used to stop photosynthesis by blocking Photosystem II; also known as diuron in many contexts","zh":"一种除草剂的缩写（化学名：3-(3,4-二氯苯基)-1,1-二甲基脲），可通过阻断光系统 II 来抑制光合作用；在许多语境中也称为 diuron（敌草隆）"},"examples":[{"en":"In plant biology labs, DCMU is often used to inhibit Photosystem II and study electron transport.","zh":"在植物生物学实验室里，DCMU 常用于抑制光系统 II，以研究电子传递过程。"},{"en":"The researcher added DCMU to the sample and observed a rapid drop in photosynthetic activity.","zh":"研究人员向样品中加入 DCMU，观察到光合作用活性迅速下降。"},{"en":"Because DCMU is a herbicide, it should be handled with proper safety precautions.","zh":"由于 DCMU 属于除草剂，应在合适的安全防护下操作。"}]}],"synonyms":["diuron","3-(3,4-dichlorophenyl)-1,1-dimethylurea"],"phonetic":"ˌdiː siː ˌem ˈjuː","extraExplanation":["DCMU 常在科研文章里出现，尤其是光合作用与藻类/植物生理实验中；它的作用点是光系统 II（PSII）的电子传递链，从而让光反应“卡住”。","在环境与农业语境中，DCMU 往往直接对应除草剂“diuron（敌草隆）”；不同国家/文章可能更常用其中一种名称。","如果你是在论文里看到 DCMU，通常需要结合上下文判断是“药剂名称/处理条件”还是“实验抑制剂”。"]}
{"word":"DCNA","summary":{"en":"DCNA is an initialism; its meaning depends on context.","zh":"DCNA 是一个字母缩写；具体含义需要结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An acronym/initialism made from the letters D-C-N-A. Its exact meaning depends on the field (for example, a company, organization, course, or technical term).","zh":"由字母 D-C-N-A 组成的缩写（首字母缩略词）。具体含义取决于使用领域（例如公司、组织、课程或技术术语）。"},"examples":[{"en":"What does DCNA stand for in this document?","zh":"在这份文件里，DCNA 代表什么？"},{"en":"I saw “DCNA” in an email signature, but there was no explanation.","zh":"我在邮件签名里看到“DCNA”，但没有解释它的意思。"}]}],"synonyms":["initialism","acronym"],"phonetic":"/ˌdiː siː ˌɛn ˈeɪ/","extraExplanation":["“DCNA”不是一个固定、通用的英语单词，更像是“缩写代号”。同一个缩写在不同场景可能完全不同意思。若你把它出现的句子/行业（例如医疗、网络、教育、公司名称、课程证书等）发我，我可以帮你更准确地判断它可能代表什么。"]}
{"word":"DCNL","summary":{"en":"DCNL is an abbreviation read as the letters D-C-N-L; its meaning depends on the context (sometimes a company-specific contact/do-not-contact list).","zh":"DCNL 是按字母读的缩写，具体含义取决于语境（有时指公司内部的联系/不联系名单）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation that can have different meanings depending on context; it is most often used as a set of initials (the letters D-C-N-L).","zh":"一个缩写/首字母组合，具体含义取决于语境；通常按字母逐个读作 D-C-N-L。"},"examples":[{"en":"What does DCNL stand for in this email?","zh":"这封邮件里的 DCNL 是什么意思？"},{"en":"DCNL can mean different things in different industries.","zh":"DCNL 在不同领域可能代表不同含义。"}]},{"partOfSpeech":"other","definition":{"en":"(Business/marketing, possible use) “Do-Contact/Do-Not-Contact List”: a list used to control whether certain people should or should not be contacted for sales or outreach. (Meaning varies by company.)","zh":"（商业/营销，可能用法）“联系/不联系名单”：用于管理哪些人可以被销售或外联联系、哪些人不应被联系的名单。（各公司定义可能不同。）"},"examples":[{"en":"Please check the DCNL before sending the campaign.","zh":"发活动前请先查一下 DCNL 名单。"},{"en":"Customers who opt out may be added to the DCNL.","zh":"选择退订的客户可能会被加入 DCNL。"}]}],"synonyms":["initialism","abbreviation","acronym (general)"],"phonetic":"/ˌdiː siː ɛn ˈɛl/","extraExplanation":["“DCNL”不是像“NASA”那样全球通用、固定含义的缩写；不同公司/学校/项目里可能代表不同短语。最可靠的方法是看它出现的语境（邮件主题、部门名、系统字段名）或直接问发件人“DCNL stands for what?”。","发音上通常按字母读：D-C-N-L。写作时如果第一次出现，英文里常见做法是先写全称再括号写缩写（Full Name (DCNL)）。"]}
{"word":"DCO","summary":{"en":"DCO is an abbreviation with multiple meanings (e.g., Deputy Commanding Officer; Direct-Current Offset in electronics/audio; Diversion Control Office in aviation).","zh":"DCO是一个多义缩写，常见含义包括：副指挥官（军队）、直流偏置（电子/音频）、备降/改航控制办公室（航空运营）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) Deputy Commanding Officer; the second-in-command in a military unit.","zh":"（缩写）副指挥官；在军事单位中担任“第二把手”的军官。"},"examples":[{"en":"If the commanding officer is away, the DCO may lead the briefing.","zh":"如果指挥官不在，副指挥官（DCO）可能会主持简报。"},{"en":"The DCO inspected the training area before the exercise.","zh":"副指挥官（DCO）在演习前检查了训练场地。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., electronics) Direct-Current Offset; an unwanted DC component in a signal (a baseline shift).","zh":"（缩写，电子/音频）直流偏置；信号中不需要的直流成分（基线偏移）。"},"examples":[{"en":"This recording has a DC offset, so the waveform isn’t centered.","zh":"这段录音有直流偏置，所以波形没有居中。"},{"en":"Remove the DC offset to prevent clicks when editing audio.","zh":"编辑音频时先去除直流偏置，以避免出现爆音/噪点。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., aviation/operations) Diversion Control Office; an office that helps coordinate flight diversions and disruptions.","zh":"（缩写，航空/运营）备降/改航控制办公室；协助协调航班备降与运行中断的部门。"},"examples":[{"en":"The airline’s DCO coordinated hotels after the diversion.","zh":"航司的备降控制部门（DCO）在改航后协调了酒店安排。"},{"en":"Contact the DCO for updates on the diverted flights.","zh":"联系DCO获取备降航班的最新信息。"}]}],"phonetic":"/ˌdiː siː ˈoʊ/","extraExplanation":["“DCO”是缩写，在不同领域意思差异很大。常见读法是逐字母读“D-C-O”。如果你告诉我它出现的场景（军队、公文、音频软件、航空邮件等），我可以帮你确定最准确的释义并补充更贴合的例句。"]}
{"word":"dcollet","summary":{"en":"Décolleté means ‘low-cut’ (showing the neck/shoulders/upper chest) and can also refer to a low-cut dress or top.","zh":"décolleté 指“低领/低胸的”（露出颈肩或上胸），也可指一件低领服装。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of clothing, especially a dress or top) having a low neckline that shows the neck, shoulders, or upper chest.","zh":"（尤指女装）低领的；露颈露肩（或露上胸）的。"},"examples":[{"en":"She wore a décolleté dress to the evening party.","zh":"她穿了一件低领礼服去参加晚宴。"},{"en":"The designer showed several décolleté tops for summer.","zh":"设计师展示了好几款适合夏天的低领上衣。"}]},{"partOfSpeech":"n.","definition":{"en":"A décolleté dress or top; clothing with a low neckline.","zh":"低领服装；低胸礼服（或上衣）。"},"examples":[{"en":"The shop sells elegant décolletés for formal events.","zh":"这家店出售适合正式场合的优雅低领礼服。"}]}],"synonyms":["low-cut","plunging","low neckline"],"phonetic":"/ˌdeɪkɑːlˈteɪ/","extraExplanation":["你输入的“dcollet”很可能是在英文里写“décolleté / decollete”时少打了字母或省略了法语重音符号。英文常见拼写有 décolleté（带重音）和 decollete（不带重音）。","这是从法语借来的词，多用于时尚语境。注意它描述的是“领口很低”的款式；如果你想表达“裸露的胸部/低胸装”也可以用 low-cut / plunging neckline 等更口语的说法。"]}
{"word":"dcolletage","summary":{"en":"Décolletage means a low neckline on women’s clothing, or the neck-and-upper-chest area it reveals.","zh":"décolletage 指女装的低胸领口，或由此露出的颈部与上胸部区域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The neckline of a woman’s dress or top, especially one cut low to show the neck and upper chest.","zh":"（女装）领口；尤其指低胸领口，露出颈部与上胸部的剪裁。"},"examples":[{"en":"Her evening gown had a deep décolletage.","zh":"她的晚礼服是深V低胸领口。"},{"en":"The designer chose lace to soften the décolletage.","zh":"设计师用蕾丝来柔化低胸领口的效果。"}]},{"partOfSpeech":"n.","definition":{"en":"The neck and upper chest area that is shown by a low neckline.","zh":"（因低胸领口而露出的）颈部与上胸部区域。"},"examples":[{"en":"She applied a little highlighter on her décolletage.","zh":"她在颈胸部位轻轻打了高光。"},{"en":"Remember to use sunscreen on your face and décolletage.","zh":"记得脸部和颈胸部位都要擦防晒。"}]}],"synonyms":["low neckline","plunging neckline","neckline","upper chest","cleavage (related, but more specific)"],"phonetic":"/deɪˌkɑːl.əˈtɑːʒ/","extraExplanation":["这个词来自法语 décolletage（也常写作 décolletage / decolletage），原意与“露出颈部/剪开领口”有关。英语中多用于时尚、美妆语境。","你输入的拼写“dcolletage”少了开头的 e（以及可能的重音符号 é）；常见正确拼写是 décolletage 或 decolletage。","语体上偏正式或偏时尚行业用语；日常口语里也可用 low neckline（低领口）或 chest/neck area（颈胸部位）来表达。"]}
{"word":"dcor","summary":{"en":"“dcor” is not a standard English word; it is most likely a misspelling of “decor,” meaning interior decoration/style (and less commonly, polite, proper behavior).","zh":"“dcor”不是标准英语词；更可能是把“decor”拼错了，意思是室内装饰/风格（较少见的意思是得体的礼仪与举止）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended: “decor”) the style and arrangement of furniture, colors, and decorations in a room or building; the overall look of an interior space.","zh":"（可能想写的是 decor）室内装饰风格；房间/建筑内部的布置与整体视觉效果。"},"examples":[{"en":"I love the decor in this café—warm lights and wooden tables.","zh":"我很喜欢这家咖啡馆的装饰风格——暖色灯光配木桌，很舒服。"},{"en":"They updated the living-room decor with new curtains and plants.","zh":"他们用新窗帘和绿植更新了客厅的装饰。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) good taste and correct behavior in social situations; politeness.","zh":"（较少见）得体的举止；礼仪；分寸。"},"examples":[{"en":"She handled the disagreement with decor and calmness.","zh":"她用得体而冷静的方式处理了分歧。"}]}],"synonyms":["decoration","interior design","furnishings","ornamentation"],"phonetic":"/ˈdeɪkɔr/","extraExplanation":["“dcor”本身不是常见英语单词；很多情况下是把“decor”（装饰/装潢）漏写了字母 e。","“decor”来自法语 décor，常见搭配：home decor（家居装饰）、interior decor（室内装饰）、holiday decor（节日装饰）。"]}
{"word":"DCP","summary":{"en":"DCP is an abbreviation with multiple meanings; common ones include Disney College Program, deferred compensation plan, and digital content protection.","zh":"DCP是多义缩写；常见含义包括迪士尼大学项目、递延薪酬计划，以及数字内容保护。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Disney College Program,” a paid internship/work-and-study program at Walt Disney World (and sometimes other Disney parks).","zh":"“Disney College Program（迪士尼大学项目）”的缩写；在迪士尼乐园相关地点进行带薪实习/边工作边学习的项目。"},"examples":[{"en":"She got accepted into the DCP for the fall term.","zh":"她被录取参加秋季的DCP项目。"},{"en":"Many students use the DCP to gain customer service experience.","zh":"很多学生通过DCP积累客服经验。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “deferred compensation plan,” a retirement-savings plan (often offered by employers) where you set aside income for later.","zh":"“deferred compensation plan（递延薪酬计划/递延补偿计划）”的缩写；把一部分收入留到以后领取的退休/储蓄安排。"},"examples":[{"en":"He contributes to a DCP through his employer each month.","zh":"他每月通过雇主的DCP计划缴费。"},{"en":"Ask HR how the DCP differs from the 401(k).","zh":"问问人力资源部门DCP和401(k)有什么区别。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation used in tech for “digital content protection,” methods that restrict copying or unauthorized sharing of digital media.","zh":"科技语境中“digital content protection（数字内容保护）”的缩写；指限制复制或未经授权传播数字媒体的方法。"},"examples":[{"en":"The video won’t play because the device doesn’t support DCP.","zh":"这段视频播放不了，因为设备不支持DCP。"},{"en":"Some platforms use DCP to reduce piracy.","zh":"一些平台用DCP来减少盗版。"}]}],"synonyms":["abbrev.","acronym"],"phonetic":"/ˌdiː siː ˈpiː/","extraExplanation":["DCP是缩写词，具体含义高度依赖语境（公司/学校/行业/地区）。如果你告诉我你在哪儿看到它（例如招聘信息、社交媒体、表格、技术文档），我可以帮你判断最可能的意思。"]}
{"word":"DCPR","summary":{"en":"DCPR is an initialism with multiple possible meanings; its exact meaning depends on context.","zh":"DCPR 是一个可能有多种含义的缩写，具体意思需要结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An acronym/initialism whose meaning depends on context; it is most often read aloud by letters (“D-C-P-R”).","zh":"一个缩写/首字母缩略词，具体含义取决于语境；通常按字母逐个读作“D-C-P-R”。"},"examples":[{"en":"What does DCPR stand for in this document?","zh":"在这份文件里，DCPR 代表什么？"},{"en":"Please define DCPR the first time you use it in the report.","zh":"请在报告中第一次使用 DCPR 时先写出全称并解释。"}]},{"partOfSpeech":"other","definition":{"en":"(Common in healthcare/medical notes) “Delayed Cerebral Postoperative Recovery,” referring to slower-than-expected recovery of brain function after surgery (term usage varies by hospital/region).","zh":"（医疗场景中较常见）“Delayed Cerebral Postoperative Recovery”，指术后脑功能恢复比预期更慢（不同医院/地区用法可能不同）。"},"examples":[{"en":"The physician noted possible DCPR after the procedure.","zh":"医生记录术后可能出现 DCPR。"},{"en":"They monitored the patient closely for signs of DCPR.","zh":"他们密切监测患者是否有 DCPR 的迹象。"}]},{"partOfSpeech":"other","definition":{"en":"(In tech/process documents, sometimes) “Data Collection, Processing, and Reporting,” a workflow that describes gathering data, handling it, and presenting results (not standardized).","zh":"（在技术/流程文件中有时出现）“Data Collection, Processing, and Reporting”，指数据收集、处理与报告的工作流程（并非统一标准用法）。"},"examples":[{"en":"Our DCPR pipeline runs daily to generate the dashboard.","zh":"我们的 DCPR 流程每天运行以生成仪表盘。"},{"en":"DCPR includes cleaning the data before reporting.","zh":"DCPR 包括在出报告前清洗数据。"}]}],"synonyms":["initialism","acronym","abbreviation"],"phonetic":"/ˌdiː siː piː ˈɑːr/","extraExplanation":["“DCPR”不是像“NASA”那样全球固定含义的缩写，更常见的是在某个公司/医院/项目内部使用的简称。最可靠的方法是看它出现的领域（医疗、法律、IT、工程等）以及同一句话里的相关词。","如果你把它出现的完整句子（或行业/文件类型）发我，我可以帮你判断最可能的全称与准确翻译。"]}
{"word":"DCPSK","summary":{"en":"DCPSK is a technical acronym referring to a PSK-style modulation method, commonly understood as a differential (phase-change-based) variant of PSK.","zh":"DCPSK 是工程领域的技术缩写，指一种PSK调制方法，通常理解为通过相位变化进行编码的差分型PSK变体。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an acronym used in digital communications for a type of phase-shift keying (PSK) modulation where information is encoded using changes in phase between symbols (often interpreted as a variant of differential PSK).","zh":"数字通信中的缩写，指一种相位键控（PSK）调制方式，信息通过相邻符号之间的相位变化来编码（常被理解为差分PSK的一种变体）。"},"examples":[{"en":"The paper compares DCPSK with DPSK under the same noise conditions.","zh":"这篇论文在相同噪声条件下比较了 DCPSK 和 DPSK。"},{"en":"DCPSK can be useful when you want to avoid needing an exact carrier phase reference.","zh":"当你希望避免依赖精确的载波相位参考时，DCPSK 可能会很有用。"}]}],"synonyms":["DPSK","PSK","differential phase-shift keying"],"phonetic":"/ˌdiː siː piː ˌɛs ˈkeɪ/","extraExplanation":["“DCPSK”不是日常英语词汇，更多出现在工程/科研语境（通信、信号处理、无线系统）里。不同教材或论文可能对该缩写的展开（全称）略有差异；如果你能提供它出现的句子或领域（例如卫星通信/光通信/混沌通信等），我可以帮你确认更准确的含义与对应中文译法。"]}
{"word":"DCR","summary":{"en":"DCR is an abbreviation; common meanings include a formal change request in workplaces and a financial ratio about covering debt payments.","zh":"DCR 是缩写；常见含义包括职场中的正式变更申请，以及衡量偿债能力的财务比率。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation that can mean a “change/request” document in workplaces (for example, Document Change Request or Data Change Request), used to formally ask for an update or correction.","zh":"缩写，在职场中常指一种“变更/申请”文件（如 Document Change Request 文件变更申请、Data Change Request 数据变更申请），用于正式提出修改或更正。"},"examples":[{"en":"Please submit a DCR if you need to update the procedure document.","zh":"如果你需要更新流程文件，请提交一份 DCR。"},{"en":"The team approved the DCR and scheduled the changes for next week.","zh":"团队批准了这份 DCR，并把变更安排在下周。"}]},{"partOfSpeech":"other","definition":{"en":"Debt Coverage Ratio (also called Debt Service Coverage Ratio in some contexts): a financial number that shows whether income is enough to cover debt payments.","zh":"Debt Coverage Ratio（有时也指/近似于 Debt Service Coverage Ratio）：一种财务指标，用来衡量收入是否足以覆盖偿债支出。"},"examples":[{"en":"The bank asked for our DCR before approving the loan.","zh":"银行在批准贷款前要求我们提供 DCR。"},{"en":"A higher DCR generally means lower risk for lenders.","zh":"DCR 越高通常表示对放贷方风险越低。"}]}],"synonyms":["change request (in workplace contexts)","coverage ratio (in finance contexts)"],"phonetic":"/ˌdiː siː ˈɑːr/","extraExplanation":["“DCR”是首字母缩写，具体含义高度依赖行业与公司内部用法：在制造/质量体系里常见“文件变更申请”；在数据/IT/运营里也可能指“数据变更申请”；在金融语境里则常见为某种“偿债覆盖率”。阅读邮件或报告时，最好结合标题、表格栏目名（如 Request/Change/Ratio）来判断。","发音通常按字母逐个读：D-C-R。"]}
{"word":"DCS","summary":{"en":"DCS is an abbreviation; most often it means “Distributed Control System” (industry) or “Digital Combat Simulator” (game), and sometimes it refers to child services agencies depending on location.","zh":"DCS是一个缩写：最常见指工业领域的“分散控制系统”，或游戏《Digital Combat Simulator》；在部分地区也可能指儿童服务机构等。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation used for different terms; commonly “Distributed Control System” in engineering (a computer-based system used to monitor and control industrial processes).","zh":"缩写，常指工程领域的“分散控制系统”（用计算机监控与控制工业流程的系统）。"},"examples":[{"en":"The refinery upgraded its DCS to improve safety and reliability.","zh":"这家炼油厂升级了DCS，以提高安全性和可靠性。"},{"en":"Operators can view temperatures and alarms on the DCS screens.","zh":"操作员可以在DCS屏幕上查看温度和报警信息。"}]},{"partOfSpeech":"other","definition":{"en":"“Digital Combat Simulator,” a realistic flight/combat simulation video game series (often written as DCS or DCS World).","zh":"“数字战斗模拟”（一款偏硬核的飞行/作战模拟游戏系列，常写作DCS或DCS World）。"},"examples":[{"en":"He flies the F/A-18 in DCS on weekends.","zh":"他周末会在DCS里开F/A-18。"},{"en":"DCS is known for detailed aircraft systems and procedures.","zh":"DCS以细致的飞机系统与操作流程著称。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for government or institutional agencies in some places (for example, “Department of Children Services/Child Services”), meaning an office related to child welfare and protection.","zh":"在一些地区指政府/机构部门的缩写（如“儿童服务部门”），与儿童福利与保护相关。"},"examples":[{"en":"The case was reported to DCS for investigation.","zh":"该案件已上报给DCS进行调查。"},{"en":"DCS arranged temporary support for the family.","zh":"DCS为这个家庭安排了临时支持。"}]}],"synonyms":["abbrev.","initialism","acronym (general term)"],"phonetic":"ˌdiː siː ˈɛs","extraExplanation":["“DCS”是高度依赖语境的缩写：在工厂/自动化文件里多指分散控制系统；在游戏社区里常指《Digital Combat Simulator》；在新闻或社福语境里可能是某地的儿童服务机构。你可以告诉我你看到DCS的句子或领域（工程/游戏/政府等），我可以给出更精准的释义。"]}
{"word":"DCs","summary":{"en":"“DCs” is a plural abbreviation most commonly meaning either direct currents (electronics) or domain controllers (IT); it can also relate to D.C. (District of Columbia) in certain contexts.","zh":"“DCs”是复数缩写，最常见指直流电（电学）或域控制器（IT）；在某些语境下也可能与华盛顿特区（D.C.）相关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation meaning “direct currents” (plural of DC: direct current), used in electricity and electronics.","zh":"缩写，表示“直流电”（DC 的复数：direct current），常用于电学与电子学语境。"},"examples":[{"en":"This device can run on AC or DCs from different power supplies.","zh":"这个设备可以使用交流电或来自不同电源的直流电。"},{"en":"The lab compared AC signals with DCs to test the circuit.","zh":"实验室把交流信号和直流电进行对比来测试电路。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation meaning “domain controllers” (plural of DC: domain controller), used in IT and Windows network administration.","zh":"缩写，表示“域控制器”（DC 的复数：domain controller），常用于 IT 与 Windows 网络管理。"},"examples":[{"en":"Make sure the DCs are replicating changes correctly.","zh":"确保这些域控制器能正确同步（复制）更改。"},{"en":"The company has two DCs in different data centers.","zh":"这家公司在不同的数据中心有两台域控制器。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “District of Columbia’s” or “Districts of Columbia,” depending on context; often written as “D.C.’s” in careful style.","zh":"可表示“哥伦比亚特区的”（District of Columbia’s）或其复数形式，取决于语境；较规范的写法常见为 “D.C.’s”。"},"examples":[{"en":"D.C.’s museums are free to visit.","zh":"华盛顿特区的博物馆是免费参观的。"},{"en":"One of D.C.’s neighborhoods is very walkable.","zh":"华盛顿特区有一个街区非常适合步行。"}]}],"synonyms":["DCs (direct currents)","DCs (domain controllers)","D.C.’s (possessive form)"],"phonetic":"ˌdiːˈsiːz","extraExplanation":["“DCs”在不同领域含义差异很大：电学里常指“直流电（direct currents）”，IT 里常指“域控制器（domain controllers）”。在表示华盛顿特区所有格时，很多写作者更倾向写成“D.C.’s”以避免歧义。你如果告诉我出现的句子或领域（电学/IT/地理/别的），我可以帮你锁定最准确的意思。"]}
{"word":"DCT","summary":{"en":"“DCT” is usually an abbreviation for Discrete Cosine Transform in signal processing (e.g., JPEG compression), but it can mean different things depending on the context.","zh":"“DCT”通常是“离散余弦变换”的缩写（用于信号处理/如 JPEG 压缩），但在不同语境中也可能代表其他含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbrev.) Discrete Cosine Transform: a math method used in signal processing to turn a signal (like an image or sound) into a set of cosine “frequency” components; widely used in JPEG image compression.","zh":"（缩写）离散余弦变换：一种信号处理中的数学方法，把图像或声音等信号转换成一组余弦“频率”成分；广泛用于 JPEG 图像压缩。"},"examples":[{"en":"JPEG uses the DCT to compress images efficiently.","zh":"JPEG 使用 DCT 来高效压缩图像。"},{"en":"After applying the DCT, many high‑frequency values are close to zero.","zh":"应用 DCT 之后，很多高频数值会接近于 0。"}]},{"partOfSpeech":"other","definition":{"en":"(abbrev., less common in general English) District of Columbia Territory / similar administrative shorthand used in some documents (meaning depends on the specific system or country).","zh":"（缩写，较少见）在某些文件中表示行政区划的简写（如与“District / Territory”等相关）；具体含义取决于使用的体系或国家。"},"examples":[{"en":"In this form, DCT is used as an internal location code.","zh":"在这份表格里，DCT 被用作内部地点代码。"},{"en":"Please check the document legend to confirm what DCT stands for here.","zh":"请查看文件中的图例/说明，确认此处 DCT 的具体含义。"}]}],"synonyms":["Discrete Cosine Transform"],"phonetic":"/ˌdiː siː ˈtiː/","extraExplanation":["“DCT”最常见的含义是在工程/计算机领域指 Discrete Cosine Transform（离散余弦变换）。在日常对话里单独说 “DCT” 比较少见，通常出现在论文、课程、代码注释、技术文档中。","如果你是在某个特定场景（比如医学、政府表格、公司系统）看到 DCT，它也可能是该领域的内部缩写。给我一句原文或所在领域，我可以帮你精确判断。"]}
{"word":"DCTN","summary":{"en":"DCTN is usually an initialism whose meaning depends on context; it isn’t a standard standalone word.","zh":"DCTN 通常是首字母缩写，意思取决于语境；它不是标准的独立单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation or initialism that can stand for different things depending on context; it is not a widely standardized English word on its own.","zh":"一个缩写/首字母词，具体含义取决于语境；它本身不是一个广泛标准化的英语单词。"},"examples":[{"en":"What does DCTN stand for in this report?","zh":"这份报告里的 DCTN 是什么意思？"},{"en":"DCTN isn’t clear without context—can you share the full sentence?","zh":"没有语境 DCTN 不太明确——你能提供完整句子吗？"}]}],"synonyms":["initialism","abbreviation","acronym"],"phonetic":"/di si ti ɛn/","extraExplanation":["很多全大写的缩写在不同领域会有不同扩展（例如公司名、项目名、技术名、课程名等）。如果你告诉我它出现的领域（如医学、金融、聊天、学校作业）或给出原句，我可以帮你准确拆解并解释最可能的含义。","读法上通常按字母逐个读（D-C-T-N）。在正式写作中，首次出现一般要写出全称（full form）并在括号里标注缩写。"]}
{"word":"DCTS","summary":{"en":"“DCTS” is an initialism; its exact meaning depends on the context.","zh":"“DCTS”是首字母缩略词；具体含义取决于使用场景。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An initialism (a shortened form made from the first letters of words). “DCTS” can stand for different things depending on the field (school, business, government, technology, etc.).","zh":"首字母缩略词（由多个词的首字母组成的缩写）。DCTS 在不同领域可能代表不同含义，需要结合上下文判断。"},"examples":[{"en":"I saw “DCTS” in the email, but it wasn’t explained—do you know what it stands for?","zh":"我在邮件里看到了 “DCTS”，但没有解释——你知道它代表什么吗？"},{"en":"In reports, acronyms like DCTS should be defined the first time they appear.","zh":"在报告中，像 DCTS 这样的缩写第一次出现时应先写出全称再使用。"}]}],"synonyms":["acronym","initialism","abbreviation"],"phonetic":"/di si ti ɛs/","extraExplanation":["“DCTS”更像是“首字母缩略词（initialism）”，通常按字母逐个读（D-C-T-S），而不是当作一个单词读。","它可能在不同场景代表不同机构/系统名称。为了帮你准确释义，请告诉我你看到它的句子、行业（例如学校、医疗、IT、政府文件等）或它前后出现的相关词。"]}
{"word":"DCVO","summary":{"en":"DCVO is an abbreviation with meanings that depend heavily on context; it’s usually read letter by letter.","zh":"DCVO 是一个含义高度依赖语境的缩写，通常逐字母读。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for several different phrases; the exact meaning depends on the field or organization using it (not a single standard English word).","zh":"一个可能代表多种短语的缩写；具体含义取决于使用它的领域或机构（不是英语里唯一固定的词）。"},"examples":[{"en":"What does DCVO stand for in this document?","zh":"在这份文件里，DCVO 代表什么？"},{"en":"DCVO isn’t a common dictionary word, so we need the context to define it correctly.","zh":"DCVO 不是常见的词典词条，所以需要上下文才能正确解释。"}]},{"partOfSpeech":"other","definition":{"en":"(some organizations) a title/role abbreviation, often referring to a leader or officer position (for example, a “... Officer”).","zh":"（某些机构用法）职位/角色缩写，常指某种负责人或主管头衔（例如“……官/主管”一类）。"},"examples":[{"en":"Please forward the report to the DCVO for approval.","zh":"请把报告转交给 DCVO 审批。"}]},{"partOfSpeech":"other","definition":{"en":"(tech/business, sometimes) an internal abbreviation related to data centers or operations; meaning varies by company.","zh":"（科技/商业语境中有时出现）与数据中心或运营相关的内部缩写；不同公司含义不同。"},"examples":[{"en":"Our team works with the DCVO group on system reliability.","zh":"我们团队与 DCVO 小组合作提升系统可靠性。"}]}],"synonyms":["acronym","initialism","abbr."],"phonetic":"/di si vi oʊ/","extraExplanation":["“DCVO”更像是组织内部缩写或专业领域缩写，并没有一个在英语里普遍通用、固定不变的标准释义。","如果你告诉我它出现的场景（例如邮件/合同/论文/职位表/IT 系统/医疗或政府文件），我可以根据上下文给出最准确的展开与解释。"]}

