{"word":"DD","summary":{"en":"“DD” is a common abbreviation that usually means “designated driver” or “due diligence,” depending on context.","zh":"“DD”是常见缩写，通常指“指定司机/代驾”或“尽职调查”，具体看语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation for “designated driver” (a person who does not drink alcohol and drives others home safely).","zh":"“指定司机/代驾” 的缩写（指不喝酒、负责把大家安全送回家的人）。"},"examples":[{"en":"I’ll be the DD tonight, so I’m not drinking.","zh":"我今晚当DD，所以不喝酒。"},{"en":"We need a DD if we’re going to the bar.","zh":"我们要去酒吧的话得有个DD。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation for “due diligence” (careful checking/research before a business or legal decision).","zh":"“尽职调查” 的缩写（在商业或法律决定前进行认真核查/调查）。"},"examples":[{"en":"The investors want DD before they sign the deal.","zh":"投资人要先做DD才会签这笔交易。"},{"en":"Our legal team is doing DD on the company.","zh":"我们的法务团队正在对这家公司做DD。"}]},{"partOfSpeech":"other","definition":{"en":"A way to write the letters “D D,” often used in texting, notes, or as an abbreviation in specific fields.","zh":"字母 “D D” 的写法，常见于短信、笔记，或特定领域中的缩写。"},"examples":[{"en":"Can you spell it out? I only saw “DD.”","zh":"你能写全吗？我只看到“DD”。"}]}],"synonyms":["designated driver","due diligence"],"phonetic":"/ˌdiː ˈdiː/","extraExplanation":["“DD”在英语里高度依赖语境：在日常生活/派对场景最常见是 designated driver；在商业、投融资、并购或法律文件里常见是 due diligence。","如果你是在某个具体句子、聊天记录或专业领域里看到“DD”，把上下文发我，我可以帮你精准判断是哪一种含义。"]}
{"word":"dd","summary":{"en":"“DD” usually means the letters “D-D,” and commonly works as an abbreviation for “due date” or “design document,” depending on context.","zh":"“DD”通常就是字母“D-D”，也常在语境中作为“due date（截止/到期日）”或“design document（设计文档）”等缩写使用。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"the letter name “D,” said twice; used when spelling or naming something like initials (DD).","zh":"字母名“D”念两次；常用于拼读或表示首字母缩写（DD）。"},"examples":[{"en":"Her initials are DD.","zh":"她的姓名首字母是DD。"},{"en":"Please write it as capital DD.","zh":"请把它写成大写的DD。"}]},{"partOfSpeech":"other","definition":{"en":"(common abbreviation) “due date,” the date something must be finished or paid.","zh":"（常见缩写）due date（截止日期/到期日）。"},"examples":[{"en":"What’s the DD for the report?","zh":"这份报告的截止日期是什么时候？"},{"en":"The invoice DD is February 20.","zh":"这张发票的到期日是2月20日。"}]},{"partOfSpeech":"other","definition":{"en":"(computing/work) “design document,” a written plan describing how software or a feature should work.","zh":"（计算机/工作）design document（设计文档），描述软件或功能如何实现的书面方案。"},"examples":[{"en":"Before coding, we need a DD for the new feature.","zh":"在开始写代码之前，我们需要为新功能写一份设计文档。"},{"en":"I’ll share the DD with the team for feedback.","zh":"我会把设计文档分享给团队征求意见。"}]}],"synonyms":["deadline (for “due date”)","doc (for “design document”)","spec (similar to a design document)"],"phonetic":"/ˌdiˈdi/","extraExplanation":["“DD”在不同领域里含义很多，最常见的是工作沟通里的“due date（截止/到期日）”。在技术团队中也常见“design document（设计文档）”。如果你告诉我你是在什么场景看到“dd/ DD”（聊天、学校、游戏、工作），我可以给出更准确的解释。"]}
{"word":"dd.","summary":{"en":"An abbreviation most often meaning “due date,” and sometimes “dated” or “direct debit,” depending on context.","zh":"常见缩写，多指“截止日期/到期日”，也可能指“日期为……”或“直接扣款”，需结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Abbreviation for “due date,” especially in schedules, forms, or project notes.","zh":"（缩写）“到期日 / 截止日期”，常见于表格、日程或项目记录中。"},"examples":[{"en":"Please confirm the dd. for the final payment.","zh":"请确认尾款的到期日（dd.）。"},{"en":"The report’s dd. is Friday at 5 p.m.","zh":"报告的截止日期（dd.）是周五下午5点。"}]},{"partOfSpeech":"other","definition":{"en":"Abbreviation for “dated” in some formal or legal writing, meaning “with the date of.”","zh":"（缩写）在部分正式/法律文件中表示“注明日期的 / 日期为……的”（相当于 dated）。"},"examples":[{"en":"the contract, dd. 12 March 2022","zh":"该合同，日期为2022年3月12日（dd.）。"},{"en":"Please attach the letter, dd. June 1.","zh":"请附上那封日期为6月1日的信（dd.）。"}]},{"partOfSpeech":"other","definition":{"en":"In banking contexts, abbreviation for “direct debit” in some countries (more common in UK/EU usage).","zh":"（缩写）在部分国家/地区的银行语境中指“直接扣款”（direct debit，更常见于英/欧用法）。"},"examples":[{"en":"The bill will be paid by dd. each month.","zh":"账单将每月通过直接扣款（dd.）支付。"}]}],"synonyms":["due date","deadline","dated","direct debit"],"phonetic":"/di di/","extraExplanation":["“dd.” 在不同国家/领域含义差异较大：学习或工作里最常见的是 due date（截止日期）。如果出现在合同、函件抬头或档案注记里，更可能表示 dated（日期为）。在账单/银行自动扣款语境里，可能是 direct debit。","如果你能提供一句原文或截图，我可以帮你判断此处到底是哪一种意思。"],"etymology":"“dd.” 多为缩写用法：可来自 due date 的首字母；也可来自拉丁语缩写习惯（如在文书中表示“日期为”一类的信息）。具体含义依语境而定。","mnemonic":["把 dd. 想成“deadline date”（截止日期）的两个 d：看到 dd. 就联想到“到哪天必须完成”。","在文书里 dd. 常跟具体日期连用（例如 dd. 12 March），看到“dd. + 日期”就优先猜“日期为”。"]}
{"word":"DDA","summary":{"en":"DDA is an acronym with multiple meanings; common ones are direct debit authorization (banking) and data-dependent acquisition (science).","zh":"DDA 是多义缩写；常见指直接扣款授权（银行/支付）或数据依赖采集（科研/质谱）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation used for several different things; common meanings include “direct debit authorization” (banking) and “data-dependent acquisition” (science/mass spectrometry).","zh":"缩写，可指多种不同事物；常见含义包括“直接扣款授权”（银行/支付）和“数据依赖采集”（科研/质谱）。"},"examples":[{"en":"The form asks you to sign a DDA so the company can withdraw the monthly fee automatically.","zh":"这份表格要求你签署一份 DDA，这样公司就能自动扣取月费。"},{"en":"In this experiment, the researchers used DDA to select which ions to fragment for analysis.","zh":"在这个实验中，研究人员使用 DDA 来选择要裂解并分析的离子。"}]},{"partOfSpeech":"other","definition":{"en":"(Australia) “DDA” can refer to the Disability Discrimination Act, a law that protects people with disabilities from discrimination.","zh":"（澳大利亚）DDA 可指《残疾歧视法》，用于保护残障人士免受歧视。"},"examples":[{"en":"The building was upgraded to meet accessibility requirements under the DDA.","zh":"这栋建筑进行了升级，以满足 DDA 下的无障碍要求。"},{"en":"Employees received training on their responsibilities under the DDA.","zh":"员工接受了关于其在 DDA 下责任的培训。"}]}],"synonyms":["abbreviation","initialism","acronym"],"phonetic":"/ˌdiː ˌdiː ˈeɪ/","extraExplanation":["“DDA”是首字母缩写（initialism），通常按字母逐个读作“D-D-A”。具体指什么高度依赖领域与语境（如银行、科研、法律、IT等）。如果你告诉我你在哪个场景看到它（例如邮件、合同、论文、软件界面），我可以给出更准确的释义与用法。"]}
{"word":"DDB","summary":{"en":"DDB most commonly refers to the advertising agency Doyle Dane Bernbach (now DDB Worldwide).","zh":"DDB 最常见的意思是广告公司 Doyle Dane Bernbach（现为 DDB Worldwide）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an international advertising agency network, originally named Doyle Dane Bernbach (DDB).","zh":"一家国际广告代理公司网络，原名为 Doyle Dane Bernbach（简称 DDB）。"},"examples":[{"en":"She got an internship at DDB and worked on a global brand campaign.","zh":"她在 DDB 实习，参与了一个全球品牌的广告活动。"},{"en":"DDB is known for creative, story-driven advertising.","zh":"DDB 以富有创意、重视故事叙述的广告而闻名。"}]},{"partOfSpeech":"other","definition":{"en":"a written abbreviation used in some fields for organization or program names that begin with the letters D-D-B (the exact meaning depends on context).","zh":"在一些领域中使用的缩写，代表以 D-D-B 开头的机构或项目名称（具体含义需看语境）。"},"examples":[{"en":"In this report, DDB refers to a department name—check the abbreviations list.","zh":"在这份报告里，DDB 指的是某个部门名称——请查看缩写表。"},{"en":"I saw “DDB” in the document, but the meaning wasn’t explained.","zh":"我在文件里看到“DDB”，但没有解释它的含义。"}]}],"synonyms":["DDB Worldwide","Doyle Dane Bernbach"],"phonetic":"/ˌdiː diː ˈbiː/","extraExplanation":["DDB 最广为人知的来源是 20 世纪美国广告公司 Doyle Dane Bernbach。它常被认为推动了“创意革命”（creative revolution）的广告风格，更强调幽默、真实与独特的文案与画面。","经典案例常被提到的是 1960 年代为大众汽车（Volkswagen）制作的广告（如 “Think Small”），在广告史与传播学课程中经常出现。","当你在邮件、论文或公司文件里看到 DDB，如果不是指这家广告公司，最好向对方确认全称（full form），因为不同组织也可能用同样的字母缩写。"]}
{"word":"DDC","summary":{"en":"DDC most often means Dewey Decimal Classification in libraries; it can also mean Direct Digital Control in building systems.","zh":"DDC 最常指图书馆里的“杜威十进分类法”；也可指楼宇系统中的“数字直接控制”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Dewey Decimal Classification: a library system that organizes books by subject using numbers (e.g., 500 for science).","zh":"杜威十进分类法：一种图书馆分类系统，用数字按主题整理书籍（如 500 表示自然科学）。"},"examples":[{"en":"You can find most computer books in the 000s in the DDC system.","zh":"在 DDC 系统里，大多数计算机类书籍可以在 000 类找到。"},{"en":"The librarian taught us how to use DDC to locate history books.","zh":"图书管理员教我们如何用 DDC 找到历史类书籍。"}]},{"partOfSpeech":"other","definition":{"en":"Direct Digital Control: a method of using computerized controllers to manage building systems such as heating, ventilation, and air conditioning (HVAC).","zh":"数字直接控制：用计算机控制器管理楼宇系统（如暖通空调 HVAC）的一种方式。"},"examples":[{"en":"The office upgraded to DDC to improve energy efficiency.","zh":"这栋办公楼升级为 DDC 系统以提高能效。"},{"en":"With DDC, the HVAC schedule can be adjusted remotely.","zh":"使用 DDC 后，可以远程调整暖通空调的运行时间表。"}]}],"synonyms":["Dewey Decimal System (for the library meaning)","Dewey (informal, library context)"],"phonetic":"/ˌdiː diː ˈsiː/","extraExplanation":["“DDC”常见于两类场景：①图书馆与信息管理领域，通常特指“杜威十进分类法”；②楼宇自动化/暖通空调领域，指“数字直接控制”。在阅读资料时可通过上下文判断（出现 books/library/subject/numbers 多半是前者；出现 HVAC/building/controls/energy 多半是后者）。"]}
{"word":"DDCMP","summary":{"en":"“DDCMP” is an acronym whose meaning depends on context and is typically pronounced letter by letter.","zh":"“DDCMP”是一个需依上下文确定含义的缩写，通常按字母逐个读出。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An acronym/initialism. “DDCMP” does not have one universally accepted meaning in general English; its meaning depends on the field (e.g., business, IT, education, government). It is usually read aloud as the names of the letters.","zh":"一个缩写/首字母缩略词。“DDCMP”在通用英语里没有唯一、固定的标准含义；具体意思取决于使用领域（如商业、IT、教育、政府等）。通常按字母逐个读出。"},"examples":[{"en":"I saw “DDCMP” in the report, but the document didn’t define the acronym.","zh":"我在报告里看到了“DDCMP”，但文件没有解释这个缩写。"},{"en":"Can you tell me what DDCMP stands for in your company’s system?","zh":"你能告诉我在你们公司的系统里，DDCMP 代表什么吗？"}]}],"synonyms":["initialism","acronym"],"phonetic":"/ˌdiː diː siː ɛm ˈpiː/","extraExplanation":["在英语里，很多缩写只在特定行业或机构内部通用；离开上下文就很难“查词式”确定唯一释义。","如果你愿意提供：1）出现的句子/段落；2）行业（例如供应链、软件、医疗、学校课程等）；3）所在国家/机构名称，我可以更准确地判断它的全称和中文对应。","读法提示：作为首字母缩略词，它通常不按“单词”读，而是逐个字母读（类似“USB”“BBC”）。"]}
{"word":"DDCU","summary":{"en":"DDCU is an initialism whose meaning depends on context; one common use is the name Delta Dental Credit Union.","zh":"DDCU 是一个含义取决于语境的字母缩写；其中一种常见用法是 Delta Dental Credit Union（某家信用合作社名称）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an initialism (acronym made from letters) that can stand for different organizations or terms depending on context; it is not a standard English word with one fixed meaning.","zh":"一个由字母组成的缩写（逐字母读的首字母缩略词），具体含义取决于语境；它不是只有单一固定意思的英语单词。"},"examples":[{"en":"What does DDCU stand for in this email?","zh":"这封邮件里的 DDCU 是什么意思（代表什么）？"},{"en":"DDCU can mean different things in different industries, so please share the full name once.","zh":"DDCU 在不同行业可能代表不同意思，所以请提供一次全称。"}]},{"partOfSpeech":"other","definition":{"en":"(common real‑world use) Delta Dental Credit Union, a credit union name used in the U.S.","zh":"（常见现实用法之一）Delta Dental Credit Union（美国的某家信用合作社名称）。"},"examples":[{"en":"I opened an account at DDCU last year.","zh":"我去年在 DDCU 开了账户。"},{"en":"DDCU offers online banking and auto loans.","zh":"DDCU 提供网上银行和汽车贷款服务。"}]}],"synonyms":["initialism","abbreviation"],"phonetic":"/ˌdiːˌdiːˈsiːˌjuː/","extraExplanation":["“DDCU”通常是逐个字母读：D‑D‑C‑U。在不同领域它可能有多种展开方式（例如某个部门名称、项目名或机构名）。如果你告诉我它出现的场景（学校/公司/银行/文件标题等）或给我完整句子，我可以帮你确认最准确的含义。"]}
{"word":"DDD","summary":{"en":"DDD is an acronym; most commonly it means Domain-Driven Design in software, but it can also mean data-driven development/design or direct distance dialing depending on context.","zh":"DDD 是缩写；最常见指软件领域的“领域驱动设计”，也可能指“数据驱动的开发/设计”或“直拨长途”，需结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Domain-Driven Design,” a software approach that models code around real-world business concepts (the “domain”).","zh":"“Domain-Driven Design（领域驱动设计）”的缩写：一种软件开发方法，用业务/现实世界的“领域”概念来组织与建模代码。"},"examples":[{"en":"We use DDD to keep our software aligned with how the business actually works.","zh":"我们用 DDD 来让软件的结构与业务的实际运作方式保持一致。"},{"en":"In DDD, the team discusses the domain language before writing the model.","zh":"在 DDD 中，团队通常会先讨论领域语言，再开始写模型。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Data-Driven Development/Design,” meaning decisions or improvements are guided by data (metrics, experiments, user behavior).","zh":"“Data-Driven Development/Design（数据驱动的开发/设计）”的缩写：用数据（指标、实验、用户行为等）来指导决策与改进。"},"examples":[{"en":"Our product team takes a DDD approach and tests changes with A/B experiments.","zh":"我们的产品团队采取数据驱动的方法，用 A/B 测试来验证改动。"},{"en":"DDD helps us prioritize features based on real user behavior.","zh":"数据驱动能帮助我们根据真实用户行为来排定功能优先级。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Direct Distance Dialing,” a phone service that lets you dial long-distance calls directly (more common in older telecom contexts).","zh":"“Direct Distance Dialing（直拨长途）”的缩写：一种可直接拨打长途电话的业务（更多见于较早期的电信语境）。"},"examples":[{"en":"The manual mentions DDD for making long-distance calls without an operator.","zh":"说明书提到 DDD：无需接线员即可直拨长途。"},{"en":"DDD and IDD were common terms in older telephone service plans.","zh":"DDD 和 IDD 是早期电话资费方案里常见的术语。"}]}],"synonyms":["Domain-Driven Design","data-driven approach","Direct Distance Dialing"],"phonetic":"/di di di/","extraExplanation":["“DDD”在不同领域含义差异很大：在软件圈里最常见的是“领域驱动设计（Domain-Driven Design）”；在产品/增长团队语境里也可能指“数据驱动（Data-Driven …）”；在电信资料里还可能是“直拨长途（Direct Distance Dialing）”。如果你告诉我上下文（例如：编程、产品、电话、或其他），我可以把最相关的那个讲得更细。"]}
{"word":"DDE","summary":{"en":"DDE most commonly means Dynamic Data Exchange, an older Windows method for sharing data between programs.","zh":"DDE 最常见指 Dynamic Data Exchange（动态数据交换），一种较早的 Windows 程序间数据共享方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abbreviation for “Dynamic Data Exchange,” an old Windows technology that lets one program share data with another program (for example, Excel sending data to Word).","zh":"“Dynamic Data Exchange（动态数据交换）”的缩写，一种较早的 Windows 技术，用来让不同软件之间共享数据（例如 Excel 把数据传给 Word）。"},"examples":[{"en":"This Excel file uses DDE to update numbers in a Word report automatically.","zh":"这个 Excel 文件用 DDE 自动更新 Word 报告里的数字。"},{"en":"For security reasons, the company disabled DDE links in Office.","zh":"出于安全原因，公司禁用了 Office 里的 DDE 链接。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) an abbreviation used in different fields with different meanings; the exact meaning depends on the context (industry, document, or country).","zh":"（较少见）在不同领域里可能代表不同含义；具体指什么取决于语境（行业、文件或国家/地区）。"},"examples":[{"en":"In this manual, DDE has a different meaning, so check the glossary.","zh":"在这本手册里，DDE 的含义不一样，所以要看术语表。"}]}],"synonyms":["Dynamic Data Exchange"],"phonetic":"/ˌdiː diː ˈiː/","extraExplanation":["DDE 在 1980–1990 年代的 Windows/Office 环境中更常见，主要用于跨程序“热更新”数据。后来微软更推荐使用 OLE、COM 或更现代的接口方式。","在 Office 安全事件中，DDE 曾被用来诱导用户触发外部命令或加载内容，因此很多机构会禁用或限制 DDE 链接。"]}
{"word":"dde","summary":{"en":"DDE most commonly refers to “Dynamic Data Exchange,” an older Windows method for sharing data between programs; it can also be a context-dependent abbreviation.","zh":"DDE 最常指“动态数据交换”（Dynamic Data Exchange），一种较早的 Windows 程序间数据共享方式；也可能是在特定语境下的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Dynamic Data Exchange: an older Windows technology that lets one program share data with another program in real time.","zh":"动态数据交换（DDE）：一种较早期的 Windows 技术，用于让不同程序之间实时共享数据。"},"examples":[{"en":"Some legacy software still uses DDE to send data from Excel to another application.","zh":"一些旧软件仍会用 DDE 把数据从 Excel 发送到另一个应用程序。"},{"en":"For security reasons, many organizations disable DDE links in Office files.","zh":"出于安全原因，许多机构会禁用 Office 文件中的 DDE 链接。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation that can stand for different things depending on context (for example, in names of departments, programs, or technical terms).","zh":"缩写：在不同语境下可能代表不同含义（例如部门名称、项目名称或技术术语）。"},"examples":[{"en":"What does DDE mean in this document?","zh":"这份文件里的 DDE 是什么意思？"},{"en":"DDE can mean different things in different industries.","zh":"在不同行业里，DDE 可能代表不同含义。"}]}],"synonyms":["Dynamic Data Exchange"],"phonetic":"/ˌdiː diː ˈiː/","extraExplanation":["在计算机语境里，DDE 最常见的含义是 Dynamic Data Exchange，主要出现在较老的 Windows/Office 生态中；如今很多场景更常用 OLE、COM、API 或其他更现代的集成方式。","在 Office 安全提示中提到的 “DDE” 有时与利用 DDE 链接触发恶意行为的攻击手法相关，因此企业常会限制或禁用。"]}
{"word":"Ddene","summary":{"en":"“Ddene” is not a common English word; it’s probably a misspelling or a name. Share the context to identify the intended word.","zh":"“Ddene”不是常见英语词，更可能是拼写错误或人名/专有名词。给我语境我可以帮你确认。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling, a username, or a proper name. Please provide the sentence or the intended spelling.","zh":"不是标准英语单词，更可能是拼写错误、用户名或专有名词。请提供原句或你想拼的正确形式。"},"examples":[{"en":"I can’t find “ddene” in a dictionary—could it be a typo?","zh":"我在词典里找不到“ddene”——它会不会是拼写错误？"},{"en":"Did you mean “dene,” “den,” or “Dene” (a name)?","zh":"你是不是想写“dene”、“den”，或者专有名词“Dene”（一个名字）？"}]}],"phonetic":"/ˈdiːdiːn/","extraExplanation":["“Ddene”很像键盘误按或重复字母导致的拼写：例如把“dene/den”多打了一个d。","可能的目标词：\n- den（n.）“兽穴；小房间/藏身处”\n- Dene（n.）指加拿大的一个原住民群体或其语言（专有名词）\n- Denne/Denneh 等也可能是姓氏拼法（不常见）","如果你把“Ddene”放在一个句子里发给我，我可以根据语境帮你判断最可能的词，并给出准确释义与发音。"]}
{"word":"Ddenise","summary":{"en":"Denise is a common female first name.","zh":"Denise 是一个常见的女性英文名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a female given name (a person’s first name).","zh":"女性名字（人的名字/名）。"},"examples":[{"en":"Denise is my coworker.","zh":"Denise 是我的同事。"},{"en":"I met Denise at a conference.","zh":"我在一次会议上认识了 Denise。"}]}],"phonetic":"/dəˈniːs/","extraExplanation":["“Denise”常见于英语国家，也来自法语名字（Denise）。它通常被认为是“Denis/ Dennis”的阴性形式，而“Denis/Dennis”又与古希腊名字“Dionysios”（意为“属于酒神狄俄尼索斯”）有关。","你输入的“Ddenise”可能是拼写错误或用户名/网名写法；正式拼写通常是“Denise”。"]}
{"word":"DDJ","summary":{"en":"DDJ most commonly refers to the *Dao De Jing* (*Tao Te Ching*), a foundational Daoist classic; it can also be an unclear acronym without context.","zh":"DDJ 最常见指《道德经》（Tao Te Ching），道家经典；在缺少语境时也可能只是含义不明的缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abbreviation for the *Dao De Jing* (also spelled *Tao Te Ching*), a classic Chinese text traditionally linked to Laozi, central to Daoist thought.","zh":"《道德经》（也常写作 *Tao Te Ching / Tao Te Jing*）的缩写；相传与老子有关，是道家思想的重要经典。"},"examples":[{"en":"I’m reading the DDJ with a modern English translation.","zh":"我在读《道德经》（DDJ），配了一本现代英文译本。"},{"en":"In the philosophy class, we discussed key ideas from the DDJ like simplicity and non-forcing.","zh":"在哲学课上，我们讨论了《道德经》（DDJ）里“简朴”和“无为”等重要思想。"}]},{"partOfSpeech":"n.","definition":{"en":"(general use) an acronym that can stand for different things depending on the field; you need context to know the meaning.","zh":"（一般用法）可代表不同含义的首字母缩略词；需要结合语境才能确定具体指什么。"},"examples":[{"en":"DDJ can mean different things online, so I asked what they meant.","zh":"DDJ 在网上可能有不同意思，所以我问对方具体指什么。"},{"en":"Without context, “DDJ” is unclear.","zh":"没有上下文，“DDJ” 的意思不明确。"}]}],"synonyms":["Dao De Jing","Tao Te Ching","Tao Te Jing"],"phonetic":"ˌdiː diː ˈdʒeɪ","extraExplanation":["在英文讨论中，用“DDJ”指《道德经》比较常见，尤其是在哲学、宗教研究、冥想与自我成长类内容里。","“Dao De Jing / Tao Te Ching”是同一部经典的不同拼写，差异主要来自不同的汉语拼音/威妥玛等罗马化系统。","如果你是在某个特定圈子里看到“DDJ”（比如科技、音乐、游戏等），它也可能是别的缩写；给我一句原句或领域，我可以帮你精确判断。"]}
{"word":"DDK","summary":{"en":"DDK most commonly refers to a DNA-replication kinase complex (Cdc7–Dbf4) in biology, but it can also be a context-dependent abbreviation.","zh":"DDK最常见指生物学中与DNA复制相关的激酶复合体（Cdc7–Dbf4），也可能是依语境而定的缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(biology) A protein kinase complex (Cdc7–Dbf4) that helps start DNA replication by activating replication origins; often written as DDK.","zh":"（生物学）一种蛋白激酶复合体（Cdc7–Dbf4），通过激活复制起始位点来启动DNA复制；常写作DDK。"},"examples":[{"en":"DDK activity is required for cells to enter the DNA replication stage.","zh":"细胞进入DNA复制阶段需要DDK的活性。"},{"en":"Researchers inhibited DDK to study how replication origins are controlled.","zh":"研究人员通过抑制DDK来研究复制起始位点如何被调控。"}]},{"partOfSpeech":"other","definition":{"en":"An initialism that can stand for different things depending on the field (for example, a lab term like “DDK,” a company name, or someone’s initials).","zh":"一个首字母缩略词，不同领域含义可能不同（例如实验室术语“DDK”、公司名称或人名缩写）。"},"examples":[{"en":"In this paper, DDK refers to the Cdc7–Dbf4 kinase complex.","zh":"在这篇论文中，DDK指Cdc7–Dbf4激酶复合体。"},{"en":"DDK can mean different things—what context did you see it in?","zh":"DDK可能有不同含义——你是在哪种语境里看到的？"}]}],"synonyms":["Cdc7–Dbf4 kinase","Dbf4-dependent kinase"],"phonetic":"/di di keɪ/","extraExplanation":["“DDK”在生命科学里最常见的用法是指Cdc7–Dbf4（也写作Dbf4-dependent kinase）。如果你是在聊天、游戏、物流/公司名或学校课程里看到“DDK”，很可能是别的缩写；告诉我原句或领域，我可以帮你锁定最准确的意思。"]}
{"word":"DDL","summary":{"en":"DDL most commonly means “deadline” in informal student use; in computing it can mean “Data Definition Language” in SQL.","zh":"DDL最常见的意思是（学生等非正式场合的）“截止日期”；在计算机领域也可指SQL中的“数据定义语言”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(informal, especially among students) a deadline; the latest time by which something must be finished or submitted.","zh":"（非正式，尤指学生用语）截止日期；最晚必须完成或提交的时间。"},"examples":[{"en":"What’s the DDL for this essay?","zh":"这篇作文的DDL（截止日期）是什么时候？"},{"en":"I’m pulling an all-nighter because the DDL is tomorrow.","zh":"因为明天就是DDL（截止日期），我得通宵赶工。"}]},{"partOfSpeech":"other","definition":{"en":"(computing, databases) Data Definition Language: the part of SQL used to create, change, or delete database structures (like tables).","zh":"（计算机/数据库）数据定义语言：SQL中用来创建、修改或删除数据库结构（如数据表）的部分。"},"examples":[{"en":"CREATE TABLE is a DDL statement in SQL.","zh":"在SQL里，CREATE TABLE 是一条DDL语句。"},{"en":"Be careful with DDL changes in production databases.","zh":"在生产环境数据库里做DDL更改要非常小心。"}]}],"synonyms":["deadline (for meaning 1)","due date (for meaning 1)"],"phonetic":"/ˌdiː diː ˈɛl/","extraExplanation":["“DDL=deadline”在中文网络和校园语境里非常常见，属于把英文缩写当作口语用的习惯（例如“赶DDL”“卡DDL”）。在正式英文写作中通常直接写 full word：deadline，而不是 DDL。","在数据库语境中，DDL与DML（Data Manipulation Language，数据操纵语言，如 INSERT/UPDATE/DELETE）常一起出现，用来区分“改结构”和“改数据”。"]}
{"word":"DDN","summary":{"en":"DDN is an acronym with multiple meanings; common ones include Defense Data Network (historical U.S. military network) and Direct Dialing Number (a direct phone number).","zh":"DDN是一个多义缩写；常见含义包括Defense Data Network（历史上的美国军用网络）和Direct Dialing Number（直拨号码）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(acronym) Defense Data Network: an early U.S. military computer network used mainly in the 1980s, important in the history of networking and the internet.","zh":"（缩写）Defense Data Network：美国早期的军用计算机网络（主要在20世纪80年代使用），在网络与互联网发展史上较重要。"},"examples":[{"en":"In some older documents, the system is described as part of the DDN.","zh":"在一些较早的文件中，这个系统被描述为DDN的一部分。"},{"en":"The DDN helped connect different military and research sites.","zh":"DDN帮助连接不同的军事与科研站点。"}]},{"partOfSpeech":"n.","definition":{"en":"(acronym, business/telecom) Direct Dialing Number: a phone number that reaches a specific person or extension directly (usage varies by company/region).","zh":"（缩写，商务/电信）Direct Dialing Number：可直接拨通到某个个人或分机的电话号码（不同公司/地区用法不完全一致）。"},"examples":[{"en":"If you have her DDN, you can reach her without going through the main line.","zh":"如果你有她的DDN，就可以不经过总机直接联系到她。"},{"en":"Please include your DDN in your email signature.","zh":"请在邮件签名中写上你的DDN。"}]},{"partOfSpeech":"n.","definition":{"en":"(acronym, computing/telecom) Digital Data Network: a general term for a network that carries digital data (less common today; often replaced by more specific terms).","zh":"（缩写，计算机/通信）Digital Data Network：泛指传输数字数据的网络（如今较少见，常被更具体的术语取代）。"},"examples":[{"en":"The report mentions a DDN used for sending digital messages between offices.","zh":"报告提到一个DDN，用于在办公室之间发送数字信息。"}]}],"synonyms":["acronym","initialism"],"phonetic":"/ˌdiːˌdiːˈɛn/","extraExplanation":["“DDN”在英文里通常是缩写，不同领域含义可能完全不同；最好结合上下文（例如军方网络、电话分机、通信网络）来判断。","发音一般是按字母读：D-D-N。若你能提供看到DDN的句子或行业（IT/电话/医学等），我可以帮你确定最准确的释义。"]}
{"word":"ddname","summary":{"en":"“ddname” isn’t a standard English word; it’s usually a context-specific label (often in forms or code).","zh":"“ddname”不是标准英语词汇；通常是语境相关的标签（多见于表单或代码中）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often seen as an informal label, username, or a variable name in code (its meaning depends on the context where you found it).","zh":"不是标准英语单词；更常见于昵称/用户名或编程里的变量名（具体含义取决于你看到它的语境）。"},"examples":[{"en":"In the form, “ddname” looks like a field name rather than a real English word.","zh":"在这个表单里，“ddname”看起来像字段名，而不是正式的英语单词。"},{"en":"The script saves the user’s ddname to the database.","zh":"脚本把用户的 ddname 保存到数据库里。"}]}],"synonyms":["username","field name","variable name","label"],"phonetic":"/ˈdiːˌdiːneɪm/","extraExplanation":["“ddname”这种拼写更像是缩写或内部命名（例如表单字段、数据库列名、变量名）。如果你能提供它出现的句子、截图或所在网站/软件界面，我可以更准确判断它可能代表什么（例如 display name、dropdown name、domain name 等）。"]}
{"word":"DDoS","summary":{"en":"DDoS: a distributed denial-of-service cyberattack that overwhelms a target with traffic and makes it unavailable.","zh":"DDoS：分布式拒绝服务攻击，通过海量流量淹没目标，使其无法正常提供服务。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cyberattack in which many computers or devices flood a target server, website, or network with traffic so it becomes slow or unavailable","zh":"一种网络攻击：攻击者利用大量电脑或设备向目标服务器、网站或网络疯狂发送流量，导致其变慢甚至无法访问"},"examples":[{"en":"The company’s website went down during a DDoS attack.","zh":"公司网站在一次 DDoS 攻击期间瘫痪了。"},{"en":"They used a firewall to help reduce the impact of a DDoS.","zh":"他们使用防火墙来降低 DDoS 的影响。"},{"en":"The attacker launched a DDoS to distract the security team while stealing data.","zh":"攻击者发动 DDoS 来分散安全团队注意力，同时窃取数据。"}]}],"synonyms":["distributed denial-of-service attack","DDoS attack"],"phonetic":"/ˌdiː diː oʊ ˈɛs/","extraExplanation":["DDoS 是缩写，来自 Distributed Denial of Service（分布式拒绝服务）。“denial of service”指让服务“无法提供”，而“distributed”强调攻击流量来自许多不同来源（常见于被控制的“僵尸网络” botnet）。","常见搭配：launch a DDoS（发起攻击），mitigate/defend against a DDoS（缓解/防御），DDoS protection/mitigation service（防护/清洗服务）。","和 DoS 的区别：DoS 通常来自单一来源；DDoS 来自多来源，更难用简单封锁解决。"]}
{"word":"DDP","summary":{"en":"DDP most commonly means “Delivered Duty Paid” in international shipping; in tech it can mean “Distributed Data Parallel” for multi-GPU/multi-machine training.","zh":"DDP最常见指国际物流中的“完税后交货”；在技术领域也可指深度学习的“分布式数据并行”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Delivered Duty Paid (Incoterms): a shipping term meaning the seller is responsible for delivering goods to the buyer’s named place and paying all costs, including import duties and taxes.","zh":"完税后交货（国际贸易术语 Incoterms）：指卖方负责把货物送到买方指定地点，并承担包括进口关税与税费在内的全部费用与风险。"},"examples":[{"en":"We agreed on DDP Shanghai, so the seller will handle customs clearance and import taxes.","zh":"我们约定DDP上海，所以卖方会处理清关和进口税费。"},{"en":"Under DDP terms, the buyer usually pays only after the goods arrive at the named place.","zh":"在DDP条款下，买方通常只需要在货到指定地点后付款或安排收货。"}]},{"partOfSpeech":"n.","definition":{"en":"Distributed Data Parallel: a method in deep learning where training is split across multiple GPUs or machines, and model updates are synchronized.","zh":"分布式数据并行：深度学习中把训练任务分配到多块GPU或多台机器上，并同步模型参数更新的一种方法。"},"examples":[{"en":"We used PyTorch DDP to speed up training across four GPUs.","zh":"我们用PyTorch的DDP把训练扩展到四块GPU上以加速。"},{"en":"DDP can reduce training time, but setup and debugging may be more complex.","zh":"DDP可以缩短训练时间，但配置与排错通常更复杂。"}]},{"partOfSpeech":"other","definition":{"en":"Abbreviation used for various names (less common), depending on context (e.g., company names, programs, or roles).","zh":"在不同语境下也可能是其他名称的缩写（较不常见），例如公司名、项目名或职位名等。"},"examples":[{"en":"In this document, DDP refers to the Digital Development Program.","zh":"在这份文件中，DDP指“数字发展项目”。"}]}],"synonyms":["Delivered Duty Paid","Incoterms DDP","Distributed Data Parallel","data-parallel training"],"phonetic":"/ˌdiː diː ˈpiː/","extraExplanation":["DDP是Incoterms（国际贸易术语解释通则）里对卖方责任最重的条款之一：卖方不仅要安排运输，还要负责目的国清关并缴纳关税/进口增值税等。实际操作中，有些国家或地区对“非本地进口商”清关有限制，所以合同里常会补充由谁作为Importer of Record（进口商）以及税费如何结算。","在谈判时常把DDP与DAP（目的地交货，买方负责进口清关与税费）对比：DDP更“省心”但往往报价更高。"]}
{"word":"DDPEX","summary":{"en":"DDPEX is most likely an acronym whose meaning depends on context.","zh":"DDPEX 很可能是缩写，含义需要结合具体语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An acronym/initialism with no widely agreed dictionary meaning; its meaning depends on the context (e.g., a company name, product code, course/project abbreviation, or username).","zh":"一个缩写/首字母缩略词，本身没有通用的词典释义；具体含义取决于使用场景（例如公司名、产品型号、课程/项目简称或用户名）。"},"examples":[{"en":"What does DDPEX stand for in this document?","zh":"在这份文件里，DDPEX 代表什么？"},{"en":"DDPEX appears to be a project code—can you share where you saw it?","zh":"DDPEX 看起来像是项目代号——你是在哪里看到的？"}]}],"synonyms":["initialism","acronym","abbreviation"],"phonetic":"/ˌdiːˌdiːˌpiːˈiːks/","extraExplanation":["“DDPEX”不像常见英语单词，更像缩写。要准确解释，需要你提供上下文：它出现在哪（公司/软件/论文/物流/游戏/学校）？前后句是什么？是否有大小写或标点（如 DDPEX-1）？"]}
{"word":"DDR","summary":{"en":"DDR is an abbreviation that commonly means Double Data Rate (computer memory), the German Democratic Republic (East Germany), or Dance Dance Revolution (a rhythm game).","zh":"DDR是一个缩写，常见含义包括：双倍数据速率（电脑内存相关）、德意志民主共和国（东德）、以及音游《劲舞革命》。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(computing) Double Data Rate: a technology used in SDRAM/graphics memory where data is transferred twice per clock cycle (commonly seen in DDR3/DDR4/DDR5 RAM).","zh":"（计算机）DDR：双倍数据速率，一种用于内存/显存的技术，使数据在每个时钟周期传输两次（常见于DDR3/DDR4/DDR5内存）。"},"examples":[{"en":"My laptop supports DDR4 RAM, not DDR5.","zh":"我的笔记本支持DDR4内存，不支持DDR5。"},{"en":"Upgrading from DDR3 to DDR4 usually requires a new motherboard.","zh":"从DDR3升级到DDR4通常需要更换主板。"}]},{"partOfSpeech":"other","definition":{"en":"Deutsche Demokratische Republik: the German Democratic Republic (East Germany) from 1949 to 1990.","zh":"德意志民主共和国：1949年至1990年的东德（前东德政权/国家）。"},"examples":[{"en":"The Berlin Wall separated West Germany from the DDR for decades.","zh":"柏林墙曾将西德与东德（DDR）分隔了几十年。"},{"en":"Many people left the DDR before reunification in 1990.","zh":"在1990年德国统一前，许多人离开了东德（DDR）。"}]},{"partOfSpeech":"other","definition":{"en":"Dance Dance Revolution: a music/rhythm arcade game often shortened to DDR.","zh":"《劲舞革命》（Dance Dance Revolution）：一款音乐节奏街机游戏，常简称为DDR。"},"examples":[{"en":"We used to play DDR at the arcade after school.","zh":"我们以前放学后常在游戏厅玩DDR。"},{"en":"DDR is great exercise if you play on a harder level.","zh":"如果玩高难度，DDR是很好的运动。"}]}],"synonyms":["Double Data Rate","GDR","East Germany","Dance Dance Revolution"],"phonetic":"/ˌdiː diː ˈɑːr/","extraExplanation":["“DDR”是缩写，在不同领域含义差别很大：电脑硬件里最常指内存类型；历史语境里指“东德”；流行文化里也可能指音游《Dance Dance Revolution》。在阅读或聊天中可根据上下文（如DDR4/DDR5、柏林墙、街机/跳舞毯）来判断。"]}
{"word":"DDS","summary":{"en":"DDS is most commonly the dental degree “Doctor of Dental Surgery,” but it can also mean “Data Distribution Service” (computing) or “Direct Digital Synthesis” (electronics).","zh":"DDS最常见指牙科学位“牙科外科学博士”，也可能指计算机领域的“数据分发服务”或电子领域的“直接数字合成”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Doctor of Dental Surgery (a professional degree for dentists, especially in the U.S. and Canada).","zh":"牙科外科学博士（牙医的专业学位名称，常见于美国和加拿大）。"},"examples":[{"en":"She earned her DDS and opened a small dental clinic.","zh":"她获得了DDS学位，并开了一家小型牙科诊所。"},{"en":"Make an appointment with a DDS if you have tooth pain.","zh":"如果你牙痛，预约一位DDS（牙医）就诊。"}]},{"partOfSpeech":"n.","definition":{"en":"Data Distribution Service (a middleware standard for real-time data sharing in distributed systems).","zh":"数据分发服务（用于分布式系统实时数据共享的一种中间件标准）。"},"examples":[{"en":"The robotics team uses DDS to stream sensor data reliably.","zh":"机器人团队使用DDS来可靠地传输传感器数据。"},{"en":"DDS helps different modules communicate in real time.","zh":"DDS帮助不同模块进行实时通信。"}]},{"partOfSpeech":"n.","definition":{"en":"Direct Digital Synthesis (an electronics method for generating precise frequencies and waveforms).","zh":"直接数字合成（在电子工程中生成精确频率与波形的方法）。"},"examples":[{"en":"The signal generator uses DDS to produce stable sine waves.","zh":"这台信号发生器使用DDS来产生稳定的正弦波。"},{"en":"DDS can change frequency quickly with fine control.","zh":"DDS可以快速改变频率，并进行精细控制。"}]}],"synonyms":["Doctor of Dental Surgery","DMD (in dentistry, similar role)"],"phonetic":"/ˌdiːdiːˈɛs/","extraExplanation":["在北美牙科学位里，DDS和DMD通常同等地位：两者都是牙医的专业博士学位，课程与执业资格在多数情况下没有实质差别，只是学校历史传统不同。","在非医疗语境中看到DDS，常见于工程/计算机领域（如“Data Distribution Service”“Direct Digital Synthesis”）。判断含义时可以看上下文：与诊所、牙齿、看诊相关多半是学位；与分布式系统、传感器、实时通信相关多半是中间件标准；与频率、波形、信号发生器相关多半是电子技术。"]}
{"word":"DDSc","summary":{"en":"DDSc most commonly means Doctor of Dental Science (D.D.Sc.), an advanced doctorate in dentistry.","zh":"DDSc 通常指牙科科学博士（D.D.Sc.），属于牙科领域的高级博士学位。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for Doctor of Dental Science, an advanced academic or professional doctorate in dentistry (often written as D.D.Sc.).","zh":"“牙科科学博士”的缩写，一种牙科领域的高级学位（常写作 D.D.Sc.）。"},"examples":[{"en":"She earned a DDSc after completing advanced research in oral pathology.","zh":"她在完成口腔病理学的高阶研究后取得了 DDSc 学位。"},{"en":"The program lists DDSc as an eligible qualification for senior faculty positions.","zh":"该项目列出 DDSc 为申请高级教职职位的可接受学历之一。"}]}],"synonyms":["D.D.Sc.","Doctor of Dental Science"],"phonetic":"/ˌdiː diː ˈɛs siː/","extraExplanation":["在不同国家与学校体系里，牙科相关博士学位的名称不完全一致：常见有 DDS（Doctor of Dental Surgery，牙科外科博士）与 DMD（Doctor of Dental Medicine，牙科医学博士）。DDSc / D.D.Sc. 通常更偏“学术研究型或高阶专业型”的博士称号，但具体含金量与定位仍以授予机构与当地法规为准。","在正式写法中更常见的是加点的缩写“D.D.Sc.”；“DDSc”也会出现，尤其在名片、简历或系统字段中。"]}
{"word":"DDT","summary":{"en":"DDT is a well-known synthetic insecticide that was widely used in the past but later restricted because it can persist in the environment and harm wildlife.","zh":"DDT是一种著名的合成杀虫剂，过去曾广泛使用，但后来因难以降解且可能危害野生动物而受到限制。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a powerful synthetic insecticide (a pesticide) once widely used to kill mosquitoes and agricultural pests; later restricted or banned in many countries because it persists in the environment and harms wildlife","zh":"一种强效的合成杀虫剂（农药），曾被广泛用于消灭蚊子和农业害虫；后来因在环境中难以降解、会伤害野生动物而在许多国家被限制或禁用"},"examples":[{"en":"DDT was used in the mid-20th century to control malaria by killing mosquitoes.","zh":"在20世纪中期，人们曾用DDT通过杀死蚊子来控制疟疾。"},{"en":"Many countries banned DDT after scientists found it could damage bird populations.","zh":"科学家发现DDT可能破坏鸟类种群后，许多国家禁止了DDT。"},{"en":"The report discussed whether limited DDT use is appropriate in some public health emergencies.","zh":"报告讨论了在某些公共卫生紧急情况下是否适合有限使用DDT。"}]}],"synonyms":["insecticide","pesticide"],"phonetic":"/ˌdiː diː ˈtiː/","extraExplanation":["DDT是缩写，全称是 dichloro-diphenyl-trichloroethane（中文常译为“滴滴涕”）。它在二战后被大量使用，因效果显著而一度被视为“奇迹药剂”。","由于DDT具有“持久性”（不易分解）并会在食物链中累积，可能导致鸟类蛋壳变薄等生态问题；这类环境担忧在《Silent Spring》（《寂静的春天》）出版后受到广泛关注，推动了后续的监管与禁用。","在一些地区与情境下（如疟疾防控），关于DDT“有限、受控使用”的公共卫生与环境风险之间仍存在政策讨论。"]}
{"word":"ddt","summary":{"en":"DDT is a powerful insect-killing chemical, now banned or tightly controlled in many places due to long-lasting environmental harm.","zh":"DDT 是一种强效杀虫化学品，但因长期环境危害在许多地区已被禁用或严格管控。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strong insecticide (a chemical that kills insects) that was widely used in the mid-1900s but later banned or strictly controlled in many countries because it harms wildlife and can remain in the environment for a long time.","zh":"一种强效杀虫剂（杀死昆虫的化学品），在20世纪中期曾被广泛使用，但后来因危害野生动物且在环境中长期残留，在许多国家被禁用或严格管制。"},"examples":[{"en":"DDT was once sprayed to control mosquitoes and reduce malaria.","zh":"DDT 曾被喷洒用于控制蚊子、降低疟疾传播。"},{"en":"Many countries banned DDT because it caused serious environmental damage.","zh":"许多国家禁用 DDT，是因为它造成了严重的环境破坏。"},{"en":"Some places still allow limited DDT use for public health emergencies.","zh":"一些地区仍允许在公共卫生紧急情况下有限使用 DDT。"}]}],"synonyms":["insecticide","pesticide"],"phonetic":"/ˌdiː ˌdiː ˈtiː/","extraExplanation":["DDT 是 “dichloro-diphenyl-trichloroethane” 的缩写（中文常译“滴滴涕”）。它属于“持久性有机污染物”，容易在食物链中累积（例如从昆虫到鱼再到鸟），曾导致猛禽繁殖受影响（如鸟蛋壳变薄）。","环境运动中常被提到的书是 Rachel Carson 的《Silent Spring》（《寂静的春天》），它推动了公众对农药风险的关注，并影响了后续政策。"]}
{"word":"DDVP","summary":{"en":"DDVP usually means dichlorvos, an organophosphate insecticide; in other contexts it may be a field-specific abbreviation.","zh":"DDVP 通常指敌敌畏（dichlorvos）这种有机磷杀虫剂；在其他语境中也可能是某领域的特定缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An organophosphate insecticide (dichlorvos) used to kill insects, especially in pest strips or fumigation products.","zh":"一种有机磷杀虫剂（敌敌畏；学名 dichlorvos），常用于杀灭昆虫，常见于杀虫条/熏蒸类产品中。"},"examples":[{"en":"The label says the pest strip contains DDVP, so you should use it only in a well‑ventilated area.","zh":"标签写着这款杀虫条含有 DDVP，所以只能在通风良好的地方使用。"},{"en":"Some countries restrict DDVP because it can be hazardous to humans if misused.","zh":"一些国家对 DDVP 有限制，因为误用可能对人体有危害。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) An abbreviation used in some technical contexts; the meaning depends on the field (for example, a project or protocol name).","zh":"（较少见）在某些技术语境中的缩写；具体含义取决于领域（例如某个项目名或协议名）。"},"examples":[{"en":"In this document, DDVP refers to a specific internal protocol—check the glossary for the exact meaning.","zh":"在这份文件里，DDVP 指的是一个特定的内部协议——请查看术语表获取准确含义。"}]}],"synonyms":["dichlorvos","organophosphate insecticide"],"phonetic":"/ˌdiː diː viː ˈpiː/","extraExplanation":["DDVP 在日常与公共卫生/农药语境里最常指“敌敌畏（dichlorvos）”。它属于有机磷类，可能通过吸入、皮肤接触或误食造成中毒风险；因此现实使用中应严格遵守产品标签与当地法规，并避免在密闭空间或有儿童、宠物的环境中不当使用。","发音上常按字母读：D-D-V-P。书写时多为全大写。"]}
{"word":"DDX","summary":{"en":"DDX most commonly means “differential diagnosis,” a list of possible causes of symptoms (especially in medicine).","zh":"DDX 最常见指“鉴别诊断”，即对症状可能原因的候选清单（多用于医学）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medicine) Differential diagnosis: a list of possible diseases or conditions that could explain a patient’s symptoms, used to decide what to test for next.","zh":"（医学）鉴别诊断：根据症状列出可能的疾病/状况清单，用来指导下一步检查与排除。"},"examples":[{"en":"Fever and cough put flu and pneumonia on the DDX.","zh":"发烧和咳嗽会把流感和肺炎列入鉴别诊断（DDX）。"},{"en":"Chest pain has a broad DDX, so the doctor asked more questions.","zh":"胸痛的鉴别诊断范围很广，所以医生又问了更多问题。"},{"en":"We need labs and imaging to narrow the DDX.","zh":"我们需要化验和影像检查来缩小鉴别诊断范围。"}]},{"partOfSpeech":"n.","definition":{"en":"(computing, less common) In the X Window System, DDX refers to the device-dependent part of a display driver (code specific to certain graphics hardware).","zh":"（计算机，较少见）在 X Window System 中，DDX 指显示驱动中“依赖设备”的部分（针对特定图形硬件的代码）。"},"examples":[{"en":"The bug was traced to the DDX layer of the graphics driver.","zh":"这个问题被追踪到图形驱动的 DDX 层。"},{"en":"Different GPUs may require different DDX implementations.","zh":"不同的显卡可能需要不同的 DDX 实现。"}]}],"synonyms":["differential diagnosis","differential (informal)"],"phonetic":"/ˌdiːdiːˈɛks/","extraExplanation":["在临床交流里，DDX 很常见，常写作“DDx”。医生说“on the DDX”表示“在鉴别诊断列表里”。它强调“先列可能性，再用检查逐一排除”，并不等于最终确诊。"]}

