{"word":"deg","summary":{"en":"“deg” usually means “degree” (temperature/angle/academic degree). Online slang can also mean “degenerate,” an insult.","zh":"“deg”通常是“degree（度/学位）”的缩写；在网络俚语中也可指“degenerate（堕落者）”，带侮辱性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbrev.) degree; used for temperature, angles, or academic degrees.","zh":"（缩写）degree“度”；可指温度、角度或学位。"},"examples":[{"en":"It’s 30 deg outside today.","zh":"今天外面是30度。"},{"en":"Turn the knob 90 deg to the right.","zh":"把旋钮向右转90度。"},{"en":"She earned a master’s deg in education.","zh":"她获得了教育学硕士学位。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang, mainly online) a shortened form of “degenerate,” meaning a person seen as having low morals or bad behavior (often insulting).","zh":"（俚语，多见于网络）degenerate（堕落者）的缩写，指被认为品行低下或行为不当的人（常带侮辱）。"},"examples":[{"en":"Don’t call people “degs”—it’s rude.","zh":"别叫别人“degs”，这很没礼貌。"},{"en":"The comment section was full of insults like “deg.”","zh":"评论区充满了像“deg”这样的辱骂词。"}]}],"synonyms":["degree","deg. (variant spelling)","° (symbol, in measurements)","degenerate (for the slang meaning)"],"phonetic":"/dɛɡ/","extraExplanation":["“deg”在正式写作中不太常见；科学/工程语境更常写作“°”（例如30°C）或“deg.”（带句点）。在一般英文文章里，写全“degree(s)”更清晰。","“deg”=“degenerate”的用法带强烈贬义，容易冒犯他人；学习时了解即可，实际表达中建议避免使用。"]}
{"word":"degage","summary":{"en":"Dégagé means either a ballet movement/step where the foot brushes off the floor into an extended position, or a relaxed, unconcerned manner.","zh":"Dégagé 可指芭蕾中的脚擦地离地并伸出的动作/步伐，也可形容人举止从容洒脱、不紧绷。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially in ballet) describing a movement where a foot is lifted or brushed off the floor into an extended position, with weight staying on the other leg; also used for the step itself.","zh":"（尤指芭蕾）指“脚离地/擦地后抬起并伸出”的动作；也可指该动作本身。"},"examples":[{"en":"In class we practiced dégagé to the side, keeping the supporting leg strong.","zh":"在课上我们练习旁向 dégagé，支撑腿要稳。"},{"en":"Her dégagé was clean and quick, with the toes fully pointed.","zh":"她的 dégagé 干净利落，脚尖绷得很到位。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relaxed, casual, and not showing anxiety; pleasantly unconcerned.","zh":"从容随意的；不显得焦虑的；带点“洒脱、淡定”的感觉。"},"examples":[{"en":"He kept a dégagé smile even under pressure.","zh":"即使压力很大，他依然保持一种洒脱的微笑。"},{"en":"She spoke in a dégagé, confident way.","zh":"她说话的方式从容而自信。"}]},{"partOfSpeech":"n.","definition":{"en":"A ballet step: a dégagé (the action of brushing the foot off the floor and extending it).","zh":"（芭蕾）dégagé 动作/步伐：脚擦地离地并伸出的动作。"},"examples":[{"en":"The combination ends with two dégagés and a turn.","zh":"这组组合以两个 dégagé 加一个转结束。"}]}],"synonyms":["relaxed","casual","unaffected","nonchalant","at ease"],"phonetic":"/ˌdeɪɡɑːˈʒeɪ/","extraExplanation":["“dégagé”原本是法语，意思接近“解放的、松开的”，所以在芭蕾里强调“脚从地面‘放开/离开’”，在日常英语里则引申为“从容、不紧绷”。","英语里常写作 dégagé（带重音符号），也有人写成 degage。发音以法语来源为基础，结尾更像“zhay”。"]}
{"word":"degalvanize","summary":{"en":"De-galvanize means to remove an energizing/electrical effect, or figuratively to drain enthusiasm and momentum.","zh":"degalvanize 指“去除电活化作用”，也可比喻“让人/事失去热情与动力”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove the galvanic (electric/energizing) effect from something; to stop a process or object from being electrically stimulated or activated.","zh":"使去除电化（电刺激/电活化）作用；使停止由电刺激引起的活化或反应。"},"examples":[{"en":"The technician degalvanized the setup to prevent unwanted electric reactions.","zh":"技术员对装置进行去电化处理，以防止不必要的电化学反应。"},{"en":"After the test, the electrodes were degalvanized and stored safely.","zh":"测试结束后，电极被去电化处理并安全存放。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative) to take away someone’s enthusiasm or energy; to make something feel less lively or motivating.","zh":"（比喻）使失去热情或干劲；让事情变得不再有活力或不再能激励人。"},"examples":[{"en":"Constant criticism can degalvanize a team.","zh":"持续的批评会让团队失去干劲。"},{"en":"The sudden budget cut degalvanized the project and slowed everything down.","zh":"突如其来的预算削减让项目失去动力，进度也慢了下来。"}]}],"synonyms":["deactivate","neutralize","de-energize","demotivate","discourage"],"phonetic":"/diˈɡælvəˌnaɪz/","extraExplanation":["“de-”表示“去除/解除”，搭配“galvanize”（使通电、使兴奋/激励）构成反义方向的动词，因此“degalvanize”在技术语境里多指去除电化学或电刺激造成的效应。","这个词在日常英语中不常见；比喻义通常更常用的说法是“demotivate / discourage / deflate”。如果你想表达“让人失去干劲”，这些词会更自然。"]}
{"word":"degalvanized","summary":{"en":"“Degalvanized” means the zinc coating has been removed from galvanized metal (or describes metal after that process).","zh":"“degalvanized”指镀锌金属的锌保护层已被去除（或形容去镀锌后的金属）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having had its galvanizing (protective zinc coating) removed; no longer zinc‑coated.","zh":"（金属）已去除镀锌层的；不再有锌保护层的。"},"examples":[{"en":"The degalvanized steel will rust faster if it isn’t painted.","zh":"去镀锌的钢如果不涂漆，会更快生锈。"},{"en":"They used degalvanized sheet metal because the welding process required a clean surface.","zh":"他们使用去镀锌的薄钢板，因为焊接需要更干净的表面。"}]},{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of “degalvanize”: to remove the zinc coating from galvanized metal.","zh":"“degalvanize”的过去式/过去分词：把镀锌金属上的锌层去除。"},"examples":[{"en":"The parts were degalvanized before repainting.","zh":"这些零件在重新喷漆前先做了去镀锌处理。"},{"en":"The technician degalvanized the surface to prepare it for soldering.","zh":"技师将表面去镀锌，以便进行焊接/焊锡准备。"}]}],"synonyms":["zinc-stripped","de-zinced","uncoated (after galvanizing)"],"phonetic":"/diːˈɡælvəˌnaɪzd/","extraExplanation":["“galvanized”通常指在钢铁表面镀上一层锌（热浸镀锌或电镀锌），用来防锈；“de-”有“去除、反向”的意思，所以“degalvanized”就是“去掉镀锌层”。","在实际语境中，这个词多见于制造、维修、焊接、表面处理等领域；普通日常英语里不常用。","去镀锌后金属更容易腐蚀，因此常会再做喷漆、涂层或其他防护处理。"]}
{"word":"degame","summary":{"en":"“degame” is a rare, informal verb meaning to remove game-like features (or, less commonly, to stop gaming).","zh":"“degame”是少见的非正式动词，通常指“去游戏化/去掉游戏机制”，较少情况下也可指“停止玩游戏”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(informal, rare) To remove game-like elements from something; to make an activity or system less like a game (opposite of “gamify”).","zh":"（非正式，用得很少）把某事物中的“游戏化”元素去掉；让一个活动/系统变得不那么像游戏（与“gamify/游戏化”相对）。"},"examples":[{"en":"The school decided to degame the app because students were focusing more on points than learning.","zh":"学校决定把这个应用去游戏化，因为学生更关注积分而不是学习。"},{"en":"We need to degame the training program so it feels more professional.","zh":"我们需要把培训项目去游戏化，让它更专业。"}]},{"partOfSpeech":"vi.","definition":{"en":"(informal, very rare) To stop playing a game; to quit a gaming habit.","zh":"（非正式，极少见）停止玩游戏；戒掉游戏习惯。"},"examples":[{"en":"After finals, he tried to degame for a month.","zh":"期末考后，他试着一个月不玩游戏。"}]}],"synonyms":["de-gamify","remove gamification","make it less game-like","quit gaming","stop gaming"],"phonetic":"/diːˈɡeɪm/","extraExplanation":["“degame”不是常见的标准英语词，在正式写作中更常用“de-gamify / remove gamification / make it less game-like（去游戏化/减少游戏化）”。","在产品设计、教育科技、用户体验（UX）讨论里，有时会临时造词用“degame”来表达“把积分、徽章、排行榜等机制拿掉”。","如果你想表达“戒游戏/少玩游戏”，更自然的说法是“quit gaming / stop gaming / cut back on gaming”。"]}
{"word":"degames","summary":{"en":"“degames” is not a standard English word; it’s usually a name/username/brand or a misspelling of “games.”","zh":"“degames”不是标准英语词；通常是名字/用户名/品牌名，或把“games”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in major dictionaries; most often seen as a name/username/brand or a typo (commonly for “games”).","zh":"不是主流英语词典中的标准词；多见于人名/用户名/品牌名，或是拼写错误（常见想写成“games”）。"},"examples":[{"en":"I couldn’t find “degames” in a dictionary—do you mean “games” or a company name?","zh":"我在词典里找不到“degames”——你是想写“games”，还是某个公司/名字？"},{"en":"Degames is the username he uses online.","zh":"Degames 是他在网上使用的用户名。"}]}],"synonyms":["games (if this was the intended word)"],"phonetic":"/diːˈɡeɪmz/","extraExplanation":["如果你能提供一句包含“degames”的原句（或说明是标题、ID、品牌名还是拼写练习），我可以更准确判断它想表达的词：\n- 可能是拼错的“games”（游戏/比赛）。\n- 也可能是专有名词（姓氏、频道名、项目名），这种情况下通常不翻译，只解释其指代对象。"]}
{"word":"degami","summary":{"en":"“Degami” is not a common dictionary English word; it is likely a name or a misspelling.","zh":"“degami”不是常见的词典英语词，更可能是名字或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in general dictionaries; it is most likely a proper name (e.g., a surname, username, brand) or a misspelling of another word.","zh":"一般英语词典中不收录的标准英语词；更可能是专有名词（如姓氏、用户名、品牌）或其他单词的拼写错误。"},"examples":[{"en":"I couldn’t find “degami” in the dictionary—do you mean a name or a different word?","zh":"我在词典里找不到“degami”——你是指一个名字还是另一个单词？"},{"en":"Degami appears to be a username on social media.","zh":"Degami 看起来像是社交媒体上的用户名。"}]}],"phonetic":"/dəˈɡɑmi/","extraExplanation":["“degami”很可能是拼写误差。如果你想找的是“origami /ˌɔrɪˈɡɑmi/（折纸）”，请告诉我你的语境（你在哪儿看到的、句子是什么），我可以按正确词条给出释义、例句和相关短语。","也有可能你想输入的是“degaming /diːˈɡeɪmɪŋ/”（在数据分析中指“反游戏化/去策略性操控”的一种说法，但较专业且不常见）。如果你提供原句，我能更准确判断。"]}
{"word":"degamis","summary":{"en":"“degamis” is not a recognized English word; it’s likely a typo or a proper name.","zh":"“degamis”不是常见英语词汇；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username/brand name, or a family name (proper noun).","zh":"不是标准英语单词；可能是拼写错误、用户名/品牌名，或姓氏等专有名词。"},"examples":[{"en":"I couldn’t find “degamis” in an English dictionary—did you mean a different word?","zh":"我在英语词典里找不到“degamis”——你是不是想写另一个词？"},{"en":"If “degamis” is a name, please share the sentence so I can help explain it.","zh":"如果“degamis”是人名/专有名词，请给我完整句子，我可以帮你解释。"}]}],"phonetic":"/dəˈɡeɪmɪs/","extraExplanation":["“degamis”看起来像拼写误差。你可以检查是否想输入：\n1) **“dreams”**（梦想，复数）\n2) **“damage” / “damages”**（损害 / 赔偿金）\n3) **“de-gam(e)s”**（把 game 分开写的形式，较少见）\n如果你把它放在一个句子里（或告诉我语境：游戏、社交媒体名字、公司名等），我能更准确判断。"]}
{"word":"deganglionate","summary":{"en":"A medical verb meaning to surgically remove or disable a nerve ganglion.","zh":"医学动词：通过手术切除或使神经节失去功能。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(medicine) To remove a ganglion (a cluster of nerve cells) from the body by surgery, or to cut/destroy a ganglion so it no longer functions.","zh":"（医学）通过手术切除神经节（神经细胞的聚集），或切断/破坏神经节使其不再发挥功能。"},"examples":[{"en":"In severe pain cases, the surgeon may deganglionate a specific nerve pathway.","zh":"在一些严重疼痛病例中，外科医生可能会对特定神经通路进行神经节切除/毁损。"},{"en":"The procedure aimed to deganglionate the sympathetic ganglion to reduce abnormal nerve signals.","zh":"该手术旨在切除/毁损交感神经节，以减少异常神经信号。"}]}],"synonyms":["remove a ganglion","ablate a ganglion","perform a ganglionectomy"],"phonetic":"/diːˈɡæŋɡliəˌneɪt/","extraExplanation":["这是一个非常专业的医学用词，日常英语中几乎不会用到。更常见的相关表达包括：remove a ganglion（切除神经节）、ganglionectomy（神经节切除术）、ablate a ganglion（消融神经节）。","构词上：de- 常表示“去除/解除”，ganglion 指“神经节”，-ate 常用于动词结尾，整体意思就是“去除神经节”。"]}
{"word":"degarnish","summary":{"en":"Degarnish means to remove a garnish or decorative topping from a dish.","zh":"Degarnish 指把菜肴上的装饰配料或点缀物去掉。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove a garnish or decorative topping from food or a dish","zh":"（从食物或菜肴上）去掉装饰配料；去除点缀物"},"examples":[{"en":"Please degarnish the plate before serving it to the guest who has allergies.","zh":"在端给对香料过敏的客人之前，请把盘子上的装饰配料去掉。"},{"en":"The chef degarnished the soup, removing the cilantro leaves.","zh":"厨师给汤去掉了点缀物，把香菜叶拿掉了。"},{"en":"If the garnish wilts, degarnish and add a fresh sprig at the last minute.","zh":"如果装饰用的香草蔫了，就先去掉，最后一刻再换上新的一枝。"}]}],"synonyms":["remove the garnish","take off the garnish","strip (of garnish)"],"phonetic":"/diˈɡɑrnɪʃ/","extraExplanation":["“degarnish”多见于餐饮/厨师用语或操作说明里：garnish（装饰配料）+ de-（表示“去除”）。日常英语中更常说“remove the garnish / take off the garnish”。"]}
{"word":"Degas","summary":{"en":"Degas: Edgar Degas, a French artist famous for ballet dancers and everyday-life scenes; also used to mean a work by him.","zh":"Degas：德加，法国艺术家，以芭蕾舞者和日常生活题材著称；也可指他的一件作品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Edgar Degas (1834–1917), a French artist best known for paintings, drawings, and sculptures—especially scenes of ballet dancers and everyday life; often associated with Impressionism.","zh":"德加（Edgar Degas，1834–1917），法国艺术家，以绘画、素描与雕塑闻名，尤以芭蕾舞者与日常生活题材著称；常与印象派联系在一起。"},"examples":[{"en":"Degas is famous for his paintings of ballet dancers.","zh":"德加因描绘芭蕾舞者的作品而闻名。"},{"en":"We studied Degas in art class and discussed how he captured movement.","zh":"我们在美术课上学习了德加，并讨论他如何捕捉动作感。"},{"en":"The museum has a Degas in its Impressionist collection.","zh":"这家博物馆的印象派馆藏里有一幅德加的作品。"}]}],"synonyms":["Edgar Degas"],"phonetic":"/dəˈɡɑ/","extraExplanation":["“Degas”在英语里通常读作“德-嘎”（重音在后），多用于艺术史与博物馆语境。","虽然德加常被归入“印象派”，但他本人更喜欢被看作现实主义与古典训练背景下的艺术家；他尤其擅长用不对称构图与“抓拍感”表现城市生活与舞者的瞬间。","在英文中说“a Degas”常指“一件德加的作品”（如一幅画/一件雕塑），属于以艺术家姓名指代其作品的常见用法。"]}
{"word":"degas","summary":{"en":"Degas is the name of the French artist Edgar Degas, famous for ballet dancer artworks and often associated with Impressionism.","zh":"Degas 指法国艺术家埃德加·德加，以芭蕾舞者题材作品闻名，常与印象派相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Edgar Degas (1834–1917), a French artist best known for paintings and drawings of ballet dancers and scenes of everyday life; often linked with the Impressionists.","zh":"埃德加·德加（1834–1917），法国艺术家，以芭蕾舞者与日常生活题材的绘画和素描最著名；常与印象派联系在一起。"},"examples":[{"en":"We studied Degas’s ballet dancer paintings in art class.","zh":"我们在美术课上学习了德加的芭蕾舞者画作。"},{"en":"The museum has a small Degas exhibition this month.","zh":"这家博物馆本月有一个小型德加展览。"},{"en":"Her sketchbook style reminds me of Degas.","zh":"她的速写本风格让我想起德加。"}]}],"synonyms":["Edgar Degas","the French painter Degas"],"phonetic":"/dəˈɡɑː/","extraExplanation":["在英语里“Degas”通常指画家埃德加·德加本人；也可用来指“德加的作品”（例如：a Degas = 一幅/一件德加的作品）。","常见英文读法接近“duh-GAH”，重音在第二音节。","德加虽然常被归为“印象派”，但他本人更倾向把自己看作现实主义传统的一部分；他以构图大胆、捕捉瞬间动作（尤其是芭蕾排练与演出后台场景）而闻名。"]}
{"word":"degases","summary":{"en":"“Degas/degases” means to remove gas from a liquid or material, or for gas to be released.","zh":"“degas/degases”表示给液体或材料脱气（去除气体），或气体从中逸出。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove dissolved or trapped gas from a liquid or material","zh":"给（液体或材料）脱气；去除其中溶解或夹带的气体"},"examples":[{"en":"We degas the solution before measuring it.","zh":"我们在测量前先给溶液脱气。"},{"en":"Let the paint sit so it can degas and lose bubbles.","zh":"让油漆静置一会儿，让它脱气、气泡减少。"}]},{"partOfSpeech":"vi.","definition":{"en":"to release gas (from a liquid or material)","zh":"（液体或材料）放气；逸出气体"},"examples":[{"en":"After heating, the mixture degases quickly.","zh":"加热后，这个混合物很快就会放气。"}]}],"synonyms":["degasify","vent","outgas (similar in meaning)"],"phonetic":"/diˈɡæs/","extraExplanation":["“degases”通常是动词“degas”的第三人称单数（He/She/It degases）。更常见的拼写是“degasses”（双写 s），两种都能见到，但在科研与工程写作里“degasses”更常用。","常见语境：化学/实验室（给溶剂脱气以避免影响测量）、食品与饮料（让汽水放气）、材料与制造（树脂、油漆、硅胶脱气以减少气泡）。"]}
{"word":"degasification","summary":{"en":"Degasification means removing dissolved or trapped gases from a material, often to prevent bubbles, oxidation, or corrosion.","zh":"Degasification 指对材料进行“脱气”，去除溶解或夹带的气体，常用于防止气泡、氧化或腐蚀。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of removing dissolved gases or trapped air from a liquid or solid material","zh":"从液体或固体材料中去除溶解气体或夹带空气的过程（脱气）"},"examples":[{"en":"Degasification is used to remove oxygen from water to reduce corrosion in pipes.","zh":"脱气常用于从水中去除氧气，以减少管道腐蚀。"},{"en":"The resin underwent degasification before molding to prevent bubbles in the final product.","zh":"树脂在浇注成型前进行了脱气，以避免成品出现气泡。"}]}],"synonyms":["degassing","deaeration"],"phonetic":"/diˌɡæsəfəˈkeɪʃən/","extraExplanation":["词源提示：de- 有“去除”之意，gas 指“气体”，-ification 表示“……化/过程”。因此 degasification 直观理解为“去气体的过程”。","常见场景包括：食品与饮料（如真空脱气减少氧化）、化工与塑料（减少气泡缺陷）、水处理与锅炉系统（降低溶解氧和二氧化碳以减缓腐蚀）。","近义表达在工程语境中常见 degassing（更口语/常用），degasification 更偏正式或技术文档。"]}
{"word":"degasified","summary":{"en":"Degasified means gases have been removed from a liquid or material; it’s also the past form of “degasify.”","zh":"degasified表示（液体或材料）已脱气/已去除气体；也可作“degasify”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a liquid or material) having had dissolved or trapped gases removed.","zh":"（液体或材料）已去除溶解或夹带气体的；已脱气的。"},"examples":[{"en":"We used degasified water to avoid bubbles during the experiment.","zh":"我们使用了脱气水，以避免实验中产生气泡。"},{"en":"Degasified silicone makes fewer voids in the final mold.","zh":"脱气后的硅胶在最终模具里产生的空洞更少。"}]},{"partOfSpeech":"v.","definition":{"en":"Past form of “degasify”: to remove dissolved or trapped gases from something.","zh":"“degasify（脱气）”的过去式/过去分词：从某物中去除溶解或夹带的气体。"},"examples":[{"en":"The technician degasified the resin before pouring it into the mold.","zh":"技术员在把树脂倒入模具前先进行了脱气处理。"},{"en":"After the sample was degasified, the readings became more stable.","zh":"样品脱气后，读数变得更稳定。"}]}],"synonyms":["deaerated","de-gassed","gas-free"],"phonetic":"/diˈɡæsəˌfaɪd/","extraExplanation":["“de-”是英语里常见前缀，表示“去除、反向”。“degasify”多见于实验室、材料加工、食品饮料与真空工艺等场景（如脱气水、脱气树脂、脱气硅胶）。常见方法包括真空脱气、加热/搅拌脱气或通入惰性气体置换。"]}
{"word":"degasifier","summary":{"en":"A degasifier removes dissolved gas from a liquid (usually a device; sometimes a chemical additive).","zh":"degasifier 指用于去除液体中溶解气体的“脱气器/除气装置”，有时也指“脱气剂”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device or system that removes dissolved gases (such as oxygen or carbon dioxide) from a liquid, often to prevent corrosion, foaming, or quality problems.","zh":"脱气器；除气装置：用于把液体中溶解的气体（如氧气、二氧化碳）去除的设备或系统，常用于防腐蚀、防起泡或保证品质。"},"examples":[{"en":"The boiler feedwater passes through a degasifier to remove oxygen and reduce corrosion.","zh":"锅炉给水会先经过脱气器去除氧气，以减少腐蚀。"},{"en":"In beverage production, a degasifier can help improve taste and stabilize the filling process.","zh":"在饮料生产中，脱气器可以改善口感，并让灌装过程更稳定。"}]},{"partOfSpeech":"n.","definition":{"en":"A chemical additive (used more broadly) that removes gas from a liquid; often called a “degasifying agent.”","zh":"（较广义）脱气剂：通过化学方式去除液体中气体的添加剂；也常称“脱气/除气助剂”。"},"examples":[{"en":"The formula includes a degasifier to minimize bubbles in the resin.","zh":"该配方加入脱气剂，以减少树脂中的气泡。"}]}],"synonyms":["deaerator","degassing unit","degasifying agent"],"phonetic":"/diːˈɡæsəˌfaɪɚ/","extraExplanation":["词源提示：de- 表示“去除”，gas 表示“气体”，-ifier 表示“使成为/使发生……的东西”，合起来就是“把气体去掉的装置或物质”。","常见领域：锅炉/电厂水处理、化工（树脂/涂料）、饮料与食品加工等。不同场景的工作方式可能是加热、抽真空、膜分离或化学反应等。","用法区分：在工程语境中更常指“设备/系统”；在材料与配方语境中可能指“添加剂”。如果不确定，可改说 degassing unit（脱气装置）或 degasifying agent（脱气剂）以更明确。"]}
{"word":"degasify","summary":{"en":"Degasify means to remove gases from a material, especially in lab or manufacturing contexts.","zh":"Degasify 指对材料进行“脱气”，常用于实验或制造过程中去除其中的气体。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove dissolved or trapped gases from a liquid, solid, or material (often in manufacturing or laboratory work)","zh":"（常用于制造或实验）从液体、固体或材料中去除溶解或夹带的气体"},"examples":[{"en":"Before casting the resin, we degasify it in a vacuum chamber to prevent bubbles.","zh":"在浇注树脂之前，我们会在真空室里对其脱气，以防产生气泡。"},{"en":"The technician degasified the solution to improve the accuracy of the measurement.","zh":"技术人员对溶液进行了脱气处理，以提高测量的准确性。"}]}],"synonyms":["degas","deaerate","outgas"],"phonetic":"/diːˈɡæsɪfaɪ/","extraExplanation":["“de-”表示“去除、去掉”，“-ify”表示“使……成为/使……化”。因此 degasify 字面意思就是“使去除气体”，常见于材料科学、化学、食品加工等语境。","在实际使用中，很多工程或实验场景更常说 degas（脱气）或 deaerate（除气/除氧气，偏向去除空气）。"]}
{"word":"degass","summary":{"en":"“degas” usually means to remove gas (degas a liquid). “Degas” (capitalized) is the French artist Edgar Degas.","zh":"“degas”通常指“脱气/排气”。“Degas”（大写）指法国艺术家埃德加·德加。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove dissolved or trapped gas from a liquid, mixture, or container (often in science, manufacturing, or cooking)","zh":"（常用于科学、制造或烹饪中）给液体、混合物或容器“脱气/排气”，去除溶解或残留的气体"},"examples":[{"en":"We degas the resin to remove air bubbles before pouring it into the mold.","zh":"我们先给树脂脱气，去掉气泡，再倒进模具里。"},{"en":"Let the hot soup sit for a minute to degas before you blend it.","zh":"热汤先放一会儿排气，再用搅拌机打碎。"}]},{"partOfSpeech":"n.","definition":{"en":"(name) Edgar Degas, a French Impressionist-era artist famous for paintings and sculptures of dancers and everyday life","zh":"（人名）埃德加·德加：法国印象派时期的重要艺术家，以描绘芭蕾舞者和日常生活的绘画与雕塑闻名"},"examples":[{"en":"We studied Degas’s paintings of ballet rehearsals in art class.","zh":"美术课上我们学习了德加描绘芭蕾排练的作品。"},{"en":"The museum has several Degas drawings and a small bronze dancer.","zh":"那家博物馆有几幅德加的素描和一尊小型青铜舞者雕塑。"}]}],"synonyms":["degas (remove gas)","vent","purge","deaerate"],"phonetic":"/diˈɡæs/","extraExplanation":["你输入的“degass”更常见的拼写是 **degas**（动词：脱气/排气）。在英语里，结尾一般不需要再加一个 s。","如果你本来想写法国画家，标准写法是 **Degas**（首字母大写），指埃德加·德加。"]}
{"word":"degassed","summary":{"en":"“Degassed” describes something from which dissolved gases have been removed; it’s also the past form of “degas.”","zh":"“degassed”指已去除溶解气体的（脱气的），也可作动词“degas”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a liquid or material) having had dissolved gases removed; de-aerated.","zh":"（液体或材料）已除去溶解气体的；脱气的（去气的）。"},"examples":[{"en":"Use degassed water to avoid bubbles in the experiment.","zh":"实验中使用脱气水以避免产生气泡。"},{"en":"The resin must be degassed before pouring it into the mold.","zh":"树脂在倒入模具前必须先脱气。"}]},{"partOfSpeech":"v.","definition":{"en":"Past form of “degas”: to remove dissolved gases from something.","zh":"“degas”的过去式/过去分词：给……脱气；去除其中溶解的气体。"},"examples":[{"en":"We degassed the solution under vacuum for ten minutes.","zh":"我们在真空条件下给溶液脱气了十分钟。"},{"en":"The sample was degassed to improve measurement accuracy.","zh":"样品经过脱气处理以提高测量准确性。"}]}],"synonyms":["deaerated","de-aerated","gas-free","deoxygenated (context-dependent)"],"phonetic":"/diˈɡæst/","extraExplanation":["“degassed”常见于化学、食品与材料领域：例如“degassed water（脱气水）”“degassed resin（脱气树脂）”。脱气可以减少气泡、避免氧化干扰、提高实验或成型质量。","常见方法包括真空脱气（vacuum degassing）、加热/煮沸后冷却、超声（ultrasonic）或通入惰性气体（如氮气）置换。具体选择取决于材料和目的。"]}
{"word":"degasser","summary":{"en":"Degasser usually means a device that removes dissolved gas from a liquid; less commonly it can be used as a verb meaning “to degas.”","zh":"Degasser通常指“脱气器/除气装置”，用于去除液体中的溶解气体；较少情况下也可作动词，表示“使脱气/除气”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device or machine that removes dissolved gases from a liquid (such as water, oil, or molten metal).","zh":"脱气器；除气装置（用来从液体中去除溶解气体，如水、油或熔融金属）。"},"examples":[{"en":"The boiler system includes a degasser to prevent corrosion caused by oxygen.","zh":"锅炉系统配有脱气器，以防止氧气引起的腐蚀。"},{"en":"In aluminum processing, a degasser helps remove hydrogen bubbles from molten metal.","zh":"在铝加工中，脱气器有助于去除熔融金属中的氢气气泡。"}]},{"partOfSpeech":"vt.","definition":{"en":"to remove dissolved gases from a liquid; to degas.","zh":"使脱气；除去（液体中的）溶解气体；脱气。"},"examples":[{"en":"You should degasser the resin before pouring it into the mold.","zh":"在把树脂倒入模具前，你应该先给树脂脱气。"},{"en":"The technician degassered the water to improve process stability.","zh":"技术员对水进行脱气，以提高工艺稳定性。"}]}],"synonyms":["deaerator","degasser unit","degas (verb)","gas remover"],"phonetic":"/ˌdiːˈɡæsər/","extraExplanation":["“degasser”常见于工程/化工语境，更标准的英语表达通常是动词“degass”（脱气）和名词“degasser”（脱气器）。","拼写上你输入的“degasser”像法语来源的形式；在英语技术资料中也能见到，但日常英语里较少用。"]}
{"word":"degassers","summary":{"en":"“Degassers” are machines or tools (or sometimes people) that remove dissolved gas from liquids or other materials.","zh":"“Degassers”指用于从液体或其他材料中去除溶解气体的脱气装置（有时也可指进行脱气的人/工具）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device or machine that removes dissolved gases (like oxygen or carbon dioxide) from a liquid, especially in industrial processes","zh":"脱气器；除气装置（从液体中去除溶解气体，如氧气、二氧化碳，常用于工业流程）"},"examples":[{"en":"The brewery installed degassers to remove excess CO₂ from the beer before bottling.","zh":"这家啤酒厂安装了脱气器，在装瓶前去除啤酒中过多的二氧化碳。"},{"en":"In water treatment, degassers can help reduce dissolved oxygen that causes corrosion.","zh":"在水处理过程中，脱气器可以降低会引起腐蚀的溶解氧。"}]},{"partOfSpeech":"n.","definition":{"en":"people or tools that perform degassing (the act of removing gas from a substance)","zh":"进行脱气的人或工具；脱气设备（执行“脱气”这一操作）"},"examples":[{"en":"The lab degassers were used before running the samples through the machine.","zh":"在把样品送入仪器之前，实验室先使用脱气设备进行处理。"},{"en":"Technicians checked the degassers to make sure the vacuum lines were working.","zh":"技术人员检查了脱气装置，以确保真空管路正常工作。"}]}],"synonyms":["deaerators","degassing units","gas removers"],"phonetic":"/diˈɡæsər/","extraExplanation":["“degasser”来自动词“degass”（脱气、除气）+ 表示“……的人/物”的后缀“-er”。“degassers”是其复数形式。","常见领域：啤酒/饮料生产、化工、制药、半导体与水处理。脱气的目的通常是防止气泡影响质量、减少氧化、降低腐蚀或提高工艺稳定性。"]}
{"word":"degasses","summary":{"en":"Degasses means removes gas from a liquid/material, or (as a process) releases gas as bubbles.","zh":"degasses表示（使）脱气/除气，或指液体在过程中自然放气冒泡。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to remove dissolved or trapped gas from a liquid or material (often by heating, vacuum, stirring, or letting it rest)","zh":"（使）脱气；除去液体或材料中溶解或夹带的气体（常用加热、真空、搅拌或静置等方法）"},"examples":[{"en":"The technician degasses the resin before pouring it into the mold.","zh":"技术员在把树脂倒入模具前先给它脱气。"},{"en":"If you don’t degas the sauce, tiny bubbles can affect the texture.","zh":"如果不让酱汁脱气，小气泡会影响口感。"}]},{"partOfSpeech":"vi.","definition":{"en":"(of a liquid or mixture) to release gas naturally, often as bubbles rise to the surface","zh":"（液体或混合物）自然放气、冒泡排气"},"examples":[{"en":"After mixing, the batter degasses for a few minutes on the counter.","zh":"搅拌后，面糊在台面上静置几分钟会自然排气。"},{"en":"The solution slowly degasses when warmed.","zh":"溶液加热后会慢慢放气。"}]}],"synonyms":["deaerate","degasify","vent","purge"],"phonetic":"/diˈɡæs/","extraExplanation":["“degasses”是动词“degas”的第三人称单数形式（he/she/it degasses）。常见于实验室、材料制造（树脂/硅胶/塑料）、食品制作（酱汁/面糊）等语境。","前缀de-常表示“去除、减少”，所以degas字面意思就是“去气”。在技术写作里也常见名词形式“degassing（脱气过程）”。"]}
{"word":"degassing","summary":{"en":"Degassing means removing unwanted gas (air or dissolved gas) from a material or system.","zh":"Degassing 指把材料或系统中不需要的气体（空气或溶解气体）去除。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of removing dissolved gases or trapped air from a liquid, solid, or system (often by heating, stirring, vacuum, or letting it rest)","zh":"脱气；除气：把液体、固体或系统中的溶解气体或夹带空气去除的过程（常通过加热、搅拌、抽真空或静置）"},"examples":[{"en":"Degassing the resin helps prevent bubbles in the final cast.","zh":"给树脂脱气能减少成品里的气泡。"},{"en":"The technician used a vacuum chamber for degassing before pouring the silicone mold.","zh":"技术员在浇注硅胶模具前，用真空罐进行脱气。"}]},{"partOfSpeech":"adj.","definition":{"en":"describing equipment or steps used to remove gas (e.g., a degassing valve, degassing station)","zh":"用于脱气的；除气的（如脱气阀、脱气工位）"},"examples":[{"en":"This coffee bag has a degassing valve to let CO₂ escape.","zh":"这个咖啡袋有脱气阀，让二氧化碳排出。"},{"en":"Follow the degassing step before sealing the container.","zh":"密封容器前要先进行脱气步骤。"}]}],"synonyms":["de-aeration","gas removal","air removal","vacuuming (in manufacturing contexts)"],"phonetic":"/diˈɡæsɪŋ/","extraExplanation":["“degassing”常见于化学与材料工艺（树脂、硅胶、涂料）、饮食工业（咖啡烘焙后释放CO₂）、以及工程系统（冷却液/润滑油中去除气体以避免气蚀与性能下降）。","和“degas”相比，“degassing”更常用来指一个流程/工序（the degassing process/step），也常作定语修饰名词（degassing valve/unit）。"]}
{"word":"degauss","summary":{"en":"Degauss means to remove unwanted magnetism, or to erase data from magnetic media using a strong magnetic field.","zh":"degauss 指“消磁”：去除/降低不需要的磁性；也可指用强磁场对磁性介质消磁以抹除数据。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to remove or reduce unwanted magnetism in a metal object or electronic device (often by applying an alternating magnetic field).","zh":"（用交变磁场等方法）消磁；降低金属物体或电子设备中不需要的磁性。"},"examples":[{"en":"Technicians degaussed the monitor to fix the wavy colors on the screen.","zh":"技术人员给显示器消磁，修复了屏幕上波浪状的色彩问题。"},{"en":"Some ships were degaussed to reduce their magnetic signature and avoid mines.","zh":"有些军舰会进行消磁处理，以降低磁信号、躲避水雷。"}]},{"partOfSpeech":"vt.","definition":{"en":"to erase data on magnetic storage media by exposing it to a strong magnetic field (e.g., tapes, some hard drives).","zh":"（通过强磁场）消磁以抹除磁性存储介质上的数据（如磁带、部分硬盘）。"},"examples":[{"en":"Before disposal, the company degaussed old backup tapes to protect customer data.","zh":"在报废前，公司对旧备份磁带进行消磁处理，以保护客户数据。"},{"en":"Degaussing can permanently destroy the information on magnetic media.","zh":"消磁可能会永久破坏磁性介质上的信息。"}]}],"synonyms":["demagnetize","neutralize (magnetism)","erase (magnetic media)"],"phonetic":"/diˈɡaʊs/","extraExplanation":["“degauss”源自“Gauss（高斯）”，是磁感应强度单位的名称（以数学家兼物理学家卡尔·弗里德里希·高斯命名）。前缀“de-”有“去除、降低”的意思，所以整词可理解为“去掉磁性”。","常见语境：①老式CRT显示器/电视出现颜色偏斑时会用“degauss”按钮消磁；②军事上“degaussing”指舰船的消磁系统，用于降低被磁性水雷或探测设备发现的风险；③信息安全里“degauss”是数据销毁方法之一，但只对磁性介质有效（对SSD等不适用）。"]}
{"word":"degaussable","summary":{"en":"Degaussable means “able to be degaussed,” i.e., able to have unwanted magnetism reduced or removed.","zh":"degaussable 指“可消磁的”，即能通过处理降低或去除不需要的磁性。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be degaussed (treated to reduce or remove unwanted magnetism).","zh":"可消磁的；可进行消磁处理的（指能被处理以减少或去除不需要的磁性）。"},"examples":[{"en":"The navy ordered degaussable equipment to reduce the ship’s magnetic signature.","zh":"海军订购了可消磁的设备，以降低舰船的磁特征。"},{"en":"Some storage boxes are degaussable so they won’t interfere with sensitive instruments.","zh":"一些收纳箱可进行消磁处理，以免干扰精密仪器。"}]}],"synonyms":["demagnetizable","degaussable (treated/fit for degaussing)","capable of demagnetization"],"phonetic":"/diˈɡɔsəbəl/","extraExplanation":["“degaussable”来自动词“degauss”（消磁），词根与科学家高斯（Gauss）有关。它常见于军事与工程语境：例如舰船会通过“消磁系统/消磁线圈”降低磁性，从而减少触发磁性水雷或被磁探测设备发现的风险。","在数据与磁介质领域，“degauss”也指用强磁场抹除磁带/硬盘等的磁记录；但“degaussable”更常用来描述“对象是否适合/能够被消磁处理”，而不是描述数据是否能被清除。"]}
{"word":"degaussed","summary":{"en":"“Degaussed” means demagnetized, or having had magnetism reduced/removed (often for safety, security, or screen correction).","zh":"“degaussed”表示“已消磁的”，即磁性被去除或减弱（常用于数据安全、舰船隐蔽或屏幕校正）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a device, ship, or storage medium) having had its magnetism removed or reduced, usually by using an electric coil; demagnetized.","zh":"（设备、船只或存储介质）已被消磁的；磁性已被去除或减弱的（通常用线圈电流来消磁）。"},"examples":[{"en":"The technician said the hard drive was degaussed, so the data could not be recovered.","zh":"技术员说这块硬盘已经消磁了，所以数据无法恢复。"},{"en":"Some naval vessels were degaussed to make them harder for magnetic mines to detect.","zh":"一些海军舰艇会进行消磁处理，以降低被磁性水雷探测到的风险。"},{"en":"The old monitor looked better after the screen was degaussed.","zh":"屏幕消磁后，那台老显示器的画面看起来更正常了。"}]},{"partOfSpeech":"v.","definition":{"en":"simple past and past participle of “degauss”: to remove or reduce magnetism from something.","zh":"“degauss”的过去式和过去分词：对某物进行消磁，去除或减弱其磁性。"},"examples":[{"en":"They degaussed the tapes before disposal.","zh":"他们在处理前把磁带消磁了。"},{"en":"The drive was degaussed in a secure facility.","zh":"这块硬盘在安全设施里进行了消磁处理。"}]}],"synonyms":["demagnetized","de-magnetized","neutralized (magnetically)","erased (magnetic media)"],"phonetic":"/diˈɡaʊst/","extraExplanation":["“degauss”一词来自数学家/物理学家高斯（Gauss）的名字，和磁场单位“gauss”有关。","在日常语境里，degaussed 常见于数据安全（把磁性介质彻底消磁以防数据恢复）和军事/航海（降低舰船磁特征）等场景。","在老式 CRT 显示器中，消磁可以减少因外界磁场造成的颜色偏斑（color distortion）。"]}
{"word":"degausser","summary":{"en":"A degausser is a device used to remove magnetism, often to correct CRT display issues or erase data on magnetic media.","zh":"degausser 指消磁器，用于去除磁性，常见于修复CRT显示问题或对磁性介质进行数据抹除。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device that removes unwanted magnetism from something (especially a CRT monitor, magnetic tape, or a tool) by applying a changing magnetic field","zh":"消磁器；用于通过变化的磁场去除物体（尤指CRT显示器、磁带或工具）上多余磁性的设备"},"examples":[{"en":"The technician used a degausser to fix the color distortion on the old CRT monitor.","zh":"技术员用消磁器修复了老式CRT显示器的色彩失真。"},{"en":"Before disposing of the tapes, they ran them through a degausser to erase the data.","zh":"在丢弃磁带前，他们先用消磁器处理以抹除数据。"}]}],"synonyms":["demagnetizer","degaussing device"],"phonetic":"/diˈɡaʊsɚ/","extraExplanation":["“degausser”来自动词“degauss（消磁）”，而“gauss（高斯）”是磁感应强度的单位之一，用来纪念科学家卡尔·弗里德里希·高斯（Carl Friedrich Gauss）。","在日常语境中，degausser常与旧式CRT显示器、磁带/硬盘等“磁性存储介质”相关：强力消磁可能会永久破坏数据，因此在信息安全与报废处理场景中会提到它。"]}
{"word":"degausses","summary":{"en":"“Degausses” means “removes magnetism” or “erases magnetic data,” and it’s the third-person singular form of “degauss.”","zh":"“degausses”意为“消磁”或“用消磁抹除磁性数据”，是动词“degauss”的第三人称单数形式。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove unwanted magnetism from something (especially metal equipment) by using a changing magnetic field","zh":"用交变磁场等方法消除物体（尤其是金属设备）的残余磁性"},"examples":[{"en":"The technician degausses the tool before taking precise measurements.","zh":"技术员在进行精密测量前先给工具消磁。"},{"en":"The navy degausses ships to reduce their magnetic signature.","zh":"海军会给军舰消磁，以降低磁信号特征。"}]},{"partOfSpeech":"vt.","definition":{"en":"to erase or disrupt data stored on magnetic media (like tapes or some hard drives) by demagnetizing it","zh":"通过消磁来抹除或破坏磁性介质（如磁带、部分硬盘）中的数据"},"examples":[{"en":"They degaussed old backup tapes before disposal.","zh":"他们在处理旧备份磁带前先进行消磁抹除。"},{"en":"If you degauss a magnetic card, it may stop working.","zh":"如果你把磁条卡消磁了，它可能就不能用了。"}]}],"synonyms":["demagnetize","erase (magnetic data)","wipe"],"phonetic":"/ˌdiːˈɡaʊs/","extraExplanation":["“degauss”来自“gauss（高斯）”，是磁感应强度单位（现多用特斯拉T），词形里有“去除磁性”的意思。","历史上“degaussing”常见于二战及之后的海军领域：通过在船体周围布线通电，抵消船体磁化，降低触发磁性水雷的风险。","日常场景中也会提到老式CRT显示器的“degauss（消磁）”按钮，用来减少屏幕颜色失真；对磁带/磁盘则常指“消磁式销毁数据”。","你输入的“degausses”通常是动词第三人称单数现在时：He/She degausses…；基本形式是“degauss”。"]}
{"word":"degaussing","summary":{"en":"Degaussing is removing or reducing unwanted magnetism; it can also mean performing that process on equipment.","zh":"Degaussing 指“消磁/去磁”，即去除或减弱不需要的磁性；也可指对设备进行消磁处理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of removing or reducing unwanted magnetism from a metal object or electronic device (especially a ship, monitor, or equipment)","zh":"消磁；去磁（把金属物体或设备上不需要的磁性去除或减弱，常用于船只、显示器或仪器）"},"examples":[{"en":"The navy performed degaussing on the ship to reduce its magnetic signature.","zh":"海军对这艘船进行了消磁，以降低它的磁性特征。"},{"en":"Old computer monitors sometimes needed degaussing to fix color distortion.","zh":"老式电脑显示器有时需要消磁来修复颜色失真。"}]},{"partOfSpeech":"vt.","definition":{"en":"to remove or reduce magnetism in something","zh":"给……消磁；去除或减弱……的磁性"},"examples":[{"en":"Technicians degaussed the equipment before installing it in the lab.","zh":"技术人员在把设备安装到实验室之前先给它进行了消磁。"},{"en":"You can degauss a CRT screen with a built-in degauss button.","zh":"你可以用CRT屏幕自带的消磁按钮给屏幕消磁。"}]}],"synonyms":["demagnetization","demagnetizing","degauss"],"phonetic":"/diːˈɡaʊsɪŋ/","extraExplanation":["“Degaussing”一词来自物理学家 Carl Friedrich Gauss（高斯）的名字；“gauss”也是磁感应强度的单位（旧制/CGS单位）。因此 degauss 字面上就是“去除高斯（磁性）”。","在军事与航海中，消磁常用于降低舰船被磁性水雷或探测设备“识别”的风险；做法可能是用线圈通电产生反向磁场来抵消船体残余磁性。","在日常语境里，这个词也会被比喻使用，表示“让某人冷静/降温、去除紧张气氛”，但这种用法不如字面意义常见。"]}
{"word":"degelatinise","summary":{"en":"“Degelatinise” means to remove gelatin or to make something stop being jelly-like.","zh":"“Degelatinise”指去除明胶/胶质，或使某物不再呈胶状。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove gelatin (a jelly-like substance) from something; to make something no longer gelatinous","zh":"去除（明胶等）胶质；使不再呈胶状"},"examples":[{"en":"The lab used enzymes to degelatinise the sample before testing it.","zh":"实验室在检测前用酶把样品去胶化。"},{"en":"Some industrial processes degelatinise animal by-products to change their texture and use.","zh":"一些工业流程会对动物副产品进行去胶化处理，以改变其质地和用途。"}]}],"synonyms":["degelatinize","remove gelatin from","de-gel","de-jellify"],"phonetic":"/diːdʒəˈlæˌtɪnˌaɪz/","extraExplanation":["“de-”表示“去除、取消”，而“gelatinise/gelatinize”表示“使成胶、使胶化”。所以“degelatinise”字面意思就是“去胶化”。","该词多见于化学、食品加工、材料处理等专业语境；日常英语里更常用更通俗的说法，如“remove the gelatin”或“make it less gelatinous”。","英式拼写常用 -ise（degelatinise），美式更常见 -ize（degelatinize）。"]}
{"word":"degelatinize","summary":{"en":"To remove gelatin or reverse a gelatin-like state.","zh":"去除明胶或逆转胶化状态。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove gelatin (or a gelatin-based coating) from something; to undo or prevent a material from becoming gelatin-like","zh":"把明胶（或含明胶的涂层）从某物上去除；使材料不再呈胶冻状/不发生胶化"},"examples":[{"en":"The conservator degelatinized the surface to remove an old gelatin coating.","zh":"修复师对表面进行去明胶处理，以去除旧的明胶涂层。"},{"en":"After repeated washing, the fabric became degelatinized and lost its stiff finish.","zh":"反复清洗后，织物被去明胶化，失去了原先挺括的整理效果。"},{"en":"Some chemicals can degelatinize animal glue in certain conditions.","zh":"在特定条件下，有些化学品会使动物胶去明胶化。"}]}],"synonyms":["remove gelatin from","degelatinise","strip (a gelatin coating)","deglue (in some contexts)"],"phonetic":"/diˌdʒɛləˈtɪnaɪz/","extraExplanation":["这个词比较少见，多出现在材料处理、纸张/纺织整理、胶黏剂与修复保存等语境中。核心含义是“把明胶去掉”或“让原本胶化的状态被逆转”。在摄影与文物修复中，明胶曾常被用作感光或保护涂层，因此也会出现“去明胶处理”的说法。"]}
{"word":"degelation","summary":{"en":"Degelation means thawing or melting—the process of returning from frozen or gelled to liquid/fluid.","zh":"Degelation 指解冻或融化——从冻结或凝胶状态回到液态/流动态的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of thawing or melting; a return from a frozen state to a liquid (opposite of freezing).","zh":"解冻；融化的过程；从冻结状态回到液态（与“冻结”相反）。"},"examples":[{"en":"After a cold night, degelation began as the sun warmed the road.","zh":"寒冷一夜之后，太阳把路面晒热，开始出现解冻/融化。"},{"en":"Rapid degelation can cause ice to crack and water to leak into small gaps.","zh":"快速解冻可能导致冰开裂，水渗入细小缝隙。"}]},{"partOfSpeech":"n.","definition":{"en":"(biology/chemistry) the melting or dissolving of a gel-like or solidified substance back into a more fluid state.","zh":"（生物/化学）凝胶状或固化物质回到更流动状态的融化或溶解过程。"},"examples":[{"en":"The sample must be gently warmed to allow degelation before mixing.","zh":"样品需要轻微加热以完成“解凝/融化”，再进行混合。"}]}],"synonyms":["thawing","melting","defrosting"],"phonetic":"/ˌdiːdʒəˈleɪʃən/","extraExplanation":["“degelation”不是日常高频词，更常见的表达是“thawing / melting”。在一些较旧或专业的文本中，它可用来指“解冻、融化”。","它在词形上与“gel（凝胶）/ gelation（凝胶化）”有关，因此在理工语境里有时也被用来强调“从凝胶或固化状态恢复到流动状态”的过程。","别和“regelation（再凝固/复凝）”混淆：regelation 指冰在压力下局部融化后又重新结冰的现象。"]}
{"word":"degender","summary":{"en":"“Degender” means to remove gendered wording or distinctions and make something gender-neutral.","zh":"“Degender”指去除带性别指向的用语或区分，使表达或制度更性别中立。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to remove gendered language or gender distinctions; to make something gender-neutral","zh":"去性别化；去除带有性别指向的表达或区分，使其变得性别中立"},"examples":[{"en":"The company updated its handbook to degender job titles like “chairman” to “chair.”","zh":"公司更新员工手册，把“chairman（主席/董事长）”这类职位称呼去性别化，改成“chair（主席/主持人）”。"},{"en":"Some schools try to degender uniforms so students can choose what feels comfortable.","zh":"一些学校尝试对校服去性别化，让学生选择自己觉得舒适的款式。"}]},{"partOfSpeech":"vt.","definition":{"en":"(linguistics) to remove or reduce grammatical gender marking in a language or in a text","zh":"（语言学）弱化或去除语法性别标记；在语言或文本中减少阴阳性等语法性别区分"},"examples":[{"en":"In informal speech, certain endings may change over time and partially degender the system.","zh":"在非正式口语中，某些词尾可能随时间变化，从而在一定程度上让语法系统去性别化。"},{"en":"The editor tried to degender the translation by avoiding gendered pronouns when possible.","zh":"编辑在可能的情况下避免使用带性别的代词，尝试让译文去性别化。"}]}],"synonyms":["make gender-neutral","neutralize gendered language","de-sex","degendered","gender-neutralize"],"phonetic":"/diːˈdʒɛn.dɚ/","extraExplanation":["“degender”在日常英语里不算高频词，更常见的表达是“use gender-neutral language（使用性别中立语言）”“remove gendered terms（去除性别化用语）”或“degendered（去性别化的）”。","在社会文化语境中，“degender”常用于讨论包容性写作、职称与称呼（如chair/flight attendant）、表格选项（如减少“Mr./Mrs.”）等。使用时注意场合与语气：在正式写作中可用更具体的说法，避免让人感觉是在否认或抹去个人的性别认同。"]}
{"word":"degendered","summary":{"en":"Degendered means made gender-neutral—not labeling people, roles, or language as male or female.","zh":"Degendered 指“去性别化/性别中立化”，即不再把人、角色或语言标成男性或女性。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not marked or treated as male or female; made gender-neutral.","zh":"不再标注或区分为“男性/女性”的；被处理为性别中立的。"},"examples":[{"en":"The form uses degendered language like “parent/guardian” instead of “mother/father.”","zh":"这份表格使用了“家长/监护人”等去性别化（性别中立）的用语，而不是“母亲/父亲”。"},{"en":"Some products are sold in degendered packaging to avoid targeting one gender.","zh":"有些产品使用去性别化的包装销售，以避免只针对某一性别。"},{"en":"In the new guidelines, job titles are more degendered (for example, “firefighter” instead of “fireman”).","zh":"在新指南中，职业称呼更去性别化（例如用“firefighter 消防员”替代“fireman”）。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Grammar/linguistics) Having gender markers removed or avoided in words, titles, or pronouns.","zh":"（语法/语言学）在词语、头衔或代词中去除或回避性别标记的。"},"examples":[{"en":"Some languages have degendered pronoun options in certain communities.","zh":"在某些社群中，一些语言会使用去性别化的代词选项。"},{"en":"The translation aims to be degendered so it doesn’t assume the person is a man or a woman.","zh":"这段翻译力求去性别化，以免默认对方是男性或女性。"}]}],"synonyms":["gender-neutral","ungendered","non-gendered","unisex"],"phonetic":"/diˈdʒen.dɚd/","extraExplanation":["“degendered”来自动词“degender”（把……去性别化/性别中立化）。在实际使用中常见于：表格与政策用语（如“spouse/partner”）、职业称呼（如“police officer”）、以及设计与营销（如“gender-neutral”产品）。","语境上它通常与包容性语言（inclusive language）相关，但在不同文化与社群里接受度不一；写作时可根据场景选择更中性的表达，如用“they”作单数泛指，或直接改写句子避免代词。"]}
{"word":"degendering","summary":{"en":"Degendering means removing or reducing gendered language, labels, or assumptions.","zh":"Degendering 指去性别化：移除或弱化带有性别指向的用语、标签或默认假设。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or process of removing gender-specific language, categories, or assumptions (for example, changing “policeman” to “police officer,” or using gender-neutral forms).","zh":"去性别化；指移除语言、分类或观念中带有性别指向的表达与假设（例如把“policeman”改为“police officer”，或使用中性称呼）。"},"examples":[{"en":"The company’s degendering of job titles aims to make roles feel open to everyone.","zh":"公司对职位名称进行去性别化，是为了让这些岗位对所有人都更开放。"},{"en":"Some schools encourage degendering in classroom language, like saying “students” instead of “boys and girls.”","zh":"一些学校鼓励课堂用语去性别化，比如用“students”代替“boys and girls”。"}]},{"partOfSpeech":"n.","definition":{"en":"In social discussion, a broader effort to reduce the importance of gender in how people are described or treated.","zh":"在社会讨论中：更广义地指弱化性别在描述或对待他人时的影响与比重的努力。"},"examples":[{"en":"They talked about degendering in sports uniforms to focus more on performance than appearance.","zh":"他们讨论了运动服装的去性别化，以便把重点更多放在表现而不是外观上。"},{"en":"For some people, degendering is about respect—letting individuals define themselves rather than being boxed into categories.","zh":"对一些人来说，去性别化是一种尊重——让个人自我定义，而不是被固定类别框住。"}]}],"synonyms":["gender-neutralization","neutralization (in language)","inclusive language (related)","gender-neutral language (related)"],"phonetic":"/diːˈdʒɛn.dɚ.ɪŋ/","extraExplanation":["“degendering”常见于语言与公共政策的语境，和“gender-neutral language（性别中立语言）”“inclusive language（包容性语言）”相关。它通常强调减少刻板印象与默认假设，但不同社群对其必要性与做法可能有不同看法，使用时注意场合与受众。"]}
{"word":"degener","summary":{"en":"Degenerate means to decline or make something decline; it can also describe a degraded person or thing (often negative when referring to people).","zh":"Degenerate 指退化/恶化或使之退化；也可形容堕落的人或破败的事物（指人时通常带贬义）。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to become worse in quality, morals, health, or condition; to decline.","zh":"（质量、道德、健康或状况）变坏；退化；衰败。"},"examples":[{"en":"Without regular practice, his piano skills began to degenerate.","zh":"如果不经常练习，他的钢琴水平开始退步。"},{"en":"The debate degenerated into personal insults.","zh":"这场辩论后来变成了人身攻击。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something become worse in quality or condition; to cause decline.","zh":"使（某物）变坏；使退化；使恶化。"},"examples":[{"en":"Poor management degenerated the company’s culture over time.","zh":"糟糕的管理让公司的文化随着时间逐渐变差。"},{"en":"Stress can degenerate your sleep quality.","zh":"压力会让你的睡眠质量变差。"}]},{"partOfSpeech":"adj.","definition":{"en":"having declined to a lower level; degraded or corrupt.","zh":"退化的；堕落的；变质的。"},"examples":[{"en":"He described the group as a degenerate gang.","zh":"他把那个团体形容为堕落的帮派。"},{"en":"The building is in a degenerate state after years of neglect.","zh":"多年无人维护后，这栋建筑处于破败状态。"}]},{"partOfSpeech":"n.","definition":{"en":"a person considered morally corrupt or socially unacceptable (often insulting).","zh":"（常带侮辱）被认为道德败坏或不被社会接受的人。"},"examples":[{"en":"Calling someone a “degenerate” is a harsh insult.","zh":"称别人为“degenerate”是很刻薄的侮辱。"},{"en":"In the novel, the villain is portrayed as a degenerate.","zh":"在小说中，反派被刻画成一个堕落之徒。"}]}],"synonyms":["deteriorate","decline","degrade","worsen","corrupt"],"phonetic":"/dɪˈdʒenəreɪt/","extraExplanation":["你输入的“degener”通常不是完整单词，更常见的是 **degenerate**。它来自拉丁语词根：**de-**（向下）+ **genus**（种类、类型），原意有“从原本类型/水平向下偏离”的感觉。","注意语气：当作名词（a degenerate）或形容人时常带强烈贬义，可能涉及道德评判；在医学/生物学语境中更中性（如“degenerative disease 退行性疾病”）。","常见搭配：**degenerate into**（恶化成……）；**degenerative**（退行性的，常用于医学）。"]}
{"word":"degeneracies","summary":{"en":"“Degeneracies” is the plural of “degeneracy,” meaning either moral/social decline or (in science) different states sharing the same value, such as the same energy.","zh":"“Degeneracies”是“degeneracy”的复数，可指道德/社会层面的堕落，也可指科学语境中的“简并/退化”（不同状态取相同值，如相同能级）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of degeneracy) a state of moral or social decline; behavior or conditions seen as corrupt or immoral.","zh":"（degeneracy 的复数）道德或社会的堕落；被认为腐败、不道德的行为或状况。"},"examples":[{"en":"The novel describes the degeneracies of the wealthy class in a decaying city.","zh":"这部小说描写了一个衰败城市里富裕阶层的种种堕落。"},{"en":"The journalist argued that gambling and corruption were public degeneracies that needed reform.","zh":"这位记者认为赌博和腐败是需要改革的社会性堕落现象。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural of degeneracy, science/tech) situations where different states or solutions share the same value (for example, the same energy level in physics).","zh":"（degeneracy 的复数，科技术语）不同状态或解在某个量上取相同值的情况（例如物理中不同量子态具有相同能级）。"},"examples":[{"en":"In quantum mechanics, degeneracies occur when multiple quantum states have the same energy.","zh":"在量子力学中，当多个量子态具有相同能量时就会出现简并。"},{"en":"The symmetry of the system can create degeneracies in the spectrum.","zh":"系统的对称性会在能谱中产生简并情况。"}]}],"synonyms":["corruption","decay","depravity","degeneration","(science) degeneracy","(physics) energy-level degeneracy"],"phonetic":"/dɪˈdʒenərəsiz/","extraExplanation":["“degeneracies”是名词复数形式，单数是“degeneracy”。在日常语境里常指“堕落/腐化”的现象；在物理、数学、统计等领域里更常见的是“简并/退化”的技术含义，通常不带道德评价。"]}
{"word":"degeneracy","summary":{"en":"Degeneracy means decline into a worse state (often a judgmental word), and in science it can mean different states leading to the same result or energy level.","zh":"Degeneracy常指“堕落/衰败/退化”（多带评判色彩）；在科学中也指“简并/简并性”，即不同状态却得到相同结果或能量水平。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a state in which something (a person, society, system, or quality) has declined to a lower moral, cultural, or functional level","zh":"（人、社会、制度或品质的）堕落；衰败；退化（到较低的道德、文化或功能水平）"},"examples":[{"en":"Some critics blamed the city’s problems on moral degeneracy.","zh":"一些评论者把城市的问题归咎于道德堕落。"},{"en":"The novel explores the fear of cultural degeneracy at the end of an era.","zh":"这部小说探讨了一个时代末期对文化衰败的恐惧。"}]},{"partOfSpeech":"n.","definition":{"en":"a degenerate or corrupt condition, behavior, or lifestyle (often used as a judgmental label)","zh":"（常带贬义、评判色彩的）堕落的状态/行为/生活方式"},"examples":[{"en":"Be careful with the word “degeneracy,” because it can sound insulting rather than descriptive.","zh":"使用“degeneracy”要小心，因为它听起来更像侮辱而不是客观描述。"},{"en":"In some historical texts, “degeneracy” was used to condemn art or music that challenged social norms.","zh":"在一些历史文本中，“degeneracy”被用来谴责挑战社会规范的艺术或音乐。"}]},{"partOfSpeech":"n.","definition":{"en":"(science) a situation where different options produce the same result, or where multiple states have the same energy level (common in physics and genetics)","zh":"（科学）简并/简并性：不同情况得到相同结果，或多个状态具有相同能量水平（常见于物理与遗传学）"},"examples":[{"en":"In quantum physics, degeneracy means several states share the same energy.","zh":"在量子物理中，degeneracy指多个状态共享相同能量。"},{"en":"In genetics, the degeneracy of the code means several codons can code for the same amino acid.","zh":"在遗传学中，遗传密码的简并性指多个密码子可以编码同一种氨基酸。"}]}],"synonyms":["decline","deterioration","corruption","decadence","degradation"],"phonetic":"/dɪˈdʒɛnərəsi/","extraExplanation":["词源上来自拉丁语 de-（向下）+ genus（种类、血统），原意有“变坏、从原本状态下降”的感觉，因此在日常语境里常带强烈价值判断。写作时如果想更中性，可以用 decline（衰退）、deterioration（恶化）、corruption（腐败）等。","在20世纪欧洲历史中，“degenerate art（堕落艺术）”曾被用作政治宣传用语，用来污名化不符合当权审美或意识形态的艺术作品；这是一个有敏感历史背景的搭配。"]}
{"word":"degeneralize","summary":{"en":"Degeneralize means to make something more specific by adding details or narrowing a general idea.","zh":"degeneralize 指把笼统的内容细化、具体化，通过补充细节或缩小范围来减少泛化。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something less general by adding specific details; to turn a broad statement, rule, or model into a more specific one","zh":"使（内容）不再笼统、更加具体；把概括性的说法/规则/模型细化为更具体的形式"},"examples":[{"en":"The teacher asked students to degeneralize their claims by giving real examples.","zh":"老师要求学生通过给出真实例子来让他们的观点更具体、不要太笼统。"},{"en":"We need to degeneralize the policy so it fits different regions.","zh":"我们需要把这项政策细化，使其适用于不同地区。"},{"en":"The report degeneralizes the earlier summary into clear steps and numbers.","zh":"这份报告把之前的概述细化成清晰的步骤和数据。"}]}],"synonyms":["specify","narrow down","qualify","make more specific","add detail"],"phonetic":"/diːˈdʒɛnərəˌlaɪz/","extraExplanation":["“degeneralize”并不常见，更常用的表达有：“make it more specific / add details / specify / narrow down / qualify a statement”。","构词法：de-（去除、反向）+ generalize（概括）。多见于学术写作、批判性思维训练，或技术语境（如把过于泛化的规则/模型改得更贴合具体场景）。"]}
{"word":"degenerate","summary":{"en":"“Degenerate” most often means to decline or become worse; it can also mean to cause decline. As a label for people, it is often insulting.","zh":"“Degenerate”最常指（事物）退化、恶化；也可指使其退化。用于形容或称呼人时多带侮辱性。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to become worse in quality, character, or condition; to decline","zh":"（质量、品格或状况）恶化；退化；堕落"},"examples":[{"en":"If we don’t maintain the building, it will degenerate over time.","zh":"如果我们不维护这栋楼，它会随着时间推移而逐渐破败。"},{"en":"Their friendly debate degenerated into an argument.","zh":"他们原本友好的辩论逐渐变成了争吵。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cause something to become worse; to degrade","zh":"使（某事物）恶化；使退化"},"examples":[{"en":"Poor working conditions can degenerate people’s health.","zh":"恶劣的工作条件会损害人们的健康。"},{"en":"He worried that stress was degenerating his ability to focus.","zh":"他担心压力正在削弱他的专注能力。"}]},{"partOfSpeech":"adj.","definition":{"en":"having declined to a lower level, often in a moral or social sense (often used as an insult)","zh":"堕落的；退化的（常带侮辱性用法）"},"examples":[{"en":"The writer portrayed the villain as a degenerate gambler.","zh":"作者把反派刻画成一个堕落的赌徒。"},{"en":"Be careful: calling someone “degenerate” is very offensive.","zh":"注意：称别人“degenerate”非常冒犯。"}]},{"partOfSpeech":"n.","definition":{"en":"a person considered morally corrupt or socially unacceptable (offensive)","zh":"堕落的人；道德败坏的人（冒犯性）"},"examples":[{"en":"The newspaper avoided calling people degenerates because the term is insulting.","zh":"这家报纸避免用“degenerates”来称呼他人，因为这个词带侮辱性。"}]}],"synonyms":["decline","deteriorate","devolve","worsen","degrade","decay"],"phonetic":"/dɪˈdʒɛnəˌreɪt/","extraExplanation":["词源：来自拉丁语 de-（向下、离开）+ genus（种类、类别），原意接近“从原本的种类/状态变差”。","语用提醒：在日常英语里，degenerate 作动词很常见且较中性（例如“情况恶化”）；但作名词或形容词指人时常带强烈道德评判与侮辱意味，使用需谨慎。","常见搭配：degenerate into（逐渐变成更糟的状态）；degenerate rapidly/slowly（迅速/缓慢恶化）。"]}
{"word":"degenerated","summary":{"en":"“Degenerated” means “having become worse or degraded,” and it’s also the past form of “degenerate.” In medicine/biology it often refers to abnormal or harmful degeneration.","zh":"“degenerated”表示“变差、退化、堕落的”，也可作动词“degenerate”的过去式/过去分词。在医学/生物学中常指组织或功能的退行性变化。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) Having declined from a better, healthier, or more moral state; degraded or weakened in quality.","zh":"（形容词）从更好、更健康或更道德的状态退化下来；堕落的；变差的。"},"examples":[{"en":"Some people think the conversation has degenerated into name-calling.","zh":"有些人认为这场对话已经退化成互相谩骂了。"},{"en":"The old building’s design looked degenerated after years of neglect.","zh":"这栋老建筑多年无人维护后，设计看起来已经变得破败。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adj., biology/medicine) Changed in structure or function in a way that is abnormal or harmful; showing degeneration.","zh":"（形容词，生物/医学）结构或功能发生异常或有害变化的；出现退行性变化的。"},"examples":[{"en":"The scan showed degenerated cartilage in the knee.","zh":"扫描显示膝盖软骨发生了退变。"},{"en":"Scientists compared normal cells with degenerated tissue.","zh":"科学家比较了正常细胞和退化组织。"}]},{"partOfSpeech":"v.","definition":{"en":"(v., past form) Past tense/past participle of “degenerate”: to decline or become worse in quality, behavior, or condition.","zh":"（动词，过去式/过去分词）“degenerate”的过去式/过去分词：退化；恶化；堕落。"},"examples":[{"en":"The discussion degenerated into an argument within minutes.","zh":"讨论在几分钟内就恶化成争吵。"},{"en":"His condition degenerated rapidly without treatment.","zh":"没有治疗，他的病情迅速恶化。"}]}],"synonyms":["degraded","deteriorated","declined","corrupted","decayed"],"phonetic":"/dɪˈdʒɛnəˌreɪtɪd/","extraExplanation":["“degenerated”常见于两类语境：\n1）日常/评论语境：表示“变坏、变低级”，如“a degenerated debate”。这类用法带有强烈负面评价，可能显得尖刻。\n2）医学/科研语境：更中性，常指组织“退变/退化”，如“degenerated disc（退变椎间盘）”。\n注意：形容人时用“degenerated”可能接近侮辱（类似“堕落的”），建议谨慎使用。"]}
{"word":"degenerately","summary":{"en":"Degenerately means “in a degenerate way”: either morally depraved or declining/deteriorating.","zh":"degenerately 表示“以堕落/退化的方式”：可指道德败坏地，也可指逐渐衰退、变差地。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a morally corrupt, depraved, or socially unacceptable way.","zh":"以道德败坏、堕落或社会不认可的方式。"},"examples":[{"en":"The film portrays a city where some people live degenerately, chasing pleasure without limits.","zh":"这部电影描绘了一座城市：有些人过着堕落的生活，无限制地追逐享乐。"},{"en":"He wasted his money degenerately on gambling and heavy drinking.","zh":"他把钱堕落地挥霍在赌博和酗酒上。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that becomes weaker, worse, or less developed than before (declining or deteriorating).","zh":"以衰退、退化、变差的方式（比以前更弱、更糟或发展程度更低）。"},"examples":[{"en":"Without exercise, the muscles can degenerately lose strength over time.","zh":"缺乏锻炼的话，肌肉可能会逐渐退化、变得无力。"},{"en":"The system began degenerately failing after years of neglect.","zh":"多年被忽视后，这个系统开始逐步退化并出现故障。"}]}],"synonyms":["depravedly","corruptly","decadently","immorally","viciously"],"phonetic":"/dɪˈdʒɛnərətli/","extraExplanation":["“degenerately”来自形容词“degenerate（堕落的；退化的）”。在日常英语里，这个副词比较少见，更常用的表达是：\n- morally：道德上（较中性）\n- in a degenerate way：以堕落的方式（更自然）\n- in a depraved way：以邪恶/放纵的方式（更强烈）","语气提示：谈论人的行为时，“degenerately”通常带有强烈负面评价，容易显得在“道德审判”。用于正式写作或文学描写更常见；口语中通常会换成更具体的词（例如“recklessly / irresponsibly / wildly”）。"]}
{"word":"degenerateness","summary":{"en":"Degenerateness means the state of being degenerate—moral or social decline. It’s rare; “degeneracy” is more common.","zh":"Degenerateness 指“堕落/败坏”的状态（道德或社会的衰败）。该词较少见，更常用的是 degeneracy。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being degenerate; moral or social decline (a rare word, similar to “degeneracy”)","zh":"堕落、败坏的状态或性质；道德或社会层面的衰败（较少见的词，意思接近 degeneracy）"},"examples":[{"en":"The novel describes the city's degenerateness as corruption spreads through public life.","zh":"这部小说描写了当腐败蔓延到公共生活时，这座城市的堕落败坏。"},{"en":"Some critics used the word “degenerateness” to condemn art they did not understand.","zh":"有些批评家用“degenerateness（堕落）”来谴责他们不理解的艺术。"}]}],"synonyms":["degeneracy","decadence","depravity","corruption","moral decline"],"phonetic":"/dɪˈdʒɛnərɪtnəs/","extraExplanation":["“degenerateness”在现代英语里非常少用，更常见、更自然的表达是“degeneracy”（堕落、退化）或直接用形容词“degenerate”（堕落的/退化的）。写作中如果想更地道，通常建议用“degeneracy”。","历史上“degenerate/degeneracy”有时被用于带有偏见的社会或政治论述（例如把某些群体、文化或艺术贴上“堕落”的标签）。在使用时注意语境与态度，避免不必要的污名化。"]}
{"word":"degenerates","summary":{"en":"“Degenerates” can be a verb meaning “declines/worsens,” or a plural noun used as a harsh insult for people seen as morally degraded.","zh":"“Degenerates”既可作动词表示“退化/变坏”，也可作名词复数，用作强烈贬义的辱骂，指被认为“道德堕落的人”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(verb) To become worse in quality, behavior, or condition; to decline.","zh":"（动词）在质量、行为或状态上变差；退化；堕落。"},"examples":[{"en":"Without practice, his skills degenerate over time.","zh":"如果不练习，他的技能会随着时间退化。"},{"en":"The debate degenerated into personal attacks.","zh":"这场辩论逐渐堕落成了人身攻击。"}]},{"partOfSpeech":"n.","definition":{"en":"(noun, plural) People considered to have lost normal moral standards or self-control (often insulting).","zh":"（名词复数）被认为失去道德标准或自我控制的人（通常带侮辱性）。"},"examples":[{"en":"He unfairly called the protesters “degenerates.”","zh":"他不公平地把抗议者骂成“堕落的人”。"},{"en":"The article warned against labeling others as “degenerates.”","zh":"那篇文章提醒不要给别人贴上“堕落者”的标签。"}]}],"synonyms":["decline","deteriorate","degrade","worsen","sink"],"phonetic":"/dɪˈdʒɛnəˌreɪt/","extraExplanation":["“degenerate(s)”作名词时语气很重，常用于辱骂或贬低某个群体，带有强烈的道德评判色彩。在正式写作或礼貌交流中，通常更建议用更中性的说法，如“people with harmful behavior（有不良行为的人）”“people acting irresponsibly（行为不负责任的人）”。","常见搭配：degenerate into + 名词（逐渐变成/沦为……），如“degenerate into chaos（沦为混乱）”。"]}
{"word":"degenerating","summary":{"en":"“Degenerating” means becoming worse or losing normal strength or function over time; it’s common in medical contexts (e.g., degenerating disc) and can also describe a situation that is getting worse.","zh":"“degenerating”表示随着时间推移逐渐变差、衰弱或失去正常功能；常用于医学语境（如椎间盘退化），也可形容局势或状况在变糟。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"becoming worse, weaker, or less healthy over time; losing normal quality or function (often used for diseases, tissues, or conditions).","zh":"逐渐恶化、衰弱或失去正常功能（常用于疾病、组织或状况）。"},"examples":[{"en":"The doctor said the pain might be caused by a degenerating disc in his back.","zh":"医生说他的疼痛可能是由背部椎间盘退化引起的。"},{"en":"Without maintenance, the building is degenerating quickly.","zh":"如果不维护，这栋楼正在迅速破败。"}]},{"partOfSpeech":"v.","definition":{"en":"the present participle of “degenerate”: becoming worse or less acceptable; losing strength, quality, or moral standards.","zh":"“degenerate”的现在分词：变得更差或不再可取；失去力量、品质或道德标准。"},"examples":[{"en":"The conversation was degenerating into an argument.","zh":"谈话正在演变成争吵。"},{"en":"He worried that the team spirit was degenerating as people stopped helping each other.","zh":"他担心当大家不再互相帮助时，团队精神正在变差。"}]}],"synonyms":["deteriorating","worsening","declining","degrading","wearing down"],"phonetic":"/dɪˈdʒɛnəˌreɪtɪŋ/","extraExplanation":["“degenerating”在医学语境里非常常见，通常偏中性，指“退行性/退化性变化”（degenerative changes），强调随时间逐渐变差，并不带道德评判。","在日常或文学语境中，它也可带更强的负面评价，暗示“堕落、变坏”（moral/social degeneration）。具体语气取决于上下文。"]}
{"word":"degeneratio","summary":{"en":"Degeneration means a decline or deterioration, especially in health, function, or quality.","zh":"Degeneration 指（健康、功能或质量等的）衰退、恶化或退化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of becoming worse in quality, health, or function; decline","zh":"（质量、健康或功能）逐渐变差；退化；衰退"},"examples":[{"en":"Doctors are studying the degeneration of cartilage in the knee.","zh":"医生正在研究膝盖软骨的退化。"},{"en":"Some people worry about the degeneration of public trust in the media.","zh":"有些人担心公众对媒体信任的衰退。"}]},{"partOfSpeech":"n.","definition":{"en":"a biological process in which cells, tissues, or organs deteriorate, often due to aging or disease","zh":"（生物学）细胞、组织或器官因衰老或疾病而恶化的过程"},"examples":[{"en":"Age-related macular degeneration can affect vision.","zh":"年龄相关性黄斑变性会影响视力。"},{"en":"The report links the symptoms to nerve degeneration.","zh":"报告将这些症状与神经退化联系起来。"}]}],"synonyms":["decline","deterioration","breakdown","decay","worsening"],"phonetic":"/dɪˌdʒɛnəˈreɪʃən/","extraExplanation":["“degeneratio”本身不是常见的现代英语拼写；你可能想查的是 **degeneration**（退化/衰退）或 **degenerate**（退化的；使退化）。","词源提示：来自拉丁语 *degenerare*（“变得不像原来的种类/品质”），因此在英语里常带有“从较好状态走向较差状态”的含义，既可用于医学/生物学，也可用于社会、文化等抽象语境。"]}
{"word":"degeneration","summary":{"en":"Degeneration means a gradual decline—becoming worse over time, especially in health/biology or in the quality of something; it can also mean moral or cultural decline.","zh":"Degeneration 指“逐渐变差/衰退”，常用于健康与生物医学的退行性变化，也可指道德或文化层面的堕落（带评判色彩）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The process of becoming worse in quality, condition, or strength; decline or deterioration over time.","zh":"（品质、状况或力量）逐渐变差的过程；衰退；恶化。"},"examples":[{"en":"The report warned about the degeneration of the city’s water system after years of neglect.","zh":"报告警告说，由于多年疏于维护，这座城市的供水系统出现了逐渐恶化。"},{"en":"Many people try to slow the degeneration that can come with aging through exercise and a healthy diet.","zh":"许多人通过运动和健康饮食来减缓随年龄增长可能出现的身体衰退。"}]},{"partOfSpeech":"n.","definition":{"en":"In biology/medicine: the breakdown or loss of normal structure or function in cells, tissues, or organs (often in a progressive way).","zh":"（生物/医学）退行性变化：细胞、组织或器官的正常结构或功能逐步受损或丧失。"},"examples":[{"en":"Macular degeneration can affect a person’s central vision.","zh":"黄斑变性会影响一个人的中心视力。"},{"en":"The doctor explained that nerve degeneration may cause numbness and weakness.","zh":"医生解释说，神经退化可能导致麻木和无力。"}]},{"partOfSpeech":"n.","definition":{"en":"A decline in moral standards or behavior (a judgmental use, often in debates about society or culture).","zh":"（道德或行为）堕落；风气败坏（常带评判意味，多用于社会文化争论）。"},"examples":[{"en":"Some critics described the film as a symbol of cultural degeneration, while others disagreed.","zh":"一些评论家把这部电影说成是文化堕落的象征，而另一些人并不同意。"}]}],"synonyms":["decline","deterioration","degradation","decay","regression"],"phonetic":"/dɪˌdʒɛnəˈreɪʃən/","extraExplanation":["“Degeneration”来自词根“de-”（向下、减少）+“generate”（产生、形成）相关的构词背景，整体感觉是“从较好的状态往下走”。日常写作里，它常比“decline / deterioration”更正式，也更强调持续、渐进的变坏过程。","在社会文化语境中，“degeneration”有时带有强烈价值判断，容易引发争议；更中性的表达可用“social decline（社会衰退）”或更具体地描述现象。"]}
{"word":"degenerationist","summary":{"en":"A degenerationist is someone (or something) that argues society or culture is in decline or “degenerating.”","zh":"degenerationist 指“退化论者”或“带退化论色彩的”，强调社会/文化正在走向衰败。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who believes that society, culture, or a group of people is declining or “degenerating” (becoming worse) over time","zh":"退化论者；认为社会、文化或某个群体正在走向衰败/堕落的人"},"examples":[{"en":"Some journalists dismissed him as a degenerationist who saw moral decline everywhere.","zh":"一些记者把他视为退化论者，认为他到处都看见道德滑坡。"},{"en":"The novel portrays a degenerationist critic who blames modern art for society’s problems.","zh":"这部小说刻画了一位退化论者式的评论家，把社会问题归咎于现代艺术。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or expressing the belief that society or culture is degenerating","zh":"（观点/言论）带有退化论色彩的；主张社会正在衰败的"},"examples":[{"en":"Her argument has a strongly degenerationist tone.","zh":"她的论证带有很强的退化论语气。"},{"en":"The speech was criticized for its degenerationist assumptions about young people.","zh":"那场演讲因对年轻人的“堕落化”假设而受到批评。"}]}],"synonyms":["declinist","doomsayer","pessimist","cultural pessimist"],"phonetic":"dɪˌdʒɛnəˈreɪʃənɪst","extraExplanation":["“degenerationist”常与19世纪末到20世纪初欧洲的“退化理论（degeneration theory）”相关：当时一些思想家认为工业化、城市化、移民或现代艺术会导致社会与道德“衰败”。这类观点后来常被批评为带有偏见，甚至被用来为种族主义或排外政策辩护。","在文学与文化批评语境里，常见搭配包括：degenerationist fears（退化论式恐惧）、degenerationist rhetoric（退化论话语）。作家兼评论家Max Nordau在《Degeneration》（1892）中是常被提到的代表人物之一。"]}
{"word":"degenerations","summary":{"en":"“Degenerations” means declines or deteriorations—especially physical/biological deterioration or a broader fall in standards or morals.","zh":"“degenerations”表示“退化/恶化/衰败”的复数形式，可指身体机能或生物性的退变，也可指标准、道德等方面的堕落与衰落。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a gradual worsening or decline in condition, quality, or function (often used in medicine or biology)","zh":"（常用于医学/生物学）逐渐恶化、退化；功能或状态逐步下降"},"examples":[{"en":"The doctor said the pain was caused by degeneration of the knee cartilage.","zh":"医生说疼痛是由膝盖软骨退化引起的。"},{"en":"Age-related degenerations can affect vision and mobility.","zh":"与年龄相关的退化会影响视力和行动能力。"}]},{"partOfSpeech":"n.","definition":{"en":"a decline from a better or more desirable state, especially in morals, culture, or standards","zh":"（道德、文化或标准等）衰败；堕落；每况愈下"},"examples":[{"en":"Some critics worried about the degeneration of public debate into insults.","zh":"一些批评者担心公共讨论退化成互相辱骂。"},{"en":"The novel describes the degeneration of a once-proud family over generations.","zh":"这部小说描写了一个曾经自豪的家族几代人的衰败。"}]}],"synonyms":["deteriorations","declines","breakdowns","degradations","worsenings"],"phonetic":"/dɪˌdʒɛnəˈreɪʃənz/","extraExplanation":["“degenerations”是名词复数；单数是“degeneration”。在医学语境里非常常见，比如“macular degeneration（黄斑变性）”“spinal degeneration（脊柱退变）”。","词根来自拉丁语：de-（向下）+ genus（种类、类型），原意有“从原本的类型变差/变坏”的感觉，因此既能指身体机能退化，也能指道德或品质的“堕落/衰败”。"]}
{"word":"degenerative","summary":{"en":"Degenerative describes something—especially a disease—that gradually worsens over time and causes loss of normal function.","zh":"Degenerative 指（尤指疾病）随时间逐渐恶化，导致正常功能逐步下降的“退行性/退化性”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a disease or condition) getting worse over time, often causing gradual loss of normal function.","zh":"（疾病或状况）逐渐恶化的；会随着时间推移导致功能逐步下降的。"},"examples":[{"en":"Alzheimer’s disease is a degenerative condition that affects memory and thinking.","zh":"阿尔茨海默病是一种退行性疾病，会影响记忆和思考能力。"},{"en":"The doctor explained that the pain came from degenerative changes in his spine.","zh":"医生解释说，他的疼痛来自脊柱的退行性变化。"},{"en":"Physical therapy can help people stay active even with degenerative joint disease.","zh":"即使患有退行性关节病，物理治疗也能帮助人们保持活动能力。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to a decline from a better or healthier state; becoming lower in quality, strength, or value.","zh":"（质量/状态）退化的；从更好或更健康的状态走下坡路的。"},"examples":[{"en":"Some people worry that constant stress can have a degenerative effect on health.","zh":"有些人担心长期压力会对健康产生退化性的影响。"},{"en":"Without maintenance, the building’s condition became degenerative.","zh":"缺乏维护，这栋建筑的状况逐渐退化。"}]}],"synonyms":["deteriorating","declining","worsening","progressive"],"phonetic":"/dɪˈdʒenərətɪv/","extraExplanation":["“degenerative”常见于医学语境，尤其描述“慢性、进行性恶化”的疾病或变化，如 degenerative arthritis（退行性关节炎）、degenerative disc disease（椎间盘退变/退行性椎间盘疾病）。","词根帮助记忆：de-（向下、离开）+ generate（产生/形成）→ “走向衰退、失去原有的良好状态”。","注意区分：degenerative（逐渐恶化） vs. acute（急性的） vs. progressive（进行性的，强调不断发展，可能好也可能坏，但医学里常指病情加重）。"]}
{"word":"degeneratively","summary":{"en":"“Degeneratively” means “in a degenerative way,” especially worsening gradually over time (often medical).","zh":"“degeneratively”表示“以退化的方式”，尤指随着时间逐渐恶化（常见于医学语境）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that involves degeneration: becoming worse, weaker, or less healthy over time (often used in medical/scientific contexts).","zh":"以退化的方式：随着时间推移变得更差、更弱或更不健康（常用于医学/科学语境）。"},"examples":[{"en":"The doctor explained that the joint was wearing down degeneratively.","zh":"医生解释说，这个关节正在以退化的方式磨损。"},{"en":"Certain spine conditions can progress degeneratively with age.","zh":"某些脊柱疾病可能会随着年龄增长而呈退化性进展。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that declines in quality, character, or function (more general use, less common).","zh":"以衰退的方式：在质量、品格或功能上走下坡路（更泛化的用法，较少见）。"},"examples":[{"en":"He felt the discussion was drifting degeneratively into insults.","zh":"他觉得讨论正在以走下坡路的方式滑向人身攻击。"}]}],"synonyms":["progressively (in worsening contexts)","gradually","over time","in a degenerative manner"],"phonetic":"/dɪˈdʒɛnərətɪvli/","extraExplanation":["“degeneratively”多见于医学写作，常与疾病或变化过程搭配，如：degeneratively changed tissue（发生退行性改变的组织）、degeneratively altered cartilage（退化性改变的软骨）。","它通常描述一种“逐渐恶化”的趋势，而不是突然发生的损伤；在日常口语里，人们更常说 gradually/over time 或 use “degenerative” 作形容词（a degenerative disease）。"]}
{"word":"degenerescence","summary":{"en":"A rare noun meaning degeneration—the process of becoming worse or deteriorating.","zh":"一个罕见名词，意为“退化/衰败”，即逐渐变差、恶化的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) the process of becoming worse in condition, quality, or health; degeneration.","zh":"（罕见）变坏、退化或衰败的过程；退化。"},"examples":[{"en":"The doctor warned that without treatment, the disease could lead to degenerescence of the tissue.","zh":"医生警告说，如果不治疗，这种疾病可能会导致组织退化。"},{"en":"Some older texts use “degenerescence” where modern writing would say “degeneration.”","zh":"一些较早的文本会用“degenerescence”，而现代写作通常会说“degeneration”。"}]}],"synonyms":["degeneration","deterioration","decline","decay"],"phonetic":"/ˌdiˌdʒɛnəˈrɛsəns/","extraExplanation":["“Degenerescence”在现代英语中非常少见，更多时候人们用更常见的名词“degeneration”。","词形上可理解为“degenerate（退化）+ -escence（表示‘正在发生的过程/状态’）”，强调“逐渐变成更差”的过程感。"]}
{"word":"degenerescent","summary":{"en":"“Degenerescent” is a rare adjective meaning “degenerating; becoming worse.”","zh":"“Degenerescent”是一个罕见形容词，意思是“正在退化的；逐渐变坏的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Becoming worse in quality, health, or character; degenerating.","zh":"（罕见）正在退化的；变质的；（品质、健康或品格）逐渐变差的。"},"examples":[{"en":"Some historians used the term “degenerescent” to describe a society they believed was in decline.","zh":"一些历史学家曾用“degenerescent”来形容他们认为正在衰落的社会。"},{"en":"The author warns that unchecked corruption can lead to a degenerescent political culture.","zh":"作者警告说，不受约束的腐败会导致政治文化逐渐退化。"}]}],"synonyms":["degenerating","degenerate","declining","deteriorating"],"phonetic":"/ˌdiːdʒəˈnɛrəˌsɛnt/","extraExplanation":["“degenerescent”非常少见，现代英语里更常用degenerating（正在退化的）或degenerate（退化的/堕落的）。","词源来自拉丁语de-（向下、离开）+ genus（种类、出生），核心含义是“偏离原本的良好状态”。","在当代写作中，这个词带有较强的价值判断色彩（暗示“变坏/堕落”），使用时注意语气与场合；学术或医学语境更常用degenerative（退行性的，如degenerative disease）。"]}
{"word":"degeneroos","summary":{"en":"“Degenerate” means to decline or become worse; as an adjective it describes something degraded, and as a noun it’s an insulting label for a ‘morally corrupt’ person.","zh":"“degenerate”表示“退化/恶化/堕落”；作形容词指“退化的、堕落的”，作名词时多为侮辱性称呼“堕落者”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) Having declined in quality, morality, or normal healthy condition; often implying something has become worse or corrupted.","zh":"（形容词）退化的；堕落的；品质或道德变坏的；也可指（身体/状态）不健康、走下坡路的。"},"examples":[{"en":"The article criticized the show for its degenerate humor.","zh":"这篇文章批评那档节目充斥着低俗（堕落的）幽默。"},{"en":"Without exercise, the muscles can become weak and degenerate over time.","zh":"如果不锻炼，肌肉会随着时间变弱并逐渐退化。"}]},{"partOfSpeech":"v.","definition":{"en":"(v.) To become worse in quality or condition; to decline or deteriorate.","zh":"（动词）退化；恶化；堕落；变质。"},"examples":[{"en":"Their friendly debate degenerated into an argument.","zh":"他们原本友好的讨论恶化成了争吵。"},{"en":"If the disease is not treated, the tissue may degenerate.","zh":"如果不治疗，这种疾病可能会导致组织退化。"}]},{"partOfSpeech":"n.","definition":{"en":"(n.) A person considered morally corrupt or socially unacceptable (this use is insulting).","zh":"（名词，贬义/侮辱）被认为道德败坏或不被社会接受的人（带强烈侮辱性）。"},"examples":[{"en":"It’s harmful to label people as degenerates.","zh":"给人贴上“堕落者”的标签是有害的。"}]}],"synonyms":["deteriorate","decline","degrade","corrupt","decay"],"phonetic":"/dɪˈdʒɛnəreɪt/","extraExplanation":["你输入的“degeneroos”不是常见英文拼写；最接近且最常用的词是 **degenerate**。","**degenerate into** 是高频搭配，表示“（情况）演变成/堕落为（更糟的状态）”，如 *degenerate into violence*（演变成暴力）。","作名词 **degenerate** 在现代英语里通常被视为侮辱性用语，尤其在描述人群时可能带有歧视或伤害；更中性的表达可用 *a troubled person*（有困扰的人）、*a corrupt official*（腐败官员）等根据语境选择。"]}
{"word":"degentilize","summary":{"en":"“Degentilize” means to make someone or something less refined, polite, or civilized.","zh":"“Degentilize”指使某人或某事物失去文雅、礼貌或文明的特质。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to remove the “gentle” or refined qualities from someone or something; to make less civilized, less polite, or less like a gentleman","zh":"使失去“温文尔雅/绅士气”的特质；使变得不再文雅、不再有教养"},"examples":[{"en":"He worried that years of war would degentilize the young soldiers.","zh":"他担心多年的战争会让年轻士兵失去温文与教养。"},{"en":"The harsh working conditions seemed to degentilize the town’s culture over time.","zh":"艰苦的工作环境似乎随着时间推移让这座小镇的文化变得不再文雅。"}]}],"synonyms":["coarsen","brutalize","degrade","de-civilize","make less refined"],"phonetic":"/diːˈdʒɛn.tə.laɪz/","extraExplanation":["这是一个非常少见、带有文学/批评色彩的词，常用于讨论“文明/教养”被削弱的过程。日常英语里更常用的表达有：de-civilize（使不文明）、brutalize（使残暴/粗野）、coarsen（使粗俗/粗糙）、degrade（使堕落/降低）等。","构词上可理解为 de-（去除、反向）+ gentil(e)（源自拉丁语/法语词根，意为“高贵、文雅”）+ -ize（使成为）。"]}
{"word":"degerm","summary":{"en":"“Degerm” means to remove germs from something, especially in food or milk processing; it can also mean to disinfect/sterilize.","zh":"“degerm”指去除细菌（尤用于食品或牛奶加工），也可泛指消毒/灭菌。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove germs from something (especially food or milk) to make it cleaner and safer","zh":"给……去除细菌（尤指食品或牛奶），使其更清洁、更安全"},"examples":[{"en":"The company degerms the milk before it is packaged.","zh":"这家公司在包装前会对牛奶进行去菌处理。"},{"en":"Some factories degerm food surfaces using heat or special filters.","zh":"一些工厂会用加热或特殊过滤方式给食品表面去菌。"}]},{"partOfSpeech":"vt.","definition":{"en":"to disinfect or sterilize something; to make it (more) germ-free","zh":"对……消毒/灭菌；使……（更）无菌"},"examples":[{"en":"Hospitals use approved chemicals to degerm equipment between patients.","zh":"医院会在不同病人之间用合规的化学药剂对设备进行灭菌处理。"},{"en":"Wash your hands to help degerm them before cooking.","zh":"做饭前洗手有助于让手更少细菌。"}]}],"synonyms":["disinfect","sterilize","sanitize","decontaminate"],"phonetic":"/diˈdʒɝm/","extraExplanation":["“degerm”常见于食品与乳品加工语境，强调“去除细菌/微生物”的处理步骤；在日常英语中更常用的说法是 “disinfect”（消毒）或 “sterilize”（灭菌）。","词形结构：de-（去除）+ germ（细菌/病菌），字面意思就是“去掉病菌”。"]}
{"word":"degermed","summary":{"en":"Degermed usually means grain/flour/cornmeal processed with the germ removed, often for longer shelf life and a different texture.","zh":"Degermed 通常指谷物/面粉/玉米粉“去胚芽”的加工状态，多为延长保质期并改变口感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of grain, flour, or cornmeal) having the germ removed during processing.","zh":"（指谷物、面粉或玉米粉）在加工过程中去除了胚芽的。"},"examples":[{"en":"Degermed cornmeal has a longer shelf life because the oily germ is removed.","zh":"去胚芽的玉米粉保存期更长，因为含油的胚芽被去掉了。"},{"en":"Some recipes call for degermed flour to get a lighter texture.","zh":"有些食谱会要求用去胚芽面粉，让口感更轻更细。"}]},{"partOfSpeech":"v.","definition":{"en":"Past participle of “degerm”: to remove germs or to remove the germ of a grain (less common in everyday use).","zh":"“degerm”的过去分词：给……去除细菌，或给谷物去除胚芽（在日常中较少见）。"},"examples":[{"en":"The facility degermed the equipment before packaging.","zh":"工厂在包装前对设备进行了去菌处理。"},{"en":"The mill degermed the corn before grinding it into meal.","zh":"磨坊先给玉米去胚芽，再磨成玉米粉。"}]}],"synonyms":["dehulled (not the same but related)","refined","germ-removed"],"phonetic":"/diˈdʒɝmd/","extraExplanation":["在食品语境里，degermed 通常指“去胚芽”。胚芽（germ）是谷粒里富含油脂、维生素和矿物质的部分；去掉后更耐储存、不易哈喇（油脂氧化产生异味），但营养也可能减少。常见于 cornmeal、grits、某些精制面粉等加工说明。"]}
{"word":"degerminate","summary":{"en":"Degerminate means to remove germs from something (disinfect/sterilize), and less commonly, to prevent seeds from germinating.","zh":"Degerminate 指给……除菌（消毒/灭菌）；较少见用法指阻止种子发芽。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove germs (microorganisms) from something; to disinfect or sterilize","zh":"给……除菌；去除（微生物）以消毒或灭菌"},"examples":[{"en":"The hospital uses special chemicals to degerminate surgical tools.","zh":"医院使用特殊化学品为手术器械除菌。"},{"en":"Workers degerminated the containers before filling them with juice.","zh":"工人先给容器除菌，然后再灌装果汁。"}]},{"partOfSpeech":"vt.","definition":{"en":"(biology, less common) to prevent a seed or spore from germinating; to stop sprouting","zh":"（生物学，较少见）使种子或孢子不能发芽；阻止萌发"},"examples":[{"en":"The treatment was designed to degerminate weed seeds in the soil.","zh":"这种处理方法旨在阻止土壤中的杂草种子发芽。"}]}],"synonyms":["disinfect","sterilize","sanitize","decontaminate"],"phonetic":"/diˈdʒɝːməˌneɪt/","extraExplanation":["词源上由前缀 de-（去除）+ germ（细菌/胚芽）+ -inate（动词后缀）构成，所以字面意思就是“去掉germ”。日常英语里更常用的近义词是 disinfect（消毒）或 sterilize（灭菌）；degerminate 更偏技术/书面语。"]}
{"word":"degerminator","summary":{"en":"A degerminator is a device that removes or kills germs, often used in food/drink processing.","zh":"degerminator 指“除菌/杀菌装置”，常见于食品或饮料加工领域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a machine or device that removes or kills germs (microorganisms), especially in food or drink processing (for example, milk treatment).","zh":"除菌器；杀菌装置（用于去除或杀灭细菌等微生物的机器或设备，尤指食品/饮料加工中，如牛奶处理）。"},"examples":[{"en":"The dairy installed a degerminator to reduce bacteria in the milk.","zh":"这家乳品厂安装了一台除菌器来降低牛奶中的细菌含量。"},{"en":"Water passes through the degerminator before it is bottled.","zh":"水在装瓶前会先经过除菌装置处理。"}]}],"synonyms":["sterilizer","disinfecting device","pasteurizer"],"phonetic":"/diːˈdʒɝːməˌneɪtər/","extraExplanation":["这是一个相对少见的技术词，多见于食品加工、乳品工业或设备说明书中。日常英语里更常用 sterilizer（灭菌器/消毒器）、disinfectant (device)（消毒装置）或在牛奶语境下用 pasteurizer（巴氏杀菌设备）。","构词上是 de-（去除）+ germ（细菌/病菌）+ -inator（做某事的机器/装置），字面意思就是“去菌的装置”。"]}
{"word":"degerming","summary":{"en":"Degerming means removing germs—cleaning something to reduce or eliminate microorganisms; in some food-processing contexts it can also mean removing a grain’s germ (embryo).","zh":"Degerming 指去除细菌/微生物（消毒、灭菌）；在某些食品加工语境中也可指去除谷物的胚芽（如玉米脱胚）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of removing germs (microorganisms) from something; disinfection or sterilization","zh":"去除细菌/微生物的过程；消毒或灭菌"},"examples":[{"en":"Degerming of medical tools helps prevent infection.","zh":"对医疗器械进行去菌处理有助于预防感染。"},{"en":"Handwashing is a simple form of degerming before meals.","zh":"饭前洗手是一种简单的去菌方式。"}]},{"partOfSpeech":"v.","definition":{"en":"removing germs from something (the -ing form of “degerm”)","zh":"正在去除细菌/微生物（“degerm”的 -ing 形式）"},"examples":[{"en":"The nurse is degerming the skin before the injection.","zh":"护士在注射前正在给皮肤消毒。"},{"en":"They are degerming the equipment with alcohol.","zh":"他们正在用酒精对设备进行消毒。"}]}],"synonyms":["disinfection","sterilization","sanitizing","decontamination"],"phonetic":"/diːˈdʒɝːmɪŋ/","extraExplanation":["“Degerm-”由前缀 de-（去除）+ germ（细菌/胚芽）构成，字面意思是“去掉细菌/胚芽”。在日常健康语境里常指“消毒、灭菌”。","在食品加工中，degerm/degerming 有时也指“去胚芽”（如玉米脱胚），目的是延长保存期、减少油脂酸败；这个用法更偏行业术语，语境通常会提到 corn/maize（玉米）或 milling（碾磨加工）。"]}
{"word":"degerms","summary":{"en":"“Degerms” means disinfects/sterilizes—removes germs from something.","zh":"“degerms”意为“消毒/灭菌”，即去除某物上的病菌。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to remove germs from something; to disinfect or sterilize","zh":"给……除菌；消毒；灭菌"},"examples":[{"en":"This solution degerms the skin before an injection.","zh":"这种溶液会在注射前给皮肤消毒。"},{"en":"The clinic degerms its tools after every patient.","zh":"诊所在每位病人之后都会给器械消毒。"},{"en":"Soap helps, but it doesn’t always degerm surfaces completely.","zh":"肥皂有帮助，但并不总能把表面完全除菌。"}]}],"synonyms":["disinfects","sanitizes","sterilizes","decontaminates"],"phonetic":"/diˈdʒɝmz/","extraExplanation":["“degerms”通常是动词“degerm”的第三人称单数形式（he/she/it degerms），也可能被当作复数形式使用。更常见的表达是 disinfect（消毒）或 sterilize（灭菌）；degerm 在医疗、护理、清洁产品说明中更常见。","词形上 de- 表示“去除、除去”，germ 指“细菌/病菌”，合起来就是“去掉病菌”。"]}
{"word":"degged","summary":{"en":"“Degged” is slang (mainly Aus/NZ) meaning “pantsed,” or the past form of “deg” (to pull down someone’s pants as a prank).","zh":"“degged”是（主要澳新）俚语，意思是“被人扒裤子/被脱裤子（pantsed）”，也可作动词 deg 的过去式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(slang, chiefly Australia/New Zealand) having had your pants/trousers pulled down by someone as a prank; “pantsed.”","zh":"（俚语，主要用于澳大利亚/新西兰）被人恶作剧把裤子扯下（“被脱裤子”/“被扒裤子”）。"},"examples":[{"en":"He got degged at school and felt really embarrassed.","zh":"他在学校被人恶作剧扯下裤子，觉得特别尴尬。"},{"en":"Don’t deg people—it can be humiliating.","zh":"别去扒人裤子——这会让人很难堪。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of deg: to pull down someone’s pants as a prank; to “pants” someone.","zh":"deg 的过去式/过去分词：恶作剧把某人的裤子扯下；“扒裤子/脱裤子”。"},"examples":[{"en":"Someone degged him during the game.","zh":"比赛时有人把他的裤子扯下来了。"},{"en":"They apologized after they’d degged him.","zh":"他们扒了他的裤子之后道歉了。"}]}],"synonyms":["pantsed","humiliated (context-dependent)","pranked (general)"],"phonetic":"/dɛɡd/","extraExplanation":["“degged/deg”属于强烈的地区性俚语，主要见于澳大利亚和新西兰的口语中；在美国英语里更常说 *pantsed*（被扒裤子）。","这个行为在很多场合会被视为欺凌或性骚扰（尤其在学校/公共场所），使用时要非常谨慎，避免用来开别人不舒服的玩笑。"]}
{"word":"degger","summary":{"en":"“Degger” is not standard English; it’s usually a misspelling of “dagger.”","zh":"“degger”不是标准英文，通常是把“dagger（匕首）”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling of “dagger” (a short knife used as a weapon).","zh":"不是标准英语单词；最常见是把“dagger”（匕首、短剑）拼错了。"},"examples":[{"en":"I think you meant “dagger,” not “degger.”","zh":"我觉得你想写的是“dagger”，不是“degger”。"},{"en":"In the story, the thief hid a dagger under his coat.","zh":"在故事里，小偷把一把匕首藏在外套下面。"}]}],"synonyms":["dagger","knife","blade"],"phonetic":"/ˈdæɡɚ/","extraExplanation":["“degger”在常见词典里一般查不到，写作中建议改为“dagger”。“dagger”也常用于比喻：a dagger look（像刀子一样的眼神）、words like daggers（言语如刀）。"]}
{"word":"degging","summary":{"en":"“Degging” is usually a misspelling of “digging.” “Digging” means (1) making a hole/moving earth, or (2) informally, liking something.","zh":"“degging”通常是“digging”的拼写错误。“digging”可指（1）挖掘/翻土；（2）口语中表示喜欢某物。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“Degging” is not a standard English word. In most cases, it is a misspelling of “digging.”","zh":"“degging”不是标准英语单词。多数情况下，它是“digging”的拼写错误。"},"examples":[{"en":"I think you meant “digging,” not “degging.”","zh":"我觉得你想写的是“digging”，不是“degging”。"},{"en":"Could you share the full sentence where you saw “degging”?","zh":"你能把包含“degging”的完整句子发我看看吗？"}]},{"partOfSpeech":"v.","definition":{"en":"digging: using a tool or hands to make a hole in the ground, move earth, or search for something.","zh":"digging：用工具或手挖洞、翻土，或为了寻找某物而挖掘。"},"examples":[{"en":"They are digging a hole for a tree.","zh":"他们正在挖一个洞来种树。"},{"en":"I spent the afternoon digging in the garden.","zh":"我下午一直在花园里翻土。"}]},{"partOfSpeech":"v.","definition":{"en":"digging (informal): liking or enjoying something; thinking it’s cool.","zh":"digging（非正式）：喜欢/享受某事；觉得很酷。"},"examples":[{"en":"I’m really digging this song.","zh":"我真的很喜欢这首歌。"},{"en":"Are you digging the new design?","zh":"你喜欢这个新设计吗？"}]}],"synonyms":["excavating","shoveling","liking","enjoying"],"phonetic":"/ˈdɪɡɪŋ/","extraExplanation":["“dig it / I dig it”这种用法常见于美式口语与流行文化（尤其在爵士乐、嬉皮文化等语境里），意思接近“我懂了/我喜欢”。","如果你是在社交媒体或游戏聊天里看到“degging”，也可能只是打字手滑（把 i 打成 e）或方言/圈内拼写。给我原句我可以更准确判断。"]}
{"word":"deglacial","summary":{"en":"Deglacial describes the period/process when glaciers melt and retreat, especially after an ice age.","zh":"deglacial 指冰川融化并后退的退冰过程或相关时期，常用于冰期结束后的气候与环境变化语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to, or occurring during, the melting and retreat of glaciers (especially after an ice age).","zh":"与冰川消融和退缩有关的；指冰期后冰川融化、后退阶段发生的。"},"examples":[{"en":"Scientists studied deglacial warming to understand how Earth’s climate shifted after the last ice age.","zh":"科学家研究退冰期变暖，以理解上一次冰期之后地球气候如何转变。"},{"en":"Deglacial lakes formed as the ice sheet melted and water collected behind natural dams.","zh":"随着冰盖融化，水在天然“坝体”后方汇集，形成了退冰期湖泊。"}]}],"synonyms":["postglacial","deglaciation-related"],"phonetic":"/diˈɡleɪʃəl/","extraExplanation":["“de-”常表示“去除、逆转”（如 deice 去冰、defrost 解冻），加上 glacial（冰川的）就构成 deglacial，直观含义是“与退冰/去冰川化有关的”。","该词多见于地质学、古气候学与环境科学文献中，常与 deglaciation（退冰作用/冰川消退过程）、deglacial period（退冰期）一起出现。","在学术写作中，deglacial 常指“末次盛冰期之后（约两万年前起）到全新世早期”的气候与海平面变化背景，但具体时间范围会随研究地区与学科而变。"]}
{"word":"deglaciate","summary":{"en":"Deglaciate means to lose or remove ice—especially when an area becomes free of glaciers as they melt or retreat.","zh":"deglaciate 指（使）失去冰、去冰，尤指某地区因冰川融化或退缩而变得无冰。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To remove or lose ice; to become free of ice (for example, a landscape after glaciers melt).","zh":"（使）去冰；（尤指因冰川融化而）变得无冰。"},"examples":[{"en":"As the climate warms, many mountain valleys are starting to deglaciate.","zh":"随着气候变暖，许多山谷开始去冰（冰川退缩、消失）。"},{"en":"Scientists use satellite images to measure how quickly a region is deglaciating.","zh":"科学家用卫星图像来测量一个地区去冰的速度。"}]},{"partOfSpeech":"vt.","definition":{"en":"To melt away or remove a glacier from an area; to cause deglaciation.","zh":"使冰川消融/退去；导致去冰（去冰期）。"},"examples":[{"en":"Rising temperatures can deglaciate high-altitude basins within decades.","zh":"气温上升可能在几十年内使高海拔盆地出现明显去冰。"}]}],"synonyms":["deice","thaw","melt","deglaciate (becoming ice-free)","lose its glaciers","undergo deglaciation"],"phonetic":"/diˈɡleɪʃiˌeɪt/","extraExplanation":["词源提示：de- 表示“去除、离开”，glaci- 来自拉丁语 glacies（“冰”）。因此 deglaciate 字面意思是“把冰（或冰川）去掉”。","使用场景：这是一个偏科学/地理学的词，常见于气候变化、冰川学（glaciology）、第四纪地质（Quaternary geology）等语境。日常英语更常用 melt, thaw, lose its glaciers, glacier retreat 等表达。","相关词：deglaciation（n. 去冰作用/去冰期）、glaciated（adj. 被冰川覆盖过的）、glacial retreat（n. 冰川退缩）。"]}
{"word":"deglaciation","summary":{"en":"Deglaciation means the melting and retreat of glaciers and ice sheets, especially after an ice age.","zh":"Deglaciation 指冰川与冰盖的融化和后退过程，尤指冰河时期之后的退冰作用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process in which glaciers and ice sheets melt, shrink, or retreat, especially after an ice age","zh":"（尤指冰河时期之后）冰川与大陆冰盖融化、缩小或后退的过程；退冰（作用）"},"examples":[{"en":"After the last Ice Age, deglaciation reshaped many river valleys.","zh":"在上一次冰河时期结束后，退冰过程重塑了许多河谷。"},{"en":"Scientists study deglaciation to understand past climate change.","zh":"科学家研究退冰作用，以理解过去的气候变化。"}]}],"synonyms":["glacier retreat","ice-sheet melting","de-icing (general)"],"phonetic":"/diˌɡleɪsiˈeɪʃən/","extraExplanation":["词源提示：de- 有“去除、减少”的意思，glaciation 指“（被）冰川覆盖/成冰作用”。合起来 deglaciation 就是“去冰化/退冰”。","常见语境：地理与气候科学中常用。它不仅指“冰在变少”，也常包含由此引发的连锁变化，如海平面上升、地表回弹（冰后均衡回弹）、形成冰碛、冰湖溃决洪水等。","相关词汇：glaciation（成冰/冰川作用），glacier retreat（冰川退缩，更口语、更具体），meltwater（融水），postglacial（冰后期的）。"]}
{"word":"deglamorization","summary":{"en":"Deglamorization means taking away glamour or idealization and presenting something more realistically.","zh":"Deglamorization 指“去魅/去光环”：去除美化与理想化，改为更真实地呈现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The process of removing glamour, charm, or an idealized image from something; showing it in a more ordinary, realistic, or unromantic way.","zh":"“去魅/去光环”的过程：把某事物原本被美化、浪漫化或理想化的形象拿掉，呈现更普通、真实或不那么迷人的一面。"},"examples":[{"en":"The film’s deglamorization of war focuses on fear, exhaustion, and loss instead of heroic glory.","zh":"这部电影对战争进行了“去光环化”的呈现，把重点放在恐惧、疲惫与失去上，而不是英雄式的荣耀。"},{"en":"Some viewers praised the deglamorization of celebrity life, showing loneliness behind the spotlight.","zh":"一些观众称赞它对名人生活的“去魅”，展现了聚光灯背后的孤独。"},{"en":"The campaign aims at the deglamorization of smoking by highlighting its health risks.","zh":"该宣传活动旨在对吸烟“去美化”，强调其健康风险。"}]}],"synonyms":["demystification","debunking","deflation","de-romanticization","down-to-earth portrayal"],"phonetic":"/diˌɡlæmɚəˈzeɪʃən/","extraExplanation":["构词提示：de- 表示“去除/反向”，glamor 表示“魅力/迷人光环”，-ization 表示“……的过程/行为”。因此 deglamorization 字面意思就是“去除迷人光环的过程”。","常见语境：媒体评论、社会议题讨论与文学/电影评论中常用，用来描述对战争、毒品、犯罪、奢侈生活等“反浪漫化”的呈现（强调代价与现实）。","拼写差异：美式多写 deglamorization；英式常见 deglamorisation。"]}
{"word":"deglamorize","summary":{"en":"“Deglamorize” means to remove the glamour from something by showing its real, often less attractive side.","zh":"“deglamorize”指通过揭示真实（常较不美好）的面貌来“去除光环/去魅”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something seem less glamorous, exciting, or attractive by showing its ordinary or unpleasant reality","zh":"去魅；去除光环；揭示某事物不那么迷人、刺激或吸引人的真实（往往更平凡或不美好）一面"},"examples":[{"en":"The documentary deglamorizes life as a celebrity by focusing on loneliness and pressure.","zh":"这部纪录片通过呈现孤独和压力，去魅了明星生活。"},{"en":"She wants to deglamorize dieting and talk about health instead of quick results.","zh":"她想给节食去魅，把重点放在健康上，而不是快速见效。"},{"en":"The book deglamorizes war, showing the fear and long-term trauma it leaves behind.","zh":"这本书为战争去魅，展现了恐惧与长期创伤。"}]}],"synonyms":["demystify","disenchant","debunk","de-romanticize","strip away the glamour"],"phonetic":"/diˈɡlæməˌraɪz/","extraExplanation":["构词：de-（去除、反向）+ glamour（魅力、光环）+ -ize（使……化）。因此字面意思就是“把光环拿掉”。","常见语境：媒体与文化评论（如“为某种生活方式/行业去魅”），也常用于谈论对名利、奢侈、战争、毒品等主题的“祛魅化叙事”。","语体提示：比起日常口语，它更常见于新闻、评论、学术或纪实写作中；口语里也可用更简单的表达，如 “make it look less glamorous / take away the glamour”。"]}
{"word":"deglamorized","summary":{"en":"“Deglamorized” means made less glamorous or idealized—shown more realistically.","zh":"“deglamorized”指“去魅/去除光环”，把事物从美化与理想化中拉回更真实、平凡的呈现。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"made to seem less glamorous, exciting, or attractive; shown in a more ordinary or realistic way","zh":"（被）去魅的；（被）去除光环的；被呈现得更平凡或更真实的"},"examples":[{"en":"The movie deglamorized the fashion industry by showing the long hours and low pay.","zh":"这部电影通过展示漫长工时和低薪，让时尚行业“去魅”。"},{"en":"After the scandal, the celebrity’s image was quickly deglamorized in the media.","zh":"丑闻之后，这位名人的形象很快在媒体中被“去光环化”。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of “deglamorize”: to make something seem less glamorous or idealized","zh":"“deglamorize”的过去式/过去分词：使某事物不再显得光鲜或理想化；去除美化效果"},"examples":[{"en":"The documentary deglamorized war for many viewers.","zh":"这部纪录片让许多观众对战争祛魅。"},{"en":"The ads were deglamorized to comply with the new rules.","zh":"这些广告被去除美化效果，以符合新规定。"}]}],"synonyms":["de-romanticized","demystified","toned down","stripped of glamour","made more realistic"],"phonetic":"/diˈɡlæməˌraɪzd/","extraExplanation":["“deglamorize”= de-（去除）+ glamor/glamour（魅力、光环）。在英语里常用来谈媒体叙事：把某个行业、生活方式或人物从“滤镜”和“神话”中拉回现实。","常见搭配：deglamorized image/portrait（去魅后的形象/描绘），deglamorize the industry/war/fame（让某行业/战争/名声祛魅）。"]}
{"word":"deglamorizing","summary":{"en":"“Deglamorizing” means making something seem less glamorous by revealing the real, often ordinary or harsh, reality.","zh":"“deglamorizing”指通过揭示真实（往往更平凡或更残酷）的面貌，让某事物不再光鲜迷人。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"making something seem less glamorous, less attractive, or less romantic than before (often by showing the ordinary, difficult, or negative reality behind it)","zh":"（通过揭示平凡、艰难或负面现实）让某事物看起来不再光鲜/不再迷人；去魅、去光环"},"examples":[{"en":"The documentary is deglamorizing life in the fashion industry by showing the long hours and pressure.","zh":"这部纪录片通过展示漫长工时和压力，让时尚行业的生活不再那么光鲜。"},{"en":"Some writers try to avoid deglamorizing love, while others show how messy it can be.","zh":"有些作家尽量不让爱情“去魅”，而另一些则展现它可能有多混乱。"},{"en":"By talking openly about failure, she is deglamorizing success and making it feel more real.","zh":"她坦诚谈论失败，是在给“成功”去光环，让它显得更真实。"}]}],"synonyms":["deflattering","demystifying","showing the reality of","taking the glamour out of","stripping away the glamour"],"phonetic":"/diˈɡlæmərˌaɪzɪŋ/","extraExplanation":["“de-”常表示“去掉、降低”，+“glamorize（使……迷人/光鲜）”，所以 deglamorize 就是“去光鲜化/去魅”。常见于媒体、纪录片、社会评论：强调把被美化的事物还原为更真实的一面。","美式常写作 deglamorize（-ize）；英式也常见 deglamorise（-ise）。","语气通常不是中性：可能带批判或纠正“过度美化”的意味。相近表达：take the glamour out of…, strip away the glamour, demystify（去神秘化）。"]}
{"word":"deglassed","summary":{"en":"“Deglassed” most commonly means a pan has been deglazed—liquid was added to loosen and scrape up browned bits to make a sauce.","zh":"“Deglassed”最常见指“给锅底去釉/起底”（deglaze）：加入液体把焦香残渣溶解并刮起，常用于做酱汁。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Cooking) having had a pan’s browned bits (“fond”) loosened by adding liquid and scraping, usually to make a sauce.","zh":"（烹饪）指锅底的焦香残渣（fond）被加入液体并刮起溶解，通常用来做酱汁。"},"examples":[{"en":"After searing the chicken, she deglassed the pan with white wine to make a quick sauce.","zh":"把鸡肉煎上色后，她用白葡萄酒给锅“deglass”，做了个快速酱汁。"},{"en":"The recipe says the pan should be deglassed with stock before adding the mushrooms.","zh":"食谱说先用高汤把锅底“deglass”，再加入蘑菇。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/participle of deglass: to deglaze a pan by adding liquid and scraping up the browned bits.","zh":"deglass 的过去式/过去分词：指用液体把锅底的焦香残渣刮起溶解（即 deglaze）。"},"examples":[{"en":"He deglassed the skillet with broth and reduced it until it thickened.","zh":"他用高汤把平底锅“deglass”，然后收汁到变浓。"},{"en":"Once you’ve deglassed the pan, stir in butter to finish the sauce.","zh":"锅一旦“deglass”好了，就拌入黄油来收尾做酱。"}]}],"synonyms":["deglazed","loosened (the fond)","scraped up the browned bits"],"phonetic":"/diˈɡlæs(t)/","extraExplanation":["“deglassed”在烹饪语境里多见于口语或个别菜谱写法，更常见、也更标准的拼写是“deglazed”。两者意思基本相同：用酒、汤或水等液体把锅底的焦香物质溶解并刮起，用于做酱汁。"]}
{"word":"deglassing","summary":{"en":"Deglassing is a cooking technique: add liquid to a hot pan to loosen browned bits (fond) and build a flavorful sauce.","zh":"Deglassing（脱釉）是一种烹饪技巧：在热锅中加入液体把锅底焦香残渣（fond）溶解刮起，用来做出更有味道的酱汁。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The cooking technique of adding a liquid (like wine, broth, or water) to a hot pan to dissolve and lift the browned bits (\"fond\") from the bottom, usually to make a sauce.","zh":"（烹饪）脱釉：在热锅中加入液体（如葡萄酒、高汤或水）溶解并刮起锅底焦香褐色残渣（fond），通常用来做酱汁。"},"examples":[{"en":"After searing the chicken, I used white wine for deglassing and made a quick pan sauce.","zh":"煎好鸡肉后，我用白葡萄酒脱釉，做了一个快速的锅汁。"},{"en":"Deglasing the pan helps capture all the flavor stuck to the bottom.","zh":"脱釉能把粘在锅底的味道都“带出来”。"}]},{"partOfSpeech":"v.","definition":{"en":"The act of deglazing; the present participle form used to describe what someone is doing in cooking.","zh":"（动词 deglaze 的 -ing 形式）正在脱釉；指烹饪时正在进行的“加液体刮锅底”的动作。"},"examples":[{"en":"She’s deglassing the skillet with broth before adding cream.","zh":"她正用高汤给平底锅脱釉，然后再加入奶油。"}]}],"synonyms":["deglazing","pan deglazing","making a pan sauce","loosening the fond"],"phonetic":"diˈɡleɪsɪŋ","extraExplanation":["在英文食谱里更常见的基本词是 **deglaze**（动词：给锅脱釉/刮锅底），而 **deglassing** 常作为“步骤名/过程”出现。","关键点是锅里要有“焦化的褐色香味物质”（fond）。加液体后迅速搅拌或用锅铲刮起，这些物质会融入液体，形成浓郁的锅汁或酱汁。"]}
{"word":"deglaze","summary":{"en":"To add liquid to a hot pan and scrape up browned bits to make a sauce.","zh":"往热锅加液体并刮起锅底焦香残渣，用来做酱汁。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Cooking) To add liquid (such as wine, stock, or water) to a hot pan after searing or sautéing, then scrape and dissolve the browned bits (fond) so they become part of a sauce.","zh":"（烹饪）在煎/炒完后往热锅里加入液体（如葡萄酒、高汤或水），把锅底的焦香褐色残渣（fond）刮起并溶解，用来做酱汁。"},"examples":[{"en":"After you cook the chicken, deglaze the pan with white wine and stir the browned bits into the sauce.","zh":"鸡肉煎好后，用白葡萄酒给锅子“deglaze（脱釉）”，把锅底的焦香残渣搅进酱汁里。"},{"en":"She deglazed with stock to make a quick pan sauce.","zh":"她用高汤脱釉，快速做了一个锅汁。"}]}],"synonyms":["make a pan sauce","loosen the fond","scrape up the browned bits"],"phonetic":"/diˈɡleɪz/","extraExplanation":["“Deglaze”常见于食谱写法：deglaze the pan。这里的“glaze”原意与“上釉/形成光亮层”有关；烹饪中可理解为锅底形成一层焦香的“附着物”，而de-表示“去除/逆转”，所以deglaze就是用液体把这些附着物“溶下来”。","做法要点：锅要热、液体一倒入会迅速沸腾；用木铲/刮刀把fond刮起；酒精类液体通常要稍微煮一会儿让酒精挥发。别和“marinate（腌制）”或“glaze（上糖浆/上光）”混淆。"]}
{"word":"deglazed","summary":{"en":"“Deglazed” means a pan has had liquid added to loosen the browned bits, usually to make a sauce.","zh":"“Deglazed”指在热锅中加入液体把锅底焦香褐色残渣刮起，通常用来做酱汁。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Cooking) Past tense/past participle of “deglaze”: to add liquid (like wine, broth, or water) to a hot pan to loosen the browned bits of food and make a sauce.","zh":"（烹饪）“deglaze”的过去式/过去分词：向热锅中加入液体（如葡萄酒、高汤或水），把锅底的焦香褐色残渣刮起并融入液体，用来做酱汁。"},"examples":[{"en":"After searing the chicken, she deglazed the pan with white wine to make a quick sauce.","zh":"把鸡肉煎至上色后，她用白葡萄酒给锅“deglaze”，快速做了个酱汁。"},{"en":"Deglazed with broth, the browned bits turned into a rich gravy.","zh":"加入高汤deglaze后，锅底的褐色焦香物变成了浓郁的肉汁酱。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Cooking) Having been deglazed; describing a pan or the sauce made from the loosened browned bits.","zh":"（烹饪）已完成deglaze处理的；形容已“开锅底/刮锅底”后的锅，或由锅底焦香物做成的酱汁。"},"examples":[{"en":"Pour the deglazed sauce over the steak before serving.","zh":"上桌前把deglaze出来的酱汁浇在牛排上。"},{"en":"The recipe calls for a deglazed pan sauce with lemon and butter.","zh":"这道菜需要用柠檬和黄油做一个deglaze出来的锅汁。"}]}],"synonyms":["pan-seared sauce (related)","made a pan sauce (related)","scraped up the browned bits (explanation)"],"phonetic":"/diˈɡleɪzd/","extraExplanation":["在西餐烹饪里，deglaze 的关键对象是锅底的褐色焦香残渣（常叫 fond），它含有“美拉德反应”带来的香味。做法通常是：关小火或离火→倒入少量液体→用锅铲/木勺把锅底刮起→稍微收汁，就得到风味很浓的锅汁（pan sauce）。","常见搭配：白葡萄酒配鸡/鱼；红酒配牛/羊；高汤更温和；醋或柠檬汁带酸度但要少量，避免过酸。"]}
{"word":"deglazes","summary":{"en":"“Deglazes” means “adds liquid to a hot pan to loosen browned bits and make a sauce.”","zh":"“deglazes”指“往热锅里加液体把锅底焦褐物溶解刮起，用来做酱汁”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to add liquid (like wine, stock, or water) to a hot pan to loosen and dissolve the browned bits of food (fond) so you can make a sauce","zh":"（烹饪）往热锅中加入液体（如葡萄酒、高汤或水），把锅底的焦褐沉淀（锅巴/焦香物）溶解刮起，用来做酱汁"},"examples":[{"en":"After searing the chicken, she deglazes the pan with white wine to make a quick sauce.","zh":"把鸡肉煎至上色后，她用白葡萄酒给锅“脱釉”，做一个快手酱汁。"},{"en":"He deglazes with stock and scrapes up the browned bits for extra flavor.","zh":"他倒入高汤来“脱釉”，并把锅底的焦褐碎屑刮起，增加风味。"}]}],"synonyms":["adds liquid to the pan","loosens the browned bits","scrapes up the fond","makes a pan sauce"],"phonetic":"/diˈɡleɪzɪz/","extraExplanation":["“Deglaze”常用于食谱说明，是法语烹饪术语进入英语后的常用词。核心动作是：锅很热→倒入少量液体→液体沸腾把“fond（锅底焦香物）”溶解→用铲子刮起→液体收浓成酱。","拼写是deglaze（动词原形）；“deglazes”是第三人称单数现在时：He/She/It deglazes…","学习提示：在日常英文里也可以说“add wine/stock to the pan and scrape up the browned bits”，意思更直白。"]}
{"word":"deglazing","summary":{"en":"Deglazing is adding liquid to a hot pan to dissolve browned bits and make a flavorful sauce; it can also mean doing this technique.","zh":"Deglazing 指在热锅中加入液体溶解并刮起锅底焦香残渣以做酱汁/汤底；也可作动词指进行这一操作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The cooking technique of adding liquid to a hot pan after searing or sautéing to loosen and dissolve the browned bits (fond), then using that flavorful liquid as a sauce or base.","zh":"（烹饪）在煎/炒后趁锅热加入液体，溶解并刮起锅底焦香的褐色残渣（fond），再把这份浓缩风味做成酱汁或汤底的技巧。"},"examples":[{"en":"After searing the steak, deglaze the pan with red wine to make a quick sauce.","zh":"牛排煎好后，用红酒给锅子“除釉/解锅底”，就能做出快速酱汁。"},{"en":"She deglazed with chicken stock and scraped up all the browned bits.","zh":"她倒入鸡汤来除釉，并把锅底的焦香残渣都刮起来。"},{"en":"Deglazing adds a deep, savory flavor without much extra effort.","zh":"除釉几乎不费力，却能让味道更深、更鲜。"}]},{"partOfSpeech":"v.","definition":{"en":"To perform this technique: to add liquid to a hot pan and scrape up the browned bits to create a flavorful liquid.","zh":"（动词）进行“除釉/解锅底”：在热锅中加入液体并刮起褐色焦香残渣，使其融入液体形成浓郁风味。"},"examples":[{"en":"Deglaze the pan with a splash of vinegar if you want a tangier sauce.","zh":"如果想要更酸香的酱汁，可以用少量醋来解锅底。"},{"en":"He deglazed, reduced the liquid, and poured it over the chicken.","zh":"他解锅底后把液体收浓，淋在鸡肉上。"}]}],"synonyms":["pan deglazing","making a pan sauce","loosening the fond"],"phonetic":"/diˈɡleɪzɪŋ/","extraExplanation":["“Deglaze”字面意思是“去掉釉层/去釉”，在厨房语境里指把锅底像“上釉”一样黏住的焦化物用液体“溶开”。常用液体有葡萄酒、汤、醋、柠檬汁或清水。","常见搭配动词：deglaze the pan with wine/stock；scrape up the browned bits；reduce (the sauce) 收汁。","中文里常译作“除釉”“解锅底”“刮锅底”。家庭烹饪里“解锅底”更口语、也更贴近操作步骤。"]}
{"word":"degli","summary":{"en":"“degli” is an Italian word meaning “of the” or “some” before masculine plural nouns (di + gli).","zh":"“degli”是意大利语，常表示“……的这些/那些（of the）”或“（一些）（some）”，用于阳性复数名词前（di + gli）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Italian) A plural masculine form meaning “of the” or “some,” used before masculine plural nouns; it’s the combination of di (“of”) + gli (“the,” masculine plural).","zh":"（意大利语）阳性复数形式，表示“……的这些/那些（of the）”或“（一些）（some）”，用于阳性复数名词前；由 di（“的/从/关于”）+ gli（阳性复数定冠词“这些/那些”）组合而成。"},"examples":[{"en":"Italian: Il sapore degli agrumi è fresco. / English: The flavor of the citrus fruits is fresh.","zh":"意大利语：Il sapore degli agrumi è fresco. / 中文：柑橘类水果的味道很清新。"},{"en":"Italian: Parliamo degli studenti. / English: Let’s talk about the students.","zh":"意大利语：Parliamo degli studenti. / 中文：我们来谈谈这些学生。"},{"en":"Italian: Vorrei degli amici qui con me. / English: I’d like some friends here with me.","zh":"意大利语：Vorrei degli amici qui con me. / 中文：我希望这里有一些朋友陪着我。"}]}],"synonyms":["dei","delle"],"phonetic":"/ˈdeʎʎi/","extraExplanation":["“degli”常见两种用法：\n1）表示所属/关于：di + gli = “of the”，如 “la casa degli amici”（朋友们的房子）。\n2）作不定含义的部分冠词：相当于英语的 “some”，如 “degli amici”（一些朋友）。","选择“degli / dei / delle”通常取决于后面名词的性数以及发音：\n- degli：阳性复数，常用于以元音或某些特殊辅音开头的词（学习者常见），也可在特定结构中出现。\n- dei：阳性复数（更常见的一般情况）。\n- delle：阴性复数。"]}
{"word":"deglory","summary":{"en":"“Deglory” means to take away glory or honor, often by disgracing someone or undermining a heroic image.","zh":"“Deglory”指剥夺荣耀/光彩，常用于使人蒙羞或削弱英雄化形象的语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to take away someone’s or something’s glory, honor, or good reputation; to disgrace","zh":"使失去荣耀/光彩；使蒙羞、使名誉受损"},"examples":[{"en":"The scandal degloried the once-respected leader in the public eye.","zh":"这桩丑闻让那位曾受人尊敬的领袖在公众眼中失去了光彩。"},{"en":"He felt the critics were trying to deglory his achievements.","zh":"他觉得评论家在试图贬损他的成就、让他失去荣耀。"}]},{"partOfSpeech":"vt.","definition":{"en":"to strip something of its sense of grandeur or heroism; to present it as less noble","zh":"去英雄化；削弱宏大或崇高感，使之显得不那么高尚"},"examples":[{"en":"Some modern novels deglory war by focusing on ordinary suffering.","zh":"一些现代小说通过描写普通人的苦难来去英雄化战争。"},{"en":"The film degloried the myth of effortless success.","zh":"这部电影削弱了“轻松成功”的神话光环。"}]}],"synonyms":["disgrace","dishonor","tarnish","demean","belittle","strip of glory"],"phonetic":"/diˈɡlɔɹi/","extraExplanation":["“deglory”比较少见，常出现在较正式或文学性的语境中；更常见的表达有“disgrace / tarnish / strip (someone) of glory”。","词形上由前缀“de-”（表示“去掉、移除”）+ “glory”（荣耀、光彩）构成，因此意思直观：把“荣耀”拿走。"]}
{"word":"degloss","summary":{"en":"“Degloss” means to remove shine from a surface, often before repainting or refinishing; it can also mean reducing a glossy look in makeup.","zh":"“Degloss”指去除表面光泽（常用于重新上漆/翻新前），也可指在化妆中降低油亮光感。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove gloss or shine from a surface; to make it look duller (often as a preparation step before painting, refinishing, or applying another coating)","zh":"去除表面光泽；使表面变哑光（常用于上漆、翻新或再涂层前的准备步骤）"},"examples":[{"en":"Before repainting the cabinets, we deglossed the old varnish so the new paint would stick.","zh":"在重新给橱柜刷漆前，我们先把旧清漆的光泽去掉，这样新漆才更容易附着。"},{"en":"Use a deglosser to degloss the glossy trim instead of sanding.","zh":"用去光剂把有光泽的线条去光，比打磨更省事。"}]},{"partOfSpeech":"vt.","definition":{"en":"(cosmetics) to reduce the shiny finish on lips or skin, for example by blotting or applying a matte product","zh":"（化妆）降低嘴唇或皮肤的油亮光感，例如用纸巾按压或叠加哑光产品"},"examples":[{"en":"She deglossed her lipstick with a tissue to get a softer, matte look.","zh":"她用纸巾按压口红，把光泽压掉，变成更柔和的哑光效果。"}]}],"synonyms":["dull","de-shine","matte","scuff","abrade"],"phonetic":"/diːˈɡlɑs/","extraExplanation":["在家装语境里，degloss 常和 deglosser（去光剂/去光水）一起出现。它的目的通常不是“完全去掉旧漆”，而是让表面稍微变粗糙、降低光滑度，从而提高新涂层的附着力。"]}
{"word":"deglossed","summary":{"en":"“Deglossed” means gloss removed—made matte; it’s also the past form of “degloss.”","zh":"“Deglossed”表示已去除光泽、变成哑光；也可作“degloss”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a surface or image) having had its gloss (shine) removed; made matte or less shiny.","zh":"（表面或图像）去除了光泽的；变成哑光/不那么反光的。"},"examples":[{"en":"The designer used a deglossed photo to reduce glare on the website.","zh":"设计师用了去光泽的照片，来减少网站上的反光。"},{"en":"After sanding, the table looked deglossed and ready for paint.","zh":"打磨之后，桌面看起来已经去光泽了，可以上漆。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of “degloss”: to remove gloss or shine from a surface, coating, or printed material.","zh":"“degloss”的过去式/过去分词：去除表面、涂层或印刷品的光泽（使其变哑光）。"},"examples":[{"en":"We deglossed the glossy brochure cover so it would scan better.","zh":"我们把光面的宣传册封面去光泽处理，这样扫描效果更好。"},{"en":"The technician deglossed the panel before applying the new finish.","zh":"技师在涂新涂层前，先把面板做了去光泽处理。"}]}],"synonyms":["mattified","dulled","de-shined","matte","non-glossy"],"phonetic":"/diːˈɡlɑst/","extraExplanation":["“degloss”在出版/印刷、摄影与表面处理（如木工、喷漆）里更常见：目的通常是减少反光、让后续涂层更容易附着，或让画面看起来更柔和。日常口语里不算高频，更多见于说明书、工艺步骤或设计/印刷语境。"]}
{"word":"deglosses","summary":{"en":"“Deglosses” means (1) removes shine from a surface, often before painting; or (2) (less common) expands/clarifies glosses in linguistic or editorial notes.","zh":"“deglosses”可指（1）给表面去光泽/消光（常用于上漆前）；也可指（2）（较少见）把语言学或编辑中的注释/缩写补充解释清楚。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"removes a shiny surface (gloss) from something; makes it less glossy or reflective.","zh":"去除（表面）光泽；使变得不那么光亮、反光。"},"examples":[{"en":"The manufacturer deglosses the panels so paint will stick better.","zh":"厂家会先给面板去光泽，这样油漆更容易附着。"},{"en":"She lightly sanded the door to deglosses it before repainting.","zh":"她在重新上漆前轻轻打磨门板，让它去光泽。"}]},{"partOfSpeech":"v.","definition":{"en":"in linguistics/editing: adds brief explanations for glossed words or abbreviations (i.e., provides a clearer meaning instead of shorthand glosses).","zh":"（语言学/编辑）为“词汇注释/缩写注释（gloss）”补充解释，使注释更清晰易懂。"},"examples":[{"en":"In the revised draft, the editor deglosses technical abbreviations for general readers.","zh":"在修订稿中，编辑把技术缩写补充解释，方便普通读者理解。"},{"en":"The teacher deglosses the interlinear notes so students can follow the grammar.","zh":"老师把行间注释补充说明，让学生能跟上语法分析。"}]}],"synonyms":["dulls","abrades","sands","scuffs","matte down","de-shines"],"phonetic":"/diˈɡlɑsɪz/","extraExplanation":["“Deglosses”是动词“degloss”的第三人称单数形式（he/she/it deglosses）。常见于喷漆、家具翻新、汽车修补等语境，意思是先“去光泽/打磨消光”，让底材更利于上漆或粘合。","第二个义项较偏专业：gloss在语言学里是“注释/对译/语法标注”。“degloss”在某些编辑或教学语境里可用来指把简略的标注进一步解释清楚，不过比第一个义项少见；写作中可用更常见的表达如 “explain the glosses” 或 “spell out the abbreviations”。"]}
{"word":"deglossing","summary":{"en":"Deglossing means removing or reducing shine from a surface, especially before painting; rarely, it can mean removing gloss notes from a text.","zh":"Deglossing 指对表面进行去光/消光处理（尤其用于上漆前）；少见情况下也可指去除文本中的逐词注释（gloss）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of removing shine (gloss) from a surface, often to help paint or primer stick better","zh":"去光/消光：把表面的光泽去掉（常用于上漆或上底漆前），以便涂料更容易附着"},"examples":[{"en":"Deglossing the cabinet doors helped the primer bond evenly.","zh":"先把橱柜门去光处理，有助于底漆均匀附着。"},{"en":"Before repainting, she spent an hour deglossing the old lacquer finish.","zh":"重新上漆前，她花了一小时把旧的亮漆表面去光。"},{"en":"Deglossing is often done with sandpaper or a liquid deglosser.","zh":"去光通常用砂纸或液体去光剂来完成。"}]},{"partOfSpeech":"n.","definition":{"en":"removing or reducing the glossy look of something (in a general sense)","zh":"（泛指）让某物不再发亮/降低光泽"},"examples":[{"en":"The photographer tried deglossing the highlights to make the portrait look more natural.","zh":"摄影师尝试把高光“去光”，让肖像看起来更自然。"},{"en":"A matte spray can be used for deglossing a shiny model surface.","zh":"可以用哑光喷雾给发亮的模型表面做去光处理。"}]},{"partOfSpeech":"n.","definition":{"en":"in linguistics/editing (rare): removing glosses (word-by-word translation notes) from a text","zh":"（语言学/编辑中较少见）去除文本中的“语法注释/逐词对照释义（gloss）”"},"examples":[{"en":"For the final version, the editor requested deglossing so general readers wouldn’t be distracted by the notes.","zh":"为了正式版本，编辑要求去除逐词注释，以免普通读者被注释分散注意力。"}]}],"synonyms":["dulling","scuffing","sanding (lightly)","matting","abrading"],"phonetic":"/diːˈɡlɔːsɪŋ/","extraExplanation":["“Deglossing”来自动词“degloss”（de- 表示“去除” + gloss 表示“光泽/上光”）。在家装语境里，它通常指上漆前的关键准备步骤：不是把旧漆完全刮掉，而是把表面打毛、去掉亮度，让新涂层更牢。","常见相关词：deglosser（去光剂/去光液）、matte（哑光）、satin（缎光）、glossy（有光泽的）。","在使用说明或工艺步骤里，常见搭配：degloss the surface / deglossing step / liquid deglosser。"]}
{"word":"degloving","summary":{"en":"Degloving is a serious medical injury where skin is torn off from underlying tissue, often on a hand or limb.","zh":"Degloving 指一种严重的医学损伤：皮肤从下方组织被撕脱，常发生在手或四肢。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medicine) A severe injury in which skin and sometimes deeper tissue are forcibly torn away from the underlying flesh, often on a finger, hand, or limb (as if removing a glove).","zh":"（医学）“脱套伤”：皮肤（有时连同更深层组织）被强力从下方组织上撕脱的严重损伤，常见于手指、手或四肢，像把手套剥下来一样。"},"examples":[{"en":"The doctor said the worker had a degloving injury to his finger and needed emergency surgery.","zh":"医生说这名工人的手指发生了脱套伤，需要紧急手术。"},{"en":"To prevent degloving, the safety guide recommends avoiding loose gloves near moving machinery.","zh":"为预防脱套伤，安全指南建议在运转机械附近避免戴松垮的手套。"}]}],"synonyms":["skin avulsion","avulsion injury"],"phonetic":"/diːˈɡlʌvɪŋ/","extraExplanation":["“Degloving”多用于医学与工伤安全语境，属于较严重、带有血腥联想的术语；在日常聊天中不常用，更多出现在医疗报告、急救教育或安全培训材料里。","词源上来自“de-（去除）+ glove（手套）”，形象地描述皮肤被“像手套一样”剥离；常见搭配有 degloving injury（脱套伤）、partial/complete degloving（部分/完全脱套）。"]}
{"word":"deglow","summary":{"en":"“Deglow” is an uncommon verb meaning to stop glowing or to reduce/remove a glow effect (often in visual/lighting contexts).","zh":"“deglow”是个不常见的动词，指不再发光/变暗，或（常见于视觉与灯光语境）降低、去除发光效果。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Uncommon) To lose brightness or stop glowing; to become less luminous.","zh":"（不常见）失去光亮；不再发光；变得不那么明亮。"},"examples":[{"en":"The embers slowly deglowed as the fire ran out of fuel.","zh":"随着柴火烧尽，余烬慢慢地暗了下去。"},{"en":"At dawn, the neon signs deglow and the street looks ordinary again.","zh":"天亮时，霓虹灯逐渐熄暗，街道又恢复了普通的样子。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Uncommon/technical) To reduce or remove a glowing effect (for example, in lighting, photography, or computer graphics).","zh":"（不常见/技术用语）减弱或去除“发光效果”（如灯光、摄影或电脑图像中的光晕/辉光）。"},"examples":[{"en":"Can you deglow the logo? The halo looks too strong on a dark background.","zh":"你能把标志的发光效果弱化吗？在深色背景上光晕太强了。"},{"en":"The editor deglowed the highlights to make the scene feel more realistic.","zh":"剪辑师降低了高光的发光效果，让画面更真实。"}]}],"synonyms":["dim","fade","darken","lose its glow","reduce the glow","remove the glow"],"phonetic":"/diˈɡloʊ/","extraExplanation":["“de-”常表示“去除、降低、反向”（如 devalue 贬值、deactivate 停用），加在 glow（发光）前面就形成“去除/降低发光”的意思。","deglow 不是常用词，更常见的表达是 dim（变暗/调暗）、fade（逐渐变弱）、lose its glow（失去光泽/光亮），或在图像处理里说 reduce/remove the glow effect（降低/去除发光效果）。"]}
{"word":"deglue","summary":{"en":"“Deglue” means to remove glue or to separate things that were glued together.","zh":"“Deglue”指去除胶水，或把被胶粘在一起的东西分开。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove glue from something; to separate things that were stuck together with glue","zh":"把胶水去掉；把用胶粘住的东西拆开/分开"},"examples":[{"en":"Use warm water to deglue the label from the jar.","zh":"用温水把罐子上的标签脱胶取下。"},{"en":"I had to deglue the papers because they were stuck together.","zh":"这些纸粘在一起了，我得把它们脱胶分开。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become unstuck or come apart as the glue loosens (less common)","zh":"（不常用）因胶水变松而自己脱开/散开"},"examples":[{"en":"If the room is too humid, the seams may start to deglue.","zh":"如果房间太潮，接缝可能会开始脱胶。"}]}],"synonyms":["remove the glue","unstick","separate","peel off","unglue"],"phonetic":"/diˈɡlu/","extraExplanation":["“de-”是常见前缀，常表示“去除、解除、反向”（如：defrost 解冻、deactivate 停用）。因此 deglue 字面意思就是“去掉胶”。","deglue 在日常英语里不算常见；更常见的表达有 remove the glue、unstick、separate、peel off（撕下/剥下），以及 unglue（把……从胶上弄开）。"]}
{"word":"deglut","summary":{"en":"“Deglut” means “to swallow,” but it’s rare and mostly seen in medical or formal writing.","zh":"“deglut”意思是“吞咽”，但很少用，多见于医学或较正式的书面语。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to swallow (food or liquid); to take something down the throat","zh":"吞咽（食物或液体）；咽下"},"examples":[{"en":"After taking the pill, she deglutted it with a sip of water.","zh":"吃完药后，她喝了一口水把药吞了下去。"},{"en":"Some patients find it hard to deglut without pain after surgery.","zh":"有些病人手术后吞咽时会感到疼痛。"}]}],"synonyms":["swallow","gulp (informal)","ingest (more general/formal)"],"phonetic":"/diˈɡlʌt/","extraExplanation":["“deglut”是非常少见、偏书面/医学语境的动词，更常见的说法是“swallow”。更常见的名词形式是“deglutition”（吞咽动作）。词根来自拉丁语：de-（向下）+ glutire（吞咽）。"]}
{"word":"deglute","summary":{"en":"“Deglute” is a rare medical verb meaning “to swallow.” In everyday English, people usually say “swallow.”","zh":"“deglute”是一个很少见的医学动词，意思是“吞咽”。日常英语通常用“swallow”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(rare, medical) To swallow; to take food or liquid down the throat.","zh":"（罕见，医学用语）吞咽；把食物或液体咽下去。"},"examples":[{"en":"After surgery, some patients find it difficult to deglute safely.","zh":"手术后，一些病人会发现很难安全地吞咽。"},{"en":"The therapist taught her techniques to deglute without choking.","zh":"治疗师教她一些技巧，帮助她在不呛到的情况下吞咽。"}]}],"synonyms":["swallow","gulp (informal)","ingest (more general/formal)"],"phonetic":"/diˈɡlut/","extraExplanation":["“deglute”在现代英语里非常少见，多数情况下医学或语言治疗（吞咽训练）会用更常见的词：swallow（吞咽），或名词 deglutition（吞咽动作/吞咽过程）。","词源上与拉丁语 gluttire（吞咽）有关；因此你也可能在更正式或学术语境里看到 deglutition，而不是 deglute。","如果你是在论文、病例或教材中遇到“deglute”，建议核对原文是否其实是 deglutition 或 deglutinate（不同词，意思也不同）。"]}
{"word":"deglutened","summary":{"en":"Deglutened means gluten has been removed from a food product.","zh":"deglutened 指食物已去除麩質（gluten）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of food) having gluten removed; made so it contains little or no gluten, often for people with gluten intolerance or celiac disease.","zh":"（指食物）去除麩質的；加工成幾乎不含麩質的，常為了麩質不耐或乳糜瀉（celiac disease）者。"},"examples":[{"en":"The bakery sells deglutened bread for customers who can’t eat gluten.","zh":"這家麵包店賣去麩質麵包，給不能吃麩質的顧客。"},{"en":"Some beers are made from deglutened barley to reduce gluten content.","zh":"有些啤酒會用去麩質的大麥製作，以降低麩質含量。"}]}],"synonyms":["gluten-free","low-gluten","reduced-gluten"],"phonetic":"/diˈɡluːtənd/","extraExplanation":["「de-」有「去除、解除」的意思，所以 deglutened 字面上就是「把 gluten（麩質）去掉」。","日常更常看到的標示是「gluten-free（無麩質）」或「reduced gluten（減少麩質）」。需注意：不同國家/品牌對「無麩質」的標準（例如允許的微量含量）可能不同，嚴重過敏或乳糜瀉者通常要看清楚標示與認證。"]}
{"word":"deglutenized","summary":{"en":"Deglutenized describes food that has had gluten removed or reduced by processing.","zh":"deglutenized 指食物经过加工去除或降低了麸质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of food) having gluten removed or reduced through processing.","zh":"（指食物）经过加工把麸质去除或降低的。"},"examples":[{"en":"The beer is deglutenized to make it easier for some people with gluten sensitivity to drink.","zh":"这种啤酒做了去麸质处理，让一些对麸质敏感的人更容易饮用。"},{"en":"This deglutenized wheat product may still contain trace amounts of gluten.","zh":"这种去麸质的小麦制品可能仍含有微量麸质。"}]}],"synonyms":["gluten-removed","gluten-reduced","low-gluten"],"phonetic":"/diˈɡluːtnˌaɪzd/","extraExplanation":["“deglutenized”常见于食品标签或营销语境，尤其是啤酒、麦芽饮品等。它通常表示“通过酶或过滤等工艺降低麸质”，但不一定等同于“gluten-free（无麸质）”。对乳糜泻（celiac disease）或严格无麸质需求的人来说，仍需查看是否符合相关标准（例如标示的ppm含量）和权威认证。","构词法：de-（去除）+ gluten（麸质）+ -ize（使……化）+ -ed（形容词/过去分词形式），字面意思就是“去麸质化的”。"]}
{"word":"deglutinate","summary":{"en":"Deglutinate means to break up clumps—especially clumped blood cells—so they separate and disperse again.","zh":"deglutinate 指“解凝集”，把已黏成团的东西（尤指血细胞）重新分散开。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to separate things that have clumped together (especially cells, such as red blood cells) so they become evenly dispersed again","zh":"使（已凝集的东西，尤指细胞如红细胞）解凝集、分散开来"},"examples":[{"en":"The technician added a reagent to deglutinate the red blood cells before counting them.","zh":"技术员在计数前加入试剂，使红细胞解凝集。"},{"en":"Warming the sample helped deglutinate the clumped cells.","zh":"给样本加温有助于让凝集的细胞分散开。"}]}],"synonyms":["disperse","separate","declump","deagglutinate"],"phonetic":"/diˈɡluːtənˌeɪt/","extraExplanation":["这是一个较专业的医学/生物学词，常见于血液学、免疫学与检验报告中，强调“把已经凝集（agglutinate）的细胞重新分开”。","词形结构：de-（去除、反向）+ glutin-（黏、胶；同源于 glue“胶水”）+ -ate（动词后缀），字面意思接近“去除黏连”。"]}
{"word":"deglutinated","summary":{"en":"Deglutinated means gluten has been removed (gluten-free by processing).","zh":"deglutinated 指“去除了麸质的”，强调经过脱麸处理而成。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having gluten removed; made gluten-free by removing gluten","zh":"去除了麸质的；经脱麸处理而成的（无麸质的）"},"examples":[{"en":"The company sells deglutinated wheat flour for people who avoid gluten.","zh":"这家公司出售去麸质的小麦粉，供需要避免麸质的人使用。"},{"en":"Deglutinated products are sometimes marketed to consumers with gluten sensitivities.","zh":"去麸质产品有时会面向对麸质敏感的消费者进行营销。"}]},{"partOfSpeech":"vt.","definition":{"en":"(past participle) removed gluten from (a food)","zh":"（过去分词）从（食物）中去除麸质；使脱麸"},"examples":[{"en":"They deglutinated the flour before using it in the recipe.","zh":"他们在做这道食谱前先把面粉进行了脱麸处理。"}]}],"synonyms":["gluten-free","deglutenized","deglutened"],"phonetic":"/diˈɡluːtəˌneɪtɪd/","extraExplanation":["“deglutinated”较少见，更多出现在食品加工或营养相关语境中，意思接近“gluten-free（无麸质的）”，但强调“通过处理把麸质去掉”。","注意与“deg(l)utition（吞咽）”无关：deglutinated 里的 gluten 指“麸质”，常与乳糜泻（celiac disease）或麸质敏感相关。"]}
{"word":"deglutinating","summary":{"en":"“Deglutinating” means breaking up or preventing clumps, especially in medical/biological contexts (e.g., cells).","zh":"“deglutinating”指使结团的东西分散开或防止结团，常用于医学/生物学语境（如细胞）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle) separating or breaking apart things that have stuck together into a clump, especially cells in biology/medicine.","zh":"（现在分词）把黏在一起的东西分开、使其不再成团；尤指生物/医学中使细胞（如红细胞）不再凝集。"},"examples":[{"en":"The lab is deglutinating the red blood cells before counting them.","zh":"实验室在计数前先让红细胞去凝集（分散开）。"},{"en":"A reagent is deglutinating the particles so the solution looks clearer.","zh":"一种试剂正在使颗粒去凝集，因此溶液看起来更清澈。"}]},{"partOfSpeech":"adj.","definition":{"en":"having the effect of preventing or reversing clumping (anti-agglutinating).","zh":"具有防止或逆转“凝集/结团”作用的；去凝集的。"},"examples":[{"en":"They tested a deglutinating agent to improve the sample quality.","zh":"他们测试了一种去凝集剂来提高样本质量。"},{"en":"Deglutinating chemicals can help keep cells evenly mixed.","zh":"去凝集的化学物质有助于让细胞均匀混合。"}]}],"synonyms":["anti-agglutinating","dispersing","declumping","deflocculating"],"phonetic":"/diˈɡluːtəˌneɪtɪŋ/","extraExplanation":["“deglutinating”来自动词 deglutinate（使去凝集），常见于检验医学、免疫学、血液学等语境。它与 agglutinating（使凝集）相对：agglutination 指颗粒或细胞因抗体、蛋白或化学因素而“结团”，deglutinating 则是把这些结团打散或阻止其形成。","日常英语中很少用这个词，更多出现在学术论文、实验步骤说明、检验报告或试剂说明书里。"]}
{"word":"deglutination","summary":{"en":"Deglutination means the process of swallowing (a formal medical term).","zh":"deglutination 指“吞咽的过程”，是较正式的医学用语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or process of swallowing (moving food or liquid from the mouth through the throat into the stomach).","zh":"吞咽；吞嚥（把食物或液体从口腔经咽喉送入胃的动作或过程）。"},"examples":[{"en":"Deglutination is coordinated by nerves and muscles in the mouth and throat.","zh":"吞咽是由口腔和咽喉的神经与肌肉协调完成的。"},{"en":"After the surgery, she had pain during deglutination.","zh":"手术后，她吞咽时会疼痛。"}]}],"synonyms":["swallowing"],"phonetic":"/diˌɡluːtəˈneɪʃən/","extraExplanation":["这是一个医学/生理学用词，比日常的 swallow 更正式。常见相关词：dysphagia（吞咽困难），odynophagia（吞咽痛）。","词源来自拉丁语 deglutire（吞下），与 glutton（暴食者）同源，核心含义都与“吞咽/吞下”有关。"]}
{"word":"deglutition","summary":{"en":"Deglutition is the medical term for swallowing.","zh":"Deglutition 是“吞咽”的医学术语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of swallowing food or liquid","zh":"吞咽；吞咽过程（把食物或液体从口腔送入食道的动作/过程）"},"examples":[{"en":"After the surgery, the doctor checked his deglutition to make sure he could swallow safely.","zh":"手术后，医生检查了他的吞咽功能，确保他能安全吞咽。"},{"en":"Pain during deglutition can be a sign of a throat infection.","zh":"吞咽时疼痛可能是喉咙感染的迹象。"}]}],"synonyms":["swallowing","swallow"],"phonetic":"/ˌdiːɡluːˈtɪʃən/","extraExplanation":["这是一个偏医学/生理学的正式用词，日常英语更常说 swallow / swallowing（吞咽/吞下）。","词源来自拉丁语 deglutire（吞下），在医学语境里常见搭配有 difficulty with deglutition（吞咽困难）、painful deglutition（吞咽痛）。"]}
{"word":"deglutitional","summary":{"en":"“Deglutitional” means “related to swallowing,” mainly used in medical contexts.","zh":"“Deglutitional”意为“与吞咽有关的”，主要用于医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to deglutition (the act of swallowing), especially in medical or anatomical contexts.","zh":"与吞咽（deglutition）有关的；尤用于医学或解剖学语境。"},"examples":[{"en":"The doctor evaluated the patient’s deglutitional function after surgery.","zh":"医生在手术后评估了患者的吞咽功能。"},{"en":"Deglutitional reflexes help move food safely from the mouth to the throat.","zh":"吞咽反射帮助食物安全地从口腔移动到咽喉。"}]}],"synonyms":["swallowing (related to)","deglutitory (less common)"],"phonetic":"/diˌɡluːˈtɪʃənəl/","extraExplanation":["这是一个较少见、偏医学的形容词，来自名词 deglutition（吞咽）。在日常英语里更常说 swallowing（吞咽）或 swallowing function（吞咽功能）。","常见搭配包括：deglutitional reflex（吞咽反射）、deglutitional phase（吞咽期/吞咽阶段）、deglutitional dysfunction（吞咽障碍/吞咽功能异常）。"]}
{"word":"deglutitious","summary":{"en":"“Deglutitious” is a rare adjective meaning “related to swallowing.”","zh":"“deglutitious”是一个很少见的形容词，意思是“与吞咽有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to swallowing (deglutition).","zh":"与吞咽（吞咽作用）有关的。"},"examples":[{"en":"The doctor checked the patient’s deglutitious reflexes to see if swallowing was safe.","zh":"医生检查了病人的吞咽相关反射，以确认吞咽是否安全。"},{"en":"After the surgery, she needed therapy to improve deglutitious function.","zh":"手术后，她需要治疗来改善吞咽相关功能。"}]}],"synonyms":["deglutitory","swallowing-related","oropharyngeal (context-dependent)"],"phonetic":"/diˌɡluˈtɪʃəs/","extraExplanation":["“deglutitious”在现代英语中非常少见，医学写作里更常用的词是“deglutition”（名词：吞咽）以及形容词“deglutitory”。如果你是在论文或报告里使用，通常建议改用更常见、更标准的“deglutition/deglutitory”。","词根来自拉丁语：de-（向下）+ glutire（吞咽）。因此它的核心含义与“把东西咽下去”相关。"]}
{"word":"deglutitive","summary":{"en":"A medical adjective meaning “related to swallowing.”","zh":"一个医学形容词，意思是“与吞咽有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to swallowing (deglutition), especially in a medical or anatomical context","zh":"与吞咽有关的（吞咽作用的），多用于医学或解剖学语境"},"examples":[{"en":"The doctor assessed the patient’s deglutitive function after the stroke.","zh":"医生在中风后评估了病人的吞咽功能。"},{"en":"Deglutitive difficulties can increase the risk of food entering the airway.","zh":"吞咽方面的困难会增加食物进入气道的风险。"},{"en":"Therapy focused on strengthening muscles involved in deglutitive movements.","zh":"治疗重点是强化参与吞咽动作的肌肉。"}]}],"synonyms":["swallowing (related)","deglutitional"],"phonetic":"/diˈɡluːtɪv/","extraExplanation":["“deglutitive”是较少见、偏专业的医学用词；日常英语更常说“swallowing”（吞咽的）或“related to swallowing”（与吞咽有关的）。","词源上来自拉丁语前缀de-与glutire（吞咽）相关的词根；名词是“deglutition”（吞咽作用）。"]}
{"word":"deglutitory","summary":{"en":"“Deglutitory” is a medical adjective meaning “related to swallowing.”","zh":"“deglutitory”是医学形容词，意思是“与吞咽有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to swallowing.","zh":"与吞咽有关的；吞咽的。"},"examples":[{"en":"After the stroke, the doctor evaluated his deglutitory function.","zh":"中风后，医生评估了他的吞咽功能。"},{"en":"The therapist taught exercises to improve deglutitory muscles.","zh":"治疗师教了一些练习来改善吞咽肌肉的功能。"}]}],"synonyms":["swallowing (related to)","deglutitional"],"phonetic":"/diˈɡluːtətɔːri/","extraExplanation":["这是一个比较“医学/解剖学”用语，日常英语里更常说 swallowing（吞咽）或 swallow（吞下）。","词根提示：来自拉丁语 deglutire（吞下），与 gluttire（吞咽）有关；因此常见搭配有 deglutition（吞咽这一过程）、deglutitory reflex（吞咽反射）。"]}
{"word":"deglycerin","summary":{"en":"Deglycerin means “remove glycerin from something,” or a material that has had glycerin removed (rare, technical use).","zh":"deglycerin 指“去除甘油（丙三醇）”，也可指“已去除甘油的材料/制品”（较少见，偏专业用法）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to remove glycerin (glycerol) from a substance or product","zh":"从某种物质或产品中去除甘油（丙三醇）"},"examples":[{"en":"The manufacturer deglycerins the extract to improve stability.","zh":"厂家会对提取物进行脱甘油处理以提高稳定性。"},{"en":"Some labs deglycerin samples before further chemical analysis.","zh":"一些实验室会在进一步化学分析前对样品脱甘油。"}]},{"partOfSpeech":"n.","definition":{"en":"a product or material from which glycerin has been removed","zh":"已去除甘油的产品或材料（脱甘油制品）"},"examples":[{"en":"This deglycerin solution is used as a reference standard.","zh":"这种脱甘油溶液用作参考标准。"}]}],"synonyms":["remove glycerin","deglycerinate","de-glycerinate"],"phonetic":"/diːˈɡlɪsərɪn/","extraExplanation":["“deglycerin”不是日常英语中常见的词，更常见的表达是“deglycerinate / deglycerinated”（脱甘油的）或“remove glycerin”。在药品、食品、化工或实验室语境中才可能见到。","甘油（glycerin/glycerol）常用作保湿剂、溶剂或稳定剂；“脱甘油”可能是为了改变黏度、口感/触感，或避免甘油对后续测定造成干扰。"]}
{"word":"deglycerinate","summary":{"en":"“Deglycerinate” means to remove glycerin (glycerol) from something, usually in technical or industrial contexts.","zh":"“deglycerinate”指从某物中去除甘油（丙三醇），多用于技术或工业语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove glycerin (glycerol) from a substance, mixture, or product","zh":"从某种物质、混合物或产品中去除甘油（丙三醇）"},"examples":[{"en":"The manufacturer deglycerinates the extract to improve stability and shelf life.","zh":"厂家会对提取物进行脱甘油处理，以提高稳定性和保质期。"},{"en":"After fermentation, the solution may be deglycerinated before further purification.","zh":"发酵后，溶液可能会先脱甘油，然后再进行进一步纯化。"}]}],"synonyms":["remove glycerin","remove glycerol","de-glycerolize"],"phonetic":"/diːˈɡlɪsəɹəˌneɪt/","extraExplanation":["“de-”是英语里常见的前缀，表示“去除、除去”，如 dehydrate（脱水）、deodorize（除臭）。因此 deglycerinate 直观上就是“把 glycerin（甘油）去掉”。","该词多见于化工、食品/香精提取、制药或实验室语境，日常英语中很少使用；更常见的表达也可能是 remove glycerin / remove glycerol（去除甘油/甘油醇）。"]}
{"word":"deglycerinated","summary":{"en":"“Deglycerinated” means glycerin has been removed from a substance.","zh":"“deglycerinated”表示某种物质已被去除甘油（脱甘油处理）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having glycerin (glycerol) removed; made less rich in glycerin","zh":"已去除甘油（丙三醇）的；脱甘油的"},"examples":[{"en":"The manufacturer uses deglycerinated gelatin to reduce moisture in the capsules.","zh":"厂家使用脱甘油明胶来降低胶囊中的含水量。"},{"en":"Deglycerinated soap can feel less slippery than regular soap.","zh":"脱甘油肥皂摸起来可能没有普通肥皂那么滑。"}]},{"partOfSpeech":"vt.","definition":{"en":"to remove glycerin from (a substance)","zh":"（从某物中）去除甘油；使脱甘油"},"examples":[{"en":"The lab deglycerinated the sample before running the analysis.","zh":"实验室在进行分析前先将样品脱甘油处理。"},{"en":"Some processes deglycerinate gelatin to change its texture and stability.","zh":"有些工艺会对明胶进行脱甘油处理，以改变其质地和稳定性。"}]}],"synonyms":["de-glycerinated","glycerin-free (sometimes, not always exact)","defatted (not the same, but sometimes used similarly in processing contexts)"],"phonetic":"/diːˈɡlɪsəˌreɪtɪd/","extraExplanation":["“deglycerinated”常见于食品、制药与化工语境（如明胶、胶囊、肥皂、提取物等）。它是由前缀de-（去除）+ glycerin（甘油）+ -ated（表示“被处理过的”）构成，通常是技术性/说明书用语。"]}
{"word":"deglycerine","summary":{"en":"“Deglycerine” means removing glycerin from something, or describing something that is glycerin-free (a technical/industrial term).","zh":"“deglycerine”指“去除甘油”，也可形容“已去甘油/不含甘油”的（多用于技术或工业语境）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove glycerin (glycerol) from a substance","zh":"从某种物质中去除甘油（丙三醇）"},"examples":[{"en":"The manufacturer deglycerined the soap to change its texture and performance.","zh":"厂家对肥皂进行去甘油处理，以改变它的质地和使用效果。"},{"en":"This process deglycerines the mixture before further purification.","zh":"该工艺会在进一步提纯前对混合物进行去甘油处理。"}]},{"partOfSpeech":"adj.","definition":{"en":"with glycerin removed; glycerin-free (describing a product or material)","zh":"已去除甘油的；不含甘油的（用于描述产品或材料）"},"examples":[{"en":"They tested a deglycerine formula for better stability in storage.","zh":"他们测试了一种去甘油配方，以提高储存稳定性。"},{"en":"Deglycerine wool may absorb dyes differently from untreated wool.","zh":"去甘油羊毛对染料的吸收方式可能与未处理羊毛不同。"}]},{"partOfSpeech":"n.","definition":{"en":"a deglycerinated material or product (something from which glycerin has been removed)","zh":"去甘油后的材料或产品（指已被除去甘油的东西）"},"examples":[{"en":"The lab compared the deglycerine with the original sample.","zh":"实验室将去甘油样品与原始样品进行了对比。"}]}],"synonyms":["deglycerinate","deglycerinated","remove glycerin","glycerin-free"],"phonetic":"/diˈɡlɪsərɪn/","extraExplanation":["“deglycerine”不是日常英语常用词，更常见的写法是“deglycerinated”（作形容词）或“deglycerinate”（作动词）。在工业/化学语境中，它通常指把甘油从肥皂、油脂、发酵液或某些纤维处理液中分离出去。","词根理解：de- 表示“去除/逆向”，glycerin/glycerine 指“甘油”。美式英语更常拼作 glycerin，英式拼作 glycerine；两者意义相同。"]}
{"word":"deglycosylated","summary":{"en":"Deglycosylated means sugar groups (glycans) have been removed from a molecule, often a protein.","zh":"deglycosylated 指分子（常为蛋白质）上的糖基/糖链已被去除，即“脱糖基化的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having had sugar groups (glycans) removed from a molecule, especially a protein.","zh":"（尤指蛋白质等分子）已去除糖基/糖链（聚糖）的；脱糖基化的。"},"examples":[{"en":"The deglycosylated antibody showed a different binding behavior in the assay.","zh":"脱糖基化后的抗体在实验检测中表现出不同的结合特性。"},{"en":"Researchers compared the activity of the original enzyme with its deglycosylated form.","zh":"研究人员比较了原始酶与其脱糖基化形式的活性差异。"}]}],"synonyms":["de-glycosylated","de-glycated (not the same; related in some contexts)"],"phonetic":"/diˌɡlaɪkəˈsɪleɪtɪd/","extraExplanation":["这是生物化学/分子生物学里常见的术语：glycosylation（糖基化）指在蛋白质或其他分子上“加上”糖链；deglycosylated 则强调这些糖链被酶（如 PNGase F）或化学方法“去掉”。","在科研语境中，去糖基化常用于研究糖链对蛋白质折叠、稳定性、免疫识别或药物作用机制的影响。"]}
{"word":"deglycosylation","summary":{"en":"Deglycosylation is the removal of sugar groups (glycans), especially from proteins.","zh":"Deglycosylation 指去除糖链/糖基，常用于蛋白质等生物分子的分析与研究。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of removing sugar groups (glycans) from a molecule, especially from a protein","zh":"去糖基化：把分子上的糖链（糖基/糖基化修饰）去除的过程，尤其常见于蛋白质"},"examples":[{"en":"Scientists used deglycosylation to study the protein’s core structure.","zh":"科学家用去糖基化来研究蛋白质的核心结构。"},{"en":"After deglycosylation, the antibody showed a different molecular weight on the gel.","zh":"去糖基化后，这个抗体在凝胶上显示出不同的分子量。"}]}],"synonyms":["glycan removal","de-glycosylation"],"phonetic":"/diˌɡlaɪkoʊˌsaɪləˈʃeɪʃən/","extraExplanation":["词源拆解：de- 表示“去除/反向”，glyco- 与“糖（glucose/糖类）”相关，-syl- 与“基团/取代基”有关，-ation 表示“过程/行为”。因此整体意思就是“去掉糖基的过程”。","常见语境：生命科学与生物化学里常用该词，例如用酶（如 PNGase F）去除 N-连接糖链，或用其他方法处理 O-连接糖链，以便分析蛋白质功能、稳定性、免疫原性或做质谱鉴定。","学习提示：deglycosylation 通常是不可数名词（a process），也可在特定实验语境中当作可数（a deglycosylation step/assay）。"]}
{"word":"degold","summary":{"en":"“Degold” is rare; it can mean removing a gold coating, or it may be a surname/proper name.","zh":"“degold”较罕见；可指去除镀金层，也可能是姓氏/专有名词。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare, nonstandard) To remove gold (or a gold coating) from something; to strip off gold plating. Similar to “de-gild/ungild.”","zh":"（罕见、非标准用法）把物体上的金（或镀金层）去除；去掉镀金。类似 de-gild/ungild。"},"examples":[{"en":"The jeweler had to degold the surface before applying a new finish.","zh":"珠宝匠在重新处理表面之前，必须先把镀金层去掉。"},{"en":"Some restorers choose to degold modern additions to match the original look.","zh":"有些修复师会去除后期加上的镀金部分，以更接近原貌。"}]},{"partOfSpeech":"n.","definition":{"en":"A family name (surname) in some contexts.","zh":"在某些语境中作姓氏使用。"},"examples":[{"en":"Ms. Degold will lead the meeting today.","zh":"Degold 女士将主持今天的会议。"}]}],"synonyms":["de-gild","ungild","strip (gold plating)","remove gold plating"],"phonetic":"/diːˈɡoʊld/","extraExplanation":["“degold”不是常见的标准英语词汇，更多时候你会看到 **de-gild**, **ungild**, **strip the gold plating** 这类更地道的表达。","如果你是在某篇文章/游戏/品牌名里看到“Degold”，它也可能是专有名词（人名、店名、用户名等），含义要看具体上下文。"]}
{"word":"degomme","summary":{"en":"“degomme” is a rare term meaning “degummed,” especially describing silk with its natural gum removed; it can also mean “to degum.”","zh":"“degomme”较少见，通常指“脱胶的”（尤指丝绸去除天然丝胶后），也可作动词表示“脱胶”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Textiles, uncommon) Having the natural gum/sericin removed (especially said of silk); degummed.","zh":"（纺织用语，较少见）指（尤指丝绸）已去除天然丝胶/丝胶蛋白的；脱胶的。"},"examples":[{"en":"Degomme silk is softer and takes dye more evenly.","zh":"脱胶丝更柔软，而且染色更均匀。"},{"en":"The scarf is made from degomme silk for a smoother feel.","zh":"这条围巾用的是脱胶丝，触感更顺滑。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Uncommon) To remove gum or sticky natural substances from a material, especially to degum silk.","zh":"（较少见）去除材料中的胶质或黏性天然物质；尤指给丝绸脱胶。"},"examples":[{"en":"The factory degomme(s) the silk before weaving.","zh":"工厂在织造前会先给丝绸脱胶。"},{"en":"Some processes use mild soap to degomme the fibers.","zh":"有些工艺会用温和的肥皂为纤维脱胶。"}]}],"synonyms":["degummed","degum","refine","purify"],"phonetic":"/deɪˈɡoʊm/","extraExplanation":["“degomme”在英语里很少单独使用，更常见的是“degummed（脱胶的）”或动词“degum（脱胶）”。它常被认为来自法语词根（如dégommer相关形式），在纺织/丝绸工艺语境中更可能出现。日常英语交流中建议用“degummed silk / degum the silk”来表达。"]}
{"word":"degorder","summary":{"en":"“degorder” is not a standard English word; it’s probably a misspelling. Share your sentence so we can find the intended word.","zh":"“degorder”不是标准英语单词，可能是拼写错误。把原句发来可帮助确定你真正想用的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a mistaken form of another word (often “disorder” or “deodorant,” depending on context).","zh":"不是标准英语单词。很可能是拼写错误或误写，常见可能对应“disorder（混乱/疾病）”或“deodorant（除臭剂）”，需结合上下文判断。"},"examples":[{"en":"I can’t find “degorder” in a dictionary—did you mean “disorder”?","zh":"我在词典里找不到“degorder”，你是不是想写“disorder”？"},{"en":"Please send the full sentence with “degorder,” so I can help identify the intended word.","zh":"请把包含“degorder”的完整句子发给我，我才能帮你判断你想表达的词。"}]}],"extraExplanation":["“degorder”在常见英文字典、学术语料和口语用法中都不常见，因此更像是拼写/输入错误。最有效的办法是提供原句或你想表达的中文意思（例如“混乱”“失序”“除臭剂”“去…的顺序”等），我就能帮你锁定正确的英文词并给出用法。"]}
{"word":"degorge","summary":{"en":"Degorge means to remove sediment from sparkling wine (especially Champagne) or, more generally, to disgorge something suddenly.","zh":"degorge 指（起泡酒/香槟）除渣；也可泛指突然喷出、排出或涌出（液体、人群等）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove sediment (dead yeast) from a bottle of sparkling wine, especially Champagne, usually by expelling it from the neck of the bottle","zh":"（尤指香槟等起泡酒）除渣：将瓶中沉淀的酵母渣从瓶颈处排出/去除"},"examples":[{"en":"The winemaker will degorge the bottles after riddling to remove the yeast sediment.","zh":"酒庄在转瓶（riddling）之后会进行除渣（degorge），把酵母沉淀去掉。"},{"en":"This Champagne was disgorged (degorged) in 2022, so it tastes especially fresh.","zh":"这款香槟在2022年完成除渣，因此喝起来格外清新。"}]},{"partOfSpeech":"vt.","definition":{"en":"to discharge or pour out suddenly (something held inside), sometimes in a violent or messy way","zh":"突然排出/喷出（体内或容器中的东西）；有时带有猛烈或狼狈的意味"},"examples":[{"en":"The pipe degorged muddy water into the street after the storm.","zh":"暴风雨后，管道把泥水猛地排到街上。"},{"en":"The alleyway degorged a crowd when the concert ended.","zh":"演出结束时，小巷里一下子涌出一大群人。"}]}],"synonyms":["disgorge","expel","eject","spew","pour out"],"phonetic":"/diˈɡɔrdʒ/","extraExplanation":["“degorge”常见于葡萄酒语境，特别是传统法（méthode traditionnelle）起泡酒工艺：先让酒瓶逐渐转动使沉淀聚到瓶颈（riddling/转瓶），再通过冷冻瓶颈并开启瓶塞把沉淀“顶”出去，这一步就叫 dégorgement（法语），英语动词是 degorge（也常见同义词 disgorge）。","在一般写作中，第二个意思更偏文学/描写性，用来形容“某处/某物突然吐出、涌出”人群或液体，语感比普通的 “release/pour out” 更强烈、更形象。"]}
{"word":"degradability","summary":{"en":"Degradability means how easily and completely something can break down into simpler substances over time, often in natural environments.","zh":"Degradability 指某物随时间被分解成更简单物质的能力，常用于描述材料在自然环境中的降解程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the ability of a material or substance to be broken down (degraded) into simpler substances over time, especially by natural processes such as microorganisms, sunlight, heat, or water","zh":"（材料/物质的）可降解性；在一段时间内被分解为更简单物质的能力，尤指通过微生物、阳光、热或水等自然过程"},"examples":[{"en":"The degradability of the packaging was a key factor in choosing the supplier.","zh":"包装的可降解性是选择供应商时的关键因素。"},{"en":"Scientists are testing the degradability of plastics in seawater.","zh":"科学家正在测试塑料在海水中的可降解性。"},{"en":"High degradability usually means less long-term waste in landfills.","zh":"较高的可降解性通常意味着更少的长期填埋垃圾。"}]}],"synonyms":["biodegradability","decomposition","breakdown (ability)"],"phonetic":"/dɪˌɡreɪdəˈbɪləti/","extraExplanation":["“degradability”常见于环保、材料科学和产品说明中，经常与“biodegradability（生物可降解性）”一起出现。注意：可降解并不一定等于“无害”或“能在任何环境中快速降解”，很多材料只在特定条件（如工业堆肥环境）下才会明显分解。","词形来源：degrade（使降解/变差）+ -ability（……的能力）。写作中常搭配：degradability of + 材料/产品；assess/test/measures degradability（评估/测试/衡量可降解性）。"]}
{"word":"degradable","summary":{"en":"Degradable means “able to break down naturally into simpler substances,” often used in environmental contexts.","zh":"Degradable 指“可在自然条件下降解成更简单物质”，常用于环保语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to be broken down into simpler substances naturally (for example by bacteria, sunlight, or chemical processes), so it does not remain in the environment for a long time","zh":"可降解的；能在自然条件下（如细菌、阳光或化学作用）分解成更简单物质，因此不易长期残留在环境中"},"examples":[{"en":"The company is switching to degradable packaging to reduce plastic waste.","zh":"这家公司正在改用可降解包装，以减少塑料垃圾。"},{"en":"Some detergents are advertised as fully degradable in water.","zh":"有些洗涤剂宣传在水中可完全降解。"}]}],"synonyms":["breakdown-able","decomposable","biodegradable (more specific)"],"phonetic":"/dɪˈɡreɪdəbəl/","extraExplanation":["“degradable”常见于环保与材料领域，语气偏正式。日常生活中更常看到“biodegradable（可生物降解的）”，强调由微生物分解；而“degradable”范围更广，可能包含光降解、化学降解等。","注意：标注“degradable”不一定等于“无害”或“快速消失”。降解速度、条件（温度、湿度、氧气、光照）以及降解产物是否安全，都需要具体标准或检测来判断。"]}
{"word":"degradand","summary":{"en":"A degradand is a substance that is intended to be degraded (broken down), especially in scientific contexts.","zh":"degradand 指“被降解物/待降解物”，多用于科研语境，表示将被分解的物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance (such as a chemical, pollutant, or biomolecule) that is meant to be broken down or decomposed by a process (for example, by enzymes, microbes, or chemical reactions)","zh":"（尤用于科研语境）指将被分解、降解的物质（如化学品、污染物或生物分子），可通过酶、微生物或化学反应等过程被分解"},"examples":[{"en":"In the experiment, glucose served as the degradand for the enzyme.","zh":"在该实验中，葡萄糖作为该酶的降解底物（被降解物）。"},{"en":"The researchers tested how quickly microbes could remove the degradand from the water.","zh":"研究人员测试了微生物从水中去除该被降解物的速度。"},{"en":"This polymer is designed so the degradand breaks down into harmless products.","zh":"这种聚合物被设计成可将被降解物分解为无害产物。"}]}],"synonyms":["substrate","compound","pollutant","target molecule"],"phonetic":"/dɪˈɡreɪdænd/","extraExplanation":["“degradand”多见于生物化学、环境科学与材料科学论文中，表示“被降解的对象”。日常英语中很少用，常用替代表达包括“substrate（底物）”“compound（化合物）”“pollutant（污染物）”或更具体的名称。","词形来自“degrade（降解）+ -and（表示动作承受者）”，类似构词还有“ligand（配体）”。在生化语境中，它与“enzyme（酶）/degrader（降解者）/degradation（降解过程）”常一起出现。"]}
{"word":"degradare","summary":{"en":"“Degradare” is a rare Latin-based form meaning “to degrade/demote,” and it is not standard modern English; use “degrade” (verb) or “degradation” (noun) instead.","zh":"“degradare”是罕见的拉丁语形式，大意为“使降级/贬低/降职”，不属于现代标准英语；通常应使用动词“degrade”或名词“degradation”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare; from Latin) to degrade—reduce in rank, status, or quality; to demote.","zh":"（罕见；源自拉丁语）使降级／贬低——降低等级、地位或质量；使降职。"},"examples":[{"en":"In older Latin-based academic writing, “degradare” was used to mean “to demote.”","zh":"在一些较早的拉丁化学术写作中，“degradare”可用来表示“使降职/降级”。"},{"en":"The council voted to degradare the officer for misconduct. (rare/archaic)","zh":"委员会投票决定因不当行为而使该军官降职。（罕见/古旧）"}]},{"partOfSpeech":"n.","definition":{"en":"In some modern Romance languages (e.g., Romanian), a form meaning “degradation/deterioration” (not standard English).","zh":"在一些现代罗曼语（如罗马尼亚语）中，可表示“退化/恶化/降解（degradation）”（非标准英语用法）。"},"examples":[{"en":"Romanian: “degradare” can refer to environmental degradation.","zh":"罗马尼亚语中，“degradare”可指“环境退化/环境恶化”。"},{"en":"If you mean the English noun, the usual word is “degradation.”","zh":"如果你想表达英语名词，常用词是“degradation（退化/恶化/贬损）”。"}]}],"synonyms":["degrade","demote","downgrade","debase","deteriorate"],"phonetic":"/ˌdɛɡrəˈdɑːreɪ/","extraExplanation":["“degradare”在英语里不是常见词；英语最常用的是动词“degrade”和名词“degradation”。","拉丁语词根常与“等级/品格下降”相关：de-（向下）+ grad-（步阶/等级，见 grade）。因此它既可指“降职”，也可广义指“质量变差、被贬低”。","如果你是在化学/生物/环境语境想表达“降解”，英语通常说“degradation”或“to degrade / to break down”。"]}
{"word":"degradation","summary":{"en":"Degradation means a decline (things getting worse), especially in quality or the environment, and it can also mean humiliating treatment that reduces someone’s dignity.","zh":"degradation 指“退化/恶化/下降”，常用于质量或环境变差；也可指“贬低、侮辱”，让人丧失尊严的对待。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of becoming worse in quality, condition, or value; a decline","zh":"（质量、状况或价值的）下降；退化；恶化"},"examples":[{"en":"The report warned about the degradation of the city’s water system.","zh":"报告警告说这座城市的供水系统正在恶化。"},{"en":"Over time, constant stress can lead to a degradation in mental health.","zh":"随着时间推移，持续压力可能导致心理健康状况下降。"}]},{"partOfSpeech":"n.","definition":{"en":"harm to the environment that makes it less healthy or less able to support life","zh":"环境退化；生态破坏（使环境更不健康或更难维持生命）"},"examples":[{"en":"Deforestation is a major cause of soil degradation.","zh":"森林砍伐是土壤退化的重要原因。"},{"en":"Policies aim to reduce land degradation in dry regions.","zh":"相关政策旨在减少干旱地区的土地退化。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of treating someone with disrespect or reducing their dignity; humiliation","zh":"贬低；侮辱；使人格受辱（降低尊严）"},"examples":[{"en":"Public insults can be a form of degradation.","zh":"公开羞辱可能是一种人格贬损。"},{"en":"He refused to accept the degradation of being mocked in front of others.","zh":"他拒绝接受在众人面前被嘲笑的羞辱。"}]}],"synonyms":["deterioration","decline","decay","erosion","corruption","humiliation"],"phonetic":"/ˌdɛɡrəˈdeɪʃən/","extraExplanation":["词根提示：de- 表示“向下、降低”，-grad- 来自拉丁语 gradus（“步、等级”），-ation 表示“过程/结果”。所以 degradation 字面可理解为“等级往下走的过程”，引申为“退化、恶化、贬损”。","常见搭配：environmental/land/soil degradation（环境/土地/土壤退化）；degradation of quality/performance（质量/性能下降）；human degradation（人格贬损）。注意在日常语境里，多用于“状况变差”的客观描述；用于“人格侮辱”时语气更强。"]}
{"word":"degradational","summary":{"en":"Degradational means “related to gradual decline or degradation,” and in geology it often refers to erosion that wears land down.","zh":"degradational 指“与退化、恶化有关的”；在地质/地理中常指侵蚀等使地表降低、地形被磨损的过程。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to degradation: a gradual decline in quality, condition, value, or status; causing or involving worsening.","zh":"与“退化/恶化”有关的；指质量、状况、价值或地位逐渐下降的；导致或涉及变差的。"},"examples":[{"en":"Chronic stress can have a degradational effect on sleep and memory.","zh":"长期压力会对睡眠和记忆产生退化性的影响。"},{"en":"They discussed the degradational changes in the building after years without maintenance.","zh":"他们讨论了这栋楼多年缺乏维护后出现的退化性变化。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Geology/Geography) Relating to land-surface lowering processes, especially erosion and the wearing down of terrain.","zh":"（地质/地理）与地表降低过程有关的，尤指侵蚀等使地形被削弱、被磨平的作用。"},"examples":[{"en":"Rivers are powerful agents in degradational landforms through erosion.","zh":"河流通过侵蚀作用是形成退化地貌的重要力量。"},{"en":"The report contrasts degradational processes with depositional ones.","zh":"这份报告对比了退化（侵蚀）过程与堆积过程。"}]}],"synonyms":["degrading","degenerative","deteriorative","erosional (in geology)"],"phonetic":"/ˌdɛɡrəˈdeɪʃənəl/","extraExplanation":["“degradational”来自 degrade（使降低/退化）+ -al（……的）。在学术写作中常见，尤其是地貌学里与“侵蚀、剥蚀”相关；日常英语里更常用的是 degrading（令人堕落的/有辱人格的）或 degenerative（退行性的，如疾病）。","与 degradative 很接近：degradative 也常见于生物/化学（如 degradative enzymes 降解酶）；degradational 更偏“过程/趋势”的描述，尤其在地理学语境中。"]}
{"word":"degradations","summary":{"en":"“Degradations” means multiple cases of worsening/decline, or humiliations; in science it can also mean material breakdowns.","zh":"“Degradations”指多种/多次的退化、恶化；也可指屈辱、侮辱；在科学语境中还可指材料的分解/降解。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"processes or instances of becoming worse in quality, condition, or value","zh":"（质量、状况或价值）变差、退化的过程或情况"},"examples":[{"en":"The report warned about the degradations in air quality over the last decade.","zh":"报告警告说，过去十年空气质量出现了持续退化。"},{"en":"Repeated floods caused serious degradations to the roads and bridges.","zh":"反复的洪水使道路和桥梁严重损坏、退化。"}]},{"partOfSpeech":"n.","definition":{"en":"acts or experiences that lower someone’s dignity; humiliations","zh":"贬低人格尊严的行为或经历；侮辱、屈辱"},"examples":[{"en":"He spoke about the degradations he faced because of discrimination.","zh":"他谈到自己因歧视而遭受的屈辱。"},{"en":"No one should have to endure such degradations at work.","zh":"没有人应当在工作中忍受这种羞辱。"}]},{"partOfSpeech":"n.","definition":{"en":"breakdowns of a material or substance (for example, chemicals or plastics) into simpler forms","zh":"（材料/物质的）分解、降解（如化学品或塑料变成更简单的形式）"},"examples":[{"en":"Scientists measured the degradations of the plastic under sunlight.","zh":"科学家测量了塑料在阳光下的降解情况。"}]}],"synonyms":["declines","deteriorations","downturns","humiliations","indignities","breakdowns"],"phonetic":"/ˌdɛɡrəˈdeɪʃən/","extraExplanation":["“Degradations”是“degradation”的复数，常用来强调“多次、各种不同形式的退化/屈辱”，在新闻报道、学术写作中更常见；口语里更常说“decline”或“getting worse”。","含义2（屈辱）语气较强，带有道德或人权层面的批评色彩；使用时注意语境与分寸。"]}
{"word":"degradative","summary":{"en":"Degradative means causing decline or loss of quality, and can also mean humiliating; in linguistics, it describes meaning-reducing word forms.","zh":"degradative 指“导致退化/品质下降的”，也可指“贬损尊严、令人屈辱的”；在语言学中还可指“使词义降格/减弱”的构词形式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Causing something to become worse in quality, value, or condition; making something degrade.","zh":"使某事物在质量、价值或状态上变差的；导致退化/降级的。"},"examples":[{"en":"Pollution has a degradative effect on the river’s ecosystem.","zh":"污染对这条河流的生态系统有退化性的影响。"},{"en":"The committee warned that constant budget cuts could be degradative to public services.","zh":"委员会警告说，持续削减预算可能会对公共服务造成退化性的影响。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Often in social contexts) Treating someone in a way that lowers their dignity; humiliating or demeaning.","zh":"（常用于社会语境）贬损他人尊严的；侮辱性的、使人感到屈辱的。"},"examples":[{"en":"He refused to take a degradative job offer that involved constant insults.","zh":"他拒绝了一份带有持续侮辱性质、令人屈辱的工作邀请。"},{"en":"The film shows how degradative comments can damage a person’s confidence.","zh":"这部电影展示了贬损性的言论如何伤害一个人的自信。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Linguistics) Relating to an affix or process that reduces the usual meaning or status of a word, often making it smaller, weaker, or less important.","zh":"（语言学）指使词义或地位“降格/减弱”的词缀或构词过程，常带有“更小、更弱、不重要”等含义。"},"examples":[{"en":"Some languages use degradative suffixes to express a lesser degree of the original meaning.","zh":"有些语言会用“降格/减弱”后缀来表达原义的较低程度。"}]}],"synonyms":["degrading","deteriorative","damaging","corrosive","demeaning"],"phonetic":"/dɪˈɡreɪdətɪv/","extraExplanation":["“Degradative”来自“degrade”（使退化/贬低）+ 形容词后缀 “-ative”（表示“具有……性质/导致……”）。日常英语里更常见的是“degrading”（令人屈辱的）或“degradative effect”（退化性影响）这种搭配。","在学术写作中，“degradative”常用于描述过程或影响（例如环境、材料、系统性能的“退化”）；在描述人的感受时，用“degrading / demeaning / humiliating”通常更自然。"]}
{"word":"degrade","summary":{"en":"Degrade means to become worse, to make someone/something less respected, or (in science) to break down substances.","zh":"Degrade 可指变差/恶化、贬低使受辱，也可指（科学语境）分解/降解物质。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"To become worse in quality, condition, or behavior; to decline.","zh":"（质量、状况或行为）变差；退化；恶化。"},"examples":[{"en":"After the storm, the road conditions quickly degraded.","zh":"暴风雨过后，道路状况很快就恶化了。"},{"en":"If you don’t rest, your health may degrade over time.","zh":"如果你不休息，你的健康可能会随着时间而变差。"}]},{"partOfSpeech":"vt.","definition":{"en":"To make something seem less worthy or respected; to lower in rank or status; to demean.","zh":"贬低；使显得不那么有价值或不受尊重；降低（地位/等级）。"},"examples":[{"en":"It’s wrong to degrade people because of their background.","zh":"因为出身而贬低别人是不对的。"},{"en":"The manager’s insults degraded the entire team.","zh":"经理的侮辱让整个团队都感到被贬低。"}]},{"partOfSpeech":"vt.","definition":{"en":"To break down a substance into simpler parts, especially through natural processes (common in science/environmental contexts).","zh":"（尤指自然过程）分解（物质）；降解（常用于科学/环保语境）。"},"examples":[{"en":"Some plastics degrade very slowly in the ocean.","zh":"有些塑料在海洋中降解得非常慢。"},{"en":"Bacteria can degrade organic waste.","zh":"细菌可以分解有机废物。"}]}],"synonyms":["deteriorate","decline","worsen","demean","humiliate","decompose","break down"],"phonetic":"/dɪˈɡreɪd/","extraExplanation":["“degrade”在日常语境里常指“质量/状况变差”，也常用于人际与社会语境表示“贬低他人、使人受辱”，语气较重，带有道德评价。","在环保与材料科学中，“degrade”经常对应“降解/分解”，例如“biodegradable（可生物降解的）”。"]}
{"word":"degraded","summary":{"en":"“Degraded” usually means made worse in quality/condition, or treated in a humiliating way; it can also mean lowered in rank (past form of “degrade”).","zh":"“Degraded”通常指质量/状况变差（退化、受损），或被羞辱/贬低；也可指被降级（degrade 的过去形式）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"made worse in quality, condition, or value; harmed or reduced","zh":"（质量、状况或价值）变差的；受损的；降低的"},"examples":[{"en":"The river is badly degraded by pollution.","zh":"这条河因污染而严重退化。"},{"en":"Years of stress left him feeling degraded and exhausted.","zh":"多年的压力让他觉得状态变差、筋疲力尽。"}]},{"partOfSpeech":"adj.","definition":{"en":"treated with disrespect so that someone feels less valued or dignified","zh":"被侮辱的；被贬低的；尊严受损的"},"examples":[{"en":"She felt degraded by the rude comments.","zh":"那些粗鲁的评论让她感到被贬低。"},{"en":"No one should be degraded at work because of their background.","zh":"任何人都不应因出身而在工作中遭到羞辱或贬低。"}]},{"partOfSpeech":"adj.","definition":{"en":"lowered to a less important rank or position (often used in passive voice)","zh":"被降级的；被降职的"},"examples":[{"en":"After the review, he was degraded to a junior role.","zh":"复审后，他被降到初级岗位。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “degrade”: to make something worse, to treat someone with disrespect, or to reduce rank","zh":"degrade 的过去式/过去分词：使（质量）变差；侮辱/贬低；降级"},"examples":[{"en":"The chemicals degraded the plastic over time.","zh":"这些化学物质会随着时间让塑料劣化。"},{"en":"He was degraded for breaking the rules.","zh":"他因违反规定而被降级/降职。"}]}],"synonyms":["damaged","deteriorated","reduced","weakened","humiliated","demeaned"],"phonetic":"/dɪˈɡreɪdɪd/","extraExplanation":["“degraded”常见两类语境：①环境/材料“退化、劣化”（degraded land/forest/water quality）；②人的尊严“被羞辱、被贬低”（feel degraded）。注意它比“worse”更正式，也更强调“因某种原因而下降”。","在科学语境里，degrade/degraded 常指“分解、降解”，如 biodegradable（可生物降解的）、degradation（降解/退化）。"]}
{"word":"degradedly","summary":{"en":"“Degradedly” means “in a degraded manner,” either physically/technically worse in condition or socially/morally lowered and humiliating.","zh":"“degradedly”意为“以退化/恶化或被贬低、屈辱的方式”，可指状态变差（技术/质量）或人格与社会地位被压低。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a degraded way; in a manner that is worse in quality, condition, or status.","zh":"以退化/恶化的方式；以质量、状况或地位变差的方式。"},"examples":[{"en":"The old film reel was stored badly and played degradedly, with missing sound and scratches.","zh":"那卷老电影胶片保存不当，播放效果明显退化：声音缺失、画面满是划痕。"},{"en":"Without maintenance, the equipment functioned degradedly over time.","zh":"缺乏维护后，这套设备随着时间推移运行得越来越差。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a morally or socially lowered, humiliating, or demeaning way.","zh":"以有失体面、卑下、受辱或有损人格的方式。"},"examples":[{"en":"He felt he was being treated degradedly and decided to leave the job.","zh":"他觉得自己被以有辱人格的方式对待，于是决定离职。"},{"en":"The novel describes how people can live degradedly under extreme oppression.","zh":"这部小说描写了人在极端压迫下可能如何屈辱地活着。"}]}],"synonyms":["in a degraded way","shabbily","poorly","deterioratedly","demeaningly"],"phonetic":"/dɪˈɡreɪdɪdli/","extraExplanation":["“degradedly”来自形容词“degraded（退化的；堕落的；被贬低的）”加副词后缀“-ly”。它在现代英语里相对少见，写作中更常见的表达是“in a degraded way / in a degrading way”。","注意区分：degradedly（状态已变差/已被贬低地）偏“结果/状态”，degradingly（令人感到羞辱地）更强调“让人受辱的过程/感受”。"]}
{"word":"degradedness","summary":{"en":"“Degradedness” means the state of being degraded—reduced in quality, condition, or status.","zh":"“degradedness”指处于“被降低/退化/被贬低”的状态或性质，常可用更常见的“degradation”替换。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being degraded (lowered in status, value, or condition); degradation","zh":"被贬低、降低或变坏的状态/性质；堕落、退化"},"examples":[{"en":"The report described the degradedness of the river after years of pollution.","zh":"报告描述了这条河在多年污染之后的退化程度。"},{"en":"She wrote about the degradedness of public debate when people stop listening to each other.","zh":"她写到，当人们不再倾听彼此时，公共讨论会变得低水平、堕落。"}]}],"synonyms":["degradation","decline","deterioration","corruption","debasing","demotion"],"phonetic":"/dɪˈɡreɪdɪdnəs/","extraExplanation":["“degradedness”比较少见，更常用的名词是“degradation”（退化/堕落/贬低）或“degraded condition/state”（退化的状态）。在正式写作中，用“degradation”通常更自然。","构词：degrade（使降级/使堕落）+ -ed（被……的）+ -ness（……的状态/性质）。因此它强调“处于被降级/被贬低的状态”。"]}
{"word":"degradement","summary":{"en":"Degradement is a rare noun meaning degradation—lowering in status/quality, or humiliation.","zh":"Degradement 是个罕用名词，大意同 degradation：地位/质量下降，或指屈辱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) the act or process of degrading someone or something; a lowering of status, quality, or condition.","zh":"（罕用）使……降低、贬低或变差的行为/过程；地位、质量或状况的下降。"},"examples":[{"en":"The critic described the policy as a gradual degradement of public trust.","zh":"这位评论家把该政策形容为对公众信任的逐步损害与降低。"},{"en":"He spoke of the degradement of the neighborhood over the past decade.","zh":"他谈到过去十年社区状况的衰退与变差。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare, formal) humiliation or disgrace caused by being treated as less worthy.","zh":"（罕用，正式）因被当作更不值得而遭受的羞辱或屈辱。"},"examples":[{"en":"She refused to accept the degradement of being excluded publicly.","zh":"她拒绝接受被公开排斥所带来的羞辱。"}]}],"synonyms":["degradation","decline","deterioration","downgrade","humiliation","disgrace"],"phonetic":"ˈdɛɡrədeɪmənt","extraExplanation":["“degradement”在现代英语中非常少见，更多时候人们会用更常见的词：**degradation**（退化/降格/恶化）或 **downgrade**（降级）。","拼写上也常被当作“degradation”的误写。如果你是在学术或新闻语境中写作，通常建议改用 **degradation**，更自然、更容易被读者理解。"]}
{"word":"degrader","summary":{"en":"A “degrader” is someone or something that makes another person/thing worse, lower, or broken down; in science it can mean a material/organism that decomposes something.","zh":"“degrader”指使他人/事物变差、降低或受辱的人或事物；在科学语境中也可指分解某物的物质或生物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person or thing that degrades someone or something (makes it worse, lower in quality, or less respected).","zh":"使某人或某物退化、变差或受辱的人（或事物）。"},"examples":[{"en":"The report described the online bully as a degrader who enjoyed humiliating others.","zh":"报告把那个网络霸凌者形容为一个以羞辱他人为乐的贬损者。"},{"en":"Pollution can act as a degrader of air quality in big cities.","zh":"污染会成为大城市空气质量的“降级因素”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Science/technology) A substance or organism that breaks down a material into simpler parts (for example, bacteria that break down oil).","zh":"（科学/技术）能分解某种物质的物质或生物（例如分解石油的细菌）。"},"examples":[{"en":"Researchers tested a bacterial degrader that can break down plastic more quickly.","zh":"研究人员测试了一种能更快分解塑料的细菌分解者。"},{"en":"An oil degrader was added to help clean up the spill.","zh":"为帮助清理泄漏，加入了油类分解剂。"}]}],"synonyms":["belittler","humiliator","detractor","pollutant","decomposer"],"phonetic":"/dɪˈɡreɪdər/","extraExplanation":["“degrader”来自动词 degrade（使降级、使恶化、使羞辱）+ -er（表示“做某事的人/物”）。在日常英语里，它更常指“贬低他人、使人受辱的人/事”；在科研语境中也可指“分解者/分解剂”（如微生物或化学剂）。","搭配提示：degrade someone（羞辱某人）；degrade the environment/quality（使环境/质量变差）；degradation（名词：退化、恶化、屈辱）。"]}
{"word":"degraders","summary":{"en":"“Degraders” are people, things, or organisms that reduce quality or break down materials.","zh":"“degraders”指使质量下降的人/事物，或指分解物质的分解者（生物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or things that lower the quality, value, condition, or status of something; also, in science, organisms (like bacteria or fungi) that break down materials.","zh":"使某物质量、价值、状况或地位下降的人或事物；在科学语境中也指“分解者”（如细菌、真菌等），能分解物质。"},"examples":[{"en":"Many people see online trolls as degraders of public conversation.","zh":"很多人把网络喷子看作是公共讨论的“拉低者/破坏者”。"},{"en":"In a forest ecosystem, fungi and bacteria are key degraders of dead leaves.","zh":"在森林生态系统中，真菌和细菌是分解落叶的重要分解者。"},{"en":"Pollution can act as a degrader of water quality.","zh":"污染会成为水质的“降质因素/破坏因素”。"}]}],"synonyms":["decomposers","breakdown organisms","deteriorators","harmers","polluters"],"phonetic":"/dɪˈɡreɪdərz/","extraExplanation":["“degraders”是复数形式，单数是“degrader”。来自动词“degrade”（使降低、使退化）。","在生态学里，“degraders”常用来指“分解者”，与“decomposers”意思非常接近；更口语、更常见的说法通常是“decomposers”。","日常语境中，“degrader”有时带批评色彩，指“拉低水准的人/事”（例如“degraders of standards”降低标准者）。"]}
{"word":"degrades","summary":{"en":"“Degrades” means (1) humiliates someone, (2) reduces rank/status, or (3) makes something worse; it can also mean “becomes worse.”","zh":"“degrades”表示（1）羞辱/贬低某人，（2）降级/降低地位，（3）使质量变差；也可表示“变差/退化”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to treat someone without respect; to make someone seem less worthy or less dignified","zh":"羞辱（某人）；贬低（某人）的尊严"},"examples":[{"en":"No one should be degraded because of their accent or background.","zh":"任何人都不应因为口音或背景而被羞辱。"},{"en":"He felt degraded by the cruel jokes.","zh":"那些刻薄的玩笑让他感到受辱。"}]},{"partOfSpeech":"vt.","definition":{"en":"to reduce someone’s rank, status, or position","zh":"降级；使（职位/地位）降低"},"examples":[{"en":"The officer was degraded after the investigation.","zh":"调查之后，这名军官被降级了。"},{"en":"The company degraded him from manager to assistant.","zh":"公司把他从经理降为助理。"}]},{"partOfSpeech":"vt.","definition":{"en":"to damage the quality of something; to make something worse","zh":"使（质量）下降；使变差"},"examples":[{"en":"Repeated washing degrades the fabric over time.","zh":"反复清洗会让布料的质量随着时间下降。"},{"en":"Sunlight can degrade plastic quickly.","zh":"阳光会很快让塑料老化变质。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become worse in quality or condition","zh":"（质量/状况）下降；退化"},"examples":[{"en":"Without maintenance, the road degrades every winter.","zh":"没有维护，这条路每到冬天都会变差。"},{"en":"The video will degrade if you keep copying it.","zh":"如果你不断复制，视频质量会下降。"}]}],"synonyms":["humiliates","demeans","demotes","reduces","deteriorates","weakens"],"phonetic":"/dɪˈɡreɪd/","extraExplanation":["“degrades”是动词第三人称单数（he/she/it degrades）。原形是degrade。","用于“羞辱人”的意思时语气较重，涉及人格与尊严；表达时注意礼貌与文化敏感性。若只是“批评/贬低观点”，可用criticize、look down on等更中性表达。","近义词区分：degrade（使变低/变差，含“降低层级或质量”）；humiliate（更强调当众羞辱）；demote（专指职位降级）；deteriorate（多指质量自然变差）。"]}
{"word":"degrading","summary":{"en":"Degrading means either humiliating and disrespectful, or gradually becoming worse in quality or condition.","zh":"Degrading 既可指“侮辱、贬低、损害尊严的”，也可指“质量或状况逐渐变差、退化的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Humiliating or disrespectful; making someone feel they have less dignity or worth.","zh":"侮辱性的；有损尊严的；让人觉得自己被贬低的。"},"examples":[{"en":"He refused to do the degrading work that involved insulting customers.","zh":"他拒绝做那种需要辱骂顾客、很有侮辱性的工作。"},{"en":"She said the comments were degrading to women.","zh":"她说那些言论是在贬低女性、损害女性尊严。"}]},{"partOfSpeech":"adj.","definition":{"en":"Becoming worse in quality, condition, or performance over time.","zh":"（质量、状况或表现）逐渐变差的；退化的。"},"examples":[{"en":"The degrading road conditions made driving dangerous.","zh":"路况不断变差，使得驾驶变得危险。"},{"en":"Without maintenance, the machine is degrading quickly.","zh":"如果不维护，这台机器会很快退化、变得更差。"}]}],"synonyms":["humiliating","demeaning","insulting","shameful","deteriorating","declining"],"phonetic":"/dɪˈɡreɪdɪŋ/","extraExplanation":["“degrading”常见两种用法：①形容“有辱人格/贬低人的”（更偏情感与社会评价）；②形容“质量变差/退化”（更偏客观变化）。根据语境判断是“羞辱”还是“变差”。","与“humiliating”相比，“degrading”更强调“让人失去尊严/被贬低的感觉”，有时带有社会地位或人格被拉低的意味。"]}
{"word":"degradingly","summary":{"en":"“Degradingly” means “in a humiliating or dignity-lowering way,” and can also mean “in a way that reduces quality or condition.”","zh":"“degradingly”表示“以侮辱、贬低尊严的方式”，也可指“以降低质量或状态（造成损害）的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that lowers someone’s dignity or respect; humiliatingly.","zh":"以贬低人格或尊严的方式；侮辱性地。"},"examples":[{"en":"He spoke to her degradingly, as if she were incompetent.","zh":"他用很侮辱的语气跟她说话，好像她很无能。"},{"en":"The staff were treated degradingly by some customers.","zh":"一些顾客以贬低的方式对待工作人员。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that reduces the quality, value, or condition of something; in a damaging way.","zh":"以降低质量、价值或状态的方式；以造成损害的方式。"},"examples":[{"en":"Harsh chemicals can act degradingly on the fabric over time.","zh":"强力化学品久了会对布料产生破坏性的作用。"},{"en":"Heat and sunlight affect some plastics degradingly.","zh":"高温和阳光会以破坏性的方式影响某些塑料。"}]}],"synonyms":["humiliatingly","demeaningly","insultingly","disrespectfully","damagingly"],"phonetic":"/dɪˈɡreɪdɪŋli/","extraExplanation":["“degradingly”来自形容词“degrading”（有辱人格的/使质量下降的）+ 副词后缀“-ly”。在日常英语里更常用的表达通常是“in a degrading way / in a humiliating way”，因为“degradingly”本身比较少见、略偏书面。","语气提醒：用于描述对人的态度时，往往带有强烈的道德评价（不尊重、侮辱）。如果只是强调“严格、批评”，更中性的词可能是“harshly / sternly”。"]}
{"word":"degradingness","summary":{"en":"“Degradingness” means the quality of being degrading—humiliating or lowering someone’s dignity. It’s uncommon; “degradation” or “the degrading nature of…” is more natural.","zh":"“Degradingness”指“有辱人格/贬损人的”这种性质（侮辱性）。该词很少用，更地道的说法常用“degradation”或“the degrading nature of…”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being degrading (humiliating, lowering someone’s dignity or status)","zh":"“degrading（有辱人格的、使人丢脸的）”这种性质；侮辱性、贬损性"},"examples":[{"en":"She spoke about the degradingness of the comments and how they affected her confidence.","zh":"她谈到这些评论的侮辱性，以及它们如何影响了她的自信。"},{"en":"Many workers criticized the degradingness of the rules that treated adults like children.","zh":"许多工人批评这些把成年人当小孩对待的规定很“有辱人格”。"}]}],"synonyms":["humiliation","degradation","indignity","demeaningness","shame"],"phonetic":"/dɪˈɡreɪdɪŋnəs/","extraExplanation":["“degradingness”在现代英语里非常少见，很多母语者会觉得不自然或像是临时造出来的词。更常用、更地道的表达是：the degrading nature of…（……的侮辱性/贬损性）、degradation（屈辱/堕落/退化，语义更广）、humiliation（羞辱）、demeaning behavior/treatment（贬低人的行为/对待）。","构词上它是 degrading（令人羞辱的）+ -ness（表示“性质/状态”的名词后缀），所以意思容易猜，但写作中建议改用更常见的名词，以免显得生硬。"]}
{"word":"degraduate","summary":{"en":"Degraduate is a rare, nonstandard verb meaning to demote/downgrade someone or reduce quality; most English uses demote/downgrade/degrade instead.","zh":"Degraduate 是很少见、偏非标准的动词，可指使人降级/贬职或降低质量；更常用 demote/downgrade/degrade。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Uncommon / nonstandard) to reduce someone’s status or rank; to demote or downgrade.","zh":"（不常用/非标准）降低某人的地位或等级；使降级、贬职。"},"examples":[{"en":"He felt the new policy would degraduate experienced workers by cutting their responsibilities.","zh":"他觉得新政策会通过减少职责来“降级”有经验的员工。"},{"en":"Some people used the word degraduate, but most writers prefer demote or downgrade.","zh":"有些人会用 degraduate，但大多数写作者更常用 demote 或 downgrade。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Uncommon / nonstandard) to lower the quality or condition of something; to make it worse.","zh":"（不常用/非标准）降低某物的质量或状态；使变差。"},"examples":[{"en":"Pollution can degraduate the river’s water quality over time.","zh":"污染会随着时间推移降低河水水质。"}]}],"synonyms":["demote","downgrade","degrade","deteriorate","reduce"],"phonetic":"/diˈɡrædʒuˌeɪt/","extraExplanation":["“degraduate”在现代英语里非常少见，很多词典不收录。日常写作与考试中，通常用更标准的词：\n- 表示“使（人）降职/降级”：demote, downgrade\n- 表示“使（事物）变差/恶化”：degrade, deteriorate\n也有人把它当作“graduate（毕业）”的反义词来创造用法，但这不是主流表达。"]}
{"word":"degraduation","summary":{"en":"“Degraduation” is a rare, nonstandard noun meaning a lowering of rank, status, or quality; most writers use “degradation” instead.","zh":"“degraduation”是一个罕见且不太标准的名词，表示地位/等级/品质的降低；通常应使用更常见的“degradation”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/Nonstandard) the act or process of reducing someone or something in rank, status, or quality; similar in meaning to “degradation.”","zh":"（罕见/非标准用法）使某人或某物在等级、地位或品质上下降的行为或过程；意义接近“degradation（贬低、退化）”。"},"examples":[{"en":"In older writing, “degraduation” sometimes appears with the meaning of a loss of status.","zh":"在较旧的文字里，“degraduation”有时会用来表示地位的下降。"},{"en":"The report warns that unfair rules can lead to the degraduation of workers’ rights.","zh":"报告警告说，不公平的规定会导致工人权利被贬损。"}]}],"synonyms":["degradation","demotion","decline","diminution"],"phonetic":"/ˌdiːɡrəˈdʒuːeɪʃən/","extraExplanation":["“degraduation”在现代英语里非常少见，很多情况下会被视为不自然或拼写/选词不当。更常用、也更标准的词是“degradation”。","容易混淆：① degradation（贬低；退化；降解）② graduation（毕业；分级）。如果你的意思是“毕业”，应写 graduation；如果是“退化/贬低”，应写 degradation。"]}
{"word":"Degraff","summary":{"en":"DeGraff (or de Graff) is usually a surname; it can also be a U.S. place name (De Graff, Minnesota).","zh":"DeGraff（或 de Graff）通常是姓氏；也可作地名（如美国明尼苏达州的 De Graff）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname), often written as DeGraff or de Graff.","zh":"姓氏（常写作 DeGraff 或 de Graff）。"},"examples":[{"en":"Ms. DeGraff will lead the meeting today.","zh":"DeGraff 女士今天将主持会议。"},{"en":"I met someone with the last name de Graff.","zh":"我遇到过一位姓 de Graff 的人。"}]},{"partOfSpeech":"other","definition":{"en":"a place name, especially De Graff, a small city in Minnesota, USA.","zh":"地名（尤其指美国明尼苏达州的小城 De Graff）。"},"examples":[{"en":"They drove through De Graff on their way across Minnesota.","zh":"他们横穿明尼苏达州时开车经过了 De Graff。"}]}],"phonetic":"/də ˈɡræf/","extraExplanation":["“De/ de”在一些欧洲姓氏中很常见（如荷兰、法语系），常有“来自……/……的”之类的含义，但在现代英语里通常直接当作姓氏的一部分来用。","拼写上可能分开（de Graff / De Graff）或连写（DeGraff）。正式写作时最好按本人或官方文件的拼法与大小写来写。","读音在英语里通常重音在“Graff”部分：də-GRAFF。"]}
{"word":"degrain","summary":{"en":"Degrain means to remove grain/noise from an image; less commonly, to remove grain-like particles or seeds.","zh":"Degrain 指对图像进行去颗粒/降噪处理；较少见地也可指去除谷粒或颗粒。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to remove grain or noise from an image (especially film scans or digital photos) using software or processing","zh":"（尤指对胶片扫描或数码照片）去除颗粒感/噪点，进行“降噪/去颗粒”处理"},"examples":[{"en":"I degrained the scanned film to make the sky look smoother.","zh":"我把扫描的胶片做了去颗粒处理，让天空看起来更平滑。"},{"en":"Be careful—if you degrain too much, faces can look plastic.","zh":"要小心——去颗粒过度的话，人脸会看起来像塑料一样不自然。"}]},{"partOfSpeech":"v.","definition":{"en":"to remove grains (seeds) from something; to strip away grain-like particles","zh":"去除谷粒/颗粒；把类似谷粒的颗粒从某物中剔除（较少见用法）"},"examples":[{"en":"The machine helps degrain the harvested material before storage.","zh":"这台机器能在入库前把收割物进行脱粒/去颗粒处理。"}]}],"synonyms":["denoise","reduce grain","noise reduction","clean up"],"phonetic":"/diːˈɡreɪn/","extraExplanation":["“degrain”在日常英语里不算常用，更常见的说法是影像领域的“denoise（降噪）”“reduce grain（减少颗粒）”“noise reduction（降噪处理）”。在摄影/后期里，“grain（颗粒）”既可能是胶片质感，也可能是高感光度带来的噪点；是否要去除取决于你想保留质感还是追求更干净的画面。"]}
{"word":"degranulation","summary":{"en":"Degranulation is the release of stored granule contents from certain cells, especially immune cells, often linked to allergy and inflammation.","zh":"Degranulation（脱颗粒）是某些细胞（尤指免疫细胞）释放其颗粒内储存物质的过程，常与过敏和炎症有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process in which certain cells (especially immune cells like mast cells and basophils) release the contents of their granules (small storage packets) into the surrounding tissue or blood","zh":"（尤指肥大细胞、嗜碱性粒细胞等免疫细胞）将细胞内“颗粒”（储存小囊泡）中的物质释放到周围组织或血液中的过程"},"examples":[{"en":"During an allergic reaction, mast cells can trigger symptoms by degranulation.","zh":"在过敏反应中，肥大细胞可通过脱颗粒释放物质，从而引发症状。"},{"en":"The drug reduced degranulation and helped relieve inflammation.","zh":"该药物减少了脱颗粒，从而有助于缓解炎症。"},{"en":"Researchers measured degranulation to assess immune cell activation.","zh":"研究人员通过测量脱颗粒来评估免疫细胞的激活程度。"}]}],"synonyms":["granule release","mast-cell degranulation","exocytosis (broader term)"],"phonetic":"/diˌɡræn.jəˈleɪ.ʃən/","extraExplanation":["“de-”有“去除/释放”的含义，“granulation”指“形成颗粒/颗粒化”。合在一起，degranulation直观理解就是“把颗粒里的内容释放出来”。","脱颗粒释放的物质常见有组胺（histamine）、肝素（heparin）以及多种炎症介质，因此它与过敏（如荨麻疹、哮喘）和炎症反应密切相关。"]}
{"word":"degras","summary":{"en":"Degras is an oily residue used for treating leather or as a lubricant.","zh":"Degras 指一种油性残渣，用于皮革护理或作润滑剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an oily residue (often from tanning or treating leather, or from scouring wool) used as a leather dressing or as a lubricant","zh":"（多指制革或洗涤羊毛过程中产生的）油性残渣，可用作皮革护理油或润滑剂"},"examples":[{"en":"The workshop used degras to soften and condition old leather straps.","zh":"这家作坊用 degras 来软化并保养旧皮带。"},{"en":"Historically, degras was valued as a low-cost lubricant in some industries.","zh":"在历史上，degras 在一些行业里曾被看作一种廉价的润滑材料。"}]}],"synonyms":["leather dressing","grease","lubricant","lanolin (related, not identical)"],"phonetic":"/dəˈɡrɑː/","extraExplanation":["这是一个较少见、偏“工艺/工业”语境的词，常出现在制革、皮革护理、润滑材料等领域的说明文字里。","词源上与法语 dégras 有关，含义与“油脂/去油后的油性物质”相关；现代日常英语中不常用，更多会看到更通用的表达，如 leather dressing（皮革护理油）或 grease/oil（油脂/润滑油）。"]}
{"word":"degratia","summary":{"en":"De gratia (often written as two words) means “as a favor / by grace,” i.e., given freely rather than earned or required.","zh":"de gratia（常写作两词）意为“出于好意/蒙恩而得”，强调无偿给予，而非应得或依法必须。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Rare; from Latin) “as a favor,” “out of kindness,” or “by grace,” used to mean something is given freely rather than earned or required.","zh":"（罕见；源自拉丁语）“出于好意/作为人情”“蒙恩而得”，表示某事是无偿给予的，而不是靠功劳获得或依法必须给的。"},"examples":[{"en":"The scholarship was awarded de gratia, not because of any formal obligation.","zh":"这项奖学金是出于恩惠（无偿）而颁发的，并非任何正式义务所要求。"},{"en":"They offered him support de gratia after the accident.","zh":"事故之后，他们出于好意无偿地给予了他帮助。"}]}],"synonyms":["as a favor","out of kindness","as an act of grace","as a goodwill gesture","gratis (context-dependent)"],"phonetic":"/deɪ ˈɡrɑːtiə/","extraExplanation":["“de gratia”是拉丁语短语，更常见的写法是分开写作 de gratia；你输入的“degratia”可能是合写、拼写变体或排版造成的连写。","它在现代英语中非常少见，更常见、更自然的表达包括：as a favor（作为人情）、out of kindness（出于好意）、as an act of grace / goodwill（出于宽容/善意）。","在法律、宗教或较正式的文体里，“grace（恩典）”常带有“无功受禄/不配得却被赐予”的语感，因此 de gratia 往往强调“不是权利、不是应得”。"]}
{"word":"degravate","summary":{"en":"A rare verb meaning to make a situation less serious or tense.","zh":"一个罕用动词，表示使情况不那么严重或缓和紧张。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare) to make a problem, conflict, or situation less serious; to reduce tension or severity.","zh":"（罕用）使问题、冲突或局势不那么严重；缓和、减轻严重性。"},"examples":[{"en":"The mediator tried to degravate the dispute before it became a lawsuit.","zh":"调解员试图在纠纷变成诉讼之前把它缓和下来。"},{"en":"A calm apology can degravate an argument quickly.","zh":"冷静的道歉往往能很快缓和争吵。"}]}],"synonyms":["de-escalate","defuse","mitigate","ease","alleviate"],"phonetic":"/diˈɡreɪveɪt/","extraExplanation":["“Degravate”在现代英语里非常少见，很多词典不收录；更常用、更自然的表达是：de-escalate（降级/缓和局势）、defuse（化解紧张/危险局面）、mitigate（减轻不良影响）、ease（缓解）、reduce the severity（降低严重性）。","构词上可理解为 de-（去除、降低）+ aggravate（加重、使恶化），因此语义接近“让情况不再加重”。但在正式写作或考试中，建议优先用更常见的同义词。"]}
{"word":"degreaes","summary":{"en":"A degree is a unit of measurement (temperature/angle), a level of intensity, or a university qualification; “degrees” is the plural.","zh":"degree 可指（温度/角度的）度、程度/水平或大学学位；degrees 是其复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A unit for measuring temperature (°C, °F) or angles (°).","zh":"（温度或角度的）度；度数（°C、°F、°）"},"examples":[{"en":"It’s 30 degrees Celsius today.","zh":"今天是30摄氏度。"},{"en":"Turn the knob a few degrees to the right.","zh":"把旋钮向右转几度。"}]},{"partOfSpeech":"n.","definition":{"en":"A level or amount of something; how strong or serious something is.","zh":"程度；水平；（严重性、强度等的）大小"},"examples":[{"en":"To some degree, I agree with you.","zh":"在某种程度上，我同意你。"},{"en":"The pain decreased in degree after the medicine.","zh":"吃药后疼痛程度减轻了。"}]},{"partOfSpeech":"n.","definition":{"en":"A qualification given by a college or university after completing a course of study.","zh":"（大学授予的）学位"},"examples":[{"en":"She earned a degree in biology.","zh":"她获得了生物学学位。"},{"en":"Do you have a college degree?","zh":"你有大学学位吗？"}]},{"partOfSpeech":"n.","definition":{"en":"A step in a series or a rank in a system (less common in everyday conversation).","zh":"（系列中的）级别；（体系中的）等级（较不常见）"},"examples":[{"en":"He is a man of high degree in the organization.","zh":"他在组织里级别很高。"}]}],"synonyms":["level","amount","grade","qualification"],"phonetic":"/dɪˈɡriː/","extraExplanation":["你写的“degreaes”看起来像拼写错误，最常见的正确拼写是 **degrees**（degree 的复数）。\n- **degree** = 单数：one degree（1度 / 一个学位）\n- **degrees** = 复数：ten degrees（10度 / 多个学位）\n如果你想查的是别的词，也可以告诉我你看到它的句子。"]}
{"word":"degrease","summary":{"en":"Degrease means to remove grease or oil from a surface, object, or food.","zh":"Degrease 指把物体表面或食物中的油脂/油污去除。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove grease, oil, or fat from something (a surface, a part, or food)","zh":"（从表面、零件或食物中）去除油脂、油污"},"examples":[{"en":"Before painting the metal, degrease it so the paint will stick.","zh":"在给金属上漆之前先把它去油，这样油漆才粘得住。"},{"en":"Degrease the pan with hot water and dish soap.","zh":"用热水和洗洁精把锅去油。"},{"en":"I degreased the soup by skimming the fat off the top.","zh":"我把汤表面的油脂撇掉来给它去油。"}]}],"synonyms":["defat","clean","remove oil","skim (fat)"],"phonetic":"/diˈɡris/","extraExplanation":["“de-”这个前缀常表示“去除、除去”（如 deice 去冰，deodorize 除臭），所以 degrease 直观理解就是“去除 grease（油脂/油污）”。","在机械/工业语境中，degrease 往往指用溶剂或专用清洁剂（degreaser）进行“除油”，以便后续加工（喷漆、电镀、粘接等）更牢固。","在烹饪语境中，degrease 常见做法是“撇油/冷却后去油”，属于把食物里的多余油脂去掉，而不是用化学清洁剂。"]}
{"word":"degreased","summary":{"en":"“Degreased” describes something that has been cleaned to remove grease or oil, or it is the past form of “degrease.”","zh":"“Degreased”表示“已去油/去除油脂的”，也可作动词degrease的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having had grease or oil removed; cleaned so the surface is free of oily residue","zh":"已去除油脂的；去油清洁过的（表面不再有油腻残留）"},"examples":[{"en":"Make sure the pan is completely degreased before you repaint it.","zh":"重新上漆前，务必把锅（或金属盘）彻底去油。"},{"en":"The mechanic used a solvent to leave the engine parts degreased.","zh":"技师用溶剂把发动机零件清洗到去油干净的状态。"}]},{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of “degrease”: to remove grease or oil from something","zh":"动词“degrease”的过去式/过去分词：把……的油脂去除；给……去油"},"examples":[{"en":"She degreased the kitchen hood with hot water and detergent.","zh":"她用热水和清洁剂把厨房抽油烟机去油清洗了。"},{"en":"The parts were degreased and then painted.","zh":"零件先去油处理，然后再喷漆。"}]}],"synonyms":["defatted","de-oiled","cleaned","oil-free"],"phonetic":"/diːˈɡriːst/","extraExplanation":["“degreased”常见于烹饪与清洁/工业语境：例如degreased broth（去油汤/撇去浮油的汤）或degreased surface（去油后的表面）。在喷漆、粘合、上涂层前“去油”很关键，否则油膜会影响附着力。"]}
{"word":"degreaser","summary":{"en":"A degreaser is a cleaner used to remove grease and oily grime.","zh":"degreaser 指用于清除油脂和油污的清洁剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A cleaning product or chemical used to remove grease and oily dirt from surfaces.","zh":"去油剂；除油清洁剂（用于清除表面油脂和油污的清洁产品或化学剂）。"},"examples":[{"en":"Use a degreaser to clean the stove hood before you scrub it.","zh":"先用去油剂清洁抽油烟机，再进行刷洗。"},{"en":"This degreaser works well on engine parts and tools.","zh":"这种去油剂很适合用来清洗发动机零件和工具。"},{"en":"Be careful—some degreasers can damage painted surfaces.","zh":"要小心——有些去油剂可能会损坏油漆表面。"}]}],"synonyms":["grease remover","degreasing agent","cleaner"],"phonetic":"/diˈɡriːsər/","extraExplanation":["“de-”有“去除、消除”的意思（如：dehydrate 去除水分），而“grease”是“油脂、油污”。所以 degreaser 字面意思就是“去除油脂的东西”。","日常家用常见的是厨房用去油喷雾；工业场景（汽修、机械）可能会用更强力、偏碱性或含溶剂的除油剂。使用时通常需要戴手套、保持通风，并注意产品说明。"]}
{"word":"degreases","summary":{"en":"“Degreases” means removes grease or oil from something; it’s the third-person singular form of “degrease.”","zh":"“degreases”表示给某物去油/脱脂；是动词“degrease”的第三人称单数形式。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove grease, oil, or fatty residue from something (often as a cleaning or preparation step)","zh":"给……脱脂；去除……上的油脂/油污（常用于清洁或加工前处理）"},"examples":[{"en":"This detergent degreases metal parts before they are painted.","zh":"这种清洁剂在喷漆前给金属零件脱脂。"},{"en":"The mechanic degreases the engine to find the source of the leak.","zh":"修理工给发动机去油污，以便找出漏油的源头。"},{"en":"The recipe says to degrease the pan by pouring off the excess fat.","zh":"食谱说要把锅里的多余油脂倒掉来“脱脂”。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become free of grease or oil; to clean off grease (less common without an object)","zh":"（较少用法）变得无油；去油污（不带宾语时）"},"examples":[{"en":"After soaking overnight, the parts degrease more easily.","zh":"浸泡一夜后，这些零件更容易去油污。"}]}],"synonyms":["defat","clean","remove oil","de-oil","strip (oil/grease)"],"phonetic":"/diˈɡris/","extraExplanation":["“degrease”常见于工业/维修（degrease parts, degrease an engine）和烹饪语境（degrease the pan/sauce）。烹饪里它通常指把浮在表面的油脂撇掉或倒掉，而不是用强力清洁剂。"]}
{"word":"degreasing","summary":{"en":"Degreasing means removing grease or oily dirt, especially as a cleaning step before further work.","zh":"Degreasing 指“去油/除油”，把油脂或油污清除掉，常作为后续加工或清洁前的重要步骤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of removing grease or oily dirt from a surface (often before painting, plating, or repair)","zh":"去油（除油）的过程；把表面的油脂或油污去除（常用于喷漆、电镀或维修前）"},"examples":[{"en":"Degreasing is an important first step before painting metal.","zh":"在给金属上漆之前，去油是很重要的第一步。"},{"en":"The workshop uses steam cleaning for degreasing engine parts.","zh":"这家车间用蒸汽清洗来给发动机零件除油。"}]},{"partOfSpeech":"v.","definition":{"en":"removing grease or oil from something (the -ing form of “degrease”)","zh":"正在给某物去油、除油（动词 degrease 的 -ing 形式）"},"examples":[{"en":"She is degreasing the pan with hot water and dish soap.","zh":"她用热水和洗洁精给平底锅去油。"},{"en":"We’re degreasing the surface so the tape will stick better.","zh":"我们正在给表面除油，这样胶带会粘得更牢。"}]},{"partOfSpeech":"adj.","definition":{"en":"used to describe a product or action meant for removing grease","zh":"（作定语）用于去油的；除油用的"},"examples":[{"en":"Use a degreasing spray to clean the stove top.","zh":"用去油喷雾来清洁灶台。"},{"en":"This degreasing step helps the coating last longer.","zh":"这一步除油处理能让涂层更耐久。"}]}],"synonyms":["oil removal","cleaning","defatting","degrease (verb)"],"phonetic":"/diˈɡrisɪŋ/","extraExplanation":["在日常清洁里，degreasing 常指用洗洁精、热水去油；在工业场景里则可能涉及溶剂（solvent）、碱性清洗剂或超声波清洗。","安全提示：一些工业去油剂挥发性强、易燃或刺激皮肤/呼吸道；按说明通风、戴手套会更安全。"]}
{"word":"degree","summary":{"en":"Degree most commonly means a level/amount of something, and it can also mean a university qualification or a unit for temperature/angles.","zh":"Degree最常见意思是“程度”，也可指“学位”以及“（温度/角度的）度”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a level or amount of something (how much something exists or is done)","zh":"程度；（某事的）水平、强度或数量"},"examples":[{"en":"I agree with you to some degree, but not completely.","zh":"我在某种程度上同意你，但并不完全同意。"},{"en":"The pain decreased in degree after the medicine.","zh":"吃了药后，疼痛的程度减轻了。"}]},{"partOfSpeech":"n.","definition":{"en":"a qualification given by a college or university after completing a course of study","zh":"（大学）学位；学历证书"},"examples":[{"en":"She earned a degree in computer science.","zh":"她获得了计算机科学学位。"},{"en":"A college degree can open more job opportunities.","zh":"大学学位可能会带来更多工作机会。"}]},{"partOfSpeech":"n.","definition":{"en":"a unit for measuring temperature or angles","zh":"度（温度单位或角度单位）"},"examples":[{"en":"It’s 30 degrees outside today.","zh":"今天外面有30度。"},{"en":"Turn the knob 90 degrees to the right.","zh":"把旋钮向右转90度。"}]},{"partOfSpeech":"n.","definition":{"en":"a step or rank in a scale, system, or family relationship","zh":"等级；层级；（亲属关系的）辈分/亲等"},"examples":[{"en":"The job requires a high degree of responsibility.","zh":"这份工作需要很高程度的责任感。"},{"en":"A first-degree relative includes your parents and children.","zh":"一级亲属包括你的父母和子女。"}]}],"synonyms":["level","extent","amount","qualification","diploma"],"phonetic":"/dɪˈɡriː/","extraExplanation":["“to some degree / to a degree”常用来表达“在一定程度上”，语气比“a little”更正式一些。","“degree”也可用于固定搭配：a high/low degree of + 名词（如 confidence, risk, accuracy），表示“很高/很低程度的……”。","文学或正式写作中常见：It matters not in the least degree.（丝毫也不重要。）这里的“degree”强调“哪怕一点点”。"]}
{"word":"degree-five","summary":{"en":"“Degree-five” usually means “level 5 / fifth-degree,” depending on the system; in music it can mean the fifth scale degree (the dominant).","zh":"“degree-five”通常指“第5级/五级（fifth-degree）”，具体取决于分级体系；在乐理中也可指“第五级音（属音）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(In ratings or classifications) level 5; the fifth level in a numbered system (often written “degree five” or “fifth-degree”).","zh":"（分级/分类体系中）第5级；编号体系里的第五个等级（常写作 degree five 或 fifth-degree）。"},"examples":[{"en":"The chart uses degree-five as the highest risk category.","zh":"这张图表把第5级（degree-five）作为最高风险等级。"},{"en":"He was charged with a fifth-degree offense (degree five in that system).","zh":"他被指控为五级罪行（在该体系里相当于第5级）。"}]},{"partOfSpeech":"n.","definition":{"en":"(Music theory) the fifth scale degree (the “dominant”) of a major or minor scale.","zh":"（乐理）音阶的第五级音（属音，dominant）。"},"examples":[{"en":"In C major, the degree-five chord is built on G.","zh":"在C大调中，第五级和弦建立在G音上。"},{"en":"Many songs move from degree five back to degree one to sound resolved.","zh":"很多歌曲会从第五级走回一级，让听感更“回到主音”、更稳定。"}]}],"synonyms":["fifth-degree","degree five","level five","grade five"],"phonetic":"/dɪˈɡri faɪv/","extraExplanation":["“degree-five”这种带连字符的写法在英文里不算固定常见，更自然的表达通常是：degree five（名词短语）或 fifth-degree（作形容词，修饰名词，如 fifth-degree burn）。","“degree”在英语中常表示“程度/等级/学位/角度（角度单位）”。与数字连用时，具体含义取决于语境：风险分级、犯罪分级、伤害分级、或乐理中的“音级”等。"]}
{"word":"degree-four","summary":{"en":"“Degree-four” usually means “fourth-degree”: level 4 in a severity or classification system.","zh":"“degree-four”通常表示“fourth-degree（四级/第四度）”：分级体系中的第4级（如严重程度、分类等级等）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Less common form) the same idea as “fourth-degree”: at level 4 in a system that measures severity, intensity, or relationship distance.","zh":"（不太常见的写法）与“fourth-degree（四级/第四度）”同义：在某种分级体系中属于第4级，用来表示严重程度、强度或亲属关系远近等。"},"examples":[{"en":"The patient suffered a fourth-degree burn (sometimes written as degree-four in technical notes).","zh":"病人遭受了第四度烧伤（有时在技术记录里也会写成 degree-four）。"},{"en":"In some legal systems, “fourth-degree” can describe a less severe category of a crime.","zh":"在一些法律体系中，“fourth-degree（第四级）”可用来表示较轻的一类犯罪。"}]},{"partOfSpeech":"n.","definition":{"en":"Level 4 in a classification system (often written as “the fourth degree”).","zh":"某个分级体系中的第4级（常写作“the fourth degree/第四级”）。"},"examples":[{"en":"This condition is classified as the fourth degree.","zh":"这种情况被归为第四级。"}]}],"synonyms":["fourth-degree","degree 4","level 4"],"phonetic":"/fɔrθ dɪˈɡri/","extraExplanation":["“degree-four”这种倒装写法在日常英语里不常见；更自然的表达通常是“fourth-degree + 名词”（如 fourth-degree burn 第四度烧伤）或“the fourth degree”（如 classified as the fourth degree）。","连字符（-）常用于把“fourth-degree”作为一个整体形容词放在名词前：fourth-degree burn / fourth-degree relative（四等亲）。如果放在名词后面，常直接写 fourth degree：a burn of the fourth degree。"]}
{"word":"degree-holding","summary":{"en":"“Degree-holding” means having an academic degree.","zh":"“degree-holding”表示“拥有学位的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having an academic degree (especially from a college or university).","zh":"拥有学位的（尤指大学或学院颁发的学位）。"},"examples":[{"en":"The company prefers degree-holding applicants for this role.","zh":"这家公司更偏好拥有学位的申请者来担任这个职位。"},{"en":"In many countries, degree-holding teachers may earn higher salaries.","zh":"在许多国家，拥有学位的教师可能收入更高。"}]}],"synonyms":["college-educated","degree-qualified","degreed","credentialed"],"phonetic":"/dɪˈɡriː ˌhoʊldɪŋ/","extraExplanation":["“degree-holding”是一个复合形容词，常用连字符连接，尤其在它放在名词前作定语时（a degree-holding worker）。如果放在系动词后作表语，也可以写成不加连字符的形式：He is degree holding / He holds a degree（更自然）。","语气上较偏正式、书面，日常表达更常用：“has a degree”“college-educated”“degree holder（名词）”。"]}
{"word":"degreed","summary":{"en":"“Degreed” means having an academic degree, often used in formal or job-related contexts.","zh":"“Degreed”表示“有（大学）学位的”，常用于正式或招聘语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having an academic degree (such as a bachelor’s, master’s, or doctorate)","zh":"拥有（大学）学位的（如学士、硕士或博士）"},"examples":[{"en":"The job requires a degreed accountant.","zh":"这份工作要求应聘者是有学位的会计。"},{"en":"She is a degreed engineer with five years of experience.","zh":"她是一名拥有学位的工程师，有五年经验。"},{"en":"Our hospital prefers degreed nurses for leadership roles.","zh":"我们医院更倾向于让有学位的护士担任管理岗位。"}]}],"synonyms":["degree-holding","college-educated","credentialed","qualified"],"phonetic":"/dɪˈɡrid/","extraExplanation":["“degreed”在美式英语里常见于招聘或正式场合，强调“有正规学位”，带一点“符合资格/具备认证背景”的意味。口语里也常直接说“has a degree / college-educated”。","常见搭配：degreed professional（有学位的专业人士）, degreed engineer/accountant/nurse（有学位的工程师/会计/护士）。有时也会写作“degree-holding”。"]}
{"word":"degreeing","summary":{"en":"“Degreeing” usually means dividing or adjusting something by degrees; less commonly, it can mean awarding academic degrees.","zh":"“degreeing”通常指按程度分级或做渐变调整；较少情况下也可指授予（颁发）学位。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Present participle of “degree”) arranging or dividing something into levels, degrees, or gradations.","zh":"（动词 degree 的现在分词）把某物按等级/程度分层、分级或划分为不同程度。"},"examples":[{"en":"The program is degreeing risk levels from low to high.","zh":"该项目正在把风险等级从低到高进行分级。"},{"en":"The designer is degreeing the colors to create a smooth transition.","zh":"设计师正在把颜色做成渐变过渡。"}]},{"partOfSpeech":"v.","definition":{"en":"(Less common) granting academic degrees; awarding degrees.","zh":"（较少见）授予学位；颁发学位。"},"examples":[{"en":"The university is degreeing a record number of graduates this year.","zh":"这所大学今年授予学位的人数创纪录。"},{"en":"They are degreeing students in engineering and nursing.","zh":"他们正在向工程和护理专业的学生授予学位。"}]}],"synonyms":["grading","scaling","calibrating","graduating","awarding degrees"],"phonetic":"/dɪˈɡriːɪŋ/","extraExplanation":["“degreeing”在日常英语里不算常见；表达“授予学位”时更自然的说法通常是“granting degrees / awarding degrees / conferring degrees”。","如果你想表达“按程度调整/分级”，也常用“grading / scaling / calibrating”（取决于语境，如评分、尺度调整、校准等）。"]}
{"word":"degreeless","summary":{"en":"“Degreeless” means not having an academic degree.","zh":"“degreeless”指没有（大学）学位的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"without a college/university degree; not having an academic qualification","zh":"（人）没有大学学位的；无学位的"},"examples":[{"en":"Some companies now hire talent from nontraditional, degreeless backgrounds.","zh":"一些公司现在会从非传统的、无学位背景中招聘人才。"},{"en":"She built a successful career despite being degreeless.","zh":"尽管没有学位，她仍然建立了成功的职业生涯。"},{"en":"The program supports degreeless workers who want to reskill.","zh":"该项目支持想要提升技能的无学位劳动者。"}]}],"synonyms":["without a degree","no-degree","non-degree-holding","nondegree","uncredentialed"],"phonetic":"/dɪˈɡriːləs/","extraExplanation":["“degreeless”不是很常见，更常见、更自然的说法是：without a degree / non-degree / non-degree-holding / no-degree。","它多出现在教育、就业、劳动力市场讨论中，用来强调“没有学位”这一身份标签；在日常口语里通常直接说“doesn’t have a degree”。","注意语气：给人贴“degreeless”标签有时会显得生硬或带评价色彩；更中性的表达往往更合适。"]}
{"word":"degrees","summary":{"en":"“Degrees” can mean academic qualifications, measurement units (temperature/angles), or levels/extent of something.","zh":"“Degrees”可指学位、温度/角度的“度”，或某事的程度/幅度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a qualification awarded by a college or university (plural of “degree”), such as a bachelor’s or master’s.","zh":"（学位）大学或学院授予的资格证书（degree 的复数），如学士、硕士等。"},"examples":[{"en":"She has two degrees: one in biology and one in education.","zh":"她有两个学位：一个是生物学，一个是教育学。"},{"en":"Many jobs require a college degree, but some value experience more.","zh":"很多工作要求大学学位，但也有些更看重经验。"}]},{"partOfSpeech":"n.","definition":{"en":"units used to measure temperature or angles (plural of “degree”).","zh":"（度）用来测量温度或角度的单位（degree 的复数）。"},"examples":[{"en":"It was 90 degrees outside today.","zh":"今天外面有90华氏度。"},{"en":"Turn the camera 15 degrees to the left.","zh":"把相机向左转15度。"}]},{"partOfSpeech":"n.","definition":{"en":"levels or amounts of something; extent (often used in “degrees of …”).","zh":"（程度）某事物的等级/程度/幅度（常用于“degrees of …”）。"},"examples":[{"en":"People feel stress in different degrees.","zh":"人们感受到的压力程度不同。"},{"en":"The two plans are similar, but they differ in degrees of risk.","zh":"这两个方案相似，但风险程度不同。"}]}],"synonyms":["qualifications","diplomas","temperature units","angle units","levels","extent"],"phonetic":"/dɪˈɡriz/","extraExplanation":["“degree”既可以指“学位”，也可以指“温度/角度的度”。温度里常见写法有 20°C（摄氏度）或 68°F（华氏度）；角度常用符号“°”，如 45°。","表示“程度”时常见搭配：to some degree（在某种程度上）、to a degree（某种程度上）、in varying degrees（程度不一）。"]}
{"word":"degreewise","summary":{"en":"Degreewise means “gradually, by degrees.”","zh":"degreewise 表示“逐步地、按程度地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"Gradually; little by little, in stages or degrees.","zh":"逐步地；一点一点地，按阶段或程度地。"},"examples":[{"en":"The temperature rose degreewise throughout the morning.","zh":"气温在整个上午逐步上升。"},{"en":"She improved degreewise with daily practice.","zh":"她通过每天练习逐步进步。"},{"en":"We introduced the new rules degreewise to avoid confusion.","zh":"我们逐步引入新规则以避免混乱。"}]}],"synonyms":["gradually","by degrees","step by step","little by little","incrementally"],"phonetic":"/dɪˈɡriːˌwaɪz/","extraExplanation":["“degreewise”在现代英语中比较少见，更常用的表达是“gradually / little by little / step by step / by degrees”。你可能会在较正式、较老派或学术写作中见到它，用来强调“按程度变化”的过程。"]}
{"word":"degression","summary":{"en":"Degression means a gradual decrease or decline, often used in more formal or technical writing.","zh":"Degression 指逐步减少、递减或回落，较常见于正式或技术性语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a gradual decrease; a step-by-step reduction in size, amount, level, or intensity","zh":"逐步减少；递减（在数量、程度、强度等方面逐渐下降）"},"examples":[{"en":"There was a slow degression in sales after the holiday season.","zh":"假期过后，销量出现了缓慢的递减。"},{"en":"The medication schedule includes a degression in dosage over two weeks.","zh":"该用药计划包括在两周内逐步减少剂量。"}]},{"partOfSpeech":"n.","definition":{"en":"(in some technical or academic contexts) a downward movement or step away from a previous level; decline","zh":"（在某些学术/技术语境中）向下的变化；从原有水平回落；下降"},"examples":[{"en":"The report shows a degression in the trend starting in May.","zh":"报告显示该趋势从五月开始出现回落。"},{"en":"They discussed the degression of public interest over time.","zh":"他们讨论了公众兴趣随时间下降的现象。"}]}],"synonyms":["decrease","decline","reduction","diminution","drop"],"phonetic":"/dɪˈɡrɛʃən/","extraExplanation":["“Degression”在现代英语里相对少见，更常见、自然的表达通常是“decline / decrease / reduction”。在写作中如果想更地道，可以根据语境替换：例如用“a gradual decrease in sales（销量逐步下降）”。","词形上，它来自拉丁语前缀“de-（向下、减少）”加上表示“步/行进”的词根（与“progress 进步、advance 前进”的概念相对）。因此它带有“逐步往下走”的意象。"]}
{"word":"degressive","summary":{"en":"“Degressive” means decreasing in rate or effect as the base amount gets larger, commonly used in economics and taxation.","zh":"“degressive”表示“递减的”：随着基数变大，比例或边际效果变小，常用于经济与税收语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Decreasing in intensity, amount, or rate as something increases; often used for taxes, spending, or benefits where the percentage or effect becomes smaller at higher levels.","zh":"（随着某数量增加而）递减的；常用于税收、支出或福利等语境，表示水平越高，比例或边际效果越小。"},"examples":[{"en":"Some countries use a degressive tax rate for certain social contributions.","zh":"一些国家对某些社会保障缴费采用递减式税率。"},{"en":"The subsidy is degressive, so large firms receive a smaller percentage than small firms.","zh":"该补贴是递减式的，因此大企业获得的补贴比例比小企业更低。"}]}],"synonyms":["decreasing","diminishing","tapering"],"phonetic":"/dɪˈɡrɛsɪv/","extraExplanation":["“degressive”最常见于经济学、财政与公共政策写作中，尤其讨论“degressive tax（递减税/递减式税率）”或“degressive subsidy/benefit（递减式补贴/福利）”。它强调的是“比例/边际效果变小”，不一定表示“总额变小”。","易混词：progressive（累进的）指收入越高税率越高；regressive（累退的）通常指对低收入者负担更重的税制；degressive（递减的）多指税率/比例随基数上升而下降或上限封顶，语气更偏技术描述。"]}
{"word":"degressively","summary":{"en":"“Degressively” means ‘in a degressive way’: changes happen with smaller and smaller steps, often used in economics or policy.","zh":"“degressively”意为“以递减式（幅度逐步变小）的方式”，常用于经济、政策等语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a degressive way; increasing but at a decreasing rate, or changing so that each step is smaller than the one before.","zh":"以“递减式/递减幅度”的方式；总体可能仍在增加，但增长速度逐步放缓，或每一步的变化幅度都比前一步更小。"},"examples":[{"en":"The subsidy rises degressively: the first year’s increase is large, but later increases are smaller.","zh":"补贴以递减式增长：第一年的增幅很大，但之后每年的增幅更小。"},{"en":"Profits increased degressively over the quarter, showing slower momentum each month.","zh":"利润在本季度呈递减式增长，显示每个月的增长动能都在放缓。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a system where the rate or benefit becomes less favorable as the base amount (such as income or usage) gets larger.","zh":"以“递减优惠/递减比例”的方式；随着基数（如收入、用量）变大，优惠或比例变得不那么有利。"},"examples":[{"en":"The allowance is calculated degressively, so higher earners receive less support.","zh":"补助以递减方式计算，因此收入更高的人得到的支持更少。"},{"en":"Some programs reduce payments degressively as household income rises.","zh":"一些项目会随着家庭收入上升而递减式地减少发放金额。"}]}],"synonyms":["at a decreasing rate","with diminishing increments","in a diminishing way"],"phonetic":"/dɪˈɡrɛsɪvli/","extraExplanation":["“degressively”来自形容词“degressive”。在经济与政策语境中，它常指“逐步变缓/逐步递减”的机制：例如补贴或税收优惠在起点更大、后续增量变小，目的是控制成本或避免激励过强。","易混词：degressive ≠ regressive（累退的、逆向的）。degressive 常强调“仍在增加但增速放缓”或“优惠随基数变大而变弱”；regressive 更常指税负占比对低收入者更重的“累退税”。"]}
{"word":"degringolade","summary":{"en":"A degringolade is a sudden, dramatic downfall or collapse.","zh":"degringolade 指突然且戏剧性的崩塌式下滑或衰落。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sudden, steep decline or collapse (especially in status, power, quality, or the economy)","zh":"（尤指地位、权力、质量或经济的）突然、急剧下滑；崩塌式衰落"},"examples":[{"en":"After the scandal, the politician’s career went into a degringolade.","zh":"丑闻爆发后，这位政治家的事业出现了断崖式下滑。"},{"en":"The company tried to stop the degringolade in sales by cutting prices.","zh":"公司试图通过降价来阻止销量的急剧下滑。"},{"en":"She watched the team’s degringolade in the second half with disbelief.","zh":"她难以置信地看着球队在下半场一路崩盘。"}]}],"synonyms":["downfall","free fall","collapse","nose-dive","plunge","rapid decline"],"phonetic":"/ˌdeɪ.ɡrɪn.ɡəˈlɑːd/","extraExplanation":["这是一个法语借词（dégringolade），原义与“跌跌撞撞地滚落/摔下去”有关，所以在英文里常带有“失控、一路往下”的画面感与戏剧性语气。","在新闻、评论、文学性写作中更常见，比普通的 decline / downturn 更“强烈”，暗示下滑很快、幅度很大，甚至有点“崩盘”的意味。"]}
{"word":"degrowth-oriented","summary":{"en":"Supporting or guided by degrowth: prioritizing less production/consumption for sustainability and well-being.","zh":"去增长导向：主张减少生产与消费，以实现可持续与更好的社会福祉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Focused on or supporting “degrowth” ideas—reducing overall economic production and consumption to improve ecological sustainability and social well-being.","zh":"以“去增长/减增长（degrowth）”理念为导向的——主张减少总体经济产出与消费，以提升生态可持续性与社会福祉。"},"examples":[{"en":"The city adopted a degrowth-oriented transport plan that prioritizes walking, cycling, and public transit over car expansion.","zh":"这座城市采用了一个去增长导向的交通规划，优先发展步行、自行车和公共交通，而不是扩建汽车道路。"},{"en":"Her research looks at degrowth-oriented policies such as shorter workweeks and lower resource use.","zh":"她的研究关注去增长导向的政策，例如缩短工时和降低资源消耗。"}]}],"synonyms":["degrowth-focused","post-growth","anti-growth","sustainability-oriented"],"phonetic":"/ˈdiːˌɡroʊθ ˈɔːriˌɛntɪd/","extraExplanation":["“Degrowth（去增长/减增长）”是一种社会与经济思想流派，强调在生态边界内生活：减少高收入国家的资源与能源吞吐量，推动更公平的分配与更高的生活质量。","“Degrowth-oriented”常见于学术与政策讨论，语气通常较中性；在不同语境中也可能带有价值立场（赞同或批评）。写作时可用具体措施来说明，如“resource caps（资源上限）/ shorter workweek（更短工时）/ repair and reuse（修理与再利用）”。"]}
{"word":"degu","summary":{"en":"A degu is a small, social South American rodent sometimes kept as a pet.","zh":"degu 指一种南美洲的小型、群居啮齿动物，有时作为宠物饲养。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small South American rodent (Octodon degus) that looks a bit like a large gerbil; it is social and is sometimes kept as a pet","zh":"一种南美洲的小型啮齿动物（学名 Octodon degus），外形有点像较大的沙鼠；群居，有时被当作宠物饲养"},"examples":[{"en":"Degus are very social animals and do best in pairs or groups.","zh":"八齿鼠非常合群，成对或成群饲养通常更适合。"},{"en":"The degu has a long tail with a small tuft at the end.","zh":"八齿鼠尾巴较长，尾端有一小撮毛。"},{"en":"Some people keep degus as pets, but they need space and mental stimulation.","zh":"有人把八齿鼠当宠物养，但它们需要足够的空间和丰富的刺激。"}]}],"synonyms":["Octodon degus","degu rat (less common)"],"phonetic":"/ˈdiːɡuː/","extraExplanation":["“degu”来自西班牙语（智利地区常用名），主要分布在智利等南美地区。","复数通常直接加 -s：degu → degus。","它们常被误认为“沙鼠/仓鼠”，但其实是不同的啮齿类；而且对糖比较敏感，宠物饲养时饮食需要注意（避免高糖）。"]}
{"word":"Deguelia","summary":{"en":"Deguelia is a scientific genus name for certain tropical legume plants, some of which contain rotenone and were traditionally used to stun fish.","zh":"Deguelia 是某些热带豆科植物的属名，其中一些物种含鱼藤酮，传统上可用于麻鱼捕鱼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical legume plants (family Fabaceae), including several vine-like species whose roots were traditionally used to stun fish because they contain rotenone.","zh":"豆科（Fabaceae）的一个热带植物属（多为藤本），其中一些物种的根含鱼藤酮（rotenone），传统上可用来“麻鱼/毒鱼”以便捕捞。"},"examples":[{"en":"In some tropical regions, people used Deguelia roots to make a fish-stunning mixture in streams.","zh":"在一些热带地区，人们会用 Deguelia 的根制作麻鱼的混合物，在小溪里便于捕鱼。"},{"en":"Researchers sometimes mention Deguelia when discussing plant sources of rotenone.","zh":"研究人员在讨论鱼藤酮的植物来源时，有时会提到 Deguelia。"}]}],"synonyms":["Deguelia (genus)","rotenone-producing legumes (contextual)"],"phonetic":"/dəˈɡwiːliə/","extraExplanation":["“Deguelia”是植物学上的拉丁学名，日常英语里并不常见，多出现在学术论文、植物名录或农药/天然产物相关资料中。","分类学上不同资料可能会把某些 Deguelia 物种并入或与其他近缘属混用（如 Lonchocarpus、Derris 等），因此在阅读文献时常会看到名称变动或同物异名。","鱼藤酮（rotenone）曾被用作杀虫剂或渔业用途，但由于对鱼类和其他生物可能有毒性、也涉及环境与健康风险，在许多地区使用受到严格限制或监管。"]}
{"word":"deguelia","summary":{"en":"Deguelia is a genus of tropical climbing legume plants; some species are known for traditional fish-poison and insecticidal uses.","zh":"Deguelia 是一种热带攀援豆科植物的属名；部分种类以传统毒鱼与杀虫用途而为人所知。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical climbing plants in the pea family (Fabaceae), found mainly in Africa and Asia; some species have been used traditionally as fish poison and as sources of insecticidal compounds.","zh":"蝶形花科（豆科）的一属热带藤本植物，主要分布于非洲与亚洲；其中一些种传统上被用作“毒鱼”或提取杀虫活性成分。"},"examples":[{"en":"Deguelia species are climbing legumes that grow in warm, humid forests.","zh":"Deguelia 属的植物是攀援性的豆科植物，常生长在温暖潮湿的森林里。"},{"en":"Some communities historically used extracts from Deguelia roots to stun fish in small streams.","zh":"一些社群在历史上会用 Deguelia 根部的提取物在小溪里“麻翻”鱼类以便捕捞。"}]}],"synonyms":["(taxonomic context) genus name","(related in older sources) Derris (partly)"],"phonetic":"/dəˈɡwiːliə/","extraExplanation":["“Deguelia”是植物学上的拉丁学名（属名），日常英语里不常见，更多出现在植物分类、生态学或药用/农用植物的资料中。","该属与“鱼藤”(常见于旧文献中的属名 Derris)在分类与民间用途上常被并提；一些相关植物含有鱼藤酮（rotenone）等成分，过去用于杀虫或毒鱼，但现代使用受到环境与安全规范限制。","作为学名通常首字母大写并斜体书写：*Deguelia*。若指某个物种，会写成“*Deguelia* + 种加词”（如 *Deguelia* sp. 表示未确定到种）。"]}
{"word":"deguelin","summary":{"en":"Deguelin is a plant-derived chemical compound studied for anti-cancer potential and known for insecticidal activity.","zh":"Deguelin 是一种植物来源的天然化合物，因潜在抗癌作用而被研究，也具有杀虫活性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a naturally occurring chemical compound (a rotenoid) found in some plants, studied for possible anti-cancer effects and also known for insecticidal activity","zh":"一种天然存在的化学化合物（鱼藤酮类/rotenoid），存在于某些植物中；因可能的抗癌作用而被研究，也具有杀虫活性"},"examples":[{"en":"Researchers studied deguelin for its potential to slow the growth of certain cancer cells.","zh":"研究人员研究了 deguelin，观察它是否可能减缓某些癌细胞的生长。"},{"en":"Deguelin is a plant-derived compound, so it is often discussed in the context of natural pesticides and medicinal research.","zh":"Deguelin 属于植物来源的化合物，因此常在“天然农药”和“药物研究”的语境中被讨论。"}]}],"synonyms":["rotenoid","plant-derived compound","natural insecticide compound"],"phonetic":"/dɛˈɡjuːlɪn/","extraExplanation":["Deguelin 常被归为“鱼藤酮类（rotenoids）”天然产物，来源与某些豆科植物有关；在科学文献中多出现在药理学、毒理学与农业杀虫相关研究里。","它不是日常英语高频词，更常见于论文、实验报告和科普文章中；一般不用于日常口语对话。","关于安全性：一些同类天然杀虫成分可能对人和动物有毒性风险，因此相关使用与研究通常需要严格的实验与法规条件。"]}
{"word":"degum","summary":{"en":"Degum means to remove gum or gummy substances, especially from fibers like silk before processing.","zh":"Degum 指去除胶质或黏性物，尤其常用于纺织中对丝等纤维“脱胶”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove gum or gummy substances from something (especially from yarn, silk, or other fibers before further processing)","zh":"去胶；脱胶（尤指把纱线、丝等纤维上的胶质去除，以便后续加工）"},"examples":[{"en":"The raw silk must be degummed before it can be dyed evenly.","zh":"生丝在均匀染色之前必须先脱胶。"},{"en":"This process helps degum the fibers and makes the fabric feel softer.","zh":"这个工序能帮助纤维脱胶，让布料手感更柔软。"}]},{"partOfSpeech":"vt.","definition":{"en":"to remove stuck gum or sticky residue from a surface","zh":"清除口香糖或黏性残留物"},"examples":[{"en":"The cleaner used a special solvent to degum the floor.","zh":"清洁人员用一种特殊溶剂把地板上的口香糖残留清除掉。"}]}],"synonyms":["deglue","remove gum","clean off","strip (off)"],"phonetic":"/diˈɡʌm/","extraExplanation":["“degum”由前缀 de-（表示“去除、除去”）+ gum（胶质/黏性物）构成，在纺织领域更常见，尤其指去除丝胶（sericin），让丝更柔软、便于染色和加工。日常英语里更常用的是“remove gum / get gum off”。"]}
{"word":"degum-treated","summary":{"en":"“Degum-treated” describes silk/fibers that have been treated to remove natural gum (sericin).","zh":"“degum-treated”指丝绸/纤维经过脱胶处理，去除了天然胶质（丝胶）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of silk or other fibers) processed to remove natural “gum” (especially sericin), usually to make the material softer, smoother, and more lustrous.","zh":"（多指丝绸或纤维）经过“脱胶”处理，去除天然胶质（尤指丝胶），通常使面料更柔软、光滑并更有光泽。"},"examples":[{"en":"Degum-treated silk feels softer and drapes better than raw silk.","zh":"脱胶处理过的丝绸比生丝更柔软，垂坠感也更好。"},{"en":"The label says the fabric is degum-treated, so it may shrink slightly after washing.","zh":"标签写着面料经过脱胶处理，所以洗涤后可能会有轻微缩水。"}]}],"synonyms":["degummed","degumming-treated","sericin-removed"],"phonetic":"/diˈɡʌm ˌtriːtɪd/","extraExplanation":["“Degum-treated”常见于纺织与服装语境，尤其是丝绸。生丝（raw silk）含有丝胶（sericin），会让触感偏硬、略“涩”；脱胶后更接近我们日常见到的柔软真丝。","近义表达可见：degummed、degumming-treated、fully degummed。与之相对的常见说法：raw silk（生丝）、gummed silk（含胶丝）。"]}
{"word":"degummed","summary":{"en":"Degummed means the natural gum-like coating has been removed, especially from silk.","zh":"Degummed 指“已去胶/已脱胶的”，尤其用于描述丝绸去除了天然胶质涂层。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having had gum or gummy substances removed (especially silk after the natural coating is washed off)","zh":"已去胶的；（尤指丝绸）已脱胶的（去除了天然胶质涂层）"},"examples":[{"en":"Degummed silk feels softer and takes dye more evenly.","zh":"脱胶后的丝绸手感更柔软，也更容易均匀上色。"},{"en":"The manufacturer sells both raw silk and degummed silk fabric.","zh":"厂家同时出售生丝和脱胶丝绸面料。"},{"en":"After degumming, the fibers looked cleaner under the microscope.","zh":"脱胶后，在显微镜下纤维看起来更干净。"}]}],"synonyms":["degum-treated","de-gummed","gum-free"],"phonetic":"/diˈɡʌmd/","extraExplanation":["“Degummed”多见于纺织与材料领域，最常指丝绸的“脱胶”：把丝纤维外层的丝胶蛋白（sericin，起到“黏合/保护”作用）去除，留下更光滑的丝素蛋白（fibroin）。","相关动词是“degum”（脱胶）；工艺上常用温水/肥皂或温和化学方法去除“gum”。日常生活中不常用，但在面料说明、科研论文、工厂流程里很常见。"]}
{"word":"degummer","summary":{"en":"A degummer is something (or someone) that removes gum-like impurities or sticky substances, especially in industrial processing (e.g., oil degumming).","zh":"degummer 指用于去除胶质杂质或黏性物质的设备/工序（有时也指人或工具），常见于工业加工，如食用油脱胶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A machine, chemical, or process used to remove gum-like substances (such as natural gums, resins, or phospholipids) from a material.","zh":"用于从材料中去除“胶质”物质（如天然树胶、树脂或磷脂等）的设备、化学品或工序。"},"examples":[{"en":"In oil processing, a degummer helps remove phospholipids so the oil stays clear and stable.","zh":"在食用油加工中，degummer 用来去除磷脂，使油更清澈、更稳定。"},{"en":"The factory installed a new degummer to improve the quality of the refined product.","zh":"工厂安装了新的 degummer，以提高精炼产品的质量。"}]},{"partOfSpeech":"n.","definition":{"en":"A person or tool that removes gum or sticky residue from something.","zh":"去除胶质或黏性残留物的人或工具。"},"examples":[{"en":"A degummer cleaned the sticky residue from the rollers before the next batch.","zh":"degummer 在下一批生产前把滚筒上的黏性残留清理干净。"}]}],"synonyms":["degumming unit","degumming machine","gum remover","cleaner"],"phonetic":"/diˈɡʌmər/","extraExplanation":["“Degummer”来自动词“degum”（去胶、脱胶）。在不同产业里“gum”指的东西不同：\n- 食用油/生物柴油：常见是“磷脂（phospholipids）”等胶质杂质，工序叫“degumming”。\n- 纺织（如丝绸）：可指去除丝胶（sericin）的“脱胶”。\n因此遇到该词时，最好结合行业语境理解。"]}
{"word":"degumming","summary":{"en":"Degumming is the process of removing gum-like substances or sticky impurities, especially from silk or crude vegetable oils.","zh":"Degumming 指去除材料中的胶质或黏性杂质的工序，尤常见于丝绸脱胶与植物油脱胶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of removing natural gum or sticky impurities from a material (especially removing sericin from silk before dyeing/finishing)","zh":"脱胶；去胶处理（尤指在染整前去除丝绸中的丝胶蛋白 sericin）"},"examples":[{"en":"Degumming makes silk softer and improves how evenly it takes dye.","zh":"脱胶会让丝绸更柔软，也能让染色更均匀。"},{"en":"After degumming, the fabric is washed and then dyed.","zh":"脱胶后，面料会被清洗，然后再进行染色。"}]},{"partOfSpeech":"n.","definition":{"en":"the step of removing gums (e.g., phospholipids) from crude vegetable oils to improve clarity and stability","zh":"油脂脱胶（从毛油中去除胶质，如磷脂，以提升澄清度与稳定性）"},"examples":[{"en":"The refinery uses water degumming to reduce phospholipids in soybean oil.","zh":"炼油厂用水化脱胶来降低豆油中的磷脂含量。"},{"en":"Degumming is often followed by neutralization and deodorization.","zh":"脱胶之后常接着进行中和和脱臭。"}]}],"synonyms":["gum removal","de-gumming process","desericinization (silk)","oil degumming"],"phonetic":"/diːˈɡʌmɪŋ/","extraExplanation":["“Degumming”多用于两个行业语境：①纺织/丝绸加工：去除丝胶（sericin），保留丝素蛋白（fibroin），让手感更柔、光泽更好、染色更稳定；②食用油精炼：去除“胶质”（常指磷脂等），减少浑浊与沉淀，提高货架期。日常英语里较少单独使用，多出现在工艺说明、科研或行业文件中。"]}
{"word":"degums","summary":{"en":"“Degum” means to remove gummy substances (or sericin from silk), usually in industrial or textile processing.","zh":"“degum”表示脱胶：去除材料中的胶质/树脂等黏性物质；在丝绸工艺中指去除丝胶。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove gum, resin, or other gummy substances from something (especially in industrial processing)","zh":"（尤指工业加工中）去除……中的胶质/树脂等黏性物质"},"examples":[{"en":"The factory degums crude soybean oil before further refining.","zh":"工厂会先对粗大豆油进行脱胶处理，再进行后续精炼。"},{"en":"This method degums the fibers so they can be dyed more evenly.","zh":"这种方法能给纤维脱胶，使其染色更均匀。"}]},{"partOfSpeech":"vt.","definition":{"en":"to remove sericin (the natural gum) from silk to make it softer and shinier","zh":"（丝绸工艺）给生丝脱胶，去除丝胶（丝胶蛋白），使丝更柔软、有光泽"},"examples":[{"en":"After the silk is degummed, it feels much smoother against the skin.","zh":"丝绸脱胶后，贴肤会更顺滑。"},{"en":"Some delicate fabrics should be degummed gently to avoid damage.","zh":"一些娇贵面料脱胶要更温和，以免损伤。"}]}],"synonyms":["refine","purify","de-resin","process"],"phonetic":"/diˈɡʌm/","extraExplanation":["“degums”通常是动词“degum”的第三人称单数（he/she/it degums）或复数名词形式的误读；在真实语境里更常见的是动词用法：degum / degummed / degumming。","该词多用于专业或工艺语境（食用油精炼“脱胶”、纺织/丝绸“脱胶”），日常口语里不常用。"]}
{"word":"degust","summary":{"en":"Degust (rare) means to taste or sample food/drink carefully, especially for evaluation.","zh":"degust（较少用）指仔细品尝或试味食物/饮料，尤指为了评判风味。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare) to taste food or drink carefully, especially to judge its flavor; to sample.","zh":"（较少用）仔细品尝（食物或饮料），尤指为了评判其风味；试味。"},"examples":[{"en":"At the winery, guests can degust several small pours before choosing a bottle.","zh":"在酒庄里，客人可以先试味几小杯，再决定买哪一瓶。"},{"en":"The chef asked us to degust the sauce and tell him if it needed more salt.","zh":"主厨让我们试尝酱汁，告诉他是否需要再加点盐。"}]}],"synonyms":["taste","sample","try","sip","savor"],"phonetic":"/diˈɡʌst/","extraExplanation":["“degust”在现代英语中很少单独使用，更常见的是名词“degustation”（品鉴、试吃会），尤其出现在美食、葡萄酒语境中。","词根来自拉丁语 *gust-*（品尝、味觉），同源词还有：*gust*（味觉/享受）、*disgust*（厌恶，原义与“味道不佳”有关）。日常表达里通常用 *taste* / *sample* / *try* 来代替。"]}
{"word":"degustate","summary":{"en":"“Degustate” means to taste or sample food/drink, usually in a careful, evaluative way.","zh":"“degustate”指品尝或试饮食物/饮料，常带有认真品鉴、评估风味的意思。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to taste or sample (food or drink), often carefully and with attention to flavor","zh":"品尝；试吃/试饮（常指认真地辨别味道）"},"examples":[{"en":"At the winery, visitors can degustate several local wines.","zh":"在酒庄，游客可以品尝几款本地葡萄酒。"},{"en":"The chef invited us to degustate the new soup and share feedback.","zh":"厨师邀请我们试喝新汤并提出反馈。"}]}],"synonyms":["taste","sample","savor"],"phonetic":"/dɪˈɡʌsteɪt/","extraExplanation":["“degustate”来自拉丁语 *degustare*（de- + gustare“品尝”）。在现代英语中它较少见，语气偏正式，常见于美食/葡萄酒等“品鉴”语境。日常更常用的说法是 **taste** 或 **sample**。","相关词：**degustation**（n. 品鉴/试吃会，常指多道菜或多款酒的品尝活动）。"]}
{"word":"degustation","summary":{"en":"A degustation is a formal tasting of small portions of food or drink, often as a tasting menu or guided wine tasting.","zh":"Degustation 指正式的品鉴：以小份量多道菜/多款酒进行系统试吃试饮的活动或菜单。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a formal tasting of several small samples of food or drink (especially wine), often arranged as a menu or guided event","zh":"（正式的）品鉴会；（通常指葡萄酒等的）多道/多款小份量试吃试饮"},"examples":[{"en":"The restaurant offers a five-course degustation menu.","zh":"这家餐厅提供五道式品鉴菜单。"},{"en":"We booked a wine degustation to learn how different regions affect flavor.","zh":"我们预订了葡萄酒品鉴，想了解不同产区如何影响风味。"}]}],"synonyms":["tasting","tasting menu","wine tasting","sampler"],"phonetic":"/ˌdiː.ɡʌˈsteɪ.ʃən/","extraExplanation":["“degustation”多见于英式/国际餐饮语境（高端餐厅、酒庄、活动介绍）。在美式英语里也会用，但更常见的说法是“tasting”或“tasting menu”。","词源来自拉丁语/法语传统，核心含义就是“仔细品尝、鉴别风味”。因此它往往带有更“正式、讲究步骤和搭配”的感觉，而不只是随便试吃。"]}
{"word":"degusted","summary":{"en":"“Degusted” is a rare word meaning “tasted carefully,” often used in food or wine contexts.","zh":"“degusted”较少见，意为“细细品尝”，常用于美食或品酒语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare) past tense/past participle of “degust”: to taste food or drink carefully, especially in a formal or professional way (e.g., wine tasting).","zh":"（较少用）“degust”的过去式/过去分词：细细品尝（食物或饮料），尤指正式或专业场合（如品酒）。"},"examples":[{"en":"The guests degusted several wines before choosing one for dinner.","zh":"客人在选择晚餐用酒之前，细细品尝了几款葡萄酒。"},{"en":"Each sauce was degusted and compared for balance and aroma.","zh":"每一种酱汁都被仔细品尝并比较其平衡度与香气。"}]}],"synonyms":["tasted","sampled","savored"],"phonetic":"/dɪˈɡʌstɪd/","extraExplanation":["“degust”来自法语/拉丁语词源，常见于美食、品酒语境；更常见的名词是“degustation”（品鉴/试吃）。","很多学习者会把“degusted”看成“disgusted（感到厌恶的）”。如果你想表达“我感到恶心/反感”，通常应使用“disgusted”。"]}
{"word":"degusting","summary":{"en":"“Degusting” is a rare word meaning “tasting carefully (often wine/food) to judge flavor.”","zh":"“degusting”较少见，意思是“细细品尝/品鉴（常指酒或食物）以判断风味”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare) tasting food or drink carefully to judge its flavor; sampling, especially in wine or food contexts.","zh":"（罕见）细细品尝（食物或饮料）以评估味道；品鉴、试饮（常用于葡萄酒或美食语境）。"},"examples":[{"en":"The guests were degusting several wines before choosing a bottle.","zh":"客人在决定买哪瓶之前，先品鉴了几款葡萄酒。"},{"en":"She spent the afternoon degusting cheeses at the market.","zh":"她下午在市场里品鉴了各种奶酪。"}]}],"synonyms":["tasting","sampling","doing a tasting"],"phonetic":"/diˈɡʌstɪŋ/","extraExplanation":["“degusting”来自动词“degust”（品尝、品鉴），源自拉丁语 *degustare*（尝一尝）。在日常英语里很少用，更常见的说法是“taste / sample / do a tasting”。","学习者容易把“degusting”与“disgusting（令人恶心的）”混淆：两者拼写相近，但意思完全相反。若你想表达“很恶心/太难吃了”，通常应写“disgusting”。"]}
{"word":"degusts","summary":{"en":"“Degusts” means “tastes/samples carefully,” usually to judge quality; it’s the he/she/it form of “degust.”","zh":"“degusts”意为“细细品尝/品鉴”，多用于评估品质；是动词“degust”的第三人称单数形式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to taste food or drink carefully (often to judge its quality); to sample","zh":"（常指为评鉴品质而）细细品尝；品鉴；试尝"},"examples":[{"en":"The chef degusts the sauce before serving it.","zh":"主厨在上菜前会先品尝酱汁。"},{"en":"She degusts several wines during the tasting event.","zh":"她在品酒活动中品尝了几款葡萄酒。"}]}],"synonyms":["taste","sample","sip","try","savor"],"phonetic":"/dɪˈɡʌst/","extraExplanation":["“degusts”是动词“degust”的第三人称单数（he/she/it degusts）。这个词在日常英语里比较少见，更常用的是“taste”“sample”，在正式场合或美食/品酒语境中会看到“degust”或更常见的名词“degustation（品鉴）”。","词源来自拉丁语“degustare”（尝、品尝），因此常带有“有意识地、带评估目的地品尝”的感觉。"]}

