{"word":"dehache","summary":{"en":"“dehache” is not standard English; it’s likely a misspelling (often of “detach” or “dehash”) or a proper name.","zh":"“dehache”不是标准英语词；多半是拼写错误（常见为“detach”或“dehash”）或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or a name/brand. Common intended words include “detach” (separate/remove) or “dehash” (compute: reverse a hash table / remove hashing).","zh":"不是标准英语单词；更可能是拼写错误或专有名称/品牌名。常见的可能目标词包括“detach”（分离/拆下）或“dehash”（计算机：反哈希/取消哈希处理）。"},"examples":[{"en":"I can’t find “dehache” in an English dictionary—did you mean “detach”?","zh":"我在英文词典里找不到“dehache”——你是不是想写“detach”？"},{"en":"In programming contexts, you might be looking for “dehash,” not “dehache.”","zh":"在编程语境中，你可能想找的是“dehash”，而不是“dehache”。"}]}],"extraExplanation":["“dehache”这种拼写看起来有点像把“de-”（表示“去除/反向”）和“hash”（哈希）或“hache”（法语里“斧头/剁碎”相关）混在一起，但它本身并不是常见英语词。","如果你能提供一句包含它的原句（或告诉我它出现的领域：聊天、游戏、编程、品牌、人名等），我可以更准确判断你要查的词，并给出正式释义与用法。"]}
{"word":"dehair","summary":{"en":"“Dehair” means to remove hair or fur from something, often in tanning or food processing.","zh":"“dehair”指从某物上去除毛发或毛皮，常见于制革或食品加工等语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove hair or fur from something (such as an animal hide or a surface)","zh":"（从某物上）去除毛发或毛皮（如兽皮或某个表面）"},"examples":[{"en":"The tannery dehaired the hides before turning them into leather.","zh":"制革厂在把兽皮制成皮革之前先进行脱毛处理。"},{"en":"The chef dehaired the pig’s skin to prepare it for roasting.","zh":"厨师先把猪皮上的毛去掉，再进行烤制准备。"}]}],"synonyms":["depilate","remove hair","defur","shave"],"phonetic":"/diˈhɛr/","extraExplanation":["“de-”是英语里常见的前缀，表示“去除、除去”（如 de-ice 去冰、debone 去骨）。因此 dehair 字面意思就是“把毛去掉”。","dehair 多见于特定行业语境，例如制革（处理兽皮）或食品加工（处理猪/羊等的皮毛）。日常口语里更常说 remove hair / shave / wax / depilate。"]}
{"word":"dehairer","summary":{"en":"A dehairer is a person or machine that removes hair, especially in leather processing.","zh":"dehairer 指除毛的人或设备，尤其常见于制革/皮革加工中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person, tool, or machine that removes hair (often from animal hides/skins or from a surface).","zh":"除毛者；除毛工具/机器（常指从动物皮革上或表面去除毛发）。"},"examples":[{"en":"The tannery uses a dehairer to remove hair from hides before further processing.","zh":"制革厂会用除毛机先把生皮上的毛去掉，再进行后续加工。"},{"en":"After soaking, the hides go through the dehairer.","zh":"浸泡之后，生皮会进入除毛设备处理。"}]}],"synonyms":["dehairing machine","hair remover","depilator (general)"],"phonetic":"/diˈhɛrər/","extraExplanation":["“dehairer”比较少见，多出现在制革（tannery）、皮革加工（hide/skin processing）或工业设备说明中。更常见的说法是“dehairing machine”（除毛机）或直接用动词“dehair”（除毛）。","词形上：de- 表示“去除”，hair 是“毛发”，-er 表示“执行者/工具”。因此字面意思就是“去毛的东西/人”。"]}
{"word":"dehairing","summary":{"en":"Dehairing means removing hair or fur, especially from animal hides during leather processing.","zh":"Dehairing 指去除毛发/皮毛，尤指制革过程中给生皮脱毛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of removing hair or fur from an animal hide/skin (especially in leather-making) or from a surface/object","zh":"（尤指制革过程中）把皮革上的毛发去除；或把某个表面/物体上的毛发清除的过程"},"examples":[{"en":"Dehairing is an important step before tanning the hide into leather.","zh":"在把生皮鞣制成皮革之前，脱毛（dehairing）是一个重要步骤。"},{"en":"The factory improved its dehairing process to reduce waste and water use.","zh":"工厂改进了脱毛工艺，以减少废料和用水量。"}]},{"partOfSpeech":"v.","definition":{"en":"the action of removing hair; present participle/gerund of “dehair” (to remove hair)","zh":"去毛的动作；“dehair（去毛）”的现在分词/动名词形式"},"examples":[{"en":"They are dehairing the hides in a lime solution.","zh":"他们正在用石灰溶液给生皮脱毛。"},{"en":"Dehairing the brush helps it stay clean and work better.","zh":"把刷子上的毛发清理掉能让它更干净、用起来更顺手。"}]}],"synonyms":["hair removal","depilation","defurring","hair stripping"],"phonetic":"/diˈherɪŋ/","extraExplanation":["“dehairing”最常见于制革/皮革工业语境：通常先浸泡、石灰处理（liming），再进行脱毛，以便后续鞣制（tanning）。在一般生活语境中，也可用于“清理毛发/去除毛发”的动作描述，但频率较低。"]}
{"word":"Dehaites","summary":{"en":"“Dehaites” isn’t recognized as a standard English word; it’s likely a misspelling or a proper name.","zh":"“Dehaites”不是标准英语词；更可能是拼写错误或专有名词（如人名）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. “Dehaites” is most likely a misspelling, a name (proper noun), or a word from another language.","zh":"不是标准英语单词。“Dehaites”很可能是拼写错误、人名/专有名词，或来自其他语言。"},"examples":[{"en":"I couldn’t find a dictionary entry for “Dehaites.” Could you share the sentence where you saw it?","zh":"我在词典里找不到“Dehaites”。你能把它出现的句子发我吗？"},{"en":"Is “Dehaites” a person’s last name or a place name?","zh":"“Dehaites”是人的姓氏还是地名吗？"}]}],"phonetic":"/dəˈheɪts/","extraExplanation":["目前在常见英语词典中没有“Dehaites”的词条。最有效的办法是：\n1）把它所在的完整句子贴出来；\n2）告诉我它来自哪里（书、歌词、游戏、社交媒体、法语/西语文本等）；\n3）确认大小写（Dehaites / dehaites）以及是否可能少了或多了字母。\n\n如果你愿意，我也可以根据你提供的上下文，帮你判断它可能是哪个词的拼写错误，并给出正确拼写与用法。"]}
{"word":"dehaites","summary":{"en":"Not a standard English word; likely a misspelling or a proper name. Please share context for an accurate meaning.","zh":"不是标准英语单词；更可能是拼写错误或专有名词。提供上下文可帮助准确判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“dehaites” is not a standard English word. It is likely a misspelling, a username, or a proper name (e.g., a family name).","zh":"“dehaites” 不是标准英语单词，更可能是拼写错误、用户名，或专有名词（例如姓氏）。"},"examples":[{"en":"I can’t find “dehaites” in an English dictionary—could you check the spelling?","zh":"我在英语词典里查不到 “dehaites”——你能确认一下拼写吗？"},{"en":"Did you mean “the heights” or a person’s name like “DeHaites”?","zh":"你是想说 “the heights（高处/高度）”，还是某个人名，比如 “DeHaites”？"}]}],"extraExplanation":["如果你是想查一个英文单词的意思，建议你提供：①它出现的句子；②你想表达的中文意思；③是否可能是人名/地名/品牌名。","从拼写上看，它可能是：\n- 把两个词连写了（例如 the heights / de + heights）；\n- 某个姓氏的写法（如 DeHaites / DeHates 之类）；\n- 你想输入的是一个常见单词但拼错了（例如 debates, dictates, dehydrates 等）。\n给我上下文我就能更准确判断。"]}
{"word":"dehalogenate","summary":{"en":"To remove halogen atoms from a chemical compound.","zh":"使化合物脱卤：去除其中的卤素原子。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Chemistry) To remove halogen atoms (F, Cl, Br, I) from a compound, often by a chemical reaction.","zh":"（化学）使化合物脱卤；去除化合物中的卤素原子（氟/氯/溴/碘），通常通过化学反应实现。"},"examples":[{"en":"Some bacteria can dehalogenate chlorinated solvents in groundwater.","zh":"一些细菌可以使地下水中的含氯溶剂脱卤。"},{"en":"The catalyst helps dehalogenate the organic molecule under mild conditions.","zh":"该催化剂能在温和条件下帮助有机分子脱卤。"},{"en":"Researchers aim to dehalogenate toxic pollutants to make them less harmful.","zh":"研究人员希望通过脱卤来降低有毒污染物的危害。"}]}],"synonyms":["remove halogens","dechlorinate","debrominate"],"phonetic":"/ˌdiːˈhæl.ə.dʒəˌneɪt/","extraExplanation":["词源构成：de- 表示“去除/除去”，halogen 指“卤素”，-ate 常用于动词化学术语中，整体意思就是“把卤素去掉”。","常见语境：环境化学与污染治理中常讨论对“卤代烃”（halogenated hydrocarbons，如氯代溶剂、溴代阻燃剂）进行脱卤，以降低毒性或提高可降解性。","相关概念对比：dehalogenate（脱卤）强调“去掉卤素”；detoxify（解毒/去毒）强调“降低毒性”，两者常在环保文章里同时出现，但含义不同。"]}
{"word":"dehaze","summary":{"en":"Dehaze means to remove haze to make an image or view clearer, especially in photo/video editing.","zh":"Dehaze 指去除薄雾/雾霾让画面或视野更清晰，常用于修图与视频后期。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove haze (a light fog or unclear layer) from an image, video, or view, making it look clearer","zh":"（从图像、视频或视野中）去除薄雾/雾霾，使其更清晰"},"examples":[{"en":"This app can dehaze photos taken on foggy days.","zh":"这个应用可以给雾天拍的照片去雾。"},{"en":"Try lowering the dehaze setting if the sky looks unnatural.","zh":"如果天空看起来不自然，试着把去雾强度调低。"},{"en":"The camera software automatically dehazes the image.","zh":"相机软件会自动对图像进行去雾处理。"}]}],"synonyms":["defog","clarify","clear up"],"phonetic":"/diːˈheɪz/","extraExplanation":["“de-”是英语里常见的前缀，表示“去除、解除”（如 de-ice 去冰、devalue 贬值）。因此 dehaze 字面意思就是“把 haze（薄雾、朦胧感）去掉”。","dehaze 在日常口语中不算特别常见，更常见于摄影、修图与视频后期（例如 Lightroom 里的 Dehaze 滑杆）。在天气语境里，人们通常说 clear the haze / the haze cleared，而不是直接用 dehaze。"]}
{"word":"deheathenize","summary":{"en":"Deheathenize means to convert someone from being a “heathen” (often to Christianity) or to remove practices seen as non-Christian—an old-fashioned, often biased word.","zh":"Deheathenize 指使某人“脱离异教”（常指改信基督教）或去除被视为非基督教的做法；该词较陈旧且常带偏见色彩。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to convert (someone) from being a heathen; to make a person or group follow a (usually Christian) religion instead of a non-Christian one","zh":"使（某人）“脱离异教”并改信（通常指基督教）；使（某人/群体）从非基督教信仰转向基督教信仰"},"examples":[{"en":"Some missionaries believed their goal was to deheathenize local communities.","zh":"一些传教士认为他们的目标是让当地社区“脱离异教”。"},{"en":"The novel criticizes the idea that outsiders can “deheathenize” a culture through force.","zh":"这部小说批评了外来者可以通过武力让一种文化“脱离异教”的想法。"}]},{"partOfSpeech":"vt.","definition":{"en":"to remove “heathen” customs from something; to make something seem more “civilized” according to a particular religious or cultural standard","zh":"去除被视为“异教”的习俗；按某种宗教或文化标准把某事物“文明化/正统化”"},"examples":[{"en":"They tried to deheathenize the festival by replacing traditional rites with church services.","zh":"他们试图用教会礼拜取代传统仪式，以此让节庆“脱异教化”。"},{"en":"The policy aimed to deheathenize public life, banning rituals the leaders disliked.","zh":"该政策旨在让公共生活“脱异教化”，禁止领导者不喜欢的仪式。"}]}],"synonyms":["convert","proselytize","Christianize","assimilate"],"phonetic":"/diˈhiːðənaɪz/","extraExplanation":["构词：de-（去除、使不再）+ heathen（旧用法：指“非基督徒/异教徒”，也常带有“未开化”的贬义）+ -ize（使成为）。因此该词常带强烈的宗教与文化立场。","语体与文化敏感性：deheathenize 很少用于中性语境，容易显得带偏见或殖民视角。现代写作中更常用更中性的表达，如 convert, proselytize（劝改宗）, Christianize（基督教化）, assimilate（同化，语气也可能敏感），或用更具体描述（例如 “encourage adoption of Christianity”）。"]}
{"word":"dehellenise","summary":{"en":"Dehellenise means to remove or reduce Greek (Hellenic) influence.","zh":"dehellenise 指“去希腊化”，即去除或弱化希腊文化/语言/思想的影响。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to remove Greek (Hellenic) influence from something; to make something less Greek in language, culture, style, or ideas.","zh":"去希腊化；消除某事物中的希腊（希腊化）影响，使其在语言、文化、风格或思想上不那么“希腊化”。"},"examples":[{"en":"Some scholars argue that later editors tried to dehellenise certain religious texts to fit a different cultural setting.","zh":"一些学者认为，后来的编者试图对某些宗教文本进行去希腊化处理，以适应不同的文化环境。"},{"en":"The translation was criticized for dehellenising key philosophical terms that originally came from Greek.","zh":"这份译本被批评把一些源自希腊的关键哲学术语“去希腊化”了。"}]}],"synonyms":["dehellenize","remove Greek influence","de-Grecianize","declassicize"],"phonetic":"/diːˈhɛləˌnaɪz/","extraExplanation":["这个词比较少见，常见于学术写作（历史、神学、古典学、哲学翻译研究等）。它与 hellenise/hellenize（“希腊化”）相对：hellenise 是“加入/强化希腊影响”，dehellenise 是“去除/弱化希腊影响”。","拼写上的 -ise/-ize 差异：dehellenise 常见于英式拼写传统；在美式英语中也可能看到 dehellenize。含义基本相同。","词根提示：Hellen- 来自 Hellas（希腊的希腊语名称），常见于 Hellenic（希腊的/希腊文化的）、Hellenism（希腊主义/希腊文化）等词。"]}
{"word":"dehellenize","summary":{"en":"Dehellenize means to remove or reduce Greek (Hellenic) influence from something.","zh":"dehellenize 指“去希腊化”，即移除或减弱希腊（希腊化）影响。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove Hellenic (Greek) influence from something; to make something less Greek in language, culture, style, or ideas","zh":"去希腊化；消除（语言、文化、风格或思想上的）希腊/希腊化影响"},"examples":[{"en":"Some historians argue that later rulers tried to dehellenize the court by restoring local customs.","zh":"一些历史学家认为，后来的统治者试图通过恢复本地习俗来让宫廷去希腊化。"},{"en":"The editor attempted to dehellenize the translation by replacing Greek loanwords with more familiar terms.","zh":"编辑试图通过用更常见的词替换希腊外来词，让译文去希腊化。"}]}],"synonyms":["de-Grecianize","dehellenise","de-Hellenize","de-Hellenise","de-Greek"],"phonetic":"/diˈhɛləˌnaɪz/","extraExplanation":["这个词很少见，多用于历史、文化研究或语言学语境。构词上是前缀 de-（表示“去除、逆转”）+ Hellenize（“希腊化”）。","Hellenize 常指“使受希腊文化影响/使希腊化”；dehellenize 则强调“减少或撤回这种影响”。并不一定表示完全抹去，而是“弱化、回归本土化”。"]}
{"word":"dehelm","summary":{"en":"Dehelm means to remove a helmet (or, more rarely, a ship’s helm).","zh":"dehelm 指摘下头盔（更少见地也可指移除船的舵/操舵装置）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Nautical or formal) to remove a helmet or a protective head covering from someone; to take off the helm.","zh":"（航海或较正式用语）给某人摘下头盔/头饰；使其脱去头盔（或类似护具）。"},"examples":[{"en":"After the dive, the crew helped him dehelm before he climbed the ladder.","zh":"潜水结束后，船员帮他摘下头盔，然后他才爬上梯子。"},{"en":"The guard was ordered to dehelm to show his face.","zh":"守卫被命令摘下头盔以露出面容。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Rare) to remove or take away a helm (the steering device) from a ship or boat.","zh":"（罕见）移除船的舵/操舵装置。"},"examples":[{"en":"The damaged boat was dehelmed during repairs.","zh":"维修期间，那艘受损的船被拆除了舵（操舵装置）。"}]}],"synonyms":["remove a helmet","take off a helmet","unhelmet","remove the helm"],"phonetic":"/diˈhɛlm/","extraExplanation":["“dehelm”由前缀 de-（表示“去除、解除”）+ helm（头盔；也可指“舵/操舵装置”）构成，因此字面意思就是“去掉helm”。","这个词在现代日常英语里非常少见；更常见的表达是 take off/remove one’s helmet，或在船只语境中用 remove the helm/steering gear。"]}
{"word":"dehematize","summary":{"en":"A technical verb meaning “to remove blood (or hemoglobin) from a sample.”","zh":"一个技术性动词，意思是“从样本中去除血液（或血红蛋白）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Medicine/Lab) To remove blood or blood pigments (especially hemoglobin) from a tissue, organ, or sample; to make something free of blood.","zh":"（医学/实验）把组织、器官或样本中的血液或血色素（尤其是血红蛋白）去除；使其脱血。"},"examples":[{"en":"The researchers dehematized the liver tissue before measuring enzyme activity.","zh":"研究人员在测定胆酶活性之前，对肝组织进行了脱血处理。"},{"en":"Dehematizing the sample helps reduce interference from hemoglobin in the analysis.","zh":"对样本脱血有助于减少血红蛋白对分析结果的干扰。"}]}],"synonyms":["exsanguinate (technical)","deblood (rare)"],"phonetic":"/diˈhiːməˌtaɪz/","extraExplanation":["该词较少见，多用于生物医学研究或组织学/病理学的实验步骤中；更常见的拼写变体是 dehaematize（英式拼写，含 ae）。","词源构成：de-（去除）+ hemat-（血）+ -ize（使…化/使成为）。在论文或实验记录里常与“dehematized tissue/sample（脱血的组织/样本）”搭配出现。"]}
{"word":"dehepatize","summary":{"en":"A rare medical verb meaning to remove the liver or liver tissue from something (usually an experimental animal).","zh":"一个较罕见的医学动词，指去除肝脏/肝组织（常用于实验动物语境）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Medicine) To remove the liver from (a body or an animal), or to deprive something of liver tissue; to make non-hepatic.","zh":"（医学）使（人体/动物）去肝；去除肝脏或肝组织；使不含肝组织。"},"examples":[{"en":"In the experiment, the researchers dehepatized the rats to study how the liver affects drug metabolism.","zh":"在实验中，研究人员对大鼠进行了去肝处理，以研究肝脏如何影响药物代谢。"},{"en":"A dehepatized animal cannot process many toxins the way a normal animal can.","zh":"去肝动物无法像正常动物那样处理许多毒素。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Less common) To remove liver-like properties from a mixture or extract (used in technical/older scientific writing).","zh":"（较少见）从混合物或提取物中去除与“肝”相关的成分/性质（多见于技术性或较旧的科学写作）。"},"examples":[{"en":"They attempted to dehepatize the extract before measuring the remaining enzymes.","zh":"在测量剩余酶之前，他们尝试对提取物进行“去肝成分”处理。"}]}],"synonyms":["hepatectomize","remove the liver","excise the liver"],"phonetic":"/diːˈhɛpəˌtaɪz/","extraExplanation":["词源上由前缀 de-（去除、解除）+ hepat-（肝；来自希腊语 hepar/hepatos）+ -ize（使成为/使发生）构成，因此字面意思就是“去肝化”。","这是非常专业、偏实验/外科语境的动词，日常英语几乎不会用；更常见的相关词是 hepatic（肝的）、hepatectomy（肝切除术）、dehepaticized（去肝的，形容词/过去分词用法）。"]}
{"word":"Dehgan","summary":{"en":"Dehgan (also spelled dehqan) is a historical Persian term for a local landowning noble or village headman, and by extension someone tied to that class/culture.","zh":"Dehgan（也拼作 dehqan）是历史上的波斯/伊朗词，指地方乡绅、地主贵族或村长，也可泛指与该阶层/文化相关的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in historical Persia/Iran) a local landed noble or village headman; a member of the rural landowning class.","zh":"（历史上的波斯/伊朗）地方乡绅、地主贵族或村长；指农村土地所有者阶层的一员。"},"examples":[{"en":"In some historical accounts, the dehgan collected taxes and managed village affairs.","zh":"在一些历史记载中，dehgan 负责征税并管理村庄事务。"},{"en":"The poet praised the dehgan as a guardian of local traditions.","zh":"诗人称赞 dehgan 是地方传统的守护者。"}]},{"partOfSpeech":"n.","definition":{"en":"A Persian/Iranian person identified with the dehgan class or culture, especially in medieval literature.","zh":"（尤用于中世纪文学语境）与 dehgan 阶层或其文化相关的波斯/伊朗人。"},"examples":[{"en":"The story features a dehgan who preserves old Iranian legends.","zh":"故事中有一位 dehgan 保存着古老的伊朗传说。"}]}],"synonyms":["dehqan","landowner","village headman","local noble"],"phonetic":"/deɪˈɡɑːn/","extraExplanation":["“Dehgan”更常见的拼写是“dehqān / dehqan”。源自中古波斯语，常被用来指前伊斯兰时期及伊斯兰早期伊朗的地方地主/乡绅阶层。","在英文历史或文学研究中，这个词多出现在讨论伊朗社会结构、地方治理，以及《列王纪》（Shahnameh）等作品的文化背景时。"]}
{"word":"dehgan","summary":{"en":"A dehgan is a historical Persian/Iranian village headman or landowning rural gentry figure.","zh":"dehgan 指历史上的波斯/伊朗乡村头人或拥有土地的农村士绅人物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical, Iran/Persia) A village headman or local landowning farmer; a member of the rural Persian gentry.","zh":"（历史用语，伊朗/波斯）乡村的头人或地主农民；波斯农村士绅阶层的一员。"},"examples":[{"en":"In some historical accounts, a dehgan collected taxes and represented the village to the state.","zh":"在一些历史记载中，dehgan 负责收税，并代表村庄与政府打交道。"},{"en":"The epic describes dehgans as guardians of local tradition and memory.","zh":"史诗作品中常把 dehgan 描写为守护地方传统与记忆的人。"}]}],"synonyms":["village headman","local landowner","rural gentry"],"phonetic":"/deɪˈɡɑːn/","extraExplanation":["“dehgan”（也常见拼写 dehqān / dehqan / dihqan）源自波斯语，字面与“村庄（deh）”相关，历史上指在乡里有地位、有土地的人，介于普通农民与贵族之间。","在英文写作中它多出现在中亚/伊朗历史、波斯文学研究或翻译里，属于文化特定词；若在日常英语中表达，可用 “village headman / local landowner / rural gentry” 来解释更清楚。"]}
{"word":"dehisce","summary":{"en":"Dehisce means to split open naturally (often in plants) or, medically, for a wound to reopen.","zh":"Dehisce 指“自然裂开”（多用于植物），也可指医学上的“伤口再次裂开”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Of a seed pod, fruit, or anther) to split open naturally when mature in order to release its contents (usually seeds or pollen).","zh":"（指种荚、果实或花药）成熟后自然裂开，以释放内容物（通常是种子或花粉）。"},"examples":[{"en":"When the pod dehisces, it releases the seeds into the wind.","zh":"当豆荚裂开时，它会把种子释放到风中。"},{"en":"Some flowers dehisce their anthers early in the morning.","zh":"有些花会在清晨花药开裂并散出花粉。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Medical) to burst or split open along a seam, especially when a surgical wound reopens.","zh":"（医学）沿着缝合处裂开，尤指手术伤口再次裂开。"},"examples":[{"en":"The incision began to dehisce, so the patient needed additional care.","zh":"切口开始裂开，因此病人需要进一步处理。"},{"en":"Doctors monitor wounds closely to prevent dehiscence after surgery.","zh":"医生会密切观察伤口，以防术后伤口裂开。"}]}],"synonyms":["split open","burst open","open up","rupture"],"phonetic":"/dɪˈhɪs/","extraExplanation":["词源来自拉丁语 dehiscere（“裂开、张开”）。这个词在日常英语里不常见，最常出现在植物学与医学语境中。","相关名词：dehiscence（开裂；（伤口）裂开）。在医学里常见搭配是 “wound dehiscence”（伤口裂开）。"]}
{"word":"dehisced","summary":{"en":"Dehisced means “split or burst open,” especially in scientific contexts (plants releasing seeds/pollen, or a wound reopening).","zh":"dehisced 表示“裂开/爆开”，多用于科学语境（如植物释放种子/花粉，或伤口重新裂开）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of dehisce) to split or burst open naturally, especially to release seeds, spores, or other contents.","zh":"（dehisce 的过去式/过去分词）自然裂开或爆开，尤指为了释放种子、孢子或内部物质。"},"examples":[{"en":"When the pods dehisced, the seeds scattered across the ground.","zh":"豆荚一裂开，种子就散落在地上。"},{"en":"The capsule had dehisced along a seam.","zh":"蒴果沿着接缝裂开了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective) already split or burst open, often used in botany or medicine.","zh":"（形容词）已经裂开/爆开的（常用于植物学或医学语境）。"},"examples":[{"en":"The lab collected pollen from dehisced anthers.","zh":"实验室从已开裂的花药中收集花粉。"},{"en":"The doctor examined a dehisced surgical wound.","zh":"医生检查了一个已经裂开的手术伤口。"}]}],"synonyms":["split open","burst open","open","ruptured","gaped"],"phonetic":"/dɪˈhɪst/","extraExplanation":["“dehisce / dehisced”多见于植物学：例如果荚（pods）、蒴果（capsules）、花药（anthers）成熟后“裂开”以释放种子或花粉。","医学里常见搭配是 wound dehiscence（伤口裂开/伤口裂开并发症），指缝合后的伤口边缘重新分开；这是比较正式、专业的说法。"]}
{"word":"dehiscence","summary":{"en":"Dehiscence means a splitting open—especially a plant part opening to release seeds/pollen, or a wound/incision reopening after closure.","zh":"Dehiscence 指“裂开/开裂”：常指植物结构自然裂开释放种子/花粉，也可指伤口或手术切口在闭合后再度裂开。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology/Botany) the natural splitting open of a plant part (such as a seed pod or anther) to release its contents, especially seeds or pollen.","zh":"（生物/植物）植物器官（如荚果、花药）自然裂开以释放内容物，尤指散播种子或花粉。"},"examples":[{"en":"When the pod dries, dehiscence releases the seeds into the wind.","zh":"当豆荚干燥时，会发生裂开散播，把种子释放到风中。"},{"en":"Anther dehiscence is a key step in pollination.","zh":"花药裂开是授粉过程中的关键一步。"}]},{"partOfSpeech":"n.","definition":{"en":"(Medicine) the separation or reopening of the edges of a wound or surgical incision after it has been closed.","zh":"（医学）伤口或手术切口在缝合后边缘分离、裂开或再次打开。"},"examples":[{"en":"The nurse checked the incision daily for signs of infection or dehiscence.","zh":"护士每天检查切口是否有感染或裂开的迹象。"},{"en":"Heavy lifting too soon can increase the risk of wound dehiscence.","zh":"术后过早提重物会增加伤口裂开的风险。"}]}],"synonyms":["splitting","bursting open","opening","wound separation"],"phonetic":"/dɪˈhɪsəns/","extraExplanation":["词源来自拉丁语 *dehiscere*，意为“张开、裂开”。因此它常用于两类“裂开”场景：植物结构为散播而自然开裂，以及医学上伤口边缘意外分开。","读写时可联想到动词 *to dehisce*（裂开），以及形容词 *dehiscent*（会裂开的）。医学语境里常见搭配是 *wound dehiscence*（伤口裂开）。"]}
{"word":"dehiscent","summary":{"en":"Dehiscent describes plant structures that naturally split open when mature to release seeds or contents.","zh":"Dehiscent 指植物结构成熟后会自然裂开，以释放种子或内容物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a plant part, especially a fruit or seed pod) able to split open naturally when mature to release its contents.","zh":"（尤指植物的果实或种荚）成熟后会自然裂开，以释放其中的种子或内容物。"},"examples":[{"en":"Many legumes have dehiscent pods that split open to scatter the seeds.","zh":"许多豆科植物的种荚是裂开的（开裂性），会自行裂开把种子散播出去。"},{"en":"The capsule becomes dehiscent when it dries, releasing tiny seeds.","zh":"蒴果变干后会开裂，把细小的种子释放出来。"}]}],"synonyms":["splitting (open)","opening (naturally)","rupturing (when mature)"],"phonetic":"/dɪˈhɪsənt/","extraExplanation":["这是一个偏生物学/植物学的词，常出现在教科书、植物描述或科研文章中。日常英语里更常说 “it splits open” 或 “it opens when mature”。","词源来自拉丁语 dehiscere（意为“裂开、张开”）。在植物学里常与 indehiscent（不开裂的）成对使用，用来区分果实是否会自行开裂散种。"]}
{"word":"dehisces","summary":{"en":"“Dehisces” means “splits open naturally,” especially in plants (releasing seeds/pollen) or in medicine (a wound opening).","zh":"“dehisces”意为“自然裂开”，常用于植物（释放种子/花粉）或医学（伤口开裂）。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(biology/botany) to split open or burst along a natural line, releasing contents such as seeds, pollen, or spores.","zh":"（生物/植物）沿自然裂缝裂开或爆裂，释放内部物质，如种子、花粉或孢子。"},"examples":[{"en":"When the pod dehisces, it scatters the seeds around the plant.","zh":"当豆荚裂开时，它会把种子散落在植株周围。"},{"en":"In many flowers, the anther dehisces to release pollen.","zh":"在许多花中，花药会裂开以释放花粉。"}]},{"partOfSpeech":"vi.","definition":{"en":"(medicine) to open up or split apart, especially referring to a wound opening after surgery.","zh":"（医学）裂开、开裂，尤指术后伤口重新裂开。"},"examples":[{"en":"The incision dehisces if it is under too much tension.","zh":"如果切口张力过大，伤口可能会裂开。"},{"en":"The doctor checked whether the stitches were holding or if the wound dehisced.","zh":"医生检查缝线是否牢固，以及伤口是否开裂。"}]}],"synonyms":["split open","burst open","open","rupture"],"phonetic":"dɪˈhɪs","extraExplanation":["“dehisces”是动词“dehisce”的第三人称单数现在时（he/she/it dehisces）。常见于科学写作，日常英语里更常用“splits open / bursts open（裂开）”。","词源来自拉丁语 *dehiscere*（“张开、裂开”）。在植物学里常搭配：pod（荚）、capsule（蒴果）、anther（花药）。在医学里常见名词形式“wound dehiscence（伤口裂开）”。"]}
{"word":"dehiscing","summary":{"en":"Dehiscing describes something splitting open naturally (especially plant parts) or a wound reopening.","zh":"Dehiscing 指（尤指植物器官）成熟后自然裂开，或（伤口/切口）再次裂开。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) opening or splitting open naturally when mature, often to release seeds, spores, or pollen.","zh":"（植物学）成熟后自然裂开或开裂，常用于释放种子、孢子或花粉。"},"examples":[{"en":"The dehiscing pod scattered seeds across the ground.","zh":"正在裂开的豆荚把种子散落在地上。"},{"en":"In some flowers, the anthers are dehiscing and releasing pollen.","zh":"有些花的花药正在开裂并释放花粉。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Medicine) (of a wound or surgical incision) reopening or splitting apart after being closed.","zh":"（医学）（伤口或手术切口）在闭合后再次裂开或崩开。"},"examples":[{"en":"The nurse checked the incision for signs of dehiscing.","zh":"护士检查切口是否有再次裂开的迹象。"},{"en":"If a wound is dehiscing, contact your doctor promptly.","zh":"如果伤口出现崩开，应及时联系医生。"}]},{"partOfSpeech":"vi.","definition":{"en":"present participle of “dehisce”: to split open at maturity or to reopen.","zh":"“dehisce”的现在分词：指（成熟时）裂开，或（伤口）再次裂开。"},"examples":[{"en":"These capsules are dehiscing as they dry.","zh":"这些蒴果在变干时正在裂开。"}]}],"synonyms":["splitting open","opening","bursting","gaping","reopening"],"phonetic":"/dɪˈhɪsɪŋ/","extraExplanation":["“dehisce”来自拉丁语，原意与“裂开、张开”相关；在英文里多见于植物学和医学语境，日常对话较少用。","常见搭配：dehiscing pod（裂开的果荚）、dehiscing capsule（裂开的蒴果）、wound dehiscing / dehiscing incision（伤口/切口裂开）。"]}
{"word":"dehistoricize","summary":{"en":"Dehistoricize means to remove or minimize historical context, treating something as timeless or universal.","zh":"Dehistoricize 指淡化或移除历史背景，把某事当成超越历史、普遍永恒的东西来看待。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove or downplay historical context when analyzing or presenting something; to treat it as if it exists outside history","zh":"（在分析或呈现时）去历史化；淡化或移除历史背景，把某事当成脱离历史而存在"},"examples":[{"en":"The critic argues that the film dehistoricizes the civil rights movement by ignoring the political realities of the time.","zh":"这位评论家认为，这部电影通过忽视当时的政治现实，把民权运动“去历史化”了。"},{"en":"When we dehistoricize a tradition, we may miss why it mattered to people in that period.","zh":"当我们把一种传统去历史化时，可能会错过它在那个时代对人们为何重要。"}]},{"partOfSpeech":"vt.","definition":{"en":"to strip a text, idea, or event of its historical development and treat it as universal or timeless","zh":"把文本、观念或事件的历史发展过程抽离，视为普遍、永恒的东西"},"examples":[{"en":"Some textbooks dehistoricize science, presenting discoveries as sudden moments rather than long processes.","zh":"有些教材会把科学去历史化，把发现呈现为突然的瞬间，而不是长期过程。"},{"en":"The essay warns against dehistoricizing moral values and assuming they never change.","zh":"这篇文章警告不要把道德价值去历史化，假设它们从不改变。"}]}],"synonyms":["ahistoricize","decontextualize","unhistoricize"],"phonetic":"/ˌdiːhɪˈstɔrɪˌsaɪz/","extraExplanation":["“dehistoricize”常见于人文学科与社会科学写作（如文化研究、历史学、文学批评、社会学）。它通常带有批评意味：指出某种叙述把复杂的历史条件（权力关系、社会结构、时代语境等）隐藏起来，使读者误以为某种现象“自然如此”或“放之四海而皆准”。","词形结构：de-（去除、取消）+ historicize（使历史化/置于历史脉络中）。与之相对的动词是“historicize”（把对象放回历史脉络中解释）。"]}
{"word":"Dehkan","summary":{"en":"Dehkan is a historical term for a Persian village landowner or rural noble (traditional gentry).","zh":"Dehkan 是历史词，指波斯地区的乡村地主或乡绅贵族（传统的地方士绅阶层）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A Persian village headman or landowning noble; a member of the traditional rural gentry in Iran and Central Asia.","zh":"（历史用语）波斯的乡村首领或地主贵族；伊朗及中亚传统的乡绅阶层成员。"},"examples":[{"en":"In medieval Persian sources, a dehkan often appears as a local landowner who collected taxes and managed village affairs.","zh":"在中世纪波斯文献中，dehkan 常被描写为负责收税并管理村务的地方地主。"},{"en":"The poet praised the dehkan for protecting farmers during a time of unrest.","zh":"诗人称赞这位 dehkan 在动荡时期保护农民。"}]}],"synonyms":["dehqān","dehqan","landowner","village headman","rural gentry"],"phonetic":"/deɪˈkɑːn/","extraExplanation":["“Dehkan”更常见的拼写是 dehqān / dehqan（也写作 dihqān），源自波斯语，字面含义与“村（deh）”相关。","在萨珊王朝及其后续时期，dehqān 常指地方乡绅/地主阶层：拥有土地、在地方治理与税收中有影响力，也常被认为是波斯文化与传统的守护者之一。","现代英语里该词较少见，多出现在历史研究、翻译文学或讨论伊朗社会结构的语境中。"]}
{"word":"dehkan","summary":{"en":"Dehkan is a historical Persian term for a village landowner or rural farmer/peasant.","zh":"Dehkan 是一个波斯语历史词，指乡村地主或乡村农民/耕作者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Persian/Iranian village landowner or farmer (especially in historical contexts); sometimes used more broadly for a rural cultivator or peasant.","zh":"（多用于历史语境）波斯/伊朗的乡村地主或农民；也可泛指乡村耕作者、农民。"},"examples":[{"en":"In some histories of Iran, the dehkan class is described as important rural landholders.","zh":"在一些伊朗史著中，dehkan 阶层被描述为重要的乡村地主。"},{"en":"The novel mentions a dehkan who manages fields and collects harvests from tenants.","zh":"小说中提到一位 dehkan，他管理田地并向佃户收取收成。"}]}],"synonyms":["landowner","farmer","peasant","rural landlord"],"phonetic":"/dɛhˈkɑːn/","extraExplanation":["dehkan 也常见拼写为 dehqān / dehqan，来源于波斯语。不同文献里含义会有差异：有时偏“地主/乡绅阶层”，有时更接近“乡村农民/耕作者”。具体含义通常要看时代与语境（如萨珊王朝及伊斯兰早期文献中常指地方乡绅、地主）。","英语里该词多出现在历史、伊朗研究或文学翻译中，属于相对少见的借词；在日常英语交流里通常会用 landowner、farmer、peasant 等更常见词替代。"]}
{"word":"Dehlia","summary":{"en":"“Dehlia” is usually a misspelling of “dahlia” (the flower); it can also be a rare name spelling variant.","zh":"“Dehlia”通常是“dahlia（大丽花）”的误拼；也可作较少见的人名变体拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a common misspelling of “dahlia,” a brightly colored garden flower.","zh":"“dahlia（大丽花/大丽菊）”的常见拼写错误，指一种色彩鲜艳的观赏花卉。"},"examples":[{"en":"I think “Dehlia” is a misspelling—did you mean “dahlia”?","zh":"我觉得“Dehlia”可能拼错了——你是想写“dahlia”吗？"},{"en":"The dahlias (sometimes misspelled as “Dehlia”) bloom in late summer.","zh":"大丽花（有时会被误拼为“Dehlia”）在夏末开花。"}]},{"partOfSpeech":"n.","definition":{"en":"(as a name) a variant spelling sometimes used for a girl’s name, though “Dahlia” is much more common.","zh":"（作人名）有时用作女孩名字的变体拼写，但更常见的写法是“Dahlia”。"},"examples":[{"en":"Her name is Dahlia, but some people write it as “Dehlia” by mistake.","zh":"她的名字是Dahlia，但有些人会误写成“Dehlia”。"},{"en":"If you choose “Dehlia” as a name, be ready to spell it out often.","zh":"如果你给孩子取名用“Dehlia”这种拼法，可能需要经常向别人说明拼写。"}]}],"synonyms":["dahlia"],"phonetic":"/ˈdɑːliə/","extraExplanation":["“Dahlia（大丽花）”这个词来自瑞典植物学家 Anders Dahl 的姓氏。标准拼写是 Dahlia；“Dehlia”在英语里不算规范词形，更多见于误拼或个别取名的个性化拼法。","在英语文化中，“Dahlia”作为人名近年来有一定流行度；但“Dehlia”会让人不确定读音与拼写，正式场合（证件、学术、园艺写作）通常建议使用标准拼写 Dahlia。"]}
{"word":"Dehnel","summary":{"en":"Dehnel is mainly used as a surname (a proper family name).","zh":"Dehnel 主要用作姓氏（专有的家族名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name), most commonly found in Central/Eastern Europe; in English it is usually used as a proper name.","zh":"一个姓氏（家族名），常见于中欧/东欧地区；在英语中通常作为专有名词使用。"},"examples":[{"en":"Jacek Dehnel is a Polish writer and poet.","zh":"Jacek Dehnel 是一位波兰作家兼诗人。"},{"en":"I saw the name Dehnel on the book cover.","zh":"我在书封面上看到了 Dehnel 这个名字。"}]}],"phonetic":"/ˈdɛhnəl/","extraExplanation":["“Dehnel”在英语语境里一般不翻译含义，而是直接当作人名/姓氏使用。","如果指波兰作家 Jacek Dehnel，在波兰语中的读音会和英语里常见的读法略有差异；英语中通常按拼写近似读。"]}
{"word":"dehnstufe","summary":{"en":"Dehnstufe is a German noun meaning (1) the “lengthened grade” in ablaut (historical linguistics) or (2) more generally, a level/degree of stretching or extension.","zh":"Dehnstufe 是德语名词：可指（1）历史语言学里元音交替的“延长级”，也可泛指（2）拉伸/延长的等级或程度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Linguistics, Germanic languages) the “lengthened grade” in ablaut (vowel alternation), where a vowel is lengthened compared with the basic grade.","zh":"（语言学，日耳曼语言）元音交替（ablaut）中的“延长级/伸长级”，指相较于基本级元音变长的一种形式。"},"examples":[{"en":"In Germanic historical linguistics, Dehnstufe refers to the lengthened vowel grade in an ablaut series.","zh":"在日耳曼历史语言学中，Dehnstufe 指元音交替序列里的延长元音级。"},{"en":"Some textbooks contrast Grundstufe (basic grade) with Dehnstufe (lengthened grade).","zh":"一些教材会把 Grundstufe（基本级）与 Dehnstufe（延长级）作对比。"}]},{"partOfSpeech":"n.","definition":{"en":"(General German) a degree/level of stretching or extension (used in technical or training contexts).","zh":"（一般德语）拉伸/伸展的程度或等级（常见于技术或训练语境）。"},"examples":[{"en":"Increase the Dehnstufe gradually during your warm-up exercises.","zh":"热身时把伸展程度逐步提高。"},{"en":"The manual lists different Dehnstufen for the material under load.","zh":"说明书列出了材料在受力下不同的拉伸等级。"}]}],"synonyms":["Längungsstufe","Längungsgrad","Streckstufe"],"phonetic":"ˈdeɪnˌʃtuːfə","extraExplanation":["“Dehn-”在德语里有“拉长、延长”的意思，-stufe 表示“级别、等级”。因此它既能用作普通含义的“延长/拉伸等级”，也常被语言学借用来指元音交替（ablaut）中“元音被拉长”的那一档。","在日耳曼语族的历史语法里，ablaut 常分为不同“级”（如基本级、零级、延长级等）。Dehnstufe 这个术语多见于较偏学术或教材式的语境，日常德语中并不常用。"]}
{"word":"DeHoff","summary":{"en":"DeHoff is mainly used as a surname (a family name).","zh":"DeHoff 主要用作姓氏（家族名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname); a proper noun used to identify a person or family named DeHoff.","zh":"德霍夫（DeHoff）：姓氏；用于指代名为 DeHoff 的个人或家族的专有名词。"},"examples":[{"en":"Ms. DeHoff will lead the meeting today.","zh":"DeHoff 女士今天将主持会议。"},{"en":"I found DeHoff in the alumni directory.","zh":"我在校友名录里找到了 DeHoff 这个名字。"}]}],"synonyms":["(no direct synonyms; proper name)"],"phonetic":"/dəˈhɔf/","extraExplanation":["“DeHoff”多见于英语语境中的姓氏写法（常见于美国）。拼写里的“De-”有时与荷兰语/德语姓氏传统相关（类似表示“the/来自……的人”之类的构词习惯），但具体家族来源因人而异。","作为专有名词，首字母通常大写；在书写时要保留中间的大写 H（DeHoff）。不同家庭的读音可能略有差异。"]}
{"word":"dehonestate","summary":{"en":"Dehonestate is a rare formal verb meaning “to disgrace or dishonor,” and in older texts it can mean “to sexually dishonor (violate chastity).”","zh":"dehonestate 是一个罕见的正式动词，意为“使蒙羞/损害名誉”；在古文本中也可指“以性方式玷污（侵犯贞操）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(rare, formal) To dishonor or disgrace someone; to damage their good name.","zh":"（罕见，正式）使某人蒙羞/受辱；损害名誉。"},"examples":[{"en":"He feared that the scandal would dehonestate his family.","zh":"他担心这场丑闻会让家族蒙羞。"},{"en":"False accusations can dehonestate an innocent person in the public eye.","zh":"虚假指控会让无辜的人在公众眼中名誉受损。"}]},{"partOfSpeech":"vt.","definition":{"en":"(archaic) To violate a woman’s chastity; to sexually dishonor.","zh":"（古义）玷污/侵犯女性的贞操；以性方式使其受辱。"},"examples":[{"en":"In older writings, the word may describe a man who dehonestated a young woman.","zh":"在较早的作品中，这个词有时用来形容男人玷污了一位年轻女子。"}]}],"synonyms":["dishonor","disgrace","shame","defame"],"phonetic":"/diˈhɑnəˌsteɪt/","extraExplanation":["这个词非常少见，多见于古旧或拉丁化的英语文本。现代英语里更常用的是 **dishonor / disgrace / shame**；谈到“性侵/侵犯”时应使用更明确、当代的法律或社会语境词汇（如 *sexual assault*），避免含混或带有旧式道德评判色彩的表达。","词源上可追溯到拉丁语 **dehonestare**（使不体面、使失去名誉），由 **de-**（使……不/去除）+ **honestus**（体面的、正直的）构成。"]}
{"word":"dehonestation","summary":{"en":"Dehonestation is a rare, formal word meaning disgrace or the act of dishonoring someone.","zh":"dehonestation 是一个少见且正式的词，意思是“耻辱/蒙羞”或“使人蒙羞的行为”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of dishonoring someone; loss of honor or dignity; disgrace","zh":"使人蒙羞的行为；名誉或尊严的丧失；耻辱"},"examples":[{"en":"In the old text, exile was described as a kind of dehonestation for the entire family.","zh":"在那篇古文中，流放被描述为对整个家族的一种羞辱。"},{"en":"He feared public dehonestation more than any legal punishment.","zh":"他害怕公开受辱，甚于任何法律惩罚。"}]}],"synonyms":["dishonor","disgrace","humiliation","shame","stigma"],"phonetic":"/diˌhɑnəˈsteɪʃən/","extraExplanation":["这个词非常少见、偏古旧，现代英语通常用 dishonor / disgrace / humiliation 来表达相近意思。","词源可追溯到拉丁语：de-（使……下降/去除）+ honestas（荣誉、体面），与动词 dehonestate（使蒙羞）同源。","在历史、法律或宗教语境中偶尔会出现，用来强调“名誉被剥夺/被玷污”的正式语气。"]}
{"word":"dehorn","summary":{"en":"“Dehorn” means to remove horns from an animal (or remove a horn-like part) for safety or practical reasons.","zh":"“Dehorn”指给动物去角（也可指去除物体上类似角的突起），通常出于安全或实用目的。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove the horns from an animal (often cattle), usually for safety","zh":"（通常指牛等）去角；把动物的角割掉（多为安全考虑）"},"examples":[{"en":"The farmer decided to dehorn the calves to reduce injuries in the herd.","zh":"农场主决定给小牛去角，以减少牛群中的受伤情况。"},{"en":"Some farms dehorn cattle when they are young.","zh":"一些农场会在牛还小的时候给它们去角。"}]},{"partOfSpeech":"vt.","definition":{"en":"to remove something horn-shaped or a horn-like part from an object or tool","zh":"去除物体上角状/似角的部分；把“角”状突起拆除"},"examples":[{"en":"The mechanic dehorned the metal part to prevent sharp points.","zh":"技师把金属零件的“角”状突起去掉，以免出现尖锐点。"}]}],"synonyms":["remove horns","disbud","de-antler (less common; for antlers)"],"phonetic":"/diːˈhɔrn/","extraExplanation":["“de-”是常见前缀，表示“去掉、移除”（如 defrost 除霜、deactivate 停用），因此 dehorn 字面意思就是“去掉角”。","在动物福利语境中，dehorning（去角）与 disbudding（除角芽）常被区分：前者通常指角已经长出后再去除，后者多指在角芽阶段处理；具体用词会因地区与行业而不同。"]}
{"word":"dehorned","summary":{"en":"Dehorned describes an animal whose horns have been removed; it can also be the past form of the verb “dehorn.”","zh":"dehorned 指动物已被去角，也可作动词 dehorn 的过去式/过去分词（给动物去角）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having had the horns removed (usually from cattle or other horned animals) to reduce injury or make handling safer.","zh":"（动物，尤指牛等）去角的；角已被切除的（通常为减少受伤风险或便于管理）。"},"examples":[{"en":"The ranch only buys dehorned calves to prevent injuries in crowded pens.","zh":"这个牧场只买去角的小牛，以防在拥挤的围栏里受伤。"},{"en":"Dehorned cattle are easier to transport safely.","zh":"去角的牛更容易安全运输。"}]},{"partOfSpeech":"v.","definition":{"en":"To remove the horns of (an animal).","zh":"给（动物）去角；切除（角）。"},"examples":[{"en":"The veterinarian dehorned the young goats on the farm.","zh":"兽医给农场里的小山羊做了去角处理。"},{"en":"Some farmers dehorn cattle to reduce fighting and injuries.","zh":"一些农民会给牛去角，以减少打斗和受伤。"}]}],"synonyms":["hornless","dehorned (cattle)","disbudded (related term)"],"phonetic":"/diˈhɔrnd/","extraExplanation":["“de-”是英语里常见的前缀，表示“去除、除去”（如: deice 去冰、debone 去骨）。因此 dehorn = 去角。","畜牧业语境中常把 dehorned 当作形容词使用；另一个相关词是 disbudded（去角芽的），通常指在角还没长出来时处理，往往被认为比长成后再去角更少创伤。"]}
{"word":"dehorner","summary":{"en":"A dehorner is a person or device used to remove an animal’s horns, especially in cattle ranching.","zh":"dehorner 指给动物（尤指牛）去角的人或去角工具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or tool that removes the horns of an animal (especially cattle); someone who performs dehorning","zh":"去角者；去角工具（尤指给牛等家畜去角的人或器具）"},"examples":[{"en":"The ranch hired a dehorner to handle the calves safely.","zh":"牧场雇了一位去角师来安全地处理小牛。"},{"en":"For small calves, the vet used a dehorner designed to reduce injury risk.","zh":"对于小牛，兽医使用了专门的去角工具以降低受伤风险。"}]}],"synonyms":["dehorn operator","dehorning tool","dehorning iron","horn remover"],"phonetic":"/diːˈhɔːrnɚ/","extraExplanation":["“Dehorner”来自动词 dehorn（给动物去角）+ 表示“做某事的人/物”的后缀 -er。","在畜牧业语境里，去角常与安全管理有关（减少牛只互相顶撞或伤人、避免角卡住围栏等），现代也强调动物福利与规范操作。写作或口语中更常见的动词是 dehorn，名词也常说 dehorning tool / dehorning iron。"]}
{"word":"dehorners","summary":{"en":"“Dehorners” means people or tools used to remove horns from animals, especially cattle.","zh":"“dehorners”指给动物（尤指牛）去角的人，或用于去角的工具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who removes the horns of an animal (especially cattle)","zh":"给动物（尤指牛）去角的人"},"examples":[{"en":"The ranch hired experienced dehorners to handle the young calves safely.","zh":"牧场雇了有经验的去角工来安全处理小牛。"},{"en":"Dehorners usually work carefully to reduce stress and injury to the herd.","zh":"去角工通常会小心操作，以减少牛群的压力和受伤风险。"}]},{"partOfSpeech":"n.","definition":{"en":"a tool or device used to remove the horns of an animal","zh":"去角器；去角工具（用于切除动物角的器具）"},"examples":[{"en":"They disinfected the dehorners before starting.","zh":"他们在开始前对去角器进行了消毒。"},{"en":"The vet recommended using proper dehorners and pain control.","zh":"兽医建议使用合适的去角工具并进行镇痛处理。"}]}],"synonyms":["dehorning tool","horn cutter","disbudding tool"],"phonetic":"/diˈhɔrnər/","extraExplanation":["“Dehorners”是复数形式；单数是“dehorner”。这个词多见于畜牧业与兽医语境。","在动物福利讨论中，也常见更广义的说法“disbudding（去芽）”，指在幼龄时处理尚未长成的角芽，通常比成年后去角更常被认为能减少伤害与应激。"]}
{"word":"dehorning","summary":{"en":"Dehorning is the process of removing an animal’s horns, especially in cattle.","zh":"Dehorning 指给动物（尤其是牛）去角的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of removing an animal’s horns (or horn buds), especially in cattle, to prevent injury and make handling safer","zh":"去角；除角（把动物的角或角芽去除的过程，常见于牛等，以减少伤害并便于管理）"},"examples":[{"en":"The farm schedules dehorning when the calves are very young.","zh":"农场会在小牛很小的时候安排去角。"},{"en":"Dehorning can reduce injuries in crowded barns.","zh":"在拥挤的牛舍里，去角可以减少受伤。"},{"en":"Some buyers ask whether dehorning was done humanely.","zh":"有些买家会询问去角是否以人道方式进行。"}]}],"synonyms":["dehorning procedure","horn removal","dehorning (process)"],"phonetic":"/diˈhɔrnɪŋ/","extraExplanation":["“Dehorning”来自动词“dehorn”（给……去角）。在畜牧业里常与“disbudding（去角芽）”一起出现：前者通常指已经长出角后的去角，后者多指在角芽阶段处理。","在英语语境中，这个词常出现在动物福利讨论里，相关搭配有“pain relief（镇痛）”“humane practices（人道做法）”“animal welfare standards（动物福利标准）”。不同国家/地区对操作时机、麻醉或镇痛要求可能不同。"]}
{"word":"dehorns","summary":{"en":"“Dehorns” means removes an animal’s horns, or (figuratively) takes away power to do harm.","zh":"“Dehorns”指给动物去角；也可比喻削弱某人/某机构的威胁或权力。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove the horns of an animal (especially cattle), usually for safety","zh":"（尤指牛）去角；切除动物的角（多为安全考虑）"},"examples":[{"en":"The farmer dehorns young calves to prevent injuries in the herd.","zh":"农场主会给小牛去角，以防牛群里发生伤害。"},{"en":"Some farms dehorn cattle, while others use naturally hornless breeds.","zh":"有些农场会给牛去角，也有些会选择天生无角的品种。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative) to reduce someone’s power or ability to cause harm","zh":"（比喻）削弱（某人/某机构）的力量；使其不再有威胁"},"examples":[{"en":"The new rules dehorn companies that try to cheat customers.","zh":"新规定削弱了那些试图欺骗消费者的公司的“牙齿”。"},{"en":"The reforms dehorned the agency by limiting its authority.","zh":"这些改革通过限制权限削弱了该机构的权力。"}]}],"synonyms":["remove horns","disarm","defang","weaken","strip of power"],"phonetic":"/diːˈhɔrn/","extraExplanation":["“dehorns”是动词“dehorn”的第三人称单数（he/she/it dehorns）。常见于畜牧业语境：为减少牛在拥挤环境中顶伤彼此或伤人而进行去角。实际操作与动物福利相关，在不同地区可能有不同规范与做法。"]}
{"word":"dehors","summary":{"en":"Dehors means “the outside,” especially someone’s outward appearance; more rarely, it can mean “outdoors.”","zh":"dehors 表示“外部/外表”；较少见地也可表示“在户外”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the outside; the exterior (especially the outward appearance of a person or thing)","zh":"外部；外表（尤指人或事物的外在表现）"},"examples":[{"en":"Behind his calm dehors, he was extremely nervous.","zh":"在他平静的外表之下，其实非常紧张。"},{"en":"The hotel’s elegant dehors hides some outdated rooms.","zh":"这家酒店优雅的外观掩盖了部分陈旧的房间。"}]},{"partOfSpeech":"adv.","definition":{"en":"outside; outdoors (rare in modern English)","zh":"在外面；在户外（现代英语中较少用）"},"examples":[{"en":"They chose to dine dehors on a warm evening.","zh":"在温暖的夜晚，他们选择在户外用餐。"}]}],"synonyms":["exterior","outside","outward appearance","outward manner","façade"],"phonetic":"/dəˈhɔr/","extraExplanation":["“dehors”源自法语，字面意思是“在外面/外部”。在英文里多见于较正式或文学语境，常用来强调“外表、外在风度”。","有时会与法语的“dedans”（里面、内在）对照使用，用来表达“外在 vs. 内在”的对比。","在餐饮语境中，表示“在户外用餐”时更常见的英语说法是“outdoors / outside / al fresco”。"]}
{"word":"dehort","summary":{"en":"“Dehort” means to strongly advise against doing something; it’s a rare word today.","zh":"“dehort”表示强烈劝阻（不做某事），如今属于较少使用的词。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to strongly advise someone not to do something; to discourage or dissuade","zh":"强烈劝阻某人不要做某事；劝退、劝止"},"examples":[{"en":"The doctor dehorted him from drinking alcohol during treatment.","zh":"医生强烈劝阻他在治疗期间饮酒。"},{"en":"Her friends tried to dehort her from quitting school.","zh":"她的朋友们试图劝她不要退学。"},{"en":"The guide dehorted tourists from feeding the wild animals.","zh":"导游劝阻游客喂野生动物。"}]}],"synonyms":["dissuade","discourage","warn against","caution against"],"phonetic":"/diˈhɔrt/","extraExplanation":["“dehort”很少见，语气比“discourage”更强，接近“dissuade/urge someone not to…（力劝不要……）”。在现代英语里更常用“dissuade”或“warn against”。","词源来自拉丁语 dehortari（de- 表“向下/离开”，hortari 表“劝告、鼓励”），整体含义就是“劝离、劝退”。"]}
{"word":"dehortation","summary":{"en":"Dehortation means a strong warning or advice intended to stop someone from doing something.","zh":"dehortation 指强烈劝阻或告诫，目的是让人不要做某事。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of strongly advising someone not to do something; a warning meant to discourage an action","zh":"强烈劝阻（别人不要做某事）；旨在阻止某种行为的告诫"},"examples":[{"en":"The doctor’s dehortation was clear: don’t smoke again.","zh":"医生的劝阻很明确：不要再抽烟了。"},{"en":"Despite his parents’ dehortation, he quit school to travel.","zh":"尽管父母强烈劝阻，他还是退学去旅行了。"}]}],"synonyms":["warning","discouragement","admonition","caution"],"phonetic":"/ˌdiː.hɔrˈteɪ.ʃən/","extraExplanation":["“Dehortation”比较正式、书面，常见于宗教讲道、演讲或正式劝诫的语境。日常英语里更常用 warning、discouragement、advice not to…、urge someone not to… 等表达。","词源来自拉丁语：de-（向下/离开）+ hortari（劝说、鼓励）。它与 “exhortation”（劝勉、鼓励去做某事）正好相对：exhortation = 鼓励去做；dehortation = 劝阻不要做。"]}
{"word":"dehortative","summary":{"en":"Dehortative describes language used to urge someone not to do something (like “Don’t…”).","zh":"Dehortative 指语言中用于劝阻别人不要做某事的表达（类似“Don’t…”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Linguistics) Used to describe a form (often an imperative or particle) that advises or urges someone not to do something; expressing a prohibition or warning like “don’t …”.","zh":"（语言学）指一种用来劝阻或强烈建议“不要做某事”的形式（常与祈使句或语气词相关）；表达类似“别……/不要……”的禁止或告诫。"},"examples":[{"en":"In some grammars, “Don’t touch that!” is described as a dehortative imperative.","zh":"在一些语法描述中，“Don’t touch that!” 会被称为一种 dehortative（劝阻式）的祈使句。"},{"en":"The particle functions as a dehortative marker, warning the listener not to proceed.","zh":"这个语气词起到 dehortative（劝阻）标记的作用，提醒听者不要继续。"}]}],"synonyms":["prohibitive","warning","discouraging","negative imperative"],"phonetic":"/diˈhɔr.tə.tɪv/","extraExplanation":["这个词主要用于语言学写作，不是日常英语常用词。你更常见到的表达是：don’t + 动词（Don’t go. / Don’t do that.）或一些带有“劝阻/警告”语气的说法（You’d better not…, Please don’t…。）","dehortative 来自拉丁语词根：de-（向下/离开）+ hortari（劝告、鼓励）。hortative 表示“劝做/鼓励做”，dehortative 则相当于“劝不要做”。","在一些语言中会有专门的“劝阻式”语法形式或小词（相当于英语里用 don’t 来表达）。英语一般不把它当作独立“语气（mood）”来标记，而是用否定祈使结构来实现。"]}
{"word":"dehortatory","summary":{"en":"Dehortatory means discouraging an action—advising someone not to do something.","zh":"dehortatory 指“劝阻的”，即劝人不要做某事。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Intended to discourage someone from doing something; advising against an action (the opposite of “exhortatory,” which urges action).","zh":"（用来）劝阻的；劝人不要做某事的；建议不要采取某种行动的（与 exhortatory“劝人去做”的意思相反）。"},"examples":[{"en":"The doctor gave a dehortatory warning about smoking.","zh":"医生给出了劝人不要吸烟的警告。"},{"en":"His dehortatory tone made it clear that joining the scheme was a bad idea.","zh":"他那种劝阻的语气表明，参与这个计划不是好主意。"}]}],"synonyms":["discouraging","cautionary","dissuading","advising against","warning"],"phonetic":"/diˌhɔrˈtɔri/","extraExplanation":["这个词非常少见，更多出现在正式写作、修辞学（演讲/劝说方式）或学术语境中。日常英语里通常会用 discouraging, cautionary, advising against 等更常见的表达。","词源上可理解为 de-（“向下/相反”）+ hortatory（“劝勉、鼓动”），所以整体就是“反向劝勉”——劝人不要做。"]}
{"word":"dehorted","summary":{"en":"“Dehorted” means “strongly advised against; discouraged,” but it’s a rare, formal word.","zh":"“dehorted”意为“强烈劝阻/建议不要做；使打消念头”，但属于少见且较正式的词。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense/past participle of dehort) to strongly advise someone not to do something; to discourage or dissuade.","zh":"（dehort 的过去式/过去分词）强烈劝阻某人不要做某事；劝退、劝止。"},"examples":[{"en":"The doctor dehorted him from smoking after the diagnosis.","zh":"确诊后，医生强烈劝他戒烟。"},{"en":"She was dehorted from quitting her job without a plan.","zh":"她被劝阻不要在没有计划的情况下辞职。"},{"en":"His friends dehorted him from taking the dangerous shortcut.","zh":"朋友们劝他别走那条危险的捷径。"}]}],"synonyms":["dissuaded","discouraged","warned against","advised against","deterred"],"phonetic":"/dɪˈhɔrt/","extraExplanation":["“dehort”非常少见，较正式，常见于较老的书面语或修辞/演讲语境。日常英语里更常用：dissuade（劝阻）、discourage（劝退/使泄气）、warn against（警告不要）、advise against（建议不要）。","词源来自拉丁语 *dehortari*（de- 表“离开/相反”，hortari 表“鼓励/劝说”），可理解为“反向劝说＝劝阻”。"]}
{"word":"dehorter","summary":{"en":"A dehorter is someone who tries to persuade you not to do something.","zh":"dehorter 指劝阻你不要做某事的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who advises someone not to do something; a discourager or dissuader","zh":"劝阻者；劝人不要做某事的人；阻止者"},"examples":[{"en":"As a dehorter, she urged her friend not to quit school impulsively.","zh":"作为一名劝阻者，她劝朋友不要冲动退学。"},{"en":"The counselor served as a dehorter, warning the students against drinking and driving.","zh":"那位辅导员起到劝阻者的作用，告诫学生不要酒后驾车。"}]}],"synonyms":["dissuader","discourager","adviser against","cautioner"],"phonetic":"/diˈhɔɹtɚ/","extraExplanation":["“dehorter”来自动词“dehort”（劝阻、劝人不要做），源自拉丁语 *dehortari*。在现代英语中非常少见，更常用的表达是 “dissuader / discourager / someone who advised against it”。","在修辞或正式写作里，“dehortation”指“劝阻性的劝告/演说”，与“exhortation（劝勉、激励）”相对。"]}
{"word":"dehorting","summary":{"en":"“Dehorting” means actively advising or urging someone not to do something.","zh":"“dehorting”表示积极劝阻、告诫某人不要做某事。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Present participle of dehort) advising someone not to do something; discouraging or warning against an action.","zh":"（dehort 的现在分词）劝阻某人不要做某事；告诫、劝人停止某种行动。"},"examples":[{"en":"The doctor was dehorting him from smoking after the surgery.","zh":"手术后，医生劝阻他不要再抽烟。"},{"en":"Her speech focused on dehorting young people from dangerous online challenges.","zh":"她的演讲主要在劝告年轻人不要参与危险的网络挑战。"}]}],"synonyms":["discouraging","advising against","warning against","dissuading","cautioning"],"phonetic":"/dɪˈhɔrtɪŋ/","extraExplanation":["“dehort”很正式、也相对少见，常见替代说法有 discourage / advise against / warn against。","词源来自拉丁语 dehortari，含义是“劝离、劝阻”。在学术写作、宗教或演讲文本中偶尔会见到。"]}
{"word":"dehorts","summary":{"en":"“Dehorts” means “discourages; urges someone not to do something” (3rd-person singular of the rare verb “dehort”).","zh":"dehorts 表示“劝阻；劝人不要做某事”，是罕见动词 dehort 的第三人称单数形式。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to advise or urge someone not to do something; to discourage","zh":"劝阻；劝人不要做某事；使打消念头"},"examples":[{"en":"The teacher dehorted the students from skipping class.","zh":"老师劝阻学生不要逃课。"},{"en":"Friends tried to dehort him from making a rushed decision.","zh":"朋友们试图劝他不要仓促做决定。"},{"en":"She dehorts her brother from driving in the storm.","zh":"她劝弟弟不要在暴风雨中开车。"}]}],"synonyms":["discourage","dissuade","deter","talk someone out of (doing something)"],"phonetic":"/diˈhɔrt/","extraExplanation":["“dehorts”通常是动词“dehort”的第三人称单数现在时（he/she dehorts）。这个词非常少见、偏书面或古风；更常见的表达是 discourage / dissuade / talk someone out of (doing) 等。","容易与外来词“dehors”混淆：dehors（源自法语）常见于固定搭配“from without; from outside”（“从外面/外部地”），在英语中较少用；而 dehort 是“劝阻”。如果你能提供原句，我可以帮你判断到底是哪一个。"]}
{"word":"dehqan","summary":{"en":"Dehqan is a historical term for a Persian local landowning gentry member (and sometimes a village notable) in late Sasanian and early Islamic Iran.","zh":"Dehqan 是历史术语，指萨珊晚期至伊斯兰早期伊朗的波斯地方地主士绅（有时也泛指乡村显要/村长）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A member of the Persian landed gentry in late Sasanian and early Islamic Iran, often a local landowner/administrator and a key source of Persian culture and tradition.","zh":"（历史用语）指萨珊晚期至伊斯兰早期伊朗的波斯地方地主士绅阶层成员，常兼具地方管理者身份，也是波斯文化传统的重要承载者。"},"examples":[{"en":"In some early Islamic histories, the dehqan appears as a local landowner who negotiates with new rulers.","zh":"在一些伊斯兰早期史书中，dehqan 常被写成与新统治者周旋的地方地主。"},{"en":"The dehqans preserved Persian stories and courtly customs long after the fall of the Sasanian Empire.","zh":"萨珊帝国灭亡后很久，dehqans 仍保存着波斯故事与宫廷礼俗。"}]},{"partOfSpeech":"n.","definition":{"en":"(broader/looser use) A village notable such as a headman, elder, or influential rural landholder in Persian-speaking contexts.","zh":"（较宽泛用法）在波斯语语境中指乡村显要人物，如村长、长者或有影响力的乡村地主。"},"examples":[{"en":"The traveler sought help from the dehqan, who knew the fields and canals best.","zh":"旅行者向 dehqan 求助，因为他最熟悉田地和水渠。"},{"en":"A dispute was brought before the dehqan to be settled according to local custom.","zh":"一场纠纷被提交给 dehqan，按地方习俗裁决。"}]}],"synonyms":["landowner","Persian gentry","local notable","village headman"],"phonetic":"/dɛhˈkɑn/","extraExplanation":["词源来自波斯语（常见转写：dehqan / dihqān），与“deh（村庄）”有关；在萨珊到阿拔斯早期的社会结构中，dehqan 既可能是地方地主，也常承担税赋、行政与乡里治理的角色。","在英语学术写作里，这个词多出现在伊朗史、阿拉伯—波斯史料研究中，属于带有时代背景的“历史术语”，日常英语很少使用；常见复数写法为 dehqans。"]}
{"word":"Dehradun","summary":{"en":"Dehradun is a city in northern India and the capital of Uttarakhand; it can also refer to the surrounding district.","zh":"Dehradun（德拉敦）是印度北部城市、北阿坎德邦首府；也可指其周边的德拉敦行政区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in northern India, the capital of the state of Uttarakhand, located in the Doon Valley near the Himalayan foothills.","zh":"印度北部城市，北阿坎德邦（Uttarakhand）的首府，位于喜马拉雅山麓附近的杜恩河谷（Doon Valley）。"},"examples":[{"en":"Dehradun is the capital of Uttarakhand and a gateway to hill towns like Mussoorie.","zh":"德拉敦是北阿坎德邦的首府，也是通往穆索里（Mussoorie）等山城的门户。"},{"en":"Many people travel through Dehradun on their way to Rishikesh and Haridwar.","zh":"很多人去瑞诗凯诗（Rishikesh）和哈里德瓦（Haridwar）时会途经德拉敦。"}]},{"partOfSpeech":"n.","definition":{"en":"The surrounding administrative area (Dehradun district) that includes the city and nearby towns and villages.","zh":"德拉敦区（Dehradun district）：包含该城市及周边城镇与乡村的行政区域。"},"examples":[{"en":"The earthquake was felt across Dehradun district.","zh":"这次地震在德拉敦区多地都有震感。"}]}],"synonyms":["Dehra Dun"],"phonetic":"/ˌdeɪrəˈduːn/","extraExplanation":["“Dehradun”也常写作“Dehra Dun”（较旧或较传统的拼写）。","词源常被解释为“dera（营地/定居点）+ dun（山谷）”，指位于杜恩河谷中的聚落。","在印度语境中，它常被视为通往喜马拉雅山区与宗教名城（如Rishikesh、Haridwar）的重要交通与教育中心。"]}
{"word":"Dehue","summary":{"en":"“Dehue” is most often used in editing to mean removing/reducing hue; it can also be a surname or brand name.","zh":"“Dehue”多用于调色/编辑中表示“去色相”；也可能是姓氏或品牌名。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(image/video editing) to remove or reduce the hue (color tone) of something, often making it look more neutral or closer to grayscale.","zh":"（图像/视频编辑）去色相；减少色相（颜色倾向），常使画面更中性或更接近灰度。"},"examples":[{"en":"Try to dehue the background so the subject stands out.","zh":"试着把背景去色相，这样主体会更突出。"},{"en":"The filter dehues the shadows to create a colder, more muted mood.","zh":"这个滤镜会降低阴影的色相，营造更冷、更克制的氛围。"}]},{"partOfSpeech":"other","definition":{"en":"a family name or brand name (proper noun); meaning depends on the person or company.","zh":"姓氏或品牌名（专有名词）；含义取决于具体的人或公司。"},"examples":[{"en":"Dehue is listed as the author on the report.","zh":"报告上署名作者为 Dehue。"},{"en":"I bought it from Dehue, the local supplier.","zh":"我是从本地供应商 Dehue 那里买的。"}]}],"synonyms":["desaturate","neutralize (the hue)","remove color cast"],"phonetic":"/diːˈhjuː/","extraExplanation":["“Dehue”并不是非常常见的标准英语词；在设计/调色语境里，它常被当作动词使用，类似“desaturate（降低饱和度）”或“neutralize the hue（中和色相）”。严格来说，降低饱和度不一定等于去色相：desaturate 更强调颜色变淡，而 dehue 更强调去掉某种颜色偏向。","如果你是在姓名、地名或产品上看到 “Dehue”，那多半是专有名词，通常不翻译，直接保留拼写。"]}
{"word":"dehull","summary":{"en":"Dehull means to remove the outer hull from grains, seeds, nuts, or beans.","zh":"dehull 指把谷物、种子、坚果或豆类的外壳/外皮去掉。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove the hull (outer covering) from seeds, grains, nuts, or beans","zh":"给（种子、谷物、坚果或豆类）去壳；去除外皮"},"examples":[{"en":"The factory dehulls soybeans before making tofu and soy milk.","zh":"工厂在制作豆腐和豆浆之前会先给大豆去壳。"},{"en":"You can dehull sunflower seeds to make them easier to eat or grind.","zh":"你可以把葵花籽去壳，让它们更容易吃或研磨。"},{"en":"Dehulled oats cook faster and have a smoother texture.","zh":"去壳燕麦煮得更快，口感也更细腻。"}]}],"synonyms":["hull","shell","remove the husk","remove the outer covering"],"phonetic":"/diˈhʌl/","extraExplanation":["“de-”在英语里常表示“去除、反向”，例如 dehull（去壳）、debone（去骨）、deice（除冰）。","hull 指“外壳/外皮”，在食品加工语境里很常见：dehulled soybeans（去壳大豆）、dehulled oats（去壳燕麦）。有时也会看到近义词 hull（给……去壳）或 shell（给……剥壳），但 dehull 更偏向工业/加工用语。"]}
{"word":"dehulled","summary":{"en":"“Dehulled” means the hull (outer shell) has been removed from a grain or seed.","zh":"“dehulled”表示谷物或种子已经去壳/脱壳。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of grains, seeds, or nuts) with the outer husk or shell removed, usually for easier cooking, eating, or processing.","zh":"（指谷物、种子或坚果）去壳的；去除外层外壳/麸皮的（通常为了更易烹煮、食用或加工）。"},"examples":[{"en":"Dehulled oats cook faster than whole oats.","zh":"去壳燕麦比整粒燕麦煮得更快。"},{"en":"The recipe calls for dehulled sesame seeds.","zh":"这道食谱需要去壳芝麻。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of “dehull”: to remove the hull (outer covering) from grains or seeds.","zh":"“dehull”的过去式/过去分词：给谷物或种子脱壳、去除外层壳（外皮）。"},"examples":[{"en":"The factory dehulled the rice before packaging it.","zh":"工厂在包装前先把大米脱壳处理。"},{"en":"The beans are dehulled and then split to make dal.","zh":"这些豆子先脱壳再分瓣，用来做达尔豆（dal）。"}]}],"synonyms":["hulled","shelled","husked"],"phonetic":"/diˈhʌld/","extraExplanation":["“dehulled”常见于食品标签与烹饪语境，尤其是谷物（oats, rice）、豆类（mung beans）、油籽（sesame）等。“hull/壳/外皮”去掉后通常更好煮、更好消化，但有时也会减少部分膳食纤维与微量营养素。注意它和“peeled（去皮）”不同：peeled多指水果蔬菜的皮；dehulled多指种子/谷物的外壳。"]}
{"word":"dehuller","summary":{"en":"A dehuller is usually a machine that removes the outer husk or hull from grains or seeds.","zh":"dehuller 通常指“脱壳机/去壳机”，用于去除谷物或种子的外壳。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a machine or device that removes the outer husk/hull from grains, seeds, or nuts (for example, rice or sunflower seeds).","zh":"去壳机；脱壳机（把谷物、种子或坚果的外壳/壳皮去掉的机器或装置）。"},"examples":[{"en":"The rice passes through a dehuller before it is polished.","zh":"稻谷在抛光之前会先经过脱壳机。"},{"en":"A small dehuller can help you process sunflower seeds at home.","zh":"小型去壳机可以帮助你在家处理葵花籽。"}]},{"partOfSpeech":"n.","definition":{"en":"a person whose job is to remove hulls from grains or seeds (less common).","zh":"脱壳工；去壳的人（较少见）。"},"examples":[{"en":"In the old mill, a dehuller worked beside the grinders.","zh":"在老磨坊里，脱壳工在磨粉工旁边工作。"}]}],"synonyms":["huller","sheller","husker"],"phonetic":"/diːˈhʌlər/","extraExplanation":["“de-”是英语里常见的前缀，表示“去除/除掉”（如 de-ice 去冰、debone 去骨）；“hull”指“外壳/壳皮”。因此 dehuller 字面意思就是“把壳去掉的（机器/人）”。","在食品加工语境中，dehuller 常用于稻米加工（去掉稻壳得到糙米），也可用于燕麦、荞麦、葵花籽等。不同作物的外壳硬度不同，设备结构也会不同。"]}
{"word":"dehulling","summary":{"en":"Dehulling means removing the outer hull/husk from grains, seeds, or nuts.","zh":"Dehulling 指把谷物、种子或坚果的外壳/外皮去掉（去壳、脱壳）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of removing the outer husk or shell (the hull) from grains, seeds, or nuts","zh":"去壳；脱壳（把谷物、种子或坚果的外皮/壳去掉的过程）"},"examples":[{"en":"Dehulling rice removes the tough outer husk before further milling.","zh":"稻米去壳会先去掉坚硬的外层稻壳，然后再进行后续碾磨。"},{"en":"Many factories use machines for dehulling sunflower seeds.","zh":"许多工厂用机器给葵花籽脱壳。"}]},{"partOfSpeech":"v.","definition":{"en":"removing the hull from grains, seeds, or nuts","zh":"给（谷物、种子或坚果）去壳；脱壳"},"examples":[{"en":"The workers are dehulling peanuts for peanut butter production.","zh":"工人们正在给花生脱壳，用于生产花生酱。"},{"en":"Some people dehull oats at home to make them easier to cook.","zh":"有些人在家给燕麦去壳，让它更容易煮。"}]}],"synonyms":["dehusking","hulling","shelling"],"phonetic":"/diːˈhʌlɪŋ/","extraExplanation":["“dehulling”来自前缀 de-（表示“去掉、移除”）+ hull（外壳/外皮）。在食品加工中很常见：例如稻谷去壳得到糙米；再进一步碾磨才会变成白米。","相关词：hull（n./v. 外壳；给……去壳）、dehusk（更常指去“外皮/外壳”，尤其用于谷物）、shelling（更常用于坚果或贝类“剥壳”）。在不同食材上，英语会偏好不同动词。"]}
{"word":"dehulls","summary":{"en":"“Dehulls” means removes the hull/husk from seeds or grains.","zh":"“dehulls”指给种子或谷物等脱壳/去壳皮。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"removes the outer covering (hull/husk) from seeds, grains, nuts, or beans (third-person singular of “dehull”).","zh":"去除（种子、谷物、坚果、豆类等的）外壳/壳皮；脱壳（“dehull”的第三人称单数）。"},"examples":[{"en":"The machine dehulls rice before it is polished.","zh":"这台机器先给稻米脱壳，然后再进行抛光处理。"},{"en":"This process dehulls sunflower seeds so they’re easier to eat.","zh":"这个过程给葵花籽脱壳，让它们更容易食用。"}]},{"partOfSpeech":"v.","definition":{"en":"removes an outer layer or casing from something (broader, less common use).","zh":"去掉某物的外层包裹/外皮（引申用法，不太常见）。"},"examples":[{"en":"The workers dehulls the pods to get the beans inside.","zh":"工人把豆荚“脱壳”以取出里面的豆子。"}]}],"synonyms":["husks","shells","shucks","peels (sometimes, depending on context)"],"phonetic":"/diˈhʌlz/","extraExplanation":["“de-”是英语里常见的前缀，表示“去掉、移除”（如：deice 去冰、defrost 除霜）。因此 dehull 字面意思就是“去掉 hull（外壳/壳皮）”。","hull 常指谷物（如稻米、燕麦）或种子外面较硬的壳/皮；在食品加工语境中，dehulling 是常见步骤，用于提高口感或便于食用。"]}
{"word":"dehumanisation","summary":{"en":"Dehumanisation means treating people as less than human, often to make harm or unfair treatment seem acceptable.","zh":"Dehumanisation 指把人当作不如人、非人的存在，常用来让伤害或不公看起来“合理”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or process of treating people as if they are not fully human (for example, as objects, animals, or numbers), often to justify cruelty, discrimination, or violence.","zh":"把人当作“不完全是人”的行为或过程（例如当作物品、动物或数字），常用来为残酷、歧视或暴力辩护。"},"examples":[{"en":"Propaganda can lead to dehumanisation by describing a group as animals or pests.","zh":"宣传可能通过把某个群体描述成动物或害虫来造成去人性化。"},{"en":"The novel shows how dehumanisation happens when prisoners are called by numbers instead of names.","zh":"这部小说展示了当囚犯被用号码而不是名字称呼时，去人性化如何发生。"}]},{"partOfSpeech":"n.","definition":{"en":"A specific way of speaking or acting that removes dignity and individuality from a person or group.","zh":"一种具体的言行方式，使个人或群体失去尊严与个体性。"},"examples":[{"en":"Mocking a patient’s pain is a form of dehumanisation.","zh":"嘲笑病人的痛苦是一种去人性化。"},{"en":"Some online comments show dehumanisation toward migrants.","zh":"一些网络评论对移民表现出明显的去人性化。"}]}],"synonyms":["degradation","objectification","demonization","denigration","depersonalization"],"phonetic":"/diˌhjuːmənaɪˈzeɪʃən/","extraExplanation":["“dehumanisation / dehumanization”英式与美式拼法不同，含义相同；学术与新闻中很常见。","常见搭配：dehumanisation of + 人群/对象（the dehumanisation of refugees 难民的去人性化）；动词是 dehumanise/dehumanize（使……失去人性/被非人化），形容词是 dehumanising/dehumanizing（去人性化的）。","在历史与文学语境中，这个词常用于讨论战争宣传、种族主义、奴隶制、集中营叙事等：通过剥夺名字、故事与情感，把人变成“可被处置的对象”。"]}
{"word":"dehumanise","summary":{"en":"Dehumanise means to deny someone’s humanity and dignity, treating them as less than human.","zh":"Dehumanise 指剥夺他人的人性与尊严，把人当作“不像人”的对象来对待。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to treat a person or group as if they are not fully human, often by denying their feelings, rights, or dignity","zh":"使（某人/某群体）失去“人”的地位；把人当作不完全是人来看待，常通过否认其感受、权利或尊严来实现"},"examples":[{"en":"Hate speech can dehumanise people and make violence seem acceptable.","zh":"仇恨言论会让人们被“去人化”，从而让暴力看起来变得可以接受。"},{"en":"The film shows how war can dehumanise both victims and soldiers.","zh":"这部电影展示了战争如何让受害者和士兵都被“去人化”。"}]},{"partOfSpeech":"vt.","definition":{"en":"to remove human qualities from something in art, writing, or design (for example, making characters feel less real or less empathetic)","zh":"（在艺术、写作或设计中）去除人性特质，使形象显得不真实、缺少同理心或情感"},"examples":[{"en":"Overusing stereotypes can dehumanise characters in a story.","zh":"过度使用刻板印象会让故事人物被“去人化”。"}]}],"synonyms":["degrade","demean","depersonalize","objectify"],"phonetic":"/diˈhjuːməˌnaɪz/","extraExplanation":["“dehumanise”是英式拼写；美式更常写作“dehumanize”。两者意思相同。","这个词常用于讨论宣传、种族主义、战争与大规模暴力：当人被描述成“害虫、怪物、数字”等，就更容易被剥夺同情与权利。"]}
{"word":"dehumanised","summary":{"en":"Dehumanised means treated as not fully human, with dignity and individuality taken away.","zh":"dehumanised 指被当作“不算人”来对待，被剥夺尊严与个性。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"treated as if not fully human; stripped of dignity, individuality, or empathy (often by insults, propaganda, harsh systems, or abuse).","zh":"被当作“不算完整的人”来对待；被剥夺尊严、个性或同理心（常见于辱骂、宣传、残酷制度或虐待中）。"},"examples":[{"en":"The prisoners were dehumanised and spoken to as if they were animals.","zh":"囚犯被去人性化对待，别人跟他们说话就像在对动物讲话一样。"},{"en":"Hate speech can dehumanise groups and make violence seem acceptable.","zh":"仇恨言论会让某些群体被去人性化，从而让暴力看起来“可以接受”。"},{"en":"The film shows how war can dehumanise both victims and soldiers.","zh":"这部电影展现了战争如何让受害者和士兵都被去人性化。"}]},{"partOfSpeech":"v.","definition":{"en":"past form of “dehumanise/dehumanize”: to remove human qualities from someone in the way you think about or treat them.","zh":"“dehumanise/dehumanize”的过去式：以思想或行为方式抹去他人的人性特质。"},"examples":[{"en":"The propaganda dehumanised the enemy to justify the invasion.","zh":"宣传把敌人去人性化，以为入侵辩护。"},{"en":"She felt dehumanised by the constant surveillance at work.","zh":"她觉得工作中持续的监控让自己失去被当作人的感觉。"}]}],"synonyms":["degraded","demeaned","objectified","depersonalized","devalued"],"phonetic":"/diːˈhjuːməˌnaɪzd/","extraExplanation":["“dehumanised”是英式拼写（-ise），美式更常写作“dehumanized”（-ize）。含义相同。","这个词常用于讨论战争宣传、种族歧视、极端言论、监狱/集中营制度、职场或服务系统中“把人当成数字/工具”的现象。写作中多用于严肃语境。"]}
{"word":"dehumanising","summary":{"en":"Dehumanising describes language or actions that deny people dignity and treat them as less than human.","zh":"Dehumanising 指否认他人尊严、把人当作低于人类来对待的言行。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Treating people as if they are not fully human (for example, like objects or animals), often in a cruel or disrespectful way.","zh":"把人当作“不完全是人”来对待（例如当作物品或动物），常带有残酷或不尊重的意味。"},"examples":[{"en":"Using racist stereotypes is dehumanising because it reduces people to labels.","zh":"使用种族刻板印象是去人性化的，因为它把人简化成标签。"},{"en":"The prisoners described the daily insults as dehumanising.","zh":"囚犯们说每天的侮辱让人感到被去人性化。"},{"en":"Talking about migrants as “floods” or “swarms” can be dehumanising.","zh":"把移民说成“洪水”或“蜂群”之类的说法可能是去人性化的。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of dehumanise: to make someone feel or seem less human; to remove dignity or individuality.","zh":"dehumanise 的现在分词：使某人显得或感觉“不像人”；剥夺其尊严或个体性。"},"examples":[{"en":"The policy ended up dehumanising the people it was meant to help.","zh":"这项政策最终反而去人性化了原本想帮助的人。"},{"en":"Some propaganda works by dehumanising an enemy group.","zh":"一些宣传通过去人性化敌对群体来起作用。"}]}],"synonyms":["degrading","demeaning","humiliating","depersonalizing","objectifying"],"phonetic":"/diˈhjuməˌnaɪzɪŋ/","extraExplanation":["“dehumanising”是英式拼写；美式更常写作“dehumanizing”。意思相同。","这个词常用于讨论战争宣传、种族歧视、仇恨言论、极端监控或不公平制度等情境，强调“剥夺人的尊严与个体性”的道德问题。"]}
{"word":"dehumanization","summary":{"en":"Dehumanization is the process of treating people as less than human by denying their dignity or individuality.","zh":"Dehumanization 指通过否认尊严或个体性，把人当作“不像人”的对象对待的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of treating a person or group as less than human, often by denying their dignity, individuality, or rights","zh":"非人化：把个人或群体当作“不像人”的对象对待，常通过否认其尊严、个体性或权利来实现"},"examples":[{"en":"Dehumanization in propaganda can make violence seem acceptable.","zh":"宣传中的非人化会让暴力看起来“可以接受”。"},{"en":"Calling people animals is a form of dehumanization.","zh":"把人叫作“动物”是一种非人化。"},{"en":"The novel shows how dehumanization destroys both victims and perpetrators.","zh":"这部小说展现了非人化如何摧毁受害者和施害者双方。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of making something less human-like (for example, by removing human qualities from a character, voice, or design)","zh":"（较少用）去人性化：让某物变得不那么“像人”（例如在角色、声音或设计中移除人的特征）"},"examples":[{"en":"Some critics argued that the robot’s redesign was a dehumanization of its original character.","zh":"一些评论者认为，这次机器人的改版让原本的角色更“去人性化”。"}]}],"synonyms":["degradation","demeaning treatment","objectification","depersonalization"],"phonetic":"/diˌhjuːmənaɪˈzeɪʃən/","extraExplanation":["词形拆解：de-（去除、否定）+ human（人、人性）+ -ize（使成为）+ -ation（名词后缀）。因此 dehumanization 字面意思是“使失去人性/人的地位的过程”。","常见搭配：dehumanization of + 人/群体；systemic dehumanization（系统性非人化）；language of dehumanization（非人化语言）；to combat/oppose dehumanization（反对非人化）。","语境提示：在社会议题中，它常与 propaganda（宣传）、racism（种族主义）、war crimes（战争罪）、genocide（种族灭绝）等话题一起出现，强调“通过语言与观念把人降格”，从而更容易合理化不公或暴力。"]}
{"word":"dehumanize","summary":{"en":"Dehumanize means to treat someone as less than human, denying their dignity or individuality.","zh":"dehumanize 指把人当作不如人，否认其尊严或个体性，使其“失去人性”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to treat a person or group as less than human, often by denying their dignity, individuality, or rights","zh":"使（某人或某群体）失去人性；把人当作不如人（常通过否认其尊严、个体性或权利）"},"examples":[{"en":"Propaganda can dehumanize people by describing them as animals or objects.","zh":"宣传可能会通过把人形容成动物或物体来使人失去人性。"},{"en":"When we dehumanize others, it becomes easier to justify cruelty.","zh":"当我们把他人非人化时，就更容易为残酷行为找借口。"}]}],"synonyms":["degrade","demean","objectify","depersonalize","dehumanise"],"phonetic":"/diˈhjuːməˌnaɪz/","extraExplanation":["“de-”表示“去除、否定”，“human”是“人”，“-ize”表示“使变成……”。所以 dehumanize 字面意思就是“使不再像人一样”。","这个词常见于讨论战争、种族主义、极端主义、网络暴力与职场霸凌等话题：先用语言把人“物化/妖魔化”，再更容易对他们不公平或施暴。","常见搭配：dehumanize someone; dehumanize a group; dehumanizing language（非人化语言）; dehumanization（名词：非人化/去人性化）。","文学与公共写作中常用来批评“把人当成数字、工具或标签”的系统性做法，例如只把移民称为“非法者”、只把病人称为“病例”。"]}
{"word":"dehumanized","summary":{"en":"“Dehumanized” means treated as if not fully human, or (as a verb form) made to seem less human.","zh":"dehumanized 表示“被去人性化”，即被当作不像人来对待；也可作动词形式，表示“使去人性化”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person or group) treated as if they are not human, so their feelings, rights, or individuality are ignored.","zh":"（指个人或群体）被当作“不像人”来对待，以致其感受、权利或个体性被忽视。"},"examples":[{"en":"The prisoners were dehumanized and called by numbers instead of names.","zh":"囚犯被去人性化，只被用编号称呼而不是名字。"},{"en":"Racist propaganda tried to portray immigrants as dehumanized threats.","zh":"种族主义宣传试图把移民描绘成“去人性化”的威胁。"},{"en":"She said the job made her feel dehumanized, like a machine.","zh":"她说那份工作让她觉得被去人性化，像一台机器。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of “dehumanize”: to remove human qualities from, or to treat someone as less than human.","zh":"“dehumanize”的过去式/过去分词：使失去人性（特质）；把某人当作不如人来对待。"},"examples":[{"en":"The regime dehumanized political opponents to justify violence.","zh":"该政权把政治对手去人性化，以此为暴力辩护。"},{"en":"Online harassment can dehumanize people by reducing them to stereotypes.","zh":"网络骚扰可能通过把人简化为刻板印象而使人去人性化。"}]}],"synonyms":["inhuman","degrading","demeaning","depersonalized","objectified"],"phonetic":"/diˈhjumənaɪzd/","extraExplanation":["“dehumanized/去人性化”语气很强，常用于讨论战争、监狱、种族主义、极端宣传或冷漠的制度管理等情境，强调“把人当成物/数字/害虫/机器”。","常见搭配：dehumanized language（去人性化的语言）、dehumanized victims（被去人性化的受害者）、feel dehumanized（感觉被当成不是人）。","相关词：dehumanize（动词）、dehumanization（名词：去人性化过程）、humanize（使更有人性/更人性化）。"]}
{"word":"dehumanizes","summary":{"en":"“Dehumanizes” means treats people as less than human or strips away human qualities, often through language or systems.","zh":"“Dehumanizes”指把人当成不算人，或通过语言/制度等剥夺人的尊严与人性特质。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to treat a person or group as less than fully human (e.g., as an object, animal, or number), often to justify cruelty or unfair treatment","zh":"把人或群体当作“不像人”的存在（如当成物品、动物或数字），常用来为残忍或不公正的对待找借口"},"examples":[{"en":"Hate speech dehumanizes people and can lead to violence.","zh":"仇恨言论会把人“非人化”，并可能引发暴力。"},{"en":"The policy dehumanizes immigrants by describing them as a threat instead of as families.","zh":"这项政策通过把移民描述成“威胁”而不是“家庭”，在进行非人化。"},{"en":"When we reduce workers to numbers, it dehumanizes them.","zh":"当我们把劳动者简化成数字时，就是在让他们失去人的尊严。"}]},{"partOfSpeech":"v.","definition":{"en":"to remove or reduce human qualities (such as warmth, empathy, or individuality) from something, often in language, art, or systems","zh":"削弱或移除某种事物中的“人性特质”（如温暖、同理心或个体性），常见于语言、艺术或制度中"},"examples":[{"en":"The report’s cold wording dehumanizes the suffering it describes.","zh":"报告冷冰冰的措辞让它所描述的痛苦显得不那么“有人味”。"},{"en":"Some dystopian novels show how technology can dehumanize daily life.","zh":"一些反乌托邦小说展示了科技如何让日常生活变得“去人性化”。"}]}],"synonyms":["degrade","demean","depersonalize","objectify","devalue"],"phonetic":"/diˈhjuːmənaɪz/","extraExplanation":["“dehumanizes”是动词第三人称单数形式，原形是dehumanize：I/you/we/they dehumanize；he/she/it dehumanizes。","这个词常用于社会议题（种族歧视、战争宣传、网络暴力、对弱势群体的污名化等）。典型搭配有：dehumanize people / dehumanize a group / dehumanizing language。"]}
{"word":"dehumanizing","summary":{"en":"Dehumanizing describes words, actions, or conditions that treat people as less than human or unworthy of dignity and empathy.","zh":"Dehumanizing 指言语、行为或环境把人当作“不如人”的对象，剥夺其尊严与同理心。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"treating people as if they are not fully human; denying their dignity, feelings, or rights","zh":"将人当作“不完全是人”来对待；否认其尊严、感受或权利的"},"examples":[{"en":"Racist language is dehumanizing because it reduces people to stereotypes.","zh":"种族主义语言具有去人性化的效果，因为它把人简化成刻板印象。"},{"en":"The film shows how dehumanizing prison conditions can destroy hope.","zh":"这部电影展示了去人性化的监狱环境如何摧毁希望。"},{"en":"Online harassment can feel dehumanizing, as if you’re not a real person to them.","zh":"网络骚扰会让人感到被去人性化，好像在对方眼里你不是一个真实的人。"}]},{"partOfSpeech":"v.","definition":{"en":"making someone seem less human or less worthy of empathy (present participle of “dehumanize”)","zh":"使某人显得不那么像人或不值得同情（“dehumanize”的现在分词）"},"examples":[{"en":"By calling refugees “animals,” he was dehumanizing them.","zh":"他把难民称为“动物”，是在对他们进行去人性化。"},{"en":"The propaganda kept dehumanizing the enemy to justify violence.","zh":"宣传不断把敌人去人性化，以便为暴力行为辩护。"}]}],"synonyms":["demeaning","degrading","humiliating","depersonalizing","inhuman"],"phonetic":"/diˈhjuːməˌnaɪzɪŋ/","extraExplanation":["“dehumanize（去人性化）”由前缀 de-（去除、降低）+ human（人类的）+ -ize（使……化）构成；dehumanizing 常用来描述语言、制度或环境如何让人失去被当作“人”对待的基本尊重。","在新闻与学术语境中，dehumanizing 常与 racism（种族主义）、propaganda（宣传）、human rights（人权）、dignity（尊严）等词搭配。","注意：dehumanizing 多用于严肃语境，表达强烈的伦理批评；日常抱怨时若用它，语气会显得更重。"]}
{"word":"dehumidification","summary":{"en":"Dehumidification means removing moisture from the air to lower humidity.","zh":"dehumidification 指“除湿”：去除空气中的水分以降低湿度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of removing moisture (water vapor) from the air to reduce humidity","zh":"除湿；去湿（把空气中的水分/水蒸气去除以降低湿度的过程）"},"examples":[{"en":"Dehumidification helps prevent mold in basements during the summer.","zh":"夏天给地下室除湿有助于防止发霉。"},{"en":"The air conditioner provides cooling and dehumidification at the same time.","zh":"空调同时提供制冷和除湿。"},{"en":"Hospitals often use dehumidification to keep indoor air comfortable and safe.","zh":"医院常用除湿来保持室内空气舒适且更安全。"}]}],"synonyms":["moisture removal","humidity reduction","drying"],"phonetic":"/diˌhjuːˌmɪdɪfɪˈkeɪʃən/","extraExplanation":["这是一个技术/工程类名词，常见于暖通空调（HVAC）、家电说明书、建筑与防霉防潮语境。词形上由 de-（去除、降低）+ humid（潮湿的）+ -ification（使……成为/使……化的过程）构成，直观表示“把湿度降低的过程”。","相关设备与表达：dehumidifier（除湿机）；dehumidify（v. 除湿）。常见搭配：dehumidification system（除湿系统）、dehumidification process（除湿过程）、humidity control（湿度控制）。"]}
{"word":"dehumidified","summary":{"en":"“Dehumidified” means moisture has been removed (less humid), or it is the past form of “dehumidify.”","zh":"“dehumidified”表示“已除湿的/湿度降低的”，也可作动词dehumidify的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having had moisture removed; made less humid (often describing air, a room, or a building).","zh":"（空气/房间等）已除湿的；湿度被降低的。"},"examples":[{"en":"The museum keeps its galleries dehumidified to protect the paintings.","zh":"博物馆让展厅保持除湿，以保护画作。"},{"en":"Sleep was easier once the bedroom was dehumidified.","zh":"卧室除湿后，更容易睡着了。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past form of “dehumidify”: to remove moisture from air or a space.","zh":"dehumidify 的过去式/过去分词：给空气或空间除湿；去除水分。"},"examples":[{"en":"We dehumidified the basement after the storm.","zh":"暴风雨过后，我们给地下室做了除湿。"},{"en":"The air was dehumidified before it entered the lab.","zh":"空气进入实验室前先进行了除湿处理。"}]}],"synonyms":["dried","desiccated","less humid"],"phonetic":"/ˌdiː.hjuːˈmɪd.əˌfaɪd/","extraExplanation":["“de-”表示“去除/减少”，humid是“潮湿的”，-ify表示“使……变成”。所以dehumidify字面意思就是“使不潮湿/去除湿气”。","常见搭配：dehumidified air（除湿空气）、dehumidified room（除湿的房间）、keep sth dehumidified（让某处保持除湿状态）。","与humid/damp的区别：humid多指“空气湿度大”；damp更常指“表面或环境有点湿、潮”。除湿主要针对空气湿度。"]}
{"word":"dehumidifier","summary":{"en":"A dehumidifier is a machine that reduces humidity by removing moisture from the air.","zh":"dehumidifier 指“除湿机”，通过从空气中去除水分来降低湿度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A machine that removes moisture (water vapor) from the air, usually to make a room less humid.","zh":"除湿机；一种从空气中去除水分（水蒸气）的机器，常用于降低室内湿度。"},"examples":[{"en":"We use a dehumidifier in the basement to prevent mold.","zh":"我们在地下室用除湿机来防止发霉。"},{"en":"The dehumidifier filled up with water overnight.","zh":"除湿机一夜之间就装满了水。"},{"en":"If your room feels damp, try running a dehumidifier for a few hours.","zh":"如果房间感觉潮湿，可以开除湿机几小时试试。"}]}],"synonyms":["moisture remover","dehumidifying unit"],"phonetic":"/ˌdiːhjuːˈmɪdɪˌfaɪər/","extraExplanation":["“de-”表示“去除、减少”（如 dehydrate 脱水），humid 表示“潮湿的”，-ifier 表示“使……成为/起……作用的装置”。合起来就是“去除湿气的装置”。","常见使用场景：潮湿季节、地下室、浴室附近、储物间；主要目的包括减少霉菌、潮味和尘螨。与 air conditioner（空调）不同，除湿机的核心目标是“降湿”，不一定明显降温。"]}
{"word":"dehumidifiers","summary":{"en":"Dehumidifiers are machines that remove moisture from indoor air to reduce humidity.","zh":"Dehumidifiers 指“除湿机”，用于去除室内空气水汽、降低湿度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a machine that removes moisture (water vapor) from the air, especially inside a building","zh":"除湿机；用于降低室内空气湿度、去除水汽的机器"},"examples":[{"en":"We use a dehumidifier in the basement to prevent mold.","zh":"我们在地下室用除湿机来防止发霉。"},{"en":"Dehumidifiers help keep the air comfortable during humid summers.","zh":"在潮湿的夏天，除湿机能让空气更舒适。"},{"en":"Empty the water tank regularly if your dehumidifier doesn’t drain automatically.","zh":"如果你的除湿机不能自动排水，要定期把水箱倒空。"}]}],"synonyms":["moisture remover","humidity control unit"],"phonetic":"/diˌhjuːməˈdaɪfɚz/","extraExplanation":["“dehumidifier”由前缀 de-（表示“去除、减少”）+ humid（潮湿的）+ -ifier（使……成为/使……发生的装置或事物）组成，字面意思就是“去除湿气的装置”。","日常使用中常与“humidity（湿度）”“mold/mildew（霉菌/霉斑）”“musty smell（霉味）”“basement（地下室）”等搭配。美国家庭常在地下室、浴室或雨季潮湿地区使用。"]}
{"word":"dehumidifies","summary":{"en":"“Dehumidifies” means removes moisture from the air, making a place less humid.","zh":"“dehumidifies”表示给空气（或空间）除湿，使环境不那么潮湿。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove moisture from air (or a space), making it less humid","zh":"（从空气或空间中）除湿，使湿度降低"},"examples":[{"en":"This machine dehumidifies the basement to prevent mold.","zh":"这台机器给地下室除湿，以防止发霉。"},{"en":"An air conditioner also dehumidifies the air as it cools it.","zh":"空调在制冷的同时也会给空气除湿。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become less humid; to reduce humidity","zh":"变得不那么潮湿；湿度降低"},"examples":[{"en":"After the storm passed, the air slowly dehumidifies overnight.","zh":"暴风雨过去后，空气在夜里慢慢变得不那么潮湿。"}]}],"synonyms":["dries","reduces humidity","removes moisture","drains moisture"],"phonetic":"/diˌhjuːˈmɪdɪˌfaɪz/","extraExplanation":["“dehumidifies”是动词“dehumidify”的第三人称单数现在时：he/she/it dehumidifies。常见名词是“dehumidifier”（除湿机）。前缀“de-”有“去除、减少”的意思（如 de-ice 去冰），humid 表示“潮湿的”。"]}
{"word":"dehumidify","summary":{"en":"Dehumidify means to remove moisture from the air or a space; it can also mean to become less humid.","zh":"dehumidify 表示“除湿、去除空气或空间中的湿气”，也可表示“变得不那么潮湿”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove moisture (water vapor) from the air or from a place, usually using a machine","zh":"（通常用机器）去除空气或某个空间中的湿气；除湿"},"examples":[{"en":"We use a dehumidifier to dehumidify the basement in summer.","zh":"夏天我们用除湿机给地下室除湿。"},{"en":"The hotel dehumidifies its rooms during the rainy season to prevent mold.","zh":"雨季时酒店会给房间除湿，以防发霉。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become less humid; to lose moisture","zh":"变得不那么潮湿；湿气减少"},"examples":[{"en":"After the storm passed, the air slowly dehumidified.","zh":"暴风雨过去后，空气慢慢变得没那么潮湿了。"}]}],"synonyms":["dry","remove moisture","dry out"],"phonetic":"/ˌdiːhjuːˈmɪdɪˌfaɪ/","extraExplanation":["词形拆解：de-（去除、逆转）+ humid（潮湿的）+ -ify（使……变成）。所以 dehumidify 直观意思就是“使不潮湿/除湿”。","常见搭配：dehumidify a room/house/basement（给房间/房子/地下室除湿）；dehumidify the air（给空气除湿）。名词是 dehumidifier（除湿机）。","语境提示：在日常英语里更常见的是名词 dehumidifier；动词 dehumidify 多见于说明书、工程/建筑、酒店管理等较正式的场景。"]}
{"word":"dehumidifying","summary":{"en":"Dehumidifying means removing moisture from the air to make it less humid.","zh":"dehumidifying 指“除湿”，把空气中的水分去除，使湿度降低。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Removing moisture from the air; reducing humidity.","zh":"除湿的；降低空气湿度的。"},"examples":[{"en":"The dehumidifying function helps keep the room comfortable in summer.","zh":"除湿功能能让房间在夏天更舒适。"},{"en":"We turned on the dehumidifying mode to prevent mold.","zh":"我们打开除湿模式来防止发霉。"}]},{"partOfSpeech":"n.","definition":{"en":"The process of removing moisture from the air (using a device or system).","zh":"除湿（的过程）；把空气中的水分去除。"},"examples":[{"en":"Dehumidifying is important in basements and bathrooms.","zh":"地下室和浴室很需要除湿。"},{"en":"Good ventilation plus dehumidifying can reduce musty smells.","zh":"良好通风加上除湿可以减少霉味。"}]}],"synonyms":["drying","moisture-removing","humidity-reducing"],"phonetic":"/ˌdiːhjuːˈmɪdɪfaɪɪŋ/","extraExplanation":["在日常英语里，更常见的名词是 dehumidification（除湿），更常见的形容词是 dehumidifying（除湿的）或 dehumidified（已除湿的）。","在空调/除湿机上常见的说法有：dehumidifying mode（除湿模式）、dry mode（干燥/除湿模式）。dry mode 更口语、更常见。"]}
{"word":"dehusk","summary":{"en":"To dehusk means to remove the outer husk from grains, seeds, or nuts.","zh":"dehusk 指给谷物、种子或坚果去掉外层的壳或皮（脱壳）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove the husk (outer shell) from a grain, seed, or nut","zh":"给谷物、种子或坚果去壳／脱壳（去掉外层的壳或皮）"},"examples":[{"en":"The factory dehusks rice before it is polished and packaged.","zh":"工厂在抛光和包装之前先给稻米脱壳。"},{"en":"We dehusked the corn to prepare it for drying.","zh":"我们把玉米去壳，好准备晾干。"}]}],"synonyms":["hull","shell","shuck"],"phonetic":"/diˈhʌsk/","extraExplanation":["“de-”是常见前缀，常表示“去除、反向”（如 de-ice 去冰、debone 去骨），所以 dehusk 字面意思就是“去掉 husk（壳、外皮）”。","dehusk 常用于农业和食品加工语境（如稻米脱壳、可可豆去壳等）。类似表达还有 hull（去壳）与 shell（剥壳），但 dehusk 更强调去掉“husk”这种较薄的外层皮/壳。"]}
{"word":"dehusked","summary":{"en":"“Dehusked” means the outer husk has been removed (often for grains or corn).","zh":"“dehusked”指外层的谷壳/外壳已被去除（常用于谷物或玉米等）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having had the husk (outer shell or covering) removed.","zh":"去壳的；去外皮的（指去掉谷壳、外壳等外层覆盖物）。"},"examples":[{"en":"The recipe calls for dehusked rice, which cooks faster.","zh":"这个食谱需要用去壳米，这样煮得更快。"},{"en":"Dehusked corn is easier to grind into flour.","zh":"去壳的玉米更容易磨成玉米粉。"}]}],"synonyms":["hulled","shelled","huskless"],"phonetic":"/diˈhʌskt/","extraExplanation":["“de-”是英语中常见前缀，表示“去除、移开”（如: de-ice 除冰、debone 去骨）。因此 dehusked = de-（去除）+ husk（外壳/谷壳）+ -ed（完成的状态）。","常见使用场景多在食品、农业与加工领域：如 dehusked rice（去壳米/糙米的加工相关表达）、dehusked barley（去壳大麦）、dehusked coconut（去壳椰子）。日常口语中也可用更常见的 shelled（去壳的，常用于坚果/豆类）或 hulled（去壳的，常用于谷物）来表达相近意思。"]}
{"word":"dehusker","summary":{"en":"A dehusker removes the husk from crops, especially corn.","zh":"dehusker 指给农作物（尤指玉米）去壳/去皮的人或机器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a machine or person that removes the husk (outer covering) from crops, especially corn/maize","zh":"（给农作物，尤指玉米）脱壳/去皮的人或机器"},"examples":[{"en":"The farmer ran the corn through a dehusker before drying it.","zh":"农民先把玉米送进脱壳机去皮，然后再晾干。"},{"en":"At the processing plant, a dehusker removes the outer leaves and husk from the ears of corn.","zh":"在加工厂里，脱壳机会把玉米棒外面的叶片和外壳去掉。"}]}],"synonyms":["husker","husk remover","dehulling machine","sheller (related)"],"phonetic":"/diˈhʌskɚ/","extraExplanation":["“de-”常表示“去除、解除”（如 deice 除冰、debone 去骨），“husk”是“（玉米等的）外壳/外皮”。因此 dehusker 字面意思就是“去壳者/去壳装置”。","在北美农业语境里，这个词最常和 corn（玉米）搭配；更正式的设备名称有时会写作 corn dehusker，或与 detasseler（去雄器）等其他玉米加工/田间作业设备并列出现。"]}
{"word":"dehuskers","summary":{"en":"“Dehuskers” are machines or tools used to remove husks from crops or nuts.","zh":"“Dehuskers”指用于给作物或坚果脱壳/去壳皮的机器或工具（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a machine or tool that removes husks (outer coverings) from crops such as corn, rice, or nuts","zh":"脱壳机；去壳工具（把玉米、稻谷或坚果等作物的外壳/壳皮去掉的机器或工具）"},"examples":[{"en":"The rice mill uses dehuskers to remove the outer layer before polishing the grains.","zh":"碾米厂用脱壳机先去掉外壳，然后再精磨米粒。"},{"en":"Modern dehuskers can process large amounts of corn quickly.","zh":"现代脱壳机可以快速处理大量玉米。"}]}],"synonyms":["husker (context-dependent)","sheller (for nuts/beans, similar but not always the same)","hulling machine","dehulling machine"],"phonetic":"/diˈhʌskɚ/","extraExplanation":["“dehuskers”是“dehusker”的复数形式。词根很好理解：de- 表示“去除”，husk 表示“外壳/壳皮”，合起来就是“去壳（的机器/人）”。在农业、粮食加工和食品工业语境中非常常见。"]}
{"word":"dehusking","summary":{"en":"Dehusking means removing the husk (outer covering) from grains, seeds, or nuts.","zh":"dehusking 指把谷物、种子或坚果的外层壳/皮去掉，即“脱壳/去壳”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of removing the husk (outer covering) from grain, seeds, or nuts","zh":"去壳；脱壳（把谷物、种子或坚果的外层壳/皮去掉的过程）"},"examples":[{"en":"Dehusking rice removes the tough outer hull before further milling.","zh":"稻米脱壳会先去掉坚硬的外壳，然后再进行后续碾米。"},{"en":"The factory uses machines for dehusking sunflower seeds.","zh":"这家工厂用机器给葵花籽脱壳。"}]},{"partOfSpeech":"v.","definition":{"en":"removing the husk from grain, seeds, or nuts","zh":"去壳；脱壳（把谷物、种子或坚果的外壳/外皮去掉）"},"examples":[{"en":"They are dehusking corn by hand in the village.","zh":"村里的人正在手工给玉米脱壳。"},{"en":"Before cooking, try dehusking the millet to improve its texture.","zh":"烹饪前可以先给小米脱壳，让口感更好。"}]}],"synonyms":["hulling","husking","shelling"],"phonetic":"/diːˈhʌskɪŋ/","extraExplanation":["“Dehusking”常见于农业、食品加工语境，尤其是稻米（rice）、高粱（sorghum）、小米（millet）、葵花籽（sunflower seeds）等。常与“hulling / shelling / peeling”对比：hulling 更偏“去谷壳/外壳（hull）”，shelling 常指“剥坚果或豆荚的壳”，peeling 多指“削水果或蔬菜的皮”。"]}
{"word":"Dehwar","summary":{"en":"Dehwar is mainly used as a proper name (surname/ethnonym or sometimes a place name), not a standard English word.","zh":"Dehwar 主要用作专有名词（姓氏/族群名，有时也作地名），并非标准英语常用词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (surname/ethnonym) found in South Asia; it may refer to a family name or to a local community/group name. It is not a common standard English vocabulary word.","zh":"一个在南亚地区出现的专有名称（姓氏/族群名）；可能指家族姓氏或某个地方社群/族群的称呼。它不是常见的标准英语词汇。"},"examples":[{"en":"The author’s last name is Dehwar.","zh":"这位作者的姓是 Dehwar。"},{"en":"In the village records, several families are listed under the name Dehwar.","zh":"在村庄登记记录里，有几户人家登记为 Dehwar。"}]},{"partOfSpeech":"other","definition":{"en":"A place name in some regions (spelling varies), used to label a village/area on maps or in addresses.","zh":"某些地区的地名（拼写可能有变体），用于地图或地址中指代某个村庄/地区。"},"examples":[{"en":"The package was sent to Dehwar, Rajasthan.","zh":"包裹寄往拉贾斯坦邦的 Dehwar。"}]}],"phonetic":"/ˈdeɪ.wɑr/","extraExplanation":["“Dehwar”在英语里通常作为人名或地名出现，而不是像“book / run”那样的普通词汇。","它可能存在多种拼写变体（例如转写差异或地区差异）。如果你是在读某篇文章/证件时看到的，我可以根据上下文帮你判断它更像是姓氏、地名，还是某个群体名称。","也有人把它与拼写相近的词混淆：例如“Dewar”（常见苏格兰姓氏，也是一种威士忌品牌）。如果你想查的是这个词，请告诉我。"]}
{"word":"dehwar","summary":{"en":"“dehwar” is likely a misspelling of “dewar,” a vacuum-insulated container for cryogenic liquids.","zh":"“dehwar”很可能是“dewar”的误拼：一种真空隔热的低温液体容器（杜瓦瓶）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"“dehwar” is not a common or standard English word. In many cases, it is a misspelling of “dewar,” a special container used to store very cold liquids (like liquid nitrogen).","zh":"“dehwar”不是常见或标准的英语单词。很多情况下它是“dewar”的拼写误差；“dewar”指一种用于保存极低温液体（如液氮）的特殊容器。"},"examples":[{"en":"The lab stored liquid nitrogen in a dewar.","zh":"实验室把液氮储存在一个杜瓦瓶（dewar）里。"},{"en":"Wear gloves when handling a dewar, because it can cause cold burns.","zh":"搬动杜瓦瓶时要戴手套，因为它可能造成冻伤。"}]}],"synonyms":["vacuum flask","thermos"],"phonetic":"/ˈduːər/","extraExplanation":["“Dewar（杜瓦）”来自苏格兰化学家 James Dewar 的姓氏。他在低温实验中推广了这种双层真空隔热容器，因此该器具以他的名字命名。","日常生活里常见的“thermos（保温瓶）”原理相近，但实验室用的 dewar 往往更专业，常用于液氮、液氦等低温介质。","如果你看到的是姓名/地名（例如 South Asian 的拼写变体），请给我出现它的句子或场景，我可以帮你判断是否应当作为专有名词理解。"]}
{"word":"dehydrant","summary":{"en":"A dehydrant is a drying agent or something that removes water.","zh":"dehydrant 指“脱水剂/干燥剂”，或“具有脱水作用的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance (often a chemical) that removes water from something; a drying agent","zh":"（常指化学物质）脱水剂；干燥剂"},"examples":[{"en":"Silica gel is a common dehydrant used to keep packages dry.","zh":"硅胶是常见的干燥剂，用来让包装保持干燥。"},{"en":"The lab technician added a dehydrant to remove moisture from the sample.","zh":"实验室技术员加入脱水剂来去除样品中的水分。"}]},{"partOfSpeech":"adj.","definition":{"en":"removing water; used to dry something out","zh":"脱水的；用于去除水分的"},"examples":[{"en":"They used a dehydrant process to eliminate water before storage.","zh":"他们使用脱水处理，在储存前去除水分。"},{"en":"Alcohol can have a mildly dehydrant effect on the body.","zh":"酒精对身体可能有轻微的脱水作用。"}]}],"synonyms":["desiccant","drying agent","dehydrating agent"],"phonetic":"/ˌdiˈhaɪdrənt/","extraExplanation":["“Dehydrant”在日常英语里不如“desiccant（干燥剂）”常见，更常出现在化学、实验室或工业语境中。","拼写提醒：它和“hydrant（消防栓）”没有关系；“de-”表示“去除”，“hydr-”与“水”有关。"]}
{"word":"dehydrase","summary":{"en":"A “dehydrase” is an enzyme that removes water from a molecule during a chemical reaction.","zh":"dehydrase 指“脱水酶”，在化学反应中把水从分子中去除的酶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An enzyme that removes a molecule of water (H₂O) from a substance, often forming a double bond as part of a chemical reaction.","zh":"（生化）脱水酶：一种把水分子（H₂O）从某种物质中移除的酶，常在反应中形成双键。"},"examples":[{"en":"Fumarase is a dehydrase that helps convert malate and fumarate in the citric acid cycle.","zh":"延胡索酸酶（fumarase）是一种脱水酶，参与柠檬酸循环中苹果酸与延胡索酸之间的转化。"},{"en":"In the lab, we studied how a dehydrase changes the structure of its substrate by removing water.","zh":"在实验室里，我们学习了脱水酶如何通过去除水分子来改变底物结构。"}]}],"synonyms":["dehydratase","lyase (in some contexts)"],"phonetic":"/diːˈhaɪdreɪs/","extraExplanation":["“dehydrase”多用于生物化学与分子生物学语境，属于一类酶的统称；具体酶名常以“某某脱水酶/水合酶”出现。","词形上由 de-（去除）+ hydrate（加水/水合）+ -ase（酶的常见后缀）构成；因此它与“dehydrate（使脱水）”相关，但“dehydrase”特指酶，而不是一般意义的“脱水”。"]}
{"word":"dehydratase","summary":{"en":"A dehydratase is an enzyme that removes water from a molecule (or catalyzes the reverse hydration).","zh":"dehydratase 指“脱水酶”，能从分子中去除水（或催化逆向加水）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An enzyme that removes water (H₂O) from a molecule (a dehydration reaction) or adds water back (the reverse reaction), often in metabolic pathways.","zh":"脱水酶：一种酶，能从分子中去除水（H₂O）（脱水反应），或在逆反应中把水加回去，常见于代谢途径中。"},"examples":[{"en":"Fumarase is a well-known dehydratase in the citric acid cycle.","zh":"延胡索酸酶（fumarase）是三羧酸循环中很典型的一种脱水酶。"},{"en":"The gene mutation reduced dehydratase activity, slowing the pathway.","zh":"基因突变降低了脱水酶活性，使这条代谢途径变慢。"}]}],"synonyms":["dehydrating enzyme","lyase (in some contexts)"],"phonetic":"/diˈhaɪdreɪˌteɪs/","extraExplanation":["词根记忆：de-（去除）+ hydrate（水合/加水）+ -ase（酶的常见后缀）。因此 dehydratase 字面意思就是“去水的酶”。","常见搭配：dehydratase activity（脱水酶活性）、dehydratase deficiency（脱水酶缺乏）、(enzyme) catalyzes dehydration（催化脱水反应）。","在生物化学里，这类反应常涉及“形成双键/消除反应”（elimination），例如从底物上去掉 H 和 OH 形成水，同时在分子中形成新的结构变化。"]}
{"word":"dehydratases","summary":{"en":"Dehydratases are enzymes that remove water from molecules during biochemical reactions.","zh":"脫水酶是指在生化反應中從分子移除水分子的酶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biochemistry) Enzymes that remove water (H₂O) from a molecule (a dehydration reaction), often creating a double bond or changing the molecule’s structure.","zh":"（生物化學）脫水酶：把水（H₂O）從分子中移除的酶（脫水反應），常會形成雙鍵或改變分子結構。"},"examples":[{"en":"Dehydratases help cells make certain compounds by removing water during the reaction.","zh":"脫水酶會在反應中移除水分子，幫助細胞合成某些化合物。"},{"en":"In metabolism, some dehydratases are important for breaking down sugars and amino acids.","zh":"在代謝中，有些脫水酶對分解糖類和胺基酸很重要。"}]}],"synonyms":["dehydrating enzymes","lyases (in some contexts)"],"phonetic":"/diˈhaɪdreɪˌteɪs/","extraExplanation":["「Dehydratase」來自 dehydration（脫水）+ -ase（表示「酶」的常見字尾）。因此看到 -ase，通常可推測它是一種酶。","脫水酶常見於代謝途徑與微生物生化反應中；它們「移除水」不等於把物質烘乾，而是指在分子層級把 H 和 OH 以水的形式移走。","字形上你輸入的是複數 dehydratases；單數是 dehydratase。發音通常以單數為基準，再加複數 -es（/ɪz/）音。"]}
{"word":"dehydrate","summary":{"en":"“Dehydrate” means either to remove water from something (like food) or to lose too much water from the body.","zh":"“Dehydrate”指把某物（如食物）脱水，也指人体失水过多而脱水。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove water from something (often food) so it becomes dry","zh":"使（某物，常指食物）脱水、干燥"},"examples":[{"en":"They dehydrate fruit to make snacks that last longer.","zh":"他们把水果脱水做成更耐保存的零食。"},{"en":"Dehydrated meals are popular for camping because they’re light.","zh":"脱水食品很受露营欢迎，因为它们很轻。"}]},{"partOfSpeech":"vi.","definition":{"en":"to lose too much water from the body; to become lacking in water","zh":"（人体）脱水；失水过多"},"examples":[{"en":"If you don’t drink enough water in hot weather, you can dehydrate quickly.","zh":"炎热天气如果水喝得不够，很快就会脱水。"},{"en":"Athletes may dehydrate during long workouts.","zh":"运动员在长时间训练中可能会脱水。"}]}],"synonyms":["dry out","desiccate","lose fluids"],"phonetic":"/ˌdiˈhaɪˌdreɪt/","extraExplanation":["在健康语境里，dehydrate 常用于提醒补水：常见搭配有 become dehydrated（变得脱水）、dehydration（n. 脱水）、rehydrate（v. 补水/复水）。如果出现头晕、口干、尿量减少等症状，英语里常说 signs of dehydration（脱水迹象）。"]}
{"word":"dehydrated","summary":{"en":"Dehydrated means either lacking enough water in the body, or having water removed (especially from food) to dry and preserve it.","zh":"dehydrated 可指（人/身体）缺水脱水，也可指（尤指食物）经过脱水处理而变干、便于保存。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having lost too much water from the body; needing fluids.","zh":"（身体）脱水的；缺水的。"},"examples":[{"en":"After the long hike in the sun, I felt dehydrated and dizzy.","zh":"在太阳下走了很久之后，我觉得脱水并且头晕。"},{"en":"Drink water regularly so you don’t get dehydrated.","zh":"要规律喝水，避免脱水。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having had water removed (usually from food) in order to preserve it; dried.","zh":"（食物等）脱水处理的；干燥保存的。"},"examples":[{"en":"We packed dehydrated meals for the camping trip.","zh":"我们为露营旅行带了脱水食品。"},{"en":"Add hot water to the dehydrated soup and wait five minutes.","zh":"往脱水汤里加热水，等五分钟。"}]}],"synonyms":["dried","parched","water-deprived","desiccated"],"phonetic":"/ˌdiːhaɪˈdreɪtɪd/","extraExplanation":["“de-”有“去掉、移除”的意思，“hydrate”与“水分/补水”有关，所以“dehydrated”字面意思就是“失去水分的”。日常最常见两种用法：形容人/身体缺水，或形容食物被去除水分以便保存。","常见搭配：become/get dehydrated（变得脱水），severely/mildly dehydrated（严重/轻度脱水），dehydrated food/fruit/meal（脱水食品/水果/餐）。"]}
{"word":"dehydrated-frozen","summary":{"en":"“Dehydrated-frozen” describes food that has been dehydrated and then frozen for storage.","zh":"“dehydrated-frozen”指先脱水、再冷冻保存的食品（更常见表达为“dehydrated and frozen”，若指冻干则用“freeze-dried”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Processed by removing most of the water (dehydrated) and then kept or packaged in a frozen state; often used to describe certain foods.","zh":"先脱水（去除大部分水分）再冷冻保存或包装的；常用于描述某些食品。"},"examples":[{"en":"The dehydrated-frozen vegetables are easy to store and cook quickly.","zh":"这种脱水冷冻蔬菜容易保存，而且烹饪很快。"},{"en":"We used dehydrated-frozen berries in smoothies during the winter.","zh":"冬天我们用脱水冷冻莓果来做奶昔。"}]}],"synonyms":["dehydrated and frozen","frozen dehydrated","preserved"],"phonetic":"/ˌdiːhaɪˈdreɪtɪd ˈfroʊzən/","extraExplanation":["“dehydrated-frozen”不是特别常见的固定词条，更常见的写法是“dehydrated and frozen”（脱水后冷冻）或根据工艺说“freeze-dried”（冻干）。如果你想表达“先脱水再冷冻”，用“dehydrated and frozen”更自然；如果指的是“冻干食品”，通常应写“freeze-dried”。","与食品加工相关的小区别：dehydrated（脱水）通常指用热风等方式去水；freeze-dried（冻干）是先冷冻再在真空中升华去水，口感和复水性常更好。"]}
{"word":"dehydrates","summary":{"en":"“Dehydrates” usually means either (1) removes water from something (like food), or (2) loses too much body water.","zh":"“dehydrates”通常表示（1）使某物脱水（如食物），或（2）身体水分流失过多而脱水。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove water from something; to dry it (often for preserving food)","zh":"使（某物）脱水；把……弄干（常用于保存食物）"},"examples":[{"en":"The machine dehydrates fruit to make dried snacks.","zh":"这台机器把水果脱水，做成干果零食。"},{"en":"Dehydrate the mushrooms before storing them.","zh":"把蘑菇脱水后再储存。"}]},{"partOfSpeech":"vi.","definition":{"en":"to lose too much water in the body; to become lacking enough fluids","zh":"（身体）脱水；体内水分不足"},"examples":[{"en":"If you don’t drink enough, you can dehydrate in hot weather.","zh":"天气炎热时如果不喝够水，你可能会脱水。"},{"en":"After the long run, he was dehydrating and needed water.","zh":"长跑后他开始脱水，需要补水。"}]}],"synonyms":["dries out","desiccates","dewater"],"phonetic":"/diˈhaɪdreɪts/"}
{"word":"dehydrating","summary":{"en":"“Dehydrating” means removing water from something or losing too much water; it can describe the process or the action happening now.","zh":"“dehydrating”指去除水分或（身体）失水过多；可表示脱水的过程或正在进行的脱水动作。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Removing water from something, or causing it to lose too much water.","zh":"使……脱水；去除水分；（人/动植物）失去过多水分。"},"examples":[{"en":"Dehydrating fruits helps them last longer without a refrigerator.","zh":"把水果脱水处理可以让它们在不冷藏的情况下保存更久。"},{"en":"After hiking in the sun, he started dehydrating and felt dizzy.","zh":"在太阳下徒步后，他开始脱水，感觉头晕。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or process of removing water from something.","zh":"脱水（的过程）；除去水分（的过程）。"},"examples":[{"en":"Dehydrating is a common method for preserving food.","zh":"脱水是常见的食物保存方法。"},{"en":"This machine is used for dehydrating herbs.","zh":"这台机器用来给香草脱水。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “dehydrate”: to remove water from something; or (for a body) to lose too much water.","zh":"“dehydrate”的现在分词：使……脱水/去除水分；（身体）脱水。"},"examples":[{"en":"The company is dehydrating vegetables for soup mixes.","zh":"这家公司正在把蔬菜脱水，用于汤料包。"},{"en":"If you don’t drink enough water, you may be dehydrating without noticing it.","zh":"如果你水喝得不够，你可能在不知不觉中正在脱水。"}]}],"synonyms":["drying","desiccating","parching","dewatering"],"phonetic":"/ˌdiːhaɪˈdreɪtɪŋ/","extraExplanation":["“dehydrating”常见于两类语境：\n1）食品加工/露营：dehydrating fruit/vegetables（把食物脱水以便保存或携带）。\n2）健康：You’re dehydrating / You’re dehydrated（你在脱水/你已经脱水）。注意口语里更常说“dehydrated（已经脱水）”，而“dehydrating”强调“正在发生的过程”。","和“drying（晾干/烘干）”相比，“dehydrating”更强调“把水分尽可能去掉”，常带有“保存、防腐、便携”的目的。常见搭配：dehydrating food, dehydration symptoms（脱水症状）, rehydrate（补水/复水）。"]}
{"word":"dehydration","summary":{"en":"Dehydration means not having enough water in the body, or the process of removing water from something.","zh":"dehydration 指身体缺水的“脱水”状态，也可指从物质中去除水分的“脱水处理”过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A condition in which your body does not have enough water (often from sweating, illness, not drinking enough, or heat).","zh":"脱水；身体缺水的状态（常因出汗、疾病、喝水不足或高温导致）。"},"examples":[{"en":"After hiking all day in the sun, he showed signs of dehydration.","zh":"在太阳下徒步一整天后，他出现了脱水的迹象。"},{"en":"Drink water regularly to prevent dehydration during exercise.","zh":"运动时要规律喝水，以预防脱水。"},{"en":"Severe dehydration can be dangerous and may require medical care.","zh":"严重脱水可能很危险，可能需要医疗处理。"}]},{"partOfSpeech":"n.","definition":{"en":"The process of removing water from something; drying.","zh":"脱水处理；去除水分的过程；干燥。"},"examples":[{"en":"Food dehydration helps fruit last longer without refrigeration.","zh":"食物脱水处理能让水果在不冷藏的情况下保存更久。"},{"en":"This camping meal is made by dehydration and can be cooked quickly.","zh":"这种露营餐是通过脱水制作的，烹饪很快。"}]}],"synonyms":["fluid loss","lack of fluids","desiccation (process of drying)"],"phonetic":"/ˌdiːhaɪˈdreɪʃən/","extraExplanation":["在健康语境中，常见搭配有：mild/moderate/severe dehydration（轻度/中度/重度脱水）、signs/symptoms of dehydration（脱水迹象/症状）、dehydration headache（脱水性头痛）。","容易混淆的词：dehydrate（v. 使脱水/脱水）；dehydrated（adj. 脱水的；脱水后的，如 dehydrated fruit 脱水水果）。","常见症状可包括口渴、尿色加深、头晕、乏力；儿童或老人更需要注意补水。若出现意识模糊、持续呕吐等情况应及时就医。"]}
{"word":"dehydration-freezing","summary":{"en":"Dehydration-freezing means preserving something by freezing it and removing water under low pressure (freeze-drying).","zh":"Dehydration-freezing 指先冷冻再在低压下去除水分的保存方法，即冻干。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A method of preserving a material by freezing it and then removing its water (moisture) under low pressure; also called freeze-drying.","zh":"一种保存材料的方法：先将其冷冻，再在低压环境下去除水分；也叫“冻干”。"},"examples":[{"en":"Instant coffee is often made using dehydration-freezing to keep the flavor.","zh":"速溶咖啡常用“冷冻脱水（冻干）”来保留风味。"},{"en":"The lab stored the vaccine in a stable powder form through dehydration-freezing.","zh":"实验室通过“冷冻脱水（冻干）”把疫苗保存成稳定的粉末形态。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing a process or technique that removes water by freezing and drying under low pressure (freeze-dried).","zh":"形容一种通过“先冷冻、再低压干燥”来去除水分的工艺（即冻干的）。"},"examples":[{"en":"They used a dehydration-freezing process to make lightweight camping meals.","zh":"他们用冷冻脱水（冻干）工艺制作轻量化的露营食品。"},{"en":"Dehydration-freezing technology helps some medicines last longer without refrigeration.","zh":"冷冻脱水（冻干）技术能让一些药品在不冷藏的情况下保存更久。"}]}],"synonyms":["freeze-drying","freeze-dry","lyophilization","lyophilize"],"phonetic":"/ˌdiːhaɪˈdreɪʃən ˈfriːzɪŋ/","extraExplanation":["“dehydration-freezing”在英语里更常见的标准说法是“freeze-drying”或科学术语“lyophilization（冻干）”。它的关键步骤通常是：先冷冻 → 在真空/低压下让冰直接变成水蒸气（升华）→ 得到含水量很低的固体。","这种方法常用于食品（冻干草莓、速溶咖啡）和制药/生物领域（疫苗、蛋白质样品），优点是更能保留形状与风味，也更便于常温运输；缺点是设备与成本较高。"]}
{"word":"dehydrations","summary":{"en":"Dehydrations is the plural of dehydration: cases or processes of losing too much water (in the body) or removing water from materials.","zh":"Dehydrations 是 dehydration 的复数：指多次/多种“脱水（身体失水）”或“脱水处理（去除水分）”的情况。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process or condition of losing too much water from the body or from something (plural form)","zh":"（复数）脱水；失水：身体或某物失去过多水分的过程或状态"},"examples":[{"en":"Severe dehydrations can be dangerous, especially for children and older adults.","zh":"严重的脱水可能很危险，尤其对儿童和老年人而言。"},{"en":"Doctors treated the dehydrations with oral rehydration salts and fluids.","zh":"医生用口服补液盐和输液来治疗这些脱水情况。"}]},{"partOfSpeech":"n.","definition":{"en":"the removal of water from food, chemicals, or materials (plural form)","zh":"（复数）脱水处理：从食物、化学品或材料中去除水分"},"examples":[{"en":"These dehydrations help preserve fruits so they last longer.","zh":"这些脱水处理有助于保存水果，让它们存放更久。"},{"en":"Industrial dehydrations are used to reduce moisture before packaging.","zh":"工业脱水处理常用于包装前降低含水量。"}]}],"synonyms":["water loss","fluid loss","desiccation (materials)","drying (process)"],"phonetic":"/ˌdiːhaɪˈdreɪʃənz/","extraExplanation":["“dehydrations”是名词复数，但在日常英文里更常用不可数名词“dehydration”（例如：He has dehydration.）。当要强调“多次/多种脱水事件或病例”时，才更常用复数。","常见搭配：dehydration symptoms（脱水症状），mild/moderate/severe dehydration（轻/中/重度脱水），oral rehydration solution/ORS（口服补液盐/口服补液溶液）。","医学语境里，脱水常见原因包括腹泻、呕吐、高烧、出汗过多、喝水不足等；学习时可留意“dehydration（脱水）”与“rehydration（补水/复水）”这对反义概念。"]}
{"word":"dehydrator","summary":{"en":"A dehydrator is a device that removes moisture, especially a kitchen machine used to dry and preserve food.","zh":"dehydrator 指去除水分的设备，尤其常指用于风干并保存食物的食物脱水机。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A machine or device that removes water (moisture) from food or other materials, often using warm air, to help preserve them.","zh":"脱水机；烘干机（通过加热空气等方式去除食物或其他材料中的水分，以便保存）"},"examples":[{"en":"We used a dehydrator to make dried apple slices.","zh":"我们用脱水机做了苹果干片。"},{"en":"A food dehydrator can preserve herbs for months.","zh":"食物脱水机可以把香草保存好几个月。"}]}],"synonyms":["dryer","food dehydrator","drying machine"],"phonetic":"/ˌdiːhaɪˈdreɪtər/","extraExplanation":["“Dehydrator”最常见指厨房里的“食物脱水机”（food dehydrator），用低温长时间风干来做果干、肉干（jerky）等；和“oven（烤箱）”相比，它更强调缓慢、均匀地去水分以利保存。","在更专业的场景里（实验室、工业），dehydrator也可指用于干燥样品或材料的设备，但日常生活里通常就是指食物脱水机。"]}
{"word":"dehydrators","summary":{"en":"“Dehydrators” most commonly means machines used to dry and preserve food; less commonly, it can mean things that cause dehydration.","zh":"“dehydrators”最常指用于烘干并保存食物的脱水机；较少情况下也可指导致脱水的因素。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A machine that removes moisture from food or other materials by circulating warm, dry air (often used to preserve food).","zh":"（脱水机）一种通过循环温暖干燥的空气来去除食物或其他材料中水分的机器（常用于保存食物）。"},"examples":[{"en":"I use a dehydrator to make dried apple slices at home.","zh":"我用脱水机在家做苹果干片。"},{"en":"Food dehydrators help preserve herbs so they last longer.","zh":"食物脱水机能帮助保存香草，让它们保存更久。"}]},{"partOfSpeech":"n.","definition":{"en":"People or substances that cause dehydration (make someone or something lose water).","zh":"（较少用）使脱水的人或物质；导致身体或物体失去水分的因素。"},"examples":[{"en":"Alcohol and caffeine can act as mild dehydrators for some people.","zh":"酒精和咖啡因对某些人来说可能是轻微的“脱水因素”。"}]}],"synonyms":["food dryers","dryers","dehydration causes"],"phonetic":"/ˌdiːhaɪˈdreɪtərz/","extraExplanation":["“Dehydrators”是“dehydrator”的复数。日常最常见指厨房里的“食物脱水机”，用来做果干、肉干（jerky）、干蘑菇等。","如果你想表达“让人脱水的东西/因素”，更自然的说法常是“things that cause dehydration”或直接用“dehydrating (drinks/conditions)”。"]}
{"word":"dehydroascorbic","summary":{"en":"“Dehydroascorbic” refers to dehydroascorbic acid—the oxidized form of vitamin C.","zh":"“dehydroascorbic”指脱氢抗坏血酸，即维生素C的氧化形式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to dehydroascorbic acid, the oxidized form of vitamin C","zh":"与“脱氢抗坏血酸（维生素C的氧化形式）”有关的"},"examples":[{"en":"Dehydroascorbic acid can be reduced back to ascorbic acid in the body.","zh":"脱氢抗坏血酸在体内可以被还原回抗坏血酸（维生素C）。"},{"en":"Some research measures dehydroascorbic levels to study oxidative stress.","zh":"一些研究会测量脱氢抗坏血酸水平来研究氧化应激。"}]},{"partOfSpeech":"n.","definition":{"en":"dehydroascorbic acid (often shortened in scientific contexts)","zh":"脱氢抗坏血酸（在科研语境中常作为简称用法）"},"examples":[{"en":"The sample contained both ascorbic acid and dehydroascorbic.","zh":"样品同时含有抗坏血酸和脱氢抗坏血酸。"},{"en":"We quantified dehydroascorbic using HPLC.","zh":"我们用高效液相色谱（HPLC）定量测定脱氢抗坏血酸。"}]}],"synonyms":["dehydroascorbic acid","DHA (in vitamin C research)"],"phonetic":"/diˌhaɪdroʊəˈskɔːrbɪk/","extraExplanation":["“dehydro-”表示“脱氢/失去氢”，在化学中常用来说明分子被氧化（失去氢或电子）。因此 dehydroascorbic（acid）就是“被氧化后的维生素C形态”。","在食品与营养领域，维生素C可能在储存、加热或接触空气时部分氧化为脱氢抗坏血酸；在一定条件下它仍可在体内转回维生素C，但稳定性通常更差。","常见缩写：DHA（注意不要与其他领域的 DHA 如二十二碳六烯酸混淆，需看上下文）。"]}
{"word":"dehydrochlorinase","summary":{"en":"Dehydrochlorinase is an enzyme that removes HCl from a compound, aiding the breakdown of chlorinated chemicals.","zh":"dehydrochlorinase 指一种能从化合物中去除氯化氢（HCl）的酶，常用于分解含氯化学物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an enzyme that removes hydrogen chloride (HCl) from a compound (a reaction called dehydrochlorination), often helping an organism break down chlorinated chemicals","zh":"脱氯化氢酶；一种能从化合物中去除氯化氢（HCl）的酶（该反应称为“脱氯化氢反应/脱氯化氢作用”），常用于生物体分解含氯化学物质"},"examples":[{"en":"Some bacteria produce dehydrochlorinase to help them break down chlorinated pollutants.","zh":"一些细菌会产生脱氯化氢酶，以帮助它们分解含氯污染物。"},{"en":"In the lab, researchers measured dehydrochlorinase activity by tracking how fast HCl was removed from the substrate.","zh":"在实验室里，研究人员通过追踪底物中HCl被移除的速度来测量脱氯化氢酶的活性。"}]}],"synonyms":["dehydrochlorinating enzyme","dehydrochlorinase enzyme"],"phonetic":"/diˌhaɪdroʊˈklɔːrəˌneɪs/","extraExplanation":["这个词主要出现在生物化学、环境科学与微生物降解（biodegradation）相关的文献中。它的构词很透明：de-（去除）+ hydrochlori-（氯化氢相关）+ -nase（常见的酶后缀，源自 enzyme 的命名习惯）。","在环境与农药研究中，人们有时会提到能促使某些含氯农药/工业化学品发生“脱氯化氢（dehydrochlorination）”的酶类；不过不同研究可能使用更具体的酶名或基因名来描述同类功能。"]}
{"word":"dehydrochlorinate","summary":{"en":"Dehydrochlorinate means to remove HCl (hydrogen chloride) from a chemical compound, often creating a double bond.","zh":"dehydrochlorinate 指从化合物中脱去氯化氢（HCl），常导致形成双键。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Chemistry) to remove hydrogen chloride (HCl) from a compound, usually by an elimination reaction, forming a double bond or a less-chlorinated product.","zh":"（化学）从化合物中脱去氯化氢（HCl），通常通过消除反应，使分子形成双键或生成氯含量更低的产物。"},"examples":[{"en":"Heating the chlorinated alcohol can dehydrochlorinate it and produce an alkene.","zh":"加热这种氯代醇可以使其脱氯化氢，从而生成烯烃。"},{"en":"The base helps dehydrochlorinate the substrate by removing a proton while chloride leaves.","zh":"碱通过夺取一个质子并促使氯离子离去，帮助底物发生脱氯化氢反应。"}]}],"synonyms":["eliminate HCl","dehydrohalogenate (more general)","dehydrochlorination (noun form)"],"phonetic":"/ˌdiːˌhaɪdroʊˈklɔːrəˌneɪt/","extraExplanation":["这个词常见于有机化学与高分子材料语境，属于“消除反应（elimination）”的一种：分子同时失去H和Cl，往往会在相邻碳之间形成C=C双键。","在材料科学中也会提到聚氯乙烯（PVC）的热降解：PVC受热可能发生脱氯化氢，释放HCl并导致材料变色、变脆。"]}
{"word":"dehydrochlorination","summary":{"en":"Dehydrochlorination is the removal of HCl from a compound, often forming a double bond.","zh":"Dehydrochlorination 指从化合物中脱去HCl，常导致形成双键。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical reaction in which hydrogen chloride (HCl) is removed from a molecule, often creating a double bond (an alkene) or changing the structure of a polymer","zh":"脱氯化氢反应：从分子中移除氯化氢（HCl）的一类化学反应，常常会形成双键（生成烯烃）或改变聚合物结构"},"examples":[{"en":"Dehydrochlorination of an alkyl chloride can produce an alkene.","zh":"卤代烷发生脱氯化氢反应可以生成烯烃。"},{"en":"Heat can speed up dehydrochlorination in some materials.","zh":"加热会在某些材料中加速脱氯化氢反应。"}]}],"synonyms":["HCl elimination","elimination of hydrogen chloride","dehydrohalogenation (broader term)"],"phonetic":"/ˌdiːˌhaɪdroʊˌklɔːrɪˈneɪʃən/","extraExplanation":["在有机化学里，脱氯化氢常见于“消除反应（elimination reaction）”，典型情况是碱（如KOH/醇溶液）帮助从相邻碳原子上移走H和Cl，从而形成C=C双键。","在材料化学中，聚氯乙烯（PVC）受热或老化时可能发生脱氯化氢，导致材料变色、脆化；稳定剂的作用之一就是抑制这一过程。","词形拆解：de-（去除）+ hydro（氢）+ chlor（氯）+ -ination（过程/反应），字面意思就是“去除氢和氯（以HCl形式离开）”。"]}
{"word":"dehydrocorticosterone","summary":{"en":"Dehydrocorticosterone is a corticosteroid related to corticosterone, often treated as a less active form in steroid metabolism.","zh":"Dehydrocorticosterone 是与皮质酮相关的皮质激素，常被视为类固醇代谢中较不活跃的形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a steroid hormone (a corticosteroid) formed by oxidizing corticosterone; it is often discussed as a less active/inactive form that can be converted back to corticosterone in tissues.","zh":"一种类固醇激素（皮质激素），由“皮质酮（corticosterone）”氧化形成；常被视为相对不活跃/低活性的形式，可在某些组织中再转回皮质酮。"},"examples":[{"en":"In some studies, dehydrocorticosterone is measured together with corticosterone to understand steroid metabolism.","zh":"在一些研究中，会同时测量 dehydrocorticosterone 和 corticosterone，以了解类固醇代谢。"},{"en":"Enzymes in the kidney can help regulate the balance between corticosterone and dehydrocorticosterone.","zh":"肾脏中的酶能帮助调节 corticosterone 与 dehydrocorticosterone 之间的平衡。"}]}],"synonyms":["11-dehydrocorticosterone"],"phonetic":"/diˌhaɪdroʊˌkɔːrtɪˈkoʊstərəˌnoʊn/","extraExplanation":["这个词常见于生理学/内分泌学论文里，尤其是涉及“11β-羟类固醇脱氢酶（11β-HSD）”这类酶如何在不同组织间“切换”激素活性形式的讨论。","不同物种的主要糖皮质激素不完全一样：人类更常谈 cortisol ↔ cortisone；而在啮齿类研究中更常见 corticosterone ↔（11-dehydro）dehydrocorticosterone 这组。阅读文献时要留意研究对象与命名。"]}
{"word":"dehydrocorydaline","summary":{"en":"Dehydrocorydaline is a natural alkaloid from *Corydalis* plants, mainly mentioned in scientific research.","zh":"Dehydrocorydaline 是来自延胡索属（*Corydalis*）植物的一种天然生物碱，主要出现在科研与药理学语境中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a natural alkaloid (chemical compound) found especially in plants of the genus *Corydalis*, studied for possible effects on pain, inflammation, and circulation","zh":"一种天然生物碱（化学成分），主要存在于延胡索属（*Corydalis*）植物中，常被研究其可能与镇痛、抗炎及改善循环等作用有关"},"examples":[{"en":"Some studies isolate dehydrocorydaline from *Corydalis* to test its potential pain-relieving properties.","zh":"一些研究会从延胡索（*Corydalis*）中分离出 dehydrocorydaline，用来测试其潜在的镇痛作用。"},{"en":"The paper reports the concentration of dehydrocorydaline in the plant extract.","zh":"论文报告了该植物提取物中 dehydrocorydaline 的含量。"}]}],"synonyms":["DHC (abbr., in some papers)"],"phonetic":"/diˌhaɪdroʊˌkɔːrɪˈdælɪn/","extraExplanation":["词源结构：dehydro- 表示“脱氢、去氢（少了氢原子）”，corydaline 与延胡索属（Corydalis）的命名有关；整体常见于化学与药理学文献。","它是科研语境中的化合物名称，不是日常英语词汇；在阅读论文时也常见缩写 DHC（具体是否采用取决于作者）。","与传统草药相关的成分不等于“安全可自行使用”。如果在保健品或草药产品中看到该成分名，应关注剂量、来源、相互作用与监管信息，并咨询专业人士。"]}
{"word":"dehydroepiandrosterone","summary":{"en":"Dehydroepiandrosterone (DHEA) is a naturally produced hormone that helps the body make testosterone and estrogen.","zh":"脱氢表雄酮（DHEA）是一种人体天然生成的激素，可作为合成睾酮、雌激素等性激素的前体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hormone made mainly by the adrenal glands (and also by the ovaries/testes) that serves as a building block for sex hormones such as testosterone and estrogen; often shortened to DHEA and sometimes sold as a supplement","zh":"一种主要由肾上腺（也可由卵巢/睾丸）分泌的激素，是合成睾酮、雌激素等性激素的“前体/原料”；常简称为 DHEA，也常被作为膳食补充剂出售"},"examples":[{"en":"The doctor ordered a blood test to measure her dehydroepiandrosterone (DHEA) level.","zh":"医生开了血液检查来测量她的脱氢表雄酮（DHEA）水平。"},{"en":"Some people take dehydroepiandrosterone as a supplement, but its benefits and risks are still debated.","zh":"有些人把脱氢表雄酮当作补充剂服用，但它的益处与风险仍有争议。"},{"en":"Abnormal dehydroepiandrosterone levels can be linked to adrenal or hormonal disorders.","zh":"脱氢表雄酮水平异常可能与肾上腺或内分泌疾病有关。"}]}],"synonyms":["DHEA","prasterone"],"phonetic":"/diˌhaɪdroʊˌiːpiˌændroʊˈstɛroʊn/","extraExplanation":["这是一个医学/生化专业词，日常交流中更常说缩写 **DHEA**（有时也叫药名/通用名 **prasterone**）。","在临床语境里，DHEA 常与“肾上腺功能”“雄激素过多（如痤疮、多毛）”“激素水平评估”等话题一起出现。","作为保健品时，不同国家/地区监管与适应证不同；若涉及用药或补充剂，通常需要结合个人病史、化验结果并咨询医生。"]}
{"word":"dehydroffroze","summary":{"en":"Dehydrofreeze means to (or the process to) partially dehydrate food and then freeze it for better storage.","zh":"Dehydrofreeze 指（或指一种工艺）把食品先部分脱水再冷冻，以便更好地保存。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to partially dehydrate (remove some water from) food and then freeze it, usually to improve storage life and quality","zh":"（通常指食品）先部分脱水（去除部分水分）再冷冻，以延长保存期并保持品质"},"examples":[{"en":"Some companies dehydrofreeze strawberries so they keep their flavor during long storage.","zh":"有些公司会把草莓先脱水再冷冻，这样在长期储存中还能保留风味。"},{"en":"Dehydrofreezing reduces the amount of ice that forms inside the fruit.","zh":"脱水冷冻可以减少水果内部形成的冰晶量。"}]},{"partOfSpeech":"n.","definition":{"en":"the process of partially dehydrating and then freezing food","zh":"（食品）先部分脱水再冷冻的工艺；脱水冷冻法"},"examples":[{"en":"Dehydrofreezing is used for certain fruits and vegetables in the food industry.","zh":"在食品工业中，脱水冷冻常用于某些水果和蔬菜。"}]}],"synonyms":["partially dehydrate and freeze","dehydrofreezing","(related) freeze-dry"],"phonetic":"/ˌdiːhaɪdroʊˈfriːz/","extraExplanation":["“dehydroffroze”看起来不像标准英语单词，最可能是拼写错误或把词拆开写错了。你可能想写的是 **dehydrofreeze / dehydrofreezing**（脱水冷冻），这是食品加工领域的技术词。","这个词由 **dehydrate（脱水）+ freeze（冷冻）** 组成，常见于技术说明、科研或食品工艺文章中，日常口语里不太常用。","如果你原本想表达“脱水/干燥”或“冻干”，更常见的词分别是 **dehydrate (v.)**（脱水、烘干）和 **freeze-dry (v.)**（冻干）。如果你告诉我句子上下文，我也可以帮你确认最合适的词。"]}
{"word":"dehydroffrozen","summary":{"en":"“Dehydrofrozen” describes food that has had some water removed and then been frozen.","zh":"“dehydrofrozen”指食品先去除部分水分（脱水）再进行冷冻保存。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Food/industry) partially dehydrated and then frozen to preserve it (not a common everyday word; used in technical or product descriptions).","zh":"（食品/工业）先部分脱水再冷冻以保存（不是日常常用词，多见于技术或产品说明）。"},"examples":[{"en":"The company sells dehydrofrozen vegetables for quick soups.","zh":"这家公司销售“脱水后冷冻”的蔬菜，用来快速做汤。"},{"en":"Dehydrofrozen meals are lighter to ship because some water has been removed.","zh":"“脱水后冷冻”的餐食因为去掉了一部分水分，所以运输更轻。"}]}],"synonyms":["dehydrated and frozen","partly dehydrated then frozen","dehydrated-frozen"],"phonetic":"/ˌdiːhaɪdroʊˈfroʊzən/","extraExplanation":["“dehydrofrozen”通常是由 dehydro-（脱水）+ frozen（冷冻的）拼合而成的行业用语，并非标准、常见词；在日常表达里更自然的说法是 “dehydrated and frozen”（脱水并冷冻）或 “partly dehydrated, then frozen”。","不要与 “freeze-dried”（冷冻干燥/冻干）混淆：冻干一般是先冷冻再在真空下升华除水，最后成品常温也能保存；而“dehydrofrozen”通常仍需要冷冻保存。"]}
{"word":"dehydrofreeze","summary":{"en":"Dehydrofreeze means “to freeze-dry,” or a freeze-dried product.","zh":"dehydrofreeze 指“冻干（冷冻干燥）”，也可指“冻干制品”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to preserve food or other materials by removing water after freezing (freeze-drying).","zh":"（通过冷冻后脱水）进行冻干；把……冻干保存。"},"examples":[{"en":"Some instant coffee is dehydrofreezed to keep its flavor for a long time.","zh":"有些速溶咖啡会经过冻干处理，以便长时间保持风味。"},{"en":"The company dehydrofreezed strawberries so they would be light and easy to ship.","zh":"公司把草莓冻干处理，让它们更轻、便于运输。"}]},{"partOfSpeech":"n.","definition":{"en":"a freeze-dried product, especially food.","zh":"冻干制品（尤指冻干食品）。"},"examples":[{"en":"Dehydrofreeze is popular in camping meals because it is lightweight.","zh":"冻干食品在露营餐中很受欢迎，因为它很轻便。"}]}],"synonyms":["freeze-dry","lyophilize"],"phonetic":"/diˌhaɪdroʊˈfriːz/","extraExplanation":["“dehydrofreeze”在日常英语中不算常见，更常用的说法是 **freeze-dry** 或更专业的 **lyophilize**（冷冻干燥）。","冻干的基本思路是：先把物质冷冻，再在低压环境下让冰直接升华成水蒸气，从而去除水分，保留形状与部分风味。"]}
{"word":"dehydrofreezing","summary":{"en":"Dehydrofreezing is partially dehydrating food and then freezing it to preserve quality.","zh":"Dehydrofreezing（脱水冷冻）是先部分脱水再冷冻，以更好地保藏食物品质的方法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a food-preservation process in which food is partly dehydrated (water is removed) and then frozen, helping it keep quality during storage and transport","zh":"一种食品保藏方法：先对食物进行部分脱水（去除部分水分），再冷冻，以帮助在储存与运输中保持品质"},"examples":[{"en":"Some berries are processed by dehydrofreezing to reduce freezer damage and save space.","zh":"有些浆果会用脱水冷冻法处理，以减少冷冻损伤并节省储存空间。"},{"en":"Dehydrofreezing can help keep fruits firmer after thawing compared with simple freezing.","zh":"与直接冷冻相比，脱水冷冻法在解冻后可能让水果更不容易变软。"}]}],"synonyms":["dehydration-freezing","dehydrated freezing (technical)"],"phonetic":"/diˌhaɪdroʊˈfriːzɪŋ/","extraExplanation":["“dehydro-”表示“脱水/去水”，结合“freezing（冷冻）”，字面意思就是“脱水后冷冻”。常用于食品加工与冷链相关的技术语境，不是日常口语里常见的词。","这种方法的核心思路是：先减少食物中的游离水分，再冷冻，从而降低冰晶对细胞结构的破坏，解冻后的口感与形状往往更好；同时重量与体积也可能更小，利于运输与储存。"]}
{"word":"dehydrofroze","summary":{"en":"“Dehydrofroze” is not a standard English word; it’s likely a typo or a blend of “dehydro-” and “froze.”","zh":"“dehydrofroze”不是标准英语词，可能是拼写错误或把“dehydro-”与“froze”混写的自造词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It looks like a misspelling or a made-up blend of **dehydro-** (a chemistry prefix meaning “remove hydrogen”) and **froze** (past tense of “freeze”). To understand what you meant, we usually need the surrounding sentence.","zh":"不是标准英语单词。它看起来像拼写错误或自造词，可能把化学前缀 **dehydro-**（表示“脱氢/去氢”）和 **froze**（freeze 的过去式“结冰了”）混在一起。通常需要结合上下文句子才能确定你想表达什么。"},"examples":[{"en":"I can’t find “dehydrofroze” in a dictionary—did you mean **dehydrate** or **dehydrogenate**?","zh":"我在词典里找不到“dehydrofroze”——你是不是想写 **dehydrate（脱水）** 或 **dehydrogenate（脱氢）**？"},{"en":"If you meant the past tense of **freeze**, the correct word is **froze**.","zh":"如果你想表达 **freeze** 的过去式，正确形式是 **froze**。"}]}],"phonetic":"/diˌhaɪdroʊˈfroʊz/","extraExplanation":["**dehydro-** 常见于化学/生物化学词汇里，表示“脱氢、去除氢原子”，例如 **dehydrogenation（脱氢作用）**、**dehydrogenase（脱氢酶）**。日常生活里更常见的是 **dehydrate（使脱水）/ dehydration（脱水）**。","如果你是在描述“冻住/结冰”的动作，动词时态是：**freeze–froze–frozen**（现在式–过去式–过去分词）。例如：It **froze** last night. / The lake has **frozen**.","如果你把原句发我（前后各一句也行），我可以帮你判断最可能的正确单词/拼写。"]}
{"word":"dehydrofrozen","summary":{"en":"“Dehydrofrozen” is an uncommon, nonstandard term that likely means “dehydrated and frozen,” often used on labels; common alternatives are “dehydrated,” “frozen,” or “freeze-dried.”","zh":"“dehydrofrozen”不常见且不标准，通常想表达“脱水并冷冻（的）”，多见于标签；更常用的说法是“dehydrated / frozen / freeze-dried”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not a standard dictionary word; it looks like a coined/technical label meaning “dehydrated and frozen,” often referring to food that has had water removed and/or been preserved by freezing (sometimes used loosely for freeze-dried products).","zh":"不是标准词典词；看起来像是人为造的技术/标签词，意思大致为“脱水并冷冻的”，常用于指经过去除水分和/或冷冻保存的食品（有时也被宽泛地用来指冻干产品）。"},"examples":[{"en":"This packaging says “dehydrofrozen vegetables,” meaning the vegetables were processed to reduce moisture and then frozen.","zh":"这个包装写着“dehydrofrozen vegetables”，意思是蔬菜经过处理降低含水量后再冷冻。"},{"en":"If you mean “freeze-dried,” the more common term in English is “freeze-dried food,” not “dehydrofrozen.”","zh":"如果你想表达“冻干”，英语里更常用的说法是“freeze-dried food”，而不是“dehydrofrozen”。"}]}],"synonyms":["dehydrated","frozen","freeze-dried","dried"],"phonetic":"/ˌdiː.haɪ.droʊˈfroʊ.zən/","extraExplanation":["这个词可以拆成前缀 dehydro-（与“脱氢/脱水”相关的科技用语）+ frozen（冷冻的）。日常英语里很少把它们直接拼成一个词来用。","如果你是在食品语境里想表达“脱水/干燥”或“冻干”，更自然、常见的表达分别是 dehydrated（脱水的/风干的）和 freeze-dried（冻干的）。","不同工艺的区别：frozen=冷冻保存；dehydrated=去除水分以延长保存；freeze-dried=先冷冻再在低压下升华水分（更接近“冻干”）。标签上偶尔会出现自造词或行业内部用语。"]}
{"word":"dehydrogenase","summary":{"en":"A dehydrogenase is an enzyme that removes hydrogen from molecules in redox reactions.","zh":"dehydrogenase 指“脱氢酶”，在氧化还原反应中从分子上移除氢。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An enzyme that removes hydrogen atoms from a molecule, usually helping a biological oxidation–reduction (redox) reaction and often using cofactors like NAD⁺/NADP⁺ or FAD.","zh":"脱氢酶：一种酶，能从分子中去除氢原子，通常参与生物体内的氧化还原反应，并常借助 NAD⁺/NADP⁺ 或 FAD 等辅因子。"},"examples":[{"en":"Lactate dehydrogenase helps convert lactate to pyruvate in the body.","zh":"乳酸脱氢酶帮助人体把乳酸转化为丙酮酸。"},{"en":"Many dehydrogenases use NAD⁺ as an electron carrier.","zh":"许多脱氢酶以 NAD⁺ 作为电子载体。"}]}],"synonyms":["oxidoreductase (broader category)"],"phonetic":"/ˌdiˌhaɪˈdrɑːdʒəˌneɪs/","extraExplanation":["词形拆解：de-（去除）+ hydrogen（氢）+ -ase（酶的常见后缀）。因此它的字面意思就是“去掉氢的酶”。","常见搭配/名词：alcohol dehydrogenase（乙醇/酒精脱氢酶）、glucose-6-phosphate dehydrogenase（葡萄糖-6-磷酸脱氢酶，常缩写 G6PD）、lactate dehydrogenase（乳酸脱氢酶，常缩写 LDH）。","学习提示：在生化语境中，“remove hydrogen”通常等同于“把电子转移出去”，所以脱氢酶经常与“氧化（oxidize）”这类词一起出现。"]}
{"word":"dehydrogenate","summary":{"en":"Dehydrogenate means to remove hydrogen from a substance by a chemical reaction.","zh":"Dehydrogenate 指通过化学反应从物质中去除氢（脱氢）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove hydrogen from a substance, usually through a chemical reaction (often in industrial chemistry or biochemistry).","zh":"（通过化学反应）从某种物质中去除氢，常见于工业化学或生物化学。"},"examples":[{"en":"In oil refining, some processes dehydrogenate hydrocarbons to make more reactive molecules.","zh":"在炼油过程中，有些工艺会使烃类脱氢，从而生成更活泼的分子。"},{"en":"Enzymes in the body can dehydrogenate compounds during metabolism.","zh":"在代谢过程中，人体内的酶可以使某些化合物发生脱氢反应。"}]}],"synonyms":["dehydrogenize","remove hydrogen from"],"phonetic":"ˌdiːhaɪˈdrɑːdʒəˌneɪt","extraExplanation":["在有机化学里，dehydrogenate 常用于描述“脱氢反应”（dehydrogenation）：从分子中拿走氢原子/氢气，常常会让分子变得更“不饱和”（例如烷烃 → 烯烃），或更容易进一步反应。","与之相对的是 hydrogenate（加氢）：把氢加到分子上（例如把不饱和的油脂“加氢”变得更饱和、更稳定）。","这个词在日常英语中不常见，多出现在化学、材料、能源、或生物化学相关的学术与工业语境中。"]}
{"word":"dehydrogenated","summary":{"en":"Dehydrogenated describes a substance that has undergone a chemical process removing or altering hydrogen.","zh":"dehydrogenated 指经过脱氢/去氢等化学处理、氢被去除或改变的物质（常见于化学或工业语境）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a substance, especially an oil or fat) having had hydrogen removed or altered through a chemical process (dehydrogenation), often changing how stable or solid it is.","zh":"（尤指油脂等物质）经过“脱氢/去氢”化学处理的；通过脱氢反应去除或改变氢而使其性质（如稳定性、硬度/固态程度）发生变化的。"},"examples":[{"en":"Some foods use dehydrogenated oils to improve shelf life.","zh":"一些食品会使用脱氢处理过的油来延长保质期。"},{"en":"The label says the fat is dehydrogenated, meaning it was chemically processed.","zh":"标签上写着这种脂肪是“脱氢处理的”，意思是它经过了化学加工。"}]}],"synonyms":["dehydrogenized","oxidized (in some reactions)","processed"],"phonetic":"/diˌhaɪˈdrɑdʒəˌneɪtɪd/","extraExplanation":["“dehydrogenated”在食品语境里常让人联想到加工油脂，但更常见的相关词是“hydrogenated（氢化的）”和“partially hydrogenated（部分氢化的）”。注意：氢化通常是“加氢”使不饱和脂肪更饱和、更稳定；而“脱氢（dehydrogenation）”是另一类反应，更多出现在有机化学/工业化学中（例如把醇转成醛/酮）。日常食品标签上出现“dehydrogenated”相对少见，阅读时可结合上下文判断是否指某种加工处理。"]}
{"word":"dehydrogenates","summary":{"en":"“Dehydrogenates” means removes hydrogen from a substance (does a dehydrogenation reaction).","zh":"“dehydrogenates”表示“使……脱氢”，即从物质中去除氢并发生脱氢反应。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Chemistry/Biochemistry) to remove hydrogen (atoms) from a substance, usually by oxidation; to carry out a dehydrogenation reaction.","zh":"（化学/生物化学）从物质中去除氢（原子），通常通过氧化过程；进行脱氢反应。"},"examples":[{"en":"This catalyst dehydrogenates ethanol to form acetaldehyde.","zh":"这种催化剂使乙醇脱氢生成乙醛。"},{"en":"In the liver, an enzyme dehydrogenates fatty acids during metabolism.","zh":"在肝脏中，一种酶在代谢过程中使脂肪酸脱氢。"}]}],"synonyms":["removes hydrogen from","oxidizes","dehydrogenizes","catalyzes dehydrogenation"],"phonetic":"/ˌdiːhaɪˈdrɑːdʒəˌneɪts/","extraExplanation":["“dehydrogenates”是动词第三人称单数（he/she/it dehydrogenates）。原形是 dehydrogenate，名词形式常见 dehydrogenation（脱氢作用/脱氢反应）。","在有机化学里，脱氢常用于把烷烃/醇等转化为更不饱和的化合物（如烯烃、醛/酮）；在生物化学里常与“脱氢酶（dehydrogenase）”相关，常伴随 NAD⁺/FAD 等辅酶的电子转移。"]}
{"word":"dehydrogenating","summary":{"en":"Dehydrogenating means removing hydrogen from a compound in a chemical or biological reaction.","zh":"dehydrogenating 指在化学或生物反应中使化合物脱去氢（脱氢）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(chemistry/biochemistry) Removing hydrogen atoms from a substance; carrying out a reaction in which a compound loses hydrogen (often with the help of a catalyst or an enzyme).","zh":"（化学/生物化学）使某物脱氢；进行一种使化合物失去氢原子（常在催化剂或酶作用下）的反应。"},"examples":[{"en":"The process is dehydrogenating the oil to make it more stable.","zh":"这个过程是在给油脂脱氢，使它更稳定。"},{"en":"In cells, enzymes are dehydrogenating molecules to release energy.","zh":"在细胞中，酶会让分子发生脱氢反应以释放能量。"},{"en":"They are dehydrogenating ethanol to form acetaldehyde.","zh":"他们在让乙醇脱氢生成乙醛。"}]}],"synonyms":["removing hydrogen","oxidizing (in some contexts)","dehydrogenation (noun form)"],"phonetic":"/ˌdiːhaɪˈdrɑːdʒəˌneɪtɪŋ/","extraExplanation":["“de-”表示“去除/离开”，“hydrogen”是“氢”，“-ate”常构成动词，“-ing”表示正在进行或作动名词使用。","在工业语境里，dehydrogenating 常见于石油化工（例如烃类脱氢制烯烃）或油脂加工；在生物学里常与“脱氢酶（dehydrogenase）”相关，指代谢过程中把氢（或电子）转移出去的步骤。","学习提示：别和“hydrogenating（加氢）”混淆。hydrogenating 是“加上氢”，dehydrogenating 是“去掉氢”，两者意义相反。"]}
{"word":"dehydrogenation","summary":{"en":"Dehydrogenation is the process of removing hydrogen from a molecule in a chemical reaction.","zh":"Dehydrogenation 指在化学反应中从分子中移除氢的过程（脱氢反应）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical reaction in which hydrogen atoms are removed from a molecule, often forming a double bond or making the molecule more unsaturated","zh":"脱氢反应；从分子中移除氢原子的化学反应，常会形成双键或使分子更不饱和"},"examples":[{"en":"Dehydrogenation of ethanol can produce acetaldehyde.","zh":"乙醇的脱氢反应可以生成乙醛。"},{"en":"In oil refining, dehydrogenation is used to make more reactive chemicals for plastics.","zh":"在石油炼制中，脱氢反应用于制备更活泼、可用于塑料生产的化学品。"},{"en":"The catalyst speeds up the dehydrogenation step.","zh":"催化剂会加速脱氢这一步。"}]}],"synonyms":["hydrogen removal","dehydrogenating (process)","oxidation (in some contexts)"],"phonetic":"/diˌhaɪdrədʒəˈneɪʃən/","extraExplanation":["词根拆解：de-（去除、移开）+ hydrogen（氢）+ -ation（动作/过程名词后缀），字面意思就是“去掉氢的过程”。","常见语境：有机化学与工业化学中很常见，常与“catalyst（催化剂）”“oxidation（氧化）”“hydrogenation（加氢，脱氢的反过程）”一起出现。","与“oxidation（氧化）”的关系：很多脱氢反应在反应机理或结果上类似于“被氧化”（失去氢或电子），但两者不完全等同，具体要看反应条件与定义。"]}
{"word":"dehydrogenisation","summary":{"en":"Dehydrogenisation means removing hydrogen from a molecule in a chemical reaction (same as dehydrogenation).","zh":"dehydrogenisation 指化学反应中的“脱氢”（从分子中去除氢），与 dehydrogenation 同义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical process in which hydrogen atoms are removed from a molecule; also called “dehydrogenation.”","zh":"（化学）脱氢作用：从分子中移除氢原子（或氢气）的过程；也常称为 dehydrogenation（脱氢）。"},"examples":[{"en":"In organic chemistry, dehydrogenisation can turn an alkane into an alkene by removing hydrogen.","zh":"在有机化学中，脱氢作用可以通过移除氢，把烷烃转变为烯烃。"},{"en":"Catalysts are often used to speed up dehydrogenisation in industrial reactions.","zh":"在工业反应中，常用催化剂来加速脱氢作用。"}]}],"synonyms":["dehydrogenation"],"phonetic":"/diˌhaɪdrɑːdʒəˌneɪʃən/","extraExplanation":["“dehydrogenisation”在英式或较传统的写法中偶尔出现，但在现代科研与工业语境里更常见、更标准的词是“dehydrogenation”。两者意思相同。","词形结构：de-（去除）+ hydrogen（氢）+ -ation / -isation（名词后缀），字面意思就是“去氢的过程”。","常见应用场景包括：石油炼制与有机合成（如将饱和烃变为不饱和烃）、以及燃料电池/储氢材料研究中的“脱氢/加氢”循环。"]}
{"word":"dehydrogenise","summary":{"en":"Dehydrogenise means to remove hydrogen from a substance (to cause dehydrogenation).","zh":"dehydrogenise 意为“（使）脱氢”，即从物质中去除氢/使其发生脱氢反应。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove hydrogen from a substance; to cause a compound to lose hydrogen atoms (often in chemistry or biochemistry).","zh":"（使）脱氢；从物质中去除氢，或使化合物失去氢原子（常用于化学/生物化学）。"},"examples":[{"en":"Enzymes can dehydrogenise alcohols to form aldehydes or ketones.","zh":"酶可以使醇类脱氢，从而生成醛或酮。"},{"en":"In industrial chemistry, catalysts are used to dehydrogenise hydrocarbons.","zh":"在工业化学中，会使用催化剂使烃类脱氢。"}]}],"synonyms":["dehydrogenate","oxidize (in some contexts)","remove hydrogen from"],"phonetic":"/ˌdiˌhaɪˈdrɑːdʒəˌnaɪz/","extraExplanation":["“dehydrogenise”是英式拼写；美式更常见的形式是“dehydrogenize”。","在生物化学里常见于“脱氢酶（dehydrogenase）”相关反应：底物被氧化（失去氢/电子），常同时伴随NAD+或FAD被还原。"]}
{"word":"dehydrogenised","summary":{"en":"Dehydrogenised means hydrogen has been removed from a substance; it’s also the past form of “dehydrogenise.”","zh":"dehydrogenised 指“已脱氢的/去除氢的”，也可作动词 dehydrogenise 的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having had hydrogen removed (used in chemistry/biochemistry; often describing a substance or compound after a reaction).","zh":"（化学/生物化学）脱氢的；已去除氢的（常用于描述反应后某种物质/化合物的状态）。"},"examples":[{"en":"The sample was dehydrogenised during the oxidation step.","zh":"该样品在氧化步骤中发生了脱氢处理。"},{"en":"A dehydrogenised compound may be more reactive than its original form.","zh":"脱氢后的化合物可能比原来的形式更活泼。"}]},{"partOfSpeech":"vt.","definition":{"en":"past form of “dehydrogenise”: to remove hydrogen from a substance, usually by a chemical reaction.","zh":"“dehydrogenise”的过去式/过去分词：使（某物）脱氢；通常通过化学反应去除氢。"},"examples":[{"en":"The enzyme dehydrogenised the alcohol to an aldehyde.","zh":"该酶使醇脱氢生成醛。"},{"en":"They dehydrogenised the material to change its properties.","zh":"他们通过脱氢处理该材料以改变其性质。"}]}],"synonyms":["dehydrogenated","oxidized (in some contexts)"],"phonetic":"/ˌdiːhaɪˈdrɑːdʒəˌnaɪzd/","extraExplanation":["“dehydrogenised”在美式英语里更常见的拼写是 **dehydrogenized**（-ize 结尾），英式英语常用 **dehydrogenised**（-ise 结尾）。两者意思相同。","在化学里，“脱氢”常和“氧化”有关：去掉氢原子/氢气，常使分子不饱和程度上升或结构改变；在生物化学中常见于“脱氢酶（dehydrogenase）”催化的反应。"]}
{"word":"dehydrogeniser","summary":{"en":"A dehydrogeniser removes hydrogen from a substance during a chemical process.","zh":"dehydrogeniser 指在化学过程中用于“脱氢”的装置或试剂/催化剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device, catalyst, or chemical agent used to remove hydrogen from a substance in a chemical process (dehydrogenation), often in industrial chemistry or petroleum refining.","zh":"脱氢器；脱氢剂：用于在化学过程中从物质中移除氢（脱氢反应）的装置、催化剂或化学试剂，常见于工业化学或石油炼制。"},"examples":[{"en":"The refinery uses a dehydrogeniser to convert alkanes into alkenes more efficiently.","zh":"炼油厂使用脱氢器更高效地把烷烃转化为烯烃。"},{"en":"A platinum-based dehydrogeniser can speed up the reaction under controlled temperatures.","zh":"以铂为基础的脱氢剂可以在受控温度下加快反应。"}]}],"synonyms":["dehydrogenizer","dehydrogenation catalyst","dehydrogenation unit"],"phonetic":"/diːˈhaɪdrədʒəˌnaɪzər/","extraExplanation":["“dehydrogeniser”是英式拼写；美式更常写作“dehydrogenizer”。两者含义相同。","该词多出现在化工、催化、炼油等技术语境中；日常英语里很少用。理解时可把它拆成：de-（去除）+ hydrogen（氢）+ -iser（使……发生的东西/装置/药剂）。"]}
{"word":"dehydrogenising","summary":{"en":"Dehydrogenising means removing hydrogen from a substance (a dehydrogenation reaction).","zh":"dehydrogenising 指“脱氢”，即从物质中去除氢的化学反应过程。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"removing hydrogen atoms from a substance (a chemical process), usually by oxidation or with a catalyst; the act of carrying out this process","zh":"（化学）从物质中去除氢原子（脱氢）的过程；进行脱氢反应的行为"},"examples":[{"en":"Dehydrogenising ethanol produces acetaldehyde under the right conditions.","zh":"在合适条件下，对乙醇进行脱氢会生成乙醛。"},{"en":"The catalyst speeds up the dehydrogenising step in the reaction.","zh":"催化剂会加快该反应中的脱氢步骤。"},{"en":"Scientists are dehydrogenising the compound to create a more reactive intermediate.","zh":"科学家正在对该化合物进行脱氢，以生成更活泼的中间体。"}]}],"synonyms":["dehydrogenating","removing hydrogen","oxidizing (in some contexts)"],"phonetic":"/ˌdiˌhaɪˈdrɑːdʒəˌnaɪzɪŋ/","extraExplanation":["“dehydrogenising”是英式拼写；美式更常写作“dehydrogenizing”。两者意思相同。","在有机化学里，“脱氢”常意味着把分子中的氢去掉，使分子更“氧化”（例如醇→醛/酮），也常与“hydrogenation（加氢）”互为相反概念。"]}
{"word":"dehydrogenization","summary":{"en":"Dehydrogenization is the chemical process of removing hydrogen from a compound.","zh":"Dehydrogenization 指从化合物中去除氢的化学过程（脱氢）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) The process of removing hydrogen atoms from a molecule; oxidation that often forms a double bond or an aromatic structure.","zh":"（化学）从分子中移除氢原子的过程；一种常见的氧化反应，常导致形成双键或芳香结构。"},"examples":[{"en":"In refining, dehydrogenization can convert alkanes into alkenes to make more useful chemicals.","zh":"在炼油过程中，脱氢作用可以把烷烃转化为烯烃，以制备更有用的化学品。"},{"en":"The catalyst speeds up dehydrogenization by lowering the energy needed to remove hydrogen.","zh":"催化剂通过降低脱去氢所需的能量来加速脱氢过程。"}]}],"synonyms":["dehydrogenation","hydrogen removal"],"phonetic":"/diˌhaɪdrɑdʒənəˈzeɪʃən/","extraExplanation":["“dehydrogenization”在科技写作中可见，但更常用、也更规范的说法是“dehydrogenation（脱氢反应）”。两者意思基本相同。","词形拆解：de-（去除）+ hydrogen（氢）+ -ization（……化/过程）。常用于有机化学、石油化工与催化反应的语境。"]}
{"word":"dehydrogenize","summary":{"en":"Dehydrogenize means to remove hydrogen from a substance, or to undergo hydrogen removal.","zh":"dehydrogenize 指“脱氢”：把物质中的氢去除，或发生氢被去除的过程。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove hydrogen from a substance (often in a chemical reaction)","zh":"（常指在化学反应中）从某种物质中去除氢/脱氢"},"examples":[{"en":"In this step, the enzyme helps dehydrogenize the molecule.","zh":"在这一步中，这种酶帮助该分子脱氢。"},{"en":"Heating the compound can dehydrogenize it and change its structure.","zh":"加热这种化合物可能会使其脱氢并改变其结构。"}]},{"partOfSpeech":"vi.","definition":{"en":"to undergo a process in which hydrogen is removed","zh":"发生脱氢过程；氢被去除"},"examples":[{"en":"Under these conditions, the material begins to dehydrogenize.","zh":"在这些条件下，这种材料开始脱氢。"}]}],"synonyms":["dehydrogenate","remove hydrogen from","oxidize (in some biochemical contexts)"],"phonetic":"/diˌhaɪˈdrɑdʒəˌnaɪz/","extraExplanation":["“dehydrogenize”是较少见的表达，更常见的学术/工业用语是“dehydrogenate”（脱氢）以及名词“dehydrogenation”（脱氢作用/脱氢反应）。","前缀“de-”表示“去除/除去”，词根“hydrogen”是“氢”，后缀“-ize”表示“使……化/使发生……过程”。因此字面意思就是“使去氢化/使脱氢”。","常见语境：有机化学（例如把烷烃脱氢成烯烃）、生物化学（许多“脱氢酶”dehydrogenase 参与把氢/电子从底物转移出去）。"]}
{"word":"dehydrogenized","summary":{"en":"Dehydrogenized means “having had hydrogen removed,” mainly used in chemistry (and less commonly in food/industry wording).","zh":"dehydrogenized 意为“脱氢的/被去除氢的”，主要用于化学语境（食品/工业中这种说法相对少见）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry, of a substance) having had hydrogen removed from it; treated by a process that removes hydrogen atoms (dehydrogenation).","zh":"（化学）脱氢的；经过“脱氢反应/脱氢处理”的（指物质被去除氢原子）。"},"examples":[{"en":"In refining, some hydrocarbons are dehydrogenized to form alkenes.","zh":"在炼制过程中，一些烃会被脱氢生成烯烃。"},{"en":"The dehydrogenized compound is more unsaturated than the original molecule.","zh":"这种脱氢后的化合物比原来的分子更不饱和。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Food/industry, of an oil or fat) processed by hydrogen removal, often to change stability, texture, or melting point (less common wording than “dehydrogenated”).","zh":"（食品/工业，指油脂）通过去除氢而加工处理的，常用于改变稳定性、质地或熔点（这种说法不如 dehydrogenated 常见）。"},"examples":[{"en":"The label uses a technical term: dehydrogenized oil.","zh":"标签用了一个技术词：脱氢油。"},{"en":"Researchers compared fresh oil with dehydrogenized samples under heat.","zh":"研究人员比较了新鲜油与脱氢样品在加热条件下的表现。"}]}],"synonyms":["dehydrogenated","hydrogen-stripped","dehydrogenated (compound)"],"phonetic":"/ˌdiːhaɪˈdrɑːdʒəˌnaɪzd/","extraExplanation":["“dehydrogenized”在英语里通常是“dehydrogenize（脱氢）”的过去分词/形容词用法，但在很多教材、论文和食品语境中更常见的是“dehydrogenated”。两者意思接近，都与“脱氢反应（dehydrogenation）”有关。","词根拆解有助记忆：de-（去除）+ hydrogen（氢）+ -ize（使…化）+ -ed（完成/被动）。因此整体就是“被去掉氢的”。","化学上“脱氢”往往会让分子更不饱和（例如从烷烃到烯烃/芳香化），常见于石油化工、催化反应与有机合成。食品标签中如果看到类似词，建议结合上下文判断具体工艺与健康含义（不同工艺影响不同，如氢化/反式脂肪等通常是另一类话题）。"]}
{"word":"dehydrogenizer","summary":{"en":"A dehydrogenizer removes hydrogen from a substance, usually in industrial chemical processes.","zh":"dehydrogenizer 指“脱氢器/脱氢剂”，用于在工业化学过程中从物质中去除氢。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a machine, chemical agent, or catalyst used to remove hydrogen from a substance (to dehydrogenate it), often in industrial chemistry (for example, converting alkanes to alkenes).","zh":"脱氢器；脱氢剂（用于从物质中去除氢的设备、化学试剂或催化剂，常见于工业化学过程，如把烷烃转化为烯烃）。"},"examples":[{"en":"The plant installed a new dehydrogenizer to improve olefin production.","zh":"工厂安装了一套新的脱氢器，以提高烯烃产量。"},{"en":"In this process, the dehydrogenizer helps remove hydrogen from the feedstock.","zh":"在这个过程中，脱氢器帮助从原料中去除氢。"}]}],"synonyms":["dehydrogenation unit","dehydrogenation reactor","dehydrogenating agent","dehydrogenation catalyst"],"phonetic":"/ˌdiːhaɪˈdrɑːdʒənaɪzər/","extraExplanation":["这个词在日常英语里很少见，更常出现在化工/炼油/催化相关的技术文档中。","词形上由 de-（去除）+ hydrogen（氢）+ -ize（使……化）+ -er（……的人/物/装置）构成，字面意思就是“进行脱氢的装置/物质”。"]}
{"word":"dehydrogenizes","summary":{"en":"Dehydrogenizes means removes hydrogen from a compound (does dehydrogenation).","zh":"Dehydrogenizes 指“使……脱氢”，即从化合物中去除氢、进行脱氢反应。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of a substance or process) to remove hydrogen from a compound; to carry out dehydrogenation.","zh":"（指物质或过程）从化合物中去除氢；进行脱氢反应。"},"examples":[{"en":"In the refinery, the catalyst dehydrogenizes hydrocarbons to make them more reactive.","zh":"在炼油厂中，催化剂使烃类脱氢，从而让它们更具反应性。"},{"en":"This enzyme dehydrogenizes the substrate during cellular respiration.","zh":"在细胞呼吸过程中，这种酶使底物脱氢。"}]},{"partOfSpeech":"vt.","definition":{"en":"to take hydrogen away from something (often in chemistry or biochemistry).","zh":"把氢从某物中移走（常用于化学或生物化学语境）。"},"examples":[{"en":"The lab procedure dehydrogenizes the alcohol to form an aldehyde.","zh":"该实验步骤使醇脱氢生成醛。"}]}],"synonyms":["dehydrogenates","oxidizes (in some contexts)","removes hydrogen from"],"phonetic":"/ˌdiːhaɪˈdrɑːdʒənaɪz/","extraExplanation":["“dehydrogenizes”是动词“dehydrogenize”的第三人称单数现在时（he/she/it dehydrogenizes）。常见于化学、炼油与生物化学文献中。","在有机化学里，“脱氢”常意味着把分子中的氢原子移除，从而形成双键/芳香性或更高氧化态的产物；在生物化学里常由“脱氢酶（dehydrogenase）”催化，并伴随NAD⁺/FAD等辅酶的电子转移。"]}
{"word":"dehydrohalogenate","summary":{"en":"To remove a hydrogen and a halogen (as HX) from a molecule, typically producing an alkene.","zh":"从分子中脱去氢和卤素（以卤化氢 HX 的形式），通常生成烯烃。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Chemistry) To remove a hydrogen halide (HX, such as HCl or HBr) from an organic molecule, usually forming a double bond (an alkene) in the process.","zh":"（化学）从有机分子中脱去卤化氢（HX，如 HCl 或 HBr），通常因此生成双键（形成烯烃）。"},"examples":[{"en":"Under strong base and heat, the alkyl halide can dehydrohalogenate to form an alkene.","zh":"在强碱和加热条件下，卤代烷可以发生脱卤化氢反应生成烯烃。"},{"en":"The reaction dehydrohalogenates 2-bromopropane, giving propene as the major product.","zh":"该反应使 2-溴丙烷脱卤化氢，主要产物为丙烯。"},{"en":"We used potassium tert-butoxide to dehydrohalogenate the substrate efficiently.","zh":"我们使用叔丁醇钾来高效地使底物脱卤化氢。"}]}],"synonyms":["eliminate HX","dehydrohalogenation (reaction/process)","undergo elimination"],"phonetic":"/diˌhaɪdroʊˈhælədʒəˌneɪt/","extraExplanation":["“de-（去除）+ hydro（氢）+ halogen（卤素）+ -ate（动词后缀）”组合而成，字面意思就是“去掉氢和卤素”。","在有机化学里，这类反应常归入“消除反应（elimination）”，常见机理有 E2（一步、强碱、常需加热）和 E1（两步、经碳正离子中间体）。","常见条件：强碱（如 KOH、t-BuOK）/加热；结果往往是卤代烃变成烯烃，同时生成卤化氢或其盐。"]}
{"word":"dehydrohalogenation","summary":{"en":"Dehydrohalogenation is an elimination reaction that removes H and a halogen (X) from a molecule to form an alkene plus HX (like HCl or HBr).","zh":"Dehydrohalogenation（脱卤化氢）是一种消除反应，从分子中脱去氢和卤素（X），生成烯烃并放出 HX（如 HCl、HBr）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Organic chemistry) An elimination reaction that removes a hydrogen atom and a halogen atom (X) from a molecule—often from neighboring (adjacent) carbons—to form a double bond (an alkene) and a hydrogen halide (HX, such as HCl or HBr).","zh":"（有机化学）脱卤化氢反应：从分子中脱去一个氢原子和一个卤素原子（X），常发生在相邻碳原子上，从而生成双键（烯烃）并产生卤化氢 HX（如 HCl、HBr）。"},"examples":[{"en":"Dehydrohalogenation of bromoethane can produce ethene and HBr under basic conditions.","zh":"在碱性条件下，溴乙烷的脱卤化氢反应可生成乙烯和 HBr。"},{"en":"A strong base often promotes dehydrohalogenation, leading to formation of an alkene.","zh":"强碱常能促进脱卤化氢反应，从而生成烯烃。"},{"en":"The lab report compared dehydrohalogenation and substitution as two competing pathways.","zh":"实验报告比较了脱卤化氢与取代反应这两条可能相互竞争的途径。"}]}],"synonyms":["dehydrohalogenation reaction","HX elimination","β-elimination (often)"],"phonetic":"diˌhaɪdroʊˌhælədʒəˈneɪʃən","extraExplanation":["该词由 de-（去除）+ hydro（氢）+ halogen（卤素）+ -ation（过程/反应）构成，字面意思就是“去除氢和卤素的过程”。","在有机反应机理中，它常与消除反应（elimination）联系在一起，很多教材会把它作为 E2 或 E1 消除的典型例子；具体走哪种机理取决于底物结构、碱的强弱、溶剂与温度等。","常见底物是卤代烃（alkyl halides），常见产物是烯烃（alkenes）；“脱卤化氢”与“加成 H-X”（hydrohalogenation，氢卤化/卤化氢加成）在概念上常被视为相反方向的反应。"]}
{"word":"dehydromucic","summary":{"en":"A rare chemistry adjective meaning “related to dehydromucic acid.”","zh":"一个很少见的化学形容词，意为“与脱水黏糖酸有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Relating to dehydromucic acid, a chemical compound derived from mucic acid and discussed mainly in chemical literature.","zh":"（化学）与“脱水黏糖酸（dehydromucic acid）”有关的；主要见于化学文献中，指由黏糖酸（mucic acid）衍生而来的化合物或其性质。"},"examples":[{"en":"The paper reports the synthesis of a dehydromucic derivative under acidic conditions.","zh":"这篇论文报告了在酸性条件下合成一种脱水黏糖酸衍生物。"},{"en":"Dehydromucic compounds are rarely mentioned outside specialized organic chemistry texts.","zh":"脱水黏糖酸相关化合物在有机化学专著之外很少被提及。"}]}],"synonyms":["(no common everyday synonyms)"],"phonetic":"/diˌhaɪdroʊˈmjuːsɪk/","extraExplanation":["这个词非常少见，通常只在学术论文或旧式化学命名中出现。日常英语中几乎不用。","词形上可拆为：dehydro-（脱氢/脱水、去除氢相关成分，常见于化学命名）+ mucic（与黏糖酸 mucic acid 相关）。因此它多用来修饰“acid/compound/derivative（酸/化合物/衍生物）”等名词。","如果你是在阅读具体论文或配方中遇到它，往往需要结合上下文确认它指的是“dehydromucic acid（脱水黏糖酸）”本身，还是某种“dehydromucic derivative（衍生物）”。"]}
{"word":"dehydroretinol","summary":{"en":"Dehydroretinol is vitamin A2, a retinol-related compound important for vision and vitamin A activity.","zh":"dehydroretinol 指维生素A2，是与视黄醇相关、对视觉及维生素A功能重要的化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A form of vitamin A (also called vitamin A2), closely related to retinol (vitamin A1), involved in vision and other vitamin A functions in the body.","zh":"维生素A的一种形式（也称维生素A2），与视黄醇（维生素A1）结构相近，参与视觉及维生素A在体内的其他功能。"},"examples":[{"en":"Some fish contain dehydroretinol, a vitamin A2 form.","zh":"一些鱼类含有脱氢视黄醇（维生素A2的一种形式）。"},{"en":"Researchers measured dehydroretinol levels to study vitamin A status in the sample.","zh":"研究人员测量脱氢视黄醇水平，以评估样本的维生素A状况。"}]}],"synonyms":["vitamin A2","3,4-dehydroretinol"],"phonetic":"/diˌhaɪdroʊˈrɛtənɔl/","extraExplanation":["“dehydro-”表示“脱氢/少了氢原子”，因此 dehydroretinol 常指 3,4-脱氢视黄醇（3,4-dehydroretinol），属于维生素A家族的一员。","在营养学中常用“vitamin A1（retinol）/ vitamin A2（dehydroretinol）”来区分不同结构的维生素A；A2在某些鱼类和水生生物中更常见。","它属于较专业的生化/营养学词汇，日常英语更常见的是 vitamin A 或 retinol。"]}
{"word":"dehydrosparteine","summary":{"en":"Dehydrosparteine is a technical name for a chemical compound related to the alkaloid sparteine.","zh":"Dehydrosparteine 是一个化学术语，指与生物碱金雀花碱（sparteine）相关的化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound related to the alkaloid sparteine; used mainly as a technical term in chemistry/pharmacology.","zh":"一种与生物碱“金雀花碱（sparteine）”相关的化学化合物；主要用于化学/药理学等专业语境的技术术语。"},"examples":[{"en":"Dehydrosparteine is mentioned in some older pharmacology papers as a derivative of sparteine.","zh":"在一些较早的药理学论文中会提到 dehydrosparteine，它是金雀花碱的衍生物。"},{"en":"The lab compared sparteine and dehydrosparteine to study how small structural changes affect biological activity.","zh":"实验室比较了 sparteine 和 dehydrosparteine，以研究微小的结构变化如何影响生物活性。"}]}],"synonyms":["DHSP","sparteine derivative"],"phonetic":"/ˌdiːˌhaɪdroʊˈspɑːrtiːn/","extraExplanation":["这是一个非常专业的化学名称，在日常英语中几乎不会出现。阅读科研文献时常见的线索包括：它可能被缩写为 DHSP，或与“sparteine（sparteine alkaloid）”“derivative（衍生物）”“oxidation（氧化/脱氢）”等词一起出现。","词形拆解：dehydro- 常表示“脱氢的/去氢的”（化学里指少了氢或形成不饱和结构），sparteine 是一种天然生物碱名；合在一起通常暗示“sparteine 的脱氢形式/相关衍生物”。"]}
{"word":"dehydrotestosterone","summary":{"en":"Dehydrotestosterone (DHT) is a powerful hormone made from testosterone that affects male development, hair, skin, and the prostate.","zh":"双氢睾酮（DHT）是由睾酮转化而来的强效雄激素，会影响男性发育、头发、皮肤和前列腺。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong androgen (male sex hormone) made from testosterone in the body; it plays an important role in male sexual development and affects hair growth, skin oiliness, and the prostate","zh":"一种强效雄激素（男性性激素），由体内睾酮转化而来；在男性性发育中很重要，并影响毛发生长、皮脂分泌和前列腺"},"examples":[{"en":"Dehydrotestosterone (DHT) is formed when the enzyme 5-alpha reductase converts testosterone.","zh":"当 5α-还原酶把睾酮转化时，就会生成双氢睾酮（DHT）。"},{"en":"High levels of DHT are linked to male-pattern hair loss in many people.","zh":"在许多人身上，较高的 DHT 水平与雄激素性脱发（男性型脱发）有关。"},{"en":"Some medications lower DHT to help treat an enlarged prostate.","zh":"一些药物会降低 DHT，用来帮助治疗前列腺增生。"}]}],"synonyms":["DHT"],"phonetic":"/ˌdiːˌhaɪdroʊtɛˈstɑːstərˌoʊn/","extraExplanation":["缩写：常写作 DHT。","构词提示：de-（去除/减少）+ hydro（氢）+ testosterone（睾酮）。这里的“dehydro-”表示与“氢的减少/变化”有关，指这种激素与睾酮在化学结构上的差异。","学习用法：这是医学/生物学术语，日常口语更常说“DHT”。常见搭配有：DHT levels（DHT 水平）、DHT blockers/inhibitors（DHT 阻断剂/抑制剂）、DHT conversion（DHT 转化）。"]}
{"word":"dehypnotize","summary":{"en":"“Dehypnotize” means to bring someone out of hypnosis or remove hypnotic effects.","zh":"“Dehypnotize” 指让某人从催眠中醒来，或解除催眠带来的影响。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to bring someone out of hypnosis; to undo a hypnotic state or the effects of hypnosis","zh":"使某人从催眠状态中醒来；解除催眠状态或其影响"},"examples":[{"en":"The therapist dehypnotized the patient and asked how they felt.","zh":"治疗师让病人解除催眠状态，然后询问他们感觉如何。"},{"en":"It can take a few minutes to dehypnotize someone safely.","zh":"安全地让人解除催眠状态可能需要几分钟。"}]}],"synonyms":["bring out of hypnosis","awaken","reverse hypnosis"],"phonetic":"/diˈhɪp.nə.taɪz/","extraExplanation":["构词上，de- 表示“去除、解除”，hypnotize 表示“使进入催眠状态”，合起来就是“解除催眠”。在日常英语中，这个词不算常见，更常用的说法是 “bring someone out of hypnosis” 或 “wake someone up from hypnosis”。","语境上多见于心理治疗、舞台催眠或科普讨论中。也可能在小说/影视里被夸张使用，表示“打破某种被控制的状态”（比喻用法）。"]}
{"word":"dehypnotized","summary":{"en":"Dehypnotized means no longer hypnotized, or having been brought out of hypnosis.","zh":"dehypnotized 指“已解除催眠的 / 不再被催眠的”，也可作动词 dehypnotize 的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"brought out of hypnosis; caused to stop being hypnotized.","zh":"被解除催眠的；不再处于催眠状态的。"},"examples":[{"en":"After a few minutes, the patient was dehypnotized and could speak normally again.","zh":"几分钟后，病人被解除催眠，又能正常说话了。"},{"en":"She looked confused for a moment after being dehypnotized.","zh":"她被解除催眠后，一时看起来有点困惑。"}]},{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of dehypnotize: to remove someone from a hypnotic state.","zh":"dehypnotize 的过去式/过去分词：使某人解除催眠、从催眠状态中恢复。"},"examples":[{"en":"The therapist dehypnotized him gently at the end of the session.","zh":"治疗师在疗程结束时轻柔地使他解除催眠。"},{"en":"He was dehypnotized before leaving the stage.","zh":"他在离开舞台前被解除催眠。"}]}],"synonyms":["brought out of hypnosis","awakened (from hypnosis)","released from hypnosis"],"phonetic":"/ˌdiˈhɪp.nə.taɪzd/","extraExplanation":["“de-” 是常见前缀，表示“去除、取消、逆转”（如 deactivate 取消激活、decode 解码）。因此 dehypnotize / dehypnotized 字面意思就是“把催眠状态去掉”。","这个词在日常英语里不算常见，更常见的说法是 “bring someone out of hypnosis”（使某人从催眠中恢复）或 “wake someone up from hypnosis”。"]}
{"word":"dehypnotizing","summary":{"en":"“Dehypnotizing” means removing hypnosis—bringing someone out of a hypnotic state.","zh":"“dehypnotizing”指解除催眠，使人从催眠状态中清醒。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"the act or process of bringing someone out of a hypnotic state; removing the effects of hypnosis","zh":"使某人从催眠状态中清醒过来；解除催眠影响的过程"},"examples":[{"en":"The therapist is dehypnotizing the patient slowly and calmly.","zh":"治疗师正缓慢而平静地为病人解除催眠。"},{"en":"After dehypnotizing her, he asked how she felt and what she remembered.","zh":"在为她解除催眠后，他问她感觉如何、记得什么。"},{"en":"A clear voice and careful steps are important when dehypnotizing someone.","zh":"在为某人解除催眠时，清晰的声音和谨慎的步骤很重要。"}]}],"synonyms":["bringing out of hypnosis","waking up (from hypnosis)","deprogramming (loosely, not the same)"],"phonetic":"/diˈhɪpnəˌtaɪzɪŋ/","extraExplanation":["“dehypnotizing”是动词“dehypnotize”的现在分词形式，常见于进行时（is/are dehypnotizing）或作动名词（Dehypnotizing takes time）。","构词上由前缀 de-（表示“去除、解除”）+ hypnotize（催眠）组成，语义直观：把催眠状态“去掉”。","在现实语境中多见于催眠治疗（hypnotherapy）、舞台催眠（stage hypnosis）或相关说明文字；日常对话里更常用说法是 “bring someone out of hypnosis / wake someone up from hypnosis”。"]}

