{"word":"DEI","summary":{"en":"DEI usually means “diversity, equity, and inclusion,” referring to efforts to create fair, welcoming environments for people of different backgrounds.","zh":"DEI通常指“多元、公平与包容”，即为不同背景的人创造更公平、更友好的环境的一类理念与措施。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"diversity, equity, and inclusion (a set of values and workplace/school practices that aim to welcome people from different backgrounds, treat people fairly, and make everyone feel they belong)","zh":"多元、公平与包容（指在职场或学校中推动接纳不同背景、实现公平对待并营造归属感的一套价值观与做法）"},"examples":[{"en":"The company expanded its DEI program by improving hiring practices and accessibility.","zh":"这家公司通过改进招聘流程和无障碍设施来扩大其DEI项目。"},{"en":"Our DEI training focuses on respectful communication and reducing bias.","zh":"我们的DEI培训重点是尊重沟通与减少偏见。"},{"en":"Some people debate DEI policies in politics and education.","zh":"在政治与教育领域，一些人会就DEI政策展开争论。"}]},{"partOfSpeech":"n.","definition":{"en":"an office/team or job role responsible for planning and running DEI work (often in large organizations)","zh":"负责推动DEI工作的部门/团队或职位（常见于大型组织）"},"examples":[{"en":"She works in DEI and leads inclusive leadership workshops.","zh":"她在DEI部门工作，并主持包容性领导力工作坊。"},{"en":"We asked DEI to review the policy for fairness and clarity.","zh":"我们请DEI团队审查该政策是否公平且表述清晰。"}]}],"synonyms":["diversity and inclusion (D&I)","inclusion","belonging (in workplace context)","equity initiatives"],"phonetic":"/ˌdiː iː ˈaɪ/","extraExplanation":["“DEI”通常按字母逐个读（D-E-I）。在美国语境中，它常见于企业、大学、政府与非营利组织的管理与公共讨论中；不同群体对DEI的目标、方式与效果可能有不同看法。正式写作中首次出现可写全称“diversity, equity, and inclusion (DEI)”。"]}
{"word":"dei","summary":{"en":"DEI means “Diversity, Equity, and Inclusion,” usually referring to policies or programs that aim to make groups more diverse, fair, and welcoming.","zh":"DEI 指“多元、公平与包容”，通常用于描述旨在提升多样性、促进公平并营造包容环境的政策或项目。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abbreviation for “Diversity, Equity, and Inclusion,” a set of goals and practices intended to create fairer, more welcoming environments for people of different backgrounds and identities (often used in workplaces, schools, and government).","zh":"“多元（Diversity）、公平（Equity）与包容（Inclusion）”的缩写；指一套目标与实践，旨在让不同背景与身份的人在职场、学校或机构中获得更公平、更受尊重与更有参与感的环境。"},"examples":[{"en":"The company created a DEI committee to improve hiring and workplace culture.","zh":"公司成立了 DEI 委员会，以改善招聘方式和职场文化。"},{"en":"She leads DEI training sessions for managers.","zh":"她为管理者主持 DEI 培训课程。"},{"en":"The university published its DEI goals for the next five years.","zh":"这所大学公布了未来五年的 DEI 目标。"}]}],"synonyms":["diversity and inclusion (D&I)","inclusion initiatives","equity programs","belonging initiatives"],"phonetic":"/ˌdi.iˈaɪ/","extraExplanation":["在英语里，DEI 通常读作字母：D–E–I。它在北美公共讨论中很常见，但不同人对它的理解与态度可能差异很大：支持者强调机会更公平、环境更友好；批评者可能担心形式化、指标化或与政治立场混在一起。写作或交流时，最好先说明你指的是哪些具体做法（例如“无偏见招聘”“无障碍设施”“反歧视政策”）。"]}
{"word":"deia","summary":{"en":"“Idea” means a thought, plan, or an understanding of something.","zh":"“idea”表示“想法/主意”，也可表示“概念或大致的理解”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A thought, plan, or suggestion about what to do or how to do something.","zh":"想法；主意；计划（关于做什么或如何做的想法）"},"examples":[{"en":"I have an idea for our next project.","zh":"我对我们下一个项目有个想法。"},{"en":"That’s a good idea—let’s try it.","zh":"那是个好主意——我们试试。"}]},{"partOfSpeech":"n.","definition":{"en":"A general understanding or mental picture of something.","zh":"概念；大致的理解；印象"},"examples":[{"en":"I have no idea where my keys are.","zh":"我不知道我的钥匙在哪儿。"},{"en":"Do you have an idea of how much it costs?","zh":"你大概知道它要花多少钱吗？"}]}],"synonyms":["thought","plan","suggestion","concept","notion"],"phonetic":"/aɪˈdiːə/","extraExplanation":["“deia”不是常见英文单词；最常见的情况是把“idea”（想法）拼错了，正确拼写是 i-d-e-a。","另外，“Deià”（带重音符号）是西班牙马略卡岛上的一个地名/小镇，在英文中常作为专有名词出现。"]}
{"word":"deian","summary":{"en":"“deian” isn’t a standard English word; it is most likely a misspelling of “deign,” meaning to condescend or to do something you consider beneath you.","zh":"“deian”不是标准英文词，最可能是“deign”的拼写错误，意思是“屈尊去做（认为低人一等的事）/不屑却勉强做”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(Likely a misspelling) to do something that you think is beneath you; to lower yourself enough to do it; to condescend.","zh":"（可能是拼写错误）屈尊去做某事；纡尊降贵；（带有傲慢意味的）勉强做。"},"examples":[{"en":"She didn’t deign to reply to my message.","zh":"她连回我信息都不屑。"},{"en":"He never deigns to explain his decisions to the team.","zh":"他从不屑于向团队解释自己的决定。"},{"en":"Would you deign to join us for dinner? (often ironic)","zh":"你能屈尊和我们一起吃晚饭吗？（常带讽刺）"}]}],"synonyms":["condescend","stoop","lower oneself"],"phonetic":"/deɪn/","extraExplanation":["“deian” 不是常见英文单词。最可能是把 **deign** 拼错了（常见混淆：deign /deɪn/，拼写里有 g，却不发音）。","**deign** 常用于较正式或带讽刺/不满的语境，暗含“对方自视甚高”的评价。","如果你原本想查的是专有名词 **Deian**（人名/姓氏/地名等），告诉我上下文句子，我可以按专名用法帮你解释。"]}
{"word":"Deianeira","summary":{"en":"Deianeira is a figure from Greek mythology: the wife of Heracles, known for a tragic mistake that contributes to his death.","zh":"Deianeira（得伊阿妮拉）是希腊神话人物：赫拉克勒斯之妻，以一次悲剧性的误判而闻名，最终间接导致赫拉克勒斯之死。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) The wife of Heracles (Hercules), whose actions—meant to keep his love—accidentally led to his death.","zh":"（希腊神话）得伊阿妮拉：赫拉克勒斯（Hercules/海格力斯）的妻子；她原本想挽回丈夫的爱，却因误用“爱情药”而间接导致他死亡。"},"examples":[{"en":"In Greek myth, Deianeira gives Heracles a robe soaked in Nessus’s blood, believing it will bring him back to her.","zh":"在希腊神话中，得伊阿妮拉把浸过涅索斯之血的衣袍送给赫拉克勒斯，以为能让他回到自己身边。"},{"en":"Sophocles portrays Deianeira as a tragic figure driven by fear and love.","zh":"索福克勒斯笔下的得伊阿妮拉是个悲剧人物，被恐惧与爱推动着行动。"}]}],"synonyms":["Deianira"],"phonetic":"/ˌdiːeɪəˈnaɪrə/","extraExplanation":["“Deianeira”常见于古典文学与戏剧研究，尤其是索福克勒斯的悲剧《特拉基斯的女人们》（Women of Trachis）。她的故事常被用来讨论：出于爱与不安全感的控制欲如何造成无法挽回的伤害。","英文中也常用拉丁化形式“Deianira”。在阅读中看到该名字时，通常是指这位神话人物，而不是普通词汇。"]}
{"word":"Deianira","summary":{"en":"Deianira is a tragic figure in Greek myth: the wife of Heracles whose attempt to keep his love leads to his death.","zh":"德伊阿尼拉是希腊神话中的悲剧人物：赫拉克勒斯之妻，为挽回爱情而误用毒衣，导致其死亡。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, the wife of Heracles (Hercules), whose jealousy and deception lead to Heracles’ death when she gives him a robe poisoned with the blood of the centaur Nessus.","zh":"（希腊神话）德伊阿尼拉：赫拉克勒斯（海格力斯）的妻子。她因嫉妒与误信他人，将沾有半人马涅索斯毒血的衣袍给赫拉克勒斯，最终导致他死亡。"},"examples":[{"en":"Deianira is often remembered as a tragic figure who loved Heracles but made a fatal mistake.","zh":"德伊阿尼拉常被视为悲剧人物：她爱赫拉克勒斯，却犯下致命错误。"},{"en":"In Sophocles’ play, Deianira tries to save her marriage, but her plan destroys her husband.","zh":"在索福克勒斯的戏剧中，德伊阿尼拉想挽救婚姻，却反而毁了丈夫。"}]}],"synonyms":["Hercules’ wife","Heracles’ wife"],"phonetic":"ˌdiːəˈnaɪrə","extraExplanation":["“Deianira”常出现在古希腊文学与戏剧中，最重要的文本之一是索福克勒斯《特拉喀斯女子》（The Women of Trachis），其中她的心理挣扎（爱、恐惧、嫉妒、内疚）被写成典型的“希腊悲剧”人物。","她相信涅索斯临死前所说的“爱情灵药”，但那其实是带有海德拉之毒的致命毒液；因此她的行为常被解读为“出于爱而造成的灾难”，而非单纯的恶意。"]}
{"word":"Deibel","summary":{"en":"Deibel is most commonly used as a surname (family name).","zh":"Deibel 最常见的用法是作为姓氏（家族名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name), most commonly found in German-speaking or German-heritage communities","zh":"姓氏（家族名），多见于德语地区或有德国血统的社群"},"examples":[{"en":"Ms. Deibel will lead the project this year.","zh":"Deibel 女士今年将负责这个项目。"},{"en":"I met someone with the last name Deibel at the conference.","zh":"我在会议上认识了一位姓 Deibel 的人。"}]}],"synonyms":["(no true synonyms; proper name)"],"phonetic":"/ˈdaɪbəl/","extraExplanation":["“Deibel”通常作为专有名词使用（人名/姓氏），因此在一般英语词典里不一定会作为“普通词汇”收录。","读音在英语中常见近似为 /ˈdaɪbəl/（类似“DY-buhl”）。不同家庭或地区可能会有不同读法。","如果你指的是某个具体的人、公司或地名（例如某机构名称里含 Deibel），告诉我上下文，我可以帮你确认更准确的含义与用法。"]}
{"word":"deicate","summary":{"en":"Dedicate means to devote something to a purpose or person, or to officially set something apart for special use.","zh":"Dedicate 指把某物奉献/用于某个目的或某人，也可指正式将某物定为专用（常伴随仪式）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to give (time, effort, money, or a thing) to a particular purpose or person; to devote","zh":"把（时间、精力、金钱或某物）用于某个目的或献给某人；致力于"},"examples":[{"en":"She dedicates a few hours each week to volunteer work.","zh":"她每周都会拿出几个小时做志愿者工作。"},{"en":"This book is dedicated to my parents.","zh":"这本书献给我的父母。"}]},{"partOfSpeech":"vt.","definition":{"en":"to officially set something apart for a special use, often with a ceremony","zh":"（常指通过仪式）正式将某物定为专用；举行落成/奉献仪式"},"examples":[{"en":"The city dedicated the new bridge last Saturday.","zh":"这座城市上周六为新桥举行了落成仪式。"},{"en":"They dedicated the memorial to those who lost their lives.","zh":"他们将纪念碑献给那些逝去的人。"}]},{"partOfSpeech":"vt.","definition":{"en":"to commit yourself strongly to an activity, goal, or belief","zh":"全身心投入；坚定地把自己奉献给某项事业/目标/信念"},"examples":[{"en":"He dedicated himself to learning English.","zh":"他全身心投入学习英语。"},{"en":"She is dedicated to helping children read.","zh":"她致力于帮助孩子们阅读。"}]}],"synonyms":["devote","commit","give","consecrate","allocate"],"phonetic":"/ˈdɛdɪˌkeɪt/","extraExplanation":["你输入的“deicate”很可能是拼写错误，正确拼写通常是 **dedicate**。常见搭配：**dedicate A to B**（把A献给B/用于B）、**dedicate yourself to**（致力于）。","词源提示：**dedicate** 来自拉丁语，核心含义是“宣布/奉献给（某种用途或某人）”。在英文书的扉页常见“Dedicated to … / To …”表示“献给……”。"]}
{"word":"deice","summary":{"en":"Deice means to remove ice from something, or to treat it so ice won’t form—often used for cars and airplanes.","zh":"deice 表示“除冰”，也可指“处理以防结冰”，常用于汽车和飞机等场景。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove ice from something (especially a vehicle, road, or aircraft); to make something free of ice","zh":"给……除冰；清除（车辆、道路、飞机等）上的冰"},"examples":[{"en":"I need to deice my car windows before I drive.","zh":"我开车前需要把车窗上的冰除掉。"},{"en":"The airport deiced the plane before takeoff.","zh":"飞机起飞前，机场对飞机进行了除冰处理。"}]},{"partOfSpeech":"vt.","definition":{"en":"to treat something with chemicals or heat to prevent ice from forming (common in aviation)","zh":"用化学剂或加热处理以防结冰（航空领域常用）"},"examples":[{"en":"The crew deiced the wings to prevent ice buildup during departure.","zh":"机组对机翼做了除冰/防冰处理，防止起飞时积冰。"}]}],"synonyms":["defrost","de-ice","clear (of ice)"],"phonetic":"/diːˈaɪs/","extraExplanation":["“de-”是英语里常见的前缀，表示“去除、解除”（如 declassify 解密、defrost 除霜）。deice = de-（去除）+ ice（冰）。","在航空语境中，deice 常指起飞前喷洒除冰液或使用加热手段清除冰雪；相关词 anti-ice 更强调“防止结冰”。"]}
{"word":"deiced","summary":{"en":"“Deiced” means ice was removed from something, or describes something that is now free of ice.","zh":"“deiced”表示“已经除冰”，既可作动词过去式/过去分词，也可作形容词表示“无冰的”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of “deice”; to remove ice from something (such as a plane, road, or windshield).","zh":"“deice”的过去式/过去分词；给某物（如飞机、道路或挡风玻璃）除冰。"},"examples":[{"en":"The crew deiced the airplane before takeoff.","zh":"机组人员在起飞前给飞机除冰。"},{"en":"Our car was deiced and ready to drive.","zh":"我们的车已经除冰，可以开走了。"}]},{"partOfSpeech":"adj.","definition":{"en":"having had ice removed; free of ice.","zh":"已经除过冰的；无冰的。"},"examples":[{"en":"Make sure the steps are deiced so nobody slips.","zh":"确保台阶已经除冰，免得有人滑倒。"},{"en":"The deiced windshield gave us a clear view.","zh":"除冰后的挡风玻璃让我们视野清晰。"}]}],"synonyms":["defrosted","cleared of ice"],"phonetic":"/diˈaɪst/","extraExplanation":["“deice”常见于冬季交通与航空领域：飞机起飞前除冰非常关键，因为机翼上的薄冰也会影响升力与安全。","拼写提示：前缀“de-”有“去除、解除”的意思（如: defrost 去霜，deodorize 去味），所以“deice”就是“去冰”。"]}
{"word":"deicer","summary":{"en":"A deicer is a substance or device used to remove ice or stop ice from forming, especially on roads and aircraft.","zh":"deicer 指用于融化或防止结冰的除冰剂，或用于清除结冰的除冰装置/系统，常见于道路和飞机。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical or substance used to remove ice or prevent ice from forming, especially on roads, sidewalks, or aircraft","zh":"除冰剂；融冰剂（用于融化或防止结冰，常见于道路、人行道或飞机）"},"examples":[{"en":"The city spread deicer on the roads after the snowstorm.","zh":"暴风雪过后，市政部门在道路上撒了除冰剂。"},{"en":"Airports use deicer to keep airplane wings free of ice.","zh":"机场使用除冰剂来防止飞机机翼结冰。"}]},{"partOfSpeech":"n.","definition":{"en":"a device or system that removes ice from a surface (for example, on a car or aircraft)","zh":"除冰装置；除冰系统（用于把冰从表面清除的设备或系统）"},"examples":[{"en":"The plane’s deicer helps prevent ice buildup during flight.","zh":"飞机的除冰系统有助于防止飞行中结冰堆积。"},{"en":"Check the windshield deicer before driving in winter.","zh":"冬天开车前检查一下挡风玻璃除冰装置。"}]}],"synonyms":["de-icer","ice melt","deicing agent","deicing fluid"],"phonetic":"/ˈdiːˌaɪsɚ/","extraExplanation":["在北美日常语境里，deicer 常指“融冰盐/化学除冰剂”（如氯化钠、氯化钙等），也可以指飞机除冰用的含乙二醇类除冰液。用于机场时，常见搭配是 deicing fluid（除冰液）和 deicing truck（除冰车）。","注意区分：deicer（物质/装置） vs. de-icer（同义但更少见的拼写）；deicing（名词/形容词，表示“除冰的”或“除冰过程”）。"]}
{"word":"deicers","summary":{"en":"“Deicers” means chemicals used to melt ice, or devices/systems used to remove ice (especially on aircraft).","zh":"“deicers”可指用于融冰的除冰剂，也可指除冰装置/系统（尤其是飞机上的）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical or material (often salt-based) used to melt ice and prevent roads, sidewalks, or surfaces from becoming icy","zh":"除冰剂；融冰剂（常为含盐化学品，用于融化冰雪、减少路面/人行道结冰）"},"examples":[{"en":"The city spread deicers on the roads before the snowstorm.","zh":"暴风雪来临前，市政在道路上撒了除冰剂。"},{"en":"Some deicers can harm plants if used too heavily.","zh":"有些除冰剂用得太多会伤害植物。"}]},{"partOfSpeech":"n.","definition":{"en":"a device or system that removes ice from something, especially aircraft wings (often called a “de-icer”)","zh":"除冰装置（尤指飞机机翼的除冰系统；也常写作 de-icer）"},"examples":[{"en":"The plane’s deicers turned on to clear ice from the wings.","zh":"飞机启动除冰装置来清除机翼上的结冰。"},{"en":"Technicians inspected the deicers before takeoff.","zh":"技术人员在起飞前检查了除冰系统。"}]}],"synonyms":["de-icers","ice melt","deicing chemicals","deicing agents"],"phonetic":"/ˈdiːˌaɪsɚz/","extraExplanation":["“deicers”通常是复数：可以指多种除冰化学品（deicing chemicals），也可以指多套除冰设备。作化学品时常见成分包括氯化钠（普通盐）、氯化钙、醋酸盐等；在机场语境里，常与“deicing fluid（除冰液）/anti-icing（防结冰）”一起出现。","拼写上：化学品更常写作 deicer/deicers；设备也常写作 de-icer/de-icers（带连字符更强调“装置/系统”）。"]}
{"word":"deices","summary":{"en":"“Deice” means to remove ice from something or to prevent ice from forming; “deices” is the he/she/it form.","zh":"deice 指“除冰”或“防止结冰”；deices 是其第三人称单数形式（他/她/它除冰）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove ice from something (especially an airplane, road, or freezer surface), often using heat or chemicals","zh":"给某物除冰（尤指飞机、道路或冷冻设备表面），常用加热或化学融冰剂"},"examples":[{"en":"Before takeoff, the crew deiced the plane to make it safe to fly.","zh":"起飞前，机组人员给飞机除冰，确保飞行安全。"},{"en":"Workers deice bridges early in the morning during winter storms.","zh":"冬季暴风雪时，工人清晨会给桥面除冰。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something less likely to form ice (to prevent icing)","zh":"防止结冰；降低结冰的可能性"},"examples":[{"en":"Some fluids are used to deice and protect the wings for a short time.","zh":"有些液体既能除冰，也能在短时间内保护机翼不再结冰。"}]}],"synonyms":["defrost","de-ice","remove ice from"],"phonetic":"/diːˈaɪs/","extraExplanation":["“deices”通常是动词“deice”的第三人称单数形式：He/She deices the plane. 过去式和过去分词是“deiced”。","很多学习者会把“deices”误看成“devices”（设备的复数）。如果你想查的是“devices”，告诉我上下文我可以给你对应词条。"]}
{"word":"deicidal","summary":{"en":"Deicidal means “god-killing” (literal or mythic) or, figuratively, fiercely hostile to religion or God.","zh":"deicidal 指“弑神的”（字面/神话文学），也可比喻为对宗教或神的观念极端敌视的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to killing a god; aimed at destroying or defeating a deity (literally or in mythology/literature).","zh":"（字面或神话/文学中）与杀死神明有关的；意在消灭或击败神祇的。"},"examples":[{"en":"In the novel, the hero carries a deicidal weapon said to wound even immortals.","zh":"在小说里，主角携带一件“弑神”的武器，据说连不朽者也能受伤。"},{"en":"The cult was rumored to plan a deicidal ritual against the sky god.","zh":"传言该教派计划举行一场针对天神的弑神仪式。"}]},{"partOfSpeech":"adj.","definition":{"en":"Figuratively, showing extreme hostility toward religion or the idea of God; aggressively anti-religious.","zh":"（比喻）对宗教或“上帝/神”的观念极端敌视的；激烈反宗教的。"},"examples":[{"en":"Some critics called the essay deicidal because it attacked every form of faith.","zh":"一些评论家称那篇文章“弑神般的”，因为它抨击了所有形式的信仰。"},{"en":"The film’s deicidal tone sparked protests from religious groups.","zh":"这部电影带有强烈反神/反宗教的基调，引发了宗教团体的抗议。"}]}],"synonyms":["god-killing","anti-religious","blasphemous","iconoclastic"],"phonetic":"/diˈsaɪdəl/","extraExplanation":["这个词比较少见、偏文学或评论用语，常出现在神话题材、奇幻作品或宗教批评的语境中。","词源可拆解为 dei-（源自拉丁语 deus“神”）+ -cidal（“杀……的”，见于 homicidal“杀人的”、suicidal“自杀的”）。使用时要注意语气很强，尤其在现实宗教语境里可能冒犯他人。"]}
{"word":"deicide","summary":{"en":"Deicide means the killing of a god; it can also be used figuratively for destroying something treated as sacred or supreme.","zh":"Deicide 意为“弑神”；也可比喻摧毁被视为神圣或至高权威的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the killing of a god or a divine being (in myth, literature, or belief).","zh":"弑神；杀害神祇（多见于神话、文学或宗教语境）。"},"examples":[{"en":"In Greek myths, stories of deicide often reflect struggles for power among gods and Titans.","zh":"在希腊神话中，弑神的故事常常反映诸神与泰坦之间的权力斗争。"},{"en":"The novel uses deicide as a symbol of rejecting an old order.","zh":"这部小说把“弑神”用作拒绝旧秩序的象征。"}]},{"partOfSpeech":"n.","definition":{"en":"(often figurative, and sometimes controversial) the act of killing or destroying what is treated as sacred, godlike, or ultimate in authority.","zh":"（常为比喻用法，有时带争议）摧毁被视为神圣、至高权威或“如神般”的事物。"},"examples":[{"en":"Some critics called the film’s satire a kind of cultural deicide.","zh":"一些评论家把这部电影的讽刺称为一种“文化上的弑神”。"},{"en":"He spoke of deicide to describe the collapse of unquestioned trust in institutions.","zh":"他用“弑神”来形容人们对机构不再盲目信任的崩塌。"}]}],"synonyms":["god-killing","slaying a god","sacrilege (figurative, not exact)","iconoclasm (figurative, related)"],"phonetic":"/ˈdiːɪsaɪd/","extraExplanation":["“deicide”来自拉丁语：dei-（神）+ -cide（杀害，如 homicide 杀人、suicide 自杀）。这是一个语气很强、带宗教与伦理重量的词，日常英语中不常用。","在基督教语境里，“deicide”有时被用来指责某些群体“杀害上帝”（与耶稣受难相关的争议性说法）。由于历史上曾被用于煽动仇恨或歧视，使用时要非常谨慎，并注意语境与受众。"]}
{"word":"deicides","summary":{"en":"“Deicides” is the plural of “deicide,” meaning either people who kill a god or the act of killing a god (often in myth; sometimes sensitive in religious-historical contexts).","zh":"deicides 是 deicide 的复数，表示“弑神者”（杀神的人）或“弑神行为”（杀神这件事）；常见于神话，也可能在宗教历史语境中较敏感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who kill a god; plural of “deicide” (a god-killer).","zh":"弑神者；复数，指“杀死神明的人”。"},"examples":[{"en":"In the myth, the deicides are punished for killing an immortal being.","zh":"在这个神话里，弑神者因为杀死不朽者而受到惩罚。"},{"en":"The novel portrays deicides as tragic figures rather than heroes.","zh":"这部小说把弑神者刻画成悲剧人物，而不是英雄。"}]},{"partOfSpeech":"n.","definition":{"en":"acts of killing a god; plural of “deicide” (the killing of a god).","zh":"弑神行为；复数，指“杀死神明的行为”。"},"examples":[{"en":"Ancient stories sometimes describe deicides as the start of a new age.","zh":"古代故事有时把弑神描写成新时代的开端。"},{"en":"The poem uses deicides as a symbol of rebellion against fate.","zh":"这首诗用“弑神”象征对命运的反叛。"}]}],"synonyms":["god-killers","slayers of a god","deicide (singular)"],"phonetic":"/ˈdiːəsaɪd/","extraExplanation":["“deicide(s)”在宗教与历史语境中很敏感：它曾被用来指控某些群体为“杀神者/弑神者”（尤其与耶稣之死相关的所谓“deicide charge”），这一用法与反犹主义历史有关。现代写作中若涉及该词，常需要明确语境、避免以群体概括责任。","词源：来自拉丁语 deus（神）+ -cide（杀害，如 homicide 杀人、regicide 弑君）。"]}
{"word":"deicing","summary":{"en":"Deicing means removing ice or preventing ice buildup, especially on aircraft, roads, or vehicles.","zh":"Deicing 指除冰或防止结冰，常用于飞机、道路或车辆等场景。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of removing ice or preventing ice from forming, especially on vehicles or aircraft","zh":"除冰；防冰（尤指车辆或飞机上去除积冰或防止结冰的过程）"},"examples":[{"en":"The crew began deicing the plane before takeoff.","zh":"机组人员在起飞前开始给飞机除冰。"},{"en":"Road deicing reduces accidents during winter storms.","zh":"道路除冰能在冬季暴风雪期间减少事故。"}]},{"partOfSpeech":"v.","definition":{"en":"to remove ice from something or prevent ice from forming by using chemicals, heat, or tools","zh":"（用化学剂、加热或工具）给……除冰；给……防冰"},"examples":[{"en":"They deiced the windshield with a spray.","zh":"他们用喷雾给挡风玻璃除冰。"},{"en":"Airports deice runways to keep them safe.","zh":"机场会给跑道除冰以确保安全。"}]},{"partOfSpeech":"adj.","definition":{"en":"used to describe a substance, system, or operation that removes ice or prevents icing","zh":"除冰的；防冰的（指物质、系统或作业）"},"examples":[{"en":"Use a deicing fluid designed for low temperatures.","zh":"使用适用于低温的除冰液。"},{"en":"The truck carries deicing salt for the highway.","zh":"这辆卡车运载用于高速公路的融雪盐（除冰盐）。"}]}],"synonyms":["ice removal","defrosting","de-icing","thawing"],"phonetic":"ˈdiˌaɪsɪŋ","extraExplanation":["“Deicing”常见于航空与冬季交通语境。航空领域中，deicing（除冰）是把已经结的冰去掉；与之相关的“anti-icing”（防冰）更强调预防结冰（例如在起飞前喷洒防冰液以延缓结冰）。","道路除冰常用融雪盐（salt）、盐水（brine）或其他除冰剂。它们能降低水的冰点，但也可能对车辆、桥梁和环境造成腐蚀或影响，因此很多城市会控制用量或改用更环保的配方。"]}
{"word":"Deicoon","summary":{"en":"“Deicoon” isn’t a common English word; it’s likely a misspelling (often of “deacon”) or a proper name.","zh":"“Deicoon”不是常见英语词；可能是拼写错误（常见为“deacon”）或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a misspelling of “deacon” (a church officer) or a brand/name.","zh":"不是标准英语单词；很可能是把“deacon（教会执事/教会职员）”拼错了，或是某个品牌/名字。"},"examples":[{"en":"I couldn’t find “Deicoon” in an English dictionary—did you mean “deacon”?","zh":"我在英语词典里查不到“Deicoon”——你是不是想写“deacon”？"},{"en":"If “Deicoon” is a company or app name, please share the sentence where you saw it.","zh":"如果“Deicoon”是公司名或应用名，请把你看到它的句子发我。"}]}],"phonetic":"ˈdiːkən","extraExplanation":["“deacon”在基督教语境里较常见，指在教会中协助牧师/神父处理事务、照顾会众的人（不同教派职责略有差异）。如果你想查的是这个词，我也可以给你“deacon”的详细词条（发音、用法、例句、相关词）。"]}
{"word":"deictic","summary":{"en":"Deictic means context-dependent in meaning (especially in linguistics), like “this,” “here,” or “now.”","zh":"Deictic 指“（在语言学中）意义依赖语境的指示性表达”，如 this、here、now。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"In linguistics, describing words or expressions whose meaning depends on the speaker’s context (who is speaking, where, when), such as “this,” “that,” “here,” “now,” or “I.”","zh":"（语言学）指示性的；指那些意义必须依赖说话当下语境（说话者是谁、地点、时间等）才能确定的词或表达，如 this/that、here、now、I。"},"examples":[{"en":"In the sentence “Put it there,” the word “there” is deictic because it depends on the speaker’s location or pointing.","zh":"在句子“Put it there”中，there 是指示词，因为它取决于说话者所在位置或指向。"},{"en":"Words like “today” and “tomorrow” are deictic: their meaning changes depending on the date of speaking.","zh":"像 today 和 tomorrow 这样的词是指示性的：它们的意义会随说话当天的日期而变化。"}]}],"synonyms":["context-dependent","indexical","demonstrative"],"phonetic":"/ˈdaɪktɪk/","extraExplanation":["“Deictic” 来自希腊语词根，和“指向/展示”有关。在语言学里常见的三类：人称指示（I/you）、时间指示（now/then/today）、空间指示（here/there/this/that）。","文学或叙事中，deictic 表达会把读者“定位”到叙述者的视角：比如第一人称叙事里反复出现的 here/now/this 会增强“临场感”，但也可能让不清楚语境的读者感到模糊。"]}
{"word":"deictical","summary":{"en":"“Deictical” means “context-dependent in meaning,” especially in linguistics (often said as “deictic”).","zh":"“deictical”表示“意义依赖语境的（指示性的）”，属于语言学用语（更常用 deictic）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to deixis (words or expressions whose meaning depends on the speaker’s context, such as who is speaking, where, or when).","zh":"与“指示”（deixis）有关的；指那些意义依赖说话情境（谁在说、在哪里、何时等）的词语或表达。"},"examples":[{"en":"Words like “this,” “that,” and “here” have a deictical meaning because you need context to know what they refer to.","zh":"像“this / that / here”这样的词带有指示性意义，因为你需要语境才能知道它们指什么。"},{"en":"In the sentence “I’ll meet you there tomorrow,” “I,” “you,” “there,” and “tomorrow” are all deictical expressions.","zh":"在句子“I’ll meet you there tomorrow”里，“I / you / there / tomorrow”全都是指示性表达。"}]}],"synonyms":["deictic","indexical","context-dependent"],"phonetic":"/ˈdaɪk.tɪ.kəl/","extraExplanation":["“deictical”在语言学里使用，但更常见的形容词是“deictic”（指示性的）。名词是“deixis”（指示/指示现象）。","指示语常见类型：人称指示（I/you）、时间指示（now/tomorrow）、空间指示（here/there）、语篇指示（this/that 指前文或后文）、社会指示（sir/ma’am 等体现社会关系）。"]}
{"word":"deictically","summary":{"en":"Deictically means “in a context-dependent, pointing way,” where meaning changes depending on who speaks, when, and where.","zh":"deictically 意为“以指示性的、依赖语境的方式”，其意义会随说话者、时间和地点而改变。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that depends on the speaker’s context (such as who is speaking, where, and when), so the meaning changes with the situation.","zh":"以指示方式；（意义）依赖说话情境（如说话者是谁、地点、时间）而变化。"},"examples":[{"en":"Words like “this,” “here,” and “now” work deictically because their meaning depends on the situation.","zh":"“this / 这个”“here / 这里”“now / 现在”等词具有指示性，因为它们的意义取决于具体情境。"},{"en":"In the sentence “I’ll meet you there,” “there” is used deictically and needs context to be understood.","zh":"在句子“I’ll meet you there”中，“there / 那里”是指示性用法，需要语境才能明白。"}]}],"synonyms":["contextually","indexically","demonstratively"],"phonetic":"/daɪˈɪktɪkli/","extraExplanation":["“deictically”来自语言学术语“deixis（指示）”。它常用来分析：人称指示（I/you）、时间指示（now/then）、地点指示（here/there）、语篇指示（this/that 指代前后文）、社会指示（sir/ma’am 等体现社会关系的称呼）。","与“contextually（在语境上）”相比，“deictically”更强调：某些词本身就需要说话当下的“指向点”（通常是说话者）才能确定所指。"]}
{"word":"Deidamia","summary":{"en":"Deidamia is a princess in Greek mythology connected to Achilles; she is also a rare modern female name based on that figure.","zh":"Deidamia（狄达弥亚）是希腊神话中与阿喀琉斯相关的公主；也可作源自该人物的少见女性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) A princess of the island of Skyros, daughter of King Lycomedes. She became the lover (and later wife, in some versions) of Achilles when he was hidden on Skyros disguised as a girl; she is the mother of his son, Neoptolemus (Pyrrhus).","zh":"（希腊神话）斯基罗斯岛的公主，吕科墨得斯王之女。阿喀琉斯曾为躲避参战而在斯基罗斯乔装成少女时与她相恋（部分版本称后来成婚）；她是阿喀琉斯之子涅俄普托勒摩斯（又名皮洛斯）的母亲。"},"examples":[{"en":"In one myth, Achilles lives on Skyros in disguise and falls in love with Deidamia.","zh":"在一个神话版本中，阿喀琉斯在斯基罗斯岛乔装生活，并爱上了狄达弥亚。"},{"en":"Deidamia is often mentioned alongside Achilles and their son Neoptolemus.","zh":"狄达弥亚常与阿喀琉斯以及他们的儿子涅俄普托勒摩斯一同被提及。"}]},{"partOfSpeech":"n.","definition":{"en":"A female given name, used rarely today, taken from the mythological figure Deidamia.","zh":"女性名字（较少见），源自神话人物“狄达弥亚”。"},"examples":[{"en":"Her parents chose the name Deidamia because they loved Greek mythology.","zh":"她的父母因为喜欢希腊神话而取名为狄达弥亚。"}]}],"synonyms":["Deidameia"],"phonetic":"/ˌdiːdaɪˈæmiə/","extraExplanation":["“Deidamia”来自希腊语写法（常见转写：Deidameia）。她的故事常用于表达“命运无法被完全躲开”：阿喀琉斯试图避开特洛伊战争而藏身，但最终仍被发现并走向命运。","在西方艺术与文学中，她会出现在与“阿喀琉斯女装藏身（Achilles on Skyros）”相关的绘画、戏剧与歌剧里；例如亨德尔（Handel）的歌剧《Deidamia》（1741）就以她为题。"]}
{"word":"deidealize","summary":{"en":"Deidealize means to stop idealizing someone or something and see them more realistically.","zh":"deidealize 指不再理想化某人或某事，而是以更现实、客观的方式看待。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to stop seeing someone or something as perfect; to remove an unrealistically ideal image","zh":"不再把某人或某事看得完美；去除不切实际的理想化形象"},"examples":[{"en":"Living together helped them deidealize each other and build a more realistic relationship.","zh":"同居让他们不再彼此理想化，并建立起更现实的关系。"},{"en":"The biography deidealizes the hero by showing his mistakes as well as his achievements.","zh":"这本传记通过呈现这位英雄的错误和成就，让人不再把他理想化。"}]}],"synonyms":["see realistically","disillusion (often stronger)","demythologize"],"phonetic":"/diːaɪˈdiːəlaɪz/","extraExplanation":["“de-”表示“去除、反向”，加在“idealize（理想化）”前面就形成“deidealize（去理想化）”。在心理学、关系咨询、社会评论等语境中常见，用来强调从幻想/滤镜回到更客观的看法。","拼写上有时也见到变体“de-idealize”（加连字符），意思相同。"]}
{"word":"Deidesheimer","summary":{"en":"Deidesheimer means “from Deidesheim” (a person or something related to the German town, often used in wine contexts).","zh":"Deidesheimer表示“来自代德斯海姆（Deidesheim）的”（可指当地人，也可指与该德国小镇相关的事物，常见于葡萄酒语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from Deidesheim, a town in the Palatinate (Pfalz) region of Germany","zh":"来自德国普法尔茨（Pfalz）地区代德斯海姆（Deidesheim）镇的人；代德斯海姆人"},"examples":[{"en":"She is a Deidesheimer who grew up among vineyards.","zh":"她是代德斯海姆人，在葡萄园间长大。"},{"en":"The festival attracts Deidesheimers and visitors from nearby towns.","zh":"这个节日吸引了代德斯海姆人以及周边城镇的游客。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Deidesheim or its people, culture, or products (especially wine)","zh":"与代德斯海姆（Deidesheim）及其居民、文化或产品（尤其是葡萄酒）有关的；代德斯海姆的"},"examples":[{"en":"We tasted a Deidesheimer Riesling at dinner.","zh":"晚餐时我们品尝了一款代德斯海姆的雷司令（Riesling）。"},{"en":"The restaurant serves Deidesheimer specialties in autumn.","zh":"这家餐厅在秋季供应代德斯海姆的特色菜。"}]}],"synonyms":["from Deidesheim","Deidesheim (attributive use)"],"phonetic":"/ˈdaɪdəsˌhaɪmɚ/","extraExplanation":["“Deidesheimer”是德语地名“Deidesheim”的派生词，常用作“某地人/某地的”（demonym/形容词）。英语里多见于旅游、葡萄酒与产区介绍中。","Deidesheim位于德国莱茵兰-普法尔茨州（Rhineland-Palatinate）的葡萄酒产区，和Riesling等白葡萄酒联系较多；因此在酒标或酒单上看到“Deidesheimer”通常表示“来自Deidesheim的”。","发音提示：英语使用者往往按拼写读成“DIE-dəs-hy-mer”一类的节奏；德语原始发音会与英语习惯不同。"]}
{"word":"deidesheimer","summary":{"en":"Deidesheimer means “from Deidesheim” or “a person from Deidesheim,” and it can also be a surname.","zh":"Deidesheimer 意为“来自/关于 Deidesheim（地名）”或“Deidesheim 人”，也可作姓氏。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"from Deidesheim (a town in Rhineland-Palatinate, Germany); relating to Deidesheim.","zh":"来自德国莱茵兰-普法尔茨州小城 Deidesheim 的；与 Deidesheim 有关的。"},"examples":[{"en":"A Deidesheimer wine often comes from vineyards around the town of Deidesheim.","zh":"Deidesheimer 葡萄酒通常来自 Deidesheim 小镇周边的葡萄园。"},{"en":"They visited a Deidesheimer winery during their trip along the German Wine Route.","zh":"他们在德国葡萄酒之路旅行时参观了一家 Deidesheimer 酒庄。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who comes from Deidesheim; someone connected with Deidesheim.","zh":"Deidesheim 人；来自或与 Deidesheim 有关联的人。"},"examples":[{"en":"She is a Deidesheimer who moved to Berlin for work.","zh":"她是 Deidesheim 人，为了工作搬到了柏林。"}]},{"partOfSpeech":"n.","definition":{"en":"a German surname (family name).","zh":"德国姓氏（家族姓）。"},"examples":[{"en":"Deidesheimer is listed as the author’s last name in the catalog.","zh":"目录里把 Deidesheimer 列为作者的姓。"}]}],"synonyms":["from Deidesheim","Deidesheim resident"],"phonetic":"/ˈdaɪdəsˌhaɪmər/","extraExplanation":["“Deidesheimer”是德语里的地名形容词/居民称呼，来自地名“Deidesheim”加上常见后缀“-er”，类似英语里“New Yorker（纽约人/纽约的）”。","在葡萄酒语境中，你可能会看到“Deidesheimer + 葡萄园/酒款名”，表示产自 Deidesheim 附近的葡萄园（该地区属于德国重要的葡萄酒产区之一）。"]}
{"word":"Deidre","summary":{"en":"Deidre is a female first name, a variant spelling of Deirdre.","zh":"Deidre 是女性名字，是 Deirdre 的一种拼写变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A female given name (a spelling variant of “Deirdre”), used mainly in English-speaking countries.","zh":"女性名字（“Deirdre”的一种拼写变体），主要用于英语国家。"},"examples":[{"en":"Deidre is starting a new job next Monday.","zh":"Deidre 下周一开始新工作。"},{"en":"I met Deidre at a friend’s wedding.","zh":"我在朋友的婚礼上认识了 Deidre。"},{"en":"Deidre, could you send me the file when you have time?","zh":"Deidre，你有空时可以把文件发给我吗？"}]}],"synonyms":["Deirdre","Deidra"],"phonetic":"/ˈdiːdrə/","extraExplanation":["“Deidre”更常见的传统拼写是“Deirdre”，源自爱尔兰/盖尔语名字。在爱尔兰传说中，Deirdre（常被称为“Deirdre of the Sorrows”，意为“忧伤的迪尔德丽”）是著名的悲剧人物，因此这个名字在文化联想上有一点文学与传奇色彩。","英语里人名的拼写常有多种变体（如 Deidre / Deirdre / Deidra）。如果你在正式文件中使用这个名字，通常以本人证件或本人偏好的拼写为准。"]}
{"word":"deien","summary":{"en":"Deign means to do something you consider beneath you, often phrased as “deign to + verb.”","zh":"Deign 指（觉得有失身份而）屈尊去做某事，常用结构是“deign to + 动词”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to do something that you think is beneath your dignity; to condescend (often used with “to” + verb)","zh":"（认为有失身份而）屈尊去做；俯就（常用“deign to + 动词”）"},"examples":[{"en":"She didn’t deign to reply to his rude comment.","zh":"她连回他那句无礼的话都不屑。"},{"en":"The manager finally deigned to speak to us.","zh":"经理终于屈尊跟我们说话了。"},{"en":"He would not deign to apologize.","zh":"他不肯屈尊道歉。"}]},{"partOfSpeech":"vt.","definition":{"en":"to grant or give something in a proud or reluctant way","zh":"（带傲慢或勉强的态度）赐予；赏给"},"examples":[{"en":"She deigned him a brief smile.","zh":"她勉强赏了他一个短暂的微笑。"}]}],"synonyms":["condescend (to)","stoop (to)","lower oneself (to)"],"phonetic":"/deɪn/","extraExplanation":["你输入的“deien”不是常见英文单词，最可能是拼写成了 **deign**。deign 常带有“高高在上/不屑”的语气，语感偏正式，有时也带讽刺。","常见搭配：**deign to do sth**（屈尊做某事）。近义表达：**condescend to**（屈尊去做），但 condescend 还可表示“以居高临下口吻对待别人”。","词源小提示：deign 来自古法语/拉丁语系，和“worth/dignity（尊严、体面）”有关，所以含义里带“觉得自己身份更高”的感觉。"]}
{"word":"deific","summary":{"en":"Deific means “divine; relating to God,” and more rarely “to make into a god.”","zh":"deific 表示“神圣的、与神有关的”，较少见也可作动词表示“使成神/神化”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to God or a god; divine.","zh":"与上帝或神有关的；神圣的；神性的。"},"examples":[{"en":"The poet described her beauty in deific terms.","zh":"诗人用带有神性的词语来描写她的美。"},{"en":"In some stories, kings are treated as having deific power.","zh":"在一些故事里，国王被当作拥有神一般的力量。"}]},{"partOfSpeech":"vt.","definition":{"en":"To make someone or something a god; to treat as divine (rare).","zh":"使……成神；把……奉为神（较少用）。"},"examples":[{"en":"Fans sometimes deific a celebrity and ignore their flaws.","zh":"粉丝有时会把名人“神化”，忽视他们的缺点。"}]}],"synonyms":["divine","godlike","celestial","sacred","deify (v.)"],"phonetic":"/diˈɪfɪk/","extraExplanation":["“deific”常见于文学、宗教或较正式的写作，比“divine”更书面、更少见。日常英语里通常用“divine”或“godlike”。","词源来自拉丁语相关词根，和“deity（神）”“deify（神化）”同源。"]}
{"word":"deifical","summary":{"en":"Deifical is a rare, old-fashioned adjective meaning “divine; godlike.”","zh":"deifical 是一个罕见的古语形容词，意思是“神圣的；像神一样的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/archaic) Divine; having the nature or qualities of a god.","zh":"（罕见/古语）神的；神圣的；具有神性的。"},"examples":[{"en":"In the old poem, the hero is described as having a deifical radiance.","zh":"在那首古老的诗里，英雄被描写为带有神圣的光辉。"},{"en":"Some writers used “deifical” to praise a ruler in an exaggerated, worshipful way.","zh":"有些作者用“deifical”来夸赞统治者，带有夸张甚至崇拜的意味。"}]}],"synonyms":["divine","deific","godlike","heavenly"],"phonetic":"/diˈɪfɪkəl/","extraExplanation":["“deifical”在现代英语中非常少见，更常见的词是“deific”（神的；神性的）或“divine”（神圣的）。","词源上与拉丁语“deus”（神）相关，含义接近“像神一样的/属于神的”。在文学或古风文本里偶尔出现，语气往往偏庄重或夸饰。","如果你是在写作或考试中想表达“神圣的/神性的”，一般选“divine”或“deific”更自然、更常用。"]}
{"word":"deification","summary":{"en":"Deification means making someone into a god, or treating them with godlike, exaggerated admiration.","zh":"Deification 指“神化”：把某人（或某物）变成神，或以近乎崇拜的方式过度赞美。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of making someone or something into a god, or treating them as if they were a god","zh":"神化；使成神；把（人或物）当作神来崇拜"},"examples":[{"en":"In some ancient cultures, the deification of kings helped justify their power.","zh":"在一些古代文化中，国王的神化有助于为他们的权力提供正当性。"},{"en":"The poem warns against the deification of money and fame.","zh":"这首诗警告人们不要把金钱和名声神化。"}]},{"partOfSpeech":"n.","definition":{"en":"(in art, writing, or speech) exaggerated admiration that portrays a person as perfect or beyond criticism","zh":"（艺术、写作或言谈中的）过度颂扬；把某人描绘得完美无缺、不可批评"},"examples":[{"en":"The biography avoids the deification of its subject and includes his mistakes.","zh":"这本传记避免了对主人公的神化，也写到了他的错误。"},{"en":"Her fans’ deification of her made honest feedback difficult.","zh":"粉丝对她的神化让真诚的反馈变得困难。"}]}],"synonyms":["apotheosis","idolization","glorification","deifying"],"phonetic":"/ˌdiː.ə.fəˈkeɪ.ʃən/","extraExplanation":["词源上来自 Latin *deus*（神）+ *-fication*（使成为……的过程），所以字面意思就是“使成为神”。在现代语境里，它既可用于宗教/历史（把统治者或英雄奉为神），也常用于批评性表达（把某人或某物捧得过高）。","常见搭配：*the deification of leaders/celebrities*（对领袖/名人的神化）、*self-deification*（自我神化）。相关词：*deify*（v. 神化）、*deity*（n. 神；神祇）。"]}
{"word":"deifications","summary":{"en":"“Deifications” means acts of turning someone/something into a god, or (figuratively) praising them as perfect.","zh":"“deifications”指把人或事物神化、奉为神；也可比喻把某人过度吹捧成完美。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of making someone or something into a god; treating someone as divine or perfect (plural of “deification”)","zh":"把某人或某物神化、奉为神；（比喻）把某人捧成完美无缺（“deification”的复数）"},"examples":[{"en":"The poem criticizes the deifications of political leaders.","zh":"这首诗批评人们对政治领袖的神化。"},{"en":"In some ancient cultures, deifications of emperors were part of state religion.","zh":"在一些古代文化中，皇帝的神化是国家宗教的一部分。"},{"en":"Her biography avoids the deifications common in celebrity stories.","zh":"她的传记避免了名人故事里常见的“神化”写法。"}]}],"synonyms":["apotheoses","idolizations","glorifications"],"phonetic":"/ˌdiːəfəˈkeɪʃənz/","extraExplanation":["“deification”既可指宗教意义上的“封神/神格化”（把人当作神来崇拜），也常用于批评性的比喻表达，表示“过度崇拜、把人捧上神坛”。","词形提示：deify（vt. 神化）→ deification（n. 神化）→ deifications（复数）。","常见搭配：the deification of + 人/事物；criticize/avoid/resist deification（批评/避免/抵制神化）。"]}
{"word":"deificatory","summary":{"en":"Deificatory describes overly worshipful praise that treats someone as godlike.","zh":"deificatory 指把人“神化”的、近乎崇拜式的过度赞美。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Intended to make someone or something seem like a god; praising in an excessively worshipful way (deifying).","zh":"意在把某人或某物“神化”的；以近乎崇拜的方式过度赞美的（神格化的）。"},"examples":[{"en":"The article took a deificatory tone, treating the singer as flawless.","zh":"这篇文章带着神化的口吻，把那位歌手写得完美无缺。"},{"en":"She disliked the deificatory praise and asked people to focus on the team’s work.","zh":"她不喜欢这种神化式的赞美，要求大家把注意力放在团队的工作上。"}]}],"synonyms":["deifying","idolizing","worshipful","adulatory","hagiographic"],"phonetic":"/ˌdiːɪfəˈkeɪtəri/","extraExplanation":["“deificatory”比较少见，常见近义表达是“deifying”“idolizing”“worshipful”。在写作中它常带有批评意味：暗示赞美过头、把人当成神一样看待。","词根提示：deify（使成神、神化）+ -atory（表示“与……有关/起……作用”）。因此整体含义就是“具有神化作用的/神化式的”。"]}
{"word":"deified","summary":{"en":"Deified means ‘made into a god’ or ‘treated like a god,’ often suggesting excessive admiration.","zh":"deified 意为“被神化/被当作神一样崇拜”，常含“过度崇拜”的意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"treated someone as a god or made someone into a god (in belief, religion, or exaggerated admiration)","zh":"把某人当作神来崇拜；（在信仰或夸张的赞美中）使某人成为神"},"examples":[{"en":"After his death, the hero was deified by later generations.","zh":"这位英雄去世后，被后人神化并加以崇拜。"},{"en":"Some fans have deified the singer, refusing to accept any criticism of her.","zh":"一些粉丝把这位歌手奉若神明，完全不接受对她的任何批评。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense or past participle of “deify”: to treat as a god; to glorify excessively","zh":"“deify”的过去式/过去分词：把……神化；过度颂扬"},"examples":[{"en":"The emperor was deified in official ceremonies.","zh":"皇帝在官方仪式中被神格化。"},{"en":"The book deified its main character, ignoring his flaws.","zh":"这本书把主角写得过于完美，忽略了他的缺点。"}]}],"synonyms":["idolized","glorified","apotheosized","worshiped"],"phonetic":"/ˈdiːəˌfaɪd/","extraExplanation":["“deify”来自拉丁语词根，核心意思是“使……成为神”。在英语里既可用于宗教/历史语境（某人被“神格化”），也常用于批评性表达，指对名人、领袖或某种理念的“盲目崇拜”。","文学与评论写作中常见搭配有：deify a leader / deify youth / deify success（把领袖/青春/成功神化）。相近但语气更中性的词有“idolize（偶像化、崇拜）”；更强烈、更带批评意味的说法也可用“worship（崇拜）”。"]}
{"word":"deifier","summary":{"en":"A deifier is someone who ‘deifies’—treats a person, idea, or thing like a god.","zh":"deifier 指“把……神化的人”，把人、观念或事物当作神一样崇拜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who regards someone or something as a god; someone who worships or treats something with extreme admiration","zh":"把某人或某物当作神来崇拜的人；极度崇拜者"},"examples":[{"en":"Some fans become deifiers of celebrities, treating them as flawless.","zh":"有些粉丝会把名人当成“神”来崇拜，觉得他们毫无缺点。"},{"en":"The writer warns against being a deifier of technology.","zh":"这位作者警告人们不要把科技神化。"}]}],"synonyms":["idolizer","worshipper","admirer"],"phonetic":"/ˈdiːəˌfaɪər/","extraExplanation":["“deifier”来自动词“deify”（把……神化、奉为神）+ 表示“做……的人”的后缀“-er”。常用于批评语境，强调一种不理性的崇拜或把人/事物抬到不应有的高度。","近义表达常见有：“idolizer”（崇拜者）、“worshipper”（崇拜者）。反义语境可用：“critic”（批评者）、“skeptic”（怀疑者）。"]}
{"word":"deifiers","summary":{"en":"“Deifiers” are people who deify someone or something—treating them as godlike.","zh":"“Deifiers”指把某人或某物神化、当作神一样崇拜的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who deify someone or something; those who treat a person, idea, or object as a god (plural of “deifier”)","zh":"把某人或某物神化的人；把人、思想或事物当作神来崇拜的人（“deifier”的复数）"},"examples":[{"en":"Some deifiers of celebrity culture act as if famous people can do no wrong.","zh":"一些名人文化的“神化者”表现得好像明星永远不会犯错。"},{"en":"The book criticizes the deifiers of violence in popular entertainment.","zh":"这本书批评把暴力在流行娱乐中神化的人。"}]}],"synonyms":["idolaters","worshippers","admirers (often too strong)","devotees"],"phonetic":"/ˈdiːəˌfaɪər/","extraExplanation":["“deifier”来自动词 deify（使神化、奉为神明）。在现代英语里，它常带有批评意味，强调“过度崇拜/盲目崇拜”，不仅用于宗教语境，也常用于政治人物、名人、金钱、科技等被过分抬高的现象。"]}
{"word":"deifies","summary":{"en":"“Deifies” means “treats as a god” or “over-admires.”","zh":"“deifies”表示“把……当作神来崇拜/神化；过度崇拜”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Third-person singular of “deify”) to treat someone or something as a god; to worship or admire them too much.","zh":"（“deify”的第三人称单数）把某人或某物当作神来崇拜；过度崇拜、神化。"},"examples":[{"en":"Some fans deify celebrities and forget they are just ordinary people.","zh":"有些粉丝会把名人神化，忘了他们也只是普通人。"},{"en":"The legend says the people deifies the hero after his death.","zh":"传说里说，人们在英雄死后把他奉为神。"}]}],"synonyms":["worship","idolize","revere","exalt","adore"],"phonetic":"ˈdiːəˌfaɪ","extraExplanation":["“deify”来自拉丁语 deus（神）+ -fy（使成为），字面意思是“使……成神”。在现代英语里常带有批评或警惕的语气，表示“过度崇拜/盲目崇拜”。","形式：deify（原形）→ deifies（第三人称单数）→ deified（过去式/过去分词）→ deifying（现在分词）。拼写上：以 -fy 结尾的动词变第三人称时通常变为 -fies（如 satisfy → satisfies）。"]}
{"word":"deiform","summary":{"en":"Deiform means “godlike” or “having the form/nature of a god,” used mainly in literary or religious writing.","zh":"Deiform 表示“神一般的、具有神之形态/性质的”，多见于文学或宗教语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the form or nature of a god; godlike; resembling a deity.","zh":"具有神的形态或性质的；神一般的；像神祇的。"},"examples":[{"en":"In the poem, the hero is described with deiform beauty, as if blessed by the gods.","zh":"在诗中，英雄被描写成拥有神一般的美貌，仿佛受诸神祝福。"},{"en":"The painter gave the queen a deiform presence to show her power and authority.","zh":"画家赋予女王一种神祇般的气场，以表现她的力量与权威。"}]}],"synonyms":["godlike","divine","deific","celestial"],"phonetic":"/ˈdiːɪˌfɔrm/","extraExplanation":["“deiform”较为罕见、偏文学或宗教语境，多用于赞美或夸张描写（如“deiform beauty / deiform presence”）。在日常英语里，更常见的替代词是“divine”“godlike”。","词源：de-（源自拉丁语，表示“神”）+ -form（形状、形态），字面意思就是“神的形态”。"]}
{"word":"deiformity","summary":{"en":"Deiformity means a godlike quality or resemblance to a god, used mainly in religious or literary contexts.","zh":"Deiformity 指“神性/似神的特质”，多见于宗教或文学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being like a god; godlike nature or form (rare, often in religious or literary writing)","zh":"神性；似神的特质或形态（较少见，常用于宗教或文学语境）"},"examples":[{"en":"The poet praised the hero’s deiformity, describing him as more than human.","zh":"诗人称颂英雄的“神性”，形容他超越凡人。"},{"en":"In some mystical texts, deiformity is linked to moral purity rather than physical beauty.","zh":"在一些神秘主义文本中，“似神”更多与道德纯洁相关，而非外表之美。"}]}],"synonyms":["godlikeness","divinity","divine nature","deity-like quality"],"phonetic":"/ˌdiː.əˈfɔːr.mə.ti/","extraExplanation":["词源可拆解为：de-（源自拉丁语 deus“神”）+ form（形态）+ -ity（名词后缀，表示“性质/状态”）。整体含义就是“具有神的形态或性质”。","这是一个偏书面、偏古典的词，现代英语更常用 godlike / divine nature / divinity 来表达相近意思。使用 deiformity 往往带有庄重、赞美或宗教哲学色彩。"]}
{"word":"deify","summary":{"en":"Deify means to make someone into a god or to admire them so much that you treat them as perfect.","zh":"Deify 指“把某人神化/当作神来崇拜”，也可指“过度崇拜，把人当成完美无缺”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To make someone or something into a god; to worship or treat them as divine.","zh":"把某人或某物神化；当作神来崇拜或对待。"},"examples":[{"en":"Ancient rulers were sometimes deified after their deaths.","zh":"在古代，一些统治者死后有时会被神化。"},{"en":"The film seems to deify fame, as if being famous makes a person morally better.","zh":"这部电影似乎在神化名声，好像出名就能让人道德上更高尚。"},{"en":"It’s unwise to deify any leader; everyone has flaws.","zh":"把任何领袖神化都不明智；每个人都有缺点。"}]},{"partOfSpeech":"vt.","definition":{"en":"To admire someone excessively, treating them as perfect or beyond criticism.","zh":"过度崇拜（某人），把对方当成完美无缺、不可批评的人。"},"examples":[{"en":"Some fans deify pop stars and copy everything they do.","zh":"有些粉丝会过度崇拜流行歌手，模仿他们做的每一件事。"},{"en":"She deified her mentor at first, but later learned to disagree respectfully.","zh":"她一开始把导师奉若神明，但后来学会了以尊重的方式提出不同意见。"}]}],"synonyms":["idolize","worship","glorify","venerate","adore"],"phonetic":"/ˈdiːəˌfaɪ/","extraExplanation":["词源：来自拉丁语 *deus*（“神”）+ *-fy*（“使成为”）。因此 *deify* 字面意思就是“使成为神”。","语体与语气：这个词常带有批评或警惕的意味，用来提醒“不要把人当成神、不要盲目崇拜”。","常见搭配：*deify a leader / celebrity / fame / youth / beauty*（神化领袖/名人/名声/青春/美貌）。"]}
{"word":"deifying","summary":{"en":"“Deifying” means treating someone or something as a god, often implying extreme or blind admiration.","zh":"“deifying”表示把某人或某物神化、当作神来崇拜，常含“过度或盲目崇敬”的意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"treating someone or something as a god; admiring in an extreme, unquestioning way","zh":"把某人或某物当作神来崇拜；以极端、盲目的方式崇敬"},"examples":[{"en":"Some fans are deifying the singer and refusing to accept any criticism.","zh":"有些粉丝把这位歌手神化，拒绝接受任何批评。"},{"en":"The article took a deifying tone toward the CEO, calling him a genius in every way.","zh":"这篇文章用一种“神化”的语气写那位CEO，称他在各方面都是天才。"}]},{"partOfSpeech":"v.","definition":{"en":"the act of making someone or something into a god in belief, art, or language (present participle of “deify”)","zh":"使某人或某物成为“神”（在信仰、艺术或语言中）；“deify”的现在分词形式"},"examples":[{"en":"In the myth, the people are deifying the hero after his death.","zh":"在这个神话里，人们在英雄死后把他神化为神。"},{"en":"The film is deifying war and hiding its real costs.","zh":"这部电影在美化并神化战争，掩盖了它真实的代价。"}]}],"synonyms":["idolizing","worshiping","glorifying","exalting"],"phonetic":"/ˈdiːəˌfaɪɪŋ/","extraExplanation":["“deify”来自拉丁语词根（与“神/神性”有关）。在现代英语里，deifying 常用于批评性语境，表示对名人、权力或理念的“偶像化/神化”，暗示不理性、缺乏独立判断。","常见搭配：deifying fans（盲目崇拜的粉丝）、deifying rhetoric（神化式言辞）、deify a leader/celebrity（把领袖/名人神化）。"]}
{"word":"deign","summary":{"en":"“Deign” means to do something you consider beneath you, often used to show disdain or sarcasm.","zh":"“deign”表示“屈尊去做（觉得有失身份的事）”，常带轻蔑或讽刺语气。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to do something that you think is beneath your dignity; to lower yourself to do it (often used in negative or sarcastic contexts)","zh":"屈尊去做（你认为有失身份/不配你做的事）；常用于否定或带讽刺的语气"},"examples":[{"en":"He wouldn’t deign to answer my emails.","zh":"他连回我邮件都不屑。"},{"en":"She barely deigned to look at us as she walked by.","zh":"她走过时几乎都不屑看我们一眼。"},{"en":"Would you deign to explain what happened?","zh":"你肯屈尊解释一下发生了什么吗？（带讽刺/不满）"}]},{"partOfSpeech":"v.","definition":{"en":"to graciously agree to do something; to condescend (more formal, less common)","zh":"（较正式）俯就、赏光同意做某事"},"examples":[{"en":"The director deigned to meet the new interns for a few minutes.","zh":"导演赏光与新实习生见了几分钟。"},{"en":"If you deign to join us, dinner starts at seven.","zh":"如果你肯赏光加入我们，晚餐七点开始。"}]}],"synonyms":["condescend","stoop","lower oneself","grace (someone) with"],"phonetic":"/deɪn/","extraExplanation":["“deign”语气偏正式，常带有“高高在上/不屑”的情绪色彩，因此在日常交流里要谨慎使用，避免显得刻薄。","常见搭配：deign to do sth（屈尊做某事）；deign to answer/speak/explain/look（不屑回答/说话/解释/看一眼）。","词源上与拉丁语表示“值得/配得上”的词有关，所以核心含义是“觉得（某事）不配我做”，因此常见于讽刺或不满的表达。"]}
{"word":"deigned","summary":{"en":"“Deigned” means “condescended to do something,” often implying pride or arrogance.","zh":"“Deigned”表示“屈尊去做某事”，常暗含对方傲慢或摆架子的意味。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of deign) to do something that you think is beneath you; to condescend to do it.","zh":"（deign 的过去式/过去分词）屈尊去做（自认为低人一等或不值得做的事）；纡尊降贵。"},"examples":[{"en":"He finally deigned to answer my email after three reminders.","zh":"在我提醒了三次之后，他终于屈尊回了我的邮件。"},{"en":"The manager never deigned to speak to the interns directly.","zh":"那位经理从不屈尊直接和实习生说话。"}]}],"synonyms":["condescended","stooped","lowered oneself","saw fit to"],"phonetic":"/deɪnd/","extraExplanation":["“deign”常带有批评或讽刺的语气，暗示说话者认为对方傲慢、摆架子。使用时要注意礼貌场合可能显得尖刻。","固定搭配：deign to do sth（屈尊做某事）。常见于书面语、文学或正式语境。"]}
{"word":"deigning","summary":{"en":"“Deigning” means condescendingly agreeing to do something you think is beneath you.","zh":"“deigning”表示“屈尊去做/不屑去做”，常暗含傲慢或讽刺语气。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “deign”) Doing something that you consider beneath your dignity; condescendingly agreeing to do something.","zh":"（“deign”的现在分词）屈尊去做（自己认为有失身份或不值得做的事）；带着傲慢地“赏脸”去做。"},"examples":[{"en":"She finally spoke to us, deigning to answer a few questions.","zh":"她终于跟我们说话了，屈尊回答了几个问题。"},{"en":"He walked past without deigning to look at me.","zh":"他从我身边走过，连看我一眼都不屑。"},{"en":"The manager didn’t even deign to apologize.","zh":"经理甚至连道歉都不屑。"}]}],"synonyms":["condescending","stooping","lowering oneself","gracing (someone) with (something)"],"phonetic":"/deɪn/","extraExplanation":["“deign / deigning”语气很正式（formal），常带讽刺或不满：说话者觉得对方摆架子、态度傲慢。","常见搭配：deign to do sth（屈尊做某事）；not deign to + do（甚至不屑去做）。","写作中它常用于刻画“高高在上”的人物形象，或强调社交距离与傲慢态度。"]}
{"word":"deignous","summary":{"en":"“Deign” means to do or give something you consider beneath you (often used to criticize someone for acting superior).","zh":"“deign”表示“屈尊（做/给）”，常用来批评某人摆架子、显得高人一等。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Likely intended word) to do something that you think is beneath your dignity; to lower yourself enough to do it (often used in negative sentences).","zh":"（可能是你想查的词）屈尊做某事；勉强做自己认为有失身份/尊严的事（常用于否定句）。"},"examples":[{"en":"She wouldn’t deign to answer my question.","zh":"她不屑回答我的问题。"},{"en":"He didn’t deign to look at the waiter.","zh":"他连看服务员一眼都不愿意。"}]},{"partOfSpeech":"v.","definition":{"en":"to give something (like attention or approval) in a way that suggests you are superior.","zh":"（带优越感地）赐予、给予（关注/认可等）。"},"examples":[{"en":"The manager deigned to offer a brief apology.","zh":"经理屈尊简短道了个歉。"},{"en":"She deigned to smile at the crowd.","zh":"她勉强对人群笑了笑（带点居高临下的意味）。"}]}],"synonyms":["condescend","stoop (to)","lower oneself"],"phonetic":"/deɪn/","extraExplanation":["“deign”语气偏正式，常带讽刺或批评：说话者觉得对方摆架子、不肯“屈尊”。常见搭配：deign to do sth；deign an answer/smile/glance.","你输入的“deignous”在英语里不常见，可能是拼写误差。如果你原本想表达“有尊严的/高贵的”，更常用的是 dignified（有尊严的）或 dignitary（贵宾/要员，名词）。"]}
{"word":"deigns","summary":{"en":"“Deign(s)” means to do something reluctantly because you think it’s beneath you, often used critically or ironically; it can also mean “to grant” in formal/older English.","zh":"“deign(s)”指“屈尊去做（自认为不值/有失身份的事）”，常带讽刺或批评；在正式/较旧英语中也可指“赐予、准许”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(often used with “to”) to do something that you think is not worthy of you; to lower yourself to do it (often ironic or critical).","zh":"（常与 to 连用）屈尊去做（自己认为有失身份或不值得做的事）；（常带讽刺/批评意味）肯做。"},"examples":[{"en":"She wouldn’t deign to answer my question.","zh":"她不屑回答我的问题。"},{"en":"He finally deigned to apologize after everyone complained.","zh":"在大家都抱怨之后，他终于“屈尊”道歉了。"},{"en":"If you deign to join us, dinner starts at seven.","zh":"如果你肯赏光加入我们，晚餐七点开始。"}]},{"partOfSpeech":"v.","definition":{"en":"(formal/older) to give or allow something as a favor; to grant.","zh":"（正式/较旧用法）赐予；准许；恩准。"},"examples":[{"en":"The committee deigned approval only after many revisions.","zh":"委员会在多次修改后才批准（恩准）了。"},{"en":"He deigned them a brief smile.","zh":"他赐予他们一个短暂的微笑。"}]}],"synonyms":["condescend","stoop","lower oneself","grant","vouchsafe"],"phonetic":"/deɪn/","extraExplanation":["“deign”非常正式，日常口语里不常用；常见结构是“deign to do sth.”。它通常暗示说话者认为对方态度傲慢、摆架子，所以语气常带讽刺或不满。","你输入的“deigns”是第三人称单数现在时：he/she/it deigns。其他形式：deigned（过去式/过去分词），deigning（现在分词）。"]}
{"word":"deil","summary":{"en":"“deil” is a Scots dialect word meaning “the devil.”","zh":"“deil”是苏格兰方言里表示“魔鬼”的词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scots, dialect) the devil; used especially in phrases like “the deil.”","zh":"（苏格兰方言）魔鬼；常用于短语如 “the deil”（那个魔鬼）。"},"examples":[{"en":"In old Scots stories, people sometimes say, “The deil take him!”","zh":"在一些古老的苏格兰故事里，人们有时会说：“The deil take him!”（让魔鬼把他带走！）"},{"en":"He’s as stubborn as the deil.","zh":"他固执得像魔鬼一样。"}]}],"synonyms":["devil","Satan"],"phonetic":"/diːl/","extraExplanation":["“deil”是苏格兰英语（Scots）里对“devil”的常见拼写与发音变体，经常出现在民间故事、诗歌或带方言色彩的对白中。","如果你本来想查的是 “deal”（交易/处理）或 “diel”（咽喉/死去的变体）这类词，也可以告诉我语境，我可以帮你确认正确拼写与意思。"]}
{"word":"deils","summary":{"en":"“deils” is not standard English; it is usually a misspelling of “details,” meaning specific information or small facts.","zh":"“deils”不是标准英文，通常是把“details”拼错了，意思是“细节/具体信息”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Common misspelling) Usually intended to mean “details,” the plural of “detail”: small facts or pieces of information about something.","zh":"（常见拼写错误）通常想表达的是“details”（detail 的复数）：关于某事的细节、小信息点。"},"examples":[{"en":"Could you send me the details by email?","zh":"你能把细节用邮件发我吗？"},{"en":"We still don’t know the details of the plan.","zh":"我们仍然不知道这个计划的细节。"}]},{"partOfSpeech":"n.","definition":{"en":"detail (n.): a small part or fact about something; a specific point.","zh":"detail（名词）：细节；具体信息点。"},"examples":[{"en":"Pay attention to every detail.","zh":"注意每一个细节。"},{"en":"The report includes important details about the project.","zh":"这份报告包含有关项目的重要细节。"}]},{"partOfSpeech":"vt.","definition":{"en":"detail (vt.): to describe something carefully and fully, giving all the important facts.","zh":"detail（及物动词）：详细说明；把重要信息讲清楚。"},"examples":[{"en":"Please detail the steps you took.","zh":"请详细说明你采取了哪些步骤。"},{"en":"She detailed her experience in the interview.","zh":"她在面试中详细讲述了自己的经历。"}]}],"synonyms":["information","specifics","particulars","facts"],"phonetic":"/ˈdiːteɪlz/","extraExplanation":["“deils”不是标准英文单词；最常见是把“details”拼错了。正确拼写：details（复数），detail（单数）。","发音提示：detail 重音在前（DEE-tail），所以复数 details 也是同样的重音。"]}
{"word":"Deimos","summary":{"en":"Deimos is (1) the Greek personification of dread and (2) one of Mars’s two moons.","zh":"Deimos 指（1）希腊神话中“惊骇/恐惧”的拟人化神祇，也指（2）火星的两颗卫星之一“得摩斯”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, the god/personification of dread or terror; often described as a son of Ares and a companion of his brother Phobos (Fear) in battle.","zh":"（希腊神话）“恐惧/惊骇”的拟人化神祇，常被描写为战神阿瑞斯之子，与兄弟福波斯（Phobos，恐慌/恐惧）一同出现在战场上。"},"examples":[{"en":"In some myths, Deimos and Phobos ride with Ares into battle.","zh":"在一些神话里，Deimos 和 Phobos 会与阿瑞斯一同驰骋战场。"},{"en":"The poet used “Deimos” to symbolize the dread that spreads before a war begins.","zh":"诗人用“Deimos”来象征战争爆发前蔓延的惊骇。"}]},{"partOfSpeech":"n.","definition":{"en":"The smaller and outer moon of Mars, discovered in 1877; its name was chosen from Greek mythology (Deimos = dread).","zh":"（天文学）火星的外侧小卫星“得摩斯”（Deimos），于1877年被发现；其名称取自希腊神话（Deimos意为“惊骇/恐惧”）。"},"examples":[{"en":"Deimos orbits Mars farther out than Phobos does.","zh":"Deimos 绕火星运行的轨道比 Phobos 更外侧。"},{"en":"The probe took a distant photo of Deimos above the Martian horizon.","zh":"探测器拍到 Deimos 悬在火星地平线之上的远景照片。"}]}],"synonyms":["(mythology) dread","(astronomy) Mars’s moon Deimos"],"phonetic":"ˈdaɪmoʊs","extraExplanation":["“Deimos”来自古希腊语，含义与“惊骇、恐怖感”相关。与之成对出现的“Phobos”更常被译作“恐慌/恐惧”。在英语写作里，这两个名字常被借用来营造战争、压迫或心理恐惧的氛围。","作为专有名词，Deimos 通常首字母大写；指火星卫星时，科学写作中也保持大写。常见搭配：Deimos (moon)、Deimos orbit、Martian moon Deimos。"]}
{"word":"deimos","summary":{"en":"Deimos is a name from Greek mythology meaning “dread/terror,” and it is also the name of Mars’s smaller outer moon.","zh":"Deimos 源自希腊神话，意为“恐惧/惊骇”，同时也是火星较小、轨道更外侧的卫星（火卫二）的名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) The god/personification of dread or terror; often described as a companion of Ares (the god of war).","zh":"（希腊神话）“恐惧/惊骇”的拟人化神祇，常被描写为战神阿瑞斯（Ares）的随从或同伴。"},"examples":[{"en":"In Greek myth, Deimos represents the dread that follows violence and war.","zh":"在希腊神话中，Deimos 象征着暴力与战争之后袭来的恐惧。"},{"en":"Poets sometimes mention Deimos and Phobos to evoke the atmosphere of battle.","zh":"诗人有时会提到 Deimos 和 Phobos，用来渲染战场的气氛。"}]},{"partOfSpeech":"n.","definition":{"en":"Astronomy: the smaller, outer moon of Mars, discovered in 1877.","zh":"（天文学）火星的两颗卫星之一：较小、轨道更外侧的“火卫二”，发现于 1877 年。"},"examples":[{"en":"Deimos orbits Mars farther out than Phobos.","zh":"Deimos 绕火星运行的轨道比 Phobos（火卫一）更外侧。"},{"en":"The moons Phobos and Deimos are named after figures from Greek mythology.","zh":"Phobos 和 Deimos 这两颗火星卫星的名字都来自希腊神话人物。"}]}],"synonyms":["dread","terror","Phobos (related name)"],"phonetic":"ˈdaɪməs","extraExplanation":["“Deimos（Δεῖμος）”在希腊语里与“恐惧、惊骇”有关。它和“Phobos（恐慌）”常被并提，体现战争带来的两种心理感受：更偏持续的“畏惧”（Deimos）与更偏突然的“惊恐/恐慌”（Phobos）。","天文学命名上，火星卫星以战争相关的神话意象命名，与火星（Mars）在罗马神话中是战神相呼应。发现者是美国天文学家 Asaph Hall。"]}
{"word":"Deina","summary":{"en":"“Deina” is mainly used as a personal name rather than a standard English vocabulary word.","zh":"“Deina”主要作为人名使用，而不是标准英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a female given name (a personal name), sometimes used as a variant spelling of names like Deena, Dayna, or Dana","zh":"女性名字（人名）；有时被用作 Deena、Dayna 或 Dana 等名字的变体拼写"},"examples":[{"en":"Deina introduced herself at the start of the meeting.","zh":"Deina 在会议开始时做了自我介绍。"},{"en":"I’m not sure if Deina is spelled D-E-I-N-A or D-E-E-N-A.","zh":"我不确定 Deina 是拼作 D-E-I-N-A 还是 D-E-E-N-A。"}]}],"synonyms":["Deena","Dayna","Dana"],"phonetic":"/ˈdeɪnə/","extraExplanation":["“Deina”在英语中并不是常见词汇，更多见于人名拼写。不同地区/家庭可能会选择独特拼法，因此发音也可能有差异；在美国英语里常见的读法可类比“Dana/Dayna/Deena”。","如果你本来想查的是别的词（例如更常见的名字“Deena /ˈdiːnə/”或“Dana /ˈdeɪnə/”），告诉我你想表达的发音或上下文句子，我可以帮你确认最可能的拼写与含义。"]}
{"word":"deincrustant","summary":{"en":"A deincrustant is a product (or describing a product) that removes hard deposits like limescale or mineral buildup.","zh":"deincrustant 指除垢剂，或形容“用于除垢/去硬质沉积物”的清洁产品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical or product used to remove hard deposits (incrustations) such as limescale, mineral buildup, or soap scum from surfaces or equipment","zh":"（清洁用）除垢剂；用于去除水垢、矿物沉积、皂垢等硬质结垢的化学品/产品"},"examples":[{"en":"We used a deincrustant to remove limescale from the kettle.","zh":"我们用除垢剂把热水壶里的水垢清掉了。"},{"en":"The maintenance team applied a deincrustant to the pipes to clear mineral buildup.","zh":"维修团队在管道中使用除垢剂以清除矿物沉积。"}]},{"partOfSpeech":"adj.","definition":{"en":"intended for removing incrustations or hardened deposits","zh":"用于除垢的；能去除结垢/硬质沉积的"},"examples":[{"en":"Choose a deincrustant cleaner for the bathroom tiles.","zh":"浴室瓷砖要选用除垢型清洁剂。"},{"en":"This deincrustant solution is safe for stainless steel when diluted.","zh":"这种除垢溶液按比例稀释后可用于不锈钢。"}]}],"synonyms":["descaler","scale remover","limescale remover","decalcifier"],"phonetic":"ˌdiːɪnˈkrʌstənt","extraExplanation":["这个词在日常英语里不算常见，更常见的说法是 descaler（除水垢剂）、limescale remover（除水垢清洁剂）或 scale remover。","词源上可拆为 de-（去除）+ incrustation（结壳/结垢/沉积物），字面意思就是“去除结垢的东西”。在酒店清洁、工业维护、锅炉/管道保养等语境更容易遇到。","使用此类产品时常见提示包括：需要稀释、避免与漂白水/含氯产品混用、先在不显眼处测试材质耐受性等（不同配方差异很大）。"]}
{"word":"deindividualization","summary":{"en":"Deindividualization is when people lose their personal identity and self-restraint in a group, often acting more impulsively.","zh":"去个体化指人在群体中个人身份感与自我约束下降，因而更容易冲动行事。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The process of losing a sense of personal identity and self-control, often in a crowd or group, leading someone to act more impulsively or in ways they normally wouldn’t.","zh":"（去个体化）在群体或人群中失去个人身份感与自我约束的过程，常导致更冲动、做出平时不会做的行为。"},"examples":[{"en":"In a large crowd, deindividualization can make people feel anonymous and behave more aggressively.","zh":"在人群中，去个体化会让人产生“匿名感”，从而更容易表现得更有攻击性。"},{"en":"Wearing a mask can increase deindividualization because others can’t easily identify you.","zh":"戴口罩或面具可能会增强去个体化，因为别人不容易辨认出你。"}]}],"synonyms":["anonymity (in a crowd)","loss of self-awareness","deindividuation"],"phonetic":"/ˌdiˌɪn.dɪˌvɪdʒ.u.ə.laɪˈzeɪ.ʃən/","extraExplanation":["词源与构词：de-（去除）+ individual（个体）+ -ization（……化/过程），字面意思就是“把个体性拿掉的过程”。","常见语境：社会心理学里常用来解释群体行为（如球赛骚乱、网络喷子现象）。在网络环境中，匿名、账号不真实、缺少现实后果等因素，可能提高去个体化。","学习提示：它不等同于“从众（conformity）”。从众强调“为了符合群体规范而改变行为”；去个体化强调“自我意识下降、责任感分散”，因此更容易冲动或越界。"]}
{"word":"deindividualize","summary":{"en":"To remove or reduce someone’s sense of individual identity, often in groups or anonymous settings.","zh":"削弱或移除个人身份感与独特性，使人更像群体中的一员（常见于群体或匿名情境）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make a person seem less like an individual by removing personal identity, uniqueness, or responsibility (often in groups, uniforms, or anonymous settings)","zh":"使（某人）失去个体特征；通过削弱身份、独特性或责任感来“去个体化”（常见于群体、制服或匿名情境）"},"examples":[{"en":"Some organizations deindividualize new members by giving everyone the same uniform and rules.","zh":"有些组织会通过给新人统一的制服和规则来让他们“去个体化”。"},{"en":"Online anonymity can deindividualize users, making them say things they wouldn’t say face to face.","zh":"网络匿名可能让用户去个体化，从而说出当面不会说的话。"}]}],"synonyms":["depersonalize","anonymize","dehumanize (stronger/harsh)","standardize (in some contexts)"],"phonetic":"/ˌdiˌɪn.dəˈvɪdʒ.u.əˌlaɪz/","extraExplanation":["“deindividualize”常与社会心理学里的“deindividuation（去个体化/去个体状态）”一起出现：当人在群体或匿名环境中，个人身份感变弱，更容易跟随群体行为，可能导致冲动、攻击性或不负责任的行为。","构词法：de-（去除/反向）+ individualize（使个体化）。语气较正式，常用于学术、新闻或社会议题讨论。"]}
{"word":"deindividuate","summary":{"en":"Deindividuate means to reduce someone’s sense of individual identity—often through anonymity or group settings—so they feel like just part of a crowd.","zh":"Deindividuate 指“去个体化”：在匿名或群体情境中削弱个人身份感，使人更像人群中的一员，往往伴随责任感与自控力下降。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Psychology) To make a person feel less like a unique individual and more like an anonymous part of a group, often reducing personal responsibility and self-control.","zh":"（心理学）使人“去个体化”，让一个人不再强烈感觉自己是独特的个体，而更像群体中匿名的一员，常会降低个人责任感与自我约束。"},"examples":[{"en":"Wearing identical uniforms can deindividuate team members and strengthen group identity.","zh":"穿同样的制服会让队员去个体化，并强化群体认同。"},{"en":"Online anonymity may deindividuate users, making them more likely to say harsh things.","zh":"网络匿名可能让用户去个体化，从而更容易说出刻薄的话。"},{"en":"The crowd noise and masks seemed to deindividuate some protesters.","zh":"人群的喧闹和口罩似乎让一些抗议者产生了去个体化效应。"}]},{"partOfSpeech":"vi.","definition":{"en":"To experience deindividuation; to lose a sense of personal identity in a group setting.","zh":"（较少用）发生去个体化；在群体情境中失去强烈的个人身份感。"},"examples":[{"en":"In a highly charged crowd, people can deindividuate quickly.","zh":"在情绪高度激动的人群中，人们可能很快发生去个体化。"}]}],"synonyms":["anonymize","depersonalize","dehumanize","submerge (one’s identity)","absorb into the group"],"phonetic":"/ˌdiːɪnˈdɪvɪdʒuˌeɪt/","extraExplanation":["“deindividuate / deindividuation（去个体化）”常见于社会心理学讨论群体行为：当匿名性增强、个人被“淹没”在群体里时，可能更容易出现冲动、从众、甚至攻击性行为。","词形拆解有助记忆：de-（去除）+ individuate（使成为个体）。相近概念包括 anonymity（匿名性）、mob mentality（乌合之众心态/群体狂热）、diffusion of responsibility（责任分散）。","在学术与新闻语境更常用被动或名词形式：be deindividuated（被去个体化）、deindividuation（去个体化现象）。"]}
{"word":"deindustrialization","summary":{"en":"Deindustrialization is the decline of manufacturing in a place, often involving factory closures and a shift toward service or tech jobs.","zh":"Deindustrialization 指一个地区制造业衰退（工厂关闭、岗位外迁等），经济重心转向服务业或科技等行业。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process in which a country or region reduces large-scale manufacturing (industry), often as factories close or jobs move elsewhere, and the economy shifts toward services or technology","zh":"去工业化：一个国家或地区的大规模制造业（工业）减少的过程，常见表现为工厂关闭、岗位外迁，经济转向服务业或科技等领域"},"examples":[{"en":"Many towns in the Midwest experienced deindustrialization after major factories shut down.","zh":"在大型工厂关闭后，美国中西部许多城镇经历了去工业化。"},{"en":"Deindustrialization can lead to job losses and long-term changes in a community’s identity.","zh":"去工业化可能导致失业，并长期改变一个社区的身份认同与面貌。"},{"en":"The government introduced training programs to help workers adapt to deindustrialization.","zh":"政府推出培训项目，帮助工人适应去工业化带来的变化。"}]}],"synonyms":["industrial decline","manufacturing decline","deindustrialisation"],"phonetic":"/ˌdiːɪnˌdʌstriələˈzeɪʃən/","extraExplanation":["常见原因包括：全球化（把生产转移到劳动力更便宜的地区）、自动化（同样产量需要更少工人）、产业结构升级（从制造业转向服务业/金融/科技）、政策与贸易环境变化等。","语境提示：在新闻与社会科学写作中，deindustrialization 往往带有“失业、贫富差距、城镇衰退、政治与文化震荡”等讨论色彩；但也可能是经济转型的一部分，评价取决于写作角度。","词形拆解有助记忆：de-（减少/去除） + industrial（工业的） + -ization（……化/过程）。","相关搭配：post-industrial economy（后工业经济）、factory closures（工厂关闭）、manufacturing decline（制造业衰退）、industrial policy（产业政策）、rust belt（铁锈地带，常与去工业化并提）。"]}
{"word":"deindustrialize","summary":{"en":"Deindustrialize means to reduce or end industrial activity in a place, especially manufacturing.","zh":"deindustrialize 指使某地工业（尤其制造业）减少或消失，即“去工业化”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"To remove or reduce industrial activity (such as factories and manufacturing) in a place like a city, region, or country.","zh":"（使）去工业化；（使某地）工业活动减少或消失（如工厂、制造业萎缩）。"},"examples":[{"en":"Many towns began to deindustrialize after factories closed in the 1980s.","zh":"许多城镇在20世纪80年代工厂关闭后开始去工业化。"},{"en":"The region deindustrialized quickly, and unemployment rose.","zh":"该地区迅速去工业化，失业率随之上升。"}]}],"synonyms":["deindustrialise","deindustrialization (noun)","downsize (in industry)","phase out manufacturing"],"phonetic":"/ˌdiˌɪnˈdʌstriəˌlaɪz/","extraExplanation":["“de-”是常见前缀，表示“去除、减少、逆转”。因此 deindustrialize 字面意思就是“让（某地）不再以工业为主”。常见搭配：deindustrialize a city/region/economy（使城市/地区/经济去工业化）。","在新闻与社会科学语境中，deindustrialization（名词：去工业化）常与“制造业外移、自动化、全球化、产业结构转型”等话题一起出现，也常被用来讨论社区衰落、阶层变化与政治影响。"]}
{"word":"deink","summary":{"en":"“Deink” is not a standard word; it is usually a misspelling of “drink.”","zh":"“deink”不是标准英文词，通常是把“drink”拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A misspelling of “drink.” It is not a standard English word; use “drink” in writing.","zh":"“drink”的拼写错误形式。“deink”不是标准英文单词；写作时应使用“drink”。"},"examples":[{"en":"I want to deink water. (Incorrect) → I want to drink water. (Correct)","zh":"I want to deink water.（错误）→ I want to drink water.（正确）"},{"en":"Please check your spelling: “drink,” not “deink.”","zh":"请检查拼写：应写“drink”，不是“deink”。"}]}],"synonyms":["drink"],"phonetic":"/drɪŋk/","extraExplanation":["“drink”既可以作动词（喝），也可以作名词（饮料）。如果你想学“drink”的常见用法，我也可以按动词/名词分别给你例句与搭配（如: drink water, have a drink, drink to someone）。"]}
{"word":"Deino","summary":{"en":"Deino is the name of a Pokémon (a fictional creature) from the Pokémon series.","zh":"Deino是宝可梦系列中一种宝可梦（虚构生物）的名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Deino: a fictional creature (a Pokémon) in the Pokémon series, known as a Dark/Dragon-type Pokémon.","zh":"Deino：宝可梦系列中的虚构生物（宝可梦名称），设定为恶／龙属性。"},"examples":[{"en":"My first shiny hunt in the game was for Deino.","zh":"我在游戏里第一次刷闪光就是为了Deino。"},{"en":"Deino evolves into Zweilous at level 50.","zh":"Deino在50级会进化成Zweilous。"}]}],"synonyms":["Pokémon"],"phonetic":"/ˈdaɪnoʊ/","extraExplanation":["“Deino”是宝可梦的英文名，常被读作 /ˈdaɪnoʊ/（听起来像“dino”）。","它的进化链英文名带有德语数字梗：Deino（ein=1）→ Zweilous（zwei=2）→ Hydreigon（drei=3），分别暗示头的数量从1到2再到3。"]}
{"word":"deino","summary":{"en":"“Deino” is the name of a Pokémon species (a small dragon-type Pokémon).","zh":"“Deino”是宝可梦系列中一种宝可梦的名字（小型龙属性宝可梦）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Deino: a small dragon-type Pokémon species in the Pokémon video game and anime series (often shown as a blue, shaggy creature that bites and relies on touch because it can’t see well).","zh":"Deino：宝可梦（Pokémon）系列中的一种宝可梦物种（龙属性），常被描绘为蓝色、毛绒、爱咬人的小龙，因为视力不好而更多依靠触觉行动。"},"examples":[{"en":"I caught a Deino in Pokémon GO during the event.","zh":"我在《Pokémon GO》的活动期间抓到了一只Deino。"},{"en":"Deino evolves into Zweilous at level 50.","zh":"Deino在50级进化成Zweilous。"}]}],"synonyms":["Pokémon","Zweilous","Hydreigon"],"phonetic":"ˈdaɪnoʊ","extraExplanation":["“Deino”是专有名词，通常不作为普通英语词汇使用；在英文语境里多见于游戏、动画、卡牌与玩家交流中。","名字常被解释为结合了“dino（恐龙）”与德语数字“ein（1）”，呼应其进化链：Deino（1个头）→ Zweilous（2个头）→ Hydreigon（3个头）。"]}
{"word":"Deinocephalia","summary":{"en":"Deinocephalia is a scientific name for a group of extinct Permian therapsids known for thick, robust skulls.","zh":"Deinocephalia是古生物学术语，指二叠纪一类已灭绝的兽孔类，以厚重结实的头骨著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific group (suborder/clade) of extinct therapsids (“mammal-like reptiles”) from the Middle Permian period, known for having thick, often heavily built skulls; the name literally means “terrible-headed.”","zh":"古生物学中的一个分类群（亚目/演化支）：中二叠世的已灭绝兽孔类（“似哺乳动物的爬行动物”）的一支，以头骨厚重、体型粗壮而著称；名称字面意为“可怕的头（恐怖头）”。"},"examples":[{"en":"Deinocephalia includes large, heavy-bodied therapsids that lived long before dinosaurs.","zh":"Deinocephalia（恐头类）包括一些体型巨大、身体粗壮的兽孔类，它们生活在恐龙出现之前很久。"},{"en":"Paleontologists study Deinocephalia to understand early therapsid evolution in the Permian.","zh":"古生物学家研究Deinocephalia（恐头类），以了解二叠纪早期兽孔类的演化。"}]}],"synonyms":["Deinocephalians","恐头类（中文常译）"],"phonetic":"/ˌdaɪnoʊsəˈfeɪliə/","extraExplanation":["词源：来自希腊语 deinós（可怕的、强大的）+ kephalḗ（头）+ -ia（类群/集合）。\n\n读音提示：这个词常见于学术写作与博物馆展牌中；日常英语里很少使用。\n\n分类与语境：Deinocephalia通常被认为是兽孔类（Therapsida）中的一个重要类群，包含草食与肉食成员；中文科普中常译作“恐头类”。"]}
{"word":"deinocephalia","summary":{"en":"Deinocephalia is an extinct group of therapsids (mammal-like reptiles) from the Permian, named for their large, powerful skulls.","zh":"Deinocephalia（恐头类）是二叠纪时期已灭绝的一类兽孔目动物，因其粗壮有力的头骨而得名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group (suborder) of extinct mammal-like reptiles (therapsids) that lived mainly in the Middle Permian period; the name means “terrible heads,” referring to their robust skulls.","zh":"一种已灭绝的“似哺乳动物的爬行动物”（兽孔目类群）分支，主要生活在二叠纪中期；名称意为“可怕的头”，指它们粗壮的头骨。"},"examples":[{"en":"Deinocephalia were some of the earliest large land animals in the Permian.","zh":"恐头类（Deinocephalia）是二叠纪早期一些最早的大型陆生动物之一。"},{"en":"Fossils of Deinocephalia help scientists understand how later mammal-like animals evolved.","zh":"恐头类化石帮助科学家了解后来的似哺乳动物是如何演化的。"}]}],"synonyms":["Deinocephalians","therapsids (broader term)"],"phonetic":"/ˌdaɪ.noʊ.səˈfeɪ.li.ə/","extraExplanation":["“Deinocephalia”来自希腊语：deinos（可怕的、强大的）+ kephalē（头）。在古生物学写作中常作为专有名词使用，首字母大写。","恐头类是兽孔目（Therapsida）中的一个重要早期分支，包含不同生态类型：有的偏食肉，有的偏植食。它们并不是恐龙（dinosaur），而是更接近哺乳动物谱系的一支远古亲戚。","常见相关术语：therapsid（兽孔目动物）、synapsid（合弓类）、Permian（二叠纪）。在科普文章里，作者有时会把它们称为“mammal-like reptiles（似哺乳动物的爬行动物）”，这是便于理解的旧式说法。"]}
{"word":"Deinoceras","summary":{"en":"Deinoceras is a paleontological genus name for a large extinct Eocene mammal, often considered a synonym/variant of Uintatherium (or Dinoceras).","zh":"Deinoceras 是古生物学中一个属名，指始新世的大型已灭绝哺乳动物，常被视为 Uintatherium（或 Dinoceras）的同名或异写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus name used in paleontology for a large, extinct Eocene mammal (a uintathere), often treated as a synonym or variant spelling of Dinoceras/Uintatherium, known for horn-like bumps on the skull.","zh":"（古生物学）指一种已灭绝的始新世大型哺乳动物属名（属于“巨角兽类/Uintathere”），常被视为 Dinoceras 或 Uintatherium 的同名异写或近义用名，以头骨上角状突起而著称。"},"examples":[{"en":"Some older books use the name Deinoceras for the animal more commonly called Uintatherium today.","zh":"一些较早的书会用 Deinoceras 来指今天更常被称为 Uintatherium 的那种动物。"},{"en":"The museum label noted that Deinoceras lived in the Eocene and had bony, horn-like knobs on its skull.","zh":"博物馆的说明牌写道：Deinoceras 生活在始新世，头骨上有骨质的角状突起。"}]}],"synonyms":["Uintatherium","Dinoceras"],"phonetic":"/daɪˈnoʊsərəs/","extraExplanation":["词源来自希腊语：deinos（可怕的、巨大的）+ keras（角）。因此字面意思是“可怕的角”。","在现代分类中，这个名字不如 Uintatherium 常用；你可能会在旧文献、展览文字或不同学者的命名体系里看到它。"]}
{"word":"deinoceras","summary":{"en":"Deinoceras is the name of an extinct Eocene mammal genus, used mainly in paleontology and older sources.","zh":"Deinoceras 指一种已灭绝的始新世哺乳动物属名，多用于古生物学语境与较早资料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extinct genus of large, horned mammals (uintatheres) that lived in the Eocene epoch; the name is sometimes treated as an older/alternate name related to Uintatherium in paleontology.","zh":"（古生物）恐角兽属：已灭绝的一类大型有角哺乳动物（属“龟齿兽类/乌因塔兽类”），生活于始新世；在古生物学中该名称有时被视为与“乌因塔兽属（Uintatherium）”相关的较早/替代用名。"},"examples":[{"en":"Deinoceras appears in older paleontology books as a huge horned mammal from the Eocene.","zh":"在较早的古生物学书籍中，Deinoceras 常被写作一种来自始新世的巨大有角哺乳动物。"},{"en":"The museum label notes that Deinoceras is closely related to Uintatherium.","zh":"博物馆说明牌指出 Deinoceras 与 Uintatherium（乌因塔兽）关系密切。"}]}],"synonyms":["Uintatherium","Dinoceras"],"phonetic":"/ˌdaɪnoʊˈsɛrəs/","extraExplanation":["词源：来自希腊语 deinos（“可怕的、巨大的”）+ keras（“角”），字面义接近“可怕的角”。","背景提示：这个词多见于古生物学语境与旧文献；现代分类与用名可能因研究更新而有所调整，因此在不同资料中可能看到它与 Uintatherium 或拼写变体（如 Dinoceras）一起出现。"]}
{"word":"Deinodon","summary":{"en":"Deinodon is an old, no-longer-valid dinosaur genus name, originally used mainly for fossil teeth.","zh":"Deinodon是一个已废弃的恐龙属名，最初主要用于某些化石牙齿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former (now obsolete) scientific genus name used in the 1800s for certain large predatory dinosaur fossils—especially teeth—later understood to belong to tyrannosaur-like dinosaurs.","zh":"（已废弃的）19世纪曾使用的一个恐龙属名，主要用来指某些大型食肉恐龙的化石（尤其是牙齿）；后来发现这些材料多属于类似暴龙类的恐龙。"},"examples":[{"en":"Some early fossil teeth were labeled Deinodon before scientists could match them to more complete skeletons.","zh":"在科学家还无法把牙齿与完整骨架对应起来之前，一些早期发现的化石牙齿曾被标记为Deinodon。"},{"en":"In modern dinosaur books, Deinodon is usually mentioned only as an outdated name.","zh":"在现代恐龙书籍中，Deinodon通常只作为一个过时的名称被提到。"}]}],"synonyms":["(obsolete genus name)"],"phonetic":"/daɪˈnoʊdɑn/","extraExplanation":["Deinodon来自希腊语词根：deinos（“可怕的、令人敬畏的”）+ odon/odont-（“牙齿”），字面意思是“可怕的牙齿”。","它由美国古生物学家Joseph Leidy在19世纪根据零散牙齿化石提出；因为材料不完整，后来该属被认为缺乏明确诊断特征，属于“疑名/无效名”（nomen dubium），学界不再作为有效属使用。","在英文科普或博物馆资料里看到Deinodon，多是在讲恐龙命名史：早期常用牙齿等零碎化石命名，后来随着更多骨骼发现，命名与分类会被修订。"]}
{"word":"deinodon","summary":{"en":"Deinodon is an old, mostly unused dinosaur genus name meaning “terrible tooth,” seen mainly in historical paleontology texts.","zh":"Deinodon 是一个主要出现在旧古生物学文献中的已废弃恐龙属名，词义近似“可怕的牙齿”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an obsolete (no longer used) scientific genus name for a predatory dinosaur; today it is generally considered a doubtful name and is often linked historically to what we now call tyrannosaur-type dinosaurs.","zh":"一个已废弃（不再使用）的肉食性恐龙“属”名；如今通常被认为是存疑的旧名称，在历史上常与后来归入“暴龙类”的化石记录有关。"},"examples":[{"en":"In older books, you may see Deinodon used for large predatory dinosaur teeth found in North America.","zh":"在一些较早的书里，你可能会看到用 Deinodon 来指北美发现的大型肉食恐龙牙齿化石。"},{"en":"Modern paleontology rarely uses the name Deinodon because the original fossils were too incomplete to define a clear genus.","zh":"现代古生物学很少使用 Deinodon 这个名字，因为最初的化石太不完整，难以明确界定一个属。"}]}],"synonyms":["(historical/obsolete term)"],"phonetic":"/ˌdaɪˈnoʊdɑːn/","extraExplanation":["Deinodon 这个词来自希腊语词根：deinos（“可怕的、巨大的”）+ odon（“牙齿”），意思接近“可怕的牙齿”。","它最初主要依据“牙齿化石”命名；但仅凭牙齿往往难以准确归类到某个明确的恐龙属，因此后来在分类学上逐渐被弃用或视为“存疑名”（nomen dubium）。","在19世纪的北美古生物研究史中，这个名字有时会在旧文献里出现；学习时可以把它当作“历史名词”，了解即可。"]}
{"word":"Deinodontidae","summary":{"en":"Deinodontidae is an outdated dinosaur family name historically tied to *Deinodon* and rarely used in modern classification.","zh":"Deinodontidae 是一个与 *Deinodon* 相关的旧恐龙科名，现代分类中基本不再使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former (now largely obsolete) scientific family name for certain large carnivorous dinosaurs; historically linked to the genus *Deinodon* and often treated as a doubtful or unused classification today","zh":"（古生物学）一个旧的、如今多已废弃的肉食性大型恐龙“科”名；历史上与属名*Deinodon*相关，现常被视为存疑或不再使用的分类"},"examples":[{"en":"In older books, some theropods were grouped under Deinodontidae, but modern studies rarely use that family name.","zh":"在较早的书里，一些兽脚类恐龙曾被归入Deinodontidae，但现代研究很少再使用这个科名。"},{"en":"The label “Deinodontidae” may appear in museum archives, reflecting historical dinosaur taxonomy rather than current classification.","zh":"“Deinodontidae”这个标签可能会出现在博物馆档案中，它更多反映的是历史性的恐龙分类，而非现行分类。"}]}],"synonyms":["deinodonts (informal)"],"phonetic":"/ˌdaɪnoʊˈdɑːntɪdiː/","extraExplanation":["Deinodontidae 源自属名 *Deinodon*（意为“可怕的牙齿”一类的命名传统）。早期研究常依据零散牙齿或不完整化石建立分类单元，后来随着更多、更完整的骨骼发现与分类体系更新，这类“只凭少量材料建立的科名”常被合并、改名或判定为“存疑名（nomen dubium）”，因此在当代学术文献中不常见。"]}
{"word":"deinodontidae","summary":{"en":"Deinodontidae is an old, largely unused dinosaur family name, mostly replaced by Tyrannosauridae in modern classification.","zh":"Deinodontidae 是一个旧的、如今基本不用的恐龙科名，现代分类中多由暴龙科（Tyrannosauridae）取代。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an obsolete scientific family name once used for certain large carnivorous dinosaurs known mainly from teeth fossils; it is now generally treated as a historical synonym of (or replaced by) the family Tyrannosauridae.","zh":"一个已废弃的科学科名，过去曾用来指代一些主要依据牙齿化石认识的大型食肉恐龙；如今一般被视为历史上的旧称，通常由“暴龙科（Tyrannosauridae）”取代或等同处理。"},"examples":[{"en":"In older paleontology books, Deinodontidae sometimes appears where modern sources use Tyrannosauridae.","zh":"在较早的古生物学书籍中，Deinodontidae 有时会出现在现代资料会写 Tyrannosauridae（暴龙科）的地方。"},{"en":"The term Deinodontidae is rarely used today because dinosaur classification has been revised.","zh":"由于恐龙分类体系经过修订，Deinodontidae 这个术语如今很少使用。"}]}],"synonyms":["Tyrannosauridae (modern term in many contexts)","deinodontids (historical plural usage)"],"phonetic":"/ˌdaɪnəˈdɑːntɪdiː/","extraExplanation":["“Deinodontidae”来自希腊语词根：deino-（可怕的）+ odont-（牙齿）+ -idae（动物科名后缀）。早期研究者有时只能从牙齿等零散化石来命名与分类，因此出现过这类“以牙齿为依据”的分类名称。","在现代分类学中，这个科名多被视为历史用法；阅读旧文献时可把它大致理解为与暴龙类（尤其是暴龙科）相关的旧称，但具体涵盖范围可能因作者与年代而异。"]}
{"word":"deinos","summary":{"en":"Deinos is an Ancient Greek word often used in English discussion of Greek literature, meaning “terrible/awesome” or “formidable, remarkably capable,” sometimes with both senses at once.","zh":"Deinos 源自古希腊语，常见于希腊文学讨论，既可指“可怕、可畏”，也可指“强大、厉害（甚至技艺高超）”，有时两种含义并存。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(from Ancient Greek) terrible; frightening; awesome in a fearful way.","zh":"（源自古希腊语）可怕的；令人恐惧的；带有敬畏感的“可畏”。"},"examples":[{"en":"In some translations of Greek tragedy, deinos describes something both fearsome and awe-inspiring.","zh":"在一些希腊悲剧的译本中，deinos 用来形容某物既令人恐惧又令人敬畏。"},{"en":"The chorus calls the storm deinos, emphasizing its frightening power.","zh":"合唱队称暴风为 deinos，强调它可怕的力量。"}]},{"partOfSpeech":"adj.","definition":{"en":"(from Ancient Greek) remarkably powerful or capable; formidable; sometimes even “wonderfully skilled.”","zh":"（源自古希腊语）极其强大或有能力的；令人忌惮的；有时也可指“技艺高超、厉害得惊人”。"},"examples":[{"en":"In Sophocles’ Antigone, humans are described as deinos—hard to pin down as simply ‘good’ or ‘bad.’","zh":"在索福克勒斯《安提戈涅》中，人被描述为 deinos——很难简单归为“好”或“坏”。"},{"en":"A translator may render deinos as “wondrous” to highlight human ingenuity.","zh":"译者有时把 deinos 译成“奇妙/惊人”，以突出人类的巧思与创造力。"}]}],"synonyms":["terrible","fearsome","awe-inspiring","formidable","daunting"],"phonetic":"/ˈdaɪ.nɔs/","extraExplanation":["deinos（δεινός）在古希腊语里语义范围很广：既可指“可怕、骇人”，也可指“厉害、了不起（甚至带点危险感的强大）”。因此在文学语境里常带双重意味：让人敬畏、难以判断是福是祸。","它常见于学术/古典文学讨论中，而不是日常英语。你也会在一些科学命名里见到它的词根含义，比如恐龙名 Deinonychus（意为“可怕的爪子”）。"]}
{"word":"deinosaur","summary":{"en":"Dinosaur means an extinct prehistoric reptile; informally, it can also mean something very old-fashioned or outdated.","zh":"Dinosaur 指“恐龙”；在口语中也可指“很过时、老古董”的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large reptile that lived millions of years ago, long before humans; dinosaurs are now extinct","zh":"恐龙：生活在数百万年前、远早于人类的大型爬行动物；现已灭绝"},"examples":[{"en":"My little brother loves dinosaurs.","zh":"我弟弟很喜欢恐龙。"},{"en":"Scientists study dinosaur bones to learn about the past.","zh":"科学家研究恐龙骨骼来了解过去。"},{"en":"Tyrannosaurus rex was one of the most famous dinosaurs.","zh":"霸王龙是最著名的恐龙之一。"}]},{"partOfSpeech":"n.","definition":{"en":"someone or something considered old-fashioned, slow to change, or no longer useful (informal)","zh":"（非正式）老古董；过时的人或事物：指思想/做法陈旧、反应慢、不愿改变或不再有用的人或东西"},"examples":[{"en":"My old phone is a dinosaur compared to new smartphones.","zh":"我的旧手机跟新智能手机比起来简直是“老古董”。"},{"en":"That company’s system is a dinosaur—it needs an update.","zh":"那家公司的系统太落后了——需要升级。"}]}],"synonyms":["prehistoric animal","extinct reptile","relic","old-timer","antique (informal)"],"phonetic":"/ˈdaɪnəˌsɔr/","extraExplanation":["你输入的“deinosaur”更常见的正确拼写是“dinosaur”。发音里开头是 /ˈdaɪ/，像“die”的音。","“dinosaur”来自希腊语词根：deinos（可怕的、巨大的）+ sauros（蜥蜴）。所以原意接近“可怕的巨蜥”。","在日常英语里，用“a dinosaur”形容人或事物“很过时”很常见，但语气通常偏调侃。"]}
{"word":"Deinosauria","summary":{"en":"“Dinosauria” is the scientific name for the dinosaur group, which includes all dinosaurs and modern birds as their descendants; “Deinosauria” is a nonstandard spelling.","zh":"“Dinosauria”是恐龙类群的科学名称，包含所有恐龙以及作为其后代的现代鸟类；“Deinosauria”属于非标准拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Dinosauria: the scientific group (clade) that includes all dinosaurs—mostly large reptiles that lived during the Mesozoic Era, plus all modern birds as their living descendants.","zh":"Dinosauria：恐龙的科学分类群（演化支），包括所有恐龙——主要是生活在中生代的大型爬行动物——并且也包括作为其现生后代的所有鸟类。"},"examples":[{"en":"Tyrannosaurus rex belongs to Dinosauria.","zh":"霸王龙属于Dinosauria（恐龙类群）。"},{"en":"In modern biology, birds are considered part of Dinosauria.","zh":"在现代生物学中，鸟类被认为属于Dinosauria（恐龙类群）之内。"}]},{"partOfSpeech":"n.","definition":{"en":"(Commonly intended meaning, usually spelled “dinosaur”) any dinosaur; a large prehistoric reptile (and sometimes, informally, something old-fashioned or outdated).","zh":"（常见想表达的意思，通常拼作“dinosaur”）恐龙；一种史前大型爬行动物（也可非正式指“过时的人或物”）。"},"examples":[{"en":"My nephew loves dinosaurs.","zh":"我侄子很喜欢恐龙。"},{"en":"That old computer is a dinosaur.","zh":"那台旧电脑真是个“恐龙”（很老、很过时）。"}]}],"synonyms":["dinosaurs","the dinosaur clade","dinosaur (common word)"],"phonetic":"ˌdaɪnəˈsɔriə","extraExplanation":["你输入的拼写“Deinosauria”不常见；标准拼写通常是 **Dinosauria**（科学分类名）或 **dinosaur**（常用名词）。","**Dinosauria**源自希腊语：*deinos*（可怕的、巨大的）+ *sauros*（蜥蜴）。尽管名字里有“蜥蜴”，恐龙并不等同于现代蜥蜴；它们是另一条演化分支。","在科普文章里你常看到“non‑avian dinosaurs（非鸟类恐龙）”，用来区分已经灭绝的恐龙与仍然存活的鸟类（鸟类=鸟类恐龙）。"]}
{"word":"deinosauria","summary":{"en":"“Deinosauria” is a misspelling; the correct term is “Dinosauria,” the scientific name for the dinosaur group (including birds).","zh":"“deinosauria”是拼写错误；正确写法是“Dinosauria”，指恐龙这一科学分类群（也包括鸟类）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common misspelling) Intended word: Dinosauria — the scientific group (clade) that includes all dinosaurs.","zh":"（常见拼写错误）你可能想写：Dinosauria——包含所有恐龙的科学分类群（演化支）。"},"examples":[{"en":"I think you meant “Dinosauria,” not “deinosauria.”","zh":"我觉得你想写的是“Dinosauria”，不是“deinosauria”。"},{"en":"In biology class, we learned that birds are part of Dinosauria.","zh":"在生物课上，我们学到鸟类也是Dinosauria的一部分。"}]},{"partOfSpeech":"n.","definition":{"en":"Dinosauria: dinosaurs as a whole, especially in scientific writing.","zh":"Dinosauria：指“恐龙整体”，尤其用于科学写作语境。"},"examples":[{"en":"Researchers discuss the evolution of Dinosauria over millions of years.","zh":"研究人员讨论Dinosauria在数百万年中的演化。"},{"en":"The museum has an exhibit on Dinosauria and their habitats.","zh":"博物馆有一个关于Dinosauria及其栖息地的展览。"}]}],"synonyms":["dinosaurs","the dinosaur clade","dinosaur group"],"phonetic":"/ˌdaɪnəˈsɔriə/","extraExplanation":["“Dinosauria”是拉丁化的科学名称，常见于生物学与古生物学文章；日常英语更常说“dinosaurs”。","严格分类里，“Dinosauria”不仅包括我们熟悉的非鸟类恐龙，也包括现代鸟类（因为鸟类是恐龙的后代）。","如果你是在写作/搜索，建议用正确拼写“Dinosauria”（D-i-n-o-s-a-u-r-i-a），这样更容易查到准确资料。"]}
{"word":"Deinotherium","summary":{"en":"Deinotherium is an extinct elephant-like mammal famous for its downward-curving lower tusks.","zh":"Deinotherium（恐象属）是一种已灭绝的类象大型哺乳动物，以向下弯曲的下颌象牙著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large extinct prehistoric mammal related to elephants, known for its downward-curving lower tusks; it lived in Africa and Eurasia millions of years ago.","zh":"恐象属（一种已灭绝的史前大型哺乳动物，与大象近亲；以下颌向下弯曲的象牙著称，数百万年前生活于非洲与欧亚大陆）。"},"examples":[{"en":"Fossils of Deinotherium have been found in parts of Africa and Eurasia.","zh":"在非洲和欧亚大陆的一些地区发现了恐象属的化石。"},{"en":"Unlike modern elephants, Deinotherium had tusks that curved downward from the lower jaw.","zh":"与现代大象不同，恐象属的象牙从下颌向下弯曲。"}]}],"synonyms":["deinothere"],"phonetic":"ˌdaɪnəˈθɪriəm","extraExplanation":["词源：来自希腊语 *deinos*（“可怕的、巨大的”）+ *therion*（“野兽”）。因此名称带有“可怕的巨兽”的感觉，但并不一定表示它更凶猛。","辨析：它常被误认为“远古象”。恐象属确实属于长鼻目（与大象同一大类），但并不是现代象的直接祖先；其最显著特征是“下颌长出、向下弯曲”的象牙。","使用场景：该词多出现在古生物学、博物馆展牌、科普书或纪录片中；日常英语里较少使用。"]}
{"word":"deinotherium","summary":{"en":"Deinotherium is an extinct giant relative of elephants with distinctive downward-curving lower tusks.","zh":"Deinotherium（恐象属）是已灭绝的巨型象类近亲，以向下弯曲的下颌獠牙为特征。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large extinct prehistoric relative of elephants (a proboscidean), known for its downward-curving tusks on the lower jaw","zh":"（已灭绝的）恐象属：一种史前大型象类近亲（长鼻目动物），以长在下颌、向下弯曲的獠牙而著名"},"examples":[{"en":"Scientists found Deinotherium fossils in parts of Africa and Eurasia.","zh":"科学家在非洲和欧亚大陆的一些地区发现了恐象属化石。"},{"en":"Unlike mammoths, Deinotherium had tusks that curved downward from the lower jaw.","zh":"与猛犸象不同，恐象属的獠牙从下颌向下弯曲。"},{"en":"The museum exhibit compared Deinotherium with modern elephants to show evolution over time.","zh":"博物馆展览把恐象属与现代大象作对比，展示随时间变化的演化。"}]}],"synonyms":["deinothere","prehistoric proboscidean"],"phonetic":"/ˌdaɪnəˈθɪriəm/","extraExplanation":["这是古生物学中的学名（属名），常见于博物馆说明或科普文章中；日常英语里不常用。","词源来自希腊语：deinos（可怕的、巨大的）+ therion（野兽），大意是“可怕的巨兽”。"]}
{"word":"deinstitutionalization","summary":{"en":"Deinstitutionalization is the process of moving people out of large institutions and into community-based care.","zh":"去机构化是把人们从大型收容机构转向社区照护与服务的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the policy or process of moving people (especially those with mental illness or disabilities) out of large institutions (such as psychiatric hospitals) and into community-based care and services","zh":"（政策/过程）把人们（尤指精神疾病或残障者）从大型收容机构（如精神病院）转到社区照护与服务体系中"},"examples":[{"en":"Deinstitutionalization aimed to replace long-term psychiatric hospitalization with community mental health services.","zh":"去机构化的目标是用社区心理健康服务取代长期的精神科住院收治。"},{"en":"Many cities struggled after deinstitutionalization because housing and support services were not fully funded.","zh":"去机构化之后，许多城市因住房与支持服务资金不足而面临困难。"}]}],"synonyms":["community-based care","community integration","decarceration (in some contexts)","release from institutions"],"phonetic":"/ˌdiːˌɪnstəˌtuːʃənələˈzeɪʃən/","extraExplanation":["“deinstitutionalization”在美国语境中常与20世纪中后期精神卫生政策变迁有关：一方面强调人权与“在社区生活”的理念，另一方面若社区资源（住房、门诊治疗、社工支持等）不足，也可能导致无家可归、监禁替代治疗等社会问题。讨论这个词时，常带有政策成效与社会支持系统是否到位的评估意味。","词形拆解有助记忆：de-（去除/反向） + institution（机构） + -alize（使……化） + -ation（名词后缀）。"]}
{"word":"deinsularize","summary":{"en":"Deinsularize means to make something less isolated or narrow-minded by increasing outside contact and openness.","zh":"Deinsularize 指通过增加与外界的联系与开放性，使某个对象不再孤立或狭隘封闭。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make a person, group, or place less isolated or inward-looking; to open it to outside ideas, contact, or influence","zh":"使（个人/群体/地区）不再孤立或封闭；使更开放、更多与外界接触并接受外来影响"},"examples":[{"en":"The new rail line helped deinsularize the region by connecting it to major cities.","zh":"新的铁路线路通过把该地区与大城市连接起来，帮助它摆脱封闭状态。"},{"en":"Studying abroad can deinsularize students and broaden how they see the world.","zh":"出国留学可以让学生不再狭隘封闭，拓宽他们看世界的方式。"},{"en":"The company tried to deinsularize its culture by hiring people from different industries.","zh":"这家公司通过从不同领域招聘人才，试图让企业文化不再封闭。"}]}],"synonyms":["open up","broaden","integrate","internationalize","connect"],"phonetic":"/diˌɪn.səˈlɛr.aɪz/","extraExplanation":["构词法：de-（去除/逆转）+ insularize（使变得孤立、狭隘）。insular 原义与“岛屿（island）”相关，引申为“像岛一样与外界隔绝”。","用法提示：deinsularize 属于较少见、偏正式的词，常见于社会学、政治评论、组织管理等语境；日常表达中更常用 open up、make less isolated、broaden outlook 等。"]}
{"word":"deintellectualization","summary":{"en":"Deintellectualization means the process of making something less intellectual—less focused on ideas, learning, and critical thinking.","zh":"Deintellectualization 指“去智性化”：使某事物变得不那么重视思想、知识与批判性思考的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The process of making something less intellectual (less focused on ideas, knowledge, or critical thinking), or the process of removing intellectual content or influence from a person, group, or society.","zh":"（对个人、群体或社会）去智性化：使其变得不那么重视思想、知识与批判性思考，或削弱/移除其中的“智性”内容与影响的过程。"},"examples":[{"en":"Some critics worry that social media encourages deintellectualization by rewarding quick takes over careful reasoning.","zh":"一些评论者担心社交媒体会助长去智性化，因为它奖励的是“快评”而不是严谨推理。"},{"en":"The show’s later seasons were accused of deintellectualization, relying more on spectacle than on complex ideas.","zh":"这部剧后期被指责出现去智性化：更依赖视觉奇观，而非复杂思想。"},{"en":"In politics, deintellectualization can appear when expertise is treated as suspicious or elitist.","zh":"在政治领域，当专业知识被当成可疑或“精英主义”时，就可能出现去智性化。"}]}],"synonyms":["dumbing down","anti-intellectualism","simplification","trivialization"],"phonetic":"/ˌdiˌɪnˌtɛlɪkˌtʃuələˈzeɪʃən/","extraExplanation":["构词提示：de-（去除、降低）+ intellectual（智性/知识性的）+ -ization（……化、过程）。因此它强调“一个过程”——让思想性、学术性或深度讨论被削弱。","语境色彩：这个词常带批评意味，常见于文化评论、教育讨论、媒体批评与政治写作中，用来指公共讨论变浅、反智倾向增强，或对专家与知识的信任下降。","近义对比：它不等同于“反智”（anti-intellectualism，偏态度/立场），而更像“变得不那么智性”的趋势或过程；也可与“简化、娱乐化、民粹化”等现象并列讨论。"]}
{"word":"deintellectualize","summary":{"en":"“Deintellectualize” means to make something less intellectual by removing depth, complexity, or the influence of intellectual ideas.","zh":"“deintellectualize”指让某事物变得不那么“思想化/学术化”，通过削弱深度、复杂性或知识分子的影响来“去智化”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove intellectual content or influence from something; to make it less intellectual (often to appeal to a wider audience)","zh":"使去智化；削弱某事物的思想性/学术性（常指为了迎合更大众的受众）"},"examples":[{"en":"Some critics say the show was deintellectualized to attract more viewers.","zh":"一些评论家说，这档节目为了吸引更多观众而被“去智化”了。"},{"en":"The textbook was deintellectualized into short, simple summaries.","zh":"这本教材被“去智化”成了简短、简单的摘要。"},{"en":"He worried that the debate would be deintellectualized into slogans.","zh":"他担心这场辩论会被“去智化”，沦为口号。"}]},{"partOfSpeech":"vt.","definition":{"en":"to reduce the role of intellectuals or complex ideas in a society, organization, or conversation","zh":"降低知识分子或复杂思想在社会/组织/讨论中的作用"},"examples":[{"en":"The movement aimed to deintellectualize public policy discussions.","zh":"这场运动旨在让公共政策讨论“去智化”。"},{"en":"Social media can sometimes deintellectualize serious topics.","zh":"社交媒体有时会让严肃话题“去智化”。"}]}],"synonyms":["dumb down","simplify","water down","defang","popularize (context-dependent)"],"phonetic":"/ˌdiː.ɪn.təˈlɛk.tʃu.əˌlaɪz/","extraExplanation":["“de-”是否定/去除前缀，表示“去掉、减少”；“intellectualize”意为“使……理性化/学术化”。合起来的语感通常偏批评：不是单纯“简化”，而是暗示把思考深度或学术性拿掉了。","常见搭配：deintellectualize a debate/discussion (使辩论去智化)、deintellectualize culture/education (使文化/教育去智化)、be deintellectualized into slogans (被简化成口号)。在写作中多见于评论、文化研究、媒体批评语境。"]}
{"word":"Deion","summary":{"en":"Deion is mainly used as a male first name; it can also refer to the famous athlete and coach Deion Sanders.","zh":"Deion 主要用作男性名字；也可指著名运动员与教练 Deion Sanders。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a male given name (first name), especially in the U.S.","zh":"男性名字（名），在美国较常见。"},"examples":[{"en":"Deion is my cousin’s name.","zh":"Deion 是我表哥的名字。"},{"en":"In class, Deion volunteered to present first.","zh":"在课堂上，Deion 自愿第一个做展示。"}]},{"partOfSpeech":"other","definition":{"en":"(often capitalized) referring to Deion Sanders (born 1967), a famous American athlete and coach known for playing both professional football (NFL) and baseball (MLB).","zh":"（常大写）指迪昂·桑德斯（Deion Sanders，1967 年生），美国著名运动员与教练，以同时打过职业橄榄球（NFL）和棒球（MLB）而闻名。"},"examples":[{"en":"Deion Sanders is known for his speed and confidence.","zh":"Deion Sanders 以速度快和自信著称。"},{"en":"My dad still talks about Deion’s plays from the 1990s.","zh":"我爸到现在还会聊 Deion 在 1990 年代的精彩表现。"}]}],"synonyms":["Dion"],"phonetic":"/ˈdiːɑn/","extraExplanation":["“Deion”常被认为是“Dion”的变体拼写；“Dion”与希腊语酒神狄俄尼索斯（Dionysus）有关联，但现代作为名字使用时，多数人并不会强调神话含义。","在美国体育文化里，提到“Deion”很多时候是在说 Deion Sanders；他也因绰号“Prime Time”而广为人知。"]}
{"word":"deionization","summary":{"en":"Deionization is the removal of ions from a liquid (especially water) to make it very pure.","zh":"Deionization 指把液体（尤指水）中的离子去除，从而获得高纯度的水。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of removing ions (charged particles) from water or another liquid, often to make it very pure","zh":"去离子；把水或其他液体中的离子（带电粒子）去除的过程，常用于获得高纯度的水"},"examples":[{"en":"Many labs use deionization to produce pure water for experiments.","zh":"许多实验室会用去离子处理来制备用于实验的纯水。"},{"en":"Deionization removes dissolved salts, but it may not remove bacteria by itself.","zh":"去离子能去除溶解的盐类，但它本身未必能去除细菌。"}]}],"synonyms":["ion removal","deionizing","demineralization"],"phonetic":"/diˌaɪ.ə.nəˈzeɪ.ʃən/","extraExplanation":["“Deionization”常见于理化、医疗与工业用水语境，比如“deionized water (DI water，去离子水)”。它通常通过离子交换树脂（把水中的阳离子/阴离子换掉）来实现。","学习区分：deionization（去离子）主要去除“离子/盐分”；distillation（蒸馏）靠加热冷凝去除多种杂质；filtration（过滤）主要去除颗粒；sterilization（灭菌）针对微生物。实际用水常把多种方法组合使用。"]}
{"word":"deionizations","summary":{"en":"“Deionizations” means multiple instances of removing ions from a substance, especially water.","zh":"“deionizations”指多次/多种去离子过程，尤指对水进行去离子处理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the processes of removing ions (charged particles) from a substance, especially from water (e.g., to make deionized water)","zh":"去离子过程；去除物质（尤指水）中离子（带电粒子）的过程（如制备去离子水）"},"examples":[{"en":"Many laboratories use deionizations to produce water for sensitive experiments.","zh":"许多实验室使用去离子处理来制备用于敏感实验的水。"},{"en":"In the factory, repeated deionizations help reduce mineral buildup in equipment.","zh":"在工厂里，反复去离子处理有助于减少设备中的矿物质沉积。"}]}],"synonyms":["ion removals","deionization processes","demineralizations"],"phonetic":"/ˌdiˌaɪənaɪˈzeɪʃənz/","extraExplanation":["“deionizations”是“deionization”的复数形式，多用于技术/科学语境。日常生活中更常见的说法是“deionization (process)”或“deionized water（去离子水）”。","去离子通常通过离子交换树脂等方法，把水中的阳离子/阴离子去除；它不等同于“杀菌”或“过滤掉所有杂质”（例如有机物、微生物可能仍需其他处理）。"]}
{"word":"deionize","summary":{"en":"Deionize means to remove dissolved ions from a liquid (usually water) to make it purer.","zh":"Deionize 指去除液体（通常是水）中的溶解离子，使其更纯。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove dissolved ions (charged particles) from a liquid, especially water, to make it purer","zh":"（尤指对水）去除溶解的离子（带电粒子），使液体更纯"},"examples":[{"en":"The lab deionizes water to avoid contamination in experiments.","zh":"实验室会将水去离子，以避免实验受到污染。"},{"en":"Deionized water is commonly used in car batteries and steam irons.","zh":"去离子水常用于汽车电池和蒸汽熨斗。"}]},{"partOfSpeech":"vt.","definition":{"en":"(chemistry/engineering) to convert something into a less ionized state by removing ions","zh":"（化学/工程）通过去除离子，使某物的离子化程度降低"},"examples":[{"en":"The resin bed helps deionize the solution during processing.","zh":"在加工过程中，树脂床帮助对溶液进行去离子处理。"}]}],"synonyms":["demineralize","remove ions","purify (water)"],"phonetic":"/diˈaɪəˌnaɪz/","extraExplanation":["“de-”表示“去除/逆转”，而“ionize”是“使电离/使形成离子”。“deionize”常见于实验室、制药、电子制造与水处理领域。","日常语境里更常听到名词“deionized water（去离子水）”。注意：去离子水主要去除带电离子，但不一定能去除所有细菌、有机物或颗粒物；“distilled（蒸馏）”与“filtered（过滤）”是不同的净化方式。"]}
{"word":"deionized","summary":{"en":"Deionized means ions have been removed (especially from water), making it very low in dissolved minerals.","zh":"deionized 指“去离子的”（尤指水）：去除了溶解离子/矿物盐，使矿物质含量很低。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Having had ions (charged particles and dissolved mineral salts) removed, especially from water; made very low in mineral content by an ion‑exchange process.","zh":"（化学）去离子的；（尤指水）通过离子交换等方式去除带电离子/溶解的矿物盐，使矿物质含量很低的。"},"examples":[{"en":"Use deionized water to prepare the solution so minerals don’t affect the results.","zh":"配制溶液时用去离子水，这样矿物质不会影响实验结果。"},{"en":"The lab rinses glassware with deionized water to avoid leaving mineral spots.","zh":"实验室用去离子水冲洗玻璃器皿，避免留下水垢斑点。"}]}],"synonyms":["demineralized","ion-exchanged"],"phonetic":"/diˈaɪə.naɪzd/","extraExplanation":["“Deionized water（去离子水）”常缩写为 DI water。它主要去除溶解在水中的离子（如钙、镁、钠、氯离子等），因此导电性更低、杂质更少，常用于实验、电子工业、医疗器械清洗等。","注意区分：去离子水（deionized）不等同于蒸馏水（distilled）或纯净水（purified）。去离子主要针对“离子”，但未必能去除所有微生物、有机物或颗粒；蒸馏通常能去除更多类型的杂质，但成本更高。","在日常饮用方面，去离子水并不一定“更健康”；它的用途更多是技术/工业场景。"]}
{"word":"deionizer","summary":{"en":"A deionizer is a device that removes ions from water or other liquids to make them purer.","zh":"deionizer 指从水或其他液体中去除离子、提高纯度的去离子装置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device or material that removes ions (charged particles) from a liquid (especially water), making it more purified","zh":"去离子器；去离子装置（从液体，尤指水中去除离子，使其更纯净的设备或材料）"},"examples":[{"en":"The lab uses a deionizer to produce high-purity water for experiments.","zh":"实验室使用去离子器来制备用于实验的高纯水。"},{"en":"If the deionizer resin is exhausted, the water quality will drop.","zh":"如果去离子器的树脂失效，水质就会下降。"},{"en":"Many aquariums use a deionizer after reverse osmosis to remove remaining ions.","zh":"许多水族箱会在反渗透之后使用去离子器来去除残余离子。"}]}],"synonyms":["ion exchanger","deionization unit","DI unit"],"phonetic":"/diˈaɪəˌnaɪzər/","extraExplanation":["“deionizer”常见于实验室、制药、电子制造、锅炉补给水、汽车美容等场景。它通常依靠“离子交换树脂”把水中的阳离子/阴离子换出来，从而降低导电率。","容易混淆的词：\n- deionized water（去离子水）：强调“离子更少”，但不一定无菌。\n- distilled water（蒸馏水）：靠蒸馏去除杂质，原理不同。\n- RO (reverse osmosis)（反渗透）：靠膜过滤，常与去离子一起使用以获得更高纯度。"]}
{"word":"deionizes","summary":{"en":"“Deionizes” means removes ions from a liquid (usually water), making it very low in dissolved salts.","zh":"“Deionizes”指对液体（通常是水）进行去离子处理，去除溶解的离子/盐分。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(third-person singular of “deionize”) to remove ions (electrically charged atoms or molecules) from a liquid, especially water, usually by using ion-exchange resins or similar processes.","zh":"（“deionize”的第三人称单数）去离子；从液体（尤指水）中去除离子（带电的原子或分子），通常通过离子交换树脂等工艺实现。"},"examples":[{"en":"This filter deionizes the water for laboratory experiments.","zh":"这个过滤器会把水去离子，用于实验室实验。"},{"en":"The system deionizes rinse water to prevent mineral spots on the glass.","zh":"该系统会对漂洗水进行去离子处理，以防玻璃上出现水渍（矿物斑）。"}]}],"synonyms":["demineralizes","purifies","desalinates (partial)"],"phonetic":"/diˈaɪəˌnaɪz/","extraExplanation":["“Deionized water (DI water，去离子水)”常用于实验室、电子制造、制药与精密清洗，因为离子（如钙、镁、钠、氯）会影响导电性、造成水垢或干扰化学反应。","在日常口语中更常见的是形容词/名词用法：deionized water；动词 deionize / deionizes 多出现在说明书、工艺流程和科研写作里。"]}
{"word":"deionizing","summary":{"en":"Deionizing means removing ions from a liquid (often water), usually to make it very pure for labs or industry.","zh":"Deionizing 指从液体（常为水）中去除离子，通常用于获得更高纯度的水，供实验室或工业使用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Removing ions (charged particles) from a liquid, especially water, to make it very low in minerals and salts.","zh":"（化学）去除液体（尤其是水）中的离子（带电粒子），使其矿物质和盐分含量极低。"},"examples":[{"en":"The lab uses deionizing filters to prepare water for sensitive experiments.","zh":"实验室使用去离子过滤器来制备用于敏感实验的水。"},{"en":"Deionizing the water helps prevent mineral deposits on the equipment.","zh":"对水进行去离子处理有助于防止设备结垢。"}]},{"partOfSpeech":"v.","definition":{"en":"The process of removing ions from a liquid (present participle of “deionize”).","zh":"去除液体中离子的过程（“deionize”的现在分词，用于描述正在进行的动作）。"},"examples":[{"en":"They are deionizing the rinse water before the final cleaning step.","zh":"他们正在对冲洗水进行去离子处理，然后再进行最后的清洁步骤。"},{"en":"The system has been deionizing water continuously all day.","zh":"该系统一整天都在持续进行水的去离子处理。"}]}],"synonyms":["demineralizing","ion-removing","purifying (in context)"],"phonetic":"/diˈaɪəˌnaɪzɪŋ/","extraExplanation":["“去离子水（deionized water, DI water）”常用于实验室、电子制造、医用清洗等场景，因为离子杂质会影响反应结果或造成导电、腐蚀与水垢。","注意区分：deionizing（去离子）主要去除“离子”；而 distilling（蒸馏）通过汽化冷凝去除多种杂质；filtering（过滤）通常只去除颗粒物，未必去除溶解的离子。"]}
{"word":"Deiope","summary":{"en":"Deiope is a rare proper name, usually a variant/short form of Deiopeia, a nymph in Virgil’s *Aeneid*.","zh":"Deiope 是罕见的人名，通常被视为 Deiopeia 的变体／简写；Deiopeia 是维吉尔《埃涅阿斯纪》中的一位仙女。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper name, mythology) A minor nymph in Roman epic tradition, often treated as a shortened form of **Deiopeia**, a sea nymph mentioned in Virgil’s *Aeneid*.","zh":"（专有名词／神话）罗马史诗传统中的一位小仙女名，常被视为 **Deiopeia（狄俄珀亚）** 的简写形式；她是维吉尔《埃涅阿斯纪》中出现的海仙女之一。"},"examples":[{"en":"In some retellings of the *Aeneid*, Deiope is another name for the nymph Deiopeia.","zh":"在一些《埃涅阿斯纪》的改写版本中，Deiope 被当作海仙女 Deiopeia 的另一种写法。"},{"en":"The name Deiope appears mainly in discussions of classical mythology and Latin literature.","zh":"Deiope 这个名字主要出现在古典神话与拉丁文学的讨论中。"}]}],"synonyms":["Deiopeia"],"phonetic":"/daɪˈoʊpi/","extraExplanation":["“Deiope”并不是现代英语里的常用词，更像是古典人名的变体／简写。更常见、也更容易查到的形式是 **Deiopeia**（维吉尔《埃涅阿斯纪》里朱诺提出要嫁给风神埃俄罗斯的仙女名）。","如果你是在某本书、游戏或同人作品里看到“Deiope”，它也可能是作者改写的拼法；可以把你看到的句子贴出来，我能帮你判断具体指的是哪位角色或哪个来源。"]}
{"word":"Deipara","summary":{"en":"Deipara is a rare literary/theological Latin term meaning “God-bearer,” used for the Virgin Mary.","zh":"Deipara 是一个较罕见的拉丁文学/神学用词，意为“生神者（诞神者）”，用来指称圣母玛利亚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(literary or theological) the Virgin Mary, especially when emphasizing her as the one who bore God (Jesus).","zh":"（文学或神学用语）“生神者/诞神者”，特指圣母玛利亚，强调她孕育并生下上帝（耶稣）。"},"examples":[{"en":"In medieval hymns, Mary is often praised as the Deipara.","zh":"在中世纪圣歌中，玛利亚常被赞颂为“Deipara”（生神者）。"},{"en":"The poem addresses the Deipara with reverence and awe.","zh":"这首诗以敬畏之情称颂“Deipara”（圣母）。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) describing Mary as “God-bearing” or “Mother of God.”","zh":"（罕用）形容圣母玛利亚为“生神的/诞神的/天主之母的”。"},"examples":[{"en":"A Deipara title appears in some Latin prayers.","zh":"一些拉丁祷文中会出现“Deipara”这一称号。"},{"en":"The icon bears a Deipara inscription.","zh":"这幅圣像上题有“Deipara”的铭文。"}]}],"synonyms":["Theotokos","God-bearer","Mother of God","Virgin Mary"],"phonetic":"/ˌdeɪˈpærə/","extraExplanation":["“Deipara”源自拉丁语：Dei-（上帝的）+ -para（生育者、产者），字面意思是“生上帝者”。在基督教语境里，它对应希腊语称号“Theotokos”（意为“生神者/上帝之母”）。","该词多见于拉丁礼仪、圣歌、神学著作或带有宗教色彩的诗歌中，现代日常英语中很少使用；一般更常见的表达是“Mother of God”或“the Virgin Mary”。"]}
{"word":"deipara","summary":{"en":"Deipara is a formal (Latin-based) term meaning “Mother of God,” used mainly as a title for the Virgin Mary.","zh":"Deipara 是一个较正式的拉丁语系用词，意为“上帝之母／天主之母”，主要作为圣母玛利亚的称号。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in Christian theology) a title for the Virgin Mary meaning “Mother of God.”","zh":"（尤用于基督教神学）“天主之母／上帝之母”，对圣母玛利亚的称号。"},"examples":[{"en":"In some Latin hymns, Mary is praised as the Deipara.","zh":"在一些拉丁圣歌中，玛利亚被赞颂为“Deipara”（天主之母）。"},{"en":"The text refers to the Deipara to emphasize Christ’s divine nature.","zh":"文本用“Deipara”来强调基督的神性。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Virgin Mary as “Mother of God.”","zh":"（形容）与“天主之母／上帝之母”（指圣母玛利亚）这一称号相关的。"},"examples":[{"en":"The prayer uses Deipara language common in older devotional writing.","zh":"这段祷文使用了旧式敬礼文献中常见的“Deipara”用语。"}]}],"synonyms":["Mother of God","Theotokos","Virgin Mary (as a title)"],"phonetic":"/diˈaɪpərə/","extraExplanation":["“Deipara”来自拉丁语：Dei（= of God，上帝的）+ para（= bearing/bringing forth，生育、孕育），字面意思是“生育上帝者”。它常见于拉丁礼仪文本或学术写作中；在英语里更常用的对应说法是“Mother of God”或希腊语来源的“Theotokos”。","该称号与基督论讨论有关：强调耶稣既是完全的神也是真正的人，因此玛利亚可被称为“上帝之母”（指她所生的耶稣的位格，而非玛利亚是上帝的来源）。"]}
{"word":"deiparous","summary":{"en":"Deiparous describes animals that give birth in the daytime.","zh":"Deiparous 指动物在白天分娩。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of an animal) giving birth during the daytime.","zh":"（动物）在白天分娩的。"},"examples":[{"en":"Rabbits are often described as deiparous because they tend to give birth in daylight hours.","zh":"兔子常被描述为 deiparous（白天分娩的），因为它们往往在白天生产。"},{"en":"The researcher compared deiparous species with noctiparous ones to see how light affects birth behavior.","zh":"研究者比较了白天分娩的物种与夜间分娩的物种，以观察光照如何影响分娩行为。"}]}],"synonyms":["day-birthing (informal)","giving birth during the day"],"phonetic":"/daɪˈepərəs/","extraExplanation":["这是一个较少见、偏动物学/生物学语境的词，来自拉丁语词根：*dies*（白天）+ *parere*（生育、产出）。","常用来与 **noctiparous**（夜间分娩的）对比。日常英语里更常见的表达是 “give birth during the day / in daylight hours”。"]}
{"word":"Deiphilus","summary":{"en":"Deiphilus is a rare classical proper name (Greek/Latin), used in ancient texts for minor figures; its exact reference depends on the source.","zh":"Deiphilus 是一个罕见的古典人名（希腊/拉丁传统），在古代文本中多用于小人物；具体指谁取决于文献来源。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare masculine proper name of Greek/Latin origin, found mainly in classical (ancient Greek and Roman) texts.","zh":"一个较罕见的男性专有名词（人名），源自希腊/拉丁传统，主要见于古典（古希腊与古罗马）文献。"},"examples":[{"en":"In the genealogy, Deiphilus is listed among the lesser-known figures of the myth.","zh":"在这份谱系中，Deiphilus 被列为神话中较不知名的人物之一。"},{"en":"The translator notes that Deiphilus is a personal name rather than a descriptive word.","zh":"译者注释说，Deiphilus 是人名，而不是描述性的普通词汇。"}]},{"partOfSpeech":"other","definition":{"en":"In mythology and ancient history, a name that may refer to more than one minor character depending on the source (different authors may use it for different individuals).","zh":"在神话与古代史叙述中，该名字可能指向不止一位小人物，具体所指会因不同文献来源而异（不同作者可能用它称呼不同的人）。"},"examples":[{"en":"Don’t assume Deiphilus is the same person across texts; check the author and context.","zh":"不要以为不同文本中的 Deiphilus 一定是同一个人；要核对作者与上下文。"},{"en":"Some editions include a footnote to distinguish Deiphilus from similarly named figures.","zh":"有些版本会用脚注把 Deiphilus 与名字相近的人物区分开来。"}]}],"synonyms":["Deiphilos","Deiphilus (variant spellings)","Deiphobus (similar-looking name, different figure)"],"phonetic":"/deɪˈɪfələs/","extraExplanation":["这种名字常见于“希腊名→拉丁化拼写”的传抄传统：同一个希腊名在不同手稿、不同译本里可能出现细微拼写差异。","词源上常被解释为由表示“神/宙斯（Dei-）”与表示“爱、友爱（-philus，类似 philosophy 里的 -phil-）”构成，整体可理解为“敬神的 / 为神所爱的”。具体词源分析会因学者与拼写形式而略有不同。"]}
{"word":"Deiphobe","summary":{"en":"Deiphobe means a person who is afraid of God or gods.","zh":"Deiphobe 指“惧神者”，即害怕上帝或诸神的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who has an intense fear of God or gods; someone with deiphobia","zh":"惧神者；对上帝或诸神有强烈恐惧的人（惧神症患者）"},"examples":[{"en":"After a terrifying childhood sermon, he described himself as a deiphobe.","zh":"经历了一场令人恐惧的童年布道后，他形容自己是个惧神者。"},{"en":"The novel’s narrator is a deiphobe who avoids churches and religious talk.","zh":"小说的叙述者惧神，刻意回避教堂和宗教话题。"}]}],"synonyms":["deiphobic person","person with deiphobia"],"phonetic":"/ˈdeɪ.əˌfoʊb/","extraExplanation":["这是一个非常少见的词，多见于讨论“deiphobia（惧神症）”时的衍生用法。构词上由“-phobe（恐惧者）”组成，前半部分“dei-”指与“神/上帝”相关（可联想 deity=神祇）。","不要把 deiphobe（怕神/怕宗教对象）和 atheism（无神论，立场/信念）混为一谈：前者是“恐惧”，后者是“信仰立场”，不一定包含害怕。"]}
{"word":"Deiphobus","summary":{"en":"Deiphobus: a Trojan prince in Greek mythology, later Helen’s husband, killed when Troy fell.","zh":"Deiphobus（狄福玻斯）：希腊神话中的特洛伊王子，后来成为海伦的丈夫，特洛伊陷落时被杀。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, a Trojan prince (son of King Priam and Hecuba) who became Helen’s husband after Paris died and was later killed during the fall of Troy.","zh":"在希腊神话中，特洛伊王子（普里阿摩斯与赫卡柏之子）。帕里斯死后他娶了海伦，特洛伊陷落时被杀。"},"examples":[{"en":"After Paris’s death, Helen was said to have been married to Deiphobus.","zh":"据说帕里斯死后，海伦改嫁给了狄福玻斯（Deiphobus）。"},{"en":"In the Aeneid, Aeneas meets the ghost of Deiphobus in the Underworld.","zh":"在《埃涅阿斯纪》中，埃涅阿斯在冥界遇见了狄福玻斯的亡魂。"}]}],"synonyms":["Trojan prince (as a description)","Priam’s son (as a description)"],"phonetic":"/deɪˈɪfəbəs/","extraExplanation":["Deiphobus 常见于拉丁史诗《埃涅阿斯纪》（维吉尔）与特洛伊战争相关叙事中。他的故事常用来表现“战争末期的背叛、毁灭与悲剧”。","在一些版本里，海伦被描写为为了自保而转向希腊人，间接导致 Deiphobus 的死亡；不同作品对海伦的动机与责任有不同解读。"]}
{"word":"deiphobus","summary":{"en":"Deiphobus is a Trojan prince in Greek mythology, linked with Helen after Paris’s death and killed in the fall of Troy in many versions.","zh":"Deiphobus 是希腊神话中的特洛伊王子，帕里斯死后与海伦相关联，并在许多版本中死于特洛伊的陷落。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, a Trojan prince (son of King Priam and Hecuba). After Paris died, Deiphobus married Helen; in many versions he was killed during the fall of Troy.","zh":"（希腊神话）特洛伊王子（普里阿摩斯与赫卡柏之子）。帕里斯死后，狄伊福玻斯娶了海伦；在许多版本中，他在特洛伊沦陷时被杀。"},"examples":[{"en":"In the story of Troy, Deiphobus becomes connected to Helen after Paris’s death.","zh":"在特洛伊的故事里，帕里斯死后，狄伊福玻斯与海伦产生了关联。"},{"en":"Virgil’s *Aeneid* shows Deiphobus as a tragic figure marked by the violence of the war.","zh":"维吉尔的《埃涅阿斯纪》把狄伊福玻斯写成一个带有战争悲剧色彩的人物。"}]}],"synonyms":["(no direct synonyms; related names: Priam, Hecuba, Paris, Helen, Aeneas)"],"phonetic":"/diˈɪfəbəs/","extraExplanation":["“Deiphobus”常见于古典文学与神话改写作品中，尤其是拉丁史诗《埃涅阿斯纪》（*Aeneid*）第六卷：埃涅阿斯在冥界遇到死后的狄伊福玻斯，体现特洛伊战争的残酷与背叛主题。","中文也常译作“狄伊福玻斯 / 德伊福波斯”等，属于专有名词，大小写通常为 Deiphobus。"]}
{"word":"Deiphontes","summary":{"en":"Deiphontes is a Greek mythological hero, one of the descendants of Heracles, often linked to Argos and the Dorian ‘return of the Heraclids.’","zh":"Deiphontes是希腊神话中的英雄人物，属于赫拉克勒斯后裔，常与阿尔戈斯以及“赫拉克勒斯子孙归来”的多利亚传统相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) A legendary hero of the Heracleidae (descendants of Heracles), best known as the husband of Hyrnetho and a leader in the return of the Heraclids to the Peloponnese.","zh":"（希腊神话）赫拉克勒斯后裔（Heracleidae）中的传奇英雄，以赫尔涅托（Hyrnetho）的丈夫以及率领“赫拉克勒斯子孙归来”（Heraclids’ return）进入伯罗奔尼撒而闻名。"},"examples":[{"en":"In Greek myth, Deiphontes is often listed among the Heracleidae who reclaimed their ancestral lands.","zh":"在希腊神话中，Deiphontes常被列为夺回祖先土地的赫拉克勒斯后裔之一。"},{"en":"Some versions say Deiphontes married Hyrnetho, linking him to the royal line of Argos.","zh":"有些版本说Deiphontes娶了赫尔涅托，使他与阿尔戈斯王室血统相连。"}]},{"partOfSpeech":"n.","definition":{"en":"A name used in later retellings and classical references to refer to a heroic Argive/Spartan-associated figure connected with early Dorian leadership traditions.","zh":"在后世转述与古典文献中使用的名字，指与早期多利亚人（Dorian）领导传统相关、并与阿尔戈斯/斯巴达叙事相连的英雄人物。"},"examples":[{"en":"The historian compared Deiphontes to other founders in Dorian tradition.","zh":"那位历史学家把Deiphontes与多利亚传统中的其他开国人物作比较。"}]}],"synonyms":["Deïphontes"],"phonetic":"/deɪˈɪfɑnˌtiːz/","extraExplanation":["Deiphontes（也常见拼写 Deïphontes）属于“神话人物名”而非日常词汇，通常出现在古希腊谱系传说、城邦起源故事与对“多利亚人进入伯罗奔尼撒”的叙事里。","在部分故事中，他与妻子 Hyrnetho 的情节带有家族权力斗争与城邦正统性的意味：神话常用婚姻与血缘来解释“谁有资格统治”。"]}
{"word":"deipnodiplomatic","summary":{"en":"Deipnodiplomatic describes diplomacy done through formal dinners or banquets.","zh":"deipnodiplomatic 指通过正式晚宴或宴会来进行的外交（宴会/餐桌外交）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to diplomacy carried out through formal dinners, banquets, or shared meals (using hospitality to build relationships and negotiate).","zh":"与“宴会外交/餐桌外交”有关的；指通过正式晚宴、宴会或共进餐来进行外交沟通与谈判的。"},"examples":[{"en":"The summit included several deipnodiplomatic events designed to ease tensions.","zh":"这次峰会安排了几场宴会外交活动，旨在缓和紧张关系。"},{"en":"She was skilled at deipnodiplomatic conversation, keeping talks friendly while moving toward agreement.","zh":"她很擅长餐桌外交式的谈话：既保持友好气氛，又能推进达成共识。"}]}],"synonyms":["dinner-diplomatic","banquet-related","hospitality-based diplomatic","table diplomacy (related)"],"phonetic":"/ˌdaɪpnoʊˌdɪpləˈmætɪk/","extraExplanation":["词源上可拆为希腊语 deipnon（“晚餐”）+ diplomatic（“外交的”）。它是相对少见、较书面/幽默色彩的词，常用来强调“通过请客吃饭来建立关系、促成谈判”的做法。日常更常见的说法是 dinner diplomacy / banquet diplomacy / table diplomacy（餐桌外交）。"]}
{"word":"deipnophobia","summary":{"en":"Deipnophobia means a strong fear or anxiety about dinner parties or social dining.","zh":"deipnophobia 指对晚宴或社交用餐场合的强烈恐惧/焦虑。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An intense fear or anxiety about dinner parties or social dining situations (especially having to talk while eating).","zh":"对晚宴/聚餐等社交用餐场合的强烈恐惧或焦虑（尤其是边吃边聊天的压力）。"},"examples":[{"en":"Because of her deipnophobia, she avoids dinner parties and prefers to eat alone.","zh":"因为有社交用餐恐惧症，她会避开晚宴，更喜欢独自吃饭。"},{"en":"His deipnophobia isn’t about the food—it’s about the small talk at the table.","zh":"他的社交用餐恐惧症并不是怕食物，而是害怕餐桌上的寒暄聊天。"}]}],"synonyms":["social anxiety","fear of dinner parties","anxiety about eating with others"],"phonetic":"/ˌdeɪpnoʊˈfoʊbiə/","extraExplanation":["词源来自希腊语：deipnon（晚餐）+ phobia（恐惧）。它常被用来描述对“餐桌社交”本身的焦虑，而不一定是对食物或进食的恐惧。","在日常英语中，这个词比较少见；更常用的表达是 “social anxiety at dinner parties / anxiety about eating with others（在聚餐时的社交焦虑/与人一起吃饭的焦虑）”。"]}
{"word":"deipnosophism","summary":{"en":"Deipnosophism means learned, witty conversation at a meal—classic “dinner-table talk.”","zh":"Deipnosophism 指在用餐时进行博学机智的谈话，即典型的“餐桌高质量聊天”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the practice or art of learned conversation at a meal; especially clever or scholarly “dinner-table talk.”","zh":"（尤指在宴席上）进行博学而机智的谈话的做法或技巧；学者式的“餐桌谈话”。"},"examples":[{"en":"The professor’s parties were famous for deipnosophism—every course came with a lively debate.","zh":"那位教授的聚会以 deipnosophism 闻名——每道菜都伴随着热烈的讨论。"},{"en":"She enjoys deipnosophism, but she makes sure quieter guests also get a chance to speak.","zh":"她喜欢餐桌上的博学对谈，但也会确保比较安静的客人有机会发言。"}]}],"synonyms":["table talk","dinner conversation","learned discourse","witty banter"],"phonetic":"/daɪˈnɑːsəˌfɪzəm/","extraExplanation":["这个词很罕见，源自希腊语：deipnon（宴席、晚餐）+ sophistes（智者、学者）。它让人联想到古希腊作家雅典奈奥斯（Athenaeus）的作品《Deipnosophistae》（常译《宴饮智者谈》），记录了一群“宴席上的智者”边吃边谈文学、历史与轶事。现代英语中多用于带点书卷气或幽默的语境，形容“高质量的餐桌聊天”。"]}
{"word":"deipnosophist","summary":{"en":"A deipnosophist is a witty, skilled conversationalist at the dinner table.","zh":"deipnosophist 指在宴席或餐桌上特别善谈、机智对话的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is skilled at conversation during a meal; a witty “table talker.”","zh":"善于在餐桌上谈吐、在宴席间进行机智对话的人；“餐桌健谈者”。"},"examples":[{"en":"At dinner parties, she becomes a true deipnosophist, turning small talk into lively debate.","zh":"在晚宴聚会上，她简直就是个典型的 deipnosophist，把闲聊变成了热烈的讨论。"},{"en":"The host invited a few deipnosophists to keep the conversation flowing between courses.","zh":"主人邀请了几位善于餐桌交谈的人，好让每道菜之间的聊天都不断场。"}]}],"synonyms":["conversationalist","wit","table talker"],"phonetic":"/daɪpˈnɑːsəfɪst/","extraExplanation":["这个词源自希腊语：deipnon（宴席/晚餐）+ sophistes（智者/善辩者）。它常让人联想到古希腊罗马那种“边吃边聊、以谈助兴”的宴会文化。","著名关联：古希腊作家雅典奈乌斯（Athenaeus）写过《Deipnosophistae》（常译《宴会智者/宴会谈客》），以宴饮对话的形式谈论文学、饮食与风俗，因此该词带有一点书卷气、偏文学或学术语境。"]}
{"word":"deipnosophistic","summary":{"en":"An uncommon adjective meaning “related to learned, witty dinner-table talk.”","zh":"一个少见的形容词，意思是“与饭桌上的博学机智谈话有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to learned, witty conversation at a dinner table; like the talk of a “deipnosophist” (a person who shows off knowledge while dining).","zh":"与“宴饮博学之士”的谈话风格有关；指在饭桌上进行博学、机智（有时带点炫耀）的谈话。"},"examples":[{"en":"The professor’s deipnosophistic remarks turned a simple meal into a seminar.","zh":"这位教授带着“宴饮博学式”的评论，把一顿简单的饭变成了研讨课。"},{"en":"They loved the deipnosophistic atmosphere of the supper club—books, history, and jokes over wine.","zh":"他们喜欢那家晚餐俱乐部“宴饮博学式”的氛围——葡萄酒配书本、历史和笑话。"}]}],"synonyms":["erudite","learned","witty","scholarly"],"phonetic":"/ˌdaɪpnoʊsəˈfɪstɪk/","extraExplanation":["该词源自希腊语：deipnon（宴席、晚餐）+ sophistes（智者、学者）。它常让人联想到雅典奈乌斯（Athenaeus）的古典著作《Deipnosophistae（宴饮智者录）》：一群人在宴会上谈论文学、哲学、美食等。现代英语中这个形容词非常罕见，多用于学术或幽默语境。"]}
{"word":"deipotent","summary":{"en":"Deipotent means “godlike in power,” a rare literary word similar to “omnipotent.”","zh":"deipotent 指“像神一样全能”，是很少见的文学用词，近义于 omnipotent（全能的）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) having the power of a god; omnipotent, godlike in power.","zh":"（罕见）具有神一般的力量；全能的；神力无边的。"},"examples":[{"en":"In the epic poem, the hero challenges a deipotent ruler who seems impossible to defeat.","zh":"在史诗诗歌中，英雄挑战一位近乎全能的统治者，看似不可战胜。"},{"en":"Some myths describe the sky as a deipotent force that controls fate.","zh":"一些神话把天空描写成一种全能的力量，支配命运。"}]}],"synonyms":["omnipotent","all-powerful","godlike","almighty"],"phonetic":"/diˈaɪpətənt/","extraExplanation":["这是一个非常书面、古风的词，现代日常英语里几乎不用。更常见的表达是 omnipotent（全能的）或 all-powerful（无所不能的）。","词源上由拉丁语 deus（神）+ potens（有力的）构成，字面意思就是“像神一样有力量”。在文学、神话评论或宗教风格写作中偶尔会出现，用来强调“超越常人的绝对力量”。"]}
{"word":"Deipyle","summary":{"en":"Deipyle is a female figure in Greek mythology, known as Adrastus’s daughter and the wife of Tydeus, mother of Diomedes.","zh":"Deipyle 是希腊神话中的女性人物，常被描述为阿德拉斯托斯之女、堤丢斯之妻、狄俄墨得斯之母。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) The daughter of Adrastus, king of Argos; wife of the hero Tydeus and mother of Diomedes.","zh":"（希腊神话）阿尔戈斯国王阿德拉斯托斯（Adrastus）的女儿；英雄堤丢斯（Tydeus）的妻子、狄俄墨得斯（Diomedes）的母亲。"},"examples":[{"en":"In some retellings of Greek myth, Deipyle marries Tydeus and later becomes the mother of Diomedes.","zh":"在一些希腊神话的改写版本中，Deipyle 嫁给堤丢斯，后来成为狄俄墨得斯的母亲。"},{"en":"The story connects Deipyle to the royal house of Argos through her father Adrastus.","zh":"这个故事通过她的父亲阿德拉斯托斯，把 Deipyle 与阿尔戈斯王室联系起来。"}]}],"synonyms":["Deiphyle","Deipylē"],"phonetic":"/ˈdaɪpaɪli/","extraExplanation":["Deipyle 是英文转写名，也常见拼写变体如 Deiphyle、Deipylē（更接近希腊文形式）。不同版本的神话谱系细节可能略有差异，但“阿德拉斯托斯之女、堤丢斯之妻、狄俄墨得斯之母”是最常见的身份组合。"]}
{"word":"Deipylus","summary":{"en":"Deipylus is a rare proper name from Greek myth/epic, usually a minor warrior figure in Homeric tradition.","zh":"Deipylus 是一个罕见的希腊神话/史诗专名，通常指荷马传统中一位较不重要的战士。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper name) A minor figure in Greek myth and epic—most commonly listed among the warriors mentioned in Homeric tradition (especially in or around the world of the *Iliad*).","zh":"（专有名词）希腊神话与史诗中的小人物名号；常见于荷马传统（尤其与《伊利亚特》的战争人物谱系相关）的战士名单之中。"},"examples":[{"en":"Deipylus is a minor name that appears in lists of warriors in Greek epic tradition.","zh":"Deipylus 是希腊史诗传统中常见于战士名录里的小角色名字。"},{"en":"In some retellings inspired by Homer, Deipylus is mentioned briefly and then disappears from the story.","zh":"在一些受荷马史诗启发的改写版本里，Deipylus 往往一笔带过，随后就不再出现。"}]}],"synonyms":["Deipylos","Deïpylus"],"phonetic":"/deɪˈɪpələs/","extraExplanation":["这是一个较罕见的古希腊人名，英语里多作为经典文献（如荷马史诗）译名出现，而不是日常词汇。不同译本可能会出现拼写差异（如 Deipylos、Deïpylus），属于转写习惯不同所致。","古希腊人名常由词根组合而来；不过此名并非现代英语常用词，因此学习时更应把它当作“文学/神话专名”，重点在于识别其出自希腊史诗语境。"]}
{"word":"Deirdra","summary":{"en":"Deirdra is a female given name, commonly used as a variant spelling of Deirdre, a name with Irish cultural associations.","zh":"Deirdra 是一个女性名字，常见为 Deirdre 的变体拼写，并带有爱尔兰文化背景的联想。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A female given name; a variant spelling of Deirdre.","zh":"女性名字；Deirdre 的一种拼写变体。"},"examples":[{"en":"Deirdra introduced herself at the meeting.","zh":"Deirdra 在会议上做了自我介绍。"},{"en":"I’m meeting Deirdra for coffee after class.","zh":"我下课后要和 Deirdra 去喝咖啡。"}]},{"partOfSpeech":"other","definition":{"en":"In Irish cultural context, connected to the legendary figure Deirdre (often spelled Deirdre), a tragic heroine in Gaelic storytelling.","zh":"在爱尔兰文化语境中，与盖尔/爱尔兰传说中的悲剧女主角 Deirdre（常见拼写为 Deirdre）有关联。"},"examples":[{"en":"The play references Deirdre, a tragic figure from Irish legend.","zh":"这部戏提到了爱尔兰传说中的悲剧人物 Deirdre。"}]}],"synonyms":["Deirdre"],"phonetic":"/ˈdɪrd.rə/","extraExplanation":["“Deirdra”更常被视为“Deirdre”的变体拼写。Deirdre 是一个源自爱尔兰传统的名字，在英语世界里带有浓厚的凯尔特文化色彩。","在爱尔兰传说中最著名的是“Deirdre of the Sorrows（悲伤的黛尔德丽）”，她的故事与爱情、预言与悲剧命运相关，因此这个名字常给人一种古典、诗意又带点忧伤的联想。","使用上它通常是专有名词（人名）。书写时首字母大写：Deirdra。"]}
{"word":"Deirdre","summary":{"en":"Deirdre is an Irish female given name; it can also refer to a famous tragic heroine in Irish legend.","zh":"Deirdre 是一个源自爱尔兰的女性名字；也可指爱尔兰传说中的著名悲剧女主角。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name of Irish origin (a proper name).","zh":"女性名字，源自爱尔兰（专有名词）。"},"examples":[{"en":"Deirdre is starting a new job next week.","zh":"Deirdre 下周开始一份新工作。"},{"en":"I met Deirdre at a conference in Boston.","zh":"我在波士顿的一场会议上认识了 Deirdre。"}]},{"partOfSpeech":"n.","definition":{"en":"(in Irish legend) Deirdre, a tragic heroine best known from the story often called “Deirdre of the Sorrows.”","zh":"（爱尔兰传说）狄尔德丽（Deirdre），以悲剧女主角身份著称，故事常被称为“Deirdre of the Sorrows（悲伤的狄尔德丽）”。"},"examples":[{"en":"In class we read a retelling of Deirdre of the Sorrows.","zh":"课堂上我们读了《Deirdre of the Sorrows》的改写版本。"},{"en":"The play draws on the legend of Deirdre and Naoise.","zh":"这部戏剧取材于 Deirdre 与 Naoise 的传说。"}]}],"phonetic":"/ˈdɪərdrə/","extraExplanation":["“Deirdre”通常读作 /ˈdɪərdrə/（近似“迪尔-德拉”）。这是一个传统的爱尔兰名字，在英语世界里并不算非常常见，但在爱尔兰及受爱尔兰文化影响的地区更常见。","爱尔兰传说中的 Deirdre 是乌利斯特（Ulster）故事群里的重要人物之一：她的美貌与命运引发冲突，常被用来象征“注定的悲剧爱情”。如果你在文学、戏剧或凯尔特神话相关内容中看到 Deirdre，多半指这位人物。"]}
{"word":"deirdre","summary":{"en":"Deirdre is a traditional Irish female name, often linked to a famous tragic figure in Irish legend.","zh":"Deirdre 是一个传统的爱尔兰女性名字，常与爱尔兰传说中的著名悲剧人物相关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a female given name of Irish (Gaelic) origin, associated with a tragic heroine in Irish legend.","zh":"一个源自爱尔兰（盖尔语）的女性名字；常与爱尔兰传说中的悲剧女主角相关联。"},"examples":[{"en":"Deirdre is an Irish name that many people recognize from old legends.","zh":"Deirdre 是一个爱尔兰名字，很多人会从古老传说中认得它。"},{"en":"Deirdre introduced herself as the new manager.","zh":"Deirdre 介绍自己是新来的经理。"}]}],"synonyms":["Deidre (variant spelling)"],"phonetic":"/ˈdɪərdrə/","extraExplanation":["Deirdre 常被认为来自古爱尔兰语，常见解释是与“悲伤、哀愁（sorrow）”相关，因此在英语文化里有时会让人联想到一种带有悲剧色彩的古典感。","在爱尔兰神话故事《Deirdre of the Sorrows》（常译《哀伤的黛尔德丽/悲伤的狄尔德丽》）中，Deirdre 是一位美丽却命运悲惨的女子，这使得这个名字带有“传奇、宿命、悲剧美”的文化联想。","英语里这个名字有多种读法与拼写变体（如 Deidre），但 Deirdre 是更传统、更接近爱尔兰拼写的形式。"]}
{"word":"deirid","summary":{"en":"“deirid” is not a standard English word; it may be a misspelling or a proper name.","zh":"“deirid”不是标准英文单词，可能是拼写错误或专有名词。"},"extraExplanation":["“deirid” 不是常见的英文单词，词典里通常查不到。它更像是拼写错误或专有名词（人名/地名）的变体。","你可能想写的是：\n1) **Deirdre**（常见人名，源自爱尔兰语；英文里也常见）\n2) **dried**（“干的/晒干的”，形容词/过去分词；与 deirid 字母顺序接近）\n3) **dear**（“亲爱的/昂贵的”，更短但可能是输入法误差）","请告诉我：你是在什么句子/语境里看到“deirid”的？或你想查的是哪个更接近的拼写（Deirdre / dried / dear 等）？我可以按正确词条给你发音、释义和例句。"]}
{"word":"deis","summary":{"en":"DEIS is an organizational acronym related to diversity, equity, and inclusion; the “S” depends on the institution.","zh":"DEIS 多为机构缩写，通常与“多元、公平、包容”相关；其中的 S 具体含义因机构而异。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An acronym used in some organizations (especially schools, universities, and workplaces) for a department or set of initiatives related to diversity, equity, and inclusion, with the final “S” varying by context (often “student success,” “strategy,” or “services”).","zh":"一些组织（尤其是学校、大学和职场）使用的缩写，指与“多元（diversity）、公平（equity）、包容（inclusion）”相关的部门或项目；末尾的 S 在不同机构中含义不一，常见为“学生成功（student success）”“策略（strategy）”或“服务（services）”。"},"examples":[{"en":"The DEIS office runs workshops on inclusive language and accessibility.","zh":"DEIS 办公室会举办有关包容性语言与无障碍的培训。"},{"en":"I emailed DEIS to ask about support for first-generation students.","zh":"我给 DEIS 发邮件，询问对第一代大学生的支持。"}]}],"synonyms":["DEI","DEIA","DEIB"],"phonetic":"/ˌdiː.aɪˈɛs/","extraExplanation":["“DEIS”不是英语里固定、通用的单词，更像是机构内部用的缩写。不同学校/公司对最后一个字母 S 的解释可能不同；如果你告诉我它出现的句子或机构全称，我可以帮你准确对应含义。","如果你本来想查的是“dies”（die 的第三人称单数/复数名词“模具”）或“deist”（自然神论者），也可以把原句发来，我会按正确词条解释。"]}
{"word":"deiseal","summary":{"en":"Diesel is a fuel (and also the engine that uses it) commonly used in heavy vehicles and some cars.","zh":"Diesel 指“柴油”，也可指“柴油发动机”，常用于重型车辆和部分汽车。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of fuel made from petroleum, used especially in trucks, buses, trains, and some cars","zh":"柴油；一种从石油提炼的燃料，常用于卡车、公交车、火车和部分汽车"},"examples":[{"en":"This truck runs on diesel fuel.","zh":"这辆卡车使用柴油。"},{"en":"Diesel is often used for long-distance transport because engines can be efficient.","zh":"柴油常用于长途运输，因为柴油发动机可能更省油。"}]},{"partOfSpeech":"n.","definition":{"en":"a diesel engine (an engine that uses diesel fuel and ignites it by compression, not by a spark plug)","zh":"柴油发动机（用压缩点火而不是火花塞点火的发动机）"},"examples":[{"en":"The ship has a powerful diesel.","zh":"这艘船装有一台强劲的柴油发动机。"}]},{"partOfSpeech":"v.","definition":{"en":"to power or operate with a diesel engine or diesel fuel","zh":"用柴油发动机驱动；用柴油供能"},"examples":[{"en":"Some older locomotives were dieselled rather than electrified.","zh":"一些较老的机车使用柴油动力，而不是电力。"}]}],"synonyms":["diesel fuel","gas oil"],"phonetic":"/ˈdiːzəl/","extraExplanation":["你输入的“deiseal”常见于把“diesel”拼错。正确拼写是 diesel。","Diesel 这个词来自德国工程师 Rudolf Diesel（鲁道夫·狄塞尔）的姓氏，他在19世纪末研发了柴油发动机。"]}
{"word":"deisidaimonia","summary":{"en":"Deisidaimonia is a rare Greek-derived noun meaning “superstition,” especially an anxious, excessive fear of divine powers or omens.","zh":"Deisidaimonia 是一个源自古希腊语的罕见名词，主要指“迷信”，尤指对神灵或征兆的过度焦虑与恐惧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"superstition; an excessive or fearful belief in divine powers, omens, or spirits (often implying irrational religious anxiety)","zh":"迷信；对神灵、征兆或鬼魂等的过度畏惧或盲信（常带有不理性的宗教焦虑之意）"},"examples":[{"en":"Some ancient writers criticized deisidaimonia as a kind of anxious superstition rather than true piety.","zh":"一些古代作家批评 deisidaimonia，认为它是一种焦虑的迷信，而不是真正的虔敬。"},{"en":"He tried to replace deisidaimonia with a calmer respect for the gods.","zh":"他试图用更平和的敬神态度取代 deisidaimonia。"}]}],"synonyms":["superstition","irrational fear","religious anxiety"],"phonetic":"/ˌdeɪsɪdaɪˈmoʊniə/","extraExplanation":["该词源自古希腊语：deisi-（“恐惧/敬畏”）+ daimōn（“神灵、灵体”）。在古希腊语境里，它常带贬义，强调“过度恐惧神灵、动辄担忧触怒超自然力量”的心理状态。","在《使徒行传》17:22 中，保罗对雅典人说的希腊词常被认为与此相关，有的英文译为 “very religious”，也有人译为 “superstitious”。这体现了该词在不同语境中可能在“虔诚”与“迷信”之间摇摆，但在古典作者笔下更常偏向“迷信”。","英语中该词非常罕见，更多出现在古典学、神学、哲学史讨论里；日常表达通常用 superstition / superstitious fear。"]}
{"word":"deisin","summary":{"en":"“Design” means a plan or style for how something looks/works, or the act of creating that plan/style.","zh":"“design”既可指“设计/图样/风格”，也可指“设计、规划、构思并制作”的动作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plan, drawing, or idea for how something will look or work; the style or arrangement of something","zh":"设计；图样；构思；（事物的）外观与结构/布局"},"examples":[{"en":"The design of this website is simple and clean.","zh":"这个网站的设计简洁清爽。"},{"en":"The engineer showed us the new bridge design.","zh":"工程师给我们展示了新桥梁的设计图。"},{"en":"I love the design on your T-shirt.","zh":"我很喜欢你T恤上的图案设计。"}]},{"partOfSpeech":"vt.","definition":{"en":"to plan and make something for a specific purpose; to create the look or structure of something","zh":"设计；规划；构思并制作（为特定用途）"},"examples":[{"en":"She designs apps for language learners.","zh":"她为语言学习者设计应用程序。"},{"en":"They designed the room to feel warm and welcoming.","zh":"他们把这个房间设计得温暖又有亲和力。"}]}],"synonyms":["plan","layout","style","create","develop"],"phonetic":"/dɪˈzaɪn/","extraExplanation":["你输入的“deisin”不是常见英语单词，最可能是拼写错误，通常想表达的是“design”。“design”中的字母组合“gn”不发 /g/，结尾发 /n/ 音，这也是常见拼写难点。"]}
{"word":"deism","summary":{"en":"Deism is the belief in a creator who made the universe but does not intervene, emphasizing reason over revelation.","zh":"自然神论指相信造物主创造宇宙但不再干预世界，强调理性而非启示。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A belief that God (or a creator) exists and created the universe, but does not intervene in the world through miracles, revelations, or ongoing supernatural actions; it often emphasizes reason and observation over religious authority.","zh":"自然神论：相信上帝（或造物主）存在并创造了宇宙，但之后不再以神迹、启示或持续的超自然方式干预世界；常强调理性与观察，而非宗教权威。"},"examples":[{"en":"Some Enlightenment thinkers supported deism because it fit their focus on reason and natural laws.","zh":"一些启蒙时代思想家支持自然神论，因为它符合他们对理性与自然法则的重视。"},{"en":"Her deism led her to believe in a creator but not in miracles.","zh":"她的自然神论让她相信有造物主，但不相信神迹。"}]}],"synonyms":["natural religion","belief in a non-interventionist creator"],"phonetic":"/ˈdiːɪzəm/","extraExplanation":["自然神论常与“theism（有神论）”和“atheism（无神论）”对比：有神论通常相信神会介入世界（如祈祷回应、神迹），无神论否认神的存在；自然神论介于两者之间，承认造物主但强调宇宙按自然规律运行。","在英语语境中，deism 常与 17—18 世纪欧洲与北美的启蒙运动联系在一起；当时一些知识分子认为宗教应与理性、科学相一致。","文学与历史写作里常出现“a deist / deistic ideas”等说法，用来描述某人倾向理性宗教观，而不一定属于某个具体教派。"]}
{"word":"deisms","summary":{"en":"Deism is the belief in a creator who made the universe but does not intervene; “deisms” is the plural form.","zh":"自然神论指相信造物主创造宇宙但不再干预；“deisms”是其复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Deism: the belief that God created the universe but does not intervene in it through miracles or ongoing direct action; it emphasizes reason and observation over revealed religion.","zh":"自然神论：相信上帝创造了宇宙，但之后不再以神迹或持续的直接干预介入世界；强调理性与观察，而不是启示宗教。"},"examples":[{"en":"Some thinkers during the Enlightenment supported deism because it seemed compatible with science and reason.","zh":"启蒙时期的一些思想家支持自然神论，因为它看起来与科学和理性相容。"},{"en":"Her deism led her to believe in a creator, but not in miracles.","zh":"她的自然神论使她相信有造物主，但不相信神迹。"}]},{"partOfSpeech":"n.","definition":{"en":"deisms (plural): different versions or instances of deism, or the general idea of deism mentioned in multiple forms.","zh":"deisms（复数）：不同形式/版本的自然神论，或在讨论中以多种形式提到的自然神论观点。"},"examples":[{"en":"The textbook compares several deisms and explains how they differ from traditional theism.","zh":"这本教材比较了几种自然神论，并解释它们与传统有神论的不同。"}]}],"synonyms":["natural religion","rational religion"],"phonetic":"/ˈdiːɪzəm/","extraExplanation":["“Deism”常与17—18世纪欧洲与北美的启蒙运动联系在一起。当时不少思想家主张用理性理解世界，倾向把上帝看作“第一推动者/制表匠（watchmaker）”：创造并设定自然规律，但不通过神迹改变日常运行。","注意区分：deism（自然神论）与 theism（有神论，通常认为上帝会介入世界）不同；与 atheism（无神论）也不同，因为自然神论仍承认有造物主。"]}
{"word":"deist","summary":{"en":"A deist believes in a creator God based on reason and nature, usually without believing in miracles or ongoing divine intervention.","zh":"deist指自然神论者：基于理性与自然相信有造物主，通常不相信神迹或上帝持续干预人世。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who believes in God based on reason and observation of the natural world, but usually does not believe that God intervenes in daily life or performs miracles","zh":"自然神论者：相信上帝存在，但多基于理性与对自然的观察；通常不相信上帝会在日常生活中干预或施行神迹的人"},"examples":[{"en":"Some Enlightenment thinkers were deists who argued that the universe works like a clock set in motion by God.","zh":"一些启蒙时代思想家是自然神论者，他们认为宇宙像一座被上帝启动后自行运转的钟表。"},{"en":"He describes himself as a deist: he believes in a creator but doesn’t follow an organized religion.","zh":"他称自己是自然神论者：相信有造物主，但不加入或遵从某个宗教组织。"}]}],"synonyms":["deism follower","free-thinker (context-dependent)","rational theist (approx.)"],"phonetic":"/ˈdiːɪst/","extraExplanation":["“deist”来自“deism（自然神论）”。自然神论在17—18世纪欧洲与北美较流行，强调用理性讨论信仰，常与“启蒙运动”相关。","与“theist（有神论者）”相比，deist通常更强调“上帝创造了世界，但不常直接干预”；与“atheist（无神论者）”不同，deist仍相信有造物主。","常见搭配：a deist philosopher（自然神论哲学家）, deist beliefs（自然神论信念）。"]}
{"word":"deistic","summary":{"en":"Deistic means “related to deism,” the belief in a Creator who does not intervene in the world after creating it.","zh":"deistic 指“与自然神论有关的”，即相信有造物主但其创造后不再以神迹等方式直接干预世界。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to deism: the belief that God exists and created the universe but does not intervene in it through miracles or ongoing direct action.","zh":"与“自然神论”有关的：指相信上帝存在并创造宇宙，但之后不再通过奇迹或持续的直接干预来影响世界。"},"examples":[{"en":"Some Enlightenment thinkers held deistic views and emphasized reason over revelation.","zh":"一些启蒙时代思想家持有自然神论（deistic）的观点，强调理性胜过启示。"},{"en":"Her deistic outlook made her skeptical of reports of miracles.","zh":"她的自然神论式（deistic）观念使她对奇迹的报道持怀疑态度。"}]}],"synonyms":["deist","deistical","rationalist (in some contexts)"],"phonetic":"/diˈɪstɪk/","extraExplanation":["“deistic”来自“deism（自然神论）”。自然神论常与17—18世纪欧洲启蒙运动相关：强调理性、自然法则与“造物主”，但通常不接受特定宗教经典的权威或神迹叙事。","学习提示：deistic（自然神论式的）不同于 theistic（有神论的，强调上帝积极介入世界）和 atheistic（无神论的）。日常交流中更常见的名词是 deism；形容词 deistic 多用于学术、历史或宗教哲学语境。"]}
{"word":"deistical","summary":{"en":"Deistical means “related to deism,” a belief in a creator who does not intervene through miracles or revelation.","zh":"deistical 指“与自然神论有关的”：相信有造物主，但不认为其通过神迹或启示持续干预世界。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to deism (the belief that a creator exists but does not intervene in the world through miracles or ongoing revelation).","zh":"与自然神论（deism）有关的；指相信有造物主，但造物主不通过奇迹或持续启示干预世界的观点。"},"examples":[{"en":"Some Enlightenment writers expressed deistical ideas, stressing reason over religious authority.","zh":"一些启蒙时代作家表达了带有自然神论色彩的观点，强调理性而非宗教权威。"},{"en":"His essay takes a deistical view of God as a distant creator.","zh":"他的文章以自然神论的视角看待上帝，把上帝视为遥远的造物主。"}]}],"synonyms":["deist","deistic","deism-related"],"phonetic":"/diˈɪstɪkəl/","extraExplanation":["“deistical”来自“deist”（自然神论者）。自然神论常与18世纪欧洲与北美启蒙运动的思想氛围相关：强调理性、自然法则与观察经验，通常不接受宗教经典中的神迹或特殊启示。","用法提示：它是偏学术/书面语的形容词，常用于宗教学、哲学史或文学评论中。日常对话里更常说“deist / deism”。","不要与“theistic”（有神论的，强调神会介入并与人互动）混淆；自然神论（deism）通常主张“造物主设定规则后不再干预”。"]}
{"word":"deistically","summary":{"en":"“Deistically” means “in a deistic way,” referring to the belief in a creator who does not actively intervene in the world.","zh":"“deistically”意为“以自然神论的方式”，指相信有造物主但其通常不主动干预世界的观点。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to deism (the belief that a creator exists but does not intervene in the world through miracles or ongoing revelation).","zh":"以自然神论（相信有造物主，但认为其不通过神迹或持续启示来干预世界）的方式；从自然神论角度。"},"examples":[{"en":"Some Enlightenment thinkers wrote about God deistically, emphasizing reason over revelation.","zh":"一些启蒙时代思想家以自然神论的方式谈论上帝，强调理性而非启示。"},{"en":"He described the universe deistically—as a system set in motion and then left to run by natural laws.","zh":"他用自然神论来描述宇宙——像被启动后便按自然法则运转的系统。"}]}],"synonyms":["in a deistic way","from a deist perspective","according to deism"],"phonetic":"/diˈɪstɪkli/","extraExplanation":["“deistically”来自“deist（自然神论者）/ deism（自然神论）”。自然神论在17—18世纪欧洲启蒙运动时期较常见，强调理性、自然法则与观察经验；与有神论（常强调神的持续介入）以及无神论（否认神的存在）不同。常见比喻是“钟表匠”：造物主像钟表匠制造并上发条，但不再不断干预。"]}
{"word":"deisticalness","summary":{"en":"Deisticalness means the quality of being deistical—showing belief in or a leaning toward deism.","zh":"Deisticalness 指“自然神论的性质/倾向”，即带有自然神论色彩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being deistical; belief in or tendency toward deism (the idea that God created the world but does not usually intervene through miracles or revelation).","zh":"自然神论的性质或状态；自然神论倾向（认为上帝创造世界，但通常不通过奇迹或启示干预人间）。"},"examples":[{"en":"The essay critiques the deisticalness of Enlightenment thinkers who preferred reason over revealed religion.","zh":"这篇文章批评了启蒙思想家偏重理性、轻视启示宗教的自然神论倾向。"},{"en":"Some readers felt the novel’s deisticalness made its religious message seem distant and impersonal.","zh":"有些读者觉得小说的自然神论色彩让其宗教信息显得疏离而不具人格性。"}]}],"synonyms":["deism","deistic tendency","deistic attitude"],"phonetic":"/diˈɪs.tɪ.kəl.nəs/","extraExplanation":["“deisticalness”非常少见，更常见的说法是“deism（自然神论）”或“deistic tendency/attitude（自然神论倾向）”。","构词：deistic（自然神论的）+ -ness（名词后缀，表示“性质/状态”），因此整体意思就是“具有deistic特征的状态”。","语境提示：在英语历史与文学讨论中，它常与“the Enlightenment（启蒙时代）”“reason vs. revelation（理性 vs. 启示）”等话题一起出现。"]}
{"word":"deists","summary":{"en":"Deists are people who believe God created the universe but does not intervene through miracles or ongoing revelation.","zh":"Deists 指自然神论者：相信上帝创造宇宙，但不通过神迹或持续启示干预世界。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of deist: people who believe in a God who created the universe but does not intervene in it through miracles or ongoing revelation.","zh":"deist（自然神论者）的复数：相信上帝创造了宇宙，但不通过神迹或持续启示来干预世界的人。"},"examples":[{"en":"Some historians describe a few Enlightenment thinkers as deists.","zh":"一些历史学家把部分启蒙时代思想家描述为自然神论者。"},{"en":"They debated whether the Founders were deists or orthodox Christians.","zh":"他们讨论开国元勋究竟是自然神论者还是正统基督徒。"},{"en":"Deists often argue that reason and observation are enough to know that a creator exists.","zh":"自然神论者常主张：只靠理性与观察就足以知道有一位造物主存在。"}]}],"synonyms":["freethinkers","rationalists"],"phonetic":"/ˈdiːɪsts/","extraExplanation":["“Deism（自然神论）”在17—18世纪欧洲启蒙运动时期较常见，强调理性与自然规律，通常不接受“上帝持续通过神迹介入”或“特定经典是唯一权威启示”这一类观念。","在英语文化语境里，deist 与 theist（有神论者）、atheist（无神论者）常被放在一起对比；但“deist”并不等同于“无宗教者”，而是一种关于上帝与世界关系的立场。"]}
{"word":"deitate","summary":{"en":"Deitate means to deify—making someone/something godlike or worshipping them as a god; it’s archaic and mostly literary.","zh":"deitate 意为“神化/奉为神”，多见于古旧或文学语境，现代更常用 deify。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone or something into a god; to treat someone as if they were a god (archaic/literary)","zh":"使（某人/某物）神化、奉为神；把……当作神来崇拜（古旧/文学用语）"},"examples":[{"en":"Some poets deitate nature, speaking of rivers and mountains as if they were divine.","zh":"有些诗人会把自然神化，把河流和群山写得仿佛具有神性。"},{"en":"The leader was deitated by his followers, who refused to question him.","zh":"这位领袖被追随者神化了，他们拒绝对他提出质疑。"}]}],"synonyms":["deify","divinize","idolize"],"phonetic":"/ˈdiːɪteɪt/","extraExplanation":["这是一个较罕见、偏古典/文学的动词，现代英语更常用 deify（神化、奉为神）。","词源可追溯到拉丁语 deitas（“神性、神格”）相关词根，含义与“赋予神性”相近。使用时常带有批评或讽刺色彩，强调“过度崇拜/把人捧成神”。"]}
{"word":"deities","summary":{"en":"“Deities” is the plural of “deity,” meaning gods or goddesses worshiped in religion or mythology.","zh":"“deities”是“deity”的复数，指宗教或神话中的诸神/神祇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a god or goddess; a divine being worshiped in a religion or myth","zh":"神；神祇（宗教或神话中被崇拜的神灵）"},"examples":[{"en":"In Greek mythology, Zeus is one of the most powerful deities.","zh":"在希腊神话中，宙斯是最强大的神祇之一。"},{"en":"Many ancient cultures believed different deities controlled the sea, the sun, and the harvest.","zh":"许多古代文化相信，不同的神祇掌管海洋、太阳和收成。"}]}],"synonyms":["gods","godheads","divinities"],"phonetic":"/ˈdiː.ə.tiz/","extraExplanation":["“deity”源自拉丁语 *deus*（神）。在英语里，“deity”比较正式，常用于宗教研究、历史、文学或神话语境。","“deities”是复数形式。注意区分：很多宗教是多神信仰（polytheism，多个deities），而一神信仰（monotheism）通常说“God”（大写）而不常说“a deity”。"]}
{"word":"deity","summary":{"en":"A deity is a god or goddess, or (figuratively) someone/something treated as godlike.","zh":"deity 指“神祇（男神或女神）”，也可比喻“被奉若神明的人或事物”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a god or goddess; a divine being worshiped in a religion","zh":"神；神祇；被宗教崇拜的神圣存在（男神或女神）"},"examples":[{"en":"In Greek mythology, Zeus is a powerful deity.","zh":"在希腊神话中，宙斯是一位强大的神祇。"},{"en":"Many cultures have more than one deity, each connected to nature or human life.","zh":"许多文化有不止一位神祇，每位都与自然或人类生活的某个方面有关。"}]},{"partOfSpeech":"n.","definition":{"en":"someone or something greatly admired or treated as perfect (often used figuratively)","zh":"（比喻）被极度崇拜的人或事物；被奉若神明的对象"},"examples":[{"en":"For some fans, that singer is a deity.","zh":"对一些粉丝来说，那位歌手简直像神一样被崇拜。"},{"en":"In the company, speed became a kind of deity—everything was sacrificed for it.","zh":"在那家公司里，“速度”成了一种被奉若神明的东西——一切都为它让步。"}]}],"synonyms":["god","goddess","divinity","divine being","idol (figurative)"],"phonetic":"/ˈdiːəti/","extraExplanation":["“deity”较正式，常见于宗教、神话、文学或学术语境；日常口语里更常说“god/goddess”。","在英文里，“God”（大写）常特指一神教中的唯一真神；“a god”或“a deity”更强调“某位神/某种神性存在”，不限定宗教体系。","词源来自拉丁语“deus（神）”，与“divine（神圣的）”“deify（奉为神）”同源。"]}
{"word":"deityship","summary":{"en":"Deityship means the state or status of being a deity (godhood/divinity).","zh":"Deityship 指“神的身份或状态”，即神格/神性（相当于 godhood 或 divinity）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state, rank, or nature of being a deity; godhood; divinity","zh":"神的身份或地位；神性；神格（即“成为神/作为神”的状态）"},"examples":[{"en":"In many myths, a hero earns deityship after completing impossible tasks.","zh":"在许多神话中，英雄完成不可能的任务后会获得神格（被封为神）。"},{"en":"The poem questions whether power alone is enough to claim deityship.","zh":"这首诗质疑：仅凭权力是否就足以自称拥有神格。"}]}],"synonyms":["godhood","divinity","deification","apotheosis"],"phonetic":"/ˈdiː.ə.tiˌʃɪp/","extraExplanation":["“deityship”较少见，更常用的说法是“divinity”或“godhood”。","后缀“-ship”常表示“身份/状态/性质”（如 friendship 友谊、leadership 领导力），所以 deity + -ship 直观含义就是“神的身份/神性”。"]}
{"word":"deixis","summary":{"en":"Deixis is the context-dependent meaning of words like “I,” “here,” and “now.”","zh":"Deixis 指像 “I/这里/现在” 这类必须依赖语境才能确定指向的意义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Linguistics) Words or expressions whose meaning depends on the context of the speaker, time, and place (for example, “I,” “here,” “now,” “this”).","zh":"（语言学）指示现象：某些词或表达的意义必须依赖说话者、时间、地点等语境才能确定（如 I、here、now、this）。"},"examples":[{"en":"In the sentence “I am here now,” the words “I,” “here,” and “now” are examples of deixis.","zh":"在句子 “I am here now”（我现在在这里）中，“I”“here”“now” 都是指示词的例子。"},{"en":"To understand “this book,” you need context: which book is the speaker pointing to?","zh":"要理解 “this book”（这本书），需要语境：说话者指的是哪一本？"},{"en":"Deixis is common in everyday conversation because speakers share a situation.","zh":"指示现象在日常对话中很常见，因为说话者共享同一情境。"}]}],"synonyms":["context-dependent reference","indexicality","indexicals"],"phonetic":"/ˈdaɪksɪs/","extraExplanation":["Deixis 源自希腊语，意为“指向/指示”。它强调语言与情境的关系：同一句话在不同人、不同地点或不同时间说出来，指向的对象会变。","常见类型：人称指示（I/you/we）、空间指示（here/there/this/that）、时间指示（now/then/today）、篇章指示（above/below/this/that 在文本中指代前后内容）、社会指示（sir/ma’am、敬语等体现关系与身份）。","和“anaphora（回指）”有区别：anaphora 主要靠前文确定指代（如 “A dog walked in. It barked.”），而 deixis 更依赖说话当下的情境。"]}
