{"word":"deobstruct","summary":{"en":"“Deobstruct” means to remove something that is blocking a passage or flow.","zh":"“Deobstruct” 指移除阻碍物，使通道或流动恢复畅通。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove an obstruction; to clear a passage, channel, or airway so things can move through","zh":"清除阻塞；疏通通道（如管道、通路或气道），使其恢复畅通"},"examples":[{"en":"Workers deobstructed the drain after the storm.","zh":"暴风雨后，工人把下水道疏通了。"},{"en":"The paramedic tried to deobstruct the patient’s airway.","zh":"急救人员试图清除病人气道的阻塞。"}]}],"synonyms":["unblock","clear","unclog","remove the blockage"],"phonetic":"/ˌdiːəbˈstrʌkt/","extraExplanation":["这个词由前缀 de-（表示“去除、反向”）+ obstruct（阻塞）组成，字面意思就是“去阻塞”。日常英语里更常用 clear, unblock, remove the blockage 等；deobstruct 偏正式/技术语境（例如医疗、工程）。"]}
{"word":"deobstruent","summary":{"en":"Deobstruent means “removing an internal blockage,” and it can describe either a remedy (noun) or its effect (adjective).","zh":"deobstruent 指“解除体内阻塞的”，既可作形容词表示通塞作用，也可作名词指通塞剂。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medicine, old-fashioned) able to remove or reduce an obstruction in the body (such as a blockage in the bowels, blood vessels, or airways).","zh":"（医学，较旧用法）能去除或缓解体内阻塞的；通塞的（如缓解肠道、血管或呼吸道堵塞）。"},"examples":[{"en":"The doctor prescribed an herbal deobstruent to ease the patient’s congestion.","zh":"医生开了一种草药通塞剂来缓解病人的淤堵（如充血、堵塞）。"},{"en":"In older medical writing, certain plants were described as deobstruent remedies.","zh":"在较早的医学著作中，一些植物被描述为具有通塞作用的疗法。"}]},{"partOfSpeech":"n.","definition":{"en":"a medicine or substance thought to remove an internal obstruction.","zh":"通塞剂；被认为能解除体内阻塞的药物或物质。"},"examples":[{"en":"Historical texts list “deobstruents” among common treatments for swelling and blockage.","zh":"历史文献把“通塞剂”列为治疗肿胀和阻塞的常见方法之一。"}]}],"synonyms":["decongestant","unblocking agent","laxative (in some contexts)","remedy"],"phonetic":"/ˌdiːəbˈstruːənt/","extraExplanation":["这个词较少用于现代日常英语，更常见于旧式或历史性的医学语境。现代医学表达里，具体说法通常会用更明确的词，比如 laxative（泻药）、decongestant（减充血药）、thrombolytic（溶栓药）等。","词源上可拆理解读：de-（去除）+ obstruct（阻塞）+ -ent（…的/…剂），字面意思就是“去除阻塞的”。"]}
{"word":"deoccidentalize","summary":{"en":"Deoccidentalize means to make something less shaped by Western influence or less Western-centered.","zh":"deoccidentalize 指“去西方化”，让某事物减少西方影响或不再以西方为中心。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove or reduce Western influence (ideas, culture, styles, institutions) from something; to make something less Western-centered","zh":"去西方化；减少西方影响（思想、文化、风格、制度等）；使某事物不再以西方为中心"},"examples":[{"en":"Some scholars argue that the curriculum should be deoccidentalized to include more local history and voices.","zh":"一些学者认为课程应当去西方化，纳入更多本地历史与声音。"},{"en":"The museum is trying to deoccidentalize its exhibits by changing the labels and adding community perspectives.","zh":"这家博物馆正尝试让展览去西方化，通过更改说明牌并加入社区视角。"},{"en":"They deoccidentalized the design by using regional materials instead of European styles.","zh":"他们通过使用本地区材料而非欧洲风格，让设计去西方化。"}]}],"synonyms":["dewesternize","decolonize","decenter the West","localize"],"phonetic":"/ˌdiː.ɑkˈsɪd.ən.t̬əˌlaɪz/","extraExplanation":["“de-”表示“去除、逆转”，加在“occidental”（西方的）前面形成“deoccidentalize”。该词多见于学术与公共讨论，尤其是后殖民研究、教育改革、文化机构（博物馆/媒体）等语境中，强调减少“以西方为默认标准”的框架。","常与“decolonize（去殖民化）”“dewesternize（去西方化）”相近，但“deoccidentalize”更强调从观念与叙事结构上避免“西方中心主义（Eurocentrism/Western-centrism）”。"]}
{"word":"deoculate","summary":{"en":"“Deoculate” is not a standard English word; it’s likely a misspelling (often of “inoculate”).","zh":"“deoculate”不是标准英语单词；多半是拼写错误（常见为 “inoculate”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most likely a misspelling of another word (commonly “inoculate”).","zh":"不是标准英语单词；很可能是其他单词的拼写错误（最常见是 inoculate）。"},"examples":[{"en":"I can’t find “deoculate” in standard dictionaries—did you mean “inoculate”?","zh":"在常见词典里查不到 “deoculate”，你是不是想写 “inoculate”？"},{"en":"The doctor will inoculate the patient against the flu.","zh":"医生会给病人接种疫苗来预防流感。"}]}],"synonyms":["inoculate (likely intended)"],"phonetic":"/diˈɑkjəˌleɪt/","extraExplanation":["“deoculate”在主流英语词典中基本找不到，通常会被视为拼写错误或极少见的自造词。","如果你想表达“接种疫苗/使免疫”，正确拼写是 inoculate。","如果你能提供一句你看到它的原句/上下文（例如一整句话），我可以更准确判断你想要的词。"]}
{"word":"deodand","summary":{"en":"A historical legal term for an object or animal that caused a death and was confiscated for religious/charitable purposes.","zh":"历史法律术语：指导致死亡的物品或动物，被没收并用于宗教或慈善用途。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical law) An object or animal that caused a person’s death and was therefore forfeited to the Crown (or the church) for religious or charitable purposes.","zh":"（历史法律）“致死物/致死动物”：指造成他人死亡的物品或动物，因此依法被没收并上交王室（或教会），其价值通常用于宗教或慈善用途。"},"examples":[{"en":"In medieval England, a cart that killed a passerby could be declared a deodand and seized.","zh":"在中世纪的英格兰，一辆撞死路人的马车可能会被认定为“致死物”（deodand）并被没收。"},{"en":"The old doctrine of deodand was later replaced by modern ideas of negligence and compensation.","zh":"这种“致死物”旧制度后来被现代的过失责任与赔偿理念所取代。"}]}],"synonyms":["forfeit (historical sense)","confiscated object"],"phonetic":"/ˈdiːoʊdænd/","extraExplanation":["该词来自拉丁语 *deo dandum*，意为“献给上帝的（东西）”。早期观念认为，造成死亡的物品“带有罪责”，应被没收并用于赎罪或慈善。","在英国，deodand制度在19世纪逐渐失去适用，通常被认为在1846年左右通过相关立法而废止。此后死亡事故更多通过侵权法（如过失）与民事赔偿来处理。"]}
{"word":"deodands","summary":{"en":"Deodands are (historically) items or animals that caused a death and were forfeited to the Crown; today the word is mostly used in legal history or rare figurative writing.","zh":"Deodands（deodand 的复数）指（历史上）致人死亡而被依法没收归王室的物品或动物；如今多见于法律史语境，偶尔作比喻用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Historical, British law) An object or animal that caused a person’s death and was legally forfeited to the Crown (often to be used for charitable or “pious” purposes).","zh":"（历史用语，英国法律）导致人死亡的物品或动物，依法被没收归王室（传统上常被用于慈善或“宗教/赎罪”用途）。"},"examples":[{"en":"In medieval English law, a cart that killed someone could be declared a deodand and seized by the Crown.","zh":"在中世纪英国法中，一辆致人死亡的马车可能被认定为 deodand 并被王室没收。"},{"en":"The idea of deodands disappeared as modern safety laws and compensation systems developed.","zh":"随着现代安全法规与赔偿制度的发展，deodand 的做法逐渐消失。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, rare) Something offered up as compensation after a tragic accident; a symbolic “forfeit.”","zh":"（比喻义，少见）悲剧事故后被拿出来当作补偿的东西；象征性的“罚没/赔偿品”。"},"examples":[{"en":"The company’s donation was treated as a kind of deodand after the fatal incident.","zh":"那家公司在致命事件后的捐款被看作一种象征性的 deodand。"}]}],"synonyms":["forfeit (historical sense)","confiscated object","legal forfeiture (related)"],"phonetic":"/ˈdiːoʊdænd/","extraExplanation":["deodand 来自拉丁语 deodandum，意为“献给上帝的东西”。在英格兰旧法中，造成死亡的物体（如车、马、船）可能被没收并用于“赎罪/慈善”。这一制度在 19 世纪逐步被废除（常与工业事故、铁路事故引发的争议有关），后来由更现代的侵权赔偿与安全监管制度取代。"]}
{"word":"deodar","summary":{"en":"Deodar is a Himalayan cedar tree, or something made from/related to that tree.","zh":"deodar 指喜马拉雅雪松（雪松）这种树，也可作形容词表示“与雪松或雪松木有关”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tall evergreen conifer tree (Cedrus deodara) originally from the Himalayas, with drooping branches and fragrant wood; often planted as an ornamental tree","zh":"雪松（喜马拉雅雪松；学名 Cedrus deodara），一种原产喜马拉雅地区的高大常绿针叶树，枝条常下垂、木材芳香，常作观赏树种栽培"},"examples":[{"en":"A deodar cedar shaded the courtyard with its long, drooping branches.","zh":"一棵雪松用它长长下垂的枝条为庭院遮荫。"},{"en":"The park planted deodars because they stay green year-round and smell pleasantly resinous.","zh":"公园种了雪松，因为它们四季常青，而且带有好闻的松脂香。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the deodar tree or its wood","zh":"与雪松（喜马拉雅雪松）或其木材有关的"},"examples":[{"en":"The chest was made of deodar wood.","zh":"这个箱子是用雪松木做的。"}]}],"synonyms":["Himalayan cedar","Cedrus deodara"],"phonetic":"/ˈdiːoʊˌdɑːr/","extraExplanation":["“deodar”来自梵语 *devadāru*，常被解释为“神之木/神的木材”。在南亚文化中，雪松木因气味清香、耐久性较好而受到重视，也常与山地景观、寺庙与园林意象联系在一起。"]}
{"word":"deodara","summary":{"en":"Deodara is a Himalayan cedar tree, valued for its fragrant, durable wood.","zh":"deodara 指喜马拉雅雪松，一种以芳香且耐久的木材而闻名的雪松。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large evergreen cedar tree from the western Himalayas, with long drooping branches and needle-like leaves; its wood is fragrant and durable.","zh":"雪松（喜马拉雅雪松）：一种原产于喜马拉雅西部的大型常绿针叶树，枝条常下垂，木材有香味且耐久。"},"examples":[{"en":"The temple courtyard was shaded by an old deodara cedar.","zh":"寺庙的庭院被一棵老雪松遮荫。"},{"en":"Deodara wood is often used for building because it resists rot.","zh":"雪松木常用于建筑，因为它不容易腐烂。"},{"en":"In the Himalayas, deodara forests can grow at high altitudes.","zh":"在喜马拉雅地区，雪松林可以生长在较高海拔。"}]}],"synonyms":["deodar","Himalayan cedar","Cedrus deodara"],"phonetic":"/ˌdiːəˈdɑːrə/","extraExplanation":["“deodara”也常写作“deodar”。它来自梵语“devadāru”，常被解释为“神的木材/神木”，在南亚一些文化语境中与宗教建筑、清香木材和耐久性联系较多。"]}
{"word":"deodaras","summary":{"en":"“Deodaras” is the plural form of “deodar,” a Himalayan cedar tree often grown for shade and beauty.","zh":"“deodaras”是“deodar”的复数，指喜马拉雅雪松，常用于遮阴与观赏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Deodar trees: large evergreen cedar trees (Cedrus deodara) native to the western Himalayas, often planted as ornamental trees.","zh":"（复数）雪松（喜马拉雅雪松）树：一种大型常绿雪松（Cedrus deodara），原产于西喜马拉雅地区，常作为观赏树种栽培。"},"examples":[{"en":"The hillside was lined with deodaras and pines.","zh":"山坡上种满了雪松和松树。"},{"en":"In the old garden, a few deodaras provided deep shade in summer.","zh":"在那座老花园里，几棵雪松在夏天提供了浓密的树荫。"}]}],"synonyms":["deodars","Himalayan cedar","deodar cedar"],"phonetic":"/ˌdiːəˈdɑːr/","extraExplanation":["“deodar”来自梵语 devadāru，常被解释为“神之木”。在南亚语境中它不仅指一种树，也常带有文化与宗教上的崇敬意味。","拼写提示：deodaras 是 deodar 的复数形式；单数写作 deodar。"]}
{"word":"deodars","summary":{"en":"Deodars are Himalayan cedar trees (plural) often used as ornamental evergreens.","zh":"deodars 指喜马拉雅雪松（复数），常见作观赏常绿树。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Deodars (plural of deodar): tall evergreen cedar trees native to the Himalayas, often planted as ornamental trees in parks and gardens.","zh":"deodars（deodar 的复数）：一种原产喜马拉雅山区的高大常绿雪松树，常作为观赏树种植于公园与庭园。"},"examples":[{"en":"The road was lined with deodars, their long branches hanging like curtains.","zh":"道路两旁种着一排 deodars，它们的长枝条像帘子一样垂下来。"},{"en":"In the hill station, old deodars shaded the temple courtyard.","zh":"在山城里，古老的 deodars 为寺庙庭院投下阴凉。"},{"en":"The park planted deodars because they stay green year-round.","zh":"公园种植 deodars，因为它们四季常青。"}]}],"synonyms":["Himalayan cedars","cedars"],"phonetic":"/ˈdiːəˌdɑːr/","extraExplanation":["“deodar”指“喜马拉雅雪松”（Himalayan cedar，学名 *Cedrus deodara*）。词源来自梵语 *devadāru*，常被解释为“神的树/神圣的木材”，在南亚文化中常与山地、寺庙与庄严的景观联系在一起。","在文学或描写自然风景的文章里，deodars 常用来营造“高山、清冷、宁静、庄严”的氛围。"]}
{"word":"deodate","summary":{"en":"“Deodorate” means to remove bad odors, but it’s rare; “deodorize” is more common.","zh":"“deodorate”意为除臭，但较少用；更常用的是“deodorize”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare; often seen as a misspelling of “deodorize.”) To remove or reduce a bad smell; to make something smell fresher.","zh":"（较少用；常被视为“deodorize”的非标准拼写）去除或减弱异味；使气味更清新。"},"examples":[{"en":"The cleaner is designed to deodorate carpets after pets have accidents.","zh":"这种清洁剂用于在宠物弄脏后给地毯除味。"},{"en":"You can deodorate the fridge by cleaning it and placing an open box of baking soda inside.","zh":"你可以通过清洁冰箱并放一盒打开的苏打粉（小苏打）来给冰箱除味。"}]}],"synonyms":["deodorize","freshen (up)","neutralize odors","de-scent"],"phonetic":"/diˈoʊdəˌreɪt/","extraExplanation":["“deodate”不是常见英文单词。你可能想拼的是 **deodorate**（很少用）或更常见的 **deodorize**（美式常用：除臭）。如果你想表达“止汗/除臭产品”，常用词是 **deodorant**（除臭剂）。"]}
{"word":"Deodato","summary":{"en":"Deodato is a name (often a surname) best known in English as the musician Eumir Deodato.","zh":"Deodato 是一个名字/姓氏；英语中最常指音乐人 Eumir Deodato。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname and given name, most commonly referring to Eumir Deodato (Brazilian musician, producer, and arranger) known internationally for his jazz-funk and fusion recordings.","zh":"一个姓氏或名字；最常见的用法是指巴西音乐人、制作人、编曲家 Eumir Deodato，以爵士放克与融合（fusion）作品闻名。"},"examples":[{"en":"I’ve been listening to Deodato’s album *Prelude* lately.","zh":"我最近一直在听 Deodato 的专辑《Prelude》。"},{"en":"Deodato is often mentioned in discussions of 1970s jazz-funk.","zh":"在讨论 1970 年代的爵士放克时，人们常常会提到 Deodato。"}]}],"synonyms":["Eumir Deodato"],"phonetic":"/ˌdeɪoʊˈdɑːtoʊ/","extraExplanation":["“Deodato”在英语里通常是专有名词（人名/姓氏），所以多见于音乐、唱片、采访与乐评语境。","名字来源与葡萄牙语/拉丁语有关，常被解释为“上帝所赐/神所赐”（与拉丁语 *Deodatus* 相关）。","在流行文化里，Eumir Deodato 以将古典旋律改编为更现代的爵士/放克风格而被许多人认识，例如他改编的《Also sprach Zarathustra》（理查德·施特劳斯作品主题）曾广为流传。"]}
{"word":"Deodatus","summary":{"en":"Deodatus is a Latin-origin male name meaning “given by God,” also used by some historical saints and church figures.","zh":"Deodatus 是一个源自拉丁语的男性名字，意思是“上帝赐予的／天赐的”，也曾被一些历史上的圣人和教会人物使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (masculine), originally Latin, meaning “given by God.”","zh":"男性名字，源自拉丁语，意思是“上帝赐予的／天赐的”。"},"examples":[{"en":"Deodatus is a Latin name meaning “given by God.”","zh":"Deodatus 是一个拉丁名字，意思是“上帝赐予的”。"},{"en":"In old records, you may see someone baptized as Deodatus.","zh":"在旧档案里，你可能会看到有人受洗时取名为 Deodatus。"}]},{"partOfSpeech":"n.","definition":{"en":"a historical name used by several Christian saints and church leaders (for example, Saint Deodatus of Nevers).","zh":"历史上多位基督教圣人或教会人物使用过的名字（例如讷韦尔的圣 Deodatus）。"},"examples":[{"en":"The town’s church history mentions Saint Deodatus.","zh":"这座城镇的教会史提到了圣 Deodatus。"},{"en":"Some medieval texts refer to a bishop named Deodatus.","zh":"一些中世纪文献提到一位名叫 Deodatus 的主教。"}]}],"synonyms":["Deusdedit","Theodore"],"phonetic":"/ˌdiːoʊˈdeɪtəs/","extraExplanation":["词源提示：Deodatus 来自拉丁语“Deo datus”，直译为“被赐给上帝／由上帝赐予”。因此它常见于基督教文化背景的命名传统中，强调“天赐”“神的礼物”。","英语里更常见的同义命名思路包括 Theodore / Theodorus（希腊语来源，也有“上帝的礼物”之意），以及拉丁语系的 Deusdedit（意为“上帝赐下”）。"]}
{"word":"deodorant","summary":{"en":"Deodorant is a product used to prevent or reduce body odor, usually under the arms.","zh":"Deodorant 指用于防止或减轻体味的除臭产品，通常用于腋下。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A product (such as a spray, stick, or roll-on) used to reduce or prevent body odor, especially under the arms.","zh":"（通常指腋下用的）除臭剂；用于减少或防止体味的产品（如喷雾、膏状、走珠等）。"},"examples":[{"en":"I keep deodorant in my gym bag in case I forget to put it on at home.","zh":"我在健身包里放了一支除臭剂，以防我在家忘了用。"},{"en":"This deodorant has a light scent and doesn’t irritate my skin.","zh":"这款除臭剂味道很淡，而且不刺激皮肤。"},{"en":"He bought a travel-size deodorant for the flight.","zh":"他买了旅行装的除臭剂带上飞机。"}]}],"synonyms":["body spray","underarm deodorant","odor-control product"],"phonetic":"/diˈoʊdɚənt/","extraExplanation":["在日常英语里，deodorant 常泛指“除臭剂”。如果强调“减少出汗”，更常用 antiperspirant（止汗剂）。很多产品会标成“antiperspirant deodorant”，表示既止汗又除臭。","用法小提示：在美式英语中更常说 “put on deodorant”（涂/用除臭剂）。英式英语里有时也会听到 “use deodorant”。"]}
{"word":"deodorant-free","summary":{"en":"“Deodorant-free” means not containing deodorant or not using deodorant.","zh":"“deodorant-free”指“不含除臭/止汗成分”或“不使用体香剂”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not containing deodorant, or not using deodorant (often describing a product, person, or lifestyle choice).","zh":"不含除臭/止汗剂的；不使用体香剂（常用来描述产品、个人或生活方式选择）。"},"examples":[{"en":"This sunscreen is deodorant-free, so it won’t cover up body odor.","zh":"这款防晒霜不含除臭成分，所以它不会掩盖体味。"},{"en":"The gym asks everyone to be clean, even if you prefer a deodorant-free lifestyle.","zh":"健身房希望大家保持干净，即使你更喜欢不使用体香剂的生活方式。"},{"en":"She switched to deodorant-free soap because her skin is sensitive.","zh":"因为皮肤敏感，她改用不含除臭成分的肥皂。"}]}],"synonyms":["without deodorant","deodorantless","no-deodorant (informal)"],"phonetic":"/diˈoʊdərən(t) friː/","extraExplanation":["在日常英语里更常见的是“deodorant-free product（不含除臭成分的产品）”或“deodorant-free lifestyle（不使用体香剂的生活方式）”。如果强调“不含止汗剂（antiperspirant）”，也会看到“aluminum-free（不含铝盐）”或“antiperspirant-free（不含止汗成分）”。","拼写上多用连字符（deodorant-free）来修饰名词；放在系动词后也可以不用连字符：“The product is deodorant free.”","语境上它可能是中性描述（成分/选择），也可能带一点社交暗示：在公共场合谈到“deodorant-free”有时会让人联想到体味管理，因此更委婉的说法是“fragrance-free（无香精）”“unscented（无香）”或直接谈“sensitive skin（敏感肌）”。"]}
{"word":"deodorant-treated","summary":{"en":"“Deodorant-treated” describes something that has been treated with deodorant to reduce odor.","zh":"“deodorant-treated”指某物经过除臭剂处理，以减少或防止异味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having deodorant applied to it, or made with deodorant (so it reduces or prevents bad smells).","zh":"涂有除臭剂的；经过除臭处理的（可减少或防止异味）。"},"examples":[{"en":"Deodorant-treated underarms can stay fresher during long workdays.","zh":"涂过除臭剂的腋下在漫长的工作日里会更清爽、不易有异味。"},{"en":"The ad claims the fabric is deodorant-treated to reduce odor after exercise.","zh":"广告称这款面料经过除臭处理，运动后能减少气味。"}]}],"synonyms":["odor-control","odor-resistant","deodorized","treated with deodorant"],"phonetic":"/diˈoʊdərənt ˌtriːtɪd/","extraExplanation":["“deodorant-treated”通常用连字符作为复合形容词，放在名词前：deodorant-treated fabric/socks。放在名词后作表语时也常见：The socks are deodorant-treated。","在商品文案中，它可能表示“表面涂抹过除臭剂”，也可能指“材料里加入了除臭成分/抗菌处理”。实际效果取决于产品说明与成分。"]}
{"word":"deodorants","summary":{"en":"“Deodorants” are products used on the body to reduce or prevent body odor.","zh":"“Deodorants”指用于身体（尤其腋下）以减少或防止体味的除臭产品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a product (such as a spray, roll-on, or stick) used on the body—especially under the arms—to prevent or reduce unpleasant smell (body odor).","zh":"（用于身体、尤其腋下的）除臭剂；用于减少或掩盖体味的产品（如喷雾、走珠、膏状等）。"},"examples":[{"en":"I keep a travel-size deodorant in my bag.","zh":"我包里常备一支旅行装的除臭剂。"},{"en":"After the workout, he used deodorant before going back to the office.","zh":"锻炼后，他用了除臭剂再回办公室。"},{"en":"Some deodorants are unscented for people with sensitive skin.","zh":"有些除臭剂是无香型，适合皮肤敏感的人。"}]}],"synonyms":["deodorant","body spray","underarm deodorant"],"phonetic":"/diˈoʊd(ə)rənts/","extraExplanation":["“deodorants”是复数形式；单数是“deodorant”。","在英语里常把“deodorant（除臭剂）”和“antiperspirant（止汗剂）”区分开：deodorant主要减少气味（抑菌/香味遮盖），antiperspirant主要减少出汗（通常含铝盐成分）。很多产品会同时标注两者功能。"]}
{"word":"deodoration","summary":{"en":"“Deodoration” is a misspelling; the usual word is “deodorization,” meaning the process of removing bad smells.","zh":"“deodoration” 通常是拼写错误；常用词是 “deodorization”，表示“除臭/去除异味的过程”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually spelled “deodorization”) the process of removing or reducing bad smells (odors) from something.","zh":"（通常拼作 deodorization）除臭；去除或减轻难闻气味的过程。"},"examples":[{"en":"The deodorization of the kitchen took hours after the seafood dinner.","zh":"海鲜晚餐后，厨房除臭花了好几个小时。"},{"en":"Many pet cleaners focus on deodorization as well as stain removal.","zh":"很多宠物清洁剂不仅去污，也强调除臭。"}]}],"synonyms":["deodorization","odor removal","deodorizing"],"phonetic":"/diˌoʊdəraɪˈzeɪʃən/","extraExplanation":["“deodoration” 多半是拼写错误；更常见的名词是 **deodorization**（美式拼法）或 **deodorisation**（英式拼法）。","词根拆解：**de-**（去除）+ **odor**（气味）+ **-ize/-ise**（使……）+ **-ation**（名词后缀，表示过程）。理解词根有助于记忆含义。","日常更常用的相关词：**deodorant**（除臭剂/止汗露），以及动词 **deodorize**（给……除臭）。"]}
{"word":"deodorisation","summary":{"en":"Deodorisation means the process of removing or reducing bad smells.","zh":"Deodorisation 指“除臭/去味”的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of removing or reducing unpleasant smells from something (such as air, water, a room, or a product).","zh":"（对空气、水、房间或产品等）去除或减轻异味的过程；除臭。"},"examples":[{"en":"The kitchen needed deodorisation after the seafood was cooked.","zh":"做完海鲜后，厨房需要进行除臭处理。"},{"en":"Many factories use deodorisation systems to reduce odors released into the air.","zh":"许多工厂使用除臭系统来减少排放到空气中的气味。"},{"en":"Deodorisation is an important step in making some oils suitable for cooking.","zh":"除臭是让某些油脂适合烹饪的重要步骤。"}]}],"synonyms":["deodorization","deodorizing","odor removal","deodorizing process"],"phonetic":"/diˌoʊdəraɪˈzeɪʃən/","extraExplanation":["“deodorisation”是英式拼写；美式更常写作“deodorization”。两者意思相同。","常见搭配：deodorisation process（除臭流程）、deodorisation system/unit（除臭系统/装置）、odor deodorisation（气味处理）。","在工业和食品领域，“deodorisation”常指通过吸附、过滤或加热/蒸汽等方式减少挥发性异味物质（描述性用法即可，不必记技术细节）。"]}
{"word":"deodorise","summary":{"en":"Deodorise means to remove or reduce an unpleasant smell.","zh":"deodorise 表示“除臭”，即去除或减轻难闻的气味。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove or reduce a bad smell from something","zh":"给……除臭；去除或减轻难闻气味"},"examples":[{"en":"You can deodorise the fridge by cleaning it and leaving baking soda inside overnight.","zh":"你可以先把冰箱清洁干净，再在里面放一晚小苏打来除臭。"},{"en":"This spray is designed to deodorise shoes after exercise.","zh":"这款喷雾是用来在运动后给鞋子除臭的。"}]}],"synonyms":["deodorize","remove odors","freshen","neutralize odors"],"phonetic":"/diˈoʊdəˌraɪz/","extraExplanation":["“deodorise”是英式拼写；美式更常写作“deodorize”。两者意思完全相同。","构词：de-（去除）+ odor（气味）+ -ise/-ize（使……）。因此字面意思是“使没有气味/去除气味”。","常见搭配：deodorise a room/fridge/shoes（给房间/冰箱/鞋子除臭）；也可用于较正式语境，如deodorise waste/water（对废物/水除臭处理）。"]}
{"word":"deodorised","summary":{"en":"Deodorised means “made (almost) odorless,” especially by processing; it’s the UK spelling of deodorized.","zh":"deodorised 意为“经处理除臭、（几乎）无味的”，是 deodorized 的英式拼写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a product) having had bad or strong smells removed; made odorless or nearly odorless.","zh":"（指产品）已去除难闻或强烈气味的；除臭的、无味（或几乎无味）的。"},"examples":[{"en":"Deodorised coconut oil has a very mild smell, so it won’t change the flavor of your cooking.","zh":"除臭椰子油气味很淡，所以不会改变你做菜的味道。"},{"en":"The factory uses a deodorised process to reduce odors from animal fats.","zh":"工厂采用除臭工艺来减少动物脂肪的气味。"}]},{"partOfSpeech":"v.","definition":{"en":"(UK spelling of) deodorized; past participle of “deodorise,” meaning to remove unpleasant smells from something.","zh":"（英式拼写）deodorized；“deodorise”的过去分词，指给某物除臭、去除异味。"},"examples":[{"en":"The room was deodorised after the smoke smell lingered for days.","zh":"烟味在房间里持续了好几天后，房间被进行了除臭处理。"},{"en":"The company deodorised the recycled plastic to make it suitable for packaging.","zh":"公司对再生塑料进行了除臭处理，使其适合用于包装。"}]}],"synonyms":["deodorized","odorless","unscented","deodorant-treated"],"phonetic":"/diˈoʊdəˌraɪzd/","extraExplanation":["“deodorised / deodorized”常用于食品与工业语境：如“deodorised oil（除臭油）”“deodorised fish meal（除臭鱼粉）”。它强调通过加工把气味降低到不影响使用或口感的程度。","拼写差异：英式多用 deodorised / deodorise，美式多用 deodorized / deodorize。发音基本相同。"]}
{"word":"deodoriser","summary":{"en":"A deodoriser is something that removes or reduces bad smells.","zh":"deodoriser 指用来去除或减轻难闻气味的除臭产品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a product used to remove or reduce unpleasant smells (odors) from the body, a room, shoes, etc.","zh":"除臭剂；用于去除或减轻难闻气味（体味、室内异味、鞋臭等）的产品"},"examples":[{"en":"I keep a deodoriser in my gym bag for my shoes.","zh":"我在健身包里放了一瓶除臭剂，用来喷鞋子。"},{"en":"This room deodoriser has a fresh citrus scent.","zh":"这款室内除臭剂有清新的柑橘香味。"}]}],"synonyms":["deodorizer","odor eliminator","air freshener (for rooms)"],"phonetic":"/diːˈoʊdəˌraɪzər/","extraExplanation":["“deodoriser”是英式拼写；美式更常写作“deodorizer”。两者意思相同。","在日常英语里，针对身体体味的产品更常说“deodorant”（止汗/除体味用品）；而“deodoriser”常用于房间、鞋子、冰箱等环境或物品的除味产品。"]}
{"word":"deodorising","summary":{"en":"“Deodorising” means removing or reducing bad smells, or the process of doing so.","zh":"“deodorising”表示除臭、去除或减轻难闻气味，也可指除臭这一过程。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"removing or reducing unpleasant smells (odors); made to take away odor","zh":"除臭的；去除或减轻难闻气味的"},"examples":[{"en":"This deodorising spray is safe to use on carpets.","zh":"这种除臭喷雾可以安全地用在地毯上。"},{"en":"We used deodorising charcoal in the fridge to keep it fresh.","zh":"我们在冰箱里放了除臭活性炭来保持清新。"}]},{"partOfSpeech":"n.","definition":{"en":"the process or action of removing unpleasant smells","zh":"除臭；去除难闻气味的过程或行为"},"examples":[{"en":"Deodorising the room took about an hour after the spill.","zh":"液体洒出来之后，房间除臭花了大约一小时。"},{"en":"Good ventilation helps with deodorising after cooking.","zh":"做完饭后，良好的通风有助于除臭。"}]}],"synonyms":["deodorizing","deodorant (adj. use)","odor-removing","deodourising (BrE variant)"],"phonetic":"/diˈoʊdəˌraɪzɪŋ/","extraExplanation":["“deodorising”是英式拼写；美式更常写作“deodorizing”。两者意思相同，只是拼写习惯不同。","常见于清洁用品、空气清新剂、冰箱除味剂等产品说明中。"]}
{"word":"deodorization","summary":{"en":"Deodorization means removing unpleasant odors, especially in industry or by using deodorant for body odor.","zh":"Deodorization 指去除或减轻异味的过程，可用于工业除臭，也可指用除臭剂减少体味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of removing or reducing unpleasant smells (odors) from something","zh":"除臭；去味；除异味的过程"},"examples":[{"en":"The plant uses deodorization to remove smells from the oil.","zh":"这家工厂用除臭工艺去除油中的异味。"},{"en":"Activated carbon is often used for deodorization in water filters.","zh":"活性炭常用于净水器的除臭处理。"}]},{"partOfSpeech":"n.","definition":{"en":"the use of deodorant or other methods to stop body odor","zh":"（指人体）用止汗/除臭剂等方式减少体味"},"examples":[{"en":"Daily deodorization helps many people feel more comfortable at work.","zh":"每天的除臭护理能让很多人在工作时更自在。"},{"en":"The doctor suggested gentle deodorization products for sensitive skin.","zh":"医生建议敏感肌使用温和的除臭产品。"}]}],"synonyms":["deodorizing","odor removal","deodoration","deodorant use"],"phonetic":"/diˌoʊdəraɪˈzeɪʃən/","extraExplanation":["“deodorization”常见于工业、食品与化工语境，例如食用油精炼中的“脱臭（deodorization）”步骤，用来去除挥发性异味物质。","日常生活中更常说“use deodorant / put on deodorant（涂止汗除臭剂）”，而不是用较正式的名词“deodorization”。"]}
{"word":"deodorize","summary":{"en":"Deodorize means to remove or reduce bad smells.","zh":"deodorize 意为“除臭”，即去除或减轻难闻气味。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove or reduce an unpleasant smell from something","zh":"去除或减轻（某物的）难闻气味；除臭"},"examples":[{"en":"This spray helps deodorize shoes after a long day.","zh":"这种喷雾能在劳累一天后给鞋子除臭。"},{"en":"You can deodorize the fridge by cleaning it and placing baking soda inside.","zh":"你可以先清洁冰箱，再放一盒小苏打来除臭。"}]}],"synonyms":["deodorise","freshen","neutralize odors","remove odors"],"phonetic":"/diˈoʊdəˌraɪz/","extraExplanation":["deodorize 常用于“处理有异味的物品或空间”，语气偏实用、偏家居清洁语境；日常口语里也常用 remove odors / get rid of the smell 来表达相同意思。","词形关联：deodorant（n. 除臭剂；止汗/体香剂）。注意：deodorant 通常指涂在身上的产品；deodorize 更常指对鞋子、房间、垃圾桶等进行除臭处理。"]}
{"word":"deodorized","summary":{"en":"“Deodorized” means having a strong or unpleasant smell removed, especially for oils and foods; it can also describe something that has been deodorized.","zh":"“deodorized”意为“脱臭的、去除异味的”（常见于油脂与食品）；也可指“已被脱臭处理过的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a product, especially oil, food, or packaging) having its unpleasant or strong smell removed.","zh":"（尤指油、食品或包装等产品）去除了难闻或强烈气味的；脱臭的。"},"examples":[{"en":"This cooking oil is deodorized, so it won’t affect the flavor of your food.","zh":"这种食用油是脱臭的，所以不会影响食物的味道。"},{"en":"Some deodorized fish oil capsules are easier to take.","zh":"一些脱臭鱼油胶囊更容易服用。"}]},{"partOfSpeech":"vt.","definition":{"en":"to remove an unpleasant or strong smell from something.","zh":"给……脱臭；去除（某物的）异味或强烈气味。"},"examples":[{"en":"The factory deodorized the oil before bottling it.","zh":"工厂在装瓶前对油进行了脱臭处理。"},{"en":"They deodorized the room after the smoke smell lingered for days.","zh":"烟味持续了好几天后，他们给房间做了除味处理。"}]}],"synonyms":["odorless","unscented","deodorized (processed to remove odor)","deflavored (for taste/smell removed, in some contexts)"],"phonetic":"/diˈoʊdəˌraɪzd/","extraExplanation":["“deodorized”常见于食品与日化标签（如“deodorized oil/鱼油”），表示经过工艺处理去掉气味，但不一定等于“完全无味”，也不代表没有营养或成分被改变到同样程度——具体要看产品类型与处理方式。","拼写提示：deodorize（美式）/ deodorise（英式）；过去式/过去分词：deodorized。"]}
{"word":"deodorizer","summary":{"en":"A deodorizer is something used to remove or reduce bad smells.","zh":"deodorizer指用于去除或减弱异味的除臭用品或装置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A product or device that removes or reduces bad smells (odor), often by neutralizing the odor or covering it with a fragrance.","zh":"除臭剂；除味用品/装置（用于去除或减弱异味，常通过中和气味或用香味掩盖）。"},"examples":[{"en":"I keep a deodorizer in the bathroom to reduce unpleasant smells.","zh":"我在浴室放了除臭剂来减少难闻的气味。"},{"en":"This shoe deodorizer helps get rid of odor after workouts.","zh":"这个鞋用除臭剂能去掉运动后的异味。"},{"en":"The car’s air freshener works like a deodorizer, but it mainly adds scent.","zh":"车里的空气清新剂有点像除臭剂，但它主要是增加香味。"}]}],"synonyms":["odor eliminator","deodorant (often for body odor)","air freshener (often adds fragrance)"],"phonetic":"/diˈoʊdəˌraɪzər/","extraExplanation":["在日常英语里，deodorizer常指“除臭产品/装置”。如果强调“香味”，更常用air freshener（空气清新剂）；如果强调“除臭/抑味”（尤其是人体体味），常用deodorant（止汗/除体味剂，多用于腋下）。","词源上，de-有“去除”的意思，odor是“气味”，-izer表示“使……的东西/装置”，合起来就是“去除气味的东西”。"]}
{"word":"deodorizers","summary":{"en":"Deodorizers are products or devices used to remove, reduce, or cover unpleasant odors.","zh":"Deodorizers 指用于去除、减轻或掩盖异味的产品或装置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Substances or products used to remove or hide bad smells, especially in rooms, shoes, refrigerators, or trash areas.","zh":"除臭剂；除味用品（用于去除或掩盖异味，常见于房间、鞋子、冰箱或垃圾处）"},"examples":[{"en":"We put deodorizers in the bathroom to keep it smelling fresh.","zh":"我们在浴室放了除臭剂，让它闻起来更清新。"},{"en":"Shoe deodorizers can help reduce odor after a long day.","zh":"鞋子除臭剂可以减轻一天走下来产生的异味。"}]},{"partOfSpeech":"n.","definition":{"en":"Devices (often electric) that release a scent into the air to improve the smell of a space.","zh":"香氛装置；空气清新器（常为电动设备，把香味释放到空气中）"},"examples":[{"en":"An automatic deodorizer sprays a light scent every few minutes.","zh":"自动空气清新器每隔几分钟喷一次淡淡的香味。"},{"en":"Some people prefer unscented deodorizers in small rooms.","zh":"有些人更喜欢在小房间用无香型的除味产品。"}]}],"synonyms":["air fresheners","odor eliminators","fresheners","deodorants (for people, not spaces)"],"phonetic":"/diˈoʊdəˌraɪzərz/","extraExplanation":["在日常英语里，deodorizer 常和 air freshener（空气清新剂/空气清新器）意思接近，但侧重点不同：deodorizer 更强调“除臭/去味”，air freshener 更强调“增香/让空气闻起来香”。","注意区分 deodorizer（除臭剂，给环境/物品用）和 deodorant（止汗/体香剂，给人体用，比如腋下）。"]}
{"word":"deodorizes","summary":{"en":"“Deodorizes” means removes or neutralizes bad odors.","zh":"“deodorizes”表示“除臭、去除或中和异味”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to remove or neutralize an unpleasant smell","zh":"除臭；去除或中和难闻气味"},"examples":[{"en":"This spray deodorizes the room in minutes.","zh":"这种喷雾几分钟就能给房间除臭。"},{"en":"Baking soda deodorizes the fridge naturally.","zh":"小苏打能自然地给冰箱除臭。"}]}],"synonyms":["freshen","remove odor","neutralize odors","de-stink"],"phonetic":"/diˈoʊdəˌraɪz/","extraExplanation":["“deodorize”由前缀 de-（去除）+ odor（气味）+ -ize（使……）构成，字面意思是“使没有气味/去除气味”。日常中常用于清洁用品说明，如 deodorizing spray（除臭喷雾）、deodorizing powder（除臭粉）。","区分：deodorize（除臭，强调去掉异味）≠ disinfect（消毒，强调杀菌）。有些产品两者都做，但词义不同。"]}
{"word":"deodorizing","summary":{"en":"“Deodorizing” means removing or reducing bad smells, or describing something used to do that.","zh":"“deodorizing”表示“除臭、去味”，也可形容具有除臭作用的东西。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"removing or reducing an unpleasant smell; making something smell better","zh":"去除或减轻难闻气味；除臭"},"examples":[{"en":"The deodorizing spray removed the smoke smell from the room.","zh":"除臭喷雾去除了房间里的烟味。"},{"en":"Deodorizing soap is useful after cooking with garlic or fish.","zh":"做完大蒜或鱼这类味道重的菜后，用除臭皂很有用。"}]},{"partOfSpeech":"n.","definition":{"en":"the process of removing or reducing bad odors","zh":"除臭（的过程）"},"examples":[{"en":"Deodorizing the refrigerator takes only a few minutes with baking soda.","zh":"用小苏打给冰箱除臭只需要几分钟。"},{"en":"The company specializes in deodorizing homes after fires.","zh":"这家公司专门做火灾后的房屋除臭处理。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “deodorize”: to remove or reduce an unpleasant smell","zh":"“deodorize”的现在分词：给……除臭；去除或减轻异味"},"examples":[{"en":"She is deodorizing the carpet with a vinegar solution.","zh":"她正在用醋水给地毯除臭。"},{"en":"We’re deodorizing the trash can before bringing it back inside.","zh":"我们会先给垃圾桶除臭，再把它拿回室内。"}]}],"synonyms":["odor-removing","odor-eliminating","freshening","neutralizing odors"],"phonetic":"/diˈoʊdəˌraɪzɪŋ/","extraExplanation":["“deodorizing”常见于产品说明和家务清洁语境（如 deodorizing spray/soap/powder）。在日常对话中也可以用更口语的说法：get rid of the smell（去味）、make it smell better（让它更好闻）。","与“disinfecting（消毒）”不同，deodorizing 主要针对“气味”，不一定能杀菌；而有些产品会同时标注 deodorizing and disinfecting（除臭并消毒）。"]}
{"word":"deodourising","summary":{"en":"Deodourising means removing or reducing bad smells (British spelling of “deodorizing”).","zh":"deodourising 指“除臭、去除或减轻异味”，是 deodorizing 的英式拼写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"removing or reducing an unpleasant smell; making something smell better (often by using a product or chemical).","zh":"除臭的；去除或减轻难闻气味的（常借助除臭产品或化学物质）。"},"examples":[{"en":"The hospital uses deodourising sprays to keep the wards fresh.","zh":"医院使用除臭喷雾来让病房保持清新。"},{"en":"Deodourising the fridge is easy if you clean spills right away.","zh":"只要及时清理洒出的东西，给冰箱除臭就很容易。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or process of removing bad smells (gerund/present participle of “deodourise”).","zh":"除臭；去除异味的过程（“deodourise”的动名词/现在分词）。"},"examples":[{"en":"Deodourising after cooking fish can take a while.","zh":"做完鱼之后去除气味可能要花点时间。"},{"en":"We’re deodourising the carpets with baking soda.","zh":"我们用小苏打给地毯除臭。"}]}],"synonyms":["deodorizing","deodorising","freshening","neutralizing odors"],"phonetic":"/diˈoʊdəˌraɪzɪŋ/","extraExplanation":["“deodourising”是英式拼写；美式更常写作“deodorizing”。两者意思相同，只是拼写习惯不同。","常见搭配：deodourising spray（除臭喷雾）、deodourising agent（除臭剂）、deodourising treatment/process（除臭处理/过程）。"]}
{"word":"deofol","summary":{"en":"“deofol” isn’t a recognized English word; it’s likely a misspelling.","zh":"“deofol”不是标准英语单词，可能是拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a name/brand.","zh":"不是标准英语单词，可能是拼写错误，或是名字/品牌名。"},"examples":[{"en":"I can’t find “deofol” in an English dictionary—could you check the spelling?","zh":"我在英语词典里找不到“deofol”，你能检查一下拼写吗？"},{"en":"Did you mean “daffodil” (a yellow spring flower) or something else?","zh":"你是不是想写“daffodil”（一种春天的黄色花）或别的词？"}]}],"extraExplanation":["“deofol”看起来像打字/拼写错误。我最接近能想到的常见词是 **daffodil**（水仙花/黄水仙），但也可能是你想写 **defoliate**（使落叶；使去叶）的一部分。","请告诉我你想表达的意思（例如“花/植物”“除臭/香味”“医学/化学名词”等）或给我一句包含它的英文句子，我就能准确解释。"]}
{"word":"deol","summary":{"en":"“deol” is not a common English word; it’s probably a misspelling (often of “deal”) or a proper noun/acronym.","zh":"“deol”不是常见英语词；多半是拼写错误（常见为“deal”）或专有名词/缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a name/acronym. Many learners mean “deal.”","zh":"不是标准英语单词。很可能是拼写错误，或是人名/缩写。很多学习者想写的是“deal”。"},"examples":[{"en":"Did you mean “deal” (an agreement) instead of “deol”?","zh":"你是不是想写“deal”（协议/交易）而不是“deol”？"},{"en":"Please check the spelling: “deal” is the common word in English.","zh":"请检查拼写：“deal”才是英语里常用的词。"}]}],"extraExplanation":["“deol”在常见英语词典中通常查不到。如果你能告诉我你看到它的句子/上下文（比如一整句），我可以判断它是否是：\n1）拼写错误（最常见是 deal / dial / duel / doil 等）；\n2）某个专有名词（人名、地名、品牌）；\n3）缩写（不同领域含义会不同）。"]}
{"word":"Deon","summary":{"en":"Deon is a personal name (given name).","zh":"Deon 是一个人名（英文名字）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (first name), used mostly for males in English-speaking countries; sometimes used for females as well.","zh":"（人名）Deon，常见的英文名字，多用于男性（也偶用于女性）。"},"examples":[{"en":"Deon is starting a new job next week.","zh":"Deon 下周要开始一份新工作。"},{"en":"I met Deon at a conference in Chicago.","zh":"我在芝加哥的一场会议上认识了 Deon。"},{"en":"Could you ask Deon to call me back?","zh":"你能让 Deon 给我回个电话吗？"}]}],"synonyms":["Dion","Deion"],"phonetic":"/ˈdiːɑn/","extraExplanation":["Deon 通常被看作 Dion 的拼写变体；Dion 源自希腊语词根，常被解释为“与宙斯（Zeus）有关/属于宙斯”。","英语里人名的读法会因地区与个人偏好而不同；如果你认识某位叫 Deon 的人，最稳妥的方式是直接问对方希望怎么念。"]}
{"word":"deonerate","summary":{"en":"Deonerate means to clear someone of blame or responsibility (a rare, formal word).","zh":"deonerate 指“洗清责任/免除责备”（较少见、较正式的词）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to free someone from blame, responsibility, or a burden; to clear (someone) of a charge","zh":"使免于责备或责任；解除负担；（较少用）为某人洗清指控"},"examples":[{"en":"The new evidence helped deonerate her from any involvement in the accident.","zh":"新的证据帮助她洗清了与这起事故有关的嫌疑。"},{"en":"He tried to deonerate himself by showing he was out of town that night.","zh":"他试图通过证明那晚不在城里来为自己开脱。"}]}],"synonyms":["exonerate","absolve","clear","vindicate","acquit"],"phonetic":"/diˈɑnəˌreɪt/","extraExplanation":["这个词很少见，更常见的表达是 **exonerate**（洗清罪名/免除责任）。","词源上可理解为 **de-**（去除）+ 拉丁语 **onus**（负担），核心意思是“去掉负担/责任”。在现代英语里多见于较正式或法律语境，但日常写作通常用 **exonerate** 或 **clear**。"]}
{"word":"Deonna","summary":{"en":"Deonna is a female first name, mainly used in the U.S., with slightly varying pronunciations.","zh":"Deonna 是一个女性英文名，主要在美国使用，发音在不同家庭间可能略有差异。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feminine given name (first name); it is a modern name used mainly in the U.S., and pronunciation may vary by family.","zh":"女性名字（名）；主要在美国使用的现代名字，不同家庭的发音可能略有差异。"},"examples":[{"en":"Deonna joined our class this semester.","zh":"Deonna 这学期加入了我们班。"},{"en":"I met Deonna at the community center.","zh":"我在社区中心认识了 Deonna。"},{"en":"Deonna, could you please sign here?","zh":"Deonna，你能在这里签名吗？"}]}],"synonyms":["Dionne","Deana","Deonna (variant spellings: Deona, Deonna)"],"phonetic":"/diˈɑnə/","extraExplanation":["“Deonna”常被视为现代英语名字，可能与“Dionne / Deonna / Deana”等名字在拼写或读音上有关联；常见读法类似“dee-AH-nuh”（重音在第二音节）。","在英文里，名字属于专有名词（proper noun）。写作时首字母要大写：Deonna。称呼本人时，通常直接用名字或加上礼貌称呼（Ms. + 姓）。"]}
{"word":"Deonne","summary":{"en":"Deonne is a personal name, usually a feminine first name.","zh":"Deonne 是一个人名，通常用作女性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (first name), most often used for women; sometimes also used as a variant spelling of related names like Deon/Deonne or Dionne.","zh":"一个人名（名字），多用于女性；有时也作为相关名字（如 Deon/Deonne 或 Dionne）的变体拼写。"},"examples":[{"en":"Deonne is my coworker, and she just started this week.","zh":"Deonne 是我的同事，她这周刚入职。"},{"en":"I’m not sure how to spell it—Deonne or Dionne?","zh":"我不确定怎么拼——Deonne 还是 Dionne？"}]}],"synonyms":["Deon","Deonna","Dionne"],"phonetic":"/diˈɑn/","extraExplanation":["“Deonne”常被视为现代英语语境中的女性名字，拼写上可能受“Deon / Deonna / Dionne”等名字影响。不同家庭会选择不同拼法来体现独特性。","读到或写到这个名字时，最礼貌的做法是询问对方偏好的拼写与发音（例如：‘How do you pronounce your name?’）。"]}
{"word":"deontic","summary":{"en":"Deontic means “about duty, rules, obligation, or permission,” especially in ethics, law, and linguistics.","zh":"deontic 指“与义务、规则、必须/应该/允许相关”，常用于伦理学、法律和语言学。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to duty, rules, or what is morally or socially required or permitted (often used when talking about laws, ethics, or the meaning of modal verbs like must/should).","zh":"与义务、规则相关；指道德或社会上“必须/应该/允许”的要求（常用于法律、伦理学，或语言学中讨论 must/should 等情态词的含义）。"},"examples":[{"en":"In deontic ethics, an action can be wrong even if it leads to good results.","zh":"在义务论（deontic ethics）中，即使结果很好，某个行为也可能仍然是错误的。"},{"en":"In the sentence “You must leave now,” must has a deontic meaning: it expresses obligation.","zh":"在句子“You must leave now”中，must 是“义务性/规范性（deontic）”用法：表达一种必须履行的义务。"}]}],"synonyms":["duty-based","normative","obligatory"],"phonetic":"/diˈɑn.tɪk/","extraExplanation":["词源来自希腊语 deon，意为“责任/义务、应当做的事”。因此 deontic 常与“义务、规则、许可”连在一起。","常见对比（帮助理解）：\n- deontic（义务/许可）：You must wear a helmet.（你必须戴头盔。）\n- epistemic（推断/可能性）：He must be home.（他一定在家，表示推断）","常见搭配：deontic ethics（义务论/义务伦理学）、deontic logic（义务逻辑）、deontic modality（义务情态/规范情态）。"]}
{"word":"deontological","summary":{"en":"Deontological means judging actions by duty and moral rules, not by consequences.","zh":"Deontological（义务论的）指用义务与道德规则来评判行为，而非看后果。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Based on duty and moral rules (what you should do), rather than on the results or consequences of your actions.","zh":"（道德哲学中）以“义务/规则”为核心的；强调应当遵守道德规则，而不是以结果/后果来判断行为。"},"examples":[{"en":"A deontological approach says lying is wrong even if it prevents harm.","zh":"义务论的观点认为，即使撒谎能避免伤害，撒谎仍然是错的。"},{"en":"Her deontological view focuses on keeping promises as a duty.","zh":"她的义务论观点强调守承诺是一种责任。"}]}],"synonyms":["duty-based","rule-based","Kantian"],"phonetic":"/ˌdiːɑnˈtɑlədʒɪkəl/","extraExplanation":["“deontological”常见于伦理学/哲学写作，对比词是“consequentialist / utilitarian（结果论/功利主义）”。义务论常与康德（Kant）的思想联系在一起：强调行为是否符合原则、是否尊重他人，而不是看能带来多少好处。","词源来自希腊语 deon（义务、应当）+ -logy（学说/研究）。日常英语里不常用，多用于学术或正式讨论。"]}
{"word":"deontologist","summary":{"en":"A deontologist judges morality by duties and rules rather than outcomes.","zh":"义务论者以义务与规则来判断道德，而非以结果来判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who believes that some actions are morally right or wrong based on rules or duties, not mainly on their results (consequences).","zh":"义务论者：认为某些行为的道德对错主要取决于规则、义务或原则，而不是结果（后果）的人。"},"examples":[{"en":"As a deontologist, she refused to lie even if it could save her career.","zh":"作为一名义务论者，她即使谎言能保住事业也拒绝撒谎。"},{"en":"A deontologist might say you must keep a promise because it is your duty.","zh":"义务论者可能会说：你必须守诺，因为这是你的义务。"}]}],"synonyms":["duty-based ethicist","Kantian (in some contexts)"],"phonetic":"/ˌdiːɑːnˈtɑːlədʒɪst/","extraExplanation":["“Deontologist”来自“deontology（义务论）”，词根与希腊语中表示“义务/责任”的概念有关。常见于伦理学讨论中，常与“consequentialist（结果论者）/ utilitarian（功利主义者）”对比。","在英语里它通常用于学术或正式语境。一个常见代表是哲学家康德（Kant）的道德理论：强调遵循普遍化的道德原则，而不是用“带来更多好处”来为行为辩护。"]}
{"word":"deontology","summary":{"en":"Deontology is an ethics approach focused on duties and rules rather than consequences.","zh":"义务论是一种以义务与规则为核心、而非以结果为核心的伦理观。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A moral or ethical theory that says some actions are right or wrong because of rules or duties, not mainly because of their results.","zh":"（道德/伦理）义务论：认为行为的对错主要取决于是否符合规则或义务，而不主要取决于结果。"},"examples":[{"en":"In deontology, lying is wrong even if it could lead to a good outcome.","zh":"在义务论中，说谎是错误的，即使它可能带来好结果。"},{"en":"Her argument was deontological: we have a duty to keep promises.","zh":"她的论证是义务论式的：我们有遵守承诺的义务。"}]},{"partOfSpeech":"n.","definition":{"en":"The study of moral duties and obligations in philosophy.","zh":"（哲学中）对道德义务与责任的研究。"},"examples":[{"en":"The class covered deontology, utilitarianism, and virtue ethics.","zh":"这门课涵盖了义务论、功利主义和德性伦理学。"}]}],"synonyms":["duty-based ethics","Kantian ethics","rule-based ethics"],"phonetic":"/ˌdiːɑnˈtɑlədʒi/","extraExplanation":["“Deontology”来自希腊语 deon（义务、应当）+ -logy（学科/研究）。常与“utilitarianism（功利主义）”对比：功利主义更看重结果与总体幸福；义务论更强调原则与底线。","哲学课堂里常提到康德（Kant）的义务论思想，例如“把人当作目的而不是工具”（尊重人的尊严）。在日常讨论中，说某观点“deontological”通常表示它以“原则/义务”为出发点。"]}
{"word":"deop","summary":{"en":"“deop” is not a standard English word; it’s likely a typo for “deep” or “dope.”","zh":"“deop”不是标准英语单词，通常是把“deep”或“dope”等词拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling or typo (commonly for “deep” or “dope,” depending on context).","zh":"不是标准英语单词；多半是拼写/输入错误（常见可能是把“deep”或“dope”拼错，需看语境）。"},"examples":[{"en":"I think you meant “deep”: The water is very deep.","zh":"我猜你想写“deep”：水很深。"},{"en":"Or you may have meant “dope”: That movie was dope.","zh":"或者你可能想写“dope”：那部电影太酷了。"}]}],"phonetic":"diːp","extraExplanation":["“deop”在常见词典中通常查不到。判断你想表达哪个词，可以看句子位置：\n- 形容深度/程度：多半是 deep。\n- 口语里表示“很酷/很棒”（俚语）：可能是 dope。\n如果你把包含“deop”的完整句子发我，我可以帮你准确改正并解释用法。"]}
{"word":"deoperculate","summary":{"en":"Deoperculate means to remove a biological ‘lid’ (operculum).","zh":"Deoperculate 指去除生物结构上的“盖”（operculum）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove an operculum (a lid- or cap-like covering), especially in biology (for example, removing the cap from an eggshell, a spore, or a small anatomical “lid”).","zh":"（尤指生物学中）去除盖状结构（operculum，像“盖子/帽子”的覆盖物）；把“盖”打开或去掉。"},"examples":[{"en":"In the lab, the researchers deoperculated the eggs to observe the embryo more clearly.","zh":"在实验室里，研究人员去除了卵的“盖”以更清楚地观察胚胎。"},{"en":"Some protocols deoperculate spores before staining.","zh":"有些实验流程会在染色前先去除孢子的“盖”状结构。"}]}],"synonyms":["remove the operculum","uncap","decap (in some lab contexts)"],"phonetic":"/diˌoʊˈpɝːkjəˌleɪt/","extraExplanation":["“Operculum”常见于生物学语境，指像盖子一样的结构：例如某些软体动物壳口的“厣”、一些卵或孢子上的“盖”、以及解剖结构中的小“瓣/盖”。因此 deoperculate 多用于实验操作或形态描述，属于比较专业的动词。"]}
{"word":"deoppilant","summary":{"en":"Depilant means a hair-removal product (or hair-removing) that removes hair from the skin surface.","zh":"Depilant 指“脱毛剂”或“脱毛的”，通常指去除皮肤表面毛发的脱毛产品/方法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a product (such as a cream or lotion) used to remove unwanted hair from the skin","zh":"（脱毛）脱毛剂：用于去除皮肤表面多余体毛的产品（如脱毛膏、脱毛乳等）"},"examples":[{"en":"She used a depilant cream on her legs.","zh":"她在腿上用了脱毛膏。"},{"en":"Test the depilant on a small area first to avoid irritation.","zh":"先在小范围皮肤上测试脱毛剂，以免刺激。"}]},{"partOfSpeech":"adj.","definition":{"en":"describing a product or method that removes hair from the skin surface","zh":"脱毛的；用于去除体毛的（强调作用或用途）"},"examples":[{"en":"This depilant lotion is designed for sensitive skin.","zh":"这款脱毛乳适合敏感肌。"}]}],"synonyms":["hair-removal cream","depilatory"],"phonetic":"/dɪˈpɪlənt/","extraExplanation":["你输入的“deoppilant”很可能是拼写错误；英语中更常见的拼法是“depilant”。","“Depilant”通常指化学脱毛（把皮肤表面的毛发溶解或软化后去除），不同于“epilator/epilation”（连根拔除）或“waxing”（蜜蜡脱毛）。","词源上与拉丁语“pilus（毛发）”有关：de- 表示“去除”，pil- 指“毛发”。"]}
{"word":"deoppilate","summary":{"en":"“Deoppilate” is not a common modern spelling; it likely refers to the rare/archaic verb “deopilate,” meaning to remove a blockage and make something clear or open.","zh":"“deoppilate”不是常见现代拼写；多半指罕见/古语动词“deopilate”，意为清除阻塞、使通畅。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Very rare/archaic) To clear or remove an obstruction; to open up something that is blocked, especially in the body (e.g., to relieve constipation or clear a blockage).","zh":"（非常少见/古语）清除阻塞；使通畅（尤指身体内的阻塞，如通便或疏通堵塞）。"},"examples":[{"en":"In older medical texts, some herbs were said to deopilate the liver and spleen.","zh":"在较早的医学文献中，有些草药被认为能“deopilate”（疏通）肝脾的阻塞。"},{"en":"The remedy was believed to deopilate the body by removing harmful blockages.","zh":"这种疗法被认为可以通过清除有害堵塞来使身体通畅。"}]}],"synonyms":["unblock","clear (a blockage)","open up","relieve (a blockage)","purge"],"phonetic":"/diˈɑpəˌleɪt/","extraExplanation":["“deoppilate”不是现代英语里的常见拼写；你很可能想写的是 **deopilate**（古语/罕见）。它来自拉丁语词根，含义与“使（身体或管道）不再堵塞”有关。","在当代英语中更常用的表达是 **clear a blockage**, **unblock**, **relieve constipation**, **open up (a passage)**。如果你告诉我出现它的句子或出处（书名/截图），我可以更准确判断是否为拼写错误或特定专业用法。"]}
{"word":"deoppilation","summary":{"en":"Depilation means removing hair from the surface of the skin (like shaving or using a depilatory cream).","zh":"Depilation 指从皮肤表面去除毛发（如剃毛或使用脱毛膏）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the removal of hair from the surface of the skin (often by a cream, shaving, or other methods that do not remove the hair root).","zh":"（脱毛）从皮肤表面去除毛发（常见方式包括脱毛膏、剃毛等，一般不连毛根一起去除）。"},"examples":[{"en":"Depilation creams remove hair quickly, but some people find them irritating.","zh":"脱毛膏能快速去除毛发，但有些人会觉得刺激皮肤。"},{"en":"She chose depilation instead of waxing because it was less painful.","zh":"她选择了脱毛（如剃毛/脱毛膏）而不是蜜蜡脱毛，因为疼痛感更小。"}]}],"synonyms":["hair removal","shaving"],"phonetic":"/ˌdɛpəˈleɪʃən/","extraExplanation":["你输入的“deoppilation”很可能是拼写错误。常见正确拼写是 **depilation**（脱毛）。","小提示：**depilation** 通常指“去除皮肤表面毛发”；而 **epilation**（脱毛/拔毛）更常指“连毛根一起拔除”（例如蜜蜡、拔毛器），通常维持时间更久但更疼。"]}
{"word":"deoppilative","summary":{"en":"A very rare medical-style adjective meaning “removing an obstruction; de-obstructing.”","zh":"一个非常罕见的医学风格形容词，意为“解除阻塞的；通阻的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Very rare / not standard in modern English) medicine: able to remove an obstruction (especially in the body), i.e., “de-obstructing.” Often used as a learned formation from older medical Latin/Greek style.","zh":"（非常罕见／现代英语中不规范）【医学】指“解除阻塞的、通畅的”，即有助于去除（尤指身体内的）堵塞。多为仿古医学拉丁/希腊词构成的学术用词。"},"examples":[{"en":"In older medical writing, a herb might be described as deoppilative because it was believed to open blocked passages.","zh":"在较早的医学写作中，一种草药可能被称为 deoppilative，因为人们认为它能疏通被堵塞的通道。"},{"en":"Modern texts usually prefer clearer terms like deobstruent or laxative instead of deoppilative.","zh":"现代文本通常更倾向用更清楚的词，比如 deobstruent（通阻药）或 laxative（泻药），而不是 deoppilative。"}]}],"synonyms":["deobstruent","unblocking","clearing"],"phonetic":"/diˌɑpəˈleɪtɪv/","extraExplanation":["这个词在主流词典里很少见，你可能是在旧书/旧处方/扫描识别（OCR）里看到的，或是拼写变体。","词源上可理解为 de-（去除）+ oppilative（造成阻塞的；源自拉丁语 oppilare“堵塞”）。因此 deoppilative 的逻辑含义就是“去堵/通阻”。","若你是想表达“导致人口减少的”，更常见的词是 depopulative（使人口减少的）或 depopulating（导致人口减少的）。若你想表达“通畅、解除堵塞”，可用 deobstruent（较正式/医学）或 clearing/unblocking（更日常）。"]}
{"word":"deor","summary":{"en":"“Deor” is best known as the title of an Old English poem; as Old English “dēor,” it meant a wild animal.","zh":"“Deor”最常见是指一首古英语诗的标题；作为古英语“dēor”，意思是野兽、野生动物。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper noun) The title of an Old English poem, usually called “Deor,” about a poet who has lost his position but comforts himself by remembering that suffering passes.","zh":"（专有名词）一首古英语诗的标题，常称《Deor》；内容写一位诗人失势后回顾他人与自己的苦难，以“痛苦终会过去”自我安慰。"},"examples":[{"en":"In literature class, we read Deor as an example of Old English elegy.","zh":"在文学课上，我们读《Deor》作为古英语挽歌体的例子。"},{"en":"The repeated idea in Deor is that hardship does not last forever.","zh":"《Deor》中反复强调的观点是：苦难不会永远持续。"}]},{"partOfSpeech":"n.","definition":{"en":"(Old English) “dēor”: a wild animal; sometimes understood as “deer” in later English.","zh":"（古英语）dēor：野兽、野生动物；在后期英语理解中常与“deer（鹿）”联系起来。"},"examples":[{"en":"In Old English texts, dēor could mean a wild animal, not only a deer.","zh":"在古英语文本里，dēor 可以指“野兽”，不一定特指“鹿”。"}]}],"synonyms":["Old English elegy (context)","lament (context)","dēor (Old English form)"],"phonetic":"/ˈdeɚ/","extraExplanation":["“deor”在现代英语里不是常见单词；如果你想查的是现代词，很可能是拼写误差：dear（亲爱的）或 doer（行动者、实干者）。你可以告诉我你想表达的句子，我帮你确认。","《Deor》常被归为“挽歌/哀歌”（elegy）传统：通过列举历史或传说人物的苦难，表达“此亦将逝”的安慰。"]}
{"word":"deorbit","summary":{"en":"Deorbit means to take a spacecraft out of orbit so it reenters the atmosphere.","zh":"Deorbit 指让航天器脱离轨道并再入大气层。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to bring a spacecraft out of orbit so it reenters Earth’s atmosphere (usually to land or to burn up safely).","zh":"使航天器脱离轨道并进入大气层再入（通常用于着陆或安全烧毁）。"},"examples":[{"en":"Engineers planned to deorbit the capsule after the experiment ended.","zh":"实验结束后，工程师计划让返回舱脱轨再入。"},{"en":"The space station will be deorbited in a controlled way to avoid space debris.","zh":"空间站将以可控方式脱轨再入，以避免产生太空垃圾。"}]},{"partOfSpeech":"v.","definition":{"en":"(more general) to remove or force something out of an orbit or stable path around a planet or object.","zh":"（更广义）把某物从绕行轨道或稳定环绕路径中移除或迫使其偏离。"},"examples":[{"en":"A small push can deorbit a satellite over time.","zh":"一次小小的推力，随着时间推移也可能让卫星脱轨。"}]}],"synonyms":["de-orbit","bring down (a spacecraft)","cause reentry","deorbit burn (related term)"],"phonetic":"/diˈɔɹbɪt/","extraExplanation":["“de-”是一个常见前缀，表示“去掉、移除、逆转”（如 deactivate 取消激活）。因此 deorbit 字面意思就是“从轨道上移除”。","在航天新闻里常见搭配：controlled deorbit（受控离轨/受控再入）、deorbit burn（离轨制动点火/离轨点火）。","写作上有时会看到名词 deorbit（离轨/再入过程），但更常用的是动词形式。"]}
{"word":"deorbits","summary":{"en":"Deorbits means to remove a spacecraft from orbit or for it to leave orbit and return toward Earth.","zh":"Deorbits 指使航天器脱离轨道，或航天器自行脱轨并返回地球方向。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(of a spacecraft or satellite) to bring it out of orbit so it falls back toward Earth or burns up in the atmosphere; to remove something from orbit.","zh":"（航天器或卫星）使其脱离轨道，使其返回地球或在大气层中烧毁；使某物退出轨道。"},"examples":[{"en":"The space agency deorbits old satellites to reduce space debris.","zh":"航天机构会让旧卫星脱轨，以减少太空垃圾。"},{"en":"The mission team deorbits the capsule after the experiments are finished.","zh":"实验结束后，任务团队让返回舱脱轨。"}]},{"partOfSpeech":"vi.","definition":{"en":"to leave orbit and begin returning toward Earth or another body.","zh":"脱离轨道，开始返回地球或其他天体。"},"examples":[{"en":"After the final burn, the spacecraft deorbits and enters the atmosphere.","zh":"完成最后一次点火后，航天器脱轨并进入大气层。"},{"en":"The satellite deorbits over the ocean for a safer reentry.","zh":"这颗卫星在海洋上空脱轨，以便更安全地再入。"}]}],"synonyms":["deorbit (base form)","deorbit burn (related term)","bring down (informal)","reenter (related, not exact)"],"phonetic":"/diˈɔr.bɪts/","extraExplanation":["“deorbits”是动词“deorbit”的第三人称单数形式（he/she/it deorbits）。常见于航天新闻与工程语境。","“deorbit”通常指通过一次或多次发动机点火（deorbit burn，脱轨点火）降低近地点，让航天器再入大气层；也可指受阻力影响的自然衰减脱轨（但工程语境更常强调人为控制）。"]}
{"word":"deorc","summary":{"en":"“Deorc” is an Old English word meaning “dark” or “darkness,” and it’s the historical ancestor of modern “dark.”","zh":"“deorc”是古英语词，意为“黑暗的/黑暗”，是现代英语“dark”的历史来源之一。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Old English; archaic) dark; gloomy; lacking light.","zh":"（古英语；古义）黑暗的；阴暗的；缺少光的。"},"examples":[{"en":"In Old English, “deorc” describes a place with little or no light.","zh":"在古英语里，“deorc”用来形容几乎没有光的地方。"},{"en":"The poet speaks of a deorc night and a fearful road.","zh":"诗人写到“deorc”的夜晚和令人害怕的道路。"}]},{"partOfSpeech":"n.","definition":{"en":"(Old English; rare) darkness; the state of being dark.","zh":"（古英语；少见）黑暗；阴暗状态。"},"examples":[{"en":"They walked into deorc, unable to see the path ahead.","zh":"他们走进黑暗（deorc），看不清前方的路。"}]}],"synonyms":["dark (modern)","gloomy","dim"],"phonetic":"/dɔrk/","extraExplanation":["“deorc”是现代英语“dark”的古英语形式之一，常见于早期日耳曼语系文本与研究材料中（例如讨论《贝奥武夫》或古英语诗歌时）。","现代日常英语里不用“deorc”，写作与口语都用“dark”。如果你是在查现代俚语或拼写，可能想找的是“dork”（笨蛋/书呆子，略带不礼貌）。"]}
{"word":"deorcnes","summary":{"en":"Encoders are devices, programs, or systems that turn information into a coded form for storage, transmission, or processing.","zh":"Encoders 指把信息转换成编码形式以便存储、传输或处理的设备、程序或系统。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an electronic device, program, or part of a system that converts information (such as sound, video, or sensor data) into a coded form so it can be stored, transmitted, or processed","zh":"（电子）编码器：把信息（如声音、视频或传感器数据）转换成编码形式，以便存储、传输或处理的设备或程序"},"examples":[{"en":"The video encoder compresses the file so it can be streamed smoothly.","zh":"视频编码器会压缩文件，这样就能流畅地在线播放。"},{"en":"This camera has a built-in encoder for recording high-quality audio.","zh":"这台相机内置编码器，可以录制高质量音频。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or system that encodes messages or data (less common in everyday conversation)","zh":"（较少用于日常）把信息或数据进行编码的人或系统"},"examples":[{"en":"During the test, an encoder turned the answers into a numeric code.","zh":"在测试中，编码人员把答案转换成数字代码。"}]}],"synonyms":["coder","codec (related)","encoder module"],"phonetic":"/ɛnˈkoʊdər/","extraExplanation":["你输入的“deorcnes”看起来不像常见英语单词，更像是把字母打乱/拼错了；最可能对应的是 **encoders**（encoder 的复数）。","在科技语境里，encoder 常和 **decoder（解码器）** 成对出现：encoder 负责“把信息变成码”，decoder 负责“把码还原成信息”。例如视频通话里，摄像头/软件先编码再传输，对方再解码播放。"]}
{"word":"deordination","summary":{"en":"Deordination means the removal of someone’s ordained religious status.","zh":"Deordination 指解除某人的宗教圣职（取消受任身份）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of removing someone from ordained religious status (taking away the authority or status of a minister/priest)","zh":"（宗教领域）解除圣职；取消某人的受任圣职身份（剥夺其牧师/神父等的职权或身份）"},"examples":[{"en":"The church debated whether deordination was appropriate after the pastor’s misconduct.","zh":"教会讨论在该牧师失职后是否应当对其解除圣职。"},{"en":"In some traditions, deordination is extremely rare and requires a formal process.","zh":"在一些传统中，解除圣职极为罕见，并且需要正式程序。"}]}],"synonyms":["defrocking","laicization","disordination"],"phonetic":"/diˌɔɹdəˈneɪʃən/","extraExplanation":["“deordination”在现代英语中非常少见，更常见的说法包括：\n- “defrocking”（口语/新闻中常用，指剥夺神职人员身份）\n- “laicization”（天主教语境较常见，指将神职人员转为平信徒身份）\n不同宗派对程序、法律效力与用词会有差异。"]}
{"word":"deore","summary":{"en":"Deore is the name of Shimano’s mid-range mountain-bike component group (groupset).","zh":"Deore 是禧玛诺（Shimano）中端山地车零件套件系列的名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a product name for a mid-range Shimano mountain-bike component group (groupset), commonly referring to parts like derailleurs, shifters, cranks, and brakes.","zh":"（商品名）禧玛诺（Shimano）的一条中端山地车零件套件（传动/刹车系列）名称，常指后拨、变速把、牙盘、刹车等部件。"},"examples":[{"en":"This bike comes with a Shimano Deore drivetrain.","zh":"这辆车配的是禧玛诺 Deore 传动。"},{"en":"I upgraded from Altus to Deore for smoother shifting.","zh":"我从 Altus 升级到 Deore，换挡更顺更稳。"},{"en":"Deore is a popular choice for trail riding because it balances price and performance.","zh":"Deore 因为性价比高，是林道/越野骑行很常见的选择。"}]}],"synonyms":["Shimano Deore","Deore groupset","Deore drivetrain"],"phonetic":"/diˈɔreɪ/","extraExplanation":["“Deore”不是普通英语词汇，更多是在骑行语境里作为专有名词出现（Shimano 的产品线名称）。在山地车常见的 Shimano 等级里，Deore 通常被认为是“中端、耐用、性能够用”的系列；不同年份会有不同代号（如 M5100 等），具体规格也会随代际更新。"]}
{"word":"deorganization","summary":{"en":"Deorganization means removing or losing an organized structure or coordination, especially in a group or system.","zh":"Deorganization 指（尤其在团体或系统中）组织结构或协调性被移除或丧失，导致不再有序。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of removing organization, structure, or coordination from something (often an institution, system, or group), or the state of being less organized","zh":"（对机构、系统或团体等）去组织化；使结构、秩序或协调性被削弱的过程；或变得不那么有组织的状态"},"examples":[{"en":"The merger caused deorganization in several departments, and people weren’t sure who was responsible for what.","zh":"合并导致几个部门出现去组织化，大家不清楚各自该负责什么。"},{"en":"Rapid policy changes led to deorganization in the workflow.","zh":"政策频繁变动导致工作流程去组织化。"}]}],"synonyms":["disorganization","disorder","breakdown","dismantling","loss of coordination"],"phonetic":"/diˌɔrɡənəˈzeɪʃən/","extraExplanation":["“deorganization”在现代英语中相对少见，更常见、更自然的说法通常是“disorganization（混乱/缺乏组织）”或“restructuring（重组）”“decentralization（去中心化）”。如果你想表达“变得更混乱”，用“disorganization”更贴近日常用法；如果强调“被刻意拆散/削弱组织结构”，用“deorganization”也可以，但多见于学术或组织研究语境。"]}
{"word":"deorganize","summary":{"en":"Deorganize means to disrupt or remove organization from something, making it less orderly.","zh":"Deorganize 指破坏或削弱某事物的组织性，使其变得不再有条理。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something less organized; to disrupt an organized system or plan","zh":"使（某事物）变得不再有条理；扰乱原本组织良好的系统或计划"},"examples":[{"en":"The sudden change in leadership deorganized the team’s workflow for weeks.","zh":"领导层的突然变动让团队的工作流程混乱了好几周。"},{"en":"If we keep adding tasks without a plan, we’ll deorganize the whole schedule.","zh":"如果我们不停地加任务却不做计划，整个日程就会被弄乱。"}]}],"synonyms":["disorganize","disorder","disrupt","throw into confusion","mess up"],"phonetic":"/diˈɔrɡəˌnaɪz/","extraExplanation":["“deorganize”在现代英语里比较少见，更常用的是“disorganize”。两者意思基本相同。","前缀“de-”常带有“去掉、反向、降低”的含义（如 devalue 降低价值、deactivate 使失效）。因此 deorganize 可以理解为“把组织性去掉/削弱”。"]}
{"word":"deorientalize","summary":{"en":"Deorientalize means to remove or reduce Orientalist (“exoticizing”) features or stereotypes from something.","zh":"deorientalize 指去除或弱化“东方主义/异国化”的呈现与刻板印象。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove or reduce “Oriental/Asian” styling, assumptions, or stereotypes from something; to make it less shaped by Orientalist ideas","zh":"（使）去“东方化”；去除或弱化对“东方/亚洲”的刻板呈现或“东方主义”色彩"},"examples":[{"en":"The museum revised its labels to deorientalize the exhibit and avoid exoticizing Asian cultures.","zh":"博物馆修改了展品说明，以去东方化处理，避免将亚洲文化“异国化”。"},{"en":"The director tried to deorientalize the costumes so they would not rely on clichés.","zh":"导演试图对服装做去东方化处理，让设计不再依赖陈词滥调。"}]}],"synonyms":["de-exoticize","decolonize (in cultural context)","reframe","contextualize"],"phonetic":"/diˌɔɹiˈɛntəˌlaɪz/","extraExplanation":["“deorientalize”常见于学术与文化评论语境，和后殖民研究相关。这里的“orientalize/东方化”往往指用西方视角把亚洲与中东等地区描绘成神秘、落后或充满异域风情的做法（与学者Edward Said提出的“东方主义/Orientalism”相关）。因此“deorientalize”强调减少这种凝视、尊重当事文化的复杂性与主体性。","拼写上也可见 de-Orientalize（更强调词源）；在现代英语里，“Oriental”描述“人”通常被认为不够尊重（尤其在美式英语中），更常用“Asian”等更具体的说法。"]}
{"word":"deorling","summary":{"en":"“Darling” means a loved person or a warm way to address someone; as an adjective it means “dear/beloved,” and informally “very nice.”","zh":"“darling”可指所爱的人或亲昵称呼；作形容词表示“亲爱的/心爱的”，口语中也可表示“很棒/很讨喜”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person you love very much; also used as a friendly name when speaking to someone (often a child or partner)","zh":"亲爱的人；也可作称呼（常用于伴侣或孩子）"},"examples":[{"en":"Come here, darling—I want to show you something.","zh":"过来，亲爱的——我想给你看个东西。"},{"en":"My darling is away on a business trip this week.","zh":"我亲爱的人这周出差了。"}]},{"partOfSpeech":"adj.","definition":{"en":"loved very much; dear","zh":"被深深爱着的；亲爱的"},"examples":[{"en":"She wrote a letter to her darling sister.","zh":"她给亲爱的妹妹写了一封信。"},{"en":"This photo of my darling dog makes me smile.","zh":"这张我心爱的小狗的照片让我微笑。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) very pleasant or excellent","zh":"（非正式）很棒的；非常讨人喜欢的"},"examples":[{"en":"What a darling little café!","zh":"这家小咖啡馆真可爱！"},{"en":"That’s a darling idea—let’s do it.","zh":"这个主意真棒——我们就这么办。"}]}],"synonyms":["dear","sweetheart","beloved","love (BrE, informal)"],"phonetic":"/ˈdɑrlɪŋ/","extraExplanation":["“deorling”不是现代英语里的常见拼写，更可能是拼写错误，通常想写的是“darling”。在古英语里，deor- 有“珍贵、亲爱”的含义，和现代英语 dear / darling 在感觉上相近。","语气提醒：对陌生人直接叫“darling”在某些场合可能显得过于亲密；在英美口语里，服务行业有时会用（尤其部分英式口音地区），但也可能让人不舒服，建议根据关系与场合使用。"]}
{"word":"deorsum","summary":{"en":"Deorsum is a rare, Latin-based word meaning “downward” or “toward the bottom,” mainly seen in older or specialized texts.","zh":"Deorsum 是一个源自拉丁语的罕用词，意思是“向下/朝底部”，多见于较旧或专业文本中。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(rare) Downward; toward the bottom; from above to below.","zh":"（罕用）向下；朝底部；从上到下。"},"examples":[{"en":"The old text describes water flowing deorsum from the cliff.","zh":"那篇古老的文本描述水从悬崖上向下（deorsum）流淌。"},{"en":"In anatomy, a note may use deorsum to mean “downward.”","zh":"在解剖学里，有时会用 deorsum 表示“向下”。"}]},{"partOfSpeech":"adj.","definition":{"en":"(specialized, describing position or direction) Located below; directed downward.","zh":"（专业用语，描述位置/方向）在下方的；向下的。"},"examples":[{"en":"The surgeon referenced a deorsum movement of the instrument.","zh":"外科医生提到器械的一个向下（deorsum）的动作。"}]}],"synonyms":["downward","down","below","downwards"],"phonetic":"/diˈɔr.səm/","extraExplanation":["deorsum 源自拉丁语，字面意思是“向下”。它在现代英语里非常少见，多出现在古典学术写作、早期科学/医学文献，或用于模仿拉丁文风格的表达。","更常见、也更自然的英语替换说法包括：downward, down, below, downwardly（较少用）。","阅读古书或学术注释时，看到 deorsum 往往可以直接理解为“向下/下行”，不必把它当成日常口语词汇来记。"]}
{"word":"deorsumvergence","summary":{"en":"A rare technical term meaning a downward coordinated eye movement.","zh":"一个少见的专业术语，指眼睛向下的协调眼动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Technical, vision science) A coordinated downward movement of the eyes (i.e., an eye-movement pattern directed down).","zh":"（专业：视觉科学）眼睛向下的协调运动（指眼动方向朝下的一类模式）。"},"examples":[{"en":"The patient showed limited deorsumvergence during the eye-movement exam.","zh":"在眼动检查中，患者的向下协同眼动（deorsumvergence）范围受限。"},{"en":"Researchers measured deorsumvergence to study how the brain controls vertical gaze.","zh":"研究人员测量向下协同眼动，以研究大脑如何控制垂直注视。"}]}],"synonyms":["downward gaze movement","down-vergence","vertical (downward) eye movement"],"phonetic":"/diˌɔr.səmˈvɝːrdʒəns/","extraExplanation":["这是一个非常少见、偏学术的术语，常见于眼科/神经眼科或视觉科学论文中。词形由拉丁语词根组合而来：deorsum（“向下”）+ vergence（“眼动的会聚/偏转”一类概念）。不同教材对“vergence / version”等分类的用法可能略有差异，所以在阅读论文时最好结合作者对术语的定义或实验任务（例如“向下凝视”“垂直眼跳”等）来理解。"]}
{"word":"deorsumversion","summary":{"en":"Deorsumversion means a downward turning movement, especially of the eye.","zh":"Deorsumversion 指向下的转动动作，尤指眼球向下旋转。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In anatomy/medicine) a downward turning movement, especially the downward rotation of the eye.","zh":"（解剖/医学）向下转动的动作，尤指眼球向下旋转。"},"examples":[{"en":"The neurologist tested the patient’s eye movements, including deorsumversion.","zh":"神经科医生检查了患者的眼球运动，包括向下转动（deorsumversion）。"},{"en":"Limited deorsumversion can suggest a problem with the muscles or nerves that move the eye downward.","zh":"向下转动受限可能提示控制眼球下转的肌肉或神经存在问题。"}]}],"synonyms":["downward rotation","downward gaze","infraversion"],"phonetic":"/diˈɔr.səmˌvɝʒ.ən/","extraExplanation":["这是一个较少见、偏专业的医学用词。词根来自拉丁语：deorsum（向下）+ version（转动、旋转）。临床上更常见的相关表达有“downward gaze（向下凝视）”或“downward rotation of the eye（眼球向下旋转）”。"]}
{"word":"deorusumduction","summary":{"en":"“deorusumduction” is not a standard English word; it is likely a misspelling. Please provide the correct spelling or the sentence it appears in.","zh":"“deorusumduction” 不是标准英文单词，可能是拼写错误。请提供正确拼写或它出现的句子。"},"synonyms":["reduction","reproduction","deconstruction","deodorization"],"extraExplanation":["“deorusumduction” 不是标准英文单词，常见词典里查不到；很可能是拼写错误。","你可以把它放回原句（提供上下文），或确认正确拼写，我就能给出准确释义与例句。","可能你想写的接近词（请核对拼写）：\n- reduction（减少；降低）\n- reproduction（复制；再现；繁殖）\n- deconstruction（解构；拆解分析）\n- deodorization（除臭）"]}
{"word":"deosculate","summary":{"en":"Deosculate is a very rare verb meaning “to kiss,” and in technical contexts, “to separate things that are touching/tangent.”","zh":"deosculate 是一个很罕见的动词，表示“亲吻”；在技术语境中也可指“使相接触/相切的事物分离”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(rare) to kiss.","zh":"（罕用）亲吻。"},"examples":[{"en":"In the old poem, the knight deosculated the lady’s hand before leaving.","zh":"在那首古老的诗里，骑士离开前亲吻了女士的手。"},{"en":"They deosculated briefly, then returned to the conversation.","zh":"他们短暂地亲吻了一下，然后回到谈话中。"}]},{"partOfSpeech":"vt.","definition":{"en":"(technical, rare) to separate things that are touching or just tangent (no longer “kissing”).","zh":"（技术/学术用语，罕用）使原本接触或相切的事物分离（不再“相吻/相切”）。"},"examples":[{"en":"The adjustment deosculated the two surfaces so they no longer touched.","zh":"这次调整使两个表面分离，不再接触。"}]}],"synonyms":["kiss","osculate (rare)","peck (informal)","smooch (informal)"],"phonetic":"/diːˈɑːskjəˌleɪt/","extraExplanation":["这个词非常少见，日常英语里几乎不用。表达“亲吻”通常用 kiss；如果是礼节性亲吻手背，可用 kiss her hand。","词源上它和 osculate（“亲吻/相切”）同源，来自拉丁语 osculum（“小嘴、亲吻”）。在几何/工程等语境里，“kissing”也常用来比喻两条曲线或两个表面“相切”。"]}
{"word":"deosil","summary":{"en":"Deosil means “clockwise,” especially in Scottish/Irish traditional or literary contexts.","zh":"Deosil 指“顺时针”，多用于苏格兰/爱尔兰的传统或文学语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Scotland, Ireland) In a clockwise direction; following the apparent path of the sun (also spelled “deasil”).","zh":"（苏格兰、爱尔兰用法）顺时针方向；沿着太阳看似运行的方向（也拼作 deasil）。"},"examples":[{"en":"They walked deosil around the church as part of the ceremony.","zh":"他们在仪式中沿着教堂顺时针绕行。"},{"en":"Turn deosil to tighten the lid.","zh":"把盖子顺时针转紧。"}]},{"partOfSpeech":"adj.","definition":{"en":"Moving or arranged clockwise; sunwise (less common).","zh":"（较少见）按顺时针移动的；顺着太阳方向的。"},"examples":[{"en":"The dancers formed a deosil circle.","zh":"舞者围成一个顺时针旋转的圆圈。"}]}],"synonyms":["clockwise","sunwise","deosil (variant: deasil)"],"phonetic":"/diˈzil/","extraExplanation":["“Deosil / deasil”源自盖尔语（与“向右、南方、太阳方向”相关）。在苏格兰与爱尔兰的民俗/仪式语境中，按太阳方向（顺时针）绕行常被视为吉祥或带来好运；相对的“widdershins”（逆时针）有时带有不吉利的传统含义。","现代日常英语里更常用的是“clockwise”。“deosil”多见于文学描写、民俗、历史或奇幻题材中，用来营造地域与传统氛围。"]}
{"word":"deossification","summary":{"en":"Deossification means a loss or removal of bone (reduced ossification), usually in medical or biological contexts.","zh":"Deossification 指骨组织减少或骨化程度降低（去骨化/脱骨），多用于医学或生物学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of removing bone tissue or making something less bony (a loss of ossification), especially in a medical or biological context","zh":"去骨化；脱骨（骨组织减少或骨化程度降低的过程），多用于医学或生物学语境"},"examples":[{"en":"After long periods in zero gravity, astronauts can experience bone loss that may be described as deossification.","zh":"在失重环境中停留很久后，宇航员可能出现骨量流失，这种现象有时可称为去骨化。"},{"en":"The study investigated deossification in older adults and how exercise might slow it down.","zh":"该研究考察了老年人的去骨化过程，以及运动可能如何减缓这一过程。"}]}],"synonyms":["bone loss","loss of ossification","demineralization (related)","osteopenia (related)"],"phonetic":"/diˌɑːsəfɪˈkeɪʃən/","extraExplanation":["这是一个比较少见且偏专业的词，来自前缀 de-（表示“去除、减少”）+ ossification（骨化）。日常英语里更常用的说法是 bone loss（骨质流失）或 demineralization（脱矿/矿物质减少），医学语境中也常见 osteoporosis（骨质疏松）。","在不同学科里，它可能指：①身体骨组织减少（如长期卧床、失重、衰老）；②某些动物或结构在进化/发育中“骨化程度降低”（更偏生物学讨论）。"]}
{"word":"deossify","summary":{"en":"Deossify means to remove or reverse ossification—making something no longer bony.","zh":"deossify 指“去骨化/逆转骨化”，使某物不再呈骨质或不再骨化。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To remove bone or bony tissue from something; to make something less bony or no longer ossified (often in a medical or biological context).","zh":"使去骨化；去除（某物的）骨质/骨化组织；使不再骨化（常用于医学或生物学语境）。"},"examples":[{"en":"Surgeons may need to deossify the area to relieve pressure on the nerve.","zh":"外科医生可能需要对该区域进行去骨化处理，以减轻对神经的压迫。"},{"en":"Researchers studied how certain enzymes could deossify hardened tissue in the lab.","zh":"研究人员在实验室中研究某些酶如何使硬化组织去骨化。"}]}],"synonyms":["decalcify","soften","remove bone","debone"],"phonetic":"/diˈɔsəˌfaɪ/","extraExplanation":["这个词比较少见，多出现在医学、解剖学或生物学写作中。构词上是前缀 de-（表示“去除、逆转”）+ ossify（骨化）。日常英语里更常用的表达可能是 “remove the bone / decalcify（脱钙）/ soften the tissue（软化组织）”，具体用哪个取决于过程是否涉及“骨化/钙化”。"]}
{"word":"deota","summary":{"en":"“Deota” is not a common English word; it’s probably a misspelling or a name.","zh":"“deota”不是常见英语词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling or a proper name. Common nearby English words people may mean include “devote,” “quota,” or “data,” depending on context.","zh":"不是标准英语单词；可能是拼写错误或专有名词。根据语境，人们可能想写的是 devote（奉献/专心于）、quota（配额）或 data（数据）等相近词。"},"examples":[{"en":"I can’t find “deota” in major English dictionaries—could you share the sentence you saw it in?","zh":"在主流英语词典里找不到“deota”——你能把它出现的句子发我吗？"},{"en":"If you meant “devote,” you could say: “She devotes her time to teaching.”","zh":"如果你想写“devote”，可以说：“她把时间投入到教学中。”"}]}],"phonetic":"/diˈoʊtə/","extraExplanation":["如果你愿意，把“deota”所在的整句、以及你想表达的中文意思发来（例如：想说“配额/数据/奉献/某个人名或地名”），我可以帮你准确判断应当是哪一个词，并给出正确拼写、发音和用法。"]}
{"word":"deoxidant","summary":{"en":"A deoxidant is a chemical added to remove oxygen, especially in metal processing.","zh":"deoxidant 指脱氧剂，常用于金属加工中去除氧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance used to remove oxygen from a material (especially molten metal) to prevent oxidation and improve quality","zh":"脱氧剂；用于从材料（尤指熔融金属）中去除氧的物质，以防止氧化并提高质量"},"examples":[{"en":"In steelmaking, a deoxidant is added to the molten steel to reduce oxygen content.","zh":"在炼钢过程中，会向熔融钢中加入脱氧剂以降低含氧量。"},{"en":"Aluminum is a common deoxidant in metal production.","zh":"铝是金属生产中常见的脱氧剂。"}]}],"synonyms":["deoxidizer","oxygen scavenger","reducing agent"],"phonetic":"/diˈɑk.sɪ.dənt/","extraExplanation":["该词多用于冶金与材料工程语境。常见脱氧剂包括铝（aluminum）、硅（silicon）、锰（manganese）等，用来减少钢液中的溶解氧，避免产生气孔、夹杂等缺陷。","词形结构：de-（去除、除去）+ oxid-（氧化）+ -ant（……剂/……物质），字面意思就是“去氧化的物质/脱氧的药剂”。","注意区分：deoxidant（脱氧剂，主要用于去除氧）与 antioxidant（抗氧化剂，主要用于抑制氧化反应，常见于食品、化妆品、医学等）。"]}
{"word":"deoxidate","summary":{"en":"Deoxidate means to remove oxygen from a substance (a technical term similar to deoxidize).","zh":"deoxidate 指“脱氧/去氧”，是较少见的技术用词，含义接近 deoxidize。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to remove oxygen from something; to reduce an oxidized substance (technical: same idea as “deoxidize”).","zh":"（技术用语）去氧；脱氧；把（物质）从氧化状态还原（含义接近 deoxidize）。"},"examples":[{"en":"The technician deoxidated the metal surface before welding.","zh":"焊接前，技术员先对金属表面进行了脱氧处理。"},{"en":"Some processes use chemicals to deoxidate oils and prevent off-flavors.","zh":"有些工艺会用化学方法给油脂脱氧，以避免产生异味。"}]}],"synonyms":["deoxidize","deoxygenate","reduce"],"phonetic":"/diˈɑksɪˌdeɪt/","extraExplanation":["“deoxidate”在现代英语中比较少见，更常用的是“deoxidize”（美式）或“deoxidise”（英式）。在冶金、化工、食品加工等语境里常见“deoxidation（脱氧）”“deoxidizer（脱氧剂）”等搭配。","词形提示：de-（去除）+ oxid-（氧化）+ -ate（动词后缀）。在技术写作中，为了更自然、更常见，建议优先使用“deoxidize”。"]}
{"word":"deoxidation","summary":{"en":"Deoxidation means removing oxygen, especially as an industrial step in processes like steelmaking.","zh":"Deoxidation 指“脱氧/去氧”，尤其常指炼钢等工业过程中进行的脱氧工序。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of removing oxygen from a material or chemical system (often to prevent oxidation or improve product quality)","zh":"脱氧；去氧（从材料或化学体系中去除氧，常用于防止氧化或提高产品质量）"},"examples":[{"en":"Deoxidation is used in steelmaking to reduce oxygen dissolved in molten steel.","zh":"在炼钢中会进行脱氧，以减少熔融钢中溶解的氧。"},{"en":"Proper deoxidation can improve the metal’s toughness and surface quality.","zh":"适当的脱氧可以提高金属的韧性和表面质量。"}]},{"partOfSpeech":"n.","definition":{"en":"a specific industrial treatment step where deoxidizing agents are added to remove oxygen (especially in metallurgy)","zh":"（工业）脱氧处理步骤（尤指冶金中加入脱氧剂以去除氧的工序）"},"examples":[{"en":"After deoxidation, the melt is poured into molds.","zh":"脱氧之后，将熔体浇入模具。"},{"en":"Aluminum is commonly used as a deoxidation agent in some alloys.","zh":"在一些合金中，铝常被用作脱氧剂。"}]}],"synonyms":["oxygen removal","deoxygenation (common in water/chemistry contexts)","reduction (broader, depending on context)"],"phonetic":"/diˌɑk.sɪˈdeɪ.ʃən/","extraExplanation":["在冶金语境里，deoxidation 常与 steelmaking（炼钢）/molten steel（熔融钢）一起出现。常见脱氧剂包括 aluminum（铝）、silicon（硅）、manganese（锰）。脱氧的目的之一是减少气孔与夹杂，提高成品性能与外观。","词形拆解：de-（去除）+ oxidation（氧化）→ deoxidation（去氧/脱氧）。与 oxidation（氧化）相反。"]}
{"word":"deoxidative","summary":{"en":"Deoxidative means removing oxygen from something, especially in chemistry or metallurgy.","zh":"deoxidative 指“脱氧的、去除氧的”，多用于化学或冶金等专业语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Removing oxygen from a substance; causing deoxidation (reduction).","zh":"（化学）去除某物中的氧；起到脱氧作用的（即使其发生脱氧/还原）。"},"examples":[{"en":"A deoxidative process is used to remove oxygen from molten metal before casting.","zh":"在浇铸前，会用脱氧工艺去除熔融金属中的氧。"},{"en":"The manufacturer adds a deoxidative agent to reduce oxidation defects.","zh":"厂家加入脱氧剂，以减少氧化造成的缺陷。"}]}],"synonyms":["deoxidizing","reducing","oxygen-removing"],"phonetic":"/diˌɑk.sɪˈdeɪ.tɪv/","extraExplanation":["“de-”表示“去除、反向”，而“oxidative”与“氧化”有关；因此 deoxidative 常见于材料科学、冶金与化学语境，描述“脱氧/还原”相关的性质或过程。日常英语里较少用，更常见的表达有 deoxidizing（脱氧的）或 deoxidation（脱氧作用/脱氧过程）。"]}
{"word":"deoxidator","summary":{"en":"A deoxidator is a chemical added to remove oxygen, especially in metal processing, to prevent oxidation defects.","zh":"deoxidator 指“脱氧剂”，用于去除氧，常见于金属加工中以减少氧化缺陷。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance added to remove oxygen (or oxygen compounds) from a material, especially molten metal, to prevent unwanted oxidation","zh":"脱氧剂；用于去除材料中的氧（或含氧化合物）的物质，尤指加入熔融金属以防止不良氧化"},"examples":[{"en":"In steelmaking, aluminum can be used as a deoxidator to reduce dissolved oxygen in the melt.","zh":"在炼钢中，铝可作为脱氧剂来降低钢液中的溶解氧。"},{"en":"Using the right deoxidator helps prevent blowholes and improves the quality of the casting.","zh":"使用合适的脱氧剂有助于防止气孔，并提高铸件质量。"}]}],"synonyms":["deoxidizer","deoxidising agent","oxygen scavenger"],"phonetic":"/diːˈɑːk.səˌdeɪ.tɚ/","extraExplanation":["“deoxidator”在工程与冶金语境中能见到，但更常用的写法是“deoxidizer”（美式）或“deoxidiser”（英式）。含义基本相同。","常见脱氧剂包括铝（Al）、硅（Si）、锰（Mn）等；它们与氧反应生成氧化物，从而把氧“带走”。"]}
{"word":"deoxidisation","summary":{"en":"Deoxidisation means the industrial/chemical process of removing oxygen, especially from molten metals.","zh":"Deoxidisation 指脱氧/去氧的工艺或过程，尤指从熔融金属中去除氧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of removing oxygen from a substance, especially from molten metal during manufacturing","zh":"脱氧；去氧（指从物质中去除氧，尤指在制造过程中从熔融金属中去除氧）"},"examples":[{"en":"Deoxidisation is used in steelmaking to reduce dissolved oxygen that can cause defects.","zh":"炼钢中会进行脱氧，以减少溶解氧，避免产生缺陷。"},{"en":"Adding aluminum can help with deoxidisation in some metal processes.","zh":"在某些金属工艺中，加入铝可以帮助脱氧。"}]}],"synonyms":["deoxidation","deoxidization","deoxygenation"],"phonetic":"/diˌɑk.sə.dəˈzeɪ.ʃən/","extraExplanation":["这个词在英式拼写中常见作 deoxidisation（也可见 deoxidation / deoxidization）。核心概念是“把氧去掉”，与化学里的 reduction（还原）密切相关，但在工业语境里更常强调“工艺步骤”（例如炼钢中的脱氧处理）。","在冶金里脱氧的目的通常是减少氧化夹杂、气孔和脆性等问题。常见脱氧剂包括铝（Al）、硅（Si）和锰（Mn），不同材料与工艺会选择不同方案。"]}
{"word":"deoxidise","summary":{"en":"To remove oxygen or reduce oxidation, especially in industrial/chemical contexts.","zh":"去除氧或降低氧化程度，常用于工业/化学语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove oxygen from something (often a chemical substance or metal), or to reduce its oxidation","zh":"给某物去氧（常指化学物质或金属），或使其还原、减少氧化"},"examples":[{"en":"The technician deoxidised the copper to improve its conductivity.","zh":"技术员对铜进行去氧处理，以提高其导电性。"},{"en":"These additives help deoxidise molten steel during manufacturing.","zh":"这些添加剂在生产过程中帮助对熔融钢进行脱氧。"}]}],"synonyms":["deoxidize","reduce","remove oxygen","deoxygenate"],"phonetic":"/diːˈɑːk.sɪ.daɪz/","extraExplanation":["英式拼写：deoxidise（美式常写作 deoxidize）。","常见语境：冶金（钢铁“脱氧”）、化学反应（去除氧或发生还原）。与“rust（生锈）”相关但不等同：deoxidise 更强调工艺/反应去除氧或降低氧化程度。"]}
{"word":"deoxidised","summary":{"en":"“Deoxidised” means oxygen has been removed, especially from metals, to prevent oxidation and improve quality.","zh":"“deoxidised”指（尤指金属）经过脱氧处理、去除了氧，以防氧化并提升材料品质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a substance, especially metal or steel) having had oxygen removed to prevent oxidation and improve quality.","zh":"（尤指金属或钢）已去除氧（脱氧的），以防止氧化并提高品质。"},"examples":[{"en":"Deoxidised steel is used to reduce defects like bubbles and weak spots.","zh":"脱氧钢用于减少气泡、疏松等缺陷。"},{"en":"The manufacturer specifies deoxidised copper for better electrical performance.","zh":"厂家规定使用脱氧铜以获得更好的电性能。"}]},{"partOfSpeech":"v.","definition":{"en":"(past participle form) removed oxygen from; treated to take out oxygen.","zh":"（过去分词形式）已去除氧；经过脱氧处理。"},"examples":[{"en":"The molten metal was deoxidised before casting.","zh":"熔融金属在浇铸前进行了脱氧处理。"},{"en":"This oil has been deoxidised to slow down rancidity.","zh":"这种油经过脱氧处理，以减缓酸败。"}]}],"synonyms":["deoxygenated","deoxidized","oxygen-free"],"phonetic":"/diːˈɑːk.sə.daɪzd/","extraExplanation":["“deoxidised”是英式拼写，美式更常见写法是“deoxidized”。两者意思相同。","在冶金语境里常见搭配：deoxidised steel（脱氧钢）、deoxidised copper（脱氧铜）。脱氧的目的通常是减少氧含量带来的脆性、气孔等问题。","词形拆解：de-（去除）+ oxidise（氧化/与氧作用）。因此字面意思是“去氧/去氧化作用”。"]}
{"word":"deoxidiser","summary":{"en":"A deoxidiser is a chemical used to remove oxygen, especially during metal production.","zh":"deoxidiser 指用于去除氧的化学物质，尤其常用于金属生产过程中的脱氧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance added to remove oxygen (or oxygen compounds), especially from molten metal during manufacturing","zh":"脱氧剂；除氧剂（指用于去除氧或含氧化合物的物质，尤指在金属冶炼/加工中给熔融金属脱氧）"},"examples":[{"en":"Aluminum can act as a deoxidiser in steelmaking to reduce unwanted oxygen in the melt.","zh":"在炼钢中，铝可以作为脱氧剂，减少熔体中不需要的氧。"},{"en":"The manufacturer added a deoxidiser to improve the metal’s toughness and surface quality.","zh":"生产商加入脱氧剂以提高金属的韧性和表面质量。"}]}],"synonyms":["deoxidizer","oxygen scavenger","deoxygenating agent"],"phonetic":"/diːˈɑːk.səˌdaɪ.zɚ/","extraExplanation":["“deoxidiser”是英式拼写；美式更常写作“deoxidizer”。两者意思相同。","在冶金语境里常见的脱氧剂有铝（Al）、硅（Si）、锰（Mn）等，用来减少氧导致的气孔、夹杂等缺陷。"]}
{"word":"deoxidising","summary":{"en":"Deoxidising means removing oxygen, especially in chemistry and metallurgy; it can describe the process or something that does it.","zh":"Deoxidising 指“脱氧、去除氧”，常用于化学和冶金领域；既可指过程，也可作形容词描述“具有脱氧作用的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"removing oxygen from something, especially in a chemical or industrial process","zh":"（尤指在化学或工业过程中）去除氧、脱氧"},"examples":[{"en":"Deoxidising the metal helps prevent defects during casting.","zh":"对金属进行脱氧有助于防止铸造过程中出现缺陷。"},{"en":"The deoxidising step reduces unwanted oxidation in the final product.","zh":"脱氧这一步能减少成品中不需要的氧化现象。"}]},{"partOfSpeech":"adj.","definition":{"en":"used to describe an agent or process that removes oxygen","zh":"用于描述“能脱氧的”药剂或过程的"},"examples":[{"en":"A deoxidising agent was added to the molten steel.","zh":"向熔融钢中加入了脱氧剂。"},{"en":"They developed a deoxidising treatment for the surface.","zh":"他们开发了一种用于表面的脱氧处理。"}]}],"synonyms":["deoxygenating","reducing (oxygen content)","removing oxygen"],"phonetic":"/diːˈɑːksɪdaɪzɪŋ/","extraExplanation":["“deoxidising”是英式拼写；美式通常写作“deoxidizing”。两者意思相同。","该词常见于冶金、材料与化工语境：例如在炼钢中加入硅、铝等作为“脱氧剂（deoxidiser/deoxidizer）”，以降低钢液中的溶解氧，减少气孔等缺陷。"]}
{"word":"deoxidizable","summary":{"en":"“Deoxidizable” means able to be deoxidized—oxygen can be removed from it.","zh":"“Deoxidizable”表示“可去氧化的/可脱氧的”，即可以从中去除氧。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be deoxidized; capable of having oxygen removed (usually by a chemical process).","zh":"可去氧化的；能够被脱氧（通常指通过化学过程去除氧）。"},"examples":[{"en":"This metal oxide is deoxidizable at high temperatures with carbon.","zh":"这种金属氧化物在高温下可用碳进行脱氧，因此是可去氧化的。"},{"en":"Engineers chose a deoxidizable slag to help remove oxygen during refining.","zh":"工程师选择了可去氧化的炉渣，以在精炼过程中帮助去除氧。"}]}],"synonyms":["reducible","deoxidizable (technical variant usage: deoxidisable)"],"phonetic":"/diˌɑk.sɪˈdaɪ.zə.bəl/","extraExplanation":["这是一个较少见、偏技术的形容词，常见于冶金、材料科学、化学工艺等语境。词形结构为 de-（去除）+ oxidize（氧化）+ -able（能够……的），意思是“能够被去氧化/脱氧”。在更日常或常用的表达中，人们往往直接说 can be deoxidized（可以被脱氧/还原）或 reducible（可还原的），具体用哪个取决于是否强调“去除氧”这一点。"]}
{"word":"deoxidization","summary":{"en":"Deoxidization means removing oxygen from a material, especially in industrial or chemical processes.","zh":"Deoxidization 指“脱氧”，即在工业或化学过程中从材料中去除氧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of removing oxygen (or oxygen compounds) from a material, especially in metallurgy and chemistry","zh":"脱氧（脱氧化）作用：从材料中去除氧（或含氧化合物）的过程，尤用于冶金与化学"},"examples":[{"en":"Deoxidization is important in steelmaking to prevent defects caused by excess oxygen.","zh":"在炼钢中，脱氧很重要，可以避免多余氧导致的缺陷。"},{"en":"The lab report described the deoxidization step before storing the sample.","zh":"实验报告描述了在保存样品前的脱氧步骤。"}]}],"synonyms":["deoxidation","deoxygenation"],"phonetic":"/diˌɑk.sɪ.dəˈzeɪ.ʃən/","extraExplanation":["更常见的拼写是 deoxidation（美式）或 deoxidisation（英式）；deoxidization 也能见到，但相对少见。三者意思相同。","在冶金里，常用铝（Al）、硅（Si）、锰（Mn）等作为“脱氧剂”（deoxidizer）与钢液中的氧反应，减少气孔、夹杂等质量问题。"]}
{"word":"deoxidize","summary":{"en":"Deoxidize means to remove oxygen from something or reduce oxidation, especially in industrial or chemical contexts.","zh":"deoxidize 指去除物质中的氧或减少氧化，常见于化学与工业（如炼钢）语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove oxygen from a substance; to prevent or reduce oxidation (often in chemistry or manufacturing).","zh":"去氧；脱氧；（常用于化学或工业中）去除物质中的氧，或防止/减少氧化。"},"examples":[{"en":"Factories often deoxidize molten steel to improve its strength and quality.","zh":"工厂常对熔融钢进行脱氧处理，以提高其强度和质量。"},{"en":"This chemical is used to deoxidize water in the system and slow down corrosion.","zh":"这种化学品用于给系统中的水脱氧，从而减缓腐蚀。"}]}],"synonyms":["deoxygenate","reduce (oxidation)","remove oxygen"],"phonetic":"/diˈɑk.səˌdaɪz/","extraExplanation":["在冶金（尤其炼钢）里，deoxidize（脱氧）是非常常见的工序：会加入铝（Al）、硅（Si）、锰（Mn）等“脱氧剂”与氧反应，减少钢中的氧含量，降低气孔和夹杂等缺陷。","词形上，de- 表示“去除/反向”，oxidize 表示“氧化”，合起来就是“去氧化（去掉氧）”。常见相关词：deoxidation（n. 脱氧）、deoxidizer（n. 脱氧剂）。"]}
{"word":"deoxidized","summary":{"en":"Deoxidized means oxygen has been removed (often in metal-making) to reduce oxidation or impurities.","zh":"Deoxidized 指“去氧的/已去除氧的”，常用于冶金等领域以减少氧化或杂质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry/industry) Having had oxygen removed; treated to reduce or prevent oxidation.","zh":"（化学/工业）已去除氧；经过处理以减少或防止氧化的。"},"examples":[{"en":"Deoxidized copper is used when you need metal that resists oxidation during processing.","zh":"在需要金属在加工过程中不易氧化时，会使用去氧铜。"},{"en":"The steel was deoxidized before casting to improve its quality.","zh":"这种钢在浇铸前进行了去氧处理，以提高质量。"}]},{"partOfSpeech":"v.","definition":{"en":"Past form of “deoxidize”: removed oxygen from (a substance), usually to reduce oxidation or impurities.","zh":"“deoxidize”的过去式/过去分词：从（某物质）中去除氧，通常用于减少氧化或杂质。"},"examples":[{"en":"They deoxidized the molten metal to make it stronger and more consistent.","zh":"他们对熔融金属进行了去氧处理，使其更坚固、性质更稳定。"},{"en":"After the solution was deoxidized, it was stored in a sealed container.","zh":"溶液去氧后，被存放在密封容器中。"}]}],"synonyms":["deoxygenated","reduced","oxygen-free"],"phonetic":"/diˈɑk.səˌdaɪzd/","extraExplanation":["“de-”是常见前缀，表示“去掉/移除”；“oxidize”表示“氧化”。因此“deoxidize/deoxidized”直观意思就是“去氧/去氧后的”。","在冶金中，去氧常用于减少钢水或铜中的溶解氧，降低气孔等缺陷；常见去氧剂包括铝、硅、锰等。"]}
{"word":"deoxidizer","summary":{"en":"A deoxidizer is a substance used to remove oxygen and prevent oxidation, commonly in metalmaking and in oxygen-absorbing packaging.","zh":"deoxidizer 指用于去除氧气、防止氧化的物质，常见于炼钢等冶金过程以及食品包装的除氧保鲜中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance added to remove oxygen (or oxides) and prevent oxidation, especially in metalmaking and packaging","zh":"脱氧剂；除氧剂（用于去除氧气或氧化物、防止氧化，常见于炼钢与食品包装）"},"examples":[{"en":"Steelmakers add a deoxidizer to reduce oxygen in the molten metal.","zh":"炼钢时会加入脱氧剂来降低熔融金属中的氧含量。"},{"en":"The package contains a small deoxidizer sachet to keep the food fresh.","zh":"包装里有一小包除氧剂，以保持食物新鲜。"}]},{"partOfSpeech":"v.","definition":{"en":"to remove oxygen from a material or chemical system (less common; the verb form is usually “deoxidize”)","zh":"使脱氧；除去氧（较少用；动词通常用 deoxidize）"},"examples":[{"en":"Aluminum is used to deoxidize some molten metals during processing.","zh":"加工过程中，有时会用铝来对某些熔融金属进行脱氧处理。"}]}],"synonyms":["oxygen scavenger","deoxidizing agent","oxygen absorber"],"phonetic":"/diˈɑk.səˌdaɪ.zɚ/","extraExplanation":["在冶金领域，常见脱氧剂有铝（Al）、硅（Si）、锰（Mn）等，用来与氧反应生成稳定的氧化物，从而减少钢液中的溶解氧，降低气孔与夹杂等缺陷。","在食品与药品包装中，“除氧剂”常以小袋形式出现，常见成分是铁粉（与氧和水反应生成氧化铁），主要作用是降低包装内氧含量，抑制氧化变质与霉菌生长。","词形上：de-（去除）+ oxidize（氧化）。名词更常见写法是 deoxidizer；对应动词更常用 deoxidize。"]}
{"word":"deoxidizers","summary":{"en":"Deoxidizers are substances used to remove oxygen, especially in molten metals like steel.","zh":"Deoxidizers 指用于去除氧的物质，尤其常用于钢等金属熔体的脱氧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance added to remove oxygen (or oxygen-containing impurities), especially in metalmaking or chemical processes; plural of “deoxidizer.”","zh":"脱氧剂；去氧剂（用于去除氧或含氧杂质的物质，尤指冶金或化工过程中的添加剂；为 deoxidizer 的复数）"},"examples":[{"en":"Steelmakers add deoxidizers to molten steel to reduce unwanted oxygen.","zh":"炼钢厂会向钢水中加入脱氧剂，以减少不需要的氧。"},{"en":"Aluminum and silicon are common deoxidizers used during steel production.","zh":"铝和硅是在炼钢过程中常见的脱氧剂。"}]}],"synonyms":["oxygen scavengers","deoxygenating agents","reducing agents"],"phonetic":"/diːˈɑːksəˌdaɪzər/","extraExplanation":["在冶金中，“氧”常以溶解氧或氧化物夹杂的形式存在，可能导致钢材出现气孔、夹杂增多、韧性下降等问题。加入脱氧剂后，会与氧反应生成更稳定的氧化物，再通过上浮成渣或被控制为较少的夹杂来改善钢的质量。常见脱氧剂包括铝（Al）、硅（Si）、锰（Mn）等。"]}
{"word":"deoxidizes","summary":{"en":"“Deoxidizes” means “removes oxygen from something,” usually in chemical or industrial contexts.","zh":"“Deoxidizes”表示“使……脱氧/去除氧”，多用于化学或工业语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"removes oxygen from a substance (for example, during a chemical or industrial process); reduces oxidation","zh":"从物质中去除氧（如在化学或工业过程中）；使脱氧、降低氧化程度"},"examples":[{"en":"This chemical deoxidizes metal surfaces before welding.","zh":"这种化学品会在焊接前给金属表面脱氧。"},{"en":"The additive deoxidizes the steel and improves its quality.","zh":"这种添加剂能使钢脱氧并提升质量。"}]},{"partOfSpeech":"v.","definition":{"en":"to undergo a process in which oxygen is removed (less common; often expressed in the passive voice)","zh":"经历脱氧过程（较少见；常用被动语态表达）"},"examples":[{"en":"Under certain conditions, the compound deoxidizes quickly.","zh":"在某些条件下，这种化合物脱氧很快。"}]}],"synonyms":["deoxygenates","reduces","removes oxygen from"],"phonetic":"/diˈɑːksəˌdaɪz/","extraExplanation":["“deoxidizes”是动词“deoxidize”的第三人称单数现在时（he/she/it deoxidizes）。常见于冶金、焊接、化学工艺语境，指用脱氧剂（deoxidizer）去除金属或溶液中的氧，从而减少氧化、气孔等缺陷。"]}
{"word":"deoxidizing","summary":{"en":"Deoxidizing means removing oxygen (or using something that removes oxygen), often in chemistry and metalworking.","zh":"deoxidizing 指“脱氧/去氧”，也可指“具有脱氧作用的”，常见于化学与冶金语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"removing oxygen from a substance (especially in chemistry or metallurgy); the -ing form of “deoxidize.”","zh":"从物质中去除氧（尤用于化学或冶金）；“deoxidize”的 -ing 形式。"},"examples":[{"en":"The lab is deoxidizing the solution to prevent unwanted reactions.","zh":"实验室正在对溶液进行脱氧，以防止发生不需要的反应。"},{"en":"Deoxidizing molten steel helps reduce defects in the final product.","zh":"对熔融钢进行脱氧有助于减少成品中的缺陷。"}]},{"partOfSpeech":"adj.","definition":{"en":"used to describe a process, agent, or material that removes oxygen.","zh":"用于描述具有去氧作用的工艺、药剂或材料。"},"examples":[{"en":"They added a deoxidizing agent to improve the metal’s quality.","zh":"他们加入了脱氧剂来提高金属质量。"},{"en":"A deoxidizing step is required before the coating is applied.","zh":"在涂层施工前需要进行一道脱氧处理。"}]}],"synonyms":["removing oxygen","deoxygenating","reducing (oxygen content)","using a deoxidizer"],"phonetic":"/diːˈɑːksɪˌdaɪzɪŋ/","extraExplanation":["在冶金里，“deoxidizing（脱氧）”常指向熔融金属中加入脱氧剂（如铝、硅、锰等）来“抓住”多余的氧，减少气孔、夹杂等缺陷。","在水处理或化学工艺中，“deoxidizing”也可指降低溶液中的溶解氧，以减缓腐蚀或避免氧化副反应。"]}
{"word":"deoxy","summary":{"en":"“Deoxy-” means “deoxygenated” or “missing an oxygen,” and it’s mostly used as a prefix in scientific words (e.g., deoxyribose, deoxyhemoglobin).","zh":"“deoxy-”表示“脱氧/少一个氧（原子）”，主要作为前缀出现在科学术语中（如 deoxyribose、deoxyhemoglobin）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the removal or absence of oxygen (especially one oxygen atom) in a chemical compound; used mainly in chemistry and biology.","zh":"（尤指去掉一个氧原子后）与“脱氧/缺氧”有关的；多用于化学与生物学语境。"},"examples":[{"en":"DNA contains deoxyribose sugar, not ribose.","zh":"DNA 含有脱氧核糖，而不是核糖。"},{"en":"The term “deoxy” is common in biochemical names like deoxyadenosine.","zh":"“deoxy”常见于生化名称中，如 deoxyadenosine（脱氧腺苷）。"}]},{"partOfSpeech":"other","definition":{"en":"A combining form (deoxy-) meaning “deoxygenated” or “having one fewer oxygen atom,” used to form scientific terms.","zh":"构词成分（deoxy-）：表示“脱氧的/少一个氧原子的”，用于构成科学术语。"},"examples":[{"en":"Deoxy- + ribose → deoxyribose.","zh":"deoxy- + ribose → deoxyribose（脱氧核糖）。"},{"en":"Deoxyhemoglobin is hemoglobin that is not bound to oxygen.","zh":"deoxyhemoglobin 指未与氧结合的血红蛋白（脱氧血红蛋白）。"}]}],"synonyms":["deoxygenated","oxygen-free (context-dependent)"],"phonetic":"/diːˈɑːk.si/","extraExplanation":["“deoxy-”来自“de-（去除）+ oxy（氧）”。在化学命名里，它常表示分子中相对原结构“少了一个氧原子”，例如 ribose（核糖）与 deoxyribose（脱氧核糖）的区别。","学习提示：日常英语里很少单独说“deoxy”，更常见的是它作为前缀出现在专业词里（如 deoxyribonucleic acid = DNA，deoxyhemoglobin 等）。"]}
{"word":"deoxyanisoin","summary":{"en":"Deoxyanisoin is a chemistry term for an aromatic ketone compound used mainly in research and organic synthesis.","zh":"Deoxyanisoin 是化学术语，指一种芳香族酮类化合物，主要用于科研与有机合成。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a specific organic chemical compound (an aromatic ketone), used mainly as an intermediate in organic synthesis and research","zh":"一种特定的有机化合物（芳香族酮），主要用作有机合成与科研中的中间体"},"examples":[{"en":"Deoxyanisoin is used as a starting material to make more complex aromatic compounds.","zh":"Deoxyanisoin 可作为起始原料，用来合成更复杂的芳香族化合物。"},{"en":"In the lab, the sample of deoxyanisoin was weighed before the reaction.","zh":"在实验室里，反应前先称量了 deoxyanisoin 的样品。"}]}],"synonyms":["deoxy-anisoin","(possible structure name) 4,4′-dimethoxybenzyl ketone","anisoin (related compound)"],"phonetic":"/diˌɑːksiˈænɪsɔɪn/","extraExplanation":["这个词更常见于化学与材料/有机合成语境，一般日常英语中几乎不会用到。","拼写上你写的 deoxyanisoin 可能是化学品名的变体或少见写法；不同资料里也可能以“deoxy-anisoin”或用系统命名/结构名来标注。若你有化学式或使用场景（论文/实验步骤），我可以帮你确认更准确的对应名称与含义。"]}
{"word":"deoxybenzoin","summary":{"en":"Deoxybenzoin is an aromatic ketone used mainly as an intermediate in making other organic chemicals.","zh":"deoxybenzoin（脱氧二苯甲酮）是一种芳香族酮，主要用作合成其他有机化学品的中间体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (an aromatic ketone) used as an intermediate in making fragrances, pharmaceuticals, dyes, and other organic chemicals; also called benzyl phenyl ketone.","zh":"一种化学化合物（芳香族酮），常用作生产香料、药物、染料及其他有机化学品的中间体；也叫“苄基苯基酮”。"},"examples":[{"en":"Deoxybenzoin is often used as an intermediate in organic synthesis.","zh":"脱氧二苯甲酮常被用作有机合成的中间体。"},{"en":"The lab report lists deoxybenzoin as the starting material for the next reaction step.","zh":"实验报告把脱氧二苯甲酮列为下一步反应的起始原料。"}]}],"synonyms":["benzyl phenyl ketone"],"phonetic":"/diˌɑk.siˈbɛn.zɔɪn/","extraExplanation":["“deoxy-”在化学命名里常表示“去氧/少一个氧原子（相对于某个相关结构）”。在“deoxybenzoin”这个名称中，它指的是与更含氧的相关化合物相比，结构上少了某个氧特征，但日常学习中更常把它当作一个固定的化学品名称来记。","“deoxybenzoin”属于有机化学里常见的“芳香族酮（ketone）”家族；理解为“两个芳香环 + 一个酮基（C=O）”的骨架，有助于把它和其他类似物（如 benzophenone）联系起来。"]}
{"word":"deoxycholic","summary":{"en":"Deoxycholic means “related to deoxycholic acid,” a bile acid involved in fat digestion.","zh":"deoxycholic 指“与脱氧胆酸有关的”，脱氧胆酸是一种参与脂肪消化的胆汁酸。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to deoxycholic acid, a bile acid produced in the intestines that helps the body digest and absorb fats.","zh":"与“脱氧胆酸”有关的；脱氧胆酸是一种在肠道中形成的胆汁酸，帮助人体消化并吸收脂肪。"},"examples":[{"en":"Deoxycholic acid is one of the main secondary bile acids in humans.","zh":"脱氧胆酸是人体主要的次级胆汁酸之一。"},{"en":"Researchers measured deoxycholic levels to study changes in gut bacteria and bile acids.","zh":"研究人员测量脱氧胆酸水平，以研究肠道菌群与胆汁酸的变化。"}]}],"synonyms":["deoxycholate (related form)"],"phonetic":"ˌdiːˌɑk.siˈkoʊ.lɪk","extraExplanation":["“deoxycholic”通常不会单独使用，最常见搭配是“deoxycholic acid（脱氧胆酸）”。在医学与生物化学语境中，它属于胆汁酸体系：胆汁酸由肝脏产生、进入肠道帮助乳化脂肪；其中一部分会在肠道菌群作用下转变为“次级胆汁酸”，脱氧胆酸就是典型例子。","词形上可拆成：de-（去除）+ oxy（氧）+ cholic（与胆汁/胆酸有关）。因此字面含义接近“较少氧的胆酸”。"]}
{"word":"deoxycinchonine","summary":{"en":"Deoxycinchonine is a rare, technical chemistry term for a cinchona alkaloid related to cinchonine.","zh":"Deoxycinchonine 是一个较少见的专业化学词，指与辛可宁相关的一种金鸡纳生物碱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a naturally occurring cinchona alkaloid (a chemical compound related to cinchonine), found in Cinchona bark and studied mainly in organic/medicinal chemistry.","zh":"（化学）去氧辛可宁：一种金鸡纳生物碱，结构上与辛可宁（cinchonine）相关，来源于金鸡纳树皮，主要在有机/药物化学研究中出现。"},"examples":[{"en":"Deoxycinchonine is discussed in papers about cinchona alkaloids from bark extracts.","zh":"去氧辛可宁常见于研究金鸡纳树皮提取物中生物碱的论文中。"},{"en":"The lab compared deoxycinchonine with cinchonine to understand how small structural changes affect activity.","zh":"实验室将去氧辛可宁与辛可宁比较，以了解微小结构变化如何影响活性。"}]}],"synonyms":["(no common everyday synonym; sometimes described as a cinchonine derivative)"],"phonetic":"/diˌɑk.si.sɪŋˈkoʊ.niːn/","extraExplanation":["“deoxy-”在化学命名中常表示“少一个氧原子/去氧”的关系；因此 deoxycinchonine 通常指相对于 cinchonine 的“去氧衍生物”。","金鸡纳（Cinchona）树皮历史上因含奎宁（quinine）等生物碱而著名；deoxycinchonine 属于同一类相关化合物，但并非日常英语词汇，更多出现在专业文献与化学品目录中。"]}
{"word":"deoxycorticosterone","summary":{"en":"Deoxycorticosterone is an adrenal steroid hormone involved in salt-and-water balance and is a precursor to aldosterone.","zh":"deoxycorticosterone（脱氧皮质酮）是肾上腺产生的类固醇激素，参与盐和水的平衡调节，并可转化为醛固酮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a steroid hormone made by the adrenal glands that acts as a weak mineralocorticoid (helping regulate salt and water balance) and is a precursor to aldosterone.","zh":"一种由肾上腺产生的类固醇激素，具有较弱的盐皮质激素作用（帮助调节体内盐和水的平衡），也是醛固酮的前体。"},"examples":[{"en":"Deoxycorticosterone helps the body retain sodium and water, though it is weaker than aldosterone.","zh":"脱氧皮质酮能帮助身体保留钠和水，不过作用比醛固酮弱。"},{"en":"Doctors may measure deoxycorticosterone when evaluating certain adrenal hormone disorders.","zh":"在评估某些肾上腺激素相关疾病时，医生可能会检测脱氧皮质酮水平。"}]}],"synonyms":["DOC","11-deoxycorticosterone"],"phonetic":"/diˌɑksiˌkɔrtɪˈkoʊstərˌoʊn/","extraExplanation":["常见缩写是 DOC；更完整的名称也常写作 11-deoxycorticosterone（11-脱氧皮质酮）。","这是较偏医学/生理学用语，日常英语中很少出现，多见于内分泌学、药理学或检验报告。"]}
{"word":"deoxygenate","summary":{"en":"Deoxygenate means to remove oxygen from something, or to become low in oxygen.","zh":"deoxygenate 意为“去除氧/使脱氧”，也可指“氧含量降低（变得缺氧）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove oxygen from something, often as part of a chemical or industrial process","zh":"（常指在化学或工业过程中）去除……中的氧；使……脱氧"},"examples":[{"en":"The lab uses chemicals to deoxygenate the solution before the reaction.","zh":"实验室在反应前用化学品给溶液脱氧。"},{"en":"In some manufacturing steps, water is deoxygenated to reduce corrosion in pipes.","zh":"在一些制造工序中，会对水进行脱氧以减少管道腐蚀。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become low in oxygen; to lose oxygen","zh":"（氧含量）降低；失氧（常见于科学语境）"},"examples":[{"en":"If the river warms up, the water can deoxygenate and harm fish.","zh":"如果河水变暖，水体可能会缺氧（脱氧）并伤害鱼类。"},{"en":"Over time, poorly mixed tanks may deoxygenate near the bottom.","zh":"随着时间推移，搅拌不充分的储罐底部附近可能会出现缺氧（脱氧）。"}]}],"synonyms":["deoxidize","remove oxygen","oxygen-deplete"],"phonetic":"/diːˈɑksɪdʒəˌneɪt/","extraExplanation":["词形拆解：de-（去除、降低）+ oxygen（氧）+ -ate（动词后缀）。所以字面意思就是“把氧去掉/让氧减少”。","常见搭配：deoxygenate water（给水脱氧）、deoxygenate blood（使血液缺氧/脱氧，医学语境较少用，更多说 deoxygenated blood “缺氧血/静脉血”）、deoxygenate a solution（给溶液脱氧）。","与相关词区分：deoxygenated 指“缺氧的/脱氧的”（形容词）；oxygenate 指“充氧/增氧”。在环境科学里也常用 low-oxygen / oxygen-poor 来写得更通俗。"]}
{"word":"deoxygenated","summary":{"en":"Deoxygenated means oxygen has been removed or is very low, especially in blood or water.","zh":"deoxygenated 指“去氧的/缺氧的”，常用于血液或水体含氧量很低的情况。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having had oxygen removed; containing little or no oxygen (often used for blood, water, or environments).","zh":"去氧的；脱氧的；含氧量很低或几乎没有氧（常用于描述血液、水或环境）。"},"examples":[{"en":"Deoxygenated blood returns to the heart through the veins.","zh":"去氧血通过静脉回到心脏。"},{"en":"The fish died because the lake water became deoxygenated.","zh":"因为湖水缺氧（去氧化），鱼死了。"}]}],"synonyms":["oxygen-poor","low-oxygen","oxygen-depleted"],"phonetic":"/diˌɑk.sɪ.dʒəˈneɪ.tɪd/","extraExplanation":["在生理学里，\"deoxygenated blood\" 通常指“含氧量低的静脉血”，颜色较深（常被画成蓝色只是示意图习惯，并不是真的蓝色）。","在环境与水质语境中，水体“deoxygenated/low-oxygen”常与富营养化、藻类大量繁殖、分解作用消耗氧气有关，可能导致“dead zone（死区）”。"]}
{"word":"deoxygenates","summary":{"en":"“Deoxygenates” means removes oxygen or becomes low in oxygen.","zh":"“deoxygenates”表示去除氧气，或变得缺氧（含氧量降低）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to remove oxygen from something, or to cause something to have less oxygen","zh":"使……脱氧；去除……中的氧；使含氧量降低"},"examples":[{"en":"This chemical deoxygenates the water and slows down corrosion.","zh":"这种化学品会使水脱氧，从而减缓腐蚀。"},{"en":"The process deoxygenates the metal so it becomes less reactive.","zh":"这个过程会使金属脱氧，使其反应性降低。"}]},{"partOfSpeech":"vi.","definition":{"en":"(of blood or tissue) to lose oxygen; to become low in oxygen","zh":"（血液或组织）失去氧；缺氧；含氧量下降"},"examples":[{"en":"When circulation is blocked, the tissue deoxygenates quickly.","zh":"当血液循环受阻时，组织会很快缺氧。"},{"en":"Venous blood returns to the heart after it deoxygenates in the body.","zh":"静脉血在身体组织中失氧后回到心脏。"}]}],"synonyms":["removes oxygen","deoxygenize","oxygen-deplete","deplete oxygen"],"phonetic":"/diˈɑk.sɪ.dʒə.neɪts/","extraExplanation":["“de-”是常见前缀，表示“去除、减少”（如 dehydrate 脱水、deice 除冰）。因此 deoxygenate 字面意思就是“去掉氧”。","在科学写作里更常见的是形容词 oxygenated（含氧的）/ deoxygenated（脱氧的），例如 deoxygenated blood（脱氧血/静脉血）。"]}
{"word":"deoxygenating","summary":{"en":"Deoxygenating means removing oxygen or reducing oxygen levels in something (often water or air), and it can describe a process in progress.","zh":"Deoxygenating 指“去除氧或降低含氧量”，常用于水/空气等语境，也可表示“正在进行去氧处理”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"removing oxygen from something (or reducing its oxygen content).","zh":"去除（或降低）某物中的氧；使缺氧。"},"examples":[{"en":"The process involves deoxygenating the water to prevent corrosion in the pipes.","zh":"这个过程包括对水进行去氧处理，以防止管道腐蚀。"},{"en":"Scientists are studying how deoxygenating oceans affect marine life.","zh":"科学家正在研究海洋去氧化如何影响海洋生物。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or process of removing oxygen from something.","zh":"去氧（化）的行为或过程。"},"examples":[{"en":"Deoxygenating is common in industrial water treatment.","zh":"去氧处理在工业水处理里很常见。"},{"en":"They monitored deoxygenating in the tank during the experiment.","zh":"实验过程中，他们监测了水箱里的去氧过程。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “deoxygenate”: to remove oxygen from something.","zh":"“deoxygenate”的现在分词：去除某物中的氧。"},"examples":[{"en":"The system is deoxygenating the boiler feedwater before it enters the furnace.","zh":"该系统在锅炉给水进入炉膛前对其进行去氧处理。"},{"en":"By deoxygenating the solution, they reduced unwanted chemical reactions.","zh":"通过对溶液去氧，他们减少了不需要的化学反应。"}]}],"synonyms":["removing oxygen","oxygen removal","reducing oxygen levels","oxygen depletion"],"phonetic":"/diːˈɑːksɪdʒəˌneɪtɪŋ/","extraExplanation":["“de-”表示“去除/反向”（如 dehydrate 去水、decontaminate 去污染）；“oxygenate”表示“供氧/使含氧”。合起来 deoxygenate 就是“去氧”。","这个词常见于环保与科学语境：如“海洋去氧化（ocean deoxygenation）”指由于变暖、污染等因素导致海水溶解氧下降，会影响鱼类与珊瑚等生物。","写作里也可用更常见的说法替换：remove oxygen from…, reduce oxygen levels, oxygen depletion（氧耗竭/缺氧）。"]}
{"word":"deoxygenation","summary":{"en":"Deoxygenation means removing oxygen or reducing oxygen levels, especially in water, materials, or blood.","zh":"Deoxygenation 指“脱氧/去氧”，即去除氧气或降低含氧量，常用于水体、材料或血液等语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of removing oxygen (or reducing oxygen content) from a substance, liquid, or environment","zh":"脱氧；去氧（从物质、液体或环境中去除氧气或降低含氧量的过程）"},"examples":[{"en":"Deoxygenation of the water can harm fish and other aquatic life.","zh":"水体脱氧会伤害鱼类和其他水生生物。"},{"en":"The lab uses deoxygenation to prevent unwanted oxidation during the experiment.","zh":"实验室使用脱氧来防止实验过程中发生不需要的氧化反应。"}]},{"partOfSpeech":"n.","definition":{"en":"(biology/medicine) the loss of oxygen from blood, especially when blood releases oxygen to body tissues","zh":"（生物/医学）血液去氧（血液将氧释放给组织后含氧量下降）"},"examples":[{"en":"In the tissues, deoxygenation happens as cells use oxygen for energy.","zh":"在组织中，细胞利用氧产生能量，因此会发生血液去氧。"},{"en":"Deoxygenation of hemoglobin changes its color to a darker red.","zh":"血红蛋白去氧会使其颜色变得更深红。"}]}],"synonyms":["oxygen removal","deoxygenizing","oxygen depletion (context-dependent)"],"phonetic":"/diˌɑk.sɪ.dʒəˈneɪ.ʃən/","extraExplanation":["词形提示：de- 表示“去除/减少”，oxygen 是“氧气”，-ation 常用于构成“过程/结果”的名词，因此 deoxygenation 字面意思就是“去除氧气的过程”。","易混词：deoxygenation（去氧/脱氧，强调“氧气减少”）不等同于 detoxification（解毒，去除毒素）或 deoxidation（去氧化/除氧化物，常指把氧从化合物中去掉，语境更偏化学反应）。"]}
{"word":"deoxygenator","summary":{"en":"A deoxygenator removes oxygen (often dissolved oxygen) to prevent oxidation and corrosion.","zh":"deoxygenator 指用于去除氧气（常为溶解氧）以防氧化与腐蚀的装置或方法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A device, chemical, or process that removes oxygen from a liquid or gas (especially water) to prevent oxidation or corrosion.","zh":"脱氧器；除氧装置（用于从液体或气体中去除氧气，尤其是从水中除氧，以防止氧化或腐蚀）。"},"examples":[{"en":"The power plant installed a deoxygenator to protect the boiler system from corrosion.","zh":"发电厂安装了脱氧器，以保护锅炉系统免受腐蚀。"},{"en":"In water treatment, a deoxygenator can lower dissolved oxygen before the water enters metal pipes.","zh":"在水处理过程中，脱氧器可以在水进入金属管道前降低溶解氧含量。"}]}],"synonyms":["deaerator","oxygen scavenger","deoxidizer"],"phonetic":"/diˌɑksɪˈdʒɛnˌeɪtɚ/","extraExplanation":["在工业场景中，deoxygenator 常见于锅炉给水（boiler feedwater）系统与水处理工艺，用来去除“溶解氧”（dissolved oxygen），以减少金属设备的锈蚀（corrosion）。","相关词：deaerator（脱气器/除气器，常通过加热与喷淋把气体从水中赶出；很多场合与 deoxygenator 概念接近但不完全等同）；oxygen scavenger（除氧剂，通过化学反应“消耗”氧）。"]}
{"word":"deoxygenization","summary":{"en":"Deoxygenization means removing oxygen or causing oxygen levels to drop in a substance or system.","zh":"deoxygenization 指“脱氧/去氧化”，即移除氧或使系统中的含氧量下降。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of removing oxygen from a substance, mixture, or environment","zh":"脱氧；去氧化：把氧从物质、混合物或环境中移除的过程"},"examples":[{"en":"Deoxygenization of boiler water helps prevent corrosion in the pipes.","zh":"对锅炉水进行脱氧有助于防止管道腐蚀。"},{"en":"In some food packaging, deoxygenization slows spoilage and keeps products fresh longer.","zh":"在一些食品包装中，脱氧可以减缓变质，让产品更耐放。"}]},{"partOfSpeech":"n.","definition":{"en":"(biology/chemistry) the reduction of oxygen level in a system, such as water or tissue","zh":"（生物/化学）系统中氧含量降低的现象，例如水体或组织中的含氧量下降"},"examples":[{"en":"Deoxygenization in a lake can stress fish and other aquatic life.","zh":"湖泊缺氧（脱氧化）会使鱼类和其他水生生物承受压力。"},{"en":"The researcher measured deoxygenization rates under different temperatures.","zh":"研究人员测量了不同温度下的脱氧速率。"}]}],"synonyms":["deoxygenation","oxygen removal","deoxidation"],"phonetic":"/diˌɑksɪdʒənəˈzeɪʃən/","extraExplanation":["这个词在日常英语里相对少见，更常见的说法是 **deoxygenation**（更标准、使用更广）或 **oxygen removal**（更直白）。","构词上：**de-**（去除）+ **oxygen**（氧气）+ **-ization**（……化/过程），所以字面意思就是“去氧的过程”。不同领域用法略有差异：工程里常指“除氧处理”，环境/生物领域常用于描述“含氧量下降”。"]}
{"word":"deoxygenize","summary":{"en":"Deoxygenize means to remove oxygen from something, or to become low in oxygen.","zh":"deoxygenize 指“使……脱氧/去除氧气”，也可指“（某物）变成低氧状态”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove oxygen from something; to reduce the amount of oxygen present","zh":"使（某物）脱氧；去除氧气；降低含氧量"},"examples":[{"en":"Scientists deoxygenize the water sample to see how bacteria behave without oxygen.","zh":"科学家对水样进行脱氧，以观察细菌在无氧条件下的行为。"},{"en":"The process deoxygenizes the metal to prevent unwanted oxidation.","zh":"这个过程会使金属脱氧，以防止发生不需要的氧化反应。"}]},{"partOfSpeech":"vi.","definition":{"en":"to lose oxygen; to become low in oxygen","zh":"（某物）失去氧气；变成低氧状态"},"examples":[{"en":"Some lakes deoxygenize in hot weather when the water stops mixing well.","zh":"在炎热天气里，一些湖泊由于水体混合变差，会逐渐失氧。"}]}],"synonyms":["deoxygenate","remove oxygen","deoxidize (related but not identical)"],"phonetic":"/diːˈɑːksɪdʒənaɪz/","extraExplanation":["在美式英语里也常见拼写为 deoxygenate。两者意思相同，deoxygenate 更常用于科研与医学语境。","词形结构：de-（去除）+ oxygen（氧气）+ -ize（使……化）。通常用于化学、材料、环境科学（如水体缺氧）等场景。"]}
{"word":"deoxygenized","summary":{"en":"Deoxygenized means oxygen has been removed or is very low; it can also mean to remove oxygen from something.","zh":"deoxygenized 指“脱氧的/含氧量很低的”，也可作动词表示“使……脱氧”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having oxygen removed; containing little or no oxygen (often used in chemistry, biology, or medicine).","zh":"脱氧的；去除了氧气的；含氧量很低或几乎不含氧（常用于化学、生物或医学语境）。"},"examples":[{"en":"Deoxygenized blood returns to the heart through the veins.","zh":"脱氧血通过静脉回流到心脏。"},{"en":"The sample was kept in a sealed bottle to prevent it from becoming re-oxygenized.","zh":"样本被放在密封瓶中，以防再次吸氧。"}]},{"partOfSpeech":"vt.","definition":{"en":"To remove oxygen from (a substance or environment).","zh":"使（物质或环境）脱氧；去除其中的氧气。"},"examples":[{"en":"The researchers deoxygenized the water to study how fish respond to low-oxygen conditions.","zh":"研究人员对水进行脱氧处理，以研究鱼类对低氧环境的反应。"},{"en":"They deoxygenized the solution by bubbling nitrogen through it.","zh":"他们向溶液中通入氮气以进行脱氧。"}]}],"synonyms":["deoxygenated","oxygen-depleted","depleted of oxygen","anoxic (in some contexts)"],"phonetic":"/diːˈɑːksɪdʒənaɪzd/","extraExplanation":["“deoxygenized”在美式英语中能用，但更常见、也更标准的形式是“deoxygenated”。两者意思相同：都表示“去除氧气/脱氧”。在医学里常见搭配是“deoxygenated blood（脱氧血）”。"]}
{"word":"deoxygenizing","summary":{"en":"Deoxygenizing means removing oxygen from something, often in science or industry.","zh":"Deoxygenizing 指“去氧/脱氧”，常用于科学或工业语境中。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"removing oxygen from something (such as water, blood, or a chemical mixture).","zh":"从某物中去除氧气（如水、血液或化学混合物）。"},"examples":[{"en":"The lab is deoxygenizing the water to study how fish respond to low oxygen levels.","zh":"实验室正在给水去氧，以研究鱼类对低氧环境的反应。"},{"en":"Deoxygenizing the solution helps prevent unwanted oxidation during the reaction.","zh":"对溶液去氧有助于在反应过程中防止不希望发生的氧化。"}]},{"partOfSpeech":"adj.","definition":{"en":"describing a process or condition in which oxygen is being removed.","zh":"用于描述正在去除氧气的过程或状态。"},"examples":[{"en":"The deoxygenizing step must be completed before heating the mixture.","zh":"在加热混合物之前，必须完成去氧步骤。"},{"en":"They used a deoxygenizing agent to protect the metal surface.","zh":"他们使用了去氧剂来保护金属表面。"}]}],"synonyms":["deoxygenating","removing oxygen","deoxygenation"],"phonetic":"/diˌɑk.sɪ.dʒəˈnaɪ.zɪŋ/","extraExplanation":["“deoxygenizing”是动词“deoxygenize”的现在分词/动名词形式；英式拼写常见为“deoxygenising”。","在科学写作里也常用“deoxygenating”（意思基本相同），例如“deoxygenated water”（脱氧水）。","常见场景包括水处理（降低溶解氧）、化学反应（避免氧化副反应）以及生理学（deoxygenized blood：含氧量低的血液）。"]}
{"word":"deoxyguanosine","summary":{"en":"Deoxyguanosine is a DNA nucleoside (guanine + deoxyribose).","zh":"deoxyguanosine（脱氧鸟苷）是DNA中的一种核苷（鸟嘌呤 + 脱氧核糖）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A nucleoside made of the base guanine attached to deoxyribose (a sugar); it is a building block of DNA.","zh":"一种核苷，由鸟嘌呤（guanine）与脱氧核糖（deoxyribose）结合而成；是DNA的基本组成单位之一。"},"examples":[{"en":"Deoxyguanosine is found in DNA, not in RNA.","zh":"脱氧鸟苷存在于DNA中，而不是RNA中。"},{"en":"Scientists measured deoxyguanosine to study DNA damage.","zh":"科学家测量脱氧鸟苷来研究DNA损伤。"}]}],"synonyms":["dG","2'-deoxyguanosine"],"phonetic":"/diˌɑk.siˈɡwɑn.əˌsin/","extraExplanation":["词形拆解：deoxy- 表示“缺氧/去氧”（相对 RNA 的核糖 ribose 而言，DNA 使用 deoxyribose 脱氧核糖）；guanosine 指“鸟苷”（鸟嘌呤 guanine + 糖）。合起来就是“脱氧鸟苷”。","与相近词区分：deoxyguanosine 是“核苷”（base + sugar）；加上一个或多个磷酸基团（phosphate）后才叫“核苷酸”（如 deoxyguanosine monophosphate, dGMP；在DNA链中常以 dGTP 形式被用来合成）。","常见于生物化学、遗传学、药理学文献；日常英语中较少使用，更多在科研/医疗检测语境出现。"]}
{"word":"deoxyhexose","summary":{"en":"A deoxyhexose is a six-carbon sugar that has one fewer oxygen atom than a typical hexose.","zh":"deoxyhexose 指“脱氧己糖”：一种六碳糖，比典型己糖少一个氧原子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sugar with six carbon atoms (a hexose) that has one less oxygen atom than the usual hexose formula; a type of deoxysugar","zh":"一种含六个碳原子的糖（己糖），但比典型己糖少一个氧原子；属于“脱氧糖”的一种"},"examples":[{"en":"Fucose is a common deoxyhexose found on the surface of many human cells.","zh":"岩藻糖是一种常见的脱氧己糖，存在于许多人类细胞的表面。"},{"en":"Some bacterial cell walls contain deoxyhexoses that help the bacteria avoid immune detection.","zh":"某些细菌的细胞壁含有脱氧己糖，这可能帮助细菌躲避免疫系统识别。"}]}],"synonyms":["deoxysugar","6-carbon deoxysugar"],"phonetic":"/diˌɑk.siˈhɛk.soʊs/","extraExplanation":["词形拆解：deoxy- 表示“脱氧/缺氧原子”，hexose 表示“己糖（六碳糖）”。因此 deoxyhexose 字面意思就是“脱氧的六碳糖”。","在生物化学里，常见的脱氧己糖例子包括 fucose（岩藻糖）和 rhamnose（鼠李糖），它们常出现在糖链、糖蛋白、细菌多糖等结构中，影响细胞识别与免疫反应。"]}
{"word":"deoxynucleotide","summary":{"en":"A deoxynucleotide is a DNA building block (a nucleotide missing an oxygen compared with RNA nucleotides).","zh":"脱氧核苷酸是 DNA 的基本构件之一（相对 RNA 的核苷酸少一个氧）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A nucleotide that lacks one oxygen atom compared with a normal nucleotide; it is a building block of DNA (for example, dATP, dCTP, dGTP, dTTP).","zh":"脱氧核苷酸：与普通核苷酸相比少一个氧原子，是 DNA 的基本组成单位（如 dATP、dCTP、dGTP、dTTP）。"},"examples":[{"en":"DNA is made of four main deoxynucleotides: A, C, G, and T.","zh":"DNA 主要由四种脱氧核苷酸组成：A、C、G、T。"},{"en":"During DNA replication, the cell adds deoxynucleotides to the growing strand.","zh":"在 DNA 复制过程中，细胞把脱氧核苷酸加到不断延长的链上。"}]}],"synonyms":["DNA nucleotide","dNTP (in the triphosphate form)"],"phonetic":"/diˌɑksiˈnuːklioʊˌtaɪd/","extraExplanation":["“deoxy-”表示“缺氧/去氧”。在核酸里，这通常指糖的 2' 位少了一个羟基（OH），所以 DNA 用的是“脱氧核苷酸”，而 RNA 用的是“核苷酸”。","在写法上常见缩写：dNTP（deoxynucleoside triphosphate，脱氧核苷三磷酸）。其中三磷酸形式（如 dATP）是 DNA 聚合酶真正用来合成 DNA 的原料。"]}
{"word":"deoxyribonuclease","summary":{"en":"Deoxyribonuclease is an enzyme that cuts and breaks down DNA (often called DNase).","zh":"Deoxyribonuclease（脱氧核糖核酸酶）是一种能切割并分解DNA的酶（常简称DNase）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an enzyme that breaks down DNA by cutting its backbone (often used in biology and medicine).","zh":"脱氧核糖核酸酶：一种通过切割DNA骨架来分解DNA的酶（常用于生物学与医学）。"},"examples":[{"en":"Scientists added deoxyribonuclease to remove DNA contamination from the sample.","zh":"科学家加入脱氧核糖核酸酶来去除样品中的DNA污染。"},{"en":"Some lab protocols use deoxyribonuclease to make solutions less thick by breaking down DNA.","zh":"一些实验步骤会用脱氧核糖核酸酶分解DNA，从而降低溶液的黏稠度。"}]}],"synonyms":["DNase","deoxyribonucleic acid nuclease"],"phonetic":"/diˌɑk.sɪˌraɪ.boʊˈnuː.kli.eɪs/","extraExplanation":["词源拆解有助记忆：de-（去除）+ oxy（氧）+ ribo（核糖）+ nucleic（核酸的）+ -ase（“酶”后缀）。整体意思就是“作用于脱氧核糖核酸（DNA）的酶”。","常见简称是“DNase”（读作“dee-nase”）；在医学里，重组人DNase I（如dornase alfa）可用于帮助分解痰液中的DNA，使痰更易排出（例如某些囊性纤维化患者）。"]}
{"word":"deoxyribonucleic","summary":{"en":"Deoxyribonucleic means “related to DNA,” especially in the phrase deoxyribonucleic acid.","zh":"deoxyribonucleic 意为“与 DNA（脱氧核糖核酸）有关的”，常见于短语 deoxyribonucleic acid。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to DNA (deoxyribonucleic acid), the chemical in living things that carries genetic information.","zh":"与 DNA（脱氧核糖核酸）有关的；DNA 是生物体中携带遗传信息的化学物质。"},"examples":[{"en":"Deoxyribonucleic acid (DNA) stores the instructions for building and running a living organism.","zh":"脱氧核糖核酸（DNA）储存了构建并维持生物体运行的“说明书”。"},{"en":"Scientists compare deoxyribonucleic sequences to understand how species are related.","zh":"科学家比较脱氧核糖核酸序列来了解物种之间的亲缘关系。"}]}],"synonyms":["DNA (informal/common)"],"phonetic":"/diˌɑk.siˌraɪ.boʊˈnuː.kli.ɪk/","extraExplanation":["“deoxyribonucleic”常见于固定搭配“deoxyribonucleic acid（DNA）”。在日常英语中，这个形容词单独出现不多，人们更常直接说“DNA”。","词源拆解有助记忆：de-（去掉）+ oxy（氧）+ ribose（核糖）+ -nucleic（核/细胞核相关）。意思与“脱氧核糖核酸”对应：它的糖部分是“脱氧核糖（deoxyribose）”。"]}
{"word":"deoxyribonucleoprotein","summary":{"en":"Deoxyribonucleoprotein is the DNA–protein complex (often DNA with histones) that forms much of the material of chromosomes.","zh":"Deoxyribonucleoprotein 指由 DNA 与蛋白质（常为组蛋白）组成的复合体，是染色体的重要物质基础。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A complex made of DNA (deoxyribonucleic acid) and proteins, especially histone proteins; this complex is a major material of chromosomes in the cell nucleus.","zh":"由 DNA（脱氧核糖核酸）和蛋白质（尤其是组蛋白）组成的复合体；它是细胞核内染色体的重要组成材料。"},"examples":[{"en":"In eukaryotic cells, deoxyribonucleoprotein helps package DNA into chromosomes.","zh":"在真核细胞中，脱氧核糖核蛋白有助于把 DNA 打包成染色体。"},{"en":"Scientists study deoxyribonucleoprotein to understand how genes are turned on and off.","zh":"科学家研究脱氧核糖核蛋白，以了解基因如何被开启或关闭。"}]}],"synonyms":["DNA–protein complex","chromatin (related)","nucleoprotein (broader)"],"phonetic":"/diˌɑk.siˌraɪ.boʊˌnuː.kli.oʊˈproʊ.tiːn/","extraExplanation":["这个词很长，但结构很“拼接式”：deoxy-（脱氧）+ ribo-（核糖）+ nucleo-（核/核酸）+ protein（蛋白质）。意思基本就是“DNA + 蛋白质的复合体”。","现代生物学中更常见的相关词是 chromatin（染色质）和 nucleoprotein（核蛋白）。deoxyribonucleoprotein 属于更“严格说明含 DNA”的说法。"]}
{"word":"deoxyribonucleotide","summary":{"en":"A deoxyribonucleotide is one of the basic units that make up DNA.","zh":"deoxyribonucleotide 指构成 DNA 的基本单位之一（脱氧核苷酸）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A building block of DNA: a nucleotide that contains deoxyribose sugar, a phosphate group, and one nitrogen base (A, T, C, or G).","zh":"DNA 的基本构件之一：含有脱氧核糖、磷酸基团和一种含氮碱基（A、T、C、G）的核苷酸。"},"examples":[{"en":"DNA is made of four main deoxyribonucleotides: A, T, C, and G.","zh":"DNA 主要由四种脱氧核苷酸组成：A、T、C、G。"},{"en":"A mutation can occur when a deoxyribonucleotide is changed during DNA replication.","zh":"在 DNA 复制过程中，如果某个脱氧核苷酸发生改变，就可能产生突变。"}]}],"synonyms":["deoxynucleotide","DNA nucleotide"],"phonetic":"/diˌɑk.sɪˌraɪ.boʊˈnuː.kli.əˌtaɪd/","extraExplanation":["词源拆解：de-（去掉）+ oxy（氧）+ ribose（核糖）+ nucleotide（核苷酸）。之所以叫“脱氧”，是因为它的糖是“脱氧核糖”，比 RNA 里的“核糖”少一个氧原子。","对比记忆：DNA 用 deoxyribonucleotides（脱氧核苷酸），RNA 用 ribonucleotides（核糖核苷酸）。DNA 的碱基是 A/T/C/G；RNA 通常是 A/U/C/G（用 U 替代 T）。","常见学术写法：单个可写作 deoxyribonucleotide；复数 deoxyribonucleotides；也常说“deoxynucleotide”作简写。"]}
{"word":"deoxyribose","summary":{"en":"Deoxyribose is the sugar in DNA (not RNA).","zh":"脱氧核糖是DNA中的糖（不是RNA中的糖）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a five-carbon sugar (a type of pentose) that is part of DNA; it is like ribose but has one less oxygen atom","zh":"脱氧核糖：一种五碳糖（戊糖），是DNA的组成部分；与核糖相似，但少一个氧原子（因此叫“脱氧”）"},"examples":[{"en":"DNA contains deoxyribose, while RNA contains ribose.","zh":"DNA含有脱氧核糖，而RNA含有核糖。"},{"en":"The deoxyribose sugar helps form the backbone of the DNA strand.","zh":"脱氧核糖帮助构成DNA链的骨架（糖-磷酸骨架）。"}]}],"synonyms":["2-deoxyribose"],"phonetic":"/diˌɑk.siˈraɪ.boʊs/","extraExplanation":["词源提示：de-（去掉、缺少）+ oxy（氧）+ ribose（核糖）。所以deoxyribose字面意思是“缺少氧的核糖”。","在DNA里，脱氧核糖的“少一个氧”使DNA比RNA更稳定，这也是DNA适合长期储存遗传信息的原因之一。"]}
{"word":"deozonization","summary":{"en":"Deozonization means removing or decomposing ozone, often after ozone treatment.","zh":"Deozonization 指去除或分解臭氧，常发生在臭氧处理之后。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of removing or breaking down ozone (O₃), especially after ozone has been used for disinfection or treatment","zh":"脱臭氧化；去除/分解臭氧的过程（尤其指臭氧用于消毒或处理之后的去除）"},"examples":[{"en":"After ozonation, deozonization is needed to remove leftover ozone from the water.","zh":"臭氧处理之后，通常需要进行脱臭氧化，把水中残留的臭氧去除。"},{"en":"The system includes an ozone generator and a deozonization unit.","zh":"该系统包括臭氧发生器和脱臭氧化装置。"}]}],"synonyms":["ozone removal","ozone decomposition","de-ozonation"],"phonetic":"/diˌoʊzənəˈzeɪʃən/","extraExplanation":["这个词比较少见，多用于工程/环保语境，常见于水处理、食品加工、空气净化等场景：臭氧用于杀菌或氧化后，需要把“剩余臭氧”分解掉（例如用活性炭、热分解或催化剂），以避免对人体、设备或后续工艺产生刺激和腐蚀。","拼写上也可能见到带连字符的形式：de-ozonization；英式拼写有时写作 deozonisation。"]}
{"word":"deozonize","summary":{"en":"Deozonize means to remove ozone from something.","zh":"Deozonize 意为“去除臭氧；除臭氧”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove ozone from something (such as air, water, or a gas mixture).","zh":"去除臭氧；除臭氧（例如从空气、水或气体混合物中移除臭氧）。"},"examples":[{"en":"The system is designed to deozonize the air before it is released outdoors.","zh":"该系统旨在在排放到室外之前对空气进行去臭氧处理。"},{"en":"After ozonation, the water may be deozonized to protect downstream equipment.","zh":"臭氧处理后，水可能需要除臭氧，以保护下游设备。"}]}],"synonyms":["remove ozone","destroy ozone","de-ozonize"],"phonetic":"/diːˈoʊzoʊnaɪz/","extraExplanation":["“deozonize”很少见，更常见的写法是连字符形式“de-ozonize”，或用名词短语表达为“ozone removal（臭氧去除）/ ozone destruction（臭氧分解）”。在工程与环保语境中常见于臭氧消毒后，为避免残余臭氧对人员、材料或设备造成刺激/腐蚀而进行的后处理。","相关常见搭配：deozonization（除臭氧过程/步骤）、deozonizer（除臭氧装置）、catalytic deozonization（催化除臭氧）。"]}
{"word":"deozonizer","summary":{"en":"A deozonizer removes ozone (O₃) from air or gas.","zh":"deozonizer 指用于去除空气或气体中臭氧（O₃）的装置或物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device or chemical used to remove ozone (O₃) from air or gas, especially in industrial or laboratory settings","zh":"（尤指工业或实验室中）用于去除空气或气体中臭氧（O₃）的装置或化学品"},"examples":[{"en":"The exhaust line includes a deozonizer to protect workers from ozone exposure.","zh":"排气管路里装了除臭氧器，以保护工人避免接触臭氧。"},{"en":"After ozone sterilization, the air passes through a deozonizer before it is released.","zh":"臭氧消毒后，空气会先通过除臭氧器再排放。"}]}],"synonyms":["ozone destroyer","ozone scrubber","deozonation unit","ozone removal device"],"phonetic":"/diˈoʊzoʊnaɪzər/","extraExplanation":["“Deozonizer”相对少见，更常见的相关词是“ozone destroyer（臭氧分解器）”“ozone scrubber（臭氧洗涤器）”或“deozonation unit（除臭氧装置）”。不同场景会用不同叫法。","词形拆解：de-（去除）+ ozone（臭氧）+ -izer（使……的装置/物质）。","注意不要与“deodorizer（除臭剂/除臭器）”混淆；两者拼写和发音相近，但含义不同：deodorizer 去除气味，deozonizer 去除臭氧。"]}

