{"word":"DEQNA","summary":{"en":"DEQNA is a DEC-made Ethernet network adapter for Q-bus PDP-11–era systems.","zh":"DEQNA 是 DEC 为 Q-bus 的 PDP-11 等早期系统推出的以太网网络适配器（网卡）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A model of Ethernet network interface (adapter) made by Digital Equipment Corporation (DEC) for Q-bus PDP-11 and related systems; used to connect older DEC computers to an Ethernet network.","zh":"DEQNA 是数字设备公司（DEC）为 Q-bus 的 PDP-11 等系统推出的一种以太网网络接口卡/适配器，用于让早期 DEC 计算机连接到以太网。"},"examples":[{"en":"The lab’s PDP-11 reached the Ethernet through a DEQNA interface.","zh":"实验室的 PDP-11 通过 DEQNA 接口接入了以太网。"},{"en":"We found a DEQNA card in the storage room for the vintage DEC machine.","zh":"我们在储藏室里找到了那台复古 DEC 机器用的 DEQNA 网卡。"}]}],"synonyms":["Ethernet interface card","network adapter","DEC Q-bus Ethernet adapter"],"phonetic":"/ˌdi i ˌkjuː ˌɛn ˈeɪ/","extraExplanation":["DEQNA 通常被写成全大写，因为它是 DEC 的产品型号/缩写名。它与 1970–80 年代的 DEC 小型机与早期以太网历史有关，常见于复古计算、博物馆级设备维护或技术文档中。","读法上很多人会按字母逐个念（D-E-Q-N-A），因此口语里听起来像“dee-ee-kyoo-en-ay”。"]}
{"word":"dequantitate","summary":{"en":"“Dequantitate” means to remove quantization from data (similar to “dequantize”).","zh":"dequantitate 指对数据“去量化”，意思接近更常见的 dequantize。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove quantization (discrete, stepped values) from data, or to convert quantized values back into a more continuous form","zh":"对数据进行“去量化”；把离散的量化数值还原为更接近连续的形式"},"examples":[{"en":"After decoding the audio, the system dequantitates the signal to reduce the harsh “stepped” sound.","zh":"音频解码后，系统会对信号去量化，以减少那种生硬的“阶梯感”。"},{"en":"Some researchers use algorithms to dequantitate measurement results before further analysis.","zh":"一些研究者会在进一步分析前，用算法对测量结果进行去量化处理。"}]}],"synonyms":["dequantize","unquantize","reverse quantization"],"phonetic":"/diˌkwɑːn.təˈteɪt/","extraExplanation":["“dequantitate”在现代英语中非常少见，技术写作里更常用的是“dequantize / de-quantize（去量化）”。如果你是在信号处理、音频/视频编码或机器学习（量化模型）语境里看到它，通常就是“把量化后的离散数值还原/转换回更连续的表示”。","词形上它由前缀“de-（去除、逆向）”+“quantitate/quantize（量化）”构成，意义基本可从构词推断；但在正式论文或工程文档中，建议优先使用更标准的“dequantize”。"]}
{"word":"dequate","summary":{"en":"Adequate means enough for a purpose—satisfactory but not great.","zh":"Adequate 表示“够用/足够、适当”，通常指达到需要但不一定很好。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Enough in quantity or quality for a particular purpose; satisfactory but not excellent.","zh":"足够的；适当的；（质量或数量）满足需要的，但不一定出色。"},"examples":[{"en":"We have adequate time to finish the report today.","zh":"我们今天有足够的时间完成报告。"},{"en":"The hotel room was clean and adequate for one night.","zh":"这间酒店房间很干净，住一晚也算够用。"},{"en":"Make sure you get adequate sleep before the exam.","zh":"考试前要确保有充足的睡眠。"}]},{"partOfSpeech":"vt.","definition":{"en":"To make something adequate; to provide what is needed (rare in modern everyday English).","zh":"使足够；使适当（现代日常英语中较少用）。"},"examples":[{"en":"They tried to adequate the budget to meet basic needs.","zh":"他们试图把预算调整到能满足基本需求。"}]}],"synonyms":["sufficient","enough","acceptable","satisfactory","reasonable"],"phonetic":"/ˈædəkwət/","extraExplanation":["你输入的“dequate”通常是拼写错误；正确拼写是 **adequate**（前面要有 a-）。","常见搭配：adequate time / sleep / food / support（足够的时间/睡眠/食物/支持）。也常见于更正式语境：adequate evidence（充分证据）、adequate compensation（合理补偿）。","语气与近义词区别：adequate 强调“够用/达到最低要求”；如果想表达“很好/很优秀”，更常用 good / excellent / sufficient（其中 sufficient 更正式，侧重“足够”）。"]}
{"word":"Dequeen","summary":{"en":"Dequeen (often written de-queen) means to remove the queen bee from a hive; more rarely, it can mean to depose someone like a queen (figuratively).","zh":"Dequeen（常写作 de-queen）指在养蜂中移除蜂王；更少见时可比喻为废黜“女王”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove the queen bee from a hive (used in beekeeping).","zh":"（养蜂）把蜂王从蜂群/蜂箱中移除。"},"examples":[{"en":"The beekeeper decided to dequeen the colony because the queen was failing.","zh":"养蜂人决定给蜂群“去王”，因为蜂王状态不佳。"},{"en":"After they dequeened the hive, the workers began raising a new queen.","zh":"蜂箱去王后，工蜂开始培育新的蜂王。"}]},{"partOfSpeech":"vt.","definition":{"en":"to remove or strip someone of queenly status; to depose a queen (rare, often figurative).","zh":"（较少见，多为比喻）废黜女王；取消某人“女王”的地位。"},"examples":[{"en":"In the story, the heroine is dequeened by a rival at court.","zh":"在故事里，女主角被宫廷中的对手废黜。"},{"en":"The columnist joked that the celebrity had been “de-queened” by a newer star.","zh":"专栏作者开玩笑说，这位名人被更新的明星“夺走了女王地位”。"}]}],"synonyms":["de-queen","remove the queen","depose (figurative)","dethrone (figurative)"],"phonetic":"/diːˈkwiːn/","extraExplanation":["“dequeen”通常写作 de-queen 或 dequeen，属于由前缀 de-（表示“去除、取消”）+ queen 组成的动词。","在养蜂语境里很常见：去王后蜂群可能会培育新王，或便于更换蜂王、控制群势。","如果你看到的“Dequeen”是人名、网名或品牌名，它可能不是标准词义，而是借用“queen（女王）”的风格化拼写。"]}
{"word":"dequeen","summary":{"en":"Dequeen means to remove the queen bee from a hive, or more generally to deprive someone of “queen” status.","zh":"Dequeen 指在养蜂中移除蜂王，也可泛指让某人失去“女王”地位（比喻）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Beekeeping) To remove the queen bee from a hive or colony.","zh":"（养蜂）从蜂箱或蜂群中移除蜂王。"},"examples":[{"en":"The beekeeper decided to dequeen the colony to prevent swarming.","zh":"养蜂人决定给蜂群去王，以防分蜂。"},{"en":"After we dequeened the hive, we introduced a new queen the next day.","zh":"我们给蜂箱去王后，第二天引入了一只新蜂王。"}]},{"partOfSpeech":"vt.","definition":{"en":"To take away someone’s status as a queen; to dethrone or strip of a “queen” title (often figurative).","zh":"剥夺某人的“女王”身份；废黜、取消其“女王”称号（多为比喻用法）。"},"examples":[{"en":"In the story, the rebels aim to dequeen the tyrant queen.","zh":"在故事里，叛军打算废黜那位暴君女王。"},{"en":"The headline joked that the new champion had “dequeued” last year’s queen.","zh":"标题开玩笑说新冠军“让去年的女王退位了”。"}]}],"synonyms":["remove the queen","dethrone","depose","strip (of a title)","unseat"],"phonetic":"/diːˈkwiːn/","extraExplanation":["“dequeen”是比较少见的动词，常见于养蜂语境；写作中也有人写成“de-queen”（加连字符）来强调“去掉queen”的意思。","在日常英语里，更常用的表达是 beekeeping 里说“remove the queen / requeen”，比喻义里说“dethrone / depose / strip someone of a title”。"]}
{"word":"dequeue","summary":{"en":"“Dequeue” most commonly means to remove the front item from a queue; it can also refer to a double-ended queue (deque).","zh":"“dequeue”最常指队列的“出队”：移除队首元素；也可指“双端队列”（deque）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(computing) A data structure operation that removes (and often returns) the item at the front of a queue.","zh":"（计算机）队列的一种操作：从队首移除（并常常返回）一个元素。"},"examples":[{"en":"When you dequeue an element, the next element becomes the front of the queue.","zh":"当你执行 dequeue（出队）时，下一个元素会成为队首。"},{"en":"This function dequeues the first task and sends it to a worker thread.","zh":"这个函数把第一个任务出队并交给工作线程。"}]},{"partOfSpeech":"n.","definition":{"en":"A double-ended queue (also written as deque), where items can be added or removed at both ends.","zh":"双端队列（也写作 deque）：可以在队首和队尾都进行插入或删除的队列结构。"},"examples":[{"en":"Python’s collections.deque is a fast dequeue for adding and removing items from both ends.","zh":"Python 的 collections.deque 是一种高效的双端队列，适合在两端添加或移除元素。"},{"en":"Use a dequeue if you need to pop from the left and append to the right efficiently.","zh":"如果你需要高效地从左侧弹出、从右侧追加，就可以使用双端队列（dequeue）。"}]}],"synonyms":["pop (from a queue)","remove (the front item)","deque (double-ended queue)"],"phonetic":"/diːˈkjuː/","extraExplanation":["在很多教材与代码里：动词通常写作 enqueue（入队）/ dequeue（出队）；名词“双端队列”更常见拼法是 deque（读作 /dɛk/），而 dequeue 常被当作 deque 的另一种拼写或误拼。面试或写代码时，最好根据上下文判断：看到“dequeue()”多半是“出队操作”，看到“a deque”多半指“双端队列”这种数据结构。"]}
{"word":"dequeued","summary":{"en":"“Dequeued” means something was taken out of a queue (usually the front), mainly in computing contexts.","zh":"“Dequeued”表示某项已从队列中取出（通常从队首），主要用于计算机等技术语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"removed (an item) from a queue, usually from the front; used especially in computing and operations.","zh":"（从队列中）取出/出队（通常从队首移除一项）；多用于计算机与流程管理语境。"},"examples":[{"en":"The system dequeued the next task and started processing it.","zh":"系统将下一个任务出队并开始处理。"},{"en":"After the message was dequeued, it was sent to the user.","zh":"消息出队后，被发送给用户。"},{"en":"Only one job is dequeued at a time to prevent overload.","zh":"为防止过载，一次只出队一个作业。"}]}],"synonyms":["removed from the queue","taken off the queue","popped (from a queue)"],"phonetic":"/diˈkjud/","extraExplanation":["“dequeued”是动词“dequeue”的过去式/过去分词，常见于程序日志与技术文档（如：job dequeued, message dequeued）。","queue（队列）通常遵循FIFO（先进先出）：enqueue 入队（加入队尾），dequeue 出队（从队首取出）。"]}
{"word":"dequeues","summary":{"en":"“Dequeues” means “takes (an item) out of a queue,” especially in computing (FIFO).","zh":"“dequeues”表示“从队列中取出（一个元素）”，尤其常用于计算机语境（先进先出）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Computing) removes an item from a queue data structure, usually the item that has been waiting the longest (FIFO).","zh":"（计算机）从“队列（queue）”这种数据结构中取出一个元素，通常取出等待最久的那个（先进先出 FIFO）。"},"examples":[{"en":"The server dequeues the next request and processes it.","zh":"服务器从队列中取出下一个请求并进行处理。"},{"en":"Each time the loop runs, it dequeues one message from the queue.","zh":"循环每运行一次，就从队列里取出一条消息。"}]},{"partOfSpeech":"v.","definition":{"en":"removes someone or something from a line or waiting list; takes out of the queue.","zh":"把某人或某物从排队的队伍或等待列表中移出；从队列中取出。"},"examples":[{"en":"The system dequeues customers when an agent becomes available.","zh":"当客服有空时，系统会把客户从等待队列中取出。"},{"en":"If you cancel, the app dequeues your order automatically.","zh":"如果你取消，应用会自动把你的订单从队列中移除。"}]}],"synonyms":["removes","takes out","extracts","pops (from a queue)","pulls from the queue"],"phonetic":"/diˈkjuː/","extraExplanation":["“dequeues”是动词“dequeue”的第三人称单数（he/she/it dequeues）。常见于编程语境：enqueue（入队）与dequeue（出队）是一对固定搭配。","queue在英式英语里常指“排队的队伍”，在美式英语里更常说line；但在计算机领域两者都用queue表示“队列”。"]}
{"word":"dequeuing","summary":{"en":"Dequeuing means removing from a line or, in computing, taking the next item out of a queue (FIFO).","zh":"Dequeuing 指从排队队伍中退出/移除；在计算机中指从队列（先进先出）中取出下一个元素（出队）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"removing someone or something from a queue (a waiting line), or being removed from that line.","zh":"（使）从队列（排队等待的队伍）中退出；（被）从队列中移除。"},"examples":[{"en":"They started dequeuing passengers row by row to keep the aisle clear.","zh":"他们开始让乘客按排逐排离队，以保持过道畅通。"},{"en":"After the doors opened, people began dequeuing quickly.","zh":"门一开，人们就开始迅速离队。"}]},{"partOfSpeech":"v.","definition":{"en":"(computing) taking the next item out of a queue data structure, usually from the front.","zh":"（计算机）从“队列”数据结构中取出下一个元素（通常从队首取出）。"},"examples":[{"en":"The server is dequeuing requests and handling them in order.","zh":"服务器正在按顺序将请求出队并处理。"},{"en":"If the queue is empty, dequeuing will fail or return nothing.","zh":"如果队列为空，出队操作会失败或返回空值。"}]}],"synonyms":["removing from the queue","taking out","popping (from a queue)","processing (requests)"],"phonetic":"/diˈkjuːɪŋ/","extraExplanation":["在计算机领域，queue（队列）常用来描述“先进先出”（FIFO）的结构：enqueue 表示“入队”，dequeue 表示“出队”。因此 dequeuing 常出现在编程、算法、系统设计等语境中。","拼写上 de- + queue 容易让人误读；发音里核心是 /kjuː/（像“cue”），不是按字母把 queue 逐个读出来。"]}
