{"word":"DEW","summary":{"en":"“Dew” most commonly means the tiny drops of water that form on cool surfaces in the morning; it can also refer to a fresh, slightly shiny moisture on skin, and less commonly it can be a verb meaning ‘to become covered with dew.’","zh":"“Dew”最常指清晨在较冷表面凝结的露水/露珠；也可指皮肤水润的光泽；较少见时可作动词，表示（使）结露。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Tiny drops of water that form on cool surfaces, especially outdoors in the morning (from moisture in the air).","zh":"露水；（空气中的水汽遇冷在表面凝结形成的）小水珠，尤指清晨户外。"},"examples":[{"en":"There was dew on the grass when I went for a walk.","zh":"我去散步时，草地上有露水。"},{"en":"The flowers were covered with morning dew.","zh":"花朵上覆着清晨的露珠。"}]},{"partOfSpeech":"v.","definition":{"en":"To become covered with dew; to make something slightly wet with fine drops (less common).","zh":"（使）结露；（使）覆上一层细小水滴（较不常见）。"},"examples":[{"en":"The lawn dewed overnight.","zh":"草坪在夜里结了露。"},{"en":"Cool air can dew the windows in the early morning.","zh":"清晨的凉空气会让窗户结上一层露。"}]},{"partOfSpeech":"n.","definition":{"en":"The natural moisture on the skin that can make it look fresh and slightly shiny (common in beauty writing).","zh":"（皮肤的）水润光泽；看起来清新、微微发亮的自然润泽（美容语境常用）。"},"examples":[{"en":"Her skin had a healthy dew after the workout.","zh":"锻炼后她的皮肤有一种健康的水润光泽。"},{"en":"This cream gives a dewy finish.","zh":"这款面霜能呈现水润光泽的妆效。"}]}],"synonyms":["morning moisture","condensation","dewdrops","dewy (adj.)"],"phonetic":"/du/","extraExplanation":["“dew”常出现在诗歌与文学里，用来营造清晨、纯净、短暂易逝的意象；例如“dew on the roses（玫瑰上的露珠）”常被用来写清新与脆弱的美。","词源上与“wet（湿的）”有亲缘关系，核心含义就是“由空气湿气凝结而成的细小水滴”。","区分：dew（露水）通常是空气湿气在物体表面凝结；frost（霜）是在更冷的条件下形成的冰晶；mist/fog（薄雾/雾）是悬浮在空气中的小水滴。"]}
{"word":"dew","summary":{"en":"Dew is the small drops of water you see on cool surfaces in the early morning; as a verb, it can mean “to become covered with dew” (rare).","zh":"Dew 指清晨常见的露水；作动词时可指“结露/沾上露水”（较少用）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Tiny drops of water that form on cool surfaces (like grass or windows) when the air becomes cooler, especially at night or early morning.","zh":"露水：空气变冷时（尤其在夜里或清晨）在较冷的表面（如草地、窗户）凝结形成的细小水滴。"},"examples":[{"en":"The grass was wet with morning dew.","zh":"草地上沾满了清晨的露水。"},{"en":"Dew formed on the car window overnight.","zh":"车窗上一夜之间凝起了露水。"}]},{"partOfSpeech":"v.","definition":{"en":"To become covered with dew; to moisten with dew (rare in everyday speech).","zh":"（较少用）结露；使沾上露水。"},"examples":[{"en":"The leaves dew in the cool air before sunrise.","zh":"日出前的凉空气里，叶子会结露。"}]}],"synonyms":["moisture","condensation","morning moisture"],"phonetic":"/duː/","extraExplanation":["“Dew”常出现在诗歌与文学中，用来营造“清新、宁静、短暂”的意象：如“morning dew（朝露）”暗示新的一天开始，也常象征易逝的美好。","易混词：dew（露水）≠ due（到期的/应得的）≠ do（做）。发音不同或拼写相近，写作时要注意区分。"]}
{"word":"Dewain","summary":{"en":"Dewain is a male first name, a spelling variant of Dwayne/Duane.","zh":"Dewain 是男性名，是 Dwayne/Duane 的一种拼写变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (first name), a less common spelling variant of Dwayne/Duane","zh":"男性名字（名），是 Dwayne/Duane 的一种不太常见的拼写变体"},"examples":[{"en":"Dewain moved to Texas when he was ten.","zh":"Dewain 十岁时搬到了德克萨斯州。"},{"en":"My uncle’s name is Dewain, but he goes by “Wayne.”","zh":"我叔叔叫 Dewain，但他通常用“Wayne”作昵称。"}]}],"synonyms":["Dwayne","Duane","Dwaine"],"phonetic":"/dəˈweɪn/","extraExplanation":["“Dewain”多见于美国英语语境，常被视为“Dwayne / Duane”的变体拼写；这些名字在20世纪中后期较常见。","发音上通常重音落在第二音节（-WAIN），口语里也可能与“Dwayne”几乎同音。填写表格或证件时要注意拼写，因为变体较多，容易被写成 Dwayne、Duane、Dwaine 等。"]}
{"word":"dewal","summary":{"en":"“Dewal” is not a standard English word; you may mean “dwell,” meaning “live/reside” or “dwell on” = keep thinking/talking about something.","zh":"“dewal”不是标准英语词；你可能想写“dwell”，意思是“居住”，或“dwell on”表示“反复想着/详谈某事”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to live in a place; to reside","zh":"居住；栖身于（某地）"},"examples":[{"en":"They dwell in a small town near the coast.","zh":"他们住在海边附近的一个小镇。"},{"en":"Many animals dwell in forests.","zh":"许多动物栖息在森林里。"}]},{"partOfSpeech":"vi.","definition":{"en":"to think, speak, or write about something for a long time (often longer than necessary)","zh":"（常指过久地）反复想着/详谈/纠结于某事"},"examples":[{"en":"Try not to dwell on past mistakes.","zh":"尽量别一直纠结过去的错误。"},{"en":"The article dwells on the details of the case.","zh":"这篇文章反复谈到案件的细节。"}]}],"synonyms":["live","reside","inhabit","stay","linger (on)"],"phonetic":"/dwɛl/","extraExplanation":["“dewal”不是常见的英语单词，最可能是把“dwell”拼错了。","“dwell”在较正式或文学语境里更常见；日常口语中更常用“live (in)”或“stay”。","常见搭配：dwell in/on；其中 dwell on 表示“老是想着/详谈”。"]}
{"word":"Dewali","summary":{"en":"Diwali is the Hindu “Festival of Lights,” celebrated with lamps, family gatherings, and sweets.","zh":"Diwali 是印度教的“灯节/光明节”，以点灯、家庭团聚和甜点等方式庆祝。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Diwali (also spelled Deepavali) is a major Hindu festival, often called the “Festival of Lights,” celebrated with lamps, candles, fireworks, family visits, and sweets.","zh":"Diwali（也拼作 Deepavali）是重要的印度教节日，常被称为“灯节/光明节”，人们会点灯、放烟花、走亲访友并分享甜点来庆祝。"},"examples":[{"en":"We decorated the house with small oil lamps for Diwali.","zh":"我们为庆祝 Diwali 用小油灯装饰了房子。"},{"en":"Diwali is celebrated by many families with prayers, gifts, and sweets.","zh":"许多家庭会通过祈祷、送礼和分享甜食来庆祝 Diwali。"},{"en":"Schools sometimes hold Diwali events to learn about Indian culture.","zh":"学校有时会举办 Diwali 活动来了解印度文化。"}]}],"synonyms":["Deepavali","Festival of Lights"],"phonetic":"/dɪˈwɑːli/","extraExplanation":["你写的“Dewali”更常见的英文拼法是 **Diwali**。在印度不同地区也常见 **Deepavali**（尤其在南印度、斯里兰卡、新加坡、马来西亚等地）。","Diwali 通常落在印度历的秋季（公历多为10月或11月）。其象征意义常与“光明战胜黑暗、善战胜恶、知识战胜无知”相关，但不同地区的故事与仪式可能不一样。","在跨文化语境中，写作或发言时可用：**Happy Diwali!** / **Happy Deepavali!**（节日问候）；也可以说 **Diwali celebrations**（Diwali 庆祝活动）。"]}
{"word":"dewan","summary":{"en":"Dewan most commonly means a council/assembly (especially in South & Southeast Asia) or a hall/meeting place in Malaysia and Indonesia; it can also be a personal name.","zh":"Dewan 常指（南亚与东南亚的）议会/委员会，也常在马来西亚和印尼指“礼堂/大会堂”；也可作人名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South & Southeast Asia) a council, court, or legislative assembly; also a member of such a body.","zh":"（南亚与东南亚）议会／委员会／行政或立法机构；也可指其成员。"},"examples":[{"en":"The bill was debated in the Dewan before it became law.","zh":"法案在议会（Dewan）中辩论后才成为法律。"},{"en":"He served as a dewan advising the ruler on taxes and trade.","zh":"他担任顾问官（dewan），就税收与贸易向统治者建言。"}]},{"partOfSpeech":"n.","definition":{"en":"(Malaysia/Indonesia) a hall or large public room, often used for meetings or ceremonies.","zh":"（马来西亚／印度尼西亚）大会堂；礼堂；大房间（常用于会议或典礼）。"},"examples":[{"en":"The wedding reception was held in the dewan near the mosque.","zh":"婚宴在清真寺附近的礼堂（dewan）举行。"},{"en":"Please wait in the dewan until the meeting starts.","zh":"请在礼堂（dewan）等到会议开始。"}]},{"partOfSpeech":"n.","definition":{"en":"A given name (often South Asian).","zh":"人名（常见于南亚地区）。"},"examples":[{"en":"Dewan said he would arrive at noon.","zh":"Dewan 说他中午到。"}]}],"synonyms":["council","assembly","hall","chamber","legislature"],"phonetic":"/dəˈwɑn/","extraExplanation":["“dewan”常被视为与阿拉伯语/波斯语词“diwan”（英语也常写作 diwan）同源或同一词的不同拼写，历史上可指“登记册、办公室、行政机构”，后来引申为“议会/委员会”等。","在马来语与印尼语里，“dewan”很常见，日常语境多指“礼堂/会议厅”；而在政治语境中，马来西亚国会下议院称“Dewan Rakyat”（人民议会）。","英语文本中若看到 Dewan/diwan，含义通常需要看地区与语境：政府机构/议会 vs. 建筑空间（礼堂）。"]}
{"word":"dewanee","summary":{"en":"“Dewanee” is usually a name, not a common English word; its meaning depends on context and origin.","zh":"“Dewanee”通常是人名而非常见英语单词；具体含义需结合语境与来源判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A personal name (surname or given name). It is not a standard English vocabulary word, so its meaning depends on the person, family, or culture using it.","zh":"人名（姓氏或名字）。它不是标准英语词汇，因此含义取决于使用它的个人、家族或文化背景。"},"examples":[{"en":"Ms. Dewanee will lead the meeting today.","zh":"Dewanee 女士今天将主持会议。"},{"en":"I’m not sure how to spell Dewanee—could you confirm the letters?","zh":"我不确定 Dewanee 怎么拼——你能确认一下字母吗？"}]}],"phonetic":"/dəˈwɑni/","extraExplanation":["“Dewanee”在英语词典里通常查不到，比较像音译/拼写变体的人名。不同地区可能有不同来源：\n- 可能与南亚常见的姓氏/称号“Dewan”（意为官员/管家/大臣等，具体随语言与历史变化）有关，再加上不同的拼写形成变体。\n- 也可能与波斯语/乌尔都语等语境中的“Diwani / Dewani”类词形有关（常见于姓氏或文化用语）。\n如果你告诉我它出现的语境（人名、地名、品牌名，或一句话里的用法），我可以更准确地判断读音与含义。"]}
{"word":"dewani","summary":{"en":"Dewani (also diwani) most commonly refers to the historical right to collect revenue and administer civil affairs in South Asia; it can also mean an Ottoman calligraphy style.","zh":"dewani（亦作 diwani）最常指南亚历史上的“征税与民政权”；在艺术语境中也可指奥斯曼的一种书法风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian history) The right or authority to collect land revenue and administer civil government on behalf of a ruler; especially the Mughal grant to the British East India Company in Bengal (1765).","zh":"（南亚历史）代表统治者征收土地税并管理民政的权利/权限；尤指莫卧儿帝国在1765年授予英国东印度公司在孟加拉的“征税与民政权”（Diwani）。"},"examples":[{"en":"In 1765, the East India Company received the dewani of Bengal, Bihar, and Orissa.","zh":"1765年，东印度公司获得了孟加拉、比哈尔和奥里萨的 dewani（征税与民政权）。"},{"en":"Control of the dewani allowed the company to fund its army through local revenue.","zh":"掌握 dewani 使该公司能够用当地税收为军队提供资金。"}]},{"partOfSpeech":"n.","definition":{"en":"(Art/culture) A decorative style of Ottoman Turkish calligraphy, often used for official documents; also spelled diwani.","zh":"（艺术/文化）奥斯曼土耳其的一种装饰性书法风格，常用于官方文书；也写作 diwani。"},"examples":[{"en":"The museum displayed a decree written in dewani script.","zh":"博物馆展出了一份用 dewani 书体书写的敕令。"},{"en":"She practiced dewani calligraphy to learn its flowing, intertwined lines.","zh":"她练习 dewani 书法，以掌握那种流动、交织的线条。"}]}],"synonyms":["diwani","diwan (related word)","revenue-collecting rights (contextual)","Ottoman diwani script (contextual)"],"phonetic":"/dɪˈwɑːni/","extraExplanation":["“dewani/diwani”来自波斯语/阿拉伯语传统中的行政术语（与“diwan 迪万：官署/账册/诗集”等同源），在不同地区会指向不同领域：南亚更常见的是“征税与民政权”的历史含义；在土耳其艺术语境里则常指一种书法风格。","拼写上常见 diwani / dewani 的差异，多与不同语言的转写习惯有关；学术写作里更常见 diwani。"]}
{"word":"dewanny","summary":{"en":"“Dewanny” is not a common English vocabulary word; it is usually a name or a misspelling of another word.","zh":"“Dewanny”不是常见英语词汇；通常是人名，或是其他单词的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; most often seen as a personal name (a surname or given name) or as a misspelling of a similar-looking word.","zh":"不是常见词典里的标准英语单词；更常见于人名（姓或名），或是某个拼写相近词的误拼。"},"examples":[{"en":"I couldn’t find “dewanny” in an English dictionary—was it a person’s name?","zh":"我在英语词典里找不到“dewanny”，你是指人名吗？"},{"en":"The email was signed “Dewanny,” so I assumed it was the sender’s surname.","zh":"邮件署名为“Dewanny”，所以我猜那是发件人的姓。"}]}],"phonetic":"/duˈwɑni/","extraExplanation":["“dewanny”很可能是你想输入的其他词的拼写变体/误拼。常见的可能目标包括：\n1) **dewy**（带露水的；清新湿润的），读音不同但拼写相近；\n2) **Diwani / Dewani**（与南亚/中东语境相关的专名或术语，如“diwani 书体/文书体”或姓氏拼写）。\n如果你告诉我语境（句子、你在哪看到的、想表达的意思），我可以帮你锁定正确词并给出标准释义与用法。"]}
{"word":"dewans","summary":{"en":"Dewans is the plural of dewan/diwan: usually a high official or government office; it can also mean long sofas (often spelled divans).","zh":"Dewans 是 dewan/diwan 的复数：常指高官或官署；也可指长软榻/长沙发（常拼作 divans）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) a government official or minister in parts of South Asia and the Middle East; also the department or office they run (often spelled diwan/diwān).","zh":"（复数）在南亚及中东部分地区的高官/大臣；也可指其掌管的官署、部门（常见拼写为 diwan/diwān）。"},"examples":[{"en":"The nawab appointed two dewans to manage finance and revenue.","zh":"那位纳瓦卜任命了两位 dewan（大臣）来管理财政与税收。"},{"en":"Records were kept in the diwan, and orders were issued from there.","zh":"档案保存在 diwan（官署）里，命令也从那里发出。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) a long, low sofa or cushioned bench, often placed along a wall (more common spelling: divan).","zh":"（复数）长沙发、靠墙的长软榻（更常见拼写：divan）。"},"examples":[{"en":"Guests sat on dewans along the walls of the sitting room.","zh":"客人们坐在起居室墙边的 dewans（长软榻）上。"},{"en":"The café had low dewans with bright cushions.","zh":"那家咖啡馆有矮矮的 dewans（软榻），配着鲜艳的靠垫。"}]}],"synonyms":["diwans","ministers","officials","divans","sofas"],"phonetic":"/dɪˈwɑn/","extraExplanation":["“dewan/diwan/diwān”在历史与文化语境中很常见，尤其与莫卧儿帝国及南亚诸邦有关，常指负责财政、税收或行政的要职。","拼写差异很多：政治/行政含义常见 diwan/diwān/dewan；家具含义更常见 divan。阅读历史或文学作品时要结合上下文判断。"]}
{"word":"dewanship","summary":{"en":"Dewanship means the position or term of office of a dean.","zh":"Dewanship 指院长的职位或任期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the position, role, or term of office of a dean (especially at a university or college).","zh":"（尤指大学或学院）院长的职位、职务或任期。"},"examples":[{"en":"During her dewanship, the college launched a new engineering program.","zh":"在她担任院长期间，学院开设了新的工程项目。"},{"en":"He was offered the dewanship of the medical school.","zh":"他获邀担任医学院院长。"}]}],"synonyms":["deanery","dean's office","dean's tenure"],"phonetic":"/ˈdiːnʃɪp/","extraExplanation":["“Dewanship”由“dean（院长）+ -ship（表示身份/职位/任期的后缀）”构成，意思类似于“领导职位/任期”。常见同类词还有 “leadership（领导职位/领导力）”“membership（会员身份）”。","在美式英语里，“dean”多指大学中某个学院（college/school）的行政负责人，例如 “Dean of Students（学生事务院长）”“Dean of the Law School（法学院院长）”。“dewanship”属于较正式、偏学术行政语域的用词。"]}
{"word":"Dewar","summary":{"en":"A Dewar is a vacuum flask (Dewar flask) used to keep things hot or cold, especially in labs for very cold liquids.","zh":"Dewar 指“杜瓦瓶/真空保温瓶”，常用于实验室保温或保冷，尤其用于装液氮等低温液体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a vacuum flask used to keep liquids hot or cold (a double-walled container with a vacuum between the walls); also called a Dewar flask","zh":"杜瓦瓶／真空保温瓶：一种双层容器，中间抽成真空，用来让液体保温或保冷"},"examples":[{"en":"Pour the liquid nitrogen into the Dewar carefully.","zh":"把液氮小心地倒进杜瓦瓶里。"},{"en":"We stored the samples in a Dewar to keep them cold during transport.","zh":"我们把样品放在杜瓦瓶里运输，以保持低温。"},{"en":"The lab ordered a new Dewar flask for cryogenic work.","zh":"实验室为低温实验订购了一个新的杜瓦瓶。"}]},{"partOfSpeech":"n.","definition":{"en":"Sir James Dewar (1842–1923), a scientist whose name is used for the Dewar flask","zh":"詹姆斯·杜瓦爵士（1842–1923）：其名字被用来命名“杜瓦瓶”的科学家"},"examples":[{"en":"The container is named after James Dewar, who developed it for laboratory use.","zh":"这种容器以詹姆斯·杜瓦命名，他最初将它用于实验室。"}]}],"synonyms":["vacuum flask","Dewar flask","thermos"],"phonetic":"ˈduːər","extraExplanation":["“Dewar”常见于科学与工程语境，尤其是低温（cryogenics）领域，用来装液氮、液氦等。日常生活里更常说“thermos/保温杯”，但“Thermos”在英语里本来是商标名，后来在口语中常被泛化使用。"]}
{"word":"dewar","summary":{"en":"A dewar is a vacuum-insulated container, especially used in labs to hold very cold liquids like liquid nitrogen; it can also mean a vacuum flask like a Thermos.","zh":"dewar 指真空绝热容器，尤指实验室用于盛放液氮等低温液体的杜瓦瓶；也可泛指保温瓶/真空瓶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a double-walled container with a vacuum between the walls, used to keep substances (often very cold liquids like liquid nitrogen) insulated; common in laboratories","zh":"（实验室常用的）杜瓦瓶：双层壁、夹层抽成真空的保温容器，用于隔热保温/保冷，常用来盛放液氮等低温液体"},"examples":[{"en":"The technician filled the dewar with liquid nitrogen before the samples arrived.","zh":"样品到来之前，技术员先把杜瓦瓶装满了液氮。"},{"en":"Please wear gloves when handling the dewar; the surface can become extremely cold.","zh":"搬动杜瓦瓶时请戴手套；它的表面可能会变得非常冷。"},{"en":"A small dewar can keep the reagent cold during transport.","zh":"小型杜瓦瓶可以在运输过程中让试剂保持低温。"}]},{"partOfSpeech":"n.","definition":{"en":"(often capitalized) a container like a Thermos flask; a vacuum flask","zh":"（常大写）类似“保温瓶/热水瓶”的真空瓶；保温瓶"},"examples":[{"en":"He poured tea from a dewar into a cup on the hike.","zh":"徒步时，他从保温瓶里倒茶到杯子里。"},{"en":"Bring a dewar of hot water for the outdoor event.","zh":"户外活动带上一壶保温热水。"}]}],"synonyms":["vacuum flask","Thermos","insulated flask","cryogenic flask"],"phonetic":"/ˈduːər/","extraExplanation":["“Dewar”来自英国化学家、物理学家 James Dewar（詹姆斯·杜瓦）的姓氏。他在研究低温实验时推广了这种双层真空绝热容器，因此这种容器后来就以他的名字命名。","日常英语里更常说 thermos / vacuum flask；在科研、工业场景中 dewar 更常指用于低温液体（如液氮、液氦）的专用容器。"]}
{"word":"dewars","summary":{"en":"“dewars” can mean the whisky brand Dewar’s, or the plural of “dewar” (a vacuum-insulated container used in labs).","zh":"“dewars”既可指威士忌品牌 Dewar’s（帝王牌），也可指 dewar（杜瓦瓶/杜瓦罐）的复数，即实验室用的真空保温容器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often “Dewar’s”) A Scotch whisky brand, especially known for blended Scotch (e.g., Dewar’s White Label).","zh":"（常写作 “Dewar’s”）帝王牌苏格兰威士忌品牌，尤以调和型苏格兰威士忌闻名（如 White Label）。"},"examples":[{"en":"He ordered a Dewar’s and soda at the bar.","zh":"他在酒吧点了一杯帝王牌威士忌加苏打水。"},{"en":"Dewar’s is a well-known blended Scotch in many countries.","zh":"帝王牌在许多国家都是很有名的调和苏格兰威士忌。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of dewar: vacuum-insulated containers (Dewar flasks) used to store very cold liquids such as liquid nitrogen.","zh":"dewar 的复数：杜瓦瓶/杜瓦罐（真空保温容器），用于储存液氮等极低温液体。"},"examples":[{"en":"The lab keeps liquid nitrogen in large dewars.","zh":"实验室用大型杜瓦罐储存液氮。"},{"en":"Wear protective gloves when handling dewars.","zh":"搬动杜瓦罐时要戴防护手套。"}]}],"synonyms":["Dewar’s whisky","blended Scotch","Dewar flask","vacuum flask"],"phonetic":"/ˈduː.ərz/","extraExplanation":["“Dewar”这个词在科技语境里来自英国科学家 James Dewar（詹姆斯·杜瓦），他推广了用于低温实验的真空保温容器（Dewar flask）。","“Dewar’s”作为威士忌品牌名是所有格形式（看起来像“杜瓦的”），日常书写中常直接用品牌拼写并保留撇号。"]}
{"word":"Dewart","summary":{"en":"Dewart is mainly used as a proper noun: a Scottish-origin surname and also a U.S. place name (e.g., Dewart, Pennsylvania).","zh":"Dewart 主要作为专有名词使用：一个源自苏格兰的姓氏，也可作美国地名（如宾夕法尼亚州的 Dewart）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surname (family name) of Scottish origin used by some English-speaking families.","zh":"一个姓氏（家族姓），源自苏格兰，在一些英语国家家庭中使用。"},"examples":[{"en":"Ms. Dewart will lead today’s meeting.","zh":"Dewart 女士将主持今天的会议。"},{"en":"I found an article written by Jordan Dewart.","zh":"我找到一篇由 Jordan Dewart 写的文章。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name, most notably Dewart, Pennsylvania (a small community in the United States).","zh":"一个地名，最常见的是美国宾夕法尼亚州的 Dewart（一个小社区）。"},"examples":[{"en":"They drove through Dewart, Pennsylvania on their way north.","zh":"他们北上途中开车经过宾夕法尼亚州的 Dewart。"}]}],"phonetic":"/ˈduːwɑrt/","extraExplanation":["“Dewart”在现代英语里主要作为专有名词（人名/地名）出现，不像普通词汇那样有通用词义；写作时通常首字母大写。","在英语里，姓氏常来自地名、职业、外号或家族来源地；“Dewart”多被视为苏格兰姓氏的一种拼写形式（不同家族可能有不同来源与变体）。"]}
{"word":"dewata","summary":{"en":"“Dewata” means “the gods/deities,” and it’s also used in the phrase “Pulau Dewata” (“Island of the Gods,” a nickname for Bali).","zh":"“Dewata”意为“诸神/神祇”，也常用于“Pulau Dewata”（“众神之岛”，巴厘岛的别称）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Indonesian and especially Balinese usage) the gods; deities (often understood as a group of divine beings).","zh":"（印尼语，尤指巴厘语用法）诸神；众神；神祇（常指一群神明）。"},"examples":[{"en":"In Balinese Hindu traditions, offerings are made to the dewata every day.","zh":"在巴厘岛的印度教传统中，人们每天都会向诸神献供。"},{"en":"Many temple ceremonies honor the dewata and the spirits of ancestors.","zh":"许多寺庙仪式会祭祀诸神与祖先灵。"}]},{"partOfSpeech":"n.","definition":{"en":"A poetic or respectful reference connected with Bali, as in the nickname “Pulau Dewata” (“Island of the Gods”).","zh":"与巴厘岛相关的诗意或敬称用法，如“Pulau Dewata”（“众神之岛/神之岛”）这一昵称。"},"examples":[{"en":"Bali is often called Pulau Dewata in travel writing.","zh":"在旅游文章里，巴厘岛常被称为 Pulau Dewata。"},{"en":"The festival drew visitors from across Indonesia to Pulau Dewata.","zh":"这个节庆吸引了来自印尼各地的游客前往“众神之岛”。"}]}],"synonyms":["deities","the gods","divine beings","pantheon"],"phonetic":"/deɪˈwɑːtə/","extraExplanation":["“Dewata”来自梵语词源体系（与“deva/神”相关），在印尼语中常带有“众神、神祇”的集合含义。","“Pulau Dewata（众神之岛）”是巴厘岛的常见别称，源于当地以巴厘印度教文化与寺庙祭仪著称。"]}
{"word":"dewater","summary":{"en":"“Dewater” means to remove water from material (like sludge) or to pump/drain water out of an area (like a construction site).","zh":"“dewater”指给材料（如污泥）脱水，或把某个区域（如工地）排水、排干。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove water from something (such as wet material, mud, or sludge), usually by draining, pressing, filtering, or centrifuging","zh":"给（湿物、泥浆、污泥等）脱水；去除其中的水分（常通过排水、压榨、过滤或离心）"},"examples":[{"en":"The plant dewaters sludge before sending it to a landfill.","zh":"该工厂会先对污泥脱水，再送往填埋场。"},{"en":"After washing the sand, they dewater it to reduce shipping weight.","zh":"清洗沙子后，他们会把沙子脱水，以减少运输重量。"},{"en":"Let the vegetables dewater in a colander for a few minutes.","zh":"把蔬菜放在滤篮里沥干（脱水）几分钟。"}]},{"partOfSpeech":"vt.","definition":{"en":"to drain water away from an area, such as a construction site, mine, or flooded place","zh":"（从某个区域）排水；使（工地、矿井、积水处等）排干"},"examples":[{"en":"Pumps were used to dewater the excavation site.","zh":"他们用水泵把基坑排水。"},{"en":"The mine must be dewatered regularly to keep tunnels safe.","zh":"矿井必须定期排水，以确保巷道安全。"}]}],"synonyms":["drain","dry","dehydrate","filter","press","pump out"],"phonetic":"/diːˈwɔtər/","extraExplanation":["“de-”是英语里常见的前缀，表示“去除、减少”（如 de-ice 除冰、dehydrate 脱水）。因此 dewater 字面意思就是“去水”。","在工程/环保语境里，dewater 常与 sludge（污泥）、sediment（沉积物）、excavation（基坑/开挖处）、site（工地）连用；日常烹饪里更常说 drain（沥干）或 pat dry（擦干），但在食谱说明中也可能看到 dewater。"]}
{"word":"dewatered","summary":{"en":"“Dewatered” means water has been removed (drained/dried), or it is the past form of “dewater.”","zh":"“dewatered”表示“已脱水/已排水的”，也可作动词“dewater”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having had water removed; drained or dried to reduce moisture.","zh":"已除去水分的；脱水的；排干水的（指把含水量降低）。"},"examples":[{"en":"The dewatered sludge is easier to transport and dispose of.","zh":"脱水后的污泥更容易运输和处理。"},{"en":"After washing, the vegetables are dewatered before packaging.","zh":"清洗后，蔬菜会先脱水再包装。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “dewater”: to remove water from something or drain it.","zh":"“dewater”的过去式/过去分词：给……脱水；从……排水。"},"examples":[{"en":"The workers dewatered the flooded basement overnight.","zh":"工人们连夜把被淹的地下室排干了水。"},{"en":"The filter press has dewatered the mixture to a thick cake.","zh":"压滤机把混合物脱水成了较厚的滤饼。"}]}],"synonyms":["drained","dried","water-removed","dehydrated (often stronger)"],"phonetic":"/ˌdiːˈwɔtɚd/","extraExplanation":["“dewater”常见于工程与工业语境（如污水处理、采矿、施工排水、食品加工）。日常口语里更常用“drain”“dry”“spin-dry”等表达。","构词上：de-（去除）+ water（水），直观表示“去水/脱水”。","相关词：dewatering（n. 脱水/排水过程），dewatering pump（排水泵），dehydrated（更常指把水分几乎完全去除，如脱水食品）。"]}
{"word":"dewaterer","summary":{"en":"A dewaterer removes water from materials, usually as a machine in industrial settings.","zh":"dewaterer 指从物料中去除水分的设备（多见于工业场景），较少指从事脱水工作的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a machine or device that removes water from a material (such as sludge, sand, pulp, or food) to make it drier","zh":"脱水机；脱水装置（用于从污泥、砂、纸浆或食品等物料中去除水分，使其更干）"},"examples":[{"en":"The wastewater plant uses a dewaterer to reduce the volume of sludge before disposal.","zh":"污水处理厂使用脱水机来减少污泥体积，再进行处置。"},{"en":"After washing the sand, it goes through a dewaterer so it can be transported more easily.","zh":"砂子清洗后会经过脱水装置，这样更便于运输。"}]},{"partOfSpeech":"n.","definition":{"en":"a person whose job is to remove water from something (less common)","zh":"从事脱水工作的人（较少用）"},"examples":[{"en":"The dewaterer checked the equipment before starting the shift.","zh":"脱水工在开工前检查了设备。"}]}],"synonyms":["dewatering machine","dewatering unit","dryer","separator","centrifuge"],"phonetic":"/diːˈwɔːtərər/","extraExplanation":["“dewaterer”来自动词“dewater”（脱水）加上表示“人/物”的后缀“-er”。在工程与工业语境中更常指设备，比如带式压滤机（belt filter press）、离心机（centrifuge）、螺旋压榨机（screw press）等。日常英语里更常说“dewatering machine/unit”。"]}
{"word":"dewatering","summary":{"en":"“Dewatering” means removing water from a material or place, especially in construction or industrial processes.","zh":"“Dewatering”指把材料或场所中的水分去除，常用于施工与工业处理语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of removing water from something (such as soil, sludge, or a construction site) to make it drier","zh":"脱水；排水（把土壤、污泥、工地等中的水分去除，使其变干的过程）"},"examples":[{"en":"Dewatering is necessary before workers can pour concrete in the foundation.","zh":"在工人浇筑地基混凝土之前，必须先进行排水。"},{"en":"The plant uses dewatering to reduce the volume of wastewater sludge.","zh":"该工厂通过脱水来减少污水污泥的体积。"}]},{"partOfSpeech":"v.","definition":{"en":"to remove water from something, especially in industrial, environmental, or construction work","zh":"使脱水；排水（尤指工业、环保或施工中的除水处理）"},"examples":[{"en":"They are dewatering the site with pumps to keep the trench dry.","zh":"他们用水泵对工地进行排水，以保持沟槽干燥。"},{"en":"The company dewatered the sediment before transporting it.","zh":"公司在运输前先对沉积物进行了脱水处理。"}]}],"synonyms":["drainage","water removal","drying (general)","pumping out","dehydration (often for food/medical use)"],"phonetic":"/ˌdiˈwɔtərɪŋ/","extraExplanation":["“Dewatering”常见于工程与环保语境：如工地基坑/地下室排水（construction dewatering）、污泥脱水（sludge dewatering）、矿山排水（mine dewatering）。常用方法包括泵抽、过滤、离心与压滤等。","词形上由 de-（去除）+ water（水）+ -ing 组成；在技术文献中多作名词，表示“脱水/排水这一工序”。"]}
{"word":"dewaters","summary":{"en":"“Dewaters” means “removes water from something.” It is the third-person singular form of “dewater.”","zh":"“dewaters”表示“把……中的水去除/排水/脱水”，是动词“dewater”的第三人称单数形式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to remove water from something (such as wet soil, sludge, or a construction site) by draining, pumping, filtering, or drying","zh":"（通过排水、抽水、过滤或干燥等方式）从某物中去除水分；脱水；排水"},"examples":[{"en":"The contractor dewated the site before pouring the concrete.","zh":"承包商在浇筑混凝土前先把工地排水。"},{"en":"The plant dewaters sludge to reduce its weight for transport.","zh":"工厂会对污泥脱水，以减少运输重量。"},{"en":"After heavy rain, the crew dewated the excavation pit with pumps.","zh":"大雨后，施工队用水泵把基坑里的水抽干。"}]}],"synonyms":["drain","dry","pump out","dehydrate","filter"],"phonetic":"/diˈwɔtɚ/","extraExplanation":["“dewater”常见于工程、环保与污水处理语境：如基坑排水（construction dewatering）与污泥脱水（sludge dewatering）。","你输入的“dewaters”多半是动词第三人称单数：He/She/It dewaters…；也可能是现在时用于说明设备/系统的功能：The unit dewaters slurry.（该设备对浆液脱水）"]}
{"word":"dewax","summary":{"en":"Dewax means to remove wax from something.","zh":"Dewax 指“给某物去蜡”，也就是把蜡除掉。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove wax from something (for example, from fruit, paper, tools, or a surface)","zh":"给某物去蜡；把蜡从……上除去（如水果、纸张、工具或表面）"},"examples":[{"en":"Some apples are dewaxed before being packaged.","zh":"有些苹果在包装前会先去蜡。"},{"en":"The technician dewaxed the mold to prepare it for the next step.","zh":"技师把模具去蜡，为下一步做准备。"}]}],"synonyms":["remove wax","de-wax","strip wax"],"phonetic":"/diːˈwæks/","extraExplanation":["“dewax”由前缀 de-（表示“去除、解除”）+ wax（蜡）构成，含义直观，常用于制造业、实验室流程、印刷/造纸或食品处理等语境。","在牙科或铸造工艺里，dewax 也可指把蜡型从印模或模具中去除，以便后续浇注或加工。"]}
{"word":"dewaxed","summary":{"en":"Dewaxed means the wax has been removed from a material by processing.","zh":"dewaxed 指材料经过处理已去除蜡质（脱蜡）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having the wax removed; processed so that natural waxes are taken out","zh":"脱蜡的；去除蜡质的（指经过处理把天然蜡成分去掉）"},"examples":[{"en":"Dewaxed shellac dries faster and is easier to use under modern finishes.","zh":"脱蜡虫胶干得更快，也更适合用在现代涂装/面漆下面。"},{"en":"Some manufacturers sell dewaxed coffee beans to reduce bitterness.","zh":"有些厂家会出售脱蜡咖啡豆，以降低苦味。"}]}],"synonyms":["de-waxed","wax-free (in some contexts)","defatted (not exact; only in some processing contexts)"],"phonetic":"/diːˈwækst/","extraExplanation":["“dewaxed”多见于工艺/材料语境，尤其常见搭配是“dewaxed shellac（脱蜡虫胶）”。虫胶天然含蜡；脱蜡后通常更清澈、附着与兼容性更好，常被当作封闭底漆使用。","构词法：de-（去除）+ wax（蜡）+ -ed（形容词/过去分词），表示“被去蜡处理过的”。"]}
{"word":"dewaxes","summary":{"en":"“dewaxes” means “removes wax from something,” often used for cleaning/materials or industrial oil processing.","zh":"“dewaxes”意为“给某物除蜡/脱蜡”，常用于清洁/材料处理或工业油品脱蜡等语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove wax from something (for example, from a surface, material, or substance)","zh":"给某物除蜡；去除蜡质（例如从表面、材料或物质中把蜡去掉）"},"examples":[{"en":"This solvent dewaxes the surface so paint can stick better.","zh":"这种溶剂能给表面除蜡，让油漆更容易附着。"},{"en":"The technician dewaxes the mold before the next step.","zh":"技师在下一步之前先给模具除蜡。"}]},{"partOfSpeech":"vt.","definition":{"en":"(oil/industry) to remove waxy components from oil to improve flow, especially in cold temperatures","zh":"（石油/工业）从油品中去除蜡状成分，使其在低温下更易流动"},"examples":[{"en":"The refinery dewaxes the oil to prevent it from thickening in winter.","zh":"炼油厂对油品进行脱蜡，防止冬天变稠。"},{"en":"Dewaxes the base oil to meet the product’s low-temperature requirements.","zh":"对基础油脱蜡，以满足产品的低温性能要求。"}]}],"synonyms":["removes wax","strips wax","de-waxes","degreaes (sometimes related)","defats (in some contexts)"],"phonetic":"/diˈwæksɪz/","extraExplanation":["“dewaxes”通常是动词“dewax”的第三人称单数（he/she/it dewaxes），也可能是复数名词“dewax”的罕见用法，但最常见还是动词形式。","构词提示：de- 常表示“去除/反向操作”，wax 指“蜡”，所以 dewax = 去蜡/脱蜡。常见于清洁、制造（模具、铸造）以及石油加工等语境。"]}
{"word":"dewaxing","summary":{"en":"Dewaxing means removing wax from a material, commonly in oil refining or manufacturing.","zh":"Dewaxing 指“脱蜡/除蜡”，常见于油品炼制或制造工序中，把蜡从材料里去除。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of removing wax from something (such as oil, a surface, or earwax from the ear)","zh":"脱蜡；除蜡（把蜡从某物中去除的过程，如从油品、表面或耳道中去除耳垢）"},"examples":[{"en":"The refinery uses dewaxing to improve the low-temperature performance of lubricating oil.","zh":"炼油厂用脱蜡工艺来改善润滑油在低温下的性能。"},{"en":"Dewaxing helps the finished product stay clearer and flow more easily in cold weather.","zh":"脱蜡能帮助成品在寒冷天气里保持更清澈、流动性更好。"}]},{"partOfSpeech":"adj.","definition":{"en":"removing wax as part of a treatment or manufacturing step","zh":"用于表示“正在/用于除蜡”的（作为处理或制造工序的一部分）"},"examples":[{"en":"A dewaxing step is required before filtration.","zh":"过滤前需要进行一道除蜡工序。"},{"en":"They tested a dewaxing method that uses chilling and filtration.","zh":"他们测试了一种通过冷却和过滤进行除蜡的方法。"}]}],"synonyms":["wax removal","de-waxing","defatting (partial, depending on context)","solvent dewaxing (specific)","catalytic dewaxing (specific)"],"phonetic":"/diˈwæksɪŋ/","extraExplanation":["在石油与润滑油行业里，dewaxing 常指把油中会在低温析出的“蜡”（长链烃）去掉，以降低倾点（pour point）、提升低温流动性。常见方法包括“溶剂脱蜡”（solvent dewaxing）和“催化脱蜡”（catalytic dewaxing）。","在日常语境中，如果指耳朵里的“耳垢”，更常见说法是 earwax removal；dewaxing 也能被理解，但语气偏技术/医疗。"]}
{"word":"DeWayne","summary":{"en":"DeWayne is a U.S.-common given name, a variant of Dewayne/Duane.","zh":"DeWayne 是美国较常见的英文名，常见为 Dewayne/Duane 的变体拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (first name), most common in the U.S.; a variant spelling of “Dewayne” or “Duane.”","zh":"一个英文名字（名），在美国较常见；常被视为 “Dewayne” 或 “Duane” 的变体拼写。"},"examples":[{"en":"DeWayne Johnson is my uncle, and he lives in Texas.","zh":"DeWayne Johnson 是我叔叔，他住在德州。"},{"en":"How do you spell your name—DeWayne or Dewayne?","zh":"你的名字怎么拼——DeWayne 还是 Dewayne？"},{"en":"DeWayne prefers to be called “Wayne” at work.","zh":"DeWayne 在工作中更喜欢别人叫他“Wayne”。"}]}],"synonyms":["Dewayne","Duane","Dwayne","Wayne"],"phonetic":"/dəˈweɪn/","extraExplanation":["“DeWayne”通常是男性名字，在书写上把中间的 W 大写（De + Wayne）是一种风格选择，用来强调名字的两个部分。","在英语文化里，名字的大小写与拼写可能因家庭传统而不同；填写证件或机票时最好与证件上的拼写完全一致。","相关名字：Wayne（韦恩，常作昵称或独立名字）、Duane/Dwayne（常见变体；其中 Dwayne 因演员 Dwayne Johnson 更广为人知）。"]}
{"word":"dewbeam","summary":{"en":"A poetic noun meaning a beam of light shining on or through dew, giving a sparkling morning effect.","zh":"一个诗意名词，指照在露水上或穿过露气的光束，带来清晨闪烁的效果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a poetic word for a beam of light that shines through or reflects on dew (morning moisture), creating a soft, sparkling effect","zh":"（诗意用语）指照在露水上或穿过露气的一束光，使清晨的景象显得柔和、闪亮"},"examples":[{"en":"In the quiet garden, a dewbeam caught the first light of dawn.","zh":"在安静的花园里，一道露光抓住了黎明的第一缕光。"},{"en":"She described the lake as silvered by dewbeams and early sunlight.","zh":"她形容湖面被露光与清晨阳光镀上一层银色。"}]}],"synonyms":["sunbeam","ray of light","morning light"],"phonetic":"/ˈduːbiːm/","extraExplanation":["“dewbeam”并不是现代日常英语中的常用词，更常见于诗歌或带有文学气息的描写。它由 dew（露水）+ beam（光束）构成，用来营造清晨、清新、闪烁的意象。","在更自然的现代表达里，人们通常会说 “a beam of sunlight on the dew / on dew-covered grass”（一束阳光照在带露的草上），而不是直接用“dewbeam”。"]}
{"word":"dewberries","summary":{"en":"Dewberries are wild, trailing-vine berries similar to blackberries, often eaten fresh or used in desserts and jams.","zh":"露莓是类似黑莓的野生浆果，多为贴地蔓生，常鲜食或做甜点、果酱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of wild blackberry with low, trailing vines; the small dark berries are edible and often used in pies, jams, and cobblers.","zh":"露莓（野生黑莓的一种）：藤蔓贴地生长、带刺，结出可食用的小型深色浆果，常用于派、果酱或烤甜点。"},"examples":[{"en":"In early summer, we picked dewberries along the fence line and made jam.","zh":"初夏时，我们沿着篱笆采露莓，然后做成果酱。"},{"en":"The dewberries were ripe—dark, sweet, and easy to crush in the bowl.","zh":"露莓熟了——颜色深、很甜，而且在碗里一压就出汁。"},{"en":"Dewberries look like blackberries, but the plants usually spread along the ground.","zh":"露莓看起来像黑莓，但植株通常是贴地蔓生的。"}]}],"synonyms":["wild blackberries","bramble berries"],"phonetic":"/ˈduːˌbɛriz/","extraExplanation":["“dewberry”常见于美国南部与部分乡村语境，带有“野外采果、家常甜点”的文化联想。它和“blackberry（黑莓）”很像，但露莓的枝条更常匍匐生长、成熟时间往往更早。","词形：dewberry（单数）/ dewberries（复数）。发音上注意复数 -ies 的变化。","相关词：wild berries（野生浆果）、bramble（荆棘丛/覆盆子类植物的统称）、cobbler（果馅烤甜点）、jam（果酱）。"]}
{"word":"dewberry","summary":{"en":"A dewberry is a wild, low-growing berry similar to a blackberry.","zh":"dewberry 指一种贴地蔓生的野生浆果，类似黑莓。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wild berry (a kind of blackberry) that grows on low trailing vines; the fruit is usually dark purple or black when ripe","zh":"露莓；一种野生浆果（黑莓的近亲），多生长在贴地蔓生的藤上；成熟时果实通常呈深紫或黑色"},"examples":[{"en":"We found dewberries along the edge of the field and picked a small basket.","zh":"我们在田边发现了露莓，摘了小半篮。"},{"en":"Dewberry jam tastes similar to blackberry jam but can be a bit more tart.","zh":"露莓果酱的味道和黑莓果酱相似，但可能更酸一些。"}]}],"synonyms":["wild blackberry","brambleberry"],"phonetic":"/ˈduˌbɛri/","extraExplanation":["“dewberry”字面是“露水莓”，名字来自它常在清晨带着露水的低矮藤蔓上被发现。","在北美英语里，dewberry通常指与blackberry同属（Rubus）的几种野生品种；口语中有时也会被当作“野黑莓”来理解。","与blackberry对比记忆：dewberry多为“贴地/匍匐生长”，blackberry更常见为“较直立/灌木状”的枝条。"]}
{"word":"dewcap","summary":{"en":"Dewcap usually means an old-fashioned morning/dressing cap; it can also be a poetic image for a “cap” of dew on plants.","zh":"dewcap 通常指旧式的晨帽/梳妆帽；也可作诗性意象，指花草上像“帽子”一样的露水覆盖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Old-fashioned) A light cap worn at home in the early morning, especially before fully dressing; a type of morning or dressing cap.","zh":"（旧式用法）清晨在家里戴的轻便帽子，尤指还没完全穿戴整齐时的“晨帽/梳妆帽”。"},"examples":[{"en":"In the old novel, the aunt appeared at breakfast in a loose gown and a dewcap.","zh":"在那本老小说里，姑妈穿着宽松晨袍、戴着晨帽出现在早餐桌前。"},{"en":"He stepped into the hallway still in slippers and a dewcap, half awake.","zh":"他还穿着拖鞋、戴着晨帽就走到走廊里，半睡半醒。"}]},{"partOfSpeech":"n.","definition":{"en":"(Poetic) A covering that looks like a cap made of dew, often describing plants or the morning landscape.","zh":"（诗性用法）像“露水做的帽子”一样的覆盖物，用来描写植物或清晨景色上的露珠覆盖。"},"examples":[{"en":"The buds wore a dewcap that glittered in the first light.","zh":"花苞戴着一顶闪亮的“露帽”，在第一缕晨光里发光。"},{"en":"By sunrise, the grass had lost its dewcap to the warming air.","zh":"日出后，草地的“露帽”随着空气变暖而消散了。"}]}],"synonyms":["morning cap","dressing cap","(poetic) dew covering"],"phonetic":"/ˈduː.kæp/","extraExplanation":["“dewcap”在现代英语里很少见，更常见的说法是“morning cap / dressing cap”（晨帽/梳妆帽）。","在文学描写中，它也可能被作者当作意象使用，把露水比作给花草戴上的“帽子”，带有拟人和画面感。"]}
{"word":"dewclaw","summary":{"en":"A dewclaw is a small extra claw, usually on a dog’s leg above the paw.","zh":"dewclaw 指狗等动物脚掌上方腿部的额外小爪子（狼爪/悬爪）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small extra claw (often higher up on the leg) found on some animals, especially dogs; it may or may not touch the ground","zh":"（尤指狗的）狼爪／悬爪；长在腿部较高位置的多余小爪子，可能不着地"},"examples":[{"en":"My dog’s dewclaw catches on blankets sometimes, so we keep it trimmed.","zh":"我家狗的狼爪有时会勾到毯子上，所以我们会定期修剪。"},{"en":"Some breeds have double dewclaws on the back legs.","zh":"有些犬种后腿会有“双狼爪”（两只狼爪）。"}]}],"synonyms":["extra claw","accessory claw"],"phonetic":"/ˈduːˌklɔ/","extraExplanation":["“dewclaw”常见于兽医、宠物护理和犬种介绍中。中文常译为“狼爪”或“悬爪”。","有的地区或犬种会出于安全、工作需要或传统而移除狼爪，但在很多地方这涉及动物福利与法规差异；日常更常见的是定期修剪，避免过长劈裂或勾伤。"]}
{"word":"dewclawed","summary":{"en":"“Declawed” means an animal (especially a cat) has had its claws removed; “to declaw” means to remove the claws.","zh":"“Declawed”指（尤指猫）被去爪的；“to declaw”指给动物去爪、移除其爪子。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having had the claws removed (especially of a cat), usually by surgery; not able to use claws normally","zh":"（尤指猫）被去爪的；爪子被手术移除后，无法正常使用爪子的"},"examples":[{"en":"The shelter does not accept declawed cats because the surgery can cause long-term pain.","zh":"这家收容所不接收去爪猫，因为这种手术可能导致长期疼痛。"},{"en":"A declawed cat may bite more because it can’t defend itself with claws.","zh":"去爪猫可能更容易咬人，因为它无法用爪子自我防卫。"}]},{"partOfSpeech":"v.","definition":{"en":"to remove the claws of an animal (most commonly a cat)","zh":"给动物（最常见是猫）去爪；移除其爪子"},"examples":[{"en":"Some owners declaw their cats to protect furniture.","zh":"有些主人给猫去爪是为了保护家具。"},{"en":"Many veterinarians recommend alternatives instead of declawing.","zh":"许多兽医建议用其他方法替代去爪。"}]}],"synonyms":["declaw (v.)","clawless (adj.)"],"phonetic":"/diˈklɔd/","extraExplanation":["“dewclawed”在英文里非常少见；大多数情况下人们想写的是“declawed”。“Declaw”通常指猫的去爪手术，在很多地区具有争议性：一些国家或城市限制或禁止非医疗目的的去爪，因为它可能影响动物的疼痛感、行走方式和行为（如更焦虑或更易咬人）。","更常见的替代做法包括：定期修剪指甲、提供抓板/猫抓柱、使用保护套（如软爪套）、训练猫在指定位置抓挠等。"]}
{"word":"dewclaws","summary":{"en":"Dewclaws are small extra claws on the inner side of an animal’s leg, especially in dogs.","zh":"Dewclaws 指动物（尤指狗）腿内侧的额外小爪/副趾（狼爪）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small extra claw (often a non-weight-bearing “thumb” or “big toe”) on the inner side of an animal’s leg, especially in dogs; some animals have them on the front legs and sometimes the back legs.","zh":"（尤指狗的）狼爪/副趾：长在腿内侧的小额外爪子，常不着地，像“拇指/大脚趾”；多见于前腿，有时后腿也有。"},"examples":[{"en":"My puppy’s dewclaws don’t touch the ground when he walks.","zh":"我家小狗走路时狼爪不会碰到地面。"},{"en":"The vet checked her dewclaws to make sure they weren’t torn.","zh":"兽医检查了她的狼爪，确认没有撕裂。"},{"en":"Some breeds are born with rear dewclaws, and owners may need to trim them regularly.","zh":"有些犬种天生有后腿狼爪，主人可能需要定期修剪。"}]}],"synonyms":["extra claw","accessory digit","wolfclaw (common in some contexts)"],"phonetic":"/ˈduːˌklɔz/","extraExplanation":["“dewclaw”这个词直译像“露水爪”，但实际与“露水”无关；它指的是长在腿内侧、位置较高、常不着地的“额外趾/爪”。","在宠物护理里常会提到dewclaws，因为它们有时不会自然磨短，容易过长、勾到东西或裂开；是否需要移除取决于品种、活动量与兽医建议。"]}
{"word":"dewcup","summary":{"en":"A poetic word for a cup or cup-shaped flower/leaf that holds dew.","zh":"诗意用法：指盛露的杯状物（常指花或叶形成的“杯”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cup or cup-shaped thing that holds dew, especially used in poetic or literary descriptions (for example, a flower that collects dew).","zh":"露杯；盛露的杯状物（多用于诗歌/文学描写，例如能积露的花朵）。"},"examples":[{"en":"In the morning, the lily looked like a dewcup filled with silver drops.","zh":"清晨，百合像一只盛满银色水滴的露杯。"},{"en":"She drank from a leaf’s dewcup as if it were a tiny chalice.","zh":"她从叶片形成的露杯里啜饮，仿佛那是一只小小的圣杯。"}]}],"synonyms":["dew cup","dew-filled cup","chalice (poetic)"],"phonetic":"/ˈduːˌkʌp/","extraExplanation":["“dewcup”不是现代日常英语里的常用词，更常见写法是分开写作“dew cup”，多出现在诗歌或带有自然意象的散文里，用来强调“露水像被杯子盛着一样”的画面感。","它通常是一个比喻：并不一定指真实的杯子，也可以指花朵、叶片等“杯状”结构里聚起的露水。"]}
{"word":"dewdamp","summary":{"en":"Dewdamp means slightly wet with dew, especially in the early morning.","zh":"dewdamp 指“带露水而微湿的”，多用于清晨的描写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(often literary) Damp with dew; slightly wet from dew, especially in the morning.","zh":"（常用于文学语境）带露水的；因晨露而微湿的。"},"examples":[{"en":"We walked through dewdamp grass at sunrise.","zh":"日出时，我们走过带露水而微湿的草地。"},{"en":"She picked the dewdamp flowers from the garden.","zh":"她从花园里摘下还带着露水的花。"}]}],"synonyms":["dewy","damp","moist","dew-covered"],"phonetic":"/ˈduːˌdæmp/","extraExplanation":["“dewdamp”是由“dew（露水）+ damp（潮湿的）”构成的复合词，语感偏诗意或描写性，常用来营造清晨、清新、宁静的氛围。日常口语里更常说“dewy”或“damp with dew”。"]}
{"word":"dewdrop","summary":{"en":"A dewdrop is a small drop of dew on plants or other surfaces, usually seen in the morning.","zh":"dewdrop 指清晨常见的露珠（草叶等表面的小露滴）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A tiny drop of water that forms on cool surfaces (like grass or leaves), especially in the early morning.","zh":"（尤指清晨在草叶等凉爽表面形成的）露珠，露滴。"},"examples":[{"en":"In the morning sun, each blade of grass held a dewdrop.","zh":"在晨光里，每一根草叶上都托着一颗露珠。"},{"en":"A dewdrop slid off the leaf and fell to the ground.","zh":"一颗露珠从叶子上滑落，滴到地上。"}]}],"synonyms":["drop of dew","dew bead","droplet"],"phonetic":"/ˈduːˌdrɑp/","extraExplanation":["“Dewdrop”常出现在诗歌与自然描写中，用来营造清新、短暂、纯净的意象；也常被引申来比喻“短暂却美好”的事物。","构词：dew（露水）+ drop（水滴）。在文学里常与 dawn（黎明）、petal（花瓣）、sparkle（闪光）等词搭配。"]}
{"word":"dewdropper","summary":{"en":"A dewdropper is a (somewhat old-fashioned, slang) word for a lazy idler—sometimes specifically someone who stays out all night and comes home at dawn.","zh":"dewdropper（较老派的俚语）指游手好闲的人；有时特指整夜不归、清晨才回家的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who avoids work and spends time idling; a loafer.","zh":"游手好闲的人；懒散无所事事的人。"},"examples":[{"en":"He was labeled a dewdropper because he never held a steady job.","zh":"他被贴上“游手好闲”的标签，因为他从来没有一份稳定的工作。"},{"en":"The story contrasts the hardworking farmer with a dewdropper who lives off others.","zh":"故事把勤劳的农夫与一个靠别人养活的懒汉作对比。"}]},{"partOfSpeech":"n.","definition":{"en":"(older/slang) a person who stays out all night and comes home at dawn, as if “wet with dew.”","zh":"（较旧/俚语）整夜不归、天亮才回家的人，仿佛“沾着露水”回来。"},"examples":[{"en":"His mother scolded him for being a dewdropper again, stumbling in at sunrise.","zh":"他妈妈骂他又当“露水鬼”了，日出时才踉跄着回家。"},{"en":"In old newspaper writing, a dewdropper was often pictured as a night-wandering idler.","zh":"在旧时报刊文风里，“dewdropper”常被描写成夜里游荡的闲人。"}]}],"synonyms":["loafer","idler","layabout","slacker","freeloader","deadbeat"],"phonetic":"/ˈduˌdrɑpɚ/","extraExplanation":["这个词带有明显的贬义和老派口吻，现代日常英语里不算常用；更常见的替代说法有 loafer、idler、freeloader（更强调“白吃白喝”）、deadbeat（更口语、批评更强）。","词源上是把“清晨的露水（dew）”和“滴落（dropper）”组合起来，暗示某人混到天亮才回来，鞋裤像沾了露水一样；后来引申为“整天不务正业的人”。","使用时注意语境：在描写年代感较强的小说、报刊体或带讽刺的叙述中更自然；正式场合不建议用。"]}
{"word":"dewdrops","summary":{"en":"Dewdrops are tiny drops of morning dew on surfaces like grass or leaves; the word is also used poetically for something fresh and delicate.","zh":"Dewdrops 指清晨在草叶等表面形成的露珠；也可用于诗意表达，形容清新、晶莹、娇嫩的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Small drops of water that form on cool surfaces (like grass or leaves), especially in the morning.","zh":"露珠；（尤指清晨在草叶等表面凝结的）小水滴。"},"examples":[{"en":"In the early morning, dewdrops sparkled on the grass.","zh":"清晨，露珠在草地上闪闪发光。"},{"en":"She brushed the dewdrops off the roses with her fingertips.","zh":"她用指尖轻轻拂去玫瑰上的露珠。"}]},{"partOfSpeech":"n.","definition":{"en":"Water drops like morning dew, used poetically to describe something delicate, fresh, or glittering.","zh":"（诗意）如露珠般的水滴；用来形容事物清新、晶莹或娇嫩。"},"examples":[{"en":"The child’s laughter rang out like dewdrops in sunlight.","zh":"孩子的笑声像阳光下的露珠一样清亮。"},{"en":"The poem describes dewdrops as “tiny mirrors” on the leaves.","zh":"诗中把露珠描写成叶子上的“微小镜子”。"}]}],"synonyms":["dew","droplets","beads (of dew)"],"phonetic":"/ˈduːˌdrɑps/","extraExplanation":["“Dewdrops”通常是名词复数；单数是“dewdrop”。“Dew”指露水，“drop(s)”指水滴，合起来就是“露珠”。","在英语文学里，dewdrops常用来营造清晨、自然、纯净、短暂易逝的意象（因为露珠会很快蒸发）。你也会常见到搭配：dewdrops on the grass / on petals（花瓣上）。"]}
{"word":"dewed","summary":{"en":"“Dewed” means covered with dew; it can also be the rare past form of the verb “dew.”","zh":"“dewed”表示“沾满露水的”；也可作较少见的动词“dew”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Past participle/adj.) Covered with or wet from dew (tiny drops of water that form outdoors, especially in the early morning).","zh":"（过去分词/形容词）沾满露水的；被露水打湿的（露水常在清晨户外凝结成小水滴）。"},"examples":[{"en":"The grass was dewed and cold under our feet at sunrise.","zh":"日出时，草地沾着露水，踩上去冰凉。"},{"en":"She picked a dewed rose from the garden.","zh":"她从花园里摘下一朵带着露水的玫瑰。"}]},{"partOfSpeech":"v.","definition":{"en":"(Verb, rare) Past tense/past participle of “dew”: to moisten or cover with dew.","zh":"（动词，较少见）“dew”的过去式/过去分词：使沾上露水；用露水弄湿。"},"examples":[{"en":"The morning air had dewed the windows lightly.","zh":"清晨的空气让窗户上薄薄地结了一层露水。"}]}],"synonyms":["dew-covered","wet with dew","dewy"],"phonetic":"/dud/","extraExplanation":["“dewed”更常见于描写自然景色的文字（尤其是诗歌或文学性写作），用来营造清新、清晨、宁静的氛围。日常口语里更常说 “wet with dew / covered in dew”。"]}
{"word":"Dewees","summary":{"en":"Dewees is mainly a surname and sometimes a place name.","zh":"Dewees 主要是姓氏，也偶尔用作地名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname); also used in some place names (e.g., Dewees Island in South Carolina).","zh":"姓氏；也可用作某些地名（如美国南卡罗来纳州的德威斯岛 Dewees Island）。"},"examples":[{"en":"Ms. Dewees will lead the meeting today.","zh":"Dewees 女士今天将主持会议。"},{"en":"We spent the weekend on Dewees Island.","zh":"我们在德威斯岛度过了周末。"}]}],"synonyms":["DeWeese","Deweese","Dewease"],"phonetic":"/dəˈwiːz/","extraExplanation":["“Dewees”通常被视为专有名词（姓氏/地名），日常写作中一般首字母大写。","它也常见为拼写变体或近似姓氏：DeWeese / Deweese / Dewease 等；在不同家族或地区，发音与拼写可能略有差异。"]}
{"word":"Deweese","summary":{"en":"Deweese is most commonly a surname, and it can also be used as a U.S. place name.","zh":"Deweese 最常见是英文姓氏，也可能用作美国的地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname) of English use","zh":"（姓氏）Deweese，用作英文姓"},"examples":[{"en":"Ms. Deweese will lead today’s meeting.","zh":"Deweese 女士将主持今天的会议。"},{"en":"I emailed Professor Deweese about the assignment.","zh":"我给 Deweese 教授发邮件询问作业。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name used in the U.S. (for example, small communities or geographic locations)","zh":"（地名）Deweese：美国一些小社区或地理地点可能使用的名称"},"examples":[{"en":"They drove through Deweese on their way to the next town.","zh":"他们去下一个城镇的路上开车经过了 Deweese。"},{"en":"Deweese appears on the map as a very small location.","zh":"Deweese 在地图上显示为一个很小的地点。"}]}],"phonetic":"/dəˈwiz/","extraExplanation":["“Deweese”通常作为专有名词使用（首字母大写）。在英文里，姓氏在正式场合常与称谓连用（Ms./Mr./Dr./Professor Deweese）。","它也可能出现在地名中；如果你是在地址、地图或新闻里看到它，往往是地名用法。"]}
{"word":"dewer","summary":{"en":"“dewer” is usually a surname and is not a common standard English word.","zh":"“dewer”通常是一个姓氏，不是常见的标准英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An uncommon spelling; most often seen as a family name (surname). It is not a standard modern English vocabulary word in general use.","zh":"一种不常见的拼写；最常见于姓氏（家族名）。一般不算现代英语里常用的词汇。"},"examples":[{"en":"Ms. Dewer will present the report today.","zh":"Dewer 女士今天将做报告。"},{"en":"I couldn’t find “dewer” in most dictionaries because it’s usually a surname.","zh":"我在大多数词典里找不到“dewer”，因为它通常是一个姓氏。"}]}],"synonyms":["(as a surname) family name","(possible intended word) doer","(possible intended spelling) Dewar"],"phonetic":"/ˈduːər/","extraExplanation":["“dewer”在常见英语词典里通常不作为普通词条出现，更可能是人名/姓氏，或是把别的词拼错了。常见的相近词有：\n- doer（做事的人；行为者）\n- Dewar（更常见的拼写：可作姓氏；也可指“杜瓦瓶/保温瓶”Dewar flask）\n如果你能提供一句包含“dewer”的原句或上下文（例如来自文章、聊天或作业），我可以帮你判断它到底指哪一个。"]}
{"word":"Dewey","summary":{"en":"Dewey is mainly a name, and it can also refer to the Dewey Decimal library classification system or to the American educator John Dewey.","zh":"Dewey主要是人名；也可指图书馆的杜威十进分类法，或指美国教育家约翰·杜威。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surname and given name (especially in the U.S.).","zh":"（常见于美国的）姓氏或名字：Dewey（杜威/杜伊）。"},"examples":[{"en":"My professor’s last name is Dewey.","zh":"我教授的姓是Dewey。"},{"en":"Dewey moved to Chicago for work.","zh":"Dewey为了工作搬去了芝加哥。"}]},{"partOfSpeech":"n.","definition":{"en":"Short for the Dewey Decimal Classification (DDC), a library system that organizes books by subject using numbers.","zh":"（常指）杜威十进分类法（DDC）：图书馆用数字按主题给书籍分类的系统。"},"examples":[{"en":"You can find it faster if you look up the Dewey number.","zh":"如果你查一下杜威分类号，会更快找到。"},{"en":"The librarian showed me how to use Dewey to locate history books.","zh":"图书管理员教我如何用杜威分类法找到历史类书籍。"}]},{"partOfSpeech":"n.","definition":{"en":"John Dewey (1859–1952), an influential American philosopher and educator known for ideas about learning by doing and democracy in education.","zh":"约翰·杜威（1859–1952）：美国有影响力的哲学家与教育家，强调“做中学”和教育中的民主。"},"examples":[{"en":"In my education class, we read John Dewey’s essays.","zh":"在我的教育课上，我们读了约翰·杜威的文章。"},{"en":"Dewey’s ideas influenced modern teaching methods.","zh":"杜威的思想影响了现代教学方法。"}]}],"synonyms":["Dewey Decimal System","Dewey Decimal Classification","DDC"],"phonetic":"/ˈdui/","extraExplanation":["“Dewey”在英语里最常见的文化联想有两个：一是图书馆的“杜威十进分类法”（Dewey Decimal System/Classification），二是教育学家约翰·杜威（John Dewey）。在校园或图书馆语境中，听到“Dewey”常常就是指分类号系统。","发音提示：Dewey 的读音通常和“DOO-ee”接近；中文常译作“杜威”。（不同人名的中文译名可能略有差异）"]}
{"word":"dewey","summary":{"en":"“Dewey” is a proper name often referring to John Dewey or the Dewey Decimal System.","zh":"“Dewey”是专有名词，常指约翰·杜威或杜威十进分类法。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper name) A surname; commonly refers to the American philosopher and educator John Dewey, or to the Dewey Decimal Classification used in libraries.","zh":"（专有名词）一个姓氏；常指美国哲学家、教育家约翰·杜威（John Dewey），或指图书馆使用的杜威十进分类法（Dewey Decimal Classification）。"},"examples":[{"en":"Our teacher introduced John Dewey’s ideas about learning by doing.","zh":"老师介绍了约翰·杜威关于“做中学”的理念。"},{"en":"You can find history books using the Dewey Decimal System in many libraries.","zh":"在很多图书馆里，你可以用杜威十进分类法来找历史类图书。"}]}],"synonyms":["Dewey Decimal Classification (DDC)","Dewey Decimal System"],"phonetic":"/ˈduːi/","extraExplanation":["“Dewey”在英语里最常见的文化语境有两个：① 教育学与哲学领域的约翰·杜威（John Dewey, 1859–1952），强调经验、实践与民主教育；② 图书馆编目中的“杜威十进分类法”（DDC），把知识按 000–900 的大类编号，便于检索与上架。","在口语中有人会把“Dewey”理解为“杜威分类号/杜威系统”的简称（尤其在图书馆工作或学习环境里）。"]}
{"word":"deweyan","summary":{"en":"Deweyan means “related to Dewey,” most often John Dewey’s educational/philosophical ideas, and sometimes the Dewey Decimal system in libraries.","zh":"Deweyan 意为“与杜威有关的”，多指约翰·杜威的教育/哲学思想；有时也指图书馆的杜威十进制分类法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the American philosopher and educator John Dewey (1859–1952), especially his ideas about pragmatism, democracy, and “learning by doing.”","zh":"（多指）与美国哲学家、教育家约翰·杜威（1859–1952）有关的，尤指其实用主义、民主与“做中学”等思想。"},"examples":[{"en":"The school adopted a Deweyan approach, with students learning through projects and real-life problem-solving.","zh":"这所学校采用杜威式的方法，让学生通过项目与现实问题解决来学习。"},{"en":"Her teaching style is strongly Deweyan: discussion, experimentation, and reflection come first.","zh":"她的教学风格很“杜威式”：强调讨论、实验与反思。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to Melvil Dewey and the Dewey Decimal Classification system used in libraries.","zh":"与梅尔维尔·杜威及图书馆使用的杜威十进制分类法有关的。"},"examples":[{"en":"The librarian reorganized the shelves using a Deweyan classification system.","zh":"图书管理员用杜威十进制分类法重新整理了书架。"},{"en":"In a Deweyan catalog, books are grouped by numbered subject areas.","zh":"在杜威式目录中，书籍按带编号的主题类别归类。"}]}],"synonyms":["Dewey-inspired","pragmatist (in philosophy contexts)","progressive (in education contexts)"],"phonetic":"/ˈduːiən/","extraExplanation":["“Deweyan”通常出现在教育学与哲学语境，常与“progressive education（进步主义教育）”“experiential learning（体验式学习）”等概念并列。杜威强调教育应服务于民主社会：课堂不仅传授知识，也训练合作、沟通与公共参与。","在图书馆学语境中，提到“Deweyan”时往往是指杜威十进制分类法（DDC）。注意两种用法都来自姓氏 Dewey，但指的人不同，需要靠上下文判断。"]}
{"word":"deweylite","summary":{"en":"Deweylite is a soft, clay-like hydrous magnesium silicate mineral, often produced by weathering of serpentine rocks.","zh":"Deweylite 是一种柔软、黏土状的含水硅酸镁矿物，常由蛇纹岩等风化作用形成。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a soft, clay-like mineral (a hydrous magnesium silicate), often found as a weathering product of serpentine rocks.","zh":"一种质地柔软、呈黏土状的矿物（含水硅酸镁），常见于蛇纹岩等岩石风化作用的产物中。"},"examples":[{"en":"The geologist identified the pale green coating as deweylite on the surface of the serpentine rock.","zh":"地质学家把蛇纹岩表面那层浅绿色的覆盖物鉴定为 deweylite（杜威石）。"},{"en":"Deweylite can appear as a soft, earthy mass rather than well-formed crystals.","zh":"Deweylite 往往呈柔软的土状团块，而不是规则的晶体。"}]}],"synonyms":["hydrous magnesium silicate","alteration product of serpentine (context)"],"phonetic":"/ˈduːiˌlaɪt/","extraExplanation":["“Deweylite”多用于矿物学/地质学语境，日常英语中非常少见。它通常指一类含水的硅酸镁物质，常与蛇纹石（serpentine）等矿物的蚀变/风化有关。","词源上一般认为与人名 Dewey 有关（以人物命名的矿物在英语中很常见）。在中文资料里有时译作“杜威石”，但不同资料可能对其定义范围略有差异。"]}
{"word":"Deweyville","summary":{"en":"Deweyville is a U.S. place name, most commonly referring to towns in Texas or Utah.","zh":"Deweyville 是美国的地名，常指德州或犹他州的同名小镇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a place name (proper noun): the name of small towns in the United States, especially Deweyville, Texas and Deweyville, Utah","zh":"地名（专有名词）：美国一些小城镇的名称，常见指德州的 Deweyville 或犹他州的 Deweyville"},"examples":[{"en":"She grew up in Deweyville, Texas, near the Louisiana border.","zh":"她在德克萨斯州的 Deweyville 长大，靠近路易斯安那州边界。"},{"en":"We passed through Deweyville on our drive across northern Utah.","zh":"我们开车穿越犹他州北部时经过了 Deweyville。"}]}],"phonetic":"/ˈduːiˌvɪl/","extraExplanation":["“Deweyville”通常被当作专有名词使用（写作首字母大写）。在真实语境里，如果不确定是哪一个 Deweyville，最好加上州名（例如 Deweyville, TX / Deweyville, UT）以避免歧义。","在英文中，很多城镇名以 -ville 结尾，-ville 原意与“城镇/村镇”相关，因此 Deweyville 常给人一种“某人名（Dewey）+ 小镇”的地名结构感。"]}
{"word":"dewfall","summary":{"en":"Dewfall means the evening time when dew begins to form, often used poetically like “dusk” or “nightfall.”","zh":"dewfall 指傍晚露水开始凝结的时分，常用于诗意表达，类似“黄昏/夜幕降临”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The time in the evening when dew begins to form and settle on grass, plants, and other surfaces; a poetic way to say “dusk” or “nightfall.”","zh":"傍晚露水开始凝结、落在草地与植物上的时候；一种较诗意的说法，相当于“黄昏/夜幕降临”。"},"examples":[{"en":"At dewfall, the garden smelled fresh and cool.","zh":"到露降时分，花园闻起来清新凉爽。"},{"en":"They returned home at dewfall, just as the lights came on.","zh":"他们在露降时分回到家，正好路灯亮起。"},{"en":"In the poem, dewfall is used to suggest quiet and rest.","zh":"在这首诗里，“露降”用来暗示宁静与休憩。"}]}],"synonyms":["dusk","twilight","nightfall","evening"],"phonetic":"/ˈduːfɔːl/","extraExplanation":["“dewfall”比较少见，更多出现在诗歌、文学描写或偏抒情的叙述中，用来营造清凉、安静、一天将尽的氛围。日常英语里更常说 dusk / twilight / nightfall。","从构词看，它由 dew（露水）+ fall（落下）组成，和 nightfall（夜幕降临）结构相似。它强调的是“露水开始出现的时刻”，通常在傍晚到夜间早段。"]}
{"word":"dewfalls","summary":{"en":"“Dewfalls” is a poetic plural meaning times when dew forms (or dew drops settling).","zh":"“Dewfalls”较诗意，指露水凝结的时刻（或凝结的露滴，作复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of dewfall: the time (usually evening/night) when dew forms and settles on grass, leaves, etc.; also used in a poetic way to mean “dew drops that fall/settle.”","zh":"dewfall 的复数：指露水形成并在草叶等表面凝结的时刻（多在傍晚到夜间）；也可作诗意用法，指“落下/凝结的露滴”。"},"examples":[{"en":"At dewfalls, the fields look silver in the moonlight.","zh":"在露水凝结的时分，月光下的田野像镀了银一样。"},{"en":"The flowers close at dusk, just before the dewfalls begin.","zh":"花朵在黄昏合拢，就在露水开始凝结之前。"}]}],"synonyms":["dew","dew formation","night dew","morning dew"],"phonetic":"/ˈduːˌfɔl/","extraExplanation":["“dewfall(s)”比较少见，常见于诗歌或较文学的描写；日常英语更常说“dew forms / dew settles / there is dew”。","如果你看到“dew falls”分开写，通常是一个正常句子结构：dew（露水）+ falls（落下/降落），不一定是固定词。"]}
{"word":"dewflower","summary":{"en":"“Dewflower” is a common name for certain small-flowered plants (often in the spiderwort family), especially ones found in wet areas.","zh":"“dewflower”常指鸭跖草科中某些开小花的植物的俗名，尤其是生长在潮湿环境中的种类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant with small flowers, often in the spiderwort family (Commelinaceae); some species are called “marsh dewflower” and grow in wet places.","zh":"露花（露花属等植物的俗名），常指鸭跖草科（Commelinaceae）中开小花的植物；有些种被称为“沼生露花”，多生于潮湿地带。"},"examples":[{"en":"We saw marsh dewflower growing along the edge of the pond.","zh":"我们在池塘边看到了沼生露花。"},{"en":"The dewflower has tiny blossoms that can be easy to miss.","zh":"露花的花很小，不注意的话很容易错过。"}]}],"synonyms":["marsh dewflower","Murdannia (genus name)","spiderwort-family plant"],"phonetic":"/ˈduːˌflaʊər/","extraExplanation":["“dewflower”是英文常见名（common name），并不总是指同一种植物；不同地区可能指露花属（Murdannia）或近缘类群的某些物种。","它常与“dayflower”（鸭跖草、露子花等的俗名）混淆；两者同属鸭跖草科，花形相似，但具体物种和生境可能不同。若是学术或园艺语境，最好同时给出拉丁学名以避免歧义。"]}
{"word":"Dewhirst","summary":{"en":"Dewhirst is an English surname, most commonly used as a family name.","zh":"Dewhirst 是一个英文姓氏，最常见用法是作为家族姓。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), originally from northern England.","zh":"一个英文姓氏（家族姓），起源于英格兰北部地区较常见。"},"examples":[{"en":"Ms. Dewhirst will lead the meeting today.","zh":"Dewhirst 女士今天将主持会议。"},{"en":"I saw the name Dewhirst on the company directory.","zh":"我在公司通讯录里看到了 Dewhirst 这个姓。"}]}],"phonetic":"/ˈduː.hɝːst/","extraExplanation":["“Dewhirst”通常作为姓氏使用，而不是常见词汇。它被认为源自英格兰北部的地名或地形用语：其中 “hirst / hurst” 在古英语中常与“林地、小树林、长满树的山丘”有关，因此这个姓氏带有典型的英格兰地名姓（toponymic surname）特征。","读音方面，英文姓氏在不同家庭或地区可能略有差异；在正式场合如果不确定，礼貌的做法是直接询问对方“Could you tell me how to pronounce your last name?”。"]}
{"word":"Dewhurst","summary":{"en":"Dewhurst is mainly used as an English surname, and it can also be a place name in some regions.","zh":"Dewhurst 主要用作英格兰来源的姓氏，也可作部分地区的地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), originally English.","zh":"（人名）杜赫斯特；一个源自英格兰的姓氏。"},"examples":[{"en":"Ms. Dewhurst will lead the meeting today.","zh":"杜赫斯特女士今天将主持会议。"},{"en":"I met someone named Dewhurst at the conference.","zh":"我在会议上认识了一个叫杜赫斯特的人。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name used for some towns/areas (for example, in the UK and Canada).","zh":"（地名）杜赫斯特；用于一些城镇或地区的名称（例如英国、加拿大等地）。"},"examples":[{"en":"They moved to Dewhurst last year for work.","zh":"他们去年为了工作搬到了杜赫斯特。"},{"en":"Dewhurst appears on older local maps.","zh":"杜赫斯特在较老的地方地图上能找到。"}]}],"phonetic":"/ˈduːhɝːst/","extraExplanation":["“Dewhurst”常被认为来自古英语/中古英语成分：deaw（露水）+ hyrst/hurst（小树林、林木覆盖的丘陵）。因此它最初可能指“有露水的林丘”或“露水覆盖的树林/丘陵”，后来演变为地名与姓氏。","在英语语境里，像 Dewhurst 这种词通常不翻译含义，而是按发音音译为“杜赫斯特”，并保留其作为专名（姓氏/地名）的用法。"]}
{"word":"Dewi","summary":{"en":"Dewi is a proper noun: in Indonesian/Malay it means “goddess” (and is a female name), and in Welsh it is the name “David,” especially in “Dewi Sant” (Saint David).","zh":"Dewi是专有名词：在印尼语/马来语中意为“女神”（也常作女性名）；在威尔士语中相当于“David（大卫）”，尤见于“Dewi Sant（圣大卫）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Indonesian and Malay) “goddess”; also used as a feminine given name.","zh":"（印尼语/马来语）“女神”；也常用作女性名字。"},"examples":[{"en":"In Balinese Hindu culture, Dewi Sri is the goddess of rice and fertility.","zh":"在巴厘岛的印度教文化中，Dewi Sri（黛薇·斯里）是稻米与丰饶的女神。"},{"en":"Her name is Dewi, which means “goddess” in Indonesian.","zh":"她叫Dewi，在印尼语里意思是“女神”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Welsh) a male given name meaning “David,” famously used for Saint David (Dewi Sant), the patron saint of Wales.","zh":"（威尔士语）男性名字，相当于“David（大卫）”；最著名的用法是威尔士守护圣人圣大卫（Dewi Sant）。"},"examples":[{"en":"Dewi Sant is celebrated on March 1 in Wales.","zh":"在威尔士，人们在3月1日庆祝Dewi Sant（圣大卫日）。"},{"en":"His Welsh name is Dewi, but in English he goes by David.","zh":"他的威尔士语名字是Dewi，但英文里他用David。"}]}],"synonyms":["goddess","deity","David"],"phonetic":"/ˈdeɪwi/","extraExplanation":["“Dewi”在东南亚语境里常直接等同于“女神”，也常见于复合神名（如 Dewi Sri）。作为人名时，多为女性名，给人优雅、神圣的联想。","在威尔士语里，“Dewi”与“David”对应；“Dewi Sant”意为“圣大卫”，是威尔士文化中非常核心的称呼。"]}
{"word":"Dewie","summary":{"en":"“Dewie” is most commonly a name, usually a variant of “Dewey.”","zh":"“Dewie”最常见是人名，多为“Dewey”的变体拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (usually masculine), a variant spelling of “Dewey”; often used as a nickname.","zh":"人名（多为男性名），“Dewey”的变体拼写；也常用作昵称。"},"examples":[{"en":"Dewie is short for Dewey in some families.","zh":"在一些家庭里，Dewie 是 Dewey 的简称/昵称。"},{"en":"Dewie said he’d meet us after class.","zh":"Dewie 说他会在课后和我们碰面。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare, informal) a playful spelling that may be used to suggest “dewy” (slightly wet with dew), especially in creative writing or usernames.","zh":"（较少见，非正式）一种俏皮拼写，有时用来暗示 “dewy（带露水的、微湿的）”，常见于创意写作或网名。"},"examples":[{"en":"The morning air felt dewie and cool.","zh":"清晨的空气带着露水般的湿润和凉意。"}]}],"synonyms":["Dewey"],"phonetic":"/ˈduːi/","extraExplanation":["“Dewie”更常见的来源是名字“Dewey”的变体。英语里很多名字会有不同拼写（如 Cathy/Kathy），发音可能相同但写法不同。","如果你是在图书馆或教育学语境看到它，可能会联想到“Dewey”（杜威）：例如“Dewey Decimal System（杜威十进制图书分类法）”，以及教育学家 John Dewey。"]}
{"word":"dewier","summary":{"en":"“Dewier” means “more dewy”—having more dew or a fresher, slightly moist look.","zh":"“dewier”表示“更有露水的/更水润的”，可指露水更多或外观更清新微湿润。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"More dewy; covered with more dew (tiny drops of water), or looking fresher and slightly moist.","zh":"更有露水的；露水更多的；（外观）更清新、微湿润的。"},"examples":[{"en":"The grass looked dewier in the early morning than it did at noon.","zh":"清晨的草看起来比中午更露水润泽。"},{"en":"After the light mist, the garden felt dewier and cooler.","zh":"薄雾过后，花园感觉更湿润、更凉爽。"},{"en":"Her makeup gave her skin a dewier finish.","zh":"她的妆容让皮肤呈现更水润的光泽。"}]}],"synonyms":["more dewy","more moist-looking","fresher","more dewy-looking"],"phonetic":"/ˈduːiər/","extraExplanation":["“dewier”是形容词“dewy（有露水的；水润的）”的比较级，常用来比较两者谁“更露”“更水润”。在现代口语里，它也常出现在美妆领域，形容“dewy finish（露光/水光妆效）”，强调皮肤看起来有光泽、略带湿润感。"]}
{"word":"dewiest","summary":{"en":"“Dewiest” means “the most dewy,” literally with the most dew, or figuratively the freshest/most youthful-looking.","zh":"“dewiest”是“dewy”的最高级：字面指露水最多；引申指最清新、最水润或最显年轻。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative form of “dewy”: having the most dew; covered with the most tiny drops of water (often seen on grass, leaves, or flowers in the morning).","zh":"“dewy”的最高级：最有露水的；覆着最多细小水珠的（常见于清晨的草地、叶子或花朵上）。"},"examples":[{"en":"We took a walk at sunrise, when the grass was at its dewiest.","zh":"我们在日出时散步，那时草地露水最多。"},{"en":"Pick flowers later in the day; early morning is usually the dewiest time.","zh":"晚些时候再采花；清晨通常是露水最重的时候。"}]},{"partOfSpeech":"adj.","definition":{"en":"Figurative: looking the most fresh, bright, or youthful (often describing skin, eyes, or a style).","zh":"（比喻）最清新、最明亮或最显年轻的（常形容皮肤、眼神或风格）。"},"examples":[{"en":"In photos, her makeup looks dewiest when she uses a hydrating primer.","zh":"在照片里，她用保湿妆前乳时妆感最水润清新。"},{"en":"The film’s opening scene shows the heroine at her dewiest—hopeful and carefree.","zh":"电影开场把女主拍得最“清新无忧”——充满希望、无拘无束。"}]}],"synonyms":["most dewy","most moisture-covered","freshest-looking","most radiant"],"phonetic":"/ˈduːiəst/","extraExplanation":["拼写小提示：以 -y 结尾的形容词变最高级时，通常把 y 变成 i 再加 -est：dewy → dewiest（类似：happy → happiest）。","语体与语感：“dewy”及其最高级常带有诗意或审美意味；在美妆语境里，“dewy”常指“水光感/水润光泽”，不一定真的有露水。"]}
{"word":"dewily","summary":{"en":"“Dewily” means “in a dewy (dew-covered) way,” often used in poetic description.","zh":"“dewily”表示“露湿地/带露水地”，多用于诗意描写。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is covered with or full of dew; slightly wet with tiny drops of water (often used in poetic or descriptive writing).","zh":"露湿地；带着露水地（常用于诗意或描写性的表达）。"},"examples":[{"en":"We walked dewily across the grass at sunrise.","zh":"日出时我们踩着带露水的草地走过去。"},{"en":"The garden looked dewily fresh after the cool night.","zh":"凉爽的夜晚过后，花园看起来露湿而清新。"}]}],"synonyms":["with dew","dewy","freshly","moistly"],"phonetic":"/ˈduːəli/","extraExplanation":["“dewily”来自名词“dew（露水）”+ 形容词后缀“-y”构成“dewy（带露水的）”，再加副词后缀“-ly”变成“dewily（露湿地）”。","它在现代口语中不算常见，更常出现在文学、诗歌或较精致的描写里，用来营造清晨、清新、柔和的氛围。"]}
{"word":"dewiness","summary":{"en":"Dewiness means a fresh, lightly wet quality like dew, often describing skin or the air.","zh":"Dewiness 指像露水一样清新微湿的质感，常用来形容皮肤或空气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A slightly wet, fresh look or feeling, as if covered with tiny drops of dew; often used to describe skin, air, plants, or mornings.","zh":"带露水般的微湿与清新感；常用来形容皮肤、空气、植物或清晨的感觉。"},"examples":[{"en":"Her makeup gave her skin a natural dewiness.","zh":"她的妆容让皮肤呈现出自然的水润感。"},{"en":"The dewiness of the morning air made the garden smell sweet.","zh":"清晨空气里的湿润清新让花园闻起来很香。"},{"en":"I love the dewiness on the grass after a cool night.","zh":"我喜欢凉爽夜晚过后草地上的露润感。"}]}],"synonyms":["dewy freshness","moisture","freshness","glow"],"phonetic":"/ˈduːi.nəs/","extraExplanation":["“dewiness”来自“dew”（露水）+名词后缀“-iness”（表示某种性质或状态）。在日常英语里，它常出现在护肤/美妆语境中，指“水光感、肌肤水润通透”，也可用于文学或描写自然时强调“清新、带湿意的氛围”。"]}
{"word":"dewinesses","summary":{"en":"“Dewinesses” is the plural of “dewiness,” meaning instances or degrees of a dewy, fresh, slightly wet look.","zh":"“Dewinesses”是“dewiness”的复数，指多种/多处/不同程度的露润感或水润清新、微湿的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the states or qualities of being dewy (slightly wet with tiny drops), or having a fresh, softly glowing look; plural of “dewiness”","zh":"带露水的状态或特质（表面有细小水珠、微湿）；也可指清新、柔和发亮的感觉；“dewiness”的复数"},"examples":[{"en":"In the early morning, the dewinesses on the grass sparkled in the sunlight.","zh":"清晨，草地上的一片片露意在阳光下闪闪发亮。"},{"en":"The photographer tried to capture the different dewinesses of leaves after the rain.","zh":"摄影师想捕捉雨后叶子上不同程度的露润感。"},{"en":"Her makeup aimed for natural dewiness, not an oily shine.","zh":"她的妆容追求自然的水润光泽，而不是油光。"}]}],"synonyms":["dewy freshness","moisture","freshness","glow","dewdrops (context-dependent)"],"phonetic":"/ˈduːi.nəsɪz/","extraExplanation":["“dewinesses”这个复数形式在日常英语里比较少见，因为“dewiness”通常作为不可数名词来谈一种总体的“露润/水润感”。当你想强调“不同种类/不同程度的露润感”（比如不同叶片、不同场景）时，才可能用复数。","构词：dew（露水）+ -y（有……的）→ dewy（带露水的）+ -ness（把形容词变成名词：……的状态/性质）→ dewiness（露润感）→ dewinesses（复数）。"]}
{"word":"dewing","summary":{"en":"“Dewing” usually means “becoming covered with dew” (the -ing form of “dew”); more rarely, it can mean “the forming of dew.”","zh":"“dewing”通常指“正在结露/被露水润湿”（动词“dew”的-ing形式）；较少见时也可指“结露的过程”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Present participle of “dew”) becoming covered with dew; being lightly moistened with tiny drops of water, especially overnight.","zh":"（动词“dew”的现在分词）结露；被露水覆盖；被细小水滴轻轻润湿（尤指夜间到清晨）。"},"examples":[{"en":"By sunrise, the grass was dewing and sparkling in the light.","zh":"日出时，草地正在结露，在光里闪闪发亮。"},{"en":"Cool air can lead to leaves dewing overnight.","zh":"凉爽的空气会让叶子在夜里结露。"}]},{"partOfSpeech":"n.","definition":{"en":"A light deposition or forming of dew; the process of dew appearing (literary/rare).","zh":"薄薄的露水沉积；结露的过程（文学用语/较少见）。"},"examples":[{"en":"After the dewing, the fields looked fresh and bright.","zh":"结露之后，田野看起来清新明亮。"},{"en":"The dewing of the garden made the morning feel quieter.","zh":"花园的结露让清晨显得更安静。"}]}],"synonyms":["beading (with moisture)","glistening (with dew)","moistening","condensing"],"phonetic":"/ˈduːɪŋ/","extraExplanation":["“dewing”常见于描写自然景色的文字里，强调清晨、清凉与清新感。日常英语更常直接说“there was dew on the grass / the grass was covered in dew”。","“dew”既可作名词（露水），也可作动词（结露/使沾露）。因此“dewing”通常是动词的进行时/分词形式；作名词时更偏文学表达。"]}
{"word":"Dewitt","summary":{"en":"DeWitt (also written Dewitt) is mainly a surname; it can also be a first name and a U.S. place name.","zh":"DeWitt（也写作 Dewitt）主要是姓氏；也可作名字，并常见于美国地名中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), used especially in the U.S. and other English-speaking countries.","zh":"（常见于美国等英语国家的）姓氏：DeWitt / Dewitt（德威特/德威特）。"},"examples":[{"en":"My professor’s last name is DeWitt.","zh":"我教授的姓是 DeWitt。"},{"en":"DeWitt is a common surname in parts of the United States.","zh":"在美国的一些地区，DeWitt 是比较常见的姓氏。"}]},{"partOfSpeech":"n.","definition":{"en":"a given name (first name), less common than the surname use.","zh":"（也可作）名字：DeWitt / Dewitt（用作名较少见）。"},"examples":[{"en":"DeWitt introduced himself as “DeWitt Johnson.”","zh":"DeWitt 自我介绍说他叫“DeWitt Johnson”。"},{"en":"In older records, DeWitt sometimes appears as a first name.","zh":"在较早的记录里，DeWitt 有时会作为名字出现。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name (e.g., towns, counties, or schools) in the U.S.","zh":"（也可指）美国的地名（如城镇、县名或学校名等）。"},"examples":[{"en":"She grew up in DeWitt, Michigan.","zh":"她在密歇根州的 DeWitt 长大。"},{"en":"The meeting will be held at DeWitt High School.","zh":"会议将在 DeWitt 高中举行。"}]}],"synonyms":["De Witt","Dewitt"],"phonetic":"/dəˈwɪt/","extraExplanation":["“DeWitt / de Witt”源自荷兰语，字面意思接近“白色的（the white）”，常见于荷兰裔移民后代的姓氏中。","书写上常见变体包括：DeWitt、Dewitt、De Witt。是否大写、是否连写通常取决于家族习惯或官方文件。"]}
{"word":"dewitt","summary":{"en":"DeWitt (also written De Witt or Dewitt) is most commonly a surname, and it can also be a given name or a U.S. place name.","zh":"DeWitt（也写作 De Witt 或 Dewitt）最常见是姓氏，也可作名字或美国地名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A family name (surname).","zh":"姓氏（家族姓）。"},"examples":[{"en":"My teacher’s last name is DeWitt.","zh":"我老师的姓是 DeWitt。"},{"en":"The book was written by Anna DeWitt.","zh":"这本书由 Anna DeWitt 写的。"}]},{"partOfSpeech":"other","definition":{"en":"A given name (first name), though less common.","zh":"名字（名），但较少见。"},"examples":[{"en":"DeWitt moved to Chicago for a new job.","zh":"DeWitt 为了新工作搬到了芝加哥。"}]},{"partOfSpeech":"other","definition":{"en":"A place name in the U.S. (for example, DeWitt is the name of towns/cities in several states).","zh":"美国地名（例如多个州都有名为 DeWitt 的城镇/城市）。"},"examples":[{"en":"They live near DeWitt, Michigan.","zh":"他们住在密歇根州的 DeWitt 附近。"},{"en":"We drove through DeWitt on our way to Syracuse.","zh":"我们去锡拉丘兹的路上开车经过了 DeWitt。"}]}],"phonetic":"/dəˈwɪt/","extraExplanation":["“DeWitt / De Witt / Dewitt”常见拼写差异主要来自荷兰语姓氏传统：De 常表示“the（那个）”，Witt 与“white（白）”相关。英语中常写作 DeWitt（中间大写）。","美国历史上较知名的人物包括纽约州政治家 DeWitt Clinton（与伊利运河相关）。地名 DeWitt 在不同州可能读音相同，但具体指向要看上下文。"]}
{"word":"Dewittville","summary":{"en":"Dewittville is a place name: a small community in Chautauqua County, New York, near Chautauqua Lake.","zh":"Dewittville是地名：美国纽约州肖托夸县靠近肖托夸湖的一个小社区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small community (hamlet) in western New York State, USA, in Chautauqua County near Chautauqua Lake.","zh":"美国纽约州西部的一个小社区（村落/小居民点），位于肖托夸县，靠近肖托夸湖。"},"examples":[{"en":"They rented a cottage near Dewittville for the summer.","zh":"他们在Dewittville附近租了一间小屋过暑假。"},{"en":"Dewittville is a quiet place, especially outside the tourist season.","zh":"Dewittville很安静，尤其在旅游旺季之外。"}]}],"synonyms":["(no direct synonyms; related: place name, hamlet, community)"],"phonetic":"/ˈdiːwɪtˌvɪl/","extraExplanation":["“Dewittville”是专有名词，通常不翻译，中文多直接音译或保留英文拼写。书写时常见为一个词（Dewittville），也可能见到分写（DeWittville）但以当地用法为准。","若你是在地址、地图或邮寄信息里看到它，它通常指社区/地名，而不是普通英文词汇。"]}
{"word":"dewlap","summary":{"en":"A dewlap is loose skin hanging under the throat/neck (especially in animals), and sometimes under a person’s chin (often humorously).","zh":"dewlap 指喉咙/颈部下方下垂的松皮（多指动物），也可指人下巴下的赘肉/双下巴（常带调侃）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Loose skin that hangs under an animal’s throat or neck (common in cattle, some dogs, etc.).","zh":"（动物）喉咙或颈部下方下垂的松皮（常见于牛、某些犬等）。"},"examples":[{"en":"The cow’s dewlap moved as it walked.","zh":"那头牛走路时，颈下垂皮会跟着晃动。"},{"en":"Some breeds have a large dewlap that helps them handle heat.","zh":"有些品种的颈下垂皮较大，有助于适应炎热。"}]},{"partOfSpeech":"n.","definition":{"en":"(Often humorous or slightly rude) A loose fold of skin hanging under a person’s chin; a double chin.","zh":"（常带调侃或略不礼貌）人下巴下方下垂的皮肤褶皱；双下巴。"},"examples":[{"en":"He joked about the dewlap under his chin in old photos.","zh":"他拿老照片里自己下巴下的“垂皮/双下巴”开玩笑。"},{"en":"The lighting made her dewlap more noticeable.","zh":"灯光让她的下巴下垂皮看起来更明显。"}]}],"synonyms":["double chin","loose skin","wattle"],"phonetic":"/ˈduːlæp/","extraExplanation":["“dewlap”最初主要指动物（尤其是牛）的颈下垂皮；用于形容人时，多见于口语或幽默语境，可能带有贬义，正式或礼貌场合可改用“double chin”（双下巴）或更中性的说法。"]}
{"word":"dewlapped","summary":{"en":"“Dewlapped” means having a loose fold of skin under the throat/neck (a dewlap).","zh":"“dewlapped”表示“有颈垂/喉下垂肉的”，多用于描写动物，也可（带玩笑或批评）形容人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a dewlap (a loose fold of skin hanging under the throat or neck), often used to describe certain animals, or sometimes people in a humorous or critical way.","zh":"有“垂肉/颈垂”（喉咙或颈部下方松弛下垂的皮肤褶皱）的；常用于描写动物，有时也用来（略带调侃或批评地）形容人。"},"examples":[{"en":"The dewlapped bull stood in the shade, flicking its tail at flies.","zh":"那头有颈垂的公牛站在阴凉处，用尾巴甩着驱赶苍蝇。"},{"en":"In the painting, a dewlapped hound looks older and heavier than the others.","zh":"在那幅画里，一只下颌/颈部皮肤下垂的猎犬看起来比其他的更老、更沉重。"},{"en":"He joked that he was getting a bit dewlapped with age.","zh":"他开玩笑说自己上了年纪，脖子下面有点“松垮垮”了。"}]}],"synonyms":["pendulous","jowly","loose-necked"],"phonetic":"/ˈdjuːlæpt/","extraExplanation":["“dewlap”指动物（如牛、鹿、某些蜥蜴）颈下或喉部的皮肤垂褶；“dewlapped”多见于描写性写作或自然观察类文本，属于比较书面/文学的形容词。","用于形容人时往往带有调侃意味，可能被认为不够礼貌；更中性的说法可以用 “loose skin under the chin/neck（下巴/颈部松弛的皮肤）”。"]}
{"word":"dewlaps","summary":{"en":"Dewlaps are the loose folds of skin hanging under the throat/chin, especially in animals.","zh":"Dewlaps 指喉部或下巴下方松弛下垂的皮褶，常见于动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Loose skin hanging under the throat of some animals (or sometimes a person’s chin/neck).","zh":"（动物喉部下方或人下巴/颈部的）垂皮，喉垂。"},"examples":[{"en":"The iguana puffed out its dewlap to look bigger.","zh":"鬣蜥鼓起喉垂，让自己看起来更大。"},{"en":"Some cattle have large dewlaps that help them stay cool in hot weather.","zh":"有些牛的喉垂很大，有助于在炎热天气里散热。"},{"en":"In the photo, loose skin formed a small dewlap under his chin.","zh":"照片里，他下巴下面的松弛皮肤形成了一点喉垂。"}]}],"synonyms":["loose skin","skin fold","throat flap"],"phonetic":"/ˈduːlæp/","extraExplanation":["“Dewlaps”是“dewlap”的复数形式。这个词常见于动物学/自然纪录片语境，尤其描述蜥蜴（如鬣蜥）、牛等动物喉部下方的垂皮。有些动物会展开或鼓起喉垂用于展示、求偶或威吓。"]}
{"word":"dewless","summary":{"en":"Dewless means “without dew” or “not covered in dew,” often in poetic description.","zh":"dewless 指“无露的/没有露水的”，常用于较诗意的描写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"without dew; not covered with moisture from dew (often used in poetic or descriptive writing)","zh":"无露的；没有露水的（常用于诗意或描写性表达）"},"examples":[{"en":"By noon the grass was dewless and warm under our feet.","zh":"到了中午，草地已无露水，在脚下变得温暖。"},{"en":"We walked along the dewless path in the dry morning wind.","zh":"我们沿着无露的路走着，清晨的风很干燥。"}]}],"synonyms":["dry","dew-free","arid"],"phonetic":"/ˈduːləs/","extraExplanation":["“dewless”由“dew（露水）+ -less（无……的）”构成，属于比较文学/诗歌化的描写词。比起日常口语里的“dry（干燥的）”，它更强调“本应有露水却没有”的氛围感，常用来营造干旱、炎热或清冷的意象。"]}
{"word":"dewlight","summary":{"en":"“Dewlight” is a rare, poetic word for the soft light of dawn (or something fresh and softly shining like dawn).","zh":"“dewlight”是少见的诗意用词，指拂晓的柔和晨光（也可形容清新、柔亮如晨的感觉）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Poetic, rare) The soft, early light at dawn, when the ground is often wet with dew; daybreak light.","zh":"（诗歌用语，少见）拂晓时柔和的光线，常与露水相伴的晨光；曙光。"},"examples":[{"en":"We left the village in the dewlight, before the sun cleared the hills.","zh":"我们在露光中离开村子，太阳还没越过山丘。"},{"en":"In the poem, dewlight suggests a quiet, hopeful beginning.","zh":"在这首诗里，“dewlight”暗示一种安静而充满希望的开始。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Poetic, rare) Having the quality of dew or dawn—fresh, delicate, and softly shining.","zh":"（诗歌用语，少见）带有露水或黎明气息的——清新、纤柔、微微发亮的。"},"examples":[{"en":"She described the garden as dewlight and new, like morning itself.","zh":"她形容花园清新如露、柔亮如晨，仿佛就是清晨本身。"}]}],"synonyms":["dawn","daybreak","first light","morning light"],"phonetic":"/ˈduˌlaɪt/","extraExplanation":["“dewlight”不是现代英语里的常用词，更常见的表达是“dawn / daybreak / first light”。它多见于诗歌或文学描写，用来把“露水（dew）”的清新与“晨光（light）”的柔和合在一起，营造宁静、纯净、重启的氛围。","写作中也可能看到拼作“dew-light”（带连字符），强调这是一个临时组合的意象词。"]}
{"word":"dewlike","summary":{"en":"“Dewlike” means resembling dew—fresh, light, cool, or in tiny droplets.","zh":"“dewlike”指“像露水一样的”，常形容清新、轻柔、凉爽或细小水滴状的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like dew; resembling dew in being fresh, light, cool, or made of tiny drops.","zh":"像露水的；具有露水般的清新、轻柔、凉爽或细小水滴的特征。"},"examples":[{"en":"The dewlike mist hung over the river at sunrise.","zh":"日出时，露水般的薄雾笼罩着河面。"},{"en":"She had a dewlike freshness after the rain.","zh":"雨后她带着露水般的清新气息。"},{"en":"Dewlike beads formed on the cold glass.","zh":"冰冷的玻璃上凝起露水般的小水珠。"}]}],"synonyms":["dewy","fresh","misty","beaded (with moisture)","cool"],"phonetic":"/ˈduˌlaɪk/","extraExplanation":["“dewlike”多见于诗歌或描写性文字，用来营造清晨、雨后、自然、纯净、轻盈的意象。日常口语里更常用“dewy”（水润的、带露水的）或“misty / fresh / beaded with moisture”等表达。"]}
{"word":"dewool","summary":{"en":"Dewool means to remove wool fibers from something, mainly in textile or leather processing. It’s rare in everyday English.","zh":"Dewool 指去除某物中的羊毛纤维，主要用于纺织或皮革加工语境，日常英语中较少见。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove wool or wool fibers from something (especially from hides/skins or mixed fibers); to make something free of wool","zh":"（尤指从皮革/兽皮或混合纤维中）去除羊毛（纤维）；使不含羊毛"},"examples":[{"en":"The factory uses special machines to dewool the hides before processing them into leather.","zh":"工厂在把兽皮加工成皮革之前，会用专门机器给兽皮脱毛（去除羊毛）。"},{"en":"This step dewools the material so it can be sorted by fiber type.","zh":"这一步会把材料中的羊毛去除，方便按纤维类型分拣。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative, rare) to remove something “woolly,” unclear, or fuzzy from an idea or style; to make it clearer","zh":"（比喻用法，少见）去掉想法/表达中“毛糙、含混”的部分；使更清晰"},"examples":[{"en":"The editor helped dewool the argument by cutting vague sentences.","zh":"编辑通过删掉含糊的句子，帮这段论证“去毛糙”、变得更清晰。"}]}],"synonyms":["remove wool","strip (of wool)","defleece (rare)"],"phonetic":"/diːˈwʊl/","extraExplanation":["“dewool”很少在日常英语中使用，更常见于皮革加工、纺织分拣等行业语境。前缀 de- 常表示“去除/除去”（如 dehydrate 去水、debone 去骨），所以 dewool 直观含义就是“去掉羊毛”。","如果你是在普通对话或写作里想表达“把羊毛去掉/不含羊毛”，更自然的说法通常是：remove the wool / wool-free / without wool。"]}
{"word":"dewooled","summary":{"en":"“Dewooled” means wool has been removed (or that something was made wool-free). It’s a rare word; people often say “sheared” instead for sheep.","zh":"dewooled 表示“已去羊毛/已去绒毛的；（把……）去羊毛”。这个词较少见，谈到羊通常更常说 sheared / shorn（剪过毛）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense/past participle of dewool) to remove wool or a woolly covering from something (especially a sheep or a fleece).","zh":"（dewool 的过去式/过去分词）给……去羊毛；去掉……的羊毛或绒毛（尤指给羊脱毛、把羊毛从皮或毛坯上去除）。"},"examples":[{"en":"After the sheep were dewooled, the fleece was sorted by quality.","zh":"羊脱毛（剪毛/去毛）后，羊毛会按质量分拣。"},{"en":"The hides were cleaned and dewooled before further processing.","zh":"这些皮料在进一步加工前先被清洗并去毛。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adj.) having had its wool removed; no longer woolly.","zh":"（形容词）已去羊毛的；不再毛绒覆盖的。"},"examples":[{"en":"The dewooled sheep looked smaller than usual.","zh":"去毛后的羊看起来比平时小。"},{"en":"A dewooled surface is easier to wash and inspect.","zh":"去毛后的表面更容易清洗和检查。"}]}],"synonyms":["sheared","shorn","wool-free","defleeced"],"phonetic":"/diːˈwʊld/","extraExplanation":["“de-”是英语里常见的前缀，常表示“去除、反向”（如 de-ice 去冰、debone 去骨）。因此 dewool 直观意思就是“去（掉）羊毛/绒毛”。","这个词在日常英语中非常少见；更常见的表达通常是 shear（给羊剪毛）、remove the wool、be shorn（被剪过毛）。在皮革或纺织相关语境中才可能看到 dewool / dewooled。"]}
{"word":"dewooling","summary":{"en":"“Dewooling” means the process of removing wool fibers, especially in leather or textile processing.","zh":"“Dewooling”指去羊毛/脱羊毛纤维的过程，多用于皮革或纺织加工语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of removing wool (or wool fibers) from an animal skin, hide, or a material; also used in textile processing/recycling to separate wool from mixed fibers","zh":"去羊毛；脱毛（把皮革、皮张或材料上的羊毛/羊毛纤维去除；也可指纺织加工或回收中把羊毛从混纺纤维里分离出来）"},"examples":[{"en":"The factory uses chemical dewooling to remove wool fibers from the hides before tanning.","zh":"工厂在鞣制前用化学方法去羊毛，把皮张上的羊毛纤维去掉。"},{"en":"Dewooling helps separate wool from synthetic fibers during textile recycling.","zh":"在纺织品回收中，去羊毛有助于把羊毛与合成纤维分离。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle/gerund of “dewool”: removing wool from something","zh":"“dewool（去羊毛）”的现在分词/动名词：正在/用于把羊毛从某物上去除"},"examples":[{"en":"They are dewooling the skins before the next step.","zh":"他们正在给皮张去羊毛，然后进行下一步。"},{"en":"Dewooling can be done by hand, by machines, or with chemicals, depending on the material.","zh":"根据材料不同，去羊毛可以手工、机械或用化学方法完成。"}]}],"synonyms":["dehairing","defleecing","removing wool","wool removal"],"phonetic":"/diːˈwʊlɪŋ/","extraExplanation":["“dewooling”不是日常英语里常见的词，更偏行业/技术用语（皮革加工、纺织处理与回收领域）。","更常见的相关词有：dehairing（脱毛，尤指去掉毛发）、shearing（剪毛）、tanning（鞣制皮革）。如果你原本想表达“给动物驱虫”，常用词是 deworming。"]}
{"word":"dewools","summary":{"en":"“Dewools” is a rare form meaning “removes wool” (third-person singular of dewool).","zh":"“dewools”较少见，意思是“去除羊毛”，是 dewool 的第三人称单数形式。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(rare) to remove wool from; to strip wool from an animal or a fabric.","zh":"（罕见）去除羊毛；把羊毛从动物或织物上剥离/清除。"},"examples":[{"en":"The factory process first washes the fleece and then dewools it to remove loose fibers.","zh":"工厂流程先清洗羊毛原料，然后进行“去毛”处理以去除松散纤维。"},{"en":"Some tools are designed to dewool thick blankets before reuse.","zh":"有些工具用来在再利用前给厚毯子“去毛”。"}]},{"partOfSpeech":"v.","definition":{"en":"third-person singular present of dewool (“he/she/it dewools”).","zh":"dewool 的一般现在时第三人称单数形式（他/她/它 dewools）。"},"examples":[{"en":"The machine dewools the fabric evenly.","zh":"机器能均匀地给织物去毛。"}]}],"synonyms":["remove the wool","strip of wool","dehair (near meaning in processing)","remove loose fibers"],"phonetic":"/ˌdiːˈwʊl/","extraExplanation":["“dewool / dewools”在现代英语里非常少见，更常见的表达是 remove the wool / remove loose fibers / dehair（去毛）等。","构词上，de- 常表示“去除、反向”（如 de-ice 去冰，debone 去骨），因此 dewool 字面意思就是“去羊毛”。如果你是在某篇文章或说明书里看到它，通常与纺织、清理纤维或处理羊毛材料有关。"]}
{"word":"deworm","summary":{"en":"“Deworm” means to treat a person or animal to get rid of parasitic worms.","zh":"“deworm”指给人或动物进行驱虫治疗，以清除寄生虫（蠕虫）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove parasitic worms from a person or animal, usually by giving medicine (a dewormer).","zh":"（通常用药）给人或动物驱虫；清除体内寄生虫（尤指蠕虫）。"},"examples":[{"en":"The vet dewormed the puppy before its first vaccines.","zh":"兽医在小狗第一次接种疫苗前给它做了驱虫。"},{"en":"Many shelters deworm new cats as part of routine care.","zh":"许多收容所把给新来的猫驱虫作为常规护理的一部分。"}]}],"synonyms":["treat for worms","worm (an animal)","give a dewormer"],"phonetic":"/diˈwɝm/","extraExplanation":["“de-”常表示“去除、消除”（如 de-ice 去冰、debone 去骨），所以 deworm 字面意思就是“去掉虫”。","日常使用中更常见的表达是 give (a pet) a dewormer / worm (an animal)；在医学或兽医语境里 deworm 很常见。"]}
{"word":"dewormed","summary":{"en":"“Dewormed” means worms (parasites) have been removed with medicine, especially in pets or livestock.","zh":"“dewormed”指已用药清除寄生虫（驱虫）的状态，常用于宠物或家畜。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having been given medicine to remove worms (parasites), especially in an animal or child","zh":"已驱虫的；（尤指给动物或儿童）服用驱虫药以清除寄生虫的"},"examples":[{"en":"Make sure your puppy is dewormed before it meets other dogs.","zh":"在你的小狗见其他狗之前，确保它已经驱虫。"},{"en":"The shelter only adopts out cats that are vaccinated and dewormed.","zh":"收容所只领养已接种疫苗并已驱虫的猫。"}]},{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of “deworm”: to give medicine to remove worms (parasites)","zh":"“deworm”的过去式/过去分词：给（人或动物）用药驱虫"},"examples":[{"en":"The vet dewormed the kitten and explained the follow-up schedule.","zh":"兽医给小猫驱了虫，并解释了后续用药时间表。"},{"en":"We dewormed the goats at the start of spring.","zh":"我们在春天开始时给山羊驱了虫。"}]}],"synonyms":["treated for worms","wormed (BrE, informal)"],"phonetic":"/diːˈwɝːmd/","extraExplanation":["“dewormed”在日常中最常出现在宠物护理、兽医记录、收容所领养说明里，常与 vaccinated（已接种疫苗）、spayed/neutered（已绝育）一起出现。","英美语境下，给宠物“定期驱虫”是常见的健康管理做法；具体频率取决于动物年龄、生活环境与兽医建议。"]}
{"word":"deworming","summary":{"en":"Deworming means removing parasitic worms with medicine, especially in pets, livestock, or public health programs.","zh":"deworming 指通过用药清除寄生虫（蠕虫），常见于宠物、家畜护理及公共卫生项目。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The process of giving medicine to remove parasitic worms from a person or an animal.","zh":"用药物清除人体或动物体内寄生虫（蠕虫）的过程；驱虫。"},"examples":[{"en":"The vet recommended deworming the puppy every few months.","zh":"兽医建议每隔几个月给小狗驱虫一次。"},{"en":"In some areas, schools organize regular deworming programs for children.","zh":"在一些地区，学校会为儿童组织定期的驱虫项目。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the act of removing parasitic worms (used before a noun).","zh":"与驱虫有关的（作定语）。"},"examples":[{"en":"Please follow the deworming schedule on the package.","zh":"请按包装上的驱虫时间表操作。"},{"en":"They bought a deworming tablet for their cat.","zh":"他们给猫买了驱虫片。"}]}],"synonyms":["worming (BrE, common in vet contexts)","anthelmintic treatment","parasite treatment"],"phonetic":"/diːˈwɝːmɪŋ/","extraExplanation":["“Deworming”常用于宠物护理和公共卫生语境。公共卫生中的“deworming programs（驱虫项目）”多指在寄生虫感染较常见地区，对儿童等人群进行定期预防或治疗性服药，以减少肠道寄生虫带来的贫血、营养不良等风险。","日常表达里，“deworming medicine/tablet/treatment（驱虫药/驱虫片/驱虫治疗）”很常见；而动词通常说“deworm a dog/cat（给狗/猫驱虫）”。"]}
{"word":"deworms","summary":{"en":"“deworms” means gives a deworming medicine to remove parasitic worms.","zh":"“deworms” 指给（动物/有时人）用驱虫药以清除寄生虫。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of a veterinarian or owner) to give medicine that removes parasitic worms from an animal (or sometimes a person).","zh":"（兽医或饲主）给动物（有时也指人）服用驱虫药，以清除体内寄生虫（蠕虫）。"},"examples":[{"en":"She deworms her puppy every month to prevent parasites.","zh":"她每个月给小狗驱虫一次，以预防寄生虫。"},{"en":"The vet deworms the cats before they are adopted.","zh":"兽医在猫被领养前先给它们驱虫。"},{"en":"He deworms the horses in spring and fall.","zh":"他在春秋两季给马驱虫。"}]}],"synonyms":["treats for worms","worms","administers a dewormer","gives an anthelmintic"],"phonetic":"/diˈwɝmz/","extraExplanation":["“deworms” 是动词 “deworm” 的第三人称单数（he/she/it deworms）。在日常英语里多用于宠物与家畜护理语境。","相关名词：dewormer（驱虫药）。更正式的医学词是 anthelmintic（驱蠕虫药），但口语和兽医沟通时常用 deworm。"]}
{"word":"dewret","summary":{"en":"“Dewret” isn’t a standard English word; it’s likely a typo or a name. Share the sentence for a best guess.","zh":"“dewret”不是标准英语词，可能是拼写错误或名字；把句子发来我可以帮你推断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a name/username.","zh":"不是标准英语单词，可能是拼写错误，或是姓名/用户名。"},"examples":[{"en":"I can’t find “dewret” in an English dictionary—could it be a typo?","zh":"我在英语词典里找不到“dewret”——会不会是拼写错了？"},{"en":"If you tell me the sentence, I can guess what word you meant.","zh":"如果你把它放在句子里，我可以帮你判断你想写哪个词。"}]}],"phonetic":"/duːˈrɛt/","extraExplanation":["“dewret”很可能是把某个常见词打错了。你可以检查：是不是想写 dew（露水）、deter（阻止/威慑）、desert（沙漠/遗弃）、or a name（名字）？","把“dewret”所在的完整句子发我，我可以根据语境给出最可能的正确拼写和意思。"]}
{"word":"dewrot","summary":{"en":"Dewrot means plant rot caused by persistent moisture (like heavy dew), often involving fungus.","zh":"Dewrot 指因露水等长期潮湿导致的（植物）腐烂，常与真菌有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of plant decay caused or worsened by persistent moisture (such as heavy dew), often linked to fungal growth","zh":"（多指植物的）露腐；因长期潮湿（如露水很重）而导致或加重的腐烂，常与真菌滋生有关"},"examples":[{"en":"The grapes spoiled from dewrot after several cool, wet mornings.","zh":"连续几个凉湿的清晨后，葡萄因露腐而坏掉了。"},{"en":"To prevent dewrot, farmers improve airflow and avoid watering late in the day.","zh":"为了预防露腐，农民会改善通风，并避免在傍晚浇水。"}]}],"synonyms":["dew rot","fungal rot","rot","mildew"],"phonetic":"/ˈduːˌrɑt/","extraExplanation":["“dewrot”不是现代英语里非常常见、标准化的单词；在园艺/农业语境中更常写作“dew rot”（分开写），用来描述露水或长期潮湿环境引起的腐烂问题。更常见、更通用的相关词是“rot（腐烂）”“mildew（霉）”“fungal rot（真菌性腐烂）”。如果你是在某本书、游戏或特定地区用法里看到它，也可能是作者自造词或方言写法。"]}
{"word":"dews","summary":{"en":"“Dews” most commonly means drops of dew on surfaces; it can also be the verb form meaning “become covered with dew.”","zh":"“Dews”通常指“露水/露珠”（dew 的复数，用于强调很多露水）；也可作动词，表示“沾上露水/被露水覆盖”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “dew”: tiny drops of water that form on cool surfaces (like grass) especially overnight.","zh":"“dew”的复数：露水；夜间或清晨在较冷的表面（如草叶）凝结成的小水滴。"},"examples":[{"en":"Morning dews covered the grass like a thin layer of pearls.","zh":"清晨的露水像一层珍珠般覆盖在草地上。"},{"en":"The garden sparkled with dews after the cool night.","zh":"凉爽的夜晚过后，花园里露水闪闪发亮。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular of “dew”: to become covered with dew; to moisten lightly with dew.","zh":"“dew”的第三人称单数：被露水覆盖；使微微沾上露水。"},"examples":[{"en":"In early summer, the air cools and the lawn dews before sunrise.","zh":"初夏时，空气变凉，日出前草坪会挂上露水。"},{"en":"The leaves dews quickly in the early morning mist.","zh":"在清晨的薄雾里，叶子很快沾上露水。"}]}],"synonyms":["moisture","morning moisture","condensation","dew drops","droplets"],"phonetic":"/duːz/","extraExplanation":["“dew/露水”在英文里常带有诗意，常用于描写清晨、清新、短暂之美（例如诗歌里写“the dews of morning”）。","名词“dew”通常是不可数名词（There is dew on the grass），但在文学或描写中也会用复数“dews”来强调“很多处露珠/露水”。"]}
{"word":"Dewsbury","summary":{"en":"Dewsbury is most commonly the name of a town in West Yorkshire, England; it can also be a surname.","zh":"Dewsbury 最常见是英国英格兰西约克郡的城镇名；也可以作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a town in West Yorkshire, northern England, near Leeds and Huddersfield","zh":"英国英格兰北部西约克郡的一个城镇，靠近利兹（Leeds）和哈德斯菲尔德（Huddersfield）"},"examples":[{"en":"She grew up in Dewsbury before moving to London.","zh":"她在杜斯伯里长大，后来搬到了伦敦。"},{"en":"The train stopped at Dewsbury station on the way to Leeds.","zh":"去利兹的路上，火车在杜斯伯里站停靠。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname)","zh":"姓氏（较少见）"},"examples":[{"en":"Mr. Dewsbury will lead the meeting today.","zh":"杜斯伯里先生今天将主持会议。"}]}],"synonyms":["(place name)","(proper noun)"],"phonetic":"/ˈduːzbəri/","extraExplanation":["“Dewsbury”主要作为地名使用，读音重音在第一音节。日常英语里如果不加限定（如 town/city/in），通常也能被理解为“杜斯伯里这个地方”。","它属于英格兰的传统工业地区之一，因此在英国语境中有时会让人联想到约克郡（Yorkshire）的口音与工人阶级城镇的文化背景（具体含义仍取决于上下文）。"]}
{"word":"dewtry","summary":{"en":"“Dewtry” is not a standard English vocabulary word; it’s usually a typo or a surname.","zh":"“Dewtry”不是常见的英语词汇；通常是拼写错误或姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it is most often seen as a misspelling or as a proper name (surname).","zh":"不是常见词典里的标准英语单词；多见于拼写错误，或作为专有名词（姓氏）出现。"},"examples":[{"en":"I can’t find “dewtry” in a dictionary—did you mean “dowry” or “dewy”?","zh":"我在词典里找不到“dewtry”——你是不是想写“dowry（嫁妆）”或“dewy（带露水的）”？"},{"en":"Dewtry is also used as a family name in some records.","zh":"在一些记录里，Dewtry 也会作为姓氏出现。"}]}],"phonetic":"/ˈduːtri/","extraExplanation":["“dewtry”很可能是拼写误差。最常见的接近词包括：\n1) dowry（/ˈdaʊri/）：名词，指“嫁妆/陪嫁”；\n2) dewy（/ˈduːi/）：形容词，指“带露水的、湿润的”；\n3) poetry（/ˈpoʊətri/）：名词，指“诗歌”。\n如果你告诉我它出现的句子或上下文，我可以帮你确定你真正想表达的词。"]}
{"word":"dewworm","summary":{"en":"A less common word for an earthworm, especially one seen at dawn or used as fishing bait.","zh":"较少用的“蚯蚓”说法，常指清晨见到的蚯蚓或用作钓鱼饵的蚯蚓。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An earthworm, especially one seen on the ground early in the morning when there is dew; also used for an earthworm used as fishing bait.","zh":"（较少用）蚯蚓，尤指清晨有露水时在地面上看到的蚯蚓；也可指用作钓鱼饵的蚯蚓。"},"examples":[{"en":"Early in the morning, dewworms often come up to the surface.","zh":"清晨时，蚯蚓（dewworms）常常会爬到地表。"},{"en":"He dug up a few dewworms to use as bait for fishing.","zh":"他挖了几条蚯蚓当作钓鱼的鱼饵。"}]}],"synonyms":["earthworm","worm"],"phonetic":"/ˈduːˌwɝːm/","extraExplanation":["“dewworm”是由“dew（露水）+ worm（虫）”组成的合成词，带有口语/方言色彩，在现代英语里远不如“earthworm（蚯蚓）”常见。你在阅读或日常交流中更常遇到的是“earthworm”或在钓鱼语境中用“worms”。","有时也会写作“dew worm”或“dew-worm”。不同写法通常不改变意思。"]}
{"word":"dewy","summary":{"en":"Dewy means covered with dew or fresh and lightly wet; in literature it can also mean fresh and delicate.","zh":"dewy指“带露水的、清新微湿的”；文学中也可指“清新稚嫩、娇柔”的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Covered with, or like, tiny drops of water (dew), especially in the morning; fresh and slightly wet.","zh":"带露水的；像露珠一样的（尤指清晨）；清新而微湿的。"},"examples":[{"en":"The grass was dewy when we went out at sunrise.","zh":"我们日出时出门，草地上满是露水。"},{"en":"She walked through the dewy garden and got her shoes wet.","zh":"她走过带露水的花园，鞋子都湿了。"},{"en":"He took a photo of dewy leaves sparkling in the light.","zh":"他拍下了带露的叶子在光线中闪闪发亮的照片。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Literary) Fresh, young, or delicate in a way that suggests morning dew.","zh":"（文学用法）清新、稚嫩、娇柔得像晨露一样。"},"examples":[{"en":"The poet described her as a dewy rose in spring.","zh":"诗人把她描写成春天里带露的玫瑰。"},{"en":"He admired the dewy innocence in the child’s eyes.","zh":"他欣赏孩子眼神里那种清新的天真。"}]}],"synonyms":["damp","moist","fresh","dewdrop-covered","fresh-faced"],"phonetic":"/ˈduːi/","extraExplanation":["“dewy”来自名词“dew（露水）”。在写作里常用来营造“清晨、清新、洁净”的画面感，也常被用来形容皮肤或妆容（如“dewy skin”=水润光泽的皮肤）。","常见搭配：dewy grass（带露的草）、dewy morning（露重的清晨）、dewy-eyed（天真/含泪的，语气看语境）。"]}
{"word":"Dewyrose","summary":{"en":"“Dewyrose” is a poetic/creative word meaning “dew-kissed rose,” or something fresh and rosy like a rose with dew.","zh":"“Dewyrose”多为诗意/创造性写法，指“带露的玫瑰”，或形容像带露玫瑰般清新柔润、玫瑰般红润的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Poetic/creative) Like a rose covered with dew; fresh, softly shining, and delicately moist.","zh":"（诗意/创造性用法）像沾着露水的玫瑰一样；清新、微微发亮、带着柔润的湿意。"},"examples":[{"en":"She walked into the garden with dewyrose cheeks after the rain.","zh":"雨后她走进花园，脸颊清新润泽，像带露的玫瑰。"},{"en":"The morning air gave the flowers a dewyrose look.","zh":"清晨的空气让花朵呈现出“带露玫瑰”般的光泽。"}]},{"partOfSpeech":"n.","definition":{"en":"A rose (or rose-like color/beauty) that appears dewy; a “dew-kissed rose,” often used in descriptive writing.","zh":"带着露意的玫瑰（或带露玫瑰般的色泽/美感）；多用于描写性文字。"},"examples":[{"en":"In the poem, he compares her smile to a dewyrose at dawn.","zh":"在诗里，他把她的笑容比作黎明时的带露玫瑰。"},{"en":"The painter mixed a dewyrose pink for the sky.","zh":"画家调出一种带露玫瑰般的粉色来画天空。"}]}],"synonyms":["dew-kissed","dewy","rosy","fresh","blooming"],"phonetic":"/ˈduːi roʊz/","extraExplanation":["“Dewyrose”不是最常见的标准词汇，更像是把“dewy（带露水的）+ rose（玫瑰）”合在一起的创意写法，常见于诗歌、广告文案、品牌名或角色名。","如果写成“dewy rose”（分开写）更直观：a dewy rose = 一朵带露水的玫瑰。合写“Dewyrose”并首字母大写时，也可能是名字/昵称/品种名，需要结合上下文判断。"]}
