{"word":"Dex","summary":{"en":"Dex is commonly a nickname (often for Dexter), and it can also mean dextroamphetamine (informal) or dexterity in games.","zh":"Dex 常见为昵称（多为 Dexter 的简称）；也可在口语中指右旋安非他明，或在游戏中指“灵巧/敏捷（dexterity）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name or nickname, often short for “Dexter.”","zh":"人名或昵称，常作为 “Dexter” 的简称。"},"examples":[{"en":"Dex is short for Dexter in this story.","zh":"在这个故事里，Dex 是 Dexter 的简称。"},{"en":"Everyone calls him Dex at school.","zh":"在学校里大家都叫他 Dex。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) a shortened form of “dextroamphetamine,” a stimulant drug name used in medical contexts; also used casually to refer to that medication.","zh":"（非正式）“dextroamphetamine（右旋安非他明）”的简称，一种兴奋剂药物名称，常见于医疗语境；口语里也可指这种药/处方药。"},"examples":[{"en":"He said his doctor adjusted his dex dosage.","zh":"他说医生调整了他的 dex（右旋安非他明）剂量。"},{"en":"In medical notes, “dex” may refer to dextroamphetamine.","zh":"在病历记录里，“dex” 可能指 dextroamphetamine（右旋安非他明）。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially in games) short for “dexterity,” meaning skill and quickness (often a character stat).","zh":"（尤用于游戏）“dexterity（灵巧/敏捷）”的缩写，指灵活与手眼协调（常作为角色属性值）。"},"examples":[{"en":"Put more points into DEX to improve your dodge rate.","zh":"把更多点数加到 DEX 上来提高闪避率。"},{"en":"This build needs high dex for faster attacks.","zh":"这个流派需要高 dex 来提升攻击速度。"}]}],"synonyms":["Dexter","dextroamphetamine","DEX (dexterity)"],"phonetic":"/dɛks/","extraExplanation":["“Dex”在现实生活中最常见是人名昵称；在网络/游戏里常写作全大写“DEX”。","如果你在医疗或处方相关语境里看到“dex”，它可能是药名缩写（如 dextroamphetamine），但具体含义需结合上下文，且不同地区/机构的缩写习惯可能不同。"]}
{"word":"dex","summary":{"en":"“Dex” is an informal abbreviation meaning either “dexterity” (skillful movement) or “DEX” (a decentralized crypto exchange), depending on context.","zh":"“dex”多为非正式缩写：可指“dexterity（灵巧/熟练）”，也可指“DEX（去中心化交易所）”，具体看语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Short for “dexterity,” meaning skill and ease in using your hands or body.","zh":"（非正式）“dexterity（灵巧；熟练）”的缩写，指手部或身体动作的灵活与熟练。"},"examples":[{"en":"You need good dex to play fast pieces on the piano.","zh":"弹奏很快的钢琴曲需要很好的手指灵巧度。"},{"en":"This game rewards dex more than strength.","zh":"这款游戏更看重灵巧而不是力量。"}]},{"partOfSpeech":"n.","definition":{"en":"(finance/crypto) Abbreviation for “decentralized exchange,” a platform where people trade crypto without a central company holding the funds.","zh":"（金融/加密货币）“decentralized exchange（去中心化交易所）”的缩写，指无需中心化机构托管资金的加密资产交易平台。"},"examples":[{"en":"I swapped tokens on a DEX instead of using a traditional exchange.","zh":"我是在去中心化交易所上换币，而不是用传统交易所。"},{"en":"Be careful with fees and fake tokens on some DEXs.","zh":"在一些去中心化交易所上要小心手续费和假币。"}]}],"synonyms":["dexterity (full form)","skill (for the dexterity sense)","decentralized exchange (full form)"],"phonetic":"/dɛks/","extraExplanation":["“dex”本身不是很正式的通用单词，更常见于两类语境：①口语/玩家圈把“dexterity”简写成dex；②加密货币领域常写成“DEX/DEXs”。写作或正式场合建议用全称以避免歧义。","加密语境里常见搭配：on a DEX（在去中心化交易所上）、DEX aggregator（聚合交易器）、DEX liquidity（流动性）。"]}
{"word":"Dexamenus","summary":{"en":"Dexamenus is a minor Greek mythological figure, often the king of Olenus connected with a story involving Heracles.","zh":"Dexamenus（德克萨墨努斯）是希腊神话中的次要人物，常被说成奥勒诺斯之王，并与赫拉克勒斯相关的救援故事相连。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a figure in Greek mythology, usually described as the king of Olenus (in Achaea) and the father of a daughter whom Heracles protects from a violent centaur.","zh":"希腊神话人物，通常被描写为奥勒诺斯（阿开亚地区）的国王；他有一位女儿，在传说中被赫拉克勒斯从凶暴的半人马手中保护。"},"examples":[{"en":"In one myth, Heracles visits Dexamenus and ends up fighting a centaur to protect Dexamenus’s daughter.","zh":"在一个神话版本里，赫拉克勒斯拜访德克萨墨努斯，后来为保护他女儿而与半人马战斗。"},{"en":"Dexamenus is a minor character, but his story connects to the wider cycle of Heracles’s adventures.","zh":"德克萨墨努斯是个较次要的人物，但他的故事与赫拉克勒斯的冒险传说体系相连。"}]}],"phonetic":"/dɛkˈsæmənəs/","extraExplanation":["“Dexamenus”是拉丁化/英语化的拼写，源自古希腊语人名；在英文材料里多见于神话辞典、古典学注释或对赫拉克勒斯事迹的汇编。","常见叙述是：半人马（不同文献可能写作Eurytion等）企图强娶/掳走Dexamenus的女儿，赫拉克勒斯出手相救并杀死半人马。不同版本的人名与细节可能略有差异。"]}
{"word":"dexamethasone","summary":{"en":"Dexamethasone is a strong prescription corticosteroid used to reduce inflammation and suppress the immune system.","zh":"dexamethasone（地塞米松）是一种强效处方糖皮质激素，用于抗炎并抑制免疫反应。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong prescription medicine (a corticosteroid) used to reduce inflammation and suppress the immune system in certain illnesses","zh":"一种强效处方类固醇药物（糖皮质激素），用于减轻炎症并抑制免疫反应，治疗某些疾病"},"examples":[{"en":"The doctor prescribed dexamethasone to reduce swelling in her airway.","zh":"医生开了地塞米松来减轻她气道的肿胀。"},{"en":"Dexamethasone can help control severe allergic reactions, but it must be used carefully.","zh":"地塞米松可能有助于控制严重过敏反应，但必须谨慎使用。"},{"en":"He asked the pharmacist how to take dexamethasone with food.","zh":"他询问药师地塞米松是否需要随餐服用。"}]}],"synonyms":["corticosteroid","glucocorticoid","steroid","Decadron"],"phonetic":"/ˌdɛk.səˈmɛθ.ə.soʊn/","extraExplanation":["地塞米松属于“糖皮质激素/皮质类固醇（corticosteroid）”，常见作用是抗炎、抗过敏、免疫抑制；在临床上可用于多种情况（例如某些炎症性疾病、严重过敏反应、部分癌症相关症状等）。具体适应症与剂量需要由医生决定。","英语中药名常见构词：许多类固醇药物以 -sone 或 -one 结尾（如 prednisone、hydrocortisone）。这是命名习惯，不表示同一种药可以互换。","这类药物可能带来副作用（如血糖升高、胃部不适、情绪变化、感染风险增加等）。不要自行增减剂量或突然停药；如有疑问应咨询医生/药师。"]}
{"word":"Dexamyl","summary":{"en":"Dexamyl is an old brand-name prescription drug combining dextroamphetamine (stimulant) and amobarbital (barbiturate sedative), now largely discontinued due to safety and abuse concerns.","zh":"Dexamyl 是一种旧的处方药商品名，为“右旋安非他明（兴奋剂）+ 阿莫巴比妥（巴比妥类镇静剂）”的复方药，因安全性与滥用风险而基本停用/退市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former brand-name prescription drug that combined a stimulant (dextroamphetamine) and a sedative (amobarbital, a barbiturate), once used for conditions such as depression and weight loss but later largely discontinued because of safety concerns and high risk of dependence/abuse","zh":"（旧）处方药商品名：一种把兴奋剂（右旋安非他明）与镇静剂（阿莫巴比妥，巴比妥类）合在一起的复方药，曾用于抑郁、减重等，但因安全性问题及成瘾/滥用风险高而基本停用/退市"},"examples":[{"en":"Dexamyl was prescribed decades ago, but it is rarely used today because of dependence risks.","zh":"Dexamyl 在几十年前曾被开具处方，但由于成瘾风险，如今已很少使用。"},{"en":"The report described Dexamyl as a combination of a stimulant and a barbiturate.","zh":"报告将 Dexamyl 描述为“兴奋剂 + 巴比妥类镇静剂”的复方药。"}]}],"synonyms":["dextroamphetamine–amobarbital combination","amphetamine–barbiturate combination"],"phonetic":"/ˈdɛksəˌmɪl/","extraExplanation":["这是一个“商品名”（brand name），在医学或历史语境中更常见。很多国家/地区已不再常规使用或已退市；如遇到该词，通常是在旧病历、文学/影视中的药物提及，或讨论20世纪中期的处方药文化与药物滥用史。","由于含有安非他明与巴比妥，两类药物都可能导致依赖与严重副作用；阅读相关内容时要把它当作“历史上的复方处方药”来理解，而不是现代常见用药建议。"]}
{"word":"DEXEC","summary":{"en":"DEXEC is usually a computing acronym or command name related to executing commands/programs (often remotely or in distributed systems).","zh":"DEXEC 通常是计算机领域的缩写或命令名，和执行命令/程序有关（常见于远程或分布式系统）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(computing) A command or tool name used to execute a command/program—often in an automated, remote, or distributed environment (exact meaning depends on the software/system).","zh":"（计算机）一种命令或工具名，用来执行命令/程序——常见于自动化、远程或分布式环境（具体含义取决于所用软件/系统）。"},"examples":[{"en":"The deployment script calls DEXEC to run the same command on multiple servers.","zh":"部署脚本会调用 DEXEC，在多台服务器上运行同一条命令。"},{"en":"If DEXEC fails, check the permissions and the remote connection settings.","zh":"如果 DEXEC 失败，请检查权限以及远程连接设置。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation seen in technical documents, commonly interpreted as “distributed execution” or “dynamic execution,” but not a standard English word by itself.","zh":"在技术文档中出现的缩写，常被解释为“分布式执行”或“动态执行”，但本身不是标准英语单词。"},"examples":[{"en":"DEXEC (distributed execution) is enabled to speed up batch processing.","zh":"启用 DEXEC（分布式执行）以加速批处理。"},{"en":"The manual uses DEXEC as shorthand, so read the glossary for the exact meaning.","zh":"手册把 DEXEC 当作简写使用，因此要查看术语表确认准确含义。"}]}],"synonyms":["execute","run","remote execution","distributed execution"],"phonetic":"/ˈdiːˌɛkˌsɛk/","extraExplanation":["DEXEC 不是通用英语词汇，更像是某个产品/平台里的命令名或模块名（例如脚本工具、集群/远程执行框架等）。同一个缩写在不同公司或项目里含义可能不同。","如果你能提供它出现的上下文（哪份文档、哪个系统、前后句或截图），我可以把它在该场景下的准确含义、用法和常见替代术语一起整理给你。"]}
{"word":"Dexedrine","summary":{"en":"Dexedrine is a brand-name prescription stimulant (dextroamphetamine) used for ADHD and narcolepsy; informally it may also refer to stimulant use, including misuse.","zh":"Dexedrine 是右旋安非他命的商品名处方兴奋剂，用于治疗 ADHD 和嗜睡症；非正式语境中也可能泛指兴奋剂使用（包括滥用）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand name for dextroamphetamine, a prescription stimulant medicine used mainly to treat ADHD and narcolepsy","zh":"右旋安非他命（dextroamphetamine）的商品名；一种处方兴奋剂药物，主要用于治疗注意力缺陷多动障碍（ADHD）和嗜睡症（narcolepsy）"},"examples":[{"en":"The doctor prescribed Dexedrine to help manage his ADHD symptoms.","zh":"医生开了 Dexedrine 来帮助控制他的 ADHD 症状。"},{"en":"Dexedrine can reduce daytime sleepiness for some people with narcolepsy.","zh":"对一些嗜睡症患者来说，Dexedrine 可以减轻白天嗜睡。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) dextroamphetamine used as a stimulant, sometimes referring to non-medical or illegal use","zh":"（非正式）指作为兴奋剂使用的右旋安非他命；有时也含指非医疗用途或非法滥用"},"examples":[{"en":"The article warns about students misusing stimulants like Dexedrine during exam season.","zh":"这篇文章警告学生在考试季滥用 Dexedrine 之类的兴奋剂。"},{"en":"Taking Dexedrine without a prescription can be dangerous and illegal.","zh":"没有处方服用 Dexedrine 既危险也可能违法。"}]}],"synonyms":["dextroamphetamine","amphetamine (broader)","stimulant (general)"],"phonetic":"/ˈdɛksəˌdrin/","extraExplanation":["Dexedrine 是商品名（brand name），常见写法为大写；在医学语境中更中性、准确的说法是“dextroamphetamine”。","它属于受管制药物（controlled substance）。日常英文里谈到用药时，常搭配动词：be prescribed Dexedrine（被开这种药）、take Dexedrine（服用）、adjust the dose（调整剂量）。","文化语境中，兴奋剂有时会与“学习提神/减肥/派对用药”等话题一起出现；若看到语气带批评或警示，多半在谈“misuse/abuse（滥用）”。"]}
{"word":"dexes","summary":{"en":"“Dexes” is the plural of “dex/DEX,” most commonly meaning decentralized exchanges (crypto) or dexterity stats (games); rarely, it can mean “right sides” in heraldry.","zh":"“dexes”是“dex/DEX”的复数：最常见指去中心化交易所（加密领域）或游戏里的敏捷属性；较少见可指纹章学中的“右侧”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “DEX” or “dex”: decentralized exchanges (crypto platforms where people trade tokens directly without a central company).","zh":"“DEX/dex”的复数：去中心化交易所（加密货币领域中，用户可在链上直接交易代币、无需中心化机构的平台）。"},"examples":[{"en":"Many dexes offer lower fees, but you still need to watch out for scam tokens.","zh":"很多去中心化交易所手续费更低，但你仍然要小心诈骗代币。"},{"en":"He compared several dexes before choosing one with the best liquidity.","zh":"他对比了好几个去中心化交易所后，选了流动性最好的一个。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “DEX/dex” in games: dexterity stats (your character’s quickness and accuracy).","zh":"游戏用语中“DEX/dex”的复数：敏捷属性（角色的速度、闪避、命中等能力）。"},"examples":[{"en":"Rogues usually benefit from higher dexes than warriors.","zh":"盗贼通常比战士更需要更高的敏捷属性。"},{"en":"Try different builds and see which dexes feel best for your playstyle.","zh":"试试不同配装，看看哪种敏捷属性最适合你的玩法。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “dex” (from Latin): the right side (used mainly in heraldry or formal descriptions).","zh":"“dex”的复数：右侧（源自拉丁语，多见于纹章学或较正式的描述）。"},"examples":[{"en":"In heraldry, the dexes refer to the right sides from the shield-bearer’s view.","zh":"在纹章学中，“dexes”指从持盾者视角看到的右侧。"}]}],"synonyms":["DEXs","decentralized exchanges","dexterity stats"],"phonetic":"/ˈdɛk.sɪz/","extraExplanation":["“DEX”在加密圈几乎总是“decentralized exchange（去中心化交易所）”的缩写；写作复数时常见“DEXs”或“DEXes”，读音相同。","游戏里“DEX”通常是“dexterity（敏捷）”的缩写；玩家聊天时会说“stack dex / add more DEX”。","“dex-”在英语里也常出现在词根中，和“right（右）”有关，例如“dexterous（灵巧的）”原意与“右手更熟练”相关。"]}
{"word":"dexie","summary":{"en":"Dexie most commonly refers to Dexie.js (a JavaScript library for IndexedDB). In some slang it can mean a dextroamphetamine pill, and in some Australian/NZ informal speech it can mean “excellent.”","zh":"Dexie 最常见指 Dexie.js（用于 IndexedDB 的 JavaScript 库）。在一些俚语中也可指右旋安非他命药片；在部分澳新非正式用法中还可表示“很棒”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a JavaScript library (Dexie.js) that makes it easier to work with IndexedDB in web browsers","zh":"一个 JavaScript 库（Dexie.js），用于更方便地在浏览器中操作 IndexedDB"},"examples":[{"en":"We use Dexie to store user settings offline in the browser.","zh":"我们用 Dexie 在浏览器里离线保存用户设置。"},{"en":"Dexie provides a cleaner API than raw IndexedDB.","zh":"Dexie 提供的接口比直接使用 IndexedDB 更简洁。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang) a dextroamphetamine pill; a stimulant drug","zh":"（俚语）右旋安非他命药片；一种兴奋剂"},"examples":[{"en":"He said he took a dexie to stay awake, which can be dangerous and illegal.","zh":"他说为了熬夜吃了颗 dexie，这可能既危险又违法。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal, mainly Australia/New Zealand) excellent; great","zh":"（非正式，主要用于澳大利亚/新西兰）很棒的；极好的"},"examples":[{"en":"That’s a dexie idea—let’s do it!","zh":"这主意太棒了——就这么干！"}]}],"synonyms":["Dexie.js","IndexedDB wrapper","great (adj.)","excellent (adj.)"],"phonetic":"/ˈdɛksi/","extraExplanation":["“Dexie”在不同语境里意思差别很大：在技术圈最常见的是指 Dexie.js（一个 IndexedDB 的封装库）。在部分英语口语里，它也可能是“dextroamphetamine（右旋安非他命）”的简称，属于药物/毒品相关俚语，使用时要注意法律与健康风险。","如果你是在代码或前端开发文档里看到“Dexie”，通常就是指 Dexie.js；而在日常对话里是否表示“很棒”或“药片”，往往取决于地区（澳新口语 vs. 英美）和上下文。"]}
{"word":"dexies","summary":{"en":"“Dexies” is informal slang for dextroamphetamine pills (often Dexedrine).","zh":"“Dexies”是“右旋安非他命药片（常指 Dexedrine）”的非正式俚语说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Pills containing dextroamphetamine (a stimulant medicine), especially Dexedrine; used as a street/slang term.","zh":"（非正式/俚语）含右旋安非他命的兴奋剂药片，尤指 Dexedrine（右旋安非他明）；常见于口语或“街头说法”。"},"examples":[{"en":"He said he was prescribed dexies for ADHD.","zh":"他说医生给他开了 dexies 来治疗多动症（ADHD）。"},{"en":"Taking dexies without a prescription can be dangerous and illegal.","zh":"没有处方服用 dexies 可能既危险又违法。"},{"en":"In the story, the student uses dexies to stay awake during exams.","zh":"故事里那个学生用 dexies 来在考试期间保持清醒。"}]}],"synonyms":["dextroamphetamine (tablets)","Dexedrine","uppers (slang)"],"phonetic":"/ˈdɛk.siːz/","extraExplanation":["“Dexies”来自药名“Dexedrine”的缩写/昵称（dex-），再加上复数口语后缀“-ies”。在澳大利亚、英国等地的口语里更常见。","语境提醒：这类词经常出现在讨论药物滥用、派对、熬夜学习等情境中；正式写作更常用“dextroamphetamine”或“Dexedrine (tablets)”。"]}
{"word":"dexiocardia","summary":{"en":"Dexiocardia is a medical term for a congenital condition where the heart is positioned on the right side of the chest.","zh":"dexiocardia 指一种先天性情况：心脏位于胸腔右侧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a congenital condition in which the heart is located on the right side of the chest instead of the left (often spelled “dextrocardia”).","zh":"（先天性）右位心：心脏位于胸腔右侧而非左侧的情况（常见拼写为 dextrocardia）。"},"examples":[{"en":"The ultrasound suggested dexiocardia, so the doctor ordered more imaging tests.","zh":"超声检查提示可能是右位心，所以医生安排了进一步的影像检查。"},{"en":"People with dexiocardia may have no symptoms, but some have other heart differences too.","zh":"有些右位心的人没有症状，但也有人同时伴有其他心脏结构差异。"}]}],"synonyms":["dextrocardia","right-sided heart"],"phonetic":"/ˌdɛksi.oʊˈkɑrdiə/","extraExplanation":["“dexio-”源自希腊语，表示“右边”；“-cardia”与“心脏”有关。临床上更常用的拼写是 **dextrocardia**，而 **dexiocardia** 较少见。","右位心有时与 **situs inversus**（内脏反位）相关，也可能与其他先天性心脏问题一起出现；是否需要治疗取决于是否伴随其他结构或功能异常。","在日常就医沟通中，可以用更通俗的说法：**heart on the right side**（心脏在右边）。"]}
{"word":"dexiotrope","summary":{"en":"A dexiotrope is a (usually chemical) substance that rotates polarized light to the right; it can also mean “right-rotating.”","zh":"dexiotrope 指使偏振光向右旋转的（通常为化学）物质，也可作形容词表示“右旋的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) A substance that rotates plane-polarized light to the right (clockwise) when viewed toward the light source; a dextrorotatory compound.","zh":"（化学）使平面偏振光向右（顺时针）旋转的物质；右旋性（右旋光学活性）的化合物。"},"examples":[{"en":"Sucrose is a dexiotrope, so it rotates plane-polarized light to the right.","zh":"蔗糖是右旋性物质（dexiotrope），因此会使平面偏振光向右旋转。"},{"en":"The lab report identified the sample as a dexiotrope based on its positive optical rotation.","zh":"实验报告根据其正的旋光度判断该样品为右旋性物质（dexiotrope）。"}]},{"partOfSpeech":"adj.","definition":{"en":"Right-turning; dextrorotatory (describing optical rotation).","zh":"右旋的；右旋光学活性的（描述旋光方向）。"},"examples":[{"en":"The solution showed a dexiotrope rotation under the polarimeter.","zh":"该溶液在旋光仪下呈现右旋（dexiotrope）的旋转。"}]}],"synonyms":["dextrorotatory","right-rotating"],"phonetic":"/ˌdɛksiəˈtroʊp/","extraExplanation":["词源提示：dexio- 来自希腊语，意为“右边”；-trope 意为“转向/转动”。因此 dexiotrope 直观上就是“向右转的”。","学习要点：在化学与光学中，常见更通用的词是 dextrorotatory（右旋的）或 right-rotating；与之相对的是 levorotatory（左旋的）。在数据上常用“+ / positive rotation（正旋光）”表示右旋。"]}
{"word":"dexiotropic","summary":{"en":"Dexiotropic describes something that turns or moves toward the right side, especially in medical contexts.","zh":"dexiotropic 指“向右转/朝右运动”的，常用于医学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(medicine, biology) Turning or moving toward the right side; right-turning.","zh":"（医学/生物）向右侧转的；朝右运动的。"},"examples":[{"en":"During the exam, the patient’s eyes showed a dexiotropic movement.","zh":"在检查中，病人的眼球出现了向右转的运动。"},{"en":"The doctor noted a dexiotropic response when the head was turned.","zh":"当头部被转动时，医生记录到一个向右的反应。"}]}],"synonyms":["right-turning","rightward","dextral"],"phonetic":"ˌdɛksiəˈtrɑpɪk","extraExplanation":["该词较少见，多出现在神经学/眼科学等描述“转向方向”的语境里。词根 dexi- 来自希腊语，表示“右”；-tropic 表示“转向/趋向”。因此 dexiotropic 直译就是“向右转的/趋右的”。在临床记录中，常用来描述眼球运动、头位变化后的反应或某些反射的方向性。"]}
{"word":"dexiotropism","summary":{"en":"Dexiotropism is the tendency of some plants to twist or grow in a right-handed (clockwise) direction.","zh":"Dexiotropism 指一些植物朝右旋（顺时针、右手性）方向扭转或生长的趋向。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany) a plant’s tendency to twist or grow in a right-handed (clockwise) direction, especially in twining stems or tendrils.","zh":"（植物学）植物（尤指缠绕茎或卷须）朝右旋/右手性方向（通常为顺时针）扭转或生长的趋向。"},"examples":[{"en":"Many climbing vines show dexiotropism, winding around a support in a clockwise direction.","zh":"许多攀缘藤本表现出右旋趋性，会沿支撑物顺时针缠绕。"},{"en":"The researcher recorded whether the seedlings showed dexiotropism or the opposite pattern.","zh":"研究人员记录这些幼苗是否表现出右旋趋性，或相反的模式。"}]}],"synonyms":["right-handed twining","clockwise twining"],"phonetic":"/ˌdɛk.siˈɑː.trə.pɪ.zəm/","extraExplanation":["词源提示：dexio- 来自希腊语，意为“右”；tropism 意为“向某方向转向/趋向”。因此 dexiotropism 字面意思就是“向右转的趋性”。","在植物攀缘的语境里，常用 right-handed / clockwise 来解释；其相对概念常写作 laeotropism（左旋趋性，counterclockwise）。"]}
{"word":"dexiotropous","summary":{"en":"Dexiotropous describes a right-twisting or clockwise spiral direction in biological growth or form.","zh":"dexiotropous 指生物形态或生长呈“向右扭转/顺时针螺旋”的方向（右旋）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology, especially botany) Twisting or spiraling toward the right (clockwise when viewed from the observer), as some climbing stems or shells do.","zh":"（生物学，尤指植物学）向右（顺时针）扭转或螺旋生长的；右旋的（如某些攀援茎或贝壳的螺旋方向）。"},"examples":[{"en":"This vine shows dexiotropous growth, winding to the right as it climbs the pole.","zh":"这株藤蔓呈右旋（dexiotropous）生长，沿着杆子向右缠绕上爬。"},{"en":"In the field notes, the botanist marked the stem as dexiotropous rather than left-twisting.","zh":"在野外记录中，植物学家标注这根茎为右旋（dexiotropous），而不是向左扭转。"}]}],"synonyms":["right-twining","clockwise-spiraling","right-handed (in a spiral sense)"],"phonetic":"/ˌdɛksiˈɑtrəpəs/","extraExplanation":["词源提示：来自希腊语词根 dexi-（右）+ -tropous（转向、扭转）。在描述攀援植物“缠绕方向”时常与 laeotropous（左旋）对比使用。","使用场景：这是非常学术/专业的词，日常英语中通常会用“right-twining / clockwise spiral / right-handed coil”等更常见的表达。"]}
{"word":"Dexter","summary":{"en":"Dexter is mainly used as a male first name or a surname; it can also refer to famous fictional characters and historically means “right” in heraldry.","zh":"Dexter 主要用作男性名字或姓氏；也可指著名虚构角色名；在纹章学等较旧语境中还有“右侧”的含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (first name).","zh":"（男子）名，常用作名字。"},"examples":[{"en":"Dexter is my brother’s name.","zh":"Dexter 是我哥哥的名字。"},{"en":"We met a student named Dexter in English class.","zh":"我们在英语课上认识了一位叫 Dexter 的学生。"}]},{"partOfSpeech":"n.","definition":{"en":"a surname (family name).","zh":"姓氏。"},"examples":[{"en":"Ms. Dexter will lead today’s meeting.","zh":"Dexter 女士将主持今天的会议。"},{"en":"The book was written by Alice Dexter.","zh":"这本书是 Alice Dexter 写的。"}]},{"partOfSpeech":"n.","definition":{"en":"a well-known fictional character name, especially Dexter Morgan from the TV series “Dexter.”","zh":"（流行文化）著名虚构人物名，尤其指美剧《嗜血法医》（Dexter）中的 Dexter Morgan。"},"examples":[{"en":"My friend is watching Dexter again this weekend.","zh":"我朋友这周末又在看《嗜血法医》了。"},{"en":"He dressed as Dexter Morgan for Halloween.","zh":"他在万圣节装扮成 Dexter Morgan。"}]},{"partOfSpeech":"adj.","definition":{"en":"in heraldry and older usage, meaning “right” (the right-hand side).","zh":"（纹章学/较旧用法）表示“右边、右侧”。"},"examples":[{"en":"In heraldry, “dexter” refers to the right side of the shield.","zh":"在纹章学中，dexter 指盾牌的右侧。"}]}],"synonyms":["(name)"],"phonetic":"/ˈdɛkstɚ/","extraExplanation":["“Dexter”源自拉丁语 dexter，原意是“右边的、右手的”。在西方文化里，“右”常与“熟练、吉利”联系在一起（如英文 dexterous“灵巧的”也同源）。","作为人名时，Dexter 在英语世界比较常见；在大众文化中也因美剧《Dexter》而更广为人知。"]}
{"word":"dexter","summary":{"en":"“Dexter” most commonly appears as a heraldry term meaning the shield-bearer’s right side (viewer’s left). It can also mean right-handed/skillful (formal) and is used as a male given name.","zh":"“dexter”最常见于纹章学，指持盾者的右侧（观者的左侧）。它也可表示“右撇子/右手灵巧”（较正式），并且可作为男性名字使用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(heraldry) On the right-hand side of a shield as seen by the person holding it (which is the viewer’s left).","zh":"（纹章学）指持盾者的右侧（也就是观看者的左侧）。"},"examples":[{"en":"In heraldry, “dexter” refers to the right side from the shield bearer’s point of view.","zh":"在纹章学里，“dexter”指的是从持盾者视角看的右侧。"},{"en":"The lion is placed on the dexter side of the coat of arms.","zh":"狮子被放在这枚纹章的 dexter（持盾者右侧）位置。"}]},{"partOfSpeech":"adj.","definition":{"en":"Right-handed; skillful or nimble with the right hand (formal or historical usage).","zh":"右撇子的；右手灵巧的（较正式或历史用法）。"},"examples":[{"en":"She was naturally dexter and learned the violin quickly.","zh":"她天生右手灵巧，很快就学会了拉小提琴。"},{"en":"The text describes him as dexter in swordplay.","zh":"文章形容他使剑时右手很灵巧。"}]},{"partOfSpeech":"n.","definition":{"en":"A male given name: Dexter.","zh":"男性名字：Dexter（德克斯特）。"},"examples":[{"en":"Dexter is a common English-language given name.","zh":"Dexter 是英语里较常见的男性名字。"},{"en":"My coworker Dexter moved here last year.","zh":"我的同事 Dexter 去年搬到这里。"}]}],"synonyms":["right-hand","right-sided","right-handed","dexterous (related)"],"phonetic":"/ˈdɛkstɚ/","extraExplanation":["“dexter”来自拉丁语，原意是“右边的”。在纹章学中它是非常固定的术语：方向以“持盾者”为基准，所以 dexter（持盾者右侧）对应的是“观者左侧”。","英语里更常见的相关词是 “dexterous”（灵巧的），以及 “ambidextrous”（双手都灵巧的）；它们都和 dexter 的“右手/灵巧”概念有关。"]}
{"word":"dexterical","summary":{"en":"Dexterical (rare) means “dexterous/skillful with the hands” or “related to the right hand or right side.”","zh":"Dexterical（罕见）指“手很灵巧的”，也可指“与右手/右侧有关的、右利手的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) skillful and quick with the hands; dexterous.","zh":"（罕见）手很灵巧的；熟练的。"},"examples":[{"en":"She is dexterical with a needle and thread.","zh":"她用针线非常灵巧。"},{"en":"The mechanic’s dexterical fingers fixed the small part in seconds.","zh":"机械师灵巧的手指几秒钟就修好了那个小零件。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare, formal) relating to the right side or the right hand; right-handed.","zh":"（罕见，正式）与右侧或右手有关的；右利手的。"},"examples":[{"en":"The injury limited his dexterical movement, so he wrote with his left hand.","zh":"受伤限制了他右手的活动，所以他用左手写字。"}]}],"synonyms":["dexterous","skillful","nimble","right-handed"],"phonetic":"/dɛkˈstɛrɪkəl/","extraExplanation":["“dexterical”是很少见的形容词，更常用的是“dexterous（灵巧的）”或“right-handed（右利手的）”。","词根来自拉丁语“dexter（右边）”。在欧洲纹章学（heraldry）里，“dexter”指盾牌持有者的右侧（对观者来说通常是左边），因此在描述徽章位置时可能会见到相关用法。"]}
{"word":"dexterity","summary":{"en":"Dexterity means skill and ease in precise hand movements, and more broadly, skillful, quick handling of situations.","zh":"dexterity 指手部精细动作的灵巧与熟练，也可泛指处事与应对的机敏和圆融。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"skill and ease in using your hands and fingers, especially for small or precise movements","zh":"（尤指手和手指做精细动作的）灵巧，熟练"},"examples":[{"en":"Playing the piano requires great dexterity.","zh":"弹钢琴需要很高的手指灵巧度。"},{"en":"The surgeon performed the operation with remarkable dexterity.","zh":"外科医生以惊人的娴熟技巧完成了手术。"}]},{"partOfSpeech":"n.","definition":{"en":"skill in thinking or acting quickly and effectively; mental or strategic skill","zh":"（思维或应对的）机敏，圆融的处理能力"},"examples":[{"en":"She handled the tough questions with dexterity and calm.","zh":"她以机敏和冷静应对了那些尖锐的问题。"},{"en":"Good managers need political dexterity as well as technical knowledge.","zh":"优秀的管理者除了技术知识，也需要一定的处事圆融能力。"}]}],"synonyms":["skill","agility","nimbleness","adeptness","facility"],"phonetic":"/dɛkˈstɛrəti/","extraExplanation":["Dexterity 最常见的搭配是 manual dexterity（手部灵巧）。在工作与学习语境中，它常用来强调“需要细致手工/精密操作的能力”，例如外科手术、手工艺、乐器演奏等。","词根来自拉丁语 dexter（“右边的、灵巧的”）。英语里 right-handed（右利手）常与“更灵巧”产生文化联想，但现代用法中 dexterity 不带价值判断，只指熟练与灵活。"]}
{"word":"dexterous","summary":{"en":"Dexterous means skillful and quick, especially with the hands, and sometimes clever in handling situations.","zh":"dexterous 指“灵巧熟练（尤指手巧）”，也可指“处理事情机敏娴熟”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Skillful and quick with the hands and fingers; good at doing precise movements.","zh":"（手和手指）灵巧的；动作熟练敏捷的。"},"examples":[{"en":"She is dexterous with chopsticks, even with slippery noodles.","zh":"她用筷子很灵巧，即使是滑溜的面条也能夹住。"},{"en":"A dexterous surgeon can make very small, careful cuts.","zh":"手法灵巧的外科医生能做非常细小而谨慎的切口。"}]},{"partOfSpeech":"adj.","definition":{"en":"Clever and skillful in handling tasks or situations (not only physical skill).","zh":"（处理任务或局面）机敏而熟练的；善于应对的（不只指手上功夫）。"},"examples":[{"en":"He gave a dexterous answer that avoided blaming anyone.","zh":"他给出了一个很圆滑机敏的回答，没有责怪任何人。"},{"en":"The team made a dexterous change in strategy when the market shifted.","zh":"市场变化时，团队机敏地调整了策略。"}]}],"synonyms":["skillful","nimble","adroit","handy","agile"],"phonetic":"/ˈdɛk.stə.rəs/","extraExplanation":["词源提示：dexterous 来自拉丁语 dexter（“右边的”）。在很多文化里“右手”常与熟练联系在一起，因此 dexterous 引申为“手巧、灵活”。与之相对的 clumsy 表示“笨拙的”。","使用建议：形容“手巧”时常搭配 with + 工具/动作（dexterous with a needle / with chopsticks）。也可用来形容谈判、回答等“处理得巧妙”。"]}
{"word":"dexterously","summary":{"en":"Dexterously means “in a very skillful, agile way,” often describing precise hand or body movements.","zh":"dexterously 表示“非常熟练、灵巧地”，常用来形容精细的手部或身体动作。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a skillful and controlled way, especially using your hands or body movements.","zh":"熟练而灵巧地（尤指手或身体动作控制得很好）。"},"examples":[{"en":"She dexterously braided her hair in under a minute.","zh":"她熟练地在一分钟内就把头发编好了。"},{"en":"The surgeon dexterously guided the instrument through a tiny opening.","zh":"外科医生熟练地将器械穿过一个很小的切口。"}]}],"synonyms":["skillfully","adroitly","deftly","nimbly"],"phonetic":"/ˈdɛk.stɚ.əs.li/","extraExplanation":["词源提示：dexterously 来自 dexterous（灵巧的），其更早的词根 dexter 在拉丁语里有“右边的”意思。西方文化中“右手”常与熟练、好运联系在一起，因此 dexterous/dexterously 带有“手很巧、动作很稳”的感觉。"]}
{"word":"dexterousness","summary":{"en":"Dexterousness means skillful, nimble use of the hands (or precise, quick movements).","zh":"Dexterousness 指手部或动作的灵巧与熟练（尤其是精细、快速的动作）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"skill and ease in using your hands, or in doing tasks that require careful, quick movements","zh":"（手或动作的）灵巧；熟练（尤指需要细致、快速动作的能力）"},"examples":[{"en":"The surgeon’s dexterousness helped the operation go smoothly.","zh":"外科医生的灵巧让手术进行得很顺利。"},{"en":"You need dexterousness to play the piano well.","zh":"要把钢琴弹好需要灵巧的手指与熟练的动作。"},{"en":"Her dexterousness with a needle made the repairs almost invisible.","zh":"她用针线的手艺很巧，补得几乎看不出来。"}]}],"synonyms":["dexterity","nimbleness","skill","handiness"],"phonetic":"/ˈdɛkstəɹəsnəs/","extraExplanation":["“dexterousness”来自形容词“dexterous”（灵巧的）加名词后缀“-ness”。日常英语里更常用“dexterity”表达“灵巧/手巧”，语气更自然：e.g., manual dexterity（手部灵巧度）。","词根提示：拉丁语“dexter”原意与“right（右边）”有关，后来引申出“右手更灵巧”的文化联想，因此“dexterous”有“手巧、动作熟练”的意思；相对地，“sinister”历史上与“left（左边）”有关，带有“不祥”的旧含义（现代多用于“邪恶的”语境）。"]}
{"word":"dextorsal","summary":{"en":"“Dextorsal” is a rare anatomical adjective meaning “toward the right and the back (dorsal) side.”","zh":"“dextorsal” 是较少见的解剖学形容词，意思是“朝向右侧并且朝向背侧（右背侧）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Anatomy; rare/technical) Relating to or located toward both the right side (dexter) and the back (dorsal) of a body or structure; right-dorsal.","zh":"（解剖学；较少用/偏专业）与身体或结构的右侧（dexter）和背侧（dorsal）方向都有关的；位于右后（右背）方向的。"},"examples":[{"en":"In some anatomical descriptions, the nerve is said to run along the dextorsal surface of the organ.","zh":"在一些解剖学描述中，这条神经被说成沿器官的右背侧表面走行。"},{"en":"The dextorsal region showed mild swelling compared with the left side.","zh":"与左侧相比，右背侧区域出现了轻微肿胀。"}]}],"synonyms":["right dorsal","dextrodorsal","dextral-dorsal","dorsal (in context)"],"phonetic":"/ˌdɛkˈtɔrsəl/","extraExplanation":["这个词非常少见，更多时候会分别用“right/dextral（右侧的）”和“dorsal（背侧的）”来表达，例如：the right dorsal side（右背侧）。","词源上，dextro-/dexter 表“右”，dorsal 表“背侧”。把两者合在一起就得到“右+背侧”的复合方向词。","如果你是在论文或标注里看到的，也可能是临时造词或拼写变体；常见相近词包括：dorsal（背侧的）、dextral/dextro-（右侧的）、dextro-dorsal（更常见的写法之一）。"]}
{"word":"dextr","summary":{"en":"dextr- (often dextro-) is a technical form meaning “right/right-sided.”","zh":"dextr-（常见形式为 dextro-）是表示“右/右侧”的专业词根或词缀。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a shortened form or prefix meaning “right” or “on the right side,” used especially in scientific or technical words (often written as dextr- or dextro-).","zh":"表示“右、右侧”的缩略形式/词缀，多用于科技或专业词汇中（常写作 dextr- 或 dextro-）。"},"examples":[{"en":"In anatomy, dextr- can refer to the right side of the body.","zh":"在解剖学中，dextr- 可以指身体的右侧。"},{"en":"Dextrocardia is a condition where the heart is on the right side.","zh":"Dextrocardia（右位心）指心脏位于右侧的一种情况。"},{"en":"In chemistry, dextro- may describe a substance that rotates light to the right.","zh":"在化学中，dextro- 可能指让偏振光向右旋转的物质。"}]}],"synonyms":["dextro-","right-"],"phonetic":"/ˈdɛkstr/","extraExplanation":["你输入的“dextr”更像是词根/前缀，而不是一个常见的完整单词。日常英语里更常见的是：\n- dexterous（灵巧的）\n- right-handed（惯用右手的）\n如果你本来想查的是 dexter 或 dexterous，也可以告诉我，我可以按那个词给你更完整的释义与用法。"]}
{"word":"Dextra","summary":{"en":"Dextra is a rare Latin-based word meaning “the right side/right hand,” used mainly in heraldry or classical/academic contexts.","zh":"Dextra 是一个较少见的拉丁语词，意为“右侧/右手”，主要用于纹章学或古典、学术语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare; from Latin) the right side or the right hand; often used in specialized contexts like heraldry or Latin phrases.","zh":"（少见；源自拉丁语）右侧或右手；多见于纹章学或拉丁语语境中。"},"examples":[{"en":"In heraldry, “dextra” refers to the right side of the shield (from the bearer’s point of view).","zh":"在纹章学中，“dextra”指盾牌的右侧（以持盾者的视角为准）。"},{"en":"The inscription uses Latin, where “dextra” can mean “the right hand.”","zh":"该铭文使用拉丁语，其中“dextra”可表示“右手”。"}]}],"synonyms":["right","right-hand","dexter","dextral"],"phonetic":"/ˈdɛkstrə/","extraExplanation":["“dextra”来自拉丁语，和英语词根 dextr-（如 dexterous“灵巧的”）同源，核心含义是“右、右边”。","在西方纹章学里常与 dexter（右）/ sinister（左）成对出现：dexter 通常象征正面、吉祥；sinister 在现代英语里还发展出“邪恶的、不祥的”等引申义。","现代英语中更常用的是 dexter（纹章学）、dextral（右侧的/右旋的）、right/right-hand；“dextra”多见于拉丁文引语或学术/古典语境。"]}
{"word":"dextrad","summary":{"en":"“Dextrad” means “toward the right side,” mainly in anatomical descriptions.","zh":"“dextrad”意为“向右侧”，主要用于解剖学等专业描述。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"toward the right side of the body (used especially in anatomy and biology).","zh":"向身体的右侧（尤用于解剖学、生物学）。"},"examples":[{"en":"In many animals, the heart lies slightly dextrad of the midline.","zh":"在许多动物中，心脏位于身体中线的稍右侧（偏右）。"},{"en":"The tumor shifted dextrad as it enlarged.","zh":"随着肿瘤变大，它向右侧移位。"}]}],"synonyms":["to the right","rightward"],"phonetic":"/ˈdɛkstræd/","extraExplanation":["“dextrad”主要出现在医学/解剖学语境里，日常英语很少用。它由拉丁语 dexter（右）+ -ad（向着……）构成，意思是“朝右”。","相关对比：sinistrad = 向左；dextral = 右侧的/右旋的（形容词），而 dextrad 是副词。"]}
{"word":"dextral","summary":{"en":"Dextral means right-handed or on/turning to the right; in science it can mean rotating light to the right.","zh":"Dextral 指“右利手的”或“在右侧/向右的”；在科学语境中也可指“右旋的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Right-handed; using the right hand more skillfully than the left.","zh":"右利手的；惯用右手的。"},"examples":[{"en":"Most people are dextral, so many tools are designed for right-handed use.","zh":"大多数人是右利手，所以很多工具都按右手使用来设计。"},{"en":"As a dextral player, he prefers holding the racket in his right hand.","zh":"作为右利手选手，他更习惯用右手握球拍。"}]},{"partOfSpeech":"adj.","definition":{"en":"Situated on, turning to, or moving toward the right side (often used in technical contexts).","zh":"位于右侧的；向右转的；朝右方向运动的（多用于专业语境）。"},"examples":[{"en":"The road makes a dextral turn after the bridge.","zh":"过桥后道路向右转。"},{"en":"The sign indicates a dextral curve ahead.","zh":"标志提示前方是右弯道。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Chemistry/physics) Rotating plane-polarized light to the right; dextrorotatory.","zh":"（化学/物理）使偏振光的偏振面向右旋转的；右旋的。"},"examples":[{"en":"This sugar solution is dextral, so it rotates polarized light clockwise.","zh":"这种糖溶液是右旋的，所以会使偏振光顺时针旋转。"}]}],"synonyms":["right-handed","right-sided","dextrorotatory"],"phonetic":"/ˈdɛkstrəl/","extraExplanation":["“dextral”来自拉丁语 dexter（右边、吉利的）。英语里还有一对常见对比词：sinistral（左边的/左利手的），源自拉丁语 sinister（左边的；在一些文化语境里也带“不祥”的联想）。","在一些学科里，“dextral”常用来描述方向或旋向：例如贝壳的螺旋多数是右旋（dextral），地质学里也可能用它描述断层的右行位移（right-lateral）。日常英语中更常用 right-handed / on the right，而 dextral 更偏书面或技术用语。"]}
{"word":"dextrality","summary":{"en":"Dextrality means right-handedness, or (in biology) a rightward/clockwise spiral direction.","zh":"dextrality 指右利性（右手更常用），也可指（生物学中）向右/顺时针的螺旋方向。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being right-handed; right-handedness","zh":"右利性；右撇子特质（右手更常用的倾向）"},"examples":[{"en":"In some families, dextrality seems more common than left-handedness.","zh":"在一些家庭里，右利性似乎比左利性更常见。"},{"en":"The questionnaire asked about hand preference and dextrality in daily tasks like writing.","zh":"问卷调查了人们在书写等日常任务中的用手偏好与右利性。"}]},{"partOfSpeech":"n.","definition":{"en":"(biology/zoology) a rightward or clockwise direction of twisting or spiraling (e.g., in shells or vines)","zh":"（生物/动物学）向右或顺时针的扭转、螺旋方向（如贝壳或藤蔓）"},"examples":[{"en":"Most common garden snails show dextrality in the direction of their shell spiral.","zh":"常见的花园蜗牛大多在壳的螺旋方向上呈现右旋性。"},{"en":"Researchers compared dextrality and leftward coiling in different populations.","zh":"研究人员比较了不同种群的右旋性与左旋性。"}]}],"synonyms":["right-handedness","dextral tendency","right-handed preference"],"phonetic":"/dɛkˈstræləti/","extraExplanation":["“dextrality”来自拉丁语 dexter（右边的、右手的）。与之相对的常见词是“sinistrality”（左利性/左旋性）。","在日常英语里，人们更常说“right-handedness”而不是“dextrality”；“dextrality”更偏学术或技术语境（如心理学、动物学）。"]}
{"word":"dextrally","summary":{"en":"Dextrally means “in a right-handed/rightward way,” especially referring to rightward spirals (biology) or right-rotating optical activity (chemistry).","zh":"dextrally 指“以右手/向右的方式”，尤其用于描述生物中的右旋螺旋，以及化学中的使偏振光向右旋转。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a right-handed or right-side way; toward the right (often used in technical contexts).","zh":"以右手（右侧）的方式；朝右（常用于专业语境）。"},"examples":[{"en":"The staircase curves dextrally as you go up.","zh":"楼梯向上时向右旋转。"},{"en":"Some vines twist dextrally around their supports.","zh":"有些藤蔓会沿支撑物向右缠绕。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Biology/Zoology) Describing a right-handed spiral or coiling pattern (for example, a shell that coils to the right).","zh":"（生物/动物）描述“右旋”的螺旋或盘绕方式（例如贝壳向右卷曲）。"},"examples":[{"en":"Most common garden snails have shells that coil dextrally.","zh":"多数常见花园蜗牛的壳是右旋的。"},{"en":"The species is identified partly by whether the shell grows dextrally or sinistrally.","zh":"鉴定该物种的一部分依据是贝壳是右旋还是左旋。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Chemistry) In a way that rotates plane-polarized light to the right (clockwise) when viewed facing the light source.","zh":"（化学）以使偏振光向右（顺时针）旋转的方式（面向光源观察时）。"},"examples":[{"en":"This sugar solution behaves dextrally in a polarimeter.","zh":"这种糖溶液在旋光仪中表现为右旋。"},{"en":"Two compounds can look similar but differ because one rotates light dextrally.","zh":"两种化合物可能看起来相似，但因为其中一种使光右旋而不同。"}]}],"synonyms":["rightward","to the right","dexterously (context-dependent)","clockwise (in some contexts)"],"phonetic":"/ˈdɛkstrəli/","extraExplanation":["“dextrally”来自拉丁语 dexter（右边、右手）。英语里 dextral=“右旋/右侧的”，sinistral=“左旋/左侧的”。","在生物学里常用来描述蜗牛壳等的卷曲方向：把壳尖朝上、壳口朝向你时，壳口在右边通常称为右旋（dextral）。","在化学里与“旋光性”有关：能使偏振光向右转的物质常被称为 dextrorotatory（右旋），常用符号“(+)”标记；但“(+) / (-)”与“R/S”构型并不必然对应。"]}
{"word":"dextran","summary":{"en":"Dextran is a bacterial polysaccharide (complex sugar) used in some medical products and in laboratory/industrial applications.","zh":"Dextran（右旋糖酐）是一种由细菌产生的多糖，常用于部分医疗制剂以及实验室/工业用途。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a complex sugar (polysaccharide) made of many glucose units, produced by certain bacteria; used in medicine and industry (for example, as a blood-volume expander or in lab techniques).","zh":"一种由许多葡萄糖单元组成的复杂糖（多糖），可由某些细菌产生；用于医学和工业（例如作为扩容剂或用于实验室技术）。"},"examples":[{"en":"In some hospitals, dextran has been used to help increase blood volume after severe blood loss.","zh":"在一些医院里，右旋糖酐曾被用于严重失血后帮助增加血容量。"},{"en":"The researcher purified the protein using a dextran-based chromatography column.","zh":"研究人员使用以右旋糖酐为基质的色谱柱来纯化该蛋白。"}]}],"synonyms":["polysaccharide","glucan"],"phonetic":"/ˈdɛkstræn/","extraExplanation":["“dextran”常见于医学与生物实验语境：医疗上指一类不同分子量的右旋糖酐制剂（用途与风险会因分子量与配方而异）；实验上常见于“dextran gel（右旋糖酐凝胶）/dextran beads（右旋糖酐微珠）”，用于凝胶过滤（体积排阻）等分离方法。","词源提示：dextran 最早与细菌把蔗糖转化为葡聚糖类物质有关，名称中的“dex-”与“dextrose（葡萄糖）/dexter（右、右旋）”在科学命名中有一定关联，但日常理解可直接记为“细菌产的多糖，用于医药和实验”。"]}
{"word":"dextranase","summary":{"en":"Dextranase is an enzyme that breaks down dextran, a polysaccharide.","zh":"Dextranase（右旋糖酐酶）是一种分解右旋糖酐（多糖）的酶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An enzyme that breaks down dextran (a kind of polysaccharide) into smaller sugar units.","zh":"（一种）分解右旋糖酐（多糖）的酶，使其变成更小的糖类片段。"},"examples":[{"en":"Dextranase is used to degrade dextran into smaller sugars in laboratory work.","zh":"在实验室中，右旋糖酐酶可用于把右旋糖酐分解成更小的糖类。"},{"en":"Some dental-care products mention dextranase because dextran can be part of plaque biofilms.","zh":"一些口腔护理产品会提到右旋糖酐酶，因为右旋糖酐可能是牙菌斑生物膜的一部分。"}]}],"synonyms":["dextran hydrolase"],"phonetic":"/dɛkˈstræn.eɪs/","extraExplanation":["“Dextranase”由“dextran（右旋糖酐）+ -ase（酶的常见后缀）”组成，-ase 常用来表示“催化某种反应的酶”。","在微生物学与食品/发酵相关领域，右旋糖酐可能会影响溶液黏度或形成生物膜；因此右旋糖酐酶常被讨论用于降低黏度、分解聚合物或干预生物膜结构。"]}
{"word":"dextrane","summary":{"en":"Dextran is a glucose-based polymer used especially in medicine (IV fluids) and in labs/industry as a stabilizer or thickener.","zh":"Dextran（常见拼写；你写的 dextrane 多半指它）是一种由葡萄糖组成的多糖聚合物，常用于医学输液扩容，也用于实验室/工业作稳定剂或增稠剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical substance (a kind of sugar polymer) used in IV fluids to help increase blood volume, and also used as a stabilizer/thickener in labs and industry.","zh":"一种医用物质（由葡萄糖组成的多糖聚合物），常用于静脉输液以增加血容量，也可在实验室和工业中作稳定剂/增稠剂。"},"examples":[{"en":"After major blood loss, the doctor ordered an IV solution containing dextran.","zh":"在大量失血后，医生开了含右旋糖酐的静脉输液。"},{"en":"In the lab, dextran can be used to help separate cells during a procedure.","zh":"在实验室里，右旋糖酐可用于某些操作中帮助分离细胞。"}]}],"synonyms":["plasma expander","polysaccharide","blood-volume expander"],"phonetic":"/ˈdɛk.stræn/","extraExplanation":["你写的“dextrane”更常见的拼写是 **dextran**（中文常译：右旋糖酐）。","词源提示：dextran 的“dex-”与“dextro-（右旋的）”有关，最初用来描述其光学旋转性质；它本质上是由细菌发酵产生的葡萄糖长链。","语境提醒：在医学里它常被称为“plasma expander（血浆代用品/扩容剂）”，不同分子量的 dextran 用途和风险不同（如过敏反应、影响凝血等），具体使用需遵医嘱。"]}
{"word":"dextrans","summary":{"en":"Dextrans are bacterial polysaccharides used mainly in medicine and laboratory work.","zh":"右旋糖酐是一类由细菌产生的多糖，主要用于医学和实验室研究。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Dextrans: a group of complex sugars (polysaccharides) made by certain bacteria; used in medicine and research, for example as blood-volume expanders or in lab techniques.","zh":"右旋糖酐（复数）：由某些细菌产生的一类多糖；在医学与科研中常用，例如作为扩容剂（增加血容量）或用于实验室技术。"},"examples":[{"en":"In some hospitals, dextrans have been used to help maintain blood volume during shock.","zh":"在一些医院里，右旋糖酐曾被用来在休克时帮助维持血容量。"},{"en":"The lab used dextrans to create a solution with a specific thickness (viscosity).","zh":"实验室使用右旋糖酐来配制具有特定黏度的溶液。"}]}],"synonyms":["dextran (singular)","polysaccharides","plasma expander (medical use)"],"phonetic":"ˈdɛkstrænz","extraExplanation":["“Dextran”来自拉丁语前缀“dextro-”（意为“右”），因为这种多糖常与“右旋（dextrorotatory）”这一光学性质相关。","医学语境中常见“dextran infusion（右旋糖酐输注）”“dextran sulfate（硫酸右旋糖酐）”；不同类型与分子量用途不同。","部分人可能对右旋糖酐出现过敏反应或影响凝血等问题，因此临床使用会受适应证与安全性限制。"]}
{"word":"dextraural","summary":{"en":"Dextraural means “related to or delivered to the right ear,” mainly in audiology contexts.","zh":"dextraural 指“与右耳有关/呈现给右耳的”，多用于听力学等专业语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"related to the right ear; presented to or heard by the right ear (used in audiology and hearing research).","zh":"（听力学/声学用语）与右耳有关的；（声音/刺激）呈现给右耳的、由右耳听到的。"},"examples":[{"en":"In the experiment, the tone was delivered in a dextraural condition (right ear only).","zh":"在实验中，音调以 d-extr-a-ural 条件呈现（仅右耳）。"},{"en":"Dextraural testing can help compare how each ear processes speech sounds.","zh":"右耳（dextraural）测试有助于比较两只耳朵处理语音的差异。"}]}],"synonyms":["right-ear","right-aural"],"phonetic":"/ˌdɛkstrɔˈrəl/","extraExplanation":["这是一个很少见、偏专业的词：dextra- 源自拉丁语，表示“右边”，-aural 表示“耳的”。常见于听力学/心理声学里描述“只给右耳”的刺激条件。","相关对比词：sinistraural（左耳的/只给左耳），binaural（双耳的），monaural/monotic（单耳的）。"]}
{"word":"dextrer","summary":{"en":"“dextrer” isn’t standard; you likely mean “dexterous” (skillful with the hands) or “dexter” (the right side, esp. in heraldry).","zh":"“dextrer”不是标准拼写；你大概率想说“dexterous”（手很灵巧的）或“dexter”（右侧，尤用于纹章学）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard/misspelling) “dextrer” is not a common English word. People usually mean “dexterous” (skillful with the hands) or “dexter” (right-hand/right side, especially in heraldry).","zh":"（非标准/拼写错误）“dextrer”不是常见英语单词。人们通常想表达“dexterous”（手很灵巧的）或“dexter”（右手/右侧，尤用于纹章学）。"},"examples":[{"en":"I think you mean “dexterous”: She’s dexterous with chopsticks.","zh":"我猜你是想说“dexterous”：她用筷子很灵巧。"},{"en":"In heraldry, “dexter” means the right side of a shield (from the shield-bearer’s view).","zh":"在纹章学里，“dexter”指盾牌的右侧（从持盾者的视角来看）。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Closest common word) dexterous: skillful and quick with your hands; able to do tasks easily and well.","zh":"（最接近的常用词）dexterous：手很灵巧的；做事熟练麻利的。"},"examples":[{"en":"The jeweler is dexterous enough to work with tiny stones.","zh":"那位珠宝匠手艺很灵巧，能处理很小的宝石。"},{"en":"With a few lessons, you’ll become more dexterous at typing.","zh":"上几节课后，你打字会更熟练。"}]},{"partOfSpeech":"n.","definition":{"en":"(Related word) dexter: the right-hand side (especially in coats of arms); also used as a name.","zh":"（相关词）dexter：右侧/右手边（尤指纹章中的右侧）；也可作人名。"},"examples":[{"en":"The lion is shown on the dexter side of the shield.","zh":"狮子画在盾牌的右侧（dexter side）。"}]}],"synonyms":["dexterous","skillful","nimble","adroit","handy"],"phonetic":"/ˈdɛkstrəs/","extraExplanation":["“dexter-”这个词根来自拉丁语，和“右手”有关；英语里很多词用它表示“灵巧/熟练”，如 dexterity（灵巧、熟练）。","容易混淆：dexterous（灵巧的）和 ambidextrous（双手都灵巧的）。在纹章学里 dexter/sinister 的“右/左”是从持盾者视角，而不是观众视角。"]}
{"word":"dextrin","summary":{"en":"Dextrin is a starch-based carbohydrate used mainly as a food thickener and an industrial binder.","zh":"糊精是由淀粉制成的碳水化合物，主要用作食品增稠剂和工业黏合剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a starch-derived carbohydrate (a type of sugar) made by heating starch; often used as a thickener or adhesive in foods and industry","zh":"糊精：由淀粉加热分解得到的一类碳水化合物（糖类）；常用作食品增稠剂或工业黏合剂"},"examples":[{"en":"Maltodextrin is a common type of dextrin used in processed foods.","zh":"麦芽糊精是一种常见的糊精，常用于加工食品中。"},{"en":"Dextrin can help thicken sauces and improve texture.","zh":"糊精可以帮助酱汁变稠并改善口感。"},{"en":"Some glues and paper products use dextrin as a binder.","zh":"一些胶水和纸制品会用糊精作黏合剂。"}]}],"synonyms":["maltodextrin (common type)","starch derivative"],"phonetic":"/ˈdɛkstrɪn/","extraExplanation":["“dextrin”常见于食品配料表（如：dextrin, maltodextrin）。它们通常用于改善口感、增加体积或帮助粉末更易溶解。","词源与“dexter（右手）”有关：早期研究发现某些糊精溶液能使偏振光向右旋转，因此得名。日常使用时不需要理解这一点，但能帮助记忆拼写与来源。"]}
{"word":"dextrinase","summary":{"en":"Dextrinase is an enzyme that breaks dextrins into simpler sugars.","zh":"dextrinase 指“糊精酶”，能把糊精分解成更简单的糖。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An enzyme that breaks down dextrins (short chains of glucose) into simpler sugars, such as maltose or glucose.","zh":"糊精酶：一种把糊精（较短的葡萄糖链）分解成更简单糖类（如麦芽糖或葡萄糖）的酶。"},"examples":[{"en":"During brewing, dextrinase helps convert dextrins into fermentable sugars.","zh":"在酿造过程中，糊精酶有助于把糊精转化为可发酵的糖。"},{"en":"Low dextrinase activity can leave a drink with more body and sweetness.","zh":"糊精酶活性较低可能会让饮品口感更厚重、甜感更明显。"}]}],"synonyms":["amylase (broader)","debranching enzyme (related)"],"phonetic":"/ˈdɛkstrəˌneɪs/","extraExplanation":["“Dextrinase”常见于生物化学、食品科学与酿造领域。日常英语里很少使用，更多出现在配方说明、研究论文或工艺讨论中。","词源上由“dextrin（糊精）+ -ase（酶的常见后缀）”构成；看到“-ase”结尾，通常就能判断它是一种酶。"]}
{"word":"dextrinate","summary":{"en":"“Dextrinate” means to turn starch into dextrin, typically by heat or enzymes.","zh":"“dextrinate”指把淀粉通过加热或酶作用转变为糊精（使其糊精化）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to convert (starch) into dextrin, usually by heating or by enzymes; to make something become dextrin-like","zh":"使（淀粉）转变为糊精（常通过加热或酶作用）；使其发生糊精化"},"examples":[{"en":"Heating starch can dextrinate it, making the mixture thicker and slightly sweet.","zh":"加热淀粉会使其糊精化，让混合物变得更浓稠并带一点甜味。"},{"en":"In food processing, manufacturers may dextrinate starch to improve texture.","zh":"在食品加工中，厂商可能会让淀粉糊精化，以改善口感与质地。"}]},{"partOfSpeech":"vi.","definition":{"en":"to undergo conversion into dextrin (to become dextrinized)","zh":"发生糊精化（变成糊精/被糊精化）"},"examples":[{"en":"If the flour is heated too long, some of the starch may dextrinate.","zh":"如果面粉加热太久，其中一部分淀粉可能会发生糊精化。"}]}],"synonyms":["dextrinize","convert","transform","break down (starch)"],"phonetic":"/ˈdɛkstrɪneɪt/","extraExplanation":["“dextrinate”多见于食品科学、酿造、烘焙与化学语境，日常英语里更常说“convert starch to dextrin / dextrinize”。","糊精（dextrin）是淀粉被部分分解后的产物，常用作增稠剂、黏合剂或改善口感的配料。烘焙时表面上色与香气的一部分也和淀粉在高温下的变化有关（但要注意它和“美拉德反应”是不同概念）。"]}
{"word":"dextrine","summary":{"en":"Dextrine (more commonly spelled dextrin) is a starch-derived substance used for thickening and for making adhesives.","zh":"dextrine（更常见拼写为 dextrin）是由淀粉转化而来的物质，常用于增稠和制作胶黏剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a starchy substance made when starch is heated (or partly broken down), used as a thickener or as glue, especially in foods and adhesives","zh":"糊精（淀粉加热或部分分解后形成的多糖物质），常用作增稠剂或黏合剂，尤其用于食品和胶黏剂中"},"examples":[{"en":"Dextrine is used to thicken soups and sauces in some processed foods.","zh":"糊精在一些加工食品中用来增稠汤和酱汁。"},{"en":"Some paper glues contain dextrine because it sticks well and is water-soluble.","zh":"一些纸用胶水含有糊精，因为它黏性好，而且可溶于水。"}]}],"synonyms":["dextrin","starch derivative","starch paste"],"phonetic":"/ˈdɛk.strɪn/","extraExplanation":["“dextrine”也常拼作“dextrin”（更常见的拼写），两者指同一种物质。","词源与性质：名称与拉丁语“dexter（右）”有关，早期研究发现它能使偏振光向右旋转，因此得名。","日常学习提示：在食品配料表上，你更可能看到“dextrin”或“maltodextrin（麦芽糊精）”。麦芽糊精是相关但不完全相同的物质，通常更常用于食品工业。"]}
{"word":"dextrines","summary":{"en":"Dextrines are short-chain carbohydrates made from partially broken-down starch, commonly used as thickeners, stabilizers, or adhesives.","zh":"dextrines（糊精，复数）是由淀粉部分分解生成的短链碳水化合物，常用作增稠剂、稳定剂或黏合剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of dextrin: a group of short-chain carbohydrates made when starch is partially broken down (for example, by heat or enzymes). Dextrins are used in foods and industry as thickeners, stabilizers, or adhesives.","zh":"dextrin 的复数：一类短链碳水化合物，由淀粉部分分解（如加热或酶作用）产生。糊精常用于食品与工业中，作增稠剂、稳定剂或黏合剂。"},"examples":[{"en":"Some instant soups contain dextrines to thicken the broth.","zh":"一些速食汤里会加入糊精来让汤更浓稠。"},{"en":"The label lists dextrines as a binder in the tablet.","zh":"标签上写明糊精在该片剂中用作黏合剂。"},{"en":"During baking, heat can create dextrines from starch, adding mild sweetness and color.","zh":"烘焙时加热可能让淀粉生成糊精，从而带来淡淡甜味和颜色。"}]}],"synonyms":["dextrins","starch derivatives","carbohydrate polymers"],"phonetic":"/ˈdɛkstrɪnz/","extraExplanation":["“dextrins / dextrines”在英文里常见于成分表或工艺说明，属于较偏技术/食品工业用语。日常口语更常用单数“dextrin”来泛指这一类物质。","词源与“right（右）”相关：dextrin 来自拉丁语 dexter（右）。早期发现某些糊精溶液能使偏振光“向右旋”，因此得名。"]}
{"word":"dextrinize","summary":{"en":"Dextrinize means to turn starch into dextrin, often by heat, enzymes, or acids.","zh":"dextrinize 指把淀粉（多在加热、酶或酸作用下）转化为糊精。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to convert starch into dextrin (a group of smaller carbohydrates), usually by heating, enzymes, or acids","zh":"（通常通过加热、酶或酸）把淀粉转化为糊精（较小的碳水化合物）"},"examples":[{"en":"Baking begins to dextrinize the starch on the surface, helping the crust turn golden.","zh":"烘烤会让表层淀粉开始糊精化，从而帮助外皮变成金黄色。"},{"en":"During toasting, heat can dextrinize starch and create a slightly sweet flavor.","zh":"在烘烤（吐司）过程中，加热会使淀粉糊精化，带来一点微甜的味道。"}]}],"synonyms":["convert","transform","break down (starch)","hydrolyze (starch)"],"phonetic":"/dɛkˈstrɪnˌaɪz/","extraExplanation":["“dextrinize”多见于食品科学与烘焙工艺语境，强调淀粉在热/酶作用下变成更短链的糊精，这常与“上色（browning）”“酥脆（crispness）”和“轻微甜味（slight sweetness）”相关。","词形上来自“dextrin（糊精）+ -ize（使……化）”。日常英语中较少用，写作时常用更通俗的表达替换，如“break down starch（分解淀粉）”或“convert starch to dextrin（将淀粉转为糊精）”。"]}
{"word":"dextrinous","summary":{"en":"Dextrinous (more commonly spelled dexterous) means skillful and quick, especially with your hands, and sometimes in handling situations smoothly.","zh":"dextrinous（更常见拼写为 dexterous）指手很灵巧、动作熟练迅速；也可引申为处事应对巧妙圆熟。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Skillful and quick with your hands; showing good hand coordination.","zh":"手很灵巧的；手眼协调好、动作熟练迅速的。"},"examples":[{"en":"She is dextrinous with a needle and can sew very fast.","zh":"她用针很灵巧，缝得非常快。"},{"en":"A dextrinous chef can chop vegetables quickly and safely.","zh":"手法灵巧的厨师能又快又安全地切菜。"}]},{"partOfSpeech":"adj.","definition":{"en":"Able to handle tasks or situations skillfully and smoothly (not only physical tasks).","zh":"（不只指手上动作）处事圆熟的；应对熟练巧妙的。"},"examples":[{"en":"He gave a dextrinous reply that avoided an argument.","zh":"他巧妙地回答，避免了争吵。"}]}],"synonyms":["dexterous","skillful","nimble","adroit","handy"],"phonetic":"/ˈdɛkstrəs/","extraExplanation":["更常见的拼写是 dexterous（不是 dextrinous）。dextrinous 也能见到，但通常被视为较少用或拼写变体。","词根来自拉丁语 dexter（“右边、右手”），因此和“右手更灵活”这一文化观念有关；相对词是 sinister（原意“左边”，后来也发展出“阴险的”含义）。"]}
{"word":"dextrins","summary":{"en":"Dextrins are short-chain carbohydrates made from starch, commonly used to thicken or bind products.","zh":"糊精是由淀粉分解产生的短链碳水化合物，常用于增稠或黏合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group of short-chain carbohydrates made when starch is broken down (for example, by heat or enzymes). Dextrins are often used as thickeners, stabilizers, or binders in foods and other products.","zh":"糊精（由淀粉经加热或酶分解产生的一类短链碳水化合物）。常用作增稠剂、稳定剂或黏合剂，应用于食品及其他产品。"},"examples":[{"en":"When starch is heated, it can break down into dextrins.","zh":"淀粉加热后可能会分解生成糊精。"},{"en":"Some sauces use dextrins to improve thickness and texture.","zh":"一些酱料会使用糊精来增加稠度并改善口感。"},{"en":"Dextrins can also act as a binder in tablets and adhesives.","zh":"糊精也可用作药片和胶黏剂中的黏合剂。"}]}],"synonyms":["starch derivative","carbohydrate","starch breakdown product"],"phonetic":"/ˈdɛkstrɪn/","extraExplanation":["“dextrin”来自拉丁语“dexter”（右边、右手），因为某些糊精溶液会使偏振光“右旋”（dextrorotatory）。","糊精常见于食品标签（如增稠/成膜），也会用于酿造中提升口感与泡沫稳定性；不同来源与工艺会带来不同的功能特性。"]}
{"word":"dextro","summary":{"en":"“Dextro-” is a prefix meaning “right/right-sided,” and in chemistry it can mean “rotating light to the right.”","zh":"“dextro-” 是表示“右侧/右”的前缀；在化学中也可表示“右旋（使光向右旋转）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the right side; right-handed (often used as a prefix in scientific or medical terms).","zh":"与右侧有关的；右利手的（常作为前缀出现在科学或医学术语中）。"},"examples":[{"en":"In anatomy, dextro- often refers to something on the right side of the body.","zh":"在解剖学中，dextro- 常指身体的右侧。"},{"en":"He has a dextro preference, so he writes with his right hand.","zh":"他偏向右利手，所以用右手写字。"}]},{"partOfSpeech":"other","definition":{"en":"(chemistry) indicating a substance that rotates plane-polarized light to the right (clockwise), as in dextro-rotatory.","zh":"（化学）表示某物质使平面偏振光向右（顺时针）旋转，如 dextro-rotatory（右旋）。"},"examples":[{"en":"This sugar is dextro-rotatory, meaning it rotates light to the right.","zh":"这种糖是右旋的，意思是它会使光向右旋转。"}]}],"synonyms":["right-sided","dextral"],"phonetic":"/ˈdɛkstroʊ/","extraExplanation":["dextro- 来自拉丁语 dexter，意为“右边、右手”。在英文里它常作为构词前缀出现，而不是单独作为一个日常单词使用。","常见相关词：dexterity（灵巧，原意与“右手更熟练”相关）、dextral（右侧的/右利手的）。在医学里也可能看到如 dextrocardia（右位心：心脏偏向胸腔右侧）。"]}
{"word":"dextroamphetamine","summary":{"en":"Dextroamphetamine is a prescription stimulant used mainly for ADHD and narcolepsy.","zh":"dextroamphetamine 指主要用于治疗ADHD和发作性睡病的处方兴奋剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a prescription stimulant medication used to treat ADHD and narcolepsy; it is the right‑hand (dextro) form of amphetamine that affects the central nervous system.","zh":"一种处方兴奋剂药物，用于治疗注意力缺陷多动障碍（ADHD）和发作性睡病；属于安非他命（amphetamine）的右旋体，作用于中枢神经系统。"},"examples":[{"en":"My doctor prescribed dextroamphetamine to help manage my ADHD symptoms.","zh":"医生给我开了右旋安非他命来帮助控制我的ADHD症状。"},{"en":"Dextroamphetamine can improve focus, but it may also cause side effects like trouble sleeping.","zh":"右旋安非他命可能提高专注力，但也可能带来失眠等副作用。"}]}],"synonyms":["Dexedrine","amphetamine","stimulant"],"phonetic":"/ˌdɛkstroʊæmˈfɛtəˌmin/","extraExplanation":["“dextro-”表示“右旋/右侧”，在化学中常指分子旋光方向；右旋体可能与左旋体在药效和副作用上有所差异。","该药通常属于管制药品，只应在医生指导下使用；与他人分享或非医疗用途在很多国家/地区都是违法且有风险的。","常见商品名之一是 Dexedrine；但不同剂型（速释/缓释）和剂量用法差异较大，学习词汇时可顺带记住“stimulant（兴奋剂）”“prescription（处方）”“side effects（副作用）”。"]}
{"word":"dextroaural","summary":{"en":"“Dextroaural” means “related to the right ear.”","zh":"“dextroaural”表示“与右耳有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the right ear (especially in hearing tests or medical descriptions).","zh":"与右耳有关的；右耳的（常用于听力检测或医学描述）。"},"examples":[{"en":"The patient showed slightly reduced sensitivity on the dextroaural side.","zh":"患者右耳（dextroaural 侧）的敏感度略有下降。"},{"en":"In the audiogram, the dextroaural results were normal.","zh":"在听力图中，右耳（dextroaural）的结果正常。"}]}],"synonyms":["right-ear","right-sided aural","aural (right side)"],"phonetic":"/ˌdɛkstroʊˈɔrəl/","extraExplanation":["这是一个非常少见、偏医学/听力学的词。词根来自拉丁语：dextro- 表示“右侧”，aural 表示“耳的”。在临床或科研语境里更常见的说法是 right ear（右耳）或 right-sided aural（右侧耳部的）。","相关对称词：sinistroaural（与左耳有关的）。"]}
{"word":"dextrocardia","summary":{"en":"Dextrocardia is a condition where the heart is on the right side of the chest.","zh":"Dextrocardia 指心脏位于胸腔右侧的情况（右位心）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medical condition in which the heart is located on the right side of the chest instead of the left.","zh":"（医学）右位心：心脏位于胸腔右侧而不是通常的左侧的先天性情况。"},"examples":[{"en":"The chest X-ray showed dextrocardia, with the heart pointing to the right.","zh":"胸部X光显示为右位心，心尖朝向右侧。"},{"en":"Some people with dextrocardia have no symptoms and learn about it during a routine exam.","zh":"有些右位心患者没有症状，可能在例行体检时才发现。"},{"en":"The doctor checked whether the dextrocardia occurred alone or with other organ changes.","zh":"医生会检查右位心是单独出现，还是伴随其他器官位置改变。"}]}],"synonyms":["right-sided heart","right-sided cardiac position"],"phonetic":"/ˌdɛkstroʊˈkɑrdiə/","extraExplanation":["词源小提示：dextro- 来自拉丁语，表示“右边”；-cardia 与 “heart（心脏）”有关，因此字面意思是“右侧的心脏”。","易混点：dextrocardia（右位心）强调“心脏在右侧/心尖朝右”；而 situs inversus（内脏反位）是多个器官整体左右对调，右位心有时会与之同时出现，但并不必然。","沟通场景：在就医或做心电图（ECG/EKG）时，告知医护人员有右位心很重要，因为电极放置与影像判读可能需要调整。"]}
{"word":"dextrocardial","summary":{"en":"A medical adjective meaning the heart is located on the right side of the chest.","zh":"医学形容词：指心脏位于胸腔右侧。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medical) Having the heart positioned on the right side of the chest (instead of the usual left side).","zh":"（医学）心脏位于胸腔右侧（而非通常的左侧）的。"},"examples":[{"en":"The X-ray suggested a dextrocardial position of the heart.","zh":"X 光片提示心脏呈右位（dextrocardial）位置。"},{"en":"The doctor noted dextrocardial anatomy before planning the procedure.","zh":"医生在制定手术方案前记录了右位心脏（dextrocardial）的解剖特点。"}]}],"synonyms":["right-sided (heart)","dextrocardiac"],"phonetic":"/ˌdɛkstroʊˈkɑrdiəl/","extraExplanation":["词源提示：dextro- 来自拉丁语，意为“右”；cardial 与“心脏”有关。合起来就是“心脏在右侧的”。","相关概念：dextrocardial 常用来描述“心脏在右侧”的体征或解剖位置；临床上也常见名词 dextrocardia（右位心）以及对比词 levocardia（心脏在左侧）。","使用场景：该词多用于影像学报告、体检记录或术前评估等正式医学语境，日常口语中较少使用。"]}
{"word":"dextrocerebral","summary":{"en":"A rare medical adjective meaning “of the right side of the brain (right cerebral hemisphere).”","zh":"一个少见的医学形容词，意思是“与大脑右侧（右大脑半球）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the right side of the brain (the right cerebral hemisphere).","zh":"与大脑右侧（右大脑半球）有关的；右脑的。"},"examples":[{"en":"The MRI showed a dextrocerebral lesion affecting language processing.","zh":"核磁共振显示右大脑半球有一处病灶，影响了语言处理。"},{"en":"Symptoms suggested dextrocerebral damage, so the doctor ordered further neurological tests.","zh":"症状提示可能存在右脑损伤，因此医生安排了进一步的神经学检查。"}]}],"synonyms":["right-hemispheric","right cerebral","right-brain (informal)"],"phonetic":"/ˌdɛkstroʊsəˈribɹəl/","extraExplanation":["这是一个非常少见、偏医学/解剖学的词，常见于影像学报告或神经学讨论中；日常英语里更常说 right hemisphere（右半球）或 right-brain / right-brained（偏右脑的）。","词源上由 dextro-（右、向右，源自拉丁语 dexter）+ cerebral（大脑的）组成；在医学语境中常与 sinistro-（左）形成对比。","注意：流行文化里的“左脑/右脑人格”说法（如右脑更有创造力）属于简化甚至有争议的观点；医学上更严谨的是描述“右半球/左半球”的功能分工。"]}
{"word":"dextrocular","summary":{"en":"Dextrocular means “of or related to the right eye.”","zh":"dextrocular 意为“与右眼有关的；右眼的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the right eye, or happening in/using the right eye (a technical medical term).","zh":"与右眼有关的；发生在右眼的；使用右眼的（医学术语）。"},"examples":[{"en":"The doctor noted dextrocular vision loss after the injury.","zh":"医生记录了受伤后右眼（dextrocular）的视力下降。"},{"en":"The swelling was mainly dextrocular, not affecting the left eye.","zh":"肿胀主要在右眼（dextrocular），左眼没有受影响。"}]}],"synonyms":["right-eyed","right-ocular","dextral (in context)"],"phonetic":"/dɛkˈstrɑːkjələr/","extraExplanation":["“dextro-”源自拉丁语，表示“右侧/向右”。在医学英语里常见于：dextrocardia（心脏在右侧）、dextrorotation（向右旋转）。\n“ocular”表示“眼睛的”。两者组合成“dextrocular”，字面意思就是“右眼的”。\n这个词较少用于日常英语，更常见的说法是 “right eye” 或 “in the right eye”。"]}
{"word":"dextrocularity","summary":{"en":"Dextrocularity means right-eye dominance—the tendency to rely more on the right eye for aiming or precise viewing.","zh":"dextrocularity 指“右眼优势”，即在瞄准或精细观察时更依赖右眼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the condition or tendency of being right-eye dominant; a preference for using the right eye for aiming, focusing, or precise visual tasks","zh":"右眼优势；在瞄准、对焦或精细视觉任务中更倾向使用右眼的倾向/状态"},"examples":[{"en":"In archery, her dextrocularity made it easier to aim with a right-handed bow.","zh":"在射箭中，她的右眼优势让她用右手弓更容易瞄准。"},{"en":"The coach checked each player’s dextrocularity before deciding which side they should bat from.","zh":"教练在决定每位球员该用哪一侧打击前，先检查了他们是否右眼优势。"},{"en":"If you have dextrocularity, you may naturally line up a camera viewfinder with your right eye.","zh":"如果你是右眼优势，你可能会自然地用右眼对准相机取景器。"}]}],"synonyms":["right-eye dominance","right-eyedness"],"phonetic":"/ˌdɛkstroʊˌɑkjəˈlærɪti/","extraExplanation":["这个词很少见，通常在运动训练（射击、射箭、棒球）或视功能评估中更常用的说法是 **right-eye dominance / right-eyedness**。","词源上可拆成 **dextro-**（右侧）+ **ocular**（眼的）+ **-ity**（性质/状态）。右眼优势并不一定等同于右撇子；有些人会出现“交叉优势”（比如右手但左眼优势），这会影响站姿、瞄准和器材选择。"]}
{"word":"dextroduction","summary":{"en":"“Dextroduction” is likely a misspelling of “destruction” (great damage or the act of destroying).","zh":"“dextroduction”很可能是“destruction”的拼写错误，意为“毁灭；破坏”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended) the act of destroying something, or the state of being destroyed; great damage or ruin.","zh":"（很可能想写的是）毁灭；破坏；被毁坏的状态；严重的损坏或毁坏。"},"examples":[{"en":"The earthquake caused widespread destruction in the city.","zh":"地震在这座城市造成了大范围的破坏。"},{"en":"War often brings destruction to homes and families.","zh":"战争常常给家庭和家园带来毁灭性的破坏。"},{"en":"They worked hard to prevent the destruction of the forest.","zh":"他们努力阻止森林被毁坏。"}]}],"synonyms":["damage","devastation","ruin","demolition"],"phonetic":"/dɪˈstrʌkʃən/","extraExplanation":["“dextroduction”在英语中不是常见或标准拼写，最接近、最常见的词是“destruction”。","词根提示：destruction 来自动词 destroy（摧毁、毁灭）。常见搭配有：cause destruction（造成破坏）、prevent destruction（防止破坏）、massive/widespread destruction（巨大的/广泛的破坏）。"]}
{"word":"dextroglucose","summary":{"en":"Dextroglucose is dextrose—a common form of glucose used for energy and often used in medical and food contexts.","zh":"dextroglucose 指“右旋葡萄糖/葡萄糖（dextrose）”，常用于供能，也常见于医疗与食品语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a form of glucose that rotates polarized light to the right; commonly called dextrose and used by the body as a main source of energy.","zh":"一种使偏振光向右旋转的葡萄糖；常称为“右旋葡萄糖/葡萄糖（dextrose）”，是人体重要的能量来源。"},"examples":[{"en":"The nurse gave the patient an IV solution containing dextroglucose to raise their blood sugar.","zh":"护士给病人输注含右旋葡萄糖的静脉液来升高血糖。"},{"en":"Many sports drinks contain dextroglucose because the body can use it quickly for energy.","zh":"许多运动饮料含右旋葡萄糖，因为人体可以较快利用它供能。"}]}],"synonyms":["dextrose","glucose"],"phonetic":"/ˌdɛkstroʊˈɡluːkoʊs/","extraExplanation":["“dextro-”表示“右/右旋”，与“levo-（左/左旋）”相对；“glucose”是“葡萄糖”。在日常英语里更常见的说法是“dextrose”。","在医疗语境中，常见搭配有“dextrose solution（葡萄糖溶液）”“D5W（5%葡萄糖注射液）”。在食品标签上也可能写作“dextrose”。"]}
{"word":"dextrogyrate","summary":{"en":"Dextrogyrate means “right-rotating,” especially describing a substance that rotates polarized light clockwise.","zh":"dextrogyrate 意为“右旋的”，常指物质使偏振光顺时针（向右）旋转。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Rotating the plane of polarized light to the right (clockwise) when viewed facing the light source; right-rotating (optically active).","zh":"（化学）使偏振光的振动平面向右（顺时针）旋转的；右旋的（有旋光性的）。"},"examples":[{"en":"Sucrose solution is usually dextrogyrate under standard conditions.","zh":"在标准条件下，蔗糖溶液通常呈右旋性（dextrogyrate）。"},{"en":"They measured the sample’s optical rotation and confirmed it was dextrogyrate.","zh":"他们测量了样品的旋光度，确认它是右旋的。"}]}],"synonyms":["dextrarotatory","right-rotating","(+) optical rotation"],"phonetic":"ˌdɛkstroʊˈdʒaɪreɪt","extraExplanation":["词源提示：dextro- 表示“右、右侧”（源自拉丁语 dexter），-gyrate 与“旋转”有关（同源于表示转动的词根）。","在有机化学中，dextrogyrate 描述的是“旋光方向”，常用符号是 (+)；但要注意：(+)/(−) 的旋光方向与 D/L（构型命名）不是一回事，二者不能简单互相推断。"]}
{"word":"dextrogyration","summary":{"en":"Dextrogyration is the right (clockwise) rotation of plane-polarized light caused by a substance.","zh":"Dextrogyration 指物质使平面偏振光向右（顺时针）旋转的现象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the rotation of plane-polarized light to the right (clockwise) as it passes through a substance; also called dextrorotation","zh":"（偏振光通过某物质时）向右（顺时针）旋转的现象；也称“右旋/右旋光性”"},"examples":[{"en":"Sucrose shows dextrogyration in a polarimeter.","zh":"蔗糖在旋光仪中表现出右旋（dextrogyration）。"},{"en":"The scientist measured the solution’s dextrogyration to identify the compound.","zh":"科学家测量溶液的右旋程度来鉴定该化合物。"}]}],"synonyms":["dextrorotation","right-handed optical rotation","(being) dextrorotatory"],"phonetic":"/ˌdɛkstroʊdʒaɪˈreɪʃən/","extraExplanation":["这是一个偏专业的化学/光学术语，常见于“旋光性（optical activity）”的语境：物质使平面偏振光的偏振面发生旋转。","词源上可拆为 dextro-（右）+ gyration（旋转）。与之相对的是 levogyration / levorotation（左旋，向左/逆时针）。","在实验数据里常用符号“+”表示右旋（dextrorotatory），而“−”表示左旋（levorotatory）；具体正负号约定取决于观察方向与仪器标准，但教材与实验报告通常会说明。"]}
{"word":"dextrogyratory","summary":{"en":"Dextrogyratory means “right-rotating”: it turns polarized light clockwise (to the right).","zh":"dextrogyratory 意为“右旋的”：使偏振光顺时针（向右）旋转。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry/Physics) Describing a substance that rotates the plane of polarized light to the right (clockwise) when viewed toward the light source; also called dextrorotatory.","zh":"（化学/物理）指某种物质使偏振光的振动平面向右（顺时针）旋转（从观察者朝光源方向看）；也称“右旋的”。"},"examples":[{"en":"Sucrose is dextrogyratory, so it rotates polarized light to the right.","zh":"蔗糖是右旋的，因此会使偏振光向右旋转。"},{"en":"The sample was labeled dextrogyratory (+) after measurement with a polarimeter.","zh":"用旋光仪测量后，该样品被标记为右旋（+）。"}]}],"synonyms":["dextrorotatory","right-rotating","(+) (in optical rotation notation)"],"phonetic":"/ˌdɛkstroʊˈdʒaɪrəˌtɔri/","extraExplanation":["“dextrogyratory”由拉丁语词根 dexter（右）+ gyr-（转动）构成，常见于有机化学、糖类与手性（chirality）相关的语境。","在实验记录中，右旋通常记作“(+)”或“d/ D-”（但要注意：D/L 构型与 (+)/(-) 旋光方向不是同一概念，不能简单等同）。","更常用的同义词是“dextrorotatory”。日常英语中很少出现，主要用于学术与技术写作。"]}
{"word":"dextrogyre","summary":{"en":"Dextrogyre means “right-rotating,” especially describing substances that rotate polarized light to the right (clockwise).","zh":"dextrogyre 指“右旋的/向右旋转的”，尤用于描述使偏振光向右（顺时针）旋转的物质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry/physics) Rotating plane-polarized light to the right (clockwise) when viewed toward the light source; right-rotatory.","zh":"（化学/物理）使偏振光的偏振面向右（顺时针）旋转的；右旋的。"},"examples":[{"en":"Sucrose is dextrogyre under standard conditions.","zh":"在标准条件下，蔗糖表现为右旋（dextrogyre）。"},{"en":"They measured the sample and found it was dextrogyre, indicating a positive optical rotation.","zh":"他们测量样品后发现其为右旋，说明旋光度为正值。"}]},{"partOfSpeech":"n.","definition":{"en":"A dextrogyre substance or sample (one that shows right-handed optical rotation).","zh":"右旋物质/右旋样品（指呈现右旋光学旋转的物质）。"},"examples":[{"en":"This fraction is a dextrogyre and the other is levorotatory.","zh":"这一组分是右旋体，另一组分是左旋体。"}]}],"synonyms":["dextrorotatory","right-rotatory","(opposite) levogyre"],"phonetic":"/ˌdɛkstroʊˈdʒaɪr/","extraExplanation":["“dextro-” 来自拉丁语，表示“右”；“-gyre” 与“旋转/回转”有关。该词常见于旋光性（optical activity）相关语境，尤其是糖类、氨基酸、药物对映体的研究中。","学习时可与 *levogyre*（左旋）和 *dextrorotatory*（右旋的）对照：*dextrogyre* 强调“向右转/右旋”，通常对应“正的旋光度（+）”。"]}
{"word":"dextrogyrous","summary":{"en":"Dextrogyrous means “spiraling or coiling to the right (clockwise),” mainly used in scientific descriptions.","zh":"dextrogyrous 指“向右（顺时针）盘绕/旋转的”，多用于科学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Spiraling or coiling to the right (clockwise) when viewed from a particular direction; used especially in biology/botany to describe the direction a plant twines or a structure coils.","zh":"（从某一视角看）向右（顺时针）旋转或盘绕的；尤用于生物学/植物学，描述植物缠绕或结构盘旋的方向。"},"examples":[{"en":"In the field guide, the vine is described as dextrogyrous because it twines clockwise around a support.","zh":"在野外图鉴里，这种藤本被描述为dextrogyrous，因为它会顺时针缠绕支架。"},{"en":"The researcher recorded whether each tendril was dextrogyrous or sinistrogyrous.","zh":"研究者记录了每条卷须是向右盘绕（dextrogyrous）还是向左盘绕（sinistrogyrous）。"}]}],"synonyms":["clockwise","right-handed","dextral"],"phonetic":"/ˌdɛkstroʊˈdʒaɪrəs/","extraExplanation":["词源上，dextro- 来自拉丁语 dexter（右），-gyrous 与 “旋转/回环”（gyrus）有关；因此字面意思就是“向右旋转的”。","这是比较学术、偏专业的词，常见于植物缠绕方向、贝壳或角状结构的螺旋方向描述；日常英语更常用 clockwise（顺时针）来表达。","相关对比词：sinistrogyrous（向左/逆时针盘绕的）。在阅读科学文本时，注意作者会说明“从上方看/从生长点看”等观察方向，以避免误判顺逆时针。"]}
{"word":"dextrolactic","summary":{"en":"Dextrolactic means ‘related to D-lactic acid,’ the right-rotating form of lactic acid.","zh":"dextrolactic 指“与D-乳酸（右旋乳酸）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to D-lactic acid (the dextrorotatory form of lactic acid), especially in chemistry, biology, or medicine.","zh":"（化学/生物/医学）与D-乳酸有关的；指乳酸的右旋（D-型）形式。"},"examples":[{"en":"The lab measured dextrolactic acid levels in the blood sample.","zh":"实验室测量了血样中的D-乳酸（右旋乳酸）水平。"},{"en":"Some bacteria produce dextrolactic acid during fermentation.","zh":"一些细菌在发酵过程中会产生D-乳酸（右旋乳酸）。"}]}],"synonyms":["D-lactic","dextrorotatory lactic (acid)","D-lactate (related)"],"phonetic":"/ˌdɛkstroʊˈlæktɪk/","extraExplanation":["“dextro-”来自拉丁语，意思是“右”，常用于化学中表示“右旋”（使偏振光向右旋转）或“D-构型”。“lactic”指乳酸。","在医学语境里，D-乳酸升高有时与某些肠道菌群失衡或短肠综合征等情况相关（用于描述化验指标时较常见）。"]}
{"word":"dextrolimonene","summary":{"en":"Dextrolimonene is a citrus-smelling terpene from citrus peel oil, commonly used in fragrances, flavorings, and as a solvent/cleaner ingredient.","zh":"Dextrolimonene 是一种来自柑橘果皮精油、带柑橘香气的萜烯，常用于香精香料、食品风味，以及作溶剂/清洁成分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A natural chemical (a terpene) found mainly in citrus peel oil, with a strong orange/lemon smell; used as a flavor/fragrance ingredient and as a solvent/cleaning agent.","zh":"一种天然化学物质（萜烯），主要存在于柑橘类果皮精油中，具有明显的橙/柠檬香气；常用作香精香料与食品风味成分，也用作溶剂和清洁剂。"},"examples":[{"en":"Many citrus-scented cleaners use dextrolimonene as a solvent.","zh":"许多柑橘香味的清洁剂会使用 dextrolimonene 作为溶剂。"},{"en":"The label lists dextrolimonene as a fragrance ingredient derived from orange peel.","zh":"标签上写明 dextrolimonene 是一种来源于橙皮的香味成分。"},{"en":"In industry, dextrolimonene can help dissolve oils and grease.","zh":"在工业中，dextrolimonene 可帮助溶解油脂和油垢。"}]}],"synonyms":["d-limonene","limonene","(R)-limonene"],"phonetic":"/ˌdɛkstroʊˈlɪməˌniːn/","extraExplanation":["Dextrolimonene 通常指 d‑limonene（也写作 d-limonene 或 (R)-limonene），“dextro-”表示它是右旋体（会使偏振光向右旋转）。日常产品成分表里更常见写法是 “d‑limonene” 或直接写 “limonene”。","它常被认为相对“天然”，但并不代表完全无刺激：部分人对其（尤其是氧化后的 limonene）可能出现皮肤刺激或过敏反应；在化妆品/清洁用品中通常会标示为可能致敏香料之一。","阅读英文配方或安全资料（SDS）时，可把它理解为“柑橘精油里的主要香味/溶剂成分”，常与 “citrus oil / orange oil / terpene” 等词一起出现。"]}
{"word":"dextromanual","summary":{"en":"Dextromanual means right-handed or related to right-hand manual use, mainly in technical contexts.","zh":"Dextromanual 指“右手优势的/与右手操作有关的”，多见于较正式或学术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the right hand; right-handed, especially in describing manual skills or dominance","zh":"与右手有关的；右手优势的（常用于描述手工操作能力或优势手）"},"examples":[{"en":"Most people are dextromanual and write with their right hand.","zh":"大多数人是右手优势的，用右手写字。"},{"en":"The test compared dextromanual and sinistromanual participants on fine motor control.","zh":"该测试比较了右手优势者与左手优势者在精细动作控制方面的差异。"}]}],"synonyms":["right-handed","dextral"],"phonetic":"/ˌdɛkstroʊˈmænjuəl/","extraExplanation":["“dextromanual”较少出现在日常英语中，更常见于医学、心理学或人体工学等语境，用来更正式地说“right-handed（右撇子/右手优势）”。","词根来自拉丁语：dexter（右）+ manual（手的/手工的）。与之相对的词有“sinistromanual”（左手优势），但同样偏学术。"]}
{"word":"dextropedal","summary":{"en":"“Dextropedal” means right-footed—someone who mainly uses the right foot.","zh":"“dextropedal”表示“右脚为主/惯用右脚”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"right-footed; using or leading with the right foot (especially in sports, dance, or movement description)","zh":"右脚为主的；习惯用右脚（尤用于运动、舞蹈或动作描写）"},"examples":[{"en":"He’s dextropedal, so he usually kicks with his right foot.","zh":"他是右脚为主的人，所以通常用右脚踢球。"},{"en":"The coach asked the dextropedal players to practice using their left foot, too.","zh":"教练让习惯用右脚的队员也练习一下左脚。"}]}],"synonyms":["right-footed","right-foot-dominant"],"phonetic":"ˌdɛkstroʊˈpiːdəl","extraExplanation":["词源上可拆成 dextro-（表示“右”，源自拉丁语 dexter）+ pedal（脚）。这个词比较少见，更常见的说法是 right-footed（右脚型/惯用右脚）。"]}
{"word":"dextropinene","summary":{"en":"Dextropinene is a dextrorotatory (right‑handed) form of pinene, a terpene found in pine resins and essential oils.","zh":"Dextropinene 指右旋蒎烯：一种具有右旋光性的蒎烯异构体，存在于松树树脂与多种精油中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A right‑handed (dextrorotatory) form of pinene, a natural terpene found in pine resins and many essential oils; it is used in fragrances and as an industrial chemical (for example, in turpentine-related products).","zh":"右旋蒎烯（具有右旋光性的蒎烯异构体），属于天然萜烯，常见于松树树脂及多种精油中；用于香精香料，也可作为工业化学原料（例如与松节油相关的产品）。"},"examples":[{"en":"Some pine essential oils contain dextropinene, which contributes to their fresh, resinous smell.","zh":"某些松树精油含有右旋蒎烯，这会带来清新、树脂感的气味。"},{"en":"In the lab, dextropinene can be discussed as one stereoisomer of pinene.","zh":"在实验室里，右旋蒎烯常被用来说明蒎烯的一种立体异构体。"}]}],"synonyms":["(+)-pinene","dextrorotatory pinene"],"phonetic":"/ˌdɛkstroʊˈpaɪniːn/","extraExplanation":["“dextro-”表示“右旋/使偏振光向右旋转”，而“pinene（蒎烯）”是一类常见的松香气味来源分子。许多精油成分会有不同“镜像”异构体（立体异构体），它们气味与性质可能略有差别。","在实际英文资料中，你更常见到的写法是“(+)-pinene”或更具体的“(+)-α-pinene / (+)-β-pinene”。“dextropinene”相对少见，可能出现在旧文献、配方表或非严格命名中。"]}
{"word":"dextrorotary","summary":{"en":"Dextrorotary means rotating to the right, especially rotating polarized light clockwise.","zh":"dextrorotary 指“向右（顺时针）旋转的”，尤指“右旋光学活性”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Turning or rotating to the right (clockwise), especially describing a substance that rotates plane-polarized light to the right.","zh":"向右（顺时针）旋转的；尤指能使偏振光的振动平面向右旋转的（右旋的）物质。"},"examples":[{"en":"Some sugars are dextrorotary, meaning they rotate polarized light to the right.","zh":"一些糖类是右旋的，也就是说它们会使偏振光向右旋转。"},{"en":"The lab report identified the sample as dextrorotary based on its optical rotation.","zh":"实验报告根据其旋光度判定该样品为右旋。"}]}],"synonyms":["dextrorotatory","dextrogyre","right-rotating"],"phonetic":"/ˌdɛkstroʊˈroʊtəri/","extraExplanation":["在化学/生物化学里，dextrorotary 常和符号“(+)”一起出现，表示“旋光方向为右旋”。注意：右旋（dextrorotary, +）不一定等同于分子构型的 D（D/L）或 R/S；它们是不同的标记体系。","更常见的拼写是 dextrorotatory；dextrorotary 属于较少见但可用的变体。"]}
{"word":"dextrorotatary","summary":{"en":"“dextrorotatary” is a misspelling of “dextrorotatory,” meaning it rotates polarized light to the right.","zh":"“dextrorotatary”是“dextrorotatory”的误拼，意思是能使偏振光向右旋转（右旋）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Common misspelling) of “dextrorotatory”: describing a substance that rotates plane-polarized light to the right (clockwise) when viewed facing the oncoming light.","zh":"（常见拼写错误）“dextrorotatory”的误拼：指某种物质能使平面偏振光的偏振面向右（顺时针）旋转（从迎着光线的方向观察）。"},"examples":[{"en":"The label should read “dextrorotatory,” not “dextrorotatary.”","zh":"标签应写“dextrorotatory”，而不是“dextrorotatary”。"},{"en":"This sugar solution is dextrorotatory, so it rotates polarized light to the right.","zh":"这种糖溶液是右旋的，因此会使偏振光向右旋转。"}]}],"synonyms":["dextrorotatory","right-rotating (in optics)","optically positive"],"phonetic":"/ˌdɛkstroʊˈroʊtətɔri/","extraExplanation":["“dextro-”来自拉丁语，意思是“右”。在化学/生化里常用来描述“旋光性”（optical activity）。需要注意：dextrorotatory（右旋，记作“+”或“d”）与D/L构型不是同一概念；D/L指分子构型（相对于甘油醛），而+/-指实际测得的旋光方向。"]}
{"word":"dextrorotation","summary":{"en":"Dextrorotation is the clockwise (right) rotation of plane-polarized light caused by an optically active substance.","zh":"Dextrorotation 指具有旋光性的物质使平面偏振光产生顺时针（向右）旋转的现象/性质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry/physics) The clockwise rotation of plane-polarized light when it passes through an optically active substance; also used to describe the property of being dextrorotatory.","zh":"（化学/物理）当平面偏振光通过具有旋光性的物质时，偏振面向顺时针方向旋转的现象；也可指“右旋（顺时针旋光）”这一性质。"},"examples":[{"en":"This sugar solution shows dextrorotation, so it rotates polarized light to the right.","zh":"这种糖溶液表现出右旋（顺时针旋光），因此会使偏振光向右旋转。"},{"en":"The lab report recorded the sample’s dextrorotation as +12° at 20°C.","zh":"实验报告记录该样品在 20°C 时的右旋角为 +12°。"}]}],"synonyms":["positive optical rotation","right-handed optical rotation"],"phonetic":"/ˌdɛkstroʊroʊˈteɪʃən/","extraExplanation":["在化学里，常用符号“+”表示右旋（dextrorotation），用“−”表示左旋（levorotation）。这里的“向右/顺时针”通常是指观察者面对光源时看到的旋转方向。","“右旋/左旋（+ / −）”与分子的构型（如 R/S）不一定直接对应：同为 R 构型的化合物也可能是左旋，反之亦然。"]}
{"word":"dextrorotatory","summary":{"en":"Dextrorotatory describes a substance that rotates polarized light to the right (clockwise).","zh":"dextrorotatory 指物质使偏振光向右（顺时针）旋转，即“右旋”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) rotating the plane of polarized light to the right (clockwise) when viewed toward the light source; said of an optically active substance.","zh":"（化学）使偏振光的振动平面向右（顺时针）旋转的；用于描述具有旋光性的物质。"},"examples":[{"en":"A sucrose solution is dextrorotatory under polarized light.","zh":"蔗糖溶液在偏振光下表现为右旋（dextrorotatory）。"},{"en":"The chemist measured the compound’s optical rotation and found it was dextrorotatory.","zh":"化学家测量该化合物的旋光度，发现它是右旋的。"}]}],"synonyms":["right-rotating","(+)-rotatory","dextrorotary"],"phonetic":"/ˌdɛkstroʊˈroʊtəˌtɔri/","extraExplanation":["“dextro-”来自拉丁语，意为“右”。“rotatory”表示“旋转的”。合起来就是“向右旋转的（右旋的）”。","在化学里，右旋/左旋描述的是“对偏振光的影响”（用+或−、或d/l来标记），不等同于分子构型标记的D/L（例如糖类的Fischer投影），也不必然对应R/S绝对构型；三者是不同体系，不能直接互推。","判断右旋通常用旋光仪测“旋光度（optical rotation）”。在文献中也常写作“(+)-”表示右旋。"]}
{"word":"dextrorsal","summary":{"en":"Dextrorsal means “twisting or spiraling to the right,” used mainly in biological descriptions.","zh":"dextrorsal 指“向右扭转或呈右旋螺旋”，多用于生物学形态描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany, zoology) Twisting, coiling, or spiraling to the right; right-handed (clockwise when viewed from a given reference point).","zh":"（植物学/动物学）向右扭转、盘绕或呈右旋的；右手性的（在特定观察角度下呈顺时针）。"},"examples":[{"en":"The vine shows a dextrorsal twist as it climbs the pole.","zh":"这株藤蔓沿着柱子向上攀爬时呈右旋缠绕。"},{"en":"In descriptions of shells, “dextrorsal” indicates a right-handed spiral.","zh":"在对贝壳的描述中，“dextrorsal”表示右旋螺旋。"}]}],"synonyms":["right-handed","clockwise","dextral"],"phonetic":"/ˌdɛkstrəˈrɔrsəl/","extraExplanation":["词源提示：dextr- 来自拉丁语 dexter（“右边/右手”），-orsal 与 “转向/扭转” 的概念相关。常见于较正式的生物学形态描述。","理解技巧：右旋/左旋有时会因“从哪一端看”而不同，所以学术写作通常会说明观察方向（例如从顶端看、从壳尖看等）。"]}
{"word":"dextrorse","summary":{"en":"Dextrorse describes something that spirals or twists to the right (clockwise), especially in botanical descriptions of plant growth.","zh":"dextrorse 指向右（顺时针）旋转或扭转的状态，常用于描述植物的缠绕生长方式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Especially in botany) twisting or spiraling to the right; turning in a clockwise direction when viewed from the observer’s perspective.","zh":"（尤用于植物学）向右扭转或呈右旋；从观察者角度看为顺时针方向的螺旋。"},"examples":[{"en":"The vine shows dextrorse twining as it climbs the pole.","zh":"这株藤本沿着杆子向右旋缠绕向上生长。"},{"en":"In this species, the stem is usually dextrorse rather than sinistrorse.","zh":"在这个物种中，茎通常是右旋，而不是左旋。"}]}],"synonyms":["right-handed","clockwise (in this sense)","dextral"],"phonetic":"/ˈdɛkstrɔrs/","extraExplanation":["词源上来自拉丁语 dexter（右边）+ -orse（表示“转向/朝向”），常与 sinistrorse（左旋）成对出现。","在植物描述里，“右旋/顺时针”通常指你正对着植物、沿着生长方向观察时看到的旋转方向；不同资料可能会说明观察视角，以避免混淆。"]}
{"word":"dextrorsely","summary":{"en":"Dextrorsely means ‘to the right’—especially twisting or spiraling clockwise (right-handed).","zh":"dextrorsely 指“向右”，尤指以右旋/顺时针方向扭转或呈螺旋状。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a rightward (clockwise) direction; twisting or spiraling to the right.","zh":"向右（顺时针）方向；向右扭转或呈右旋螺旋状。"},"examples":[{"en":"The vine grew dextrorsely around the support.","zh":"这株藤蔓以右旋（顺时针）方向缠绕着支架生长。"},{"en":"The shell’s ridges spiral dextrorsely from the center.","zh":"贝壳的棱纹从中心向外呈右旋螺旋延伸。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Less common, technical) On or toward the right side.","zh":"（较少见，技术用法）在右侧或朝向右侧。"},"examples":[{"en":"The fibers shift dextrorsely as the tension increases.","zh":"随着张力增加，纤维向右侧发生偏移。"}]}],"synonyms":["clockwise","rightward","to the right"],"phonetic":"/ˌdɛkstrɔrˈsiːli/","extraExplanation":["这个词多见于植物学、动物学、解剖学等描述“螺旋/扭转方向”的语境。与之相对的词是 *sinistrorsely*（向左、逆时针、左旋）。","词源来自拉丁语 *dexter*（右边）+ *-orsely*（表示方向的构词成分）。在日常英语里更常用 *clockwise*（顺时针）或 *to the right*（向右）来表达。"]}
{"word":"dextrosazone","summary":{"en":"“Dextrosazone” is not a commonly recognized English word; it’s likely a misspelling or a specialized name.","zh":"“dextrosazone”不是常见英文词，可能是拼写错误或某种专业名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a misspelling, a brand/product name, or a highly specialized chemical/drug name that is not widely listed in general dictionaries.","zh":"不是标准英文词；可能是拼写错误、品牌/产品名，或非常专业的化学品/药物名称，一般词典中不常见。"},"examples":[{"en":"I can’t find “dextrosazone” in major English dictionaries—could you check the spelling or share the context (medicine label, article, etc.)?","zh":"在主要英文词典里我找不到“dextrosazone”——你能检查一下拼写，或提供出现的语境（药品标签、文章等）吗？"},{"en":"It might be a proprietary (brand) name rather than a common vocabulary word.","zh":"它也可能是专有（品牌）名称，而不是常见词汇。"}]}],"phonetic":"ˌdɛkstroʊsəˈzoʊn","extraExplanation":["从构词上看，dextro- 常见于医学/化学词里，表示“右旋的、右侧的”（如 dextrose 与右旋糖相关；dextroamphetamine 与右旋安非他明相关）。但 “-sazone” 并不是常见的英语词尾，因此更像是：①拼写误差；②某些地区的商品名/音译名；③非常专门的化学命名。","如果你把它出现的整句话、图片（标签/说明书）、或你想表达的中文意思发来，我可以帮你：对照可能的正确拼法、解释真实含义，并给出更准确的发音与用法。"]}
{"word":"dextrose","summary":{"en":"Dextrose is another name for glucose, used especially in medicine and food products.","zh":"Dextrose 是葡萄糖的另一种说法，常见于医疗与食品产品中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of sugar that is the same as glucose; often used in medical fluids and as a food ingredient","zh":"一种糖，等同于葡萄糖；常用于医疗输液以及食品配料"},"examples":[{"en":"The patient was given dextrose through an IV to raise her blood sugar.","zh":"病人通过静脉输注葡萄糖（dextrose）来提高血糖。"},{"en":"This sports drink contains dextrose for quick energy.","zh":"这款运动饮料含有葡萄糖（dextrose），能快速补充能量。"},{"en":"In some recipes, dextrose is used to control sweetness and texture.","zh":"在一些食谱中，会用葡萄糖（dextrose）来控制甜度和口感。"}]}],"synonyms":["glucose","corn sugar"],"phonetic":"/ˈdɛkstroʊs/","extraExplanation":["“Dextrose”常见于配料表与医疗场景。食品工业里它往往指由淀粉水解得到的葡萄糖（也叫glucose、corn sugar），用于提供甜味、帮助发酵或改善质地。","在医学上，含有dextrose的溶液（如D5W：5% dextrose in water）常用于补液或纠正低血糖；日常对话里更常说“glucose（葡萄糖）”。"]}
{"word":"dextroses","summary":{"en":"“Dextroses” means multiple instances/amounts of dextrose (a form of glucose), commonly mentioned in ingredients and medical contexts.","zh":"“Dextroses”指多种/多份葡萄糖（dextrose，一种葡萄糖形式），常见于配料表和医疗语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of dextrose: simple sugars (a form of glucose) used by the body for energy; often seen in food and medical products.","zh":"dextrose 的复数：一种简单糖（葡萄糖的一种形式），人体用来提供能量；常见于食品与医疗用品中。"},"examples":[{"en":"The label lists dextroses as a source of quick carbohydrates.","zh":"标签上写着含有 dextroses，作为快速碳水来源。"},{"en":"In the hospital, dextroses may be included in IV fluids to raise blood sugar.","zh":"在医院里，静脉输液中可能会加入 dextroses 来提高血糖。"}]}],"synonyms":["glucose","blood sugar (informal)","dextrose sugars (contextual)"],"phonetic":"/ˈdɛkstroʊsiz/","extraExplanation":["“Dextrose”通常指右旋葡萄糖（化学上与葡萄糖相关），在日常语境里经常就等同于“葡萄糖”。食品里它常用作甜味剂或帮助发酵；医疗上常见于“dextrose solution（葡萄糖溶液）/D5W（5%葡萄糖注射液）”。","拼写上你输入的是复数“dextroses”。在成分表里也可能出现单数“dextrose”，两者都很常见。"]}
{"word":"dextrosinistral","summary":{"en":"Dextrosinistral describes something that spirals or twists both to the right and to the left.","zh":"dextrosinistral 指同时（或交替）呈现右旋与左旋的螺旋/扭转特征。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Spiraling or twisting in both directions—right-handed (clockwise) and left-handed (counterclockwise), often alternately or in combination.","zh":"（螺旋或扭转）同时具有右旋（顺时针）与左旋（逆时针）特征的；可指交替或并存的右旋与左旋。"},"examples":[{"en":"Some climbing plants show a dextrosinistral pattern, with different stems twisting in opposite directions.","zh":"有些攀缘植物呈现右左旋并存的模式，不同茎会向相反方向缠绕。"},{"en":"The researcher described the structure as dextrosinistral because it contained both right- and left-handed helices.","zh":"研究者将该结构描述为右左旋的，因为它同时包含右旋与左旋的螺旋。"}]}],"synonyms":["bidirectional","right- and left-handed","both-handed","ambidextrous (figurative)"],"phonetic":"/ˌdɛkstroʊsɪˈnɪstrəl/","extraExplanation":["这是一个很少见、偏技术性的词，常出现在生物学（如植物缠绕方向）、形态学或讨论“螺旋/手性（chirality）”的语境中。","词源可拆成 dextro-（“右”，来自拉丁语 dexter）与 sinistral（“左”，来自拉丁语 sinister）。在英语里 sinister 另有“阴险的”常用义，但在科学语境里主要就是“左侧/左旋”。"]}
{"word":"dextrosinistrally","summary":{"en":"Dextrosinistrally means “alternating or involving movement to the right and to the left.”","zh":"dextrosinistrally 表示“向右与向左交替（或同时涉及左右方向）的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a manner that alternates or involves movement to the right and to the left (clockwise and counterclockwise); rightward and leftward","zh":"以右、左交替（或同时涉及右向与左向）的方式；向右又向左（可理解为顺时针与逆时针交替/兼有）"},"examples":[{"en":"The dancer turned dextrosinistrally, switching directions with the rhythm.","zh":"舞者随着节奏右左交替地旋转，方向不断切换。"},{"en":"The pattern spirals dextrosinistrally, twisting first to the right and then to the left.","zh":"这个图案右左交替地呈螺旋状扭转，先向右再向左。"}]}],"synonyms":["alternately","to the right and left","clockwise and counterclockwise"],"phonetic":"/ˌdɛkstroʊsɪˈnɪstrəli/","extraExplanation":["这个词非常少见，主要出现在较“书面/学术”或描述性很强的语境中（例如生物学、解剖学、结晶/纹理描述，或文学性描写）。日常英语里通常会说 “alternating left and right / to the right and left / clockwise and counterclockwise”。","构词上由 dextro-（右，源自拉丁语 dexter）+ sinistral（左，源自拉丁语 sinister）+ -ly（副词后缀）组成。注意：sinister 在现代英语里常有“阴险的”含义，但在拉丁来源的术语里也可仅表示“左侧/左向”。"]}
{"word":"dextrosuria","summary":{"en":"Dextrosuria means glucose (dextrose) is found in the urine.","zh":"Dextrosuria 指尿液中检测到葡萄糖（尿糖）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a condition in which glucose (dextrose) is present in the urine; also called glycosuria","zh":"尿中出现葡萄糖（右旋糖）的情况；也称“糖尿 / 尿糖”（glycosuria）"},"examples":[{"en":"The doctor found dextrosuria during a routine urine test.","zh":"医生在常规尿检中发现了尿糖（dextrosuria）。"},{"en":"Dextrosuria can be a sign of diabetes, but it may also happen temporarily after a very sugary meal.","zh":"尿糖可能是糖尿病的信号，但也可能在吃了大量甜食后短暂出现。"}]}],"synonyms":["glycosuria","glucosuria"],"phonetic":"/ˌdɛkstroʊˈsjʊriə/","extraExplanation":["词源上，dextrose 指“葡萄糖”，-uria 表示“尿中出现某物”（如 hematuria 血尿）。因此 dextrosuria 字面意思就是“尿中有葡萄糖”。","在医学语境里更常用的词是 glycosuria（尿糖）。是否需要进一步检查，通常要结合血糖、糖化血红蛋白（HbA1c）、以及是否有多尿、口渴、体重下降等症状，由医生判断。"]}
{"word":"dextrotartaric","summary":{"en":"Dextrotartaric means the right‑rotating (dextrorotatory) form of tartaric acid or its salts.","zh":"dextrotartaric 指酒石酸（或其盐）的右旋（右转偏振光）形式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Describing the form of tartaric acid (or its salts) that rotates plane‑polarized light to the right; the dextrorotatory (D-) isomer of tartaric acid.","zh":"（化学）指酒石酸（或其盐）中使偏振光向右旋转的那一种形式；即右旋（D-）酒石酸异构体。"},"examples":[{"en":"Dextrotartaric acid is one of the stereoisomers of tartaric acid.","zh":"右旋酒石酸是酒石酸的一种立体异构体。"},{"en":"The sample was identified as dextrotartaric based on its positive optical rotation.","zh":"该样品因呈正的旋光度而被鉴定为右旋酒石酸。"}]}],"synonyms":["dextrorotatory tartaric","D-(+)-tartaric","(+)-tartaric"],"phonetic":"/ˌdɛkstroʊtɑrˈtɛrɪk/","extraExplanation":["“dextro-”表示“向右/右旋”，来自拉丁语 dexter（右边）；“tartaric”与酒石酸有关。该词多见于有机化学、分析化学与立体化学语境，用于区分互为镜像的对映体（右旋/左旋）。"]}
{"word":"dextrotropic","summary":{"en":"Dextrotropic means “right-rotating” in optics: it turns polarized light clockwise (positive rotation).","zh":"dextrotropic 指“右旋（正旋光）”：能使偏振光顺时针旋转。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Rotating the plane of polarized light to the right (clockwise) when viewed toward the light source; describing a substance with a positive optical rotation (+).","zh":"（化学）使偏振光的偏振面向右（顺时针）旋转；形容具有正旋光性（+）的物质。"},"examples":[{"en":"This sugar solution is dextrotropic, so it rotates polarized light clockwise.","zh":"这种糖溶液是右旋的，因此会使偏振光顺时针旋转。"},{"en":"A polarimeter can show whether a compound is dextrotropic or levorotatory.","zh":"旋光仪可以显示一种化合物是右旋还是左旋。"}]}],"synonyms":["dextrorotatory","(+) optically active","right-rotating"],"phonetic":"/ˌdɛkstroʊˈtrɑpɪk/","extraExplanation":["“dextrotropic”在现代英语里相对少见，更常见的术语是“dextrorotatory（右旋的）”或“(+) optical rotation（正旋光）”。","注意区分“D/L构型”和“+/−旋光方向”：D或L描述分子构型（相对甘油醛的构型），而+/−（右旋/左旋）描述实验测得的旋光方向，两者不一定一致。"]}
{"word":"dextrotropous","summary":{"en":"A botanical adjective meaning ‘right-turning/right-coiling,’ especially for vines that twine clockwise when viewed from above.","zh":"植物学形容词，指“向右转/向右缠绕”，常用于描述从上方看顺时针缠绕的藤本植物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"In botany, describing a plant organ (especially a twining stem or tendril) that grows or coils to the right—i.e., in a clockwise direction when viewed from above.","zh":"（植物学）形容植物器官（尤指缠绕茎或卷须）向右生长或缠绕；从上方看呈顺时针方向。"},"examples":[{"en":"Many twining vines show a consistent direction of coiling; this species is dextrotropous.","zh":"许多缠绕藤本的缠绕方向很固定；这个物种是向右缠绕（顺时针）的。"},{"en":"The dextrotropous stem wraps around the support as it climbs.","zh":"这种向右缠绕的茎在攀爬时会绕着支撑物盘旋上升。"}]}],"synonyms":["right-twining","clockwise-twining","dextral (in context)"],"phonetic":"/ˌdɛkstroʊˈtroʊpəs/","extraExplanation":["词源提示：dextro- 来自拉丁语 dexter（右边），-tropous 与 “turning/转向” 有关，整体意思就是“向右转/向右缠绕”。","使用场景：该词多见于植物形态与攀缘方式的学术描述；日常英语里更常用 “clockwise-twining（顺时针缠绕的）” 来表达。"]}
{"word":"dextrous","summary":{"en":"Dextrous means skillful with the hands, often able to use both hands well.","zh":"dextrous 指手很灵巧、操作熟练，常含“双手都很灵活”的意思。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to use your hands skillfully, especially both hands equally well.","zh":"手很灵巧的；（尤指）双手同样灵活的。"},"examples":[{"en":"She’s dextrous with a needle and can fix clothes quickly.","zh":"她针线活很灵巧，能很快把衣服补好。"},{"en":"A dextrous chef chops vegetables fast and safely.","zh":"手法灵巧的厨师切菜又快又安全。"},{"en":"He’s dextrous with both hands, so he can write and throw with either one.","zh":"他双手都很灵活，所以用哪只手写字、投掷都行。"}]}],"synonyms":["dexterous","skillful","nimble","adept","handy"],"phonetic":"/ˈdɛkstrəs/","extraExplanation":["“dextrous”常和“手工技巧”相关（如缝纫、弹乐器、外科手术、魔术、游戏操作等）。它偏正式一些，日常口语里常用“skillful”或“good with your hands”。","相关词源小知识：它和拉丁语里表示“右边/右手”的词有关，因此也常让人联想到“右撇子”。不过现代英语中它主要强调“灵巧/熟练”，不一定和左右手偏好有关。","易混：dextrous（英式拼写）= dexterous（美式更常见拼写）。本词义相同。"]}
{"word":"dextrously","summary":{"en":"Dextrously means doing something with skill and control, often with your hands, and sometimes in a socially “clever” way.","zh":"dextrously 表示“灵巧熟练地（多指用手）”，也可引申为“巧妙圆滑地处理（局面/谈话）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a skillful, quick, and controlled way, especially using your hands.","zh":"（尤指用手）灵巧而熟练地；动作敏捷且控制得当。"},"examples":[{"en":"The surgeon moved dextrously, making tiny cuts with steady hands.","zh":"外科医生动作灵巧，手很稳地做出细小的切口。"},{"en":"She dextrously threaded the needle even in low light.","zh":"即使光线很暗，她也能熟练地把线穿进针眼。"},{"en":"He dextrously juggled the conversation, changing topics to avoid conflict.","zh":"他巧妙地周旋于谈话中，转换话题来避免冲突。"}]}],"synonyms":["skillfully","deftly","adroitly","nimbly"],"phonetic":"/ˈdɛkstrəsli/","extraExplanation":["词源上与拉丁语 dexter（“右边的”）有关，因此 dexterous 原意带有“右手更灵活”的文化背景；后来引申为“灵巧、熟练”。现代英语里多用来形容手部技能，也可比喻“处理局面/谈判很圆滑”。","常见搭配：dextrously maneuver（灵活地操控/周旋）、dextrously handle（熟练地处理）、dextrously carve/cut/stitch（熟练地雕刻/切割/缝合）。"]}
{"word":"dextrousness","summary":{"en":"Dextrousness means skillful, precise ability—especially with your hands—and can also mean clever, tactful handling of situations.","zh":"dextrousness 指（尤指手部）动作熟练灵巧，也可引申为处理事情的机智与手腕。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Skill and ease in using your hands or body, especially for careful, precise actions.","zh":"手脚灵活；（尤指）动作熟练、灵巧，常用于需要精细操作的动作。"},"examples":[{"en":"Her dextrousness with chopsticks impressed everyone at the table.","zh":"她用筷子的灵巧程度让同桌的人都很佩服。"},{"en":"Surgery requires dextrousness as well as deep medical knowledge.","zh":"外科手术不仅需要深厚的医学知识，也需要高度的手部灵巧。"}]},{"partOfSpeech":"n.","definition":{"en":"The ability to handle tasks, tools, or difficult situations in a smart, effective way (often implying tact).","zh":"（引申）处事圆滑而有效的能力；能巧妙应对复杂任务或局面（常含“机智、手腕”之意）。"},"examples":[{"en":"The manager showed dextrousness in resolving the conflict without blaming anyone.","zh":"经理在不责怪任何人的情况下化解冲突，展现了高超的处事手腕。"},{"en":"With political dextrousness, she built support from different groups.","zh":"凭借政治上的灵活手腕，她赢得了不同团体的支持。"}]}],"synonyms":["dexterity","nimbleness","adroitness","skillfulness","facility"],"phonetic":"/ˈdɛkstrəsnəs/","extraExplanation":["“dextrousness”来自形容词“dextrous”（灵巧的）+ 名词后缀“-ness”（表示“性质/状态”）。","词根“dextr-”与拉丁语“dexter”（右边的）有关；在许多文化传统里，“右手/右侧”常被联想为熟练、吉利，因此“dextrous”逐渐发展出“灵巧”的含义。对应地，“ambidextrous”指“两手都很灵巧/左右开弓”。","日常口语里更常用“dexterity”（灵巧；熟练）来表达相近意思；“dextrousness”更偏书面、强调“灵巧这一特质”。"]}
{"word":"dextroversion","summary":{"en":"Dextroversion means right-handedness—the tendency to use the right hand more.","zh":"dextroversion 指“右利手/偏用右手”的倾向。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A preference for using the right hand more skillfully than the left; right-handedness.","zh":"更偏好并更擅长使用右手的倾向；右利手。"},"examples":[{"en":"Dextroversion is the most common hand preference worldwide.","zh":"右利手是全球最常见的用手偏好。"},{"en":"The study compared dextroversion and left-handedness in schoolchildren.","zh":"这项研究比较了学龄儿童中的右利手与左利手。"}]}],"synonyms":["right-handedness","dextral preference"],"phonetic":"/ˌdɛkstroʊˈvɝʒən/","extraExplanation":["“dextro-”来自拉丁语 dexter（右边的、右手的），常用于表示“右侧/右手”的词，如 dextrose（右旋糖/葡萄糖的一种形式）、dexterity（灵巧）。","在医学或心理学研究中，你可能会看到与之相对的词：sinistroversion（左利手倾向，不过不如 dextroversion 常用）、ambidexterity（双手都灵活/双利手）。"]}
{"word":"dexy","summary":{"en":"“Dexy” is mainly slang for a dexamphetamine pill (a prescription stimulant), especially in Australia/UK.","zh":"“dexy”主要是俚语，指右旋安非他命这类处方兴奋剂的一片/一粒（澳洲/英国口语更常见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang) A tablet/capsule of dexamphetamine (or sometimes dextroamphetamine), a prescription stimulant; used especially in Australian and British informal speech.","zh":"（俚语）右旋安非他命（dexamphetamine／有时指 dextroamphetamine）这种处方兴奋剂的一片/一粒；多见于澳大利亚和英国的口语。"},"examples":[{"en":"He said he took a dexy to stay awake and study all night.","zh":"他说他为了熬夜学习吃了一粒 dexy。"},{"en":"Don’t buy dexies from strangers—there’s no way to know what you’re getting.","zh":"别从陌生人那里买 dexies——你根本不知道拿到的是什么。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal, rare) Right-handed or relating to the right side; “dex-” comes from Latin for “right.”","zh":"（非正式，较少见）右手的；与右侧有关的；“dex-”源自拉丁语，意为“右”。"},"examples":[{"en":"In fencing notes, some people jokingly call a right-handed stance “dexy.”","zh":"在一些击剑笔记里，有人开玩笑把右手站姿叫“dexy”。"}]}],"synonyms":["dexamphetamine","dextroamphetamine","Dexedrine (brand)","stimulant (general)"],"phonetic":"/ˈdɛksi/","extraExplanation":["“dexy/dexies”常出现在非正式对话或网络用语里，指兴奋剂类处方药（如 dexamphetamine）。它也可能被非医疗目的滥用；在很多地区，未经处方持有或交易属于违法。学习这个词时建议把它当作“识别俚语/避免误解”的词汇，而不是日常可随意使用的表达。"]}
