{"word":"Dezaley","summary":{"en":"Dézaley is a prestigious Swiss wine appellation in Lavaux (Vaud), also referring to the wines made there, especially Chasselas white wine.","zh":"Dézaley（德扎莱）是瑞士拉沃地区著名葡萄酒产区名，也可指该地产的葡萄酒，尤以 Chasselas 白葡萄酒知名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a famous terraced wine-growing area (appellation) in the Lavaux region of Vaud, Switzerland, known especially for white wine made from the Chasselas grape; it can also refer to wines from this area.","zh":"瑞士沃州（Vaud）拉沃（Lavaux）地区著名的葡萄酒产区（法定产区/原产地命名），以梯田葡萄园和霞多丽……（此处主要指 Chasselas 夏斯拉/莎斯拉）白葡萄酒闻名；也可指产自该地的葡萄酒。"},"examples":[{"en":"We brought home a bottle of Dézaley to remember our trip to Lake Geneva.","zh":"我们带回一瓶德扎莱（Dézaley）葡萄酒，用来纪念日内瓦湖之行。"},{"en":"The restaurant’s wine list features a crisp Dézaley Chasselas.","zh":"这家餐厅的酒单上有一款清爽的德扎莱（Dézaley）夏斯拉白葡萄酒。"},{"en":"Dézaley vineyards cling to steep terraces above the lake.","zh":"德扎莱（Dézaley）的葡萄园依附在湖畔上方陡峭的梯田上。"}]}],"synonyms":["Lavaux","Vaud wine","Swiss white wine (Chasselas)"],"phonetic":"/ˌdeɪzəˈleɪ/","extraExplanation":["“Dézaley”常被视为瑞士法语区的地名/产区名，书写时常见重音符号：Dézaley。它属于拉沃（Lavaux）葡萄园梯田带的一部分，该梯田景观被列入联合国教科文组织世界遗产。","在英语语境里，人们多在点酒、旅行或美食写作中提到它；最常与“Chasselas（夏斯拉）”搭配，用来指该产区经典的白葡萄酒风格。"]}
{"word":"dezaley","summary":{"en":"Dézaley is a prestigious Swiss wine appellation in Lavaux (Vaud), and also the white wine made there, usually from the Chasselas grape.","zh":"Dézaley 指瑞士沃州拉沃地区的知名法定产区，也可指该产区出产的白葡萄酒，通常以夏斯拉（Chasselas）葡萄为主。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a famous Swiss wine appellation (AOC) in the Lavaux area of the canton of Vaud, known especially for white wine made from the Chasselas grape","zh":"瑞士著名的葡萄酒法定产区（AOC），位于沃州（Vaud）的拉沃（Lavaux）地区，尤以霞多丽（Chasselas，常译“夏斯拉”）葡萄酿造的白葡萄酒闻名"},"examples":[{"en":"We tried a bottle of Dézaley with fondue, and it paired beautifully.","zh":"我们用一瓶德扎莱（Dézaley）配奶酪火锅，搭配得非常好。"},{"en":"Dézaley wines are often described as mineral and structured.","zh":"德扎莱葡萄酒常被形容为有矿物感、结构感强。"}]},{"partOfSpeech":"n.","definition":{"en":"a white wine produced in that Dézaley appellation","zh":"指产自德扎莱（Dézaley）法定产区的白葡萄酒"},"examples":[{"en":"This Dézaley has a subtle honey note and a long finish.","zh":"这款德扎莱带有淡淡的蜂蜜香气，余味很长。"},{"en":"At the restaurant, Dézaley was listed under Swiss whites.","zh":"在餐厅酒单上，德扎莱被列在瑞士白葡萄酒一栏。"}]}],"synonyms":["Lavaux (related region)","Swiss AOC (category)","Chasselas (common grape)"],"phonetic":"/ˌdeɪzəˈleɪ/","extraExplanation":["Dézaley 常写作 Dézaley（带重音符号），属于瑞士沃州拉沃（Lavaux）梯田葡萄园的一部分；拉沃葡萄园因其历史景观价值被列入联合国教科文组织世界遗产。","这里的葡萄园多在陡峭坡面上，面向日内瓦湖。当地人常说这里的葡萄受益于“三个太阳”：天空的阳光、湖面的反射光、以及石墙储热再释放的热量。","在文化语境里，Dézaley 往往代表“传统瑞士白葡萄酒”的经典产地之一；最常见的品种是 Chasselas（夏斯拉），风格通常清爽、带矿物感，适合配奶酪、湖鱼等瑞士料理。"]}
{"word":"Dezful","summary":{"en":"Dezful is a city in southwestern Iran (Khuzestan Province).","zh":"Dezful（德兹富勒）是伊朗西南部胡齐斯坦省的一座城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a city in southwestern Iran, in Khuzestan Province, known for its historic brick bridge over the Dez River and its hot climate.","zh":"伊朗西南部胡齐斯坦省的一座城市，因横跨德兹河的古老砖桥及炎热气候而闻名。"},"examples":[{"en":"Dezful is one of the major cities in Iran’s Khuzestan Province.","zh":"德兹富勒是伊朗胡齐斯坦省的重要城市之一。"},{"en":"The ancient bridge in Dezful is a famous landmark over the Dez River.","zh":"德兹富勒的古桥是德兹河上的著名地标。"}]}],"phonetic":"/ˈdɛz.fʊl/","extraExplanation":["“Dezful”是专有名词，常用于地理与新闻语境；英文中通常不加冠词（不说 *the Dezful*），但可以说 *the city of Dezful*（德兹富勒市）。","德兹富勒以“德兹富勒古桥”（Dezful Bridge）较为知名，相传最早可追溯至萨珊时期；当地也以传统砖建筑与炎热夏季气候给人印象深刻。"]}
{"word":"Dezhnev","summary":{"en":"Dezhnev is a Russian explorer’s name and also appears in related place names (e.g., Cape Dezhnev).","zh":"Dezhnev 指俄罗斯探险家德日涅夫的名字，也常见于相关地名（如德日涅夫角）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Semyon (Semen) Dezhnev: a 17th-century Russian explorer best known for sailing around the far northeast of Asia and proving that Asia and North America are separated by sea (near today’s Bering Strait).","zh":"德日涅夫（谢苗恩/谢苗·德日涅夫）：17世纪的俄罗斯探险家，以绕过亚洲东北极地海岸航行、证明亚洲与北美之间由海洋分隔（接近今天的白令海峡）而闻名。"},"examples":[{"en":"Dezhnev’s voyage is often mentioned as an early journey through the waters near the Bering Strait.","zh":"德日涅夫的航行常被提到是早期穿越白令海峡附近海域的旅程之一。"},{"en":"Some history books compare Dezhnev with later explorers who mapped the Arctic coastline.","zh":"一些历史书会把德日涅夫与后来绘制北极海岸线的探险家作比较。"}]},{"partOfSpeech":"n.","definition":{"en":"(in geography) Used in place names connected to Dezhnev, such as Cape Dezhnev (the easternmost point of mainland Asia).","zh":"（地理）用于与德日涅夫相关的地名，如德日涅夫角（亚洲大陆最东端）。"},"examples":[{"en":"Cape Dezhnev lies across the water from Alaska.","zh":"德日涅夫角隔海与阿拉斯加相望。"}]}],"phonetic":"/ˈdɛʒnɛv/","extraExplanation":["在英语里，Dezhnev 常见于历史或地理语境，属于专有名词（人名/地名）。拼写可能也会见到 Semen Dezhnev、Semyon Dezhnev 等不同转写。","德日涅夫的航行发生在 1648 年左右，但他的成就长期不如白令（Bering）广为人知；后来史料整理后，才更常在英语资料中被提及。"]}
{"word":"dezinc","summary":{"en":"Dezinc means to remove zinc (or to lose zinc through corrosion), especially in metals like brass or in galvanized coatings.","zh":"Dezinc 指去除锌，或（因腐蚀而）失去锌，常见于黄铜或镀锌层相关语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove zinc from something (especially from a metal alloy or from a galvanized coating)","zh":"去锌；从某物中去除锌（尤指从金属合金中除去锌，或去掉镀锌层）"},"examples":[{"en":"The technician dezincated the brass valve to study how corrosion had changed it.","zh":"技术员对黄铜阀门进行去锌处理，以研究腐蚀如何改变了它。"},{"en":"Some cleaning chemicals can slowly dezinc galvanized parts.","zh":"某些清洁化学品可能会慢慢使镀锌部件去锌。"}]},{"partOfSpeech":"vi.","definition":{"en":"to lose zinc as a result of corrosion (often said of brass in water systems)","zh":"（因腐蚀而）失去锌（常用于描述供水系统中的黄铜）"},"examples":[{"en":"In warm, slightly acidic water, some brasses may dezinc over time.","zh":"在温暖、略偏酸的水中，一些黄铜会随着时间发生去锌。"}]}],"synonyms":["dezincify","remove zinc","strip zinc","degalvanize (context-dependent)"],"phonetic":"/diˈzɪŋk/","extraExplanation":["“dezinc”常见于材料工程与管道/阀门领域，相关术语是“dezincification（去锌腐蚀）”。它指黄铜（铜+锌）中的锌被优先溶出，留下多孔、强度变差的富铜层，可能导致渗漏或断裂。","在实际写作中，更常见的表达是“dezincify (a metal)”或名词“dezincification”。如果你在技术文档里使用“dezinc”，最好确认该行业/地区是否习惯这种用法。"]}
{"word":"dezincation","summary":{"en":"Dezincation means the removal of zinc from a material, especially from brass (often due to corrosion).","zh":"Dezincation 指从材料中去除锌，尤其指黄铜中锌被移除（常由腐蚀导致）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of removing zinc from a material (especially from brass), often as a type of corrosion or as part of chemical treatment","zh":"去锌作用；从材料中移除锌的过程（尤其指黄铜中锌被移除），常见于腐蚀或化学处理过程"},"examples":[{"en":"The brass valve failed because of dezincation in seawater.","zh":"这个黄铜阀门因为在海水中发生去锌腐蚀而失效。"},{"en":"Engineers chose a different alloy to prevent dezincation.","zh":"工程师选择了另一种合金来防止去锌作用。"}]}],"synonyms":["zinc removal","dezincification (more common term)"],"phonetic":"/diːˌzɪŋˈkeɪʃən/","extraExplanation":["“dezincation”在实际英语中很少见，更常见、也更标准的术语是“dezincification（去锌腐蚀）”。如果你是在材料/腐蚀相关文本里看到的，建议核对是否为拼写或用词差异。","去锌腐蚀常发生在含锌的黄铜中：锌优先溶出，残留多孔的铜，使零件强度下降、渗漏风险上升；在海水、含氯离子的水环境中更常见。"]}
{"word":"dezinced","summary":{"en":"“Dezinced” is rare and usually refers to having removed zinc (technical). In most everyday contexts, it’s likely a misspelling of another word.","zh":"“dezinced”很少见，多为技术语境下“已去除锌”。在日常使用中更可能是别的词的拼写错误。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Nonstandard/technical) Past tense of “dezinc” (rare): to remove zinc from a metal/alloy or from a surface, usually during industrial processing.","zh":"（非标准/技术用语）“dezinc”的过去式（很少见）：从金属/合金或表面中去除锌，常用于工业处理。"},"examples":[{"en":"The technician dezinced the brass sample before the next test.","zh":"技术员在下一次测试前对黄铜样品进行了去锌处理。"},{"en":"Some cleaners can dezinced coated parts if used incorrectly.","zh":"一些清洁剂如果使用不当，可能会使镀层零件发生去锌作用。"}]},{"partOfSpeech":"other","definition":{"en":"Often a misspelling: “dezinced” is not a common everyday English word. You may have meant a different word (e.g., “dizzying,” “decided,” or “decent”).","zh":"常见为拼写错误：“dezinced”并不是常用英语词。你可能想写别的词（如“dizzying / 令人眩晕的”，“decided / 已决定的”，“decent / 体面的、不错的”）。"},"examples":[{"en":"If you meant “decided”: She decided to leave early.","zh":"如果你想表达“decided”：她决定早点离开。"},{"en":"If you meant “decent”: The food was decent for the price.","zh":"如果你想表达“decent”：以这个价格来说，这食物还不错。"}]}],"synonyms":["remove zinc","dezincified (related)"],"phonetic":"/diˈzɪŋkt/","extraExplanation":["“dezinc”属于非常专业的材料/化工语境，在日常英语中几乎不会用到；更常见的是相关名词“dezincification（脱锌/去锌腐蚀）”。","如果你告诉我它出现的句子或领域（聊天、作业、论文、产品说明等），我可以更准确判断你想要的词以及正确拼写。"]}
{"word":"dezincification","summary":{"en":"Dezincification is a type of corrosion where zinc is removed from brass, weakening the metal.","zh":"脱锌腐蚀是指黄铜中的锌被溶出，导致金属变弱的腐蚀现象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A corrosion process in which zinc is selectively removed from brass (a copper–zinc alloy), leaving behind a weaker, porous copper-rich structure.","zh":"（黄铜等铜锌合金的）一种腐蚀过程：锌被选择性溶出，留下较弱、疏松的富铜结构。"},"examples":[{"en":"Dezincification can cause brass valves to become brittle and leak over time.","zh":"脱锌腐蚀会让黄铜阀门随着时间变脆并发生渗漏。"},{"en":"The lab confirmed dezincification in the pipe fittings after they were exposed to hot, slightly acidic water.","zh":"实验室确认这些管件在接触高温、略呈酸性的水后发生了脱锌腐蚀。"}]}],"synonyms":["selective leaching","selective corrosion (of zinc)","zinc leaching"],"phonetic":"/diˌzɪŋkɪfɪˈkeɪʃən/","extraExplanation":["“dezincification”常见于给排水系统、海水环境、工业冷却水等场景，尤其涉及黄铜管件、阀门、接头等。","典型诱因包括：含氯离子水、微酸性水、高温、停滞水或局部电化学条件差等；结果是材料强度下降、出现“海绵状”富铜层，可能导致渗漏或断裂。","工程上常用的应对方式包括：选用抗脱锌黄铜（DZR brass）、改用青铜/不锈钢/塑料部件，或控制水质与温度等。"]}
{"word":"dezincification-affected","summary":{"en":"“Dezincification-affected” describes brass/alloy parts that have been weakened by dezincification corrosion.","zh":"“dezincification-affected”指黄铜/合金部件因脱锌腐蚀而受损、强度下降的状态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Damaged by dezincification—a type of corrosion where zinc is removed from brass or similar copper–zinc alloys, leaving the metal weaker and often reddish/porous.","zh":"受“脱锌腐蚀”影响的——指黄铜等铜锌合金发生一种腐蚀，锌被选择性溶出，导致材料变弱，表面常呈红色/多孔。"},"examples":[{"en":"The plumber replaced the dezincification-affected brass valve because it had become brittle.","zh":"水管工更换了受脱锌腐蚀影响的黄铜阀门，因为它已经变脆了。"},{"en":"Dezincification-affected fittings may leak even if they look fine from the outside.","zh":"受脱锌腐蚀影响的管件即使外观看起来正常，也可能会渗漏。"},{"en":"In coastal areas, engineers often specify alloys that resist dezincification-affected failure.","zh":"在沿海地区，工程师常会指定更耐脱锌腐蚀、避免出现“受脱锌腐蚀影响而失效”的合金。"}]}],"synonyms":["dezincified","affected by dezincification","corrosion-damaged","dealloyed"],"phonetic":"/diˌzɪŋkəfɪˈkeɪʃən əˌfɛktɪd/","extraExplanation":["“dezincification”常见于材料/工程语境，尤其是饮用水管路、阀门、泵体等使用黄铜的部件。发生后材料会出现“红色腐蚀层”（因为剩下较多铜），并可能变得疏松、强度下降。","写作上常用于报告或检验结论：dezincification-affected component / dezincification-affected brass。更口语或更常见的替代说法包括“dezincified”或“affected by dezincification”。"]}
{"word":"dezincified","summary":{"en":"Dezincified means zinc has been removed from a metal (often brass), sometimes due to corrosion.","zh":"Dezincified 指金属（常为黄铜）已被去除锌，可能是加工处理或因脱锌腐蚀造成。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a metal, especially brass) having had zinc removed—either intentionally in processing or unintentionally through corrosion (dezincification).","zh":"（指金属，尤指黄铜）被去除锌的——可能是加工中有意去锌，也可能是因腐蚀（脱锌腐蚀）而失去锌。"},"examples":[{"en":"Dezincified brass can become weaker and more porous over time.","zh":"发生脱锌的黄铜会随着时间变得更脆弱、更疏松多孔。"},{"en":"The lab report said the fitting was dezincified, so it was replaced.","zh":"实验室报告说该接头发生了脱锌，因此被更换了。"}]},{"partOfSpeech":"v.","definition":{"en":"Past participle of “dezincify”: to remove zinc from a metal.","zh":"“dezincify（去锌）”的过去分词：把金属中的锌去除。"},"examples":[{"en":"They dezincified the alloy to adjust its properties for the application.","zh":"他们对合金进行去锌处理，以调整其性能来满足用途。"}]}],"synonyms":["zinc-depleted","dezincification-affected","dezinced (rare)"],"phonetic":"/diˈzɪŋkɪˌfaɪd/","extraExplanation":["“脱锌腐蚀（dezincification）”常见于某些黄铜在含氯离子或含氧水环境中：锌优先溶出，残留的铜呈现多孔、海绵状结构，导致强度下降、渗漏风险增加。工程上会选用抗脱锌黄铜（DZR brass）或改用不锈钢等材料来避免。"]}
{"word":"dezincify","summary":{"en":"Dezincify means to remove zinc (often a zinc coating), or for an alloy to lose zinc through corrosion.","zh":"Dezincify 指去除锌（常指去掉镀锌层），也可指合金因腐蚀而发生脱锌。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove zinc (especially a protective zinc coating) from metal or from a solution/process","zh":"去锌；除去金属表面的锌（尤其是去除镀锌层）"},"examples":[{"en":"Before repainting the railing, the workers dezincified the old galvanized layer to help the new coating stick.","zh":"在重新粉刷栏杆之前，工人先把旧的镀锌层去锌处理，以便新涂层更牢固地附着。"},{"en":"The lab procedure includes dezincifying the sample so other metals can be measured accurately.","zh":"该实验步骤包括对样品进行去锌处理，以便更准确地测量其他金属。"}]},{"partOfSpeech":"vi.","definition":{"en":"(in materials science) to lose zinc from an alloy due to corrosion, leaving a weaker, porous copper-rich structure (common in some brasses)","zh":"（材料/腐蚀学）脱锌：合金在腐蚀中失去锌，留下强度更低、孔隙较多的富铜结构（常见于某些黄铜）"},"examples":[{"en":"Some brass fittings can dezincify in warm, salty water and become brittle over time.","zh":"一些黄铜接头在温热的盐水中可能发生脱锌，久而久之变脆。"},{"en":"Engineers choose dezincification-resistant brass to reduce the risk of leaks.","zh":"工程师会选用耐脱锌黄铜，以降低渗漏风险。"}]}],"synonyms":["remove zinc","strip zinc","degalvanize","(materials) dezincify (corrode)"],"phonetic":"/diːˈzɪŋkɪˌfaɪ/","extraExplanation":["“dezincify”由前缀 de-（去除、逆转）+ zinc（锌）+ -ify（使成为/使发生）构成，常见于工程、冶金、表面处理与实验室语境。","容易与“galvanize（镀锌/电镀防锈）”一起出现：galvanize 是“加上锌层”，dezincify 是“去掉锌层”或“发生脱锌”。","“dezincification（脱锌腐蚀）”是更常见的名词形式，指黄铜等含锌合金在特定水质/温度条件下的选择性腐蚀现象。"]}
{"word":"dezincifying","summary":{"en":"Dezincifying means removing zinc from an alloy (especially brass) or the corrosion process where brass loses zinc.","zh":"Dezincifying 指（使）合金（尤指黄铜）脱锌，或黄铜发生脱锌腐蚀、锌流失的过程。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"the process of removing zinc from an alloy (especially brass), or the corrosion process in which zinc is lost from brass","zh":"（使）脱锌：从合金（尤指黄铜）中去除锌；也指黄铜发生脱锌腐蚀、锌被溶出流失的过程"},"examples":[{"en":"The lab is dezincifying the brass sample to study what metals remain.","zh":"实验室正在对黄铜样品进行脱锌处理，以研究剩下的金属成分。"},{"en":"Dezincifying can weaken brass fittings in salty or acidic water.","zh":"在含盐或偏酸的水中发生脱锌会削弱黄铜接头的强度。"},{"en":"The report warned that the valve might be dezincifying after years of use.","zh":"报告警告该阀门在多年使用后可能正在发生脱锌腐蚀。"}]}],"synonyms":["dealloying","selective leaching"],"phonetic":"/diːˈzɪŋkɪˌfaɪɪŋ/","extraExplanation":["“dezincify”由前缀 de-（去除、反向）+ zinc（锌）+ -ify（使……化/使成为）构成；“dezincifying”是其现在分词/动名词形式，常见于材料工程、腐蚀与给排水（金属管件）语境。","在黄铜中，脱锌往往会让表面变得多孔、偏红（铜含量相对变高），强度和密封性下降；因此工程上会用“抗脱锌黄铜”（DZR brass）或通过材料与水质控制来降低风险。"]}
{"word":"dezincing","summary":{"en":"Dezincing means removing zinc—often discussed with brass and corrosion (dezincification).","zh":"Dezincing 指“脱锌/去锌”，常用于黄铜材料与腐蚀（脱锌腐蚀）相关语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of removing zinc from a metal (especially brass) or from a surface; also used for treating or preventing zinc loss (dezincification).","zh":"脱锌（作用）：从金属（尤指黄铜）或表面中去除锌的过程；也可指为处理或防止黄铜“脱锌腐蚀（dezincification）”而进行的工艺。"},"examples":[{"en":"Dezincing is sometimes used to recover zinc from scrap brass.","zh":"脱锌有时用于从废黄铜中回收锌。"},{"en":"The engineer checked the pipe fittings for signs of dezincing.","zh":"工程师检查了管件是否有脱锌现象的迹象。"}]},{"partOfSpeech":"v.","definition":{"en":"removing zinc from a metal or surface.","zh":"脱锌的；去除锌的。"},"examples":[{"en":"They are dezincing the brass parts before the next step.","zh":"他们正在对黄铜零件进行脱锌处理，然后再进行下一步。"},{"en":"A dezincing treatment can improve the surface for certain coatings.","zh":"脱锌处理可改善表面，以便进行某些涂层工艺。"}]}],"synonyms":["zinc removal","dezincking","dezincification (related)"],"phonetic":"/diˈzɪŋkɪŋ/","extraExplanation":["“dezincing”在日常英语里不常见，多出现在冶金、材料、管道与腐蚀工程的语境中。黄铜长期接触水或含氯环境时，锌可能被选择性溶出，留下多孔、偏红的铜结构，这种现象常叫“dezincification（脱锌腐蚀）”。","如果你看到的是设备检修报告或材料说明书，文中“dezincing”可能指“发生了脱锌（损伤）”，也可能指“进行脱锌处理（工艺）”；需要结合上下文判断。"]}
{"word":"dezincked","summary":{"en":"“Dezincked” means zinc has been removed, usually from a metal surface; it’s the past form/participle of “dezinc.”","zh":"“dezincked”表示“已去锌/被去除锌层”，常用于金属表面处理语境，是动词“dezinc”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having had zinc removed (for example, a zinc coating stripped off a metal surface).","zh":"被去锌的；锌被去除的（例如把金属表面的镀锌层剥离）。"},"examples":[{"en":"The dezincked steel was ready for repainting.","zh":"去锌后的钢材已经可以重新喷漆了。"},{"en":"After cleaning, the parts looked dezincked and slightly dull.","zh":"清洗后，零件看起来像是去锌了，表面有点发暗。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “dezinc”: to remove zinc from something (especially from a metal surface or alloy).","zh":"“dezinc”的过去式/过去分词：给某物去锌（尤指去除金属表面或合金中的锌）。"},"examples":[{"en":"The shop dezincked the hardware before applying a new finish.","zh":"工坊在做新表面处理之前先把五金件去锌了。"},{"en":"We dezincked the scrap metal to separate materials for recycling.","zh":"我们对废金属去锌，以便回收时分离材料。"}]}],"synonyms":["dezinc(ed)","zinc-stripped","stripped of zinc","degalvanized (when removing galvanizing)"],"phonetic":"/diˈzɪŋkt/","extraExplanation":["“dezincked”比较少见，更常见的表达是“dezinc(ed)”（去锌/已去锌）或“zinc stripped”（锌层被剥离）。如果你是在管道/黄铜相关语境里看到，另一个相近术语是“dezincification”（脱锌腐蚀，指黄铜中锌被腐蚀溶出），但它强调的是腐蚀现象，不一定是人为处理。"]}
{"word":"dezincking","summary":{"en":"Dezincing means removing zinc from a metal surface or coating.","zh":"Dezincing 指从金属表面或涂层中去除锌（除锌/去锌）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of removing zinc (especially from steel parts or from a zinc coating)","zh":"除锌；去锌（尤指从钢件上或从镀锌层中去除锌的过程）"},"examples":[{"en":"The old bolts need dezincing before they can be re-plated.","zh":"这些旧螺栓在重新电镀之前需要先除锌。"},{"en":"Dezincing helps prepare the surface for paint or another coating.","zh":"除锌有助于为喷漆或其他涂层做表面准备。"}]},{"partOfSpeech":"v.","definition":{"en":"to remove zinc from something (such as a metal surface or a coating)","zh":"给……除锌；去除……上的锌（如金属表面或涂层中的锌）"},"examples":[{"en":"They dezinc the galvanized parts using a chemical bath.","zh":"他们用化学浸泡槽对镀锌零件进行除锌处理。"},{"en":"Make sure to dezinc the surface evenly to avoid patchy results.","zh":"确保均匀除锌，以免出现斑驳不均的效果。"}]}],"synonyms":["zinc removal","de-zincing","strip zinc","deplating (zinc)"],"phonetic":"/diːˈzɪŋkɪŋ/","extraExplanation":["“dezincking”通常是拼写错误，更常见的拼法是 **dezincing**（除锌）。在金属加工/表面处理领域常见：比如去除旧的镀锌层以便重新电镀、焊接或涂装。也要注意与 **dezincification** 区分：后者多指黄铜等合金在腐蚀中“失锌”的现象。"]}
{"word":"dezincs","summary":{"en":"Dezinc means to remove zinc from an alloy (often brass), or the zinc-removal process itself.","zh":"Dezinc 指从合金（常见为黄铜）中去除锌，或指这种脱锌过程。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove zinc from a metal or alloy (especially from brass), usually during processing or corrosion control","zh":"（尤指对黄铜等合金）脱锌；把锌从金属或合金中去除（常见于加工或防腐处理语境）"},"examples":[{"en":"This treatment helps dezinc brass parts that will be used in seawater.","zh":"这种处理有助于对将用于海水环境的黄铜零件进行脱锌。"},{"en":"If the valve body dezincs over time, it can become weak and porous.","zh":"如果阀体随着时间发生脱锌，材料可能变得脆弱并出现孔隙。"}]},{"partOfSpeech":"n.","definition":{"en":"a process or result of zinc removal from an alloy (less common as a noun)","zh":"脱锌过程；脱锌的结果（作名词较少见）"},"examples":[{"en":"The report focused on dezinc in older brass fittings.","zh":"报告重点讨论了旧黄铜接头中的脱锌现象。"}]}],"synonyms":["de-zinc","remove zinc","strip zinc"],"phonetic":"/diˈzɪŋk/","extraExplanation":["“dezincs”多半是动词“dezinc”的第三人称单数形式（He/She/It dezincs...），或是把名词复数写出来的非典型用法。更常见的专业名词是“dezincification（脱锌腐蚀）”，指黄铜在某些环境（如含氯化物的水、海水）中锌被选择性溶出，导致材料变脆、呈多孔状。"]}
{"word":"dezinkify","summary":{"en":"“Dezinkify” means to remove zinc (or cause zinc to be removed), especially from an alloy; it’s often seen as the variant spelling of “dezincify.”","zh":"“dezinkify”意为（使）去除锌，尤指从合金中去锌；常被视为“dezincify”的变体拼写。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove zinc from something, especially from a metal alloy (or to cause zinc to be removed, often through a chemical process)","zh":"（使）去除锌；尤指从金属合金中去锌（常指通过化学过程导致锌被移除）"},"examples":[{"en":"Certain chemicals can dezinkify the surface of some alloys over time.","zh":"某些化学物质会随着时间推移使一些合金表面去锌。"},{"en":"If the brass fitting starts to dezinkify, it may become weaker and porous.","zh":"如果黄铜接头开始去锌，它可能会变得更脆弱并出现孔隙。"}]},{"partOfSpeech":"vt.","definition":{"en":"(less common) to remove a zinc coating from a metal part","zh":"（较少见）去除金属零件表面的镀锌层"},"examples":[{"en":"They dezinkified the fasteners before applying a different protective finish.","zh":"他们在涂覆另一种防护涂层前，先把紧固件的镀锌层去掉了。"}]}],"synonyms":["dezincify","remove zinc from","strip zinc (coating)"],"phonetic":"/diˈzɪŋkɪˌfaɪ/","extraExplanation":["“dezinkify”并不是最常见的拼写；技术写作里更常见的是“dezincify / dezincification”。这里的词根是 zinc（锌），前缀 de- 表示“去除”。","在材料与腐蚀语境中，相关概念是“脱锌腐蚀（dezincification）”：黄铜等含锌合金在某些水质/化学环境下，锌会优先溶出，留下多孔、富铜的结构，导致强度下降、渗漏风险上升。"]}
{"word":"dezymotize","summary":{"en":"A very rare technical verb meaning to remove or prevent fermentation/zymotic activity; by extension, to disinfect.","zh":"一个非常罕见的技术动词，指去除或抑制发酵/“酶发”作用；引申为消毒。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Very rare / technical) To remove or prevent fermentation or “zymotic” (ferment-like, infection-causing) activity; to disinfect or render non-infectious.","zh":"（非常罕见／技术用语）去除或抑制“发酵／酶发（zymotic）”作用；引申为消毒、使其不再具有感染性。"},"examples":[{"en":"The researcher claimed the solution could dezymotize contaminated water.","zh":"研究者声称该溶液可以对受污染的水进行“去酶发/去发酵性处理”，使其不再致病。"},{"en":"Hospitals experimented with chemicals to dezymotize instruments before modern sterilization standards.","zh":"在现代灭菌标准出现前，医院曾尝试用化学品对器械进行“去酶发/消毒”处理。"}]}],"synonyms":["disinfect","sterilize","sanitize","decontaminate"],"phonetic":"/diˈzaɪməˌtaɪz/","extraExplanation":["这个词在现代英语中几乎不使用，更多见于较早期、带有“发酵理论/酶发”色彩的医学或化学语境中。","词根来自 *zymo-*（与发酵有关，源自希腊语 *zymē* “酵母/发酵”）。19世纪的“zymotic diseases（酶发性疾病）”曾用来指传染病，后来逐渐被更准确的“infectious/contagious”体系取代。","如果你是在现代写作或考试中想表达“消毒/灭菌/杀菌”，更自然的词是 **disinfect**, **sterilize**, **sanitize**。"]}

