{"word":"DF","summary":{"en":"“DF” is a context-dependent abbreviation, most commonly meaning DataFrame (programming), degrees of freedom (statistics), or a federal district in place names.","zh":"“DF”是高度依赖语境的缩写，最常见指数据框（编程）、自由度（统计），或地名中的联邦区/特区。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “District of Columbia” (less common) or “Federal District,” often used in addresses or place names in some countries","zh":"“哥伦比亚特区”（较少见）或“联邦区/联邦直辖区”的缩写，常用于地址或地名（在一些国家更常见）"},"examples":[{"en":"He moved to Washington, D.C. (sometimes written as Washington, DF in older or informal contexts).","zh":"他搬到了华盛顿特区（在一些较旧或非正式的写法里偶尔会看到写成 Washington, DF）。"},{"en":"In Mexico, “CDMX” is now common, but you may still see “DF” in older documents.","zh":"在墨西哥，现在更常用“CDMX”，但在较旧的文件里你仍可能看到“DF”。"}]},{"partOfSpeech":"other","definition":{"en":"short for “DataFrame,” a table-like data structure in programming and data analysis (especially in Python/pandas and R)","zh":"“DataFrame（数据框）”的缩写，在编程与数据分析中指一种“表格状”的数据结构（尤其常见于 Python/pandas 和 R）"},"examples":[{"en":"Load the CSV file and store it in a df.","zh":"把 CSV 文件读进来，存到一个 df 里。"},{"en":"This df has three columns: name, age, and city.","zh":"这个 df 有三列：姓名、年龄和城市。"}]},{"partOfSpeech":"other","definition":{"en":"short for “degrees of freedom,” a statistics term meaning how many independent values can vary in a calculation","zh":"“自由度（degrees of freedom）”的缩写，统计学术语，指在计算中可独立变化的数值数量"},"examples":[{"en":"The t-test reported df = 28.","zh":"t 检验报告的自由度是 df = 28。"},{"en":"Higher df usually makes the estimate more stable.","zh":"自由度更高通常会让估计更稳定。"}]}],"synonyms":["D.C. (place-name context)","DataFrame (spelled out)","degrees of freedom (spelled out)"],"phonetic":"/ˌdiːˈɛf/","extraExplanation":["“DF”是非常依赖语境的缩写：在数据分析里最常见的是 DataFrame（df）；在统计报告里常见 df=…（自由度）；在地名/地址里，某些国家历史上用 DF 指“联邦区”（例如墨西哥城过去常写 Distrito Federal，现多用 CDMX）。如果你告诉我你在哪里看到“DF”（聊天、作业、地址、代码等），我可以给出最贴切的解释。"]}
{"word":"DFA","summary":{"en":"“DFA” most commonly means Deterministic Finite Automaton in computer science; it can also mean Design for Assembly in manufacturing.","zh":"“DFA”最常见指计算机科学中的“确定性有限自动机”；在制造业中也可指“面向装配设计”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(computer science) Deterministic Finite Automaton: a simple abstract machine used to recognize patterns/strings, where each state and input symbol leads to exactly one next state.","zh":"（计算机科学）确定性有限自动机：一种用于识别字符串/模式的抽象计算模型；在任一状态下，给定一个输入符号只能转移到唯一的下一状态。"},"examples":[{"en":"In theory of computation, a DFA can decide whether a string belongs to a regular language.","zh":"在计算理论中，DFA 可以判断一个字符串是否属于某个正则语言。"},{"en":"We built a DFA to validate identifiers like variable names.","zh":"我们构建了一个 DFA 来验证标识符，比如变量名。"},{"en":"This regex can be converted into a DFA for faster matching.","zh":"这个正则表达式可以转换成 DFA，以获得更快的匹配速度。"}]},{"partOfSpeech":"n.","definition":{"en":"(engineering/manufacturing) Design for Assembly: a product-design approach that reduces the number of parts and makes a product easier, faster, and cheaper to assemble.","zh":"（工程/制造）面向装配设计：一种产品设计方法，通过减少零件数量、优化结构来让装配更容易、更快、更省成本。"},"examples":[{"en":"Using DFA principles, the team reduced the screw count from 12 to 4.","zh":"运用 DFA（面向装配设计）原则，团队把螺丝数量从 12 个减少到 4 个。"},{"en":"The new housing was redesigned for DFA so workers could assemble it without special tools.","zh":"新外壳为了 DFA 被重新设计，使工人不需要特殊工具就能装配。"}]}],"synonyms":["deterministic finite automaton","deterministic finite-state machine","design for assembly"],"phonetic":"ˌdiː ɛf ˈeɪ","extraExplanation":["在计算机科学里，“DFA”常与“NFA（非确定性有限自动机）”对比：DFA 每一步只有一条确定的转移路径；NFA 可能有多条路径。两者识别能力相同（都能识别正则语言），但 DFA 往往更便于实现与高效匹配（例如把正则表达式编译成自动机）。","作为缩写，DFA 在不同领域含义可能不同；在技术交流中通常需要结合上下文（如课程、论文、制造流程）来判断具体指哪一种。"]}
{"word":"dfault","summary":{"en":"Default means a failure to meet a duty (especially paying a debt), or the preset option used automatically.","zh":"default 指（尤指未还债的）违约，也可指系统自动采用的默认选项/预设设置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(finance/law) Failure to do something you legally must do, especially failing to pay money back on time.","zh":"（金融/法律）违约；（尤指）未按时偿还债务。"},"examples":[{"en":"The company went into default on its loans.","zh":"这家公司贷款违约了。"},{"en":"If you miss three payments, you may be in default.","zh":"如果你错过三次还款，你可能就算违约。"}]},{"partOfSpeech":"v.","definition":{"en":"To fail to do something required, especially to fail to pay a debt.","zh":"（尤指因未还债而）违约；未履行（义务）。"},"examples":[{"en":"Many borrowers defaulted during the recession.","zh":"经济衰退期间，许多借款人违约了。"},{"en":"If you default on rent, you could be evicted.","zh":"如果你房租违约，可能会被赶走。"}]},{"partOfSpeech":"adj.","definition":{"en":"The preset choice a device or program uses unless you change it.","zh":"（设备/软件）默认的；预设的。"},"examples":[{"en":"Your browser’s default language is English.","zh":"你的浏览器默认语言是英语。"},{"en":"Click ‘Restore default settings’ to reset everything.","zh":"点击“恢复默认设置”来重置所有内容。"}]}],"synonyms":["failure","nonpayment","preset","standard"],"phonetic":"/dɪˈfɔlt/","extraExplanation":["“default”常见于两大语境：\n1）金融/法律：default on a loan（贷款违约）、default on payments（未按期付款）。\n2）科技/日常：default settings（默认设置）、by default（默认情况下）。","拼写提醒：你输入的“dfault”很可能是“default”的拼写错误；正确拼写是 d-e-f-a-u-l-t。","词源上与“缺失/不足（fault）”有关，因此在金融语境里带有“未履行责任”的含义。"]}
{"word":"DFC","summary":{"en":"“DFC” is an abbreviation; most commonly it refers to the U.S. International Development Finance Corporation in policy and development contexts.","zh":"“DFC”是缩写；在政策与发展金融语境中最常指美国国际开发金融公司（U.S. International Development Finance Corporation）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in U.S. news/policy) The U.S. International Development Finance Corporation, a government agency that supports private-sector projects in developing countries through loans, guarantees, and investment tools.","zh":"（尤见于美国新闻/政策语境）美国“国际开发金融公司”（U.S. International Development Finance Corporation），一个通过贷款、担保和投资工具支持发展中国家私营部门项目的政府机构。"},"examples":[{"en":"The DFC financed a renewable-energy project in East Africa.","zh":"DFC 为东非的一个可再生能源项目提供了融资支持。"},{"en":"Companies can apply to the DFC for development-focused funding.","zh":"企业可以向 DFC 申请以发展为导向的资金支持。"}]},{"partOfSpeech":"n.","definition":{"en":"A common abbreviation that can mean different things depending on the field (for example, the name of an organization, a department, or a technical term).","zh":"一个常见缩写，具体含义取决于领域（例如某个机构名称、部门名称或技术术语）。"},"examples":[{"en":"In this report, DFC refers to the U.S. development finance agency.","zh":"在本报告中，DFC 指美国的开发金融机构。"},{"en":"Ask what DFC stands for in this context, because the abbreviation is ambiguous.","zh":"最好先确认此处 DFC 的全称，因为这个缩写可能有多种含义。"}]}],"synonyms":["U.S. International Development Finance Corporation","US DFC"],"phonetic":"/ˌdiː ɛf ˈsiː/","extraExplanation":["“DFC”本质上是字母缩写，读作三个字母的名称。在国际新闻、经济发展与外交政策语境里，它最常指美国的 U.S. International Development Finance Corporation（成立于2019年，由OPIC等机构整合而来）。","如果你是在别的领域（如工程、医疗、公司内部文件）看到“DFC”，含义可能不同。你可以把出现“DFC”的原句发我，我可以帮你准确判定。"]}
{"word":"DFD","summary":{"en":"DFD most commonly means “data flow diagram” in tech; in meat science it can mean “dark, firm, dry.”","zh":"DFD最常见指技术领域的“数据流图”；在肉类科学中也可指“暗、硬、干”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(especially in computing and systems analysis) a data flow diagram: a drawing that shows how information moves through a system, including inputs, processes, data stores, and outputs.","zh":"（尤指计算机与系统分析中）数据流图：用图示方式展示信息在系统中如何流动，包括输入、处理过程、数据存储与输出。"},"examples":[{"en":"We drew a DFD to understand how customer orders move through the website.","zh":"我们画了一个DFD来理解客户订单在网站中的流转方式。"},{"en":"The analyst updated the DFD after the team changed the payment process.","zh":"团队更改了支付流程后，分析师更新了数据流图（DFD）。"}]},{"partOfSpeech":"other","definition":{"en":"(meat science) “dark, firm, dry”: a condition in beef or pork where the meat becomes darker, firmer, and drier than normal, often linked to animal stress before slaughter.","zh":"（肉类科学）“暗、硬、干”：指牛肉或猪肉出现颜色更深、质地更硬、口感更干的状况，常与屠宰前动物应激有关。"},"examples":[{"en":"The report noted a higher rate of DFD beef during transport delays.","zh":"报告指出，运输延误期间DFD牛肉的比例更高。"},{"en":"Proper handling can reduce stress and lower the risk of DFD.","zh":"适当的处理方式能减少应激并降低出现DFD的风险。"}]}],"synonyms":["data flow diagram","DFD diagram","context diagram (related)"],"phonetic":"/ˌdiː ɛf ˈdiː/","extraExplanation":["在软件工程里，DFD常和流程图（flowchart）混淆：流程图更强调“步骤顺序”，而DFD更强调“数据从哪里来、到哪里去、经过哪些处理/存储”。常见层级有“上下文图（Context Diagram）”和“Level 0/1 DFD”。","在食品/畜牧语境里看到DFD时，通常会写成“DFD beef/pork”。它和“PSE（pale, soft, exudative：苍白、柔软、渗水）”并列，都是描述肉品异常状态的缩写。"]}
{"word":"DFE","summary":{"en":"DFE is an abbreviation with several common meanings, especially Design for Environment and the UK Department for Education (DfE).","zh":"DFE 是一个缩写，常见含义包括“环境友好设计（Design for Environment）”以及英国“教育部（Department for Education，常写作 DfE）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Design for Environment,” a product-design approach that reduces environmental impact (materials, energy use, recycling, etc.).","zh":"“Design for Environment（环境友好设计）”的缩写：在产品设计阶段就考虑减少环境影响（材料、能耗、可回收性等）。"},"examples":[{"en":"Our engineers use DFE to choose recyclable packaging.","zh":"我们的工程师用 DFE 来选择可回收的包装。"},{"en":"DFE guidelines helped the company cut plastic waste.","zh":"DFE 指南帮助公司减少了塑料浪费。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Department for Education,” a UK government department responsible for education.","zh":"“Department for Education（英国教育部）”的缩写：英国负责教育事务的政府部门。"},"examples":[{"en":"The DfE published new guidance for schools in England.","zh":"英国教育部（DfE）发布了英格兰学校的新指导意见。"},{"en":"According to the DfE, attendance rates improved this year.","zh":"据英国教育部（DfE）称，今年出勤率有所提升。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Design for Excellence,” a general business/engineering term for designing products or processes to achieve high overall quality (cost, performance, reliability, manufacturability).","zh":"“Design for Excellence（卓越设计）”的缩写：在设计中同时优化成本、性能、可靠性与可制造性等综合质量。"},"examples":[{"en":"DFE workshops trained teams to improve quality and reduce cost.","zh":"DFE 研讨会培训团队提升质量并降低成本。"},{"en":"They adopted a DFE approach before mass production.","zh":"他们在量产前采用了 DFE 的方法。"}]}],"synonyms":["DfE (Department for Education; also used for Design for Environment)"],"phonetic":"ˌdiː ɛf ˈiː","extraExplanation":["“DFE/DfE”通常是缩写，具体含义高度依赖语境：工程/产品设计里常见的是 Design for Environment；英国新闻与教育政策里常见的是 Department for Education（多写作 DfE）。","读法一般是逐字母读：D-F-E。正式写作中，第一次出现最好写全称并在括号里标注缩写，例如：Design for Environment (DFE)。"]}
{"word":"DFI","summary":{"en":"DFI is an abbreviation with several common meanings, especially Direct Foreign Investment (often written FDI), Design for Inspection, and Development Finance Institution.","zh":"DFI 是一个多义缩写，常见含义包括对外直接投资（更常写作 FDI）、面向检验的设计，以及发展金融机构。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(business/economics) Direct Foreign Investment (also commonly written as FDI): investment made by a company or person from one country into business operations in another country, usually by owning or controlling a company there.","zh":"（商业/经济）对外直接投资（更常写作 FDI）：一国的公司或个人在另一国进行的投资，通常通过拥有股权或控制企业来实现长期经营。"},"examples":[{"en":"The report shows a rise in foreign companies’ direct investment in Vietnam (often discussed as FDI/DFI).","zh":"报告显示外国公司在越南的直接投资上升（常以 FDI/DFI 讨论）。"},{"en":"Governments may offer tax breaks to attract DFI into high-tech industries.","zh":"政府可能会提供税收优惠以吸引对高科技产业的对外直接投资。"}]},{"partOfSpeech":"other","definition":{"en":"(engineering/manufacturing) Design for Inspection: designing a product so it can be checked/measured easily and reliably during production.","zh":"（工程/制造）面向检验的设计：在设计产品时就考虑让生产过程中的检测/测量更容易、更可靠。"},"examples":[{"en":"DFI can reduce defects by making critical parts easier to measure on the assembly line.","zh":"面向检验的设计可以通过让关键部件更容易在流水线上测量来减少缺陷。"},{"en":"Our team added alignment marks as part of DFI.","zh":"我们团队加入了对齐标记，作为面向检验设计的一部分。"}]},{"partOfSpeech":"other","definition":{"en":"(finance) Development Finance Institution: an organization that provides funding for development projects, especially in emerging markets (often abbreviated as DFI).","zh":"（金融）发展金融机构：为发展项目提供资金的机构，尤其是在新兴市场（常缩写为 DFI）。"},"examples":[{"en":"A DFI helped fund renewable energy projects in the region.","zh":"一家发展金融机构帮助为该地区的可再生能源项目提供资金。"},{"en":"Startups may seek loans or guarantees from a DFI.","zh":"初创企业可能会向发展金融机构寻求贷款或担保。"}]}],"synonyms":["FDI (for Direct Foreign Investment)","Design for inspection (spelled out)","Development finance institution (spelled out)"],"phonetic":"/diː ɛf aɪ/","extraExplanation":["“DFI”是缩写，在不同领域含义差异很大；最常见的经济学写法其实是“FDI（Foreign Direct Investment）”，有些材料里会把顺序写成“DFI”。看到“DFI”时，最好结合上下文（贸易/工厂/工程/金融机构等）来判断。","读法通常是逐字母读：D-F-I。"]}
{"word":"DFM","summary":{"en":"DFM most commonly means “Design for Manufacturing” in engineering, but it can also mean a strong slang warning (“Don’t f*** with me”) or “Direct from the Manufacturer” in shopping contexts.","zh":"DFM最常见指工程领域的“面向制造的设计”，但在聊天里也可能是粗口警告（“别惹我”），或在网购语境指“厂家直发/厂家直供”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Initialism, engineering/business) “Design for Manufacturing”: designing a product so it is easier and cheaper to manufacture.","zh":"（首字母缩略词，工程/商业）“面向制造的设计”：在产品设计阶段就考虑如何更容易、更便宜地生产。"},"examples":[{"en":"We improved the DFM of the part by reducing the number of screws.","zh":"我们通过减少螺丝数量来提升这个零件的DFM（可制造性设计）。"},{"en":"DFM reviews help catch problems before the factory starts mass production.","zh":"DFM评审能在工厂开始量产前发现问题。"}]},{"partOfSpeech":"other","definition":{"en":"(Texting/slang, informal) “Don’t f*** with me”: a strong warning meaning “Don’t mess with me” or “Don’t provoke me.”","zh":"（短信/俚语，非正式）“别惹我/别跟我来这套”：带有强烈警告语气，相当于“Don’t mess with me”。"},"examples":[{"en":"He texted, “DFM,” when he thought someone was lying to him.","zh":"他觉得有人在骗他时发了“DFM”。"},{"en":"If you mean “Don’t mess with me,” you can also say it more politely.","zh":"如果你想表达“别惹我”，也可以用更礼貌的说法。"}]},{"partOfSpeech":"other","definition":{"en":"(Initialism, online fandom) “Direct from the Manufacturer”: goods shipped straight from the maker, not a reseller.","zh":"（首字母缩略词，网购/商品语境）“厂家直发/厂家直供”：商品由生产厂家直接发货，而非经销商。"},"examples":[{"en":"This listing says DFM, so it should ship from the brand’s factory.","zh":"这个商品页面写着DFM，所以应该是品牌工厂直接发货。"},{"en":"DFM items can be cheaper, but shipping may take longer.","zh":"DFM商品可能更便宜，但运输时间可能更长。"}]}],"synonyms":["Design for Manufacturing","DFMA","DFA","direct from the manufacturer","don’t mess with me"],"phonetic":"ˌdiː ɛf ˈɛm","extraExplanation":["“DFM”有很多行业含义，最常见于工程领域（Design for Manufacturing）。在聊天里表示粗口警告时，语气非常冲、容易冒犯；如果不确定对方意思，建议先问一句：What does DFM mean here?（这里的DFM是什么意思？）","工程语境里也常看到相关缩写：DFMA（Design for Manufacturing and Assembly，面向制造与装配的设计）、DFA（Design for Assembly，面向装配的设计）。"]}
{"word":"DFMS","summary":{"en":"DFMS is an abbreviation whose exact meaning depends on context, usually referring to a particular management system.","zh":"DFMS是一个缩写，具体含义取决于上下文，通常指某种“管理系统”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation (acronym) that can stand for different things depending on the field; often used as the name of a specific information system (for example, a finance or file-management system).","zh":"一个缩写/首字母缩略词，在不同领域可能代表不同含义；常用作某个特定信息系统的名称（例如财务系统或文件管理系统）。"},"examples":[{"en":"In this report, DFMS refers to the agency’s financial management system.","zh":"在这份报告中，DFMS指该机构的财务管理系统。"},{"en":"Ask your IT team what DFMS stands for in your company’s documentation.","zh":"请问你们公司的IT团队，DFMS在内部文档里具体代表什么。"}]}],"synonyms":["acronym","abbreviation"],"phonetic":"/diː ɛf ɛm ɛs/","extraExplanation":["DFMS不是一个“固定含义”的英语单词，更像是机构/公司内部或某个行业里使用的系统名称缩写。最常见的做法是：查看上下文（文件标题、所属部门、行业）来确认它的全称。","在不同语境中，DFMS可能被用来指例如“Defense Financial Management System（国防/政府相关的财务管理系统）”或“Distributed File Management System（分布式文件管理系统）”等；具体以你看到它的材料为准。"]}
{"word":"DFRF","summary":{"en":"“DFRF” is not a common English word; it’s usually an abbreviation whose meaning depends on context.","zh":"“DFRF”不是常见英语单词；通常是缩写，含义取决于上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation/initialism that is not a standard English word by itself; its meaning depends on the specific field or context (e.g., a company name, technical term, or internal code).","zh":"一个非标准英语单词的缩写/首字母缩略语；具体含义取决于使用领域或上下文（如公司名、技术术语或内部代号）。"},"examples":[{"en":"I saw “DFRF” in the document, but it wasn’t defined—what does it stand for?","zh":"我在文件里看到“DFRF”，但没有解释——它代表什么？"},{"en":"Could you share the sentence where “DFRF” appears so I can interpret it correctly?","zh":"你能把“DFRF”出现的那句话发我吗？这样我才能准确判断它的意思。"}]}],"synonyms":["initialism","abbreviation","acronym"],"phonetic":"/ˌdiː ɛf ɑr ˈɛf/","extraExplanation":["“DFRF”看起来像首字母缩略语（initialism）。缩略语在不同专业里可能完全不同：比如工程、金融、医疗、组织名称或项目代号等。为了不误导你，我需要你提供它出现的上下文（句子/文件类型/行业），或告诉我你在哪儿看到的（邮件、论文、设备界面等）。"]}
{"word":"DFS","summary":{"en":"DFS is an abbreviation most commonly meaning depth-first search in computing, but it can also mean daily fantasy sports, distributed file system, or a department of financial services depending on context.","zh":"DFS 是一个缩写，最常见指计算机中的深度优先搜索；也可能指每日梦幻体育、分布式文件系统，或某地的金融服务监管机构（依语境而定）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(computer science) Depth-first search: an algorithm for exploring a graph or tree by going as far as possible along one path before backtracking.","zh":"（计算机）深度优先搜索：一种遍历图或树的算法，会沿一条路径尽可能深入，再回溯继续探索。"},"examples":[{"en":"We used DFS to traverse the tree and record the visiting order.","zh":"我们用 DFS 遍历这棵树，并记录访问顺序。"},{"en":"DFS is often implemented with recursion or an explicit stack.","zh":"DFS 常用递归或显式栈来实现。"},{"en":"In maze-solving, DFS can quickly find a path, though not always the shortest.","zh":"在走迷宫时，DFS 可能很快找到一条路，但不一定是最短路径。"}]},{"partOfSpeech":"n.","definition":{"en":"(sports, especially in North America) Daily Fantasy Sports: online fantasy contests where you build a lineup for a single day or a short period.","zh":"（体育，尤指北美）每日梦幻体育：一种线上梦幻体育玩法，你为一天或短周期组建阵容参赛。"},"examples":[{"en":"He plays DFS during the NBA season on the weekends.","zh":"NBA 赛季的周末他会玩 DFS。"},{"en":"DFS contests usually have a salary cap for selecting players.","zh":"DFS 比赛通常有选择球员的工资帽限制。"}]},{"partOfSpeech":"n.","definition":{"en":"(computing) Distributed File System: a file system that lets users access and share files across multiple computers or servers.","zh":"（计算机）分布式文件系统：让用户在多台计算机或服务器之间访问与共享文件的文件系统。"},"examples":[{"en":"The company migrated its data to a DFS to improve reliability.","zh":"公司把数据迁移到 DFS，以提高可靠性。"},{"en":"With a DFS, files can appear to be in one place even if they’re stored on different servers.","zh":"使用 DFS 时，文件看起来像在同一处，即使实际存放在不同服务器上。"}]},{"partOfSpeech":"n.","definition":{"en":"(finance/government, varies by location) Department of Financial Services: a government agency name used in some regions.","zh":"（金融/政府，因地区而异）金融服务部/金融服务局：一些地区使用的政府机构名称。"},"examples":[{"en":"Check the DFS website for licensing requirements in your state.","zh":"查看 DFS 网站了解你所在州的许可要求。"},{"en":"The complaint was filed with the DFS.","zh":"投诉已提交给 DFS。"}]}],"synonyms":["depth-first search","graph traversal","daily fantasy sports","distributed file system"],"phonetic":"/ˌdiːˌɛfˈɛs/","extraExplanation":["“DFS”是缩写，具体意思强烈依赖语境：在算法与数据结构课程/面试里几乎总是指 Depth-first search；在体育博彩/梦幻体育社区里常指 Daily Fantasy Sports；在 IT 基础设施语境里可能指 Distributed File System；在政府/监管语境则可能是某地的金融服务监管机构名称。","口语中常按字母念作“D-F-S”。书写时第一次出现通常会先写全称再写（DFS），以避免歧义。"]}
{"word":"DFT","summary":{"en":"DFT usually means the Discrete Fourier Transform in math/engineering; in the UK it can also mean the Department for Transport.","zh":"DFT 通常指数学/工程中的“离散傅里叶变换”；在英国语境中也可能指“交通部”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Discrete Fourier Transform) A mathematical method that converts a sequence of time- or space-based data into frequencies, widely used in signal processing (audio, images, communications).","zh":"（离散傅里叶变换）一种把时间/空间中的离散数据转换到“频率”表示的方法，广泛用于信号处理（音频、图像、通信等）。"},"examples":[{"en":"We used the DFT to analyze which frequencies were present in the sound recording.","zh":"我们用 DFT 来分析这段录音里包含哪些频率。"},{"en":"In image processing, a 2D DFT can reveal repeating patterns in a picture.","zh":"在图像处理中，二维 DFT 可以揭示图片中的重复纹理/周期性模式。"},{"en":"The FFT is a fast algorithm for computing the DFT.","zh":"FFT 是一种快速计算 DFT 的算法。"}]},{"partOfSpeech":"n.","definition":{"en":"(UK) Department for Transport; the government department responsible for transport policy.","zh":"（英国）交通部（Department for Transport）；负责交通政策的政府部门。"},"examples":[{"en":"The DFT released new guidance on rail safety.","zh":"英国交通部（DFT）发布了新的铁路安全指南。"},{"en":"According to the DFT, traffic levels have increased this year.","zh":"根据英国交通部（DFT）的数据，今年交通流量有所上升。"}]}],"synonyms":["Discrete Fourier Transform","Department for Transport"],"phonetic":"/ˌdiː ɛf ˈtiː/","extraExplanation":["在工程/编程语境里，DFT 几乎默认指“离散傅里叶变换”。你常会看到：DFT（概念/变换本身） vs. FFT（用来更快算出 DFT 的算法）。","写作时首次出现通常会写全称再括号缩写：Discrete Fourier Transform (DFT)。之后再用 DFT。","如果在英国新闻或政策文件里看到 DFT，也可能是 Department for Transport；是否指政府部门通常可以从上下文（铁路、道路政策、政府报告等）判断。"]}
{"word":"dft","summary":{"en":"DFT usually means Discrete Fourier Transform; in some contexts it can also mean Density Functional Theory or Design for Test(ability).","zh":"DFT 通常指离散傅里叶变换；在某些语境下也可指密度泛函理论或可测试性设计。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Most common in engineering) the discrete Fourier transform: a mathematical method that converts a finite set of time- or space-based data into frequencies.","zh":"（工程领域最常见）离散傅里叶变换：一种把有限个时域/空域数据转换到频域（频率成分）的数学方法。"},"examples":[{"en":"We used the DFT to find the main frequencies in the audio signal.","zh":"我们用 DFT 找出音频信号中的主要频率成分。"},{"en":"The DFT helps analyze vibration data from the machine.","zh":"DFT 有助于分析机器的振动数据。"}]},{"partOfSpeech":"n.","definition":{"en":"(Common in chemistry/physics) density functional theory: a computational approach used to model the electronic structure of atoms, molecules, and materials.","zh":"（化学/物理常见）密度泛函理论：一种用于模拟原子、分子与材料电子结构的计算方法。"},"examples":[{"en":"They ran a DFT calculation to estimate the molecule’s stability.","zh":"他们做了 DFT 计算来估计该分子的稳定性。"},{"en":"DFT is widely used in materials science research.","zh":"DFT 在材料科学研究中被广泛使用。"}]},{"partOfSpeech":"n.","definition":{"en":"(In chip design/testing) design for test(ability): planning a circuit so it can be tested more easily and reliably.","zh":"（芯片设计/测试）可测试性设计：在设计电路时加入结构/方法，让测试更容易、更可靠。"},"examples":[{"en":"Good DFT practices can reduce the time needed for production testing.","zh":"良好的 DFT 做法可以减少量产测试所需时间。"},{"en":"The team added scan chains as part of the DFT strategy.","zh":"团队把扫描链作为 DFT 策略的一部分加入设计。"}]}],"synonyms":["Discrete Fourier Transform","Density Functional Theory","Design for Testability"],"phonetic":"/ˌdiː ɛf ˈtiː/","extraExplanation":["“DFT”是缩写，读法通常按字母逐个读：D-F-T。具体含义高度依赖语境：信号处理/图像处理里多指离散傅里叶变换；计算化学/凝聚态物理里多指密度泛函理论；半导体行业里常指可测试性设计。","如果你能告诉我你看到“DFT”的句子或领域（音频/图像、化学、芯片等），我可以帮你锁定最准确的意思并补充相关词汇（如 FFT、Fourier series、ab initio、scan chain）。"]}
{"word":"DFW","summary":{"en":"DFW most commonly means the Dallas–Fort Worth area or Dallas Fort Worth International Airport; it can also refer to writer David Foster Wallace.","zh":"DFW 最常指达拉斯—沃斯堡地区或达拉斯—沃斯堡国际机场；也可指作家大卫·福斯特·华莱士。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"the Dallas–Fort Worth area in Texas (the DFW Metroplex)","zh":"美国德克萨斯州的达拉斯—沃斯堡都会区（DFW 大都会圈/Metroplex）"},"examples":[{"en":"I grew up in DFW, so I’m used to driving long distances.","zh":"我在 DFW 长大，所以习惯开很长的路。"},{"en":"DFW has a big job market in tech and aviation.","zh":"DFW 的科技和航空行业就业机会很多。"}]},{"partOfSpeech":"other","definition":{"en":"Dallas Fort Worth International Airport (airport code: DFW)","zh":"达拉斯—沃斯堡国际机场（机场代码：DFW）"},"examples":[{"en":"My flight connects through DFW tonight.","zh":"我今晚要在 DFW 转机。"},{"en":"I’ll meet you at DFW Terminal D.","zh":"我在 DFW 的 D 航站楼跟你碰面。"}]},{"partOfSpeech":"other","definition":{"en":"David Foster Wallace, an American writer (often abbreviated as DFW)","zh":"大卫·福斯特·华莱士，美国作家（常简称 DFW）"},"examples":[{"en":"DFW is best known for the novel Infinite Jest.","zh":"DFW 最有名的作品是小说《无尽的玩笑》。"},{"en":"In class we discussed DFW’s essay “This Is Water.”","zh":"课上我们讨论了 DFW 的文章《这就是水》。"}]}],"synonyms":["Dallas–Fort Worth","DFW Airport","Dallas Fort Worth International Airport","DFW Metroplex","David Foster Wallace"],"phonetic":"/ˌdiː ɛf ˈdʌbəl.juː/","extraExplanation":["在美国日常语境里，DFW 最常见的两种用法是：①机场代码（写在机票、行李牌上）；②指“Dallas–Fort Worth Metroplex”这片城市群。是否加冠词取决于用法：说机场常用“DFW”，也会说“DFW Airport”；说地区时常说“in DFW”。","作为作家简称时，多见于阅读/写作/学术讨论中（尤其在美国高校语境）。"]}
