{"word":"DG","summary":{"en":"DG is an abbreviation; most commonly it means Director-General, but it can mean other things depending on context.","zh":"DG是缩写；最常见指Director-General（总干事/总司长等），也可能因语境不同而有其他含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Director-General” (or “Director General”), the head of an organization, especially in government or international bodies","zh":"“Director-General / Director General（总干事/总司长/总局长等）”的缩写，指机构的最高负责人，常见于政府或国际组织"},"examples":[{"en":"The DG announced a new policy at the meeting.","zh":"总干事在会议上宣布了一项新政策。"},{"en":"She works in the DG’s office.","zh":"她在总干事办公室工作。"}]},{"partOfSpeech":"other","definition":{"en":"(informal, texting) short for “dear (girlfriend),” used when talking about someone’s girlfriend","zh":"（非正式，短信/网络）“dear girlfriend（亲爱的女友）”的缩写，用来指某人的女朋友"},"examples":[{"en":"My DG is visiting this weekend.","zh":"我女朋友这周末要来。"},{"en":"He posted a photo with his DG.","zh":"他发了一张和女朋友的合照。"}]},{"partOfSpeech":"other","definition":{"en":"(varies by context) a general abbreviation that can mean different things in different fields (e.g., “damage” in games, “degree” in technical notes)","zh":"（视语境而定）在不同领域可能代表不同含义的缩写（例如游戏里指“damage 伤害”，技术笔记里可能指“degree 度数”）"},"examples":[{"en":"In this game chat, DG often means damage.","zh":"在这个游戏聊天里，DG常常指伤害。"},{"en":"The manual uses DG for degree in a few tables.","zh":"说明书在一些表格里用DG表示度数。"}]}],"synonyms":["Director-General","D.G."],"phonetic":"/ˌdiː ˈdʒiː/","extraExplanation":["“DG”不是一个固定单词，而是缩写；最准确的含义通常要看上下文（政府/国际组织、聊天语境、专业领域等）。","正式写作中建议写全称（如 Director-General），并在首次出现时注明缩写：Director-General (DG)。"]}
{"word":"dG","summary":{"en":"DG (or dG) is usually an abbreviation meaning things like Director General, Dangerous Goods, or (in the EU) Directorate-General, depending on context.","zh":"DG（或 dG）通常是缩写，常见含义包括“总干事/总司长（Director General）”“危险品（Dangerous Goods）”或（欧盟语境）“总司（Directorate-General）”，需看上下文。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a written abbreviation (letters) read as “D-G,” used in different fields; the exact meaning depends on context.","zh":"一个由字母组成的缩写（读作“D-G”），在不同领域含义不同，需结合上下文判断。"},"examples":[{"en":"What does “DG” stand for in this email?","zh":"这封邮件里的“DG”是什么意思？"},{"en":"Please write the full term the first time you use “DG.”","zh":"第一次使用“DG”时请先写出全称。"}]},{"partOfSpeech":"n.","definition":{"en":"(common) Director General: the top leader of an organization or government department.","zh":"（常见）Director General：某个机构或政府部门的最高负责人/总干事。"},"examples":[{"en":"The Director General approved the new policy.","zh":"总干事批准了新政策。"},{"en":"She met with the DG of the agency.","zh":"她与该机构的总干事会面。"}]},{"partOfSpeech":"n.","definition":{"en":"(logistics/transport) Dangerous Goods: items that can be hazardous during shipping (for example, batteries or chemicals).","zh":"（物流/运输）Dangerous Goods：运输过程中可能造成危险的货物（如电池、化学品）。"},"examples":[{"en":"This package contains DG and must be labeled correctly.","zh":"这个包裹含有危险品，必须正确贴标。"},{"en":"Airlines have strict rules for shipping DG.","zh":"航空公司对运输危险品有严格规定。"}]},{"partOfSpeech":"n.","definition":{"en":"(EU context) Directorate-General: a major department within the European Commission.","zh":"（欧盟语境）Directorate-General：欧盟委员会下设的主要部门（“总司”）。"},"examples":[{"en":"The proposal was reviewed by a DG within the European Commission.","zh":"该提案由欧盟委员会的一个总司审查。"}]}],"synonyms":["abbrev.","initialism","acronym (general term)"],"phonetic":"/diː dʒiː/","extraExplanation":["“dG / DG”本身不是一个固定单词，更像是缩写。最可靠的方法是看它出现的领域：在政府/机构文件里常指 Director General；在物流与航空运输里常指 Dangerous Goods；在欧盟文件里常指 Directorate-General。","读法通常按字母读：D-G。写作时如果面向不熟悉缩写的读者，建议第一次出现时写出全称（例如：Director General (DG)）。"]}
{"word":"dg","summary":{"en":"“dg” most commonly refers to the unit “decigram” (0.1 g). In uppercase (DG), it can mean “Director-General.”","zh":"“dg”常指质量单位“分克”（0.1克）；大写“DG”也可指“Director-General（总干事/总司长）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"abbreviation for decigram: a unit of mass equal to one-tenth (0.1) of a gram.","zh":"缩写：decigram（分克），质量单位，等于 0.1 克。"},"examples":[{"en":"Add 5 dg of salt to the solution.","zh":"在溶液中加入 5 分克的盐。"},{"en":"The label says 20 dg per serving.","zh":"标签上写着每份 20 分克。"}]},{"partOfSpeech":"other","definition":{"en":"DG: abbreviation for Director-General, a high-ranking manager (often the head of a government department or international organization).","zh":"DG：Director-General 的缩写，指“总干事/总司长”等高级负责人（常见于政府部门或国际组织）。"},"examples":[{"en":"The DG will announce the new policy tomorrow.","zh":"总干事将于明天宣布新政策。"},{"en":"She met with the DG of the agency.","zh":"她会见了该机构的总干事。"}]}],"synonyms":["decigram","Director-General"],"phonetic":"/ˌdiː ˈdʒiː/","extraExplanation":["“dg”作为“分克”的用法在英语日常生活中不算常见，更常见的是写成“g（克）”或用毫克“mg”。在科学或某些欧洲语境的配方/营养标示里偶尔会见到“dg”。","写作中如果你想表达“Director-General”，首次出现通常建议写全称“Director-General (DG)”，之后再用缩写更清楚。"]}
{"word":"DGA","summary":{"en":"DGA most often means the Directors Guild of America; it can also refer to the EU Data Governance Act, and informally online it may mean “don’t go anywhere.”","zh":"DGA最常指“美国导演工会”；也可指欧盟《数据治理法案》；在网络语境下还可能表示“别走开/稍等”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Directors Guild of America: a labor union that represents film and television directors and other members of the directing team in the United States.","zh":"美国导演工会：代表美国电影、电视导演及导演团队相关人员的行业工会（劳工组织）。"},"examples":[{"en":"The director joined the DGA after working on a major studio film.","zh":"这位导演在参与一部大型制片厂电影后加入了DGA（美国导演工会）。"},{"en":"The DGA awards are often seen as a strong predictor of the Academy Awards for Best Director.","zh":"DGA奖常被视为奥斯卡最佳导演奖的重要风向标。"}]},{"partOfSpeech":"other","definition":{"en":"Data Governance Act: an European Union law aimed at improving the sharing and reuse of data across the EU.","zh":"《数据治理法案》：欧盟的一项法律，旨在促进欧盟范围内数据共享与再利用。"},"examples":[{"en":"The company updated its policies to align with the EU’s DGA.","zh":"该公司更新了政策以符合欧盟《数据治理法案》（DGA）。"},{"en":"Under the DGA, public-sector data may be made available for reuse under certain conditions.","zh":"根据DGA，公共部门数据在特定条件下可以提供再利用。"}]},{"partOfSpeech":"other","definition":{"en":"(informal, online) “Don’t go anywhere”: used to tell someone to wait or stay tuned, especially in chats or livestreams.","zh":"（非正式网络用语）“别走/别走开”：用于让对方稍等或继续关注，常见于聊天或直播。"},"examples":[{"en":"DGA—I'll be right back with the link.","zh":"DGA——我马上带链接回来。"},{"en":"DGA, the best part is coming next.","zh":"别走开，最精彩的部分马上来。"}]}],"synonyms":["Directors Guild of America","Data Governance Act","stay tuned (similar meaning)"],"phonetic":"/ˌdiː dʒiː ˈeɪ/","extraExplanation":["“DGA”最常见的含义是美国导演工会，尤其在影视行业新闻、奖项报道（DGA Awards）和从业者简历中非常常见。","在欧盟政策语境里，“DGA”通常指《数据治理法案》（Data Governance Act），与“GDPR（通用数据保护条例）”不同：GDPR更关注隐私与个人数据保护，DGA更侧重数据共享与流通机制。","作为网络缩写，“DGA=Don’t go anywhere”属于非正式用法，理解上类似“BRB（马上回来）/stay tuned（敬请期待）”，但并非人人都用，最好根据上下文判断。"]}
{"word":"dgag","summary":{"en":"“dgag” is not a standard English word; it’s likely a typo or a context-specific acronym.","zh":"“dgag”不是标准英语单词；更可能是拼写错误或特定语境下的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a typo, a random string, or an acronym used in a specific context.","zh":"不是标准英语单词。可能是拼写错误、随机字母串，或在特定语境中的缩写。"},"examples":[{"en":"I think “dgag” might be a typo—did you mean “gag” or “drag”?","zh":"我觉得“dgag”可能是打错了——你想写的是“gag（开玩笑/塞住口）”还是“drag（拖拽/拖累）”吗？"},{"en":"If “DGAG” is an acronym, please tell me what field it comes from (gaming, medicine, school, etc.).","zh":"如果“DGAG”是缩写，请告诉我它来自哪个领域（游戏、医学、学校等）。"}]}],"extraExplanation":["目前在常见词典与通用英语中找不到“dgag”。如果你提供一句包含它的例句、你想表达的中文意思，或它出现的场景（聊天/游戏/课程/专业领域），我可以帮你判断它最可能是什么。"]}
{"word":"dghaisa","summary":{"en":"“dghaisa” isn’t recognized as a common English word; please provide context or confirm spelling.","zh":"“dghaisa”不是常见英语词；请提供语境或确认拼写以便解释。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a name, or a word from another language.","zh":"不是标准英语单词；可能是拼写错误、人名/地名，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “dghaisa” in an English dictionary—could you share the sentence it’s from?","zh":"我在英语词典里找不到“dghaisa”，你能把它所在的句子发我吗？"},{"en":"If it’s a name, the spelling may vary depending on the language and system of romanization.","zh":"如果它是名字，不同语言或不同转写方式可能会有不同拼法。"}]}],"phonetic":"/ˈdiːdʒiːˌeɪsə/","extraExplanation":["我没有在常见英语词典/语料中查到“dghaisa”。为了帮你准确解释，请你提供：①它出现的完整句子或上下文；②你想表达的意思（例如某种物品/人名/地名/俚语）；③是否可能拼错（比如多打/少打了字母）。","也可能是转写（把阿拉伯语、柏柏尔语、印地语等写成拉丁字母）造成的拼法不固定；提供来源语言或地区会更容易判断。"]}
{"word":"DGP","summary":{"en":"DGP is most commonly an abbreviation for Director General of Police (India), but it can also mean Data Governance Platform (tech) or Distributed Generation Project/Program (energy), depending on context.","zh":"DGP最常见是“警察总监／警察总长”（印度语境）的缩写；在不同语境下也可能指“数据治理平台”（科技）或“分布式发电项目/计划”（能源）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) Director General of Police: the highest-ranking police officer in a state (commonly used in India).","zh":"（缩写）警察总监／警察总长：一个邦（州）警察系统中最高级别的警官（常见于印度语境）。"},"examples":[{"en":"The Chief Minister appointed a new DGP after the retirement of the previous one.","zh":"首席部长在前任退休后任命了一位新的DGP（警察总监）。"},{"en":"The DGP ordered increased security for the festival.","zh":"DGP（警察总监）下令在节日期间加强安保。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., tech/business) Data Governance Platform: a system used to manage data rules, quality, access, and compliance in an organization.","zh":"（缩写，科技／商业）数据治理平台：用于管理组织内数据规则、质量、访问权限与合规的系统。"},"examples":[{"en":"Our company adopted a DGP to control who can access customer data.","zh":"我们公司采用了DGP（数据治理平台）来控制谁可以访问客户数据。"},{"en":"A DGP can help track where sensitive data is stored and used.","zh":"DGP（数据治理平台）可以帮助追踪敏感数据存储在哪里、如何被使用。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., energy) Distributed Generation Project/Program: a plan or initiative involving small, local power sources (like solar panels).","zh":"（缩写，能源）分布式发电项目／计划：涉及小型、本地供电来源（如太阳能板）的项目或倡议。"},"examples":[{"en":"The city funded a DGP to expand rooftop solar power.","zh":"该市资助了一个DGP（分布式发电项目）来扩大屋顶太阳能。"},{"en":"This DGP focuses on local energy production to reduce grid pressure.","zh":"这个DGP（分布式发电计划）关注本地发电，以减轻电网压力。"}]}],"synonyms":["Director General of Police","data governance platform","distributed generation project"],"phonetic":"/ˌdiː dʒiː ˈpiː/","extraExplanation":["“DGP”最常见的公共事务含义是印度的警察职务缩写（Director General of Police），新闻报道里经常直接写DGP，不再展开全称。","在不同领域里，DGP可能代表很多东西（尤其在公司/技术文档中）。如果你能告诉我你看到它的句子或领域（例如新闻、IT、能源、学校等），我可以帮你确定最准确的意思。"]}
{"word":"DGSC","summary":{"en":"DGSC is an initialism read as “D-G-S-C,” and it can refer to different organizations (e.g., a government contracts office, a data governance committee, or a graduate student council) depending on context.","zh":"DGSC 是逐字母读作 “D-G-S-C” 的缩略词，具体指代会因语境而异（例如政府合同采购机构、数据治理委员会或研究生学生组织等）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An initialism (a set of letters) whose exact meaning depends on the field or organization; it is usually read letter by letter: “D-G-S-C.”","zh":"一个首字母缩略词（字母组合），具体含义取决于行业或机构；通常逐个字母读作“D-G-S-C”。"},"examples":[{"en":"What does DGSC stand for in this document?","zh":"DGSC 在这份文件里代表什么？"},{"en":"Please clarify DGSC before we proceed.","zh":"在继续之前请先说明 DGSC 的含义。"}]},{"partOfSpeech":"other","definition":{"en":"(India, defense procurement) Director General of Supply and Contracts: an official office/title related to government purchasing and contracts (usage may vary by context).","zh":"（印度/国防采购语境）Director General of Supply and Contracts：与政府采购与合同相关的机构/职务名称（不同语境用法可能不同）。"},"examples":[{"en":"The DGSC issued guidelines for vendor registration.","zh":"DGSC 发布了供应商登记的指南。"}]},{"partOfSpeech":"other","definition":{"en":"(Business/organizations) Data Governance Steering Committee: a committee that guides policies for managing data (common in corporate contexts).","zh":"（企业/组织）Data Governance Steering Committee：负责制定与推动数据管理政策的指导委员会（企业语境中较常见）。"},"examples":[{"en":"The DGSC approved the new data retention policy.","zh":"DGSC 批准了新的数据保留政策。"}]},{"partOfSpeech":"other","definition":{"en":"(Universities, possible) Departmental Graduate Student Council: a student body representing graduate students within a department (name varies by school).","zh":"（大学语境，可能用法）Departmental Graduate Student Council：院系层面的研究生学生会/代表组织（各校名称可能不同）。"},"examples":[{"en":"The DGSC is collecting feedback from graduate students.","zh":"DGSC 正在收集研究生的反馈意见。"}]}],"synonyms":["initialism","abbreviation"],"phonetic":"/ˌdiː dʒiː ˌɛs ˈsiː/","extraExplanation":["“DGSC”是典型的首字母缩略词（initialism），不像“NASA”那样当作一个词读，而是逐个字母读。","这种缩略词在不同机构会有不同扩展含义；如果你告诉我出现它的国家/行业/句子，我可以帮你锁定最准确的释义与对应中文译法。"]}

