{"word":"DH","summary":{"en":"“DH” is an abbreviation most commonly meaning “designated hitter” in baseball or “dear husband” online; it can also mean a humanities doctorate or a domestic helper depending on context.","zh":"“DH”是缩写，最常见指棒球的“指定打击”或网络用语“亲爱的老公”；也可能指人文学科博士或家政助理，需看语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Designated hitter (baseball): a player who bats instead of the pitcher and usually does not play defense.","zh":"（棒球）指定打击：代替投手上场打击、通常不负责守备的球员/位置。"},"examples":[{"en":"Shohei Ohtani often plays as the DH when he isn’t pitching.","zh":"大谷翔平在不投球时经常担任DH（指定打击）。"},{"en":"The team added a veteran DH to strengthen the lineup.","zh":"球队引进了一位资深DH来加强打线。"}]},{"partOfSpeech":"other","definition":{"en":"Dear husband: used online (texts, forums) to refer to one’s husband, often affectionately.","zh":"（网络/短信）亲爱的老公：用来称呼自己的丈夫，带有亲昵称呼的感觉。"},"examples":[{"en":"DH is cooking dinner tonight.","zh":"DH（亲爱的老公）今晚做晚饭。"},{"en":"I talked to my DH about our weekend plans.","zh":"我和DH聊了我们的周末计划。"}]},{"partOfSpeech":"other","definition":{"en":"Doctor of Humanities: an academic degree abbreviation.","zh":"（学位）人文学科博士（Doctor of Humanities）的缩写。"},"examples":[{"en":"She earned a DH after years of research in literature.","zh":"她在文学研究多年后获得了DH（人文学科博士）学位。"}]},{"partOfSpeech":"other","definition":{"en":"Domestic helper: used in some regions to refer to a household worker.","zh":"（部分地区用法）家政助理/家佣：指从事家务工作的雇员。"},"examples":[{"en":"They hired a DH to help with childcare and cleaning.","zh":"他们雇了一个DH（家政助理）来帮忙带孩子和打扫。"}]}],"synonyms":["designated hitter","dear husband"],"phonetic":"/diː eɪtʃ/","extraExplanation":["“DH”最常见的读法是按字母读 /diː eɪtʃ/，具体意思高度依赖语境：体育新闻里多指棒球的 designated hitter；论坛/聊天记录里常见为 dear husband。","棒球里的 DH 是美式英语中非常常见的缩写，尤其在 MLB（美国职棒）相关内容里；如果你看到“as DH”“the DH spot”，基本就是指这个位置。","网络用语里的 DH 多见于育儿论坛、家庭生活话题（例如与“DS=dear son, DD=dear daughter”一起出现），属于圈内简写，不建议在正式写作中使用。"]}
{"word":"dh","summary":{"en":"“DH” is a common abbreviation meaning designated hitter (baseball), dental hygienist, or (online) dear husband, depending on context.","zh":"“DH”是常见缩写，常指棒球的“指定打击”、牙科的“牙科保健师/洁治师”，或网络语境里的“亲爱的老公/我老公”，具体看语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “designated hitter” (a baseball player who bats instead of the pitcher)","zh":"“designated hitter（指定打击）”的缩写：棒球中专门负责打击、代替投手上场打击的球员"},"examples":[{"en":"In the American League, the DH usually bats in the middle of the lineup.","zh":"在美联球队里，DH 通常会排在打线的中间棒次。"},{"en":"He was used as a DH to protect his arm from pitching.","zh":"球队让他当 DH，是为了避免他投球时伤到手臂。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “dental hygienist” (a healthcare professional who cleans teeth and helps prevent gum disease)","zh":"“dental hygienist（牙科保健师/牙科洁治师）”的缩写：负责洁牙、口腔保健与预防牙周问题的专业人员"},"examples":[{"en":"The DH cleaned my teeth and explained how to floss properly.","zh":"牙科保健师帮我洁牙，并讲解了正确的使用牙线方法。"},{"en":"Ask the DH if you have sensitive gums.","zh":"如果你牙龈敏感，可以问问牙科保健师。"}]},{"partOfSpeech":"other","definition":{"en":"internet shorthand for “dear husband” (used in casual online writing)","zh":"网络简写，表示“亲爱的老公/我老公”（常见于随笔、论坛等非正式语境）"},"examples":[{"en":"DH cooked dinner tonight, so I’m doing the dishes.","zh":"我老公今晚做饭，所以我来洗碗。"},{"en":"My DH and I are planning a weekend trip.","zh":"我和我老公在计划周末旅行。"}]}],"synonyms":["designated hitter","dental hygienist","dear husband"],"phonetic":"diː eɪtʃ","extraExplanation":["“DH”最常见的理解取决于场景：谈棒球多半是 designated hitter；在牙科或医疗场景常指 dental hygienist；在英文论坛/育儿社区等较口语的网络文本中，DH 也常被当作 dear husband。","读音通常按字母读（D-H）。如果你告诉我具体语境（例如聊天、医疗、体育或工程），我可以给出最准确的释义。"]}
{"word":"DHA","summary":{"en":"DHA usually means docosahexaenoic acid, an omega-3 fatty acid important for brain and eye health; it can also be an acronym for organizations depending on context.","zh":"DHA通常指二十二碳六烯酸，一种对大脑与眼部健康重要的Omega-3脂肪酸；也可能是机构名称缩写，需看语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Docosahexaenoic acid: an omega-3 fatty acid found in fish and algae, often taken as a supplement and important for brain and eye development and function.","zh":"二十二碳六烯酸（DHA）：一种Omega-3脂肪酸，常见于鱼类与藻类，也常作为营养补充剂，被认为对大脑与视力（眼部）发育和功能很重要。"},"examples":[{"en":"Many prenatal vitamins include DHA to support fetal brain development.","zh":"许多孕期复合维生素会添加DHA，以支持胎儿大脑发育。"},{"en":"She takes an algae-based DHA supplement because she doesn’t eat fish.","zh":"她不吃鱼，所以改用藻油来源的DHA补充剂。"},{"en":"The label lists 200 mg of DHA per capsule.","zh":"标签上写着每粒含有200毫克DHA。"}]},{"partOfSpeech":"n.","definition":{"en":"Acronym used in names of organizations or government departments (meaning depends on context).","zh":"用于机构或政府部门名称的缩写（具体含义取决于语境）。"},"examples":[{"en":"Check the DHA website for the latest updates.","zh":"查看DHA官网获取最新信息。"},{"en":"He works for the DHA in his country.","zh":"他在本国的DHA部门工作。"}]}],"synonyms":["docosahexaenoic acid","omega-3 fatty acid","D-H-A"],"phonetic":"/ˌdiː eɪtʃ ˈeɪ/","extraExplanation":["在营养与保健语境里，DHA通常和EPA一起出现（都属于Omega-3）。常见来源包括深海鱼（如三文鱼、沙丁鱼）与藻油；“藻油DHA”常被用于素食者或不吃鱼的人群。","日常英语里“DHA”多读作字母拼读（D-H-A），写作大写；在不同国家或行业中也可能代表不同机构名称，因此最好结合上下文确认。"]}
{"word":"dha","summary":{"en":"DHA most commonly means docosahexaenoic acid, an omega-3 fatty acid; it can also be an abbreviation for certain organizations depending on context.","zh":"DHA 最常指二十二碳六烯酸（一种 Omega-3 脂肪酸）；也可能在不同语境中作为某些机构的缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Docosahexaenoic acid: an omega-3 fatty acid found in fish and algae, often taken as a supplement to support brain and eye health.","zh":"二十二碳六烯酸（DHA）：一种存在于鱼类和藻类中的 Omega-3 脂肪酸，常作为营养补充剂，被认为有助于大脑与视力健康。"},"examples":[{"en":"Many prenatal vitamins include DHA.","zh":"许多孕妇维生素里会添加 DHA。"},{"en":"Salmon is a good natural source of DHA.","zh":"三文鱼是 DHA 的良好天然来源。"},{"en":"She takes DHA every day for general wellness.","zh":"她每天补充 DHA 来保持整体健康。"}]},{"partOfSpeech":"n.","definition":{"en":"An abbreviation used in some fields for specific organizations (for example, the U.S. Defense Health Agency). The meaning depends on the context.","zh":"在某些领域中用作机构名称的缩写（例如美国国防健康局 Defense Health Agency）。具体含义取决于语境。"},"examples":[{"en":"He works for the DHA as a civilian analyst.","zh":"他在 DHA 工作，是一名文职分析员。"},{"en":"Check the DHA guidelines for medical referrals.","zh":"查看 DHA 的转诊指南。"}]}],"synonyms":["docosahexaenoic acid","omega-3"],"phonetic":"/ˌdiː eɪtʃ ˈeɪ/","extraExplanation":["在健康与营养语境里，DHA 最常指“二十二碳六烯酸”。它常与 EPA 一起出现（同为 Omega-3），很多产品会写成“EPA/DHA”。","DHA 的常见来源包括深海鱼（如三文鱼、沙丁鱼）以及藻油（适合不吃鱼或素食者）。","在医学或保健品讨论中，DHA 常被提到与孕期/婴幼儿脑部与视网膜发育有关；但具体是否需要补充、补充量多少，最好结合个人饮食与医生建议。"]}
{"word":"dhaba","summary":{"en":"A dhaba is a simple roadside restaurant in South Asia, popular with travelers for affordable local food and tea.","zh":"dhaba 指南亚常见的路边小餐馆，常为旅客提供平价的本地家常菜和茶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A casual roadside restaurant (common in India, Pakistan, and nearby regions), often serving simple, hearty local food and tea.","zh":"（南亚常见的）路边小饭馆/小餐馆（常见于印度、巴基斯坦等地），通常提供朴实、分量足的家常菜和奶茶/茶。"},"examples":[{"en":"We stopped at a dhaba for chai and hot parathas during the road trip.","zh":"公路旅行时，我们在一家 dhaba 停下来喝奶茶、吃热腾腾的帕拉塔。"},{"en":"Many dhabas stay open late to serve truck drivers and travelers.","zh":"很多 dhaba 会营业到很晚，方便卡车司机和旅客。"},{"en":"The dhaba near the highway is famous for its spicy dal.","zh":"高速路附近那家 dhaba 以香辣的扁豆汤而出名。"}]}],"synonyms":["roadside restaurant","truck stop (approx.)","café (approx.)"],"phonetic":"/ˈdɑːbə/","extraExplanation":["“dhaba”是南亚英语里很常见的外来词，来源于旁遮普语/印地语等语言环境中的用法，带有强烈的地域与文化色彩。它通常让人联想到公路、长途旅行、卡车司机、简朴但味道浓的家常菜（如 dal、roti、paratha、咖喱等），有时也会有露天座位和比较随意的服务方式。"]}
{"word":"dhabb","summary":{"en":"“dhabb” is not a standard English word; it is most likely a misspelling of “dhaba,” a simple roadside restaurant in Indian English.","zh":"“dhabb”不是标准英文词；最可能是“dhaba”的误拼，指印度英语里常见的简朴路边餐馆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard spelling) A likely misspelling of “dhaba,” a simple roadside restaurant (common in Indian English).","zh":"（非标准拼写）很可能是“dhaba”的拼写错误；指一种简朴的路边餐馆（常见于印度英语）。"},"examples":[{"en":"We stopped at a dhaba for chai and parathas.","zh":"我们在一家 dhaba 停下来喝奶茶、吃印度煎饼。"},{"en":"If you mean a roadside eatery in India, the usual spelling is “dhaba,” not “dhabb.”","zh":"如果你指的是印度的路边小餐馆，常见拼写是“dhaba”，不是“dhabb”。"}]}],"synonyms":["dhaba","roadside eatery","truck stop restaurant"],"phonetic":"ˈdɑːbə","extraExplanation":["“dhaba”多见于印度及周边地区的英语语境，指提供家常、价格实惠食物的路边小馆子。英文里一般不写成“dhabb”。如果你看到“dhabb”出现在某个特定文本或名字里，也可能是专有名词（如店名、用户名）或另一种语言的转写。你可以把原句发我，我能帮你判断具体意思。"]}
{"word":"Dhabi","summary":{"en":"“Dhabi” is an Arabic word meaning “gazelle,” best known from the place name “Abu Dhabi.”","zh":"“Dhabi”是阿拉伯语，意为“瞪羚/羚羊”，最常见于地名“Abu Dhabi（阿布扎比）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Arabic) “gazelle”; commonly seen in the place name “Abu Dhabi,” meaning “Father of the Gazelle.”","zh":"（阿拉伯语）“瞪羚/羚羊”；常见于地名“Abu Dhabi（阿布扎比）”，意为“瞪羚之父/羚羊之父”。"},"examples":[{"en":"Abu Dhabi is the capital of the United Arab Emirates.","zh":"阿布扎比是阿拉伯联合酋长国的首都。"},{"en":"The word “Dhabi” comes from Arabic and refers to a gazelle.","zh":"“Dhabi”源自阿拉伯语，指的是瞪羚。"}]}],"synonyms":["gazelle"],"phonetic":"/ˈdɑːbi/","extraExplanation":["“Dhabi”通常不会单独当作英文词来使用，多见于专有名词“Abu Dhabi”。在英语里它一般被当作地名的一部分，而不是日常可独立使用的普通名词。","如果你在英文句子里看到单独的“Dhabi”，很可能是简写（口语/标题）或指代“Abu Dhabi”的一部分。正式写作中通常建议写全名“Abu Dhabi”。"]}
{"word":"Dhahran","summary":{"en":"Dhahran is a city in eastern Saudi Arabia, widely associated with the country’s oil and energy industry.","zh":"Dhahran（达兰）是沙特阿拉伯东部的一座城市，常与石油与能源产业联系在一起。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a city in the Eastern Province of Saudi Arabia, known for its major role in the oil industry and for being near the headquarters of Saudi Aramco","zh":"沙特阿拉伯东部省的一座城市，以石油产业闻名，并靠近沙特阿美（Saudi Aramco）总部所在地"},"examples":[{"en":"Dhahran is in the Eastern Province of Saudi Arabia.","zh":"达兰位于沙特阿拉伯的东部省。"},{"en":"Many oil and engineering jobs in the region are based in Dhahran.","zh":"该地区许多石油与工程相关的工作都集中在达兰。"}]}],"phonetic":"/dəˈhɑːrɑːn/","extraExplanation":["Dhahran 常与 Dammam（达曼）和 Al Khobar/Khobar（胡拜尔）一起被提到，这三座城市构成沙特东部重要的城市群与商业区。","在英语新闻与商业语境里，Dhahran 往往与“oil (石油) / energy (能源) / Saudi Aramco (沙特阿美)”等词一起出现，因此它的地名含义常带有“能源产业中心”的联想。","拼写上 Dhahran 属于英文对阿拉伯语地名的转写（transliteration），不同来源可能会看到轻微差异，但最常见写法是 Dhahran。"]}
{"word":"dhai","summary":{"en":"dhai = “two and a half” (2.5), a transliteration from Hindi/Urdu.","zh":"dhai 表示“两点五/两个半”（2.5），通常是印地语/乌尔都语的转写。"},"definitions":[{"partOfSpeech":"num.","definition":{"en":"(Hindi/Urdu loanword, transliterated) the number “two and a half” (2.5).","zh":"（印地语/乌尔都语外来词的拉丁字母拼写）“两点五；两个半”（2.5）。"},"examples":[{"en":"In Hindi, dhai means “two and a half.”","zh":"在印地语里，dhai 的意思是“两点五/两个半”。"},{"en":"The recipe needs dhai cups of milk (2.5 cups).","zh":"这个食谱需要 dhai 杯牛奶（2.5 杯）。"}]}],"synonyms":["two and a half","2.5","two-and-a-half"],"phonetic":"/dɑɪ/","extraExplanation":["“dhai”通常是把印地语/乌尔都语“ढाई/ڈھائی”（意思是2.5）用拉丁字母写出来的形式。在英文语境里，它多见于与南亚语言、文化相关的内容（例如对话字幕、学习资料、菜谱翻译等），并不是常见的标准英语单词。","发音在不同转写系统中会有差异；原语言里开头的“dh-”带一点送气/浊音色彩，英语里常被近似读成类似“die”的音。"]}
{"word":"dhak","summary":{"en":"Dhak usually means a traditional South Asian drum; it can also refer to the “flame of the forest” tree in India.","zh":"Dhak 通常指一种南亚传统大鼓；也可指印度的“森林之焰”（Butea monosperma）这种树。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asia) A large barrel-shaped drum, often used in Bengali and other regional festivals and folk music.","zh":"（南亚）一种大型桶状鼓，常见于孟加拉等地区的节庆与民间音乐中。"},"examples":[{"en":"During Durga Puja, the dhak is played in the streets to build excitement.","zh":"在杜尔迦女神节期间，人们会在街头敲奏 dhak 来烘托气氛。"},{"en":"The dancers moved faster when the dhak rhythms got louder.","zh":"当 dhak 的节奏更响时，舞者的动作也更快了。"}]},{"partOfSpeech":"n.","definition":{"en":"(India) A tree (Butea monosperma), also called the “flame of the forest,” known for its bright orange-red flowers.","zh":"（印度）一种树（学名 Butea monosperma），也叫“森林之焰”，以鲜艳的橙红色花朵闻名。"},"examples":[{"en":"In spring, dhak trees can turn whole hillsides orange.","zh":"春天时，dhak 树能把整片山坡染成橙色。"},{"en":"The dhak flower is used in some traditional celebrations and crafts.","zh":"dhak 的花在一些传统庆典和手工艺中会被使用。"}]}],"synonyms":["barrel drum","festival drum","Butea monosperma","flame of the forest"],"phonetic":"/dɑk/","extraExplanation":["“dhak”主要出现在南亚英语语境中（例如印度、孟加拉国）。在一般英语词典里不一定常见，但在谈到南亚文化、节庆（如 Durga Puja）或民俗音乐时会出现。","注意不要与专有名词“Dhaka /ˈdɑkə/”（孟加拉国首都，常拼作 Dhaka）混淆：一个是普通名词 dhak（鼓/树），一个是地名 Dhaka。"]}
{"word":"Dhaka","summary":{"en":"Dhaka is the capital and largest city of Bangladesh.","zh":"Dhaka（达卡）是孟加拉国的首都和最大城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The capital and largest city of Bangladesh, located in the central part of the country (often written as “Dhaka”; older spelling: “Dacca”).","zh":"达卡：孟加拉国的首都和最大城市，位于该国中部（常写作 Dhaka；旧译/旧拼写：Dacca）。"},"examples":[{"en":"Dhaka is the capital of Bangladesh.","zh":"达卡是孟加拉国的首都。"},{"en":"My friend lives in Dhaka and works in the garment industry.","zh":"我的朋友住在达卡，在服装制造业工作。"},{"en":"We flew to Dhaka and then traveled to other cities by bus.","zh":"我们飞到达卡，然后乘巴士去其他城市。"}]}],"synonyms":["Dacca"],"phonetic":"ˈdɑkə","extraExplanation":["“Dhaka”在英语中是最常见的拼写；“Dacca”是历史上（尤其在殖民时期与旧文献中）常见的旧拼写，现在多用于历史语境。","达卡以人口密集、交通繁忙以及纺织与成衣产业闻名；在阅读新闻或社会议题时常会遇到与城市化、气候与经济发展相关的背景。"]}
{"word":"dhaks","summary":{"en":"“Dhaks” usually means the plural of “dhak,” a traditional Bengali festival drum.","zh":"“Dhaks”通常是“dhak”的复数，指孟加拉地区节庆中常见的传统大鼓。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of dhak: a large traditional drum from Bengal (India/Bangladesh), often played in festivals (especially Durga Puja).","zh":"dhak 的复数：一种来自孟加拉地区（印度/孟加拉国）的传统大鼓，常用于节庆（尤其是杜尔迦女神节）。"},"examples":[{"en":"During Durga Puja, you can hear dhaks all over the neighborhood.","zh":"在杜尔迦女神节期间，你会在整个社区听到到处都是 dhaks（大鼓声）。"},{"en":"The dancers moved faster as the dhaks grew louder.","zh":"随着 dhaks 的鼓声越来越响，舞者的动作也更快了。"}]}],"synonyms":["festival drums","traditional drums"],"phonetic":"/dɑks/","extraExplanation":["“dhak”常见于孟加拉文化语境，尤其在杜尔迦女神节（Durga Puja）游行、祭典与舞蹈中出现。英语里有时直接借用该词来指这种乐器。","如果你原本想输入的是“thanks”或别的词，请告诉我上下文（句子/你想表达的意思），我可以帮你确认正确拼写和用法。"]}
{"word":"dhal","summary":{"en":"Dhal is lentils, or a spiced lentil dish common in South Asian cuisine.","zh":"Dhal 指扁豆，或指南亚常见的香料扁豆菜（浓汤/咖喱）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian food) Lentils (split pulses), or a cooked dish made from lentils—often seasoned with spices and served with rice or bread.","zh":"（南亚食物）扁豆（去皮或劈开的豆类），也指用扁豆煮成的咖喱/浓汤类菜肴，常用香料调味并配米饭或面饼食用。"},"examples":[{"en":"We had dhal with rice and yogurt for dinner.","zh":"我们晚餐吃了达尔扁豆配米饭和酸奶。"},{"en":"This recipe uses red lentils to make a quick dhal.","zh":"这个食谱用红扁豆做一道快手达尔扁豆。"},{"en":"She ordered garlic naan and a bowl of dhal.","zh":"她点了蒜蓉烤饼（naan）和一碗达尔扁豆。"}]}],"synonyms":["dal","dahl","lentil dish"],"phonetic":"/dɑl/","extraExplanation":["“dhal”常见于英语中的南亚菜谱写法，也常拼作“dal”或“dahl”。在印度及周边地区，“dal/dhal”既可指原料（扁豆/豆类），也可指成品菜（煮成的浓汤或咖喱）。不同地区口味差异很大：有的偏清淡像汤，有的更浓稠、更辛香。点餐或看菜单时，通常指成品菜。"]}
{"word":"dhals","summary":{"en":"“Dhals” is the plural of dal/dhal: split lentils/legumes or dishes made from them.","zh":"dhals 是 dal/dhal 的复数：指分裂豆/扁豆等豆类，或用其做成的豆类料理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “dhal/dal”: dried split lentils or other legumes used in South Asian cooking; also the dishes made from them.","zh":"“dhal/dal”的复数：指用于南亚烹饪的干燥去皮分裂豆类（常见为扁豆等）；也可指用这些豆类做成的汤/炖菜（豆类料理）。"},"examples":[{"en":"Many Indian meals include different dhals, such as masoor dal and moong dal.","zh":"很多印度餐会包含不同的 dhal（豆类料理），比如红扁豆（masoor dal）和绿豆（moong dal）。"},{"en":"I bought several dhals to make quick, healthy soups during the week.","zh":"我买了几种 dhal（分裂豆/扁豆），想在一周里做些快捷健康的豆汤。"}]}],"synonyms":["dal","dhal","daal"],"phonetic":"/dɑl/","extraExplanation":["拼写上常见 dal、dhal、daal 等，都是同一个词的不同转写方式；英语里更常把它当不可数名词用（I made dal），但在强调“不同种类/几份”时也会用复数 dhals（different dhals）。","在南亚文化中，dal/dhal 既指“豆类食材”，也常指“用豆煮成的家常菜”。菜单上看到 dal 通常就是后者。"]}
{"word":"dhaman","summary":{"en":"Dhaman usually means “artery” in South Asian/Ayurvedic contexts, and it can also be a person’s name.","zh":"Dhaman 常指（南亚/阿育吠陀语境中的）“动脉”，也可作人名或姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian English; from Sanskrit/Ayurvedic usage) an artery; a blood vessel that carries blood away from the heart.","zh":"（南亚英语；源自梵语/阿育吠陀用法）动脉；把血液从心脏输送出去的血管。"},"examples":[{"en":"In some Ayurvedic texts, the term dhaman is used to talk about arteries in the body.","zh":"在一些阿育吠陀经典中，dhaman 用来指人体的动脉。"},{"en":"The doctor explained that an artery (dhaman) can become blocked over time.","zh":"医生解释说，动脉（dhaman）可能会随着时间推移而堵塞。"}]},{"partOfSpeech":"n.","definition":{"en":"a personal name or surname (used in parts of South Asia).","zh":"人名或姓氏（在南亚部分地区使用）。"},"examples":[{"en":"Mr. Dhaman will speak at the meeting tomorrow.","zh":"Dhaman 先生明天将在会议上发言。"}]}],"synonyms":["artery","blood vessel"],"phonetic":"/dʌˈmɑn/","extraExplanation":["“Dhaman”在标准现代英语里不算常用词，更常见于印度/南亚语境，尤其在讨论传统医学（如阿育吠陀）或梵语相关内容时出现。","如果你是在读某篇文章或看到特定句子里的“dhaman”，把原句发来我可以帮你根据上下文判断它是“动脉”的意思还是专有名词（人名/地名/机构名）。"]}
{"word":"dhamma","summary":{"en":"Dhamma means the Buddha’s teachings (especially in Theravāda Buddhism) and, by extension, the practice of living according to those teachings.","zh":"Dhamma 指佛陀的教法（尤用于上座部/南传佛教），并可引申为依教奉行的修行实践。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Buddhism, especially Theravāda) the Buddha’s teachings; the truth and principles that explain how life works and how to end suffering.","zh":"（佛教用语，尤指上座部/南传佛教）佛陀的教法；解释生命规律并指向止息苦的真理与原则。"},"examples":[{"en":"She began reading books on the Dhamma after attending a meditation retreat.","zh":"参加禅修营后，她开始阅读有关Dhamma（佛法）的书。"},{"en":"The monk gave a Dhamma talk on compassion and mindfulness.","zh":"那位僧人做了一场关于慈悲与正念的佛法开示。"},{"en":"For him, living by the Dhamma meant speaking honestly and acting kindly.","zh":"对他来说，依Dhamma生活意味着诚实说话、善意行事。"}]},{"partOfSpeech":"n.","definition":{"en":"the practice of Buddhist teaching in daily life (right conduct, meditation, and understanding).","zh":"（引申）把佛法落实到日常生活中的修行方式（如正行、禅修与正见）。"},"examples":[{"en":"He tries to follow Dhamma by meditating every morning.","zh":"他每天早上禅修，努力依Dhamma修行。"},{"en":"They spoke about how Dhamma can guide decisions at work and at home.","zh":"他们讨论佛法如何引导工作与家庭中的选择。"}]}],"synonyms":["Dharma","the Buddha’s teaching","Buddhist doctrine"],"phonetic":"/ˈdɑːmə/","extraExplanation":["“Dhamma”来自巴利语（Pāli），常见于上座部（Theravāda）传统；在梵语中更常写作“Dharma”。英语语境里两者有时可互换，但在南传传统讨论经典、僧团或开示时常用“Dhamma”。","常见搭配：Dhamma talk（佛法开示/法谈）、Dhamma practice（修行/法的实践）、the Dhamma and the Sangha（法与僧）。","文化提示：为尊重传统，写作时常首字母大写（the Dhamma），表示“佛陀的教法”这一特定含义。"]}
{"word":"Dhammapada","summary":{"en":"The Dhammapada is a famous collection of Buddhist verses teaching ethics and mental training.","zh":"《法句经》是一部著名的佛教偈颂集，主要教导伦理与心灵修习。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A classic Buddhist scripture (originally in Pali) made up of short verses that summarize the Buddha’s teachings, especially on ethics, the mind, and the path to liberation.","zh":"《法句经》（巴利语原典），由许多简短偈颂组成的佛教经典，概括佛陀教导，尤其涉及伦理、心念与解脱之道。"},"examples":[{"en":"I read a few verses from the Dhammapada each morning to reflect on my actions.","zh":"我每天早上读几段《法句经》，用来反省自己的行为。"},{"en":"In many Buddhist traditions, the Dhammapada is one of the most widely read texts.","zh":"在许多佛教传统中，《法句经》是最常被阅读的经典之一。"},{"en":"The teacher quoted the Dhammapada to explain why mindfulness matters.","zh":"老师引用《法句经》来说明为什么正念很重要。"}]}],"synonyms":["Buddhist scripture","Buddhist verses","sayings of the Buddha"],"phonetic":"/ˌdɑməˈpɑdə/","extraExplanation":["词源上一般解释为巴利语 dhamma（法、真理、教法）+ pada（足迹、句/偈颂），常理解为“法之句”“法句”。","常见英文拼写还有 Dhammapada / Dharmapada（梵语化拼写更常见于学术或特定传统）。","它属于上座部佛教《小部》（Khuddaka Nikāya）中的重要文本，但也被许多不同佛教传统的读者广泛阅读。","英文世界里常以格言式、诗句式的译文流传；不同译本的用词与章句编号可能略有差异。"]}
{"word":"dhamnoo","summary":{"en":"“dhamnoo” is not standard English; it’s likely a name/username or transliteration, and its meaning depends on context.","zh":"“dhamnoo”不是标准英语词；多半是名字/网名或外语音译，含义取决于语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a name, username, or a transliteration from another language, so the meaning depends on the context where you saw it.","zh":"不是标准英语单词。更可能是人名、网名，或其他语言的音译/转写；具体含义要看你在哪种语境中看到它。"},"examples":[{"en":"I saw the word “dhamnoo” in a comment—does it mean anything in English?","zh":"我在评论里看到“dhamnoo”——它在英语里有含义吗？"},{"en":"“Dhamnoo” might be a username rather than an English vocabulary word.","zh":"“dhamnoo”可能是用户名，而不是英语词汇。"}]}],"phonetic":"/dɑmˈnuː/","extraExplanation":["“dhamnoo”在常见英语词典里通常查不到，因此很可能来自其他语言（例如南亚语言的罗马字转写）或只是个人昵称/拼写变体。","如果你把它出现的完整句子、平台（比如歌曲、游戏、社交媒体）、以及它指向的人/物发我，我可以更准确判断它可能对应的词、语言和含义。","就英语拼写习惯而言，它看起来像人为拼出的音节组合；发音我只能按拼写给出近似读法，可能与原语言读音不同。"]}
{"word":"dhan","summary":{"en":"Dhan is a loanword from Hindi/Sanskrit meaning “wealth,” and it’s also used as a South Asian male name or name element.","zh":"Dhan 源自印地语/梵语，主要意思是“财富”；也常作为南亚男性名字或名字构成部分使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Hindi/Sanskrit) wealth; money; property; riches.","zh":"（源自印地语/梵语）财富；金钱；财产；富足。"},"examples":[{"en":"In many Indian languages, dhan means “wealth.”","zh":"在许多印度语言中，dhan 的意思是“财富”。"},{"en":"The festival wishes often include “health and dhan.”","zh":"节日祝福里常会提到“健康与 dhan（财富）”。"}]},{"partOfSpeech":"n.","definition":{"en":"a male given name (South Asian); also used in names and place names.","zh":"（南亚常见）男性名字；也常用于人名、地名的一部分。"},"examples":[{"en":"Dhan is sometimes used as a short form of longer names.","zh":"Dhan 有时会作为较长名字的简称。"},{"en":"You may see it in names like Dhanraj.","zh":"你可能会在 Dhanraj 这类名字里见到它。"}]}],"synonyms":["wealth","riches","money","property"],"phonetic":"/dʌn/","extraExplanation":["“धन (dhan)”在印度文化语境里不仅指“钱财”，也可泛指“资源、资产、积累的富足”。在宗教或劝善语境中，它有时会和“美德、福报”一类概念并列出现。","发音方面，原语言里常带有送气/浊送气的音色；英语语境中通常会被简化为接近“dun”的读音。"]}
{"word":"dhangar","summary":{"en":"Dhangar is the name of an Indian community traditionally linked to shepherding and herding, especially in Maharashtra.","zh":"Dhangar 是印度一支传统从事放牧与畜牧（尤以马哈拉施特拉邦常见）的社群名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a community (often described as a caste) in western and central India, traditionally associated with shepherding, herding, and wool work—especially in Maharashtra","zh":"印度西部与中部的一支族群（常被归类为种姓/社群），传统上与放牧、牧羊、畜牧和羊毛相关工作有关，尤以马哈拉施特拉邦常见"},"examples":[{"en":"The Dhangar community has a long history of shepherding in Maharashtra.","zh":"Dhangar 社群在马哈拉施特拉邦有着悠久的牧羊历史。"},{"en":"In some regions, Dhangars seasonally move with their flocks to find pasture.","zh":"在一些地区，Dhangar 人会随着羊群季节性迁徙以寻找牧场。"}]}],"synonyms":["shepherd (contextual)"],"phonetic":"/ˈdɑːŋɡər/","extraExplanation":["“Dhangar”通常作为专有名词使用（指特定社群/族群），不同地区对其历史、社会分类与内部支系的称呼可能有差异；在写作中更中性、尊重的做法是把它当作社群名称来用，并尽量结合具体地区与语境说明。","在英文资料中，你可能会看到与其相关的文化背景，如传统游牧/半游牧放牧、民间宗教与节庆、以及与马哈拉施特拉邦乡村经济的联系。"]}
{"word":"Dhanis","summary":{"en":"“Dhanis” is most commonly used as a person’s name in English, not a standard dictionary word.","zh":"“Dhanis”在英语中最常见的用法是人名，而不是标准词典词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A personal name (usually South Asian). It is not a common English vocabulary word; in English it is typically used as a proper noun (someone’s name).","zh":"人名（多见于南亚地区）。它不是常见英文词汇；在英语里通常作为专有名词使用（某人的名字）。"},"examples":[{"en":"Dhanis is my new classmate.","zh":"Dhanis 是我新来的同学。"},{"en":"Please ask Dhanis to join the meeting at 3 p.m.","zh":"请让 Dhanis 下午三点参加会议。"}]}],"phonetic":"/ˈdɑːnɪs/","extraExplanation":["“Dhanis”更可能是姓名而不是英文单词。它在不同地区/家庭里可能有不同拼写与读法（例如与 Dhanesh, Danish 等名字混淆）。如果你是想查某个英文单词的意思，请告诉我：它出现在哪个句子里、你想表达的是“人名”还是“某个词/品牌/地名”。","从词源联想上看，部分南亚姓名可能与梵语/印地语里表示“财富”的词根（如 dhan-）相关，但仅凭拼写无法保证准确含义。若你提供语言背景（印地语/乌尔都语/尼泊尔语等）或原文拼写，我可以更精确说明。"]}
{"word":"dhanuk","summary":{"en":"Dhanuk most commonly refers to a community/caste group in North India and Nepal; more rarely, it can mean an archer.","zh":"Dhanuk 常指印度北部与尼泊尔的一个社群/种姓；较少见时也可指“弓箭手”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Dhanuk community (a traditional social group/caste found mainly in parts of North India and Nepal)","zh":"达努克（Dhanuk）社群/种姓的人（主要分布于印度北部及尼泊尔部分地区的传统社会群体）"},"examples":[{"en":"Some families in the village identify as Dhanuk.","zh":"村里有些家庭认同自己属于达努克（Dhanuk）社群。"},{"en":"The report mentioned Dhanuk communities in the Terai region.","zh":"报告提到了特莱（Terai）地区的达努克（Dhanuk）社群。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) an archer; a bowman","zh":"（罕见）弓箭手；射手"},"examples":[{"en":"In older texts, a dhanuk may be described as a skilled archer.","zh":"在一些较古老的文本里，dhanuk 可能用来指技艺高超的弓箭手。"}]}],"synonyms":["(sense 2) archer","(sense 2) bowman"],"phonetic":"/ˈdɑːnʊk/","extraExplanation":["“Dhanuk”常作为专名使用，指特定社群/种姓时通常首字母大写（Dhanuk）。在写作中谈及种姓或族群时，建议使用中性、尊重的语气，并尽量依据当事人自称或权威资料。","“dhanuk”表示“弓箭手”的用法较少见，多与其源自南亚语言中与“弓”（如梵语 dhanus）相关的词根有关；在现代英语里更常用 archer。"]}
{"word":"dhanush","summary":{"en":"Dhanush is most commonly a famous Indian actor’s stage name; it can also mean “bow” (a weapon) in Sanskrit/Hindi contexts.","zh":"Dhanush 最常指一位知名印度演员的艺名；在梵语/印地语语境中也可表示“弓”（武器）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper name) An Indian actor, producer, director, and singer; stage name of Venkatesh Prabhu Kasthuri Raja (born 1983), known for Tamil cinema and the film/song “Why This Kolaveri Di.”","zh":"（专有名词）印度演员、制片人、导演兼歌手；本名 Venkatesh Prabhu Kasthuri Raja（1983年生），以泰米尔电影作品及歌曲/影片《Why This Kolaveri Di》广为人知。"},"examples":[{"en":"Dhanush acted in many popular Tamil films.","zh":"Dhanush 参演了许多受欢迎的泰米尔电影。"},{"en":"“Why This Kolaveri Di” made Dhanush famous worldwide.","zh":"《Why This Kolaveri Di》让 Dhanush 在全球走红。"}]},{"partOfSpeech":"n.","definition":{"en":"(From Sanskrit/Hindi) A bow (weapon) used to shoot arrows; also used in names and classical texts.","zh":"（源自梵语/印地语）弓（射箭的武器）；也常见于人名与古典文本中。"},"examples":[{"en":"In some Indian epics, a hero carries a powerful dhanush.","zh":"在一些印度史诗中，英雄会携带一把强大的 dhanush（神弓）。"},{"en":"The word dhanush can appear in names that suggest strength or archery.","zh":"dhanush 这个词会出现在名字里，常带有力量或射术的联想。"}]}],"synonyms":["bow (weapon)","archer’s bow","proper name (stage name)"],"phonetic":"/ˈdʌnʊʃ/","extraExplanation":["“Dhanush”在英文语境里多被当作人名（尤其指印度影星 Dhanush）。如果你是在查“词义”，它也可对应梵语/印地语“弓”。","印度文化中，“弓”常与武士精神、守护与正义相关；在史诗传统里，神弓也常象征天赋与使命。"]}
{"word":"Dhanvantari","summary":{"en":"Dhanvantari is the Hindu deity associated with Ayurveda and healing, and it is also used as a personal or institutional name linked to health and medicine.","zh":"Dhanvantari 指印度教中与阿育吠陀和疗愈相关的神祇，也可作为与健康医疗有关的人名或机构名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Hindu tradition, the god of Ayurveda (traditional Indian medicine) and healing; often shown as an incarnation (avatar) of Vishnu, holding a pot of nectar (amrita).","zh":"在印度教传统中，阿育吠陀（印度传统医学）与治愈之神；常被视为毗湿奴（Vishnu）的化身之一，常手持盛有甘露（amrita）的宝瓶。"},"examples":[{"en":"Many Ayurveda clinics place an image of Dhanvantari at the entrance as a symbol of healing.","zh":"许多阿育吠陀诊所会在入口处摆放檀那凡陀利（Dhanvantari）的形象，作为疗愈的象征。"},{"en":"On Dhanvantari Jayanti, people pray for good health and well-being.","zh":"在“檀那凡陀利诞辰”（Dhanvantari Jayanti）这一天，人们祈求健康与安康。"}]},{"partOfSpeech":"n.","definition":{"en":"A given name (especially in South Asia) inspired by the healing deity, sometimes used for organizations or institutions connected to health and medicine.","zh":"一个人名（多见于南亚），源自“治愈之神”的名号；也常被用于与健康、医疗相关的机构或品牌名称。"},"examples":[{"en":"Dhanvantari is his first name, chosen because his parents value medicine and service.","zh":"他的名字叫檀那凡陀利（Dhanvantari），父母取这个名字是因为重视医学与济世。"},{"en":"The hospital launched a “Dhanvantari” program to promote preventive care.","zh":"该医院启动了名为“Dhanvantari”的项目来推广预防保健。"}]}],"synonyms":["Ayurveda deity","Hindu god of medicine","healing deity","Dhanwantri (variant spelling)"],"phonetic":"/ˌdɑːn-vən-ˈtɑː-ri/","extraExplanation":["“Dhanvantari（檀那凡陀利）”来自梵语，常被解释为与“财富/利益（dhan）”和“渡过/治愈（vantari）”相关的含义组合，整体指向“带来健康福祉的人/神”。","他常出现在“搅拌乳海”（Samudra Manthan）的神话中：诸神与阿修罗搅动乳海时，Dhanvantari捧着甘露现身，象征长生与疗愈。","在英语语境里，这个词多作为专有名词使用，常见拼写为 Dhanvantari，也可能看到 Dhanwantri 等变体。发音在不同地区会略有差异。"]}
{"word":"dhanvantari","summary":{"en":"Dhanvantari is the Hindu divine physician, revered as the patron of Ayurveda; the name is also widely used for people and medical institutions.","zh":"丹万塔里（Dhanvantari）是印度教中的神医、阿育吠陀的守护神；该名字也常用于人名及医疗机构等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) In Hindu tradition, the divine physician and a form (avatar) of the god Vishnu; regarded as the patron deity of Ayurveda (traditional Indian medicine).","zh":"（专有名词）印度教传统中的“神医”，被视为毗湿奴的一种化身；被尊为阿育吠陀（印度传统医学）的守护神。"},"examples":[{"en":"Many Ayurveda clinics display an image of Dhanvantari as a symbol of healing.","zh":"许多阿育吠陀诊所会摆放“丹万塔里（Dhanvantari）”的形象，象征疗愈。"},{"en":"The story says Dhanvantari emerged from the ocean carrying the nectar of immortality.","zh":"传说中，丹万塔里从大海中出现，手持“不死甘露”。"}]},{"partOfSpeech":"n.","definition":{"en":"A personal name (especially in India) or the name of institutions, awards, or products related to health and medicine, taken from the deity’s name.","zh":"源自该神祇之名的人名（尤其在印度常见），或用于医疗健康相关机构、奖项、产品等的名称。"},"examples":[{"en":"Dhanvantari is a common name for hospitals and medical colleges in India.","zh":"在印度，“Dhanvantari”常被用作医院或医学院的名称。"},{"en":"His given name is Dhanvantari, named after the healing deity.","zh":"他的名字叫丹万塔里，是以医药守护神命名的。"}]}],"synonyms":["the divine physician (Hinduism)","Ayurveda’s patron deity"],"phonetic":"/dɑːnˈvʌn.tə.ri/","extraExplanation":["“Dhanvantari”在印度文化里常与健康、医药、长寿联系在一起。许多与医疗有关的机构会用这个名字来表达“治病救人、守护健康”的寓意。","在节庆语境中，他也常与“Dhanteras / Dhantrayodashi（排灯节前的节日之一）”相关：民间会在这一天祈求健康与福祉，有些地区会特别礼敬丹万塔里。"]}
{"word":"Dhanwantri","summary":{"en":"Dhanwantri is a spelling variant of Dhanvantari, the Hindu deity linked with Ayurveda and healing.","zh":"Dhanwantri 通常是 Dhanvantari 的拼写变体，指与阿育吠陀和疗愈相关的印度教神祇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A Hindu deity associated with Ayurveda (traditional Indian medicine), often described as the divine physician and a form/manifestation connected with the god Vishnu.","zh":"（专有名词）与阿育吠陀（印度传统医学）相关的印度教神祇，常被称为“神圣医师”，也常被视为与毗湿奴有关的化身/显现。"},"examples":[{"en":"Some Ayurveda clinics place an image of Dhanwantri in the reception area.","zh":"一些阿育吠陀诊所会在接待区摆放檀梵特里（Dhanwantri）的画像。"},{"en":"In many Hindu traditions, people pray to Dhanwantri for health and healing.","zh":"在许多印度教传统中，人们会向檀梵特里祈求健康与疗愈。"}]},{"partOfSpeech":"n.","definition":{"en":"(Alternate spelling) A less common spelling of Dhanvantari, especially in Romanized writing.","zh":"（拼写变体）Dhanvantari 的较少见拉丁字母拼写形式。"},"examples":[{"en":"You may also see the name written as Dhanvantari in English sources.","zh":"在英文资料中，你也可能看到这个名字写作 Dhanvantari。"}]}],"synonyms":["Dhanvantari","the divine physician (epithet)","Ayurveda (related term)"],"phonetic":"/dɑnˈwɑntri/","extraExplanation":["“檀梵特里/Dhanvantari（你写的 Dhanwantri 多半指同一位）”常出现在“搅拌乳海”（Samudra Manthan）的神话叙事中：他被描绘为从乳海中出现、手持装有“甘露（不死之露）”的器皿，与“疗愈、医学、长寿”的象征意义紧密相连。","在印度，排灯节期间的“Dhanteras（Dhantrayodashi）”有时也与檀梵特里相关，被视为祈求健康与繁荣的日子。","英语里更常见、较标准的拼写是 Dhanvantari；不同地区/转写系统会导致 Dhanwantri 这类拼写差异。"]}
{"word":"dhaora","summary":{"en":"“dhaora” isn’t recognized as a common English word; it’s likely a proper name or a transliteration from another language.","zh":"“dhaora”不是常见英语词；更可能是专有名词或其他语言的转写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. “dhaora” is most likely a proper name (a place/person) or a romanized spelling from another language (e.g., South Asian languages).","zh":"不是标准英语单词。“dhaora”更可能是专有名词（地名/人名）或来自其他语言的拉丁字母转写（例如南亚语言的音译）。"},"examples":[{"en":"I couldn’t find “dhaora” in major English dictionaries—could you share a sentence or where you saw it?","zh":"我在主流英语词典里找不到“dhaora”——你能提供一句原句或告诉我你在哪里看到的吗？"},{"en":"If “Dhaora” is a place or family name, the meaning may depend on the local language and spelling.","zh":"如果“Dhaora”是地名或姓氏，它的含义可能取决于当地语言和具体拼写。"}]}],"phonetic":"/dɑˈɔrə/","extraExplanation":["如果你想查的是英语单词，可能是拼写有误。你可以确认一下是否想输入：\n- “diorama”（立体模型/透视景箱）\n- “dharma”（佛教/印度宗教概念：法、正道）\n- 或者提供你看到它的语境（一句话/截图/链接），我就能更准确判断并给出对应词条。"]}
{"word":"Dhar","summary":{"en":"“Dhar” is most commonly a place name in India; it can also be a Hindi/Urdu loanword meaning “sharp edge” or “strong flow/current.”","zh":"“Dhar”最常见是印度地名；也可作印地语/乌尔都语借词，表示“锋刃/刃口”或“强劲的流动/势头”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Dhar: a city and district in the Indian state of Madhya Pradesh (often treated as a proper noun).","zh":"Dhar：印度中央邦（Madhya Pradesh）的一个城市及同名地区（通常作专有名词）。"},"examples":[{"en":"She grew up in Dhar before moving to Indore for college.","zh":"她在Dhar长大，后来去印多尔上大学。"},{"en":"The Dhar district is known for its history and forts.","zh":"Dhar地区以其历史与堡垒闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"(from Hindi/Urdu धार, dhār) an edge or sharp cutting line, especially the edge of a blade; by extension, a strong current/flow (of water, wind, or a stream of action).","zh":"（源自印地语/乌尔都语 धार, dhār）“刃口、锋刃”，尤指刀刃的锋利边；引申为“水流/气流的急流、势头”。"},"examples":[{"en":"In Hindi, dhar can mean the sharp edge of a knife.","zh":"在印地语里，dhar 可以指刀的锋刃。"},{"en":"Poets may use dhar to suggest a powerful flow, like a river’s current.","zh":"诗歌里有时用 dhar 来暗示强劲的流动感，比如河流的急流。"}]}],"synonyms":["(place) —","(edge) blade edge","(flow) current"],"phonetic":"/dɑr/","extraExplanation":["“Dhar”在英文语境里最常见的是印度地名（专有名词），发音通常近似 /dɑr/。","作为南亚语言借词时，它常见于与印地语/乌尔都语相关的语境（如文化介绍、翻译、诗歌注释）。其中“刃口”的意思也常出现在复合词或比喻表达里，用来强调“锋利、力量或势头”。"]}
{"word":"Dharamsala","summary":{"en":"Dharamsala is a city in northern India famous for Tibetan culture and the Tibetan community in exile; it can also (rarely) refer to a charitable rest house (dharamshala).","zh":"Dharamsala 是印度北部一座以藏文化与流亡藏人社区闻名的城市；在少数情况下也可指慈善旅舍（dharamshala）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in Himachal Pradesh, northern India, known as the home of the Tibetan government-in-exile and a major center of Tibetan culture; often used to refer to the surrounding hill area (including McLeod Ganj).","zh":"印度北部喜马偕尔邦的一座山城，以西藏流亡政府所在地与浓厚的藏文化闻名；也常用来指周边的山地地区（包括麦罗甘吉 McLeod Ganj）。"},"examples":[{"en":"The conference will be held in Dharamsala next summer.","zh":"会议将于明年夏天在达兰萨拉举行。"},{"en":"Many travelers visit Dharamsala to learn about Tibetan culture and Buddhism.","zh":"许多旅行者去达兰萨拉了解藏文化与佛教。"},{"en":"She moved to Dharamsala to study meditation and mountain life.","zh":"她搬到达兰萨拉学习冥想并体验山地生活。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) A spelling variant of “dharamshala/dharmshala,” meaning a charitable rest house or shelter, especially for pilgrims in South Asia.","zh":"（较少见）“dharamshala/dharmshala”的拼写变体，指南亚常见的慈善旅舍/休息所，尤其供朝圣者使用。"},"examples":[{"en":"We stayed in a small dharamshala near the temple.","zh":"我们住在寺庙附近的一家小型慈善旅舍里。"},{"en":"Some older travel books use “Dharamsala” for a dharamshala (rest house).","zh":"一些较老的旅行书会用“Dharamsala”来指 dharamshala（旅舍/休息所）。"}]}],"synonyms":["Dharamshala","McLeod Ganj (area within/near Dharamsala)"],"phonetic":"/dəˈrɑːmˌsɑːlə/","extraExplanation":["“Dharamsala”也常拼作“Dharamshala”。英语里这两个拼法都能见到，但指印度那座城市时，“Dharamsala”在新闻与地图中很常见。","这座城市与达赖喇嘛及藏人流亡社区联系紧密，因此在国际报道中常被用作“藏人流亡社会/机构所在地”的代称（类似用“华盛顿”代指美国政府）。","词源上与梵语/印地语中“dharma（法/正道）”+“shala（住处/厅堂）”有关，所以也会与“供人歇脚的旅舍”这一普通名词发生拼写与含义上的混用。"]}
{"word":"Dharamshala","summary":{"en":"Dharamshala (also “Dharamsala”) is a hill city in northern India; the word can also mean a simple pilgrim guesthouse in South Asia.","zh":"Dharamshala（也作Dharamsala）是印度北部的山城；该词也可指南亚常见的简易朝圣/慈善旅舍。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hill city in Himachal Pradesh, India (also spelled “Dharamsala”), known as a Himalayan travel destination and the home of the Tibetan government-in-exile and the Dalai Lama’s residence in nearby McLeod Ganj.","zh":"印度喜马偕尔邦的一座山城（也拼作“Dharamsala”），以喜马拉雅山景的旅游胜地闻名，并因附近的麦罗甘吉（McLeod Ganj）是藏人流亡机构所在地、达赖喇嘛驻地而广为人知。"},"examples":[{"en":"We flew to Delhi and then took a bus to Dharamshala for a week in the mountains.","zh":"我们先飞到德里，然后坐大巴去达兰萨拉，在山里住一周。"},{"en":"Dharamshala is famous for Tibetan culture, cafés, and trekking routes.","zh":"达兰萨拉以藏文化、咖啡馆和徒步线路闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"In South Asia, a “dharamshala” (common noun) is a simple guesthouse or rest house, often for pilgrims or travelers, sometimes attached to a temple or charity.","zh":"在南亚语境中，“dharamshala”（普通名词）指简朴的旅舍/休息所，常为朝圣者或旅人提供住宿，有时与寺庙或慈善机构相关。"},"examples":[{"en":"They stayed in a dharamshala near the temple to save money.","zh":"为了省钱，他们住在寺庙附近的达兰萨拉式简易旅舍。"},{"en":"The dharamshala provides basic beds and meals for travelers.","zh":"这种旅舍为旅人提供基本的床位和餐食。"}]}],"synonyms":["Dharamsala","McLeod Ganj (nearby area)"],"phonetic":"/dɑːˈrʌmʃɑːlə/","extraExplanation":["“Dharamshala / Dharamsala”两种拼写都常见：前者更贴近印地语转写习惯，后者更常出现在英文地图与媒体中。","这个地名在国际上知名度很高，主要因为麦罗甘吉（McLeod Ganj）聚居大量藏人流亡社区，也常被称为“小拉萨”。","普通名词dharamshala源自梵语/印地语语境：dharma（法/善/宗教义务）+ shala（房舍），含“慈善旅舍、行善之所”的文化意味。"]}
{"word":"dharana","summary":{"en":"Dharana means focused mental concentration in yoga, often used to prepare for meditation.","zh":"Dharana 指瑜伽中的专注摄心练习，常用于为更深层的冥想做准备。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In yoga and Indian philosophy) focused concentration of the mind, often practiced as a step before deep meditation.","zh":"（瑜伽与印度哲学）专注、摄心：把注意力稳定地集中在一个对象上，常作为进入更深层冥想前的练习步骤。"},"examples":[{"en":"In Patanjali’s yoga system, dharana is practiced before dhyana (meditation).","zh":"在帕坦伽利的瑜伽体系中，dharana 通常在 dhyana（禅修/冥想）之前练习。"},{"en":"During dharana, she kept her attention on her breath without letting her mind wander.","zh":"练习 dharana 时，她把注意力放在呼吸上，不让思绪飘走。"},{"en":"The teacher suggested using a candle flame as the object of dharana.","zh":"老师建议用烛火作为 dharana 的专注对象。"}]}],"synonyms":["concentration","focused attention","single-pointed focus","mental focus"],"phonetic":"/dɑˈrɑːnə/","extraExplanation":["Dharana 源自梵语 धारणा（dhāraṇā），核心含义是“持住、维持”。在“瑜伽八支”（Ashtanga Yoga）中，它是第六支：在外在训练（如体式、呼吸）之后，将心稳定在单一对象上，为第七支 dhyana（更持续、更自然的冥想状态）与第八支 samadhi（定/三昧）做准备。","在现代瑜伽语境里，dharana 常被解释为“专注力训练”，对象可以是呼吸、咒音、身体感觉、烛火、某个意念或图像等。与日常的“concentration”相比，它更强调“持续地把心带回同一个对象”的练习过程。"]}
{"word":"dharani","summary":{"en":"A dharani is a Buddhist sacred chant or formula recited for protection, blessings, and spiritual practice.","zh":"陀罗尼是佛教中的神圣咒语/持诵文句，用于护持、祈福与修行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Buddhism (especially Mahāyāna and Vajrayāna), a sacred chant or formula (often in Sanskrit) that is recited for protection, blessing, memory support, or spiritual practice; sometimes written down and carried as a talisman.","zh":"（佛教，尤指大乘与密教中的）“陀罗尼”：一种神圣的咒语/持诵文句（多源自梵语），用于护持、祈福、助忆与修行；也常被抄写佩戴或供奉以作护身符。"},"examples":[{"en":"The monk recited a dharani for protection before the journey.","zh":"出行前，那位僧人持诵陀罗尼以求护佑。"},{"en":"In some temples, people copy a dharani and place it inside a small amulet.","zh":"在一些寺院里，人们会抄写陀罗尼并放入小护身符中。"},{"en":"The sutra includes a dharani near the end of the text.","zh":"这部经文在末尾附近收录了一段陀罗尼。"}]}],"synonyms":["mantra","incantation","spell"],"phonetic":"/dəˈrɑːni/","extraExplanation":["“dharani”来自梵语 dhāraṇī，常被解释为“总持/能持”：意指“能摄持教义、能忆持不忘”的法门。","学习时可把它与“mantra（真言/咒）”对照理解：两者都可译作“咒语”，但在传统语境里，陀罗尼常更偏向较长的持诵文句或“总摄法义”的公式；具体区分会因宗派与译本而不同。","在英语语境中，它多作为宗教文化词汇出现（如讨论《陀罗尼经》、护法仪式、寺院实践等），使用时通常不翻译而直接音译。"]}
{"word":"Dharma","summary":{"en":"Dharma means moral duty/right living in Hindu traditions, or the Buddha’s teachings in Buddhism.","zh":"Dharma 指印度传统中的“道德义务/正当之道”，也指佛教中的“佛法/教法”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Hinduism and some Indian traditions) a person’s moral duty and the right way of living; the natural or moral law that supports order in life and society.","zh":"（印度教及部分印度传统中）个人应尽的道德义务与正当的生活方式；维系人生与社会秩序的自然/道德法则。"},"examples":[{"en":"In the story, the hero struggles to choose between personal desire and dharma.","zh":"在故事里，英雄在个人欲望与“达摩/法义（dharma）”之间挣扎。"},{"en":"For many people, dharma includes responsibilities to family, community, and work.","zh":"对许多人来说，dharma 包含对家庭、社群和工作的责任。"}]},{"partOfSpeech":"n.","definition":{"en":"(In Buddhism) the teachings of the Buddha; the truth or principles that guide practice and understanding.","zh":"（佛教中）佛陀的教法；指导修行与理解的真理与原则。"},"examples":[{"en":"She began studying the dharma through meditation and reading.","zh":"她通过禅修和阅读开始学习佛法（dharma）。"},{"en":"The monk gave a talk on dharma and compassion.","zh":"那位僧人做了一场关于佛法（dharma）与慈悲的开示。"}]}],"synonyms":["duty","righteousness","moral law","spiritual law","teaching","doctrine"],"phonetic":"/ˈdɑrmə/","extraExplanation":["“Dharma”来自梵语 dharma，常译作“法/法义/正法/职责”。在英文里有时写作小写（dharma）表示一般概念；在宗教语境中也常大写（Dharma）表示更庄重或专指佛法。","在佛教语境下，“the Dharma”常与“the Buddha, the Dharma, and the Sangha”（佛、法、僧三宝）并列出现。不同传统（如印度教、佛教、耆那教）对 dharma 的侧重点不同：印度教更常强调“本分/义务”，佛教更常强调“教法/真理”。"]}
{"word":"dharma","summary":{"en":"Dharma is a key religious and cultural term meaning moral duty/right living, and in Buddhism it also means the Buddha’s teachings (the Dharma).","zh":"Dharma（达摩/达玛）是重要的宗教文化词，意为道德责任与正道；在佛教中也指佛陀的教法（佛法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Indian religions such as Hinduism, Buddhism, Jainism, and Sikhism) the moral order of the universe; the right way to live, including one’s duty and ethical responsibilities.","zh":"（印度宗教如印度教、佛教、耆那教、锡克教中）宇宙的道德秩序；正确的生活之道，包括个人的职责与伦理责任。"},"examples":[{"en":"In the story, the prince chooses his dharma over personal comfort.","zh":"在故事里，王子选择履行自己的达摩（责任/正道），而不是追求个人安逸。"},{"en":"She tried to act according to dharma, even when it was difficult.","zh":"即使很难，她也努力按照达摩（正道/道义）行事。"}]},{"partOfSpeech":"n.","definition":{"en":"(In Buddhism) the teachings of the Buddha; the truth or principles that explain reality and guide practice.","zh":"（佛教中）佛陀的教法；解释现实并指导修行的真理与原则。"},"examples":[{"en":"They gathered at the temple to listen to a talk on the Dharma.","zh":"他们在寺院里集会，聆听关于佛法（Dharma）的开示。"},{"en":"Meditation is one way people practice the Dharma in daily life.","zh":"禅修是人们在日常生活中实践佛法的一种方式。"}]}],"synonyms":["duty","moral law","righteous path","teachings","spiritual law"],"phonetic":"/ˈdɑːrmə/","extraExplanation":["“Dharma”源自梵语 dharma，核心含义与“支撑、维持秩序”有关，因此既可指宇宙/社会的秩序，也可指个人应尽的本分与道德选择。","在不同传统里侧重点不同：印度教常强调“个人的责任与人生阶段的义务”；佛教语境里更常用大写“Dharma”指“佛法/教法”。英文中常直接借用此词，写作 dharma 或 Dharma。","在英语文化作品中，你可能会见到与它相关的固定搭配，如 follow one’s dharma（遵循自己的正道/本分）、the Dharma（佛法）、dharma talk（佛法开示/讲座）。"]}
{"word":"Dharma-body","summary":{"en":"Dharma-body (Dharmakaya) is the Buddha’s “truth body”—the ultimate, formless reality or awakened nature beyond physical form.","zh":"Dharma-body（法身/ Dharmakaya）指佛的“真理之身”——超越形相、无形无相的究竟实相或觉悟本性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Buddhism) The “truth body” of a Buddha: the ultimate, formless reality or awakened nature beyond any physical form (Sanskrit: Dharmakāya).","zh":"（佛教）佛的“法身”：超越一切形相、无形无相的究竟实相或觉悟本性（梵语：Dharmakāya）。"},"examples":[{"en":"In Mahayana Buddhism, the Dharma-body is described as beyond birth and death.","zh":"在大乘佛教中，法身被描述为超越生死。"},{"en":"Some texts say the Buddha teaches through the Dharma-body as ultimate truth, not as a physical person.","zh":"有些经典说，佛陀是以法身作为究竟真理来教化，而不是以具体肉身的个人形象。"},{"en":"Meditation is sometimes presented as a way to realize the Dharma-body within one’s own mind.","zh":"禅修有时被表达为一种在自心中体证法身的方法。"}]},{"partOfSpeech":"n.","definition":{"en":"By extension, the timeless principle or ultimate truth that all phenomena follow (often used in Buddhist philosophy).","zh":"引申义：万法所依的永恒法则或究竟真理（常用于佛教哲学语境）。"},"examples":[{"en":"The teacher used “Dharma-body” to point to the unchanging truth behind changing experiences.","zh":"老师用“法身”来指向变化经验背后不变的真理。"},{"en":"In discussion, they contrasted the Dharma-body with temporary forms and labels.","zh":"讨论中，他们把法身与暂时的形相和名相作对比。"}]}],"synonyms":["Dharmakaya","truth body","Dharma body"],"phonetic":"ˈdɑrmə ˌbɑdi","extraExplanation":["“Dharma-body”常用来翻译“法身”，也常直接用梵语“Dharmakaya”。它与“三身”（法身、报身、化身）的概念密切相关：法身偏向“究竟真理/本体”，报身偏向“功德圆满的受用身”，化身偏向“在世间示现度化的形象”。","英语里也会写作“Dharma body”（不加连字符）或“Dharma-body”。在学术或宗教写作中，这个词更常见；日常口语中较少使用。"]}
{"word":"dharma-related","summary":{"en":"Dharma-related means “connected with dharma,” especially in Buddhist or Hindu contexts.","zh":"dharma-related 指“与 dharma（法/正道/责任等）有关”，多用于佛教或印度教语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with or concerning dharma (especially Buddhist or Hindu teachings, principles, duties, or the path of right living).","zh":"与“dharma（法、正法、正道/法则、责任/本分）”有关的；涉及佛教或印度教中“法”的教义、原则、责任或修行之道的。"},"examples":[{"en":"The museum has a section on dharma-related art from Nepal and Tibet.","zh":"这家博物馆有一个展区展示来自尼泊尔和西藏的法相关艺术品。"},{"en":"She studies dharma-related texts to better understand Buddhist ethics.","zh":"她研读与佛法相关的典籍，以更好地理解佛教伦理。"},{"en":"Their discussion stayed focused on dharma-related practice, not politics.","zh":"他们的讨论一直聚焦于法相关的修行实践，而不是政治。"}]}],"synonyms":["dharma-based","dharma-centered","Buddhist-related","Hindu-related","religion-related"],"phonetic":"/ˈdɑrmə rɪˌleɪtɪd/","extraExplanation":["“dharma”在不同传统里含义会有差别：在佛教里常译为“法”，可指佛陀教法、真理、现象/事物（诸法）；在印度教语境里也可指“法则、义务、正当之道”。因此“dharma-related”通常是一个中性、学术或说明性的形容词，用来表示“与这些概念或相关实践/文本/艺术有关”。","写作中若读者不熟悉宗教术语，常见做法是第一次出现时简短解释（如：dharma, a key concept in Buddhism and Hinduism），以避免误解。"]}
{"word":"dharmakaya","summary":{"en":"Dharmakaya means the “Dharma-body,” the ultimate formless reality or truth embodied by a Buddha.","zh":"Dharmakaya 指“法身”，即佛陀所体现的究竟无相实相或真理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Buddhism) The “Dharma-body” of a Buddha: the ultimate, formless reality or truth that a Buddha embodies (often understood as the absolute nature of enlightenment).","zh":"（佛教）“法身”：佛陀的“真理之身/法之身”，指无形的究竟实相或真理本身（常被理解为觉悟的绝对本性）。"},"examples":[{"en":"In Mahayana Buddhism, dharmakaya is described as beyond shape and form.","zh":"在大乘佛教中，法身被描述为超越形相与形体。"},{"en":"Some texts explain the Buddha in terms of three bodies, including the dharmakaya.","zh":"一些经典用“三身”来解释佛陀，其中包括法身。"},{"en":"Meditation instructions sometimes point to experiencing reality as dharmakaya—open and ungraspable.","zh":"某些禅修指导会指向体验“法身”的实相——开放而不可执取。"}]}],"synonyms":["Dharma-body","法身","Trikaya (related concept)"],"phonetic":"/dɑr.məˈkɑ.jə/","extraExplanation":["“Dharmakaya”来自梵语 dharma（法、真理、教法）+ kāya（身、体）。常见于“三身”（Trikāya）思想：法身（dharmakaya）、报身（sambhogakaya）、化身/应身（nirmanakaya）。","不同传统对“法身”的理解略有差异：有的强调它是“真理本身/空性”的面向，有的强调它是佛的究竟境界；翻译与解释时要注意语境（哲学讨论、修行指引或宗教礼敬）。"]}
{"word":"Dharmapada","summary":{"en":"The Dharmapada is a well-known Buddhist text made of short verses teaching core moral and spiritual lessons.","zh":"《法句经》是一部由短偈组成的佛教经典，讲述重要的道德与修行要点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a famous Buddhist scripture (a collection of short verses) that summarizes key teachings such as karma, mindfulness, and compassion; it is part of the Pali Canon.","zh":"《法句经》：著名的佛教经典（由许多短偈/格言组成），概括了业力、正念、慈悲等核心教义；属于巴利语三藏的一部分。"},"examples":[{"en":"I read a few verses from the Dharmapada every morning to reflect on my actions.","zh":"我每天早上读几段《法句经》，用来反思自己的行为。"},{"en":"In class, we compared ideas from the Dharmapada with other ethical texts.","zh":"在课上，我们把《法句经》的思想与其他伦理文本作了比较。"}]}],"synonyms":["the Dhammapada","Buddhist scripture","Buddhist verses"],"phonetic":"/ˌdɑr.məˈpɑ.də/","extraExplanation":["“Dharmapada”来自巴利语 Dhammapada（梵语为 Dharmapada）。dharma/dhamma 可指“法、真理、教义、正道”，pada 可指“词句、偈颂、足（诗行）”，合起来常译作“法句/法句偈”。","这部经典以短小易记的偈颂呈现教导，常见主题包括：心念的重要性、自律、非暴力、智慧与解脱等。英文里也常用 the Dhammapada 指同一部作品（更贴近巴利语拼写）。"]}
{"word":"dharmas","summary":{"en":"“Dharmas” is the plural of “dharma,” meaning moral/ spiritual principles or teachings, and in Buddhist philosophy it can also mean individual phenomena that make up experience.","zh":"“Dharmas”是“dharma”的复数，常指道德/宗教原则或教义；在佛教哲学中也可指构成经验的“诸法/现象”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of dharma: in Hinduism and Buddhism, the basic teachings, moral principles, or duties that guide a person’s life and actions.","zh":"dharma 的复数：在印度教与佛教中，指指导人生与行为的基本教义、道德原则或应尽的责任/本分。"},"examples":[{"en":"In class we compared the dharmas taught in different Buddhist traditions.","zh":"在课上，我们比较了不同佛教传统所教授的诸多 dharmas（教义/原则）。"},{"en":"Many people try to live by dharmas such as compassion and honesty.","zh":"许多人努力遵循诸如慈悲与诚实之类的 dharmas（人生原则）。"}]},{"partOfSpeech":"n.","definition":{"en":"In some Buddhist philosophy, dharmas are the individual “things” or mental/physical events that make up experience (often translated as “phenomena”).","zh":"在某些佛教哲学中，dharmas 指构成经验的一个个“法”（心/身的事件或要素），常译为“现象”。"},"examples":[{"en":"The text lists dharmas like feelings, perceptions, and intentions.","zh":"这部典籍列举了诸如感受、知觉与意向等 dharmas（诸法/心理与身体现象）。"},{"en":"He studied how dharmas arise and pass away in meditation.","zh":"他研究在禅修中诸 dharmas（诸法/现象）如何生起又消逝。"}]}],"synonyms":["teachings","principles","duties","phenomena"],"phonetic":"/ˈdɑrməz/","extraExplanation":["“Dharma”源自梵语，核心含义很广：可指“法、教义、正道、秩序、责任/本分”。在佛教里既可指佛法/教法（the Dharma），也可指“诸法/现象”（dharmas）。","英文里常用大写“Dharma”表示“佛法/正法”这一整体概念；小写“dharma(s)”更常见于一般讨论或学术语境。"]}
{"word":"Dharmasastra","summary":{"en":"Dharmasastra: ancient Sanskrit “dharma” texts that describe moral duties and social/legal rules in Hindu tradition.","zh":"Dharmasastra：阐释“法/正道”（dharma）并规范社会与法律行为的古代梵语印度教文献传统。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A body of ancient Sanskrit texts and traditions that explain dharma (moral duty, proper conduct) and give guidance on religious, ethical, and legal rules in Hindu society.","zh":"（梵语）一类阐释“法/正道”（dharma）并提供宗教、伦理与社会法律规范的古代文献传统，常被视为印度教的法典与行为准则著作群。"},"examples":[{"en":"In a course on South Asian history, we read passages from the Dharmasastra to understand how social duties were described.","zh":"在南亚历史课程中，我们阅读《达摩论典》（Dharmasastra）的段落，以理解社会义务是如何被描述的。"},{"en":"Some scholars compare Dharmasastra rules with later Hindu legal practices in different regions of India.","zh":"一些学者会把《达摩论典》的规则与印度不同地区后来的印度教法律实践进行比较。"}]}],"synonyms":["Dharmaśāstra","Hindu law texts","Hindu legal-religious codes"],"phonetic":"ˌdɑr.məˈʃɑs.trə","extraExplanation":["“Dharmasastra”常见也写作“Dharmaśāstra”（带学术转写符号）。其中dharma大致指“应当如何生活/尽本分/合乎正道”，śāstra意为“论著、规程、学说”。","它不是单一一本书，而是一整套相关文本与传统。较有名的作品包括《摩奴法典》（Manusmriti）等，内容可能涉及阶层义务、婚姻家庭、继承、仪式与社会规范等。","现代讨论中需要注意：这些文本在不同时期与地区的权威性和实际执行程度并不相同，且其中某些规范与当代价值观可能存在冲突；学术研究通常会把它放在历史语境中理解。"]}
{"word":"Dharmashastra","summary":{"en":"Dharmashastra refers to ancient Sanskrit Hindu texts (and the related tradition) that explain dharma—moral and religious duties—and give guidance on law and social conduct.","zh":"Dharmashastra 指古代梵文印度教“法论书”及其相关传统，用来阐释 dharma（法与义务），并指导法律与社会行为规范。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a body of ancient Sanskrit texts that explain Hindu religious and moral duties (dharma) and give guidance on law, social rules, and proper conduct.","zh":"（梵语）《法论书》：一类古代梵文典籍，阐释印度教的宗教与道德义务（dharma），并提供关于法律、社会规范与行为准则的指导。"},"examples":[{"en":"In his research, he compares Dharmashastra with later Hindu legal practice.","zh":"在研究中，他把《法论书》和后来的印度教法律实践进行比较。"},{"en":"Dharmashastra texts often discuss family duties, inheritance, and social responsibilities.","zh":"《法论书》常常讨论家庭义务、继承问题和社会责任。"}]},{"partOfSpeech":"n.","definition":{"en":"(in a broad sense) the tradition or study of Hindu “law codes” and normative rules, especially as interpreted by scholars and commentators.","zh":"（广义）印度教“法典”与规范规则的传统或研究领域，尤指学者与注释家对其进行的解释体系。"},"examples":[{"en":"The course introduces Dharmashastra and its influence on South Asian history.","zh":"这门课介绍《法论书》及其对南亚历史的影响。"},{"en":"She specializes in Dharmashastra commentaries from the medieval period.","zh":"她专攻中世纪时期的《法论书》注释传统。"}]}],"synonyms":["Dharmaśāstra","Hindu law texts","Hindu legal tradition"],"phonetic":"ˈdɑrməˌʃɑstrə","extraExplanation":["“Dharmashastra”来自梵语 Dharma（法、义务、正道）+ Śāstra（论典、学术著作）。学术写法常见带变音符号的 “Dharmaśāstra”。","在英语语境中，它多用于宗教学、历史学与南亚研究，指一类规范性文本传统（常被翻作“印度教法”或“宗教法论”），但不等同于现代国家的成文法。","常被提到的相关作品包括《摩奴法典》（Manusmriti），它属于 Dharmashastra 传统中的代表文本之一。"]}
{"word":"dharmashastra","summary":{"en":"Dharmashastra refers to Hindu religious-legal writings about dharma (duty/ethics) and traditional rules.","zh":"Dharmashastra 指印度教关于 dharma（义务/伦理）与传统规范的宗教—法律类文献。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A category of Hindu religious-legal texts (often called “Dharmaśāstra”) that discuss duties (dharma), ethics, social rules, and traditional law.","zh":"（梵语词）印度教“法论/法典”类文献（常写作 Dharmaśāstra），讨论“法/义务”（dharma）、伦理、社会规范与传统法律。"},"examples":[{"en":"In his research, he compared Dharmashastra rules with local village customs.","zh":"在研究中，他把《法论》（Dharmashastra）的规则与地方村社习俗作了比较。"},{"en":"Many discussions of Hindu law mention Dharmashastra texts such as the Manusmriti.","zh":"很多关于印度教法的讨论会提到《法论》文献，例如《摩奴法典》（Manusmriti）。"}]}],"synonyms":["Dharmaśāstra","Hindu law texts","Smriti (in a broad context)"],"phonetic":"/dɑrˌmɑˈʃɑstrə/","extraExplanation":["“Dharmashastra”来自梵语：dharma（法、正道、责任、义务）+ śāstra（论著、学典）。英语里常把带重音符号的 “Dharmaśāstra” 简写成 “Dharmashastra”。","它并不等同于现代意义上的“国家法律条文”，更像结合宗教伦理、社会秩序与规范性论述的经典体系；不同地区与时代的解释和实践差异很大。","常见相关典籍：Manusmriti（《摩奴法典》）、Yajnavalkya Smriti 等。学术写作中常与 “Hindu law（印度教法）” “Smriti（传承文献）” 等概念一起出现。"]}
{"word":"dharmasmriti","summary":{"en":"Dharmasmriti refers to Hindu Smriti texts that explain dharma (duty/ethics) and often include legal and social rules.","zh":"Dharmasmriti 指印度教“Smriti 传承文献”中阐释 dharma（义务/伦理）并常涉及法律与社会规范的一类典籍。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group of Hindu Sanskrit texts (part of the Smriti tradition) that describe dharma—religious, moral, and social duties—and often include guidance on law, customs, and ethical conduct.","zh":"一类印度教梵语典籍（属于“传承文献/Smriti”传统），讨论“法/德行（dharma）”、宗教与社会义务，并常包含法律、习俗与伦理行为规范。"},"examples":[{"en":"In her research, she compared passages from the Dharmasmriti with local customary law.","zh":"在她的研究中，她把《达摩传承文献（Dharmasmriti）》中的段落与当地习惯法作比较。"},{"en":"The Manusmriti is one of the best-known works associated with the Dharmasmriti tradition.","zh":"《摩奴法典》（Manusmriti）是与 Dharmasmriti 传统相关的最著名作品之一。"}]}],"synonyms":["Dharmaśāstra","Smriti texts","Hindu law codes"],"phonetic":"ˌdɑrməˈsmrɪti","extraExplanation":["“Dharmasmriti”常写作“Dharma-smriti”，其中 dharma 可译为“法、正道、义务、德行”，smriti 字面义为“记忆/传承”，指相对于“启示经典（Shruti）”而言的人间传承文献。","在学术语境里，它常与“Dharmaśāstra（达摩论典/法学论典）”并用，讨论宗教义务与社会规范的关系；但不同地区、时代的解释差异很大，阅读时通常需要结合历史背景。","英语文章中该词多用于宗教学、印度学、历史法律研究；日常英语交流中较少见。"]}
{"word":"Dharmasutra","summary":{"en":"Dharmasutra: ancient Sanskrit texts on dharma—rules for ritual, law, ethics, and social duties.","zh":"Dharmasutra（法经）：古代印度梵文典籍，讲“达摩/法”，涵盖礼仪、法律、伦理与社会义务规范。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a category of ancient Indian Sanskrit texts that describe dharma (religious and social duties), especially rules for rituals, law, ethics, and daily conduct","zh":"《法经》（Dharmasūtra）：古代印度的梵文典籍类别，阐述“达摩/法”（宗教与社会义务），尤其包含祭祀礼仪、法律、伦理与日常行为规范等规则"},"examples":[{"en":"The Dharmasutra texts offer early guidance on rituals, family life, and social duties.","zh":"《法经》类文本为祭祀、家庭生活与社会义务提供了早期的指导。"},{"en":"In a South Asian history course, we read excerpts from a Dharmasutra to understand ancient legal ideas.","zh":"在南亚史课程中，我们阅读《法经》节选来理解古代法律观念。"}]}],"synonyms":["Dharmasūtra","Dharma sutra","dharma text","Hindu legal-religious text"],"phonetic":"/ˌdɑːrməˈsuːtrə/","extraExplanation":["“Dharmasūtra”由梵语 dharma（达摩/法：义务、正道、规范等）+ sūtra（经/ सूत्र：简短格言式条文）组成，因此常呈现为高度凝练的“规则条款”。","《法经》一般被认为早于更系统、更长篇的《法典/法论》（Dharmashastra，例如《摩奴法论》Manusmṛti），在研究印度早期社会规范与法律思想时很常被一起讨论。","学术写法常见两种拼法：连写 Dharmasutra（较简化）与带长音标记的 Dharmasūtra（更接近梵语转写）。英语中通常作为专有名词或类别名词使用（the Dharmasutras / a Dharmasutra）。"]}
{"word":"dharmasutra","summary":{"en":"Dharmasutra: an ancient Hindu Sanskrit text giving concise rules about dharma (moral/religious law and social duties).","zh":"Dharmasutra：古代印度教梵文经典，以简明条文规定“达摩”（宗教/道德法则与社会义务）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group of ancient Sanskrit Hindu texts that give rules and guidance on dharma (religious and moral law), especially for social duties, rituals, and legal practices","zh":"一类古代梵文印度教经典，内容主要是关于“达摩”（宗教与道德法则）的规范与指导，涵盖社会义务、仪式与法律实践等"},"examples":[{"en":"The Dharmasutras influenced later Hindu law codes and social customs.","zh":"《达摩经》影响了后来的印度教法典与社会习俗。"},{"en":"In class, we compared the Dharmasutras with later Dharmashastra texts.","zh":"在课堂上，我们比较了《达摩经》和后来的《达摩论》（Dharmashastra）文本。"}]}],"synonyms":["Hindu law text","Sanskrit sutra","Dharmashastra (related, later and more detailed)"],"phonetic":"ˈdɑrməˌsuːtrə","extraExplanation":["“Dharmasutra”由 dharma（达摩：义务、正法、道德秩序）+ sutra（经：简短条文、格言式规则）组成，因此常译作“达摩经/法经”。","它们通常写得非常简洁，像“规则清单”，方便背诵与口传；后期更系统、更详尽的相关作品常被归入“Dharmashastra”（达摩论/法论）。","学术写作中常以复数形式出现：Dharmasutras，指多部同类作品（如阿帕斯塔巴、鲍陀耶那等传统所传文本）。"]}
{"word":"dharmic","summary":{"en":"Dharmic means “related to dharma” and often refers to Indian religious traditions (Hinduism, Buddhism, Jainism, Sikhism) or to actions seen as morally right according to dharma.","zh":"Dharmic 指“与达摩/法有关”，常用于指印度宗教传统（印度教、佛教、耆那教、锡克教），或指符合达摩/正法的道德与本分之举。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to dharma (a key idea in Indian religions), or to religions and traditions where dharma is central—especially Hinduism, Buddhism, Jainism, and Sikhism.","zh":"与“达摩/法”（印度宗教中的核心概念）有关的；尤指以达摩/法为核心的宗教与传统，如印度教、佛教、耆那教和锡克教。"},"examples":[{"en":"Yoga is often discussed in a Dharmic context, alongside ideas like karma and liberation.","zh":"瑜伽常在达摩（法）的语境中被讨论，与业力和解脱等观念并列。"},{"en":"Some scholars compare Dharmic religions with Abrahamic religions to show different views of ethics and salvation.","zh":"一些学者会把达摩系宗教与亚伯拉罕诸教作比较，以展示它们在伦理与救赎观上的差异。"}]},{"partOfSpeech":"adj.","definition":{"en":"(More generally) Guided by dharma; morally right or in accordance with one’s duty (in traditional contexts).","zh":"（更广义）符合达摩/正法的；在传统语境中指合乎道德或合乎本分、职责的。"},"examples":[{"en":"In the story, the hero tries to make a Dharmic choice even when it is personally costly.","zh":"在故事中，英雄即使付出个人代价也努力做出符合正法的选择。"},{"en":"They described his actions as Dharmic—fair, restrained, and responsible.","zh":"他们形容他的行为很“达摩”——公正、克制且有担当。"}]}],"synonyms":["dharma-related","Hindu","Buddhist","Indic (in some contexts)","religious","ethical"],"phonetic":"/ˈdɑrmɪk/","extraExplanation":["“Dharmic”来自梵语 dharma（常译作“法/正法/秩序/责任/本分”等）。不同宗教与传统对 dharma 的理解不完全相同：在佛教里常对应“法（Dharma）”，在印度教语境里也常含“人生职责/社会与宇宙秩序”的意味。","英文中常见搭配：Dharmic religions（达摩系宗教）、Dharmic traditions（达摩传统）、Dharmic philosophy（达摩哲学）。注意它主要是学术或文化讨论用语，不等同于某一个单一宗教。","使用时建议尊重具体语境：如果在谈某个传统（如佛教或印度教），可更具体地说 Buddhist / Hindu 等；“Dharmic”更适合强调它们共享的一些观念框架。"]}
{"word":"dharmsala","summary":{"en":"“Dharmsala” usually refers to the Indian town Dharamsala (a Tibetan cultural center), and it can also mean a simple pilgrim guesthouse (dharamshala).","zh":"“Dharmsala”通常指印度城镇达姆萨拉（藏文化中心）；也可指简易的朝圣旅舍/施舍旅店（dharamshala）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a town in Himachal Pradesh, India, known as the home of the Dalai Lama and a major center of Tibetan culture (also spelled “Dharamsala” or “Dharamshala”).","zh":"印度喜马偕尔邦的一座城镇，以达赖喇嘛驻地和重要的藏文化中心而闻名（也拼作“Dharamsala / Dharamshala”）。"},"examples":[{"en":"Many travelers visit Dharmsala to experience Tibetan culture.","zh":"许多旅行者去达姆萨拉体验藏文化。"},{"en":"She studied meditation in Dharmsala for a month.","zh":"她在达姆萨拉学习冥想一个月。"}]},{"partOfSpeech":"n.","definition":{"en":"(South Asia) a simple guesthouse or rest house, traditionally offering affordable lodging, often for pilgrims (more commonly spelled “dharamshala”).","zh":"（南亚）简易旅舍/施舍旅店，传统上提供廉价住宿，常与朝圣者相关（更常拼作“dharamshala”）。"},"examples":[{"en":"They stayed in a small dharamshala near the temple.","zh":"他们住在寺庙附近的一家小施舍旅店里。"},{"en":"The dharamshala provides basic beds and meals.","zh":"这家施舍旅店提供基本的床位和餐食。"}]}],"synonyms":["Dharamsala","Dharamshala","McLeod Ganj (area in Dharamsala)"],"phonetic":"/dɑːrˈɑːmʃɑːlə/","extraExplanation":["“Dharmsala”常见于旧式或简化拼写；标准拼法多为“Dharamsala”（指城镇）或“dharamshala”（指旅舍）。","词源上与梵语/印地语“dharma（法、宗教/义务）+ shala（房屋/厅堂）”有关，因此“dharamshala”原意接近“宗教旅舍/施舍客栈”。","作为地名的Dharamsala尤指上达姆萨拉（McLeod Ganj），因藏人流亡社区与寺院而知名。"]}
{"word":"dharna","summary":{"en":"Dharna means a sit-in protest, especially in India; it can also be used as a verb meaning “to stage a sit-in.”","zh":"dharna 指（尤指印度的）静坐抗议；也可作动词，表示“举行静坐抗议”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a protest in which people sit (often outside an office or home) and refuse to leave until their demands are heard; used especially in India and South Asia","zh":"（尤指印度、南亚的）静坐抗议；示威者坐在某处并拒绝离开，直到诉求被听取或解决"},"examples":[{"en":"The workers staged a dharna outside the factory gate to demand unpaid wages.","zh":"工人们在工厂大门外举行静坐抗议，要求支付拖欠的工资。"},{"en":"Students held a dharna at the university administration building.","zh":"学生们在大学行政楼前举行了静坐抗议。"}]},{"partOfSpeech":"v.","definition":{"en":"to hold or carry out a dharna (to sit in protest)","zh":"举行静坐抗议；进行“dharna”式的抗议"},"examples":[{"en":"Local residents dharnaed outside the town hall after the water supply was cut.","zh":"断水后，当地居民在市政厅外进行静坐抗议。"}]}],"synonyms":["sit-in","protest","demonstration"],"phonetic":"/ˈdɑːrnə/","extraExplanation":["“Dharna”是英语里借自印地语/乌尔都语的词，常见于印度新闻与政治语境，指一种以“坐地不走”的方式施压的抗议形式，类似英语里的 sit-in，但更带有南亚地区的社会与政治色彩。","在英文写作中，多见用法是 “stage/hold a dharna”（举行静坐抗议）；作动词时较少见，但在报道中仍会出现，如 “They dharnaed outside…”"]}
{"word":"dharnas","summary":{"en":"Dharnas are sit-in protests common in South Asia, where people stay in a public place until demands are addressed.","zh":"Dharnas 指南亚常见的静坐抗议：人们在公共场所守候不走，直到诉求得到回应。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a protest method (common in South Asia) in which people sit in a public place—often outside an office or home—and refuse to leave until their demand is heard; a sit-in demonstration","zh":"（南亚常见的）静坐抗议；在公共场所（常在办公室或住宅外）守候不走，以迫使对方回应诉求的示威方式"},"examples":[{"en":"Workers held a dharna outside the factory gate to demand unpaid wages.","zh":"工人们在工厂大门外举行静坐抗议，要求补发欠薪。"},{"en":"Students organized a dharna in front of the administration building.","zh":"学生们在行政楼前组织了静坐示威。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of staging such a protest; to conduct a sit-in demonstration (often written as “to hold/stage a dharna”)","zh":"举行静坐抗议的行为；进行此类示威（常与 hold/stage 搭配）"},"examples":[{"en":"They planned to stage a dharna until the policy was changed.","zh":"他们计划举行静坐抗议，直到政策被改变。"},{"en":"Local leaders called for a dharna to oppose the new rules.","zh":"当地领袖呼吁举行静坐抗议，反对新规定。"}]}],"synonyms":["sit-in","demonstration","protest","peaceful protest"],"phonetic":"/ˈdɑrnə/","extraExplanation":["“dharna”源自印地语/乌尔都语（धर्ना/دھرنا），在印度、巴基斯坦等地的新闻报道中很常见。英语里通常把它当作可数名词：a dharna / dharnas。","在英语语境中，最自然的搭配是：hold/stage/organize a dharna（举行静坐抗议）、go on a dharna（开始静坐）、end/call off a dharna（结束/取消静坐）。","含义上接近 “sit-in (protest)” 或 “peaceful protest,” 但 “dharna”更带有南亚政治与街头抗议的地域文化色彩。"]}
{"word":"Dhaulagiri","summary":{"en":"Dhaulagiri is a famous Himalayan mountain massif in Nepal, especially known for the 8,167-meter peak Dhaulagiri I.","zh":"道拉吉里是尼泊尔著名的喜马拉雅山系，尤以海拔8,167米的道拉吉里I峰闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Dhaulagiri: a major mountain massif in the Himalayas of Nepal, best known for Dhaulagiri I (8,167 m), one of the world’s highest peaks.","zh":"道拉吉里（Dhaulagiri）：尼泊尔喜马拉雅山脉中的一座重要山系，其中的道拉吉里I峰（海拔8,167米）是世界最高峰之一。"},"examples":[{"en":"Dhaulagiri is one of Nepal’s most famous Himalayan peaks.","zh":"道拉吉里是尼泊尔最著名的喜马拉雅山峰之一。"},{"en":"The team planned a trek in the Annapurna region with views of Dhaulagiri.","zh":"这支队伍计划在安纳普尔纳地区徒步，并欣赏道拉吉里的景色。"},{"en":"Dhaulagiri I rises higher than many mountains in North America.","zh":"道拉吉里I峰比北美的许多山峰都要高。"}]}],"synonyms":["Dhaulagiri I (specific peak)","Dhaulagiri massif"],"phonetic":"/ˌdaʊləˈɡɪri/","extraExplanation":["“Dhaulagiri”源自梵语：dhavala（白色、明亮）+ giri（山），常被理解为“白色的山”。","道拉吉里I峰海拔8,167米，通常被列为世界第七高峰；在登山与地理写作中常与“Annapurna（安纳普尔纳）”“Himalayas（喜马拉雅山脉）”一起出现。"]}
{"word":"dhaura","summary":{"en":"“Dhaura” is commonly a South Asian local name for a tree (often Anogeissus latifolia), and it can also be a place name.","zh":"“Dhaura”常见为南亚地区对某种树（多指阔叶栎木 Anogeissus latifolia）的地方称呼，也可用作地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Indian English / South Asian usage) A local name for a tree used for timber and fuelwood, often referring to **Anogeissus latifolia** (sometimes also spelled *dhawra/dhaora* in different regions).","zh":"（印度英语/南亚用法）一种树的地方名称，常指**阔叶栎木（Anogeissus latifolia）**（不同地区也可拼作 *dhawra/dhaora*），常用于木材与燃料。"},"examples":[{"en":"The villagers collect dhaura wood for cooking fuel in the dry season.","zh":"村民在旱季收集dhaura木材作为做饭燃料。"},{"en":"Dhaura timber is valued for its hardness and durability.","zh":"Dhaura木材因坚硬耐用而受重视。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name (a village/area name) in South Asia, used as a proper noun.","zh":"（地名）南亚地区的村庄/区域名，用作专有名词。"},"examples":[{"en":"She is originally from Dhaura in northern India.","zh":"她来自印度北部的Dhaura。"}]}],"synonyms":["dhawra","dhaora"],"phonetic":"/ˈdaʊrə/","extraExplanation":["“Dhaura”多见于印度及周边地区的英语转写（romanization）。由于各地语言与拼写习惯不同，你也可能看到 *dhawra, dhaora, dhau* 等近似写法。","如果你是在某篇文章/地图/植物清单里看到它，提供上下文（句子或地区）可以更准确判断它指的是哪一种树或具体哪个地名。"]}
{"word":"dhauri","summary":{"en":"“Dhauri” is usually a South Asian proper name (place or person), not a common English word.","zh":"“Dhauri”通常是南亚地区的专有名词（地名或人名），并非常见英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper noun used as a place name or personal name in South Asia (not a standard English vocabulary word).","zh":"一个专有名词，多见于南亚地区作为地名或人名（不是标准英语词汇）。"},"examples":[{"en":"Dhauri is a small village name found in some parts of India.","zh":"Dhauri 在印度部分地区可见作为小村庄的名称。"},{"en":"Her family name is Dhauri.","zh":"她的姓氏是 Dhauri。"}]}],"phonetic":"/ˈdaʊri/","extraExplanation":["“Dhauri”在英语词典里通常查不到，更多是从印地语等语言音译过来的拼写，用于地名/姓氏/名字。","如果你想查的是英语单词，最常见的相近词是“dowry”（嫁妆/彩礼），有时会被误拼成类似“dhauri”。你可以告诉我上下文句子，我可以帮你确认具体想表达哪个词。"]}
{"word":"dhava","summary":{"en":"Dhava is mainly used as an Indian name, and in South Asian contexts it can also refer to a tree called dhava.","zh":"Dhava 主要用作印度人名；在南亚语境中也可指一种称为 dhava 的树。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name of Indian origin (often used for boys); also used as a family name in some communities.","zh":"印度起源的人名（常用于男名）；在一些社群中也可作姓氏。"},"examples":[{"en":"Dhava is a common-sounding modern name in some Indian families.","zh":"Dhava 在一些印度家庭里听起来像是较现代的人名。"},{"en":"I met someone named Dhava at a cultural festival.","zh":"我在一个文化节上认识了一个叫 Dhava 的人。"}]},{"partOfSpeech":"n.","definition":{"en":"(South Asian contexts) a type of tree known in Hindi/Sanskrit as dhava, often identified with the species Anogeissus latifolia.","zh":"（南亚语境）一种树，在印地语/梵语中称为 dhava，常被认为对应物种 Anogeissus latifolia（阔叶榄仁/阿诺盖苏斯属的一种树）。"},"examples":[{"en":"In some traditional texts, dhava is mentioned as a useful forest tree.","zh":"在一些传统文献中，dhava 被提到是一种有用的林木。"},{"en":"The guide pointed out the dhava trees along the dry hillside.","zh":"向导指着干燥山坡上的 dhava 树。"}]}],"synonyms":["(name)","(tree) Anogeissus latifolia"],"phonetic":"ˈdɑːvə","extraExplanation":["“Dhava”并不是常见的现代英语词汇；你更可能在印度姓名、地名、或介绍南亚植物/阿育吠陀与传统文献的英文材料中看到它。","不同地区与学术传统对“dhava”所指树种可能有差异；如果你是在某篇文章/书里看到的，我可以根据上下文帮你确认更准确的含义。"]}
{"word":"dhaw","summary":{"en":"“Dhaw” is a Scots/dialect spelling of “thaw,” meaning to melt (or make melt) after being frozen.","zh":"“dhaw”是“thaw”的苏格兰语/方言拼写，意思是（使）解冻、融化。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Scots/dialect) to thaw; to become warmer so that ice or snow melts, or to make something do so.","zh":"（苏格兰语/方言）解冻；融化；（使）冰雪因变暖而融化。"},"examples":[{"en":"The ice will dhaw in the sun.","zh":"冰在太阳下会融化。"},{"en":"Leave the meat out to dhaw before cooking.","zh":"烹饪前把肉放在外面解冻。"}]}],"synonyms":["thaw","defrost","melt"],"phonetic":"/θɔ/","extraExplanation":["“dhaw”主要见于苏格兰英语（Scots）或方言写法，对应标准英语的“thaw”。在正式写作中一般用“thaw”，在文学作品里用“dhaw”常用来呈现地方口音与地域身份。"]}
{"word":"dhawra","summary":{"en":"“Dhawra” is not a common English word; it is usually a transliterated proper name (person or place).","zh":"“Dhawra”不是常见英语词，通常是音译的专有名词（人名或地名）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (not a standard English vocabulary word). “Dhawra” is most often seen as a transliterated name (e.g., a person’s name or a place name).","zh":"专有名词（不是标准英语词汇）。“Dhawra”更常见于音译用法，例如人名或地名。"},"examples":[{"en":"Dhawra is the name of a small village on the map.","zh":"Dhawra 是地图上的一个小村庄名称。"},{"en":"I met someone named Dhawra at the conference.","zh":"我在会议上认识了一个叫 Dhawra 的人。"}]}],"phonetic":"/ˈdɑːwrə/","extraExplanation":["“Dhawra”在英语词典里通常查不到；更可能来自南亚语言（如印地语/乌尔都语）或其他语言的罗马字转写（transliteration）。不同来源语言会导致含义与读音差异很大。","如果你是从一句话、歌曲歌词、小说、聊天或地名里看到的，请把原句/语境发我（以及你认为的来源语言或国家），我就能更准确地给出含义、词性、用法和更自然的例句。"]}
{"word":"DHC","summary":{"en":"DHC is a common acronym; most often it refers to a Japanese skincare brand, but it can also mean “Deep Hydrocarbon Cycle” (Earth science) or De Havilland Canada aircraft models in aviation.","zh":"DHC 是常见缩写；最常见指日本护肤品牌，也可能指地球科学的“深部烃循环”，或航空领域的加拿大德哈维兰飞机型号缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A Japanese cosmetics and skincare brand name (often written as DHC).","zh":"日本的化妆品与护肤品牌名（常写作 DHC）。"},"examples":[{"en":"She uses DHC cleansing oil to remove makeup.","zh":"她用 DHC 的卸妆油来卸妆。"},{"en":"DHC is known for its olive-oil-based skincare products.","zh":"DHC 以橄榄油相关的护肤产品而闻名。"}]},{"partOfSpeech":"other","definition":{"en":"An acronym used in some technical contexts for “Deep Hydrocarbon Cycle,” a concept in Earth science about how carbon moves deep within the Earth.","zh":"在一些技术语境中指“深部烃循环（Deep Hydrocarbon Cycle）”，即地球科学里关于碳在地球深部如何循环移动的概念。"},"examples":[{"en":"The paper discusses the DHC and the origin of methane underground.","zh":"这篇论文讨论了深部烃循环（DHC）以及地下甲烷的来源。"},{"en":"Researchers debate how significant the DHC is compared with surface carbon cycles.","zh":"研究人员在讨论：与地表碳循环相比，深部烃循环（DHC）到底有多重要。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation used in aviation for De Havilland Canada aircraft models (e.g., DHC-6 Twin Otter).","zh":"航空领域中用于加拿大德哈维兰（De Havilland Canada）飞机型号的缩写（如 DHC-6 “双水獭”）。"},"examples":[{"en":"They flew a DHC-6 Twin Otter to the island airport.","zh":"他们乘坐一架 DHC-6 “双水獭”飞往海岛机场。"},{"en":"The airline operates several DHC aircraft for short regional routes.","zh":"这家航空公司用多架 DHC 飞机执飞短程支线。"}]}],"synonyms":["(brand) DHC skincare","Deep Hydrocarbon Cycle","De Havilland Canada"],"phonetic":"/ˌdiː.eɪtʃˈsiː/","extraExplanation":["“DHC”最常见的公众用法通常是日本护肤品牌（很多人会直接说“DHC 卸妆油”）。但它也是缩写，在不同领域含义不同；如果你告诉我你看到它的场景（护肤/论文/飞机/聊天），我可以帮你锁定最准确的意思。"]}
{"word":"DHE","summary":{"en":"DHE is an abbreviation most commonly meaning dihydroergotamine (a migraine medicine), and in some contexts it can mean Department of Higher Education.","zh":"DHE是一个缩写，最常见指二氢麦角胺（偏头痛用药）；在部分语境下也可指高等教育部门（Department of Higher Education）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(medicine) Dihydroergotamine, a prescription drug used to treat migraine headaches (often given as a nasal spray or injection).","zh":"（医学）二氢麦角胺：一种处方药，用于治疗偏头痛（常见为鼻喷剂或注射剂）。"},"examples":[{"en":"The doctor prescribed DHE to stop her migraine quickly.","zh":"医生开了DHE来快速缓解她的偏头痛。"},{"en":"In the emergency room, he received DHE by injection.","zh":"在急诊室里，他接受了DHE注射治疗。"}]},{"partOfSpeech":"other","definition":{"en":"(education/government, in some regions) Department of Higher Education.","zh":"（教育/政府，部分地区用法）高等教育部门（Department of Higher Education）。"},"examples":[{"en":"The scholarship program is administered by the DHE.","zh":"该奖学金项目由DHE负责管理。"},{"en":"Check the DHE website for university accreditation information.","zh":"可查看DHE官网获取大学认证信息。"}]}],"synonyms":["dihydroergotamine","Department of Higher Education"],"phonetic":"/diː eɪtʃ iː/","extraExplanation":["“DHE”多为缩写，具体含义取决于语境与地区。医疗语境里较常见的是“dihydroergotamine（二氢麦角胺）”，常用于偏头痛急性发作；政府/教育语境里则可能指“Department of Higher Education（高等教育部门）”。如果你告诉我出现它的句子或领域（医学、学校文件、新闻等），我可以帮你锁定最准确的释义。"]}
{"word":"DHEA","summary":{"en":"DHEA is a hormone made by the adrenal glands, and it also refers to a supplement containing that hormone.","zh":"DHEA 是一种由肾上腺产生的激素，也可指含这种激素的补充剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hormone made mainly by the adrenal glands (short for dehydroepiandrosterone); the body can use it to make other hormones such as testosterone and estrogen.","zh":"一种主要由肾上腺分泌的激素（dehydroepiandrosterone 的缩写，中文常译“脱氢表雄酮”）；人体可用它来合成其他激素，如睾酮和雌激素。"},"examples":[{"en":"DHEA levels naturally decline with age.","zh":"DHEA 水平会随着年龄增长而自然下降。"},{"en":"The doctor ordered a blood test to check her DHEA level.","zh":"医生开了血液检查来测她的 DHEA 水平。"}]},{"partOfSpeech":"n.","definition":{"en":"a dietary supplement containing DHEA, sometimes taken with the goal of affecting energy, aging, or hormone balance (effects and safety depend on the person and dose).","zh":"含 DHEA 的膳食补充剂，有些人用来期望改善精力、抗衰老或调节激素（效果与安全性因人及剂量而异）。"},"examples":[{"en":"He started taking DHEA after seeing it advertised as an anti-aging supplement.","zh":"他看到它被宣传成“抗衰老补充剂”后开始服用 DHEA。"},{"en":"Ask a healthcare professional before using DHEA, especially if you have hormone-related conditions.","zh":"使用 DHEA 前最好咨询医护人员，尤其是有激素相关疾病的人。"}]}],"synonyms":["dehydroepiandrosterone","prasterone","DHEA-S (related form)"],"phonetic":"/ˈdiːhiə/","extraExplanation":["DHEA 常见读法是 “DEE-hee-uh”，也有人按字母读 “D-E-A”。","在医学与补充剂语境里，DHEA 可能涉及激素水平与内分泌问题；它可能与某些疾病、药物（如激素治疗、避孕药等）相互影响。实际使用与检测应遵循医生建议。","相关术语：DHEA-S（DHEA sulfate，硫酸脱氢表雄酮）是血检中更常测的一种形式。"]}
{"word":"Dhekelia","summary":{"en":"Dhekelia is best known as a UK Sovereign Base Area (military territory) on Cyprus; it can also refer to the nearby village/region.","zh":"Dhekelia（德凯利亚）最常指英国在塞浦路斯的主权基地（军事领土）；也可指附近的村庄/地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A British Sovereign Base Area (military territory) on the island of Cyprus, used by the United Kingdom as a permanent military base.","zh":"德凯利亚：位于塞浦路斯岛上的英国主权基地（军事领土），英国长期用于军事驻扎与行动。"},"examples":[{"en":"He was stationed at Dhekelia while serving in the British Army.","zh":"他在英国军队服役期间被派驻在德凯利亚。"},{"en":"Flights and operations from Dhekelia are often mentioned in news about the Eastern Mediterranean.","zh":"涉及东地中海局势的新闻里，经常会提到从德凯利亚出发的航班或军事行动。"}]},{"partOfSpeech":"n.","definition":{"en":"A nearby village/area in Cyprus whose name is commonly used to refer to the surrounding region, including the base.","zh":"德凯利亚：塞浦路斯的一个村庄/地区名称，人们也常用它来泛指周边区域（包括基地一带）。"},"examples":[{"en":"They drove past the village of Dhekelia on the way to Larnaca.","zh":"他们去拉纳卡的路上经过了德凯利亚村。"}]}],"synonyms":["Dhekelia Sovereign Base Area","SBA Dhekelia","Eastern Sovereign Base Area"],"phonetic":"/dəˈkiːliə/","extraExplanation":["“Dhekelia（德凯利亚）主权基地”与“Akrotiri（阿克罗蒂里）主权基地”是英国在塞浦路斯的两块主权基地，源于1960年塞浦路斯独立时的安排；它们属于英国海外领土体系的一部分，但地理上位于塞浦路斯岛上。","在媒体语境中，“Dhekelia”常与军事、外交、地区安全（如东地中海局势）联系在一起；写作时可用更具体的说法：the Dhekelia Sovereign Base Area / the Eastern Sovereign Base Area。"]}
{"word":"Dheneb","summary":{"en":"Dheneb is an uncommon spelling of Deneb, a famous bright star (Alpha Cygni).","zh":"Dheneb 是 Deneb（天津四、天鹅座α星）的一种不常见拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper name) A less common spelling/romanization of **Deneb**, the bright star Alpha Cygni (often called “the Tail,” from Arabic), one of the most prominent stars in the Northern Hemisphere.","zh":"（专有名词）**Deneb（天津四）**的另一种较少见的拼写/转写方式；Deneb 是天鹅座α星，北半球非常显眼的一颗亮星，名称源自阿拉伯语，常与“尾巴”之意相关。"},"examples":[{"en":"On some older star charts, **Dheneb** appears as a variant spelling of Deneb.","zh":"在一些较旧的星图上，**Dheneb**会作为 Deneb 的异体拼写出现。"},{"en":"Deneb (sometimes written **Dheneb**) is part of the Summer Triangle with Vega and Altair.","zh":"Deneb（有时写作 **Dheneb**）与 Vega（织女星）和 Altair（牛郎星）组成“夏季大三角”。"}]}],"synonyms":["Deneb","Alpha Cygni"],"phonetic":"/ˈdɛnəb/","extraExplanation":["“Dheneb”并不是现代天文学中最常见的标准拼写，更常见的是 **Deneb**。它多见于不同语言的转写系统、旧文献或旧星图中。","Deneb 的名称与一些阿拉伯语星名传统有关（常见解释为与“尾巴”相关），所以在不同资料里可能出现多个接近的拼法。"]}
{"word":"dheneb","summary":{"en":"Dheneb is usually a variant spelling of Deneb, the bright star in Cygnus and a corner of the Summer Triangle.","zh":"Dheneb 通常是 Deneb 的拼写变体，指天鹅座的亮星天津四，也是“夏季大三角”的一角。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Deneb: a very bright star (Alpha Cygni) in the constellation Cygnus (the Swan), one of the three stars of the “Summer Triangle.”","zh":"天津四（Deneb）：天鹅座中最亮的恒星（天鹅座α），也是“夏季大三角”的三颗主星之一。"},"examples":[{"en":"On clear summer nights, you can spot Deneb as one corner of the Summer Triangle.","zh":"在夏天晴朗的夜晚，你可以把天津四看作“夏季大三角”的一个角。"},{"en":"Deneb lies in the constellation Cygnus, near the Milky Way.","zh":"天津四位于天鹅座，靠近银河。"}]},{"partOfSpeech":"other","definition":{"en":"(Less common, in star names) a spelling variant of “Deneb,” used in some older or alternative transliterations.","zh":"（较少见，用于星名）“Deneb”的一种拼写变体，常见于较旧或不同的音译写法。"},"examples":[{"en":"Some old astronomy lists write Deneb as “Dheneb.”","zh":"有些旧的天文学资料会把 Deneb 写成 “Dheneb”。"}]}],"synonyms":["Deneb"],"phonetic":"/ˈdɛnəb/","extraExplanation":["“Deneb / Dheneb”这个名字来自阿拉伯语词根 *dhanab*（ذنب），意思是“尾巴”。因此在一些传统星名里，你会看到它表示“某某的尾端/尾巴”。","天津四是最容易辨认的亮星之一：它和织女星（Vega）、牛郎星（Altair）一起构成“夏季大三角”，常被用来做夜空定位。"]}
{"word":"dheri","summary":{"en":"Dheri usually means “a heap/pile,” mainly in South Asian English contexts (from Hindi/Urdu).","zh":"Dheri 通常指“一堆/一摞”，多见于南亚英语语境（源自印地语/乌尔都语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a heap or pile (a transliteration of Hindi/Urdu ढेरी, often seen in South Asian English contexts)","zh":"一堆；一摞；堆积物（源自印地语/乌尔都语“ढेरी”的音译，在南亚英语语境中偶尔可见）"},"examples":[{"en":"There was a dheri of sand beside the road.","zh":"路边有一堆沙子。"},{"en":"He left a dheri of books on the table.","zh":"他在桌上放了一摞书。"}]}],"synonyms":["heap","pile","mound"],"phonetic":"/ˈdeɪri/","extraExplanation":["“dheri/ḍherī”在标准英语词典里不常作为英语词条出现，更常见于把印地语/乌尔都语词“ढेरी/ڈھیری”（意为“堆、垛”）直接用拉丁字母拼写出来的场景，例如南亚地区的英文对话、社交媒体或翻译文本。","如果你是在英文写作或考试中使用，通常用更常见的英语词 heap / pile / mound 会更自然。"]}
{"word":"dheubh","summary":{"en":"“dheubh” is not a standard English word; it’s likely a typo or a non-word string.","zh":"“dheubh”不是标准英语单词；更可能是拼写错误或无意义的字母串。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a recognized English word. It may be a typo, a username, or a made-up string of letters.","zh":"不是常见或标准的英语单词。可能是拼写错误、用户名，或随意组合的字母串。"},"examples":[{"en":"I can’t find “dheubh” in an English dictionary—did you mean another word?","zh":"我在英语词典里找不到“dheubh”——你是不是想写另一个词？"},{"en":"If you tell me the sentence where you saw “dheubh,” I can help guess the intended word.","zh":"如果你告诉我“dheubh”出现在哪个句子里，我可以帮你推测你原本想表达的词。"}]}],"extraExplanation":["“dheubh”看起来不像英语构词规则里常见的拼写组合，更像是键盘误触或打乱的字母。你可以：\n1）发一下原句/上下文；\n2）告诉我你想表达的意思（例如“高兴/困难/突然”等）；\n3）或给出可能的正确拼写开头（比如 de-/di-/du-）。我就能更准确地帮你找到目标单词。"]}
{"word":"DHHS","summary":{"en":"DHHS usually refers to the U.S. Department of Health and Human Services (or a state agency with the same name).","zh":"DHHS 通常指美国的“卫生与公共服务部”（或同名的州级机构）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(U.S.) the Department of Health and Human Services; a federal government department responsible for public health, healthcare programs, and human services.","zh":"（美国）卫生与公共服务部；联邦政府部门，负责公共卫生、医疗项目与社会/公共服务等事务。"},"examples":[{"en":"DHHS oversees programs like Medicare, Medicaid, and public health initiatives.","zh":"DHHS 负责监管诸如 Medicare（联邦医疗保险）、Medicaid（医疗补助）以及公共卫生项目等。"},{"en":"The new guidance from DHHS affects how hospitals report infections.","zh":"DHHS 发布的新指南会影响医院如何上报感染情况。"}]},{"partOfSpeech":"n.","definition":{"en":"(Some U.S. states) a state-level Department of Health and Human Services (or similarly named agency).","zh":"（美国部分州）州级的“卫生与公共服务厅/部”（或类似名称的机构）。"},"examples":[{"en":"Contact your state DHHS office to apply for food assistance.","zh":"申请食品援助可以联系你所在州的 DHHS 办公室。"},{"en":"The state DHHS announced new eligibility rules for childcare support.","zh":"州 DHHS 宣布了新的托儿补助资格规则。"}]}],"synonyms":["HHS","Department of Health and Human Services","Dept. of Health and Human Services"],"phonetic":"/ˌdiː eɪtʃ eɪtʃ ˈɛs/","extraExplanation":["在正式写作中，联邦层面的机构更常写作 **HHS**（U.S. Department of Health and Human Services），但在一些文件、州政府网站或旧式缩写中仍会看到 **DHHS**。是否用 DHHS 取决于机构的官方名称与当地习惯。","该缩写通常出现在政府公告、政策文件、医疗与社会服务申请材料中；口语里一般会逐个字母念（D-H-H-S）。"]}
{"word":"dhikr","summary":{"en":"Dhikr is an Islamic devotional practice of remembering God, often by repeating short prayers or God’s names.","zh":"Dhikr指伊斯兰教中通过反复念诵祷词或真主尊名来“记念真主”的修持。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Islam) the devotional act of remembering God, often by repeating God’s names, short prayers, or Qur’anic phrases—silently or aloud.","zh":"（伊斯兰教中）“记念真主”的宗教修持，常通过默念或诵念真主的尊名、短祷词或《古兰经》语句来进行。"},"examples":[{"en":"After the prayer, he sat quietly and did dhikr for a few minutes.","zh":"礼拜之后，他安静地坐着做了几分钟的dhikr（记念真主）。"},{"en":"In some gatherings, dhikr is recited together in a steady rhythm.","zh":"在一些集会中，人们会以稳定的节奏一起诵念dhikr。"},{"en":"She finds dhikr calming when she feels anxious.","zh":"当她感到焦虑时，dhikr能让她平静下来。"}]},{"partOfSpeech":"n.","definition":{"en":"A specific dhikr formula or set of phrases used for devotion (for example, a repeated short prayer).","zh":"一种具体的dhikr诵词／固定念诵语（例如反复念诵的短祷词）。"},"examples":[{"en":"His teacher gave him a dhikr to repeat each morning.","zh":"老师给了他一段dhikr，让他每天早晨重复念诵。"},{"en":"This dhikr is commonly said after the evening prayer.","zh":"这段dhikr常在晚礼拜后念诵。"}]}],"synonyms":["remembrance (of God)","devotional remembrance","zikr"],"phonetic":"/ˈdɪkər/","extraExplanation":["“Dhikr”来自阿拉伯语 ذِكْر（也常拼作 zikr / dhik'r），核心含义是“记念、提及”。在不同地区与宗教传统中，dhikr既可能是个人安静默念，也可能是团体齐诵（有的传统会配合节奏、呼吸或吟唱）。","在英文语境中使用时，dhikr通常作为借词出现，写作 dhikr 或 zikr；是否大写取决于句子位置与写作风格。"]}
{"word":"dhikrs","summary":{"en":"“Dhikrs” is the plural of “dhikr,” meaning Islamic remembrance of God, often through repeated prayers or phrases.","zh":"“dhikrs”是“dhikr”的复数，指伊斯兰传统中通过反复诵念祈祷词或赞词来“记念真主”的修持方式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “dhikr”: Islamic devotional acts of remembering God, often by repeating short prayers or phrases.","zh":"“dhikr”的复数：伊斯兰传统中“记念真主/安拉”的敬拜方式，常通过反复诵念简短祈祷词或赞词来进行。"},"examples":[{"en":"Many Muslims do dhikrs after the daily prayers.","zh":"许多穆斯林会在每日礼拜后做dhikrs（记念真主的诵念）。"},{"en":"In the gathering, people performed dhikrs quietly and respectfully.","zh":"在聚会中，人们安静而庄重地进行dhikrs。"}]},{"partOfSpeech":"n.","definition":{"en":"More broadly (especially in Sufi contexts), repeated chanting or recitation used for spiritual focus and mindfulness.","zh":"更广义地说（尤其在苏菲传统中），一种反复吟诵/诵念以帮助专注、安定心神与修持的方式。"},"examples":[{"en":"The group dhikrs helped him feel calmer and more focused.","zh":"集体dhikrs让他感觉更平静、更专注。"},{"en":"She learned different dhikrs for gratitude and patience.","zh":"她学习了不同的dhikrs，用来培养感恩与耐心。"}]}],"synonyms":["remembrance","devotional recitation","chanting","invocation"],"phonetic":"/ˈdɪkər/","extraExplanation":["“dhikr”来自阿拉伯语 ذِكْر（意为“记念/提及”）。英语里也常见拼写变体：dhikr / zikr / thikr；复数可写作 dhikrs（英语化复数）或 adhkār（阿拉伯语复数，在宗教语境中也常见）。","在不同文化与社群中，dhikr 的形式可能是安静的默念，也可能是集体的诵念/吟诵；具体做法与场合通常与当地传统、宗派与礼仪习惯有关。"]}
{"word":"Dhiman","summary":{"en":"Dhiman is a South Asian name (surname or given name), often linked to the idea of wisdom or intelligence.","zh":"Dhiman 是一个南亚常见的人名（可作姓或名），常与“智慧、聪慧”的含义相关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a South Asian (especially Indian) surname and given name; often associated with communities in North India.","zh":"一个南亚（尤其是印度）常见的姓氏和名字；常见于印度北部一些社群。"},"examples":[{"en":"Mr. Dhiman works in our finance department.","zh":"Dhiman 先生在我们的财务部门工作。"},{"en":"Dhiman is a common surname in parts of North India.","zh":"Dhiman 是印度北部一些地区常见的姓氏。"}]},{"partOfSpeech":"other","definition":{"en":"(from Sanskrit roots, used as a name) “intelligent,” “wise,” or “thoughtful.”","zh":"（源自梵语词根，用作人名）意为“聪慧的 / 有智慧的 / 善思考的”。"},"examples":[{"en":"They chose the name Dhiman because it suggests wisdom.","zh":"他们选择 Dhiman 这个名字，因为它有“智慧”的含义。"},{"en":"In some families, Dhiman is used as a boy’s first name.","zh":"在一些家庭里，Dhiman 也会用作男孩的名字。"}]}],"phonetic":"/ˈdiːmɑːn/","extraExplanation":["“Dhiman”多见于印度人名系统：既可能是姓，也可能是名。不同地区与语言（如印地语、旁遮普语等）中，具体读音与拼写习惯可能略有差异。","词源上常被解释为与梵语中表示“智慧/理解力”的词根相关，因此在取名文化里带有积极寓意。"]}
{"word":"Dhiren","summary":{"en":"Dhiren is a South Asian male given name, often associated with being calm and wise.","zh":"Dhiren 是常见于南亚的男性名字，常与“沉稳、睿智”相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name (personal name), used especially in South Asia (notably India); often carries the sense of “steady, calm, wise.”","zh":"男性名字（人名），常见于南亚（尤其印度）；常带有“沉稳、冷静、睿智”的含义。"},"examples":[{"en":"Dhiren is my colleague from Mumbai.","zh":"Dhiren 是我来自孟买的同事。"},{"en":"Please welcome Dhiren to the team.","zh":"请欢迎 Dhiren 加入团队。"}]}],"phonetic":"/ˈdɪrɛn/","extraExplanation":["“Dhiren”多被认为源自梵语词根，与“dhīra（沉着、坚定、明智）”相关；在一些解释中也可理解为“沉稳/贤明之人”或“沉着者之主（-en / -endra 类后缀在名字中常见）”。","作为人名，拼写可能有变体（如 Dhirendra、Dhiraj 等），不同家庭/地区的取名传统会影响具体含义与读音。"]}
{"word":"DHL","summary":{"en":"DHL is a well-known international courier and logistics company; informally it can also mean a package shipped by DHL.","zh":"DHL是知名的国际快递与物流公司；口语中也可指由DHL寄送的包裹/快件。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a global express delivery and logistics company (brand name), known for international shipping and courier services","zh":"DHL（品牌名）：全球性的快递与物流公司，以国际运输与速递服务闻名"},"examples":[{"en":"I shipped the documents to Tokyo by DHL.","zh":"我用DHL把文件寄到东京。"},{"en":"DHL will deliver the package tomorrow before noon.","zh":"DHL会在明天中午前送达包裹。"},{"en":"Tracking shows the DHL parcel is in customs now.","zh":"物流追踪显示这件DHL包裹正在清关。"}]},{"partOfSpeech":"n.","definition":{"en":"a shipment or package handled by DHL (informal)","zh":"（非正式）由DHL承运的快件/包裹"},"examples":[{"en":"Your DHL is at the front desk.","zh":"你的DHL（快递）在前台。"},{"en":"I’m waiting for a DHL from Germany.","zh":"我在等一个从德国寄来的DHL快递。"}]}],"synonyms":["courier","express delivery service","logistics company","shipping company"],"phonetic":"/ˌdiː eɪtʃ ˈɛl/","extraExplanation":["“DHL”来自三位创办人姓氏首字母：Dalsey、Hillblom、Lynn。后来成为德国邮政旗下的重要国际物流品牌。","口语里人们常把“DHL”直接当作“快递/包裹”来指代，但正式写作中更清楚的说法是“a DHL shipment/package”或直接说“a package sent by DHL”。"]}
{"word":"Dhlos","summary":{"en":"“Dhlos” isn’t a standard English word; you may mean “DHL” (shipping company) or “dholes” (wild dogs).","zh":"“Dhlos”不是标准英语词；你可能想写“DHL”（快递/物流公司）或“dholes”（豺，野犬的复数）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “DHL” (an international shipping company).","zh":"不是标准英语单词。很可能是把 “DHL”（一家国际快递/物流公司）拼错了。"},"examples":[{"en":"I sent the documents by DHL.","zh":"我用 DHL 寄出了文件。"},{"en":"The package is arriving tomorrow via DHL.","zh":"包裹将通过 DHL 明天送达。"}]},{"partOfSpeech":"n.","definition":{"en":"(If you meant “dholes”) A “dhole” is a wild dog found in Asia; “dholes” is the plural form.","zh":"（如果你想写 “dholes”）“dhole” 指一种生活在亚洲的野犬；“dholes” 是其复数形式。"},"examples":[{"en":"Dholes often hunt in packs.","zh":"豺通常会群体捕猎。"}]}],"phonetic":"/diː eɪtʃ ˈɛl/","extraExplanation":["“DHL”是品牌名，通常按字母读（D-H-L），写作全大写更常见。","如果你告诉我你想表达的是“快递公司/物流”还是“动物（豺）”，我可以给你更准确的一条词条与更多例句。"]}
{"word":"DHM","summary":{"en":"DHM most commonly refers to a time format meaning “days, hours, minutes,” but it can also be a context-dependent acronym in many fields.","zh":"DHM最常见可指“天、小时、分钟”的时长格式，但也可能是在不同领域中含义依上下文变化的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(time) An abbreviation for “days, hours, minutes,” used to show a duration.","zh":"（时间）“days, hours, minutes”的缩写，用来表示持续时间/时长。"},"examples":[{"en":"Estimated delivery time: 2DHM.","zh":"预计送达时间：2天0小时0分钟（2DHM）。"},{"en":"The task took 0D 3H 15M (often written as 0DHM in some logs).","zh":"这个任务用了0天3小时15分钟（有些日志里会简写成0DHM）。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation that can stand for different names in different fields (e.g., a company, department, project, or technical term). The exact meaning depends on context.","zh":"在不同领域里可能代表不同名称的缩写（例如公司/部门/项目/技术术语等），具体含义要看上下文。"},"examples":[{"en":"What does DHM mean in this email?","zh":"这封邮件里的DHM是什么意思？"},{"en":"DHM is used differently in different industries, so please define it the first time you use it.","zh":"DHM在不同行业的用法不同，所以首次使用时请先说明它代表什么。"}]}],"synonyms":["days-hours-minutes (time format)","acronym","abbreviation"],"phonetic":"/di eɪtʃ ɛm/","extraExplanation":["DHM不是一个“通用且唯一”的英文缩写；你在看到它时，最好查看它出现的场景（例如软件界面、物流/工时记录、医学/工程文件、公司组织架构等）。","如果你把包含DHM的完整句子或截图发来，我可以根据上下文帮你判断它在该处最可能的意思。"]}
{"word":"dhobee","summary":{"en":"A dhobee is a laundry worker, especially in South Asia (also spelled dhobi).","zh":"dhobee 指洗衣工，尤指南亚地区（也拼作 dhobi）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asia) a person whose job is washing clothes; a laundry worker (often used in Indian English, and sometimes in older British English).","zh":"（南亚）以洗衣为业的人；洗衣工（常见于印度英语，也见于较旧的英式英语用法）。"},"examples":[{"en":"We left our clothes with the dhobee and picked them up the next day.","zh":"我们把衣服交给洗衣工，第二天去取。"},{"en":"In some neighborhoods, a dhobee will collect laundry door to door.","zh":"在一些社区，洗衣工会挨家挨户上门收取要洗的衣物。"}]}],"synonyms":["dhobi","laundry worker","washerman","laundryman"],"phonetic":"/doʊˈbiː/","extraExplanation":["“dhobee”是“dhobi”的另一种拼写，来自印地语/乌尔都语等南亚语言，指传统的洗衣职业。该词在历史上也常出现在殖民时期的英语文本中。","在现代语境中，为了更中性或更普遍的表达，可以用“laundry worker / laundryman / washer”或直接说“someone who does the laundry”。在跨文化交流时，使用中性表达通常更稳妥。"]}
{"word":"dhobey","summary":{"en":"Dhobey means a laundry worker, especially in South Asia (more commonly spelled dhobi).","zh":"Dhobey 指洗衣工（尤指南亚地区；更常见拼写为 dhobi）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person (especially in South Asia) whose job is washing clothes; a laundry worker.","zh":"（尤指南亚）以洗衣为业的人；洗衣工。"},"examples":[{"en":"She sent her clothes to the dhobey every Friday.","zh":"她每周五把衣服送去给洗衣工洗。"},{"en":"In some Indian towns, dhobeys still wash clothes by hand at the river.","zh":"在一些印度城镇，洗衣工仍会在河边手洗衣物。"}]}],"synonyms":["dhobi","laundry worker","washer","launderer"],"phonetic":"/ˈdoʊbi/","extraExplanation":["“dhobey”常见为拼写变体，更常见的形式是“dhobi”（也写作“dhobie”）。这个词来自印地语/乌尔都语“धोबी / dhobī”，原意就是“洗衣的人”。在英语中多用于描写南亚生活与文化语境（如旅行写作、历史或文学作品）。","使用时注意语气：它是职业称呼，但在某些语境里可能带有旧殖民时期的“外来凝视”色彩；如果是在现实交流中，表达尊重更推荐用“laundry worker / washer / laundry service”。"]}
{"word":"dhobi","summary":{"en":"A “dhobi” is a professional clothes washer, especially in South Asia.","zh":"“dhobi”指以洗衣为业的人，尤用于指南亚语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person (especially in South Asia) whose job is washing clothes; a professional washerman or laundress","zh":"（尤指南亚）以洗衣为业的人；洗衣工（男）/洗衣妇（女）"},"examples":[{"en":"The hotel sends its linens to a local dhobi for washing.","zh":"这家酒店把床单送到当地的dhobi那里清洗。"},{"en":"In the village, a dhobi came once a week to collect and return clean clothes.","zh":"在村里，每周都有一位dhobi来收衣服并送回洗净的衣物。"}]}],"synonyms":["launderer","laundry worker","washerman","washerwoman"],"phonetic":"/ˈdoʊbi/","extraExplanation":["“Dhobi”常见于印度、巴基斯坦、孟加拉等地区的英语语境中，带有明显的地域与文化色彩；在其他英语国家更常用“launderer / laundry worker”。","词源来自印地语/乌尔都语 dhobī，源自动词 dhonā（“洗”）。在一些城市里也能见到“dhobi ghat”（公共洗衣场/洗衣码头）这样的地名或表达。","使用时建议注意语境：它通常是中性职业称呼，但在涉及阶层/族群历史的讨论中要保持尊重与准确。"]}
{"word":"dhobie","summary":{"en":"A South Asian laundry worker; a washerman (also spelled dhobi).","zh":"南亚的洗衣工/洗衣匠（也拼作 dhobi）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a washerman or laundry worker in South Asia (especially in India and Pakistan); someone whose job is washing and ironing clothes.","zh":"（南亚，尤指印度、巴基斯坦）洗衣工、洗衣匠；以洗涤、熨烫衣物为业的人。"},"examples":[{"en":"We sent the hotel shirts to the dhobie to be washed and pressed.","zh":"我们把酒店的衬衫送去给洗衣工清洗并熨烫。"},{"en":"In the novel, the dhobie’s stall is a busy meeting point in the neighborhood.","zh":"在小说里，洗衣摊是社区里很热闹的聚集点。"}]}],"synonyms":["dhobi","washerman","laundry worker"],"phonetic":"/ˈdoʊbi/","extraExplanation":["“dhobie”也常写作“dhobi”，来自印地语/乌尔都语“dhobi”（洗衣人）。在印度城市里常见“dhobi ghat”（大型露天洗衣场），有时会出现在旅行写作或文学作品中。使用该词时注意语境：它主要是地区性职业称呼，在英语里带有文化地域色彩。"]}
{"word":"dhobies","summary":{"en":"“Dhobies” means laundry workers (plural), especially in South Asia.","zh":"“Dhobies”是“dhobi”的复数，指（尤指南亚）以洗衣为业的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of dhobi: a person (especially in South Asia) whose job is washing clothes for other people; a washerman or laundry worker.","zh":"dhobi 的复数：指（尤指南亚地区）以替他人洗衣为业的人；洗衣工／洗衣匠。"},"examples":[{"en":"In the village, many families took their clothes to the dhobies every week.","zh":"在村里，许多家庭每周都会把衣服送去给洗衣工（dhobies）洗。"},{"en":"The hotel worked with local dhobies to handle laundry quickly.","zh":"这家酒店与当地的洗衣工合作，以便快速处理洗衣。"}]}],"synonyms":["laundry workers","washermen","laundrymen"],"phonetic":"/ˈdoʊbi/","extraExplanation":["“dhobi”来自印地语/乌尔都语等南亚语言，常见于印度、巴基斯坦、斯里兰卡等地的生活语境，也常出现在英国英语/殖民时期文字中。","在现代英语里，这个词带有明显的地域与文化背景：用于描述南亚特定职业很准确，但在非必要场景中，直接说“laundry worker / washerman”更中性。"]}
{"word":"dhobis","summary":{"en":"Dhobis are laundry workers—people who wash clothes for others, especially in Indian/South Asian contexts.","zh":"Dhobis 指洗衣工人——替他人洗衣的职业称呼，常见于印度/南亚语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in India and some other South Asian contexts) a person whose job is washing clothes for other people; a washerman or laundry worker.","zh":"（印度及部分南亚语境）替人洗衣服的工人；洗衣匠（传统上常指男性洗衣人）。"},"examples":[{"en":"We sent our clothes to the local dhobi to be washed and ironed.","zh":"我们把衣服送到当地的 dhobi 那里清洗并熨烫。"},{"en":"In many older stories, a dhobi carries bundles of laundry through the streets.","zh":"在许多较早的故事里，dhobi 会背着一捆捆衣物穿行在街巷中。"}]}],"synonyms":["washerman","laundry worker","launderer"],"phonetic":"/ˈdoʊbi/","extraExplanation":["“Dhobi”来自印地语/乌尔都语等南亚语言（如印地语 धोबी），在英语中多见于描写印度日常生活、历史或旅行见闻的语境。","在当代使用时要注意语境与尊重：它既可以是中性职业称呼，也可能在某些语境里带有刻板印象；更通用的表达可用 “laundry worker / washerman”。","复数通常写作 “dhobis”。"]}
{"word":"dhoby","summary":{"en":"A South Asian term for a laundry worker (traditionally washing clothes by hand).","zh":"南亚地区对“洗衣工/洗衣人”的称呼，传统上多指手洗衣物的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asia) a person whose job is washing clothes (a washerman/laundry worker), traditionally doing laundry by hand; also spelled “dhobi.”","zh":"（南亚）洗衣工、洗衣人（传统上多为手洗衣物）；也拼作 dhobi。"},"examples":[{"en":"The hotel used a local dhoby service for guests’ laundry.","zh":"这家酒店使用当地的 dhoby 洗衣服务为客人洗衣。"},{"en":"In older stories set in India, you may see “dhoby” used for a traditional laundry worker.","zh":"在一些以印度为背景的较早故事中，你可能会看到“dhoby”指传统的洗衣工。"}]}],"synonyms":["dhobi","laundry worker","washerman","launderer"],"phonetic":"/ˈdoʊbi/","extraExplanation":["“dhoby/dhobi”来自印地语/乌尔都语“dhobi”，在英式英语里常见于描写印度、巴基斯坦、斯里兰卡等地的社会生活与职业分工。","在现代英语中，这个词带有明显的地域与历史语境（殖民时期英文写作中更常见）。如果只是泛指职业，用更中性的“laundry worker / laundromat worker / laundry service”通常更合适。","你可能会在固定搭配中见到它，例如“dhoby ghat”（露天洗衣场，常见于印度一些城市）。"]}
{"word":"Dhodheknisos","summary":{"en":"“Dhodheknisos” does not appear to be a standard English word; it may be a misspelling or a proper noun.","zh":"“Dhodheknisos” 不是常见英语词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not found in standard English dictionaries; likely a misspelling, a name, or a word from another language.","zh":"在常见英语词典中未收录；可能是拼写错误、人名/地名，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “Dhodheknisos” in an English dictionary—could you share the sentence where you saw it?","zh":"我在英语词典里找不到 “Dhodheknisos”——你能把它出现的句子发我吗？"},{"en":"If it’s a name, the spelling might vary depending on the source.","zh":"如果它是一个专有名词，不同来源的拼写可能会不一样。"}]}],"extraExplanation":["“Dhodheknisos”看起来不像英语单词，更像是（1）OCR/抄写导致的拼写串错，（2）某种语言的音译，（3）专有名词（人名、地名、作品名）。","为了帮你准确判断：请提供它出现的上下文（前后各一句）、来源（书/网页/图片）、以及你想确认的是发音、含义还是拼写。","你也可以检查是否想写的是某个更常见的形式（例如以 -osis / -nisis 结尾的医学或学术词），或把相近拼写的候选词发来让我对照。"]}
{"word":"dhol","summary":{"en":"A South Asian double-headed drum commonly heard in celebrations and dance music.","zh":"一种南亚常用于庆典与舞曲的双面鼓。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditional double-headed barrel drum from South Asia, played with hands and/or sticks, often used in Punjabi and other regional music (especially in celebrations and dance).","zh":"（南亚）一种传统的双面桶形鼓，可用手和/或鼓槌演奏，常见于旁遮普等地区音乐中，尤其用于庆典与舞蹈。"},"examples":[{"en":"The dancer moved faster when the dhol started playing.","zh":"当都尔鼓（dhol）响起时，舞者的动作变得更快了。"},{"en":"We heard the loud dhol at the wedding procession.","zh":"我们在迎亲队伍里听到了响亮的都尔鼓声。"},{"en":"He practices dhol rhythms every evening.","zh":"他每天晚上练习都尔鼓的节奏。"}]}],"synonyms":["double-headed drum","barrel drum"],"phonetic":"/doʊl/","extraExplanation":["“Dhol”常与旁遮普的民间舞蹈“bhangra”一起出现，也常见于婚礼、节庆游行等场合，声音热烈、穿透力强。","英语中一般直接借用南亚语言的拼写“dhol”，复数常写作“dhols”。"]}
{"word":"dhole","summary":{"en":"A dhole is an Asiatic wild dog that often hunts in packs.","zh":"dhole 指“豺/亚洲野犬”，常以群体方式捕猎。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wild dog-like animal (Cuon alpinus) that lives in Asia, known for hunting in packs; also called the Asiatic wild dog","zh":"豺（亚洲野犬，学名 Cuon alpinus），一种生活在亚洲、常成群（群猎）捕食的野生犬科动物"},"examples":[{"en":"Dholes hunt in packs and can bring down animals larger than themselves.","zh":"豺常以群体方式捕猎，甚至能捕倒比自己更大的动物。"},{"en":"The documentary showed a dhole family moving through the forest.","zh":"纪录片展示了一群豺在森林里穿行。"}]}],"synonyms":["Asiatic wild dog","wild dog (general)"],"phonetic":"/doʊl/","extraExplanation":["“dhole”多用于自然纪录片、动物学、野生动物保护等语境；日常英语里不算常见词。","词源常被认为来自卡纳达语（印度南部语言）中的相关词，后来进入英语，用来指这种亚洲的野生犬科动物。","相关词汇：wild dog（野犬，泛称）、Asiatic wild dog（亚洲野犬，别称）、pack（兽群/狼群式的群体）、predator（捕食者）。"]}
{"word":"dholes","summary":{"en":"Dholes are Asiatic wild dogs that live and hunt in packs.","zh":"Dholes 指“豺/亚洲野犬”，常成群生活并合作捕猎。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wild dog native to Asia (Cuon alpinus), usually living and hunting in packs; also called the Asiatic wild dog","zh":"豺（亚洲野犬，学名 Cuon alpinus），通常成群生活并合作捕猎；也叫“亚洲野犬”"},"examples":[{"en":"Dholes live in forests and grasslands across parts of India and Southeast Asia.","zh":"豺生活在印度和东南亚部分地区的森林与草原中。"},{"en":"Researchers tracked a pack of dholes to study how they hunt together.","zh":"研究人员追踪了一群豺，以研究它们如何合作捕猎。"}]}],"synonyms":["Asiatic wild dog","red dog","Cuon alpinus"],"phonetic":"/doʊl/","extraExplanation":["“dhole”常见于自然纪录片、野生动物文章与生态学资料中；日常口语里相对少见。","词源一般认为来自印度南部的语言（常见说法指向卡纳达语等），后来进入英语。","发音要点：开头的“dh”不读 /ð/（如 this 的 th），而是读成 /d/，整体近似“dole”。"]}
{"word":"dhoney","summary":{"en":"“Dhoney” is usually a stylized/nonstandard spelling of “honey,” meaning either bee-made sweet food or a term of affection.","zh":"“Dhoney”通常是“honey”的个性化/非标准拼写，可指“蜂蜜”或亲昵称呼“亲爱的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard spelling of “honey,” often used as a nickname, username, or stylized writing. It can mean the sweet food made by bees, or (more commonly in casual speech) a term of affection for someone you love.","zh":"“honey”的非标准拼写，常见于昵称、网名或装饰性写法。既可指“蜂蜜”，也常在口语中作对爱人的亲昵称呼（如“亲爱的”）。"},"examples":[{"en":"Online, she writes her name as “Dhoney,” but it’s pronounced like “honey.”","zh":"在网上她把名字写成“Dhoney”，但发音和“honey”一样。"},{"en":"Come here, honey—let me help you.","zh":"过来，亲爱的——我来帮你。"}]}],"synonyms":["honey","dear","sweetheart"],"phonetic":"ˈhʌni","extraExplanation":["“Dhoney”并不是常见的标准英文单词；最常见的理解是把“honey”用字母D进行个性化拼写（例如用于社交媒体ID或暱称）。","如果你本来想查的是标准词“honey”，它既可以指“蜂蜜”，也可以当作爱称（语气亲昵；对陌生人使用可能显得过于亲密或带有冒犯风险，取决于语境与文化）。"]}
{"word":"dhoni","summary":{"en":"“Dhoni” most commonly refers to MS Dhoni, a famous Indian cricketer; it can also mean a traditional Maldivian boat.","zh":"“Dhoni”最常指印度著名板球运动员 MS Dhoni；也可指马尔代夫的一种传统小船。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) Mahendra Singh Dhoni (often called “MS Dhoni”), a famous Indian former international cricketer and captain.","zh":"（专有名词）马亨德拉·辛格·多尼（常称“MS Dhoni”），著名的印度前国际板球运动员与队长。"},"examples":[{"en":"MS Dhoni is one of the most well-known cricket captains in India.","zh":"MS Dhoni 是印度最知名的板球队长之一。"},{"en":"Many fans admire Dhoni for his calm leadership under pressure.","zh":"很多球迷欣赏 Dhoni 在压力下依然冷静的领导风格。"}]},{"partOfSpeech":"n.","definition":{"en":"(Noun) A small boat used in the Maldives, often a wooden fishing or transport boat; sometimes spelled “dhoni.”","zh":"（名词）马尔代夫常见的一种小船，多为木制渔船或运输船；有时拼作“dhoni”。"},"examples":[{"en":"We took a dhoni to visit a nearby island.","zh":"我们坐 dhoni 去附近的岛。"},{"en":"Traditional dhoni boats are closely linked to Maldivian fishing culture.","zh":"传统的 dhoni 船与马尔代夫的渔业文化密切相关。"}]}],"synonyms":["MS Dhoni","Mahendra Singh Dhoni"],"phonetic":"/ˈdoʊni/","extraExplanation":["“Dhoni”在英文新闻和社交媒体里最常指板球名将 MS Dhoni。板球在印度、巴基斯坦、孟加拉国、斯里兰卡等地影响力很大，所以你会在这些国家相关的体育内容里频繁看到这个名字。","作为普通名词的“dhoni”与马尔代夫文化有关：它是一种传统船型，常用于出海捕鱼、岛屿之间的交通与观光活动。具体含义通常要看上下文（体育 vs. 旅游/海岛）。"]}
{"word":"dhooley","summary":{"en":"“Dhooley” is usually a rare spelling of a surname, not a common English word.","zh":"“Dhooley”通常是少见的姓氏拼写，并非常见英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare spelling of the surname “Dooley” (a family name). It is not a standard English vocabulary word in everyday use.","zh":"“Dooley”的一种少见拼写（姓氏/家族名）。它不是日常英语里的标准词汇。"},"examples":[{"en":"Ms. Dhooley will join the meeting at 3 p.m.","zh":"Dhooley 女士将于下午三点参加会议。"},{"en":"The book was written by Kevin Dhooley.","zh":"这本书由 Kevin Dhooley 撰写。"}]}],"synonyms":["Dooley"],"phonetic":"/ˈduːli/","extraExplanation":["“Dhooley”在通用词典里通常不会作为普通词条出现，更常见的是人名/姓氏的拼写变体。","如果你是在文章里看到的，可能也有拼写误差的可能；常见的接近词包括：Dooley（姓氏）、duly（副词“按时/适当地”）、dhole（名词“豺/亚洲野犬”）。如果你能提供一句原文语境，我可以帮你更准确判断。"]}
{"word":"dhoolies","summary":{"en":"“Dhoolies” means covered litters/palanquins carried by bearers in South Asia (plural form).","zh":"“dhoolies”指南亚传统由人抬行的轿床/轿子（带篷或帘），为复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a covered litter (a seat or bed) carried by people on long poles, traditionally used in South Asia; plural of “dhooly/dhooli.”","zh":"（南亚传统）由人抬着的轿床/担架式轿子（带篷或帘），常用长杆抬行；“dhooly/dhooli”的复数。"},"examples":[{"en":"In the old travel account, the injured officer was carried in dhoolies to the nearest fort.","zh":"在那篇旧旅行记里，受伤的军官被人用抬轿（dhoolies）抬到最近的堡垒。"},{"en":"Before motor roads, some travelers crossed the hills in dhoolies.","zh":"在汽车道路普及之前，一些旅人会坐抬轿（dhoolies）翻越山地。"}]}],"synonyms":["palanquins","litters","sedan chairs"],"phonetic":"/ˈduːliːz/","extraExplanation":["“dhooly/dhooli（有时也拼作 doli）”源自南亚语言（如印地语等）的外来词，在英印时期的英文记述、军队报告、殖民地旅行文学中较常见。现代英语里偏历史/文学用法，日常会用更通用的说法如 “palanquin” 或 “litter”。"]}
{"word":"dhooly","summary":{"en":"A dhooly is a traditional South Asian carried litter/stretcher used to transport a person, often as an old-style ambulance.","zh":"dhooly 指一种南亚传统的人抬轿/担架轿，用来抬运乘客，常见于旧时或历史语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a covered litter or stretcher carried by people (historically used in South Asia) to transport a passenger, especially someone ill or injured","zh":"（南亚旧时常见的）人抬轿/担架式轿舆；（尤指）抬运病人或伤者的担架轿"},"examples":[{"en":"The injured traveler was carried back to camp in a dhooly.","zh":"受伤的旅人被用担架轿（dhooly）抬回营地。"},{"en":"In old accounts of British India, a dhooly was often used as an ambulance.","zh":"在一些关于英属印度的旧记载中，dhooly 常被当作救护担架使用。"}]}],"synonyms":["dooly","doli","litter","palanquin","stretcher"],"phonetic":"/ˈduːli/","extraExplanation":["“dhooly”更常见的拼写是“dooly / doli”。这个词多出现在历史文本或与南亚殖民时期相关的英语写作中，现代日常英语里不常用。","词源通常与印地语/乌尔都语中的“ḍolī（doli）”有关，指一种由人抬着移动的轿舆或担架式载具。"]}
{"word":"dhoon","summary":{"en":"Dhoon means a tune or melody (common in Hindi/Urdu and South Asian English).","zh":"dhoon 指“曲调/旋律”，常见于印地语/乌尔都语及南亚英语语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asian English, from Hindi/Urdu) A tune or melody, especially a simple, catchy one you can hum.","zh":"（南亚英语，源自印地语/乌尔都语）曲调；旋律，尤指容易哼唱、很上口的那种。"},"examples":[{"en":"That song has a dhoon that stays in your head all day.","zh":"那首歌的曲调很洗脑，一整天都在你脑子里转。"},{"en":"He kept humming the same dhoon while he worked.","zh":"他一边工作一边一直哼着同一段旋律。"},{"en":"The film’s title track has a familiar dhoon.","zh":"这部电影的主题曲有种很熟悉的旋律。"}]}],"synonyms":["tune","melody","air","refrain","earworm"],"phonetic":"/dun/","extraExplanation":["“Dhoon/धुन（dhun）”常见于印地语、乌尔都语语境，也常被南亚英语使用，尤其在谈论宝莱坞歌曲、民歌或“上口的旋律”时。","它有时也可引申为“脑子里挥之不去的曲子/念头”（类似英语里说的 an earworm）。拼写可能见到 dhun / dhoon，发音接近“duhn”。"]}
{"word":"dhoora","summary":{"en":"“Dhoora” is not standard English; it’s a South Asian romanized form meaning “far/distant/away.”","zh":"“dhoora”不是标准英语，多为南亚语言的拉丁拼写，用来表达“远/遥远/在远处”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Not standard English) a common romanized spelling of Hindi/Urdu “dūr / dūrā (दूर / دُور)”, meaning “far; distant; away.”","zh":"（非标准英语）常见的印地语/乌尔都语“dūr / dūrā（दूर / دُور）”的拉丁字母拼写，意思是“远的；遥远的；在远处”。"},"examples":[{"en":"My home is dhoora from the city center. (Hindi/Urdu-influenced English)","zh":"我家离市中心很远。（受印地语/乌尔都语影响的英语表达）"},{"en":"Don’t go dhoora alone at night.","zh":"晚上不要一个人走太远。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Also used like an adverb) far away; at a distance.","zh":"（也可作副词用）在远处；离得很远。"},"examples":[{"en":"He lives dhoora, so we meet only on weekends.","zh":"他住得很远，所以我们只在周末见面。"}]}],"synonyms":["far","distant","away","a long way off"],"phonetic":"/ˈdʊrə/","extraExplanation":["“dhoora”多见于南亚语境的英语聊天/社媒中，是把“दूर / دُور（dūr，远）”用拉丁字母写出来的拼法。更常见的拼写是“doora / dura / door”。在标准英语写作中一般直接用“far / distant / away”。","注意：如果你想表达的是一种谷物“sorghum（高粱）”，英语里更接近的词是“dhurra / durra”，而不是“dhoora”。如果你告诉我语境/句子，我可以帮你确认具体想说哪个词。"]}
{"word":"dhooras","summary":{"en":"“dhooras” is a nonstandard, South Asian transliteration meaning “far (away), distant.”","zh":"“dhooras”多为南亚语的音译写法，意思是“很远的/在远处”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard; South Asian English/transliteration) far away; distant.","zh":"（非标准英语；南亚语音译用法）很远的；遥远的。"},"examples":[{"en":"The village is dhooras from the main road, so you’ll need extra time to get there.","zh":"那个村子离主干道很远，所以你需要多留些时间过去。"},{"en":"Don’t worry—your friend isn’t dhooras; he’s just around the corner.","zh":"别担心——你朋友不远，就在拐角附近。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Nonstandard; South Asian English/transliteration) far away; at a distance.","zh":"（非标准英语；南亚语音译用法）在远处；离得很远。"},"examples":[{"en":"We could see the mountains dhooras in the haze.","zh":"我们能在薄雾里看到远处的群山。"},{"en":"He lives dhooras, so we usually call instead of visiting.","zh":"他住得很远，所以我们通常打电话而不是登门拜访。"}]}],"synonyms":["far","far away","distant","a long way off","remote"],"phonetic":"/ˈdʊrɑːz/","extraExplanation":["“dhooras”一般不是标准英语单词，更常见于把印地语/乌尔都语里的“door/dūr”（意为“远”）用拉丁字母音译后写进英文对话或叙述中。","在标准英文写作里，通常用“far (away) / distant / at a distance / a long way (off)”来表达同样意思。"]}
{"word":"dhooti","summary":{"en":"A dhoti (also sometimes spelled “dhooti”) is a traditional South Asian wrap garment worn around the waist and legs.","zh":"Dhoti（有时也写作dhooti）是南亚传统裹衣，用长布缠绕在腰和腿部。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional South Asian garment (especially in India) made from a long piece of cloth wrapped around the waist and legs, usually worn by men.","zh":"（尤指印度）一种南亚传统服饰：用一长条布料缠绕在腰部和腿部的裹衣，通常由男性穿着。"},"examples":[{"en":"He wore a white dhoti to the temple.","zh":"他穿着白色的多提（dhoti）去寺庙。"},{"en":"In some regions, men still wear a dhoti for weddings and festivals.","zh":"在一些地区，男性在婚礼和节庆时仍会穿多提。"}]}],"synonyms":["dhoti","wrap garment","loincloth (broader/less specific)","veshti (regional)","mundu (regional)"],"phonetic":"ˈdoʊti","extraExplanation":["“dhooti”常见为非标准拼写；更常见的拼法是“dhoti”。","Dhoti通常搭配上衣（如kurta）或披巾（shawl），在宗教仪式、婚礼等正式场合较常见。不同地区也有近似服饰与名称（如南印度的veshti/ mundu）。"]}
{"word":"dhootie","summary":{"en":"Dhootie is a less common spelling of dhoti, a traditional South Asian wrapped garment worn by men.","zh":"Dhootie 是 dhoti 的不常见拼写，指南亚男性穿的传统围裹式服装。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a dhoti: a long piece of cloth worn by men in South Asia, wrapped around the waist and legs (traditional clothing).","zh":"（同 dhoti）多提：南亚男性常穿的传统服饰，用一块长布围裹腰部并缠绕成裤状。"},"examples":[{"en":"He wore a white dhootie for the wedding ceremony.","zh":"婚礼仪式上他穿了一条白色的 dhootie（多提）。"},{"en":"In many villages, older men still prefer a dhootie in hot weather.","zh":"在许多村庄，年长男性在炎热天气里仍更喜欢穿 dhootie（多提）。"}]}],"synonyms":["dhoti","loincloth"],"phonetic":"/ˈdoʊti/","extraExplanation":["“dhootie”是“dhoti”的另一种拼写，常见于英语文本对印度文化的描写或音译差异。更标准、也更常用的拼法是“dhoti”。","Dhoti 的穿法因地区与场合而异：日常可能更简便，宗教或婚礼等正式场合会搭配更讲究的折裥与系法。它在英语语境里通常带有“传统、民族服饰”的文化色彩。"]}
{"word":"dhooties","summary":{"en":"“Dhooties” means more than one dhoti—traditional wraparound cloth garments worn in South Asia, especially India.","zh":"“dhooties”指多件dhoti（兜提）——南亚（尤其印度）传统围裹式长布服饰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) long pieces of cloth worn wrapped around the waist and legs, traditionally worn by men in South Asia (especially India).","zh":"（复数）“dhoti”的复数：一种长布料，传统上在南亚（尤其印度）由男性围裹在腰部与腿部穿着的服饰。"},"examples":[{"en":"At the ceremony, several men wore white dhooties with simple shirts.","zh":"在仪式上，几位男士穿着白色的dhooties，搭配简单的衬衫。"},{"en":"The shop sells cotton dhooties in different sizes and colors.","zh":"这家店出售不同尺寸和颜色的棉质dhooties。"}]}],"synonyms":["dhotis","wrap skirt","traditional wrap garment"],"phonetic":"/ˈdoʊti/","extraExplanation":["“dhoti / dhooty”在英语里通常写作 **dhoti**（单数），复数是 **dhotis**；**dhooties** 也会出现，但更像是另一种拼写或口语化复数写法。","Dhoti 常与印度的宗教仪式、婚礼、节庆等场合相关；不同地区穿法和系法不太一样，有的会更贴身、有的更宽松。","在一些语境中，提到 dhoti 可能带有文化身份或传统气质的意味；在写作中可搭配说明场合（wedding/temple/ceremony）以避免误解。"]}
{"word":"dhootis","summary":{"en":"“Dhootis” means more than one dhoti, a traditional cloth wrap worn around the waist and legs in South Asia (especially India).","zh":"“dhootis”是 dhoti 的复数，指一种南亚（尤指印度）传统裹布服饰，绕裹腰部与腿部。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of dhoti: a traditional South Asian (especially Indian) garment— a long piece of cloth wrapped around the waist and legs, usually worn by men.","zh":"dhoti 的复数：一种南亚（尤指印度）传统服饰——一块长布绕裹在腰部与腿部，通常为男性穿着。"},"examples":[{"en":"At the ceremony, several men wore white dhootis and sandals.","zh":"在仪式上，几位男子穿着白色的 dhootis 和凉鞋。"},{"en":"In some regions, dhootis are worn more often during festivals and weddings.","zh":"在一些地区，节日和婚礼时更常穿 dhootis。"}]}],"synonyms":["dhotis","dhoti (singular)","traditional wrap (general)"],"phonetic":"/ˈdoʊti/","extraExplanation":["“dhoti”（复数可写作 dhotis 或 dhootis）是一种与印度多地传统文化密切相关的服饰；不同地区的裹法与名称可能不同，例如在印度南部常见类似穿法的“veshti”。在英语语境里，它通常指这种特定的传统裹布，而不等同于一般的“loincloth（兜裆布）”。"]}
{"word":"dhotee","summary":{"en":"A dhotee is a traditional South Asian men’s garment: a long cloth wrapped around the waist and legs (also spelled dhoti).","zh":"dhotee（也拼作dhoti）是南亚男性常见的传统服装：一块长布围裹腰部与双腿穿着。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asia) a long piece of cloth worn by men, wrapped around the waist and legs; a traditional garment, especially in India.","zh":"（南亚）一种男性传统服装：一块长布，围绕腰部并包裹双腿穿着；尤指印度常见的传统服饰。"},"examples":[{"en":"He wore a white dhotee for the ceremony.","zh":"他在仪式上穿着一条白色的dhotee（传统围布）。"},{"en":"In many parts of India, a dhotee is worn with a kurta.","zh":"在印度许多地区，dhotee常与库尔塔（kurta，长衫）一起穿。"},{"en":"The photo shows farmers working in dhotees in the heat.","zh":"照片里，农民在炎热天气中穿着dhotee劳作。"}]}],"synonyms":["dhoti","loincloth","wrap (garment)"],"phonetic":"/ˈdoʊti/","extraExplanation":["“dhotee”是“dhoti”的另一种拼写，英语里更常见的是“dhoti”。它是一种传统裹布式服装，不同地区有不同的系法与名称。","在跨文化语境中提到这类服饰时，用中性、尊重的描述更合适，例如强调“traditional garment（传统服饰）”，避免把它简单说成“skirt（裙子）”之类可能引起误解的词。"]}
{"word":"dhoti","summary":{"en":"A traditional South Asian men’s garment: a long cloth wrapped around the waist and legs.","zh":"南亚传统男性服饰：一块长布缠绕腰部与腿部的服装。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A long piece of cloth worn by some men in South Asia, wrapped around the waist and legs like a traditional garment.","zh":"（南亚部分男性穿的）兜提/腰布：一块长布，缠绕在腰部并包裹腿部的传统服饰。"},"examples":[{"en":"He wore a white dhoti to the wedding ceremony.","zh":"他在婚礼仪式上穿了一条白色的兜提。"},{"en":"In some regions, a dhoti is common formal wear for men.","zh":"在一些地区，兜提是男性常见的正式服装。"}]}],"synonyms":["loincloth","wrap (garment)","traditional robe (general)"],"phonetic":"/ˈdoʊti/","extraExplanation":["“dhoti”主要用于印度及周边地区文化语境中；在英语里通常直接借用这个词来指这种传统服饰。不同地方的裹法、长度和搭配（如上身配衬衣或披巾）会有差异。","文化使用上建议尊重语境：它可能与宗教仪式、节庆、婚礼等正式场合相关，不仅仅是“日常衣服”。"]}
{"word":"dhotis","summary":{"en":"“Dhotis” means more than one dhoti, a traditional wrap-around garment worn by men in South Asia.","zh":"“Dhotis”是“dhoti”的复数，指多件dhoti（南亚地区男性常穿的传统围裹式服装）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “dhoti”: a long piece of cloth worn by some men, especially in India and neighboring countries, wrapped around the waist and legs like a skirt or loose trousers.","zh":"“dhoti”的复数：一种长布料服饰，常见于印度及周边地区的一些男性穿着，围裹在腰部并包住腿部，外观类似裙子或宽松裤。"},"examples":[{"en":"At the temple, some men wore white dhotis and shawls.","zh":"在寺庙里，一些男人穿着白色的dhoti并披着披肩。"},{"en":"The dancers changed into colorful dhotis for the performance.","zh":"舞者们为演出换上了彩色的dhoti。"},{"en":"In old photos, you can see farmers working in simple dhotis.","zh":"在老照片里，你能看到农民穿着朴素的dhoti劳作。"}]}],"synonyms":["traditional wrap (South Asia)","men’s wrap garment"],"phonetic":"/ˈdoʊti/","extraExplanation":["“Dhoti”是源自南亚文化的服饰名称，在英语里通常直接借用该词。写作复数时一般按英语规则加 -s 变成 “dhotis”。","不同地区对相似服饰也可能用不同英语词汇（如 lungi、veshti 等），但它们穿法与使用场合不完全相同。"]}
{"word":"dhoty","summary":{"en":"Dhoti (often misspelled “dhoty”) is a traditional South Asian wrap garment, especially common in India.","zh":"Dhoti（常被误拼为“dhoty”）是一种南亚传统裹身服装，尤在印度常见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional South Asian garment: a long piece of cloth wrapped around the waist and legs, worn mainly by men (especially in India).","zh":"（南亚传统服饰）一块长布裹在腰部和腿部的衣服，主要由男性穿着（尤指印度）。"},"examples":[{"en":"He wore a white dhoti to the wedding ceremony.","zh":"他在婚礼仪式上穿着一条白色的腰布（dhoti）。"},{"en":"In some temples, visitors are asked to wear a dhoti or other traditional clothing.","zh":"在一些寺庙里，游客可能被要求穿 dhoti 或其他传统服装。"}]}],"synonyms":["traditional wrap garment","loincloth (broadly, not exact)"],"phonetic":"/ˈdoʊti/","extraExplanation":["“dhoty”通常是“dhoti”的拼写变体或误拼。标准拼写更常见的是 dhoti。","dhoti 的穿法因地区而异：有的像“裙”一样裹在腰间，有的会把布从腿间穿过再系起，更便于行走。它常与宗教仪式、节庆或正式场合相关。"]}
{"word":"dhoul","summary":{"en":"Dhoul (more commonly spelled dhol) is a South Asian double-sided drum used in festive music and dance.","zh":"Dhoul（更常见拼作 dhol）是一种南亚双面大鼓，常用于节庆音乐与舞蹈。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(also spelled dhol) A large, double-sided barrel drum played in South Asian music, especially in Punjabi, Indian, and Pakistani festivals and dance (e.g., bhangra).","zh":"（也拼作 dhol）一种南亚常见的双面桶形大鼓，常用于旁遮普、印度、巴基斯坦的节庆与舞蹈音乐（如 bhangra）。"},"examples":[{"en":"You can hear the dhoul at weddings and street celebrations.","zh":"在婚礼和街头庆典上常能听到 dhoul 的鼓声。"},{"en":"The dancer moved faster when the dhoul rhythm began.","zh":"当 dhoul 的节奏响起时，舞者跳得更快了。"},{"en":"He learned to play the dhoul for the bhangra team.","zh":"他为了 bhangra 团队学会了打 dhoul。"}]}],"synonyms":["dhol","barrel drum"],"phonetic":"/doʊl/","extraExplanation":["“dhoul”在英语里不如“dhol”常见，很多时候只是另一种拼写方式（不同地区的转写习惯不同）。","dhol/dhoul 常与旁遮普文化、bhangra（旁遮普民间舞/流行舞曲）联系在一起；在英国、加拿大、美国的南亚侨民社区也很常见。"]}
{"word":"dhourra","summary":{"en":"Dhourra is a (less common) spelling for dhurra: a kind of sorghum grain.","zh":"Dhourra 是 dhurra 的较少见拼写：指一种高粱（谷物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of sorghum (a grain crop) grown especially in Africa and South Asia, used for food, animal feed, and sometimes making syrup or alcohol.","zh":"（一种）高粱/蜀黍（谷物作物），尤常见于非洲和南亚，用作粮食、饲料，有时也用于制糖浆或酿造。"},"examples":[{"en":"In dry regions, dhourra is valued because it can grow with little rainfall.","zh":"在干旱地区，人们重视高粱（dhourra），因为它在少雨条件下也能生长。"},{"en":"The market sold flour made from dhourra and millet.","zh":"市场上有用高粱（dhourra）和小米磨成的面粉。"}]}],"synonyms":["sorghum","dhurra","dura"],"phonetic":"/ˈdʊrə/","extraExplanation":["“dhourra”常被视为“dhurra / dura”的拼写变体，指的通常是高粱（sorghum）的一类或其籽粒。不同地区、不同年代的英文文献里拼写不一（如 dhurra, dhoora, dura）。","在一些旅行文学、殖民时期或农业记述中会见到该词，用来描述当地主要粮食作物之一；现代更常用的标准词是 “sorghum”。"]}
{"word":"dhourras","summary":{"en":"Dhourras means dhourra in plural: a kind of sorghum grain.","zh":"Dhourras 是 dhourra 的复数：一种高粱类谷物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of dhourra (also spelled durra/dhurra): a type of sorghum grown for its grain, used as food and animal feed especially in Africa and parts of Asia.","zh":"dhourra（也拼作 durra/dhurra）的复数：一种高粱，用于收获谷粒，常作人类食物和牲畜饲料，尤见于非洲及亚洲部分地区。"},"examples":[{"en":"In dry regions, farmers often plant dhourras because they tolerate heat and drought.","zh":"在干旱地区，农民常种植 dhourras，因为它们耐热、耐旱。"},{"en":"The market sold flour made from dhourras and other local grains.","zh":"市场上出售由 dhourras 和其他本地谷物制成的面粉。"}]}],"synonyms":["sorghum","durra","dhurra","milo"],"phonetic":"/ˈdʊrəz/","extraExplanation":["“dhourra / dhurra / durra”都是同一种作物名称的不同英文拼写，来源与阿拉伯语有关；现代英语里更常见的通用词是 “sorghum（高粱）”。","在一些历史、旅行或农业类英文文本里可能会看到 “dhourra(s)” 这种拼法；日常英语中通常用 “sorghum” 或具体品种名（如 “milo”）。"]}
{"word":"dhow","summary":{"en":"A traditional sailing boat used around the Arabian Sea and East Africa, often with triangular lateen sails.","zh":"阿拉伯海与东非沿岸常见的传统帆船，常配斜三角帆（拉丁帆）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditional sailing boat with one or more lateen (triangular) sails, used especially in the Red Sea, the Arabian Sea, and along the coasts of East Africa and the Middle East.","zh":"（阿拉伯海、红海及东非、中东沿岸常见的）单桅或多桅传统帆船，通常使用斜三角帆（拉丁帆）。"},"examples":[{"en":"Fishermen repaired their dhow before heading out at dawn.","zh":"渔民在黎明出海前修好了他们的单桅帆船。"},{"en":"We took a sunset cruise on a dhow in Zanzibar.","zh":"我们在桑给巴尔乘坐单桅帆船看日落巡航。"}]}],"synonyms":["sailing boat","sailboat","boat"],"phonetic":"/daʊ/","extraExplanation":["“dhow”一词多被认为来自阿拉伯语“dāw / dāʾū”等相关词形，进入英语后专指印度洋—阿拉伯海贸易网络中常见的传统帆船。它常与香料、乳香、象牙等历史海上贸易联系在一起。","文学与旅行写作中，dhow 常用来营造“印度洋季风航行”“古老海贸路线”的氛围，例如描写阿拉伯商人、斯瓦希里海岸港口或沙漠与海洋交界的场景。"]}
{"word":"dhow-rigged","summary":{"en":"Describes a vessel fitted with traditional dhow-style lateen sails.","zh":"形容船只装配了独桅帆船（dhow）式的拉丁帆（三角帆）帆装。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a boat or ship) equipped with a dhow-style sail plan, usually one or more lateen (triangular) sails set on long, slanted yards.","zh":"（船只）采用“独桅帆船（dhow）式”帆装的，通常配有一张或多张拉丁帆（lateen，三角帆），帆桁很长并斜置。"},"examples":[{"en":"A small dhow-rigged vessel crossed the bay at sunset.","zh":"一艘小型的独桅帆船式帆装船在日落时穿过海湾。"},{"en":"The museum displays a dhow-rigged trading boat once used along the East African coast.","zh":"博物馆展出了一艘曾在东非海岸使用的独桅帆船式帆装商船。"}]}],"synonyms":["lateen-rigged","traditional-rigged","Arab-style rigged"],"phonetic":"/ˈdaʊˌrɪɡd/","extraExplanation":["“dhow”常指阿拉伯海、红海、波斯湾与印度洋沿岸传统木帆船（中文有时译作“阿拉伯三角帆船/独桅帆船”）。因此“dhow-rigged”多见于航海、历史与文学描写，用来强调这种地区性、传统性的帆装风格。","“lateen（拉丁帆）”的特点是三角形帆与长斜帆桁；这种帆装在顺风与侧风航行中很常见，也容易让读者联想到印度洋季风贸易与沿岸航行的历史背景。"]}
{"word":"dhows","summary":{"en":"Dhows are traditional sailing boats used around the Red Sea and Indian Ocean region.","zh":"Dhows 指红海与印度洋周边常见的传统三角帆船。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional sailing boat with one or more lateen (triangular) sails, used especially in the Red Sea, Arabian Sea, and along the coasts of East Africa and the Arabian Peninsula","zh":"（dhow 的复数）传统阿拉伯帆船（多用三角帆），常见于红海、阿拉伯海及东非与阿拉伯半岛沿海"},"examples":[{"en":"Fishermen set out before sunrise in their dhows.","zh":"渔民在日出前乘着他们的阿拉伯帆船出海。"},{"en":"Goods once crossed the Indian Ocean in dhows driven by seasonal winds.","zh":"过去货物曾借助季风，乘阿拉伯帆船横渡印度洋。"},{"en":"From the beach, we watched the white sails of dhows on the horizon.","zh":"从海滩上，我们望着地平线上阿拉伯帆船的白帆。"}]}],"synonyms":["sailboat","trading vessel","boat"],"phonetic":"/daʊ/","extraExplanation":["“dhow”常指印度洋世界（阿拉伯半岛、东非、南亚之间）长期使用的木质帆船类型，是海上贸易与渔业文化的重要象征。","在英文里你可能会在旅行写作、历史叙述或海洋题材文学中见到它（尤其与“Indian Ocean trade / monsoon winds 季风”一起出现）。","单数是 “a dhow”，复数是 “dhows”。"]}
{"word":"Dhritarashtra","summary":{"en":"Dhritarashtra is the blind king in the Mahabharata and the father of the Kauravas.","zh":"Dhritarashtra（持国王）是《摩诃婆罗多》中的盲王，也是考拉瓦家族诸子的父亲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Dhritarashtra: the blind king of the Kuru kingdom in the Indian epic Mahabharata, father of the Kauravas (including Duryodhana).","zh":"持国王（Dhritarashtra）：印度史诗《摩诃婆罗多》中的俱卢国盲王，俱卢族“俱卢族兄弟”（以难敌 Duryodhana 为首的考拉瓦 Kauravas）的父亲。"},"examples":[{"en":"In the Mahabharata, Dhritarashtra struggles between justice and love for his sons.","zh":"在《摩诃婆罗多》中，持国王在正义与对儿子的偏爱之间痛苦挣扎。"},{"en":"Dhritarashtra relies on Sanjaya to describe the battle he cannot see.","zh":"持国王依靠三阇耶（Sanjaya）转述他看不见的战场景象。"}]}],"synonyms":["King Dhritarashtra","Dhṛtarāṣṭra","持国王"],"phonetic":"ˌdriːtəˈrɑːʃtrə","extraExplanation":["“Dhritarashtra”源自梵语，常被解释为“持国者/维系国土者”之意；中文常译为“持国”。","在故事中，他是般度（Pandu）的兄长；由于先天失明而未能成为理想的统治者，这一设定常被用来讨论“权力、责任与道德判断”的主题。","他在《薄伽梵歌》相关情节中也很关键：开篇他向三阇耶询问战况（因为他无法亲眼看到俱卢之战）。"]}
{"word":"dhritarashtra","summary":{"en":"Dhritarashtra is the blind king in the Mahabharata and the father of the Kauravas.","zh":"Dhritarashtra（持国）是《摩诃婆罗多》中的失明国王，也是俱卢众子的父亲。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Dhritarashtra (also spelled Dhṛtarāṣṭra): the blind king of the Kuru kingdom in the Indian epic the Mahabharata, father of the Kauravas (including Duryodhana).","zh":"持国（又拼作 Dhṛtarāṣṭra）：印度史诗《摩诃婆罗多》中的俱卢国失明国王，俱卢族“俱卢众子/俱卢兄弟”（包括难敌 Duryodhana）的父亲。"},"examples":[{"en":"In the Mahabharata, Dhritarashtra struggles to act fairly because he loves his sons deeply.","zh":"在《摩诃婆罗多》中，持国因为过度疼爱儿子们而难以做到公正。"},{"en":"Dhritarashtra’s blindness is often read as a symbol of moral or political “blindness.”","zh":"持国的失明常被解读为对道德或政治“盲目”的象征。"}]}],"synonyms":["Dhṛtarāṣṭra","King Dhritarashtra"],"phonetic":"ˌdriːtɑːˈrɑːʃtrə","extraExplanation":["该词源自梵语 Dhṛtarāṣṭra，常被解释为“持国/守国者”（大意是“维系国家的人”），中文译名“持国”即由此而来。","英文里常见拼写有 Dhritarashtra / Dhritarashtri（较少）/ Dhṛtarāṣṭra（带梵文转写符号）。在学术或宗教语境中更常见带符号的拼写。"]}
{"word":"Dhruv","summary":{"en":"Dhruv is an Indian male given name meaning “Pole Star” and often implying steadiness and determination.","zh":"Dhruv 是一个印度男性名字，意为“北极星”，常引申为坚定、稳重与有决心。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a male given name of Indian origin, from Sanskrit, meaning “the Pole Star” or “steadfast/immovable,” often associated with stability and determination","zh":"一个印度常见的男性名字，源自梵语，意思是“北极星”或“坚定不移/稳固不动”，常带有稳重、坚毅的寓意"},"examples":[{"en":"Dhruv is my classmate; he’s from Mumbai.","zh":"Dhruv 是我的同学；他来自孟买。"},{"en":"How do you pronounce Dhruv correctly?","zh":"Dhruv 应该怎么正确发音？"},{"en":"Dhruv chose a name that reflects strength and steadiness.","zh":"Dhruv 选择了一个体现力量与稳重含义的名字。"}]}],"phonetic":"/druːv/","extraExplanation":["“Dhruv/ Dhruva（ध्रुव）”在印度文化中常与“北极星”意象相关：北极星在夜空中位置相对稳定，因此这个名字常被理解为“坚定、可靠、不动摇”。","在印度神话故事中，“Dhruva”也是一位人物名（常译作“德鲁瓦/杜鲁瓦”），其故事强调专注与坚韧，因此该名字在文化语境里带有积极的品格联想。","英语环境中，这个名字的拼写固定为 Dhruv，但发音可能因地区而略有差异；如果你在口语交流中不确定，礼貌地询问对方偏好的发音是很常见的。"]}
{"word":"DHSP","summary":{"en":"DHSP is a context-dependent abbreviation read as “D-H-S-P.”","zh":"DHSP 是一个依语境而定的缩写，通常读作 “D-H-S-P”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation (initialism) whose meaning depends on the context; it is read as the names of the letters “D-H-S-P.”","zh":"一个缩写词（首字母缩略语），具体含义取决于语境；通常按字母读作 “D-H-S-P”。"},"examples":[{"en":"What does DHSP stand for in this document?","zh":"在这份文件里，DHSP 代表什么？"},{"en":"The email mentions DHSP, but it doesn’t explain the abbreviation.","zh":"邮件里提到了 DHSP，但没有解释这个缩写。"}]}],"synonyms":["initialism","abbreviation"],"phonetic":"/diː eɪtʃ ɛs piː/","extraExplanation":["“DHSP”不是一个像“NASA”那样有单一、固定含义的常见缩写；在政府、医疗、教育、科研、公司内部流程等领域都可能出现不同扩展形式。","想准确理解它：最好查看第一次出现处是否有全称（例如括号里写出全名）、看文件主题/行业背景，或直接询问写作者“DHSP 的全称是什么？”。","如果你愿意，把出现 DHSP 的句子或截图发来，我可以根据上下文帮你判断它最可能指什么。"]}
{"word":"DHSS","summary":{"en":"DHSS is an abbreviation for a government health-and-services department (US: Health and Social Services; UK historical: Health and Social Security).","zh":"DHSS 是政府卫生相关部门的缩写（美国多指“卫生与社会服务部”；英国旧称多指“卫生与社会保障部”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(US, in some states) Department of Health and Social Services; a government agency that manages public health programs and social service benefits.","zh":"（美国，部分州）卫生与社会服务部；负责公共卫生项目与社会福利服务的政府机构。"},"examples":[{"en":"In Alaska, DHSS runs programs like Medicaid and public health clinics.","zh":"在阿拉斯加州，DHSS 负责医疗补助（Medicaid）和公共卫生诊所等项目。"},{"en":"You may need to contact DHSS to apply for food assistance or health coverage.","zh":"你可能需要联系 DHSS 来申请食品补助或医疗保险。"}]},{"partOfSpeech":"n.","definition":{"en":"(UK, historical) Department of Health and Social Security; the former name of a UK government department (mainly used in older texts).","zh":"（英国，历史用法）卫生与社会保障部；英国政府部门的旧称（多见于较早的文件）。"},"examples":[{"en":"The report was submitted to the DHSS in 1980.","zh":"这份报告在 1980 年提交给了 DHSS。"},{"en":"Older UK policy documents often mention the DHSS.","zh":"较早的英国政策文件里常会提到 DHSS。"}]}],"synonyms":["Department of Health and Social Services","Department of Health and Social Security","health department (general)"],"phonetic":"/ˌdiː eɪtʃ ɛs ˈɛs/","extraExplanation":["DHSS 通常作为字母缩写逐个字母读（D-H-S-S）。具体含义要看国家与地区：在美国很多州是 “Department of Health and Social Services”；在英国则多指历史上的 “Department of Health and Social Security”，因此在阅读旧新闻、旧报告时更常见。","如果你在表格、网站或邮件里看到 DHSS，最好结合上下文（州名/国家名、页面标题、机构地址）来确认是哪一个部门。"]}
{"word":"DHT","summary":{"en":"DHT usually means dihydrotestosterone, a potent androgen hormone converted from testosterone.","zh":"DHT 通常指双氢睾酮（dihydrotestosterone），一种由睾酮转化而来的强效雄激素。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Abbreviation for dihydrotestosterone, a strong androgen (male sex hormone) made from testosterone in the body.","zh":"dihydrotestosterone（双氢睾酮）的缩写；一种由睾酮在体内转化而来的强效雄激素（男性性激素）。"},"examples":[{"en":"DHT plays an important role in the development of male characteristics.","zh":"DHT 在男性特征的发育中起重要作用。"},{"en":"Some treatments aim to lower DHT to slow male-pattern hair loss.","zh":"有些治疗会降低 DHT，以减缓雄激素性脱发（男性型脱发）。"},{"en":"The doctor checked his hormone levels, including testosterone and DHT.","zh":"医生检查了他的激素水平，包括睾酮和 DHT。"}]}],"synonyms":["dihydrotestosterone"],"phonetic":"/diː eɪtʃ tiː/","extraExplanation":["在医学与健康语境里，DHT 常与“雄激素性脱发（male-pattern hair loss）”和“前列腺（prostate）”相关；因为 DHT 会在某些组织中更强烈地作用。","DHT 主要由一种酶把睾酮转化而来（常被称作 5-alpha reductase）。因此有些药物会通过抑制这种转化来降低 DHT；但是否适合使用需要医生评估。","在日常英语中，DHT 也可能在不同领域代表别的缩写；如果是在科技或工作场景里看到，最好结合上下文确认含义。"]}
{"word":"Dhu","summary":{"en":"“Dhu” is an uncommon English item, mainly used in Scottish Gaelic-based names meaning “black/dark.”","zh":"“Dhu”在英语中并不常见，主要出现在源自苏格兰盖尔语的人名中，意为“黑的／深色的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A Scottish Gaelic epithet meaning “black” or “dark,” most often seen as part of a name (e.g., “Roderick Dhu”).","zh":"苏格兰盖尔语中的称号，意思是“黑的／深色的”，常作为人名的一部分出现（如“Roderick Dhu”）。"},"examples":[{"en":"In the poem, Roderick Dhu is called “Dhu” to highlight his dark coloring.","zh":"在诗歌里，Roderick Dhu 被称作“Dhu”，用来强调他黝黑的外貌特征。"},{"en":"The nickname Dhu comes from Gaelic and often describes someone with dark hair or a dark complexion.","zh":"“Dhu”这个外号来自盖尔语，常用来形容黑发或肤色较深的人。"}]},{"partOfSpeech":"other","definition":{"en":"A less common spelling/format seen in names or titles; sometimes confused with the abbreviation “DHU,” which can stand for different organizations depending on the country and context.","zh":"在某些姓名或标题中出现的较少见写法；有时会与缩写“DHU”混淆（“DHU”在不同国家/语境里可代表不同机构）。"},"examples":[{"en":"I saw “Dhu” in a book title and thought it was an acronym, but it was part of a Scottish name.","zh":"我在一本书名里看到“Dhu”，以为是首字母缩写，但其实它是苏格兰姓名的一部分。"}]}],"synonyms":["dark","black"],"phonetic":"/du/","extraExplanation":["“Dhu”通常对应苏格兰盖尔语的“dubh”（意为“黑、暗”）。在英语文学里，它因司各特（Walter Scott）的叙事诗《湖上夫人》（The Lady of the Lake）中的人物“Roderick Dhu”而更广为人知。","如果你是在某个具体句子、地名、机构名里看到“Dhu/DHU”，把原句或出处发我，我可以按该语境给出最准确的解释。"]}
{"word":"dhu","summary":{"en":"“DHU/dhu” is usually an abbreviation (commonly District Health Unit or Disciplinary Housing Unit) and sometimes a typo for “duh.”","zh":"“DHU/dhu” 多为缩写（常见为 District Health Unit 或 Disciplinary Housing Unit），有时也可能是把 “duh” 误打成 “dhu”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation for **District Health Unit** (a local public-health organization in some countries/regions).","zh":"**District Health Unit** 的缩写，指某些国家或地区的**地方公共卫生机构/卫生单位**。"},"examples":[{"en":"The DHU issued a warning about poor air quality.","zh":"DHU 发布了关于空气质量差的警告。"},{"en":"You can book a vaccine appointment through your local DHU.","zh":"你可以通过当地 DHU 预约接种疫苗。"}]},{"partOfSpeech":"other","definition":{"en":"An abbreviation for **Disciplinary Housing Unit** (a restricted housing area in a prison or detention facility).","zh":"**Disciplinary Housing Unit** 的缩写，指监狱或拘留设施里的**纪律隔离/管教禁闭区**。"},"examples":[{"en":"He was sent to the DHU for breaking the rules.","zh":"他因违反规定被送到 DHU（纪律隔离区）。"},{"en":"Conditions in the DHU are more restrictive than in general housing.","zh":"DHU 的条件比普通监区更严格。"}]},{"partOfSpeech":"other","definition":{"en":"In casual texting, **dhu** is sometimes a typo or playful spelling of **“duh”** (meaning “that’s obvious”).","zh":"在非正式聊天中，**dhu** 有时是 **“duh”**（“这很明显”）的误打或玩笑写法。"},"examples":[{"en":"Dhu, of course I remember your birthday.","zh":"Dhu，我当然记得你的生日啊。"}]}],"synonyms":["(District Health Unit) local public health office","(Disciplinary Housing Unit) segregation unit","duh"],"phonetic":"/ˌdiː eɪtʃ ˈjuː/","extraExplanation":["“DHU/dhu” 不是一个固定的标准英语单词，更常见是缩写（不同领域含义不同）。如果你告诉我你看到它的场景（医疗、监狱、学校、聊天等）以及原句，我可以帮你锁定最准确的意思与用法。"]}
{"word":"Dhuhr","summary":{"en":"Dhuhr is the Islamic midday (noon) prayer, the second of the five daily prayers.","zh":"Dhuhr 指伊斯兰教的正午礼拜（晌礼），是五番拜中的第二拜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Islam) the midday/noon prayer, the second of the five daily prayers (salah).","zh":"（伊斯兰教）晌礼/正午礼拜，五番拜中的第二拜（礼拜/ صلاة）。"},"examples":[{"en":"I need a few minutes for Dhuhr, then I’ll join the meeting.","zh":"我需要几分钟做晌礼，然后再参加会议。"},{"en":"Dhuhr is usually prayed after the sun passes its highest point.","zh":"晌礼通常在太阳过了正午（最高点）之后礼。"}]}],"synonyms":["noon prayer","midday prayer","Zuhr"],"phonetic":"/duːr/","extraExplanation":["Dhuhr 常见的英文转写还包括 Zuhr、Dhuhur。它源自阿拉伯语 ظُهْر（ẓuhr），在不同地区/口音里拼写与读法会有差异。","时间范围一般是“过了正午后开始”，直到 Asr（晡礼/下午礼）时间进入之前结束；具体时间会因地点、季节与各地计算方式而略有不同。","在英语语境中，Dhuhr 多用于穆斯林日常生活或宗教场合；在非宗教语境里可用 ‘noon prayer’（正午礼拜）帮助不熟悉该词的人理解。"]}
{"word":"Dhumma","summary":{"en":"Dhumma means “smoke,” especially as a Sanskrit/Pali loanword/transliteration.","zh":"Dhumma 指“烟/烟雾”，多见于梵语/巴利语的外来词或转写用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from Sanskrit/Pali) smoke; vapor or fumes rising in the air.","zh":"（源自梵语/巴利语）烟；烟雾；升起的烟气。"},"examples":[{"en":"In Pali texts, “dhumma” often refers to smoke rising from a fire.","zh":"在巴利语经典中，“dhumma”常指火中升起的烟。"},{"en":"The room filled with dhumma from the incense.","zh":"房间里充满了香燃烧产生的烟雾。"}]}],"synonyms":["smoke","fumes","vapor","haze"],"phonetic":"/ˈduːmə/","extraExplanation":["“Dhumma”常见于南亚语言背景（尤其是巴利语/梵语及其转写），更标准的转写也可能写作“dhūma”（带长音ū），意思是“烟”。在佛教与印度古典语境里，它既可指具体的烟，也可在修辞上引申为“遮蔽、迷蒙”的意象（但日常使用最常见的仍是字面意义：烟/烟雾）。"]}
{"word":"Dhunche","summary":{"en":"Dhunche is a town in Nepal that many travelers pass through when heading into the Langtang trekking area.","zh":"Dhunche是尼泊尔的一个小镇，许多旅行者前往朗塘徒步区域时会经过这里。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small town in Rasuwa District, Bagmati Province, Nepal, often used as a gateway for travel and trekking in the Langtang region.","zh":"尼泊尔巴格马蒂省拉苏瓦县的一个小镇，常被视为前往朗塘地区旅行与徒步的门户。"},"examples":[{"en":"We stayed overnight in Dhunche before starting the trek to Langtang Valley.","zh":"我们在Dhunche住了一晚，第二天开始前往朗塘山谷徒步。"},{"en":"Buses from Kathmandu can take you to Dhunche, but road conditions may vary.","zh":"可以从加德满都坐车到Dhunche，但路况可能不太稳定。"}]}],"phonetic":"/ˈdʊn.tʃeɪ/","extraExplanation":["“Dhunche”通常作为地名（专有名词）使用；在旅行语境中，你常会看到它与“Langtang（朗塘）”“Rasuwa（拉苏瓦）”“trekking（徒步）”“gateway（门户/起点）”等词一起出现。","英文写作中，地名一般首字母大写：Dhunche。它常被作为路线节点提到，而不是一个普通词汇。"]}
{"word":"dhunchee","summary":{"en":"Dhunchee usually refers to Dhunche, a town in Nepal and a common starting point for Langtang treks.","zh":"Dhunchee 通常指 Dhunche（另一种拼写），是尼泊尔的一个小镇，也是朗塘徒步常见的出发点。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A variant spelling of **Dhunche**: a small town in Rasuwa District, Nepal, often used as a gateway to Langtang National Park and trekking routes in the Langtang region.","zh":"**Dhunche（Dhunchee 的一种拼写）**：尼泊尔拉苏瓦县的一个小镇，常被视为进入朗塘国家公园与朗塘地区徒步路线的门户。"},"examples":[{"en":"We spent a night in Dhunchee before starting the trek to Langtang Valley.","zh":"我们在 Dhunchee 住了一晚，然后开始前往朗塘谷的徒步。"},{"en":"The bus ride from Kathmandu to Dhunchee can be long and bumpy.","zh":"从加德满都到 Dhunchee 的车程可能又长又颠。"}]}],"synonyms":["Dhunche"],"phonetic":"/ˈdʊn.tʃi/","extraExplanation":["“Dhunchee / Dhunche”通常是英语里对尼泊尔地名的转写，不同资料会出现不同拼法（例如结尾用 -e 或 -ee）。如果你是在特定文章、地图或对话里看到这个词，也可能是当地语言名字的另一种拼写。"]}
{"word":"dhunchi","summary":{"en":"Dhunchi (also spelled dhunuchi) is a Bengali incense burner, and it can also refer to the ritual dance performed while carrying it during festivals like Durga Puja.","zh":"Dhunchi（也写作 dhunuchi）指孟加拉传统熏香炉；也可指在杜尔迦女神节等庆典中手持香炉进行的仪式舞蹈。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A traditional Bengali clay incense burner (often filled with burning coconut husk and incense) used especially in Hindu worship and festivals.","zh":"（孟加拉地区传统）陶制熏香炉/香炉，常装燃烧的椰壳纤维与香料，尤其用于印度教祭祀与节庆。"},"examples":[{"en":"During Durga Puja, people wave a dhunchi in front of the goddess as an offering.","zh":"在杜尔迦女神节（Durga Puja）期间，人们在女神像前挥动 dhunchi 作为供奉。"},{"en":"The room smelled sweet and smoky from the dhunchi.","zh":"房间里因为 dhunchi 散发出甜甜的烟香味。"}]},{"partOfSpeech":"n.","definition":{"en":"A dance/performance in which dancers carry and swing the incense burner as part of a religious celebration (also spelled dhunuchi naach).","zh":"（表演/仪式）手持并摆动香炉的祭祀舞蹈/表演（也常写作 dhunuchi naach）。"},"examples":[{"en":"We watched the dhunchi dance at the community pandal.","zh":"我们在社区的临时祭棚（pandal）观看了 dhunchi 舞。"}]}],"synonyms":["incense burner","censer","dhunuchi"],"phonetic":"/duˈnuːtʃi/","extraExplanation":["“dhunchi / dhunuchi”多见于印度西孟加拉与孟加拉国的节庆语境，最典型的是 Durga Puja。常见形式是陶制或金属容器，内放椰壳纤维（coconut husk）、木炭与香料，点燃后会冒出浓烟，象征净化与敬献。","英文写法不完全统一：你输入的“dhunchi”常被当作“dhunuchi”的拼写变体；在英文资料中也可能看到 dhunuchi、dhunuchi burner、dhunuchi dance 等。"]}
{"word":"Dhundia","summary":{"en":"“Dhundia” is usually a South Asian (Indian) name or a transliterated place name, not a standard English word.","zh":"“Dhundia”通常是南亚（印度）的人名或地名的音译，不是标准英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a South Asian (especially Indian) personal name or surname, seen in English as a transliteration; it is not a common English vocabulary word.","zh":"一个南亚（尤其是印度）的人名或姓氏，在英语中多为音译形式；并不是常见的英语词汇。"},"examples":[{"en":"Dhundia Singh is listed in the school records.","zh":"学校记录里写着 Dhundia Singh。"},{"en":"Please ask Dhundia how to pronounce their name correctly.","zh":"请问问 Dhundia 他们的名字该怎么正确发音。"}]},{"partOfSpeech":"other","definition":{"en":"by extension, a place name in South Asia that appears in English documents as “Dhundia.”","zh":"引申为南亚地区的地名，在英文资料中可能以“Dhundia”出现。"},"examples":[{"en":"The report mentions a village called Dhundia.","zh":"报告提到一个叫 Dhundia 的村庄。"}]}],"synonyms":["(no direct English synonym; it is a proper name)"],"phonetic":"/ˈdʊndiə/","extraExplanation":["“Dhundia”通常是把当地语言（如印地语、马拉地语等）用拉丁字母拼写出来的结果，不同地区/家族可能有不同的写法（如 Dhundiya、Dhundhia 等），所以它在英语里往往没有唯一固定的词义。","如果你是在某篇文章、小说或历史材料里看到这个词，给我上下文句子/出处，我可以更准确地判断它指的是具体人物、地名，还是某个当地词的音译。","作为礼貌用法：遇到不熟悉的人名，英语里常用 “How do you pronounce your name?” 或 “Did I say your name correctly?” 来确认读音。"]}
{"word":"dhundia","summary":{"en":"“Dhundia” is usually a South Asian romanized word/name; it often conveys the idea of “misty/foggy,” or it can be a name (person/place).","zh":"“Dhundia”通常是南亚语言的转写词/专名；常含“雾蒙蒙的、朦胧的”之意，也可能是人名或地名。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Not a common English word.) A romanized spelling from Hindi/other South Asian languages, often meaning “misty/foggy” (related to Hindi धुंध /dhundh/, “fog, haze”).","zh":"（不是常见英语词。）多为印地语等南亚语言的拉丁字母转写，常带有“雾蒙蒙的、朦胧的”之意（与印地语 धुंध /dhundh/“雾、薄霾”有关）。"},"examples":[{"en":"In the poem, “dhundia” morning suggests a misty, soft atmosphere.","zh":"在诗里，“dhundia”的早晨暗示一种雾气朦胧、柔和的氛围。"},{"en":"The author used the word “dhundia” to evoke haze over the hills.","zh":"作者用“dhundia”来唤起山间薄雾的意象。"}]},{"partOfSpeech":"n.","definition":{"en":"A personal name or place name written as “Dhundia” in English letters (spelling varies by region and language).","zh":"以“Dhundia”拼写出现的人名或地名（不同地区/语言可能有不同拼法）。"},"examples":[{"en":"Dhundia is the name of a character in the story.","zh":"Dhundia 是故事里一个角色的名字。"},{"en":"She searched for “Dhundia” on a map to confirm the location.","zh":"她在地图上搜索“Dhundia”以确认地点。"}]}],"synonyms":["misty","foggy","hazy"],"phonetic":"/ˈdʊndiə/","extraExplanation":["“dhundia”更像是转写（transliteration）而不是英语词汇本身：把天城文等文字按发音写成拉丁字母，因此在英文资料里可能看到多种拼法（如 dhundiya, dhundhiya 等）。","如果你告诉我它出现的句子/语境（人名、地名、歌曲歌词、小说台词等），我可以更准确地判断它的来源语言、确切含义和更自然的英文表达。"]}
{"word":"dhunuchi","summary":{"en":"A dhunuchi is a clay incense burner used in Bengali Durga Puja rituals, sometimes carried while dancing.","zh":"Dhunuchi 是孟加拉地区在杜尔迦女神节仪式中使用的陶制熏香炉，也可手持起舞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Bengali culture) a small clay incense burner (often filled with burning coconut husk and incense) used especially during Durga Puja rituals and sometimes carried while dancing (dhunuchi naach).","zh":"（孟加拉文化）一种小型陶制熏香炉（常装燃烧的椰子纤维与香料/熏香），尤用于杜尔迦女神节（Durga Puja）的仪式中，有时也会手持起舞（dhunuchi dance）。"},"examples":[{"en":"During Durga Puja, people wave a dhunuchi in front of the goddess as an offering.","zh":"在杜尔迦女神节期间，人们会在女神像前摇动 dhunuchi 作为供奉。"},{"en":"The performers danced with dhunuchis, and the air filled with fragrant smoke.","zh":"表演者手持 dhunuchi 起舞，空气中充满了芬芳的烟雾。"}]}],"synonyms":["incense burner","censer","clay incense pot"],"phonetic":"/dʊˈnuːtʃi/","extraExplanation":["“Dhunuchi”是一个具有地域文化色彩的词，常见于印度东部（尤其西孟加拉）及孟加拉国的节庆语境。它不只是“香炉”，在Durga Puja的仪式中也象征敬奉与祈愿，因此在英文中常直接保留原词音译。","常见搭配：dhunuchi dance / dhunuchi naach（手持dhunuchi的舞蹈）、dhunuchi hata（举/摇dhunuchi）。拼写可能会有差异，如dhunuchi/dhunuchi.","发音提示：重音通常落在第二音节附近；英文读者有时会把结尾“-chi”读成“chee”的音。"]}
{"word":"dhurna","summary":{"en":"Dhurna (more commonly spelled dharna) means a sit-in style, nonviolent protest used especially in South Asia.","zh":"Dhurna（更常见拼写为 dharna）指一种常见于南亚的“静坐式”非暴力抗议。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South Asia) a form of nonviolent protest in which people sit or stay in a public place—often near an official or office—until a demand is heard or met; a sit-in.","zh":"（南亚）一种非暴力抗议方式：人们在公共场所（常在官员或机构门口）静坐或持续停留，直到诉求被听见或得到回应；类似“静坐抗议”。"},"examples":[{"en":"The workers began a dhurna outside the factory gate to demand unpaid wages.","zh":"工人们在工厂大门外开始了 dhurna，要求补发拖欠的工资。"},{"en":"Students held a dhurna at the administration building after the fee increase was announced.","zh":"宣布学费上涨后，学生们在行政楼前举行 dhurna。"}]}],"synonyms":["dharna","sit-in","protest","demonstration"],"phonetic":"/ˈdɑːrnə/","extraExplanation":["“dhurna”常见拼写为“dharna”（也写作“dharna/dhurna”），来自印地语/乌尔都语“धर्ना/دھرنا”。在印度、巴基斯坦等地新闻与日常语境中常用，通常指以“持续在场、静坐不离开”的方式向权力机构施压。","在英语语境里，它通常被当作文化借词使用，意思接近“sit-in”“peaceful protest”。如果写作英文文章，首次出现时可用括号解释：“a dhurna (a sit-in protest)”。"]}
{"word":"dhurnas","summary":{"en":"“Dhurnas” is usually the plural of “dharna,” meaning a sit-in style protest (common in South Asian English).","zh":"“dhurnas”通常是“dharna”的复数，指“静坐式抗议”（常见于南亚英语语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a protest in which people sit or stay in a place (often peacefully) to demand change or draw attention to a cause; a sit-in (South Asian English)","zh":"（南亚英语）静坐抗议；在某地停留（多为和平方式）以表达诉求、引起关注的示威行动"},"examples":[{"en":"Students held a dharna outside the administration building to protest the new rule.","zh":"学生们在行政楼外举行静坐抗议，反对新规定。"},{"en":"The workers began a dharna at the factory gate, asking for unpaid wages.","zh":"工人在工厂门口开始静坐抗议，要求补发拖欠工资。"}]}],"synonyms":["sit-in","protest","demonstration"],"phonetic":"/ˈdɑːrnə/","extraExplanation":["“Dharna”（也常写作“dharna(s)”）主要用于印度、巴基斯坦等南亚语境的新闻与日常表达，含义接近英语里的“sit-in”。","这个词源自印地语/乌尔都语，进一步可追溯到梵语词根，原本与“坚持、守在某处以施压或请求”相关；现代英语使用时通常指公共场合的（多为和平）抗议行动。"]}
{"word":"dhurra","summary":{"en":"Dhurra is another word for sorghum, a drought-tolerant grain crop.","zh":"Dhurra是高粱（sorghum）的别称，属于耐旱的谷物作物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of grain plant (sorghum) grown in hot, dry regions; its seeds are used for food and animal feed","zh":"一种高粱（蜀黍）类谷物，常种植于炎热干旱地区；其籽粒可作食物或饲料"},"examples":[{"en":"In some dry areas, dhurra is an important staple crop.","zh":"在一些干旱地区，dhurra（高粱）是重要的主食作物。"},{"en":"The farmers planted dhurra because it can survive with little rain.","zh":"农民种植dhurra，因为它在少雨条件下也能生长。"},{"en":"Dhurra seeds can be ground into flour for porridge or bread.","zh":"dhurra的籽粒可以磨成粉，用来做粥或面饼。"}]}],"synonyms":["sorghum","milo"],"phonetic":"/ˈdʊrə/","extraExplanation":["“dhurra”是一个较旧或带地域色彩的英语词，常见于描写北非、中东或印度次大陆农业与粮食作物的文章中；现代英语里更常直接说“sorghum”（高粱），在美国也常见俗称“milo”。","词源上通常认为来自阿拉伯语等语源中指代高粱类谷物的词（如 durra），因此在与伊斯兰世界、沙漠边缘农业相关的语境中更常出现。"]}
{"word":"dhurrie","summary":{"en":"A dhurrie is a lightweight, flat-woven cotton rug, commonly associated with India.","zh":"dhurrie 指一种轻便的平织棉质地毯，常与印度地区的传统地毯相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a flat-woven cotton rug (often from India or nearby regions), usually lightweight and reversible","zh":"一种平织的棉质地毯（常见于印度及其周边地区），通常较轻便、可双面使用"},"examples":[{"en":"They put a dhurrie in the living room because it’s easy to clean.","zh":"他们在客厅铺了一张dhurrie（印度平织棉毯），因为很容易清理。"},{"en":"The blue dhurrie has simple geometric patterns.","zh":"那张蓝色dhurrie有简洁的几何图案。"}]}],"synonyms":["flatweave rug","cotton rug","Indian rug"],"phonetic":"/ˈdʊri/","extraExplanation":["“Dhurrie”（也常拼作“durrie”）源自印地语/乌尔都语等南亚语言的词汇，用来指一种传统的平织地毯。它通常是棉织的，也可能混纺羊毛；特点是没有厚厚的绒毛（不像许多“pile carpet”那样蓬松），因此更轻、更适合炎热气候，也常被当作夏季地毯或门厅/走廊用毯。","在英语家居语境里，dhurrie 常与 “flatweave rug”（平织地毯）并列出现；购买或描述时常强调 “reversible”（可双面使用）和 “handwoven”（手工织造）。"]}
{"word":"dhurries","summary":{"en":"Dhurries are traditional South Asian handwoven flat rugs (plural form).","zh":"Dhurries 指南亚传统的手工平织地毯（复数形式）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of dhurrie) handwoven flat rugs, usually made of cotton or wool, traditionally from India and nearby regions.","zh":"（dhurrie 的复数）一种手工平织地毯，常用棉或羊毛编织，传统上产自印度及周边地区。"},"examples":[{"en":"They covered the stone floor with colorful dhurries to make the room warmer.","zh":"他们用彩色的 dhurries（平织地毯）铺在石地上，让房间更暖和。"},{"en":"In the market, dhurries were stacked beside baskets and brass lamps.","zh":"在集市上，dhurries 堆放在篮子和黄铜灯旁边。"}]}],"synonyms":["flat-woven rugs","woven rugs","durries"],"phonetic":"/ˈdʌriz/","extraExplanation":["“Dhurrie / dhurries”常见于英语里的南亚文化语境（家居、旅行、文学描写）。它指的是“平织”（flat-woven）的地毯：没有厚厚的绒毛（pile），所以更轻、也更容易卷起来带走。","拼写有时会见到 dhurrie / dhurry / dhurri；在一些地区也会用 “dari” 指类似的平织毯。"]}
{"word":"dhurry","summary":{"en":"A dhurry is a flat, handwoven rug from India (often cotton or wool).","zh":"dhurry 指一种来自印度的手工平织地毯（常为棉或羊毛）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a flat, handwoven rug (often cotton or wool) from India or nearby regions, usually with simple geometric patterns; also spelled dhurrie.","zh":"一种来自印度及周边地区的手工平织地毯（常为棉或羊毛材质），常见简洁的几何图案；也常拼作 dhurrie。"},"examples":[{"en":"They covered the wooden floor with a colorful dhurry.","zh":"他们用一张彩色的 dhurry 铺在木地板上。"},{"en":"A dhurry is usually flatwoven, so it feels thinner than a thick pile carpet.","zh":"dhurry 通常是平织的，所以摸起来比厚绒地毯更薄。"}]}],"synonyms":["dhurrie","durrie","flatwoven rug","Indian rug"],"phonetic":"/ˈdʌri/","extraExplanation":["“Dhurry / dhurrie”来源于印地语等南亚语言中的“dari / dhurrī”，指传统平织地毯。英文里多用于室内装饰、纺织品与手工艺语境。拼写不固定（dhurry, dhurrie, durrie 都可能见到），但含义相近。"]}
{"word":"dhuti","summary":{"en":"Dhuti: a traditional South Asian wrap garment (often men’s), usually spelled dhoti.","zh":"Dhuti：南亚（尤指印度）传统围裹式服装（多为男装），常见拼写为 dhoti。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a traditional South Asian garment (especially in India) consisting of a long piece of cloth wrapped around the waist and legs; a common men’s traditional dress in many regions. (Also spelled: dhoti.)","zh":"（南亚，尤指印度的）传统服饰：一块长布围裹在腰部并绕过腿部形成的下装；在许多地区是常见的男装传统服饰。（也拼作 dhoti）"},"examples":[{"en":"He wore a white dhuti for the temple ceremony.","zh":"他在寺庙仪式上穿了一条白色的 dhuti。"},{"en":"In the film, the village elder appears in a dhuti and shawl.","zh":"电影里，村里的长者身穿 dhuti、披着披肩出场。"},{"en":"Some people choose a dhuti for weddings and other formal cultural events.","zh":"有些人在婚礼等正式的文化活动中会选择穿 dhuti。"}]}],"synonyms":["dhoti","wrap garment","loincloth","traditional wrap"],"phonetic":"/ˈdoʊti/","extraExplanation":["“Dhuti”是“dhoti”的另一种拼写，更常见的拼写是“dhoti”。英语里读音多按“dhoti”的读法来读。","Dhuti/dhoti 在不同地区有不同的穿法与名称（例如与 lungi、veshti 等相关或相近，但并不完全相同）。在一些场合它带有礼仪与身份/文化传统的意味。","在英文写作中，如果担心读者不熟悉，可以第一次出现时加一句解释，例如：“a traditional wrap garment”或“a long cloth wrapped around the waist.”"]}
{"word":"dhutis","summary":{"en":"“Dhutis” is the plural of “dhoti,” a traditional South Asian wrap garment worn mainly by men.","zh":"“Dhutis” 是 “dhoti” 的复数，指一种南亚（主要印度）传统的裹身服装，多由男性穿着。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"n. (plural) Dhutis are traditional South Asian garments—especially in India—made from a long piece of cloth wrapped around the waist and legs (plural of “dhoti”). Example: “Many men wore white dhutis for the ceremony.”","zh":"n.（复数）Dhutis 指南亚（尤其印度）传统服装，由一块长布缠绕腰部和腿部形成（是 dhoti 的复数）。例：Many men wore white dhutis for the ceremony（许多男子在仪式上穿白色 dhuti）。"},"examples":[{"en":"At the temple, some visitors were dressed in simple shirts and dhutis.","zh":"在寺庙里，一些访客穿着朴素的衬衫和 dhuti。"},{"en":"The dancer’s costume included bright fabric and a neatly pleated dhoti; backstage you could see other dancers’ dhutis drying.","zh":"舞者的服装包含鲜艳的布料和褶裥整齐的 dhoti；后台还能看到其他舞者的 dhuti 在晾干。"}]}],"synonyms":["dhotis (standard plural)","wrap garment","traditional Indian garment"],"phonetic":"/ˈdoʊtiz/","extraExplanation":["“Dhoti”（复数 *dhutis*）常见于印度多地，也有不同地区叫法与穿法；在正式场合（婚礼、宗教仪式）常用白色或浅色布料。","英文里常把它当作可数名词：a dhoti / two dhutis。发音和拼写有时会因转写系统不同而出现变体，但最常见拼写是 *dhoti*。"]}
{"word":"dhyal","summary":{"en":"“Dhyal” isn’t a common English word; you probably mean “dial” (to phone a number / a device’s dial).","zh":"“dhyal”不是常见英语词；你很可能想写“dial”（拨打电话 / 刻度盘或旋钮）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“Dhyal” is not a standard English word; it is most likely a misspelling of “dial.”","zh":"“dhyal”不是标准英语单词；很可能是把“dial”拼错了。"},"examples":[{"en":"I couldn’t find “dhyal” in an English dictionary—did you mean “dial”?","zh":"我在英语词典里找不到“dhyal”——你是不是想写“dial”？"},{"en":"If you meant “dial,” you can dial a number or turn a dial on a machine.","zh":"如果你想写的是“dial”，它可以表示拨电话号码，或旋转机器上的刻度盘。"}]},{"partOfSpeech":"vt.","definition":{"en":"to call a phone number by pressing or turning the digits","zh":"（用电话）拨（号码）"},"examples":[{"en":"Please dial 911 in an emergency.","zh":"紧急情况下请拨打911。"},{"en":"I dialed her number, but it went to voicemail.","zh":"我拨了她的号码，但转到了语音信箱。"}]},{"partOfSpeech":"n.","definition":{"en":"a round control or face with numbers/marks that you turn or read (on a device or clock)","zh":"（设备上的）刻度盘；旋钮；（钟表的）表盘"},"examples":[{"en":"Turn the dial to increase the volume.","zh":"转动旋钮来调高音量。"},{"en":"The clock has a clean white dial with black numbers.","zh":"这只钟有干净的白色表盘和黑色数字。"}]}],"synonyms":["call","phone","ring","knob","dials (controls)"],"phonetic":"/ˈdaɪəl/","extraExplanation":["如果“dhyal”是人名、地名，或来自其他语言的音译（例如南亚语言的拼写），请告诉我它出现的句子/语境或你想表达的意思，我可以帮你确认最合适的英文写法与含义。","“dial”在现代英语里仍常用（尤其是“dial a number”），但在手机时代也常被更口语的“call/text”替代；名词“dial”则常见于收音机、烤箱、仪表等设备。"]}
{"word":"dhyana","summary":{"en":"Dhyana means deep meditation or a meditative state/practice in Buddhism and yoga.","zh":"dhyana 指佛教与瑜伽中的“禅定/深度冥想”状态或相关修习方法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Buddhism and yoga) deep meditation; a state of focused, calm awareness.","zh":"（佛教与瑜伽中）禅定；深度冥想的状态，专注而平静的觉知。"},"examples":[{"en":"In yoga class, dhyana is the stage of meditation after concentration.","zh":"在瑜伽课里，dhyana 指的是在“专注”之后进入的“冥想/禅定”阶段。"},{"en":"Some Buddhist texts describe dhyana as a calm, steady mind that sees clearly.","zh":"一些佛教典籍把 dhyana 描述为一种平静而稳定、能清晰观照的心境。"}]},{"partOfSpeech":"n.","definition":{"en":"A meditative practice aimed at training attention and cultivating insight.","zh":"一种冥想修习方法，用来训练注意力并培养觉察与洞见。"},"examples":[{"en":"She practices dhyana for ten minutes each morning to settle her thoughts.","zh":"她每天早晨练习十分钟的 dhyana，让思绪安定下来。"},{"en":"Dhyana is often taught together with breathing and posture work.","zh":"dhyana 常与呼吸练习和体式调整一起教授。"}]}],"synonyms":["meditation","contemplation","samadhi (related, but not identical)","mindfulness (related)"],"phonetic":"ˈdjɑːnə","extraExplanation":["dhyana 源自梵语 ध्यान（意为“沉思、禅定”）。它进入英语时多用于宗教学、佛学与瑜伽语境。","在佛教传播中，dhyana 的音译与意译影响很深：传入汉语常对应“禅/禅定”，传到东亚后又与“禅宗（Zen）”的词源相关（Zen 来自日语的“禅”，而“禅”与 dhyana 同源）。","在瑜伽的“八支”（Eight Limbs）体系中，dhyana 通常指比 dharana（专注/凝神）更持续、更稳定的冥想状态。"]}

