{"word":"DI","summary":{"en":"DI usually means the letters “D” and “I”; in tech it often means dependency injection; in UK policing it can mean Detective Inspector.","zh":"DI 通常指字母“D”和“I”的组合；在科技领域常指“依赖注入”；在英国警务语境中也可指“侦探督察”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"the two letters “D” and “I,” used when spelling or naming something (an initialism).","zh":"字母组合“D I”，常用于拼写、缩写或名称中的首字母。"},"examples":[{"en":"My username starts with DI.","zh":"我的用户名以 DI 开头。"},{"en":"Please write your initials: D.I.","zh":"请写下你的姓名首字母：D.I."}]},{"partOfSpeech":"n.","definition":{"en":"(computing) short for “dependency injection,” a programming technique where a program is given the objects/resources it needs instead of creating them itself.","zh":"（计算机）“dependency injection”的缩写，指“依赖注入”：程序所需的对象/资源由外部提供，而不是在程序内部自己创建。"},"examples":[{"en":"This framework uses DI to make testing easier.","zh":"这个框架使用 DI 来让测试更容易。"},{"en":"With DI, you can swap the database service without changing much code.","zh":"用 DI，你可以在不大改代码的情况下替换数据库服务。"}]},{"partOfSpeech":"n.","definition":{"en":"(UK, police) short for “Detective Inspector,” a detective rank in British policing.","zh":"（英国警务）“Detective Inspector”的缩写，指英国警察系统中的“侦探督察”这一警衔。"},"examples":[{"en":"The case was assigned to a DI.","zh":"这个案件交给了一位 DI 负责。"},{"en":"In the show, DI Jones interviews the suspect.","zh":"在剧里，DI Jones 讯问了嫌疑人。"}]}],"synonyms":["initials","abbreviation"],"phonetic":"/ˌdiːˈaɪ/","extraExplanation":["“DI”最常见的用法取决于语境：在科技/编程圈里常指 dependency injection；在英剧或英国新闻里可能指 Detective Inspector（侦探督察）。如果你是在某个句子里看到 DI，把原句发我，我可以帮你判断具体意思。"]}
{"word":"Di","summary":{"en":"Di- is most commonly a prefix meaning “two,” and DI can also be an abbreviation with meanings that depend on the field.","zh":"Di- 最常见是表示“两个/双”的前缀；DI 也可作缩写，具体含义取决于领域。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a prefix meaning “two” or “double,” used to form words in science and everyday English.","zh":"表示“两个 / 双”的前缀，用于构成科学或日常英语词汇。"},"examples":[{"en":"Carbon dioxide has two oxygen atoms.","zh":"二氧化碳有两个氧原子。"},{"en":"A bicycle is a kind of two-wheeled vehicle (bi- is more common here than di-).","zh":"自行车是一种两轮交通工具（这里更常用 bi-，但同样表示“两个”）。"}]},{"partOfSpeech":"other","definition":{"en":"(DI) an abbreviation that can mean different things depending on context, such as “detective inspector” (police) or “digital input” (electronics).","zh":"（DI）缩写，含义取决于语境，例如“警探督察”（警务）或“数字输入”（电子/工业控制）。"},"examples":[{"en":"In some British crime stories, a DI leads the investigation.","zh":"在一些英国犯罪故事里，DI 负责带领调查。"},{"en":"The sensor connects to the PLC’s DI channel.","zh":"传感器连接到 PLC 的数字输入（DI）通道。"}]}],"synonyms":["bi- (similar meaning: two, in many everyday words)"],"phonetic":"/daɪ/","extraExplanation":["前缀 di- 常见于科学词汇，特别是化学命名：dioxide（二氧化物）、disulfide（二硫化物）、dihydrate（二水合物）等，核心意思就是“含有两个……”。","表示“两个”时，有时也会看到 bi-（如 bicycle, bilingual）。一般来说：bi- 在日常词更常见；di- 在科学/化学术语里非常常见。","如果你输入的“Di”是人名、昵称，或你想查的是某个具体短语（如 “DI water”=去离子水），告诉我完整上下文，我可以给更精确的释义。"]}
{"word":"di","summary":{"en":"“di” is a solfège syllable for a raised do; “DI” is also a common abbreviation in titles such as Detective Inspector.","zh":"“di”可作视唱唱名，表示“升do”；“DI”也常作缩写用于头衔，如英国的侦缉督察。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(music, solfège) The syllable used for the raised first note of a scale (a “sharp do”), especially in fixed-do or movable-do systems.","zh":"（音乐，视唱练耳）用于表示升高的第一音级的唱名（“升do”），常见于固定/首调唱名体系。"},"examples":[{"en":"In the key of C, C-sharp is often sung as “di.”","zh":"在C大调里，C升（C#）常常唱作“di”。"},{"en":"The melody moves from do to di to re, creating a rising tension.","zh":"旋律从do到di再到re，带来上行的紧张感。"}]},{"partOfSpeech":"other","definition":{"en":"Abbreviation: “DI,” used in names/titles for certain roles (e.g., Detective Inspector in UK police).","zh":"缩写：DI，用于某些职位/头衔名称中（例如英国警队的“Detective Inspector”侦缉督察）。"},"examples":[{"en":"DI Harris led the investigation.","zh":"侦缉督察哈里斯（DI Harris）负责这起调查。"},{"en":"The report was signed by a DI from the local station.","zh":"这份报告由当地警署的一位DI签署。"}]}],"phonetic":"/di/","extraExplanation":["“di”作为唱名最常出现在半音变化里：do→di→re（相当于C→C#→D）。它常用来帮助学习者听辨与演唱半音阶或转调时的音高变化。","“DI”作为缩写在不同领域含义很多（如教育、计算机、医学等）。如果你告诉我上下文（看到它的句子/领域），我可以给出最贴切的释义与例句。"]}
{"word":"di-alkyl","summary":{"en":"Di-alkyl describes a chemical structure with two alkyl groups.","zh":"di-alkyl 指带有两个烷基的化学结构（“二烷基的”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Having two alkyl groups (carbon‑based groups like methyl or ethyl) attached to the same molecule or functional group.","zh":"（化学）“二烷基的”；指在同一分子或官能团上带有两个烷基（如甲基、乙基等碳链基团）。"},"examples":[{"en":"A dialkyl ether has two alkyl groups bonded to an oxygen atom.","zh":"二烷基醚的氧原子两侧各连接一个烷基。"},{"en":"The compound is di-alkyl substituted, which can change its boiling point and solubility.","zh":"该化合物是二烷基取代的，这可能会改变它的沸点和溶解性。"}]}],"synonyms":["dialkyl","di-alkyl (hyphenated form)"],"phonetic":"/daɪˈælkaɪl/","extraExplanation":["“di-”是前缀，表示“两个/双”。“alkyl（烷基）”是由烷烃去掉一个氢原子得到的取代基（如 methyl 甲基、ethyl 乙基）。","写法上常见两种：di-alkyl（带连字符）与 dialkyl（连写）。在化学文献或产品说明中两者含义相同，具体用哪种往往取决于期刊/公司风格指南。","它通常用来描述“取代/结构类型”，例如 dialkyl ether（二烷基醚）、dialkyl amine（二烷基胺）。在更严格的命名（如 IUPAC）里，常会直接写出具体烷基名称（例如 dimethyl、diethyl）。"]}
{"word":"di-allyl","summary":{"en":"“Di-allyl / diallyl” means “containing two allyl groups” in chemistry, and can also refer to a compound with two allyl groups.","zh":"“di-allyl / diallyl”在化学中指“含有两个烯丙基”，也可指含两个烯丙基的化合物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Having two allyl groups (–CH2–CH=CH2) in a molecule; relating to a compound that contains two allyl groups.","zh":"（化学）含有两个烯丙基（–CH2–CH=CH2）的；指分子中带有两个烯丙基的化合物。"},"examples":[{"en":"Diallyl ether is a flammable liquid used as a chemical intermediate.","zh":"二烯丙基醚是一种易燃液体，常用作化工中间体。"},{"en":"The resin was cross-linked using a diallyl compound.","zh":"这种树脂用二烯丙基化合物进行交联。"}]},{"partOfSpeech":"n.","definition":{"en":"A compound that contains two allyl groups (often written as one word: diallyl).","zh":"含有两个烯丙基的化合物（常写作一个词：diallyl）。"},"examples":[{"en":"The reaction produced a small amount of diallyl as a byproduct.","zh":"该反应生成了少量二烯丙基类物质作为副产物。"}]}],"synonyms":["diallyl","bis(allyl)"],"phonetic":"/daɪˈæl.aɪl/","extraExplanation":["“di-”是前缀，表示“两个/双”。“allyl（烯丙基）”是常见的有机基团，结构为 –CH2–CH=CH2，来源于与烯烃（alkene）相关的命名体系。","写法上常见“diallyl”（一个词）或“di-allyl”（用连字符强调构词）。在化学文献里，两者通常指同一概念。","常见相关词：diallyl ether（二烯丙基醚）、diallyl phthalate (DAP)（邻苯二甲酸二烯丙酯，常用于树脂/塑料)。"]}
{"word":"di-amide","summary":{"en":"A di-amide is a compound with two amide (–CONH–) groups in one molecule.","zh":"di-amide（二酰胺）指在同一分子中含有两个酰胺基（–CONH–）的化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound that contains two amide groups (–CONH–) in the same molecule; also called a bisamide.","zh":"一种在同一分子中含有两个酰胺基（–CONH–）的化合物；也称“双酰胺 / 二酰胺（bisamide）”。"},"examples":[{"en":"This di-amide forms strong hydrogen bonds, so it has a relatively high melting point.","zh":"这种二酰胺会形成较强的氢键，因此熔点相对较高。"},{"en":"The chemist synthesized a di-amide by reacting a diacid chloride with ammonia.","zh":"化学家用二酰氯与氨反应合成了二酰胺。"}]}],"synonyms":["bisamide","dicarboxamide"],"phonetic":"/daɪˈæmaɪd/","extraExplanation":["“di-”表示“两个”，“amide”是“酰胺”。写作“diamide / di-amide / di amide”在资料中都可能出现；带连字符（di-amide）通常是为了强调结构：含有两个酰胺基。","在有机化学命名里，含两个酰胺基的化合物也常用“bisamide”或更具体的名称（如“某某二酰胺 / dicarboxamide”）来描述，具体要看酰胺基来自哪种酸（例如二羧酸衍生物）。"]}
{"word":"di-amido","summary":{"en":"“Di-amido” is a chemistry term meaning “having two amido (–CONH2) groups,” or a compound that contains two amido groups.","zh":"“di-amido”是化学术语，表示“含有两个酰胺基（–CONH2）”，也可指含有两个酰胺基的化合物（即二酰胺）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Having two amido groups (–CONH2) in a molecule; relating to a compound that contains two amido groups.","zh":"（化学）含有两个酰胺基（–CONH2）的；指含有两个酰胺基的化合物或与之相关。"},"examples":[{"en":"A di-amido compound may form strong hydrogen bonds because it has two amido groups.","zh":"二酰胺类化合物由于含有两个酰胺基，可能形成较强的氢键。"},{"en":"The paper describes the synthesis of a di-amido derivative for polymer research.","zh":"该论文描述了一种用于高分子研究的二酰胺衍生物的合成方法。"}]},{"partOfSpeech":"n.","definition":{"en":"A compound (often called a diamide) that contains two amido groups.","zh":"（常称为 diamide）含有两个酰胺基的化合物；二酰胺。"},"examples":[{"en":"They isolated a di-amido from the reaction mixture and confirmed its structure by NMR.","zh":"他们从反应混合物中分离出一种二酰胺，并用核磁共振（NMR）确认其结构。"}]}],"synonyms":["diamide","diamido-","bis(amido)"],"phonetic":"/daɪˈæmɪdoʊ/","extraExplanation":["在化学命名里，di- 表示“两个”。amido（酰胺基）通常指 –CONH2 这一官能团，所以 di-amido/diamide 往往与“二酰胺”相关。","写法上常见有连字符 di-amido，也常见合写 diamido；具体取决于教材/期刊的风格。","不要和 amino（氨基，–NH2）混淆：amido 指酰胺基（含羰基 C=O），amino 指单纯的氨基。"]}
{"word":"di-amylose","summary":{"en":"di-amylose is an uncommon technical term meaning an amylose unit of two linked glucose units (an amylose dimer), sometimes used similarly to maltose.","zh":"di-amylose 是不常见的专业术语，指由两个葡萄糖连接构成的直链淀粉“二聚体”，某些语境下与“麦芽糖”用法相近。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare scientific term in carbohydrate chemistry referring to an extremely short fragment of amylose made of two linked glucose units (an amylose “dimer”), sometimes essentially equivalent to maltose in meaning.","zh":"一个较少见的糖类化学术语，指由两个葡萄糖单元连接而成的极短“直链淀粉片段”（直链淀粉的“二聚体”）；在一些语境下意义上几乎等同于“麦芽糖”。"},"examples":[{"en":"In one experiment, the enzyme broke amylose into small pieces, including di-amylose.","zh":"在一个实验中，该酶把直链淀粉分解成小片段，其中包括二聚直链淀粉（di-amylose）。"},{"en":"The report mentions di-amylose as a simple model for longer amylose chains.","zh":"报告提到用 di-amylose 作为更长直链淀粉链的简单模型。"}]}],"synonyms":["diamylose","amylose dimer","maltose (in some contexts)"],"phonetic":"/daɪ ˈæmɪloʊs/","extraExplanation":["“di-”表示“两个/二-”。但“di-amylose”并不是常见的标准词条；不同论文/教材可能用它来指“由两个葡萄糖构成的直链淀粉最小片段”，也可能更宽泛地指“两条直链淀粉链形成的结构/复合体”。阅读时最好结合原文对结构（是否就是麦芽糖、是否指两条链）和键型（常见为 α(1→4)）的说明来判断。"]}
{"word":"di-basic","summary":{"en":"Dibasic describes something (especially an acid) that can react in two steps because it has two replaceable/neutralizable hydrogen ions, or more broadly has two basic sites.","zh":"Dibasic 指（尤指酸）具有两个可电离/可被中和的酸性氢、可分两步反应；也可泛指具有两个碱性位点/基团。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Having two acidic hydrogens (two H⁺ ions) that can be replaced or neutralized; able to react with two equivalents of base. Commonly used for acids (e.g., sulfuric acid is dibasic).","zh":"（化学）指含有两个可电离/可被中和或置换的酸性氢（可释放两个 H⁺）；常用于描述“二元酸/二碱酸”，如硫酸属于二碱酸。"},"examples":[{"en":"Sulfuric acid (H₂SO₄) is a dibasic acid.","zh":"硫酸（H₂SO₄）是一种二碱酸（dibasic acid）。"},{"en":"A dibasic acid can form two different salts by partial or complete neutralization.","zh":"二碱酸在部分或完全中和时可以形成两种不同的盐。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Containing or involving two basic groups/sites (sometimes said of salts or compounds, depending on context).","zh":"（化学）含有两个碱性基团/碱性位点的；在某些语境中也可用于描述盐或化合物的性质。"},"examples":[{"en":"The molecule has two amine groups, making it dibasic in character.","zh":"这个分子含有两个胺基，因此具有“二碱性（dibasic）”特征。"}]}],"synonyms":["diprotic (for acids)","two-proton (for acids)","diacidic (less common)"],"phonetic":"/daɪˈbeɪsɪk/","extraExplanation":["“dibasic”更常见的拼写是不加连字符的 dibasic；写作“di-basic”也能理解，但在教材、期刊与字典里通常用 dibasic。","前缀 di- 表示“两个/双”，basic 与“碱/碱性”相关。在化学里它经常出现在搭配 dibasic acid（二碱酸）中。"]}
{"word":"di-diazo","summary":{"en":"Didiazo (di-diazo) describes, or names, a chemical compound containing two diazo (–N₂) groups.","zh":"didiazo（或写作 di-diazo）指“含两个重氮（–N₂）基团的”或“含两个重氮基的化合物”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Having two diazo (–N₂) functional groups; relating to a compound that contains two diazo groups.","zh":"（化学）含有两个重氮（–N₂）官能团的；指含两个重氮基的化合物。"},"examples":[{"en":"A didiazo compound can be more reactive than a mono‑diazo compound.","zh":"含两个重氮基的化合物可能比只含一个重氮基的化合物更活泼。"},{"en":"The paper describes a didiazo intermediate used in an organic synthesis.","zh":"这篇论文描述了一种用于有机合成的二重氮中间体。"}]},{"partOfSpeech":"n.","definition":{"en":"A compound that contains two diazo groups.","zh":"含有两个重氮基（–N₂）的化合物。"},"examples":[{"en":"The chemist prepared a didiazo under controlled conditions.","zh":"化学家在受控条件下制备了一种二重氮化合物。"}]}],"synonyms":["bis(diazo)-","di(diazo)-"],"phonetic":"/ˌdaɪdaɪˈeɪzoʊ/","extraExplanation":["“di-”是前缀，表示“两个/双”。“diazo”指“重氮基”，常见表示为 –N₂（在许多重氮化合物中可理解为带正电的 –N₂⁺ 片段）。因此 didiazo（或写作 di-diazo）字面意思就是“含两个重氮基”。","这类词多见于科研论文、专利或有机化学语境；日常英语中很少使用。书写上有时会看到连字符（di-diazo），也可能写作一个词（didiazo），具体取决于作者或期刊风格。","重氮化合物常具有较高反应性，有的还可能有安全风险；相关操作一般需要专业训练与规范条件。"]}
{"word":"di-glucoside","summary":{"en":"A di-glucoside is a compound with two glucose units attached to another molecule by glycosidic bonds.","zh":"di-glucoside 指“二葡糖苷”，即有两个葡萄糖单元通过糖苷键连接到其他分子上的化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry/Biochemistry) A compound in which two glucose units (glucosyl groups) are attached to another molecule (the “aglycone”) through glycosidic bonds.","zh":"（化学/生物化学）一种“二葡糖苷”化合物：有两个葡萄糖单元（葡糖基）通过糖苷键连接在另一种分子（非糖部分，aglycone）上。"},"examples":[{"en":"Some plant pigments occur naturally as di-glucosides, which can change their color and stability.","zh":"一些植物色素天然以二葡糖苷的形式存在，这会影响它们的颜色和稳定性。"},{"en":"Researchers identified a flavonoid di-glucoside in the leaf extract.","zh":"研究人员在叶片提取物中鉴定出一种黄酮二葡糖苷。"}]}],"synonyms":["diglucoside","bis-glucoside"],"phonetic":"/daɪ ˈɡluːkəˌsaɪd/","extraExplanation":["“di-”表示“两个”；“glucoside（葡糖苷）”指“葡萄糖以糖苷键连接到其他分子上形成的衍生物”。因此 di-glucoside 字面意思是“带有两个葡萄糖的糖苷”。","在天然产物与食品化学里，糖苷化（加上葡萄糖）常会提高分子的水溶性、影响味道（如苦味）、以及改变在体内的代谢方式。","写法上常见 di-glucoside、diglucoside 或写得更具体（如 3,7-di-O-glucoside），具体名称取决于两个葡萄糖连接的位置与方式。"]}
{"word":"di-ketone","summary":{"en":"A diketone is a molecule with two ketone (C=O) groups.","zh":"二酮是指含有两个酮基（C=O 羰基）的分子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) An organic compound that contains two ketone groups (two carbonyl groups, C=O) in the same molecule.","zh":"（化学）二酮：分子中含有两个酮基（两个羰基 C=O）的有机化合物。"},"examples":[{"en":"Acetylacetone is a common diketone used in coordination chemistry.","zh":"乙酰丙酮是一种常见的二酮，常用于配位化学。"},{"en":"Some diketones can form rings or chelate metals because they have two carbonyl groups.","zh":"一些二酮因为具有两个羰基，能成环或与金属形成螯合物。"}]}],"synonyms":["dione","di-ketone"],"phonetic":"/daɪˈkiːtoʊn/","extraExplanation":["“di-”表示“两个”，“ketone”表示“酮”。因此 diketone（也常写作 di-ketone）字面意思就是“含两个酮基的化合物”。","二酮的两个羰基可能相邻（如 1,2-二酮）或隔开（如 1,3-二酮），不同位置会影响反应性与用途。"]}
{"word":"di-lead","summary":{"en":"“di-lead” is a chemistry term meaning “containing two lead (Pb) atoms.”","zh":"“di-lead”多用于化学语境，表示“含有两个铅（Pb）原子”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Having or containing two lead (Pb) atoms in a molecule or compound name.","zh":"（化学）指分子或化合物名称中“含有两个铅（Pb）原子”的。"},"examples":[{"en":"In some chemical names, di- indicates two atoms of the element, so di-lead refers to two lead atoms.","zh":"在一些化学命名中，di- 表示“两个”，因此 di-lead 指“两个铅原子”。"},{"en":"A description like di-lead may appear in systematic naming when a structure contains two Pb centers.","zh":"当结构中含有两个 Pb 中心时，系统命名里可能会出现类似 di-lead 的描述。"}]}],"synonyms":["dilead (variant spelling)"],"phonetic":"/daɪˈlɛd/","extraExplanation":["“di-”是源自希腊语的常见前缀，表示“二、两个”。在化学命名中，它常用来说明某种原子或基团的数量（如 dioxide 二氧化物、disulfide 二硫化物）。","“di-lead”并不是日常英语里的常用词，更常见的是出现在专业化学语境或作为更长系统名称的一部分。实际阅读时，也可能看到写作形式为 dilead（连写）或用括号标价态（如 lead(II)）。"]}
{"word":"di-manganese","summary":{"en":"“Di-manganese / dimanganese” is a chemistry term meaning “containing two manganese atoms.”","zh":"“di-manganese / dimanganese”是化学用语，表示“含有两个锰原子”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Chemistry) Having or containing two manganese (Mn) atoms in one molecule or structural unit; also used as the name part for compounds with two manganese atoms (e.g., “dimanganese tetraoxide”).","zh":"（化学）指一个分子或结构单元中含有两个锰（Mn）原子；也常作为化合物名称的一部分，用来表示“含两个锰原子”（如“二锰四氧化物”）。"},"examples":[{"en":"The compound is described as a dimanganese complex because it contains two Mn centers.","zh":"这种化合物被称为二锰配合物，因为它含有两个锰中心。"},{"en":"In systematic naming, “di-” indicates two, so dimanganese suggests two manganese atoms.","zh":"在系统命名中，“di-”表示“二”，因此 dimanganese 暗示有两个锰原子。"}]}],"synonyms":["dimanganese"],"phonetic":"/ˌdaɪˈmæŋɡəniːz/","extraExplanation":["在化学命名里，前缀 di- 表示“两个”。因此 dimanganese（也常写作 dimanganese 或带连字符 di-manganese）多用于学术或技术语境，强调“含两个锰原子/两个锰中心”。日常英语中更常见的说法是 “two manganese atoms/ions”。","连字符写法（di-manganese）在一些资料中用于让结构更清晰，但在正式的系统命名或文献中也常见合写（dimanganese）。具体是否用连字符取决于出版风格或具体命名体系。"]}
{"word":"di-n-butyl","summary":{"en":"“di-n-butyl” is a chemistry term meaning “with two straight-chain (normal) butyl groups.”","zh":"“di-n-butyl” 是化学用语，表示“含有两个正（直链）丁基”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Having two n-butyl groups (straight-chain butyl groups, C4H9) attached to a molecule; used as a name part in compounds (for example, di-n-butyl phthalate).","zh":"（化学）指分子中连有两个正丁基（直链丁基，C4H9）；常作为化合物名称的一部分使用（如 di-n-butyl phthalate：邻苯二甲酸二正丁酯）。"},"examples":[{"en":"The label lists di-n-butyl phthalate as an ingredient.","zh":"标签上把 di-n-butyl phthalate（邻苯二甲酸二正丁酯）列为成分之一。"},{"en":"Chemists use “di-n-butyl” to show that both butyl groups are the straight-chain form.","zh":"化学家用 “di-n-butyl” 来表示两个丁基都是直链（正丁基）形式。"}]}],"synonyms":["dibutyl","di-n-butyl- (as a prefix)"],"phonetic":"/ˌdaɪ ən ˈbjuːtəl/","extraExplanation":["“di-” 表示“两个”；“n-” 是 normal（正/直链）的缩写，用来区分直链与支链同分异构体（如 sec-、iso-、tert-）。因此 di-n-butyl 强调：有两个“正丁基”取代基。","它常出现在化学品名称或安全数据表（SDS）中，作为结构信息的一部分；单独使用时通常需要后面接具体化合物名。"]}
{"word":"di-naphthyl","summary":{"en":"Di-naphthyl describes something that has two naphthyl (naphthalene-derived) groups, mainly in chemical naming.","zh":"Di-naphthyl 指含有两个萘基（由萘衍生的基团）的结构，主要用于化学命名与描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing or relating to two naphthyl groups (naphthalene-derived aromatic groups), often used in chemical names.","zh":"（化学）含有或与两个“萘基”（由萘衍生的芳香基团）有关的；常用于化合物命名中。"},"examples":[{"en":"The ligand has a di-naphthyl backbone that increases rigidity.","zh":"这种配体具有二萘基骨架，使结构更刚性。"},{"en":"Researchers synthesized a di-naphthyl compound to improve fluorescence.","zh":"研究人员合成了一种二萘基化合物以提升荧光性能。"}]},{"partOfSpeech":"n.","definition":{"en":"A compound or substituent unit that includes two naphthyl groups.","zh":"（化学）含有两个萘基的化合物或取代基单元。"},"examples":[{"en":"The paper reports several di-naphthyls with different substituents.","zh":"论文报道了几种带有不同取代基的二萘基化合物。"}]}],"synonyms":["dinaphthyl","di(naphthyl)-","binaphthyl (related structure)"],"phonetic":"/ˌdaɪ ˈnæfθaɪl/","extraExplanation":["“di-”表示“两个/双”，而“naphthyl（萘基）”是从“naphthalene（萘）”衍生的基团名称。化学文献中也常写作“dinaphthyl”“di(naphthyl)-”或“biaryl（联芳基）”相关结构（如“binaphthyl/联萘”）。","该词多见于有机化学、材料化学与药物化学的命名中，通常用来强调分子里有两段萘环结构，因此常与疏水性增强、共轭体系增大、荧光/光学性质变化等描述搭配出现。"]}
{"word":"di-picrate","summary":{"en":"Dipicrate is a chemistry term for a salt/compound containing two picrate (picric-acid-derived) groups.","zh":"di-picrate（dipicrate）是化学术语，指含有两个苦味酸根（由苦味酸衍生）的盐或化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical salt or compound that contains two picrate groups (picrate = the ion/derivative of picric acid).","zh":"（化学）二苦味酸盐；含有两个“苦味酸根（picrate）”基团/离子的盐或化合物。"},"examples":[{"en":"In the lab notes, the product was identified as a metal dipicrate.","zh":"在实验记录中，该产物被鉴定为一种金属二苦味酸盐。"},{"en":"Some dipicrates can be sensitive, so they must be handled with care.","zh":"某些二苦味酸盐可能较为敏感，因此必须小心操作。"}]}],"synonyms":["dipicrate (variant spelling)","di-picrate (hyphenated form)"],"phonetic":"/daɪˈpɪkreɪt/","extraExplanation":["“picrate”来自“picric acid（苦味酸）”。苦味酸及其盐类在化学与材料领域出现过，但有些苦味酸盐可能具有爆炸/敏感风险；具体危险性取决于金属离子、纯度与条件。阅读安全数据表（SDS）并遵守实验室规范很重要。","拼写上常见为 dipicrate 或 di-picrate；“di-”表示“两个”。"]}
{"word":"di-potassium","summary":{"en":"“Dipotassium” means “having two potassium (K) atoms/ions,” mainly used in chemical names and ingredient lists.","zh":"“Dipotassium”指“含有两个钾（K）原子/离子”，主要用于化学名称和成分表。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Containing two potassium atoms or ions (K), often written in formulas as K₂- or “di-” + potassium in names.","zh":"（化学）含有两个钾原子或钾离子（K）的；在化学式中常写作 K₂-，在名称中常用“di-（二）+ potassium（钾）”表示。"},"examples":[{"en":"Dipotassium phosphate (K2HPO4) is used as a buffering agent in some foods and labs.","zh":"磷酸氢二钾（K2HPO4）在一些食品和实验室中用作缓冲剂。"},{"en":"The label lists dipotassium glycyrrhizate as an ingredient in the skincare product.","zh":"标签上写着该护肤品含有“甘草酸二钾（dipotassium glycyrrhizate）”这一成分。"}]}],"synonyms":["potassium(II) (in some naming contexts)","K2- (as a formula pattern, not a true synonym)"],"phonetic":"/ˌdaɪpəˈtæsiəm/","extraExplanation":["“di-”是表示“二、两个”的前缀；因此 dipotassium 直译就是“二钾”。在正式化学命名中更常见的是写在具体化合物名称里（如 dipotassium phosphate），单独把 dipotassium 当作一个词使用多见于配方/成分表或化学语境。","拼写上常见 dipotassium（连写）与 di-potassium（带连字符）两种；现代科技与成分标注中更常用连写 dipotassium。"]}
{"word":"di-sodium","summary":{"en":"Disodium means “with two sodium ions,” commonly used in the names of chemical salts (e.g., disodium phosphate).","zh":"Disodium 表示“含两个钠离子”，常用于化学盐类名称（如磷酸二钠）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Containing or involving two sodium atoms or sodium ions (Na⁺), often used in the names of salts.","zh":"（化学）含有两个钠原子或两个钠离子（Na⁺）的；常用于盐类名称中。"},"examples":[{"en":"Disodium phosphate is used as a food additive in some processed foods.","zh":"磷酸二钠在一些加工食品中用作食品添加剂。"},{"en":"The label lists disodium EDTA as a stabilizer.","zh":"标签上标明“乙二胺四乙酸二钠（disodium EDTA）”作为稳定剂。"}]}],"synonyms":["dinatrium"],"phonetic":"daɪˈsoʊdiəm","extraExplanation":["“disodium”常见于化学命名中，表示该化合物的阴离子（如 phosphate、carbonate、EDTA 等）与“两个钠离子”配对形成盐，因此会出现在成分表或化学品名称里（如 disodium phosphate）。","写法上更常见的是不加连字符的“disodium”。带连字符的“di-sodium”有时出现在非正式写法或排版中，但标准化学名称通常写作一个词。"]}
{"word":"di-spored","summary":{"en":"“Disposed” commonly means willing/inclined, or arranged/positioned; it’s also the past form of “dispose.”","zh":"disposed 常指“愿意/倾向于”，也可指“被布置/放置成某种方式”；同时它是 dispose 的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"willing or inclined to do something; having a particular attitude or mood.","zh":"愿意的；倾向于（做某事）的；带有某种心情或态度的。"},"examples":[{"en":"I’m not disposed to argue right now.","zh":"我现在不太想争论。"},{"en":"She was well disposed toward her new coworkers.","zh":"她对新同事很友好（抱有善意）。"}]},{"partOfSpeech":"adj.","definition":{"en":"arranged or positioned in a particular way.","zh":"以某种方式布置的；放置在某处的。"},"examples":[{"en":"The chairs were disposed in a circle.","zh":"椅子被围成一圈摆放。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “dispose”: to deal with, get rid of, or arrange something.","zh":"“dispose”的过去式/过去分词：处理；处置；（按某方式）安排。"},"examples":[{"en":"They disposed of the old files securely.","zh":"他们把旧文件安全地处理掉了。"},{"en":"The manager disposed tasks among the team members.","zh":"经理把任务分配给团队成员。"}]}],"synonyms":["inclined","willing","ready","arranged","positioned"],"phonetic":"/dɪˈspoʊzd/","extraExplanation":["“di-spored”不是常见英语单词；很多学习者其实是想写/听到的是 **disposed**（如 *disposed to…* 或 *disposed of…*）。","常见搭配：**disposed to + V**（倾向于做……），**disposed of + 名词**（处理/丢弃……），**well/ill disposed toward**（对……友好/不友好）。"]}
{"word":"di-substituted","summary":{"en":"“Di-substituted” describes a molecule that has two substituent groups attached.","zh":"“di-substituted”表示“二取代的”，即分子上连有两个取代基。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Having two substituent groups attached (replacing two hydrogen atoms or other groups) on a molecule, especially on a ring or a main carbon chain.","zh":"（化学）二取代的；指分子上有两个取代基（通常是两个氢原子或其他基团被取代），常用于描述环或主链上的取代情况。"},"examples":[{"en":"The reaction produced a di-substituted benzene as the major product.","zh":"该反应的主要产物是二取代苯。"},{"en":"Di-substituted alkenes can exist as cis/trans (E/Z) isomers.","zh":"二取代烯烃可能以顺反（E/Z）异构体形式存在。"}]}],"synonyms":["disubstituted","bis-substituted"],"phonetic":"/ˌdaɪ ˈsʌb.stəˌtuːtɪd/","extraExplanation":["“di-”表示“二、两个”；“substituted”指“被取代的”。合在一起常见于有机化学命名与机理讨论。","在芳香环（如苯）上，“di-substituted”常进一步说明取代位置关系：ortho-（邻位，1,2-）、meta-（间位，1,3-）、para-（对位，1,4-）。","写作上常见拼写为“disubstituted”或“di-substituted”，两者通常等义；是否加连字符多取决于期刊/教材风格。"]}
{"word":"di-substitution","summary":{"en":"A chemistry term meaning the substitution of two atoms/groups in a molecule.","zh":"化学术语：指分子中两个原子/基团发生取代。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) The replacement of two atoms or groups in a molecule by other atoms or groups; the product or process is described as “disubstituted.”","zh":"（化学）在一个分子中有两个原子或基团被其他原子或基团取代的过程；也可指这种“二取代”的产物或结果。"},"examples":[{"en":"Di-substitution on the benzene ring can give ortho, meta, or para isomers.","zh":"苯环发生二取代时，可能得到邻位、间位或对位异构体。"},{"en":"The reaction conditions favored di-substitution rather than mono-substitution.","zh":"反应条件更有利于二取代，而不是单取代。"}]}],"synonyms":["disubstitution","double substitution"],"phonetic":"/ˌdaɪ ˌsʌbstəˈtuːʃən/","extraExplanation":["“di-”是前缀，表示“二、两个”。因此 di-substitution 常见于有机化学语境，强调“发生了两处取代”。在芳香族化合物（如苯）里，二取代常与定位效应相关，常见的描述是邻（ortho）、间（meta）、对（para）。","写法上也常见不加连字符的 disubstitution / di substitution。不同教材或论文可能用法略有差异，但核心含义一致。"]}
{"word":"di-tertiary","summary":{"en":"“Di-tertiary” is a chemistry term meaning a molecule has two tertiary (tert-) groups or two tertiary centers.","zh":"“Di-tertiary”是化学用语，表示分子里有两个三级（叔）基团或两个三级中心。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Having two tertiary groups or two tertiary substituents in one molecule (often written as “di-tert-” or “ditert-”).","zh":"（化学）指一个分子中含有两个三级（tertiary）基团/取代基（常写作“di-tert-”或“ditert-”）。"},"examples":[{"en":"Di-tert-butyl ether is a solvent used in some organic reactions.","zh":"二叔丁基醚是一种在某些有机反应中使用的溶剂。"},{"en":"The compound has a di-tertiary structure, with two tertiary carbon centers.","zh":"这个化合物具有二级数（di-tertiary）的结构，含有两个三级碳中心。"}]}],"synonyms":["ditertiary","di-tert-","di-tert-butyl (as a common pattern)"],"phonetic":"/ˌdaɪ ˈtɝːʃiˌɛri/","extraExplanation":["在有机化学里，tertiary（三级）常指“与三个碳原子相连的碳中心”（例如叔丁基 tert-butyl）。di- 表示“两个”。因此 di-tertiary 多用于描述“有两个叔/三级中心或两个叔基”的结构特征。","写法上更常见的是把具体基团写出来：di-tert-butyl（二叔丁基）、di-tert-amyl（二叔戊基）等；有时也会连字符写作 di-tertiary。"]}

