{"word":"DID","summary":{"en":"“Did” is the past tense of “do.” It’s commonly used as an auxiliary for questions/negatives or for emphasis, and it can also mean “performed/did an action.”","zh":"“did”是“do”的过去式。最常见作助动词，用于疑问、否定或强调；也可作实义动词，表示“做了某事/完成任务”。"},"definitions":[{"partOfSpeech":"aux.","definition":{"en":"past tense of “do,” used as an auxiliary verb to form questions and negatives, and to add emphasis","zh":"“do”的过去式（助动词）：用于构成疑问句和否定句，也可用于强调"},"examples":[{"en":"Did you finish your homework?","zh":"你做完作业了吗？"},{"en":"I didn’t see him yesterday.","zh":"我昨天没见到他。"},{"en":"I did tell you to be careful.","zh":"我确实告诉过你要小心。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense of “do,” meaning to perform an action or complete a task","zh":"“do”的过去式（实义动词）：表示做某事、完成某项任务"},"examples":[{"en":"She did her best on the test.","zh":"她在考试中尽了最大努力。"},{"en":"We did the dishes after dinner.","zh":"晚饭后我们洗了碗。"}]}],"synonyms":["performed","completed","carried out"],"phonetic":"/dɪd/","extraExplanation":["“did”作助动词时，后面的动词要用原形：Did you go?（不是 Did you went?）；否定是 did not / didn’t + 动词原形。","在简短回答里常用：Yes, I did. / No, I didn’t.","用“did”强调时通常出现在肯定句里：I did call you.（表示“我真的打过给你/确实打过”）。"]}
{"word":"did","summary":{"en":"“Did” is the past form of “do,” often used to make past questions/negatives or to add emphasis; it can also mean “performed.”","zh":"“did”是“do”的过去式，常作助动词构成过去时疑问/否定或表示强调；也可表示“做了、完成了”。"},"definitions":[{"partOfSpeech":"aux.","definition":{"en":"past tense of “do”; used as an auxiliary verb to form questions, negatives, and emphasis in the past","zh":"“do”的过去式；作助动词，用于构成过去时的疑问句、否定句和强调"},"examples":[{"en":"Did you call her yesterday?","zh":"你昨天给她打电话了吗？"},{"en":"I didn’t see him at the party.","zh":"我在派对上没看到他。"},{"en":"I did finish my homework (even if it doesn’t look like it).","zh":"我确实做完作业了（即使看起来不像）。"}]},{"partOfSpeech":"vt.","definition":{"en":"past tense of “do”; performed or carried out an action","zh":"“do”的过去式；做了（某事），完成了某个动作"},"examples":[{"en":"She did the dishes after dinner.","zh":"晚饭后她洗了碗。"},{"en":"They did a great job on the project.","zh":"他们把这个项目做得很棒。"}]}],"synonyms":["performed","carried out"],"phonetic":"/dɪd/","extraExplanation":["英语里常用“do/does/did”来辅助构成句子（do-support）。一般规则是：疑问句用“Did + 主语 + 动词原形…?”；否定句用“didn’t + 动词原形”。例如：Did you go? / I didn’t go.","“did”用于强调时，意思接近“的确/真的”。结构是“did + 动词原形”，例如：I did try."]}
{"word":"Didache","summary":{"en":"The Didache is an early Christian guide known as “The Teaching of the Twelve Apostles.”","zh":"Didache 指早期基督教文献《十二使徒遗训》（《十二使徒教训》）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an early Christian work (late 1st–early 2nd century) called “The Teaching of the Twelve Apostles,” giving practical instruction on Christian morals, worship (like baptism and the Eucharist), and church life","zh":"《十二使徒遗训》（约公元1世纪末至2世纪初的早期基督教文献），内容多为基督徒的道德生活、礼仪（如洗礼、圣餐）与教会管理等实用教导"},"examples":[{"en":"In the Didache, readers find guidance on baptism, prayer, and community discipline.","zh":"在《十二使徒遗训》中，读者可以找到关于洗礼、祷告和团体纪律的指导。"},{"en":"Some scholars compare the Didache with the New Testament to understand early Christian practice.","zh":"一些学者会把《十二使徒遗训》和《新约》对照研究，以了解早期基督徒的实践。"}]}],"synonyms":["Teaching of the Twelve Apostles","The Didache"],"phonetic":"/ˈdɪdəki/","extraExplanation":["“Didache”源自希腊语 didachē，意思是“教导/训诲”。在中文学术语境中常译为《十二使徒遗训》或《十二使徒教训》。","它以“二道”（生命之道与死亡之道）的伦理教导开篇，并包含早期教会对巡回传道者、先知等的接待规范，因此常被用来研究初代教会的礼仪与组织形态。","它不属于《圣经》正典，但在基督教历史研究中很重要，常被归入“使徒教父文献”（Apostolic Fathers）。"]}
{"word":"didache","summary":{"en":"The Didache is an early Christian instruction manual on belief and practice, often called “The Teaching of the Twelve Apostles.”","zh":"Didache（《十二使徒遗训》）是一部早期基督教的实践性教导文献，常被称为《十二使徒的教导》。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an early Christian text (often dated to the late 1st or early 2nd century) that gives practical instruction on Christian teaching, ethics, worship, and church organization; its full title is often translated as “The Teaching of the Twelve Apostles.”","zh":"《十二使徒遗训》（常被认为写于公元1世纪末至2世纪初）：一部早期基督教文献，提供关于教义、伦理、礼拜与教会组织的实践性指导。"},"examples":[{"en":"In a church history class, we read the Didache alongside other early Christian writings.","zh":"在教会历史课上，我们把《十二使徒遗训》和其他早期基督教著作一起阅读。"},{"en":"The Didache describes early practices such as baptism, fasting, and the Eucharist.","zh":"《十二使徒遗训》描述了洗礼、禁食与圣餐等早期实践。"}]}],"synonyms":["The Teaching of the Twelve Apostles","Didachē"],"phonetic":"/ˈdɪdəkeɪ/","extraExplanation":["“Didache”来自希腊语 Διδαχή（didachē），意思是“教导/训诲”。英语里常按音译读作“DID-uh-kay”。","它不是《新约》正典的一部分，但在研究早期基督教生活、礼仪与教会秩序时非常重要，常与“使徒教父”（Apostolic Fathers）的作品并读。","文本里著名的一段是“二道”（Two Ways）传统：生命之道与死亡之道，用来概述道德行为的选择。"]}
{"word":"Didachist","summary":{"en":"A didachist is someone—often a writer or speaker—who tries to teach lessons, sometimes in an overly preachy way.","zh":"didachist 指试图教人道理的人（常指作家或演说者），有时带“过于说教、爱训人”的意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who teaches, especially in a way that feels overly moralizing or preachy","zh":"说教者；（尤指）爱以道德训诫方式教导他人的人"},"examples":[{"en":"Some critics call him a didachist because his speeches sound more like sermons than debates.","zh":"一些评论家称他为说教者，因为他的演讲听起来更像布道而不是辩论。"},{"en":"She didn’t want to be a didachist; she wanted students to discover ideas for themselves.","zh":"她不想当一个说教者；她希望学生自己去发现观点。"}]},{"partOfSpeech":"n.","definition":{"en":"a writer, artist, or speaker whose work is created mainly to teach a lesson (often about morals)","zh":"（以作品）旨在传达教训的作家/艺术家/演说者（常带道德寓意）"},"examples":[{"en":"The novel is moving, but it sometimes slips into didachist writing.","zh":"这部小说很感人，但有时会滑向说教式写作。"},{"en":"As a didachist, he used stories to warn readers about greed and pride.","zh":"作为一名以教化为目的的作者，他用故事来警示读者贪婪与傲慢。"}]}],"synonyms":["moralizer","preacher","instructor","teacher","pedagogue","lecturer"],"phonetic":"ˈdɪdəˌkɪst","extraExplanation":["“didachist”源自希腊语词根，和“teach（教）”相关。现代英语里它常带一点负面评价：不是单纯“会教”，而是“太爱教训人/太说教”。在评论文学、电影、演讲时也常用来批评作品“过度讲道理”。与之相关的常见词是“didactic（说教的）”。"]}
{"word":"didachist","summary":{"en":"Didachist means a teacher or someone (especially a writer/speaker) whose main purpose is to instruct, sometimes with a moralizing tone.","zh":"didachist 指“教师/教导者”，也可指以教化为主要目的的作者或演讲者（有时略带说教意味）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a teacher; an instructor (often used in a formal or literary way)","zh":"教师；教导者（常见于较正式或文学语境）"},"examples":[{"en":"In the monastery, the didachist trained new members in reading and chant.","zh":"在修道院里，这位教导者训练新成员识字并学习圣歌。"},{"en":"She was known as a patient didachist who explained difficult ideas in simple words.","zh":"她以耐心的教导者而闻名，能用简单的话解释复杂的概念。"}]},{"partOfSpeech":"n.","definition":{"en":"a writer or speaker whose main aim is to teach or instruct (sometimes suggesting a moralizing tone)","zh":"以教化为主要目的的作者或演讲者（有时带有说教意味）"},"examples":[{"en":"Critics called him a didachist because every story ended with a lesson.","zh":"评论家称他为“教化型作者”，因为他的每个故事最后都会落到一个教训上。"},{"en":"The poem feels less like entertainment and more like a didachist’s lecture.","zh":"这首诗读起来不像娱乐，更像教化者的讲座。"}]}],"synonyms":["teacher","instructor","educator","tutor","pedagogue","moralist"],"phonetic":"/ˈdɪdəˌkɪst/","extraExplanation":["“didachist”来自希腊语词根，和“didactic（教诲的、寓教于乐但也可能显得说教的）”同源。它在现代英语里很少用于日常口语，更常见于文学评论、宗教/历史语境或较正式的写作中。","语气提示：如果你想中性地说“老师”，更常用 teacher / instructor / educator；如果想表达“有点说教”，可以用 didactic（形容风格）或 moralizing。"]}
{"word":"Didachographer","summary":{"en":"A didachographer is a writer whose work aims to teach or instruct, often with clear moral or educational lessons.","zh":"didachographer 指以教导、劝诫或教育为主要目的进行写作的人，作品常带明显的道德或教学意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who writes didactic (instructional or teaching) works; a writer of moral or educational instruction.","zh":"写作“教诲/教学性”作品的人；以道德或教育指导为目的的作者。"},"examples":[{"en":"The critic called him a didachographer because every story ended with a clear moral lesson.","zh":"评论家称他为 didachographer，因为他的每个故事结尾都有明确的道德教训。"},{"en":"In the classroom, the teacher compared the novelist to a didachographer—more interested in teaching than entertaining.","zh":"在课堂上，老师把这位小说家比作 didachographer——更关注“教”而不是“逗乐”。"}]}],"synonyms":["didactic writer","moralist","instructional author"],"phonetic":"/ˌdɪdəˈkɑɡrəfɚ/","extraExplanation":["这个词很少见，通常出现在文学评论或学术写作中，用来强调“写作目的在于教导”。\n\n词源上可拆解为：希腊语 didachē（教学、教义）+ -grapher（写作者）。因此它的含义接近“写教诲性文章的人”。\n\n使用时语气可能带一点评价色彩：有时是中性（强调教育意义），有时略带批评（觉得作品说教、缺少艺术性）。"]}
{"word":"didact","summary":{"en":"Didact means a teacher or instructor (rare, formal).","zh":"Didact 指“教师/讲师”，属于少见且偏正式的用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a teacher; an instructor (rare, formal).","zh":"教师；讲师（较少见、偏正式用法）。"},"examples":[{"en":"In the novel, the old monk is portrayed as a didact guiding young students.","zh":"在小说中，那位老僧被描写成一位指导年轻学生的导师。"},{"en":"She worked as a didact in an adult-education program.","zh":"她在成人教育项目中担任讲师。"}]}],"synonyms":["teacher","instructor","educator","tutor","mentor"],"phonetic":"/ˈdaɪdækt/","extraExplanation":["“didact”在现代英语里非常少见，更常用的是“teacher / instructor / educator”。如果你想表达“说教的、教导意味很强的”，通常用形容词“didactic”。","词源来自希腊语词根“didakt-”（与“teach/teaching”有关）。在文学或学术语境中偶尔会用“didact”来营造古典、正式的语气。"]}
{"word":"didactic","summary":{"en":"“Didactic” describes something meant to teach—often sounding moralizing or preachy.","zh":"“didactic”指旨在教导的，但常带“说教、训诫”意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Intended to teach, especially in a way that gives a clear moral lesson or tries to instruct people what to think or do (often used critically).","zh":"说教的；旨在教导的（尤指带有明确道德训诫或试图指导别人该怎么想/怎么做，常含贬义）"},"examples":[{"en":"The film is moving, but it can feel a bit didactic at times.","zh":"这部电影很感人，但有时候会显得有点说教。"},{"en":"Her stories are entertaining without being didactic.","zh":"她的故事很有趣，又不会显得在说教。"},{"en":"The teacher chose a didactic approach to explain the grammar clearly.","zh":"老师采用了讲授式（偏教学型）的方式把语法讲清楚。"}]}],"synonyms":["instructional","educational","preachy","moralistic"],"phonetic":"/daɪˈdæk.tɪk/","extraExplanation":["“didactic”来自希腊语词根，意为“教导”。在英语里，它既可以是中性（强调教学性、讲解清楚），也常带批评意味（太爱讲道理、把观点强塞给读者/观众）。在谈文学、电影、艺术时，若说作品“didactic”，往往暗示它更像在上课或劝诫，艺术性/自然表达被削弱。","常见搭配：didactic tone（说教的语气）、didactic writing/novel（说教式写作/小说）、overly didactic（过于说教）。相关词对比：instructional（教学/指导性的，更中性）、preachy（爱说教的，语气更口语、更负面）、moralistic（道德说教的，强调道德评判）。"]}
{"word":"didactical","summary":{"en":"Didactical means intended to teach or instruct; it can also suggest an overly moralizing, preachy style.","zh":"didactical 表示“用于教学/启发”的；也可指“过于说教、训诫式”的风格。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of writing, speech, art, or teaching) intended to teach a lesson or give instruction, sometimes in a way that feels too moralizing or “preachy.”","zh":"（指文章、演讲、艺术作品或教学）旨在传授道理或进行教导；有时带有说教、道德训诫味。"},"examples":[{"en":"The novel is entertaining, but some readers find it too didactical.","zh":"这本小说很有趣，但有些读者觉得它太说教了。"},{"en":"He tries to avoid a didactical tone when discussing sensitive topics.","zh":"谈到敏感话题时，他尽量避免用说教的语气。"}]}],"synonyms":["didactic","instructional","educational","pedagogical","preachy"],"phonetic":"/daɪˈdæk.tɪ.kəl/","extraExplanation":["“didactical”与“didactic”意思几乎相同；现代英语里更常用的是“didactic”。在语气上，两者都可能是中性（强调“有教育意义”），也可能带一点贬义（强调“爱说教/居高临下”），具体取决于语境。","词源与希腊语有关，核心含义是“教、指导”。因此在学术写作或课程设计里，didactic/didactical 往往是中性词；但在文学评论中更容易被理解为“说教”。"]}
{"word":"didacticality","summary":{"en":"“Didacticality” means the quality of trying to teach or instruct, sometimes in a preachy way.","zh":"“Didacticality”指“教导/说教的特质”，有时带“过度说教”的负面意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being didactic; an intention to teach or instruct (sometimes in an overly moralizing or “preachy” way)","zh":"“说教性；教诲性”：以教导、传授知识为目的的特质（有时带有过度说教、居高临下的负面意味）"},"examples":[{"en":"Some readers enjoy the didacticality of the novel because it clearly explains the history behind the story.","zh":"有些读者喜欢这部小说的说教性，因为它把故事背后的历史讲得很清楚。"},{"en":"The film’s didacticality turned some viewers off; they felt it was preaching instead of storytelling.","zh":"这部电影的说教性让一些观众反感；他们觉得它是在布道而不是在讲故事。"},{"en":"Teachers can balance didacticality with discussion so students learn actively, not just by listening.","zh":"老师可以在说教性讲授和讨论之间取得平衡，让学生主动学习，而不只是听讲。"}]}],"synonyms":["didacticism","instructional quality","pedagogical tone","moralizing"],"phonetic":"/ˌdaɪdækˈtækəlɪti/","extraExplanation":["“didacticality”比“didactic”更少见、更偏学术写法，常用于评论文学、电影、教材或演讲的“教学/说教倾向”。","语气上既可能是中性（强调清晰、有教学价值），也可能是负面（暗示生硬、道德评判强、像在讲大道理）。在写作中更常用的表达是“a didactic tone/style（说教的语气/风格）”。"]}
{"word":"didactically","summary":{"en":"“Didactically” means “in a teaching/instructive (sometimes preachy) way.”","zh":"“didactically”表示“以教导/讲解（有时带说教感）的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is intended to teach or instruct, often with a strong focus on giving lessons or moral guidance.","zh":"以教导的方式；（常指）以说教、教育意义为主的方式。"},"examples":[{"en":"The article is written didactically, explaining each step of the experiment.","zh":"这篇文章用一种很“教学式”的写法，解释了实验的每一个步骤。"},{"en":"Some readers feel the novel is too didactic, because it keeps telling you what to think.","zh":"有些读者觉得这部小说太说教了，因为它不断告诉你该怎么想。"}]}],"synonyms":["instructively","pedagogically","teachily","preachily (often negative)"],"phonetic":"/daɪˈdæk.tɪ.kli/","extraExplanation":["“didactically”来自形容词 didactic（教导的、说教的）。在英语里，didactic 既可以是中性（偏“教学清晰、用于讲解”），也常带一点负面评价（偏“太爱讲道理、说教感重”），要看语境。","常见搭配：didactically written（以教学式写成）、didactically structured（以教学目的来组织）、didactically inclined（倾向于说教/爱教育人）。","相关词：teachingly（较少见，更偏“像老师一样地”）、instructionally（更中性偏“用于教学/说明”）、preachily（更偏负面“像布道一样说教”。）"]}
{"word":"didactician","summary":{"en":"A didactician is someone skilled at teaching; sometimes it suggests an overly preachy, lesson-giving style.","zh":"didactician 指擅长教学的人；有时也可指过于说教、爱“讲道理”的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who is skilled at teaching or training others; someone who thinks carefully about how to explain ideas.","zh":"擅长教学或培训他人的人；善于思考如何清楚解释知识的人。"},"examples":[{"en":"As a didactician, she can explain complex ideas in simple language.","zh":"作为一名教学能手，她能用简单的语言解释复杂的概念。"},{"en":"The workshop was led by an experienced didactician who focused on practical classroom methods.","zh":"这场工作坊由一位经验丰富的教学专家主持，重点讲实用的课堂方法。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who teaches in a way that feels too moralizing or too focused on giving lessons (often slightly negative).","zh":"教学或说教方式过于“讲道理”、太爱灌输教训的人（常带轻微贬义）。"},"examples":[{"en":"Some readers found the narrator a bit of a didactician, always telling them what to think.","zh":"有些读者觉得叙述者有点爱说教，总在告诉他们该怎么想。"},{"en":"He doesn’t mean to be a didactician, but his advice can sound preachy.","zh":"他并非有意说教，但他的建议听起来可能有点“端着讲”。"}]}],"synonyms":["educator","teacher","instructor","pedagogue","trainer"],"phonetic":"/ˌdaɪdækˈtɪʃən/","extraExplanation":["词源上与 didactic（“教诲性的、旨在教学的”）同源，来自希腊语词根，和“教学、指导”有关。","在文学评论里，如果说某个作者/叙述者很 didactic，常暗示作品“教育意味强、像在讲道理”；didactician 也可能带出这种评价色彩，语境决定褒贬。"]}
{"word":"didacticism","summary":{"en":"Didacticism is the tendency to teach a moral lesson in a way that can feel overly obvious or preachy, especially in literature or art.","zh":"Didacticism 指（作品或言论中）偏向教训、说教的倾向，常含“过于直白、让人觉得被教育”的意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The practice of teaching a moral lesson, especially in a way that feels too obvious or preachy in art, writing, or speech.","zh":"说教倾向；教训意味（尤指在艺术、写作或讲话中过于直白、带“教育你”的味道）。"},"examples":[{"en":"Some readers felt the novel’s message was strong, but the didacticism made the characters feel less real.","zh":"有些读者觉得小说的主题很有力，但过强的说教让人物显得不够真实。"},{"en":"Good children’s books can teach values without heavy didacticism.","zh":"好的儿童读物可以传递价值观，但不必有很重的说教味。"}]}],"synonyms":["moralizing","preachiness","sermonizing","didactic tone"],"phonetic":"/daɪˈdæk.tɪˌsɪz.əm/","extraExplanation":["“Didacticism”来自形容词 didactic（意为“用于教学的/教导的”），但在文学与艺术评论中常带一点负面色彩：不是反对“有教育意义”，而是反对“讲道理太直白、压过了故事/艺术本身”。","常见搭配：heavy/excessive didacticism（过度说教）、avoid didacticism（避免说教）、a touch of didacticism（一点说教味）。","近义辨析：moralizing 更强调“道德评判/说教别人”；preachiness 更口语、更强调“像布道一样令人反感”；didacticism 更常见于对作品（小说、电影、戏剧、诗歌）的批评语境。","文学语境提示：许多寓言（fables）与寓意故事（allegories）本就带有教学目的，但优秀作品往往用情节与形象“展示”道理，而不是直接“讲”出来，从而减少 didacticism。"]}
{"word":"didacticity","summary":{"en":"Didacticity means the quality of being overly teaching or moralizing, often in a preachy way.","zh":"Didacticity 指“说教性/教诲倾向”，常带“过于讲道理、像在训诫”的感觉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being didactic; a tendency to teach, instruct, or give moral lessons (often in a way that feels too obvious or preachy)","zh":"说教性；教诲倾向（常指过于直白、带“讲道理/灌输”味道）"},"examples":[{"en":"Some readers disliked the novel’s didacticity and wanted more subtle storytelling.","zh":"一些读者不喜欢这部小说的说教性，更想要含蓄一点的叙事。"},{"en":"The teacher tried to reduce the didacticity of the lesson by adding games and discussion.","zh":"老师通过加入游戏和讨论，尽量降低这节课的说教感。"},{"en":"Her speech had warmth, but its didacticity made it feel like a lecture.","zh":"她的演讲很真诚，但说教性让人感觉像在听讲课。"}]}],"synonyms":["moralizing","preachiness","instructional tone","pedagogical tone"],"phonetic":"/ˌdaɪdækˈtɪsɪti/","extraExplanation":["“didacticity”来自形容词“didactic（说教的/教学的）”。在艺术、文学和电影评论里，这个词常带一点负面评价：意思是作品太想“教你该怎么想/怎么做”，而不是让你自己体会。","和“educational（有教育意义的）”不同：educational通常偏中性或褒义；didacticity更强调“道德训诫”“灌输观点”的味道。"]}
{"word":"didactics","summary":{"en":"Didactics means the methods and principles of teaching and learning.","zh":"Didactics 指“教学法/教学原理与方法”，多用于正式或学术语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The science or art of teaching; methods and principles used to help people learn.","zh":"教学法；教学原理与方法（帮助学习者学习的原则与技巧）。"},"examples":[{"en":"The course introduces modern didactics for teaching English to beginners.","zh":"这门课介绍面向初学者的现代英语教学法。"},{"en":"Good didactics can make complex ideas easier to understand.","zh":"好的教学法能让复杂的概念更容易理解。"}]}],"synonyms":["teaching methods","pedagogy","instructional methods"],"phonetic":"/daɪˈdæk.tɪks/","extraExplanation":["“Didactics”通常作为不可数名词使用，尤其在学术语境中（如教育学、师范课程）。","在英语里“didactic”是形容词，意思既可以是“教学的”（中性/正式），也常带有“说教的、爱教训人的”（略贬义）的语气；而“didactics”本身多为中性学术用语。","词源来自希腊语，意为“教导/教学”；在欧洲大陆的教育研究中，“didactics”常指“教学论/学科教学法”。"]}
{"word":"didactive","summary":{"en":"Didactic means “meant to teach,” often with a slightly preachy or moralizing tone.","zh":"Didactic 表示“以教学为目的”，常带一点“说教、爱讲道理”的语气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"intended to teach, especially in a way that gives a clear lesson or moral","zh":"旨在教学的；（尤指）带有说教意味的"},"examples":[{"en":"The novel is entertaining, but it also has a didactic message about kindness.","zh":"这本小说很有趣，但也带有关于善良的说教信息。"},{"en":"Some people find the film too didactic, as if it’s lecturing the audience.","zh":"有些人觉得这部电影太说教了，好像在训话观众。"}]}],"synonyms":["instructive","educational","moralistic","preachy"],"phonetic":"/daɪˈdæk.tɪk/","extraExplanation":["你输入的“didactive”通常是拼写错误，正确拼写是 didactic。","didactic 常用来形容书、电影、演讲、艺术作品“以教育为目的”，语气可能偏“说教/教训人”。因此在评价作品时，有时带一点负面含义（太爱讲道理）。"]}
{"word":"didacts","summary":{"en":"“Didacts” usually means the plural of “didact”: people who teach or who tend to lecture others in a (sometimes annoying) moralizing way.","zh":"“didacts”通常是“didact”的复数：指教导者，尤指爱说教、喜欢对别人讲道理的人（有时带点让人反感的语气）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who teaches, especially someone who tends to lecture others in a way that can feel too instructive or moralizing","zh":"教导者；（尤指）爱说教的人（可能带有“过度教育/说教”的感觉）"},"examples":[{"en":"Some people find him helpful; others think he’s a didact who talks down to everyone.","zh":"有人觉得他很有帮助；也有人觉得他爱说教，讲话总是居高临下。"},{"en":"The novel’s narrator isn’t a neutral observer—he’s a didact with strong opinions.","zh":"这部小说的叙述者并非中立旁观者——他像个爱说教的人，观点很强烈。"}]},{"partOfSpeech":"n.","definition":{"en":"the plural form of “didact” (more than one didact)","zh":"“didact”的复数形式（不止一个教导者/爱说教的人）"},"examples":[{"en":"The meeting was full of didacts, so it felt more like a lecture than a discussion.","zh":"会议里全是爱说教的人，所以更像在听课而不是讨论。"}]}],"synonyms":["teacher","educator","instructor","pedant","moralizer"],"phonetic":"/ˈdaɪdækt/","extraExplanation":["“didact”来自希腊语词根，和“teach（教）”有关。现代英语里它常带一点负面语气：不是单纯“老师”，而是“喜欢教育别人、爱讲道理的人”。如果你想表达更中性的“教育者/教师”，更常用 educator 或 teacher。","相关形容词：didactic（说教的、教诲性的）。在文学评论里，didactic 常用来形容作品“目的在于教导读者”，不一定是贬义，但在日常对话中可能显得“太说教”。"]}
{"word":"didactyl","summary":{"en":"Didactyl means “having two functional fingers or toes,” often used in paleontology and anatomy.","zh":"Didactyl 意为“具有两根功能性手指或脚趾”，多用于古生物学和解剖学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"A didactyl is a prehistoric animal (especially some dinosaurs or birds) that has two functional digits (fingers/toes) on each hand or foot.","zh":"didactyl 指一种史前动物（尤指某些恐龙或鸟类）每只手或脚只有两根功能性的指（趾）。"},"examples":[{"en":"Some theropod dinosaurs are described as didactyl because only two fingers were fully functional.","zh":"一些兽脚类恐龙被描述为 didactyl，因为只有两根手指是完全可用的。"},{"en":"The fossil shows a didactyl foot structure adapted for running.","zh":"这块化石显示出适合奔跑的两趾型（didactyl）足部结构。"}]},{"partOfSpeech":"n.","definition":{"en":"A didactyl animal; an organism with two functional digits on each limb.","zh":"两指（趾）动物；指每个肢体只有两根功能性指（趾）的生物。"},"examples":[{"en":"Researchers compared the didactyl with three-toed species to study evolution of digits.","zh":"研究人员将两趾型动物（didactyl）与三趾物种进行比较，以研究趾的演化。"}]}],"synonyms":["two-toed","two-fingered","bidactyl (less common)"],"phonetic":"/daɪˈdæk.təl/","extraExplanation":["词源提示：di- 表示“二”，-dactyl 来自希腊语 daktylos，意为“手指/脚趾”。在古生物学与动物学中常用来描述“指（趾）数量”的形态特征（类似的还有 tridactyl=三趾型，tetradactyl=四趾型）。","使用场景：该词偏学术，常见于化石描述、恐龙/鸟类解剖学文章中，日常英语里很少用。"]}
{"word":"didactylism","summary":{"en":"Didactylism means an instructional or moralizing tendency, especially in art or writing, often seen as too preachy.","zh":"Didactylism 指（尤在文学艺术中）带有强烈教育/说教目的的倾向，常带“过于说教”的评价。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the practice or tendency to teach a moral lesson or give instruction (especially in literature, art, or speeches), sometimes in a way that feels too obvious or preachy","zh":"（尤指文学、艺术或演讲中）带有强烈说教或教训意味的倾向；把作品当作教导他人的工具（有时会让人觉得过于直白、说教）"},"examples":[{"en":"Some readers dislike the novel’s didactylism, saying the message is too obvious.","zh":"一些读者不喜欢这部小说的说教倾向，觉得主题表达得太直白。"},{"en":"The film balances entertainment with didactylism by teaching history through a personal story.","zh":"这部电影通过一个个人故事来讲历史，在娱乐性与教育性之间取得了平衡。"},{"en":"His lectures were full of didactylism, always ending with a clear moral.","zh":"他的讲座充满说教意味，总会以一个明确的道德结论收尾。"}]}],"synonyms":["didacticism","moralizing","preaching","instructionalism"],"phonetic":"/daɪˈdæk.təˌlɪz.əm/","extraExplanation":["“didactylism”来源于“didactic”（教导性的）+ “-ism”（……主义/倾向）。在英语评论里，它常用于批评作品“太想教人”，让观众觉得被训诫，而不是自然地被故事打动。","近义词里，“didacticism”更常见；“didactylism”较少用，含义基本相同。写作或评论中更常搭配：heavy didactylism（说教味很重）、avoid didactylism（避免说教）。"]}
{"word":"didactylous","summary":{"en":"Didactylous means “two-fingered/two-toed,” used mainly in zoology and anatomy.","zh":"didactylous 指“二指/二趾的”，多用于动物学与解剖学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two fingers (or two toes); relating to a two-fingered/two-toed condition.","zh":"二指的；二趾的；指（或趾）只有两根的。"},"examples":[{"en":"The ostrich has a didactylous foot with two toes.","zh":"鸵鸟的脚是二趾型的，只有两根脚趾。"},{"en":"Scientists described the fossil as didactylous, which helped narrow down the animal group.","zh":"科学家把这块化石描述为二趾型，这有助于缩小动物所属类群的范围。"}]}],"synonyms":["two-toed","two-fingered"],"phonetic":"/ˌdaɪdækˈtɪləs/","extraExplanation":["这个词主要用于动物学/解剖学（尤其是鸟类与部分恐龙相关研究）。常见例子是鸵鸟（ostrich）属于“二趾型”，而大多数鸟类是三趾或四趾。词源上，di- 表示“二”，dactyl 来自希腊语 daktylos（指/趾）。"]}
{"word":"didal","summary":{"en":"“DIDAL” is not a standard English word; it’s likely a misspelling (often meant: “did all,” “digital,” or “didactic”).","zh":"“didal”不是标准英语词；多半是拼写/输入错误（常见可能是 did all、digital 或 didactic）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or typing error (common intended words: “did all,” “digital,” or “didactic”).","zh":"不是标准英语单词。很可能是拼写/输入错误（常见可能想写的是：did all、digital 或 didactic）。"},"examples":[{"en":"I couldn’t find “didal” in a standard English dictionary—did you mean “digital”?","zh":"我在常见英语词典里找不到“didal”——你是不是想写“digital（数字的）”？"},{"en":"If you meant “did all,” you can write: “She did all the work.”","zh":"如果你想表达“did all（全都做了）”，可以写：“She did all the work.（她把所有工作都做了。）”"}]}],"phonetic":"/ˈdaɪdəl/","extraExplanation":["“didal”本身在英语里不常见；如果这是人名/地名/缩写（acronym），通常需要具体语境才能确认含义。","你可以把原句发我（含前后文），我就能判断你真正想用的词，并给出准确释义与例句。"]}
{"word":"didapper","summary":{"en":"Dapper means neat, stylish, and well-dressed (often with a gentlemanly feel).","zh":"Dapper 指穿着整洁得体、时髦讲究（常带“绅士范儿”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a man or a style) neat, stylish, and well-dressed.","zh":"（多指男性或某种风格）整洁利落、时髦、穿着讲究的。"},"examples":[{"en":"He looked dapper in a dark suit and polished shoes.","zh":"他穿着深色西装、皮鞋擦得锃亮，看起来很精神很讲究。"},{"en":"She described her grandfather as a dapper gentleman who always wore a hat.","zh":"她形容外公是一位很讲究穿着的绅士，总是戴着帽子。"},{"en":"For the interview, try to look clean and dapper, not flashy.","zh":"面试时尽量看起来干净利落、得体，不要太花哨。"}]}],"synonyms":["smart","stylish","well-dressed","neat","sharp"],"phonetic":"/ˈdæpər/","extraExplanation":["你输入的“didapper”看起来像是拼写错误；常见单词是 **dapper**。","“dapper”常带有一种偏传统的“绅士感”，常用于描述男性（也可描述风格/打扮）。在现代语境里，它通常是褒义：得体、精神、会打扮。"]}
{"word":"didappers","summary":{"en":"Didapper is an archaic word mainly meaning a small diving bird such as the little grebe; more rarely it can mean a dipper (someone/thing that dips).","zh":"Didapper 是较古老的英语词，主要指会潜水的小型水鸟（尤指小䴙䴘）；较少情况下也可指“蘸取者/舀取器”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) a small diving water bird, especially the little grebe (also called a dabchick).","zh":"（古语）一种会潜水的小型水鸟，尤指小䴙䴘（little grebe），也叫 dabchick。"},"examples":[{"en":"In old poems, a didapper may be mentioned as a bird that vanishes underwater.","zh":"在一些古诗文里，didapper 常被写成会突然潜入水中的鸟。"},{"en":"The didapper dives quickly, then pops up far from where you last saw it.","zh":"didapper 会迅速潜水，然后在你以为它消失的远处又冒出来。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare/archaic) a person or thing that dips into water; a “dipper.”","zh":"（罕见/古语）把东西蘸入水中的人或物；“dipper（蘸取者/舀取器）”。"},"examples":[{"en":"He worked as a didapper, dipping cloth into dye again and again.","zh":"他做着 didapper 的活儿，一遍又一遍把布料蘸进染料里。"}]}],"synonyms":["little grebe","dabchick","dipper (rare sense)"],"phonetic":"ˈdɪˌdæpər","extraExplanation":["“didapper”多见于较早的英语（文学或方言语境），现代日常英语更常用“little grebe / dabchick”来指这种鸟。","这个词带有拟声和动作感：看起来像“dip + dapper”，让人联想到“轻快地一蘸一潜”的动作，因此常被用来描写鸟的潜水行为。"]}
{"word":"didascalar","summary":{"en":"Didascalar means “relating to stage directions in a play,” and more rarely “instructive or didactic.”","zh":"didascalar 指“与剧本舞台指示有关的”，较少用时也可指“教导性的/说教的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Literary/Theater) relating to stage directions, especially the written instructions in a play’s script about actions, settings, or how lines should be delivered.","zh":"（文学/戏剧）与舞台指示有关的，尤指剧本中关于动作、场景或台词表达方式的书面说明。"},"examples":[{"en":"The director highlighted the didascalar notes to clarify the mood of the scene.","zh":"导演强调了那些与舞台指示有关的注释，用来澄清这一场戏的氛围。"},{"en":"In some editions, the didascalar material is printed in italics.","zh":"在一些版本里，舞台指示相关的内容会用斜体印刷。"}]},{"partOfSpeech":"adj.","definition":{"en":"(More general, rare) intended to teach or instruct; didactic in tone.","zh":"（更一般、较少用）旨在教导或说明的；带有说教意味的。"},"examples":[{"en":"The essay takes a didascalar approach, explaining each step for beginners.","zh":"这篇文章采取了偏“教导式”的写法，为初学者解释每一步。"}]}],"synonyms":["didascalic","instructional","didactic"],"phonetic":"/ˌdɪdəˈskælər/","extraExplanation":["“didascalar”非常少见，常见的相关词是 **didascalic**（同义）以及名词 **didascalia**（舞台指示/舞台说明）。","词根来自希腊语 *didaskalos*（老师）与 *didaskein*（教导）。在戏剧语境里，它强调“写在文本里、用于指导表演/舞台呈现的说明”。"]}
{"word":"didascaliae","summary":{"en":"*Didascaliae* means the stage directions or notes in a play (plural of *didascalia*), especially in classical/Greek drama studies.","zh":"*didascaliae* 指戏剧脚本中的舞台说明或注释（*didascalia* 的复数），尤常见于古典/古希腊戏剧研究。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"stage directions or editorial notes in a play script (often in ancient Greek drama); the plural form of *didascalia*.","zh":"（戏剧脚本中的）舞台说明、导演提示或编者注释；为 *didascalia* 的复数形式，常见于古希腊戏剧语境。"},"examples":[{"en":"The translator kept the didascaliae in brackets to separate them from the dialogue.","zh":"译者把舞台说明用括号标出，以便与台词区分开来。"},{"en":"In Greek tragedy, didascaliae can tell us where characters enter, exit, or react silently.","zh":"在古希腊悲剧中，舞台说明可能会告诉我们人物何时上场、退场，或无声地做出反应。"}]}],"synonyms":["stage directions","directions","annotations","editorial notes","rubrics"],"phonetic":"/ˌdɪdəsˈkeɪliˌiː/","extraExplanation":["该词来自希腊语 *didascalia*（意为“教学、指导”），在戏剧研究中引申为“对表演的指导”。*didascaliae* 是复数形式，学术写作里有时也会把它当作一个集合概念来使用。","在现代英文里，更常见、更通用的说法是 *stage directions*（舞台说明）或 *editorial notes*（编者注）。看到 *didascaliae* 往往意味着文本偏学术、古典戏剧或手稿研究语境。"]}
{"word":"didascalic","summary":{"en":"Didascalic means “about stage directions” in drama, and more generally “overly instructive/directive.”","zh":"didascalic 指“与戏剧舞台说明有关的”，也可引申为“过于指点、带说教意味的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to stage directions or instructions in a play or script (how actors should move, speak, or what happens on stage).","zh":"与（戏剧/剧本中的）舞台提示、舞台说明有关的；指示演员动作、语气或场景安排的。"},"examples":[{"en":"The scene includes several didascalic notes like “(whispers)” and “(she exits).”","zh":"这一幕包含好几处舞台说明，比如“（低声）”和“（她退场）”。"},{"en":"Her acting followed the didascalic instructions carefully.","zh":"她的表演严格遵照了舞台提示。"}]},{"partOfSpeech":"adj.","definition":{"en":"In a broader sense, giving detailed instructions in an overly guiding or “directive” way (often used critically).","zh":"（引申）过于指点、像“指导手册”一样强行引导的（常带批评意味）。"},"examples":[{"en":"Some viewers found the narration too didascalic, explaining every emotion.","zh":"一些观众觉得旁白太“指点式”了，把每种情绪都解释得一清二楚。"},{"en":"The essay becomes didascalic when it tells readers exactly what to think.","zh":"当这篇文章直接告诉读者该怎么想时，就显得过于说教/指点了。"}]}],"synonyms":["instructional","directive","didactic","stage-directional"],"phonetic":"/ˌdaɪdəˈskælɪk/","extraExplanation":["“didascalic”常见于戏剧研究与文学批评。它来自希腊语词根，和“teaching/teaching-related（教学）”有关，所以除了“舞台说明的”这个专业义外，也会引申出“过度指导、带说教味”的评价。","在剧本里，舞台说明通常写在括号中或以斜体呈现，例如：(Pause.) (He sits.) 这些内容本身就很“didascalic”。"]}
{"word":"didascalos","summary":{"en":"Didascalos is a Greek-derived word meaning “teacher,” and in rare theater contexts, a trainer/director of performers.","zh":"Didascalos 源自希腊语，意为“老师”；在少见的戏剧语境中也可指训练演员的指导者/导演。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ancient Greece) a teacher or instructor; especially one who taught children, or a respected teacher of a subject.","zh":"（古希腊）教师、导师；尤指教导儿童的人，或受尊敬的学者/老师。"},"examples":[{"en":"In ancient Athens, a didascalos might teach boys reading, music, and basic arithmetic.","zh":"在古雅典，didascalos 可能教授男孩阅读、音乐和基础算术。"},{"en":"The dialogue presents Socrates as a didascalos guiding students through careful questioning.","zh":"这段对话把苏格拉底描写成一位通过追问来引导学生思考的 didascalos。"}]},{"partOfSpeech":"n.","definition":{"en":"(Theater, rare) a trainer or director who taught performers (such as a chorus) their parts.","zh":"（戏剧用语，较少见）训练者或导演；负责教演员（如歌队）排练与表演的人。"},"examples":[{"en":"The didascalos drilled the chorus until their entrances and exits were perfectly timed.","zh":"didascalos 训练歌队，直到他们的出入场都精准合拍。"},{"en":"In some accounts of Greek drama, the poet also served as didascalos for the production.","zh":"在一些关于希腊戏剧的记载中，诗人也会兼任该剧的 didascalos。"}]}],"synonyms":["teacher","instructor","tutor","educator","mentor"],"phonetic":"/ˌdɪdəˈskɑːləs/","extraExplanation":["这个词来自希腊语 διδάσκαλος（didáskalos，“老师、教导者”）。它与英语 didactic（“说教的/教学的”）同源，也与 didascalia（戏剧剧本中的“舞台指示/排演说明”）有亲缘关系。","在现代英语里，didascalos 属于学术或古典研究语境下的用词；日常表达更常用 teacher / instructor。"]}
{"word":"didascaly","summary":{"en":"Didascaly means the stage directions or explanatory notes in a play or script.","zh":"didascaly 指戏剧或剧本中的舞台说明/提示。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Stage directions or explanatory notes in a play or script (often describing actions, setting, tone, or how lines should be delivered).","zh":"（戏剧/剧本中的）舞台说明；场面调度说明（常描述动作、布景、语气或台词如何说）。"},"examples":[{"en":"The didascaly says the actor should whisper the line and avoid eye contact.","zh":"舞台说明写着演员要低声说这句台词，并避免眼神接触。"},{"en":"In modern scripts, didascaly can be very detailed about lighting and sound.","zh":"在现代剧本中，舞台说明可能会非常详细地写灯光和音效。"}]}],"synonyms":["stage directions","script directions","production notes"],"phonetic":"/ˌdɪdəsˈkæli/","extraExplanation":["“didascaly”比较少见，更常见的相关词是“didascalia”（复数 didascaliae）或直接说“stage directions（舞台说明）”。词源来自希腊语 didaskalia，和“teach/teaching（教导）”有关，含有“给出演示与指示”的意味。","在阅读剧本时，didascaly 通常用括号或斜体出现，用来帮助读者/演员理解场景与动作；它不是角色要说出的台词。"]}
{"word":"didd","summary":{"en":"“didd” is usually a misspelling of “did”; sometimes it appears as the acronym DIDD for an agency name.","zh":"“didd”通常是“did”的误拼；有时也会以缩写 DIDD 形式出现，指某些机构名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A common misspelling or playful/typed form of “did” (the past tense of “do”), meaning “performed” or used to form past-tense questions and negatives.","zh":"“did”的常见拼写错误或戏谑/打字形式；相当于“did”（do 的过去式），表示“做了”，也用于构成一般过去时的疑问句和否定句。"},"examples":[{"en":"I didd my homework. (Common misspelling; standard: “I did my homework.”)","zh":"I didd my homework.（常见拼写错误；标准写法：I did my homework.）"},{"en":"Did you call her? (Not “didd you…”)","zh":"Did you call her?（不要写成“didd you…”）"}]},{"partOfSpeech":"n.","definition":{"en":"An abbreviation (DIDD) used in some contexts for “Department of Intellectual and Developmental Disabilities,” a government agency name in some places.","zh":"在某些语境中，DIDD 可作缩写，表示“Department of Intellectual and Developmental Disabilities（智力与发育障碍事务部门/机构）”，常见于部分地区的政府机构名称。"},"examples":[{"en":"She works for the DIDD in Tennessee.","zh":"她在田纳西州的 DIDD（相关政府机构）工作。"}]}],"synonyms":["did (standard form)","performed","carried out"],"phonetic":"/dɪd/","extraExplanation":["“didd”本身不是标准英语单词。日常写作里几乎都应写作“did”。如果你是在社交媒体、聊天记录里看到“didd”，多半是打字错误或刻意的口语化拼写。","作为缩写时通常写成大写“DIDD”，是否指某个机构要看上下文（地区、文件、网页来源等）。"]}
{"word":"didder","summary":{"en":"“Didder” means to tremble or shiver; it can also mean a nervous shaky state (“in a didder”).","zh":"“didder”指发抖、颤抖；也可指紧张发颤的状态（如“in a didder”）。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to tremble or shiver (often from cold, fear, or nervousness); to shake slightly","zh":"（常因寒冷、害怕或紧张而）发抖；微微颤抖"},"examples":[{"en":"I was diddering in the wind because I forgot my jacket.","zh":"我忘了带外套，在风里冻得直发抖。"},{"en":"She diddered with nerves before speaking in front of the class.","zh":"她在全班面前发言前紧张得发抖。"}]},{"partOfSpeech":"n.","definition":{"en":"a nervous, shaky state (often in the phrase “in a didder”)","zh":"紧张发颤的状态（常见于短语“in a didder”）"},"examples":[{"en":"He was in a didder waiting for the interview to start.","zh":"他等着面试开始，紧张得发颤。"}]}],"synonyms":["shiver","tremble","quiver","shake"],"phonetic":"/ˈdɪdər/","extraExplanation":["“didder”多见于英式方言（尤其苏格兰、英格兰北部等地区），在标准美式英语里不常用。更常见、拼写更标准的近义词是“shiver”“tremble”。","它也常被误拼/误读为“dither”（犹豫不决，或紧张慌乱），两者意思不同：didder=发抖；dither=犹豫/慌乱。"]}
{"word":"diddered","summary":{"en":"“Diddered” is a dialect past form meaning “shivered/trembled.”","zh":"“diddered”是方言用法，意思是“发抖/打寒战”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(dialect) past tense/past participle of “didder”: trembled or shivered, especially from cold, fear, or excitement.","zh":"（方言）“didder”的过去式/过去分词：发抖、打寒战（多因寒冷、害怕或激动）。"},"examples":[{"en":"I diddered in my wet clothes while I waited for the bus.","zh":"我穿着湿衣服等公交时冷得直发抖。"},{"en":"Her voice diddered when she heard the bad news.","zh":"她听到坏消息时声音都在发颤。"}]}],"synonyms":["shivered","trembled","quivered","shook"],"phonetic":"/ˈdɪdərd/","extraExplanation":["“didder / diddered”在现代英语里比较少见，更多见于苏格兰或英格兰北部等地区的方言，用来表示“发抖、打寒战”。在更常见的标准英语中，人们通常说“shiver”或“tremble”。","它也常被误拼或误读为“dithered”（犹豫不决、手忙脚乱地乱动）。如果你的语境是“拿不定主意”，可能想写的是“dithered”。"]}
{"word":"diddering","summary":{"en":"“Diddering” means shaking or shivering (often from cold or nerves), and it’s an informal regional word.","zh":"“diddering”指“发抖/打寒战”（常因寒冷或紧张），属于非正式的地区性用词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"trembling or shivering, usually from cold, fear, or nervousness (chiefly Scottish/Irish English; informal).","zh":"发抖的；打寒战的（多见于苏格兰/爱尔兰英语；非正式）。"},"examples":[{"en":"He came in diddering after waiting in the cold rain.","zh":"他在冷雨里等了很久，进来时浑身发抖。"},{"en":"She was diddering with nerves before the interview.","zh":"面试前她紧张得直发抖。"}]},{"partOfSpeech":"v.","definition":{"en":"the present participle of “didder”: to tremble or shiver.","zh":"“didder”的现在分词：发抖；打寒战。"},"examples":[{"en":"Stop diddering and put on a jacket.","zh":"别再哆嗦了，穿上外套。"},{"en":"The little dog was diddering by the door.","zh":"小狗在门边瑟瑟发抖。"}]}],"synonyms":["shivering","trembling","quivering","shaking"],"phonetic":"/ˈdɪdərɪŋ/","extraExplanation":["“didder / diddering”在现代标准英语里不算常见，更偏英伦方言（尤其苏格兰用法）。在更通用的英语中，你更常看到“shiver”“tremble”，或拼写相近但意思不同的“dither”（犹豫不决）。","如果你原本想写的是“dithering”（犹豫、优柔寡断），告诉我语境我可以帮你确认。"]}
{"word":"diddest","summary":{"en":"“Diddest” is an archaic form meaning “did you,” used with “thou.”","zh":"“diddest”是古语形式，约等于“did you”，常与“thou”搭配。"},"definitions":[{"partOfSpeech":"aux.","definition":{"en":"(Archaic) second-person singular simple past of “do,” used with “thou” (meaning “you”). In modern English, it’s usually replaced by “did you” or just “did.”","zh":"（古语）“do”的第二人称单数过去式，常与“thou”（你）连用。现代英语通常用“did you”或直接用“did”代替。"},"examples":[{"en":"Why diddest thou leave so soon?","zh":"你为何这么快就离开？"},{"en":"Thou diddest promise to return before nightfall.","zh":"你曾答应在夜幕降临前回来。"},{"en":"What diddest thou mean by those words?","zh":"你那番话是什么意思？"}]}],"synonyms":["didst","did you"],"phonetic":"/ˈdɪdɪst/","extraExplanation":["“diddest”是早期现代英语（如莎士比亚时代）里常见的拼写/形式之一，更常见的写法是“didst”。它对应“thou + didst/diddest”。","词尾“-st / -est”是古英语/早期现代英语里第二人称单数动词词尾（如“thou art / thou hast / thou dost”）。现代英语里“thou”体系基本消失，因此这些形式多出现在文学、戏剧、圣经风格或仿古写作中。"]}
{"word":"diddies","summary":{"en":"“Diddies” usually means short simple tunes/jingles or (in some UK regional speech) small little things; it can also be a vulgar slang term for breasts.","zh":"“diddies” 通常指简短的小曲/顺口溜，或（部分英式地区口语）零碎小东西；也可能是指乳房的粗俗俚语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of diddy) a short, simple song or tune; a little rhyme or jingle.","zh":"（diddy 的复数）简短、简单的歌曲/小调；小韵文或小广告歌。"},"examples":[{"en":"He whistled a few diddies while he worked.","zh":"他一边干活一边吹了几段小曲。"},{"en":"The kids made up silly diddies on the bus.","zh":"孩子们在公交车上编了些傻乎乎的小歌谣。"}]},{"partOfSpeech":"n.","definition":{"en":"(regional, especially Scottish/Northern English; plural of diddy) a small thing; a little bit or small item.","zh":"（地区用语，尤指苏格兰/英格兰北部；diddy 的复数）小东西；一点点/小件物品。"},"examples":[{"en":"Can you pass me those diddies on the table?","zh":"你能把桌上那些小东西递给我吗？"},{"en":"It’s just a few diddies—nothing important.","zh":"就一点小东西——不重要。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang, informal; can be vulgar) breasts.","zh":"（俚语，非正式；可能较粗俗）乳房。"},"examples":[{"en":"That slang term is rude, so it’s better not to use it.","zh":"那个俚语比较粗鲁，最好别用。"}]}],"synonyms":["jingles","tunes","dittys","trifles","bits and pieces"],"phonetic":"/ˈdɪdiz/","extraExplanation":["“Diddy / diddies” 在不同地区含义差异很大：在英式地区口语里更常见的是“短小的曲子/顺口溜”或“零碎小东西”。","也要注意大小写：大写的 “Diddy” 常指美国艺人 Sean “Diddy” Combs；“diddies” 作为普通名词复数与人名无关。","第三条（指身体部位）的用法带有性暗示，语气可能冒犯他人；在正式或不熟悉的场合应避免使用。"]}
{"word":"diddikai","summary":{"en":"“Diddikai” is a dialect word for a Romani person (often a child) and is often considered offensive today.","zh":"“diddikai”是方言中指罗姆人（常指孩子）的词，如今常被视为带冒犯性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often offensive) A Romani person (especially a child), or someone of mixed Romani and non-Romani background; sometimes used as a slur for “Gypsy.”","zh":"（常被视为冒犯性用语）指罗姆人（尤指孩子），或指罗姆人与非罗姆人混血的人；有时被用作贬称“吉普赛人”的词。"},"examples":[{"en":"The novel uses the word “diddikai,” a term some readers find offensive today.","zh":"这部小说用了“diddikai”这个词，如今一些读者认为它带有冒犯性。"},{"en":"He was warned not to call people “diddikai” because it can be a slur.","zh":"有人提醒他不要叫别人“diddikai”，因为这可能是贬称。"}]}],"synonyms":["Romani person","Roma","Traveller (in some contexts)"],"phonetic":"/ˈdɪdɪkaɪ/","extraExplanation":["这个词在英格兰/苏格兰等地的英语与苏格兰语里出现过，常与罗姆人（Romani）相关，词形也可见 diddicoy / diddakoi 等变体。","由于历史上对罗姆人长期存在歧视与刻板印象，这类称呼在现代语境中很容易带有冒犯性；更中性的说法通常是 Romani person / Roma（罗姆人）或 Traveller（视具体社群而定）。","如果你是在阅读文学作品或历史材料中遇到它，建议在引用时加上“historical/offensive term（历史上使用、可能冒犯）”的说明，以避免伤害。"]}
{"word":"diddle","summary":{"en":"“Diddle” most commonly means to cheat someone or to waste time; it can also be a noun meaning a trick, or a playful short tune. It has a vulgar meaning related to masturbation, so use with caution.","zh":"“diddle”最常见是指“欺骗/诈骗”或“磨蹭浪费时间”；也可作名词指“骗术/骗局”，或指“短小俏皮的曲调”。它还有与手淫有关的粗俗含义，使用时需谨慎。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to cheat or swindle someone (often out of money)","zh":"欺骗；诈骗（常指骗钱）"},"examples":[{"en":"He diddled customers out of their refunds.","zh":"他骗走了顾客本该拿到的退款。"},{"en":"Be careful—some online sellers try to diddle buyers.","zh":"小心——有些网店卖家会骗买家。"}]},{"partOfSpeech":"v.","definition":{"en":"to waste time; to delay by doing small, unimportant things","zh":"浪费时间；磨蹭（做些无关紧要的小事）"},"examples":[{"en":"Stop diddling and finish your homework.","zh":"别磨蹭了，把作业做完。"},{"en":"We diddled around for an hour before leaving.","zh":"我们出发前磨蹭了一个小时。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal, vulgar) to masturbate","zh":"（非正式、粗俗）手淫"},"examples":[{"en":"That word can be considered vulgar, so avoid it in polite conversation.","zh":"这个词可能被视为粗俗用语，所以在正式或礼貌的场合要避免使用。"}]},{"partOfSpeech":"n.","definition":{"en":"a dishonest trick; an act of cheating","zh":"骗术；欺诈行为"},"examples":[{"en":"The whole deal was a diddle.","zh":"这笔交易从头到尾就是个骗局。"}]},{"partOfSpeech":"n.","definition":{"en":"a short, simple tune (often playful)","zh":"短小轻快的曲调（常带玩笑或俏皮感）"},"examples":[{"en":"She hummed a little diddle while cooking.","zh":"她做饭时哼着一段小曲儿。"}]}],"synonyms":["cheat","swindle","scam","con","dawdle","mess around","waste time"],"phonetic":"/ˈdɪdəl/","extraExplanation":["“diddle”有时用于性相关的粗俗含义，在英语环境里可能让人不舒服或显得不礼貌。若你想表达“磨蹭/闲逛”，更安全常用的说法是“dawdle”“mess around”“waste time”。若表达“欺骗/诈骗”，可用“cheat”“swindle”“scam”。"]}
{"word":"diddled","summary":{"en":"“Diddled” means cheated/swindeled (most common), wasted time/messed around, and in crude slang can mean sexual molestation.","zh":"“diddled”多指“骗/诈骗”，也可指“瞎忙/磨蹭”；在粗俗俚语中还可能指“猥亵/性侵”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense / past participle of diddle) to cheat someone, especially to get money or an advantage dishonestly; to swindle.","zh":"（diddle 的过去式/过去分词）欺骗（尤指骗钱或骗取利益）；诈骗。"},"examples":[{"en":"He diddled several customers out of their deposits.","zh":"他骗走了好几位顾客的订金。"},{"en":"The contractor diddled the city by billing for work that was never done.","zh":"那名承包商虚报从未完成的工程费用来骗市政府。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal) to waste time doing small, unimportant things; to mess around or fiddle with something instead of working.","zh":"（非正式）瞎忙；磨蹭；摆弄一些无关紧要的事而不干正事。"},"examples":[{"en":"Stop diddling and finish your homework.","zh":"别磨蹭了，赶紧把作业做完。"},{"en":"I diddled with the settings for an hour and still couldn’t fix it.","zh":"我摆弄那些设置摆弄了一个小时，还是没修好。"}]},{"partOfSpeech":"v.","definition":{"en":"(slang, can be offensive) to touch someone sexually without consent, or to molest (especially a child).","zh":"（俚语，可能令人反感）对他人进行不当性触碰（未经同意）；猥亵（尤其指对儿童）。"},"examples":[{"en":"The report said the man had diddled a minor.","zh":"报告称该男子猥亵了一名未成年人。"},{"en":"This term is crude—use more precise words like “sexually assaulted” in serious contexts.","zh":"这个词很粗俗——在严肃语境中更应使用“性侵/性骚扰”等更准确的说法。"}]}],"synonyms":["cheated","swindled","conned","duped","defrauded","fiddled around","messed around","fooled around"],"phonetic":"/ˈdɪd(ə)ld/","extraExplanation":["“diddled”是动词“diddle”的过去式/过去分词，语气多为口语或带贬义。最常见的意思是“骗、诈骗”（常见搭配：diddle someone out of money）。","“浪费时间/瞎摆弄”这一义项在美式英语里也会出现，类似于“diddle around / fiddle around”。","带有性含义的用法属于粗俗俚语，可能冒犯他人；在新闻、法律或正式写作中建议改用更明确的表达，如“sexually assaulted / molested”。"]}
{"word":"diddler","summary":{"en":"“Diddler” most commonly means a small-time cheater or swindler, but it can also be a highly offensive slang term for a child sexual abuser.","zh":"“Diddler”最常见指“（小额）骗子/耍诈的人”，但也可能是非常冒犯且敏感的俚语，用来指“性侵儿童者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A person who cheats or swindles others, often in small or tricky ways.","zh":"（非正式）骗子；耍小聪明占便宜的人（常指小额或狡猾的欺骗）。"},"examples":[{"en":"Be careful—he’s a bit of a diddler and always tries to overcharge tourists.","zh":"小心点——他有点像个骗子，总想宰游客。"},{"en":"The report described him as a diddler who manipulated receipts to get extra money.","zh":"报告称他是个骗子，会篡改收据来多拿钱。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang, offensive, and sensitive) A person who sexually abuses children; used as a derogatory term.","zh":"（俚语；带侮辱性且敏感）指性侵儿童的人（贬义用法）。"},"examples":[{"en":"That word is highly offensive in this context—use precise terms like “child sexual abuser” in serious discussion.","zh":"在这种语境下这个词非常冒犯——严肃讨论时应使用更准确的说法，如“性侵儿童者”。"},{"en":"News writing typically avoids slang like “diddler” and uses legal or clinical terms instead.","zh":"新闻写作通常会避免使用像“diddler”这样的俚语，而改用法律或临床术语。"}]}],"synonyms":["swindler","cheat","con artist","scammer"],"phonetic":"/ˈdɪd(ə)lɚ/","extraExplanation":["“diddler”来自动词“diddle”（欺骗、骗取；也可作不雅含义），因此这个名词在不同语境里可能指“骗子”，也可能被用作极其敏感的辱称。","如果你只是想表达“骗子/诈骗者”，更中性的说法有：swindler, con artist, scammer。涉及犯罪报道或严肃讨论时，建议使用准确的法律/描述性用语，避免俚语带来的情绪化和不严谨。"]}
{"word":"diddlers","summary":{"en":"“Diddlers” most commonly means informal “cheaters/swindlers,” but it can also be a very offensive slang term for child sexual abusers, so use with great caution.","zh":"“diddlers”通常指非正式的“骗子/诈骗者”，但也可能是非常冒犯的俚语，用来指性侵害儿童者，因此使用时务必谨慎。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Informal: people who cheat or swindle others, especially in small or tricky ways.","zh":"非正式：指用小伎俩欺骗、诈骗他人的人（常指小额或耍花招的骗术）。"},"examples":[{"en":"The market was full of diddlers trying to sell fake tickets.","zh":"市场里有很多骗子想卖假票。"},{"en":"Be careful online—some diddlers use messages to trick you into sending money.","zh":"网上要小心——有些骗子会用消息诱骗你转账。"}]},{"partOfSpeech":"n.","definition":{"en":"Slang (very offensive): people who sexually abuse children.","zh":"俚语（非常冒犯）：指性侵害儿童的人。"},"examples":[{"en":"The community organized to keep children safe from diddlers.","zh":"社区组织起来，保护孩子远离性侵害者。"}]}],"synonyms":["scammers","swindlers","con artists","fraudsters"],"phonetic":"/ˈdɪd.lɚ/","extraExplanation":["“diddlers”是复数形式，单数是“diddler”。在不同语境里含义差别很大：有时只是“骗子/小偷小摸的骗徒”，但在口语里也常被用作对“性侵儿童者”的粗俗、强烈指称。","由于第二个含义非常敏感且带有强烈侮辱性，日常表达中更建议使用更明确、中性一些的词，如“scammer / fraudster”（骗子）或“child sexual abuser / child molester”（性侵儿童者，语境需谨慎）。"]}
{"word":"diddles","summary":{"en":"“Diddles” is usually a form of “diddle,” meaning to cheat someone or to waste time/fiddle with something; it can also mean small tricks, and in some contexts it’s an offensive term for sexual abuse—avoid casual use.","zh":"“diddles”通常是“diddle”的变形，常指欺骗/诈骗，或指磨蹭、摆弄东西；也可指小骗术。另外它在某些语境中可指性侵（带冒犯/不当），日常应避免随意使用。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of a person) to cheat or swindle someone, usually in a small or dishonest way","zh":"（人）欺骗、诈骗（通常指小规模或不诚实的手段）"},"examples":[{"en":"He diddles tourists by charging hidden fees.","zh":"他用收取隐藏费用的方式骗游客。"},{"en":"Some sellers diddle customers with fake “discounts.”","zh":"有些商家用假的“折扣”来骗顾客。"}]},{"partOfSpeech":"v.","definition":{"en":"to waste time or move your fingers/hands aimlessly; to fiddle (often with small objects)","zh":"浪费时间；（常指手或手指）无目的地乱动；摆弄（小东西）"},"examples":[{"en":"Stop diddling with your phone and focus on your work.","zh":"别再摆弄手机了，专心工作。"},{"en":"She diddled around for an hour before starting the essay.","zh":"她磨蹭了一个小时才开始写文章。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a small trick or act of cheating","zh":"（较少见）小把戏；小骗术"},"examples":[{"en":"The contract was full of little diddles designed to confuse buyers.","zh":"合同里满是用来迷惑买家的小花招。"}]},{"partOfSpeech":"vt.","definition":{"en":"(informal, often offensive/inappropriate) to touch someone sexually, especially a child; used in some legal/news contexts—avoid using casually","zh":"（非正式，常具冒犯/不当）对他人进行性触摸，尤指对儿童；在法律/新闻语境中偶见——日常应避免随意使用"},"examples":[{"en":"In the article, the suspect was accused of “diddling” minors.","zh":"在那篇报道中，嫌疑人被指控对未成年人实施性侵害。"}]}],"synonyms":["cheat","swindle","con","scam","fiddle","mess around","dawdle"],"phonetic":"ˈdɪdəl","extraExplanation":["“diddles”常见是动词“diddle”的第三人称单数：He diddles people. 也可能被当作名词复数，表示“各种小骗术/小花招”。","文学小知识：美国作家爱伦·坡（Edgar Allan Poe）写过一篇讽刺短文《Diddling Considered as One of the Exact Sciences》（《把行骗当作一门精确科学》），用“diddle”来指“骗子的伎俩”。"]}
{"word":"diddley","summary":{"en":"“Diddley” is informal slang meaning “anything at all,” usually used to mean “nothing,” especially in negative sentences.","zh":"“diddley”是口语俚语，表示“任何东西/一点点”，但多在否定句中表达“什么都没有/一点也不”。"},"definitions":[{"partOfSpeech":"pron.","definition":{"en":"(informal, chiefly in negatives) Anything at all; even the smallest amount—usually meaning “nothing.”","zh":"（非正式用法，多用于否定句）任何东西；一点点（通常表达“什么都没有/一点也没有”）。"},"examples":[{"en":"I don’t know diddley about fixing cars.","zh":"我对修车一点也不了解。"},{"en":"That apology didn’t mean diddley to her.","zh":"那句道歉对她来说毫无意义。"},{"en":"We worked all day and earned diddley.","zh":"我们干了一整天，结果一分钱也没赚到。"}]},{"partOfSpeech":"other","definition":{"en":"A spelling/wording variant of “diddly,” used in casual speech (often to add emphasis or a playful tone).","zh":"“diddly”的一种拼写/说法变体，用于口语中（常带强调或俏皮语气）。"},"examples":[{"en":"I didn’t do diddley today—just relaxed.","zh":"我今天啥也没干，就放松了一下。"},{"en":"There’s not diddley we can change right now.","zh":"我们现在一点也改变不了。"}]}],"synonyms":["nothing","not a thing","zip","zilch","nada"],"phonetic":"/ˈdɪdli/","extraExplanation":["“diddley / diddly”常出现在固定搭配里：not worth diddley（不值一提）、don’t know diddley（完全不懂）、did(d)ley-squat（= diddly-squat，俚语“什么也没有”）。语气偏口语、有点夸张，正式写作中建议用 “anything / nothing / at all”。","注意大小写：Bo Diddley 是美国摇滚/布鲁斯音乐人（艺名）。作为专有名词时要大写，含义与“什么也没有”的俚语用法无关。"]}
{"word":"diddlies","summary":{"en":"“Diddlies” is informal slang meaning “almost nothing” or “trivial little things.”","zh":"“diddlies”是非正式俚语，常指“几乎没有/等于零”，也可指“无关紧要的零碎小事”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, plural) A very small amount; practically nothing.","zh":"（非正式，复数）一点点；几乎没有；等于零。"},"examples":[{"en":"I looked everywhere, but I found diddlies.","zh":"我到处找，但什么也没找到。"},{"en":"After paying rent, I’ve got diddlies left.","zh":"交完房租后，我几乎一分钱都不剩。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, plural) Trivial or unimportant things; little odds and ends.","zh":"（非正式，复数）无关紧要的小东西；零碎小事。"},"examples":[{"en":"Don’t worry about the diddlies—focus on the main problem.","zh":"别纠结那些小事——把注意力放在主要问题上。"},{"en":"My desk is covered with diddlies like old receipts and sticky notes.","zh":"我的桌子上堆满了零碎东西，比如旧收据和便利贴。"}]}],"synonyms":["nothing","almost nothing","very little","next to nothing","diddly-squat","odds and ends","trifles"],"phonetic":"/ˈdɪdliːz/","extraExplanation":["“diddlies”在口语里常用来强调“几乎没有/一点用都没有”，语气往往带点抱怨或夸张。","它和常见短语“diddly-squat / diddly squat”（意思是“啥也没有/一丁点也没有”）语感接近；也常见表达“didn’t do diddly”（几乎没做什么）。","拼写与用法不算标准，更多出现在轻松口语或写作中；正式场合建议用“nothing / almost nothing / very little”。"]}
{"word":"diddling","summary":{"en":"Diddling usually means cheating/swindling, or wasting time by fiddling with small things.","zh":"diddling 通常指“欺骗/诈骗”，也可指“磨蹭、瞎摆弄小事而耽误正事”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"cheating or swindling someone (often for money); tricking people in a dishonest way","zh":"欺骗、诈骗（常指为钱而骗）；用不诚实的方法坑骗别人"},"examples":[{"en":"The investigation found evidence of diddling customers with hidden fees.","zh":"调查发现了用隐藏费用欺骗顾客的证据。"},{"en":"He was accused of diddling investors out of their savings.","zh":"他被指控骗走投资者的积蓄。"}]},{"partOfSpeech":"n.","definition":{"en":"spending time doing small, unimportant actions; fiddling instead of working","zh":"磨蹭；忙些琐碎但不重要的事；瞎折腾而不做正事"},"examples":[{"en":"Stop diddling with your phone and finish your homework.","zh":"别再摆弄手机了，快把作业写完。"},{"en":"I did some diddling around the house before starting my project.","zh":"我在家里磨蹭了一会儿才开始做项目。"}]},{"partOfSpeech":"v.","definition":{"en":"the present participle of “diddle”: to cheat or to waste time doing trivial things","zh":"“diddle”的现在分词：指欺骗/诈骗，或指磨蹭、瞎摆弄"},"examples":[{"en":"They were diddling the public by exaggerating the product’s benefits.","zh":"他们夸大产品效果来欺骗公众。"},{"en":"He’s been diddling around all morning instead of cleaning.","zh":"他一早上都在磨蹭，没有打扫卫生。"}]}],"synonyms":["cheating","swindling","scamming","defrauding","fiddling","messing around","dawdling"],"phonetic":"/ˈdɪd(ə)lɪŋ/","extraExplanation":["“diddle”在表示“诈骗/坑骗”时语气偏口语，也可带一点讽刺意味；正式场合更常用“defraud / scam / cheat”。","注意：在某些语境里，“diddle”也可能被用作含性暗示的粗俗说法（尤其是对儿童不当触碰的含义）。如果不确定语境，建议避免使用这个词。"]}
{"word":"diddly","summary":{"en":"“Diddly” is an informal word meaning “almost nothing” or “not at all,” often used for emphasis; it can also be mild slang for “penis.”","zh":"“diddly”是非正式说法，常表示“几乎没有/一点也不”，用来加强语气；也可作轻度俚语指“阴茎”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Anything of very little value, importance, or amount; practically nothing.","zh":"（非正式）几乎没有价值/重要性/数量的东西；几乎等于没有。"},"examples":[{"en":"I don’t know diddly about cars.","zh":"我对汽车几乎一无所知。"},{"en":"The apology diddly-squat didn’t fix the problem.","zh":"那点（几乎等于没有的）道歉并没有解决问题。"}]},{"partOfSpeech":"adv.","definition":{"en":"(informal, usually in negatives) At all; to any extent (used for emphasis).","zh":"（非正式，常用于否定句）一点也不；丝毫（用于强调）。"},"examples":[{"en":"That explanation didn’t help diddly.","zh":"那个解释一点也没帮上忙。"},{"en":"He didn’t care diddly what they thought.","zh":"他一点也不在乎他们怎么想。"}]},{"partOfSpeech":"n.","definition":{"en":"(mild slang) A man’s penis; used humorously or crudely.","zh":"（轻度俚语）阴茎；多带搞笑或粗俗意味。"},"examples":[{"en":"It’s mostly used as a joke, so be careful who you say it around.","zh":"它多半是开玩笑用法，所以要注意场合和对象。"}]}],"synonyms":["nothing","not a bit","zilch","zero","next to nothing"],"phonetic":"/ˈdɪdli/","extraExplanation":["“diddly”在美式口语里常见于固定搭配：\n- “diddly-squat / diddly squat”：强调“什么也没有、完全没有用”，语气更强。\n- “I don’t know diddly (about …)”：表示“我几乎一无所知”。\n语气偏随意，有时带点嘲讽或抱怨；在正式写作或职场沟通里建议换成 “almost nothing / not at all / hardly anything”。"]}
{"word":"diddy","summary":{"en":"“Diddy” can mean a short simple song/tune (British/Scottish), and it is also a well-known stage name for Sean Combs.","zh":"“diddy”可指简短的小歌/小调（英式/苏格兰用法）；“Diddy”也常作为 Sean Combs 的艺名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, British/Scottish) a short simple song, rhyme, or tune; a little ditty.","zh":"（非正式，英式/苏格兰用法）简短、简单的小歌/小调/小押韵诗；小曲儿。"},"examples":[{"en":"She made up a silly diddy to help the kids remember the rules.","zh":"她编了个傻乎乎的小曲儿，帮助孩子们记住规则。"},{"en":"He whistled a cheerful diddy as he walked home.","zh":"他一边走回家一边吹着欢快的小调。"}]},{"partOfSpeech":"n.","definition":{"en":"a nickname or stage name, especially “Diddy,” used for the American rapper and music producer Sean Combs.","zh":"昵称/艺名（尤其是 “Diddy”），指美国说唱歌手兼音乐制作人 Sean Combs 的艺名。"},"examples":[{"en":"In the early 2000s, he was widely known as Diddy.","zh":"在 2000 年代初期，他被广泛称为 Diddy。"},{"en":"The article mentioned Diddy’s influence on hip-hop and pop culture.","zh":"这篇文章提到了 Diddy 对嘻哈与流行文化的影响。"}]}],"synonyms":["ditty","jingle","tune","rhyme"],"phonetic":"/ˈdɪdi/","extraExplanation":["“diddy”在英式（尤其苏格兰）口语里常指轻松上口的短歌/小曲，语感接近“ditty（小曲）”。在北美英语中作为普通名词不算常见，更常见的是专有名词/昵称用法（如艺名）。","注意大小写：diddy（普通名词）vs. Diddy（人名/艺名）。"]}
{"word":"didelph","summary":{"en":"“Didelph” is a rare biology term meaning “having two uteri,” often used when describing some marsupials.","zh":"“didelph”是较少见的生物学用语，意为“具双子宫”，常用于描述某些有袋类动物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(biology, zoology) Having a double uterus (two uterine horns); relating to a “two-womb” reproductive structure.","zh":"（生物/动物学）具双子宫（两侧子宫角）的；与“两个子宫”的生殖结构有关的。"},"examples":[{"en":"Some marsupials have a didelph reproductive system with two separate uteri.","zh":"一些有袋类动物具有双子宫的生殖系统，两侧子宫彼此分开。"},{"en":"The paper describes a didelph uterus as common in certain mammal groups.","zh":"这篇论文描述了某些哺乳动物类群中常见的双子宫结构。"}]}],"synonyms":["didelphic","double-utered (informal)"],"phonetic":"/ˈdaɪdɛlf/","extraExplanation":["“didelph”较少单独使用，更常见的是 didelphic（双子宫的）或 Didelphia/Didelphidae（与负鼠等有袋类相关的分类名称）。","词源可拆为希腊语 di-（“两/双”）+ delphys（“子宫/子房”），因此核心意思是“两个子宫”。","在解剖学/动物学语境中，它常用来对比单一子宫（如人类常见的单子宫结构）与某些动物的“双子宫/双阴道”等结构。"]}
{"word":"Didelphia","summary":{"en":"Didelphia is a scientific name used (especially historically) for a group of marsupials, notably opossums and related animals.","zh":"Didelphia 是一个科学分类名称（尤见于历史用法），指一类有袋类动物，主要包括负鼠及其近缘类群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a taxonomic group (especially in older classification) referring to certain marsupials, particularly the opossums and their close relatives.","zh":"（分类学用语，尤见于较旧的分类体系）指一类有袋类动物，尤指负鼠及其近缘类群。"},"examples":[{"en":"In some older textbooks, the Virginia opossum is placed in Didelphia.","zh":"在一些较旧的教材中，弗吉尼亚负鼠被归入 Didelphia。"},{"en":"The term Didelphia is most often used when discussing historical mammal classification.","zh":"Didelphia 这个词最常用于讨论哺乳动物的历史分类。"}]}],"synonyms":["opossums (contextual)","American marsupials (broad, contextual)"],"phonetic":"/daɪˈdɛlfiə/","extraExplanation":["词源：来自希腊语 di-（“两”）+ delphys（“子宫/胎”），暗示“有两个子宫”的特征；有袋类雌性常有成对的生殖结构，因此早期学者用此命名。","分类提示：现代分类中更常见的是 Didelphimorphia（负鼠目）等更精确的名称；Didelphia 在一些语境里被当作较旧或较宽泛的称呼。"]}
{"word":"didelphia","summary":{"en":"Didelphia is an older scientific term, most often referring to plants with stamens united into two bundles; in some older zoological texts it also relates to opossum groups.","zh":"Didelphia 是较旧的科学术语，最常指雄蕊合生成两束的植物类群；在部分旧动物学文献中也曾用于指负鼠相关类群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former Linnaean plant class for flowers whose stamens are united into two bundles (two groups).","zh":"（林奈分类法中的旧分类）指雄蕊合生成两束（两组）的植物类群。"},"examples":[{"en":"In older botany books, peas and beans were often placed in the class Didelphia.","zh":"在较早的植物学书里，豌豆和豆类常被归入“二体雄蕊类（Didelphia）”。"},{"en":"The term Didelphia is mostly historical; modern taxonomy uses different systems.","zh":"“Didelphia”主要是历史用语；现代分类学使用不同的体系。"}]},{"partOfSpeech":"n.","definition":{"en":"a zoological name used in some older classifications for opossum-related marsupials (now usually treated under Didelphidae or related groups).","zh":"（旧式动物分类用语）指与负鼠相关的一类有袋动物（现代多用 Didelphidae 等更常见的分类名）。"},"examples":[{"en":"Some 19th-century sources used Didelphia when discussing opossums.","zh":"一些19世纪的资料在讨论负鼠时会使用“Didelphia”这个名称。"}]}],"synonyms":["didelphous","two-bundled stamens","Didelphidae (opossum family)"],"phonetic":"/daɪˈdɛlfiə/","extraExplanation":["词源来自希腊语：di-（两、双）+ adelphos（兄弟），大意是“分成两组/两兄弟会”。因此在植物学里用来指“雄蕊分成两束”。","在英语里更常见的是形容词 didelphous（两体雄蕊的），以及名词 Didelphidae（负鼠科）。如果你是在查某个学术名词，可能也想查 didelphous 或 Didelphidae。"]}
{"word":"didelphian","summary":{"en":"Didelphian usually means “related to marsupials (especially opossums),” and more rarely “having a double uterus.”","zh":"didelphian 通常指“与有袋类（尤指负鼠）有关”，较少见时指“具有双子宫的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Zoology) Relating to marsupials, especially opossums (historically grouped as “Didelphia”).","zh":"（动物学）与有袋类动物有关的，尤指负鼠（历史上曾归为“Didelphia/双子宫类”）。"},"examples":[{"en":"The researcher compared didelphian and placental mammals to understand different reproductive strategies.","zh":"研究人员比较了有袋类（didelphian）和胎盘类哺乳动物，以理解不同的繁殖策略。"},{"en":"Opossums are didelphian mammals commonly found in parts of North and South America.","zh":"负鼠是有袋类（didelphian）哺乳动物，常见于北美和南美的部分地区。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Anatomy, less common) Having a double uterus; didelphic.","zh":"（解剖学，较少见）具有双子宫的；双子宫型的（didelphic）。"},"examples":[{"en":"In medical writing, “didelphian uterus” may describe a uterus that developed as two separate cavities.","zh":"在医学写作中，“didelphian uterus”可用来描述发育成两个独立腔体的子宫。"},{"en":"The report used “didelphian” as an older adjective for a didelphic condition.","zh":"该报告把“didelphian”作为较旧的形容词，用来指双子宫（didelphic）这种情况。"}]}],"synonyms":["marsupial (usual modern term)","opossum-related","didelphic (for the double-uterus sense)"],"phonetic":"/daɪˈdɛlfiən/","extraExplanation":["词源上来自希腊语：di-（“两个”）+ delphys（“子宫/胎”）。因此它在动物学里曾用来强调有袋类（如负鼠）生殖结构上的特点；在现代分类学中更常直接说“marsupial（有袋类）”，而“didelphian”多见于较旧或较学术的语境。"]}
{"word":"didelphic","summary":{"en":"Didelphic means “having a double uterus,” a medical term describing a congenital anatomical variation.","zh":"didelphic 指“具有双子宫”的（医学术语），多用于描述先天性的解剖结构差异。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Medicine) Having a double uterus (two uterine cavities), often due to a congenital developmental difference.","zh":"（医学）双子宫的；具有两个子宫腔的（多为先天发育差异所致）。"},"examples":[{"en":"The ultrasound suggested a didelphic uterus, which can affect pregnancy management.","zh":"超声提示可能为双子宫，这可能会影响妊娠管理。"},{"en":"Some people with a didelphic uterus have no symptoms and only learn about it during an exam.","zh":"有些双子宫患者没有症状，只是在检查时才发现。"}]}],"synonyms":["uterus didelphys (related term)","double uterus (common wording)"],"phonetic":"/daɪˈdɛlfɪk/","extraExplanation":["词源：来自希腊语前缀 di-（“两个”）+ delphys（“子宫/子宫体”），字面义就是“两个子宫”。","使用场景：这是偏专业的医学形容词，日常交流中更常见的说法是 uterus didelphys（双子宫）或“double uterus”。","相关概念：它属于苗勒管发育异常（Müllerian anomalies）的一种；与 bicornuate uterus（双角子宫）不同，didelphic 通常指更明显的“两个子宫腔/两个宫颈”结构。"]}
{"word":"didelphid","summary":{"en":"A didelphid is an opossum-family marsupial (or something related to that family).","zh":"didelphid 指负鼠科的有袋类动物，或与负鼠科相关的事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a marsupial animal that belongs to the family Didelphidae (the opossum family), found mainly in the Americas","zh":"负鼠科（Didelphidae）的有袋类动物，主要分布在美洲"},"examples":[{"en":"The Virginia opossum is a common didelphid in North America.","zh":"弗吉尼亚负鼠是北美常见的一种负鼠科动物。"},{"en":"Scientists studied didelphids to understand how marsupials raise their young.","zh":"科学家研究负鼠科动物，以了解有袋类如何哺育幼崽。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or characteristic of the opossum family Didelphidae","zh":"与负鼠科（Didelphidae）有关的；负鼠科的"},"examples":[{"en":"The museum has a section on didelphid mammals.","zh":"博物馆里有一个关于负鼠科哺乳动物的展区。"},{"en":"They compared didelphid skull shapes with those of other marsupials.","zh":"他们把负鼠科动物的头骨形状与其他有袋类进行了比较。"}]}],"synonyms":["opossum","member of Didelphidae"],"phonetic":"/daɪˈdɛlfɪd/","extraExplanation":["“didelphid”来自负鼠科的学名 Didelphidae。词根与希腊语有关：di- 表示“两”，delphys 与“子宫/胎”相关，呼应有袋类动物育幼时的育儿袋（类似“第二个子宫”的概念）。","日常英语里更常见的说法是 opossum（负鼠）；didelphid 多用于动物学、生态学等较正式的语境。"]}
{"word":"Didelphidae","summary":{"en":"Didelphidae = the opossum family (a group of marsupials).","zh":"Didelphidae 指“负鼠科”，即一类有袋类（负鼠）的分类名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of marsupial mammals (the opossums) native mainly to the Americas.","zh":"（生物）负鼠科：主要分布在美洲的一科有袋类哺乳动物（负鼠类）。"},"examples":[{"en":"The Virginia opossum belongs to the family Didelphidae.","zh":"弗吉尼亚负鼠属于负鼠科（Didelphidae）。"},{"en":"Didelphidae species are important for studying marsupial evolution in the Americas.","zh":"负鼠科物种对研究美洲有袋类的演化很重要。"}]}],"synonyms":["opossum family","the opossums (general term)"],"phonetic":"/daɪˈdɛlfɪdiː/","extraExplanation":["“Didelphidae”是拉丁化的动物分类学名称，常用于学术写作与科普文献中；日常英语里更常说“opossums（负鼠）”。","词源与希腊语有关：didelphys 意为“（有）双子宫/双子宫的”，指许多负鼠类雌性的生殖系统特征。"]}
{"word":"didelphidae","summary":{"en":"Didelphidae is the scientific family name for opossums.","zh":"Didelphidae 是“负鼠科”的学名（科学分类名称）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a biological family of marsupials known as the opossums, mainly found in the Americas (especially Central and South America, with one common species in North America).","zh":"负鼠科：一种有袋类动物的生物分类“科”，成员通常称为负鼠，主要分布在美洲（尤其中南美；北美也有一种常见的负鼠）。"},"examples":[{"en":"The Virginia opossum belongs to the family Didelphidae.","zh":"弗吉尼亚负鼠属于负鼠科（Didelphidae）。"},{"en":"In many rainforest habitats, Didelphidae species play an important role in the food web.","zh":"在许多雨林栖息地中，负鼠科物种在食物网中扮演重要角色。"}]}],"synonyms":["opossum family","family Didelphidae"],"phonetic":"/daɪˌdɛlˈfɪdi/","extraExplanation":["“Didelphidae”是拉丁化的动物分类学名称（“科”名），在科普或学术语境里常见；日常英语中更常直接说“opossum(s)”（负鼠）。","词源与希腊语有关：di- 表示“两个”，delphys 表示“子宫/胎”，暗示有袋类与繁殖相关的特征。"]}
{"word":"didelphine","summary":{"en":"Didelphine describes, or refers to, an opossum-family animal (Didelphidae).","zh":"didelphine 指“与负鼠科有关的”，或指“负鼠科动物”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(zoology) Relating to the opossum family Didelphidae; opossum-like.","zh":"（动物学）与负鼠科（Didelphidae）有关的；负鼠类的。"},"examples":[{"en":"The Virginia opossum is a classic didelphine marsupial found in North America.","zh":"北美的弗吉尼亚负鼠是典型的负鼠科有袋动物。"},{"en":"Researchers compared didelphine species to study how marsupials adapt to different habitats.","zh":"研究人员比较了负鼠科的不同物种，以研究有袋动物如何适应不同栖息地。"}]},{"partOfSpeech":"n.","definition":{"en":"A member of the opossum family (a didelphid), especially one of the American opossums.","zh":"负鼠科的一员（即 didelphid），尤指美洲的负鼠类动物。"},"examples":[{"en":"Several didelphines were recorded by camera traps near the river.","zh":"河边的红外相机记录到几只负鼠科动物。"},{"en":"As a didelphine, it carries its young in a pouch after birth.","zh":"作为负鼠科动物，它在出生后会把幼崽带在育儿袋里。"}]}],"synonyms":["didelphid","opossum"],"phonetic":"/daɪˈdɛlfaɪn/","extraExplanation":["“didelphine”主要用于动物学/分类学语境，日常英语里更常见的是“opossum（负鼠）”或“didelphid（负鼠科动物）”。","词源上来自希腊语：di-（两）+ delphys（子宫/胎），与有袋类动物的生殖特征相关。"]}
{"word":"Didelphis","summary":{"en":"Didelphis is the scientific genus name for certain opossums, especially the Virginia opossum.","zh":"Didelphis 是负鼠属的科学属名，常指包含北美负鼠在内的一类负鼠。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of opossums (New World marsupials), including the Virginia opossum (Didelphis virginiana).","zh":"负鼠属（新世界有袋类动物的一属），包括北美负鼠（Didelphis virginiana，弗吉尼亚负鼠）。"},"examples":[{"en":"Didelphis is the genus that includes the Virginia opossum.","zh":"Didelphis 是包含北美负鼠（弗吉尼亚负鼠）在内的属。"},{"en":"Scientists often write the name in italics: Didelphis.","zh":"科学文献中常把该名称用斜体书写：Didelphis。"}]}],"synonyms":["opossum genus"],"phonetic":"/daɪˈdɛlfɪs/","extraExplanation":["这是一个拉丁化的学名（属名）。在生物分类中，属名首字母大写、通常用斜体；具体到某个物种时会写成“Didelphis virginiana”（属名 + 种加词）。","词源可追溯到希腊语：di-（“两”）+ delphys（“子宫/腹”），与有袋类动物的繁殖特征相关。"]}
{"word":"didelphis","summary":{"en":"Didelphis is the scientific genus name for certain opossums, including the Virginia opossum.","zh":"Didelphis 是某些负鼠（如弗吉尼亚负鼠）的科学属名（负鼠属）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of opossums (family Didelphidae), including the Virginia opossum; often discussed in biology and zoology.","zh":"（动物学）负鼠属（负鼠科的一属），包括北美弗吉尼亚负鼠；常见于生物学与动物学语境。"},"examples":[{"en":"The genus Didelphis includes the Virginia opossum, a common marsupial in North America.","zh":"负鼠属（Didelphis）包括弗吉尼亚负鼠，它是北美常见的有袋类动物。"},{"en":"In the lab, we compared skull measurements across Didelphis species.","zh":"在实验室里，我们比较了不同负鼠属（Didelphis）物种的头骨测量数据。"}]}],"synonyms":["opossum genus","genus Didelphis"],"phonetic":"/daɪˈdɛlfɪs/","extraExplanation":["“Didelphis”是学名（属名），在文章中通常首字母大写并用斜体：*Didelphis*。单独提到某个物种时会用“双名法”，如 *Didelphis virginiana*（弗吉尼亚负鼠）。","词源来自希腊语：di-（“两个”）+ delphys（“子宫/胎”），指某些有袋类动物与育幼袋相关的生物学特征。"]}
{"word":"didelphoid","summary":{"en":"“Didelphoid” means having two uteri, a feature common in many marsupials.","zh":"“didelphoid”指“具有两个子宫（双子宫）的”，这一特征常见于许多有袋类动物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Zoology) Having a double uterus (two uteri), like many marsupials (e.g., opossums).","zh":"（动物学）有双子宫的；具有两个子宫的（常见于许多有袋类，如负鼠）。"},"examples":[{"en":"Many marsupials are didelphoid, with two uteri instead of one.","zh":"许多有袋类动物是双子宫的，它们有两个子宫而不是一个。"},{"en":"The researcher compared didelphoid reproductive anatomy with that of placental mammals.","zh":"研究人员比较了双子宫的生殖结构与胎盘哺乳动物的生殖结构。"}]}],"synonyms":["double-uterus (having)","bicornuate (broader/related term)"],"phonetic":"/daɪˈdɛl.fɔɪd/","extraExplanation":["词源提示：didelphoid 来自希腊语前缀 di-（“两个”）+ delphys（“子宫/胎”），字面意思就是“两个子宫的”。在生物学语境中多用于描述有袋类（marsupials）等动物的生殖结构。"]}
{"word":"didelphous","summary":{"en":"Didelphous describes something divided into two groups—especially stamens fused into two bundles in many pea-family plants.","zh":"didelphous 指“分成两组的”，最常用来形容豆科等植物的雄蕊融合成两束。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having stamens that are joined (fused) into two groups or bundles, as in many pea-family flowers.","zh":"（植物学）指雄蕊联合（融合）成两束或两组的；常见于豆科花。"},"examples":[{"en":"Pea flowers are often didelphous, with their stamens forming two bundles.","zh":"豌豆花常呈二体雄蕊状，雄蕊形成两束。"},{"en":"In class we learned that many legumes show a didelphous stamen pattern.","zh":"课堂上我们学到许多豆科植物具有二体雄蕊的特征。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Zoology, less common) Having two wombs (uteri) or paired female reproductive structures.","zh":"（动物学，较少见）具有两个子宫（或成对的雌性生殖结构）的。"},"examples":[{"en":"Some mammals have a didelphous uterus, meaning the uterus is divided into two separate parts.","zh":"有些哺乳动物具有二子宫结构，即子宫分为两个独立部分。"},{"en":"The textbook briefly mentioned didelphous reproductive anatomy in certain species.","zh":"教材简要提到某些物种存在二子宫的生殖解剖结构。"}]}],"synonyms":["diadelphous","two-bundled (botany)","two-parted (general)"],"phonetic":"/daɪˈdɛlfəs/","extraExplanation":["词源来自希腊语：di-（“两”）+ adelphos（“兄弟”），字面含义是“成两组的”。在植物学里更常见的拼写是 **diadelphous**，意思相同。","在林奈分类与植物形态描述中，“didelphous/diadelphous”常用来快速概括豆科（Fabaceae）等花的雄蕊联合方式：通常是“9枚连在一起 + 1枚分离”，看起来像两束。"]}
{"word":"Didelphyidae","summary":{"en":"Didelphyidae is the scientific family name for most New World opossums.","zh":"Didelphyidae 是大多数新世界负鼠的科学分类“科名”（负鼠科）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of marsupial mammals that includes most New World opossums (animals that carry and nurse their young in a pouch).","zh":"负鼠科：一种有袋类哺乳动物的科，包括大多数生活在美洲的新世界负鼠（会在育儿袋中携带并哺育幼崽的动物）。"},"examples":[{"en":"The Virginia opossum belongs to the family Didelphyidae.","zh":"弗吉尼亚负鼠属于负鼠科（Didelphyidae）。"},{"en":"Researchers compared skull shapes across several species in the Didelphyidae.","zh":"研究人员比较了负鼠科多个物种的头骨形态。"}]}],"synonyms":["opossum family","Didelphidae"],"phonetic":"/daɪˈdɛlfɪdiː/","extraExplanation":["“Didelphyidae”是生物分类学中的“科名”，常见于动物学、生态学论文与科普书中；日常英语更常用“opossums”（负鼠）来指代这些动物。","词源来自希腊语“didelphys”，意为“两个子宫/双子宫”，与负鼠等有袋类的生殖结构特征有关。","拼写提示：标准学术拼写更常见为“Didelphidae”（带 ph）。你输入的“Didelphyidae”有时会出现在资料中，但可能是变体或误拼。"]}
{"word":"didelphyidae","summary":{"en":"Didelphidae is the scientific family name for opossums in the Americas.","zh":"Didelphidae 是美洲负鼠的科级科学名称（负鼠科）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a biological family of marsupials that includes the opossums of the Americas (for example, the Virginia opossum).","zh":"（生物学）负鼠科：一类有袋类动物的科，包含美洲的负鼠（例如北美负鼠/弗吉尼亚负鼠）。"},"examples":[{"en":"The Virginia opossum is a well-known member of the family Didelphidae.","zh":"北美负鼠（弗吉尼亚负鼠）是负鼠科（Didelphidae）的著名成员。"},{"en":"Many Didelphidae species are nocturnal and eat insects, fruit, and small animals.","zh":"许多负鼠科物种是夜行性的，会吃昆虫、水果和小型动物。"}]}],"synonyms":["opossum family","didelphids"],"phonetic":"/ˌdaɪdɛlˈfɪdi/","extraExplanation":["你输入的拼写“didelphyidae”常见于把正规学名 **Didelphidae** 拼错的情况；标准写法是 **Didelphidae**（负鼠科）。","词源可追溯到希腊语：**di-**（“两”）+ **delphys**（“子宫/胎”），暗示“有双子宫”的特征；这是一些有袋类（包括不少负鼠）常被提到的生殖系统特点。","在分类学里它属于“科（family）”这个层级；日常英语里更常说 **opossum(s)**（负鼠）而不是用科名。","相关词：**didelphid**（负鼠科动物/负鼠科的，常用于学术语境）。"]}
{"word":"didepsid","summary":{"en":"“didepsid” isn’t a recognized English word; it’s probably a misspelling.","zh":"“didepsid”不是可识别的英语单词；很可能是拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; likely a typo or random string. Please check spelling or tell me the context/sentence.","zh":"不是标准英语单词；很可能是拼写错误或随机字符。请检查拼写，或提供出现它的句子/语境。"},"examples":[{"en":"I can’t find “didepsid” in major dictionaries—could you share the full sentence?","zh":"我在主要词典里找不到“didepsid”——你能把完整句子发我吗？"},{"en":"Did you mean “deposit,” “despite,” or “depressed”?","zh":"你想写的是“deposit（存款/押金）”、“despite（尽管）”还是“depressed（沮丧的）”？"}]}],"extraExplanation":["“didepsid”看起来像把字母打乱或拼错了。常见的“相似外形”候选可能包括：deposit（存入/押金）、despite（尽管）、depressed（沮丧的）。如果你提供它出现的句子、你想表达的中文意思，或发一张截图，我可以更准确地帮你定位正确单词。"]}
{"word":"didepside","summary":{"en":"Not a standard English word; likely a misspelling. Share the sentence for an accurate correction.","zh":"不是标准英语单词；可能是拼写错误。提供原句可帮助准确纠正。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“didepside” is not a standard English word. It may be a misspelling or a typo.","zh":"“didepside” 不是标准英语单词，可能是拼写错误或打字错误。"},"examples":[{"en":"I couldn’t find “didepside” in the dictionary—did you mean “deep-seated” or “alongside”?","zh":"我在词典里找不到 “didepside”——你是不是想写 “deep-seated” 或 “alongside”？"},{"en":"Can you share the full sentence where you saw “didepside”?","zh":"你能把包含 “didepside” 的完整句子发我吗？"}]}],"extraExplanation":["你输入的形式很像把两个片段拼在一起（比如 did + … + side），但英语里没有常见词是 “didepside”。\n\n可能的目标词（请对照你原句意思选）：\n- deep-seated（根深蒂固的；长期存在的）\n- alongside（在……旁边；与……一起）\n- beside（在……旁边）\n- did + (something) + side（如果是分词/过去式结构的一部分）\n\n如果你把原句或截图发来，我可以帮你精准判断想表达的词并给出正确释义与例句。"]}
{"word":"Diderot","summary":{"en":"Diderot is the surname of Denis Diderot, an influential French Enlightenment thinker and a leading editor of the Encyclopédie.","zh":"Diderot指法国启蒙思想家狄德罗的姓氏，他也是《百科全书》的重要主编之一。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Denis Diderot (1713–1784), a major French Enlightenment philosopher and writer, best known as a chief editor of the Encyclopédie.","zh":"狄德罗（Denis Diderot，1713–1784），法国启蒙运动的重要哲学家与作家，最著名的身份是《百科全书》的主编之一。"},"examples":[{"en":"Diderot helped shape Enlightenment ideas about reason, education, and social reform.","zh":"狄德罗推动了启蒙运动关于理性、教育与社会改革的思想。"},{"en":"In class, we read a short passage from Diderot’s Encyclopédie project.","zh":"课堂上我们读了一段与狄德罗《百科全书》计划相关的短文。"}]}],"synonyms":["Denis Diderot","Enlightenment philosopher","Encyclopédie editor"],"phonetic":"/ˈdɪdəˌroʊ/","extraExplanation":["“Diderot”是法语姓氏，英语里常用于指“狄德罗本人”或与其思想相关的事物（如启蒙运动、百科全书运动）。","他与达朗贝尔等人合作主编《百科全书》（Encyclopédie），核心目标是系统整理当时的人类知识，推动理性与科学精神，也因此与宗教审查和政治压力产生冲突。","学习文化类英文时，你可能会见到“the Enlightenment（启蒙运动）”“encyclopedist（百科全书派/百科全书编纂者）”等词与Diderot一起出现。"]}
{"word":"didest","summary":{"en":"“Didest” is an archaic form meaning “you (thou) did,” a variant of “didst.”","zh":"“didest”是古英语用法，意思相当于“你（thou）做了”，是“didst”的拼写变体。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Archaic) Second-person singular past tense of “do,” used with “thou”; a spelling variant of “didst.”","zh":"（古语）“do”的第二人称单数过去式，和“thou”连用；是“didst”的一种拼写变体。"},"examples":[{"en":"Thou didest promise to help, but thou didest not come.","zh":"你（thou）曾答应要帮忙，但你并没有来。"},{"en":"Why didest thou doubt?","zh":"你为何怀疑？"},{"en":"In older texts, you may see “didest” where modern English uses “did.”","zh":"在较古老的文本中，你可能会看到“didest”，而现代英语通常用“did”。"}]}],"synonyms":["didst","did (modern equivalent)"],"phonetic":"/ˈdɪdɪst/","extraExplanation":["“didest / didst”常见于《圣经》（如《钦定版》King James Bible）、莎士比亚戏剧和早期现代英语文本中，与“thou / thee / thy”这一套第二人称单数形式搭配。现代英语里已经不用这一套人称变化，通常直接说“you did”。","拼写“didest”比“didst”更少见，读到时一般可按“didst”理解：表示“你（thou）做了/曾经做”。"]}
{"word":"didgeridoo","summary":{"en":"A traditional Australian Aboriginal wind instrument that makes a deep, continuous drone.","zh":"澳大利亚原住民传统吹奏乐器，能发出低沉、持续的嗡鸣声。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long wooden wind instrument from Australia, traditionally made and played by Aboriginal peoples; it produces a deep, vibrating drone sound","zh":"迪吉里杜管（澳大利亚传统长木制吹奏乐器），由澳洲原住民传统制作与演奏，声音低沉并持续嗡鸣"},"examples":[{"en":"He learned to play the didgeridoo and practiced circular breathing.","zh":"他学着吹迪吉里杜管，并练习循环换气。"},{"en":"The performance opened with the deep drone of a didgeridoo.","zh":"演出以迪吉里杜管低沉的持续嗡鸣声开场。"}]}],"synonyms":["Australian drone pipe","drone instrument"],"phonetic":"/ˌdɪdʒəˈduː/","extraExplanation":["“Didgeridoo”是英语中对这种乐器的常用称呼，但它并非所有原住民语言中的原名；不同地区的原住民社群可能有各自的称呼与传统用途。提到或学习这种乐器时，尊重其文化背景与来源很重要。","它常与“circular breathing（循环换气）”联系在一起：演奏者通过用鼻子吸气、同时用脸颊把气推出去，从而让声音不断。"]}
{"word":"Didi","summary":{"en":"“Didi” can be a name/nickname, a brand name (DiDi ride-hailing), or an informal word meaning “older sister” in some South Asian contexts.","zh":"“Didi”可以是人名/昵称，也可能指品牌名（如网约车 DiDi/滴滴），在部分南亚语境中还可表示“姐姐”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper noun) A given name or nickname; also used as a brand name in some contexts (e.g., Didi, a ride-hailing company).","zh":"（专有名词）人名或昵称；在某些语境中也可作为品牌名使用（如滴滴出行这一网约车公司）。"},"examples":[{"en":"Didi is my cousin’s nickname, so everyone calls her that.","zh":"Didi 是我表妹的昵称，所以大家都这么叫她。"},{"en":"I took a Didi to the airport in Shanghai.","zh":"我在上海打了一辆滴滴去机场。"}]},{"partOfSpeech":"n.","definition":{"en":"(Noun, informal; used in some South Asian families) An older sister; a respectful way to address an older girl or woman.","zh":"（名词，非正式；部分南亚家庭用语）姐姐；对年长女性/女孩的一种尊称。"},"examples":[{"en":"Didi, can you help me with my homework?","zh":"姐姐，你能帮我写作业吗？"},{"en":"People in the neighborhood call her “Didi” out of respect.","zh":"邻里的人出于尊重会叫她“Didi”。"}]}],"synonyms":["(older sister) sister","(older sister) big sister","(ride-hailing) taxi (general)","(ride-hailing) ride-share (general)"],"phonetic":"/ˈdiːdi/","extraExplanation":["“Didi”在不同文化里含义差异很大：在南亚语境（尤其是印地语/孟加拉语等）常用来称呼“姐姐”；在中文语境里，多数人首先想到“滴滴出行（DiDi）”。如果你告诉我你看到它的句子或国家/地区语境，我可以更精确地解释。"]}
{"word":"didicoy","summary":{"en":"“didicoy” isn’t recognized as a standard English word; please share context so I can identify or correct it.","zh":"“didicoy”不是常见的标准英语词；请提供语境以便我判断它的含义或正确拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username/proper name, or a word from another language.","zh":"不是标准英语单词。可能是拼写错误、用户名/专有名词，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “didicoy” in an English dictionary—could you share a sentence with it?","zh":"我在英语词典里找不到“didicoy”——你能提供一个包含它的句子吗？"},{"en":"Is “didicoy” the name of a person, a place, or a brand?","zh":"“didicoy”是人名、地名还是品牌名？"}]}],"phonetic":"/ˈdɪdɪkɔɪ/","extraExplanation":["你可以告诉我它出现的语境（例如一句话、截图、你在哪看到的、想表达什么），我就能更准确判断：\n1）是否是拼写错误（常见需要对照的词有 didactic / diddly / decoy 等）；\n2）是否是人名/网名（这类通常没有固定词典释义）；\n3）是否来自其他语言或方言（不同语言的发音和含义会完全不同）。"]}
{"word":"Dididae","summary":{"en":"Dididae is the scientific name for the extinct bird family that included the dodo.","zh":"Dididae 是“渡渡鸟科”的科学名称，指包含渡渡鸟在内的一类已灭绝鸟类家族。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a biological family of extinct, flightless birds that included the dodo (Raphus cucullatus) and the Rodrigues solitaire; native to islands in the Indian Ocean.","zh":"（生物分类）渡渡鸟科：一类已灭绝的不会飞的鸟类家族，包括渡渡鸟（dodo）和罗德里格斯渡渡鸟/独行鸟等，原产于印度洋岛屿。"},"examples":[{"en":"The dodo belonged to the family Dididae.","zh":"渡渡鸟属于渡渡鸟科（Dididae）。"},{"en":"Scientists study Dididae to understand how island animals can go extinct quickly.","zh":"科学家研究渡渡鸟科（Dididae），以了解岛屿动物为何可能迅速灭绝。"}]}],"synonyms":["the dodo family"],"phonetic":"/ˈdɪdɪdiː/","extraExplanation":["“Dididae”是拉丁化的科学名称（科名）。在生物分类中，“-idae”常用来表示“科”，例如猫科 Felidae、犬科 Canidae。","“Dididae”在日常英语里较少出现，更常见的说法是“the dodo family”（渡渡鸟科）或直接说“the dodo”（渡渡鸟）。"]}
{"word":"dididae","summary":{"en":"Dididae is the scientific family name for the extinct birds that included the dodo.","zh":"Dididae 是包含渡渡鸟在内的一科已灭绝鸟类的科学（分类学）名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of extinct flightless birds that included the dodo and its close relatives (used in scientific classification).","zh":"（生物分类）渡渡鸟科：已灭绝的一科不会飞的鸟类，包括渡渡鸟及其近亲。"},"examples":[{"en":"The dodo is classified in the family Dididae.","zh":"渡渡鸟被归入渡渡鸟科（Dididae）。"},{"en":"Scientists study Dididae to understand island evolution and extinction.","zh":"科学家研究渡渡鸟科，以理解岛屿演化与物种灭绝。"}]}],"synonyms":["dodo family"],"phonetic":"/ˈdɪdɪˌdiː/","extraExplanation":["“Dididae”是拉丁化的生物分类名称（科名），常见于学术文章、博物馆说明牌或科普书中；日常英语里更常说“the dodo”或“dodo family”。","这类名称通常首字母大写（Dididae），表示一个“科”。如果写成小写 dididae，多半是非正式写法或输入时未遵循分类学大小写习惯。"]}
{"word":"didie","summary":{"en":"“didie” isn’t a standard English word; it’s most likely “did die” (emphasizing that someone actually died).","zh":"“didie”不是标准英语词；最可能是“did die”，用于强调“确实去世/死了”。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Likely a typo) “did die” = the simple past of “die,” used for emphasis or clarification that someone actually died.","zh":"（很可能是拼写/分词错误）“did die”是动词“die（死亡）”的过去式表达，常用于强调或澄清“确实死了”。"},"examples":[{"en":"He didn’t disappear—he did die in the accident.","zh":"他不是失踪了——他确实在事故中去世了。"},{"en":"Some people thought the character survived, but she did die at the end.","zh":"有些人以为那个角色活下来了，但她最后确实死了。"}]}],"synonyms":["passed away (euphemistic)","died (neutral)","perished (formal)"],"phonetic":"/dɪd daɪ/","extraExplanation":["“didie”本身不是常见的英语单词。最常见的情况是把两个词连在一起了：did die（确实死了）。","如果你想表达的是别的意思，也可能是拼错了：例如 did I（我是否……）、did he（他是否……），或人名/昵称 Didi。你可以告诉我你想表达的句子，我可以帮你改成正确英文。"]}
{"word":"Didier","summary":{"en":"Didier is most commonly a French male first name; it can also be a surname.","zh":"Didier 最常见的是法语男性名；也可以作为姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a French male given name (first name), also used in some other French-speaking regions","zh":"一个法语男性名字（名），也常见于其他法语地区"},"examples":[{"en":"Didier is a common first name in France.","zh":"Didier 是法国比较常见的男性名字。"},{"en":"My neighbor Didier speaks both French and English.","zh":"我的邻居 Didier 会说法语和英语。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname), especially in French-speaking contexts","zh":"一个姓氏，尤其常见于法语语境"},"examples":[{"en":"Her last name is Didier.","zh":"她姓 Didier。"}]}],"phonetic":"/ˈdi.di.eɪ/","extraExplanation":["Didier 主要源自拉丁语名字 Desiderius，常被解释为“渴望、期盼”的意思（与 desire 有共同词源）。","文化联想：一些知名人物使用 Didier 作为名字，例如法国前足球运动员 Didier Deschamps。"]}
{"word":"didies","summary":{"en":"“diddies” is an informal, often Scottish/UK childish word most commonly meaning breasts/nipples; in some places it can also mean baby bottles or pacifiers.","zh":"“diddies”是非正式、常见于苏格兰/英国的儿童用语，最常指乳房/乳头；在少数地区也可指奶瓶或安抚奶嘴。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, childish or slang; chiefly Scottish/UK) breasts; nipples (especially used when talking to or about small children).","zh":"（非正式、儿童用语或俚语；多见于苏格兰/英国）乳房；乳头（常用于和小孩说话或谈到小孩时）。"},"examples":[{"en":"The toddler giggled and yelled, “My diddies!”","zh":"小宝宝咯咯笑着喊：“我的胸胸！”"},{"en":"In some Scottish families, “diddies” is a joking, childish word for breasts.","zh":"在一些苏格兰家庭里，“diddies”是指乳房的玩笑式儿童说法。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang, less common) baby bottles or pacifiers (usage varies by region).","zh":"（俚语，较少见）奶瓶或安抚奶嘴（不同地区用法不一）。"},"examples":[{"en":"He won’t settle without his diddies.","zh":"没有他的奶瓶/安抚奶嘴，他就安静不下来。"}]}],"synonyms":["boobs (slang)","breasts","nipples","bottle (regional)","pacifier/dummy (regional)"],"phonetic":"ˈdɪdiz","extraExplanation":["“diddies”属于非常口语、带地区色彩的词。在正式场合或对不熟悉的人谈身体时不建议使用，可能显得粗俗或冒犯。","如果你看到的是“Diddy’s”，那通常是专有名词 Diddy（人名/艺名）的所有格，意思是“Diddy 的……”，并不是这个俚语词。"]}
{"word":"didine","summary":{"en":"“Didine” is mainly used as a personal name or nickname, not a common English word with a fixed dictionary meaning.","zh":"“Didine”主要用作人名或昵称，并非英语里有固定词义的常用词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name or nickname (not a standard English vocabulary word); often used as a personal name in some French‑speaking or multicultural communities","zh":"人名/昵称（不是标准英语词汇）；在一些法语圈或多元文化社群中常见作名字或昵称"},"examples":[{"en":"Didine is my aunt’s nickname in our family.","zh":"Didine 是我阿姨在家里的昵称。"},{"en":"Please ask Didine to call me back when she’s free.","zh":"请 Didine 有空时回我电话。"}]}],"synonyms":["(as a nickname) Didi"],"phonetic":"/diˈdin/","extraExplanation":["“Didine”通常被当作昵称或小名使用，更多见于法语语境（有时是对以 Di- 开头名字的亲昵称呼），而不是英语里有固定词义的普通名词。","作为人名时，拼写和读音可能因地区与个人习惯而不同；在正式英文写作中一般保留原拼写，并按对方偏好的读法称呼。"]}
{"word":"Didinium","summary":{"en":"Didinium is a genus of microscopic freshwater ciliates, well known for preying on other protozoa (especially Paramecium).","zh":"Didinium（滴虫属）是淡水中的一类微小纤毛原生动物属，以捕食其他原生动物（尤其草履虫）而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of microscopic, single-celled freshwater organisms (ciliated protozoans) that often prey on other protozoa such as Paramecium","zh":"滴虫属：一种生活在淡水中的微小单细胞生物（纤毛原生动物）属，常捕食其他原生动物，如草履虫"},"examples":[{"en":"In many biology labs, Didinium is used to demonstrate predator–prey interactions with Paramecium.","zh":"在许多生物实验中，会用滴虫属和草履虫来演示捕食者—猎物关系。"},{"en":"Under the microscope, Didinium looks like a tiny oval cell covered with short hair-like cilia.","zh":"在显微镜下，滴虫属看起来像一个小小的椭圆细胞，表面覆盖着短短的纤毛。"}]}],"synonyms":["predatory ciliate","ciliate protozoan"],"phonetic":"/dɪˈdɪniəm/","extraExplanation":["“Didinium”是一个属名（genus name），首字母通常大写并使用斜体：Didinium。常见物种如 Didinium nasutum。","它经常出现在生态学与演化生物学的经典例子中，用来说明捕食会如何影响猎物数量，以及系统会出现波动（population cycles）。","发音里重音一般落在第二个音节：di-DIN-ium。"]}
{"word":"didinium","summary":{"en":"Didinium is a genus of microscopic freshwater ciliates known for preying on other protozoa, especially Paramecium.","zh":"Didinium（袋形虫属）是一类微小的淡水纤毛虫，以捕食其他原生动物（尤其草履虫）而著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of single-celled freshwater ciliates (microscopic protists) that often prey on other protozoa, especially Paramecium.","zh":"一种淡水纤毛虫（单细胞原生生物）的属，常捕食其他原生动物，尤其是草履虫（Paramecium）。"},"examples":[{"en":"In the lab, we observed Didinium hunting Paramecium under a microscope.","zh":"在实验室里，我们在显微镜下观察到袋形虫（Didinium）捕食草履虫。"},{"en":"Didinium is often used in ecology lessons to show predator–prey interactions.","zh":"袋形虫常用于生态学课程中，用来展示捕食者—猎物的相互作用。"}]}],"synonyms":["ciliate (general term)","protozoan (general term)","protist (general term)"],"phonetic":"/daɪˈdɪniəm/","extraExplanation":["“Didinium”是生物分类学中的属名，通常首字母大写并用斜体（Didinium）。常见物种如 Didinium nasutum。","它因“追捕并吞噬草履虫”的行为而常出现在生态学与种群动态（如捕食—被捕食模型）的教学与实验中。"]}
{"word":"didle","summary":{"en":"Diddle usually means to cheat someone (often out of money) or, more casually, to waste time/mess around.","zh":"Diddle 通常指“欺骗/骗钱”，也可口语化表示“磨蹭、瞎混”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to cheat someone (especially to take money from them) by tricking them","zh":"欺骗（尤指骗钱）；诈骗"},"examples":[{"en":"He was accused of diddling customers out of their savings.","zh":"他被指控骗走顾客的积蓄。"},{"en":"The email tried to diddle people into giving their bank details.","zh":"那封邮件试图骗别人提供银行信息。"}]},{"partOfSpeech":"v.","definition":{"en":"to waste time or behave in a playful, not-serious way; to mess around","zh":"浪费时间；瞎混；玩闹（不认真）"},"examples":[{"en":"Stop diddling around and finish your homework.","zh":"别再瞎磨蹭了，把作业写完。"},{"en":"They spent the afternoon diddling with the settings instead of starting the project.","zh":"他们一下午都在摆弄设置，反而没开始项目。"}]},{"partOfSpeech":"n.","definition":{"en":"a trick or a small act of cheating (less common)","zh":"小把戏；小骗局（较少用）"},"examples":[{"en":"It was just a diddle to get an extra discount.","zh":"那只是为了多拿点折扣的小把戏。"}]}],"synonyms":["cheat","swindle","scam","defraud","trick","mess around","dawdle"],"phonetic":"/ˈdɪdəl/","extraExplanation":["你输入的“didle”更常见是拼写错误，标准拼写通常是“diddle”。","“diddle”语气较口语、带一点调侃色彩；在正式写作中表达“诈骗”更常用“scam / defraud”。","常见搭配：diddle someone out of money（把某人的钱骗走）；diddle around/about（瞎混、磨蹭）。另外“diddling with …”可表示“摆弄/反复调试……”。","文学与文化：19世纪作家狄更斯（Charles Dickens）和爱伦·坡（Edgar Allan Poe）等作品中都出现过“diddle/ diddle someone”，多用来描写小骗术或狡猾行为，带有讽刺意味。"]}
{"word":"didler","summary":{"en":"“Didler” is likely a misspelling of “diddler,” meaning either (offensively) a child sexual abuser or (informally) a swindler.","zh":"“didler”多半是“diddler”的拼写错误，可指（冒犯性）性侵儿童者，或（非正式）骗子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(slang, offensive) A person who sexually abuses children; a child molester.","zh":"（俚语，冒犯性）性侵儿童的人；恋童癖／儿童性犯罪者。"},"examples":[{"en":"The police arrested him on suspicion of being a child molester.","zh":"警方以涉嫌性侵儿童逮捕了他。"},{"en":"News reports avoided the slang term and used “child sexual abuser” instead.","zh":"新闻报道避免使用俚语，而改用“儿童性侵者”等更正式的说法。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) A person who cheats or tricks others, especially for money; a swindler.","zh":"（非正式）骗钱或欺骗他人的人；骗子。"},"examples":[{"en":"He turned out to be a swindler who sold fake tickets online.","zh":"他后来被发现是个在网上卖假票的骗子。"},{"en":"Don’t trust him—people say he’s a cheat.","zh":"别信他——大家都说他是个骗子。"}]}],"synonyms":["swindler","cheat","con artist","scammer","child molester"],"phonetic":"/ˈdɪd.lɚ/","extraExplanation":["你输入的“didler”在英文里不常见；更常见的拼写是 **diddler**。","其中“指性侵儿童的人”的用法带有强烈侮辱性和敏感性；在正式语境（新闻、法律、学校）更推荐用 **child sexual abuser / child molester** 等更准确、较中性的表达。"]}
{"word":"Didlove","summary":{"en":"“Did love” means “really/indeed loved” (emphasis) or it’s the normal simple-past form used in questions/negatives.","zh":"“did love”可以表示“确实爱过/喜欢过”（强调），也用于一般过去时的疑问句和否定句。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(emphatic past) used to strongly say that someone truly loved someone/something in the past, often to correct doubt or contrast with another idea.","zh":"（强调过去）用于强调过去确实爱过/喜欢过，常用来反驳怀疑或与其他情况形成对比。"},"examples":[{"en":"I did love him, but I wasn’t ready to get married.","zh":"我确实爱过他，但我当时还没准备好结婚。"},{"en":"She did love the job—she just needed a break.","zh":"她确实喜欢那份工作——只是需要休息一下。"}]},{"partOfSpeech":"phrase","definition":{"en":"used in questions and negatives in the simple past with “love.”","zh":"用于一般过去时的疑问句和否定句中（与 love 搭配）。"},"examples":[{"en":"Did you love living in New York?","zh":"你喜欢（当时）住在纽约吗？"},{"en":"I didn’t love the movie, but the music was great.","zh":"我不太喜欢那部电影，但音乐很棒。"}]}],"synonyms":["really loved","truly loved","indeed loved"],"phonetic":"/dɪd lʌv/","extraExplanation":["“did love”是英语里的“do-support（do/did强调或构成疑问否定）”。在肯定句里用“did”通常是为了强调：表示“确实/真的”。在否定句和疑问句里，“did”是语法需要：didn’t love / Did you love…?","如果你输入的“Didlove”是人名、网名或品牌名，也可能不是英语词汇；你可以告诉我你看到它的句子，我可以按语境解释。"]}
{"word":"didn","summary":{"en":"“didn’t” means “did not,” used to talk about something that did not happen in the past.","zh":"“didn’t”是“did not”的缩写，用来表达过去没有发生的事情。"},"definitions":[{"partOfSpeech":"aux.","definition":{"en":"(contraction) Short form of “did not”; used to make the simple past negative.","zh":"（缩写）“did not”的口语缩写；用于构成一般过去时的否定。"},"examples":[{"en":"I didn’t see your message yesterday.","zh":"我昨天没看到你的消息。"},{"en":"They didn’t go to the party because they were tired.","zh":"他们没去派对，因为太累了。"},{"en":"She didn’t call, so I got worried.","zh":"她没打电话，所以我有点担心。"}]},{"partOfSpeech":"aux.","definition":{"en":"Used in negative questions or short answers about the past.","zh":"用于过去时的否定疑问句或简短回答。"},"examples":[{"en":"Didn’t you hear the announcement?","zh":"你没听到通知吗？"},{"en":"—Did you finish it? —No, I didn’t.","zh":"——你完成了吗？——不，我没有。"}]}],"synonyms":["did not"],"phonetic":"/ˈdɪd(ə)nt/","extraExplanation":["“didn”通常是把“didn’t”打字打到一半，正确拼写一般要加撇号：didn’t。","口语里“didn’t”常读得很快，t 可能很轻或几乎不发音，听起来像 /ˈdɪdən/；但书写仍用 didn’t。","在较正式的写作中，常用完整形式“did not”来显得更正式、更清晰。"]}
{"word":"didna","summary":{"en":"“didna” is a Scots informal form meaning “didn’t / did not,” and it can also be used like “didn’t I?” in questions.","zh":"“didna”是苏格兰英语里的非正式说法，意思是“didn’t / did not（没做）”，在疑问句里也常相当于“didn’t I?（我不是……吗？）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Scots / informal) A contraction of “did not,” meaning “didn’t.”","zh":"（苏格兰英语 / 非正式）“did not”的缩写，意思是“没有做；不曾”。"},"examples":[{"en":"I didna see him at the station.","zh":"我在车站没看见他。"},{"en":"She didna mean to hurt your feelings.","zh":"她不是故意要伤你的感情。"}]},{"partOfSpeech":"other","definition":{"en":"(Scots / informal, in questions) Often used like “didn’t I?” to check or confirm something.","zh":"（苏格兰英语 / 非正式，用于疑问句）常相当于“didn’t I?”，用来确认“我不是……吗？/ 我难道没……吗？”。"},"examples":[{"en":"I told you already, didna I?","zh":"我不是已经告诉过你了吗？"},{"en":"I paid last time, didna I?","zh":"上次不是我付的钱吗？"}]}],"synonyms":["didn’t","did not"],"phonetic":"ˈdɪdnə","extraExplanation":["“didna”里的“-na”是否定后缀，是苏格兰英语（Scots）和部分苏格兰口音英语里常见的否定形式：比如 canna (= cannot), donna (= don’t), winna (= will not)。","这种写法常用于表现口语、地方口音与人物性格，在苏格兰题材的小说、诗歌或对白中很常见。写正式英文时一般用 “didn’t”。"]}
{"word":"didnt","summary":{"en":"“Didn’t” means “did not,” used for past-tense negatives and negative questions.","zh":"“didn’t”是“did not”的缩写，用于一般过去时的否定以及否定疑问句。"},"definitions":[{"partOfSpeech":"aux.","definition":{"en":"A contraction of “did not,” used to make the past simple negative or to form negative questions.","zh":"“did not”的缩写，用于构成一般过去时的否定句或否定疑问句。"},"examples":[{"en":"I didn’t see your message yesterday.","zh":"我昨天没看到你的消息。"},{"en":"She didn’t go to school because she was sick.","zh":"她因为生病没去上学。"},{"en":"Why didn’t you tell me earlier?","zh":"你为什么不早点告诉我？"}]}],"synonyms":["did not"],"phonetic":"/ˈdɪd(ə)nt/","extraExplanation":["“didn’t”常见于口语和非正式写作；正式写作（如论文、正式邮件）里通常写全称“did not”。","用“didn’t”时，后面的动词用原形：didn’t + base verb（例如 didn’t go / didn’t know），而不是用过去式（不要说 *didn’t went）。","在疑问句里常见结构：Did + 主语 + 动词原形...? 否定形式是：Why didn’t + 主语 + 动词原形...?"]}
{"word":"Dido","summary":{"en":"Dido is the famous legendary Queen of Carthage from *The Aeneid*; informally (often “cut a dido”), it can also mean a prank or silly mischief.","zh":"Dido（狄多）是《埃涅阿斯纪》中著名的迦太基女王；在非正式用法（常见于“cut a dido”）中，也可指恶作剧或胡闹。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A legendary queen of Carthage in ancient North Africa, best known from Virgil’s epic poem *The Aeneid*.","zh":"（狄多）传说中的迦太基女王（北非古国），最著名的形象来自维吉尔史诗《埃涅阿斯纪》。"},"examples":[{"en":"In *The Aeneid*, Dido falls in love with Aeneas.","zh":"在《埃涅阿斯纪》中，狄多爱上了埃涅阿斯。"},{"en":"Some operas and paintings portray Dido as a tragic heroine.","zh":"一些歌剧和绘画把狄多描绘成悲剧性的女主角。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, usually in the phrase “cut a dido”) A silly or mischievous act; a prank.","zh":"（非正式，常用于短语“cut a dido”）胡闹的举动；恶作剧。"},"examples":[{"en":"The kids cut a dido by hiding his keys.","zh":"孩子们把他的钥匙藏起来，搞了个恶作剧。"},{"en":"Don’t cut a dido during the meeting—stay professional.","zh":"开会时别胡闹——要专业一点。"}]}],"synonyms":["prank","antic","caper"],"phonetic":"/ˈdaɪdoʊ/","extraExplanation":["“Dido”在英语文化中常与古典文学联系最紧密：维吉尔《埃涅阿斯纪》里，她收留特洛伊英雄埃涅阿斯并与之相恋，后来因对方离开而走向悲剧结局。因此在文学与艺术里，“Dido”常象征热烈、悲恋与宿命。","音乐里最知名的相关作品之一是英国作曲家亨利·珀塞尔的歌剧《Dido and Aeneas》，其中的哀歌（Dido’s Lament）非常著名。","口语义“cut a dido”带有旧式、英式色彩，现代美式英语里不算常见；更常用的说法是 “play a prank / mess around / act up”。"]}
{"word":"dido","summary":{"en":"Dido usually means a prank or playful mischief (often “didoes”). It can also be a name, especially the legendary Queen Dido of Carthage.","zh":"dido 通常指“恶作剧、胡闹”（常用复数 didoes）；也可作人名，尤其指传说中的迦太基狄多女王。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a silly trick, prank, or playful mischief (often in the plural: “didoes”)","zh":"恶作剧；胡闹；顽皮的行为（常用复数 didoes）"},"examples":[{"en":"The kids were doing didoes in the backyard and laughing loudly.","zh":"孩子们在后院胡闹，笑得很大声。"},{"en":"No more didoes in the office—let’s keep it professional.","zh":"办公室里别再恶作剧了——我们得保持专业。"}]},{"partOfSpeech":"n.","definition":{"en":"Dido: a female given name; also the name of a legendary queen of Carthage in Roman literature","zh":"狄多：女性名字；也指罗马文学中迦太基的传奇女王"},"examples":[{"en":"In Virgil’s Aeneid, Dido is the queen who falls in love with Aeneas.","zh":"在维吉尔的《埃涅阿斯纪》中，狄多是爱上埃涅阿斯的女王。"}]}],"synonyms":["prank","antics","mischief","shenanigans"],"phonetic":"/ˈdaɪdoʊ/","extraExplanation":["“dido(es)”表示“恶作剧/胡闹”时，语气通常偏幽默或带点责备，多见于较口语或较旧式的英语。","这个词可能与“Dido（狄多女王）”的名字有关：早期英语里人们用她的名字来指代“胡来、闹腾”，后来逐渐固定为“顽皮的把戏”。","文学背景：狄多女王的故事最有名的版本出自维吉尔《埃涅阿斯纪》（Aeneid），在西方文化中常象征强烈的爱情与悲剧命运。"]}
{"word":"didodecahedral","summary":{"en":"Didodecahedral means having the form of a didodecahedron, often a rhombic dodecahedron with 12 rhombus faces.","zh":"didodecahedral 指具有二十二面体（常指菱形十二面体、12个菱形面）形状的；多用于几何与晶体学描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape of, or relating to, a didodecahedron (often a rhombic dodecahedron: a solid with 12 rhombus-shaped faces).","zh":"呈现“二十二面体”的形状，或与其有关（在晶体学中常指“菱形十二面体”：由12个菱形面组成的立体）。"},"examples":[{"en":"Some garnet crystals are described as didodecahedral because they form a rhombic dodecahedron.","zh":"有些石榴子石晶体被称为 didodecahedral，因为它们呈菱形十二面体的外形。"},{"en":"The mineral showed a didodecahedral habit with smooth, shiny faces.","zh":"这种矿物呈现 didodecahedral 的晶形，表面平滑而有光泽。"}]}],"synonyms":["rhombic dodecahedral","dodecahedral (general)"],"phonetic":"/ˌdaɪˌdoʊdɛkəˈhiːdrəl/","extraExplanation":["这个词主要见于几何学与矿物学/晶体学语境。“dido-”可理解为“二重/双重”的构词成分；历史上“didodecahedron”常用来指一种由12个菱形面组成的晶体外形（也常叫 rhombic dodecahedron）。日常英语很少用到，更多出现在专业描述里。"]}
{"word":"didodecahedron","summary":{"en":"A rare term for a twelve-faced solid, often a variant/misspelling of “dodecahedron.”","zh":"一种罕见用法，指十二个面的立体，常是 “dodecahedron（十二面体）” 的变体拼写或误拼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/technical) A polyhedron with twelve faces; often used as a variant or misspelling of “dodecahedron.”","zh":"（罕见/术语）有十二个面的多面体；常被当作 “dodecahedron（十二面体）” 的变体拼写或误拼。"},"examples":[{"en":"In geometry, a dodecahedron is a solid with 12 faces; “didodecahedron” is sometimes seen as a variant spelling.","zh":"在几何学中，dodecahedron 是一种有 12 个面的立体；“didodecahedron” 有时会被看到作为变体拼写。"},{"en":"The model looked like a dodecahedron, with twelve flat pentagon faces.","zh":"这个模型看起来像一个十二面体，有十二个平坦的五边形面。"}]}],"synonyms":["dodecahedron","twelve-faced polyhedron"],"phonetic":"ˌdaɪdoʊˌdɛkəˈhiːdrən","extraExplanation":["“dodecahedron”来自希腊语：dōdeka（十二）+ hedra（面/座）。标准写法通常是 dodecahedron；“didodecahedron”在现代英语里不常见，很多情况下是拼写混淆或旧资料/小众领域用法。","如果你是在矿物学/晶体学资料里看到这个词，可能指某种“十二面体”的晶形（即具有12个面的外形）。建议结合上下文确认是否就是 dodecahedron。"]}
{"word":"didoes","summary":{"en":"“Didoes” means playful pranks or mischievous antics (a less common, slightly old-fashioned word).","zh":"“didoes”指顽皮的恶作剧或胡闹（不太常用，略带旧式/幽默语气）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"playful or mischievous actions; pranks; silly tricks (plural of “dido”).","zh":"顽皮或淘气的举动；恶作剧；胡闹（“dido”的复数）。"},"examples":[{"en":"The kids’ didoes kept the whole family laughing during the trip.","zh":"孩子们的恶作剧让全家在旅途中一直笑个不停。"},{"en":"He apologized for his didoes at the party.","zh":"他为自己在派对上的胡闹道了歉。"}]}],"synonyms":["antics","pranks","shenanigans","mischief"],"phonetic":"/ˈdaɪdoʊz/","extraExplanation":["“dido”/“didoes”在现代英语里不算常用，带一点幽默、偏旧式的感觉，常用来轻描淡写地说“捣蛋”“胡闹”。","日常更常见的替代表达有：antics（闹剧/胡闹）、pranks（恶作剧）、shenanigans（小把戏/胡闹，语气更口语）。"]}
{"word":"didonai","summary":{"en":"“didonai” likely represents spoken “didn’t I,” a tag question meaning “did I not…?” used to confirm something.","zh":"“didonai”很可能是口语连读的“didn’t I”，用于句末确认，表示“我难道没有……吗？”/“对吧？”"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Informal/fast speech; often written as “didn’t I”) Used at the end of a sentence to confirm that what you said is true, meaning “did I not…?”","zh":"（非正式／口语连读；常写作“didn’t I”）放在句末用来确认自己说的话是否属实，意思是“我难道没有……吗？”/“我不是……吗？”"},"examples":[{"en":"I told you it would rain, didn’t I?","zh":"我跟你说过会下雨的，对吧？"},{"en":"I already sent the email, didn’t I?","zh":"我已经把邮件发出去了，不是吗？"},{"en":"We met last year, didn’t we? (Similar pattern)","zh":"我们去年见过面，对吧？（同类句型）"}]}],"synonyms":["did I not","right","isn’t that so"],"phonetic":"/ˈdɪdənt aɪ/","extraExplanation":["“didonai”不是标准英文拼写；它很像把“didn’t I”快速连读后的听写（也可理解为口语里把 t 省略/弱化，听起来更像“did-nai / did’n I”）。","用法要点：这是“附加疑问句（tag question）”。主句是肯定时，后面常用否定疑问（…didn’t I?）；主句是否定时，后面通常用肯定疑问（…did I?）。语气上可表示确认、提醒，有时也带一点“我早就说过”的意味。"]}
{"word":"didonia","summary":{"en":"Didonia is a literary/classical name for Dido, the legendary queen of Carthage.","zh":"Didonia 是狄多（迦太基传说女王）的文学/古典别称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper name) Another name for Dido, the legendary queen and founder of Carthage in ancient North Africa (also connected with the love story in Virgil’s *Aeneid*).","zh":"（专有名词）狄多的另一种称呼：传说中的迦太基女王与建立者（也因维吉尔《埃涅阿斯纪》中的爱情故事而闻名）。"},"examples":[{"en":"In some texts, Didonia is used as another name for Queen Dido of Carthage.","zh":"在一些文本中，Didonia 被用作迦太基狄多女王的别称。"},{"en":"Virgil’s *Aeneid* tells the tragic story of Didonia (Dido) and Aeneas.","zh":"维吉尔的《埃涅阿斯纪》讲述了 Didonia（狄多）与埃涅阿斯的悲剧故事。"}]}],"synonyms":["Dido","Elissa"],"phonetic":"/dɪˈdoʊniə/","extraExplanation":["Didonia 多见于文学或古典语境，属于“狄多（Dido）”这一人物名的另一种写法/称呼。狄多也常被称为 Elissa（伊丽莎）。","在英语里更常见的形式是 Dido；Didonia 偶尔用于诗歌、史诗或带有拉丁风格的改写中，用来增强古典气息。"]}
{"word":"didos","summary":{"en":"“Didos” can mean (1) pranks/mischief (informal) or (2) the plural of “Dido,” a female name and the legendary Queen of Carthage.","zh":"“didos”可指（1）恶作剧/胡闹（非正式），也可指（2）“Dido（狄多）”的复数：女性名字或迦太基传奇女王。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a prank, silly trick, or piece of playful mischief; sometimes also noisy, excited activity","zh":"恶作剧；胡闹；（有时指）吵闹、兴奋的折腾"},"examples":[{"en":"The kids were up to their usual didos after dinner.","zh":"晚饭后孩子们又开始像平常一样胡闹了。"},{"en":"We heard a lot of didos in the hallway, so the teacher went to check.","zh":"我们听到走廊里一阵吵闹折腾，于是老师过去查看。"}]},{"partOfSpeech":"n.","definition":{"en":"Dido (plural: Didos): a female given name; also the legendary Queen of Carthage in Roman literature","zh":"狄多（复数 Didos）：女性名字；也指罗马文学中迦太基的传奇女王狄多"},"examples":[{"en":"In Virgil’s Aeneid, Dido is the queen of Carthage.","zh":"在维吉尔的《埃涅阿斯纪》中，狄多是迦太基女王。"},{"en":"Dido is also the stage name of an English singer.","zh":"Dido 也是一位英国歌手的艺名。"}]}],"synonyms":["pranks","mischief","antics","shenanigans"],"phonetic":"ˈdaɪdoʊ","extraExplanation":["“dido”表示“恶作剧/胡闹”时偏非正式，用法较口语化，在现代英语里不算特别常见，但在故事、回忆录或带幽默感的叙述中会出现。","文学中的狄多（Dido）最著名的来源之一是古罗马诗人维吉尔的史诗《Aeneid（埃涅阿斯纪）》：她与特洛伊英雄埃涅阿斯的故事在西方文化中影响很大。"]}
{"word":"didrachm","summary":{"en":"A didrachm is an ancient Greek coin worth two drachmas, and sometimes also refers to a related ancient unit of weight; it can appear in Bible-related contexts as a “two-drachma” coin.","zh":"didrachm 指古希腊面值为“两德拉克马”的钱币；有时也指相关的古希腊重量单位，并可在圣经语境中作为“二德拉克马”钱币出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient Greek silver coin worth two drachmas; also used as a monetary term in the eastern Mediterranean in classical and later periods.","zh":"（古希腊）第得拉克马银币；面值为“两德拉克马”，也可作古代地中海东部地区的货币称呼。"},"examples":[{"en":"The museum displayed a didrachm from ancient Athens.","zh":"博物馆展出了一枚来自古雅典的第得拉克马银币。"},{"en":"Collectors value some didrachms for their detailed portraits and inscriptions.","zh":"收藏家重视某些第得拉克马，因为它们的人像和铭文细节精美。"}]},{"partOfSpeech":"n.","definition":{"en":"A unit of weight in the ancient Greek system, roughly equivalent to a half-stater in some contexts (exact value varied by region and period).","zh":"（古希腊）一种重量单位；在某些语境中大致相当于半个斯塔特（stater），但各地与不同时期数值有差异。"},"examples":[{"en":"Ancient sources sometimes use didrachm as a weight as well as a coin name.","zh":"古代文献有时把 didrachm 既当作币名，也当作重量单位使用。"}]},{"partOfSpeech":"n.","definition":{"en":"(Biblical/Christian context) The “two-drachma” coin mentioned in some English Bible translations in connection with the temple tax.","zh":"（《圣经》/基督教语境）一些英文译本中提到的“二德拉克马”钱币，常与圣殿税（temple tax）相关。"},"examples":[{"en":"In some translations, a didrachm is mentioned in discussions of the temple tax.","zh":"在一些译本中，谈到圣殿税时会提及 didrachm（两德拉克马钱币）。"}]}],"synonyms":["two-drachma coin","didrachmon"],"phonetic":"/ˈdaɪˌdrækəm/","extraExplanation":["词源来自希腊语：di-（二）+ drachmē（德拉克马）。因此 didrachm 字面意思就是“两个德拉克马”。","在钱币学与古史阅读中，didrachm 常用于描述特定城邦或地区铸造的银币类型；由于不同城邦的重量标准不完全一致，遇到具体数值时最好结合年代与铸造地查证。"]}
{"word":"didrachma","summary":{"en":"A didrachma is an ancient Greek coin (or silver weight) equal to two drachmas.","zh":"didrachma 指等于两德拉克马的古希腊银币（也可指相应的银重量）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an ancient Greek coin worth two drachmas; also a weight of silver of the same value","zh":"（古希腊）双德拉克马银币；也指等值的银重量（约为两德拉克马）"},"examples":[{"en":"The museum displayed a didrachma from Athens dating to the 5th century BCE.","zh":"博物馆展出了一枚可追溯到公元前5世纪的雅典双德拉克马银币。"},{"en":"Collectors value this didrachma for its clear owl design.","zh":"收藏家重视这枚双德拉克马银币，因为它的猫头鹰图案很清晰。"}]}],"synonyms":["drachma","ancient Greek coin","Greek silver coin"],"phonetic":"/daɪˈdræk.mə/","extraExplanation":["“didrachma”来自希腊语：di- 表示“两倍/双”，drachma 指“德拉克马”。因此字面意思就是“两个德拉克马”。","在古希腊城邦中，不同地区铸币样式各异；同名币种可能因城市与时代不同而在重量标准上略有差别。","在英语历史与考古语境里，这个词多用于钱币学（numismatics）、博物馆说明或古代经济史文章中。"]}
{"word":"didrachmal","summary":{"en":"“Didrachmal” means “connected with a didrachm,” an ancient Greek coin worth two drachmas.","zh":"“didrachmal”指“与二德拉克马银币有关的”，即价值两德拉克马的古希腊钱币。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a didrachm (an ancient Greek silver coin worth two drachmas).","zh":"与“二德拉克马银币”（古希腊一种价值为两德拉克马的银币）有关的；二德拉克马的。"},"examples":[{"en":"The museum displayed a didrachmal coin from ancient Greece.","zh":"博物馆展出了一枚来自古希腊的二德拉克马银币。"},{"en":"A didrachmal payment could cover a modest purchase in some city-states.","zh":"在一些城邦里，付二德拉克马的钱可以支付一笔不大的购买。"}]}],"synonyms":["didrachmic","didrachm (as an attributive noun, e.g., “didrachm coin”)"],"phonetic":"/daɪˈdræk.məl/","extraExplanation":["“didrachmal”是较少见的学术/钱币学（numismatics）用词，来自“didrachm”（di- 表示“二”，drachm 表示“德拉克马”）。日常英语中更常说“didrachm coin”或直接用“didrachm”。"]}
{"word":"didrachmas","summary":{"en":"Didrachmas are ancient Greek coins worth two drachmas (plural of didrachma).","zh":"Didrachmas 指“didrachma”的复数：古希腊面值为两德拉克马的银币。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A plural form of didrachma: an ancient Greek silver coin worth two drachmas.","zh":"didrachma 的复数：古希腊的银币单位，面值等于两德拉克马。"},"examples":[{"en":"The museum displayed several didrachmas from the Hellenistic period.","zh":"博物馆展出了几枚希腊化时期的 didrachmas（两德拉克马银币）。"},{"en":"In some ancient texts, taxes were paid in didrachmas.","zh":"在一些古代文献中，税款以 didrachmas 支付。"}]}],"synonyms":["two-drachma coins","didrachmae"],"phonetic":"/daɪˈdræk.məz/","extraExplanation":["“didrachma”来自希腊语：di- 表示“二、双”，drachma 指“德拉克马（古希腊货币）”，合起来就是“价值两德拉克马的硬币”。","在英语里它常出现在历史、考古与《圣经》语境中：例如《马太福音》17:24 提到缴“圣殿税”（temple tax）时用到 didrachma（两德拉克马），因此有时会被解释为相当于“两天的工钱”（不同学者换算略有差异）。","复数拼写既可见 didrachmas（英语化复数），也可能见 didrachmae（更“古典化”的拉丁式复数），但现代英语里 didrachmas 更常见。"]}
{"word":"didric","summary":{"en":"Didric is usually a personal name (or surname), a rare spelling related to German Dietrich/Diedrich, meaning “ruler of the people.”","zh":"Didric 通常是人名或姓氏，是较少见的拼写形式，和德语 Dietrich/Diedrich 同源，常被解释为“人民的统治者”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a masculine given name (a less common spelling of Diedrich/Dietrich), originally from German, meaning “ruler of the people.”","zh":"男性名字（较少见的拼写形式，接近 Diedrich/Dietrich），源自德语，含义为“人民的统治者/民众之主”。"},"examples":[{"en":"Didric is a rare spelling, but it’s used as a first name in some families.","zh":"Didric 是一种比较少见的拼写，但有些家庭会用它作名字。"},{"en":"Didric introduced himself and explained how to pronounce his name.","zh":"Didric 介绍了自己，并解释了他的名字怎么读。"}]},{"partOfSpeech":"other","definition":{"en":"a family name (surname) in some communities, often related to the German surname forms Diedrich/Dietrich.","zh":"某些社群中使用的姓氏，常与德语姓氏 Diedrich/Dietrich 等形式有关。"},"examples":[{"en":"I saw the name Didric on the conference attendee list.","zh":"我在会议参会名单上看到了 Didric 这个姓。"}]}],"synonyms":["Dietrich","Diedrich","Diedrick","Dedric"],"phonetic":"/ˈdiːdrɪk/","extraExplanation":["“Didric”本身不是常见的标准英文单词，更常见的是作为人名的拼写变体。它通常与德语名 Dietrich / Diedrich 同源，可追溯到古日耳曼语词根，常被解释为“民众（people）+ 统治者（ruler）”。","如果你是在书里或游戏里看到的拼写“didric”，也可能是作者的自创名或对其他名字（如 Dietrich, Dedric, Diedrick）的变体拼写；在确认含义时，可以结合上下文（人物、地名、品牌名等）。"]}
{"word":"Didrikson","summary":{"en":"Didrikson is a Scandinavian-origin surname; it is also strongly associated with the American multi-sport star Babe Didrikson Zaharias.","zh":"Didrikson 是源自斯堪的纳维亚地区的姓氏；也常让人联想到美国多项运动传奇人物贝比·迪德里克森·扎哈里亚斯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), originally from Scandinavian languages (especially Swedish/Norwegian).","zh":"姓氏（家族名），源自斯堪的纳维亚语系（尤其是瑞典语/挪威语）姓氏。"},"examples":[{"en":"My coach’s last name is Didrikson.","zh":"我教练的姓是 Didrikson。"},{"en":"The article mentioned someone named Didrikson in the results list.","zh":"文章在成绩名单里提到一个叫 Didrikson 的人。"}]},{"partOfSpeech":"n.","definition":{"en":"often refers to Babe Didrikson Zaharias (1911–1956), an American sports legend known for excelling in track and field and later becoming a top professional golfer.","zh":"常用来指“贝比·迪德里克森·扎哈里亚斯”（1911–1956），美国体育传奇人物，先在田径项目中表现卓越，后成为顶尖职业高尔夫球手。"},"examples":[{"en":"Babe Didrikson Zaharias won Olympic medals in 1932.","zh":"贝比·迪德里克森·扎哈里亚斯在1932年获得奥运奖牌。"},{"en":"Didrikson became famous for being great at more than one sport.","zh":"Didrikson 因在不止一项运动上都非常出色而闻名。"}]}],"phonetic":"ˈdɪdrɪksən","extraExplanation":["“Didrikson”这类姓氏常见于北欧移民家庭，英语里多按拼写读音来发音。","历史上最有名的同名人物是 Babe Didrikson Zaharias。她在女性体育发展史上地位很高，经常出现在体育史、传记与纪录片中。"]}
{"word":"didromies","summary":{"en":"Diadromy (plural: diadromies) means a fish’s life-cycle migration between freshwater and the sea.","zh":"Diadromy（复数 diadromies）指鱼类在生命周期中在淡水与海水之间的洄游。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the regular migration of some fish between freshwater and seawater during their life cycle","zh":"（某些鱼类在生命周期中）在淡水与海水之间的规律性洄游"},"examples":[{"en":"Salmon are famous for diadromy, spending part of their lives in the ocean and returning to rivers to reproduce.","zh":"鲑鱼以“跨海淡水洄游”著名：生命的一部分在海洋中度过，繁殖时再回到河流。"},{"en":"Scientists study diadromies to understand how dams affect fish migration routes.","zh":"科学家研究这些洄游现象，以了解水坝如何影响鱼类的迁徙路线。"}]}],"synonyms":["fish migration","migratory behavior","amphidromous migration"],"phonetic":"/daɪˈædrəmi/","extraExplanation":["你输入的“didromies”在英语中不常见；更可能是“diadromies”（diadromy 的复数：diadromy → diadromies）。","diadromy 常用于生物学/生态学语境。相关概念：anadromy（溯河洄游：海→淡水繁殖，如鲑鱼）、catadromy（降河洄游：淡水→海繁殖，如鳗鱼）。"]}
{"word":"didromy","summary":{"en":"“Didromy” is not a standard word; it’s likely a misspelling of “dichromy” or “dichromacy.”","zh":"“didromy”不是标准单词；很可能是“dichromy”或“dichromacy”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “dichromy” (having two colors) or “dichromacy” (a type of color vision with two functioning cone types).","zh":"不是标准英语单词。它很可能是“dichromy”（双色性/两种颜色）或“dichromacy”（双色视；一种只有两类视锥细胞正常工作的色觉）的拼写错误。"},"examples":[{"en":"I couldn’t find “didromy” in a dictionary—did you mean “dichromy” (two colors)?","zh":"我在词典里找不到“didromy”——你是不是想写“dichromy”（双色性/两种颜色）？"},{"en":"Some birds show dichromy, with two distinct color forms in the same species.","zh":"有些鸟类表现出双色性（dichromy），同一物种会出现两种明显的颜色型。"}]}],"synonyms":["dichromy","dichromacy"],"phonetic":"/ˈdaɪkɹəmi/","extraExplanation":["“Dichromy”常用于生物学/生态学语境，描述同一种生物个体或群体中出现两种明显的颜色型（例如两种羽色型）。","如果你想表达“色觉缺陷/色盲的一种”，更常见的术语是“dichromacy”（双色视）。","如果你告诉我它出现的句子或领域（医学、生物、艺术等），我可以帮你确定最可能的正确拼写和含义。"]}
{"word":"didst","summary":{"en":"“Didst” means “did” when speaking to one person as “thou” in old-style English.","zh":"“didst”是古英语/古风英语里对“thou（你）”说的“did（做了）”。"},"definitions":[{"partOfSpeech":"aux.","definition":{"en":"Archaic second-person singular past tense of “do,” used with “thou” (you).","zh":"（古语）“do”的第二人称单数过去式，与“thou”（你）连用。"},"examples":[{"en":"Thou didst see the sign, yet thou didst not speak.","zh":"你看见了那个迹象，却没有开口。"},{"en":"Why didst thou leave so early?","zh":"你为何这么早就离开？"},{"en":"Thou didst promise to return before nightfall.","zh":"你曾答应在天黑前回来。"}]}],"synonyms":["did (modern form)"],"phonetic":"/dɪdst/","extraExplanation":["“didst”主要出现在《圣经》（如《钦定版圣经》）和莎士比亚戏剧等早期现代英语中，用来配合“thou”（主格）和“thee”（宾格）。现代英语里通常用“did”（you did）。","拼写中的 -st 是早期英语常见的第二人称单数动词词尾（类似：thou hast, thou art, thou shalt）。在现代写作里使用“didst”通常带有古风、戏仿或文学效果。"]}
{"word":"diduce","summary":{"en":"Deduce means to reach a conclusion by reasoning from evidence or facts.","zh":"Deduce 指根据证据或事实进行推理，从而得出结论。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to figure out something by using facts, evidence, or reasoning (not by guessing)","zh":"根据事实、证据或逻辑推理得出（结论），而不是靠猜测"},"examples":[{"en":"From the footprints, the police deduced that someone had entered through the back door.","zh":"从脚印来看，警方推断有人从后门进入了。"},{"en":"I deduced the answer by looking at the pattern in the numbers.","zh":"我通过观察数字的规律推导出了答案。"}]}],"synonyms":["infer","conclude","reason","figure out","work out"],"phonetic":"/dɪˈdus/","extraExplanation":["你输入的“diduce”通常是拼写错误；正确拼写是“deduce”。","“deduce”常用于更正式的语境（侦探推理、学术推导、逻辑分析）。日常口语里也可以用“figure out”或“work out”。","词根提示：de-（向下、从…）+ duce（引导），整体有“把结论从证据中‘引导出来’”的感觉。"]}
{"word":"diduced","summary":{"en":"Deduce means to infer a conclusion from evidence or known facts.","zh":"Deduce 指根据证据或已知事实进行推理并得出结论。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to reach an answer or conclusion by reasoning from known facts or evidence; infer","zh":"根据已知事实或证据进行推理，得出结论；推断"},"examples":[{"en":"From the footprints, the detective deduced that someone had entered through the window.","zh":"从脚印来看，侦探推断有人是从窗户进入的。"},{"en":"She deduced the meaning of the new word from the context of the sentence.","zh":"她根据句子语境推断出了这个生词的意思。"},{"en":"We can deduce that sales increased because the store was crowded all week.","zh":"我们可以推断销量上升了，因为商店整周都很拥挤。"}]}],"synonyms":["infer","conclude","reason","figure out"],"phonetic":"/dɪˈdus/","extraExplanation":["你输入的“diduced”通常是拼写错误，最可能想写的是 **deduced**（deduce 的过去式/过去分词）。","**deduce** 常见搭配：deduce that + 从句；deduce ... from ...（从……推断出……）。","与 **guess**（猜）不同，**deduce** 强调“有依据的推理”，语气更正式，常见于侦探、学术、逻辑推理等语境。"]}
{"word":"diducing","summary":{"en":"“Deducing” means inferring a conclusion from facts or evidence (the -ing form of “deduce”).","zh":"“Deducing”指根据事实或证据进行推理并得出结论（“deduce”的-ing形式）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle/gerund of “deduce”) to reach an answer or conclusion by reasoning from known facts or evidence; to infer.","zh":"（“deduce”的现在分词/动名词）根据已知事实或证据进行推理，从而得出结论；推断。"},"examples":[{"en":"From the footprints, the detective is deducing that someone left in a hurry.","zh":"从脚印来看，侦探正在推断有人匆忙离开了。"},{"en":"She kept deducing meanings from context instead of using a dictionary.","zh":"她一直通过上下文来推断词义，而不是用词典。"},{"en":"By deducing the pattern, we solved the puzzle quickly.","zh":"通过推断规律，我们很快解开了谜题。"}]}],"synonyms":["inferring","concluding","reasoning","figuring out"],"phonetic":"/dɪˈdusɪŋ/","extraExplanation":["你写的“diducing”很可能是拼写错误，正确拼写是“deducing”。原形动词是“deduce”（d + e + d + u + c + e）。常见搭配：deduce that + 从句（推断……）；deduce A from B（从B推断出A）。","“deduce”通常用于比较正式、逻辑推理的语境（侦探推理、数学/科学推导）。日常口语里更常用“infer”或“figure out”。"]}
{"word":"diduction","summary":{"en":"Deduction means subtracting an amount (or the amount subtracted), and it can also mean a conclusion reached by reasoning.","zh":"Deduction 指“扣除/扣除额”，也可指“（根据事实得出的）推论、演绎推理”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of subtracting something from a total; taking away","zh":"扣除；减去（从总数中拿走一部分）"},"examples":[{"en":"After the deduction of fees, you will receive the final amount.","zh":"扣除手续费后，你将收到最终金额。"},{"en":"There is a deduction from my paycheck every month for health insurance.","zh":"我的工资每月都会扣一笔健康保险费。"}]},{"partOfSpeech":"n.","definition":{"en":"an amount that is subtracted, especially from income for taxes or from a bill","zh":"（尤指税务或账单中的）扣除额；抵扣额"},"examples":[{"en":"Homeowners may qualify for a tax deduction.","zh":"房主可能符合税务抵扣的条件。"},{"en":"The coupon gives you a $10 deduction at checkout.","zh":"这张优惠券在结账时可减免10美元。"}]},{"partOfSpeech":"n.","definition":{"en":"a conclusion reached by reasoning from known facts (often used in logic or detective stories)","zh":"推论；演绎推理（根据已知事实得出的结论，常见于逻辑或侦探故事）"},"examples":[{"en":"By deduction, we knew someone had been in the room recently.","zh":"通过推理，我们知道最近有人进过房间。"},{"en":"Sherlock Holmes is famous for his powers of deduction.","zh":"夏洛克·福尔摩斯以其强大的演绎推理能力而闻名。"}]}],"synonyms":["subtraction","discount","reduction","withholding","inference","reasoning"],"phonetic":"/dɪˈdʌkʃən/","extraExplanation":["你输入的“diduction”常见为拼写错误；正确拼写通常是“deduction”。","在日常英语里，“deduction”最常见于两类语境：①工资/账单里“被扣掉的金额”；②税务里“可抵扣项目”（tax deduction）。","在推理语境中，英语里常说“powers of deduction”，尤其因《福尔摩斯》而广为人知。"]}
{"word":"diductively","summary":{"en":"“Deductively” means using deductive reasoning: from a general rule to a specific conclusion.","zh":"“Deductively”指用演绎推理：从一般规则推出具体结论。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that uses deductive reasoning—starting from a general rule or principle and reaching a specific conclusion.","zh":"以演绎法（演绎推理）的方式——从一般规则或原理出发，推出具体结论。"},"examples":[{"en":"The detective reasoned deductively from the evidence to identify the suspect.","zh":"侦探从证据出发进行演绎推理，从而锁定嫌疑人。"},{"en":"If we define the rules clearly, we can solve the problem deductively.","zh":"如果我们把规则定义清楚，就能用演绎法解决这个问题。"}]}],"synonyms":["logically","by deduction","reasonably"],"phonetic":"/dɪˈdʌktɪvli/","extraExplanation":["你输入的“diductively”更常见的拼写是“deductively”。“deductive（演绎的）+ -ly”构成副词“deductively”。","演绎推理（deductive）通常与归纳推理（inductive）对比：演绎是“从一般到特殊”，归纳是“从特殊到一般”。在写作中，deductively 常用于描述论证方式或思考路径。"]}
{"word":"diductor","summary":{"en":"Diductor is a rare word meaning an abductor muscle (a muscle that moves a part away from the body’s midline).","zh":"Diductor 是个少见词，主要指“外展肌”（使身体部位远离中线/向外侧移动的肌肉）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Anatomy) A muscle that pulls a body part away from the midline or separates parts; an abductor muscle.","zh":"（解剖）使身体某部分远离中线或使部分分开的一块肌肉；外展肌。"},"examples":[{"en":"In some anatomy texts, the diductor muscle is described as an abductor of the limb.","zh":"在一些解剖学教材中，diductor muscle 被描述为使肢体外展的肌肉。"},{"en":"Damage to a diductor can limit how far you can move the arm away from the body.","zh":"外展肌（diductor）受损可能会限制你把手臂向身体外侧抬开的幅度。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare, archaic) A leader or guide; someone or something that leads away or draws apart.","zh":"（罕见/古义）引导者；带离或使分开的事物/人。"},"examples":[{"en":"The poet used “diductor” to suggest a force that led the mind away from fear.","zh":"诗人用 diductor 来暗示一种把心灵从恐惧中带走的力量。"}]}],"synonyms":["abductor","abducent muscle"],"phonetic":"/daɪˈdʌktər/","extraExplanation":["这个词非常少见，多出现在较旧的解剖学或拉丁化用语中。现代英语里更常用的是 **abductor**（外展肌）来表达同一概念。","词源上可理解为拉丁语 *di-*（分开、向两边）+ *ducere*（引导、牵引）。看到 -ductor 结尾时，可以联想到 *conductor*（引导电流/指挥）这类“引导、牵引”的意思。"]}
{"word":"Didunculidae","summary":{"en":"Didunculidae is the bird family that includes the tooth-billed pigeon, a rare species from Samoa.","zh":"Didunculidae 指包含萨摩亚稀有鸟类“齿喙鸠”的鸟类一科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of birds that includes the tooth-billed pigeon (Didunculus strigirostris), a rare species native to Samoa.","zh":"鸟类的一科，包含“齿喙鸠”（Didunculus strigirostris，常译“齿喙鸽/齿喙鸠”），一种原产萨摩亚的稀有鸟类。"},"examples":[{"en":"The tooth-billed pigeon belongs to the family Didunculidae.","zh":"齿喙鸠属于 Didunculidae（齿喙鸠科）。"},{"en":"Researchers discuss Didunculidae when studying the evolution of pigeons and doves.","zh":"研究人员在研究鸽形目（鸽与鸠）的演化时会提到 Didunculidae。"}]}],"synonyms":["tooth-billed pigeon family"],"phonetic":"/daɪˌdʌŋkjəˈlaɪdi/","extraExplanation":["Didunculidae 是生物分类学中的“科名”（family name），常见于学术论文、鸟类图鉴和保护生物学语境里，日常英语对话中很少用到。","该科最著名、也最常被提及的成员是萨摩亚的齿喙鸠（tooth-billed pigeon）。因为体态与喙部特征独特，它在讨论鸽形类的进化与保育时具有代表性。","词形上以 -idae 结尾是动物“科”的标准拉丁化后缀；Didunculidae 源自属名 Didunculus。"]}
{"word":"didunculidae","summary":{"en":"Didunculidae is the scientific name for the bird family of the tooth-billed pigeon from Samoa.","zh":"Didunculidae 是“齿嘴鸠科”的科学名称，指包含萨摩亚齿嘴鸠的鸟类科。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Zoology, taxonomy) A bird family that includes the tooth-billed pigeon (Didunculus strigirostris), a rare species native to Samoa.","zh":"（动物学/分类学）鸟类的一个科名——齿嘴鸠科，包含“齿嘴鸠”（Didunculus strigirostris），原产萨摩亚、极为稀有。"},"examples":[{"en":"The tooth-billed pigeon is the only living member of the family Didunculidae.","zh":"齿嘴鸠是齿嘴鸠科（Didunculidae）现存的唯一成员。"},{"en":"Some sources place Didunculidae close to pigeons and doves, but its exact relationships have been debated.","zh":"一些资料认为齿嘴鸠科与鸽形目（鸽与鸠）关系很近，但它的确切亲缘关系曾有争议。"}]}],"synonyms":["tooth-billed pigeon family"],"phonetic":"/ˌdaɪdʌŋˈkjuːlədiː/","extraExplanation":["“Didunculidae”是拉丁化的科学分类名：来自属名 Didunculus（齿嘴鸠属）+ 科名后缀 -idae（表示“……科”）。","在保育语境中，这个科名常与“极危（Critically Endangered）”“萨摩亚（Samoa）”“栖息地丧失与外来捕食者”等关键词一起出现。"]}
{"word":"Didunculinae","summary":{"en":"Didunculinae is a scientific name for a pigeon subfamily that includes the tooth-billed pigeon.","zh":"Didunculinae 是一个科学分类名，指鸠鸽科中包含齿喙鸠（齿嘴鸠）的亚科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a taxonomic subfamily (within the pigeon and dove family, Columbidae) containing the tooth-billed pigeon (Didunculus strigirostris).","zh":"（生物分类）鸽形目鸠鸽科（Columbidae）中的一个亚科，包含“齿喙鸠/齿嘴鸠”（Didunculus strigirostris）。"},"examples":[{"en":"Didunculinae is often treated as a unique subfamily because the tooth-billed pigeon looks and behaves quite differently from most pigeons.","zh":"Didunculinae 常被视为独特的亚科，因为齿喙鸠在外形和行为上与大多数鸽类差异很大。"},{"en":"Some references place Didunculinae within Columbidae, highlighting its evolutionary distinctness.","zh":"一些资料将 Didunculinae 置于鸠鸽科之内，并强调它在进化上的独特性。"}]}],"synonyms":["Didunculus group","tooth-billed pigeon subfamily"],"phonetic":"/daɪˌdʌŋkjəˈlaɪni/","extraExplanation":["这是一个较少见的学术用语，主要出现在动物学/鸟类学论文、物种名录和保护生物学资料中。","Didunculinae 通常与萨摩亚（Samoa）的特有种“齿喙鸠/齿嘴鸠”相关；该鸟因外形被形容为“像小型的渡渡鸟近亲”，因此在科普与保护讨论中也会被提及。","英语分类学后缀 -inae 表示“亚科”，常用于动物分类（如 Felinae 猫亚科、Caninae 犬亚科）。"]}
{"word":"didunculinae","summary":{"en":"Didunculinae is a biological subfamily name sometimes used for the tooth-billed pigeon (Didunculus).","zh":"Didunculinae 是一个生物学“亚科”名称，有时用于指齿喙鸠（Didunculus 属）相关的分类单元。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a taxonomic subfamily name sometimes used for the tooth-billed pigeon (genus Didunculus), especially in older or alternative classifications within the pigeon and dove family (Columbidae).","zh":"（生物分类）Didunculinae：有时用于指“齿喙鸠”（Didunculus 属）的一个“亚科”名称，常见于较早或某些替代性的鸠鸽科（Columbidae）分类中。"},"examples":[{"en":"In some older sources, the tooth-billed pigeon is placed in the subfamily Didunculinae.","zh":"在一些较早的资料中，齿喙鸠被归入 Didunculinae 亚科。"},{"en":"Modern checklists may avoid Didunculinae and treat Didunculus differently depending on the taxonomy used.","zh":"一些现代名录可能不使用 Didunculinae，而是根据所采用的分类体系以不同方式处理 Didunculus。"}]}],"synonyms":["Didunculus (context-specific)","tooth-billed pigeon (common name)"],"phonetic":"/ˌdɪdʌŋkjəˈlaɪni/","extraExplanation":["Didunculinae 的词尾 “-inae” 是动物分类学里常见的“亚科”后缀；它通常由属名 Didunculus（齿喙鸠属）加上该后缀构成。","齿喙鸠（Didunculus strigirostris）原产萨摩亚，因外形与生态相对独特，在不同年代的分类研究中有过不同层级的安置（如独立科/亚科等）。因此你在文献中看到 Didunculinae，多半是在谈该物种的系统分类位置。"]}
{"word":"Didunculus","summary":{"en":"Didunculus is the scientific genus name for the tooth-billed pigeon of Samoa.","zh":"Didunculus 是齿喙鸠（萨摩亚）的科学属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of birds containing the tooth-billed pigeon of Samoa (Didunculus strigirostris).","zh":"（鸟类）一个属名，包含萨摩亚的“齿喙鸠”（tooth-billed pigeon，学名 Didunculus strigirostris）。"},"examples":[{"en":"The tooth-billed pigeon belongs to the genus Didunculus.","zh":"齿喙鸠属于 Didunculus 这个属。"},{"en":"Didunculus is often mentioned in discussions of rare island birds.","zh":"在讨论稀有的岛屿鸟类时，常会提到 Didunculus。"}]}],"synonyms":["tooth-billed pigeon (related term)"],"phonetic":"/daɪˈdʌŋkjələs/","extraExplanation":["Didunculus 是拉丁化的学名（属名），通常在英语写作中用斜体（Didunculus）表示，首字母大写。","该属最著名的成员是齿喙鸠（tooth-billed pigeon），主要分布在萨摩亚；它因喙部形状独特而得名，并常出现在鸟类保护与生物多样性话题中。"]}
{"word":"didunculus","summary":{"en":"Didunculus is the scientific genus name for the tooth-billed pigeon of Samoa.","zh":"Didunculus 是萨摩亚齿嘴鸽的科学属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of pigeons; today it refers mainly to the single living species, the tooth-billed pigeon from Samoa (Didunculus strigirostris).","zh":"一种鸽类属名；现今主要指该属唯一现存物种——萨摩亚的“齿嘴鸽”（学名 Didunculus strigirostris）。"},"examples":[{"en":"The Didunculus is best known as the tooth-billed pigeon of Samoa.","zh":"Didunculus 最广为人知的是萨摩亚的齿嘴鸽。"},{"en":"Because the Didunculus is rare, conservationists monitor its habitat closely.","zh":"由于 Didunculus 很稀有，保育人员会密切监测它的栖息地。"}]}],"synonyms":["tooth-billed pigeon (common name)"],"phonetic":"/dɪˈdʌŋkjʊləs/","extraExplanation":["“Didunculus”来自拉丁语词根，常见于生物分类学的属名（genus）命名中；在日常英语里几乎只会出现在动物学、生态保育、博物馆展览或学术写作中。","该属最著名的成员是齿嘴鸽（tooth-billed pigeon），因喙边缘有类似“齿”的结构而得名；有时会被拿来与已灭绝的渡渡鸟（dodo）作比较讨论，但它本身并不是渡渡鸟。"]}
{"word":"Didus","summary":{"en":"Didus is an old scientific name associated with the dodo.","zh":"Didus 是与渡渡鸟相关的旧科学名称（属名）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A former scientific (genus) name for the dodo, an extinct flightless bird from Mauritius.","zh":"（旧）渡渡鸟的属名之一，用于指代毛里求斯的已灭绝不会飞的鸟类——渡渡鸟。"},"examples":[{"en":"In older books, the dodo may be listed under the genus Didus.","zh":"在较旧的书籍里，渡渡鸟可能会被归在 Didus 这个属名下。"},{"en":"The name Didus appears in historical discussions of dodo classification.","zh":"在关于渡渡鸟分类史的讨论中，常能看到 Didus 这个名称。"}]}],"synonyms":["Raphus (modern genus name in many sources)","dodo"],"phonetic":"/ˈdaɪdəs/","extraExplanation":["Didus 主要出现在早期动物分类与博物学文献中（例如曾有 “Didus ineptus” 这样的用法）。现代分类更常见的属名是 Raphus（如 Raphus cucullatus）。","如果你想表达的是口语里的 “did us”（例如 “He did us a favor.”），那是 did + us 的组合，不是一个单独单词；也可能是 “Dido’s”（狄多的）之类的拼写。你可以告诉我你看到这个词的句子，我可以按语境解释。"]}
{"word":"didus","summary":{"en":"Didus is an old scientific genus name once used for the extinct dodo.","zh":"Didus 是渡渡鸟曾用过的旧属名（现已废弃）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former scientific genus name for the dodo (an extinct flightless bird from Mauritius); now mainly seen in older taxonomy.","zh":"（旧）渡渡鸟的属名（已废弃的科学分类名）；主要见于较早的生物分类文献中。"},"examples":[{"en":"In older books, the dodo was sometimes listed as Didus ineptus.","zh":"在较早的书籍里，渡渡鸟有时被写作 Didus ineptus。"},{"en":"Modern classifications no longer use Didus for the dodo.","zh":"现代分类已不再用 Didus 来指渡渡鸟。"}]}],"synonyms":["dodo","Raphus (modern genus name)"],"phonetic":"/ˈdaɪdəs/","extraExplanation":["“Didus”是历史上给渡渡鸟使用过的属名之一，后来分类学调整，渡渡鸟通常被归入属名 Raphus（如 Raphus cucullatus）。因此你在现代英语文章里几乎不会看到 Didus，多出现在旧百科、旧博物学著作或历史分类讨论中。"]}
{"word":"didy","summary":{"en":"“Didy” is not a standard word; it’s usually a misspelling of “diddy” (tiny, UK informal) or “Diddy” (a nickname/stage name).","zh":"“didy”不是标准单词；通常是把“diddy”（英式口语：很小的）或“Diddy”（昵称/艺名）拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard spelling) A common misspelling of “diddy.” Most often, people mean either a nickname/name (“Diddy”) or the informal British adjective meaning “small.”","zh":"（非标准拼写）常见的“diddy”误拼。通常可能指昵称/名字（“Diddy”），或英式口语里表示“很小的”。"},"examples":[{"en":"I think you meant “diddy,” not “didy.”","zh":"我觉得你想写的是“diddy”，不是“didy”。"},{"en":"In some UK English, “diddy” can mean “very small.”","zh":"在一些英式英语里，“diddy”可以表示“很小”。"}]},{"partOfSpeech":"n.","definition":{"en":"Diddy (proper noun): a well-known stage name/nickname (e.g., the American music figure Sean “Diddy” Combs).","zh":"Diddy（专有名词）：一个知名的艺名/昵称（例如美国音乐界人物 Sean “Diddy” Combs）。"},"examples":[{"en":"The interview mentioned Diddy’s early career in music.","zh":"采访提到了 Diddy 早期的音乐生涯。"}]},{"partOfSpeech":"adj.","definition":{"en":"diddy (informal, chiefly UK): very small; tiny.","zh":"diddy（非正式，主要英式）：很小的；微小的。"},"examples":[{"en":"They live in a diddy little apartment.","zh":"他们住在一间很小的公寓里。"},{"en":"Just a diddy bit more sugar, please.","zh":"请再加一点点糖。"}]}],"synonyms":["tiny","small","little","mini"],"phonetic":"/ˈdɪdi/","extraExplanation":["“didy”在标准英语里不算常见单词，更多是拼写错误或随手写法。你如果想表达“你做了吗？”那更可能是短信式的“did you”的误拼/连写，标准写法应写成“did you …?”","英式口语里的“diddy”带一点可爱、随意的语气，常出现在“diddy little …”“a diddy bit …”这类搭配中。"]}
{"word":"didym","summary":{"en":"“Didym” is a rare noun meaning a twin or one of a pair, mostly seen in older or specialized contexts.","zh":"“didym”是个很少见的名词，意为“双胞胎（之一）”或“成对之物”，多见于较早或专业语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A twin; something that comes in a pair (rare, literary or scientific).","zh":"双胞胎之一；成对出现的事物（较少见，多用于文学或科学语境）。"},"examples":[{"en":"In old medical writing, a “didym” could mean one of a pair of twins.","zh":"在早期医学写作中，“didym”有时指一对双胞胎中的一个。"},{"en":"The poet called the two moons “didyms,” emphasizing their paired nature.","zh":"诗人把两个月亮称作“didyms”，强调它们成对出现的特性。"}]}],"synonyms":["twin","pair","double"],"phonetic":"/ˈdɪdɪm/","extraExplanation":["“didym”源自希腊语 didymos，意思是“成双的、双胞胎”。在现代英语里它非常少见，更常见的相关词是 didymous（意为“成对的/双生的”，多用于生物学、植物学）。","你可能在专有名词或学术词形里见到它的痕迹：例如 Didymus（人名/称号，意为“孪生者”），或医学词根 didym-/didymo-（与“睾丸/双生”相关的构词）。"]}
{"word":"Didymaea","summary":{"en":"Didymaea is a botanical genus name (Rubiaceae).","zh":"Didymaea 是一个植物学属名（茜草科）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering plants in the coffee family (Rubiaceae), native to parts of Mexico and Central America","zh":"（植物学）一种茜草科（咖啡科近缘）开花植物的属名，原产于墨西哥及中美洲部分地区"},"examples":[{"en":"Didymaea is a small genus in the Rubiaceae family.","zh":"Didymaea 是茜草科中的一个小属。"},{"en":"The field guide lists Didymaea among the native plants of southern Mexico.","zh":"这本野外图鉴把 Didymaea 列为墨西哥南部的本土植物之一。"}]}],"phonetic":"/ˌdɪdɪˈmiːə/","extraExplanation":["这是一个拉丁化的学名（属名），在学术写作中通常用斜体 *Didymaea*，首字母大写。","词源上常被认为与希腊语 *didymos*（“双胞胎、成对的”）有关；许多植物学属名会用这种方式暗示形态特征（例如成对结构），但具体命名动机需要查原始命名文献才能完全确定。"]}
{"word":"didymate","summary":{"en":"Didymate (rare) means “twin” or “paired,” describing something that comes in a matching set of two.","zh":"Didymate（罕用）表示“双生的/成对的”，用于描述成双成对出现的事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Twin; paired; existing as a set of two similar parts.","zh":"（罕用）成对的；双生的；由两个相似部分构成的。"},"examples":[{"en":"Some older biology texts describe the plant’s leaves as didymate—appearing in twin pairs.","zh":"一些较早的生物学书籍会把这种植物的叶子描述为 didymate——呈双生的成对生长。"},{"en":"The fossil showed a didymate structure, like two mirrored halves.","zh":"这块化石呈现出 didymate 的结构，像两片互为镜像的半部。"}]}],"synonyms":["twin","paired","double","twofold","coupled"],"phonetic":"/ˈdɪdɪˌmeɪt/","extraExplanation":["didymate 是非常少见的词，多见于较旧的科学/博物学写作里，用来表示“成双、成对”。现代英语里更常用 twin, paired, double, twofold 等词来表达。","词源与希腊语 didymos（“双胞胎、成对的”）有关；同源词包括 didymous（同样表示“成对的”，也较少见）以及生物学名词 Didymium（某些生物属名）。"]}
{"word":"didymia","summary":{"en":"Didymia is a rare term meaning “twinning” or the occurrence of twins.","zh":"Didymia 是较少见的词，意思是“双胎/双生现象”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the condition or phenomenon of having twins; twinning (a rare/technical term).","zh":"双胎现象；双生（较少见/偏专业用语）。"},"examples":[{"en":"The paper discussed didymia and other multiple births.","zh":"这篇论文讨论了双胎现象以及其他多胎分娩。"},{"en":"In some animals, didymia can occur more often under certain conditions.","zh":"在某些动物中，在特定条件下双胎现象可能更常见。"}]}],"synonyms":["twinning","twinship","twin birth"],"phonetic":"/daɪˈdɪmiə/","extraExplanation":["词源来自希腊语 didymos，意思是“孪生的、双胞胎的”。因此 didymia 与 didymus（“双胞胎”）以及 didymous（“成双的/成对的”）是同一词根家族。","在日常英语里更常用的是 twins / twin birth / twinning；didymia 多见于医学、生物学或较正式的学术语境。"]}
{"word":"didymis","summary":{"en":"Didymis is a rare term meaning “testis,” especially in older zoology/anatomy writing.","zh":"Didymis 是一个较少见的词，意为“睾丸（testis）”，多出现在较旧的动物学/解剖学写作中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology/Anatomy, rare) A testis; a male reproductive gland (often used when referring to animals).","zh":"（动物学/解剖学，少见）睾丸；雄性生殖腺（常用于描述动物）。"},"examples":[{"en":"In some older zoology texts, a male fish is described as having two didymis.","zh":"在一些较旧的动物学教材里，会说雄鱼有两个“didymis”（睾丸）。"},{"en":"Damage to the didymis can affect fertility.","zh":"睾丸受损会影响生育能力。"}]}],"synonyms":["testis","testicle","gonad"],"phonetic":"/ˈdɪdɪmɪs/","extraExplanation":["“didymis”在现代英语里非常少用，多见于旧式或专门的动物学/解剖学写法；日常与医学语境更常用的是“testis/testicle（睾丸）”。","词源来自希腊语“didymos（双胞胎、成对的）”，因为睾丸通常成对出现。","容易与“epididymis（附睾）”混淆：附睾是位于睾丸后侧、帮助储存与输送精子的管状结构，不等同于睾丸本身。"]}
{"word":"didymitis","summary":{"en":"Didymitis is an older term meaning inflammation of a testis, similar to orchitis.","zh":"didymitis 指睾丸的炎症，是较旧的说法，含义与 orchitis（睾丸炎）相近。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Inflammation of a testis (an older or less common medical term; often overlaps in meaning with “orchitis”).","zh":"睾丸炎；睾丸的炎症（较旧或较少用的医学术语，含义常与 orchitis「睾丸炎」接近）。"},"examples":[{"en":"The doctor considered didymitis as a possible cause of his scrotal pain.","zh":"医生把睾丸炎（didymitis）作为他阴囊疼痛的可能原因之一。"},{"en":"In modern writing, didymitis is often replaced by more common terms like orchitis.","zh":"在现代医学写作中，didymitis 常被更常用的术语（如 orchitis）所取代。"}]}],"synonyms":["orchitis"],"phonetic":"/ˌdɪdəˈmaɪtɪs/","extraExplanation":["这是一个医学术语，主要见于较早的文献或较少使用的语境；临床与写作中更常见的是 orchitis（睾丸炎）和 epididymitis（附睾炎）。","词源来自希腊语 didymos（意为“双胞胎/成对的”），与“成对的器官”这一概念相关；后缀 -itis 表示“炎症”。"]}
{"word":"didymium","summary":{"en":"Didymium is an old name for a mixture of neodymium and praseodymium, and it also refers to using that mixture in special filtering/protective glass.","zh":"Didymium 是对“钕与镨的混合物”的旧称，也可指这种混合物用于制作特殊的滤光/防护玻璃。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a substance once thought to be a chemical element, later discovered to be a mixture of two rare-earth elements (mainly neodymium and praseodymium).","zh":"曾被认为是一种化学元素的物质，后来发现其实是两种稀土元素（主要是钕和镨）的混合物。"},"examples":[{"en":"In the 1800s, scientists believed didymium was a new element found in cerium minerals.","zh":"在19世纪，科学家曾以为“didymium（假双元素）”是在铈矿物中发现的一种新元素。"},{"en":"Didymium was eventually separated into neodymium and praseodymium.","zh":"后来，人们将 didymium 分离为钕和镨。"}]},{"partOfSpeech":"n.","definition":{"en":"a glass additive (a mixture of neodymium and praseodymium compounds) used to make protective or filtering glass, especially for glassblowing and welding.","zh":"（作为玻璃添加剂的）钕/镨化合物混合物，用于制作防护或滤光玻璃，常见于玻璃吹制和焊接护目镜。"},"examples":[{"en":"Some glassblowers use didymium glasses to reduce the glare from hot sodium light.","zh":"一些玻璃工匠会使用 didymium 护目镜来减弱高温钠光的强烈眩光。"},{"en":"Didymium-containing filters can help improve contrast in certain lighting conditions.","zh":"含 didymium 的滤光片在某些光照条件下有助于提升对比度。"}]}],"synonyms":["rare-earth mixture","didymium glass","neodymium–praseodymium mixture"],"phonetic":"/daɪˈdɪmiəm/","extraExplanation":["词源来自希腊语 didymos（意为“双胞胎”）。因为它最初被当作一个“新元素”，后来发现其实是两种非常相近的稀土元素混在一起，所以用“像双胞胎一样”的名字来描述这一历史误会。","在现代化学里 didymium 不再被视为真正的元素名称，更常出现在材料/玻璃工艺语境中（如 didymium glass，指含钕/镨的滤光玻璃）。"]}
{"word":"didymiums","summary":{"en":"Didymiums is the plural of didymium, a historical term for a mixture of rare-earth elements—mainly praseodymium and neodymium.","zh":"Didymiums 是 didymium 的复数形式；didymium 是历史旧称，指主要由镨与钕组成的稀土元素混合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a historical name for a mixture of rare-earth elements (mainly praseodymium and neodymium) that people once believed was a single element.","zh":"“didymium”的复数形式；旧称，指一种稀土元素的混合物（主要是镨和钕），过去曾被误认为单一元素。"},"examples":[{"en":"Early chemists used didymiums to describe what they thought was one element.","zh":"早期化学家用 didymiums 来指他们以为是一种元素的东西。"},{"en":"Didymiums were used to color and filter light in certain types of glass.","zh":"didymiums 曾被用来给某些玻璃着色或用于光学滤光。"}]}],"synonyms":["rare-earth mixture","praseodymium–neodymium mixture","didymium (historical term)"],"phonetic":"/dɪˈdɪmiəmz/","extraExplanation":["didymium 一词来自希腊语 didymos（意为“孪生的/双生的”），因为它与另一种稀土“铈”很相近，且后来发现它其实由两种“孪生般难分”的元素组成。","19 世纪后期，科学家通过更精细的分离技术证明 didymium 并非单一元素，而是主要由镨（praseodymium）和钕（neodymium）构成，因此现代化学中 didymium 属于历史名称。","在材料与光学应用中，didymium glass（含镨/钕氧化物的玻璃）能吸收特定波段的黄光，常用于玻璃吹制护目镜等场景。"]}
{"word":"didymo","summary":{"en":"Didymo is a freshwater alga known for forming thick mats on riverbeds and spreading between waterways on wet gear.","zh":"Didymo 是一种淡水藻类，以在河床形成厚藻毡、并可随潮湿装备在不同水域间传播而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a freshwater microscopic alga (Didymosphenia geminata) that can form thick, felt-like mats (“rock snot”) on riverbeds, sometimes harming aquatic habitats.","zh":"一种淡水显微藻（Didymosphenia geminata，常译为“河底双眉藻/双眉藻”），可在河床上形成厚厚的毡状覆盖物（俗称“岩鼻涕”），有时会破坏水生栖息地。"},"examples":[{"en":"Didymo can cover rocks in a river with thick mats that change the habitat for insects and fish.","zh":"Didymo 会用厚厚的藻毡覆盖河里的石头，改变昆虫和鱼类的栖息环境。"},{"en":"Anglers are often asked to clean and dry their gear to prevent spreading didymo to other streams.","zh":"钓鱼者常被要求清洗并晾干装备，以避免把 didymo 传播到其他溪流。"}]}],"synonyms":["Didymosphenia geminata","rock snot"],"phonetic":"/dɪˈdaɪmoʊ/","extraExplanation":["“Didymo”是科学属名 Didymosphenia 的口语简称，在环保告示、钓鱼社群与水域管理语境中很常见。","它通常通过涉水鞋、渔具、船只等携带的残留水或藻体被“跨河流”传播，因此常见的防治口号是“Clean, Drain, Dry（清洗、排水、晾干）”。","虽然常被说成“入侵物种”，但在一些地区它可能原本就存在；问题往往出在异常暴发（bloom）导致的大面积覆盖。"]}
{"word":"didymoid","summary":{"en":"Didymoid means “twin-like” or “paired,” usually in scientific descriptions.","zh":"Didymoid 指“像双胞胎一样”或“成对的”，多用于科学性描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"twin-like; paired; made of two similar parts.","zh":"像双胞胎的；成对的；由两部分相似结构组成的。"},"examples":[{"en":"The fossil shows a didymoid structure, with two nearly identical lobes.","zh":"这块化石呈现出“成对结构”，有两个几乎相同的叶状部分。"},{"en":"Some scientific descriptions use didymoid to emphasize a twin-like symmetry.","zh":"一些科学描述会用 didymoid 来强调“像双胞胎一样”的对称性。"}]}],"synonyms":["twin-like","paired","double","bilobed","two-part"],"phonetic":"/ˈdɪdɪmɔɪd/","extraExplanation":["didymoid 来自希腊语词根 didym-（意为“孪生、双生”），常见于较学术的语境（如生物学、古生物学、形态学描写），用来强调“成对、两部分高度相似”的外观或结构。日常英语里很少用，通常会用 twin-like / paired / double 之类更常见的词来表达。"]}
{"word":"didymolite","summary":{"en":"Didymolite is a rare mineral term used mainly in scientific/mineralogy contexts.","zh":"Didymolite 是一个较罕见的矿物名称，主要用于矿物学/科学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare mineral name used in mineralogy (a kind of silicate mineral); the term is uncommon in everyday English and is mostly seen in scientific/mineral-collecting contexts.","zh":"一种矿物学名称，指较罕见的矿物（通常被归为硅酸盐类）；在日常英语中几乎不用，主要见于科学或矿物收藏语境。"},"examples":[{"en":"The specimen label identified the pale crystal as didymolite.","zh":"标本标签把这块浅色晶体标注为 didymolite（双晶石）。"},{"en":"Didymolite is a word you’re more likely to meet in a mineral catalog than in general reading.","zh":"didymolite 这个词更常见于矿物目录，而不是普通读物。"}]}],"synonyms":["(rare) mineral name","(scientific) mineral species name"],"phonetic":"/ˌdɪdɪˈmoʊlaɪt/","extraExplanation":["词源上常被解释为来自希腊语 didymos（“双生、成对”）+ -lite（“石、矿物”这一类词尾，如 graphite、anthracite 等也常见相关构词）。因此它的命名往往与晶体“成对/双晶”的外观或特征有关。","在现代矿物学资料中，这类较少见的矿物名有时会被重新分类、并入其他矿物名称或作为历史旧称出现；阅读资料时可结合具体产地、化学式或矿物类别来确认指代。"]}
{"word":"didymous","summary":{"en":"Didymous means “double” or “paired,” especially in scientific or literary writing.","zh":"didymous 表示“双的、成对的”，多见于科学或文学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two parts; double; paired (often used in scientific or literary contexts).","zh":"有两个部分的；成对的；双的（常见于科学或文学语境）。"},"examples":[{"en":"Some plants have didymous leaves that grow in pairs on the stem.","zh":"有些植物的叶子是成对生长在茎上的。"},{"en":"The writer described the city’s didymous nature—old and new side by side.","zh":"作家形容这座城市具有“双重”特质——古老与现代并存。"}]}],"synonyms":["double","paired","twin","twofold","dual"],"phonetic":"/ˈdɪdɪməs/","extraExplanation":["词源来自希腊语 didymos，意思是“孪生的/双生的”。因此 didymous 常带有“成双出现、两者相配”的感觉。","这个词在日常口语中不常用，更常见于生物学、植物学等学术描述，或较文艺的写作中用来强调“两重性/成对性”。"]}
{"word":"didymus","summary":{"en":"Didymus is a Greek name meaning “twin,” most famous as a name for the apostle Thomas in the New Testament.","zh":"Didymus 是一个希腊名字，意为“双胞胎/孪生子”，最著名的用法是《新约》中使徒多马的别名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper name) A Greek name meaning “twin,” best known as a byname for the apostle Thomas in the New Testament (“Thomas, called Didymus”).","zh":"（专有名词）一个源自希腊语、意为“孪生子/双胞胎”的名字；最常见的用法是《新约》中使徒多马的别名（“那称为低土马的多马”）。"},"examples":[{"en":"In the Gospel of John, Thomas is also called Didymus.","zh":"在《约翰福音》中，多马也被称为 Didymus（低土马）。"},{"en":"The name Didymus literally means “twin” in Greek.","zh":"Didymus 在希腊语中字面意思是“孪生子/双胞胎”。"}]},{"partOfSpeech":"other","definition":{"en":"(Proper name) The name of several historical figures, especially Didymus the Blind, an early Christian teacher and writer in 4th‑century Alexandria.","zh":"（专有名词）多个历史人物的名字，尤指“盲者狄狄摩”（Didymus the Blind），4世纪亚历山大城的早期基督教教师与作家。"},"examples":[{"en":"Didymus the Blind wrote commentaries on parts of the Bible.","zh":"“盲者狄狄摩”曾为《圣经》的部分内容写过注释。"}]}],"synonyms":["Thomas (called Didymus)"],"phonetic":"/ˈdɪdɪməs/","extraExplanation":["Didymus 来自希腊语 Δίδυμος（Didymos），意思是“成对的、双生的”。《新约》里把 Thomas（多马）称为 Didymus，本质上是在用“希腊语”和“亚兰语/希伯来语”两种语言重复同一个含义，因为 Thomas 也与“孪生子/双胞胎”的意思相关。"]}
{"word":"Didynamia","summary":{"en":"Didynamia is a historical botanical term for a Linnaean plant class with four stamens: two long and two short.","zh":"Didynamia 是一个历史性的植物学术语，指林奈系统中“雄蕊四枚、两长两短”的一纲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany, historical) A Linnaean class of plants characterized by four stamens in two unequal pairs—two long and two short (didynamous stamens).","zh":"（植物学，历史用语）林奈分类系统中的一纲：花中有四枚雄蕊，分成两对长短不等——两长两短（即“二强雄蕊”）。"},"examples":[{"en":"Mint and snapdragon were traditionally placed in the Linnaean class Didynamia because they have two long stamens and two short ones.","zh":"薄荷和金鱼草在传统林奈系统中常被归入 Didynamia 纲，因为它们有两枚长雄蕊和两枚短雄蕊。"},{"en":"In older botany books, you may see “Didynamia” used as a heading for plants with didynamous stamens.","zh":"在较早的植物学书籍里，你可能会看到用 “Didynamia” 作为标题，指具有二强雄蕊的植物。"}]}],"synonyms":["Linnaean class Didynamia","didynamous-stamen class (historical)"],"phonetic":"/ˌdaɪdaɪˈneɪmiə/","extraExplanation":["该词多见于18–19世纪的植物分类文献，属于“林奈性系统（Linnaean sexual system）”的一部分；现代分类更常用科、属等进化关系来划分，因此 Didynamia 今天主要作为历史术语出现。","词源可理解为希腊语前缀 di-（二）+ dynamis（力量），对应“二强（两长两短）”这一形态特征。"]}
{"word":"didynamia","summary":{"en":"Didynamia is a historical Linnaean plant class for flowers with four stamens arranged as two long and two short.","zh":"Didynamia 指林奈旧植物分类中的一纲：花的四枚雄蕊两长两短成两对。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany, taxonomy) A former Linnaean class of flowering plants characterized by four stamens in two unequal pairs—two longer and two shorter.","zh":"（植物学／分类学）林奈旧分类系统中的一“纲”，指花具有四枚雄蕊且分成两对长短不等（两长两短）的植物。"},"examples":[{"en":"Mint and many other herbs were once placed in the Linnaean class Didynamia because their flowers have two long and two short stamens.","zh":"薄荷等许多香草植物曾被归入林奈的 Didynamia 纲，因为它们的花具有两长两短的雄蕊。"},{"en":"In older botany books, you may see Didynamia used as a classification label.","zh":"在较早期的植物学书籍中，你可能会看到 Didynamia 作为分类标签出现。"}]}],"synonyms":["Linnaean class (historical term)"],"phonetic":"/ˌdaɪdaɪˈneɪmiə/","extraExplanation":["Didynamia 来自希腊语词根 di-（“二、两”）+ dynamis（“力量”）。这里的“力量”引申为“强弱”，用来形容雄蕊成对出现且长短（强弱）不等。","这是林奈（Linnaeus）“性系统”（sexual system）中的一个旧分类单位，现代植物分类主要依据系统发育关系（亲缘关系），因此 Didynamia 更多出现在历史文献或教学背景中。"]}
{"word":"didynamian","summary":{"en":"A rare botanical adjective meaning “having two long and two short stamens; belonging to Linnaeus’s Didynamia class.”","zh":"一个较少用的植物学形容词：指“雄蕊两长两短（四枚分两对）”，或“属于林奈分类的二强雄蕊类（Didynamia）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany, rare) Having four stamens in two unequal pairs—two long and two short; relating to the Linnaean class *Didynamia*.","zh":"（植物学，较少用）指雄蕊四枚、分成两对长短不等（两长两短）；也可指林奈分类中的“二强雄蕊类（Didynamia）”。"},"examples":[{"en":"Many plants in the mint family have didynamian stamens.","zh":"唇形科的许多植物都有二强雄蕊（两长两短）的雄蕊结构。"},{"en":"In older textbooks, the plant was described as didynamian under Linnaeus’s system.","zh":"在较旧的教材里，这种植物按林奈系统被描述为“二强雄蕊类（didynamian）”。"}]}],"synonyms":["didynamous","Didynamia (related term)"],"phonetic":"/ˌdaɪdaɪˈneɪmiən/","extraExplanation":["“didynamian”在现代英语里很少见，更常见的相关词是 **didynamous**（二强雄蕊的）或名词 **Didynamia**（林奈分类的一类）。词根来自希腊语：di-（二）+ dynamis（力量），强调“两枚更强/更长”的雄蕊。","如果你原本想查的是 **dynamian / dynamic** 之类的词，请告诉我你看到它的句子或领域（生物/数学/日常），我可以帮你确认正确拼写和意思。"]}
{"word":"didynamic","summary":{"en":"A rare, nonstandard adjective meaning “double‑dynamic,” influenced by two changing forces or processes.","zh":"一个罕见且非规范的形容词，表示“具有双重动态/受两个变化力量或过程影响”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare / nonstandard) Having two dynamic parts, forces, or modes of change; “double‑dynamic.”","zh":"（罕见/非规范用法）具有两个动态部分、作用力或变化模式的；“双动态的”。"},"examples":[{"en":"The author describes the negotiation as didynamic, shaped by both public pressure and private interests.","zh":"作者把这场谈判描述为“didynamic”（双动态），既受公众压力影响，也受私人利益影响。"},{"en":"In this model, behavior is didynamic: one process drives habits and another drives conscious choice.","zh":"在这个模型中，行为是“双动态的”：一个过程驱动习惯，另一个过程驱动有意识的选择。"}]}],"synonyms":["two-fold dynamic","dual dynamics","double dynamic","two-pronged","bidirectional (in some contexts)"],"phonetic":"/daɪdaɪˈnæmɪk/","extraExplanation":["“didynamic”不是常见英语词汇，在主流词典中通常查不到。它看起来像由前缀 di-（表示“二、双”）+ dynamic（动态的）临时拼成，用来强调“有两个相互作用的动态因素”。","如果你想表达“有两个动态系统/驱动力”，更自然的说法常见于：two‑fold dynamic（双重动力/双重动态）、dual dynamics（双重动态）、bidirectional dynamics（双向动态，强调相互影响）。","如果你的本意是别的词，常见易混淆的是 didactic（说教的/教学的）或 dynamic（动态的）。你可以告诉我句子语境，我可以帮你确认最合适的词。"]}
{"word":"didynamies","summary":{"en":"Didynamies is a rare botanical term meaning the condition (in flowers) of having two long stamens and two short ones; it is the plural of didynamy.","zh":"Didynamies 是一个罕见的植物学术语，指花朵雄蕊“二长二短”的结构特征；它是 didynamy 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, botany) The condition of having two long stamens and two short stamens in a flower; the plural of didynamy.","zh":"（罕见，植物学）指一朵花中“二长二短”的雄蕊结构；为 didynamy 的复数形式。"},"examples":[{"en":"In some mint-family flowers, didynamies are easy to see: two stamens are longer than the other two.","zh":"在薄荷科的一些花中，很容易看出 didynamies：其中两枚雄蕊比另外两枚更长。"},{"en":"The textbook mentions didynamies when describing flower structures used for classification.","zh":"教材在介绍用于分类的花部结构时提到了 didynamies。"}]}],"synonyms":["didynamy","didynamous","tetradynamous"],"phonetic":"/daɪˈdɪdənəmiz/","extraExplanation":["这个词在现代英语里非常少见，更多出现在较老的植物学分类或形态学描述中。你更常看到的是形容词 didynamous（“二长二短的”），例如 “a didynamous flower”（雄蕊二长二短的花）。","如果你原本想输入的是 dynamics（“动力学；动态；相互作用的变化”），拼写应为 dynamics。"]}
{"word":"didynamous","summary":{"en":"Didynamous describes flowers with four stamens arranged as two long and two short.","zh":"didynamous 指花的四枚雄蕊分成两对、两长两短的结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having four stamens in two unequal pairs—two long and two short—common in some flowering plants.","zh":"（植物学）指花的雄蕊为四枚，分成两对且长短不等——两长两短；常见于某些被子植物。"},"examples":[{"en":"Many members of the mint family have didynamous stamens.","zh":"薄荷科的许多植物具有二强雄蕊（两长两短的雄蕊）。"},{"en":"The botanist noted the didynamous arrangement when describing the flower.","zh":"植物学家在描述该花时记录了它的二强雄蕊结构。"}]}],"synonyms":["two-long-two-short (stamens)","didynamous-stamened"],"phonetic":"/daɪˈdɪnəməs/","extraExplanation":["词源来自希腊语：di-（二、两）+ dynamis（力量）。在植物学里，“两长两短”的雄蕊常被理解为“两强两弱”。","这是传统形态学分类中常用的特征之一，尤其常见于唇形科（薄荷科）等类群；不过现代分类更依赖分子证据。"]}
{"word":"didynamy","summary":{"en":"Didynamy is a botanical term for flowers with four stamens arranged as two long and two short.","zh":"Didynamy（植物学）指花具有四枚雄蕊，分成两长两短两对的二强排列。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany) the condition of having four stamens in two unequal pairs—two long and two short (a “didynamous” arrangement).","zh":"（植物学）二强雄蕊：雄蕊共有四枚，分成两对，长短不等（两长两短），即“二强”排列。"},"examples":[{"en":"Many plants in the mint family show didynamy in their flowers.","zh":"薄荷科的许多植物花朵都呈现二强雄蕊（didynamy）的特征。"},{"en":"In class, we learned that didynamy can help identify certain flowering plant groups.","zh":"课堂上我们学到，二强雄蕊这一特征有助于辨认某些被子植物类群。"}]}],"synonyms":["didynamia","didynamous condition"],"phonetic":"/daɪˈdaɪnəmi/","extraExplanation":["“didynamy”主要用于植物形态学与分类学语境中，和形容词“didynamous（二强的；两长两短雄蕊的）”紧密相关。常见于描述唇形花科（薄荷科）等类群的花部结构。","词源上来自希腊语元素：di-（二）+ dynamis（力量），字面含义接近“两个力量/两种强度”，对应“两长两短”的不等性。"]}
