{"word":"dihalid","summary":{"en":"A chemistry term for a compound containing two halogen atoms.","zh":"化学术语：指含有两个卤素原子的化合物（也叫二卤化物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) A compound that contains two halogen atoms (F, Cl, Br, I) in each molecule; also called a dihalide.","zh":"（化学）每个分子中含有两个卤素原子（氟、氯、溴、碘）的化合物；也称为二卤化物。"},"examples":[{"en":"1,2-dichloroethane is a dihalid(e) used in industrial chemistry.","zh":"1,2-二氯乙烷是一种用于工业化学的二卤化物。"},{"en":"Some dihalids are made by adding bromine or chlorine across a carbon–carbon double bond.","zh":"一些二卤化物可以通过让溴或氯加成到碳—碳双键上来制备。"}]}],"synonyms":["dihalide","dihalogenated compound","dihalo compound"],"phonetic":"/daɪˈhælaɪd/","extraExplanation":["“dihalid / dihalide”主要出现在化学语境中。前缀 di- 表示“两个”，halid(e) 与 halogen（卤素）相关。常见写法更标准的是 dihalide；如果你在论文或教材里看到 dihalid，可能是简写、拼写变体，或特定资料中的用法。"]}
{"word":"dihalide","summary":{"en":"A dihalide is a compound containing two halogen atoms; in organic chemistry it often means an organic molecule with two halogen substituents.","zh":"dihalide 指含两个卤素原子的化合物；在有机化学中常指带两个卤素取代基的有机分子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound that contains two halogen atoms (fluorine, chlorine, bromine, iodine, or astatine) in its formula; often refers to organic molecules with two halogen substituents (e.g., 1,2-dichloroethane).","zh":"二卤化物：化学式中含有两个卤素原子（氟、氯、溴、碘或砹）的化合物；也常指含两个卤素取代基的有机化合物（如 1,2-二氯乙烷）。"},"examples":[{"en":"1,2-dichloroethane is a dihalide used as an industrial solvent and chemical intermediate.","zh":"1,2-二氯乙烷是一种二卤化物，用作工业溶剂和化工中间体。"},{"en":"In an organic chemistry lab, you may convert an alkene into a vicinal dihalide by adding Br2.","zh":"在有机化学实验中，你可以通过加成 Br2 把烯烃转化为邻位二卤化物。"},{"en":"This reaction works best with a dihalide that has halogens on neighboring carbon atoms.","zh":"这种反应对卤素位于相邻碳原子上的二卤化物效果最好。"}]}],"synonyms":["dihalogenated compound","dihalo compound"],"phonetic":"/daɪˈhæl.aɪd/","extraExplanation":["“di-”表示“两个”，“halide”表示“卤化物/含卤的化合物”。在有机化学里常见的细分说法包括：geminal dihalide（同碳二卤化物，两个卤素在同一个碳上）和 vicinal dihalide（邻位二卤化物，两个卤素在相邻碳上）。不同类型的二卤化物反应性和用途可能差别很大。"]}
{"word":"dihalo","summary":{"en":"“Dihalo” is a chemistry term meaning “containing two halogen atoms,” usually used as a modifier (e.g., dihaloalkane).","zh":"“dihalo”是化学用语，表示“含两个卤素原子/二卤代”，通常作前置修饰语使用（如dihaloalkane）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) describing a compound that contains two halogen atoms (such as fluorine, chlorine, bromine, or iodine). Often used before another word, e.g., “dihaloalkane.”","zh":"（化学）指含有两个卤素原子（如氟、氯、溴或碘）的化合物。常作前置修饰语使用，如“dihaloalkane（二卤代烷）”。"},"examples":[{"en":"1,2-dihaloethane is an ethane molecule with two halogen atoms attached.","zh":"1,2-dihaloethane（1,2-二卤代乙烷）是一个乙烷分子，上面连着两个卤素原子。"},{"en":"In class, we compared mono-halo and dihalo compounds to see how their properties change.","zh":"在课上，我们比较了单卤代和二卤代化合物，看看它们的性质如何变化。"}]}],"synonyms":["dihalogenated (in chemistry context)"],"phonetic":"/daɪˈheɪloʊ/","extraExplanation":["“di-”是常见前缀，表示“两个”；“halo-”在化学里来自“halogen（卤素）”。所以“dihalo”整体就是“二卤代/含两个卤素”。","它通常不是独立使用的日常英语词，更常见于化学命名或教材中（如：dihaloalkane、dihalogenated compound）。"]}
{"word":"dihalogen","summary":{"en":"A dihalogen is a two-atom halogen molecule (X2), such as Cl2 or Br2.","zh":"dihalogen 指由两个卤素原子组成的分子（X2），如 Cl2 或 Br2。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A molecule (often an element) made of two halogen atoms bonded together, typically written as X2 (for example, Cl2 or Br2).","zh":"由两个卤素原子相互成键组成的分子，通常写作 X2（例如 Cl2 或 Br2）。"},"examples":[{"en":"Chlorine gas (Cl2) is a common dihalogen used to disinfect water.","zh":"氯气（Cl2）是一种常见的二卤素，用于水的消毒。"},{"en":"Bromine (Br2) is a reddish-brown dihalogen liquid at room temperature.","zh":"溴（Br2）在室温下是一种红棕色的二卤素液体。"}]}],"synonyms":["halogen molecule","X2 halogen"],"phonetic":"/daɪˈhælədʒən/","extraExplanation":["“dihalogen”由前缀“di-（二、两个）”+“halogen（卤素）”组成。卤素包括氟、氯、溴、碘等，它们常以双原子分子形式存在（X2），因此在化学语境中常被称为二卤素。"]}
{"word":"dihdroxycholecalciferol","summary":{"en":"Dihydroxycholecalciferol usually refers to 1,25-dihydroxycholecalciferol (calcitriol), the active form of vitamin D3.","zh":"dihydroxycholecalciferol 通常指 1,25-二羟基胆钙化醇（骨化三醇），维生素D3的活性形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biochemistry/medicine) 1,25-dihydroxycholecalciferol (calcitriol), the active hormone form of vitamin D3 that helps the body absorb calcium and phosphorus and supports bone health.","zh":"（生化/医学）1,25-二羟基胆钙化醇（骨化三醇），维生素D3在体内的活性激素形式，帮助吸收钙和磷，并支持骨骼健康。"},"examples":[{"en":"Doctors may prescribe calcitriol (1,25-dihydroxycholecalciferol) for certain calcium problems.","zh":"医生可能会为某些钙代谢问题开具骨化三醇（1,25-二羟基胆钙化醇）。"},{"en":"Low levels of 1,25-dihydroxycholecalciferol can affect bone strength.","zh":"1,25-二羟基胆钙化醇水平偏低会影响骨骼强度。"}]}],"synonyms":["calcitriol","1,25-dihydroxyvitamin D3","1,25-(OH)2D3"],"phonetic":"/daɪˌhaɪˌdrɑk.siˌkoʊlɪˌkæl.səˈfɛr.ɔl/","extraExplanation":["你输入的拼写“dihdroxycholecalciferol”少了一个字母，常见写法是 **dihydroxycholecalciferol**。在医学语境中通常特指 **1,25-dihydroxycholecalciferol**，也就是药名/通用名 **calcitriol（骨化三醇）**。","名称拆解：**di-**（二）+ **hydroxy**（羟基）+ **cholecalciferol**（胆钙化醇/维生素D3）。它是维生素D3在肝、肾等部位代谢后的活性形式之一。","与常见化验“维生素D”不同：临床上更常测的是 **25-hydroxyvitamin D（25-羟维生素D）** 作为总体维生素D储备指标，而 1,25-二羟形式更像“活性激素水平”，在某些肾病或甲状旁腺相关问题时更有参考价值。"]}
{"word":"dihedral","summary":{"en":"Dihedral refers to two planes meeting, especially the angle between them (a dihedral angle).","zh":"Dihedral 指两个平面相交形成的结构，尤其指它们之间的夹角（二面角）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) Formed by or relating to two planes meeting at an angle; having two sides or faces.","zh":"（形容词）由两个平面相交形成的；与两个平面夹角有关的；有两个侧面/面的。"},"examples":[{"en":"A dihedral angle is formed where two flat surfaces meet.","zh":"两个平面相交的地方会形成二面角（dihedral angle）。"},{"en":"The roof panels create a dihedral shape along the ridge.","zh":"屋顶的板材在屋脊处形成二面形状。"}]},{"partOfSpeech":"n.","definition":{"en":"(n.) A dihedral angle: the angle between two intersecting planes (often used in geometry, engineering, and chemistry).","zh":"（名词）二面角：两个相交平面之间的夹角（常用于几何、工程与化学）。"},"examples":[{"en":"We measured the dihedral to check whether the parts fit correctly.","zh":"我们测量了二面角，以检查零件是否正确装配。"},{"en":"In chemistry, the dihedral between two bonds affects a molecule’s shape.","zh":"在化学中，两条键之间的二面角会影响分子的形状。"}]}],"synonyms":["dihedral angle","interfacial angle","angle between planes"],"phonetic":"/daɪˈhiːdrəl/","extraExplanation":["词源上，di- 表示“两个”，-hedral 与“面/座（hedra）”有关，所以 dihedral 直观上就是“由两个面构成/两个面之间的”。","航空领域里常说“wing dihedral（机翼上反角）”，指机翼相对水平面略微上扬的角度；这种设计通常能增强飞机的横向稳定性。"]}
{"word":"dihedrals","summary":{"en":"“Dihedrals” is the plural of “dihedral,” meaning (1) having two faces/planes, or (2) the angle between two planes (a dihedral angle).","zh":"“Dihedrals”是“dihedral”的复数，表示（1）双面的/由两个平面组成的；（2）二面角，即两个平面之间的夹角。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having two flat faces or planes; formed by two planes meeting along a line (an edge).","zh":"（几何）双面的；由两个平面沿一条直线（棱）相交形成的。"},"examples":[{"en":"A dihedral roof has two sloping planes that meet at the top ridge.","zh":"双坡屋顶由两片倾斜平面组成，在屋脊处相交。"},{"en":"The dihedral surfaces meet along a straight edge.","zh":"这两个双面平面沿一条直棱相交。"}]},{"partOfSpeech":"n.","definition":{"en":"a dihedral angle: the angle between two intersecting planes.","zh":"二面角：两个相交平面之间的夹角。"},"examples":[{"en":"Engineers measured the dihedral between the two panels to ensure a correct fit.","zh":"工程师测量两块面板之间的二面角，以确保装配正确。"},{"en":"In geometry, the dihedral of a cube’s faces is fixed.","zh":"在几何中，立方体相邻面的二面角是固定的。"}]}],"synonyms":["two-faced (geometry)","dihedral angle","torsion angle (chemistry)"],"phonetic":"/daɪˈhiːdrəl/","extraExplanation":["“dihedrals”通常是 dihedral 的复数。在化学与生物化学里也常说“dihedral angle / torsion angle（二面角/扭转角）”，用来描述分子中四个原子形成的夹角，决定分子的空间构型（例如蛋白质主链的 φ/ψ 角）。","词源提示：di- 表示“二”，-hedral 与“面/平面”有关，所以整体意思可理解为“两个面形成的”。"]}
{"word":"dihedron","summary":{"en":"A dihedron is a geometric figure formed by two intersecting planes (associated with a dihedral angle).","zh":"dihedron 指由两个相交平面形成的几何形体/立体角（与二面角相关）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Geometry) A shape or solid angle formed by two intersecting planes; the angle between the two planes is called a dihedral angle.","zh":"（几何）由两平面相交形成的立体角/形体；两平面之间的夹角称为二面角（dihedral angle）。"},"examples":[{"en":"In geometry class, we learned that a dihedron is made by two planes crossing each other.","zh":"在几何课上，我们学到二面体是由两个平面相交形成的。"},{"en":"The dihedral angle measures the opening of a dihedron.","zh":"二面角用来衡量二面体的“张开”程度。"}]}],"synonyms":["dihedral angle","dihedral (related term)"],"phonetic":"/daɪˈhiːdrən/","extraExplanation":["词源：来自希腊语前缀 di-（“二、两个”）+ hedra（“面/座”一类的含义），因此字面上可理解为“由两个面构成的”。","在现代英语中更常见的相关术语是 dihedral angle（二面角）或直接用 dihedral（形容词：二面的、二面角的）；dihedron 作为名词主要见于数学/几何语境。"]}
{"word":"dihedrons","summary":{"en":"Dihedrons are two-faced geometric forms made by two planes meeting along an edge (plural of dihedron).","zh":"dihedrons 是 dihedron 的复数，指两平面相交形成棱的二面体构型（常与二面角相关）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of dihedron: a 3D geometric shape formed by two plane faces meeting along a straight edge (often discussed via the dihedral angle between the planes).","zh":"dihedron 的复数：由两块平面相交并沿一条直线形成“棱”的三维几何结构（常通过两平面之间的二面角来讨论）。"},"examples":[{"en":"In solid geometry, you can compare dihedrons by measuring their dihedral angles.","zh":"在立体几何中，可以通过测量二面角来比较不同的二面体结构。"},{"en":"The model shows several dihedrons that share the same edge but open at different angles.","zh":"这个模型展示了几个共用同一条棱、但张开角度不同的二面体结构。"}]}],"synonyms":["dihedral forms","two intersecting planes"],"phonetic":"/daɪˈhiːdrənz/","extraExplanation":["“dihedron”常见于数学/几何语境，指“两平面相交”的构型；日常英语更常说“two intersecting planes”或直接说“dihedral angle（二面角）”。","不要把 dihedron（二面体构型）和 polyhedron（多面体，如立方体）混淆：polyhedron 有多个面；dihedron 强调只有两面相交形成一条棱。","在化学、工程和3D建模里更常见的相关词是“dihedral angle”，例如分子构象中的扭转角（torsion angle）。"]}
{"word":"dihelios","summary":{"en":"“dihelios” is not a standard English word; it’s likely a coined proper name. It may be inspired by di- (“two”) + Helios (“sun”).","zh":"“dihelios”不是标准英语词汇；很可能是自造的专有名称。可能受 di-（双/二）+ Helios（太阳）启发。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often seen as a coined name (e.g., a username, product, or project title). Its meaning depends on the context where you found it.","zh":"不是标准英语单词；更常见于自造名称（如用户名、产品名或项目名）。其含义取决于你看到它的具体语境。"},"examples":[{"en":"I couldn’t find “dihelios” in a dictionary, so it may be a brand or username.","zh":"我在词典里找不到“dihelios”，所以它可能是品牌名或用户名。"},{"en":"In the game, Dihelios is the name of a character.","zh":"在这个游戏里，Dihelios 是一个角色的名字。"}]},{"partOfSpeech":"other","definition":{"en":"Possible word parts: di- (“two”) + Helios (the Greek sun god / “sun”). In that case, it could suggest “two suns” or “double sun,” but this is interpretive and not an established English term.","zh":"可能的构词：di-（“两个/双”）+ Helios（希腊太阳神/“太阳”）。若按此理解，可能暗示“两颗太阳/双太阳”，但这只是推测，并非英语里的固定用词。"},"examples":[{"en":"The title “Dihelios” might be chosen to suggest a world with two suns.","zh":"“Dihelios”这个标题可能用来暗示一个有两颗太阳的世界。"},{"en":"The logo uses sun imagery, so the name may connect to Helios.","zh":"标志使用了太阳意象，所以名字可能与 Helios 有关。"}]}],"synonyms":["(no direct synonyms; context-dependent)"],"phonetic":"/daɪˈhiːliˌɑːs/","extraExplanation":["如果你告诉我“dihelios”出现在哪里（例如：一句话、网站、游戏、论文、品牌页面），我可以更准确判断它是专有名词、拼写变体，还是你想查的其实是“Helios / di-”等相关词。","英语里更常见的相关词是：Helios（希腊神话的太阳神/太阳的拟人化），以及前缀 di-（表示“二、双”）。如果你想表达“双太阳/两颗太阳”的概念，常见说法是 “binary stars”（双星）、“two suns”（两颗太阳）、或更文学化的 “twin suns”（双子太阳）。"]}
{"word":"dihelium","summary":{"en":"Dihelium means a two-helium-atom molecule (He₂), usually only observed under special lab conditions; it can also refer to the dihelium ion (He₂⁺) in scientific writing.","zh":"dihelium 指由两个氦原子组成的分子（He₂），通常只在特殊实验条件下观察到；在学术语境中也可指二氦离子（He₂⁺）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a molecule made of two helium atoms (He₂), also called the helium dimer; it is extremely weakly bound and usually exists only under special laboratory conditions (e.g., very low temperatures).","zh":"由两个氦原子组成的分子（He₂），也叫“氦二聚体”；结合非常弱，通常只在特殊实验条件下（如极低温）才能观察到。"},"examples":[{"en":"Scientists detected dihelium only in ultra-cold experiments.","zh":"科学家只在超低温实验中探测到二氦。"},{"en":"Dihelium is not stable like oxygen (O₂).","zh":"二氦不像氧气（O₂）那样稳定。"}]},{"partOfSpeech":"n.","definition":{"en":"in some scientific contexts, a positively charged form such as the dihelium ion (He₂⁺).","zh":"在某些科学语境中，也可指带正电的形式，例如二氦离子（He₂⁺）。"},"examples":[{"en":"The paper discussed reactions involving the dihelium ion.","zh":"这篇论文讨论了涉及二氦离子的反应。"}]}],"synonyms":["helium dimer","He2","dihelium ion (He2+)"],"phonetic":"/daɪˈhiːliəm/","extraExplanation":["“di-”是前缀，表示“两个/双”。所以 dihelium 字面意思就是“两个氦”。","氦原子很“惰性”（不容易与别的原子形成稳定化学键），因此 He₂ 不像 O₂、N₂ 那样常见；它主要靠非常弱的范德华力勉强结合。","在日常英语里这个词几乎不会出现，多见于物理、化学或分子光谱相关的学术语境。"]}
{"word":"dihely","summary":{"en":"“dihely” isn’t a standard English word; it’s likely a typo or a proper name.","zh":"“dihely”不是标准英语单词；很可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a name/term from another language.","zh":"不是标准英语单词；更可能是拼写错误，或来自其他语言的人名/术语。"},"examples":[{"en":"I couldn’t find “dihely” in an English dictionary—could you share the sentence you saw it in?","zh":"我在英语词典里查不到“dihely”，你能把看到它的句子发我吗？"},{"en":"If you meant “direly,” it means “very badly” or “urgently.”","zh":"如果你想写的是“direly”，意思是“非常糟糕地 / 急迫地”。"}]}],"phonetic":"N/A","extraExplanation":["“dihely”在常见英语词典里没有收录，因此我无法给出可靠的发音与正式释义。最有效的办法是：把它出现的完整句子（或截图）发来，我可以根据上下文判断真正的词。","可能的拼写目标（取决于语境）：\n- direly（非常、迫切地）：We direly need help.\n- Dilley / DiHelly（可能是人名/地名/用户名等专有名词）\n- dietary（与饮食有关的，若你看到的是类似 di…ary 的拼写）"]}
{"word":"dihexagonal","summary":{"en":"Dihexagonal describes a crystal/shape related to hexagonal symmetry, often involving 12 equivalent faces (e.g., a dihexagonal prism).","zh":"Dihexagonal 指与六方对称相关、常呈现12个等价晶面的晶形（如双六方柱）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Crystallography/geometry) Having a form or symmetry based on two hexagonal sets; especially describing crystal forms (like a dihexagonal prism or dihexagonal dipyramid) with 12 related faces or edges derived from hexagonal symmetry.","zh":"（晶体学/几何）具有“双六方”结构或对称性的；尤指晶体形态（如双六方柱、双六方双锥），由六方对称性推导而来，常表现为12个相互对应的面或棱。"},"examples":[{"en":"Quartz can show dihexagonal crystal forms under certain growth conditions.","zh":"在某些生长条件下，石英可能呈现双六方晶形。"},{"en":"The diagram labels the solid as a dihexagonal prism, not a simple hexagonal prism.","zh":"图中将该立体标注为“双六方柱”，而不是普通的六方柱。"}]}],"synonyms":["dodecagonal (in a general 12-sided sense)","hexagonal (broader, less specific)"],"phonetic":"/ˌdaɪhɛkˈsæɡənəl/","extraExplanation":["“di-”表示“二、双”，“hexagonal”表示“六角形的/六方的”。在晶体学里，“dihexagonal”常用来命名六方晶系中的一种“晶形”（crystal form），例如 dihexagonal prism（双六方柱）和 dihexagonal dipyramid（双六方双锥）。它强调的是由六方对称操作生成的成组面（常见为12个等价面），而不是日常几何里随便画出的“12边形”。","这个词多见于矿物学、晶体学教材与研究文章，日常英语里很少用。学习时可把它当作“专业术语”，理解为“与六方对称相关、并扩展成双组六方面的形态”。"]}
{"word":"dihexahedral","summary":{"en":"An adjective used in crystallography meaning “having the form/symmetry of a dihexahedron (24-faced solid).”","zh":"晶体学用语的形容词，表示“具有双六面体（24面体）形状或对称性的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a dihexahedron; having the form or symmetry of a dihexahedron (a 24-faced solid found in crystallography, especially in the cubic system).","zh":"与“双六面体”有关的；具有双六面体形状或对称性的（双六面体是一种有24个面的立体，常见于晶体学，尤其是立方晶系）。"},"examples":[{"en":"The mineral sample shows a dihexahedral crystal habit under the microscope.","zh":"在显微镜下，这个矿物样品呈现出双六面体的晶形（晶体习性）。"},{"en":"In the cubic system, some crystals can develop dihexahedral faces as they grow.","zh":"在立方晶系中，一些晶体在生长过程中会形成双六面体的晶面。"}]}],"synonyms":["dihexahedric","dihexahedron-like"],"phonetic":"/ˌdaɪhɛkˈsædrəl/","extraExplanation":["这个词主要出现在晶体学/矿物学语境里。相关名词是 dihexahedron（双六面体），属于“多面体名称 + -al（形容词后缀）”的构词方式，表示“……形状的 / 与……有关的”。","日常英语几乎不用 dihexahedral；一般在描述晶体外形（crystal habit）、晶面（faces）或对称性（symmetry）时才会见到。"]}
{"word":"dihexahedron","summary":{"en":"A dihexahedron is a 24-faced polyhedron (often a cube with pyramids on its faces), also used as a term for a 24-faced crystal form.","zh":"dihexahedron 指一种有24个面的多面体（常可视作在立方体各面加棱锥形成），也可指晶体学中最多有24个晶面的晶形。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a geometric solid (polyhedron) with 24 triangular faces, often described as a cube with a small pyramid attached to each face; it is also known as a dyakis hexahedron","zh":"一种几何立体（多面体），有24个三角形面，常可理解为“在立方体每个面上加一个小四棱锥”形成的形状；也叫“二六面体／尖四方六面体（dyakis hexahedron）”"},"examples":[{"en":"The dihexahedron is a classic example of a Catalan solid.","zh":"二六面体是加泰罗尼亚立体（Catalan solid）的经典例子之一。"},{"en":"You can model a dihexahedron by placing a pyramid on each face of a cube.","zh":"你可以在立方体的每个面上加一个棱锥来做出二六面体的模型。"}]},{"partOfSpeech":"n.","definition":{"en":"(crystallography) a crystal form in the cubic (isometric) system that can show up to 24 faces","zh":"（晶体学）立方晶系（等轴晶系）中的一种晶形，最多可出现24个晶面"},"examples":[{"en":"In mineral descriptions, a dihexahedron may be listed as a possible crystal form.","zh":"在矿物描述中，二六面体可能会被列为一种可能出现的晶形。"}]}],"synonyms":["dyakis hexahedron"],"phonetic":"ˌdaɪˌhiːkˈsæhɪdrən","extraExplanation":["词源提示：di- 表示“二/双”，hexa- 表示“六”，-hedron 表示“面/座”，字面意思接近“与六面体相关的双重形式”。在几何里它常与“dyakis hexahedron（尖四方六面体）”互指。","学习提示：它不是日常词汇，多见于几何学、晶体学或多面体模型相关的书籍与论文。"]}
{"word":"dihtian","summary":{"en":"“dihtian” is not a standard English word; you may mean “dictation” (speech written down by someone else).","zh":"“dihtian” 不是标准英语单词；你可能想写的是 “dictation”（口述让别人记录的内容/过程）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"It looks like a misspelling. The closest common English word is “dictation,” meaning speech that someone says aloud for another person to write down (or type).","zh":"这看起来像是拼写错误。最接近的常见英语单词是 “dictation”，意思是“口述让别人记录（或打字）的内容/过程”。"},"examples":[{"en":"Our teacher gave us a dictation to practice spelling.","zh":"老师给我们做了一段听写来练习拼写。"},{"en":"Please speak slowly—I’m taking dictation.","zh":"请说慢一点——我在做口述记录。"}]}],"synonyms":["transcription (close)","oral test (in class context)"],"phonetic":"/dɪkˈteɪʃən/","extraExplanation":["“dihtian” 不是常见英语单词。如果你想查的是别的词（比如 dictation / diction / detention / dietitian），请告诉我你看到它的句子或正确拼写，我可以更准确地解释。"]}
{"word":"dihybrid","summary":{"en":"“Dihybrid” is used in genetics for something involving two traits, or for an organism heterozygous for two genes.","zh":"“dihybrid”用于遗传学：指同时涉及两种性状（两基因）的情况，或指在两基因位点均为杂合的个体。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Genetics) involving two different traits (two genes) at the same time, especially in a cross or an organism studied for two traits.","zh":"（遗传学）涉及两种不同性状（两个基因）的，尤指同时研究两种性状的杂交或个体。"},"examples":[{"en":"In a dihybrid cross, you track two traits at once, such as seed color and seed shape.","zh":"在二因子杂交中，你会同时追踪两种性状，例如种子颜色和种子形状。"},{"en":"The students predicted the offspring ratios from a dihybrid cross using a Punnett square.","zh":"学生用潘尼特方格预测二因子杂交后代的比例。"}]},{"partOfSpeech":"n.","definition":{"en":"An organism that is heterozygous for two different genes (carries two different alleles at each of two gene loci).","zh":"（生物个体）在两个不同基因位点都为杂合的个体（每个位点携带两种不同等位基因）。"},"examples":[{"en":"A pea plant with genotype AaBb is a dihybrid.","zh":"基因型为 AaBb 的豌豆植株是一个二因子杂合体。"},{"en":"When a dihybrid self-pollinates, its offspring can show many trait combinations.","zh":"当二因子杂合体自花授粉时，后代可能出现多种性状组合。"}]}],"synonyms":["two-trait (in context)","double heterozygote","AaBb (example genotype)"],"phonetic":"/daɪˈhaɪbrɪd/","extraExplanation":["“di-”表示“两个”，“hybrid”在遗传学里常指“杂合体”。因此 dihybrid 常见于高中/大学基础遗传学，用来讨论孟德尔的两性状杂交实验。","经典情况下（两个基因独立分配且完全显性），二因子杂交 AaBb × AaBb 的表型比例常写作 9:3:3:1；但若存在连锁、上位性或不完全显性等情况，比例会改变。"]}
{"word":"dihybridism","summary":{"en":"Dihybridism is genetics involving two traits at the same time, often discussed in dihybrid crosses.","zh":"Dihybridism 指遗传学中同时涉及两个性状的研究或杂交情境，常见于双杂交实验。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the study or situation in genetics where two traits (controlled by two different genes) are considered at the same time, often in a breeding experiment","zh":"遗传学中同时研究或涉及两个性状（由两个不同基因控制）的情况，常见于杂交实验"},"examples":[{"en":"In Mendel’s work, dihybridism helped explain how two traits can be inherited together.","zh":"在孟德尔的研究中，双杂交（dihybridism）帮助解释了两个性状如何一起遗传。"},{"en":"A classic question about dihybridism asks for the expected ratios in the offspring of a dihybrid cross.","zh":"关于双杂交的经典问题常会问：双杂交交配的后代会出现哪些预期比例。"}]}],"synonyms":["dihybrid inheritance","two-trait inheritance"],"phonetic":"/ˌdaɪˈhaɪbrɪˌdɪzəm/","extraExplanation":["“dihybridism”常与“dihybrid cross（双杂交）”一起出现，典型例子是同时观察豌豆的种子颜色与形状两个性状。在满足“自由组合定律”（两个基因彼此独立分配）的前提下，常见的后代表型比例是 9:3:3:1。","词源上，di- 表示“二、两个”，hybrid 表示“杂交、杂种”，因此整体含义就是“涉及两个性状的杂交/遗传情况”。"]}
{"word":"dihybrids","summary":{"en":"“Dihybrids” are organisms or crosses involving two traits in genetics.","zh":"“dihybrids”指遗传学中涉及两个性状的个体或杂交（双因子杂交）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Genetics) organisms or crosses involving two different traits (two pairs of genes), often studied to see how the traits are inherited together.","zh":"（遗传学）涉及两个不同性状（两对基因）的个体或杂交（双因子杂交），常用于研究这两个性状如何一起遗传。"},"examples":[{"en":"In Mendel’s experiments, dihybrids helped show that different traits can assort independently.","zh":"在孟德尔的实验中，双因子杂交帮助证明不同性状可以独立分配。"},{"en":"We counted the offspring from dihybrids to compare the results with the expected 9:3:3:1 ratio.","zh":"我们统计了双因子杂交后代的数量，并与预期的 9:3:3:1 比例进行比较。"}]}],"synonyms":["dihybrid organisms","dihybrid crosses","two-trait hybrids"],"phonetic":"/daɪˈhaɪbrɪdz/","extraExplanation":["“dihybrid”由“di-（两个）+ hybrid（杂交体）”构成；“dihybrids”是其复数形式。","在经典遗传学中，dihybrid cross（双因子杂交）常指两对等位基因都为杂合的个体相互交配（例如 AaBb × AaBb）。在性状独立分配且完全显性时，表型常出现 9:3:3:1 的比例。"]}
{"word":"dihydrate","summary":{"en":"A dihydrate is a compound that contains two water molecules in its crystal structure (often written as ·2H₂O).","zh":"dihydrate 指含有两分子结晶水的化合物（常写作 ·2H₂O）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound that contains two molecules of water (water of crystallization) per formula unit.","zh":"（化学）二水合物：每个化学式单位含有两分子结晶水的化合物。"},"examples":[{"en":"Calcium sulfate dihydrate is the main component of gypsum.","zh":"硫酸钙二水合物是石膏的主要成分。"},{"en":"The label says “CuSO₄·2H₂O,” which means it is a dihydrate.","zh":"标签写着“CuSO₄·2H₂O”，意思是它是二水合物。"}]}],"synonyms":["hydrate (with two waters)","dihydrated form"],"phonetic":"/daɪˈhaɪdreɪt/","extraExplanation":["“di-”表示“二、两”；“hydrate”与“水合”有关。常见写法是“盐·2H₂O”，读作“……二水合物”。不同水合数（如一水合物 monohydrate、五水合物 pentahydrate）会影响物质的质量、晶体形态与某些性质。"]}
{"word":"dihydrated","summary":{"en":"“Dihydrated” means a chemical substance contains two molecules of water per unit (a dihydrate form).","zh":"“Dihydrated”指某化学物质每个单位含两分子水（即二水合形式）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Containing two molecules of water in each unit of a compound; in the form of a dihydrate.","zh":"（化学）每个化合物单位含有两分子结晶水；呈“二水合物”形式的。"},"examples":[{"en":"Copper(II) chloride can form a dihydrated crystal under certain conditions.","zh":"在某些条件下，氯化铜（II）可以形成二水合晶体。"},{"en":"The lab label says the salt is dihydrated, so its molar mass is higher than the anhydrous form.","zh":"实验室标签写着该盐是二水合的，所以它的摩尔质量比无水形式更高。"}]}],"synonyms":["dihydrate (adj.)","dihydrate-form (adj.)","two-water (of crystallization) (contextual)"],"phonetic":"/daɪˈhaɪdreɪtɪd/","extraExplanation":["“dihydrated”常见于化学与材料科学语境，表示“含两分子水（通常为结晶水）”。更常用的名词形式是“dihydrate（二水合物）”，例如：calcium sulfate dihydrate（硫酸钙二水合物，即石膏）。","相关对比：anhydrous（无水的）、monohydrated/monohydrate（单水合的）、trihydrated/trihydrate（三水合的）。这些差别会影响摩尔质量、稳定性与加热失水行为。"]}
{"word":"dihydrazone","summary":{"en":"A dihydrazone is a compound with two hydrazone (–C=N–NH–) groups, commonly made from dicarbonyl compounds and hydrazine-type reagents.","zh":"二腙是一类含两个腙基（–C=N–NH–）的化合物，常由二羰基化合物与肼类试剂反应制得。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound that contains two hydrazone groups (–C=N–NH–) in the same molecule, often formed when a di-carbonyl compound reacts with hydrazine or substituted hydrazines","zh":"一种含有两个腙基（–C=N–NH–）的化合物，通常由二羰基化合物与肼或取代肼反应生成"},"examples":[{"en":"The chemist prepared a dihydrazone to help identify the unknown dicarbonyl compound.","zh":"化学家制备了一种二腙衍生物，用来帮助鉴定未知的二羰基化合物。"},{"en":"In the lab report, the dihydrazone was isolated as a yellow crystalline solid.","zh":"在实验报告中，该二腙被分离为黄色晶体固体。"}]}],"synonyms":["bis(hydrazone)","hydrazone derivative"],"phonetic":"/daɪˈhaɪdrəˌzoʊn/","extraExplanation":["“腙（hydrazone）”通常由羰基化合物（醛/酮）与肼类试剂缩合生成；“二腙（dihydrazone）”多见于含两个羰基的底物（如二醛、二酮），因此常用于有机分析中的“衍生化”来辅助鉴定或纯化。","在命名上，di- 表示“两个”；hydrazone 指“腙”。阅读化学文献时也可能看到更具体的名称（例如指出是哪种底物形成的二腙，或肼上取代基是什么）。"]}
{"word":"dihydric","summary":{"en":"Dihydric describes a molecule that contains two hydroxyl (–OH) groups.","zh":"dihydric 指含有两个羟基（–OH）的分子（“二羟基的”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Having two hydroxyl (–OH) groups in one molecule; containing two alcohol groups.","zh":"（化学）二羟基的；在一个分子中含有两个羟基（–OH）的；含两个醇基的。"},"examples":[{"en":"Ethylene glycol is a dihydric alcohol used in antifreeze.","zh":"乙二醇是一种用于防冻液的二羟基醇。"},{"en":"A dihydric compound often has different properties from a monohydric one.","zh":"二羟基化合物的性质常常与一羟基化合物不同。"}]}],"synonyms":["diol","dihydroxy","glycol (often, in context)"],"phonetic":"/daɪˈhaɪdrɪk/","extraExplanation":["“dihydric”由 di-（二）+ hydric（与氢/水有关，在这里指含羟基的性质）构成，常用于化学命名与描述。","在有机化学里，含两个 –OH 的化合物也常叫“diol”（二醇），例如 ethane-1,2-diol（乙二醇）。"]}
{"word":"dihydride","summary":{"en":"A chemistry term for a compound or species that contains two hydride (hydrogen) units.","zh":"化学术语：指含有两个氢化物（氢）单位的化合物或物种。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) A compound that contains two hydride units—i.e., two hydrogen atoms bonded as hydride (H−) or two hydrogen atoms attached to a central atom or group in a way described as a “dihydride.”","zh":"（化学）二氢化物；指含有两个“氢化物”单位的化合物——也就是含有两个以氢化物形式（H−）存在的氢，或在命名/描述中表示为与同一中心原子或基团相连的两个氢。"},"examples":[{"en":"Calcium dihydride is often written as CaH2.","zh":"氢化钙（二氢化钙）通常写作 CaH2。"},{"en":"In some reactions, a metal complex forms a dihydride intermediate before releasing hydrogen gas.","zh":"在一些反应中，金属配合物会先形成“二氢化物”中间体，然后再释放氢气。"},{"en":"The paper reports a stable dihydride species under low-temperature conditions.","zh":"该论文报告了一种在低温条件下稳定存在的二氢化物物种。"}]}],"synonyms":["calcium hydride (example)","metal dihydride (context term)"],"phonetic":"/daɪˈhaɪdraɪd/","extraExplanation":["“di-”表示“二、两个”，而“hydride”指“氢化物/氢化物离子（H−）”或“以氢化物方式与其他原子结合的氢”。因此 dihydride 字面意思就是“含两个氢化物单位的物质”。","在实际化学语境中，dihydride 既可能指简单盐类氢化物（如 CaH2），也常用于配位化学/有机金属化学，描述“同一金属中心上有两个氢配体”的结构（metal dihydride）。具体含义通常要结合上下文与结构式判断。"]}
{"word":"dihydrite","summary":{"en":"“Dihydrite” is a rare term meaning a dihydrate—something with two waters of crystallization.","zh":"“dihydrite”是很少见的词，一般指“二水合物（dihydrate）”，即含两分子结晶水的物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry/mineralogy, rare) A mineral or compound that contains two molecules of water bound in its crystal structure; a “dihydrate.”","zh":"（化学/矿物学，较少见）指晶体结构中结合有两分子结晶水的矿物或化合物；即“二水合物（dihydrate）”。"},"examples":[{"en":"Gypsum is calcium sulfate dihydrite (more commonly called calcium sulfate dihydrate).","zh":"石膏是硫酸钙二水合物（dihydrite 这种说法较少见，更常用 dihydrate）。"},{"en":"In older mineral descriptions, you may see “dihydrite” used where modern texts say “dihydrate.”","zh":"在一些较旧的矿物描述中，你可能会看到用“dihydrite”来表达现代教材所说的“dihydrate（二水合物）”。"}]}],"synonyms":["dihydrate","hydrate (general)"],"phonetic":"/daɪˈhaɪdraɪt/","extraExplanation":["“dihydrite”在现代英语里非常罕见，很多时候是旧用法、非标准用法，或把“dihydrate（二水合物）”误写/误用成“dihydrite”。如果你是在化学或材料论文里看到它，建议回到上下文确认作者是否其实指“dihydrate”。","词形上：di- 表示“二/两个”，hydrate 表示“水合物”。“dihydrite”常被理解为“二水合物（含两分子结晶水）”。"]}
{"word":"dihydrochloride","summary":{"en":"Dihydrochloride is a chemical salt form of a compound containing two hydrochloride (HCl) units, commonly used in pharmaceuticals.","zh":"dihydrochloride 指“二盐酸盐”，即含两个盐酸当量的成盐形式，常见于药物成分名称中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical form of a compound that contains two hydrochloride (HCl) units, usually meaning the compound is a salt made by adding two equivalents of hydrochloric acid; often used in medicine to improve stability or solubility","zh":"（化学/药学）二盐酸盐：指一种化合物带有两个“盐酸（HCl）”当量形成的盐，常用于药物制剂中以提高稳定性或溶解度"},"examples":[{"en":"The label says the active ingredient is sertraline dihydrochloride.","zh":"标签上写的有效成分是“盐酸舍曲林（sertraline dihydrochloride）”。"},{"en":"This compound is sold as a dihydrochloride salt to increase its water solubility.","zh":"这种化合物以二盐酸盐形式销售，以提高其水溶性。"}]}],"synonyms":["dihydrochloride salt","bis(hydrochloride)"],"phonetic":"/ˌdaɪhaɪdrəˈklɔːraɪd/","extraExplanation":["在药品名称里，*hydrochloride* 表示“盐酸盐”，*dihydrochloride* 表示“二盐酸盐”（通常意味着该分子有两个可被盐酸“成盐”的位点，如两个胺基）。这并不一定表示分子里“有两分子盐酸游离存在”，而是表示成盐比例/化学计量关系。","读配方或说明书时，看到 *X dihydrochloride*，可以理解为“X 的二盐酸盐形式”。不同盐型可能影响药物的溶解度、稳定性、口感或生产工艺，但不一定改变其核心药理作用。"]}
{"word":"dihydrocupreine","summary":{"en":"Dihydrocupreine is a specialized chemical name for a quinine-family alkaloid/derivative, mostly seen in scientific writing.","zh":"dihydrocupreine 是一种奎宁家族的生物碱/衍生物的专业化学名称，主要见于科研文献。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a quinine-related alkaloid (an organic chemical from the cinchona/quinine family), mainly used in laboratory and chemical contexts rather than everyday speech","zh":"一种与奎宁相关的生物碱（属于金鸡纳/奎宁类有机化合物），主要用于化学与实验室领域，不常用于日常英语"},"examples":[{"en":"Dihydrocupreine is discussed mostly in chemistry and pharmacology references, not in general conversation.","zh":"dihydrocupreine 通常出现在化学或药理学资料中，而不是日常对话里。"},{"en":"The paper lists dihydrocupreine among quinine derivatives used to study antibacterial activity.","zh":"论文把 dihydrocupreine 列为用于研究抗菌活性的奎宁衍生物之一。"}]}],"synonyms":["hydrocupreine","quinine derivative"],"phonetic":"/daɪˌhaɪdroʊˈkjuːpriːn/","extraExplanation":["词形拆解：di-（二）+ hydro（氢/加氢）+ cupreine（与奎宁同系的生物碱名）。整体意思可理解为“被加氢（还原）后的 cupreine”。","相关术语：你可能会在微生物学里看到 ethylhydrocupreine hydrochloride（又名 optochin，中文常译“奥普托辛/奥普托钦”），用于实验室中区分肺炎链球菌；它与 cupreine/（二）氢化 cupreine 属同一类衍生物。"]}
{"word":"dihydrocuprin","summary":{"en":"Dihydrocuprin is a rare, historical term for a quinine-related antimalarial drug (often appearing as the spelling dihydrocuprine).","zh":"Dihydrocuprin 是一个较少见的历史用语，指与奎宁相关的抗疟药物（常见拼写为 dihydrocuprine）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a drug related to quinine, used historically as an antimalarial; also spelled dihydrocuprine (and sometimes treated as a variant name of dihydroquinine in older texts).","zh":"一种与奎宁相关的药物，历史上用于抗疟；也常见拼写为 dihydrocuprine（在较老的资料中有时被视为 dihydroquinine 的异名或变体名称）。"},"examples":[{"en":"In early 20th‑century medical reports, dihydrocuprin was discussed as a potential antimalarial agent.","zh":"在20世纪早期的医学报告中，dihydrocuprin 被讨论为一种潜在的抗疟药物。"},{"en":"The paper notes that dihydrocuprin is closely related to quinine derivatives.","zh":"该论文指出 dihydrocuprin 与奎宁的衍生物关系密切。"}]}],"synonyms":["dihydrocuprine","dihydroquinine (older/variant usage)","quinine derivative"],"phonetic":"/daɪˌhaɪdroʊˈkjuːpraɪn/","extraExplanation":["这是一个较少见、偏历史文献/化学命名的词，现代英语中更常见的是 **dihydrocuprine** 或直接使用更通行的相关名词（如 **dihydroquinine**、**quinine derivative**）。如果你是在某篇论文或药品目录里看到它，建议核对原文是否其实写的是 *dihydrocuprine*。"]}
{"word":"dihydroergotamine","summary":{"en":"Dihydroergotamine is a prescription drug used to treat acute migraine and cluster headaches.","zh":"二氢麦角胺是一种处方药，用于治疗急性偏头痛和丛集性头痛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a prescription medicine used to treat acute migraine and cluster headache by narrowing certain blood vessels and affecting serotonin receptors","zh":"一种处方药，用于治疗急性偏头痛和丛集性头痛；通过收缩部分血管并影响血清素受体来缓解头痛"},"examples":[{"en":"The doctor prescribed dihydroergotamine for her severe migraine attacks.","zh":"医生给她开了二氢麦角胺，用于治疗严重的偏头痛发作。"},{"en":"Dihydroergotamine is often given as a nasal spray or injection in emergency settings.","zh":"在急诊等场景中，二氢麦角胺常以鼻喷剂或注射的方式给药。"},{"en":"He was told not to use dihydroergotamine if he had certain heart or blood vessel problems.","zh":"他被告知如果有某些心脏或血管问题，就不要使用二氢麦角胺。"}]}],"synonyms":["DHE","dihydroergotamine mesylate"],"phonetic":"/daɪˌhaɪdroʊ ɚˈɡɑːtəˌmiːn/","extraExplanation":["“dihydro-”表示“二氢/加氢”，而“ergotamine（麦角胺）”来自“麦角（ergot）”——一种会感染黑麦等谷物的真菌；二氢麦角胺属于麦角生物碱类药物。","此词多用于医学语境。它通常用于“急性发作的止痛/缓解”，而不是日常“预防偏头痛”。与某些药物（如部分抗真菌药、抗生素、HIV 蛋白酶抑制剂等）可能发生相互作用；具体用药需遵医嘱。","常见缩写：DHE。常见商品名之一：Migranal（鼻喷）。"]}
{"word":"dihydrogen","summary":{"en":"Dihydrogen means H₂, the two-atom form of hydrogen (hydrogen gas).","zh":"dihydrogen 指 H₂，即由两个氢原子组成的氢气分子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A molecule made of two hydrogen atoms bonded together; the chemical formula is H₂. It is commonly called “hydrogen gas.”","zh":"由两个氢原子结合而成的分子；化学式为 H₂。通常称为“氢气”。"},"examples":[{"en":"In chemistry class, we learned that dihydrogen (H₂) is a gas at room temperature.","zh":"在化学课上，我们学到二氢（H₂）在室温下是气体。"},{"en":"Dihydrogen is used as a fuel in some fuel cells.","zh":"二氢在一些燃料电池中用作燃料。"}]}],"synonyms":["hydrogen gas","H2"],"phonetic":"/daɪˈhaɪdrədʒən/","extraExplanation":["“dihydrogen”是更偏科学、较正式的说法：前缀 di- 表示“二、两个”，所以 dihydrogen 字面意思就是“两个氢原子组成的氢”。在日常英语里更常说 hydrogen 或 hydrogen gas。","注意区分：dihydrogen (H₂) 是“氢气分子”，而 hydrogen (H) 也可能指“氢元素/氢原子”的概念；具体含义要看上下文。"]}
{"word":"dihydrol","summary":{"en":"Dihydrol is a brand name, commonly referring to the migraine medicine dihydroergotamine.","zh":"Dihydrol 是一个药品商标名，常指用于偏头痛的二氢麦角胺。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand name for the medicine dihydroergotamine (an ergot-derived drug), used mainly to treat migraine headaches in some countries","zh":"一种药品商标名，常指二氢麦角胺（麦角生物碱类药物），在一些国家主要用于治疗偏头痛"},"examples":[{"en":"The doctor prescribed Dihydrol to help control her severe migraines.","zh":"医生开了 Dihydrol 来帮助控制她严重的偏头痛。"},{"en":"Dihydrol is a brand name; the active ingredient is dihydroergotamine.","zh":"Dihydrol 是商标名；其有效成分是二氢麦角胺。"}]}],"synonyms":["dihydroergotamine","DHE"],"phonetic":"/daɪˈhaɪdrɔl/","extraExplanation":["“Dihydrol”通常是商品名，不是通用名；不同国家/地区的配方与适应症可能不同。用药信息应以药盒说明书与医生/药师建议为准。","二氢麦角胺属于麦角类药物，可能与某些药物发生相互作用，也并非适合所有人（如部分心血管疾病患者）。若你是在阅读处方或药品说明书时遇到该词，建议核对其通用名（generic name）与剂量。"]}
{"word":"dihydromorphinone","summary":{"en":"Dihydromorphinone is hydromorphone, a powerful opioid painkiller used for severe pain.","zh":"dihydromorphinone 指氢吗啡酮（hydromorphone），一种用于严重疼痛的强效阿片类止痛药。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong opioid pain medicine (the drug hydromorphone), used to treat severe pain; it is a controlled substance because it can cause dependence and overdose","zh":"一种强效阿片类镇痛药（即氢吗啡酮 hydromorphone），用于治疗严重疼痛；因可能成瘾并导致过量而受管制"},"examples":[{"en":"The doctor prescribed dihydromorphinone to control the patient’s severe post-surgery pain.","zh":"医生开了二氢吗啡酮来控制病人术后严重疼痛。"},{"en":"Dihydromorphinone should be taken exactly as directed because it can slow breathing.","zh":"二氢吗啡酮必须严格按医嘱服用，因为它可能抑制呼吸。"}]}],"synonyms":["hydromorphone","Dilaudid"],"phonetic":"/daɪˌhaɪdroʊˈmɔːrfiˌnoʊn/","extraExplanation":["词源拆解：di-（“二/两个”）+ hydro（“氢/加氢”）+ morphine（“吗啡”）+ -one（“酮”，常见于化学命名）。这个名称常见于药学/化学语境；在临床与日常英语中更常用 hydromorphone（商品名之一为 Dilaudid）。","用法提示：在英语里它通常作为不可数名词或药名使用（不常用复数）；在医学写作中常与 dosage（剂量）、pain management（疼痛管理）、side effects（副作用）等词搭配。","安全与文化背景：英语国家对这类药物通常强调“按处方使用、避免与酒精/镇静药同用、注意成瘾与过量风险”，与阿片类药物滥用问题有关。"]}
{"word":"dihydronaphthalene","summary":{"en":"Dihydronaphthalene is a partially hydrogenated form of naphthalene, mainly used as a chemical intermediate.","zh":"dihydronaphthalene（二氢萘）是萘的部分加氢产物，主要用作化学中间体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a partially hydrogenated form of naphthalene (a bicyclic aromatic hydrocarbon), usually referring to compounds with the formula C₁₀H₁₀ such as 1,2-dihydronaphthalene; used mainly as an intermediate in organic chemistry.","zh":"萘的部分加氢产物（双环芳香烃），通常指分子式为 C₁₀H₁₀ 的二氢萘类化合物（如 1,2-二氢萘）；主要在有机化学中用作中间体。"},"examples":[{"en":"In the lab, dihydronaphthalene can be produced by partially hydrogenating naphthalene.","zh":"在实验室里，二氢萘可以通过对萘进行部分加氢来制备。"},{"en":"The reaction uses dihydronaphthalene as an intermediate before forming a more stable aromatic product.","zh":"该反应以二氢萘作为中间体，然后生成更稳定的芳香产物。"},{"en":"Different isomers of dihydronaphthalene may show slightly different reactivity.","zh":"不同的二氢萘异构体可能表现出略有差异的反应性。"}]}],"synonyms":["dihydronaphthalene (isomers)","1,2-dihydronaphthalene"],"phonetic":"/daɪˌhaɪdroʊ næfˈθiːliːn/","extraExplanation":["“di-”表示“两个”，“hydro-”与氢有关，“naphthalene”是“萘”。整体字面意思就是“加了两个氢的萘”。","二氢萘不是日常英语词汇，更多出现在化学论文、专利或有机合成语境中。实际可指不同位置加氢得到的异构体（例如 1,2-二氢萘、1,4-二氢萘）。"]}
{"word":"dihydronicotine","summary":{"en":"Dihydronicotine is a scientific term for a nicotine-related chemical compound (a reduced form of nicotine).","zh":"dihydronicotine 是科学术语，指一种与尼古丁相关的化合物（可理解为还原型尼古丁）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound closely related to nicotine; it is a reduced form of nicotine (often discussed in chemistry or tobacco research).","zh":"一种与尼古丁密切相关的化学化合物；可理解为“被还原的尼古丁”（常见于化学或烟草研究语境）。"},"examples":[{"en":"Some studies compare nicotine with dihydronicotine to understand how small structural changes affect biological activity.","zh":"一些研究会比较尼古丁和二氢尼古丁，以了解结构的细微变化如何影响生物活性。"},{"en":"Dihydronicotine is mainly used as a research chemical rather than a common consumer product.","zh":"二氢尼古丁主要用作研究化学品，而不是常见的消费品。"}]}],"synonyms":["dihydronicotine (variant spelling)","hydrogenated nicotine (descriptive)"],"phonetic":"/daɪˌhaɪdroʊˈnɪkəˌtiːn/","extraExplanation":["词源拆解：di- 表示“二/双”，hydro- 与“氢/加氢”有关，-nicotine 指“尼古丁”。合起来通常暗示“在尼古丁结构上增加了氢（发生还原/加氢）”，因此常被描述为“还原型尼古丁”。","该词属于专业术语，日常英语里几乎不会出现；更常见的是 nicotine（尼古丁）以及与之相关的 tobacco alkaloids（烟草生物碱）等表达。"]}
{"word":"dihydrosphingosine","summary":{"en":"Dihydrosphingosine is a biochemical molecule (also called sphinganine) that serves as a basic building block for sphingolipids in cells.","zh":"Dihydrosphingosine（亦称 sphinganine）是一种生物化学分子，是细胞内合成鞘脂的重要基础构件。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long-chain amino alcohol (a “sphingoid base”) found in cells; it is a building block for sphingolipids and is also called sphinganine.","zh":"一种长链氨基醇（“鞘氨醇骨架/鞘氨醇类碱基”），存在于细胞中；是合成鞘脂的重要基础成分，也称为“鞘氨醇胺/鞘氨醇烷（sphinganine）”。"},"examples":[{"en":"In biochemistry, dihydrosphingosine is a precursor used to make ceramide.","zh":"在生物化学中，dihydrosphingosine 是合成神经酰胺（ceramide）的前体。"},{"en":"Researchers measured dihydrosphingosine levels to study sphingolipid metabolism.","zh":"研究人员通过测量 dihydrosphingosine 的水平来研究鞘脂代谢。"}]}],"synonyms":["sphinganine","dihydrosphingosine (DHS)"],"phonetic":"/daɪˌhaɪdroʊˈsfɪŋɡoʊsiːn/","extraExplanation":["词源提示：di-（二、两）+ hydro（氢/还原，表示更“饱和”）+ sphingosine（鞘氨醇）。它与 sphingosine 的区别常用一句话记：dihydrosphingosine 更“饱和”，少一个双键，因此又常被称为 sphinganine。","学习关联：常在“sphingolipid metabolism（鞘脂代谢）/ ceramide（神经酰胺）/ sphingomyelin（鞘磷脂）”等主题中出现。若你在论文或检验报告里看到它，多半是在讨论细胞膜成分或脂质信号通路。"]}
{"word":"dihydrostreptomycin","summary":{"en":"Dihydrostreptomycin is an aminoglycoside antibiotic related to streptomycin, used mainly in veterinary medicine and sometimes in labs.","zh":"二氢链霉素是一种与链霉素相关的氨基糖苷类抗生素，主要用于兽医领域，也可用于部分实验室研究。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an antibiotic (an aminoglycoside) related to streptomycin, used mainly in veterinary medicine and sometimes in laboratory work; it is effective against certain bacteria but can have serious side effects (especially hearing and kidney damage).","zh":"二氢链霉素：一种与链霉素相关的氨基糖苷类抗生素，主要用于兽医领域及部分实验室研究；可抑制某些细菌，但可能带来严重副作用（尤其是听力与肾脏损害）。"},"examples":[{"en":"The veterinarian prescribed dihydrostreptomycin to treat a bacterial infection in the livestock.","zh":"兽医开了二氢链霉素来治疗家畜的细菌感染。"},{"en":"Dihydrostreptomycin should be used carefully because aminoglycosides can harm hearing.","zh":"二氢链霉素应谨慎使用，因为氨基糖苷类药物可能损害听力。"}]}],"synonyms":["dihydro-streptomycin","streptomycin derivative","aminoglycoside antibiotic"],"phonetic":"/daɪˌhaɪdroʊˌstrɛp.təˈmaɪ.sɪn/","extraExplanation":["二氢链霉素（dihydrostreptomycin）是链霉素的衍生物，属于“氨基糖苷类”抗生素。它的名称里：dihydro- 表示“加氢/更饱和的”，streptomycin 指“链霉素”。","在很多国家/地区，人用方面的应用已非常有限或被更安全的药物替代；在动物用药中也往往有严格的残留与监管要求。实际用药需遵循当地法规与专业医嘱。"]}
{"word":"dihydrotachysterol","summary":{"en":"Dihydrotachysterol is a vitamin D–like drug used to increase calcium absorption and treat low blood calcium.","zh":"Dihydrotachysterol（二氢速甾醇）是一种维生素D类似药，用于促进钙吸收并治疗低血钙。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a synthetic form of vitamin D used as a medicine to help the body absorb calcium, especially to treat low blood calcium (hypocalcemia) and conditions such as hypoparathyroidism.","zh":"一种合成的维生素D类药物，用于帮助身体吸收钙，常用于治疗低血钙（hypocalcemia）以及甲状旁腺功能减退等情况。"},"examples":[{"en":"The doctor prescribed dihydrotachysterol to raise her blood calcium level.","zh":"医生开了二氢速甾醇来提高她的血钙水平。"},{"en":"Patients taking dihydrotachysterol often need regular blood tests to monitor calcium.","zh":"服用二氢速甾醇的患者通常需要定期抽血监测钙水平。"}]}],"synonyms":["vitamin D analog","vitamin D derivative"],"phonetic":"/daɪˌhaɪdroʊtəˈkɪstərɔl/","extraExplanation":["二氢速甾醇（dihydrotachysterol）属于维生素D类似物，作用与“帮助肠道吸收钙、调节钙磷代谢”有关，因此用药时常会搭配监测血钙、血磷与肾功能。","学习与阅读医学英语时，你可能会在药品说明书或病历中看到它；它更常出现在专业语境中，而非日常口语。"]}
{"word":"dihydroxy","summary":{"en":"“Dihydroxy” means containing two hydroxyl (–OH) groups in a molecule.","zh":"“dihydroxy”表示分子中含有两个羟基（–OH）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two hydroxyl (–OH) groups in a molecule; describing a chemical compound with two –OH groups.","zh":"（化学）含有两个羟基（–OH）的；指分子中有两个–OH基团的化合物。"},"examples":[{"en":"Ethylene glycol is a dihydroxy alcohol often used in antifreeze.","zh":"乙二醇是一种二羟基醇，常用于防冻液。"},{"en":"The paper discusses dihydroxy compounds found in plant extracts.","zh":"这篇论文讨论了植物提取物中的二羟基化合物。"}]}],"synonyms":["diol","dihydric (less common)"],"phonetic":"ˌdaɪhaɪˈdrɑːksi","extraExplanation":["“dihydroxy-”常见于化学命名中作为前缀，表示“有两个羟基”。例如：dihydroxybenzene（苯二酚类，常见异构体有 catechol/儿茶酚、resorcinol/间苯二酚、hydroquinone/对苯二酚）。","在有机化学里，含两个羟基的化合物也常被称为“diol（二醇）”；不过“dihydroxy-”更偏向命名/描述结构，“diol”更像是类别名称。"]}
{"word":"dihydroxyacetone","summary":{"en":"Dihydroxyacetone is a chemical used in self-tanners to create temporary skin darkening.","zh":"Dihydroxyacetone（二羟基丙酮）是免晒美黑产品中的成分，用来让皮肤暂时变深色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A colorless chemical (a simple sugar) used mainly in self-tanning products; it reacts with proteins in the outer layer of skin to create a temporary brown color.","zh":"一种无色化学物质（简单糖类），主要用于免晒美黑产品；它会与皮肤表层的蛋白质反应，产生暂时的棕色肤色。"},"examples":[{"en":"Most self-tanning lotions use dihydroxyacetone to darken the skin without sun exposure.","zh":"大多数免晒美黑乳会使用二羟基丙酮，在不晒太阳的情况下让肤色变深。"},{"en":"The label says the product contains dihydroxyacetone and should be applied evenly.","zh":"标签上写着该产品含有二羟基丙酮，应均匀涂抹。"}]}],"synonyms":["DHA","glycerone"],"phonetic":"/daɪˌhaɪˌdrɑːksiˈæsɪˌtoʊn/","extraExplanation":["二羟基丙酮常缩写为 DHA，是免晒美黑（spray tan / self-tanner）里最常见的有效成分之一。它主要与皮肤角质层中的氨基酸发生“美拉德反应”（类似烤面包变褐的化学反应），所以颜色一般持续几天到一周左右，随着角质脱落而变淡。","使用含 DHA 的产品时，常见建议包括：先去角质、分区薄涂、关节处少量、涂后等待干透再穿衣；否则容易出现色块或“橘色感”。","在成分表中你可能会看到它写作 “dihydroxyacetone” 或 “DHA”。注意它不是“防晒”，美黑不等于防紫外线。"]}
{"word":"dihydroxysuccinic","summary":{"en":"A chemistry adjective meaning “related to dihydroxysuccinic acid,” commonly referring to tartaric acid.","zh":"一个化学形容词，意为“与二羟基丁二酸有关”，常指酒石酸。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Relating to dihydroxysuccinic acid; containing two hydroxyl (–OH) groups on a succinic-acid backbone (commonly referring to tartaric acid or its derivatives).","zh":"（化学）与“二羟基丁二酸”有关的；指在丁二酸骨架上带有两个羟基（–OH）的化合物（常常指酒石酸或其衍生物）。"},"examples":[{"en":"Tartaric acid is also called dihydroxysuccinic acid in systematic naming.","zh":"酒石酸在系统命名中也叫二羟基丁二酸。"},{"en":"The paper discusses dihydroxysuccinic derivatives used as food additives.","zh":"这篇论文讨论了用作食品添加剂的二羟基丁二酸衍生物。"}]}],"synonyms":["tartaric"],"phonetic":"/daɪhaɪˌdrɑksi səkˈsɪnɪk/","extraExplanation":["“dihydroxysuccinic”多见于学术或工业语境，是一种偏“系统命名”的形容词，用来描述结构：di-（两个）+ hydroxy-（羟基）+ succinic（与丁二酸/琥珀酸有关）。日常英语里更常直接说“tartaric acid（酒石酸）”或“tartaric”。","酒石酸天然存在于葡萄、酒、罗望子等中，常用于食品的酸味调节、起泡粉/泡打粉配方，以及与金属离子形成“酒石酸盐（tartrate）”。"]}
{"word":"dihydroxytoluene","summary":{"en":"Dihydroxytoluene is a chemical term for a toluene ring with two hydroxyl (–OH) groups (a tolulenediole).","zh":"dihydroxytoluene 指“二羟基甲苯”，即在甲苯芳香环上连有两个羟基（–OH）的化合物（甲苯二酚/甲基苯二醇）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound: a toluene (methylbenzene) ring that has two hydroxyl (–OH) groups attached; also called a tolulenediole (methylbenzene diol).","zh":"一种化学化合物：在甲苯（甲基苯）芳香环上连有两个羟基（–OH）的化合物；也可称为甲苯二酚/甲基苯二醇（toluenediol）。"},"examples":[{"en":"The lab synthesized a dihydroxytoluene as an intermediate for a dye.","zh":"实验室合成了一种二羟基甲苯，用作染料的中间体。"},{"en":"Different dihydroxytoluene isomers have different melting points.","zh":"不同异构体的二羟基甲苯有不同的熔点。"}]}],"synonyms":["toluenediol","methylbenzene diol","dihydroxy toluene"],"phonetic":"/daɪˌhaɪdrɑksiˈtoʊljuiːn/","extraExplanation":["“dihydroxy-”表示“有两个羟基（two –OH groups）”，“toluene/甲苯”是带一个甲基（–CH3）的苯环；合起来就是“在甲苯环上再有两个羟基”的一类物质。","它不是单一分子，通常指一组位置异构体（如2,3-、2,4-、2,5-、2,6-等甲苯二酚），羟基连在芳香环的不同位置会显著影响性质与用途。","在资料或实验记录里也可能写作“dihydroxy toluene”“toluenediol”或“methylbenzene diol”，指的基本是同一类化合物。"]}
{"word":"dihysteria","summary":{"en":"“Dihysteria” is not a standard English word; it is probably meant to be “hysteria.”","zh":"“dihysteria”不是标准英语词；很可能你想写的是“hysteria”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or very rare form; most likely a misspelling or mistaken variant of “hysteria” (a state of extreme, uncontrollable emotion or panic).","zh":"非标准或极少见的形式；很可能是对“hysteria”（歇斯底里；极度失控的情绪或恐慌）的拼写/用词错误。"},"examples":[{"en":"I can’t find “dihysteria” in standard dictionaries—did you mean “hysteria”?","zh":"我在常见词典里找不到“dihysteria”——你是不是想写“hysteria”？"},{"en":"The rumor caused hysteria in the crowd.","zh":"这条谣言在人群中引发了恐慌。"}]}],"synonyms":["hysteria","panic","uproar"],"phonetic":"/daɪhɪˈstɪriə/","extraExplanation":["“di-”在英语里常见作前缀，表示“二、双”（如 dioxide 二氧化物，bilingual 双语）。但“dihysteria”并不是常用或规范构词，通常应核对原词来源。","如果你想表达医学/心理相关概念：hysteria 常被更具体的诊断术语取代；日常语境里多指“群体恐慌/失控反应”。"]}
