{"word":"diiamb","summary":{"en":"A “diiamb” is a metrical foot made of two iambs (˘ ¯ ˘ ¯).","zh":"“diiamb”指由两个抑扬格组成的音步（˘ ¯ ˘ ¯）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a metrical unit (foot) made of two iambs in a row (iamb + iamb), often shown as ˘ ¯ ˘ ¯.","zh":"（诗歌格律）由两个抑扬格连在一起组成的音步（抑扬格+抑扬格），常写作 ˘ ¯ ˘ ¯。"},"examples":[{"en":"In classical-style scansion, the line can be read as a sequence of diiambs.","zh":"在古典式的格律划分中，这一行可以读作一连串的“双抑扬格音步（diiambs）”。"},{"en":"A diiamb contains four syllables: unstressed–stressed–unstressed–stressed.","zh":"diiamb 一共有四个音节：轻读–重读–轻读–重读。"}]}],"synonyms":["double iamb","diambus"],"phonetic":"ˈdaɪiæm","extraExplanation":["“diiamb”很少见，更多时候你会看到更常用的说法：iamb（抑扬格）或 iambic meter（抑扬格格律）。它强调的是“两个 iamb 连在一起”的结构，有时也会被称为 double iamb（双抑扬格）或 diambus（较少见）。","学习格律时，记号里 ˘ 表示轻读（unstressed），¯ 表示重读（stressed）。diiamb 的节奏就是：da-DUM da-DUM。"]}
{"word":"diiambus","summary":{"en":"A poetic metrical foot made of two iambs (da-DUM da-DUM).","zh":"诗歌格律中的“双抑扬格”：由两个抑扬格组成（轻-重 轻-重）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Poetry) A metrical foot made of two iambs (four syllables total), typically in the pattern unstressed–stressed, unstressed–stressed (da-DUM da-DUM).","zh":"（诗歌）“双抑扬格”，由两个抑扬格组成的音步（共四个音节），常见重音模式为 轻-重、轻-重（da-DUM da-DUM）。"},"examples":[{"en":"In some classical verse, a diiambus can create a quick, forward-moving rhythm.","zh":"在一些古典诗歌中，“双抑扬格”能制造一种快速、向前推进的节奏。"},{"en":"The line scans as a diiambus in that segment: da-DUM da-DUM.","zh":"这一段的格律可分析为双抑扬格：轻-重 轻-重。"}]}],"synonyms":["double iamb","disyllabic iamb (less common)"],"phonetic":"/daɪˈæmbəs/","extraExplanation":["这是格律学（prosody）里的术语，比较偏学术，日常英语几乎不用。更常见的相关词是 iamb（抑扬格）和 iambic（抑扬格的）。","diiambus 源自希腊语：di- 表示“两个”，iambus 指“抑扬格”。所以字面意思就是“两个抑扬格”。","如果你在读莎士比亚或英语诗歌入门材料，更常遇到的是 iambic pentameter（五音步抑扬格），而不是 diiambus。"]}
{"word":"diimide","summary":{"en":"Diimide is an unstable, highly reactive reducing agent (HN=NH, diazene) often used to hydrogenate alkenes without hydrogen gas.","zh":"二亚胺是指不稳定、反应性很强的还原剂（HN=NH，二氮烯），常用于在不通氢气的情况下对烯烃进行加氢还原。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) A very reactive compound with the formula HN=NH (also called diazene), used as a mild reducing agent to add hydrogen to carbon–carbon double bonds (alkenes).","zh":"（化学）一种非常活泼的化合物，化学式为 HN=NH（也叫二氮烯 diazene），常作温和还原剂，用来给碳-碳双键（烯烃）加氢。"},"examples":[{"en":"Diimide can reduce an alkene to an alkane without using hydrogen gas.","zh":"二亚胺可以在不使用氢气的情况下把烯烃还原成烷烃。"},{"en":"In many labs, diimide is generated in situ and used immediately because it is unstable.","zh":"在很多实验室里，二亚胺通常是原位生成并立即使用，因为它不稳定。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) A general name for a compound containing two imide-type –NH– groups; in practice, the word most often refers to HN=NH (diazene).","zh":"（较少见）含有两个类似“酰亚胺/亚胺型”–NH–基团的化合物的统称；但在实际使用中，这个词最常指 HN=NH（二氮烯）。"},"examples":[{"en":"When chemists say “diimide reduction,” they usually mean reduction by HN=NH (diazene).","zh":"化学家说“二亚胺还原”时，通常指由 HN=NH（二氮烯）进行的还原反应。"}]}],"synonyms":["diazene","HN=NH"],"phonetic":"/daɪˈɪmaɪd/","extraExplanation":["在有机化学里，“diimide reduction（二亚胺还原）”很有名：它常用于选择性地把烯烃（C=C）还原为烷烃（C–C），而对很多其他官能团相对温和。","二亚胺往往不单独保存，而是用前体（例如肼类/磺酰肼类等）在反应体系中原位生成；反应过程中二亚胺分解会放出氮气（N₂），这也是它常被“用完即走”的原因之一。"]}
{"word":"diimine","summary":{"en":"A chemistry term for a molecule containing two imine (C=N) groups.","zh":"化学术语：含有两个亚胺（C=N）基团的分子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) A compound that contains two imine groups (–C=N–) in the same molecule; also used more loosely for related structures such as diimines used as ligands in coordination chemistry.","zh":"（化学）指在同一分子中含有两个亚胺基（–C=N–）的化合物；在配位化学中也常较宽泛地指作为配体使用的此类二亚胺结构。"},"examples":[{"en":"Many diimines act as ligands and bind strongly to metal ions.","zh":"许多二亚胺可作为配体，并能与金属离子牢固配位。"},{"en":"The catalyst was prepared by reacting a diimine with a nickel salt.","zh":"该催化剂是通过让二亚胺与镍盐反应制得的。"}]}],"synonyms":["bis-imine","diimine ligand"],"phonetic":"/daɪˈiːmiːn/","extraExplanation":["“diimine”中的前缀“di-”表示“两个”，而“imine/亚胺”指含有–C=N–键的官能团；因此“diimine”直观含义就是“含两个亚胺基的分子”。","注意不要与“diimide（二亚胺/二亚氮烯，HN=NH）”混淆：diimide 含两个–NH–并常用于有机合成中的还原（如对烯烃进行加氢还原），而 diimine 通常强调两个–C=N–结构。"]}
{"word":"diiodid","summary":{"en":"“diiodid” doesn’t appear to be a standard English word; it may be a misspelling (e.g., “diiodide,” “iodide,” or “dioxide”).","zh":"“diiodid” 不是标准英文单词，可能是拼写错误（例如 “diiodide / iodide / dioxide”）。"},"extraExplanation":["“diiodid” 不是常见的英文单词拼写，我在常用词典里也找不到对应词条。你可能想写的是下面之一：\n1) diiodide：化学用语，表示“二碘化物/二碘离子相关的”（较少见，通常出现在化学命名中）。\n2) iodide：更常见，表示“碘化物/碘离子”。\n3) dioxide：常见，表示“二氧化物”。\n\n请你告诉我：\n- 你是在什么句子/语境里看到的？（或发一整句）\n- 你要查的是化学名词还是日常英语？\n我就能给你准确的词条、发音和例句。"]}
{"word":"diiodide","summary":{"en":"A chemistry term for a compound containing two iodide units (e.g., HgI2, PbI2).","zh":"化学术语，指含有两个碘化物单位的化合物（如 HgI₂、PbI₂）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) A compound that contains two iodide units (two iodine atoms/iodide ions) per formula unit, e.g., mercury(II) iodide (HgI₂).","zh":"（化学）“二碘化物”：指化学式中每个化学式单位含有两个碘化物单位（两个碘原子/两个碘离子）的化合物，例如二碘化汞（HgI₂）。"},"examples":[{"en":"Mercury diiodide (HgI2) is a bright red solid.","zh":"二碘化汞（HgI₂）是一种鲜红色固体。"},{"en":"In the lab, we labeled the bottle as “lead diiodide” to show it contains two iodines per lead atom (PbI2).","zh":"在实验室里，我们把瓶子标为“二碘化铅”，表示每个铅原子对应两个碘（PbI₂）。"}]}],"synonyms":["iodide (in specific compound names)","iodide salt (context-dependent)"],"phonetic":"/daɪˈaɪəˌdaɪd/","extraExplanation":["前缀 di- 表示“二、两个”。因此 diiodide 通常出现在化学命名中，用来强调“碘（I）有两个”。常见写法也会直接用具体名称：mercury(II) iodide / lead(II) iodide。","在日常英语中这个词很少单独使用，多见于化学课本、实验报告或化学品标签。"]}
{"word":"diiodinated","summary":{"en":"“Diiodinated” describes a molecule that has two iodine atoms attached or introduced.","zh":"“diiodinated”指分子中引入或连接了两个碘原子的“二碘化的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Having two iodine atoms added or attached to a molecule; containing two iodine substituents.","zh":"（化学）二碘化的；指在分子中引入或连接了两个碘原子，含有两个碘取代基。"},"examples":[{"en":"The researchers prepared a diiodinated aromatic compound for the next coupling step.","zh":"研究人员制备了一种二碘化的芳香化合物，用于下一步的偶联反应。"},{"en":"Diiodinated contrast agents are used in some medical imaging procedures.","zh":"一些医学影像检查会使用二碘化的造影剂。"}]}],"synonyms":["diiodo","iodinated (with two iodine atoms)"],"phonetic":"/daɪˈaɪəˌdeɪtɪd/","extraExplanation":["“di-”表示“两个”，“iodinated”表示“引入/取代了碘”。因此“diiodinated”通常用于描述某个化合物上有两个碘原子（常见于有机合成、药物与材料化学文献）。","在命名中，它常暗示“两个碘取代位点”，但具体位置通常还会用数字或邻/间/对（如 1,4-diiodinated）来进一步说明。"]}
{"word":"diiodo","summary":{"en":"A chemistry term meaning “with two iodine (iodo) substituents.”","zh":"化学术语：表示“含两个碘（碘代）取代基”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Having two iodine atoms attached; used in chemical names to show two iodo (–I) substituents.","zh":"（化学）含有两个碘原子（两个碘代基 –I）；常用于化合物命名中，表示有两个“碘代”取代基。"},"examples":[{"en":"2,3-diiodopropane has two iodine atoms on neighboring carbon atoms.","zh":"2,3-二碘丙烷在相邻的碳原子上各有一个碘原子。"},{"en":"The label “diiodo-” in a name tells you there are two iodo substituents.","zh":"名称里的“diiodo-（二碘-）”表示有两个碘代取代基。"}]}],"synonyms":["diiodinated","bis(iodo)"],"phonetic":"/daɪˈaɪədoʊ/","extraExplanation":["“diiodo”通常写作带连字符的前缀 **di-iodo-**（如 *1,2-diiodoethane*，1,2-二碘乙烷）。其中 **di-** 表示“两个”，**iodo-** 表示“碘代（–I）”。","在系统命名里，位置数字（如 1,2-）说明两个碘分别连在分子骨架的哪些位置。","在日常英语里很少单独用“diiodo”这个词；它多出现在化学论文、药物/有机合成、试剂目录和结构命名中。"]}
{"word":"diiodoform","summary":{"en":"Diiodoform is a rare, technical chemistry word meaning a compound related to iodoform.","zh":"diiodoform 是很少见的专业化学词，指一种与碘仿相关的化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (CHI3) similar to iodoform, with two iodine atoms; used mainly in chemistry and research contexts.","zh":"二碘仿（化学化合物，式为 CHI3 的一种类似碘仿的物质；主要用于化学与科研语境）。"},"examples":[{"en":"The lab stored diiodoform in a sealed container to prevent contamination.","zh":"实验室把二碘仿密封保存，以防污染。"},{"en":"Diiodoform is discussed mostly in advanced chemistry texts rather than everyday life.","zh":"二碘仿多见于高等化学教材，而非日常生活。"}]}],"synonyms":["diiodomethane (context-dependent)","iodoform (related, not identical)"],"phonetic":"/daɪˈaɪoʊdəˌfɔrm/","extraExplanation":["“diiodoform”由“di-（二、双）+ iodo-（碘）+ -form（与该类含卤代甲烷相关的命名元素）”构成，是典型的化学命名构词方式。","在实际英语中，这个词非常专业，通常出现在化学论文、试剂目录或实验记录里；日常交流更常见的是“iodoform（碘仿）”。","如果你是在阅读化学资料：CHI3 表示分子式；“di-”提示与“iodoform”相比，命名上强调“两个碘”的特征（具体结构与命名细节取决于来源与语境）。"]}
{"word":"diiodomethane","summary":{"en":"Diiodomethane is a dense liquid chemical (CH₂I₂) used mainly as a laboratory solvent and in microscopy or chemical reactions.","zh":"二碘甲烷是一种高密度液体化学品（CH₂I₂），主要用于实验室溶剂、显微用途或化学反应。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A colorless to pale-yellow liquid chemical (CH₂I₂) used mainly as a dense solvent in laboratories, for microscopy, and in some chemical reactions.","zh":"二碘甲烷（CH₂I₂），一种无色至浅黄色的液体化学品，主要用作高密度实验室溶剂、显微观察用介质，以及用于某些化学反应。"},"examples":[{"en":"In the lab, diiodomethane is sometimes used to prepare a heavy liquid for density separation.","zh":"在实验室里，二碘甲烷有时用于配制高密度液体，用于密度分离。"},{"en":"The sample sank in diiodomethane because the liquid is very dense.","zh":"样品在二碘甲烷中下沉，因为这种液体的密度很高。"},{"en":"Always handle diiodomethane in a fume hood and follow the safety data sheet (SDS).","zh":"处理二碘甲烷时务必在通风橱中操作，并遵循安全数据表（SDS）。"}]}],"synonyms":["methylene iodide","diiodomethane (CH2I2)"],"phonetic":"/daɪˌaɪədoʊˈmɛθeɪn/","extraExplanation":["“diiodo-”表示“两个碘原子”，“-methane”表示“甲烷骨架”；因此 diiodomethane 字面意思是“含两个碘的甲烷”。","常见同义名：methylene iodide（亚甲基碘/二碘甲烷）。","它通常具有较高密度与较强折射率，因此在矿物/材料的密度分离或显微观察中较常见。使用时需注意挥发性与潜在健康风险，避免吸入和皮肤接触。"]}
{"word":"diiodotyrosine","summary":{"en":"Diiodotyrosine is an iodinated form of tyrosine involved in making thyroid hormones.","zh":"二碘酪氨酸是“被碘化的酪氨酸”，参与甲状腺激素的生成。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A compound made when iodine attaches to the amino acid tyrosine; it is an important intermediate in the body’s production of thyroid hormones.","zh":"一种当碘与氨基酸“酪氨酸”结合后形成的化合物；它是人体合成甲状腺激素的重要中间产物。"},"examples":[{"en":"Diiodotyrosine is formed in the thyroid gland during hormone synthesis.","zh":"在甲状腺合成激素的过程中会形成二碘酪氨酸。"},{"en":"Lab reports sometimes abbreviate diiodotyrosine as DIT.","zh":"实验报告中有时把二碘酪氨酸缩写为 DIT。"}]}],"synonyms":["DIT","3,5-diiodotyrosine"],"phonetic":"/daɪˌaɪədoʊˈtaɪrəˌsin/","extraExplanation":["二碘酪氨酸（DIT）通常出现在“甲状腺球蛋白”上：先由酶把碘加到酪氨酸上生成 MIT（单碘酪氨酸）和 DIT；随后 DIT 与 MIT/DIT 偶联可形成甲状腺激素 T3（含 3 个碘）和 T4（含 4 个碘）。","词形拆解有助记忆：di-（二）+ iodo-（碘）+ tyrosine（酪氨酸）。"]}
{"word":"diipenates","summary":{"en":"Di Penates are the Roman household gods, and the term can also mean one’s home or homeland in a literary sense.","zh":"Di Penates 指罗马的家神（守护家宅与粮食），也可在文学语境中引申为“家园/故土”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Roman religion) Household gods who protected a family’s home and food store; often written as “Di Penates” (plural).","zh":"（罗马宗教）守护家庭住宅与粮食储藏的家神；常写作 “Di Penates”（复数）。"},"examples":[{"en":"In ancient Rome, families honored the Di Penates to protect the home and pantry.","zh":"在古罗马，人们祭拜 Di Penates 来守护家宅与粮仓。"},{"en":"The hero in Virgil’s *Aeneid* carries the Di Penates as sacred symbols of his people’s future home.","zh":"在维吉尔的《埃涅阿斯纪》中，英雄携带 Di Penates，作为民族未来家园的神圣象征。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, literary) A person’s home, homeland, or the sense of “hearth and home.”","zh":"（引申，文学用法）家园、故土，或“家的温暖与归属感”。"},"examples":[{"en":"After years abroad, she longed to return to her own Di Penates.","zh":"在国外多年后，她渴望回到自己的家园。"}]}],"synonyms":["Penates","household gods","Roman household deities","Lares (related)"],"phonetic":"/daɪ pəˈniːtiːz/","extraExplanation":["“Di”在拉丁语里是“神”的复数（对应单数 deus），Penates 与“食物储藏室/粮仓（penus）”相关，因此他们常被理解为“守护家中粮食与生活根基的神祇”。","在罗马家庭信仰中，Penates 常与 Lares（拉雷斯家神）一起出现：Lares 更偏向守护家宅与家族，Penates 更偏向守护食物与家中“供养来源”。","你输入的“diipenates”更像是把常见写法 “Di Penates” 连写在一起；在英文资料中更常见分写并首字母大写。"]}
{"word":"Diipolia","summary":{"en":"Diplopia means double vision: seeing two images of one object.","zh":"Diplopia 指“复视/双影”，即看一个物体却出现两个影像。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical condition in which you see two images of a single object (double vision).","zh":"复视；看一个物体却出现两个影像的症状（双影）。"},"examples":[{"en":"After the accident, she experienced diplopia and had trouble reading signs.","zh":"事故之后，她出现了复视，看路牌都很吃力。"},{"en":"If you suddenly develop diplopia, you should see a doctor right away.","zh":"如果你突然出现复视，应立即就医。"}]}],"synonyms":["double vision"],"phonetic":"/dɪˈploʊpiə/","extraExplanation":["“Diipolia”在英语里不常见，很可能是拼写误差；最接近、最常用的医学词是“diplopia”（复视）。","词源提示：diplopia 来自希腊语 diplo-（“双、两倍”）+ -opia（“视力/视觉”）。在医疗语境中常见于眼科或神经科描述。"]}
{"word":"diipolia","summary":{"en":"Diipolia (more commonly spelled Dipolia) is an ancient Athenian festival honoring Zeus Polieus, linked to the Bouphonia ritual.","zh":"Diipolia（更常见拼写为 Dipolia）是古雅典祭祀“城邦守护神”宙斯（Zeus Polieus）的节庆，并与 Bouphonia（杀牛祭）仪式相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an ancient Athenian religious festival held on the Acropolis in honor of Zeus Polieus (Zeus as protector of the city), closely associated with the ritual called the Bouphonia.","zh":"古雅典在卫城（Acropolis）举行的宗教节庆，祭祀“城邦守护神”宙斯（Zeus Polieus），并与名为“杀牛祭/牛杀祭”（Bouphonia）的仪式密切相关。"},"examples":[{"en":"The Diipolia was celebrated on the Acropolis as a civic-religious festival.","zh":"Diipolia 是在雅典卫城举行的城邦宗教节庆。"},{"en":"In discussions of Athenian ritual, the Diipolia is often mentioned together with the Bouphonia.","zh":"谈到雅典的祭祀仪式时，Diipolia 常常会和 Bouphonia 一起被提及。"}]}],"synonyms":["Dipolia","festival of Zeus Polieus","Bouphonia (related ritual)"],"phonetic":"/daɪˈpoʊliə/","extraExplanation":["“Diipolia”更常见的拼写是“Dipolia”。你输入的“diipolia”可能是把双 i 当作强调或转写差异；在学术资料里通常用 Dipolia。","Zeus Polieus 意为“城邦的宙斯/守城之宙斯”。该节庆反映了雅典将宗教与城邦政治身份紧密结合的传统。","Bouphonia（“杀牛祭”）的叙述常包含一种“把责任转移给凶器/工具”的象征性审判情节，用来处理祭祀中杀生的道德张力。"]}
{"word":"diisatogen","summary":{"en":"“diisatogen” is not a recognized standard English word; it likely needs context or corrected spelling.","zh":"“diisatogen”不是标准英语词汇；需要上下文或更正拼写才能确定含义。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username, or a specialized term (e.g., a brand/chemical name).","zh":"这不是常见的英语单词；可能是拼写错误、用户名，或某个专业领域的术语（例如品牌名/化学名）。"},"examples":[{"en":"I can’t find “diisatogen” in major English dictionaries—could you share a sentence where you saw it?","zh":"在主要英语词典中找不到“diisatogen”——你能提供看到它的句子吗？"},{"en":"If you meant a chemistry word, the spelling may be different.","zh":"如果你指的是化学相关词汇，拼写可能不一样。"}]}],"extraExplanation":["你可以把来源句子或上下文贴出来（例如一整句、学科/网站/书名），我就能更准确判断它是什么。","常见情况是打字误差：例如把 diisocyanate（化学：二异氰酸酯）、dissociate（使分离/脱离）、disintegrate（使解体）等词打错。若你想查其中某个词，也可以直接告诉我你原本想表达的意思（中文也可以）。"]}

