{"word":"dik-dik","summary":{"en":"A dik-dik is a tiny African antelope.","zh":"dik-dik 指一种非洲的小型羚羊（狄克羚）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very small African antelope (genus *Madoqua*), known for its tiny size and quick, shy behavior","zh":"非洲的一种极小型羚羊（狄克羚属 *Madoqua*），以体型迷你、动作敏捷且害羞著称"},"examples":[{"en":"We saw a dik-dik hiding in the bushes on a safari in Kenya.","zh":"我们在肯尼亚的野生动物观光旅行中看到一只狄克羚躲在灌木丛里。"},{"en":"A dik-dik can freeze and blend into the dry grass when it senses danger.","zh":"狄克羚察觉到危险时会静止不动，融入干草地的颜色中。"},{"en":"The dik-dik is one of the smallest antelopes in the world.","zh":"狄克羚是世界上最小的羚羊之一。"}]}],"synonyms":["dwarf antelope"],"phonetic":"/ˈdɪk ˌdɪk/","extraExplanation":["“dik-dik”这个名字常被认为来自它受到惊吓时发出的警戒叫声，听起来像“dik-dik”。","狄克羚主要生活在东非与东北非的灌木丛、稀树草原等干旱或半干旱地区，体型很小、行动迅速，常靠伪装与躲藏来避敌。","英语里这个词通常带连字符写作“dik-dik”，复数也常写作“dik-diks”（有时也会用不变的“dik-dik”作为复数，取决于写作风格）。"]}
{"word":"dika","summary":{"en":"“Dika” is most commonly a person’s name; it can also refer to “dika nut,” a West African seed used in cooking.","zh":"“Dika”最常见是人名；也可指“dika nut（dika 坚果）”，一种用于烹饪的西非种子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a name (a given name or surname) in several cultures; in English it is usually used as a proper noun.","zh":"一个人名（名字或姓氏），在多种文化中都可能出现；在英语里通常作为专有名词使用。"},"examples":[{"en":"Dika moved to New York for graduate school.","zh":"Dika 为了读研究生搬到了纽约。"},{"en":"I met Ms. Dika at the conference.","zh":"我在会议上认识了 Dika 女士。"}]},{"partOfSpeech":"n.","definition":{"en":"(also in the phrase “dika nut”) a West African seed used for food and as a thickener in soups, from the African bush mango tree (Irvingia gabonensis).","zh":"（也常见于短语“dika nut”）一种产自西非的种子，可食用，也常用来让汤变稠，来自非洲野芒果树（Irvingia gabonensis）。"},"examples":[{"en":"The soup is thickened with dika nut paste.","zh":"这道汤用 dika 坚果酱来增稠。"},{"en":"Some markets sell dika nuts as a traditional ingredient.","zh":"一些市场会把 dika 坚果作为传统食材出售。"}]}],"synonyms":["(name) —","(dika nut) African bush mango seed"],"phonetic":"/ˈdiːkə/","extraExplanation":["“Dika”在日常英语词汇里不算常见：如果你是在聊天、社交媒体或游戏里看到的，它更可能是人名、昵称，或某个缩写。","如果你指的是某个特定语境（比如一首歌、品牌、某个地区的俚语/语言），告诉我出处或一句原句，我可以帮你更准确地解释。"]}
{"word":"dikage","summary":{"en":"“Dikage” is not a standard English word; it’s likely a typo or a proper name.","zh":"“dikage”不是标准英语单词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. “dikage” is most likely a misspelling or a name/brand/username. If you meant a different word, share the sentence you saw it in.","zh":"不是标准英语单词。“dikage”很可能是拼写错误，或是人名/品牌名/用户名。如果你想查的是别的词，请把它出现的句子发我。"},"examples":[{"en":"I couldn’t find “dikage” in a dictionary—could it be a typo?","zh":"我在词典里找不到“dikage”——它会不会是拼写错误？"},{"en":"Can you paste the sentence where you saw “dikage”?","zh":"你能把看到“dikage”的句子贴出来吗？"}]}],"phonetic":"/ˈdaɪˌkeɪdʒ/","extraExplanation":["英文里有些词尾看起来像 “-age”（表示“……的集合/状态/结果”，如 luggage, wreckage），但 “dikage” 本身并不是常见或规范的构词结果。","如果你想表达与 “dike”（堤坝）有关的概念，英语里更常见的是 dike（名词/动词）本身，或用更明确的短语（例如 dike system 堤坝系统）。","也可能是你想查的词音近：damage（损害）, dosage（剂量）, leakage（泄漏）等；给我上下文我可以帮你锁定正确词。"]}
{"word":"dikalium","summary":{"en":"Dikalium means “two potassium,” used in chemical names for compounds containing two K units.","zh":"dikalium 指「二鉀」，用於化學命名中表示含兩個鉀（K）單位的化合物。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Chemistry) Containing two potassium ions/atoms; used in names of salts with two potassium (K) units.","zh":"（化學）含有兩個鉀離子／鉀原子；用於命名含兩個鉀（K）單位的鹽類。"},"examples":[{"en":"Dikalium phosphate is often written as K2HPO4 in chemical formulas.","zh":"磷酸二鉀在化學式中常寫作 K2HPO4。"},{"en":"The label says “dikalium,” meaning the compound includes two potassium ions.","zh":"標籤上寫著「dikalium」，表示該化合物含有兩個鉀離子。"}]}],"synonyms":["dipotassium","K2- (in formulas)"],"phonetic":"/daɪˈkeɪliəm/","extraExplanation":["「di-」是前綴，表示「二、兩個」；「kalium」是拉丁文／德文系統中對「鉀」的稱呼（K 的來源）。因此 dikalium = 「二鉀」。","在英文化學命名中，更常見的寫法是 dipotassium（例如 dipotassium phosphate）。不同語言或命名習慣可能會看到 dikalium。"]}
{"word":"dikamali","summary":{"en":"“dikamali” doesn’t appear to be a standard English word; it’s likely a name or a non-English/alternate spelling.","zh":"“dikamali”看起来不是标准英语单词，更可能是专有名词或非英语/拼写变体。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a proper name (a person/place), a brand, or a misspelling/romanization from another language.","zh":"不是标准英语单词。可能是人名/地名、品牌名，或来自其他语言的音译/拼写变体。"},"examples":[{"en":"I couldn’t find “dikamali” in major English dictionaries—can you share the sentence where you saw it?","zh":"我在主要英语词典里查不到“dikamali”，你能提供它出现的句子吗？"},{"en":"Is “Dikamali” the name of a person, a place, or a company?","zh":"“Dikamali”是人名、地名还是公司/品牌名？"}]}],"phonetic":"/ˌdɪkəˈmɑːli/","extraExplanation":["我目前无法把“dikamali”对应到常见英语词汇。为了更准确帮助你：\n1）请发我你看到它的完整句子或上下文；\n2）它来自哪种语言/哪个国家的网站或书？\n3）你想查的是发音、含义，还是正确拼写？\n有了这些信息后，我可以判断它是否是专有名词、外来词音译，或是某个英语单词的拼写错误。"]}
{"word":"dikamalli","summary":{"en":"“dikamalli” isn’t a recognized English word; it’s likely a name, a non-English term, or a misspelling.","zh":"“dikamalli”不是常见英语词，可能是名字、外来词或拼写有误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a name, a word from another language, or a misspelling/romanization.","zh":"不是标准英语词。可能是人名/地名、其他语言的词，或拼写/转写有误。"},"examples":[{"en":"I couldn’t find “dikamalli” in major English dictionaries—could you share a sentence where you saw it?","zh":"我在主要英语词典里找不到“dikamalli”，你能提供它出现的句子吗？"},{"en":"If “dikamalli” is a name, the meaning depends on the original language and spelling.","zh":"如果“dikamalli”是名字，它的含义取决于原始语言和具体拼写。"}]}],"phonetic":"ˌdiːkəˈmæli","extraExplanation":["我可能需要更多信息才能准确解释：\n1）你在哪里看到这个词（书、歌曲、社交媒体、游戏）？\n2）它是人名/地名/品牌名吗？来自哪种语言（例如泰米尔语、印地语、僧伽罗语等）？\n3）能否给出原文拼写（是否有大小写、重音符号）或一整句上下文？\n\n如果你愿意，也可以告诉我你想表达的意思（比如“某种食物/称呼/地方”），我可以帮你找到最接近的英文词或正确拼写。"]}
{"word":"dikaryon","summary":{"en":"A dikaryon is a fungal cell or hypha containing two unfused, genetically different haploid nuclei.","zh":"dikaryon 指真菌细胞/菌丝中含有两个尚未融合、遗传不同的单倍体细胞核的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fungal cell or hyphal segment that contains two separate, genetically different haploid nuclei (one from each mating type) that have not yet fused","zh":"（真菌学）双核体：一个真菌细胞或菌丝片段中含有两个彼此分离、遗传上不同的单倍体细胞核（来自不同交配型），但尚未融合成一个二倍体细胞核"},"examples":[{"en":"In many basidiomycete fungi, the dikaryon stage can last for most of the life cycle.","zh":"在许多担子菌中，双核体阶段可能占据生命周期的大部分时间。"},{"en":"After plasmogamy, the fungus forms a dikaryon with one nucleus from each parent.","zh":"发生质配（细胞质融合）后，真菌形成双核体，每个亲本贡献一个细胞核。"}]}],"synonyms":["dikaryotic cell","dikaryotic stage"],"phonetic":"/daɪˈkæriˌɑn/","extraExplanation":["词源提示：di- 表示“二/双”，-karyon 来自希腊语，意为“核”。所以 dikaryon 字面意思就是“双核”。","概念区分：双核体（dikaryon）不是“二倍体”（diploid）。双核体是“两个单倍体核并存但不融合”；二倍体是“核融合后形成一个含两套染色体的细胞核”。","常见场景：在担子菌（如蘑菇）和部分子囊菌中，质配后会进入双核菌丝阶段；在担子菌中常可看到“扣子连结（clamp connection）”帮助维持双核状态。"]}
{"word":"dikaryon-stage","summary":{"en":"A fungal life-cycle stage where cells contain two unfused haploid nuclei.","zh":"真菌生命周期中细胞含两个未融合的单倍体细胞核的阶段。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Biology, especially mycology) A stage in many fungi where each cell contains two separate haploid nuclei (one from each parent) that have not yet fused.","zh":"（生物学/真菌学）双核体阶段：许多真菌生命周期中的一个阶段，细胞内含有两个彼此独立的单倍体细胞核（分别来自两亲本），但尚未融合。"},"examples":[{"en":"In many basidiomycete fungi, the dikaryon stage can last for most of the life cycle.","zh":"在许多担子菌中，双核体阶段可能占据生命周期的大部分时间。"},{"en":"After plasmogamy, the fungus enters the dikaryon stage before karyogamy occurs.","zh":"发生质配（细胞质融合）之后，真菌会进入双核体阶段，直到随后进行核配（细胞核融合）。"}]}],"synonyms":["dikaryotic stage","dikaryophase"],"phonetic":"/daɪˈkæriɑn steɪdʒ/","extraExplanation":["“dikaryon”来自希腊语前缀 di-（“两个”）+ karyon（“细胞核”），字面意思是“两个细胞核”。","这个阶段常见于担子菌与子囊菌的有性生殖过程中：通常先发生质配（plasmogamy，细胞质融合），形成双核细胞；之后在特定结构中再发生核配（karyogamy，细胞核融合），接着进行减数分裂产生孢子。","学习时可把它与“diploid（二倍体）”区分：双核体是“两个核并存但未融合”，而二倍体是“核已融合，染色体成对”。"]}
{"word":"dikaryophase","summary":{"en":"Dikaryophase is a fungal life-cycle stage where cells contain two separate haploid nuclei that have not fused.","zh":"Dikaryophase 指真菌生命周期中的双核期：细胞含两个分开的单倍体细胞核，尚未融合。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology, especially mycology) A stage in the life cycle of some fungi and other organisms in which each cell contains two separate haploid nuclei (a “dikaryon”) that have not yet fused.","zh":"（生物学，尤指真菌学）双核期：某些真菌等生物的生命周期阶段，在这一阶段细胞内有两个彼此分开的单倍体细胞核（双核体），但尚未融合。"},"examples":[{"en":"In many basidiomycete fungi, the dikaryophase lasts much longer than the haploid phase.","zh":"在许多担子菌中，双核期持续时间往往比单倍体阶段更长。"},{"en":"During the dikaryophase, the two nuclei divide in a coordinated way so each new cell keeps one of each type.","zh":"在双核期中，这两个细胞核会协调分裂，使每个新细胞都保留两种细胞核各一个。"}]}],"synonyms":["dikaryotic phase","dikaryon stage"],"phonetic":"/daɪˈkæri.oʊˌfeɪz/","extraExplanation":["词源提示：dikari- 来自 di-（“两个”）+ karyon（“细胞核”）；phase 表示“阶段”，因此 dikaryophase 直译为“两个细胞核的阶段”。","学习要点：双核期常见于担子菌（如蘑菇）和部分子囊菌。它通常发生在“质配（plasmogamy，细胞质融合）”之后、“核配（karyogamy，细胞核融合）”之前，是理解真菌有性生殖与遗传多样性的重要概念。","易混淆概念：dikaryophase（双核期，两个细胞核不融合）不同于 diploid phase（二倍体期，细胞核已融合为一个二倍体核）。"]}
{"word":"dikaryophasic","summary":{"en":"Dikaryophasic describes the fungal life-cycle phase in which cells contain two separate haploid nuclei.","zh":"Dikaryophasic 指真菌生命周期中的“双核期”，即细胞内有两个彼此分离的单倍体细胞核。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the dikaryotic phase (dikaryon stage) in some fungi, when each cell contains two separate haploid nuclei (usually one from each mating type).","zh":"与某些真菌的“双核期/双核体阶段”（dikaryon stage）有关的；指细胞内同时存在两个彼此分离的单倍体细胞核（通常来自不同交配型）。"},"examples":[{"en":"Many basidiomycete fungi spend much of their life cycle in a dikaryophasic stage.","zh":"许多担子菌在生命周期中有很大一部分时间处于双核期（dikaryophasic stage）。"},{"en":"After plasmogamy, the mycelium can become dikaryophasic before the nuclei finally fuse.","zh":"在质配之后，菌丝体可能先进入双核期，然后细胞核才最终融合。"}]}],"synonyms":["dikaryotic (related)","dikaryon-stage (related)"],"phonetic":"/ˌdaɪˌkæri.oʊˈfeɪzɪk/","extraExplanation":["该词多用于真菌学/生物学教材与论文中，属于较专业的形容词。它强调的是“阶段/时期”（phase）这一概念：细胞里有两个不融合的细胞核（n + n），与“二倍体”（2n）不同。","常见于担子菌（如蘑菇类）和部分子囊菌的生活史描述：质配（plasmogamy，细胞质融合）之后会出现较长的双核期；随后在特定结构中发生核配（karyogamy，细胞核融合）并进入减数分裂。","相关词：dikaryotic（双核的，强调状态/特征），dikaryon（双核体/双核细胞），karyogamy（核配），plasmogamy（质配）。"]}
{"word":"dikaryophyte","summary":{"en":"A dikaryophyte is a fungus that has a life stage with two separate nuclei in each cell (dikaryotic stage).","zh":"dikaryophyte 指在生命周期中具有“每个细胞含两个彼此分离细胞核”的双核阶段的真菌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fungus (especially in the group Dikarya) whose cells can contain two separate haploid nuclei (a “dikaryon”) for part of its life cycle.","zh":"（尤指担子菌和子囊菌等）一种真菌，其细胞在生命周期的某一阶段可含有两个彼此分离的单倍体细胞核（“双核体/双核菌丝”）。"},"examples":[{"en":"Many mushrooms are dikaryophytes, spending a long period in a dikaryotic stage before forming spores.","zh":"许多蘑菇属于双核真菌，在形成孢子之前会经历较长时间的双核阶段。"},{"en":"In class, we learned that a dikaryophyte often forms after two compatible fungal hyphae fuse.","zh":"课堂上我们学到：双核真菌通常是在两种相容的真菌菌丝融合后形成的。"}]}],"synonyms":["dikaryotic fungus","Dikarya member"],"phonetic":"/daɪˈkæriəˌfaɪt/","extraExplanation":["“dikaryophyte”常见于生物学/真菌学教材，和更常见的形容词“dikaryotic（双核的）”相关：di-（二）+ karyo-（细胞核）+ -phyte（生物/植物样生物）。","“Dikarya（双核亚界/双核真菌类群）”主要包括子囊菌门（Ascomycota）与担子菌门（Basidiomycota）；它们的一个重要特征就是常出现“一个细胞里有两个不融合的细胞核”的阶段。"]}
{"word":"dikaryophytic","summary":{"en":"Describes cells (especially in fungi) that contain two genetically different nuclei.","zh":"指（尤指真菌的）细胞含有两个遗传不同的细胞核的“双核”状态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology, especially mycology) Having two genetically distinct nuclei in each cell (a dikaryon), typically before the nuclei fuse.","zh":"（生物学，尤指真菌学）双核的；指每个细胞内含有两个遗传上不同的细胞核（双核体），通常发生在两核融合之前。"},"examples":[{"en":"Many basidiomycete fungi have a long dikaryophytic stage in their life cycle.","zh":"许多担子菌在其生活史中具有较长的双核阶段（dikaryophytic stage）。"},{"en":"Under the microscope, the hyphae were identified as dikaryophytic because each compartment contained two nuclei.","zh":"在显微镜下，这些菌丝被鉴定为双核型（dikaryophytic），因为每个分隔的细胞区室里都有两个细胞核。"}]}],"synonyms":["dikaryotic","binucleate"],"phonetic":"/daɪˌkɛriəˈfɪtɪk/","extraExplanation":["“dikaryophytic”常用于描述真菌（特别是担子菌、部分子囊菌）的生活史阶段：两个不同亲本来源的细胞核在同一细胞中共存，但尚未融合（核配/核融合之前）。","词形拆解：di-（两个）+ karyo-（细胞核）+ -phytic（与“生长/植物样”相关的形容词后缀）。在现代生物学语境中，它更多是专业术语，而不是日常英语。"]}
{"word":"dikaryotic","summary":{"en":"Dikaryotic describes a cell—especially in fungi—that contains two genetically different nuclei before they fuse.","zh":"Dikaryotic 指（多见于真菌）一个细胞内含有两个遗传不同的细胞核、且尚未融合的状态。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having two genetically distinct nuclei in one cell (common in many fungi after two cells fuse but before the nuclei fully merge).","zh":"（细胞）含有两个遗传上不同的细胞核（常见于许多真菌：两细胞融合后、细胞核尚未完全合并之前的阶段）。"},"examples":[{"en":"Many mushrooms spend a large part of their life cycle in a dikaryotic stage.","zh":"许多蘑菇在其生命周期中有很长一段时间处于双核（dikaryotic）阶段。"},{"en":"Under the microscope, the dikaryotic cells show two separate nuclei in each compartment.","zh":"在显微镜下，这些双核细胞在每个细胞隔室中能看到两个分离的细胞核。"}]}],"synonyms":["binucleate (in fungi)"],"phonetic":"/ˌdaɪˌkæriˈɑtɪk/","extraExplanation":["该词常见于真菌学（mycology）。与“diploid（二倍体）”不同：dikaryotic 指的是“两个细胞核共存但尚未融合”，而 diploid 指“染色体成对、核已融合后的状态”。","相关概念：dikaryon（n. 双核体/双核阶段）；karyon 来自希腊语词根，意为“核”。"]}
{"word":"dikast","summary":{"en":"A dikast is an ancient Athenian citizen-juror who decided court cases.","zh":"dikast 指古雅典民众法庭中的公民陪审员（审判者）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In ancient Athens, a citizen-juror (and sometimes broadly a judge) who served in the popular courts.","zh":"（古雅典）陪审员；（广义）民众法庭中的审判者。"},"examples":[{"en":"In classical Athens, a dikast could be selected by lot to hear a case.","zh":"在古典时期的雅典，dikast 可能通过抽签被选出参与审理案件。"},{"en":"The speech was designed to persuade hundreds of dikasts, not a single professional judge.","zh":"这篇演说旨在说服数百名 dikast，而不是一位职业法官。"}]}],"synonyms":["juror","judge","magistrate"],"phonetic":"/ˈdaɪkæst/","extraExplanation":["dikast 来自希腊语 dikastēs（δικαστής），与“正义/审判”（dikē）相关。它通常指在雅典民众法庭（dikastēria）中参与裁决的大规模陪审团成员。","与现代“陪审员”相似，但雅典的陪审团人数往往非常多（可达数百人），也不一定由法官主持同样的程序；因此翻译为“陪审员/审判者”要结合语境。","在研究希腊历史、民主制度、法律与修辞（如德摩斯梯尼的法庭演说）时，这个词很常见。"]}
{"word":"dikdik","summary":{"en":"A dik-dik is a tiny African antelope.","zh":"dik-dik 指一种非洲的小型羚羊（狄狄羚）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very small antelope from eastern and southern Africa, known for its pointed snout and shy behavior (often living in bushy areas)","zh":"狄狄羚（一种体型很小的羚羊，产于非洲东部和南部，以尖尖的口鼻和胆小的习性著称，常栖息在灌木丛）"},"examples":[{"en":"We saw a dik-dik hiding in the bushes during our safari.","zh":"我们在游猎时看到一只狄狄羚躲在灌木丛里。"},{"en":"A dik-dik is much smaller than most antelopes.","zh":"狄狄羚比大多数羚羊都小得多。"}]}],"synonyms":["dik-dik antelope","Madoqua (genus)"],"phonetic":"/ˈdɪkˌdɪk/","extraExplanation":["“dik-dik”常写作 dik-dik（也可见 dikdik）。名称据说来自它受惊时发出的“dik-dik”叫声，属于拟声词。","狄狄羚通常成对活动，依靠隐蔽性强的灌木环境躲避天敌；在自然纪录片和非洲野生动物相关读物中较常见。"]}
{"word":"dikdiks","summary":{"en":"A dik-dik is a very small African antelope.","zh":"dik-dik 指一种非洲的极小型羚羊（小羚羊/侏儒羚羊）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very small African antelope (a dwarf antelope), known for its delicate build and short horns (in males); it lives mainly in eastern and southern Africa.","zh":"小羚羊（非洲的一种极小型羚羊/侏儒羚羊），体型纤细，雄性通常有短角；主要分布在东部和南部非洲。"},"examples":[{"en":"We saw a dik-dik hiding in the bushes during the safari.","zh":"我们在野外游猎时看到一只小羚羊躲在灌木丛里。"},{"en":"Dik-diks are among the smallest antelopes in Africa.","zh":"小羚羊是非洲最小的羚羊之一。"}]}],"synonyms":["dwarf antelope"],"phonetic":"ˈdɪkˌdɪk","extraExplanation":["“dik-dik”通常写作 dik-dik，复数常见 dik-diks 或 dik-dik。词源被认为来自当地语言对其叫声的拟声。","在英语语境里，它多出现在自然纪录片、旅行写作、动物园介绍或非洲草原/灌木丛生态相关内容中。"]}
{"word":"dike","summary":{"en":"A dike is a barrier (a built-up bank or wall) that stops water from flooding an area; it can also mean to build such a barrier.","zh":"dike 指用于防洪挡水的堤坝/防洪堤；也可作动词，表示筑堤或用堤坝保护土地。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A long wall or bank built to hold back water and prevent flooding (especially from the sea or a river).","zh":"（尤指沿海或河边的）堤坝；防洪堤，用来挡水、防止洪水。"},"examples":[{"en":"The town built a new dike to protect homes from storm surges.","zh":"这个小镇修建了新的堤坝来保护房屋免受风暴潮侵袭。"},{"en":"After the heavy rains, workers checked the dike for weak spots.","zh":"暴雨过后，工人检查堤坝是否有薄弱处。"}]},{"partOfSpeech":"v.","definition":{"en":"To build a dike, or to protect land by building embankments.","zh":"筑堤；用堤坝保护土地。"},"examples":[{"en":"They dike the low fields so crops won’t be ruined by flooding.","zh":"他们在低洼田地筑堤，以免庄稼被洪水毁坏。"}]}],"synonyms":["levee","embankment","seawall","floodwall"],"phonetic":"/daɪk/","extraExplanation":["在英语里，dike 和 dyke 是同一个词的两种拼写：美式更常见 dike，英式更常见 dyke。","在荷兰文化语境中，dike 非常常见：荷兰许多地区低于海平面，著名工程如“Zuiderzee Works（须德海工程）”“Delta Works（德尔塔工程）”都与筑堤、防潮有关，因此 dike 常被用作“与水斗争、守护家园”的象征。"]}
{"word":"dike-reeve","summary":{"en":"A dike-reeve is an official who oversees dikes/levees and flood-control works, especially in the Netherlands.","zh":"dike-reeve 指负责堤防（河堤/海堤）与防洪工程管理的官员，尤常见于荷兰语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an official responsible for overseeing and maintaining dikes (levees) and managing flood-control works, especially in the Netherlands","zh":"堤防（河堤／海堤）管理官；负责监督与维护堤坝、防洪工程的官员（尤指荷兰）"},"examples":[{"en":"In the Netherlands, a dike-reeve may coordinate inspections before the storm season.","zh":"在荷兰，堤防管理官可能会在风暴季来临前协调巡检。"},{"en":"The dike-reeve ordered repairs after a weak spot was found in the levee.","zh":"发现堤坝薄弱处后，堤防管理官下令进行修复。"}]}],"synonyms":["dike warden","levee warden","dyke-reeve","water board chair (contextual)"],"phonetic":"/ˈdaɪk ˌriːv/","extraExplanation":["“dike-reeve”是较少见的英语词，常用来翻译荷兰语的水利治理头衔（如 dijkgraaf，常译作“堤坝总监/水利委员会负责人”）。荷兰长期与海水、洪水共存，地方性的水利机构（water boards）历史悠久，负责堤防、排水与水位管理。","拼写上也常见变体：dyke-reeve（英式拼写 dyke）。在现代英语里，更常见的通俗说法是 dike warden / levee warden（堤防管理员/堤防监管者）。"]}
{"word":"diked","summary":{"en":"“Diked” usually means land or water was protected by building a dike (an embankment), or describes something that has a dike.","zh":"“diked”通常指“已筑堤（用堤防挡水/控洪）”，也可作形容词表示“有堤的/受堤防保护的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “dike”: to build or protect with a dike (an embankment) to hold back water or control flooding.","zh":"“dike”的过去式/过去分词：筑堤（修建堤坝/堤防）来挡水、控洪或保护土地。"},"examples":[{"en":"The river was diked to prevent flooding in the spring.","zh":"为了防止春季洪水，这条河修了堤。"},{"en":"Low-lying farmland has been diked and drained for decades.","zh":"低洼农田多年来一直通过筑堤和排水来整治。"}]},{"partOfSpeech":"adj.","definition":{"en":"having a dike or dikes; protected by an embankment (often used before a noun).","zh":"有堤的；由堤防保护的（常作定语）。"},"examples":[{"en":"They walked along the diked shoreline.","zh":"他们沿着筑堤的海岸线散步。"},{"en":"The diked fields stayed dry after the storm.","zh":"暴风雨过后，有堤的田地仍然干燥。"}]}],"synonyms":["embanked","leveed","dammed"],"phonetic":"/daɪkt/","extraExplanation":["在美式英语里更常见的拼写是 **dike**（堤、防洪堤），英式英语里常见 **dyke**。两者在“堤坝/沟渠”等工程含义上基本相同。","注意：拼写 **dyke** 在某些语境中也可能指女同性恋（其中还可能带侮辱色彩）。如果你看到的是与性取向相关的用法，要根据上下文谨慎理解与使用。"]}
{"word":"dikegrave","summary":{"en":"A rare English term (from Dutch) meaning the chair/leader responsible for dikes and water management.","zh":"一个较少见、源自荷兰语的词，指负责堤坝与水务管理的领导/主席。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Dutch context) an official who leads a water board and is responsible for dikes and local water management; the chair of a Dutch water authority (also spelled from Dutch as “dijkgraaf”).","zh":"（荷兰语境）主管堤坝与地方水务的官员；荷兰水务委员会/水管理机构的主席（也可见荷兰语拼写 dijkgraaf）。"},"examples":[{"en":"The dikegrave ordered an inspection after the storm damaged the sea wall.","zh":"暴风雨损坏海堤后，堤坝长下令进行检查。"},{"en":"In some translations, “dikegrave” refers to the chair of a Dutch water board.","zh":"在一些译本里，“dikegrave”指荷兰水务委员会的主席。"}]}],"synonyms":["dijkgraaf","dike-reeve","water board chair"],"phonetic":"/ˈdaɪkɡrɑːv/","extraExplanation":["“dikegrave”是一个较少见的英语写法，通常来自荷兰语“dijkgraaf”。荷兰有历史悠久的“水务委员会（water boards）”，负责防洪、堤坝维护与水位管理；“dijkgraaf”相当于该机构的负责人。英语里更常见的对应说法是“dike-reeve”或直接用荷兰语“dijkgraaf”。"]}
{"word":"dikelet","summary":{"en":"A dikelet is a small dike or low embankment used to control water.","zh":"dikelet 指“小堤”，即用来控制水流或挡水的低矮堤坝。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small dike; a low embankment built to hold back water or guide its flow","zh":"小堤；（用于挡水或引导水流的）低矮堤坝"},"examples":[{"en":"After the heavy rain, the farmer reinforced the dikelet along the field.","zh":"暴雨过后，农民加固了田边的小堤。"},{"en":"A narrow dikelet separated the pond from the canal.","zh":"一条狭窄的小堤把池塘和运河隔开。"}]}],"synonyms":["small dike","embankment","levee","bank"],"phonetic":"/ˈdaɪk.lət/","extraExplanation":["“dikelet”由 dike（堤坝）+ 表示“小”的后缀 -let 构成，意思就是“小堤”。在英式拼写中 dike 也常写作 dyke，但在现代英语里 dyke 还有其他敏感含义（俚语/身份用语），在谈水利工程时用 dike 通常更中性、更清晰。","这个词在日常英语中比较少见，更常用的表达有 small dike、embankment（堤岸/路堤）、levee（堤防，尤指防洪堤）。"]}
{"word":"dikelocephalid","summary":{"en":"A rare scientific word meaning a trilobite of the family Dikelocephalidae, or relating to that family.","zh":"罕见的学术词，指狄克洛头虫科（Dikelocephalidae）的三叶虫，或与该科相关的。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a trilobite belonging to the family Dikelocephalidae (an extinct group of marine arthropods known from fossil records).","zh":"指“狄克洛头虫科（Dikelocephalidae）”的三叶虫（一类已灭绝的海洋节肢动物，主要见于化石记录）。"},"examples":[{"en":"Fossil beds in some Cambrian rocks contain several dikelocephalids.","zh":"一些寒武纪岩层的化石层中含有多种狄克洛头虫科的三叶虫。"},{"en":"The museum’s Cambrian exhibit includes a well-preserved dikelocephalid specimen.","zh":"博物馆的寒武纪展区有一件保存良好的狄克洛头虫科三叶虫标本。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the trilobite family Dikelocephalidae.","zh":"与狄克洛头虫科（Dikelocephalidae）三叶虫相关的。"},"examples":[{"en":"Researchers compared dikelocephalid features across different fossil sites.","zh":"研究人员比较了不同化石地点的狄克洛头虫科特征。"}]}],"synonyms":["Dikelocephalidae trilobite","dikelocephalid trilobite"],"phonetic":"ˌdaɪkəloʊˈsɛfəlɪd","extraExplanation":["“dikelocephalid”来自古生物分类学：Dikelocephalidae（狄克洛头虫科）这个科名源于属名 Dikelocephalus。此类词多见于学术论文、博物馆标注与地质/古生物资料中，日常英语里非常少用。","三叶虫（trilobite）是古生代海洋中非常常见的一类节肢动物化石，用来帮助研究地层年代与古环境；“dikelocephalid”就是其中一个较细的分类层级名称。"]}
{"word":"Dikelocephalus","summary":{"en":"Dikelocephalus is a scientific name for an extinct trilobite genus from the Cambrian period.","zh":"Dikelocephalus 是一个寒武纪三叶虫属的科学名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of extinct marine arthropods (trilobites) known from Cambrian-period fossils, especially in North America.","zh":"一种已灭绝的海洋节肢动物属（三叶虫），见于寒武纪化石记录，尤以北美地区较常提及。"},"examples":[{"en":"Dikelocephalus is a trilobite genus that appears in some late Cambrian fossil beds.","zh":"Dikelocephalus（双叉头虫属）是一个三叶虫属，在一些晚寒武纪化石层中可见。"},{"en":"The museum label describes Dikelocephalus as an ancient marine arthropod.","zh":"博物馆的展签将 Dikelocephalus 描述为一种远古海洋节肢动物。"}]}],"synonyms":["trilobite (general term)","fossil arthropod (general description)"],"phonetic":"/ˌdaɪkəloʊˈsɛfələs/","extraExplanation":["这是一个科学属名，常见于古生物学/地质学语境。日常英语里几乎不会用到，更多出现在论文、化石图录、博物馆说明牌等。","词源一般被解释为来自希腊语构词成分：dikelos（“双叉的/两端分开的”）+ kephalē（“头”），暗示其头部（头甲）形态特征。不同资料在细节解释上可能略有差异。"]}
{"word":"dikelocephalus","summary":{"en":"Dikelocephalus is the scientific name of a genus of extinct Cambrian trilobites.","zh":"Dikelocephalus 是一种已灭绝的寒武纪三叶虫属的学名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of extinct marine arthropods (trilobites) known from Cambrian-period fossils; used as a scientific (Latin) name in paleontology","zh":"一种已灭绝的海洋节肢动物（三叶虫）属名，见于寒武纪化石；为古生物学中的拉丁学名"},"examples":[{"en":"Dikelocephalus fossils have been found in Cambrian rock layers.","zh":"在寒武纪岩层中发现过 Dikelocephalus（迪凯洛头虫属）的化石。"},{"en":"The museum label lists Dikelocephalus as a trilobite genus.","zh":"博物馆的说明牌把 Dikelocephalus 列为三叶虫的一属。"}]}],"phonetic":"ˌdaɪkɛloʊˈsɛfələs","extraExplanation":["这是一个科学属名（首字母常大写），通常不用于日常英语对话，而用于化石、地层和分类学语境。","词源来自希腊语：di-（“二、双”）+ kephalē（“头”）。在古生物命名中，这类词源常用来描述外形特征或给研究者提示辨识特征。"]}
{"word":"dikephobia","summary":{"en":"Dikephobia means prejudice or hostility toward lesbians; it contains a slur and is not common in neutral speech.","zh":"dikephobia 指对女同性恋者的偏见或敌意；该词包含侮辱性用语成分，在中性表达中并不常用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An irrational fear, hostility, or prejudice toward lesbians; the term is built from “dyke” (an offensive slur for a lesbian) + “-phobia.”","zh":"对女同性恋者的非理性恐惧、敌意或偏见；该词由“dyke”（指女同性恋的侮辱性蔑称）+“-phobia”（恐惧/偏见）构成。"},"examples":[{"en":"The workshop addressed dikephobia and other forms of anti-LGBTQ+ bias in schools.","zh":"该工作坊讨论了学校中的“dikephobia”（对女同性恋的偏见）以及其他反LGBTQ+偏见。"},{"en":"She spoke about how dikephobia affected her safety at work.","zh":"她谈到对女同性恋的偏见如何影响她在工作中的安全感。"},{"en":"Policies should protect employees from harassment rooted in dikephobia.","zh":"政策应保护员工免受源于对女同性恋偏见的骚扰。"}]}],"synonyms":["lesbophobia","homophobia","anti-lesbian bias","prejudice against lesbians"],"phonetic":"/ˌdaɪkˈfoʊbiə/","extraExplanation":["这个词在现实交流中很少见，更常见、更中性的说法是 **lesbophobia（恐同中的“厌女同”）** 或直接说 **prejudice/discrimination against lesbians（对女同性恋的歧视）**。","由于词根 **dyke** 在英语里通常被视为侮辱性用语（尽管在部分社群语境中有人会“重新挪用”自称），写作或正式场合使用时要特别谨慎，避免造成伤害。"]}
{"word":"diker","summary":{"en":"Diker means a person who works on or builds dikes (embankments that hold back water).","zh":"Diker 指修筑或维护堤坝（防洪堤）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who builds, repairs, or works on a dike (an embankment that holds back water)","zh":"修筑、维护或从事堤坝（防洪堤）工作的人"},"examples":[{"en":"After the storm, diker crews worked all night to strengthen the riverbank.","zh":"暴风雨过后，修堤人员整夜加固河岸。"},{"en":"The town hired experienced dikers to prevent flooding.","zh":"镇上雇用了有经验的修堤工人来防止洪水。"}]}],"synonyms":["dike worker","levee worker","embankment worker"],"phonetic":"/ˈdaɪkər/","extraExplanation":["“diker”是由“dike（堤坝）+ -er（做某事的人）”构成的名词，但在现代英语里并不常见；更常见的说法是“dike worker / levee worker / embankment worker”。","注意拼写与用词：英语里“dyke”有时是“dike”的另一种拼法，但“dyke”也可能被用作对女同性恋的侮辱性称呼（在某些语境中也被社群内部重新使用）。写作或正式场合建议用“dike/levee”来避免冒犯或误解。","如果你本来想问的是专有名词“Dyker”（如纽约的 Dyker Heights），那属于地名/姓氏，意思不同。"]}
{"word":"dikereeve","summary":{"en":"A (historical/regional) official in charge of maintaining and inspecting dikes and related water-control works.","zh":"（带历史/地域色彩的）负责堤坝与水利设施维护、巡查的官员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A local official (especially in the Netherlands or other low-lying regions) responsible for supervising the building, maintenance, and safety of dikes and drainage works.","zh":"（尤指荷兰等低洼地区的）堤坝管理员／堤防官：负责监督堤坝与排水工程的修建、维护与安全的地方官员。"},"examples":[{"en":"In the 1700s, the dike reeve inspected the embankments after a storm.","zh":"在18世纪，暴风雨过后，堤坝管理员会检查堤防。"},{"en":"The town appointed a dike reeve to organize repairs and collect maintenance fees.","zh":"小镇任命了一位堤坝管理员来组织修缮并收取维护费用。"}]}],"synonyms":["dike warden","dike supervisor","water-control official"],"phonetic":"/ˈdaɪkˌriːv/","extraExplanation":["“dikereeve”更常见的写法是 dike reeve / dyke-reeve（也可写作 dike-reeve）。其中 reeve 是古英语词，指“地方官、管理者”；合起来就是“管理堤坝的人”。","这个词带有历史与地域色彩，常见于讨论荷兰的水利治理（如水务委员会/水管理机构）或历史文献中；在现代日常英语里不算常用。"]}
{"word":"dikeria","summary":{"en":"Dikeria are the bishop’s two-candle holders used for blessing in Eastern Orthodox services (plural of dikirion).","zh":"dikeria指东正教礼仪中主教用于祝福的双烛台（dikirion的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Eastern Orthodox Christianity) A pair of two-branched candlesticks used by a bishop in church services for blessing; the plural form of “dikirion.”","zh":"（东正教）主教在礼仪中用于祝福的“双烛台”（两支蜡烛的烛台）；为“dikirion”的复数形式。"},"examples":[{"en":"During the blessing, the bishop lifted the dikeria and traced the sign of the cross in the air.","zh":"祝福时，主教举起dikeria，在空中划出十字圣号。"},{"en":"In Orthodox liturgy, dikeria and trikeria are carried in processions and used at key moments.","zh":"在东正教礼仪中，dikeria和trikeria常在游行队伍中被举持，并在关键时刻使用。"}]}],"synonyms":["dikirion (plural)","bishop’s double-candlestick","two-branch candlestick"],"phonetic":"/daɪˈkɪriə/","extraExplanation":["“dikeria”来自希腊语传统教会用语：di- 表示“二”，指两支蜡烛。与之相关的“trikeria”（三烛台）常象征圣三位一体；而“两烛台”在传统解释中常被理解为象征基督的两性（神性与人性）。","在英语资料里更常见的单数形式是“dikirion”，写作“dikeria”通常是在强调复数（或把该词当作整体器物名称来用）。"]}
{"word":"dikerion","summary":{"en":"Dikerion (more commonly spelled dikirion) is a two-candle liturgical holder used by an Eastern Orthodox bishop for blessings.","zh":"dikerion（更常见拼写为 dikirion）指东正教主教在礼仪祝福时使用的“两支蜡烛”烛台。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Eastern Orthodox Christianity) A liturgical candlestick or holder with two candles, used by a bishop in blessings during church services.","zh":"（东正教）二烛台：主教在礼仪中用于祝福的、带两支蜡烛的烛台/烛架。"},"examples":[{"en":"During the blessing, the bishop raised the dikerion and the trikerion.","zh":"在祝福时，主教举起二烛台（dikerion）和三烛台（trikerion）。"},{"en":"The museum displayed a silver dikerion from the 19th century.","zh":"博物馆展出了一件19世纪的银制二烛台。"}]}],"synonyms":["dikirion","two-candle candlestick","liturgical candlestick"],"phonetic":"/dɪˈkɪriən/","extraExplanation":["更常见的拼写是 **dikirion**（也作 dikirion），你写的 **dikerion** 属于较少见的变体/误拼。","在东正教礼仪里，二烛台的“两支蜡烛”常被理解为象征基督的“两性”（神性与人性）；与之对应的 **trikerion**（三烛台）常被联系到“三位一体”的象征。","这个词源自希腊语：**di-** 表示“二”，与英语中的 *di-*（如 *dioxide* 二氧化物）同源。"]}
{"word":"dikers","summary":{"en":"“Dikers” usually means either people who build/repair dikes or (less commonly) small African antelopes (often spelled “duikers”).","zh":"“dikers”通常指筑堤/修堤的人；较少见时指小型非洲羚羊（更常见拼法为“duikers”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of diker: a person who builds or repairs dikes (embankments) to hold back water.","zh":"diker 的复数：筑堤者；修建或维护堤坝（防洪堤）的人。"},"examples":[{"en":"After the storm, the dikers worked all night to reinforce the riverbanks.","zh":"暴风雨过后，筑堤工人整夜加固河堤。"},{"en":"The town hired dikers to prevent flooding during the rainy season.","zh":"小镇雇了筑堤工人，以防雨季洪水。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of diker (also spelled duiker): a small African antelope.","zh":"diker 的复数（也常拼作 duiker）：小型非洲羚羊（多指“跳羚/岩羚”一类）。"},"examples":[{"en":"We spotted two dikers moving quietly through the bushes.","zh":"我们看见两只小羚羊在灌木丛中悄悄穿行。"},{"en":"In some field guides, you’ll see this animal listed as a duiker rather than a diker.","zh":"在一些野外指南里，这种动物会写作 duiker，而不是 diker。"}]}],"synonyms":["dyke builders","levee workers","duikers"],"phonetic":"/ˈdaɪkərz/","extraExplanation":["“diker”在英语里并不常见，因此遇到“dikers”时要靠语境判断：谈防洪、堤坝、河岸工程，多半是“筑堤者”；谈野生动物、非洲草原/森林生态，则更可能指羚羊（更常见拼法是 duiker）。","很多学习者会把“Dikers”误以为和纽约的“Rikers Island（赖克斯岛监狱）”有关；两者拼写不同，除非是专有名词语境，否则一般不相关。"]}
{"word":"dikes","summary":{"en":"“Dikes” usually means flood-control embankments; it can also be the verb form of “dike,” and it has an offensive slang meaning to avoid.","zh":"“dikes”通常指“堤坝/防洪堤”；也可作动词“筑堤”的形式；另外还有应避免使用的冒犯性俚语含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of dike: a long wall or bank built to hold back water and prevent flooding.","zh":"dike 的复数：堤坝；防洪堤（用来挡水、防止洪水）"},"examples":[{"en":"The Netherlands is famous for its dikes and canals.","zh":"荷兰以堤坝和运河闻名。"},{"en":"After the storm, workers inspected the dikes for damage.","zh":"暴风雨过后，工人检查堤坝是否受损。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular of dike (verb): to build or protect with a dike; to stop water from spreading.","zh":"dike 的第三人称单数（动词）：筑堤；用堤坝围住/防止水扩散"},"examples":[{"en":"They dikes the low fields every spring to reduce flooding.","zh":"他们每年春天给低洼田地筑堤以减少洪水。"}]},{"partOfSpeech":"n.","definition":{"en":"(Offensive slang) A derogatory term for a lesbian.","zh":"（冒犯性俚语）对女同性恋的贬称。"},"examples":[{"en":"That word is offensive—use respectful terms like “lesbian” instead.","zh":"那个词带有冒犯性——请用“lesbian（女同性恋）”等更尊重的说法。"}]}],"synonyms":["levees","embankments","floodwalls","sea walls"],"phonetic":"/daɪks/","extraExplanation":["常见拼写还有 dyke（英式/变体拼写）。在工程与地理语境里 dike/dyke 都可指“堤坝”。","作为贬称的用法具有强烈冒犯性；即使在影视或历史材料中出现，也不建议学习者在日常交流中使用。"]}
{"word":"dikeside","summary":{"en":"Dikeside means the side/area beside a dike, or something located next to a dike.","zh":"dikeside 指堤坝旁边的区域/小路，或“堤边的、靠堤的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The area or path along the side of a dike (an embankment built to hold back water), often used for walking, cycling, or maintenance.","zh":"堤岸边；堤坝旁的地带或小路（堤坝是用来挡水的土堤/堤防），常用于散步、骑行或维护。"},"examples":[{"en":"We took a walk along the dikeside at sunset.","zh":"我们在日落时沿着堤岸边散步。"},{"en":"Keep to the dikeside path and don’t step onto the wet slope.","zh":"请走堤岸边的小路，不要踩到湿滑的斜坡上。"}]},{"partOfSpeech":"adj.","definition":{"en":"Located beside a dike; related to the edge of a dike.","zh":"堤边的；位于堤坝旁的。"},"examples":[{"en":"The dikeside road can flood during storms.","zh":"暴风雨时堤边道路可能会被淹。"},{"en":"They built a small dikeside shelter for the workers.","zh":"他们为工人建了一个小小的堤边棚屋。"}]}],"synonyms":["embankment-side","levee-side","riverbank (similar in meaning)"],"phonetic":"/ˈdaɪkˌsaɪd/","extraExplanation":["“dike”在英语里常指防洪堤、海堤或河堤（英式拼写也常见“dyke”）。在荷兰、英国部分沿海地区或有运河的地方，“dikeside”常用来指堤坝旁的步道、道路或维护区域。"]}
{"word":"diketene","summary":{"en":"Diketene is a reactive industrial chemical used to make other chemicals (especially acetoacetate intermediates).","zh":"二烯酮是一种反应性很强的工业化学品，主要用作合成其他化学品（尤其是乙酰乙酸酯类中间体）的原料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a colorless, reactive chemical (a four‑membered cyclic compound) used mainly as an industrial building block to make acetoacetate compounds for dyes, pharmaceuticals, and other chemicals","zh":"二烯酮（一种无色、反应性强的化学品，四元环结构），主要作为工业中间体，用于制备乙酰乙酸酯类化合物，进而用于染料、药物等化学品的生产"},"examples":[{"en":"Diketene is used to manufacture acetoacetate intermediates.","zh":"二烯酮用于生产乙酰乙酸酯类中间体。"},{"en":"Because diketene is highly reactive, it must be handled under controlled conditions.","zh":"由于二烯酮反应性很强，必须在受控条件下操作。"}]}],"synonyms":["4-methylene-2-oxetanone"],"phonetic":"/ˈdaɪkɪˌtiːn/","extraExplanation":["“diketene”是专业化学术语，常见于化工、材料与制药相关文本；日常英语里几乎不会用到。","它具有较强的刺激性与潜在危险性，现实工作中应遵循实验室/工厂的安全规范（如通风、防护、合规储存）；在学习语境中不建议自行接触。"]}
{"word":"diketo","summary":{"en":"Diketo means “having two ketone groups,” and it can also refer to a compound with two ketone (carbonyl) groups.","zh":"diketo 表示“含有两个酮基（羰基）”，也可指“含两个酮基的化合物（二酮）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Having two ketone (C=O) groups in a molecule; relating to a compound that contains two ketone groups.","zh":"（化学）二酮的；指分子中含有两个酮基（C=O）的，或与含两个酮基的化合物有关。"},"examples":[{"en":"Acetylacetone is a common diketone used in coordination chemistry.","zh":"乙酰丙酮是一种常见的二酮，常用于配位化学。"},{"en":"The diketone form can react to make a ring structure more easily than the keto form.","zh":"二酮形式相比单酮形式更容易发生反应生成环状结构。"}]},{"partOfSpeech":"n.","definition":{"en":"A compound that contains two ketone (carbonyl) groups; a diketone.","zh":"含有两个酮基（羰基）的化合物；二酮。"},"examples":[{"en":"The lab synthesized a diketone and checked it by NMR.","zh":"实验室合成了一种二酮，并用核磁共振（NMR）进行检测。"},{"en":"Some diketones can exist in equilibrium with an enol form.","zh":"一些二酮会与烯醇形式处于平衡状态。"}]}],"synonyms":["dicarbonyl","diketone"],"phonetic":"/daɪˈkiːtoʊ/","extraExplanation":["“diketo- / di-keto”常见于学术写作中作前缀或定语（如“diketo acid（二酮酸）”“diketo intermediate（二酮中间体）”）。在正式文本里更常见拼写为“di-keto”或直接用名词“diketone（二酮）”。","在有机化学中，二酮常与“烯醇（enol）”互变有关（keto–enol tautomerism），因此你可能会在机理或谱图分析里频繁见到它。"]}
{"word":"diketone","summary":{"en":"A diketone is a compound with two ketone (C=O) groups in one molecule.","zh":"diketone（二酮）指同一分子中含有两个酮基（羰基 C=O）的化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound that contains two ketone groups (two carbonyl groups, C=O) in the same molecule","zh":"一种在同一分子中含有两个酮基（两个羰基 C=O）的化合物"},"examples":[{"en":"Diacetyl is a diketone that gives a buttery smell in some foods.","zh":"双乙酰是一种二酮类化合物，在某些食物中会带来黄油般的气味。"},{"en":"Chemists often use diketones to make ring-shaped molecules in organic synthesis.","zh":"在有机合成中，化学家常用二酮来构建环状分子。"}]}],"synonyms":["diketone compound","di-ketone (variant spelling)"],"phonetic":"/daɪˈkiːtoʊn/","extraExplanation":["“diketone”由前缀 di-（表示“两个”）+ ketone（酮）构成，因此字面意思就是“两个酮基的化合物”。","常见例子包括：1,2-二酮（相邻两个羰基，如 diacetyl 双乙酰）和 1,3-二酮（中间隔一个碳，如 acetylacetone 乙酰丙酮）。不同位置会影响反应性与用途。","在日常英语中这个词主要出现在化学、材料、香精香料与有机合成相关语境里，属于学术/技术词汇。"]}
{"word":"diketopiperazine","summary":{"en":"A diketopiperazine is a ring-shaped “cyclic dipeptide” molecule formed from two amino acids.","zh":"二酮哌嗪是一种由两个氨基酸形成的环状“环二肽”分子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound type: a small ring-shaped molecule formed when two amino acids join and cyclize (a “cyclic dipeptide”), containing two ketone groups in a piperazine ring.","zh":"（化学）二酮哌嗪：一种小的环状分子，由两个氨基酸连接后发生环化形成（“环二肽”），其哌嗪环上含有两个酮基。"},"examples":[{"en":"Some bacteria produce diketopiperazines as signaling molecules.","zh":"一些细菌会产生二酮哌嗪作为信号分子。"},{"en":"The researcher identified a diketopiperazine in the fermentation extract.","zh":"研究人员在发酵提取物中鉴定出一种二酮哌嗪。"},{"en":"Diketopiperazine (DKP) structures are common in natural products chemistry.","zh":"二酮哌嗪（DKP）结构在天然产物化学中很常见。"}]}],"synonyms":["DKP","2,5-diketopiperazine","cyclic dipeptide"],"phonetic":"ˌdaɪˌkiːtoʊˈpaɪpəˌriːziːn","extraExplanation":["常见缩写是 DKP；更具体的写法有 2,5-diketopiperazine。","这类分子常见于发酵、微生物代谢物与一些天然产物研究中；在药物化学里也会作为“骨架（scaffold）”被用来设计分子。","词源上：di-（两个）+ keto-（酮基）+ piperazine（哌嗪环）；整体意思就是“带两个酮基的哌嗪环化合物”。"]}
{"word":"dikey","summary":{"en":"“Dikey” is a Turkish word meaning “vertical/upright,” not a standard English word.","zh":"“dikey”是土耳其语，意思是“垂直/竖直”，并非标准英语词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(From Turkish) vertical; upright; perpendicular to the ground.","zh":"（源自土耳其语）垂直的；竖直的；与地面成直角的。"},"examples":[{"en":"In Turkish, “dikey” means “vertical.”","zh":"在土耳其语里，“dikey”表示“垂直的”。"},{"en":"Draw a dikey line (a vertical line) on the graph.","zh":"在图上画一条dikey线（竖直线）。"}]}],"synonyms":["vertical","upright","perpendicular"],"phonetic":"/diˈkeɪ/","extraExplanation":["“dikey”不是常见英语单词，更多出现在土耳其语语境中（如土耳其教材、地图标注、工程/数学说明）。如果你想表达英语“垂直的”，最常用的是 vertical；在几何里也常说 perpendicular（垂直于……）。"]}
{"word":"diking","summary":{"en":"“Diking” usually means building/using dikes to control water (flood protection), and it can also be a geology term for rock dike formation.","zh":"“diking”通常指筑堤/用堤坝来控制水流、防洪；在地质学中也可指岩脉（岩墙）形成。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of building or repairing a dike (an embankment) to control water and prevent flooding","zh":"筑堤（修堤、建堤）的行为或过程，用堤坝来控制水流、防止洪水"},"examples":[{"en":"After the storm, the town spent weeks on diking to protect the riverbanks.","zh":"暴风雨过后，小镇花了好几周时间修堤加固河岸。"},{"en":"Diking can reduce flooding, but it may also change how water moves through nearby wetlands.","zh":"筑堤可以减少洪水，但也可能改变附近湿地的水流方式。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “dike”: building a dike; blocking or guiding water with a dike","zh":"“dike”的现在分词：筑堤；用堤坝阻挡或引导水流"},"examples":[{"en":"Workers are diking the low fields before the rainy season.","zh":"工人们在雨季前给低洼农田筑堤。"},{"en":"They are diking off the construction site to keep water out.","zh":"他们用堤坝把施工地围起来，防止进水。"}]},{"partOfSpeech":"n.","definition":{"en":"in geology, the formation or intrusion of a dike (a sheet of rock that cuts through other rock layers)","zh":"（地质）岩脉的形成或侵入：一种像“岩墙”一样切穿其他岩层的片状岩体"},"examples":[{"en":"The black lines in the cliff are from volcanic diking long ago.","zh":"悬崖上的黑色线条来自很久以前的火山岩脉侵入。"},{"en":"Geologists studied diking to understand how magma moved underground.","zh":"地质学家研究岩脉形成来了解岩浆在地下如何流动。"}]}],"synonyms":["levee building","embanking","flood control","dam building"],"phonetic":"/ˈdaɪkɪŋ/","extraExplanation":["拼写提示：美式英语常用 dike，英式也常见 dyke。注意 dyke 在部分语境中是对女同性恋的侮辱性用语；谈论水利工程或地质时用 dike 更安全、更中性。"]}
{"word":"dikirion","summary":{"en":"A two-candle liturgical candlestick used by an Eastern Orthodox bishop for blessings.","zh":"东正教主教在礼仪祝福时使用的“两支蜡烛”礼仪烛台。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Eastern Orthodox Christianity) A liturgical candlestick with two candles, held by a bishop during certain services for blessings.","zh":"（东正教礼仪）一种有两支蜡烛的礼仪烛台，主教在某些礼拜中手持，用来祝福。"},"examples":[{"en":"During the blessing, the bishop raised the dikirion toward the congregation.","zh":"祝福时，主教把 dikirion 举向会众。"},{"en":"Icons and candles surrounded the bishop as he carried the dikirion and the trikirion.","zh":"主教手持 dikirion 和 trikirion 时，周围摆着圣像与蜡烛。"}]}],"synonyms":["dikerion","two-candle candlestick","(related) trikirion"],"phonetic":"/dɪˈkɪriən/","extraExplanation":["这个词也常拼作 dikerion，来源于希腊语，字面与“两个”有关；在礼仪中“两支蜡烛”常被解释为象征基督的两种本性（神性与人性）。","常与 trikirion（三烛台，三支蜡烛）并提；trikirion 往往象征圣三（圣父、圣子、圣灵）。"]}
{"word":"dikkop","summary":{"en":"“Dikkop” usually means a stubborn person in South African English; it can also refer to a thick-knee bird in Southern Africa.","zh":"“dikkop”在南非英语里多指“固执的人”；在南部非洲语境中也可指一种叫厚膝鸻（thick-knee）的鸟。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(South African English, informal) A stubborn person; someone who refuses to change their mind.","zh":"（南非英语，非正式）固执的人；不肯改变主意的人。"},"examples":[{"en":"Don’t be such a dikkop—just listen for a minute.","zh":"别这么固执了——先听我说一分钟。"},{"en":"He’s a real dikkop when it comes to trying new ideas.","zh":"一提到尝试新点子，他就特别死脑筋。"}]},{"partOfSpeech":"n.","definition":{"en":"(Southern Africa) A kind of bird, also called a thick-knee (family Burhinidae), known for its large eyes and strong legs.","zh":"（南部非洲）一种鸟，也叫“厚膝鸻/厚膝鸟”（Burhinidae 厚膝鸻科），以大眼睛和强壮的腿著称。"},"examples":[{"en":"We heard a dikkop calling near the river at night.","zh":"夜里我们在河边听到厚膝鸻在叫。"},{"en":"A dikkop stood still in the grass, perfectly camouflaged.","zh":"一只厚膝鸻静静站在草丛里，伪装得很好。"}]}],"synonyms":["stubborn person","hardhead","thickhead","mule","thick-knee"],"phonetic":"ˈdɪkɑp","extraExplanation":["“dikkop”源自南非荷兰语/南非语：dik（厚的）+ kop（头）。用来形容人时，带有“脑袋硬、很难说服”的感觉，语气多为口语、略带调侃，有时也可能显得不礼貌。","用来指鸟时则比较中性，常见于南部非洲的自然观察/野外语境，对应英文常用名 thick-knee。"]}
{"word":"Dikmen","summary":{"en":"Dikmen is usually a proper name: a place name in Turkey (especially in Ankara) or a Turkish surname.","zh":"Dikmen通常是专有名词：土耳其的地名（尤其在安卡拉）或土耳其姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a proper name, most commonly referring to a place name (e.g., Dikmen, a neighborhood/district area in Ankara, Turkey) or a Turkish surname.","zh":"专有名词，最常见指地名（如土耳其安卡拉的Dikmen地区/街区）或土耳其姓氏。"},"examples":[{"en":"I lived in Dikmen when I studied in Ankara.","zh":"我在安卡拉读书时住在Dikmen。"},{"en":"Ms. Dikmen will join the meeting at 3 p.m.","zh":"Dikmen女士将在下午3点参加会议。"}]}],"phonetic":"/dikˈmɛn/","extraExplanation":["“Dikmen”在英语语境里通常不会作为普通词汇使用，而是作为人名或地名出现。","如果你是在阅读地图或地址（如“Dikmen Cd.”/“Dikmen Caddesi”，意为“Dikmen大街”）时看到它，一般就是安卡拉当地的地名用法。","作为姓氏时，英文写作与发音通常保持原拼写；在正式场合可以用“Mr./Ms. Dikmen”称呼。"]}
{"word":"diksha","summary":{"en":"Diksha most commonly means a spiritual initiation/ceremony in Indian religions; it is also used as a South Asian given name.","zh":"Diksha 最常指印度宗教中的灵性入门/灌顶仪式；也常作为南亚人名使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Hinduism, Buddhism, and Jainism) a formal spiritual initiation or consecration given by a teacher (guru), often involving vows, a mantra, or entering a new stage of religious practice.","zh":"（在印度教、佛教、耆那教中）由上师/导师授予的正式灵性灌顶或入门仪式，常包含誓愿、真言/咒语，或进入新的修行阶段。"},"examples":[{"en":"After receiving diksha, she began a daily meditation practice guided by her teacher.","zh":"在接受 diksha（灌顶/入门）后，她在老师的指导下开始了每日禅修。"},{"en":"He traveled to the ashram to request diksha from a respected guru.","zh":"他前往道场（ashram）向一位受尊敬的上师请求 diksha（传法入门）。"}]},{"partOfSpeech":"n.","definition":{"en":"a given name (especially in South Asia), often associated with the meaning “initiation” or “dedication.”","zh":"人名（南亚地区常见），常与“入门/灌顶、奉献/献身”的含义相关。"},"examples":[{"en":"Diksha is my classmate; her name comes from a Sanskrit word.","zh":"Diksha 是我的同学；她的名字源自梵语词。"},{"en":"Diksha said her parents chose the name because it suggests dedication to learning.","zh":"Diksha 说父母取这个名字，是因为它寓意对学习的投入与专注。"}]}],"synonyms":["initiation","consecration","ordination (sometimes)"],"phonetic":"/ˈdɪkʃɑː/","extraExplanation":["“Diksha”常见的音译也写作“dikṣā / dīkṣā”，来源于梵语，在不同传统里含义略有差别：有的强调“受戒/立誓”，有的强调“授予修行法门（如真言）”。","在英语文章中，它通常出现在与“guru（上师）/ initiation（入门）/ mantra（真言）/ ashram（道场）”相关的语境中。若用在宗教语境，写作小写 diksha；若指人名，通常首字母大写 Diksha。"]}
{"word":"Dikson","summary":{"en":"Dikson is most commonly a Russian Arctic port settlement; it can also be a surname variant of “Dixon.”","zh":"Dikson 最常指俄罗斯的北极港口聚落；也可能是姓氏，属于 “Dixon” 的拼写变体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Dikson: a small Arctic port settlement in Russia’s Krasnoyarsk Krai, near the Kara Sea (often written as “Dikson” in English).","zh":"Dikson：俄罗斯克拉斯诺亚尔斯克边疆区的一个北极港口型小城镇，靠近喀拉海（英文常写作 Dikson）。"},"examples":[{"en":"A supply ship docked at Dikson before heading deeper into the Arctic.","zh":"一艘补给船在 Dikson 靠港后继续向更深的北极航行。"},{"en":"Dikson is known for its harsh climate and strategic polar location.","zh":"Dikson 因严酷气候和重要的极地位置而闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"Dikson (also seen as a variant spelling of “Dixon”): a family name.","zh":"Dikson（也可视为 “Dixon” 的一种拼写变体）：姓氏。"},"examples":[{"en":"Ms. Dikson will present the report tomorrow.","zh":"Dikson 女士将于明天做报告。"}]}],"synonyms":["Dixon (spelling variant, for the surname)"],"phonetic":"/ˈdɪksən/","extraExplanation":["“Dikson”最常指俄罗斯北极圈附近的港口聚落，历史上与北方海航道（Northern Sea Route）的航运、气象与军事/补给站等用途有关。","英语里它的读音常与常见姓氏“Dixon”相同；在姓名语境中，有时只是不同家族的拼写选择。"]}
{"word":"diktat","summary":{"en":"A diktat is a demand or agreement imposed by a powerful side, leaving little room to negotiate.","zh":"diktat 指强势一方强加的命令或条款，几乎不给对方谈判空间。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an order or settlement forced on someone, usually by a powerful person or country, with little or no chance to negotiate","zh":"（强者强加于弱者、几乎不容商量的）命令；强加的条款（常指政治或外交上的）"},"examples":[{"en":"Many people saw the peace terms as a diktat rather than a fair agreement.","zh":"许多人把这些和平条款看作是强加的命令，而不是公平的协议。"},{"en":"The smaller state rejected the diktat from its neighbor and called for new talks.","zh":"这个小国拒绝了邻国强加的条件，并呼吁重新谈判。"},{"en":"Employees complained that the new policy felt like a diktat from management.","zh":"员工抱怨新政策像是管理层强加的命令。"}]}],"synonyms":["ultimatum","decree","edict","mandate","fiat","imposition"],"phonetic":"/dɪkˈtɑt/","extraExplanation":["“diktat”来自德语，原意接近“口授/命令”。在英语里多用于政治与外交语境，带有强烈的否定色彩，强调“被迫接受、缺乏谈判空间”。","历史上常与第一次世界大战后的《凡尔赛条约》相关：德国国内有人把该条约称为“凡尔赛强加条款（diktat）”，表达“被迫签署”的不满。","日常写作中可用来批评组织或上级“自上而下、不听意见”的做法，但语气较强，适合正式或评论性语境。"]}
{"word":"diktats","summary":{"en":"“Diktats” means harsh, imposed orders or terms—often from a powerful group to a weaker one—without negotiation.","zh":"“diktats”指强势一方不经协商强加的命令或条件，常带贬义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a harsh order or decision imposed by someone in power, often without discussion or agreement (plural of “diktat”)","zh":"（diktat 的复数）由强势一方强行下达、几乎不容商量的命令/决定（常带贬义）"},"examples":[{"en":"The smaller countries rejected the diktats from the empire.","zh":"这些较小的国家拒绝了帝国强加的命令。"},{"en":"Workers were tired of management’s diktats and wanted real dialogue.","zh":"员工厌倦了管理层的强硬指令，想要真正的对话。"}]}],"synonyms":["orders","decrees","edicts","dictates","ultimatums"],"phonetic":"ˈdɪk.tæt","extraExplanation":["“diktat”常用于政治、外交与国际关系语境，强调“强加、胁迫、缺乏协商”的态度，语气通常偏负面。","词源来自德语“Diktat”，历史上常用来指战后强国对弱国施加的条款，因此带有“被迫接受”的含义。"]}
{"word":"diktyonite","summary":{"en":"Diktyonite is a rare, older mineralogy term that is not commonly used today and is often treated as obsolete.","zh":"Diktyonite 是一个非常罕见的矿物学旧称，现代英语中多被视为过时用语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Mineralogy, rare/obsolete) A little-used mineral name found in older scientific writing; in modern sources it is usually treated as an outdated term (sometimes appearing as the variant spelling “dictyonite”) rather than a standard, currently recognized mineral species name.","zh":"（矿物学，罕见/旧称）在较早的科学文献中出现的矿物名称；现代资料里多被视为过时用语（有时也写作“dictyonite”），而不是当今通行、独立认可的矿物种名称。"},"examples":[{"en":"The term “diktyonite” appears in some 19th‑century mineral lists, but it is uncommon in modern textbooks.","zh":"“diktyonite”一词在一些19世纪的矿物目录中出现过，但在现代教材里很少见。"},{"en":"If you see “diktyonite” in an old article, check a current mineral database to find the accepted modern name.","zh":"如果你在旧文章里看到“diktyonite”，建议对照当代矿物数据库查询其对应的现代通用名称。"}]}],"synonyms":["dictyonite (variant spelling)"],"phonetic":"/ˌdɪkˈtaɪənaɪt/","extraExplanation":["这个词非常冷门，且不同资料对其指代可能不一致；因此在阅读或翻译时，最稳妥的做法是结合原文的产地、化学成分、晶体结构描述，去权威数据库（如 Mindat、IMA 名录）核对其对应的现行名称。","词根 dicty-/dikty- 来自希腊语 diktyon（“网、网状结构”），常用于表示“网状/格状”的形态特征；你可能会在其他术语中见到相同词根。"]}

