{"word":"DIL","summary":{"en":"DIL usually means “daughter-in-law.”","zh":"DIL 通常指“daughter-in-law（儿媳/媳妇）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “daughter-in-law,” the wife of your son (or your spouse’s son).","zh":"“daughter-in-law（儿媳/媳妇）”的缩写，指你儿子（或你配偶的儿子）的妻子。"},"examples":[{"en":"My DIL and I get along really well.","zh":"我和我儿媳相处得很好。"},{"en":"We’re visiting my DIL’s parents this weekend.","zh":"我们这周末要去拜访我儿媳的父母。"}]}],"synonyms":["daughter-in-law"],"phonetic":"ˌdiː aɪ ˈɛl","extraExplanation":["常见于英文家庭关系讨论（如育儿/家庭论坛、家谱、短信/聊天）里，用来快速指代亲属：DIL（daughter-in-law），类似还有 SIL（sister-in-law，姻亲姐妹/嫂子/弟媳等，视关系而定）、MIL（mother-in-law，婆婆/岳母）。","日常口语中更常直接说 daughter-in-law，DIL 更偏“书面简写/网络用语”。"]}
{"word":"dil","summary":{"en":"“DIL” is an abbreviation most often meaning “daughter-in-law.” In technical contexts, it can also mean “driver-in-the-loop.”","zh":"“DIL”多用于缩写“daughter-in-law（儿媳）”；在技术语境中也可能指“driver-in-the-loop（有人驾驶参与的仿真/测试）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbr.) daughter-in-law; the woman who is married to someone’s son.","zh":"（缩写）儿媳；某人的儿子所娶的妻子。"},"examples":[{"en":"My DIL and I get along well.","zh":"我和我的儿媳相处得很好。"},{"en":"We’re visiting my son and DIL this weekend.","zh":"这周末我们要去看望我儿子和儿媳。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr., tech) driver-in-the-loop; a kind of testing/simulation where a human driver participates in the system.","zh":"（缩写，科技）driver-in-the-loop（有人驾驶参与的仿真/测试）；指在测试或模拟中由真实驾驶员参与控制与反馈。"},"examples":[{"en":"The team ran a DIL simulation before road testing.","zh":"团队在上路测试前先做了有人驾驶参与的仿真。"},{"en":"DIL testing helps engineers see how real drivers react.","zh":"DIL 测试能帮助工程师观察真实驾驶者的反应。"}]}],"synonyms":["daughter-in-law","in-law"],"phonetic":"/ˌdiː aɪ ˈɛl/","extraExplanation":["“DIL”常见于家庭关系的聊天/短信或社交媒体中，作为“daughter-in-law”的简写；在正式写作中一般会写全称。","缩写在不同领域可能有不同含义；如果上下文不是家庭关系（如汽车、仿真、工程），就可能是技术含义。"]}
{"word":"dilacerate","summary":{"en":"Dilacerate means to tear something violently or, in a literary sense, to cause severe emotional anguish.","zh":"Dilacerate 指猛烈撕裂；也可（文学性地）指造成极度的情感痛苦。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to tear or split something apart violently; to lacerate badly","zh":"（猛烈地）撕裂；严重割裂、撕破"},"examples":[{"en":"The explosion dilacerated the metal door.","zh":"爆炸把金属门撕裂了。"},{"en":"The storm’s winds dilacerated the sails.","zh":"暴风把船帆撕得粉碎。"}]},{"partOfSpeech":"vt.","definition":{"en":"(literary/figurative) to cause intense emotional pain; to tear someone up inside","zh":"（文/比喻）使极度痛苦；让人内心像被撕裂一样难受"},"examples":[{"en":"The news of his friend’s death dilacerated him.","zh":"朋友去世的消息让他痛彻心扉。"},{"en":"Guilt dilacerated her for years.","zh":"内疚折磨了她多年。"}]}],"synonyms":["tear","rip","lacerate","rend","mangle","devastate"],"phonetic":"/daɪˈlæsəˌreɪt/","extraExplanation":["这个词较少用于日常口语，更常见于医学/法律/文学语境，强调“被撕得很厉害、很残酷”的感觉。日常更常用 tear, rip, lacerate；比喻义可用 break someone’s heart, devastate。","词源来自拉丁语 dilacerare（dis- 分开 + lacerare 撕裂）。因为词形较长、语气强烈，常用于写作中增强画面感或情绪力度。"]}
{"word":"dilacerated","summary":{"en":"Dilacerated means severely torn apart (literary) or, in dentistry, sharply bent/curved (especially a tooth root).","zh":"dilacerated 指（文学用语）被严重撕裂/撕碎的；在牙科中也指（尤指牙根）异常弯曲、急剧弯折的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(literary) Torn or ripped violently into pieces; badly mangled.","zh":"（文学用语）被猛烈撕裂成碎片的；被严重撕碎、弄得血肉模糊的。"},"examples":[{"en":"The dilacerated cloth hung from the fence after the storm.","zh":"暴风雨过后，那块被撕碎的布条挂在篱笆上。"},{"en":"In the novel, the soldier returns with a dilacerated uniform and a haunted look.","zh":"小说里，那名士兵穿着破烂不堪的军装归来，神情恍惚。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past form of “dilacerate”: to tear apart or lacerate severely.","zh":"“dilacerate”的过去式/过去分词：把……撕裂；使……严重割裂、撕碎。"},"examples":[{"en":"The sharp rocks dilacerated the boat’s sail.","zh":"锋利的岩石把船帆撕裂了。"},{"en":"Her hands were dilacerated by thorns as she pushed through the bushes.","zh":"她穿过灌木丛时被荆棘划得手上伤痕累累。"}]},{"partOfSpeech":"adj.","definition":{"en":"(medicine/dentistry) Bent or sharply curved (especially of a tooth root), as in “a dilacerated root.”","zh":"（医学/牙科）弯曲异常的；急剧弯折的（尤指牙根，如“dilacerated root/牙根弯曲”）。"},"examples":[{"en":"The X-ray showed a dilacerated root, which made the extraction harder.","zh":"X 光片显示牙根弯曲，这让拔牙更困难。"},{"en":"The dentist explained that the tooth was dilacerated due to early trauma.","zh":"牙医解释说这颗牙的弯曲可能源于早期外伤。"}]}],"synonyms":["torn","ripped","lacerated","mangled","shredded","jagged","severely damaged"],"phonetic":"/daɪˈlæsəˌreɪtɪd/","extraExplanation":["“dilacerated”来自拉丁语 dilacerare（di- 表“分开” + lacerare 表“撕裂、割裂”），因此语感上比常见的 “torn” 更“狠”、更有文学化的残酷画面感。","在日常英语里它很少用，多见于文学描写或医学/牙科语境；普通写作中常用 torn, ripped, mangled, badly torn 来替代更自然。"]}
{"word":"dilacerating","summary":{"en":"Dilacerating means “tearing apart,” especially in a metaphorical sense: causing intense emotional pain; it can also describe literal ripping.","zh":"Dilacerating 意为“撕裂、撕碎”，多用于比喻：令人极度痛苦、撕心裂肺；也可指字面上的撕裂。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) Causing intense emotional pain; deeply distressing, as if tearing someone’s feelings apart.","zh":"（形容词）令人极度痛苦的；使人心如刀割的（比喻像把情感撕裂一样）。"},"examples":[{"en":"It was dilacerating to hear the final message he left behind.","zh":"听到他留下的最后一段话，令人心如刀割。"},{"en":"The novel’s ending is dilacerating, but it feels honest.","zh":"这部小说的结局令人撕心裂肺，但却很真实。"}]},{"partOfSpeech":"v.","definition":{"en":"(v.) Present participle of “dilacerate”: tearing or ripping apart (physically), or metaphorically breaking someone’s peace of mind.","zh":"（动词）“dilacerate”的现在分词：撕裂、撕碎（身体上的），或比喻使人精神安宁被击碎。"},"examples":[{"en":"The sharp rocks were dilacerating the tires as the car slid downhill.","zh":"车往山下滑时，锋利的岩石把轮胎撕裂了。"},{"en":"He kept replaying the accident in his head, dilacerating himself with guilt.","zh":"他一遍遍回放那场事故，用内疚折磨自己，像在撕裂自己。"}]}],"synonyms":["heartbreaking","excruciating","agonizing","shattering","tear apart","rend"],"phonetic":"/daɪˈlæsəˌreɪtɪŋ/","extraExplanation":["“dilacerate”较罕见、偏文学/正式用语，常见在描写强烈痛苦或残酷场景的文本中；日常英语里更常用的替代词有：heartbreaking（令人心碎的）、excruciating（极其痛苦的）、tear apart（撕裂/让人崩溃）。","词源来自拉丁语：di-（分开）+ lacerare（撕裂）。因此它既可指“身体被撕裂”，也常用作情感上的“撕心裂肺”。"]}
{"word":"dilaceration","summary":{"en":"Dilaceration most commonly means an abnormal sharp bend in a tooth (especially the root), often linked to trauma during development.","zh":"Dilaceration 最常指牙齿（尤其牙根）的异常锐角弯曲，常与发育期外伤有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Dentistry/medicine) An abnormal bend or sharp curve in a tooth (often the root), usually caused by injury during tooth development.","zh":"（牙科/医学）牙齿（常见为牙根）出现异常弯曲或锐角弯折，通常与牙齿发育期受到外伤有关。"},"examples":[{"en":"The X-ray showed dilaceration of the upper incisor root.","zh":"X 光片显示上颌门牙牙根有弯曲畸形（dilaceration）。"},{"en":"Because of the dilaceration, the dentist planned treatment more carefully.","zh":"由于存在牙根弯曲畸形，牙医更谨慎地制定了治疗方案。"}]},{"partOfSpeech":"n.","definition":{"en":"(General, less common) The act of tearing or lacerating tissue; a severe tear.","zh":"（较少见的一般用法）撕裂；组织被严重撕破的情况。"},"examples":[{"en":"The report mentioned dilaceration of soft tissue after the accident.","zh":"报告提到事故后软组织出现撕裂。"}]}],"synonyms":["tooth root curvature","root dilaceration","laceration (general sense)"],"phonetic":"/dɪˌlæsəˈreɪʃən/","extraExplanation":["这个词在日常英语中很少见，最常出现在牙科影像报告或病历里。牙科里的 dilaceration 往往指牙根“弯得很厉害”，可能会影响拔牙、根管治疗或正畸牵引等操作难度，因此医生常会通过 X 光或 CBCT 评估弯曲的方向与程度。","词源上来自拉丁语前缀 di-（加强/彻底）+ lacerare（撕裂），所以它在一般医学语境里也可表示“撕裂”，但临床英语里更常用 laceration（裂伤/撕裂伤）。"]}
{"word":"dilactic","summary":{"en":"Didactic means “intended to teach,” sometimes “too preachy.”","zh":"didactic 表示“旨在教学/教诲的”，有时含“过于说教”的语气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely intended word) designed to teach or intended to give instruction, sometimes in a way that feels too moralizing or preachy.","zh":"（多半是你想写的词）“教诲性的；旨在教学的”，有时也带“说教、讲大道理”的负面语气。"},"examples":[{"en":"The book is didactic: it tries to teach children how to be kind.","zh":"这本书很有教诲性：它试图教孩子们如何友善待人。"},{"en":"Some readers find the movie too didactic and not entertaining enough.","zh":"一些观众觉得这部电影太说教了，不够有趣。"}]},{"partOfSpeech":"n.","definition":{"en":"a person, style, or work that teaches, especially in a moral or instructive way.","zh":"教诲者；（尤指）以道德或教育为目的的风格/作品。"},"examples":[{"en":"He writes as a didactic, always trying to teach a lesson.","zh":"他写作风格像个说教者，总想讲一个道理。"}]}],"synonyms":["instructional","educational","moralistic","preachy"],"phonetic":"/daɪˈdæktɪk/","extraExplanation":["“dilactic”不是常见英语单词，最可能是把 didactic 拼错了（i 和 a 的位置容易混）。","didactic 来自希腊语 didaktikos，和 “teach（教）”有关。","语气提示：didactic 可以是中性（有教育意义），也常带轻微贬义（太说教、像在训人）。","常见搭配：didactic tone（说教的语气）, didactic poem/novel（寓教于…的诗/小说）。","相关词：didactically（adv. 说教地）, didacticism（n. 说教倾向）。"]}
{"word":"dilactone","summary":{"en":"Dilactone is a chemistry term for a molecule that has two lactone (cyclic ester) rings.","zh":"Dilactone 是化学术语，指含有两个内酯（环状酯）环的分子。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound that contains two lactone rings (two cyclic esters) in the same molecule","zh":"（化学）二内酯；一种在同一分子中含有两个内酯环（两个环状酯）的化合物"},"examples":[{"en":"The researchers synthesized a new dilactone as an intermediate in the reaction.","zh":"研究人员合成了一种新的二内酯，作为该反应的中间体。"},{"en":"Some natural products contain a dilactone structure that affects their biological activity.","zh":"一些天然产物含有二内酯结构，这会影响它们的生物活性。"}]}],"synonyms":["bis(lactone)"],"phonetic":"/daɪˈlæktoʊn/","extraExplanation":["“lactone（内酯）”指分子内部由羟基与羧酸反应形成的环状酯；“di-”表示“两个”。因此 dilactone 直译为“含两个内酯环的化合物”。","该词多见于有机化学、药物化学与天然产物研究论文中，属于专业术语，日常英语很少使用。"]}
{"word":"dilambdodont","summary":{"en":"Dilambdodont describes molars with two V-shaped (W-shaped) ridges, common in many insect-eating mammals.","zh":"Dilambdodont 指臼齿具有两个V形（常呈W形）齿嵴的牙齿结构，常见于许多食虫类哺乳动物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a mammal’s molar teeth) having a pattern with two V-shaped ridges (often forming a W-shape), typical of many insect-eating mammals.","zh":"（指哺乳动物的臼齿）具有“双V形齿嵴”（常呈W形）结构的；常见于许多食虫类哺乳动物。"},"examples":[{"en":"Shrews typically have dilambdodont molars adapted for cutting insect exoskeletons.","zh":"鼩鼱通常具有 dilambdodont 型臼齿，适合切割昆虫的外骨骼。"},{"en":"The fossil was identified as a small insectivore partly because its teeth were dilambdodont.","zh":"这块化石之所以被鉴定为小型食虫动物，部分原因是它的牙齿呈 dilambdodont 型。"}]}],"synonyms":["W-shaped molars","dilambdodont molar pattern"],"phonetic":"/daɪˌlæmboʊˈdɑnt/","extraExplanation":["这个词主要用于动物学/古生物学的牙齿形态描述。词源可拆为 di-（两个）+ lambda（希腊字母“λ”，指V形）+ -odont（牙）。因此字面意思是“两个λ形的牙”。","在相关文献中，你也可能看到对比术语：tribosphenic（丘-楔式臼齿，许多哺乳动物常见）、zalambdodont（单一V形/λ形齿嵴）。"]}
{"word":"dilamination","summary":{"en":"Delamination means layers of a material separate or peel apart.","zh":"Delamination 指材料的多层结构发生分层或剥离。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually spelled “delamination”) the separation or peeling apart of layers in a material (for example, in composites, plywood, paint, or laminated paper).","zh":"（通常拼作“delamination”）指材料的分层、剥离：原本粘在一起的多层结构彼此分开（常见于复合材料、胶合板、油漆层或覆膜纸等）。"},"examples":[{"en":"The engineer found delamination in the carbon-fiber panel after the impact.","zh":"工程师在碳纤维板受到撞击后发现了分层现象。"},{"en":"Moisture can cause delamination between the paint and the wall.","zh":"潮气可能导致油漆层与墙面之间发生剥离。"},{"en":"If the laminate bubbles up, it may be a sign of delamination.","zh":"如果覆膜鼓起起泡，可能是分层的迹象。"}]}],"synonyms":["layer separation","peeling","splitting","debonding"],"phonetic":"/diˌlæməˈneɪʃən/","extraExplanation":["“dilamination”常见为拼写错误；标准拼法是“delamination”。","词根提示：de-（分离、去除）+ lamina（薄层）。在工程与材料科学中很常见，常和“composite materials（复合材料）”“bonding（粘结）”“fatigue（疲劳）”“moisture（水分）”一起出现。"]}
{"word":"Dilan","summary":{"en":"Dilan is a given name used in several cultures, especially Turkish and Kurdish; it may sometimes be confused with “Dylan.”","zh":"Dilan 是一个人名，在多种文化中使用，尤其常见于土耳其语与库尔德语文化；有时也会与 “Dylan” 混淆。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (first name). It is used in several cultures, especially Turkish and Kurdish, and is also used as a unisex name in some places.","zh":"一个人名（名字/名）。在多种文化中使用，尤其常见于土耳其语与库尔德语文化；在一些地区也可作为中性名字使用。"},"examples":[{"en":"Dilan introduced herself to the class on the first day.","zh":"Dilan 在第一天向全班做了自我介绍。"},{"en":"I met someone named Dilan at the library.","zh":"我在图书馆遇到了一位叫 Dilan 的人。"}]},{"partOfSpeech":"other","definition":{"en":"(sometimes) a spelling variant or confusion with “Dylan,” another popular given name in English-speaking countries.","zh":"（有时）会被当作 “Dylan” 的拼写变体或与其混淆；“Dylan” 在英语国家也很常见。"},"examples":[{"en":"My friend’s name is Dilan, but people sometimes write it as Dylan.","zh":"我朋友叫 Dilan，但别人有时会写成 Dylan。"}]}],"synonyms":["(no direct synonyms; it’s a personal name)"],"phonetic":"/diːˈlɑːn/","extraExplanation":["在土耳其语中，Dilan 常被解释为“心（heart）/心上人”等含义；在库尔德语语境里也常见，并常与“爱、心、情感”等意象相关。不同地区与家庭对名字含义的理解可能不完全一致。","如果你是在英文写作里使用这个名字，通常不需要翻译；只要注意大小写（首字母大写）和对方偏好的拼写即可。"]}
{"word":"dilaniate","summary":{"en":"“Delineate” means to describe or define something clearly and in detail, or to draw its outline.","zh":"“Delineate”指清楚而详细地描述/界定某事，或描绘其轮廓。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to describe, show, or define something clearly and in detail","zh":"清楚而详细地描述、勾勒或界定（某事）"},"examples":[{"en":"The report delineates the steps we need to take to reduce costs.","zh":"报告清楚地列出了我们需要采取的降低成本的步骤。"},{"en":"She delineated the differences between the two plans in a simple chart.","zh":"她用一张简单的图表清楚地说明了两个方案的区别。"},{"en":"The law delineates what counts as harassment in the workplace.","zh":"法律明确界定了职场中何为骚扰。"}]},{"partOfSpeech":"vt.","definition":{"en":"to draw or trace the outline of something (especially in art or maps)","zh":"（尤指在绘画或地图中）描绘、勾画……的轮廓"},"examples":[{"en":"The artist delineated the figure in charcoal before adding color.","zh":"画家先用木炭勾勒人物轮廓，再上色。"},{"en":"Early cartographers delineated coastlines based on sailors’ notes.","zh":"早期制图师根据水手的记录勾画海岸线。"}]}],"synonyms":["describe","define","outline","specify","depict","portray"],"phonetic":"/dɪˈlɪniˌeɪt/","extraExplanation":["你输入的 **dilaniate** 不是常见的英语单词，最可能是拼写错误；常见目标词是 **delineate**（清楚地说明/勾勒）。","容易混淆的近形词：**dilate**（使扩张；详述）、**delinate**（不常见/多为误拼）。在写作中想表达“清晰界定/阐明”，通常用 **delineate**。"]}
{"word":"Dilantin","summary":{"en":"Dilantin is a brand-name prescription anti-seizure medicine (phenytoin).","zh":"Dilantin 是苯妥英的商品名之一，属于处方抗癫痫药。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand name for phenytoin, a prescription medicine used to prevent and control certain kinds of seizures (epilepsy).","zh":"苯妥英（phenytoin）的商品名之一，是一种处方抗癫痫药，用于预防和控制某些类型的癫痫发作。"},"examples":[{"en":"The doctor prescribed Dilantin to help control his seizures.","zh":"医生开了 Dilantin 来帮助控制他的癫痫发作。"},{"en":"She takes Dilantin every day and gets regular blood tests.","zh":"她每天服用 Dilantin，并定期做血液检查。"}]}],"synonyms":["phenytoin","anti-seizure medication","anticonvulsant"],"phonetic":"/daɪˈlæntɪn/","extraExplanation":["Dilantin 是“商品名”（brand name）；在很多医疗场景中也会用它的通用名/学名 phenytoin（苯妥英）。不同国家可能更常用通用名而不是商品名。","这类药物通常需要按医嘱规律服用，且可能需要监测血药浓度与药物相互作用；因此在英文语境中常搭配 take/stop/adjust Dilantin（服用/停用/调整剂量）以及 blood level/test（血药浓度/检测）等表达。"]}
{"word":"dilantin","summary":{"en":"Dilantin is a brand-name seizure medication (phenytoin).","zh":"Dilantin 是抗癫痫药苯妥英（phenytoin）的商品名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand name for phenytoin, a prescription medicine used to help prevent and control seizures (especially in epilepsy).","zh":"苯妥英（phenytoin）的商品名之一；一种处方抗癫痫药，用于预防和控制癫痫发作。"},"examples":[{"en":"He takes Dilantin every day to control his seizures.","zh":"他每天服用 Dilantin 来控制癫痫发作。"},{"en":"The doctor adjusted her Dilantin dose after a blood test.","zh":"医生在做完血液检查后调整了她的 Dilantin 剂量。"},{"en":"Dilantin may interact with other medications, so tell your doctor what you take.","zh":"Dilantin 可能与其他药物发生相互作用，所以要告诉医生你正在服用哪些药。"}]}],"synonyms":["phenytoin"],"phonetic":"/daɪˈlæntɪn/","extraExplanation":["Dilantin 是“商品名/品牌名”，通用名是 phenytoin（苯妥英）。在医学或药学语境中，人们也常直接说 phenytoin。","它属于处方药，使用时常需要监测血药浓度；不同人对剂量反应差异较大。涉及用药问题请以医生/药师建议为准。","英语里药品名通常首字母大写（Dilantin），而通用名通常小写（phenytoin）。"]}
{"word":"dilapidate","summary":{"en":"Dilapidate means to damage or let something (especially a building) fall into ruin through neglect, or to become run-down over time.","zh":"dilapidate 指（尤指建筑）因疏于维护而变得破败失修，或使其逐渐毁坏。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to let a building or property fall into a state of disrepair; to damage or ruin something over time (often by neglect)","zh":"（使建筑/财产）破败失修；（常因疏于维护而）使逐渐毁坏"},"examples":[{"en":"Years of neglect dilapidated the old farmhouse.","zh":"多年的疏于照料使那座老农舍变得破败不堪。"},{"en":"Heavy rain and wind can dilapidate wooden houses if they aren’t maintained.","zh":"如果不维护，暴雨和大风会使木屋逐渐损坏。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become run-down or broken over time","zh":"逐渐破败；变得年久失修"},"examples":[{"en":"Without repairs, the roof will dilapidate quickly.","zh":"如果不修理，屋顶会很快破败。"}]}],"synonyms":["run down","fall into disrepair","decay","deteriorate","ruin","wreck"],"phonetic":"/daɪˈlæpɪˌdeɪt/","extraExplanation":["词源来自拉丁语 *dilapidare*，原意与“石头（lapis）”有关，后来引申为“使建筑损坏、使东西破败”。","在现代英语里更常见的是形容词 **dilapidated**（破旧的、年久失修的），例如：*a dilapidated house*（一栋破旧的房子）。"]}
{"word":"dilapidated","summary":{"en":"Dilapidated describes a building or structure that is in very poor condition from age or neglect.","zh":"dilapidated 用来形容建筑或结构因年久失修或疏于维护而非常破旧。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"In very bad condition because of age, neglect, or long use; falling apart.","zh":"（因年久失修、疏于维护或长期使用而）破旧的；残破不堪的；摇摇欲坠的。"},"examples":[{"en":"They moved out of a dilapidated apartment with broken windows.","zh":"他们搬出了那间窗户都破了的破旧公寓。"},{"en":"The town is trying to repair dilapidated roads and bridges.","zh":"这个城镇正努力修复破败的道路和桥梁。"},{"en":"A dilapidated barn stood at the edge of the field.","zh":"一座摇摇欲坠的谷仓立在田地边。"}]}],"synonyms":["run-down","decrepit","crumbling","ramshackle","shabby"],"phonetic":"/dɪˈlæpɪˌdeɪtɪd/","extraExplanation":["词源：来自拉丁语 dilapidare，原意与“把石头扔散/拆毁”有关（lapis=石头）。所以它常带有“因疏于维护而逐渐破败”的感觉。","使用提示：dilapidated 多用于房屋、建筑、道路等“物理结构”。形容人时通常不常见，可能带有不礼貌或文学化的效果。","搭配常见：dilapidated building/house/apartment; in a dilapidated state。","近义词差别：run-down 更口语；decrepit 更强调“老朽、衰败”；crumbling 强调“正在崩塌/碎裂”的状态。"]}
{"word":"dilapidating","summary":{"en":"“Dilapidating” describes something that is gradually becoming ruined or run-down, or the process of making it that way (present participle of “dilapidate”).","zh":"“dilapidating”表示“逐渐破败/走向荒废”，也可指“使逐渐破败”的过程，是动词“dilapidate”的现在分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(present participle of “dilapidate”) becoming broken down, old, and in poor condition; falling into ruin.","zh":"（动词 dilapidate 的现在分词）逐渐破败、老化失修；走向荒废。"},"examples":[{"en":"The dilapidating house had a leaking roof and broken windows.","zh":"那栋逐渐破败的房子屋顶漏水，窗户也破了。"},{"en":"Without repairs, the school building is dilapidating year by year.","zh":"如果不维修，那栋校舍会一年比一年更破败。"}]},{"partOfSpeech":"v.","definition":{"en":"(as a verb form) causing something to become run-down or ruined over time.","zh":"（作动词形式）使某物随着时间推移而破败、失修。"},"examples":[{"en":"Neglect is dilapidating the historic theater.","zh":"疏于维护正在让那座历史剧院逐渐破败。"},{"en":"Heavy rain and poor drainage are dilapidating the road surface.","zh":"暴雨和排水不良正在让路面逐渐损坏。"}]}],"synonyms":["deteriorating","decaying","crumbling","falling apart","wearing down"],"phonetic":"/dɪˈlæpəˌdeɪtɪŋ/","extraExplanation":["“dilapidate”在现代英语里更常见的是形容词“dilapidated”（破败的）来描述房屋、建筑、道路等状态；动词形式（以及“dilapidating”）相对少见、偏书面。","词源与拉丁语“lapis（石头）”有关，原意带有“拆掉石头/使建筑失修”的感觉，所以常与建筑、设施等“结构性变坏”相关。"]}
{"word":"dilapidation","summary":{"en":"Dilapidation means the state or process of becoming badly damaged and neglected, especially for buildings.","zh":"dilapidation 指（尤指建筑物因年久失修而）破败的状态或逐渐破败的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a state of being in poor condition because of age, neglect, or damage (especially of a building)","zh":"（尤指建筑物因年久、疏于维护或受损而）破败、荒废的状态"},"examples":[{"en":"The old house fell into dilapidation after years of neglect.","zh":"这座老房子多年无人打理，逐渐变得破败不堪。"},{"en":"The city promised to repair schools that were suffering from dilapidation.","zh":"市政府承诺修缮那些日益破败的学校。"}]},{"partOfSpeech":"n.","definition":{"en":"the process of becoming ruined or broken down over time","zh":"（随时间推移）逐渐毁坏、衰败的过程"},"examples":[{"en":"Moisture speeds up the dilapidation of wooden furniture.","zh":"潮湿会加速木质家具的损坏。"},{"en":"They documented the dilapidation of the factory in photos.","zh":"他们用照片记录了工厂逐渐破败的过程。"}]}],"synonyms":["disrepair","deterioration","decay","ruin"],"phonetic":"/dɪˌlæpɪˈdeɪʃən/","extraExplanation":["词源提示：dilapidation 来自拉丁语词根 lapis（“石头”）。最初和“把石头拆掉/让石头建筑倒塌”有关，所以现代常用来形容房屋、桥梁等建筑物的破败。","常见搭配：fall into dilapidation（变得破败）；in a state of dilapidation（处于破败状态）；prevent/repair dilapidation（防止/修复破败）。","区分：dilapidation 更强调“长期失修导致的破败”；ruin 更泛指“毁坏/毁灭”；decay 常指“腐朽、衰败”（也可用于身体或道德层面）。"]}
{"word":"dilapidations","summary":{"en":"Dilapidations means a state of disrepair, and in leasing it can mean repairs/damages a tenant may owe at the end of a lease.","zh":"Dilapidations 指“破败、失修”；在租赁语境中也指租约结束时租户可能需要修复或赔偿的损坏与维修义务。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being in poor condition because of age, neglect, or damage; disrepair","zh":"（因年久失修、疏于维护或受损而导致的）破败；失修；残破"},"examples":[{"en":"The old factory fell into dilapidations after years of being abandoned.","zh":"这座旧工厂荒废多年后变得破败不堪。"},{"en":"The report described the building’s dilapidations, including broken windows and a leaking roof.","zh":"报告描述了这栋楼的失修状况，包括破碎的窗户和漏水的屋顶。"}]},{"partOfSpeech":"n.","definition":{"en":"(property/lease law) damage or lack of repairs that a tenant must fix or pay for at the end of a lease","zh":"（房屋租赁/物业法律）租约期满时租户需修复或赔偿的损坏与未履行的维修义务（常用复数）"},"examples":[{"en":"The landlord claimed dilapidations and deducted the cost from the security deposit.","zh":"房东主张“租赁期末修复赔偿”，并从押金中扣除了相关费用。"},{"en":"Before moving out, they hired a contractor to reduce potential dilapidations.","zh":"搬出前，他们雇了施工队来减少可能产生的期末修复赔偿。"}]}],"synonyms":["disrepair","deterioration","decay","ruin","damage","wear and tear"],"phonetic":"/dɪˌlæpəˈdeɪʃənz/","extraExplanation":["“Dilapidations”在日常英语里多指“房屋破败/失修”（常以复数出现）；在英式法律与商业租赁语境中尤其常见，指租户未按租约维护导致的维修项目与费用，常见搭配有：schedule of dilapidations（失修清单）、claim dilapidations（提出赔偿要求）。"]}
{"word":"dilapidator","summary":{"en":"A formal word for someone who wastes or ruins property or money, often in a public or legal context.","zh":"一个偏正式的词，指挥霍或败坏财产/资金的人，常见于公共或法律语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who wastes, mismanages, or ruins property or money (especially public, institutional, or inherited resources).","zh":"（尤指对公共、机构或继承财产的）挥霍者；败家子；把财物管理得一团糟的人。"},"examples":[{"en":"The audit accused the official of being a dilapidator of public funds.","zh":"审计指控这名官员是公共资金的挥霍者。"},{"en":"In the novel, the heir is portrayed as a dilapidator who sells off the family estate.","zh":"在小说中，这位继承人被刻画成挥霍家产、变卖祖产的败家子。"}]}],"synonyms":["spendthrift","waster","mismanager","squanderer","embezzler"],"phonetic":"/dɪˈlæpɪˌdeɪtɚ/","extraExplanation":["“dilapidator”是较罕见、偏正式/法律语境的词，常用于指责某人“让财产败坏、毁损或流失”。在日常英语里更常用的表达是 *spendthrift*（挥霍者）、*waster*（浪费者）、*embezzler*（侵吞者，强调犯罪）或 *mismanager*（管理不善者）。","词源上与拉丁语 *dilapidare*（使破败、拆毁、挥霍）有关，也与常见词 *dilapidated*（破旧的、失修的）同源：一个强调“造成破败的人”（-ator 表示“做……的人”）。","文学或历史写作中，它常用来强调道德评判：不仅是“花钱多”，而是“把本应维护的财产/制度弄坏”。"]}
{"word":"dilatability","summary":{"en":"Dilatability means the ability to expand or widen, used especially in technical or medical contexts.","zh":"dilatability 指“可扩张/可变宽的能力”，多用于技术或医学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The ability of something to expand or be stretched; the capacity to dilate.","zh":"（事物）可扩张性；可伸展性；膨胀能力。"},"examples":[{"en":"Rubber has high dilatability, so it can stretch without breaking.","zh":"橡胶的可扩张性很强，因此可以拉伸而不易断裂。"},{"en":"The engineer measured the dilatability of the material at different temperatures.","zh":"工程师测量了这种材料在不同温度下的可膨胀性。"}]},{"partOfSpeech":"n.","definition":{"en":"(In biology/medicine) The ability of a body part or opening to widen, especially a blood vessel or the pupil of the eye.","zh":"（生物/医学）扩张能力，尤指血管或瞳孔等部位的变宽能力。"},"examples":[{"en":"Doctors study the dilatability of blood vessels to understand circulation.","zh":"医生研究血管的扩张能力，以了解血液循环。"},{"en":"Bright light reduces the dilatability of the pupil.","zh":"强光会降低瞳孔继续扩张的能力（使其更不容易扩张）。"}]}],"synonyms":["expandability","stretchability","capacity to dilate","distensibility"],"phonetic":"/ˌdaɪləˈtæbəlɪti/","extraExplanation":["“Dilatability”来自“dilate”（扩张、膨胀）+ “-ability”（……的能力）。在日常英语中更常用的是“dilation”（扩张）或“expandability/stretchability”（可扩张/可伸展性），而“dilatability”较偏学术或技术语境。","拼写上注意：英式英语常见“dilatation”，美式更常见“dilation”。“dilatability”两种拼写都能理解，但在论文或报告里建议根据领域习惯选用更常见的词。"]}
{"word":"dilatable","summary":{"en":"Dilatable means capable of being widened or expanded, especially in medical or technical contexts.","zh":"Dilatable 指“可扩张的、可变大的”，尤常用于医学或技术语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to be made wider or larger; capable of expansion (often used in medical or technical contexts).","zh":"可扩张的；可变大的（常用于医学或技术语境）。"},"examples":[{"en":"The doctor checked whether the patient’s pupils were dilatable in low light.","zh":"医生检查病人的瞳孔在弱光下是否能扩张。"},{"en":"Some blood vessels are more dilatable than others.","zh":"有些血管比其他血管更容易扩张。"}]},{"partOfSpeech":"adj.","definition":{"en":"able to be widened by a device or treatment (e.g., a tube, passage, or opening that can be dilated).","zh":"可通过器械或治疗扩张的（如管道、通道或开口）。"},"examples":[{"en":"The surgeon noted that the narrowed passage was still dilatable.","zh":"外科医生指出，这条变窄的通道仍然可以扩张。"},{"en":"This catheter is designed for use in dilatable ducts.","zh":"这种导管设计用于可扩张的管道。"}]}],"synonyms":["expandable","distensible","extensible"],"phonetic":"ˈdaɪleɪtəbəl","extraExplanation":["“dilatable”在日常英语里不算常见，更常见的说法是“can be dilated”或用形容词“distensible / expandable”。但在医学报告、解剖学与工程材料描述中，“dilatable”会显得更精确、更正式。","不要和“dilated”（已经扩张的）混淆：dilatable = 有能力/可以被扩张；dilated = 目前处于扩张状态。"]}
{"word":"dilatableness","summary":{"en":"Dilatableness means the ability or quality of being able to expand or widen.","zh":"dilatableness 指“可扩张性/可伸展性”，即能够被扩大或变宽的性质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being able to expand, widen, or be stretched (physically or figuratively)","zh":"可扩张性；可伸展性（指物体或事物能够被扩大、变宽或被拉伸的特性，也可引申为“可扩展性”）"},"examples":[{"en":"Rubber has a high dilatableness, so it can stretch without breaking.","zh":"橡胶的可伸展性很强，所以它可以拉伸而不断裂。"},{"en":"Engineers tested the dilatableness of the material under heat and pressure.","zh":"工程师测试了这种材料在高温高压下的可扩张性。"}]}],"synonyms":["dilatability","expandability","elasticity","stretchiness"],"phonetic":"/daɪˌleɪtəˈb(ə)lnəs/","extraExplanation":["“dilatableness”来自动词 dilate（扩张、扩大），常见于较正式或技术性的语境（如材料科学、医学、工程）。日常英语里更常说 expandability / elasticity（取决于强调“可扩张”还是“弹性可伸缩”）。","医学中常见搭配是 pupil dilation（瞳孔扩张）或 blood vessel dilation（血管扩张）。描述“可扩张性”时，更常用 dilatability（同义，更常见）或 compliance（强调在压力下的“顺应性/可扩张性”，常用于血管、肺等）。"]}
{"word":"dilatably","summary":{"en":"Dilatably means “in a way that can be expanded or made wider.”","zh":"dilatably 指“以可扩张、可变宽的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that can be dilated (expanded or made wider).","zh":"以可扩张（可变宽、可膨胀）的方式。"},"examples":[{"en":"The metal ring is designed so it can fit dilatably onto different-sized pipes.","zh":"这个金属环被设计成可扩张地套在不同尺寸的管道上。"},{"en":"Some medical devices are built to open dilatably inside a narrow passage.","zh":"有些医疗器械被设计成能在狭窄通道内可扩张地打开。"}]}],"synonyms":["expandably","distensibly","in an expandable way"],"phonetic":"/daɪˈleɪtəbli/","extraExplanation":["“dilatably”比较少见，多出现在工程、医学或材料相关的正式写作中。日常英语里更常用的是“in an expandable way / so that it can expand（以可扩张的方式/以便能够扩张）”。","词根来自“dilate（使扩大）”，与“dilation（扩张）”“dilatable（可扩张的）”同源。"]}
{"word":"dilatancy","summary":{"en":"Dilatancy is the tendency of some fluids or mixtures to become thicker when force or pressure is applied.","zh":"Dilatancy 指某些流体或混合物在受力/受压时变得更黏稠、更难流动的性质（剪切增稠）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a property of some materials (especially certain liquids or suspensions) in which they become thicker and harder to flow when pressure or force is applied (also called shear-thickening).","zh":"（材料，尤指某些液体或悬浮液的）剪切增稠性：在受到压力或外力作用时，会变得更黏稠、更难流动的性质。"},"examples":[{"en":"A cornstarch-and-water mixture shows dilatancy: it feels solid when you hit it but flows when you hold it gently.","zh":"玉米淀粉加水的混合物会表现出剪切增稠性：用力拍打时像固体，但轻轻握住时又会流动。"},{"en":"Engineers study dilatancy to understand how certain fluids behave under sudden stress.","zh":"工程师研究剪切增稠性，以了解某些流体在突然受力时的表现。"}]}],"synonyms":["shear-thickening","shear thickening behavior"],"phonetic":"/daɪˈlætənsi/","extraExplanation":["“Dilatancy”常见于物理、化学、材料科学等语境，日常英语里不常用。直观例子是“oobleck”（淀粉水）：慢慢搅拌很顺，但快速用力搅拌会变得很难动。","词源与拉丁语有关，核心含义与“扩张/变大”相关；在科学语境中指材料在受剪切时体积或流变性质出现明显变化的现象。"]}
{"word":"dilatant","summary":{"en":"Dilatant describes materials that thicken when force or fast motion is applied (shear-thickening).","zh":"dilatant 指材料在受力或快速运动时会变稠（剪切增稠）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a material or fluid) becoming thicker and more resistant to flow when stirred, shaken, or put under sudden force (shear-thickening).","zh":"（材料或流体）在搅拌、摇晃或受到突然外力（剪切）时变得更稠、更不易流动的；剪切增稠的。"},"examples":[{"en":"A cornstarch-and-water mixture is dilatant—it hardens when you hit it quickly.","zh":"玉米淀粉加水的混合物是剪切增稠的——你快速拍打它时会变硬。"},{"en":"Some industrial slurries show dilatant behavior under high-speed mixing.","zh":"一些工业浆料在高速搅拌下会表现出剪切增稠（dilatant）行为。"}]},{"partOfSpeech":"n.","definition":{"en":"a shear-thickening material or fluid.","zh":"剪切增稠材料；剪切增稠流体。"},"examples":[{"en":"Engineers tested several dilatants to improve impact protection.","zh":"工程师测试了几种剪切增稠材料，以提升抗冲击防护效果。"}]}],"synonyms":["shear-thickening","non-Newtonian (often)","dilatant fluid"],"phonetic":"/daɪˈleɪtənt/","extraExplanation":["这个词主要用于流变学（研究材料如何流动/变形）。日常最常见的例子是“玉米淀粉+水”（常被叫作 oobleck）：慢慢搅动像液体，快速用力会像固体一样变硬。","近义表达常见为 shear-thickening（剪切增稠）。相对概念是 thixotropic（触变的）：受力时变稀、静置后变稠。"]}
{"word":"dilatants","summary":{"en":"“Dilatants” are materials/fluids that thicken when stirred or hit (shear-thickening).","zh":"“Dilatants”指在搅拌或受冲击时会变稠的材料/流体（剪切增稠）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a material or fluid) Becoming thicker and more resistant to flow when it is stirred, shaken, or hit (shear-thickening).","zh":"（材料或流体）在搅拌、摇晃或受到撞击时变得更稠、更难流动的；剪切增稠的。"},"examples":[{"en":"Some mixtures of cornstarch and water are dilatant—they feel solid when you punch them.","zh":"有些玉米淀粉和水的混合物是剪切增稠的——你用拳头打下去会感觉像固体。"},{"en":"The engineer tested a dilatant fluid to see how it reacted under sudden force.","zh":"工程师测试了一种剪切增稠流体，看看它在突然受力时如何反应。"}]},{"partOfSpeech":"n.","definition":{"en":"A dilatant material or fluid (a shear-thickening substance).","zh":"剪切增稠材料（或流体）；受力时会“变稠”的物质。"},"examples":[{"en":"Oobleck is a common classroom dilatant.","zh":"“非牛顿流体”淀粉糊（Oobleck）是课堂上常见的剪切增稠物质。"},{"en":"Researchers compared several dilatants for protective padding.","zh":"研究人员比较了几种剪切增稠材料，用于防护垫。"}]}],"synonyms":["shear-thickening","non-Newtonian (in some contexts)"],"phonetic":"/daɪˈleɪtənt/","extraExplanation":["“dilatants”是“dilatant”的复数形式。该词主要用于物理/材料科学（流变学）语境，日常英语里不常见。","注意不要和“dilettante(s)”混淆：dilettante 指“浅尝辄止的业余爱好者/半吊子”，而 dilatant 指“受力变稠的材料/流体”。"]}
{"word":"dilatate","summary":{"en":"“Dilatate” means “(to) dilate”: to expand or become wider, often used in medical contexts.","zh":"“dilatate”意为“扩张、扩大”，与“dilate”同义，常见于医学语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to become wider or larger; to make something wider or larger (same meaning as “dilate,” and less common in everyday English).","zh":"（使）扩大；（使）变宽；（与 dilate 同义，但日常英语中较少用）。"},"examples":[{"en":"In dim light, your pupils dilatate to let in more light.","zh":"在昏暗的光线下，你的瞳孔会扩大以让更多光线进入。"},{"en":"The doctor used drops to dilatate the patient’s pupils before the exam.","zh":"医生在检查前用滴眼液使病人的瞳孔扩大。"}]}],"synonyms":["dilate","expand","widen","enlarge"],"phonetic":"/daɪˈleɪteɪt/","extraExplanation":["“dilatate”在现代英语里比较少见，更多场合会用“dilate”。在医学语境（尤其谈到血管、瞳孔扩张）里，你更常看到“dilate/dilation”。如果你是在拼写或考试中遇到，通常把它当作“dilate”的变体即可。"]}
{"word":"dilatation","summary":{"en":"Dilatation means expansion or widening, especially in scientific or medical contexts (often the same as “dilation”).","zh":"dilatation 指“扩张/扩大”，多用于科学或医学语境，常与 dilation 含义相近。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or process of expanding, becoming wider, or stretching; an increase in size or width.","zh":"扩张；扩大；伸展（指变宽、变大或被拉伸的过程或结果）。"},"examples":[{"en":"Heat causes dilatation of metals, so the bridge joints are designed to move slightly.","zh":"热会导致金属发生膨胀，所以桥梁接缝会被设计成可以轻微移动。"},{"en":"The doctor noted dilatation of the pupil after the eye drops were used.","zh":"医生观察到滴眼药水后瞳孔发生了散大。"}]},{"partOfSpeech":"n.","definition":{"en":"In medicine, a widening of a hollow body part (such as a blood vessel, pupil, or cervix).","zh":"（医学）中空器官或通道的扩张/扩张状态（如血管、瞳孔或子宫颈的扩张）。"},"examples":[{"en":"Cervical dilatation is monitored during labor.","zh":"分娩过程中会监测宫颈扩张情况。"},{"en":"Severe dilatation of the blood vessel can increase health risks.","zh":"血管严重扩张可能会增加健康风险。"}]}],"synonyms":["dilation","expansion","widening","enlargement"],"phonetic":"/ˌdaɪləˈteɪʃən/","extraExplanation":["“dilatation”常见于英式英语或较正式的科技/医学写作；在日常英语里更常用“dilation”。两者含义基本相同。","词源来自拉丁语“dilatare”（使变宽、展开）。在科学语境中常与温度、材料、孔径、血管等搭配使用。"]}
{"word":"dilatational","summary":{"en":"Dilatational means “related to expansion,” especially volume increase; in physics it often refers to compressional (P-wave) motion.","zh":"dilatational 指“与膨胀有关”，尤指体积增大；在物理中常指压缩性（P波）运动或波。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to expansion (dilation), especially an increase in volume rather than a change in shape.","zh":"与膨胀/扩张（dilation）有关的，尤指体积增大（而不主要是形状改变）。"},"examples":[{"en":"Heat can cause dilatational changes in some materials.","zh":"热量会使某些材料发生膨胀性的变化。"},{"en":"The model includes dilatational strain to describe volume increase.","zh":"该模型包含膨胀应变，用来描述体积的增大。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Physics/engineering) Describing compressional motion or waves in an elastic medium, where particles move in the direction of wave travel (often contrasted with shear).","zh":"（物理/工程）指弹性介质中的压缩性运动或波：质点沿波的传播方向前后振动（常与剪切波相对）。"},"examples":[{"en":"P-waves are dilatational waves that travel through solids and liquids.","zh":"P波是压缩（膨胀）波，可以在固体和液体中传播。"},{"en":"Seismic data can separate dilatational and shear components.","zh":"地震数据可以区分压缩（膨胀）分量和剪切分量。"}]}],"synonyms":["expansive","dilational","expanding","volumetric"],"phonetic":"/ˌdaɪləˈteɪʃənəl/","extraExplanation":["“dilatational”在日常英语里不常见，更多出现在材料科学、弹性力学与地球物理中。它通常和“体积变化（volumetric change）”联系在一起。","在地震学中，“dilatational wave”常指P波（primary wave）。注意：日常场景更常用的词是“expanding/expansive”或“dilating”。"]}
{"word":"dilatations","summary":{"en":"Dilatations are instances or processes of widening or expanding, often used in medical contexts (e.g., pupil or cervix widening).","zh":"dilatations 指“扩张/扩大”的过程或结果，常见于医学语境（如瞳孔或子宫颈扩张）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of expanding or widening; an instance of becoming larger in size or area","zh":"扩张；膨胀；（变）扩大（的过程或结果）"},"examples":[{"en":"Heat can cause dilatation of metals.","zh":"加热会导致金属膨胀。"},{"en":"The doctor measured the dilatation of the blood vessel.","zh":"医生测量了血管的扩张情况。"}]},{"partOfSpeech":"n.","definition":{"en":"(medicine) the widening of an opening in the body, especially the pupil of the eye or the cervix during childbirth","zh":"（医学）身体开口的扩张（尤指瞳孔散大或分娩时子宫颈扩张）"},"examples":[{"en":"The nurse checked the cervix dilatation during labor.","zh":"护士在分娩过程中检查子宫颈的扩张度。"},{"en":"The eye drops caused pupil dilatation.","zh":"这种滴眼液引起了瞳孔散大。"}]}],"synonyms":["expansion","widening","enlargement","dilation"],"phonetic":"/ˌdaɪləˈteɪʃən/","extraExplanation":["“dilatations”是复数形式，单数是“dilatation”。在日常英语里，更常见的对应词是“dilation”（拼写更短，但意思基本相同）；在医学场景中两者都能见到。","词源来自拉丁语 *dilatare*（使变宽、扩展）。在医学记录里常与“pupil/cervix + dilation/dilatation”搭配出现。"]}
{"word":"dilatative","summary":{"en":"“Dilatative” means causing widening or expansion, often in medical or technical writing.","zh":"“dilatative”表示“使……扩张/变宽”，常见于医学或技术写作中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"causing something to expand or widen (especially used in medical or technical contexts).","zh":"使……扩张的；使……变宽的（尤用于医学或技术语境）。"},"examples":[{"en":"The doctor prescribed a dilatative eye drop to widen the pupil.","zh":"医生开了一种扩瞳（使瞳孔扩张的）眼药水。"},{"en":"Heat can have a dilatative effect on metal, making it expand.","zh":"热会对金属产生膨胀作用，使其伸长或变大。"}]}],"synonyms":["dilating","expanding","widening","vasodilating"],"phonetic":"/daɪˈleɪtətɪv/","extraExplanation":["“dilatative”较少见，更常见的表达是“dilating / dilatory / vasodilating（血管扩张的）”。它来自动词“dilate（扩张）”，多用于生理学、药理学、工程材料等场景。"]}
{"word":"dilatator","summary":{"en":"Dilatator (also commonly spelled dilator) means a muscle or medical device that widens an opening in the body.","zh":"dilatator（更常见拼写为 dilator）指使身体开口变宽的肌肉，或用于扩张开口的医疗器械。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A muscle or part of the body that widens (dilates) an opening or passage in the body (for example, the pupil of the eye).","zh":"（解剖/生理）使某个开口或通道变宽的肌肉或身体部位（例如让瞳孔变大的肌肉）。"},"examples":[{"en":"In dim light, the dilatator muscle helps the pupil open wider.","zh":"在光线昏暗时，扩张肌会帮助瞳孔变得更大。"},{"en":"Damage to the dilatator of the iris can affect how the eye reacts to light.","zh":"虹膜扩张肌受损会影响眼睛对光线的反应。"}]},{"partOfSpeech":"n.","definition":{"en":"A medical instrument or device used to widen an opening in the body (for example, the cervix or a blood vessel) during an examination or procedure.","zh":"（医学）用于在检查或手术中扩张身体某个开口的器械/装置（如扩张宫颈或血管）。"},"examples":[{"en":"The doctor used a dilatator to gently widen the passage.","zh":"医生用扩张器轻柔地扩宽通道。"},{"en":"Some procedures require a dilatator of increasing sizes.","zh":"有些操作需要使用逐渐增大尺寸的扩张器。"}]}],"synonyms":["dilator","expander","dilating device"],"phonetic":"/ˈdaɪleɪˌteɪtər/","extraExplanation":["“dilatator”在现代英语里较少见，更常见的拼写是“dilator”。两者意思相同，尤其在医学语境中常用“dilator”。词根来自拉丁语，和“dilate（扩张）”同源。"]}
{"word":"dilatatory","summary":{"en":"Dilatory means slow or intended to delay, often in a critical sense.","zh":"Dilatory 指行动缓慢或故意拖延，常含批评意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Slow to act; causing delay; taking longer than necessary (often used to criticize a person or process).","zh":"行动迟缓的；拖延的；导致延误的（常带批评意味）。"},"examples":[{"en":"The committee was dilatory in responding to the complaint.","zh":"委员会对投诉的回应很拖延。"},{"en":"Dilatory tactics can make a simple decision take weeks.","zh":"拖延战术会让一个简单的决定拖上好几周。"},{"en":"Please don’t be dilatory—this deadline is firm.","zh":"请不要拖拖拉拉——这个截止日期是固定的。"}]},{"partOfSpeech":"adj.","definition":{"en":"Intended to delay or stall something (especially in law or formal procedures).","zh":"（尤指法律或正式程序中）意在拖延的；用来搪塞拖时间的。"},"examples":[{"en":"The judge rejected the dilatory motion.","zh":"法官驳回了那份拖延性动议。"},{"en":"They filed a dilatory appeal to postpone payment.","zh":"他们提出拖延性上诉以推迟付款。"}]}],"synonyms":["slow","tardy","delaying","procrastinating","stalling"],"phonetic":"/ˈdɪləˌtɔri/","extraExplanation":["你写的 **dilatatory** 常见于拼写误差；标准拼写是 **dilatory**。","词源来自拉丁语 *differre*（推迟、延后），所以它通常带有“故意或不必要地拖延”的批评语气。","使用场景上，日常可说“a dilatory response（拖延的回复）”；在法律英语里常见“dilatory tactics/motion（拖延战术/拖延性动议）”。"]}
{"word":"dilate","summary":{"en":"“Dilate” means to become wider/larger (or make something wider), especially in medical/scientific contexts; it can also mean to speak or write at greater length about a topic.","zh":"“dilate”指（使）扩张、变大、张开（常见于医学/科学语境）；也可指对某个话题“展开详述”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to become wider or larger; to make something wider or larger (often used for an opening, tube, or the pupil of the eye)","zh":"（使）变宽、扩大、张开（常用于开口、管道或眼睛的瞳孔）"},"examples":[{"en":"In low light, your pupils dilate to let in more light.","zh":"在光线较暗时，你的瞳孔会扩大以进入更多光线。"},{"en":"The doctor used eye drops to dilate her pupils for the exam.","zh":"医生用滴眼液使她的瞳孔扩大，以便检查。"},{"en":"Heat can cause metal to dilate slightly.","zh":"热量会使金属稍微膨胀。"}]},{"partOfSpeech":"v.","definition":{"en":"to talk or write about something in a longer, more detailed way","zh":"详述；展开说明（把内容说得更长、更细）"},"examples":[{"en":"Could you dilate on what you mean by “fairness”?","zh":"你能详细说明一下你所说的“公平”是什么意思吗？"},{"en":"She didn’t dilate on the reasons for leaving.","zh":"她没有细说离开的原因。"}]}],"synonyms":["expand","widen","enlarge","distend","open","elaborate (on)"],"phonetic":"/daɪˈleɪt/","extraExplanation":["“dilate”在医学语境中非常常见：如“pupils dilate（瞳孔放大）”“cervix dilate（宫颈开大）”。在就诊场景里也会听到“dilation（扩张/开大）”。","在“详述”的意思中，常见搭配是“dilate on/upon something”，语气偏正式；日常口语里更常用“explain more / go into detail”。"]}
{"word":"dilated","summary":{"en":"Dilated means “widened/expanded,” especially about pupils, blood vessels, or openings; it’s also the past form of “dilate.”","zh":"dilated 表示“扩张的、变大的”，常指瞳孔、血管或开口等；也可作动词 dilate 的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"made wider or larger; expanded (often used for pupils, blood vessels, or openings).","zh":"扩张的；变大的（常用于瞳孔、血管或开口等）。"},"examples":[{"en":"The doctor noticed that her pupils were dilated.","zh":"医生注意到她的瞳孔放大了。"},{"en":"Heat can cause blood vessels to become dilated.","zh":"高温会导致血管扩张。"}]},{"partOfSpeech":"v.","definition":{"en":"(past form of dilate) to make or become wider or larger.","zh":"（dilate 的过去式/过去分词）使变宽、变大；（变得）扩张。"},"examples":[{"en":"The eye drops dilated his pupils for the exam.","zh":"为了检查，那些眼药水使他的瞳孔放大了。"},{"en":"Her pupils dilated in the dark.","zh":"在黑暗中她的瞳孔放大了。"}]}],"synonyms":["expanded","widened","enlarged","distended"],"phonetic":"/daɪˈleɪtɪd/","extraExplanation":["“dilated pupils”（瞳孔放大）在医疗语境中很常见，可能由光线变化、药物（如散瞳剂）、情绪反应（紧张/兴奋）或某些疾病引起；在正式场合建议说 “His/Her pupils were dilated.” 比 “His/Her eyes were dilated.” 更准确。","在文学或影视描写中，“dilated pupils”常用来暗示强烈情绪（恐惧、爱慕、兴奋）或危险信号（中毒、受伤），是一种带画面感的细节描写。"]}
{"word":"dilatedly","summary":{"en":"“Dilatedly” means “in an expanded or widened way,” but it is uncommon; writers usually use “dilated” or “dilate.”","zh":"“dilatedly”意为“以扩张/变宽的方式”，但不常用；更常见的是“dilated”或“dilate”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a dilated (expanded or widened) way; with something spread open or enlarged","zh":"以扩张的（变宽/变大/张开的）方式；呈扩大状态地"},"examples":[{"en":"In the dim light, her pupils looked dilatedly, making her eyes seem unusually dark.","zh":"在昏暗的光线下，她的瞳孔看起来是扩张的，让她的眼睛显得格外深黑。"},{"en":"The tube was dilatedly opened so the doctor could see inside more clearly.","zh":"管道被扩张式地打开，以便医生更清楚地观察内部。"}]}],"synonyms":["expansively","widely","openly","in an enlarged way"],"phonetic":"/daɪˈleɪtɪdli/","extraExplanation":["“dilatedly”比较少见，实际写作中更常用的是形容词“dilated”（扩张的）或动词“dilate”（扩张）。例如：Her pupils were dilated. / The doctor dilated the artery.","在医学或生理语境里，常见搭配是“dilated pupils”（瞳孔扩张），表示光线暗、紧张、药物影响等导致瞳孔变大。","注意不要和“delayedly”（迟迟地）混淆：dilate = 扩大/扩张；delay = 延迟。"]}
{"word":"dilatedness","summary":{"en":"“Dilatedness” means the state or degree of being widened or expanded, often referring to pupils or blood vessels.","zh":"“dilatedness”指变宽或变大的状态/程度，常用于描述瞳孔或血管的扩张。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or degree of being dilated (opened wider or expanded), especially in a body part such as the pupils of the eyes or blood vessels","zh":"（尤指瞳孔、血管等）扩张、张开变大的状态或程度"},"examples":[{"en":"The doctor noted the dilatedness of her pupils after the eye drops.","zh":"医生在点了眼药水后注意到她瞳孔的扩张程度。"},{"en":"Dilatedness of the blood vessels can make the skin look red or warm.","zh":"血管的扩张可能让皮肤看起来发红或发热。"}]}],"synonyms":["dilation","dilatation","widening","expansion"],"phonetic":"/daɪˈleɪtɪdnəs/","extraExplanation":["“dilatedness”由形容词“dilated（扩张的）”+ 名词后缀“-ness”构成，字面意思是“扩张的状态”。在日常与医学英语中，更常见、更自然的名词是“dilation”（扩张）或“dilatation”（英式/医学拼写）。","该词多见于较正式或技术性写作，用来强调“扩张这一性质/程度”，而不是单纯指“扩张这一过程”（process）。"]}
{"word":"dilatement","summary":{"en":"“Dilatement” is a rare, old-fashioned noun meaning either “expansion/dilation” or “delay/long-windedness.”","zh":"“dilatement”是罕见的旧用名词，可指“扩张/膨胀”，也可指“拖延/赘述”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/old-fashioned) the act of making something wider or larger; expansion; dilation.","zh":"（罕见/旧用）使某物变宽、变大；扩张；膨胀（同 dilation/dilatation）。"},"examples":[{"en":"In older medical writing, “dilatement of the pupil” meant that the pupil became wider.","zh":"在较早的医学写作中，“dilatement of the pupil”指瞳孔变大。"},{"en":"Heat can cause a slight dilatement of metal parts.","zh":"热会导致金属部件轻微膨胀。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare/old-fashioned) delay; the act of putting something off, or speaking/writing at length instead of being direct.","zh":"（罕见/旧用）延迟；拖延；（说话/写作）铺陈过多、不够直截了当。"},"examples":[{"en":"The committee asked for no further dilatement and demanded a decision.","zh":"委员会要求不再拖延，必须作出决定。"},{"en":"Without dilatement, he stated the main point clearly.","zh":"他不作铺陈，直接清楚地说出了要点。"}]}],"synonyms":["dilation","dilatation","expansion","enlargement","delay","postponement"],"phonetic":"/daɪˈleɪtmənt/","extraExplanation":["“dilatement”在现代英语里非常少见，很多时候读者会把它当作拼写错误。更常用的词是“dilation / dilatation”（扩张、膨胀），而表示“拖延”的常见词是“delay / postponement / procrastination”。","历史上动词“dilate”既可表示“使扩大”，也可表示“详述、拖延（to dilate on a topic）”，因此这个名词在旧文本里可能对应两种含义。写作中一般建议改用更常见的现代词。"]}
{"word":"dilater","summary":{"en":"“Dilater” is usually a misspelling of “dilator”: a medical device or drug that widens a body opening; for the action, use the verb “dilate.”","zh":"“dilater”通常是“dilator”的误拼：指让身体开口/通道变宽的医疗器械或药物；表示“扩张”的动作更常用动词“dilate”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly spelled “dilator”) a device or substance that makes an opening in the body wider (for example, a pupil dilator in the eye, or a cervical dilator).","zh":"（常见拼写为“dilator”）一种器械或药物，用来使身体的某个开口/通道变宽（例如使瞳孔放大的药物，或扩张宫颈的器械）。"},"examples":[{"en":"The eye doctor used a pupil dilator before the exam.","zh":"眼科医生在检查前使用了瞳孔扩张药物。"},{"en":"A cervical dilator may be used during certain medical procedures.","zh":"某些医疗操作中可能会使用宫颈扩张器。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare; in general English, people use the verb “dilate”) someone or something that dilates (makes something expand).","zh":"（较少见；一般英语更常用动词“dilate”）使……扩张的人或物。"},"examples":[{"en":"Heat can act as a dilator of metals.","zh":"热量可以起到使金属膨胀的作用。"}]}],"synonyms":["dilator","expander","dilatator"],"phonetic":"/daɪˈleɪtər/","extraExplanation":["“dilater”在标准英语里不太常见；很多情况下是把“dilator（扩张器/扩张药）”拼错了。","如果你想表达“（使）扩张”，更常用动词是“dilate”（如：The pupils dilate in the dark. 在黑暗中瞳孔会放大）。"]}
{"word":"dilaters","summary":{"en":"“Dilaters” usually refers to “dilators”: devices or medicines that widen an opening or vessel.","zh":"“dilaters”通常指“dilators”：使开口或血管等变宽的器械或药物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly spelled “dilators”.) Devices or medicines that make an opening, tube, or blood vessel wider.","zh":"（更常见拼写为 dilators。）使开口、管道或血管变宽的器械或药物（扩张器/扩张剂）。"},"examples":[{"en":"The doctor used cervical dilators during the procedure.","zh":"医生在手术过程中使用了宫颈扩张器。"},{"en":"Some inhalers contain bronchodilators that help you breathe more easily.","zh":"一些吸入器含有支气管扩张剂，能帮助你更轻松地呼吸。"}]},{"partOfSpeech":"n.","definition":{"en":"People or things that cause something to expand or become wider (less common, more general use).","zh":"使某物膨胀或变宽的人或事物（较少见、更一般性的用法）。"},"examples":[{"en":"Heat and pressure can be strong dilators of metal.","zh":"热和压力可能是金属强有力的“扩张因素”。"}]}],"synonyms":["dilators","expanders","wideners","bronchodilators"],"phonetic":"/daɪˈleɪtərz/","extraExplanation":["“dilaters”不是最常见的拼写。医学与生理学里更常用的是“dilators”，来自动词 dilate（扩张）。如果你是在写医学内容（如宫颈扩张器、支气管扩张剂），建议用 dilators。","dilator 也可能指眼科检查时用的“散瞳剂/扩瞳药”（pupil dilator）。"]}
{"word":"dilates","summary":{"en":"“Dilates” means “expands” or “makes something expand,” often used for pupils, blood vessels, and openings.","zh":"“Dilates”表示“（变）扩张/膨胀”或“使……扩张”，常用于瞳孔、血管和各种开口。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(of something) to become wider or larger; to expand.","zh":"（某物）变宽、变大；扩张。"},"examples":[{"en":"In the dark, your pupils dilates to let in more light.","zh":"在黑暗中，你的瞳孔会扩张以让更多光线进入。"},{"en":"As the balloon warms up, it dilates slightly.","zh":"气球变暖时会稍微膨胀。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something wider or larger; to cause it to expand.","zh":"使某物变宽、变大；使扩张。"},"examples":[{"en":"The medicine dilates blood vessels and improves circulation.","zh":"这种药会扩张血管并改善循环。"},{"en":"The doctor used eye drops to dilates the patient’s pupils.","zh":"医生使用滴眼液使病人的瞳孔扩张。"}]}],"synonyms":["expand","widen","enlarge","open up","distend"],"phonetic":"/daɪˈleɪt/","extraExplanation":["“dilates”是动词“dilate”的第三人称单数现在时（he/she/it dilates）。在医学语境中非常常见：pupils dilate（瞳孔放大），blood vessels dilate（血管扩张）。","比喻用法也常见：例如“The city dilates outward”（城市向外扩张）、“His smile dilates”（他的笑容舒展开来），表示范围或情绪“变大/展开”。"]}
{"word":"dilating","summary":{"en":"“Dilating” means expanding or widening, especially of pupils in the eyes.","zh":"“Dilating”表示“扩张、变大”，常指眼睛的“瞳孔放大”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"becoming wider or larger; expanding (the present participle of “dilate”).","zh":"变宽、变大；扩张（“dilate”的现在分词/进行式）。"},"examples":[{"en":"The metal ring is dilating as it heats up.","zh":"金属环受热时正在膨胀。"},{"en":"The small business is dilating into a national brand.","zh":"这家小企业正在扩张成全国品牌。"}]},{"partOfSpeech":"v.","definition":{"en":"(of the eyes) having pupils that are opening wider, often because of darkness, emotion, or medicine.","zh":"（眼睛）瞳孔放大（常因光线变暗、情绪变化或药物作用）。"},"examples":[{"en":"In the dark room, her eyes were dilating.","zh":"在黑暗的房间里，她的瞳孔在放大。"},{"en":"The doctor used drops that caused his pupils to be dilating.","zh":"医生用了滴眼液，使他的瞳孔开始放大。"}]}],"synonyms":["expanding","widening","enlarging","spreading"],"phonetic":"/ˈdaɪleɪtɪŋ/","extraExplanation":["“dilating”常见于医学语境，尤其是眼科检查：医生会用散瞳药水让瞳孔变大，以便更清楚地检查眼底。日常英语里也会说“dilate your pupils / get your eyes dilated（散瞳）”。"]}
{"word":"dilatingly","summary":{"en":"“Dilatingly” means “in an expanding way,” and less commonly “in a detailed, expanded way (at length).”","zh":"“dilatingly”意为“以扩张的方式”，较少见也可指“详尽地、展开来讲”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an expanding way; so as to become wider or larger (especially about pupils, blood vessels, or an opening).","zh":"以扩张的方式；使变宽或变大的（尤指瞳孔、血管或某个开口）。"},"examples":[{"en":"The doctor noted that the patient’s pupils were responding dilatingly to the low light.","zh":"医生注意到病人的瞳孔在弱光下呈扩张反应。"},{"en":"The medication can act dilatingly on certain blood vessels.","zh":"这种药物可能对某些血管起到扩张作用。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Less common) At length; in an expanded, detailed way when speaking or writing.","zh":"（较少见）详尽地；在说话或写作时展开来讲。"},"examples":[{"en":"He explained the plan dilatingly, adding details the team hadn’t considered.","zh":"他把计划讲得很详尽，补充了团队之前没想到的细节。"},{"en":"The essay discusses the theme dilatingly rather than briefly summarizing it.","zh":"这篇文章对主题展开论述，而不是简要概括。"}]}],"synonyms":["expansively","in an expanded way","in a dilated way","at length","in detail"],"phonetic":"/daɪˈleɪtɪŋli/","extraExplanation":["“dilatingly”很少用于现代口语，更常见的表达是：for the first meaning 用“in a dilated way / while dilating”；表示“详尽地”时更自然用“at length / in detail / expansively”。","词源上来自动词“dilate”（扩张、展开）+ 副词后缀“-ly”，因此语气略显书面或旧式，常见于医学、学术或文学描写。"]}
{"word":"dilation","summary":{"en":"Dilation means expansion or widening; it’s common in medicine (pupils, cervix, blood vessels) and in math for scaling shapes.","zh":"Dilation 指“扩张、变宽”，常见于医学（瞳孔、宫颈、血管）和数学（图形按比例伸缩）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of becoming wider or larger; an expansion in size (often of an opening, passage, or body part).","zh":"变宽；扩大；（开口、通道或身体部位的）扩张。"},"examples":[{"en":"The doctor checked the dilation of her pupils with a light.","zh":"医生用光检查了她瞳孔的扩张。"},{"en":"In childbirth, cervical dilation is measured in centimeters.","zh":"分娩时，子宫颈扩张会用厘米来测量。"},{"en":"The dilation of the blood vessels can lower blood pressure.","zh":"血管扩张可能会降低血压。"}]},{"partOfSpeech":"n.","definition":{"en":"(mathematics) a change in scale that makes a figure larger or smaller while keeping its shape (similarity).","zh":"（数学）伸缩变换；按比例放大或缩小且保持形状不变（相似）。"},"examples":[{"en":"A dilation with a scale factor of 2 doubles the size of the triangle.","zh":"伸缩变换的比例因子为2会把三角形放大一倍。"},{"en":"The diagram shows a dilation around the origin.","zh":"图示展示了以原点为中心的伸缩变换。"}]}],"synonyms":["expansion","widening","enlargement","dilatation","scaling"],"phonetic":"/daɪˈleɪʃən/","extraExplanation":["在医学语境里，dilation 常指“扩张”的状态或过程，相关动词是 dilate（扩张），形容词是 dilated（扩张的）。日常英语里也会说 pupils dilate（瞳孔放大）或 blood vessels dilate（血管扩张）。","词源来自拉丁语 dilatare，意为“展开、扩大”。"]}
{"word":"dilational","summary":{"en":"Dilational means “causing delay” (rare; like dilatory) and can also mean “relating to dilation/expansion” in technical contexts.","zh":"Dilational 可指“拖延的/造成延误的”（较少见，近似 dilatory）；在技术语境中也可指“与扩张（dilation）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"causing delay; tending to postpone action (a rare word, similar to “dilatory”).","zh":"造成拖延的；倾向于推迟行动的（较少见，用法接近 dilatory）。"},"examples":[{"en":"The court criticized the company’s dilational tactics.","zh":"法院批评了该公司的拖延策略。"},{"en":"Dilational behavior can damage trust in a team.","zh":"拖延的行为会破坏团队中的信任。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to dilation (expanding or widening), especially in technical or medical contexts (rare).","zh":"与“扩张/扩大”（dilation）有关的，尤用于技术或医学语境（较少见）。"},"examples":[{"en":"The report mentioned dilational changes in the patient’s pupils.","zh":"报告提到了患者瞳孔的扩张变化。"}]}],"synonyms":["dilatory","delaying","stalling","procrastinating","obstructive"],"phonetic":"/daɪˈleɪʃənəl/","extraExplanation":["“dilational”在现代英语中相对少见。表示“拖延的”时，更常用的是 **dilatory**（尤其在法律、正式写作中常见：dilatory tactics/arguments）。","注意不要把“拖延的”（delay）和“扩张的”（dilation）混淆：它们拼写相近，但语义来源可能让人误解。遇到一般写作场景，选 **dilatory**（拖延的）或 **delaying**（正在造成延误的）通常更自然。"]}
{"word":"dilations","summary":{"en":"“Dilations” means widenings or expansions; it’s commonly used for pupil/cervical widening in medicine and for scaling transformations in geometry.","zh":"“Dilations”指扩张/变大；常用于医学中的瞳孔或宫颈扩张，也可指几何中的伸缩变换。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of expanding, widening, or becoming larger; instances of such expansion","zh":"扩张；膨胀；变大（的过程或情况）"},"examples":[{"en":"The doctor measured the dilations of the pupils in low light.","zh":"医生在弱光下测量瞳孔的扩张情况。"},{"en":"Heat can cause dilations in metal parts, which may loosen a tight fit.","zh":"受热会导致金属部件膨胀，从而可能让原本紧密的配合变松。"}]},{"partOfSpeech":"n.","definition":{"en":"(medicine) the widening of an opening in the body, especially during childbirth (cervical dilation)","zh":"（医学）身体开口的扩张，尤指分娩时的宫颈扩张（开指）"},"examples":[{"en":"Her contractions became stronger as cervical dilations increased.","zh":"随着宫颈扩张（开指）增加，她的宫缩变得更强。"},{"en":"The nurse checked the dilations and recorded the progress of labor.","zh":"护士检查开指情况，并记录产程进展。"}]},{"partOfSpeech":"n.","definition":{"en":"(geometry) transformations that enlarge or shrink a figure while keeping its shape (scalings)","zh":"（几何）相似变换/伸缩变换：在保持形状的同时放大或缩小图形"},"examples":[{"en":"In class, we practiced dilations of triangles using a scale factor of 2.","zh":"课堂上我们用比例因子 2 练习对三角形做伸缩变换。"},{"en":"Dilations change the size of an object but not its angles.","zh":"伸缩变换会改变物体大小，但不会改变角度。"}]}],"synonyms":["expansions","enlargements","widenings","distensions","scalings"],"phonetic":"/daɪˈleɪʃənz/","extraExplanation":["“dilations”是复数形式，单数是“dilation”。在日常语境里常见于医学（瞳孔扩张、宫颈开指）或科学写作（材料热胀冷缩）。","医学上常说“pupil dilation（瞳孔扩张）”“cervical dilation（宫颈扩张/开指）”；几何里也常用“dilation（伸缩变换）”“scale factor（比例因子）”。"]}
{"word":"dilative","summary":{"en":"Dilative means “causing or tending to cause dilation (widening/expansion),” often used in medical or biological contexts.","zh":"Dilative 指“使扩张的/倾向于扩张的”，常用于医学或生理语境（如瞳孔、血管扩张）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"causing something to dilate (expand or widen), especially in a medical or biological context","zh":"使（某物）扩张、变宽的（尤用于医学或生理语境）"},"examples":[{"en":"The doctor used a dilative eye drop to widen the patient’s pupils.","zh":"医生使用了扩瞳（使瞳孔扩张的）滴眼液来放大病人的瞳孔。"},{"en":"Some medications can have a dilative effect on blood vessels.","zh":"一些药物会对血管产生扩张作用。"}]},{"partOfSpeech":"adj.","definition":{"en":"tending to dilate; having the ability to expand or widen","zh":"倾向于扩张的；具有扩张能力的"},"examples":[{"en":"Warmth can make the skin’s surface blood vessels more dilative.","zh":"温暖会让皮肤表面的血管更容易扩张。"},{"en":"In bright light, the pupil becomes less dilative.","zh":"在强光下，瞳孔不太会扩张。"}]}],"synonyms":["dilating","expanding","widening","vasodilatory"],"phonetic":"/daɪˈleɪtɪv/","extraExplanation":["“dilative”较偏正式、较少见，常出现在医学/生理学写作中。日常英语里更常用“dilating / dilatory / dilation”相关表达：例如“dilating drops（扩瞳滴眼液）”“vasodilation（血管扩张）”。注意别与“dilatory（拖延的）”混淆，二者拼写相近但意思完全不同。"]}
{"word":"dilatometer","summary":{"en":"A dilatometer measures a material’s expansion or contraction under changing conditions, especially temperature.","zh":"dilatometer 指用于测量材料在条件变化（尤其温度变化）下膨胀或收缩量的仪器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An instrument used to measure how much a material changes in size (especially length or volume) when conditions such as temperature or pressure change.","zh":"膨胀计；用于测量材料在温度或压力等条件变化时尺寸（尤其是长度或体积）变化的仪器。"},"examples":[{"en":"Engineers used a dilatometer to measure how the metal rod expanded when heated.","zh":"工程师用膨胀计测量金属棒加热后的伸长量。"},{"en":"In the lab, a dilatometer helps determine the thermal expansion of plastics.","zh":"在实验室里，膨胀计可用于测定塑料的热膨胀。"}]}],"synonyms":["expansion meter","thermal expansion instrument"],"phonetic":"/dəˈleɪtəˌmɪtər/","extraExplanation":["词源提示：dilatometer 来自 dilate（膨胀、扩大）+ -meter（测量仪器）。它常出现在材料科学、工程、地质与化学实验语境中，用来研究“热膨胀系数”等性质。","常见搭配：thermal dilatometer（热膨胀计）、push-rod dilatometer（推杆式膨胀计）、measure thermal expansion（测量热膨胀）。"]}
{"word":"dilatometric","summary":{"en":"Dilatometric means ‘related to measuring changes in a material’s size (especially with temperature).’","zh":"dilatometric 指“与测量材料尺寸变化（尤其随温度变化）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to dilatometry—the measurement of how a material changes in length or volume (often with temperature, pressure, or time).","zh":"与“膨胀测量法/膨胀计法（dilatometry）”有关的；指测量材料长度或体积变化（常随温度、压力或时间变化）的。"},"examples":[{"en":"We ran a dilatometric test to measure the alloy’s thermal expansion.","zh":"我们做了膨胀测量（dilatometric）测试来测定该合金的热膨胀。"},{"en":"The report includes dilatometric data from 25°C to 900°C.","zh":"报告包含从25°C到900°C的膨胀测量（dilatometric）数据。"},{"en":"Dilatometric curves can reveal when a material undergoes a phase change.","zh":"膨胀测量（dilatometric）曲线可以显示材料何时发生相变。"}]}],"synonyms":["dilatometry-related","thermal-expansion (context-dependent)","measurement-based (general)"],"phonetic":"/daɪˌleɪtəˈmɛtrɪk/","extraExplanation":["“dilatometric”常见于材料科学与工程语境，和“dilatometer（膨胀仪/膨胀计）”“dilatometry（膨胀测量法）”同词族。它通常描述测试方法、数据或曲线（如dilatometric analysis/data/curve），尤其用于研究热膨胀、烧结收缩、相变等。"]}
{"word":"dilatometrically","summary":{"en":"Dilatometrically means “by using dilatometry,” i.e., measuring expansion or contraction of a material, often as temperature changes.","zh":"dilatometrically 意为“用膨胀测定法地”，即通过测量材料（常随温度变化）的膨胀或收缩来得到结果。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to dilatometry—the measurement of how a material changes in length or volume (expands or contracts), usually as temperature changes.","zh":"以膨胀测定法（dilatometry）的方式；指与测量材料长度或体积随温度变化而膨胀/收缩有关的方法或角度。"},"examples":[{"en":"The thermal expansion of the alloy was studied dilatometrically over a wide temperature range.","zh":"研究人员用膨胀测定法在很宽的温度范围内研究了该合金的热膨胀。"},{"en":"Dilatometrically measured shrinkage can reveal changes in a polymer during cooling.","zh":"用膨胀测定法测得的收缩量可以揭示聚合物在冷却过程中的变化。"}]}],"synonyms":["by dilatometry","using a dilatometer","via dilatometric measurement"],"phonetic":"/dɪˌlætəˈmɛtrɪkli/","extraExplanation":["“dilatometrically”多见于材料科学、陶瓷、冶金与高分子研究论文中，用来说明数据或结论是“通过膨胀仪（dilatometer）的测量方式”得到的。","词形结构：dilato-（与膨胀相关）+ -metric（测量的）+ -ally（以……方式，构成副词）。实际写作中常与“measure / study / determine / analyze”等动词搭配。"]}
{"word":"dilatometry","summary":{"en":"Dilatometry means measuring how materials expand or contract, especially with changes in temperature.","zh":"dilatometry 指测量材料在温度等条件变化下的膨胀或收缩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the measurement of how a material’s length or volume changes, especially as temperature or pressure changes","zh":"膨胀测量法；测量材料长度或体积（尤其因温度或压力变化而）改变的技术"},"examples":[{"en":"Dilatometry is often used to study thermal expansion in metals and ceramics.","zh":"膨胀测量法常用于研究金属和陶瓷的热膨胀。"},{"en":"The lab performed dilatometry to find the temperature at which the polymer begins to soften.","zh":"实验室用膨胀测量法来找出该聚合物开始软化的温度。"}]}],"synonyms":["thermal expansion measurement","dilatation measurement"],"phonetic":"/dəˌlætˈɑːmətri/","extraExplanation":["词源提示：dilato- 与 “dilate（扩张）” 同源，-metry 表示 “测量”。因此 dilatometry 字面意思就是“扩张的测量”。","相关器材通常叫 dilatometer（膨胀仪），可记录样品随温度变化的尺寸变化曲线，在材料科学、玻璃/陶瓷烧结研究、聚合物热行为分析等领域很常见。"]}
{"word":"dilatometry-related","summary":{"en":"connected to measuring a material’s expansion (often with temperature) using dilatometry.","zh":"指与用膨胀测量法测材料（常随温度）的膨胀有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to dilatometry (the measurement of how a material’s size or volume changes, usually with temperature).","zh":"与膨胀测量法/膨胀仪测量有关的（通常指测量材料尺寸或体积随温度变化）。"},"examples":[{"en":"We corrected the dilatometry-related data for instrument drift.","zh":"我们对与膨胀仪测量有关的数据进行了仪器漂移校正。"},{"en":"Dilatometry-related measurements help estimate a polymer’s thermal expansion.","zh":"与膨胀测量法有关的测量有助于估算聚合物的热膨胀。"}]}],"synonyms":["dilatometric","thermal-expansion-related","expansion-measurement-related"],"phonetic":"/daɪˌlætɑːmətri rɪˈleɪtɪd/","extraExplanation":["“dilatometry”来自“dilate（膨胀）+ -metry（测量）”。在材料科学中常用“dilatometry”或“dilatometric”来描述方法、曲线或结果；“dilatometry-related”更口语/写作上偏说明性，表示“与该测试或数据处理有关”。","常见搭配：dilatometry-related data/results/measurement/error/correction（与膨胀测量相关的数据/结果/测量/误差/校正）。在正式论文里也常写作“dilatometric measurements”或“dilatometry measurements”。"]}
{"word":"dilator","summary":{"en":"A dilator is usually a medical device that widens an opening or passage in the body; it can also mean a muscle that causes widening (like the pupil dilator).","zh":"dilator 通常指用于扩张人体孔口或管道的医疗器械；也可指使某部位变宽的扩张肌（如瞳孔扩张肌）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical instrument or device used to widen (dilate) an opening, passage, or blood vessel in the body","zh":"（医疗）扩张器；用于把人体的孔口、管道或血管“扩张变宽”的器械或装置"},"examples":[{"en":"The doctor used a dilator to gently widen the cervix.","zh":"医生使用扩张器轻柔地扩张宫颈。"},{"en":"Nasal dilators can help some people breathe more easily at night.","zh":"鼻腔扩张器能帮助一些人夜间更顺畅地呼吸。"},{"en":"A balloon dilator is sometimes used during a procedure to open a narrowed vessel.","zh":"在某些操作中，有时会使用球囊扩张器来打开变窄的血管。"}]},{"partOfSpeech":"n.","definition":{"en":"a muscle or body part that opens or widens a passage (for example, a muscle that dilates the pupil)","zh":"（解剖）扩张肌；使某个通道张开或变宽的肌肉或身体部位（如使瞳孔扩大的肌肉）"},"examples":[{"en":"In dim light, the pupil dilator helps the pupil get larger.","zh":"在昏暗光线下，瞳孔扩张肌会帮助瞳孔变大。"},{"en":"Some drugs affect the dilator muscles and change how the eyes respond to light.","zh":"一些药物会影响扩张肌，从而改变眼睛对光线的反应。"}]}],"synonyms":["dilatation device","expander","bougie (medical)","balloon catheter (in some contexts)"],"phonetic":"/daɪˈleɪtər/","extraExplanation":["“dilator”来自动词“dilate”（扩张）。在医学语境里更常指“扩张器（器械）”；在解剖/生理语境里也可指“扩张肌”。","拼写上你也可能见到“dilatator”（较偏专业/较少见）或“dilator”。日常医学英语里“dilator”更常用。"]}
{"word":"dilatorily","summary":{"en":"“Dilatorily” means ‘in a way that delays things.’ It’s a formal word often used to criticize procrastination.","zh":"“dilatorily”意为“以拖延的方式”，是较正式的词，常用来批评拖延、办事不及时。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a slow way that causes delay; procrastinating.","zh":"以拖延的方式；慢吞吞地导致延误；拖拖拉拉地。"},"examples":[{"en":"He responded dilatorily to the emails, so the project fell behind schedule.","zh":"他回邮件拖拖拉拉，结果项目进度落后了。"},{"en":"The request was handled dilatorily, and the customer had to wait for weeks.","zh":"这项请求被拖延处理，客户不得不等了好几个星期。"}]}],"synonyms":["slowly","tardily","belatedly","procrastinatingly","draggingly"],"phonetic":"/ˌdɪləˈtɔrəli/","extraExplanation":["“dilatorily”比较正式、书面，常见于法律或行政语境，带有批评意味（暗示故意拖延或不负责任）。日常口语更常用：slowly, late,拖延地 / 一拖再拖。","词源上与拉丁语“dilatare”（延长、拖延）有关；同词族还有：dilatoriness（拖延作风）, dilatory（拖延的）。"]}
{"word":"dilatoriness","summary":{"en":"Dilatoriness means habitual slowness or delay in taking action; procrastination (formal).","zh":"Dilatoriness 指习惯性拖延或行动迟缓（较正式用语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the habit or quality of being slow to act; procrastination or delay, often when something should be done promptly","zh":"拖延；迟延不决（该做时却行动缓慢的习惯或特质）"},"examples":[{"en":"The project failed because of constant dilatoriness in making decisions.","zh":"这个项目失败是因为在做决定时一直拖拖拉拉。"},{"en":"Her dilatoriness annoyed the team when deadlines were near.","zh":"临近截止日期时，她的拖延让团队很恼火。"}]}],"synonyms":["procrastination","delay","tardiness","slowness","foot-dragging"],"phonetic":"/ˌdɪləˈtɔrɪnəs/","extraExplanation":["“dilatoriness”是较正式、偏书面用语，常见于商务、法律、学术语境，用来批评办事拖沓、效率低下。日常口语更常用“procrastination”（拖延）或“being slow/dragging one’s feet”（磨蹭）。","词源上与拉丁语“dilatare（延迟、推迟）”相关，因此带有“把事情往后推”的含义。常见搭配：dilatoriness in + 名词/动名词（在……方面拖延）；accuse someone of dilatoriness（指责某人拖延）。"]}
{"word":"dilators","summary":{"en":"“Dilators” are medicines or devices that widen an opening or passage in the body.","zh":"“dilators”指使身体开口/通道变宽的药物或器械（扩张剂/扩张器）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A medicine or substance that makes an opening in the body wider (causes dilation), especially in the eyes or blood vessels.","zh":"（药物/物质）使身体的开口或管腔变宽的东西（引起“扩张”），常指散瞳药或血管扩张剂。"},"examples":[{"en":"The doctor used eye dilators to widen her pupils for the exam.","zh":"医生用散瞳药把她的瞳孔放大，以便检查。"},{"en":"Some asthma treatments act as bronchodilators, helping the airways open.","zh":"一些哮喘治疗药物是支气管扩张剂，能帮助气道打开。"}]},{"partOfSpeech":"n.","definition":{"en":"A device used to widen a passage or opening in the body (for example, a surgical dilator).","zh":"（器械）用于扩张身体通道或开口的器械（如手术扩张器）。"},"examples":[{"en":"The clinic sterilizes the dilators after each procedure.","zh":"诊所会在每次操作后对扩张器进行消毒。"},{"en":"The surgeon selected a smaller dilator first and then a larger one.","zh":"外科医生先选了较小的扩张器，然后再换用更大的。"}]}],"synonyms":["dilating agent","vasodilator","bronchodilator","dilator (device)","expander"],"phonetic":"/daɪˈleɪtərz/","extraExplanation":["“dilators”是复数形式，单数是“dilator”。在医学语境里很常见：eye dilator（散瞳药）会让瞳孔变大，可能导致短时间畏光、看近模糊；vasodilator（血管扩张剂）用于让血管放松变宽。","注意拼写：dilator（扩张器/扩张剂）来自动词 dilate（扩张）。不要与“dilator”误写成“dilator’s”等形式。"]}
{"word":"dilatory","summary":{"en":"Dilatory means ‘slow to act’ or ‘meant to delay,’ often with a critical tone.","zh":"Dilatory 指“行动迟缓”或“故意拖延导致延误”，通常带批评意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Slow to act; intended to delay something; causing a delay (often in a negative way).","zh":"拖延的；行动迟缓的；故意拖延以造成延误的（通常带贬义）。"},"examples":[{"en":"The committee used dilatory tactics to delay the vote.","zh":"委员会用拖延策略来推迟投票。"},{"en":"His dilatory response made the customer even more frustrated.","zh":"他拖延的回复让顾客更沮丧。"},{"en":"We can’t afford dilatory decision-making during a crisis.","zh":"在危机期间，我们承受不起拖延式的决策。"}]},{"partOfSpeech":"adj.","definition":{"en":"A legal request or action used to delay a case (less common).","zh":"（法律）用来拖延案件的请求或行动（较少见）。"},"examples":[{"en":"The lawyer filed a dilatory motion to postpone the hearing.","zh":"律师提交了一项拖延动议以推迟听证。"},{"en":"The judge warned against repeated dilatory filings.","zh":"法官警告不要反复提交拖延性文件。"}]}],"synonyms":["slow","delaying","stalling","procrastinating","tardy"],"phonetic":"/ˈdɪləˌtɔri/","extraExplanation":["“dilatory”常用于较正式的语境（新闻、法律、职场写作），语气通常偏批评：暗示拖延是不必要的、甚至是故意的。","词源上与“delay（延迟）”同源，来自拉丁语 *differre*（延缓、推迟）。","常见搭配：dilatory tactics（拖延战术）、dilatory behavior（拖延行为）、dilatory response（拖延的回应）、dilatory motion（拖延动议，法律）。"]}
{"word":"Dilaudid","summary":{"en":"Dilaudid is the brand name of hydromorphone, a strong prescription opioid painkiller.","zh":"Dilaudid 是氢吗啡酮（hydromorphone）的商品名，一种强效处方阿片类止痛药。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand name for hydromorphone, a strong prescription opioid pain medicine used to treat severe pain","zh":"（商品名）氢吗啡酮（hydromorphone），一种强效处方阿片类止痛药，用于治疗严重疼痛"},"examples":[{"en":"After surgery, the doctor prescribed Dilaudid for severe pain.","zh":"手术后，医生开了 Dilaudid 来缓解剧烈疼痛。"},{"en":"Dilaudid can cause drowsiness, so she avoided driving.","zh":"Dilaudid 可能导致嗜睡，所以她避免开车。"},{"en":"The nurse checked his breathing because opioids like Dilaudid can slow respiration.","zh":"护士检查了他的呼吸，因为像 Dilaudid 这样的阿片类药物可能会抑制呼吸。"}]}],"synonyms":["hydromorphone","opioid painkiller","narcotic analgesic"],"phonetic":"/daɪˈlɔːdɪd/","extraExplanation":["Dilaudid 是美国常见的处方止痛药商品名，通用名是 hydromorphone（氢吗啡酮）。在日常英语里，人们有时用商品名直接指代这种药。","它属于阿片类（opioid）镇痛药，具有成瘾与过量风险；英文语境中常与“prescription（处方）”“controlled substance（管制药物）”“overdose（过量）”等词一起出现。","医学或新闻语境中提到 Dilaudid 往往涉及术后镇痛、癌痛等情境；非医疗使用属于滥用，相关表达常见有 “opioid misuse/abuse（阿片滥用）”。"]}
{"word":"dildo","summary":{"en":"A dildo is a penis-shaped sex toy used for sexual stimulation.","zh":"dildo 指仿阴茎形状、用于性刺激的性玩具（假阳具）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sex toy shaped like a penis, used for sexual stimulation (often for vaginal or anal penetration).","zh":"一种仿阴茎形状的性玩具，用于性刺激（常用于阴道或肛门插入）。"},"examples":[{"en":"The store sells a wide range of adult products, including dildos and lubricants.","zh":"那家店出售多种成人用品，包括假阳具和润滑剂。"},{"en":"If you use a dildo, it’s important to clean it properly before and after use.","zh":"如果使用假阳具，使用前后正确清洁很重要。"}]}],"synonyms":["sex toy","adult toy","phallic toy"],"phonetic":"/ˈdɪl.doʊ/","extraExplanation":["这是较为露骨的成人词汇，在正式场合通常不使用；更中性的说法包括 sex toy（性玩具）或 adult toy（成人玩具）。","与 vibrator（震动棒）不同，dildo 不一定带震动功能；两者有时会重叠（带震动的 dildo 也存在）。","健康与安全常识：注意材质（例如医用级硅胶更常被认为更安全）、使用足够的润滑剂、避免共用或需使用安全套、以及按照材质选择合适的清洁方式；肛用尤其建议选择带“底座”的款式以降低风险。"]}
{"word":"dildoe","summary":{"en":"“Dildo” is a penis-shaped sex toy used for sexual pleasure.","zh":"“Dildo”指一种外形类似阴茎、用于性快感的性玩具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sex toy shaped like a penis, used for sexual pleasure, usually for vaginal or anal insertion.","zh":"一种外形类似阴茎的性玩具，用于获得性快感，通常用于阴道或肛门插入。"},"examples":[{"en":"Some shops sell dildos and other adult products.","zh":"一些商店出售假阳具等成人用品。"},{"en":"If you choose to use a dildo, follow hygiene and safety instructions.","zh":"如果你选择使用假阳具，请遵循清洁与安全说明。"}]}],"synonyms":["sex toy","adult toy","vibrator (related, not the same)"],"phonetic":"/ˈdɪl.doʊ/","extraExplanation":["你输入的“dildoe”更常见的拼写是“dildo”。","这是比较直白的成人词汇；在正式或医疗语境中，有时会用更委婉的说法如“sex toy（性玩具）/adult toy（成人用品）”。"]}
{"word":"dildoes","summary":{"en":"“Dildoes” means more than one “dildo,” a sex toy used for sexual stimulation.","zh":"“dildoes”是“dildo”的复数，指用于性刺激的仿真阳具（性玩具）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “dildo”: a sex toy shaped like a penis, used for sexual stimulation.","zh":"“dildo”的复数：一种常见的性玩具，外形类似阴茎，用于性刺激。"},"examples":[{"en":"Some adult stores sell dildoes in different sizes and materials.","zh":"一些成人用品店会出售不同尺寸和材质的仿真阳具。"},{"en":"Many people prefer sex toys that are easy to clean and made of body-safe materials.","zh":"很多人更喜欢容易清洁、材质对身体更安全的性玩具。"}]}],"synonyms":["dildos","sex toys","adult toys"],"phonetic":"ˈdɪl.doʊz","extraExplanation":["在英文里，这个词属于较直白的性相关词汇，日常对话中可能显得粗俗或不适合公开场合；在医疗、性教育或产品介绍等语境中更常见、也更中性。","复数拼写有两种：dildos 和 dildoes；两者都正确，但 dildos 在现代用法中更常见。"]}
{"word":"dildos","summary":{"en":"“Dildos” is the plural of “dildo,” meaning penis-shaped sex toys used for sexual stimulation.","zh":"“Dildos”是“dildo”的复数，指外形类似阴茎、用于性刺激的性玩具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"dildos (plural of dildo): sex toys shaped like a penis, used for sexual stimulation.","zh":"dildos（dildo 的复数）：一种外形类似阴茎的性玩具，用于性刺激。"},"examples":[{"en":"Some adult stores sell dildos in different sizes and materials.","zh":"一些成人用品店会出售不同尺寸和材质的 dildos。"},{"en":"In formal writing, you might say “sex toys” instead of “dildos.”","zh":"在较正式的写作中，你可能会用“sex toys（性玩具）”来代替“dildos”。"}]}],"synonyms":["sex toys","adult toys","artificial penis"],"phonetic":"/ˈdɪl.doʊz/","extraExplanation":["这是比较直白、带露骨意味（vulgar/explicit）的词，在公共场合或不熟悉的人面前使用可能显得冒犯。更中性、礼貌的说法通常是“sex toy(s)”或“adult toy(s)”。","语法上：单数是 dildo，复数一般加 -s 变成 dildos。"]}
{"word":"dilead","summary":{"en":"“Delead” means to remove lead from something to reduce health risks.","zh":"“delead”表示从某物中去除铅，以降低健康风险。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove lead (Pb) from something, especially water, paint, soil, or plumbing materials, to make it safer","zh":"去除（铅 Pb）；尤指从水、油漆、土壤或管道材料中除铅，使其更安全"},"examples":[{"en":"The city hired contractors to delead older homes with peeling paint.","zh":"市政府雇了承包商为油漆剥落的老房子做除铅处理。"},{"en":"They installed a filter to delead the drinking water.","zh":"他们安装了过滤器来去除饮用水中的铅。"}]}],"synonyms":["remove lead","decontaminate","purify"],"phonetic":"/diˈlɛd/","extraExplanation":["你输入的 **dilead** 更常见的拼写是 **delead** 或 **de-lead**，意思是“除铅”。在公共健康语境中很常见（如老房子含铅油漆、老旧水管导致的铅污染）。","相关形容词常见表达是 **lead-free**（无铅的）或 **unleaded**（无铅的，常指汽油）。"]}
{"word":"dilection","summary":{"en":"Dilection means a strong, often lasting preference or fondness for something (formal).","zh":"dilection 指对某事物强烈且较稳定的“偏爱/喜好”，语气较正式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong liking or preference for something; a fondness","zh":"偏爱；喜好；特别喜欢（某事物）"},"examples":[{"en":"She has a dilection for classic novels, especially Jane Austen.","zh":"她偏爱经典小说，尤其是简·奥斯汀的作品。"},{"en":"He showed a dilection for spicy food from an early age.","zh":"他从小就表现出对辣食的偏爱。"},{"en":"The author’s dilection for nature appears throughout her writing.","zh":"这位作者对自然的偏爱贯穿在她的写作中。"}]}],"synonyms":["preference","fondness","liking","partiality","predilection"],"phonetic":"/daɪˈlɛkʃən/","extraExplanation":["“dilection”较正式、略带书面语色彩，日常口语更常用“preference / liking / fondness”。","词源来自拉丁语，核心意思是“喜爱、选择去爱”；因此常用于描述较稳定、较个人化的偏好（而不只是当下的兴趣）。","常见搭配：a dilection for + 名词；show/express a dilection for…（表现出对……的偏爱）。"]}
{"word":"Dilemi","summary":{"en":"A dilemma is a hard choice between options, often with no perfect solution.","zh":"dilemma 指“进退两难的困境”，在多个不完美选项之间做艰难选择。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A difficult situation in which you must choose between two (or more) options, especially when each option has drawbacks.","zh":"（进退两难的）困境；两难选择：必须在两个（或多个）选项中做决定，且每个选项都有不利之处。"},"examples":[{"en":"I’m in a dilemma: I can take the job abroad or stay close to my family.","zh":"我陷入两难：要么去国外工作，要么留在家人身边。"},{"en":"The team faced a dilemma about whether to delay the release to fix bugs.","zh":"团队面临两难：是否推迟发布来修复漏洞。"}]}],"synonyms":["predicament","quandary","bind","tough choice"],"phonetic":"/dɪˈlɛmə/","extraExplanation":["你输入的 “Dilemi” 很可能是 “dilemma” 的拼写错误。正确拼写是 dilemma（中间有双写的 m），发音里常见的拼写陷阱是最后的 “-mma”。","词源来自希腊语：di-（两）+ lemma（前提/论点），原意与“必须在两种前提之间选择”有关，因此强调“两难”。","常见搭配：be in a dilemma（陷入两难）、face a dilemma（面临两难）、pose/present a dilemma（造成两难）。相近表达还有 “a tough choice”（艰难的选择）。"]}
{"word":"dilemi","summary":{"en":"A dilemma is a difficult situation where you must choose between options, often with no perfect choice.","zh":"dilemma 指必须在多个选择中艰难取舍的困境，往往没有完美答案。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A difficult choice between two (or more) options, especially when each option has problems or disadvantages.","zh":"（尤指两难的）困境；进退两难的选择（通常两种或多种选择各有弊端）。"},"examples":[{"en":"I’m in a dilemma: take the better-paid job or stay close to my family.","zh":"我陷入两难：是接受更高薪的工作，还是留在家人身边。"},{"en":"The company faced a dilemma about whether to raise prices or cut costs.","zh":"这家公司面临两难：是涨价还是削减成本。"},{"en":"She had a moral dilemma and didn’t know what the right thing to do was.","zh":"她遇到道德两难，不知道什么才是正确的做法。"}]}],"synonyms":["predicament","quandary","bind","pickle"],"phonetic":"/dɪˈlɛmə/","extraExplanation":["你输入的“dilemi”通常是拼写错误；最常见的正确拼写是 **dilemma**。","**dilemma** 常与这些搭配一起出现：*face a dilemma*（面临两难）、*a moral/ethical dilemma*（道德/伦理两难）、*be in a dilemma*（处于两难境地）。在学习写作时，能用来表达“怎么选都不完美”的处境。"]}
{"word":"Dilemite","summary":{"en":"“Dilemite” is not a standard English word; it’s likely a misspelling (often of “dilemma” or “dynamite”) or a proper name used in a specific context.","zh":"“Dilemite”不是标准英语词；多半是拼写错误（常见是把“dilemma”或“dynamite”写错），也可能是特定语境中的专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a misspelling of “dilemma” (a difficult choice between two options) or “dynamite” (an explosive).","zh":"不是标准英语单词；很可能是把“dilemma”（进退两难的选择/困境）或“dynamite”（炸药）拼错了。"},"examples":[{"en":"I couldn’t find “dilemite” in the dictionary—did you mean “dilemma”?","zh":"我在词典里找不到“dilemite”——你是不是想写“dilemma”？"},{"en":"If you meant “dynamite,” it’s spelled with “yna,” not “ile.”","zh":"如果你想写“dynamite”，拼写是“yna”，不是“ile”。"}]}],"phonetic":"/ˈdɪləmaɪt/","extraExplanation":["“dilemma”读起来可能让人误写，因为中间有两个 m：di-LEM-ma。意思是“两难/进退两难的处境”。","如果你是在某个游戏、品牌、用户名、作品标题里看到“Dilemite”，它也可能是专有名词（自造词或名称），这种情况下含义要看具体语境。把原句/截图发来我可以帮你判断。"]}
{"word":"dilemite","summary":{"en":"“dilemite” is not a standard English word; it most likely refers to “dolomite,” a mineral/rock, and also a soil amendment used to reduce acidity and add calcium/magnesium.","zh":"“dilemite”不是标准英语词；很可能是“dolomite”（白云石/白云岩），也可指用于改良土壤、降低酸性并补钙补镁的材料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely intended) dolomite: a common rock-forming mineral (calcium magnesium carbonate) and the sedimentary rock made mostly of that mineral.","zh":"（多半是想写）dolomite：一种常见的造岩矿物（碳酸钙镁），也指主要由该矿物组成的沉积岩（白云岩）。"},"examples":[{"en":"This region has cliffs made of dolomite.","zh":"这个地区有由白云岩形成的悬崖。"},{"en":"Dolomite can form when limestone is chemically changed over time.","zh":"石灰岩在长期化学作用下可能转变为白云岩。"}]},{"partOfSpeech":"n.","definition":{"en":"In gardening and farming, dolomite (dolomitic lime) is used to reduce soil acidity and add calcium and magnesium.","zh":"在园艺和农业中，dolomite（白云石灰/白云石粉）可用来降低土壤酸性，并补充钙和镁。"},"examples":[{"en":"We added dolomite to raise the soil pH.","zh":"我们加了白云石粉来提高土壤的 pH 值。"},{"en":"Dolomite lime helps provide magnesium for plants.","zh":"白云石灰有助于为植物补充镁。"}]}],"synonyms":["dolomitic limestone","dolostone","dolomitic lime"],"phonetic":"/ˈdɑːləˌmaɪt/","extraExplanation":["“dilemite”在英语里并不是常见标准词。你可能想写的是“dolomite”（白云石/白云岩）。如果你指的是其他词（比如“dilemma”“dynamite”“dilettante”等），告诉我上下文句子，我可以帮你精准判断。"]}
{"word":"dilemma","summary":{"en":"A dilemma is a difficult situation where you must choose between options, and none feels clearly good.","zh":"dilemma 指“进退两难”的处境：必须做选择，但每个选项都不理想或有代价。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A situation where you must choose between two (or more) options, especially when each choice is difficult or has unpleasant results.","zh":"（两难）必须在两个（或更多）选项之间做选择的处境，尤指每个选择都很困难或都会带来不好的结果。"},"examples":[{"en":"She faced a dilemma: tell the truth and hurt him, or stay silent and feel guilty.","zh":"她面临两难：说实话会伤害他，不说又会感到内疚。"},{"en":"The company is in a dilemma about whether to cut costs or invest in new technology.","zh":"公司在是否削减成本还是投资新技术之间陷入两难。"}]}],"synonyms":["predicament","quandary","bind"],"phonetic":"/dɪˈlɛmə/","extraExplanation":["“dilemma”常见搭配：be in a dilemma（处于两难境地）、face a dilemma（面临两难）、pose/create a dilemma（造成两难）。","词源上“di-”有“二”的意思，最初强调“两个选择”；现代英语里也可用于多种艰难选择，不一定严格只有两个。","易混点：dilemma 指“难以选择的处境”；problem 更泛指“问题”；choice 只是“选择”本身，未必困难。"]}
{"word":"dilemma-filled","summary":{"en":"“Dilemma-filled” describes something full of tough, no-perfect-choice situations.","zh":"“dilemma-filled”形容某事充满两难与棘手抉择，没有完美选项。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Full of difficult choices or situations in which each option has drawbacks.","zh":"充满两难选择的；处处是进退维谷的处境（每个选择都有缺点）。"},"examples":[{"en":"The report is a dilemma-filled overview of climate policy.","zh":"这份报告对气候政策做了一个充满两难的概述。"},{"en":"She had a dilemma-filled week, balancing work, family, and health.","zh":"她度过了一个充满两难的一周，要在工作、家庭和健康之间权衡。"},{"en":"It’s a dilemma-filled decision: spend now or save for later.","zh":"这是个充满两难的决定：现在花还是以后存。"}]}],"synonyms":["dilemma-ridden","fraught","full of dilemmas","conflicted","thorny"],"phonetic":"/dɪˈlɛmə fɪld/","extraExplanation":["“dilemma-filled”是由名词“dilemma（两难困境）”+ 形容词“filled（充满……的）”构成的复合形容词，常用连字符表示它们共同修饰后面的名词。","多用于书面语、新闻评论或分析类写作，强调“问题很多、每一步都难选”的感觉，比单说“difficult”更突出“左右为难/两边都不完美”。","不加连字符也可能看到（dilemma filled），但作定语放在名词前时通常用连字符更清晰：a dilemma-filled situation。放在系动词后可不必连字符：The situation is dilemma filled（较少见），更自然的说法是：The situation is full of dilemmas / dilemma-ridden。"]}
{"word":"dilemmas","summary":{"en":"“Dilemmas” is the plural of “dilemma,” meaning difficult choices between two (or more) options, often with negative consequences.","zh":"“dilemmas”是“dilemma”的复数，指在两个（或多个）都不理想的选择之间作决定的两难处境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a situation in which you must choose between two difficult options, especially when both have disadvantages","zh":"（两难）必须在两个艰难选择之间做决定的处境，尤其是两边都有缺点"},"examples":[{"en":"She faced a dilemma: accept the job abroad or stay near her family.","zh":"她面临两难：接受海外工作，还是留在家人身边。"},{"en":"It’s a moral dilemma—telling the truth may hurt someone, but lying feels wrong.","zh":"这是个道德两难——说实话可能伤人，但撒谎又让人觉得不对。"}]},{"partOfSpeech":"other","definition":{"en":"the plural form of “dilemma”","zh":"“dilemma”的复数形式"},"examples":[{"en":"As a manager, he deals with dilemmas every day.","zh":"作为经理，他每天都要处理各种两难局面。"}]}],"synonyms":["predicaments","quandaries","hard choices"],"phonetic":"/dɪˈlɛməz/","extraExplanation":["“dilemma”常搭配：face a dilemma（面临两难）、pose a dilemma（造成两难）、a moral/ethical dilemma（道德/伦理两难）、a classic dilemma（典型两难）。","严格意义上，dilemma 原指“两种选择都不理想”的局面；日常英语里也常被用来泛指“棘手问题/尴尬处境”。","与相近词区别：problem 更泛；predicament 强调“困境/窘境”；quandary 偏书面，强调“犹豫不决的两难”。"]}
{"word":"dilemmatic","summary":{"en":"Dilemmatic means “involving a dilemma; requiring a hard choice with no easy answer.”","zh":"dilemmatic 意为“涉及两难困境的；需要做出没有简单答案的艰难选择的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Involving or creating a dilemma (a difficult choice between two or more options, often with no perfect solution).","zh":"涉及两难处境的；造成两难选择的（指在两个或多个选项间难以取舍，往往没有完美答案）。"},"examples":[{"en":"It was a dilemmatic decision: either cut costs or risk layoffs.","zh":"这是个两难的决定：要么削减成本，要么面临裁员风险。"},{"en":"The story follows a dilemmatic hero who must choose between duty and family.","zh":"故事讲的是一位身处两难的英雄，必须在责任与家庭之间作出选择。"}]}],"synonyms":["dilemmatic","dilemma-filled","problematic","thorny","tricky","no-win"],"phonetic":"/ˌdaɪləˈmætɪk/","extraExplanation":["“dilemmatic”比较少见，更常用的是“dilemmatic situation/choice”（两难的处境/选择）或直接用“difficult / tricky / no-win”来表达。","词源上来自“dilemma（两难困境）+ -atic（……性质的）”。“dilemma”的核心含义并不只是“困难”，而是“选项之间都有代价/损失”，因此常用于道德、政策、人际关系等情境。"]}
{"word":"dilemmatical","summary":{"en":"“Dilemmatical” means ‘related to a dilemma’ or ‘involving a difficult choice between two options.’ It’s rare in modern English.","zh":"“dilemmatical”意为“与两难处境有关的、进退两难的”。现代英语中较少见。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"involving a dilemma; related to a situation where you must choose between two difficult options","zh":"两难的；与进退两难的处境有关的（必须在两个都不理想的选择中作决定）"},"examples":[{"en":"The committee faced a dilemmatical decision: cut the budget or cancel the program.","zh":"委员会面临一个两难的决定：削减预算还是取消项目。"},{"en":"Her dilemmatical feelings made it hard to answer right away.","zh":"她那种两难的心情让她很难立刻回答。"}]}],"synonyms":["dilemmatic","problematic","difficult","thorny","tricky"],"phonetic":"/ˌdɪləˈmætɪkəl/","extraExplanation":["“dilemmatical”在现代英语里比较少见，很多场合更常用的是“dilemmatic”或直接说“a dilemma / a difficult choice（两难/艰难选择）”。写作中如果想更自然，可以用：“a dilemmatic situation”或“a difficult dilemma”。","词源上来自“dilemma（两难）”，加上形容词后缀“-ical”，表示“与……有关的”。但因为不常用，正式写作时建议优先选择更常见的替代表达，以避免显得生硬或让读者觉得奇怪。"]}
{"word":"dilemmatically","summary":{"en":"“Dilemmatically” means “in a way that shows you are in a dilemma and must choose between difficult options.”","zh":"“dilemmatically”表示“以两难的方式/在进退两难的情况下”，强调必须在艰难选项间做选择。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that involves a difficult choice between two (or more) options; in a dilemma-driven manner.","zh":"以两难（或多难）处境的方式；在必须做出艰难选择的情况下。"},"examples":[{"en":"The committee spoke dilemmatically about whether to cut costs or keep staff.","zh":"委员会以两难的口吻谈到：是削减成本还是保留员工。"},{"en":"She laughed dilemmatically, unsure whether to stay silent or tell the truth.","zh":"她带着两难的笑，拿不准是保持沉默还是说出真相。"}]}],"synonyms":["hesitantly","uncertainly","ambivalently","conflictedly","with mixed feelings"],"phonetic":"/ˌdɪləˈmætɪkli/","extraExplanation":["“dilemmatically”由名词 dilemma（两难处境）衍生而来，在真实语境中相对少见，更常用的表达是：in a dilemma、with mixed feelings、torn between A and B、hesitantly。写作中使用它会显得较正式或刻意。"]}
{"word":"dilemmic","summary":{"en":"“Dilemmic” means “involving a dilemma” or “full of hard choices.”","zh":"“dilemmic”表示“涉及两难的；充满艰难抉择的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"involving a dilemma; characterized by difficult choices between two (or more) options","zh":"涉及两难处境的；以艰难抉择为特征的（常指在两种或多种选择之间难以取舍）"},"examples":[{"en":"The committee faced a dilemmic decision: protect privacy or improve public safety.","zh":"委员会面临一个两难的决定：保护隐私还是提升公共安全。"},{"en":"Her dilemmic situation made it hard to satisfy both her family and her career goals.","zh":"她的两难处境让她很难同时满足家庭与事业目标。"}]}],"synonyms":["dilemmatic","problematic","thorny","difficult","complex"],"phonetic":"/daɪˈlɛmɪk/","extraExplanation":["“dilemmic”是一个较少见的形容词，意思接近更常用的“dilemmatic”或“dilemmasome（不常见）”。日常写作与口语里，更自然的表达通常是“a dilemma”或“a difficult choice / a tough call”。","词源上来自“dilemma（两难）”，常用于较正式或学术语境来描述“具有两难性质的”问题或情境。"]}
{"word":"diletant","summary":{"en":"A dilettante is someone who is interested in a subject (often art) but not seriously trained; it can also describe a superficial, non-serious approach.","zh":"dilettante 指对某领域（常见为艺术）有兴趣但缺乏系统训练的人；也可形容做事/学习流于表面、不够认真。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who shows interest in an art, subject, or activity but has not studied it seriously; often used to suggest a lack of real skill or commitment","zh":"对艺术、学科或活动感兴趣但缺乏系统学习的人；常带有“浅尝辄止、并不专业”的含义"},"examples":[{"en":"He talks about wine like an expert, but he’s really just a dilettante.","zh":"他谈论葡萄酒时像个专家，但其实只是个外行爱好者。"},{"en":"The museum wanted serious researchers, not dilettantes.","zh":"博物馆需要的是认真的研究者，而不是浅尝辄止的业余者。"}]},{"partOfSpeech":"adj.","definition":{"en":"showing superficial interest or knowledge; not deeply serious or professional","zh":"（兴趣或知识）浅表的；不够认真或不够专业的"},"examples":[{"en":"She grew tired of his dilettante approach to learning languages.","zh":"她对他学习语言那种三分钟热度、浅尝辄止的方式感到厌倦。"},{"en":"The project failed because of dilettante planning.","zh":"项目失败是因为规划太业余、太不严谨。"}]}],"synonyms":["amateur","dabbler","nonprofessional","layperson"],"phonetic":"/ˌdɪləˈtɑnt/","extraExplanation":["你输入的“diletant”常见于对 **dilettante** 的拼写简化或拼写错误；标准英语拼写是 **dilettante**。","这个词往往带一点负面评价：不仅是“业余”，更强调“缺乏深入投入/专业性”。不过在较中性语境里，也可以指“涉猎广泛的业余爱好者”。","词源来自意大利语 *dilettare*（“使愉悦”），最初更接近“出于兴趣与享受而从事艺术的人”，后来英语里逐渐带上“浅薄/不够专业”的语气。"]}
{"word":"dilettanist","summary":{"en":"A dilettanist is someone who pursues a subject mainly as a hobby, without serious expertise (often with a slightly critical tone).","zh":"dilettanist 指“出于兴趣而涉猎某领域的业余者”，常暗含“不够专业、研究不深”的语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who takes up an art, subject, or activity as a hobby—showing interest but not deep training or serious commitment (often slightly negative)","zh":"业余爱好者；浅尝辄止的人（常带轻微贬义，指有兴趣但缺乏深入训练或认真投入）"},"examples":[{"en":"He’s a dilettanist in photography—he enjoys it, but he hasn’t studied lighting or composition seriously.","zh":"他在摄影方面算个业余爱好者——喜欢是喜欢，但并没有认真学习用光或构图。"},{"en":"The museum wanted experts, not dilettanists who only knew a few famous names.","zh":"博物馆需要的是专家，而不是只知道几个名人名字的半吊子。"}]}],"synonyms":["dilettante","amateur","dabbler","hobbyist","nonexpert"],"phonetic":"/ˌdɪləˈtɑnt/","extraExplanation":["“dilettanist”在现代英语中较少见，更常见的拼写是 **dilettante**（/ˌdɪləˈtɑnt/）。两者意思相近，都可指“涉猎广但不够专业的人”。词源来自意大利语 *dilettare*（“取乐、喜爱”），因此本意偏“出于兴趣而做”，后来常引申出“缺乏深度/不够专业”的评价。使用时要注意语气：在正式场合可能带有轻微讽刺或批评。"]}
{"word":"dilettant","summary":{"en":"A dilettante is someone who dabbles in a subject or art without deep knowledge or serious commitment, often in a critical sense.","zh":"dilettante 指对某领域只是浅尝辄止、缺乏深入研究或认真投入的人，常带批评意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is interested in an art, subject, or activity but lacks deep knowledge or serious commitment (often used critically)","zh":"（常带贬义）涉猎者；浅尝辄止的人；对某领域有兴趣但缺乏深入知识或认真投入的人"},"examples":[{"en":"He’s a political dilettante who reads headlines but avoids serious study.","zh":"他是个政治涉猎者，只看标题，却不做严肃研究。"},{"en":"The museum wanted trained historians, not dilettantes.","zh":"博物馆需要受过训练的历史学家，而不是业余浅尝者。"}]},{"partOfSpeech":"adj.","definition":{"en":"showing shallow, unserious interest; not professional or deeply informed","zh":"（兴趣/态度）浅薄的；不够认真专业的；缺乏深入了解的"},"examples":[{"en":"His dilettante approach to learning piano didn’t help him improve.","zh":"他学钢琴的态度很“玩票”，所以进步不大。"},{"en":"The article was criticized for its dilettante treatment of the topic.","zh":"这篇文章因对该话题的浅表处理而受到批评。"}]}],"synonyms":["dabbler","amateur","hobbyist","enthusiast"],"phonetic":"/ˌdɪləˈtɑːnt/","extraExplanation":["该词来自意大利语 dilettante，原意接近“欣赏艺术的人/爱好者”。在英语里常带批评色彩，强调“兴趣有余、钻研不足”。如果想表达中性或褒义的“业余爱好者”，常用 hobbyist、enthusiast、amateur（amateur 有时也会被用作贬义，语气需看语境）。"]}
{"word":"dilettante","summary":{"en":"A dilettante is a pleasure-seeking amateur with only a shallow, non-serious interest; it can also describe something superficial.","zh":"dilettante 指“浅尝辄止的业余爱好者”，常暗示不够认真或不够专业；也可形容“肤浅的、缺乏深入投入的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who is interested in an art, subject, or activity mainly for pleasure, not as a serious or professional expert.","zh":"浅尝辄止的爱好者；业余（而不够专业/不够认真）的人。"},"examples":[{"en":"He’s a dilettante who collects paintings but doesn’t study art history seriously.","zh":"他是个浅尝辄止的收藏爱好者，收画但并不认真研究艺术史。"},{"en":"The club welcomes beginners, not dilettantes who only show up when it’s trendy.","zh":"这个俱乐部欢迎初学者，但不欢迎只在流行时才出现的“跟风式”爱好者。"}]},{"partOfSpeech":"adj.","definition":{"en":"Done or characterized by a superficial interest; not showing deep knowledge or commitment.","zh":"（兴趣或行为）肤浅的；缺乏深入投入与专业度的。"},"examples":[{"en":"Her dilettante approach to learning languages meant she quit after a few lessons.","zh":"她学语言的态度很“浅尝辄止”，上了几节课就放弃了。"},{"en":"The article felt dilettante—lots of opinions, few facts.","zh":"这篇文章给人感觉很肤浅——观点很多，事实很少。"}]}],"synonyms":["amateur","dabbler","nonprofessional","layperson"],"phonetic":"/ˌdɪləˈtɑːnt/","extraExplanation":["“dilettante”来自意大利语 dilettare（“使人愉快”）。因此它常带有“为了好玩而涉猎”的意味，语气有时偏贬义：暗示不够认真或不够专业。不过在一些场合也可能较中性，表示“业余爱好者”。","常见搭配：a dilettante in music/art（音乐/艺术方面的业余爱好者）；a dilettante interest（浅层兴趣）；a dilettante approach（不够深入的方法）。","易混词：amateur 常指“非职业的”，可以很认真、水平也可能很高；dilettante 更强调“浅尝辄止/不够投入”。"]}
{"word":"dilettanteish","summary":{"en":"Dilettanteish means amateurish or superficial, like a casual hobbyist rather than a serious expert.","zh":"dilettanteish 指“像浅尝辄止的业余爱好者一样”，不够专业、较表面。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person, style, or work) showing the qualities of a dilettante—interested in something in a casual way, without serious study or professional skill; amateurish or superficial.","zh":"（指人、风格或作品）带有“浅尝辄止的业余爱好者”气质；不够专业、流于表面，略显业余。"},"examples":[{"en":"His knowledge of art history is charming but a bit dilettanteish.","zh":"他对艺术史的了解很讨喜，但有点浅尝辄止、略显业余。"},{"en":"The report felt dilettanteish—lots of opinions, not many facts.","zh":"这份报告给人的感觉很“业余”：观点很多，但事实不够。"}]}],"synonyms":["amateurish","superficial","unprofessional","dabbling","half-baked"],"phonetic":"/ˌdɪləˈtæntiʃ/","extraExplanation":["“dilettanteish”= dilettante（浅尝辄止的业余爱好者）+ -ish（带有……的特点）。语气常带轻微批评：并非完全否定能力，而是强调不够深入、缺少系统训练或严谨性。","dilettante 源自意大利语，和“取乐/喜爱”有关；因此这个词常暗示“因兴趣而涉猎”，但可能停留在表面。"]}
{"word":"dilettanteism","summary":{"en":"Dilettanteism means a casual, non-serious interest in a subject, often implying shallow knowledge rather than expertise.","zh":"dilettanteism 指对某领域抱有随意、非严肃的兴趣，常暗示知识不够深入、缺乏专业性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A way of thinking or behaving like a dilettante: showing interest in art, literature, science, etc. in a casual, non-serious way, often without deep knowledge or skill.","zh":"“半吊子式/业余爱好者式”的态度或行为：对艺术、文学、科学等抱有兴趣但较随意、不够认真，常缺乏深入知识或专业能力。"},"examples":[{"en":"Her writing sounded polished, but some critics dismissed it as dilettanteism because it lacked careful research.","zh":"她的文字看起来很精致，但一些评论家认为这只是“业余式炫技”，因为缺少严谨的研究。"},{"en":"He moved from hobby to hobby, and his friends joked about his dilettanteism.","zh":"他兴趣换得很快，朋友们开玩笑说他很有“半吊子气质”。"}]}],"synonyms":["dilettantism","amateurism","dabbling","superficiality"],"phonetic":"/ˌdɪlɪˈtɑːnˌtɪzəm/","extraExplanation":["“dilettanteism”更常见的拼写是“dilettantism”，含义相同；两者都来自意大利语“dilettante”，本义与“delight（愉悦）”相关，强调“出于兴趣/享受而参与”，但在英语里常带有“浅尝辄止、不够专业”的贬义色彩。使用时要注意语气。"]}
{"word":"dilettantes","summary":{"en":"Dilettantes are people who pursue a subject (especially the arts) casually, often without deep knowledge or serious commitment.","zh":"dilettantes 指对某领域（尤指艺术）只浅尝辄止的人，常含“不够专业或不够认真”的意思。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who is interested in art, music, literature, or another field but studies or practices it only in a casual, not serious way (often implying a lack of deep skill or commitment).","zh":"对艺术、音乐、文学等领域有兴趣但只浅尝辄止、缺乏深入钻研的人；业余爱好者（常带贬义，暗示不够专业或不够投入）。"},"examples":[{"en":"He collects modern art, but critics call him a dilettante because he rarely studies the artists’ work in depth.","zh":"他收藏现代艺术，但评论家称他是个“半吊子”，因为他很少深入研究艺术家的作品。"},{"en":"She doesn’t want to be a dilettante—she practices the piano every day.","zh":"她不想当个浅尝辄止的业余者——她每天都练钢琴。"},{"en":"The club welcomes beginners, not just experts, so don’t worry if you feel like a dilettante at first.","zh":"这个社团欢迎初学者，不只欢迎专家，所以即使一开始觉得自己不够专业也别担心。"}]}],"synonyms":["amateur","dabble","nonprofessional","dabbler"],"phonetic":"/ˌdɪləˈtɑːnt/","extraExplanation":["“dilettante”来自意大利语，原意与“欣赏、喜爱（delight）”相关，最初偏中性，指“出于兴趣从事艺术的人”。后来在英语里常带轻微贬义：强调“只懂皮毛、不够认真”。","复数形式是 dilettantes（你输入的就是复数），单数是 dilettante。","语气对比：amateur（业余爱好者）可以是中性甚至正面；dilettante更容易暗示“装懂/不深入”。"]}
{"word":"dilettanteship","summary":{"en":"Dilettanteship means a casual, non-serious involvement in an art or subject, often implying shallow knowledge or commitment.","zh":"dilettanteship 指对艺术或学科的随意、非严肃的参与，常暗示了解不深或投入不足。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or habit of being a dilettante: doing an art, subject, or activity mainly for pleasure and without serious commitment or deep knowledge","zh":"业余爱好者作风；浅尝辄止的参与：以兴趣或消遣为主，从事艺术/学科/活动但缺乏长期投入或深入了解"},"examples":[{"en":"His dilettanteship in photography was fun, but he never learned lighting or composition well.","zh":"他把摄影当作业余消遣很开心，但从未真正学好用光或构图。"},{"en":"The museum wanted scholars, not dilettanteship, to guide the research.","zh":"博物馆希望由学者来推进研究，而不是业余式、浅尝辄止的做法。"}]}],"synonyms":["dabbling","amateurism","superficiality"],"phonetic":"/ˌdɪlɪˈtæn(t)ʃɪp/","extraExplanation":["“dilettante”来自意大利语，原意与“喜爱/取乐”有关，因此“dilettanteship”常带有“只图兴趣、不够专业”的语气；在正式语境里有时略带批评，但也可中性地指“非职业参与”。","与“hobby”不同，“dilettanteship”更强调“缺乏深入学习或持续投入”；如果你想表达中性的“业余爱好”，更常用“hobby”或“amateur interest”。"]}
{"word":"dilettanti","summary":{"en":"Dilettanti are people who engage in an art or activity as amateurs, often implying they are not very serious or skilled.","zh":"dilettanti 指从事某项活动的业余者，常暗含“不够认真或不够专业”的意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who do an activity (especially art, music, or writing) only for pleasure, not as trained professionals; often used with a slightly negative meaning (not serious or not skilled)","zh":"（尤指艺术、音乐、写作等方面）业余爱好者；（常带轻微贬义）半吊子、浅尝辄止的人"},"examples":[{"en":"The gallery wanted serious collectors, not dilettanti who bought art just to seem fashionable.","zh":"画廊想要真正的收藏家，而不是那些只为显得时髦才买艺术品的“半吊子”爱好者。"},{"en":"In the early days, the club was full of dilettanti, but a few members later became professionals.","zh":"起初俱乐部里多是业余爱好者，但后来有几位成员成了专业人士。"}]}],"synonyms":["amateurs","hobbyists","dabblers","enthusiasts"],"phonetic":"/ˌdɪləˈtɑːnti/","extraExplanation":["“dilettanti”是“dilettante”的复数形式，来自意大利语，字面与“以愉悦为目的”有关。英语里常用来暗示某人对某领域只停留在表面、缺乏系统训练或投入。","语域提示：在正式评论（如艺术评论、学术评论）中更常见；日常口语里更常说“amateurs”或“hobbyists”。如果想避免贬义，用“enthusiasts / hobbyists”更中性。"]}
{"word":"dilettantish","summary":{"en":"Dilettantish describes someone or something amateur and superficial rather than serious or expert.","zh":"dilettantish 用来形容“业余且浅显”的做法或态度，强调不够认真或不够专业。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Showing a shallow or amateur interest in a subject; not serious or professional.","zh":"（对某事）浅尝辄止的；业余爱好的；不够专业或不够认真地投入的。"},"examples":[{"en":"His dilettantish approach to learning guitar meant he never practiced regularly.","zh":"他学吉他的方式很“浅尝辄止”，从不规律练习。"},{"en":"The article gives a dilettantish overview and misses the key facts.","zh":"这篇文章只是业余式的概览，遗漏了关键事实。"},{"en":"She didn’t want to seem dilettantish, so she took a proper course in art history.","zh":"她不想显得不够专业，所以去系统修了艺术史课程。"}]}],"synonyms":["amateurish","superficial","dabbling","nonprofessional","uninformed"],"phonetic":"/ˌdɪləˈtɑːntɪʃ/","extraExplanation":["“dilettantish”来自名词“dilettante”（业余爱好者），常带一点批评意味：不是单纯“爱好”，而是暗示投入不够、理解不深。","语气提示：说别人“dilettantish”可能显得不礼貌；更中性的表达可以用“casual”“amateur”“nonprofessional”。在自我描述时也可用来谦逊地表示“我只是随便玩玩/略懂”。"]}
{"word":"dilettantism","summary":{"en":"Dilettantism means amateur or superficial involvement in an area, especially the arts, often implying a lack of seriousness or depth.","zh":"dilettantism 指对某领域（尤指艺术）的业余或浅薄涉猎，常暗示不够认真、缺乏深度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Often disapproving) an interest in art, music, literature, etc. that is done as a hobby rather than as serious study or professional work.","zh":"（常含贬义）对艺术、音乐、文学等的业余爱好式参与；把它当作消遣而非认真学习或专业从事。"},"examples":[{"en":"His painting started as dilettantism, but over time he trained seriously and improved.","zh":"他的绘画起初只是业余消遣式的兴趣，但随着时间推移他开始认真训练并进步了。"},{"en":"The museum talk criticized the era’s dilettantism toward classical music.","zh":"那场博物馆讲座批评了那个时代对古典音乐的浅尝辄止式追捧。"}]},{"partOfSpeech":"n.","definition":{"en":"superficial knowledge or involvement in a subject; dabbling without depth.","zh":"对某领域的浅薄了解或浅尝辄止的参与；只会“涉猎”而缺乏深入。"},"examples":[{"en":"Her comments showed dilettantism rather than real expertise in economics.","zh":"她的评论显示出对经济学只是浅尝辄止，而非真正的专业能力。"},{"en":"Dilettantism can sound confident, but it often falls apart under detailed questions.","zh":"浅薄涉猎有时听起来很自信，但在细节追问下常常站不住脚。"}]}],"synonyms":["dabbling","amateurism","superficiality","smattering"],"phonetic":"/ˌdɪlɪˈtæntɪzəm/","extraExplanation":["“dilettantism”来自意大利语 dilettante（原意是“喜爱、欣赏的人”），最初可较中性地指“艺术爱好者”。在英语里逐渐带上批评意味，常用来指不够认真、缺乏深度的涉猎。","语气提示：用于批评时较尖锐；若想更中性，可用 “amateur interest / casual interest / hobbyist involvement”等表达。"]}
{"word":"dilettantist","summary":{"en":"A dilettantist is someone who engages in an art or subject casually for pleasure, often implying a lack of seriousness or depth.","zh":"dilettantist 指对艺术或学问只是出于兴趣浅尝辄止的人，常含“不够认真、不够深入”的贬义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who takes up an art, subject, or activity for pleasure and casual interest rather than in a serious or professional way.","zh":"（对艺术/学问/活动）浅尝辄止的业余爱好者；半吊子（多含贬义：不够认真或不够专业）。"},"examples":[{"en":"He’s a dilettantist who studies painting on weekends but never practices consistently.","zh":"他是个浅尝辄止的业余爱好者，周末学画画，但从不持续练习。"},{"en":"The critic dismissed the book as dilettantist work, saying it lacked depth and research.","zh":"评论家把这本书斥为“业余拼凑之作”，说它缺乏深度和研究。"},{"en":"She didn’t want to be seen as a dilettantist, so she trained seriously and found a mentor.","zh":"她不想被看作半吊子，于是认真训练并找了一位导师。"}]}],"synonyms":["dilettante","amateur","hobbyist","nonprofessional","dabbler"],"phonetic":"/ˌdɪlɪˈtɑntɪst/","extraExplanation":["这个词常带评价色彩：不仅是“业余”，还暗示“浮于表面、不够深入”。如果只是中性表达“业余爱好者”，更常用 hobbyist / amateur（amateur有时也可带轻微贬义）。","词源相关：dilettantist 来自意大利语 dilettante，源于拉丁语 delectare（使人愉悦）。最初偏中性，指“出于兴趣而欣赏/学习艺术的人”，现代英语里更常用来批评不专业或不严肃。","常见搭配：a dilettantist interest（浅层兴趣）, dilettantist approach（不够严谨的方法）。相关词：dilettante（更常见的同义词）。"]}
{"word":"dilettantship","summary":{"en":"Dilettantship means amateur, often superficial involvement in a field (sometimes with a negative tone).","zh":"Dilettantship 指在某领域以业余、常带浅尝辄止意味的方式参与（有时略带贬义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or practice of being a dilettante; amateur involvement in an art, subject, or activity (often without deep skill or serious commitment)","zh":"“业余爱好者”的状态或做法；以业余、浅尝辄止的方式参与艺术、学科或活动（常暗含不够专业或不够认真）"},"examples":[{"en":"She enjoys painting, but she calls it dilettantship rather than a career.","zh":"她喜欢画画，但她把这当作业余爱好，而不是职业。"},{"en":"The museum criticized his dilettantship in art history because he rarely checked primary sources.","zh":"博物馆批评他在艺术史上的“浅尝式参与”，因为他很少查阅一手资料。"},{"en":"Some people mistake curiosity for dilettantship, even when a learner is working hard.","zh":"有些人会把好奇心误当成“浅尝辄止”，即使学习者其实很努力。"}]}],"synonyms":["dilettantism","amateurism","dabbling","superficiality"],"phonetic":"/ˌdɪləˈtɑːntˌʃɪp/","extraExplanation":["“dilettantship”来自“dilettante”（业余爱好者、半吊子），在英语里常带一点负面评价：强调“懂一点点、但不深入”。如果想表达更中性或更正面的“业余但认真”，可以用“amateur interest”“hobby”“enthusiast”之类。","在正式写作中，“dilettantship”不算高频词，更常见的是“dilettantism”。两者意思接近，后者更常用。"]}
{"word":"Diley","summary":{"en":"“Diley” is usually a rare name, or a misspelling of “daily.”","zh":"“Diley”通常是少见的人名/姓氏，或是把 “daily（每天的/每日地）” 拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare surname or given name (proper noun). It doesn’t have a widely agreed dictionary meaning in everyday English.","zh":"一个较少见的姓氏或名字（专有名词）。在日常英语中没有通用的词典释义。"},"examples":[{"en":"Ms. Diley will lead the meeting today.","zh":"Diley 女士今天将主持会议。"},{"en":"I saw the name Diley on the guest list.","zh":"我在宾客名单上看到了 Diley 这个名字。"}]},{"partOfSpeech":"other","definition":{"en":"Often a misspelling of “daily” (happening every day; every day).","zh":"常见为 “daily”（每天的；每日地）的拼写错误。"},"examples":[{"en":"I go for a daily walk after dinner.","zh":"我晚饭后每天散步。"},{"en":"Please send me daily updates.","zh":"请每天给我发更新。"}]}],"synonyms":["daily (if that’s what you meant)"],"phonetic":"/ˈdaɪli/","extraExplanation":["“Diley”在英语里不算常见词。如果你是在作文、邮件或聊天中想表达“每天/每日”，通常应该写作 **daily**。","如果这是人名（比如姓或名），一般不需要“翻译”，只需按原拼写使用；读音可能因个人/家族习惯不同而变化。"]}
{"word":"Dili","summary":{"en":"Dili is the capital city of Timor-Leste (East Timor).","zh":"Dili（帝力）是东帝汶的首都。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The capital and largest city of Timor-Leste (East Timor), located on the north coast of the island of Timor.","zh":"东帝汶（Timor-Leste / East Timor）的首都和最大城市，位于帝汶岛北海岸。"},"examples":[{"en":"Dili is the capital of Timor-Leste.","zh":"帝力是东帝汶的首都。"},{"en":"She flew to Dili for a conference on regional development.","zh":"她飞去帝力参加一个关于区域发展的会议。"},{"en":"From Dili, you can visit nearby beaches and mountain areas.","zh":"从帝力出发，你可以去附近的海滩和山区。"}]}],"phonetic":"/ˈdiːli/","extraExplanation":["“Dili”是葡萄牙语拼写传统下的地名形式。东帝汶曾长期受葡萄牙殖民影响，因此官方语言之一是葡萄牙语，地名与人名中也常见葡语拼写。","在英文里它是专有名词，通常不加冠词：说“in Dili / to Dili”，不说“the Dili”。"]}
{"word":"diligence","summary":{"en":"Diligence means consistent, careful hard work and responsible attention to doing things well.","zh":"diligence 指持续、认真负责的勤奋努力，也可指做事严谨细致。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"steady, careful effort over time; hard work that is done consistently and responsibly.","zh":"勤奋；勤勉；长期稳定、认真负责的努力。"},"examples":[{"en":"Her diligence at work earned her a promotion.","zh":"她在工作上的勤奋让她获得了升职。"},{"en":"With diligence, you can improve your English a little every day.","zh":"只要坚持勤奋练习，你每天都能把英语进步一点点。"},{"en":"The project succeeded because of the team’s diligence and attention to detail.","zh":"这个项目成功是因为团队的勤勉和对细节的关注。"}]},{"partOfSpeech":"n.","definition":{"en":"careful attention and thoroughness, especially when checking facts or doing a task correctly.","zh":"细致审慎；一丝不苟（尤其指核对信息或把事情做对）。"},"examples":[{"en":"The researcher showed diligence in verifying every source.","zh":"这位研究者在核实每个来源时表现得非常严谨。"},{"en":"Please review the report with diligence before you submit it.","zh":"提交前请认真细致地审阅这份报告。"}]}],"synonyms":["hard work","perseverance","industry","carefulness","thoroughness"],"phonetic":"/ˈdɪlɪdʒəns/","extraExplanation":["“Diligence”常带有“长期坚持、踏实做事”的正面评价，比单纯的“hard work”更强调稳定、可靠和细致。","常见搭配：with diligence（勤勉地）、diligence in (doing) sth.（在……方面很严谨/用功）、due diligence（尽职调查，商业/法律语境中指认真核查风险与信息）。"]}
{"word":"diligence and frugality in household management","summary":{"en":"Hard work and careful, waste-avoiding home management.","zh":"勤劳节俭、精心持家。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"The habit or principle of working hard and managing a family’s daily life carefully, especially by avoiding waste and spending wisely.","zh":"指做事勤快、持家有道，尤其强调节约不浪费、精打细算地管理家庭生活。"},"examples":[{"en":"My grandparents believed in diligence and frugality in household management, so they rarely wasted food or money.","zh":"我祖父母信奉勤俭持家，所以很少浪费食物或金钱。"},{"en":"Diligence and frugality in household management helped the family get through difficult years.","zh":"勤俭持家帮助这个家庭度过了困难时期。"},{"en":"She was praised for her diligence and frugality in household management, keeping the home running smoothly on a tight budget.","zh":"她因勤俭持家而受到称赞，即使预算紧张也把家里打理得井井有条。"}]}],"synonyms":["thrift","careful budgeting","household economy","living within one’s means","careful money management","thrifty housekeeping"],"phonetic":"/ˈdɪlɪdʒəns ænd fruːˈɡæləti ɪn ˈhaʊsˌhoʊld ˈmænɪdʒmənt/","extraExplanation":["在英语里，这类说法多用于较正式的写作或价值观讨论；日常口语也常说：run a tight ship at home（把家里管得很严谨）、be careful with money（花钱很谨慎）、live within one’s means（量入为出）。","注意它强调的是“家庭层面的管理与习惯”，不仅是省钱，还包括有计划地做家务、避免浪费、把资源用在刀刃上。"],"etymology":"这是一个意义明确的英文表达，由三个常见词组合而成：diligence（勤勉）+ frugality（节俭）+ household management（家庭管理/持家）。在中文语境中常对应“勤俭持家”，用于强调家庭层面的勤劳与节约。","mnemonic":["把它直接记成中文四字：勤（diligence）+俭（frugality）+持家（household management）。","frugal 听起来像“富够了”（富够了就更要节俭守住），帮助记住 frugality=节俭。"]}
{"word":"diligences","summary":{"en":"“Diligences” usually means the plural of “diligence”: careful, persistent effort; rarely, it refers to historical stagecoaches.","zh":"“diligences”通常是“diligence（勤勉、用功）”的复数；少见情况下指历史上的长途驿车/公共马车。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"careful and persistent effort (the plural form can mean repeated acts or different kinds of careful effort).","zh":"勤奋；勤勉；一丝不苟的努力（复数可指多次的勤勉行为或不同方面的尽心尽力）。"},"examples":[{"en":"Her diligences in studying every day helped her improve quickly.","zh":"她每天学习的勤勉让她进步很快。"},{"en":"The team’s diligences in checking the data prevented a serious mistake.","zh":"团队在核对数据上的细致认真避免了一个严重错误。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, historical) stagecoaches; public carriages used for long-distance travel (plural of \"diligence\").","zh":"（罕见，历史用法）公共马车；长途驿车（“diligence”的复数）。"},"examples":[{"en":"In the 1800s, travelers rode diligences between towns.","zh":"在19世纪，旅行者会乘坐驿车在城镇之间往来。"}]}],"synonyms":["hard work","carefulness","thoroughness","perseverance","industry"],"phonetic":"/ˈdɪlədʒəns/","extraExplanation":["“diligences”最常见是名词“diligence（勤勉、用功）”的复数，但在现代英语里更自然的表达通常是用不可数形式：We appreciate your diligence. 复数多出现在强调“多方面/多次的努力”或较正式的文体中。","历史义项“diligence=驿车/公共马车”来自法语，现代英语中很少使用，更多见于历史写作或文学描写。"]}
{"word":"diligency","summary":{"en":"“Diligency” is uncommon; the standard word is “diligence,” meaning steady hard work or careful, responsible attention (especially in business/legal contexts: “due diligence”).","zh":"“diligency”较少见且常被视为不规范；标准用法是“diligence”，表示勤奋不懈的努力，或（尤其在商业/法律中）审慎尽责的审查（如 due diligence）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common form: “diligence”) careful, steady effort and hard work over time; the habit of doing your work thoroughly and responsibly.","zh":"（常用形式：diligence）勤勉；勤奋；做事认真负责、持续努力的品质。"},"examples":[{"en":"Her diligence helped her improve her English every day.","zh":"她的勤奋让她每天都能提升英语。"},{"en":"With diligence and patience, you can master new vocabulary.","zh":"只要勤奋并有耐心，你就能掌握新词汇。"},{"en":"The teacher praised his diligence in completing assignments on time.","zh":"老师表扬他按时完成作业的认真与勤奋。"}]},{"partOfSpeech":"n.","definition":{"en":"careful attention and effort to avoid mistakes or problems, especially in work, business, or research.","zh":"（尤指工作、商业或研究中的）尽职尽责；审慎细致；为避免错误而投入的认真努力。"},"examples":[{"en":"Please review the contract with due diligence before you sign it.","zh":"签字前请对合同进行充分的审慎审查。"},{"en":"The lab checks data with great diligence to prevent errors.","zh":"实验室非常仔细地核对数据以防出错。"}]}],"synonyms":["diligence","hard work","industry","perseverance","carefulness","thoroughness"],"phonetic":"/ˈdɪlɪdʒəns/","extraExplanation":["“diligency”在现代英语里很少用，很多情况下被认为是不标准或过时的形式；更自然、最常见的名词是“diligence”。","常见搭配：with diligence（勤奋地/认真地）；diligence in (doing) sth（在……方面很勤勉）；due diligence（尽职调查/审慎审查，常用于商业和法律语境）。"]}
{"word":"diligent","summary":{"en":"“Diligent” means hardworking, careful, and consistent over time.","zh":"“diligent”指勤奋、认真、长期坚持不懈地努力。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Working hard and carefully over a long period; showing steady effort and attention to detail.","zh":"勤奋的；用功的；长期坚持努力并且做事认真细致的。"},"examples":[{"en":"She is a diligent student who reviews her notes every night.","zh":"她是个勤奋的学生，每晚都会复习笔记。"},{"en":"With diligent practice, his English improved quickly.","zh":"通过勤奋练习，他的英语进步很快。"},{"en":"The team made a diligent effort to finish the project on time.","zh":"团队付出了坚持不懈的努力，按时完成了项目。"}]}],"synonyms":["hardworking","industrious","studious","conscientious"],"phonetic":"/ˈdɪlədʒənt/","extraExplanation":["“diligent”常用来夸一个人“踏实、持续、认真”，语气偏正式，多用于学习、工作、研究等场景；不像“hardworking”那么口语，也比“busy”更强调“有效且细致的努力”。","常见搭配：diligent student/worker；diligent effort；diligent in (doing) something（在某方面很勤奋/很用功）。"]}
{"word":"diligent in duties and careful in speech","summary":{"en":"hardworking and responsible, with cautious speaking","zh":"勤勉尽责，言语谨慎"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Hardworking and responsible in one’s tasks, and cautious about what one says.","zh":"做事勤勉尽责，说话谨慎小心。"},"examples":[{"en":"She is diligent in duties and careful in speech, so people trust her with important work.","zh":"她做事勤勉尽责、说话谨慎小心，所以大家愿意把重要工作交给她。"},{"en":"A good leader should be diligent in duties and careful in speech, especially during a crisis.","zh":"一位好领导在危机时更应勤勉尽责、谨言慎行。"},{"en":"He learned to be diligent in duties and careful in speech after making a few careless comments.","zh":"经历了几次不经意的失言后，他学会了做事勤勉尽责、说话谨慎。"}]}],"synonyms":["conscientious","hardworking","dutiful","responsible","discreet","circumspect","measured in speech","mindful of one’s words"],"phonetic":"/ˈdɪlədʒənt ɪn ˈduːtiz ænd ˈkɛrfəl ɪn spiːtʃ/","extraExplanation":["常用于评价一个人的职业素养或处事风格，语气偏正式、正面。","“careful in speech”强调说话前会考虑后果：避免夸大、泄密、伤人或引发误解；在职场、公开场合尤其常见。"],"etymology":"这是一个描述品格的英语固定搭配：diligent 源自拉丁语（表示“勤勉、用功”）；careful 源自 care（“关心、在意”）。整体意思相当于中文的“勤勉尽责、谨言慎行”。","mnemonic":["把它当成四字格来记：diligent in duties = “勤于职守”；careful in speech = “谨言慎行”。","联想“duties（职责）要用力做，speech（言语）要慢一点说”。"]}
{"word":"diligentia","summary":{"en":"Diligentia is a Latin word meaning diligence or careful, responsible effort, seen mainly in mottos or formal contexts.","zh":"Diligentia 是拉丁语，意为“勤勉/尽责的谨慎努力”，多见于格言或较正式语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Latin; occasionally used in English in mottos or legal-style writing) diligence; careful, steady attention and effort; carefulness in carrying out a duty.","zh":"（拉丁语；偶见于英语格言或法律文体）勤勉；尽责的细心与持续努力；履行义务时的谨慎与周到。"},"examples":[{"en":"The seal includes the Latin word “diligentia,” praising careful work and responsibility.","zh":"印章上写着拉丁词“diligentia”，用来赞扬做事认真、负责任。"},{"en":"In older legal wording, “diligentia” can refer to the care someone must take in performing a duty.","zh":"在较旧的法律措辞中，“diligentia”可指一个人在履行义务时必须尽到的注意与谨慎。"}]}],"synonyms":["diligence","care","attention","conscientiousness"],"phonetic":"/dɪˌlɪdʒɛnˈtiːə/","extraExplanation":["“diligentia”是拉丁语名词，来自形容词“diligens”（认真、勤勉的）。在现代英语里更常用对应词“diligence”（勤勉；尽职尽责）。","你可能会在校训、座右铭、徽章、或带拉丁语色彩的法律/学术文本中看到它；日常英语表达通常不会直接用“diligentia”。"]}
{"word":"diligently","summary":{"en":"“Diligently” means doing something with careful, consistent effort and attention to detail.","zh":"“diligently”表示做事勤勉认真、持续用力，并且注重细节。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that shows careful, steady effort and attention to detail; hard-working and thorough.","zh":"勤勉地；用心且持续努力地；认真细致地。"},"examples":[{"en":"She studied diligently for the final exam every night.","zh":"她每天晚上都在为期末考试认真用功地学习。"},{"en":"The team worked diligently to fix the bug before the launch.","zh":"团队勤勉地工作，在上线前修复了这个漏洞。"},{"en":"He diligently saved money to buy his first car.","zh":"他勤勉地存钱，想买人生第一辆车。"}]}],"synonyms":["carefully","steadily","assiduously","conscientiously","thoroughly"],"phonetic":"/ˈdɪlədʒəntli/","extraExplanation":["词源上与拉丁语词根有关，核心含义是“珍爱、认真对待”，因此 *diligently* 不只是“努力”，还强调“细心、坚持、讲究质量”。","常见搭配：*work diligently*（勤奋工作）、*study diligently*（刻苦学习）、*diligently pursue*（执着追求）。语气比 *hard* 更偏“踏实+细致”。"]}
{"word":"diligentness","summary":{"en":"Diligentness means steady, careful hard work and attention over time. It is correct but less common than “diligence.”","zh":"diligentness 指长期稳定、认真细致的勤奋品质。该词正确但不如 diligence 常用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of working hard and carefully over a long period of time; steady effort and attention","zh":"勤勉；勤奋；（长期）努力且认真细致的品质"},"examples":[{"en":"Her diligentness helped her improve her English little by little.","zh":"她的勤奋让她的英语一点一点变得更好。"},{"en":"The project succeeded because of the team’s diligentness and good planning.","zh":"这个项目成功是因为团队的勤勉和良好的规划。"},{"en":"Teachers often praise students for their diligentness in completing homework on time.","zh":"老师常常表扬学生按时完成作业的勤奋态度。"}]}],"synonyms":["diligence","industry","perseverance","hard work","carefulness"],"phonetic":"/ˈdɪlɪdʒəntnəs/","extraExplanation":["“diligentness”语法上正确，但在现代英语里不如“diligence”常见，更自然的说法通常是：diligence / hard work / careful effort。","构词理解：diligent（勤奋的）+ -ness（名词后缀，表示“……的状态/性质”）。比如 kindness（善良）、darkness（黑暗）。","语体与场景：在正式写作中更常用“diligence”（e.g., due diligence 尽职调查；with diligence 勤勉地）。口语里多用“hard-working”或“works really hard”。"]}
{"word":"diligere","summary":{"en":"*Diligere* is a Latin verb meaning “to love/esteem” (respectfully) and sometimes “to choose carefully.”","zh":"*diligere* 是拉丁语动词，常指“珍视/敬重地爱”，有时也指“谨慎挑选”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Latin, transitive verb) to love, value, or esteem someone or something (often with a sense of respect rather than passion).","zh":"（拉丁语及物动词）爱、珍视、敬重某人或某物（常带有尊重、欣赏的意味，而非强烈激情）。"},"examples":[{"en":"In Latin texts, *diligere* often describes a steady, respectful kind of love.","zh":"在拉丁语文本中，*diligere* 常用来表示一种稳定、带尊重的“爱”。"},{"en":"Cicero uses *diligere* to express esteem for a friend’s character.","zh":"西塞罗会用 *diligere* 来表达对朋友品格的敬重与欣赏。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Latin, transitive verb) to choose or single out with care; to take delight in something through careful appreciation (less common).","zh":"（拉丁语及物动词）谨慎挑选、细选；因细致品味而喜爱（较少见）。"},"examples":[{"en":"Some authors use *diligere* in the sense of choosing carefully rather than simply liking.","zh":"一些作者会用 *diligere* 表示“细心选择”，而不只是“喜欢”。"}]}],"synonyms":["love","esteem","value","cherish","prize"],"phonetic":"/dɪˈlɪdʒəˌreɪ/","extraExplanation":["*diligere* 是拉丁语动词，由 *dis-*（分开、分别）+ *legere*（挑选、读取）组合而来，原始感觉接近“把事物分辨开来、仔细挑出来”，因此延伸出“慎重选择”以及“经过认识与欣赏后的珍爱/敬重”。","它与拉丁语 *amare*（更偏热烈、情感强的“爱”）常被对比：*diligere* 更像“欣赏、重视、敬爱”。这也是英语 *diligent*（勤勉的）与“认真细致”的语感关联之一。"]}
{"word":"dilis","summary":{"en":"“Delis” means more than one deli (delicatessen), a shop selling prepared foods.","zh":"“delis”是“deli（熟食店/熟食柜台）”的复数，指多家熟食店或多个熟食柜台。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “deli” (a delicatessen): a small store or counter that sells prepared foods like sandwiches, salads, and sliced meats and cheeses.","zh":"“deli”的复数（熟食店/熟食柜台）：出售三明治、沙拉、切片冷肉和奶酪等即食食品的小店或柜台。"},"examples":[{"en":"There are several good delis near the train station.","zh":"火车站附近有好几家不错的熟食店。"},{"en":"We grabbed sandwiches from a deli for lunch.","zh":"我们从熟食店买了三明治当午饭。"}]}],"synonyms":["delicatessens"],"phonetic":"/ˈdɛli/","extraExplanation":["“dilis”本身在英语里不常见；很多情况下人们想写的是“delis”（deli 的复数）。","另外，“dilis”在他加禄语/菲律宾菜语境里常指“小银鱼/鳀鱼（anchovies）”，你可能会在菲律宾菜单上见到。"]}
{"word":"Dilisio","summary":{"en":"“Dilisio” is typically used as a surname or proper name, not a standard English word with a dictionary meaning.","zh":"“Dilisio”通常是姓氏或专名使用，不是一个有固定词义的常见英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name (surname). It is not a standard English vocabulary word, so it usually refers to a person, family name, brand, or place name.","zh":"专有名词（姓氏）。它不是标准英语词汇，通常指某个人/家族的姓氏、品牌名或地名。"},"examples":[{"en":"Ms. Dilisio will lead the meeting today.","zh":"Dilisio 女士今天将主持会议。"},{"en":"I saw the name Dilisio on the sign outside the office.","zh":"我在办公室外的牌子上看到了 Dilisio 这个名字。"}]}],"phonetic":"/dɪˈliːzioʊ/","extraExplanation":["“Dilisio”在英语里更常见的用法是作为姓氏/专名，而不是像普通词汇那样有固定词义。如果你本来想查的是发音相近的单词，常见的可能是：\n- delicious（美味的）\n- deliciously（美味地；令人愉快地）\n你也可以告诉我你看到“Dilisio”的句子或上下文，我可以帮你判断它具体指什么。"]}
{"word":"dilker","summary":{"en":"“Dilker” is usually a family name (proper noun), not a common English dictionary word.","zh":"“Dilker”通常是姓氏（专有名词），不是常见的英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a surname (family name); not a common standard English vocabulary word","zh":"姓氏（家族名）；不是常见的标准英语词汇"},"examples":[{"en":"Ms. Dilker will lead the meeting today.","zh":"Dilker 女士今天将主持会议。"},{"en":"I saw the name Dilker on the list of authors.","zh":"我在作者名单上看到了 Dilker 这个名字。"}]}],"phonetic":"/ˈdɪlkər/","extraExplanation":["“Dilker”在英语里通常作为专有名词（姓氏）出现，而不是词典里常见的普通词。不同家庭/地区的读法可能略有差异；上面的音标给的是较常见的英语化读法。","如果你是在课文、字幕或聊天中看到“dilker”，也可能是拼写误差。你可以告诉我它出现的句子/语境，我可以帮你判断是否原本想写的是别的词（例如人名、地名或品牌名）。"]}
{"word":"Dilks","summary":{"en":"“Dilks” is most commonly a surname (family name).","zh":"“Dilks”最常见的用法是英文姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname).","zh":"（常见作）姓氏。"},"examples":[{"en":"Ms. Dilks will lead today’s meeting.","zh":"Dilks 女士将主持今天的会议。"},{"en":"I saw the name Dilks on the attendance list.","zh":"我在出勤名单上看到了 Dilks 这个名字。"}]},{"partOfSpeech":"n.","definition":{"en":"the plural form of a very rare word “dilk” (dialect/obsolete); meaning is not common in modern English and may be unclear without context.","zh":"“dilk”的复数形式（非常罕见、方言或已过时）；在现代英语中几乎不用，脱离语境可能难以确定含义。"},"examples":[{"en":"This old record contains several unfamiliar words, including dilks.","zh":"这份旧记录里有一些不常见的词，包括 dilks。"}]}],"synonyms":["(surname) none direct"],"phonetic":"/dɪlks/","extraExplanation":["“Dilks”在现实使用中最常见的是英文姓氏（比如人名、公司名、地名或作品中的角色名）。在阅读或听到它时，优先把它当作专有名词来理解。","如果你是在某段文本里看到“dilks”且不像人名，请提供上下文句子；它可能来自地方方言、家族名、品牌名，或是拼写/转写差异。"]}
{"word":"dill","summary":{"en":"Dill is an aromatic herb used to flavor foods, especially pickles.","zh":"dill 指“莳萝”，一种常用于调味的香草，尤其常见于腌黄瓜等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A fragrant herb whose leaves or seeds are used to flavor food, especially pickles, fish, soups, and salads.","zh":"莳萝（一种有香味的香草植物）；其叶或种子常用来给食物调味，尤其常见于腌黄瓜、鱼类、汤和沙拉。"},"examples":[{"en":"She added fresh dill to the potato salad.","zh":"她在土豆沙拉里加了新鲜的莳萝。"},{"en":"Dill is a classic flavor in dill pickles.","zh":"莳萝是“莳萝酸黄瓜”里的经典风味。"}]}],"synonyms":["herb","seasoning"],"phonetic":"/dɪl/","extraExplanation":["在美式饮食文化里，dill 最常让人想到 dill pickles（莳萝酸黄瓜/莳萝腌黄瓜）。超市里常见的“pickle”如果标着“dill”，通常表示用莳萝调味、口味偏咸酸、香气更草本；与“sweet pickles（甜酸黄瓜）”形成对比。","dill 既可以指“叶子（dill weed）”，也可以指“种子（dill seed）”。叶子更清新、适合出锅前加入；种子味道更浓、更耐煮，常用于腌制或炖煮。"]}
{"word":"dill-flavored","summary":{"en":"Dill-flavored means something tastes or smells like dill.","zh":"dill-flavored 指“有莳萝味/闻起来像莳萝”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the taste or aroma of dill (a herb with a fresh, slightly sweet, grassy flavor).","zh":"有莳萝风味的；带有莳萝（香草）气味或味道的。"},"examples":[{"en":"I bought dill-flavored potato chips to try something new.","zh":"我买了莳萝味薯片，想尝试点新口味。"},{"en":"The dill-flavored sauce goes well with fish and cucumbers.","zh":"这种莳萝风味的酱很适合搭配鱼和黄瓜。"}]}],"synonyms":["dill-scented","dill-seasoned","dill-infused"],"phonetic":"/ˈdɪl ˌfleɪvərd/","extraExplanation":["“dill”在英语饮食文化里很常见，尤其在腌制食品和北欧/东欧/美国部分菜系中。你可能在“dill pickles”（莳萝酸黄瓜）里最常见地遇到它。","“dill-flavored”是由名词“dill”+ “-flavored（有……味的）”构成的复合形容词，常用于食品包装或菜单描述：例如“garlic-flavored, lemon-flavored”。"]}
{"word":"dill-seasoned","summary":{"en":"Seasoned with dill; having dill flavor.","zh":"用莳萝调味的；带莳萝风味的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Flavored or seasoned with dill (an herb with a fresh, slightly tangy, “pickle-like” taste).","zh":"用莳萝（dill）调味的；带有莳萝风味的。"},"examples":[{"en":"I ordered the dill-seasoned salmon with lemon.","zh":"我点了柠檬莳萝调味的三文鱼。"},{"en":"These dill-seasoned potato chips taste like pickles.","zh":"这些莳萝调味的薯片吃起来像腌黄瓜。"},{"en":"Try a dill-seasoned yogurt sauce for grilled chicken.","zh":"烤鸡可以试试莳萝调味的酸奶酱。"}]}],"synonyms":["dill-flavored","dill-infused","seasoned with dill"],"phonetic":"/ˈdɪl ˌsiːzənd/","extraExplanation":["“dill-seasoned”常见于菜单、包装或食谱里，说明食物的主要香草风味来自莳萝。莳萝在美式与东欧料理中很常见，尤其常用于腌黄瓜（dill pickles）、鱼类（如三文鱼）、土豆、酸奶/奶油酱等。","写作上它是由“dill + seasoned”构成的复合形容词，通常加连字符用于修饰名词（如 dill-seasoned butter）。不加连字符时也能见到（dill seasoned），但连字符更清晰。"]}
{"word":"Dillard","summary":{"en":"Dillard is usually a surname, and it can also be the name of specific institutions or brands (e.g., Dillard University, Dillard’s).","zh":"Dillard 通常是英语姓氏，也可指特定机构或品牌名称（如迪拉德大学、迪拉德百货）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname) of English use; it refers to a person with the last name Dillard.","zh":"（姓氏）Dillard，英语中常见的姓，指姓为 Dillard 的人。"},"examples":[{"en":"Ms. Dillard will lead today’s meeting.","zh":"Dillard 女士将主持今天的会议。"},{"en":"I met Dr. Dillard at the conference.","zh":"我在会议上见到了 Dillard 博士。"}]},{"partOfSpeech":"n.","definition":{"en":"a proper name used for certain organizations or places, such as Dillard University or the department-store chain Dillard’s.","zh":"（专有名）用于一些机构或地点的名称，例如 Dillard University（迪拉德大学）或百货连锁 Dillard’s（迪拉德百货）。"},"examples":[{"en":"She studied at Dillard University in New Orleans.","zh":"她在新奥尔良的迪拉德大学就读。"},{"en":"They bought it at Dillard’s.","zh":"他们是在迪拉德百货买的。"}]}],"phonetic":"/ˈdɪlərd/","extraExplanation":["在英语里，像 Dillard 这种以大写开头的词通常是“专有名词”（人名、地名、机构名）。写作时要大写；读音一般重音在第一音节：DIL-lard。","文学语境中，你可能会见到美国作家 Annie Dillard（安妮·迪拉德）；她的散文作品常被英语课程引用。"]}
{"word":"Dille","summary":{"en":"“Dille” is usually a name in English; in food contexts it’s often a misspelling of “dill,” the herb.","zh":"“Dille”在英语里通常是人名；在饮食语境中常是把“dill（莳萝）”误写成“Dille”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Proper noun) A surname or given name. It does not have a common dictionary meaning in everyday English and is usually used as a name (e.g., a family name).","zh":"（专有名词）姓氏或名字。“Dille”在日常英语中通常不作为普通词使用，多见于人名（如姓氏）。"},"examples":[{"en":"Ms. Dille will lead the meeting today.","zh":"Dille 女士今天将主持会议。"},{"en":"I met a student named Dille at the conference.","zh":"我在会议上认识了一位名叫 Dille 的学生。"}]},{"partOfSpeech":"other","definition":{"en":"Often seen as a misspelling of “dill,” an herb with feathery leaves used in cooking, especially with pickles, fish, and soups.","zh":"常见为 “dill（莳萝）” 的拼写误写：一种叶子细羽状的香草，常用于腌黄瓜、鱼类和汤等料理。"},"examples":[{"en":"This recipe needs fresh dill (sometimes misspelled as “dille”).","zh":"这道菜需要新鲜的莳萝（有时会被误拼为“dille”）。"},{"en":"Add a little dill to the yogurt sauce.","zh":"在酸奶酱里加一点莳萝。"}]}],"synonyms":["(name) —","(for dill) fennel (not the same herb)","(for dill) herb"],"phonetic":"/dɪl/","extraExplanation":["“Dille”如果出现在菜单、食谱或香料标签附近，通常就是把“dill（莳萝）”拼错了；正确拼写是 dill。","如果你是在某个具体句子/标题里看到“Dille”，也可能是人名或地名。你可以把原句发来，我可以帮你判断它到底是哪一种用法。"]}
{"word":"dilled","summary":{"en":"“Dilled” usually means food seasoned with dill.","zh":"“dilled”通常指食物“用莳萝调味的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Flavored or seasoned with dill (the herb), often used to describe foods.","zh":"用莳萝（香草）调味的；带莳萝风味的（常用于描述食物）。"},"examples":[{"en":"She served dilled cucumbers as a refreshing side dish.","zh":"她端上了莳萝黄瓜作为清爽的配菜。"},{"en":"I like dilled salmon with lemon and black pepper.","zh":"我喜欢加柠檬和黑胡椒的莳萝三文鱼。"},{"en":"The soup tasted lightly dilled, not overpowering.","zh":"这汤只有淡淡的莳萝味，不会太浓。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “dill” (rare): to flavor with dill.","zh":"“dill”的过去式/过去分词（较少见）：用莳萝调味。"},"examples":[{"en":"The cook dilled the potatoes before serving them.","zh":"厨师上菜前用莳萝给土豆调了味。"}]}],"synonyms":["dill-flavored","seasoned with dill","dill-seasoned"],"phonetic":"/dɪld/","extraExplanation":["“dill”指一种常见香草：莳萝，味道清新，常与酸味（如醋、酸奶油、柠檬）搭配，常见于腌黄瓜（dill pickles）、鱼类、土豆、沙拉酱等。英语菜单里看到“dilled + 食物”，通常就是“用莳萝调味的”。"]}
{"word":"Dillenia","summary":{"en":"Dillenia is a botanical genus name for certain tropical flowering trees and shrubs.","zh":"Dillenia 是一个植物学属名，指一类热带开花乔木或灌木。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical and subtropical flowering plants (trees and shrubs) known for large, showy flowers; also used as a botanical name in species such as the elephant apple","zh":"（植物学）杜英莲属：热带与亚热带的开花植物属（乔木或灌木），以花朵大而醒目著称；也常作为物种学名的一部分，如“象苹果”等"},"examples":[{"en":"Dillenia is a genus found mainly in South and Southeast Asia.","zh":"杜英莲属主要分布在南亚和东南亚。"},{"en":"The elephant apple comes from a Dillenia species and is used in some regional dishes.","zh":"“象苹果”来自杜英莲属的某些物种，在一些地区菜肴中会用到。"},{"en":"In the herbarium, the specimen was labeled Dillenia sp. (species unknown).","zh":"在标本馆里，这份植物标本被标注为 Dillenia sp.（具体物种未确定）。"}]}],"synonyms":["genus Dillenia"],"phonetic":"/dɪˈliːniə/","extraExplanation":["“Dillenia”是拉丁化的学名，常见于植物学与园艺语境；在日常英语里不算常用词。","该属名纪念德国植物学家 Johann Jakob Dillenius（狄伦纽斯）。","写作中常见格式：属名首字母大写并斜体（*Dillenia*）；不确定物种时可写 *Dillenia* sp.。"]}
{"word":"dillenia","summary":{"en":"Dillenia is a genus of tropical flowering trees and shrubs, known for large flowers and sometimes edible sour fruit.","zh":"Dillenia 指金莲木属的热带开花植物（乔木/灌木），以大花著称，部分种类的酸味果实可食用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a tropical plant in the genus Dillenia (family Dilleniaceae), including trees and shrubs with large flowers; some species are grown as ornamentals or used in traditional food/medicine in parts of Asia.","zh":"金莲木属（Dillenia）植物；热带地区的乔木或灌木，常开大花；部分种类可作观赏植物，或在亚洲一些地区用于传统食用/药用。"},"examples":[{"en":"Dillenia indica is sometimes planted for its large, showy flowers.","zh":"金莲木属的印度金莲木（Dillenia indica）有时会因花大而艳丽被栽种观赏。"},{"en":"In some regions, people cook the sour fruit of a dillenia species in curries or soups.","zh":"在一些地区，人们会把某些金莲木属植物的酸味果实用来煮咖喱或汤。"}]}],"synonyms":["Dillenia (genus name)"],"phonetic":"/dɪˈliːniə/","extraExplanation":["“Dillenia”是植物学上的拉丁学名（属名），常见于科普文章、植物百科和园艺语境中；日常英语里更常说具体物种名（如 D. indica）或用更泛的说法如 “tree/shrub”。","该属名据说是为了纪念18世纪德国植物学家 Johann Jacob Dillenius（迪伦纽斯），因此拼写和人名相关。"]}
{"word":"Dilleniaceae","summary":{"en":"Dilleniaceae is a botanical family (the dillenia family) of tropical and subtropical flowering plants, best known for the genus Dillenia.","zh":"Dilleniaceae 指五桠果科：主要分布于热带与亚热带的开花植物科，以五桠果属（Dillenia）最为人熟知。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of tropical and subtropical flowering plants (the dillenia family), including trees, shrubs, and lianas, found mainly in Asia and Australasia; the best-known genus is Dillenia.","zh":"（植物）五桠果科：一类分布于热带与亚热带地区的被子植物科，包含乔木、灌木与藤本，主要见于亚洲与澳大拉西亚；较知名的属为五桠果属（Dillenia）。"},"examples":[{"en":"Dilleniaceae is most diverse in tropical Asia.","zh":"五桠果科在热带亚洲的多样性最高。"},{"en":"The specimen was identified as a member of the Dilleniaceae family.","zh":"该标本被鉴定为五桠果科的成员。"},{"en":"Some Dilleniaceae species have large, showy flowers.","zh":"部分五桠果科物种开大型且显眼的花。"}]}],"synonyms":["dillenia family"],"phonetic":"/ˌdɪləˌniˈeɪsiˌi/","extraExplanation":["这是一个“科名”（plant family name），常见于植物分类学、植物志（flora）、自然纪录片或学术文章中；日常英语里较少出现。","词形来源：Dilleniaceae 来自属名 Dillenia（五桠果属）+ 科名常见后缀 -aceae（表示“……科”）。读法通常以“dill-EN-ee-AY-see-ee”这类节奏出现。","在现代分类系统（如 APG 系统）里，植物“科”的范围与归属可能会随研究更新而调整；阅读旧资料时，科的界定可能略有差异。"]}
{"word":"dilleniaceae","summary":{"en":"Dilleniaceae is a botanical term meaning the dillenia family: a family of flowering plants mostly in tropical and subtropical areas.","zh":"Dilleniaceae 是植物学术语，指五桠果科：主要分布在热带和亚热带的一科开花植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of flowering plants (the dillenia family), mainly found in tropical and subtropical regions, including the genus Dillenia and related plants","zh":"五桠果科（植物学）：一类被子植物科，主要分布在热带和亚热带地区，包括五桠果属（Dillenia）及其相关植物"},"examples":[{"en":"Dilleniaceae are most diverse in tropical Asia and Australia.","zh":"五桠果科在热带亚洲和澳大利亚的多样性最高。"},{"en":"In this rainforest survey, several Dilleniaceae species were recorded along the river.","zh":"在这次雨林调查中，研究者在河岸记录到了数种五桠果科植物。"}]}],"synonyms":["the dillenia family"],"phonetic":"/ˌdɪləˈniːeɪsiˌiː/","extraExplanation":["这是一个偏专业的植物分类学词汇，常见于植物志（flora）、生态调查报告、园艺或生物多样性资料中，日常英语里不常用。","词源上，Dilleniaceae 来自属名 Dillenia（为纪念德国植物学家 Johann Jacob Dillenius），再加上植物科名常见后缀 -aceae（表示“某某科”）。"]}
{"word":"dilleniacean","summary":{"en":"Dilleniacean means “related to the plant family Dilleniaceae” or “a plant in that family.”","zh":"dilleniacean 指“与五桠果科（Dilleniaceae）有关的”，也可指“五桠果科植物”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Relating to the plant family Dilleniaceae, or to plants in that family.","zh":"（植物学）与五桠果科（Dilleniaceae）有关的；指属于五桠果科的植物。"},"examples":[{"en":"The specimen was identified as a dilleniacean species based on its flower structure.","zh":"研究人员根据花的结构将该标本鉴定为五桠果科的一种。"},{"en":"In this tropical forest, several dilleniacean vines climb up the trees.","zh":"在这片热带森林里，有几种五桠果科藤本植物沿着树干攀爬。"}]},{"partOfSpeech":"n.","definition":{"en":"A plant belonging to the family Dilleniaceae.","zh":"五桠果科植物；五桠果科成员。"},"examples":[{"en":"Botanists recorded three dilleniaceans during the survey.","zh":"植物学家在调查中记录到三种五桠果科植物。"}]}],"synonyms":["dilleniaceous","of the Dilleniaceae family"],"phonetic":"/ˌdɪləˈnaɪʃiən/","extraExplanation":["“dilleniacean”来自植物科名 Dilleniaceae（五桠果科）。在英语里，很多科名都可以加上 -an / -ean 变成形容词或名词（如 rosaceous, fabaceous 也常见），表示“与某某科有关”或“属于某某科的植物”。","五桠果科主要分布在热带和亚热带地区，常见为木本或藤本植物。在科普或学术写作中更常遇到这个词，日常英语中较少使用。"]}
{"word":"dilleniaceous","summary":{"en":"“Dilleniaceous” means “related to the plant family Dilleniaceae.”","zh":"“dilleniaceous”表示“与五桠果科（Dilleniaceae）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the plant family Dilleniaceae (a group of mostly tropical trees, shrubs, and vines).","zh":"与五桠果科（Dilleniaceae，一类多分布于热带的乔木、灌木和藤本植物）有关的。"},"examples":[{"en":"Researchers compared dilleniaceous species from Southeast Asia and northern Australia.","zh":"研究人员比较了来自东南亚和澳大利亚北部的五桠果科植物物种。"},{"en":"The herbarium sheet was labeled as a dilleniaceous shrub.","zh":"这份植物标本被标注为五桠果科的灌木。"}]}],"synonyms":["dilleniacean","of the family Dilleniaceae"],"phonetic":"/ˌdɪlɪniˈeɪʃəs/","extraExplanation":["“dilleniaceous”主要用于植物学与分类学语境，日常英语里很少见。它来自植物科名 Dilleniaceae（以德国植物学家 Johann Jacob Dillenius 命名）+ 形容词后缀 -aceous，表示“……类的 / 与……有关的”。","近义表达常见为“of the family Dilleniaceae”或形容词“dilleniacean”（也用于表示五桠果科相关）。"]}
{"word":"dilleniad","summary":{"en":"A rare Welsh-derived term meaning a sequence/continuation, sometimes a consequence.","zh":"一个少见的威尔士语借词，指“延续、顺序”，有时指“结果、后果”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Welsh loanword; rare in English use) a sequence or continuation; sometimes used to mean a consequence or result.","zh":"（威尔士语借词；英语中很少用）“延续、顺序”；有时也可指“结果、后果”。"},"examples":[{"en":"The author uses the Welsh word “dilleniad” to suggest a sequence of events unfolding over time.","zh":"作者用威尔士语词“dilleniad”来暗示事件随时间展开的“连续顺序”。"},{"en":"In the introduction, “dilleniad” is glossed as “consequence,” meaning the result of earlier choices.","zh":"在导言中，“dilleniad”被注释为“consequence（后果）”，指早先选择带来的结果。"}]}],"synonyms":["sequence","continuation","consequence","result"],"phonetic":"/dɪˈlɛniˌɑd/","extraExplanation":["“dilleniad”并不是常见英语词汇，更可能出现在威尔士语语境（如标题、引文、地名/人名相关文本）中。","你输入的形式也可能与威尔士语更常见的拼写“dilyniad”（意为“连续、顺序/后果”）接近；如果你能提供句子出处，我可以按上下文确认更准确的含义。"]}
{"word":"Diller","summary":{"en":"“Diller” is most commonly a surname in English; it is not a common everyday English vocabulary word.","zh":"「Diller」在英語中最常見是姓氏；不是常用的一般英語詞彙。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname); used as a proper noun in English.","zh":"（英語中作專有名詞）姓氏；人名。"},"examples":[{"en":"Sarah Diller is one of the designers on the project.","zh":"莎拉·迪勒是這個專案的設計師之一。"},{"en":"Mr. Diller will speak at the conference tomorrow.","zh":"迪勒先生明天會在會議上發言。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a person who grows, sells, or uses dill (the herb) a lot.","zh":"（罕見）種植、販售或經常使用莳萝（dill，香草）的人。"},"examples":[{"en":"At the farmers’ market, a local diller sold fresh dill and pickles.","zh":"在農夫市集，一位本地的「diller」賣新鮮莳萝和腌菜。"}]}],"synonyms":["(surname)","(rare: dill seller/grower)"],"phonetic":"ˈdɪlər","extraExplanation":["「Diller」在英語裡最常見是姓氏（例如媒體圈的 Barry Diller）。如果你是在土耳其語裡看到 diller，它是 dil（舌頭／語言）的複數，意思是「語言們／多種語言」。在英語學習中，談「多種語言」通常用 languages。"]}
{"word":"dillesk","summary":{"en":"Dillisk (also spelled dillesk) is an Irish term for edible red seaweed, often eaten dried or used in cooking.","zh":"Dillisk（也拼作 dillesk）是爱尔兰对一种可食用红藻的称呼，常晒干当零食或用来烹饪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Irish English) A type of edible red seaweed (often dried) eaten as a snack or used in cooking; also spelled “dillesk.”","zh":"（爱尔兰英语）一种可食用的红藻（常晒干），可当零食吃或入菜；也拼作 dillesk。"},"examples":[{"en":"In Ireland, you can buy dried dillisk as a salty snack.","zh":"在爱尔兰，你可以买到晒干的 dillisk 当作咸味零食。"},{"en":"She added a little dillisk to the soup for a sea-like flavor.","zh":"她在汤里加了一点 dillisk，让味道更有海味。"}]}],"synonyms":["edible seaweed","dulse (related)"],"phonetic":"/ˈdɪlɪsk/","extraExplanation":["“Dillisk / dillesk”在爱尔兰沿海比较常见，常被晒干后直接吃，口感偏韧、带咸鲜味；也会用于面包、汤或海鲜料理中增添“海藻香”。","拼写上更常见的是 dillisk；你输入的 dillesk 属于常见变体。"]}
{"word":"Dilley","summary":{"en":"Dilley is most commonly a proper name: a small city in south Texas, or a surname.","zh":"Dilley 多见作专有名词：德州南部的一座小城名，或作姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a small city in south Texas, USA (in Frio County), often mentioned as a stop along Interstate 35 between San Antonio and Laredo","zh":"美国德克萨斯州南部的一座小城市（弗里奥县），常被提到是圣安东尼奥与拉雷多之间 I-35 公路沿线的落脚点/中途站"},"examples":[{"en":"We stopped in Dilley for gas on the way to Laredo.","zh":"去拉雷多的路上，我们在 Dilley 停下来加油。"},{"en":"Dilley is a small community south of San Antonio.","zh":"Dilley 是圣安东尼奥以南的一个小社区。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname)","zh":"姓氏（Dilley）"},"examples":[{"en":"Ms. Dilley will lead today’s meeting.","zh":"Dilley 女士将主持今天的会议。"},{"en":"I met a teacher named Dilley in college.","zh":"我在大学里认识一位姓 Dilley 的老师。"}]}],"phonetic":"/ˈdɪli/","extraExplanation":["“Dilley”在英语里通常是专有名词：要么指地名（德州的小城），要么是姓。作为地名时一般不加冠词（不说 *the Dilley*）。","在美国地名中，这类以人名/姓氏命名的小镇很常见；写作时首字母必须大写：Dilley。"]}
{"word":"dilli","summary":{"en":"“Dilli” is the Hindi/Urdu name commonly used to refer to Delhi, India’s capital.","zh":"“Dilli”是印地语/乌尔都语中对印度首都德里（Delhi）的常用称呼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Hindi/Urdu) Delhi; a common local name/nickname for India’s capital city, Delhi.","zh":"（印地语/乌尔都语）德里；印度首都“德里”的常见本地称呼/昵称。"},"examples":[{"en":"I’m flying to Dilli (Delhi) for a work trip next week.","zh":"我下周要飞去Dilli（德里）出差。"},{"en":"People in Dilli often call the city “Dilli” in everyday conversation.","zh":"在德里，人们日常聊天常把这座城市叫作“Dilli”。"},{"en":"The street food in Dilli is famous across India.","zh":"Dilli（德里）的街头小吃在印度很有名。"}]}],"synonyms":["Delhi","New Delhi (often used in English, though technically a part of Delhi)"],"phonetic":"/ˈdɪli/","extraExplanation":["“Dilli”是Delhi的本地称呼，常见于印地语/乌尔都语语境与口语表达；英文写作里更常用“Delhi”。","在流行文化中你也可能听到“Dilli”出现在电影、歌曲或口号里，用来表达更亲切、更“本地”的感觉。"]}
{"word":"Dillie","summary":{"en":"“Dillie” is an uncommon spelling of “dilly,” meaning a silly person; it can also be used as a personal name.","zh":"“Dillie”多为“dilly”的不常见拼写，意思是“傻瓜”；也可作人名或姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Uncommon spelling of “dilly”) a silly person; a fool (informal, somewhat old-fashioned).","zh":"（不常见拼写，等同于“dilly”）傻瓜；蠢人（非正式，略旧式）。"},"examples":[{"en":"Don’t be a dillie—check the address before you leave.","zh":"别当个傻瓜——出门前先核对地址。"},{"en":"He’s a nice guy, but he can be a bit of a dillie sometimes.","zh":"他人很好，但有时候会有点犯傻。"}]},{"partOfSpeech":"n.","definition":{"en":"A given name or family name (proper noun).","zh":"人名或姓氏（专有名词）。"},"examples":[{"en":"Dillie Johnson is speaking at the meeting today.","zh":"今天开会由Dillie Johnson发言。"}]}],"synonyms":["dilly","fool","silly person","idiot (stronger/impolite)"],"phonetic":"/ˈdɪli/","extraExplanation":["“Dillie”在现代英语里不常作为普通词使用；更常见的拼写是“dilly”。如果你是在书里或老文本里看到它，通常就是“傻瓜、犯傻的人”的意思。","相关词：dilly-dally（磨蹭、拖拖拉拉）；a dilly（口语中也可指“非常出色的人/事”，如“That’s a dilly!”=“真绝/真厉害！”但这种用法更常见于美式口语的夸张表达）。"]}
{"word":"dillier","summary":{"en":"“Dillier” is a rare informal comparative meaning “more silly/foolish,” from “dilly.”","zh":"“dillier”很少用，是口语中“dilly（傻、糊涂）”的比较级，意思是“更傻/更糊涂”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal, rare) Comparative form of “dilly”: more silly, foolish, or a bit slow/confused.","zh":"（非正式，用得很少）“dilly”的比较级：更傻、更糊涂、反应更慢一些。"},"examples":[{"en":"He gets dillier when he’s tired and starts mixing up names.","zh":"他一累就更糊涂，开始把人名叫错。"},{"en":"That plan sounds even dillier than the last one.","zh":"这个计划听起来比上一个还更傻。"}]}],"synonyms":["sillier","goofier","more foolish"],"phonetic":"/ˈdɪliər/","extraExplanation":["“dillier”并不是常见词，很多学习者更常见到的是“sillier（更傻的）”。“dilly”本身也比较口语、带点老派英式味道，所以“dillier”在现代文本里更少见。","注意别和“dill（莳萝）”混淆：形容“更有莳萝味”通常会说“more dill-flavored / more dilly”，而不是“dillier”。","如果你是想查人名或姓氏（例如 Diller），拼写可能不同，含义也会变。"]}
{"word":"dillies","summary":{"en":"“Dillies” is the plural of “dilly,” meaning either something excellent (humorous/old-fashioned) or, more rarely, dill pickles.","zh":"“dillies”是“dilly”的复数，常指“很棒的人或事物”（带幽默、略老派），较少见也可指“莳萝酸黄瓜”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of dilly) a person or thing that is very good, impressive, or remarkable (often humorous or old-fashioned).","zh":"（dilly 的复数）很棒的人或事物；令人印象深刻的东西（常带幽默或略显老派的语气）。"},"examples":[{"en":"That new camera is one of the best dillies I’ve ever used.","zh":"那台新相机是我用过最棒的东西之一。"},{"en":"She solved the problem in five minutes—she’s a real dilly.","zh":"她五分钟就把问题解决了——她真是个厉害的人。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) (plural of dilly) dill pickles; pickled cucumbers flavored with dill (often heard in the U.S. in casual speech).","zh":"（较少见）（dilly 的复数）莳萝酸黄瓜；用莳萝调味的腌黄瓜（在美国口语中偶尔听到）。"},"examples":[{"en":"I’ll take a sandwich with extra dillies on the side.","zh":"我想要一份三明治，旁边再多配点莳萝酸黄瓜。"},{"en":"He likes his burgers with onions and dillies.","zh":"他喜欢汉堡里加洋葱和莳萝酸黄瓜。"}]}],"synonyms":["gems","great ones","wonders","standouts","dill pickles"],"phonetic":"/ˈdɪli/","extraExplanation":["“dilly”表示“很棒的东西/人物”时，语气偏口语、带点俏皮，常见于较老派的英语表达（如：That’s a dilly!）。","第二个意思与“dill（莳萝）”相关，在某些美式口语里会用“a dilly”指“莳萝酸黄瓜/腌黄瓜”，但不如直接说“dill pickle(s)”常见。"]}
{"word":"dilligrout","summary":{"en":"Dilligrout is a rare historical word for a medieval English spiced pottage/sauce, and it can also mean the ceremonial/feudal duty of providing it to the monarch (often at coronations).","zh":"dilligrout是一个罕见的历史词，指中世纪英格兰的一种加香料的浓汤/酱羹；也可指在王室典礼（常见于加冕礼）中制作或呈献它的礼仪/封建役务。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A medieval English dish or sauce—often a spiced pottage made with meat broth (sometimes capon), bread, wine/ale, and sometimes almond milk—traditionally served at certain royal ceremonies.","zh":"（历史）中世纪英格兰的一种菜肴/酱羹，常为加香料的浓汤或粥状食物，用肉汤（有时用阉鸡）、面包、酒/麦酒，有时加杏仁奶等制成；传统上与某些王室典礼相关。"},"examples":[{"en":"The chronicle mentions dilligrout being prepared for a royal feast.","zh":"史料记载在王室宴会上曾准备过dilligrout。"},{"en":"In a museum exhibit on medieval food, dilligrout is described as a rich, spiced pottage.","zh":"在介绍中世纪饮食的博物馆展览中，dilligrout被描述为一种浓郁、带香料的浓汤/粥。"}]},{"partOfSpeech":"n.","definition":{"en":"(British history, law) A ceremonial service or feudal tenure connected with making or presenting dilligrout to the monarch, especially at a coronation.","zh":"（英国史/法律）与制作或向君主呈献dilligrout相关的一种礼仪性职责或封建土地役务（任役契约），尤指加冕礼中的相关服务。"},"examples":[{"en":"The family held land by the service of providing dilligrout at the coronation.","zh":"该家族以在加冕礼上提供dilligrout的役务作为持有土地的条件。"},{"en":"Records of the coronation list the dilligrout service among traditional duties.","zh":"加冕礼记录将“dilligrout役务”列为传统职责之一。"}]}],"synonyms":["pottage","stew","(historical) sauce"],"phonetic":"/ˈdɪlɪˌɡraʊt/","extraExplanation":["这个词非常罕见，主要出现在中世纪英国的饮食史、王室礼仪史与封建制度相关材料里。它常与“加冕礼（coronation）”和“以役务换取土地的封建持有方式（serjeanty）”一起出现，因此在现代英语中几乎只在历史语境下使用。","拼写在古文献中可能有变体（如dillegrout等），遇到不同拼写时可结合上下文判断是否指同一事物。"]}
{"word":"Dilliner","summary":{"en":"Dilliner is usually a proper name, most often a small community in Pennsylvania, and it can also be a surname.","zh":"Dilliner 通常是专有名词，多指宾夕法尼亚州的一个社区，也可作姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name, most commonly referring to Dilliner, an unincorporated community in Greene County, Pennsylvania, USA.","zh":"专有名词，最常指美国宾夕法尼亚州格林县的一个非建制社区（Dilliner）。"},"examples":[{"en":"She grew up near Dilliner, Pennsylvania.","zh":"她在宾夕法尼亚州的 Dilliner 附近长大。"},{"en":"The meeting will be held in Dilliner this weekend.","zh":"会议将于本周末在 Dilliner 举行。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname (family name).","zh":"姓氏（家族名）。"},"examples":[{"en":"Mr. Dilliner sent the documents yesterday.","zh":"Dilliner 先生昨天寄出了文件。"},{"en":"Dilliner is not a very common last name.","zh":"Dilliner 不是一个很常见的姓。"}]}],"phonetic":"/ˈdɪlɪnər/","extraExplanation":["Dilliner 作为地名时，属于“非建制社区（unincorporated community）”，通常表示它不是一个独立设市的城镇，而是由县或乡镇层级提供部分公共服务。","英语里很多地名和姓氏会相互影响：一个地方可能以某个家族或早期定居者命名；反过来，人们也可能因出生地或居住地而被称为某某地名相关的姓氏。"]}
{"word":"dilling","summary":{"en":"“Dilling” usually means “adding dill (the herb) to food,” or it can be a proper name.","zh":"“dilling”通常指“往食物里加莳萝调味”，也可能是人名/地名等专有名词。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle/gerund of “dill”) adding dill (the herb) to food; seasoning with dill.","zh":"（“dill”的现在分词/动名词）把莳萝（香草）加入食物中；用莳萝调味。"},"examples":[{"en":"She’s dilling the yogurt sauce for the fish.","zh":"她正在往酸奶酱里加莳萝，用来配鱼。"},{"en":"I started dilling the potatoes near the end so the flavor stays fresh.","zh":"我在快结束时才给土豆加莳萝，这样味道更清新。"}]},{"partOfSpeech":"other","definition":{"en":"Used as a name (a surname, place name, or part of a brand name).","zh":"用作专有名词（姓氏、地名或品牌名的一部分）。"},"examples":[{"en":"I met Dr. Dilling at the conference.","zh":"我在会议上见到了Dilling医生。"},{"en":"The package was addressed to Dilling, Ohio.","zh":"包裹寄往俄亥俄州的Dilling（地名示例）。"}]}],"synonyms":["seasoning","flavoring","adding dill","seasoning with dill"],"phonetic":"/ˈdɪlɪŋ/","extraExplanation":["“dilling”在日常英语里不算常见。多数情况下人们会直接用名词“dill”（莳萝）或动词短语“add dill / season with dill（加莳萝/用莳萝调味）”。如果你是在菜单、食谱里看到“dilling”，通常就是指“正在加莳萝调味”。","如果你本来想查的是“drilling（钻孔/训练）”或“dilling（某个名字）”，也可以把完整句子发我，我能帮你确认语境。"]}
{"word":"Dillinger","summary":{"en":"Dillinger usually refers to John Dillinger, a well-known U.S. bank robber from the 1930s, or to things named after him.","zh":"Dillinger 通常指20世纪30年代美国著名银行抢匪约翰·迪林杰，也可指以他命名的人或作品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) John Dillinger (1903–1934), a famous American bank robber and outlaw during the Great Depression, often described as a “gangster” in U.S. history and popular culture.","zh":"（专有名词）约翰·迪林杰（1903–1934），美国大萧条时期著名的银行抢匪与逃犯，常被称为美国历史与流行文化中的“黑帮/匪徒”人物。"},"examples":[{"en":"John Dillinger became a national celebrity during the 1930s because of his bank robberies and daring escapes.","zh":"由于一系列银行抢劫和大胆越狱，约翰·迪林杰在20世纪30年代成了全国性的“名人”。"},{"en":"The film shows Dillinger as a dangerous outlaw, but also a symbol of the era’s anger at banks.","zh":"电影把迪林杰塑造成危险的逃犯，同时也呈现他在当时被一些人视为“对银行不满情绪的象征”。"}]},{"partOfSpeech":"n.","definition":{"en":"(Common use) A reference to someone or something named after John Dillinger (for example, a character, a film, or a band name).","zh":"（常见用法）指以“Dillinger/迪林杰”命名的人或事物（如角色、电影或乐队名等）。"},"examples":[{"en":"Dillinger has appeared as a character in novels and movies about the 1930s.","zh":"在描写20世纪30年代的小说和电影里，常会出现“迪林杰”这个角色。"},{"en":"Some bands use “Dillinger” in their name to suggest rebellion or danger.","zh":"有些乐队把“Dillinger”放进名字里，用来营造叛逆或危险的感觉。"}]}],"synonyms":["outlaw","gangster","bank robber"],"phonetic":"/ˈdɪlɪndʒɚ/","extraExplanation":["在美国语境里，“Dillinger”通常让人联想到“大萧条时期的匪徒/黑帮传奇”。当时很多人对银行和经济体系不满，媒体把一些罪犯戏剧化报道，使他们在公众视野里带有“反英雄”的色彩，但这不等于美化犯罪。","历史上，迪林杰最终在芝加哥一间电影院外被联邦调查局（FBI）击毙；因此他也经常出现在犯罪史、纪录片与影视作品中。"]}
{"word":"Dillingham","summary":{"en":"Dillingham is mainly used as a surname or the name of a city in Alaska, USA.","zh":"Dillingham 主要用作英文姓氏，或指美国阿拉斯加州的一座城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name) of English origin.","zh":"一个英文姓氏（家族姓）。"},"examples":[{"en":"Ms. Dillingham will lead the meeting today.","zh":"Dillingham 女士今天将主持会议。"},{"en":"I emailed Professor Dillingham about the assignment.","zh":"我给 Dillingham 教授发邮件询问作业。"}]},{"partOfSpeech":"n.","definition":{"en":"Dillingham: a city in southwest Alaska, U.S., known as a regional hub for nearby communities and fishing.","zh":"Dillingham：美国阿拉斯加州西南部的一座城市，是周边社区的区域中心，也以渔业闻名。"},"examples":[{"en":"They flew from Anchorage to Dillingham for work.","zh":"他们从安克雷奇飞到 Dillingham 出差。"},{"en":"Dillingham is an important gateway to Bristol Bay.","zh":"Dillingham 是通往布里斯托尔湾的重要门户。"}]}],"synonyms":["(as a proper name) none"],"phonetic":"/ˈdɪlɪŋhæm/","extraExplanation":["“Dillingham”既可作姓氏，也常指阿拉斯加的同名城市。谈到地点时，英语里通常不用冠词：例如说“in Dillingham”（在 Dillingham）。","阿拉斯加的 Dillingham 常与 Bristol Bay（布里斯托尔湾）渔业联系在一起；在新闻或纪录片里，你可能会看到它作为区域交通与补给中心被提到。"]}
{"word":"dillis","summary":{"en":"“Dillis” is usually a surname; as a word, it’s not standard and is often a misspelling of “dillies” (plural of “dilly,” meaning something excellent).","zh":"“Dillis”通常是姓氏；作为普通词并不标准，常见情况是把 “dillies”（dilly 的复数，指“很棒的东西”）拼错。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A family name (surname).","zh":"姓氏（家族名）。"},"examples":[{"en":"Ms. Dillis will lead the meeting today.","zh":"Dillis 女士今天将主持会议。"},{"en":"I found a book signed by J. Dillis.","zh":"我找到一本署名 J. Dillis 的书。"}]},{"partOfSpeech":"n.","definition":{"en":"A nonstandard spelling that is often a misspelling of “dillies” (plural of “dilly”), meaning very good or impressive things (informal).","zh":"一种不规范拼写，常见为 “dillies”（dilly 的复数）的误拼；口语里可指“很棒的东西/很出彩的人或事”。"},"examples":[{"en":"Those homemade cookies are real dillies.","zh":"那些自制饼干真是太棒了。"},{"en":"She made a few dillies for the school bake sale.","zh":"她为学校义卖烤了几样特别好吃的点心。"}]}],"synonyms":["(for “dilly” sense) great thing","excellent thing","gem"],"phonetic":"/ˈdɪlɪs/","extraExplanation":["“dillis”在标准英语词典里通常不作为常用单词出现：更多见的是姓氏（专有名词）。如果你想表达香草“莳萝”，正确拼写是 **dill**；如果你想写口语“很棒的东西”，更常见拼写是 **dilly**（复数 **dillies**）。","口语里 “a dilly” 有“特别出色的人/事/物”的意思，语气偏轻松，有点老派；不同地区使用频率不一样。"]}
{"word":"dillisk","summary":{"en":"Dillisk is an Irish word for an edible red seaweed, often dried and eaten as a snack or used in cooking.","zh":"Dillisk 是爱尔兰常用词，指一种可食用的红藻海藻，常晒干当零食或用于烹饪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of edible red seaweed (often the same as dulse) eaten especially in Ireland, sometimes dried and used as a snack or in cooking.","zh":"一种可食用的红藻（常与“dulse/紫菜红藻”指同类），在爱尔兰尤其常见；可晒干当零食或入菜。"},"examples":[{"en":"In some parts of Ireland, people snack on dried dillisk.","zh":"在爱尔兰一些地区，人们会把晒干的 dillisk 当零食吃。"},{"en":"She added dillisk to the soup for a salty, ocean-like flavor.","zh":"她把 dillisk 加进汤里，带来咸鲜的海味。"}]}],"synonyms":["dulse","edible seaweed"],"phonetic":"/ˈdɪlɪsk/","extraExplanation":["“Dillisk”主要是爱尔兰英语/方言用词，常用来指一种可食用的红藻（很多时候与“dulse”指同一种海藻，即 Palmaria palmata）。在日常英语里更常见的说法通常是“dulse”或更泛的“edible seaweed（可食用海藻）”。"]}
{"word":"Dillon","summary":{"en":"“Dillon” is most commonly a person’s name (first name or surname), and it can also be a place name.","zh":"“Dillon”最常见是人名（名或姓），也可作地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (first name), usually masculine, used in English-speaking countries.","zh":"（人名）迪伦：常见的英文名字，多为男性名。"},"examples":[{"en":"Dillon is starting college this fall.","zh":"迪伦今年秋天开始上大学。"},{"en":"My friend Dillon plays basketball after school.","zh":"我的朋友迪伦放学后打篮球。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"（姓氏）迪伦：用作英文姓氏。"},"examples":[{"en":"Ms. Dillon will email the schedule to everyone.","zh":"迪伦女士会把日程表邮件发给大家。"},{"en":"I met Dr. Dillon at the conference.","zh":"我在会议上见到了迪伦博士。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name used for several towns and areas (for example, Dillon, Colorado, in the U.S.).","zh":"（地名）迪伦：用于多个城镇/地区的名称（例如美国科罗拉多州的 Dillon）。"},"examples":[{"en":"We drove through Dillon on our way to the mountains.","zh":"我们去山里时开车经过了迪伦。"},{"en":"Dillon, Colorado is near popular ski areas.","zh":"科罗拉多州的迪伦靠近一些热门滑雪区。"}]}],"phonetic":"/ˈdɪlən/","extraExplanation":["“Dillon”作为名字或姓氏在英语世界都很常见；有时也会被拼作“Dilan”等变体，但最常见拼写是 Dillon。","词源上常与爱尔兰姓氏（如 Ó Duilleáin）或法国/诺曼来源的姓氏演变有关；不同家族可能有不同来源。"]}
{"word":"Dillonvale","summary":{"en":"Dillonvale is a U.S. place name (most often in eastern Ohio).","zh":"Dillonvale 是美国的一个地名（多指俄亥俄州东部）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A place name (proper noun), most commonly referring to Dillonvale, an unincorporated community in eastern Ohio, USA.","zh":"一个地名（专有名词），最常指美国俄亥俄州东部的狄龙韦尔（Dillonvale）社区（非建制地区）。"},"examples":[{"en":"She grew up near Dillonvale, Ohio, and later moved to Columbus.","zh":"她在俄亥俄州的狄龙韦尔附近长大，后来搬到哥伦布市。"},{"en":"The highway sign pointed toward Dillonvale.","zh":"高速路标指向狄龙韦尔。"}]}],"phonetic":"/ˈdɪlənveɪl/","extraExplanation":["Dillonvale 是典型的英语地名构词：Dillon（人名/姓氏）+ vale（“山谷、谷地”）。因此它字面可理解为“狄龙的山谷/谷地”。","在英语里，地名通常不翻译其字面意义，而是采用音译（如“狄龙韦尔”）或保留原名（Dillonvale），具体取决于语境与读者。"]}
{"word":"dills","summary":{"en":"“Dills” usually means multiple amounts or types of dill, a cooking herb often used in pickles and savory dishes.","zh":"“dills”通常指多份或多种“dill（莳萝）”，一种常用于腌黄瓜和咸味菜肴的香草。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the plural form of “dill,” a fragrant herb used especially in cooking (for example, in pickles, fish dishes, and salads)","zh":"“dill（莳萝）”的复数；一种带有清香味的香草，常用于烹饪（如腌黄瓜、鱼类料理、沙拉等）"},"examples":[{"en":"Fresh dills are common in pickling recipes.","zh":"腌制食谱里常用新鲜的莳萝。"},{"en":"She added chopped dills to the potato salad.","zh":"她在土豆沙拉里加了切碎的莳萝。"}]}],"synonyms":["dill (herb)","dill weed"],"phonetic":"/dɪlz/","extraExplanation":["在英语里更常见的写法是用“dill”作不可数名词（例如：Add some dill. 加点莳萝），但当你强调“不同份/不同种类/一把一把的莳萝”时，也会看到复数“dills”。","“dill”在美式饮食文化中和“dill pickles（莳萝酸黄瓜）”联系很紧密；菜单或食谱里看到“dill”多半就是这种香草，而不是别的意思。"]}
{"word":"Dillsboro","summary":{"en":"Dillsboro is the name of small towns in the United States, especially Dillsboro, North Carolina (more commonly referenced), and also Dillsboro, Indiana.","zh":"Dillsboro是美国一些小镇的地名，最常被提到的是北卡罗来纳州的Dillsboro，另外印第安纳州也有同名小镇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A town in western North Carolina, USA (in Jackson County), known as a small mountain community and tourist stop near the Great Smoky Mountains.","zh":"美国北卡罗来纳州西部的一个小镇（杰克逊县），位于山区附近，常作为旅游小镇与落脚点。"},"examples":[{"en":"We stopped in Dillsboro on our way to the Great Smoky Mountains.","zh":"我们去大烟山的路上在Dillsboro停了一下。"},{"en":"Dillsboro is small, but it has shops and local festivals.","zh":"Dillsboro很小，但有一些商店和本地节庆活动。"}]},{"partOfSpeech":"n.","definition":{"en":"A small town in Indiana, USA (in Dearborn County).","zh":"美国印第安纳州的一个小镇（迪尔伯恩县）。"},"examples":[{"en":"He grew up near Dillsboro, Indiana.","zh":"他在印第安纳州的Dillsboro附近长大。"}]}],"synonyms":["(proper noun) no direct synonyms; often specified as “Dillsboro, NC” or “Dillsboro, IN” to avoid confusion"],"phonetic":"/ˈdɪlzˌbʌroʊ/","extraExplanation":["这是一个专有名词（地名），通常不翻译，中文多直接音译为“迪尔斯伯勒”（也可能见到“迪尔斯伯罗”等写法）。","结尾的 -boro / -borough 常见于英语地名，历史上与“镇、自治市（borough）”有关；在美式英语里常简化拼写为 -boro。"]}
{"word":"Dillsburg","summary":{"en":"Dillsburg is a borough (small town) in Pennsylvania, USA.","zh":"Dillsburg 是美国宾夕法尼亚州的一个自治市（小镇）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small borough (town) in York County, Pennsylvania, USA, near Harrisburg.","zh":"美国宾夕法尼亚州约克县的一个小镇（自治市），靠近哈里斯堡。"},"examples":[{"en":"Dillsburg is a small town in south-central Pennsylvania.","zh":"Dillsburg 是宾夕法尼亚州中南部的一个小镇。"},{"en":"They drove from Harrisburg to Dillsburg for the weekend.","zh":"他们从哈里斯堡开车去 Dillsburg 过周末。"}]}],"phonetic":"/ˈdɪlz.bɝɡ/","extraExplanation":["Dillsburg 是地名（专有名词），一般不翻译，常直接音译或保留英文拼写；写作时首字母必须大写。","该地与“Dill’s Tavern（迪尔酒馆）”等早期定居历史有关；在美国语境里，类似以 -burg 结尾的地名通常表示“城镇/堡镇”（如 Pittsburgh）。"]}
{"word":"dillseed","summary":{"en":"Dillseed is the dried seed of dill used as a spice, especially in pickles and some breads.","zh":"Dillseed 指莳萝的干燥种子，是一种香料，尤其常用于腌制食品和部分面包。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the dried seed of the dill plant, used as a spice (often in pickling and bread).","zh":"莳萝籽；莳萝植物的干燥种子，用作香料（常用于腌制食物和面包等）。"},"examples":[{"en":"This pickle recipe uses dillseed instead of fresh dill.","zh":"这个腌黄瓜配方用的是莳萝籽，而不是新鲜莳萝。"},{"en":"Add a pinch of dillseed to the soup for a mild, slightly sweet flavor.","zh":"在汤里加一小撮莳萝籽，会有淡淡的、微甜的香味。"},{"en":"Rye bread with dillseed is common in some European cuisines.","zh":"在一些欧洲饮食文化中，加入莳萝籽的黑麦面包很常见。"}]}],"synonyms":["dill seed","dill seeds"],"phonetic":"/ˈdɪlˌsiːd/","extraExplanation":["“dillseed”也常写作“dill seed”。味道通常比新鲜莳萝更浓、更偏温暖辛香，常与醋、蒜、芥末籽等一起用于腌渍。"]}
{"word":"Dilltown","summary":{"en":"Dilltown is mainly used as a U.S. place name (a community in Pennsylvania).","zh":"Dilltown 主要作为美国地名使用（宾夕法尼亚州的一个社区）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A place name (proper noun), most commonly referring to Dilltown, a small unincorporated community in Indiana County, Pennsylvania, USA.","zh":"地名（专有名词），最常见指美国宾夕法尼亚州印第安纳县的一个小型非建制社区（Dilltown）。"},"examples":[{"en":"Dilltown is a quiet community in western Pennsylvania.","zh":"Dilltown 是宾夕法尼亚州西部一个安静的小社区。"},{"en":"We drove through Dilltown on our way to Indiana, Pennsylvania.","zh":"我们去宾夕法尼亚州的印第安纳（Indiana）途中开车经过了 Dilltown。"}]}],"synonyms":["(no direct synonyms; it is a proper name)"],"phonetic":"/ˈdɪltaʊn/","extraExplanation":["“Dilltown”是典型的英语地名构词：Dill（常见姓氏或也可指“莳萝”这种香草）+ town（城镇）。在地名里，前半部分通常来自早期定居者姓氏、当地地形/植被，或历史称呼。若你指的是别的地区或作品中的“Dilltown”，可以告诉我上下文（国家/州/书名/游戏名），我可以给出更准确的释义与用法。"]}
{"word":"dillue","summary":{"en":"Dilute means to make something less strong or less concentrated (literally with liquid, or figuratively with ideas/effects).","zh":"dilute 指“稀释”，也可引申为“削弱、冲淡（影响/效果/观点）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(of a liquid) to make something weaker or less concentrated by adding water or another liquid.","zh":"（液体）通过加水或加入其他液体来稀释，使浓度变低。"},"examples":[{"en":"Dilute the juice with a little water for kids.","zh":"给孩子喝的话，把果汁加一点水稀释一下。"},{"en":"This disinfectant must be diluted before use.","zh":"这种消毒剂使用前必须稀释。"}]},{"partOfSpeech":"vt.","definition":{"en":"to reduce the strength, power, or effectiveness of something (such as an idea, law, or message).","zh":"（比喻）削弱某事物的力量、效力或影响（如观点、法律或信息）。"},"examples":[{"en":"They worried the new changes would dilute the original plan.","zh":"他们担心这些新改动会削弱原来的计划。"},{"en":"Try not to dilute your message with too many details.","zh":"尽量别用太多细节把你的核心信息冲淡了。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become weaker or less concentrated.","zh":"变稀；变淡；（程度）减弱。"},"examples":[{"en":"The color will dilute over time in strong sunlight.","zh":"在强烈阳光下，颜色会随着时间变淡。"},{"en":"As the conversation continued, his anger began to dilute.","zh":"随着谈话继续，他的怒气开始减弱。"}]},{"partOfSpeech":"adj.","definition":{"en":"made weaker or less concentrated by adding liquid; not strong.","zh":"被稀释的；淡的；不浓的。"},"examples":[{"en":"The soup tastes too dilute.","zh":"这汤喝起来太淡了。"},{"en":"Use a dilute solution on sensitive skin.","zh":"敏感皮肤用稀释后的溶液。"}]}],"synonyms":["water down","thin","weaken","diminish","attenuate"],"phonetic":"/daɪˈluːt/","extraExplanation":["你输入的“dillue”很可能是拼写错误，常见目标词是 **dilute**（稀释/削弱）。如果你其实想查 **deluge**（洪水；大量涌来）或别的词，告诉我上下文句子，我可以为你匹配正确单词并解释差别。"]}
{"word":"dilluer","summary":{"en":"“Dilute” means to make something less concentrated by adding liquid, or describes something that is not concentrated.","zh":"“dilute”指通过加入液体使浓度降低（稀释），也可形容“稀的、不浓的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make a liquid weaker or less concentrated by adding water or another liquid","zh":"（通过加水或其他液体）稀释，使浓度降低"},"examples":[{"en":"Dilute the juice with a little water for children.","zh":"给孩子喝的话，把果汁加一点水稀释。"},{"en":"The chemist diluted the solution to 10%.","zh":"化学家把溶液稀释到 10%。"}]},{"partOfSpeech":"adj.","definition":{"en":"not concentrated; made weaker by adding liquid","zh":"稀的；被稀释的；不浓的"},"examples":[{"en":"This coffee is too dilute for me.","zh":"这咖啡对我来说太淡了。"},{"en":"Use a dilute bleach mixture to clean the surface.","zh":"用稀释的漂白水混合液清洁表面。"}]}],"synonyms":["water down","thin","weaken"],"phonetic":"/daɪˈluːt/","extraExplanation":["“dilluer”不是常见的英语单词，通常是拼写错误。你可能想写的是“dilute”（动词/形容词）。","相关名词是“diluter”（稀释剂/稀释器）或“dilution”（稀释；稀释后的浓度降低）。"]}
{"word":"dillweed","summary":{"en":"“Dillweed” can mean the herb dill (dill weed), or (more commonly in slang) a mildly insulting term for an annoying or foolish person.","zh":"“dillweed”既可指莳萝叶（dill weed），也更常作俚语，表示对一个烦人或愚蠢的人的轻度侮辱称呼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A mildly insulting word for someone you think is silly, annoying, or incompetent.","zh":"（俚语，轻度侮辱）指你觉得愚蠢、烦人或不称职的人。"},"examples":[{"en":"Stop acting like a dillweed and listen to the instructions.","zh":"别像个傻瓜一样，先听清楚说明。"},{"en":"He forgot the tickets again—what a dillweed.","zh":"他又把票忘了——真是个笨蛋。"}]},{"partOfSpeech":"n.","definition":{"en":"The herb dill (or its leafy parts) used for flavoring food; literally “dill weed.”","zh":"莳萝（或其叶子），用于给食物调味；字面义为“莳萝草/莳萝叶”。"},"examples":[{"en":"Add some dillweed to the soup for a fresh, herby flavor.","zh":"在汤里加点莳萝叶，会更清新有草本香。"},{"en":"This recipe calls for dillweed, not dill seed.","zh":"这道菜需要的是莳萝叶，不是莳萝籽。"}]}],"synonyms":["idiot","jerk","dork","fool","moron"],"phonetic":"/ˈdɪlˌwid/","extraExplanation":["“dillweed”作为骂人的俚语通常语气较轻，带点幼稚或吐槽感，常见于口语或影视台词中；在正式场合不建议使用。","字面义里的“dill weed”在食谱中常写作两个词（dill weed），指莳萝叶；而“dill seed”是莳萝籽，味道更浓、更偏辛香。"]}
{"word":"Dillwyn","summary":{"en":"Dillwyn is mainly a Welsh-origin surname and can also refer to a place name such as Dillwyn, Virginia.","zh":"Dillwyn 主要是源自威尔士的姓氏，也可指地名，如美国弗吉尼亚州的 Dillwyn。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A proper name (surname), originally from Wales; also used as a given name in rare cases.","zh":"专有名词（姓氏），源自威尔士；也极少用作名字。"},"examples":[{"en":"John Dillwyn was known in his community for his support of local education.","zh":"约翰·迪尔温在社区里以支持本地教育而闻名。"},{"en":"Her last name is Dillwyn, so people often ask about its Welsh background.","zh":"她的姓是 Dillwyn，所以人们常会问它的威尔士渊源。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name, especially Dillwyn, Virginia (a small community in the United States).","zh":"地名，尤指美国弗吉尼亚州的 Dillwyn（一个小社区）。"},"examples":[{"en":"They drove through Dillwyn, Virginia on their way to the mountains.","zh":"他们去山区的路上开车经过了弗吉尼亚州的 Dillwyn。"},{"en":"Dillwyn is a quiet place with a small-town feel.","zh":"Dillwyn 是个安静的小地方，有小镇的氛围。"}]}],"phonetic":"/ˈdɪl.wɪn/","extraExplanation":["“Dillwyn”常被认为是威尔士来源的姓氏，可能与威尔士语地名或家族名有关，因此在英语里通常不翻译含义，而是按音译/原拼写使用。","在英语语境中，像 Dillwyn 这类专有名词的拼写大小写固定（首字母大写），发音在不同地区可能略有差异。"]}
{"word":"dilly","summary":{"en":"Dilly is an informal noun meaning either a silly person or something especially impressive.","zh":"dilly 是个非正式名词，可指“傻瓜”，也可指“特别棒/出众的东西”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A silly or foolish person.","zh":"（非正式）傻瓜；糊涂的人。"},"examples":[{"en":"Don’t be a dilly—check the address before you go.","zh":"别犯傻——出门前先把地址核对一下。"},{"en":"I felt like a dilly for forgetting my keys again.","zh":"我又忘带钥匙，觉得自己真是个糊涂蛋。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) Something excellent, impressive, or unusual; a standout thing.","zh":"（非正式）很棒的东西；出色/不寻常的事物。"},"examples":[{"en":"That chocolate cake is a real dilly.","zh":"那块巧克力蛋糕真是一绝。"},{"en":"Her new bike is a dilly—light, fast, and beautiful.","zh":"她的新自行车太棒了——轻便、快速又好看。"}]}],"synonyms":["fool","silly person","goof","dummy","gem","beauty","standout"],"phonetic":"/ˈdɪli/","extraExplanation":["“dilly”多见于英式口语里，语气偏轻松，有时带一点打趣。第二个意思常见于固定搭配 “a real dilly”。","它和 “dilly-dally”（磨磨蹭蹭、拖拖拉拉）拼写相近，但含义不同；“dilly”本身通常不表示“拖延”。"]}
{"word":"dilly-dally","summary":{"en":"“Dilly-dally” means to waste time by being slow or indecisive; it can also mean the delay itself.","zh":"“dilly-dally”指因慢吞吞或犹豫不决而浪费时间、拖延；也可指这种拖延行为本身。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to waste time or move too slowly because you cannot decide what to do; to delay taking action","zh":"磨蹭；拖拖拉拉；因犹豫不决而耽搁、拖延"},"examples":[{"en":"Stop dilly-dallying and get in the car—we’re going to be late.","zh":"别再磨蹭了，快上车——我们要迟到了。"},{"en":"She dilly-dallied in the store, trying to choose a gift.","zh":"她在店里拖拖拉拉，想挑一份礼物。"},{"en":"If we dilly-dally, we’ll miss the last train.","zh":"如果我们再拖延，就会错过末班车。"}]},{"partOfSpeech":"n.","definition":{"en":"a delay or slow, indecisive behavior","zh":"拖延；磨蹭（的行为或状态）"},"examples":[{"en":"No more dilly-dally—let’s start the meeting.","zh":"别再拖延了——我们开始开会吧。"},{"en":"All that dilly-dally cost us an hour.","zh":"那一通磨蹭让我们浪费了一小时。"}]}],"synonyms":["procrastinate","dawdle","linger","stall","delay"],"phonetic":"/ˌdɪli ˈdæli/","extraExplanation":["“dilly-dally”是典型的英语“重叠/拟声式”表达（像“wishy-washy”“zigzag”那样），听起来就有“来回晃、拿不定主意”的感觉，因此常用于口语、语气略带催促或不耐烦。","常见搭配：Stop dilly-dallying. / Don’t dilly-dally. / dilly-dally around (somewhere)（在某处磨蹭）。","语体提示：比“delay”更口语、更带情绪；用于正式写作时通常改用“delay / procrastinate / linger”。"]}
{"word":"dillydallied","summary":{"en":"“Dillydallied” means “wasted time or delayed by being slow/indecisive.”","zh":"“dillydallied”表示“磨蹭、拖延（因慢或犹豫不决）”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to waste time or move too slowly instead of doing what you should; to delay by being indecisive","zh":"磨磨蹭蹭、拖拖拉拉；因犹豫不决而拖延"},"examples":[{"en":"We dillydallied all morning and missed the early train.","zh":"我们整个早上都拖拖拉拉，结果错过了早班火车。"},{"en":"Stop dillydallying and finish your homework.","zh":"别再磨蹭了，把作业写完。"},{"en":"She dillydallied at the menu because she couldn’t decide what to order.","zh":"她在菜单前犹豫不决，点餐点了很久。"}]},{"partOfSpeech":"vt.","definition":{"en":"to delay (something) by taking too long or not acting promptly","zh":"（使某事）拖延、耽搁；因为不迅速行动而延误"},"examples":[{"en":"They dillydallied the decision until it was too late.","zh":"他们把决定一拖再拖，直到为时已晚。"},{"en":"Don’t dillydally your application—submit it today.","zh":"别把申请拖着不交——今天就提交。"}]}],"synonyms":["dawdled","procrastinated","hesitated","dragged one’s feet","stalled"],"phonetic":"/ˈdɪliˌdælid/","extraExplanation":["“dillydallied”是动词“dillydally”的过去式/过去分词，语气偏口语、略带责备或开玩笑的感觉。","“dillydally”属于英语里常见的重叠/押韵式构词（类似“wishy-washy”“zigzag”），读起来俏皮，但表达的意思通常是“拖拉、不利索”。"]}
{"word":"dillydallier","summary":{"en":"A dillydallier is someone who delays or wastes time instead of acting promptly.","zh":"dillydallier 指爱拖延、做事磨蹭的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who wastes time or delays doing something; someone who “dilly-dallies.”","zh":"磨磨蹭蹭的人；爱拖延、浪费时间的人。"},"examples":[{"en":"We’ll miss the train if you keep being a dillydallier.","zh":"你再这样磨磨蹭蹭，我们就赶不上火车了。"},{"en":"Don’t be a dillydallier—send the email now.","zh":"别再拖延了——现在就把邮件发出去。"}]}],"synonyms":["procrastinator","time-waster","dawdler","laggard"],"phonetic":"/ˈdɪliˌdæliɚ/","extraExplanation":["“dillydallier”来自动词短语“dilly-dally”（磨蹭、拖延）。这种叠音词在英语里常用来表达轻松、带点调侃的语气（像“wishy-washy”）。因此它通常不算很正式，多用于口语或幽默的批评。"]}
{"word":"dillydallies","summary":{"en":"“Dillydallies” means delays or time-wasting, or it can be the verb form meaning “(he/she) wastes time.”","zh":"“dillydallies”可指“拖延、磨蹭（的行为）”，也可作动词表示“（他/她）在磨蹭、拖拖拉拉”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(third-person singular of “dilly-dally”) to waste time or delay doing something, often because you can’t decide or you’re being slow.","zh":"（动词“dilly-dally”的第三人称单数）磨蹭、拖延（常因犹豫不决或动作慢）。"},"examples":[{"en":"He always dillydallies before leaving the house, so we’re often late.","zh":"他出门前总是磨磨蹭蹭，所以我们经常迟到。"},{"en":"If she dillydallies, the tickets might sell out.","zh":"如果她再拖拖拉拉，票可能就卖光了。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural noun, informal) small delays or time-wasting actions; unnecessary dawdling.","zh":"（复数名词，非正式）一些小拖延、浪费时间的举动；磨蹭。"},"examples":[{"en":"No more dillydallies—we need to start the meeting now.","zh":"别再磨蹭了——我们得马上开会。"},{"en":"The project fell behind schedule because of constant dillydallies.","zh":"项目因为不断的拖延而落后于计划。"}]}],"synonyms":["dawdles","lingers","procrastinates","wastes time","drags one's feet"],"phonetic":"/ˈdɪliˌdæliz/","extraExplanation":["“dilly-dally”属于英语里常见的叠音/重复构词（像“wishy-washy, zigzag”），语气偏口语、带一点不耐烦或催促的感觉。写作中多用于轻松或对话场景。"]}
{"word":"dillydally","summary":{"en":"“Dillydally” means to delay or waste time by being slow or indecisive.","zh":"“dillydally”指因慢吞吞或犹豫不决而拖延、浪费时间。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to waste time by being slow or indecisive; to delay doing something","zh":"磨磨蹭蹭；拖拖拉拉；因犹豫而耽搁"},"examples":[{"en":"Stop dillydallying and get your shoes on—we’re late.","zh":"别再磨磨蹭蹭了，快穿上鞋——我们要迟到了。"},{"en":"She dillydallied over the decision until the opportunity passed.","zh":"她对这个决定犹豫不决、拖拖拉拉，结果机会就错过了。"}]}],"synonyms":["procrastinate","stall","delay","linger","hesitate"],"phonetic":"/ˈdɪliˌdæli/","extraExplanation":["“dillydally”常带一点轻微责备或打趣的语气，常用于口语或较随意的语境。","它属于“重复式/押韵式”构词（类似 *wishy-washy*），听起来俏皮，因此多用于日常对话，而不是正式写作。"]}
{"word":"dillydallying","summary":{"en":"“Dillydallying” means wasting time or delaying instead of acting.","zh":"“dillydallying”指磨磨蹭蹭、拖拖拉拉，不赶紧行动。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"wasting time or delaying doing something; procrastinating (often in an informal, slightly critical way).","zh":"磨磨蹭蹭、拖拖拉拉；浪费时间、迟迟不做（常带有口语里轻微批评的语气）。"},"examples":[{"en":"Stop dillydallying and finish your homework.","zh":"别再磨磨蹭蹭了，快把作业做完。"},{"en":"We missed the bus because we were dillydallying at the store.","zh":"我们在店里拖拖拉拉，结果错过了公交车。"},{"en":"If you keep dillydallying, the opportunity will pass.","zh":"你要是一直拖拖拉拉，机会就会溜走。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of wasting time; unnecessary delay (used as a gerund).","zh":"磨蹭、拖延的行为（作动名词使用）。"},"examples":[{"en":"There’s no time for dillydallying—let’s go.","zh":"没时间磨蹭了——我们走吧。"},{"en":"His constant dillydallying frustrated the whole team.","zh":"他总是拖拖拉拉，让整个团队都很烦。"}]}],"synonyms":["procrastinating","stalling","dragging one’s feet","dawdling","lingering"],"phonetic":"/ˈdɪliˌdæliɪŋ/","extraExplanation":["“dilly-dally”是比较口语、带点俏皮但也可能略带责备的说法；写作中常见两种拼法：dilly-dallying（带连字符）和dillydallying（不带连字符）。","它属于英语里常见的“重叠词/拟声式”表达（像 higgledy-piggledy、wishy-washy），用重复的节奏来强调“拖拉、磨蹭”的感觉。"]}
{"word":"dillyman","summary":{"en":"“Dillyman” is not a standard English word; it’s usually a misspelling of “deliveryman,” or it may be a rare surname.","zh":"“dillyman”不是标准英语词，通常是把“deliveryman（送货员/快递员）”拼错了；也可能是少见的姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(nonstandard) A misspelling or playful spelling of “deliveryman” (a person whose job is to deliver goods).","zh":"（非标准用法）常见于把“deliveryman”（送货员、快递员）拼错或戏谑式拼写。"},"examples":[{"en":"I think you mean “deliveryman,” not “dillyman.”","zh":"我觉得你想写的是“deliveryman”，不是“dillyman”。"},{"en":"The deliveryman left the package at the front desk.","zh":"送货员把包裹放在前台了。"}]},{"partOfSpeech":"n.","definition":{"en":"A rare surname (family name).","zh":"一个较少见的姓氏。"},"examples":[{"en":"Ms. Dillyman will join us for the meeting.","zh":"Dillyman 女士会参加这次会议。"}]}],"synonyms":["deliveryman","courier","delivery person"],"phonetic":"ˈdɪlimən","extraExplanation":["“dillyman”不是英语里常见的标准词汇；在日常写作、考试或正式场合，建议使用“deliveryman”（也可用更中性的说法“delivery person / courier”）。","如果你是在某本书、歌词或方言语境里看到“dillyman”，可以把原句发我，我能根据上下文判断它是否是特定用法、外号或专有名词。"]}
{"word":"dillymen","summary":{"en":"Dillymen are historical Scottish street vendors (especially in Edinburgh), sometimes used more generally for peddlers.","zh":"dillymen 指历史上苏格兰（尤爱丁堡）的街头小贩，也可少见地泛指流动叫卖者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Scotland, historical) Street vendors (plural of *dillyman*), especially in Edinburgh—hawkers who sold small goods such as sweets (“dillies”), fruit, or snacks in the streets.","zh":"（苏格兰，历史用语）街头小贩（*dillyman* 的复数），尤指爱丁堡一带叫卖小商品的人，如糖果（“dillies”）、水果或零食等。"},"examples":[{"en":"In old Edinburgh, dillymen walked the streets calling out their sweets and fruit.","zh":"在旧时的爱丁堡，dillymen 走街串巷，吆喝着卖糖果和水果。"},{"en":"The song mentions dillymen, a reminder of the city’s street-trade tradition.","zh":"那首歌提到 dillymen，提醒人们这座城市曾有街头买卖的传统。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare, extended) Peddlers or hawkers in general.","zh":"（罕见，引申）泛指走街串巷的叫卖者、小贩。"},"examples":[{"en":"Before supermarkets, people relied on dillymen and other traveling sellers.","zh":"在超市出现之前，人们常靠 dillymen 之类的流动商贩购买日用品。"}]}],"synonyms":["street vendors","hawkers","peddlers"],"phonetic":"/ˈdɪliˌmɛn/","extraExplanation":["“dillyman / dillymen” 多见于苏格兰文化与历史语境，常与爱丁堡的街头叫卖（street cries）联系在一起。","词里的 “dillies” 指一种小糖果/点心（不同地区说法略有差异），所以 dillyman 本质上是“卖小甜食的小贩”。","在民歌/传统歌曲《The Dilly Man》中也能见到这个词，因此它带有一点怀旧、地方风味的色彩。"]}
{"word":"dilo","summary":{"en":"“Dilo” is a Spanish informal command meaning “say it” or “tell (someone).” It can also be a name/nickname.","zh":"“Dilo”是西班牙语的非正式命令式，意思是“说出来/告诉（某人）”；也可能是人名或昵称。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(Spanish, often used in casual speech or in English conversations as a code-switch) “Say it.” / “Tell him/her/them.” It’s the informal command form of the verb “decir” (to say/tell).","zh":"（西班牙语，常见于口语或英西语混用）“说出来。”/“告诉他/她/他们。” 来自动词“decir（说/告诉）”的非正式命令式。"},"examples":[{"en":"If you have something to say, dilo.","zh":"如果你有话要说，就 dilo（说出来）。"},{"en":"Dilo a tu mamá.","zh":"告诉你妈妈。"}]},{"partOfSpeech":"n.","definition":{"en":"A personal name or nickname (e.g., “Dilo”) in some communities; meaning depends on the person/culture.","zh":"人名或昵称（如 Dilo）；具体含义取决于个人或文化背景。"},"examples":[{"en":"Dilo is my cousin’s nickname.","zh":"Dilo 是我表弟的昵称。"}]}],"synonyms":["say it","tell him/her/them","speak up"],"phonetic":"/ˈdiːloʊ/","extraExplanation":["“Dilo”是西班牙语里对“tú（你）”的命令式，所以语气比较直接，常用于熟人之间；在更礼貌的场合常用“diga (usted)”等形式。","严格来说，“dilo”也可能表示“tell it / say it”，而“告诉某人”常见结构是“dilo + a + 人”（例如：dilo a él/ella）。"]}
{"word":"DILOG","summary":{"en":"“DILOG” is usually a misspelling of “dialog” (US) / “dialogue” (UK): a conversation or written lines of conversation; also used as a verb meaning to talk.","zh":"“DILOG”通常是把“dialog”（美式）/“dialogue”（英式）拼错了：指对话/对白；也可作动词表示进行对话。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Not standard) A common misspelling of **dialog** (US spelling of “dialogue”). A **dialog** is a conversation between two or more people, especially in a book, movie, play, or script.","zh":"（非标准）常见的拼写错误，通常指 **dialog**（美式拼写，对应英式 *dialogue*）。**dialog** 指两人或多人之间的对话，尤指书籍、电影、戏剧或剧本中的对白。"},"examples":[{"en":"The movie has natural dialog that sounds like real life.","zh":"这部电影的对白很自然，听起来像真实生活。"},{"en":"Please write a short dialog between a customer and a cashier.","zh":"请写一段顾客和收银员之间的简短对话。"}]},{"partOfSpeech":"v.","definition":{"en":"To have a conversation, especially in a planned or written form (common in computing and scriptwriting contexts).","zh":"（尤用于计算机或剧本语境）进行对话；以对话形式交流（常指有设计、可记录的交流）。"},"examples":[{"en":"The two sides will dialog to resolve the conflict.","zh":"双方将通过对话来解决冲突。"},{"en":"The app dialogs with the user by asking a few questions.","zh":"这个应用通过提问与用户进行交互式对话。"}]}],"synonyms":["conversation","dialogue","exchange","talk"],"phonetic":"/ˈdaɪ.ə.lɔːɡ/","extraExplanation":["“DILOG”本身在英语里不是常见标准词；大多数情况下是把 **dialog** 拼错了。美式英语更常写 **dialog**，英式英语更常写 **dialogue**（意思相同）。","在影视、戏剧、小说等语境中，**dialog/dialogue** 通常指“对白”；在计算机界面中也常说 **a dialog box（对话框）**。"]}
{"word":"dilogarithm","summary":{"en":"Dilogarithm = the polylogarithm function of order 2, written Li₂(x).","zh":"dilogarithm（二对数）= 2阶多对数函数，写作 Li₂(x)。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a special mathematical function (the polylogarithm of order 2), often written as Li₂(x), used in calculus, number theory, and physics.","zh":"一种特殊数学函数（2阶多对数），常写作 Li₂(x)，常用于微积分、数论与物理学。"},"examples":[{"en":"In the paper, the integral is expressed using the dilogarithm Li₂(x).","zh":"在这篇论文中，该积分用二对数函数 Li₂(x) 表示。"},{"en":"The dilogarithm appears in some formulas in quantum field theory.","zh":"二对数函数会出现在量子场论的一些公式中。"}]}],"synonyms":["Spence's function","polylogarithm (order 2)","Li₂(x)"],"phonetic":"/daɪˈlɔɡəˌrɪðəm/","extraExplanation":["“dilogarithm”通常指 \nLi₂(x)=∑_{k=1}^{∞} x^k/k^2（在 |x|≤1 的合适条件下）这一函数，也可通过积分形式定义。","在一些文献里它也叫 Spence’s function（斯宾斯函数）；不同领域对符号与定义的分支（branch）选择可能略有差异。"]}
{"word":"dilogical","summary":{"en":"“Dilogical” is usually a misspelling of “dialogical,” meaning related to or characterized by dialogue and multiple voices.","zh":"“dilogical”多为“dialogical”的误拼，意思是“对话式的/多声部的”，强调交流与多种观点并存。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Usually: dialogical) relating to dialogue or conversation; involving two or more voices or viewpoints.","zh":"（常见拼写：dialogical）与对话/交谈有关的；包含两个或多个声音或观点的（尤用于讨论、教学、文学理论）。"},"examples":[{"en":"A dialogical approach to teaching encourages students to ask questions and discuss ideas.","zh":"对话式的教学方法鼓励学生提问并讨论观点。"},{"en":"The book presents a dialogical relationship between the narrator and the reader.","zh":"这本书呈现了叙述者与读者之间的对话式关系。"}]}],"synonyms":["dialogical","dialogic","conversational","interactive","discursive"],"phonetic":"/ˌdaɪəˈlɑːdʒɪkəl/","extraExplanation":["“dilogical”不是常见标准拼写，通常你想写的是 **dialogical**（或较短的 **dialogic**）。两者都表示“对话的/多声部的”，在教育学、哲学与文学批评中很常见。","在文学理论中（如巴赫金 Bakhtin 的思想），“dialogical”常指多种声音并存、相互回应的文本或话语方式，而不是单一权威声音（monologic）。"]}
{"word":"dilogy","summary":{"en":"Dilogy most commonly means a two-part series (two related works). More rarely, it can mean an expression with a double meaning.","zh":"Dilogy最常指由两部相关作品组成的“两部曲/两部系列”。较少见的用法是指带有双重含义的表达。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a set of two related works (such as two novels or two films) that belong together as a pair; a two-part series","zh":"（两部）成套作品；两部曲（如两本小说或两部电影组成的一组）"},"examples":[{"en":"The story is told as a dilogy: the first film sets up the conflict, and the second resolves it.","zh":"这个故事是一部两部曲：第一部铺垫冲突，第二部解决问题。"},{"en":"She published a dilogy of historical novels following the same family across two generations.","zh":"她出版了一套两部曲历史小说，描写同一家族跨越两代人的经历。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) an expression or statement with two meanings; double meaning","zh":"（罕见）双重含义的表达；一语双关"},"examples":[{"en":"In the poem, one line works as a dilogy, sounding innocent but hinting at something else.","zh":"在这首诗里，有一句话带有双关，表面天真却暗示了别的意思。"},{"en":"Some jokes rely on dilogy to create humor.","zh":"有些笑话靠双关（双重含义）来制造幽默。"}]}],"synonyms":["duology","two-part series","pair","double meaning (rare sense)","pun (related)"],"phonetic":"/ˈdaɪlədʒi/","extraExplanation":["“dilogy”由前缀 di-（二、双）+ -logy（言说、论述）构成。现代更常见的说法是“duology”，尤其在电影/小说系列的语境里；“dilogy”也能用，但相对少见，常见于粉丝讨论或非正式写作。","第二个义项（“双重含义”）在现代英语中较少用；更常用的相关词包括“double meaning”“pun”“double entendre”（后者往往带有暧昧/性暗示的语气）。"]}
{"word":"Dilolo","summary":{"en":"“Dilolo” is usually a proper name (often a place name, especially in the DRC), not a standard English vocabulary word.","zh":"“Dilolo”通常是专有名词（常见为地名，尤其与刚果（金）有关），不是标准的英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proper name used for places and people; most commonly, Dilolo is a town/territory name in the Democratic Republic of the Congo (DRC).","zh":"一个专有名词，可用作地名或人名；最常见的是指刚果民主共和国（刚果（金））的一个城镇/地区名 Dilolo。"},"examples":[{"en":"Dilolo is located in the southwestern part of the DRC, near the Angola border.","zh":"Dilolo 位于刚果（金）西南部，靠近安哥拉边境。"},{"en":"She grew up in Dilolo before moving to the capital.","zh":"她在 Dilolo 长大，后来搬到首都。"}]}],"phonetic":"/diˈloʊloʊ/","extraExplanation":["“Dilolo”并不是常见的英语词汇，更多时候会以专有名词出现（例如地名）。如果你是在文章、歌曲、游戏或社交媒体里看到的，它也可能是人名/昵称或品牌名。","发音会因当地语言或个人习惯而变化；英语里读作 /diˈloʊloʊ/ 只是一个常见的近似读法。","如果你能提供你看到“Dilolo”的句子或出处（国家、主题、链接/截图），我可以更准确地解释它在那个语境中的含义。"]}
{"word":"dilos","summary":{"en":"“Dilos” is usually Spanish for “tell them,” not a standard English word; it can also be a rare proper name depending on context.","zh":"“Dilos” 通常是西班牙语“告诉他们”，不属于标准英语词；也可能在特定语境中作少见的专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not an English word in standard dictionaries; most commonly it is Spanish “dilos,” meaning “tell them.”","zh":"标准英语词典中一般不收录；最常见的来源是西班牙语 “dilos”，意思是“告诉他们/把这话告诉他们”。"},"examples":[{"en":"If you meant Spanish: “Dilos la verdad.” (= Tell them the truth.)","zh":"如果你想表达西班牙语： “Dilos la verdad.”（= 告诉他们真相。）"},{"en":"“Dilos” in Spanish is used when you are speaking to one person and telling them to say something to a group.","zh":"西语里 “dilos” 用于你对“一个人”下命令，让他/她把话转告给“一群人”。"}]},{"partOfSpeech":"n.","definition":{"en":"A rare proper name (e.g., a brand, username, or place name) depending on context.","zh":"少见的专有名词（例如品牌名、用户名或地名），具体含义取决于语境。"},"examples":[{"en":"I saw “Dilos” as a username online.","zh":"我在网上看到有人用 “Dilos” 当用户名。"}]}],"synonyms":["(Spanish) tell them","(Spanish) say it to them"],"phonetic":"ˈdiːloʊs","extraExplanation":["如果你本来想查的是英语单词，可能是拼写听错/打错了。常见接近的英语词包括：\n1) “dillos” = armadillos 的口语缩写（指“犰狳”），例如：“We saw some dillos on the road.”\n2) 也可能是某个专有名词（游戏/软件/品牌）。\n把你看到它的完整句子发我，我可以帮你判断到底是哪一个。"]}
{"word":"Dilthey","summary":{"en":"Dilthey usually refers to the German philosopher Wilhelm Dilthey and, by extension, his ideas about understanding human life and culture.","zh":"Dilthey通常指德国哲学家威廉·狄尔泰，也可引申指他的思想：用“理解/诠释”来研究人的生活与文化。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Wilhelm Dilthey (1833–1911), a German philosopher and historian of ideas known for emphasizing the study of lived experience and for developing methods for understanding human life and culture (the humanities).","zh":"威廉·狄尔泰（1833–1911），德国哲学家与思想史学者，以强调“生活经验”（lived experience）以及为人文学科提出“理解/诠释”的研究方法而著名。"},"examples":[{"en":"In class we read Dilthey to compare explanation in science with understanding in the humanities.","zh":"课上我们读狄尔泰，用来比较自然科学的“解释”和人文学科的“理解”。"},{"en":"Dilthey argued that history and culture should be interpreted from within lived experience.","zh":"狄尔泰认为，对历史与文化的研究应从人的生活经验内部来加以诠释。"}]},{"partOfSpeech":"n.","definition":{"en":"Dilthey’s approach or ideas, especially his views on interpretation (hermeneutics) and the human sciences.","zh":"（泛指）狄尔泰的理论/方法，尤其是他关于“诠释学”与“人文科学”的观点。"},"examples":[{"en":"Her paper uses a Dilthey-inspired method to interpret personal letters.","zh":"她的论文借鉴狄尔泰式的方法来解读私人书信。"},{"en":"Some researchers criticize Dilthey for drawing too sharp a line between natural science and the humanities.","zh":"一些研究者批评狄尔泰把自然科学与人文学科的界限划得过于分明。"}]}],"synonyms":["Wilhelm Dilthey"],"phonetic":"ˈdɪltaɪ","extraExplanation":["“Dilthey”在英语里通常指德国学者Wilhelm Dilthey，中文常译作“狄尔泰”。在学术语境中，他常与“hermeneutics（诠释学）”“lived experience（生活经验）”“human sciences/humanities（人文科学/人文学科）”等概念一起出现。","常见用法：直接用姓氏作主语（Dilthey argues…），或作定语（Dilthey’s theory / a Dilthey-inspired approach）。"]}
{"word":"dilucid","summary":{"en":"Dilucid means “very clear and easy to understand,” but it is extremely rare in modern English.","zh":"dilucid 意为“非常清晰、易懂”，但在现代英语中极其罕见。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Very rare) clear and easy to understand; lucid.","zh":"（非常罕见）清晰的；易懂的；明白的。"},"examples":[{"en":"Her explanation was dilucid, so everyone understood the main point quickly.","zh":"她的解释很清晰，所以大家很快就明白了要点。"},{"en":"The report uses dilucid language instead of technical jargon.","zh":"这份报告用清楚易懂的语言，而不是技术术语。"}]}],"synonyms":["lucid","clear","plain","intelligible","transparent"],"phonetic":"/daɪˈluːsɪd/","extraExplanation":["“dilucid”在现代英语中非常少见，更常用的词是“lucid”（清晰的）或动词“elucidate”（阐明、解释清楚）。","词形上它和“lucid”同源（都来自拉丁语中表示“光、明亮”的词根），所以含义也与“清楚、明白”相关。写作时一般建议用更常见的“lucid / clear”。"]}
{"word":"dilucidate","summary":{"en":"Dilucidate means to explain something so it becomes clear (a rare/formal synonym of “elucidate”).","zh":"Dilucidate 指“把事情解释清楚、阐明”（较少用、较正式，相当于 elucidate）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something clear by explaining it; to clarify (a formal or rare word).","zh":"通过解释使某事变清楚；阐明、澄清（较正式且少用的词）。"},"examples":[{"en":"Could you dilucidate what you mean by “sustainable growth” in this report?","zh":"你能阐明一下这份报告里“可持续增长”具体指什么吗？"},{"en":"The professor dilucidated the theory with a simple diagram.","zh":"教授用一张简单的示意图把该理论讲清楚了。"}]}],"synonyms":["elucidate","clarify","explain","make clear","spell out"],"phonetic":"/daɪˈluːsɪˌdeɪt/","extraExplanation":["“dilucidate”在现代英语中非常少见，通常用更常见的“elucidate / clarify / explain”来表达同样意思。你在学术写作或正式场合看到它时，可以把它理解为“把意思讲明白”。","词源上与拉丁语中表示“清楚、光明”的词根有关，因此带有“把原本模糊的内容照亮、说清”的意味。"]}
{"word":"diluendo","summary":{"en":"“Diluendo” is not standard English; you probably mean “innuendo” or (for dilution) “diluent/dilute.”","zh":"“diluendo”不是标准英语；你可能想写“innuendo”，或与“diluent/dilute（稀释相关）”混淆。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a misspelling of “innuendo” (an indirect, often slightly rude suggestion) or confusion with “diluent” (a liquid used to dilute something).","zh":"不是标准英语单词；很可能是把“innuendo”（含沙射影、常带轻微猥亵或不礼貌的暗示）拼错了，或与“diluent”（稀释剂）混淆了。"},"examples":[{"en":"I couldn’t find “diluendo” in an English dictionary—did you mean “innuendo”?","zh":"我在英语词典里找不到“diluendo”——你是不是想写“innuendo”？"},{"en":"Her comment was full of innuendo, so he felt uncomfortable.","zh":"她的话充满含沙射影，所以他觉得不舒服。"}]}],"synonyms":["innuendo","implication","suggestion","hint"],"phonetic":"/ˌdɪluˈɛndoʊ/","extraExplanation":["“innuendo”更常见于日常口语、新闻评论、影视对白里，通常指“拐弯抹角的暗示”，尤其是带性暗示或影射他人的不当内容。正式写作中，如果你想表达更中性的“暗示/言外之意”，也可以考虑用“implication”或“suggestion”。","如果你是想表达“稀释/把液体冲淡”，相关词是：动词“dilute”，名词“dilution”，名词“diluent（稀释剂）”。"]}
{"word":"diluent","summary":{"en":"A diluent is a substance—usually a liquid—added to reduce the concentration of another substance, especially in lab or medical contexts.","zh":"diluent 指（通常为液体的）稀释剂/稀释液，用来降低另一种物质的浓度，常见于实验室或医疗配药语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a liquid (or sometimes a gas) used to make another substance less concentrated by mixing with it","zh":"稀释剂；（有时也指气体）用来把另一种物质混合稀释、降低浓度的液体"},"examples":[{"en":"Add the diluent slowly to avoid changing the concentration too quickly.","zh":"慢慢加入稀释剂，避免浓度变化过快。"},{"en":"In the lab, water is a common diluent for many solutions.","zh":"在实验室里，水是许多溶液常用的稀释剂。"}]},{"partOfSpeech":"n.","definition":{"en":"(medicine/pharmacy) the liquid used to dilute a drug before injection or use","zh":"（医药/药学）用于在注射或使用前稀释药物的液体（如生理盐水等）"},"examples":[{"en":"The nurse prepared the medication with the recommended diluent.","zh":"护士用推荐的稀释液配制了药物。"},{"en":"Always check the label to confirm which diluent should be used.","zh":"一定要查看标签，确认应使用哪种稀释液。"}]}],"synonyms":["thinner","diluting agent","solvent (in some contexts)","carrier (in some medical contexts)"],"phonetic":"/ˈdaɪluənt/","extraExplanation":["词根提示：dilute（稀释）+ -ent（表示“……物/剂”）。因此 diluent 就是“用来稀释的东西”。","使用场景上，diluent 常见于化学、实验室、医疗配药等正式语境；日常英语里更常说 “water/solvent to dilute it（用水/溶剂稀释）”。"]}
{"word":"diluents","summary":{"en":"“Diluents” means substances added to make something less concentrated (plural of “diluent”).","zh":"“diluents”指用于降低浓度、使之变稀的物质（“diluent”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A substance (often a liquid) added to another to make it thinner, weaker, or less concentrated.","zh":"稀释剂；稀释液（常为液体），加入另一种物质中以使其变稀、变弱或降低浓度。"},"examples":[{"en":"Add the diluent slowly to dilute the medication to the right strength.","zh":"慢慢加入稀释液，把药物稀释到合适的浓度。"},{"en":"In the lab, water is a common diluent for many solutions.","zh":"在实验室里，水是许多溶液常用的稀释剂。"}]}],"synonyms":["thinner","diluter","diluting agent"],"phonetic":"/ˈdɪl.ju.ənts/","extraExplanation":["“diluents”是名词复数形式；单数是“diluent”。在医学、化学、绘画/油漆与香精等领域都常见：例如注射用药的稀释液、溶剂型产品的稀释剂等。","相关词：dilute（v. 稀释；adj. 稀薄的/稀释的）、dilution（n. 稀释；稀释度）。注意“diluent”强调“用于稀释的添加物”，而“solvent（溶剂）”更强调“能溶解其他物质的液体”，两者有时重叠但不完全相同。"]}
{"word":"dilutable","summary":{"en":"Dilutable means “can be made less concentrated by adding liquid (often water).”","zh":"Dilutable 指“可通过加入液体（常为水）来稀释、降低浓度的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be diluted (made weaker or less concentrated) by adding a liquid, usually water.","zh":"可稀释的；可通过加入液体（通常是水）来降低浓度或强度的。"},"examples":[{"en":"This paint is dilutable with water, so you can adjust the thickness easily.","zh":"这种油漆可以用水稀释，所以你能很容易调节它的稠度。"},{"en":"Check the label to see whether the cleaner is dilutable before mixing it.","zh":"混合前先看标签，确认这种清洁剂是否可稀释。"}]}],"synonyms":["diluteable","mixable (with water)","water-soluble (in some contexts)"],"phonetic":"/ˈdaɪljəˌtəbəl/","extraExplanation":["“dilutable”常见于说明书、实验室或产品标签（如清洁剂、药水、油漆、染料）。它强调“性质上可以被稀释”，而不是已经稀释。","常见搭配：dilutable with water（可用水稀释）、dilutable solution（可稀释溶液）。与之相关的名词是 diluent（稀释剂），动词是 dilute（稀释）。"]}
{"word":"dilutant","summary":{"en":"A dilutant is a substance added to make something less concentrated (often called a diluent).","zh":"dilutant 指“稀释剂”，即加入后使某物浓度降低的物质（更常见说法是 diluent）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A substance (usually a liquid or solvent) added to another substance to make it less concentrated; a diluting agent.","zh":"稀释剂；用于降低另一种物质浓度的物质（通常是液体或溶剂）。"},"examples":[{"en":"Water is a common dilutant used to reduce the strength of cleaning solutions.","zh":"水是一种常见的稀释剂，用来降低清洁剂溶液的浓度。"},{"en":"The lab technician added a dilutant to bring the sample to the required concentration.","zh":"实验技术员加入稀释剂，使样品达到所需浓度。"}]},{"partOfSpeech":"n.","definition":{"en":"Something that reduces the purity, strength, or intensity of something else (less common, more general use).","zh":"（较少见、更泛指）削弱某物纯度、强度或效果的因素/东西。"},"examples":[{"en":"In his view, commercial pressure was a dilutant of artistic freedom.","zh":"在他看来，商业压力是对艺术自由的削弱因素。"}]}],"synonyms":["diluent","solvent","thinner","cutting agent"],"phonetic":"/daɪˈluːtənt/","extraExplanation":["“dilutant”主要出现在化学、药剂学、实验室配制等语境中，强调“加入后使浓度降低的添加物”。日常英语里更常用的说法是“diluent（稀释剂）”或直接说“a solvent used to dilute”。因此在写作或口语中，很多场合用“diluent”会更自然、更常见。"]}
{"word":"dilute","summary":{"en":"Dilute means to make something weaker or less concentrated, especially by adding water; it can also mean to weaken an idea or influence.","zh":"Dilute 指通过加水等使液体变稀、浓度降低；也可指在抽象意义上“削弱、冲淡”观点或影响。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make a liquid weaker by adding water or another liquid; to reduce the strength or concentration","zh":"（通过加水或其他液体）稀释；降低浓度或强度"},"examples":[{"en":"Dilute the juice with water if it tastes too strong.","zh":"如果果汁味道太浓，可以加水稀释。"},{"en":"This cleaner must be diluted before use.","zh":"这种清洁剂使用前必须稀释。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something less strong, effective, or pure (often an idea, policy, or influence)","zh":"（使想法、政策、影响等）削弱；冲淡；降低效果或纯度"},"examples":[{"en":"They worried the new rules would dilute the company’s culture.","zh":"他们担心新规定会冲淡公司的文化。"},{"en":"Adding too many details can dilute your main message.","zh":"加入太多细节可能会削弱你的核心信息。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become weaker or less concentrated","zh":"变稀；变淡；（浓度或强度）降低"},"examples":[{"en":"The color will dilute as you add more water.","zh":"你加更多水后，颜色会变淡。"}]},{"partOfSpeech":"adj.","definition":{"en":"made weaker by adding liquid; not concentrated","zh":"稀释的；稀薄的；不浓的"},"examples":[{"en":"The soup was too dilute, so we cooked it longer.","zh":"汤太稀了，所以我们多煮了一会儿。"}]}],"synonyms":["water down","thin","weaken","reduce","attenuate"],"phonetic":"/daɪˈluːt/","extraExplanation":["“dilute”既可用于化学/饮食语境（把液体变稀），也常用于抽象语境（冲淡、削弱影响力或重点）。学习时可记：液体=稀释；观点/文化/信息=削弱、冲淡。","词源来自拉丁语前缀“di-”（分开）+“luere”（洗），原意接近“把东西洗开/冲开”，所以引申为“变稀、变弱”。"]}
{"word":"dilute sth. with ...","summary":{"en":"make something less concentrated by adding liquid","zh":"通过加入液体使浓度降低、变稀"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to make a liquid weaker or less concentrated by adding another liquid (usually water)","zh":"用另一种液体（通常是水）把某物稀释，使浓度变低"},"examples":[{"en":"Dilute the juice with water before giving it to the baby.","zh":"在给宝宝喝之前，用水把果汁稀释一下。"},{"en":"This cleaner is too strong—dilute it with warm water.","zh":"这个清洁剂太浓了——用温水把它稀释。"},{"en":"The dye should be diluted with water to get a lighter color.","zh":"染料需要用水稀释，才能得到更浅的颜色。"}]}],"synonyms":["thin","water down","weaken","cut"],"phonetic":"/daɪˈluːt/","extraExplanation":["结构提示：dilute + 物(thing) + with + 加入的液体。thing 是被稀释的对象，with 后面是用来稀释的东西（最常见是 water）。","对比：dilute A with B（用B稀释A）≈ dilute A by adding B（通过加入B稀释A）。注意不要和“mix A with B（把A和B混合）”混淆：dilute 强调“变淡/变稀”。"],"etymology":"来自拉丁语 diluere，意为“冲洗、稀释”；词根含义与“洗开/冲开”有关，后来引申为“降低浓度、冲淡”。","mnemonic":["联想“di- + lute”：lute 可联想到“稀”的感觉；dilute 就是“把浓的弄稀”。","记搭配：dilute sth. with water（最典型场景：果汁、清洁剂、染料、酒精溶液等）"]}
{"word":"dilute the return on investments","summary":{"en":"make investment gains smaller or less effective","zh":"使投资收益变少或效果变弱"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to make the profits (or effectiveness) of an investment smaller, usually by spreading gains across more shares, adding extra costs, or reducing the percentage ownership","zh":"使投资回报变少（或变弱），通常因为收益被更多股份“摊薄”、增加额外成本，或持股比例下降"},"examples":[{"en":"Issuing new shares can dilute the return on investments for existing shareholders.","zh":"增发新股可能会稀释现有股东的投资回报。"},{"en":"High management fees may dilute the return on investments over time.","zh":"较高的管理费会随着时间推移稀释投资回报。"},{"en":"Inflation can dilute the return on investments if wages and prices rise faster than your portfolio grows.","zh":"如果工资和物价上涨快于你的投资组合增长，通货膨胀会稀释你的投资回报。"}]}],"synonyms":["reduce returns","erode returns","diminish returns","lower returns","cut into returns","weaken returns","dilute gains"],"phonetic":"/daɪˈlut ðə rɪˈtɝn ɑn ɪnˈvɛstmənts/","extraExplanation":["金融里“dilute（稀释/摊薄）”常见两种：①股权稀释（公司增发新股，你的持股比例下降）；②收益稀释（利润被更多股份分摊，导致每股收益EPS下降），从而让你的回报看起来变小。","它并不一定表示总利润减少；有时是“分母变大”，你的“每份/每股”回报变小。"],"etymology":"“dilute”源自拉丁语前缀 di-（分开）+ lutus（洗，和 lavare“洗”相关），原意偏向“用水冲淡/稀释”。后来引申为“使强度、浓度、价值变弱”，金融语境里进一步发展为“摊薄/稀释收益或股权”。","mnemonic":["把 dilute 想成“加水稀释饮料”→味道变淡；投资回报被“加水”一样冲淡，收益变薄。","联想中文“稀释=变稀变淡”；投资语境就等于“回报被稀释/摊薄”。"]}
{"word":"dilute with","summary":{"en":"make something less concentrated or less strong by adding another substance","zh":"通过加入其他物质使浓度或强度降低"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to make a liquid less concentrated by adding another liquid (often water)","zh":"用另一种液体（常为水）把液体稀释、降低浓度"},"examples":[{"en":"Dilute the juice with water before giving it to the kids.","zh":"给孩子喝之前，把果汁用水稀释一下。"},{"en":"This cleaner is strong, so dilute it with warm water.","zh":"这个清洁剂很浓，需要用温水稀释。"},{"en":"She diluted the paint with a little water so it would spread more easily.","zh":"她用一点水稀释了颜料，让它更容易涂开。"}]},{"partOfSpeech":"phrase","definition":{"en":"to weaken an effect, quality, or strength by mixing in something else","zh":"通过加入别的东西来削弱（效果、品质或力度）"},"examples":[{"en":"The main message was diluted with too many side stories.","zh":"主旨被太多支线故事冲淡了。"},{"en":"Adding extra rules can dilute with bureaucracy and slow the team down.","zh":"增加额外规则会被官僚流程拖累，从而削弱效率。"}]}],"synonyms":["thin out","water down","cut with","weaken","tone down"],"phonetic":"/daɪˈlut/","extraExplanation":["常见结构：dilute A with B（用B稀释A/用B把A冲淡）。例如 dilute juice with water（用水稀释果汁）。","也可见：dilute A in B（把A溶/稀释在B中，强调“在…中”）。例如 dilute the powder in water（把粉末溶在水里）。","比喻义中，dilute with 后面常接“干扰因素/杂质/多余信息”等，表达“冲淡、削弱”。"],"etymology":"dilute 来自拉丁语 dilutus，意为“冲淡、稀释”，由 dis-（分开、散开）+ lavare（洗）相关词根演变而来，后来在英语中稳定为“使浓度降低/使变弱”。","mnemonic":["di- 可联想“低/降低”，dilute = 让浓度“低”下来。","把 dilute 想成“滴+露特”：加点水滴（滴水）进去，味道就被“稀释”了。"]}
{"word":"diluted","summary":{"en":"“Diluted” means made less strong or less concentrated (literally in liquids, or figuratively in meaning/effect).","zh":"“diluted”表示“被稀释的、变淡变弱的”，既可指液体稀释，也可比喻含义/效果被冲淡。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Mixed with water or another liquid so it becomes weaker, less concentrated, or less strong.","zh":"（液体）被稀释的；被加水或与其他液体混合后变得不那么浓、不那么强。"},"examples":[{"en":"This juice is too sweet—let’s drink it diluted with water.","zh":"这果汁太甜了——我们加点水稀释后再喝。"},{"en":"The hospital uses diluted bleach to disinfect surfaces.","zh":"医院用稀释后的漂白水来给表面消毒。"}]},{"partOfSpeech":"adj.","definition":{"en":"Reduced in strength, effectiveness, value, or meaning (not only about liquids).","zh":"（比喻）被削弱的；（力量、效果、价值或含义）被冲淡的。"},"examples":[{"en":"The original message was diluted as it passed from person to person.","zh":"这条原本的信息在人传人过程中被传得走样、含义被冲淡了。"},{"en":"Some fans felt the new policy diluted the team’s tradition.","zh":"一些粉丝觉得新政策冲淡了球队的传统。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “dilute”: to make something less concentrated or less strong by adding another substance (often water).","zh":"“dilute”的过去式/过去分词：通过加入另一种物质（常为水）使……变稀、变淡、变弱。"},"examples":[{"en":"She diluted the paint so it would spread more smoothly.","zh":"她把油漆稀释了一下，这样刷起来更顺滑。"},{"en":"The solution was diluted before the experiment began.","zh":"实验开始前，溶液已被稀释。"}]}],"synonyms":["watered-down","weakened","thinned","cut","attenuated"],"phonetic":"/daɪˈluːtɪd/","extraExplanation":["“diluted”常见两种用法：①形容词（diluted coffee 稀释的咖啡）；②动词过去分词（was diluted 被稀释）。写作中如果强调“被动结果”，常用“be + diluted”。","比喻用法很常见：diluted meaning（含义被冲淡/被弱化）、diluted influence（影响力被稀释）。这种用法表达“原本的力量不如从前”。"]}
{"word":"dilutedly","summary":{"en":"“Dilutedly” means “in a weakened or diluted way,” though it is relatively rare in everyday English.","zh":"“dilutedly”表示“以稀释/减弱的方式”，但在日常英语中相对少见。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a diluted or weakened way; not in a concentrated, strong, or pure form.","zh":"以稀释的、减弱的方式；不是浓烈、强或纯的状态。"},"examples":[{"en":"The juice was dilutedly flavored, so it tasted more like water than fruit.","zh":"这果汁味道很淡，喝起来更像水而不是水果。"},{"en":"He expressed his anger dilutedly, trying not to upset anyone.","zh":"他把愤怒表达得很克制、很淡，尽量不让任何人不开心。"}]}],"synonyms":["weakly","faintly","in a diluted way","in diluted form"],"phonetic":"/daɪˈluːtɪdli/","extraExplanation":["“dilutedly”在现代英语里不太常见；更自然的说法通常是用短语：in a diluted way / in diluted form，或直接用形容词：a diluted flavor（稀淡的味道）。","它由形容词 diluted（稀释的、减弱的）加副词后缀 -ly 构成，用来描述“做某事的方式”或“呈现出来的程度被冲淡了”。在情感、观点、风格等抽象语境中也可以用来表示“被弱化/被冲淡地”。"]}
{"word":"dilutedness","summary":{"en":"Dilutedness means the quality of being diluted—less concentrated or less strong.","zh":"Dilutedness 指“被稀释的程度/状态”，即浓度或强度变弱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being diluted (made weaker, thinner, or less concentrated by adding something such as water); lack of strength or intensity","zh":"被稀释的状态或性质（通过加入水等使浓度变低、强度变弱）；不够浓/不够强的程度"},"examples":[{"en":"The dilutedness of the juice made it taste watery.","zh":"果汁被稀释得太厉害，喝起来像水。"},{"en":"Critics complained about the dilutedness of the new version of the story.","zh":"评论者抱怨新版故事被“淡化”了，力度不如从前。"}]}],"synonyms":["dilution","weakness","thinness","wateriness","lack of concentration"],"phonetic":"/daɪˈluːtɪdnəs/","extraExplanation":["“dilutedness”来自动词 dilute（稀释、削弱）+ 名词后缀 -ness（表示“……的状态/性质”）。在日常英语中更常用的说法是 dilution（稀释；削弱）或 the degree of dilution（稀释程度）。在比喻用法里，它也可以指“观点、情感、风格被削弱/冲淡”。"]}
{"word":"dilutee","summary":{"en":"A rare technical noun meaning the substance/solution being diluted.","zh":"一个少见的技术名词：指“被稀释的物质/溶液”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, technical) A substance or solution that is being diluted (the material that receives the diluent, such as water).","zh":"（少见/技术用语）被稀释的物质或溶液（加入稀释剂，如水，所要“被稀释”的那部分）。"},"examples":[{"en":"Add water as the diluent, and the concentrated juice is the dilutee.","zh":"加入水作为稀释剂，而浓缩果汁就是被稀释物（dilutee）。"},{"en":"In this experiment, the acid solution is the dilutee and water is the diluent.","zh":"在这个实验中，酸溶液是被稀释物（dilutee），水是稀释剂（diluent）。"}]}],"synonyms":["solution being diluted","substance being diluted"],"phonetic":"/daɪˈluːtiː/","extraExplanation":["“dilutee”由动词 dilut(e)（稀释）加后缀 -ee 组成，-ee 常表示“动作的承受者/被作用者”（如 employee 被雇用的人、trainee 受训者）。因此 dilutee 就是“被稀释的对象”。","这个词在日常英语中非常少见；更常见的说法是用 “the solution being diluted / the substance being diluted（正在被稀释的溶液/物质）”。在化学语境里也常用 “solute（溶质）/ solution（溶液）/ diluent（稀释剂）” 来描述体系。"]}
{"word":"dilutely","summary":{"en":"“Dilutely” means “in a diluted (not concentrated) way,” but it’s uncommon in everyday English.","zh":"“dilutely”表示“以稀释（不浓）的方式”，但在日常英语中较少使用。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a diluted or weakened way; not concentrated.","zh":"以稀释的方式；（浓度）不高、被削弱地。"},"examples":[{"en":"Add the bleach dilutely so it doesn’t damage the fabric.","zh":"把漂白剂稀释后再少量加入，这样就不容易伤到布料。"},{"en":"The medicine should be taken dilutely in water, not straight.","zh":"这种药应稀释在水里服用，不要直接喝原液。"}]}],"synonyms":["in a diluted way","in diluted form","weakly"],"phonetic":"/daɪˈluːtli/","extraExplanation":["“dilutely”这个副词在现代英语里比较少见。日常更常用的表达是：“in a diluted form / in diluted solution / in a diluted way”，或者直接用形容词“dilute / diluted”来改写句子（如：Use a diluted solution. 使用稀释液）。"]}
{"word":"diluteness","summary":{"en":"Diluteness means the state of being diluted or weak/thin, in liquids or in a figurative sense (e.g., a weak argument).","zh":"Diluteness 指“被稀释而变稀、变淡、变弱”的状态，可指液体，也可比喻论点或内容力度不足。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being dilute (mixed with a lot of liquid or spread thin), so it becomes weaker in strength, color, taste, or effect","zh":"稀释（变稀、变淡）的状态或性质；因混入较多液体或被稀薄分散而导致强度、颜色、味道或效果变弱"},"examples":[{"en":"The diluteness of the soup made it taste bland.","zh":"汤太稀了，所以尝起来很淡。"},{"en":"You can see the diluteness of the ink in the lighter color of the writing.","zh":"从字迹颜色变浅可以看出墨水被稀释了。"},{"en":"Some critics complained about the diluteness of the argument—it lacked clear evidence.","zh":"一些评论者抱怨这套论证“稀薄无力”，缺少明确证据。"}]}],"synonyms":["dilution","thinness","weakness","watery quality"],"phonetic":"/daɪˈluːtnəs/","extraExplanation":["“diluteness”在现代英语里相对少见，更常用的名词是“dilution”（稀释；稀释过程）或表达“be too dilute / watery”。在写作中，“diluteness”也可比喻内容或观点“被冲淡、缺乏力度”。"]}
{"word":"dilutent","summary":{"en":"A diluent is something added to make a mixture less concentrated (often water or another solvent).","zh":"diluent 指“稀释剂”，即加入某物以降低其浓度的物质（常为水或其他溶剂）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A liquid (or sometimes a gas) added to another substance to make it less concentrated; a thinner.","zh":"稀释剂；用于加入另一种物质以降低浓度的液体（有时也可为气体），起“变稀/变淡”作用的物质。"},"examples":[{"en":"Add the diluent slowly to reach the desired concentration.","zh":"慢慢加入稀释剂，以达到所需浓度。"},{"en":"Water is the most common diluent in many laboratory solutions.","zh":"在许多实验室溶液中，水是最常见的稀释剂。"},{"en":"The instructions say to mix the vaccine with its diluent before use.","zh":"说明书写明：疫苗使用前要与其稀释剂混合。"}]}],"synonyms":["thinner","solvent","diluting agent"],"phonetic":"/ˈdɪl.u.ənt/","extraExplanation":["你写的 **dilutent** 常见为拼写误差；标准拼写通常是 **diluent**（稀释剂）。","**diluent** 多用于实验室、药品/疫苗配制、化学工业等语境；日常英语更常说 **thinner**（涂料稀释剂）或直接说 “add water/solvent to dilute it”。","词根提示：来自拉丁语词根 *diluere*（to dilute，稀释）。与动词 **dilute**（稀释）同源。"]}
{"word":"diluter","summary":{"en":"A diluter is something or someone that reduces the strength or concentration of a substance by adding another substance.","zh":"diluter 指通过加入其他物质来降低某物浓度或强度的“稀释者/稀释器/稀释剂”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person, tool, or substance that dilutes something (makes it weaker, thinner, or less concentrated by adding another substance, usually water or a solvent)","zh":"稀释者；稀释器；稀释剂（指人、工具或物质，通过加入另一种物质——通常是水或溶剂——使某物变淡、变稀或降低浓度）"},"examples":[{"en":"Water is the most common diluter for many household cleaners.","zh":"对许多家用清洁剂来说，水是最常见的稀释剂。"},{"en":"The lab uses a special diluter to prepare accurate test solutions.","zh":"实验室使用一种专用稀释器来配制精确的测试溶液。"},{"en":"In the recipe, milk acts as a diluter to soften the strong flavor.","zh":"在这个食谱里，牛奶起到稀释作用，让味道不那么浓。"}]}],"synonyms":["diluting agent","thinner","solvent","cutting agent"],"phonetic":"/daɪˈluːtər/","extraExplanation":["“diluter”多用于化学、医学检验、实验室或工业配液等语境，强调“用于稀释的东西/设备”。在日常英语里，更常见的说法是“a diluting agent（稀释剂）”或直接说“water/solvent to dilute it（用水/溶剂稀释）”。"]}
{"word":"diluters","summary":{"en":"“Diluters” are things or people that dilute—making something less concentrated or less strong.","zh":"“Diluters”指能“稀释/冲淡”的人或物，使某物浓度或强度降低。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People, substances, or devices that make something weaker, less concentrated, or less intense by adding another material (often a liquid).","zh":"稀释者；稀释物；稀释装置：通过加入其他物质（常见为液体）使某物变得更稀、更不浓或强度更低的人、物或设备。"},"examples":[{"en":"Water is the most common diluter for juice concentrate.","zh":"水是果汁浓缩液最常见的稀释剂。"},{"en":"In the lab, use the recommended diluters to reach the correct concentration.","zh":"在实验室里，使用推荐的稀释剂以达到正确的浓度。"},{"en":"Some critics say constant notifications are diluters of attention.","zh":"一些评论者认为不断的通知会稀释（削弱）注意力。"}]}],"synonyms":["thinners","diluents","diluting agents","weakeners"],"phonetic":"/daɪˈluːtərz/","extraExplanation":["“diluters”是名词复数，单数是“diluter”。它来自动词“dilute”（稀释、冲淡）。在科学/医疗语境里常指“稀释剂”（例如把药物或试剂调到目标浓度的液体）；在比喻用法里也可指“削弱某种力量或品质的因素”（如稀释注意力、稀释品牌形象）。"]}
{"word":"dilutes","summary":{"en":"“Dilutes” means makes something less concentrated (especially by adding liquid) or weakens its strength/effect; it can also mean becomes less concentrated.","zh":"“dilutes”表示把某物稀释（尤其通过加水等液体）或削弱其力量/效果；也可表示某物变得不那么浓。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(vt.) To make a liquid weaker or less concentrated by adding water or another solvent.","zh":"（及物动词）通过加入水或其他溶剂，使液体变淡、稀释、降低浓度。"},"examples":[{"en":"She dilutes the juice with water for the kids.","zh":"她给孩子们把果汁加水稀释。"},{"en":"The pharmacist dilutes the medicine before it’s used.","zh":"药剂师在使用前会把药物稀释。"}]},{"partOfSpeech":"vt.","definition":{"en":"(vt.) To weaken the strength, effect, or quality of something (often an idea, policy, or message).","zh":"（及物动词）削弱某事物的力量、效果或质量（常指观点、政策或信息）。"},"examples":[{"en":"Adding too many details dilutes the main message.","zh":"加太多细节会冲淡主要信息。"},{"en":"The new rules may dilute the impact of the original policy.","zh":"新规定可能会削弱原政策的效果。"}]},{"partOfSpeech":"vi.","definition":{"en":"(vi.) To become weaker or less concentrated.","zh":"（不及物动词）变稀、变淡；浓度降低。"},"examples":[{"en":"The color dilutes as you add more water.","zh":"你加更多水，颜色就会变淡。"}]}],"synonyms":["thin","water down","weaken","reduce","diminish"],"phonetic":"/daɪˈluːts/","extraExplanation":["“dilutes”是动词“dilute”的第三人称单数形式（he/she/it dilutes）。常见搭配：dilute A with B（用B稀释A）；dilute the impact/message（削弱影响/信息）。"]}
{"word":"diluting","summary":{"en":"“Diluting” means making a liquid less concentrated, or weakening something (including ideas or power); in finance, it can mean reducing ownership by adding more shares.","zh":"“diluting”指稀释液体、削弱（影响/力度/重点等）；在金融语境中也可指因增发股份而稀释持股比例。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"making a liquid weaker (less concentrated) by adding water or another liquid","zh":"（通过加水或加入其他液体）把液体稀释、降低浓度"},"examples":[{"en":"She is diluting the juice with water for the kids.","zh":"她在用水把果汁稀释，给孩子们喝。"},{"en":"Diluting the sauce a little can make it less salty.","zh":"把酱汁稍微稀释一下可以让它没那么咸。"}]},{"partOfSpeech":"v.","definition":{"en":"making something less strong, effective, or intense (often used figuratively)","zh":"（多为比喻）削弱某事的力度、效果或强度"},"examples":[{"en":"The new rule is diluting the power of local governments.","zh":"新规定正在削弱地方政府的权力。"},{"en":"Too many side topics are diluting the main message of the speech.","zh":"太多的旁枝话题在削弱演讲的核心信息。"}]},{"partOfSpeech":"v.","definition":{"en":"reducing a company owner’s or shareholder’s percentage by issuing more shares (business/finance)","zh":"（商业/金融）通过增发股份稀释（股权、持股比例）"},"examples":[{"en":"Raising new funding may be diluting existing shareholders’ ownership.","zh":"引入新融资可能会稀释现有股东的持股比例。"},{"en":"They avoided diluting control by choosing a loan instead of selling shares.","zh":"他们选择贷款而不是卖股份，以避免稀释控制权。"}]}],"synonyms":["watering down","weakening","thinning","reducing","diminishing"],"phonetic":"/daɪˈluːtɪŋ/","extraExplanation":["“diluting”来自动词“dilute”（稀释/削弱），常见于三类语境：①烹饪与饮料（稀释味道或浓度）；②写作/表达（dilute the message，削弱重点）；③商业融资（dilute ownership，稀释股权）。在正式写作中，比喻用法很常见：dilute the impact/effect/meaning。"]}
{"word":"dilution","summary":{"en":"Dilution means making something less concentrated or less strong; it can also mean the diluted mixture itself, or (in business) a reduction in value/ownership share.","zh":"Dilution 指“稀释/削弱”，也可指“稀释后的溶液”；在商业金融中常指“股权或价值被稀释”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of making something weaker, less concentrated, or less intense (often by adding water or another substance)","zh":"稀释；削弱（常指加入水或其他物质，使浓度或强度变低）"},"examples":[{"en":"Add water to the juice to reduce the dilution.","zh":"往果汁里加水会增加稀释程度。"},{"en":"The lab measured the dilution of the chemical solution.","zh":"实验室测量了该化学溶液的稀释比例。"}]},{"partOfSpeech":"n.","definition":{"en":"a mixture that has been made weaker or less concentrated; the diluted form of something","zh":"稀释液；被稀释后的混合物"},"examples":[{"en":"Use this dilution on the plants once a week.","zh":"每周用这种稀释液给植物用一次。"},{"en":"The instructions say to apply the cleaner in a 1:10 dilution.","zh":"说明书说清洁剂要按1:10的稀释比例使用。"}]},{"partOfSpeech":"n.","definition":{"en":"a reduction in strength, quality, or value (often used in business, politics, or writing)","zh":"（实力/质量/价值的）削弱、冲淡（常用于商业、政治或写作语境）"},"examples":[{"en":"Some fans worried the sequel would cause a dilution of the original story.","zh":"一些粉丝担心续作会冲淡原作的故事魅力。"},{"en":"Investors feared dilution of their shares after the company issued new stock.","zh":"公司增发股票后，投资者担心自己的股份被稀释。"}]}],"synonyms":["thinning","weakening","diluting","watering down","attenuation"],"phonetic":"/daɪˈluːʃən/","extraExplanation":["在金融里，dilution 常指“股权稀释”：公司发行新股后，你持有的股份比例可能变小（即使你持有的股数不变）。常见搭配：share dilution / equity dilution / diluted earnings per share (diluted EPS)。","在科学与日常配方里，dilution 常与比例一起出现，如 a 1:10 dilution（1份原液+10份稀释剂，具体含义有时按行业约定不同，使用时最好看说明）。"]}
{"word":"dilutional","summary":{"en":"Dilutional means “related to dilution,” especially weakening a mixture or (in finance) reducing shareholders’ value by issuing more shares.","zh":"dilutional 表示“与稀释有关的”，常指稀释浓度/强度；在金融中指增发新股导致股权或每股收益被摊薄。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to dilution; causing or involving a reduction in strength, concentration, or value by mixing in more of something.","zh":"与“稀释”有关的；指通过加入更多成分而使强度、浓度或价值降低的。"},"examples":[{"en":"Adding too much water can have a dilutional effect on the soup’s flavor.","zh":"水加太多会对汤的味道产生稀释性的影响。"},{"en":"Doctors worried the patient’s sodium level was low for dilutional reasons (too much water in the body).","zh":"医生担心病人的钠水平偏低是“稀释性”原因导致的（体内水分过多）。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Business/finance) Describing the reduction of existing shareholders’ ownership percentage or earnings per share when new shares are issued.","zh":"（商业/金融）指公司增发新股后，原有股东的持股比例或每股收益被摊薄的；稀释性的。"},"examples":[{"en":"Investors were concerned about the dilutional impact of issuing more shares.","zh":"投资者担心增发股票会带来稀释性的影响。"},{"en":"The company said the deal would not be dilutional to earnings.","zh":"公司表示这笔交易不会对盈利造成稀释性影响。"}]}],"synonyms":["diluting","dilutive","weakening","thinning"],"phonetic":"/daɪˈluːʃənəl/","extraExplanation":["“dilutional”在新闻和报告里常出现在两个领域：①医学（如“dilutional hyponatremia 稀释性低钠血症”，指水分过多把血液里的钠“冲淡”了）；②金融（常与“dilutive”接近，表示增发股份导致“股权/每股收益被摊薄”。在财报表述里常见搭配：dilutional impact/effect, not dilutional to earnings）。"]}
{"word":"dilutions","summary":{"en":"“Dilutions” means instances of making something less concentrated (especially a liquid), and it can also mean share/ownership being reduced in finance.","zh":"“Dilutions”指多次/多种“稀释”（使液体等浓度降低），也可指金融中的“股权/股份摊薄”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act or process of making a liquid weaker by adding water or another solvent; the resulting weaker mixture.","zh":"（通过加水或其他溶剂）稀释的过程；稀释后的较淡溶液。"},"examples":[{"en":"Follow the label instructions carefully—some medicines require specific dilutions.","zh":"请仔细按照标签说明操作——有些药物需要按特定比例稀释。"},{"en":"In the lab, we prepared several dilutions to test the bacteria at different concentrations.","zh":"在实验室里，我们配制了几种稀释液，用不同浓度来测试细菌。"}]},{"partOfSpeech":"n.","definition":{"en":"In business and finance, a reduction in the value or percentage ownership of shares because more shares are issued.","zh":"（商业/金融）由于发行更多股份导致的股权比例或每股价值被摊薄。"},"examples":[{"en":"Existing shareholders worried about dilution after the company announced a new stock offering.","zh":"公司宣布增发股票后，现有股东担心股权被摊薄。"},{"en":"The founder accepted some dilution to raise money for growth.","zh":"为了筹资扩张，这位创始人接受了一定程度的股权稀释。"}]}],"synonyms":["thinning","weakening","watering down","reduction","share dilution"],"phonetic":"/daɪˈluːʃənz/","extraExplanation":["“dilutions”是名词复数，单数是“dilution”。在日常英语里，化学/药品/饮料语境最常见；商业语境中常与“equity dilution（股权稀释）”“share dilution（股份稀释）”搭配。","实验室里常说“serial dilution（系列/梯度稀释）”，意思是按固定倍数一层层稀释（例如每次稀释10倍），用于获得不同浓度。"]}
{"word":"dilutive","summary":{"en":"Dilutive means “causing dilution,” especially in finance—reducing existing ownership percentage or per-share value by increasing the total amount (like issuing more shares).","zh":"dilutive 意为“具有稀释作用的”，多用于金融语境，指通过增加总量（如增发股票）使原有持股比例或每股价值下降。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Finance, business) Causing dilution: making something weaker or smaller in value or percentage (for example, reducing existing shareholders’ ownership by issuing more shares).","zh":"（金融/商业）具有稀释作用的：会造成“稀释”，使某种比例、价值或强度变小（例如增发股票导致原股东持股比例下降）。"},"examples":[{"en":"The new share issue could be dilutive to existing shareholders.","zh":"这次增发可能会稀释现有股东的权益。"},{"en":"Analysts said the acquisition might be dilutive in the short term but accretive later.","zh":"分析师表示，这次收购短期可能具有稀释性，但之后可能增厚收益。"},{"en":"Founders worried that taking more money now would be too dilutive.","zh":"创始人担心现在再融资会造成过度稀释。"}]}],"synonyms":["diluting","weakening","diminishing","reducing"],"phonetic":"/daɪˈluːtɪv/","extraExplanation":["“dilutive”最常见于公司金融语境，尤其在讨论融资、增发、可转债/期权行权等情形时。核心意思是：同一块“蛋糕”被切成更多份，每一份（每个股东/每股）占比或价值变小。","常见搭配：dilutive to shareholders（对股东有稀释作用）、dilutive issuance（稀释性发行）、dilutive effect（稀释效应）。与之相对的词是“accretive”（增厚的/增益的），常见于“accretive vs. dilutive”并购分析。","在初创公司语境里也常提到“anti-dilution”（反稀释条款），用于在未来以更低估值融资时保护早期投资者的权益。"]}
{"word":"dilutor","summary":{"en":"Dilutor = a person or device that dilutes a substance (makes it less concentrated).","zh":"dilutor 指稀释某物（降低浓度）的人员或装置。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing (often a device) that dilutes something—makes it weaker or less concentrated by adding liquid (usually water)","zh":"稀释者；稀释装置（指通过加入液体，通常是水，使某物变淡、浓度降低的人或设备）"},"examples":[{"en":"In the lab, the automatic dilutor adds water to make the solution less concentrated.","zh":"在实验室里，自动稀释器加水把溶液的浓度降低。"},{"en":"A dilutor is used to prepare samples at the right strength for testing.","zh":"稀释器用于把样品配到适合检测的浓度。"}]}],"synonyms":["diluter","diluting device","thinner","mixer"],"phonetic":"/daɪˈluːtər/","extraExplanation":["“dilutor”有时被当作“diluter”的变体拼写使用；在日常英语里更常见的拼写是 diluter。两者意思通常相同，尤其在实验室设备或工业场景中。"]}
{"word":"dilutors","summary":{"en":"“Dilutors” means people or devices that dilute a substance, making it less concentrated.","zh":"“dilutors”指进行稀释的人或用于稀释的设备，使某物浓度降低。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or devices that dilute something (make it weaker or less concentrated), especially by adding another substance such as water.","zh":"稀释者；稀释装置（把某物稀释、降低浓度的人员或设备，常指加水等使其变淡/变弱）。"},"examples":[{"en":"In the lab, automatic dilutors prepare samples at the exact concentration needed for testing.","zh":"在实验室里，自动稀释装置会把样品配成检测所需的准确浓度。"},{"en":"The recipe uses dilutors like water or broth to soften the flavor of the sauce.","zh":"这个食谱用水或高汤等“稀释物”来让酱汁味道更柔和。"},{"en":"Only trained staff can act as dilutors when handling strong disinfectants.","zh":"处理高浓度消毒剂时，只有受过培训的人员才能进行稀释操作。"}]}],"synonyms":["diluters","thinners","mixers","dosing devices"],"phonetic":"/daɪˈluːtərz/","extraExplanation":["“dilutors”是名词复数，单数是“dilutor”。在日常英语里更常见的说法是“diluters”（更常用的拼写/词形）或直接说“devices that dilute / people who dilute”。在实验室、制药、化工等技术语境中，“dilutor”常指用于按比例加液的稀释设备或模块。"]}
{"word":"dilutus","summary":{"en":"Dilutus is a Latin word meaning “pale/diluted,” mainly seen in scientific or naming contexts rather than everyday English.","zh":"Dilutus 是拉丁语，意为“淡的/被稀释的”，多用于科学描述或命名语境，而非常用英语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Latin; used in scientific writing, especially biology) “pale,” “washed-out,” or “diluted” in color; not intense.","zh":"（拉丁语；常见于生物学等学术/命名用语）指颜色“淡的、浅的、被稀释的”，不浓烈。"},"examples":[{"en":"In some species descriptions, dilutus refers to a paler form or color variant.","zh":"在一些物种描述中，dilutus 用来指较浅色的类型或色彩变异。"},{"en":"The label noted a dilutus pattern, meaning the markings looked lighter than usual.","zh":"标签写着 dilutus pattern，表示斑纹看起来比平常更浅。"}]},{"partOfSpeech":"other","definition":{"en":"(Latin grammar) masculine singular past participle of diluere, meaning “to dilute / to wash away.”","zh":"（拉丁语语法）diluere 的阳性单数过去分词，意为“稀释/冲淡；冲洗掉”。"},"examples":[{"en":"As a Latin form, dilutus can be translated as “diluted” or “washed away,” depending on context.","zh":"作为拉丁语形式，dilutus 可按语境译为“被稀释的”或“被冲洗掉的”。"}]}],"synonyms":["diluted","pale","washed-out","light-colored"],"phonetic":"/daɪˈluːtəs/","extraExplanation":["dilutus 不是现代英语中常用的单词，更常在拉丁文语境或拉丁化的学名/分类描述里出现，表示“颜色更淡、对比度更弱”。如果你是在宠物遗传（如爬宠、鱼类等的色型描述）或生物分类中看到它，通常指“淡化色”。","在日常英语里，对应的常用词是 dilute（v./adj.）或 diluted（adj.），例如：a diluted color（被冲淡的颜色）、to dilute the solution（稀释溶液）。"]}
{"word":"diluvia","summary":{"en":"Diluvia means “floods” or “great inundations,” often in literary/formal contexts; in older geology it can refer to flood-deposited sediments (plural of diluvium).","zh":"Diluvia 指“洪水/大泛滥”，多见于文学或正式语境；在较早的地质学用法中，也可指“洪水沉积物”（作 diluvium 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"floods; great inundations (plural form, often used in literary or scientific writing).","zh":"洪水；大泛滥（复数形式，常见于文学或较正式/科学语境）。"},"examples":[{"en":"After weeks of rain, the valley endured repeated diluvia.","zh":"连下了几周雨后，山谷遭遇了多次洪水。"},{"en":"In older writing, “diluvia” can suggest disasters on a vast scale.","zh":"在较旧的作品里，diluvia 常用来暗示规模巨大的灾难。"}]},{"partOfSpeech":"n.","definition":{"en":"(Geology, older usage) deposits thought to have been left by massive floods; sometimes used as the plural of “diluvium.”","zh":"（地质学，较旧用法）被认为由巨大洪水留下的沉积物；有时作 diluvium 的复数。"},"examples":[{"en":"Nineteenth-century texts sometimes describe gravel beds as diluvia.","zh":"19 世纪的一些文献有时把砾石层称为 diluvia。"},{"en":"Modern geology usually avoids this term and uses more precise names for sediments.","zh":"现代地质学通常避免用这个词，而改用更精确的沉积物名称。"}]}],"synonyms":["floods","inundations","deluges","freshets"],"phonetic":"/daɪˈluːviə/","extraExplanation":["“diluvia”源自拉丁语 diluvium（“洪水/泛滥”）。英语里常见的是单数 diluvium（较少用）以及更常用的普通词 floods。","文学中它带有一种“古典/史诗式”的语感，常让人联想到《圣经》或古代叙事里的“大洪水”主题。","地质学里“diluvial（洪积的）/diluvium（洪积层）”属于较早期术语，现代更常用 glacial deposits（冰川沉积）或 alluvial deposits（冲积沉积）等更具体的说法。"]}
{"word":"diluvial","summary":{"en":"Diluvial means “connected with a great flood,” and in older geology it referred to deposits once thought to come from a universal flood.","zh":"diluvial 意为“与大洪水有关的”；在早期地质学中也指曾被认为由全球性洪水形成的沉积物/地层。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to a great flood (especially the biblical Flood); produced by floodwaters.","zh":"与大洪水有关的（尤指《圣经》中的诺亚洪水）；由洪水造成或沉积形成的。"},"examples":[{"en":"Some old writings describe certain valleys as having a diluvial origin.","zh":"一些旧文献把某些山谷描述为具有“洪水成因”（diluvial origin）。"},{"en":"In the past, people sometimes called gravel layers diluvial deposits.","zh":"过去人们有时把砾石层称为“洪积层”（diluvial deposits）。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Geology, older usage) Of or relating to the Diluvium—materials once thought to be laid down by a universal flood.","zh":"（地质学，旧用法）与“洪积层/洪积期”（Diluvium）有关——过去曾被认为是全球性洪水沉积的地层或沉积物。"},"examples":[{"en":"The term diluvial is now uncommon in modern geology.","zh":"在现代地质学中，diluvial 这个术语已不常用。"},{"en":"Older textbooks contrasted diluvial deposits with alluvial deposits from rivers.","zh":"旧教材常把 diluvial deposits（洪积沉积）与河流形成的 alluvial deposits（冲积沉积）对比。"}]}],"synonyms":["flood-related","deluged","cataclysmic (in context)"],"phonetic":"/daɪˈluːviəl/","extraExplanation":["词源来自拉丁语 diluvium（“洪水、泛滥”），与 deluge（大洪水）同源。","现代科学语境中更常用 flood-related（与洪水有关的）、catastrophic flooding（灾难性洪水）、glacial deposits（冰川沉积）等表达；diluvial 常带有历史/宗教或早期地质学色彩。","易混词：alluvial 指“河流冲积形成的”（如三角洲沉积），diluvial 在旧地质学里更偏向“大洪水式的沉积”概念。"]}
{"word":"diluvialist","summary":{"en":"A diluvialist is someone who explains Earth’s geology mainly as the result of a great flood (often Noah’s Flood).","zh":"diluvialist 指“洪水论者”：主要用一次大洪水（常指诺亚洪水）来解释地质地貌的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who believes that Earth’s surface features (especially geological formations) were mainly shaped by a huge flood, often identified with the biblical Flood of Noah.","zh":"洪水论者；相信地球表面特征（尤其是地质构造）主要由一次巨大洪水塑造的人，常与《圣经》中诺亚洪水联系在一起。"},"examples":[{"en":"In the 1800s, some diluvialists argued that valleys and boulders were evidence of a single, world-changing flood.","zh":"在19世纪，一些洪水论者认为山谷和巨石是一次改变世界的单一大洪水的证据。"},{"en":"The museum exhibit explained how diluvialist ideas were later challenged by modern geology.","zh":"博物馆展览解释了洪水论的观点后来如何被现代地质学所挑战。"}]}],"synonyms":["flood geologist (context-dependent)","biblical flood theorist (informal)"],"phonetic":"/daɪˈluːviələst/","extraExplanation":["“diluvialist”来自拉丁语 diluvium（大洪水）。它常用于描述18—19世纪早期地质学史上的一种观点：用“洪水”来解释沉积层、巨砾和地貌。","在现代科学语境中，该词多带历史色彩，常与“catastrophism（灾变论）”的早期形式一起讨论；但“diluvialist”更具体地指向“洪水”这一单一原因（尤其是《圣经》洪水）。"]}
{"word":"diluvian","summary":{"en":"Diluvian means “related to a great flood” (often Noah’s Flood) or, figuratively, “extremely old-fashioned.”","zh":"diluvian 表示“与大洪水有关（常指诺亚大洪水）”，也可引申为“极其古老/过时的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a great flood (especially the biblical Flood in the story of Noah).","zh":"与大洪水有关的；（尤指《圣经》中诺亚方舟故事里的）洪水的。"},"examples":[{"en":"The museum displayed artifacts from the diluvian myths of different cultures.","zh":"博物馆展出了不同文化中与大洪水神话有关的文物。"},{"en":"Some older writings describe certain rock layers as diluvian deposits.","zh":"一些较早的著作把某些岩层描述为“大洪水沉积物”。"}]},{"partOfSpeech":"adj.","definition":{"en":"Very old-fashioned or ancient; from a very distant time.","zh":"非常古老的；过时得像远古时代的。"},"examples":[{"en":"He showed me his diluvian computer—huge, slow, and noisy.","zh":"他给我看了他那台“远古级”的电脑——又大又慢还很吵。"},{"en":"Her diluvian ideas about work don’t fit modern life.","zh":"她那些“古早”的工作观念不太适合现代生活。"}]}],"synonyms":["flood-related","antediluvian","ancient","archaic"],"phonetic":"/daɪˈluːviən/","extraExplanation":["词源来自拉丁语 diluvium（洪水、泛滥），与动词 luere（冲洗、洗去）有关，常带有“被洪水冲刷”的意象。","在英语文学与宗教语境中，diluvian 常暗示《圣经》的“大洪水”（Noah’s Flood）；在现代口语里也可夸张地表示“老掉牙、过时”。","在科学史上，“diluvial（洪水成因的）”曾被用于解释地貌或沉积物的形成，但今天地质学通常用更具体的术语（如 glacial 冰川的、alluvial 冲积的）。"]}
{"word":"diluvianism","summary":{"en":"Diluvianism is the belief that Earth’s major geological features were chiefly shaped by a biblical-style worldwide flood (often Noah’s Flood).","zh":"大洪水论（洪水地质观）指认为地球许多主要地质特征主要由类似《圣经》所述的全球性大洪水（常指诺亚洪水）造成。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The belief that major geological features (such as valleys, sediment layers, or fossils) were mainly formed by Noah’s Flood or a single, worldwide flood described in the Bible.","zh":"洪水地质观／大洪水论：认为许多地质地形（如山谷、沉积层、化石等）主要由《圣经》中诺亚方舟的大洪水或一次全球性洪水造成的观点。"},"examples":[{"en":"In the early 1800s, some scientists defended diluvianism to explain fossil beds and rock layers.","zh":"19世纪初，一些科学家用大洪水论来解释化石层和岩层。"},{"en":"Diluvianism gradually lost influence as modern geology developed new explanations for Earth’s history.","zh":"随着现代地质学提出新的地球史解释，大洪水论的影响逐渐减弱。"}]}],"synonyms":["flood geology","catastrophism (historical/related)"],"phonetic":"/daɪˈluːviəˌnɪzəm/","extraExplanation":["“diluvian”来自拉丁语 diluvium（洪水、洪灾），因此 diluvianism 常与《创世记》中“诺亚洪水”的解释联系在一起。","在地质学史上，大洪水论曾是解释岩层与化石的一种框架；后来“均变论/渐进论”（uniformitarianism，强调长期缓慢过程）兴起，使这种观点在主流科学中逐渐被取代。","现代语境中该词多出现在科学史、宗教与科学关系讨论，或特定宗教地质观点的介绍中。"]}
{"word":"diluviate","summary":{"en":"Diluviate means to flood or drench heavily, sometimes to wash away by a flood, and can also be used figuratively to mean overwhelm.","zh":"diluviate 指大量水淹没或浸透，也可指被洪水冲走/毁坏；比喻用法表示“如洪水般压倒、淹没”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to flood or drench with a large amount of water; to deluge","zh":"用大量的水淹没；使浸透；倾盆而下般淹灌"},"examples":[{"en":"The sudden storm diluviated the fields in minutes.","zh":"突如其来的暴风雨在几分钟内就把田地淹了。"},{"en":"Water poured from the broken pipe and diluviated the hallway.","zh":"破裂的水管把水倾泻出来，把走廊淹得湿透。"}]},{"partOfSpeech":"vt.","definition":{"en":"to wash away or damage by flooding (often used in literary or old-fashioned writing)","zh":"（多见于文学或较古旧用法）被洪水冲走或因洪水而毁坏"},"examples":[{"en":"The river rose and diluviated the small bridge.","zh":"河水上涨，把那座小桥冲毁了。"},{"en":"Old records say the village was once diluviated by a great flood.","zh":"旧记载说，这个村庄曾被一场大洪水淹没摧毁。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative) to overwhelm completely, as if by a flood","zh":"（比喻）如洪水般压倒、淹没（某人/某物）"},"examples":[{"en":"After the news broke, she was diluviated with messages.","zh":"消息传开后，她被大量信息“淹没”了。"},{"en":"The city was diluviated by a flood of tourists during the holiday.","zh":"假日期间，这座城市被游客潮“淹没”了。"}]}],"synonyms":["deluge","inundate","flood","swamp","drench"],"phonetic":"/daɪˈluːviˌeɪt/","extraExplanation":["“diluviate”来自拉丁语词根 *diluvium*（大洪水、洪灾），与英语中的“deluge（洪水）”“diluvial（洪积的/洪水的）”同源。这个词在现代英语里很少用，更常见的替代词是 *flood* 或 *inundate*。"]}
{"word":"diluvion","summary":{"en":"Diluvion means a great flood (often literary/Biblical) or, figuratively, a sudden overwhelming amount.","zh":"Diluvion 指“大洪水”（多用于文学/圣经语境），也可比喻“突然涌来的大量事物”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a great flood; a deluge (often used in a literary or Biblical sense).","zh":"大洪水；滔天洪水（常见于文学或《圣经》语境）。"},"examples":[{"en":"In the old stories, a diluvion washed away the corrupted world.","zh":"在古老传说里，一场大洪水冲刷并摧毁了堕落的世界。"},{"en":"After days of rain, the valley feared a second diluvion.","zh":"连日大雨后，山谷里的人担心会再来一次大洪水。"}]},{"partOfSpeech":"n.","definition":{"en":"a large amount of something coming all at once (a figurative ‘flood’).","zh":"（比喻）一下子涌来的大量事物；蜂拥而至。"},"examples":[{"en":"After the announcement, a diluvion of emails hit her inbox.","zh":"公告发布后，她的邮箱一下子涌入大量邮件。"},{"en":"He faced a diluvion of criticism online.","zh":"他在网上遭遇了铺天盖地的批评。"}]}],"synonyms":["deluge","flood","inundation","torrent"],"phonetic":"/dɪˈluːviən/","extraExplanation":["“diluvion”较为少见、偏文学用语，更常见的日常词是“deluge（洪水；大量涌来）”或“flood（洪水）”。","词源与拉丁语有关：前缀“di-（分开、向四处）”+“luere（冲洗）”，联想到“被水冲刷”的意象。在宗教或古典写作中，有时会特指《圣经》里的大洪水。"]}
{"word":"diluvions","summary":{"en":"“Diluvions” is the rare plural of “diluvion,” meaning a great flood or deluge, often with a Biblical or literary feel.","zh":"“diluvions”是罕见词“diluvion”的复数，表示“大洪水/洪灾”，常带有《圣经》或文学色彩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A great flood or deluge; especially the Biblical Flood.","zh":"（罕见）大洪水；特指《圣经》中的大洪水。"},"examples":[{"en":"In the old story, the world was washed clean by a diluvion.","zh":"在那个古老的故事里，世界被一场大洪水冲刷得焕然一新。"},{"en":"After days of rain, the river rose like a diluvion across the fields.","zh":"连下了好几天雨后，河水暴涨，像洪水一样漫过田野。"}]}],"synonyms":["deluge","flood","inundation"],"phonetic":"/dɪˈluːviən/","extraExplanation":["“diluvions”是名词复数形式，但这个词在现代英语中非常少见；更常见的说法是deluge / flood。","词源来自拉丁语diluvium（洪水）。在文学或宗教语境里，它常让人联想到《圣经》中的“Great Flood（大洪水）”。","拼写上容易与delusions（妄想、错觉）混淆；如果你想查的是“delusions”，告诉我我可以另给词条。"]}
{"word":"diluvium","summary":{"en":"Diluvium is loose sediment deposited by floodwaters.","zh":"Diluvium 指洪水等流水沉积形成的松散沉积物（洪积物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Loose material (such as sand, gravel, clay, and silt) that was left behind by moving water during a flood, especially in geology.","zh":"（地质）洪水等流水搬运后沉积下来的松散物质（如砂、砾石、黏土、粉砂等）；洪积物。"},"examples":[{"en":"Geologists found a thick layer of diluvium along the valley floor.","zh":"地质学家在谷底发现了一层很厚的洪积物。"},{"en":"The construction team had to remove diluvium before reaching solid bedrock.","zh":"施工队必须先清除洪积物才能挖到坚硬的基岩。"}]}],"synonyms":["flood deposit","sediment","drift (in older geological use)"],"phonetic":"/daɪˈluːviəm/","extraExplanation":["“diluvium”来自拉丁语 diluvium（“洪水”），与 “deluge”（大洪水、暴雨）同源。","在现代地质学中，这个词不如 “alluvium”（冲积物）常用；历史上它常被用来指所谓“洪水沉积”，但后来许多此类沉积被重新解释为冰川或河流过程形成的沉积，因此学术写作中使用时要注意语境。"]}
{"word":"diluviums","summary":{"en":"Diluviums are flood deposits—materials left behind by major flooding (and historically, sometimes linked to the biblical Flood).","zh":"Diluviums 指洪水沉积物——由大型洪水留下的沉积层（历史上也有与《圣经》大洪水相关的用法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) deposits of gravel, sand, silt, etc. left by a great flood or very heavy water flow; often used in geology for ancient flood deposits.","zh":"（复数）洪水或强烈水流留下的沉积物（如砾石、沙、粉砂等）；地质学中常指古洪水沉积层。"},"examples":[{"en":"The valley floor contains diluviums of sand and rounded stones.","zh":"这片谷地底部含有洪水沉积的沙层和圆砾。"},{"en":"Geologists studied the diluviums to understand past flooding events.","zh":"地质学家研究这些洪水沉积物，以了解过去的洪水事件。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common, historical) evidence or remains believed to be connected with the biblical Flood or a legendary great deluge.","zh":"（较少见，历史用法）被认为与《圣经》大洪水或传说中的大洪灾有关的遗迹或证据。"},"examples":[{"en":"In older writings, fossils were sometimes described as diluviums from a world-changing flood.","zh":"在较早的著作中，化石有时被描述为源自“改天换地的大洪水”的遗存。"}]}],"synonyms":["flood deposits","sediments","deposits","alluvium (related, not identical)"],"phonetic":"/daɪˈluːviəmz/","extraExplanation":["“diluvium”来自拉丁语 *diluvium*，意为“洪水、泛滥”。19世纪早期的地质学中曾用它来解释某些沉积层与化石，后来随着现代地质学发展，相关沉积通常会更具体地称为“冲积层（alluvium）”“冰川沉积（glacial till）”等；因此该词在当代多见于较正式或历史语境。"]}
{"word":"diluvy","summary":{"en":"Diluvy is a rare, old-fashioned adjective meaning “related to a great flood” or “flood-like.”","zh":"Diluvy 是一个罕见、偏古的形容词，意思是“与大洪水有关的”或“像洪水一样的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare/archaic) Related to a great flood; flood-like; diluvial.","zh":"（罕见/古用）与大洪水有关的；像洪水一样的；（同）diluvial（洪积的/洪水的）。"},"examples":[{"en":"In old writing, people sometimes used “diluvy rains” to mean extremely heavy, flood-causing rain.","zh":"在一些旧式写法中，人们有时用 “diluvy rains” 来表示极其猛烈、可能引发洪水的降雨。"},{"en":"The poem describes a diluvy night when the river rose and swallowed the fields.","zh":"这首诗描写了一个“洪水般”的夜晚，河水暴涨，淹没了田野。"}]}],"synonyms":["flood-like","deluge-like","diluvial"],"phonetic":"/ˈdɪljuvi/","extraExplanation":["“diluvy”非常少见，多见于旧文或仿古风格；现代英语更常用 deluge-like、flood-like，或直接用 deluge（名词/动词）来表达“洪水般的/倾盆的”。","词源上可追溯到拉丁语 diluvium（大洪水、洪灾）。在宗教或文学语境里，有时会让人联想到《圣经》中诺亚方舟的“大洪水”（the Deluge）。","如果你原本想查的是拼写更常见的词，可能是：diluvial（洪积的/洪水的）、deluge（洪水；倾盆而下）、diluvium（洪积物）。"]}
{"word":"Dilworth","summary":{"en":"Dilworth is usually a surname or a place name in the English-speaking world.","zh":"Dilworth 通常是英文姓氏或地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name), originally from English place names","zh":"姓氏（家族姓），源自英国一些同名地名"},"examples":[{"en":"Dr. Dilworth will lead today’s meeting.","zh":"Dilworth 医生将主持今天的会议。"},{"en":"Her last name is Dilworth.","zh":"她的姓是 Dilworth。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name used for several towns or neighborhoods in the U.S. (for example, a neighborhood in Charlotte, North Carolina)","zh":"地名：美国有多个地方使用 Dilworth 作为地名（例如北卡罗来纳州夏洛特的一个街区）"},"examples":[{"en":"They rented an apartment in Dilworth, close to downtown Charlotte.","zh":"他们在 Dilworth 租了公寓，离夏洛特市中心很近。"},{"en":"The event is in Dilworth Park.","zh":"活动在 Dilworth 公园举行。"}]}],"phonetic":"/ˈdɪl.wɝθ/","extraExplanation":["Dilworth 常见于英语世界的“地名姓”（habitational surname）：最初指来自某个叫 Dilworth 的地方的人，后来演变为姓氏。作为专有名词，通常首字母大写。","不同地区的 Dilworth（城镇、社区、公园等）彼此不一定有关联；在阅读或听到时，可以结合州名/城市名来判断具体指哪一个地方。"]}

