{"word":"DIN","summary":{"en":"Din means a loud, continuous unpleasant noise, and it can also mean to make such noise or to repeat something so often it sticks.","zh":"Din 指持续不断、通常令人不快的喧闹声；也可作动词，表示发出这种噪音或反复强调到让人难以忽视。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a loud, continuous, and usually unpleasant noise","zh":"（通常令人不快的）喧闹声；持续的噪音"},"examples":[{"en":"The din of traffic outside made it hard to sleep.","zh":"外面车流的喧闹声让我很难入睡。"},{"en":"In the cafeteria, the din rose as everyone started talking at once.","zh":"在食堂里，大家一齐说话时，喧闹声更大了。"}]},{"partOfSpeech":"v.","definition":{"en":"to make a loud, continuous noise; or to repeat something so often that it becomes hard to ignore","zh":"发出持续的喧闹声；（把某事）反复强调到让人难以忽视"},"examples":[{"en":"Construction noise dinned in our ears all morning.","zh":"施工噪音整个上午都在我们耳边嗡嗡作响。"},{"en":"The message was dinned into us at school: always be on time.","zh":"学校反复灌输给我们的信息是：一定要准时。"}]}],"synonyms":["racket","clamor","noise","uproar","hubub"],"phonetic":"/dɪn/","extraExplanation":["“din”常用来形容一种“持续不断、压过其他声音”的噪音，因此很常见的搭配是 the din of traffic / the din of voices（车流/人声的喧闹）。","词源上，“din”来自古英语，和“喧闹、吵嚷”的概念有关；文学或新闻里常用它来营造拥挤、混乱的现场感。","注意：全大写“DIN”在非词汇语境中也可能是缩写/专有名词，例如德国标准化学会 Deutsches Institut für Normung（常见于工程标准、插头接口如 DIN connector）。具体要看上下文。"]}
{"word":"din","summary":{"en":"Din means a loud, continuous unpleasant noise; as a verb, it means to make such noise or to repeat something loudly until people remember it.","zh":"din 指持续而令人不适的喧闹噪音；作动词时指发出这种噪音，或把某事大声反复地灌输给别人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a loud, continuous, and often unpleasant noise","zh":"喧闹声；嘈杂的持续噪音（常令人不适）"},"examples":[{"en":"I could barely hear her over the din of the crowded restaurant.","zh":"在拥挤餐馆的喧闹声中，我几乎听不清她说话。"},{"en":"The din outside kept me awake all night.","zh":"外面的嘈杂声让我一夜没睡好。"}]},{"partOfSpeech":"v.","definition":{"en":"to make a loud, repeated noise; to loudly and repeatedly say something so it is hard to ignore","zh":"发出持续的喧闹声；（把某事）大声反复地说、强行灌输（使人难以忽视）"},"examples":[{"en":"The construction site dinmed all day.","zh":"工地整天都在轰隆作响。"},{"en":"The slogan was dinned into our heads at every meeting.","zh":"那句口号在每次会议上都被反复灌输到我们脑子里。"}]}],"synonyms":["noise","racket","clamor","uproar","hubub"],"phonetic":"/dɪn/","extraExplanation":["“din”常用于固定搭配：amid/through/over the din（在喧闹声中/穿过喧闹声/盖过喧闹声）。","作动词时，常见被动结构“be dinned into someone’s head”，表示“被反复灌输、被一再强调”。"]}
{"word":"Dina","summary":{"en":"Dina is most commonly a female first name; it can also refer to the biblical name Dinah.","zh":"Dina 最常见的是女性名字；也可指《圣经》中的名字 Dinah（常见拼写）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (first name).","zh":"女性名字（名）。"},"examples":[{"en":"Dina is starting a new job on Monday.","zh":"Dina 周一要开始一份新工作。"},{"en":"I met Dina at a language exchange event.","zh":"我在一次语言交流活动上认识了 Dina。"}]},{"partOfSpeech":"n.","definition":{"en":"(also spelled Dinah) a name from the Bible: Jacob and Leah’s daughter in the Hebrew Bible/Old Testament.","zh":"（也常拼作 Dinah）《圣经》中的人物名：雅各和利亚的女儿（《希伯来圣经/旧约》）。"},"examples":[{"en":"In the Bible, Dinah is the daughter of Jacob and Leah.","zh":"在《圣经》中，Dinah（也写作 Dina）是雅各和利亚的女儿。"}]}],"synonyms":["Dinah (variant spelling)","Deena (variant spelling)"],"phonetic":"/ˈdiːnə/","extraExplanation":["“Dina”常见发音为 /ˈdiːnə/（DEE-nuh）。在英语世界里它主要作为人名使用；在不同文化中可能有不同来源与含义。","与《圣经》相关的拼写更常见的是“Dinah”。日常生活中如果对方写作 Dina，一般就尊重对方的拼写与读法。"]}
{"word":"Dinah","summary":{"en":"Dinah is a female first name; it is also the name of a biblical figure in Genesis.","zh":"Dinah 是一个女性英文名；同时也是《创世记》中一位圣经人物的名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (first name).","zh":"女性名字（名）。"},"examples":[{"en":"Dinah is starting kindergarten this fall.","zh":"Dinah 今年秋天要上幼儿园了。"},{"en":"I met a woman named Dinah at the conference.","zh":"我在会议上遇到一位叫 Dinah 的女士。"}]},{"partOfSpeech":"n.","definition":{"en":"(in the Bible) Jacob and Leah’s daughter; a figure mentioned in the Book of Genesis.","zh":"（《圣经》中）雅各和利亚的女儿；《创世记》里提到的人物。"},"examples":[{"en":"In Genesis, Dinah is described as the daughter of Jacob and Leah.","zh":"在《创世记》中，Dinah 被描述为雅各和利亚的女儿。"}]}],"synonyms":["(related names) Diana","Dinah (nickname forms: Di, Dina)"],"phonetic":"/ˈdaɪnə/","extraExplanation":["Dinah 常见读法是重音在前：DI-nuh。它在英语世界里是比较传统的女性名（现代不算特别常见，但仍会使用）。","在美国文化里，Dinah 也常让人联想到民谣/老歌《Someone’s in the Kitchen with Dinah》（“有人在厨房里和 Dinah 在一起”），是一首流传很广的传统歌曲。","文学方面，在《爱丽丝梦游仙境》中，Alice 的小猫就叫 Dinah；所以这个名字也会带一点温柔、可爱、家庭宠物的联想。"]}
{"word":"dinah","summary":{"en":"Dinah is most commonly a female given name; it also appears as a biblical name and as the name of a cat in Alice’s Adventures in Wonderland.","zh":"Dinah 最常见是女性名字；它也见于《圣经》人名，以及《爱丽丝梦游仙境》中一只猫的名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (a proper noun), sometimes used in English-speaking cultures","zh":"女性名字（专有名词），在英语国家文化中使用"},"examples":[{"en":"Dinah is starting a new job next week.","zh":"Dinah 下周要开始一份新工作。"},{"en":"I met Dinah at a conference in Chicago.","zh":"我在芝加哥的一次会议上认识了 Dinah。"}]},{"partOfSpeech":"n.","definition":{"en":"a name from the Bible: the daughter of Jacob and Leah in the Book of Genesis","zh":"《圣经》中的名字：创世记里雅各与利亚的女儿底拿（Dinah）"},"examples":[{"en":"In Genesis, Dinah is described as Jacob’s daughter.","zh":"在《创世记》中，Dinah 被描述为雅各的女儿。"}]},{"partOfSpeech":"n.","definition":{"en":"a famous fictional name: the cat in Lewis Carroll’s Alice’s Adventures in Wonderland (owned by Alice’s sister)","zh":"著名虚构角色名：刘易斯·卡罗尔《爱丽丝梦游仙境》里提到的猫（爱丽丝的姐姐养的）"},"examples":[{"en":"In Alice’s Adventures in Wonderland, Alice talks about her cat, Dinah.","zh":"在《爱丽丝梦游仙境》中，爱丽丝会提到她的猫 Dinah。"}]}],"phonetic":"/ˈdaɪnə/","extraExplanation":["“Dinah”在19世纪到20世纪初的美国流行文化与歌曲中，有时被当作对非裔女性的刻板化称呼（带有时代偏见与冒犯性）。在现代英语中，如果你看到这种用法，通常是在历史文本、旧歌谣或批判性讨论里；日常交流中应避免把它当作泛称来使用。","读音提示：拼写是 Dinah，但常按 /ˈdaɪnə/ 读，类似“DIE-nuh”。"]}
{"word":"dinamode","summary":{"en":"“Dinamode” is uncommon; it usually means “dynamic mode,” or it can be a product brand name (DYNAMODE).","zh":"“dinamode”并不常见，通常指“dynamic mode（动态模式）”，也可能是产品品牌名（DYNAMODE）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare / informal) A “dynamic mode”: a setting or way of operating that changes actively in response to conditions.","zh":"（罕见/非正式）“动态模式”：一种会根据情况主动变化、调整的设置或运行方式。"},"examples":[{"en":"Switch the app to dinamode so the layout adapts to your screen size.","zh":"把应用切换到 dinamode（动态模式），这样布局会自动适配你的屏幕尺寸。"},{"en":"In dinamode, the system uses more power to deliver faster performance.","zh":"在 dinamode（动态模式）下，系统会用更多电力来获得更快性能。"}]},{"partOfSpeech":"n.","definition":{"en":"A brand/name used for some networking products (often written as DYNAMODE).","zh":"一个用于某些网络产品的品牌/名称（常写作 DYNAMODE）。"},"examples":[{"en":"I bought a DYNAMODE router for my home office.","zh":"我给家庭办公室买了一台 DYNAMODE 路由器。"}]}],"synonyms":["dynamic mode","adaptive mode","performance mode (context-dependent)"],"phonetic":"ˈdaɪnəˌmoʊd","extraExplanation":["“dinamode”不是英语里的常见标准拼写，更常见的写法是 **dynamode**（来自 dynamic + mode 的合成/借用写法），或直接写 **dynamic mode**。","如果你是在说明书、软件菜单、游戏设置里看到的，它多半指“动态模式”；如果出现在商品名称上，则更可能是品牌名。"]}
{"word":"Dinan","summary":{"en":"Dinan is most commonly a town in Brittany, France; it can also be a surname.","zh":"Dinan通常指法国布列塔尼的城镇“迪南”，也可以作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A historic town in Brittany, northwestern France, known for its medieval walls and old town.","zh":"迪南：法国西北部布列塔尼大区的一座历史名城，以中世纪城墙和古城区闻名。"},"examples":[{"en":"We spent the afternoon walking along the medieval walls of Dinan.","zh":"我们下午沿着迪南的中世纪城墙散步。"},{"en":"Dinan is a popular stop for travelers visiting Brittany.","zh":"迪南是游客游览布列塔尼时很受欢迎的一站。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname (family name).","zh":"迪南：一个姓氏（家族姓）。"},"examples":[{"en":"Ms. Dinan will lead today’s meeting.","zh":"迪南女士将主持今天的会议。"}]}],"phonetic":"/diːˈnɑːn/","extraExplanation":["“Dinan”作为地名时通常指法国布列塔尼的迪南（靠近朗斯河 Rance）。它以保存良好的中世纪风貌、石板路老城、城墙与城堡遗迹而出名，旅游语境中常与圣马洛（Saint-Malo）等布列塔尼城市一起出现。","英文里地名“Dinan”的读法可能因地区而略有差异；在英语语境中常读作类似“dee-NAHN”。"]}
{"word":"dinanderie","summary":{"en":"Dinanderie means hammered copper or brass decorative ware, especially the medieval style from Dinant, Belgium.","zh":"Dinanderie 指锤制的铜器或黄铜器装饰器物，尤指源自比利时迪南特的中世纪风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"decorative objects (such as bowls, vases, and pitchers) made from hammered copper or brass, especially in the style that originated in Dinant, Belgium","zh":"（尤指源自比利时迪南特 Dinant 风格的）锤制铜器或黄铜器；铜黄铜装饰器物（如碗、花瓶、壶等）"},"examples":[{"en":"The museum’s medieval gallery displays dinanderie alongside tapestries and stained glass.","zh":"博物馆的中世纪展厅把迪南特铜黄铜器与挂毯和彩绘玻璃一同展出。"},{"en":"She bought a small piece of dinanderie—a hammered brass bowl with floral patterns.","zh":"她买了一件小型迪南特铜黄铜器——一只带花纹的锤制黄铜碗。"},{"en":"Collectors value dinanderie for its warm metal shine and hand-hammered texture.","zh":"收藏家看重迪南特铜黄铜器温润的金属光泽与手工锤击的质感。"}]}],"synonyms":["brassware","copperware","metalwork","hammered brass","hammered copper"],"phonetic":"ˌdiːnɑːndəˈriː","extraExplanation":["“dinanderie”来自地名 Dinant（迪南特，比利时默兹河畔的城市）。中世纪时这里以铜与黄铜的锤揲工艺闻名，作品常见于教堂器具、家用器皿与装饰摆件。英语里这个词多见于艺术史、古董收藏与博物馆展览语境。"]}
{"word":"Dinantian","summary":{"en":"Dinantian refers mainly to a European early-Carboniferous geological unit (about the same as the Mississippian) and can also name that unit itself; less commonly, it means ‘from Dinant, Belgium.’","zh":"Dinantian 主要指欧洲石炭纪早期的地层/时代单位（约相当于密西西比纪），也可作名词指该单位本身；较少情况下指“来自比利时迪南”的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Dinantian, a European geological subdivision of the early Carboniferous Period (roughly equivalent to the Mississippian in North America).","zh":"（地质）与“迪南期”有关的；迪南期是欧洲对石炭纪早期的一种地层划分（大致相当于北美的“密西西比纪”）。"},"examples":[{"en":"These limestone layers are typically Dinantian in age.","zh":"这些石灰岩层的年代通常属于迪南期。"},{"en":"The paper discusses Dinantian stratigraphy in Belgium.","zh":"这篇论文讨论了比利时的迪南期地层学。"}]},{"partOfSpeech":"n.","definition":{"en":"The Dinantian subdivision itself (used as a name for that time/rock unit).","zh":"迪南期（本身；可指这一段地质时间或相应的地层/岩层单位）。"},"examples":[{"en":"Fossils from the Dinantian are common in this region.","zh":"这个地区常见迪南期的化石。"},{"en":"The boundary between the Tournaisian and the Visean lies within the Dinantian.","zh":"图尔奈期与维宪期之间的界线位于迪南期之内。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to Dinant, a town in Belgium (less common in everyday English).","zh":"与比利时城镇迪南（Dinant）有关的（在日常英语中较少见）。"},"examples":[{"en":"The museum has a small collection of Dinantian metalwork.","zh":"博物馆里有一小部分与迪南有关的金属工艺品收藏。"}]}],"synonyms":["Mississippian","Lower Carboniferous"],"phonetic":"/daɪˈnænʃən/","extraExplanation":["“Dinantian”一词来自比利时城镇 Dinant（迪南），因为当地及周边地区的石炭纪早期地层研究很典型，后来被用来给这一套地层/时代命名。","在现代国际地层表述中，英语学术写作更常直接用 Mississippian（密西西比纪）或明确写 Tournaisian（图尔奈期）与 Visean（维宪期）；“Dinantian”更偏欧洲传统用法。"]}
{"word":"dinantian","summary":{"en":"Dinantian is a geology term for the early Carboniferous in western Europe (roughly like the Mississippian).","zh":"Dinantian 是地质学术语，指西欧石炭纪早期的一段时期/地层（大致相当于北美的密西西比纪）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Geology, chiefly British/European usage) Relating to the Dinantian, an early part of the Carboniferous Period (roughly corresponding to the Mississippian in North America).","zh":"（地质学，主要用于英欧地区）与“迪南统/迪南阶（Dinantian）”有关的；指石炭纪早期的一段时期（大致对应北美的密西西比纪 Mississippian）。"},"examples":[{"en":"Dinantian limestones are common in parts of northern England.","zh":"在英格兰北部的一些地区，迪南统的石灰岩很常见。"},{"en":"The fossils suggest a shallow sea during Dinantian times.","zh":"这些化石表明在迪南统时期这里曾是浅海环境。"}]},{"partOfSpeech":"n.","definition":{"en":"The Dinantian rock series/interval of the early Carboniferous in western Europe.","zh":"（地质学）西欧石炭纪早期的“迪南统/迪南期”地层序列或时间段。"},"examples":[{"en":"The strata belong to the Dinantian.","zh":"这些地层属于迪南统。"},{"en":"Geologists divide the local Carboniferous into the Dinantian and Silesian.","zh":"地质学家把当地的石炭系划分为迪南统和西里西亚统（Silesian）。"}]}],"synonyms":["Mississippian (rough equivalent)","Lower Carboniferous (related)"],"phonetic":"/daɪˈnænʃən/","extraExplanation":["“Dinantian”一词源自比利时城市 Dinant（迪南）；在欧洲区域地层划分中很常见。它常被拿来与北美的“Mississippian（密西西比纪）”对照，但不同地区的分期边界并不总是完全一一对应。"]}
{"word":"dinaphthyl","summary":{"en":"Dinaphthyl describes (or names) a chemical structure containing two naphthyl groups.","zh":"dinaphthyl 指（或用来命名）含有两个萘基的化学结构/化合物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Made of or containing two naphthyl groups (naphthalene-based rings) joined in a molecule.","zh":"（化学）由两个萘基（源自萘的芳香环基团）构成或含有两个萘基的；“二萘基的”。"},"examples":[{"en":"The dye contains a dinaphthyl structure, which helps it absorb light strongly.","zh":"这种染料含有二萘基结构，有助于它强烈吸收光。"},{"en":"Researchers tested a dinaphthyl compound as a possible organic semiconductor.","zh":"研究人员测试了一种二萘基化合物，作为潜在的有机半导体材料。"}]},{"partOfSpeech":"n.","definition":{"en":"A compound that has two naphthyl groups in its structure (often used in chemical naming).","zh":"含有两个萘基的化合物（常用于化学命名中）。"},"examples":[{"en":"The reaction produced a dinaphthyl that was later purified by crystallization.","zh":"该反应生成了一种二萘基化合物，随后通过结晶进行纯化。"}]}],"synonyms":["binaphthyl","di-naphthyl (variant spelling in some texts)"],"phonetic":"/daɪˈnæfθəl/","extraExplanation":["“dinaphthyl”多见于化学/材料科学文献与产品说明中，不算日常英语词汇；阅读时可把它理解为“含两个萘基的”。","相关形式：常见前缀“di-”表示“二”，而“naphthyl”指“萘基”。有时也会看到更具体的名称，如“1,1′-binaphthyl（联萘）”，表示两个萘环以特定位置相连。"]}
{"word":"dinar","summary":{"en":"A “dinar” is a currency unit used in several countries; historically, it also refers to a gold coin in the Islamic world.","zh":"dinar 指多个国家使用的货币单位；在历史语境中也可指伊斯兰世界曾使用的金币。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A basic unit of money used in several countries, especially in parts of the Middle East and North Africa (its value depends on the country).","zh":"第纳尔：多个国家使用的货币单位，尤指中东和北非地区（不同国家的币值不同）。"},"examples":[{"en":"I exchanged dollars for Jordanian dinars at the airport.","zh":"我在机场把美元换成了约旦第纳尔。"},{"en":"The price is 10 dinars, not 10 dollars.","zh":"价格是10第纳尔，不是10美元。"}]},{"partOfSpeech":"n.","definition":{"en":"Historically, a gold coin used in the Islamic world, later influencing the name of modern currencies called “dinar.”","zh":"（历史）第纳尔：伊斯兰世界曾使用的金币，后来影响了现代多国“第纳尔”这一货币名称。"},"examples":[{"en":"The museum displayed an early Islamic gold dinar.","zh":"博物馆展出了一枚早期伊斯兰金币——第纳尔。"},{"en":"Merchants once traded using dinars and silver coins.","zh":"商人们曾用第纳尔和银币进行交易。"}]}],"synonyms":["currency unit","coin (historical)"],"phonetic":"/dɪˈnɑr/","extraExplanation":["词源背景：dinar 来自阿拉伯语 dīnār，再往前可追溯到拉丁语 denarius（罗马时期的一种银币）。因此它既指现代货币单位，也常用于历史语境中的金币。","使用提醒：不同国家的“dinar”不是同一种货币（如 Jordanian dinar、Kuwaiti dinar、Algerian dinar 等），谈到汇率或价格时最好加上国家名称以避免误解。"]}
{"word":"dinarchies","summary":{"en":"Dinarchy means rule by two people; dinarchies is the plural form.","zh":"Dinarchy 指“二人共治/双头统治”；dinarchies 是其复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a system of government or leadership in which two people share power (a “two-person rule”)","zh":"二人共治；双头统治（由两个人共同掌权的制度）"},"examples":[{"en":"In a dinarchy, two leaders must agree before major decisions are made.","zh":"在二人共治制度下，重大决定通常需要两位领导人达成一致。"},{"en":"Some historians describe Sparta as a dinarchy because it had two kings.","zh":"一些历史学家把斯巴达称为二人共治，因为它有两位国王。"}]},{"partOfSpeech":"n.","definition":{"en":"the two rulers or leaders themselves (the pair at the top)","zh":"两位共同掌权者；双领导人"},"examples":[{"en":"The dinarchy met privately to discuss the crisis.","zh":"两位共同掌权者私下会面讨论危机。"},{"en":"People criticized the dinarchy for sending mixed messages.","zh":"人们批评这对双领导人传递的信息前后不一。"}]}],"synonyms":["dual rule","diarchy","co-rule","joint leadership"],"phonetic":"/daɪˈnɑrki/","extraExplanation":["“dinarchy”的词根很直观：di- 表示“二”，-archy 表示“统治/政体”（如 monarchy 君主制、oligarchy 寡头政治）。","你输入的“dinarchies”是复数形式，指“多个二人共治制度/多个二人共治的案例”。在历史语境中，它常用来描述“二王制/双君主制”（例如古斯巴达）。"]}
{"word":"dinarchy","summary":{"en":"Dinarchy means a system or period of rule shared by two leaders.","zh":"Dinarchy 指由两位领导者共同掌权的政体或执政时期。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a form of government or leadership in which two people share power and rule together","zh":"（政治或组织）二人共治；双头统治（由两个人共同掌权）"},"examples":[{"en":"The island was governed as a dinarchy, with two chiefs making decisions together.","zh":"这个岛屿实行二人共治，由两位酋长共同做决定。"},{"en":"After the crisis, the party adopted a dinarchy to balance power between two leaders.","zh":"危机之后，该党采用二人共治，以平衡两位领袖之间的权力。"}]},{"partOfSpeech":"n.","definition":{"en":"the period or arrangement in which two rulers jointly hold authority (often used in historical writing)","zh":"（常用于历史叙述）两位统治者共同执政的时期或制度安排"},"examples":[{"en":"Historians describe the early years as a dinarchy before a single monarch took control.","zh":"历史学家把早期几年描述为二人共治时期，之后才由一位君主独掌大权。"}]}],"synonyms":["diarchy","dual rule","joint rule","co-rule"],"phonetic":"/ˈdaɪˌnɑrki/","extraExplanation":["词源：来自希腊语前缀 di-（“二、双”）+ -archy（“统治、政体”，同 monarch 君主制、oligarchy 寡头政治）。因此 dinarchy 字面意思就是“二人统治”。","用法提示：该词相对少见，写作中常与更常见的“diarchy”互换使用；在现代语境也可指组织里“两位共同负责人”的安排。"]}
{"word":"Dinard","summary":{"en":"Dinard is a seaside resort town in Brittany, France.","zh":"Dinard（迪纳尔）是法国布列塔尼的海滨度假小镇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A seaside town (commune) in Brittany, northwestern France, known for beaches, a mild climate, and historic villas; a popular resort on the English Channel.","zh":"迪纳尔：法国西北部布列塔尼大区的海滨城镇（市镇），以海滩、温和气候和历史别墅闻名，是英吉利海峡沿岸的度假胜地。"},"examples":[{"en":"We spent a weekend in Dinard and walked along the coastal path at sunset.","zh":"我们在迪纳尔度过了一个周末，傍晚沿着海岸步道散步。"},{"en":"Dinard is across the water from Saint-Malo.","zh":"迪纳尔隔水与圣马洛相望。"}]}],"phonetic":"/diˈnɑrd/","extraExplanation":["Dinard 常被称为“海滨度假胜地”，19世纪时因英国游客与上层阶级度假而兴盛，城市里至今仍能看到许多当时建造的别墅（villas）。","在旅行语境中，你可能会看到相关搭配：Dinard beach（迪纳尔海滩）、Dinard promenade（海滨步道/海滨长廊）、the Dinard Film Festival（迪纳尔电影节，常与英美电影相关）。"]}
{"word":"Dinaric","summary":{"en":"Dinaric means “related to the Dinaric Alps or the western Balkans,” and it can also refer (in outdated texts) to an old anthropological classification.","zh":"Dinaric 指“与迪纳拉山脉或西巴尔干地区有关的”；在过时文献中也可能指旧式的人类学体貌分类。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Dinaric Alps or the western Balkan region near them (parts of Croatia, Bosnia and Herzegovina, Montenegro, Serbia, and Albania).","zh":"与迪纳拉山脉（Dinaric Alps）或其附近的西巴尔干地区有关的（包括克罗地亚、波黑、黑山、塞尔维亚、阿尔巴尼亚等地部分区域）。"},"examples":[{"en":"The Dinaric Alps stretch along the Adriatic coast.","zh":"迪纳拉山脉沿着亚得里亚海岸延伸。"},{"en":"Many Dinaric towns have a mix of Mediterranean and Balkan cultural influences.","zh":"许多迪纳拉地区的城镇兼具地中海与巴尔干文化影响。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Dated, anthropology) Describing a former “Dinaric” physical type classification used in older writings about European populations.","zh":"（过时，人类学）指旧式著作中曾用来划分欧洲人群的“迪纳拉型”体貌分类。"},"examples":[{"en":"Some early 20th-century books used “Dinaric” as a racial label, but modern science does not support such categories.","zh":"一些20世纪初的书籍把“Dinaric（迪纳拉型）”当作种族标签，但现代科学并不支持这类分类。"}]}],"synonyms":["Balkan (regional)","western Balkan","Adriatic (context-dependent)"],"phonetic":"/daɪˈnærɪk/","extraExplanation":["“Dinaric”来自“Dinaric Alps（迪纳拉山脉）”，而山脉名称与古地名有关。","在当代英语里，“Dinaric”最常见、最中性的用法是地理/文化意义（如 Dinaric landscape, Dinaric karst）。","“Dinaric race/type”等说法属于历史上的体质人类学分类，今天多被视为不准确且容易引发误解；写作中建议避免或在引述时明确标注为“dated/obsolete（过时）”。"]}
{"word":"dinaric","summary":{"en":"Dinaric mainly means “of the Dinaric Alps/western Balkans,” and it also appears in older anthropology as an outdated classification label.","zh":"Dinaric主要指“与迪纳里克阿尔卑斯山/西巴尔干迪纳里克地区有关的”；也见于较旧的人类学中作过时的分类标签。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Dinaric Alps or the Dinaric region of the western Balkan Peninsula (including parts of Croatia, Bosnia and Herzegovina, Montenegro, Serbia, Slovenia, and Albania).","zh":"与迪纳里克阿尔卑斯山（Dinaric Alps）或西巴尔干半岛的迪纳里克地区有关的（涵盖克罗地亚、波黑、黑山、塞尔维亚、斯洛文尼亚、阿尔巴尼亚等部分地区）。"},"examples":[{"en":"The Dinaric Alps are known for rugged limestone mountains and deep karst caves.","zh":"迪纳里克阿尔卑斯山以崎岖的石灰岩山地和深邃的喀斯特洞穴而闻名。"},{"en":"Researchers studied biodiversity in Dinaric forests and mountain valleys.","zh":"研究人员研究了迪纳里克地区森林和山谷里的生物多样性。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Anthropology, older usage) Referring to a historical physical-anthropology classification once used for some populations in the western Balkans.","zh":"（人类学，较旧用法）指一种曾用于西巴尔干部分人群的历史性“体质人类学”分类。"},"examples":[{"en":"Some early 20th‑century texts used “Dinaric” as a racial label, but modern anthropology does not rely on this system.","zh":"一些20世纪早期文本把“Dinaric”当作种族标签使用，但现代人类学已不再依赖这套分类。"}]}],"synonyms":["Dinaric Alps–related","western Balkan","Balkan (context-dependent)"],"phonetic":"/daɪˈnɛrɪk/","extraExplanation":["“Dinaric”来自拉丁化地名“Dinar-”，与巴尔干地区的迪纳里克阿尔卑斯山有关。现代最常见的用法是地理/地质/生态语境（如喀斯特地貌、山脉、森林带等）。","第二个含义属于历史语境：早期欧洲的人类学曾用若干“类型”描述人群外貌特征，这类说法今天往往被视为过时甚至带偏见；在写作中最好避免把它当作现代科学分类使用。"]}
{"word":"dinars","summary":{"en":"“Dinars” is the plural of “dinar,” a currency unit in several countries; it can also mean a historical gold coin.","zh":"“dinars”是“dinar”的复数，指一些国家的货币单位，也可指历史上的金币。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a unit of money used in several countries, especially in the Middle East and North Africa (e.g., Kuwait, Jordan, Tunisia, Algeria, Iraq). “Dinars” is the plural of “dinar.”","zh":"第纳尔：一些国家使用的货币单位，主要在中东和北非（如科威特、约旦、突尼斯、阿尔及利亚、伊拉克等）。“dinars”是“dinar”的复数。"},"examples":[{"en":"How many dinars do I need to exchange for this hotel?","zh":"我需要换多少第纳尔才能付这家酒店？"},{"en":"The taxi ride cost 3 dinars.","zh":"这趟出租车花了3第纳尔。"}]},{"partOfSpeech":"n.","definition":{"en":"historically, a gold coin used in parts of the Islamic world; sometimes used today in historical writing or coin collecting.","zh":"（历史）一种在伊斯兰世界部分地区使用过的金币；如今常见于历史叙述或钱币收藏语境。"},"examples":[{"en":"The museum displayed an old dinar from the medieval period.","zh":"博物馆展出了一枚中世纪的古老第纳尔金币。"},{"en":"Collectors pay high prices for rare dinars.","zh":"收藏家会为稀有的第纳尔金币支付高价。"}]}],"synonyms":["currency","money","coin","gold coin"],"phonetic":"/dɪˈnɑr/","extraExplanation":["“dinar”一词源自阿拉伯语 dīnār，进一步可追溯到拉丁语 denarius（古罗马银币）。因此它在历史上常与古代钱币体系和贸易路线联系在一起。","不同国家的“dinar”价值差异很大，旅行或换汇时要确认是哪一个国家的第纳尔（如“Kuwaiti dinar”“Jordanian dinar”）。"]}
{"word":"Dinarzade","summary":{"en":"Dinarzade is Scheherazade’s younger sister in *One Thousand and One Nights*, known for prompting the storytelling.","zh":"Dinarzade 是《一千零一夜》中舍赫拉查德的妹妹，以“请求姐姐讲故事”来推动叙事展开而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) The younger sister of Scheherazade in *One Thousand and One Nights* (also known as *Arabian Nights*), who helps begin the storytelling by asking Scheherazade to tell a tale.","zh":"（专有名词）《一千零一夜》（又称《天方夜谭》）中舍赫拉查德（Scheherazade）的妹妹（也常译作“敦亚札德/迪娜札德”等），她通过请求姐姐讲故事来促成故事的开端。"},"examples":[{"en":"In *One Thousand and One Nights*, Dinarzade asks her sister to tell a story before dawn.","zh":"在《一千零一夜》中，Dinarzade 在黎明前请求姐姐讲一个故事。"},{"en":"Some retellings give Dinarzade a larger role as Scheherazade’s helper and confidante.","zh":"一些改编版本会让 Dinarzade 扮演更重要的角色，成为舍赫拉查德的助手与知己。"}]}],"synonyms":["Dunyazad","Dinarzad","Dinazade"],"phonetic":"ˌdɪnɑːrˈzɑːd","extraExplanation":["“Dinarzade”有多种英文拼写，如 **Dunyazad / Dinarzad / Dinazade** 等，来自阿拉伯语/波斯语传统音译差异，所以不同译本里名字看起来会不一样，但通常指同一人物。","在许多版本中，Dinarzade 的“请求讲故事”是一个叙事装置：她的提问让舍赫拉查德自然地开始讲述，从而把一连串故事串联起来。"]}
{"word":"dinarzade","summary":{"en":"Dinarzade is Scheherazade’s sister in *One Thousand and One Nights*, known for prompting the nightly storytelling.","zh":"Dinarzade 是《一千零一夜》中舍赫拉莎德的妹妹，以促成每晚讲故事而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) The younger sister of Scheherazade in *One Thousand and One Nights* (also known as *Arabian Nights*). She helps begin the frame story by asking Scheherazade to tell a tale each night, which leads into the famous sequence of stories.","zh":"（专有名词）《一千零一夜》（又称《天方夜谭》）中舍赫拉莎德（Scheherazade）的妹妹。她通过在每个夜晚请求姐姐讲故事来开启“框架故事”，从而引出一连串著名故事。"},"examples":[{"en":"In *One Thousand and One Nights*, Dinarzade asks her sister to tell a story before dawn.","zh":"在《一千零一夜》中，Dinarzade 会在天亮前请求姐姐讲一个故事。"},{"en":"Without Dinarzade’s nightly request, the frame of the tales would feel very different.","zh":"如果没有 Dinarzade 每晚的请求，这些故事的“外框”会显得很不一样。"}]}],"synonyms":["Dunyazad","Dunyazade","Dinarzad (variant spelling)"],"phonetic":"/diːˈnɑːr.zɑːd/","extraExplanation":["“Dinarzade”常见的另一种拼写是“Dunyazad / Dunyazade”（不同译本与转写系统会出现差异）。她不是每个故事的主角，但在叙事结构上很关键：她的“请讲故事”让故事自然开始，也让舍赫拉莎德有理由不断延续到下一夜。","在文学与文化语境中，Dinarzade有时象征“听众/提问者”的角色：通过一个简单的请求推动叙事前进。"]}
{"word":"Dincolo","summary":{"en":"Dincolo means “beyond; on the other side; over there,” and often appears as dincolo de (“beyond/past…”).","zh":"Dincolo意为“在那边/在另一侧/越过”，常见结构是dincolo de（“在……之外/超过……”）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Romanian) “beyond; on the other side; over there,” used to talk about a place past a limit (a river, a border, a door, etc.).","zh":"（罗马尼亚语）“在那边；越过；在……另一侧”，用于指超过某个界限（河流、边界、门等）之外的地方。"},"examples":[{"en":"The village is dincolo, across the river.","zh":"村子在dincolo，在河的对岸。"},{"en":"Dincolo de the mountains, the weather changes quickly.","zh":"在山的那一边（dincolo de），天气变化很快。"}]},{"partOfSpeech":"prep.","definition":{"en":"(Romanian, with “de”) “beyond; past; further than,” used before a noun or phrase to show something is on the far side or exceeds a limit.","zh":"（罗马尼亚语，与de连用）“超出；越过；在……之外”，放在名词或短语前，表示在某个界限的另一边或超过某个范围。"},"examples":[{"en":"Dincolo de city limits, it’s much quieter.","zh":"在城市边界之外（dincolo de），要安静得多。"},{"en":"His kindness goes dincolo de words.","zh":"他的善意超越语言（dincolo de words）。"}]}],"synonyms":["beyond","on the other side","over there","past"],"phonetic":"/ˈdin.ko.lo/","extraExplanation":["“Dincolo”常见搭配是 **dincolo de + 名词/短语**，相当于英语的 **beyond / past / on the other side of**。单独用作副词时更像 **over there / on the other side**，语境里通常已经知道“哪一边”。","在一些文学或宗教语境中，“dincolo”也可引申为“彼岸/来世/超越现实的世界”（类似英语 *the beyond*），用来表达“超出此生/此界”的感觉。"]}
{"word":"dinder","summary":{"en":"“Dinder” is not standard English; it is most likely a misspelling of “dinner,” meaning the main meal (often in the evening).","zh":"“dinder”不是标准英语用词；最常见情况是把“dinner”（正餐/晚餐）拼错了。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely) a misspelling of “dinner”: the main meal of the day, usually eaten in the evening.","zh":"（很可能）是“dinner”的拼写错误：正餐；一天中的主要一餐，通常在晚上吃。"},"examples":[{"en":"We’re having dinner at 7 p.m.","zh":"我们晚上7点吃晚饭。"},{"en":"What’s for dinner tonight?","zh":"今晚晚饭吃什么？"},{"en":"She invited her friends to dinner.","zh":"她邀请朋友来吃晚餐。"}]}],"synonyms":["main meal","evening meal","supper (often smaller/more informal)"],"phonetic":"/ˈdɪnər/","extraExplanation":["“dinder”在标准英语里不是常见单词。大多数情况下，人们想写的是“dinner”（晚餐/正餐）。如果你是在某个特定文本、方言或人名里看到“dinder”，把上下文句子发我，我可以帮你确认具体意思。"]}
{"word":"dindle","summary":{"en":"“Dindle” is a rare dialect verb meaning to wobble, totter, or tremble slightly.","zh":"“dindle”是罕见的方言动词，表示轻微地摇晃、蹒跚或颤动。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(dialect, rare) to move in a small, unsteady way; to totter, wobble, or tremble.","zh":"（方言／罕用）小幅度地不稳移动；蹒跚、摇晃、颤动。"},"examples":[{"en":"The old bridge seemed to dindle in the wind.","zh":"那座老桥在风里似乎在轻轻摇晃。"},{"en":"He dindled down the icy steps, trying not to fall.","zh":"他在结冰的台阶上踉踉跄跄地往下走，努力不摔倒。"}]}],"synonyms":["wobble","totter","teeter","tremble","shake"],"phonetic":"/ˈdɪndəl/","extraExplanation":["“dindle”在现代标准英语里非常少见，多出现在苏格兰或英格兰北部方言语境中，含义通常与“wobble / totter / tremble（摇晃、踉跄、颤抖）”接近。","学习时容易把它和更常见的“dwindle（逐渐减少）”或“dandle（把小孩抱在膝上颠着哄）”混淆；如果你是在课本、考试或正式写作里看到“dindle”，建议先核对是否为拼写错误或方言用法。"]}
{"word":"dindled","summary":{"en":"Dwindled means “became gradually smaller or less.”","zh":"Dwindled 表示“逐渐变少/变小/减弱”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of dwindle) to become gradually smaller, fewer, or less; to decrease little by little.","zh":"（dwindle 的过去式/过去分词）逐渐变小、变少或减少；慢慢衰减。"},"examples":[{"en":"Our savings dwindled after we moved to a more expensive city.","zh":"搬到生活成本更高的城市后，我们的存款逐渐减少了。"},{"en":"As the night went on, the crowd dwindled to just a few people.","zh":"夜深了，人群渐渐散去，只剩下几个人。"},{"en":"His interest in the project dwindled over time.","zh":"随着时间推移，他对这个项目的兴趣逐渐减退。"}]}],"synonyms":["decreased","shrunk","diminished","declined","tapered off"],"phonetic":"/ˈdwɪndəld/","extraExplanation":["“dindled”通常是把“dwindled”拼错或漏写了字母 w。常见搭配：dwindle away（逐渐消失/耗尽）、dwindling resources（日益减少的资源）。","词源提示：dwindle 来自较早的英语形式，带有“逐渐变弱、逐渐消失”的感觉，语气比简单的 decrease 更强调“慢慢变少直到所剩无几”。"]}
{"word":"dindles","summary":{"en":"“Dwindles” means ‘becomes gradually smaller or less.’","zh":"“dwindles”表示“逐渐变少、变小或减弱”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(of something) becomes gradually smaller, fewer, weaker, or less important.","zh":"（某事物）逐渐变小、变少、减弱或变得不重要。"},"examples":[{"en":"Our savings dwindles if we eat out every day.","zh":"如果我们每天都在外面吃饭，存款就会逐渐减少。"},{"en":"Her interest in the project dwindles over time.","zh":"随着时间推移，她对这个项目的兴趣逐渐减弱。"},{"en":"As winter ends, the snow on the mountains dwindles.","zh":"冬天结束时，山上的积雪逐渐减少。"}]}],"synonyms":["decreases","shrinks","lessens","diminishes","wanes"],"phonetic":"/ˈdwɪndəlz/","extraExplanation":["“dindles”本身并不是常见标准拼写；多数情况下，人们想写的是“dwindles”（dwindle 的第三人称单数）。如果你是在文学作品、方言或人名中看到“dindles”，可以告诉我上下文，我可以再帮你确认具体含义。"]}
{"word":"dindling","summary":{"en":"“Dindling” is not standard; it’s usually a misspelling of “dwindling,” meaning gradually decreasing.","zh":"“dindling” 不是标准英文；通常是把 “dwindling” 拼错了，意思是“逐渐减少”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most often a misspelling of “dwindling.”","zh":"不是标准英文单词；最常见的是把 “dwindling（逐渐减少的）” 拼错了。"},"examples":[{"en":"Did you mean “dwindling” (becoming smaller in number or amount)?","zh":"你想写的是 “dwindling（数量或规模逐渐减少）” 吗？"}]},{"partOfSpeech":"adj.","definition":{"en":"(dwindling) gradually becoming smaller or fewer; decreasing little by little.","zh":"（dwindling）逐渐变小、变少；一点一点地减少。"},"examples":[{"en":"The company is trying to cut costs because of dwindling profits.","zh":"由于利润在逐渐减少，这家公司正努力降低成本。"},{"en":"Their savings are dwindling faster than they expected.","zh":"他们的存款减少得比预想更快。"}]},{"partOfSpeech":"vi.","definition":{"en":"(dwindle) to become smaller in size, amount, or importance over time.","zh":"（dwindle）随着时间推移在规模、数量或重要性上逐渐变小/减少。"},"examples":[{"en":"Interest in the topic began to dwindle after a few weeks.","zh":"几周后，人们对这个话题的兴趣开始减退。"}]}],"synonyms":["decreasing","declining","diminishing","shrinking"],"phonetic":"/ˈdwɪndlɪŋ/","extraExplanation":["“dwindling” 是动词 “dwindle” 的现在分词/形容词用法，常用于描述资源、人数、利润、时间、机会等“慢慢变少”。","如果你指的是别的词（例如人名、方言用法或某个专有名词），可以告诉我出现它的句子或上下文，我可以帮你准确判断。"]}
{"word":"dindon","summary":{"en":"Dindon is a French-derived word meaning “turkey,” mainly used in French contexts.","zh":"dindon 源自法语，意思是“火鸡”，主要用于法语语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(from French) a turkey; especially used in French contexts, menus, or writing.","zh":"（源自法语）火鸡；多见于法语语境、菜单或文学/文化描写中。"},"examples":[{"en":"For Thanksgiving, Americans often cook a turkey; on a French menu you might see it listed as dindon.","zh":"感恩节时，美国人常烤火鸡；在法语菜单上你可能会看到它写作 dindon。"},{"en":"The recipe calls for roast dindon with herbs and butter.","zh":"这份食谱要求用香草和黄油烤火鸡。"}]}],"synonyms":["turkey"],"phonetic":"/dænˈdɔːn/","extraExplanation":["“Dindon”是法语单词，法语标准发音接近鼻化音（英语里常用近似读法）。在法语里它也可用作比喻，指“容易上当的人/傻瓜”（有点贬义）；但英语借用时通常只指“火鸡”。"]}
{"word":"Dindymene","summary":{"en":"Dindymene is a poetic name for the goddess Cybele, referring to Mount Dindymus.","zh":"Dindymene 是女神西贝勒的诗性别称，指“狄丁穆斯山之女神”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an epithet (alternative name) for Cybele, the Phrygian/Roman mother goddess, meaning “(she) of Mount Dindymus.”","zh":"狄丁墨涅：母神西贝勒（Cybele）的别称/称号，意为“狄丁穆斯山（Mount Dindymus）之女神/来自狄丁穆斯山的女神”。"},"examples":[{"en":"In some classical poems, Cybele is called Dindymene to highlight her sacred mountain origin.","zh":"在一些古典诗歌中，西贝勒会被称为狄丁墨涅，以强调她与圣山的渊源。"},{"en":"The hymn invokes Dindymene, the Mother of the Gods, riding in a chariot drawn by lions.","zh":"赞歌呼唤狄丁墨涅——众神之母——乘坐由狮子牵引的战车。"}]}],"synonyms":["Cybele","Magna Mater","Mother of the Gods"],"phonetic":"/dɪnˈdɪmiˌni/","extraExplanation":["“Dindymene”来自古代小亚细亚（弗里吉亚，Phrygia）的地名/山名 Mount Dindymus（狄丁穆斯山）。用这个称号时，常带有宗教与诗歌色彩，强调女神的“圣山、野性与古老崇拜”气质。","在拉丁文学中，这类称号常用来替代本名（如 Cybele / Magna Mater），既能避免重复，也能增加史诗/抒情风格的庄重感。"]}
{"word":"dindymene","summary":{"en":"Dindymene is a literary name for Cybele, meaning “of Mount Dindymus.”","zh":"Dindymene 是库柏勒（Cybele）的文学性别称，意为“狄丁穆斯山的／来自狄丁穆斯山的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an epithet (descriptive name) of Cybele, the ancient Phrygian/Greek mother goddess, meaning “of Mount Dindymus” (a mountain in Asia Minor, modern Turkey) where she was worshiped","zh":"（古代弗里吉亚/希腊母神）库柏勒（Cybele）的别称之一，意为“狄丁穆斯山的／来自狄丁穆斯山的”，指她在小亚细亚（今土耳其）狄丁穆斯山一带受到崇拜"},"examples":[{"en":"In some classical poems, Cybele is called Dindymene to highlight her mountain sanctuary.","zh":"在一些古典诗歌中，库柏勒被称为 Dindymene，用来强调她的山岳圣地。"},{"en":"The hymn praises Dindymene, the mother goddess worshiped with drums and processions.","zh":"这首赞歌颂扬 Dindymene——人们以鼓声与游行仪式祭祀的母神。"}]}],"synonyms":["Cybele","Magna Mater","Great Mother"],"phonetic":"/dɪnˈdɪmiːni/","extraExplanation":["Dindymene 通常出现在古典文学与神话语境中，属于“称号/别名”（epithet），用地名来标记神祇的崇拜地点或神力特征；类似的构词思路也见于其他神名称号。","该词与 Mount Dindymus（狄丁穆斯山）相关，强调库柏勒与“山岳、野性自然、鼓乐与狂欢式宗教仪式”的联系；在英文文本里多作文学/学术用词，日常英语几乎不用。"]}
{"word":"Dindymus","summary":{"en":"Dindymus is a classical name for a mountain in ancient Phrygia, famous in literature as sacred to the goddess Cybele; it can also appear as a poetic reference meaning “of Dindymus.”","zh":"Dindymus（丁迪穆斯）是古弗里吉亚的一座山的古典名称，文学中常作为西贝勒女神的圣山出现；也可作诗性指称，表示“属于丁迪穆斯的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Classical name) A mountain in ancient Phrygia (in modern-day Turkey), often mentioned in Greek and Roman writing as a sacred place connected with the goddess Cybele (Magna Mater).","zh":"（古典名称）古弗里吉亚（今土耳其境内）的一座山，在希腊和罗马文献中常被提到，与女神西贝勒（大母神）崇拜密切相关的圣地。"},"examples":[{"en":"In some Roman poems, Cybele is called “the Dindymene goddess,” linking her to Mount Dindymus.","zh":"在一些罗马诗歌里，西贝勒被称为“丁迪墨涅的女神”，用来把她与丁迪穆斯山联系起来。"},{"en":"The story places the goddess’s rites on Dindymus, emphasizing a wild, mountain setting.","zh":"故事把女神的仪式放在丁迪穆斯山上，强调一种荒野的山地氛围。"}]},{"partOfSpeech":"other","definition":{"en":"By extension, an epithet or poetic reference meaning “of Dindymus,” especially used for Cybele (e.g., “Dindymene”).","zh":"引申义：诗歌或修辞中的“来自/属于丁迪穆斯”的称号，尤其用来指西贝勒（如“Dindymene/丁迪墨涅”）。"},"examples":[{"en":"The hymn uses a Dindymus-based epithet to describe Cybele.","zh":"这首赞歌用一个源自“丁迪穆斯”的称号来描写西贝勒。"},{"en":"You may see “Dindymus” in notes explaining a mythological name for the Mother Goddess.","zh":"你可能会在注释里看到“Dindymus”，用来解释“大母神”的一个神话称呼来源。"}]}],"synonyms":["Mount Dindymus","Dindymene (epithet of Cybele)","Cybele (related name)"],"phonetic":"/ˈdɪndɪməs/","extraExplanation":["“Dindymus/丁迪穆斯”多见于古典文学与神话研究语境，而不常用于现代日常英语。它常与西贝勒（Cybele，罗马称 Magna Mater）相关：古人把她的崇拜与弗里吉亚的山地、鼓乐与狂喜式仪式联系在一起。","文学线索：拉丁诗人卡图卢斯（Catullus）等作品里会出现与“Dindymus / Dindymene”相关的写法，通常用来营造异域、古老、宗教性的氛围。"]}
{"word":"dindymus","summary":{"en":"Dindymus is the name of an ancient Phrygian mountain (in today’s Turkey) sacred to the goddess Cybele; in poetry it can also mean Cybele herself.","zh":"Dindymus 指古代弗里吉亚（今土耳其）一座与库柏勒崇拜相关的圣山；在诗歌中也可借指库柏勒本人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In ancient geography) A mountain in Phrygia (in modern-day Turkey), famous in Greek and Roman writing as a sacred place connected with the goddess Cybele (the “Great Mother”).","zh":"（古代地理）丁迪穆斯山：小亚细亚弗里吉亚（今土耳其一带）的一座山，在希腊罗马文献中以与女神库柏勒（大地母神）相关的圣山而闻名。"},"examples":[{"en":"In some Roman poems, worshippers travel to Mount Dindymus to honor Cybele.","zh":"在一些罗马诗歌中，朝拜者前往丁迪穆斯山来敬奉库柏勒。"},{"en":"The writer links Dindymus with drums, dancing, and ecstatic rituals.","zh":"作者把丁迪穆斯与鼓声、舞蹈和狂喜式仪式联系在一起。"}]},{"partOfSpeech":"n.","definition":{"en":"A poetic or mythological name used to refer to Cybele herself (because she was worshipped on/near Mount Dindymus).","zh":"（诗歌/神话用法）丁迪穆斯（之神）：借指库柏勒本人（因其崇拜中心与丁迪穆斯山相关）。"},"examples":[{"en":"The hymn calls on Dindymus to protect the city.","zh":"赞歌呼唤“丁迪穆斯之神”守护城市。"},{"en":"In mythic language, “Dindymus” can stand for Cybele, the Great Mother.","zh":"在神话化的语言中，“丁迪穆斯”可用来代指大地母神库柏勒。"}]}],"synonyms":["Mount Dindymus","Dindymon"],"phonetic":"/ˈdɪn.dɪ.məs/","extraExplanation":["“Dindymus”常见于古典文学与神话语境，尤其与库柏勒（Cybele）及其祭仪形象相关：鼓（drums）、狂舞（dancing）、入迷/出神（ecstasy）。","文献中也可见拼写变体，如 Dindymon；库柏勒有时被称作 “Dindymene”（意为“来自丁迪穆斯的女神”）。","文学提示：拉丁诗人卡图卢斯（Catullus）的作品里常出现与库柏勒祭仪相关的意象，可作为理解该词文化背景的入口。"]}
{"word":"dine","summary":{"en":"“Dine” means to eat a meal (especially dinner), often with a slightly formal tone; it can also mean to host or treat someone to dinner.","zh":"“dine”表示用餐（尤其指吃晚餐），语气稍正式；也可表示宴请、请人吃饭。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to eat dinner; to eat a meal (often in a more formal or relaxed way than just “eat”)","zh":"吃晚餐；用餐（常带有较正式或更讲究的语气，比单纯的“吃”更有氛围）"},"examples":[{"en":"We usually dine at 7 p.m.","zh":"我们通常晚上七点用餐。"},{"en":"They dined with friends at a small Italian restaurant.","zh":"他们和朋友在一家小意大利餐馆一起用餐。"},{"en":"Would you like to dine with us tonight?","zh":"你今晚愿意和我们一起用餐吗？"}]},{"partOfSpeech":"vt.","definition":{"en":"to give someone dinner or a meal; to have dinner with someone (often for social or business reasons)","zh":"宴请；请（某人）吃饭（常用于社交或商务场合）"},"examples":[{"en":"The company dined its top clients after the meeting.","zh":"会议结束后，公司宴请了重要客户。"},{"en":"She dined the visiting professor at her home.","zh":"她在家里宴请了来访的教授。"}]}],"synonyms":["eat","have dinner","have a meal","sup","wine and dine"],"phonetic":"/daɪn/","extraExplanation":["“dine”比“eat”更正式、礼貌，常出现在餐厅广告或较正式的邀请中：dine in（堂食）、fine dining（高档餐饮）、dine out（外出就餐）。","常见搭配：dine at + 地点（在……用餐）；dine with + 人（与……一起用餐）；dine on + 食物（以……为食/吃……）。"]}
{"word":"dined","summary":{"en":"“Dined” means “ate dinner” (the past form of “dine”), often with a slightly formal feel.","zh":"“dined”表示“吃了晚餐”，是“dine”的过去式，常带一点正式语气。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"past tense and past participle of “dine”: to eat dinner (often in a slightly formal or restaurant context).","zh":"“dine”的过去式和过去分词：吃晚餐（常带一点正式感或在餐厅用餐的语气）。"},"examples":[{"en":"We dined at a small Italian restaurant last night.","zh":"我们昨晚在一家小意大利餐馆吃了晚餐。"},{"en":"She dined with her clients to discuss the project.","zh":"她和客户共进晚餐来讨论项目。"},{"en":"They had already dined when we arrived.","zh":"我们到的时候，他们已经吃过晚餐了。"}]}],"synonyms":["ate dinner","had dinner","ate (more general)"],"phonetic":"/daɪnd/","extraExplanation":["“dine”比“eat/have dinner”更正式一些，常用来强调在餐厅用餐、正式场合（如与客户、宾客）共进晚餐，或较讲究的一餐。日常口语里更常说“have dinner / eat dinner”。"]}
{"word":"diner","summary":{"en":"A diner is a casual, often American-style restaurant; it can also mean a person eating in a restaurant.","zh":"diner 指（常见于美国的）简餐店/小餐馆；也可指食客、用餐者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, casual restaurant (often in the U.S.) that serves simple, inexpensive meals, sometimes late at night","zh":"（常指美国的）小餐馆/简餐店，提供简单、价格不高的食物，常常营业到很晚"},"examples":[{"en":"Let’s grab breakfast at the diner near the highway.","zh":"我们去高速公路旁边那家简餐店吃早餐吧。"},{"en":"The diner serves coffee all day.","zh":"那家小餐馆全天供应咖啡。"},{"en":"They met at a 24-hour diner after the concert.","zh":"音乐会结束后，他们在一家24小时营业的简餐店见面。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who is eating in a restaurant","zh":"用餐者；就餐的人"},"examples":[{"en":"The diners at the next table were celebrating a birthday.","zh":"隔壁桌的食客正在庆祝生日。"},{"en":"Please wait to be seated if the diner is busy.","zh":"如果餐厅很忙，请等候安排座位。"}]}],"synonyms":["restaurant","cafe","eatery","customer","patron"],"phonetic":"/ˈdaɪnɚ/","extraExplanation":["“diner”在美国文化里很有代表性：常见于公路旁或小镇街角，装修可能是复古的不锈钢外观、吧台座位（counter seating）、卡座（booths）。菜单通常有汉堡、薯条、煎饼、鸡蛋培根、派（pie）等“家常”食物，因此也常出现在电影和小说里，用来营造日常、朴素或“深夜聊天”的氛围。","易混词：dinner（晚餐）拼写只差一个字母；diner（简餐店/食客）不要读成*dinner*。"]}
{"word":"dinergate","summary":{"en":"“Dinergate” is an informal, headline-style name for a diner-related scandal or controversy (often with a humorous or exaggerated tone).","zh":"“Dinergate”是新闻/网络式的非正式说法，指与小餐馆有关的“丑闻/争议”，常带调侃或夸张语气。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Informal, often in headlines) A scandal or controversy connected to a diner (a small, casual restaurant), usually minor but treated as big news.","zh":"（非正式，多见于新闻标题）与美式小餐馆（diner）有关的丑闻或争议，往往事情不大，但被渲染得很严重。"},"examples":[{"en":"Local media jokingly called the argument at the diner “Dinergate.”","zh":"当地媒体开玩笑把那家小餐馆里的争吵称为“Dinergate”。"},{"en":"To critics, the so‑called Dinergate was just a misunderstanding blown out of proportion.","zh":"在批评者看来，所谓的“Dinergate”不过是被夸大的一场误会。"}]}],"synonyms":["scandal","controversy","uproar","media storm"],"phonetic":"/ˈdaɪnərˌɡeɪt/","extraExplanation":["“Dinergate”不是固定词典词汇，通常是临时造词：diner（小餐馆）+ -gate（表示“丑闻”的后缀）。英语里把某件事叫作“X-gate”，常带有媒体化、讽刺或夸张的语气。","“-gate”来自1970年代美国政治事件“Watergate（水门事件）”。后来英语新闻与网络文化中常用“-gate”来给各种争议取名，例如“emailgate”“deflategate”。"]}
{"word":"dineric","summary":{"en":"Dinaric: connected with the Dinaric Alps or the western Balkan region.","zh":"Dinaric：与迪纳拉山脉或巴尔干半岛西部地区相关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Dinaric Alps (a mountain range along the western Balkan Peninsula) or to the region/people associated with them","zh":"与“迪纳拉山脉”（巴尔干半岛西部的一条山脉）有关的；与该地区或相关人群有关的"},"examples":[{"en":"The Dinaric Alps stretch along the Adriatic coast.","zh":"迪纳拉山脉沿亚得里亚海海岸延伸。"},{"en":"Researchers studied wildlife in the Dinaric forests.","zh":"研究人员研究了迪纳拉地区森林中的野生动物。"},{"en":"He specializes in Dinaric geology.","zh":"他专攻迪纳拉地区的地质学。"}]}],"synonyms":["Balkan (related context)","Adriatic (regional context)"],"phonetic":"/dɪˈnærɪk/","extraExplanation":["你输入的 **dineric** 很可能是拼写误差；常见的正确拼写是 **Dinaric**（首字母通常大写），来自“Dinar-（迪纳拉）”这一地名词根。","在地理、历史与人类学语境中，你可能还会看到相关词：**Dinarides**（迪纳拉山系/迪纳里德山系）、**Balkan**（巴尔干的）。"]}
{"word":"Dinerman","summary":{"en":"Dinerman is usually a surname; rarely, it may be an informal label for a man associated with a diner.","zh":"Dinerman 通常是英文姓氏；少数情况下也可能是口语中指“与美式小餐馆 diner 有关的男人”的说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname); a proper noun used for a person or family","zh":"姓氏（人名）；作为专有名词使用"},"examples":[{"en":"Ms. Dinerman will join the meeting at 3 p.m.","zh":"Dinerman 女士将于下午三点参加会议。"},{"en":"I found an article written by Dinerman in the local newspaper.","zh":"我在当地报纸上看到一篇由 Dinerman 撰写的文章。"}]},{"partOfSpeech":"other","definition":{"en":"(rare, informal) a man connected with a diner (for example, a diner owner, worker, or regular customer)","zh":"（罕见、非正式）与美式小餐馆 diner 有关联的男性（如店主、员工或常客）"},"examples":[{"en":"He joked that he was a “Dinerman” because he spent every morning at the same diner.","zh":"他开玩笑说自己是“Dinerman”，因为每天早晨都在同一家 diner 里待着。"}]}],"phonetic":"/ˈdaɪnərmən/","extraExplanation":["“Dinerman”更常见的用法是作为英文姓氏（需要大写）。如果你在句子里看到它指代职业或身份，多半是口语式的自创说法，意思通常与diner（美式路边小餐馆）有关。","如果你是在某本书、电影、游戏或某个品牌里看到“Dinerman”，也可能是专有名称（角色名/店名等），具体含义需要结合上下文。"]}
{"word":"dinero","summary":{"en":"“Dinero” means “money,” often used in casual English with a Spanish/Latino vibe.","zh":"“dinero”意为“钱”，在英语里常作为带西语/拉丁风格的口语说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish; also used in English slang/Spanglish) money; cash.","zh":"（西班牙语；也常见于英语俚语/夹杂西语）钱；现金。"},"examples":[{"en":"I need some dinero for the bus fare.","zh":"我需要点钱付公交车费。"},{"en":"He’s always talking about making more dinero.","zh":"他总是在说要赚更多的钱。"},{"en":"They paid me in cash—real dinero.","zh":"他们用现金付我——真金白银。"}]}],"synonyms":["money","cash","bucks","dough"],"phonetic":"/dɪˈnɛroʊ/","extraExplanation":["“Dinero”是西班牙语中最常见的“钱”的说法之一，英语里多出现在口语、嘻哈歌词、电影台词或带拉丁文化风格的表达中。正式英语写作一般用 money/cash。","在英语语境里说“dinero”通常带一点俏皮、酷或“拉丁风”的语气；和中文里说“银子/票子”有点类似。"]}
{"word":"dineros","summary":{"en":"“Dineros” is Spanish for “money” (plural of dinero).","zh":"“dineros”是西班牙语里“钱/资金”的意思（dinero 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish, plural of dinero) money; funds; cash.","zh":"（西语，dinero 的复数）钱；资金；现金。"},"examples":[{"en":"No tengo dineros ahora.","zh":"我现在没有钱。"},{"en":"Necesitamos más dinero(s) para el proyecto.","zh":"这个项目我们需要更多资金。"}]}],"synonyms":["money","cash","funds"],"phonetic":"/diˈneɾos/","extraExplanation":["“dineros”是西班牙语里“钱”的复数形式，但在很多口语场景中，人们也常直接用单数“dinero”来泛指金钱；“dineros”有时带一点强调“很多钱/多笔钱”的感觉。","在英语语境里，如果你在对话或写作中看到“dineros”，通常是在西语夹杂（Spanglish）、引用原话，或文学/影视作品中用来营造西语文化氛围。"]}
{"word":"diners","summary":{"en":"“Diners” can mean people who are eating a meal, or the plural of “diner” meaning informal American-style restaurants.","zh":"“Diners”既可指“用餐的人”，也可指“diner（美式简餐店）”的复数，即多家简餐店。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of diner) a person who is eating a meal, especially in a restaurant.","zh":"（diner 的复数）用餐者；就餐的人（尤指在餐馆里吃饭的人）。"},"examples":[{"en":"The diners chatted quietly while they waited for their food.","zh":"用餐的人一边安静聊天，一边等上菜。"},{"en":"Several diners complained that the soup was too salty.","zh":"几位用餐者抱怨汤太咸。"}]},{"partOfSpeech":"n.","definition":{"en":"(Plural of diner) an informal restaurant, often open late, serving simple, inexpensive food (especially in the U.S.).","zh":"（diner 的复数）（尤指美国）小餐馆；简餐店（常营业到很晚，食物简单、价格实惠）。"},"examples":[{"en":"We stopped at one of the diners off the highway for breakfast.","zh":"我们在高速公路旁的一家简餐店停下来吃早餐。"},{"en":"Old-style diners often have booths, a counter, and coffee served all day.","zh":"老式简餐店常有卡座、吧台，而且全天供应咖啡。"}]}],"synonyms":["customers","patrons","restaurant-goers","cafes","restaurants"],"phonetic":"/ˈdaɪnɚz/","extraExplanation":["在美式英语里，diner 指一种很有文化辨识度的“公路/街角简餐店”，常见元素包括：长吧台（counter）、卡座（booths）、全天咖啡（bottomless coffee）、菜单以早餐与家常菜为主。电影和美剧里常用 diners 来营造“普通人的日常”“深夜谈心”的氛围。"]}
{"word":"dines","summary":{"en":"“Dines” means “eats dinner/has a meal” (formal), used with he/she/it in the present tense.","zh":"“dines”意为“吃晚餐/用餐”（较正式），用于一般现在时的 he/she/it。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(third-person singular of “dine”) to eat dinner; to have a meal, especially in the evening or in a restaurant.","zh":"（动词 dine 的第三人称单数）吃晚餐；用餐（常指晚上或在餐馆就餐）。"},"examples":[{"en":"She usually dines at 7 p.m.","zh":"她通常晚上7点吃晚餐。"},{"en":"He dines out with coworkers on Fridays.","zh":"他周五会和同事外出就餐。"},{"en":"The family dines together whenever they can.","zh":"这家人只要有机会就会一起用餐。"}]}],"synonyms":["eats dinner","has dinner","eats","has a meal","dines out"],"phonetic":"/daɪnz/","extraExplanation":["“dines”是动词“dine”的第三人称单数形式，用于一般现在时（he/she/it dines）。","“dine”比“eat”更正式，常让人联想到“在餐馆用餐”或“比较正式的一顿饭”；口语里更常说“eat dinner”。","常见搭配：dine out（外出就餐）、dine in（在家/店内就餐，不外出）、wine and dine（用美酒佳肴招待、款待）。"]}
{"word":"Dinesen","summary":{"en":"“Dinesen” is most commonly known in English as the pen name (Isak Dinesen) of Danish author Karen Blixen.","zh":"“Dinesen”在英语中最常见的用法是指丹麦作家 Karen Blixen 的笔名（Isak Dinesen）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Danish surname; best known in English as the pen name “Isak Dinesen,” used by the Danish writer Karen Blixen (1885–1962).","zh":"丹麦姓氏；在英语语境中最常见的是作家凯伦·布里克森（Karen Blixen，1885–1962）使用的笔名“Isak Dinesen（伊萨克·迪内森）”。"},"examples":[{"en":"“Out of Africa” was written by Isak Dinesen, the pen name of Karen Blixen.","zh":"《走出非洲》（Out of Africa）由伊萨克·迪内森（Karen Blixen 的笔名）所著。"},{"en":"In some book reviews, the author is listed as Dinesen rather than Blixen.","zh":"在一些书评里，作者会写作 Dinesen，而不是 Blixen。"}]}],"synonyms":["Karen Blixen","Isak Dinesen"],"phonetic":"/ˈdiːnəsən/","extraExplanation":["“Dinesen”本身多作为专有名词（姓/笔名）出现，不像普通词那样有可泛化的词义。","凯伦·布里克森在英文出版中常用笔名 Isak Dinesen；在不同国家与版本里，你可能会看到 Karen Blixen / Isak Dinesen 并列或互换。","她的代表作《Out of Africa》后来被改编为同名电影《走出非洲》（1985）。"]}
{"word":"Dinesh","summary":{"en":"Dinesh is a common Indian male first name.","zh":"Dinesh 是一个常见的印度男性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A masculine given name, most common in India (especially among Hindi and other South Asian language speakers).","zh":"男性名字，最常见于印度（尤其在印地语等南亚语言使用者中）。"},"examples":[{"en":"Dinesh is my coworker; he just joined the team.","zh":"Dinesh 是我的同事；他刚加入团队。"},{"en":"Please ask Dinesh to send the report by Friday.","zh":"请让 Dinesh 在周五前把报告发来。"}]}],"phonetic":"/dɪˈnɛʃ/","extraExplanation":["“Dinesh”常被写作 Dinesh 或 Dinesh Kumar 等形式，源自梵语，常被解释为与“白天/太阳”（day/sun）有关的含义。在英语语境里，它主要作为人名使用；正式称呼时可用 Mr. Dinesh（较少见）或更常见的 Mr. + 姓氏。"]}
{"word":"dinetic","summary":{"en":"“Dinetic” is not standard; you likely mean “kinetic” (about motion) or “dinette” (a small dining area/set).","zh":"“dinetic”不是标准用词；你可能想写“kinetic”（与运动/动能有关）或“dinette”（小餐区/小餐桌椅）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it is most likely a misspelling of “kinetic.”","zh":"不是常见英语词（一般词典中不收录）；很可能是把“kinetic”拼错了。"},"examples":[{"en":"Did you mean “kinetic” (related to motion) instead of “dinetic”?","zh":"你想写的是“kinetic”（与运动有关）而不是“dinetic”吗？"},{"en":"Kinetic energy is the energy of moving objects.","zh":"动能（kinetic energy）是物体运动时具有的能量。"}]},{"partOfSpeech":"other","definition":{"en":"It may also be a misspelling of “dinette,” meaning a small dining area or a small table-and-chairs set.","zh":"也可能是把“dinette”拼错了，dinette 指“小餐区”或“小餐桌椅套装”。"},"examples":[{"en":"We eat breakfast in the dinette next to the kitchen.","zh":"我们在厨房旁边的小餐区（dinette）吃早餐。"},{"en":"The apartment has a dinette set for two people.","zh":"这套公寓配有一套两人用的小餐桌椅（dinette set）。"}]}],"synonyms":["kinetic","dinette"],"phonetic":"/daɪˈnɛtɪk/","extraExplanation":["“dinetic”本身不常见，通常是打字或拼写错误。最常见的两种可能：\n1) kinetic（/kɪˈnɛtɪk/）与“运动、动能”有关，常见于科学语境；\n2) dinette（/dɪˈnɛt/）与“用餐空间/小餐桌椅”有关，常见于房产或家居语境。\n如果你能提供一句包含该词的原句，我可以更准确判断你想表达哪一个。"]}
{"word":"dinette","summary":{"en":"A dinette is a small dining area or small dining set, usually in a kitchen or small home.","zh":"Dinette 指厨房或小户型里常见的小餐区或小型餐桌椅套装。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small dining area or a small set of dining furniture, often used in kitchens or apartments","zh":"（常在厨房或公寓里的）小餐区；小型餐桌椅套装"},"examples":[{"en":"We eat breakfast in the dinette by the window.","zh":"我们在窗边的小餐区吃早餐。"},{"en":"The apartment has a tiny dinette with two chairs.","zh":"这套公寓有一个很小的小餐桌椅，配两把椅子。"}]}],"synonyms":["breakfast nook","eating area","small dining area"],"phonetic":"/daɪˈnɛt/","extraExplanation":["“Dinette”常见于北美房产广告或家居描述中，强调空间较小但功能齐全的用餐角落（如厨房一角、开放式厨房旁）。","词尾“-ette”有“小、较小版本”的含义（如 kitchenette 小厨房，cigarette 小雪茄/香烟），所以 dinette 字面上就是“较小的 dining area/table”。"]}
{"word":"dinettes","summary":{"en":"“Dinettes” is the plural of “dinette,” meaning a small dining area or a compact table-and-chairs set.","zh":"“dinettes”是“dinette”的复数，指小餐区或小型餐桌椅套装。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small dining area (often in or near a kitchen), or a small set of dining furniture (table and chairs) designed for a compact space","zh":"（通常在厨房附近的）小餐区；（适合小空间的）小餐桌椅套装"},"examples":[{"en":"We eat breakfast in the dinette because it’s closer to the kitchen.","zh":"我们在小餐区吃早餐，因为离厨房更近。"},{"en":"The apartment has a dinette set with a small table and two chairs.","zh":"这套公寓配有一套餐桌椅套装：一张小桌子和两把椅子。"},{"en":"They replaced the old dinette with a bigger dining table.","zh":"他们把旧的小餐桌椅套装换成了更大的餐桌。"}]}],"synonyms":["breakfast nook","kitchen nook","small dining area","table-and-chairs set"],"phonetic":"/daɪˈnɛt/","extraExplanation":["“dinette”在美式英语里很常见，常指厨房旁边的小餐角（breakfast nook），也可指专为小户型设计的餐桌椅组合（dinette set）。","你输入的是复数“dinettes”，单数是“dinette”。在实际使用中，“dinette set”这个搭配非常常见。"]}
{"word":"dineuric","summary":{"en":"Dineuric is a rare technical adjective meaning “having two nerves/nerve cords.”","zh":"dineuric 是一个少见的专业形容词，意思是“具有两条神经（或两条神经索）的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Technical, zoology/biology) Having or relating to two nerves or two nerve cords; “two‑nerved.”","zh":"（术语，动物学/生物学）具有两条神经或两条神经索的；“双神经的”。"},"examples":[{"en":"Some descriptions of early mollusks mention a dineuric nervous system with two longitudinal nerve cords.","zh":"一些对早期软体动物的描述会提到一种“dineuric（双神经）”的神经系统，即有两条纵向神经索。"},{"en":"The paper uses “dineuric” to contrast species with a single main nerve cord.","zh":"这篇论文用“dineuric”来对比只有一条主要神经索的物种。"}]}],"synonyms":["two-nerved","bi-neural","double-nerve"],"phonetic":"/daɪˈnʊrɪk/","extraExplanation":["这个词非常少见，主要出现在较专业的动物学/解剖学语境里。词源上可拆为 di-（二、双）+ neur-（神经）+ -ic（形容词后缀），字面意思就是“与两条神经有关的”。","如果你是在具体文章里看到它，最可靠的理解方式是结合上下文：作者通常是在描述某个动物类群的神经结构（例如“有两条纵向神经索”），并用它来和“单一神经索/单神经型”作对比。"]}
{"word":"dineutron","summary":{"en":"“Dineutron” means a (usually unstable) two-neutron system discussed in nuclear physics.","zh":"“dineutron（二中子）”指核物理中讨论的（通常不稳定的）两中子体系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hypothetical or short-lived system of two neutrons bound together (or behaving as a correlated pair) in nuclear physics.","zh":"（核物理）由两个中子组成的假想或极短寿命的结合体系（或表现为强关联的一对中子）。"},"examples":[{"en":"Some experiments search for evidence of a dineutron emitted from certain nuclear reactions.","zh":"一些实验会在特定核反应中寻找“二中子”被发射的证据。"},{"en":"In most conditions, a dineutron is not stable and quickly separates into two neutrons.","zh":"在大多数情况下，“二中子”并不稳定，会很快分裂成两个中子。"},{"en":"Physicists sometimes use “dineutron” as a model to discuss neutron–neutron correlations.","zh":"物理学家有时用“二中子”作为模型来讨论中子—中子之间的关联。"}]}],"synonyms":["two-neutron system","neutron pair"],"phonetic":"/daɪˈnuːtrɑn/","extraExplanation":["“dineutron”由前缀 di-（表示“二、双”）+ neutron（中子）构成，字面意思就是“两个中子”。","在自由空间中，“二中子”通常不被认为是稳定束缚态；但在某些核反应或特定理论框架下，可能出现非常短暂的共振态或强关联“成对”行为，因此该词常见于核结构、放射性核束实验与理论讨论。"]}
{"word":"ding","summary":{"en":"“Ding” usually means a short bell-like sound; it can also mean to dent something slightly or to criticize/mark down.","zh":"“ding”通常指短促的铃声/提示音；也可指轻微磕出凹痕，或指批评、扣分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a short, clear ringing sound, like a bell or a notification.","zh":"（像铃声或提示音那样）短促清脆的“叮”声。"},"examples":[{"en":"I heard a ding and saw a new message on my phone.","zh":"我听到一声“叮”，发现手机上有新消息。"},{"en":"The elevator made a ding when it arrived.","zh":"电梯到了会“叮”一声。"}]},{"partOfSpeech":"v.","definition":{"en":"to make a short ringing sound.","zh":"发出短促清脆的“叮”声。"},"examples":[{"en":"My phone dinged during the meeting.","zh":"开会时我的手机“叮”了一声。"},{"en":"The oven timer dinged to tell us the food was ready.","zh":"烤箱计时器“叮”了一声，提示食物好了。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make a small dent in something; to damage slightly.","zh":"（使）出现小凹痕；轻微损坏。"},"examples":[{"en":"I dinged my car door in the parking lot.","zh":"我在停车场把车门磕出一个小凹痕。"},{"en":"Be careful—those metal edges ding easily.","zh":"小心点——那些金属边很容易磕出小凹痕。"}]},{"partOfSpeech":"vt.","definition":{"en":"to criticize or mark someone/something down (often in reviews or evaluations).","zh":"批评；（在评分/评估中）给低分、挑毛病（常用于评论或考核语境）。"},"examples":[{"en":"The report dinged the company for poor safety practices.","zh":"这份报告批评了该公司安全措施不到位。"},{"en":"The reviewer dinged the movie for its weak ending.","zh":"影评人批评这部电影结尾乏力。"}]}],"synonyms":["ring","chime","ping","beep","dent","criticize","mark down"],"phonetic":"/dɪŋ/","extraExplanation":["“ding”最常见是拟声词（onomatopoeia），模仿铃声/提示音的“叮”。所以在电梯、烤箱计时器、手机通知等场景特别常见。","在美式英语里，“get dinged”也常见，意思是“被扣分/被挑毛病/被记上一笔不良记录”。例如：My credit score got dinged.（我的信用分被影响了。）"]}
{"word":"Ding-Dong","summary":{"en":"“Ding-dong” mainly refers to the bell-like sound of a doorbell, and it can also be used as an interjection to imitate that sound. In British slang it can be an offensive word meaning “crazy/stupid.”","zh":"“ding-dong”主要指门铃/铃铛的“叮咚”声，也可作感叹词模仿铃声；在英式俚语中还可能带冒犯性地表示“疯/蠢”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A sound like a bell ringing (often the sound of a doorbell).","zh":"（拟声）叮咚声；像铃声一样的声音（常指门铃声）。"},"examples":[{"en":"I heard a ding-dong and knew someone was at the door.","zh":"我听到“叮咚”一声，就知道有人在门口。"},{"en":"The doorbell went ding-dong right in the middle of dinner.","zh":"正吃晚饭的时候，门铃突然“叮咚”响了。"}]},{"partOfSpeech":"int.","definition":{"en":"Said to represent the sound of a bell or doorbell.","zh":"（拟声词/感叹词）用来模仿铃声或门铃声。"},"examples":[{"en":"Ding-dong! Can you open the door, please?","zh":"叮咚！你能开一下门吗？"},{"en":"Ding-dong—class is over!","zh":"叮咚——下课了！"}]},{"partOfSpeech":"adj.","definition":{"en":"Continuing with repeated sound or motion like a bell; sometimes used humorously.","zh":"（形容词）叮咚作响的；（有时幽默地）反复响的。"},"examples":[{"en":"We could hear the ding-dong ringing from the hallway.","zh":"我们在走廊里都能听到叮咚作响的铃声。"}]},{"partOfSpeech":"adj.","definition":{"en":"(British informal, offensive) Crazy or stupid.","zh":"（英式非正式，具冒犯性）疯的；很蠢的。"},"examples":[{"en":"That usage can sound rude, so it’s better to avoid it.","zh":"这种用法可能很无礼，所以最好避免使用。"}]}],"synonyms":["doorbell sound","ring-ring","chime","jingle"],"phonetic":"/ˈdɪŋ.dɔŋ/","extraExplanation":["“ding-dong”是典型的拟声词（onomatopoeia），用重复的音节来模仿铃声的节奏。书写上常见连字符 ding-dong，也可能写作 ding dong。","礼貌提醒：英式口语里把人说成 ding-dong 可能带侮辱性（类似骂人“蠢/疯”），在学习和日常交流中建议优先使用表示铃声的中性含义。"]}
{"word":"Dingaan","summary":{"en":"Dingaan is an older spelling of Dingane, a historical Zulu king in early 19th‑century South Africa.","zh":"Dingaan 是 Dingane 的较早拼写，指19世纪早期南非历史上的祖鲁国王。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) An older English spelling of Dingane (Dingane kaSenzangakhona), a Zulu king who ruled in the early 1800s in what is now South Africa.","zh":"（历史）Dingane（丁加内／丁加尼，Dingane kaSenzangakhona）的较早英语拼写形式；他是19世纪早期祖鲁王国的国王，活动地区在今日南非。"},"examples":[{"en":"Some older history books spell the Zulu king’s name as Dingaan instead of Dingane.","zh":"一些较早的历史书会把这位祖鲁国王的名字拼作 Dingaan，而不是 Dingane。"},{"en":"The story of Dingaan often appears in accounts of early conflicts in Natal.","zh":"关于 Dingaan 的故事常出现在描述纳塔尔地区早期冲突的叙述中。"}]}],"synonyms":["Dingane","Dingane kaSenzangakhona"],"phonetic":"/dɪŋˈɡɑːn/","extraExplanation":["“Dingaan”是殖民时期或较早英文资料中常见的拼写；现代更常用“Dingane”。在阅读历史材料时，遇到两种拼写通常指同一位人物。","他与19世纪30年代南部非洲的历史事件常被一起提到，例如与布尔移民（Voortrekkers）的冲突，以及与彼得·雷蒂夫（Piet Retief）相关的叙事；不同社群与史观对这些事件的讲述可能差异很大。"]}
{"word":"dingar","summary":{"en":"“Dingar” is not a standard English word; it’s often a misspelling of “dinger” (baseball slang for a home run) or a name.","zh":"“dingar”不是标准英语词；常见是把“dinger”（棒球口语：全垒打）拼错，或是人名/称呼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Nonstandard or uncommon spelling in English; often a misspelling of “dinger” or a name (not a standard dictionary word).","zh":"英语中不常见/非标准拼写；常见情况是把“dinger”拼错，或作为人名/称呼使用（不属于标准词典词）。"},"examples":[{"en":"I can’t find “dingar” in most English dictionaries—did you mean “dinger”?","zh":"大多数英语词典里找不到“dingar”——你是不是想写“dinger”？"},{"en":"If “Dingar” is a name, please share the sentence so I can explain it in context.","zh":"如果“Dingar”是人名，请给我完整句子，我可以按语境解释。"}]},{"partOfSpeech":"n.","definition":{"en":"(Likely intended) “dinger”: an informal word for a home run in baseball.","zh":"（多半是你想写的）“dinger”：棒球口语，指“全垒打”。"},"examples":[{"en":"He hit a dinger in the ninth inning.","zh":"他在第九局打出一发全垒打。"},{"en":"Fans love a big dinger to win the game.","zh":"球迷都爱看一发关键全垒打锁定胜局。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) “dinger”: something that makes a ringing sound; also used for a dent/knock in some casual speech.","zh":"（较少见）“dinger”：会发出叮当声的东西；口语中也可指一次撞击/小凹痕。"},"examples":[{"en":"My phone made a loud dinger when a message arrived.","zh":"消息一来，我手机发出很响的提示音。"},{"en":"There’s a dinger in the car door from the parking lot.","zh":"车门上有个停车时碰出来的小凹痕。"}]}],"synonyms":["home run (for the baseball meaning)","homer","shot"],"phonetic":"/ˈdɪŋɚ/","extraExplanation":["“dinger”最常见的文化语境是美式英语里的棒球：= home run（全垒打）。在体育新闻、解说、球迷聊天中很常见，但在正式写作里通常用“home run”。","如果你看到“dingar”出现在苏格兰英语/方言或人名（地名、姓氏、网名）里，它可能不是通用英语词汇。给我原句或你想表达的意思，我可以更准确判断。"]}
{"word":"dingbat","summary":{"en":"“Dingbat” can mean (1) a silly person, (2) a picture-word puzzle (rebus), or (3) a decorative typographic symbol.","zh":"“dingbat”可指（1）傻瓜/糊涂蛋，（2）图谜/画谜（rebus），或（3）排版用的装饰符号。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a silly, foolish, or eccentric person","zh":"傻瓜；笨蛋；怪人"},"examples":[{"en":"Don’t be a dingbat—save your work before you close the laptop.","zh":"别犯傻——关电脑前先把文件保存好。"},{"en":"He’s a lovable dingbat who always forgets his keys.","zh":"他是个讨人喜欢的糊涂蛋，总是忘带钥匙。"}]},{"partOfSpeech":"n.","definition":{"en":"a type of picture-word puzzle (also called a rebus), where a phrase is shown using images, symbols, or layout","zh":"（用图像/符号/排版表示词句的）图谜；画谜（类似rebus）"},"examples":[{"en":"The magazine had a dingbat on the last page, and the answer was “back to square one.”","zh":"杂志最后一页有一道图谜，答案是“回到原点”。"},{"en":"Our teacher used dingbats to help us practice idioms.","zh":"老师用图谜帮助我们练习英语习语。"}]},{"partOfSpeech":"n.","definition":{"en":"a decorative symbol or typographic ornament used in printing or design","zh":"（印刷/排版中的）装饰符号；花体小图案"},"examples":[{"en":"The designer added a small dingbat between the sections to make the page look elegant.","zh":"设计师在各段之间加了个小装饰符号，让页面更雅致。"},{"en":"That font includes arrows, stars, and other dingbats.","zh":"那款字体里包含箭头、星形等装饰符号。"}]}],"synonyms":["dummy","goofball","airhead","rebus","word puzzle","ornament","typographic symbol"],"phonetic":"/ˈdɪŋˌbæt/","extraExplanation":["“dingbat”作“傻瓜/糊涂蛋”时，多用于口语，语气通常偏轻松或吐槽，不是很正式；对人当面使用可能显得不礼貌，适合在熟人之间或自嘲使用。","作“图谜”时，在英语学习材料、报刊杂志的益智栏目里较常见；这类题常用图片+字母/位置关系来暗示一个短语或习语。","作“装饰符号”时，常出现在字体软件或排版领域（例如字体里专门的符号集合）。"]}
{"word":"dingbats","summary":{"en":"Dingbats can mean decorative printed symbols, or (informally) a silly person; it can also refer to picture-word puzzles.","zh":"Dingbats 可指印刷/排版中的装饰符号；口语里也可指糊涂的人；还可指一种看图猜短语的文字谜题。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of dingbat) a small printed symbol or decorative mark used in books, newspapers, or design (for example, ❦, ★, or a small icon separating sections).","zh":"（dingbat 的复数）用于书籍、报纸或版面设计中的小符号/装饰性标记（例如 ❦、★，或用于分隔段落的小图标）。"},"examples":[{"en":"The designer added dingbats between the paragraphs to make the page look more elegant.","zh":"设计师在段落之间加了一些装饰符号，让页面看起来更雅致。"},{"en":"In older books, dingbats often mark the end of a chapter.","zh":"在较老的书里，装饰符号常用来标记章节结尾。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) a silly or scatterbrained person.","zh":"（非正式）傻乎乎的人；有点糊涂、冒失的人。"},"examples":[{"en":"Don’t be a dingbat—read the instructions first.","zh":"别犯傻——先把说明读一遍。"},{"en":"I forgot my keys again; I’m such a dingbat sometimes.","zh":"我又忘带钥匙了；我有时候真是有点糊涂。"}]},{"partOfSpeech":"n.","definition":{"en":"a type of picture-word puzzle where you guess a phrase from a visual clue (often seen as a game title).","zh":"一种看图猜短语/成语的文字谜题（也常作为游戏名称出现）。"},"examples":[{"en":"We did a few dingbats in class to practice idioms.","zh":"我们在课上做了几个“看图猜短语”的谜题来练习习语。"},{"en":"This dingbats puzzle is harder than it looks.","zh":"这个看图猜短语的谜题比看起来更难。"}]}],"synonyms":["printer’s ornaments","typographic symbols","(informal) airhead","(informal) scatterbrain"],"phonetic":"/ˈdɪŋˌbæt/","extraExplanation":["“Dingbat”最早与印刷排版有关：早期排字工人会用一些小图形来装饰页面或分隔内容，这类符号后来被统称为 dingbats。","口语里把人叫作 dingbat 通常是轻微的吐槽，语气比更强烈的侮辱词温和，但对不熟的人使用仍可能显得不礼貌。","作为谜题名称时，Dingbats 在英语世界里常见于报纸、杂志或课堂活动：通过文字位置、大小、重复等视觉线索来猜常用短语。"]}
{"word":"Dingbelle","summary":{"en":"“Dingbelle” is not a standard English word; it’s usually a name/username/brand and needs context to interpret.","zh":"“Dingbelle”不是标准英语词汇；通常作为名字/网名/品牌出现，含义需结合语境判断。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A nonstandard or uncommon word in English; most often seen as a name, username, or brand label rather than a dictionary word.","zh":"英语中不属于常见词汇；多见作人名、网名或品牌名，而非标准词条。"},"examples":[{"en":"The email was signed “Dingbelle,” so I assumed it was a username.","zh":"邮件署名是“Dingbelle”，所以我猜那是个网名。"},{"en":"I couldn’t find “Dingbelle” in a dictionary, so it may be a proper name.","zh":"我在词典里找不到“Dingbelle”，所以它可能是专有名词。"}]}],"phonetic":"ˈdɪŋ.bɛl","extraExplanation":["“Dingbelle”在主流英语词典中通常查不到，因此更可能是专有名（人名/昵称/商标）或拼写变体。","如果你想表达“铃声/叮当声”，常见词是 ding（叮的一声）、ding-dong（叮咚声）或 bell（铃）。如果你想表达“美女/佳人”，belle（源自法语）指“美人、佳人”，常见于 southern belle（南方淑女）。","也可能是把两个词拼在一起的创意写法（ding + belle），带有俏皮或品牌感；具体含义需要看使用语境。你可以把出现它的句子发来，我能更准确判断。"]}
{"word":"dingdong","summary":{"en":"“Ding-dong” most commonly means the sound of a doorbell; informally it can also mean a silly/stupid person.","zh":"“ding-dong”最常见是指门铃的叮咚声；在非正式语境中也可指“笨蛋/傻瓜”（带冒犯）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The sound of a doorbell; used to imitate or describe that ringing sound.","zh":"（门铃的）叮咚声；用来模仿或描述门铃响的声音。"},"examples":[{"en":"Ding-dong! Someone’s at the door.","zh":"叮咚！有人在门口。"},{"en":"I heard a ding-dong and went to answer the door.","zh":"我听到门铃叮咚响，就去开门。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) Stupid or silly person; an insult.","zh":"（非正式）笨蛋、傻瓜；带侮辱性的说法。"},"examples":[{"en":"Don’t be a ding-dong—read the instructions first.","zh":"别当个笨蛋——先把说明书看清楚。"},{"en":"He called me a “ding-dong,” which was rude.","zh":"他叫我“笨蛋”，很没礼貌。"}]},{"partOfSpeech":"v.","definition":{"en":"To ring like a doorbell; to make a “ding-dong” sound.","zh":"（门铃般）叮咚作响；发出“叮咚”的声音。"},"examples":[{"en":"The doorbell ding-donged again and again.","zh":"门铃一次又一次地叮咚响。"}]}],"synonyms":["doorbell (sound)","ring","chime","dummy (informal)","idiot (informal)"],"phonetic":"/ˈdɪŋ.dɔŋ/","extraExplanation":["“ding-dong”是拟声词（模仿声音的词），英语里常用连字符写作 ding-dong，也常单独写作 Ding dong! 作为感叹句来模拟门铃声。","把人叫作“ding-dong”在语气上比较刻薄、幼稚，可能冒犯别人；更中性的说法可以用 “silly” 或 “not very smart”（视场合而定）。"]}
{"word":"dingdonged","summary":{"en":"“Dingdonged” means “rang the doorbell,” and it can also mean the prank of ringing a doorbell and running away.","zh":"“dingdonged”表示“按了门铃”；也可指“按门铃就跑”的恶作剧。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense) rang a doorbell (often quickly or playfully).","zh":"（过去式）按了门铃（常指很快或带点玩闹地按）。"},"examples":[{"en":"Someone dingdonged my doorbell late at night.","zh":"有人半夜按了我家门铃。"},{"en":"The delivery driver dingdonged and left the package by the door.","zh":"快递员按了门铃，把包裹放在门口就走了。"}]},{"partOfSpeech":"vt.","definition":{"en":"(informal) did the prank of ringing a doorbell and running away (ding-dong ditch).","zh":"（非正式）玩“按门铃就跑”的恶作剧（ding-dong ditch）。"},"examples":[{"en":"The kids dingdonged our house and hid behind a car.","zh":"孩子们对着我们家按门铃就跑，躲到一辆车后面。"},{"en":"They got in trouble for dingdonging the neighbors after school.","zh":"他们放学后对邻居玩按门铃就跑的恶作剧，结果惹上麻烦。"}]}],"synonyms":["rang (the doorbell)","buzzed","ding-donged","prank-called (not the same, but similar mischief)"],"phonetic":"/ˈdɪŋ.dɔŋd/","extraExplanation":["“ding-dong”本来是模仿门铃/钟声的拟声词。口语里也有人把“ding-dong”当动词用（ding-dong / dingdong），过去式常写作“ding-donged”或“dingdonged”。","和恶作剧相关的更常见说法是短语“ding-dong ditch”（美式英语常用），也有人说“knock-and-run”（更通用）。"]}
{"word":"dingdonging","summary":{"en":"“Dingdonging” usually means the prank of ringing a doorbell and running away, or repeatedly ringing a doorbell to annoy someone.","zh":"“Dingdonging”通常指按门铃就跑的恶作剧，或为了打扰而反复按门铃。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the prank of ringing someone’s doorbell and then running away before they answer (also called “ding-dong ditch”)","zh":"（恶作剧）按响别人家门铃后立刻跑开，让对方来开门却找不到人（也叫“ding-dong ditch”）"},"examples":[{"en":"The neighbors complained about kids dingdonging late at night.","zh":"邻居抱怨有孩子半夜来按门铃恶作剧。"},{"en":"We saw a group of teenagers dingdonging houses on the block.","zh":"我们看到一群青少年在这条街上挨家挨户按门铃恶作剧。"}]},{"partOfSpeech":"v.","definition":{"en":"ringing a doorbell repeatedly (sometimes without running away), often in an annoying way","zh":"反复按门铃（有时不跑开），常带有打扰、惹人烦的意味"},"examples":[{"en":"Someone kept dingdonging the front door during the meeting.","zh":"开会时有人一直反复按前门门铃。"},{"en":"Stop dingdonging—use the intercom or knock once.","zh":"别一直按门铃了——用对讲机或者敲一次门就行。"}]}],"synonyms":["ding-dong ditch","doorbell prank","ring-and-run","knock-and-run"],"phonetic":"/ˈdɪŋˌdɔŋɪŋ/","extraExplanation":["“dingdonging”属于非常口语、非正式的说法，常见于英美口语或社区聊天/社交媒体中。更常见的固定说法是“ding-dong ditch”（按门铃就跑）。","在很多地方这被视为扰民行为；如果发生在夜间或反复骚扰，可能会引发投诉甚至报警。"]}
{"word":"dingdongs","summary":{"en":"“dingdongs” can mean bell-ringing sounds, (informally) foolish people, or the snack cake brand Ding Dongs.","zh":"“dingdongs”可以指门铃/钟声的叮当声，也可（口语）指傻瓜，还可指零食品牌 Ding Dongs。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “ding-dong”: the sound of a bell (or something similar) ringing.","zh":"“ding-dong”的复数：铃铛（或类似物）发出的叮当声。"},"examples":[{"en":"I heard dingdongs from the front door, so I went to answer it.","zh":"我听到前门传来叮当的门铃声，就去开门了。"},{"en":"The dingdongs of the church bells filled the street.","zh":"教堂钟声的叮当回响在街道上。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, sometimes insulting) A foolish or annoying person; “idiot.”","zh":"（非正式，有时带侮辱）傻瓜；讨厌的人。"},"examples":[{"en":"Don’t be a dingdong—double-check the address before you leave.","zh":"别犯傻——出门前再核对一下地址。"},{"en":"He called the driver a dingdong, but it was just a misunderstanding.","zh":"他骂那个司机是傻瓜，但其实只是误会。"}]},{"partOfSpeech":"n.","definition":{"en":"A brand name for small, round chocolate snack cakes (Hostess Ding Dongs).","zh":"一种品牌名：圆形巧克力夹心小蛋糕（Hostess 的 Ding Dongs）。"},"examples":[{"en":"She bought a box of Ding Dongs at the convenience store.","zh":"她在便利店买了一盒 Ding Dongs。"},{"en":"These dingdongs are a sweet, nostalgic snack for some Americans.","zh":"对一些美国人来说，这种 Ding Dongs 是很有怀旧感的甜点零食。"}]}],"synonyms":["bell rings","chimes","dings","idiots (rude)","silly person"],"phonetic":"/ˈdɪŋ.dɔŋz/","extraExplanation":["“ding-dong”最常见的来源是拟声词，用来模仿门铃或钟声；写作 ding-dong / dingdong 都能见到，复数常写 dingdongs。","把人叫作 dingdong 在语气上通常比 “idiot” 轻一点，但仍可能冒犯他人；更礼貌的说法可以用 “silly” 或直接描述行为问题。","作为零食品牌时常写作大写 “Ding Dongs”，有时也会省略连字符；在阅读菜单或购物清单时可用上下文判断是“声音”还是“零食”。"]}
{"word":"dinge","summary":{"en":"Dinge means a dull grayish stain or discoloration, and it can also mean to make something look dingy or discolored.","zh":"dinge 指灰暗的污渍/色调，也可作动词表示使变得灰暗、脏旧或褪色。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a dull grayish stain, tint, or discoloration (often from dirt, smoke, or age)","zh":"灰暗的污渍；灰蒙蒙的色调（常因灰尘、烟渍或老化造成）"},"examples":[{"en":"The white curtains had a yellow-gray dinge from cigarette smoke.","zh":"白色窗帘被香烟烟雾熏出了发黄发灰的污渍。"},{"en":"There was a dusty dinge on the mirror after the renovation.","zh":"装修后镜子上蒙了一层灰暗的尘垢。"}]},{"partOfSpeech":"v.","definition":{"en":"to make something look dirty, dull, or grayish; to discolor","zh":"使变脏、变暗或发灰；使褪色、使变得灰蒙蒙"},"examples":[{"en":"City pollution dinged the building’s stone over time.","zh":"城市污染让那栋楼的石材日久变得发灰暗。"},{"en":"Don’t leave the sweater in the sun—it can get dinged and look old.","zh":"别把毛衣晒在太阳下——可能会变得暗淡发旧。"}]}],"synonyms":["stain","smudge","discoloration","grime","dinginess","tarnish"],"phonetic":"/dɪndʒ/","extraExplanation":["“dinge”常用于描述一种“不够干净、不够明亮”的灰暗感，比起单纯的“stain（污渍）”，它更强调整体发旧、发灰、失去光泽的视觉效果。"]}
{"word":"dinged","summary":{"en":"“Dinged” means (1) made a short ringing sound, or (2) got/caused small damage like a dent; it can also be an adjective meaning “slightly damaged.”","zh":"“dinged”表示（1）发出短促叮当声，或（2）造成/出现轻微磕碰损伤；也可作形容词，表示“有点磕坏的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “ding”: to make a short ringing sound, often like a small bell or notification.","zh":"“ding”的过去式/过去分词：发出短促的叮当声，常像小铃或提示音。"},"examples":[{"en":"My phone dinged in the middle of the meeting.","zh":"我的手机在会议中间叮了一声。"},{"en":"The elevator bell dinged when we reached the lobby.","zh":"电梯到达大厅时铃声叮地响了一下。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “ding”: to cause minor damage (a small dent, scratch, or mark).","zh":"“ding”的过去式/过去分词：造成轻微损伤（小凹痕、刮痕或印记）。"},"examples":[{"en":"I dinged the car door in the parking lot.","zh":"我在停车场把车门磕出一个小凹痕。"},{"en":"The suitcase got dinged during the flight.","zh":"行李箱在飞行途中被磕碰出痕迹。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Adjective) Slightly damaged or marked; dented.","zh":"（形容词）有轻微损坏或痕迹的；有小凹痕的。"},"examples":[{"en":"The box arrived dinged, but the item inside was fine.","zh":"盒子送到时有点磕坏，但里面的东西没事。"},{"en":"He bought a dinged laptop at a discount.","zh":"他折扣买了一台外壳有些磕碰的笔记本电脑。"}]}],"synonyms":["rang","chimed","beeped","dented","scratched","nicked"],"phonetic":"/dɪŋd/","extraExplanation":["“ding”在口语里还常表示“给……带来负面影响/扣分”，例如：My credit score got dinged.（我的信用分被扣了。）","“ding”也可以指“叮”的提示音（通知声），在现代语境里非常常见。"]}
{"word":"dingee","summary":{"en":"“Dingee” is usually a misspelling of “dinghy,” meaning a small boat used for short trips, often between a ship and the shore.","zh":"“dingee”通常是“dinghy”的拼写错误，指用于短途往返的小艇，常用于大船与岸之间。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small open boat (often an inflatable or lightweight rowboat) used for short trips, especially to travel between a larger ship and the shore.","zh":"小艇；（常指充气或轻便的）舢板/小划艇，常用于大船与岸之间的短途往返。"},"examples":[{"en":"We took a dinghy from the yacht to the beach.","zh":"我们坐小艇从游艇到海滩。"},{"en":"A dinghy is useful when the water is too shallow for a big boat.","zh":"水太浅、大船进不去时，小艇就很实用。"}]}],"synonyms":["dinghy","small boat","tender"],"phonetic":"/ˈdɪŋɡi/","extraExplanation":["“dingee”通常是把 **dinghy** 拼错了；标准拼法是 **dinghy**。","词源上，**dinghy** 来自印度/南亚地区的用词（与印地语、孟加拉语等相关），后来进入英语，指一种小船。","在海上或航海语境里很常见：大船旁的小艇常被用来接送人或运送物资。"]}
{"word":"dingeing","summary":{"en":"“Dingeing” means making something look dull/dirty or becoming dull in appearance (from the rare verb “dinge”).","zh":"“dingeing”指使某物变得灰暗、脏旧或失去光泽（源自较少见的动词“dinge”）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “dinge”) making something look dull, dirty, or less bright; discoloring or tarnishing.","zh":"（“dinge”的现在分词）使……变得暗淡、肮脏或不鲜亮；使褪色、失去光泽。"},"examples":[{"en":"Smoke was dingeing the walls over time.","zh":"烟熏随着时间把墙壁熏得发暗。"},{"en":"Years of dust and sunlight were dingeing the once-white curtains.","zh":"多年的灰尘和日晒让原本洁白的窗帘变得发灰。"}]},{"partOfSpeech":"vi.","definition":{"en":"(rare, literary) becoming dull or dingy in appearance.","zh":"（较少见，偏文学）外观变得暗淡、灰旧。"},"examples":[{"en":"The paint was slowly dingeing in the harsh weather.","zh":"在恶劣天气下，油漆慢慢变得黯淡。"}]}],"synonyms":["dulling","darkening","tarnishing","discoloring","griming"],"phonetic":"/ˈdɪndʒɪŋ/","extraExplanation":["“dinge”比较少见，更常见的相关词是“dingy”（adj. 灰暗的、脏旧的）。学习时可把“dinge”理解为“让东西变得dingy”。","注意不要和“dinging”（来自“ding”，表示“叮当响/撞击发声”或“给……造成小凹痕”）混淆；“dingeing”强调“变暗、变脏、失去光泽”。"]}
{"word":"Dingell","summary":{"en":"“Dingell” is a surname, best known from U.S. politics (the Dingell congressmen) and from laws or programs named after them (e.g., the Dingell Act).","zh":"“Dingell”是一个姓氏，主要因美国政界的丁格尔议员家族而知名，也可指以其命名的法案或项目（如“丁格尔法案”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A surname, especially known in U.S. politics because of the long-serving Michigan congressmen John Dingell Sr. and John Dingell Jr.","zh":"一个姓氏，尤以美国政治领域著名：密歇根州的联邦众议员约翰·丁格尔（父子两代），其中约翰·丁格尔二世任职时间特别长。"},"examples":[{"en":"John Dingell Jr. represented Michigan in the U.S. House for decades.","zh":"约翰·丁格尔二世在美国众议院代表密歇根州长达数十年。"},{"en":"The article mentioned the Dingell family’s influence in Michigan politics.","zh":"这篇文章提到了丁格尔家族在密歇根州政治中的影响力。"}]},{"partOfSpeech":"n.","definition":{"en":"In U.S. law and news, “Dingell” can refer to things named after the Dingell family, such as the John D. Dingell, Jr. Conservation, Management, and Recreation Act (“the Dingell Act”).","zh":"在美国法律与新闻语境中，“Dingell”也可指以丁格尔家族命名的事物，例如《约翰·丁格尔二世保护、管理与娱乐法案》（常称“丁格尔法案”）。"},"examples":[{"en":"The Dingell Act expanded protections for certain public lands.","zh":"丁格尔法案扩大了对部分公共土地的保护。"},{"en":"Some lawmakers called it a landmark conservation bill, the Dingell Act.","zh":"一些立法者称其为具有里程碑意义的环保法案——丁格尔法案。"}]}],"phonetic":"/ˈdɪŋɡəl/","extraExplanation":["“Dingell”的读音常见为 /ˈdɪŋɡəl/，重音在第一音节；在英语新闻里通常作为姓氏出现，不像普通词汇那样有“词义变化”。","约翰·丁格尔二世（John Dingell Jr.）曾是美国国会任职时间最长的议员之一，因此在政治报道、纪念性法案命名、公共政策讨论中经常出现这个姓氏。"]}
{"word":"Dingelstadt","summary":{"en":"Dingelstadt (Dingelstädt) is a town in Thuringia, Germany.","zh":"Dingelstadt（德语：Dingelstädt）是德国图林根州的一个城镇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A town (municipality) in Thuringia, central Germany.","zh":"德国中部图林根州的一个城镇（市镇）。"},"examples":[{"en":"Dingelstädt is located in the Eichsfeld region of Thuringia.","zh":"丁格尔施泰特位于图林根州的艾希斯费尔德地区。"},{"en":"We stopped in Dingelstädt on our drive through central Germany.","zh":"我们开车穿越德国中部时在丁格尔施泰特停留了一下。"}]}],"phonetic":"/ˈdɪŋəlʃtæt/","extraExplanation":["这是一个德语地名（专有名词），英语里通常不翻译，只是按德语拼写使用；中文常见译名为“丁格尔施泰特/丁格尔斯塔特”（不同资料会有细微差异）。","德语地名里常见的 -stadt 表示“城市/城镇”（相当于英语的 -town / -city），所以你会在很多地名中看到它。","德语原拼写是 Dingelstädt（含 ä），在不方便输入变音符号时常写作 Dingelstadt；两者指同一地点。"]}
{"word":"dinger","summary":{"en":"Dinger is an informal noun most commonly meaning a baseball home run; it can also mean a dent or something that makes a “ding” sound.","zh":"dinger 是非正式名词，最常指棒球的本垒打；也可指凹痕，或会发出“叮”声的小装置/铃。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal, sports) A home run in baseball; a long, hard-hit ball.","zh":"（非正式，体育）棒球中的本垒打；一记很远、很有力的击球。"},"examples":[{"en":"He hit a dinger to left field in the seventh inning.","zh":"他在第七局把球轰到左外野，打出了一支本垒打。"},{"en":"The crowd went wild after that two-run dinger.","zh":"那支两分本垒打之后，观众席沸腾了。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) A noticeable dent or damage mark, especially on a car or metal surface.","zh":"（非正式）明显的凹痕/磕碰痕迹，尤指车身或金属表面上的损伤。"},"examples":[{"en":"There’s a dinger on the back bumper from the parking lot.","zh":"后保险杠上有个凹痕，是停车场里磕出来的。"},{"en":"It’s an old truck—another little dinger won’t matter.","zh":"这是一辆旧卡车——再多一个小凹痕也无所谓。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) Something that makes a “ding” sound; sometimes used for a small bell or device that rings.","zh":"（非正式）会发出“叮”声的东西；有时指小铃铛或会响的装置。"},"examples":[{"en":"Press the dinger on the counter when you’re ready to order.","zh":"你准备点单时按一下柜台上的小铃。"},{"en":"The bike’s dinger is broken, so it doesn’t ring.","zh":"这辆车的铃坏了，所以不响。"}]}],"synonyms":["(home run) homer","(dent) dent","(bell/device) bell"],"phonetic":"ˈdɪŋɚ","extraExplanation":["“dinger”在美国英语里最常见的用法来自棒球俚语，尤其在解说、球迷聊天和体育媒体标题中很常见，语气轻松口语化。","“dinger”也可能在不同地区被用来指“凹痕”或“叮当作响的小铃/按钮”，具体要看语境。"]}
{"word":"dinges","summary":{"en":"An informal placeholder word for an unnamed person or thing.","zh":"指代没说出名字的人或物的非正式“占位词”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A placeholder word used when you don’t know, can’t remember, or don’t want to say the name of a person or thing; like “thingamajig” or “what’s-his-name.”","zh":"（非正式）当你不知道、想不起来或不想说出某人/某物的名字时，用来代替名称的词；相当于“那个……/叫什么来着/某某”。"},"examples":[{"en":"Pass me the dinges—uh, the screwdriver.","zh":"把那个 dinges 递给我——呃，就是螺丝刀。"},{"en":"I met Dinges at the conference, but I forgot his real name.","zh":"我在会议上见到了 Dinges（某某），但我忘了他的真名。"}]}],"synonyms":["thingamajig","whatchamacallit","thingy","doohickey","what’s-his-name","what’s-her-name"],"phonetic":"/ˈdɪŋɡəs/","extraExplanation":["“dinges”常见于南非英语/南非荷兰语（Afrikaans）语境，是非常口语的“占位词”，类似英语的“thingy / whatchamacallit / what’s-his-name”。在正式写作中通常不使用。"]}
{"word":"Dingess","summary":{"en":"“Dingess” is most commonly a surname, and it can also be a U.S. place name (e.g., Dingess, West Virginia).","zh":"“Dingess”最常见是姓氏，也可作美国地名（如西弗吉尼亚州的 Dingess）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname)","zh":"姓氏（家族姓）"},"examples":[{"en":"Ms. Dingess signed the letter at the bottom.","zh":"丁格斯女士在信件底部签了名。"},{"en":"I met Dr. Dingess at the conference.","zh":"我在会议上认识了丁格斯博士。"}]},{"partOfSpeech":"other","definition":{"en":"a place name (especially an unincorporated community in the U.S., such as Dingess, West Virginia)","zh":"地名（尤指美国的地名，例如西弗吉尼亚州的丁格斯镇/社区）"},"examples":[{"en":"They drove through Dingess, West Virginia on their way home.","zh":"他们回家路上开车经过了西弗吉尼亚州的丁格斯。"},{"en":"Dingess is a small community with a local post office.","zh":"丁格斯是个小社区，有当地邮局。"}]}],"synonyms":["(as a surname/place name, no true synonyms)"],"phonetic":"/ˈdɪŋɡɪs/","extraExplanation":["“Dingess”通常是专有名词（人名或地名），所以在句首或作为姓名时一般要大写。","它有时会让学习者联想到俚语“dingus”（指“那东西/那家伙”，略带不礼貌），但“Dingess”和“dingus”不是同一个词，含义也不同。"]}
{"word":"dingey","summary":{"en":"“Dingey” is a nonstandard spelling most often meaning “dingy” (dirty, dull, or dim). Less commonly, it’s used for “dinghy,” a small boat.","zh":"“dingey”多为非标准拼写，通常表示“dingy”（脏、暗淡、阴暗）。较少情况下也用来指“dinghy”（小艇）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Dirty-looking and dull in color; not clean or bright.","zh":"脏兮兮的；颜色暗淡、不鲜亮的。"},"examples":[{"en":"The curtains were dingey and smelled like smoke.","zh":"窗帘脏兮兮的，还带着烟味。"},{"en":"He wore a dingey white T-shirt that used to be bright.","zh":"他穿着一件发灰的白T恤，原本应该很亮白。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not well-lit; gloomy or dim.","zh":"光线不足的；阴暗的。"},"examples":[{"en":"They met in a dingey hallway with one weak light bulb.","zh":"他们在一条阴暗的走廊里见面，只有一盏昏弱的灯泡。"},{"en":"The restaurant was small and dingey, but the food was great.","zh":"这家餐厅又小又昏暗，但食物很好吃。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common spelling) A small boat, especially a small inflatable boat carried by a larger boat.","zh":"（较少见拼写）小艇；（尤指大船携带的）充气小船/附属艇。"},"examples":[{"en":"They took the dingey to shore from the sailboat.","zh":"他们从帆船上乘小艇上岸。"},{"en":"A dingey can be useful for short trips near the coast.","zh":"小艇在海岸附近短途出行时很实用。"}]}],"synonyms":["dingy","grimy","drab","shabby","dim","gloomy"],"phonetic":"/ˈdɪŋi/","extraExplanation":["“dingey”在实际使用中常见于两种词的非标准拼写：\n1) “dingy”（形容词：脏、暗淡、阴暗）——这是最常见的意思。\n2) “dinghy”（名词：小艇）——读音相同 /ˈdɪŋi/，但标准拼写是 dinghy。\n如果你想表达“脏/阴暗”，建议写 dingy；如果是“小艇”，建议写 dinghy。"]}
{"word":"dingeys","summary":{"en":"“Dingeys” is a nonstandard spelling, usually meaning small boats (standard: “dinghies,” plural of “dinghy”). Rarely it reflects “dingey” meaning “dingy” (dirty, dull).","zh":"“dingeys”多为非标准拼写，通常指小艇（标准写法为“dinghies”，是“dinghy”的复数）。少数情况下也可能对应“dingey=dingy”，表示灰暗脏旧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard spelling) plural of “dingey,” meaning small boats (more standard: “dinghies,” plural of “dinghy”).","zh":"（非标准拼写）“dingey”的复数，指小船；更常见、更标准的写法是“dinghies”（“dinghy”的复数）。"},"examples":[{"en":"Several dingeys/dinghies were tied up near the dock.","zh":"几艘小艇（dingeys/dinghies）拴在码头附近。"},{"en":"The crew lowered the dingeys to go ashore.","zh":"船员把小艇放下水，准备上岸。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) “dingey” as an adjective meaning dirty, dull, or not bright (more standard: “dingy”).","zh":"（罕见）“dingey”作形容词，表示肮脏的、灰暗的、不明亮的；更常见写法为“dingy”。"},"examples":[{"en":"The hallway looked dingey after years without paint.","zh":"走廊多年没刷漆，看起来灰暗脏旧。"},{"en":"He stayed in a dingey room with a single small window.","zh":"他住在一间灰暗的小房间里，只有一扇小窗。"}]}],"synonyms":["dinghies","small boats","tenders","dingy (adj.)","drab"],"phonetic":"/ˈdɪŋi/","extraExplanation":["“dingeys”在英语里常被认为是拼写错误或不常见拼写：\n- 说“小艇”时，标准是 dinghy（单数）→ dinghies（复数）。\n- 说“灰暗/脏旧”时，标准是 dingy（形容词）。\n如果你在短信、口语转写、或非正式写作里看到 dingeys，通常可根据上下文判断是在指 dinghies（小艇）。"]}
{"word":"dinghee","summary":{"en":"“dinghee” usually refers to a “dinghy”: a small boat, often used as a tender or a small sailboat.","zh":"“dinghee”通常指“dinghy”：一种小艇，常作为大船的附属船，或指小型帆船。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly spelled “dinghy”) a small boat, often carried on a larger boat and used to travel short distances (for example, from a ship to shore).","zh":"（常见拼写为“dinghy”）小艇；（常由大船携带、用于短距离往返的）附属小船/救生小艇。"},"examples":[{"en":"They took a dinghy from the yacht to the beach.","zh":"他们从游艇乘小艇到海滩。"},{"en":"A dinghy is useful when you need to reach shallow water.","zh":"当你需要进入浅水区时，小艇很有用。"}]},{"partOfSpeech":"n.","definition":{"en":"a small sailboat used for training or racing.","zh":"（用于训练或比赛的）小型帆船。"},"examples":[{"en":"She learned to sail in a two-person dinghy.","zh":"她在一艘双人小帆船上学习航海。"}]}],"synonyms":["small boat","tender","rowboat (sometimes)"],"phonetic":"/ˈdɪŋɡi/","extraExplanation":["“dinghee”通常被认为是“dinghy”的非标准拼写或误拼。标准拼写是 dinghy，但发音仍然是 /ˈdɪŋɡi/（结尾发“ee”音）。","词源上，“dinghy”来自印地语/乌尔都语相关词（指小船），经英式英语进入现代英语，因此拼写看起来有点“不按常理”。"]}
{"word":"dinghies","summary":{"en":"“Dinghies” means small boats, usually used near shore or as a tender to a larger boat.","zh":"“Dinghies”指小艇，常在近岸使用或作为大船/游艇的接驳附属艇。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"small boats, especially open boats used as tenders to larger ships/yachts or for short trips close to shore (plural of “dinghy”)","zh":"小艇；（尤指）大船/游艇的附属小船、靠岸短途用的敞口小船（“dinghy”的复数）"},"examples":[{"en":"The sailors took the dinghies to shore to buy supplies.","zh":"水手们乘小艇上岸采购补给。"},{"en":"We stored the dinghies on the deck during the storm.","zh":"暴风雨来时，我们把小艇固定在甲板上。"},{"en":"Two dinghies followed the yacht into the harbor.","zh":"两艘小艇跟着游艇进了港。"}]}],"synonyms":["small boats","tenders","skiffs","rowboats"],"phonetic":"/ˈdɪŋɡi/","extraExplanation":["在航海语境中，dinghy 常指“tender”（母船的接驳艇/附属小船），用于从停泊的船只往返岸边。现代也常见充气式小艇（inflatable dinghy），轻便、易收纳。"]}
{"word":"dinghy","summary":{"en":"A dinghy is a small boat, often used as a tender to travel between a larger boat and the shore.","zh":"dinghy 指小艇，常作为大船的接驳艇往返岸边。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small open boat (often carried on a larger boat) used for short trips, rowing, or moving people and supplies to shore","zh":"小艇；舢板（常由大船携带，用于短途划行或把人和物资运到岸上）"},"examples":[{"en":"We took a dinghy from the yacht to the beach.","zh":"我们乘小艇从游艇去海滩。"},{"en":"The crew loaded supplies into the dinghy.","zh":"船员把补给装进小艇里。"},{"en":"A sudden wave rocked the dinghy.","zh":"一个浪突然把小艇晃得摇摇摆摆。"}]}],"synonyms":["small boat","tender","rowboat","skiff"],"phonetic":"/ˈdɪŋɡi/","extraExplanation":["“Dinghy”常见于航海/游艇语境，尤其指“大船上的小船”（tender），用来接驳上岸或在停泊时短距离移动。","词源可能与印地语/孟加拉语中表示“小船”的词有关，反映了英国殖民时期在南亚的航海交流。"]}
{"word":"dingier","summary":{"en":"“Dingier” means “more dingy”—darker, dirtier, or more shabby-looking.","zh":"“dingier”表示“更昏暗/更脏/更显陈旧”，是“dingy”的比较级。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comparative form of **dingy**: darker, dirtier, or more worn-looking (often because of age, dust, smoke, or lack of light).","zh":"**dingy** 的比较级：更昏暗、更肮脏或更显陈旧（常因年代久、灰尘、烟熏或光线不足）。"},"examples":[{"en":"This room feels **dingier** than the one upstairs.","zh":"这个房间比楼上的那个更阴暗、更旧。"},{"en":"After the rain, the white shoes looked even **dingier**.","zh":"下雨后，那双白鞋看起来更脏、更灰了。"},{"en":"The hallway got **dingier** as we walked farther from the windows.","zh":"我们离窗户越远，走廊就越显得昏暗。"}]}],"synonyms":["darker","grubbier","shabbier","more run-down","murkier"],"phonetic":"/ˈdɪndʒiər/","extraExplanation":["“dingier”是形容词“dingy”的比较级。拼写规则：以辅音字母 + y 结尾的形容词，变比较级时通常把 y 改成 i 再加 -er（dingy → dingier；dry → drier）。","“dingy/dingier”既可以形容“光线差导致的昏暗”，也常形容“颜色被污渍、烟灰、时间弄得发灰发暗的脏旧感”，语气偏负面。"]}
{"word":"dingies","summary":{"en":"Dinghy (plural: dinghies) means a small boat, often used to travel between a larger boat and the shore.","zh":"Dinghy（复数 dinghies）指小艇，常用于大船与岸边之间的短途往返。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small open boat, often carried on a larger ship and used to go between the ship and the shore (plural: dinghies)","zh":"小艇；（常由大船携带、用于往返岸边的）救生艇/接驳小船（复数：dinghies）"},"examples":[{"en":"We took a dinghy from the yacht to the beach.","zh":"我们乘小艇从游艇到海滩。"},{"en":"The sailors lowered the dinghy into the water.","zh":"水手把小艇放入水中。"}]}],"synonyms":["small boat","tender","rowboat"],"phonetic":"/ˈdɪŋi/","extraExplanation":["你输入的“dingies”多半是拼写错误；正确拼法是 **dinghies**（单数 **dinghy**）。因为以辅音字母 + y 结尾的名词变复数时，常把 y 改成 i 再加 es（y → ies）。","**dinghy** 常见于航海/游艇语境：大船上的“tender（接驳艇）”经常就是一种 dinghy，用来短距离运送人或物到岸边。"]}
{"word":"dingiest","summary":{"en":"“Dingiest” means the most dingy: the darkest, dirtiest-looking, or most shabby.","zh":"“dingiest”表示“最脏旧/最昏暗/最破旧的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative of “dingy”: the most dirty-looking, dark, or in poor condition (often because it’s old and not well cleaned).","zh":"“dingy”的最高级：最肮脏的、最昏暗的或最破旧的（常因年代久、缺少清洁而显得脏旧）。"},"examples":[{"en":"That was the dingiest apartment I toured—dark walls, stained carpet, and a musty smell.","zh":"那是我看过最脏最旧的公寓——墙很暗、地毯有污渍，还有一股霉味。"},{"en":"We ended up in the dingiest corner of the café because everything else was full.","zh":"因为其他位置都坐满了，我们最后坐在咖啡馆最阴暗的角落。"},{"en":"He wore the dingiest jacket in the closet, the one with the faded elbows.","zh":"他穿了衣柜里最旧最脏的夹克，就是那件肘部都褪色的。"}]}],"synonyms":["shabbiest","grimiest","dirtiest-looking","darkest","most run-down"],"phonetic":"/ˈdɪn.dʒi.ɪst/","extraExplanation":["“dingy”常用来形容地方（公寓、酒吧、走廊）或物品（衣服、窗帘）看起来“灰暗脏旧”。它不仅是“脏”，还带有“昏暗、缺乏光亮、让人不舒服”的感觉。","词源上与“dinge”（暗色、污渍）有关，所以“dingy”更偏向“灰扑扑、发黄发暗”的脏旧感，而不一定是刚弄上的泥或污点。"]}
{"word":"dingily","summary":{"en":"“Dingily” means ‘in a dingy (dark, dirty, gloomy) way.’","zh":"“dingily”表示“以昏暗、肮脏、阴沉的方式/状态”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a dark, dirty, or gloomy way; not brightly lit or clean.","zh":"以昏暗、肮脏或阴沉的方式；（光线）不明亮或不洁净地。"},"examples":[{"en":"The hallway was dingily lit by a single weak bulb.","zh":"走廊只有一盏微弱的灯泡，照得昏昏暗暗。"},{"en":"He sat dingily in the corner of the old café, near the dusty window.","zh":"他坐在老咖啡馆的角落里，靠着落满灰尘的窗边，显得很阴暗。"}]}],"synonyms":["dimly","gloomily","shabbily","grubbily"],"phonetic":"/ˈdɪndʒəli/","extraExplanation":["“dingily”来自形容词“dingy”（昏暗的、肮脏的），加上副词后缀 -ly 组成。写作和文学里偶尔会用来营造“陈旧、压抑、光线不足”的氛围；日常口语中更常说 “in a dingy way / in a dim, dirty place”。"]}
{"word":"dinginess","summary":{"en":"Dinginess means a dull, dark, dirty, or shabby state, especially about rooms or appearance.","zh":"Dinginess 指昏暗脏旧、灰暗或破旧邋遢的状态，常用于环境或外观。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a state of being dull, dirty, or not bright; a slightly dark, gloomy quality (often about rooms, buildings, or colors)","zh":"（环境或颜色）昏暗、脏旧、不明亮的状态；带点阴沉的感觉"},"examples":[{"en":"The apartment’s dinginess made it feel smaller than it was.","zh":"公寓的昏暗脏旧让它感觉比实际更小。"},{"en":"Fresh paint and better lighting removed the dinginess from the hallway.","zh":"重新刷漆并改善照明后，走廊的昏暗感消失了。"}]},{"partOfSpeech":"n.","definition":{"en":"(about a person’s appearance) a look of being untidy or shabby","zh":"（指人的外表）邋遢、破旧的样子"},"examples":[{"en":"He tried to hide the dinginess of his old coat at the interview.","zh":"面试时他尽量掩饰旧外套的破旧邋遢。"}]}],"synonyms":["drabness","shabbiness","grubbiness","gloom","dullness"],"phonetic":"/ˈdɪŋi.nəs/","extraExplanation":["“dinginess”来自形容词“dingy”（昏暗的、脏旧的）加名词后缀“-ness”（表示“……的状态/性质”）。","常见搭配：the dinginess of + 地方/物品（某处的昏暗脏旧）；remove/clear away the dinginess（消除昏暗感）。","语气通常偏负面，常用来形容光线不足、缺乏清洁或缺少维护带来的“灰暗感”。"]}
{"word":"dinginesses","summary":{"en":"“Dinginesses” is the plural of “dinginess,” meaning multiple instances of a dark, dirty, gloomy look or feel.","zh":"“dinginesses”是“dinginess”的复数，指多处/多种昏暗、脏旧、阴沉的外观或氛围。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being dingy: slightly dark, dirty, and not cheerful (plural form).","zh":"昏暗、肮脏而不整洁的状态；阴沉感（复数形式）。"},"examples":[{"en":"The inspector noted the dinginesses of the basement rooms and recommended better lighting.","zh":"检查员指出地下室房间的昏暗与脏旧，并建议改善照明。"},{"en":"After the renovation, the old dinginesses disappeared and the space felt welcoming.","zh":"翻新后，原先的阴沉脏旧感消失了，空间变得更舒适宜人。"}]},{"partOfSpeech":"n.","definition":{"en":"areas or rooms that look dingy (plural).","zh":"显得昏暗脏旧的地方/房间（复数）。"},"examples":[{"en":"They moved out of the dinginesses and into a bright, clean apartment.","zh":"他们从那些昏暗脏旧的地方搬出来，住进一间明亮干净的公寓。"}]}],"synonyms":["drabness","shabbiness","grubbiness","gloom","dullness"],"phonetic":"/ˈdɪndʒinəsɪz/","extraExplanation":["“dinginesses”是名词“dinginess”的复数，但在日常英语里更常见的是不可数用法：the dinginess of the room（房间的昏暗/脏旧感）。需要强调“多处/多种昏暗脏旧情况”时才更可能用复数。","词根来自形容词“dingy”（昏暗的、脏旧的）。常与light/lighting（照明）、grime（污垢）、stale（陈旧/不新鲜的）等词一起出现。"]}
{"word":"dinging","summary":{"en":"Dinging usually means making a short ringing “ding” sound, and it can also mean causing a small dent.","zh":"Dinging 通常指发出“叮”的清脆声，也可指造成小凹痕（轻微磕碰）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"making a short, clear ringing sound (like a bell or notification)","zh":"发出短促清脆的“叮”声（像铃声或提示音）"},"examples":[{"en":"My phone keeps dinging during the meeting.","zh":"开会时我的手机一直在叮叮响。"},{"en":"The elevator bell was dinging on every floor.","zh":"电梯到每一层都会叮一声。"}]},{"partOfSpeech":"vt.","definition":{"en":"making a small dent or causing minor damage (usually to metal, like a car door)","zh":"弄出小凹痕；造成轻微磕碰（常指金属表面，如车门）"},"examples":[{"en":"Someone dinged my car door in the parking lot.","zh":"有人在停车场把我的车门磕出了一个小凹痕。"},{"en":"Be careful not to ding the bicycle frame.","zh":"小心别把自行车车架磕凹了。"}]}],"synonyms":["ringing","chiming","tinting","denting","nicking"],"phonetic":"/ˈdɪŋɪŋ/","extraExplanation":["“ding”是拟声词，模仿铃声、提示音那种清脆的“叮”。在现代语境里常用来形容手机通知、电脑提示音等。","口语里也常把“ding”当作名词用：a ding = 一个小凹痕（如车门上的小坑）。"]}
{"word":"Dingle","summary":{"en":"A dingle is a small, often wooded valley; more rarely, it can mean a foolish person (informal).","zh":"dingle常指一处幽深的（常有树林的）小山谷；较少见时也可作口语指“傻瓜/讨厌的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, usually wooded valley or secluded hollow.","zh":"小山谷；（常指）林木茂密、较隐蔽的山谷/洼地。"},"examples":[{"en":"We followed the stream down into a shaded dingle.","zh":"我们沿着小溪往下走，进入一处阴凉的林间小山谷。"},{"en":"In spring, wildflowers cover the dingle behind the village.","zh":"春天时，村子后面的小山谷开满了野花。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, rare) A foolish or annoying person.","zh":"（非正式，较少见）傻瓜；讨厌的人。"},"examples":[{"en":"Don’t be a dingle—read the instructions first.","zh":"别犯傻——先把说明书读一遍。"}]}],"synonyms":["small valley","wooded valley","hollow","glen","ravine (sometimes)","fool (informal, rare)"],"phonetic":"/ˈdɪŋɡəl/","extraExplanation":["“dingle”在现代英语里最常见的意思是“幽深的小山谷”，带一点文学/诗意色彩，常出现在英式地名或自然描写中。","词源与古英语/古诺斯语中表示“山谷、凹地”的词有关；在英国一些地区方言和地名里更常见。","第二个“傻瓜”的用法属于口语俚语，地区性较强，也不算正式；在写作或正式场合更建议用“fool / idiot / jerk”等更常见词。"]}
{"word":"dingle","summary":{"en":"A (often wooded) small, narrow valley; a quaint/old-fashioned British/Irish word.","zh":"（常为林地的）狭小山谷；偏英式/爱尔兰用法，略古旧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, narrow valley, often wooded; a little dell or hollow (mainly British/Irish, somewhat old-fashioned).","zh":"（多用于英式/爱尔兰英语，较古旧）狭小的山谷、林谷；小溪谷、洼地。"},"examples":[{"en":"They followed the path down into a shady dingle filled with ferns.","zh":"他们沿着小路走进一条阴凉的林谷，里面长满了蕨类。"},{"en":"In the poem, the cottage sits quietly beside a dingle.","zh":"在诗中，小屋静静地坐落在一条小山谷旁。"}]}],"synonyms":["dell","hollow","small valley","ravine"],"phonetic":"/ˈdɪŋɡəl/","extraExplanation":["“dingle”在现代口语中不算常用，更多见于英国/爱尔兰的地名、文学描写或较传统的自然景观叙述中，语感类似更常见的“dell（小谷）”“hollow（洼地）”。","爱尔兰有著名地名“Dingle”（丁格尔），如Dingle Peninsula（丁格尔半岛）。地名中的Dingle通常保留了历史用法，并不等同于日常英语里常用的普通名词。"]}
{"word":"dingleberry","summary":{"en":"“Dingleberry” is vulgar slang for a piece of dried feces stuck to anal hair, and it can also be used as a childish-sounding insult for an annoying or stupid person.","zh":"“Dingleberry”是带粗俗色彩的俚语，指粘在肛门周围毛发上的干结粪便；也可作带幼稚口吻的侮辱语，指讨厌或愚蠢的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(vulgar, slang) A small piece of dried feces stuck to hair around the anus.","zh":"（粗俗俚语）粘在肛门周围毛发上的一小块干结粪便。"},"examples":[{"en":"After the hike, the vet checked the dog and cleaned off a dingleberry.","zh":"徒步后，兽医检查了那只狗，并清理掉粘着的“dingleberry”。"},{"en":"He joked grossly about finding a dingleberry, which made everyone uncomfortable.","zh":"他用很恶心的方式开“dingleberry”的玩笑，让大家很不舒服。"}]},{"partOfSpeech":"n.","definition":{"en":"(slang, insult) A stupid, annoying, or contemptible person.","zh":"（俚语，侮辱性用法）蠢人；讨厌的人；不值得尊重的人。"},"examples":[{"en":"Stop being a dingleberry and listen for a minute.","zh":"别像个蠢蛋一样了，先听我说一分钟。"},{"en":"She called him a dingleberry for forgetting the tickets again.","zh":"他又忘带票，她就骂他是个蠢货。"}]}],"synonyms":["(literal) fecal matter (formal)","(insult) idiot","jerk","moron"],"phonetic":"/ˈdɪŋɡəlˌbɛri/","extraExplanation":["这是非常口语、带粗俗色彩的词：本义与排泄物有关，在正式场合或陌生人面前使用会显得不礼貌，甚至令人反感。","当作“骂人话”时语气偏轻佻、幼稚（有点像小孩式的脏话），在朋友间玩笑可能出现，但仍可能冒犯他人。"]}
{"word":"dinglebird","summary":{"en":"“Dinglebird” is a very rare/nonstandard humorous insult for a foolish or annoying person.","zh":"“dinglebird”是非常少见/非标准的玩笑式骂人词，指愚蠢或烦人的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard, humorous) A made-up or very rare slang insult meaning a silly, annoying, or foolish person.","zh":"（非标准、幽默用语）一个编造或极少见的俚语式侮辱词，大意是“傻乎乎/烦人/愚蠢的人”。"},"examples":[{"en":"Don’t be a dinglebird—read the instructions first.","zh":"别当个“dinglebird”——先把说明书读一下。"},{"en":"He forgot his keys again; what a dinglebird.","zh":"他又忘带钥匙了，真是个“dinglebird”。"}]}],"synonyms":["dingbat","doofus","goofball","dummy","idiot (stronger)"],"phonetic":"/ˈdɪŋɡəlbɝd/","extraExplanation":["“dinglebird”不是常见的标准英语词，通常更像是临时造出来的玩笑式骂人话（轻度冒犯，语气看场合）。如果你是在网络、游戏或某段对话里看到，它可能只是某个社群的内部梗。","很多人想表达类似意思时，更常用的是“dingbat”（傻瓜）或“dingleberry”（更粗俗的俚语，带明显不雅含义）。如果你告诉我你看到它的句子，我可以帮你判断具体语气和更自然的替代表达。"]}
{"word":"dingled","summary":{"en":"“Dingled” is an uncommon past form of *dingle*, meaning “tingled” or “jingled faintly.”","zh":"“dingled”较少见，是 *dingle* 的过去式/过去分词，可表示“轻微刺痛”或“隐约叮当作响”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of *dingle*) to tingle lightly or ring/jingle faintly (old-fashioned or dialect).","zh":"（*dingle* 的过去式/过去分词）轻微刺痛；（铃声等）叮当作响、隐约作响（较古老或方言用法）。"},"examples":[{"en":"After the cold wind, my fingers dingled for a few minutes.","zh":"冷风吹过后，我的手指刺痛了几分钟。"},{"en":"The small bells on the door dingled as she walked in.","zh":"她走进来时，门上的小铃铛叮当作响。"}]}],"synonyms":["tingled","jingled","jangled"],"phonetic":"/ˈdɪŋɡəld/","extraExplanation":["“dingled”在现代英语里不常见，多数学习者更常遇到的是 **tingled**（刺痛/麻麻的）或 **jingled**（叮当响）。","也有人会把它误写成 **dangled**（悬荡、垂着摇晃）。如果你想表达“悬着晃动”，更自然的词通常是 *dangled*。","名词 **dingle** 还可以表示“（常在英国英语里）林木茂密的小山谷/小峡谷”，但“dingled”本身通常不是这个名词义。"]}
{"word":"dingledangle","summary":{"en":"Dingledangle (also dingle-dangle) is an informal word meaning “to dangle or swing loosely,” or a small dangling decoration.","zh":"dingledangle（也写作 dingle-dangle）是非正式说法，意思是“悬垂并晃动”，也可指“小挂坠/垂着的装饰”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(informal) to hang down loosely and move back and forth; to dangle.","zh":"（非正式）松松地垂下来并来回晃动；摇摆、悬垂。"},"examples":[{"en":"Your shoelace is dingledangling—tie it before you trip.","zh":"你的鞋带在那儿晃来晃去——先系好，免得绊倒。"},{"en":"Keys dingledangled from his belt as he walked.","zh":"他走路时，钥匙从腰带上晃来晃去。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) something that hangs and swings, especially a small decoration or dangling part.","zh":"（非正式）晃来晃去垂着的东西；（尤指）小挂饰、垂坠部件。"},"examples":[{"en":"The bag has little dingledangles on the zipper.","zh":"这个包的拉链上有几个小挂坠。"}]}],"synonyms":["dangle","hang loosely","swing","bob","pendant (n.)"],"phonetic":"/ˈdɪŋɡəlˌdæŋɡəl/","extraExplanation":["“dingledangle / dingle-dangle”属于带有儿童口吻、拟声/叠音感的表达（两个相似音节连用），常用于轻松语境，强调“晃来晃去、没收拾利索”的画面感。","更常见的写法是带连字符的 “dingle-dangle”。在正式写作里通常用更中性的 “dangle / hang loosely / swing” 来替代。"]}
{"word":"dingles","summary":{"en":"Dingles is the plural of dingle, meaning a small wooded valley; it also has a rare vulgar slang meaning you should generally avoid.","zh":"dingles 是 dingle 的复数，常指（有树林的）小山谷；另有罕见的粗俗俚语含义，一般应避免使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural: dingles) a small, usually wooded valley or narrow dell; a little hollow between hills.","zh":"（复数：dingles）小山谷；（常有树林的）狭长山谷/幽谷。"},"examples":[{"en":"They followed a stream down into a shady dingle.","zh":"他们沿着小溪走进一处阴凉的小山谷。"},{"en":"Wildflowers grew along the edge of the dingle.","zh":"野花沿着山谷边缘生长。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, informal, dated) a vulgar slang word for the male genitals.","zh":"（罕见；非正式；较旧用法）粗俗俚语：男性生殖器。"},"examples":[{"en":"This meaning is uncommon in modern use and may be offensive, so avoid it in polite conversation.","zh":"这个含义在现代并不常见且可能冒犯他人，正式或礼貌场合应避免使用。"}]}],"synonyms":["dell","small valley","hollow","ravine"],"phonetic":"/ˈdɪŋɡəl/","extraExplanation":["“dingle”在英式英语里更常见，常出现在描写乡村风景的文学或地名中，带有一种“幽静、隐蔽的山谷”的画面感。","如果你看到地名里有 Dingle（如爱尔兰的 Dingle 半岛/小镇），那通常是专有名词，不按普通名词的含义直译。"]}
{"word":"dingling","summary":{"en":"“Dingling” means a light, clear ringing sound (or to make that sound), like a small bell.","zh":"“dingling”指像小铃铛一样清脆的叮当声，或指发出这种叮当声。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a clear, light ringing sound, like a small bell","zh":"（像小铃铛一样）清脆、轻轻的叮当声"},"examples":[{"en":"I heard the dingling of the bell at the front door.","zh":"我听到前门门铃清脆的叮当声。"},{"en":"The dingling of her bracelet was soft and pleasant.","zh":"她手链的叮当声很轻柔、很好听。"}]},{"partOfSpeech":"v.","definition":{"en":"to make a light ringing sound, like a small bell","zh":"发出清脆的叮当声（如小铃铛）"},"examples":[{"en":"The bell dingled as the cat walked by.","zh":"猫走过时，铃铛叮当作响。"},{"en":"Keys dingled in his pocket when he ran.","zh":"他跑起来时，口袋里的钥匙叮当作响。"}]}],"synonyms":["jingle","tinkle","ring","clang (louder)","ding"],"phonetic":"/ˈdɪŋlɪŋ/","extraExplanation":["“dingling”属于拟声词（onomatopoeia），用声音来模仿现实中的铃声、金属轻碰声等。日常英语里更常见的写法/用法包括“ding-a-ling”（名词/形容铃声）以及动词“ding”（短促叮的一声）或“jingle”（一串清脆声）。","在写作里，“dingling”常用来营造轻快、可爱或“有小物件在晃动”的画面感，比如风铃、手链、小铃铛等。"]}
{"word":"dingly","summary":{"en":"“Dingly” is a rare, old-fashioned word meaning dark/gloomy or dingy; it can also mean “in a gloomy way.”","zh":"“dingly”是一个罕见、较旧的词，表示昏暗阴沉或黯淡肮脏；也可作副词表示“昏暗地”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare, old-fashioned) Dark, gloomy, or poorly lit; dingy.","zh":"（罕见、较旧用法）昏暗的；阴沉的；肮脏黯淡的（类似 dingy）。"},"examples":[{"en":"They walked down a dingly corridor that smelled of damp stone.","zh":"他们走进一条昏暗的走廊，潮湿的石头味扑面而来。"},{"en":"The shop looked dingly in the late-afternoon light.","zh":"在傍晚的光线下，那家店看起来很阴暗。"}]},{"partOfSpeech":"adv.","definition":{"en":"(rare) In a dark or gloomy way.","zh":"（罕见）以昏暗、阴沉的方式。"},"examples":[{"en":"A single bulb shone dingly above the stairs.","zh":"楼梯上方一只灯泡昏昏地亮着。"}]}],"synonyms":["dim","dark","gloomy","dingy","shadowy"],"phonetic":"ˈdɪŋɡli","extraExplanation":["“dingly”在现代英语里非常少见，多见于方言或较老的文学语境。日常表达通常用“dim / dark / gloomy / dingy”。","它和“dingy（肮脏黯淡的）”在意义上很接近；如果你想表达“看起来旧旧脏脏、光线又差”，用“dingy”更自然。"]}
{"word":"Dingman","summary":{"en":"Dingman is usually a surname, and sometimes a place name.","zh":"Dingman 通常是姓氏，有时也用作地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a surname (family name), used especially in English-speaking countries","zh":"（常见于英语国家的）姓氏"},"examples":[{"en":"Ms. Dingman is our new math teacher.","zh":"丁曼女士是我们的新数学老师。"},{"en":"I met someone named Alex Dingman at the conference.","zh":"我在会议上遇到一个叫亚历克斯·丁曼的人。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name (proper noun) used in some locations, especially in the United States","zh":"（专有名词）某些地区的地名，尤指美国的一些地方"},"examples":[{"en":"They bought a house near Dingman Township.","zh":"他们在丁曼镇附近买了一套房子。"}]}],"phonetic":"/ˈdɪŋmən/","extraExplanation":["“Dingman”多见于人名（姓氏），因此在句子里通常要大写：Dingman。","在美国也能见到以此命名的地名或学校名称（是否指具体地点，需要结合上下文确认）。"]}
{"word":"dingman","summary":{"en":"Dingman is most commonly a surname, and it can also be used as a place or road name.","zh":"Dingman最常见的是姓氏，也可作为地名或道路名称使用。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname).","zh":"（姓氏）丁曼 / Dingman（常见于英语国家的姓）"},"examples":[{"en":"Ms. Dingman will lead the meeting today.","zh":"丁曼女士今天将主持会议。"},{"en":"I met a teacher named Dingman in college.","zh":"我在大学里认识了一位姓丁曼的老师。"}]},{"partOfSpeech":"other","definition":{"en":"a place name used for some roads, neighborhoods, or local areas (e.g., “Dingman Road”).","zh":"（地名/道路名）用于一些道路、社区或地方的名称（如“Dingman Road/丁曼路”）。"},"examples":[{"en":"Turn left onto Dingman Road after the gas station.","zh":"过了加油站后左转上丁曼路。"},{"en":"They bought a house near Dingman Drive.","zh":"他们在丁曼大道附近买了房子。"}]}],"phonetic":"/ˈdɪŋmən/","extraExplanation":["“Dingman”通常作为专有名词使用：要么是姓氏，要么是地名/路名。发音上重音在第一音节：DING-man。","作为姓氏时，常见写法首字母大写（Dingman）；若看到全小写（dingman），很多时候只是输入时未大写。"]}
{"word":"dingmaul","summary":{"en":"“dingmaul” is not recognized as a standard English word; it’s likely a misspelling or a proper name.","zh":"“dingmaul”不是标准英语词；更可能是拼写错误或专有名词（如人名/品牌）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a made-up/brand/name form.","zh":"不是标准英语单词。很可能是拼写错误，或是人名/品牌名/自造词。"},"examples":[{"en":"I couldn’t find “dingmaul” in a standard English dictionary—could you share the sentence where you saw it?","zh":"我在常见英语词典里找不到“dingmaul”，你能把它出现的句子发我吗？"},{"en":"It might be a name or username rather than a vocabulary word.","zh":"它也可能是姓名或用户名，而不是词汇。"}]}],"extraExplanation":["从字形上看，它可能由 ding + maul 组成：ding 常指“叮当声/小凹痕”，maul 常指“（粗暴地）殴打/撕咬/重击”。但把它们直接连在一起并不是常见英语用法，因此更像拼写错误或专有名词。","如果你想查的是某个接近的词，常见可能包括：ding（叮当声；小凹痕）、maul（重击；撕咬）、Dingwall（地名/姓氏）、Dingman（姓氏）。把原句或上下文贴出来，我可以更准确判断。"]}
{"word":"dingo","summary":{"en":"A dingo is an Australian wild dog; in informal Australian English it can also be an insult for a bad or untrustworthy person.","zh":"dingo 指澳洲野犬；在澳式口语中也可作贬义称呼，指不可靠或讨厌的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A wild dog native to Australia, known for its sandy-colored coat and howling; it can live in the wild or around human settlements.","zh":"澳洲野犬；澳大利亚特有的野生犬科动物，常见沙黄色毛，善于嚎叫；可生活在野外或靠近人类聚居地。"},"examples":[{"en":"We saw a dingo near the campsite at dusk.","zh":"黄昏时我们在营地附近看到一只澳洲野犬。"},{"en":"Farmers sometimes protect livestock from dingoes.","zh":"农民有时会保护家畜免受澳洲野犬侵袭。"},{"en":"The dingo’s howl carried across the desert.","zh":"澳洲野犬的嚎叫声在沙漠中回荡。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, Australia) A cowardly, unpleasant, or untrustworthy person (an insult).","zh":"（澳式口语，贬义）懦弱、讨厌或不可信的人（骂人的说法）。"},"examples":[{"en":"Don’t be a dingo—tell them the truth.","zh":"别当个怂人——把真相告诉他们。"},{"en":"He called the corrupt official a “dingo.”","zh":"他把那个腐败官员骂成“dingo”。"}]}],"synonyms":["wild dog","canine"],"phonetic":"/ˈdɪŋɡoʊ/","extraExplanation":["“Dingo”在澳大利亚文化中很有代表性：它既是自然生态里的标志性动物，也常出现在民间故事、纪录片与旅行语境中。","词源来自澳大利亚原住民语言（常被认为与达鲁格语有关），后进入英语。","在英语媒体中偶尔会看到与“a dingo ate my baby”相关的引用，这是源于澳大利亚一桩著名案件的流行文化梗；提及此事时要注意语境与尊重当事人。"]}
{"word":"dingoes","summary":{"en":"“Dingoes” is the plural form of “dingo,” meaning wild Australian dogs.","zh":"“dingoes”是“dingo”的复数形式，指澳大利亚的野犬。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wild Australian dog (often sandy-colored) that lives in the outback and may hunt in groups; also used generally for this animal as a species","zh":"澳洲野犬（常呈沙黄色），生活在澳大利亚内陆荒野，可能成群狩猎；也可泛指该物种"},"examples":[{"en":"We saw dingoes near the campsite at dusk.","zh":"黄昏时我们在营地附近看到了几只澳洲野犬。"},{"en":"Dingoes are native to Australia and are well adapted to dry environments.","zh":"澳洲野犬原产于澳大利亚，非常适应干燥环境。"}]}],"synonyms":["wild dogs","Australian wild dogs"],"phonetic":"/ˈdɪŋɡoʊz/","extraExplanation":["“dingo”在澳大利亚文化中很常见，既出现在自然纪录片里，也常见于旅行提示（比如不要喂野生动物、把食物收好）。在英语中有时会提到广为人知的说法“a dingo ate my baby”（源自真实案件与后续媒体传播），通常带有文化背景与争议，使用时要注意语境与敏感性。"]}
{"word":"dings","summary":{"en":"“Dings” usually means small dents/marks or short ringing sounds; as a verb it can mean to dent lightly or to give a minor penalty/criticism.","zh":"“Dings”常指小凹痕/磕碰痕或短促的叮当声；作动词可指轻微撞出凹痕，或给予小扣分/小批评。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"small dents, nicks, or marks on a surface (plural of “ding”)","zh":"（表面上的）小凹痕、磕碰痕、划痕（“ding”的复数）"},"examples":[{"en":"My car door has a few dings from the parking lot.","zh":"我的车门在停车场被磕出了几处小凹痕。"},{"en":"The suitcase arrived with scratches and dings.","zh":"行李箱到达时带着划痕和磕碰痕。"}]},{"partOfSpeech":"n.","definition":{"en":"short ringing sounds, like a bell or notification (plural of “ding”)","zh":"叮当声、提示音（如铃声或通知音）（“ding”的复数）"},"examples":[{"en":"I heard two dings and knew I got new messages.","zh":"我听到两声提示音，就知道有新消息来了。"},{"en":"The elevator made a couple of dings as it stopped on each floor.","zh":"电梯每到一层都会叮当响几声。"}]},{"partOfSpeech":"v.","definition":{"en":"to make a small dent or to lightly hit; also, to give a small penalty/criticism (third-person singular: “dings”)","zh":"使出现小凹痕；轻撞；也指给小惩罚/小扣分、挑小毛病（第三人称单数：“dings”）"},"examples":[{"en":"He dings the car every time he parks too close to the pole.","zh":"他每次把车停得离柱子太近都会把车磕出凹痕。"},{"en":"The app dings your account if you pay late.","zh":"如果你逾期付款，这个应用会给你的账户记一次不良记录/扣分。"},{"en":"The reviewer dings the movie for weak dialogue.","zh":"影评人批评这部电影的对白薄弱。"}]}],"synonyms":["dents","nicks","marks","scratches","pings","chimes","penalizes","criticizes"],"phonetic":"/dɪŋz/","extraExplanation":["“ding”常见于口语，表示“轻微但看得见/听得见的小问题”。在美式英语里很常说：get dinged（被扣分/被挑毛病/信用受影响）。例如：My credit score got dinged.（我的信用分被影响了。）"]}
{"word":"dingthrift","summary":{"en":"Dingthrift is a rare, old-fashioned word for someone who wastes money (or for wasteful spending).","zh":"Dingthrift 是一个少见的古旧词，指挥霍钱财的人，或指挥霍的行为/习惯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who wastes money; a spendthrift (old-fashioned/rare).","zh":"挥霍钱财的人；败家子（古旧/少见）"},"examples":[{"en":"His friends warned him that he was becoming a dingthrift with his gambling.","zh":"朋友们警告他，他沉迷赌博，正变成一个挥霍钱财的人。"},{"en":"In the novel, the dingthrift son sells off the family’s land to fund a flashy lifestyle.","zh":"在小说里，这个败家子为了铺张的生活把家里的土地都卖了。"}]},{"partOfSpeech":"adj.","definition":{"en":"wasteful with money; spending too much (old-fashioned/rare).","zh":"（在金钱上）挥霍的；浪费的（古旧/少见）"},"examples":[{"en":"She criticized his dingthrift habits and asked him to start saving.","zh":"她批评他挥霍的习惯，要求他开始存钱。"}]}],"synonyms":["spendthrift","big spender","wastrel","profligate","wasteful"],"phonetic":"/ˈdɪŋˌθrɪft/","extraExplanation":["“dingthrift”是较罕见的古词，意思接近更常见的“spendthrift（挥霍者）”。有学者认为它与早期英语/苏格兰英语里表示“打、赶、逼迫”的“ding”有关，整体带有“把钱敲打着花掉/乱花”的形象感。现代英语中更自然的表达通常是“spendthrift, big spender, wasteful”。"]}
{"word":"Dingus","summary":{"en":"“Dingus” is an informal word meaning a foolish person (mild insult) or an unnamed/unknown thing.","zh":"“dingus”是口语：可指“傻瓜/笨蛋”（较轻的骂法），也可指“叫不出名字的东西”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A silly, annoying, or foolish person; a mild insult.","zh":"（非正式）笨蛋、傻瓜；带点调侃或轻微侮辱的称呼。"},"examples":[{"en":"Don’t be a dingus—check the due date before you submit it.","zh":"别犯傻——提交前先看看截止日期。"},{"en":"I locked my keys in the car like a total dingus.","zh":"我把钥匙锁在车里了，真是蠢到家。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) A thing whose name you don’t know or can’t remember; a gadget/thingamajig.","zh":"（非正式）叫不出名字的东西；某个小玩意儿/那个东西。"},"examples":[{"en":"Hand me that dingus on the table—the little plastic clip.","zh":"把桌上那个小东西递给我——那个塑料夹子。"}]}],"synonyms":["goofball","doofus","dummy","goof","thingamajig","whatchamacallit","doohickey"],"phonetic":"/ˈdɪŋɡəs/","extraExplanation":["“dingus”在美式英语里多用于口语、朋友之间的打趣，语气通常比“idiot”轻，但对不熟的人使用仍可能显得不礼貌。","也可指“叫不出名字的东西”，类似“thingamajig / whatchamacallit / doohickey”。","词源不太确定，20世纪在美国口语中逐渐流行。"]}
{"word":"dingus","summary":{"en":"“Dingus” is an informal word for a silly person or an unnamed/unknown object, often used jokingly.","zh":"“dingus”是非正式用语，常指“傻瓜/笨蛋”，也可指“一时想不起名字的东西”，多带玩笑语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a silly or annoying person (often said in a joking or mildly insulting way)","zh":"傻瓜；笨蛋（多为开玩笑或轻微贬义）"},"examples":[{"en":"Don’t be a dingus—your keys are in your other pocket.","zh":"别犯傻——你的钥匙在另一个口袋里。"},{"en":"I forgot to hit “save.” I’m such a dingus.","zh":"我忘了点“保存”了。我真是个笨蛋。"}]},{"partOfSpeech":"n.","definition":{"en":"a thing whose name you don’t know or can’t remember; a gadget or object (informal)","zh":"不知名/一时想不起名字的东西；小玩意儿（非正式）"},"examples":[{"en":"Hand me that dingus on the table—the little plastic clip.","zh":"把桌上那个玩意儿递给我——那个小塑料夹子。"},{"en":"This dingus is supposed to hold the phone while you drive.","zh":"这个小东西据说是开车时用来固定手机的。"}]}],"synonyms":["dummy","doofus","goofball","idiot (stronger)","thingamajig","whatchamacallit"],"phonetic":"/ˈdɪŋɡəs/","extraExplanation":["“Dingus”是非常口语、带点戏谑感的词，语气通常比“idiot”轻一些，但对不熟的人使用可能仍显得不礼貌。","词源并不十分确定；在美式英语里常见于日常吐槽、朋友间打趣，或当作“whatchamacallit/thingamajig（那个叫什么来着的东西）”的替代说法。"]}
{"word":"dinguses","summary":{"en":"“Dinguses” is the plural of “dingus”: an informal word for an unnamed thing/gadget or (mildly) a silly person.","zh":"“Dinguses”是“dingus”的复数：口语里可指叫不出名字的小东西/小工具，也可（轻微地）指有点笨的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of dingus) a thing or gadget whose real name you don’t know or don’t want to say.","zh":"（dingus 的复数）指叫不出名字或不想说出名称的东西/小工具。"},"examples":[{"en":"Hand me those dinguses on the table—the little metal clips.","zh":"把桌上那些 dinguses 递给我——就是那些小金属夹子。"},{"en":"I need a dingus to tighten this; do you have the right tool?","zh":"我需要个什么东西把它拧紧；你有合适的工具吗？"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) a person who seems foolish, clumsy, or annoying (usually a mild insult).","zh":"（非正式）指看起来有点笨、粗心或惹人烦的人（通常是比较轻的骂法）。"},"examples":[{"en":"Don’t be a dingus—read the instructions first.","zh":"别当个 dingus——先把说明书读一遍。"},{"en":"I felt like a dingus after I sent the email to the wrong person.","zh":"我把邮件发错人后，感觉自己像个 dingus。"}]}],"synonyms":["thingamajigs","whatchamacallits","doohickeys","gadgets","goofballs"],"phonetic":"ˈdɪŋɡəs","extraExplanation":["“dingus”在美式英语里很口语，语气通常偏调侃或轻微责备，比更强烈的侮辱性词语温和。","也常用来临时指代“那个玩意儿/小东西”，类似中文的“那个东西/小玩意儿”。在正式写作中不太合适。"]}
{"word":"Dingwall","summary":{"en":"Dingwall is mainly a Scottish place name (a town in the Highlands) and also a surname derived from that place.","zh":"Dingwall 主要是苏格兰地名（高地的一座城镇），也可作由该地名衍生的姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A town in the Scottish Highlands, near Inverness, historically associated with the Ross (Ross-shire) area.","zh":"苏格兰高地的一座城镇，靠近因弗内斯（Inverness），历史上与罗斯地区（Ross-shire）有关。"},"examples":[{"en":"We stopped in Dingwall on our way to the Isle of Skye.","zh":"我们去斯凯岛（Isle of Skye）的路上在丁沃尔（Dingwall）停了一下。"},{"en":"Dingwall is a small town, but it has a railway station and local history sites.","zh":"丁沃尔是个小镇，但它有火车站和一些当地历史景点。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname (family name), originally linked to people from the place called Dingwall.","zh":"一个姓氏（家族姓），最初多与来自丁沃尔这一地名的人有关。"},"examples":[{"en":"Her last name is Dingwall, and her family has Scottish roots.","zh":"她姓丁沃尔（Dingwall），家族有苏格兰血统。"}]}],"phonetic":"/ˈdɪŋwɔl/","extraExplanation":["“Dingwall”这个地名普遍认为源自古诺斯语（Old Norse）相关词根，常被解释为与“集会之地/议事之地”（类似“thing”议会）有关，反映了维京时代在苏格兰北部的历史影响。"]}
{"word":"dingwall","summary":{"en":"Dingwall is best known as a town in the Scottish Highlands; it can also refer to other places or a surname.","zh":"Dingwall 最常指苏格兰高地的城镇丁沃尔；也可指其他地方的地名或姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A town in the Scottish Highlands, near Inverness; the historic county town of Ross and Cromarty.","zh":"丁沃尔（Dingwall）：苏格兰高地的一座城镇，靠近因弗内斯；历史上是罗斯与克罗马蒂郡的郡治所在地。"},"examples":[{"en":"We drove from Inverness to Dingwall in under half an hour.","zh":"我们从因弗内斯开车到丁沃尔，不到半小时就到了。"},{"en":"The train line stops at Dingwall before heading farther north.","zh":"火车在前往更北方之前会停靠丁沃尔。"}]},{"partOfSpeech":"n.","definition":{"en":"A place name used elsewhere (for example, small communities in Canada) and sometimes a family name.","zh":"丁沃尔：也可作其他地区（如加拿大一些小社区）的地名，有时也作姓氏使用。"},"examples":[{"en":"Her grandfather was born in Dingwall, Manitoba.","zh":"她祖父出生在加拿大曼尼托巴的丁沃尔。"},{"en":"Dingwall is also used as a surname in some English-speaking countries.","zh":"在一些英语国家，Dingwall 也会被用作姓氏。"}]}],"phonetic":"/ˈdɪŋ.wɔl/","extraExplanation":["词源上常被认为与古诺尔斯语有关：þing（集会、议会）+ vǫllr（平地、原野），大意可理解为“议会集会的平地”。这类诺尔斯语地名在苏格兰北部较常见，反映了维京时代的历史影响。"]}
{"word":"dingy","summary":{"en":"Dingy usually describes something dirty-looking and dim; less commonly it can mean a small boat (dinghy).","zh":"dingy 通常形容东西脏旧发暗；较少见时可指小艇（同 dinghy）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Dirty-looking and a bit dark, often because it is old or not well cared for.","zh":"（因陈旧或缺乏打理而）肮脏发暗的，灰蒙蒙的。"},"examples":[{"en":"The hotel room looked small and dingy, so we asked to change rooms.","zh":"那间酒店房间又小又阴暗脏旧，所以我们要求换房。"},{"en":"He wore a dingy white T-shirt that used to be bright.","zh":"他穿着一件发灰的白T恤，原本是很亮白的。"}]},{"partOfSpeech":"n.","definition":{"en":"A small inflatable boat; a dinghy.","zh":"小艇；充气小船（同 dinghy）。"},"examples":[{"en":"They climbed into a dingy and paddled toward the shore.","zh":"他们爬进一只小艇，划向岸边。"}]}],"synonyms":["grimy","shabby","drab","squalid","dirty-looking"],"phonetic":"/ˈdɪndʒi/","extraExplanation":["“dingy”（形容词）常带有负面语气，强调“脏、旧、发暗”的感觉，常与 room, alley, apartment, clothes 等搭配。","注意别和“dinghy /ˈdɪŋɡi/”（小艇）混淆：发音不同、含义也不同；“dingy”作名词表示“小艇”时，属于较少见的用法。"]}
{"word":"dinheiro","summary":{"en":"“Dinheiro” is Portuguese for “money,” including cash or funds.","zh":"“dinheiro”是葡萄牙语，意思是“钱”，可指现金或资金。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"money; cash; funds (Portuguese word).","zh":"钱；现金；资金（葡萄牙语单词）。"},"examples":[{"en":"I don’t have any dinheiro right now.","zh":"我现在没有钱。"},{"en":"She saved dinheiro to buy a new phone.","zh":"她存钱买了一部新手机。"},{"en":"How much dinheiro do you need?","zh":"你需要多少钱？"}]}],"synonyms":["money","cash","funds","currency"],"phonetic":"/diˈnɛɹoʊ/","extraExplanation":["“dinheiro”在葡语里是最常用的“钱”的说法，可指现金或一般意义上的金钱/资金。","常见搭配：sem dinheiro（没钱）、ganhar dinheiro（赚钱）、fazer dinheiro（挣钱/搞到钱）、economizar dinheiro（省钱/存钱）。","复数“dinheiros”较少用于日常“钱”的意思；更多出现在较正式或强调“多笔钱/财产”的语境中。"]}
{"word":"dinic","summary":{"en":"“Dinic” most often refers to Dinic’s algorithm for computing maximum flow in a network (and it’s also a surname).","zh":"“Dinic”多指用于求网络最大流的 Dinic 算法（也可作姓氏）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Computer science) Referring to Dinic’s algorithm: a method for finding the maximum flow in a flow network efficiently.","zh":"（计算机科学）指 Dinic 算法：一种用于在网络流图中高效求解最大流的方法。"},"examples":[{"en":"We used Dinic’s algorithm to compute the maximum flow in the graph.","zh":"我们用 Dinic 算法来计算这个图的最大流。"},{"en":"Dinic is often taught in competitive programming for solving flow problems.","zh":"Dinic 常在竞赛编程中用于解决网络流问题。"}]},{"partOfSpeech":"other","definition":{"en":"A surname, most commonly seen in the name of the scientist who introduced Dinic’s algorithm.","zh":"一个姓氏，最常见于提出 Dinic 算法的科学家姓名中。"},"examples":[{"en":"The algorithm is named after the researcher Dinic (sometimes spelled Dinitz in English sources).","zh":"该算法以研究者 Dinic 命名（英文资料中有时拼作 Dinitz）。"}]}],"synonyms":["Dinic’s algorithm","Dinitz algorithm"],"phonetic":"/ˈdiːnɪk/","extraExplanation":["“Dinic’s algorithm”常见于算法与竞赛编程语境，中文也常直接称“Dinic 算法/迪尼茨算法”。","英文资料中拼写可能不同：Dinic、Dinitz 都可能出现，取决于音译与文献传统。"]}
{"word":"dinical","summary":{"en":"Clinical mainly means “related to medical examination and treatment of patients,” and can also mean “objective and based on real-case observation.”","zh":"Clinical 主要指“与病人检查和治疗有关的（临床的）”，也可指“客观冷静、基于真实案例观察的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to the examination and treatment of patients (especially in a hospital or medical setting).","zh":"与病人检查和治疗有关的；临床的（尤指医院或医疗环境中）。"},"examples":[{"en":"The doctor has many years of clinical experience.","zh":"这位医生有多年的临床经验。"},{"en":"Clinical trials test whether a new medicine is safe and effective.","zh":"临床试验用于测试新药是否安全有效。"}]},{"partOfSpeech":"adj.","definition":{"en":"Based on careful observation of real cases rather than theory; practical and data-focused (often used in academic writing).","zh":"基于真实案例观察而非理论的；偏实践、重数据的（常用于学术表达）。"},"examples":[{"en":"The report takes a clinical approach to the problem.","zh":"这份报告以一种更“临床式”的方式来分析问题。"},{"en":"She described the event in a clinical, factual tone.","zh":"她用冷静客观、像病例记录一样的语气描述了这件事。"}]}],"synonyms":["medical","hospital","therapeutic","practical","objective"],"phonetic":"/ˈklɪnɪkəl/","extraExplanation":["你输入的“dinical”通常是拼写错误，更常见的正确拼写是 clinical。","clinical 来自 clinic（诊所）+ -al（形容词后缀），意思是“与诊所/临床有关的”。","在日常英语里，clinical 最常见于医学搭配：clinical trial（临床试验）、clinical diagnosis（临床诊断）、clinical practice（临床实践）。在非医学语境中，clinical 也可能暗示“冷静、缺少感情、非常客观”。"]}
{"word":"dinichthyid","summary":{"en":"A dinichthyid is an extinct Devonian armored fish in the family Dinichthyidae (or something related to that family).","zh":"dinichthyid 指恐鱼科的已灭绝泥盆纪装甲鱼（或与恐鱼科有关的事物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extinct armored fish (a placoderm) belonging to the family Dinichthyidae, known from the Devonian period","zh":"（古生物）恐鱼科（Dinichthyidae）的成员；一种已灭绝的泥盆纪装甲鱼（盾皮鱼）"},"examples":[{"en":"Dunkleosteus is the most famous dinichthyid found in Devonian seas.","zh":"邓氏鱼（Dunkleosteus）是泥盆纪海洋中最著名的恐鱼科动物。"},{"en":"The museum displays a reconstructed dinichthyid skull with massive biting plates.","zh":"博物馆展出了一个复原的恐鱼科头骨，带有巨大的咬合骨板。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the extinct family Dinichthyidae","zh":"与恐鱼科（Dinichthyidae）有关的；恐鱼科的"},"examples":[{"en":"Researchers compared dinichthyid jaw structures across several fossils.","zh":"研究人员比较了多件化石中恐鱼科动物的颌部结构。"}]}],"synonyms":["placoderm","arthrodire"],"phonetic":"/ˌdaɪnɪkˈθiːɪd/","extraExplanation":["“dinichthyid”来自分类学名称 Dinichthyidae。词根可拆为：dino-（“可怕的、巨大的”，常见于 dinosaur）+ ichthy-（“鱼”，见于 ichthyology 鱼类学）。","恐鱼科属于盾皮鱼（placoderms）中的节甲鱼类（arthrodires），以头胸部厚重的骨质“装甲”和强力咬合结构著称，生活在约3.6亿年前的泥盆纪。"]}
{"word":"Dinichthys","summary":{"en":"Dinichthys is an older scientific name for a famous giant armored Devonian fish, now usually called Dunkleosteus.","zh":"Dinichthys 是一种著名的泥盆纪巨型有甲胄鱼类的旧学名，如今通常称为 Dunkleosteus（邓氏鱼/邓克鱼）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large extinct armored fish (a placoderm) from the Devonian Period; the name is now usually treated as an older synonym of the genus Dunkleosteus","zh":"一种已灭绝的巨型有甲胄鱼类（盾皮鱼），生活在泥盆纪；“Dinichthys”如今多被视为属名 Dunkleosteus（邓氏鱼/邓克鱼）的旧称或同物异名"},"examples":[{"en":"Dinichthys is often mentioned in older books, but many scientists now use the name Dunkleosteus.","zh":"Dinichthys 常见于较旧的书籍里，但许多科学家现在使用 Dunkleosteus 这个名称。"},{"en":"Fossils once labeled Dinichthys helped scientists understand how powerful Devonian predators could be.","zh":"曾被标注为 Dinichthys 的化石帮助科学家了解泥盆纪掠食者能有多强大。"}]}],"synonyms":["Dunkleosteus (modern genus name)"],"phonetic":"/ˌdɪnɪkˈθiːz/","extraExplanation":["词源：Dini- 来自古生物学家（Othniel Charles）Marsh 用来纪念古典学者/博物学相关人物的命名元素，-ichthys 源自希腊语 ikhthys（鱼），常见于鱼类学名中。","分类与用法：Dinichthys 是历史上使用过的属名；随着化石材料与分类研究更新，很多标本被重新归入 Dunkleosteus，因此现代科普与学术写作更常见后者。","背景知识：这类盾皮鱼以“骨质头甲”和强力咬合著称，是泥盆纪海洋中的顶级掠食者之一。"]}
{"word":"dinichthys","summary":{"en":"Dinichthys is the name of an extinct armored prehistoric fish genus from the Devonian period.","zh":"Dinichthys 指泥盆纪时期的一种已灭绝的装甲史前鱼类属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extinct genus of large armored prehistoric fish (a placoderm) that lived in the Devonian period; some species once called Dinichthys are now often classified under the related genus Dunkleosteus","zh":"一种已灭绝的史前大型装甲鱼类属（盾皮鱼类），生活在泥盆纪；一些过去归为“Dinichthys”的物种如今常被重新归入近缘属“Dunkleosteus（邓氏鱼）”"},"examples":[{"en":"Dinichthys is often mentioned in older books about Devonian sea predators.","zh":"在较早的泥盆纪海洋掠食者书籍中常会提到 Dinichthys。"},{"en":"In some modern sources, famous “Dinichthys” fossils are reclassified as Dunkleosteus.","zh":"在一些现代资料中，著名的“Dinichthys”化石会被重新归类为 Dunkleosteus（邓氏鱼）。"}]}],"synonyms":["Dunkleosteus (related name in modern classification)","placoderm"],"phonetic":"/daɪˈnɪkθiəs/","extraExplanation":["“Dinichthys”来自希腊语词根：deinos-（可怕的、巨大的）+ ichthys（鱼），字面意思接近“可怕的鱼”。","它常出现在科普与古生物学史的语境中：早期分类中使用较多，但随着化石研究更新，一部分物种被并入更常见的名称“Dunkleosteus（邓氏鱼）”。读英文材料时，如果看到两者并列，通常是在说明旧名与新名的对应关系。"]}
{"word":"Dinin","summary":{"en":"“Dinin’” is an informal spelling of “dining,” meaning eating a meal, often out or socially.","zh":"“Dinin’”是“dining”的非正式拼写，表示用餐/吃饭，常指外出或社交场合的吃饭。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(informal, nonstandard spelling) A casual spoken form of “dining,” meaning eating a meal, especially in a restaurant or as a social occasion.","zh":"（非正式、非标准拼写）“dining”的口语写法，意思是“用餐/吃饭”，常指在餐馆或作为社交活动的用餐。"},"examples":[{"en":"We’re dinin’ out tonight—want to come with us?","zh":"我们今晚要出去吃饭——你要不要一起？"},{"en":"They were dinin’ with friends when the phone rang.","zh":"电话响时，他们正在和朋友一起吃饭。"}]}],"synonyms":["dining","eating","having a meal","eating out"],"phonetic":"/ˈdaɪnɪŋ/","extraExplanation":["“dinin’”里的撇号（’）表示省略了词尾的 g，这是英语口语里常见的发音与写法（g-dropping），例如：talking → talkin’，going → goin’。这种写法多见于对话、歌词、小说对白，用来表现轻松、随意或某种口音；正式写作中一般用 “dining”。","如果你其实想查的是 “dining”（标准拼写），它既可作动词现在分词（dining out = 外出就餐），也常作名词/形容词用于搭配：dining room（餐厅/饭厅）、fine dining（高档餐饮）。"]}
{"word":"dining","summary":{"en":"Dining means eating a meal and is also used to describe things related to eating, like a dining room or fine dining.","zh":"dining 指“用餐/吃饭”，也可作定语表示“与用餐有关的”，如 dining room（餐厅）或 fine dining（高级餐饮）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of eating a meal, especially dinner; also used to describe meal-related time or activity.","zh":"用餐；吃饭（尤指晚餐）；也可指与吃饭相关的时间或活动。"},"examples":[{"en":"We went out for dining after work.","zh":"我们下班后出去吃饭。"},{"en":"Fine dining can be expensive, but the service is usually excellent.","zh":"高级餐饮可能很贵，但服务通常很出色。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to eating meals, especially in a particular place (often used before a noun).","zh":"与用餐有关的；（常作定语）餐饮的、吃饭用的。"},"examples":[{"en":"The hotel has a dining room on the second floor.","zh":"这家酒店二楼有一间餐厅。"},{"en":"The dining area is small but bright.","zh":"用餐区不大，但很明亮。"}]}],"synonyms":["eating","mealtime","dinner (context-dependent)","food service (industry context)"],"phonetic":"/ˈdaɪnɪŋ/","extraExplanation":["“dining”既可以指“用餐这件事”（名词用法），也常见于复合名词/短语中作定语，如 dining room（餐厅/饭厅）、dining table（餐桌）、dining hall（食堂/餐厅）。","常见搭配：go dining（去吃饭，较口语/不如 go out to eat 常见）、fine dining（高级餐饮，强调环境与服务）、casual dining（休闲餐饮，较放松的餐厅类型）。"]}
{"word":"dinitrate","summary":{"en":"Dinitrate means a compound with two nitrate (–ONO₂) groups.","zh":"Dinitrate 指含有两个硝酸根/硝酸酯基团（–ONO₂）的化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound that contains two nitrate groups (–ONO₂), or a salt/ester derived from nitric acid with two nitrate units","zh":"二硝酸盐；二硝酸酯（含有两个硝酸根/硝酸酯基团 –ONO₂ 的化合物）"},"examples":[{"en":"Many explosives and propellants contain nitrate or dinitrate compounds.","zh":"许多炸药和推进剂都含有硝酸盐或二硝酸酯类化合物。"},{"en":"In organic chemistry, a dinitrate may refer to a molecule with two –ONO₂ groups.","zh":"在有机化学中，dinitrate 可能指带有两个 –ONO₂ 基团的分子。"}]}],"synonyms":["dinitrate ester","dinitrate compound","(specific) isosorbide dinitrate"],"phonetic":"/daɪˈnaɪtɹeɪt/","extraExplanation":["“dinitrate”由前缀 di-（两个）+ nitrate（硝酸盐/硝酸酯）构成，常见于化学与工程语境。日常英语里更常见的是具体物质名，例如“nitroglycerin（硝化甘油）”或“isosorbide dinitrate（硝酸异山梨酯）”。","注意不要与“dinitrogen tetroxide（四氧化二氮，N₂O₄）”混淆；后者是含氮氧化物，并非“二硝酸盐/二硝酸酯”。"]}
{"word":"dinitril","summary":{"en":"Dinitrile is a chemistry term for a compound (or descriptor) that has two nitrile (–C≡N) groups.","zh":"Dinitrile（更常见拼写）是化学术语，指含有两个腈基（–C≡N）的化合物，也可作形容词表示“含二腈结构的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) A compound that contains two nitrile groups (–C≡N); also called a dinitrile.","zh":"（化学）含有两个腈基（–C≡N）的化合物；也称为“双腈/二腈”。"},"examples":[{"en":"Adiponitrile is an important dinitrile used to make nylon.","zh":"己二腈是一种重要的二腈，用于制造尼龙。"},{"en":"The lab procedure produced a dinitrile as the main product.","zh":"该实验步骤生成的主要产物是一种二腈。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to or containing two nitrile groups (–C≡N).","zh":"（作定语）与含有两个腈基（–C≡N）有关的；含二腈结构的。"},"examples":[{"en":"They studied dinitrile intermediates in the synthesis route.","zh":"他们研究了该合成路线中的二腈中间体。"},{"en":"A dinitrile monomer can be used to build longer polymer chains.","zh":"二腈单体可用于构建更长的聚合物链。"}]}],"synonyms":["dinitrile compound","dicyano compound"],"phonetic":"/daɪˈnaɪtraɪl/","extraExplanation":["你输入的“dinitril”更常见的标准拼写是 **dinitrile**（末尾通常有 -e）。在科研论文与化学品目录中一般用 dinitrile。","腈基（nitrile, –C≡N）常见于有机合成与高分子材料中；“二腈”因为有两个腈基，常作为合成尼龙等材料的重要原料或中间体。"]}
{"word":"dinitrile","summary":{"en":"A dinitrile is an organic compound with two nitrile (–C≡N) groups.","zh":"dinitrile 指含有两个腈基（–C≡N）的有机化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an organic compound that contains two nitrile groups (–C≡N) in the same molecule","zh":"含有两个腈基（–C≡N）的有机化合物"},"examples":[{"en":"Adiponitrile is a dinitrile used to make nylon.","zh":"己二腈是一种用于生产尼龙的二腈化合物。"},{"en":"The chemist analyzed the dinitrile to confirm it had two –C≡N groups.","zh":"化学家分析该二腈化合物，以确认它含有两个 –C≡N 腈基。"}]}],"synonyms":["dicarbonitrile","dicyanide"],"phonetic":"/daɪˈnaɪtraɪl/","extraExplanation":["“di-”表示“两个”。“nitrile（腈）”指含有腈基 –C≡N 的化合物；因此 dinitrile 就是“含两个腈基”的化合物。","常见例子包括 malononitrile（丙二腈）和 adiponitrile（己二腈）。在材料化学中，己二腈与尼龙（如 Nylon-6,6）的工业生产相关。"]}
{"word":"dinitro","summary":{"en":"“Dinitro” is a chemistry term meaning “containing two nitro (–NO₂) groups,” often seen in names like dinitrotoluene.","zh":"“dinitro”是化学用语，表示“含有两个硝基（–NO₂）”，常见于如 dinitrotoluene（二硝基甲苯）等名称中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Having two nitro groups (–NO₂) in a molecule; often used as a combining form in chemical names (dinitro-).","zh":"（化学）指分子中含有两个硝基（–NO₂）；常作构词成分用于化学命名（dinitro-）。"},"examples":[{"en":"Dinitro compounds often need careful handling because some can be hazardous.","zh":"二硝基化合物通常需要小心处理，因为其中一些可能具有危险性。"},{"en":"The name “dinitrotoluene” tells you the molecule has two nitro groups attached to toluene.","zh":"“二硝基甲苯（dinitrotoluene）”这个名称表示该分子是在甲苯上连有两个硝基。"}]}],"synonyms":["dinitro-","bis(nitro) (in some naming contexts)"],"phonetic":"/daɪˈnaɪtroʊ/","extraExplanation":["“di-”表示“二/两个”， “nitro”与“硝基（–NO₂）”相关，所以“dinitro-”字面意思就是“二硝基-”。它多见于化学名词中作前缀/构词成分，而不是日常英语里独立使用的普通词。"]}
{"word":"dinitrobenzene","summary":{"en":"Dinitrobenzene is a benzene compound with two nitro groups, used mainly in industrial chemical manufacturing.","zh":"dinitrobenzene（二硝基苯）是带有两个硝基的苯类化合物，主要用于工业化工生产。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A chemical compound: a benzene ring with two nitro (–NO₂) groups attached. It is mainly used as an industrial intermediate (a starting material) for making dyes, explosives, and other chemicals.","zh":"一种化学化合物：在苯环上连有两个硝基（–NO₂）。主要作为工业中间体（原料）用于制造染料、炸药及其他化学品。"},"examples":[{"en":"Dinitrobenzene is used as a starting material in the production of some dyes.","zh":"二硝基苯可作为生产某些染料的起始原料。"},{"en":"Because dinitrobenzene can be toxic, workers must handle it with proper protective equipment.","zh":"由于二硝基苯可能有毒，工人必须佩戴合适的防护装备进行操作。"}]}],"synonyms":["1,2-dinitrobenzene (o-dinitrobenzene)","1,3-dinitrobenzene (m-dinitrobenzene)","1,4-dinitrobenzene (p-dinitrobenzene)"],"phonetic":"/daɪˌnaɪtroʊˈbɛnziːn/","extraExplanation":["“dinitro-”表示“两个硝基”，“-benzene”表示“苯”。因此 dinitrobenzene 的字面意思就是“二硝基苯”。","二硝基苯常见有三种位置异构体：1,2-（邻二硝基苯）、1,3-（间二硝基苯）、1,4-（对二硝基苯）。实际讨论时常需要明确具体是哪一种。","在化学与工业语境里，它可能涉及健康与安全风险（如毒性与刺激性等），学习或接触相关材料时应以实验室/法规安全信息为准。"]}
{"word":"dinitrocellulose","summary":{"en":"Dinitrocellulose is a nitrated form of cellulose used in some propellants, explosives, and coatings.","zh":"二硝基纤维素是一种硝化纤维素，用于某些推进剂、炸药和涂层等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical (cellulose treated with nitric acid) that contains two nitro groups; it is used in some propellants, explosives, and special coatings.","zh":"一种化学物质（用硝酸处理后的纤维素），含有两个硝基；用于某些推进剂、炸药和特殊涂层。"},"examples":[{"en":"The lab stored dinitrocellulose in a cool, dry place because it can be reactive.","zh":"实验室把二硝基纤维素存放在阴凉干燥处，因为它可能具有反应性。"},{"en":"Some historical propellants were made with forms of nitrated cellulose, including dinitrocellulose.","zh":"一些早期推进剂使用硝化纤维素的不同形式，包括二硝基纤维素。"}]}],"synonyms":["dinitrated cellulose","nitrated cellulose (broader term)"],"phonetic":"/daɪˌnaɪtroʊˈsɛljəˌloʊs/","extraExplanation":["“dinitro-”表示“二硝基（两个硝基）”，“cellulose”是“纤维素”。合在一起就是“含两个硝基的纤维素衍生物”。","在实际语境中，这个词多见于化学、材料与军工相关文本；由于可能具有易燃/敏感特性，日常对话中不常用。"]}
{"word":"dinitrophenol","summary":{"en":"Dinitrophenol (DNP) is a highly toxic chemical that can dangerously overheat the body; it has industrial uses and a history of illegal weight-loss use.","zh":"二硝基苯酚（DNP）是一种高毒化学物质，可能引发危险性高热；有工业用途，也曾被非法用于减肥。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a toxic chemical compound (often abbreviated as DNP) that disrupts the body’s ability to make energy efficiently, causing dangerous overheating; it has been used in industry (e.g., dyes, pesticides) and illegally as a weight-loss drug.","zh":"一种有毒化学物质（常缩写为 DNP），会干扰人体高效产生能量的过程，可能导致体温过高等严重危险；它曾用于工业（如染料、农药等），也曾被非法用作减肥药。"},"examples":[{"en":"Dinitrophenol (DNP) is extremely dangerous and can cause fatal overheating.","zh":"二硝基苯酚（DNP）极其危险，可能导致致命的体温过高。"},{"en":"The substance was once used in industrial processes but is not a safe medicine.","zh":"这种物质曾用于工业生产，但绝不是安全的药物。"}]}],"synonyms":["DNP","2,4-dinitrophenol"],"phonetic":"/daɪˌnaɪtroʊˈfiːnɔːl/","extraExplanation":["“dinitro-”表示“二硝基（含两个硝基 -NO₂）”，“phenol”表示“苯酚”。合起来指“带两个硝基取代的苯酚”一类化合物，常见指 2,4-二硝基苯酚（2,4-DNP）。","20世纪早期曾有人将 DNP 当作减肥手段，因为它会增加能量消耗、让身体“发热”，但副作用极其严重（如高热、脱水、器官衰竭），因此在多数国家被禁止用于人体减重。"]}
{"word":"dinitrophenylhydrazine","summary":{"en":"Dinitrophenylhydrazine (DNPH) is a lab reagent used to detect aldehydes and ketones by forming a yellow/orange solid product.","zh":"二硝基苯肼（DNPH）是一种实验室试剂，用于通过生成黄色/橙色固体产物来检测醛和酮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical reagent (often called DNPH or Brady’s reagent) used in laboratories to detect aldehydes and ketones by forming a yellow/orange solid (a hydrazone) with carbonyl compounds","zh":"一种化学试剂（常称DNPH或Brady试剂），用于在实验室中检测醛和酮；它会与含羰基的化合物反应生成黄色/橙色固体（腙类衍生物）"},"examples":[{"en":"We used dinitrophenylhydrazine to test whether the unknown sample contained an aldehyde or a ketone.","zh":"我们用二硝基苯肼来检验未知样品是否含有醛或酮。"},{"en":"A yellow precipitate after adding dinitrophenylhydrazine suggests a carbonyl compound is present.","zh":"加入二硝基苯肼后出现黄色沉淀，通常表示样品中存在羰基化合物。"}]}],"synonyms":["DNPH","2,4-dinitrophenylhydrazine","Brady’s reagent"],"phonetic":"/daɪˌnaɪtroʊˌfiːnəl haɪˈdræziːn/","extraExplanation":["“dinitrophenylhydrazine”常指2,4-二硝基苯肼（2,4-DNPH）。在有机化学教学实验里，它常用于“碳yl（羰基）鉴定试验”：醛/酮与DNPH反应生成腙（hydrazone）沉淀，颜色多为黄到橙红。","它不只是“变色试剂”，生成的腙衍生物还可以用于进一步鉴定（例如测熔点来推断原羰基化合物的身份）。","实验室中DNPH通常以酸性溶液形式使用；需注意化学品安全与规范处置（具体以所在机构的安全指南为准）。"]}
{"word":"dinitrotoluene","summary":{"en":"Dinitrotoluene (DNT) is a toxic industrial chemical used mainly to make explosives and certain plastics/foams.","zh":"二硝基甲苯（DNT）是一种有毒的工业化学品，主要用于制造炸药以及某些塑料/泡沫材料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a toxic industrial chemical (one of several isomers) used mainly to make explosives, polyurethane foam, and other chemicals; often abbreviated as DNT.","zh":"二硝基甲苯（一组同分异构体的统称），一种有毒的工业化学品，主要用于制造炸药、聚氨酯泡沫及其他化学品；常缩写为 DNT。"},"examples":[{"en":"Workers must wear protective gear when handling dinitrotoluene.","zh":"工人接触二硝基甲苯时必须佩戴防护装备。"},{"en":"Dinitrotoluene is used in the production of certain explosives and industrial materials.","zh":"二硝基甲苯用于生产某些炸药和工业材料。"},{"en":"The report warned about environmental contamination from dinitrotoluene near the factory site.","zh":"报告警告工厂附近可能存在二硝基甲苯造成的环境污染。"}]}],"synonyms":["DNT","dinitrotoluene (DNT)"],"phonetic":"/daɪˌnaɪtroʊˈtɑːljuːiːn/","extraExplanation":["“dinitrotoluene”通常指多种异构体（常见如 2,4-DNT 与 2,6-DNT），在工业与环境报告中常以统称出现。","这是具有健康风险的化学品：可能刺激皮肤/呼吸道，长期或高浓度暴露可能带来更严重的健康问题；实际安全要求以所在国家/地区的法规与安全数据表（SDS）为准。","词形可拆解理解：di-（二）+ nitro-（硝基）+ toluene（甲苯）=“含两个硝基的甲苯”。"]}
{"word":"dink","summary":{"en":"“Dink” most commonly refers to a soft, light hit or a gently played shot in sports; it can also mean to tap lightly. It may also appear as slang for something small/insignificant, or as the acronym DINK (“dual income, no kids”).","zh":"“dink”最常见指（运动中）轻轻的一击/轻吊球，也可作动词表示轻轻敲击。它还可作俚语表示“很小/不起眼的东西或数量”，或作为缩写 DINK 指“双收入、无子女”的伴侣。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a soft, light hit or a gently played shot in sports (especially tennis or golf).","zh":"（尤指网球或高尔夫中）轻轻的一击；轻吊球/轻推球。"},"examples":[{"en":"She hit a dink over the net that barely cleared the tape.","zh":"她轻轻一挑，球刚好擦网过。"},{"en":"In golf, a little dink like that won’t get you out of the rough.","zh":"在高尔夫里，这种轻轻一打很难把球从长草区救出来。"}]},{"partOfSpeech":"v.","definition":{"en":"to hit or tap something lightly, often in a casual or not very skillful way.","zh":"轻轻敲击/轻打；（常含）随便地打一下、技术不高地打。"},"examples":[{"en":"He dinked the ball into the air and lost the point.","zh":"他随便把球轻挑到空中，结果丢了分。"},{"en":"Try not to dink the door with your bag when you walk in.","zh":"你进门时尽量别用包轻碰到门。"}]},{"partOfSpeech":"n.","definition":{"en":"slang: something small, weak, or unimpressive; a minor amount.","zh":"（俚语）小东西；微不足道的事/少得可怜的量。"},"examples":[{"en":"All we got was a dink of a discount—barely a few dollars.","zh":"我们拿到的折扣少得可怜，就几块钱。"}]},{"partOfSpeech":"n.","definition":{"en":"informal (often written DINK): a couple with dual income and no kids.","zh":"（非正式，常写作 DINK）“双收入、无子女”的夫妻/伴侣。"},"examples":[{"en":"They’re a DINK couple, so they travel a lot.","zh":"他们是“双收入无娃”的夫妻，所以经常旅行。"}]}],"synonyms":["tap","poke","nudge","chip (shot)","drop shot"],"phonetic":"/dɪŋk/","extraExplanation":["“DINK”是缩写：Dual Income, No Kids（双收入、无子女）。常用于市场营销与人口统计语境，语气多为描述性，但用在具体个人身上时可能显得贴标签；更礼貌的说法可以是“a couple without children”或“a child-free couple”（注意后者有时也带有个人立场色彩）。","在体育语境里，“dink”常带有“轻巧、保守、没有力量”的感觉；但在网球/匹克球等运动中，dink 也可以是有策略的“轻放短球/近网小球”。"]}
{"word":"Dinka","summary":{"en":"Dinka refers to (1) a major ethnic group in South Sudan and (2) their language; it can also be used as an adjective for their culture.","zh":"Dinka 可指（1）南苏丹的重要民族——丁卡族，（2）他们所说的丁卡语；也可作形容词表示与丁卡族文化相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of a major ethnic group mainly living in South Sudan","zh":"丁卡族人；主要居住在南苏丹的一个重要民族成员"},"examples":[{"en":"Many Dinka people live along the Nile in South Sudan.","zh":"许多丁卡族人生活在南苏丹尼罗河沿岸。"},{"en":"She is Dinka, and her family comes from a village near Bor.","zh":"她是丁卡族人，家人来自博尔附近的一个村庄。"}]},{"partOfSpeech":"n.","definition":{"en":"the Nilotic language spoken by the Dinka people (often called Dinka or Dinka language)","zh":"丁卡语；丁卡族人所说的尼罗特语族语言（常称 Dinka 或 Dinka language）"},"examples":[{"en":"He speaks Dinka at home and English at school.","zh":"他在家说丁卡语，在学校说英语。"},{"en":"This guide includes basic greetings in Dinka.","zh":"这本指南收录了丁卡语的基本问候语。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Dinka people or their language and culture","zh":"丁卡族的；与丁卡族的语言或文化有关的"},"examples":[{"en":"The museum hosted a Dinka cultural event.","zh":"博物馆举办了一场丁卡族文化活动。"},{"en":"They shared a Dinka folk story with the class.","zh":"他们给全班分享了一个丁卡族民间故事。"}]}],"phonetic":"/ˈdɪŋkə/","extraExplanation":["“Dinka”通常既指民族也指语言；写作时可用更明确的说法：the Dinka people（丁卡族人/丁卡民族）、the Dinka language（丁卡语）。","丁卡族是南苏丹最大的民族之一；其语言一般被归入“尼罗特语族（Nilotic）”。在新闻与人类学写作中较常见。"]}
{"word":"dinka","summary":{"en":"Dinka refers to the Dinka people of South Sudan and the language they speak; it can also mean “related to Dinka culture.”","zh":"Dinka 指南苏丹的丁卡族及其语言；也可作形容词表示“与丁卡文化有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of a Nilotic ethnic group living mainly in South Sudan","zh":"丁卡族人（主要居住在南苏丹的尼罗特族群之一）"},"examples":[{"en":"Many Dinka people live along the Nile River in South Sudan.","zh":"许多丁卡族人居住在南苏丹的尼罗河沿岸。"},{"en":"He is Dinka, and his family has lived in the region for generations.","zh":"他是丁卡族人，他的家族在当地生活了好几代。"}]},{"partOfSpeech":"n.","definition":{"en":"the language spoken by the Dinka people (a group of related dialects)","zh":"丁卡语（丁卡族使用的语言，包含一系列相关方言）"},"examples":[{"en":"She speaks Dinka at home and English at school.","zh":"她在家说丁卡语，在学校说英语。"},{"en":"This book includes basic greetings in Dinka.","zh":"这本书收录了丁卡语的基础问候语。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Dinka people or their culture","zh":"丁卡族的；与丁卡文化有关的"},"examples":[{"en":"They shared Dinka music and traditional stories.","zh":"他们分享了丁卡族的音乐和传统故事。"}]}],"synonyms":["Nilotic (broader group)","South Sudanese (broader nationality term)"],"phonetic":"/ˈdɪŋkə/","extraExplanation":["“Dinka”通常首字母大写（Dinka），因为它既可以指民族，也可以指语言；写作“a Dinka person / the Dinka people / the Dinka language”。","丁卡族是南苏丹最大的族群之一，常见于新闻、历史与人类学语境（例如南苏丹独立、内战与难民议题的报道）。","在文学与传记作品中，有时会提到“Lost Boys of Sudan（苏丹迷失男孩）”，其中不少人来自丁卡族或与丁卡社区有关。"]}
{"word":"Dinkas","summary":{"en":"“Dinkas” most commonly means the Dinka people (plural), a major ethnic group in South Sudan; less commonly it can refer to the Dinka language.","zh":"“Dinkas”最常指丁卡族人（复数），南苏丹的主要民族之一；较少情况下也可指丁卡语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"members of the Dinka people, a major ethnic group in South Sudan (plural of Dinka).","zh":"丁卡族人；南苏丹主要民族之一的丁卡族成员（Dinka 的复数）。"},"examples":[{"en":"Many Dinkas live along the Nile River in South Sudan.","zh":"许多丁卡族人生活在南苏丹的尼罗河沿岸。"},{"en":"The aid group hired local Dinkas to help with translation and logistics.","zh":"该援助组织雇用了当地丁卡族人协助翻译和后勤工作。"}]},{"partOfSpeech":"n.","definition":{"en":"the Dinka language (often called Dinka; “Dinkas” is less common in this sense).","zh":"丁卡语（通常写作 Dinka；用 Dinkas 表示语言的情况较少）。"},"examples":[{"en":"In the region, people may speak Dinka as well as Arabic or English.","zh":"在该地区，人们可能既说丁卡语，也说阿拉伯语或英语。"}]}],"synonyms":["Dinka","the Dinka people"],"phonetic":"/ˈdɪŋkəz/","extraExplanation":["“Dinka”更常见作单复数同形（one Dinka / many Dinka）；“Dinkas”作为复数也能见到，但在正式写作里相对少一些。","“Dinka”通常是英语里的族称（ethnonym）。谈到族群时，语气上尽量保持中性与尊重，避免把一个群体简单等同于单一刻板印象。","丁卡族在南苏丹历史、牧业文化与内战/难民相关叙事中常被提及；在新闻或纪实作品里，你也可能看到“the Dinka people”“Dinka communities”等表达。"]}
{"word":"dinked","summary":{"en":"“Dinked” usually means “hit or tapped lightly,” and in sports it often means “played a soft, short shot.” It can also mean “made a small dent.”","zh":"“dinked”通常指“轻轻敲/碰了一下”；在体育运动中常指“轻吊一球（短而软的击球）”。也可指“磕出小凹痕/小缺口”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of “dink”: to hit or tap something lightly, often producing a small, quick sound or movement.","zh":"“dink”的过去式/过去分词：轻轻敲击、轻碰某物，通常动作短促、力度很小。"},"examples":[{"en":"He dinked the glass with his spoon to get everyone’s attention.","zh":"他用勺子轻轻敲了敲玻璃杯，吸引大家注意。"},{"en":"The ball dinked off the rim and fell in.","zh":"球轻轻碰到篮筐边沿后又落进去了。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Sports) To play a soft, short shot that just clears a defender or the net.","zh":"（体育）轻挑/轻吊一球：打出很轻、很短的一击，让球刚好越过对手或球网。"},"examples":[{"en":"She dinked the ball over the net for an easy point.","zh":"她把球轻轻挑过球网，轻松拿下一分。"},{"en":"He dinked it past the goalkeeper.","zh":"他轻轻一挑，把球越过守门员。"}]},{"partOfSpeech":"vt.","definition":{"en":"To cause a small dent or nick in something (often by a light bump).","zh":"（轻微碰撞导致）使出现小凹痕/小缺口。"},"examples":[{"en":"I dinked the car door on the post in the parking lot.","zh":"我在停车场把车门轻轻碰到柱子上，磕出了一点小凹痕。"},{"en":"The edge got dinked during shipping.","zh":"运输过程中边缘被磕出了小缺口。"}]}],"synonyms":["tapped","nicked","dented","poked","nudged"],"phonetic":"/dɪŋkt/","extraExplanation":["“dink”常见于口语，带有“轻轻一下”的感觉；在网球、匹克球（pickleball）等运动里，“dink (shot)”是很常用的战术术语，指网前轻吊球。","注意别和全大写的“DINK”（Double Income, No Kids：双收入无孩家庭）混淆；“dinked”一般不是这个缩写的标准变形。"]}
{"word":"dinkey","summary":{"en":"“dinkey” is usually a misspelling of “dinky,” meaning small and not impressive; it can also refer to a small train.","zh":"“dinkey”通常是“dinky”的误拼，意思是“小而不起眼/有点寒酸”；也可指“小型火车/机车”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Commonly spelled “dinky”) small and not impressive; tiny or shabby-looking.","zh":"（常拼作 dinky）小得不起眼的；寒酸的、简陋的。"},"examples":[{"en":"They live in a dinky apartment, but it’s clean and cozy.","zh":"他们住在一间很小的公寓里，但很干净也很温馨。"},{"en":"He showed me his dinky old phone.","zh":"他给我看了他那部小小的旧手机。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) a small, simple train or locomotive, especially on a narrow-gauge line.","zh":"（较少见）小型、简易的火车/机车（尤指窄轨铁路上的）。"},"examples":[{"en":"The museum has a little dinky train that kids can ride.","zh":"博物馆里有一辆小火车，孩子们可以乘坐。"}]}],"synonyms":["small","tiny","puny","shabby"],"phonetic":"/ˈdɪŋki/","extraExplanation":["“dinkey”通常被认为是“dinky”的非标准拼写或误拼。正式写作里建议用“dinky”。","“dinky”在口语里很常见，语气往往带一点轻微的嫌弃或开玩笑（small and unimpressive），但不一定很冒犯，具体看语境。"]}
{"word":"dinkeys","summary":{"en":"“Dinky” means very small and not impressive; it can also mean a small car/boat/thing. “Dinkeys” is likely a misspelling of “dinkies.”","zh":"“dinky”表示“很小、不起眼/不太好”；也可指“小车/小船/小东西”。“dinkeys”很可能是把“dinkies”（复数）拼错了。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) Very small; not impressive or not good in quality.","zh":"（非正式）很小的；不起眼的；质量不佳的。"},"examples":[{"en":"They rented a dinky apartment near the station.","zh":"他们在车站附近租了一间很小的公寓。"},{"en":"The hotel room was clean but dinky.","zh":"酒店房间很干净，但很小、很寒酸。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) A small thing, especially a small car or a small boat.","zh":"（非正式）小东西，尤指小汽车或小船。"},"examples":[{"en":"He drove an old dinky that could barely start in winter.","zh":"他开着一辆老旧的小车，冬天几乎打不着火。"}]}],"synonyms":["tiny","small","puny","cramped","shabby"],"phonetic":"/ˈdɪŋki/","extraExplanation":["“dinkeys”更常见是拼写误差，通常想写的是“dinkies”（dinky 的复数）或“dinky”。如果你是在某个特定句子/语境里看到“dinkeys”，把原句发我，我可以帮你判断它到底指什么。"]}
{"word":"dinkier","summary":{"en":"“Dinkier” means “more dinky”: smaller/cramped or less impressive, and sometimes more cheap-looking (informal).","zh":"“dinkier”是“dinky”的比较级，表示更小更挤或更不起眼；也可指更显廉价/寒酸（非正式）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comparative of “dinky”: smaller, more cramped, or less impressive than something else; often used informally.","zh":"“dinky”的比较级：比别的更小、更挤、更不起眼；多为非正式用法。"},"examples":[{"en":"Their new apartment is dinkier than the last one, but it’s closer to work.","zh":"他们的新公寓比上一个更小更挤，但离工作更近。"},{"en":"This laptop is dinkier, so it’s easier to carry.","zh":"这台笔记本更小巧，所以更容易携带。"},{"en":"The stage looked dinkier on TV than it did in person.","zh":"舞台在电视上看起来更不起眼，现场其实没那么小。"}]},{"partOfSpeech":"adj.","definition":{"en":"Comparative of “dinky”: more cheap-looking, slightly shabby, or low-quality (informal, sometimes mildly negative).","zh":"“dinky”的比较级：更显得廉价、寒酸或质量更差（非正式，略带贬义）。"},"examples":[{"en":"The replacement parts felt dinkier than the originals.","zh":"替换零件摸起来比原装的更廉价。"},{"en":"We ended up in a dinkier hotel than we expected.","zh":"我们最后住进了一家比预期更寒酸的酒店。"}]}],"synonyms":["smaller","cramped","tinier","shabbier","cheaper-looking","punier"],"phonetic":"ˈdɪŋkiər","extraExplanation":["“dinky / dinkier”在美式英语里很口语，常用来形容东西“又小又不怎么样”，语气通常不算很强烈，但在形容品质时可能带一点嫌弃。","拼写变化：dinky → dinkier（y 变 i + er）。"]}
{"word":"dinkies","summary":{"en":"“Dinkies” is an informal plural noun meaning small (often cute or slightly shabby) things—basically “little dinky things.”","zh":"“dinkies”是非正式复数名词，指小巧（常带可爱或略寒酸感觉）的东西，相当于“那些小小的玩意儿”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Small, sometimes cute or slightly shabby things; the plural of “dinky,” often used jokingly.","zh":"（非正式）小而（有时）可爱或有点寒酸的东西；“dinky”的复数，常带玩笑语气。"},"examples":[{"en":"These cups are so tiny—just little dinkies for espresso.","zh":"这些杯子太小了——就是给浓缩咖啡用的小杯子。"},{"en":"He drove one of those dinky cars—one of the dinkies you can park anywhere.","zh":"他开那种小车——那种随便哪里都能停的“迷你小车”。"}]}],"synonyms":["little things","small items","miniatures","tiny things"],"phonetic":"ˈdɪŋkiz","extraExplanation":["“dinkies”本身不算特别常见；更常见的是形容词 dinky（小巧的、迷你的、有点寒酸的）。把它变成复数名词“dinkies”，多用于口语里，带一点轻松或调侃的感觉。","有时“Dinky”也会让人联想到英国经典合金小车品牌 Dinky Toys；在特定语境里“dinkies”可能指那类小玩具车，但这取决于上下文。"]}
{"word":"dinkiest","summary":{"en":"“Dinkiest” means “the most dinky”: extremely small or unimpressive, in an informal tone.","zh":"“dinkiest”表示“最dinky的”：非常小或不体面/不起眼，语气较口语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative of “dinky”: the smallest, most cramped, or least impressive (often in an informal, slightly humorous or critical way).","zh":"“dinky”的最高级：最小的、最狭窄的、最不起眼的（多为非正式用法，常带一点调侃或嫌弃）。"},"examples":[{"en":"They put us in the dinkiest hotel room I’ve ever seen.","zh":"他们把我们安排进了我见过最小最寒酸的酒店房间。"},{"en":"He drove the dinkiest little car, but it never broke down.","zh":"他开着一辆最小最不起眼的小车，但从来没坏过。"},{"en":"This is the dinkiest kitchen—there’s barely space to turn around.","zh":"这个厨房也太小了——几乎转不开身。"}]}],"synonyms":["smallest","tiniest","cramped","shabby","puny","pathetic (informal)"],"phonetic":"/ˈdɪŋkiɪst/","extraExplanation":["“dinky”是很口语的形容词，常用来吐槽东西“又小又寒酸/不够体面”，语气比“small”更带情绪。","“dinkiest”是最高级形式，表示在一组东西里“最……的”。比较级是“dinkier”。"]}
{"word":"dinking","summary":{"en":"“Dinking” usually means making soft, controlled short shots near the net in pickleball; more generally it can mean tapping lightly or (informally) messing around with small tasks.","zh":"“Dinking”通常指匹克球里在网前打轻柔可控的短球；更广义也可指轻轻碰/敲，或（非正式）瞎折腾、做些琐碎事。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(in pickleball and some racket sports) making a soft, controlled shot that drops into the non-volley zone (“the kitchen”), usually close to the net.","zh":"（匹克球及一些持拍运动中）打出一种轻柔、可控的短球，让球落在非截击区（“厨房”）内，通常靠近球网。"},"examples":[{"en":"She won the point by dinking the ball just over the net.","zh":"她用一记轻柔的短球把球送过网，赢下了这一分。"},{"en":"Good dinking forces your opponent to hit up, giving you an attack chance.","zh":"好的短球会迫使对手把球往上挑，从而给你制造进攻机会。"}]},{"partOfSpeech":"v.","definition":{"en":"tapping or hitting something lightly (often by accident or without much force).","zh":"轻轻碰到或轻轻敲击某物（常指不小心或用力很小）。"},"examples":[{"en":"I kept dinking the spoon against the glass while I stirred.","zh":"我搅拌的时候，勺子一直轻轻碰到玻璃杯。"},{"en":"Be careful not to dink the car door on the wall.","zh":"小心别让车门轻轻撞到墙上。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal) spending time doing small, unimportant tasks; messing around.","zh":"（非正式）磨蹭着做些琐碎、无关紧要的事；瞎折腾。"},"examples":[{"en":"He was just dinking around on his phone instead of working.","zh":"他不干活，只是在手机上瞎玩。"},{"en":"Stop dinking with the settings and just start the game.","zh":"别再折腾设置了，直接开始游戏吧。"}]}],"synonyms":["tapping","nudging","soft shot","drop shot","messing around"],"phonetic":"/ˈdɪŋkɪŋ/","extraExplanation":["“Dinking”最常见的专门含义来自匹克球（pickleball）：指在网前打的轻柔短球对拉，是这项运动的核心技术之一。","注意：英文里还有缩写“DINK(s)”= Double Income, No Kids（双收入、无孩家庭），与“dinking”不是同一个词源；另外“dink”在少数语境中也可能作贬义称呼，使用时要留意语境与礼貌。"]}
{"word":"dinkly","summary":{"en":"“Dinkly” is usually a misspelling or rare variant of “dinky” (“small, unimpressive”).","zh":"“dinkly”通常是“dinky”的误拼或罕见变体，表示“很小、不起眼”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Nonstandard or rare spelling of “dinky,” meaning small, unimpressive, or slightly shabby.","zh":"“dinky”的非标准或罕见拼写，意思是“很小的、不起眼的，或有点破旧寒酸的”。"},"examples":[{"en":"I can’t find “dinkly” in most dictionaries—did you mean “dinky” (a dinky little car)?","zh":"“dinkly”在大多数词典里找不到——你是不是想说“dinky”（比如：一辆很小的车）？"},{"en":"They rented a dinky apartment near campus.","zh":"他们在校园附近租了一间很小的公寓。"}]}],"synonyms":["dinky","small","tiny","puny","run-down"],"phonetic":"ˈdɪŋki","extraExplanation":["“dinkly”不是常见标准词，很多情况下是拼写错误或个人/网络用法。日常写作里建议用“dinky”。","“dinky”在美式英语里常带一点口语语气：既可以只是“很小”，也可能暗含“寒酸、不怎么样”。"]}
{"word":"dinks","summary":{"en":"“DINKs” usually means dual-income couples with no children; “dinks” can also be the verb form of “dink” meaning to tap lightly or make a soft, short shot in sports.","zh":"“DINKs”通常指“双收入、无子女”的夫妻/家庭；“dinks”也可作动词（dink 的三单），表示轻敲或在运动中打出轻短球。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often written DINKs) couples or households with two incomes and no children","zh":"（常写作 DINKs）“双收入、无子女”的夫妻或家庭"},"examples":[{"en":"Many DINKs spend more on travel and dining out.","zh":"很多 DINKs 会在旅行和外出就餐上花更多钱。"},{"en":"The neighborhood is popular with young DINKs who work in the city.","zh":"这个社区很受在城里工作的年轻 DINKs 欢迎。"}]},{"partOfSpeech":"v.","definition":{"en":"third-person singular of “dink”: to hit or tap something lightly; to make a short, soft shot (especially in sports like tennis or pickleball)","zh":"“dink”的第三人称单数：轻轻击打；（尤指网球、匹克球等）打出短而轻的近网球"},"examples":[{"en":"He dinks the ball over the net to force a mistake.","zh":"他把球轻轻挑过网，逼对手失误。"},{"en":"She dinks the glass with her spoon to get everyone’s attention.","zh":"她用勺子轻轻敲杯子来吸引大家注意。"}]}],"synonyms":["DINKs","dual-income no-kids (households)","tap lightly","drop shot"],"phonetic":"/dɪŋks/","extraExplanation":["DINKs 是一个缩写：Dual Income, No Kids（双收入、无子女）。在市场营销、房产、消费趋势等语境里很常见，用来描述一类家庭结构与消费能力。","在球拍类运动里，dink 常指“近网轻放/短球”，强调轻、短、落点近网，和大力抽击相对。"]}
{"word":"dinkum","summary":{"en":"Dinkum means “genuine/real,” especially in Australian English; it can also mean “the real thing.”","zh":"dinkum 多用于澳大利亚英语，表示“真正的、可靠的”，也可指“真货/真靠谱的人或物”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Australian English, informal) genuine; real; honest and sincere.","zh":"（澳大利亚英语，非正式）真正的；货真价实的；真诚可靠的。"},"examples":[{"en":"Is that story dinkum, or are you joking?","zh":"你那故事是真的吗，还是在开玩笑？"},{"en":"He’s a dinkum friend—you can rely on him.","zh":"他是个真心的朋友——你可以信赖他。"},{"en":"They serve dinkum home-style food, not tourist stuff.","zh":"他们做的是地道的家常菜，不是那种迎合游客的东西。"}]},{"partOfSpeech":"n.","definition":{"en":"a genuine person or thing (often used with ‘the’ in Australian English).","zh":"（常与 the 连用）真材实料的人或物；靠谱的真东西。"},"examples":[{"en":"She’s the dinkum—she always tells you straight.","zh":"她才是真靠谱的人——她总是直说。"},{"en":"This tool is the dinkum; it won’t break easily.","zh":"这工具是真货；不容易坏。"}]}],"synonyms":["genuine","real","authentic","honest","legit"],"phonetic":"/ˈdɪŋkəm/","extraExplanation":["“dinkum”是澳大利亚英语里很有代表性的口语词，常见于“fair dinkum”（真心的/真的/靠谱的）这一固定搭配中。","词源不完全确定，但在澳洲日常对话里，它通常用来表达“别忽悠我、说真的”的感觉，语气比正式的“genuine/real”更随意。"]}
{"word":"dinkums","summary":{"en":"“Dinkum(s)” is Australian slang meaning genuine/real, often in “fair dinkum,” and sometimes playfully as “the real facts/the real deal.”","zh":"“dinkum(s)”是澳式俚语，表示“真实的/货真价实的”，常见于“fair dinkum”；也可俏皮地指“真相/真东西”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Australian English, informal) Genuine; honest; real; sincere. Often used as “fair dinkum.”","zh":"（澳大利亚英语，非正式）真实的；真诚的；货真价实的。常见搭配“fair dinkum”。"},"examples":[{"en":"Is that story fair dinkum, or are you joking?","zh":"你说的故事是真的吗，还是在开玩笑？"},{"en":"He’s a dinkum guy—you can trust him.","zh":"他是个实在人——你可以信任他。"}]},{"partOfSpeech":"adv.","definition":{"en":"(informal) Truly; really; for real (used to emphasize truth).","zh":"（非正式）真的；确实（用于强调真实性）。"},"examples":[{"en":"I’m dinkum—I didn’t take your phone.","zh":"我真没拿你的手机。"},{"en":"She dinkum thought the shop was open.","zh":"她确实以为那家店开着。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, plural) Things that are genuine or the real facts/real deal (less common; “dinkums” is a playful plural form).","zh":"（非正式，复数）真东西；真相/实情（较少见；“dinkums”是带点俏皮的复数说法）。"},"examples":[{"en":"No sales talk—just the dinkums.","zh":"不讲推销话——只讲实情。"},{"en":"They promised the dinkums, not a polished story.","zh":"他们承诺讲真话，不讲包装出来的故事。"}]}],"synonyms":["genuine","real","authentic","honest","for real","the real deal"],"phonetic":"/ˈdɪŋkəm/","extraExplanation":["“dinkum”是典型的澳式口语，最常见的固定搭配是“fair dinkum”，意思接近“真的/货真价实/没骗你”。在澳大利亚，它有一种朴实、直率、讲信用的文化色彩。","“dinkums”作为复数在日常里不算最常见，多用于轻松、戏谑或强调“真材实料/真相”。如果你想更自然，通常直接用“dinkum”或“fair dinkum”。"]}
{"word":"dinky","summary":{"en":"“Dinky” means small (often cute), and it can also mean a small vehicle in informal speech.","zh":"“dinky”表示“小巧（常带可爱感）”，也可在口语中指“小型交通工具”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Small and (often) cute in an appealing way; sometimes used humorously or slightly dismissively to mean “too small.”","zh":"小巧可爱的；（有时带一点调侃或轻视）太小、寒酸的。"},"examples":[{"en":"She bought a dinky little notebook that fits in her pocket.","zh":"她买了一个小巧的笔记本，能放进口袋里。"},{"en":"This dinky kitchen has barely any counter space.","zh":"这个小厨房台面空间几乎没有。"},{"en":"He gave me a dinky bouquet—just three flowers.","zh":"他送了我一小束花——只有三朵。"}]},{"partOfSpeech":"n.","definition":{"en":"A small car, boat, or other vehicle (informal).","zh":"（非正式）小车；小船；小型交通工具。"},"examples":[{"en":"They drove a dinky up the mountain roads.","zh":"他们开着一辆小车沿着山路上去。"},{"en":"He keeps a dinky boat at the lake for weekend fishing.","zh":"他在湖边放了一条小船，周末用来钓鱼。"}]}],"synonyms":["small","tiny","petite","mini","puny","diminutive"],"phonetic":"/ˈdɪŋki/","extraExplanation":["“dinky”很口语，语气取决于上下文：可以是亲切的“迷你可爱”，也可能是抱怨“太小、不够用”。如果你想更中性，可以用 small / tiny；想强调“可爱小巧”，可用 cute / petite（更正式）。"]}
{"word":"dinman","summary":{"en":"“Dinman” is most commonly used as a surname (a person’s family name), not a standard English word with a general meaning.","zh":"“Dinman”最常见的用法是姓氏（人名），并非有固定通用含义的英文词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname); not a common English vocabulary word","zh":"姓氏（常见于人名）；不是常用英文词汇"},"examples":[{"en":"Ms. Dinman will join the meeting at 3 p.m.","zh":"Dinman 女士将于下午三点参加会议。"},{"en":"I saw the name Dinman on the class list.","zh":"我在班级名单上看到了 Dinman 这个名字。"}]}],"synonyms":["(none—proper name)"],"phonetic":"/ˈdɪnmən/","extraExplanation":["“Dinman”通常作为人名/姓氏出现，而不是词典里常见的普通名词或动词。","如果你其实想查的是发音相近的词，可能是：\n- **tin man**（《绿野仙踪》里的“铁皮人”）\n- **dinner** /ˈdɪnər/（晚餐）\n- **denman / Dinman**（不同拼写的人名）\n你可以告诉我你看到它的句子或想表达的意思，我可以帮你确认具体是哪一个。"]}
{"word":"dinmont","summary":{"en":"Dinmont most commonly refers to the Dandie Dinmont terrier, a Scottish terrier breed named after a literary character.","zh":"Dinmont最常指“丹迪·丁蒙梗”，一种以文学人物命名的苏格兰梗犬品种。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small Scottish terrier breed best known in the name “Dandie Dinmont (terrier).”","zh":"一种苏格兰小型梗犬品种，最常见于名称“丹迪·丁蒙梗（Dandie Dinmont terrier）”中。"},"examples":[{"en":"She adopted a Dandie Dinmont terrier, a breed sometimes shortened to “Dinmont” in older writing.","zh":"她领养了一只丹迪·丁蒙梗，这个品种在较旧的文字里有时会简写成“Dinmont”。"},{"en":"The show featured several Dinmonts with long bodies and distinctive facial hair.","zh":"展览上有几只丁蒙梗，身躯较长，脸部毛发很有辨识度。"}]}],"synonyms":["Dandie Dinmont terrier"],"phonetic":"/ˈdɪnˌmɑnt/","extraExplanation":["“Dinmont”这个词主要来自文学：英国作家司各特（Sir Walter Scott）的小说《盖伊·曼纳林》（Guy Mannering, 1815）中有个农夫角色名叫 Dandie Dinmont，他养的梗犬很出名，后来这种犬就以他的名字命名为 Dandie Dinmont terrier。","在现代英语里单独说“Dinmont”并不常见，多数情况下会说全名 “Dandie Dinmont terrier”。"]}
{"word":"Dinnage","summary":{"en":"“Dinnage” is a rare spelling of “dunnage,” meaning packing material used to protect and stabilize cargo during shipping.","zh":"“Dinnage”是“dunnage”的罕见拼写，指运输中用于保护并固定货物的垫衬/填充材料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) Packing or bracing material (such as wood, mats, or inflatable bags) used to protect cargo and keep it from shifting during shipping; commonly spelled “dunnage.”","zh":"（罕见）用于运输中保护货物、防止移动的垫衬/填充材料（如木条、垫子或充气袋）；更常见拼写为 “dunnage”。"},"examples":[{"en":"The crew added dunnage (sometimes spelled “dinnage”) to keep the crates from sliding.","zh":"船员加了垫衬材料（有时也拼作 dinnage）来防止箱子滑动。"},{"en":"Make sure there is enough dunnage between the metal parts to avoid scratches.","zh":"确保金属部件之间有足够的垫衬材料，以免刮伤。"}]}],"synonyms":["dunnage","packing material","bracing","padding","blocking"],"phonetic":"ˈdʌnɪdʒ","extraExplanation":["“Dinnage”在现代英语中非常少见，多数情况下是“dunnage”的异拼或误拼；在航运、物流、仓储语境里更推荐使用“dunnage”。","“Dunnage”常见于海运/货运英语，指用于“垫、隔、撑、固定”的材料或做法，重点是防止货物在运输中受损或移位。"]}
{"word":"dinned","summary":{"en":"“Dinned” means “made a loud, repeated noise” or “repeated something again and again until it was remembered,” and it is the past form of “din.”","zh":"“dinned”是“din”的过去式/过去分词，意思是“发出持续嘈杂的声音”或“反复强调/灌输直到对方记住”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense and past participle of “din”: to make (a loud, continuous noise) or to fill a place with loud repeated sound.","zh":"“din”的过去式和过去分词：发出（或让某处充满）持续、嘈杂、反复的声音。"},"examples":[{"en":"Music from the next apartment dinned all night, and I couldn’t sleep.","zh":"隔壁公寓的音乐吵了一整晚，我睡不着。"},{"en":"Traffic dinned in our ears as we crossed the street.","zh":"我们过马路时，车流声在耳边轰鸣。"}]},{"partOfSpeech":"vt.","definition":{"en":"past tense and past participle of “din”: to repeat something so often that someone remembers it or accepts it (often in the pattern “din something into someone’s head”).","zh":"“din”的过去式和过去分词：反复说某事，直到对方记住或接受（常见结构：din sth into sb’s head“把……反复灌输给某人”）。"},"examples":[{"en":"Our teacher dinned the safety rules into our heads before the lab.","zh":"上实验课前，老师把安全规则反复强调到我们都记住了。"},{"en":"The coach dinned the importance of teamwork into the players.","zh":"教练反复灌输团队合作的重要性。"}]}],"synonyms":["blared","roared","rattled","pounded","hammered (into)","drummed (into)"],"phonetic":"/dɪnd/","extraExplanation":["“din”本义是“喧闹声、轰鸣声”，作动词时常带有“吵得让人受不了、反复不断”的感觉。引申义“反复灌输”来自“像噪音一样一遍遍重复”，语气往往带一点不耐烦或强调强度。常见搭配：din in one’s ears（在耳边轰鸣）、din into someone’s head（反复灌输）。"]}
{"word":"dinner","summary":{"en":"Dinner most commonly means the main evening meal, and it can also mean a formal meal event like a dinner party.","zh":"Dinner 通常指晚上的正餐，也可指正式的聚餐或宴会（如晚宴）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the main meal of the day, usually eaten in the evening (sometimes at midday, depending on culture or schedule)","zh":"正餐；（通常在晚上吃的）晚餐；（在某些文化或作息中也可指中午的）正餐"},"examples":[{"en":"What’s for dinner tonight?","zh":"今晚晚餐吃什么？"},{"en":"We usually have dinner around 7 p.m.","zh":"我们通常晚上七点左右吃晚餐。"},{"en":"In some families, dinner is the biggest meal of the day.","zh":"在一些家庭里，正餐是一天中最丰盛的一餐。"}]},{"partOfSpeech":"n.","definition":{"en":"a formal meal or social event where people eat together (often for a purpose such as celebration or fundraising)","zh":"宴会；正式聚餐（常用于庆祝、筹款等场合）"},"examples":[{"en":"The company held a dinner to celebrate the new project.","zh":"公司举办宴会庆祝新项目。"},{"en":"She gave a dinner party for close friends.","zh":"她为亲密朋友办了一场晚宴。"}]}],"synonyms":["evening meal","supper","banquet","dinner party"],"phonetic":"/ˈdɪnɚ/","extraExplanation":["在英语国家里，meal 的叫法会因地区与家庭习惯不同：有些地方把中午的正餐叫 dinner（尤其较传统或农村地区），而把晚上的餐叫 supper；但在很多现代城市语境中，dinner 通常就是“晚餐”。","常见搭配：have dinner（吃晚饭）、make dinner（做晚饭）、dinner time（晚饭时间）、dinner party（晚宴/聚餐）。"]}
{"word":"dinnerless","summary":{"en":"“Dinnerless” means having no dinner or not eating dinner (a rare but understandable adjective).","zh":"“dinnerless”意为“没有晚餐的/没吃晚饭的”，较少见但容易理解。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no dinner; not eating dinner (often for a particular night).","zh":"没有晚餐的；不吃晚饭的（常指某一晚）。"},"examples":[{"en":"We got home too late, so it was a dinnerless night.","zh":"我们回家太晚了，所以那一晚没吃晚饭。"},{"en":"After the long meeting, I ended up dinnerless and exhausted.","zh":"开了很久的会之后，我最终没吃晚饭，还很累。"},{"en":"She often feels irritable when she goes to bed dinnerless.","zh":"她如果没吃晚饭就上床，常常会觉得烦躁。"}]}],"synonyms":["without dinner","no-dinner","dinner-free","having skipped dinner"],"phonetic":"/ˈdɪnɚləs/","extraExplanation":["“dinnerless”是由“dinner（晚餐）+ -less（没有……的）”构成的形容词，意思直观，但在现代日常英语里并不常用。更自然的说法通常是：“without dinner / no dinner / skipped dinner / didn’t have dinner”。","在较文学或带点幽默的写法中，“-less”结构（如 homeless, jobless, sleepless）常用来营造简洁、有画面感的描述；“dinnerless”也可能出现在这种语境里。"]}
{"word":"dinnerly","summary":{"en":"“Dinnerly” is a rare, old-fashioned word meaning “related to dinner” or “at dinner time.”","zh":"“dinnerly”是一个罕见、偏旧的词，意思是“与晚餐有关”或“在晚餐时间”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare, old-fashioned) Suitable for, typical of, or happening around dinner; related to dinner time.","zh":"（罕见/较旧用法）适合晚餐的；有“晚餐时分/晚餐氛围”特点的；与晚餐时间有关的。"},"examples":[{"en":"They served a dinnerly meal of roast chicken and vegetables.","zh":"他们端上了一顿很“晚餐式”的饭：烤鸡配蔬菜。"},{"en":"We arrived at a dinnerly hour, just as the family sat down to eat.","zh":"我们在一个“晚餐时间点”到达，正好赶上那家人坐下吃饭。"}]},{"partOfSpeech":"adv.","definition":{"en":"(rare) At dinner time; in a way connected with dinner.","zh":"（罕见）在晚餐时；以与晚餐有关的方式。"},"examples":[{"en":"The inn was busiest dinnerly, when travelers came in to eat.","zh":"这家旅店在晚餐时最忙，旅客都会进来吃饭。"}]}],"synonyms":["dinnertime","dinner-time","at dinnertime","around dinner","dinner-related"],"phonetic":"/ˈdɪnɚli/","extraExplanation":["“dinnerly”在现代英语里几乎不用，常见于较早期/方言化的写作。现代更自然的说法通常是：at dinnertime / around dinner / for dinner / dinner-time (adj.) / dinner-related。"]}
{"word":"dinners","summary":{"en":"“Dinners” means more than one dinner—main meals (often evening meals) or formal dinners/banquets.","zh":"“Dinners”是“dinner”的复数，指多顿正餐（常为晚餐）或多场正式晚宴/宴会。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “dinner”: the main meal of the day, often eaten in the evening; also meals served at formal events.","zh":"“dinner”的复数：正餐/主餐，常在傍晚吃；也可指正式场合提供的宴会餐。"},"examples":[{"en":"We have family dinners on Sundays.","zh":"我们周日会一起吃家庭晚餐。"},{"en":"The hotel offers business dinners for conference guests.","zh":"这家酒店为参会客人提供商务晚宴。"},{"en":"After a week of quick takeout, I miss home-cooked dinners.","zh":"外卖将就了一周后，我很想念家常饭菜。"}]}],"synonyms":["evening meals","suppers","banquets"],"phonetic":"ˈdɪnɚz","extraExplanation":["在美式英语里，dinner 常指一天的主餐，很多人会在晚上吃，所以也常被理解为“晚餐”。但在一些地区/家庭里，主餐可能在中午，这时 dinner 也可能指“午间正餐”，而晚上的轻食会叫 supper。正式场合的 dinner 也常译为“晚宴/宴会”。"]}
{"word":"dinnertime","summary":{"en":"Dinnertime means the usual time people eat dinner, often in the evening.","zh":"Dinnertime 指人们通常吃晚餐的时间，多在傍晚或晚上。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The time of day when people usually eat dinner (the evening meal).","zh":"人们通常吃晚餐（晚饭）的时间。"},"examples":[{"en":"Let’s talk after dinnertime.","zh":"我们晚饭后再聊吧。"},{"en":"In my family, dinnertime is around 6:30.","zh":"在我家，晚饭时间大约是六点半。"},{"en":"Dinnertime is a good moment to put phones away and chat.","zh":"晚饭时间是把手机收起来、聊聊天的好时刻。"}]}],"synonyms":["dinner time","evening meal time"],"phonetic":"/ˈdɪnərtaɪm/","extraExplanation":["在很多英语国家，“dinnertime”不仅指时间点，也常带有“家庭聚在一起吃饭”的文化意味；有些家庭会把它当作一天里最固定、最重视的相处时段。","“Dinner”在不同地区指的餐次可能不同：在美式英语里通常是晚上那顿；在英式英语的某些用法中，“dinner”也可能指中午的正餐（例如学校的“school dinner”）。具体要看语境。"]}
{"word":"dinnerware","summary":{"en":"Dinnerware means the plates, bowls, cups, and related dishes used for serving and eating meals.","zh":"Dinnerware 指用来盛放与进食正餐的餐具（如盘、碗、杯等），常指成套器皿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The dishes and utensils used for serving and eating a meal, especially dinner (plates, bowls, cups, etc.).","zh":"（尤指晚餐用的）餐具；成套餐桌用具（如盘子、碗、杯子等）。"},"examples":[{"en":"We bought new dinnerware for the holidays.","zh":"我们为节日买了一套新餐具。"},{"en":"The restaurant’s dinnerware is simple but elegant.","zh":"这家餐厅的餐具简单却很雅致。"}]}],"synonyms":["tableware","dishes","dishware"],"phonetic":"/ˈdɪnərˌwɛr/","extraExplanation":["“Dinnerware”通常指一整套用来摆桌、盛装和食用正餐的器皿，常见搭配有 a set of dinnerware（成套餐具）、fine dinnerware（精致/高档餐具）、everyday dinnerware（日常餐具）。","在美式英语里，它有时与“tableware”接近，但“tableware”范围更广，还可能包括刀叉勺等餐具（flatware/silverware）。而“dinnerware”更偏向盘、碗、杯、碟这类器皿。"]}
{"word":"dinnery","summary":{"en":"“Dinnery” means ‘dinner-like’ or ‘related to dinner,’ and it’s rare/informal.","zh":"“dinnery”表示“像晚餐的、与晚餐有关的”，属于较少见/偏口语的用法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to dinner; like or suitable for dinner (rare or informal).","zh":"与晚餐有关的；像晚餐一样的；适合当晚餐的（较少见/口语）。"},"examples":[{"en":"The smell from the kitchen was warm and dinnery.","zh":"厨房里飘出来的味道很温暖，很有“晚餐的感觉”。"},{"en":"Let’s make something more dinnery than snacks—maybe soup and bread.","zh":"我们做点比零食更像正餐的东西吧——比如汤和面包。"}]}],"synonyms":["dinner-like","dinner-related","suitable for dinner","hearty"],"phonetic":"/ˈdɪnəri/","extraExplanation":["“dinnery”不是特别常见的标准词，更常见的表达是“dinner-related / suitable for dinner / a proper dinner”。在口语里也可能写作“dinner-y”，表示“有正餐/晚餐氛围的”。","如果你是想查“dinery / diner-y / dinner”，也可以告诉我具体句子，我能帮你判断最合适的拼写和意思。"]}
{"word":"Dinnie","summary":{"en":"“Dinnie” is mainly used as a personal name or nickname (often Scottish), and more rarely as a surname.","zh":"“Dinnie” 主要作人名/昵称（常见于苏格兰语境），也可较少见地作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a personal name (given name or nickname), used especially in Scotland and English-speaking contexts; sometimes a diminutive (pet form) of names like Donald or Duncan","zh":"人名（名字或昵称），在苏格兰及英语语境中较常见；有时是 Donald、Duncan 等名字的昵称/爱称形式"},"examples":[{"en":"Dinnie moved to Glasgow for work.","zh":"Dinnie 为了工作搬到了格拉斯哥。"},{"en":"His friends all call him Dinnie.","zh":"他的朋友都叫他 Dinnie。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname), less common, found in some English-speaking communities","zh":"姓氏（较少见），在一些英语社群中可见"},"examples":[{"en":"Ms. Dinnie will speak first at the meeting.","zh":"Dinnie 女士将在会议上先发言。"}]}],"phonetic":"/ˈdɪni/","extraExplanation":["在苏格兰英语（Scots/Scottish English）里，给名字加上 -ie / -y 结尾来形成昵称很常见（如 Annie、Jamie、Maggie）。Dinnie 也符合这种“昵称化”的拼写习惯，因此常被当作亲昵称呼或较随意的名字形式。","如果你是在某篇文章/字幕里看到 “Dinnie”，也可能是人名；但若你想查的是苏格兰口语里的否定表达，常见的是 “dinnae”（= don’t），拼写不同。"]}
{"word":"dinning","summary":{"en":"“Dinning” is the -ing form of “din,” meaning making a loud, annoying noise or repeatedly drilling an idea into someone.","zh":"“dinning”是“din”的‑ing形式，表示发出持续刺耳的噪音，或反复向某人灌输/强调某个观点。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"making a loud, continuous, often annoying noise; the present participle (‑ing form) of “din.”","zh":"（持续）发出很大、令人烦躁的噪音；是动词“din”的现在分词（‑ing形式）。"},"examples":[{"en":"The construction was dinning outside my window all morning.","zh":"窗外的施工声整整一上午都在吵个不停。"},{"en":"With the music dinning in my ears, I couldn’t concentrate.","zh":"音乐在我耳边轰鸣，我无法集中注意力。"}]},{"partOfSpeech":"v.","definition":{"en":"repeatedly pressing an idea into someone’s mind; insisting again and again (often in “din … into someone”).","zh":"反复灌输（某个想法）给某人；一再强调（常用在“din … into someone”结构中）。"},"examples":[{"en":"My teacher kept dinning the rules into us before the exam.","zh":"考试前老师一直反复给我们强调规则。"},{"en":"She’s been dinning it into her kids that they must say “please” and “thank you.”","zh":"她一直反复教育孩子一定要说“请”和“谢谢”。"}]}],"synonyms":["blaring","rattling","clamoring","drumming (into)","hammering (into)"],"phonetic":"/ˈdɪnɪŋ/","extraExplanation":["“dinning”经常被误写成“dining”。两者发音接近，但意思不同：\n- dining：与“吃饭、用餐”有关（如 dining room 餐厅）\n- dinning：与“喧闹的噪音/反复灌输”有关（来自 din 这个词）"]}
{"word":"dino","summary":{"en":"“Dino” is an informal short form of “dinosaur.”","zh":"“dino”是“dinosaur（恐龙）”的非正式简称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A dinosaur; often used as a cute or shortened form of “dinosaur,” especially in children’s speech, games, and pop culture.","zh":"（非正式）恐龙；常作为“dinosaur”的可爱缩写/简称，常见于儿童用语、游戏与流行文化中。"},"examples":[{"en":"My nephew loves dinos and can name all of them.","zh":"我侄子很喜欢恐龙（dinos），还会叫出很多恐龙的名字。"},{"en":"We saw a dino skeleton at the museum.","zh":"我们在博物馆看到了恐龙骨架。"},{"en":"The book has cute dino drawings on every page.","zh":"这本书每一页都有可爱的恐龙插画。"}]}],"synonyms":["dinosaur"],"phonetic":"ˈdaɪnoʊ","extraExplanation":["“dino”在口语里非常常见，尤其是面对孩子或在轻松语境中；更正式的写法仍是“dinosaur”。","在一些语境中，“Dino”也可能是人名（如昵称、名叫Dino的人），但作为词汇最常见的还是“恐龙”的简称。"]}
{"word":"Dinobryon","summary":{"en":"Dinobryon is a genus of microscopic freshwater golden algae that forms branching colonies and lives in plankton.","zh":"Dinobryon 是一种淡水显微金藻属，常形成分枝状群体，生活在浮游生物中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of microscopic freshwater algae (golden algae) that often form small, branching colonies; common in lakes and ponds and an important part of plankton.","zh":"一种淡水显微藻类属（常归为金藻类），常形成小型分枝状群体；常见于湖泊和池塘，是浮游生物的重要组成部分。"},"examples":[{"en":"Under the microscope, we saw Dinobryon colonies shaped like tiny branching trees.","zh":"在显微镜下，我们看到 Dinobryon 的群体像微小的分枝树状结构。"},{"en":"Dinobryon is often found in cool, nutrient-poor lakes as part of the plankton.","zh":"Dinobryon 常见于水温较低、营养盐较少的湖泊中，是浮游生物的一部分。"}]}],"synonyms":["golden algae","chrysophyte"],"phonetic":"/ˌdaɪnəˈbraɪɑːn/","extraExplanation":["Dinobryon 常被生态学研究用作“浮游植物（phytoplankton）”的代表之一，能反映水体营养状况与季节变化。","名称来源于希腊语词根：dino-（旋转/涡旋）与 bryon（苔藓/小植物），用于描述其外观或群体形态的联想，而非真的与恐龙有关。"]}
{"word":"dinobryon","summary":{"en":"Dinobryon is a genus of microscopic freshwater golden algae often found in plankton.","zh":"Dinobryon 是一种常见于淡水浮游生物中的显微金藻属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of microscopic freshwater algae (golden algae) that often live in colonies and can be an important part of lake plankton","zh":"一种淡水显微藻类（常归为金藻类）的属名，常以群体形式生活，是湖泊浮游生物的重要组成部分"},"examples":[{"en":"Under the microscope, we saw colonies of Dinobryon in the lake water sample.","zh":"在显微镜下，我们在湖水样本里看到了 dinobryon 的群体。"},{"en":"Dinobryon can become common in cold, nutrient-poor lakes.","zh":"在寒冷、贫营养的湖泊中，dinobryon 可能会比较常见。"}]}],"synonyms":["golden algae (general term)","chrysophyte (broader group)"],"phonetic":"/ˌdaɪnoʊˈbraɪɑn/","extraExplanation":["Dinobryon 是生物分类学中的“属”（genus）名，写作时通常首字母大写并用斜体（Dinobryon）。","它常被生态学与水质研究提到，因为它属于浮游植物的一部分，会影响食物网（例如被一些浮游动物摄食），有时也与水体的营养状态、季节变化有关。"]}
{"word":"Dinoceras","summary":{"en":"Dinoceras is an extinct Eocene mammal genus, often considered the same as Uintatherium.","zh":"Dinoceras 指一种始新世的已灭绝大型哺乳动物属，常被视为与 Uintatherium（尤因塔兽）同属或同名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An extinct genus of very large, rhinoceros-like mammals that lived in the Eocene epoch; often treated as a synonym of the genus Uintatherium.","zh":"一种已灭绝的巨型哺乳动物属，外形有点像犀牛，生活在始新世；常被认为与“尤因塔兽属（Uintatherium）”为同物异名。"},"examples":[{"en":"In the museum, a Dinoceras skull was displayed with its distinctive bony knobs.","zh":"在博物馆里，展出了一具恐角兽（Dinoceras）的头骨，上面有很明显的骨质突起。"},{"en":"Some older books use the name Dinoceras for fossils now commonly labeled Uintatherium.","zh":"一些较老的书会用“Dinoceras”来称呼如今多标作“Uintatherium（尤因塔兽）”的化石。"}]}],"synonyms":["Uintatherium"],"phonetic":"/ˌdaɪnəˈsɛrəs/","extraExplanation":["词源上，Dino- 来自希腊语，表示“可怕的、巨大的”（也常见于 dinosaur）；-ceras 表示“角”。因此 Dinoceras 字面意思接近“可怕的角”。","在古生物学命名史中，同一类化石有时会被不同研究者起不同属名；后来分类学整理时，较常用、较符合规则的名称会成为通用名，所以你会看到 Dinoceras 与 Uintatherium 的并用或替换。"]}
{"word":"dinoceras","summary":{"en":"Dinoceras is an extinct Eocene mammal genus, known from fossils, often described as a large horned plant-eater (a uintathere).","zh":"Dinoceras 指一种已灭绝的始新世哺乳动物属，主要见于化石记录，常被描述为大型、带角状突起的植食动物（尤因塔兽类）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Dinoceras: an extinct genus of large, horned mammals that lived in the Eocene period; it is now generally grouped with animals called uintatheres.","zh":"Dinoceras（恐角兽属）：一种已灭绝的大型、有角的哺乳动物属，生活在始新世；现代分类中通常归入“尤因塔兽类（uintatheres）”。"},"examples":[{"en":"Dinoceras fossils have been found in North America.","zh":"在北美发现过恐角兽属的化石。"},{"en":"In museums, Dinoceras is often shown as a heavy-bodied plant-eater with horn-like bumps on its skull.","zh":"在博物馆里，恐角兽属常被展示为体型笨重的植食性动物，头骨上有像角一样的突起。"}]}],"synonyms":["uintathere (general group name)"],"phonetic":"/ˌdaɪnoʊˈsɛrəs/","extraExplanation":["词源：Dino- 来自希腊语，含义与“可怕的、巨大”的概念相关；-ceras 来自希腊语 keras，意为“角”。因此 Dinoceras 字面可理解为“可怕的角（之兽）/巨角兽”。","用法提示：这是古生物学/博物馆语境中的专有名词，日常英语中很少用；学术上有时会用更常见的类群名 uintathere 来介绍同一类动物。"]}
{"word":"Dinocerata","summary":{"en":"Dinocerata: an extinct order of large Eocene mammals with horn-like skull bumps and long canine teeth.","zh":"Dinocerata：始新世的大型已灭绝哺乳动物类群（一个“目”），头骨有角状突起并常见长犬齿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An extinct group (order) of large, heavy-bodied mammals that lived mainly in the Eocene epoch; they are known for bony “horn-like” bumps on the skull and long canine teeth. (Also called uintatheres.)","zh":"（古生物）已灭绝的一类大型哺乳动物（一个“目”），主要生活在始新世；头骨上常有骨质的“角状突起”，并有较长的犬齿。（也称“犹因塔兽类/Uintatheres”）"},"examples":[{"en":"Dinocerata were among the largest land mammals of the early Eocene.","zh":"Dinocerata 是早始新世体型最大的陆生哺乳动物之一。"},{"en":"Fossils of Dinocerata have been found in North America and Asia.","zh":"Dinocerata 的化石在北美和亚洲都有发现。"}]}],"synonyms":["uintatheres","Uintatheria"],"phonetic":"ˌdaɪnoʊˈsɛrətə","extraExplanation":["“Dinocerata”来自希腊语词根：dino-（可理解为“可怕的/巨大的”）+ kerat-（“角”）。它是一个古老的分类名称，现代书籍中常会用更常见的“Uintatheria / uintatheres”来指代这类动物。","在一些科普或古生物文献里，Dinocerata 可能被当作较早的分类用法；学习时可把它理解为“长得像犀牛/河马那样的大型古哺乳动物群”，但并不等同于恐龙。"]}
{"word":"dinocerata","summary":{"en":"Dinocerata are an extinct group of large Eocene mammals (not dinosaurs), including Uintatherium.","zh":"Dinocerata 指已灭绝的始新世大型哺乳动物类群（非恐龙），代表如乌因塔兽。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extinct order of large, early hoofed mammals (not dinosaurs), best known from fossils such as Uintatherium; also called Uintatheria","zh":"（古生物）恐角兽目：一种已灭绝的早期大型有蹄类哺乳动物类群（不是恐龙），代表化石如乌因塔兽（Uintatherium）；亦称“乌因塔兽目”（Uintatheria）"},"examples":[{"en":"Dinocerata lived during the Eocene and are known mainly from fossils in North America and Asia.","zh":"恐角兽目生活在始新世，主要通过北美和亚洲的化石为人所知。"},{"en":"Scientists compare Dinocerata skulls to understand how early mammals evolved horns and tusks.","zh":"科学家会比较恐角兽目的头骨，以了解早期哺乳动物的角状突起和獠牙是如何演化出来的。"}]}],"synonyms":["Uintatheria","dinoceratans"],"phonetic":"/ˌdaɪnoʊsəˈrætə/","extraExplanation":["词源来自希腊语：deinos（可怕的）+ keras（角）+ -ata（复数/类群后缀），字面意思接近“可怕的角（兽类）”。虽然名字里有“dino-”，但它们是哺乳动物，不是恐龙。","在现代分类里，你也可能更常看到同一类群被称为 Uintatheria（乌因塔兽目）。不同资料的用名差异，通常来自分类学修订。"]}
{"word":"dinoceratan","summary":{"en":"Dinoceratan refers to an extinct group of large, horned Eocene mammals (or a member of that group).","zh":"dinoceratan 指一类已灭绝的、生活在始新世的大型有角哺乳动物（或该类群的成员）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of) an extinct type of large, horned mammals that lived in the Eocene epoch; related to animals such as Uintatherium.","zh":"（指）已灭绝的一类大型有角哺乳动物，生活在始新世；与如尤因塔兽（Uintatherium）等动物相关。"},"examples":[{"en":"Dinoceratan fossils have been found in Eocene rock layers in North America.","zh":"在北美的始新世岩层中发现过恐角兽类（dinoceratan）的化石。"},{"en":"The museum display compares a dinoceratan skull with modern mammal skulls to show how horns evolved.","zh":"博物馆展览把恐角兽类的头骨与现代哺乳动物的头骨作对比，用来展示角的演化。"}]},{"partOfSpeech":"n.","definition":{"en":"A member of the Dinocerata (an extinct group/order of Eocene mammals).","zh":"恐角兽类成员；恐角兽目（Dinocerata）的一种已灭绝的始新世哺乳动物。"},"examples":[{"en":"Uintatherium is a well-known dinoceratan.","zh":"尤因塔兽（Uintatherium）是一种著名的恐角兽类动物。"},{"en":"Scientists debate how dinoceratan species are related to other early hoofed mammals.","zh":"科学家对恐角兽类物种与其他早期有蹄类哺乳动物的亲缘关系仍有争论。"}]}],"synonyms":["dinocerate","Dinocerata (group name)"],"phonetic":"/ˌdaɪnoʊˈsɛrətən/","extraExplanation":["词源可拆解为：dino-（“可怕的、巨大的”，见 dinosaur）+ cerat-（“角”，见 ceratops）。dinoceratan 常用于古生物学/地质学语境，指“恐角兽目（Dinocerata）”或其成员；日常英语中几乎不会用到。","相关拼写：也常见 Dinocerata（类群名）与 dinocerate（形容词/名词，部分资料中使用）。"]}
{"word":"dinoceratid","summary":{"en":"A dinoceratid is an extinct, large, horned herbivorous mammal from the Eocene.","zh":"dinoceratid 指已灭绝的始新世大型带角食草哺乳动物（恐角兽类）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extinct type of large, horned, plant-eating mammal from the Eocene period, belonging to the group (order) Dinocerata","zh":"一种已灭绝的、体型巨大的带角食草哺乳动物（始新世时期），属于“恐角兽目”（Dinocerata）"},"examples":[{"en":"Fossils of a dinoceratid have been found in North America and Asia.","zh":"在北美和亚洲都发现过恐角兽类（dinoceratid）的化石。"},{"en":"The museum display compares a dinoceratid skull with those of modern mammals.","zh":"博物馆展柜把恐角兽类的头骨与现代哺乳动物的头骨进行对比。"}]}],"synonyms":["dinocerate"],"phonetic":"ˌdaɪnoʊˈsɛrəˌtɪd","extraExplanation":["词源提示：dino- 来自希腊语，常表示“可怕的/巨大”的感觉（也见于 dinosaur）；-cerat- 来自希腊语 keras/kératos，意为“角”。因此 dinoceratid 字面上可理解为“（像）可怕的角兽的一类”。","常见相关属包括 Uintatherium（有时中文也称“乌因塔兽”）。dinoceratid 多用于古生物学或科普文章中，日常英语里很少见。"]}
{"word":"Dinoceratidae","summary":{"en":"Dinoceratidae: an extinct family of large, horned Eocene mammals.","zh":"Dinoceratidae：一种已灭绝的、始新世时期的大型有角哺乳动物科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extinct family of large, horned mammals (order Dinocerata) that lived mainly in the Eocene epoch in North America and Asia; they are often discussed in paleontology because of their heavy bodies and bony horn-like bumps on the skull.","zh":"一种已灭绝的哺乳动物科（恐角目），体型大，头骨上有角状骨突，主要生活在北美和亚洲的始新世；在古生物学中常因其笨重体型与头骨特征而被研究。"},"examples":[{"en":"Fossils of Dinoceratidae have been found in Eocene rock layers in North America.","zh":"在北美的始新世岩层中发现过恐角科（Dinoceratidae）的化石。"},{"en":"Some Dinoceratidae species had several bony bumps on their skulls that looked like horns.","zh":"一些恐角科动物的头骨上有多个骨质突起，看起来像角。"}]}],"synonyms":["dinoceratids","Uintatheriidae (older/alternate classification in some sources)"],"phonetic":"/ˌdaɪnoʊˈsɛrətɪˌdi/","extraExplanation":["“Dinoceratidae”是一个生物分类学名称：词尾“-idae”表示“科”。词根“dino-”常见于表示“巨大/可怕”，“-cerat-”与“角”有关，因此常被理解为“有角的大型动物（的一类）”。","常见相关属名包括 Uintatherium（尤因塔兽），在科普与古生物资料中经常与该科一起出现。"]}
{"word":"dinoceratidae","summary":{"en":"Dinoceratidae: an extinct family of Eocene mammals known for horn-like skull bumps.","zh":"Dinoceratidae（恐角兽科）：始新世已灭绝的大型哺乳动物科，以头骨角状骨突起著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extinct family of large, rhinoceros-like mammals (often called dinoceratids) that lived mainly in the Eocene epoch; they are known for having bony knobs or horn-like projections on the skull.","zh":"（古生物）恐角兽科：已灭绝的一类大型哺乳动物科（常称“恐角兽类”），主要生活在始新世；其头骨上常有骨质突起或类似角的结构。"},"examples":[{"en":"Dinoceratidae fossils have been found in Eocene rock layers in North America.","zh":"恐角兽科的化石在北美的始新世岩层中有发现。"},{"en":"Some Dinoceratidae species had several horn-like bumps on their skulls.","zh":"恐角兽科的一些物种头骨上有多个类似角的骨质隆起。"}]}],"synonyms":["dinoceratids","Uintatheriidae (in some classifications)"],"phonetic":"/ˌdaɪnoʊsəˈrætɪdi/","extraExplanation":["“Dinoceratidae”来自希腊语词根：dino-（可表示“可怕的、巨大的”）、cerat-（角）、-idae（动物分类学中表示“科”的后缀）。因此常被直译为“恐角兽科”。","在分类学中，这个家族常与“Uintatheriidae（尤因塔兽科）”有关：不同资料可能把它们当作同义名或近似的分类处理。学习时可把“dinoceratids（恐角兽类）”理解为这一类动物的常用称呼。"]}
{"word":"Dinoflagellata","summary":{"en":"Dinoflagellata are mostly single-celled aquatic organisms (dinoflagellates), often with two flagella; some species cause red tides.","zh":"Dinoflagellata（甲藻/双鞭毛藻类群）多为单细胞水生生物，常有两条鞭毛；部分会引发赤潮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group (phylum) of mostly single-celled aquatic organisms, many of which have two whip-like tails (flagella) for movement; some cause algal blooms such as “red tides.”","zh":"一种（门级）以单细胞为主的水生生物类群，许多具有两条鞭毛用于运动；部分种类会引发藻华，如“赤潮”。"},"examples":[{"en":"Dinoflagellata live in oceans, lakes, and other bodies of water.","zh":"Dinoflagellata 生活在海洋、湖泊等各种水体中。"},{"en":"Some Dinoflagellata can multiply quickly and contribute to red tides.","zh":"部分 Dinoflagellata 会迅速繁殖并促成赤潮。"},{"en":"Under the microscope, you can sometimes see their flagella helping them swim.","zh":"在显微镜下，有时可以看到它们的鞭毛帮助游动。"}]}],"synonyms":["dinoflagellates","Dinophyta (often used in classification)"],"phonetic":"/ˌdaɪnoʊˌflædʒəˈlɑːtə/","extraExplanation":["Dinoflagellata 是拉丁化的科学分类名称，日常英文更常用的是 dinoflagellate(s)（甲藻/双鞭毛藻）。","词源上 dino- 来自希腊语，常解释为“旋转/转动”，flagellum 表示“鞭毛”，合起来指“会用鞭毛运动、常呈旋转式移动的微生物”。","一些甲藻能发光（海水夜光）或产生毒素；当大量繁殖形成藻华时，可能影响渔业与人体健康，因此常见于环境与海洋生物学语境。"]}
{"word":"dinoflagellata","summary":{"en":"Dinoflagellata are microscopic aquatic organisms (dinoflagellates), some of which glow or cause red tides.","zh":"Dinoflagellata 指甲藻门（甲藻），是水域中的微小生物，有的会发光或引发赤潮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Dinoflagellata: a group of mostly single-celled microscopic organisms (protists) found in oceans and fresh water; many are plankton, and some can glow in the dark or cause harmful algal blooms (red tides).","zh":"甲藻门：一类主要为单细胞的微小生物（原生生物），生活在海洋或淡水中；许多是浮游生物，有些会发光或引发有害藻华（如“赤潮”）。"},"examples":[{"en":"Dinoflagellata are common plankton in warm coastal waters.","zh":"甲藻门生物在温暖的近海水域很常见，是常见的浮游生物。"},{"en":"Some Dinoflagellata produce toxins that can make shellfish unsafe to eat.","zh":"一些甲藻门生物会产生毒素，使贝类可能不适合食用。"}]}],"synonyms":["dinoflagellates","Dinophyta","dinophytes"],"phonetic":"/ˌdaɪnoʊˈflædʒəˌlætə/","extraExplanation":["“Dinoflagellata”是拉丁化的分类名称，常见英文对应词是“dinoflagellates（甲藻）”。在日常科普或新闻里，你更可能看到“dinoflagellate bloom（甲藻暴发）/ harmful algal bloom（有害藻华）/ red tide（赤潮）”。","有些甲藻会“生物发光”（海水被搅动时出现蓝色荧光），也有些会在特定条件下大量繁殖并产生毒素，影响渔业与公共健康。"]}
{"word":"Dinoflagellatae","summary":{"en":"Dinoflagellatae is a scientific taxonomic term for dinoflagellates—single-celled aquatic organisms, some of which cause red tides or bioluminescence.","zh":"Dinoflagellatae 是甲藻（双鞭毛藻）的科学分类名称：一种水生单细胞生物，其中一些会引发赤潮或产生生物发光。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a taxonomic group of single-celled aquatic organisms (protists) commonly called dinoflagellates, many of which move using two whip-like tails (flagella)","zh":"一类水生单细胞生物（原生生物）的分类群，常称“甲藻/双鞭毛藻”；许多种类靠两条鞭毛游动"},"examples":[{"en":"Dinoflagellatae includes many dinoflagellates found in oceans and lakes.","zh":"Dinoflagellatae 包含许多生活在海洋和湖泊中的甲藻类群。"},{"en":"Some Dinoflagellatae can form harmful algal blooms.","zh":"一些 Dinoflagellatae 会形成有害藻华。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to or characteristic of dinoflagellates","zh":"与甲藻（双鞭毛藻）有关的；具有甲藻特征的"},"examples":[{"en":"Researchers measured dinoflagellate (Dinoflagellatae) toxins in the water.","zh":"研究人员测量了水体中的甲藻（Dinoflagellatae）毒素。"}]}],"synonyms":["dinoflagellates","Dinophyta (in some classifications)","Pyrrhophyta (older term)"],"phonetic":"/ˌdaɪnoʊˈflædʒəˌleɪt/","extraExplanation":["“Dinoflagellatae”是较偏学术/分类学的写法（类似“某某类群/目/门”的名称），日常英语更常用“dinoflagellate(s)”来指这些生物个体或类群。","部分甲藻会引发“赤潮/有害藻华”（harmful algal bloom），有的还能发光（生物发光），例如夜晚海水呈蓝色荧光的现象就常与发光甲藻有关。"]}
{"word":"dinoflagellatae","summary":{"en":"Dinoflagellatae refers to dinoflagellates (planktonic single-celled organisms), some of which glow or cause red tides.","zh":"Dinoflagellatae 指甲藻（复数），属于浮游单细胞生物；部分会发光或引发赤潮。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Dinoflagellates: tiny single-celled organisms (a type of plankton) found mostly in oceans and lakes; some can glow in the dark or cause harmful algal blooms (“red tides”).","zh":"（复数）甲藻：一种微小的单细胞生物（浮游生物的一类），多见于海洋与湖泊；有些会发光，或引发有害藻华（“赤潮”）。"},"examples":[{"en":"Dinoflagellatae are common plankton in coastal waters.","zh":"甲藻在近海水域是常见的浮游生物。"},{"en":"Some dinoflagellatae produce toxins that can make shellfish unsafe to eat.","zh":"有些甲藻会产生毒素，使贝类变得不适合食用。"},{"en":"At night, dinoflagellatae can create a blue glow when the water is disturbed.","zh":"夜晚水面被搅动时，甲藻可能会产生蓝色的发光现象。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to dinoflagellates (used before a noun).","zh":"甲藻的；与甲藻有关的（用于名词前）。"},"examples":[{"en":"Scientists monitored dinoflagellatae activity during the bloom.","zh":"科学家在藻华期间监测了甲藻的活动。"},{"en":"The report discussed dinoflagellatae toxins and their effects on marine life.","zh":"报告讨论了甲藻毒素及其对海洋生物的影响。"}]}],"synonyms":["dinoflagellates","Dinophyta","dinophytes","plankton (general)"],"phonetic":"/ˌdaɪnoʊˈflædʒəˌleɪti/","extraExplanation":["“Dinoflagellatae”常见于较旧或拉丁化的分类用法中；现代英文里更常用“dinoflagellates”指“甲藻（复数）”，单数为“dinoflagellate”。","甲藻之名来自其两条鞭毛（flagella），能帮助它们在水中移动；“dino-”来自希腊语，含“旋转/回转”之意，呼应其游动方式。","与甲藻相关的文化与新闻语境常见于“red tide（赤潮）”“bioluminescence（生物发光）”“harmful algal bloom, HAB（有害藻华）”。"]}
{"word":"dinoflagellate","summary":{"en":"A tiny water-dwelling organism that swims using two flagella; some cause red tides or glow in the dark.","zh":"一种用两条鞭毛游动的水生微小生物；有些会引发赤潮或产生夜光现象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A microscopic (usually single-celled) organism in water that moves with two whip-like tails (flagella); many are plankton, and some can glow in the dark or cause harmful algal blooms (“red tides”).","zh":"一种生活在水中的显微（通常为单细胞）生物，靠两条鞭毛运动；许多属于浮游生物，有些会发光或引发有害藻华（如“赤潮”）。"},"examples":[{"en":"Dinoflagellates are an important part of marine plankton.","zh":"甲藻是海洋浮游生物的重要组成部分。"},{"en":"Some dinoflagellates make the ocean glow at night.","zh":"有些甲藻会让海水在夜里发光。"},{"en":"A red tide can happen when dinoflagellates multiply very quickly.","zh":"当甲藻快速大量繁殖时，就可能出现赤潮。"}]}],"synonyms":["dinophyte","microalgae (general term, not exact)"],"phonetic":"/ˌdaɪnoʊˈflædʒəˌleɪt/","extraExplanation":["“dinoflagellate”一词由“dino-”（源自希腊语，意为“旋转/回旋”，指它们常见的旋转式游动）+ “flagellate”（有鞭毛的）组成。","在科普与新闻语境里，dinoflagellates常与“red tide（赤潮）”“harmful algal bloom（有害藻华）”“bioluminescence（生物发光）”一起出现。需要注意：它们并不都是“藻类”，但常被归入浮游植物/藻类的讨论中。"]}
{"word":"Dinoflagellida","summary":{"en":"Dinoflagellida is the scientific group name for dinoflagellates—tiny aquatic organisms that can be photosynthetic and sometimes cause red tides.","zh":"Dinoflagellida 是甲藻（甲藻门）的学术分类名称：微小的水生生物，可光合作用，有时会引发赤潮等有害藻华。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group (phylum) of mostly single-celled aquatic organisms called dinoflagellates; many are part of plankton, some photosynthesize, and some can cause harmful algal blooms (“red tides”).","zh":"甲藻门：一类主要生活在水中的单细胞生物（甲藻的分类群/门）；许多属于浮游生物，有些能进行光合作用，有些会引发有害藻华（如“赤潮”）。"},"examples":[{"en":"Dinoflagellida are common in oceans and lakes as part of the plankton community.","zh":"甲藻门生物在海洋和湖泊中很常见，是浮游生物群落的一部分。"},{"en":"Some Dinoflagellida species can produce toxins that harm fish and shellfish.","zh":"某些甲藻门物种会产生毒素，危害鱼类和贝类。"}]}],"synonyms":["dinoflagellates","Dinophyta (older/alternative classification term)"],"phonetic":"/ˌdaɪnoʊˌflædʒəˈlɪdə/","extraExplanation":["“Dinoflagellida”常见于生物学/海洋学文献中，是较偏学术的分类名称；日常英语更常用“dinoflagellates（甲藻）”来指这些生物。","甲藻常被称为“旋鞭毛藻”，因为它们通常有两条鞭毛，运动方式像旋转一样前进；部分种类会发光（海水夜光现象）或与珊瑚共生，对珊瑚礁生态很重要。","“red tide（赤潮）”并不一定真的呈红色，也不全由甲藻造成；它是“有害藻华（harmful algal bloom, HAB）”的一种常见说法。"]}
{"word":"dinoflagellida","summary":{"en":"Dinoflagellida: a scientific group of dinoflagellates, common in aquatic plankton; some cause red tides or glow.","zh":"Dinoflagellida：甲藻类的科学分类群，常见于水域浮游生物；部分会引发赤潮或发光。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group (taxonomic division) of mostly single-celled organisms called dinoflagellates, found mainly in oceans and lakes; some species cause algal blooms (including “red tides”), and some can produce light (bioluminescence) or toxins.","zh":"甲藻类（一个分类群/分类单元），主要是生活在海洋和湖泊中的单细胞生物；部分种类会引发藻华（如“赤潮”），也有一些能发光（生物发光）或产生毒素。"},"examples":[{"en":"Dinoflagellida are common members of marine plankton communities.","zh":"甲藻类是海洋浮游生物群落中很常见的成员。"},{"en":"Some Dinoflagellida species can trigger harmful algal blooms that affect fisheries.","zh":"某些甲藻类物种会引发有害藻华，影响渔业。"},{"en":"At night, bioluminescent Dinoflagellida can make waves sparkle along the shore.","zh":"夜晚，能发光的甲藻类会让海浪在岸边闪闪发亮。"}]}],"synonyms":["dinoflagellates","dinoflagellate plankton"],"phonetic":"/ˌdaɪnoʊˌflædʒəˈlɪdə/","extraExplanation":["“Dinoflagellida”是拉丁化的科学名称，在英语科普中更常见的普通说法是“dinoflagellates（甲藻）”。在正式科研语境里，它也可能指特定的分类层级（不同教材/体系略有差异）。","词源提示：dino- 来自希腊语，表示“旋转/旋涡”，flagell- 与“鞭毛”有关，指它们常用鞭毛运动。","文化与自然现象关联：赤潮、有害藻华、贝类毒素预警，以及海面“蓝眼泪/海发光”等现象，都常与某些甲藻有关。"]}
{"word":"dinomic","summary":{"en":"Dynamic means energetic and changing; it can also mean related to motion/forces, or a driving force in relationships or systems.","zh":"Dynamic 表示“有活力、不断变化的”；也可指“与运动/力有关”；还可作名词表示“推动发展的动力/互动关系（dynamics）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person, group, or situation) full of energy, change, and new ideas; not static.","zh":"（人、团体或局势）充满活力的；不断变化并有新想法的；非静止不变的。"},"examples":[{"en":"She’s a dynamic leader who motivates the whole team.","zh":"她是一位充满活力的领导者，能激励整个团队。"},{"en":"The city is dynamic, with new restaurants opening every month.","zh":"这座城市充满活力，几乎每个月都有新餐厅开业。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of forces or movement) related to motion and the forces that cause it.","zh":"（力学/物理）与运动及引起运动的力有关的。"},"examples":[{"en":"Engineers studied the dynamic forces on the bridge during strong winds.","zh":"工程师研究了强风下桥梁所受的动态力。"},{"en":"Dynamic analysis helps predict how a machine behaves while moving.","zh":"动态分析有助于预测机器在运动时的表现。"}]},{"partOfSpeech":"n.","definition":{"en":"a driving force or pattern of interaction that influences how something develops (often plural: dynamics).","zh":"推动事物发展的一种力量或相互作用模式（常用复数 dynamics：动态/相互关系）。"},"examples":[{"en":"Trust is a key dynamic in a healthy relationship.","zh":"信任是健康关系中的关键动力/关键互动因素。"},{"en":"The dynamics of the workplace changed after the new manager arrived.","zh":"新经理到来后，职场的相互关系发生了变化。"}]}],"synonyms":["energetic","lively","active","vibrant","changing","fluid","force","interaction"],"phonetic":"/daɪˈnæmɪk/","extraExplanation":["你输入的 **dinomic** 通常是 **dynamic** 的拼写错误。常见发音是 /daɪˈnæmɪk/，重音在第二个音节。","词根来自希腊语 *dynamis*（力量）。因此 **dynamic** 常带有“有推动力、能量、变化”的感觉。"]}
{"word":"Dinomys","summary":{"en":"Dinomys is a scientific genus name for a large South American rodent group, best known for the pacarana.","zh":"Dinomys 是南美洲一种大型啮齿动物的属名，最著名的现存物种是帕卡拉纳鼠。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of large rodents native to South America; its best-known living species is the pacarana (Dinomys branickii).","zh":"（哺乳动物）一种南美洲的大型啮齿动物属；现存最著名的物种是帕卡拉纳鼠（Dinomys branickii）。"},"examples":[{"en":"The pacarana belongs to the genus Dinomys.","zh":"帕卡拉纳鼠属于Dinomys（帕卡拉纳鼠属）。"},{"en":"Researchers study Dinomys to understand the evolution of South American rodents.","zh":"研究人员研究Dinomys，以了解南美洲啮齿动物的演化。"}]}],"synonyms":["pacarana (common-name context)"],"phonetic":"/ˈdaɪnəˌmɪs/","extraExplanation":["词源小贴士：Dinomys 来自希腊语词根，dino-（意为“可怕的、巨大的”，同源于 “dinosaur” 里的 dino-）+ -mys（意为“鼠”），字面意思接近“巨鼠”。","在科普或动物学语境里，你更常看到具体物种名 pacarana（帕卡拉纳鼠）而不是属名 Dinomys；属名多用于学术写作或分类讨论。"]}
{"word":"dinomys","summary":{"en":"Dinomys is the scientific genus name for the pacarana, a rare large rodent from the Andes in South America.","zh":"Dinomys是帕卡拉纳鼠的属名（科学分类用名），这种动物是南美安第斯山脉较罕见的大型啮齿动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of South American rodents; it includes the pacarana (Dinomys branickii), a large, rare rodent found mainly in the Andes","zh":"南美洲一种啮齿动物的属名；其中包括帕卡拉纳鼠（Dinomys branickii），一种体型较大且较罕见、主要分布在安第斯山脉的啮齿动物"},"examples":[{"en":"The pacarana belongs to the genus Dinomys.","zh":"帕卡拉纳鼠属于Dinomys（Dinomys属）。"},{"en":"Researchers set camera traps hoping to record Dinomys in cloud forests.","zh":"研究人员在云雾林里布设红外相机，希望拍到Dinomys属的动物。"}]}],"synonyms":["pacarana"],"phonetic":"/ˈdaɪnoʊmɪs/","extraExplanation":["“Dinomys”是生物分类学中的拉丁化学名（属名），写作时通常首字母大写并使用斜体（Dinomys）。","它最常指该属中现存的物种——帕卡拉纳鼠（pacarana）。日常英文里更常见的动物名是“pacarana”，而“Dinomys”多出现在科普或学术语境中。"]}
{"word":"Dinophilea","summary":{"en":"Dinophilea means a strong love or fascination with dinosaurs; it’s a rare/nonstandard form (dinophilia is more common).","zh":"Dinophilea 指对恐龙的强烈喜爱或迷恋；该拼写较少见/不太规范，更常用的是 dinophilia。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard/rare) a strong love of, fascination with, or enthusiasm for dinosaurs.","zh":"（非标准/较少见）对恐龙的强烈喜爱、迷恋或热情。"},"examples":[{"en":"Ever since I was a kid, I’ve had dinophilea—I could read dinosaur books for hours.","zh":"我从小就有“dinophilea”（恐龙迷倾向）——我可以连续好几个小时看恐龙书。"},{"en":"Her dinophilea led her to study paleontology in college.","zh":"她对恐龙的迷恋让她在大学选择了古生物学。"}]}],"synonyms":["dinophilia","dinosaur obsession","dinosaur enthusiasm"],"phonetic":"/ˌdaɪnəˈfaɪliə/","extraExplanation":["“Dinophilea”在英语里不算常见、也不太规范；更常见的拼写是 **dinophilia**（表示“对恐龙的热爱”），结构类似 **bibliophilia**（爱书）、**cinephilia**（爱电影）。","词源上可理解为：**dino-**（来自“dinosaur”/“deinos”，与恐龙相关）+ **-philia**（希腊语词根，表示“喜爱、偏好”）。在正式写作（论文、新闻）中建议用 **dinophilia**。"]}
{"word":"dinophilea","summary":{"en":"Dinophilia means a strong love of dinosaurs; related word: dinophile (a dinosaur fan).","zh":"Dinophilia 指对恐龙的强烈热爱/迷恋；相关词 dinophile 指恐龙爱好者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong love of or fascination with dinosaurs; dinosaur enthusiasm","zh":"对恐龙的强烈喜爱或迷恋；“恐龙迷”倾向"},"examples":[{"en":"Her dinophilia started when she saw a T. rex skeleton at the museum.","zh":"她的“恐龙迷”兴趣始于在博物馆看到一具霸王龙骨架。"},{"en":"Dinophilia can lead people to read books, watch documentaries, and collect dinosaur models.","zh":"对恐龙的迷恋常会让人读相关书籍、看纪录片、收藏恐龙模型。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) a person who loves dinosaurs; a dinosaur fan","zh":"（非正式）喜欢恐龙的人；恐龙爱好者"},"examples":[{"en":"As a kid, he was a proud dinophile who could name dozens of species.","zh":"他小时候是个自豪的恐龙迷，能说出好几十种恐龙的名字。"},{"en":"The event is perfect for young dinophiles and their parents.","zh":"这个活动很适合小恐龙迷和他们的家长。"}]}],"synonyms":["dinosaur enthusiast","dinosaur fan","dino fan"],"phonetic":"/ˌdaɪnəˈfɪliə/","extraExplanation":["你输入的 **dinophilea** 在英语里不太常见，更可能是拼写误差。常见形式是：\n- **dinophilia**：表示“对恐龙的迷恋/热爱”（抽象名词）\n- **dinophile**：表示“恐龙爱好者”（指人）\n词源上，**dino-** 来自希腊语 *deinos*（“可怕的、惊人的”），**-philia** 表示“喜爱/爱好”。","这类词多用于兴趣圈、科普写作、社群标签等语境，正式学术写作中更常说 “dinosaur enthusiast / dinosaur fan”。"]}
{"word":"Dinophilus","summary":{"en":"Dinophilus: a scientific genus name for tiny marine annelid worms.","zh":"Dinophilus：一种微小海洋环节动物（分节蠕虫）的属名，主要用于科学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of very small marine segmented worms (annelids), often used in zoology and developmental biology as study organisms","zh":"恐虫属：一种非常微小的海洋环节动物（分节的蠕虫）属名，常见于动物学与发育生物学研究中作为研究对象"},"examples":[{"en":"Dinophilus is a genus of tiny marine worms found in coastal waters.","zh":"Dinophilus（恐虫属）是一类生活在近海水域的微小海洋蠕虫。"},{"en":"The paper compared embryo development in Dinophilus and other annelids.","zh":"这篇论文比较了Dinophilus与其他环节动物的胚胎发育过程。"}]}],"synonyms":["genus (taxonomic term)","annelid (broader group)","marine worm (general description)"],"phonetic":"/daɪˈnɑːfɪləs/","extraExplanation":["Dinophilus 是生物分类学中的拉丁化属名，常见于学术文章、物种名（如 Dinophilus gyrociliatus）以及显微观察或发育研究的语境中。日常英语里几乎不会用到，更多出现在科学写作与教材里。","词源上常被解释为来自希腊语词根 deinos（可表示“可怕的/令人惊奇的”）+ philos（“喜爱/爱”），但在分类命名中通常不需要按字面翻译理解，记作一个专有名词即可。"]}
{"word":"dinophilus","summary":{"en":"Dinophilus is a scientific genus name for tiny marine annelid worms, mainly used in biology and research contexts.","zh":"Dinophilus 是一个科学属名，指一类微小的海洋环节动物，主要用于生物学与科研语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of very small marine worms (annelids), often studied in biology for their simple body plan and development.","zh":"（生物）恐蛉虫属：一类体型极小的海洋环节动物（多毛类/环节虫），常用于研究其简单的身体结构与发育过程。"},"examples":[{"en":"In the lab, students observed Dinophilus under a microscope to identify its ciliary movement.","zh":"在实验课上，学生们在显微镜下观察恐蛉虫属（Dinophilus），以辨认其纤毛的运动方式。"},{"en":"Some species of Dinophilus are used in studies of marine invertebrate development.","zh":"恐蛉虫属的某些物种会被用于海洋无脊椎动物发育研究。"}]}],"synonyms":["(scientific) marine annelid worm","(scientific) polychaete worm"],"phonetic":"/ˌdaɪnoʊˈfaɪləs/","extraExplanation":["这是一个拉丁化的学名（属名），日常英语中很少出现，更多见于动物学/海洋生物学论文与教材。","读到该词时，常与具体物种连用，例如 *Dinophilus gyrociliatus*（属内一种常被研究的物种）。在英文写作中，属名通常首字母大写并用斜体。"]}
{"word":"Dinophyceae","summary":{"en":"Dinophyceae: a scientific class name for dinoflagellates, some of which can cause red tides.","zh":"Dinophyceae：甲藻纲，甲藻的分类学名称；部分物种与赤潮等有害藻华有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a class of mostly single-celled plankton (dinoflagellates) found in oceans and freshwater; some species make their own food with photosynthesis, and some can cause harmful algal blooms (“red tides”).","zh":"甲藻纲：主要生活在海洋与淡水中的单细胞浮游生物（甲藻）的一个纲；部分可行光合作用，部分物种可能引发有害藻华（如“赤潮”）。"},"examples":[{"en":"Dinophyceae are common in marine plankton and can strongly influence food webs.","zh":"甲藻纲在海洋浮游生物中很常见，会显著影响食物网。"},{"en":"Some Dinophyceae produce toxins that can accumulate in shellfish.","zh":"一些甲藻纲生物会产生毒素，并可能在贝类体内累积。"},{"en":"Researchers monitored Dinophyceae levels to understand the risk of a red tide.","zh":"研究人员监测甲藻纲生物的数量，以评估赤潮风险。"}]}],"synonyms":["dinoflagellates","dinophytes"],"phonetic":"/ˌdaɪnoʊˈfaɪsiˌi/","extraExplanation":["发音与词源：Dino- 来自希腊语，表示“旋转/回旋”，对应甲藻常见的“旋转式”运动；-phyceae 常用于藻类分类名称。","学习提示：在日常英文中，更常见的通用词是 dinoflagellates（甲藻/甲藻类）；Dinophyceae 更偏学术与分类学语境。","文化与科学背景：新闻里提到的 red tide（赤潮）常与某些甲藻相关，但并非所有赤潮都由甲藻造成，也并非所有甲藻都会产生毒素。"]}
{"word":"dinophyceae","summary":{"en":"Dinophyceae: a class of dinoflagellate algae; some cause red tides or bioluminescence.","zh":"Dinophyceae：甲藻纲（双鞭毛藻类）；部分会发光或引发赤潮等有害藻华。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a class of microscopic algae (dinoflagellates) that live in oceans and freshwater; some species glow in the dark (bioluminescence) or cause harmful algal blooms (“red tides”).","zh":"甲藻纲（又称双鞭毛藻类）——一类生活在海洋与淡水中的微小藻类；部分种类会发光（生物发光）或引发有害藻华（“赤潮”）。"},"examples":[{"en":"Many Dinophyceae are important plankton in marine food webs.","zh":"许多甲藻纲生物是海洋食物网中重要的浮游生物。"},{"en":"A bloom of Dinophyceae can discolor the water and harm fish.","zh":"甲藻纲生物暴发性繁殖可能使海水变色并危害鱼类。"},{"en":"Some Dinophyceae produce toxins that can accumulate in shellfish.","zh":"一些甲藻纲生物会产生毒素，并可能在贝类体内累积。"}]}],"synonyms":["dinoflagellates","Dinoflagellata"],"phonetic":"/ˌdaɪnoʊfaɪˈsiːiː/","extraExplanation":["“Dinophyceae”是生物分类学用语，常在论文、教材或环境监测报告中出现；日常英语更常用“dinoflagellates（甲藻/双鞭毛藻）”来指这一大类生物。","词源上“dino-”来自希腊语，带有“旋转/旋涡”的含义，和许多甲藻旋转游动的特征相关；“-phyceae”是表示“藻类”的学术后缀。"]}
{"word":"Dinornis","summary":{"en":"Dinornis is the scientific name of an extinct genus of giant flightless moa from New Zealand.","zh":"Dinornis 是新西兰已灭绝的巨型不会飞的摩亚鸟（恐鸟属）的学名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of extinct giant flightless birds (moa) that once lived in New Zealand","zh":"已灭绝的巨型不会飞的鸟类属（恐鸟属/摩亚鸟的一属），曾生活在新西兰"},"examples":[{"en":"Dinornis was one of the largest moa, and it could not fly.","zh":"恐鸟属（Dinornis）是体型最大的摩亚鸟之一，它不会飞。"},{"en":"Scientists study Dinornis bones to learn about New Zealand’s ancient ecosystems.","zh":"科学家研究恐鸟属的骨骼，以了解新西兰的古代生态系统。"}]}],"synonyms":["moa","giant moa"],"phonetic":"/daɪˈnɔrnɪs/","extraExplanation":["词源：Dinornis 来自希腊语，din-（deinos，意为“可怕的、巨大的”）+ ornis（意为“鸟”），字面可理解为“巨鸟”。","文化与背景：摩亚鸟（moa）在新西兰的自然史与毛利文化叙事中常被提及；随着人类到来与环境变化，摩亚鸟在近代史前时期灭绝。Dinornis 常被称为“giant moa（巨型摩亚鸟）”。"]}
{"word":"dinornis","summary":{"en":"Dinornis is the scientific name of a genus of extinct giant flightless birds (moas) from New Zealand.","zh":"Dinornis 指新西兰已灭绝的巨型不会飞鸟类（恐鸟/莫阿鸟）的一个属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of extinct, very large flightless birds (moas) that once lived in New Zealand.","zh":"恐鸟属：一种已经灭绝的巨型不会飞的鸟类（属“恐鸟/莫阿鸟”之一），曾生活在新西兰。"},"examples":[{"en":"Dinornis is one of the best-known moa genera from prehistoric New Zealand.","zh":"Dinornis 是史前新西兰最著名的恐鸟（莫阿鸟）属之一。"},{"en":"Scientists study Dinornis bones to learn about the size and lifestyle of moas.","zh":"科学家通过研究 Dinornis 的骨骼来了解恐鸟（莫阿鸟）的体型与生活方式。"}]}],"synonyms":["moa","giant moa"],"phonetic":"/ˌdaɪˈnɔr.nɪs/","extraExplanation":["“Dinornis”常见于古生物学和博物馆语境，指“恐鸟属”。日常英语中更常用的通俗说法是“moa（莫阿鸟/恐鸟）”。","词源上来自希腊语：deinos（可怕的、巨大的）+ ornis（鸟）。因此可理解为“巨鸟/恐怖的大鸟”。","恐鸟在新西兰曾长期缺少大型陆地哺乳动物天敌，演化成不会飞但体型巨大的鸟类；在有人类到达后不久灭绝。"]}
{"word":"Dinornithes","summary":{"en":"Dinornithes is the scientific group name for the extinct New Zealand moas.","zh":"Dinornithes 是已灭绝的新西兰莫阿鸟（恐鸟）类群的科学名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific name for an extinct group (order) of large, flightless birds from New Zealand, commonly called moas.","zh":"（生物学）恐鸟目：一种已灭绝的大型不会飞的鸟类类群（目），原产新西兰，常称“恐鸟/莫阿鸟”。"},"examples":[{"en":"Dinornithes lived in New Zealand until humans arrived and hunted them.","zh":"恐鸟目动物在新西兰生存，直到人类到来后因捕猎等原因而灭绝。"},{"en":"Museums display Dinornithes bones to show how huge moas were.","zh":"博物馆会展出恐鸟目的骨骼，展示莫阿鸟曾经有多么巨大。"}]}],"synonyms":["moa","moas","moa birds"],"phonetic":"/ˌdaɪnɔrˈnaɪθiz/","extraExplanation":["词源上可拆解为希腊语成分：dino-（“可怕的、巨大的”，也见于 dinosaur）+ ornith-（“鸟”，也见于 ornithology“鸟类学”）+ -es（复数/类群形式），整体意思接近“巨鸟类群”。","恐鸟（moa）是新西兰特有的巨型鸟类，缺乏天敌使其更易在有人类与外来动物引入后迅速衰退；它们的灭绝常被用作讨论人类活动与生态脆弱性的案例。"]}
{"word":"dinornithes","summary":{"en":"Dinornithes refers to the extinct New Zealand moas—giant flightless birds.","zh":"Dinornithes 指已灭绝的新西兰恐鸟（莫阿鸟），一种巨大不会飞的鸟类类群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extinct group (order) of large, flightless birds from New Zealand, commonly called moas","zh":"一种已灭绝的大型不会飞的鸟类类群（鸟纲中的一个“目”），原产新西兰，通常称为“恐鸟/莫阿鸟（moa）”"},"examples":[{"en":"Dinornithes were giant flightless birds that once lived in New Zealand.","zh":"Dinornithes（恐鸟目）是曾生活在新西兰的巨大不会飞的鸟类。"},{"en":"Many Dinornithes species disappeared after humans arrived and hunted them.","zh":"人类到来并捕猎后，许多Dinornithes（恐鸟）物种相继消失。"}]}],"synonyms":["moa","moas"],"phonetic":"/ˌdaɪnɔrˈnaɪθiz/","extraExplanation":["“Dinornithes”是拉丁化的科学名称，常用于古生物学与动物分类学文献中；日常英语里更常说“moa / moas（莫阿鸟/恐鸟）”。","词源来自希腊语：dino-（可理解为“巨大/可怕的”，也见于“dinosaur”）+ ornith-（“鸟”，见于“ornithology 鸟类学”）。","恐鸟在新西兰长期缺少大型陆地哺乳动物天敌，演化出体型巨大、失去飞行能力；在波利尼西亚人（毛利人祖先）到来后的狩猎与栖息地改变等因素影响下灭绝。"]}
{"word":"dinornithic","summary":{"en":"Dinornithic means “related to the extinct moa (Dinornithidae) of New Zealand.”","zh":"dinornithic 指“与新西兰已灭绝的恐鸟（莫阿鸟，恐鸟科）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Dinornithidae (the extinct New Zealand moa) or to moa-like birds.","zh":"与恐鸟科（新西兰已灭绝的“恐鸟/莫阿鸟”）有关的；恐鸟类的。"},"examples":[{"en":"Scientists found dinornithic bones in a cave in New Zealand.","zh":"科学家在新西兰的一个洞穴里发现了恐鸟类的骨骼。"},{"en":"The museum has a dinornithic skeleton on display.","zh":"博物馆展出了一个恐鸟类的骨架。"}]}],"synonyms":["moa-related","of the moa","Dinornis-related"],"phonetic":"/ˌdaɪnɔrˈnɪθɪk/","extraExplanation":["“dinornithic”来自“Dinornis”（恐鸟属名）+ “-ic”（表示“……的”）。在学术写作中常见，尤其是古生物学、动物学与博物馆展陈说明里；日常英语中更常说“moa”或“moa-related”。","恐鸟（moa）是新西兰特有的大型不会飞的鸟类，历史上因人类活动等原因灭绝；因此“dinornithic”常出现在化石、骨骼、遗传研究等语境。"]}
{"word":"dinornithid","summary":{"en":"An extinct New Zealand moa (a member of the family Dinornithidae).","zh":"已灭绝的新西兰恐鸟（恐鸟科 Dinornithidae 的成员）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Dinornithidae, an extinct family of very large, flightless birds from New Zealand (commonly called moas).","zh":"恐鸟科成员；一种已灭绝的新西兰大型不会飞的鸟类（通常称为“恐鸟/莫阿鸟”）。"},"examples":[{"en":"Dinornithids (moas) were once the largest land birds in New Zealand.","zh":"恐鸟科动物（莫阿鸟）曾是新西兰最大的陆地鸟类。"},{"en":"Scientists study dinornithid bones to learn about New Zealand’s ancient ecosystems.","zh":"科学家研究恐鸟科的骨骼，以了解新西兰的古代生态系统。"}]}],"synonyms":["moa","giant moa"],"phonetic":"/ˌdaɪnɔrˈnɪθɪd/","extraExplanation":["“dinornithid”来自希腊语词根：dino-（“可怕的/巨大的”，同 dinosaur 的 dino-）+ ornith-（“鸟”，同 ornithology“鸟类学”）。","在大众语境中，人们更常说 moa（莫阿鸟）。dinornithid 是更偏学术、分类学的用词。","恐鸟通常被认为在人类到达新西兰后不久因捕猎与栖息地变化而灭绝，因此它常出现在关于人类活动与物种灭绝的讨论中。"]}
{"word":"Dinornithidae","summary":{"en":"Dinornithidae is the scientific family name for New Zealand’s extinct moas.","zh":"Dinornithidae 是新西兰已灭绝的“恐鸟（moa）”所属的科学分类“科名”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific family name for the moas—large, extinct, flightless birds that once lived in New Zealand","zh":"（生物学）恐鸟科：指“恐鸟”（moa）所属的一个鸟类科，曾生活于新西兰、体型巨大、不会飞，现已灭绝"},"examples":[{"en":"Dinornithidae were once common across New Zealand before humans arrived.","zh":"在人类到来之前，恐鸟科动物曾遍布新西兰。"},{"en":"Fossils of Dinornithidae help scientists understand ancient ecosystems.","zh":"恐鸟科的化石能帮助科学家了解古代生态系统。"}]}],"synonyms":["moa family","Dinornithids"],"phonetic":"/daɪˌnɔrˈnɪθɪdiː/","extraExplanation":["词源：Dinornithidae 来自希腊语词根，dino-（“可怕的、巨大的”，也常见于 dinosaur）+ ornith-（“鸟”，见于 ornithology“鸟类学”）+ -idae（动物分类学中表示“科”的后缀）。","文化与历史背景：恐鸟（moa）是新西兰特有的大型鸟类，普遍认为在波利尼西亚人到达后因狩猎与栖息地变化在约 14–15 世纪迅速灭绝。它们常与“哈斯特鹰（Haast’s eagle）”等新西兰史前生态系统一起被提及。"]}
{"word":"dinornithidae","summary":{"en":"Dinornithidae is the scientific name for the extinct moa family from New Zealand.","zh":"Dinornithidae 是“恐鸟科”的学名，指新西兰已灭绝的恐鸟（莫阿鸟）这一类群。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of extinct, large flightless birds known as moas, once native to New Zealand","zh":"恐鸟科（已灭绝的一科大型不会飞的鸟类，即“恐鸟/莫阿鸟”，原产新西兰）"},"examples":[{"en":"Dinornithidae once included some of the largest birds that ever lived in New Zealand.","zh":"恐鸟科曾包含一些在新西兰出现过的最大鸟类。"},{"en":"Scientists study Dinornithidae fossils to learn how moas evolved and why they went extinct.","zh":"科学家研究恐鸟科化石，以了解恐鸟如何演化以及它们为何灭绝。"}]}],"synonyms":["moa family","Dinornithidae (scientific term)"],"phonetic":"/ˌdaɪˌnɔrˈnɪθəˌdiː/","extraExplanation":["“Dinornithidae”是生物分类学名称：词根来自希腊语 dino-（可理解为“巨大的/可怕的”）与 ornis（鸟），再加上科名后缀 -idae（表示“某某科”）。","恐鸟（moa）曾生活在新西兰，约在近千年内因人类活动、栖息地改变与捕猎等因素而灭绝；相关研究常见于古生物学与生态史讨论。","日常英语里更常说“moa”或“moas”，而“Dinornithidae”多用于学术文章、博物馆说明牌或化石研究。"]}
{"word":"Dinornithiformes","summary":{"en":"Dinornithiformes is the scientific name for the extinct New Zealand moa—large, flightless birds.","zh":"Dinornithiformes 是新西兰已灭绝的恐鸟（moa）的科学分类名称，指一类大型不会飞的鸟。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extinct order of large, flightless birds from New Zealand, commonly known as the moa.","zh":"（生物分类）恐鸟目：已灭绝的一目大型不会飞的鸟类，产于新西兰，俗称“恐鸟（moa）”。"},"examples":[{"en":"Dinornithiformes once dominated many forest and grassland habitats in New Zealand.","zh":"恐鸟目曾在新西兰的许多森林和草原栖息地中占据优势。"},{"en":"Scientists study Dinornithiformes fossils to understand how moa evolved without mammalian predators.","zh":"科学家研究恐鸟目的化石，以了解恐鸟在缺少哺乳动物捕食者的环境中如何演化。"}]}],"synonyms":["moa","moa order"],"phonetic":"/daɪˌnɔrˈnɪθɪˌfɔrmiːz/","extraExplanation":["词源提示：Dinornithiformes 来自希腊语成分 dino-（“可怕的、巨大的”之意，常见于 dinosaur）+ ornith-（“鸟”，如 ornithology 鸟类学）+ -formes（“……形态/……目”）。","语境提示：这是一个学术性很强的拉丁化分类名称，日常英语更常用 moa（恐鸟）来指代这些鸟。"]}
{"word":"dinornithiformes","summary":{"en":"Dinornithiformes is the scientific name for the extinct moa order—large, flightless birds from New Zealand.","zh":"Dinornithiformes 指“恐鸟目”，即已灭绝的莫阿鸟类群——新西兰的大型不会飞鸟。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Dinornithiformes: an extinct order of large, flightless birds (moas) that lived in New Zealand until relatively recent times (about 600–700 years ago), known only from fossils and historical evidence.","zh":"Dinornithiformes：恐鸟目（或称“恐鸟类”）——一种已灭绝的大型不会飞的鸟类类群（即“莫阿鸟”），曾生活在新西兰，约在近几百年（约600–700年前）灭绝，主要依据化石与相关历史证据为人所知。"},"examples":[{"en":"Dinornithiformes were once the dominant large herbivores in many New Zealand ecosystems.","zh":"恐鸟目曾是新西兰许多生态系统中主要的大型植食动物。"},{"en":"Scientists study Dinornithiformes bones to understand how moas evolved without flight.","zh":"科学家通过研究恐鸟目的骨骼来了解莫阿鸟如何在无飞行能力的情况下演化。"}]}],"synonyms":["moas","moa (informal/common name)","order Dinornithiformes (scientific)"],"phonetic":"/daɪˌnɔːrˈnɪθəˌfɔːrmiːz/","extraExplanation":["“Dinornithiformes”是生物分类学中的“目”（order）名，常见于学术文章、博物馆展牌与古生物资料中；日常英语里更常用的词是“moa（莫阿鸟）”。","词源可拆解理解：dino-（巨大、可怕）+ ornith-（鸟）+ -formes（形态、类群），整体带有“巨大鸟类”之意。","它们在新西兰缺少陆生哺乳动物捕食者的环境中演化为大型、不会飞的鸟；人类到来后因狩猎与栖息地变化快速消失，常被用作“人类活动导致近代灭绝”的典型案例。"]}
{"word":"dinornithine","summary":{"en":"Dinornithine means “related to” or “a member of” the moa (an extinct giant flightless bird from New Zealand).","zh":"dinornithine 指“与恐鸟有关的”，或“恐鸟（类）的成员”；恐鸟是新西兰已灭绝的巨型不会飞的鸟。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the moa (extinct giant flightless birds of New Zealand) or to the family Dinornithidae.","zh":"与恐鸟（新西兰已灭绝的巨型不会飞的鸟）或恐鸟科（Dinornithidae）有关的。"},"examples":[{"en":"Scientists study dinornithine bones to understand how moas lived.","zh":"科学家研究恐鸟类的骨骼，以了解恐鸟如何生活。"},{"en":"Dinornithine fossils are important evidence of New Zealand’s past ecosystems.","zh":"恐鸟类化石是新西兰古生态系统的重要证据。"}]},{"partOfSpeech":"n.","definition":{"en":"a moa; a member of the moa group (Dinornithidae).","zh":"恐鸟；恐鸟类（恐鸟科 Dinornithidae）的成员。"},"examples":[{"en":"A dinornithine could grow taller than a human.","zh":"一只恐鸟的身高可能超过人类。"},{"en":"The museum display includes an egg from a dinornithine.","zh":"博物馆展柜里有一枚恐鸟的蛋。"}]}],"synonyms":["moa","dinornithid"],"phonetic":"/daɪˈnɔr.nɪθaɪn/","extraExplanation":["“Dinornithine”来自“Dinornis”（恐鸟属名，字面可理解为“可怕/巨大的鸟”）+ 形容词后缀“-ine”。它多见于古生物学、动物学等较学术的语境；日常英语里更常说“moa”（恐鸟）。"]}
{"word":"dinornithoid","summary":{"en":"“Dinornithoid” means moa-like: relating to or resembling extinct New Zealand moas.","zh":"“dinornithoid”意为“恐鸟似的/与恐鸟有关的”，常用于描述像新西兰已灭绝恐鸟的化石或特征。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or resembling a moa (an extinct, large flightless bird of New Zealand) or the moa family (Dinornithidae).","zh":"与恐鸟（新西兰已灭绝的大型不会飞的鸟）或恐鸟科（Dinornithidae）有关的；像恐鸟的。"},"examples":[{"en":"The museum displayed a dinornithoid leg bone from prehistoric New Zealand.","zh":"博物馆展出了一块来自史前新西兰的“恐鸟类”腿骨。"},{"en":"Paleontologists debated whether the footprint was dinornithoid or from another large bird.","zh":"古生物学家讨论这串足迹究竟是否属于恐鸟类，还是来自另一种大型鸟类。"}]}],"synonyms":["moa-like","dinornithid (related term)"],"phonetic":"/ˌdaɪnɔrˈnɪθɔɪd/","extraExplanation":["“dinornithoid”由“Dinornis/恐鸟属（历史上常用来指恐鸟）+ -oid（意为‘……似的、……状的’）构成，因此多用于学术语境，描述骨骼、足迹或化石特征“像恐鸟”。","恐鸟（moa）是新西兰特有的巨型不会飞的鸟类，已于近代历史时期灭绝；在自然史、古生物学与考古学写作中会遇到相关词汇。"]}
{"word":"dinos","summary":{"en":"“Dinos” is an informal plural meaning “dinosaurs,” and it can also mean “old-fashioned/outdated people or things.”","zh":"“dinos”是“dinosaurs（恐龙）”的非正式复数简称，也可指守旧、过时的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) Short for “dinosaurs”; large prehistoric reptiles.","zh":"（非正式）“dinosaurs”的简写；指恐龙（史前大型爬行动物）。"},"examples":[{"en":"My kid is obsessed with dinos and can name dozens of species.","zh":"我家孩子迷上了恐龙，能说出几十种恐龙的名字。"},{"en":"The museum has a new dinos exhibit this summer.","zh":"博物馆今年夏天有新的恐龙展。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) People or things seen as old-fashioned, outdated, or resistant to change (plural of “dino”).","zh":"（非正式）指被认为守旧、过时或不愿改变的人或事物（“dino”的复数）。"},"examples":[{"en":"Some people think those policies are dinos from another era.","zh":"有些人觉得那些政策是另一个时代的“老古董”。"},{"en":"He calls anyone who hates new technology a dino.","zh":"他把讨厌新科技的人都叫作“老顽固”。"}]}],"synonyms":["dinosaurs","dinos (informal)","old-timers (for people, informal)","dinosaurs (figurative, for outdated things)"],"phonetic":"/ˈdaɪnoʊz/","extraExplanation":["“dinos”最常见于口语、儿童读物、社交媒体中，作为“dinosaurs”的轻松说法。第二个含义带一点评价色彩，常用于调侃“守旧的人/老一套的东西”。"]}
{"word":"dinosaur","summary":{"en":"A dinosaur is an extinct prehistoric reptile; informally, it can also mean something or someone very old-fashioned or outdated.","zh":"dinosaur 指“恐龙”；口语里也可指“老古董/过时的人或物”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very large reptile that lived millions of years ago; dinosaurs are extinct animals from the Mesozoic Era (like Tyrannosaurus rex).","zh":"恐龙：生活在数百万年前的巨大爬行动物；属于中生代的已灭绝动物（如霸王龙）。"},"examples":[{"en":"Dinosaurs became extinct about 66 million years ago.","zh":"恐龙大约在6600万年前灭绝。"},{"en":"My child loves books about dinosaurs like T. rex and Triceratops.","zh":"我的孩子很喜欢关于恐龙的书，比如霸王龙和三角龙。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) a person or thing that is old-fashioned, out of date, or unable to adapt to modern life or technology.","zh":"（非正式）老古董；跟不上时代的人或事物；过时、难以适应新科技或新观念的东西。"},"examples":[{"en":"I feel like a dinosaur when everyone talks about the newest apps.","zh":"大家都在聊最新的应用程序时，我感觉自己像个老古董。"},{"en":"That computer is a dinosaur—it takes ten minutes to start.","zh":"那台电脑太老旧了——开机要十分钟。"}]}],"synonyms":["(literal) prehistoric reptile","(informal) relic","fossil","old-timer","dinosaur (slang)"],"phonetic":"/ˈdaɪ.nə.sɔr/","extraExplanation":["“dinosaur”字面意义是“恐怖的蜥蜴”，来自希腊语词根：deinos（可怕的）+ sauros（蜥蜴）。现代科学发现恐龙并不都是“蜥蜴样”，而是一个多样化的动物类群。","在口语里把人或物说成“a dinosaur”，语气通常带点调侃，意思是“太老派/落伍”，在职场或科技语境中很常见。"]}
{"word":"Dinosauria","summary":{"en":"Dinosauria is the scientific term for the dinosaur clade, which in modern classification also includes birds.","zh":"Dinosauria 是“恐龙类群”的科学名称；在现代分类中也包含鸟类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the scientific group (clade) that includes all dinosaurs—both extinct species and living birds (in modern classification)","zh":"（生物学）恐龙类群（演化支）：包含所有恐龙；在现代分类中也包括现生鸟类（被视为恐龙的后代）"},"examples":[{"en":"In modern biology, birds are classified within Dinosauria.","zh":"在现代生物学中，鸟类被归入恐龙类群（Dinosauria）。"},{"en":"Fossils from the Jurassic period provide important evidence about Dinosauria.","zh":"侏罗纪时期的化石为研究恐龙类群（Dinosauria）提供了重要证据。"}]}],"synonyms":["dinosaurs (informal/general)","dinosaur clade"],"phonetic":"/ˌdaɪnəˈsɔriə/","extraExplanation":["“Dinosauria”是拉丁化的科学名称，来源于希腊语：deinos（可怕的、巨大的）+ sauros（蜥蜴）。英语日常说“dinosaur(s)”更多；“Dinosauria”主要用于学术写作与科普的严格语境。","在科普语境里常会提到：按系统发育分类（cladistics），鸟类属于兽脚类恐龙的后代，因此也被纳入Dinosauria。这与传统“恐龙=已灭绝的大型爬行动物”的直觉不同。"]}
{"word":"dinosauria","summary":{"en":"“Dinosauria” is the scientific name for the dinosaur group in biological classification.","zh":"“Dinosauria”是生物分类学中“恐龙类群”的学术名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific term for dinosaurs as a group (the clade that includes all dinosaurs, living and extinct, in biological classification).","zh":"（科学用语）“恐龙类/恐龙总目”，指生物分类学中恐龙这一大类群（包含所有恐龙的共同祖先及其后代，既包括已灭绝的恐龙，也包含现代仍存活的后代谱系）。"},"examples":[{"en":"In scientific writing, “Dinosauria” refers to dinosaurs as a biological group, not just big extinct reptiles.","zh":"在科学写作中，“Dinosauria”指恐龙这一生物类群，而不只是“体型很大的已灭绝爬行动物”。"},{"en":"Many birds are considered part of Dinosauria because they evolved from certain dinosaurs.","zh":"许多鸟类被认为属于Dinosauria的一部分，因为它们起源于某些恐龙。"}]}],"synonyms":["dinosaurs (common term)"],"phonetic":"/ˌdaɪnəˈsɔriə/","extraExplanation":["“Dinosauria”来自新拉丁语，由希腊语词根组成：deinos（可怕的、令人惊异的）+ sauros（蜥蜴）。不过现代古生物学强调：恐龙并不等同于“蜥蜴”，而是独立的一支爬行动物谱系。","在英语科普或日常语境里更常见的是“dinosaurs”。“Dinosauria”更偏学术（论文、分类学、展览说明牌）。"]}
{"word":"dinosaurian","summary":{"en":"“Dinosaurian” means connected with dinosaurs or (figuratively) very old-fashioned and outdated.","zh":"“dinosaurian”指与恐龙有关，或（比喻）非常古老、过时。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to dinosaurs, or resembling a dinosaur (often in a figurative sense: very old, outdated, or huge and clumsy).","zh":"与恐龙有关的；像恐龙的（也常用于比喻：非常古老、过时，或巨大而笨重）。"},"examples":[{"en":"Scientists studied dinosaurian fossils to learn how these animals moved.","zh":"科学家研究恐龙类的化石，以了解这些动物如何移动。"},{"en":"He joked that the company’s dinosaurian computer system belonged in a museum.","zh":"他开玩笑说公司的“恐龙级”电脑系统应该放进博物馆。"}]}],"synonyms":["dinosaur","prehistoric","antiquated","obsolete"],"phonetic":"/ˌdaɪnəˈsɔriən/","extraExplanation":["“dinosaurian”来自“dinosaur（恐龙）+ -ian（表示‘与……有关的’）”。在新闻或日常表达中，它常带一点幽默或批评的语气，用来形容技术、制度或观念“过时得像恐龙一样”。","与之相近的表达有：“prehistoric（史前的；过时的）”“antiquated（陈旧的）”“obsolete（淘汰的）”。不过“dinosaurian”更强调“像恐龙一样巨大/古老/笨重”的形象感。"]}
{"word":"dinosauric","summary":{"en":"An uncommon adjective meaning “dinosaur-like,” often used figuratively for something huge or outdated.","zh":"一个较少见的形容词，意为“像恐龙的”，常比喻“庞大或过时”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to, resembling, or characteristic of dinosaurs; dinosaur-like (often used figuratively to mean very old-fashioned, huge, or outdated).","zh":"与恐龙有关的；像恐龙的；（常作比喻）过时的、庞大的、老古董式的。"},"examples":[{"en":"The museum has a dinosauric skeleton that towers over visitors.","zh":"博物馆里有一具恐龙般巨大的骨架，高高耸立在游客上方。"},{"en":"He joked that the company’s dinosauric policies belonged in another century.","zh":"他开玩笑说公司的那些“恐龙式”政策该留在上个世纪。"}]}],"synonyms":["dinosaurian","dinosaur-like","prehistoric","antiquated","outdated"],"phonetic":"/ˌdaɪnəˈsɔrɪk/","extraExplanation":["“dinosauric”并不常见，更常用的是“dinosaurian”（更偏科学/分类学）或“dinosaur-like”（更口语直观）。在写作中，“dinosauric”常带有修辞色彩，用来强调“庞大、笨重、过时”。"]}
{"word":"dinosaurs","summary":{"en":"“Dinosaurs” is the plural of “dinosaur”: extinct ancient reptiles; informally, something or someone outdated.","zh":"“dinosaurs”是“dinosaur”的复数：指已灭绝的远古爬行动物；口语中也可指过时的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group of large reptiles that lived millions of years ago, before humans; now extinct","zh":"恐龙：一种生活在数千万年前、在人类出现之前的爬行动物类群，现已灭绝"},"examples":[{"en":"Dinosaurs lived during the Mesozoic Era.","zh":"恐龙生活在中生代。"},{"en":"Many children learn dinosaur names like T. rex and Triceratops.","zh":"很多孩子会学习像霸王龙和三角龙这样的恐龙名称。"}]},{"partOfSpeech":"n.","definition":{"en":"a person or thing that is old-fashioned, out of date, or no longer useful (informal)","zh":"（非正式）落伍的人/过时的事物：思想或方式陈旧，不合时代，或不再有用"},"examples":[{"en":"He jokes that he's a dinosaur because he still uses a flip phone.","zh":"他开玩笑说自己是“恐龙”，因为他还在用翻盖手机。"},{"en":"That software is a dinosaur—no one supports it anymore.","zh":"那个软件都成“恐龙”了——已经没人维护了。"}]}],"synonyms":["ancient reptile","prehistoric animal","relic","old-timer","dinosaur (informal: outdated thing/person)"],"phonetic":"/ˈdaɪnəˌsɔr/","extraExplanation":["“dinosaur”来自希腊语词根：deinos（可怕的、巨大的）+ sauros（蜥蜴）。最初是19世纪科学命名，用来描述这些史前爬行动物的化石。","日常口语里把某人称作“a dinosaur”，通常是轻松调侃，意思是“思想老派/跟不上时代”。是否冒犯取决于语气和关系。"]}
{"word":"dinothere","summary":{"en":"A dinothere is an extinct elephant-like mammal with downward-curving tusks.","zh":"dinothere 指一种已灭绝的、类似大象且獠牙向下弯曲的古代哺乳动物（恐兽）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large extinct mammal related to elephants, with downward-curving tusks (a member of the deinotheres, especially the genus Deinotherium)","zh":"恐兽（已灭绝的大型哺乳动物，与象类近缘，具有向下弯曲的獠牙；尤指恐兽属 Deinotherium）"},"examples":[{"en":"Fossils of a dinothere have been found in Africa and Eurasia.","zh":"在非洲和欧亚大陆都发现过恐兽的化石。"},{"en":"The museum display compared a dinothere’s tusks with a modern elephant’s.","zh":"博物馆的展品把恐兽的獠牙和现代大象的獠牙作了对比。"}]}],"synonyms":["deinothere","Deinotherium"],"phonetic":"/ˈdaɪnəˌθɪr/","extraExplanation":["“dinothere”常见于古生物学/科普语境，也可写作“deinothere”。词源来自希腊语：deinos（可怕的）+ thērion（野兽）。它们外形类似象，但獠牙从下颌向下弯曲，是其最显著特征之一。"]}
{"word":"Dinotheres","summary":{"en":"Dinotheres are extinct elephant relatives with distinctive downward-curving lower-jaw tusks.","zh":"Dinotheres（恐象）是已灭绝的大象近亲，特征是下颌象牙向下弯曲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large extinct prehistoric mammal related to elephants, known for its downward-curving tusks on the lower jaw (especially the genus *Deinotherium*)","zh":"一种已灭绝的史前大型哺乳动物，与大象近亲；其特点是下颌长有向下弯曲的长牙（尤指恐象属 *Deinotherium*）"},"examples":[{"en":"Dinotheres lived millions of years ago and are considered relatives of modern elephants.","zh":"恐象生活在数百万年前，被认为是现代大象的近亲。"},{"en":"The fossil shows a dinothere’s distinctive tusks curving downward from the lower jaw.","zh":"这块化石显示了恐象最具辨识度的特征：从下颌向下弯曲的象牙。"}]}],"synonyms":["deinothere","Deinotherium"],"phonetic":"/ˈdaɪnəˌθɪr/","extraExplanation":["“Dinotheres”通常是复数形式，更常见的单数拼写是“dinothere”。在学术语境里，你也可能看到“deinothere / Deinotherium（恐象属）”。","词源上，“dino-”来自希腊语，表示“可怕的、巨大的”；因此它常让人联想到“dinosaur（恐龙）”，但dinothere并不是爬行动物，而是哺乳动物（象类近亲）。"]}
{"word":"dinotheres","summary":{"en":"“Dinotheres” means extinct, elephant-like mammals (plural), especially Deinotherium, known for downward-curving lower-jaw tusks.","zh":"“Dinotheres”指已灭绝的类象巨型哺乳动物（复数），尤指恐象属（Deinotherium），特征是下颌向下弯曲的獠牙。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of dinothere: a large, extinct, elephant-like mammal (a kind of prehistoric proboscidean) with downward-curving tusks on its lower jaw.","zh":"dinothere 的复数：一种已灭绝的、类似大象的巨大哺乳动物（史前长鼻目的一类），其下颌长有向下弯曲的獠牙。"},"examples":[{"en":"Fossils of dinotheres have been found in parts of Europe, Africa, and Asia.","zh":"在欧洲、非洲和亚洲的一些地区发现过 dinotheres（恐象）的化石。"},{"en":"Unlike modern elephants, dinotheres had tusks that curved downward from the lower jaw.","zh":"与现代大象不同，dinotheres 的獠牙从下颌向下弯曲。"}]}],"synonyms":["deinotheres","Deinotherium (group)"],"phonetic":"/ˈdaɪnəˌθɪrz/","extraExplanation":["拼写提示：更常见的科学写法是 deino-（如 deinothere / Deinotherium），来自希腊语 deinos（“可怕的、巨大的”）+ thērion（“野兽”）。英语里也能见到 dino- 的变体拼法。","背景小知识：Deinotherium（恐象属）生活在中新世到上新世时期（大约两千多万年前到几百万年前），体型很大，但与现代象并非同一支系，属于较早分化的长鼻目类群。"]}
{"word":"dinotherian","summary":{"en":"A dinotherian is a prehistoric, elephant-like relative of elephants, especially one from the Deinotherium group, famous for downward-curving tusks.","zh":"dinotherian 指史前的“恐象类”动物，外形类似大象，是大象的远古近亲之一，以向下弯曲的长牙著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a prehistoric, elephant-like mammal related to elephants (especially one of the animals in the genus Deinotherium), known for its downward-curving tusks","zh":"一种史前、类似大象的哺乳动物，和大象有亲缘关系（尤指恐象属 Deinotherium 的动物），以向下弯曲的长牙为特征"},"examples":[{"en":"A dinotherian once roamed parts of Africa and Eurasia millions of years ago.","zh":"数百万年前，恐象类动物曾在非洲和欧亚部分地区漫游。"},{"en":"The museum’s dinotherian skeleton shows tusks that curve downward rather than upward like modern elephants.","zh":"博物馆里的恐象类骨架显示，它的象牙是向下弯曲的，而不是像现代大象那样向上。"}]}],"synonyms":["deinothere","Deinotherium (scientific name)"],"phonetic":"ˌdaɪnəˈθɪriən","extraExplanation":["“dinotherian”常用于古生物学语境，指“恐象类”（与恐象属 Deinotherium 相关的一类长鼻目动物）。它们并非现代大象的直接祖先，但属于较近的远古亲戚。","词源可追溯到希腊语：deinos（可怕的、巨大的）+ therion（野兽、动物）。在科普读物中也可能见到更常用的词“deinothere / Deinotherium”。"]}
{"word":"Dinotheriidae","summary":{"en":"Dinotheriidae: an extinct family of elephant-like mammals with downward-curving lower tusks.","zh":"Dinotheriidae：一种已灭绝的类象哺乳动物“科”，特征是下颌向下弯曲的长牙。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an extinct family of large, elephant-like mammals (proboscideans), known for having downward-curving tusks on the lower jaw; they lived mainly in Africa, Europe, and Asia during the Miocene and Pliocene epochs.","zh":"恐象科：一种已经灭绝的大型类象哺乳动物（长鼻目）科，典型特征是下颌长有向下弯曲的长牙；主要生活在非洲、欧洲和亚洲的中新世与上新世时期。"},"examples":[{"en":"Fossils of Dinotheriidae have been found in Miocene deposits across Europe and Africa.","zh":"在欧洲和非洲的中新世地层中发现了恐象科的化石。"},{"en":"Unlike modern elephants, many Dinotheriidae had tusks that curved downward from the lower jaw.","zh":"与现代大象不同，许多恐象科动物的长牙是从下颌向下弯曲的。"}]}],"synonyms":["Deinotheres","deinotheres"],"phonetic":"/ˌdaɪnəˈθɪriəˌdiː/","extraExplanation":["“Dinotheriidae”来自希腊语词根：deinos（可怕的、巨大的）+ thērion（野兽），再加上动物分类学中表示“科”的后缀 -idae。","恐象科常被拿来与“象科（Elephantidae）”对比：它们外形相似，但恐象科的典型长牙在下颌，而现代象的主要长牙在上颌。","在科普写作或博物馆展牌中，你也可能看到其代表属名“Deinotherium（恐象属）”。"]}
{"word":"dinotheriidae","summary":{"en":"Dinotheriidae: an extinct family of elephant-like mammals, famous for downward-curving lower-jaw tusks.","zh":"Dinotheriidae：已灭绝的“类象”哺乳动物家族，以“下颌向下弯的象牙”著名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of extinct, elephant-like mammals (proboscideans) known for having downward-curving tusks on the lower jaw; often spelled Deinotheriidae in modern scientific writing","zh":"（古生物）恐象科：一类已灭绝、类似大象的长鼻目哺乳动物，以“下颌向下弯曲的獠牙/象牙”为特征；现代科学文献中更常写作 Deinotheriidae（恐象科）"},"examples":[{"en":"Fossils of Dinotheriidae have been found in parts of Africa and Eurasia.","zh":"恐象科的化石在非洲和欧亚部分地区都有发现。"},{"en":"Unlike modern elephants, many Dinotheriidae species had tusks that curved downward from the lower jaw.","zh":"与现代大象不同，许多恐象科动物的象牙是从下颌向下弯曲的。"}]}],"synonyms":["Deinotheriidae","deinotheres"],"phonetic":"/ˌdaɪnoʊˈθɪriədiː/","extraExplanation":["“Dinotheriidae”常被视为“Deinotheriidae”的拼写变体；在学术文章与博物馆标注中，更常见的是 Deinotheriidae（源自希腊语，意为“可怕的兽”）。","恐象科属于长鼻目（Proboscidea），与现代象是远亲而非直系祖先。它们最有辨识度的特征是下颌长出、向下弯曲的象牙，可能用于拉拽树枝、剥树皮或挖掘食物等行为（具体功能仍有讨论）。"]}
{"word":"Dinotherium","summary":{"en":"Dinotherium is an extinct elephant-like mammal (Deinotherium) famous for downward-curving tusks on its lower jaw.","zh":"Dinotherium（常作 Deinotherium）指已灭绝的类象哺乳动物，以长在下颌、向下弯曲的獠牙著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An extinct, elephant-like prehistoric mammal (genus *Deinotherium*), known for its long body and distinctive downward-curving tusks attached to the lower jaw.","zh":"一种已灭绝的史前、类似大象的哺乳动物（*Deinotherium* 属），以体型巨大以及从下颌向下弯曲的獠牙而闻名。"},"examples":[{"en":"The museum display included a reconstruction of a dinotherium with its unusual lower-jaw tusks.","zh":"博物馆展览里有一具恐象的复原模型，展示了它下颌上奇特的獠牙。"},{"en":"Scientists study dinotherium fossils to understand how ancient relatives of elephants evolved.","zh":"科学家研究恐象化石，以了解远古大象近亲是如何演化的。"}]}],"synonyms":["Deinotherium","deinothere"],"phonetic":"/ˌdaɪˈnɑːθɪriəm/","extraExplanation":["“Dinotherium”更常见的学术拼写是“Deinotherium”。名称来自希腊语：deinos（可怕的、巨大的）+ thērion（野兽），常译作“恐象”。","它生活在中新世到上新世（大约几百万到一千多万年前）的欧亚和非洲地区；与现代大象同属长鼻目，但不是现代象的直接祖先分支。"]}
{"word":"dinotherium","summary":{"en":"Dinotherium is an extinct, elephant-related mammal with distinctive downward-curving lower tusks.","zh":"Dinotherium 是一种已灭绝的象类近亲哺乳动物，以向下弯曲的下颌獠牙为特征。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(also spelled Deinotherium) a large extinct mammal related to elephants, known for its downward-curving tusks on the lower jaw.","zh":"（亦拼作 Deinotherium）一种已灭绝的巨型哺乳动物，与大象有亲缘关系，特征是下颌长有向下弯曲的獠牙。"},"examples":[{"en":"Deinotherium (dinotherium) fossils have been found in parts of Africa and Europe.","zh":"在非洲和欧洲的一些地区发现了 Deinotherium（dinotherium）的化石。"},{"en":"Unlike modern elephants, dinotherium had tusks that curved downward from the lower jaw.","zh":"与现代大象不同，dinotherium 的獠牙是从下颌向下弯曲的。"}]}],"synonyms":["Deinotherium","prehistoric proboscidean","extinct elephant relative"],"phonetic":"/ˌdaɪnoʊˈθɪriəm/","extraExplanation":["“dinotherium”是较早或较少见的拼写形式，更常见的学术拼写是“Deinotherium”。词源来自希腊语：deinos（可怕的、巨大的）+ therion（野兽）。","它生活在中新世到更新世早期（大约几百万年前），外形像象类，但其下颌獠牙可能用于扒拉树枝、剥树皮或挖掘植物。"]}
{"word":"dins","summary":{"en":"“Dins” is usually the plural of “din,” meaning loud, continuous, unpleasant noise; it can also be the verb form meaning “makes a loud noise” or “repeats annoyingly.”","zh":"“dins”通常是“din”的复数，表示持续而刺耳的喧闹噪音；也可作动词形式，表示“发出喧闹声”或“反复唠叨到令人厌烦”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a loud, continuous, and unpleasant noise (often from many sources at once)","zh":"喧闹声；嘈杂刺耳的持续噪音（常由多种声音混在一起造成）"},"examples":[{"en":"The din of traffic made it hard to hear our conversation.","zh":"车流的嘈杂声让我们很难听清彼此说话。"},{"en":"In the cafeteria, there was a constant din of voices and clattering trays.","zh":"在食堂里，声音和餐盘碰撞声混在一起，吵个不停。"}]},{"partOfSpeech":"v.","definition":{"en":"to make a loud, continuous noise; to repeat something so often that it becomes annoying","zh":"发出持续的喧闹声；（反复）唠叨、不断灌输到令人厌烦"},"examples":[{"en":"Music was dinning from the apartment upstairs all night.","zh":"楼上的公寓整晚都在震耳欲聋地放音乐。"},{"en":"The safety rules were dinned into us at school.","zh":"学校把安全规则一遍遍灌输给我们。"}]}],"synonyms":["racket","clamor","noise","uproar","hubub"],"phonetic":"/dɪn/","extraExplanation":["“dins”最常见是名词复数：many loud noises（很多嘈杂声）。也可能是动词第三人称单数：He/She/It dins（他/她/它发出喧闹声；或反复唠叨）。","“din”常出现在描写城市或战场的文学语境里，用来强调“持续、压迫感强”的噪音氛围。"]}
{"word":"Dinsdale","summary":{"en":"Dinsdale is most commonly a surname, and it can also be a U.K. place name.","zh":"Dinsdale 最常见作姓氏，也可作英国地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname).","zh":"姓氏（家族姓）。"},"examples":[{"en":"Mr. Dinsdale will lead today’s meeting.","zh":"丁斯代尔先生将主持今天的会议。"},{"en":"She met Dr. Dinsdale at the conference.","zh":"她在会议上认识了丁斯代尔博士。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name (especially in the U.K.), often used for small villages or local areas.","zh":"地名（尤指英国），常指村庄或地方区域名称。"},"examples":[{"en":"They drove through Dinsdale on the way to Darlington.","zh":"他们在去达灵顿的路上开车经过丁斯代尔。"},{"en":"Dinsdale is mentioned on some local maps.","zh":"一些地方地图上会标注丁斯代尔。"}]}],"phonetic":"/ˈdɪnzdeɪl/","extraExplanation":["“Dinsdale”常见于英国的人名或地名。词尾 -dale 在英语地名里很常见，通常与“山谷”（dale）有关；整体多被理解为“某人的山谷/聚落”一类的地名结构。","作为专有名词（人名/地名）时，首字母通常大写：Dinsdale。发音会因地区与家庭习惯略有差异。"]}
{"word":"Dinse","summary":{"en":"“Dinse” is most commonly a surname; it may also appear as a misspelling of “dins” (loud noises).","zh":"“Dinse”最常见是姓氏；也可能是把“dins”（喧闹声）误拼出来的形式。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A surname (family name). It is not a common standard English vocabulary word, so its meaning depends on the person or family using it.","zh":"姓氏（家族名）。它不是常见的标准英语词汇，所以具体含义取决于使用该姓氏的个人或家族。"},"examples":[{"en":"Dr. Dinse will speak at the conference tomorrow.","zh":"Dinse 医生明天将在会议上发言。"},{"en":"My teacher’s last name is Dinse.","zh":"我老师的姓是 Dinse。"}]},{"partOfSpeech":"other","definition":{"en":"Often a misspelling of “dins” (plural of “din”), meaning loud, unpleasant noise.","zh":"常见于把 “dins”（“din”的复数）拼错；“din”指喧闹、刺耳的噪音。"},"examples":[{"en":"I couldn’t focus because of the constant dins from the street.","zh":"因为街上传来的持续噪音，我无法专注。"},{"en":"The city’s evening traffic creates a din; some people write it as “dinse” by mistake.","zh":"城市傍晚的车流会造成喧闹声；有些人会误写成“dinse”。"}]}],"synonyms":["(as a surname) no direct synonyms","(if meant as “dins”) noises","racket","clamor"],"phonetic":"/dɪns/","extraExplanation":["“Dinse”在英语里最常见的用途是作为人名（姓氏）。如果你是在阅读或听力里遇到它，通常需要结合上下文判断是人名、地名、品牌名等专有名词。","如果你本来想查的是某个常用单词，可能是拼写有误：常见相近词包括 din（喧闹声）、dense（稠密的/密集的）、since（自从/因为）。你可以告诉我句子原文，我可以帮你确认。"]}
{"word":"Dinsmore","summary":{"en":"Dinsmore is most commonly a surname, and it can also be a place name in some regions.","zh":"Dinsmore最常见是姓氏，也可能是某些地区的地名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a surname (family name), originally used in English-speaking countries","zh":"（姓氏）丁斯莫尔；常见于英语国家的家族姓"},"examples":[{"en":"Ms. Dinsmore will lead the meeting today.","zh":"丁斯莫尔女士今天将主持会议。"},{"en":"I met a writer named Dinsmore at the library.","zh":"我在图书馆遇到一位姓丁斯莫尔的作家。"}]},{"partOfSpeech":"other","definition":{"en":"a place name found in some English-speaking regions (often in the U.S.)","zh":"（地名）丁斯莫尔；在一些英语地区可见（常见于美国部分地名）"},"examples":[{"en":"They drove through Dinsmore on their way north.","zh":"他们北上途中开车经过丁斯莫尔。"},{"en":"Dinsmore is a small community on the map.","zh":"地图上丁斯莫尔是一个小社区。"}]}],"phonetic":"ˈdɪnzmɔr","extraExplanation":["“Dinsmore”多见于英美姓名体系中作为姓氏使用；在英文里遇到它时，通常不翻译含义，而是按音译为“丁斯莫尔”。","它也可能出现在地名中（例如某些小镇/社区名）。具体指人名还是地名，需要结合上下文（如前面是否有Mr./Ms.，或是否有drive to/through等地理语境）。"]}
{"word":"dinsome","summary":{"en":"Dinsome means “very noisy,” and it’s rare and mainly used in literary writing.","zh":"dinsome 意为“非常喧闹的”，较罕见，主要见于文学性描写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, literary) Very noisy; full of loud, unpleasant sound (a “din”).","zh":"（罕见/文学用语）喧闹的；吵嚷的；充满刺耳噪声的（充满“din”那种嘈杂声）。"},"examples":[{"en":"The street outside was dinsome with traffic and horns.","zh":"外面的街道被车流和喇叭声弄得十分喧闹。"},{"en":"After the game, the stadium became a dinsome sea of cheering.","zh":"比赛结束后，体育场变成一片喧闹的欢呼海洋。"}]}],"synonyms":["noisy","loud","clamorous","raucous","deafening"],"phonetic":"/ˈdɪn.səm/","extraExplanation":["“dinsome”由“din”（喧嚣、嘈杂）+ “-some”（表示“充满……的”）构成，意思就是“充满噪声的”。这个词在现代英语里很少见，更常用的是 noisy / loud / clamorous。","在阅读较旧的文学作品或较“文艺”的描写中可能会遇到它，用来营造一种让人不舒服的吵闹氛围。"]}
{"word":"dint","summary":{"en":"Dint means a strong blow or the mark it leaves; more commonly today, it appears in “by dint of,” meaning “through effort” or “by means of.”","zh":"dint 可指重击或其留下的凹痕；现代更常见于短语 by dint of，表示“凭借努力/通过……手段”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A forceful blow, especially one that leaves a mark or dent; the mark made by such a blow.","zh":"（尤指留下凹痕的）重击；重击留下的痕迹/凹痕。"},"examples":[{"en":"The ball left a dint in the soft metal.","zh":"球在较软的金属上留下了一个凹痕。"},{"en":"A heavy tool can make a dint in the wood.","zh":"沉重的工具会在木头上砸出痕迹。"}]},{"partOfSpeech":"n.","definition":{"en":"A way of achieving something through effort or determination (mainly used in the phrase “by dint of”).","zh":"（主要用于短语 by dint of）通过努力/毅力而达成某事的方式。"},"examples":[{"en":"By dint of hard work, she passed the exam.","zh":"凭借努力，她通过了考试。"},{"en":"They succeeded by dint of patience and practice.","zh":"他们靠耐心和练习取得了成功。"}]},{"partOfSpeech":"phrase","definition":{"en":"By means of; through the power of (used to show the method or reason something happens).","zh":"凭借；通过……（用于说明方式或原因）。"},"examples":[{"en":"He got the job by dint of his experience.","zh":"他凭借经验得到了那份工作。"},{"en":"By dint of careful planning, the trip stayed on budget.","zh":"靠周密规划，这次旅行控制住了预算。"}]}],"synonyms":["dent","mark","impression","impact","by means of","through","thanks to"],"phonetic":"/dɪnt/","extraExplanation":["“dint”在现代英语里单独使用较少，最常见的是固定搭配“by dint of…”，语气偏正式/书面，意思接近“thanks to / through / by means of（凭借……）”。","词源上与“击打造成凹痕”的含义相关：从“靠力量打出结果”引申为“靠努力/毅力取得结果”。"]}
{"word":"dinted","summary":{"en":"“Dinted” means “made a dent” or, figuratively, “slightly affected/weakened.”","zh":"“dinted”表示“弄出凹痕”，也可比喻为“受到影响/被稍微削弱”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To make a dent or hollow in something by hitting or pressing it.","zh":"（用撞击或挤压）把某物弄出凹痕、压出坑。"},"examples":[{"en":"The hailstones dinted the car’s hood.","zh":"冰雹把车的引擎盖砸出了凹痕。"},{"en":"He dropped the metal box and dinted the floor.","zh":"他把金属箱子掉在地上，把地板砸出了一个凹痕。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Figurative) To have an effect on something, often by weakening it slightly; commonly used as “dinted by.”","zh":"（比喻）对某事产生影响，常指稍微削弱或动摇；常见于“dinted by（被……影响/削弱）”。"},"examples":[{"en":"Her confidence wasn’t dinted by the criticism.","zh":"批评并没有动摇她的自信。"},{"en":"The team’s spirit was only slightly dinted by the loss.","zh":"这次失利只让球队士气受到一点影响。"}]}],"synonyms":["dented","indented","marred","affected","weakened"],"phonetic":"/ˈdɪntɪd/","extraExplanation":["“dinted”是动词dint的过去式/过去分词。在现代英语里，dint作为动词相对少见，更常见的是名词dint（凹痕）或短语“by dint of”（凭借、由于）。","“by dint of”表示“靠……（努力/手段）”，语气比because更强调付出与坚持：By dint of hard work, she succeeded.（她凭借努力获得成功。）"]}
{"word":"dinting","summary":{"en":"“Dinting” is usually a misspelling of “denting,” meaning making small dents or damage on a surface.","zh":"“dinting”通常是“denting”的误拼，意思是让表面出现小凹痕或轻微损伤。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Likely a misspelling) The present participle of “dent”: making a small hollow or damage in a surface (often metal).","zh":"（很可能是拼写错误）“dent”的现在分词：使表面（常见于金属）出现小凹痕或轻微损伤。"},"examples":[{"en":"The hail is denting the car’s hood.","zh":"冰雹正在把汽车引擎盖砸出凹痕。"},{"en":"Be careful—dropping the pan can dent the floor.","zh":"小心——把锅掉下去可能会把地板砸出凹痕。"}]},{"partOfSpeech":"n.","definition":{"en":"A process or instance of making dents; repeated small impacts that leave marks.","zh":"产生凹痕的过程或一次情况；反复的小撞击留下的痕迹。"},"examples":[{"en":"There was noticeable denting along the door panel.","zh":"门板上有明显的凹陷痕迹。"}]}],"synonyms":["denting","denting damage","dimpling","marking","damaging"],"phonetic":"ˈdɛntɪŋ","extraExplanation":["“dinting”本身不是常见标准拼写；更常见的是“denting”。如果你想表达“凭借……、由于……”的意思，可能是在找短语“by dint of”（如：By dint of hard work, she succeeded. 凭借努力她成功了）。"]}
{"word":"dintless","summary":{"en":"Dauntless means fearless and not easily discouraged.","zh":"dauntless 指“无畏的、坚定不屈的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Fearless and determined; not easily discouraged by danger or difficulty.","zh":"无畏的；坚定的；不轻易被危险或困难吓倒的。"},"examples":[{"en":"The firefighters were dauntless as they entered the burning building.","zh":"消防员们无畏地走进着火的建筑。"},{"en":"She stayed dauntless during the interview, even when the questions got tough.","zh":"即使问题变得棘手，她在面试中依然镇定无畏。"}]}],"synonyms":["fearless","brave","bold","undaunted","intrepid"],"phonetic":"/ˈdɔnt.ləs/","extraExplanation":["你输入的“dintless”更常见是拼写错误；你可能想写的是“dauntless”。“dauntless”来自动词“daunt”（使胆怯、使气馁）+ “-less”（没有……的），字面意思是“不会被吓倒的”。","常见搭配：dauntless spirit（无畏精神）、dauntless leader（勇敢的领袖）。在文学或报道中常用来形容在危险/压力下仍坚持行动的人。"]}
{"word":"dints","summary":{"en":"“Dint(s)” most often means a small dent, and it also appears in the formal phrase “by dint of,” meaning “by means of / through.”","zh":"“dint(s)”常指“小凹痕”；也常用于较正式的短语“by dint of”，表示“凭借/通过”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small dent or hollow made by a hit or pressure (often in metal or a hard surface)","zh":"（硬物表面因撞击或挤压造成的）小凹痕、凹陷"},"examples":[{"en":"There’s a dint in the car door from the shopping cart.","zh":"车门上有个被购物车撞出来的凹痕。"},{"en":"He hammered the sheet of metal and left several dints.","zh":"他敲打金属板，留下了几个凹痕。"}]},{"partOfSpeech":"n.","definition":{"en":"an effect or reduction (often used with “make” in negative sentences: “not make a dint”)","zh":"影响；削减（常用于否定表达：not make a dint，表示“没起作用/没造成影响”）"},"examples":[{"en":"All that complaining didn’t make a dint in the policy.","zh":"那些抱怨对政策一点影响也没有。"},{"en":"A small discount won’t make much of a dint in the total cost.","zh":"一点点折扣对总成本影响不大。"}]},{"partOfSpeech":"phrase","definition":{"en":"by means of; through the power of (used in the phrase “by dint of”)","zh":"凭借；通过（用于短语“by dint of”）"},"examples":[{"en":"By dint of hard work, she passed the exam.","zh":"凭借努力学习，她通过了考试。"},{"en":"They succeeded by dint of patience and teamwork.","zh":"他们凭借耐心与团队合作取得了成功。"}]}],"synonyms":["dent","impression","mark","impact","effect"],"phonetic":"/dɪnt/","extraExplanation":["“dints”通常是名词“dint”的复数形式。实际使用中，“dint”更常见于固定搭配“by dint of + 名词/动名词”，语气偏正式，写作里更常见；口语里也可以用“through / because of / thanks to”来替换。","“make a dint (in)”常带有“几乎没影响”的含义，尤其是否定形式“didn’t make a dint”。"]}
{"word":"Dinuba","summary":{"en":"Dinuba is a city in California’s Central Valley in the United States.","zh":"Dinuba 是美国加利福尼亚州中央谷地的一座城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a city in Tulare County, in California’s Central Valley (USA).","zh":"美国加利福尼亚州图莱里县的一座城市，位于加州中央谷地。"},"examples":[{"en":"Dinuba is in the Central Valley, an area known for farming.","zh":"Dinuba 位于中央谷地，这一地区以农业闻名。"},{"en":"She grew up in Dinuba, California, before moving to Los Angeles.","zh":"她在加州 Dinuba 长大，后来搬到洛杉矶。"}]}],"synonyms":["Dinuba, California"],"phonetic":"/dɪˈnuːbə/","extraExplanation":["Dinuba 是专有名词（地名），写作首字母大写。谈到具体地点时，英语里常说 “in Dinuba” 或 “in Dinuba, California”。","它位于加州中央谷地（Central Valley）的农业区，周边以葡萄、柑橘等作物和加工产业较常见。"]}
{"word":"dinucleotide","summary":{"en":"A dinucleotide is a two-nucleotide segment in DNA or RNA.","zh":"dinucleotide 指 DNA 或 RNA 中由两个核苷酸组成的片段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A unit of DNA or RNA made of two nucleotides linked together (by a phosphodiester bond).","zh":"由两个核苷酸连接而成的 DNA 或 RNA 片段（通常由磷酸二酯键连接）。"},"examples":[{"en":"The dinucleotide CpG is important in gene regulation.","zh":"二核苷酸 CpG 在基因调控中很重要。"},{"en":"Scientists analyzed dinucleotide frequencies to compare viral genomes.","zh":"科学家分析二核苷酸的出现频率来比较病毒基因组。"}]}],"synonyms":["two-nucleotide sequence","2-mer"],"phonetic":"/daɪˈnuː.kli.ə.taɪd/","extraExplanation":["“di-”表示“二、两个”，与“nucleotide（核苷酸）”组合成“dinucleotide（二核苷酸）”。常见例子包括 DNA 中的“CpG”（C 后面紧跟 G），以及 RNA/DNA 里的“AA、AT、GC”等相邻两碱基组合。","在分子生物学中，人们常研究“dinucleotide frequency（双核苷酸频率）”来了解基因组的组成偏好、突变模式或物种/病毒的演化特征。","注意：dinucleotide 不是“碱基对（base pair）”。碱基对指的是双链 DNA 上互补配对的两个碱基；dinucleotide 指的是同一条链上相邻连接的两个核苷酸。"]}
{"word":"dinumeration","summary":{"en":"Dinumeration is a rare word meaning the act of counting or listing items one by one (enumeration).","zh":"dinumeration 是个很少见的词，意思是逐一计数或逐条列举（enumeration）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/obsolete) The act of counting or listing items one by one; enumeration.","zh":"（罕见/过时）逐一计数或把事物一项项列出来；列举。"},"examples":[{"en":"The report included a dinumeration of all the damaged buildings.","zh":"报告中逐一列出了所有受损的建筑。"},{"en":"Please give a clear dinumeration of the steps you followed.","zh":"请清楚地逐条列出你遵循的步骤。"}]}],"synonyms":["enumeration","listing","counting","itemization"],"phonetic":"/dɪˌnuːməˈreɪʃən/","extraExplanation":["“dinumeration”在现代英语中几乎不使用，常被认为是“denumeration”或更常见的“enumeration”的变体/误拼。日常写作与考试中一般用“enumeration”（列举、逐项说明）。","词根提示：与拉丁语“numer-”（数字、计数）有关；因此含义与“数数、列举”相关。"]}
{"word":"dinus","summary":{"en":"“Dinus” isn’t a standard English word; it may be a name or a misspelling of “dinosaur.”","zh":"“dinus” 不是标准英语词，可能是人名/品牌名，或是 “dinosaur（恐龙）” 的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “dinosaur,” or a proper name (e.g., a person’s name or a brand).","zh":"不是标准英语单词。最可能是 “dinosaur（恐龙）” 的拼写错误，或是专有名词（如人名、品牌名）。"},"examples":[{"en":"Did you mean “dinosaur”?","zh":"你是不是想写 “dinosaur（恐龙）”？"},{"en":"“Dinus” could be a name, so the meaning depends on context.","zh":"“Dinus” 也可能是名字，具体意思要看上下文。"}]},{"partOfSpeech":"n.","definition":{"en":"Possible intended word: “dinosaur” — a large reptile that lived millions of years ago; in everyday speech, something or someone seen as old-fashioned.","zh":"可能想表达的词： “dinosaur（恐龙）”——数百万年前生活的大型爬行动物；口语中也可指“老古董/过时的人或事物”。"},"examples":[{"en":"My little brother loves dinosaurs.","zh":"我弟弟很喜欢恐龙。"},{"en":"This computer is a dinosaur—it’s so slow.","zh":"这台电脑是老古董——太慢了。"}]}],"synonyms":["dinosaur","old-timer","relic"],"phonetic":"/ˈdaɪnəˌsɔr/","extraExplanation":["“dinosaur” 常用比喻义来形容“过时的东西/思想或不愿改变的人”。在工作或科技语境里很常见，比如 old systems、old-fashioned rules。","如果你指的是某个人名/品牌名 “Dinus”，请给我一句完整句子或说明领域（人名、游戏、产品等），我可以帮你确认含义与用法。"]}
{"word":"Dinwiddie","summary":{"en":"Dinwiddie is mainly a surname and a U.S. place name; it can also refer to the colonial official Robert Dinwiddie.","zh":"Dinwiddie 主要是一个姓氏和美国地名；也可指殖民时期官员罗伯特·丁威迪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname) of Scottish origin; also used as a place name in the U.S. (for example, Dinwiddie County in Virginia).","zh":"一个苏格兰起源的姓氏；也用作美国的一些地名（例如弗吉尼亚州的丁威迪县 Dinwiddie County）。"},"examples":[{"en":"Her last name is Dinwiddie, and her family has lived in Virginia for generations.","zh":"她的姓是 Dinwiddie，她家在弗吉尼亚州生活了好几代。"},{"en":"We drove through Dinwiddie County on the way to Richmond.","zh":"我们去里士满的路上开车经过了丁威迪县（Dinwiddie County）。"}]},{"partOfSpeech":"n.","definition":{"en":"Robert Dinwiddie (1693–1770), a British colonial official who served as lieutenant governor of Virginia; often mentioned in early American colonial history.","zh":"罗伯特·丁威迪（Robert Dinwiddie，1693–1770），英国殖民官员，曾任弗吉尼亚殖民地副总督；常见于美国早期殖民史相关语境。"},"examples":[{"en":"In some history lessons, Dinwiddie appears in discussions of colonial Virginia politics.","zh":"在一些历史课程中，Dinwiddie 会出现在关于弗吉尼亚殖民地政治的讨论里。"},{"en":"The museum exhibit mentioned Governor Dinwiddie and the growing tensions on the frontier.","zh":"博物馆展览提到了丁威迪总督以及边境地区日益加剧的紧张局势。"}]}],"phonetic":"/dɪnˈwɪdi/","extraExplanation":["发音提示：Dinwiddie 常被读作三音节，重音通常在第二音节（-WID-）。","文化/历史背景：Dinwiddie 在美国史里常与法印战争前后（French and Indian War）的殖民地矛盾、边境土地与军费问题等话题一起出现；但在日常英语中更多只是一个姓或地名。","拼写提醒：中间的 “widd” 容易写错成 *wid* 或 *widdy*；标准拼写为 Dinwiddie。"]}
