{"word":"diobol","summary":{"en":"“diobol” isn’t standard English; it’s likely a misspelling of “diabolical” or a word from the “diabol-” (devil/evil) root.","zh":"“diobol”不是标准英语词；多半是“diabolical”或与“diabol-”（魔鬼/邪恶）词根相关词的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “diabolical” (very evil or cruel) or a related “diabol-” form (connected to the devil).","zh":"不是标准英语单词。很可能是“diabolical”（极其邪恶/残忍）的拼写错误，或与“diabol-”（与魔鬼相关）词根有关的写法。"},"examples":[{"en":"I couldn’t find “diobol” in an English dictionary—did you mean “diabolical”?","zh":"我在英语词典里找不到“diobol”——你是不是想写“diabolical”？"},{"en":"The villain’s diabolical plan shocked everyone.","zh":"反派那邪恶的计划让所有人都震惊了。"}]}],"synonyms":["diabolical","evil","wicked","devilish"],"phonetic":"ˌdaɪəˈbɑlɪkəl","extraExplanation":["“diabol-”词根来自希腊语 *diabolos*（“诽谤者/挑拨者”），后来进入拉丁语与英语，常与“魔鬼、邪恶”联想相关。常见词包括 **diabolical**（邪恶的）、**diabolism**（魔鬼崇拜/邪恶倾向，较少见）。","如果你能告诉我“diobol”出现的句子或语境（比如小说、游戏名、人名/品牌名），我可以更准确判断它到底指什么或应如何拼写。"]}
{"word":"diobola","summary":{"en":"“Diobola” is likely a misspelling of “diabolo,” a spinning juggling toy also called a Chinese yo-yo.","zh":"“diobola”很可能是“diabolo”的拼写错误；diabolo 指一种会旋转的杂耍玩具，也常被称为“Chinese yo-yo（扯铃）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a toy (also a juggling prop) made of two cups joined at the rim, spun and tossed on a string between two handsticks; sometimes called a “Chinese yo-yo.”","zh":"一种玩具/杂耍道具，由两个杯状部分在边缘连接而成，用两根棒和中间的绳子带动旋转并抛接；常被称为“Chinese yo-yo（中国扯铃）”。"},"examples":[{"en":"She practiced diabolo tricks in the park after school.","zh":"她放学后在公园练习扯铃（diabolo）花式。"},{"en":"The performer kept the diabolo spinning smoothly on the string.","zh":"表演者让扯铃在绳子上平稳地持续旋转。"}]}],"synonyms":["Chinese yo-yo","juggling diabolo","spinning toy"],"phonetic":"/ˈdiːəˌboʊloʊ/","extraExplanation":["“diobola”不是常见的英语单词拼写。你可能想写的是 **diabolo**（杂耍用的扯铃/“Chinese yo-yo”）。","**diabolo** 这个词在英语中多用于马戏、杂耍、技巧运动语境；中文里常对应“扯铃”。","小提示：不要和 **diabola**（数学里的“抛物线/双曲线类曲线”的复数/相关形式）混淆；日常英语里更常见的是 **diabolo**（玩具/道具）。"]}
{"word":"diobolon","summary":{"en":"Diobolon: an ancient Greek coin (or value) equal to two obols.","zh":"Diobolon：古希腊面值为两奥波尔的硬币（或对应的计价单位）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an ancient Greek coin worth two obols (a small silver denomination); also used as a unit of value equal to two obols","zh":"古希腊的一种硬币，面值为“两奥波尔”（obol，为小面额银币）；也可指等于两奥波尔的计价单位"},"examples":[{"en":"The excavation report mentions a diobolon found near the marketplace.","zh":"考古报告提到在集市附近发现了一枚 diobolon（两奥波尔硬币）。"},{"en":"In some city-states, a diobolon could pay for a modest daily expense.","zh":"在一些城邦里，一枚 diobolon 可能够支付一笔不大的日常开销。"}]}],"synonyms":["diobol","two-obol coin"],"phonetic":"/daɪˈɑbəlɑn/","extraExplanation":["“diobolon”来自古希腊语，字面意思是“两个 obol”。obol（奥波尔）是古希腊常见的小面额货币与计价单位之一；不同城邦的重量标准可能略有差异，因此它的“实际购买力/含银量”会随时代与地区变化。","英语里更常见的形式是 **diobol**（两奥波尔硬币）；“diobolon”更像是古典语境下（源自希腊语词形）的写法，通常出现在钱币学（numismatics）、古典学或考古文献中。"]}
{"word":"diobolons","summary":{"en":"Diobolons are ancient Greek coins worth two obols.","zh":"Diobolons 指古希腊面值为“两奥波尔”的硬币。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ancient Greece) a coin worth two obols; a small silver coin used in several Greek city-states.","zh":"（古希腊）面值为“两奥波尔”（two obols）的硬币；古希腊一些城邦流通的小面额银币。"},"examples":[{"en":"Archaeologists found several diobolons in the marketplace ruins.","zh":"考古学家在集市遗址中发现了几枚 diobolons（两奥波尔硬币）。"},{"en":"A diobolon was a modest sum, but it could still buy everyday items.","zh":"一枚 diobolon 的金额不大，但仍能买到一些日常用品。"}]}],"synonyms":["two-obol coin","diobola (plural variant)"],"phonetic":"/daɪˈɑːbəˌlɑːn/","extraExplanation":["“diobolons”通常被视为 diobolon 的复数形式（也常见复数 diobola）。词源来自希腊语：di-（二）+ obolos（奥波尔，一种小面额单位/硬币）。","古希腊的货币体系在不同城邦之间略有差异，但“obol/obolos（奥波尔）”和“drachma（德拉克马）”是常见的计价单位之一；diobolon 就是“两奥波尔”。","如果你是在读文献或看博物馆标签，拼写也可能出现 dioboloi / diobols 等变体；具体用法取决于作者采用的拉丁化规则。"]}
{"word":"diobols","summary":{"en":"Diobol (plural: diobols) is an ancient Greek coin worth two obols.","zh":"Diobol（复数 diobols）是古希腊的一种钱币/面额，价值等于两个 obol（奥波尔）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small ancient Greek coin worth two obols (an old Greek unit of money).","zh":"（古希腊）“两奥波尔”银币/钱币单位；价值等于两个 obol（奥波尔）。"},"examples":[{"en":"The museum displayed a diobol from classical Athens.","zh":"博物馆展出了一枚来自古典时期雅典的 diobol（两奥波尔币）。"},{"en":"Historians use coinage like the diobol to study trade and daily life in ancient Greece.","zh":"历史学家会用像 diobol 这样的货币来研究古希腊的贸易与日常生活。"}]}],"synonyms":["coin","obol"],"phonetic":"/ˈdaɪoʊˌbɑːl/","extraExplanation":["你输入的 **diobols** 多半是 **diobol** 的复数形式（表示“多个两奥波尔币”）。","词源上可理解为 **di-**（“二、两个”）+ **obol**（古希腊小额货币单位“奥波尔”）。在阅读古希腊历史、经济或考古资料时更常见。"]}
{"word":"dioc","summary":{"en":"“dioc.” is an abbreviation meaning “diocese,” a church district governed by a bishop.","zh":"“dioc.”是“diocese（教区）”的缩写，指由主教管理的教会辖区。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) short for “diocese,” meaning an administrative district of a Christian church (especially the Roman Catholic, Anglican, or Orthodox Church) led by a bishop.","zh":"（缩写）“diocese”的缩写，指基督教会（尤指天主教、圣公会、东正教）由主教管理的“教区/主教辖区”。"},"examples":[{"en":"He was appointed bishop of the dioc. of Boston.","zh":"他被任命为波士顿教区的主教。"},{"en":"The report lists each dioc. and its parishes.","zh":"报告列出了每个教区及其堂区。"}]}],"synonyms":["diocese"],"phonetic":"/ˈdaɪəsəs/","extraExplanation":["“dioc.”多见于教会公文、名录、碑文或学术写作中的缩略形式；日常英语里更常直接写全称“diocese”。","词源上，“diocese”来自希腊语词根，原意与“管理/管辖的区域”有关，后来成为教会行政区划的固定用语。"]}
{"word":"diocesan","summary":{"en":"Diocesan means ‘connected with a diocese,’ the area under a bishop’s authority in some Christian churches.","zh":"diocesan 指“与教区有关的”，即由主教管辖的基督教行政区域相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a diocese (a district or area governed by a bishop in some Christian churches, especially the Roman Catholic, Anglican/Episcopal, and Orthodox traditions).","zh":"与教区有关的；教区的（教区是由主教管理的基督教行政区域，常见于天主教、圣公会/圣公宗、东正教等）。"},"examples":[{"en":"The diocesan office helps parishes with training and finances.","zh":"教区办公室帮助各堂区进行培训和财务管理。"},{"en":"She works for the diocesan newspaper.","zh":"她在教区报社工作。"},{"en":"A diocesan bishop visited several churches in the region.","zh":"一位教区主教走访了该地区的几所教堂。"}]}],"synonyms":["diocesan (church-related)","episcopal (in some contexts)","church","ecclesiastical"],"phonetic":"/daɪˈɑsɪsən/","extraExplanation":["“Diocesan”常用于教会组织与行政语境：如 diocesan bishop（教区主教）、diocesan office（教区办公室）、diocesan synod（教区会议）。","词根来自“diocese（教区）”，源于希腊语，历史上指“管理辖区”。在英语里它多用于正式、宗教或新闻报道的场合。","学习提示：不要把 diocesan（教区的）和 parish（堂区/教区内更小的单位）混淆；通常 diocese 比 parish 更大。"]}
{"word":"diocesans","summary":{"en":"Diocesans are people from a diocese; diocesan/diocesans can also describe things related to a diocese.","zh":"diocesans 指“教区成员”（复数）；diocesan/diocesans 也可作形容词，表示“教区的、与教区有关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) People who belong to a diocese (a church district), especially in the Roman Catholic, Anglican, or other Christian traditions.","zh":"（复数）教区成员；属于某个教区的人（尤其指天主教、圣公会等基督宗派中的教区信徒/成员）。"},"examples":[{"en":"The bishop met with diocesans from towns across the region.","zh":"主教与来自该地区各城镇的教区成员会面。"},{"en":"Diocesans gathered for a service at the cathedral.","zh":"教区成员聚集在主教座堂参加礼拜。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to a diocese or its bishop and administration.","zh":"教区的；与教区或其主教及行政管理有关的。"},"examples":[{"en":"The diocesans offices announced new guidelines for parishes.","zh":"教区办公室发布了新的堂区指导方针。"},{"en":"She works on diocesans programs that support local churches.","zh":"她参与教区层面的项目，为本地教会提供支持。"}]}],"synonyms":["members of a diocese","parishioners (often local, not exactly the same)","church members"],"phonetic":"/daɪˈɑsəsən/","extraExplanation":["“diocese”指由主教管辖的教会行政区域，中文常译为“教区”。因此“diocesans”既可指“教区的人”（名词复数），也常见于修饰机构/事务的用法（形容词），例如 diocesans offices / diocesans programs。","词形提示：单数是 diocesan；复数名词是 diocesans。作为形容词时通常不变复数，但在某些写法中也会见到 diocesans 作定语（多见于机构名称或非严格用法）。"]}
{"word":"diocese","summary":{"en":"A diocese is a church administrative area led by a bishop.","zh":"diocese 指由主教管理的教会行政区域（教区）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A district or area that is managed by a bishop in a Christian church (especially the Roman Catholic, Anglican, and Orthodox traditions).","zh":"（基督教会的）教区；由主教负责管理的地区（尤指天主教、圣公会、东正教等传统）。"},"examples":[{"en":"She works for the Catholic diocese in Chicago.","zh":"她在芝加哥的天主教教区工作。"},{"en":"The bishop visited several parishes across the diocese.","zh":"主教走访了整个教区内的几个堂区。"}]}],"synonyms":["bishopric","episcopal district"],"phonetic":"/ˈdaɪ.ə.sɪs/","extraExplanation":["词源上来自希腊语 *dioikēsis*，原意与“管理、行政区”有关，后来在基督宗教语境中固定指由主教管辖的教会行政区域。","区分常见相关词：*diocese*（教区，主教管辖的范围） vs. *parish*（堂区/教堂辖区，通常更小，由神父/牧师服务）；一个教区往往包含多个堂区。"]}
{"word":"dioceses","summary":{"en":"“Dioceses” is the plural form of “diocese,” meaning church districts governed by a bishop.","zh":"“Dioceses”是“diocese”的复数，指由主教管理的教会辖区（教区）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of diocese) a district or area under the care of a bishop in a Christian church, especially the Roman Catholic, Anglican, or Orthodox traditions.","zh":"（diocese 的复数）教区：由主教负责管理的基督宗教地区或行政区划，尤指天主教、圣公会或东正教传统中的教会辖区。"},"examples":[{"en":"The bishop visited several dioceses during the conference.","zh":"主教在会议期间走访了几个教区。"},{"en":"Many dioceses run schools, charities, and community programs.","zh":"许多教区会运营学校、慈善机构和社区项目。"},{"en":"The report compares church membership across different dioceses.","zh":"这份报告比较了不同教区的教会成员人数。"}]}],"synonyms":["bishoprics","church districts","ecclesiastical districts"],"phonetic":"/ˈdaɪəsiz/","extraExplanation":["“diocese”来源于拉丁语和希腊语，原意与“行政区划/管辖区”有关，后来被基督宗教沿用为教会的治理单位。","用法提示：英语里常说“a diocese”（一个教区）、“the Diocese of + 地名”（某地教区，如 the Diocese of Boston）。复数是“dioceses”，拼写变化为 -ses。"]}
{"word":"diocesian","summary":{"en":"Diocesan (often misspelled “diocesian”) means related to a diocese or someone belonging to it.","zh":"Diocesan（常被写成diocesian）指“与教区有关的”，或“属于某教区的人（尤指主教/官员）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(also spelled “diocesan”) related to a diocese (an area governed by a bishop in some Christian churches).","zh":"（也常拼作“diocesan”）与“教区”（由主教管理的教会行政区域）有关的。"},"examples":[{"en":"She works at the diocesan office in Boston.","zh":"她在波士顿的教区办公室工作。"},{"en":"The diocesan bishop will lead the ceremony.","zh":"教区主教将主持这场仪式。"}]},{"partOfSpeech":"n.","definition":{"en":"A person (especially a bishop) connected with or belonging to a diocese.","zh":"教区成员；（尤指）教区主教或与某教区有关的人。"},"examples":[{"en":"Several diocesan leaders attended the meeting.","zh":"几位教区领导出席了会议。"},{"en":"He was appointed as a diocesan official.","zh":"他被任命为教区官员。"}]}],"synonyms":["episcopal","church","clerical"],"phonetic":"/daɪˈɑːsɪsən/","extraExplanation":["“diocesan”是更常见、标准的拼写；“diocesian”偶尔出现，多被视为拼写变体或误拼。","“diocese（教区）”常见于天主教、圣公会等传统教会的组织结构中；日常语境里多用于正式/宗教行政文本（如diocesan office, diocesan report）。"]}
{"word":"Diocletian","summary":{"en":"Diocletian was a Roman emperor famous for major reforms and the Tetrarchy.","zh":"戴克里先是罗马皇帝，以重大改革与“四帝共治”而闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Roman emperor (ruled AD 284–305) known for stabilizing the empire through major reforms and for creating the Tetrarchy (rule by four).","zh":"戴克里先（罗马皇帝，公元284—305年在位），以推行重大改革、以“四帝共治”（Tetrarchy）稳定帝国而著名。"},"examples":[{"en":"Diocletian reorganized the Roman Empire to make it easier to govern.","zh":"戴克里先重组了罗马帝国的行政体系，使统治更容易。"},{"en":"In history class, we learned about Diocletian and the Tetrarchy.","zh":"在历史课上，我们学习了戴克里先和“四帝共治”。"}]}],"phonetic":"ˌdaɪəˈkliːʃən","extraExplanation":["戴克里先常被视为“晚期罗马帝国”的关键人物：他加强了官僚体系与税收制度，并把帝国更明确地分为东西两大治理区域，以提高行政效率。","“四帝共治”（Tetrarchy）指两位“奥古斯都”（Augustus，高级皇帝）与两位“凯撒”（Caesar，副皇帝/继承人）共同分担统治与防务压力，是他为应对内乱与边境危机而设立的权力结构。","他在位后期发生了著名的“戴克里先迫害”（对基督徒的迫害），这是罗马帝国规模最大、影响最深的一次官方迫害之一；这也常出现在西方历史与宗教史的叙述中。"]}
{"word":"diocletian","summary":{"en":"Diocletian was a Roman emperor famous for major reforms and the Tetrarchy.","zh":"戴克里先是罗马皇帝，以重大改革与“四帝共治”制度闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Diocletian: a Roman emperor (ruled AD 284–305) who reorganized the Empire, strengthened the army and bureaucracy, and is known for the Tetrarchy (rule by four emperors).","zh":"戴克里先：罗马帝国皇帝（公元284–305年在位），以重组帝国、加强军队与官僚体系，以及建立“四帝共治”（四人分治）制度而著名。"},"examples":[{"en":"Diocletian created the Tetrarchy to make governing the huge Roman Empire easier.","zh":"戴克里先建立“四帝共治”，让治理庞大的罗马帝国更容易。"},{"en":"Many history books mention Diocletian when discussing reforms in the late Roman Empire.","zh":"许多历史书在讨论晚期罗马帝国改革时都会提到戴克里先。"}]}],"synonyms":["Emperor Diocletian","Gaius Aurelius Valerius Diocletianus"],"phonetic":"/ˌdaɪ.əˈkliː.ʃən/","extraExplanation":["“Diocletian”是人名（专有名词），一般不需要冠词；在历史语境中常直接说“Diocletian did…”（戴克里先做了……）。","他在位后期曾发起对基督徒的严厉迫害，史学上常称为“the Diocletianic Persecution”（戴克里先迫害）。","与他相关的文化/建筑常见搭配：Diocletian’s Palace（戴克里先宫殿，位于今克罗地亚斯普利特），在旅游与艺术史写作里很常出现。"]}
{"word":"diocoel","summary":{"en":"Diocoel means a two-cavity coelom—having two coelomic sacs (often discussed in embryology/zoology).","zh":"Diocoel 指“双体腔”——具有两个体腔囊（多用于胚胎学/动物学语境）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(zoology/embryology) A condition or stage in which the body has two coelomic cavities (paired coelomic sacs).","zh":"（动物学/胚胎学）指体内具有两个体腔（成对的体腔囊）的状态或阶段。"},"examples":[{"en":"In some early embryos, the diocoel stage shows two separate coelomic sacs on each side of the body.","zh":"在一些早期胚胎中，diocoel 阶段会在身体两侧出现两个分开的体腔囊。"},{"en":"Researchers compared larvae with a diocoel to those with a more complex, divided coelom.","zh":"研究人员将具有 diocoel（两个体腔）的幼体与体腔分隔更复杂的幼体进行了比较。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having two coelomic cavities; relating to a two-cavity coelom.","zh":"具有两个体腔的；与“双体腔”相关的。"},"examples":[{"en":"The paper describes a diocoel arrangement in the developing mesoderm.","zh":"论文描述了在发育中的中胚层里一种 diocoel（双体腔）式的排列。"}]}],"synonyms":["paired coelomic sacs","two-cavity coelom","two coeloms"],"phonetic":"/ˈdaɪoʊˌsiːl/","extraExplanation":["词源提示：dio- 表示“二/两个”，-coel 来自 coelom（体腔）。该词多见于动物学、胚胎学或无脊椎动物发育的学术语境，日常英语中很少使用。","使用注意：不同教材/论文可能更常写成 two coelomic sacs、paired coeloms，或用更常见的相关词（如 enterocoelous、schizocoelous）来描述体腔形成方式；diocoel 更强调“数量为两个”的体腔单元。"]}
{"word":"dioctahedral","summary":{"en":"Dioctahedral describes a clay/layered silicate structure where two of three octahedral sites are filled.","zh":"dioctahedral 指黏土/层状硅酸盐结构中三个八面体位点有两个被占据、一个空缺的类型。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a layered silicate or clay mineral) having two of the three possible octahedral sites in each unit filled by cations (often Al³⁺), leaving one site vacant.","zh":"（指层状硅酸盐或黏土矿物）在每个结构单元中三个可能的八面体位置里有两个被阳离子（常见为Al³⁺）占据，另一个位置为空缺。"},"examples":[{"en":"Kaolinite is a dioctahedral clay mineral commonly found in soils.","zh":"高岭石是一种常见于土壤中的二八面体黏土矿物。"},{"en":"In many textbooks, mica-like layers are classified as dioctahedral or trioctahedral based on octahedral occupancy.","zh":"在许多教材中，类似云母的层状结构会根据八面体位点的占据情况分为二八面体或三八面体。"}]}],"synonyms":["two-octahedral","2:3 octahedral occupancy"],"phonetic":"/ˌdaɪ.ɑkˈtiː.drəl/","extraExplanation":["“di-”表示“二”，“-octahedral”指“八面体结构”。这个词常用于黏土矿物学/矿物晶体化学里，描述片状（层状）硅酸盐中“八面体片层”的占位情况。","对比：trioctahedral（三八面体）表示三个八面体位点都被占据，常见阳离子可能是Mg²⁺、Fe²⁺等；dioctahedral（二八面体）则通常有一个空位。","阅读矿物或黏土文献时，你常会看到“dioctahedral smectite（如蒙脱石）”“dioctahedral mica（如白云母）”等搭配，用来快速判断结构与性质（如层电荷、膨润性等）的大方向。"]}
{"word":"Dioctophyme","summary":{"en":"Dioctophyme: a genus of parasitic roundworms, especially the “giant kidney worm.”","zh":"Dioctophyme：寄生性线虫的一属，尤指“巨肾虫”（可寄生肾脏）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of parasitic roundworms (nematodes), best known for the species that can infect the kidneys of mammals (including dogs and, rarely, humans).","zh":"（寄生虫）巨肾虫属：一类寄生性线虫，以可感染哺乳动物（包括犬类，极少数也可感染人类）肾脏的物种最为人知。"},"examples":[{"en":"The veterinarian diagnosed the dog with Dioctophyme after imaging showed a large worm in the kidney.","zh":"兽医在影像检查发现肾脏内有大型蠕虫后，诊断该犬感染了巨肾虫属（Dioctophyme）的寄生虫。"},{"en":"Dioctophyme renale is often called the “giant kidney worm.”","zh":"Dioctophyme renale 常被称为“巨肾虫”。"}]}],"synonyms":["giant kidney worm (common name, esp. D. renale)"],"phonetic":"/ˌdaɪˈɑːktoʊfaɪm/","extraExplanation":["该词多见于医学/兽医学和寄生虫学文献中，日常英语里很少使用；更常见的说法是具体物种名（如 Dioctophyme renale）或俗名 giant kidney worm（巨肾虫）。","词源上可分解理解：di-（二、双）+ octo（八）+ -phyme（与“肿块/膨大”相关的希腊语词根变体），属于较典型的科学命名构词方式。"]}
{"word":"dioctophyme","summary":{"en":"Dioctophyme is a genus of parasitic roundworms, best known for the giant kidney worm (D. renale).","zh":"Dioctophyme 是寄生性线虫的一属，最知名的是肾巨虫（D. renale）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of parasitic roundworms; the best-known species, Dioctophyme renale, is the “giant kidney worm” that can infect mammals (especially dogs and other carnivores).","zh":"（生物）寄生性线虫的一属；其中最著名的种为肾巨虫（Dioctophyme renale，“巨型肾虫”），可感染哺乳动物（尤其是狗等食肉动物）。"},"examples":[{"en":"The vet suspected Dioctophyme after seeing signs of kidney damage in the dog.","zh":"兽医在狗出现肾脏损伤迹象后，怀疑可能感染了肾巨虫属（Dioctophyme）。"},{"en":"Dioctophyme renale is often called the giant kidney worm in English.","zh":"Dioctophyme renale 在英语中常被称为“giant kidney worm”（巨型肾虫）。"}]}],"synonyms":["giant kidney worm (for Dioctophyme renale)","kidney worm (informal, can be ambiguous)"],"phonetic":"/daɪˌɑktoʊˈfaɪmi/","extraExplanation":["“Dioctophyme”是拉丁化的科学属名，日常英语里更常见的是通俗名“giant kidney worm”。\n感染通常与食入带幼虫的水生生物有关（如某些鱼类或中间宿主），属于兽医/寄生虫学语境下的专业词汇。"]}
{"word":"diode","summary":{"en":"A diode is an electronic part that mainly allows current to flow in one direction; some diodes (like LEDs) also produce light.","zh":"二极管是一种主要让电流单向通过的电子元件；有些二极管（如 LED）还能发光。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An electronic component that lets electric current flow mainly in one direction and blocks it in the opposite direction.","zh":"一种电子元件，主要允许电流单向通过，并阻止反向电流。"},"examples":[{"en":"A diode protects the circuit by blocking current if the battery is connected backward.","zh":"二极管可以在电池反接时阻止电流，从而保护电路。"},{"en":"In a charger, diodes help convert AC power into DC power.","zh":"在充电器里，二极管帮助把交流电转换成直流电。"}]},{"partOfSpeech":"n.","definition":{"en":"A device (such as an LED) that produces light using diode technology.","zh":"利用二极管技术发光的装置（例如发光二极管 LED）。"},"examples":[{"en":"This lamp uses a diode light instead of a traditional bulb.","zh":"这盏灯用的是二极管灯（如 LED），而不是传统灯泡。"},{"en":"The remote control sends signals using an infrared diode.","zh":"遥控器用红外二极管来发送信号。"}]}],"synonyms":["rectifier","LED (light-emitting diode)"],"phonetic":"/ˈdaɪ.oʊd/","extraExplanation":["词源：diode 来自 di-（“二、双”）+ -ode（与“路径/电路元件”相关），字面含义可理解为“有两个电极的器件”。常见类型包括整流二极管（rectifier diode）、发光二极管（LED）、齐纳二极管（Zener diode，用于稳压）。","理解小提示：可以把二极管想成“电流的单向阀门”。在电路图里常用一个带箭头/三角形和一条竖线的符号表示，方向体现它更容易导通的一侧。"]}
{"word":"diodes","summary":{"en":"Diodes are electronic parts that usually allow current to flow in only one direction.","zh":"Diodes（二极管）是一种电子元件，通常只让电流单向流动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a two-terminal electronic component that lets electric current flow mainly in one direction (plural of diode)","zh":"二极管：一种有两个端子的电子元件，主要允许电流朝一个方向流动（diode 的复数）"},"examples":[{"en":"Diodes are used to convert AC power to DC power in many chargers.","zh":"许多充电器会用二极管把交流电转换成直流电。"},{"en":"The circuit includes diodes to protect the device from reverse polarity.","zh":"这个电路包含二极管，用来防止电源接反造成损坏。"},{"en":"LEDs are diodes that produce light when current passes through them.","zh":"LED（发光二极管）是一种在电流通过时会发光的二极管。"}]}],"synonyms":["rectifier diode","semiconductor diode"],"phonetic":"ˈdaɪoʊd","extraExplanation":["“diode”来自“di-”（两个）+“ode”（电路元件的后缀，用于表示与电相关的器件），强调它有两个电极/端子。","学习电路时常见相关词：rectifier（整流器，用二极管整流）、reverse bias（反向偏置，通常不导通）、forward bias（正向偏置，通常导通）。"]}
{"word":"Diodia","summary":{"en":"“Diodia” is not standard English; it likely refers to “diode” in electronics.","zh":"“Diodia”不是标准英语；很可能是电子领域的“diode（二极管）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often seen as a misspelling or a non-English form of “diode” (an electronic component that allows current to flow mainly in one direction).","zh":"不是标准英语单词；最常见的是“diode（二极管）”的拼写错误或外语形式（指一种主要让电流单向流动的电子元件）。"},"examples":[{"en":"I couldn’t find “diodia” in an English dictionary—did you mean “diode”?","zh":"我在英语词典里找不到“diodia”——你是不是想写“diode（二极管）”？"},{"en":"A diode is used in circuits to control the direction of electric current.","zh":"二极管常用于电路中，用来控制电流的方向。"}]}],"synonyms":["diode"],"phonetic":"/daɪˈoʊdiə/","extraExplanation":["“Diodia”更像是外来词或拼写误差。英语里常用的是 **diode**（二极管）。如果你是在电子/电路语境看到它，几乎可以确定是在指“diode”。","如果你能提供一句原文或说明它出现的领域（例如：电子、化学、品牌名、人名/地名），我可以帮你更准确地判断它在该语境下的含义与用法。"]}
{"word":"diodia","summary":{"en":"Diodia is an older botanical genus name (buttonweed) in the coffee family, mainly used in scientific contexts.","zh":"Diodia 是一个较旧的植物属学名（buttonweed，纽扣草/假纽扣草），主要见于科学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant genus (older scientific name) in the coffee family (Rubiaceae), often called buttonweed; some species are now commonly classified under the genus Spermacoce.","zh":"（植物学）茜草科（咖啡科）中的一个植物属的旧学名，常被称为“buttonweed（纽扣草/假纽扣草）”；其中一些物种现在常归入 *Spermacoce* 属。"},"examples":[{"en":"The field guide listed it as Diodia (buttonweed), though newer sources use Spermacoce.","zh":"这本野外图鉴写的是 Diodia（buttonweed），但较新的资料多用 Spermacoce。"},{"en":"Diodia species can be found in warm regions and may grow as low, weedy groundcover.","zh":"Diodia 的一些物种可见于温暖地区，可能作为低矮、略带杂草性的地被植物生长。"}]}],"synonyms":["buttonweed","false buttonweed","Spermacoce (current classification for many species)"],"phonetic":"/daɪˈoʊdiə/","extraExplanation":["“Diodia”在日常英语里并不常见，主要出现在植物学/生态学资料中，属于拉丁化的学名用法。","词源上常被解释为来自希腊语元素：di-（“两个”）+ hodos（“路/道路”），与“分叉、岔路”之类的意象有关，但在现代英语里通常不作为普通词来使用。","如果你想查的是电子元件“diode（二极管）”，那是另一个词：拼写不同、含义也不同。你可以告诉我你想要植物学的还是电子学的解释。"]}
{"word":"Diodon","summary":{"en":"Diodon is a scientific genus name for porcupinefish—spiny fish that can inflate for defense.","zh":"Diodon 是刺鲀属的学名，指能鼓起身体、防御时竖起刺的“豪猪鱼/刺河豚”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of porcupinefish (spiny pufferfish) that can inflate its body for defense; some species have long sharp spines","zh":"刺鲀属（一类“豪猪鱼/刺河豚”）；遇到危险时会把身体鼓起来防御，部分种类带有明显的长刺"},"examples":[{"en":"The Diodon puffed up like a balloon when it felt threatened.","zh":"这条刺鲀属的鱼感到受威胁时像气球一样鼓了起来。"},{"en":"In coral reefs, a Diodon often hides in crevices during the day.","zh":"在珊瑚礁里，刺鲀属的鱼常在白天躲在岩缝中。"}]}],"synonyms":["porcupinefish","pufferfish"],"phonetic":"/ˈdaɪoʊdɑːn/","extraExplanation":["词源来自希腊语：di-（“两个”）+ odon（“牙齿”），指它们上下颌融合成像“二齿”一样的坚硬咬板，便于咬碎贝类等硬壳猎物。","日常英语里更常见的叫法是 porcupinefish（豪猪鱼/刺河豚）或 pufferfish（河豚/气泡鱼）。Diodon 多用于生物分类或科普语境。"]}
{"word":"diodon","summary":{"en":"Diodon is the scientific name for a genus of spiny pufferfish (porcupinefish).","zh":"Diodon 是刺鲀属的学名，指一类会鼓起身体并竖起尖刺的河豚样海鱼（豪猪鱼）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of porcupinefish (spiny pufferfish) that can inflate its body and raise sharp spines when threatened","zh":"（生物）刺鲀属；一种会在受威胁时鼓起身体并竖起尖刺的海鱼（刺河豚/豪猪鱼一类）"},"examples":[{"en":"A Diodon can inflate itself into a round shape to scare predators.","zh":"刺鲀属的鱼可以把身体鼓成球状来吓退捕食者。"},{"en":"In the tide pool, we saw a small Diodon hiding under a rock.","zh":"在潮池里，我们看到一条小刺鲀属的鱼躲在石头下面。"}]}],"synonyms":["porcupinefish","pufferfish"],"phonetic":"/ˈdaɪəˌdɑːn/","extraExplanation":["“Diodon”是拉丁化的学名，常见于生物学/海洋学语境；日常英语里更常说 porcupinefish（豪猪鱼/刺鲀）或 pufferfish（河豚类，泛称）。","词源来自希腊语：di-（两、双）+ odon（牙齿），指这类鱼上颌常见融合成“像两颗大牙”的齿板结构。"]}
{"word":"diodont","summary":{"en":"Diodont is a rare zoological word meaning “two-toothed,” often describing porcupinefish with fused, beak-like teeth.","zh":"diodont 是较少见的动物学词，意为“二齿（融合）”，常用于描述牙齿融合成喙状齿板的刺豚类。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(zoology) Having two tooth-like plates or a beak formed by two fused teeth; often used when talking about porcupinefish (family Diodontidae).","zh":"（动物学）具有“两枚”融合成喙状的齿板（或两齿融合）；常用于描述刺豚科（porcupinefish，刺河豚/刺豚一类）。"},"examples":[{"en":"A diodont fish uses its beak-like teeth to crush hard shells.","zh":"刺豚科（diodont）的鱼会用喙状的齿板咬碎坚硬的贝壳。"},{"en":"Some references describe porcupinefish as diodont because their teeth are fused into plates.","zh":"有些资料把刺豚描述为 diodont，是因为它们的牙齿融合成齿板。"}]},{"partOfSpeech":"n.","definition":{"en":"A diodont fish; a member of the porcupinefish group (less common as a noun).","zh":"刺豚科的鱼；刺豚（作名词用较少见）。"},"examples":[{"en":"Divers spotted a diodont resting near the reef.","zh":"潜水员看到一条刺豚（diodont）在珊瑚礁附近休息。"}]}],"synonyms":["two-toothed","bidentate"],"phonetic":"/daɪˈoʊdɑːnt/","extraExplanation":["这个词比较偏专业，来自希腊语词根：di-（二、两）+ odont（牙）。因此它的核心概念就是“二齿/两齿融合”。在鱼类里常指刺豚科（Diodontidae）那种“像喙一样的齿板”。","日常英语里很少用 diodont；更常见的表达是 porcupinefish（刺豚/刺河豚）或用 two-toothed / bidentate（两齿的）来描述“二齿”特征。"]}
{"word":"Diodontidae","summary":{"en":"Diodontidae is the scientific family name for porcupinefish—spiny marine fish that can inflate their bodies.","zh":"Diodontidae 是刺豚科的学名，指一类带尖刺、能把身体鼓起来的海水鱼（刺豚/豪猪鱼）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of marine fish (including porcupinefish) known for inflatable bodies and sharp spines; many species can puff up to deter predators.","zh":"刺豚科（海水鱼类的一科，包括刺豚/豪猪鱼），以可膨胀的身体和尖刺著称；许多种类会“鼓起来”来吓退天敌。"},"examples":[{"en":"The Diodontidae include porcupinefish that inflate when threatened.","zh":"刺豚科包括在受威胁时会鼓胀起来的刺豚（豪猪鱼）。"},{"en":"Divers often recognize members of Diodontidae by their spines and round, puffed shape.","zh":"潜水员常通过它们的尖刺和鼓胀后圆滚滚的外形来辨认刺豚科成员。"}]}],"synonyms":["porcupinefish family","spiny puffer family"],"phonetic":"/ˌdaɪoʊˈdɑːntɪdiː/","extraExplanation":["“Diodontidae”是生物分类学中的“科”名（family），常见俗名相关的是 porcupinefish（刺豚/豪猪鱼）。","词源上常解释为来自希腊语：di-（两、双）+ odous/odont-（牙），指这类鱼口部牙齿结构融合成类似“喙”的形态。","学习时注意：这是拉丁化学名，日常英语中更常说 porcupinefish，而不是直接说 Diodontidae。"]}
{"word":"diodontidae","summary":{"en":"Diodontidae is the scientific family name for porcupinefish—spiny fish that can inflate for defense.","zh":"Diodontidae 是豪猪鱼（刺豚鱼）的科学“科”名，这类鱼有硬刺并能鼓胀身体防御。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of fish (Diodontidae) known as porcupinefish, which can puff up their bodies and have strong spines for defense.","zh":"（鱼类）刺鲀科（Diodontidae）：常称“豪猪鱼/刺豚鱼”，能将身体鼓胀，并用坚硬的刺进行防御。"},"examples":[{"en":"Porcupinefish belong to the family Diodontidae.","zh":"豪猪鱼属于刺鲀科（Diodontidae）。"},{"en":"Some Diodontidae inflate when threatened to look larger.","zh":"一些刺鲀科（Diodontidae）的鱼在受威胁时会鼓胀身体，让自己看起来更大。"}]}],"synonyms":["porcupinefish (common name)","porcupine fish (common name)"],"phonetic":"/ˌdaɪoʊˈdɑːntɪdiː/","extraExplanation":["“Diodontidae”是生物分类学中的“科”名，常见英文俗名为 porcupinefish（豪猪鱼/刺豚鱼）。在科名中，后缀 -idae 表示“科”。","词源上可拆为 dio-（二）+ odont-（牙），大意与“牙齿”特征相关；很多相关鱼类有融合成“喙状”的牙板，便于咬碎硬壳猎物。"]}
{"word":"Dioecia","summary":{"en":"Dioecia is the biological condition where male and female reproductive organs are on separate individuals (separate male and female plants/animals).","zh":"Dioecia 指雌雄异株/雌雄异体：雄性与雌性的生殖器官分别在不同个体上。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Biology, especially botany) The condition of a species in which male and female reproductive organs occur on separate individuals; having separate male and female plants/animals.","zh":"（生物学，尤指植物学）雌雄异株（或雌雄异体）的状态：雄性与雌性的生殖器官分别长在不同个体上。"},"examples":[{"en":"In willow trees, dioecia means you need both male and female plants to produce seeds.","zh":"在柳树中，“dioecia（雌雄异株）”意味着要同时有雄株和雌株才能结籽。"},{"en":"Because of dioecia, a single female plant cannot produce fertile fruit without a nearby male plant.","zh":"由于雌雄异株，一株雌株如果附近没有雄株，就无法结出可育的果实。"},{"en":"Researchers recorded dioecia in the population by counting male and female individuals separately.","zh":"研究人员通过分别统计雄性与雌性个体数量来记录该种群的雌雄异体情况。"}]}],"synonyms":["dioecy","separate sexes","unisexuality (in separate individuals)"],"phonetic":"/daɪˈiːsiə/","extraExplanation":["词源提示：dioecia 来自希腊语 di-（“两个”）+ oikos（“家、居所”），原意可理解为“分在两个‘家’里”，引申为雌雄分属不同个体。","用法提示：在现代英语中，更常见的对应术语是 dioecy（雌雄异株/雌雄异体）与形容词 dioecious（雌雄异株的/雌雄异体的）。在学术文本（尤其是分类学、植物学）里 dioecia 也会出现。"]}
{"word":"dioecia","summary":{"en":"Dioecia means dioeciousness—the male and female reproductive organs are on separate individuals, especially in plants.","zh":"Dioecia 指“雌雄异株”的状态，即雄性与雌性生殖器官分属不同个体（尤用于植物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the condition in which male and female reproductive organs occur on separate individual organisms (especially in plants); dioeciousness","zh":"（尤指植物）雌雄异株：雄花与雌花分别生长在不同个体上的状态"},"examples":[{"en":"Kiwifruit shows dioecia: you need a male plant and a female plant to get fruit.","zh":"猕猴桃是雌雄异株：需要一株雄株和一株雌株才能结果。"},{"en":"In dioecia, a single plant produces only male flowers or only female flowers.","zh":"在雌雄异株中，一株植物只会开雄花或只会开雌花。"}]},{"partOfSpeech":"n.","definition":{"en":"a historical Linnaean class grouping plants with male and female flowers on separate individuals","zh":"（历史用法）林奈分类法中的“雌雄异株纲/类”，指雌花与雄花分属不同个体的植物类群"},"examples":[{"en":"Older botany texts may list some species under the class Dioecia.","zh":"较早的植物学书籍可能会把一些物种归入“Dioecia（雌雄异株纲/类）”。"}]}],"synonyms":["dioeciousness","separate sexes (in plants)"],"phonetic":"/daɪˈiʃə/","extraExplanation":["词源：来自希腊语 di-（“两、分开”）+ oikos（“家”），字面意思是“两个家”，用来形象地说明雄性与雌性分居在不同个体上。","学习提示：与 monoecia（同株异花，雌雄同株）对比记忆更容易。mono- 表示“一个”，即“一个家”。","现代写作中更常用的形容词是 dioecious（雌雄异株的）；dioecia 多见于专业或较旧的学术语境。"]}
{"word":"dioecian","summary":{"en":"Diocesan means “related to a diocese,” and can also refer to a person connected with a diocese.","zh":"Diocesan 指“教区的、与教区有关的”，也可指与某教区有关的人（尤指神职人员）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a church, bishop, or activities) relating to a diocese (an area controlled by a bishop).","zh":"（教会、主教或相关事务）教区的；与教区有关的。"},"examples":[{"en":"The diocesan office sent guidelines to all local churches.","zh":"教区办公室向所有地方教会发送了指导方针。"},{"en":"She works for the diocesan newspaper.","zh":"她在教区报社工作。"}]},{"partOfSpeech":"n.","definition":{"en":"A person (especially a bishop or clergy member) connected with a particular diocese.","zh":"（尤指主教或神职人员）某个教区的人；教区成员。"},"examples":[{"en":"As a diocesan, he attended the annual meeting at the cathedral.","zh":"作为教区成员，他参加了在主教座堂举行的年度会议。"}]}],"synonyms":["diocesan","episcopal (related)","church (contextual)"],"phonetic":"/daɪˈɑsɪsən/","extraExplanation":["你输入的“dioecian”常见是拼写误写；更标准的形式通常是 **diocesan**（教区的）。","词源上与 **diocese**（教区）同源，常见于基督宗教（尤其是天主教、圣公会等）的组织与行政语境中。"]}
{"word":"dioecio-dimorphous","summary":{"en":"A scientific adjective meaning a species has separate male and female individuals and also has two distinct forms.","zh":"科学术语：指物种雌雄异株，同时还具有两种明显不同的形态类型。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany, zoology) Having separate male and female individuals (dioecious) and also occurring in two distinct forms (dimorphous).","zh":"（植物学/动物学）雌雄异株（雄株与雌株为不同个体），并且同时具有两种明显不同的形态类型（两型、二形）。"},"examples":[{"en":"The species is described as dioecio-dimorphous: male and female plants are separate, and each sex shows two distinct flower forms.","zh":"该物种被描述为dioecio-dimorphous：雄株与雌株分开存在，而且每个性别的花还呈现两种明显不同的类型。"},{"en":"In dioecio-dimorphous populations, researchers compare the two morphs to understand pollination and reproductive success.","zh":"在dioecio-dimorphous的种群中，研究者会比较两种形态类型，以理解传粉过程与繁殖成功率。"}]}],"synonyms":["dioecious and dimorphic","dioecious-dimorphic","dioecious, dimorphic"],"phonetic":"/daɪˈiːsi.oʊ dɪˈmɔɹfəs/","extraExplanation":["这个词多见于较旧或较专业的分类学/形态学描述中，由“dioecious（雌雄异株）+ dimorphous（两型/二形）”组合而成。它强调两个层面：①性别分离在不同个体上；②同一物种还存在两种稳定、可区分的形态（例如两种花型、叶型或体型）。","不要与“dimorphic（两型的）”或“dioecious（雌雄异株的）”单独使用混淆：dioecio-dimorphous表示两种现象同时存在。具体“两型”指什么，要看原论文或物种描述的上下文。"]}
{"word":"dioeciodimorphous","summary":{"en":"A rare botanical adjective meaning a species is dioecious and also has two distinct forms (often male vs. female forms).","zh":"一个较少见的植物学形容词，指物种既是雌雄异株，又具有两种明显不同的形态（常见为雌雄两型）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having male and female reproductive organs on separate individuals (dioecious) and also showing two distinct forms or morphs (dimorphous), often related to sex or flower type.","zh":"（植物学）既是雌雄异株（雄株与雌株分开生长），又呈现两种明显不同的形态（两型），这种两型常与性别或花型有关。"},"examples":[{"en":"This plant is described as dioeciodimorphous because male and female flowers grow on separate plants and the two sexes look different.","zh":"这种植物被描述为 dioeciodimorphous，因为雄花和雌花分别长在不同植株上，而且两性植株外形不同。"},{"en":"In a dioeciodimorphous species, you may need both morphs nearby for successful pollination.","zh":"在 dioeciodimorphous 的物种中，通常需要两种形态（往往对应雌株与雄株）在附近才能成功传粉。"}]}],"synonyms":["dioecious and dimorphic","sexually dimorphic (in dioecious species)","dioecio-dimorphous"],"phonetic":"/daɪˌiːsi.oʊdaɪˈmɔːrfəs/","extraExplanation":["这个词很少见，通常出现在较旧或较专业的植物学描述中。它由两部分组合而成：dioecio-（雌雄异株，来自 dioecious）+ dimorphous（两型、两形）。","与之相关、但更常见的术语包括：dioecious（雌雄异株）、dimorphic / dimorphous（两型的）、sexual dimorphism（雌雄二型：雌雄在外形上有差异）。"]}
{"word":"dioeciopolygamous","summary":{"en":"A rare, humorous adjective meaning “holding more than one diocese/church office at once.”","zh":"一个罕见、带讽刺意味的形容词，指“同时兼有多个教区/教会职务”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, humorous) Having or holding more than one diocese or church office at the same time; metaphorically, being “married” to multiple dioceses.","zh":"（罕见，带幽默色彩）同时拥有或兼任多个教区/教会职务；引申为像“同时娶了好几个教区”一样的状态。"},"examples":[{"en":"The pamphlet accused the bishop of being dioeciopolygamous because he controlled two dioceses.","zh":"那本小册子指责那位主教“dioeciopolygamous”，因为他掌控了两个教区。"},{"en":"In the satire, the cleric’s dioeciopolygamous ambitions were treated as a scandal.","zh":"在那部讽刺作品里，那位教士“dioeciopolygamous”的野心被写成了一桩丑闻。"}]}],"synonyms":["pluralistic (in church-office sense)","multi-diocesan","holding multiple sees"],"phonetic":"/daɪˌiːsi.oʊˌpɑlɪˈɡeɪməs/","extraExplanation":["这是一个非常少见、偏讽刺/戏谑的合成词：dioecio- 来自 diocese（教区），polygamous 表示“一夫多妻/多配偶的”。把两部分拼在一起，借“多配偶”的概念来影射某人同时掌握多个教区或教会职位。","在历史语境中，它常用来讽刺教会体系里的“兼任多个圣职/领地”“握权过多”等现象；现代英语里几乎不会在正式写作中使用，更可能出现在讽刺文字或学术引述里。"]}
{"word":"dioecious","summary":{"en":"Dioecious describes a species in which male and female individuals are separate (especially in plants).","zh":"dioecious 指雌雄异株：雄性与雌性个体分开（尤用于植物）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a species, especially plants) having male and female reproductive organs on separate individuals—each individual is either male or female.","zh":"（指物种，尤指植物）雌雄异株的；雄性与雌性生殖器官分别长在不同个体上——每个个体要么雄株/雄体，要么雌株/雌体。"},"examples":[{"en":"Holly is dioecious, so you need both a male and a female plant to get berries.","zh":"冬青是雌雄异株的，所以想结果（长红果）需要同时种雄株和雌株。"},{"en":"In many dioecious species, only the female plants produce fruit.","zh":"在许多雌雄异株的物种中，只有雌株会结果。"}]}],"synonyms":["unisexual (in plants)","of separate sexes"],"phonetic":"/daɪˈiʃəs/","extraExplanation":["这个词常见于植物学/生态学文章，用来解释“为什么种了却不结果”：如果植物是dioecious（雌雄异株），附近没有异性植株就可能无法授粉结实。","对比：monoecious（雌雄同株）指同一株上同时有雄花和雌花（如玉米、南瓜等很多品种）。","词源上来自希腊语前缀 di-（二、分开）+ oikos（家），字面意思接近“分成两个‘家’/个体”。"]}
{"word":"dioeciously","summary":{"en":"“Dioeciously” means in a dioecious way—male and female reproductive parts occur on separate individuals.","zh":"“dioeciously”表示“以雌雄异株/雌雄异体的方式”，即雌雄生殖器官分布在不同个体上。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is dioecious: with male and female reproductive organs (flowers or cones) borne on separate individual plants (or separate individual animals).","zh":"以雌雄异株（或雌雄异体）的方式：雄性与雌性生殖器官（花、球果等）分别长在不同个体上（植物或动物皆可）。"},"examples":[{"en":"In willows, flowers are produced dioeciously, so you need both male and female plants for seeds to form.","zh":"在柳树中，花是雌雄异株产生的，因此要结籽需要同时有雄株和雌株。"},{"en":"The species reproduces dioeciously, which affects how it spreads in new habitats.","zh":"该物种以雌雄异株方式繁殖，这会影响它在新栖地中的扩散方式。"}]}],"synonyms":["in a dioecious manner","with separate sexes","unisexual (in separate individuals)"],"phonetic":"/daɪˈiːʃəsli/","extraExplanation":["“dioeciously”主要用于植物学/生态学写作，对比常见的“monoeciously（雌雄同株）”。雌雄异株意味着单株只开雄花或只开雌花，因此自然繁殖通常依赖授粉者或风把花粉从雄株带到雌株。"]}
{"word":"dioeciousness","summary":{"en":"Dioeciousness means a species has separate male and female individuals.","zh":"Dioeciousness 指物种雌雄分离，雄性与雌性分别属于不同个体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The condition of being dioecious—having male and female reproductive organs on separate individual plants (or animals), so each individual is either male or female.","zh":"雌雄异株（或雌雄异体）的状态：指雄性与雌性生殖器官分布在不同个体上，因此每个个体要么是雄性，要么是雌性。"},"examples":[{"en":"In some species, dioeciousness helps reduce self-fertilization.","zh":"在一些物种中，雌雄异株有助于减少自花授粉（自体受精）。"},{"en":"Kiwifruit cultivation requires dioeciousness to be managed by planting both male and female vines.","zh":"种植猕猴桃时需要管理雌雄异株的特性，通常要同时栽种雄株和雌株。"}]}],"synonyms":["dioecy","separate sexes"],"phonetic":"/daɪˈiːʃəsnəs/","extraExplanation":["词源提示：dioeciousness 来自 dioecious（雌雄异株/雌雄异体）+ -ness（名词后缀，表示“……的状态”）。dio- 表示“两个”，-oecious 与“居住/家”相关（源自希腊语 oikos），合起来可理解为“分成两个‘家’（两类个体）”。","对比记忆：monoecious（雌雄同株）指同一株植物同时有雄花与雌花；dioecious（雌雄异株）则必须有不同个体分别承担雄性或雌性功能。"]}
{"word":"dioecism","summary":{"en":"Dioecism is the biological condition where male and female reproductive organs occur on separate individuals of the same species.","zh":"dioecism 指生物（尤指植物）在同一物种内雌雄分属不同个体的现象，即“雌雄异株”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the condition of a species (especially a plant species) in which male and female reproductive organs occur on separate individuals; dioecy","zh":"（尤指植物）雌雄异株：同一物种中，雄性与雌性生殖器官分别存在于不同个体上的现象"},"examples":[{"en":"In many willows, dioecism means you need both male and female plants to produce seeds.","zh":"在许多柳树中，雌雄异株意味着要同时有雄株和雌株才能结籽。"},{"en":"Researchers studied dioecism to understand how plant populations maintain genetic diversity.","zh":"研究人员通过研究雌雄异株来理解植物种群如何维持遗传多样性。"}]}],"synonyms":["dioecy","unisexuality (in plants)"],"phonetic":"/daɪˈiːsɪzəm/","extraExplanation":["“dioecism”常用于植物学与生态学写作，比日常口语更学术；更常见的同义词是“dioecy”。","对比：monoecism（雌雄同株）指同一株植物上同时有雄花与雌花；而dioecism（雌雄异株）需要两株不同性别的个体。","词源提示：前缀 dio- 来自希腊语，表示“两个”；与 -ecism / -ecy（表示某种状态或特征）组合，用来表达“分成两个性别个体的状态”。"]}
{"word":"dioecisms","summary":{"en":"Dioecisms are separate-sex reproductive systems, especially in plants, where male and female individuals are different plants.","zh":"dioecisms 指雌雄异株等“雌雄分离”的繁殖系统，尤指植物中雄株与雌株是不同个体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Separate-sex systems in biology, especially in plants—situations where male and female reproductive organs are on different individuals (male plants and female plants).","zh":"（复数）雌雄异株现象／雌雄异体制：在生物学中（尤指植物）指雄性与雌性的生殖器官分布在不同个体上，即有“雄株”和“雌株”。"},"examples":[{"en":"Some species of holly show dioecisms, so you need both male and female plants to get berries.","zh":"有些冬青具有雌雄异株现象，所以想要结浆果需要同时种雄株和雌株。"},{"en":"Researchers compared dioecisms and hermaphroditism to understand how plants evolve different reproductive strategies.","zh":"研究人员比较雌雄异株与雌雄同株（两性花/雌雄同体），以了解植物如何演化出不同的繁殖策略。"}]}],"synonyms":["separate sexes","dioecy"],"phonetic":"/daɪˈiːsɪzəmz/","extraExplanation":["“dioecism(s)”是名词“dioecism”的复数，学术写作中更常直接用形容词“dioecious（雌雄异株的）”来描述某个物种，例如：a dioecious plant（雌雄异株植物）。","与之相对的常见概念：monoecism（雌雄同株：同一株上有雄花和雌花，如玉米）以及 hermaphroditism（雌雄同体/两性：同一个体同时具备雄、雌生殖结构，很多花为两性花）。"]}
{"word":"dioecy","summary":{"en":"Dioecy is when male and female flowers are on separate plants of the same species.","zh":"Dioecy 指同一种植物雌雄分株，雄花与雌花长在不同个体上。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the condition in which a plant species has male and female flowers on separate individual plants (each plant is either male or female)","zh":"（植物学）雌雄异株：同一种植物的雄花与雌花分别长在不同的植株上（每株要么雄株要么雌株）"},"examples":[{"en":"Kiwifruit shows dioecy, so growers usually plant both male and female vines.","zh":"猕猴桃是雌雄异株的，所以种植者通常会同时栽种雄株和雌株。"},{"en":"In dioecy, pollination must move pollen from a male plant to a female plant.","zh":"在雌雄异株的情况下，授粉必须把花粉从雄株传到雌株。"}]}],"synonyms":["dioecious condition","separate sexes (in plants)"],"phonetic":"/daɪˈiːsi/","extraExplanation":["词源：来自希腊语 di-（“两个”）+ oikos（“家”），字面意思是“两个家”，指雄株与雌株分开“住在不同个体上”。","对比概念：monoecy（雌雄同株）指同一株植物上同时有雄花和雌花；而 dioecy（雌雄异株）必须有不同植株才能完成繁殖。","常见语境：多见于植物学、生态学与园艺说明（例如“雌株结果、雄株供粉”）。"]}
{"word":"dioestrous","summary":{"en":"A biological adjective meaning “related to diestrus,” the non-heat stage between estrus periods in many mammals.","zh":"一个生物学形容词，表示“与动情间期有关”，即许多哺乳动物两次发情期之间的非发情阶段。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology) Relating to diestrus—the stage of the estrous cycle (in many mammals) between heat (estrus) periods, when the animal is not sexually receptive.","zh":"（生物）与动情间期有关的；指许多哺乳动物发情周期中两次发情（动情期）之间的阶段，此时通常不接受交配。"},"examples":[{"en":"The veterinarian said the dog was likely in a dioestrous phase, so mating behavior was unlikely.","zh":"兽医说这只狗可能处于dioestrous（动情间期）阶段，所以不太会出现愿意交配的行为。"},{"en":"Hormone levels change across the estrous cycle, including during dioestrous.","zh":"激素水平会随着发情周期变化，dioestrous（动情间期）也不例外。"}]}],"synonyms":["diestrous","related to diestrus","interestrus (in some contexts)"],"phonetic":"/daɪˈiːstrəs/","extraExplanation":["这是一个比较专业的兽医学/动物繁殖学术语，多用于描述非人类哺乳动物的“发情周期（estrous cycle）”，与人类常说的“月经周期（menstrual cycle）”不同。","拼写上常见两种：dioestrous（英式/带 oe 的拼写）与 diestrous（美式/简化拼写）。两者含义相同。","相关名词是 diestrus / dioestrus，表示“动情间期”这一阶段本身；dioestrous/diestrous 则是形容词，用来修饰 phase、period、stage 等词。"]}
{"word":"dioestrum","summary":{"en":"Dioestrum is a rare form of dioestrus/diestrus: the post-heat (luteal) stage of an animal’s estrous cycle.","zh":"dioestrum 是较少见的写法，通常等同于 dioestrus/diestrus：动物动情周期中发情之后的黄体期阶段。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Veterinary biology) The phase of an animal’s estrous (“heat”) cycle that comes after estrus, when the body is under the influence of progesterone and the uterus is prepared for possible pregnancy; often called the luteal phase in many species.","zh":"（兽医/动物生殖）动情周期中动情期（发情）之后的阶段，此时以孕激素（黄体酮）作用为主，子宫为可能的妊娠做准备；在许多物种中也常称为“黄体期”。"},"examples":[{"en":"In dogs, dioestrum is the long stage after heat when progesterone stays high.","zh":"在母犬中，dioestrum 是发情后持续较久的阶段，此时孕激素水平较高。"},{"en":"The vet confirmed she was in dioestrum based on hormone tests and ovarian changes.","zh":"兽医根据激素检测和卵巢变化确认她处于 dioestrum 阶段。"}]}],"synonyms":["dioestrus","diestrus","luteal phase"],"phonetic":"/daɪˈɛstrəs/","extraExplanation":["“dioestrum”在现代英语里很少见，更常见的拼写是英式/学术写法 **dioestrus**，以及美式/兽医文献常用的 **diestrus**。它们通常指同一阶段。","词根与“estrus/oestrus（发情）”有关，来源可追溯到希腊语 *oistros*（与“刺激、狂热”相关的词源含义），因此在生殖语境中表示“发情周期”的各阶段。"]}
{"word":"dioestrus","summary":{"en":"Dioestrus is the post-estrus stage of an animal’s reproductive cycle, marked by reduced receptivity and preparation for possible pregnancy.","zh":"Dioestrus 指雌性动物发情期之后的动情后期：性接受度降低，身体为可能的妊娠做准备。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a stage in the estrous (reproductive) cycle of many female mammals that comes after estrus (“heat”), when sexual receptivity decreases and the body prepares for possible pregnancy.","zh":"（许多雌性哺乳动物）动情周期中的一个阶段，发生在发情期（heat/estrus）之后；此时性接受度下降，机体为可能的妊娠做准备。"},"examples":[{"en":"In dogs, progesterone is typically high during dioestrus.","zh":"在母犬中，黄体酮在动情后期（dioestrus）通常较高。"},{"en":"The veterinarian explained that her cat’s behavior changed because she was entering dioestrus.","zh":"兽医解释说，她的母猫行为变化是因为正进入动情后期（dioestrus）。"},{"en":"Researchers tracked hormone levels across proestrus, estrus, dioestrus, and anestrus.","zh":"研究人员追踪了动情前期、发情期、动情后期以及乏情期各阶段的激素水平。"}]}],"synonyms":["diestrus"],"phonetic":"/daɪˈiːstrəs/","extraExplanation":["“dioestrus”也常拼作“diestrus”，两者在生理学/兽医学语境中通常指同一阶段。","该词主要用于描述非人类哺乳动物的“动情周期”（estrous cycle）；人类更常用“月经周期”（menstrual cycle）这一套术语，因此在日常英语里不常见，多出现在兽医、畜牧或生物学文献中。"]}
{"word":"Diogenean","summary":{"en":"Diogenean describes Diogenes-like Cynic simplicity and rejection of social conventions; it can also mean a follower of those ideals.","zh":"Diogenean 指“第欧根尼/犬儒派式”的简朴与反传统；也可指践行这种理念的人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Diogenes (especially Diogenes of Sinope) or to Cynic philosophy; marked by rejecting social conventions and valuing a simple, austere life.","zh":"与（尤其是锡诺普的）第欧根尼或犬儒学派有关的；强调拒绝社会习俗、崇尚简朴清苦生活的。"},"examples":[{"en":"His Diogenean lifestyle—few possessions and little concern for status—surprised his wealthy classmates.","zh":"他那种第欧根尼式的生活方式——几乎不占有物品、也不在意社会地位——让富裕的同学很吃惊。"},{"en":"The essay praises a Diogenean honesty that refuses polite lies.","zh":"这篇文章赞美一种第欧根尼式的诚实：拒绝“礼貌性的谎言”。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who follows or resembles Diogenes or Cynic ideals (simple living, sharp criticism of social norms).","zh":"信奉或表现出第欧根尼/犬儒派理念的人（简朴生活、尖锐批评社会规范）。"},"examples":[{"en":"Some called her a Diogenean for giving away most of her salary and living very simply.","zh":"有人称她为“第欧根尼式的人”，因为她把大部分工资捐出去，生活极为简朴。"}]}],"synonyms":["Cynic","cynical (in the philosophical sense)","ascetic","austere","spartan"],"phonetic":"/daɪˌɑːdʒəˈniːən/","extraExplanation":["“Diogenean”来自古希腊哲学家第欧根尼（Diogenes of Sinope）。他常被用来象征极端的简朴、对权势与虚伪礼仪的蔑视。常见故事包括：住在大陶缸里、白天提灯“找一个诚实的人”。","相关概念是“Cynic/ Cynicism（犬儒/犬儒主义）”：原意指一种强调自足与德性、反对虚荣的哲学传统；现代英语里 cynicism 常指“愤世嫉俗/不信任动机”，语气更负面，和古典犬儒派不完全相同。"]}
{"word":"diogenean","summary":{"en":"Diogenean means connected to Diogenes or Cynic philosophy—blunt, anti-materialistic, and simple; it can also mean a follower of that philosophy.","zh":"Diogenean 指与第欧根尼或犬儒学派相关，常形容直率、反物质主义、简朴禁欲；也可指该思想的追随者。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Diogenes of Sinope (an ancient Greek philosopher) or to Cynic philosophy; often describing a blunt, anti-materialistic, or ascetic attitude","zh":"与锡诺普的第欧根尼（古希腊哲学家）或犬儒学派有关的；常形容直言不讳、反物质主义、简朴禁欲的态度"},"examples":[{"en":"He admired her Diogenean honesty and her refusal to flatter powerful people.","zh":"他钦佩她那种“第欧根尼式”的坦率，以及她拒绝讨好权势人物。"},{"en":"The essay praises a Diogenean way of life: owning less and needing less.","zh":"这篇文章赞美一种“第欧根尼式”的生活方式：拥有更少、需求更少。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who follows or imitates Diogenes or Cynic philosophy","zh":"第欧根尼的追随者；犬儒学派的信奉者（或模仿者）"},"examples":[{"en":"In the novel, the old scholar becomes a Diogenean who laughs at social status.","zh":"在小说里，那位老学者变成了一个“第欧根尼式的人”，嘲笑社会地位。"}]}],"synonyms":["Cynic","cynical","ascetic","austere","spartan"],"phonetic":"/ˌdaɪəˈdʒiːniən/","extraExplanation":["“Diogenean”来自哲学家Diogenes（第欧根尼）。他以极端简朴著称：传说他住在大陶罐里，并公开讽刺虚伪与权力。英语里把这种直率、清贫、反世俗虚荣的姿态称为“Diogenean”。","注意别把它和“cynical（愤世嫉俗的、冷嘲的）”完全等同：日常英语的cynical常指不信任他人动机的消极态度；而“Diogenean/Cynic”原本更强调道德自足、反奢靡和敢说真话。"]}
{"word":"Diogenes","summary":{"en":"Diogenes is a famous ancient Greek Cynic philosopher, and the name can also describe someone who lives extremely simply and rejects social conventions.","zh":"Diogenes 指著名的古希腊犬儒学派哲学家第欧根尼，也可引申指极简生活、拒绝社会常规的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Diogenes (of Sinope) was an ancient Greek philosopher (c. 412–323 BCE), famous for living simply and for sharply criticizing social conventions; he is one of the best-known figures of the Cynic school.","zh":"第欧根尼（锡诺普的第欧根尼，约公元前412—323年）是古希腊哲学家，以极简生活方式和尖锐批评社会习俗闻名，是犬儒学派最著名的人物之一。"},"examples":[{"en":"Diogenes is often remembered for challenging people’s ideas about wealth and status.","zh":"第欧根尼常因挑战人们对财富与地位的观念而被人记住。"},{"en":"In class, we discussed Diogenes as a key figure in Cynicism.","zh":"课堂上，我们讨论了第欧根尼作为犬儒学派关键人物的意义。"}]},{"partOfSpeech":"n.","definition":{"en":"By extension, a person who lives very simply and bluntly rejects social norms (a “Diogenes-like” person).","zh":"引申义：指生活极其简朴、直率地拒绝社会常规的人（“像第欧根尼一样的人”）。"},"examples":[{"en":"He eats plainly, owns almost nothing, and speaks his mind—people joke that he’s a modern Diogenes.","zh":"他饮食朴素、几乎一无所有、想到什么就说什么——人们开玩笑说他是“现代第欧根尼”。"}]}],"synonyms":["Cynic","ascetic (similar idea)","nonconformist (similar idea)"],"phonetic":"/daɪˈɑːdʒəˌniːz/","extraExplanation":["“Diogenes”常与“犬儒学派（Cynicism）”联系在一起。这里的“Cynicism”原意更接近“崇尚自然、反对虚伪与奢华的简朴生活”，与现代英语里常见的“愤世嫉俗/不信任他人动机”的“cynical”含义有差别。","他最著名的轶事之一是“白天提灯找人”，据说他白天点着灯走在街上，说自己在“寻找一个真正诚实的人”。这常被用来象征对道德真诚的追问。","另一个常见故事是他对亚历山大大帝说“别挡住我的阳光”，用来表现他对权力与名望的不在意。英语里提到 Diogenes 时，常借这些故事表达“反虚荣、重自由与独立”的态度。"]}
{"word":"diogenes","summary":{"en":"Diogenes is best known as an ancient Greek Cynic philosopher famous for radical simplicity and criticizing social convention; the name also appears in the term “Diogenes syndrome.”","zh":"“Diogenes”最常指古希腊犬儒学派哲学家第欧根尼，以极简生活与批判社会虚伪闻名；该名字也出现在“第欧根尼综合征”一词中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Diogenes (of Sinope) was an ancient Greek philosopher, famous as a leading figure of Cynicism and for living simply while challenging social rules and hypocrisy.","zh":"第欧根尼（锡诺普的第欧根尼）是古希腊哲学家，以“犬儒学派”的代表人物闻名；他以极简生活方式、公开质疑社会规范与虚伪而著称。"},"examples":[{"en":"In philosophy class, we talked about Diogenes and the Cynics’ idea of living with as little as possible.","zh":"在哲学课上，我们谈到第欧根尼以及犬儒学派“尽量少占有”的生活理念。"},{"en":"Some people describe him as “a Diogenes figure” because he refuses luxury and speaks bluntly.","zh":"有些人把他形容为“第欧根尼式的人物”，因为他拒绝奢华、说话直白。"}]},{"partOfSpeech":"phrase","definition":{"en":"Diogenes syndrome: a non‑medical, everyday term for extreme self-neglect and severe hoarding, often seen in older adults (used cautiously because it can be stigmatizing).","zh":"“第欧根尼综合征”：一种日常用语（并非严格医学诊断），指极端自我忽视与严重囤积等状况，常见于老年人（使用时需谨慎，避免污名化）。"},"examples":[{"en":"The article mentioned “Diogenes syndrome,” but experts prefer more careful, clinical language.","zh":"文章提到“第欧根尼综合征”，但专家更倾向使用更严谨的临床表述。"}]}],"synonyms":["Diogenes of Sinope"],"phonetic":"/daɪˈɑːdʒəˌniːz/","extraExplanation":["第欧根尼常被提到的故事包括：白天提着灯“找一个诚实的人”；以及住在大陶缸里（常被误说成“桶”）。这些轶事用来强调犬儒学派对物质欲望与社会虚荣的讽刺。","Cynic（犬儒）在英语里既可指哲学传统（Cynicism），也常指日常语义里的“愤世嫉俗、爱冷嘲热讽”。谈到第欧根尼时，通常更偏向哲学意义。"]}
{"word":"Diogenes-like","summary":{"en":"Diogenes-like describes someone or something that is austerely simple and boldly, cynically frank—like the philosopher Diogenes.","zh":"Diogenes-like 形容“第欧根尼式”的：极简/禁欲、蔑视虚荣与权势，并且直言不讳、带犬儒式讽刺。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling Diogenes of Sinope: extremely simple or ascetic in lifestyle, and/or boldly cynical, blunt, and unimpressed by social status or luxury.","zh":"像（古希腊哲学家）第欧根尼那样的：生活极其简朴/禁欲的，且/或态度犬儒、直言不讳、不把名利与奢华当回事。"},"examples":[{"en":"He lived in a tiny room with almost no furniture—a Diogenes-like rejection of comfort.","zh":"他住在一间几乎没有家具的小房间里——这是一种“第欧根尼式”对舒适的拒绝。"},{"en":"Her Diogenes-like remarks cut through the ceremony and exposed everyone’s vanity.","zh":"她那些“第欧根尼式”的评论刺破了仪式感，揭露了大家的虚荣。"}]},{"partOfSpeech":"adj.","definition":{"en":"In literature or speech, suggesting sharp, moral critique of society, especially the pursuit of wealth, power, or reputation.","zh":"（文学/表达中）暗示对社会的尖锐道德批评，尤其针对对金钱、权力或名声的追逐。"},"examples":[{"en":"The essay takes a Diogenes-like stance toward consumer culture.","zh":"这篇文章对消费文化采取了“第欧根尼式”的立场。"},{"en":"The character’s Diogenes-like humor makes the rich look ridiculous.","zh":"这个角色“第欧根尼式”的幽默让富人显得可笑。"}]}],"synonyms":["cynic","cynical","ascetic","austere","spartan","anti-materialistic","blunt","plainspoken"],"phonetic":"/daɪˈɑdʒəˌniz laɪk/","extraExplanation":["“Diogenes-like”来自古希腊犬儒学派（Cynicism）的代表人物第欧根尼（Diogenes of Sinope）。他以极度简朴、蔑视权势与礼俗、当众揭穿虚伪而闻名。","常见典故：据说他白天提着灯在街上走，说是在“找一个真正诚实的人”；也有他对亚历山大大帝说“别挡住我的阳光”的故事。这些都强化了“无畏权威、直言真相”的含义。","注意：英语里的“cynical”常指“愤世嫉俗/不信人性”，而古典“Cynic（犬儒学派）”更强调“简朴自足、反虚伪、反奢华”。“Diogenes-like”更偏向后者，但语境里也可能带现代的讽刺意味。"]}
{"word":"Diogenian","summary":{"en":"Diogenian means “connected with Diogenes/Cynic philosophy,” often implying extreme simplicity and criticism of social conventions.","zh":"Diogenian 指“与第欧根尼/犬儒学派相关”，常含“极简生活、批评社会习俗”的意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Diogenes (especially Diogenes of Sinope) or to the Cynic philosophy associated with him; showing a very simple, anti-luxury, or sharply critical attitude toward social conventions.","zh":"与（尤其是锡诺普的）第欧根尼有关；或与其相关的犬儒学派思想有关；指生活极简、反对奢华、尖锐批评社会习俗的态度或风格。"},"examples":[{"en":"He admired a Diogenian kind of freedom—needing very little and fearing even less.","zh":"他钦佩一种“第欧根尼式”的自由——几乎不需要什么，也更少恐惧什么。"},{"en":"Her Diogenian humor mocked status and wealth.","zh":"她那种“第欧根尼式”的幽默嘲讽身份与财富。"}]},{"partOfSpeech":"n.","definition":{"en":"A follower of Diogenes or someone who lives in a Cynic, highly simple, convention-challenging way.","zh":"第欧根尼的追随者；或指以犬儒式极简、挑战常规的方式生活的人。"},"examples":[{"en":"Some friends called him a Diogenian because he kept his life intentionally sparse.","zh":"有些朋友叫他“第欧根尼派的人”，因为他刻意把生活过得很简朴。"}]}],"synonyms":["Cynic","Cynical (modern sense differs)","ascetic","austere","spartan"],"phonetic":"/ˌdaɪəˈdʒiːniən/","extraExplanation":["“Diogenian”来自古希腊哲学家第欧根尼（Diogenes）。他常被用来象征极简生活与对社会虚伪的讽刺；著名故事包括他住在大陶罐里、白天提灯“找一个诚实的人”，以及对亚历山大大帝说“别挡住我的阳光”。\n\n在英语里这个词非常少见，更常见的形容词是“Diogenic”（更偏学术）或直接说“Cynic/Cynical”（但注意：现代“cynical”多指消极地不信任他人动机，和古代“犬儒派”强调的清贫自足并不完全相同）。"]}
{"word":"Diogenic","summary":{"en":"Diogenic means “Diogenes-like”: blunt, anti-materialist, and associated with ancient Greek Cynicism.","zh":"Diogenic 指“像第欧根尼那样的”：直率、反物质崇尚简朴，并与古希腊犬儒学派相关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Diogenes of Sinope (a famous ancient Greek Cynic philosopher), or to the kind of blunt, anti-materialist, “back-to-basics” attitude associated with him.","zh":"与锡诺普的第欧根尼（古希腊犬儒学派哲学家）有关的；或指带有他那种直率、反物质、崇尚简朴的“犬儒式/第欧根尼式”态度。"},"examples":[{"en":"His Diogenic lifestyle—few possessions, simple meals, and little concern for status—surprised his wealthy classmates.","zh":"他那种第欧根尼式的生活方式——几乎没有财物、饮食简单、也不在乎地位——让富裕的同学很吃惊。"},{"en":"The essay praises a Diogenic honesty that refuses polite lies.","zh":"这篇文章赞扬一种第欧根尼式的诚实：拒绝客套的谎言。"},{"en":"Her humor is Diogenic: sharp, direct, and aimed at human vanity.","zh":"她的幽默很第欧根尼式：尖锐、直接，专门讽刺人的虚荣。"}]}],"synonyms":["Diogenes-like","Cynic","cynical","ascetic","austere"],"phonetic":"ˌdaɪəˈdʒɛnɪk","extraExplanation":["“Diogenic”在现代英语里非常少见，更常见的说法是“Diogenes-like”或“cynical / Cynic”（注意这里的Cynic常指古希腊“犬儒学派”，并不总等于现代口语里“愤世嫉俗”的那种消极冷嘲）。","文化背景：第欧根尼以极度简朴和讽刺权势闻名，常被讲述住在大陶罐里、公开挑战社会虚荣与礼仪的故事；因此“Diogenic”常带有“极简、反传统体面、直言不讳”的含义。","易混淆：如果你想表达地质/化学里的“成岩的”，常见词是“diagenetic / diagenic”，不是“Diogenic”。"]}
{"word":"diogenic","summary":{"en":"Diogenic describes something connected with Diogenes or the Cynic ideal of extreme simplicity and blunt criticism of social conventions.","zh":"Diogenic 指与第欧根尼或犬儒式理想相关：极简生活、直率批评社会习俗。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Diogenes (the ancient Greek Cynic philosopher) or to the Cynic way of life—simple, ascetic, and openly critical of social conventions.","zh":"与第欧根尼（古希腊“犬儒学派”哲学家）有关的；或指犬儒式的生活态度——简朴、禁欲、直言批评社会习俗。"},"examples":[{"en":"He admired her diogenic lifestyle: few possessions, simple meals, and no interest in status.","zh":"他很欣赏她那种“第欧根尼式”的生活：物品很少、饮食简单、对地位名声毫无兴趣。"},{"en":"The essay praises a diogenic honesty that refuses polite hypocrisy.","zh":"这篇文章称赞一种“第欧根尼式”的诚实：拒绝虚伪的客套。"}]}],"synonyms":["Diogenean","Diogenian","cynical (in the philosophical sense)","ascetic","austere"],"phonetic":"/daɪəˈdʒɛnɪk/","extraExplanation":["“Diogenic”比较少见，更常见的形容词是 **Diogenean / Diogenian**（同样指“第欧根尼式/犬儒式”）。","第欧根尼（Diogenes of Sinope）以极端简朴、嘲讽权贵与社会规范闻名；英语里提到“diogenic”通常带有“反物质主义、反虚伪、直言不讳”的文化含义。"]}
{"word":"diogenite","summary":{"en":"A diogenite is an orthopyroxene-rich achondrite meteorite, often linked to asteroid Vesta.","zh":"diogenite 指一种富含斜方辉石的无球粒陨石，常被认为与小行星灶神星有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of stony meteorite (an achondrite) made mostly of the mineral orthopyroxene; many diogenites are thought to come from the crust of the asteroid Vesta.","zh":"一种石质陨石（无球粒陨石），主要由斜方辉石构成；许多透辉无球粒陨石被认为来自小行星灶神星（Vesta）的地壳。"},"examples":[{"en":"Scientists classified the sample as a diogenite because it is rich in orthopyroxene.","zh":"科学家把这块样品归类为透辉无球粒陨石，因为它富含斜方辉石。"},{"en":"Diogenites are often studied alongside howardites and eucrites to understand Vesta’s history.","zh":"透辉无球粒陨石常与霍华德陨石和欧克陨石一起研究，用来理解灶神星的演化历史。"}]}],"synonyms":["HED meteorite (category)","achondrite (broader term)"],"phonetic":"/daɪˈoʊdʒəˌnaɪt/","extraExplanation":["“Diogenite”常缩写为HED陨石家族中的“D”，与 howardite（H）和 eucrite（E）并列。HED陨石被广泛认为与小行星4号灶神星有关。","词源上与古希腊哲学家“第欧根尼（Diogenes）”同形，但在陨石学里主要作为专门名词使用；学习时可把它理解为一种“特定成分的无球粒陨石类型”。"]}
{"word":"dioicous","summary":{"en":"Dioicous describes species (especially mosses) where male and female reproductive organs occur on separate individuals.","zh":"dioicous 指（尤指苔藓等）雌雄异株：雄性与雌性生殖器官分别在不同个体上。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially in bryophytes such as mosses) having male and female reproductive organs on separate individuals; needing two plants/organisms for sexual reproduction.","zh":"（尤用于苔藓等）雌雄异株的；雄性与雌性生殖器官分别长在不同个体上，需要两个个体才能完成有性繁殖。"},"examples":[{"en":"Many moss species are dioicous, with male and female plants growing separately.","zh":"许多苔藓是雌雄异株的，雄株与雌株分开生长。"},{"en":"In a dioicous population, you may need to find both sexes nearby to see sporophytes.","zh":"在雌雄异株的种群中，你可能需要在附近同时找到雌雄两性个体，才看得到孢子体。"}]}],"synonyms":["dioecious (closely related term, often used more broadly)","unisexual (in a loose sense)"],"phonetic":"/daɪˈɔɪkəs/","extraExplanation":["“dioicous”常见于苔藓植物（bryophytes）的描述；在更广泛的植物学语境里，常用的对应词是“dioecious（雌雄异株的）”。","对比记忆：monoicous（雌雄同株/同一植株上有两性生殖器官） vs. dioicous（雌雄异株）。","词源提示：前缀 di- 表示“两个/分开”，-oicous 与“居住/房屋（oikos）”相关，可理解为“两性住在不同‘房子/个体’里”。"]}
{"word":"dioicously","summary":{"en":"“Dioeciously” means in a dioecious way—male and female are on separate individuals.","zh":"“Dioeciously”指“雌雄异株地”，即雄性与雌性分属于不同个体。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"in a way that has separate male and female individuals (used mainly about plants and some animals)","zh":"（主要用于植物及少数动物）以雌雄异株的方式；雌雄分开的（副词）"},"examples":[{"en":"Holly trees grow dioeciously: some plants produce only pollen, while others produce berries.","zh":"冬青是雌雄异株生长的：有的植株只产花粉，有的植株结果（浆果）。"},{"en":"The species reproduces dioeciously, so you need both male and female plants to get fruit.","zh":"该物种以雌雄异株方式繁殖，所以要同时种公株和母株才能结果。"}]}],"synonyms":["in a dioecious manner"],"phonetic":"/daɪˈiːʃəsli/","extraExplanation":["你输入的“dioicously”更常见的标准拼写是 **dioeciously**（源自形容词 **dioecious**）。这是生物学/植物学术语：与 **monoeciously（雌雄同株）** 相对。","记忆小提示：**di-** 表示“两个/分开”，**-oecious** 与“居住/家（Greek oikos）”有关，可理解为“分居在不同‘个体’里”。"]}
{"word":"dioicousness","summary":{"en":"Dioicousness (more commonly spelled dioeciousness) means a species has male and female individuals separately.","zh":"dioicousness（更常见拼写为 dioeciousness）指雌雄异株：同一物种的雄性与雌性分别在不同个体上。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the condition of being dioecious; having male and female reproductive organs on separate individuals (separate plants or colonies) of the same species","zh":"雌雄异株性；指同一物种的雄性与雌性生殖器官分别存在于不同个体上（不同植株或群体）"},"examples":[{"en":"Kiwifruit shows dioeciousness, so growers usually plant both male and female vines.","zh":"猕猴桃具有雌雄异株性，所以种植者通常会同时种公株和母株。"},{"en":"Because of dioeciousness, only female plants produce fruit, but they need pollen from male plants.","zh":"由于雌雄异株性，只有雌株结果，但需要雄株提供花粉。"}]}],"synonyms":["dioecy","dioecious condition","unisexuality (in separate individuals)"],"phonetic":"/daɪˈiːʃəsnəs/","extraExplanation":["更常见的拼写是 **dioeciousness**（英式/学术写法），而 **dioicousness** 多见于变体或误拼；含义相同，常用于植物学、藻类学和苔藓植物等领域。","词根来自希腊语：*di-*（两、分开）+ *oikos*（家）。可以理解为“分家住”，雄株和雌株“住在不同个体上”。","常与 **monoeciousness**（雌雄同株性）对比：monoeciousness 指同一植株上同时有雄花和雌花（如玉米）。"]}
{"word":"diol","summary":{"en":"A diol is an alcohol that contains two –OH (hydroxyl) groups.","zh":"diol 指含有两个羟基（–OH）的醇类化合物，即“二醇”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (an alcohol) that has two hydroxyl groups (–OH) in each molecule","zh":"（化学）二醇；指分子中含有两个羟基（–OH）的醇类化合物"},"examples":[{"en":"Ethylene glycol is a common diol used in antifreeze.","zh":"乙二醇是一种常见的二醇，用于防冻液。"},{"en":"Some diols are used to make plastics and synthetic fibers.","zh":"一些二醇用于制造塑料和合成纤维。"},{"en":"In organic chemistry, diols can be produced by adding OH groups across a double bond.","zh":"在有机化学中，二醇可以通过在双键两端引入羟基来制备。"}]}],"synonyms":["glycol","dihydric alcohol"],"phonetic":"/ˈdaɪɔl/","extraExplanation":["“di-”表示“两个”，“-ol”表示“醇”。所以 diol 字面意思就是“有两个醇（羟基）官能团的化合物”。","常见类型包括：vicinal diol（邻二醇，两个 –OH 在相邻碳上）和 geminal diol（偕二醇，两个 –OH 在同一碳上；通常不稳定）。","有时你会看到更具体的名称，如 “1,2-propanediol（丙二醇）”，用数字标出两个 –OH 所在的位置。"]}
{"word":"diolefin","summary":{"en":"A diolefin is a hydrocarbon with two C=C double bonds (a diene).","zh":"diolefin 指含有两个 C=C 双键的烃（即二烯）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hydrocarbon (an olefin/alkene) that contains two carbon–carbon double bonds (C=C) in the same molecule; also called a diene","zh":"二烯烃：一种含有两个碳-碳双键（C=C）的烯烃（烃类）分子；也叫 diene（“二烯”）"},"examples":[{"en":"1,3-Butadiene is a common diolefin used to make synthetic rubber.","zh":"1,3-丁二烯是一种常见的二烯烃，用来制造合成橡胶。"},{"en":"Diolefin compounds can react easily because they have two double bonds.","zh":"二烯烃因为有两个双键，所以通常更容易发生反应。"}]}],"synonyms":["diene","alkadiene"],"phonetic":"/daɪˈoʊləfɪn/","extraExplanation":["“diolefin”多见于化学/材料科学语境，比日常用语更偏专业；在有机化学里更常用的同义词是“diene（二烯）”。","二烯烃常用于聚合反应（如合成橡胶、塑料单体），因为双键提供了反应位点；不同结构（共轭二烯 vs. 非共轭二烯）会影响反应性与产物性质。"]}
{"word":"diolefine","summary":{"en":"Diolefine (more commonly spelled diolefin) means a hydrocarbon with two C=C double bonds (a diene).","zh":"Diolefine（更常见拼写为 diolefin）指含两个碳碳双键的烃，也就是二烯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hydrocarbon that contains two carbon–carbon double bonds; a diene (used mainly in chemistry).","zh":"含有两个碳-碳双键的烃；二烯（主要用于化学语境）。"},"examples":[{"en":"1,3-Butadiene is a diolefin used to make synthetic rubber.","zh":"1,3-丁二烯是一种二烯（双烯烃），常用于制造合成橡胶。"},{"en":"Diolefin molecules can react easily because they have two double bonds.","zh":"双烯烃分子因为有两个双键，往往更容易发生反应。"}]}],"synonyms":["diolefin","diene"],"phonetic":"/daɪˈoʊləfɪn/","extraExplanation":["“diolefine”更常见的英语写法是“diolefin”（美式/化学文献中常用），含义与“diene（二烯）”基本相同。“diolefine”可能出现在非英语资料、旧译法或拼写变体中。","二烯在工业上很重要：例如丁二烯用于合成橡胶；异戊二烯与天然橡胶的结构相关。"]}
{"word":"diolefinic","summary":{"en":"“Diolefinic” describes a chemical compound that contains two carbon–carbon double bonds (two alkene/olefin units).","zh":"“diolefinic”指含有两个碳-碳双键（两个烯烃/烯基单元）的化合物，即二烯性质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Having two carbon–carbon double bonds; containing two olefin (alkene) groups.","zh":"（化学）二烯的；含有两个碳-碳双键的；含两个烯烃（烯基）基团的。"},"examples":[{"en":"1,3-butadiene is a diolefinic compound used to make synthetic rubber.","zh":"1,3-丁二烯是一种二烯类（diolefinic）化合物，可用于制造合成橡胶。"},{"en":"Diolefinic monomers can undergo polymerization to form long-chain plastics.","zh":"二烯类单体可以发生聚合反应，形成长链塑料。"},{"en":"The diolefinic structure makes the molecule more reactive than a simple alkene.","zh":"二烯结构使该分子比简单烯烃更活泼。"}]}],"synonyms":["diene","dienic","diunsaturated"],"phonetic":"/ˌdaɪ.oʊləˈfɪnɪk/","extraExplanation":["“diolefinic”主要用于有机化学/材料科学文献。它等同于“diene”的性质描述：di-（两个）+ olefin（烯烃）。常见相关词：conjugated diene（共轭二烯）、isolated diene（隔离二烯）、cumulated diene（累积二烯，如allene）。","在工业语境中，经常会提到diolefinic monomers（如丁二烯、异戊二烯）与聚合物（橡胶、塑料）生产相关。"]}
{"word":"diolefins","summary":{"en":"“Diolefins” are hydrocarbons with two C=C double bonds (plural).","zh":"“Diolefins”指含两个碳碳双键的烃（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) Unsaturated hydrocarbons that contain two carbon–carbon double bonds; plural of “diolefin.”","zh":"（化学）含有两个碳—碳双键的不饱和烃；“diolefin（双烯）”的复数。"},"examples":[{"en":"Diolefins such as butadiene are important raw materials for making synthetic rubber.","zh":"像丁二烯这样的双烯是制造合成橡胶的重要原料。"},{"en":"In the lab, we handled diolefins carefully because they can react readily with oxygen.","zh":"在实验室里，我们小心处理双烯，因为它们可能很容易与氧气发生反应。"}]}],"synonyms":["dienes","conjugated dienes (type)","unsaturated hydrocarbons (broader)"],"phonetic":"/daɪˈoʊləfɪnz/","extraExplanation":["“diolefin”也常写作“diene（双烯）”。在有机化学中，双烯常按双键位置分类：共轭双烯（conjugated，如1,3-丁二烯）、累积双烯（cumulated，如丙二烯/allenes）、隔离双烯（isolated）。这些结构差异会影响稳定性与反应性。"]}
{"word":"diols","summary":{"en":"Diols are organic compounds with two –OH (hydroxyl) groups.","zh":"Diols 指含有两个 –OH（羟基）的有机化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of diol: an organic compound that has two hydroxyl (–OH) groups.","zh":"diol 的复数：一种含有两个羟基（–OH）的有机化合物。"},"examples":[{"en":"Many polymers are made using diols and dicarboxylic acids.","zh":"许多聚合物是用二元醇（diols）和二羧酸制成的。"},{"en":"Ethylene glycol and propylene glycol are common diols used in industry.","zh":"乙二醇和丙二醇是工业中常见的二元醇。"}]}],"synonyms":["glycols (common for 1,2-diols)","dihydric alcohols"],"phonetic":"/ˈdaɪɔl/","extraExplanation":["在有机化学里，diol 常译为“二元醇”。“di-”表示“两个”，“-ol”表示“醇”（含 –OH）。常见用途包括：做防冻液（如乙二醇）、做溶剂/保湿剂（如丙二醇）、以及作为制造聚酯等材料的原料。","发音上，diol 常读作“DYE-ol”（重音在前）。"]}
{"word":"diomate","summary":{"en":"“Dominate” means to control or strongly influence, or to be the most noticeable/important feature.","zh":"“dominate”表示“支配/主导、强烈影响”，也可表示“在某方面最显眼/最重要”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to have power and control over someone or something; to rule or strongly influence","zh":"支配；统治；对……有强大控制或影响"},"examples":[{"en":"The company dominates the local market.","zh":"这家公司主导本地市场。"},{"en":"He didn’t want to dominate the conversation, so he asked others questions.","zh":"他不想主导谈话，所以他问了别人一些问题。"},{"en":"In some families, one person may dominate decision-making.","zh":"在一些家庭里，可能有一个人支配所有决定。"}]},{"partOfSpeech":"v.","definition":{"en":"to be much more noticeable, important, or powerful than others; to stand out as the main feature","zh":"占据显著地位；显得最重要/最突出"},"examples":[{"en":"A tall clock tower dominates the skyline.","zh":"一座高高的钟楼在天际线中格外醒目。"},{"en":"The color red dominates this painting.","zh":"这幅画以红色为主色调。"}]}],"synonyms":["control","rule","lead","govern","overpower","influence","prevail"],"phonetic":"/ˈdɑːməˌneɪt/","extraExplanation":["“diomate”不是常见英文单词，最可能是拼写想表达 **dominate**（少了一个 n）。如果你原本想查的是别的词（例如 *diplomate* 或其他），告诉我你看到它的句子，我可以帮你准确判断。","词源提示：*dominate* 来自拉丁语 *dominus*（“主人”），所以它常带有“控制/主导”的语感。在人际语境里，有时会显得偏强势。更中性的表达可以用 *lead*（带领）、*influence*（影响）或 *be the main feature*（成为主要特征）。"]}
{"word":"Diomede","summary":{"en":"Diomede is a proper noun used for (1) a myth-related name (often connected to Diomedes of the Iliad) and (2) the Diomede Islands in the Bering Strait.","zh":"Diomede 是专有名词：可指（1）与希腊神话相关的名字（常与《伊利亚特》的 Diomedes 相关），也可指（2）白令海峡的迪奥米德群岛。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a name from Greek mythology, best known through figures like Diomedes, a hero in Homer’s Iliad (\"Diomede\" is sometimes used as a variant form in English or in naming).","zh":"一个源自希腊神话的名字，最常见与“狄俄墨得斯（Diomedes）”相关——《伊利亚特》中的英雄；英语中“Diomede”有时作为变体拼写或用于命名。"},"examples":[{"en":"In some retellings, Diomede/Diomedes is portrayed as a brave and strategic Greek warrior.","zh":"在一些改写版本中，Diomede/Diomedes 被描写为勇敢且善于谋略的希腊战士。"},{"en":"The name Diomede appears in discussions of Homeric heroes and ancient Greek legend.","zh":"在讨论荷马史诗英雄与古希腊传说时，常会提到 Diomede 这个名字。"}]},{"partOfSpeech":"n.","definition":{"en":"Diomede (as in the Diomede Islands): two islands in the Bering Strait between Alaska (USA) and Russia—Big Diomede (Russia) and Little Diomede (USA).","zh":"迪奥米德（如“迪奥米德群岛”）：位于白令海峡、介于阿拉斯加（美国）与俄罗斯之间的两座岛屿——大迪奥米德岛（俄罗斯）与小迪奥米德岛（美国）。"},"examples":[{"en":"The Diomede Islands sit between the United States and Russia in the Bering Strait.","zh":"迪奥米德群岛位于白令海峡，介于美国与俄罗斯之间。"},{"en":"Little Diomede is part of Alaska, while Big Diomede belongs to Russia.","zh":"小迪奥米德岛属于阿拉斯加，而大迪奥米德岛属于俄罗斯。"}]}],"synonyms":["Diomedes","Diomede Islands","Big Diomede","Little Diomede"],"phonetic":"/ˌdaɪəˈmiːdi/","extraExplanation":["拼写提示：更常见的神话人物写作 Diomedes（狄俄墨得斯）。你输入的 Diomede 有时会出现在英文资料中，可能是简化、变体拼写，或与地名（Diomede Islands）直接相关。","文化背景：在《伊利亚特》中，Diomedes 是希腊联军的重要英雄之一，常被用来象征勇武与机智；因此这个名字在文学、历史讨论中具有“古典/史诗”色彩。"]}
{"word":"Diomedea","summary":{"en":"Diomedea is a scientific genus name for several large albatross species.","zh":"Diomedea 是若干大型信天翁的科学属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of large seabirds (albatrosses), including the “great albatrosses,” known for very long wings and long-distance ocean flight","zh":"信天翁属（大型海鸟的一属，包含“巨型信天翁”等），以翼展很长、能进行远距离海上飞行为特征"},"examples":[{"en":"The wandering albatross belongs to the genus Diomedea.","zh":"漂泊信天翁属于信天翁属（Diomedea）。"},{"en":"Researchers tracked Diomedea birds as they crossed the Southern Ocean.","zh":"研究人员追踪信天翁属（Diomedea）的鸟类穿越南大洋。"}]}],"synonyms":["albatross (general term)","great albatrosses (group)"],"phonetic":"/ˌdaɪəˈmiːdiə/","extraExplanation":["“Diomedea”是拉丁化的学名（属名），常见于生物学、鸟类学与自然纪录片中；日常英语里人们更常直接说“albatross（信天翁）”。","这个属名源自希腊神话人物“Diomedes（狄俄墨得斯）”的名字：在西方命名传统中，许多动植物的学名会借用神话人物或古典典故。"]}
{"word":"diomedea","summary":{"en":"Diomedea is a scientific (genus) name connected with the great albatrosses, commonly found in older or technical sources.","zh":"Diomedea 是与大型信天翁相关的科学属名，常见于较旧或专业资料中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former scientific genus name for the great albatrosses (very large seabirds), often seen in older books; today many of these species are usually placed in the genus *Diomedea* in a narrower sense or split into related genera, depending on the classification.","zh":"（旧或较宽泛用法的）信天翁属的学名，指体型很大的信天翁类海鸟；在一些分类体系中该属的范围曾有变化，如今多以较狭义的 *Diomedea* 或拆分到相关属中（视分类而定）。"},"examples":[{"en":"In older field guides, the wandering albatross may be listed under the genus *Diomedea*.","zh":"在较旧的野外图鉴里，漂泊信天翁可能会被列在 *Diomedea* 这个属名之下。"},{"en":"Scientists discuss whether some species belong in *Diomedea* or in closely related genera.","zh":"科学家会讨论某些物种应归入 *Diomedea* 还是归入近缘属。"}]}],"synonyms":["albatross genus","*Diomedea*"],"phonetic":"/ˌdaɪ.oʊˈmiːdi.ə/","extraExplanation":["“Diomedea”来自希腊神话人物狄俄墨得斯（Diomedes）的名字；属名常用来致敬或借用神话/历史人物。","这是拉丁化的科学名称：属名首字母大写并常用斜体书写（*Diomedea*）。不同年代或不同权威机构的鸟类分类可能略有差异，因此你会在资料中看到它的“范围”变化。"]}
{"word":"Diomedeidae","summary":{"en":"Diomedeidae is the scientific family name for albatrosses.","zh":"Diomedeidae 是信天翁（albatrosses）的科学科名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific family name for the albatrosses—very large ocean seabirds known for long, effortless gliding flight.","zh":"（生物分类）信天翁科：指信天翁这一类大型海洋鸟类的科名，以长距离滑翔飞行著称。"},"examples":[{"en":"The wandering albatross belongs to the family Diomedeidae.","zh":"漂泊信天翁属于信天翁科（Diomedeidae）。"},{"en":"Researchers compared the wing shapes of Diomedeidae to other seabirds.","zh":"研究人员将信天翁科（Diomedeidae）的翼形与其他海鸟进行了比较。"}]}],"synonyms":["albatross family"],"phonetic":"/ˌdaɪoʊˈmiːdi.əˌdiː/","extraExplanation":["这是拉丁化的学名（科名），常见于鸟类学、生态学论文或博物馆标本标签中；日常英语更常说 albatross / albatrosses，而不是直接用 Diomedeidae。","词源上与古希腊神话人物 Diomedes（狄俄墨得斯）有关：不少早期动物分类学名称会借用神话或历史人物来命名。"]}
{"word":"diomedeidae","summary":{"en":"Diomedeidae is the scientific family name for albatrosses.","zh":"Diomedeidae 是“信天翁科”的学名（即信天翁这一类海鸟所属的科）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of very large seabirds called albatrosses, known for long wings and long-distance flight over the ocean","zh":"信天翁科（大型海鸟的一科），以长翅和在海洋上长距离飞行著称"},"examples":[{"en":"Albatrosses belong to the family Diomedeidae.","zh":"信天翁属于信天翁科（Diomedeidae）。"},{"en":"Scientists studied Diomedeidae to understand how these birds travel thousands of miles without landing.","zh":"科学家研究信天翁科，以了解这些鸟如何在不着陆的情况下飞行数千英里。"}]}],"synonyms":["albatross family"],"phonetic":"/ˌdaɪəˈmiːdiˌaɪdiː/","extraExplanation":["“Diomedeidae”是生物分类学里的拉丁化学名，常见于科普文章、学术论文或鸟类图鉴中；日常英语更常说“albatrosses（信天翁）”。","词源与希腊神话有关：名字来自“Diomedes（狄俄墨得斯）”，传说中他的同伴被变成鸟，与海鸟形象相联系。"]}
{"word":"Diomedes","summary":{"en":"Diomedes is a famous Greek mythological hero and king of Argos who fights in the Trojan War, especially in Homer’s *Iliad*.","zh":"Diomedes（狄俄墨得斯）是希腊神话中的著名英雄与阿尔戈斯国王，参加特洛伊战争，尤其在荷马《伊利亚特》中很重要。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hero in Greek mythology: a Greek warrior and king of Argos who fights in the Trojan War (especially in Homer’s *Iliad*), known for courage and skill in battle.","zh":"希腊神话人物：阿尔戈斯（Argos）的国王、特洛伊战争中的希腊英雄（尤见于荷马《伊利亚特》），以勇敢与战斗技巧著称。"},"examples":[{"en":"In the *Iliad*, Diomedes is one of the strongest Greek fighters on the battlefield.","zh":"在《伊利亚特》中，狄俄墨得斯是战场上最强大的希腊战士之一。"},{"en":"Many stories describe Diomedes as fearless, even when facing powerful enemies.","zh":"许多故事把狄俄墨得斯描写成无所畏惧的英雄，即使面对强大的敌人也不退缩。"}]}],"synonyms":["Greek hero","warrior (figurative)"],"phonetic":"/daɪˈɑməˌdiːz/","extraExplanation":["“Diomedes”源自希腊语形式（常见拉丁转写为 Diomedes / Diomēdēs），在英语里通常指《伊利亚特》中那位阿开亚（希腊联军）英雄。","文学与文化中，他常被用作“勇武、战功显赫的战士”的典型形象；在古典学或西方文学讨论中出现频率较高。"]}
{"word":"diomedes","summary":{"en":"Diomedes usually refers to a Greek hero of the Trojan War; it can also refer to a Thracian king with man-eating horses in another myth.","zh":"Diomedes 通常指特洛伊战争的希腊英雄狄俄墨得斯；也可能指另一则神话中色雷斯国王、拥有食人马的狄俄墨得斯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) A major hero in the Trojan War, a king of Argos, famous in Homer’s *Iliad* for his courage and for wounding the gods Ares and Aphrodite with Athena’s help.","zh":"（希腊神话）特洛伊战争中的重要英雄之一，阿尔戈斯（Argos）的国王；在荷马《伊利亚特》中以英勇著称，并在雅典娜帮助下刺伤战神阿瑞斯与爱神阿佛洛狄忒。"},"examples":[{"en":"In the *Iliad*, Diomedes is one of the strongest Greek fighters on the battlefield.","zh":"在《伊利亚特》中，狄俄墨得斯是战场上最强悍的希腊战士之一。"},{"en":"Athena guides Diomedes, allowing him to strike even a god during the fight.","zh":"雅典娜指引狄俄墨得斯，使他在战斗中甚至能攻击到神明。"}]},{"partOfSpeech":"n.","definition":{"en":"(Greek mythology, less common) A different figure named Diomedes, a Thracian king known for keeping man-eating horses (often mentioned in the story of Hercules’ Labor).","zh":"（希腊神话，较不常见）另一位同名人物：色雷斯（Thrace）的国王狄俄墨得斯，以饲养食人马闻名（常见于赫拉克勒斯“十二功绩”的故事中）。"},"examples":[{"en":"Hercules captures the man-eating horses of Diomedes as one of his labors.","zh":"赫拉克勒斯在十二功绩之一中捕获了狄俄墨得斯的食人马。"},{"en":"Be careful: this Diomedes is not the same as the Trojan War hero.","zh":"注意：这个狄俄墨得斯与特洛伊战争的英雄并不是同一人。"}]}],"phonetic":"/daɪˈɑːmədiːz/","extraExplanation":["“Diomedes”来自古希腊语名字，常见于英文文学与艺术评论中，用作典故（allusion）。如果你在阅读《伊利亚特》或讨论“特洛伊战争诸英雄”时看到 Diomedes，通常指阿尔戈斯国王那位；若出现“食人马/赫拉克勒斯的功绩”，则多半指色雷斯国王那位。"]}
{"word":"Dion","summary":{"en":"Dion is most commonly a person’s name (given name or surname); it can also refer to an ancient city in Greece called Dion.","zh":"Dion 最常见是人名（名字或姓氏）；也可指希腊的一座古城“狄翁”（Dion）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name (usually masculine) and a family name; used for people in English-speaking and other cultures.","zh":"人名（多为男性名）或姓氏；在英语国家及其他文化中使用。"},"examples":[{"en":"Dion is my classmate from New York.","zh":"Dion 是我来自纽约的同学。"},{"en":"I’m reading a biography of Dion Waiters.","zh":"我正在读一部关于迪昂·韦特斯（Dion Waiters）的传记。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name, especially Dion, an ancient city in northern Greece near Mount Olympus.","zh":"地名，尤指希腊北部奥林匹斯山附近的古城“狄翁”（Dion）。"},"examples":[{"en":"They visited Dion to see the archaeological park.","zh":"他们去狄翁参观了考古公园。"},{"en":"Dion was an important religious center in ancient Macedonia.","zh":"在古代马其顿，狄翁是一个重要的宗教中心。"}]}],"synonyms":["Dionysius (related name)","Dionysos (related root)","Deon (similar spelling)"],"phonetic":"/ˈdaɪən/","extraExplanation":["“Dion”作人名时在英语里常读作 /ˈdaɪən/（类似“DIE-uhn”）。不同语言或地区可能会有不同读法。","名字来源上，“Dion”有时被视为希腊语名字的缩写或变体（如 Dionysius / Dionysos 相关），但在现代更多是独立使用的名字。","作为地名的 Dion（狄翁）与古希腊宗教有关，靠近奥林匹斯山，因此在历史与考古语境中较常见。"]}
{"word":"dion","summary":{"en":"Dion is mainly used as a person’s name (first or last name) and can also refer to the American singer Dion DiMucci.","zh":"Dion 主要用作人名（名或姓），也可以指美国歌手 Dion DiMucci。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a given name (first name) or family name; used in English-speaking contexts and also common in French and Greek-related naming traditions","zh":"人名（名或姓）；在英语语境中使用，也常见于法语与带有希腊文化背景的命名传统"},"examples":[{"en":"Dion is my cousin’s first name.","zh":"Dion 是我表弟的名字。"},{"en":"I met a professor named Dion at the conference.","zh":"我在会议上认识了一位叫 Dion 的教授。"},{"en":"Her last name is Dion.","zh":"她的姓是 Dion。"}]},{"partOfSpeech":"other","definition":{"en":"Dion: a well-known American singer (Dion DiMucci), famous for early rock and doo-wop hits such as “Runaround Sue”","zh":"Dion：美国知名歌手（Dion DiMucci），以早期摇滚与 doo-wop 风格歌曲闻名，如《Runaround Sue》"},"examples":[{"en":"My dad still listens to Dion’s old songs.","zh":"我爸现在还会听 Dion 的老歌。"},{"en":"“Runaround Sue” is a classic hit by Dion.","zh":"《Runaround Sue》是 Dion 的经典热门歌曲。"}]}],"synonyms":["Deon (variant spelling)","Dionne (related name form)"],"phonetic":"/diˈɑn/","extraExplanation":["“Dion”在不同文化中读音可能不同：在美式英语里常见读法接近“dee-ON”；在法语里可能更接近鼻化的“dyon”。如果你是在点名或自我介绍，最好直接询问对方偏好的发音。","词源/文化小背景：在希腊语相关的人名传统里，Dion 常与“神/宙斯（Zeus）”有关（如地名 Dion、含义与“属于宙斯”相关的名字元素）。"]}
{"word":"Dionaea","summary":{"en":"Dionaea is the scientific genus name for the Venus flytrap and related carnivorous plants.","zh":"Dionaea 是捕蝇草及相关食虫植物的属名（学名用语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of carnivorous plants best known for containing the Venus flytrap (Dionaea muscipula).","zh":"一种食虫植物属，最著名的是包含捕蝇草（Dionaea muscipula）。"},"examples":[{"en":"Dionaea is famous because it includes the Venus flytrap.","zh":"Dionaea 因为包含捕蝇草而闻名。"},{"en":"In our biology class, we studied how Dionaea traps insects for nutrients.","zh":"在生物课上，我们学习了 Dionaea 如何捕捉昆虫来获取养分。"}]}],"synonyms":["Venus flytrap (common name, for Dionaea muscipula)","Dionaea muscipula (the best-known species)"],"phonetic":"/ˌdaɪəˈniːə/","extraExplanation":["“Dionaea”是拉丁化的学名，常见于植物学/生物学语境；日常英语里人们更常说“Venus flytrap（捕蝇草）”。","名称与希腊神话中的“Dione（狄俄涅）”有关；捕蝇草的英文名“Venus flytrap”则借用了罗马神话中的爱神“Venus（维纳斯）”。"]}
{"word":"dionaea","summary":{"en":"Dionaea is the scientific genus name for the Venus flytrap and its close relatives.","zh":"Dionaea 是捕蝇草（及其近缘植物）的科学属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of carnivorous plants that includes the Venus flytrap (Dionaea muscipula).","zh":"捕蝇草属；一种食虫植物的属名，其中最著名的是捕蝇草（Dionaea muscipula）。"},"examples":[{"en":"Dionaea muscipula is commonly known as the Venus flytrap.","zh":"Dionaea muscipula 通常被称为“捕蝇草”。"},{"en":"The greenhouse has a small Dionaea section for carnivorous plant enthusiasts.","zh":"温室里有一小块捕蝇草属植物区，供食虫植物爱好者参观。"}]}],"synonyms":["Venus flytrap"],"phonetic":"/ˌdaɪoʊˈniːə/","extraExplanation":["“Dionaea”是植物学中的拉丁化属名，日常英语里更常见的说法是“Venus flytrap（捕蝇草）”。在非专业语境中，人们通常不会用属名来称呼单株植物，除非是在科普、园艺或学术讨论里。","发音上常见读法接近“die-oh-NEE-uh”。拼写里“ae”在现代英语读音中通常并不分别读成两个清晰元音，这也是很多人初见时会读错的原因。"]}
{"word":"Dionaeaceae","summary":{"en":"Dionaeaceae is an older/less common family name referring to the Venus flytrap group, now usually placed in Droseraceae.","zh":"Dionaeaceae 是较旧/较少用的科名，指捕蝇草类群；现代多并入茅膏菜科（Droseraceae）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a former/alternative scientific family name for the Venus flytrap and its close relatives (now usually treated within the sundew family, Droseraceae)","zh":"（旧称/另称）指捕蝇草及其近缘植物的一个科名；现多并入茅膏菜科（Droseraceae）"},"examples":[{"en":"Older botany books may list the Venus flytrap under the family Dionaeaceae.","zh":"较早的植物学书籍可能会把捕蝇草列入 Dionaeaceae（捕蝇草科）。"},{"en":"In modern classifications, plants once placed in Dionaeaceae are typically included in Droseraceae.","zh":"在现代分类中，过去归入 Dionaeaceae 的植物通常并入茅膏菜科（Droseraceae）。"}]}],"synonyms":["Droseraceae (modern placement/related family)"],"phonetic":"ˌdaɪəˈniːeɪəsiˌiː","extraExplanation":["“Dionaeaceae”多见于较旧的分类体系（或在一些资料中的替代用名），核心成员是捕蝇草（Venus flytrap，学名 Dionaea muscipula）。随着分子系统学与分类观点更新，Dionaea 等常被并入 Droseraceae（茅膏菜科），因此你在新教材/数据库里更常看到 Droseraceae。","词形上常可分解理解：Dionaea（捕蝇草属名，源自古典神话中与“狄俄涅/维纳斯”相关的命名传统）+ -aceae（植物“科”的拉丁后缀，表示“……科”）。"]}
{"word":"dionaeaceae","summary":{"en":"Dionaeaceae is an older/less common botanical family name for certain carnivorous plants (notably the Venus flytrap), often treated today as part of Droseraceae.","zh":"Dionaeaceae 是一个较旧/较少使用的食虫植物科名（以捕蝇草为代表），在现代分类中常并入茅膏菜科（Droseraceae）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Botany) A former/less common plant family name for certain carnivorous plants, especially the Venus flytrap (Dionaea) and the waterwheel plant (Aldrovanda). In many modern classifications, these plants are placed in the family Droseraceae.","zh":"（植物学）一个较旧/较少使用的植物科名，指某些食虫植物，尤其是捕蝇草属（Dionaea）与狸藻轮草属/轮叶藻属（水轮草属，Aldrovanda）。在许多现代分类系统中，这些植物多被归入茅膏菜科（Droseraceae）。"},"examples":[{"en":"In older botany texts, the Venus flytrap was sometimes listed under Dionaeaceae.","zh":"在较旧的植物学教材里，捕蝇草有时会被列在 Dionaeaceae（狄奥奈科/捕蝇草科）之下。"},{"en":"Some references treat Dionaeaceae as a separate family, but others merge it into Droseraceae.","zh":"有些资料把 Dionaeaceae 当作独立科，但也有资料将其并入茅膏菜科（Droseraceae）。"}]}],"synonyms":["Droseraceae (modern classification, often used instead)"],"phonetic":"/daɪˌoʊniˈeɪsi.iː/","extraExplanation":["词源提示：Dionaeaceae 来自属名 Dionaea（捕蝇草属），再加上植物科名常见后缀 -aceae（“……科”）。","使用场景：这个词多见于分类学讨论、旧版植物志或学术对照表；日常科普通常直接说 Venus flytrap（捕蝇草）或用现代科名 Droseraceae（茅膏菜科）。"]}
{"word":"Dione","summary":{"en":"Dione is a name used for (1) a Greek mythological goddess linked to Zeus, and (2) one of Saturn’s moons.","zh":"Dione 指（1）希腊神话中与宙斯相关的一位女神；以及（2）土星的一颗卫星“狄俄涅”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, a goddess (often described as a Titaness) whose name is associated with Zeus; in some traditions she is the mother of Aphrodite.","zh":"（希腊神话）狄俄涅：一位女神（常被视为泰坦神族），与宙斯有关；在某些传说中她被认为是阿佛洛狄忒（爱神）的母亲。"},"examples":[{"en":"In one version of the myth, Aphrodite is described as the daughter of Zeus and Dione.","zh":"在某个版本的神话中，阿佛洛狄忒被描述为宙斯与狄俄涅的女儿。"},{"en":"Dione appears in ancient stories connected to the oracle at Dodona.","zh":"狄俄涅出现在与多多那神谕有关的古代传说中。"}]},{"partOfSpeech":"n.","definition":{"en":"A moon of Saturn, named after the mythological figure Dione.","zh":"（天文学）土星的卫星之一“狄俄涅”（Dione），以神话人物狄俄涅命名。"},"examples":[{"en":"The Cassini spacecraft sent back detailed images of Saturn’s moon Dione.","zh":"卡西尼号探测器传回了土星卫星狄俄涅的清晰图像。"},{"en":"Dione’s icy surface shows bright streaks and impact craters.","zh":"狄俄涅的冰质表面可见明亮条纹与撞击坑。"}]}],"phonetic":"/daɪˈoʊni/","extraExplanation":["“Dione”源自希腊语名字，和“Zeus（宙斯）”同属词根体系，带有“神/天神”的含义背景。在古希腊传统中，她有时被视为宙斯的女性对应者或配偶形象之一。","不同古典作者对阿佛洛狄忒的身世说法不一：较有名的版本是她从海中泡沫诞生；但在《伊利亚特》等传统里，也出现“宙斯与狄俄涅之女”的说法。","天文学中用神话人物为天体命名很常见；土星的多颗卫星都以泰坦或相关神话人物命名，因此“Dione（狄俄涅）”也沿用这一命名传统。"]}
{"word":"dione","summary":{"en":"Dione is a name used for a Greek mythological goddess/Titaness and for a moon of Saturn.","zh":"Dione 既指希腊神话中的女神/泰坦女神，也指土星的一颗卫星。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, Dione is a goddess or Titaness. In some traditions she is the mother of Aphrodite (the goddess of love).","zh":"在希腊神话中，Dione（狄俄涅）是一位女神或泰坦女神。在一些传统里，她被视为阿佛洛狄忒（爱与美之神）的母亲。"},"examples":[{"en":"In the Iliad, Aphrodite goes to Dione for comfort after being wounded.","zh":"在《伊利亚特》中，阿佛洛狄忒受伤后去找Dione安慰。"},{"en":"Some myths describe Dione as a partner of Zeus.","zh":"有些神话把Dione描写为宙斯的伴侣之一。"}]},{"partOfSpeech":"n.","definition":{"en":"Dione is also the name of a moon of Saturn.","zh":"Dione 也是土星的一颗卫星（狄俄涅卫星）的名字。"},"examples":[{"en":"NASA’s images show Dione has bright icy cliffs and a heavily cratered surface.","zh":"NASA 的影像显示，狄俄涅卫星有明亮的冰崖和布满陨石坑的表面。"},{"en":"Dione orbits Saturn along with moons like Enceladus and Rhea.","zh":"狄俄涅卫星与恩克拉多斯（土卫二）和瑞亚（土卫五）等一起绕土星运行。"}]}],"synonyms":["(mythology) Titaness","(astronomy) Saturn’s moon"],"phonetic":"/daɪˈoʊni/","extraExplanation":["“Dione”是专有名词，常见于两类语境：①古希腊神话（尤其在荷马史诗等文本中出现）；②天文学（指土星的卫星之一）。阅读时可根据上下文判断。","词源来自古希腊语 Διώνη（Diṓnē），与“Zeus（宙斯）”相关的词根有联系，因此在部分传统中她与宙斯的关系被特别强调。"]}
{"word":"dionin","summary":{"en":"Dionin is an older brand name for ethylmorphine, an opioid drug once used for cough and pain.","zh":"Dionin 是乙基吗啡的旧商标名之一，曾用于止咳和镇痛的阿片类药物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand name (and older term) for ethylmorphine, an opioid medicine formerly used to relieve cough and pain","zh":"（商标名/旧称）乙基吗啡；一种阿片类药物，过去曾用于止咳和镇痛"},"examples":[{"en":"The old medical record listed Dionin as a cough medicine.","zh":"那份旧病历把 Dionin 记作一种止咳药。"},{"en":"Today, doctors use safer options instead of drugs like Dionin in many places.","zh":"如今在很多地方，医生会用更安全的选择来替代像 Dionin 这样的药物。"}]}],"synonyms":["ethylmorphine","Dionine"],"phonetic":"/ˈdaɪəˌnɪn/","extraExplanation":["“Dionin”多见于较早期的医学资料或处方中，属于商品名用法；现代文献更常写作 ethylmorphine（乙基吗啡）。","它属于阿片类（opioid）相关药物，可能导致嗜睡、依赖等风险；具体管制与可用性因国家/地区而异。若你是在药瓶或处方上看到该词，建议向医生或药师确认。"]}
{"word":"Dionis","summary":{"en":"“Dionis” is a personal name (usually a first name, sometimes a surname) and is uncommon in English.","zh":"“Dionis”是人名（多为名字，也可作姓氏），在英语中不算常见。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a given name (first name), used in several European languages; in English it is uncommon and is often understood as a variant related to “Dionysus.”","zh":"人名（名字），在一些欧洲语言中使用；在英语里较少见，常被理解为与“Dionysus（狄俄尼索斯）”相关的变体。"},"examples":[{"en":"Dionis is a common first name in some countries, but many English speakers may not recognize it.","zh":"Dionis 在一些国家是常见的名字，但许多英语使用者可能不太认识。"},{"en":"In the novel, Dionis is portrayed as a quiet, thoughtful student.","zh":"在小说里，Dionis 被描写成一个安静、爱思考的学生。"}]},{"partOfSpeech":"other","definition":{"en":"a surname (family name).","zh":"姓氏（家族姓）。"},"examples":[{"en":"Ms. Dionis will lead the meeting today.","zh":"Dionis 女士今天将主持会议。"},{"en":"I found an article by Dionis in the school journal.","zh":"我在校刊上看到一篇署名为 Dionis 的文章。"}]}],"synonyms":["Dionysus (related name)","Denis (similar-looking name)"],"phonetic":"/daɪˈoʊnɪs/","extraExplanation":["“Dionis”在不同语言与地区可能有不同来源与拼写（如Dionís、Dionis等）。有时会被视为与希腊酒神“Dionysus（狄俄尼索斯）”同源或相关的名字变体，但具体要看个人与当地文化的用法。","如果你是在某个句子、人物、品牌或证件上看到“Dionis”，我也可以根据上下文判断它更可能是名字、姓氏，还是某种拼写/翻译差异。"]}
{"word":"dionise","summary":{"en":"Dionise is mostly used as a female given name, meaning “of Dionysus.”","zh":"Dionise 主要是女性名字，含义为“属于狄俄尼索斯的/与狄俄尼索斯有关的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a feminine given name (a variant of Denise/Dionysia), ultimately from Greek meaning “of Dionysus.”","zh":"女性名字（Denise/Dionysia 的变体），词源来自希腊语，意思是“属于狄俄尼索斯的/与狄俄尼索斯有关的”。"},"examples":[{"en":"Dionise introduced herself and spelled her name for the receptionist.","zh":"Dionise 自我介绍时，还给前台拼读了自己的名字。"},{"en":"Dionise is a rare name, so people often ask how to pronounce it.","zh":"Dionise 是个比较少见的名字，所以人们常问怎么读。"}]}],"synonyms":["Denise","Dionysia","Dionysius (related root)"],"phonetic":"/ˌdiəˈnis/","extraExplanation":["“Dionise”在英语里主要作为人名使用，并不是常见的普通词汇或动词。","词根与希腊神话中的酒神狄俄尼索斯（Dionysus）有关，因此也会让人联想到“酒、欢庆、戏剧与狂欢”等文化意象。","如果你原本想查的是“Dionysus”（狄俄尼索斯）或“Dionysian”（与酒神/纵情狂欢相关的），告诉我我可以分别给出更常用的词条与用法。"]}
{"word":"Dionisio","summary":{"en":"Dionisio is a Spanish/Italian masculine name related historically to Dionysius (linked to the Greek god Dionysus).","zh":"Dionisio 是西班牙语/意大利语常见的男子名，源自 Dionysius，历史上与希腊酒神 Dionysus 有词源关联。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a masculine given name used in Spanish- and Italian-speaking cultures (equivalent to English “Dionysius”); sometimes also used as a surname.","zh":"男子名（常见于西班牙语、意大利语文化中；相当于英语名 Dionysius）；有时也作姓氏。"},"examples":[{"en":"Dionisio is my grandfather’s name.","zh":"Dionisio 是我祖父的名字。"},{"en":"We met Dionisio at the community center.","zh":"我们在社区中心认识了 Dionisio。"}]}],"synonyms":["Dionysius","Dionisio (variant spellings in names)","Dennis (related name)"],"phonetic":"/ˌdi.oʊˈni.si.oʊ/","extraExplanation":["“Dionisio”源自拉丁语 Dionysius，最初来自希腊语，意思大致是“与狄俄尼索斯（Dionysus，酒神）有关/奉献给酒神的人”。因此它在文化背景上常被认为带有古希腊神话色彩。","在西班牙语里更常见的写法是 “Dionisio”，而表示希腊酒神时也常见 “Dioniso”（少一个 i）。英语里对应的形式多见于宗教或历史语境（如“Saint Dionysius”）。","英语里常见名字 “Dennis” 也和这一词源有关，是同一词根在不同语言中的演变。"]}
{"word":"dionize","summary":{"en":"Dionize = to make something wild, ecstatic, or revel-like (Dionysian).","zh":"dionize＝使某事物变得狂欢放纵、忘我热烈（狄俄尼索斯式）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare) To make something Dionysian—wild, ecstatic, or pleasure-seeking; to encourage revelry or intoxication.","zh":"（罕用）使某事物呈现“狄俄尼索斯式”的风格：狂欢、忘我、放纵；促使人尽情作乐或沉醉。"},"examples":[{"en":"The writer tries to dionize the festival scene, filling it with music, wine, and dancing.","zh":"作家试图把节日场景写得很“狄俄尼索斯式”，充满音乐、酒与舞蹈。"},{"en":"Some critics say the film dionizes ancient rituals to make them feel more exciting.","zh":"一些评论家说，这部电影把古代仪式“狄俄尼索斯化”，让它们显得更刺激。"}]}],"synonyms":["dionysianize","intoxicate","enliven","turn into a revelry"],"phonetic":"/ˈdaɪənaɪz/","extraExplanation":["“dionize”来自希腊酒神/狂欢之神 Dionysus（狄俄尼索斯）的名字，因此常与“酒、狂欢、忘我、感官享乐”等意象相关。","这个词在现代英语里非常少见，更常用的是形容词 “Dionysian”（狄俄尼索斯式的、狂欢放纵的）。写作中若想表达相近意思，也可用更常见的动词如 “intoxicate”（使沉醉）、“enliven”（使热闹起来）、“turn into a revelry”（变成狂欢）。"]}
{"word":"Dionne","summary":{"en":"Dionne is mainly used as a woman’s first name and sometimes as a surname.","zh":"Dionne 主要用作女性名，也可作姓。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A feminine given name (first name), used especially in English-speaking countries; also used as a family name (surname).","zh":"女性名字（名），在英语国家较常见；也可作姓氏。"},"examples":[{"en":"Dionne is joining our team next month.","zh":"Dionne 下个月会加入我们的团队。"},{"en":"I met Dionne at a conference in New York.","zh":"我在纽约的一场会议上认识了 Dionne。"}]}],"phonetic":"/diˈɑn/","extraExplanation":["“Dionne”常被认为源自法语姓氏传统，在北美也较常见，尤其在加拿大法语区（如魁北克）或有法语背景的家庭中。","文化提示：历史上较知名的用法之一是“Dionne quintuplets（迪翁五胞胎）”，指20世纪30年代加拿大安大略省出生的五胞胎，她们在当时引发全球关注。","拼写与发音提醒：它与歌手 Céline Dion（席琳·迪翁）的姓“Dion”不同；“Dionne”末尾多了 -ne。"]}
{"word":"dionym","summary":{"en":"“Dionym” is not a standard English word; it is usually a mistaken form of “demonym,” the name for people from a place.","zh":"“dionym”不是标准英语词；多半是把“demonym（某地居民称谓）”拼错或写错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard) A misspelling or mistaken form of demonym— a word that names the people of a place (for example, “New Yorker,” “Canadian”).","zh":"（非标准用法）常见于拼写或误写，通常指 demonym（地名居民称谓）：用来表示某地的人，如 New Yorker（纽约人）、Canadian（加拿大人）。"},"examples":[{"en":"“Dionym” isn’t commonly used in dictionaries; you probably mean “demonym.”","zh":"“dionym”在词典中并不常见；你可能想写的是“demonym”。"},{"en":"“Canadian” is the demonym for people from Canada.","zh":"“Canadian”是“来自加拿大的人”的居民称谓（demonym）。"}]}],"synonyms":["demonym","gentilic"],"phonetic":"ˈdaɪəˌnɪm","extraExplanation":["“demonym”由 demo-（人民）+ -nym（名字）构成，常用于写作、新闻与地理相关内容：例如“Beijinger / 北京人”“Londoner / 伦敦人”。","如果你本来想表达“神的名字”，更常见的词是 theonym（神名）。如果你愿意，可以告诉我你看到 dionym 的句子或上下文，我可以帮你确认你真正需要的词。"]}
{"word":"dionymal","summary":{"en":"“Dionymal” isn’t a standard word; you probably mean “Dionysian,” meaning wild, ecstatic, pleasure-centered, and associated with Dionysus.","zh":"“dionymal” 不是标准词；你可能想写 “Dionysian（酒神式）”，指狂欢、激情、感官享乐、与酒神狄俄尼索斯相关的风格或氛围。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling of “Dionysian,” which relates to Dionysus (the Greek god of wine) and describes something wild, ecstatic, or pleasure-seeking.","zh":"这不是标准英语单词。它很可能是 “Dionysian” 的拼写错误；“Dionysian” 与希腊酒神狄俄尼索斯有关，用来形容狂放、激情、陶醉、追求享乐或“放纵式”的氛围/风格。"},"examples":[{"en":"The party had a Dionysian energy—music, dancing, and people celebrating late into the night.","zh":"派对有一种“酒神式”的狂欢氛围——音乐、舞蹈，人们庆祝到深夜。"},{"en":"Some critics describe the film as Dionysian because it focuses on desire and intense emotion.","zh":"一些评论家说这部电影很“酒神式”，因为它聚焦欲望与强烈情感。"}]}],"synonyms":["ecstatic","hedonistic","wild","orgiastic","bacchanalian"],"phonetic":"/ˌdaɪəˈnɪʒiən/","extraExplanation":["“Dionysian（酒神式）”常与“Apollonian（阿波罗式）”对比：前者强调本能、激情、混沌与感官享受；后者强调理性、秩序与克制。这个对比在文学与艺术评论里很常见，来源与尼采（Nietzsche）的思想有关。"]}
{"word":"Dionysia","summary":{"en":"Dionysia is an ancient Greek festival for Dionysus, especially the Athenian event known for major drama performances and competitions.","zh":"Dionysia 指古希腊祭祀狄俄尼索斯的节庆，尤指雅典著名的庆典，以大型戏剧演出与比赛闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an ancient Greek festival held in honor of Dionysus (god of wine and theater), especially in Athens; it famously included public performances of tragedy and comedy","zh":"狄俄尼索斯节：古希腊为酒神兼戏剧之神狄俄尼索斯（Dionysus）举行的节庆，尤以雅典的庆典著名；其中包含公开上演悲剧与喜剧的戏剧比赛"},"examples":[{"en":"Many of the greatest Greek tragedies were first performed at the Dionysia in Athens.","zh":"许多最伟大的希腊悲剧最初都是在雅典的狄俄尼索斯节上首演的。"},{"en":"The Dionysia helped shape Western theater by turning drama into a major public event.","zh":"狄俄尼索斯节把戏剧变成重要的公共活动，从而深刻影响了西方戏剧的发展。"}]}],"synonyms":["City Dionysia","Great Dionysia","Dionysian festival"],"phonetic":"ˌdaɪəˈnɪʃiə","extraExplanation":["“Dionysia”是复数形式的名称（像“奥运会”那样指一系列节庆活动），常用来特指雅典的“城市狄俄尼索斯节”（City/Great Dionysia），大约在春季举行。","在“城市狄俄尼索斯节”上，剧作家会带着合唱队与演员参赛，演出往往与宗教仪式、游行（phallophoria 等）和公民生活密切相关；因此它不仅是娱乐，也是政治与文化身份的展示。","如果你在文学或戏剧史里看到它，通常与埃斯库罗斯（Aeschylus）、索福克勒斯（Sophocles）、欧里庇得斯（Euripides）以及阿里斯托芬（Aristophanes）等人的作品首演背景相关。"]}
{"word":"dionysia","summary":{"en":"An ancient Greek festival for Dionysus, especially the Athenian event where famous tragedies and comedies were performed.","zh":"古希腊为狄俄尼索斯举行的节庆，尤指雅典举办、以悲喜剧演出著称的狄俄尼西亚节。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ancient Greece) A festival held in honor of Dionysus, the god of wine and theater—especially the City (Great) Dionysia in Athens, famous for public performances of tragedy and comedy.","zh":"（古希腊）为酒神与戏剧之神狄俄尼索斯（Dionysus）举行的节庆，尤指雅典的“城邦（大）狄俄尼西亚节”，以悲剧与喜剧的公开演出闻名。"},"examples":[{"en":"Many of the surviving Greek tragedies were first performed at the City Dionysia in Athens.","zh":"许多流传至今的希腊悲剧最初都在雅典的“城邦狄俄尼西亚节”首演。"},{"en":"At the Dionysia, playwrights competed for prizes, and the whole city attended.","zh":"在狄俄尼西亚节上，剧作家参加竞赛争夺奖项，全城居民都会参与。"}]}],"synonyms":["City Dionysia","Great Dionysia"],"phonetic":"/ˌdaɪəˈnaɪʒə/","extraExplanation":["“Dionysia”是复数形式的节日名称（可理解为“狄俄尼索斯的庆典”），英语里常当作专有名词使用。","最常被提到的是雅典的“City/Great Dionysia”（春季举行），它与古希腊戏剧的发展密切相关：埃斯库罗斯、索福克勒斯、欧里庇得斯、阿里斯托芬等人的作品都与该节日的演出传统有关。","相关词：Dionysian（adj. 酒神的；狂欢放纵的）。相关短语：City Dionysia / Great Dionysia（城邦/大狄俄尼西亚节）。"]}
{"word":"Dionysiac","summary":{"en":"Dionysiac means “of Dionysus” or “wildly ecstatic and unrestrained.”","zh":"Dionysiac 指“与狄俄尼索斯（酒神）相关的”，也可引申为“狂欢纵情、充满狂喜与不受拘束的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Dionysus (Bacchus), the ancient Greek god of wine, fertility, theater, and ecstatic religious celebration.","zh":"与狄俄尼索斯（罗马名巴克斯）有关的；指古希腊酒神、丰饶与戏剧及狂喜祭仪的。"},"examples":[{"en":"The vase shows a Dionysiac procession with satyrs and dancing women.","zh":"这只花瓶描绘了狄俄尼索斯式的游行队伍，有萨堤尔和跳舞的女子。"},{"en":"Scholars study Dionysiac rituals to understand ancient Greek festival culture.","zh":"学者研究狄俄尼索斯式祭仪，以理解古希腊的节庆文化。"}]},{"partOfSpeech":"adj.","definition":{"en":"Wildly joyful, emotionally intense, and unrestrained; celebrating pleasure, spontaneity, or ecstasy.","zh":"狂欢的、纵情的、情感强烈且不受拘束的；强调快感、自发性或狂喜的。"},"examples":[{"en":"The concert turned into a Dionysiac night of singing and dancing.","zh":"那场演唱会变成了一个狄俄尼索斯式的狂欢之夜，人们又唱又跳。"},{"en":"Her Dionysiac energy made the formal party feel alive.","zh":"她那种狄俄尼索斯式的活力让原本拘谨的派对变得有生气。"},{"en":"The novel contrasts calm order with Dionysiac chaos.","zh":"这部小说把平静的秩序与狄俄尼索斯式的混乱作对比。"}]}],"synonyms":["Dionysian","Bacchic","ecstatic","orgiastic","frenzied","uninhibited"],"phonetic":"/ˌdaɪəˈnaɪziˌæk/","extraExplanation":["“Dionysiac”常见于艺术史、神话研究与文学批评中。它不仅指“与酒神有关”，也常用来形容一种“放纵、狂喜、打破规训”的气质或氛围。","在西方文化讨论里，它常与“Apollonian（阿波罗式的：理性、秩序、节制）”形成对照，特别是在尼采《悲剧的诞生》中：酒神精神象征本能与集体性的激情，阿波罗精神象征清晰与克制。","拼写提示：Dionysiac（较常见）与 Dionysian（也常见，含义非常接近）都可表示“狄俄尼索斯式的/狂欢放纵的”。"]}
{"word":"dionysiac","summary":{"en":"Dionysiac means “Dionysus-related” or “wild, ecstatic, pleasure-driven,” especially in art, festivals, or philosophy.","zh":"dionysiac 指“与酒神狄俄尼索斯有关的”，或“狂放、陶醉、纵情、富于激情的”，常用于艺术、节庆与哲学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Dionysus (the Greek god of wine, ecstasy, and theater), or describing wild, ecstatic, pleasure-seeking energy—often linked to partying, trance-like emotion, and the breakdown of social restraint.","zh":"与狄俄尼索斯（希腊酒神、狂喜与戏剧之神）有关；或形容狂放、陶醉、追求感官快感与情绪爆发的力量，常带有“失去克制”的意味。"},"examples":[{"en":"The festival ended in a dionysiac night of dancing and singing.","zh":"庆典以一个狄俄尼索斯式的夜晚收尾：人们尽情跳舞、歌唱。"},{"en":"Her performance had a dionysiac intensity that swept the audience along.","zh":"她的表演带着狄俄尼索斯式的强烈激情，把观众完全带入其中。"}]}],"synonyms":["Dionysian","bacchanalian","orgiastic","ecstatic","hedonistic"],"phonetic":"/ˌdaɪəˈnaɪziæk/","extraExplanation":["“dionysiac”（也常见拼写 Dionysian）常用于文学、艺术与哲学语境，强调一种“本能、狂喜、非理性、失控的生命力”。","尼采在《悲剧的诞生》中把艺术精神分为“阿波罗式（Apollonian：秩序、理性、形式）”与“狄俄尼索斯式（Dionysiac：激情、混沌、陶醉）”，因此在评论音乐、戏剧、电影或派对文化时常会用到这个词。","在英语里它通常带有“尽情放纵/纵情狂欢”的色彩，但在艺术评论中也可能是褒义，表示“充满生命力与感染力”。"]}
{"word":"Dionysiacal","summary":{"en":"Dionysiacal means ‘related to Dionysus’ or ‘wild, ecstatic, revel-like.’","zh":"Dionysiacal 指“与狄俄尼索斯有关的”，或“狂放、忘我、带狂欢色彩的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Dionysus (the Greek god of wine, theater, and ecstatic celebration).","zh":"与狄俄尼索斯（希腊神话中掌管酒、戏剧与狂喜庆典的神）有关的。"},"examples":[{"en":"The painting is full of Dionysiacal imagery: wine, vines, and dancing figures.","zh":"这幅画充满了狄俄尼索斯式的意象：葡萄酒、葡萄藤和舞动的人物。"},{"en":"The novel uses Dionysiacal symbols to suggest freedom and desire.","zh":"这部小说用狄俄尼索斯式的象征来暗示自由与欲望。"}]},{"partOfSpeech":"adj.","definition":{"en":"Wild, ecstatic, or uncontrolled in a way that suggests drunken revelry or intense emotion.","zh":"（带有饮酒狂欢或强烈情绪的）狂放的、忘我的、失控般的。"},"examples":[{"en":"The crowd’s Dionysiacal energy turned the concert into a kind of ritual.","zh":"人群狄俄尼索斯式的狂热能量让演唱会变得像一种仪式。"},{"en":"After the team won, the celebration became almost Dionysiacal.","zh":"球队获胜后，庆祝活动几乎变得狄俄尼索斯式地狂欢起来。"}]}],"synonyms":["Dionysian","bacchanalian","orgiastic","ecstatic","frenzied"],"phonetic":"/ˌdaɪ.əˈnɪz.i.ə.kəl/","extraExplanation":["“Dionysiacal”（也常见作 Dionysian）来自 Dionysus。它常用于艺术与文学批评，表示一种“理性束缚较少、情感与本能更强、接近狂喜/狂欢”的气质。","在西方文化讨论里，它常与 “Apollonian（阿波罗式：理性、秩序、克制）”对比；这一对概念在尼采的《悲剧的诞生》中很有影响力。"]}
{"word":"dionysiacal","summary":{"en":"An adjective meaning “Dionysus-related” or “wildly ecstatic, often linked to wine, revelry, and intense emotion.”","zh":"形容词：指“与狄俄尼索斯有关的”，或“狂欢忘我、常与酒、纵情与强烈情绪相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Dionysus (the Greek god of wine and theater), or to wild, ecstatic celebration—often involving intoxication, intense emotion, and a feeling of abandon.","zh":"与狄俄尼索斯（希腊酒神、戏剧之神）有关的；或指狂欢、忘我、带有醉意与强烈情绪的（常见于文学/艺术语境）。"},"examples":[{"en":"The novel contrasts Apollonian order with Dionysiacal energy and chaos.","zh":"这部小说把阿波罗式的秩序与狄俄尼索斯式的能量与混沌作对比。"},{"en":"The festival turned into a Dionysiacal night of singing, dancing, and wine.","zh":"节庆变成了一个狄俄尼索斯式的夜晚：歌唱、跳舞与美酒不断。"},{"en":"Her performance had a Dionysiacal intensity that felt almost trance-like.","zh":"她的表演带着狄俄尼索斯式的强烈力量，几乎像进入了恍惚状态。"}]}],"synonyms":["Dionysian","Dionysiac","ecstatic","orgiastic (literary)","hedonistic (context-dependent)"],"phonetic":"/ˌdaɪ.ə.nɪˈzaɪ.ə.kəl/","extraExplanation":["这个词多见于文学批评、艺术评论与哲学讨论，日常口语里更常用 wild / ecstatic / hedonistic 等来表达类似感觉。","在尼采《悲剧的诞生》中，“阿波罗式（Apollonian）”常象征理性、形式与克制；“狄俄尼索斯式（Dionysian/Dionysiacal）”则象征本能、陶醉、群体狂喜与打破边界的力量。","拼写上也常见 Dionysian 与 Dionysiac；Dionysiacal 更偏书面、带一点古典/文艺批评的味道。"]}
{"word":"Dionysiacally","summary":{"en":"“Dionysiacally” means “in a wild, ecstatic, Dionysus-like way,” often describing revelry, intense emotion, or uninhibited celebration.","zh":"“Dionysiacally”表示“以酒神式的狂喜与放纵方式”，常形容狂欢、强烈情绪或不受拘束的庆祝。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a Dionysiac way; with wild, ecstatic energy—often linked to drinking, revelry, dance, or emotional abandon.","zh":"以酒神式（狄奥尼索斯式）的方式；带着狂欢、陶醉、放纵的激情——常与饮酒、纵情作乐、舞蹈或情感失控相关。"},"examples":[{"en":"The crowd moved dionysiacally as the music grew louder.","zh":"音乐越来越响，人群以酒神式的狂热节奏舞动起来。"},{"en":"The novel describes a city celebrating dionysiacally through the night.","zh":"小说描写这座城市通宵以酒神式的方式狂欢庆祝。"},{"en":"He spoke dionysiacally, swept up by emotion rather than reason.","zh":"他说话带着酒神式的情绪冲动，更受情感驱动而非理性。"}]}],"synonyms":["ecstatically","wildly","uninhibitedly","frenziedly","riotously"],"phonetic":"ˌdaɪəˈnaɪʒəkli","extraExplanation":["“Dionysiacally”来自希腊酒神狄奥尼索斯（Dionysus）。在英语里，它常用来形容一种“失控但充满生命力”的狂喜状态，不一定只指喝酒，也可以指艺术、音乐、舞蹈带来的忘我与释放。","在文学与思想语境中，它常与“Apollonian（阿波罗式：理性、秩序、节制）”对照；这一对概念在尼采的艺术观里尤其常见，用来讨论人类在理性与激情之间的张力。"]}
{"word":"dionysiacally","summary":{"en":"Dionysiacally means “in a wildly ecstatic, uninhibited, revelry-like way.”","zh":"dionysiacally 表示“以酒神式狂欢、陶醉、放纵的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a wild, ecstatic, or uninhibited way, like celebrations associated with Dionysus (the Greek god of wine and revelry).","zh":"以酒神狄俄尼索斯式的方式；狂欢的、纵情的、陶醉般的（常带“放纵/失控”的含义）。"},"examples":[{"en":"The crowd danced dionysiacally as the music grew louder and faster.","zh":"音乐越来越响、越来越快时，人群以一种狂欢般的方式尽情起舞。"},{"en":"The film contrasts a calm daily routine with a dionysiacally chaotic night scene.","zh":"这部电影把平静的日常与一段酒神式混乱的夜晚场景形成对比。"},{"en":"He described the festival as dionysiacally joyful, overflowing with laughter and wine.","zh":"他形容那场节庆酒神般欢腾，笑声与美酒满溢。"}]}],"synonyms":["ecstatically","wildly","uninhibitedly","frenetically","bacchanally"],"phonetic":"/ˌdaɪ.əˈnɪʒ.ə.k(ə)li/","extraExplanation":["词源与文化背景：Dionysus（狄俄尼索斯）是希腊神话中的酒神，也与戏剧、狂喜（ecstasy）、仪式性狂欢有关；因此 dionysiacally 常用来形容“释放理性束缚”的狂热气氛。","语体与搭配：这个词偏文学/学术语体，常出现在艺术评论、文学描写、哲学语境中；常见搭配有 dionysiacally dancing/celebrating/chaotic。","相关概念：常与 apollonian（阿波罗式的：理性、克制、秩序）形成对照，用来表达“理性 vs. 狂欢/本能”的张力。"]}
{"word":"Dionysian","summary":{"en":"Dionysian means related to Dionysus or describing ecstatic, emotional, and uninhibited energy; in philosophy/art it contrasts with rational “Apollonian.”","zh":"Dionysian 指与狄俄尼索斯有关，或形容狂欢、情绪强烈、释放本能的气质；在哲学与艺术中常与理性的 Apollonian 相对。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to Dionysus (Bacchus), the Greek god of wine, theater, and ecstatic celebration; describing wild, joyful, or intoxicated energy.","zh":"与狄俄尼索斯（酒神巴克科斯）有关；形容狂欢、放纵、陶醉、充满激情与释放的气氛或力量。"},"examples":[{"en":"The festival had a Dionysian atmosphere, with dancing, loud music, and nonstop laughter.","zh":"这个节日充满酒神式的氛围：人们跳舞、音乐震耳、笑声不断。"},{"en":"In Greek tragedy, Dionysian rituals are tied to the origins of theater.","zh":"在希腊悲剧中，酒神的仪式与戏剧的起源密切相关。"}]},{"partOfSpeech":"adj.","definition":{"en":"In art and philosophy, expressing instinct, emotion, chaos, and freedom (often contrasted with “Apollonian,” meaning rational and orderly).","zh":"在艺术与哲学中，指本能、情感、混沌与自由的表达（常与“Apollonian/阿波罗式：理性、有秩序”对比）。"},"examples":[{"en":"The director balanced Apollonian structure with Dionysian passion.","zh":"这位导演在阿波罗式的结构与酒神式的激情之间取得了平衡。"},{"en":"Nietzsche describes music as deeply Dionysian in spirit.","zh":"尼采认为音乐在精神上具有深刻的酒神式特质。"}]},{"partOfSpeech":"n.","definition":{"en":"A person, style, or force that embodies Dionysian qualities.","zh":"具有酒神式特质的人、风格或力量。"},"examples":[{"en":"Some critics call the singer a Dionysian who thrives on the crowd’s energy.","zh":"有些评论家称这位歌手是“酒神式的人”，靠观众的能量而兴盛。"}]}],"synonyms":["bacchanalian","orgiastic","ecstatic","uninhibited","frenzied"],"phonetic":"/ˌdaɪ.əˈnɪʒ.i.ən/","extraExplanation":["“Dionysian”来自希腊神话中的Dionysus（狄俄尼索斯），罗马神话中对应Bacchus（巴克科斯）。它常与葡萄酒、狂欢、集体仪式、戏剧与情感释放联系在一起。","在西方文化讨论里，这个词常因尼采《悲剧的诞生》而更广为人知：他用“Apollonian（阿波罗式）vs. Dionysian（酒神式）”来对比理性秩序与激情冲动两种审美/精神力量。","常见搭配：Dionysian revelry（酒神式狂欢）、Dionysian frenzy（酒神式狂热）、Dionysian spirit（酒神式精神）。注意它在日常语境里多为比喻，用来形容“热烈、放纵、释放”的气氛，而不一定真的与酒有关。"]}
{"word":"dionysian","summary":{"en":"Dionysian describes something linked to Dionysus or a wild, ecstatic, rule-breaking spirit; in art it contrasts with calm, rational order.","zh":"Dionysian 指与酒神狄俄尼索斯相关，或形容狂欢纵情、陶醉释放、打破常规的气质；在艺术思想中常与理性秩序相对。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Dionysus (the Greek god of wine and theater) or to wild, joyful, emotional, and rule-breaking celebration.","zh":"与狄俄尼索斯（希腊酒神、戏剧之神）有关；或指狂欢、纵情、情绪化、打破常规的庆祝与体验。"},"examples":[{"en":"The festival had a Dionysian energy—music, dancing, and laughter everywhere.","zh":"这个节日充满了狄俄尼索斯式的能量——到处都是音乐、舞蹈和笑声。"},{"en":"She prefers Dionysian parties to formal dinners.","zh":"她更喜欢狄俄尼索斯式的派对，而不是正式的晚宴。"}]},{"partOfSpeech":"adj.","definition":{"en":"In art and ideas, emphasizing instinct, passion, ecstasy, and chaos rather than calm order or reason.","zh":"（艺术与思想中）强调本能、激情、陶醉与混沌，而非冷静的秩序或理性。"},"examples":[{"en":"The novel explores a Dionysian side of human nature: desire, fear, and freedom.","zh":"这部小说探讨了人性中狄俄尼索斯式的一面：欲望、恐惧与自由。"},{"en":"Critics called his performance Dionysian—intense, unpredictable, and emotionally raw.","zh":"评论家称他的表演很狄俄尼索斯式——强烈、难以预测、情感非常真实裸露。"}]}],"synonyms":["bacchanalian","orgiastic","ecstatic","wild","frenzied","hedonistic"],"phonetic":"/ˌdaɪ.əˈnɪʒ.i.ən/","extraExplanation":["“Dionysian”来自希腊神话中的酒神狄俄尼索斯（Dionysus）。英语里常用来形容“纵情、狂欢、释放自我”的氛围。","在西方文化讨论中，它常与“Apollonian（阿波罗式）”形成对比：前者偏向激情与混沌，后者偏向理性与秩序。这一对比在尼采（Nietzsche）谈艺术与悲剧时很常见。","文学与艺术里提到“Dionysian”时，往往带有“打破社会规训、回归本能”的意味，但语气不一定是负面，也可能是赞美其生命力与创造力。"]}
{"word":"dionysianize","summary":{"en":"Dionysianize means to make something wild, ecstatic, or revel-like—characteristic of Dionysus; more broadly, to push something toward intense emotional release rather than calm order.","zh":"dionysianize 意为让某事物带上“狄奥尼索斯式”的狂欢、沉醉、激情与失序特质；也可泛指把事物推向强烈情感宣泄，而非冷静秩序。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something Dionysian; to give it a wild, ecstatic, pleasure-seeking, or disorderly character (associated with Dionysus, the Greek god of wine and revelry)","zh":"使某事物呈现“狄奥尼索斯式”的特质；使之带有狂欢、沉醉、激情、放纵或失序的氛围（与希腊酒神狄俄尼索斯相关）"},"examples":[{"en":"The director tried to dionysianize the play by adding loud music, dancing, and chaotic movement.","zh":"导演试图通过加入高分贝音乐、舞蹈和混乱的走位来让这部戏“狄奥尼索斯化”。"},{"en":"Some critics say the festival has been dionysianized into a night of nonstop drinking.","zh":"一些评论者说，这个节日已经被“狄奥尼索斯化”，变成了整晚不停喝酒的活动。"}]},{"partOfSpeech":"vt.","definition":{"en":"(more broadly) to turn something into intense emotional release or ecstatic experience, often in contrast to calm order and restraint","zh":"（更广义）使某事转向强烈情感宣泄或狂喜体验，常与冷静、秩序和克制形成对比"},"examples":[{"en":"The band’s new album dionysianizes heartbreak into something loud and liberating.","zh":"这支乐队的新专辑把心碎“狄奥尼索斯化”，变得喧闹而令人解放。"},{"en":"He wanted to dionysianize the classroom discussion, pushing it toward feeling rather than rules.","zh":"他想让课堂讨论“狄奥尼索斯化”，把重点推向感受而不是规则。"}]}],"synonyms":["make Dionysian","imbue","infuse","intoxicate","turn into a revel","unleash","let loose"],"phonetic":"/ˌdaɪəˈnaɪziəˌnaɪz/","extraExplanation":["“Dionysian”来自希腊神话中的酒神狄俄尼索斯（Dionysus），常联想到酒、狂欢、迷醉、群体仪式、情感爆发等。","在文化批评里，这个词也常借用尼采的对比：Apollonian（阿波罗式：理性、秩序、形式）vs. Dionysian（狄奥尼索斯式：本能、激情、失控）。因此 dionysianize 往往带有“让事物更狂放/更感性/更失序”的评价色彩。","这是非常少见的派生动词，写作中更常见的是形容词 Dionysian（如：a Dionysian party）。"]}
{"word":"Dionysius","summary":{"en":"Dionysius is a male name of Greek origin meaning “of Dionysus,” shared by several famous ancient historians, rulers, and Christian figures.","zh":"Dionysius（狄奥尼修斯）是源自希腊语的男性名字，意为“属于狄俄尼索斯”，多位著名的古代史学家、统治者与基督教人物都用过这个名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A male given name used in ancient Greece and later in Christian history; it is the Latin form of a Greek name meaning “belonging to Dionysus” (the Greek god of wine and theater).","zh":"男性名字，源自古希腊，后也常见于基督教历史人物；是希腊语名字的拉丁化形式，原意为“属于狄俄尼索斯”（希腊酒神、戏剧之神）。"},"examples":[{"en":"Dionysius of Halicarnassus wrote about Roman history and rhetoric.","zh":"哈利卡纳苏斯的狄奥尼修斯写过罗马史和修辞学。"},{"en":"Several early Christian writers were named Dionysius, so you need context to know which one is meant.","zh":"早期有好几位基督教作者都叫狄奥尼修斯，所以需要上下文才能知道指的是哪一位。"}]},{"partOfSpeech":"n.","definition":{"en":"A specific historical name shared by multiple notable figures, such as Dionysius I and Dionysius II, rulers (tyrants) of Syracuse in ancient Sicily.","zh":"一个由多位著名历史人物共用的姓名，例如叙拉古（古西西里）统治者“狄奥尼修斯一世”和“狄奥尼修斯二世”。"},"examples":[{"en":"Plato is often connected in stories to the court of Dionysius I of Syracuse.","zh":"柏拉图常在一些故事中与叙拉古的狄奥尼修斯一世的宫廷联系在一起。"}]}],"synonyms":["(no true synonyms; related: Dionysus, Dennis/Denis (same name family))"],"phonetic":"/ˌdaɪəˈnɪʃiəs/","extraExplanation":["“Dionysius”是专有名词，通常不翻译其字面意义，而是音译为“狄奥尼修斯/狄奥尼修”。阅读时最关键的是看修饰语：例如“of Halicarnassus（哈利卡纳苏斯的）”“the Areopagite（亚略巴古人）”“I/II of Syracuse（叙拉古的一世/二世）”，用来区分具体人物。","在英语学术写作里，这个名字常出现在古典学、历史学与神学语境。遇到它时，可以先判断是在讲古希腊/罗马史，还是在讲早期基督教思想传统。"]}
{"word":"Dionysos","summary":{"en":"Dionysos: the Greek god of wine, ecstatic celebration, and theater; a Greek-style spelling of “Dionysus.”","zh":"Dionysos：希腊神话中的酒神与狂欢、戏剧之神；是更偏希腊语风格的“Dionysus”拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek mythology, the god of wine, grape harvest, fertility, ecstatic celebration, and theater; the Greek form of the name is often spelled “Dionysos” (more commonly “Dionysus” in English).","zh":"（希腊神话）狄俄倪索斯：酒、葡萄收获、丰饶、生殖力、狂欢与戏剧之神；“Dionysos”是更接近希腊语的拼写，英语中更常见拼写为“Dionysus”。"},"examples":[{"en":"Dionysos is often shown holding grapes or a cup of wine.","zh":"狄俄倪索斯常被描绘为手拿葡萄或酒杯。"},{"en":"In Greek myth, Dionysos brings joy, but his power can also feel dangerous and wild.","zh":"在希腊神话中，狄俄倪索斯带来欢乐，但他的力量也可能危险而狂野。"},{"en":"Some ancient festivals honoring Dionysos later influenced the development of Greek theater.","zh":"一些祭祀狄俄倪索斯的古代节庆，后来影响了希腊戏剧的发展。"}]}],"synonyms":["Dionysus","Bacchus"],"phonetic":"/ˌdaɪəˈnaɪsoʊs/","extraExplanation":["“Dionysos”是更接近古希腊语Διόνυσος（Diónysos）的转写；英语里更常用“Dionysus”。在罗马文化中，他常与“Bacchus（巴克科斯）”对应，因此英文里也会看到“Bacchic”表示“酒神式的、狂欢的”。","狄俄倪索斯常与“狂喜/出神（ecstasy）”“释放束缚”“集体仪式”联系在一起；相关词汇包括“Dionysian（酒神式的、充满激情与冲动的）”，常与“Apolline/Apollonian（阿波罗式的、理性克制的）”对照来讨论艺术与性格。"]}
{"word":"Dionysus","summary":{"en":"Dionysus is the Greek god of wine, celebration, and theater, and a symbol of passionate, chaotic energy in art and literature.","zh":"Dionysus（狄俄尼索斯）是希腊神话中的酒神、狂欢与戏剧之神；在文学艺术中也常象征激情与混沌的能量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) The god of wine, celebration, theater, and ecstatic ritual; associated with fertility and the freeing of emotions.","zh":"（希腊神话）狄俄尼索斯：酒、狂欢、戏剧与神秘仪式之神；也与丰饶、生育，以及释放情感与本能有关。"},"examples":[{"en":"In Greek mythology, Dionysus brings wine to humans and inspires celebration.","zh":"在希腊神话中，狄俄尼索斯把酒带给人类，并激发人们的庆祝与狂欢。"},{"en":"The play explores the tension between reason and the wild energy linked to Dionysus.","zh":"这部戏探讨了理性与狄俄尼索斯式的狂野能量之间的张力。"}]},{"partOfSpeech":"n.","definition":{"en":"In literature and art, a symbol of passion, chaos, and the “irrational” side of human nature, often contrasted with Apollo (order and reason).","zh":"在文学与艺术中，象征激情、混沌与人性中“非理性”的一面，常与阿波罗（秩序与理性）相对。"},"examples":[{"en":"Some critics describe the novel’s party scenes as Dionysian—joyful but also dangerous.","zh":"有些评论家把小说里的派对场景称为“狄俄尼索斯式”的——欢快却也危险。"},{"en":"Nietzsche contrasted the Apollonian with the Dionysian to explain two forces in art.","zh":"尼采用“阿波罗式”与“狄俄尼索斯式”的对比来解释艺术中的两种力量。"}]}],"synonyms":["Bacchus","the wine god","Dionysian"],"phonetic":"/ˌdaɪəˈnaɪsəs/","extraExplanation":["“Dionysus”常见于英语写作与评论中，除了指神本身，也用来形容一种氛围或艺术气质：更感性、放纵、强调身体与情绪的释放。","罗马神话中与他对应的名字是“Bacchus”（巴克科斯），英语里有时会用Bacchus来替代或强调“酒神”的形象。","文学提及：古希腊悲剧《酒神的女信徒》（The Bacchae，欧里庇得斯）以狄俄尼索斯为核心人物，常被用来讨论理性与狂热、秩序与失控的冲突。"]}
{"word":"dionysus","summary":{"en":"Dionysus is the Greek god of wine and ecstatic celebration, and a common symbol for wild emotion and creative energy.","zh":"Dionysus（狄俄尼索斯）是希腊神话中的酒神，也常被用作狂欢激情与创造力的象征。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek mythology) The god of wine, grape harvest, festivals, theater, and ecstatic celebration; often linked with freedom from social rules and wild joy.","zh":"（希腊神话）狄俄尼索斯：葡萄与葡萄酒、丰收庆典、戏剧与狂欢的神；常象征摆脱束缚的自由与热烈的生命力。"},"examples":[{"en":"In Greek myths, Dionysus brings wine to humans and teaches them how to celebrate.","zh":"在希腊神话中，狄俄尼索斯把葡萄酒带给人类，并教人们如何庆祝。"},{"en":"Many ancient festivals honored Dionysus with music, dancing, and drama.","zh":"许多古代节日会用音乐、舞蹈和戏剧来祭祀狄俄尼索斯。"}]},{"partOfSpeech":"n.","definition":{"en":"A symbol or artistic reference to wild emotion, creative energy, and intense pleasure (often contrasted with calm order).","zh":"（文学/艺术用法）象征狂放情感、创造力与强烈快感的意象（常与理性秩序形成对比）。"},"examples":[{"en":"The novel celebrates a Dionysus-like spirit of freedom and desire.","zh":"这部小说赞美一种类似狄俄尼索斯的自由与欲望精神。"},{"en":"Some critics describe the film as Dionysian—chaotic, passionate, and sensual.","zh":"一些评论家形容这部电影很“狄俄尼索斯式”——混乱、热烈、感官强烈。"}]}],"synonyms":["Bacchus","wine god","Dionysian (related)"],"phonetic":"/ˌdaɪəˈnaɪsəs/","extraExplanation":["“Dionysus”在罗马神话中常对应“Bacchus（巴克斯）”。英语里也常见形容词“Dionysian（狄俄尼索斯式的）”，用来形容狂欢、激情、非理性的氛围。","狄俄尼索斯与古希腊戏剧关系很深：雅典的酒神节（Dionysia）是悲剧与喜剧竞演的重要舞台。","在一些思想传统里常把“Dionysian（酒神式）”与“Apollonian（阿波罗式：理性、秩序、克制）”对照，用来讨论艺术与人格的两种倾向。"]}
{"word":"Dioon","summary":{"en":"Dioon is a genus of ancient cycad plants, mainly from Mexico and Central America.","zh":"Dioon 指泽米铁属，是一类古老的苏铁类植物属，主要分布于墨西哥和中美洲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of slow-growing cycad plants (ancient, palm-like seed plants) native mainly to Mexico and Central America, often grown as ornamentals","zh":"（植物）泽米铁属：一种生长缓慢的苏铁类植物属（外形像棕榈的古老种子植物），主要原产于墨西哥和中美洲，常作观赏植物"},"examples":[{"en":"The botanic garden has a rare Dioon from Mexico in its desert house.","zh":"植物园的旱生植物温室里有一株来自墨西哥的稀有泽米铁属植物。"},{"en":"Dioon species can live for many decades if they have good drainage and bright light.","zh":"如果排水良好、光照充足，泽米铁属的一些种类可以存活几十年。"}]}],"synonyms":["cycad (general term)"],"phonetic":"/ˈdiːɑːn/","extraExplanation":["“Dioon”是一个植物学属名，通常首字母大写并用斜体表示（Dioon）。它属于“苏铁类（cycads）”，这类植物常被误认为棕榈或蕨类，但其实是更古老的一类种子植物。","词源常被解释为来自希腊语，含义与“两颗卵/两粒种子”相关，指其繁殖结构特征。"]}
{"word":"dioon","summary":{"en":"Dioon is a genus of cycad plants, mainly from Mexico and Central America.","zh":"Dioon是苏铁类植物的一个属名，主要原产于墨西哥和中美洲。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of tropical cycads (palm-like seed plants) native mainly to Mexico and Central America; also used for a plant in this genus","zh":"苏铁类植物的一个属名（Dioon，外形像棕榈的裸子植物），主要原产于墨西哥和中美洲；也可指该属中的某一种植物"},"examples":[{"en":"The botanical garden has a rare Dioon from Mexico.","zh":"那座植物园里有一株来自墨西哥的稀有Dioon苏铁。"},{"en":"Dioon plants grow slowly and can live for many years.","zh":"Dioon苏铁生长很慢，但可以活很多年。"}]}],"synonyms":["cycad (broader term)"],"phonetic":"/diˈoʊn/","extraExplanation":["“Dioon”通常出现在植物百科、园艺或学术文章里，属于专有名词（属名），日常英语对话中很少用到。","如果你本来想输入的是别的常见英文单词（比如 *dion* 或 *dune*），告诉我你想表达的意思或给我一个句子，我可以帮你找正确拼写和用法。"]}
{"word":"Diophantine","summary":{"en":"Diophantine describes integer-solution equations in number theory, and more broadly anything related to Diophantus or his work.","zh":"Diophantine 指“只求整数解”的方程（丢番图方程），也可泛指与丢番图及其数学工作相关的事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to equations whose solutions must be integers (whole numbers), especially in number theory","zh":"（尤指数论中）关于只允许整数（整数解）的方程的；丢番图方程的"},"examples":[{"en":"We studied Diophantine equations like x + y = 10, where x and y must be integers.","zh":"我们学习了像 x + y = 10 这样的丢番图方程，其中 x 和 y 必须是整数。"},{"en":"A classic Diophantine problem asks for integer solutions, not decimals.","zh":"经典的丢番图问题要求整数解，而不是小数解。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Diophantus of Alexandria (an ancient Greek mathematician) or his work","zh":"与亚历山大的丢番图（古希腊数学家）或其著作相关的"},"examples":[{"en":"The book discusses Diophantine methods from ancient Greek mathematics.","zh":"这本书讨论了古希腊数学中的丢番图方法。"}]}],"synonyms":["integer-solution (mathematics)","number-theoretic"],"phonetic":"ˌdaɪ.oʊˈfæn.taɪn","extraExplanation":["“Diophantine”来自古希腊数学家丢番图（Diophantus of Alexandria）。现代数学里最常见的用法是“丢番图方程/丢番图问题”：看起来像普通代数方程，但关键限制是解必须是整数。因为这个限制，很多问题会变得更难，常见于竞赛数学与数论。"]}
{"word":"diophantine","summary":{"en":"Diophantine describes equations or problems where you look for integer solutions.","zh":"Diophantine 指要求“整数解”的方程或问题（丢番图的）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to equations that are solved using only integers (whole numbers, including negatives and zero).","zh":"（数）丢番图的；指只允许用整数（包括负数与零）作为解的方程或问题。"},"examples":[{"en":"A Diophantine equation asks for integer solutions, not decimals.","zh":"丢番图方程要求整数解，而不是小数解。"},{"en":"Finding x and y in integers is a classic Diophantine problem.","zh":"用整数去求 x 和 y 是典型的丢番图问题。"}]},{"partOfSpeech":"n.","definition":{"en":"a type of equation or problem that requires integer solutions.","zh":"丢番图方程（或问题）：一种要求解为整数的方程（或问题）。"},"examples":[{"en":"The teacher gave us a Diophantine: 3x + 5y = 17.","zh":"老师给了我们一道丢番图方程：3x + 5y = 17。"},{"en":"Many Diophantines have no solutions at all.","zh":"很多丢番图方程根本没有解。"}]}],"synonyms":["integer-solution (in context)","number-theoretic (broader)"],"phonetic":"/ˌdiːoʊˈfæn.tiːn/","extraExplanation":["“Diophantine”来自古希腊数学家丢番图（Diophantus of Alexandria）。他研究用整数或有理数求解的方程，因此后来“只看整数解”的这类问题就用他的名字来命名。","学习提示：在数学英语里，常见搭配有 Diophantine equation（丢番图方程）、Diophantine problem（丢番图问题）、Diophantine approximation（丢番图逼近/丢番图近似）。其中 approximation 更偏“用有理数去逼近实数”的数论方向。"]}
{"word":"Diophantus","summary":{"en":"Diophantus was an ancient Greek mathematician famous for *Arithmetica* and for inspiring “Diophantine equations” in number theory.","zh":"丢番图是古希腊数学家，以《算术》闻名，并启发了数论中的“丢番图方程”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient Greek mathematician (often called the “father of algebra”), best known for the book *Arithmetica* and for inspiring the study of “Diophantine equations” (equations seeking integer solutions).","zh":"古希腊数学家（常被称为“代数学之父”），以著作《算术》（*Arithmetica*）著称，并启发了“丢番图方程”（研究整数解的方程）的发展。"},"examples":[{"en":"Diophantus’s *Arithmetica* influenced later algebra in the Islamic world and in Europe.","zh":"丢番图的《算术》影响了后来的代数学发展，包括伊斯兰世界与欧洲。"},{"en":"Fermat wrote a famous note in the margin of a book about a problem connected to Diophantus.","zh":"费马在书页边空写下了一条著名批注，内容与丢番图相关的一道问题有关。"},{"en":"In number theory, students often learn about Diophantine equations early on.","zh":"在数论中，学生往往会较早学习丢番图方程。"}]}],"synonyms":["the father of algebra"],"phonetic":"/ˌdaɪəˈfæn(t)əs/","extraExplanation":["“Diophantus”在英文里通常指人名“丢番图”。他生活的具体年代仍有争议，但一般认为在公元3世纪左右、主要在亚历山大城活动。","“Diophantine”是由他的名字派生出来的形容词，用来描述“只寻找整数（或有理数）解”的方程与问题。例如：x + y = 10 在整数范围内就有很多解。","文学与数学史中最常被提到的关联是“费马大定理”：费马宣称在丢番图的书页边发现了一个“绝妙证明”，但未写下；这一故事推动了后世对数论的研究。"]}
{"word":"diophysite","summary":{"en":"Dyophysite: a person (or view) holding that Christ has two distinct natures—divine and human—in one person.","zh":"Dyophysite：指（二性论者/二性论）主张基督在一位格中具有彼此区别的神性与人性两种本性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who believes that Jesus Christ has two distinct natures—divine and human—united in one person (a view associated with the Council of Chalcedon).","zh":"（基督论）主张耶稣基督在同一位格中具有两种彼此区别的本性（神性与人性）的人；通常与迦克墩公会议的立场相关。"},"examples":[{"en":"Many Christians who accept the Council of Chalcedon are considered dyophysites.","zh":"许多接受迦克墩公会议的人被认为属于“二性论者”（dyophysites）。"},{"en":"The historian compared dyophysite and miaphysite language in early church writings.","zh":"这位历史学家比较了早期教会文献中二性论与一性论（miaphysite）的用语。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the belief that Christ has two natures (divine and human) in one person.","zh":"与“基督具两性（神性与人性）并存于一位格”的信念有关的；二性论的。"},"examples":[{"en":"The creed is often read in a dyophysite interpretation.","zh":"这段信经常以二性论的方式来解读。"},{"en":"They studied dyophysite theology in a course on early Christianity.","zh":"他们在一门早期基督教课程中学习二性论神学。"}]}],"synonyms":["Chalcedonian","two-nature (Christology)","two-natures doctrine"],"phonetic":"/daɪˈɑfɪsaɪt/","extraExplanation":["“Dyophysite”来自希腊语：dyo-（两、二）+ physis（本性）。它常用来概括迦克墩公会议（451年）所确立的基督论表述：基督“在一位格中有两种本性，不相混乱、不相改变、不分割、不分离”。","学习时容易与“miaphysite（基督一性论/合一一性论）”混淆：miaphysite强调“合一的一种本性”（通常理解为神性与人性在合一中不可分），并不等同于极端的“monophysite（单性论）”。学术语境中这些词带有历史与宗派背景，使用时注意语境与对方传统。"]}
{"word":"Diopsidae","summary":{"en":"Diopsidae: the fly family called stalk-eyed flies.","zh":"Diopsidae：柄眼蝇（长眼柄蝇）所属的苍蝇科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of flies known as stalk-eyed flies, whose eyes are set at the ends of long lateral stalks (many species live in the Old World tropics)","zh":"一种苍蝇的科名，俗称“柄眼蝇/长眼柄蝇”，其眼睛长在向两侧伸出的长眼柄末端（许多物种分布于旧世界热带地区）"},"examples":[{"en":"Diopsidae are famous for their striking stalk-like eyestalks.","zh":"Diopsidae 因其显眼的“眼柄”而闻名。"},{"en":"Scientists study Diopsidae to understand sexual selection, because longer eyestalks can affect mating success.","zh":"科学家研究 Diopsidae 来理解性选择，因为更长的眼柄可能影响交配成功。"},{"en":"On a nature walk in Southeast Asia, we learned that some stalk-eyed flies belong to the family Diopsidae.","zh":"在东南亚的一次自然观察中，我们了解到一些柄眼蝇属于 Diopsidae 这一科。"}]}],"synonyms":["stalk-eyed flies"],"phonetic":"/daɪˈɑːpsɪdiː/","extraExplanation":["“Diopsidae”是生物分类学中的“科”名（后缀 -idae 常见于动物科名），来自其代表属名 Diopsis（再加上 -idae）。","这类昆虫常被用作演化与行为学的经典例子：在部分物种中，雄虫眼柄更长可能更受雌虫偏好，也可能与雄雄竞争有关。"]}
{"word":"diopsidae","summary":{"en":"Diopsidae: the insect family of stalk-eyed flies.","zh":"Diopsidae：柄眼蝇（长眼柄蝇）这一昆虫“科”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of flies known as stalk-eyed flies, whose eyes sit at the ends of long side stalks extending from the head","zh":"（昆虫）长眼柄蝇科；一种“柄眼蝇”，眼睛长在从头部两侧伸出的长眼柄末端"},"examples":[{"en":"Diopsidae are famous for their long eye stalks.","zh":"长眼柄蝇科以它们很长的眼柄而闻名。"},{"en":"In some Diopsidae species, males have longer eye stalks than females.","zh":"在一些长眼柄蝇科物种中，雄虫的眼柄比雌虫更长。"}]}],"synonyms":["stalk-eyed flies"],"phonetic":"/daɪˈɑpsɪdi/","extraExplanation":["“Diopsidae”是昆虫分类学中的“科”名（family），常见英文俗名是“stalk-eyed flies（柄眼蝇/长眼柄蝇）”。它们的眼柄常与求偶与性选择研究相关：在某些物种中，眼柄更长的雄虫可能更受雌虫偏好。","发音提示：词尾“-idae”在生物分类名中常读作“eye-dee”（对应 /-aɪdi/ 的感觉），整体重音常落在中间音节附近。"]}
{"word":"diopside","summary":{"en":"Diopside is a pyroxene mineral (calcium–magnesium silicate) found in rocks and sometimes used as a gemstone.","zh":"透辉石是一种辉石族矿物（钙镁硅酸盐），常见于岩石中，也可作宝石。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mineral in the pyroxene group (a calcium–magnesium silicate), usually found in igneous and metamorphic rocks; sometimes used as a gemstone (especially green chrome diopside).","zh":"透辉石（一种辉石族矿物，为含钙、镁的硅酸盐），常见于火成岩和变质岩中；有时也可作宝石（尤其是绿色的铬透辉石）。"},"examples":[{"en":"Geologists found diopside crystals in the metamorphic rock sample.","zh":"地质学家在这块变质岩样品中发现了透辉石晶体。"},{"en":"Chrome diopside is a bright green gemstone variety of diopside.","zh":"铬透辉石是透辉石的一种明亮绿色宝石品种。"}]}],"synonyms":["pyroxene","clinopyroxene"],"phonetic":"/daɪˈɑp.saɪd/","extraExplanation":["词源提示：diopside 来自希腊语词根，常被解释为与“出现两种（外观/方向）”相关，指其晶体在某些方向上可能呈现双重外观或明显解理特征。","学习提示：在日常英语里 diopside 多出现在地质学、矿物学、珠宝鉴定等语境中；普通生活对话中较少见。"]}
{"word":"diopside-bearing","summary":{"en":"“Diopside-bearing” means containing diopside, used mainly in geology to describe rocks or soils.","zh":"“diopside-bearing”意为“含透辉石的”，主要用于地质学中描述岩石或土壤。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing the mineral diopside (a calcium–magnesium silicate), often used to describe rocks or soils.","zh":"含有透辉石（diopside，一种含钙镁的硅酸盐矿物）的；常用于描述岩石或土壤。"},"examples":[{"en":"The sample is diopside-bearing, suggesting it formed under high-temperature metamorphic conditions.","zh":"该样品含透辉石，提示它可能在高温变质条件下形成。"},{"en":"Diopside-bearing skarn can host economically important mineral deposits.","zh":"含透辉石的矽卡岩可能赋存具有经济价值的矿床。"}]}],"synonyms":["diopside-containing","diopside-rich (often implies a higher amount)"],"phonetic":"/daɪˈɑp.saɪd ˈbɛrɪŋ/","extraExplanation":["“diopside-bearing”是地质学/岩石学里的复合形容词：diopside（透辉石）+ bearing（“含有……的”）。在野外记录或岩相描述中很常见，比如“garnet-bearing”（含石榴子石的）、“quartz-bearing”（含石英的）。","透辉石常见于一些镁铁质火成岩（如辉长岩）以及变质作用或接触交代作用形成的岩石（如某些大理岩、矽卡岩）。因此看到“diopside-bearing”通常意味着岩石经历过特定的成分与温压条件。"]}
{"word":"diopside-rich","summary":{"en":"Diopside-rich means “containing a high amount of the mineral diopside,” mainly used in geology/mineralogy descriptions.","zh":"diopside-rich 指“富含透辉石的”，主要用于地质学与矿物学的描述。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing a lot of diopside (a calcium-magnesium silicate mineral), especially in a rock or material sample.","zh":"（岩石或材料样品）富含透辉石的；含有大量透辉石的。"},"examples":[{"en":"The thin section shows a diopside-rich layer with scattered olivine grains.","zh":"薄片显示一层富透辉石的带状结构，其中散布着橄榄石颗粒。"},{"en":"Diopside-rich rocks often form in certain high-temperature metamorphic settings.","zh":"富透辉石的岩石常形成于某些高温变质环境中。"}]},{"partOfSpeech":"adj.","definition":{"en":"Used more generally to mean “rich in a specific component,” with “diopside” naming the component (common in scientific writing).","zh":"更一般地表示“富含某种成分”，其中 diopside 指具体成分（常见于科研写作）。"},"examples":[{"en":"We compared diopside-rich and feldspar-rich samples from the same outcrop.","zh":"我们对比了同一露头的富透辉石样品与富长石样品。"},{"en":"The melt evolved toward a diopside-rich composition as crystallization progressed.","zh":"随着结晶作用进行，熔体逐渐演化为富透辉石的成分。"}]}],"synonyms":["diopside-bearing","diopside-dominant","diopside-enriched"],"phonetic":"/ˈdaɪ.əpˌsaɪd rɪtʃ/","extraExplanation":["“diopside-rich”是由名词“diopside（透辉石）+ rich（富含的）”构成的科学复合形容词，常用于地质学/矿物学描述矿物含量高的岩石或矿物组合。","透辉石（diopside）属于“辉石（pyroxene）”族矿物，常见于某些火成岩（如玄武岩、辉长岩）和变质岩中；在地学论文里常与“olivine-rich（富橄榄石的）”“clinopyroxene-rich（富单斜辉石的）”等并列出现。"]}
{"word":"diopsides","summary":{"en":"“Diopsides” is the plural form of “diopside,” a green pyroxene mineral.","zh":"“diopsides”是“diopside（透辉石）”的复数，指一种绿色的辉石类矿物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of diopside: a green mineral (a kind of pyroxene) found in some rocks and used mainly in geology and gem contexts.","zh":"diopside（透辉石）的复数：一种常呈绿色的矿物（属于辉石类），存在于某些岩石中，主要用于地质研究与宝石相关语境。"},"examples":[{"en":"The thin section showed diopsides scattered through the rock.","zh":"岩石薄片中可以看到透辉石散布其间。"},{"en":"Some collectors look for crystals of diopsides because of their bright green color.","zh":"一些收藏者会寻找透辉石晶体，因为它们的绿色很鲜亮。"}]}],"synonyms":["diopside (singular)","pyroxenes (general class)"],"phonetic":"/daɪˈɑp.saɪdz/","extraExplanation":["“diopside/透辉石”常见于地质学与矿物学文章中；作为可数名词时，单数是 diopside，复数是 diopsides。","在日常英语里这个词不常用，多出现在矿物标本、岩石成因（如变质或火成环境）或宝石鉴定的语境中。"]}
{"word":"diopsidic","summary":{"en":"An adjective meaning “related to or containing the mineral diopside.”","zh":"形容词：表示“与透辉石有关的；含透辉石的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or containing diopside, a calcium–magnesium silicate mineral common in some igneous and metamorphic rocks.","zh":"与透辉石有关的；含透辉石的（透辉石是一种常见于某些火成岩和变质岩中的钙镁硅酸盐矿物）。"},"examples":[{"en":"The geologist described the rock as diopsidic, with visible green crystals.","zh":"地质学家把这块岩石描述为“含透辉石的”，能看到明显的绿色晶体。"},{"en":"Diopsidic pyroxene can form under high-temperature conditions.","zh":"含透辉石的辉石可在高温条件下形成。"}]}],"synonyms":["diopside-bearing","diopside-rich"],"phonetic":"/ˌdaɪ.ɑpˈsɪd.ɪk/","extraExplanation":["“diopsidic”多用于地质学、岩石学与矿物学写作中，常见搭配有 diopsidic pyroxene（含透辉石成分的辉石）或 diopsidic rock（含透辉石的岩石）。","透辉石（diopside）通常呈绿色到深绿色，因此在描述岩石或晶体外观时，diopsidic 有时也暗示“带绿、含辉石类矿物”的特征，但严格来说它指成分/矿物学归属而不是颜色。"]}
{"word":"diopsimeter","summary":{"en":"A diopsimeter is an instrument for measuring optical power in diopters, especially for lenses or eyes.","zh":"diopsimeter 指测量镜片或眼睛屈光力（屈光度）的仪器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific instrument used to measure optical power (in diopters), especially the refractive power of a lens or the eye","zh":"屈光计；测光度仪：一种用来测量光学度数（以屈光度 diopter 为单位）的仪器，常用于测量镜片或眼睛的屈光力"},"examples":[{"en":"The technician used a diopsimeter to check the optical power of the trial lens.","zh":"技师用屈光计检查试镜片的度数。"},{"en":"In older ophthalmology texts, a diopsimeter is mentioned as a tool for measuring refractive strength.","zh":"在较早的眼科文献中，屈光计被提到是一种测量屈光力的工具。"}]}],"synonyms":["dioptometer","lensmeter","focimeter"],"phonetic":"/daɪˈɑːpsɪˌmiːtər/","extraExplanation":["这个词很少见，多出现在较早期的光学/眼科语境中。现代更常见的相关词有 dioptometer（测屈光度的仪器）、lensmeter / focimeter（测镜片度数的仪器）。","diopter（屈光度）是镜片光学功率的单位：焦距为 1 米的镜片为 1 屈光度（1 D）。"]}
{"word":"Diopsis","summary":{"en":"Diopsis is a scientific name for a genus of stalk-eyed flies.","zh":"Diopsis 是长眼柄蝇属的学名（一类以长眼柄著称的昆虫）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of stalk-eyed flies (family Diopsidae), known for having eyes at the ends of long sideways stalks.","zh":"（昆虫）长眼柄蝇属：长眼柄蝇科的一属昆虫，以眼睛长在向两侧伸出的长眼柄末端而闻名。"},"examples":[{"en":"In the lab, researchers observed Diopsis males competing for mates.","zh":"在实验室里，研究人员观察到长眼柄蝇属（Diopsis）的雄虫为争夺配偶而竞争。"},{"en":"Diopsis is often mentioned when people talk about extreme eye stalks in insects.","zh":"人们讨论昆虫夸张的“眼柄”时，常会提到长眼柄蝇属（Diopsis）。"}]}],"synonyms":["stalk-eyed fly (general term)"],"phonetic":"/daɪˈɑːpsɪs/","extraExplanation":["“Diopsis”来自希腊语词根：di-（“两、双”）+ opsis（“视、外观”），指“成对的眼/外观”，与其夸张的眼柄形态相关。","在进化生物学里，Diopsis 常被用来举例说明“性选择”（sexual selection）：有些物种中雄虫眼柄更长，可能更能吸引雌虫或在竞争中占优势。","作为学名，它通常首字母大写、斜体书写（Diopsis）；口语或科普语境中也常用更泛的说法“stalk-eyed fly（长眼柄蝇）”。"]}
{"word":"diopsis","summary":{"en":"Diopsis is a genus of stalk-eyed flies famous for eyes on long side stalks.","zh":"Diopsis 指长眼柄蝇属，以“眼睛长在长眼柄上”的外形特征闻名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of stalk-eyed flies (family Diopsidae), known for having eyes on long side stalks, especially in males.","zh":"（昆虫）长眼柄蝇属：一种眼睛长在侧向“眼柄”上的苍蝇类昆虫（长眼柄蝇科），雄虫通常眼柄更长。"},"examples":[{"en":"Scientists often study Diopsis to understand sexual selection, because males with longer eyestalks may attract more mates.","zh":"科学家常研究长眼柄蝇属（Diopsis）来理解性选择，因为眼柄更长的雄虫可能更容易吸引配偶。"},{"en":"In the lab, the Diopsis flies were kept in a humid container with fruit as food.","zh":"在实验室里，这些长眼柄蝇属（Diopsis）的苍蝇被养在潮湿的容器中，并以水果为食。"}]}],"synonyms":["stalk-eyed fly (general term)","Diopsidae (related family term)"],"phonetic":"/daɪˈɑːpsɪs/","extraExplanation":["“Diopsis”是拉丁化的学名，常出现在生物学、进化学与动物行为学的文章里；如果你在科普或论文中看到它，通常指“长眼柄蝇属”而不是某一种单独的苍蝇。","长眼柄（eyestalk）常被用作研究“性选择/配偶选择”的经典例子：某些种里雌虫会偏好眼柄更长的雄虫，因此这个外形特征可能在进化中被放大。"]}
{"word":"dioptase","summary":{"en":"Dioptase is a rare, vivid green copper mineral prized by collectors and sometimes cut as a gemstone.","zh":"Dioptase（翠硅铜矿）是一种罕见、颜色鲜绿的含铜矿物，常被矿物收藏家珍视，也偶尔被切磨成宝石。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare, bright green mineral (a copper silicate) often used as a gemstone or collected as a crystal.","zh":"一种罕见的亮绿色矿物（含铜的硅酸盐），常被用作宝石或作为晶体标本收藏。"},"examples":[{"en":"The museum displayed dioptase crystals from Namibia.","zh":"博物馆展出了来自纳米比亚的翠硅铜矿晶体。"},{"en":"Because dioptase is brittle, it is usually collected rather than worn as jewelry.","zh":"由于翠硅铜矿较脆，它通常更适合收藏而不是佩戴成首饰。"}]}],"synonyms":["copper silicate (general description)"],"phonetic":"/daɪˈɑp.teɪs/","extraExplanation":["“Dioptase”一词源自希腊语，含义与“透过/看见”有关，传统解释是指它在某些晶体裂隙或内部结构下呈现出独特的“可见性/透视感”。","它的颜色常被形容为“祖母绿般的绿”，但与祖母绿（绿柱石）是完全不同的矿物；辨认时常看颜色、硬度与晶体形态。"]}
{"word":"dioptases","summary":{"en":"Dioptases are rare, vivid green copper-silicate crystals, prized mainly by mineral collectors and sometimes used in jewelry.","zh":"Dioptases 指罕见的鲜绿色含铜硅酸盐晶体，主要受矿物收藏家喜爱，有时也用于首饰。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare, bright emerald-green mineral (a copper silicate) that forms crystals and is sometimes used as a gemstone or collected by mineral enthusiasts","zh":"一种罕见的亮祖母绿色矿物（含铜硅酸盐），常以晶体形态出现，有时可作宝石或供矿物收藏"},"examples":[{"en":"The museum displayed dioptases in a glass case because the crystals are delicate.","zh":"博物馆把二斜硅铜石放在玻璃柜里展示，因为这种晶体比较脆。"},{"en":"Collectors value dioptases for their intense green color.","zh":"收藏家很看重二斜硅铜石那种浓烈的绿色。"},{"en":"She chose a small dioptase cabochon for a pendant, but it needed careful setting.","zh":"她选了一颗小的二斜硅铜石弧面宝石做吊坠，但镶嵌时需要格外小心。"}]}],"synonyms":["dioptase"],"phonetic":"/daɪˈɑp.teɪs/","extraExplanation":["“dioptase”来自希腊语词根，含义大致与“透视/看穿”有关，早期命名与其晶体在某些角度下呈现的光学效果有关。","它常见于富含铜的矿床氧化带，因此颜色通常呈明亮的祖母绿；不过硬度与韧性一般不如许多常见宝石，佩戴或加工时要注意磕碰。"]}
{"word":"diopter","summary":{"en":"Diopter is the unit for measuring a lens’s focusing power, used in eyeglass and contact lens prescriptions.","zh":"Diopter（屈光度）是衡量镜片聚焦能力的单位，常用于眼镜和隐形眼镜处方。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a unit used to measure the focusing power (optical power) of a lens; it equals 1 divided by the focal length in meters (1/m).","zh":"屈光度；用于衡量镜片的聚焦能力（光学功率）的单位；等于焦距（米）的倒数（1/米）。"},"examples":[{"en":"My glasses prescription is -2.00 diopters in my left eye.","zh":"我的眼镜处方左眼是 -2.00 屈光度。"},{"en":"A higher diopter number means a stronger lens.","zh":"屈光度数值越大，镜片度数越强。"},{"en":"Reading glasses are often labeled by diopter strength, like +1.50.","zh":"老花镜常用屈光度标注强度，比如 +1.50。"}]}],"synonyms":["dioptric power","lens power"],"phonetic":"/daɪˈɑːptɚ/","extraExplanation":["在配镜里，近视通常用负号（-）表示，表示需要“发散”镜片；远视和老花通常用正号（+）表示，表示需要“会聚”镜片。屈光度描述的是镜片的光学功率，不是镜片厚度或质量。","词源上，diopter 来自希腊语，和“观察/看”（类似于 optical、dioptric 里的视光含义）有关。在英文里常见搭配有 diopter measurement（屈光度测量）、diopter strength（屈光度强度）、dioptric power（屈光力）。"]}
{"word":"diopters","summary":{"en":"“Diopters” are units used to describe the strength (optical power) of lenses in vision prescriptions.","zh":"“Diopters”指屈光度，是用于描述眼镜/隐形镜片度数（屈光力强弱）的单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a unit that measures the optical power of a lens (how strongly it bends light); used in eyeglass and contact lens prescriptions","zh":"屈光度（D）：衡量镜片光学屈光力（弯折光线强度）的单位；常见于眼镜和隐形眼镜度数"},"examples":[{"en":"My prescription is -2.50 diopters in my right eye.","zh":"我的右眼处方是 -2.50 屈光度。"},{"en":"Stronger lenses have more diopters.","zh":"镜片越强，屈光度数值越大。"},{"en":"The doctor explained the diopters on the report.","zh":"医生解释了报告上的屈光度数值。"}]}],"synonyms":["lens power","optical power","D (abbrev.)"],"phonetic":"/daɪˈɑːptɚz/","extraExplanation":["“diopters”是复数形式，单数是“diopter”。在处方中常写作“D”。一般来说，负数（如 -2.00D）多用于近视矫正，正数（如 +1.50D）多用于远视或老花（阅读镜）。数值的绝对值越大，镜片的屈光力越强。"]}
{"word":"Dioptidae","summary":{"en":"Dioptidae: a moth family (dioptid moths) mainly found in the Americas.","zh":"Dioptidae：一种主要分布于美洲的蛾类科（彩蛾科/dioptid moths）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of moths (order Lepidoptera), commonly called dioptid moths, found mainly in the Americas","zh":"一种蛾类的科（鳞翅目），常称为“彩蛾科/Dioptid moths”，主要分布于美洲"},"examples":[{"en":"Researchers recorded several Dioptidae species in a cloud forest in Ecuador.","zh":"研究人员在厄瓜多尔的云雾林记录到了数种彩蛾科（Dioptidae）物种。"},{"en":"Some Dioptidae moths are active during the day and have bright warning colors.","zh":"一些彩蛾科（Dioptidae）的蛾在白天活动，并具有醒目的警戒色。"}]}],"synonyms":["dioptid moths","the Dioptidae family"],"phonetic":"/daɪˈɑːptɪdiː/","extraExplanation":["“Dioptidae”是生物分类学中的“科”名，通常以拉丁化形式使用，表示一个包含多个属与物种的较大分类单元。","学习生物学英语时，科名常以“-idae”结尾（如 Nymphalidae 眼蝶科、Formicidae 蚁科）。读写时一般不需要加冠词“the”，但在句子中可说“the Dioptidae family”。"]}
{"word":"dioptidae","summary":{"en":"Dioptidae is the scientific name of a family of moths.","zh":"Dioptidae 是一个蛾类科（透蛾科）的学名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of moths (dioptid moths) in the order Lepidoptera, many of which are found in Central and South America.","zh":"（昆虫分类）透蛾科：鳞翅目中的一个蛾类科，许多物种分布于中美洲与南美洲。"},"examples":[{"en":"Scientists recorded several Dioptidae species in a rainforest survey.","zh":"科学家在一次雨林调查中记录了数种透蛾科的物种。"},{"en":"Some Dioptidae moths have bright colors that can resemble butterflies.","zh":"有些透蛾科蛾类颜色鲜艳，看起来会像蝴蝶。"}]}],"synonyms":["dioptid moths"],"phonetic":"/daɪˈɑːptɪˌdi/","extraExplanation":["“Dioptidae”是生物分类学中的科名，常见于昆虫学、生态调查与博物馆标本标签中。","很多透蛾科成员属于新热带区（Neotropics）常见的蛾类；在野外观察时，人们有时会把它们与蝴蝶混淆，因为部分种类具鲜明花纹与日行性行为。"]}
{"word":"dioptograph","summary":{"en":"A dioptograph is a rare term for an optical instrument that helps you copy or draw something accurately.","zh":"dioptograph 指一种较少见的光学绘图工具，用来辅助准确临摹或描绘。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device used to help an artist copy a scene or drawing accurately by using optics (a sighting/reflecting system) to guide the hand.","zh":"（绘图用）屈光描绘仪；一种利用光学（瞄准/反射装置）帮助画家准确临摹景物或图画的工具。"},"examples":[{"en":"In the 1800s, some artists used a dioptograph to keep proportions accurate when copying landscapes.","zh":"在19世纪，一些画家会用屈光描绘仪临摹风景，以保持比例准确。"},{"en":"The museum displayed a dioptograph alongside other early optical drawing aids.","zh":"博物馆把屈光描绘仪与其他早期光学绘图辅助工具一起展出。"}]}],"synonyms":["camera lucida","drawing aid","optical drawing instrument"],"phonetic":"/daɪˈɑːptəˌɡræf/","extraExplanation":["这个词比较少见，常出现在艺术史或光学仪器史的语境里。词根来自希腊语：dio-/diop-（与“透视/视线、光学观察”相关）+ -graph（“书写、绘制”）。它和 camera lucida（暗箱/反射成像的绘画辅助工具）在用途上相近：都是为了帮助画者更准确地“对照着画”。"]}
{"word":"dioptometer","summary":{"en":"A dioptometer is an instrument for measuring the eye’s refractive power to help determine a vision prescription.","zh":"dioptometer 指用于测量眼睛屈光度、帮助确定视力处方的验光仪器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a device used by eye-care professionals to measure the refractive power (focusing error) of the eyes and help determine a glasses/contact-lens prescription","zh":"（验光用的）屈光度计；用于测量眼睛屈光状态（聚焦误差），以帮助确定眼镜或隐形眼镜度数的仪器"},"examples":[{"en":"The optometrist used a dioptometer to check how my eyes focus at different distances.","zh":"验光师用屈光度计检查我的眼睛在不同距离下的对焦情况。"},{"en":"A dioptometer reading can help confirm whether you are nearsighted or farsighted.","zh":"屈光度计的读数可以帮助确认你是近视还是远视。"}]}],"synonyms":["lensmeter","phoropter","refractometer"],"phonetic":"/daɪˈɑp.təˌmiː.tɚ/","extraExplanation":["“dioptometer”由“diopter（屈光度）+ -meter（测量仪）”构成，核心含义就是“测量屈光度的仪器”。在实际场景中，它常与“验光（refraction test）”“处方（prescription）”等一起出现。"]}
{"word":"dioptometry","summary":{"en":"Dioptometry is the science/practice of measuring the eye’s or a lens’s refractive power.","zh":"Dioptometry 指测量眼睛或镜片屈光力（屈光度）的学科/做法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the measurement of the refractive power of the eye or of lenses (often expressed in diopters)","zh":"屈光测量学；测量眼睛或镜片屈光度（常以屈光度 diopter 表示）的学科"},"examples":[{"en":"The clinic uses dioptometry to determine which lens power you need.","zh":"诊所会用屈光测量来确定你需要多大度数的镜片。"},{"en":"A basic dioptometry test can help identify nearsightedness or farsightedness.","zh":"基础的屈光测量检查有助于发现近视或远视。"}]}],"synonyms":["refraction measurement","refractometry (related)","optical power measurement"],"phonetic":"/daɪˈɑptəˌmɛtri/","extraExplanation":["“dioptometry”与“diopter（屈光度）”有关：1 diopter 表示焦距为 1 米的镜片的屈光能力。日常配镜时常听到的“度数”在专业上常用屈光度来表示。","不要与“optometry（验光/视光学）”混淆：optometry 更广，包含视力检查、配镜与视功能评估；dioptometry 更强调“屈光度的测量/计算”。"]}
{"word":"dioptomiter","summary":{"en":"Dioptometer: a device used in optometry to measure the refractive (focusing) power of the eye or a lens.","zh":"Dioptometer：验光中用于测量眼睛或镜片屈光（聚焦）能力的仪器。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually spelled “dioptometer”) an instrument used by eye doctors to measure the focusing power (refraction) of the eye or of a lens.","zh":"（通常拼作“dioptometer”）一种眼科/验光仪器，用来测量眼睛或镜片的屈光度（聚焦能力）。"},"examples":[{"en":"The optometrist used a dioptometer to measure the lens power in my glasses.","zh":"验光师用屈光度计测量我眼镜镜片的度数。"},{"en":"A dioptometer helps check whether a lens matches the prescription.","zh":"屈光度计可以帮助检查镜片是否符合处方度数。"}]}],"synonyms":["lensmeter","focimeter","lensometer"],"phonetic":"/daɪˈɑp.tɑː.mə.tɚ/","extraExplanation":["你输入的“dioptomiter”更常见的正确拼写是 **dioptometer**（屈光度计）。","词根提示：**diopter/dioptre** 指“屈光度”（镜片度数的单位），**-meter** 表示“测量仪器”。屈光度越大，镜片的聚焦能力越强（如近视/远视矫正镜片）。"]}
{"word":"dioptoscopy","summary":{"en":"Dioptoscopy means examining or measuring how the eye focuses light (refraction), often to assess vision problems.","zh":"Dioptoscopy 指对眼睛的屈光力进行检查或测量，常用于评估视力问题。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medicine, optometry) The examination or measurement of the eye’s refractive power (how the eye focuses light), especially to detect or evaluate vision problems.","zh":"（医学/验光）屈光检查；对眼睛的屈光力（聚焦光线的能力）进行检查或测量，以发现或评估视力问题。"},"examples":[{"en":"The optometrist performed dioptoscopy to estimate the patient’s refractive error.","zh":"验光师进行了屈光检查，以估计患者的屈光不正程度。"},{"en":"Dioptoscopy can help determine whether a person may be nearsighted or farsighted.","zh":"屈光检查有助于判断一个人是否可能近视或远视。"}]}],"synonyms":["refraction test","refractometry","eye examination"],"phonetic":"/ˌdaɪɑpˈtɑskəpi/","extraExplanation":["这个词较少见，更多时候会用更常见的说法，如 refraction test（屈光检查）、eye exam（眼科检查）、refractometry（屈光测量）。","词源上可拆为 dio- / diopt-（与“屈光度 diopter/dioptre”相关，表示光学折射能力）+ -scopy（观察、检查）。","在现代临床语境里，它通常指通过仪器或方法评估“屈光不正”（如近视、远视、散光）的检查过程。"]}
{"word":"dioptra","summary":{"en":"Dioptra is a historical Greek instrument (or sighting tube) used for surveying and aiming, especially for measuring angles and aligning lines.","zh":"Dioptra 指一种古希腊用于测量与瞄准的仪器（或视筒），常用于测角与校准直线。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient Greek surveying and sighting instrument used to measure angles and align lines; a predecessor of the theodolite.","zh":"（古希腊的）测量与瞄准仪器，用来测角和校准直线；可视为经纬仪（theodolite）的早期雏形。"},"examples":[{"en":"Ancient engineers used a dioptra to set out straight roads and aqueducts.","zh":"古代工程师会用 dioptra 来放样直线道路和引水渠。"},{"en":"The text describes how to aim the dioptra at a distant marker before taking a reading.","zh":"书中描述了在读数前如何把 dioptra 对准远处的标记。"}]},{"partOfSpeech":"n.","definition":{"en":"A viewing tube or sighting device (especially in older scientific or optical contexts).","zh":"（尤用于较早期的科学或光学语境）瞄准管；观察用的视筒。"},"examples":[{"en":"He looked through the dioptra to align the instrument with the target.","zh":"他通过 dioptra 的视筒把仪器与目标对齐。"},{"en":"In some historical descriptions, the dioptra is essentially a simple sighting tube.","zh":"在一些历史描述中，dioptra 基本上就是一种简单的瞄准管。"}]}],"synonyms":["theodolite (historical predecessor)","surveying instrument","sighting tube"],"phonetic":"/daɪˈɑptrə/","extraExplanation":["dioptra 源自希腊语，原意与“看穿/观察”有关，常见于古代测量学与工程学文献中（例如与古代水利、道路测量相关）。","它与现代的 diopter（屈光度）在词源上有关：两者都与“视力/观察”概念相关，但含义不同——diopter 是光学单位，而 dioptra 是仪器名称。"]}
{"word":"dioptral","summary":{"en":"“Dioptral” means “related to diopters,” the unit used to describe lens power in vision prescriptions.","zh":"“dioptral”意为“与屈光度有关的”，屈光度是眼镜处方中表示镜片度数（光学功率）的单位。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a diopter (a unit used to measure the optical power of a lens).","zh":"与“屈光度”（diopter，用来表示镜片光学度数的单位）有关的。"},"examples":[{"en":"The optometrist recorded the dioptral value of the lens in your prescription.","zh":"验光师在你的处方中记录了镜片的屈光度数值。"},{"en":"Small dioptral changes can noticeably affect how clearly you see at a distance.","zh":"屈光度的细微变化也可能明显影响你看远处的清晰度。"}]}],"synonyms":["dioptric","optical (in context)"],"phonetic":"/daɪˈɑːptrəl/","extraExplanation":["“dioptral”在日常英语中比较少见，更常见的是用“diopter/dioptre”（屈光度）或直接说“lens power”（镜片度数/光学功率）。在配镜语境里，人们通常说“a -2.00 diopter lens”（-2.00度的镜片）而不是“a dioptral lens”。","屈光度（diopter）表示镜片的光学功率，数值越大（绝对值越大）镜片越“强”。例如近视常用负数（-），远视常用正数（+）。"]}
{"word":"dioptrate","summary":{"en":"Diopter is a unit for lens strength (optical power), commonly used in eyeglass and contact lens prescriptions.","zh":"Diopter（屈光度）是表示镜片度数/折光能力的单位，常用于眼镜和隐形眼镜处方。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a unit that measures the optical power of a lens (how strongly it bends light), equal to 1 divided by the focal length in meters","zh":"（屈光度）衡量镜片“折光能力/度数”的单位；等于 1 ÷（焦距以米计）"},"examples":[{"en":"My glasses are -2.50 diopters in my left eye.","zh":"我左眼眼镜度数是 -2.50 屈光度。"},{"en":"This contact lens has a power of +1.00 diopter.","zh":"这副隐形眼镜的度数是 +1.00 屈光度。"},{"en":"The doctor adjusted the lens strength by 0.25 diopters.","zh":"医生把镜片度数调整了 0.25 屈光度。"}]},{"partOfSpeech":"n.","definition":{"en":"a focusing device or sight on an optical instrument (less common)","zh":"（较少见）光学仪器上的对焦装置或瞄准器"},"examples":[{"en":"The microscope’s diopter helps you focus the image for each eye.","zh":"显微镜的屈光度调节环可以帮助你分别为左右眼对焦。"}]}],"synonyms":["dioptre","lens power","optical power"],"phonetic":"/daɪˈɑːptɚ/","extraExplanation":["你输入的“dioptrate”常见是拼写错误；更常用的词是 **diopter**（美式）或 **dioptre**（英式）。","在验光/配镜中，度数常写成 **+** 或 **-**：一般来说，**-** 多用于近视（myopia），**+** 多用于远视（hyperopia）。临床上也常以 **0.25 D** 为一个调整步进（quarter diopter）。","词源来自希腊语，和“看/观察”有关，因此与光学测量、透镜调节等语境联系紧密。"]}
{"word":"dioptre","summary":{"en":"Dioptre is a unit for lens power, used especially for eyeglass prescriptions.","zh":"dioptre 指“屈光度”，是衡量镜片度数（光学功率）的单位，常用于眼镜处方。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a unit used to measure the optical power of a lens (how strongly it bends light), equal to 1 divided by the focal length in meters","zh":"屈光度（透镜光学度数的单位），表示透镜使光线会聚或发散的能力；数值等于焦距（米）的倒数"},"examples":[{"en":"My glasses are -2.50 dioptres in the right eye.","zh":"我右眼眼镜度数是 -2.50 屈光度。"},{"en":"A higher dioptre number means a stronger lens.","zh":"屈光度数值越高，镜片越强。"},{"en":"The optometrist adjusted the lens power by 0.25 dioptre.","zh":"验光师把镜片度数调整了 0.25 屈光度。"}]}],"synonyms":["diopter","lens power"],"phonetic":"/daɪˈɑp.tɚ/","extraExplanation":["拼写差异：英式英语常写作 dioptre；美式英语更常用 diopter。含义相同。","正负号含义：一般来说，近视镜片多为负屈光度（-），远视/老花等多为正屈光度（+）。","简单公式：屈光度 D = 1 / 焦距（米）。例如焦距 0.5 m 的透镜是 2 D。"]}
{"word":"dioptres","summary":{"en":"Dioptres are units that show the strength (optical power) of lenses, commonly used in vision prescriptions.","zh":"Dioptres（屈光度）是表示镜片折光强度的单位，常用于视力处方。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a unit used to measure the optical power of a lens (how strongly it bends light), equal to 1 divided by the focal length in meters; used in eyeglass and contact lens prescriptions","zh":"屈光度（镜片度数）的单位，用来表示镜片折光能力；数值等于焦距（以米计）的倒数，常见于眼镜与隐形眼镜处方"},"examples":[{"en":"My prescription is −2.00 dioptres in my left eye.","zh":"我的处方左眼是 −2.00 屈光度。"},{"en":"The optometrist adjusted the lenses by half a dioptre.","zh":"验光师把镜片度数调整了 0.5 个屈光度。"},{"en":"Higher dioptres usually mean a stronger lens.","zh":"屈光度越高，通常表示镜片度数越强。"}]}],"synonyms":["diopters","lens power","refractive power"],"phonetic":"/daɪˈɑːptɚz/","extraExplanation":["“dioptres”是英式拼写与复数形式；美式更常写作“diopters”。单数为“dioptre/diopter”。","屈光度可以是正数或负数：一般来说，近视镜片常用负屈光度（如 −3.00D），远视镜片常用正屈光度（如 +2.00D）。","在口语或处方中常把dioptre/diopter简称为“D”（例如“−1.50D”）。"]}
{"word":"dioptric","summary":{"en":"Dioptric describes something related to the refraction of light by lenses, especially in the eye or optical devices.","zh":"Dioptric 指与镜片等造成的光的折射有关，常用于眼睛或光学仪器的语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the refraction (bending) of light by lenses, especially in optical instruments or the eye.","zh":"与光的折射（被镜片等使光线弯折）有关的，尤指光学仪器或眼睛中的折射。"},"examples":[{"en":"The optometrist measured the eye’s dioptric power to choose the right lens.","zh":"验光师测量了眼睛的屈光度，以选择合适的镜片。"},{"en":"Glasses correct vision by changing the dioptric refraction of light entering the eye.","zh":"眼镜通过改变进入眼睛的光线折射来矫正视力。"}]}],"synonyms":["refractive","optical"],"phonetic":"/daɪˈɑptrɪk/","extraExplanation":["“dioptric”常见于光学与眼科语境，和“catoptric（反射的）”相对：dioptric讲折射，catoptric讲反射。","它与“diopter（屈光度）”同源；处方里常见的D（如 -2.00 D）就是屈光度单位，用来表示镜片的折射能力强弱。"]}
{"word":"dioptrical","summary":{"en":"Dioptrical means “related to lenses and the refraction of light,” or “related to diopters (lens power).”","zh":"dioptrical 指“与透镜折射光有关的”，也可指“与屈光度（镜片度数）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the refraction (bending) of light by lenses; dioptric.","zh":"（光学）与透镜对光的折射有关的；折射的（dioptric）。"},"examples":[{"en":"Dioptrical lenses focus light by refraction, not by reflection.","zh":"Dioptrical 透镜通过折射来聚焦光线，而不是通过反射。"},{"en":"The microscope’s dioptrical system must be aligned for a clear image.","zh":"显微镜的 dioptrical 光学系统必须校准对齐，图像才会清晰。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to a diopter (a unit used to describe the optical power of a lens).","zh":"与屈光度（diopter，用来表示镜片光学度数的单位）有关的。"},"examples":[{"en":"The optometrist recorded the dioptrical value of the new prescription.","zh":"验光师记录了新处方的屈光度（dioptrical value）。"},{"en":"A small change in dioptrical power can affect how clearly you see far away.","zh":"屈光度（dioptrical power）哪怕小幅变化，也可能影响你看远处是否清晰。"}]}],"synonyms":["dioptric","refractive","optical"],"phonetic":"/daɪˈɑp.trɪ.kəl/","extraExplanation":["“dioptrical”在现代英语中较少见，更常用的是“dioptric”（折射的）或“dioptrics”（屈光学/折射光学）。在眼科与配镜语境里，人们也更常直接说“diopter/diopters”（屈光度/度数）。","词源上与希腊语“dia-”（穿过）和表示“看”的词根有关，强调“光线穿过介质后被折弯/折射”。"]}
{"word":"dioptrically","summary":{"en":"“Dioptrically” means “in terms of diopters” or “with respect to optical refraction/focusing,” mainly used in optometry and technical optics.","zh":"“dioptrically”表示“从屈光度（度数）的角度/就折射与聚焦而言”，多用于验光、眼科与光学技术语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In terms of diopters (a unit for the optical power of a lens), especially when describing refractive error or lens strength in eye care.","zh":"以屈光度（diopter，镜片光学度数的单位）的角度；尤用于描述屈光不正或镜片度数。"},"examples":[{"en":"The patient is stable dioptrically, so the prescription hasn’t changed.","zh":"患者的度数（屈光度）总体稳定，所以处方没有变化。"},{"en":"These two lenses differ dioptrically by 0.50 D.","zh":"这两片镜片在度数上相差0.50D。"}]},{"partOfSpeech":"adv.","definition":{"en":"With respect to refraction or the focusing/bending of light in an optical system (often in technical writing).","zh":"就折射或光在光学系统中的聚焦/偏折而言（多见于技术性写作）。"},"examples":[{"en":"The camera was adjusted dioptrically to sharpen the viewfinder image.","zh":"相机通过屈光（视度）调节来让取景器图像更清晰。"},{"en":"The device compensates dioptrically for small focusing errors.","zh":"该装置通过屈光方式补偿轻微的对焦误差。"}]}],"synonyms":["in diopters","optically","refractively"],"phonetic":"/daɪˈɑːptrɪkli/","extraExplanation":["“dioptrically”来自“diopter/dioptric”。在验光与眼科里，D（diopter，屈光度）是最常见的写法：+2.00 D 表示远视/凸透镜度数，-3.00 D 常表示近视/凹透镜度数。这个副词在日常对话里不常用，更常出现在病历、验光报告或光学工程文档中。"]}
{"word":"dioptrics","summary":{"en":"Dioptrics is the study of refraction—how lenses bend light.","zh":"Dioptrics 指屈光学：研究透镜等如何使光线发生折射（弯曲）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the science or study of light refraction (how light bends) through lenses; lens optics","zh":"（光学）屈光学；研究光线通过透镜等介质时如何折射（弯曲）的学科"},"examples":[{"en":"In physics class, we studied dioptrics to understand how eyeglasses correct vision.","zh":"在物理课上，我们学习屈光学来理解眼镜如何矫正视力。"},{"en":"The camera designer focused on dioptrics to improve sharpness across the image.","zh":"相机设计师专注于屈光学，以提升整幅画面的清晰度。"}]}],"synonyms":["geometrical optics","lens optics","refraction (study)"],"phonetic":"/daɪˈɑːptrɪks/","extraExplanation":["“Dioptrics”来自希腊语词根，和“diopter（屈光度）”同源。日常配镜时说的“度数”（例如 -2.00D）就是以屈光度表示镜片的光学强度。需要注意：dioptrics 指“屈光学/折射光学”这门领域；diopter 指“屈光度”这个单位，二者相关但不是同一个词。"]}
{"word":"dioptrometer","summary":{"en":"A dioptrometer is a device that measures the refractive power of lenses or eyes in diopters, used for prescribing glasses or contacts.","zh":"dioptrometer 指用于测量镜片或眼睛屈光度（屈光度单位为 diopter）的仪器，常用于验光与配镜/配隐形。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an instrument used by eye-care professionals to measure the refractive power of a lens or an eye (in diopters), helping determine a glasses or contact-lens prescription","zh":"验光仪；屈光度计（用于测量镜片或眼睛的屈光度，以屈光度 diopter 为单位，帮助确定眼镜/隐形眼镜度数）"},"examples":[{"en":"The optometrist used a dioptrometer to check the power of my old glasses.","zh":"验光师用屈光度计检测我旧眼镜的度数。"},{"en":"This dioptrometer measures lens strength in diopters.","zh":"这台屈光度计用屈光度来测量镜片的度数。"}]}],"synonyms":["lensmeter","focimeter","lensometer"],"phonetic":"/daɪˈɑp.trəˌmiː.tɚ/","extraExplanation":["“dioptrometer”较偏专业与技术场景，在日常英语里更常听到的是 eye exam（眼科检查/验光）或 prescription（处方/度数）。","词根提示：dio- 来自 diopter（屈光度）；-meter 表示“测量仪器”。理解为“测屈光度的仪器”即可。"]}
{"word":"dioptrometry","summary":{"en":"Dioptrometry is the measurement of lens or eye refractive power in diopters.","zh":"Dioptrometry 指用屈光度（D）来测量镜片或眼睛屈光力的方法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The measurement of the refractive power of a lens or the eye, usually expressed in diopters (D).","zh":"屈光度测量法；测量镜片或眼睛屈光力的方法，通常以屈光度（D）表示。"},"examples":[{"en":"The optometrist used dioptrometry to determine the correct strength of my glasses.","zh":"验光师用屈光度测量来确定我眼镜的合适度数。"},{"en":"Dioptrometry helps compare different lenses by their diopter values.","zh":"屈光度测量可以通过屈光度数值来比较不同镜片。"}]}],"synonyms":["refraction measurement","lens power measurement"],"phonetic":"/daɪˌɑpˈtrɑmətri/","extraExplanation":["词源提示：dioptrometry 来自 diopter（屈光度）+ -metry（测量）。在眼科/视光学里，diopter（D）是表示镜片屈光力的单位，数值越大，镜片“度数”越强。","使用场景：日常更常见的说法是 eye exam / refraction test（验光/屈光检查）；dioptrometry 更偏专业书面或技术语境。"]}
{"word":"dioptroscopy","summary":{"en":"Dioptroscopy is a rare term meaning the examination or measurement of refractive power in the eye or optical systems.","zh":"Dioptroscopy 是个较罕见的词，指对眼睛或光学系统的屈光力（折射能力）进行检查或测量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The examination or measurement of the refractive power of the eye or of optical systems (the ability to bend light), especially using instruments such as a dioptroscope.","zh":"（尤指借助屈光镜等仪器）对眼睛或光学系统的屈光力/折射能力（使光线发生折射的能力）进行检查或测量。"},"examples":[{"en":"In some older medical texts, dioptroscopy refers to testing a patient’s refraction before prescribing glasses.","zh":"在一些较早的医学文献中，dioptroscopy 指为配镜而进行的屈光检查。"},{"en":"The clinician used a dioptroscope for dioptroscopy to estimate the lens power needed.","zh":"临床人员用屈光镜进行 dioptroscopy，以估算所需镜片度数。"}]}],"synonyms":["refraction test","refractometry","optometry"],"phonetic":"/daɪˈɑːptrəskəpi/","extraExplanation":["这个词非常少见，多见于较旧的光学/眼科文献。现代英语里更常用的相关说法是 refraction test（验光/屈光检查）、refractometry（屈光测量）或 optometry（视光学/验光）。","词源上可拆为 dio-（与“diopter/屈光度”相关）+ -opt-（“眼/视/光”）+ -scopy（“观察、检查”）。diopter（屈光度）是衡量镜片或光学系统折射能力的单位。"]}
{"word":"dioptry","summary":{"en":"Diopter (often misspelled as dioptry) is the unit used to express the strength (optical power) of a lens.","zh":"Diopter（常被误拼为 dioptry）是表示镜片“度数/光学强度”的单位：屈光度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(also spelled diopter; UK: dioptre) a unit used to measure the optical power of a lens, equal to 1 divided by the focal length in meters.","zh":"（也拼作 diopter；英式：dioptre）屈光度：衡量镜片光学度数的单位，等于焦距（以米计）的倒数（1/焦距）。"},"examples":[{"en":"My glasses are -2.50 diopters in the left eye.","zh":"我左眼眼镜度数是 -2.50 屈光度。"},{"en":"A +1.00 diopter lens helps some people read more comfortably.","zh":"+1.00 屈光度的镜片能让一些人阅读更舒服。"},{"en":"The optometrist adjusted the prescription by 0.25 diopters.","zh":"验光师把处方度数调整了 0.25 屈光度。"}]}],"synonyms":["lens power","optical power"],"phonetic":"/daɪˈɑːptər/","extraExplanation":["你输入的 **dioptry** 常见于拼写错误；标准拼法多为 **diopter**（美式）或 **dioptre**（英式）。","屈光度的正负常用来表示远视/老花（+）与近视（-），但具体情况仍以验光处方为准。"]}
{"word":"Dior","summary":{"en":"Dior is a French luxury fashion brand; it can also refer to its founder, Christian Dior.","zh":"Dior 指法国奢侈时装品牌“迪奥”，也可指其创始人克里斯汀·迪奥。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a famous French luxury fashion house known for haute couture, ready-to-wear clothing, handbags, perfumes, and cosmetics.","zh":"（迪奥）著名的法国奢侈时装品牌，以高级定制、成衣、手袋、香水与彩妆等闻名。"},"examples":[{"en":"She bought a Dior perfume as a birthday gift.","zh":"她买了一瓶迪奥香水当作生日礼物。"},{"en":"Dior is known for elegant, classic designs.","zh":"迪奥以优雅、经典的设计风格闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"Christian Dior (1905–1957), the French fashion designer who founded the Dior fashion house.","zh":"克里斯汀·迪奥（1905–1957），创立迪奥品牌的法国时装设计师。"},"examples":[{"en":"Christian Dior introduced the “New Look” after World War II.","zh":"二战后，克里斯汀·迪奥推出了“New Look（新风貌）”。"}]}],"synonyms":["Christian Dior","Dior (fashion house)"],"phonetic":"/diˈɔr/","extraExplanation":["“Dior”常见读法为 /diˈɔr/，重音在第二音节。中文多译为“迪奥”。","在文化语境中，“Dior”常被用来指代一种“法式奢华/优雅”的品牌形象；在时尚报道里也可作为定语使用（如“Dior dress/迪奥连衣裙”）。","文学与媒体中常见把“Dior”与“New Look（新风貌）”联系起来：它是1947年前后的一种标志性轮廓与风格，强调收腰与更饱满的裙摆。"]}
{"word":"diorama","summary":{"en":"A diorama is a 3D scene or model, often used in museums or school projects to show a place, event, or story realistically.","zh":"diorama 指用于逼真展示地点、事件或故事的立体场景模型（或立体陈列）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small three-dimensional model or scene (often inside a box or behind glass) that shows a place, event, or story, commonly used in museums or school projects.","zh":"立体场景模型（常放在盒子里或玻璃后），用来展示某个地点、事件或故事，常见于博物馆或学校作业。"},"examples":[{"en":"The museum has a diorama of a rainforest with animals and plants.","zh":"博物馆里有一个雨林立体场景模型，里面有动物和植物。"},{"en":"We made a diorama of the solar system for science class.","zh":"我们为科学课做了一个太阳系的立体模型。"},{"en":"The diorama makes the historical battle easier to imagine.","zh":"这个立体场景让人更容易想象那场历史战役。"}]},{"partOfSpeech":"n.","definition":{"en":"A method of displaying objects or scenes with realistic backgrounds and lighting to create a lifelike effect (especially in museum exhibits).","zh":"（尤指博物馆展陈中的）立体陈列法：用逼真的背景与灯光展示物体或场景，使其看起来更真实。"},"examples":[{"en":"Natural history museums often use diorama to show animals in their habitats.","zh":"自然历史博物馆常用立体陈列法来展示动物的栖息环境。"},{"en":"Careful lighting is important in diorama displays.","zh":"在立体陈列展示中，精心的灯光很重要。"}]}],"synonyms":["model","miniature scene","display","exhibit"],"phonetic":"/ˌdaɪəˈræmə/","extraExplanation":["diorama 常见于美国的自然历史博物馆（如展示“森林/沙漠/极地”的动物生态场景）。它不只是“模型”，更强调把观众带入一个“像真的一样”的场景：前景的立体物体 + 背景绘画/照片 + 灯光与透视。","词源上，diorama 来自希腊语词根，含义与“穿透/看见”相关。19 世纪时它也指一种舞台式的视觉表演：用大型画布与灯光变化制造逼真效果；后来意义逐渐固定为今天常见的“立体场景展示”。"]}
{"word":"diorama-like","summary":{"en":"“Diorama-like” means resembling a detailed, realistic mini-scene or display with depth, like a museum diorama.","zh":"“diorama-like”指像博物馆立体展景/场景模型那样：细致、逼真、有纵深感，常带“微缩景观”的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a diorama: a small, detailed scene (often in a box or museum display) that looks realistic, with depth and careful arrangement.","zh":"像立体模型展景（diorama）的：指像盒子/博物馆展示中的小型立体场景一样，细节丰富、具有纵深感、布局精心。"},"examples":[{"en":"The museum room had a diorama-like display of an ancient village.","zh":"博物馆的展厅里有一个像展景模型一样的古代村落展示。"},{"en":"The filmmaker used diorama-like sets to make the city feel miniature and dreamlike.","zh":"导演使用了类似展景模型的布景，让城市看起来像缩小版一样梦幻。"}]}],"synonyms":["miniature-looking","model-like","scene-like","display-like","tableau-like"],"phonetic":"/ˌdaɪəˈrɑmə laɪk/","extraExplanation":["“diorama-like”是由名词“diorama（立体布景/场景模型）+ -like（像……一样）”构成的形容词，常用来形容视觉效果：精致、分层、有透视感，甚至带一点“微缩”“人造但逼真”的感觉。","“diorama”常见于自然历史博物馆（动物标本+背景绘画/立体景物）或手工模型（铁路模型、战争模型等）的语境里，因此“diorama-like”也经常出现在艺术评论、电影美术、摄影与装置艺术的描述中。"]}
{"word":"dioramas","summary":{"en":"“Dioramas” is the plural of “diorama,” meaning small, detailed 3D scene models often seen in museums or school projects.","zh":"“Dioramas”是“diorama”的复数，指常见于博物馆或学校作业中的小型、细节丰富的立体场景模型。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A diorama: a small three-dimensional scene or model (often inside a box or behind glass) showing a place, event, or story, usually with realistic details.","zh":"立体场景模型；透景模型：一种小型的三维场景展示（常放在盒子里或玻璃后），用逼真的细节呈现某个地点、事件或故事。"},"examples":[{"en":"The museum has dioramas of ancient Egyptian tombs.","zh":"博物馆里有古埃及墓室的立体场景模型。"},{"en":"For the school project, we built dioramas of different ecosystems.","zh":"为了学校作业，我们制作了不同生态系统的立体场景模型。"},{"en":"The children pressed their faces to the glass to look at the holiday dioramas.","zh":"孩子们把脸贴在玻璃上看节日主题的立体场景。"}]}],"synonyms":["models","miniatures","displays","tableaux"],"phonetic":"/ˌdaɪəˈrɑːməz/","extraExplanation":["“Diorama”常见于博物馆（自然史馆、战争纪念馆等）和手工/模型制作领域，用来帮助观众“身临其境”地理解历史、自然或故事。","词源来自希腊语：dia-（穿过）+ horama（景象/观看的东西），最早与19世纪的特殊舞台/光影展示有关，后来含义逐渐固定为“立体场景模型”。","常搭配：a museum diorama（博物馆立体模型）、a diorama display/exhibit（立体场景展示/展品）、build/make a diorama（制作立体场景模型）。"]}
{"word":"dioramic","summary":{"en":"Dioramic describes something related to or like a diorama—a detailed 3D scene or model.","zh":"dioramic 用来形容与立体景观模型有关，或呈现方式像立体场景/微缩模型一样。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to or resembling a diorama (a three-dimensional model or scene, often displayed in a museum).","zh":"与立体景观模型（diorama，常见于博物馆展陈的三维场景）有关的；像立体景观模型的。"},"examples":[{"en":"The museum added dioramic displays to help visitors imagine life in ancient times.","zh":"博物馆新增了立体景观式的展陈，帮助参观者想象古代生活。"},{"en":"The film uses dioramic sets that look like detailed miniature worlds.","zh":"这部电影使用了立体景观般的布景，看起来像精细的微缩世界。"}]}],"synonyms":["diorama-like","three-dimensional","scenic"],"phonetic":"ˌdaɪəˈræmɪk","extraExplanation":["“dioramic”来自名词“diorama（立体景观/立体模型场景）”。在日常英语里，“diorama”更常见；“dioramic”多用于艺术、博物馆、展览或影像制作等语境，用来强调“像立体场景那样的呈现方式”。"]}
{"word":"diordinal","summary":{"en":"Diordinal is a rare adjective meaning “involving two orders or a pair of ordinals.”","zh":"Diordinal 是个很少见的形容词，意为“涉及两种阶次/排序层级或一对序数。”"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/technical) Having two orders, ranks, or levels of ordering; involving a pair of ordinals.","zh":"（罕见/术语）具有两种“阶次/等级/排序层级”的；涉及一对序数（ordinal）的。"},"examples":[{"en":"In a few technical notes, a diordinal relation is described as ordering items in two independent ways.","zh":"在一些技术性笔记中，“diordinal 关系”被描述为用两种相互独立的方式给事物排序。"},{"en":"The author compares a simple ordinal scale with a diordinal scheme that tracks rank and priority separately.","zh":"作者把简单的序数刻度与一种 diordinal 方案作比较：它把“排名”和“优先级”分开记录。"}]}],"synonyms":["second-order","two-level","dual-order","biordinal"],"phonetic":"/daɪˈɔrdənəl/","extraExplanation":["“diordinal”在现代英语里非常少见，通常只会出现在个别学术/技术文本中；很多词典可能不收录。若你想表达更常见、更清晰的意思，常用替代说法包括：second-order（第二阶的/二阶的）、two-level ordering（两层排序）、dual ranking（双重排名）、two-dimensional order（二维排序）。","也有人把它误看成“diurnal（日常的/昼行性的）”或“ordinal（序数的）”。如果你能提供出现该词的句子或领域（数学、逻辑、统计、计算机等），我可以帮你更精确地确定含义。"]}
{"word":"Diores","summary":{"en":"“Diores” isn’t a standard English word; it’s most likely meant to be “Dior’s,” meaning “belonging to Dior.”","zh":"“Diores”不是标准英语词；更可能是想写“Dior’s”，表示“迪奥的/属于Dior的”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Likely a misspelling of “Dior’s” (the possessive form of “Dior”), referring to something belonging to the fashion brand Dior or to a person named Dior.","zh":"很可能是 “Dior’s”（“Dior”的所有格）的拼写误写，指“属于迪奥（Dior）品牌的某物”或“属于名叫Dior的人/物的某物”。"},"examples":[{"en":"I love Dior’s perfumes, especially the floral ones.","zh":"我很喜欢迪奥的香水，尤其是花香调的。"},{"en":"Dior’s new collection was shown in Paris.","zh":"迪奥的新系列在巴黎发布了。"}]}],"phonetic":"/diˈɔɹz/","extraExplanation":["“Dior”通常指法国奢侈品牌“Christian Dior（克里斯汀·迪奥）”。英语里在名词后加 ’s 表示“……的”，所以 “Dior’s”=“迪奥的”。","如果你想表达“多个Dior（比如多个名叫Dior的人）”，正确复数一般是 “Diors”。如果你是要查别的词（例如 diuresis/diuretic 等医学相关词），告诉我上下文我可以帮你准确判断。"]}
{"word":"diorism","summary":{"en":"Diorism means making a precise definition or clear distinction by setting boundaries between similar ideas (rare/academic).","zh":"diorism 指对概念作出精确界定或通过划清界限来做清晰区分（较少见、偏学术）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a careful definition or clear limiting of what a word, idea, or category means; the act of drawing a boundary between similar things (a rare term in modern English, used mostly in rhetoric and older writing).","zh":"对词语、概念或类别作出清晰而谨慎的界定；通过“划清界限”来区分相近事物（现代英语中较少见，多用于修辞学或较旧的文体）。"},"examples":[{"en":"Before we debate the topic, we need a diorism of what “freedom” means in this context.","zh":"在讨论这个话题之前，我们需要先界定这里“自由”到底指什么。"},{"en":"The author uses diorism to separate ‘hope’ from ‘wishful thinking.’","zh":"作者通过清晰界定，把“希望”和“痴心妄想”区分开来。"}]}],"synonyms":["definition","clarification","distinction","delimitation"],"phonetic":"/daɪˈɔrɪzəm/","extraExplanation":["该词源自希腊语（与“划分、区分、界定”有关），在英语里属于非常少用的学术/修辞术语。日常写作中更常用 define / definition、distinction、clarification、draw the line 等表达。","在修辞或论证写作中，它强调的是：先把概念的“边界”讲清楚（什么算、什么不算），以免后续讨论各说各话。"]}
{"word":"diorite","summary":{"en":"Diorite is a hard, speckled dark igneous rock often used for building or carving.","zh":"闪长岩是一种坚硬、带斑点的深色火成岩，常用于建筑或雕刻。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A hard, coarse-grained igneous rock (formed from cooled magma) that is usually dark gray to black with lighter specks; often used as a building or decorative stone.","zh":"闪长岩：一种坚硬的粗粒火成岩（由岩浆冷却形成），通常呈深灰到黑色并带有浅色斑点；常用于建筑或装饰石材。"},"examples":[{"en":"The monument was carved from diorite because it is very durable.","zh":"这座纪念碑用闪长岩雕刻，因为它非常耐久。"},{"en":"In the museum, we saw a polished slab of diorite with black-and-white grains.","zh":"在博物馆里，我们看到一块抛光的闪长岩板，带有黑白相间的颗粒。"}]}],"synonyms":["igneous rock"],"phonetic":"/ˈdaɪəˌraɪt/","extraExplanation":["“diorite”常出现在地质学与考古学语境中：它比花岗岩颜色更深，常与“gabbro（辉长岩）”“granite（花岗岩）”一起被比较。","在古代近东地区（如美索不达米亚），闪长岩因坚硬致密而被用于雕刻重要碑刻或雕像；学习材料里有时会提到用闪长岩制作的法典碑（如《汉谟拉比法典》碑常被描述为玄武岩/闪长岩一类的深色火成岩）。"]}
{"word":"diorite-bearing","summary":{"en":"An adjective meaning “containing diorite” (used in geology).","zh":"形容词：含有闪长岩的（地质用语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Containing diorite (a coarse-grained igneous rock), or having diorite present in the rock/area being described.","zh":"含有闪长岩（diorite，一种粗粒火成岩）的；描述岩石/地层/区域中存在闪长岩的。"},"examples":[{"en":"The survey mapped several diorite-bearing layers within the metamorphic belt.","zh":"调查在该变质带内绘制出了几层含闪长岩的地层。"},{"en":"Diorite-bearing gravel in the riverbed suggests nearby igneous outcrops.","zh":"河床中的含闪长岩砾石暗示附近有火成岩露头。"},{"en":"Engineers noted diorite-bearing rock because it can affect drilling conditions.","zh":"工程师记录了含闪长岩的岩石，因为它可能影响钻进条件。"}]}],"synonyms":["diorite-rich","dioritic (context-dependent)"],"phonetic":"/ˈdaɪəˌraɪt ˌbɛrɪŋ/","extraExplanation":["“bearing”在地质语境里常表示“含有/赋存（某种矿物或岩石）”，如：gold-bearing（含金的）、fossil-bearing（含化石的）、ore-bearing（含矿的）。因此 diorite-bearing 就是“含闪长岩的/闪长岩赋存的”。","闪长岩（diorite）通常由斜长石与角闪石等矿物组成，颜色多为“黑白相间的椒盐状”。在野外或报告中用 diorite-bearing，多是为了强调岩性组成或物源信息。"]}
{"word":"diorite-related","summary":{"en":"Diorite-related means “connected with diorite.”","zh":"diorite-related 意为“与闪长岩有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with or involving diorite (a coarse-grained igneous rock).","zh":"与闪长岩有关的；涉及闪长岩的（闪长岩是一种粗粒的火成岩）。"},"examples":[{"en":"The museum displayed diorite-related tools from ancient cultures.","zh":"博物馆展出了古代文化中与闪长岩有关的工具。"},{"en":"Scientists are studying diorite-related mineral changes caused by heat and pressure.","zh":"科学家正在研究热与压力导致的与闪长岩相关的矿物变化。"}]}],"synonyms":["related to diorite","diorite-associated","dioritic (in some contexts)"],"phonetic":"/ˈdaɪəˌraɪt rɪˈleɪtɪd/","extraExplanation":["“diorite-related”常见于地质学/考古学语境，属于“名词 + -related”构成的形容词，用来表达“与……相关”。在正式写作中也可改写为“related to diorite”或“diorite-associated”。","闪长岩（diorite）常被用来讨论火成岩成分、地壳演化、以及岩石工具材料等主题，因此你可能会在学术论文、博物馆说明或地质报告中见到这个词。"]}
{"word":"diorites","summary":{"en":"“Diorites” means more than one diorite, a gray intrusive igneous rock.","zh":"“diorites”是“闪长岩”的复数，指多块/多种闪长岩，一种常见的灰色深成火成岩。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of diorite: a coarse-grained intrusive igneous rock, usually gray to dark gray, made mainly of plagioclase feldspar with hornblende and/or biotite.","zh":"diorite（闪长岩）的复数：一种粗粒、深成（侵入性）的火成岩，常呈灰色到深灰色，主要由斜长石组成，并常含角闪石和/或黑云母。"},"examples":[{"en":"The museum display includes diorites and granites from different mountain ranges.","zh":"博物馆展柜里有来自不同山脉的闪长岩和花岗岩。"},{"en":"These diorites cooled slowly underground, which is why their crystals are easy to see.","zh":"这些闪长岩是在地下缓慢冷却形成的，所以晶体颗粒比较容易看见。"}]}],"synonyms":["intrusive igneous rocks","plutonic rocks"],"phonetic":"/ˈdaɪəˌraɪt/","extraExplanation":["“diorite（闪长岩）”在地质学里常与“granite（花岗岩）”“gabbro（辉长岩）”对比：它的成分一般介于较“浅色”的花岗岩和较“深色”的辉长岩之间，所以常被描述为“中性（intermediate）”成分的火成岩。","词源来自法语 diorite，进一步可追溯到希腊语词根，含“区分、分辨”的意思，暗示它由不同矿物颗粒混合、外观上可分辨的特点。"]}
{"word":"dioritic","summary":{"en":"“Dioritic” means related to or made of diorite, an igneous rock.","zh":"“dioritic”指与闪长岩有关或由闪长岩构成的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to or made of diorite (a coarse-grained igneous rock).","zh":"（与）闪长岩有关的；由闪长岩构成的。"},"examples":[{"en":"The outcrop is made of dioritic rock.","zh":"这处露头由闪长岩质岩石构成。"},{"en":"Dioritic textures can appear in some intrusive rocks.","zh":"一些侵入岩中可能会出现闪长岩质的结构（纹理）。"}]}],"synonyms":["diorite-bearing","diorite-related"],"phonetic":"/ˌdaɪ.əˈrɪt.ɪk/","extraExplanation":["“dioritic”是地质学/岩石学里的常用形容词，来自名词“diorite（闪长岩）”。闪长岩通常颜色偏灰黑、颗粒较粗，常见于侵入岩体中。","如果你想表达“像闪长岩一样的成分/性质”，也可见到“dioritic composition（闪长岩质成分）”“dioritic intrusion（闪长岩质侵入体）”等搭配。"]}
{"word":"diorthoses","summary":{"en":"“Diorthoses” is a rare plural noun meaning surgical/medical corrections of deformities.","zh":"“Diorthoses” 是一个罕见的复数名词，指对畸形/异常进行的外科或医学矫正。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of diorthosis: a surgical or medical correction of a deformity (an older, rare term).","zh":"diorthosis 的复数：对畸形或异常的外科/医学矫正（较旧、较少见的用语）。"},"examples":[{"en":"The article used the term diorthoses to describe several corrective procedures.","zh":"这篇文章用 diorthoses 来指代几种矫正性手术/治疗。"},{"en":"In modern writing, doctors usually say “corrective surgery” instead of diorthoses.","zh":"在现代写作中，医生通常说“corrective surgery（矫正手术）”，而不是 diorthoses。"}]}],"synonyms":["corrective surgeries","corrections","repairs"],"phonetic":"/ˌdaɪɔrˈθoʊsiz/","extraExplanation":["这是一个非常罕见的医学词，常见于旧式或学术性文本；在现代英语里，更常用的表达是 corrective surgery（矫正手术）、correction（矫正）或 repair（修复）。","词源上与希腊语中表示“矫正/纠正”的词根有关（可联想 prefix “di-”+ 与 “orth-（正、直）”相关的部分），但日常英语中几乎不会用到。"]}
{"word":"diorthosis","summary":{"en":"Diorthosis is a rhetorical self-correction used to revise a just-spoken phrase for stronger or more precise meaning.","zh":"Diorthosis 指修辞上的“自我更正/改口”，用来把刚说的话改得更有力或更准确。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rhetoric) A deliberate self-correction in speech or writing, where a speaker retracts or revises what they just said to sound more accurate, strong, or persuasive.","zh":"（修辞）一种“自我更正”的表达方式：说话者/作者先说出一个措辞，然后立刻撤回或改写，以使表达更准确、更有力或更具说服力。"},"examples":[{"en":"The senator used diorthosis: “This bill is not flawed—no, it is dangerous.”","zh":"那位参议员使用了 diorthosis：“这项法案不是有缺陷——不，是危险的。”"},{"en":"In her essay, diorthosis helped clarify the point: “It was a mistake—more precisely, a failure of planning.”","zh":"在她的文章中，diorthosis 帮助把意思说得更清楚：“那是一个错误——更准确地说，是规划上的失败。”},{"}]}],"synonyms":["self-correction","correction","epanorthosis"],"phonetic":"/ˌdaɪɔrˈθoʊsɪs/","extraExplanation":["“diorthosis”主要用于修辞学/文学评论中，日常英语里很少直接说这个词；更常见的表述是“a self-correction”或“to correct oneself”。","词源来自希腊语，核心含义是“纠正、改正”。在演讲中，这种“改口”常用来加强语气（把话说得更重）或提升精确度（把话说得更准）。"]}
{"word":"diorthotic","summary":{"en":"Diorthotic means “corrective; meant to set something right,” and it is rarely used in modern English.","zh":"diorthotic 意为“矫正性的、用于纠正的”，在现代英语中很少使用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Intended to correct something; corrective.","zh":"（罕用）用于纠正的；矫正性的。"},"examples":[{"en":"The report proposed diorthotic changes to the original translation.","zh":"报告提出对原译文进行矫正性的修改。"},{"en":"Editors made a few diorthotic notes in the margins.","zh":"编辑在页边写了几条矫正性的批注。"}]}],"synonyms":["corrective","rectifying","remedial","reparative"],"phonetic":"/ˌdaɪɔrˈθɑtɪk/","extraExplanation":["该词非常少见，多出现在学术或古典文献语境里。词根来自希腊语：di-（“通过/彻底”）+ orthos（“正确的”），整体含义偏向“把错误改正过来”。日常英语中更常用 corrective、remedial、rectifying 等词。"]}
{"word":"Dioscorea","summary":{"en":"Dioscorea is the scientific genus name for yams—climbing plants whose tubers are widely eaten.","zh":"Dioscorea 是“薯蓣属”的学名，指一类常见的薯类藤本植物，块茎常被食用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of climbing plants known as yams; many species have edible tubers (underground stems) used as food in many parts of the world","zh":"薯蓣属（即“山药/薯蓣、部分食用薯类”的一属藤本植物）；许多物种有可食用的块茎，广泛作为食物来源"},"examples":[{"en":"In many tropical regions, people cultivate Dioscorea species for their starchy tubers.","zh":"在许多热带地区，人们栽培薯蓣属植物来获取富含淀粉的块茎。"},{"en":"The researchers identified the sample as Dioscorea based on its vine habit and tuber structure.","zh":"研究人员根据它的藤本生长习性和块茎结构，将样本鉴定为薯蓣属。"}]}],"synonyms":["yam","yams","Dioscorea (yam genus)","wild yam"],"phonetic":"/ˌdaɪəˈskɔriə/","extraExplanation":["“Dioscorea”是拉丁化的学名（属名），常见于植物学、食品学与民族植物学文献中。日常英语里更常说“yam（薯类）”或具体物种名（如“greater yam”）。","词源与古典学有关：属名来自古希腊医师与药物学家 Dioscorides（迪奥斯科里德斯）的名字，用来纪念他在药用植物记录方面的贡献。","文化提醒：英语里的“yam”和“sweet potato（红薯/甘薯）”在不同地区常被混用，但在植物学上它们属于不同的科与属；“Dioscorea”指的是“真正的薯蓣/山药类（yams）”。"]}
{"word":"dioscorea","summary":{"en":"Dioscorea is the scientific genus name for yams—plants grown for starchy tubers.","zh":"Dioscorea 是“薯蓣属”的学名，指常见的山药/薯蓣类植物，以淀粉块茎为主要食用部分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of plants commonly called yams, grown for their starchy underground tubers and used as food and sometimes in traditional medicine","zh":"薯蓣属（俗称“山药/薯蓣/甘薯类中的一支”，以地下块茎富含淀粉而著名，用作食物，有时也用于传统药用）"},"examples":[{"en":"Many Dioscorea species are cultivated as yams in tropical regions.","zh":"许多薯蓣属（Dioscorea）的物种在热带地区作为“山药/薯蓣（yams）”被栽培。"},{"en":"Researchers study Dioscorea to understand how yam tubers store starch.","zh":"研究人员研究薯蓣属植物，以了解山药块茎如何储存淀粉。"}]}],"synonyms":["yam","yam plant","Dioscorea (genus)","wild yam"],"phonetic":"/ˌdaɪəˈskɔriə/","extraExplanation":["“Dioscorea”是植物学中的拉丁学名，来自古希腊药物学家 Dioscorides（迪奥斯科里德斯）的名字，用来纪念他。","日常英语里更常说“yam”。在不同地区，“yam”和“sweet potato（红薯/甘薯）”有时会被混用，但在植物学分类上并不相同：Dioscorea 指真正的“薯蓣类/山药类”。"]}
{"word":"Dioscoreaceae","summary":{"en":"Dioscoreaceae is the botanical family called the yam family, including yams and related vines.","zh":"Dioscoreaceae 指薯蓣科（山药科），包含山药及其近缘的藤本植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant family (the yam family) that includes yams and related climbing vines, many with edible underground tubers.","zh":"薯蓣科（山药科）：一个植物科，包含山药等相关的攀援藤本植物，许多种具有可食用的地下块茎。"},"examples":[{"en":"The cultivated yam belongs to the family Dioscoreaceae.","zh":"栽培的山药属于薯蓣科（Dioscoreaceae）。"},{"en":"In tropical regions, many Dioscoreaceae species are grown for their starchy tubers.","zh":"在热带地区，许多薯蓣科植物因其富含淀粉的块茎而被种植。"}]}],"synonyms":["yam family"],"phonetic":"/ˌdaɪəˌskɔːriˈeɪsiˌiː/","extraExplanation":["“Dioscoreaceae”是拉丁化的植物分类学名称，常见英文俗称是“yam family”。","词源上与古希腊医师与植物学著作作者 Dioscorides（迪奥斯科里德斯）有关；许多植物学名称会用这种方式纪念历史人物。","在日常英语里，人们通常更常说“yams / yams (plants)”或“the yam family”，而不是直接使用学名“Dioscoreaceae”。"]}
{"word":"dioscoreaceae","summary":{"en":"Dioscoreaceae = the yam plant family (a botanical family that includes Dioscorea/true yams).","zh":"Dioscoreaceae＝薯蓣科（山药/多种“yams”所属的植物科，包含薯蓣属等）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of flowering plants commonly called the yam family, including true yams (Dioscorea) and related climbing or twining plants with underground tubers.","zh":"薯蓣科（又称“山药/木薯蓣”类植物的科），一种被子植物科，包含真正的薯蓣属（Dioscorea，常见为山药/薯蓣和多种“yams”）及其近缘的攀援或缠绕植物，常具有地下块茎。"},"examples":[{"en":"Dioscoreaceae includes many species whose tubers are eaten as yams in different parts of the world.","zh":"薯蓣科包含许多物种，它们的块茎在世界不同地区被当作“yams/薯类”食用。"},{"en":"In botany class, we learned that Dioscorea belongs to the family Dioscoreaceae.","zh":"在植物学课上，我们学到薯蓣属（Dioscorea）属于薯蓣科（Dioscoreaceae）。"}]}],"synonyms":["yam family"],"phonetic":"/ˌdaɪəˌskɔriˈeɪsiˌi/","extraExplanation":["词源提示：Dioscoreaceae 来自属名 Dioscorea（薯蓣属）＋植物分类常见的科名后缀 -aceae；Dioscorea 又源自古希腊医生与药学家 Dioscorides（迪奥斯科里德斯）的名字。","用法提示：这是学术/科普语境中的分类学名，日常交流更常说 “yam family（薯蓣科/山药科）” 或直接说 “yams / Dioscorea（薯蓣/山药/某些称为yam的薯类）”。"]}
{"word":"Dioscoreaceae-related","summary":{"en":"Dioscoreaceae-related means connected with the yam plant family Dioscoreaceae.","zh":"Dioscoreaceae-related 指“与薯蓣科（山药科）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected with or characteristic of the plant family Dioscoreaceae (the yam family).","zh":"与薯蓣科（山药科）植物家族有关的；具有薯蓣科特征的。"},"examples":[{"en":"Researchers analyzed Dioscoreaceae-related starch traits in several yam species.","zh":"研究人员分析了多个薯蓣物种中与薯蓣科相关的淀粉特征。"},{"en":"The paper discusses Dioscoreaceae-related compounds used in traditional diets.","zh":"这篇论文讨论了传统饮食中使用的薯蓣科相关化合物。"}]}],"synonyms":["yam-family-related","Dioscoreaceae-associated","Dioscoreaceae-linked"],"phonetic":"/daɪˌɑːskəˈreɪsi.i-rɪˌleɪtɪd/","extraExplanation":["“Dioscoreaceae”是植物分类学中的“科”名（family），常见成员包括食用的yam（薯蓣/山药类）及一些野生攀援植物。学术写作里常用“X-related”把研究对象限定为“与X有关的（基因/性状/化合物/物种等）”。","拼写提示：英文学名通常首字母大写（Dioscoreaceae）。加连字符的“Dioscoreaceae-related”多用于定语位置（如Dioscoreaceae-related genes）。"]}
{"word":"dioscoreaceous","summary":{"en":"An adjective meaning “related to the yam family (Dioscoreaceae).”","zh":"形容词：表示“与薯蓣科（山药科，Dioscoreaceae）有关的/属于薯蓣科的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the botanical family Dioscoreaceae (the yam family), which includes many yam species (genus *Dioscorea*).","zh":"与薯蓣科（山药科，Dioscoreaceae）有关的；属于薯蓣科的（包括许多薯蓣属 *Dioscorea* 的山药类植物）。"},"examples":[{"en":"Researchers studied dioscoreaceous plants to compare their tuber starches.","zh":"研究人员研究薯蓣科植物，以比较它们块茎中的淀粉。"},{"en":"Wild yams are dioscoreaceous species found in tropical and subtropical regions.","zh":"野生山药属于薯蓣科物种，常见于热带与亚热带地区。"}]}],"synonyms":["of the yam family","Dioscoreaceae-related","dioscorean"],"phonetic":"/ˌdaɪ.əˌskɔːr.iˈeɪ.ʃəs/","extraExplanation":["“dioscoreaceous”是一个植物学形容词，来自属名 *Dioscorea*（薯蓣属）与形容词后缀 “-aceous”（表示“……类的/……科的”）。在日常英语中较少出现，多见于植物分类、农学与药用植物研究等语境。"]}
{"word":"dioscorean","summary":{"en":"Dioscorean means “related to Dioscorides” (ancient herbal medicine) or “related to Dioscorea” (yams).","zh":"dioscorean 指“与迪奥斯科里德斯及其草药学传统有关”，或“与薯蓣属（山药/薯蓣）有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the ancient Greek physician and botanist Dioscorides, especially his writings on medicinal plants.","zh":"与古希腊医师、植物学家迪奥斯科里德斯（Dioscorides）有关的；尤指他关于药用植物的著作。"},"examples":[{"en":"The museum displayed a Dioscorean manuscript on herbal medicine.","zh":"博物馆展出了一份与迪奥斯科里德斯相关的草药学手稿。"},{"en":"Some modern herbal terms trace back to Dioscorean descriptions of plants.","zh":"一些现代草药学术语可追溯到迪奥斯科里德斯对植物的描述。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the plant genus Dioscorea (yams) or the yam family (Dioscoreaceae).","zh":"与薯蓣属（Dioscorea，山药/薯蓣）或薯蓣科（Dioscoreaceae）有关的。"},"examples":[{"en":"Yams are Dioscorean plants cultivated in many tropical regions.","zh":"山药/薯蓣属于薯蓣类植物，在许多热带地区种植。"},{"en":"The study compared Dioscorean starches used in traditional cooking.","zh":"这项研究比较了传统烹饪中使用的薯蓣类淀粉。"}]}],"synonyms":["Dioscoridean","Dioscorea-related","yam-related"],"phonetic":"/ˌdaɪəˈskɔriən/","extraExplanation":["“Dioscorean”较少见，常见于学术语境。它既可能指向人物（Dioscorides，1世纪的药物学权威，著有《De Materia Medica》），也可能指向植物分类名称（Dioscorea 薯蓣属）。阅读时可看上下文：谈“手稿/药典/草药记载”多半是前者；谈“山药/薯蓣/淀粉/作物”多半是后者。"]}
{"word":"dioscorein","summary":{"en":"Dioscorein is a scientific term for a yam-tuber protein, commonly written as “dioscorin.”","zh":"Dioscorein 是一个科学术语，指山药块茎中的一种蛋白质，更常见写法为 “dioscorin”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a protein found in yam (Dioscorea) tubers; often spelled “dioscorin” in scientific writing.","zh":"一种存在于山药（薯蓣属 Dioscorea）块茎中的蛋白质；在科学文献中更常见的拼写是 “dioscorin”。"},"examples":[{"en":"Researchers extracted dioscorein (dioscorin) from yam tubers to study its biological activity.","zh":"研究人员从山药块茎中提取 dioscorein（dioscorin），以研究其生物活性。"},{"en":"Dioscorein is sometimes discussed in food science because yams are widely eaten.","zh":"由于山药被广泛食用，食品科学中有时会讨论 dioscorein。"}]}],"synonyms":["dioscorin"],"phonetic":"/daɪˈɑːskəˌrɪn/","extraExplanation":["“Dioscorein” 这个拼写在常用词典里不多见，很多情况下是把更常见的术语 “dioscorin” 拼写成了 -ein 结尾。阅读论文或检索资料时，建议同时用两种拼写搜索，以免漏掉信息。","词源上与 “Dioscorea（薯蓣属）”有关，该属以古希腊医师 Dioscorides 的名字命名；因此相关化合物/蛋白的命名也常从属名派生。"]}
{"word":"dioscorin","summary":{"en":"Dioscorin is a main storage protein in yam (Dioscorea) tubers, often discussed in nutrition and food-science research.","zh":"dioscorin 指山药/薯蓣（Dioscorea 属）块茎中的主要贮藏蛋白，常见于营养与食品科学研究语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a major storage protein found in yam tubers (plants in the genus Dioscorea), studied for its nutritional and possible biological (e.g., antioxidant) properties.","zh":"薯蓣蛋白：存在于山药/薯蓣（Dioscorea 属）块茎中的一种主要贮藏蛋白，常用于营养与潜在生物活性（如抗氧化）研究。"},"examples":[{"en":"Researchers extracted dioscorin from yam to test its antioxidant activity.","zh":"研究人员从山药中提取薯蓣蛋白，以检测其抗氧化活性。"},{"en":"Dioscorin is one reason yams contain a meaningful amount of protein compared with many other tubers.","zh":"与许多其他块茎相比，山药含有一定蛋白质，其中一个原因就是含有薯蓣蛋白。"}]}],"synonyms":["yam storage protein","Dioscorea storage protein"],"phonetic":"/daɪˈɑskɔrɪn/","extraExplanation":["“dioscorin”这个词来自植物属名“Dioscorea（薯蓣属）”。它属于植物的“贮藏蛋白”，类似于豆类里的贮藏蛋白，主要用于为植物生长提供氮源和营养。","在科研语境中，它常出现在食品科学、营养学与天然产物研究里；日常英语里不常用，更多见于论文、科普或产品成分介绍。"]}
{"word":"dioscorine","summary":{"en":"Dioscorine is a toxic alkaloid found in some yam plants (*Dioscorea*).","zh":"Dioscorine（薯蓣碱）是存在于部分薯蓣属植物中的有毒生物碱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a toxic alkaloid found in some yam plants (genus *Dioscorea*), known for affecting the nervous system and potentially causing poisoning if eaten without proper processing","zh":"一种存在于部分薯蓣属（*Dioscorea*，山药/薯蓣类）植物中的有毒生物碱，可影响神经系统；若未正确处理就食用，可能导致中毒"},"examples":[{"en":"Dioscorine is one reason certain wild yams must be processed carefully before they are safe to eat.","zh":"薯蓣碱（dioscorine）是某些野生薯蓣必须经过仔细处理才能安全食用的原因之一。"},{"en":"Researchers study dioscorine to understand how plant toxins affect the nervous system.","zh":"研究人员研究薯蓣碱，以了解植物毒素如何影响神经系统。"}]}],"synonyms":["alkaloid","plant toxin"],"phonetic":"/daɪˈɑskəˌrin/","extraExplanation":["“dioscorine”来自植物学属名 *Dioscorea*（薯蓣属）加上化学命名常见后缀 “-ine”（常用于生物碱等化合物名）。","它更多出现在植物化学、毒理学或食品安全相关语境中；日常英语里并不常见。"]}
{"word":"Dioscuri","summary":{"en":"The Dioscuri are the mythological twin brothers Castor and Pollux, linked with sailors’ protection and the constellation Gemini.","zh":"Dioscuri 指神话中的孪生兄弟卡斯托耳与波吕丢刻斯（波鲁克斯），与航海守护与双子座相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In Greek and Roman mythology, the twin brothers Castor and Pollux (Polydeuces), honored as protectors of sailors and associated with the constellation Gemini.","zh":"（希腊与罗马神话）“狄俄斯库里”，指孪生兄弟卡斯托耳与波吕丢刻斯（波鲁克斯），常被视为航海者的守护神，并与双子座（Gemini）相关。"},"examples":[{"en":"In Greek myth, the Dioscuri—Castor and Pollux—are famous for their loyalty to each other.","zh":"在希腊神话中，狄俄斯库里（卡斯托耳与波吕丢刻斯）以彼此忠诚而闻名。"},{"en":"Ancient sailors prayed to the Dioscuri for protection during storms at sea.","zh":"古代水手常向狄俄斯库里祈求在海上风暴中得到庇护。"}]}],"synonyms":["Castor and Pollux","the Gemini Twins","the Heavenly Twins"],"phonetic":"/daɪˈɑskjəraɪ/","extraExplanation":["“Dioscuri”源自希腊语，意为“宙斯之子”（Dios=宙斯的/属于宙斯；kouroi=少年/儿子）。在英文中常当作复数名词使用（the Dioscuri）。","他们也常以“Gemini（双子座）”的形象出现；在文学与艺术中，常象征“兄弟情谊、同生共死、守护与航行安全”。"]}
{"word":"dioscuri","summary":{"en":"Dioscuri means Castor and Pollux, the mythological twin brothers (linked to Gemini); more broadly, it can refer to any inseparable pair of “twins.”","zh":"Dioscuri 指神话中的双胞胎兄弟卡斯托尔与波吕丢刻斯（波鲁克斯，常与双子座相关）；引申也可指一对形影不离的“孪生”搭档。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Greek/Roman mythology) Castor and Pollux—the divine twin brothers, also linked with the constellation Gemini.","zh":"（希腊/罗马神话）狄奥斯库里：卡斯托尔与波吕丢刻斯（波鲁克斯）这对神性双胞胎兄弟，也常与双子座（Gemini）相关联。"},"examples":[{"en":"In Greek myth, the Dioscuri are Castor and Pollux, famous as the twin brothers of Helen of Troy.","zh":"在希腊神话中，狄奥斯库里指卡斯托尔与波吕丢刻斯（波鲁克斯），他们因与特洛伊的海伦同一家族而闻名。"},{"en":"The constellation Gemini is traditionally associated with the Dioscuri.","zh":"传统上，双子座（Gemini）与狄奥斯库里有关。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) A pair of closely linked “twin” figures or things, used as a learned reference to Castor and Pollux.","zh":"（较少见）借用“狄奥斯库里”来指一对紧密相连、如双胞胎般的两个人或事物（带有文雅/典故色彩）。"},"examples":[{"en":"Some writers call the two inseparable heroes a modern-day Dioscuri.","zh":"有些作家把那两位形影不离的英雄称作“现代的狄奥斯库里”。"}]}],"synonyms":["Castor and Pollux","the Twins","Gemini (association)"],"phonetic":"/daɪˈɑːskjʊraɪ/","extraExplanation":["“Dioscuri”来自希腊语，字面意思与“宙斯之子”相关（Castor 与 Pollux 常被视为宙斯的儿子之一/或与宙斯有关的神性双生）。因此在英文里它常带有古典神话、文学典故的语感。","在古典文学中（如荷马史诗相关传统）这对双子常被描写为航海者的守护者；英语里谈到航海传说、星座象征时更容易见到这个词。"]}
{"word":"Dioscurian","summary":{"en":"Dioscurian means “connected with Castor and Pollux (the Dioscuri),” and can describe twin-related or Gemini-related imagery.","zh":"Dioscurian 指“与卡斯托尔与波吕克斯（狄奥斯库里）相关”，也可形容与双子意象或双子座相关的表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Dioscuri (Castor and Pollux), the twin brothers in Greek and Roman mythology; by extension, relating to twins or the constellation Gemini.","zh":"与“狄奥斯库里”（卡斯托尔与波吕克斯，希腊—罗马神话中的双子兄弟）有关的；引申指“双胞胎”意象或与双子座（Gemini）有关的。"},"examples":[{"en":"The poem uses Dioscurian imagery to emphasize brotherhood and loyalty.","zh":"这首诗使用“狄奥斯库里”的意象来强调兄弟情与忠诚。"},{"en":"A Dioscurian pair of stars is sometimes mentioned in older writing about Gemini.","zh":"在较早的双子座相关写作里，有时会提到一对“狄奥斯库里式”的星辰。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a person connected with or resembling one of the Dioscuri; one of a twin pair.","zh":"（罕见）与狄奥斯库里相关的人；像“双子兄弟”之一的人；一对双生中的一个。"},"examples":[{"en":"In the novel, the two brothers are treated as Dioscurians by the townspeople.","zh":"在小说里，镇民把这对兄弟当作“狄奥斯库里式”的双子来对待。"}]}],"synonyms":["Gemini-related","twin","Castor-and-Pollux (related)"],"phonetic":"ˌdaɪəˈskjʊriən","extraExplanation":["“Dioscurian”来自“Dioscuri”（拉丁语/希腊语形式），指卡斯托尔（Castor）与波吕克斯（Pollux）。他们常象征兄弟情、互助与守护者形象（如水手的守护）。","在英语里它属于较少见、偏文学或学术的词，常出现在古典神话研究、文学评论、或提到双子座与双子意象的语境中。"]}
{"word":"dioscurian","summary":{"en":"Dioscurian means “connected with Castor and Pollux (the Dioscuri),” often used in classical, mythological, or literary contexts about twins, brotherhood, and protection.","zh":"dioscurian 指“与狄奥斯库里（卡斯托尔与波吕丢刻斯）有关的”，多用于古典/神话/文学语境，常联想到双子、兄弟情谊与守护。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Dioscuri (Castor and Pollux), the twin brothers in Greek and Roman mythology.","zh":"与“狄奥斯库里”（Dioscuri，即希腊/罗马神话中的双子兄弟卡斯托尔与波吕丢刻斯）有关的；狄奥斯库里的。"},"examples":[{"en":"The poem uses a Dioscurian image of twin brothers to suggest loyalty and protection.","zh":"这首诗用“狄奥斯库里式”的双子兄弟意象来暗示忠诚与守护。"},{"en":"In classical art, a Dioscurian motif often shows two riders side by side.","zh":"在古典艺术中，“狄奥斯库里式”母题常表现为两位并骑的骑士。"}]}],"synonyms":["Dioscuric","Castor-and-Pollux (related)"],"phonetic":"/ˌdaɪəˈskjʊriən/","extraExplanation":["“Dioscuri”是卡斯托尔（Castor）与波吕丢刻斯（Pollux）的合称；在航海文化中，他们常被视为水手的守护者，有时也与“圣艾尔摩之火”（St. Elmo’s fire）等海上发光现象的民间解释联系在一起。","这个词比较少见，多出现在古典文学、艺术史、神话学或象征/意象分析的语境里。"]}
{"word":"Dioscuric","summary":{"en":"Dioscuric means “connected with the Dioscuri (Castor and Pollux)” and, more rarely, “twin-like or paired” in a literary or scholarly sense.","zh":"Dioscuric 指“与狄俄斯库里（卡斯托尔与波吕丢刻斯/波洛克斯这对双子神）有关的”，也可（较少见、偏学术）引申为“双子式、成对的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Dioscuri (Castor and Pollux), the twin brothers in Greek and Roman mythology.","zh":"与“狄俄斯库里”（Dioscuri，即卡斯托尔与波吕丢刻斯/波洛克斯这对孪生兄弟）有关的；指希腊—罗马神话中的这对双子神。"},"examples":[{"en":"The temple’s Dioscuric imagery emphasizes themes of brotherhood and protection.","zh":"这座神庙中与狄俄斯库里相关的图像，强调了兄弟情谊与守护的主题。"},{"en":"In some texts, sailors prayed for Dioscuric aid during storms.","zh":"在一些文本里，水手会在风暴中祈求狄俄斯库里的庇佑。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare, scholarly) Suggesting a “twin” or paired nature by reference to Castor and Pollux.","zh":"（罕见，学术用）借卡斯托尔与波吕丢刻斯之名，引申为“成对的、双生的（双子式的）”。"},"examples":[{"en":"The critic described the novel’s two narrators as a Dioscuric pair.","zh":"评论家把小说中的两位叙述者形容为一对“狄俄斯库里式”的双子搭档。"}]}],"synonyms":["Castorian (context-dependent)","twin-like (in the extended sense)","paired (in the extended sense)"],"phonetic":"/ˌdaɪ.əˈskjʊr.ɪk/","extraExplanation":["“Dioscuric”来源于拉丁语/希腊语中对“狄俄斯库里（Dioscuri）”的称呼，意为“宙斯之子们”。这对双子在神话中常被视为航海者的守护神，因此在文学、艺术史、古典学语境里更常见。","在现代英语里这个词很少用于日常对话，多出现在讨论古希腊罗马宗教、古典艺术符号（如双子、两位骑士形象）或文学批评中。"]}
{"word":"Diosdado","summary":{"en":"Diosdado is a Spanish male given name meaning “God-given.”","zh":"Diosdado 是西班牙语男性名字，意为“天赐的 / 上帝所赐的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Spanish given name (male), meaning “given by God” or “God-given.”","zh":"西班牙语男性名字，意思是“上帝所赐的 / 天赐的”。"},"examples":[{"en":"His first name is Diosdado, and his family calls him Dio for short.","zh":"他叫 Diosdado，家里人简称他 Dio。"},{"en":"Diosdado is a traditional name in some Spanish-speaking families.","zh":"Diosdado 在一些西语家庭里是比较传统的名字。"}]}],"synonyms":["(similar meaning) Theodore","(similar meaning) Jonathan","(similar meaning) Matthew"],"phonetic":"ˌdi.oʊsˈdɑː.doʊ","extraExplanation":["“Diosdado”来自西班牙语：Dios（上帝）+ dado（给予的），整体含义接近英文名字/表达“God-given（天赐的）”。","在英语语境中它通常被当作外来专有名词使用；常见的亲昵称呼可能是“Dio”等，但具体取决于个人偏好。","它也可能作为姓氏出现，但更常见的是名字。若你是在读新闻或历史文本，可能会遇到名为 Diosdado 的公众人物（不同国家都有）。"]}
{"word":"diose","summary":{"en":"Diocese = the area a bishop is responsible for in a Christian church.","zh":"Diocese（教区）= 基督教会中由主教负责管辖的地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a district or area controlled by a bishop in a Christian church (especially the Roman Catholic, Anglican, and Orthodox traditions)","zh":"（基督教会中）由主教管辖的教区（尤指天主教、圣公会、东正教等）"},"examples":[{"en":"She works for the Catholic diocese in Los Angeles.","zh":"她在洛杉矶的天主教教区工作。"},{"en":"The bishop visited several parishes across the diocese.","zh":"主教走访了教区内的几个堂区。"}]}],"synonyms":["bishopric","see"],"phonetic":"/ˈdaɪəsɪs/","extraExplanation":["你输入的“diose”在英语里通常不是标准拼写；最常见的情况是想写 **diocese**（教区）。","**diocese** 里的 “-cese” 发音不按拼写直读，所以容易拼错。可以把它记成：**die + uh + sis**（大致音感：DAI-uh-sis）。","教会组织里常见层级：**diocese（教区）** 通常由 **bishop（主教）** 负责；教区下面常见单位是 **parish（堂区）**。"]}
{"word":"diosgenin","summary":{"en":"Diosgenin is a natural plant steroid from yams, used as a starting material for making steroid medicines.","zh":"Diosgenin 是一种来自山药等植物的天然甾体化合物，可作为合成甾体药物的起始原料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a natural plant steroid (a sapogenin) found especially in wild yams, used as a starting material in making steroid medicines in the lab","zh":"一种天然植物甾体（皂苷元），常见于野生山药等植物，可作为实验室合成甾体药物的原料"},"examples":[{"en":"Diosgenin is extracted from certain yams and then purified for research.","zh":"Diosgenin 可从某些山药中提取，并进一步纯化用于研究。"},{"en":"In industry, diosgenin has been used as a raw material to synthesize steroid hormones.","zh":"在工业上，diosgenin 曾被用作合成甾体激素的原料。"}]}],"synonyms":["steroidal sapogenin","plant steroid"],"phonetic":"/daɪˈɑːsdʒənɪn/","extraExplanation":["词源提示：diosgenin 来自植物学属名 *Dioscorea*（薯蓣属/山药属）+ 化学后缀 -genin（常用于表示“皂苷元/苷元”，即糖被去掉后的非糖部分）。","学习提醒：diosgenin 本身不是“激素”，而是可用于化学合成某些甾体药物的“前体/原料”。日常保健语境里常把它和“山药补充剂、激素平衡”等概念混在一起，阅读英文资料时要区分“成分/前体（precursor, raw material）”与“药物/激素（hormone, steroid medication）”。"]}
{"word":"Diosma","summary":{"en":"Diosma is a South African evergreen shrub (a plant name), sometimes also referring to aromatic leaves/oil used in herbal products.","zh":"Diosma 是一种南非常绿灌木的名称；有时也指其芳香叶子/叶油在草本产品中的用法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a South African evergreen shrub (genus *Diosma*, citrus family) grown as an ornamental plant, often valued for its small fragrant leaves and flowers.","zh":"一种南非的常绿灌木（*Diosma* 属，芸香科/柑橘科近缘），常作观赏植物，以小而有香味的叶子和花朵受人喜爱。"},"examples":[{"en":"She planted diosma near the walkway because its leaves smell pleasant when brushed.","zh":"她把 diosma 种在小路旁，因为叶子被擦过时会散发好闻的香味。"},{"en":"In some gardens, diosma is grown alongside other drought-tolerant shrubs.","zh":"在一些花园里，diosma 会和其他耐旱灌木一起栽种。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) the leaves or leaf oil of related South African shrubs used in traditional herbal products (often connected with “buchu”).","zh":"（较少见）与南非一些近缘灌木有关的叶子或叶油，用于传统草本制品（常与“buchu/布库”相关）。"},"examples":[{"en":"Some herbal blends list diosma among their aromatic ingredients.","zh":"有些草本混合产品会把 diosma 列为芳香成分之一。"}]}],"synonyms":["(genus name) Diosma","buchu (related term)","South African shrub"],"phonetic":"/daɪˈɑzmə/","extraExplanation":["“Diosma”来自植物学的拉丁化命名，用在园艺或植物学语境更常见。日常英语里并不常用。","园艺店里有时会把某些相似的南非芳香灌木统称或混称为 diosma / buchu，因此购买或查资料时最好核对学名（拉丁名）。"]}
{"word":"diosma","summary":{"en":"Diosma is a fragrant evergreen shrub (often called “breath of heaven”), mainly grown as an ornamental plant.","zh":"Diosma 指一种带芳香的常绿灌木（常称“breath of heaven/天堂气息”），主要作为观赏植物栽培。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, fragrant evergreen shrub originally from South Africa, grown as an ornamental plant; often called “breath of heaven” (some plants once placed in the genus *Diosma* are now classified as *Coleonema*).","zh":"一种原产南非、带芳香的常绿小灌木，常作观赏植物栽培；常见俗名为“breath of heaven（天堂气息）”（部分过去归入 *Diosma* 属的植物如今多归为 *Coleonema* 属）。"},"examples":[{"en":"She planted diosma near the walkway because its leaves smell fresh when brushed.","zh":"她把 diosma 种在小路旁，因为叶子轻轻一碰就会散发清新的香味。"},{"en":"In mild climates, diosma is often used as a low hedge in gardens.","zh":"在气候温和的地区，diosma 常被用作花园里的低矮绿篱。"}]}],"synonyms":["breath of heaven","coleanema","buchu (related)"],"phonetic":"/daɪˈɑzmə/","extraExplanation":["“Diosma”一词来自希腊语 *diosmē*，大意是“神圣的香气/好闻的气味”，因此常与“芳香、香叶”相关。","园艺语境里人们有时仍说 diosma，但在植物分类学上，你可能更常在标签或资料中看到 *Coleonema*（如 *Coleonema pulchellum*）这一属名；不同地区与苗圃的用名习惯可能不一致。"]}
{"word":"diosmetin","summary":{"en":"Diosmetin is a plant flavonoid used mainly as a scientific/ingredient name.","zh":"Diosmetin是一种植物黄酮类化合物名称，多用于科研或成分标注。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a natural plant compound (a flavonoid) found in some herbs and citrus peels, studied for possible anti-inflammatory and antioxidant effects; used mainly in scientific and health-product contexts","zh":"一种天然植物化合物（黄酮类），存在于某些草本植物和柑橘类果皮中；常在科研与保健品语境中出现，研究方向包括可能的抗炎、抗氧化作用"},"examples":[{"en":"Researchers tested diosmetin for its antioxidant activity in the lab.","zh":"研究人员在实验室中测试了diosmetin（地奥司明素/二奥甲基黄酮） 的抗氧化活性。"},{"en":"Some supplements list diosmetin as a citrus-derived flavonoid.","zh":"一些补充剂会把diosmetin标为“来自柑橘的黄酮类成分”。"},{"en":"The paper compared diosmetin with other flavonoids found in plants.","zh":"论文将diosmetin与植物中其他黄酮类化合物进行了比较。"}]}],"synonyms":["5,7,3′-trihydroxy-4′-methoxyflavone","diosmin aglycone"],"phonetic":"/daɪˈɑs.mə.tɪn/","extraExplanation":["“Diosmetin”常见于药学、天然产物化学与营养学文献，不是日常口语词。阅读时可把它理解为“某一种具体的黄酮分子名称”。","它与“diosmin”关系密切：diosmin通常被描述为diosmetin的糖苷形式（带糖基的衍生物），在成分表或论文里两者可能一起出现。","中文译名在不同资料中可能不完全一致；若你在论文/产品标签中看到不同译法，建议以其化学英文名或结构式核对。"]}
{"word":"diosmin","summary":{"en":"Diosmin is a plant flavonoid used in medicine/supplements, mainly for vein-related circulation problems.","zh":"Diosmin（地奥司明）是一种植物黄酮类成分，常用于药物/补充剂，主要与静脉循环问题相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant-based flavonoid (often used as a medicine or supplement) that may help improve blood vessel tone and reduce symptoms of venous problems such as varicose veins and hemorrhoids","zh":"一种植物来源的黄酮类化合物（常作为药物或膳食补充剂使用），可能有助于改善血管张力，减轻静脉相关问题（如静脉曲张、痔疮）症状"},"examples":[{"en":"My doctor suggested diosmin for my varicose veins.","zh":"医生建议我用地奥司明来改善静脉曲张。"},{"en":"Some people take diosmin to reduce swelling in the legs.","zh":"有些人服用地奥司明来减轻腿部肿胀。"},{"en":"Always check the label and ask a pharmacist before combining diosmin with other medicines.","zh":"将地奥司明与其他药物同用前，务必查看标签并咨询药师。"}]}],"synonyms":["flavonoid (general term)","MPFF (related product term)","diosmetin (related compound)"],"phonetic":"/ˈdaɪ.ɑz.mɪn/","extraExplanation":["“diosmin”常见于处方药或保健品语境，尤其与“慢性静脉功能不全（CVI）/静脉曲张/痔疮”相关；不同国家对其作为药品或补充剂的监管分类可能不同。","它常与“hesperidin（橙皮苷/橙皮素相关成分）”一起出现（如“micronized purified flavonoid fraction, MPFF”微粉化纯化黄酮类分画），因为配方上常搭配以增强临床使用便利性。","学习用法上，它多作不可数名词用（take/use diosmin），也常见在成分表或说明书里。医学文本中注意剂量、疗程与禁忌应以专业建议为准。"]}
{"word":"diosmose","summary":{"en":"“diosmose” isn’t standard English; you probably mean “osmosis,” which means membrane-based water movement, or figuratively learning by exposure.","zh":"“diosmose”不是标准英语；你多半想写“osmosis（渗透作用）”，也可比喻“耳濡目染地学到/吸收”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “osmosis.”","zh":"不是标准英语单词；很可能是“osmosis（渗透/渗透作用）”的拼写错误。"},"examples":[{"en":"I couldn’t find “diosmose” in English dictionaries—did you mean “osmosis”?","zh":"我在英语词典里找不到“diosmose”——你是不是想写“osmosis”？"}]},{"partOfSpeech":"n.","definition":{"en":"(Biology/Chemistry) The movement of water (or another solvent) through a semipermeable membrane from a weaker solution to a stronger one.","zh":"（生物/化学）渗透作用：水（或其他溶剂）通过半透膜从低浓度溶液流向高浓度溶液的过程。"},"examples":[{"en":"Plants absorb water from the soil by osmosis.","zh":"植物通过渗透作用从土壤中吸收水分。"},{"en":"Salted cucumbers lose water because of osmosis.","zh":"腌黄瓜会失水，这是渗透作用造成的。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) A gradual, often unconscious learning or absorbing of ideas through everyday exposure.","zh":"（比喻）耳濡目染：在日常接触中逐渐（常常是不自觉地）吸收知识或观念。"},"examples":[{"en":"He picked up English by osmosis after living in the U.S. for a year.","zh":"他在美国住了一年后，耳濡目染地学会了英语。"},{"en":"Some workplace culture is learned by osmosis, not training.","zh":"有些职场文化不是培训教出来的，而是耳濡目染学到的。"}]}],"synonyms":["diffusion","absorption","permeation"],"phonetic":"/ɑzˈmoʊsɪs/","extraExplanation":["“osmosis”常出现在科学课本里；在日常英语中也很常用作比喻，表示“在环境中自然吸收/学到”。","如果你想表达“反渗透净水”，常见说法是“reverse osmosis (RO)”。"]}
{"word":"diosmosed","summary":{"en":"“Diagnosed” means identified (by examination/tests) as having a disease, condition, or the cause of a problem.","zh":"“diagnosed”指通过检查/测试被诊断出患有某种疾病或状况，或确定问题原因。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “diagnose”: to identify an illness, problem, or cause after examination or tests","zh":"“diagnose”的过去式/过去分词：通过检查或测试来判断（疾病/问题）或找出原因"},"examples":[{"en":"The doctor diagnosed her with the flu.","zh":"医生诊断她得了流感。"},{"en":"The engineer diagnosed the issue as a software bug.","zh":"工程师把这个问题诊断为软件漏洞。"},{"en":"He was diagnosed with diabetes last year.","zh":"他去年被诊断出患有糖尿病。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective) having been identified as having a particular illness or condition","zh":"（形容词）被诊断患有某种疾病或状况的"},"examples":[{"en":"She is a diagnosed patient with asthma.","zh":"她是已确诊哮喘的患者。"},{"en":"After he was diagnosed, he changed his diet.","zh":"确诊后，他改变了饮食习惯。"}]}],"synonyms":["identified","determined","confirmed (diagnosis)","pinpointed (a problem)"],"phonetic":"/ˌdaɪəɡˈnoʊzd/","extraExplanation":["“diosmosed”不是常见或标准的英语单词，最可能是拼写错误。你可能想写的是 **diagnosed**（被诊断/诊断出）。","如果你想表达“渗透/渗透作用”，相关词通常是 **osmosis**（名词：渗透作用）或 **osmose**（很少用作动词）。你可以告诉我你想表达的中文意思或句子，我可以帮你确认正确拼写和用法。"]}
{"word":"diosmosing","summary":{"en":"“Diosmosing” is not a standard English word; it’s likely a misspelling (often of “diagnosing” or “osmosis/osmosing”).","zh":"“diosmosing”不是标准英语词，通常是拼写错误（常见是把“diagnosing”或“osmosis/osmosing”写错）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or typo (common intended words include “diagnosing” or “osmosis/osmosing,” depending on context).","zh":"不是标准英语单词，很可能是拼写错误或打字错误（常见想表达的可能是“diagnosing 诊断中”或“osmosis/osmosing 渗透/发生渗透”，取决于语境）。"},"examples":[{"en":"I can’t find “diosmosing” in a dictionary—did you mean “diagnosing”?","zh":"我在词典里找不到“diosmosing”——你是不是想写“diagnosing（诊断中）”？"},{"en":"In biology class, you might mean “osmosis,” not “diosmosing.”","zh":"在生物课里，你可能想说的是“osmosis（渗透）”，而不是“diosmosing”。"}]}],"phonetic":"/ˌdaɪ.ɑˈsmoʊzɪŋ/","extraExplanation":["如果你把原句（前后各多给5–10个词）贴出来，我可以更准确判断你想表达的词。","常见的两种可能：\n1) diagnosing：来自 diagnose（诊断），意思是“正在诊断/诊断中的”。\n2) osmosis：名词“渗透作用”；有时非正式写法会用 osmosing 表示“发生渗透”（但不算常见、较口语/临时用法）。"]}
{"word":"diosmosis","summary":{"en":"A rare term meaning “osmosis,” the movement of water through a semipermeable membrane toward higher concentration.","zh":"一个较罕见的词，意思是“渗透作用（osmosis）”，即水通过半透膜向较高浓度一侧移动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/technical) Osmosis: the movement of water (or another solvent) through a semipermeable membrane from a less concentrated solution to a more concentrated one.","zh":"（罕见/科技用语）渗透作用：水（或其他溶剂）通过半透膜从较低浓度溶液向较高浓度溶液移动的过程。"},"examples":[{"en":"Plants absorb water by diosmosis through their root cells.","zh":"植物通过根细胞的渗透作用（diosmosis）吸收水分。"},{"en":"In many modern textbooks, “diosmosis” is simply called “osmosis.”","zh":"在许多现代教材里，“diosmosis”通常就叫“osmosis（渗透作用）”。"}]}],"synonyms":["osmosis"],"phonetic":"/daɪˈɑːzməsɪs/","extraExplanation":["“diosmosis”多见于较早期或较少见的写法/用法，现代更常用的标准术语是“osmosis”。","词源上可理解为“dia-（穿过）+ osmosis（渗透）”，强调“穿过膜”的移动。写作或考试中建议优先使用“osmosis”，除非你在引用旧文献或特定领域资料。"]}
{"word":"diosmotic","summary":{"en":"Diosmotic means “related to osmosis,” but it is an older/less common term; “osmotic” is more common today.","zh":"diosmotic 表示“与渗透作用有关”，但较旧/少见；现代更常用 osmotic。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to osmosis (the movement of a solvent, especially water, through a semipermeable membrane).","zh":"与“渗透作用”有关的；渗透的（指溶剂，尤指水，通过半透膜的移动）。"},"examples":[{"en":"Water enters the cell by a diosmotic process when the outside solution is less concentrated.","zh":"当外部溶液浓度较低时，水会通过渗透（diosmotic）过程进入细胞。"},{"en":"The paper described diosmotic flow across a membrane under different salt levels.","zh":"该论文描述了在不同盐浓度下跨膜的渗透流动。"}]}],"synonyms":["osmotic","related to osmosis"],"phonetic":"/ˌdaɪ.ɑzˈmɑtɪk/","extraExplanation":["“diosmotic / diosmosis”是较旧或较少见的科学用语，现代教材与论文中更常用的是“osmotic / osmosis”。","词源上与“osmosis”相关，常见于早期生理学、化学或膜研究的文本；在当代写作里用“osmotic”通常更自然、更容易被读者理解。"]}
{"word":"diosphenol","summary":{"en":"Diosphenol is a chemical compound found in buchu, known for contributing to buchu oil’s aroma and sometimes noted in perfumery or herbal contexts.","zh":"Diosphenol 是布枯中的一种化学成分，常用于描述布枯精油的香气特征，也会在香料或草本语境中被提到。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a naturally occurring chemical compound found especially in buchu (a South African herb); it contributes to buchu oil’s smell and has been used in perfumery and some traditional herbal preparations.","zh":"一种天然存在的化学化合物，常见于布枯（南非草本植物）中；它影响布枯精油的气味，也用于香料/香水工业，并在一些传统草药用途中出现。"},"examples":[{"en":"Buchu oil contains several compounds, including diosphenol, which contributes to its distinctive aroma.","zh":"布枯精油含有多种成分，其中 diosphenol 会带来它独特的香气。"},{"en":"Some herbal product descriptions mention diosphenol as a component of buchu-based extracts.","zh":"一些草本产品说明会提到 diosphenol 是布枯提取物中的一种成分。"}]}],"synonyms":["buchu camphor"],"phonetic":"/daɪˈɑːsfəˌnɔːl/","extraExplanation":["diosphenol 多见于植物化学/精油成分的语境，日常英语里非常少用；如果你在配方、精油分析（GC/MS 报告）或草本资料中看到它，通常是在说“某种精油里的特定化学成分”。","常与 buchu（布枯，一种原产南非的芳香植物，常见属名为 Agathosma/Barosma）一起出现；相关资料也可能把它称作 “buchu camphor”（布枯樟脑，属俗称）。"]}
{"word":"Diospyraceae","summary":{"en":"Diospyraceae is the botanical family that includes persimmons and related trees/shrubs.","zh":"Diospyraceae 指柿科，即包含柿子等柿属植物及其近缘树木/灌木的植物科。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant family that includes the persimmon (genus Diospyros) and related trees and shrubs, often found in tropical and subtropical regions","zh":"柿科（植物科名）：包含柿属（Diospyros，柿子等）及其近缘树木与灌木的一类植物，多分布于热带与亚热带地区"},"examples":[{"en":"Persimmons belong to the plant family Diospyraceae.","zh":"柿子属于柿科（Diospyraceae）。"},{"en":"Some Diospyraceae species are valued for their hard, dark wood.","zh":"柿科的一些物种因木材坚硬、颜色深而具有价值。"}]}],"synonyms":["persimmon family"],"phonetic":"/ˌdaɪ.oʊˈspɪr.ə.siːˌiː/","extraExplanation":["“Diospyraceae”是拉丁化的植物分类学名称，常见于植物学、园艺学、生态学等正式语境；日常英语更常说“the persimmon family（柿科）”。","词源提示：与属名“Diospyros（柿属）”相关；该属中既有结果可食的柿树，也有以木材著名的乌木类（ebony）近缘种。"]}
{"word":"diospyraceae","summary":{"en":"Diospyraceae is the plant family that includes persimmons and ebony trees.","zh":"Diospyraceae 指柿科（乌木科），包含柿子和乌木等植物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of trees and shrubs (the ebony family), including persimmons and ebony trees","zh":"柿科（乌木科）：一类树木和灌木的植物科，包含柿子属与乌木属等"},"examples":[{"en":"Persimmon trees belong to the family Diospyraceae.","zh":"柿子树属于柿科（Diospyraceae）。"},{"en":"Ebony is a famous hardwood from some species in the Diospyraceae family.","zh":"乌木是柿科中一些物种产出的著名硬木。"}]}],"synonyms":["the ebony family"],"phonetic":"/ˌdaɪ.oʊ.spɪˈrɛ.si.iː/","extraExplanation":["“Diospyraceae”是植物分类学中的科名（family name），通常用于学术写作与植物志（flora）中。日常英语里更常说“the ebony family（乌木科）”或直接说“persimmon / ebony”。","词源提示：Diospyros（柿子属）来自希腊语词根，常被解释为与“神（dios）”和“果实/谷物（pyros）”相关，因此在一些资料中会看到“神之果”的意译。"]}
{"word":"diospyraceous","summary":{"en":"A botanical adjective meaning “related to *Diospyros* (persimmon) or the ebony family.”","zh":"一个植物学形容词，表示“与柿属（Diospyros，柿子）或乌木科植物有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the genus *Diospyros* (especially persimmon trees) or to plants in the ebony family (Ebenaceae).","zh":"（植物学）指柿属（*Diospyros*，尤其是柿子树等）或乌木科（Ebenaceae）植物的；与之有关的。"},"examples":[{"en":"Persimmon is a diospyraceous fruit commonly eaten fresh or dried.","zh":"柿子是一种常见的柿属（diospyraceous）水果，可以鲜食或晒干食用。"},{"en":"The researchers examined diospyraceous leaves under a microscope to compare species.","zh":"研究人员在显微镜下观察柿属（diospyraceous）植物的叶片，以比较不同物种。"}]}],"synonyms":["Diospyros-related","ebenaceous"],"phonetic":"/ˌdaɪəˈspɪrəsiəs/","extraExplanation":["这是一个比较少见的植物学形容词，通常出现在学术论文、植物志、标本记录中；日常英语更常用 *persimmon*（柿子）或直接说 *Diospyros*。","词源上来自拉丁化的新拉丁词 *Diospyros*（柿属名）+ 形容词后缀 *-aceous*（“……的；类似……的”）。*Diospyros* 源自希腊语词根，常被解释为“神圣/神赐的果实”。"]}
{"word":"Diospyros","summary":{"en":"Diospyros is the scientific genus name for persimmon and ebony trees.","zh":"Diospyros 是柿属的学名，包含柿子树与乌木树等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of trees and shrubs (the ebony and persimmon family) that includes persimmons and ebony trees; some species are grown for fruit (persimmons) and some for very hard wood (ebony).","zh":"柿属（黑柿属）：一类树木或灌木的属名，属于柿树科（柿科），包含柿子树与乌木（黑檀）等；有些种因果实可食而栽培（柿子），有些因木材坚硬而用于木材（乌木）。"},"examples":[{"en":"The Asian persimmon is classified in the genus Diospyros.","zh":"亚洲甜柿被归类在柿属（Diospyros）中。"},{"en":"Some Diospyros species are valued for ebony wood used in fine instruments.","zh":"一些柿属（Diospyros）的物种因产乌木而珍贵，可用于制作高档乐器。"}]}],"synonyms":["persimmon genus","ebony genus"],"phonetic":"/ˌdaɪ.əˈsprɑːrəs/","extraExplanation":["“Diospyros”是拉丁化的希腊语词源：dios（与“神/宙斯”相关）+ pyros（小麦/谷物），常被解释为“神的食物/神圣的果实”，与柿子在部分文化中的珍贵形象有关。","这是生物学分类名（属名），书写时通常首字母大写并用斜体：*Diospyros*。常见成员包括：*Diospyros kaki*（甜柿/日本柿）和若干可产乌木的物种。"]}
{"word":"diospyros","summary":{"en":"Diospyros is the botanical genus that includes persimmon trees and some ebony species.","zh":"Diospyros 是植物学上的“柿属”，包括柿子树以及一些乌木相关物种。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of trees and shrubs in the ebony family (Ebenaceae), including persimmon trees and some ebony-producing species.","zh":"柿属（Ebony family 柿科/乌木科的一属植物）；包含柿子树等，也有一些可产乌木的物种。"},"examples":[{"en":"The Japanese persimmon belongs to the genus Diospyros.","zh":"日本甜柿属于柿属（Diospyros）。"},{"en":"Some Diospyros species are valued for their hard, dark wood.","zh":"一些柿属植物因其坚硬、深色的木材而受到重视。"}]}],"synonyms":["persimmon (for some species)","ebony (for some species)"],"phonetic":"/ˌdaɪəˈspɪrəs/","extraExplanation":["“Diospyros”来自希腊语：dios（“神的/宙斯的”）+ pyros（常解释为“谷物/小麦”，也常被引申为“神的果实”）。因此在科普或园艺语境里，你可能会看到它被浪漫地称作“fruit of the gods（神的果实）”。","日常英语中，人们通常不会说“diospyros”，而更常说具体的俗名，比如“persimmon（柿子）”；“Diospyros”更多出现在植物学、园艺标签或学术写作中。"]}
{"word":"Diospyros-related","summary":{"en":"“Diospyros-related” means related to the genus *Diospyros* (persimmons and ebony trees).","zh":"“Diospyros-related”表示与柿属（含柿子与乌木等树种的属）有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with the plant genus *Diospyros* (which includes persimmons and ebony trees).","zh":"与柿属（*Diospyros*，包括柿子与乌木等树种的属）有关的。"},"examples":[{"en":"The study compares Diospyros-related compounds found in persimmon leaves.","zh":"这项研究比较了柿属相关化合物在柿子叶中的含量。"},{"en":"Diospyros-related species are important both for fruit production and hardwood timber.","zh":"柿属相关物种在水果生产与硬木木材方面都很重要。"}]}],"synonyms":["Diospyros-associated","Diospyros-linked","persimmon-related (context-specific)","ebony-related (context-specific)"],"phonetic":"/daɪˈɑspɪrəs rɪˈleɪtɪd/","extraExplanation":["“Diospyros”是植物学中的属名，常见代表是柿子（persimmon）与乌木（ebony）的来源树种。写作上常用连字符（Diospyros-related）把它当作形容词来修饰名词（如 species、compounds、traits）。","词源常被解释为来自希腊语构词，dios-（与“神/宙斯”相关）+ pyros（小麦/谷物），因此在科普语境里有时会被说成“神的果实/神之粮”之类的说法，但在现代英语里主要作为学名使用。"]}
{"word":"diota","summary":{"en":"“diota” isn’t an English word; it’s probably a misspelling of “idiot” (a rude insult).","zh":"“diota” 不是英文单词；很可能是把 “idiot”（侮辱性的骂人词）拼错了。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Not a standard English word.) Most likely a misspelling of “idiot,” meaning a very stupid person (an insulting word).","zh":"（不是标准英文单词。）很可能是把 “idiot” 拼错了，意思是“很蠢的人”（带侮辱性的说法）。"},"examples":[{"en":"I think you meant “idiot,” not “diota.”","zh":"我觉得你想写的是 “idiot”，不是 “diota”。"},{"en":"Please don’t call people an idiot—it's rude.","zh":"请不要叫别人 “idiot”——这很粗鲁。"}]}],"synonyms":["fool","jerk","moron (very rude)","silly person (milder)"],"phonetic":"/ˈɪdiət/","extraExplanation":["“idiot” 是明显的侮辱词，日常交流中尽量避免。更温和的说法有：“not very smart”（不太聪明）、“silly”（傻乎乎的/不太严重）、或直接描述行为： “That was a careless mistake.”（那是个粗心的错误）。","如果你其实想问的是游戏 “Dota / DotA”（Defense of the Ancients），请告诉我，我可以解释它的含义、读音和用法。"]}
{"word":"diothelism","summary":{"en":"Diothelism is the doctrine that Christ has two wills: divine and human.","zh":"diothelism 指“两意志论”：认为基督有神性与人性两种意志。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A Christian theological doctrine that Jesus Christ has two wills—one divine and one human—working in harmony.","zh":"（基督教神学）“两意志论”：主张耶稣基督具有两种意志——神性意志与人性意志——并且彼此和谐一致。"},"examples":[{"en":"In Christian history, diothelism became the accepted view that Christ has both a divine will and a human will.","zh":"在基督教历史中，两意志论成为被接受的观点：基督同时具有神性意志与人性意志。"},{"en":"The class compared diothelism with monothelitism to understand early debates about Christ’s nature.","zh":"课堂把两意志论与“一意志论”作比较，以理解早期关于基督本性的争论。"}]}],"synonyms":["two-will doctrine","dyothelitism"],"phonetic":"/daɪˈɑθəlɪzəm/","extraExplanation":["词源提示：dio- 表示“二、两”，-thele- 来自希腊语意为“意志/愿望”，-ism 表示“学说”。","背景补充：两意志论常与“一意志论（monothelitism）”对立，属于基督论（Christology）讨论的一部分，核心在于如何同时肯定基督的完全神性与完全人性。"]}
{"word":"dioti","summary":{"en":"“Dioti” is not a standard English word; it’s probably a misspelling of “idiot” or a mistaken form of “do it.”","zh":"“dioti”不是标准英语单词；多半是把“idiot”拼错了，或把短语“do it”写成了别的形式。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling of “idiot” or a mistaken form of the phrase “do it.”","zh":"不是标准英语单词。很可能是拼写错误，原意可能是“idiot”（蠢人/笨蛋，带侮辱）或短语“do it”（去做/执行）。"},"examples":[{"en":"“Dioti” isn’t in most dictionaries—did you mean “idiot”?","zh":"“dioti”在大多数词典里找不到——你是想写“idiot”吗？"},{"en":"If you meant “do it,” you can write: “Just do it.”","zh":"如果你想表达“do it”，可以写：“Just do it.”（就去做吧。）"}]}],"synonyms":["(for “idiot”) fool","(for “idiot”) jerk (informal, can be rude)"],"phonetic":"/ˈɪdiət/","extraExplanation":["“idiot”是常见的侮辱性用语，日常交流中建议避免用来称呼别人。更礼貌的替代说法可以是：\"That was a mistake.\"（那是个错误。）或 \"That wasn’t a good idea.\"（那不是个好主意。）","如果你告诉我“dioti”出现的句子/上下文（例如聊天记录的一整句），我可以更准确判断你想表达的是哪个词。"]}
{"word":"diotic","summary":{"en":"“Idiotic” means very stupid or showing terrible judgment.","zh":"“idiotic”表示“非常愚蠢的；判断力很差的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Extremely silly, stupid, or showing very poor judgment.","zh":"极其愚蠢的；很傻的；判断力很差的。"},"examples":[{"en":"It was an idiotic mistake to leave the door unlocked.","zh":"把门忘了锁是个很愚蠢的错误。"},{"en":"I felt idiotic after sending the email to the wrong person.","zh":"我把邮件发错人后，感觉自己很蠢。"},{"en":"Don’t do anything idiotic—think first.","zh":"别做蠢事——先想清楚。"}]}],"synonyms":["stupid","silly","foolish","absurd","ridiculous"],"phonetic":"/ˌɪdiˈɑtɪk/","extraExplanation":["你输入的“diotic”通常是拼写错误；正确拼写一般是“idiotic”。","“idiotic”在日常口语里很常见，但语气偏负面、可能带侮辱性。描述行为或决定（an idiotic decision）通常比直接说人（You’re idiotic.）更不伤人。"]}
{"word":"Diotocardia","summary":{"en":"“Diotocardia” is likely a misspelling; the intended term is usually **dextrocardia** (heart on the right side).","zh":"“Diotocardia”很可能是拼写错误；通常想表达的是 **dextrocardia（右位心）**。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"“Diotocardia” is not a standard English medical term; it is most likely a misspelling of **dextrocardia**, a condition in which the heart is located on the right side of the chest instead of the left.","zh":"“Diotocardia”不是标准的英文医学术语；它很可能是 **dextrocardia（右位心）** 的拼写错误，指心脏位于胸腔右侧而不是通常的左侧。"},"examples":[{"en":"The report says “diotocardia,” but the correct term is usually “dextrocardia.”","zh":"报告里写“diotocardia”，但通常正确的术语是“dextrocardia”。"},{"en":"Dextrocardia is often found on imaging tests like an X-ray or CT scan.","zh":"右位心常常在 X 光或 CT 等影像检查中被发现。"}]}],"phonetic":"/ˌdɛkstroʊˈkɑːrdiə/","extraExplanation":["“Dextro-”来自拉丁语/希腊语词根，意思是“右”；“-cardia”与“心脏”有关。因此 dextrocardia 字面意思就是“心脏在右侧”。","右位心有时会单独出现，也可能与“内脏反位（situs inversus）”等情况相关。是否需要处理取决于是否合并其他结构异常，需要由医生结合检查结果判断。","如果你是从化验单/影像报告中看到“Diotocardia”，建议核对原文（是否其实是 dextrocardia）或把完整句子/截图发来，我可以帮你确认术语。"]}
{"word":"diotocardia","summary":{"en":"“diotocardia” is not a recognized standard English word; it’s probably a misspelling (often of “dextrocardia”).","zh":"“diotocardia”不是标准英文词；很可能是拼写错误（常见为“dextrocardia”，右位心）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries; it is likely a misspelling of a medical term (often “dextrocardia”).","zh":"不是常见词典中的标准英文词；很可能是某个医学术语的拼写错误（常见的是“dextrocardia”，右位心）。"},"examples":[{"en":"I couldn’t find “diotocardia” in medical dictionaries—did you mean “dextrocardia”?","zh":"我在医学词典里找不到“diotocardia”——你是不是想写“dextrocardia”（右位心）？"},{"en":"If you share the sentence where you saw “diotocardia,” I can help identify the correct term.","zh":"如果你把“diotocardia”出现的原句发我，我可以帮你确认正确的术语。"}]}],"phonetic":"/ˌdi.oʊ.toʊˈkɑr.di.ə/","extraExplanation":["“dextrocardia”是较常见、与拼写最接近的医学词：指心脏位于胸腔右侧（先天性位置异常）。如果你原本想表达“心脏相关疾病/异常”，也可能是其他词（如 cardiomyopathy 心肌病、tachycardia 心动过速等）。把上下文或来源截图发来会更容易判断。"]}
{"word":"diotrephes","summary":{"en":"Diotrephes is a biblical name, often associated with a power-seeking, unwelcoming church leader in 3 John.","zh":"Diotrephes 是一个《圣经》人物名，常与《约翰三书》中“好权、排斥他人”的教会领袖形象相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Diotrephes: a man mentioned in the New Testament (3 John) who is criticized for loving to be in charge and refusing to welcome others.","zh":"丢特腓（Diotrephes）：《新约圣经·约翰三书》中提到的人物，被批评为好权、爱出风头，并拒绝接待他人。"},"examples":[{"en":"In 3 John, Diotrephes refuses to welcome the brothers and even puts people out of the church.","zh":"在《约翰三书》中，丢特腓拒绝接待弟兄，甚至把人赶出教会。"},{"en":"Some writers use “a Diotrephes” to describe a domineering leader who won’t listen.","zh":"有些作者会用“a Diotrephes”来形容专横、听不进意见的领导者。"}]}],"phonetic":"/daɪˈɑːtrəˌfiːz/","extraExplanation":["这是一个专有名词（人名），主要出现在《圣经·新约·约翰三书》（3 John 1:9–10）。在基督教语境里，他常被当作“爱掌权、排斥他人”的负面典型，用来提醒人不要滥用权力或以自我为中心。"]}
{"word":"Dioula","summary":{"en":"Dioula refers to a West African language (also called Dyula/Jula) and to the people who speak it; it can also describe things related to them.","zh":"Dioula 指西非的迪尤拉语（也称 Dyula/Jula）以及迪尤拉族群；也可作形容词表示“与其相关的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a Mande language spoken mainly in Burkina Faso, Côte d’Ivoire, and Mali, widely used as a trade and everyday communication language in parts of West Africa (also spelled Dyula or Jula).","zh":"迪尤拉语（也拼作 Dyula 或 Jula）：一种曼德语族语言，主要通行于布基纳法索、科特迪瓦和马里等地，在西非部分地区也常作为贸易与日常通用语。"},"examples":[{"en":"Many market sellers in Bobo-Dioulasso can speak Dioula.","zh":"在博博-迪乌拉索，许多市场商贩都会说迪尤拉语。"},{"en":"She learned basic Dioula to greet customers politely.","zh":"她学了基础的迪尤拉语，好礼貌地和顾客打招呼。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who belongs to the Dioula (Dyula/Jula) people, historically known as merchants and traders in West Africa.","zh":"迪尤拉人：指属于迪尤拉（Dyula/Jula）族群的人；在历史上常以商贸与长途贸易闻名于西非。"},"examples":[{"en":"He is Dioula and grew up in northern Côte d’Ivoire.","zh":"他是迪尤拉人，在科特迪瓦北部长大。"},{"en":"Dioula communities have long been connected through trade networks.","zh":"迪尤拉社群长期以来通过贸易网络联系在一起。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Dioula people or their language.","zh":"与迪尤拉人或迪尤拉语相关的。"},"examples":[{"en":"They listened to Dioula music at the cultural festival.","zh":"他们在文化节上听了迪尤拉音乐。"},{"en":"A Dioula phrasebook can be useful for travelers in the region.","zh":"去该地区旅行时，一本迪尤拉语会话手册很有用。"}]}],"synonyms":["Dyula","Jula"],"phonetic":"/diˈuːlə/","extraExplanation":["“Dioula”常见于法语拼写传统的英语/国际用法；在学术或英语语境中也常见拼写“Dyula”或“Jula”，指向的语言/族群在很多情况下是同一或高度相关的概念。","作为通用语（lingua franca）时，迪尤拉语在西非一些城市与市场场景中非常实用，常用于跨族群交流与商业往来。"]}
{"word":"diovular","summary":{"en":"Diovular means “having two ovules,” a rare botanical term.","zh":"diovular 指“有两个胚珠的”，是较罕见的植物学用语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany, rare) Having two ovules (seed-forming structures) in an ovary or chamber.","zh":"（植物学，罕用）二胚珠的；（子房或室内）有两个胚珠的。"},"examples":[{"en":"In some species the ovary is diovular, producing at most two seeds.","zh":"在一些物种中，子房是二胚珠的，因此最多结出两粒种子。"},{"en":"The description notes a diovular ovary with a single locule.","zh":"该描述指出子房为单室且具二胚珠。"}]}],"synonyms":["two-ovule(d)","biovular","diovulate"],"phonetic":"/daɪˈɑːvjələr/","extraExplanation":["“diovular”在现代英语里非常少见，多见于老的或高度专业的植物学描述。更常见的表达是“two-ovule(d)”或“biovular / diovulate”。","词源上“di-”表示“二、双”，“ovule”表示“胚珠”。如果你是在论文/植物志里看到它，通常是在描述子房（ovary）或心皮室（locule）里胚珠的数量。"]}
{"word":"diovulate","summary":{"en":"Diovulate means to ovulate (release) two eggs in the same cycle.","zh":"Diovulate 指在同一周期内排出（排卵）两个卵子。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(In biology/medicine) to release two eggs (two ova) from the ovaries in the same menstrual/estrous cycle.","zh":"（生物/医学）在同一个月经周期或发情周期中排出两个卵子（两枚卵）。"},"examples":[{"en":"Some people diovulate naturally, which can increase the chance of fraternal twins.","zh":"有些人会自然地“排双卵”，这会提高生出异卵双胞胎的概率。"},{"en":"Fertility drugs may cause a patient to diovulate in a single cycle.","zh":"促排卵药物可能导致患者在一个周期内排出两枚卵子。"}]},{"partOfSpeech":"vt.","definition":{"en":"To cause an animal or person to release two eggs in one cycle (less common; usually phrased as “induce diovulation”).","zh":"使（人或动物）在一个周期内排出两个卵子（较少见；更常说“诱导双卵排卵”）。"},"examples":[{"en":"Researchers tried to induce cows to diovulate to increase the number of embryos.","zh":"研究人员尝试诱导奶牛双卵排卵，以增加胚胎数量。"}]}],"synonyms":["ovulate two eggs","release two eggs","have diovulation"],"phonetic":"/daɪˈɑv.jəˌleɪt/","extraExplanation":["“diovulate”不是日常英语词汇，主要出现在生殖医学、动物繁殖与科研语境中。","它与“fraternal twins（异卵双胞胎）”相关：当同一周期排出两枚卵子并分别受精时，更可能形成异卵双胞胎。","更常见的名词形式是“diovulation（双卵排卵）”；表达上也常用“release two eggs / ovulate two eggs（排出/排卵两枚卵子）”。"]}
{"word":"dioxan","summary":{"en":"Dioxan (more commonly spelled dioxane) is a chemical solvent, often referring to 1,4-dioxane.","zh":"Dioxan（更常见拼写为 dioxane）是一种化学溶剂，常指 1,4-二氧六环。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a colorless, flammable chemical liquid (usually referring to 1,4-dioxane) used as an industrial solvent and sometimes found as a trace contaminant in some products.","zh":"一种无色、易燃的化学液体（通常指1,4-二氧六环），常用作工业溶剂，也可能作为微量污染物出现在某些产品中。"},"examples":[{"en":"The lab stored dioxan in a sealed container because it evaporates easily.","zh":"实验室把 dioxan 密封保存，因为它很容易挥发。"},{"en":"Some reports test for dioxan as a possible contaminant in water or cosmetics.","zh":"一些报告会检测水或化妆品中是否可能含有 dioxan 这类污染物。"}]}],"synonyms":["dioxane","1,4-dioxane"],"phonetic":"/daɪˈɑkseɪn/","extraExplanation":["“dioxan”在英文中更常见的拼写是 **dioxane**（尤其是 **1,4-dioxane**）。如果你是在阅读化学或安全资料，建议用“dioxane/1,4-dioxane”去查，会更容易找到权威信息。","它属于化学/工业语境词汇，日常对话中不常用；在新闻或产品检测话题里出现时，多与“溶剂、污染物、检测标准”相关。"]}
{"word":"dioxane","summary":{"en":"Dioxane is a chemical solvent (usually 1,4-dioxane) that can be hazardous to health and the environment.","zh":"dioxane 指一种化学溶剂（多指 1,4-二氧六环），可能对健康和环境有危害。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a colorless, flammable liquid chemical (an ether) used mainly as an industrial solvent and in making other chemicals; it can be a health and environmental hazard.","zh":"一种无色、易燃的液体化学品（属醚类），主要用作工业溶剂或用于制造其他化学品；对健康与环境可能有危害。"},"examples":[{"en":"1,4-Dioxane is sometimes found as a contaminant in industrial wastewater.","zh":"1,4-二氧六环有时会作为污染物出现在工业废水中。"},{"en":"The lab uses dioxane as a solvent, so we handle it in a fume hood.","zh":"实验室把二氧六环当作溶剂使用，所以我们在通风橱里操作。"}]}],"synonyms":["1,4-dioxane"],"phonetic":"/daɪˈɑkseɪn/","extraExplanation":["“Dioxane”最常指“1,4-dioxane（1,4-二氧六环）”。它是一种环状醚（六元环、含两个氧原子），因此英文也可理解为“di-（两个）+ ox-（氧）+ -ane（饱和烃/环烷命名习惯的结尾）”。","在日常英语里这个词多出现在化学、环境检测与公共健康语境中；一般人不会在生活对话中使用。","安全语境中常见搭配：dioxane exposure（暴露）、dioxane contamination（污染）、trace amounts of dioxane（微量二氧六环）、suspected carcinogen（疑似致癌物，常用于说明风险）。"]}
{"word":"dioxanes","summary":{"en":"“Dioxanes” is the plural form of “dioxane,” referring to dioxane solvents/compounds (especially 1,4-dioxane) used in chemistry and industry.","zh":"“Dioxanes”是“dioxane（二噁烷）”的复数，指二噁烷类溶剂/化合物（尤指1,4-二噁烷），常见于化学与工业语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of dioxane: a group of chemical solvents; each dioxane is a six‑membered ring compound containing two oxygen atoms (often used in industry and laboratories).","zh":"dioxane 的复数：一类化学溶剂；每个 dioxane 指含两个氧原子的六元环化合物（常用于工业与实验室）。"},"examples":[{"en":"Some labs avoid using dioxanes because safer solvents are available.","zh":"一些实验室会避免使用 dioxanes，因为有更安全的溶剂可替代。"},{"en":"The report tested groundwater near the factory for dioxanes.","zh":"报告检测了工厂附近地下水中的 dioxanes。"}]}],"synonyms":["dioxane solvents","1,4-dioxane (common specific type)"],"phonetic":"/daɪˈɑːkseɪn/","extraExplanation":["“Dioxane”最常见特指“1,4-dioxane（1,4-二噁烷）”，是一种常用溶剂，但具有健康与环境风险；在安全文件或法规中常被重点监测。","复数 dioxanes 有时表示“二噁烷类（dioxane family）”的多种异构体或衍生物，而不只是多个同一种 1,4-二噁烷。"]}
{"word":"dioxid","summary":{"en":"A dioxide is a compound with two oxygen atoms, like carbon dioxide (CO₂).","zh":"dioxide 指含有两个氧原子的化合物，如二氧化碳（CO₂）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound that contains two oxygen atoms combined with another element (for example, carbon dioxide: CO₂).","zh":"二氧化物：由某种元素与两个氧原子结合形成的化合物（例如二氧化碳 CO₂）。"},"examples":[{"en":"Carbon dioxide (CO₂) is a dioxide made of carbon and oxygen.","zh":"二氧化碳（CO₂）是一种由碳和氧组成的二氧化物。"},{"en":"Sulfur dioxide can irritate your eyes and throat.","zh":"二氧化硫可能会刺激眼睛和喉咙。"}]}],"synonyms":["oxide (general term)"],"phonetic":"/daɪˈɑk.saɪd/","extraExplanation":["“dioxid”常见于某些语言（如德语）或较旧/技术性拼写；在现代英语中更标准、更常用的拼写是“dioxide”。","词源提示：di- 表示“二/两个”，oxide 表示“氧化物”。因此 dioxide 直观理解就是“含两个氧原子的氧化物”。","常见例子：carbon dioxide（二氧化碳，CO₂）、nitrogen dioxide（二氧化氮，NO₂）、sulfur dioxide（二氧化硫，SO₂）。"]}
{"word":"dioxide","summary":{"en":"A dioxide is an oxide containing two oxygen atoms, such as carbon dioxide (CO₂).","zh":"dioxide 指“二氧化物”，即含有两个氧原子的氧化物，如二氧化碳（CO₂）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound that contains two oxygen atoms combined with one atom of another element (for example, carbon dioxide, CO₂)","zh":"二氧化物：由另一种元素的一个原子与两个氧原子结合形成的化合物（如二氧化碳 CO₂）"},"examples":[{"en":"Carbon dioxide is a dioxide made of one carbon atom and two oxygen atoms.","zh":"二氧化碳是一种二氧化物，由一个碳原子和两个氧原子组成。"},{"en":"Sulfur dioxide can irritate the lungs and contribute to air pollution.","zh":"二氧化硫会刺激肺部，并加重空气污染。"}]}],"phonetic":"/daɪˈɑk.saɪd/","extraExplanation":["“di-”是前缀，表示“二”；“oxide”表示“氧化物”。因此 dioxide 字面意思就是“含两个氧原子的氧化物”。","常见的 dioxide 包括 carbon dioxide（二氧化碳）、sulfur dioxide（二氧化硫）、nitrogen dioxide（二氧化氮）。在环境与健康话题中最常见的是二氧化碳（温室气体）和二氧化硫/二氧化氮（空气污染物）。"]}
{"word":"dioxides","summary":{"en":"“Dioxides” means chemical compounds that contain two oxygen atoms.","zh":"“Dioxides”指含有两个氧原子的化合物（二氧化物）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of dioxide: chemical compounds that contain two oxygen atoms combined with one other element (for example, carbon dioxide).","zh":"dioxide 的复数：指含有两个氧原子并与另一种元素结合形成的化合物（如二氧化碳）。"},"examples":[{"en":"Factories must reduce their emissions of dioxides such as sulfur dioxide.","zh":"工厂必须减少二氧化物（如二氧化硫）的排放。"},{"en":"Scientists measure dioxides in the air to study pollution and climate change.","zh":"科学家测量空气中的二氧化物来研究污染与气候变化。"}]}],"synonyms":["oxides (general term)","binary oxides"],"phonetic":"/daɪˈɑːksaɪd/","extraExplanation":["在化学命名中，前缀 di- 表示“二”，oxide 表示“氧化物”，所以 dioxide 就是“含两个氧原子”的氧化物。常见的有 carbon dioxide（二氧化碳，CO₂）、sulfur dioxide（二氧化硫，SO₂）、nitrogen dioxide（二氧化氮，NO₂）。"]}
{"word":"dioxids","summary":{"en":"“Dioxids” is usually a misspelling of “dioxides,” meaning compounds with two oxygen atoms (e.g., carbon dioxide).","zh":"“dioxids”通常是“dioxides”的拼写错误，指含两个氧原子的化合物（如二氧化碳）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound that contains two oxygen atoms combined with another element (plural: dioxides).","zh":"含有两个氧原子并与另一种元素结合形成的化合物（复数：dioxides，二氧化物）。"},"examples":[{"en":"Carbon dioxide (CO₂) is a gas we exhale when we breathe out.","zh":"二氧化碳（CO₂）是我们呼气时排出的气体。"},{"en":"Many factories try to reduce sulfur dioxide pollution.","zh":"许多工厂努力减少二氧化硫污染。"}]}],"synonyms":["oxide (general term)"],"phonetic":"/daɪˈɑk.saɪd/","extraExplanation":["“dioxids”通常是拼写错误；标准拼写是“dioxides”（复数）或“dioxide”（单数）。","在科学与新闻语境中最常见的是“carbon dioxide（二氧化碳）”和“sulfur dioxide（二氧化硫）”。"]}
{"word":"dioxim","summary":{"en":"Dioxin is a very toxic environmental pollutant that can be produced by certain industrial processes and burning and can accumulate in living things.","zh":"二噁英是毒性極強的環境污染物，可由某些工業製程與燃燒產生，並可能在生物體內累積。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a highly toxic chemical pollutant (a group of related compounds) that can form during some industrial processes and burning; it can build up in the environment and in the body","zh":"二噁英（或稱戴奧辛；一類毒性很強的化學污染物），可在某些工業製程與燃燒過程中生成；會在環境與人體內累積"},"examples":[{"en":"Dioxin can enter the food chain through contaminated soil and water.","zh":"二噁英可能透過受污染的土壤和水進入食物鏈。"},{"en":"Officials warned people not to eat fish from the river because of possible dioxin contamination.","zh":"官員警告民眾不要食用該河流的魚，因為可能受到二噁英污染。"},{"en":"Long-term exposure to dioxin may increase health risks.","zh":"長期暴露於二噁英可能增加健康風險。"}]}],"synonyms":["toxic pollutant","environmental contaminant","POPs (persistent organic pollutants)"],"phonetic":"/daɪˈɑːksɪn/","extraExplanation":["你輸入的「dioxim」很可能是拼寫錯誤；常見正確拼法是 **dioxin**。","二噁英通常不是「刻意製造來使用」的單一化學品，而常被視為某些化工、焚燒或金屬加工等過程的副產物；因此新聞中常與環境汙染、食品安全（特別是高脂肪動物性食品）一起出現。","文化與歷史背景上，二噁英曾在一些重大污染事件與戰爭相關報導中被提及（例如與「橙劑」污染爭議相關的討論），因此在英語媒體裡帶有強烈的公共健康與環境正義語境。"]}
{"word":"dioxime","summary":{"en":"A dioxime is a compound with two oxime groups, often used to bind metal ions in chemical tests.","zh":"dioxime（二肟）指含两个肟基的化合物，常用于与金属离子络合的化学检验。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound that contains two oxime groups (—C=NOH); dioximes are often used as reagents that bind (chelate) metal ions.","zh":"含有两个肟基（—C=NOH）的化合物；二肟类常用作能与金属离子形成络合物（螯合）的试剂。"},"examples":[{"en":"Dimethylglyoxime is a well-known dioxime used to detect nickel ions in the lab.","zh":"二甲基乙二肟是一种著名的二肟类试剂，常用于实验室检测镍离子。"},{"en":"Some dioximes form brightly colored complexes with metals, which makes identification easier.","zh":"某些二肟能与金属形成颜色鲜艳的络合物，从而更容易进行鉴定。"}]}],"synonyms":["bis(oxime)","dioxim"],"phonetic":"/daɪˈɑkˌsim/","extraExplanation":["“dioxime”由前缀 di-（两个）+ oxime（肟）构成，是典型的化学命名方式。常见例子是 dimethylglyoxime（DMG），在分析化学中用于与 Ni²⁺ 形成红色沉淀/络合物，因此在教材和实验中很常见。"]}
{"word":"dioxin","summary":{"en":"Dioxin is a very toxic pollutant chemical (or group of chemicals) often linked to industrial processes and burning waste.","zh":"二噁英是一种（或一类）与工业过程和焚烧废弃物相关的剧毒污染物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a highly poisonous chemical (or group of related chemicals) that can be produced during certain industrial processes or when materials like plastics are burned; it can pollute air, soil, and food and harm human health","zh":"二噁英；一种（或一类相关的）剧毒化学物质，可能在某些工业过程中产生，或在燃烧塑料等材料时生成；会污染空气、土壤和食物，并危害人体健康"},"examples":[{"en":"Dioxin can enter the body through contaminated food, especially animal fat.","zh":"二噁英可能通过受污染的食物进入人体，尤其是动物脂肪。"},{"en":"The government tested the soil for dioxin after the factory fire.","zh":"工厂火灾后，政府对土壤进行了二噁英检测。"},{"en":"People worry about dioxin because long-term exposure may increase health risks.","zh":"人们担心二噁英，因为长期接触可能增加健康风险。"}]}],"synonyms":["toxic pollutant","environmental contaminant"],"phonetic":"/daɪˈɑːksɪn/","extraExplanation":["“Dioxin”在新闻与环保语境中常指一类化合物（如TCDD），不是单一化学品。它们常以极低浓度存在，但因“持久性强、易在食物链中累积”而受到关注。","发音与拼写提示：dio- 表示“两/二”，-xin 结尾常见于化学名词；写作中通常用不可数名词（some dioxin），也可用作可数（different dioxins）指不同种类。"]}
{"word":"dioxindole","summary":{"en":"Dioxindole is a specialized organic-chemistry term for an oxygen-containing indole derivative, mainly used in research and synthesis contexts.","zh":"Dioxindole 是有机化学中的专业术语，指含氧的吲哚衍生物，主要用于科研与合成语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound in organic chemistry: an indole derivative containing two oxygen atoms (often discussed as a building block or intermediate in synthesis and research).","zh":"（有机化学）一种化合物：含有两个氧原子的吲哚（indole）衍生物，常作为合成中的结构单元或反应中间体在研究中出现。"},"examples":[{"en":"The paper describes the synthesis of dioxindole from an indole precursor under mild conditions.","zh":"这篇论文描述了在温和条件下由吲哚前体合成 dioxindole 的方法。"},{"en":"Dioxindole derivatives are sometimes explored for their potential biological activity.","zh":"dioxindole 的衍生物有时会因其潜在的生物活性而被研究。"}]}],"synonyms":["oxygenated indole derivative","indole oxide (broad/approximate)"],"phonetic":"/daɪˌɑk.sɪnˈdoʊl/","extraExplanation":["这是一个偏专业的化学名词，多见于学术论文、专利或实验步骤中，而不属于日常英语词汇。","词形可以拆开理解：diox- 表示“二氧/含两个氧”，-indole 指“吲哚”这一常见杂环骨架；因此 dioxindole 通常指“带有两个氧取代/氧化特征的吲哚骨架化合物”。","不同文献中可能对应不同的具体结构或命名习惯；如果你能提供上下文（例如论文标题、反应式或一句原文），我可以帮你更精确地对应结构与中文译名。"]}
{"word":"dioxins","summary":{"en":"Dioxins are a group of very toxic environmental pollutants that can accumulate in the food chain and in body fat.","zh":"二噁英是一类毒性很强的环境污染物，可能在食物链与体脂中累积。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group of highly toxic chemical pollutants (especially certain chlorinated compounds) that can build up in the environment and in animal/human fat, and may cause serious health problems.","zh":"一类毒性很强的化学污染物（尤其是某些含氯化合物），会在环境以及动物/人体脂肪中累积，并可能引发严重健康问题。"},"examples":[{"en":"Dioxins can enter the food chain through contaminated soil and water.","zh":"二噁英可能通过受污染的土壤和水进入食物链。"},{"en":"Governments set strict limits on dioxins in food to protect public health.","zh":"政府会对食品中的二噁英设定严格限量，以保护公众健康。"},{"en":"Burning plastics can release dioxins into the air.","zh":"焚烧塑料可能会向空气中释放二噁英。"}]}],"synonyms":["toxic pollutants","persistent organic pollutants (POPs)"],"phonetic":"/ˈdaɪˌɑːksɪnz/","extraExplanation":["“Dioxins”通常用复数，指一“组”相关化合物，而不只是单一物质；在新闻与科普里常见的更准确说法是“dioxins and dioxin-like compounds（二噁英及类二噁英化合物）”。","二噁英常在某些燃烧或工业过程的副产物中出现（例如含氯材料在不完全燃烧时）。它们具有“持久性”（不易分解）和“生物累积性”（在生物体内越积越多），因此风险往往与长期暴露有关。","常见语境：食品安全（肉类、鱼类、乳制品的检测）、环境污染事件、工业排放管制与焚烧炉管理等。"]}
{"word":"dioxy","summary":{"en":"Dioxy- is a scientific combining form meaning “with two oxygen atoms.”","zh":"dioxy- 是一个科学构词形式，意思是“含有两个氧原子”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Chemistry) A combining form meaning “containing two oxygen atoms,” used in scientific terms (often written as dioxy-).","zh":"（化学）构词形式，表示“含有两个氧原子”，常用于科学术语中（常写作 dioxy-）。"},"examples":[{"en":"In older chemical naming, you may see dioxy- used to show a compound has two oxygen atoms in a group.","zh":"在较旧的化学命名中，你可能会看到 dioxy- 用来表示某个基团里有两个氧原子。"},{"en":"The label uses scientific wording, so dioxy- appears as a prefix rather than a stand‑alone word.","zh":"标签使用科学用语，因此 dioxy- 通常作为前缀出现，而不是一个独立的单词。"}]}],"synonyms":["di- (as a general “two-” prefix)"],"phonetic":"/daɪˈɑːksi/","extraExplanation":["“dioxy”本身在日常英语里几乎不会单独使用，更常见的形式是前缀“dioxy-”。它出现在一些专业或历史性的化学命名中。","现代化学命名里，更常见的相关表达包括：di-（两个）、oxide（氧化物）、dioxide（二氧化物，如 carbon dioxide）。如果你告诉我它出现的完整单词/句子，我可以帮你判断具体含义。"]}
{"word":"dioxygen","summary":{"en":"Dioxygen is O₂, the two-atom form of oxygen gas commonly found in air.","zh":"Dioxygen 指 O₂，即由两个氧原子组成、空气中常见的氧气形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A molecule made of two oxygen atoms (O₂); the common form of oxygen gas in air.","zh":"由两个氧原子组成的分子（O₂）；空气中最常见的氧气气体形式。"},"examples":[{"en":"Plants release dioxygen during photosynthesis.","zh":"植物在光合作用过程中释放双氧（O₂）。"},{"en":"Humans need dioxygen to breathe and produce energy in cells.","zh":"人类需要双氧来呼吸，并在细胞中产生能量。"},{"en":"The tank contains compressed dioxygen for medical use.","zh":"这个气瓶里装有用于医疗的压缩双氧。"}]}],"synonyms":["oxygen (common use)","O2"],"phonetic":"/daɪˈɑksɪdʒən/","extraExplanation":["在日常英语里，人们通常说“oxygen”来指 O₂（氧气）。在化学语境中更精确地说“dioxygen”，是为了强调它由两个氧原子组成（与“atomic oxygen”单原子氧或“ozone”臭氧 O₃ 区分）。","前缀 di- 表示“二/两个”，如 dioxide（二氧化物）、diatomic（双原子的）。"]}
{"word":"dioxygenase","summary":{"en":"A dioxygenase is an enzyme that incorporates both oxygen atoms from O₂ into a substrate molecule.","zh":"dioxygenase 指一种把 O₂ 的两个氧原子都并入底物分子的酶（双加氧酶）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an enzyme that adds (incorporates) both atoms of molecular oxygen (O₂) into another molecule during a chemical reaction","zh":"双加氧酶；一种在反应中把分子氧（O₂）的两个氧原子都“加到”底物分子上的酶"},"examples":[{"en":"Dioxygenases are important in breaking down pollutants in soil and water.","zh":"双加氧酶在分解土壤和水中的污染物方面很重要。"},{"en":"This pathway begins with a dioxygenase that inserts both oxygen atoms into the substrate.","zh":"这条代谢途径以一种双加氧酶开始，它会把两个氧原子都插入到底物中。"},{"en":"Researchers measured dioxygenase activity to understand how the bacteria metabolize aromatic compounds.","zh":"研究人员测量双加氧酶活性，以了解细菌如何代谢芳香族化合物。"}]}],"synonyms":["oxygenase","dioxygenase enzyme","O2-incorporating enzyme"],"phonetic":"/daɪˈɑk.sɪ.dʒəˌneɪs/","extraExplanation":["词形拆解：di-（两个）+ oxygen（氧）+ -ase（酶，常见于酶类名称）。","与 monooxygenase（单加氧酶）对比：单加氧酶通常只把 O₂ 中的“一个”氧原子并入底物，另一个氧原子常被还原成水；而 dioxygenase 通常把“两个”氧原子都并入底物。","常见语境：生物化学、分子生物学、环境微生物学（如降解芳香烃、药物代谢与天然产物合成等）。"]}

