{"word":"diquat","summary":{"en":"Diquat is a toxic, fast-acting herbicide used to kill weeds and sometimes to dry crops before harvest.","zh":"Diquat（敌草快）是一种有毒的速效除草剂，用于杀灭杂草，有时也用于作物收获前的催枯干燥处理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fast-acting chemical herbicide used to kill weeds and to dry out (desiccate) crops before harvesting; it is toxic if swallowed or inhaled","zh":"一种速效化学除草剂，也可用于作物收获前的“干燥（催枯）处理”；误食或吸入会有毒"},"examples":[{"en":"Diquat is used to control weeds along roadsides and in fields.","zh":"敌草快常用于控制路边和田地里的杂草。"},{"en":"The label warns that diquat is toxic and must be handled with protective gear.","zh":"标签警告敌草快有毒，必须佩戴防护装备操作。"},{"en":"Some crops are treated with diquat to speed up drying before harvest.","zh":"有些作物会用敌草快进行处理，以加快收获前的干燥。"}]}],"synonyms":["herbicide","weed killer","desiccant","paraquat (related, not the same chemical)"],"phonetic":"/ˈdaɪkwæt/","extraExplanation":["“Diquat”常译为“敌草快”。它与“paraquat（百草枯）”同属联吡啶类除草剂，但不是同一种化学品。","由于毒性风险较高，不同国家/地区对敌草快的销售与使用有不同限制；实际使用需严格遵循当地法规与产品说明。","在阅读英文资料时，常见搭配包括：diquat dibromide（敌草快二溴化物）、contact herbicide（触杀型除草剂）、desiccant（干燥剂/催枯剂）。"]}
{"word":"diquats","summary":{"en":"Diquat is a fast-acting herbicide used to kill weeds and other plants; “diquats” is the plural form.","zh":"diquat 指一种速效除草剂（敌草快）；diquats 是其复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fast-acting chemical herbicide (often used as a salt, diquat dibromide) that dries out and kills many plants, especially weeds","zh":"一种速效化学除草剂（常以“敌草快溴化物”等盐类形式使用），可使植物组织迅速干燥并杀死多种植物，常用于杂草防除"},"examples":[{"en":"The farmer used diquat to control weeds along the irrigation canal.","zh":"农民用敌草快来控制灌溉渠边的杂草。"},{"en":"Some labels warn that diquat is highly toxic if swallowed.","zh":"一些产品标签会警告：敌草快若误食毒性很强。"},{"en":"The field was treated with diquat before planting the next crop.","zh":"在种下一茬作物之前，这块地先用敌草快处理过。"}]}],"synonyms":["herbicide","weed killer"],"phonetic":"/ˈdaɪkwæt/","extraExplanation":["“diquat”常作为不可数名词使用；“diquats”多见于复数语境，表示“不同品牌/不同制剂的敌草快产品”或“多次/多种敌草快处理”。","敌草快属于“触杀型”（主要杀死接触到的绿色部分），通常不像某些“内吸传导型”除草剂那样在植物体内长距离运输；因此使用时覆盖是否均匀很重要。","它与“paraquat（百草枯）”名字相似，常被一起提到，但它们是不同化学品；两者都具有较高毒性，许多地区对其使用有严格限制。"]}
