{"word":"disease","summary":{"en":"Disease usually means a medical illness/condition; it can also be used metaphorically for a harmful social problem.","zh":"disease通常指“疾病/病症”；也可作比喻，指“会蔓延并造成危害的社会弊病”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An illness or medical condition that harms the body or mind and causes abnormal functioning.","zh":"疾病；病症：影响身体或心理健康、导致机能异常的病况。"},"examples":[{"en":"Heart disease is a leading cause of death in many countries.","zh":"心脏病是许多国家主要的死因之一。"},{"en":"She was diagnosed with a rare disease.","zh":"她被诊断出患有一种罕见疾病。"},{"en":"Regular exercise can lower the risk of disease.","zh":"规律运动可以降低患病风险。"}]},{"partOfSpeech":"n.","definition":{"en":"A serious problem in a group or society that spreads and causes harm (used metaphorically).","zh":"（比喻）社会弊病；恶习：在群体或社会中蔓延并造成危害的问题。"},"examples":[{"en":"Corruption is often described as a disease of the political system.","zh":"腐败常被形容为政治体制的“病”。"},{"en":"Misinformation can spread like a disease online.","zh":"错误信息在网上可能像疾病一样传播。"}]}],"synonyms":["illness","condition","ailment","sickness","disorder"],"phonetic":"/dɪˈziːz/","extraExplanation":["“Disease”常指相对明确的病因或病理过程（如感染、遗传、代谢异常等）。日常英语里也常见与“illness / sickness”对比：illness更强调个人的“生病状态/感受”，sickness更口语、更泛；而disease更偏医学、较正式。","常见搭配：infectious disease（传染病）、chronic disease（慢性病）、autoimmune disease（自身免疫性疾病）、prevent disease（预防疾病）、risk of disease（患病风险）。","文学与公共话语中，disease常被用作隐喻来批评社会问题（如“a disease of society”），表达“会扩散、难根除、造成系统性伤害”的感觉。使用时注意语境与敏感性，避免把某些群体或文化贴上“有病”的污名化标签。"]}
{"word":"diseased","summary":{"en":"“Diseased” means affected by illness, or (figuratively) morally/mentally unhealthy.","zh":"“diseased”指“患病的/病变的”，也可比喻“道德或心理上病态的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Affected by an illness or infection; not healthy.","zh":"患病的；带有疾病的；不健康的。"},"examples":[{"en":"The vet examined the diseased animal and gave it medicine.","zh":"兽医检查了那只患病的动物，并给它开了药。"},{"en":"Doctors warned that diseased lungs can make breathing difficult.","zh":"医生警告说，患病的肺部会让呼吸变得困难。"},{"en":"They removed the diseased tissue during surgery.","zh":"他们在手术中切除了病变组织。"}]},{"partOfSpeech":"adj.","definition":{"en":"Morally or mentally unhealthy; showing serious harmful problems in attitudes or behavior.","zh":"（道德或心理上）病态的；扭曲的；有严重不良倾向的。"},"examples":[{"en":"The film explores a diseased society where people accept violence as normal.","zh":"这部电影探讨了一个病态的社会：人们把暴力当成正常。"},{"en":"He had a diseased obsession with control.","zh":"他对控制有一种病态的迷恋。"}]}],"synonyms":["ill","sick","infected","unhealthy","afflicted","pathological"],"phonetic":"/dɪˈzizd/","extraExplanation":["“Diseased”常用于医学或正式语境，语气比“sick”更书面、也更强调“有病变/被疾病影响”。例如：diseased tissue（病变组织）、diseased organ（病变器官）。","在比喻用法里（如 diseased society/mind），含有强烈批评意味，指“系统性、深层次的腐坏或扭曲”，使用时注意语气可能较重。"]}
{"word":"diseasedly","summary":{"en":"“Diseasedly” means “in a diseased/unhealthy way,” either physically (showing illness) or figuratively (morbidly, in an unhealthy mental or moral way).","zh":"“diseasedly”意为“以患病/不健康的方式”，既可指身体上的病态，也可引申指心理或道德上的病态、阴暗或过度沉迷。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a diseased or unhealthy way; showing illness or abnormal health.","zh":"以患病的方式；呈现不健康或异常的状态。"},"examples":[{"en":"The leaves curled diseasedly, spotted with brown marks.","zh":"叶子病态地卷曲着，上面布满褐色斑点。"},{"en":"He spoke diseasedly, coughing between short sentences.","zh":"他说话带着病态的感觉，短句之间不停咳嗽。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a morally or mentally unhealthy way; morbidly or unhealthily obsessed.","zh":"以心理或道德上不健康的方式；病态地、过度沉迷地。"},"examples":[{"en":"She watched the rumor spread diseasedly through the group.","zh":"她看着谣言在群体中病态地蔓延开来。"},{"en":"He was diseasedly curious about other people’s pain.","zh":"他对他人的痛苦有一种病态的好奇。"}]}],"synonyms":["sickly","unhealthily","morbidly","pathologically"],"phonetic":"/dɪˈziːzɪdli/","extraExplanation":["“diseasedly”非常少见，听起来也比较生硬；日常英语里更常用“sickly”“unhealthily”“morbidly”，或直接说“in a diseased way / in an unhealthy way”。","它通常带有强烈的负面评价：不仅指身体生病，也常用来形容思想、情绪或社会现象“病态化”。"]}
{"word":"diseasedness","summary":{"en":"“Diseasedness” means the state of being diseased or unhealthy (literally or figuratively).","zh":"“diseasedness”指“患病/不健康的状态”，既可指身体疾病，也可比喻社会或心理的“病态”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state or quality of being diseased; illness or unhealthy condition (in the body, mind, or sometimes in society or morals).","zh":"患病的状态或性质；疾病或不健康的状况（可指身体、心理，有时也可引申到社会或道德层面的“病态”）。"},"examples":[{"en":"The report described the diseasedness of the lungs after years of heavy smoking.","zh":"报告描述了多年重度吸烟后肺部的病变程度。"},{"en":"In the novel, the city’s diseasedness is shown through corruption and poverty.","zh":"在小说中，这座城市的“病态”通过腐败与贫困呈现出来。"}]}],"synonyms":["illness","sickness","disease","morbidity","unhealthiness"],"phonetic":"/dɪˈzizd.nəs/","extraExplanation":["“diseasedness”是由形容词“diseased（患病的）”加名词后缀“-ness（……的状态/性质）”构成的抽象名词，意思直观，但在现代英语中很少用。更常见的表达是“disease”“illness”“sickness”或更学术的“morbidity”。","当它用于比喻义时，常带有文学/批评色彩，用来强调某种系统性、深层的“不健康”或“腐败”的气质（如社会、制度、道德或心理层面的“病态”）。"]}
{"word":"diseaseful","summary":{"en":"Diseaseful means “unhealthy/affected by disease” or “likely to cause disease,” but it’s rare in modern English.","zh":"Diseaseful 指“多病的/患病的”或“易致病的”，但在现代英语中较少使用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"full of disease; unhealthy; affected by illness (rare).","zh":"多病的；不健康的；患病的（较少用）。"},"examples":[{"en":"After years of poor nutrition, his body became weak and diseaseful.","zh":"多年营养不良之后，他的身体变得虚弱多病。"},{"en":"The report described diseaseful conditions in overcrowded housing.","zh":"报告描述了过度拥挤住房中不利健康、易生病的环境。"}]},{"partOfSpeech":"adj.","definition":{"en":"likely to cause disease; disease-causing; unhealthy (rare).","zh":"容易致病的；引发疾病的；不利健康的（较少用）。"},"examples":[{"en":"They worked in diseaseful air filled with smoke and dust.","zh":"他们在充满烟尘、可能致病的不良空气中工作。"},{"en":"In old writings, swamps were sometimes called diseaseful places.","zh":"在一些旧文本里，沼泽有时被称为“易致病之地”。"}]}],"synonyms":["diseased","unhealthy","sickly","ailing","disease-ridden","disease-prone","disease-causing"],"phonetic":"/dɪˈziːsfəl/","extraExplanation":["“diseaseful”比较少见，现代英语里更常用的说法是“diseased”（患病的）或“unhealthy / sickly”（不健康的、多病的），以及“disease-ridden / disease-prone”（疾病肆虐的/易患病的）或“disease-causing”（致病的）。","词形结构是 disease + -ful（“充满……的/具有……性质的”），因此可理解为“充满疾病的”或“带来疾病的”。在较老的描写性文字中偶尔出现，用来营造阴郁、恶劣的环境氛围。"]}
{"word":"diseasefulness","summary":{"en":"Diseasefulness means the quality of causing disease or being unhealthy/disease-prone.","zh":"Diseasefulness 指“致病性”或“易患病/不健康的状态”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of causing disease, or the state of being unhealthy or disease-prone; unhealthiness","zh":"致病性；不健康的状态；易患病（倾向）"},"examples":[{"en":"Early public health reports described the diseasefulness of crowded, poorly ventilated housing.","zh":"早期的公共卫生报告描述了拥挤、通风不良住房的“致病性”。"},{"en":"The doctor warned that long-term stress can increase the diseasefulness of a person’s lifestyle.","zh":"医生警告说，长期压力会增加一种生活方式的“易致病性/不健康程度”。"}]}],"synonyms":["unhealthiness","disease risk","pathogenicity","morbidity"],"phonetic":"/dɪˈziːzfʊlnəs/","extraExplanation":["“diseasefulness”在现代英语中非常少见，更常见的表达是“unhealthiness（不健康）”、“disease risk（患病风险）”、“pathogenicity（致病性，多用于微生物/病原体）”或“morbidity（发病率/患病率，偏统计/医学）”。","构词上是 disease + -ful + -ness：表示“充满疾病的/容易引发疾病的”这一性质；因此它既可指环境“容易致病”，也可指生活方式或身体状态“容易生病”。"]}
{"word":"diseases","summary":{"en":"“Diseases” means illnesses/medical conditions (plural of disease), and it can also be used figuratively for widespread social or systemic problems.","zh":"“Diseases”意为“疾病/病症”（disease的复数）；也可作比喻，指社会或系统中的顽疾与弊病。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Illnesses or medical conditions that affect the body or mind (plural of “disease”).","zh":"疾病；病症（“disease”的复数），指影响身心健康的病或病症。"},"examples":[{"en":"Many diseases can be prevented with vaccines and good hygiene.","zh":"许多疾病可以通过疫苗接种和良好卫生习惯来预防。"},{"en":"Doctors study how diseases spread in a community.","zh":"医生研究疾病如何在社区中传播。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) Harmful problems in a group, system, or society that spread or cause damage, like a disease.","zh":"（比喻）像疾病一样扩散或造成伤害的弊病；顽疾（指社会、组织或制度中的有害问题）。"},"examples":[{"en":"Corruption is a disease that can destroy public trust.","zh":"腐败是一种会摧毁公众信任的社会顽疾。"},{"en":"Some people call misinformation a disease of the internet age.","zh":"有人把错误信息称为互联网时代的“病”。"}]}],"synonyms":["illnesses","sicknesses","ailments","conditions","disorders"],"phonetic":"dɪˈziz","extraExplanation":["“diseases”是可数名词复数，通常用于谈“多种疾病”或“不同类别的疾病”。例如：infectious diseases（传染病）、chronic diseases（慢性病）、heart diseases（心脏病/心血管疾病，常用复数作类别名）。","常见搭配：prevent diseases（预防疾病）、treat diseases（治疗疾病）、spread of diseases（疾病传播）、risk of diseases（患病风险）。与illness相比，disease更偏“医学上明确的病理状态/诊断”，illness更偏“生病的状态/感受”。"]}
{"word":"diseasing","summary":{"en":"“Diseasing” is an uncommon form meaning “infecting” or “causing disease,” sometimes used in literary writing.","zh":"“Diseasing”不常用，意思是“感染/使患病”，有时见于较正式或文学语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Uncommon) Present participle of the verb “disease,” meaning causing illness in someone or something; infecting; making unhealthy.","zh":"（不常用）动词“disease”的现在分词，指使……患病；感染；使……变得不健康。"},"examples":[{"en":"Polluted water is diseasing local fish populations.","zh":"被污染的水正在使当地鱼群患病。"},{"en":"The fungus is diseasing the crops and reducing the harvest.","zh":"这种真菌正在感染庄稼，导致减产。"},{"en":"They studied how the virus was diseasing animals in the region.","zh":"他们研究这种病毒如何使该地区的动物患病。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare, literary) showing signs of disease; becoming sickly.","zh":"（罕见，文学用法）呈现病态的；逐渐变得虚弱多病的。"},"examples":[{"en":"In the novel, the diseasing city mirrors the hero’s despair.","zh":"在小说中，那座逐渐病态的城市映照出主人公的绝望。"},{"en":"The poet describes a diseasing landscape after the war.","zh":"诗人描写了战后逐渐凋敝、病态的景观。"}]}],"synonyms":["infecting","contaminating","sickening","afflicting","making ill"],"phonetic":"/dɪˈziːzɪŋ/","extraExplanation":["“diseasing”在现代英语里很少见。日常表达通常用更自然的说法：infecting（感染）、causing disease/illness（导致疾病）、making … sick（使……生病）。","注意不要和名词“disease（疾病）”混淆：disease作动词也存在，但偏正式/学术语境。"]}
{"word":"diseasy","summary":{"en":"“Diseasy” is a rare/old-fashioned adjective meaning ill or unhealthy. In modern English, use “sick,” “ill,” or “diseased.”","zh":"“Diseasy”是很少见/较古旧的形容词，意思是“生病的、不健康的”。现代英语更常用“sick / ill / diseased”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Ill or unhealthy; affected by disease. (Archaic or rare in modern English.)","zh":"生病的；不健康的。（古旧或现代英语中很少用）"},"examples":[{"en":"The old text described a “diseasy body,” meaning someone who was sick.","zh":"那本旧书里写到 “a diseasy body”，意思是“一个生病的身体/病人”。"},{"en":"In modern English, you would usually say “sick” or “ill,” not “diseasy.”","zh":"在现代英语里通常说 “sick” 或 “ill”，而不说 “diseasy”。"}]}],"synonyms":["sick","ill","unwell","diseased"],"phonetic":"/dɪˈziːzi/","extraExplanation":["“diseasy”多见于早期英语或文学文本里，结构上类似“disease + -y（带有……性质的）”。现代英语更常用“diseased（患病的）”“sick/ill（生病的）”。","注意别把“diseasy”当成“disease（疾病）”的拼写：日常写作与考试中，想表达“疾病”一般用名词“disease”。"]}
{"word":"disecondary","summary":{"en":"“disecondary” is not standard; you likely mean “secondary” (second, less important, or related to secondary school).","zh":"“disecondary”不是标准用词；你很可能想写“secondary”（第二的/次要的/与中学相关）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “secondary.”","zh":"不是标准英语单词。很可能是把“secondary”（次要的/第二的）拼错了。"},"examples":[{"en":"I couldn’t find “disecondary” in the dictionary—did you mean “secondary”?","zh":"我在词典里找不到“disecondary”——你是不是想写“secondary”？"}]},{"partOfSpeech":"adj.","definition":{"en":"(Likely intended word) “secondary”: less important than something else; second in order or rank.","zh":"（可能你想写的词）secondary：次要的；第二的；在顺序或等级上排第二的。"},"examples":[{"en":"Safety is our primary concern; cost is secondary.","zh":"安全是我们的首要考虑；成本是次要的。"},{"en":"She teaches at a secondary school.","zh":"她在一所中学任教。"},{"en":"The secondary color green is made by mixing blue and yellow.","zh":"绿色这种间色（次色）是由蓝色和黄色混合而成的。"}]}],"synonyms":["secondary","minor","less important","second"],"phonetic":"/ˈsɛkənˌdɛri/","extraExplanation":["“secondary”在英式英语里常用来指“中学”（secondary school）；在美式英语里更常说“middle school / high school”。","在学术写作里常见搭配：primary vs. secondary（主要的 vs. 次要的；一手资料 vs. 二手资料）。"]}
{"word":"diseconomy","summary":{"en":"Diseconomy means increasing costs or disadvantages that make production or activity less efficient, especially as scale grows.","zh":"Diseconomy 指成本上升或不利因素导致效率变差，尤其常用来描述规模扩大后反而更不划算的情况。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A situation where costs or inefficiencies increase, so producing more becomes less efficient (often used in economics).","zh":"（经济学）指成本或低效率上升，使得产量增加反而变得更不划算的情况（常用于分析成本与效率）。"},"examples":[{"en":"The company experienced diseconomies as it expanded too quickly and management became disorganized.","zh":"公司扩张过快，管理变得混乱，于是出现了“规模不经济”（diseconomies）。"},{"en":"Traffic congestion is a common diseconomy of urban growth.","zh":"交通拥堵是城市增长常见的一种“负面效率/成本上升”现象（diseconomy）。"}]},{"partOfSpeech":"n.","definition":{"en":"An economic disadvantage; a factor that raises costs or reduces efficiency.","zh":"经济上的不利因素；导致成本上升或效率下降的因素。"},"examples":[{"en":"Long shipping distances can be a diseconomy for small online sellers.","zh":"较长的运输距离对小型网店卖家来说可能是一种不利因素（diseconomy）。"},{"en":"High staff turnover became a diseconomy that hurt service quality.","zh":"员工流失率高成了不利因素（diseconomy），影响了服务质量。"}]}],"synonyms":["inefficiency","disadvantage","cost increase","diseconomies of scale"],"phonetic":"/ˌdɪsɪˈkɑnəmi/","extraExplanation":["“diseconomy”最常见出现在复数形式 **diseconomies**，尤其在短语 **diseconomies of scale（规模不经济）** 中。它与 **economies of scale（规模经济）** 相对：规模经济指产量越大单位成本越低；规模不经济则指扩大到一定程度后，沟通成本、管理层级、协调困难等使单位成本反而上升。","拼写提示：前缀 **dis-** 常表示“相反/否定”（如 dislike, dishonest），因此 diseconomy 可理解为“非经济/不划算”。"]}
{"word":"disedge","summary":{"en":"Disedge is a rare verb meaning to blunt something (remove its sharp edge) or, less commonly, to remove an edging/border.","zh":"Disedge 是一个罕见动词，常指“使变钝/去刃”，较少见地指“去掉包边或边缘装饰”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare/old-fashioned) To remove the sharp edge from something; to make it less sharp or less effective.","zh":"（罕见/旧式用法）使（某物）失去锋利的边；使变钝；（引申）削弱其效力。"},"examples":[{"en":"Years of use had disedged the knife, so it could barely cut bread.","zh":"多年使用把这把刀磨得不锋利了，连面包都很难切开。"},{"en":"Harsh criticism can disedge a young writer’s confidence.","zh":"尖刻的批评可能会削弱年轻作家的自信。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Very rare) To remove an edge or border from something; to strip the edging/trim.","zh":"（极罕见）去掉某物的边缘/包边；拆掉镶边或饰边。"},"examples":[{"en":"The tailor disedged the fabric to replace the worn trim.","zh":"裁缝把布料的包边拆掉，以便更换磨损的饰边。"}]}],"synonyms":["blunt","dull","deaden","remove the edge from","trim"],"phonetic":"/dɪsˈɛdʒ/","extraExplanation":["“disedge”不是现代英语里的常用词，很多词典可能不收录。它通常可理解为 dis-（去除、使失去）+ edge（边、刃），因此字面意思是“去掉边/刃”。","如果你原本想写的是 **disengage**（脱离、退出接触）或 **dislodge**（移开、弄松），告诉我你看到它的句子/上下文，我可以帮你确认正确拼写与意思。"]}
{"word":"disedification","summary":{"en":"Disedification means a negative influence that fails to educate or uplift, and may even make people worse.","zh":"Disedification 指不但不能启迪或教化，反而带来负面影响、让人变差的作用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or effect of making someone less improved, less moral, or less informed; the opposite of edification (moral or intellectual improvement)","zh":"使人缺乏提升（道德或知识上），或起反作用的影响；与“edification（教化、启迪）”相反"},"examples":[{"en":"The rumor campaign caused disedification, making people more cynical instead of better informed.","zh":"这场谣言攻势造成了反向影响，让人更愤世嫉俗，而不是更了解事实。"},{"en":"He worried that the show offered disedification rather than meaningful education.","zh":"他担心这档节目带来的是“反教育”，而不是有意义的启发。"}]}],"synonyms":["demoralization","corruption","degradation","a corrupting influence","not edifying"],"phonetic":"/ˌdɪsˌɛdɪfɪˈkeɪʃən/","extraExplanation":["“disedification”非常少见，更常见的说法是用否定表达：not edifying（不具启发性/不健康的）、morally harmful（有害道德的）、corrupting influence（腐蚀性的影响）。","词根提示：edify 原意是“建造”，引申为“建立/提升心灵与品格”；dis- 表示“相反、去除”，所以 disedification = “把人的品格/认知往下拉”。"]}
{"word":"disedify","summary":{"en":"Disedify is a rare verb meaning to corrupt or discourage someone’s moral/spiritual improvement—the opposite of edify.","zh":"disedify 是个罕见动词，指败坏或削弱人的道德/精神成长，与 edify 相反。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(rare) To harm someone’s moral or spiritual improvement; to discourage, corrupt, or lead someone away from better behavior (the opposite of edify).","zh":"（罕见）使人的道德/精神成长受损；使人失去向善的动力；带坏、败坏（与 edify“启发、陶冶”相反）。"},"examples":[{"en":"The speaker worried that rude jokes might disedify the younger students.","zh":"演讲者担心粗俗笑话会带坏年纪较小的学生。"},{"en":"Some parents avoid shows they think could disedify their children.","zh":"有些家长会避开他们认为可能会影响孩子向善的节目。"}]}],"synonyms":["corrupt","mislead","deprave","demoralize","undermine"],"phonetic":"/dɪsˈɛdɪˌfaɪ/","extraExplanation":["disedify 非常少见，多见于较旧或较宗教化的语境。日常英语里通常会用更常见的词来表达类似意思，比如 corrupt（腐化/带坏）、mislead（误导）、undermine someone’s values（削弱某人的价值观）、set a bad example（做坏榜样）。","词源上可以理解为 dis-（否定/反向）+ edify（启发、陶冶、使人向善）。edify 常用于“道德、精神层面”的提升。"]}
{"word":"diseducate","summary":{"en":"“Diseducate” means to teach in a harmful or misleading way, or to undo what someone has learned.","zh":"“diseducate”指以有害或误导的方式教育他人，或把某人已学到的东西“反向纠正/消除”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to teach someone in a wrong or harmful way; to miseducate.","zh":"对某人进行错误或有害的教育；误导式教育。"},"examples":[{"en":"Some propaganda is designed to diseducate citizens rather than inform them.","zh":"有些宣传的目的不是告知公民，而是对他们进行误导式教育。"},{"en":"If students only memorize answers, the system may diseducate them about how learning works.","zh":"如果学生只死记答案，这个体系可能会让他们对“学习如何发生”产生错误认识。"}]},{"partOfSpeech":"vt.","definition":{"en":"to remove or undo what someone has learned (often used humorously or critically).","zh":"消除或“逆转”某人已学到的东西（常带调侃或批评意味）。"},"examples":[{"en":"After months of misinformation, it took time to diseducate people and rebuild trust.","zh":"经历数月的不实信息后，花了一段时间才纠正人们被灌输的错误观念并重建信任。"},{"en":"The coach had to diseducate the team’s bad habits before teaching a new style.","zh":"教练得先纠正球队的坏习惯，才能教授新的打法。"}]}],"synonyms":["miseducate","mislead","indoctrinate","misinform","deprogram"],"phonetic":"/ˌdɪsˈɛdʒəˌkeɪt/","extraExplanation":["“diseducate”并不常见，更常用的词是“miseducate（误导教育）”或“uninform（让人不了解/误导）”。它常见于批评性语境（教育制度、媒体、宣传）中。","构词上由前缀 dis-（否定、反向）+ educate（教育）组成，语感上带有“把教育带偏/把学到的东西弄反”的意味，因此有时用于讽刺或强调。"]}
{"word":"disegno","summary":{"en":"Disegno is an Italian art term meaning drawing/draftsmanship and the planned design or concept behind an artwork.","zh":"Disegno 是意大利艺术术语，指素描/线描功底，也指作品背后的设计与构思理念。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Art history, Italian) Drawing or draftsmanship; also the underlying “design” or planned concept behind a work of art.","zh":"（艺术史，意大利语借词）素描/线描能力；也指艺术作品背后的“设计/构思”（创作的规划与理念）。"},"examples":[{"en":"In Renaissance theory, disegno mattered as much as color, because it showed an artist’s skill and thinking.","zh":"在文艺复兴艺术理论中，disegno 和色彩同样重要，因为它体现了艺术家的技法与思考。"},{"en":"Michelangelo’s disegno is praised for its powerful anatomy and clear structure.","zh":"米开朗琪罗的 disegno 常因强有力的人体结构与清晰的构图而受到称赞。"},{"en":"The teacher asked students to focus on disegno before painting with oils.","zh":"老师要求学生先练好 disegno，再开始油画上色。"}]}],"synonyms":["drawing","draftsmanship","design","plan","concept"],"phonetic":"/diˈzeɪnjoʊ/","extraExplanation":["disegno 在意大利文里本来就有“绘图/设计”的日常含义，但在艺术史语境中，它常被提升为一种理念：不仅是“画得像”的线条能力，也包含“在脑中先构思与组织形式”的理性规划。","文艺复兴时期有著名的观念对比：佛罗伦萨等地更强调 disegno（线条、结构、理性构思），而威尼斯画派常被认为更强调 colorito（色彩与光影的表现）。"]}
{"word":"diselder","summary":{"en":"“diselder” is a rare verb meaning “to disinherit.”","zh":"“diselder”是个少见动词，意思是“剥夺继承权（= disinherit）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to disinherit someone; to take away a person’s right to inherit property or a title (often used in legal or old-fashioned writing).","zh":"剥夺（某人）的继承权；取消（某人）继承财产或头衔的资格（多见于法律或较旧的用法）。"},"examples":[{"en":"He threatened to diselder his son if he married without the family’s approval.","zh":"他威胁说，如果儿子未经家族同意就结婚，就要剥夺他的继承权。"},{"en":"In the will, she chose not to diselder any of her children.","zh":"在遗嘱里，她选择不剥夺任何一个孩子的继承权。"}]}],"synonyms":["disinherit","disown (partly)","cut off (informal)"],"phonetic":"/dɪsˈɛldər/","extraExplanation":["“diselder”在现代英语中非常少见，更常用的词是“disinherit”。你可能会在旧小说、历史文本或法律语境中看到“diselder”。","词形上，“dis-”有“取消、否定”的意思，“elder”与“长子/长辈（传统继承人）”有关，因此这个词带有“把继承人的身份取消掉”的含义。"]}
{"word":"diselectrification","summary":{"en":"De-electrification means removing or reversing electrification—taking electric systems out of use.","zh":"De-electrification 指“去电气化”，即撤除或取消电气化，使其不再使用电力系统。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of removing electric power systems or electric equipment from something (for example, converting an electric railway line back to diesel trains).","zh":"去电气化；撤除供电/电气设备的过程（例如把电气化铁路改回柴油牵引）。"},"examples":[{"en":"The railway project included electrification in the 1990s and de-electrification after funding cuts.","zh":"这条铁路项目在20世纪90年代实现电气化，但在资金削减后又进行了去电气化。"},{"en":"Some factories consider de-electrification only when maintaining old electrical systems becomes too expensive.","zh":"一些工厂只有在维护老旧电气系统成本过高时才会考虑去电气化。"}]}],"synonyms":["removal of electrification","depowering (context-dependent)"],"phonetic":"/ˌdiˌɪˌlɛk.trə.fɪˈkeɪ.ʃən/","extraExplanation":["你输入的 **diselectrification** 不是常见或标准拼写。最接近、最常用的词是 **de-electrification**（也可写作 **deelectrification**），由前缀 **de-**（表示“去除、反向”）+ **electrification**（电气化）构成。","在交通领域尤其常见：指把电力牵引/接触网等电气化设施撤掉或停止使用；在更广义语境里，也可指取消某项电力化改造。"]}
{"word":"diselectrify","summary":{"en":"De-electrify means to remove electric power or stop using electricity (often for safety or changing systems).","zh":"De-electrify 指断电或停止使用电力（常用于安全操作或系统改造/取消电气化）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Usually written as) de-electrify: to remove electric power from something; to stop using electricity or electric traction.","zh":"（通常写作）de-electrify：给某物断电；停止使用电力（例如电气化铁路改为非电气化）。"},"examples":[{"en":"The technicians de-electrified the line before starting repairs.","zh":"技术人员在开始维修前先给线路断电。"},{"en":"Some older rail routes were de-electrified and switched back to diesel trains.","zh":"一些较老的铁路线路被取消电气化，改回柴油列车运行。"}]},{"partOfSpeech":"vt.","definition":{"en":"To discharge something by removing static electricity (less common).","zh":"给某物消除静电、放电（较不常见）。"},"examples":[{"en":"The operator de-electrified the plastic sheet to reduce dust attraction.","zh":"操作员对塑料片消除静电，以减少吸尘。"}]}],"synonyms":["disconnect the power","cut off power","deenergize","power down","switch off"],"phonetic":"/ˌdiː ɪˈlɛk trəˌfaɪ/","extraExplanation":["你输入的 **diselectrify** 很可能是拼写误差。最常见的标准写法是 **de-electrify**（也可写作 **deelectrify**）。其中前缀 **de-** 表示“去除、取消”，所以整体意思就是“去电/断电/取消电气化”。","在工程或安全语境里，de-electrify 常用于“先断电再施工”的步骤说明；在交通领域则常用于描述铁路“取消电气化”。"]}
{"word":"diselenid","summary":{"en":"A chemistry term meaning a compound containing two selenium atoms (or a related “diselenide” compound).","zh":"化学术语，指含有两个硒原子（或相关结构）的二硒化物/二硒化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) A compound or ion that contains two selenium atoms bonded together (Se–Se), or a salt/derivative of diselenide; often written as “diselenide” (e.g., MSe₂ or R–Se–Se–R).","zh":"（化学）含有两个硒原子相连（Se–Se）的化合物或离子；也可指二硒化物及其盐/衍生物，常写作 diselenide（如 MSe₂ 或 R–Se–Se–R）。"},"examples":[{"en":"Researchers studied molybdenum diselenide (MoSe₂) for its electronic properties.","zh":"研究人员研究了二硒化钼（MoSe₂）的电子性质。"},{"en":"In organic chemistry, an R–Se–Se–R compound is called an organodiselenide.","zh":"在有机化学中，R–Se–Se–R 这类化合物称为有机二硒化物。"}]}],"synonyms":["di-selenium compound","organodiselenide (specific type)"],"phonetic":"/daɪˈsɛləˌnaɪd/","extraExplanation":["你输入的 **diselenid** 在英语里不太常见；更标准的拼写通常是 **diselenide**（二硒化物）。如果你是在读材料科学论文，常见的是 **molybdenum diselenide (MoSe₂)**、**tungsten diselenide (WSe₂)** 这类“过渡金属二硒化物”。"]}
{"word":"diselenide","summary":{"en":"A diselenide is a compound containing an Se–Se bond (often R–Se–Se–R).","zh":"diselenide 指含有硒—硒（Se–Se）键的化合物（常见形式为 R–Se–Se–R）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound that contains a selenium–selenium (Se–Se) bond, often written as R–Se–Se–R (an organic diselenide) or as a metal diselenide in inorganic chemistry","zh":"含有硒—硒（Se–Se）键的化合物；常写作 R–Se–Se–R（有机二硒化物），在无机化学中也可指某些“金属二硒化物”"},"examples":[{"en":"Diphenyl diselenide is often used as a reagent in organic synthesis.","zh":"二苯基二硒化物常用作有机合成试剂。"},{"en":"The sample contained a diselenide group with an Se–Se bond.","zh":"该样品含有带 Se–Se 键的二硒化物基团。"}]}],"synonyms":["organic diselenide","diselenium compound"],"phonetic":"/daɪˈsɛləˌnaɪd/","extraExplanation":["“diselenide”由前缀 dis-（二、两个）+ selenide（硒化物）构成，核心信息是“含两个硒并形成 Se–Se 键”。在文献里有时会更具体写成“organic diselenide（有机二硒化物）”。","要注意与“selenide（硒化物，通常指 Se²⁻）”区分：diselenide 更强调 Se–Se 键（如 R–Se–Se–R），而不是单纯的硒化物阴离子。"]}
{"word":"disematism","summary":{"en":"“Disematism” is not recognized as a standard English word; it’s probably a misspelling of a different “-ism” term.","zh":"“disematism”不是标准英语词，通常被视为拼写错误，可能是另一个“-ism”词写错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or typing error (often for “disestablishmentarianism” or another “-ism” word).","zh":"不是标准英语单词。很可能是拼写/输入错误（常见误写为“disestablishmentarianism”等以“-ism”结尾的词）。"},"examples":[{"en":"I couldn’t find “disematism” in a dictionary—did you mean “disestablishmentarianism”?","zh":"我在词典里查不到“disematism”——你是不是想写“disestablishmentarianism”？"},{"en":"Please check the spelling of “disematism” in your essay.","zh":"请检查你文章里“disematism”的拼写。"}]}],"phonetic":"/dɪˈsiːməˌtɪzəm/","extraExplanation":["“disematism”在主流英语词典中通常查不到，因此更像是拼写错误或非常罕见的自造词。你可以告诉我你看到它的句子/上下文，我可以帮你判断最可能的正确词。","如果你想表达“政教分离/取消国教地位”相关的概念，最常见的词是 disestablishmentarianism（英国历史与政治语境中更常见）。"]}
{"word":"disembalm","summary":{"en":"Disembalm means to undo embalming—removing embalming materials from a body (rare).","zh":"disembalm 指“解除遗体防腐处理、去除防腐材料”（较少用）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to remove embalming materials from a dead body; to undo embalming (rare)","zh":"把（尸体）从防腐处理状态中“解除”；去除防腐材料（较少用）"},"examples":[{"en":"The family requested that the body be disembalmed before the traditional burial rites.","zh":"家属要求在传统安葬仪式前将遗体解除防腐处理。"},{"en":"In old records, some bodies were embalmed, moved, and later disembalmed for reburial.","zh":"在一些旧记录中，有的遗体先被防腐处理、转移，之后又为重新安葬而解除防腐处理。"}]}],"synonyms":["unembalm","remove embalming fluid","undo embalming"],"phonetic":"/ˌdɪsɛmˈbɑm/","extraExplanation":["“dis-”表示“去除、反向”，embalm 是“（给遗体）做防腐处理”。因此 disembalm 字面义就是“把防腐处理撤掉”。","这个词在现代英语里非常少见；更常见的表达是 use a longer phrase，比如 “remove the embalming fluid/materials” 或 “reverse/undo embalming”（视语境而定）。","语境上通常出现在殡葬、法医或历史文献中；日常对话几乎不会用到。"]}
{"word":"disembargo","summary":{"en":"Disembargo means to lift or remove an embargo so trade or movement can resume.","zh":"disembargo 指“解除禁运/封锁”，使贸易或运输恢复。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to remove an embargo; to allow trade or movement again after it was officially restricted","zh":"解除禁运；取消（对贸易或运输等的）官方限制"},"examples":[{"en":"The government voted to disembargo shipments of medicine.","zh":"政府投票决定解除对药品运输的禁运。"},{"en":"After months of negotiations, both sides agreed to disembargo the ports.","zh":"经过数月谈判，双方同意解除对港口的封锁与禁运。"}]}],"synonyms":["lift the embargo","end the embargo","remove the embargo","reopen (trade/ports)"],"phonetic":"/ˌdɪsɛmˈbɑrɡoʊ/","extraExplanation":["“disembargo”在现代英语中较少见，更常用的表达是“lift the embargo / end the embargo / remove the embargo”。","词形结构：dis-（表示“取消、去除”）+ embargo（禁运、封锁）。在正式或历史语境中可能出现，用来强调“把禁运状态取消”。"]}
{"word":"disembargoed","summary":{"en":"“Disembargoed” means an embargo has been lifted—information or goods are now allowed to be released or published.","zh":"“Disembargoed”表示禁运或发布禁令已解除——信息或商品现在可以公开发布或流通。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of disembargo) to lift or remove an embargo; to allow something (especially news or information) to be published or released after being restricted.","zh":"（disembargo 的过去式/过去分词）解除禁运/禁令；（尤指新闻、信息）解除发布禁令，允许公开或刊登。"},"examples":[{"en":"The report was disembargoed at noon, so journalists could finally publish their stories.","zh":"这份报告在中午解除发布禁令，因此记者终于可以发表报道了。"},{"en":"Once the sanctions were reviewed, several goods were disembargoed for export.","zh":"制裁经过审查后，一些商品被解除禁运，可以出口了。"}]},{"partOfSpeech":"adj.","definition":{"en":"no longer under an embargo; cleared for release or publication.","zh":"已解除禁令/禁运的；已获准发布或公开的。"},"examples":[{"en":"Please use only the disembargoed figures in your presentation.","zh":"请在演示中只使用已解除发布禁令的数据。"},{"en":"They shared a disembargoed version of the statement with the public.","zh":"他们向公众分享了已解禁的声明版本。"}]}],"synonyms":["lifted (the embargo)","released","unembargoed","cleared for release"],"phonetic":"/ˌdɪsɛmˈbɑrɡoʊd/","extraExplanation":["“embargo（禁运/发布禁令）”在新闻与公关领域很常见：机构会把资料提前发给媒体，但要求在某个时间点之前不得公开（under embargo）。到达指定时间后就“解除 embargo”，英语里常说 the embargo lifts，也会用 disembargo/disembargoed 来表达“解禁”。","这个词在日常口语中不算常见，更常见的说法是 lifted / released / no longer under embargo。"]}
{"word":"disembargoing","summary":{"en":"“Disembargoing” means lifting or removing an embargo (a formal ban on trade or transport).","zh":"“disembargoing”指解除禁运（取消对贸易或运输的正式限制）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Present participle/gerund of disembargo) removing an embargo; officially allowing trade or transport again after it has been blocked.","zh":"（disembargo 的现在分词/动名词）解除禁运；在被禁止后，正式恢复贸易或运输。"},"examples":[{"en":"The government is disembargoing certain medical supplies to ease the shortage.","zh":"政府正在解除对某些医疗物资的禁运，以缓解短缺。"},{"en":"News spread that the port was disembargoing shipments starting next week.","zh":"消息传出，港口将从下周起解除对货物运输的禁令。"}]}],"synonyms":["lifting an embargo","ending an embargo","removing the embargo","easing trade restrictions"],"phonetic":"/ˌdɪsɛmˈbɑrɡoʊɪŋ/","extraExplanation":["“disembargo”不是日常高频词，更常见的表达是 **lift an embargo**（解除禁运）、**end an embargo**（结束禁运）、**remove trade restrictions**（取消贸易限制）。","“embargo”多用于国际关系与贸易语境，指政府或国际组织对某国/地区的商品、武器或运输实施的正式限制；“disembargoing”强调“正在解除/逐步放开”的过程。"]}
{"word":"disembark","summary":{"en":"Disembark means to get off a ship or plane (or to remove people/things from it).","zh":"disembark 指从船或飞机等交通工具上下去（也可指让人下去或卸下货物）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to get off a ship, aircraft, or other vehicle after a journey; to go ashore","zh":"（从船、飞机等交通工具上）下船/下机/下车；上岸"},"examples":[{"en":"Passengers will disembark at Gate 12.","zh":"乘客将在12号登机口下机。"},{"en":"We disembarked at the small island just before sunset.","zh":"我们在日落前登上了那座小岛。"}]},{"partOfSpeech":"vt.","definition":{"en":"to remove people or things from a ship or aircraft","zh":"使（人员或货物）下船/下机；卸载"},"examples":[{"en":"The crew disembarked the injured passengers first.","zh":"机组人员先让受伤的乘客下机。"},{"en":"They disembarked supplies from the helicopter.","zh":"他们从直升机上卸下补给。"}]},{"partOfSpeech":"vi.","definition":{"en":"(of soldiers or an organized group) to leave a ship or aircraft to begin an operation","zh":"（尤指士兵或有组织的队伍）登陆；下机展开行动"},"examples":[{"en":"The troops disembarked at dawn.","zh":"部队在黎明时登陆。"},{"en":"After disembarking, they moved quickly toward the city.","zh":"登陆后，他们迅速向城市推进。"}]}],"synonyms":["get off","alight","debark","go ashore","deplane"],"phonetic":"/ˌdɪsɪmˈbɑrk/","extraExplanation":["“dis-”有“离开、去除”的意思，“embark”是“登船/登机、启程”。合在一起，disembark 就是“从交通工具上离开”。在旅行语境里很常见：embark（上船/登机）→ disembark（下船/下机）。","常见搭配：disembark from + 交通工具（disembark from the plane）；disembark at + 地点（disembark at the port）；disembark passengers/supplies（使乘客下机/卸货）。","在文学或正式新闻报道中，disembark 常用来营造“抵达新地点、开始新阶段”的画面感，比如探险者在陌生海岸“disembark”。"]}
{"word":"disembarkation","summary":{"en":"Disembarkation means the act or process of getting off a ship or aircraft, and it can also refer to a planned landing/unloading in military or emergency use.","zh":"disembarkation 指“下船/下机”等离开交通工具的过程；也可指军队或应急场景中的“登陆/卸载行动”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of getting off a ship, aircraft, or other vehicle; the process of leaving and going ashore or onto land","zh":"下船；下机；下车等的行为或过程；（从交通工具）离开并登岸/到达陆地"},"examples":[{"en":"Please remain seated until disembarkation begins.","zh":"请保持就座，直到开始下机/下船。"},{"en":"Disembarkation took longer because of the heavy rain.","zh":"由于大雨，下机/下船过程花了更长时间。"},{"en":"After disembarkation, passengers went through passport control.","zh":"下机后，乘客要通过护照检查。"}]},{"partOfSpeech":"n.","definition":{"en":"a planned landing of troops, supplies, or equipment from a ship or aircraft (often used in military or emergency contexts)","zh":"（尤指军队或应急场景中）部队、物资或装备的登陆/卸载行动"},"examples":[{"en":"The operation required a rapid disembarkation of the rescue team.","zh":"这次行动需要救援队快速登陆/下机展开。"},{"en":"The report described the disembarkation of vehicles at the port.","zh":"报告描述了车辆在港口的卸载/登陆。"}]}],"synonyms":["getting off","deplaning","debarkation","landing","unloading"],"phonetic":"/ˌdɪsˌɛmˌbɑrˈkeɪʃən/","extraExplanation":["词源上来自 dis-（表示“离开、去除”）+ embark（上船/上机；也可引申为“开始从事”）。因此 disembarkation 字面意思就是“从登乘状态离开”。","常见搭配：disembarkation gate（下机口/到达口）、disembarkation card（入境卡/下机卡，部分国家使用）、point of disembarkation（下船点/登陆点）。在日常英语中更口语的说法是 get off the plane/ship（下飞机/下船）。"]}
{"word":"disembarkations","summary":{"en":"“Disembarkations” means instances of getting off a ship/plane/vehicle; it can also mean military landings/unloading operations.","zh":"“disembarkations”指多次“下船/下机/下车”的情况；也可指（军事）登陆/卸载行动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of getting off a ship, plane, or other vehicle; the act of letting passengers or goods leave","zh":"下船/下机/下车；（乘客或货物）卸下、离开交通工具的行为"},"examples":[{"en":"Disembarkations from the ferry were delayed because of heavy rain.","zh":"由于大雨，渡轮乘客下船被延误了。"},{"en":"The crew managed disembarkations quickly to keep the schedule on time.","zh":"机组人员迅速组织乘客下机，以保证航班准点。"}]},{"partOfSpeech":"n.","definition":{"en":"the planned landing of troops or equipment from a ship or aircraft (military use)","zh":"（军用）部队或装备从舰船/飞机上登陆、卸载的行动"},"examples":[{"en":"The report described multiple disembarkations along the coast.","zh":"报告描述了沿海多次登陆行动。"},{"en":"Night disembarkations were chosen to reduce the risk of detection.","zh":"选择夜间登陆是为了降低被发现的风险。"}]}],"synonyms":["landings","unloading","debarkations"],"phonetic":"/ˌdɪsɛm.bɑrˈkeɪ.ʃənz/","extraExplanation":["“disembarkation”是名词，来自动词“disembark”（下船/下机/下车）。你输入的“disembarkations”是其复数形式，常见于公告、新闻或正式书面语（如交通、港口/机场管理、军事报道）。日常口语里更常说“getting off (the plane/ship)”或“passengers getting off”。","词形提示：embark = 上（船/机），dis- 表示“相反、去除”，所以 disembark = 下（船/机）。对应名词：embarkation（登船/登机/登车） vs. disembarkation（下船/下机/下车）。"]}
{"word":"disembarked","summary":{"en":"“Disembarked” means “got off a vehicle,” especially a ship or plane.","zh":"“disembarked”表示“下车/下船/下机”，尤指从船或飞机上下来。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"got off a ship, plane, train, bus, or other vehicle after a journey (past tense of “disembark”)","zh":"下（船/飞机/火车/公交等），下船/下机（“disembark”的过去式）"},"examples":[{"en":"The passengers disembarked at the next stop.","zh":"乘客在下一站下了车。"},{"en":"We disembarked from the plane and walked into the terminal.","zh":"我们下了飞机，走进航站楼。"}]},{"partOfSpeech":"v.","definition":{"en":"(especially of troops or groups) came ashore or got out of a vehicle in an organized way","zh":"（尤指部队或团体）登陆/上岸，成队下车/下机"},"examples":[{"en":"The soldiers disembarked quickly and formed a line.","zh":"士兵们迅速下船并列队。"}]}],"synonyms":["got off","got out","debarked","alighted"],"phonetic":"/ˌdɪsɪmˈbɑrkt/","extraExplanation":["“disembark”由前缀 dis-（表示“离开、去除”）+ embark（上船、登船）构成，常见于旅行、航运、航空与新闻报道语境中。","与“get off”相比，“disembark”更正式，常用于书面语或公告中（如机长广播、旅行报道）。"]}
{"word":"disembarking","summary":{"en":"Disembarking means getting off a vehicle (especially a plane or ship).","zh":"Disembarking 指从交通工具上下来（尤指飞机或船）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"getting off a ship, plane, bus, or train; leaving a vehicle after a journey","zh":"下（船/飞机/火车/公交等）；离开交通工具（通常指旅程结束或到站）"},"examples":[{"en":"Passengers began disembarking as soon as the plane reached the gate.","zh":"飞机一到登机口，乘客就开始下机。"},{"en":"We waited for everyone to finish disembarking before we picked up the luggage.","zh":"我们等所有人都下完后才去取行李。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of getting off a ship, plane, bus, or train (often used in formal writing)","zh":"下船/下机等的行为；离开交通工具（较正式用法）"},"examples":[{"en":"Disembarking will take about ten minutes.","zh":"下机大约需要十分钟。"},{"en":"Please remain seated during disembarking.","zh":"下机过程中请保持就座。"}]}],"synonyms":["getting off","leaving","alighting","deplaning"],"phonetic":"/ˌdɪsɪmˈbɑrkɪŋ/","extraExplanation":["“disembarking”来自动词“disembark”，词根“embark”与“board（登上）”意思相近；“dis-”表示“相反/去除”，所以整体就是“下（交通工具）”。","常见搭配：disembark from a plane/ship/train（从……下来）。在机场、港口广播或较正式的说明中更常见。日常口语也常用：get off / step off（下……）。"]}
{"word":"disembarkment","summary":{"en":"Disembarkment means the act of getting off a ship, plane, or other vehicle.","zh":"disembarkment 指从船、飞机或其他交通工具上下来（登陆/下船/下机）的行为或过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of leaving a ship, aircraft, or other vehicle; getting off after a journey","zh":"下船；下飞机；下车（等）的行为或过程；登陆"},"examples":[{"en":"Disembarkment will begin after the captain turns off the seatbelt sign.","zh":"机长关闭安全带指示灯后将开始下机。"},{"en":"The port was crowded during the disembarkment of the cruise passengers.","zh":"邮轮乘客下船时，码头非常拥挤。"},{"en":"Soldiers lined up for disembarkment at dawn.","zh":"士兵们在黎明时排队准备登陆。"}]}],"synonyms":["disembarkation","landing","debarkation","getting off"],"phonetic":"/ˌdɪsɪmˈbɑrkmənt/","extraExplanation":["“disembarkment”在现代英语中相对少见，更常见的说法是“disembarkation”（更正式）或直接用动词/短语“disembark / get off”。在航运、邮轮、军事“登陆/下船”语境中仍可能看到“disembarkment”。"]}
{"word":"disembarks","summary":{"en":"“Disembarks” means “gets off a vehicle (especially a ship or plane).”","zh":"“disembarks”表示“下（交通工具），尤指下船或下飞机”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to get off a ship, plane, train, bus, or other vehicle after a journey; to leave a vehicle and arrive on land or at a place","zh":"（旅程结束后）下船/下飞机/下车等；离开交通工具并到达陆地或某处"},"examples":[{"en":"The passengers disembark at the next stop.","zh":"乘客在下一站下车。"},{"en":"She disembarks from the plane and looks for her luggage.","zh":"她下了飞机，开始找行李。"},{"en":"The soldiers disembark quickly and move into position.","zh":"士兵迅速下船（或下车）并进入阵地。"}]}],"synonyms":["get off","exit","alight","debark"],"phonetic":"/ˌdɪsɪmˈbɑrk/","extraExplanation":["“disembark”比“get off”更正式，常见于新闻报道、旅行说明、军事或航海语境。日常口语更常说“get off the plane/bus/train”。","词源上，“embark”有“上船/登机/开始一段旅程”的意思；加上前缀“dis-”表示“相反/去除”，所以“disembark”就是“下船/下机”。"]}
{"word":"disembarrass","summary":{"en":"Disembarrass means to relieve someone’s embarrassment or help them out of an awkward situation.","zh":"Disembarrass 指让某人不再尴尬，或帮某人摆脱尴尬处境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to free someone from embarrassment; to help someone stop feeling embarrassed","zh":"使（某人）不再尴尬；帮（某人）解围"},"examples":[{"en":"She quickly changed the subject to disembarrass him.","zh":"她迅速换了个话题，帮他解围。"},{"en":"A simple apology can disembarrass everyone in the room.","zh":"一句简单的道歉就能让房间里的所有人不再尴尬。"}]}],"synonyms":["relieve","put at ease","reassure","save (someone) from embarrassment"],"phonetic":"/ˌdɪsɪmˈbærəs/","extraExplanation":["“disembarrass”在现代英语里比较少见、偏正式；日常更常用的表达有：“put someone at ease”（让某人放松/不尴尬）、“save someone from embarrassment”（帮某人避免尴尬）、“help someone out”（帮忙解围）。","结构上是 dis-（去除）+ embarrass（使尴尬），字面意思就是“去除尴尬”。"]}
{"word":"disembarrassed","summary":{"en":"Disembarrassed means no longer embarrassed or made free from embarrassment or difficulty.","zh":"disembarrassed 指“不再尴尬的”，也可指“使摆脱尴尬或困扰的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"No longer embarrassed; relieved and more at ease after an awkward feeling or situation has passed.","zh":"不再尴尬的；从尴尬中缓过来、变得更自在的。"},"examples":[{"en":"After she apologized, he looked disembarrassed and started talking normally again.","zh":"她道歉后，他看起来不再尴尬，又恢复正常聊天了。"},{"en":"I felt disembarrassed once I realized everyone had made the same mistake.","zh":"我发现大家都犯了同样的错误后，就不再尴尬了。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Past participle of disembarrass) Freed from embarrassment, confusion, or difficulty; made less awkward or easier to handle.","zh":"（disembarrass 的过去分词）使摆脱尴尬/困扰/麻烦；使情况不那么别扭、更好处理。"},"examples":[{"en":"The host disembarrassed the guest by changing the topic quickly.","zh":"主持人迅速换了话题，让客人摆脱了尴尬。"},{"en":"Clear instructions disembarrassed the team and helped them move forward.","zh":"清晰的说明让团队摆脱困惑，顺利推进。"}]}],"synonyms":["unembarrassed","relieved","at ease","composed"],"phonetic":"/ˌdɪsɪmˈbærəst/","extraExplanation":["“disembarrassed”在现代英语中不算常用；更口语、常见的说法通常是“not embarrassed”“no longer embarrassed”或“relieved”。","词形上，dis- 表示“去除/摆脱”，embarrass 表示“使尴尬/使窘迫”，合起来就是“摆脱尴尬”。在较正式或文学语境里更可能见到。"]}
{"word":"disembarrassment","summary":{"en":"Disembarrassment means relief from embarrassment, or (rarely) the act of removing awkwardness.","zh":"disembarrassment 指“解窘、摆脱尴尬的轻松感”，或（较少用）“消除尴尬/窘境的行为”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Relief from embarrassment; the state of no longer feeling awkward, ashamed, or self-conscious.","zh":"解窘；消除尴尬后的轻松感；不再觉得难为情、羞愧或不自在的状态。"},"examples":[{"en":"His quick apology brought a sense of disembarrassment to the whole table.","zh":"他迅速道歉让整桌人都松了一口气，尴尬感消失了。"},{"en":"She laughed at herself, and the moment of disembarrassment made everyone relax.","zh":"她自嘲地笑了笑，那一刻的解窘让大家都放松下来。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) The act of removing embarrassment or difficulty; making a situation less awkward or problematic.","zh":"（较少用）解除尴尬或困境的行为；使局面不再尴尬或更顺畅的做法。"},"examples":[{"en":"The host introduced a new topic for the disembarrassment of the guests.","zh":"主人换了个话题，好让客人们摆脱尴尬。"},{"en":"A simple joke can sometimes serve as disembarrassment in tense meetings.","zh":"一句简单的玩笑有时能在紧张的会议中起到缓解尴尬的作用。"}]}],"synonyms":["relief","ease","reassurance","composure","comfort"],"phonetic":"/ˌdɪsɪmˈbærəsmənt/","extraExplanation":["“disembarrassment”由前缀 dis-（表示“去除、解除”）+ embarrassment 组成，意思直观，但在现代英语里非常少见。日常更常用的表达是“relief (from embarrassment)”“put someone at ease”“save face”（更偏文化语境）等。"]}
{"word":"disembattle","summary":{"en":"Disembattle is an archaic verb meaning to break up or scatter troops drawn up for battle; rarely, it can mean to remove battlements from a fortification.","zh":"disembattle 是较古旧的动词，主要指使布阵的军队解阵、散开；少数情况下也可指拆除城墙的垛口。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Archaic) to break up an army’s battle formation; to scatter or disband troops that have been drawn up for battle.","zh":"（古义）使列阵的军队解阵；使队伍散开或解散。"},"examples":[{"en":"After the surprise attack, the commander ordered the troops to disembattle and fall back.","zh":"遭到突袭后，指挥官下令部队解阵后撤。"},{"en":"The sudden fog seemed to disembattle the lines, and units lost contact with one another.","zh":"突如其来的大雾仿佛让阵线解体，各分队彼此失联。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Rare, architecture/fortification) to remove battlements from a wall or fortress.","zh":"（罕见，建筑/防御工事）拆除城墙或堡垒上的垛口（雉堞）。"},"examples":[{"en":"The old fort was later disembattled during renovations to make the roofline safer.","zh":"这座旧堡垒后来在翻修时拆除了垛口，以让屋顶线更安全。"}]}],"synonyms":["scatter","disperse","break ranks","disband"],"phonetic":"ˌdɪsɪmˈbætəl","extraExplanation":["这是一个非常少见、偏文学/历史的词。它由 dis-（表示“去除、逆转”）+ embattle（使列阵、布阵）构成，所以核心意思就是“把已经布好的阵形打散”。现代英语更常用 break ranks / scatter / disperse / disband。","embattle 也有“在城墙上修垛口（battlements）”的意思，因此 disembattle 在少数语境下可表示“拆除垛口”。这类用法多见于描写城堡、要塞的历史性文本。"]}
{"word":"disembay","summary":{"en":"Disembay means to move or sail out of a bay into open water.","zh":"Disembay 指（船只等）从海湾驶出，进入外海。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to sail or move out of a bay into the open sea; to emerge from a bay","zh":"（船只等）驶出海湾进入外海；从海湾中出来"},"examples":[{"en":"At dawn, the fishing boats disembayed and headed toward deeper water.","zh":"拂晓时分，渔船驶出海湾，朝更深的海域开去。"},{"en":"After sheltering overnight, the ship disembayed when the wind eased.","zh":"在海湾里避风过夜后，风势减弱时船驶出了海湾。"}]}],"synonyms":["sail out","leave the bay","emerge from the bay"],"phonetic":"/ˌdɪsɪmˈbeɪ/","extraExplanation":["这个词比较少见，常见于航海、地理或较文学化的描写里。结构上可理解为 dis-（离开、向外）+ embay（围成海湾；使进入海湾），因此 disembay 就是“离开海湾/从海湾出来”。在现代英语里更常用的表达是 “leave the bay / sail out of the bay / emerge from the bay”。"]}
{"word":"disembed","summary":{"en":"Disembed means to remove or free something from where it is embedded (or to come free).","zh":"Disembed 指把某物从嵌入/埋入的地方取出或使其脱离（也可指自行脱离）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove something from what it is embedded in; to free or extract it from surrounding material, context, or structure","zh":"把……从嵌入/埋入的东西中取出；使……脱离周围材料、语境或结构"},"examples":[{"en":"The conservator carefully disembedded the coin from the hardened clay.","zh":"文物修复师小心地把硬化黏土里的硬币取了出来。"},{"en":"To reuse the chart, I disembedded the image from the PDF and saved it as a separate file.","zh":"为了重复使用这张图表，我把它从PDF里提取出来，另存为一个单独文件。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become free from being embedded; to come out from surrounding material or constraints","zh":"（自身）从嵌入状态脱离出来；从包围的材料或限制中出来"},"examples":[{"en":"As the ice melted, the small stone disembedded and fell to the ground.","zh":"冰融化时，小石子脱离出来，掉到了地上。"}]}],"synonyms":["extract","remove","free","unembed","detach"],"phonetic":"/ˌdɪsɪmˈbɛd/","extraExplanation":["“dis-”表示“去除/相反”，加上“embed（嵌入）”构成 disembed，字面意思就是“去嵌入”。这个词在现代英语中比较少见，更常见的表达是“remove/extract … from …”或“take … out of …”。","在计算机语境里，disembed 有时被用来指把“嵌入式对象”（如嵌在文档里的图片、视频、字体等）提取为独立文件。正式写作中也常用更明确的说法：extract, detach, unembed。"]}
{"word":"disembellish","summary":{"en":"Disembellish means to remove decorations or unnecessary added details to make something plain and clear.","zh":"Disembellish 指去除装饰或不必要的润色，使内容更朴素、清晰。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove decorations or added details; to strip something of embellishment and make it plain or simple","zh":"去除装饰；删去添饰的细节，使之更朴素/更简洁"},"examples":[{"en":"The editor disembellished the story to make the facts clearer.","zh":"编辑把故事里过度渲染的部分去掉，让事实更清楚。"},{"en":"She disembellished her speech, cutting jokes and dramatic lines.","zh":"她把演讲内容“去修饰化”，删掉了笑话和夸张的句子。"},{"en":"The designer disembellished the logo for a cleaner look.","zh":"设计师简化了标志，去掉装饰，让它更干净利落。"}]}],"synonyms":["simplify","strip","tone down","remove embellishments","de-ornament"],"phonetic":"/ˌdɪsɪmˈbɛlɪʃ/","extraExplanation":["“disembellish”由前缀 dis-（表示“去掉、取消”）+ embellish（装饰、润色）组成，字面意思就是“把装饰拿掉”。","该词在现代英语中不算常用，更常见的表达是 remove embellishments / strip away ornamentation / simplify / tone down（视语境选择）。"]}
{"word":"disembitter","summary":{"en":"Disembitter means to lessen or remove bitterness—especially resentment or hurt feelings (and more rarely, a bitter taste).","zh":"disembitter 指减轻或消除“苦涩”，多指怨恨与不满情绪（较少指去除苦味）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make someone less bitter or resentful; to relieve feelings of bitterness","zh":"使（某人）不再怨恨；缓和（某人）的苦涩与不满情绪"},"examples":[{"en":"Therapy helped him disembitter after years of disappointment.","zh":"经过多年失望之后，心理咨询帮助他逐渐释怀，不再怨恨。"},{"en":"A sincere apology can sometimes disembitter a tense relationship.","zh":"真诚的道歉有时能缓和紧张关系中的怨气。"}]},{"partOfSpeech":"vt.","definition":{"en":"to remove a bitter taste from something (rare in modern use)","zh":"去除（食物、饮品等）的苦味（现代用法较少）"},"examples":[{"en":"Some cooks try to disembitter the greens by blanching them.","zh":"有些厨师会先焯水，试图去除绿叶菜的苦味。"}]}],"synonyms":["appease","reconcile","mollify","soothe","pacify"],"phonetic":"ˌdɪsˈɛmbɪtɚ","extraExplanation":["“disembitter”由前缀 dis-（表示“去除、消除”）+ embitter（使变苦；使愤恨）构成，字面意思就是“把苦涩/怨气去掉”。在现代英语中更常见的表达是 ease resentment, make less bitter, reconcile, heal 等；“disembitter”偏书面、较少见。"]}
{"word":"disembocation","summary":{"en":"Disembarkation means the act or process of getting off a ship, plane, or other vehicle.","zh":"Disembarkation 指“下船/下机/下车”的行为或过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of getting off a ship, boat, aircraft, or other vehicle; the process of leaving it","zh":"下船/下机/下车；离开交通工具的行为或过程"},"examples":[{"en":"Disembarkation will begin after the plane parks at the gate.","zh":"飞机停靠登机口后将开始下机。"},{"en":"The soldiers prepared for disembarkation at dawn.","zh":"士兵们在黎明时分准备登陆/下船。"},{"en":"Please remain seated until disembarkation is announced.","zh":"请在宣布可以下机/下车前保持就座。"}]}],"synonyms":["departure","getting off","deplaning","debarkation"],"phonetic":"/ˌdɪsˌɛm.bɑrˈkeɪ.ʃən/","extraExplanation":["你输入的“disembocation”通常不是标准拼写。更常见、正确的词是“disembarkation”（名词），来自动词“disembark”（下船/下机/下车）。","在旅行场景里更口语的说法常用“get off”或“exit”（如：get off the plane / exit the bus）。在正式通知、军事或航运语境中更常见“disembarkation”。"]}
{"word":"disembodied","summary":{"en":"Disembodied means ‘without a physical body,’ often used for voices or spirits; it can also describe something emotionally detached or impersonal.","zh":"Disembodied 意为“无实体的、没有身体的”，常形容只有声音或灵体；也可引申为“情感疏离、缺乏人情味的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not having a physical body; existing as a voice, spirit, or presence without a visible form.","zh":"无实体的；没有身体的（如只有声音、灵魂或看不见的存在）。"},"examples":[{"en":"A disembodied voice came from the dark hallway.","zh":"一阵无实体的声音从黑暗的走廊传来。"},{"en":"In many ghost stories, the spirit is disembodied and cannot be seen.","zh":"在许多鬼故事里，幽灵是无实体的，无法被看见。"}]},{"partOfSpeech":"adj.","definition":{"en":"Seeming separated from real life or human feeling; detached and impersonal.","zh":"（情感或态度）脱离现实的；冷漠疏离、缺乏人情味的。"},"examples":[{"en":"His disembodied tone made the apology feel insincere.","zh":"他那种疏离冷漠的语气让道歉显得不真诚。"},{"en":"The report sounds disembodied, as if no one experienced the events firsthand.","zh":"这份报告听起来很“脱离人”，仿佛没有人亲身经历过这些事件。"}]}],"synonyms":["bodiless","incorporeal","unseen","detached","impersonal"],"phonetic":"/ˌdɪs.ɛmˈbɑ.di.d/","extraExplanation":["词源上可理解为 dis-（去除、分离）+ embodied（有身体的、具象化的）。因此 disembodied 常见于鬼故事、恐怖电影或文学里，强调“只有声音/意识，没有形体”。","常见搭配：disembodied voice（无实体的声音）、disembodied spirit（无形的灵魂）。在写作里，它能营造神秘或不安的氛围。"]}
{"word":"disembodies","summary":{"en":"“Disembodies” means separates something from a physical body or makes it feel bodiless; it can also mean making an idea overly abstract and removed from real life.","zh":"“Disembodies”表示使某物脱离肉体或呈现为无形无体；也可指把概念过度抽象化、脱离真实生活情境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"separates something (especially a spirit, mind, voice, or idea) from a physical body; makes it seem without a body","zh":"使（尤指灵魂、思想、声音或观念）脱离肉体；使其呈现为“无形无体”的状态"},"examples":[{"en":"In the story, the curse disembodies him, turning him into a wandering voice.","zh":"在故事里，诅咒使他脱离肉体，变成四处飘荡的声音。"},{"en":"The narrator disembodies her fear by describing it as a shadow in the room.","zh":"叙述者把恐惧写成房间里的影子，以此让恐惧“脱离实体”。"}]},{"partOfSpeech":"v.","definition":{"en":"presents an idea or quality in an abstract way, removed from real people, places, or physical details","zh":"把想法或特质以抽象方式呈现，使其脱离具体的人、地点或细节"},"examples":[{"en":"The advertisement disembodies happiness as a simple smile, ignoring the real problems behind it.","zh":"广告把幸福抽象成一个简单的笑容，忽略了背后的现实问题。"},{"en":"When the report disembodies the data, it becomes harder to understand the human impact.","zh":"当报告把数据抽象化、脱离现实后，就更难理解对人的影响。"}]}],"synonyms":["separate","detach","abstract","spiritualize","decontextualize"],"phonetic":"/ˌdɪsɪmˈbɑdiz/","extraExplanation":["“disembodies”是动词“disembody”的第三人称单数形式（he/she/it disembodies）。常见于文学、宗教或奇幻语境，描写“灵魂/声音脱离身体”，也可用于批评性写作，指把真实经验“去身体化、去情境化”而变得过于抽象。"]}
{"word":"disembodiment","summary":{"en":"Disembodiment means being without a physical body or being separated from the body, often in spiritual, philosophical, or literary contexts.","zh":"Disembodiment 指“无实体/脱离肉体”，常用于灵性、哲学或文学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of not having a physical body; being separated from a body (often used when talking about spirits, minds, or voices)","zh":"无实体；脱离肉体的状态（常用于谈论灵魂、意识或声音等）"},"examples":[{"en":"The story explores the disembodiment of the soul after death.","zh":"这个故事探讨了死亡后灵魂的无实体状态。"},{"en":"In the dark room, a disembodied voice seemed to come from nowhere.","zh":"在黑暗的房间里，一个无实体的声音仿佛从四面八方传来。"},{"en":"Some philosophers discuss disembodiment to ask whether the mind can exist without the body.","zh":"一些哲学家用“无实体”来讨论：心智能否脱离身体而存在。"}]}],"synonyms":["incorporeality","bodilessness","immateriality"],"phonetic":"/ˌdɪs.ɪmˈbɑ.di.mənt/","extraExplanation":["词根理解：dis-（否定/分离）+ embody（使具象、使体现）+ -ment（名词后缀）。因此 disembodiment 字面意思就是“脱离具体形体/不再具身”。","常见搭配与语域：多见于文学、哲学、宗教、心理学或科幻语境，例如 disembodiment of the soul（灵魂的脱离肉身）、disembodied voice（无实体的声音）。日常口语更常说 without a body / not physical。","相关词：disembodied（adj. 无实体的）；embodiment（n. 体现、化身；具身）；embody（v. 体现、代表）。在当代讨论中也常出现与“具身性/具身认知（embodiment/embodied cognition）”相对的概念。"]}
{"word":"disembodiments","summary":{"en":"“Disembodiments” means (1) bodiless existences or the state of being without a body, and (2) clear examples/embodiments of an idea or quality (often “a disembodiment of …”).","zh":"“disembodiments”可指（1）无实体的存在/脱离肉体的状态；也可指（2）某种观念或特质的典型体现（常用“a disembodiment of…”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being separated from a physical body (often used in spiritual, ghost, or sci‑fi contexts)","zh":"脱离肉体的状态；无实体的存在（常见于灵魂、鬼魂或科幻语境）"},"examples":[{"en":"The novel describes spirits as disembodiments that can move through walls.","zh":"这部小说把灵魂描写成能穿墙而过的“无实体存在”。"},{"en":"Some legends speak of disembodiments wandering at night.","zh":"一些传说说夜里会有“无形之体”在游荡。"}]},{"partOfSpeech":"n.","definition":{"en":"something that shows an idea or quality in a pure or extreme way (often: “a disembodiment of …”)","zh":"（某种观念或特质的）化身；最典型、最极端的体现（常用：a disembodiment of…）"},"examples":[{"en":"To her students, he was a disembodiment of patience.","zh":"在学生眼里，他是“耐心”的化身。"},{"en":"The empty, automated response felt like a disembodiment of bureaucracy.","zh":"那种空洞又自动化的回复让人觉得是“官僚作风”的体现。"}]}],"synonyms":["bodiless spirits","incorporeal beings","apparitions","manifestations","personifications"],"phonetic":"ˌdɪsɪmˈbɑdimənts","extraExplanation":["“disembodiments”是复数形式，单数是“disembodiment”。常见搭配是“a disembodiment of + 抽象名词”（如 kindness, fear, evil）。","词源和构词：dis-（分离/否定）+ embody（使具体化/使具象）+ -ment（名词后缀，表示结果/状态）。因此整体含义可以理解为“去掉具象/去掉身体后的状态或结果”。"]}
{"word":"disembody","summary":{"en":"Disembody means to separate something (especially a spirit or voice) from a physical body, often in literary or supernatural contexts.","zh":"Disembody 指使某物（尤指灵魂或声音）脱离肉体、失去实体，常用于文学或超自然语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to separate a spirit, voice, or mind from a physical body; to remove the body from something (often used in formal or literary contexts)","zh":"使（灵魂、声音或意识）脱离肉体；使某物失去身体/实体（常见于正式或文学语境）"},"examples":[{"en":"The ghost story describes a voice disembodied from any human form.","zh":"这篇鬼故事描写了一个不属于任何人体形态的“无实体的声音”。"},{"en":"In the dream, he felt disembodied, as if he were floating above himself.","zh":"在梦里，他感觉自己脱离了身体，仿佛漂浮在自己上方。"},{"en":"The film uses disembodied narration to create an eerie mood.","zh":"这部电影用“无实体的旁白/画外音”营造诡异气氛。"}]},{"partOfSpeech":"vt.","definition":{"en":"to remove a body part from a body; to dismember (rare and often extreme)","zh":"使肢解；从身体上移除某部分（较少用，语气较强烈）"},"examples":[{"en":"The article avoided graphic language and did not describe the victim as disembodied.","zh":"这篇报道避免使用血腥措辞，没有把受害者描述成被肢解的状态。"}]}],"synonyms":["separate","detach","decorporealize","dismember (in the physical sense)"],"phonetic":"/ˌdɪs.ɪmˈbɑː.di/","extraExplanation":["词源上可拆解为 dis-（分离、去除）+ embody（使具体化/使具象化）。因此 disembody 的核心感觉是“把原本有身体、可触摸的东西变得没有实体”。","在文学与影视里，disembodied voice 常用来指“画外音/无来源的声音”，用来制造神秘、超自然或疏离感。日常口语中更常说 a voice with no source / a voice coming from nowhere。"]}
{"word":"disembodying","summary":{"en":"Disembodying means separating something (especially a voice, mind, or spirit) from a body, or making it feel abstract and not physically present.","zh":"disembodying 指把（尤其是声音、意识或灵魂）与身体分离，或让它显得抽象、缺乏真实的身体存在感。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(present participle of disembody) separating a spirit, mind, or voice from a physical body; making something seem without a body.","zh":"（disembody 的现在分词）使灵魂、意识或声音脱离肉体；使某物显得“无实体、无躯体”"},"examples":[{"en":"The story keeps disembodying the narrator’s voice, so it feels like it comes from nowhere.","zh":"这个故事不断把叙述者的声音“去身体化”，让人觉得它像是从无处传来。"},{"en":"In horror films, a director might use shadows and sound to create the effect of disembodying a character.","zh":"在恐怖片里，导演可能用影子和音效来制造角色被“去身体化”的效果。"}]},{"partOfSpeech":"vt.","definition":{"en":"making an idea or experience feel less personal or less physical; presenting it as abstract.","zh":"使某种想法或体验变得不那么私人或不那么具象；以更抽象的方式呈现"},"examples":[{"en":"The formal language is disembodying the pain, turning a real experience into something distant.","zh":"正式的措辞让痛苦被“抽离身体感”，把真实体验变得疏离。"},{"en":"Numbers can be useful, but they can also be disembodying when they hide the people behind them.","zh":"数据很有用，但当它遮蔽了背后的人时，也可能产生“去人化/去身体感”的效果。"}]}],"synonyms":["separating","detaching","abstracting","depersonalizing","disincarnating"],"phonetic":"/ˌdɪsɛmˈbɑdiɪŋ/","extraExplanation":["“disembodying”是动词 disembody 的 -ing 形式，可作现在分词（The film is disembodying…）或动名词（Disembodying the voice makes it creepier.）。","常见搭配：a disembodied voice（无实体的声音）在影视、广播、游戏里很常见，用来营造“声音来源不明”的氛围。","语感上它常带有文学或影像叙事色彩：不是日常口语里最常用的词，更常见于评论、分析或描述效果。"]}
{"word":"disembogue","summary":{"en":"Disembogue is a literary/old-fashioned verb meaning “to flow or pour out,” especially of a river emptying into a larger body of water.","zh":"Disembogue 是一个偏文学、较古旧的动词，意为“流出、倾泻而出”，尤指河流“注入/汇入”更大的水域。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(of a river or stream) to flow out into a larger body of water; to empty out.","zh":"（指河流或溪流）流出并汇入更大的水域；注入，流入。"},"examples":[{"en":"The river disembogues into the sea at the edge of the old town.","zh":"这条河在老城边缘注入大海。"},{"en":"Several small streams disembogue into the main channel after heavy rain.","zh":"大雨过后，几条小溪汇入主河道。"}]},{"partOfSpeech":"vt.","definition":{"en":"to pour or send (people, things, or a flow) out from a confined place into an open area.","zh":"（把人、物或流动的东西）从狭窄处涌出到开阔处；倾泻而出。"},"examples":[{"en":"After the concert, the crowd disembogued from the stadium into the streets.","zh":"演唱会结束后，人群从体育场涌到街上。"},{"en":"The tunnel disembogues traffic onto a wide boulevard.","zh":"这条隧道把车流导向一条宽阔的大道。"}]}],"synonyms":["empty (into)","flow into","pour out","debouch","discharge (into)"],"phonetic":"/ˌdɪsɪmˈboʊɡ/","extraExplanation":["“disembogue”较为古旧、文学性强，现代英语里更常用“empty into”“flow into”“debouch (into)”来表达“汇入/流入”。","词源来自法语（disemboucher），原意与“mouth（河口/出口）”相关：从“口/出口”处流出或涌出。","常见搭配：disembogue into + sea/lake/river/channel（汇入……）；也可比喻人群、车流“涌出”。"]}
{"word":"disembogued","summary":{"en":"“Disembogued” means “flowed out and emptied into a larger body of water,” and it can also mean “poured out/emerged” in a figurative sense.","zh":"“disembogued”意为“（水流）流出并汇入更大的水域”，也可引申为“涌出/出现”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"past tense/past participle of “disembogue”: (of a river, stream, or water) to flow out and empty into a larger body of water (like a sea, lake, or another river).","zh":"“disembogue”的过去式/过去分词： （指河流、溪流或水流）流出并汇入更大的水域（如大海、湖泊或另一条河）。"},"examples":[{"en":"The river disembogued into the sea just beyond the old lighthouse.","zh":"那条河在老灯塔不远处汇入大海。"},{"en":"After weeks of winding through the valley, the stream finally disembogued into the lake.","zh":"那条溪流在山谷中蜿蜒数周后，终于汇入湖中。"}]},{"partOfSpeech":"vi.","definition":{"en":"(figurative, less common) to pour out, emerge, or come out from a narrow place into a wider open area.","zh":"（引申义，较少见）涌出、出现；从狭窄处进入更开阔的地方。"},"examples":[{"en":"The crowd disembogued from the stadium gates into the streets.","zh":"人群从体育场大门涌出，进入街道。"}]}],"synonyms":["emptied into","flowed into","debouched","poured out","emerged"],"phonetic":"/ˌdɪsɪmˈboʊɡd/","extraExplanation":["“disembogue”较为罕见、偏文学或旧式用词；日常英语里更常用 empty into / flow into / flow out into 来表达“汇入”。","词源与西班牙语 desembocar（“（河流）入海/汇入；从口部出来”）有关，因此常用于描写河口、水流出口等地理语境。"]}
{"word":"disemboguement","summary":{"en":"Disemboguement means a river mouth/outlet, or the act of flowing out; it can also mean a figurative “way out.”","zh":"Disemboguement 指河口/出水口或注入流出的过程，也可引申为“出路/宣泄口”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The place where a river or stream flows out into a larger body of water (such as the sea or a lake); a river mouth or outlet.","zh":"（河流、溪流）注入更大水体（如海、湖）的地方；河口；出水口。"},"examples":[{"en":"The fishermen waited near the river’s disemboguement, where fresh water met the sea.","zh":"渔民在河流的入海口附近等候，那里淡水与海水交汇。"},{"en":"Pollution collected around the disemboguement after heavy rain washed debris downstream.","zh":"大雨把杂物冲到下游后，污染物在河口附近堆积起来。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or process of flowing out or emptying (especially of a river).","zh":"（尤指河流）流出、汇入、注入的过程或动作。"},"examples":[{"en":"The disemboguement of the river into the bay creates rich wetlands.","zh":"这条河注入海湾的过程形成了富饶的湿地。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) A way out; an outlet or release from pressure or difficulty.","zh":"（引申）出路；宣泄口；摆脱压力或困境的途径。"},"examples":[{"en":"Writing became her disemboguement for stress during a tough semester.","zh":"在艰难的学期里，写作成了她缓解压力的出口。"}]}],"synonyms":["river mouth","outlet","mouth (of a river)","estuary (related)","exit (figurative)"],"phonetic":"/ˌdɪsɪmˈboʊɡmənt/","extraExplanation":["这个词较少见，常见于地理/文学语境。更常用的说法是 river mouth（河口）或 outlet（出口）。","词源上与法语词根有关（与“mouth/出口”的概念相连），所以常带有“流出到更大空间”的意象。","拼写上也可见 disembogement（少见变体）。你输入的 disemboguement 属于同一词的常见误拼或变体写法。"]}
{"word":"disemboguing","summary":{"en":"Disemboguing means flowing out into a larger body of water, or (more generally) pouring out from a narrow place into an open area.","zh":"Disemboguing 指（河流）汇入更大的水域，也可泛指（人或物）从狭窄处涌向开阔处。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(of a river or stream) flowing out into a larger body of water, such as the sea, a lake, or a larger river; emptying out.","zh":"（指河流或溪流）流入更大的水域（如海、湖或大河）；注入、汇入。"},"examples":[{"en":"The river is disemboguing into the Atlantic near the town.","zh":"这条河在小镇附近注入大西洋。"},{"en":"After weeks of rain, muddy water was disemboguing into the lake.","zh":"连续几周下雨后，浑浊的河水正汇入湖中。"}]},{"partOfSpeech":"vi.","definition":{"en":"(of people or things) coming out from a narrow or crowded place into a more open area; pouring out.","zh":"（指人或物）从狭窄、拥挤的地方涌出到更开阔的地方；涌出、蜂拥而出。"},"examples":[{"en":"Commuters were disemboguing from the station onto the street.","zh":"通勤的人群正从车站涌到街上。"},{"en":"A crowd began disemboguing from the theater at the end of the show.","zh":"演出结束时，人群开始从剧院涌出。"}]}],"synonyms":["emptying (into)","flowing (into)","pouring (into/out)","issuing","emerging"],"phonetic":"/ˌdɪs.ɪmˈboʊ.ɡɪŋ/","extraExplanation":["“disemboguing”是动词“disembogue”的现在分词形式，较为罕见，多见于书面语或描写性文字，尤其用于地理/水文语境。","词源与西班牙语/葡萄牙语的“desembocar”（在河口处流出、注入）有关，因此常用来形象描写河水“从河口涌出”进入大水域。写作中可与“empty into / flow into”互换，但“disembogue”更文学、更画面感。"]}
{"word":"disembosom","summary":{"en":"Disembosom is an archaic verb meaning to reveal or confess what you’ve kept in your heart; literary use may also mean to take something out from the bosom.","zh":"disembosom 是一个较古老的动词，主要指吐露心事、坦白；在文学中也可指从怀中取出某物。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Archaic) to reveal or confess something that was kept in one’s heart; to open up and share secrets or feelings.","zh":"（古义/文学用语）吐露心事；坦白；把藏在心里的话说出来。"},"examples":[{"en":"At last, he disembosomed his fears to his closest friend.","zh":"最终，他把自己的恐惧向最亲密的朋友吐露了出来。"},{"en":"She disembosomed the truth after years of silence.","zh":"沉默多年后，她终于坦白了真相。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Less common, literary) to remove something from the bosom or breast (for example, a hidden letter).","zh":"（较少见/文学）从胸前或怀中取出（如藏着的信件）。"},"examples":[{"en":"He disembosomed a folded note from inside his coat.","zh":"他从外套里面掏出一张折好的纸条。"}]}],"synonyms":["confess","open up","reveal","disclose","unburden"],"phonetic":"/ˌdɪsɪmˈbʊzəm/","extraExplanation":["这是一个偏古老、偏文学的词，在现代英语中很少日常使用。更常见的表达是：confess（坦白）、open up（敞开心扉）、reveal（揭露）、disclose（披露）、unburden oneself（卸下心里负担）。","词根来自 bosom（胸怀/怀抱），含义带有“把心里/怀里的东西拿出来”的意象，所以常用于描写人物终于倾诉、吐露秘密或情感。"]}
{"word":"disembowel","summary":{"en":"Disembowel means to remove the internal organs of a body (to gut), and it can also be used figuratively to mean destroying the inside or essential parts of something.","zh":"disembowel 指“取出内脏/开膛破肚（去内脏）”，也可作比喻，表示“掏空或摧毁某事物的核心部分”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove the internal organs (especially the intestines) from a person or animal; to gut","zh":"取出（人或动物的）内脏（尤指肠子）；开膛破肚；掏空"},"examples":[{"en":"The fish were cleaned and disemboweled before cooking.","zh":"鱼在烹饪前被清理并取出了内脏。"},{"en":"The hunter disemboweled the deer in the field.","zh":"猎人在野外给鹿开膛取脏。"}]},{"partOfSpeech":"vt.","definition":{"en":"to destroy the inside of something; to remove its essential or most important parts (often used figuratively)","zh":"（比喻）掏空……的核心；破坏内部结构；削弱要害"},"examples":[{"en":"Budget cuts disemboweled the program, leaving only a small staff.","zh":"预算削减把这个项目的核心掏空了，只剩下很少的员工。"},{"en":"Critics argued the new rules would disembowel the law’s protections.","zh":"批评者认为新规定会削弱该法律的保护力度。"}]}],"synonyms":["gut","eviscerate","dismember (not the same; means cut into pieces)","cripple (figurative)","hollow out (figurative)"],"phonetic":"/ˌdɪs.ɪmˈbaʊ.əl/","extraExplanation":["这个词语体感很强、偏暴力与血腥，常见于历史描写、恐怖/犯罪文学、新闻报道（多为引用或描述极端事件）中；日常交流中更常用较中性的说法，如 gut（给鱼/动物去内脏）、eviscerate（更正式，既可字面也常比喻“严厉摧毁/猛烈批评”）。","词源可拆解理解：dis-（去除）+ embowel（放入内脏/肠子相关），因此字面意思就是“把内脏拿出来”。"]}
{"word":"disemboweled","summary":{"en":"Disemboweled means having the internal organs removed (literally) or being stripped of its essential parts (figuratively).","zh":"disemboweled 指（字面）被开膛取出内脏，或（比喻）被掏空关键部分。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Usually in passive form) Having the internal organs removed; gutted.","zh":"（多用于被动）被开膛破肚的；内脏被取出的。"},"examples":[{"en":"The fish was disemboweled and cleaned before cooking.","zh":"鱼在烹饪前被开膛取出内脏并清理干净。"},{"en":"The horror novel described a disemboweled body in graphic detail.","zh":"那本恐怖小说用露骨的细节描写了一具被开膛破肚的尸体。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of disembowel: to remove the internal organs of (a person or animal), or to cut open the belly.","zh":"disembowel 的过去式/过去分词：给（人或动物）开膛，取出内脏；剖开腹部。"},"examples":[{"en":"In old accounts of war, enemies were sometimes disemboweled as a brutal warning.","zh":"在一些古代战争记载中，敌人有时会被开膛以示残酷的警告。"},{"en":"The chef disemboweled the rabbit quickly and safely.","zh":"厨师迅速而安全地给兔子开膛取内脏。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Figurative) Completely strip out the most important or useful parts of something; hollow out.","zh":"（比喻）把某事物最重要/最有用的部分掏空；使空洞化。"},"examples":[{"en":"Critics said the budget cuts disemboweled the public library system.","zh":"批评者说预算削减把公共图书馆系统掏空了。"},{"en":"The new rules disemboweled the policy and left it ineffective.","zh":"新规定把这项政策掏空了，使其失去效力。"}]}],"synonyms":["gutted","eviscerated","hollowed out","stripped","disembowelled"],"phonetic":"/ˌdɪs.ɪmˈbaʊ.əld/","extraExplanation":["这个词语气非常强烈、画面感很重，常见于恐怖、战争或法医语境；日常表达一般会用更中性的说法，如 remove the organs / gut / clean (a fish)。","构词上：dis-（去除、剥离）+ embowel（把东西放入腹中/内脏相关）。因此 disembowel 字面意思就是“把内脏取出来”。","比喻用法常见于新闻评论或批评文章，强调“把核心掏空”，语气通常带负面评价。"]}
{"word":"disemboweling","summary":{"en":"Disemboweling means removing the intestines/internal organs, or (figuratively) gutting something by taking out its core.","zh":"disemboweling 指“开膛取内脏”，也可比喻为“掏空/抽走核心”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"present participle of disembowel: removing the internal organs (especially the intestines) from a person or animal; disemboweling.","zh":"disembowel 的现在分词：把人或动物的内脏（尤指肠子）取出；开膛破肚。"},"examples":[{"en":"The hunter began disemboweling the deer to prepare it for transport.","zh":"猎人开始给鹿开膛取内脏，好方便搬运。"},{"en":"The movie was criticized for showing disemboweling in graphic detail.","zh":"这部电影因用露骨的细节展示开膛破肚而受到批评。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative) removing the most important inner part of something; gutting or stripping it of its core.","zh":"（比喻）掏空某物最重要的内部部分；“挖空”“抽走核心内容”。"},"examples":[{"en":"Critics said the new policy was disemboweling the program by cutting its funding.","zh":"批评者说，新政策通过削减经费把这个项目“掏空”了。"},{"en":"The editor warned that disemboweling the chapter would ruin the author’s argument.","zh":"编辑警告说，把这一章大幅删改（“挖空”）会毁掉作者的论证。"}]}],"synonyms":["eviscerating","gutting","dismembering (not the same, but related in violent contexts)","stripping (figurative)"],"phonetic":"/ˌdɪs.ɪmˈbaʊ.əl.ɪŋ/","extraExplanation":["这个词带有强烈的暴力与血腥色彩，日常交流中较少使用；在新闻、历史、电影评论中更常见。","比喻用法常出现在政治、商业、文学评论里，意思接近“掏空/削弱核心”，语气通常很强烈。"]}
{"word":"disembowelled","summary":{"en":"“Disembowelled” means “having been cut open and had the intestines removed,” and it can also be used figuratively to mean “gutted/stripped of its essential inner parts.”","zh":"“disembowelled”指“被开膛破肚、内脏被取出”，也可作比喻指“被掏空/被剥离核心内容”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past participle of “disembowel”) to remove a person’s or animal’s intestines; to cut open the belly and take out the internal organs (very violent).","zh":"（disembowel 的过去分词）把人或动物开膛破肚，取出肠子/内脏（非常暴力）。"},"examples":[{"en":"The detective found a disembowelled animal near the campsite.","zh":"侦探在营地附近发现了一只被开膛破肚的动物。"},{"en":"In the novel, the warrior was disembowelled in battle.","zh":"在小说里，那位战士在战斗中被开膛破肚。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative) to remove the most important inner parts of something; to gut or strip something of what makes it work.","zh":"（比喻）掏空某物最关键的“内部”；把核心内容拆掉，使其失去作用。"},"examples":[{"en":"Critics said the new rules disembowelled the original plan.","zh":"批评者说新规定把原计划的核心掏空了。"},{"en":"Budget cuts disembowelled the program and it could no longer function well.","zh":"预算削减把该项目“掏空”了，它再也无法良好运作。"}]}],"synonyms":["eviscerated","gutted","disemboweled","ripped open","stripped"],"phonetic":"/ˌdɪs.ɪmˈbaʊəld/","extraExplanation":["拼写差异：美式英语更常见 disemboweled（单写 l），英式英语更常见 disembowelled（双写 l）。含义相同。","语体提醒：这个词语气非常强烈，常见于文学、历史或犯罪报道；日常表达“严重削弱/掏空”可用 weaken, gut, strip 等更中性的词。"]}
{"word":"disembowelling","summary":{"en":"Disembowelling means removing internal organs (literally), or (figuratively) tearing something open and taking out what’s inside.","zh":"disembowelling 指“掏出内脏/开膛取脏”（字面义），也可比喻“把……彻底拆穿、剖析到核心”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of removing a body’s internal organs (especially the intestines); evisceration","zh":"（尤指取出肠子等）掏出内脏；剖腹取脏；开膛"},"examples":[{"en":"The novel includes a scene of disembowelling that some readers may find disturbing.","zh":"这部小说里有一段开膛取脏的描写，一些读者可能会觉得不适。"},{"en":"In the horror film, the villain threatens disembowelling to terrify the victims.","zh":"在那部恐怖片里，反派用“开膛”来威胁受害者以制造恐惧。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of disembowel: removing internal organs; (figurative) ripping something open and taking out what is inside","zh":"disembowel 的现在分词：掏出内脏；（比喻）把……撕开并取出里面的东西/内容"},"examples":[{"en":"The hunter was disembowelling the fish by the river.","zh":"猎人正在河边剖开鱼肚取出内脏。"},{"en":"The report described the prosecutor as disembowelling the witness’s story in cross-examination.","zh":"报告形容检察官在交叉询问中“剖开并拆穿”了证人的说法。"}]}],"synonyms":["evisceration","gutting","dismemberment (not the same, but related in violent contexts)","rip open","tear apart"],"phonetic":"/ˌdɪsɪmˈbaʊəlɪŋ/","extraExplanation":["这是较“直观、血腥”的词，常见于恐怖文学/电影、犯罪报道、历史战争描写或狩猎、屠宰等语境；日常场合通常会改用更中性的说法，如 evisceration（医学/正式）、remove the organs（说明性）。","拼写方面，英式常写 disembowelling（-elling），美式更常见 disemboweling（-eling）；两者意思相同。"]}
{"word":"disembowelment","summary":{"en":"Disembowelment means the removal of internal organs, especially the intestines, usually in a violent, medical, or historical context.","zh":"disembowelment 指把内脏（尤指肠子）取出，常见于暴力、医学/法医或历史语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of removing the internal organs (especially the intestines) from a person or animal; evisceration.","zh":"把人或动物的内脏（尤指肠子）取出；开膛；剖腹取内脏。"},"examples":[{"en":"The film was criticized for scenes of disembowelment that were too graphic.","zh":"这部电影因开膛取内脏的画面过于血腥而受到批评。"},{"en":"In some historical accounts, disembowelment was used as a form of execution or torture.","zh":"在一些历史记载中，剖腹取内脏曾被用作处决或酷刑的一种方式。"}]}],"synonyms":["evisceration","gutting","disemboweling"],"phonetic":"/ˌdɪs.ɪmˈbaʊ.əl.mənt/","extraExplanation":["这个词语气非常强烈、血腥，多用于医学/法医、历史记述或恐怖题材的作品中。日常交流里通常会用更中性的说法，比如 evisceration（正式/医学）或 “gutting”（更口语，但仍偏暴力语境）。","词源上 dis-（去除）+ embowel（取出内脏）+ -ment（名词后缀，表示“行为/结果”）。在文学或新闻中出现时，常带有强烈的暴力或震撼效果，使用要注意场合与受众。"]}
{"word":"disembowelments","summary":{"en":"“Disembowelments” means multiple instances of removing internal organs from a body; it’s a very graphic, violent word.","zh":"“disembowelments”指多起把内脏从身体中掏出/取出的情况；用词非常血腥暴力。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act(s) of removing the internal organs (especially the intestines) from a body; instances of being disemboweled.","zh":"（尤指取出肠子等）把内脏从身体里掏出/取出的行为；被开膛破肚的事件。"},"examples":[{"en":"The report described disembowelments caused by a wild animal attack.","zh":"报告描述了野生动物袭击造成的开膛破肚伤害。"},{"en":"In some horror stories, disembowelments are used for shock value.","zh":"在一些恐怖故事里，开膛破肚常被用来制造震撼效果。"}]}],"synonyms":["eviscerations","guttings","disemboweling"],"phonetic":"/ˌdɪsɪmˈbaʊəlmənts/","extraExplanation":["“disembowelments”是名词复数形式，单数是“disembowelment”。这个词语气非常血腥、暴力，日常交流中很少用；更常见的中性说法是“severe abdominal injury（严重腹部伤）”或“evisceration（内脏外翻/外露，医学/法医用语）”。","在文学或影视评论中，它有时也会带有“刻意猎奇/用暴力博眼球”的评价色彩（如“for shock value”）。"]}
{"word":"disembowels","summary":{"en":"“Disembowels” means ‘guts or removes internal organs,’ and it can also mean ‘destroys the vital parts of something’ figuratively.","zh":"“disembowels”指“开膛取脏/剖腹取内脏”，也可比喻“掏空或摧毁某事物的核心部分”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove the intestines or other internal organs from a person or animal; to gut (often violent or graphic)","zh":"把（人或动物的）内脏取出；剖腹取脏（常含暴力或血腥意味）"},"examples":[{"en":"The hunter disembowels the deer to prepare it for transport.","zh":"猎人把鹿开膛取脏，便于运走。"},{"en":"The novel describes a soldier who disembowels his enemy—an intentionally shocking scene.","zh":"小说描写一名士兵剖开敌人取出内脏——这是刻意营造震撼效果的一幕。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative) to destroy or remove the most important parts of something","zh":"（比喻）破坏或抽空（某事物）最重要的部分"},"examples":[{"en":"Budget cuts disembowel the program by removing its core services.","zh":"预算削减抽空了该项目，把核心服务都砍掉了。"},{"en":"The new rules disembowel the law’s original purpose.","zh":"新规定把这部法律的初衷“掏空”了。"}]}],"synonyms":["gut","eviscerate","dismember","cripple","hollow out"],"phonetic":"/ˌdɪsɪmˈbaʊəlz/","extraExplanation":["“disembowels”是动词“disembowel”的第三人称单数现在时（he/she/it disembowels）。过去式/过去分词：disemboweled 或 disembowelled（美式常用单写 -ed）。","这个词在字面意义上非常血腥，新闻或正式写作中通常会用更中性的表达，如：gut（开膛）、eviscerate（取出内脏/剔除要害）或 remove the organs（移除器官）。"]}
{"word":"disembower","summary":{"en":"Disembowel means to remove the internal organs (literally) or to destroy something from within (figuratively).","zh":"Disembowel 指字面上的“开膛取脏”，也可比喻“从内部掏空、摧毁”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to cut open and remove the internal organs (especially the intestines); to gut","zh":"剖开并取出内脏（尤指肠子）；开膛破肚"},"examples":[{"en":"The hunter disemboweled the deer in the field.","zh":"猎人在野外把鹿开膛取脏。"},{"en":"The scene was too graphic to show on television.","zh":"那一幕太血腥，不适合在电视上播放。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative) to destroy something from the inside; to remove its essential parts or power","zh":"（比喻）从内部摧毁；抽空关键部分或权力"},"examples":[{"en":"Budget cuts disemboweled the program, leaving it unable to function.","zh":"预算削减把这个项目“掏空”了，导致它无法运作。"},{"en":"The reforms were meant to improve the system, not disembowel it.","zh":"这些改革是为了改善体系，而不是把它掏空。"}]}],"synonyms":["gut","eviscerate","dismember","hollow out","cripple"],"phonetic":"/ˌdɪsɪmˈbaʊəl/","extraExplanation":["“disembower”在现代英语中非常少见，通常被视为“disembowel”的罕见变体或拼写误写；更标准、常用的形式是 disembowel。","该词字面义带有强烈暴力与血腥色彩，日常交流更常用较温和的表达，如“gut”（掏空/取出内脏）或在比喻义中用“weaken / hollow out”（削弱/掏空）。"]}
{"word":"disembrace","summary":{"en":"“Disembrace” means to release someone from an embrace, or (literarily) to give up a close attachment to something.","zh":"“disembrace”指从拥抱中松开；也可作文学性比喻，表示放下对某事的强烈依恋或执着。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to let go of someone you are holding; to stop embracing","zh":"（从拥抱中）松开；放开；不再拥抱"},"examples":[{"en":"They disembraced after the long reunion and looked at each other’s faces.","zh":"久别重逢后，他们松开拥抱，端详彼此的脸。"},{"en":"She disembraced him gently and stepped back.","zh":"她轻轻放开他，后退了一步。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative, literary) to give up a close attachment to an idea, belief, or habit","zh":"（比喻/文学用法）放弃紧密的依恋；不再执着于某种观念、信念或习惯"},"examples":[{"en":"Over time, he disembraced the old prejudices he had grown up with.","zh":"随着时间推移，他逐渐放下了从小形成的偏见。"},{"en":"The novel’s hero must disembrace comfort to pursue the truth.","zh":"小说中的主人公必须放弃安逸，去追寻真相。"}]}],"synonyms":["let go","release","unclasp","disengage","loosen (one’s hold)"],"phonetic":"/ˌdɪsɪmˈbreɪs/","extraExplanation":["“dis-”有“去除、分离”的意思，加上“embrace（拥抱）”，字面就是“从拥抱中分离”。该词比较少见，带一点古典/文学色彩；日常英语更常用“let go (of)”或“release”。"]}
{"word":"disembrangle","summary":{"en":"A rare verb meaning to disentangle or free from confusion or complications.","zh":"一个罕用动词，表示“解开纠缠、理清混乱或使摆脱复杂局面”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(rare) To free or separate someone/something from an entanglement, complication, or confusing situation; to disentangle.","zh":"（罕用）使……从纠缠、复杂或混乱的处境中解脱出来；理清，解开。"},"examples":[{"en":"It took hours to disembrangle the fishing line from the net.","zh":"他们花了好几个小时才把鱼线从渔网里解开。"},{"en":"The lawyer helped disembrangle the family from a web of debts and contracts.","zh":"律师帮助那家人从一堆债务和合同的纠葛中脱身。"},{"en":"To disembrangle the story, she drew a timeline of events.","zh":"为了把故事理清，她画了一条事件时间线。"}]}],"synonyms":["disentangle","untangle","unravel","extricate","unwind"],"phonetic":"/ˌdɪsɪmˈbræŋɡəl/","extraExplanation":["“disembrangle”非常少见，现代英语里更常用“disentangle”或“untangle”。词里带有“dis-”（表示“去除、相反”）和“embrangle”（纠缠、使复杂），整体意思就是“把纠缠的东西解开/把复杂情况理顺”。","在写作中用它会显得偏文学或古风；日常交流建议用“disentangle”。"]}
{"word":"disembroil","summary":{"en":"Disembroil means to disentangle or free someone/something from confusion or a complicated situation.","zh":"Disembroil 指使（人或事物）摆脱纠缠与混乱，理清复杂局面。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to free someone or something from a complicated, confusing, or tangled situation; to disentangle","zh":"使（人或事物）摆脱纠缠、混乱或复杂局面；理清、解脱"},"examples":[{"en":"The lawyer tried to disembroil her client from a messy contract dispute.","zh":"律师试图让她的当事人从一场棘手的合同纠纷中脱身。"},{"en":"Let’s disembroil the main idea from all the extra details.","zh":"我们把核心观点从一堆多余细节中理清出来吧。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become free from confusion or entanglement; to get untangled","zh":"（从混乱或纠缠中）解脱出来；理清头绪"},"examples":[{"en":"After a few clarifying questions, the story began to disembroil.","zh":"问了几个澄清性问题后，事情的来龙去脉开始清晰起来。"}]}],"synonyms":["disentangle","untangle","extricate","unravel","straighten out","clear up"],"phonetic":"/ˌdɪsɪmˈbrɔɪl/","extraExplanation":["“disembroil”比较书面、偏文学或正式用语，日常英语里更常用 disentangle、untangle、straighten out、clear up。","词源上与 “embroil”（使卷入纷争/使混乱）相关；前缀 dis- 有“反向、解除”的意思，因此整体含义是“解除卷入/解除纠缠”。"]}
{"word":"disembroilment","summary":{"en":"Disembroilment means disentanglement—getting free from confusion or conflict.","zh":"disembroilment 指“解开纠葛、摆脱混乱或冲突”，相当于 disentanglement。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of freeing someone or something from confusion, trouble, or a complicated situation; disentanglement.","zh":"使某人/某事摆脱混乱、麻烦或纠缠局面的行为；解脱；理清纠葛。"},"examples":[{"en":"After weeks of negotiations, the agreement brought a peaceful disembroilment from the dispute.","zh":"经过数周谈判，这项协议让争端得以和平解脱。"},{"en":"Her careful explanation offered disembroilment from a confusing set of rules.","zh":"她细致的解释让一套令人困惑的规则得以理清。"}]}],"synonyms":["disentanglement","extrication","resolution","clarification","unraveling"],"phonetic":"/ˌdɪsɛmˈbrɔɪlmənt/","extraExplanation":["这个词很少见，更多时候人们会用更常见的词：disentanglement（解开纠结）、resolution（解决/决议）、clarification（澄清）、extrication（脱困）。","词源上可理解为：dis-（解除/相反）+ embroil（使卷入纠纷、使混乱）+ -ment（名词后缀，表示“行为/结果”）。在文学或正式写作里偶尔出现，用来强调“从纠葛中脱身/理出头绪”的过程。"]}
{"word":"disemburden","summary":{"en":"Disemburden means to unburden yourself by sharing worries or to remove a burden from someone or something.","zh":"disemburden 指通过倾诉来卸下心头重担，或指替某人/某物减轻负担。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to tell someone about worries, problems, or secrets so you feel relieved; to unburden yourself","zh":"向别人倾诉烦恼、问题或秘密以获得轻松；卸下心头重担"},"examples":[{"en":"After weeks of stress, she disemburdened herself to a close friend.","zh":"在压力持续了几周后，她向一位亲密的朋友倾诉，终于轻松了些。"},{"en":"He disemburdened his guilt in a long letter.","zh":"他在一封长信里倾吐了自己的愧疚。"}]},{"partOfSpeech":"vt.","definition":{"en":"to remove a burden (a heavy load or responsibility) from someone or something","zh":"卸下（某人或某物的）负担；减轻责任或重压"},"examples":[{"en":"The new software disemburdened staff from repetitive paperwork.","zh":"新软件把员工从重复的文书工作中解放出来，减轻了负担。"},{"en":"Volunteers helped disemburden the community after the storm.","zh":"志愿者帮助社区在暴风雨后减轻负担、渡过难关。"}]}],"synonyms":["unburden","confide","relieve","unload","get something off one’s chest"],"phonetic":"/ˌdɪsɪmˈbɝdən/","extraExplanation":["“disemburden”较正式、偏书面，常见结构是“disemburden oneself (to someone)”表示“向某人倾诉以求释怀”。","词源上可理解为 dis-（去除）+ emburden（使负担），字面意思就是“把负担拿掉”。在现代英语中更常用的近义表达包括“unburden (oneself)”“confide”“get something off one’s chest”。"]}
{"word":"diseme","summary":{"en":"“Diseme” is not a standard English word; it’s likely a misspelling.","zh":"“diseme”不是标准英语词，通常是拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or typo of another word.","zh":"不是标准英语单词。很可能是其他单词的拼写错误或打字错误。"},"examples":[{"en":"I can’t find “diseme” in standard dictionaries—did you mean “disseminate” or “dissemble”?","zh":"在常见词典里找不到“diseme”——你是不是想写“disseminate（传播）”或“dissemble（掩饰）”？"},{"en":"Please check the spelling and share the sentence where you saw it.","zh":"请检查拼写，并把你看到它的句子发给我。"}]}],"synonyms":["disseminate","dissemble","disassemble"],"extraExplanation":["“diseme”常见于：1）把 disseminate（传播、散布）拼错；2）把 dissemble（掩饰、假装）拼错；3）在某些专业文本或人名/品牌中出现。若你把原句贴出来，我可以根据上下文判断最可能的目标词并给出准确释义与用法。"]}
{"word":"disemic","summary":{"en":"Disemic means “having two meanings,” a rare academic adjective used especially in linguistics/semiotics.","zh":"Disemic 指“具有两种含义的”，是较少见的学术用形容词，常见于语言学/符号学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having two meanings; involving two distinct meaning components (used mainly in linguistics and semiotics).","zh":"（主要用于语言学/符号学）具有两种含义的；包含两个不同意义成分的。"},"examples":[{"en":"Some words are disemic in certain contexts, carrying both a literal and a figurative sense.","zh":"有些词在特定语境中是双义的，同时带有字面义和比喻义。"},{"en":"The researcher described the term as disemic because it signals two related ideas.","zh":"研究者称这个术语为“双义”，因为它指向两个相关的概念。"}]}],"synonyms":["double-meaning","two-meaning","ambiguous","bivalent","polysemous (broader)"],"phonetic":"/daɪˈsiːmɪk/","extraExplanation":["“disemic”很少用于日常英语，更常见于学术写作（语言学、符号学、修辞分析）。日常表达里人们通常说“has two meanings / is ambiguous / is double‑meaning”。","词源可拆解为 di-（二、双）+ seme（“义素/意义单位”，来自希腊语 sēma“符号、标记”）。因此它强调“恰好两种”意义（对比 polysemous“多义的”）。"]}
{"word":"disemplane","summary":{"en":"“Disemplane” isn’t a standard word; you probably mean “deplane” (get off an airplane) or “disembark.”","zh":"“disemplane”不是标准单词；你可能想表达“deplane（下飞机）”或更通用的“disembark（下机/下船）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Not a standard English word) Likely a misspelling of “deplane,” meaning to get off an airplane.","zh":"（不是标准英文单词）很可能是拼写错误，想写的是“deplane”，意思是“下飞机”。"},"examples":[{"en":"After we landed, passengers had to wait ten minutes before they could deplane.","zh":"飞机降落后，乘客还得等十分钟才能下飞机。"},{"en":"Please remain seated until the aircraft has reached the gate and you are ready to deplane.","zh":"请保持就座，直到飞机到达登机口并准备下机。"}]},{"partOfSpeech":"v.","definition":{"en":"(Alternative, more general) “disembark”: to leave a plane, ship, or other vehicle.","zh":"（更通用的说法）“disembark”：离开飞机、船或其他交通工具。"},"examples":[{"en":"We disembarked and followed the signs to baggage claim.","zh":"我们下机后按指示牌走向行李提取处。"},{"en":"The crew asked everyone to disembark calmly.","zh":"机组人员请大家冷静下机。"}]}],"synonyms":["deplane","disembark","get off the plane","exit the aircraft"],"phonetic":"/diˈpleɪn/","extraExplanation":["“deplane”在美式英语里更常见，尤其用于航空广播或较正式的场景；日常口语里也常说“get off the plane”。","“disembark”更正式、适用范围更广（船、火车、飞机都能用）。若你想表达“从飞机下来”，最自然的两种是“deplane”（偏航空用语）或“get off the plane”（更口语）。"]}
{"word":"disemplaned","summary":{"en":"“Disciplined” means self-controlled and able to follow rules or a plan; it can also be the past form of “discipline.”","zh":"“disciplined”表示“自律/守纪律的”；也可作动词“discipline”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Showing self-control and the ability to follow rules or a plan; well-trained and orderly.","zh":"有自律的；能遵守规则或计划的；训练有素、守纪律的。"},"examples":[{"en":"She is very disciplined about studying English every day.","zh":"她在每天学习英语这件事上非常自律。"},{"en":"The team stayed disciplined and didn’t panic after the first mistake.","zh":"球队保持冷静和纪律性，第一处失误后也没有慌乱。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of “discipline”: to train someone to obey rules or to control behavior, sometimes by punishing bad behavior.","zh":"“discipline”的过去式/过去分词：训练某人遵守规则、约束行为；有时也指通过惩戒纠正不良行为。"},"examples":[{"en":"The coach disciplined the players for being late.","zh":"教练因球员迟到而处罚/管教了他们。"},{"en":"He was disciplined at work for breaking safety rules.","zh":"他因违反安全规定在工作中受到了处分。"}]}],"synonyms":["self-controlled","orderly","well-trained","strict","regulated"],"phonetic":"/ˈdɪsəplɪnd/","extraExplanation":["“disemplaned”不是常见或标准的英语单词，看起来更像是拼写错误。最可能是你想写“disciplined”。如果你原本想表达别的意思（例如“失业的”“被解雇的”“被排除在计划之外”等），告诉我你想表达的中文或给一个句子，我可以帮你找到最准确的英文词。"]}
{"word":"disemploy","summary":{"en":"Disemploy means to make someone lose their job; it’s a rare, formal word.","zh":"disemploy 指使某人失业（解雇/裁员），属于较少见、较正式的用词。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to cause someone to no longer have a job; to dismiss or lay off","zh":"使某人失业；解雇；裁员"},"examples":[{"en":"The factory closure disemployed hundreds of workers.","zh":"工厂关闭使数百名工人失业。"},{"en":"The policy change may disemploy many seasonal employees.","zh":"政策变化可能会让许多季节性雇员失业。"}]}],"synonyms":["lay off","fire","dismiss","terminate","make redundant"],"phonetic":"/ˌdɪsɪmˈplɔɪ/","extraExplanation":["“disemploy”在现代英语中比较少见，更常用的说法是“lay off”“fire”“dismiss”或“make someone redundant（英式）”。在正式或历史性文本里偶尔会出现，用来强调“使……失去工作”的结果。","构词上，“dis-”有“去除、使相反”的含义，“employ”是“雇用”，合起来就是“取消雇用/使不再被雇用”。"]}
{"word":"disemployed","summary":{"en":"Disemployed is an uncommon word meaning “no longer employed,” often implying someone was dismissed.","zh":"disemployed 很少用，意思是“不再受雇”，常暗含“被解雇/被辞退”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Uncommon) No longer employed; dismissed from a job. Example: “After the merger, many workers were disemployed.” / “The company disemployed several temporary staff.”","zh":"（不常用）不再受雇；被解雇、被辞退。例：“合并后，许多工人被解雇了。”/“公司辞退了几名临时员工。”"},"examples":[{"en":"After the merger, a number of employees were disemployed.","zh":"合并后，一些员工被解雇了。"},{"en":"He was disemployed when the factory closed.","zh":"工厂关闭时他失业了（更常说：was laid off / became unemployed）。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of disemploy: to remove someone from employment; to dismiss. Example: “The firm disemployed its contractors.”","zh":"disemploy 的过去式/过去分词：使某人不再受雇；解雇。例：“公司解雇了外包人员。”"},"examples":[{"en":"The manager disemployed two workers for repeated lateness.","zh":"经理因多次迟到辞退了两名工人。"}]}],"synonyms":["unemployed","laid off","dismissed","fired","jobless"],"phonetic":"/ˌdɪsɪmˈplɔɪd/","extraExplanation":["“disemployed / disemploy”在现代英语里非常少见，读者可能觉得生硬或带有旧式/正式的语气。日常表达更常用：\n- unemployed（失业的：中性，强调“没有工作”）\n- laid off（被裁员：通常因公司经营原因）\n- fired（被开除：多因个人表现/违规）\n- dismissed（被解雇：较正式）","如果你想表达“失业状态”，通常用“unemployed”。“disemployed”更像强调“被解除雇佣关系（被雇主解雇/裁撤）”。"]}
{"word":"disemploying","summary":{"en":"Disemploying means dismissing workers from their jobs or stopping the use of previously employed labor/resources.","zh":"disemploying 指“解雇/裁员”，也可指“停止使用原本雇用的人力或资源”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to dismiss someone from a job; to lay off (people)","zh":"解雇某人；裁员（使人失业）"},"examples":[{"en":"The company began disemploying workers after sales fell.","zh":"销量下滑后，公司开始裁员。"},{"en":"Hundreds were disemployed during the recession.","zh":"经济衰退期间，有数百人被裁员。"}]},{"partOfSpeech":"vt.","definition":{"en":"to stop using or engaging (workers, resources, or something previously put to use)","zh":"停止使用/停止雇用（原本在用的人力、资源或手段）"},"examples":[{"en":"The project is disemploying temporary staff now that the busy season is over.","zh":"旺季结束后，这个项目停止雇用临时员工。"},{"en":"They disemployed the old method and adopted a new system.","zh":"他们不再使用旧方法，改用新系统。"}]}],"synonyms":["lay off","dismiss","fire","terminate","make redundant"],"phonetic":"/ˌdɪsɪmˈplɔɪ/","extraExplanation":["“disemploying”是动词“disemploy”的现在分词/动名词形式，意思通常等同于“laying off / firing”。","这个词在现代英语里比较少见，更常用的说法是“lay off”“dismiss”“fire（美式口语更常见）”“make redundant（英式）”。在正式写作中也常见“terminate employment”。"]}
{"word":"disemployment","summary":{"en":"Disemployment means unemployment or the condition of losing employment.","zh":"disemployment 指失业，或失去工作/雇佣关系的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state of not having a job; unemployment.","zh":"失业；没有工作的状态。"},"examples":[{"en":"The report showed a rise in disemployment among young adults.","zh":"报告显示年轻人中的失业率上升。"},{"en":"During the recession, disemployment increased across many industries.","zh":"在经济衰退期间，许多行业的失业情况加剧。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or situation of being put out of a job; job loss (often because an employer ends the employment).","zh":"被解雇或失去工作的情况（常指雇主终止雇佣关系）。"},"examples":[{"en":"After the factory closed, many workers faced sudden disemployment.","zh":"工厂关闭后，许多工人突然失去工作。"},{"en":"The policy aimed to reduce disemployment caused by layoffs.","zh":"该政策旨在减少裁员造成的失业。"}]}],"synonyms":["unemployment","joblessness","job loss","layoffs"],"phonetic":"/ˌdɪsɪmˈplɔɪmənt/","extraExplanation":["“disemployment”在现代英语中相对少见，更常用的词是“unemployment”（失业）或“job loss / layoffs”（失业/裁员）。在经济学或较正式的写作里偶尔会出现，用来强调“失去雇佣关系”这一状态。"]}
{"word":"disemploys","summary":{"en":"“Disemploy” is a rare verb meaning to dismiss workers or make them unemployed.","zh":"“disemploy”是一个罕见动词，意思是解雇员工或使人失业。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare) To dismiss from employment; to make someone unemployed; to lay off.","zh":"（罕见）解雇；使失业；裁员。"},"examples":[{"en":"The factory disemployed hundreds of workers after the orders dropped.","zh":"订单减少后，那家工厂裁掉了数百名工人。"},{"en":"Many families struggled when the company disemployed long-time staff.","zh":"公司解雇老员工后，许多家庭陷入了困境。"},{"en":"The policy change disemployed workers in smaller towns first.","zh":"政策变化首先让小城镇的工人失业。"}]}],"synonyms":["lay off","dismiss","fire","terminate","make redundant"],"phonetic":"/ˌdɪsɪmˈplɔɪ/","extraExplanation":["“disemploy”在现代英语里非常少见，更多出现在较早期或较正式的文本中。日常表达里更常用：lay off（裁员）、fire（解雇）、dismiss（解雇）、make someone redundant（英式：裁撤岗位）。","前缀 dis- 常表示“去除、相反、取消”（如 disallow, disconnect），因此 disemploy 字面上可理解为“使不再被雇用”。"]}
{"word":"disempower","summary":{"en":"“Disempower” means to take away someone’s power or reduce a group’s influence.","zh":"“disempower” 指剥夺个人的权力/自主性，或削弱某个群体的影响力。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To take away someone’s power, confidence, or ability to make decisions and act.","zh":"剥夺（某人）的权力、自信或做决定与行动的能力；使无权、无力。"},"examples":[{"en":"Rules that ignore employees’ voices can disempower them and reduce motivation.","zh":"忽视员工声音的规定会让他们感到被剥夺权力，从而降低积极性。"},{"en":"She felt disempowered when others made decisions for her without asking.","zh":"别人不询问就替她做决定时，她感到自己被剥夺了自主权。"}]},{"partOfSpeech":"vt.","definition":{"en":"To make a group or community have less political, social, or economic influence.","zh":"削弱（群体/社区）的政治、社会或经济影响力。"},"examples":[{"en":"Policies that limit access to education can disempower entire communities.","zh":"限制受教育机会的政策可能会削弱整个社区的力量。"},{"en":"The law was criticized for disempowering voters in rural areas.","zh":"这项法律因削弱农村选民的影响力而受到批评。"}]}],"synonyms":["weaken","undermine","deprive (someone) of power","strip (someone) of power","marginalize"],"phonetic":"/ˌdɪsɪmˈpaʊər/","extraExplanation":["词形拆解：dis-（否定/去除）+ empower（赋权、使有能力）。因此 disempower 的核心含义就是“把赋予的力量拿走/让人失去能力与自主”。","语用提示：它常见于社会议题、职场管理、教育与公共政策语境，语气通常带批评或担忧色彩。相对词是 empower（赋权、增强能力）。"]}
{"word":"disemprison","summary":{"en":"“Disemprison” is a rare, old-fashioned verb meaning to release someone from prison or confinement.","zh":"“disemprison”是一个罕见且偏古风的动词，意思是把人从监狱或拘禁中释放出来。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to free someone from prison; to release from confinement (archaic/rare)","zh":"（古/罕用）把某人从监狱或拘禁中释放出来；解除囚禁"},"examples":[{"en":"The king ordered the rebels to be disemprisoned after the treaty was signed.","zh":"条约签署后，国王下令释放那些叛乱者。"},{"en":"She begged the court to disemprison her brother, insisting he was innocent.","zh":"她请求法庭释放她的哥哥，并坚称他是无辜的。"}]}],"synonyms":["release","free","set free","let out","liberate"],"phonetic":"/ˌdɪsɪmˈprɪzən/","extraExplanation":["这个词非常少见，带有明显的古风/文学色彩。现代英语更常用 release, free, set free, let out (of prison)。","构词上可理解为 dis-（去除、取消）+ imprison（监禁），字面意思就是“取消监禁”。在阅读旧文本或仿古写作时可能会遇到。"]}
{"word":"disen","summary":{"en":"“disen-” is a prefix meaning “to free or remove from.” It’s not usually a standalone word.","zh":"“disen-”是表示“使摆脱/解除”的前缀，通常不单独成词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a prefix used in some verbs to mean “to free or remove (someone/something) from a condition, belief, control, or thing.”","zh":"（前缀）用于一些动词中，表示“使摆脱/解除（某种状态、信念、控制或束缚）”。"},"examples":[{"en":"disenchant = to free someone from false beliefs about something.","zh":"disenchant = 使某人从对某事的幻想/错误信念中醒悟。"},{"en":"disentangle = to free something from being tangled.","zh":"disentangle = 解开缠结，使摆脱纠缠。"},{"en":"disenfranchise = to take away the right to vote.","zh":"disenfranchise = 剥夺（某人）的选举权。"}]}],"synonyms":["free","release","unburden","untangle","liberate"],"phonetic":"/dɪsɛn/","extraExplanation":["“disen”本身通常不作为一个独立的英文单词出现，更常见的是作为前缀“disen-”出现在较正式的动词里。它常带有“解除、剥离、使不再处于某种状态”的含义，语气比口语里的“get out of / take off / break free from”更书面。","如果你原本想查的是某个具体单词（例如 disenchant / disentangle / disenfranchise），把完整单词发我，我可以给你更准确的词性、发音、常见搭配和更多例句。"]}
{"word":"disenable","summary":{"en":"Disenable is a rare word meaning “to disable; to make unable.”","zh":"disenable 是个很少见的词，意思是“使失去能力/使不能（= disable）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare/old-fashioned) to make someone or something unable to do something; to disable.","zh":"（罕见/较旧用法）使某人或某物失去能力；使不能做某事；使残废（同 disable）。"},"examples":[{"en":"The injury disenabled him from working for months.","zh":"这次受伤使他几个月都无法工作。"},{"en":"A sudden power cut disenabled the security system.","zh":"突如其来的停电让安保系统失效了。"}]}],"synonyms":["disable","incapacitate","impair"],"phonetic":"/ˌdɪsɪˈneɪbəl/","extraExplanation":["“disenable”在现代英语中非常少见，通常被“disable”取代；你在正式写作或考试中更建议使用“disable”。","构词上是 dis-（表示“去除、否定”）+ enable（“使能够”），字面意思就是“使不再能够”。"]}
{"word":"disenabled","summary":{"en":"Disenabled is a rare word meaning “made unable or disqualified,” similar to disabled.","zh":"disenabled 是个罕见词，意思是“使不能/使丧失资格”，近似 disabled。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Made unable to act, function, or do something; deprived of ability, power, or legal right.","zh":"（罕见）使无法行动或运作；使失去能力、权力或（法律上的）资格/权利。"},"examples":[{"en":"After the injury, he felt disenabled from returning to work for months.","zh":"受伤后，他觉得自己几个月都无法回去工作。"},{"en":"The policy effectively disenabled small businesses from competing with large companies.","zh":"这项政策实际上让小企业无法与大公司竞争。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Past participle of the rare verb disenable) To make someone or something unable to do something; to incapacitate or disqualify.","zh":"（动词 disenable 的过去分词，较罕见）使某人/某物不能做某事；使丧失能力；使失去资格。"},"examples":[{"en":"The court ruling disenabled him from serving on the committee.","zh":"法院裁决使他失去在委员会任职的资格。"},{"en":"A serious accident can disenable a person for a long time.","zh":"严重事故可能会让一个人长期丧失行动能力。"}]}],"synonyms":["disabled","incapacitated","disqualified","prevented","hindered"],"phonetic":"/ˌdɪsɪˈneɪbəld/","extraExplanation":["“disenabled”在现代英语中非常少见，更多时候人们会用“disabled”（更常用、更自然）。","在较老的法律/正式文体中，disenable 可指“使失去资格、剥夺权利/能力”（类似 disqualify / incapacitate）。使用时注意语域：日常表达优先选 disabled 或 prevent/stop someone from doing something。"]}
{"word":"disenablement","summary":{"en":"Disenablement means the process of making someone or something unable, or (in social contexts) conditions that reduce a person’s ability to participate fully.","zh":"Disenablement 指“使失去能力”的过程或结果；在社会语境中也可指使人难以充分参与社会的条件或制度因素。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of making someone or something unable to do something; disabling","zh":"使（某人或某物）失去能力的行为或过程；使不能（disabled）的状态/过程"},"examples":[{"en":"The injury led to the disenablement of his right hand.","zh":"那次受伤导致他的右手失去功能。"},{"en":"Some policies can cause the disenablement of small businesses by limiting access to credit.","zh":"一些政策可能会因限制信贷获取而让小企业失去发展能力。"}]},{"partOfSpeech":"n.","definition":{"en":"(social/policy) conditions or systems that reduce a person’s ability to participate fully in society","zh":"（社会/政策语境）使人难以充分参与社会的条件或制度性因素"},"examples":[{"en":"Advocates argued that inaccessible public transport contributes to disenablement.","zh":"倡议者认为，公共交通无障碍不足会造成“失能化”的结果。"},{"en":"The report focuses on how discrimination produces disenablement over time.","zh":"这份报告关注歧视如何随着时间推移造成“失能化”。"}]}],"synonyms":["disablement","disabling","incapacitation","impairment (context-dependent)","restriction (context-dependent)"],"phonetic":"/ˌdɪsɪˈneɪbəlmənt/","extraExplanation":["“disenablement”并不常见，更常用的词是“disablement”（更标准）或“disability”（更常见，指残障/失能状态）。在学术或政策写作中，“disenablement”有时被用来强调“被制度/环境造成的失能”（类似“让人变得更难参与社会”），而不只是个人身体状况。","构词提示：dis-（否定/反向）+ enable（使能够）+ -ment（名词后缀，表示过程/结果）。"]}
{"word":"disenabling","summary":{"en":"“Disenabling” means taking away ability, power, or qualification (rare and formal; often replaced by “disabling” or “incapacitating”).","zh":"“disenabling”指使人（或事物）失去能力、权力或资格（较少见且偏正式，常可用“disabling/incapacitating”替代）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"making someone or something unable to do something; taking away power, ability, or qualification (present participle of “disenable”).","zh":"使某人或某物失去能力（或资格、权力）；使不能做某事（“disenable”的现在分词）。"},"examples":[{"en":"The new rule is disenabling small businesses from competing fairly.","zh":"新规定正在让小企业失去公平竞争的能力。"},{"en":"A long injury can be disenabling for an athlete’s career.","zh":"长期伤病可能会让运动员的职业生涯受到严重限制。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare, formal) the act of making someone incapable or disqualified (used as a noun/gerund).","zh":"（罕见，正式）使人丧失能力或资格的行为（作名词/动名词用）。"},"examples":[{"en":"The court discussed the disenabling of the witness to testify.","zh":"法庭讨论了该证人被取消作证资格的问题。"}]}],"synonyms":["disabling","incapacitating","hampering","crippling","disqualifying"],"phonetic":"/ˌdɪsɪˈneɪbəlɪŋ/","extraExplanation":["“disenable”在现代英语里比较少见，很多场合人们更常用“disable”（使残疾/使失去功能）或“incapacitate”（使无行为能力/使不能工作）。","在法律或正式文体中，“disenable”有时指“使失去法律资格或权利”，例如被取消某种资格、被剥夺某种权利。"]}
{"word":"disenact","summary":{"en":"Disenact means to repeal or officially отмен a law or rule (formal/legal).","zh":"Disenact 指以正式/法律方式“废除、撤销”一项法律或规则。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Law, formal) To officially end a law or rule by repealing it; to annul an enactment.","zh":"（法律用语，正式）废除（法律或规则）；撤销已制定的法令。"},"examples":[{"en":"The legislature voted to disenact the outdated statute.","zh":"立法机关投票决定废除那条过时的法规。"},{"en":"The court cannot disenact a law; it can only rule on whether it is constitutional.","zh":"法院不能废除法律；它只能裁定该法律是否合宪。"},{"en":"After public protests, the city council agreed to disenact the ban.","zh":"在公众抗议之后，市议会同意废除禁令。"}]}],"synonyms":["repeal","abolish","rescind","revoke","annul"],"phonetic":"/ˌdɪsɪˈnækt/","extraExplanation":["“disenact”很少用于日常英语，主要出现在法律、政府或政策语境中。更常见的说法是“repeal a law”（废除法律）或“abolish a rule”（废止规则）。","词形上可以理解为 dis-（取消、去除）+ enact（制定、颁布），字面意思就是“取消已颁布的东西”。"]}
{"word":"disenactment","summary":{"en":"Disenactment means the repeal or cancellation of a law, rule, or policy.","zh":"Disenactment 指对法律、规则或政策的废止或撤销。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of ending, repealing, or canceling a law, rule, or official policy","zh":"（法律、规章或政策的）废止、撤销的行为或过程"},"examples":[{"en":"The bill called for the disenactment of an outdated regulation.","zh":"该法案要求废止一项过时的规定。"},{"en":"After public pressure, the city council began discussions about the disenactment of the ban.","zh":"在公众压力下，市议会开始讨论撤销该禁令。"}]}],"synonyms":["repeal","abolition","revocation","rescission"],"phonetic":"/ˌdɪs.ɪˈnæk(t).mənt/","extraExplanation":["“Disenactment”比较少见，更多场合会用更常见的说法，比如 repeal（废除法律）、abolition（废止/废除制度）、revocation（撤销命令/许可）。在法律或政策语境中，这些词往往更自然。","构词上它来自 disenact（撤销/废止已制定的法规或政策）+ -ment（名词后缀，表示“行为/结果”）。"]}
{"word":"disenamor","summary":{"en":"“Disenamor” means to make someone (or oneself) stop loving or being strongly enthusiastic about someone or something.","zh":"“disenamor”意为使（某人或自己）对某人/某事不再爱慕或不再热衷、祛魅。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone stop loving, admiring, or feeling strongly attracted to a person or thing; to disillusion","zh":"使某人不再爱、仰慕或强烈喜爱（某人或某事）；使幻想破灭、祛魅"},"examples":[{"en":"The constant lying finally disenamored her of him.","zh":"不断的谎言终于让她对他彻底失去爱意。"},{"en":"One bad experience shouldn’t disenamor you of traveling.","zh":"一次不好的经历不该让你对旅行失去热情。"},{"en":"The scandal disenamored many fans of the celebrity.","zh":"那起丑闻让许多粉丝对那位名人不再崇拜。"}]},{"partOfSpeech":"vi.","definition":{"en":"to lose one’s own love or enthusiasm (often used with “of”)","zh":"（对……）自己不再爱或不再热衷（常与 of 连用）"},"examples":[{"en":"Over time, he disenamored of the job’s long hours.","zh":"久而久之，他对这份工作的长工时不再有热情。"},{"en":"She quickly disenamored of the plan once the costs appeared.","zh":"一旦成本浮现，她很快就对这个计划失去兴趣。"}]}],"synonyms":["disillusion","disenchant","cool (toward)","turn off","wean (from)","fall out of love"],"phonetic":"/ˌdɪs.ɪˈnæm.ɚ/","extraExplanation":["“disenamor”比较少见、偏书面，语气比常见的“lose interest”更文学、更强调从“着迷/爱慕”转为“冷却”。日常表达里更常用：“fall out of love (with)”“lose interest (in)”“become disillusioned (with)”。","构词上可理解为 dis-（去除、否定）+ enamor（使着迷/使爱上）。因此常见搭配是“disenamor someone of something/someone”（让某人对……不再着迷）。"]}
{"word":"disenamour","summary":{"en":"“Disenamour” means to cause someone to stop loving or being fascinated by someone/something.","zh":"“disenamour”指使某人对某人/某事不再爱慕或不再着迷。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone lose romantic love, admiration, or strong interest in someone or something; to disillusion","zh":"使（某人）不再爱慕/不再着迷；使幻灭"},"examples":[{"en":"The constant arguing finally disenamoured her of the relationship.","zh":"不断的争吵最终让她对这段感情不再爱慕。"},{"en":"After seeing how the company treated its staff, he became disenamoured with the job.","zh":"看到公司如何对待员工后，他对这份工作逐渐失去热情。"}]}],"synonyms":["disillusion","cool","wean","turn off","disenchant"],"phonetic":"/ˌdɪsɪˈnæmɚ/","extraExplanation":["“disenamour”较少见、偏书面，常用于表达“从迷恋/热爱中醒来”的过程；日常英语里更常用：fall out of love (with), lose interest in, become disillusioned with。","词形结构：dis-（否定/去除）+ enamour（使爱慕、使迷恋）。英式拼写常见 enamour；美式更常见 enamor。对应名词常见写法是 “disenchantment”（幻灭、扫兴）。"]}
{"word":"disenchain","summary":{"en":"“Disenchain” means to unchain or release someone/something. It is rare today; “unchain” is more common.","zh":"“disenchain”意为“解开锁链、释放”，现今较少用；更常见的是“unchain”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to free someone or something from chains; to release or unshackle (rare in modern English)","zh":"（把……）解开锁链；释放；解脱束缚（现代英语中较少用）"},"examples":[{"en":"The prisoners were finally disencha ined and led outside.","zh":"囚犯们终于被解开锁链并被带到外面。"},{"en":"In the story, the hero disencha ined the dragon to gain its trust.","zh":"在故事里，英雄解开了龙的锁链来赢得它的信任。"}]}],"synonyms":["unchain","release","unshackle","set free"],"phonetic":"/ˌdɪsɛnˈtʃeɪn/","extraExplanation":["“disenchain”在当代英语里非常少见，更常用的表达是“unchain”或“set free”。","它容易和“disenchant”（使某人不再着迷/不再抱幻想）混淆：disenchain = 解开锁链；disenchant = 破除幻想/使幻灭。","在文学或较古典的语境中，“disenchain”可能带有比喻意义，表示“摆脱束缚（rules/fear/tradition）”。"]}
{"word":"disenchant","summary":{"en":"Disenchant means to make someone lose admiration or illusions; in literature, it can also mean to remove a magical spell.","zh":"Disenchant 指让人对某事不再崇拜或抱幻想而“幻灭”；在文学中也可指“解除魔法”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To make someone lose their belief, admiration, or excitement about something by showing it is not as good, true, or fair as they thought.","zh":"使（某人）不再相信、崇拜或兴奋；让人看清现实后感到幻灭。"},"examples":[{"en":"The long delays and poor service disenchanted many customers.","zh":"长期的延误和糟糕的服务让许多顾客感到幻灭。"},{"en":"She was disenchanted with politics after seeing so much corruption.","zh":"看到这么多腐败后，她对政治感到幻灭。"},{"en":"The movie’s ending disenchanted viewers who expected a happy finish.","zh":"电影的结局让期待圆满结尾的观众感到失望和幻灭。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Literary) To free someone or something from a spell or magic; to remove enchantment.","zh":"（文学用法）解除魔法；使脱离迷咒。"},"examples":[{"en":"In the tale, true love disenchants the prince.","zh":"在故事里，真爱解除了王子的魔咒。"},{"en":"The wizard tried to disenchant the cursed ring.","zh":"巫师试图解除那枚被诅咒的戒指的魔法。"}]}],"synonyms":["disillusion","disabuse","deter","cure (someone) of","demystify"],"phonetic":"/ˌdɪs.ɪnˈtʃænt/","extraExplanation":["词源上，dis- 表示“去除/否定”，enchant 表示“施魔法、使着迷”。现代更常用引申义：从“被迷住”到“醒悟”，常见搭配有 be disenchanted with (对……感到幻灭)、disenchanted by (被……弄得幻灭)。","文学与文化语境中常与“去魅（disenchantment）”相关：指人们对权威、理想或浪漫想象失去“魔法般的光环”，转而用更现实或理性的眼光看待世界。"]}
{"word":"disenchanted","summary":{"en":"Disenchanted means disappointed and no longer enthusiastic; in fantasy, it can also mean freed from a spell.","zh":"disenchanted 常指“失望、热情消退”；在奇幻语境中也可指“解除魔法”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"No longer excited, happy, or satisfied because something (or someone) has disappointed you.","zh":"因失望而不再兴奋、满意或抱有热情的；心灰意冷的。"},"examples":[{"en":"She became disenchanted with her job after months of long hours and little support.","zh":"连续几个月加班却得不到支持后，她对这份工作感到心灰意冷。"},{"en":"Many voters felt disenchanted with politics because promises were not kept.","zh":"由于承诺没有兑现，许多选民对政治感到失望。"}]},{"partOfSpeech":"adj.","definition":{"en":"In stories or fantasy, having a magical spell removed; no longer enchanted.","zh":"（故事/奇幻语境）被解除魔法的；不再被施法的。"},"examples":[{"en":"In the final chapter, the prince is disenchanted and returns to his human form.","zh":"在最后一章里，王子被解除魔法，恢复成人形。"},{"en":"The witch’s mirror was finally disenchanted.","zh":"女巫的镜子终于被解除魔法了。"}]}],"synonyms":["disillusioned","disappointed","dissatisfied","jaded","cynical"],"phonetic":"/ˌdɪs.ɪnˈtʃæn.tɪd/","extraExplanation":["词源提示：dis- 表示“否定/去除”，enchant 表示“使着迷/施魔法”。因此 disenchanted 既可指“理想破灭、热情消退”，也可在童话语境中指“解除魔法”。","用法搭配：become/feel disenchanted with + 人/事物（对……感到幻灭）；disenchanted voters/workers/students（对某领域失望的人）。","文化语境：在现代英语里最常见的是“对某事不再抱有幻想”的含义；在文学与童话中仍保留“解除魔法”的字面含义。"]}
{"word":"disenchanter","summary":{"en":"A disenchanter is someone or something that removes enchantment or illusions—either literally (breaking a spell) or figuratively (making people face reality).","zh":"disenchanter 指“解除魔法的人”，更常用作比喻，指让人从幻想或不切实际的期待中清醒、看清现实的人或事。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person (or thing) that removes illusions, unrealistic hopes, or magical charm; someone who makes people see reality more clearly","zh":"让人“幻灭”的人（或事物）；去除不切实际的幻想或魔力、使人更看清现实的人"},"examples":[{"en":"The scandal was a disenchanter, making many fans see the celebrity differently.","zh":"那场丑闻让很多粉丝“幻灭”，也让他们用不同的眼光看那位名人。"},{"en":"For her, reading the contract carefully was a disenchanter—it revealed the hidden costs.","zh":"对她来说，仔细读合同让她“幻灭”了——它揭示了隐藏费用。"}]},{"partOfSpeech":"n.","definition":{"en":"in fantasy or literature, someone who breaks a spell or removes enchantment","zh":"（奇幻或文学中）解除魔法、破除咒语的人"},"examples":[{"en":"In the story, the disenchanter freed the village from a curse.","zh":"在故事里，解除魔法的人把村庄从诅咒中解救出来。"}]}],"synonyms":["debunker","reality check","spell-breaker","disillusioner"],"phonetic":"/ˌdɪs.ɪnˈtʃæn.tɚ/","extraExplanation":["词源上可拆成 dis-（去除、反向）+ enchant（使着迷/施魔法）+ -er（做某事的人）。因此它既可指“破除魔法的人”，也常用于比喻“让人从理想化中清醒的人/事”。","在现代英语里，比喻义更常见：a disenchanter 不一定是“扫兴的人”，更强调“揭示真相、打破幻想”。接近的名词还有 disenchantment（幻灭、失望）。"]}
{"word":"disenchanting","summary":{"en":"Disenchanting means causing someone to lose admiration, excitement, or belief—often by revealing a disappointing reality.","zh":"Disenchanting 指让人因现实暴露而失去崇拜、兴奋或信念的“令人幻灭/让人不再着迷的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"disappointing in a way that makes you lose your excitement, admiration, or beliefs about something","zh":"令人失望到让人失去热情、崇拜或原本的信念；使人“幻想破灭”的"},"examples":[{"en":"The movie started strong, but the ending was disenchanting.","zh":"电影开头很精彩，但结尾让人很幻灭。"},{"en":"It was disenchanting to learn how much pressure the “perfect” job involved.","zh":"得知那份“完美”的工作压力有多大，真让人幻想破灭。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “disenchant”: to make someone stop believing something is good, special, or magical","zh":"“disenchant”的现在分词：使某人不再相信某事物很美好、很特别或像有魔力一样；使人不再着迷"},"examples":[{"en":"The scandal is disenchanting many long-time supporters.","zh":"这起丑闻正在让许多长期支持者逐渐不再着迷、转而失望。"},{"en":"Travel delays were disenchanting us with the idea of a “stress-free” vacation.","zh":"旅行延误让我们对“零压力度假”的想法逐渐失去向往。"}]}],"synonyms":["disillusioning","disappointing","deflating","sobering","disheartening"],"phonetic":"/ˌdɪs.ɪnˈtʃæn.tɪŋ/","extraExplanation":["词源上可理解为 dis-（否定/去除）+ enchant（使着迷、施魔法）。所以 disenchanting 常用来表达“去魅”“破除幻想”，语气比一般的 disappointing 更带有“原本很向往→后来醒悟/失望”的落差感。","常见搭配：disenchanting experience（令人幻灭的经历）、disenchanting truth/reality（令人幻灭的真相/现实）、be disenchanting to learn…（得知……令人幻灭）。"]}
{"word":"disenchantingly","summary":{"en":"“Disenchantingly” means “in a disappointing, sobering way that removes excitement or illusions.”","zh":"“disenchantingly”表示“以令人失望、让人幻灭/清醒的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that removes someone’s hopes, romance, or excitement; disappointingly or soberingly.","zh":"以一种让人幻想破灭、热情消退的方式；令人失望地／令人清醒地。"},"examples":[{"en":"Disenchantingly, the “perfect” apartment had loud construction noise every morning.","zh":"令人幻想破灭的是，那间“完美”的公寓每天早上都有很吵的施工噪音。"},{"en":"The trip looked glamorous online, but disenchantingly it was mostly waiting in long lines.","zh":"这趟旅行在网上看起来很精彩，但令人清醒地说，现实大多是在排长队等待。"},{"en":"He spoke of fame disenchantingly, as if it brought more pressure than joy.","zh":"他谈起名声时带着一种幻灭感，仿佛它带来的压力多于快乐。"}]}],"synonyms":["disappointingly","soberingly","disillusioningly","unromantically","grimly"],"phonetic":"/ˌdɪs.ɪnˈtʃæn.tɪŋ.li/","extraExplanation":["“disenchantingly”来自动词 disenchant（使…不再着迷/使幻想破灭）→ 形容词 disenchanting（令人幻灭的）→ 副词 -ly（以…的方式）。","语气上常带有“从浪漫/理想回到现实”的感觉，既可以表示“失望”，也可以表示“令人清醒、去魅”的客观描述。"]}
{"word":"disenchantment","summary":{"en":"Disenchantment means the loss of belief, excitement, or idealism when reality fails to match what you hoped for.","zh":"Disenchantment 指当现实不如期待时产生的“理想破灭、热情消退”的失望感。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A feeling of disappointment when you realize something (or someone) is not as good, fair, or magical as you once believed; the loss of idealism.","zh":"当你发现某事（或某人）并不像原先想的那么好、那么公平或那么“美好”时产生的失望感；理想破灭。"},"examples":[{"en":"Many voters felt disenchantment after the new leader failed to keep promises.","zh":"新领导人未能兑现承诺后，许多选民感到幻灭与失望。"},{"en":"Her disenchantment with city life grew after months of noise and stress.","zh":"经历了几个月的喧闹与压力后，她对城市生活的向往逐渐变成了失望。"}]},{"partOfSpeech":"n.","definition":{"en":"The process of taking away someone’s belief in an idea, cause, or system; making something seem less inspiring or attractive.","zh":"使人对某种理念、事业或制度失去信心的过程；让事物显得不再鼓舞人心或不再有吸引力。"},"examples":[{"en":"The scandal led to widespread disenchantment with the company’s brand.","zh":"这起丑闻引发了公众对该公司品牌的普遍失望与反感。"},{"en":"Constant criticism can create disenchantment among new employees.","zh":"持续不断的批评会让新员工逐渐失去热情与信心。"}]}],"synonyms":["disillusionment","disappointment","discontent","cynicism"],"phonetic":"/ˌdɪs.ɪnˈtʃænt.mənt/","extraExplanation":["词源提示：dis- 表示“去掉/相反”，enchantment 是“迷住、魔力般的吸引”。disenchantment 字面含义就是“失去魔力/不再着迷”，常用来形容对政治、工作、爱情或社会理想的“幻灭”。","用法对比：disappointment 更偏“具体事情没达到预期的失望”；disenchantment 更偏“长期信念或理想被打破后的失望”，语气更深、更带“理想破灭”的意味。","文化/写作语境：在社会评论和文学里，disenchantment 常和 modern life（现代生活）、politics（政治）、youth（青年）等搭配，用来写从憧憬到清醒的转变。"]}
{"word":"disenchantments","summary":{"en":"Disenchantments are feelings or experiences of becoming disillusioned—losing belief or excitement about something once admired.","zh":"Disenchantments 指对曾经崇拜或理想化的事物产生的幻灭与失望（多次的幻灭经历）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the feeling or process of losing admiration, excitement, or belief in something that once seemed good, magical, or ideal","zh":"（对曾经美好、理想或“有魔力”的事物的）幻灭；失望；不再着迷的过程或感受"},"examples":[{"en":"After a few months at the new job, she began to feel disenchantment with the company culture.","zh":"在新工作干了几个月后，她开始对公司的文化感到幻灭。"},{"en":"Many voters experienced disenchantment after the election promises were not kept.","zh":"当竞选承诺没有兑现时，许多选民感到失望与幻灭。"},{"en":"His disenchantment with fame pushed him to live a quieter life.","zh":"他对名声的幻灭促使他过上更安静的生活。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) multiple experiences or moments of becoming disillusioned","zh":"（复数）多次的幻灭经历；一连串的失望时刻"},"examples":[{"en":"Her twenties were full of small disenchantments that slowly changed her priorities.","zh":"她二十多岁充满了许多小小的幻灭，这些经历慢慢改变了她的优先顺序。"},{"en":"The memoir describes the author's disenchantments with politics, love, and work.","zh":"这本回忆录描写了作者对政治、爱情和工作的种种幻灭。"}]}],"synonyms":["disillusionment","disappointment","letdown","loss of faith","awakening"],"phonetic":"/ˌdɪsɪnˈtʃæntmənts/","extraExplanation":["“disenchant”原意与“解除魔法/迷惑”有关，所以disenchantment常带有从“理想化、浪漫化”回到“更现实”的语感，比普通的disappointment（失望）更强调“曾经深信或着迷，后来醒悟”。","文学与文化语境中，它常用来写“成长的代价”或“现代社会祛魅”（例如对英雄、爱情、体制的幻想破灭）。"]}
{"word":"disenchantress","summary":{"en":"A disenchantress is (1) a woman who breaks a magic spell, or (2) figuratively, something that removes illusions.","zh":"disenchantress 指（1）解除咒语的女性解咒者；也可（2）比喻“破除幻想、让人清醒”的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In stories or fantasy) a woman who breaks a spell or removes magic from someone or something.","zh":"（故事或奇幻作品中）解除魔法或破除咒语的女性；解咒者。"},"examples":[{"en":"The disenchantress freed the prince from the witch’s curse.","zh":"那位解咒女巫把王子从女巫的诅咒中解救出来。"},{"en":"In the final chapter, a disenchantress undoes the enchantment on the sleeping city.","zh":"在最后一章中，一位解咒者解除了沉睡之城的魔法。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, literary) a person or experience that removes false hopes or illusions; something that makes you see reality more clearly.","zh":"（比喻、偏文学）让人从幻想中清醒的人或经历；使人“破除幻想”的事物。"},"examples":[{"en":"Living abroad was a disenchantress: it challenged the romantic image he had of the place.","zh":"在国外生活成了“破除幻想者”：它挑战了他对那个地方的浪漫想象。"},{"en":"Time can be a disenchantress, turning bright dreams into practical plans.","zh":"时间有时像解魅者，把绚烂的梦想变成务实的计划。"}]}],"synonyms":["disenchanter","spell-breaker","illusion-breaker","eye-opener"],"phonetic":"/ˌdɪs.ɪnˈtʃæn.trəs/","extraExplanation":["“disenchantress”由 dis-（去除、反向）+ enchant（施魔法/使着迷）+ -ress（表示女性身份的后缀）构成。-ress 在现代英语中较少用于日常中性表达，因此这个词带有明显的文学/奇幻色彩。","近义表达在现代更常见的是 disenchanter（解咒者，性别中性）或 spell-breaker（破咒者）。在比喻义上也常用 “a wake-up call”（当头棒喝）或 “reality check”（现实检验）来表达“让人清醒”。"]}
{"word":"disenchants","summary":{"en":"“Disenchants” means makes someone lose their admiration or illusions; in stories, it can also mean removes magic.","zh":"“disenchants”表示让人不再着迷或产生幻灭；在故事/文学语境中也可表示解除魔法。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone lose their admiration, excitement, or belief in something (to remove an illusion or “spell”).","zh":"使（某人）不再着迷；使幻灭；让（某人）对某事失去崇拜、热情或信念。"},"examples":[{"en":"The long delays disenchants many first-time customers.","zh":"长时间的延误让许多第一次购买的顾客感到失望、热情消退。"},{"en":"Learning the truth disenchants him, but it also helps him grow up.","zh":"知道真相让他幻灭，但也促使他成熟。"}]},{"partOfSpeech":"vt.","definition":{"en":"(literary) to free someone or something from magic or an enchanting spell.","zh":"（文学用语）解除（某人/某物）的魔法或魅惑。"},"examples":[{"en":"In the fairy tale, a kiss disenchants the prince.","zh":"在童话里，一个吻解除了王子的魔法。"},{"en":"The wizard disenchants the ring to make it safe.","zh":"巫师解除了戒指的魔力，使其安全。"}]}],"synonyms":["disillusion","disappoint","cool","deflate","deter","unspell"],"phonetic":"/ˌdɪs.ɪnˈtʃænt/","extraExplanation":["“disenchants”是动词“disenchant”的第三人称单数形式（he/she/it disenchants）。常见搭配：disenchant someone with/from something（使某人对某事幻灭/不再抱有幻想）。","词源上可理解为 dis-（去除、否定）+ enchant（使着迷/施魔法），所以既可以指“理想破灭”，也可以在故事语境中指“解除魔法”。"]}
{"word":"disencharm","summary":{"en":"Disenchant means to make someone lose admiration or illusions about something.","zh":"Disenchant 表示“使人幻灭/不再抱幻想；使人从迷思中清醒”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To make someone lose their admiration, belief, or excitement about something; to free someone from an illusion.","zh":"使某人不再崇拜/相信/兴奋；让人从幻想或误解中清醒过来。"},"examples":[{"en":"The scandals disenchanted many voters.","zh":"这些丑闻让许多选民感到幻灭。"},{"en":"Living abroad disenchanted her about the “perfect” life she imagined.","zh":"在国外生活让她对自己想象的“完美”生活不再抱幻想。"},{"en":"He was disenchanted with the job after a few months.","zh":"几个月后，他对这份工作感到失望。"}]}],"synonyms":["disillusion","disabuse","deter","sobering"],"phonetic":"/ˌdɪs.ɪnˈtʃænt/","extraExplanation":["“disencharm” 不是常见或标准的英文单词；多数情况下你想写的是 **disenchant**（使幻灭/使清醒）。","词源上，**enchant** 表示“迷住、施魔法”，加上前缀 **dis-**（表示“去除、取消”）就变成“去除迷惑/解除迷思”，因此常用于“理想破灭、看清现实”的语境。","常见搭配：**be disenchanted with**（对……感到幻灭/失望）；名词形式 **disenchantment**（幻灭、清醒）。"]}
{"word":"disenclose","summary":{"en":"Disenclose means to remove something from being enclosed or to open something so it is no longer confined.","zh":"Disenclose 指把……从围住/封闭中解放出来，或把封闭的东西打开使之不再受限。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove from an enclosure; to set free or take out of something that surrounds or contains it","zh":"使脱离围住/封闭之物；把……从包围或封闭中取出、解放出来"},"examples":[{"en":"The rescue team worked carefully to disenclose the hikers from the narrow crevice.","zh":"救援队小心作业，把徒步者从狭窄的裂缝中解救出来。"},{"en":"In early spring, warm weather can disenclose the plants from a layer of ice.","zh":"早春的暖和天气能让植物从一层冰的包裹中“解封”。"}]},{"partOfSpeech":"vt.","definition":{"en":"to open up what was closed in, making something no longer enclosed or confined","zh":"打开封闭状态；使不再被围住、限制"},"examples":[{"en":"They cut the fence to disenclose a path to the river.","zh":"他们剪开栅栏，打开一条通往河边的路。"}]}],"synonyms":["free","release","liberate","unseal","open up","remove"],"phonetic":"/ˌdɪsɪnˈkloʊz/","extraExplanation":["“disenclose”非常少见，现代英语里更常用的表达是“release / free / remove … from … / open up”。","构词上是 dis-（表示“去除、反向”）+ enclose（围住、封闭），字面意思就是“解除围住”。","不要与“disclose”（透露、揭露）混淆；两者拼写相近但意思不同。"]}
{"word":"disencourage","summary":{"en":"“Disencourage” means to make someone less willing or less confident, or to advise them not to do something.","zh":"“Disencourage”意为让人失去意愿/信心，或劝人不要做某事。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone less likely to do something; to reduce someone’s confidence or enthusiasm","zh":"使某人不太想做某事；使泄气、打消念头"},"examples":[{"en":"The high cost may discourage people from traveling this year.","zh":"高昂的费用可能会让人们今年不太想旅行。"},{"en":"Don’t let one bad grade discourage you—you can improve.","zh":"别让一次差成绩打击你——你可以进步的。"}]},{"partOfSpeech":"vt.","definition":{"en":"to advise or try to persuade someone not to do something","zh":"劝阻；试图说服某人不要做某事"},"examples":[{"en":"Doctors discourage smoking because it harms the lungs.","zh":"医生劝阻吸烟，因为它会伤害肺部。"},{"en":"My parents discouraged me from quitting too quickly.","zh":"我父母劝我不要太快放弃。"}]}],"synonyms":["discourage","deter","dishearten","demotivate","put off"],"phonetic":"/ˌdɪsˈkɝɪdʒ/","extraExplanation":["词形小提示：dis- 表示“否定/相反”，encourage 是“鼓励”。因此 discourage 字面上就是“去掉鼓励”，常用于“discourage someone from doing sth（劝某人不要做某事）”。","语气区别：discourage 更像“让人失去动力/不建议做”，不一定很强硬；如果是更强的“阻止/阻拦”，可用 prevent 或 stop。"]}
{"word":"disencrease","summary":{"en":"“Disencrease” is not standard English; the correct word is “decrease” (verb/noun).","zh":"“disencrease” 不是规范英文；正确用法通常是 “decrease”（动词/名词）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Nonstandard spelling) Most likely you mean “decrease”: to become smaller/less, or to make something smaller/less.","zh":"（非标准拼写）你很可能想写的是 “decrease”：（数量、程度等）减少；或使……减少。"},"examples":[{"en":"Sales decreased after the price increase.","zh":"涨价后，销量下降了。"},{"en":"We need to decrease the amount of sugar in this recipe.","zh":"我们需要减少这个食谱里的糖量。"}]},{"partOfSpeech":"n.","definition":{"en":"“Decrease” (noun): a reduction in size, amount, or level.","zh":"“Decrease”（名词）：减少；降低；下降。"},"examples":[{"en":"There was a decrease in traffic during the holiday.","zh":"假期期间车流量减少了。"}]}],"synonyms":["reduce","lower","decline","diminish","lessen"],"phonetic":"/dɪˈkriːs/","extraExplanation":["“disencrease” 不是常见或规范的英文拼写。写作和考试中建议用 “decrease”。","常见搭配：decrease by + 数字/百分比（减少了……）；decrease in + 名词（在……方面减少）。例如：Prices decreased by 10%. / a decrease in costs。","发音提示：动词 decrease 常重读第二音节；名词 decrease 常重读第一音节，但在日常口语里两者也常读得很接近。"]}
{"word":"disencumber","summary":{"en":"Disencumber means to free someone or something from burdens, clutter, or obstacles.","zh":"disencumber 指“解除负担/清理累赘/排除障碍”，让人或事物更轻松、更顺畅。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to free someone or something from a burden, load, or unnecessary things; to make it lighter or less cluttered","zh":"使（某人或某物）摆脱负担/累赘；减轻负荷；清理多余之物"},"examples":[{"en":"She disencumbered herself of the heavy coat and sat down.","zh":"她脱下沉重的外套，轻松些后坐了下来。"},{"en":"Please disencumber the table so we can serve dinner.","zh":"请把桌子上的东西清理一下，这样我们就能上菜了。"},{"en":"He tried to disencumber his mind of worries before the exam.","zh":"考试前他尽量让自己摆脱烦恼，放轻松。"}]},{"partOfSpeech":"vt.","definition":{"en":"to clear a place or situation of obstacles or complications; to make movement or progress easier","zh":"清除障碍/麻烦；使通行或进展更顺畅"},"examples":[{"en":"Workers disencumbered the hallway by moving the boxes out of the way.","zh":"工人把箱子挪开，清空走廊以免阻碍通行。"},{"en":"The new policy was meant to disencumber small businesses from extra paperwork.","zh":"新政策旨在让小企业摆脱额外的文书负担。"}]}],"synonyms":["unburden","relieve","unload","free","clear","declutter"],"phonetic":"/ˌdɪsɪnˈkʌmbɚ/","extraExplanation":["“dis-”表示“去除/相反”，加上“encumber”（拖累、妨碍），合起来就是“去除拖累”。这个词在日常口语里不如“unburden / get rid of / clear”常见，但在较正式的写作中很有用。","常见搭配：disencumber yourself of/from…（摆脱/放下……）；disencumber a room/table/area（清空空间）；disencumber someone from…（使某人免于……负担）。"]}
{"word":"disencumbered","summary":{"en":"Disencumbered means freed from burdens or restrictions (sometimes used formally for property without debt).","zh":"disencumbered 指“摆脱负担或束缚的”（也可正式用于“财产无债务/无权利负担”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Freed from a burden, obstacle, or unnecessary things; no longer weighed down.","zh":"摆脱负担、阻碍或多余之物的；不再被拖累的。"},"examples":[{"en":"After paying off her loans, she felt disencumbered and ready to start a new life.","zh":"还清贷款后，她感觉如释重负，准备开始新生活。"},{"en":"He arrived at the airport disencumbered, carrying only a small backpack.","zh":"他到机场时轻装上阵，只背了一个小背包。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not having a legal/financial claim attached (for example, property without debt).","zh":"（法律/金融语境）无负担的；不受债务或权利主张牵制的（如无抵押的财产）。"},"examples":[{"en":"The company wanted the building disencumbered before the sale.","zh":"公司希望在出售前让这栋楼处于无抵押负担的状态。"},{"en":"She inherited a disencumbered piece of land.","zh":"她继承了一块没有债务负担的土地。"}]}],"synonyms":["unencumbered","unburdened","free","unrestricted","unloaded"],"phonetic":"/ˌdɪs.ɪnˈkʌm.bɚd/","extraExplanation":["词源上来自前缀 dis-（表示“去除、相反”）+ encumber（使负担、拖累）。因此 disencumbered 常带有“把束缚/负担拿掉后更轻松”的语感。","在日常英语里更常用 unencumbered 表达“无负担的/不受牵累的”。disencumbered 也正确，但听起来略正式或书面，尤其在法律、财务、房产语境中更常见。"]}
{"word":"disencumbering","summary":{"en":"“Disencumbering” means removing burdens or obstacles—either clearing yourself of extra things or formally freeing property from legal/financial claims.","zh":"“disencumbering”指“解除负担/牵累”：既可指清理多余物品、轻装上阵，也可指在法律/财务上解除财产的抵押、债务等产权负担。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"freeing someone or something from a burden, obstacle, or unnecessary attachment; removing what is weighing them down","zh":"（使）摆脱负担、阻碍或不必要的牵累；把压在身上的东西去掉"},"examples":[{"en":"She spent the weekend disencumbering herself of old clothes and unused books.","zh":"她用周末的时间清理旧衣服和不用的书，让自己不再被这些东西牵累。"},{"en":"By disencumbering the project of extra steps, the team finished faster.","zh":"通过去掉项目中多余的步骤，团队完成得更快。"}]},{"partOfSpeech":"v.","definition":{"en":"(especially in formal or legal contexts) freeing property, a title, or an asset from a claim, debt, or other legal burden","zh":"（尤用于正式/法律语境）解除财产、产权或资产上的债务、抵押等法律负担"},"examples":[{"en":"They are disencumbering the house before the sale by paying off the mortgage.","zh":"他们在出售前先还清房贷，以解除房屋的抵押负担。"},{"en":"The lawyer discussed options for disencumbering the land of old liens.","zh":"律师讨论了如何解除土地上旧留置权的方案。"}]}],"synonyms":["unburdening","freeing","relieving","clearing","unloading","unencumbering"],"phonetic":"ˌdɪsɪnˈkʌmbərɪŋ","extraExplanation":["“dis-”表示“去除/相反”，加上“encumber”（使受累、使受阻），所以 disencumber 的核心意思就是“去掉累赘、解除牵绊”。在日常英语里，它常用于“清理杂物、轻装上阵”（both physical and mental）；在房地产/法律语境里，encumbrance 指“产权负担”（如 mortgage 抵押、lien 留置权、debt 债务等）。"]}
{"word":"disencumberment","summary":{"en":"Disencumberment means removing burdens or obstacles, or the feeling/state of being free from them.","zh":"Disencumberment指“解除负担/障碍”的行为，或“无负担、获得自由”的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of freeing someone or something from a burden, obstacle, or responsibility; removal of what weighs you down","zh":"使（某人/某物）摆脱负担、阻碍或责任的行为；解除累赘"},"examples":[{"en":"Moving to a smaller apartment felt like a disencumberment from unnecessary stuff.","zh":"搬到更小的公寓，让我感觉从不必要的物品中解脱出来。"},{"en":"The company’s debt disencumberment took years of careful planning.","zh":"公司的债务解除花了多年谨慎规划。"}]},{"partOfSpeech":"n.","definition":{"en":"the state of being unburdened; freedom from encumbrances (financial, legal, physical, or emotional)","zh":"无负担的状态；摆脱（经济、法律、身体或情感）羁绊的自由"},"examples":[{"en":"After paying off the loan, she enjoyed a sense of disencumberment.","zh":"还清贷款后，她感到一种如释重负。"},{"en":"He spoke with disencumberment, as if nothing was weighing on him.","zh":"他说话时显得很轻松，好像没有任何压力。"}]}],"synonyms":["relief","unburdening","release","liberation","freedom from encumbrance","debt relief"],"phonetic":"/ˌdɪsɪnˈkʌmbərmənt/","extraExplanation":["“dis-”表示“去除/相反”，词根“encumber”意为“使成为负担、妨碍”（encumbrance=负担/阻碍），“-ment”把动词变成名词，所以disencumberment就是“去除负担的过程/结果”。","在现代英语里，这个词偏正式、较少在日常口语中出现。更常见的表达包括：relief（解脱）、unburdening（卸下负担）、getting rid of clutter（清理杂物）、debt relief（债务减免）。","常见搭配语境：financial disencumberment（财务解套/减负）、legal disencumberment（解除法律负担，如解除抵押/权利负担）、emotional disencumberment（情感上的放下）。"]}
{"word":"disencumbers","summary":{"en":"“Disencumbers” means “removes burdens or obstacles; frees from encumbrances.”","zh":"“disencumbers”表示“去除负担或障碍，使摆脱累赘”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to free someone or something from a burden, obstacle, or unnecessary thing; to remove what is weighing them down","zh":"使（某人或某物）摆脱负担/阻碍；清除累赘之物"},"examples":[{"en":"She disencumbers her desk by throwing away old papers.","zh":"她把旧文件扔掉，让桌面不再杂乱累赘。"},{"en":"The new software disencumbers the team from repetitive tasks.","zh":"新软件让团队摆脱重复性工作的负担。"},{"en":"Please disencumber the hallway of boxes before guests arrive.","zh":"客人到来前，请把走廊里的箱子清走。"}]}],"synonyms":["unburdens","frees","relieves","clears","rids (of)"],"phonetic":"/ˌdɪsɪnˈkʌmbɚ/","extraExplanation":["“disencumbers”是动词“disencumber”的第三人称单数形式（he/she/it disencumbers）。更常见的近义表达包括 unburden（减轻负担）、clear（清理）、rid ... of（使摆脱……）。","这个词在正式或书面语中更常见，既可以指具体的“清走杂物/障碍”，也可以比喻“摆脱责任、压力或繁琐流程”。"]}
{"word":"disencumbrance","summary":{"en":"Disencumbrance means being freed from burdens or constraints.","zh":"disencumbrance 指“摆脱负担或束缚”的状态或过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of freeing someone or something from burdens, obstacles, or restrictions (an encumbrance).","zh":"解除负担、障碍或限制的行为或过程；使摆脱累赘/牵累。"},"examples":[{"en":"After paying off the loan, the family felt a sense of disencumbrance.","zh":"还清贷款后，这家人感到一种如释重负的解脱感。"},{"en":"The company’s disencumbrance from old rules allowed it to innovate faster.","zh":"公司摆脱旧规章的束缚后，创新速度更快了。"},{"en":"She spoke about emotional disencumbrance—letting go of guilt and fear.","zh":"她谈到情感上的解脱——放下内疚与恐惧。"}]}],"synonyms":["relief","unburdening","liberation","emancipation","release","freedom"],"phonetic":"/ˌdɪsɪnˈkʌmbrəns/","extraExplanation":["这个词比较罕见、偏书面，常见于正式写作或抽象讨论（例如“摆脱束缚/负担”的过程）。日常英语里更常用：relief（解脱/缓解）、freedom（自由）、unburdening（卸下负担）、removal of burdens（移除负担）。","构词上可理解为 dis-（去除）+ encumbrance（累赘/负担/法律上的产权负担）→ disencumbrance（解除负担）。在法律或财务语境中，有时可指“解除抵押/留置权等负担”，但实际使用中更常见的是 release of lien / discharge of mortgage 等更具体的表达。"]}
{"word":"disendow","summary":{"en":"“Disendow” means to remove an institution’s endowment or financial support.","zh":"“Disendow”指取消或剥夺某机构的捐赠基金/财产性资助。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to take away the money, property, or income that supports an institution (such as a church, school, or charity); to remove an endowment","zh":"剥夺（机构如教会、学校、慈善组织等）的捐赠基金/财产或收入来源；取消其资助"},"examples":[{"en":"The government voted to disendow the state church and redistribute its property.","zh":"政府投票决定取消国教的财产资助，并重新分配其财产。"},{"en":"Some activists argue the organization should be disendowed because of unethical practices.","zh":"一些活动人士认为该组织因不道德行为应被取消资助。"}]}],"synonyms":["deprive (of funds)","defund","strip (of assets)","divest"],"phonetic":"/ˌdɪsɛnˈdaʊ/","extraExplanation":["该词常见于英国历史与政治语境，尤其与“国教（established church）”的财产和固定收入有关：disendow 指“剥夺/取消其财产性支持”，常与 disestablish（取消国教地位）一起出现，但两者不完全相同：disestablish 侧重地位与制度关系，disendow 侧重财产与资金来源。"]}
{"word":"disendowed","summary":{"en":"Disendowed means having had an endowment or official financial support taken away; it is also the past form of disendow.","zh":"disendowed 指“被取消/剥夺捐赠基金或官方资助的”；也可作 disendow 的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(often passive) Deprived of an endowment, funding, property, or official financial support.","zh":"（常用被动）被剥夺捐赠基金、资助、财产或正式财政支持的。"},"examples":[{"en":"After the political change, the university was disendowed and had to rely on tuition.","zh":"政局变化后，这所大学被取消了基金支持，只能依靠学费维持。"},{"en":"The charity became effectively disendowed when its main donor withdrew support.","zh":"主要捐助者撤资后，这家慈善机构实际上等于被“断供”了。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense / past participle of disendow: to take away an endowment, grant, or financial support from (an institution or person).","zh":"disendow 的过去式/过去分词：取消或剥夺（机构或个人）的捐赠基金、拨款或财政支持。"},"examples":[{"en":"The government disendowed several religious schools during the reform.","zh":"改革期间，政府取消了数所宗教学校的经费支持。"},{"en":"They were disendowed for failing to meet the funding requirements.","zh":"他们因未达到资助要求而被取消了经费支持。"}]}],"synonyms":["defunded","stripped of funding","deprived","dispossessed","divested"],"phonetic":"/ˌdɪs.ɛnˈdaʊd/","extraExplanation":["“disendow”常出现在法律、政治和教育语境中，尤其指政府或管理机构撤销对大学、教会/宗教机构、慈善组织等的基金或财产支持。","词根提示：endow（捐赠、资助）→ dis-（否定/去除）+ endow，意思是“去除资助”。在历史语境中，有时与国有化、财产收归国库、宗教机构资产调整等事件相关。"]}
{"word":"disendower","summary":{"en":"“Disendower” is a rare word meaning someone who disendows an institution—takes away its endowment or financial support.","zh":"“disendower”较罕见，指剥夺某机构捐赠基金/固定资助的人；也可对应动词含义“剥夺资助”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who takes away an endowment or financial support from an institution (especially a church, school, or charity)","zh":"指剥夺（尤其是教会、学校或慈善机构）捐赠基金/固定财产收益等经济资助的人"},"examples":[{"en":"Some critics called the reformers disendowers of the old church system.","zh":"一些批评者称这些改革者是在“剥夺”旧教会体系资助的人。"},{"en":"He was portrayed as a disendower for cutting the university’s traditional funding sources.","zh":"由于削减大学的传统资金来源，他被描绘成“剥夺资助者”。"}]},{"partOfSpeech":"vt.","definition":{"en":"to deprive (an institution) of an endowment or its income; to remove financial support or property given for a specific purpose","zh":"剥夺（某机构）的捐赠基金或其收益；取消为特定目的而提供的资金/财产支持"},"examples":[{"en":"The bill aimed to disendow the church by removing state support.","zh":"该法案旨在通过取消国家资助来剥夺教会的固定资助。"},{"en":"Some feared the new policy would disendow local charities.","zh":"有人担心新政策会剥夺地方慈善机构的资助来源。"}]}],"synonyms":["defunder","depriver","stripper (of funding)","withdrawer (of support)"],"phonetic":"/ˌdɪsɪnˈdaʊər/","extraExplanation":["“disendower”比较罕见，更常见的词是动词“disendow”以及名词“disendowment”。它常出现在历史、宗教与政治语境中，尤其与“取消教会国家资助/剥夺教会财产收益”等讨论相关。","拼写提示：你输入的“disendower”本身可以成立，但在现代英语里很少见；如果你想表达“剥夺资助的行为”，通常用“disendowment”。"]}
{"word":"disendowing","summary":{"en":"“Disendowing” means taking away an institution’s endowment, often in political or church-related contexts.","zh":"“disendowing”指剥夺机构的捐赠基金/财产支持，常见于政治或教会相关语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"present participle of “disendow”: taking away an endowment (especially money or property given to support an institution, often a church).","zh":"“disendow”的现在分词：剥夺（某机构，尤指教会）原有的捐赠基金或财产支持。"},"examples":[{"en":"The bill is aimed at disendowing the state church and redirecting its assets.","zh":"这项法案旨在剥夺国教的既有捐赠财产，并把资产重新分配。"},{"en":"They debated whether disendowing religious schools would be fair.","zh":"他们争论剥夺宗教学校的捐赠资金是否公平。"}]}],"synonyms":["depriving (of funds)","stripping (assets)","divesting"],"phonetic":"ˌdɪsɛnˈdaʊ","extraExplanation":["“disendow”常见于政治与历史语境，特别是英国/爱尔兰关于“国教（state church）是否应继续拥有国家支持与教会财产”的讨论中。它通常带有制度改革、财产重新分配的意味。","构词上：dis-（去除、取消）+ endow（捐赠、资助）。注意与“disenfranchise（剥夺选举权）”“disestablish（取消国教地位）”等政治法律词汇常一起出现。"]}
{"word":"disendowment","summary":{"en":"Disendowment means taking away an institution’s endowment, especially the removal of a church’s or charity’s permanently funded income or property.","zh":"Disendowment 指取消或剥夺某机构（尤指教会/慈善机构）的捐赠基金与长期专款支持。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of taking away an endowment (money, property, or income) from an institution, especially a church or charity; the process of removing financial support that was permanently set aside","zh":"（尤指教会、慈善机构等）被剥夺/取消捐赠基金（固定拨款、财产或收益）的行为；取消长期专款支持的过程"},"examples":[{"en":"The campaign called for the disendowment of the national church.","zh":"这场运动呼吁取消国家教会的捐赠基金。"},{"en":"Disendowment would force the charity to find new sources of funding.","zh":"取消捐赠基金将迫使该慈善机构寻找新的资金来源。"}]}],"synonyms":["removal of an endowment","divestment (in some contexts)","defunding (broader)"],"phonetic":"/ˌdɪsɪnˈdaʊmənt/","extraExplanation":["这个词常出现在英国与爱尔兰的历史与政治讨论中，尤其与“disestablishment（政教分离/取消国教地位）”并列：disestablishment强调地位与制度，disendowment强调财产与财政来源。","构词上：dis-（取消、剥夺）+ endowment（捐赠基金）。因此它通常带有强烈的政策与社会争议色彩。"]}
{"word":"disendows","summary":{"en":"“Disendows” means “takes away an endowment or official financial support,” especially from an institution or a church.","zh":"“Disendows”意为“剥夺（取消）捐赠基金或官方财政供养”，尤指对机构或教会。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to take away an endowment or financial support from (especially an institution, charity, or church)","zh":"剥夺（尤指机构、慈善组织或教会的）捐赠基金或经费支持"},"examples":[{"en":"The new policy disendows several small foundations that relied on public funding.","zh":"新政策取消了对数个依赖公共资金的小型基金会的资助。"},{"en":"The law disendows the organization, removing its long‑standing source of income.","zh":"该法律剥夺了该组织的基金来源，移除了其长期收入渠道。"}]},{"partOfSpeech":"vt.","definition":{"en":"(historical) to remove the official financial endowments of a church or religious body","zh":"（历史用法）取消教会或宗教团体的官方财政供养（教会“去资助化”）"},"examples":[{"en":"The reform movement argues that the state should disendow the national church.","zh":"改革运动主张国家应取消对国教的财政供养。"}]}],"synonyms":["defund","deprive","strip (of)","withdraw funding from"],"phonetic":"/ˌdɪs.ɛnˈdaʊ/","extraExplanation":["“disendows”是动词“disendow”的第三人称单数（he/she/it disendows）。词根“endow”意为“捐赠、资助（形成基金）”，前缀“dis-”表示“取消、剥夺”。","该词在英美语境里常见于讨论宗教与国家关系的历史/政治议题（例如是否应由国家资助某一教会）。现代写作中也可泛指取消对大学、基金会、艺术机构等的财政支持。"]}
{"word":"disenfranchise","summary":{"en":"“Disenfranchise” means to take away someone’s voting rights or other important rights and power.","zh":"disenfranchise 指“剥夺某人的投票权”，也可泛指剥夺重要权利与权力。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to take away someone’s right to vote or their political rights","zh":"剥夺某人的投票权或政治权利"},"examples":[{"en":"The law was designed to disenfranchise certain groups of voters.","zh":"这项法律旨在剥夺某些群体的投票权。"},{"en":"After the new rules, many people felt disenfranchised and stopped participating in elections.","zh":"新规定出台后，许多人觉得自己被剥夺了权利，于是不再参加选举。"}]},{"partOfSpeech":"vt.","definition":{"en":"to deprive someone of a right, privilege, or power (not only voting)","zh":"剥夺某人的权利、特权或权力（不一定只指投票）"},"examples":[{"en":"The policy could disenfranchise workers by limiting their ability to bargain collectively.","zh":"这项政策可能会通过限制集体谈判能力来削弱工人的权利。"},{"en":"High fees can effectively disenfranchise low-income students from certain programs.","zh":"高额费用可能会在事实上把低收入学生排除在某些项目之外。"}]}],"synonyms":["deprive","strip (of)","disqualify","exclude"],"phonetic":"/ˌdɪsɪnˈfræntʃaɪz/","extraExplanation":["词源上，dis- 表示“否定/去除”，enfranchise 来自 franchise（权利、特许权），整体就是“去除赋予的权利”。","在美国政治语境里，这个词常与 voting rights（投票权）、poll tax（人头税）、literacy test（识字测试）、felon disenfranchisement（剥夺重罪犯投票权）等话题相关。","相关词：disenfranchisement（名词：被剥夺权利/剥夺投票权）；enfranchise（动词：给予投票权）。"]}
{"word":"disenfranchised","summary":{"en":"Disenfranchised means deprived of voting rights or, more broadly, made to feel powerless and without a voice.","zh":"Disenfranchised 指“被剥夺选举权”，也可泛指“被边缘化、无力、没有话语权”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"deprived of the right to vote or to take part in the political process","zh":"被剥夺选举权或政治参与权的"},"examples":[{"en":"After the new law, many citizens felt disenfranchised and unable to influence local decisions.","zh":"新法律通过后，许多公民觉得自己被剥夺了政治参与权，无法影响地方决策。"},{"en":"In history, some groups were disenfranchised through unfair rules like poll taxes and literacy tests.","zh":"在历史上，一些群体曾因人头税和识字测试等不公平规则而被剥夺选举权。"}]},{"partOfSpeech":"adj.","definition":{"en":"made to feel powerless, ignored, or without a voice (not only in politics)","zh":"（不限于政治）感到无力、被忽视、没有发声渠道的"},"examples":[{"en":"Low pay and unpredictable schedules left workers feeling disenfranchised.","zh":"低薪和不稳定的排班让工人感到无力、没有话语权。"},{"en":"Some students become disenfranchised when they think the school never listens to them.","zh":"当学生觉得学校从不倾听他们时，有些人会变得“被边缘化”、缺乏参与感。"}]}],"synonyms":["deprived of the vote","voteless","politically excluded","marginalized","powerless","disempowered"],"phonetic":"/ˌdɪs.ɪnˈfræn.tʃaɪzd/","extraExplanation":["词源提示：dis- 表示“否定/去除”，enfranchise 来自 franchise（“特权、权利”，尤其指公民权/投票权）。所以 disenfranchised 字面意思是“被去除公民权/选举权”。","用法提醒：disenfranchised 常见于政治与社会讨论，语气较正式；在非政治语境里多指“被边缘化、缺乏发言权/影响力”。"]}
{"word":"disenfranchisement","summary":{"en":"Disenfranchisement means being deprived of the right to vote, and more generally being deprived of rights or power in society.","zh":"Disenfranchisement 指被剥夺选举权；也可泛指在社会中被剥夺权利、权力或参与机会。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of taking away someone’s right to vote, or the state of not being allowed to vote","zh":"（对某人）剥夺选举权；（状态）无选举权"},"examples":[{"en":"Laws that lead to disenfranchisement can reduce voter turnout.","zh":"导致剥夺选举权的法律会降低投票率。"},{"en":"After the conflict, many citizens feared disenfranchisement.","zh":"冲突之后，许多公民担心会被剥夺选举权。"}]},{"partOfSpeech":"n.","definition":{"en":"more broadly, the act of taking away someone’s rights, power, or opportunity to participate in society","zh":"（更广义）剥夺权利/权力；使失去参与社会的机会"},"examples":[{"en":"Some communities experience social and economic disenfranchisement.","zh":"一些社群经历社会与经济层面的权利被削弱。"},{"en":"She spoke about the disenfranchisement of workers in unsafe workplaces.","zh":"她谈到在不安全工作环境中工人权利被剥夺的问题。"}]}],"synonyms":["loss of voting rights","voter suppression (related)","marginalization (broader)","exclusion"],"phonetic":"/ˌdɪsɛnˈfræntʃaɪzmənt/","extraExplanation":["词源拆解有助记忆：dis-（去除、否定）+ enfranchise（赋予公民权/选举权；让……获得自由与权利）+ -ment（名词后缀）。因此 disenfranchisement 字面意思就是“把原本赋予的权利拿走”。","在美国语境中，这个词常与选举制度讨论相关，例如重罪犯投票权（felon disenfranchisement）、选民身份证要求（voter ID laws）、选区划分与投票可及性等话题。不同立场会对哪些政策构成“disenfranchisement”有不同解读。","相关词：enfranchisement（赋予选举权/公民权）；disenfranchise（v. 剥夺……的选举权）。近义表达（语境不同）：voter suppression（压制投票/阻碍投票）、marginalization（边缘化）。"]}
{"word":"disenfranchisements","summary":{"en":"“Disenfranchisements” means multiple instances of taking away voting rights or, more broadly, removing people’s power or ability to participate.","zh":"“disenfranchisements”指多起剥夺投票权的事件；也可泛指剥夺他人权利、权力或参与机会的做法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the acts or processes of taking away someone’s right to vote or participate in government (plural of “disenfranchisement”)","zh":"剥夺（他人）投票权或政治参与权的行为/过程（“disenfranchisement”的复数）"},"examples":[{"en":"Poll taxes and literacy tests were used as tools of disenfranchisements in some places.","zh":"人头税和识字测试在一些地方曾被用作剥夺投票权的工具。"},{"en":"The report documented multiple disenfranchisements affecting minority voters.","zh":"该报告记录了多起影响少数族裔选民的投票权被剥夺事件。"},{"en":"Activists organized campaigns to reverse disenfranchisements and restore voting access.","zh":"活动人士发起运动，反对剥夺投票权并恢复投票渠道。"}]},{"partOfSpeech":"n.","definition":{"en":"more generally, the acts of taking away someone’s rights, power, or ability to participate (for example in an organization)","zh":"（更广义）剥夺某人的权利、权力或参与机会（如在组织/机构中）的行为（复数）"},"examples":[{"en":"Employees complained about disenfranchisements that left them with no voice in decisions.","zh":"员工抱怨一些剥夺参与权的做法，让他们在决策中没有发言权。"},{"en":"The policy changes led to disenfranchisements of local communities in planning projects.","zh":"政策变化导致地方社区在项目规划中被剥夺参与权。"}]}],"synonyms":["loss of voting rights","voter suppression (related)","deprivation of rights","exclusion","disqualification (sometimes)"],"phonetic":"/ˌdɪsɛnˈfræntʃaɪzmənts/","extraExplanation":["“disenfranchisement”最常见于政治与公民权语境，核心是“拿走选举权/公民权”。在美国历史讨论中，它常与重建时期后的投票限制、以及民权运动中争取投票权的议题相关。","词形提示：dis-（否定/去除）+ enfranchise（赋予公民权/选举权）+ -ment（名词后缀，表示过程或结果）。因此整体含义是“去除被赋予的权利”。","与之相关的常见搭配：voter disenfranchisement（选民被剥夺投票权）、mass disenfranchisement（大规模剥夺投票权）、restore enfranchisement（恢复选举权/公民权）。"]}
{"word":"disenfranchises","summary":{"en":"“Disenfranchises” means takes away someone’s right to vote, or more broadly, removes their rights or voice.","zh":"“disenfranchises”指剥夺投票权；也可泛指剥夺权利或话语权。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to take away someone’s right to vote (especially by law or policy).","zh":"（尤指通过法律或政策）剥夺某人的投票权。"},"examples":[{"en":"Some laws effectively disenfranchise people who cannot afford certain fees.","zh":"一些法律实际上会让付不起某些费用的人失去投票权。"},{"en":"The new rule disenfranchises many citizens living abroad.","zh":"这项新规定剥夺了许多海外公民的投票权。"}]},{"partOfSpeech":"vt.","definition":{"en":"to deprive someone of rights, power, or a meaningful voice in a system (often used more broadly than voting).","zh":"（更广义）剥夺某人的权利、权力或在某个体系中的发声权。"},"examples":[{"en":"The policy disenfranchises small communities by excluding them from decision-making.","zh":"这项政策把小社区排除在决策之外，等于剥夺了他们的发声权。"},{"en":"Workers felt disenfranchised when management ignored their concerns.","zh":"当管理层无视他们的担忧时，员工觉得自己被剥夺了话语权。"}]}],"synonyms":["deprive (of the vote/rights)","strip (of rights)","disqualify","exclude"],"phonetic":"/ˌdɪsɪnˈfræn(t)ʃaɪzɪz/","extraExplanation":["“disenfranchise”常用于政治与公民权利语境：enfranchise 原意是“赋予公民权/选举权”，前缀 dis- 表示“去除、取消”，因此 disenfranchise 就是“取消（某人的）公民权/选举权”。","在美国历史与新闻语境中，这个词经常出现在关于投票权限制的讨论里（例如对特定群体设置更高的投票门槛）。使用时要注意它带有强烈的价值判断色彩，通常暗示不公或不民主。"]}
{"word":"disenfranchising","summary":{"en":"Disenfranchising means taking away people’s right to vote or denying them a meaningful political voice.","zh":"Disenfranchising 指剥夺人们的投票权，或让他们失去实质性的政治发声与参与权。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Present participle of disenfranchise) taking away someone’s right to vote or their legal/political rights.","zh":"（disenfranchise 的现在分词）剥夺某人的投票权，或剥夺其法律/政治权利。"},"examples":[{"en":"The new rule is disenfranchising thousands of voters who lack the required ID.","zh":"这项新规定正在剥夺成千上万没有所需身份证件的选民的投票权。"},{"en":"Critics say the policy is disenfranchising marginalized communities.","zh":"批评者说这项政策正在剥夺边缘群体的政治权利。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Adjectival use) causing people to lose the right to vote or a voice in public decisions.","zh":"（形容词用法）导致人们失去投票权或在公共决策中失去发声权的。"},"examples":[{"en":"They protested what they called a disenfranchising law.","zh":"他们抗议他们所称的“剥夺权利的”法律。"},{"en":"A disenfranchising system can make citizens feel powerless.","zh":"一个剥夺权利的体制会让公民感到无力。"}]}],"synonyms":["depriving (of voting rights)","disqualifying","excluding","stripping (rights)"],"phonetic":"/ˌdɪs.ɪnˈfræn.tʃaɪ.zɪŋ/","extraExplanation":["“disenfranchise”常见于政治与法律语境，核心含义是“剥夺选举权”。历史上常用于描述某些群体被排除在投票之外（例如因种族、性别、财产门槛、识字测试等）。现代讨论中也会用于更广义的“让人失去政治影响力/话语权”。","词形提示：dis-（否定/去除）+ enfranchise（赋予公民权/选举权）。相关名词：disenfranchisement（被剥夺选举权/权利）。"]}
{"word":"disengage","summary":{"en":"Disengage means to withdraw involvement/attention, or to separate things that are connected (and in some contexts, to break contact in a confrontation).","zh":"disengage 指从参与或注意力中抽身，或把连接/咬合在一起的东西分开；也可指在冲突中脱离接触。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to stop taking part in something; to withdraw your attention, effort, or involvement","zh":"停止参与；抽身；不再投入注意力/精力"},"examples":[{"en":"She tried to disengage from the argument and calm down.","zh":"她试着从争吵中抽身，让自己冷静下来。"},{"en":"It’s healthy to disengage from social media sometimes.","zh":"有时候从社交媒体抽离一下是健康的。"}]},{"partOfSpeech":"v.","definition":{"en":"to separate or unhook things that are connected or locked together","zh":"（把连接在一起的东西）分开；松开；解开"},"examples":[{"en":"Press the button to disengage the seat belt.","zh":"按下按钮解开安全带。"},{"en":"The gears disengage when you take your foot off the clutch.","zh":"你松开离合器踏板时，齿轮会脱开。"}]},{"partOfSpeech":"v.","definition":{"en":"to end combat or a direct confrontation; to break contact (often used in military/police contexts)","zh":"停止交战；脱离接触（常用于军事/执法语境）"},"examples":[{"en":"The units disengaged and moved to safer positions.","zh":"部队脱离接触，转移到更安全的位置。"},{"en":"The officer ordered everyone to disengage and step back.","zh":"警官命令所有人脱离冲突并后退。"}]}],"synonyms":["withdraw","detach","disconnect","unhook","unfasten","back off"],"phonetic":"/ˌdɪs.ɪnˈɡeɪdʒ/","extraExplanation":["“dis-”表示“分开/去除”，而“engage”有“参与、吸引、接合（机械）”等意思，所以“disengage”常见两大核心用法：①心理/社交层面的“抽身、停止投入”；②机械/结构层面的“脱开、分离”。在写作或新闻里，“disengage”比“stop”更正式，常暗示从一种纠缠或连接中“解脱出来”。","常见搭配：disengage from（从……抽身/脱离）；disengage a gear / the clutch（使齿轮/离合器脱开）；emotionally disengage（情感抽离）。近义词（按语境）：withdraw（退出）、detach（分离/冷淡）、unhook/unfasten（解开）、back off（退让）。"]}
{"word":"disengaged","summary":{"en":"Disengaged means either not interested/involved, or (for machines) disconnected/not in gear.","zh":"disengaged 可指对事不投入/不感兴趣，也可指（机械）脱开连接、未啮合。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not interested, not involved, or emotionally distant; not paying attention.","zh":"不感兴趣的；不投入的；情感上疏离的；心不在焉的。"},"examples":[{"en":"He looked disengaged during the meeting and kept checking his phone.","zh":"他在会议上显得心不在焉，一直看手机。"},{"en":"Some students become disengaged when the class feels too fast or too hard.","zh":"当课程节奏太快或太难时，一些学生会变得不投入。"}]},{"partOfSpeech":"adj.","definition":{"en":"Disconnected or not connected to a machine/part; not in gear or not operating together.","zh":"（机械/装置）脱开连接的；未啮合的；未联动的。"},"examples":[{"en":"Make sure the power is off and the motor is disengaged before you clean it.","zh":"清洁前确保断电，并让马达处于脱开状态。"},{"en":"The bike’s gears felt disengaged, so it wouldn’t pedal smoothly.","zh":"自行车齿轮像是没啮合，踩起来不顺。"}]}],"synonyms":["uninterested","detached","uninvolved","indifferent","disconnected","unengaged"],"phonetic":"/ˌdɪsɪnˈɡeɪdʒd/","extraExplanation":["词源和构词：dis- 表示“否定/相反”，engage 表示“参与/吸引/啮合”，disengaged 就是“未参与/不被吸引”或“脱开啮合”。","语气提示：形容人时常带有轻微负面评价（比如冷淡、缺乏兴趣），但在教育/职场语境也可较中性地描述“参与度低”。"]}
{"word":"disengagedness","summary":{"en":"Disengagedness means a state of not being interested or involved.","zh":"Disengagedness 指“不感兴趣或不参与的状态”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being disengaged; lack of interest, involvement, or emotional connection","zh":"不投入的状态；缺乏兴趣、参与或情感连结"},"examples":[{"en":"His disengagedness in class made it hard for him to learn.","zh":"他在课堂上的不投入，让他很难学进去。"},{"en":"The manager noticed a growing disengagedness among the staff after the policy change.","zh":"政策调整后，经理注意到员工的不投入感在增加。"},{"en":"Her disengagedness wasn’t rudeness—she was just exhausted.","zh":"她的不投入并不是无礼——她只是太累了。"}]}],"synonyms":["disengagement","detachment","apathy","lack of engagement","withdrawal"],"phonetic":"ˌdɪsɪnˈɡeɪdʒdnəs","extraExplanation":["“disengagedness”并不算常见词，更常见的说法是“disengagement”（不参与/脱离投入）或“lack of engagement / apathy”（缺乏投入/冷漠）。","构词上它来自形容词“disengaged”（不投入的、脱离的）加名词后缀“-ness”，强调“某种状态/性质”。常用于描述学习、工作、关系中的“投入度很低”。"]}
{"word":"disengagement","summary":{"en":"Disengagement means withdrawing involvement or commitment; in technical contexts, it means separating from contact or operation.","zh":"disengagement 指减少参与或投入、逐渐抽离；在技术语境中也指解除接触或联动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of becoming less involved, emotionally connected, or committed; withdrawal of attention or participation","zh":"（参与、情感或投入的）减少与抽离；不再投入、退出"},"examples":[{"en":"Student disengagement often shows up as silence, missed homework, or lack of eye contact.","zh":"学生的脱离投入常表现为沉默、不交作业或缺乏眼神交流。"},{"en":"After the reorganization, many employees felt a slow disengagement from the company’s mission.","zh":"重组之后，许多员工对公司的使命逐渐失去投入感。"}]},{"partOfSpeech":"n.","definition":{"en":"(military/technical) the act of separating or freeing something from engagement, contact, or operation","zh":"（军事/技术）脱离接触；分离；解除啮合/联动"},"examples":[{"en":"The pilot reported disengagement from the target and returned to base.","zh":"飞行员报告已脱离目标并返回基地。"},{"en":"For safety, press the button for rapid disengagement of the machine.","zh":"为安全起见，按下按钮使机器快速解除联动。"}]}],"synonyms":["withdrawal","detachment","disconnecting","separation"],"phonetic":"/ˌdɪs.ɪnˈɡeɪdʒ.mənt/","extraExplanation":["词形提示：disengagement 来自动词 disengage（脱离、退出），常见搭配有 social/employee/student disengagement（社会/员工/学生的脱离投入）。在职场与教育语境中，它多强调“心理上的抽离”，不一定是正式离职或退学。","近义侧重点：withdrawal 强调“退缩/撤回”；detachment 更偏“冷淡的超然”；apathy 更偏“漠不关心”。disengagement 常指从原本的投入状态慢慢“抽身”。"]}
{"word":"disengagements","summary":{"en":"“Disengagements” is the plural of “disengagement,” meaning acts or instances of pulling away, withdrawing, or becoming less involved; it’s also used for military separation and mechanical uncoupling.","zh":"“disengagements”是“disengagement”的复数，指多次/多种“脱离、抽身、减少投入”的行为或情况；也可用于军事上的脱离接触，以及机械上的脱开/分离。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"acts of disengaging; the process or moments of pulling away, withdrawing, or becoming less involved (physical, emotional, or social).","zh":"脱离、抽身；指从某事/某人中退出、拉开距离或减少投入的行为/过程（可指身体、情感或社会参与）。"},"examples":[{"en":"After months of stress, her disengagement from social media helped her sleep better.","zh":"在压力持续几个月后，她选择从社交媒体中抽身，睡眠变好了。"},{"en":"The therapist noticed signs of disengagement during family discussions.","zh":"治疗师在家庭讨论中注意到一些“疏离/抽离”的迹象。"}]},{"partOfSpeech":"n.","definition":{"en":"(business/organization) withdrawals or reductions in participation, support, or effort—often used when talking about employees, customers, or voters.","zh":"（商业/组织语境）参与度、支持度或投入度的下降/撤出，常用于员工、客户或选民等。"},"examples":[{"en":"Employee disengagements can lower productivity and increase turnover.","zh":"员工的“低投入/不投入”会降低生产力并提高离职率。"},{"en":"The report warned about voter disengagements among young adults.","zh":"报告警告说年轻成年人出现选民参与度下降的情况。"}]},{"partOfSpeech":"n.","definition":{"en":"(military) separations from an enemy or from combat; breaking off contact after an engagement.","zh":"（军事）脱离接触；指交战后与敌方拉开距离、停止接触或撤出战斗。"},"examples":[{"en":"The commander ordered disengagements at dusk to avoid further losses.","zh":"指挥官下令在黄昏时脱离接触，以避免进一步伤亡。"}]},{"partOfSpeech":"n.","definition":{"en":"(mechanics) instances of a mechanism being uncoupled or released (for example, gears no longer meshing).","zh":"（机械）脱开/分离的情况；例如齿轮不再啮合、装置被解除联接。"},"examples":[{"en":"Sudden disengagements of the clutch can damage the transmission.","zh":"离合器突然脱开可能会损坏变速器。"}]}],"synonyms":["withdrawals","pullbacks","retreats","detachment","uncouplings"],"phonetic":"ˌdɪsɛnˈɡeɪdʒmənts","extraExplanation":["“disengagement(s)”既可以是中性（有助于休息、设定界限），也可能是负面（冷漠、摆烂、缺乏投入）。语境很关键：workplace disengagement 通常偏负面；disengage from social media 往往偏正面。","常见搭配：emotional disengagement（情感抽离）、employee disengagement（员工低投入）、military disengagement（军事脱离接触）、disengagement strategy/plan（退出/脱离策略）。"]}
{"word":"disengages","summary":{"en":"“Disengages” means separates/releases something (often a mechanism) or withdraws from involvement.","zh":"“disengages”表示（使）脱开/解除连接（常用于机械），或从活动、争论、冲突中抽身退出。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to separate or free (something) from something else; to release or detach","zh":"（使）脱开；（使）分离；解除（连接/啮合）"},"examples":[{"en":"He disengages the seat belt before getting out of the car.","zh":"他下车前先解开安全带。"},{"en":"The clutch disengages the engine from the wheels.","zh":"离合器使发动机与车轮脱开（解除啮合）。"}]},{"partOfSpeech":"v.","definition":{"en":"to stop being involved in an activity, conversation, or conflict; to withdraw","zh":"退出；不再参与；抽身（离开争论/冲突/活动）"},"examples":[{"en":"She politely disengages from the argument and changes the subject.","zh":"她礼貌地从争论中抽身，转移了话题。"},{"en":"The troops disengage and move back to a safer position.","zh":"部队脱离接触，撤到更安全的位置。"}]}],"synonyms":["detach","release","disconnect","withdraw","pull back"],"phonetic":"ˌdɪsɪnˈɡeɪdʒ","extraExplanation":["“disengages”是动词“disengage”的第三人称单数一般现在时：He/She/It disengages。描述习惯性动作、规律或事实（如机械工作原理）时很常用。"]}
{"word":"disengaging","summary":{"en":"“Disengaging” means pulling away or separating (as in disengaging from a task or a machine part), and it can also describe something that feels dull or emotionally distant.","zh":"“disengaging”可指“脱离/抽身/解除啮合”，也可形容“缺乏吸引力、让人难以投入或显得疏离”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “disengage”) separating or becoming free from something; stopping being involved or connected.","zh":"（动词disengage的现在分词）使分离/脱离；不再参与或不再连接。"},"examples":[{"en":"She is disengaging from the project to focus on her health.","zh":"她正在从这个项目中抽身，专注于健康。"},{"en":"Disengaging the clutch helps the car change gears smoothly.","zh":"踩下离合器（使其脱开）能让汽车更顺畅地换挡。"}]},{"partOfSpeech":"adj.","definition":{"en":"not interesting or emotionally involving; failing to hold attention (often used about writing, speech, or people’s attitude).","zh":"不吸引人的；让人难以投入的（常形容文章、讲话或态度）。"},"examples":[{"en":"The lecture became disengaging after the first ten minutes.","zh":"讲座在前十分钟后就变得不太吸引人了。"},{"en":"His disengaging tone made it seem like he didn’t care.","zh":"他那种疏离、冷淡的语气让人觉得他并不在乎。"}]}],"synonyms":["withdrawing","detaching","uncoupling","uninvolving","dull","uninteresting"],"phonetic":"/ˌdɪsɪnˈɡeɪdʒɪŋ/","extraExplanation":["“disengage”由 dis-（表示“分开/取消”）+ engage（参与、啮合）组成，所以在不同语境里常见两大用法：①“抽身、不再参与”（工作、人际关系、注意力）；②“脱开/解除啮合”（机械、设备、刹车/离合、按钮等）。","在关系或沟通语境中，disengaging 往往暗示“情感上不投入、刻意拉开距离”，语气比单纯的 “uninterested（不感兴趣）” 更强一点。"]}
{"word":"disengirdle","summary":{"en":"Disengirdle means to remove something that encircles (like a belt), or figuratively to free someone/something from restraint.","zh":"Disengirdle 指解下环绕之物（如腰带），也可作比喻义：使摆脱束缚。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove a girdle, belt, or something that encircles (to unfasten what is wrapped around)","zh":"解开（腰带/束带等）；去掉环绕在……周围的东西"},"examples":[{"en":"She disengirdled her cloak and hung it by the door.","zh":"她解开斗篷的束带，把斗篷挂在门边。"},{"en":"The knight disengirdled his sword belt before entering the hall.","zh":"骑士进大厅前解下了佩剑的腰带。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative, literary) to free or release from something that binds, restrains, or surrounds","zh":"（比喻/文学用法）使摆脱束缚；解放、松开限制"},"examples":[{"en":"The new law helped disengirdle the press from strict controls.","zh":"新法律帮助媒体摆脱了严格管控的束缚。"},{"en":"Travel can disengirdle the mind from old habits.","zh":"旅行能让人从旧习惯的束缚中解脱出来。"}]}],"synonyms":["unbelt","unfasten","remove","free","release","unfetter"],"phonetic":"ˌdɪsɛnˈɡɝdəl","extraExplanation":["这个词很少见，语感偏古雅/文学化。由 dis-（解除、去掉）+ engirdle（用带子围住/束住）构成。日常英语更常用的表达是 unbelt（解下腰带）、unfasten（解开）、remove（移除）、free/release（解放/释放）。"]}
{"word":"disenjoy","summary":{"en":"Disenjoy is a rare verb meaning to stop enjoying something, or (very rarely) to spoil someone’s enjoyment.","zh":"disenjoy 是个罕见动词，意思是“不再享受某事”，或（更罕见）“剥夺/破坏某人的乐趣”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare) to stop enjoying something; to lose the pleasure you used to get from it.","zh":"（罕见）不再享受某事；失去曾经的乐趣。"},"examples":[{"en":"After months of the same routine, I began to disenjoy my favorite game.","zh":"同样的日常过了几个月后，我开始不再享受我最喜欢的游戏。"},{"en":"She didn’t hate the job, but she slowly disenjoyed it.","zh":"她并不讨厌那份工作，但渐渐地不再享受它了。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Very rare) to take away someone’s enjoyment of something; to spoil the pleasure of it for them.","zh":"（非常罕见）剥夺某人的乐趣；让某事变得不再令人愉快。"},"examples":[{"en":"Harsh criticism can disenjoy the experience for beginners.","zh":"严厉的批评会让初学者的体验变得不再愉快。"},{"en":"Don’t let one rude comment disenjoy your evening.","zh":"别让一句无礼的话毁了你今晚的好心情。"}]}],"synonyms":["no longer enjoy","stop enjoying","lose interest in","take the fun out of","spoil","ruin"],"phonetic":"/ˌdɪsɪnˈdʒɔɪ/","extraExplanation":["“disenjoy”由前缀 dis-（表示“取消、相反、去除”）+ enjoy 组成，但在现代英语里非常不常用，很多母语者也觉得别扭。日常表达更自然的说法通常是：stop enjoying / no longer enjoy / lose interest in（不再喜欢）、take the fun out of（把乐趣拿走）、ruin/spoil（毁掉兴致）。","如果你在较老的文本或刻意的文学写作里看到它，往往是为了强调“曾经喜欢、后来不喜欢”的变化。"]}
{"word":"disenjoyment","summary":{"en":"“Disenjoyment” means a lack or loss of enjoyment; it’s a rare word in modern English.","zh":"“disenjoyment”指缺乏或失去乐趣；在现代英语中较罕见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lack of enjoyment; absence of pleasure or satisfaction.","zh":"不享受；缺乏乐趣（或满足感）。"},"examples":[{"en":"After the injury, he felt a deep disenjoyment in activities he once loved.","zh":"受伤之后，他对曾经热爱的活动感到深深的“失去乐趣”。"},{"en":"Her disenjoyment was obvious, even though she tried to smile.","zh":"尽管她努力微笑，她的不愉快仍然很明显。"}]},{"partOfSpeech":"n.","definition":{"en":"the loss of enjoyment; becoming less enjoyable over time.","zh":"乐趣的消退；变得不再那么好玩（或不再令人愉快）。"},"examples":[{"en":"The constant pressure at work led to the disenjoyment of his hobbies.","zh":"工作中持续的压力导致他对爱好的乐趣逐渐消退。"},{"en":"They discussed the disenjoyment of travel when every trip turns into a schedule.","zh":"他们讨论了当旅行变成“赶行程”时，旅行乐趣如何消退。"}]}],"synonyms":["lack of enjoyment","loss of enjoyment","displeasure","dissatisfaction","unhappiness"],"phonetic":"/ˌdɪsɪnˈdʒɔɪmənt/","extraExplanation":["“disenjoyment”在现代英语中非常少见，更多时候人们会说“lack of enjoyment / no enjoyment / loss of enjoyment”，或用更自然的词如“displeasure（不快）”“dissatisfaction（不满）”。","词形上是前缀“dis-（表示相反、去除）+ enjoyment（享受）”，字面意思就是“去掉享受”。在写作中使用会显得偏生僻或带一点刻意的文风。"]}
{"word":"disenmesh","summary":{"en":"Disenmesh means to free someone or something from entanglement or complicated involvement.","zh":"Disenmesh 指把人或事物从缠绕或复杂纠葛中解脱出来。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to free or remove someone or something from being tangled, trapped, or caught in something (literally or figuratively)","zh":"（使）从缠绕、困住或纠葛中解脱出来（可指字面或比喻）"},"examples":[{"en":"The rescue team worked carefully to disenmesh the climber from the ropes.","zh":"救援队小心翼翼地把登山者从绳索缠绕中解救出来。"},{"en":"It took months of therapy for her to disenmesh herself from an unhealthy relationship.","zh":"她花了好几个月的心理咨询，才从一段不健康的关系纠葛中抽离出来。"},{"en":"We need a clear plan to disenmesh the company from legal disputes.","zh":"我们需要一个明确的计划，让公司从法律纠纷中脱身。"}]}],"synonyms":["untangle","free","extricate","unhook","disentangle"],"phonetic":"/ˌdɪs.ɛnˈmɛʃ/","extraExplanation":["词源上可理解为 dis-（“去除、分开”）+ enmesh（“使卷入网中/使陷入”）。因此 disenmesh 的核心感觉是“把某人/某物从网状缠绕或复杂牵连中拉出来”。","常见搭配：disenmesh someone/something from…；disenmesh yourself from…（强调主动抽离）。在心理学/家庭系统语境里，也可指从“过度纠缠的家庭关系（enmeshment）”中建立界限。"]}
{"word":"disennoble","summary":{"en":"Disennoble means to strip someone of nobility or to degrade their rank or honor.","zh":"Disennoble 指剥夺某人的贵族身份，或贬损其地位与荣誉。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove someone’s noble status or privileges; to strip of nobility","zh":"剥夺（某人）的贵族身份或特权；使不再具有贵族地位"},"examples":[{"en":"The king threatened to disennoble any lord who betrayed the crown.","zh":"国王威胁要剥夺任何背叛王权的领主的贵族身份。"},{"en":"In the novel, the hero is disennobled and forced to live as a commoner.","zh":"在小说里，主角被剥夺贵族身份，被迫以平民身份生活。"}]},{"partOfSpeech":"vt.","definition":{"en":"to degrade someone’s rank or dignity; to make less honorable","zh":"贬损（某人）的地位或尊严；使变得不体面、失去荣耀"},"examples":[{"en":"Cruel gossip can disennoble a respected person in the public eye.","zh":"恶意流言会在公众眼中贬损一位受尊敬的人。"},{"en":"He felt the lie would disennoble his family name.","zh":"他觉得那个谎言会玷污家族名声。"}]}],"synonyms":["strip (someone) of a title","deprive","degrade","dethrone (context-dependent)","disgrace"],"phonetic":"/ˌdɪsɪˈnoʊbəl/","extraExplanation":["该词很少用于日常口语，多见于历史叙述、文学作品或带有讽刺色彩的评论中。","词源可理解为 dis-（否定/去除）+ ennoble（使高贵、使成为贵族），字面意思就是“去高贵化”。","与其相近但更常见的表达有：strip (someone) of title（剥夺头衔）、deprive (someone) of nobility（剥夺贵族身份）、degrade / disgrace（使蒙羞/贬损）。"]}
{"word":"disennui","summary":{"en":"Disennui means to relieve or remove boredom/ennui (a feeling of weary dissatisfaction).","zh":"disennui 指“消解或去除无聊/倦怠感（ennui）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to free someone from boredom or a feeling of tired dissatisfaction; to relieve ennui","zh":"使某人摆脱无聊、倦怠或厌倦感；消解“倦怠感（ennui）”"},"examples":[{"en":"A short walk outside can disennui you after hours of studying.","zh":"学习了好几个小时后，出去散步一会儿就能帮你摆脱无聊与倦怠。"},{"en":"She tried new recipes to disennui herself during the long winter.","zh":"漫长的冬天里，她尝试新食谱来让自己不再感到厌倦。"}]}],"synonyms":["relieve","divert","entertain","amuse","alleviate boredom"],"phonetic":"/ˌdɪs.ɑnˈwiː/","extraExplanation":["这个词比较少见，常见于较文艺或幽默的写作中。它由前缀 dis-（表示“去除、摆脱”）+ ennui（法语借词，意为“倦怠、厌烦”）组合而成，字面意思就是“去除倦怠”。日常表达里更常用 relieve boredom / shake off boredom / cure one’s ennui 等。"]}
{"word":"disenorm","summary":{"en":"“Disenorm” is not a standard English word; it’s likely a misspelling (often of “enormous” or “abnormal”).","zh":"“disenorm”不是标准英语单词；很可能是拼写错误（常见可能是“enormous”或“abnormal”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a non-English/technical form. Common intended words include “enormous” (very large) or “abnormal” (not normal).","zh":"不是标准英语单词。很可能是拼写错误，或来自其他语言/专业领域的形式。常见可能想表达的是“enormous”（巨大的）或“abnormal”（不正常的）。"},"examples":[{"en":"I couldn’t find “disenorm” in standard dictionaries—did you mean “enormous”?","zh":"在常见词典里找不到“disenorm”——你是不是想写“enormous”？"},{"en":"The building was enormous.","zh":"那栋建筑非常巨大。"},{"en":"That result is abnormal; we should check the data.","zh":"那个结果不正常；我们应该检查数据。"}]}],"synonyms":["enormous","huge","massive","abnormal","unusual","irregular"],"phonetic":"/ˌdɪsɪˈnɔrm/","extraExplanation":["“dis-”在英语里常见是否定或相反的前缀（如 dishonest=不诚实，disconnect=断开）。但它不能随意加在任何词前面；“disenorm”不符合常见构词习惯，因此很像拼写或输入错误。","如果你能提供看到它的句子/上下文（在哪篇文章、哪一行），我可以更准确判断它可能对应的词（例如 enormous, disharmony, dissonant, abnormal 等）。"]}
{"word":"disenrol","summary":{"en":"Disenrol means to officially withdraw or remove someone from enrollment in a course, program, or membership.","zh":"Disenrol 指正式退课/撤销注册，或将某人从课程、项目或会员登记中取消。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to officially remove someone (or yourself) from a course, program, school, or membership list; to cancel an enrollment","zh":"（正式）将某人（或自己）从课程/项目/学校/会员名单中取消注册；退课；撤销登记"},"examples":[{"en":"I decided to disenrol from the class because my schedule changed.","zh":"因为时间安排变了，我决定从这门课退课。"},{"en":"The university may disenrol students who do not pay their tuition on time.","zh":"如果学生未按时缴纳学费，大学可能会将其取消注册。"}]},{"partOfSpeech":"vi.","definition":{"en":"to withdraw your own enrollment (used especially in British English)","zh":"（尤用于英式英语）退掉自己的学籍/注册；主动退出（课程、项目等）"},"examples":[{"en":"If you disenrol before the deadline, you can get a refund.","zh":"如果你在截止日期前退课，可以退款。"}]}],"synonyms":["withdraw","drop (a class)","unenroll","remove","cancel enrollment"],"phonetic":"/ˌdɪs.ɪnˈroʊl/","extraExplanation":["“disenrol”多见于英式拼写；美式英语更常写作“disenroll”。两者意思相同，发音也基本一致。","常用于教育与行政语境（退课、取消学籍、取消会员资格等）。在实际通知或邮件中，也常见更口语的说法：“drop a class / withdraw from a course”。"]}
{"word":"disenroll","summary":{"en":"“Disenroll” means to remove someone (or yourself) from an official enrollment, like a class, school, or insurance plan.","zh":"“disenroll”指（使）从某个正式注册/报名项目中退出或被注销，如退课、退学、退保等。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove someone from a program, class, school, insurance plan, or membership; to stop being officially registered","zh":"（使）从课程、学校、保险计划或会员资格等中退选/退保/注销；（使）不再正式注册"},"examples":[{"en":"I had to disenroll from the course because my work schedule changed.","zh":"因为工作时间变了，我不得不从这门课退选。"},{"en":"The company will disenroll employees from the plan if they don’t submit the required form.","zh":"如果员工不提交所需表格，公司会把他们从该计划中注销（退保/取消参保）。"}]},{"partOfSpeech":"vi.","definition":{"en":"to withdraw or cancel your own enrollment; to stop being enrolled","zh":"（自己）退选/退出注册；取消自己的报名/参保"},"examples":[{"en":"You can disenroll online before the deadline.","zh":"你可以在截止日期前在线退选。"},{"en":"She disenrolled from the insurance plan after changing jobs.","zh":"她换工作后从那个保险计划中退保了。"}]}],"synonyms":["withdraw","drop (a class)","unenroll","remove (from a program)","cancel enrollment"],"phonetic":"/ˌdɪsɪnˈroʊl/","extraExplanation":["“dis-”表示“去除/取消”，enroll表示“注册/报名”。合在一起就是“取消注册”。在美国语境里，disenroll常见于学校选课系统、医疗保险（如Medicare/Medicaid或公司福利计划）以及会员服务等正式场景。","与withdraw（退课/撤回）、drop（退课/退出，较口语）、unenroll（同义但较少见）意思接近；disenroll更偏正式、行政用语。"]}
{"word":"disensanity","summary":{"en":"A rare, nonstandard word meaning “becoming sane again” or “removing insanity.”","zh":"少见的非标准词，表示“恢复理智”或“去除疯狂/精神失常”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A nonstandard, coined word that suggests “the removal of insanity” or “returning to sanity.”","zh":"非标准的自造词，含义通常指“去除疯狂/精神失常”或“恢复理智”。"},"examples":[{"en":"After therapy and time, he joked that he had finally reached disensanity.","zh":"经过治疗和时间，他开玩笑说自己终于达到了“disensanity”（恢复理智）。"},{"en":"The author uses disensanity to describe a character’s slow shift from chaos to clarity.","zh":"作者用“disensanity”来描写角色从混乱逐渐走向清明的过程。"}]}],"synonyms":["return to sanity","regain one’s sanity","recovery","come to one’s senses"],"phonetic":"/ˌdɪsɪnˈsænɪti/","extraExplanation":["“disensanity”不是常见英语词，通常见于网络、创作写作或个人自造词。它看起来由前缀 dis-（表示“去除/相反”）+ insanity（疯狂、精神失常）组合而成，因此多半被理解为“去疯狂化”“变回正常/理智”。在正式写作中更常用的表达是 recovery, return to sanity, regaining one’s sanity 等。"]}
{"word":"disenshroud","summary":{"en":"Disenshroud means to uncover or reveal something by removing what covers it.","zh":"disenshroud 指“揭开遮蔽物，使其显露”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove a shroud or covering from something; to uncover or reveal what was hidden","zh":"去掉（裹尸布/遮盖物）；揭开、显露原本被遮住的事物"},"examples":[{"en":"The archaeologists disenshrouded the statue carefully, revealing its carved face.","zh":"考古学家小心地揭开雕像的覆盖物，露出了雕刻的面孔。"},{"en":"Morning light seemed to disenshroud the valley from mist.","zh":"晨光仿佛把山谷从薄雾中揭开。"}]}],"synonyms":["uncover","reveal","unveil","unshroud"],"phonetic":"/ˌdɪs.ɪnˈʃraʊd/","extraExplanation":["这是一个非常少见、偏文学/诗意的动词，由 dis-（去除、否定）+ en-（使……处于某种状态）+ shroud（裹尸布；遮蔽物）构成。整体含义就是“把遮蔽去掉，使之显露”。在现代英语里更常见的表达是 uncover, reveal, unshroud。"]}
{"word":"disenslave","summary":{"en":"Disenslave means to free someone from slavery or end their enslavement.","zh":"disenslave 指“使某人摆脱奴役/获得自由”，强调结束被奴役的状态。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to free someone from slavery; to end a person’s condition of being enslaved","zh":"使（某人）摆脱奴役；使获得自由（结束被奴役的状态）"},"examples":[{"en":"The new law aimed to disenslave people who had been held as property.","zh":"这项新法律旨在让那些曾被当作财产占有的人获得自由。"},{"en":"Activists worked for years to disenslave workers trapped in forced labor.","zh":"活动人士多年努力，解救被困于强迫劳动中的工人。"}]}],"synonyms":["emancipate","free","liberate","release"],"phonetic":"/ˌdɪs.ɪnˈsleɪv/","extraExplanation":["“disenslave”由前缀 dis-（表示“去除、解除”）+ enslave（奴役）构成，字面意思就是“解除奴役”。","在现代英语中，这个词相对少见；更常见的表达是 “free (someone) from slavery / emancipate”。不过在强调“从被奴役状态中解放出来”这一过程时，用“disenslave”会显得更直接、力度更强。","语境上常与历史上的奴隶制度、废奴运动（abolitionism）、或当代的“现代奴隶制”（如人口贩运、强迫劳动）讨论相关。"]}
{"word":"disensoul","summary":{"en":"Disensoul is a rare verb meaning “to make soulless” or “to deprive of a soul/spirit,” often used poetically.","zh":"Disensoul 是一个罕见动词，意为“使失去灵魂/精神、使变得无灵”，多用于诗性或修辞语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to deprive (someone or something) of a soul; to make soulless or spiritually empty (often used in a poetic or dramatic way).","zh":"使（某人/某物）失去灵魂；使变得无灵、麻木或精神空洞（多为诗性/戏剧性用法）。"},"examples":[{"en":"She felt that years of war had disensouled the country.","zh":"她觉得多年的战争让这个国家失去了灵魂。"},{"en":"He wrote that greed can disensoul a person from the inside.","zh":"他写道，贪婪会从内里让一个人变得无魂无魄。"}]},{"partOfSpeech":"vt.","definition":{"en":"to remove the soul from (a body) or separate soul and body (a rare, archaic sense).","zh":"把灵魂从（身体）中移走；使灵肉分离（罕见、古旧义）。"},"examples":[{"en":"In older writing, the verb appears in lines about death that “disensouls” the body.","zh":"在较早的作品里，这个动词会出现在描写死亡“使身体失魂”的句子中。"}]}],"synonyms":["dehumanize","deadening","numb","deaden","strip of spirit","make soulless"],"phonetic":"/ˌdɪs.ɛnˈsoʊl/","extraExplanation":["“disensoul”非常少见，主要出现在较老的英文文本或带有强烈修辞色彩的写作中。现代英语里更常用的表达是 “make someone/something soulless”“strip someone of their spirit”“deadening” 等。","构词上可理解为 dis-（去除、剥夺）+ ensoul（赋予灵魂、使有灵魂）。因此它带有强烈的道德/精神评价，常用来批判战争、贪婪、压迫、机械化生活等让人“失去人性与热情”的力量。"]}
{"word":"disensure","summary":{"en":"A rare verb meaning to cancel or remove insurance coverage.","zh":"一个罕见动词，表示取消或移除保险保障。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare) to remove or cancel insurance coverage for someone or something; to make not insured.","zh":"（罕见）取消某人或某物的保险；使其不再受保。"},"examples":[{"en":"The company decided to disensure high-risk properties to reduce losses.","zh":"公司决定取消高风险房产的保险，以减少损失。"},{"en":"If you stop paying premiums, the insurer may disensure the policy.","zh":"如果你停止缴纳保费，保险公司可能会取消该保单的保险保障。"}]}],"synonyms":["uninsure","cancel the insurance","drop coverage","remove coverage"],"phonetic":"/ˌdɪsɪnˈʃʊr/","extraExplanation":["“disensure”在现代英语中非常少见；实际写作与日常表达里更常用的是“uninsure”“cancel the insurance”“drop coverage”。","词形上看，dis- 表示“去除、取消”，ensure 在这里与“insurance（保险）”相关，但这种构词方式并不常见，因此读者可能会觉得生硬或误以为拼写错误。"]}
{"word":"disentail","summary":{"en":"Disentail means to legally remove an entail from property, freeing it from fixed inheritance restrictions; sometimes it also means to free something from complicated ties.","zh":"Disentail 指在法律上解除财产的限定继承，使其摆脱固定的继承限制；有时也可引申为解除牵连、摆脱束缚。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Law) To remove an entail from (property), so it can be freely sold or inherited outside a fixed family line.","zh":"（法律）解除（财产的）限定继承，使其不再必须按家族固定继承规则传承，可自由出售或转让。"},"examples":[{"en":"The heir went to court to disentail the estate so he could sell part of the land.","zh":"继承人向法院申请解除该庄园的限定继承，以便出售部分土地。"},{"en":"A special legal process was required to disentail the property.","zh":"解除该财产的限定继承需要特定的法律程序。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Figurative, less common) To free (something) from restrictions or complicated ties; to disentangle.","zh":"（引申义，较少见）使（某事）摆脱束缚或复杂牵连；理清、解开纠葛。"},"examples":[{"en":"The reform aimed to disentail the system from outdated rules.","zh":"这项改革旨在使制度摆脱过时规则的束缚。"},{"en":"It took time to disentail the project from earlier promises.","zh":"要花时间把这个项目从先前的承诺牵连中理清出来。"}]}],"synonyms":["remove an entail","bar the entail","unsettle (property)","free","unfetter","disentangle"],"phonetic":"ˌdɪsɛnˈteɪl","extraExplanation":["“Entail（限定继承）”常见于英国旧式财产继承制度：地产被法律“绑定”在特定家族血脉/继承顺序中，继承人往往不能随意出售或改立遗嘱。Disentail 就是把这种绑定解除。","在英国文学里，涉及庄园与婚姻的情节常会提到“entail”，例如简·奥斯汀《傲慢与偏见》中班纳特家的地产被限定继承，影响了女儿们的婚姻选择。"]}
{"word":"disentailment","summary":{"en":"Disentailment is the legal act of removing an entail so property can be sold or inherited more freely.","zh":"Disentailment 指通过法律解除限定继承，使财产能更自由地出售或按更灵活的方式继承。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of ending an entail (a legal arrangement that forces property—especially land—to pass to specific heirs), so the owner can sell or otherwise dispose of it freely","zh":"（法律）解除“限定继承/世袭财产限制”（entail）的行为，使土地或财产不再必须按既定继承顺序传给特定继承人，从而可以自由出售或处分"},"examples":[{"en":"The family’s disentailment of the estate allowed them to sell part of the land to pay off debts.","zh":"家族对庄园进行了解除限定继承，使他们能出售部分土地来偿还债务。"},{"en":"After disentailment, the property could be divided among the children rather than passing to one heir.","zh":"解除限定继承后，财产可以在孩子们之间分割，而不必只传给一位继承人。"}]}],"synonyms":["removal of an entail","breaking an entail","de-entailment","release from entail"],"phonetic":"/ˌdɪsɛnˈteɪlmənt/","extraExplanation":["“Entail（限定继承）”在英美历史上常用于保持贵族家族土地完整，防止庄园被分割或卖掉；“disentailment”就是把这种限制解除。","在英国文学中，尤其是以乡绅阶层为背景的作品（如简·奥斯汀《傲慢与偏见》）里，类似的财产继承规则常推动情节发展：因为财产被“entail”给男性继承人，女性亲属可能面临失去住所与经济保障。","现代日常英语里很少用到“disentailment”，更多出现在法律史、家族财产史或文学/历史讨论中。"]}
{"word":"disentangle","summary":{"en":"Disentangle means to untwist or separate something that is tangled, or to clarify complicated facts/relationships by separating the parts.","zh":"disentangle 指把缠绕的东西解开，或把复杂的事实/关系拆开来理清、区分。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to separate something that is twisted, knotted, or mixed up so it becomes clear and orderly","zh":"把缠绕、打结或混在一起的东西解开；理清"},"examples":[{"en":"She carefully disentangled the necklace from her hair.","zh":"她小心地把项链从头发里解开。"},{"en":"It took a few minutes to disentangle the earphones in my pocket.","zh":"我花了几分钟才把口袋里的耳机线解开。"}]},{"partOfSpeech":"vt.","definition":{"en":"to understand and explain something complicated by separating its parts (such as ideas, events, or relationships)","zh":"理清复杂问题；把（想法、事件或关系）拆开来分析说明"},"examples":[{"en":"The lawyer tried to disentangle the facts from the rumors.","zh":"律师试图把事实与谣言区分开来。"},{"en":"It’s hard to disentangle what he really meant from how he said it.","zh":"很难把他真正的意思与他说话的方式区分开来。"},{"en":"The book disentangles the causes of the conflict step by step.","zh":"这本书一步步理清了冲突的原因。"}]},{"partOfSpeech":"vt.","definition":{"en":"to free yourself from an awkward situation, commitment, or relationship","zh":"（使自己）脱身；摆脱尴尬处境、承诺或关系"},"examples":[{"en":"He managed to disentangle himself from the argument and leave calmly.","zh":"他设法从争吵中脱身，冷静离开。"},{"en":"She’s trying to disentangle herself from a project that keeps expanding.","zh":"她正在努力从不断扩张的项目中抽身。"}]}],"synonyms":["untangle","unravel","separate","extricate","clarify"],"phonetic":"/ˌdɪs.ɪnˈtæŋ.ɡəl/","extraExplanation":["词源提示：dis- 表示“分开/去除”，entangle 表示“使缠住、使纠缠”。所以 disentangle 字面意思就是“把缠住的东西解开”。","常见搭配：disentangle A from B（把A与B分开/区分开）；disentangle yourself from…（从……中脱身）。","语体与语感：既可用于具体的“解开线团/项链”，也常用于抽象的“理清事实、关系、因果”。在写作中用它会显得较正式、较书面。"]}
{"word":"disentangled","summary":{"en":"Disentangled means freed from a tangle, or (figuratively) made clearer and separated from confusion.","zh":"disentangled 表示“已解开缠结的”，也可比喻“理清、从混乱中分离出来的”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Past participle of “disentangle”) to free someone or something from a tangle; to separate things that are twisted or stuck together.","zh":"（“disentangle”的过去分词）使……解开缠结；把缠在一起或卡住的东西分开。"},"examples":[{"en":"The fisherman disentangled the net from the rocks.","zh":"渔夫把渔网从岩石上解开。"},{"en":"I finally disentangled my earphones from my bag.","zh":"我终于把耳机从包里解开了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not tangled anymore; freed from knots or confusion.","zh":"已解开的；不再缠结的；（比喻）不再混乱的。"},"examples":[{"en":"After a few minutes, the strings were disentangled and ready to use.","zh":"过了几分钟，绳子就解开了，可以使用了。"},{"en":"By the end of the meeting, the project roles felt more disentangled.","zh":"会议结束时，项目分工感觉更清晰、不再混乱。"}]}],"synonyms":["untangled","unraveled","freed","separated","clarified"],"phonetic":"ˌdɪsɪnˈtæŋɡəld","extraExplanation":["“disentangle”由前缀 dis-（表示“分开、去除”）+ entangle（使缠住）组成，所以“disentangled”既可指真实的“解开缠绕”，也常用作比喻：把复杂的人际关系、问题、观点“理清/剥离开”。","常见搭配：disentangled from（从……中解开/摆脱），如 “disentangled from a complicated situation（从复杂局面中抽身并理清）”。"]}
{"word":"disentanglement","summary":{"en":"Disentanglement means freeing or separating something from a tangled or complicated connection.","zh":"Disentanglement 指把某物从缠绕或复杂牵连中解开并分离出来的过程或结果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of freeing someone or something from something complicated, mixed up, or closely connected","zh":"解开纠缠；脱离牵连（把人或事从复杂缠绕、混杂或紧密关联中解脱出来的过程）"},"examples":[{"en":"The disentanglement of the fishing line took several minutes.","zh":"把钓鱼线解开纠缠花了好几分钟。"},{"en":"After the merger, the two companies began the slow disentanglement of their finances.","zh":"并购之后，两家公司开始缓慢地梳理并分离彼此的财务。"},{"en":"Therapy helped her with the disentanglement of guilt from responsibility.","zh":"心理咨询帮助她把内疚与责任区分开来。"}]},{"partOfSpeech":"n.","definition":{"en":"a situation in which complicated connections have been successfully separated or untied","zh":"（已完成的）解开纠缠的结果；拆分后的状态"},"examples":[{"en":"The final disentanglement came when both sides signed separate contracts.","zh":"当双方签署了各自独立的合同后，最终的拆分才算完成。"},{"en":"They celebrated the disentanglement from a toxic partnership.","zh":"他们庆祝终于摆脱了一段有毒的合作关系。"}]}],"synonyms":["untangling","separation","unraveling","decoupling","extrication"],"phonetic":"/ˌdɪs.ɛnˈtæŋ.ɡəl.mənt/","extraExplanation":["词源提示：dis-（分开、去除）+ entangle（使缠绕）+ -ment（名词后缀）。所以它字面意思就是“把缠在一起的东西分开”。","常见语境：除了真实的“绳子/线缆缠住”，也常用于抽象关系，如商业拆分（finances, operations）、政治脱钩/脱离（alliances）、以及情绪与观念的“分离”（guilt vs. responsibility）。","近义词辨析：untangling 更口语、偏“把线解开”；separation 更中性；decoupling 常用于经济/技术领域，强调“解除耦合、降低依赖”。"]}
{"word":"disentanglements","summary":{"en":"Disentanglements are processes of untangling something physically or separating complicated connections in a clearer way.","zh":"disentanglements 指把东西解开/分开，或（比喻）理清并拆解复杂关系与问题的过程（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the acts or processes of freeing something from knots, twists, or things that are mixed together","zh":"（把……）从缠绕、打结或混杂中解开、分离的过程/行为"},"examples":[{"en":"After the move, the disentanglements of cables took longer than packing.","zh":"搬家后，整理并解开各种电线花的时间比打包还久。"},{"en":"The rescue team began disentanglements of the fishing nets from the turtle’s flippers.","zh":"救援队开始把渔网从海龟的鳍上解开。"}]},{"partOfSpeech":"n.","definition":{"en":"the processes of separating complicated relationships, responsibilities, or ideas so they become clearer or independent","zh":"（比喻）理清并分开复杂关系、责任或想法，使其更清楚或各自独立的过程"},"examples":[{"en":"Their divorce involved several legal disentanglements over property and debts.","zh":"他们离婚牵涉到房产和债务等多项法律上的理清与分割。"},{"en":"The report offers disentanglements of the causes behind rising costs.","zh":"这份报告梳理并拆解了成本上升背后的原因。"},{"en":"Leaving the project required careful disentanglements from shared commitments.","zh":"退出该项目需要谨慎地从共同承诺中抽身并理清关系。"}]}],"synonyms":["untanglings","separations","unravelings","clarifications","resolutions"],"phonetic":"/ˌdɪsɪnˈtæŋɡəlmənts/","extraExplanation":["“disentanglements”是名词复数，对应单数“disentanglement”。常见于较正式或学术语境，强调“需要一步步拆开/理清的复杂性”。","词源结构：dis-（去除、相反）+ entangle（使缠住）+ -ment（名词后缀，表示过程/结果）。"]}
{"word":"disentangler","summary":{"en":"A disentangler is someone or something that helps separate tangled things or clarify confusing situations.","zh":"disentangler 指能“解开缠结”或“理清混乱”的人或物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who disentangles something; someone who helps separate things or ideas that are mixed up or confusing.","zh":"解开纠结的人；帮助把混在一起、难以分清的事物或想法理清的人。"},"examples":[{"en":"The mediator acted as a disentangler during the heated discussion.","zh":"在激烈的讨论中，调解员扮演了“理清纠纷的人”的角色。"},{"en":"As a teacher, she’s a great disentangler of difficult grammar rules.","zh":"作为老师，她很擅长把复杂的语法规则讲清楚、理顺。"}]},{"partOfSpeech":"n.","definition":{"en":"A tool, device, or method used to separate tangled things (such as wires, threads, or hair).","zh":"解缠工具；用来把打结的东西（如电线、线团或头发）分开的工具、装置或方法。"},"examples":[{"en":"He bought a small cable disentangler for his desk.","zh":"他买了一个桌面用的小型理线器（解缠工具）。"},{"en":"This conditioner works like a disentangler for long hair.","zh":"这种护发素对长发有“解结/顺滑”的效果。"}]}],"synonyms":["problem-solver","mediator","clarifier","detangler","untangler"],"phonetic":"/ˌdɪs.ɪnˈtæŋ.ɡlɚ/","extraExplanation":["“disentangler”来自动词“disentangle”（解开缠结、理清），加上表示“做某事的人/物”的后缀“-er”。因此它既可以指“人”（把问题理清的人），也可以指“物”（帮助解结的工具/方法）。在日常英语中更常见的是动词“disentangle”和名词“detangler”（尤其指护发产品）。"]}
{"word":"disentangles","summary":{"en":"“Disentangles” means untangles something, clarifies a confusing situation, or frees someone from involvement.","zh":"“disentangles”意为解开缠绕之物、理清复杂情况，或使人从牵连中摆脱。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to separate something that is tangled, twisted, or knotted so it becomes clear or free again","zh":"把（纠缠、缠绕、打结的东西）解开；理顺"},"examples":[{"en":"She disentangles the necklace chain carefully.","zh":"她小心地把项链链子解开。"},{"en":"The technician disentangles the wires behind the computer.","zh":"技术员把电脑后面的电线理顺。"}]},{"partOfSpeech":"vt.","definition":{"en":"to explain or sort out a confusing situation, story, or set of ideas so it becomes easier to understand","zh":"理清（复杂情况/故事/想法）；把（混乱之处）梳理清楚"},"examples":[{"en":"The lawyer disentangles the facts from the rumors.","zh":"律师把事实和谣言区分开来并理清。"},{"en":"This chapter disentangles the key concepts step by step.","zh":"这一章一步步把关键概念梳理清楚。"}]},{"partOfSpeech":"vt.","definition":{"en":"to free yourself from a difficult relationship, responsibility, or involvement","zh":"使自己摆脱（棘手的关系/责任/牵连）"},"examples":[{"en":"He disentangles himself from the argument and leaves the room.","zh":"他让自己从争论中抽身，离开了房间。"},{"en":"The company disentangles itself from a risky partnership.","zh":"公司从一段高风险的合作关系中抽身。"}]}],"synonyms":["untangles","unravels","separates","clarifies","sorts out","extricates"],"phonetic":"/ˌdɪsɪnˈtæŋɡəlz/","extraExplanation":["“disentangles”是动词“disentangle”的第三人称单数（he/she/it disentangles）。常见搭配：disentangle the wires/cords（理顺电线/绳子）、disentangle the truth/facts（理清真相/事实）、disentangle oneself from…（从……中抽身）。","词形提示：前缀dis-表示“去除、反向”，entangle表示“使缠住/使卷入”。合起来就是“把缠住的东西解开；把卷入的关系理清/摆脱”。"]}
{"word":"disentangling","summary":{"en":"“Disentangling” means untangling something physically or sorting out complicated ideas or causes; it can also be the -ing form of “disentangle.”","zh":"“disentangling”表示把东西解开缠绕，或（比喻）把复杂的想法/原因厘清；也可作“disentangle”的 -ing 形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of freeing something from a knot, tangle, or physical mess","zh":"（把东西）从打结、缠绕或一团乱中解开、理顺的过程"},"examples":[{"en":"She spent ten minutes disentangling the necklace from her hair.","zh":"她花了十分钟把项链从头发里解开。"},{"en":"I’m disentangling the wires behind the desk.","zh":"我在把桌子后面的电线理顺。"}]},{"partOfSpeech":"n.","definition":{"en":"separating or clarifying complicated ideas, causes, or problems so they can be understood or handled","zh":"（比喻）把复杂的想法、原因或问题拆开厘清，使其更容易理解或处理"},"examples":[{"en":"The report focuses on disentangling fact from rumor.","zh":"这份报告重点在于把事实和谣言区分开来。"},{"en":"Therapy helped him with disentangling his feelings about the breakup.","zh":"心理咨询帮助他理清自己对分手的感受。"},{"en":"The researchers are disentangling the effects of diet and exercise.","zh":"研究人员正在区分饮食和运动各自的影响。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “disentangle”: freeing from tangles; separating and clarifying","zh":"“disentangle”的现在分词：解开缠绕；拆分并厘清"},"examples":[{"en":"I’m still disentangling the cables—give me a minute.","zh":"我还在理顺这些线——给我一分钟。"},{"en":"The team is disentangling the different factors behind the accident.","zh":"团队正在厘清事故背后的不同因素。"}]}],"synonyms":["untangling","unraveling","separating","sorting out","clarifying"],"phonetic":"ˌdɪsɪnˈtæŋɡəlɪŋ","extraExplanation":["词根提示：dis- 表示“去除/反向”，entangle 表示“使缠住、使纠缠”。disentangle 就是“把缠住的东西解开”，也常用于抽象含义：把复杂问题拆开、理清关系。","常见搭配：disentangle A from B（把A从B中分离/区分出来）；disentangle the causes/effects/issues（厘清原因/影响/问题）。"]}
{"word":"disenter","summary":{"en":"A dissenter is someone who openly disagrees with an official or majority view; historically, it can mean a non–Church of England Protestant.","zh":"dissenter 指公开持不同意见的人；在英国历史语境中也可指不属于英国国教会的非国教徒。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who disagrees with an official idea, policy, or the majority opinion, especially publicly","zh":"（尤指公开）持不同意见的人；反对者"},"examples":[{"en":"Some dissenter voices warned that the new rule would harm small businesses.","zh":"一些反对的声音警告说，新规定会伤害小企业。"},{"en":"She became a dissenter in her department by questioning the usual way of doing things.","zh":"她因质疑部门里惯常的做法而成了“异议者”。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) a Protestant who did not belong to the Church of England","zh":"（历史）不从属于英国国教会的新教徒；非国教徒"},"examples":[{"en":"In British history, dissenters often faced limits on schooling and public jobs.","zh":"在英国历史上，非国教徒常常在受教育和担任公职方面受到限制。"},{"en":"The writer came from a dissenter family with strong views on religious freedom.","zh":"这位作家出身于非国教徒家庭，对宗教自由有强烈的看法。"}]}],"synonyms":["critic","opponent","protester","nonconformist"],"phonetic":"/dɪˈsɛntər/","extraExplanation":["你输入的“disenter”更常见的正确拼写是 **dissenter**（中间有双写 s）。","词根来自拉丁语：**dis-**（分开、不同）+ **sentire**（感觉、认为），核心意思是“持不同看法的人”。","在现代语境中它多指政治、社会或组织中的“异议者”；在英国历史语境中则常指“不属于英国国教会的非国教徒”。"]}
{"word":"disenthral","summary":{"en":"Disenthral means to free someone or something from control or bondage, including freeing the mind from limiting beliefs.","zh":"disenthral 指使某人/某事摆脱控制或束缚，也可指使思想摆脱限制性的观念。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to free someone or something from control, bondage, or a power that limits their freedom","zh":"使（某人/某事）摆脱控制、束缚或压迫；解放"},"examples":[{"en":"The reforms were meant to disenthral the country from military rule.","zh":"这些改革旨在使国家摆脱军人统治。"},{"en":"Education can disenthral people from fear and misinformation.","zh":"教育能使人们摆脱恐惧和错误信息的束缚。"}]},{"partOfSpeech":"vt.","definition":{"en":"to free the mind from a strong influence such as superstition, prejudice, or obsession","zh":"使思想摆脱迷信、偏见或痴迷等强烈影响"},"examples":[{"en":"She tried to disenthral herself from the belief that failure defined her.","zh":"她努力让自己摆脱“失败定义人生”的信念。"},{"en":"The book aims to disenthral readers from outdated stereotypes.","zh":"这本书旨在让读者摆脱过时的刻板印象。"}]}],"synonyms":["free","liberate","emancipate","release","unshackle"],"phonetic":"/ˌdɪs.ɪnˈθrɔl/","extraExplanation":["“disenthral”是较少见的拼写形式，更常见的是“disenthrall”。两者意思相同。词根来自“enthrall”（使受奴役/使着迷），加上前缀“dis-”（去除、解除）表示“解除束缚/摆脱控制”。","这个词偏正式、书面语，常用于谈政治压迫、社会控制，或“思想被某种观念束缚”的语境。"]}
{"word":"disenthrall","summary":{"en":"Disenthrall means to free someone from strong control, fascination, or misleading influence.","zh":"disenthrall 指使人从强烈的控制、迷恋或误导性影响中解脱出来。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To free someone (or yourself) from being strongly controlled or fascinated by something; to release from a “spell” of influence.","zh":"使（某人或自己）摆脱强烈的控制或迷恋；从某种“迷惑/支配”中解放出来。"},"examples":[{"en":"She finally disenthralled herself from an unhealthy relationship.","zh":"她终于让自己摆脱了一段不健康的关系的控制。"},{"en":"Reading new perspectives helped him disenthrall his mind from old prejudices.","zh":"阅读新的观点帮助他把思想从旧偏见中解放出来。"},{"en":"The documentary aims to disenthrall viewers from misinformation.","zh":"这部纪录片旨在让观众摆脱错误信息的影响。"}]}],"synonyms":["free","release","liberate","disillusion","unshackle"],"phonetic":"/ˌdɪs.ɛnˈθrɔl/","extraExplanation":["词源上由 dis-（表示“去除、否定”）+ enthrall（使着迷/使受制于）构成。enth[r]all 原义与“束缚、使成奴隶”相关，因此 disenthrall 带有“从束缚或迷惑中解放”的意味。","语体偏正式，常用于写作或演讲中，表达“摆脱某种强大影响”（如偏见、宣传、成瘾、关系控制等），比常见的 free/release 更强调“此前被深深迷住或支配”。"]}
{"word":"disenthralled","summary":{"en":"“Disenthralled” means freed from fascination or control; no longer captivated. It’s also the past form of “disenthrall.”","zh":"“disenthralled”表示从迷恋或控制中解脱，不再被迷住；也可作动词“disenthrall”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"freed from being controlled, fascinated, or emotionally “held” by someone or something; no longer captivated or dependent","zh":"从他人或某事的控制、迷恋或束缚中解脱出来；不再被吸引或牵制"},"examples":[{"en":"After months of obsession, she finally felt disenthralled and could think clearly again.","zh":"痴迷了几个月后，她终于觉得自己解脱了，思路也清晰了。"},{"en":"He became disenthralled from the cult’s influence and reconnected with his family.","zh":"他摆脱了邪教的影响，重新与家人建立联系。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of “disenthrall”: to free someone (or yourself) from control, fascination, or bondage","zh":"“disenthrall”的过去式/过去分词：使（某人或自己）摆脱控制、迷惑或束缚"},"examples":[{"en":"The documentary disenthralled many viewers from the conspiracy theory.","zh":"那部纪录片让许多观众不再被阴谋论迷惑。"},{"en":"She was disenthralled by education and new experiences.","zh":"她借由教育与新的经历获得了解放。"}]}],"synonyms":["freed","liberated","released","unshackled","unbound","disillusioned"],"phonetic":"/ˌdɪs.ɪnˈθrɔld/","extraExplanation":["“disenthrall”相对较文学化，常见于较正式或书面语中。词根里有“enthrall”（迷住、奴役、使受控制），加上前缀“dis-”表示“解除、摆脱”。","在文学语境中，它常用来表达从“迷恋/崇拜/思想控制”中醒来，带有一种“恢复自主与清醒”的意味。"]}
{"word":"disenthralling","summary":{"en":"Disenthralling means “freeing from control or fascination,” and can also (rarely) mean “not captivating.”","zh":"disenthralling 常指“使人从控制/迷恋中解放出来”，少见情况下也可指“没有吸引力的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"freeing someone from strong control, fascination, or mental/spiritual “bondage.”","zh":"使人摆脱强烈控制、迷恋或精神/思想“束缚”的；解放性的。"},"examples":[{"en":"Therapy can be a disenthralling process, helping people step out of harmful patterns.","zh":"心理治疗可能是一个“解缚”的过程，帮助人们走出有害的模式。"},{"en":"Reading different viewpoints was disenthralling—it loosened my attachment to a single story.","zh":"阅读不同观点很有“解缚”效果——它松动了我对单一叙事的执着。"}]},{"partOfSpeech":"v.","definition":{"en":"(present participle) freeing someone from control or fascination.","zh":"（现在分词）正在使某人摆脱控制或迷恋；正在解放。"},"examples":[{"en":"She is disenthralling herself from the need to please everyone.","zh":"她正在把自己从“必须讨好所有人”的需求中解放出来。"},{"en":"The teacher focused on disenthralling students from the idea that mistakes are shameful.","zh":"老师着力让学生摆脱“犯错可耻”的观念。"}]},{"partOfSpeech":"adj.","definition":{"en":"(rare) not captivating; failing to hold interest.","zh":"（少见）不吸引人的；不够引人入胜的。"},"examples":[{"en":"Some reviewers called the pacing disenthralling, though others found it subtle.","zh":"一些评论者说节奏不够抓人，但也有人觉得它很细腻。"}]}],"synonyms":["liberating","freeing","emancipating","unshackling","disillusioning"],"phonetic":"/ˌdɪs.ɪnˈθrɔl.ɪŋ/","extraExplanation":["“disenthralling”来自动词 disenthrall：dis-（去除、解除）+ enthrall（使着迷、使受制于）。en- 有“使进入某种状态”的意思，thrall 原指“奴仆/被束缚的人”。因此 disenthrall 的核心意象是“解除枷锁、从迷恋或控制中被释放”。","在现代语境里，它常用于心理、观念、社会影响等抽象层面的“解放”（例如摆脱有毒关系、成见、信息操控），语气比简单的 “free” 更带有“从强烈吸引或支配中醒来”的意味。"]}
{"word":"disenthrallment","summary":{"en":"Disenthrallment means liberation—being freed from control or a powerful fascination.","zh":"Disenthrallment 指“解脱/解放”——从控制或强烈迷恋中摆脱出来。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of freeing someone (or yourself) from control, dependence, or a powerful attraction; liberation","zh":"使（他人或自己）摆脱控制、依赖或强烈迷恋的行为或过程；解放"},"examples":[{"en":"Her disenthrallment from social media took months, but she felt calmer afterward.","zh":"她花了几个月才从社交媒体的“上瘾/迷恋”中解脱出来，但之后感觉更平静了。"},{"en":"The novel describes a young man’s disenthrallment from a charismatic leader.","zh":"这部小说描写了一位年轻人如何从一位极具魅力的领袖控制中解脱出来。"}]}],"synonyms":["liberation","emancipation","release","freedom","deliverance"],"phonetic":"/ˌdɪsɛnˈθrɔlmənt/","extraExplanation":["词源上可拆为 dis-（“去除、摆脱”）+ enthrall（“奴役、迷住”）。因此 disenthrallment 不仅指政治或社会意义上的“解放”，也常指从某种迷恋、依赖或心理束缚中“清醒过来、挣脱出来”。","语体偏正式、书面语较多。在日常表达中，更常用 freedom / liberation / breaking free / getting out of someone’s grip 等。"]}
{"word":"disenthralls","summary":{"en":"“Disenthralls” means “frees (someone) from control or bondage,” often in a formal or literary sense.","zh":"“Disenthralls”意为“使（某人）摆脱控制或束缚”，常见于正式或文学语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to free someone from being controlled, trapped, or strongly influenced (often used in a literary or formal style)","zh":"使某人摆脱控制、束缚或强烈影响（多用于文学或正式语境）"},"examples":[{"en":"Education can disenthrall people from fear and superstition.","zh":"教育可以使人们摆脱恐惧和迷信的束缚。"},{"en":"She tried to disenthrall herself from the need for constant approval.","zh":"她努力让自己摆脱对持续被认可的需求。"}]},{"partOfSpeech":"vt.","definition":{"en":"to release someone from captivity or servitude; to set free","zh":"解放；使脱离奴役或囚禁"},"examples":[{"en":"The new law disenthralls workers from unfair contracts.","zh":"这项新法律使工人摆脱不公平合同的束缚。"}]}],"synonyms":["free","liberate","release","unshackle","emancipate"],"phonetic":"/ˌdɪs.ɪnˈθrɔl/","extraExplanation":["“disenthralls”是动词“disenthrall”的第三人称单数现在时（he/she/it disenthralls）。更常见的原形是“disenthrall”，在现代英语里整体偏文学/正式，用来强调“从精神控制或社会束缚中解放”。","词根上可理解为 dis-（去除、相反）+ enthrall（使着迷/使受制于…）。因此它既可指“从迷恋中醒来”，也可指“从压迫中获得自由”。"]}
{"word":"disenthralment","summary":{"en":"Disenthralment means liberation—being freed from control, domination, or a strong influence.","zh":"Disenthralment 指“解放、摆脱控制或支配”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of freeing someone or something from control, domination, or a powerful influence; liberation","zh":"使某人/某物摆脱控制、支配或强烈影响的行为或过程；解放"},"examples":[{"en":"For her, education was a kind of disenthralment from fear and dependency.","zh":"对她来说，教育是一种让人摆脱恐惧与依赖的解放。"},{"en":"The novel portrays the hero’s disenthralment from a corrupt court.","zh":"这部小说描写了主人公从腐败宫廷中获得解放的过程。"}]}],"synonyms":["liberation","emancipation","release","deliverance","freedom"],"phonetic":"/ˌdɪs.ɛnˈθrɔl.mənt/","extraExplanation":["这个词非常少见，更常见的拼写是 disenthrallment（含义相同）。两者都来自动词 disenthrall / disen-thrall，核心意象是“从 enthrall（奴役、迷住、控制）中解脱出来”。","语体偏正式、文学性较强，常用于强调“摆脱思想束缚、权力控制或迷恋”的抽象意义，而不太用于日常口语。"]}
{"word":"disenthrone","summary":{"en":"Disenthrone means to remove a ruler from power, or figuratively to take someone’s top position.","zh":"disenthrone 指废黜君主、推翻统治者；也可比喻“取代某人的头把交椅”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove a king, queen, or ruler from the throne; to end their rule","zh":"废黜君主；把统治者赶下台；终止其统治"},"examples":[{"en":"The revolution aimed to disenthrone the king and create a new government.","zh":"这场革命旨在废黜国王并建立新政府。"},{"en":"After years of unrest, the dictator was finally disenthroned.","zh":"多年动荡之后，这位独裁者终于被赶下台。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative) to remove someone from a position of top power, importance, or popularity","zh":"（比喻）让某人失去至高地位、权力或最受欢迎的地位"},"examples":[{"en":"The new champion disenthroned last year’s winner in a close match.","zh":"新冠军在一场激烈的比赛中让去年的冠军失去王座。"},{"en":"One viral hit can disenthrone an artist from the top of the charts.","zh":"一首爆红歌曲就能让一位歌手从榜首“被拉下王座”。"}]}],"synonyms":["depose","dethrone","oust","overthrow","unseat"],"phonetic":"/ˌdɪs.ɪnˈθroʊn/","extraExplanation":["词源上可拆成 dis-（表示“去除、相反”）+ enthrone（使登基、使即位）。因此 disenthrone 的核心画面就是“把人从王座上拉下来”。","常见搭配：disenthrone a king/queen/monarch（废黜君主）；be disenthroned（被废黜）。写作中也常用于体育、商业、排行榜等语境，表示“取代第一名/头把交椅”。"]}
{"word":"disenthroned","summary":{"en":"“Disenthroned” describes a ruler who has been removed from power, or the act of removing someone from a throne (literally or figuratively).","zh":"“disenthroned”指君主被废黜、失去王位；也可指把某人从至高地位上拉下台（可字面也可比喻）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Removed from a throne; no longer a king/queen or ruler.","zh":"被废黜王位的；不再是君主或统治者的。"},"examples":[{"en":"The disenthroned king lived in exile for years.","zh":"这位被废黜的国王流亡多年。"},{"en":"After the revolution, the disenthroned monarch lost all political power.","zh":"革命之后，这位被废黜的君主失去了所有政治权力。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Past form of “disenthrone”) To remove someone from a position of great power or importance (often political, sometimes figurative).","zh":"（disenthrone 的过去式/过去分词）把某人从至高权力或重要地位上赶下台（常指政治上，也可引申）。"},"examples":[{"en":"The rebels disenthroned the emperor and declared a republic.","zh":"叛军废黜了皇帝并宣布成立共和国。"},{"en":"In the market, a new brand finally disenthroned the longtime leader.","zh":"在市场上，一个新品牌终于把长期的领头者拉下了“王座”。"}]}],"synonyms":["deposed","dethroned","ousted","overthrown"],"phonetic":"/ˌdɪs.ɪnˈθroʊnd/","extraExplanation":["词源上由 dis-（表示“去除/否定”）+ enthrone（使登基、使上王位）构成，因此核心意思就是“把某人从王位上撤下来”。","这个词常用于历史、政治叙述（如君主制被推翻），也常作比喻用法，表示“取代某个长期的第一名/权威”。写作里会带一点正式、历史感的语气。"]}
{"word":"disenthronement","summary":{"en":"Disenthronement means removing a monarch from the throne or losing royal power.","zh":"disenthronement 指“废黜君主/赶下王位”，也可指“失去王权”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of removing a king, queen, or other ruler from the throne; the loss of royal power","zh":"废黜君主；把国王/女王等统治者赶下王位的行为；失去王权"},"examples":[{"en":"The revolution led to the king’s disenthronement.","zh":"这场革命导致国王被废黜。"},{"en":"In the novel, the prince fears his own disenthronement.","zh":"在小说里，王子担心自己会被废黜。"}]}],"synonyms":["dethronement","deposition","overthrow","toppling"],"phonetic":"/ˌdɪsɛnˈθroʊnmənt/","extraExplanation":["“disenthronement”来自动词“disenthrone”（把……赶下王位），其中 dis- 表示“去除/取消”，throne 指“王位”。常见于历史、政治评论或文学叙述中，语气较正式。","常见近义表达：“deposition (of a monarch)”（废黜君主）、“overthrow”或“dethronement”。其中 dethronement 更常用，disenthronement 更少见但意思相同。"]}
{"word":"disenthroning","summary":{"en":"Disenthroning means removing a ruler from the throne, or more generally forcing someone out of a position of great power.","zh":"disenthroning 指“废黜君主、推翻统治者”，也可引申为把某人从高位或强势地位上拉下台。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of removing a king, queen, or ruler from the throne; overthrowing a monarch","zh":"废黜君主；把国王/女王或统治者赶下王位；推翻君主制统治者"},"examples":[{"en":"The revolution led to the disenthroning of the king.","zh":"这场革命导致国王被废黜。"},{"en":"Many historians debate whether the disenthroning was avoidable.","zh":"许多历史学家争论这次废黜是否本可避免。"}]},{"partOfSpeech":"n.","definition":{"en":"removing someone from a position of great power or authority (often used more generally or metaphorically)","zh":"（常引申/比喻）把某人从高位或强大权力中拉下马"},"examples":[{"en":"The scandal resulted in the CEO’s disenthroning from the company’s top job.","zh":"这起丑闻导致那位CEO被拉下公司最高职位。"},{"en":"In the novel, the hero’s goal is the disenthroning of a cruel tyrant.","zh":"在小说中，主人公的目标是推翻残暴的暴君。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “disenthrone”: removing a ruler from the throne; overthrowing","zh":"“disenthrone”的现在分词：废黜（君主）；推翻（统治者）"},"examples":[{"en":"Protesters were calling for disenthroning the dictator.","zh":"抗议者呼吁推翻独裁者。"},{"en":"The general became famous for disenthroning the old regime.","zh":"那位将军因推翻旧政权而闻名。"}]}],"synonyms":["dethroning","overthrow","deposing","toppling","ousting"],"phonetic":"/ˌdɪsɪnˈθroʊnɪŋ/","extraExplanation":["“disenthrone”由 dis-（表示“去除、取消”）+ enthrone（使登基、使在位）构成；因此“disenthroning”常带有强烈的政治色彩。","现代英语里除了字面“废黜君主”，也常用于比喻语境：把某人从“权力宝座”上拉下来（如CEO、冠军、行业霸主）。"]}
{"word":"disentitle","summary":{"en":"“Disentitle” means to take away someone’s right or eligibility for something, often in formal or legal contexts.","zh":"“disentitle”指取消/剥夺某人获得某物的权利或资格，多用于正式或法律语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone no longer entitled to something; to deprive someone of a right, claim, or privilege","zh":"使某人不再有权（享有某物）；剥夺某人的权利、资格或应得之物"},"examples":[{"en":"Breaking the rules can disentitle you from receiving the scholarship.","zh":"违反规定可能会使你失去领取奖学金的资格。"},{"en":"The court decision disentitled him to any share of the inheritance.","zh":"法院的裁决使他失去任何继承份额的权利。"}]}],"synonyms":["deprive","disqualify","strip (someone) of","bar (someone) from","make ineligible"],"phonetic":"ˌdɪsɪnˈtaɪtəl","extraExplanation":["“disentitle”在现代英语里比较少见，常见于法律/正式语境。日常表达更常用：deprive (someone) of、disqualify (someone) from、make (someone) ineligible for。","构词上：dis-（否定/去除）+ entitle（使有权/使有资格）。因此含义是“取消某人的权利/资格”。"]}
{"word":"disentitled","summary":{"en":"Disentitled means having lost the right or eligibility to receive something, usually because of a rule, action, or condition.","zh":"disentitled 指因规则、行为或条件而失去获得某物的权利或资格（多用于正式语境）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to take away someone’s right to have or claim something; to make someone no longer entitled","zh":"剥夺（某人）享有或主张某物的权利；使（某人）不再有资格/不再有权利"},"examples":[{"en":"Breaking the rules can disentitle you to the prize.","zh":"违反规则可能会让你失去获得奖品的资格。"},{"en":"The policy states that late payment may disentitle a member to benefits.","zh":"该政策规定，逾期付款可能会使会员失去福利资格。"}]},{"partOfSpeech":"adj.","definition":{"en":"(past participle/adj.) no longer having the right to receive something","zh":"（过去分词/形容词）不再有权获得（某物）的；被取消资格的"},"examples":[{"en":"Applicants who provide false information are disentitled from support.","zh":"提供虚假信息的申请者将被取消获得资助的资格。"},{"en":"He felt disentitled to complain after arriving so late.","zh":"他到得这么晚，觉得自己也没有资格抱怨。"}]}],"synonyms":["disqualify","deprive (someone) of","strip (someone) of (rights)","forfeit","invalidate"],"phonetic":"/ˌdɪsɪnˈtaɪtəld/","extraExplanation":["“disentitle(d)”在日常英语里不算常见，更常出现在正式/法律/政策语境（如资格、福利、赔偿、奖项等）。更口语的替换说法常见有：disqualify（取消资格）、lose eligibility（失去资格）、forfeit（因违规而丧失）。","构词提示：dis-（取消/否定）+ entitle（使有权/使有资格）。"]}
{"word":"disentitlement","summary":{"en":"Disentitlement means losing or being stripped of an entitlement (a legal right to receive benefits or privileges).","zh":"Disentitlement 指（法律或制度上的）应享权/领取资格被取消或失去。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of taking away someone’s entitlement (their legal right to receive something, such as benefits, money, or privileges), or the state of no longer being entitled","zh":"取消（某人）应享权/资格（如福利、补助、特权等）的行为；或不再享有该资格的状态"},"examples":[{"en":"Disentitlement from unemployment benefits can happen if you refuse suitable work.","zh":"如果你拒绝接受合适的工作，可能会被取消领取失业救济金的资格。"},{"en":"The policy change led to the disentitlement of many part-time workers.","zh":"政策调整导致许多兼职员工失去了相关资格。"}]}],"synonyms":["loss of eligibility","disqualification","ineligibility","revocation","termination (of benefits)"],"phonetic":"/ˌdɪsɪnˈtaɪt(ə)lmənt/","extraExplanation":["“Disentitlement”较偏正式，常见于政府福利、保险、移民、教育资助等制度语境，指“资格被取消/被剥夺”。日常英语里更常用的说法包括：lose eligibility（失去资格）、be disqualified（被取消资格）、termination of benefits（福利终止）。","构词上：dis-（去除/否定）+ entitlement（应享权/资格）。理解为“把原本有的资格拿掉”。"]}
{"word":"disentitling","summary":{"en":"Disentitling means taking away someone’s entitlement or eligibility to receive something.","zh":"Disentitling 指取消某人获得某物的权利或资格。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of **disentitle**) removing someone’s right or claim to receive something; depriving someone of an entitlement.","zh":"（**disentitle** 的现在分词）取消某人获得某物的权利或资格；使某人丧失应得的权益。"},"examples":[{"en":"The judge’s ruling is disentitling him from the benefits he once received.","zh":"法官的裁决正在取消他之前领取福利的资格。"},{"en":"Missing the deadline can be disentitling you from a refund.","zh":"错过截止日期可能会让你失去退款资格。"}]}],"synonyms":["disqualifying","depriving","making ineligible","stripping (someone) of (rights)"],"phonetic":"/ˌdɪsɛnˈtaɪtəlɪŋ/","extraExplanation":["“disentitle”在日常英语中不常见，更常见的表达是 **disqualify (使失去资格)**、**deprive someone of (剥夺)**、或 **make someone ineligible for (使不符合资格)**。","多用于法律、合同或政策语境：强调“原本有资格/权利，但因某条件或行为而被取消”。"]}
{"word":"disentomb","summary":{"en":"“Disentomb” means to dig something up from a tomb or grave, or figuratively to bring something long hidden back to light.","zh":"“Disentomb”指把埋在坟墓/墓穴里的东西挖出；也可比喻揭露或翻出长期被隐藏的事物。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove a dead body or something buried from a grave or tomb; to dig up","zh":"把尸体或埋藏之物从坟墓/墓穴中挖出；掘出"},"examples":[{"en":"The archaeologists disentombed the remains carefully to avoid damage.","zh":"考古学家小心地掘出遗骸，以免造成损坏。"},{"en":"The family requested that the body be disentombed and moved to a new cemetery.","zh":"家属请求将遗体起出，迁葬到新的墓园。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative) to bring something hidden, forgotten, or buried back into public attention","zh":"（比喻）把被掩藏、被遗忘或“埋起来”的事物重新揭露/翻出，使其重回公众视野"},"examples":[{"en":"The report disentombed old allegations that the company hoped were gone for good.","zh":"这份报告翻出了公司原本希望永远消失的旧指控。"},{"en":"Her memoir disentombed painful memories from childhood.","zh":"她的回忆录揭开了童年时期的痛苦记忆。"}]}],"synonyms":["exhume","unearth","disinter","dig up","bring to light"],"phonetic":"/ˌdɪs.ɛnˈtum/","extraExplanation":["词源上可拆为 dis-（去除、离开）+ entomb（埋葬、入墓），字面意思就是“把（已入墓的）东西弄出来”。","比喻用法在新闻、历史写作里常见，语气往往较严肃，带有“把被埋藏的真相挖出来”的感觉。"]}
{"word":"disentombment","summary":{"en":"Disentombment means exhuming a body from a grave, or (figuratively) bringing something long-buried back into public view.","zh":"Disentombment 指掘墓取出遗体（起尸/验尸），也可比喻把埋藏已久的事物或真相重新揭示出来。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of digging up and removing a dead body from a grave; exhumation","zh":"掘墓取出遗体的行为；起尸（验尸）"},"examples":[{"en":"The police ordered a disentombment to collect new evidence.","zh":"警方下令起尸（掘墓取尸），以收集新的证据。"},{"en":"After the flood, several graves required disentombment and reburial.","zh":"洪水过后，有几座坟墓需要起尸并重新安葬。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) the act of bringing something hidden or long-forgotten back into view","zh":"（比喻）把隐藏或被遗忘已久的事物重新揭示出来"},"examples":[{"en":"Her memoir was a disentombment of painful family secrets.","zh":"她的回忆录揭开了埋藏已久的家庭伤痛与秘密。"},{"en":"The documentary led to the disentombment of a forgotten historical injustice.","zh":"这部纪录片让一桩被遗忘的历史不公重新浮出水面。"}]}],"synonyms":["exhumation","disinterment","unearthing","uncovering","resurrection (figurative)"],"phonetic":"/ˌdɪs.ɛnˈtuːm.mənt/","extraExplanation":["词源上由 dis-（否定/去除）+ entomb（埋葬）+ -ment（名词后缀）组成，字面意思是“把被埋葬的东西解除埋葬”。","在新闻或法律语境中更常用 exhumation（起尸、掘墓取尸），disentombment 更偏书面、正式，且在文学写作里常用于比喻“揭露真相/回忆”。"]}
{"word":"disentraced","summary":{"en":"“Disentraced” isn’t standard; it likely means “disentranced” = no longer entranced or spellbound.","zh":"“disentraced”不是标准拼写；多半指“disentranced”，意为不再出神/不再着迷。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Not standard spelling) Likely meant “disentranced”: freed from being entranced (no longer hypnotized, spellbound, or intensely absorbed).","zh":"（非标准拼写）很可能是想写“disentranced”：从出神/着迷的状态中解脱出来（不再被催眠、迷住或强烈吸引）。"},"examples":[{"en":"The loud crash disentranced him, and he suddenly remembered where he was.","zh":"一声巨响让他从出神中惊醒，他突然想起自己身在何处。"},{"en":"She looked disentranced, as if the music’s spell had finally broken.","zh":"她看起来不再着迷，仿佛音乐的魔力终于消失了。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “disentrance”: to bring someone out of a trance or spellbound state; to snap someone out of deep fascination.","zh":"“disentrance”的过去式/过去分词：使某人从恍惚、出神或着迷状态中恢复过来；让人从强烈沉迷中清醒。"},"examples":[{"en":"A question from the teacher disentranced the class.","zh":"老师的一个问题让全班从沉浸状态中回过神来。"},{"en":"He was disentranced by a phone call and returned to the conversation.","zh":"一个电话让他回过神来，又回到谈话中。"}]}],"synonyms":["snapped out of it","no longer spellbound","brought to one's senses","awakened"],"phonetic":"/ˌdɪs.ɛnˈtrænst/","extraExplanation":["“disentranced / disentrance”在现代英语里比较少见，更常用的表达是：snap out of it（回过神来）、come to one’s senses（清醒过来）、break the spell（打破迷惑/魔力）、shake someone out of a trance（把某人从恍惚中唤醒）。","你输入的“disentraced”很可能是把 disentranced 少写了字母 n；如果你想表达的是“被羞辱/丢脸”之类的意思，常见词是 disgraced（丢脸的；使蒙羞）。"]}
{"word":"disentrail","summary":{"en":"Disentrail means to remove the internal organs of something; an archaic/literary word for “disembowel.”","zh":"disentrail 指“剖腹取脏、取出内脏”，是较古旧/文学性的说法，相当于 disembowel。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove the internal organs of; to disembowel (often used in older or literary writing).","zh":"取出（动物或人的）内脏；剖腹取脏（多见于古文或文学语境）。"},"examples":[{"en":"The hunter disentrailed the deer before carrying it back.","zh":"猎人在把鹿带回去之前先把它剖腹取脏。"},{"en":"In some old stories, enemies were threatened with being disentrailed.","zh":"在一些古老故事里，敌人会被威胁要被剖腹取脏。"}]}],"synonyms":["disembowel","eviscerate","gut"],"phonetic":"/ˌdɪsɛnˈtreɪl/","extraExplanation":["这是一个较古旧、带强烈暴力色彩的词，现代英语更常用 disembowel。日常交流中一般不使用，更多出现在历史、狩猎、或文学描写里。","词源上与 entrails（“内脏”）有关，dis- 有“去除、分离”的意思，因此整体就是“把内脏取出”。"]}
{"word":"disentrain","summary":{"en":"Disentrain means to get off a train, or to unload people/equipment from a train.","zh":"disentrain 指（人）下火车，或把人员/装备从火车上卸下。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to get off a train; to leave a train after traveling","zh":"（从火车）下车；离开火车"},"examples":[{"en":"We will disentrain at the next station and take a bus downtown.","zh":"我们会在下一站下火车，然后坐公交去市中心。"},{"en":"Passengers were asked to disentrain calmly because of a delay.","zh":"由于延误，乘客被要求冷静下车。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make people or equipment get off a train; to unload from a train","zh":"使（人或装备）下火车；从火车上卸下（人员/物资）"},"examples":[{"en":"The officer ordered the unit to disentrain and form lines on the platform.","zh":"军官命令部队下火车，并在站台上列队。"},{"en":"Workers disentrained the cargo quickly to avoid blocking the track.","zh":"工人迅速卸下货物，以免堵塞铁轨。"}]}],"synonyms":["detrain","get off (the train)","alight (from a train)","debark (formal)"],"phonetic":"ˌdɪs.ɪnˈtreɪn","extraExplanation":["这个词较正式、偏书面，常见于交通调度、新闻报道，尤其是军事或应急场景（如“部队下车集结”）。","构词上：dis-（离开/去除）+ entrain（使上车/装上火车；也可指“（人）上火车”）。因此 disentrain 就是“从火车上下来/卸下”。"]}
{"word":"disentrainment","summary":{"en":"Disentrainment means losing synchronization with a regular rhythm, especially the circadian (body-clock) rhythm.","zh":"Disentrainment 指“失去与规律节奏的同步”，尤指昼夜节律（生物钟）不再与外界昼夜循环一致。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process or state of becoming no longer synchronized (entrained) with a regular external rhythm, especially the body clock losing alignment with the day–night cycle","zh":"（尤指生理节律）“去同调/失去同步”的过程或状态：不再与外界规律性节奏（如昼夜循环）保持一致"},"examples":[{"en":"Jet lag is partly caused by circadian disentrainment after a long flight across time zones.","zh":"跨时区长途飞行后的时差反应，部分原因是昼夜节律发生了去同调（disentrainment）。"},{"en":"Night-shift workers often experience disentrainment between their sleep schedule and natural daylight.","zh":"上夜班的人常常会出现睡眠时间与自然日光之间的去同调。"}]},{"partOfSpeech":"n.","definition":{"en":"in experimental settings, the breakdown of a previously learned timing or rhythmic response when the cue or pacer is removed or changed","zh":"（实验语境）当提示信号或“节拍器”被移除或改变后，先前建立的节律/计时反应被打破的现象"},"examples":[{"en":"When the light cue was removed, the animals showed disentrainment over several days.","zh":"当光照提示被移除后，这些动物在数天内逐渐出现去同调现象。"}]}],"synonyms":["desynchronization","circadian disruption","loss of entrainment","de-entrainment"],"phonetic":"/ˌdɪs.ɛnˈtreɪn.mənt/","extraExplanation":["disentrainment 常见于生物节律（chronobiology）、睡眠医学和神经科学文献；日常生活中更常用的说法是 “circadian disruption（昼夜节律紊乱）/ desynchronization（去同步）”。","词形拆解：dis-（否定、脱离）+ entrain（使同步、使跟随节奏）+ -ment（名词后缀）。与之相对的是 entrainment（同调/同步）。"]}
{"word":"disentrammel","summary":{"en":"Disentrammel means to set free from restraints or entanglements.","zh":"Disentrammel 指使摆脱束缚或缠绕，获得自由。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to free (someone or something) from restrictions, ties, or obstacles; to unbind or release","zh":"使（某人或某物）摆脱束缚、限制或阻碍；解开、释放"},"examples":[{"en":"The new policy helped disentrammel small businesses from unnecessary paperwork.","zh":"这项新政策帮助小企业摆脱不必要的文书束缚。"},{"en":"She tried to disentrammel herself from old habits and start fresh.","zh":"她努力让自己摆脱旧习惯，重新开始。"},{"en":"The rescue team worked carefully to disentrammel the injured hiker from the ropes.","zh":"救援队小心翼翼地把受伤的徒步者从绳索中解脱出来。"}]}],"synonyms":["free","release","unshackle","unbind","disentangle"],"phonetic":"/ˌdɪsənˈtræməl/","extraExplanation":["“disentrammel”属于较少见、偏文学/正式的用词，日常英语中更常用 free, release, unbind, disentangle 等。","词根上可理解为 dis-（去除、反向）+ trammel（束缚、羁绊）。trammel 可指“限制、拘束”，也可指“网、绳等导致的缠绕”。在写作中用 disentrammel 会显得更古典或更书面。"]}
{"word":"disentrance","summary":{"en":"A rare, literary verb meaning “to wake from a trance or enchantment; to snap out of deep absorption.”","zh":"一个较少见、偏文学的动词，意为“使从恍惚或着迷中醒来；让人回过神来”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to wake someone from a trance or spell; to free someone from being deeply absorbed or enchanted","zh":"使某人从恍惚/着迷状态中醒来；使解除迷惑、沉迷"},"examples":[{"en":"The sudden knock on the door disentranced him, and he finally noticed the time.","zh":"突然的敲门声让他从出神中醒来，他才终于注意到时间。"},{"en":"Her friend’s question disentranced her from the movie’s intense final scene.","zh":"朋友的提问把她从电影紧张的结尾情节里拉了出来。"}]}],"synonyms":["snap (someone) out of it","rouse","awaken","disenchant"],"phonetic":"/ˌdɪsɛnˈtræns/","extraExplanation":["“disentrance”很少见，带有文学色彩。它由前缀 dis-（表示“去除、解除”）+ entrance（在较旧用法中可表示“使入迷、使陷入恍惚/出神”）构成，因此整体意思是“解除入迷状态/把人从出神中唤回”。","现代英语里更常用的表达是：snap someone out of it（让某人回过神来）、bring someone back to reality（把某人拉回现实）、rouse someone from a trance（把某人从恍惚中唤醒）。"]}
{"word":"disentranced","summary":{"en":"Disentranced means no longer entranced—woken from fascination or a trance; it can also be the past form of “disentrance,” meaning to free someone from that state.","zh":"Disentranced 指“不再入迷/从恍惚中清醒”，也可作动词 disentrance 的过去式/过去分词，表示“使某人从入迷状态中解脱”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"no longer entranced; freed from a spell, strong fascination, or trance-like attention","zh":"不再着迷的；从迷惑/恍惚或强烈吸引中清醒过来的"},"examples":[{"en":"When the music stopped, the crowd seemed disentranced and suddenly aware of the cold night air.","zh":"音乐停下后，人群仿佛从陶醉中醒来，突然意识到夜晚的寒意。"},{"en":"She was disentranced by his apology and began to see the situation more clearly.","zh":"他的道歉让她不再被迷住，开始更清楚地看待局势。"}]},{"partOfSpeech":"vt.","definition":{"en":"past form of “disentrance”: to free someone from being entranced; to bring someone back to normal awareness","zh":"“disentrance”的过去式/过去分词：使某人从着迷/恍惚中解脱；使清醒"},"examples":[{"en":"A sudden shout disentranced him, and he finally looked away from the screen.","zh":"一声突然的喊叫让他清醒过来，他终于把视线从屏幕上移开。"}]}],"synonyms":["awakened","disillusioned","snapped out of it","brought back to reality"],"phonetic":"/ˌdɪs.ɛnˈtrænst/","extraExplanation":["“disentranced”较少见，更常见的表达是“snapped out of it”（猛然回神）或“came to one’s senses”（恢复理智）。","词形上由前缀“dis-”（表示去除、反向）+ “entranced”（着迷的、入迷的）构成，字面意思就是“解除入迷状态”。"]}
{"word":"disentrancement","summary":{"en":"Disentrancement means being freed from a spell or trance, and by extension, losing an idealized fascination and seeing things more realistically.","zh":"Disentrancement 指从魔法或恍惚/着迷状态中解脱；引申为“祛魅/幻想破灭”，开始更现实地看待事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process or state of being freed from an enchantment, spell, or trance; becoming no longer “entranced.”","zh":"从魔法、咒语或恍惚（被迷住的状态）中解脱出来；不再“着迷/入迷”的过程或状态。"},"examples":[{"en":"The prince’s disentrancement came the moment he heard his true name.","zh":"王子一听到自己的真名，立刻从迷咒中解脱出来。"},{"en":"Her disentrancement was gradual, like waking up from a long dream.","zh":"她的清醒是逐渐发生的，像从一场漫长的梦里醒来。"}]},{"partOfSpeech":"n.","definition":{"en":"a shift from idealized fascination to a more realistic view; disenchantment.","zh":"从理想化的迷恋转向更现实的看法；幻想破灭（类似 disenchantment）。"},"examples":[{"en":"Moving abroad brought a quiet disentrancement: the city was beautiful, but daily life was hard.","zh":"移居海外带来一种平静的“祛魅”：城市很美，但日常生活并不轻松。"},{"en":"After the scandal, fans felt a deep disentrancement with the celebrity culture.","zh":"丑闻之后，粉丝对名人文化产生了强烈的祛魅感。"}]}],"synonyms":["disenchantment","awakening","coming to one’s senses","sobering up","unspell"],"phonetic":"/ˌdɪsɪnˈtræns.mənt/","extraExplanation":["这个词比较少见，常见近义词是 disenchantment（“幻想破灭/祛魅”）或 awakening（“觉醒/醒悟”）。在奇幻文学里，它更字面地表示“解除魔法、从被施法的迷离状态中醒来”。","构词上可拆成 dis-（去除、否定）+ entrancement（入迷、恍惚/着迷的状态）。因此 disentrancement 带有“从被迷住/被施法的状态中被解开”的感觉。"]}
{"word":"disentrancing","summary":{"en":"Disentrancing means freeing someone from enchantment or intense fascination; it can also describe something that has a sobering, spell-breaking effect.","zh":"Disentrancing 指使人从着迷或强烈迷恋中清醒过来；也可形容某事物具有“破除迷惑、令人冷静”的效果。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle) freeing someone from a state of enchantment, intense fascination, or mental “spell.”","zh":"（现在分词）使某人从着迷、强烈迷恋或仿佛“被施了魔法”的状态中清醒、解脱出来。"},"examples":[{"en":"The sudden phone call was disentrancing him from the movie’s world.","zh":"那通突如其来的电话把他从电影营造的世界里拉回了现实。"},{"en":"Reading the harsh reviews was disentrancing—she realized she had ignored the flaws.","zh":"读到那些尖锐的评论让她清醒过来——她意识到自己一直忽视了缺点。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common) having the effect of breaking a spell or fascination; sobering.","zh":"（较少见）具有打破迷惑、让人清醒的效果；使人冷静下来。"},"examples":[{"en":"The disentrancing light of morning made the party feel far away.","zh":"清晨那种让人清醒的光线，让昨夜的派对仿佛变得很遥远。"}]}],"synonyms":["snap out of","break the spell","disillusioning","sobering","awakening"],"phonetic":"/ˌdɪsɛnˈtrænsɪŋ/","extraExplanation":["“disentrancing”来自动词 disentrance：dis-（去除、解除）+ entrance（此处源自 entranced“入迷的”）。整体意思是“解除入迷/迷惑”。这个词在现代英语里比较少见，更常见的近义表达有 snap someone out of it、break the spell、bring someone to their senses。"]}
{"word":"disentwine","summary":{"en":"Disentwine means to untangle or separate things (or relationships/ideas) that are intertwined.","zh":"Disentwine 指把缠绕在一起的东西解开、分开，也可比喻理清纠葛的关系或想法。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to separate things that are twisted, tangled, or woven together; to untangle","zh":"把缠绕、纠结在一起的东西分开；解开、理顺（纠缠）"},"examples":[{"en":"She carefully disentwined the necklace from her hair.","zh":"她小心地把项链从头发里解开。"},{"en":"The kitten’s paws got caught in the yarn, and we had to disentwine it gently.","zh":"小猫的爪子被毛线缠住了，我们只好轻轻把它解开。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become untangled or separated (often used with “from”)","zh":"（常与 from 连用）变得不再纠缠；分离开来"},"examples":[{"en":"Over time, their lives slowly disentwined from each other.","zh":"随着时间推移，他们的生活慢慢从彼此纠缠中分离开来。"},{"en":"The threads disentwined as she pulled them apart.","zh":"她把线一拉开，线就散开不再纠结了。"}]}],"synonyms":["untangle","unravel","unwind","separate","unweave"],"phonetic":"ˌdɪs.ɪnˈtwaɪn","extraExplanation":["“dis-”有“去除、分开”的意思，“entwine”意为“缠绕、交织”。所以 disentwine 直观上就是“把缠在一起的东西解开”。除了真实的绳子、头发、线，也常用来比喻“理清复杂关系/情感纠葛”。","语气上比常见的 “untangle” 稍微更书面一些，也更强调原本是“交织在一起”的状态（像藤蔓、线团那样）。"]}
{"word":"disentwined","summary":{"en":"Disentwined means “untangled or separated,” or “(to) untangle/separate” things that are twisted or closely connected.","zh":"disentwined 表示“（被）解开纠缠、分开”，也可指“解开/理清（复杂联系）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to untangle something that is twisted or wrapped together; to separate things that have become mixed or closely connected (literal or figurative)","zh":"把纠缠在一起的东西解开；把混在一起或联系紧密的事物分开（可指字面或比喻）"},"examples":[{"en":"She carefully disentwined the earphones from her bag.","zh":"她小心地把耳机线从包里解开。"},{"en":"It took weeks to disentwine the truth from the rumors.","zh":"花了好几周才把真相从谣言里理清出来。"}]},{"partOfSpeech":"adj.","definition":{"en":"untangled; separated after being twisted together","zh":"已解开纠缠的；已分开的"},"examples":[{"en":"With a gentle pull, the vines were disentwined.","zh":"轻轻一拉，藤蔓就被解开了。"}]}],"synonyms":["untangled","unraveled","unwound","separated","unhooked"],"phonetic":"/ˌdɪs.ɛnˈtwaɪnd/","extraExplanation":["“disentwined”来自动词“disentwine”（dis- 表示“去除、分开” + entwine 表示“缠绕、交织”）。除了描述绳子、头发等的“解开”，也常用来比喻把复杂关系、情绪或信息“理清、剥离”。"]}
{"word":"disentwining","summary":{"en":"Disentwining means untangling something physically, or (figuratively) separating things that are mixed together.","zh":"disentwining 指把东西“解缠/解开”，也可比喻把混在一起的事情或情绪“理清、分开”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"separating things that are twisted, wrapped, or knotted together (the -ing form of “disentwine”).","zh":"把缠绕、扭结在一起的东西解开、分开（“disentwine”的 -ing 形式）。"},"examples":[{"en":"She was disentwining the earphone wires with her fingers.","zh":"她用手指把耳机线缠在一起的部分慢慢解开。"},{"en":"It took a minute to finish disentwining the rope from the branch.","zh":"把绳子从树枝上解缠出来花了一分钟。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative) separating ideas, feelings, responsibilities, or relationships that have become mixed together.","zh":"（比喻）把混在一起的想法、情绪、责任或关系理清并分开。"},"examples":[{"en":"Therapy helped him in disentwining guilt from grief.","zh":"心理咨询帮助他把内疚与悲伤理清、区分开来。"},{"en":"The writer is disentwining fact from rumor in the report.","zh":"作者正在报告里把事实与谣言分辨清楚。"}]}],"synonyms":["untangling","unwinding","unraveling","untying","separating","sorting out"],"phonetic":"/ˌdɪsɛnˈtwaɪnɪŋ/","extraExplanation":["“disentwining”来自动词“disentwine”。前缀“dis-”常表示“去除、分开、反向”，而“entwine”表示“缠绕”。因此整体意思就是“把缠在一起的东西解开”。","拼写提示：常见的基本形式是“disentwine”（动词原形），而“disentwining”是现在分词/动名词形式。"]}
{"word":"disenvelop","summary":{"en":"Disenvelop means to unwrap or uncover something, literally or figuratively to reveal what was hidden.","zh":"Disenvelop 指“拆开包裹、去除覆盖物”，也可比喻“揭示真相、使隐藏之物显露”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove a covering from; to unwrap or free (something) from what surrounds it","zh":"去掉包裹物；解开包裹；使（某物）从覆盖物中解脱出来"},"examples":[{"en":"She carefully disenveloped the gift to avoid tearing the paper.","zh":"她小心地拆开礼物的包装，避免把纸撕破。"},{"en":"Morning light slowly disenveloped the mountains from the mist.","zh":"清晨的光线慢慢把群山从薄雾中“解放”出来。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative) to reveal or make clear by removing what hides something","zh":"（比喻）揭示；使显露；去除遮蔽使之清楚"},"examples":[{"en":"The report disenveloped the truth behind the scandal.","zh":"这份报告揭示了丑闻背后的真相。"},{"en":"With time, her calm explanation disenveloped the real issue.","zh":"随着时间推移，她冷静的解释让真正的问题显露出来。"}]}],"synonyms":["unwrap","uncover","reveal","expose","disclose"],"phonetic":"/ˌdɪsɪnˈvɛləp/","extraExplanation":["“disenvelop”由前缀 dis-（表示“去除、相反”）+ envelop（包裹）构成，字面意思就是“把包裹去掉”。在现代英语里相对少见，更常用的替代词有 unwrap、uncover、reveal。","它常见于较文学或较正式的语境，尤其适合描写“雾散、光透、真相浮现”等逐渐显现的画面。"]}
{"word":"disepalous","summary":{"en":"Disealous (often misspelled as “disepalous”) is a botanical adjective meaning “having two sepals.”","zh":"Disealous（常被误拼为 disepalous）是植物学形容词，意思是“有两个萼片的（二萼的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having two sepals; two-sepaled.","zh":"（植物学）有两个萼片的；二萼的。"},"examples":[{"en":"The flower is described as disealous, with two small sepals.","zh":"这种花被描述为二萼的，有两个小萼片。"},{"en":"In some plant families, a disealous calyx is a key identifying feature.","zh":"在一些植物科中，二萼的花萼是重要的识别特征。"}]},{"partOfSpeech":"other","definition":{"en":"Likely a misspelling of “disealous” (the botanical term).","zh":"很可能是“disealous”的拼写错误（该词为植物学术语）。"},"examples":[{"en":"If you meant the botanical word, the standard spelling is disealous.","zh":"如果你指的是植物学词汇，标准拼写是 disealous。"}]}],"synonyms":["two-sepaled","two-sepalled"],"phonetic":"/daɪˈsɛpələs/","extraExplanation":["从词源上看，di- 表示“二、两个”，sepal 指“萼片”，-ous 表示“具有……的”。这个词属于较少见的植物学描述词，常出现在分类学或形态学的说明中。"]}
{"word":"disequality","summary":{"en":"Disequality means a not-equal relation or condition (≠), used mainly in math and computer science.","zh":"Disequality 指“不相等（≠）”的关系或条件，主要用于数学与计算机科学语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in mathematics or computer science) the relation or statement that two things are not equal; a “not equal” condition.","zh":"（尤用于数学或计算机科学）不相等关系；表示两个对象“不等于”的陈述或条件。"},"examples":[{"en":"In algebra, a disequality like x ≠ 0 tells you x cannot be zero.","zh":"在代数里，像 x ≠ 0 这样的不相等式表示 x 不能为 0。"},{"en":"The program rejects any input that violates the disequality constraints.","zh":"程序会拒绝任何违反不相等约束的输入。"},{"en":"Solving the puzzle requires keeping track of equalities and disequalities between symbols.","zh":"解这个谜题需要跟踪符号之间的相等关系和不相等关系。"}]}],"synonyms":["inequality","non-equality","not-equal relation","disequation"],"phonetic":"/ˌdɪsɪˈkwɑləti/","extraExplanation":["“disequality”常见于逻辑、约束求解（constraint solving）、自动推理与程序分析中，常写作“disequality constraint（不相等约束）”。它通常对应符号“≠”，与“equality（相等）/ inequality（不等式、大小关系）”有所区分：disequality更强调“不是同一个值/对象”，而不一定表示“大于或小于”。"]}
{"word":"disequalization","summary":{"en":"A rare, nonstandard noun meaning the process of making things unequal or increasing inequality.","zh":"一个罕见、非标准名词，指“使不平等化/加剧不平等”的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, nonstandard) The act or process of making people or things unequal; creating or increasing inequality.","zh":"（罕见、非标准用法）使人或事物变得不平等的行为或过程；造成或加剧不平等。"},"examples":[{"en":"Some critics argue that the policy could lead to disequalization in access to healthcare.","zh":"一些批评者认为，这项政策可能导致医疗资源获取上的“不平等化”。"},{"en":"The report warns about disequalization between urban and rural schools.","zh":"报告警告说，城乡学校之间可能出现“差距扩大/不平等化”。"}]}],"synonyms":["inequality","unequal treatment","disparity","gap","widening inequality"],"phonetic":"/ˌdɪsˌiːkwələˈzeɪʃən/","extraExplanation":["“disequalization”在现代英语中非常少见，很多词典不收录，写作中可能会被认为是不自然或不规范的造词。更常见、更地道的表达通常是：\n- inequality（不平等）\n- unequal treatment（不平等对待）\n- disparity / gap（差距）\n- widening inequality / growing disparity（不平等扩大/差距加大）\n- to make ... unequal / to increase inequality（使……不平等/加剧不平等）\n如果你是在论文或正式写作中使用，建议改用上述更常见的词。","构词上它看起来像 dis-（否定/相反）+ equal（平等）+ -ization（……化/过程），逻辑上能被理解为“使不平等化”，但英语里更常用的路径是用“inequality”及其相关搭配来表达。"]}
{"word":"disequalize","summary":{"en":"“Disequalize” means to make something unequal or to remove equalization, but it is rare and nonstandard in English.","zh":"“disequalize”意为“使不平等/取消均衡化”，但在英语中很少见且不太规范。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something unequal; to remove equal treatment, balance, or equalization","zh":"使变得不平等；取消平衡/均衡处理"},"examples":[{"en":"The new policy could disequalize access to healthcare between urban and rural areas.","zh":"新政策可能会让城乡之间的医疗资源获取变得更不平等。"},{"en":"If you disequalize the grading system, some students will be disadvantaged.","zh":"如果你把评分制度弄得不再公平，一些学生会处于不利地位。"}]}],"synonyms":["make unequal","unequalize","create inequality","unbalance","remove equalization"],"phonetic":"/dɪsˈiːkwəˌlaɪz/","extraExplanation":["“disequalize”在现代英语中非常少见，很多词典不收录，通常被视为临时造词（nonce word）或非标准用法。更常见、更自然的表达包括：make unequal（使不平等）、unequalize（使不均等）、create inequality（制造不平等）、remove equalization（取消均衡化处理）。","构词上可以理解为 dis-（否定/去除）+ equalize（使平等/使均衡），字面意思就是“去平等化/取消均衡化”。在正式写作中建议改用更常见的替代表达，以免读者觉得生硬或不规范。"]}
{"word":"disequalizer","summary":{"en":"“Disequalizer” is a rare/nonstandard word meaning something that makes things unequal or unbalanced; people usually say “unequalizer” instead.","zh":"“Disequalizer”是少见的非标准用词，指使事物不平等或失衡的东西；更常用的是“unequalizer”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a rare or nonstandard word; something (or someone) that makes things unequal, or reduces equality/balance (often used jokingly or as a mistaken form of “unequalizer”).","zh":"一个很少见、非标准的词；指使事物变得不平等/不均衡的东西或人（常带玩笑意味，或是把“unequalizer”误写成“disequalizer”）。"},"examples":[{"en":"Some people online call a special advantage a “disequalizer,” meaning it makes the competition unfair.","zh":"网上有人把某种特殊优势称为“disequalizer”，意思是它让竞争变得不公平。"},{"en":"If you mean the opposite of an equalizer, the more common word is “unequalizer.”","zh":"如果你想表达“equalizer（均衡器/平衡因素）”的反义，更常见的词是“unequalizer”。"}]},{"partOfSpeech":"v.","definition":{"en":"(very rare, informal) to make something unequal or less balanced.","zh":"（非常少见、非正式）使某事变得不均等或更不平衡。"},"examples":[{"en":"Adding hidden bonuses can disequalize the system.","zh":"加入隐藏奖励可能会让系统变得更不公平/更不均衡。"}]}],"synonyms":["unequalizer","unbalancer","destabilizer","disadvantage","handicap"],"phonetic":"/ˌdɪsˈiːkwəˌlaɪzər/","extraExplanation":["“disequalizer”不是常见标准词典词条。更自然的表达通常是：unequalizer（使不平等的因素）、to unbalance（使失衡）、to make unfair/unequal（使不公平/不平等）。\n在音频领域，常见的是“equalizer（均衡器）”，而不是“disequalizer”。如果你看到它出现在音频语境里，很可能是玩笑用法、品牌/网名，或拼写混用。"]}
{"word":"disequilibrate","summary":{"en":"“Disequilibrate” means to disturb a balance or stable condition, or for something to become unbalanced, especially in scientific or academic contexts.","zh":"“Disequilibrate”指使某物（尤指系统）失去平衡或稳定状态，或指其自身变得失衡，常用于学术/科学语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make a system lose its balance or stable condition; to disturb equilibrium","zh":"使（系统等）失去平衡/稳定状态；打破均衡"},"examples":[{"en":"Adding heat can disequilibrate the chemical reaction and change the final products.","zh":"加入热量会打破化学反应的平衡，从而改变最终产物。"},{"en":"The sudden policy shift disequilibrated the market for several months.","zh":"政策的突然转向使市场失衡了好几个月。"}]},{"partOfSpeech":"vi.","definition":{"en":"(of a system) to become unbalanced; to move away from equilibrium","zh":"（系统等）变得失衡；偏离均衡状态"},"examples":[{"en":"When the pressure drops too quickly, the system may disequilibrate.","zh":"当压力下降过快时，系统可能会失衡。"},{"en":"Without regular sleep, your body can disequilibrate over time.","zh":"如果长期睡眠不规律，你的身体可能会逐渐失衡。"}]}],"synonyms":["unbalance","destabilize","disrupt","throw off balance","upset the equilibrium"],"phonetic":"ˌdɪs.iˈkwɪl.əˌbreɪt","extraExplanation":["这个词多见于学术或技术语境（化学、经济学、生态学、医学等），日常口语里更常用“unbalance / throw off balance / disrupt the equilibrium”。","词形结构：dis-（使…不、去除）+ equilibrate（使平衡）。常见相关名词：disequilibrium（失衡，不均衡）。"]}
{"word":"disequilibration","summary":{"en":"Disequilibration means a loss of balance—especially a mental/learning imbalance when new information doesn’t fit what you already know.","zh":"disequilibration 指“失衡”，尤指学习或思考中因新信息与既有认知不匹配而产生的认知失衡。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A state or process of becoming unbalanced, especially in thinking or understanding when new information conflicts with what you previously believed.","zh":"失衡；不平衡状态（尤指在思维/理解中，当新信息与原有观念冲突而产生的认知失衡）。"},"examples":[{"en":"Learning a surprising fact can cause disequilibration and make you rethink your assumptions.","zh":"学到一个出乎意料的事实可能会引发认知失衡，让你重新思考原来的假设。"},{"en":"In class discussions, the teacher used questions to create disequilibration before introducing the new concept.","zh":"在课堂讨论中，老师先用提问制造认知失衡，再引入新概念。"}]}],"synonyms":["imbalance","disequilibrium","cognitive conflict"],"phonetic":"/ˌdɪs.iˌkwiː.ləˈbreɪ.ʃən/","extraExplanation":["该词常见于皮亚杰（Piaget）的认知发展理论：当孩子遇到无法用既有“图式”（schema）解释的新经验时，会产生disequilibration（失衡）；随后通过“同化”（assimilation）或“顺应”（accommodation）来恢复“平衡”（equilibration）。","日常英语里更常用 imbalance / disequilibrium；disequilibration更偏学术语境，常出现在教育学、发展心理学与学习理论的文章中。"]}
{"word":"disequilibria","summary":{"en":"“Disequilibria” means multiple states of imbalance or instability in a system.","zh":"“Disequilibria”指多个系统失衡或不稳定的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “disequilibrium”: situations where a system is not in balance or not in a stable state (often used in economics, science, or psychology).","zh":"“disequilibrium”的复数：指系统处于不平衡或不稳定状态的情况（常见于经济学、科学或心理学语境）。"},"examples":[{"en":"The study looks at several disequilibria in the housing market, such as too much demand and too little supply.","zh":"这项研究考察了住房市场中的几种失衡情况，比如需求过高、供给不足。"},{"en":"Small disequilibria can disappear quickly, but large ones may take years to correct.","zh":"小规模的失衡可能很快消失，但大规模的失衡可能需要多年才能纠正。"}]}],"synonyms":["imbalances","instabilities","disparities","mismatches"],"phonetic":"/ˌdɪsˌiːkwɪˈlɪbriə/","extraExplanation":["“disequilibria”来自拉丁语复数形式：-um 结尾的名词（disequilibrium）在学术写作中常用 -a 作为复数（disequilibria）。在日常英语里也有人直接用 “disequilibriums”，但在经济学/学术语境中 “disequilibria” 更常见、更正式。","在经济学里它常指“市场没有清算”的状态：例如价格没有调整到让供需相等，因此出现短缺（shortage）或过剩（surplus）。"]}
{"word":"disequilibrium","summary":{"en":"Disequilibrium means a lack of balance or a departure from a stable normal state.","zh":"Disequilibrium 指“失衡/非平衡”，即偏离稳定或正常的平衡状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A state in which things are not balanced or not in a stable, normal condition (the opposite of equilibrium).","zh":"失衡；非平衡状态；不稳定状态（与 equilibrium「平衡」相反）"},"examples":[{"en":"Stress and lack of sleep can create a hormonal disequilibrium.","zh":"压力和睡眠不足可能会造成荷尔蒙失衡。"},{"en":"The market moved into disequilibrium after the sudden policy change.","zh":"政策突然改变后，市场进入了非均衡状态。"},{"en":"A small disequilibrium in the inner ear can cause dizziness.","zh":"内耳出现一点失衡就可能引发头晕。"}]}],"synonyms":["imbalance","instability","disbalance","lack of equilibrium"],"phonetic":"/ˌdɪsˌiː.kwəˈlɪb.ri.əm/","extraExplanation":["词源：dis-（否定、相反）+ equilibrium（平衡），字面意思就是“非平衡”。常见于经济学（市场非均衡）、医学/生理学（激素/电解质失衡）、物理/化学（系统偏离平衡态）等语境。","用法提示：disequilibrium 通常是不可数名词（a state of disequilibrium），也可以在某些语境下用作可数（a disequilibrium），强调“某一种/某一次失衡”。"]}
{"word":"disequilibriums","summary":{"en":"“Disequilibriums” means multiple states of imbalance (plural of disequilibrium).","zh":"“disequilibriums”表示多个“失衡/非均衡状态”（disequilibrium 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of “disequilibrium”: a state where things are not balanced or stable, especially in systems like the economy, the body, or nature.","zh":"“disequilibrium”的复数：指不平衡或不稳定的状态，常用于经济、人体或自然系统等语境。"},"examples":[{"en":"Economists study disequilibriums such as shortages and surpluses in markets.","zh":"经济学家研究市场中的各种失衡，比如短缺和过剩。"},{"en":"Several hormonal disequilibriums can affect sleep and mood.","zh":"多种激素失衡会影响睡眠和情绪。"}]}],"synonyms":["imbalances","instabilities","non-equilibria","disorders"],"phonetic":"/ˌdɪsˌiːkwəˈlɪbriəmz/","extraExplanation":["“disequilibriums”较常见于一般写作；在更偏学术或传统的用法中，也常见拉丁式复数“disequilibria”。两者都正确，选哪一个主要看写作风格与领域习惯。","该词常见搭配：market disequilibrium（市场失衡）、chemical disequilibrium（化学非平衡）、temporary disequilibrium（暂时性失衡）。"]}
{"word":"disert","summary":{"en":"“Desert” most commonly means a dry, sandy region; as a verb, it means to abandon or leave someone or a place.","zh":"“desert”常指“沙漠”；作动词时指“抛弃、遗弃、离开”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a large, dry area of land with very little rain and few plants","zh":"沙漠；荒漠（降雨极少、植被稀少的大片干旱地区）"},"examples":[{"en":"The Sahara is the largest hot desert in the world.","zh":"撒哈拉是世界上最大的热沙漠。"},{"en":"Many animals in the desert are active at night to avoid the heat.","zh":"许多沙漠动物在夜间活动以躲避高温。"}]},{"partOfSpeech":"v.","definition":{"en":"to leave someone or something (especially when they need you), or to abandon a place","zh":"抛弃；遗弃；擅离（尤指在对方需要时离开）"},"examples":[{"en":"He deserted his family when times got hard.","zh":"在日子艰难时，他抛弃了家人。"},{"en":"Many people deserted the village after the flood.","zh":"洪水之后，许多人离开了那个村庄。"}]}],"synonyms":["wilderness","arid land","abandon","leave","forsake"],"phonetic":"/ˈdɛzɚt/","extraExplanation":["你输入的 **disert** 通常是拼写错误，更常见的目标词是：\n1) **desert**（沙漠；抛弃），重音多在前：**DEH-zert**（名词）/ **dih-ZURT**（动词）。\n2) **dessert**（甜点），拼写有两个 s，常用记忆法：*dessert* 有“两个 s”，因为你想要“第二份/多一点甜点”。\n如果你想表达“甜点”，请用 **dessert**。如果你想表达“沙漠”或“抛弃”，请用 **desert**。"]}
{"word":"disespouse","summary":{"en":"Disespouse is an archaic verb meaning to divorce or renounce a spouse.","zh":"disespouse 是一个古语动词，意思是与配偶离婚，或否认/解除配偶关系。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Archaic, rare) To divorce or separate from a spouse; to end a marriage.","zh":"（古语/罕用）与配偶离婚或分居；解除婚姻关系。"},"examples":[{"en":"In some old texts, a king might threaten to disespouse his queen for political reasons.","zh":"在一些古老文本里，国王可能因政治原因威胁要与王后“disespouse”（解除婚姻）。"},{"en":"The couple chose not to disespouse, hoping time would heal the conflict.","zh":"这对夫妻选择不离婚，希望时间能化解矛盾。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Archaic, rare) To renounce or cast off a spouse as a spouse (to treat the marriage as no longer valid).","zh":"（古语/罕用）否认或抛弃配偶的“配偶身份”；视婚姻不再有效。"},"examples":[{"en":"The story describes him disespousing her in public, as if she were no longer his wife.","zh":"故事描写他当众否认她的妻子身份，仿佛她不再是他的妻子。"}]}],"synonyms":["divorce","separate","repudiate","cast off","discard"],"phonetic":"/ˌdɪsɪˈspaʊz/","extraExplanation":["这个词由前缀 dis-（表示“取消、去除、相反”）+ espouse（娶/嫁；拥护）构成，因此字面含义就是“取消（被）娶/嫁的状态”。现代英语里更常用 divorce（离婚）、separate（分居/分开）、repudiate a spouse（否认/抛弃配偶）来表达。","由于属于古语/罕用词，你在写作或口语中一般不需要使用；阅读古典作品或旧文献时认识它更有帮助。"]}
{"word":"disestablish","summary":{"en":"Disestablish means to remove an institution’s official, established status—especially to end a state church’s special position.","zh":"disestablish 指取消某机构已被确立的官方地位，尤指废除国教等机构的国家特权与支持。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to end the official position or special support of an established organization (especially a state church)","zh":"废除某机构（尤指国教）的官方地位或国家支持"},"examples":[{"en":"Some politicians argued that the country should disestablish the state church.","zh":"一些政治人物主张该国应废除国教的官方地位。"},{"en":"The law would disestablish the church, separating it from the government.","zh":"这项法律将废除该教会的国教地位，使其与政府分离。"}]},{"partOfSpeech":"vt.","definition":{"en":"to take away an institution’s established or protected status; to dismantle it as an official system","zh":"取消某制度/机构既有的“被确立”地位；使其不再作为官方体系（有时也含“拆除其制度框架”之意）"},"examples":[{"en":"The reform aimed to disestablish the old licensing system.","zh":"这项改革旨在取消旧有的许可制度。"},{"en":"Critics warned that the policy could disestablish key public services.","zh":"批评者警告该政策可能会瓦解关键公共服务体系的既有地位。"}]}],"synonyms":["separate (church and state)","de-establish","abolish (context-dependent)","dismantle (context-dependent)","disband (context-dependent)"],"phonetic":"/ˌdɪsɪˈstæblɪʃ/","extraExplanation":["“disestablish”最常见于政治与宗教语境，尤其与英国国教（Church of England）的“政教关系”相关：所谓“disestablishment”指取消国教作为国家正式宗教的地位与特权。历史上，爱尔兰教会于1869年被取消国教地位（disestablished）。","构词很好记：dis-（去除、否定）+ establish（确立、建立）= 取消已被确立的官方地位。与普通的“abolish（废除）/ dismantle（拆除）”相比，它更强调“取消官方承认或制度性特权”。"]}
{"word":"disestablished","summary":{"en":"Disestablished means an institution—especially a church—has lost its official government-supported status; it is also the past form of disestablish.","zh":"disestablished 指（尤指教会）被取消政府正式支持/国教等官方地位的；也可作 disestablish 的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of an institution, especially a church) no longer officially supported or recognized by the government.","zh":"（机构，尤指教会）被取消“国教/官方机构”地位的；不再由政府正式支持或承认的。"},"examples":[{"en":"After the reform, the national church was disestablished and separated from the state.","zh":"改革之后，国教被取消国教地位，并与国家分离。"},{"en":"Some politicians argued for a disestablished church to ensure religious equality.","zh":"一些政治人物主张取消国教地位，以确保宗教平等。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of disestablish: to end an organization’s official connection with the state.","zh":"disestablish 的过去式/过去分词：取消某机构与国家的官方联系（尤指取消国教地位）。"},"examples":[{"en":"The government disestablished the church in the 19th century.","zh":"政府在19世纪取消了该教会的国教地位。"},{"en":"The church was disestablished by law, but it continued to exist independently.","zh":"该教会依法被取消国教地位，但仍以独立形式继续存在。"}]}],"synonyms":["separated (from the state)","no longer state-supported","de-established"],"phonetic":"/ˌdɪsɪˈstæblɪʃt/","extraExplanation":["“disestablish”常用于英国与英联邦语境，和“established church（国教）”相对。经典话题包括英国国教（Church of England）的“establishment”，以及威尔士教会在1920年被“disestablished”。","词形结构：dis-（去除、取消）+ establish（建立、确立）。因此 disestablished 直观上就是“被取消既有官方地位的”。","学习提示：它通常不是“解散/取缔”的意思，而是“取消政府背书或法律特权”，机构本身可能仍继续运作。"]}
{"word":"disestablisher","summary":{"en":"A disestablisher is someone who supports disestablishing a state church (or, more broadly, removing an institution’s official status).","zh":"disestablisher 指主张废除国教制（或更广义上取消某机构官方既定地位）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who supports disestablishment, especially separating a state church from government support and control","zh":"主张“废除国教制/政教合一”的人；尤指支持国家不再资助或控制国教的人"},"examples":[{"en":"In 19th-century Britain, some disestablishers argued that the Church should not be funded by the state.","zh":"在19世纪的英国，一些主张废除国教制的人认为教会不应由国家资助。"},{"en":"As a disestablisher, he campaigned for religious equality under the law.","zh":"作为废除国教制的支持者，他为法律下的宗教平等而奔走。"}]},{"partOfSpeech":"n.","definition":{"en":"more generally, a person who removes an institution from its officially established position","zh":"（更一般地）使某机构失去“官方既定地位”的人；推动取消既有体制的人"},"examples":[{"en":"The reforms made her a disestablisher of old rules that no longer worked.","zh":"这些改革使她成为推动取消不再适用的旧规章的人。"},{"en":"Critics saw the proposal as the work of disestablishers trying to weaken a long-standing system.","zh":"批评者认为该提案是一些“取消既定体制者”试图削弱长期制度的结果。"}]}],"synonyms":["disestablishment supporter","anti-establishment advocate","reformer"],"phonetic":"/ˌdɪsɪˈstæblɪʃɚ/","extraExplanation":["“disestablisher”来自动词 disestablish（废除国教制/取消官方地位）+ 人的后缀 -er。它最常见于英国、爱尔兰等历史语境：讨论是否要将某一教会从“国教/官方教会”的地位中分离出来。","相关常见搭配：disestablishment of the Church（废除国教制）；church–state separation（政教分离）。在现代日常英语中，这个词偏学术/历史讨论，用得不多。"]}
{"word":"disestablishes","summary":{"en":"“Disestablishes” means “removes official/established status,” especially of a state church (third-person singular of disestablish).","zh":"“disestablishes”意为“取消官方确立地位”，尤指取消国教地位（disestablish 的第三人称单数）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Third-person singular) ends the official status or state support of a church or other institution; removes it from being officially “established.”","zh":"（第三人称单数）取消教会或其他机构的“官方确立”地位或国家支持；使其不再是“国教/官方机构”。"},"examples":[{"en":"The new law disestablishes the state church and guarantees freedom of religion.","zh":"这项新法律取消国教地位，并保障宗教自由。"},{"en":"In the debate, she argues the constitution disestablishes religion from government.","zh":"在辩论中，她认为宪法把宗教从政府中“去官方化/去确立”。"}]},{"partOfSpeech":"vt.","definition":{"en":"(More general) removes something from an established position, system, or tradition; stops it from being treated as normal or official.","zh":"（更广义）把某事物从既定地位、体系或传统中移除；使其不再被当作“理所当然/正式的”。"},"examples":[{"en":"The reform disestablishes old privileges that favored a small group.","zh":"这项改革取消了偏向少数群体的旧特权。"},{"en":"The policy disestablishes the practice of automatic renewals.","zh":"该政策取消了自动续订这一惯例。"}]}],"synonyms":["removes","abolishes","ends (official status)","separates (church and state)","dismantles"],"phonetic":"/ˌdɪsɪˈstæblɪʃɪz/","extraExplanation":["“disestablish”最常见于政治与宗教语境，尤其指国家不再把某教会定为“国教”，也不再给予其特权或财政支持。例如英国历史上常讨论对（英格兰、爱尔兰等地）国教的“disestablishment”。","词形提示：disestablish + -es → disestablishes（第三人称单数现在时）。常见名词形式是“disestablishment”（取消国教/取消官方确立）。"]}
{"word":"disestablishing","summary":{"en":"“Disestablishing” means removing an institution—often a church—from official government status or from an established position.","zh":"“disestablishing”指取消某机构（常指教会）的官方/国教地位，或使其不再处于既定的正式地位。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"present participle of “disestablish”: removing an institution (especially a church) from its official, government-supported position.","zh":"“disestablish”的现在分词：使某个机构（尤指教会）不再具有官方、受政府支持的地位。"},"examples":[{"en":"The government is disestablishing the church, ending its special legal status.","zh":"政府正在取消该教会的国教地位，结束其特殊的法律身份。"},{"en":"The bill focuses on disestablishing state control over religious institutions.","zh":"该法案重点在于取消国家对宗教机构的官方支持与控制。"}]},{"partOfSpeech":"v.","definition":{"en":"removing something from an established or officially recognized position or system.","zh":"使某事物不再处于既定或被正式承认的地位/体系之中。"},"examples":[{"en":"The reform aims at disestablishing old monopolies in the market.","zh":"这项改革旨在打破市场中的旧垄断格局。"},{"en":"They talked about disestablishing outdated rules that no longer fit society.","zh":"他们讨论要废除那些不再适合社会的过时规定。"}]}],"synonyms":["ending state support","separating church and state","dismantling (a system)","abolishing (official status)"],"phonetic":"/ˌdɪs.ɪˈstæb.lɪʃ.ɪŋ/","extraExplanation":["“disestablish”最常见的历史语境与英国有关：英格兰教会（Church of England）长期是“established church”（国教），与国家制度有紧密联系；“disestablishment”指取消这种国教/官方教会地位。","词形上：dis-（去除、否定）+ establish（建立、确立）。因此它常用于政治、法律、宗教制度等正式语境。"]}
{"word":"disestablishment","summary":{"en":"Disestablishment means ending an official state connection or support, especially for a church.","zh":"disestablishment 指取消政府的官方支持或联系，尤指取消国教地位、实现政教分离。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of ending an official (state) connection or support, especially between a government and a church","zh":"废除（政府与机构的）官方关系或支持；尤指政教分离、取消国教地位"},"examples":[{"en":"Many people debated the disestablishment of the national church.","zh":"许多人就取消国教地位（政教分离）展开了辩论。"},{"en":"The movement called for disestablishment so religion would not be funded by the state.","zh":"该运动呼吁废除官方宗教地位，使宗教不再由国家资助。"}]}],"synonyms":["separation of church and state","deregistration","withdrawal of state support"],"phonetic":"/ˌdɪsɪˈstæblɪʃmənt/","extraExplanation":["这个词常见于英国与爱尔兰历史语境，最典型的搭配是 the disestablishment of the Church of England（或 Church of Ireland），指取消某教会的“国教/官方教会”地位。相关派别与讨论常用 disestablishmentarian（主张政教分离的人）等词。","词形结构：dis-（否定/取消）+ establishment（建制、确立）+ -ment（名词后缀），整体意思是“取消已确立的官方地位/制度”。"]}
{"word":"disestablishmentarian","summary":{"en":"Disestablishmentarian: a person or view that supports ending the official status of a state church (often the Church of England).","zh":"disestablishmentarian：指支持取消国教地位（政教分离）的人或立场，常与英格兰教会相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who supports disestablishment—especially ending the official status of a state church","zh":"主张“政教分离/取消国教地位”的人（尤指支持取消国教作为国家正式宗教地位的人）"},"examples":[{"en":"In British history, a disestablishmentarian argued that the Church of England should not be the state church.","zh":"在英国历史中，disestablishmentarian 主张英格兰教会不应再是国教。"},{"en":"Some disestablishmentarians campaigned for religious equality in law and government.","zh":"一些主张取消国教地位的人为法律与政府层面的宗教平等而奔走。"}]},{"partOfSpeech":"adj.","definition":{"en":"supporting disestablishment (ending the official status of a state church)","zh":"支持取消国教地位的；主张政教分离的"},"examples":[{"en":"He took a disestablishmentarian position on church-state relations.","zh":"他在政教关系问题上持支持取消国教地位的立场。"},{"en":"The party’s disestablishmentarian arguments focused on fairness for all faiths.","zh":"该政党的相关主张强调对所有信仰一视同仁的公平。"}]}],"synonyms":["supporter of disestablishment","separationist (church-state)","secularist (in some contexts)"],"phonetic":"/ˌdɪsɪˌstæblɪʃmənˈtɛriən/","extraExplanation":["这个词最常与英国政治与宗教史相关：19世纪围绕“英格兰教会（Church of England）是否应保有国教地位”的争论中常见。","词形结构可帮助记忆：dis-（去除）+ establishment（既定体制/国教地位）+ -arian（表示“支持某种主张的人/派别”）。","它也常被当作“很长的英语单词”的经典例子；与之相关的更长词是 *antidisestablishmentarianism*（反对取消国教地位的主张）。"]}
{"word":"disestablishmentarianism","summary":{"en":"Disestablishmentarianism is opposition to ending an official state church, especially in Britain; it’s also used more broadly (often humorously) for opposing removal of an institution’s official status.","zh":"Disestablishmentarianism 指反对取消国教制度（尤指英国语境）；也可更广义、常带玩笑意味地指反对取消某机构的官方地位或特权。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the political or social movement that opposes ending an official state church (especially the Church of England).","zh":"反对取消“国教制度”（尤其指反对解除英国国教会作为国教地位）的政治或社会运动。"},"examples":[{"en":"In 19th-century Britain, disestablishmentarianism was closely tied to debates about the Church of England’s role in government.","zh":"在19世纪的英国，disestablishmentarianism 与关于英国国教会在政府中角色的辩论密切相关。"},{"en":"Some newspapers discussed disestablishmentarianism when Parliament considered separating church and state.","zh":"当议会考虑政教分离时，一些报纸会讨论 disestablishmentarianism。"}]},{"partOfSpeech":"n.","definition":{"en":"more generally, opposition to removing an institution’s official status or privileges (often used humorously because it is a very long word).","zh":"更广义地说，反对取消某机构的官方地位或特权（也常因单词很长而带幽默意味）。"},"examples":[{"en":"He joked that his preference for tradition was pure disestablishmentarianism.","zh":"他开玩笑说自己偏爱传统，简直就是 disestablishmentarianism。"},{"en":"The term is sometimes used playfully to describe resistance to major reforms.","zh":"这个词有时会被戏谑地用来形容对重大改革的抵制。"}]}],"synonyms":["anti-disestablishment (contextual)","conservatism (broad/approx.)","traditionalism (broad/approx.)"],"phonetic":"/ˌdɪs.ɪˌstæb.lɪʃ.mənˈtɛr.i.əˌnɪz.əm/","extraExplanation":["这个词常被当作“超长英文单词”的经典例子（但并不是英语里最长的词）。它的结构可以拆开理解：dis-（去除/否定）+ establishment（建立的体制、既定制度；在英国语境中常指“国教制度”）+ -arian（表示“支持/反对某立场的人或团体”）+ -ism（主义、运动）。","历史语境上，它最常与英国和爱尔兰有关：例如19世纪关于是否取消英国国教会在爱尔兰的国教地位的政治争论。现代日常英语里更常见的是把它当作一个“有学术/政治味道的长词”来引用。"]}
{"word":"disestablismentarian","summary":{"en":"A disestablishmentarian is someone who supports ending an established (state) church and separating church and state.","zh":"disestablishmentarian 指支持取消国教体制、主张政教分离的人（或相应的立场/形容词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who supports disestablishment—separating an official state church from the government.","zh":"主张“政教分离（取消国教体制）”的人；支持取消国家对国教支持的人。"},"examples":[{"en":"In 19th-century Britain, a disestablishmentarian might argue that the Church of England should not receive special legal privileges.","zh":"在19世纪的英国，disestablishmentarian 可能会主张英国国教不应享有特殊的法律特权。"},{"en":"She wrote an essay comparing establishmentarian and disestablishmentarian views on religion and the state.","zh":"她写了一篇文章，比较了支持国教体制与反对国教体制（主张取消国教）两种观点对宗教与国家关系的看法。"}]},{"partOfSpeech":"adj.","definition":{"en":"Supporting disestablishment; favoring the separation of church and state (especially ending an established church).","zh":"支持取消国教体制的；主张政教分离（尤其指取消“国教”地位）的。"},"examples":[{"en":"The party adopted a disestablishmentarian position on church funding.","zh":"该政党在教会经费问题上采取了支持取消国教体制的立场。"}]}],"synonyms":["separationist (in church–state context)","anti-establishment (church-state sense)"],"phonetic":"/ˌdɪs.ɪˌstæb.lɪʃ.mənˈtɛr.i.ən/","extraExplanation":["你输入的拼写是 disestablismentarian，常见标准拼写是 disestablishmentarian（中间是 -establishment-）。","这个词多出现在英国历史与政治语境，尤其与“英国国教（Church of England）是否应作为国教”有关。现代日常英语里很少用，更多见于政治史、宗教史或词汇趣谈（因为它很长）。","词根拆解有助记忆：dis-（取消/反对）+ establishment（既定体制/建立；这里指“国教体制”）+ -arian（表示“某种立场/群体的人”）。"]}
{"word":"disestablismentarianism","summary":{"en":"Disestablishmentarianism is the belief or movement that supports ending a state church’s official status—also famous as a very long word.","zh":"Disestablishmentarianism 指主张取消国教/官方教会地位的思想或运动，也因“超长单词”而出名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a political movement (especially in 19th‑century Britain) that supported removing the Church of England’s status as an official state church (\"disestablishment\")","zh":"（尤指19世纪英国的）主张取消英格兰教会“国教/官方教会”地位的政治运动（即“政教分离”中的“取消国教地位”）"},"examples":[{"en":"Disestablishmentarianism became a major issue in debates about the relationship between church and state.","zh":"在有关政教关系的讨论中，“取消国教地位”的主张成了一个重要议题。"},{"en":"Some politicians supported disestablishmentarianism for Ireland and Wales.","zh":"一些政治人物支持在爱尔兰和威尔士推动取消国教地位的主张。"}]},{"partOfSpeech":"n.","definition":{"en":"(more generally) the belief or policy of ending an established religion’s official status in a country","zh":"（更广义）主张终止某一既定宗教在国家层面的官方地位的信念或政策"},"examples":[{"en":"In some countries, debates about disestablishmentarianism continue today.","zh":"在一些国家，关于是否取消官方宗教地位的争论至今仍在继续。"},{"en":"Her argument for disestablishmentarianism focused on equal treatment of all faiths.","zh":"她支持取消官方宗教地位的论点重点在于平等对待所有信仰。"}]},{"partOfSpeech":"n.","definition":{"en":"a famously long word, often used humorously or in wordplay rather than in everyday conversation","zh":"一个以“超长单词”而闻名的词，常用于幽默、文字游戏或语言示例，而非日常对话"},"examples":[{"en":"He joked that disestablishmentarianism was his favorite long word.","zh":"他开玩笑说“disestablishmentarianism”是他最喜欢的长单词。"},{"en":"The spelling bee included disestablishmentarianism as a challenge word.","zh":"拼字比赛把“disestablishmentarianism”作为挑战词。"}]}],"synonyms":["disestablishment","anti-establishment (religion/church)","separation of church and state (related idea)"],"phonetic":"/ˌdɪsɪˌstæblɪʃmənˈtɛriənɪzəm/","extraExplanation":["你输入的拼写是 **disestablismentarianism**，常见标准拼写是 **disestablishmentarianism**（中间是 *-shment-*）。有时人们会把它当作“超长单词”的代表来练习拼写或发音。","词源结构可拆解为：**dis-**（去除/取消）+ **establish**（建立、确立）+ **-ment**（名词后缀）+ **-arian**（“主张……的人/派别”的后缀）+ **-ism**（主义/思潮）。它与英国历史中的“国教制度”（established church）密切相关。"]}
{"word":"disesteem","summary":{"en":"Disesteem means low respect or contempt; it can also mean to regard someone with low respect.","zh":"disesteem 指“轻视/鄙视（n.）”，也可作动词表示“轻视、看不起（vt.）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Lack of respect or low opinion of someone or something; contempt.","zh":"对某人或某事缺乏尊重；轻视；鄙视。"},"examples":[{"en":"His rude remarks showed open disesteem for his classmates.","zh":"他粗鲁的话语表现出对同学的公然轻视。"},{"en":"The author writes about how prejudice can turn unfamiliar cultures into objects of disesteem.","zh":"作者写到偏见如何会把陌生文化变成被轻视的对象。"}]},{"partOfSpeech":"vt.","definition":{"en":"To regard someone or something with low respect; to despise or think poorly of.","zh":"轻视；看不起；认为（某人/某事）不值得尊重。"},"examples":[{"en":"They disesteem him for lying, not for making a mistake.","zh":"他们轻视他是因为他说谎，而不是因为他犯了错。"},{"en":"Try not to disesteem people just because their views differ from yours.","zh":"不要仅因为观点不同就轻视别人。"}]}],"synonyms":["contempt","disdain","scorn","disrespect","look down on"],"phonetic":"/ˌdɪsɪˈstim/","extraExplanation":["“disesteem”由前缀 dis-（否定/相反）+ esteem（尊重、重视）构成，字面意思就是“不给予尊重”。","在现代英语中它相对偏书面、较少日常使用；口语里更常见的是 “disrespect” 或 “look down on”。","语气上，“disesteem”强调“评价很低/不重视”，而 “disrespect” 更常指“行为上不尊重”。"]}
{"word":"disesteemed","summary":{"en":"“Disesteemed” means not respected or admired; it can also be the past form of “disesteem” (to think poorly of).","zh":"“disesteemed”表示“不受尊敬/被轻视”，也可作动词“disesteem”的过去式/过去分词，意为“轻视、看不起”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"regarded with low respect; not admired (often formal or literary).","zh":"被看不起的；不受尊敬的（常见于正式或文学语境）。"},"examples":[{"en":"In the novel, the disesteemed cousin is kept out of family decisions.","zh":"在小说里，那位不受尊敬的表亲被排除在家族决策之外。"},{"en":"He felt disesteemed at work after his idea was dismissed.","zh":"他的想法被否决后，他觉得在工作中不被重视。"}]},{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of “disesteem”: to lack respect for; to think poorly of.","zh":"“disesteem”的过去式/过去分词：不尊重；轻视；对……评价很低。"},"examples":[{"en":"The artist was disesteemed by critics for years, but later celebrated.","zh":"这位艺术家多年被评论家贬低，但后来受到赞誉。"},{"en":"She disesteemed gossip and avoided it whenever possible.","zh":"她鄙视流言蜚语，并尽可能避开。"}]}],"synonyms":["disrespected","looked down on","undervalued","scorned","held in low regard"],"phonetic":"/ˌdɪsɪˈstiːmd/","extraExplanation":["“Disesteemed / disesteem”比“disliked / looked down on”更正式、更少见，常见于书面语或带一点文学色彩的叙述。日常表达里更常用：be looked down on（被看不起）、be disrespected（不被尊重）、be undervalued（被低估/不被重视）。","构词上是 dis-（否定）+ esteem（尊重/敬重）。注意不要和更常见的“esteem”（尊敬、敬重）混淆。"]}
{"word":"disesteemer","summary":{"en":"A rare noun meaning a person who disrespects or looks down on someone/something.","zh":"较少见的名词，指不尊重或轻视某人/某事的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who does not respect someone or something; a person who holds someone/something in low regard","zh":"不尊重他人的人；轻视（某人/某事）的人"},"examples":[{"en":"He was known as a disesteemer of tradition, always mocking old customs.","zh":"他以轻视传统而出名，总是嘲笑旧习俗。"},{"en":"Calling her a disesteemer of the team was unfair—she just wanted changes.","zh":"说她是“轻视团队的人”并不公平——她只是希望做出改变。"}]}],"synonyms":["disrespecter","detractor","critic","scoffer"],"phonetic":"/ˌdɪsɪˈstiːmɚ/","extraExplanation":["“disesteemer”相对少见，更常见的是动词/名词“disesteem”（表示“轻视；不尊重”）或形容词“disrespectful”。它由“disesteem + -er（做……的人）”构成，因此意思是“轻视的人/不尊重的人”。在现代英语中，这个派生名词不常用，写作或正式表达里通常会改用“someone who disesteems…”或直接用“disrespecter / detractor（语境不同）”。"]}
{"word":"disesteeming","summary":{"en":"“Disesteeming” means showing a lack of respect or being in the act of looking down on someone or something.","zh":"“disesteeming”表示“轻视、不尊重”，或“正在贬低/看不起某人某事”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"present participle of \"disesteem\": showing or expressing a lack of respect; looking down on; regarding as unworthy of esteem.","zh":"“disesteem”的现在分词：表示不尊重、轻视；认为（某人/某事）不值得敬重。"},"examples":[{"en":"Some critics are disesteeming the artist without engaging with the work itself.","zh":"一些评论家在没有认真了解作品的情况下就轻视这位艺术家。"},{"en":"He avoided disesteeming people just because they had different opinions.","zh":"他避免仅因观点不同就轻视别人。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb form) to be in the act of disesteeming: to judge someone or something as lacking worth or honor.","zh":"（动词用法）正在进行“轻视/贬低”的行为：认为某人或某事缺乏价值或不配受尊重。"},"examples":[{"en":"By repeating the rumor, she was disesteeming her colleague’s reputation.","zh":"她反复传播谣言，其实是在贬低同事的名声。"},{"en":"They were disesteeming the effort behind the project, not just the results.","zh":"他们轻视的不只是结果，还有项目背后的努力。"}]}],"synonyms":["disrespecting","disparaging","belittling","slighting","looking down on"],"phonetic":"/ˌdɪsɪˈstiːmɪŋ/","extraExplanation":["“disesteem”比较少见，语气偏书面、略带古典色彩；在现代英语里更常用的说法包括：disrespect（不尊重）、look down on（看不起）、hold in low regard（评价很低）、disparage（贬低）。","构词上是 dis-（否定/相反）+ esteem（尊重、敬重）。理解为“不给予敬重”。"]}
{"word":"disestimation","summary":{"en":"“Disestimation” means a loss of esteem or a decline in reputation.","zh":"“disestimation”指失去他人的敬重、名声或评价下降。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"loss of respect or good opinion; a decline in someone’s reputation or standing.","zh":"（对某人的）不再尊重；名声或社会评价的下降。"},"examples":[{"en":"The scandal led to the politician’s disestimation among many voters.","zh":"这起丑闻让这位政治家在许多选民心中的声望下降。"},{"en":"She feared disestimation at work if the mistake became public.","zh":"她担心如果错误被公开，自己在职场上的评价会变差。"},{"en":"The company tried to rebuild trust after a period of public disestimation.","zh":"公司在经历一段公众信任下降后，努力重建信任。"}]}],"synonyms":["loss of esteem","disrepute","discredit","loss of respect","damage to one’s reputation"],"phonetic":"/ˌdɪsˌɛstəˈmeɪʃən/","extraExplanation":["“disestimation”是比较少见、偏正式的名词，常用于书面语，表示“失去他人敬重/评价变差”。日常英语里更常见的说法是：loss of respect / loss of esteem / damage to one’s reputation。","词形结构：dis-（否定、去除）+ estimation（估价、评价）。在这里的“estimation”更偏“评价/尊重”的意思，而不是“估算”。"]}
{"word":"diseur","summary":{"en":"A (rare) word for a reciter or performer who speaks/recites literature or poetry.","zh":"一个较少见的词，指以朗诵/诵读文学或诗歌为主的表演者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who speaks or recites (especially a performer who recites literature or poetry); a reciter, speaker.","zh":"（尤指朗诵文学/诗歌的）朗诵者、演说者、表演性“说书/诵读者”。"},"examples":[{"en":"She was admired as a gifted diseur of French poetry.","zh":"她以擅长朗诵法语诗歌而备受赞赏。"},{"en":"The actor trained as a diseur, focusing on voice and rhythm.","zh":"这位演员受过“朗诵表演者”的训练，专注于嗓音与节奏。"}]}],"synonyms":["reciter","speaker","declamator","performer"],"phonetic":"/diːˈzɝː/","extraExplanation":["“diseur”来自法语，字面意思接近“说的人/讲述者”。在英语里属于较少见、偏文学或表演艺术语境的词，常指“舞台上以朗诵、诵读为主要表现形式的人”。如果只是日常表达“演讲者/朗诵者”，英语更常用 speaker、reciter、performer。"]}
{"word":"diseurs","summary":{"en":"Diseurs are performers who dramatically recite or deliver stories/monologues (plural of French *diseur*).","zh":"diseurs 指以戏剧化方式朗诵或讲述故事/独白的表演者（法语 *diseur* 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a performer (often in a cabaret or recital setting) who recites or delivers stories, poems, or monologues in a dramatic, expressive way; plural of *diseur*","zh":"（常见于卡巴莱或朗诵会等场合的）朗诵表演者、讲述者；以富有戏剧性和表现力的方式讲故事、诗歌或独白；*diseur* 的复数"},"examples":[{"en":"The program featured singers, dancers, and diseurs who performed short monologues.","zh":"节目包括歌手、舞者，以及表演短篇独白的朗诵者（diseurs）。"},{"en":"In early 20th‑century Paris, diseurs were popular in small cabaret theaters.","zh":"在20世纪初的巴黎，小型卡巴莱剧场里朗诵表演者（diseurs）很受欢迎。"}]}],"synonyms":["reciters","storytellers","monologists","performers"],"phonetic":"/diˈzɝz/","extraExplanation":["“diseur / diseuse / diseurs”是从法语借入英语的外来词，英语中多见于文学评论、戏剧/音乐史或介绍法式卡巴莱（cabaret）文化的语境。日常英语里更常用的说法是 *reciter*（朗诵者）、*storyteller*（讲述者）、*monologist*（独白演员）或 *performer*（表演者）。","法语里“diseur”（男性），“diseuse”（女性）；英语资料有时也沿用这种性别形式。"]}
{"word":"diseuse","summary":{"en":"A diseuse is a female performer who recites or delivers witty spoken pieces, often in a cabaret style.","zh":"diseuse 指以朗诵或机智独白为主、常见于法式歌舞表演风格的女表演者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a woman who recites or performs songs, poems, or witty monologues (especially in a French-style cabaret or salon setting)","zh":"（尤指法式歌舞表演或沙龙中的）女朗诵者／女独白表演者／女说唱艺人"},"examples":[{"en":"In the 1920s Paris cabarets, a famous diseuse could hold the room with a single story.","zh":"在20世纪20年代的巴黎歌舞表演中，著名的 diseuse 仅凭一个故事就能牢牢抓住全场。"},{"en":"She performed as a diseuse, blending spoken humor with short songs.","zh":"她以 diseuse 的身份演出，把口语幽默和短歌融合在一起。"}]}],"synonyms":["storyteller","reciter","performer","cabaret singer","monologist"],"phonetic":"/diˈzɝz/","extraExplanation":["这是一个法语外来词，来自“dire（说）”的词根。常用于描述在歌舞厅、咖啡馆或沙龙里以“说—唱—演”结合的方式表演的女性艺人；对应的男性有时写作 diseur。英语中较偏文学或评论用语，日常更常说 storyteller / performer / cabaret singer。"]}
{"word":"diseuses","summary":{"en":"“Diseuses” is the plural of “diseuse,” meaning female performers who recite or speak-sing poems, songs, or monologues in a theatrical style (often in French cabaret).","zh":"“Diseuses”是“diseuse”的复数，指以戏剧化方式朗诵或“说唱式”演绎诗歌、歌曲或独白的女表演者（常见于法式歌舞厅/卡巴莱传统）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female performer (especially in French cabaret or theater) who recites or delivers songs, poems, or witty monologues in a dramatic, spoken style; plural: diseuses.","zh":"（尤指法式歌舞厅或剧场中的）女朗诵/独白表演者，常以戏剧化的口吻“说唱式”地演绎歌曲、诗歌或机智段子；复数：diseuses。"},"examples":[{"en":"In the early 1900s, Parisian cabarets often featured a diseuse delivering satirical monologues.","zh":"在20世纪初，巴黎的歌舞厅常有diseuse表演者用讽刺独白来串场。"},{"en":"She trained as a diseuse, focusing on clear diction and expressive storytelling.","zh":"她以成为diseuse为目标训练，重点练习清晰吐字与富有表现力的叙事。"}]}],"synonyms":["female reciter","monologist","cabaret performer","chanson performer"],"phonetic":"/diːˈzuːz/","extraExplanation":["“Diseuse”源自法语动词 dire（说）。在英语语境里它通常作为法语借词使用，常见于讨论法式卡巴莱（cabaret）、香颂（chanson）与舞台朗诵传统的文章。","相关词：diseur（男性表演者）；chanson（法语香颂）；cabaret（歌舞杂耍表演场所）。"]}
{"word":"disexcommunicate","summary":{"en":"A rare church-related verb meaning to lift someone’s excommunication and restore them to the church.","zh":"一个较罕见的宗教用语动词，指解除对某人的绝罚并使其恢复教会身份/共融。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove the penalty of excommunication from someone; to restore someone to communion or membership in a church","zh":"解除对某人的“逐出教会/绝罚”（excommunication）；使其恢复与教会的共融或教会成员身份"},"examples":[{"en":"After he publicly apologized, the bishop agreed to disexcommunicate him.","zh":"他公开道歉后，主教同意解除对他的绝罚。"},{"en":"The council voted to disexcommunicate the priest and allow him to serve again.","zh":"议会投票决定解除对那位神父的绝罚，并允许他再次任职。"}]}],"synonyms":["reinstate","readmit","restore","absolve","lift the excommunication"],"phonetic":"/ˌdɪsˌɛkskəˈmjuːnɪkeɪt/","extraExplanation":["这个词非常罕见，多见于历史或宗教语境；日常英语更常用的表达是 be reinstated / be readmitted、lift the excommunication（解除绝罚）。","词形上是 dis-（表示“取消、去除”）+ excommunicate（逐出教会、绝罚），字面意思就是“取消逐出教会的决定”。","在不同基督宗派中，是否存在正式“解除绝罚”的程序、由谁决定（如主教、教会会议等）会有所差异；因此使用时通常要交代具体教会或机构。"]}
{"word":"disexercise","summary":{"en":"A rare word meaning “lack of exercise” (and less commonly, “to keep someone from exercising”).","zh":"一个很少见的词，意思是“缺乏运动”（较少见也可指“使某人无法运动”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/archaic) Lack of physical exercise; a state of not exercising.","zh":"（罕见/旧用）缺乏运动；不运动的状态。"},"examples":[{"en":"His long illness left him in disexercise, and he felt weak afterward.","zh":"长期生病让他一直缺乏运动，之后就觉得很虚弱。"},{"en":"Too much disexercise can make your body stiff and your mood low.","zh":"长期缺乏运动会让身体僵硬、情绪低落。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Rare/archaic) To deprive someone of exercise; to keep someone from exercising.","zh":"（罕见/旧用）使（某人）无法运动；剥夺（某人）运动的机会。"},"examples":[{"en":"Bad weather disexercised the team for nearly a week.","zh":"坏天气让球队将近一周都没法训练。"}]}],"synonyms":["lack of exercise","inactivity","sedentariness"],"phonetic":"/ˌdɪsˈɛksərsaɪz/","extraExplanation":["“disexercise”在现代英语里非常少见，日常表达更常用：lack of exercise（缺乏运动）、inactivity（不活动）、sedentary lifestyle（久坐的生活方式）。","前缀 dis- 在一些旧词里可表示“缺少/剥夺”（类似 deprive of），因此 disexercise 可以理解为“缺少锻炼”或“被剥夺锻炼”。"]}
