{"word":"disfaith","summary":{"en":"Disfaith means a lack of faith—disbelief or distrust—and is rare in modern English.","zh":"Disfaith 指“缺乏信心/不信”，也可指怀疑与不信任；在现代英语中较少见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"lack of faith; disbelief or distrust (a rare, often literary word).","zh":"不信；缺乏信心；怀疑与不信任（较少见、偏文学用语）。"},"examples":[{"en":"Her disfaith in the plan came from years of broken promises.","zh":"她对这个计划的不信任源于多年被辜负的承诺。"},{"en":"He spoke with disfaith about the rumors, asking for proof.","zh":"他对那些传言抱着怀疑的态度，要求拿出证据。"}]}],"synonyms":["disbelief","distrust","skepticism","lack of faith"],"phonetic":"/dɪsˈfeɪθ/","extraExplanation":["“disfaith”在现代英语里非常少见，更常用的表达是“lack of faith / disbelief / distrust / skepticism”。如果你是在书里或旧文本中看到它，它通常就是“faith（信心、信仰）”的反义概念。","拼写上有时会被误写或误读；如果你的原句语境与宗教无关，很多情况下作者只是想用一个更“古风/文学”的词来表达“怀疑、不信任”。"]}
{"word":"disfame","summary":{"en":"Disfame is an archaic word meaning disgrace or damaged reputation; it can also mean “to defame.”","zh":"Disfame 是一个古义词，指“恶名/耻辱、名声受损”，也可作动词表示“诽谤、败坏名声”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic) loss of good reputation; disgrace; disrepute.","zh":"（古义）名声受损；耻辱；恶名。"},"examples":[{"en":"In old writings, a scandal could bring a family into disfame.","zh":"在旧时的文字里，丑闻可能使一个家族陷入恶名。"},{"en":"He feared that one mistake would lead to public disfame.","zh":"他担心一次失误就会带来公众的耻辱。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Archaic) to damage someone’s reputation; to defame.","zh":"（古义）损害某人的名声；诽谤。"},"examples":[{"en":"The pamphlet sought to disfame the local judge.","zh":"那本小册子企图诽谤当地法官。"},{"en":"Do not spread rumors to disfame others.","zh":"不要散布谣言来败坏他人名声。"}]}],"synonyms":["disgrace","shame","disrepute","infamy","defame"],"phonetic":"/dɪsˈfeɪm/","extraExplanation":["“Disfame”在现代英语中非常少见，更常用的是名词“disgrace / shame / disrepute”以及动词“defame”。在阅读古文学或历史文本时偶尔会遇到。","构词上可理解为“dis-（否定/反向）+ fame（名声）”，即“失去名声/坏名声”。"]}
{"word":"disfashion","summary":{"en":"“Disfashion” is a rare verb meaning to make something lose its fashionable style, or (archaically) to deform its shape.","zh":"“disfashion”是个少见动词，常指让某物失去时尚感；更古旧的用法还可指使其变形、走样。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something lose its fashionable style or appeal; to make it seem out of date","zh":"使（某物）失去时尚感；使显得过时"},"examples":[{"en":"The new trend quickly disfashioned last year’s look.","zh":"新潮流很快让去年的穿搭显得过时。"},{"en":"Bright neon colors can disfashion a room if the rest of the design is calm and classic.","zh":"如果其他设计偏沉稳经典，亮眼的霓虹色可能会让房间看起来不够时髦。"}]},{"partOfSpeech":"vt.","definition":{"en":"to alter the shape or form of something in an unattractive way; to deform (archaic/rare)","zh":"使形状走样或变得不美观；使变形（较古旧/少见）"},"examples":[{"en":"Time and neglect had disfashioned the statue’s features.","zh":"岁月与疏于维护让雕像的面部轮廓变得走样。"},{"en":"The heat disfashioned the plastic handle.","zh":"高温把塑料把手弄得变形了。"}]}],"synonyms":["make unfashionable","date","make look dated","deform","distort"],"phonetic":"/dɪsˈfæʃən/","extraExplanation":["“disfashion”在现代英语中非常少见，带有古旧色彩。前缀“dis-”常表示“去除、使相反”（如 dislike, disconnect），加上“fashion”就有“去掉时尚/样式”的意思。","日常表达里更常用的替代说法包括：make (something) unfashionable, make (something) look dated, go out of fashion；表示“使变形”时更常用 deform, distort。"]}
{"word":"disfavor","summary":{"en":"Disfavor means disapproval or lack of support, or the act of not supporting something.","zh":"disfavor 表示“不赞成/反感、不支持”，也可作动词表示“对……不赞成/不支持”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Lack of approval or support; a negative opinion or attitude toward someone or something.","zh":"不赞成；反感；不支持（对某人或某事的负面看法或态度）。"},"examples":[{"en":"His comments fell into disfavor with many listeners.","zh":"他的言论让许多听众感到反感。"},{"en":"The policy is currently out of favor, and the previous approach is back in disfavor.","zh":"这项政策目前不受欢迎，而之前的方法又重新遭到不赞成。"}]},{"partOfSpeech":"v.","definition":{"en":"To stop approving of or supporting someone or something; to view negatively.","zh":"不赞成；不再支持；对……持负面看法。"},"examples":[{"en":"Voters began to disfavor the plan after learning about the costs.","zh":"选民得知成本后，开始不赞成这项计划。"},{"en":"The committee disfavors hiring without a clear interview process.","zh":"委员会不赞成在没有明确面试流程的情况下招人。"}]}],"synonyms":["disapproval","opposition","dislike","unfavorableness","reject"],"phonetic":"/dɪsˈfeɪvər/","extraExplanation":["“in disfavor / out of favor”是常见搭配：\n- in disfavor：不受欢迎、失宠、被冷落\n- out of favor：不再受欢迎（也可用 fall out of favor 表示“渐渐失宠”）\n注意：disfavor 常用于较正式的语境（新闻、评论、政策讨论）。"]}
{"word":"disfavored","summary":{"en":"“Disfavored” usually means not approved of or unpopular; it can also mean not expected to win, and it may be the past tense of “disfavor.”","zh":"“disfavored”通常指不被赞同/不受欢迎；也可指比赛中不被看好；还可作动词“disfavor”的过去式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not liked, supported, or approved of; unpopular or viewed negatively.","zh":"不受喜爱或支持的；不被赞同的；失宠的。"},"examples":[{"en":"The proposal is disfavored by most voters.","zh":"这项提案不受大多数选民支持。"},{"en":"In that company, remote work was disfavored for many years.","zh":"在那家公司，远程办公多年都不被看好。"},{"en":"He belonged to a disfavored group in the old system.","zh":"在旧制度下，他属于不受待见的群体。"}]},{"partOfSpeech":"adj.","definition":{"en":"Less likely to win; not expected to succeed (especially in sports or competitions).","zh":"（尤指比赛中）不被看好、胜算较小的。"},"examples":[{"en":"The disfavored team won in a surprising upset.","zh":"那支不被看好的球队爆冷获胜。"},{"en":"She entered the final as the disfavored candidate.","zh":"她以不被看好的身份进入决赛。"}]},{"partOfSpeech":"v.","definition":{"en":"Past form of “disfavor”: to dislike or oppose; to treat with disapproval (often used in formal writing).","zh":"“disfavor”的过去式：不喜欢；反对；不赞同（常见于较正式的用法）。"},"examples":[{"en":"The court disfavored policies that limited free speech.","zh":"法院不支持限制言论自由的政策。"},{"en":"Many educators disfavored the new testing rule.","zh":"许多教育工作者反对新的考试规定。"}]}],"synonyms":["unpopular","unfavored","disapproved","looked down on","underdog"],"phonetic":"/dɪsˈfeɪvɚd/","extraExplanation":["“disfavored”既常作形容词（不受欢迎的/不被看好），也可作动词“disfavor”的过去式（不赞同/反对）。在新闻、评论、法律或政策语境里很常见。","常见搭配：be disfavored by…（不被……支持）；disfavored group（弱势/不受待见群体）；disfavored candidate/team（不被看好的一方）。","近义词区别：unpopular更口语、偏“人气低”；undesirable强调“不可取/不理想”；disfavored更偏“被系统性或权威性地不支持/不鼓励”。"]}
{"word":"disfavorer","summary":{"en":"A disfavorer is someone who disapproves of or opposes something.","zh":"disfavorer 指不赞成或反对某事的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who dislikes, disapproves of, or is against someone or something","zh":"不喜欢者；反对者；不赞成者"},"examples":[{"en":"He was a disfavorer of the new policy and spoke against it at meetings.","zh":"他反对这项新政策，并在会议上公开发言反对。"},{"en":"Some disfavorers argue that the plan will cost too much.","zh":"一些反对者认为这个计划成本太高。"}]}],"synonyms":["opponent","critic","detractor","disapprover"],"phonetic":"/dɪsˈfeɪvərər/","extraExplanation":["“disfavorer”在现代英语里非常少见，日常表达更常用“opponent”（反对者）、“critic”（批评者）、“detractor”（贬低者）或“someone who disapproves”（不赞成的人）。","词源上来自“disfavor”（不喜欢/不赞成）+ “-er”（表示“做某事的人”），意思直观，但不算固定常用词。"]}
{"word":"disfavoring","summary":{"en":"“Disfavoring” means not approving of something or treating it unfavorably.","zh":"“disfavoring”表示不赞同某事，或对某事采取不利/否定的态度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"showing dislike or a negative preference; not approving of something","zh":"表示不喜欢或倾向于否定；不赞同的"},"examples":[{"en":"Some residents are disfavoring the new construction plan because it may increase traffic.","zh":"一些居民不赞同新的建设计划，因为它可能会增加交通压力。"},{"en":"The report takes a disfavoring view of the company’s recent decisions.","zh":"这份报告对该公司近期的决定持否定态度。"}]},{"partOfSpeech":"v.","definition":{"en":"the act of treating someone or something with disfavor; opposing or being unfavorable to (present participle of “disfavor”)","zh":"对某人或某事表示不利或反对；使处于不利地位（disfavor 的现在分词）"},"examples":[{"en":"By disfavoring small suppliers, the policy could reduce competition.","zh":"这项政策如果对小供应商不利，可能会减少竞争。"},{"en":"The committee is disfavoring proposals that lack clear safety measures.","zh":"委员会倾向于否决那些缺乏明确安全措施的提案。"}]}],"synonyms":["opposing","unfavorable to","disapproving","against","negative toward"],"phonetic":"/dɪsˈfeɪvərɪŋ/","extraExplanation":["“disfavoring”多用于较正式的语境（新闻、评论、政策讨论）。日常口语里更常说：“not in favor of… / against… / don’t like…”。","注意搭配：disfavor + 名词（disfavor a plan/policy），或 be in disfavor（失宠/不受欢迎）。"]}
{"word":"disfavors","summary":{"en":"“Disfavors” usually means “does not support or approve of.”","zh":"“disfavors”通常表示“（某人/某机构）不支持或不赞成”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(third-person singular of “disfavor”) to dislike, disapprove of, or not support someone or something.","zh":"（动词 disfavor 的第三人称单数）不喜欢；不赞成；不支持（某人/某事）。"},"examples":[{"en":"The public disfavors raising taxes right now.","zh":"公众目前不赞成加税。"},{"en":"The company disfavors working overtime unless it is necessary.","zh":"除非有必要，公司不鼓励加班。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural noun) acts or signs of disapproval or lack of support.","zh":"（名词复数）不赞成的行为/表示；失宠；冷遇。"},"examples":[{"en":"After the mistake, he suffered several small disfavors at work.","zh":"犯错之后，他在工作中遭遇了几次小小的冷遇。"}]}],"synonyms":["opposes","disapproves of","objects to","frowns on","rejects"],"phonetic":"/dɪsˈfeɪvərz/","extraExplanation":["“disfavor”常见于较正式的语境，尤其是新闻、学术或法律写作里：例如 “The law/constitution disfavors …”（法律/宪法不鼓励、不认可……），意思更接近“倾向于反对/不予支持”，语气比 everyday 的 “don’t like” 更正式。","词缀提示：dis- 表示“否定/相反”，favor 表示“支持、赞同”，合起来就是“不给支持、反对”。"]}
{"word":"disfavour","summary":{"en":"“Disfavour” means to disapprove of or not support something; it can also mean the state of being disliked or not supported (British spelling; US: disfavor).","zh":"“disfavour”表示“不赞成/不支持”，也可指“失宠、遭到反对/不受支持”的状态（英式拼写；美式为 disfavor）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to dislike, disapprove of, or not support someone or something (often in formal British English).","zh":"不喜欢；不赞成；不支持（常见于较正式的英式英语）。"},"examples":[{"en":"Many parents disfavour long hours of screen time for young children.","zh":"许多家长不赞成长时间让幼儿看屏幕。"},{"en":"The committee disfavour the proposal because it is too expensive.","zh":"委员会不支持这个提案，因为成本太高。"}]},{"partOfSpeech":"n.","definition":{"en":"disapproval or lack of support; an attitude that is not favorable (mainly as a noun in British English).","zh":"反对；不赞成；不支持（主要作为名词用于英式英语）。"},"examples":[{"en":"Her plan was met with disfavour from her manager.","zh":"她的计划遭到了经理的反对。"}]}],"synonyms":["disapprove of","oppose","be against","dislike","reject"],"phonetic":"/dɪsˈfeɪvər/","extraExplanation":["拼写说明：英式英语常写作「disfavour」，美式英语更常写作「disfavor」。意思相同。","用法提示：动词多用于较正式语境（如报告、新闻、学术写作）。口语里更常用「dislike」「disapprove of」「be against」。"]}
{"word":"disfavourable","summary":{"en":"“Disfavourable” (more commonly spelled “unfavourable/unfavorable”) means not beneficial or not approving.","zh":"“disfavourable”（更常见写法为 unfavourable/unfavorable）指“不利的”或“（态度上）不赞成的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not good or likely to lead to a good result; negative or harmful.","zh":"不利的；负面的；可能导致不良结果的。"},"examples":[{"en":"The weather forecast is unfavourable for a picnic this weekend.","zh":"本周末的天气预报对野餐不利。"},{"en":"High interest rates create unfavourable conditions for buying a home.","zh":"高利率会造成不利于买房的条件。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not approving of someone or something; showing dislike or disapproval.","zh":"不赞成的；反对的；表示不喜欢或不认可的。"},"examples":[{"en":"Her parents were unfavourable toward the idea of her quitting school.","zh":"她父母不赞成她退学的想法。"},{"en":"The article gave an unfavourable review of the new restaurant.","zh":"这篇文章对这家新餐厅给出了负面评价。"}]}],"synonyms":["unfavorable","adverse","negative","unhelpful","disapproving"],"phonetic":"/ʌnˈfeɪv(ə)rəb(ə)l/","extraExplanation":["英美常用拼写是 unfavorable；英式拼写是 unfavourable（多了一个 u）。两者意思完全一样。","常见搭配：unfavourable conditions（不利条件）、unfavourable weather（不利天气）、unfavourable review/press（负面评价/报道）、be unfavourable to/toward(s) sth（对……不赞成）。","语气上比 bad 更正式，常见于新闻、商业、学术写作。"]}
{"word":"disfavoured","summary":{"en":"“Disfavoured” means not approved of or supported; it can also be the past form of “disfavor.”","zh":"“disfavoured”表示“不被赞成/不受支持/不受欢迎”；也可作动词“disfavor”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not liked, supported, or approved of; regarded negatively.","zh":"不受喜欢的；不被支持或认可的；不受欢迎的。"},"examples":[{"en":"Large gatherings were disfavoured during the public health emergency.","zh":"在公共卫生紧急时期，大型聚会不被鼓励（不受支持）。"},{"en":"His outspoken style is sometimes disfavoured by senior managers.","zh":"他直言不讳的风格有时不受高层经理欢迎。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “disfavor”: to dislike or to not support or approve of something.","zh":"“disfavor”的过去式/过去分词：不喜欢；不支持；不赞成。"},"examples":[{"en":"The committee disfavoured the proposal because it was too expensive.","zh":"委员会不赞成该提案，因为成本太高。"},{"en":"The law has long disfavoured discrimination in hiring.","zh":"法律长期以来不支持（反对）招聘中的歧视。"}]}],"synonyms":["disliked","unpopular","out of favor","disapproved of","discouraged"],"phonetic":"/dɪsˈfeɪvɚd/","extraExplanation":["“disfavoured”是英式拼写；美式拼写更常见的是“disfavored”。两者意思相同。","在正式写作中常见搭配：be disfavoured by（不受……欢迎/支持）、be disfavoured in/under（在……中/在……制度下不被支持）、disfavoured policy/practice（不被认可的政策/做法）。","语气通常较正式，常用于讨论政策、法律、学术观点或社会态度。"]}
{"word":"disfavourer","summary":{"en":"A disfavourer is someone who disapproves of or opposes something or someone.","zh":"disfavourer 指不赞成或反对某人/某事的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who dislikes, disapproves of, or does not support someone or something; an opponent","zh":"不赞成者；反对者；不支持某人/某事的人"},"examples":[{"en":"He was a disfavourer of the new policy and spoke against it at meetings.","zh":"他不赞成这项新政策，并在会议上公开反对。"},{"en":"Even her disfavourers admitted she worked hard.","zh":"即使是那些不喜欢她的人也承认她很努力。"}]}],"synonyms":["opponent","critic","detractor","disapprover"],"phonetic":"/dɪsˈfeɪvərər/","extraExplanation":["“disfavourer”比较少见，更常见的表达是“opponent / critic / detractor”。它来自动词“disfavour / disfavor（不赞成、不支持）”。英式拼写多用“disfavour”，美式多用“disfavor”。"]}
{"word":"disfavouring","summary":{"en":"“Disfavouring” means showing disapproval or making something less favored, often in formal contexts.","zh":"“disfavouring”表示“不赞成”或“对……不利/较少支持”，多用于较正式的语境。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “disfavour”) to show disapproval of something, or to treat something less positively than other options.","zh":"（disfavour 的现在分词）不赞成；对……持反对态度；（在选择中）不利于、较少支持某事。"},"examples":[{"en":"The committee is disfavouring the proposal because it costs too much.","zh":"委员会不赞成这个提案，因为成本太高。"},{"en":"Recent rules are disfavouring small businesses.","zh":"近期的规定对小企业不利。"}]},{"partOfSpeech":"adj.","definition":{"en":"showing disapproval; indicating that something is not favored.","zh":"表示不赞成的；显出不利或不支持的。"},"examples":[{"en":"The report contains several disfavouring comments about the plan.","zh":"报告里有几条对该计划不利的评论。"},{"en":"A disfavouring look spread across his face.","zh":"他脸上露出不赞成的神情。"}]}],"synonyms":["disapproving","opposing","unfavorable","adverse","biased against"],"phonetic":"/dɪsˈfeɪvərɪŋ/","extraExplanation":["“disfavouring”是英式拼写；美式英语更常写作“disfavoring”。在正式写作（尤其是政策、法律、学术语境）里更常见，用来表达“反对/不支持”或“对……不利”。","常见搭配：disfavouring remarks/comments（不利的评论）；disfavouring evidence（不利证据）；policies disfavouring A in favor of B（政策对A不利而偏向B）。"]}
{"word":"disfeature","summary":{"en":"“Disfeature” means to disfigure—i.e., to damage appearance; as a rare noun, it can mean a disfigurement.","zh":"“disfeature”意为“使毁容/使变形、破坏外貌”；作少见名词可指“毁容或外观缺陷”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to spoil someone’s appearance; to deform or make unattractive (literary, old-fashioned).","zh":"损毁外貌；使变形或变得难看（文学用语/较古旧）。"},"examples":[{"en":"The accident disfeatured his face, leaving a long scar.","zh":"那场事故损毁了他的脸，留下了一道长疤。"},{"en":"Hardship had disfeatured the once-gentle landscape.","zh":"艰难困苦让曾经秀美的景色变得面目全非。"}]},{"partOfSpeech":"n.","definition":{"en":"a disfigurement; an unattractive or deforming feature (rare).","zh":"毁容；畸形或令人不快的缺陷（少见）。"},"examples":[{"en":"He spoke of the scar as a disfeature he had learned to live with.","zh":"他把那道疤称作自己已经学会接受的缺陷。"}]}],"synonyms":["disfigure","deform","mar","scar","deface"],"phonetic":"/dɪsˈfiːtʃɚ/","extraExplanation":["“disfeature”在现代英语里非常少见，多见于较早期或偏文学的文本。日常表达通常用更常见的“disfigure”（毁容/使变形）或“mar”（损坏、破坏美感）。","构词上可理解为“dis-（使……相反/去除）+ feature（特征、容貌特征）”，整体就是“把特征弄坏”，强调外观被破坏。"]}
{"word":"disfeatured","summary":{"en":"Disfeatured means having one’s appearance, especially the face, damaged or marred; it is rare and literary, with disfigured being more common today.","zh":"disfeatured 指（尤指面部）外貌受损、毁容或变形；较少见且偏文学用法，现代更常用 disfigured。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having one’s facial features or appearance damaged, marred, or made unattractive (often by injury or illness).","zh":"（多指脸部或外貌）被损伤、毁容、变形的；容貌受损的。"},"examples":[{"en":"The soldier returned home disfeatured by war injuries.","zh":"那名士兵因战争受伤而毁容，回到了家。"},{"en":"The fire left him disfeatured, and he chose to wear a mask in public.","zh":"那场火灾使他毁容，他选择在公共场合戴面具。"}]}],"synonyms":["disfigured","scarred","maimed","deformed"],"phonetic":"/dɪsˈfiːtʃɚd/","extraExplanation":["“disfeatured”比较少见，带有较强的文学/古风色彩；现代英语更常用“disfigured”（毁容的、变形的）。","构词上可理解为 dis-（使…失去/变坏）+ featured（有某种面貌特征的），字面意思是“把面貌特征弄坏”。","在文学作品中它常用来强调外貌受损带来的社会眼光或心理创伤，语气有时更冷峻或更具同情意味，具体取决于上下文。"]}
{"word":"disfeaturement","summary":{"en":"Disfigurement means damage to appearance (especially the face), or an ugly/spoiling change to something’s look.","zh":"Disfigurement 指外貌（尤指面部）受损造成毁容，也可指对事物外观的破坏性改动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Damage to a person’s appearance, especially the face, that makes them look less attractive or less recognizable (often caused by injury, burns, or disease).","zh":"毁容；外貌（尤指面部）受损，变得不美观或不易辨认（常因受伤、烧伤或疾病导致）。"},"examples":[{"en":"The accident left him with facial disfigurement.","zh":"那场事故让他面部毁容。"},{"en":"She had surgery to reduce the disfigurement caused by the burn.","zh":"她做了手术来减轻烧伤造成的外貌损伤。"},{"en":"The charity supports children living with disfigurement.","zh":"该慈善机构帮助遭受外貌损伤的儿童。"}]},{"partOfSpeech":"n.","definition":{"en":"A change that makes something look ugly or spoiled (used for objects, places, or artworks).","zh":"（对物体、地点或艺术品等的）破坏性改变；使外观变难看、被糟蹋的改动。"},"examples":[{"en":"Many residents opposed the new billboard as a disfigurement of the historic street.","zh":"许多居民反对新广告牌，认为它破坏了这条历史街区的风貌。"},{"en":"Graffiti can be seen as disfigurement when it damages public buildings.","zh":"当涂鸦损坏公共建筑时，可能被视为对外观的破坏。"}]}],"synonyms":["deformity","scarring","mutilation","defacement","disfiguration"],"phonetic":"/dɪsˈfɪɡjɚmənt/","extraExplanation":["你输入的“disfeaturement”不常见，标准拼写通常是“disfigurement”。“disfigure-”来自“figure（形状、外貌）”，加上“dis-（使…变坏/去掉）”表示“使外貌受损”。","在谈论人的外貌时，这个词比较敏感，正式语境里常用更中性的表达，如“facial difference（面部差异）”或“visible difference（可见差异）”。"]}
{"word":"disfeaturing","summary":{"en":"Disfeaturing means spoiling appearance or beauty; it can describe an action (“is disfeaturing”) or a quality (“disfeaturing marks”).","zh":"disfeaturing 指“破坏外观/美感，使变难看”，既可作动词现在分词，也可作形容词。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of) to spoil someone’s or something’s appearance; to make something less attractive (often in a noticeable or lasting way).","zh":"（disfeature 的现在分词）使（人或物）失去美观；损害外表（常指明显或持久地变丑、变难看）。"},"examples":[{"en":"The scar is disfeaturing his cheek, but it doesn’t change who he is.","zh":"那道疤让他的脸颊变得不那么好看，但并不改变他是谁。"},{"en":"They worried the new highway would be disfeaturing the quiet landscape.","zh":"他们担心新建的高速公路会破坏这片宁静的风景美感。"}]},{"partOfSpeech":"adj.","definition":{"en":"Spoiling the appearance of something; visually damaging or disfiguring (used as an adjective).","zh":"破坏外观的；使变难看的（作形容词用）。"},"examples":[{"en":"The building’s disfeaturing additions were removed during renovation.","zh":"翻新时把那栋建筑上破坏美观的加建部分拆掉了。"},{"en":"He tried to cover the disfeaturing mark with makeup.","zh":"他试着用化妆品遮住那块影响美观的痕迹。"}]}],"synonyms":["disfiguring","marring","spoiling","defacing","blighting"],"phonetic":"/dɪsˈfiːtʃərɪŋ/","extraExplanation":["“disfeaturing”来自动词 disfeature（相对常见的词是 disfigure）。结构上是 dis-（表示“去除/相反/否定”）+ feature（特征、容貌），字面意思是“把特征弄坏”，因此常用于“损害容貌/景观”。现代英语里较少见，更多出现在较正式或带文学色彩的语境中。","与 disfigure 相比，disfeature 往往更强调“破坏美感、让整体不协调”，不一定指严重的身体毁损；但二者在很多句子里可互换。"]}
{"word":"disfellowship","summary":{"en":"“Disfellowship” means to formally expel someone from a group—often a religious community—or the act/state of being expelled.","zh":"“disfellowship”指（尤在宗教团体中）正式开除某人，或指被开除这一行为/状态。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to formally remove someone from a group (especially a religious community) and stop recognizing them as a member","zh":"（尤指在宗教团体中）正式开除某人、取消其成员身份"},"examples":[{"en":"The elders decided to disfellowship him for repeated violations of the community’s rules.","zh":"长老们决定因他多次违反团体规定而将他开除。"},{"en":"Some members feared being disfellowshipped if they spoke openly about doubts.","zh":"一些成员担心如果公开表达怀疑会被开除。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or state of being formally expelled from a group; excommunication","zh":"被正式开除（或开除的状态）；（类似）逐出教会"},"examples":[{"en":"After her disfellowship, she lost many social connections within the community.","zh":"在被开除后，她在团体中的许多社交联系都断了。"},{"en":"The policy of disfellowship can have serious emotional effects on families.","zh":"开除制度可能对家庭造成严重的情感影响。"}]}],"synonyms":["expel","excommunicate","ban","cast out","exclude"],"phonetic":"/dɪsˈfɛloʊʃɪp/","extraExplanation":["“disfellowship”常见于特定宗教语境，尤其与耶和华见证人（Jehovah’s Witnesses）的纪律措施相关，指将成员正式开除并限制与其往来（有时被称为“shunning/回避、断交”）。在更一般的英语里，人们更常用“expel”“excommunicate”。"]}
{"word":"disfen","summary":{"en":"“Disfen” is not standard English; it’s probably a typo or a context-specific term. Share the sentence to identify the intended word.","zh":"“disfen”不是标准英文，可能是拼写错误或特定语境用语。把原句发来可帮助确认你想找的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a name/term from a specific context.","zh":"不是标准英文单词，可能是拼写错误，或是某个特定语境中的专有名词/术语。"},"examples":[{"en":"I can’t find “disfen” in a dictionary—could you share the sentence where you saw it?","zh":"我在词典里找不到“disfen”——你能把看到它的句子发我吗？"},{"en":"Did you mean “dissent” or “disinfect”?","zh":"你是不是想写“dissent（异议）”或“disinfect（消毒）”？"}]}],"phonetic":"/dɪsˈfɛn/","extraExplanation":["“disfen”更像是拼写错误或打字误触。你可以把原句、语境（聊天/游戏/学术/医学等）或你想表达的中文意思发来，我就能更准确地判断你要找的词。","常见可能的接近词（按字母形状/发音相似）：dissent（持不同意见）、disinfect（消毒）、disfend（很少见，意为“防御/保护”，多见于古旧用法或姓氏）。"]}
{"word":"disfiguration","summary":{"en":"Disfiguration means damage to someone’s appearance (especially the face/body), or figuratively, damage that spoils something’s look.","zh":"Disfiguration 指外貌（尤其面部/身体）受损、毁容；也可引申为破坏某物外观或完整性的损害。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a change that makes someone’s face or body look damaged, unattractive, or less recognizable (often because of injury, illness, or an accident)","zh":"毁容；外貌损伤（常因受伤、疾病或事故导致，使面部或身体受损、不美观或难以辨认）"},"examples":[{"en":"The burn caused permanent disfiguration on his face.","zh":"烧伤导致他脸部永久毁容。"},{"en":"Doctors tried to reduce the disfiguration after the accident.","zh":"医生努力减轻事故后的外貌损伤。"}]},{"partOfSpeech":"n.","definition":{"en":"(figurative) damage that spoils the appearance or completeness of something","zh":"（引申）破坏美感；使某物面貌受损或不完整的损害"},"examples":[{"en":"Many people felt the new billboard was a disfiguration of the historic street.","zh":"许多人觉得这块新广告牌破坏了这条历史街区的美感。"},{"en":"The edits were seen as a disfiguration of the author’s original work.","zh":"这些改动被视为对作者原作的“破坏”。"}]}],"synonyms":["disfigurement","deformity","scarring","mutilation","damage"],"phonetic":"/dɪsˌfɪɡjəˈreɪʃən/","extraExplanation":["词形来源：dis-（否定/去除）+ figure（形状、外形）+ -ation（名词后缀），字面意思是“把外形弄坏”。","语体提示：disfiguration 比较正式、偏书面；日常口语更常说 disfigurement（毁容/外貌损伤）。","文化语境：在新闻或医学语境中常与 burns（烧伤）、scars（疤痕）、accident（事故）、congenital（先天的）等词搭配；描述他人外貌时需注意礼貌与尊重。"]}
{"word":"disfigurative","summary":{"en":"Disfigurative means causing disfigurement (physical damage to appearance) or, figuratively, distorting the original form or meaning.","zh":"disfigurative 指“造成毁容/损坏外观的”，也可作比喻义指“扭曲原貌或本意的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Damaging someone’s or something’s appearance; making it look less attractive or less recognizable.","zh":"损毁外貌的；使（人或物）变丑、变得难以辨认的。"},"examples":[{"en":"The accident left him with disfigurative scars on his face.","zh":"那场事故在他脸上留下了毁容性的疤痕。"},{"en":"Some burns can be disfigurative, especially without proper treatment.","zh":"有些烧伤可能会造成毁容，尤其是在没有得到适当治疗的情况下。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Distorting the original shape, meaning, or character of something.","zh":"（比喻）扭曲原貌或本意的；使内容或性质走样的。"},"examples":[{"en":"The headline was disfigurative, making the story sound more extreme than it was.","zh":"那个标题有扭曲之嫌，把报道说得比实际更极端。"},{"en":"Over-editing can be disfigurative and remove the writer’s natural voice.","zh":"过度修改可能会扭曲文章，抹去作者原本的风格。"}]}],"synonyms":["disfiguring","marring","deforming","distorting"],"phonetic":"/dɪsˈfɪɡjərətɪv/","extraExplanation":["“disfigurative”来自动词“disfigure”（使毁容、损坏外观）+ 形容词后缀“-ative”（表示“具有……性质/倾向”）。在日常英语里更常见的是“disfiguring”（造成毁容的）或直接用动词“disfigure”。因此“disfigurative”偏正式、较少见。"]}
{"word":"disfigure","summary":{"en":"Disfigure means to damage someone’s appearance (especially the face) or to spoil the look of something.","zh":"disfigure 指“使毁容、损伤外貌”，也可指“破坏某物的外观/美感”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To damage someone’s face or body so that their appearance becomes less attractive or less recognizable.","zh":"使（面部或身体）毁容；损伤外貌，使变得不美观或难以辨认。"},"examples":[{"en":"The accident disfigured his face, leaving visible scars.","zh":"那场事故使他的脸毁容了，留下了明显的疤痕。"},{"en":"She was afraid the burn would disfigure her hand.","zh":"她担心那处烧伤会让她的手留下难看的痕迹。"},{"en":"Doctors worked quickly to prevent the injury from disfiguring the child.","zh":"医生迅速处理，防止伤势导致孩子毁容。"}]},{"partOfSpeech":"vt.","definition":{"en":"To spoil the appearance of something (such as a building, landscape, or artwork).","zh":"破坏（建筑、景观、艺术品等）的美观；使外观受损。"},"examples":[{"en":"Graffiti disfigured the front of the historic building.","zh":"涂鸦破坏了那座历史建筑正面的美观。"},{"en":"Too many billboards disfigure the countryside.","zh":"太多广告牌破坏了乡村景色。"}]}],"synonyms":["mar","deface","scar","deform","spoil"],"phonetic":"/dɪsˈfɪɡjɚ/","extraExplanation":["词根提示：dis- 表示“使相反/使不…”，figure 原义与“形状、外形”相关；disfigure 字面可理解为“把外形弄坏”。","搭配常见：be disfigured by scars/burns（因疤痕/烧伤而毁容）；disfiguring injury（造成毁容的伤）。","语气与用法：用于人的外貌时较严肃、带同情意味；用于事物外观时表示“破坏美感/有损形象”。"]}
{"word":"disfigured","summary":{"en":"“Disfigured” means having one’s appearance spoiled or damaged, often by injury or accident; it is also the past form of “disfigure.”","zh":"“disfigured”指外貌被破坏、受损而变难看（常因受伤或事故）；也可作“disfigure”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Damaged in appearance; made less attractive, often by injury, disease, or an accident.","zh":"（外貌）被毁容的；被损坏而变得难看的（常因受伤、疾病或事故）。"},"examples":[{"en":"His face was disfigured in the fire, but he recovered and returned to work.","zh":"他的脸在火灾中被毁容，但后来康复并重返工作。"},{"en":"The old statue is disfigured by cracks and missing pieces.","zh":"这座老雕像因为裂缝和缺失的部分而变得残破难看。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “disfigure”: to spoil the appearance of someone or something.","zh":"“disfigure”的过去式/过去分词：使（人或物）外观受损、变丑。"},"examples":[{"en":"The accident disfigured the car’s front end.","zh":"事故把车头撞得变形难看。"},{"en":"The photo was disfigured by water stains.","zh":"这张照片被水渍弄得很难看。"}]}],"synonyms":["scarred","deformed","mutilated","marred","damaged"],"phonetic":"/dɪsˈfɪɡjɚd/","extraExplanation":["“disfigured”常用于较严肃的语境，尤其描述人的外貌受损（如烧伤、疤痕）。谈到人的情况时，要注意措辞尊重：可用更中性的表达如 “scarred”（有疤痕的）或 “injured”（受伤的），并避免把人的价值与外貌绑定。","词根提示：dis-（使相反/去掉）+ figure（形状、外形）。字面意思是“破坏外形”。"]}
{"word":"disfigurement","summary":{"en":"Disfigurement is lasting damage to someone’s appearance, especially the face or body, often caused by injury or illness.","zh":"Disfigurement 指外貌（尤指面部或身体）因受伤或疾病造成的长期损伤或改变，即“毁容/外貌残缺”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"damage to someone’s face or body that makes them look less attractive or less recognizable; a lasting change in appearance (often from injury, illness, or burns).","zh":"毁容；外貌损伤；外形残缺（常因受伤、疾病或烧伤导致，且往往是长期的改变）。"},"examples":[{"en":"The accident left him with permanent disfigurement on his face.","zh":"那场事故使他的脸留下了永久的毁容。"},{"en":"She spoke openly about living with disfigurement after the burn.","zh":"她坦然谈到烧伤后如何带着外貌损伤生活。"},{"en":"The surgery reduced the disfigurement and helped him regain confidence.","zh":"手术减轻了外貌损伤，也帮助他重拾自信。"}]}],"synonyms":["deformity","scarring","mutilation","disfiguration"],"phonetic":"/dɪsˈfɪɡjɚmənt/","extraExplanation":["“disfigurement”常出现在医疗、法律（如人身伤害赔偿）和社会议题语境中。说到他人的外貌变化时，英语里更礼貌、尊重的表达是把重点放在“人”而不是“外貌”，例如：a person with a facial difference（有面部差异的人）、visible scarring（可见疤痕），避免用带强烈贬义或评判色彩的说法。"]}
{"word":"disfigurements","summary":{"en":"Disfigurements are injuries or flaws that spoil someone’s appearance, or (figuratively) defects that spoil something’s quality.","zh":"disfigurements 指毁容或损伤外貌的伤痕/畸形，也可比喻指破坏事物整体质量的缺陷。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Damage to someone’s face or body that makes them look less attractive or recognizable; visible scars or deformities.","zh":"（对脸或身体的）毁容、损伤外貌；明显的疤痕或畸形。"},"examples":[{"en":"The accident left him with serious disfigurements on his face.","zh":"那场事故让他的脸部留下了严重的毁容伤。"},{"en":"Modern surgery can reduce some disfigurements, but healing still takes time.","zh":"现代手术可以减轻某些毁容问题，但康复仍需要时间。"}]},{"partOfSpeech":"n.","definition":{"en":"Imperfections or ugly parts that spoil the appearance or quality of something (often used figuratively).","zh":"（常作比喻）破坏整体美观或质量的缺陷、不协调之处。"},"examples":[{"en":"Some readers think the long middle chapter is a disfigurement in an otherwise strong novel.","zh":"有些读者认为那一大段中间章节是这部优秀小说中的一个“败笔”。"},{"en":"He tried to hide the disfigurements in his argument by changing the topic.","zh":"他试图通过转移话题来掩盖论证中的缺陷。"}]}],"synonyms":["scars","deformities","blemishes","defects","flaws"],"phonetic":"dɪsˈfɪɡjərmənts","extraExplanation":["“disfigurements”是名词复数，单数是“disfigurement”。词根上可拆成 dis-（使相反、使变坏）+ figure（形状、外形），字面意思是“把外形弄坏”。在谈到人的外貌时语气较严肃，使用时注意礼貌与尊重。"]}
{"word":"disfigurer","summary":{"en":"A disfigurer is someone or something that makes a person or object look damaged, ugly, or misshapen.","zh":"disfigurer 指使人或物外观受损、变丑或变形的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing that disfigures someone or something (damages their appearance, shape, or beauty)","zh":"使（人或物）毁容/变形/变丑的人或事物"},"examples":[{"en":"The acid attacker was described by police as a disfigurer who targeted strangers.","zh":"警方称这名泼酸袭击者为“毁容者”，他专门攻击陌生人。"},{"en":"Time can be a disfigurer, leaving cracks and stains on old buildings.","zh":"时间可能是“破坏外观的力量”，会在老建筑上留下裂缝和污渍。"},{"en":"The story portrays war as a disfigurer of bodies and lives.","zh":"这个故事把战争描写成摧残身体与人生的元凶。"}]}],"synonyms":["defacer","mutilator","deformer","spoiler"],"phonetic":"/dɪsˈfɪɡjɚɚ/","extraExplanation":["“disfigurer”由动词 disfigure（毁容；使变形）+ 后缀 -er（表示“做某事的人/物”）构成。常见于较正式或文学化的表达，也可用更常见的说法如 “someone/something that disfigures…”。"]}
{"word":"disfigures","summary":{"en":"“Disfigures” means “damages appearance badly,” often making someone or something less attractive or hard to recognize.","zh":"“disfigures”表示“严重损坏外观/毁容”，常指使人或物变得不美观或难以辨认。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Third-person singular of disfigure) to damage the appearance of someone or something so it looks less attractive or less recognizable.","zh":"（disfigure 的第三人称单数）使（人或物）毁容；损坏外观，使变得不美观或难以辨认。"},"examples":[{"en":"The fire disfigures the old building beyond repair.","zh":"大火把那栋老建筑烧得面目全非，无法修复。"},{"en":"A deep scar disfigures his cheek.","zh":"一道很深的疤痕毁了他脸颊的外观。"},{"en":"Pollution disfigures the river and harms wildlife.","zh":"污染让这条河变得不堪入目，也伤害了野生动物。"}]}],"synonyms":["mars","defaces","spoils","ruins","deforms"],"phonetic":"dɪsˈfɪɡjərz","extraExplanation":["“disfigures”是动词“disfigure”的一般现在时第三人称单数形式（he/she/it disfigures）。常用于描述事故、火灾、疾病、暴力或污染对外貌/外观造成的明显破坏。","词根提示：dis- 表“否定/破坏”，figure 与“形状、外形”有关；合起来就是“把外形弄坏”。在涉及人时，语气较重，带有“毁容、造成永久性损伤”的感觉。"]}
{"word":"disfiguring","summary":{"en":"Disfiguring describes something that damages or spoils appearance, often by leaving visible scars or changing shape.","zh":"disfiguring 指“使外观受损/变难看”的，常因疤痕或形状改变而影响美观。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"making someone or something look ugly or damaged, especially by leaving a visible mark or changing the shape","zh":"使（人或物）变得难看或受损，尤指留下明显疤痕或改变外形"},"examples":[{"en":"The fire left disfiguring scars on his hands.","zh":"火灾在他的手上留下了难看的疤痕。"},{"en":"She worried about disfiguring injuries after the accident.","zh":"事故后她担心会留下毁容般的伤痕。"},{"en":"Graffiti can be disfiguring to historic buildings.","zh":"涂鸦会破坏历史建筑的美观。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “disfigure”: to make someone or something look less attractive or less recognizable","zh":"“disfigure”的现在分词：使（人或物）变得不美观或不易辨认"},"examples":[{"en":"The cut is healing, but it may be disfiguring.","zh":"伤口在愈合，但可能会留下影响外观的痕迹。"},{"en":"The disease is disfiguring his face over time.","zh":"这种疾病随着时间推移正在损伤他的面容。"}]}],"synonyms":["deforming","marring","spoiling","defacing"],"phonetic":"/dɪsˈfɪɡjərɪŋ/","extraExplanation":["“disfigure”由前缀 dis-（表示“使……相反/破坏”）+ figure（外形、形状）构成，核心含义是“破坏原本的外观”。常与 scars（疤痕）、injury（伤）、burns（烧伤）等搭配。","语境上它常涉及外貌与身体伤害，可能触及敏感话题；写作或对话中可用较中性表达替换，例如 “leave a noticeable mark”（留下明显痕迹）或 “change the appearance”（改变外观）。"]}
{"word":"disfiguringly","summary":{"en":"Disfiguringly means “in a way that makes something look badly damaged or unattractive.”","zh":"Disfiguringly 表示“以使外观严重受损或变得难看的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that makes someone or something look damaged or unattractive, especially by changing the face or shape.","zh":"以使（人或物）毁容、变形或变得难看的方式（尤指改变脸部或外形）。"},"examples":[{"en":"The accident left him disfiguringly scarred.","zh":"那场事故让他留下了毁容般明显的疤痕。"},{"en":"The statue was disfiguringly damaged by graffiti.","zh":"那座雕像被涂鸦破坏得很难看、严重影响外观。"}]}],"synonyms":["ugly","badly","severely","noticeably"],"phonetic":"/dɪsˈfɪɡjɚɪŋli/","extraExplanation":["“disfiguringly”来自形容词“disfiguring”（造成毁容/破相的）+ 副词后缀“-ly”。它常用于较正式或文学性的表达，强调外观被破坏得“难以忽视”。在描述伤疤或残疾时要注意语气：现实交流中更推荐使用更中性的说法，如“with visible scars / noticeably scarred”，避免给人贴负面标签。"]}
{"word":"disflesh","summary":{"en":"Disflesh means to remove flesh from something, often used in forensic or literary contexts.","zh":"Disflesh 指把肉从某物上剥去/去除，常见于法医学或文学语境。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove flesh from (a body, bone, or something covered with flesh); to strip of flesh","zh":"（从尸体、骨头等上）剥去/去除肉；使去肉"},"examples":[{"en":"The forensic team tried to determine how long it would take insects to disflesh a body.","zh":"法医小组试图判断昆虫把尸体去肉需要多长时间。"},{"en":"The bones were nearly disfleshed after weeks in the open.","zh":"那些骨头在野外放了几周后几乎被去肉了。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative, literary) to strip away what feels human, warm, or alive","zh":"（比喻/文学用法）剥离人的温度或生命感；使变得“无血无肉”"},"examples":[{"en":"War can disflesh a story, turning people into numbers.","zh":"战争会让故事“去肉”，把人变成数字。"},{"en":"The harsh lighting seemed to disflesh the scene of any intimacy.","zh":"刺眼的灯光仿佛把场景里所有亲密感都剥离了。"}]}],"synonyms":["deflesh","strip","flay","denude"],"phonetic":"/dɪsˈflɛʃ/","extraExplanation":["“disflesh”很少见，带有明显的文学/恐怖/法医学语感。更常见的表达包括：deflesh（去肉、剥肉）、strip the flesh from（把肉剥下来）、remove the flesh（去除肉）。","构词上可理解为 dis-（去除、剥离）+ flesh（肉）。在严肃写作中，使用它会显得更“冷硬”或更具画面感。"]}
{"word":"disfoliage","summary":{"en":"Disfoliage means to strip a plant of its leaves, or figuratively to remove an outer beauty or cover.","zh":"Disfoliage 指使植物失去叶子；也可比喻剥去外在的美或遮蔽，使之显得光秃。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to strip (a tree or plant) of its leaves; to remove foliage","zh":"使（树或植物）落叶；去除叶子（使其失去叶丛）"},"examples":[{"en":"The storm disfoliaged the young trees overnight.","zh":"暴风雨一夜之间把小树的叶子都打落了。"},{"en":"Some insects can disfoliage an entire crop if they spread quickly.","zh":"有些昆虫一旦迅速扩散，可能会让整片作物被啃到“秃叶”。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative) to remove something’s outer beauty or “cover,” making it look bare","zh":"（比喻）剥去外在的美或“遮蔽”，使之显得光秃、赤裸"},"examples":[{"en":"Time disfoliaged the old neighborhood of its charm.","zh":"岁月剥去了老街区的魅力。"},{"en":"The harsh light disfoliaged the scene, revealing every flaw.","zh":"刺眼的光把场景的“修饰”都剥掉了，暴露出每个缺点。"}]}],"synonyms":["defoliate","strip","denude","bare"],"phonetic":"/dɪsˈfoʊliɪdʒ/","extraExplanation":["“disfoliage”较少见，意思接近更常用的“defoliate（使落叶/使脱叶）”。在现代英语里，日常与学术写作通常更偏好用“defoliate”。","词形上可理解为 dis-（去除/相反）+ foliage（叶丛）。因为不常用，你在阅读时把它当作“defoliate”的文学化或变体理解通常就够了。"]}
{"word":"disfoliaged","summary":{"en":"“Disfoliaged” means made bare of leaves, or having had leaves stripped off.","zh":"“disfoliaged”表示“叶子被剥落、落尽，变得光秃无叶”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a tree or plant) stripped of leaves; made bare of foliage.","zh":"（指树木或植物）被剥去叶子、落尽叶子；变得光秃无叶。"},"examples":[{"en":"After the storm, the hillside was dotted with disfoliaged trees.","zh":"暴风雨过后，山坡上点缀着一棵棵被刮得光秃的树。"},{"en":"The insects left the orchard disfoliaged by late summer.","zh":"到夏末，虫害把果园啃得几乎无叶可剩。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “disfoliage”: to strip (a plant) of its leaves.","zh":"“disfoliage”的过去式/过去分词：使（植物）失去叶子；剥落叶。"},"examples":[{"en":"The caterpillars disfoliaged the young saplings in a few days.","zh":"毛毛虫几天内就把小树苗的叶子啃光了。"},{"en":"Strong winds had disfoliaged the branches overnight.","zh":"强风一夜之间把树枝上的叶子刮落了。"}]}],"synonyms":["defoliated","leafless","stripped of leaves","bare","denuded"],"phonetic":"/dɪsˈfoʊliɪdʒd/","extraExplanation":["“disfoliaged”较少见，常出现在较文学化或较正式的描写中，用来强调“被剥去叶子”的视觉效果。日常英语更常用的表达有：defoliated / stripped of leaves / leafless（若强调状态）。","词形结构：dis-（去除、使…失去）+ foliage（叶子、枝叶）。在生态学或农业语境里，更常见的术语是 defoliate/defoliated。"]}
{"word":"disforest","summary":{"en":"Disforest means (historically) to remove land from royal forest protection; rarely, it can mean to deforest.","zh":"Disforest 指（历史上）取消土地的王室林地法律地位；很少情况下也可指砍伐森林（同 deforest）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(historical/legal) To remove an area from “forest” status under old English forest law (so it is no longer protected as royal forest).","zh":"（历史/法律）把一片土地从“王室森林/林地”法定地位中除名，使其不再受旧英格兰森林法保护。"},"examples":[{"en":"In medieval England, the king could disforest land to allow more farming and settlement.","zh":"在中世纪的英格兰，国王可以将土地“除林”（disforest），以便进行更多耕作和定居。"},{"en":"Some records describe villages that were disforested after new boundaries were declared.","zh":"一些史料记载，在重新划定边界后，有些村庄所在地区被“除林”。"}]},{"partOfSpeech":"vt.","definition":{"en":"(rare) To clear land of forests; to deforest.","zh":"（罕见）清除林木；使土地失去森林覆盖（同 deforest）。"},"examples":[{"en":"Early writers sometimes used disforest where we would now say deforest.","zh":"早期作者有时用 disforest 表达我们现在说的 deforest（砍伐森林）。"},{"en":"Uncontrolled logging can disforest a hillside within a few years.","zh":"无序伐木可能在几年内让整座山坡失去森林覆盖。"}]}],"synonyms":["disafforest","deforest (rarely, in the clearing-trees sense)"],"phonetic":"/dɪsˈfɔrɪst/","extraExplanation":["“disforest”最常见于历史语境，尤其与英格兰中世纪的“forest law（森林法）”有关。这里的“forest”不一定只是“有很多树的森林”，更是一种法律地位：属于王室管辖、用于狩猎等的特殊区域。把土地“disforest”是指取消这种法律身份。","现代日常英语里几乎不用 disforest 表示“砍树”，一般用更常见的 deforest / deforestation。"]}
{"word":"disforestation","summary":{"en":"“Disforestation” is not standard; the correct word is “deforestation,” meaning the clearing of forests.","zh":"“disforestation”不是标准拼写；正确词是“deforestation”，意思是森林砍伐/毁林。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Likely a misspelling of “deforestation”: the cutting down and clearing of forests, often to use the land for farming, building, or other human activities.","zh":"很可能是“deforestation（森林砍伐/毁林）”的拼写错误：指砍伐并清理森林，常为了把土地用于农业、建设或其他人类活动。"},"examples":[{"en":"Deforestation can destroy animal habitats and reduce biodiversity.","zh":"森林砍伐会破坏动物栖息地并降低生物多样性。"},{"en":"The report links deforestation to soil erosion and floods.","zh":"报告将毁林与水土流失和洪水联系起来。"},{"en":"Many organizations work to stop deforestation in the Amazon.","zh":"许多组织致力于阻止亚马逊地区的森林砍伐。"}]}],"synonyms":["forest clearing","forest loss","logging (when emphasizing cutting trees)"],"phonetic":"/diˌfɔrəˈsteɪʃən/","extraExplanation":["标准拼写是 deforestation（不是 disforestation）。词根来自 de-（去除、减少）+ forest（森林）+ -ation（名词后缀，表示“……的过程/行为”）。","常见搭配：stop/curb/reduce deforestation（阻止/遏制/减少毁林）；illegal deforestation（非法砍伐）；deforestation rates（毁林率）。","相关词区分：reforestation（重新造林/再造林）；afforestation（在原本非森林地区造林）；forest degradation（森林退化，强调质量下降不一定完全消失）。"]}
{"word":"disform","summary":{"en":"“Disform” is a rare verb meaning “to deform; to distort the shape of something.”","zh":"“disform”是一个罕用动词，意思是“使变形；扭曲形状”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare) To make something lose its normal shape or form; to deform or disfigure.","zh":"（罕用）使某物失去正常形状或外观；使变形、毁容。"},"examples":[{"en":"The accident disformed the metal frame beyond repair.","zh":"事故把金属框架撞得严重变形，无法修复。"},{"en":"Old writers sometimes used “disform” where we would now say “deform.”","zh":"早期作家有时用“disform”，而现代英语通常说“deform”。"}]}],"synonyms":["deform","disfigure","distort","warp"],"phonetic":"/dɪsˈfɔrm/","extraExplanation":["“disform”在现代英语里非常少见，日常写作和考试中几乎不用。多数情况下更自然、更常见的词是“deform”（使变形）或“disfigure”（毁容、损坏外观）。","词源上可理解为 dis-（表示“使……不正常/相反”）+ form（形状），字面意思就是“把形状弄坏”。"]}
{"word":"disformity","summary":{"en":"“Disformity” is generally a nonstandard form; people usually mean “deformity,” a physical abnormality or defect.","zh":"“disformity”一般属于非标准用法；通常人们想表达的是“deformity”，指身体的异常或缺陷。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard or misspelling) Usually meant to be “deformity”: an abnormal shape or condition of a body part; a physical defect.","zh":"（非标准用法/常见拼写错误）通常指“deformity（畸形）”：身体部位形状或状态异常；生理缺陷。"},"examples":[{"en":"The report mentions a birth deformity (sometimes misspelled as “disformity”).","zh":"报告提到了先天畸形（有时会被误拼为“disformity”）。"},{"en":"Doctors can sometimes treat a deformity with surgery or therapy.","zh":"医生有时可以通过手术或治疗来处理畸形。"}]}],"synonyms":["deformity","malformation","abnormality","defect"],"phonetic":"/dɪsˈfɔrməti/","extraExplanation":["“disformity”在现代英语中非常少见，通常被视为把“deformity”拼错了。正式写作（论文、简历、报告）建议使用“deformity”。","词根提示：de-（离开/向下/变坏）+ form（形状）+ -ity（名词后缀）→ “形状变坏/不正常的状态”。"]}
{"word":"disfortune","summary":{"en":"“Disfortune” is a rare, old-fashioned form meaning “misfortune” (bad luck). In modern English, use “misfortune.”","zh":"“disfortune”是罕见的古旧形式，意思是“misfortune（不幸、厄运）”。现代英语中建议用“misfortune”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/old-fashioned) bad luck or an unfortunate event; misfortune.","zh":"（罕见/古旧用法）厄运；不幸的事情；相当于 misfortune。"},"examples":[{"en":"He blamed his disfortune on the storm that ruined the harvest.","zh":"他把自己的不幸归咎于那场毁掉收成的暴风雨。"},{"en":"After many disfortunes, she finally found a stable job.","zh":"经历了许多不幸之后，她终于找到了一份稳定的工作。"}]}],"synonyms":["misfortune","bad luck","hardship","setback"],"phonetic":"/dɪsˈfɔr.tʃən/","extraExplanation":["“disfortune”在现代英语里非常少见，通常被视为古旧拼写或非标准拼写；日常写作和考试中几乎都用更常见、更自然的“misfortune”。","词根上“mis-”表示“坏的/错误的”（misfortune），而“dis-”多表示“否定/相反/分开”。因此“disfortune”不符合现代常见构词习惯，也更容易被当作拼写错误。"]}
{"word":"disframe","summary":{"en":"Disframe means to remove something from its frame, and more rarely (in literary use) to unsettle someone mentally.","zh":"disframe 表示“把东西从框中取出/去框”，较少见的文学用法是“使人心神不宁、失去镇定”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove (a picture, mirror, etc.) from its frame; to unframe","zh":"把（画、镜子等）从框里取出；去掉外框"},"examples":[{"en":"We had to disframe the painting before shipping it overseas.","zh":"我们必须先把那幅画从画框里取出，再进行海外运输。"},{"en":"The conservator carefully disframed the old photograph to protect it from damage.","zh":"修复师小心地把老照片去框，以保护它不受损。"}]},{"partOfSpeech":"vt.","definition":{"en":"(rare, literary) to disturb or unsettle someone’s state of mind; to throw off balance","zh":"（罕见，文学用法）使心神不宁；使失去镇定"},"examples":[{"en":"The sudden news disframed him, and he couldn’t speak for a moment.","zh":"突如其来的消息让他心神大乱，一时说不出话来。"},{"en":"Her calm voice steadied the room when fear had disframed the crowd.","zh":"当恐惧让人群失去镇定时，她平静的声音稳住了全场。"}]}],"synonyms":["unframe","remove the frame","take out of the frame","unsettle","unnerve","rattle"],"phonetic":"/dɪsˈfreɪm/","extraExplanation":["“disframe”在现代英语中非常少见，更多见于较老的文本或刻意的文学表达。日常表达里，第一义通常直接说“remove the frame / take it out of the frame / unframe”；第二义更常用“unsettle, rattle, unnerve, discompose”。"]}
{"word":"disfranchise","summary":{"en":"Disenfranchise means to take away someone’s right to vote, or more broadly to strip people of power and fair participation.","zh":"Disenfranchise 指剥夺某人的投票权；也可泛指让某个群体失去权力、话语权或公平参与的机会。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to take away a person’s right to vote or other basic civil rights","zh":"剥夺（某人）的投票权或其他基本公民权利"},"examples":[{"en":"The new law was criticized for potentially disenfranchising young voters.","zh":"这项新法律因可能剥夺年轻选民的投票权而受到批评。"},{"en":"Historically, many groups were disenfranchised because of race or gender.","zh":"历史上，许多群体曾因种族或性别而被剥夺选举权。"}]},{"partOfSpeech":"vt.","definition":{"en":"to prevent a person or group from having power, a voice, or fair participation in society","zh":"使（个人或群体）失去权力、发声机会或公平参与社会的资格（引申义）"},"examples":[{"en":"High fees can disenfranchise low-income students from certain programs.","zh":"高额费用可能会让低收入学生无法公平参与某些项目。"},{"en":"Workers felt disenfranchised when decisions were made without their input.","zh":"当决定在没有征求他们意见的情况下作出时，工人们觉得自己被边缘化、失去话语权。"}]}],"synonyms":["deprive","strip (of rights)","disqualify","marginalize"],"phonetic":"/ˌdɪsənˈfræn(t)ʃaɪz/","extraExplanation":["词源提示：dis- 表示“去掉、否定”，enfranchise 来自 franchise（“特权、选举权；授予权利”）。因此 disenfranchise 字面意思就是“把（选举）权利拿走”。","常见搭配：disenfranchise voters（剥夺选民投票权），disenfranchise a community（让某个群体失去话语权/被边缘化）。在新闻与社会议题中很常见。"]}
{"word":"disfranchised","summary":{"en":"Disfranchised means deprived of voting rights, or more broadly feeling excluded and powerless in society.","zh":"Disfranchised 指被剥夺选举权；也可泛指在社会中被排除、感到无力无权。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having been deprived of the right to vote or participate fully in political life","zh":"被剥夺选举权或被排除在政治参与之外的"},"examples":[{"en":"In the past, many people were disfranchised and could not vote.","zh":"在过去，许多人被剥夺选举权，无法投票。"},{"en":"The law effectively left poor citizens disfranchised.","zh":"这项法律实际上让贫困公民失去了选举权。"}]},{"partOfSpeech":"adj.","definition":{"en":"feeling powerless or excluded from having influence in society, even outside elections","zh":"（引申）感到无权、被排除在社会影响力之外的"},"examples":[{"en":"Some young people feel disfranchised when they think no one listens to their concerns.","zh":"一些年轻人觉得无人倾听他们的诉求时，会感到被边缘化、无权无力。"},{"en":"Workers became disfranchised after repeated layoffs and broken promises.","zh":"在反复裁员和承诺落空之后，工人们感到无力且被忽视。"}]},{"partOfSpeech":"vt.","definition":{"en":"to deprive (someone) of the right to vote or of a legal right","zh":"剥夺（某人）的选举权或法定权利"},"examples":[{"en":"Some governments have tried to disfranchise political opponents.","zh":"一些政府曾试图剥夺政治对手的选举权。"},{"en":"The new rules could disfranchise eligible voters by making registration harder.","zh":"新规定可能因增加登记难度而让本应有资格的选民失去投票机会。"}]}],"synonyms":["deprived (of rights)","disenfranchised","excluded","marginalized","powerless"],"phonetic":"/dɪsˈfræn(t)ʃaɪzd/","extraExplanation":["disfranchised 来自 dis-（去除、否定）+ franchise（选举权、特许权）。franchise 原义与“自由、权利”有关，因此 disfranchise 字面就是“取消某人的权利”，最常指取消投票权。","现代新闻与社会讨论中，disfranchised 也常用来形容“被边缘化、觉得自己没有发言权”的群体，不一定真的失去法律上的投票权。"]}
{"word":"disfranchisement","summary":{"en":"Disfranchisement means the removal of voting rights, or more generally being deprived of rights or full participation.","zh":"Disfranchisement 指“剥夺选举权”，也可泛指“被剥夺权利/被排除在充分参与之外”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of taking away a person’s right to vote (or the state of being unable to vote).","zh":"剥夺（某人）的选举权；（或）处于无法投票的状态。"},"examples":[{"en":"The new law was criticized as voter disfranchisement.","zh":"这项新法律被批评为对选民选举权的剥夺。"},{"en":"After his felony conviction, he faced temporary disfranchisement in some states.","zh":"因重罪定罪，他在一些州面临暂时失去投票权的情况。"},{"en":"Activists worked to end the disfranchisement of minority communities.","zh":"活动人士致力于终结对少数族裔社区选举权的剥夺。"}]},{"partOfSpeech":"n.","definition":{"en":"More broadly, the act of taking away someone’s rights, power, or opportunities; exclusion from full participation in society.","zh":"更广义地：剥夺某人的权利、权力或机会；把人排除在社会充分参与之外。"},"examples":[{"en":"Many workers felt a sense of disfranchisement when decisions were made without them.","zh":"当决策绕开他们时，许多员工感到自己被剥夺了参与权。"},{"en":"Economic inequality can lead to political and social disfranchisement.","zh":"经济不平等可能导致政治与社会层面的被剥夺感。"}]}],"synonyms":["voter disenfranchisement","disenfranchisement","deprivation of rights","exclusion","marginalization"],"phonetic":"/ˌdɪsˈfræn.tʃaɪz.mənt/","extraExplanation":["“disfranchisement”常出现在美国历史与政治语境中，尤其与重建时期后的“Jim Crow（种族隔离）”制度有关：通过识字测试、人头税等方式限制非裔美国人的投票权。","在现代新闻中，它常与“voter suppression（压制投票）”一起出现，但语气更强：disfranchisement强调“使人失去投票资格/权利”的结果。","词源提示：franchise原意与“自由、特权”有关（也可指“特许经营权”）；dis-表示“去除、取消”，合起来就是“取消（投票等）权利”。"]}
{"word":"disfranchisements","summary":{"en":"Disfranchisements are instances of taking away the right to vote or, more broadly, depriving people of rights or a voice.","zh":"disfranchisements 指多次/多种“剥夺投票权（选举权）”的情况，也可泛指剥夺权利或话语权。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of taking away someone’s right to vote or participate in elections; the condition of being denied that right","zh":"剥夺（某人）的选举权/投票权；被剥夺选举权的状态"},"examples":[{"en":"Many activists fought against the disfranchisement of Black voters.","zh":"许多社会运动者反对剥夺黑人选民的投票权。"},{"en":"New rules led to the disfranchisement of some elderly and low-income voters.","zh":"新规定导致一些老年人和低收入选民失去投票资格。"}]},{"partOfSpeech":"n.","definition":{"en":"more generally, the act of depriving someone of rights, privileges, or a voice in decision-making","zh":"（更广义）剥夺权利、特权或在决策中发声/参与的机会"},"examples":[{"en":"Employees described a sense of disfranchisement when management ignored their concerns.","zh":"当管理层无视员工的担忧时，员工形容自己有一种被剥夺话语权的感觉。"},{"en":"The policy increased political and economic disfranchisement in the region.","zh":"该政策加剧了该地区在政治与经济上的权利被剥夺。"}]}],"synonyms":["deprivation of voting rights","disenfranchisement","exclusion","deprivation","marginalization"],"phonetic":"/ˌdɪsˈfræn(t)ʃaɪzmənts/","extraExplanation":["“disfranchisements”是复数形式；更常用的词条是单数“disfranchisement”。核心词根是“franchise（选举权/特许权）”，前缀“dis-”表示“去除、取消”，因此字面意思就是“取消（某人的）选举权”。","在美国历史与新闻语境中，这个词常与投票权议题相关，例如重建时期后通过识字测试、人头税等方式限制投票；现代语境也常讨论身份证件要求、选区划分等是否会造成“disfranchisement”。"]}
{"word":"disfranchiser","summary":{"en":"A disfranchiser is someone or something that deprives people of the right to vote.","zh":"disfranchiser 指剥夺他人投票权（选举权）的人或机构。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or group that takes away someone’s right to vote or participate in elections","zh":"剥夺他人投票权或选举参与权的人（或团体）"},"examples":[{"en":"The law was criticized because it empowered local officials to act as disfranchisers.","zh":"这项法律受到批评，因为它让地方官员有权充当“剥夺投票权者”。"},{"en":"Historically, some disfranchisers used unfair tests and rules to keep certain groups from voting.","zh":"历史上，一些剥夺投票权者会用不公平的测试和规定来阻止某些群体投票。"}]}],"synonyms":["voter suppressor","disenfranchiser","oppressor"],"phonetic":"/ˌdɪsˈfræn(t)ʃaɪzər/","extraExplanation":["“disfranchiser”由动词“disfranchise（剥夺选举权）”加上表示“做某事的人/物”的后缀“-er”构成，强调“实施剥夺的人或机构”。","在美国语境中，这个词常出现在讨论投票权（voting rights）、选民压制（voter suppression）、重罪犯投票限制（felon disenfranchisement）等议题时。它通常带有强烈的负面评价色彩。"]}
{"word":"disfranchisers","summary":{"en":"“Disfranchisers” are people or groups that remove or restrict others’ voting rights.","zh":"“Disfranchisers”指剥夺或限制他人投票权的人或团体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People, groups, or institutions that take away (or work to take away) someone’s right to vote or other political rights.","zh":"剥夺（或试图剥夺）他人投票权或其他政治权利的人、团体或机构。"},"examples":[{"en":"Civil rights groups sued the disfranchisers who tried to block eligible voters from registering.","zh":"民权团体起诉了那些试图阻止合格选民登记投票的剥夺投票权者。"},{"en":"Many critics argued that strict ID rules could act as disfranchisers for low-income voters.","zh":"许多批评者认为，严格的身份证件规定可能会成为对低收入选民的“剥夺投票权机制”。"}]}],"synonyms":["vote suppressors","oppressors","rights restrictors"],"phonetic":"/ˌdɪsˈfrænˌtʃaɪzərz/","extraExplanation":["“disfranchisers”是复数形式，单数是“disfranchiser”。核心来自动词“disfranchise”（剥夺选举权/公民权）。","在美国语境中，这个词常与选民压制（voter suppression）讨论相关，历史上也可指通过法律、考试、税等方式限制特定群体投票的做法。使用时往往带有批评色彩。"]}
{"word":"disfranchises","summary":{"en":"“Disfranchises” means takes away the right to vote, or more generally deprives someone of rights or power.","zh":"“disfranchises”指剥夺投票权；也可泛指剥夺某人的权利或影响力。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to take away someone’s right to vote or take part in elections","zh":"剥夺（某人）的投票权或选举参与权"},"examples":[{"en":"The law disfranchises people who are not citizens.","zh":"这项法律剥夺了非公民的投票权。"},{"en":"In the past, some states disfranchised women and many minorities.","zh":"过去，一些州曾剥夺女性和许多少数族裔的投票权。"}]},{"partOfSpeech":"vt.","definition":{"en":"to deprive someone of a right, privilege, or power (more general use)","zh":"（更广义）剥夺（某人）的权利、特权或权力"},"examples":[{"en":"Unfair rules can disfranchise students from having a real voice in school decisions.","zh":"不公平的规定可能会让学生在学校决策中失去真正发声的权利。"},{"en":"The policy effectively disfranchises small communities by limiting their representation.","zh":"这项政策通过限制代表权，实际上让小社区失去应有的影响力。"}]}],"synonyms":["deprives","strips (of rights)","disqualifies (from voting)","marginalizes","excludes"],"phonetic":"/ˌdɪsˈfrænˌtʃaɪzɪz/","extraExplanation":["“disfranchises”是动词第三人称单数形式，原形是“disfranchise”。常见于政治与公民权利语境，尤其与“voting rights（投票权）”“voter suppression（压制选民投票）”等话题相关。","历史上该词常用于描述以法律或制度手段剥夺特定群体投票权的做法，例如某些时期对女性、非裔美国人或贫困人群设置投票障碍。现代语境也可更宽泛地指“让某群体失去发声或参与的机会”。"]}
{"word":"disfranchising","summary":{"en":"“Disfranchising” means taking away the right to vote, or more generally removing someone’s rights or power.","zh":"“disfranchising”指剥夺投票权，也可泛指剥夺某人的权利或影响力。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"depriving a person or group of the legal right to vote (taking away the franchise)","zh":"剥夺某人或某群体的法定投票权（选举权）"},"examples":[{"en":"The new law was criticized for disfranchising poor and minority voters.","zh":"这项新法律因剥夺贫困和少数族裔选民的投票权而受到批评。"},{"en":"Poll taxes and literacy tests were used for years as tools for disfranchising Black citizens.","zh":"人头税和识字测试多年被用作剥夺黑人公民投票权的工具。"}]},{"partOfSpeech":"v.","definition":{"en":"depriving someone of a right, privilege, or power (not only voting)","zh":"剥夺某人的权利、特权或影响力（不只指投票）"},"examples":[{"en":"She felt the policy was disfranchising workers by removing their voice in decisions.","zh":"她觉得这项政策通过剥夺工人在决策中的发言权而让工人失去权利。"},{"en":"When residents were not consulted, they described the process as disfranchising the community.","zh":"当居民没有被征询意见时，他们把这一过程称为剥夺社区的权利。"}]}],"synonyms":["disenfranchising","depriving","stripping (of rights)","excluding","marginalizing"],"phonetic":"/dɪsˈfrænˌtʃaɪzɪŋ/","extraExplanation":["“disfranchising”来自动词 disfranchise，核心含义是“把某人从‘拥有选举权（franchise）’的状态中移除”。在美国历史语境里，它常与重建时期之后的南方各州限制黑人投票权的做法相关（如 literacy tests、poll taxes 等），现代也常用于讨论选民身份证法、选区划分（gerrymandering）等是否会造成事实上的投票权受限。","写作与新闻中，disfranchise/disenfranchise 两种拼法都常见，意义基本相同；disenfranchise 在当代美式英语里更常用。"]}
{"word":"disfrancnise","summary":{"en":"Disfranchise means to take away someone’s right to vote or to take away important rights or power.","zh":"Disfranchise 指剥夺投票权，或更广义地剥夺重要权利与权力。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to take away someone’s right to vote or to have a voice in decisions (especially in politics)","zh":"剥夺某人的投票权或参与决策的权利（尤指政治上）"},"examples":[{"en":"The new law could disfranchise thousands of voters.","zh":"这项新法律可能会剥夺成千上万选民的投票权。"},{"en":"Historically, some groups were disfranchised through unfair rules and tests.","zh":"历史上，一些群体曾因不公平的规定和测试而被剥夺选举权。"},{"en":"She argued that strict ID requirements would disfranchise poor and elderly citizens.","zh":"她认为严格的身份证件要求会剥夺贫困和年长公民的投票权。"}]},{"partOfSpeech":"vt.","definition":{"en":"to deprive someone of a right, privilege, or power (more general use)","zh":"剥夺某人的权利、特权或权力（更广义用法）"},"examples":[{"en":"Rules that ignore workers’ needs can disfranchise them in the workplace.","zh":"忽视员工需求的规定可能会让他们在工作场所被剥夺话语权。"},{"en":"The policy left local communities feeling disfranchised.","zh":"这项政策让当地社区感到自己被剥夺了权利与发言权。"}]}],"synonyms":["deprive","strip (someone) of rights","disqualify (from voting)","exclude"],"phonetic":"/dɪsˈfrænˌtʃaɪz/","extraExplanation":["你输入的 **disfrancnise** 很可能是拼写错误，正确拼写是 **disfranchise**。","词源上与 **franchise**（特许权；选举权）有关：**dis-** 表示“取消/剥夺”，所以 **disfranchise** 就是“取消某人的（选举等）权利”。","常见搭配：**disfranchise voters / citizens**（剥夺选民/公民投票权），**be disfranchised**（被剥夺权利）。拼写注意：中间是 **-franchise-**，不是 **-francnise-**。"]}
{"word":"disfrequent","summary":{"en":"Disfrequent is an archaic verb meaning to make something less frequent or to stop going somewhere often.","zh":"disfrequent 是一个古旧动词，意思是“使不那么频繁”或“减少去某地的次数/不再常去”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Archaic) to make something happen less often; to break up a habit or routine so it is no longer frequent.","zh":"（古旧用法）使某事发生得不那么频繁；打破某种习惯或常规，使之不再经常发生。"},"examples":[{"en":"They disfrequented their weekly meetings during the winter.","zh":"冬天他们把每周的聚会变得不那么频繁了。"},{"en":"The doctor advised him to disfrequent late-night work.","zh":"医生建议他减少熬夜工作的次数。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Archaic, usually of a place) to stop going to a place often; to visit less frequently.","zh":"（古旧用法，常指地点）不再经常去某地；减少去某地的频率。"},"examples":[{"en":"After the quarrel, she disfrequented the café they used to visit.","zh":"争吵之后，她不再常去他们以前常去的那家咖啡馆。"},{"en":"He disfrequented the library once he finished his research.","zh":"研究结束后，他就很少再去图书馆了。"}]}],"synonyms":["reduce","decrease","discontinue","stop frequenting","visit less often","cut back (on)"],"phonetic":"/dɪsˈfriːkwənt/","extraExplanation":["这个词在现代英语中非常少见，带有明显的“古典/文学”色彩；日常写作更常用：reduce, decrease, visit less often, stop frequenting, discontinue 等。","构词上是 dis-（使相反/去除）+ frequent（频繁的/常去的），意思就是“让频繁变得不频繁”。","在较老的文学作品或仿古风格中可能见到；现代读者通常会把它理解为“减少频率/不再常去”。"]}
{"word":"disfriar","summary":{"en":"“Disfriar” is not a standard English word; it’s likely a misspelling or a non-English form. Share your sentence to find the intended word.","zh":"“disfriar”不是标准英语单词；多半是拼写错误或外来语形式。把原句发来可帮你找到想表达的正确词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling or a non-English form. In English writing, it may be an intended spelling of another word (e.g., “disfrayer” is not common either).","zh":"不是标准英语单词；最常见情况是拼写错误或来自其他语言的形式。在英文语境中通常是想写另一个词（例如并不常见的拼法等）。"},"examples":[{"en":"I couldn’t find “disfriar” in an English dictionary—did you mean another word?","zh":"我在英语词典里找不到“disfriar”——你是不是想写别的词？"},{"en":"If you tell me the sentence, I can help you identify the correct word.","zh":"如果你把原句发我，我可以帮你确认正确的单词。"}]}],"phonetic":"/dɪsˈfraɪər/","extraExplanation":["“disfriar”在英语里基本查不到，建议你提供：①原句；②你想表达的意思（例如“享受/冷却/使失望/修理”等）；③是否来自西班牙语/葡萄牙语。","如果你其实是在写西班牙语或葡萄牙语：你可能想写的是 **desfriar**（葡语/加利西亚语里常见，意思类似“冷却/变凉”），或西语的 **enfriar**（“使变冷”）。","如果你原本想写英文里发音/拼写相近的词，也可能是：**disrepair**（破败，失修）、**disfranchise**（剥夺选举权）、**disfigure**（毁容/损坏外观）。把上下文给我，我可以精准匹配。"]}
{"word":"disfrock","summary":{"en":"Disfrock means to officially remove a priest or minister from the clergy; to defrock.","zh":"disfrock 指（正式地）革除神职，剥夺神职人员身份（同 defrock）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove a priest or minister from the clergy (officially), so they are no longer allowed to act as a priest; to defrock","zh":"（正式地）革除神职；剥夺（神职人员）的教士身份；使其不再有资格履行神职（同 defrock）"},"examples":[{"en":"The church voted to disfrock the priest after an investigation.","zh":"调查之后，教会投票决定革除那位神父的神职。"},{"en":"He was disfrocked and forbidden to perform religious ceremonies.","zh":"他被革除神职，并被禁止主持宗教仪式。"}]}],"synonyms":["defrock","unfrock"],"phonetic":"/dɪsˈfrɑk/","extraExplanation":["disfrock 是比较少见、偏正式的用词，意思与更常用的 defrock 基本相同。词根里 frock 原指（部分宗教人士穿的）长袍、法衣；dis- 表示“去除、取消”，所以字面有“脱去法衣”的含义，引申为“撤销神职”。","在不同宗派与制度中，相关程序与后果可能不同：有的强调“撤销任命/许可”，有的强调“取消教士身份”。日常英语里，新闻或非宗教语境更常用 defrock。"]}
{"word":"disfrocked","summary":{"en":"Disfrocked means a clergy member has been officially removed from their religious office (or to remove them).","zh":"disfrocked 指神职人员被正式解除圣职（也可作动词：解除某人的圣职）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a priest or member of the clergy) officially removed from the position and no longer allowed to perform religious duties.","zh":"（指牧师或神职人员）被正式解除圣职/革职，不再被允许履行宗教职务。"},"examples":[{"en":"The priest was disfrocked after the investigation.","zh":"调查之后，这位神父被革除了圣职。"},{"en":"A disgraced minister may be disfrocked by church authorities.","zh":"名誉受损的牧师可能会被教会当局解除圣职。"}]},{"partOfSpeech":"vt.","definition":{"en":"to officially remove (a priest or member of the clergy) from their position; to defrock.","zh":"正式解除（神职人员）的圣职；革职（同 defrock）。"},"examples":[{"en":"The bishop decided to disfrock him for violating church rules.","zh":"主教决定因其违反教规而解除他的圣职。"},{"en":"They moved to disfrock the cleric following serious allegations.","zh":"在严重指控之后，他们着手解除该神职人员的圣职。"}]}],"synonyms":["defrocked","laicized","dismissed from the clergy","removed from office"],"phonetic":"/dɪsˈfrɑkt/","extraExplanation":["“disfrocked”来自“frock”（长袍、僧袍/法衣）。在基督教语境里，frock指神职人员穿的法衣；disfrock/defrock字面上有“把法衣脱掉”的意思，引申为“剥夺神职身份”。","该词多用于正式、新闻或教会纪律处分的语境，含义较严肃；日常英语里更常见的是“defrock”。"]}
{"word":"disfrocking","summary":{"en":"Disfrocking is the act or process of removing a clergy member’s right to wear clerical robes and/or their official clerical status, usually as a disciplinary punishment.","zh":"Disfrocking 指对神职人员撤袍或解除神职身份的行为/过程，通常属于教会纪律处分。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of removing a priest or clergy member’s right to wear clerical robes (a “frock”), usually as a punishment; defrocking","zh":"（对神职人员的）褫夺圣职服装权/撤销穿神职袍资格的行为，通常作为惩罚；即“撤袍/褫袍（defrocking）”"},"examples":[{"en":"The bishop ordered the priest’s disfrocking after an investigation.","zh":"调查后，主教下令对该神父进行撤袍处分。"},{"en":"The report described the disfrocking as a disciplinary measure, not a criminal sentence.","zh":"报告指出，这次撤袍是教会纪律处分，并非刑事判决。"}]},{"partOfSpeech":"n.","definition":{"en":"the process of officially dismissing someone from the clergy or removing their clerical status","zh":"（正式）将某人从神职体系中除名/解除其神职身份的过程"},"examples":[{"en":"In some traditions, disfrocking requires a formal church trial.","zh":"在某些传统中，解除神职（disfrocking）需要正式的教会审理。"},{"en":"Public debates followed the disfrocking of a well-known minister.","zh":"一位知名牧师被解除神职后，引发了公众讨论。"}]}],"synonyms":["defrocking","defrockment","laicization (formal, Catholic context)","removal from the clergy"],"phonetic":"/dɪsˈfrɑkɪŋ/","extraExplanation":["“disfrocking”来自动词“disfrock”，字面意思是“脱去（神职）长袍（frock）”。在英语新闻语境中，它多用于天主教、东正教或圣公会等有明确神职服饰与等级制度的传统。","不同宗派用词可能不同：天主教常见说法是“defrocking”或更正式的“laicization”（转为平信徒身份/解除圣职），但媒体有时会用“disfrocking”来概括。","该词带有明显的宗教与制度色彩，通常涉及教会内部纪律处分，并不等同于国家法律层面的定罪或量刑。"]}
{"word":"disfrocks","summary":{"en":"“Disfrocks” means removes a priest or other clergy member from their position or right to act as clergy (defrocks).","zh":"“Disfrocks”指（教会）革除神职人员的圣职身份或其行使圣职的权利（同 defrock）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove a member of the clergy (such as a priest) from their religious office or the right to act as clergy; to defrock","zh":"（正式）解除神职人员的圣职身份或其行使圣职的权利；革除圣职（同 defrock）"},"examples":[{"en":"The church disfrocked the priest after an internal investigation.","zh":"教会在内部调查后革除了那位神父的圣职。"},{"en":"Some people confuse being disfrocked with leaving the church voluntarily.","zh":"有些人会把“被革除圣职”和“自愿离开教会”混为一谈。"}]}],"synonyms":["defrock","remove from office","strip of clerical status"],"phonetic":"/dɪsˈfrɑks/","extraExplanation":["“disfrocks”通常是动词 disfrock 的第三人称单数形式（he/she disfrocks），也可能被当作复数形式的误写；词典里更常见的拼写是 defrock（去掉/剥夺 clergy 的“法衣”象征），语气较正式，多用于宗教或法律/新闻语境。","在不同宗派中，相关程序和后果可能不同：有的只是禁止履行圣职（如主持仪式），不一定等同于被逐出教会（excommunicate，绝罚/逐出教会）。"]}
{"word":"disfunction","summary":{"en":"Dysfunction means something is not working properly, in the body, a person’s behavior, or a system.","zh":"dysfunction 指身体、行为或系统“不能正常运作”的功能障碍/失调。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Common spelling: dysfunction) A problem or abnormal condition where something (a body part, a person, or a system) does not work properly.","zh":"（常见拼写：dysfunction）功能障碍；失调：指身体部位、个人或系统不能正常运作的状态。"},"examples":[{"en":"Stress can lead to sleep dysfunction.","zh":"压力可能导致睡眠功能失调。"},{"en":"The report described dysfunction in the local government system.","zh":"报告描述了地方政府系统的运作失灵。"},{"en":"He is receiving treatment for sexual dysfunction.","zh":"他正在接受性功能障碍的治疗。"}]}],"synonyms":["malfunction","impairment","disorder","breakdown"],"phonetic":"/dɪsˈfʌŋkʃən/","extraExplanation":["你输入的“disfunction”通常被认为是拼写错误；标准拼写是“dysfunction”。前缀“dys-”表示“坏的、不正常的”（如：dyslexia 阅读障碍，dystopia 反乌托邦）。"]}
{"word":"disfunctions","summary":{"en":"“Dysfunctions” means problems in normal functioning (most often used as a plural noun).","zh":"“dysfunctions”指（多种）功能障碍/失常，最常见用法是复数名词。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually plural) Problems or failures in the normal functioning of a system, organ, relationship, or organization.","zh":"（常用复数）功能障碍；（系统、器官、人际关系或组织的）失常/失灵。"},"examples":[{"en":"The doctor explained that the patient’s symptoms were caused by hormonal dysfunctions.","zh":"医生解释说，病人的症状是由激素功能障碍引起的。"},{"en":"The report points to dysfunctions in the company’s management system.","zh":"报告指出公司管理体系存在失常。"}]},{"partOfSpeech":"v.","definition":{"en":"To function abnormally or poorly; to fail to work as it should.","zh":"功能失常；运转不良；无法正常工作。"},"examples":[{"en":"If the engine is malfunctioning or dysfunctioning, stop the machine immediately.","zh":"如果发动机故障或运转失常，请立即停机。"}]}],"synonyms":["disorders","impairments","malfunctions","breakdowns"],"phonetic":"/dɪsˈfʌŋkʃənz/","extraExplanation":["你输入的“disfunctions”更常见的拼写是 **dysfunctions**（前缀 *dys-* 表示“坏的、不正常的”，如 *disease* 的 *dis-* 不同）。在医学和心理学里特别常用，如 *sexual dysfunction*（性功能障碍）、*executive dysfunction*（执行功能障碍）。","名词 **dysfunction** 可数时表示“某一种具体的功能障碍”；复数 **dysfunctions** 强调“多种/多处问题”。另外，口语与正式写作中更常用 **dysfunction(s)** 作为名词，而动词用法相对少见。"]}
{"word":"disfurnish","summary":{"en":"Disfurnish means to take furniture out of a place, leaving it unfurnished.","zh":"disfurnish 指把某处的家具/陈设搬走，使其变成没有家具的状态。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove furniture or furnishings from a room or house; to make a place unfurnished","zh":"把房间或房屋里的家具/陈设搬走；使其变得空置（无家具）"},"examples":[{"en":"They disfurnished the apartment before turning in the keys.","zh":"他们在交钥匙前把公寓里的家具都搬走了。"},{"en":"After the sale, the old house was quickly disfurnished and left bare.","zh":"出售后，那栋老房子很快被搬空，变得空荡荡的。"}]}],"synonyms":["defurnish","unfurnish","clear out","empty (a room)","remove the furniture"],"phonetic":"/dɪsˈfɝnɪʃ/","extraExplanation":["“disfurnish”较少见，带有较强的书面/文学色彩；日常英语里更常用“remove the furniture (from ...)”“empty (a room)”“clear out (a place)”。","词形上可理解为 dis-（去除、反向）+ furnish（布置、配家具），所以字面意思就是“把家具撤掉/撤除布置”。"]}
{"word":"disfurnished","summary":{"en":"Disfurnished means having the furniture removed; left unfurnished.","zh":"disfurnished 指家具被搬走、空间变得没有陈设（被清空）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a room, house, or space) stripped of furniture; left without furnishings; unfurnished.","zh":"（房间、房屋或空间）被搬空家具的；没有陈设的；空荡荡的。"},"examples":[{"en":"After the tenants moved out, the apartment was disfurnished and ready for repairs.","zh":"房客搬走后，公寓被搬空了家具，准备进行维修。"},{"en":"They walked through the disfurnished living room, hearing their footsteps echo.","zh":"他们走过那间空荡荡的客厅，脚步声在里面回响。"}]}],"synonyms":["unfurnished","empty","bare","stripped (of furniture)"],"phonetic":"/ˌdɪsˈfɝnɪʃt/","extraExplanation":["“disfurnished”来自动词“disfurnish”（把家具撤走/搬走），在现代英语里比较少见，更常用的是“unfurnished / empty / stripped of furniture”。在文学或较正式的叙述中，用它能强调“曾经有家具、后来被清空”的变化感。"]}
{"word":"disfurnishment","summary":{"en":"Disfurnishment means the removal of furniture or the condition of being without furnishings, often in formal or legal writing.","zh":"disfurnishment 指“搬走家具/清空陈设”或“没有家具”的状态，常见于较正式或法律类文本。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of removing furniture and household items from a place; the state of being left without furnishings.","zh":"把家具和家用物品搬走（清空）的行为；或指处于“没有家具陈设”的状态。"},"examples":[{"en":"After the tenant left, the apartment showed clear signs of disfurnishment.","zh":"房客搬走后，公寓明显呈现出被清空家具的痕迹。"},{"en":"The landlord claimed the unit suffered disfurnishment and damage before the inspection.","zh":"房东称在检查前房屋被清空了家具并遭到损坏。"}]}],"synonyms":["removal of furniture","clear-out","vacating","emptying (out)","unfurnishing"],"phonetic":"/ˌdɪsˈfɝːnɪʃmənt/","extraExplanation":["“disfurnishment”非常少见，多见于较旧的书面语或法律/房产语境，用来描述“搬走家具导致房屋变空”的情况。日常英语里更常说：the removal of furniture, clearing out the furniture, an unfurnished place。","构词上可以理解为 dis-（去除、相反）+ furnish（配家具、布置）+ -ment（名词后缀），字面意思就是“去家具化/撤除家具”。"]}
{"word":"disfurniture","summary":{"en":"Disfurniture means to remove the furniture from a place, leaving it unfurnished.","zh":"Disfurniture 指把某处的家具移走，使其变成没有家具的状态。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove the furniture from a room, house, or building; to strip it of furnishings.","zh":"（把房间/房屋等）搬空家具；使其不再陈设（把家具移走）。"},"examples":[{"en":"They disfurnished the apartment before the renovation began.","zh":"翻新工程开始前，他们把公寓的家具都搬走了。"},{"en":"After the tenant left, the landlord found the house completely disfurnished.","zh":"房客搬走后，房东发现房子被搬得空空如也。"}]}],"synonyms":["unfurnish","strip (a room)","clear out","empty (a room)"],"phonetic":"/dɪsˈfɝːnɪtʃɚ/","extraExplanation":["“disfurniture”是非常少见、偏旧式的用法，常见于较正式或文学性的语境中。日常英语里更常说“remove the furniture”“empty/clear out the room”“unfurnish (a room)”。","词形上可理解为前缀“dis-”（表示“去掉、移除”）+ “furniture”（家具），意思就是“把家具移走/使不再有家具”。"]}
