{"word":"disgage","summary":{"en":"“Disengage” means to separate or free something, or to stop being involved; it’s also used for breaking contact or disconnecting in technical/military contexts.","zh":"“Disengage”指使脱离、解开或不再参与；也可指（技术/军事）脱离接触或断开连接。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Correct spelling) to separate or free (someone or something) from something it is stuck to, involved with, or connected to; to stop being involved in an activity or relationship.","zh":"（正确拼写）使（人或物）脱离、解开；（从活动或关系中）退出、不再参与。"},"examples":[{"en":"The car couldn’t move because the gears wouldn’t disengage.","zh":"车子开不动，因为齿轮无法脱开。"},{"en":"She tried to disengage herself from the argument and stay calm.","zh":"她努力让自己从争吵中抽离，保持冷静。"},{"en":"After work, I like to disengage from emails and rest.","zh":"下班后，我喜欢不再看邮件，好好休息。"}]},{"partOfSpeech":"v.","definition":{"en":"(Military/technical) to break contact with an enemy or to stop operating/connecting in a system.","zh":"（军事/技术）脱离接触；断开（系统连接）或停止啮合/运作。"},"examples":[{"en":"The troops disengaged and moved to a safer position.","zh":"部队脱离接触，转移到更安全的位置。"},{"en":"Press this button to disengage the motor.","zh":"按下这个按钮以断开电机。"}]}],"synonyms":["detach","separate","withdraw","disconnect","unhook"],"phonetic":"/ˌdɪsɛnˈɡeɪdʒ/","extraExplanation":["你输入的“disgage”通常是拼写错误，更常见的正确拼写是 **disengage**。","常见搭配：**disengage from**（从……抽离/退出），**disengage the clutch/gears**（汽车离合器/齿轮“脱开”）。","语体上既可用于日常心理/社交语境（从争执、压力、社交媒体中抽离），也常用于机械和军事语境。"]}
{"word":"disgallant","summary":{"en":"“Disgallant” means discourteous or lacking the polite, gallant manner expected in formal or old-fashioned contexts.","zh":"“disgallant”指不够礼貌、缺乏绅士风度（较偏旧式/文学用法）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not gallant; lacking polite, respectful, or chivalrous behavior (especially toward women); discourteous","zh":"不殷勤的；缺乏礼貌或绅士风度的（尤指对女性）；无礼的"},"examples":[{"en":"His joke at the meeting sounded disgallant and made people uncomfortable.","zh":"他在会议上的玩笑显得很不绅士，让大家都不舒服。"},{"en":"It was considered disgallant to ignore a guest who had just arrived.","zh":"在当时看来，对刚到的客人置之不理被认为很失礼。"}]}],"synonyms":["discourteous","impolite","rude","ungentlemanly","ungracious"],"phonetic":"/dɪsˈɡæl.ənt/","extraExplanation":["“disgallant”较为少见、带有古典/文学色彩，日常英语更常用“rude / impolite / ungentlemanly”。","词根上，“gallant”可指“殷勤、彬彬有礼（尤指对女性）”或“英勇的”。“dis-”表示否定，因此“disgallant”就是“缺乏那种礼貌/殷勤（或英勇）”。在语境里通常指“失礼、不体面”，而不是单纯“胆怯”。"]}
{"word":"disgarland","summary":{"en":"Disgarland means to remove a garland or, in literary use, to strip someone of honors symbolized by a wreath or crown.","zh":"disgarland 指“摘下花环/桂冠”，引申为（文学用法）褫夺以花环象征的荣誉。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove a garland (a wreath of flowers or leaves) from someone or something; to strip off decoration","zh":"摘下（花环、桂冠等）；去掉装饰"},"examples":[{"en":"After the ceremony, they disgarlanded the statue and stored the wreaths away.","zh":"仪式结束后，他们把雕像上的花环取下并把花圈收好。"},{"en":"The wind disgarlanded the archway, scattering leaves across the path.","zh":"风把拱门上的装饰吹落，树叶散落在小路上。"}]},{"partOfSpeech":"vt.","definition":{"en":"(literary/archaic) to deprive someone of honor, celebration, or a symbol of victory (as if removing a crown or wreath)","zh":"（文学/古语）夺去荣誉或胜利的象征（仿佛摘掉桂冠）"},"examples":[{"en":"He felt disgarlanded by the harsh review, as if his hard work had been un-crowned.","zh":"那篇尖刻的评论让他觉得自己被“摘掉桂冠”，辛苦成果仿佛被否定了。"},{"en":"In some poems, a fallen hero is disgarlanded before exile.","zh":"在一些诗歌里，失势的英雄会在被流放前被“褫夺桂冠”。"}]}],"synonyms":["remove the garland","strip (of honors)","deprive (of honors)","unwreathe"],"phonetic":"/ˌdɪsˈɡɑrlənd/","extraExplanation":["“dis-”有“去除、相反”的含义，garland 指“花环/桂冠”。因此 disgarland 字面就是“把花环拿掉”。","该词较为少见，常见于诗歌或古典文学语境，用作意象：摘下桂冠＝荣耀被夺、庆典结束、地位不再。现代英语更常用 remove the garland / strip of honors / deprive of honors 等表达。"]}
{"word":"disgarnish","summary":{"en":"Disgarnish mainly means to remove a legal garnishment from wages or property; rarely, it means to remove a food garnish.","zh":"disgarnish主要指解除对工资或财产的法律扣押（扣薪/扣款）；较少指去掉食物上的装饰配料。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Law) To free (someone’s wages or property) from garnishment; to remove a legal order that is taking money to pay a debt.","zh":"（法律）解除（工资或财产的）扣押令；撤销为偿债而进行的工资扣押/财产扣押。"},"examples":[{"en":"She asked the court to disgarnish her wages after the debt was paid.","zh":"债务还清后，她请求法院解除对她工资的扣押。"},{"en":"The judge agreed to disgarnish the bank account because the garnishment was filed incorrectly.","zh":"法官同意解除对该银行账户的扣押，因为扣押申请提交有误。"}]},{"partOfSpeech":"vt.","definition":{"en":"To remove a garnish or decorative topping from food (rare in modern use).","zh":"（较少用）去掉食物上的装饰/配菜（如香草、果皮等）。"},"examples":[{"en":"He disgarnished the plate before serving it to the customer who disliked herbs.","zh":"他在上菜前把盘子上的香草装饰去掉，因为那位顾客不喜欢。"}]}],"synonyms":["release from garnishment","lift the garnishment","remove the garnishment","ungarnish"],"phonetic":"/dɪsˈɡɑrnɪʃ/","extraExplanation":["“disgarnish”最常见于法律语境，尤其在美国的债务追偿中：garnish（扣押/扣薪）指法院命令雇主或银行把一部分工资或资金直接划给债权人；disgarnish就是把这种扣押解除。","在日常英语里，人们更常说“remove the garnishment / lift the garnishment / release the garnishment”。用于食物的“去掉装饰”义项很少见。"]}
{"word":"disgarrison","summary":{"en":"“Disgarrison” means to withdraw a garrison—to remove troops from a place they were stationed to defend.","zh":"“Disgarrison”指撤走驻军、撤防，即把原本驻守防卫某地的部队撤离。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove troops from a fortress, town, or military post; to withdraw a garrison","zh":"撤走（要塞、城镇或军事据点的）驻军；撤防"},"examples":[{"en":"The commander decided to disgarrison the fort after the peace treaty was signed.","zh":"和平条约签署后，指挥官决定撤走要塞驻军。"},{"en":"They disgarrisoned several border posts to concentrate forces elsewhere.","zh":"他们撤掉了几处边境哨所的驻军，以便把兵力集中到别处。"}]}],"synonyms":["withdraw troops","pull out","evacuate","de-garrison"],"phonetic":"/dɪsˈɡærɪsən/","extraExplanation":["这个词较少见，多出现在历史写作、军事史或较正式的新闻/评论里。日常英语更常说：withdraw troops from…, pull troops out of…, evacuate the garrison。","词形上是 dis-（表示“去除、撤销”）+ garrison（驻军/驻守），字面意思就是“把驻军撤掉”。"]}
{"word":"disgavel","summary":{"en":"A rare legal verb meaning to remove land from gavelkind inheritance rules.","zh":"一个很少见的法律动词，指使土地不再适用 gavelkind（分割继承制）规则。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Law, especially historical English law) To free land from gavelkind rules; to change an estate so it no longer follows gavelkind inheritance (such as equal division among sons) and instead follows another system (often primogeniture).","zh":"（法律，尤指英国历史法律）使土地脱离“gavelkind（肯特郡的分割继承制）”的规则；把地产改为不再适用分割继承，而改用其他继承制度（常见为长子继承）。"},"examples":[{"en":"In some old records, land was described as being “disgavelled” by an act of Parliament.","zh":"在一些旧档案中，土地被描述为通过议会法案“disgavelled（脱离分割继承制）”。"},{"en":"The family petitioned to disgavel the estate so that it would pass to the eldest son.","zh":"这家人请求对庄园进行 disgavel，使其改为由长子继承。"}]}],"synonyms":["free from gavelkind","remove from gavelkind (status)","convert (an estate) to primogeniture (in effect)"],"phonetic":"/dɪsˈɡævəl/","extraExplanation":["“disgavel”非常少见，属于历史法律用语；理解它的关键是先知道“gavelkind”是什么：它是英国肯特郡一带的习惯法继承制度，传统上倾向于把土地在儿子之间分割，而不是只给长子。","词形上，dis- 表示“去除/取消”，gavelkind 是制度名称；因此 disgavel = “取消 gavelkind 的适用”。"]}
{"word":"disgaveled","summary":{"en":"Disgaveled is a rare historical legal term meaning land was freed from gavelkind inheritance rules.","zh":"disgaveled 是罕见的历史法律用语，指土地被解除“均分继承制（gavelkind）”的约束。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Law, chiefly historical) Freed (land or property) from the rules of gavelkind (a traditional system of inheritance).","zh":"（法律，主要为历史用语）使（土地/财产）脱离“均分继承制”（gavelkind）规则；解除其受该制度约束的状态。"},"examples":[{"en":"The estate was disgaveled by an Act of Parliament.","zh":"该地产通过议会法案被解除均分继承制的约束。"},{"en":"After the land was disgaveled, it followed the usual inheritance rules.","zh":"土地被解除该制度后，就按通常的继承规则处理。"}]}],"synonyms":["ungavelled","freed from gavelkind (phrase)"],"phonetic":"/dɪsˈɡævəld/","extraExplanation":["“Disgavel(ed)”是非常少见的法律/历史词，常见于研究英格兰肯特郡（Kent）旧土地制度的文本。gavelkind（均分继承制）大致指：土地可能由多个继承人分割继承，而不是只由长子单独继承。","“to disgavel”表示通过法律手段（例如议会法案或特定法律程序）让某块土地不再适用gavelkind，从而改用更一般的继承规则。日常英语里几乎不用。","如果你原本想写的是更常用的形容词，可能是拼写接近的 disheveled（衣衫/头发凌乱的）。"]}
{"word":"disgaveling","summary":{"en":"Disgaveling is a rare legal-historical term for removing gavelkind inheritance rules from land so it can pass under a different system (often to one heir).","zh":"Disgaveling 是较罕见的法律史词，指解除土地的 gavelkind（均分继承制）属性，使其改按其他继承制度（常为长子继承/单一继承）处理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of ending gavelkind (a system where land is divided among heirs) by converting property to another inheritance system, especially primogeniture","zh":"（法律/历史用语）“解除均分继承制（gavelkind）”的行为或过程；指把原本按子女均分继承的土地改为其他继承方式（常见为长子继承）"},"examples":[{"en":"The estate underwent disgaveling so it could pass to a single heir.","zh":"这处地产进行了“解除均分继承制”的处理，以便由一位继承人继承。"},{"en":"Records mention the disgaveling of lands in Kent in the nineteenth century.","zh":"档案提到19世纪在肯特郡对土地进行“解除均分继承制”的处理。"}]},{"partOfSpeech":"v.","definition":{"en":"(present participle) ending gavelkind inheritance rules for land; converting such property so it is no longer treated as gavelkind","zh":"（现在分词）正在解除土地的“均分继承制（gavelkind）”规则；使该地产不再按gavelkind处理"},"examples":[{"en":"The family is disgaveling the property before selling it.","zh":"这家人正先把这处地产“解除均分继承制”，再出售。"},{"en":"He spent years disgaveling parcels of land to simplify inheritance.","zh":"他花了好几年把多块土地“解除均分继承制”，以简化继承流程。"}]}],"synonyms":["abolition of gavelkind","conversion from gavelkind"],"phonetic":"/dɪsˈɡævəlɪŋ/","extraExplanation":["“Gavelkind”是中世纪英格兰的一种土地继承制度，最著名地与英格兰肯特郡（Kent）相关：土地往往由子女（尤其是儿子）分割继承，而不是由长子独得。后来为了让地产更容易集中、出售或按主流法律继承，一些土地会通过法律程序被“disgavel”（解除gavelkind属性）。","这个词在现代英语里非常少见，多出现在英国法律史、地方史、地产档案或家谱研究语境中。日常表达一般不会用。"]}
{"word":"disgavelled","summary":{"en":"Disgavelled means messy and untidy in appearance (especially hair), and can also describe something mentally or organizationally disordered. It’s a rare/old-fashioned variant of disheveled.","zh":"disgavelled 意为“蓬乱的、凌乱的”（尤指头发），也可比喻“杂乱无章的”。它是 disheveled/dishevelled 的罕见、较古的变体拼写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/archaic) Untidy or messy in appearance, especially with hair hanging loose; disheveled.","zh":"（罕见/较古）外表凌乱的，尤指头发散乱、披散的；蓬乱的。"},"examples":[{"en":"He arrived with disgavelled hair and a rumpled coat.","zh":"他赶来时头发蓬乱，外套也皱巴巴的。"},{"en":"The child’s disgavelled curls stuck to her forehead after the rain.","zh":"雨后孩子蓬乱的卷发贴在额头上。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Disordered or unsettled; not neatly arranged or controlled.","zh":"（比喻）杂乱无章的；不安定的；不受控制的。"},"examples":[{"en":"After the crisis, his thoughts felt disgavelled and hard to organize.","zh":"危机过后，他的思绪仿佛一团乱麻，难以整理。"},{"en":"The plan became disgavelled once new rules were announced.","zh":"新规定一公布，计划就变得乱了套。"}]}],"synonyms":["disheveled","unkempt","tousled","rumpled","scruffy"],"phonetic":"/dɪsˈɡævəld/","extraExplanation":["“disgavelled”是非常少见的拼写，多被当作“dishevelled / disheveled（蓬乱的）”的变体使用；在现代英语里更常见的是美式“disheveled”和英式“dishevelled”。","词源上，“dishevelled”与法语“cheveux（头发）”有关，因此它常用来形容头发散乱；“disgavelled”常见于较旧的文学或地区性写法，读到时可直接按“disheveled”理解。"]}
{"word":"disgavelling","summary":{"en":"Disgavelling is a historical legal term for removing land from gavelkind inheritance rules.","zh":"Disgavelling 是历史法律用语，指将土地解除“加维尔金德制”继承规则。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the legal process of freeing land from gavelkind (a traditional inheritance system) so it is held under ordinary freehold rules","zh":"（法律）将土地从“分割继承制/加维尔金德制”（gavelkind）中解除出来，使其改按普通自由保有权规则持有的程序"},"examples":[{"en":"The estate applied for disgavelling so the land would no longer be divided among all sons.","zh":"该庄园申请进行 disgavelling，使土地不再必须在所有儿子之间分割继承。"},{"en":"In old Kent records, disgavelling often appears alongside land transfers and wills.","zh":"在英格兰肯特郡的旧档案中，disgavelling 常与土地转让和遗嘱一同出现。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of converting gavelkind land into non-gavelkind tenure (often by statute)","zh":"（尤指依法律条文）把“加维尔金德制”土地改为非加维尔金德制土地的行为"},"examples":[{"en":"The local act authorized the disgavelling of several parcels near the village.","zh":"当地法案授权对村庄附近的几块地进行 disgavelling。"}]}],"synonyms":["enfranchisement (land)","conversion to freehold","removal from gavelkind"],"phonetic":"/ˌdɪsˈɡævəlɪŋ/","extraExplanation":["disgavelling 是非常偏历史与法律文书的用词，主要见于英格兰肯特郡（Kent）。gavelkind 是一种古老的继承习惯：土地可能更倾向于在子女间分割，而不是由长子单独继承（与 primogeniture 形成对比）。","因为 gavelkind 涉及地产继承与税费等问题，后来有些土地会通过议会法案或其他法律程序“disgavel”，把它改成更常见的自由保有权制度，所以在地契、遗嘱、地产记录里更常见。"]}
{"word":"disgeneric","summary":{"en":"Disgeneric describes something that doesn’t fit one clear genre or category, often because it intentionally mixes genres.","zh":"Disgeneric 用来形容不属于单一明确体裁/类型的作品或表达方式，常指刻意混合体裁、打破类型界限。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not fitting a standard genre or category; deliberately mixed-genre or genre-breaking","zh":"不符合某一固定体裁或类型的；刻意混合体裁、打破类型界限的"},"examples":[{"en":"The novel is disgeneric—it blends memoir, history, and fiction.","zh":"这部小说是“disgeneric”的——它把回忆录、历史和虚构融合在一起。"},{"en":"Her disgeneric writing makes it hard to shelve the book in one section.","zh":"她这种打破类型的写作，让这本书很难被归到某一个书架分类里。"},{"en":"The film feels disgeneric, moving from comedy to horror without warning.","zh":"这部电影很“disgeneric”，会毫无预兆地从喜剧转到恐怖。"}]}],"synonyms":["cross-genre","genre-bending","hybrid","mixed-genre","unclassifiable"],"phonetic":"/ˌdɪs.dʒəˈnɛr.ɪk/","extraExplanation":["“disgeneric”并不是日常高频词，更常见于文学批评、文化研究、影视评论等语境，用来强调作品“拒绝被单一类型定义”。","构词上：dis- 表示“否定/相反”，generic 来自 genre（体裁/类型）相关概念；因此整体意思接近“非类型化/反类型/跨类型”。在一般写作中也常用 cross-genre、genre-bending、hybrid（hybrid genre）来表达类似含义。"]}
{"word":"disgenic","summary":{"en":"Disgenic means “causing genetic deterioration in a population,” often used as the opposite of eugenic.","zh":"Disgenic 指“导致群体遗传状况恶化的”，常作为 eugenic（优生的）的反义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Causing a decline in the average genetic “fitness” or health of a population; considered the opposite of eugenic.","zh":"导致一个群体的平均遗传“适应度”或健康水平下降的；常被视为 eugenic（优生的）的反义。"},"examples":[{"en":"Some writers use the term disgenic to argue that certain social trends harm a population’s long-term health.","zh":"一些作者用 disgenic 这个词来主张某些社会趋势会损害一个群体的长期健康。"},{"en":"The article’s disgenic claim was criticized for oversimplifying complex issues like poverty and education.","zh":"这篇文章的 disgenic 论点因过度简化贫困与教育等复杂问题而受到批评。"}]}],"synonyms":["dysgenic","degenerative (in a genetic sense)","harmful (to a population’s genetic health)"],"phonetic":"/dɪsˈdʒɛnɪk/","extraExplanation":["disgenic 通常出现在人口遗传学、社会政策争论或历史性的“优生学/反优生学”话语中，带有很强的价值判断色彩，容易与歧视性观点纠缠在一起。学术写作中更常见的是更中性的表述，例如“对健康结局不利”“增加遗传性疾病负担”等，并且会强调环境因素与社会因素同样关键。"]}
{"word":"disgenius","summary":{"en":"A nonstandard, joking term meaning “not a genius.” Not common in formal English.","zh":"一个非标准的玩笑式说法，意思类似“不是天才/不太聪明”，不用于正式英语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard/rare) Not a standard English word; sometimes used playfully to mean “not a genius” or “lacking genius/smartness.”","zh":"（非标准/罕见）不是标准英语单词；有时被戏谑地用来表示“不是天才 / 不太聪明”。"},"examples":[{"en":"I’m no disgenius—I just made a silly mistake.","zh":"我可不是什么“disgenius”（戏称：不聪明的人）——我只是犯了个傻错误。"},{"en":"Stop calling yourself a disgenius; you’re learning fast.","zh":"别老说自己是“disgenius”了；你学得很快。"}]}],"synonyms":["(informal) not a genius","(informal) not very smart","(slang) dummy"],"phonetic":"/dɪsˈdʒiːniəs/","extraExplanation":["“disgenius”通常被看作由前缀 dis-（表示否定/相反）+ genius（天才）临时拼出来的玩笑式用法，因此在词典里一般查不到，也不建议在正式写作中使用。","如果你想表达“言行不真诚、假装不知道（尤其为了达到某种目的）”，你可能想写的是 **disingenuous**（常见词）。如果你愿意，把你的原句发我，我可以帮你判断最合适的正确单词。"]}
{"word":"disgig","summary":{"en":"“Disgig” is nonstandard slang sometimes used online to mean canceling or removing a gig (a performance or short-term job).","zh":"“disgig”不是标准词，偶见网络俚语用法，指取消/撤掉一场演出或一份零工（短期活儿）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Not a standard dictionary word in English; it is sometimes used informally online to mean “to cancel/remove a gig (performance or short-term job)” or “to stop doing gigs.”","zh":"不是标准英语词（多数词典不收录）；网络上偶见作非正式用法，表示“取消/撤掉一场演出或临时工作（gig）”，或“停止接短期活儿”。"},"examples":[{"en":"They disgigged the band after the venue changed its schedule.","zh":"场地方改了日程后，他们把乐队的演出取消了。"},{"en":"I got disgigged last minute, so I’m not working tonight.","zh":"我临时被撤掉班/取消活儿了，所以今晚不工作。"}]}],"synonyms":["cancel","call off","drop","remove","cut"],"phonetic":"/dɪsˈɡɪɡ/","extraExplanation":["“gig”在现代英语里既可指“演出/音乐会的场次”，也常指“短期零工/接活”（尤其是零工经济语境）。把“dis-（取消/去除）”加在前面构成“disgig”，更像是临时造词（nonce word），因此在正式写作中不推荐使用。","如果你是在文本里看到“disgig”，也可能是拼写错误。常见相近词包括：disgorge（吐出；涌出）、disguise（伪装）、dislike（不喜欢）。你可以把原句发来，我可以帮你判断最可能是哪一个。"]}
{"word":"disglorify","summary":{"en":"Disglorify means to take away glory—i.e., to dishonor or diminish someone’s reputation or sacred honor.","zh":"disglorify 指“使失去荣耀”，即使蒙羞、贬损名声或（宗教语境中）不荣耀神。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to take away someone’s or something’s glory; to dishonor or make seem less admirable","zh":"使（某人/某事）失去荣耀；使蒙羞；贬损其光彩"},"examples":[{"en":"The scandal disglorified the politician in the eyes of many voters.","zh":"这桩丑闻让那位政治人物在许多选民眼中失去了光彩。"},{"en":"She worried that her mistake would disglorify her team’s hard work.","zh":"她担心自己的失误会让团队的辛苦付出蒙上阴影。"}]},{"partOfSpeech":"vt.","definition":{"en":"(religious/literary) to deny glory to God or to speak/act in a way that fails to honor the sacred","zh":"（宗教/文学用法）不荣耀上帝；以言行对神圣不敬、不致敬"},"examples":[{"en":"Some writers use the word to warn against actions that disglorify God.","zh":"一些作者用这个词来告诫人们不要做出“不荣耀上帝”的行为。"}]}],"synonyms":["dishonor","disgrace","demean","tarnish","vilify"],"phonetic":"/dɪsˈɡlɔrəˌfaɪ/","extraExplanation":["“disglorify”由前缀 dis-（表示“去除、相反”）+ glorify（荣耀、赞美）构成，但在现代英语中相对少见；日常更常用 dishonor、disgrace、demean、tarnish（损害名声/光彩）等词。","语气上它偏正式、带评判色彩；在宗教语境里尤其常见，用来表达“没有把荣耀归给上帝/神”。"]}
{"word":"disglory","summary":{"en":"Disglory means a loss of honor or glory, or the act of bringing shame.","zh":"disglory 指“不光彩、耻辱”，也可指“使蒙羞、使受辱”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"lack of glory; dishonor or disgrace (a loss of respect or honor).","zh":"不光彩；耻辱；丧失荣誉（名声受损）。"},"examples":[{"en":"The scandal brought disglory on the organization.","zh":"这桩丑闻给该组织带来了不光彩。"},{"en":"He felt disglory after breaking his promise in public.","zh":"他在公开场合食言后感到很丢脸。"}]},{"partOfSpeech":"v.","definition":{"en":"to bring shame or dishonor to someone or something; to disgrace.","zh":"使蒙羞；使受辱；使丢脸。"},"examples":[{"en":"His actions disgloried his family name.","zh":"他的行为让家族名声蒙羞。"},{"en":"Don’t disglory the team with careless behavior.","zh":"别用鲁莽的行为让团队丢脸。"}]}],"synonyms":["disgrace","dishonor","shame","ignominy"],"phonetic":"/dɪsˈɡlɔri/","extraExplanation":["“disglory”在现代英语中非常少见，更多时候人们会用更常见的词：名词用“disgrace / dishonor / shame”，动词用“disgrace / dishonor / shame”。","构词上可理解为“dis-（否定、相反）+ glory（荣耀）”，意思就是“与荣耀相反的状态”。在较老的文本或较文学化的写作里偶尔会出现。","在正式写作中若想表达“给……带来不光彩”，更自然的搭配包括：“bring disgrace on… / bring shame on… / bring dishonor to…”。"]}
{"word":"disglut","summary":{"en":"“Disgust” means a strong feeling of dislike or revulsion, or to cause that feeling in someone.","zh":"“Disgust” 指强烈的厌恶/反胃感，也可作动词表示“使人厌恶/恶心”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong feeling of dislike or revulsion; a sense that something is unpleasant, dirty, or morally offensive","zh":"强烈的厌恶；反感；（对令人不适、肮脏或不道德之事的）恶心、反胃感"},"examples":[{"en":"The smell filled her with disgust.","zh":"那股气味让她感到很恶心。"},{"en":"He looked at the unfair rule with disgust.","zh":"他带着厌恶看待那条不公平的规定。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cause someone to feel strong dislike or revulsion; to make someone feel sick or offended","zh":"使（某人）厌恶；使反感；使恶心；冒犯"},"examples":[{"en":"The way he lied so easily disgusted me.","zh":"他那么轻易就撒谎的样子让我很反感。"},{"en":"Rotten food can disgust anyone.","zh":"变质的食物会让任何人都觉得恶心。"}]},{"partOfSpeech":"vi.","definition":{"en":"to feel strong dislike or revulsion","zh":"感到厌恶；反感；觉得恶心"},"examples":[{"en":"Some people disgust at the sight of blood.","zh":"有些人一看到血就会觉得恶心。"},{"en":"I disgusted at how rude the comments were.","zh":"我对这些评论的粗鲁感到反感。"}]}],"synonyms":["revulsion","nausea","distaste","loathing","repulsion"],"phonetic":"/dɪsˈɡʌst/","extraExplanation":["你输入的 “disglut” 在英语里不是常见单词，最可能是拼写成了 **disgust**。","用法小提醒：**disgust** 作动词时，常见结构是 **disgust someone**（使某人厌恶）。表达“对……感到厌恶”更自然的是 **be disgusted by/with** 或 **feel disgust at**。上面 vi. 的例句属于较少见/较不地道的表达，学习时优先掌握前两种结构。"]}
{"word":"disgood","summary":{"en":"“disgood” is very informal slang for “this is good / that’s good,” and sometimes a shortened “Is this good?”","zh":"“disgood”是非常口语的俚语写法，通常表示“这个/那挺好”，有时也可省略成“这样可以吗？”"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Informal texting/slang spelling of “this good,” meaning “this is good” or “that’s good,” often used to praise something.","zh":"非正式短信/网络俚语拼写，等于“this good”（口语里常指“this is good / that’s good”），用于夸赞某物“挺不错/很可以”。"},"examples":[{"en":"Disgood—keep cooking like that.","zh":"很可以——继续这样做下去。"},{"en":"Yo, disgood. Where’d you get it?","zh":"哟，这个不错。你在哪儿买的？"},{"en":"I tried the new place and disgood fr.","zh":"我试了那家新店，真的很不错。"}]},{"partOfSpeech":"phrase","definition":{"en":"A casual way to ask “Is this good?” (the full question is usually understood from context).","zh":"在语境里省略成“Is this good?”的随口问法（常依靠上下文理解）。"},"examples":[{"en":"Disgood, or should I add more salt?","zh":"这样行吗，还是要再加点盐？"},{"en":"Disgood for a resume heading?","zh":"这种写法当简历标题可以吗？"}]}],"synonyms":["this is good","that’s good","looks good","pretty good","nice"],"phonetic":"/ˈdɪzˌɡʊd/","extraExplanation":["“dis”是把“this”按口语发音写出来的拼写（常见于网络、短信、部分方言/口语风格中）。属于非常口语、非正式的写法；在学校作业、邮件、简历、正式场合建议用标准英语：\"This is good.\" / \"That’s good.\" / \"Is this good?\"","有时也会写成“dis good”“this good”“this good?”；含义多靠语境判断是陈述（夸赞）还是提问。"]}
{"word":"disgorge","summary":{"en":"Disgorge means to pour out or release something in large amounts, or to give up money/information (often unwillingly).","zh":"Disgorge 指（大量）倾倒出/涌出，也可指（常不情愿地）交出钱款或信息。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to pour out or release something (often a large amount) from a container, place, or vehicle","zh":"（常指大量地）倾倒出、涌出；（从容器、地点或车辆中）放出"},"examples":[{"en":"The truck disgorged tons of gravel onto the road.","zh":"卡车把数吨碎石倾倒在路面上。"},{"en":"At the station, the train disgorged crowds of commuters.","zh":"在车站，列车放出一大群通勤人群。"},{"en":"The river disgorged muddy water after the storm.","zh":"暴风雨过后，河流涌出浑浊的水。"}]},{"partOfSpeech":"vt.","definition":{"en":"to give up or hand over something, especially money or information, often unwillingly","zh":"（尤指不情愿地）交出、吐出（钱或信息等）"},"examples":[{"en":"He finally disgorged the details after hours of questioning.","zh":"经过数小时盘问，他终于吐露了细节。"},{"en":"The court ordered the company to disgorge its illegal profits.","zh":"法院命令该公司交出非法所得。"}]}],"synonyms":["pour out","spill","spew","eject","release","hand over","surrender","relinquish"],"phonetic":"/dɪsˈɡɔrdʒ/","extraExplanation":["“Disgorge”语气偏正式，常见于新闻报道、法律与财经语境（如“disgorge profits”指“交出不当得利/追缴非法所得”）。","词源来自古法语，和“gorge”（喉咙）有关，因此在较生动的用法里会带有“吐出/涌出”的画面感，可用于人群、车辆、河流等“成批涌出”的场景。"]}
{"word":"disgorged","summary":{"en":"“Disgorged” means “forced out/emptied out,” often suddenly, and it can also mean “gave up (illegal) profits” in legal or financial contexts.","zh":"“Disgorged”表示“（把里面的东西）吐出/喷出/放出、倒空”，常带“突然涌出”的画面；在法律金融语境中也可指“交出（非法）收益”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense / past participle of “disgorge”) to force something out, or to empty out what has been contained (often something unwanted or sudden).","zh":"（disgorge 的过去式/过去分词）把（物）迫使吐出/喷出；（把容器、地方）倒空、放出（常指突然或不情愿）。"},"examples":[{"en":"The volcano disgorged hot ash and smoke into the sky.","zh":"火山向天空喷出炽热的火山灰和浓烟。"},{"en":"The bus stopped and disgorged a crowd of passengers.","zh":"公交车停下，涌出一群乘客。"},{"en":"The company was ordered to disgorge its illegal profits.","zh":"该公司被命令交出其非法所得。"}]}],"synonyms":["expelled","ejected","spewed","poured out","emptied","gave up (profits)"],"phonetic":"/dɪsˈɡɔrdʒd/","extraExplanation":["“Disgorge”常用于较正式或带画面感的语境：比如火山/河流“喷出、涌出”，或人群从门口/车里“涌出”。在法律与金融新闻里也常见：disgorge profits 指“交出非法所得/退赔不当得利”。","词源上来自法语（gorge 表示“喉咙”），dis- 有“向外、分离”的感觉，因此整体带有“把喉咙里的东西吐出来/把里面的东西倒出来”的形象。"]}
{"word":"disgorgement","summary":{"en":"Disgorgement most commonly means a legal order to repay illegally or unfairly gained profits.","zh":"Disgorgement最常指法律上“追缴不当得利”，即退还非法或不公平获得的收益。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In law and finance, the act of forcing someone to give back money they gained illegally or unfairly (often as a court or regulator order).","zh":"（法律/金融）追缴不当得利：强制把非法或不公平获得的收益退还（常由法院或监管机构下令）。"},"examples":[{"en":"The regulator sought disgorgement of profits from the insider trading scheme.","zh":"监管机构要求追缴这起内幕交易计划中的非法利润。"},{"en":"The company agreed to pay disgorgement and a civil penalty.","zh":"该公司同意支付追缴款和民事罚金。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of emptying something out; the release of contents (a rare, more general meaning).","zh":"（较少用）倾倒/排出内容物；把东西倒空或吐出。"},"examples":[{"en":"The disgorgement of sediment from the bottle changed the wine’s clarity.","zh":"从瓶中排出沉淀物改变了葡萄酒的澄清度。"}]}],"synonyms":["restitution","repayment","forfeiture","surrender of profits"],"phonetic":"/ˌdɪsˈɡɔrdʒmənt/","extraExplanation":["在美国法律语境里，disgorgement常见于证券欺诈、内幕交易、腐败等案件。它的重点是“让违法者不再从违法中获利”（去除不当得利），并不一定等同于“罚款（fine/penalty）”。因此判决里常会同时出现disgorgement（追缴所得）和civil penalty（民事罚金）。","词源上与gorge（喉咙/大口吞咽）有关，dis-有“向外、解除”的感觉，所以字面上有“吐出、倒出”的意象；这也解释了它在酿酒工艺中偶尔指“除渣/吐渣”。"]}
{"word":"disgorger","summary":{"en":"A disgorger is a person or device that forces something out; in sparkling-wine making, it’s specifically used for removing sediment during disgorgement.","zh":"disgorger 指把东西排出/吐出的人员或装置；在起泡酒酿造中，特指用于除渣（disgorgement）环节的工具或操作人员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or machine that disgorges (forces out or releases) something","zh":"将某物“排出/喷出/吐出”的人或机器；排出装置"},"examples":[{"en":"The pump’s disgorger released the trapped air from the system.","zh":"泵的排出装置把系统里被困住的空气释放了出来。"},{"en":"In the report, the factory was described as a disgorger of smoke and dust.","zh":"报告中把这家工厂描述成“排出”烟尘的源头。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially in sparkling-wine making) a tool or operator used to remove sediment from a bottle during disgorgement","zh":"（尤指起泡酒/香槟酿造）用于“除渣（disgorgement）”的工具或操作人员"},"examples":[{"en":"After aging, the bottles were moved to the disgorger to remove the yeast sediment.","zh":"陈酿后，酒瓶被送到除渣工位，以去除酵母沉淀。"},{"en":"The winery trained a new disgorger for the busy season.","zh":"酒庄为旺季培训了一名新的除渣操作员。"}]}],"synonyms":["discharge device","ejector","expeller","pump","disgorgement operator"],"phonetic":"/dɪsˈɡɔrdʒər/","extraExplanation":["“disgorger”来自动词“disgorge”（吐出、排出；在香槟工艺中指“除渣”）。传统香槟法里，酒瓶二次发酵后会产生酵母沉淀；通过转瓶（riddling）让沉淀集中到瓶颈，再进行除渣（disgorgement）。负责这个环节的人或设备就可称为 disgorger。"]}
{"word":"disgorges","summary":{"en":"“Disgorges” means “pours out/release suddenly in large amounts,” and can also mean “vomits” or “gives up (money/secrets), often unwillingly.”","zh":"“disgorges”表示“突然大量涌出/喷出/倾泻出”；也可指“呕吐”，或（常不情愿地）“交出/吐露（钱、秘密等）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Third-person singular of “disgorge”) to pour out or release something suddenly and in large amounts, often with force (liquid, people, objects, etc.).","zh":"（动词 disgorge 的第三人称单数）突然大量（常带冲力地）涌出、喷出、倾泻出（液体、人群、物体等）。"},"examples":[{"en":"After the storm, the river disgorges mud and debris into the bay.","zh":"暴风雨过后，河水把泥浆和碎片大量冲入海湾。"},{"en":"The subway disgorges commuters onto the platform every morning.","zh":"每天早晨，地铁把通勤人群一批批“吐”到站台上。"}]},{"partOfSpeech":"v.","definition":{"en":"(Of a person) to vomit; to bring up the contents of the stomach.","zh":"（指人）呕吐，把胃里的东西吐出来。"},"examples":[{"en":"He feels sick and suddenly disgorges what he ate.","zh":"他觉得恶心，突然把吃的东西吐了出来。"}]},{"partOfSpeech":"v.","definition":{"en":"To give up or hand over something unwillingly (money, information, secrets).","zh":"（不情愿地）交出、吐露（钱、信息、秘密）。"},"examples":[{"en":"Under pressure, the company disgorges details of the deal.","zh":"在压力之下，公司被迫吐露交易细节。"},{"en":"The court ordered him to disgorge the profits.","zh":"法院命令他交出非法所得。"}]}],"synonyms":["spews","spills out","pours out","empties","vomits","ejects","expels","gives up"],"phonetic":"/dɪsˈɡɔrdʒɪz/","extraExplanation":["“disgorge”常见于较正式或新闻/法律语境：既可形容“水/人群涌出”，也可用于法律中“disgorge profits（交出不当得利）”。词根可理解为 dis-（向外/分开）+ gorge（喉咙、吞咽），带有“把吞下去的东西吐出来”的形象感。"]}
{"word":"disgorging","summary":{"en":"“Disgorging” means pouring out/ejecting something (often suddenly or in large amounts), or unwillingly giving up information or money.","zh":"“disgorging”表示（常指突然或大量地）涌出/倒出/喷出；也可指不情愿地交出钱财或吐露信息。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"pouring out or ejecting something, often in a sudden or large amount","zh":"（常指突然或大量地）涌出、喷出、倒出某物"},"examples":[{"en":"The truck overturned, disgorging oranges across the road.","zh":"卡车侧翻，橙子撒得满路都是。"},{"en":"The volcano erupted, disgorging ash into the sky.","zh":"火山爆发，把火山灰喷向天空。"},{"en":"The elevator doors opened, disgorging a crowd into the lobby.","zh":"电梯门一开，人群涌入大厅。"}]},{"partOfSpeech":"v.","definition":{"en":"giving up or revealing something (like money or information), especially unwillingly","zh":"（尤指不情愿地）交出、吐露（如钱或信息）"},"examples":[{"en":"After hours of questioning, he finally started disgorging the details.","zh":"经过数小时盘问，他终于开始吐露细节。"},{"en":"The company was forced to disgorge its hidden records to investigators.","zh":"该公司被迫向调查人员交出隐匿的记录。"}]}],"synonyms":["pouring out","spewing","spilling","ejecting","expelling","giving up","handing over","coughing up"],"phonetic":"/dɪsˈɡɔrdʒɪŋ/","extraExplanation":["disgorging 是动词 disgorge 的现在分词形式。disgorge 常用于比较“画面感强”的场景：容器/入口处一下子把东西“倒出来、喷出来、涌出来”。也可比喻为“不情愿地交出（钱、证据）或吐露（信息）”。","词源上来自法语（与 gorge “喉咙”有关），所以它常带有“从喉咙里吐出”的形象联想。","在起泡酒（香槟）工艺里有专门术语 disgorgement（除渣/吐泥）：把瓶中沉淀的酵母渣排出。了解这一点有助于记忆 disgorge 的“排出、吐出”核心意思。"]}
{"word":"disgospel","summary":{"en":"“Disgospel” is rare/nonstandard; it’s sometimes used to mean rejecting or contradicting the gospel, but it’s usually better to use clearer wording.","zh":"“disgospel”很罕见且不规范；有时表示否认或违背福音，但通常建议用更清晰的表达。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a rare or nonstandard word; sometimes used to mean “to reject/deny the gospel (Christian teaching)” or “something that goes against the gospel.” In most modern English, people do not use this word.","zh":"一个罕见或不规范的词；有时被用来表示“否认/拒绝福音（基督教教义）”或“与福音相违背的事物”。在现代英语中几乎不常用。"},"examples":[{"en":"Some writers use “disgospel” to describe teachings they believe contradict the gospel.","zh":"有些作者会用“disgospel”来形容他们认为与福音相矛盾的教导。"},{"en":"In everyday English, it’s clearer to say “reject the gospel” rather than “disgospel.”","zh":"在日常英语里，说“reject the gospel（拒绝福音）”比用“disgospel”更清楚。"}]}],"synonyms":["reject the gospel","deny the gospel","contradict the gospel"],"phonetic":"/dɪsˈɡɑspəl/","extraExplanation":["“disgospel”很可能是拼写错误或非常小众的造词。若你想查的是：\n- gospel /ˈɡɑspəl/：福音；（广义）“被广泛相信的说法/真理”\n- dispel /dɪˈspɛl/：驱散（疑虑、误会等）\n你可以告诉我你的句子，我能帮你判断你想表达哪个词。"]}
{"word":"disgospelize","summary":{"en":"Disgospelize means to make something less centered on Christian gospel teaching or evangelism.","zh":"disgospelize 指“使某事物去福音化”，让其不再以基督教福音教义或传福音为核心。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove or reduce the Christian “gospel” character from something; to make something less centered on Christian teaching or evangelizing.","zh":"使（某事物）去福音化；削弱其基督教“福音”色彩，使其不再以传福音/基督教教义为中心。"},"examples":[{"en":"Some critics say the movie disgrospelizes the story by focusing on romance instead of faith.","zh":"一些评论者认为这部电影把重点放在爱情而不是信仰上，从而让故事“去福音化”。"},{"en":"The new curriculum was accused of disgrospelizing religious education to make it more broadly acceptable.","zh":"新课程被指责为让宗教教育“去福音化”，以便让更多人接受。"}]}],"synonyms":["secularize","de-Christianize","desacralize"],"phonetic":"/dɪsˈɡɑspəˌlaɪz/","extraExplanation":["这是一个非常少见的动词，构词法很透明：dis-（去除、取消）+ gospel（福音/基督教教义）+ -ize（使……化）。多用于评论、批评语境，带有“把原本偏基督教/传教的内容变得更世俗、更中性”的意味。","在表达“世俗化/去宗教化”时，更常见的词是 secularize（使世俗化）或 de-Christianize（去基督教化）。"]}
{"word":"disgout","summary":{"en":"Disgust means a strong feeling of dislike or nausea, or to make someone feel that way.","zh":"Disgust 表示强烈的厌恶/反感或恶心；也可作动词表示“使人厌恶/恶心”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong feeling of dislike, nausea, or moral disapproval","zh":"强烈的厌恶感；反感；（也可指）恶心或道德上的不认同"},"examples":[{"en":"The smell filled her with disgust.","zh":"那股气味让她感到恶心和厌恶。"},{"en":"He spoke with disgust about the corruption.","zh":"他带着强烈反感谈到那种腐败现象。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cause someone to feel strong dislike or nausea; to offend someone’s sense of what is acceptable","zh":"使（某人）厌恶；使反感；使恶心；冒犯（某人的道德或接受底线）"},"examples":[{"en":"The spoiled food disgusted everyone.","zh":"变质的食物让所有人都感到恶心。"},{"en":"Her rude comments disgusted him.","zh":"她粗鲁的评论让他很反感。"}]}],"synonyms":["revulsion","nausea","aversion","distaste","repulsion","offend"],"phonetic":"/dɪsˈɡʌst/","extraExplanation":["你输入的 **disgout** 很可能是拼写错误，常见正确拼写是 **disgust**。","发音里的 **-gust** 结尾常让人误拼；记忆方法：和 **gust（阵风）** 拼写相似，但意义不同。"]}
{"word":"disgown","summary":{"en":"“Disgown” means to remove a gown or robe, especially in formal or medical settings.","zh":"“Disgown”指脱下长袍/礼服（常见于正式或医疗场景）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove a gown or robe from someone; to take off a gown","zh":"给某人脱下长袍/礼服；脱去（长袍、礼服）"},"examples":[{"en":"The nurse helped the patient disgown before the examination.","zh":"检查前，护士帮病人脱下检查袍。"},{"en":"After the ceremony, the graduates went backstage to disgown.","zh":"典礼结束后，毕业生到后台脱下学位袍。"}]}],"synonyms":["remove a gown","take off a gown","disrobe","undress"],"phonetic":"/dɪsˈɡaʊn/","extraExplanation":["“dis-”在这里表示“去掉、除去”（如：disarm 解除武装，disrobe 脱衣）。因此 disgown 的字面意思就是“去掉 gown（长袍/礼服）”。这个词比较少见，日常更常用 take off a gown / remove a gown，或更通用的 disrobe（脱衣）。"]}
{"word":"disgrace","summary":{"en":"“Disgrace” means shame or loss of honor (noun), or to cause someone to feel ashamed and lose respect (verb).","zh":"“disgrace”指“耻辱/丢脸”（名词），也指“使蒙羞、使名誉受损”（动词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a loss of respect or honor; a situation or action that makes someone feel ashamed","zh":"丢脸；耻辱；使人失去尊敬或名誉的情况/行为"},"examples":[{"en":"The scandal brought disgrace on the family.","zh":"这桩丑闻给这个家庭带来了耻辱。"},{"en":"He resigned in disgrace after the cheating was discovered.","zh":"作弊被发现后，他羞愧地辞职了。"}]},{"partOfSpeech":"vt.","definition":{"en":"to cause someone to lose respect or honor; to bring shame on someone","zh":"使蒙羞；使失去尊敬或名誉；玷污（名声）"},"examples":[{"en":"He felt he had disgraced himself by lying.","zh":"他觉得自己撒谎让自己丢了脸。"},{"en":"The athlete was disgraced for using banned drugs.","zh":"那名运动员因使用违禁药物而名声扫地。"}]}],"synonyms":["shame","dishonor","humiliation","stigma","embarrassment"],"phonetic":"/dɪsˈɡreɪs/","extraExplanation":["“disgrace”常和介词搭配：in disgrace（失宠/蒙羞地）、bring disgrace on/upon someone（给某人带来耻辱）、fall from grace（从受宠或受尊敬的状态跌落，含“失去荣耀”的意味）。","词根提示：dis-（否定/相反）+ grace（优雅、恩典/体面）。因此“disgrace”带有“失去体面、失去恩宠/尊重”的核心感觉。","文学/文化中常见主题是“名誉与耻辱”。例如J.M. Coetzee的小说《Disgrace》（《耻》）就以“个人与社会的羞耻/失范”作为重要主题。"]}
{"word":"disgraced","summary":{"en":"“Disgraced” usually means ‘dishonored’—having lost respect or reputation; it can also be the past form of ‘disgrace.’","zh":"“disgraced”通常表示“蒙羞的、失去名誉的”；也可作动词“disgrace”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having lost respect, honor, or a good reputation because of wrongdoing or failure; brought into shame.","zh":"因错误、不当行为或失败而失去尊重、名誉；蒙羞的。"},"examples":[{"en":"The disgraced politician resigned after the corruption scandal.","zh":"那位蒙羞的政客在贪腐丑闻后辞职了。"},{"en":"A disgraced athlete was banned for using illegal drugs.","zh":"一名蒙羞的运动员因使用违禁药物而被禁赛。"},{"en":"She felt disgraced after being caught cheating on the exam.","zh":"她因考试作弊被抓而觉得很丢脸。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “disgrace”: to cause someone or something to lose honor or respect; to bring shame.","zh":"“disgrace”的过去式/过去分词：使（某人或某物）丧失荣誉或受到鄙视；使蒙羞。"},"examples":[{"en":"He was disgraced by his own dishonest actions.","zh":"他因自己的不诚实行为而蒙羞。"},{"en":"The incident disgraced the company and damaged its image.","zh":"这起事件让公司蒙羞并损害了形象。"}]}],"synonyms":["dishonored","shamed","discredited","humiliated","fallen"],"phonetic":"/dɪsˈɡreɪst/","extraExplanation":["“disgraced”常作形容词修饰人（disgraced senator/doctor/coach），强调“名誉扫地”的社会评价；比“embarrassed（尴尬）”更严重，带有道德或公众层面的否定。","常见搭配：a disgraced official（落马官员/蒙羞的官员）、a disgraced former…（名誉受损的前……）、be disgraced for/by…（因……而蒙羞）。","写作中可用来体现“从荣耀到堕落”的人物转折，在新闻与传记体中尤其常见。"]}
{"word":"disgraceful","summary":{"en":"Disgraceful means shamefully bad or unacceptable, causing loss of respect.","zh":"Disgraceful 指“可耻的、丢脸的、令人无法接受的”，会让人失去尊重。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Very bad, unacceptable, or shameful; causing people to lose respect.","zh":"非常糟糕、不可接受或可耻的；会让人失去尊重的。"},"examples":[{"en":"The conditions in the shelter were disgraceful.","zh":"收容所的条件非常糟糕，令人不齿。"},{"en":"It’s disgraceful to cheat on an exam.","zh":"考试作弊是可耻的行为。"},{"en":"The team’s disgraceful performance shocked their fans.","zh":"球队糟糕又丢脸的表现让球迷很震惊。"}]}],"synonyms":["shameful","scandalous","outrageous","appalling","dishonorable"],"phonetic":"/dɪsˈɡreɪsfəl/","extraExplanation":["“disgraceful”常用来评价行为、表现或状况，语气比较强，带有道德或社会评价（不仅是“不好”，而是“令人蒙羞/不可接受”）。日常表达里，如果只想说“很糟”，可用“terrible/awful”；如果强调“丢脸/可耻”，用“disgraceful”更贴切。","词形关系：disgrace（n./v. 使蒙羞）→ disgraceful（adj. 可耻的）。反义倾向：honorable（可敬的）、respectable（体面的）。"]}
{"word":"disgracefully","summary":{"en":"Disgracefully means in a shameful way or extremely badly (below an acceptable standard).","zh":"disgracefully 表示“可耻地/不体面地”，也可表示“糟糕得离谱（远低于标准）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is shameful, dishonorable, or causes loss of respect.","zh":"以可耻的方式；不名誉地；丢脸地。"},"examples":[{"en":"He behaved disgracefully at the party and offended several people.","zh":"他在聚会上举止很失礼，冒犯了好几个人。"},{"en":"The team played disgracefully and ignored basic teamwork.","zh":"这支队伍踢得很难看，连基本配合都不顾。"}]},{"partOfSpeech":"adv.","definition":{"en":"Extremely badly; far below an acceptable standard.","zh":"糟糕得离谱；远低于可接受的标准。"},"examples":[{"en":"The roads are disgracefully unsafe after the storm.","zh":"暴风雨过后，道路危险得离谱。"},{"en":"The room was disgracefully dirty for a hotel.","zh":"对一家酒店来说，这房间脏得太不像话了。"}]}],"synonyms":["shamefully","dishonorably","scandalously","deplorably","outrageously"],"phonetic":"/dɪsˈɡreɪsfəli/","extraExplanation":["“disgracefully”常见两种语气：\n1）道德/礼仪层面的“可耻地、不体面地”（强调丢脸、失去尊重）；\n2）质量/程度层面的“糟糕得离谱”（强调标准太差，常带批评或愤怒）。\n语境通常决定是哪一种。","词形拆解有助记忆：dis-（否定、相反）+ grace（优雅、体面/恩惠）+ -ful（充满…的）+ -ly（副词）。字面感觉就是“缺乏体面与优雅地”。","在写作中，它常用于新闻评论或观点表达来加强批评力度：如“disgracefully low pay”（低得可耻的工资）、“disgracefully neglected”（被可耻地忽视）。"]}
{"word":"disgracefulness","summary":{"en":"Disgracefulness means the quality of being disgraceful—something that brings shame or dishonor.","zh":"disgracefulness 指“可耻、丢脸、不名誉的性质”，会带来羞耻或名誉受损。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being disgraceful; behavior or qualities that cause shame, loss of respect, or dishonor","zh":"可耻；丢脸；不名誉的性质或状态（指会带来羞耻、失去尊重或名誉受损的行为/特质）"},"examples":[{"en":"The scandal exposed the disgracefulness of the company’s leadership.","zh":"这起丑闻暴露了公司领导层的可耻之处。"},{"en":"He apologized for the disgracefulness of his comments.","zh":"他为自己言论的可耻性道了歉。"}]}],"synonyms":["shamefulness","dishonor","ignominy","disgrace","infamy"],"phonetic":"/dɪsˈɡreɪsfəlnəs/","extraExplanation":["“disgracefulness”来自形容词“disgraceful（可耻的）”+ 名词后缀“-ness（……的性质/状态）”。在实际英语里，这个名词相对少见，更多时候会用更自然的表达：用“disgrace（耻辱/丢脸的事）”或“shamefulness（可耻性）”，或直接用形容词说“disgraceful behavior（可耻的行为）”。","语气上，“disgraceful”通常比“embarrassing（尴尬的）”更重，带有明确的道德或名誉评价，常用于公众行为、职业操守、丑闻、作弊等语境。"]}
{"word":"disgracement","summary":{"en":"“Disgracement” is a rare noun meaning the act or state of being disgraced (losing honor or respect).","zh":"“Disgracement”是较少见的名词，表示“使蒙羞/丢脸的行为”或“蒙羞的状态（失去名誉与尊敬）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of causing someone to lose respect or honor; the state of being disgraced","zh":"使人丢脸/蒙羞的行为；失去尊敬或名誉的状态"},"examples":[{"en":"His public apology was meant to prevent the disgracement of his family.","zh":"他公开道歉是为了避免家人蒙羞。"},{"en":"In some older writings, “disgracement” is used where we would usually say “disgrace.”","zh":"在一些较老的文章中，“disgracement”常用在我们现在通常说“disgrace”的地方。"}]}],"synonyms":["disgrace","dishonor","shame","humiliation"],"phonetic":"/dɪsˈɡreɪsmənt/","extraExplanation":["“disgracement”在现代英语中比较少见，日常更常用的是“disgrace”（名词/动词）或“disgraceful”（形容词）。如果你在写作或考试中想表达“让……丢脸/使蒙羞”，更自然的说法是：bring disgrace on…, disgrace someone, be a disgrace。"]}
{"word":"disgracer","summary":{"en":"“Disgracer” is a rare noun meaning someone or something that brings disgrace or shame.","zh":"“disgracer”是较少见的名词，指带来耻辱或羞耻的人或事。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing that brings shame or dishonor to someone or something; a source of disgrace","zh":"给人（或事物）带来羞耻、丢脸的人（或事物）；耻辱的来源"},"examples":[{"en":"His cheating made him a disgracer of the team’s reputation.","zh":"他的作弊让他成了玷污球队名声的人。"},{"en":"The scandal turned the official into a disgracer in the public eye.","zh":"这桩丑闻让那位官员在公众眼中成了丢脸的人。"}]}],"synonyms":["a disgrace","shame","embarrassment","dishonor"],"phonetic":"/dɪsˈɡreɪsər/","extraExplanation":["“disgracer”比较少见，更常见的表达是：a disgrace（一个耻辱/丢脸的人或事）、to disgrace（使蒙羞），或用形容词 disgraceful（可耻的）。","构词上，disgrace + -er 表示“做某事的人/造成某结果的人”，因此 disgracer 字面意思就是“带来耻辱的人/事”。","在正式写作里，如果你想说“使……蒙羞的人”，也可以用 brings disgrace to… / disgraces… 这类更自然的表达。"]}
{"word":"disgracers","summary":{"en":"“Disgracers” means people who cause shame or dishonor.","zh":"“disgracers”指造成羞耻或丢脸的人（disgracer 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who bring shame or dishonor to someone, a group, or themselves; those who cause a disgrace","zh":"使（某人/某群体/自己）蒙羞或丢脸的人；造成耻辱的人"},"examples":[{"en":"The coach said anyone who cheated would be a disgracer of the team.","zh":"教练说，任何作弊的人都会让球队蒙羞。"},{"en":"They called the corrupt officials “disgracers” of public service.","zh":"他们称那些腐败官员是“公共服务的耻辱”。"}]}],"synonyms":["disgrace","shame","embarrassment","dishonor","scandal"],"phonetic":"/dɪsˈɡreɪsər/","extraExplanation":["“disgracers”是名词复数，单数是“disgracer”。构词上是 disgrace（使丢脸/耻辱）+ -er（做某事的人）→“使人蒙羞的人”。日常英语中更常见的说法包括“a disgrace (to…)”“shame on…”或“bring shame on…”，而“disgracer”偏少见、语气更强。"]}
{"word":"disgraces","summary":{"en":"“Disgraces” is either the plural of “disgrace” (shameful events) or the third-person singular form of the verb meaning “to shame; to damage someone’s reputation.”","zh":"“disgraces”既可作“disgrace”的复数（丢脸的事/耻辱），也可作动词第三人称单数，表示“使蒙羞；损害名誉”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) acts, events, or situations that cause shame or loss of respect","zh":"（复数名词）丢脸的事；使人蒙羞或失去尊重的事件/处境"},"examples":[{"en":"The scandal was one of the biggest disgraces in the company’s history.","zh":"这起丑闻是这家公司历史上最大的耻辱之一。"},{"en":"He spoke about the disgraces that had damaged the team’s reputation.","zh":"他谈到那些损害球队声誉的丢脸事件。"}]},{"partOfSpeech":"v.","definition":{"en":"(third-person singular verb) to cause someone or something to lose honor, respect, or a good reputation; to shame","zh":"（动词第三人称单数）使……丢脸；使……蒙羞；玷污……名誉"},"examples":[{"en":"His careless comments disgraces the school and its students.","zh":"他不负责任的言论让学校和学生蒙羞。"},{"en":"Stealing from a friend disgraces you more than it hurts them.","zh":"从朋友那里偷东西更让你自己丢脸，而不仅仅是伤害对方。"}]}],"synonyms":["shames","dishonors","humiliates","embarrasses","scandals"],"phonetic":"/dɪsˈɡreɪsɪz/","extraExplanation":["“disgrace”既可以指“羞耻/耻辱”（名词），也可以指“使蒙羞”（动词）。常见搭配：a disgrace to…（……的耻辱/给……丢脸）、fall into disgrace（失宠/名誉扫地）、disgrace oneself（自取其辱）。与“dishonor”相比，“disgrace”更常用于日常语境，强调“丢脸、名声受损”的结果。"]}
{"word":"disgracia","summary":{"en":"“Desgracia” is a Spanish word meaning “misfortune” or sometimes “disgrace.”","zh":"“desgracia”是西语词，意思多为“不幸/灾祸”，有时也可指“耻辱”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) misfortune; a bad event or situation that causes sadness or trouble.","zh":"（西语）不幸；带来悲伤或麻烦的坏事/坏处境。"},"examples":[{"en":"It was a desgracia that the wedding had to be canceled because of the storm.","zh":"因为暴风雨婚礼不得不取消，真是一场不幸（desgracia）。"},{"en":"In Spanish you might say, “¡Qué desgracia!” to mean “What a shame!”","zh":"在西语里你可以说“¡Qué desgracia!”，意思相当于“真可惜/真糟糕！”"}]},{"partOfSpeech":"n.","definition":{"en":"(Spanish) disgrace; loss of honor or respect (less common than the “misfortune” sense in everyday speech).","zh":"（西语）耻辱；名誉受损（口语中不如“不幸”的意思常见）。"},"examples":[{"en":"He felt it was a desgracia to the family name.","zh":"他觉得这对家族名声是一种耻辱（desgracia）。"}]}],"synonyms":["misfortune","tragedy","what a shame","disgrace"],"phonetic":"/dɪsˈɡrɑːsjə/","extraExplanation":["“desgracia”在西班牙语中很常用，既可指“灾祸/不幸”（例如事故、坏消息），也可表达“真可惜/真糟糕”的感叹（¡Qué desgracia!）。","如果你是在学英语：对应的常见英文说法通常是“misfortune”“tragedy”“what a shame”“that’s too bad”。而“disgrace”更偏向“名誉上的耻辱”。"]}
{"word":"disgracing","summary":{"en":"“Disgracing” means causing shame or damaging someone’s reputation; it’s the -ing form of “disgrace.”","zh":"“disgracing”表示使人/使事物蒙羞、损害名誉，是“disgrace”的 -ing 形式。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"bringing shame or loss of respect to someone or something; damaging a good name","zh":"使（某人/某事）蒙羞；损害名誉"},"examples":[{"en":"He was fired for disgracing the company with dishonest behavior.","zh":"他因不诚实的行为让公司蒙羞而被解雇。"},{"en":"Don’t post that—it could be seen as disgracing your family.","zh":"别发那个——可能会被认为是在让家人丢脸。"},{"en":"The scandal is disgracing the entire organization.","zh":"这起丑闻让整个机构颜面尽失。"}]},{"partOfSpeech":"vt.","definition":{"en":"removing someone from a position or honor because of shame or wrongdoing (less common)","zh":"（较少见）因羞耻或不当行为而使（某人）失去职位/荣誉；使被罢免"},"examples":[{"en":"The officer was disgraced and removed from duty; the report described the act as disgracing the service.","zh":"那名军官被革职并撤离岗位；报告称其行为让军队蒙羞。"},{"en":"The committee recommended disgracing the member for serious misconduct.","zh":"委员会建议因严重不当行为取消该成员的荣誉/资格。"}]},{"partOfSpeech":"v.","definition":{"en":"the -ing form of “disgrace,” used in continuous tenses or as a gerund/participle","zh":"“disgrace”的 -ing 形式：用于进行时，或作动名词/现在分词"},"examples":[{"en":"He is disgracing himself by lying again.","zh":"他又撒谎，这是在自取其辱。"},{"en":"Disgracing others online is not acceptable.","zh":"在网上羞辱他人是不可接受的。"}]}],"synonyms":["shaming","dishonoring","humiliating","bringing shame on","tarnishing"],"phonetic":"/dɪsˈɡreɪsɪŋ/","extraExplanation":["“disgracing”常带有很强的道德判断色彩，语气比“embarrassing（尴尬）”更重，接近“shaming（让人蒙羞）/dishonoring（玷污荣誉）”。","用法提示：常见结构有“disgrace + 人/组织/名声（name）/家庭（family）/国家（country）”，也常见“disgrace oneself（自取其辱/使自己丢脸）”。"]}
{"word":"disgracious","summary":{"en":"Disgracious means rude/impolite or not gracious—unkind, ungrateful, or lacking good manners.","zh":"disgracious 指“无礼、不礼貌”，也可指“不够宽厚/不领情”，缺乏得体的风度。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Rude or impolite; showing a lack of respect or good manners.","zh":"无礼的；不礼貌的；缺乏尊重或教养的。"},"examples":[{"en":"It was disgracious to interrupt her while she was speaking.","zh":"她说话时打断她是不礼貌的。"},{"en":"He gave a disgracious reply that made everyone uncomfortable.","zh":"他用无礼的回答让大家都很尴尬。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not gracious or kind; ungrateful or unwilling to accept help politely.","zh":"不够宽厚/不够和气的；（对帮助）不领情、态度生硬的。"},"examples":[{"en":"Even after they apologized, she remained disgracious and cold.","zh":"即使他们道歉了，她仍然不领情，态度冷淡。"},{"en":"He was disgracious about the advice, as if it were an insult.","zh":"他对建议很不领情，仿佛那是在侮辱他。"}]}],"synonyms":["rude","impolite","uncivil","ill-mannered","ungrateful","churlish"],"phonetic":"/dɪsˈɡreɪʃəs/","extraExplanation":["“disgracious”由前缀 dis-（表示否定）+ gracious（和蔼的、得体的）构成，字面意思就是“缺乏gracious那种风度”。","它比常见的 rude 更偏向“失礼、不得体”，常用于较正式或书面语境。日常口语里更常说 rude / impolite / ungrateful（视语境而定）。"]}
{"word":"disgracive","summary":{"en":"“Disgracive” is a rare/archaic adjective meaning “disgraceful; bringing shame.”","zh":"“disgracive”是一个罕见/古体形容词，意思是“可耻的；带来耻辱的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/archaic) Causing disgrace; shameful; dishonoring.","zh":"（罕见/古体）带来耻辱的；可耻的；有损名誉的。"},"examples":[{"en":"In older writings, the word “disgracive” can describe behavior that brings shame to a family.","zh":"在较早的作品中，“disgracive”可用来形容会给家族带来羞耻的行为。"},{"en":"He called the lie a disgracive act against his community.","zh":"他称这个谎言是对社区的一种可耻之举。"}]}],"synonyms":["disgraceful","shameful","dishonorable","ignominious"],"phonetic":"/dɪsˈɡreɪsɪv/","extraExplanation":["“disgracive”在现代英语里非常少见，常被视为古体或非标准用法。日常写作与考试更推荐用 disgraceful（可耻的）、shameful（丢脸的）、dishonorable（不光彩的）。","它看起来是由 disgrace（耻辱）+ -ive（表示“具有……性质/倾向”的后缀）构成，意思与 disgraceful 接近，但当代语感更自然的是 disgraceful。"]}
{"word":"disgradation","summary":{"en":"Disgradation is a rare word meaning degradation—a worsening or decline in condition, quality, or status.","zh":"Disgradation 是一个罕见词，意思与 degradation 相同：指状态、品质或地位的恶化与下降。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A decline in quality, status, condition, or moral character; degradation (a rare/old-fashioned word).","zh":"（罕见/偏旧）品质、地位、状况或道德的下降；退化；堕落（同 degradation）。"},"examples":[{"en":"Years of war led to the disgradation of the city’s schools and hospitals.","zh":"多年的战争导致这座城市的学校和医院逐渐衰败。"},{"en":"The novel portrays the disgradation of a proud family over several generations.","zh":"这部小说描写了一个骄傲的家族在几代人之间的衰落。"}]}],"synonyms":["degradation","decline","deterioration","degeneration","downfall"],"phonetic":"/ˌdɪsɡrəˈdeɪʃən/","extraExplanation":["“disgradation”在现代英语中非常少见，多数情况下人们会用更常见的“degradation”。在阅读较老的文本、宗教/文学写作或某些正式文体中可能偶尔见到。","词根上可理解为“向下（de-/dis-）+ 级别/等级（grade）+ 名词后缀（-ation）”，强调“被降级、变差”的过程或结果。"]}
{"word":"disgrade","summary":{"en":"“Disgrade” isn’t standard English; it’s likely a misspelling of “disgrace,” “degrade,” or “disregard.”","zh":"“disgrade”不是标准英文；很可能是“disgrace / degrade / disregard”等词的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; usually a misspelling of “disgrace,” “degrade,” or “disregard,” depending on what you meant.","zh":"不是标准英文单词；通常是对“disgrace（羞辱/丢脸）”、“degrade（贬低/降级/使变质）”或“disregard（忽视）”的拼写错误，具体取决于你的本意。"},"examples":[{"en":"I think you meant “disgrace”: “His rude comment was a disgrace.”","zh":"我猜你想写“disgrace（丢脸/耻辱）”：“他那句粗鲁的评论很丢脸/是种耻辱。”"},{"en":"Or you meant “degrade”: “Don’t degrade others to feel better.”","zh":"或者你想写“degrade（贬低）”：“不要为了让自己好受就贬低别人。”"},{"en":"Or you meant “disregard”: “Please don’t disregard the rules.”","zh":"或者你想写“disregard（忽视）”：“请不要无视规则。”"}]}],"synonyms":["disgrace","degrade","disregard"],"phonetic":"ˈdɪsɡreɪd","extraExplanation":["“dis-”常见表示“否定/相反/去除”（如 dislike, disconnect）。但“disgrade”在现代英语里不作为固定词使用。","如果你把原句发我（你想表达的那句话），我可以帮你判断最合适的是 disgrace / degrade / disregard，或其他更自然的表达。"]}
{"word":"disgraded","summary":{"en":"“Disgraded” is not a correct word; you likely mean “disgraced” or “degraded.”","zh":"“disgraded” 不是正确拼写；你可能想写 “disgraced” 或 “degraded”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is usually a misspelling of “disgraced” (lost respect/honor) or “degraded” (made worse or lowered in rank).","zh":"不是标准英语单词。通常是拼写错误，常见想写的是 “disgraced”（丢脸/失去名誉）或 “degraded”（被贬低/降级；质量变差）。"},"examples":[{"en":"Incorrect: He was disgraded after the scandal.  ✅ Better: He was disgraced after the scandal.","zh":"错误：He was disgraded after the scandal.  ✅ 更好：He was disgraced after the scandal.（丑闻后他名誉扫地。）"},{"en":"Incorrect: The soil is disgraded.  ✅ Better: The soil is degraded.","zh":"错误：The soil is disgraded.  ✅ 更好：The soil is degraded.（土壤退化了。）"}]}],"synonyms":["disgraced","degraded","dishonored","demoted"],"phonetic":"/dɪsˈɡreɪst/","extraExplanation":["“disgraced” 强调“名誉/尊严受损”（社会评价层面），常与 scandal（丑闻）, fired（被解雇）, publicly（公开地）等搭配。","“degraded” 更常指“质量变差/环境恶化”或“被降级、被贬低”（层级或状态下降），如 degraded soil / degraded performance / degraded to a lower rank。","拼写提示：disgraced 里有 grace（优雅/恩典）→ disgrace（失去体面）→ disgraced；degraded 来自 grade（等级）→ degrade（降低等级）→ degraded。"]}
{"word":"disgrading","summary":{"en":"Disregarding means ignoring something or not considering it.","zh":"Disregarding 表示“不顾、忽视、不予考虑”。"},"definitions":[{"partOfSpeech":"prep.","definition":{"en":"ignoring something; not taking it into consideration","zh":"不顾；不考虑；忽视（某事）"},"examples":[{"en":"Disregarding the warning signs, he kept driving.","zh":"他不顾警示标志，继续开车。"},{"en":"Disregarding cost, they chose the best materials.","zh":"他们不考虑成本，选择了最好的材料。"}]},{"partOfSpeech":"v.","definition":{"en":"the act of ignoring or paying no attention to something","zh":"忽视；不理会（disregard 的现在分词形式）"},"examples":[{"en":"She is disregarding the rules again.","zh":"她又在无视规则了。"},{"en":"Stop disregarding what the doctor said.","zh":"别再无视医生说的话了。"}]}],"synonyms":["ignoring","overlooking","paying no attention to","without considering"],"phonetic":"/ˌdɪsrɪˈɡɑrdɪŋ/","extraExplanation":["你输入的“disgrading”通常是拼写错误，更常见、正确的词是“disregarding”。“dis-”表示“否定/相反”，加上“regard（注意、重视）”，合起来就是“不给予重视、忽视”。","在正式写作中，“disregarding + 名词/名词短语”常用来表示“先把某因素放一边不考虑”，语气比“ignoring”更正式一些。"]}
{"word":"disgradulate","summary":{"en":"“disgradulate” isn’t recognized as a standard English word; it’s likely a misspelling. Share your sentence so I can identify the word you meant.","zh":"“disgradulate”不是标准英语单词，可能是拼写错误。把原句发来，我可以帮你找出你想用的正确单词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"“disgradulate” is not a standard English word (it’s most likely a misspelling or a made-up form).","zh":"“disgradulate”不是标准英语单词（很可能是拼写错误或自造词）。"},"examples":[{"en":"I couldn’t find “disgradulate” in a dictionary—did you mean “discombobulate”?","zh":"我在词典里找不到“disgradulate”——你是不是想写“discombobulate”？"},{"en":"If you tell me the sentence, I can suggest the correct word.","zh":"如果你把整句话发我，我可以帮你判断正确的词。"}]}],"synonyms":["discombobulate","disgruntle","disorient","confuse"],"phonetic":"/ˌdɪsˈɡrædʒəˌleɪt/","extraExplanation":["你可能想写的词之一是 discombobulate（使困惑/慌乱），常见于口语和幽默语境；也可能是 disgruntle（使不满）或 disenfranchise（剥夺权利）之类，但要看原句。","把“disgradulate”所在的完整句子（或你想表达的中文意思）发来，我可以更准确地判断你要的词，并给出更贴切的用法和例句。"]}
{"word":"disgregate","summary":{"en":"“Disgregate” is usually a misspelling of “disaggregate,” meaning to break something (especially data) into smaller parts for analysis.","zh":"“disgregate”通常是“disaggregate”的拼写错误，意思是把整体（尤指数据）拆分成更小部分以便分析。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Usually written as “disaggregate”) to separate something into smaller parts, groups, or categories so you can analyze it more clearly.","zh":"（通常写作 disaggregate）把整体拆分成更小的部分、群体或类别，以便更清楚地分析。"},"examples":[{"en":"The report disaggregates sales data by region and age group.","zh":"这份报告把销售数据按地区和年龄段拆分分析。"},{"en":"We need to disaggregate the total number into male and female students.","zh":"我们需要把总人数拆分为男生和女生的人数。"}]}],"synonyms":["disaggregate","break down","separate","divide","split","partition"],"phonetic":"/ˌdɪsˈæɡrɪˌɡeɪt/","extraExplanation":["“disgregate”在现代英语里非常少见，多数情况下是把 **disaggregate** 拼错了。常见搭配：disaggregate data（拆分数据）、disaggregated by…（按……拆分）。","disaggregate 常用于统计、经济、公共政策与数据分析语境；日常口语里更常用 break down（拆开/细分）。"]}
{"word":"disgregated","summary":{"en":"“Disaggregated” means separated into smaller parts or categories, especially in data or statistics.","zh":"“disaggregated”意为（尤指数据/统计）按类别拆分成更小部分的、非汇总的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(often of data or a group) separated into smaller parts or categories; not combined into one total.","zh":"（常指数据或群体）被拆分成更小的部分或类别的；非汇总的。"},"examples":[{"en":"The report includes disaggregated data by age and gender.","zh":"这份报告包含按年龄和性别拆分的数据。"},{"en":"Disaggregated results can show which neighborhoods need more support.","zh":"拆分后的结果可以显示哪些社区更需要支持。"}]},{"partOfSpeech":"v.","definition":{"en":"Past form of “disaggregate”: to separate something into its component parts.","zh":"“disaggregate”的过去分词：把某物拆分成组成部分。"},"examples":[{"en":"Researchers disaggregated the survey responses into four income groups.","zh":"研究人员把调查回答按收入分成四组。"},{"en":"We disaggregated the total cost into labor, materials, and taxes.","zh":"我们把总成本拆分为人工、材料和税费。"}]}],"synonyms":["separated","broken down","categorized","unbundled"],"phonetic":"/ˌdɪsˈæɡrəˌɡeɪtɪd/","extraExplanation":["“disgregated”通常是拼写错误，更常见的正确拼写是 **disaggregated**（拆分的、非汇总的）。在教育、公共政策、公共卫生等领域很常见，比如 *disaggregated data*（拆分数据），用于看清不同群体的差异。","与 **segregated**（隔离的/种族隔离的）不同，**disaggregated** 主要是中性、技术性用语，强调“按类别拆开统计”，不带“隔离人群”的社会含义。"]}
{"word":"disgregating","summary":{"en":"Disgregating means (rarely) separating or dispersing something into parts, or splitting a group apart.","zh":"disgregating（罕见）指使某物分开、分散成部分，或使群体分裂/解散。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare) separating or scattering into smaller parts; dispersing.","zh":"（罕见）把整体分开或分散成更小的部分；使散开。"},"examples":[{"en":"The crowd was disgregating as the rain started.","zh":"雨一开始下，人群就逐渐散开了。"},{"en":"New rules are disgregating the old unified system into separate departments.","zh":"新规正在把原本统一的体系拆分成不同部门。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare, formal) causing a group to split apart; breaking up an association or community.","zh":"（罕见，正式）使群体分裂；解散某个组织或群落。"},"examples":[{"en":"The conflict was disgregating the team into factions.","zh":"冲突正在把团队分裂成不同派系。"}]}],"synonyms":["dispersing","separating","breaking up","scattering","fragmenting"],"phonetic":"/ˈdɪsɡrɪˌɡeɪtɪŋ/","extraExplanation":["“disgregating”通常是动词“disgregate”的现在分词/进行式形式，但这个词在现代英语中非常少见，很多读者会觉得陌生。","它来自拉丁语词根（dis- 表“分开” + greg- 与“群、集合”有关），字面意思接近“把一群东西拆散”。","学习和写作中更常用的近义表达有：disperse（驱散/分散）、separate（分开）、break up（拆散/解散）、fragment（使碎裂/分裂）。另外别和 segregation/segregating（隔离/种族隔离等语境）混淆。"]}
{"word":"disgregation","summary":{"en":"Disgregation means separation or breaking up into smaller groups (a rare word in modern English).","zh":"disgregation 指“分散、解散、分离成更小群体”（现代英语中较罕见）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of separating people or things into smaller groups; dispersion; disbanding.","zh":"分散；解散；（把人或事物）分离成更小的群体的过程。"},"examples":[{"en":"After the leader resigned, the organization fell into disgregation.","zh":"领导辞职后，这个组织走向分散。"},{"en":"The report described the disgregation of the old alliance into several smaller parties.","zh":"报告描述了旧联盟分裂成几个小党派的过程。"}]}],"synonyms":["separation","dispersion","breakup","disintegration","fragmentation"],"phonetic":"/ˌdɪsɡrɪˈɡeɪʃən/","extraExplanation":["“disgregation”在现代英语中非常罕见，多数场合会用更常见的词：separation（分离）、dispersion（散布/分散）、breakup（解体）、disintegration（瓦解）。","词源上与拉丁语词根 greg-（群体、群集）有关，也能联想到常见词 gregarious（合群的）。因此 dis-greg- 带有“离开群体、使群体分开”的含义。","如果你本来想表达“把统计数据拆分到更细的层级/类别”，更可能要用 disaggregation（数据拆分、分项统计）。"]}
{"word":"disgress","summary":{"en":"“Digress” means to go off the main topic while speaking or writing.","zh":"“digress”表示在说话或写作时偏离主要话题、跑题。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to leave the main topic and talk or write about something else, often briefly","zh":"偏离主题；离题（说或写到别的内容上，常是短暂的）"},"examples":[{"en":"Sorry—I’m digressing. Let’s get back to the main point.","zh":"抱歉，我有点离题了。我们回到重点吧。"},{"en":"The speaker digressed for a few minutes to tell a personal story.","zh":"演讲者离题了几分钟，讲了一个个人故事。"}]}],"synonyms":["go off topic","wander","ramble","deviate"],"phonetic":"/daɪˈɡrɛs/","extraExplanation":["你写的“disgress”通常是拼写错误，正确拼写是 digress（常见搭配：digress from the topic / digress into a story）。","digress 在正式场合里常带一点“礼貌提醒”的语气：说话者意识到自己跑题，会用 “I digress.” 来收回话题。","词源上与“走开、偏离（away from）”的概念有关，所以核心感觉是“从主线岔出去”。"]}
{"word":"disgross","summary":{"en":"Disgust means a strong feeling of revulsion, or to cause that feeling.","zh":"Disgust 指强烈的厌恶/恶心，也可作动词表示“使人厌恶”或“感到厌恶”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong feeling of dislike or revulsion (feeling that something is unpleasant, dirty, or morally wrong)","zh":"强烈的厌恶/反感（觉得某事令人不舒服、肮脏或在道德上令人反感）"},"examples":[{"en":"The smell filled her with disgust.","zh":"那股气味让她感到非常恶心/厌恶。"},{"en":"He looked at the trash in disgust.","zh":"他厌恶地看着那堆垃圾。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make someone feel disgusted; to strongly repel or offend","zh":"使（某人）感到厌恶/恶心；强烈地令人反感"},"examples":[{"en":"The cruelty of the story disgusted many readers.","zh":"故事里的残忍让许多读者感到反感。"},{"en":"His rude comments disgusted her.","zh":"他粗鲁的评论让她很反感。"}]},{"partOfSpeech":"vi.","definition":{"en":"to feel disgust or strong dislike","zh":"感到厌恶/强烈反感"},"examples":[{"en":"Some people disgust easily at the sight of blood.","zh":"有些人看到血很容易感到恶心。"}]}],"synonyms":["revulsion","nausea","distaste","loathing","repel","offend"],"phonetic":"/dɪsˈɡʌst/","extraExplanation":["“disgross”常见于把 **disgust** 拼错的情况。正确拼写是 **disgust**（名词或动词）。"]}
{"word":"disgruntle","summary":{"en":"Disgruntle means to make someone dissatisfied and annoyed, often due to unfair treatment.","zh":"Disgruntle 指“使人不满和恼怒”，常暗含“觉得被不公平对待”的情绪。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone feel annoyed, upset, or dissatisfied (often because they feel treated unfairly)","zh":"使某人不满、恼怒、心生怨气（常因觉得受到不公平对待）"},"examples":[{"en":"The sudden schedule change disgruntled the staff.","zh":"突如其来的排班变动让员工很不满。"},{"en":"Customers were disgruntled after waiting for over an hour.","zh":"顾客等了一个多小时后都很恼火。"}]}],"synonyms":["annoy","upset","dissatisfy","irritate","alienate"],"phonetic":"/dɪsˈɡrʌn.t̬əl/","extraExplanation":["“Disgruntle”常用于正式或书面语，语气比“annoy”更偏向“心里不满/怨气”。常见搭配：disgruntled employees/workers/customers（不满的员工/工人/顾客）。","词形提醒：更常见的是形容词“disgruntled”（不满的、心怀怨气的），而动词“disgruntle”本身在口语里相对少见。","词源小知识：gruntle在现代英语里几乎不用；dis-表示“相反/否定”，disgruntle整体就是“让人不再满意”。"]}
{"word":"disgruntled","summary":{"en":"“Disgruntled” means unhappy and annoyed because you feel dissatisfied or treated unfairly.","zh":"disgruntled 指因不满或觉得被不公平对待而感到恼怒、不悦。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Unhappy, annoyed, or dissatisfied (often because you feel you were treated unfairly or your expectations were not met).","zh":"不满的；恼怒的；失望的（常因觉得被不公平对待或期望落空）。"},"examples":[{"en":"Several disgruntled customers asked to speak to the manager.","zh":"几位不满的顾客要求与经理谈。"},{"en":"He was disgruntled after being passed over for a promotion.","zh":"他因为升职机会被忽略而感到不满。"},{"en":"Disgruntled employees may complain, quit, or work less effectively.","zh":"不满的员工可能会抱怨、辞职，或工作效率下降。"}]}],"synonyms":["dissatisfied","unhappy","annoyed","resentful","discontented"],"phonetic":"/dɪsˈɡrʌn(t)əld/","extraExplanation":["词源提示：dis- 表“否定/相反”，gruntle 是古义“抱怨/发牢骚”（现代很少单独使用）。所以 disgruntled 带有“心里憋着气、在抱怨”的感觉。","语用区别：angry 更强烈；upset 更泛、可能只是难过；dissatisfied 更中性偏书面；disgruntled 常用于描述对工作、服务、待遇等“长期或累积的不满”。","常见搭配：disgruntled employees/workers（不满的员工）、disgruntled customers（不满的顾客）、a disgruntled voter（不满的选民）。"]}
{"word":"disgruntlement","summary":{"en":"Disgruntlement means a feeling of dissatisfaction or resentment.","zh":"disgruntlement 指“不满、怨气、愤懑”的情绪。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A feeling of dissatisfaction, annoyance, or resentment, especially because you think you have been treated unfairly.","zh":"不满；怨气；愤懑（常因觉得自己受到不公平对待而产生）。"},"examples":[{"en":"There was growing disgruntlement among employees about the new schedule.","zh":"员工对新的排班制度越来越不满。"},{"en":"She voiced her disgruntlement in a polite but firm email.","zh":"她在一封礼貌但坚定的邮件里表达了自己的不满。"},{"en":"The policy change caused public disgruntlement across the city.","zh":"这项政策变化引发了全城公众的不满情绪。"}]}],"synonyms":["dissatisfaction","discontent","resentment","annoyance","grievance"],"phonetic":"/dɪsˈɡrʌntəlmənt/","extraExplanation":["词根提示：dis- 表示“否定/相反”，gruntle 是较旧的动词，带有“抱怨、嘟囔”的意味；disgruntled（adj. 不满的）更常见，disgruntlement 是其名词形式。","语体与搭配：disgruntlement 较书面，常用于新闻/报告语境。常见搭配有 growing/widespread disgruntlement（日益/广泛的不满）、express/voice disgruntlement（表达不满）、cause disgruntlement（引发不满）。","近义词细微差别：dissatisfaction 更中性；resentment 更强调“怨恨”；grievance 常指“具体的申诉/不满点”。"]}
{"word":"disgruntles","summary":{"en":"“Disgruntles” means “makes someone annoyed or dissatisfied.”","zh":"“disgruntles”意为“使某人不满/恼怒”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone feel annoyed, dissatisfied, or unhappy (often because something seems unfair or disappointing)","zh":"使某人感到不满、恼怒或失望（常因觉得不公平或令人失望）"},"examples":[{"en":"The sudden schedule change disgruntles the staff.","zh":"突然的排班变动让员工很不满。"},{"en":"Late deliveries often disgruntle customers.","zh":"送货延迟常常会惹恼顾客。"},{"en":"It disgruntles me when meetings start late without an apology.","zh":"会议无故迟到又不道歉会让我很不爽。"}]}],"synonyms":["annoy","irritate","dissatisfy","upset","displease"],"phonetic":"/dɪsˈɡrʌn.təl/","extraExplanation":["“disgruntles”是动词“disgruntle”的第三人称单数（he/she/it disgruntles）。更常见的相关形容词是“disgruntled”（不满的），例如：disgruntled employees（不满的员工）。"]}
{"word":"disgruntling","summary":{"en":"“Disgruntling” means causing annoyance or dissatisfaction, or the act of making someone feel that way.","zh":"“disgruntling”指“令人不满/恼火的”，也可指“使人不满”的过程（disgruntle 的现在分词）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"causing someone to feel annoyed, disappointed, or dissatisfied","zh":"让人感到恼火、失望或不满的；令人不快的"},"examples":[{"en":"The long delay was disgruntling for passengers who had been waiting for hours.","zh":"漫长的延误让等了好几个小时的乘客很不满。"},{"en":"It’s a small but disgruntling problem that keeps interrupting our work.","zh":"这是个不大但很烦人的问题，一直打断我们的工作。"}]},{"partOfSpeech":"vt.","definition":{"en":"the act of making someone feel annoyed or dissatisfied (present participle of “disgruntle”)","zh":"使人不满、恼怒（“disgruntle”的现在分词形式）"},"examples":[{"en":"They kept disgruntling the staff by changing the schedule at the last minute.","zh":"他们总在最后一刻改时间表，让员工很不满。"},{"en":"The new policy is disgruntling many customers.","zh":"新政策正让许多顾客感到不满。"}]}],"synonyms":["annoying","irritating","frustrating","dissatisfying","displeasing"],"phonetic":"/dɪsˈɡrʌn.tl̩.ɪŋ/","extraExplanation":["“disgruntling”来自动词“disgruntle”。其中“dis-”有“使相反/去除”的意思；“gruntle”在古英语里与“抱怨、发牢骚”相关。现代英语里“gruntle”几乎不用，但“disgruntle / disgruntled”很常见。","在日常表达中，更常用“disgruntled”（不满的）来形容人的状态；“disgruntling”更偏书面/强调“令人不满的原因或过程”。"]}
{"word":"disguisable","summary":{"en":"“Disguisable” means something can be disguised or concealed.","zh":"“disguisable”表示某物（或某种情绪、意图等）可以被伪装或掩饰。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to be disguised; capable of being hidden or made to look different.","zh":"可伪装的；可掩饰的；能被乔装或隐藏真实样子的。"},"examples":[{"en":"The device is small and easily disguisable as a phone charger.","zh":"这个装置很小，很容易伪装成手机充电器。"},{"en":"His nervousness was not very disguisable during the interview.","zh":"面试时他的紧张并不太容易掩饰。"}]}],"synonyms":["concealable","hideable","maskable","camouflaged (often: easily camouflaged)"],"phonetic":"/dɪsˈɡaɪzəbəl/","extraExplanation":["“disguisable”由动词 disguise（伪装/掩饰）+ 后缀 -able（“能够……的”）构成，表示“能够被伪装/掩饰的”。日常写作中更常见的替换词有 concealable（可隐藏的）、disguiseable（另一种拼写）、easily disguised（容易被伪装的）。"]}
{"word":"disguisal","summary":{"en":"Disguisal means the act of disguising or, less commonly, a disguise; it’s an uncommon word today—most people say “disguise.”","zh":"disguisal 指“伪装/掩饰的行为”，较少也可指“伪装本身”；现代英语中不常用，通常用 disguise。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of disguising; concealment or masking of a person, thing, or true feelings/identity","zh":"伪装；乔装；掩饰（指把真实身份、外貌或情感隐藏起来的行为）"},"examples":[{"en":"The spy’s successful disguisal allowed him to enter the building unnoticed.","zh":"间谍成功的伪装让他悄无声息地进入了大楼。"},{"en":"Her calm smile was a disguisal of her nervousness.","zh":"她平静的微笑是在掩饰紧张。"}]},{"partOfSpeech":"n.","definition":{"en":"a disguise itself (a covering or appearance used to hide the truth)","zh":"伪装物；伪装的外表（用来掩盖真相的装扮或表象）"},"examples":[{"en":"His formal uniform served as a clever disguisal.","zh":"他的正式制服成了一种巧妙的伪装。"}]}],"synonyms":["disguise","concealment","masking","camouflage","cover-up"],"phonetic":"/dɪsˈɡaɪzəl/","extraExplanation":["“disguisal”在现代英语中比较少见，常见表达通常用名词“disguise”或动名词“disguising”。例如：the act of disguising / a disguise。","如果你是在写作或考试中使用，选“disguise”会更自然、更地道；“disguisal”有一点偏旧式或书面、刻意的感觉。"]}
{"word":"disguisay","summary":{"en":"“Disguise” means to hide or change appearance/identity, or to hide feelings or truth; it can be a verb or a noun.","zh":"“disguise”表示“伪装/掩饰”，既可作动词（伪装、掩盖），也可作名词（伪装）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Correct spelling: disguise) To change the appearance, voice, or behavior of someone/something so that people cannot recognize them or it.","zh":"（正确拼写：disguise）伪装；掩饰（改变外貌、声音或行为，让人认不出来）。"},"examples":[{"en":"He disguised himself as a delivery worker to enter the building.","zh":"他把自己伪装成送货员进入大楼。"},{"en":"The actress wore glasses to disguise her face.","zh":"那位女演员戴上眼镜来掩饰自己的脸。"}]},{"partOfSpeech":"n.","definition":{"en":"A change in appearance or manner that hides who someone is or what something really is.","zh":"伪装；掩饰（用来隐藏真实身份或真实情况的外表/方式）。"},"examples":[{"en":"The spy wore a perfect disguise.","zh":"那名间谍做了很完美的伪装。"},{"en":"His smile was a disguise for his nervousness.","zh":"他的微笑是用来掩饰紧张的。"}]},{"partOfSpeech":"vt.","definition":{"en":"To hide a feeling, intention, or the truth (often used with “disguise” + noun).","zh":"掩盖（情绪、意图或真相；常见结构：disguise + 名词）。"},"examples":[{"en":"She tried to disguise her disappointment.","zh":"她试图掩饰自己的失望。"},{"en":"They disguised the problem with polite words.","zh":"他们用客气的话掩盖了问题。"}]}],"synonyms":["camouflage","conceal","mask","cover","hide"],"phonetic":"/dɪsˈɡaɪz/","extraExplanation":["你输入的“disguisay”很可能是拼写错误，常见正确拼写是 **disguise**。","常见搭配：**disguise oneself as...**（把自己伪装成……）；**be disguised as...**（被伪装成……）；**in disguise**（乔装/伪装着，也可指“换个形式出现”）。例如：*An angel in disguise.*（以别的样子出现的“天使”，指看似普通却很善良的人。）"]}
{"word":"disguise","summary":{"en":"Disguise means to hide identity or the true nature of something, or the costume/appearance used to do so.","zh":"disguise 指“伪装/乔装”或“掩盖真相”，也可作名词表示“伪装的装束或手段”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To change someone’s appearance or behavior so they are not recognized; to hide who someone is.","zh":"（为避免被认出而）伪装、乔装；掩饰真实身份。"},"examples":[{"en":"He disguised himself as a delivery worker to enter the building.","zh":"他乔装成送货员进入大楼。"},{"en":"She spoke in a different voice to disguise her identity on the phone.","zh":"她在电话里用不同的声音来掩饰身份。"}]},{"partOfSpeech":"vt.","definition":{"en":"To hide the true nature of something; to make something seem different from what it really is.","zh":"掩盖（事物的）真实情况；粉饰；伪装成另一种样子。"},"examples":[{"en":"The company tried to disguise the problem with clever marketing.","zh":"公司试图用巧妙的营销来掩盖问题。"},{"en":"His smile disguised his nervousness.","zh":"他的微笑掩饰了紧张。"}]},{"partOfSpeech":"n.","definition":{"en":"A change of appearance that makes someone hard to recognize; clothing or materials used to hide identity.","zh":"伪装；乔装打扮；用于掩饰身份的装束/手段。"},"examples":[{"en":"In the story, the prince travels in disguise to learn about ordinary people.","zh":"在故事里，王子乔装出行以了解普通人的生活。"}]}],"synonyms":["conceal","hide","mask","camouflage"],"phonetic":"/dɪsˈɡaɪz/","extraExplanation":["常见搭配：disguise oneself as...（乔装成……）；disguise the truth/feelings/intentions（掩盖真相/情绪/意图）。","容易混淆：disguise 强调“让人认不出/把真实面貌藏起来”；cover up 更偏“掩盖错误或丑闻”；conceal 更正式，强调“隐藏”。","固定说法：a blessing in disguise 指“因祸得福/塞翁失马”。在文学和童话里常见“in disguise”情节，例如角色乔装出行、测试他人或躲避追捕。"]}
{"word":"disguised","summary":{"en":"“Disguised” means hidden or made to look different, either in appearance (a disguised person) or in feelings/intentions (a disguised insult).","zh":"“disguised”表示“伪装的/被掩饰的”，既可指外表或身份的乔装，也可指情绪或意图被隐藏（如暗含的侮辱）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having your real identity, feelings, or purpose hidden; made to look like something else","zh":"伪装的；被掩饰的（隐藏真实身份、感情或目的；装成别的样子）"},"examples":[{"en":"He entered the building in disguised clothing so no one would recognize him.","zh":"他穿着伪装的衣服进入大楼，这样就没人认得出他。"},{"en":"Her anger was disguised as a polite smile.","zh":"她把愤怒掩饰在礼貌的微笑之下。"},{"en":"It sounded like advice, but it was a disguised insult.","zh":"听起来像建议，但其实是暗含的侮辱。"}]},{"partOfSpeech":"vt.","definition":{"en":"past tense or past participle of “disguise”: to hide or change the appearance or nature of something","zh":"“disguise”的过去式/过去分词：伪装；掩饰；把……乔装或改头换面"},"examples":[{"en":"They disguised the actor with makeup and a wig.","zh":"他们用化妆和假发把演员乔装起来。"},{"en":"She disguised her disappointment and thanked them anyway.","zh":"她掩饰住失望，还是向他们道了谢。"}]}],"synonyms":["concealed","masked","hidden","camouflaged","undercover"],"phonetic":"/dɪsˈɡaɪzd/","extraExplanation":["“disguised”常用来描述两类“隐藏”：①外表/身份上的乔装（a disguised policeman 乔装的警察）；②情绪/意图上的掩饰（disguised fear 掩饰的恐惧）。在写作中，disguised + n. 很常见，如 a disguised threat（伪装的威胁）、a disguised compliment（话里有话的夸奖）。"]}
{"word":"disguisedly","summary":{"en":"“Disguisedly” means “in a hidden or not obvious way; secretly.”","zh":"“disguisedly”表示“以隐藏、不明显的方式；暗中、伪装地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is hidden or not obvious; secretly or under a disguise.","zh":"以隐藏或不明显的方式；暗中地；伪装地。"},"examples":[{"en":"He was disguisedly gathering information for a competitor.","zh":"他在暗中为竞争对手收集信息。"},{"en":"The article was disguisedly critical of the government.","zh":"这篇文章以不那么明显的方式批评了政府。"}]}],"synonyms":["secretly","covertly","surreptitiously","undercover","in disguise"],"phonetic":"/dɪsˈɡaɪ.zɪd.li/","extraExplanation":["“disguisedly”比较少见、更偏书面或旧式用法。日常英语里更常用的表达是：“in disguise / secretly / covertly / under the guise of …”。例如：He was collecting data under the guise of a survey（他以做问卷为名收集数据）。","常见搭配提示：disguised as（伪装成……）；a disguised criticism（含蓄的批评）；under the guise of（假借……之名）。这些比“disguisedly”更自然。"]}
{"word":"disguisedness","summary":{"en":"Disguisedness means the state of being disguised or hidden so it isn’t easily recognized.","zh":"disguisedness 指“伪装/掩饰的状态”，即为了不被认出而隐藏或改变外表。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state or quality of being disguised; the fact of being hidden or made to look different so it is not recognized","zh":"伪装的状态或性质；为了不被认出而被隐藏或改换外表的事实"},"examples":[{"en":"The disguisedness of the message made it hard to understand what the writer really meant.","zh":"这段信息的伪装性让人很难理解作者真正想表达什么。"},{"en":"In the novel, the hero’s disguisedness protects him until the final chapter.","zh":"在小说里，主角的伪装让他一直安全到最后一章。"},{"en":"Her calm voice had a disguisedness that hid her fear.","zh":"她平静的声音带着一种伪装，掩盖了她的恐惧。"}]}],"synonyms":["disguise","concealment","camouflage","masking"],"phonetic":"/dɪsˈɡaɪzdnəs/","extraExplanation":["“disguisedness”是由形容词/过去分词“disguised（伪装的）”加名词后缀“-ness”构成，字面意思就是“伪装/被掩饰的状态”。","这个词在现代英语中相对少见，更常见、更自然的表达是“disguise”（伪装/掩饰）或“being disguised”（处于伪装状态）。例如：the disguise of the message / his disguise / the fact that he was disguised。"]}
{"word":"disguiseless","summary":{"en":"Disguiseless means openly shown and not hidden—frank, undisguised.","zh":"disguiseless 指“毫不掩饰、坦率地显露出来的”，相当于 undisguised / frank。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Open and honest; not hidden or disguised; showing your real feelings or intentions clearly.","zh":"坦率的；不加掩饰的；把真实情感或意图清楚地表现出来的。"},"examples":[{"en":"She gave him a disguiseless answer: she wasn’t interested.","zh":"她给了他一个不加掩饰的回答：她不感兴趣。"},{"en":"His disguiseless disappointment was hard to miss.","zh":"他毫不掩饰的失望很难不被注意到。"}]},{"partOfSpeech":"adj.","definition":{"en":"Without a physical disguise; not wearing something to hide your identity. (Less common)","zh":"未乔装的；未伪装身份的（较不常用）。"},"examples":[{"en":"The witness said the suspect was disguiseless and easy to recognize.","zh":"证人说嫌疑人没有乔装，很容易认出来。"}]}],"synonyms":["undisguised","frank","open","unconcealed","unmasked","candid"],"phonetic":"/dɪsˈɡaɪzləs/","extraExplanation":["“disguiseless”比较少见，更多时候英语会用更常见的词：undisguised（不加掩饰的）、frank（坦率的）、open（直率的）、unmasked（揭开伪装的）。在文学或较正式的写作里偶尔会看到“disguiseless”，用来强调“毫无遮掩、直白呈现”的语气。"]}
{"word":"disguisement","summary":{"en":"Disguisement means a disguise: a way of changing or hiding appearance or true nature, often to avoid being recognized.","zh":"Disguisement 意为“伪装/乔装”，指通过改变外表或掩盖本质来隐藏真实身份或真实情况。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a change in appearance (clothes, makeup, a mask, behavior, etc.) that hides who someone is or what something really is","zh":"伪装；乔装；用来隐藏身份或真实情况的外表/装扮（如衣服、化妆、面具或举止等）"},"examples":[{"en":"He entered the building in disguise, wearing a hat and dark glasses.","zh":"他乔装进入大楼，戴着帽子和墨镜。"},{"en":"The spy used a simple disguise to avoid being recognized.","zh":"间谍用简单的伪装来避免被认出来。"}]},{"partOfSpeech":"n.","definition":{"en":"something that hides the true nature of a person, action, or situation (often used in the pattern “in disguise”)","zh":"（引申）掩饰；伪装（常见用法为“in disguise”，指表面上是某种样子，实则另有本质）"},"examples":[{"en":"His kindness was a form of control in disguise.","zh":"他的“善意”其实是一种控制的伪装。"},{"en":"Losing that job was a blessing in disguise.","zh":"失去那份工作反而是因祸得福。"}]}],"synonyms":["disguise","concealment","cover","camouflage","mask"],"phonetic":"/dɪsˈɡaɪz/","extraExplanation":["常见搭配：wear a disguise（穿/戴伪装）、a clever/simple disguise（巧妙/简单的伪装）、see through a disguise（识破伪装）。","固定表达：a blessing in disguise（因祸得福）。这里的“disguise”表示“表面不好、实则有益”的“伪装”。","词源提示：disguise 与 “guise（外观/装束）”相关，核心意思就是“改变外观以隐藏真实”。"]}
{"word":"disguisements","summary":{"en":"“Disguisements” means multiple disguises, but modern English usually prefers “disguises.”","zh":"“disguisements”指“多种伪装”，但现代英语更常用“disguises”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Ways of changing someone’s appearance (or identity) so they are not recognized; things used to hide who someone is.","zh":"为避免被认出而改变外貌或身份的方法；用于掩盖真实身份的伪装物。"},"examples":[{"en":"The actor wore different disguisements to avoid being recognized in public.","zh":"那位演员用了不同的伪装来避免在公共场合被认出来。"},{"en":"In the story, the spy’s disguisements helped him enter the building unnoticed.","zh":"在故事里，间谍的伪装帮助他悄悄进入大楼而不被注意。"}]}],"synonyms":["disguises","costumes","cover-ups","camouflage"],"phonetic":"/dɪsˈɡaɪz.mənts/","extraExplanation":["“disguisements”是“disguise”的复数形式，但在现代英语里，人们更常用“disguises”来表示“多种伪装”。“disguisements”带有较旧或较正式的感觉，在文学作品或较古风的语境中可能出现。","常见搭配：wear a disguise（戴上伪装/乔装打扮），a clever disguise（巧妙的伪装），in disguise（伪装着；乔装的）。"]}
{"word":"disguiser","summary":{"en":"A “disguiser” is a person (or less commonly a thing) that hides a real appearance or identity.","zh":"“disguiser”指伪装者（较少见也可指伪装用的东西），用来隐藏真实外表或身份。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who disguises themself or someone/something else; someone who hides the real appearance or identity.","zh":"伪装者；给自己或他人/事物做伪装的人；隐藏真实外表或身份的人。"},"examples":[{"en":"The thief was a skilled disguiser who changed his hairstyle and clothes to avoid the cameras.","zh":"那个小偷很会伪装，换了发型和衣服来躲避监控。"},{"en":"In the play, the hero becomes a disguiser to enter the castle unnoticed.","zh":"在这部戏里，英雄乔装打扮，悄悄进入城堡。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) Something that disguises or conceals; a cover or mask.","zh":"（较少见）用于伪装或遮掩的东西；遮盖物；伪装物。"},"examples":[{"en":"Dark sunglasses can be a simple disguiser for someone who wants privacy.","zh":"深色太阳镜可能是想保护隐私的人用来简单伪装的东西。"}]}],"synonyms":["impersonator","concealer","camouflager","someone in disguise"],"phonetic":"/dɪsˈɡaɪzər/","extraExplanation":["“disguiser”来自动词“disguise（伪装）+ -er（做某事的人/物）”。日常英语里更常见的说法是“someone in disguise（乔装的人）”或直接用动词“disguise”。"]}
{"word":"disguises","summary":{"en":"“Disguises” can mean (1) multiple ways of hiding identity (plural noun), or (2) “disguises” as a verb meaning “hides or masks.”","zh":"“disguises”可指（1）多个“伪装/装扮”（复数名词），也可作动词第三人称单数，意为“伪装、掩饰”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) Clothes, makeup, behavior, or a device used to change someone’s appearance so others don’t recognize them.","zh":"（复数名词）用于改变外表、隐藏身份的伪装（如服装、化妆、举止或道具）。"},"examples":[{"en":"The actors wore disguises to avoid attention after the show.","zh":"演出结束后，演员们戴上伪装以避免引人注意。"},{"en":"The spy used different disguises in different cities.","zh":"那名间谍在不同城市使用不同的伪装。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb, third-person singular) To hide the real identity, appearance, or true nature of someone or something.","zh":"（动词第三人称单数）伪装；掩饰（某人/某物的真实身份、外表或本质）。"},"examples":[{"en":"He disguises his voice when he makes prank calls.","zh":"他打恶作剧电话时会伪装自己的声音。"},{"en":"The advertisement disguises the real cost with small print.","zh":"这则广告用小字条款掩饰真实费用。"},{"en":"She disguises her disappointment with a smile.","zh":"她用微笑掩饰失望。"}]}],"synonyms":["conceal","mask","camouflage","cover up","hide"],"phonetic":"/dɪsˈɡaɪzɪz/","extraExplanation":["常见固定搭配：**in disguise** 表示“乔装的 / 伪装的”，也常用作比喻，表示“表面不好但其实是好事（或反过来）”。例如：*a blessing in disguise*（因祸得福）。","名词 **disguise** 强调“伪装的方式/装扮”，动词 **disguise** 则强调“做出隐藏或掩饰的动作”，既可指外表，也常指情绪、意图、问题等抽象事物。"]}
{"word":"disguising","summary":{"en":"“Disguising” means hiding the true identity, appearance, purpose, or feelings of something by making it seem different.","zh":"“disguising”指通过“伪装/掩饰”让事物的真实身份、外表、目的或情绪不被看出来。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to hide the true form, identity, or purpose of something by changing its appearance or the way it seems","zh":"（通过改变外表或呈现方式）掩饰、伪装某事物的真实形态、身份或目的"},"examples":[{"en":"He was disguising his voice so no one would recognize him.","zh":"他在伪装自己的声音，这样就没人能认出他了。"},{"en":"The ad is disguising a sales pitch as a friendly “tip.”","zh":"这则广告把推销话术伪装成友好的“建议”。"}]},{"partOfSpeech":"v.","definition":{"en":"to conceal or cover a feeling, attitude, or fact so that others do not notice it","zh":"掩盖（情绪、态度或事实），让别人不容易察觉"},"examples":[{"en":"She kept smiling, disguising her disappointment.","zh":"她一直微笑着，掩饰自己的失望。"},{"en":"The report uses vague language, disguising the real problem.","zh":"这份报告用含糊的措辞掩盖了真正的问题。"}]}],"synonyms":["concealing","hiding","masking","camouflaging","covering up"],"phonetic":"/dɪsˈɡaɪ.zɪŋ/","extraExplanation":["“disguising”通常是动词 disguise 的现在分词/动名词形式：\n- 进行时：He is disguising his accent.\n- 作名词用（动名词）：Disguising the truth can hurt people.\n也常见于固定搭配：disguise A as B（把A伪装成B）。"]}
{"word":"disgulf","summary":{"en":"“Disgulf” is a very rare verb meaning to rescue or pull something/someone out of an engulfing danger (especially water or a deep gap).","zh":"“disgulf”是非常罕见的动词，指把某人/某物从“被吞没或卷入的危险”（常见于水域或深陷处）中救出或拉出。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Very rare/poetic) To free or rescue (someone or something) from being swallowed up, especially by water, a chasm, or danger; to pull out of an “engulfing” situation.","zh":"（非常少见/诗意用法）使（某人/某物）从被吞没、卷入中脱离出来，尤指从水域、深渊或危险处解救出来。"},"examples":[{"en":"The lifeboat arrived in time to disgulf the sailors from the stormy sea.","zh":"救生艇及时赶到，把水手们从暴风雨的大海中解救出来。"},{"en":"He tried to disgulf her from debt and worry.","zh":"他努力把她从债务与焦虑中拉出来。"}]},{"partOfSpeech":"vt.","definition":{"en":"To remove something from a gulf, deep gap, or abyss; to take out from a deep hollow.","zh":"把某物从海湾、深沟或深渊中取出；从深坑中弄出来。"},"examples":[{"en":"They used ropes to disgulf the fallen cargo from the ravine.","zh":"他们用绳索把掉进峡谷的货物拖出来。"}]}],"synonyms":["rescue","save","pull out","extricate"],"phonetic":"/dɪsˈɡʌlf/","extraExplanation":["“disgulf”在现代英语里几乎不使用，多数读者可能不认识。日常表达更常用：\n- “engulf”= 吞没、卷入\n- “rescue / save / pull out”= 救出、拉出\n如果你是在拼写检查或写作中看到“disgulf”，也有可能是把“engulf（吞没）”或“disgorge（吐出、排出）”写错了。"]}
{"word":"disgust","summary":{"en":"“Disgust” means a strong feeling of dislike or revulsion, and it can also mean to cause that feeling in someone.","zh":"“disgust”表示强烈的厌恶/反感（名词），也可表示“使人厌恶、让人作呕”（动词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strong feeling of dislike or revulsion; a sense that something is unpleasant, dirty, or unacceptable.","zh":"强烈的厌恶感、反感；觉得某事令人不舒服、恶心或不可接受的感觉。"},"examples":[{"en":"The smell from the trash filled me with disgust.","zh":"垃圾的味道让我感到恶心。"},{"en":"She looked at the unfair rule with disgust.","zh":"她对这条不公平的规定感到反感。"}]},{"partOfSpeech":"vt.","definition":{"en":"To cause someone to feel strong dislike or revulsion; to make someone feel sick or morally offended.","zh":"使（某人）感到强烈厌恶、恶心或在道德上反感；让人作呕。"},"examples":[{"en":"The video disgusted many viewers.","zh":"那段视频让许多观众感到反感。"},{"en":"It disgusts me when people lie about others.","zh":"当人们编造谎言诋毁他人时，我会很反感。"}]},{"partOfSpeech":"vi.","definition":{"en":"To feel strong dislike or revulsion.","zh":"感到强烈厌恶；感到恶心。"},"examples":[{"en":"He disgusted at the sight of the spoiled food.","zh":"他看到变质的食物就感到恶心。"}]},{"partOfSpeech":"adj.","definition":{"en":"Feeling strong dislike or revulsion (often used in the phrase “disgusted”).","zh":"厌恶的、反感的（常见于“disgusted”一词/短语中）。"},"examples":[{"en":"I was disgusted by the rude comments.","zh":"我对那些粗鲁的评论感到反感。"},{"en":"They felt disgusted with the corruption.","zh":"他们对腐败现象感到厌恶。"}]}],"synonyms":["revulsion","nausea","distaste","aversion","repulsion","abhorrence"],"phonetic":"/dɪsˈɡʌst/","extraExplanation":["“disgust”既可以指生理上的“恶心”（如难闻的气味、腐坏的食物），也可以指道德/情感上的“反感”（如不公平、残忍或欺骗）。在表达“我很反感……”时，常用结构是：be disgusted by/with... 或 It disgusts me that...。注意：有些学习者会说“disgusting me”，更自然的表达是“disgusts me”或“is disgusting to me”。"]}
{"word":"disgusted","summary":{"en":"“Disgusted” means feeling strong dislike or nausea, often because something seems dirty or morally wrong.","zh":"“disgusted”表示感到强烈厌恶或作呕，常因肮脏或道德上令人反感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Feeling a strong sense of dislike, nausea, or offense (often because something seems dirty, cruel, or morally wrong).","zh":"感到强烈的厌恶、反感或作呕（常因觉得某事肮脏、残忍或在道德上令人不齿）。"},"examples":[{"en":"She looked disgusted when she saw the spoiled food.","zh":"她看到变质的食物时，露出厌恶的表情。"},{"en":"I’m disgusted by the way he lied to his friends.","zh":"他那样对朋友撒谎，让我感到非常反感。"},{"en":"He felt disgusted with himself after losing his temper.","zh":"他发脾气之后，对自己感到很厌恶。"}]},{"partOfSpeech":"adj.","definition":{"en":"Causing strong disgust; extremely unpleasant or offensive (more common as “disgusting,” but “disgusted” can appear this way in some contexts).","zh":"令人厌恶的；非常不愉快或冒犯的（更常用“disgusting”，但“disgusted”在某些语境中也会这样出现）。"},"examples":[{"en":"The room had a disgusted smell that made everyone leave quickly.","zh":"房间里有一股令人作呕的味道，大家很快就离开了。"},{"en":"The report described a disgusted scene after the accident.","zh":"报告描述了事故后令人反感的一幕。"}]}],"synonyms":["repulsed","revolted","sickened","appalled","offended"],"phonetic":"/dɪsˈɡʌstɪd/","extraExplanation":["“disgusted”通常描述“人的感受”，而“disgusting”更常用来描述“事物本身令人厌恶”。例如：I’m disgusted by the smell（我被味道恶心到了） vs. The smell is disgusting（这味道很恶心）。","常见搭配：be disgusted by/at…（对……感到厌恶）；be disgusted with…（对……感到厌恶/对自己或某人行为感到不齿）。语气比“don’t like”强很多，带有强烈的情绪或道德判断。"]}
{"word":"disgustedly","summary":{"en":"“Disgustedly” means “in a disgusted or strongly disapproving way.”","zh":"“disgustedly”表示“厌恶地/反感地（带强烈不赞同或嫌恶）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that shows strong dislike, annoyance, or disgust.","zh":"以厌恶地、反感地（或很不耐烦地）的方式。"},"examples":[{"en":"He looked at the dirty dishes disgustedly and walked away.","zh":"他厌恶地看了看脏盘子，然后走开了。"},{"en":"“Ugh,” she said disgustedly when she saw the spoiled milk.","zh":"“呃，”她看到变质的牛奶时厌恶地说道。"},{"en":"The child pushed the bitter medicine away disgustedly.","zh":"孩子厌恶地把苦药推开。"}]}],"synonyms":["distastefully","repulsively","disapprovingly","with disgust"],"phonetic":"/dɪˈskʌstɪdli/","extraExplanation":["词尾 -ly 常把形容词变成副词：disgusted（感到厌恶的）→ disgustedly（厌恶地）。它通常用来描写“说话的语气/表情/动作”，比如 said/looked/turned away disgustedly。","disgustedly 通常表示明显的情绪反应（甚至带点“受不了、看不下去”的感觉）；如果只是轻微不喜欢，更常用 dislike mildly / not really like 等表达。"]}
{"word":"disgustedness","summary":{"en":"“Disgustedness” means the state or feeling of being disgusted, but it is uncommon; “disgust” is usually more natural.","zh":"“disgustedness”指“感到厌恶/恶心的状态或情绪”，但并不常见；更自然的说法通常是“disgust”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a strong feeling of disgust; the state of being disgusted (often used in a general or slightly informal way)","zh":"强烈的厌恶感；感到恶心/反感的状态（常带一点口语或概括性的用法）"},"examples":[{"en":"The smell filled her with disgustedness.","zh":"那股气味让她充满了厌恶感。"},{"en":"He spoke with disgustedness about the corruption.","zh":"他谈到腐败时语气里充满反感。"}]}],"synonyms":["disgust","revulsion","repulsion","aversion"],"phonetic":"/dɪsˈɡʌstɪdnəs/","extraExplanation":["“disgustedness”是由形容词“disgusted（感到厌恶的）”加名词后缀“-ness”构成的抽象名词，但在现代英语里不算常见。更自然、更常用的表达通常是：\n- “disgust”（更常见的名词：厌恶、反感）\n- “disgust at/with …”（对……的厌恶）\n- “a feeling of disgust / a sense of disgust”（一种厌恶感）\n如果你在写作（尤其是正式写作）中，通常建议用“disgust”或“revulsion”来替代。"]}
{"word":"disguster","summary":{"en":"“Disguster” (rare) means something or someone that makes people feel disgust.","zh":"“disguster”（少见）指让人产生厌恶感的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing that causes disgust; something disgusting (rare/nonstandard).","zh":"让人感到厌恶的人或事物；令人作呕的东西（较少见/不太规范用法）。"},"examples":[{"en":"The spoiled milk was a real disguster.","zh":"那瓶变质的牛奶真是让人作呕的东西。"},{"en":"Don’t be a disguster—clean up your mess.","zh":"别当个让人反感的人——把你的烂摊子收拾干净。"}]}],"synonyms":["something disgusting","disgusting thing","off-putting thing","nuisance (context-dependent)"],"phonetic":"/dɪsˈɡʌstɚ/","extraExplanation":["“disguster”在现代英语里不常见，很多情况下人们更常用：\n- “disgusting thing”/“something disgusting”（令人作呕的东西）\n- “a person who disgusts me”（让我恶心的人）\n- 或直接用名词“disgust”（厌恶）与形容词“disgusting”（令人厌恶的）。\n\n如果你想表达“讨厌的人/让人反感的人”，口语里更自然的说法包括“gross person”“creep”（语气较强，注意场合）。"]}
{"word":"disgustful","summary":{"en":"In modern English, use “disgusting” (not “disgustful”) to mean “very unpleasant or offensive.”","zh":"现代英语中通常用“disgusting”（而不是“disgustful”）表示“令人厌恶的/令人反感的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Causing strong dislike, nausea, or offense; very unpleasant.","zh":"令人厌恶的；令人作呕的；冒犯人的、很不舒服的。"},"examples":[{"en":"The smell from the trash was disgusting.","zh":"垃圾散发出的气味令人作呕。"},{"en":"He made a disgusting comment about her appearance.","zh":"他对她的外貌发表了令人反感的评论。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Less common/nonstandard) A mistaken form of “disgusting.” In modern English, “disgustful” is rarely used.","zh":"（较少见/不太规范）常被当作“disgusting”的误用；现代英语中“disgustful”很少使用。"},"examples":[{"en":"It’s better to say “disgusting,” not “disgustful,” in everyday English.","zh":"日常英语里最好说“disgusting”，而不是“disgustful”。"}]}],"synonyms":["disgusting","gross","repulsive","revolting","nauseating","offensive"],"phonetic":"/dɪsˈɡʌstɪŋ/","extraExplanation":["“disgustful”在历史上偶尔出现，但现代英语更自然的表达几乎总是“disgusting”。如果想表达“充满厌恶（情绪）”，更常见的是“disgusted”（感到厌恶）或“disgusting”（令人厌恶）。","用法对比：I’m disgusted.（我感到厌恶。） vs. That’s disgusting.（那很恶心/令人反感。）"]}
{"word":"disgustfully","summary":{"en":"“Disgustfully” means “with disgust,” showing strong dislike or revulsion.","zh":"“disgustfully”表示“带着厌恶/反感地”，用于描述说话、看待或行动时流露出强烈嫌恶。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that shows strong dislike, revulsion, or disapproval; with disgust.","zh":"以厌恶、反感或强烈不满的方式；带着嫌恶地。"},"examples":[{"en":"He looked at the spoiled milk disgustfully and pushed it away.","zh":"他厌恶地看着变质的牛奶，把它推开了。"},{"en":"She spoke disgustfully about the unfair treatment she saw.","zh":"她带着强烈反感谈到她看到的不公平对待。"},{"en":"The child turned away disgustfully from the smelly garbage.","zh":"孩子厌恶地从臭垃圾旁转过身去。"}]}],"synonyms":["with disgust","disgustedly","revoltedly","nauseatedly"],"phonetic":"/dɪsˈɡʌstfəli/","extraExplanation":["“disgustfully”可以理解，但在现代英语里不算常见；更自然、更常用的表达通常是“with disgust”或副词“disgustedly”（如：He looked at it disgustedly）。","拼写提示：它来自“disgust + -ful + -ly”。虽然构词合理，但实际语料中使用频率较低，所以在正式写作里建议优先用更常见的替代说法。"]}
{"word":"disgustfulness","summary":{"en":"Disgustfulness means “the quality of being disgusting,” causing strong dislike or nausea.","zh":"Disgustfulness 指“令人厌恶的性质/程度”，会引起强烈反感或作呕。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being disgusting; causing strong dislike, nausea, or moral offense","zh":"令人厌恶（作呕/反感/道德上的反感）的性质；厌恶感"},"examples":[{"en":"The disgustfulness of the smell made everyone step back.","zh":"那股气味的令人作呕让大家都后退了一步。"},{"en":"She wrote about the disgustfulness of corruption in public life.","zh":"她写到了公共生活中腐败的可憎之处。"},{"en":"He couldn’t get past the disgustfulness of the scene.","zh":"他无法摆脱那一幕带来的强烈厌恶感。"}]}],"synonyms":["disgust","repulsiveness","revoltingness","nastiness","offensiveness"],"phonetic":"/dɪsˈɡʌstfəlnəs/","extraExplanation":["“disgustfulness”在现代英语里比较少见，更多时候人们用“disgust”（厌恶）或“disgustingness”（令人厌恶的程度/性质），以及更常见的形容词“disgusting”。","构词：disgust（厌恶）+ -ful（充满…的）→ disgustful（令人厌恶的）+ -ness（名词后缀，表示“性质/状态”）→ disgustfulness。","语体与语感：这个词在正式写作或批评性语境中偶尔出现，用来强调“令人厌恶”这一特质本身；日常口语里通常会改说“how disgusting it is”。"]}
{"word":"disgusting","summary":{"en":"“Disgusting” means very unpleasant or offensive, often making you feel strong disgust; informally it can also mean extremely bad.","zh":"“disgusting”表示“令人作呕/令人厌恶”，也可口语表示“糟透了”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Extremely unpleasant; causing a strong feeling of disgust (a feeling of wanting to avoid something because it seems dirty, bad, or offensive).","zh":"令人作呕的；令人厌恶的（让人产生强烈反感、想避开的感觉，常因肮脏、恶心或冒犯）。"},"examples":[{"en":"The fridge smelled disgusting after the power went out.","zh":"停电之后，冰箱闻起来特别恶心。"},{"en":"He made a disgusting comment, and everyone felt uncomfortable.","zh":"他说了一句很冒犯、令人厌恶的话，让大家都很不舒服。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Informal) Very bad or shocking in a negative way.","zh":"（非正式）糟透了；坏得离谱；令人震惊（偏负面）。"},"examples":[{"en":"The service was disgusting—we waited an hour for our food.","zh":"服务糟透了——我们等了一个小时才上菜。"}]}],"synonyms":["gross","nasty","revolting","repulsive","offensive","vile"],"phonetic":"/dɪsˈɡʌstɪŋ/","extraExplanation":["“disgusting”常用来形容两类东西：一类是“生理上让人想吐”的（味道、食物、气味、场景）；另一类是“道德/态度上令人反感”的（言论、行为、对人的对待）。语气很强，形容人或言行时要注意礼貌与场合。","常见搭配：disgusting smell/food/habit/behavior/comment；也常与“absolutely / really / so”连用加强语气：It’s absolutely disgusting."]}
{"word":"disgustingly","summary":{"en":"“Disgustingly” means “in a disgusting way,” or informally “extremely/shockingly,” often with a negative tone.","zh":"“disgustingly”表示“令人厌恶地”，口语中也可表示“极其/离谱地”（常带负面语气）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that causes strong dislike, nausea, or a feeling of being sickened.","zh":"以令人厌恶、反胃或恶心的方式；令人作呕地。"},"examples":[{"en":"The kitchen smelled disgustingly of rotten food.","zh":"厨房里有一股腐烂食物的味道，闻起来令人作呕。"},{"en":"He spoke disgustingly about people he didn’t respect.","zh":"他用令人厌恶的方式谈论那些他不尊重的人。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Informal) Extremely or shockingly, often more than seems fair or reasonable.","zh":"（非正式）极其、夸张地（常带“过分到不合理/不公平”的语气）。"},"examples":[{"en":"The hotel was disgustingly expensive for such a small room.","zh":"那家酒店的房间那么小，价格却贵得离谱。"},{"en":"She’s disgustingly good at chess for a beginner.","zh":"她作为新手棋下得好得夸张。"}]}],"synonyms":["nauseatingly","revoltingly","repulsively","grossly","shockingly","outrageously"],"phonetic":"/dɪsˈɡʌstɪŋli/","extraExplanation":["“disgustingly”来自形容词“disgusting（令人厌恶的）”加副词后缀“-ly”。它既可以表达真实的生理/道德厌恶（气味、行为、言论），也常用于口语夸张，表示“过分地、离谱地”（例如价格、能力），语气里常带不满或羡慕式的吐槽。","使用时注意语气强烈：描述人或群体时可能显得很冒犯；如果只是想表达“很不好”，可以改用“really unpleasantly / terribly”等更温和的表达。"]}
{"word":"disgustingness","summary":{"en":"“Disgustingness” means the quality or degree of being disgusting.","zh":"“disgustingness”指“令人恶心的程度/性质”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or degree of being disgusting; how unpleasant, dirty, or revolting something is","zh":"令人作呕的程度；恶心、肮脏或令人反感的“程度/性质”"},"examples":[{"en":"The disgustingness of the smell made everyone step back.","zh":"那股味道恶心得让大家都往后退。"},{"en":"He complained about the disgustingness of the public restroom.","zh":"他抱怨公共洗手间有多么恶心。"},{"en":"The movie focuses on shock value rather than the disgustingness of real life.","zh":"这部电影更强调猎奇冲击，而不是现实生活中的那种“恶心感”。"}]}],"synonyms":["disgust","grossness","repulsiveness","nastiness"],"phonetic":"/dɪsˈɡʌstɪŋnəs/","extraExplanation":["“disgustingness”是由形容词disgusting（令人恶心的）加名词后缀-ness构成，意思直观，但在日常英语里不算常见，听起来可能偏口语、带吐槽感。更自然、更常用的表达通常是disgust（厌恶/恶心）、grossness（恶心程度，较口语）、or how disgusting something is（有多恶心）。","在正式写作中，建议用disgust或disgusting nature/level（令人厌恶的性质/程度）来避免显得生硬。"]}
{"word":"disgusts","summary":{"en":"“Disgusts” most often means “makes someone feel strong dislike or nausea.” Less commonly, it is the plural noun form meaning “feelings of disgust.”","zh":"“disgusts”最常见是动词第三人称单数，表示“使人厌恶/恶心”。较少见时是名词复数，指“厌恶感”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make someone feel strong dislike, nausea, or moral shock","zh":"使（人）感到强烈厌恶、恶心或道德上的反感"},"examples":[{"en":"The smell of spoiled milk disgusts me.","zh":"变质牛奶的味道让我恶心。"},{"en":"He was disgusted by the corruption in the office.","zh":"他对办公室里的腐败现象感到反感。"},{"en":"It disgusts her that people would lie to gain attention.","zh":"有人为了博关注而说谎，这让她很反感。"}]},{"partOfSpeech":"n.","definition":{"en":"(noun, plural) strong dislike or a feeling of being sickened","zh":"（名词复数）厌恶；反感；恶心感"},"examples":[{"en":"They watched in disgust as trash piled up in the park.","zh":"他们看着公园里垃圾堆积，感到一阵反感。"}]}],"synonyms":["repels","sickens","revolts","offends","appalls"],"phonetic":"/dɪsˈɡʌsts/","extraExplanation":["“disgusts”既可以是动词“disgust”的第三人称单数（He/She/It disgusts），也可以是名词“disgust”的复数（disgusts），但名词复数较少见。日常表达里更常用“in disgust（厌恶地）”或“a look of disgust（厌恶的表情）”。","语气强度通常比“dislike（不喜欢）”更强，带有“觉得恶心/难以接受”的感觉；如果用于评价人或群体，可能显得很重，注意语境与礼貌。"]}
{"word":"disgustus","summary":{"en":"“Disgustus” is a Latin word meaning “disgust,” and it is not standard modern English; in English you usually write “disgust.”","zh":"“disgustus”是拉丁语，意思是“厌恶”，并非标准现代英语；英语通常写“disgust”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Latin, noun) Disgust; a strong feeling of distaste or repulsion.","zh":"（拉丁语，名词）厌恶；强烈的反感或排斥感。"},"examples":[{"en":"In some medieval Latin texts, “disgustus” is used to describe a feeling of revulsion.","zh":"在一些中世纪拉丁文献中，“disgustus”用来描述一种反感/厌恶的情绪。"},{"en":"The writer mentions “disgustus” toward corruption in the city.","zh":"作者提到对城市腐败的“厌恶（disgustus）”。"}]},{"partOfSpeech":"other","definition":{"en":"(Not standard modern English) Sometimes seen as a misspelling or Latinized form of the English word “disgust.”","zh":"（非标准现代英语）有时会被当作英语“disgust”的误拼，或刻意拉丁化的写法。"},"examples":[{"en":"If you mean the English word, write “disgust,” not “disgustus.”","zh":"如果你想表达英语单词，应写“disgust”，而不是“disgustus”。"},{"en":"The student wrote “disgustus,” but the correct English spelling is “disgust.”","zh":"学生写了“disgustus”，但正确的英语拼写是“disgust”。"}]}],"synonyms":["disgust","revulsion","repulsion","distaste"],"phonetic":"/dɪsˈɡʌstəs/","extraExplanation":["“disgustus”不是常见的现代英语词汇，更常见于拉丁语或模仿拉丁风格的写法。现代英语里通常用“disgust”（名词/动词）和“disgusting”（形容词）。","英语“disgust”与拉丁语词根有关：前缀dis-（表示“相反/否定”）+ gustus（“味觉/品尝”），最初和“味道不好、吃不下”这种感觉有关，后来意义扩展到道德或心理层面的“厌恶”。"]}
