{"word":"dish","summary":{"en":"“Dish” usually means a plate/bowl or a prepared food (a menu item). As a verb, it can mean serve food, or informally, share gossip.","zh":"dish 常指“盘子/碟子”或“一道菜”。作动词可指“盛菜/分菜”，口语里也可指“聊八卦/爆料”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A plate or shallow bowl used for serving or eating food; also a particular kind of prepared food (a menu item).","zh":"（1）盘子；碟子（用来盛放食物）（2）（一道）菜；菜肴（菜单上的一道食物）"},"examples":[{"en":"Please put the salad in a clean dish.","zh":"请把沙拉放在一个干净的盘子里。"},{"en":"This restaurant’s most popular dish is spicy noodles.","zh":"这家餐厅最受欢迎的菜是辣面。"},{"en":"That dish is too salty for me.","zh":"那道菜对我来说太咸了。"}]},{"partOfSpeech":"v.","definition":{"en":"To serve food (often by putting it onto plates), or to give out portions of food.","zh":"盛菜；分菜；把食物装盘（常指把食物分到盘子里或分发）"},"examples":[{"en":"Can you dish the rice while I cut the vegetables?","zh":"我切菜的时候你能帮忙把米饭盛出来吗？"},{"en":"She dished up soup for everyone at the table.","zh":"她给桌上的每个人都盛了一碗汤。"}]},{"partOfSpeech":"v.","definition":{"en":"(Informal) To share gossip or secrets; “dish it” = talk freely about personal details.","zh":"（非正式）八卦；爆料；透露小道消息（dish it 常指畅聊八卦/隐私）"},"examples":[{"en":"They stayed up late dishing about their coworkers.","zh":"他们熬夜聊同事的八卦。"},{"en":"Come on—dish! What happened on your date?","zh":"快说嘛！你约会发生什么了？"}]}],"synonyms":["plate","bowl","meal (a dish of food)","serve (dish up)","gossip (informal, as a verb)"],"phonetic":"/dɪʃ/","extraExplanation":["“dish”作名词时很常见两种用法：一个是“器皿”（盘/碟），另一个是“菜肴”（一道菜）。中文里常用不同词来区分，英语则用同一个词靠语境判断。","口语里“dish (about)”指“聊八卦/爆料”，语气可能有点不太礼貌，适合熟人之间；正式场合更常用“talk about”或“share information”。","常见搭配：do the dishes（洗碗）；a signature dish（招牌菜）；dish up（盛上/端上）。"]}
{"word":"dishabilitate","summary":{"en":"Dishabilitate means to disable someone or (more formally) to deprive someone of rights or qualifications.","zh":"dishabilitate 指使人丧失能力（致残/削弱），也可在正式语境中指剥夺权利或资格。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone unable to do something normally; to disable or weaken someone physically or mentally","zh":"使某人无法正常做事；使伤残或削弱（身体或精神能力）"},"examples":[{"en":"The accident dishabilitated him for months, and he needed help walking.","zh":"那场事故让他几个月都行动不便，需要人搀扶走路。"},{"en":"A serious illness can dishabilitate a person even after the fever is gone.","zh":"严重疾病即使退烧后，也可能让人身体机能受损。"}]},{"partOfSpeech":"vt.","definition":{"en":"(formal, often legal) to deprive someone of certain rights or qualifications; to disqualify","zh":"（正式，常用于法律语境）剥夺某人的某些权利或资格；使丧失资格"},"examples":[{"en":"In older legal writing, some crimes could dishabilitate a person from holding public office.","zh":"在较早的法律文本中，某些罪行可能会使人丧失担任公职的资格。"},{"en":"The court did not dishabilitate her from serving on the committee.","zh":"法院并未剥夺她在委员会任职的资格。"}]}],"synonyms":["disable","incapacitate","impair","debilitate","disqualify"],"phonetic":"ˌdɪs.həˈbɪl.əˌteɪt","extraExplanation":["“dishabilitate”比较少见，现代英语中更常用的词是“disable”（使伤残/使不能）或“disqualify”（使不合格/取消资格）。","词形上由 dis-（否定/去除）+ habilitate（使有能力/使具备资格）构成，因此既可指“使失去能力”，也可指“使失去资格/权利”。","在文学或法律风格较强的文本里可能会见到这个词；日常表达通常不建议使用，以免显得生僻或引起误解。"]}
{"word":"dishabilitation","summary":{"en":"Dishabilitation means making someone less able to function, or depriving them of legal rights or qualifications.","zh":"Dishabilitation 指使人能力受损，或（法律上）剥夺其权利/资格的行为或过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of making someone less able to function normally, or of taking away someone’s legal rights or privileges","zh":"使人能力受损的过程；（法律上）剥夺资格、权利或特权的行为/过程"},"examples":[{"en":"A serious head injury can lead to long-term dishabilitation that affects memory and speech.","zh":"严重的头部受伤可能导致长期的能力损害，影响记忆和语言。"},{"en":"In some legal systems, certain convictions can result in dishabilitation from holding public office.","zh":"在一些法律体系中，某些定罪可能导致被剥夺担任公职的资格。"}]}],"synonyms":["impairment","disablement","disqualification","incapacitation"],"phonetic":"/ˌdɪs.həˌbɪl.əˈteɪ.ʃən/","extraExplanation":["“Dishabilitation”是比较少见、偏正式的词，常见于医学/康复讨论或法律语境。日常英语里更常用的表达是“disability”（残疾/障碍）、“impairment”（损伤/功能受损）或“disqualification”（取消资格）。","词形上可理解为 dis-（否定/去除）+ habilitation（使有能力/赋予资格）。在教育和医疗领域，“habilitation”常指帮助个体获得从未具备过的技能（如儿童发展训练），而“rehabilitation”是恢复已有但失去的功能；“dishabilitation”则强调能力被削弱或资格被剥夺。"]}
{"word":"dishabille","summary":{"en":"Dishabille means being (or appearing) partly dressed or casually dressed at home; it can be an adjective or a noun.","zh":"dishabille 指（或形容）衣着不整、半穿着或居家随意穿着的状态；既可作形容词也可作名词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person) wearing casual clothes at home, or being partly dressed; in an untidy or informal state of dress.","zh":"（人）穿着居家便服；衣着不整或半穿着的（状态）。"},"examples":[{"en":"He answered the door in dishabille, wearing a robe and slippers.","zh":"他穿着不整就去开门，只穿了睡袍和拖鞋。"},{"en":"She felt embarrassed to be seen in dishabille outside the hotel room.","zh":"她觉得在酒店房间外以衣着不整的样子被人看见很尴尬。"}]},{"partOfSpeech":"n.","definition":{"en":"the state of being partly dressed or dressed informally (often at home).","zh":"衣着不整；（常指在家）穿得随意或半穿着的状态。"},"examples":[{"en":"The novel opens with the hero in dishabille, surprised by an unexpected visitor.","zh":"小说以男主衣着不整、被不速之客惊到的场景开头。"}]}],"synonyms":["undressed","half-dressed","in a robe","in pajamas","in casual clothes","informally dressed"],"phonetic":"/ˌdɪzəˈbiːl/","extraExplanation":["该词来自法语 déshabillé（字面义“未穿好衣服”）。在英语里带一点“文学/旧式/讲究”的语感，常见于小说描写人物清晨、在家、或突然被打扰时的衣着状态。","在现代日常口语中，人们更常说 in a robe / in my pajamas / half-dressed / underdressed；dishabille 更偏书面或文艺表达。"]}
{"word":"dishabit","summary":{"en":"Dishabit is a rare verb meaning to break a habit or become unaccustomed to something.","zh":"Dishabit 是一个少见动词，表示“使戒掉习惯”或“变得不再习惯”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare) To break someone of a habit; to make someone stop being used to something.","zh":"（少见）使某人戒掉习惯；使某人不再习惯于某事。"},"examples":[{"en":"The coach tried to dishabit the players of arriving late.","zh":"教练试图让队员们改掉迟到的习惯。"},{"en":"Moving abroad can dishabit you of certain routines.","zh":"搬到国外可能会让你不再习惯某些日常规律。"}]},{"partOfSpeech":"v.","definition":{"en":"(Rare) To lose a habit or become unaccustomed to something.","zh":"（少见）失去某种习惯；变得不再习惯于某事。"},"examples":[{"en":"After months away from the gym, he dishabited himself of daily workouts.","zh":"离开健身房几个月后，他让自己不再保持每天锻炼的习惯。"},{"en":"I’ve dishabited to the noise since working from home.","zh":"自从在家工作后，我已经不太习惯那些噪音了。"}]}],"synonyms":["break a habit","get out of the habit (of)","unlearn","wean (someone) off","decondition"],"phonetic":"/dɪsˈhæbɪt/","extraExplanation":["“dishabit”在现代英语里非常少见，更多时候人们会用更自然的表达：break a habit（戒掉习惯）、get out of the habit of…（不再有……的习惯）、unlearn（改掉/忘掉旧习惯）、wean someone off…（让某人逐渐戒掉……）。","构词上：dis-（去除、反向）+ habit（习惯），字面意思就是“去掉习惯”。在写作或考试中，优先使用更常见的替代表达会更地道。"]}
{"word":"dishabited","summary":{"en":"Dishabited is an archaic adjective meaning “undressed” or “not in one’s usual clothing.”","zh":"Dishabited 是一个古用形容词，意思是“脱去衣物的”或“不穿平常衣着的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic) not wearing your usual clothes; undressed or stripped of clothing.","zh":"（古用）不穿平常的衣服；脱去衣物的；衣着不整的。"},"examples":[{"en":"The actor appeared dishabited, wearing only a simple robe for the scene.","zh":"演员以“dishabited”的样子出场，为了那一幕只穿了一件简单的长袍。"},{"en":"After the storm, he was found dishabited and shivering in the cold.","zh":"暴风雨过后，人们发现他衣衫不整，冷得发抖。"}]}],"synonyms":["undressed","unclothed","stripped","in plain clothes"],"phonetic":"/dɪsˈhæbɪtɪd/","extraExplanation":["“dishabited”来自动词“dishabit”（使脱去衣服/制服、剥去穿着），在现代英语中非常少见，更多见于较旧的文学或历史描写。","学习时容易与“disinhabited / uninhabited”（无人居住的）混淆；“dishabited”谈的是“穿着/衣物”，不是“居住/居民”。","更常用的现代说法有：“undressed, unclothed, stripped, in plain clothes”。"]}
{"word":"dishabituate","summary":{"en":"“Dishabituate” means to make someone stop being accustomed to a habit or behavior.","zh":"“Dishabituate”指使某人不再习惯某种行为或戒掉某种习惯。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to break someone of a habit; to help someone stop doing something they are used to","zh":"使（某人）戒掉习惯；使（某人）不再习惯于某事"},"examples":[{"en":"The program is designed to dishabituate teenagers from vaping.","zh":"这个项目旨在帮助青少年戒掉电子烟的习惯。"},{"en":"It can take time to dishabituate yourself from checking your phone every few minutes.","zh":"要让自己不再习惯每隔几分钟就看手机，可能需要一段时间。"}]}],"synonyms":["break (someone) of a habit","wean (someone) off","help (someone) quit","decondition"],"phonetic":"/ˌdɪs.həˈbɪtʃ.u.eɪt/","extraExplanation":["这个词较正式、学术感偏强，常见于心理学/行为科学语境（例如“打破条件反射”“减少习惯化反应”）。日常英语里更常用 break someone of a habit / help someone quit / get out of the habit of… 来表达类似意思。","词形结构：dis-（去除、反向）+ habituate（使习惯）。与 habituate 相对。"]}
{"word":"dishabituated","summary":{"en":"“Dishabituated” means no longer accustomed to something.","zh":"“Dishabituated”表示“不再习惯于某事物”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"no longer used to something; no longer accustomed to a habit, place, or way of living","zh":"不再习惯于……的；不再适应某种习惯、环境或生活方式的"},"examples":[{"en":"After living abroad for ten years, he felt dishabituated to the fast pace of his hometown.","zh":"在国外生活了十年后，他发现自己已经不太适应家乡的快节奏了。"},{"en":"She became dishabituated to spicy food and now prefers mild dishes.","zh":"她渐渐不再习惯吃辣，现在更喜欢清淡的菜。"},{"en":"Many workers felt dishabituated to office life after long periods of remote work.","zh":"长期远程办公后，许多员工觉得自己不太适应办公室生活了。"}]}],"synonyms":["no longer accustomed to","not used to","unaccustomed","out of practice"],"phonetic":"ˌdɪsəˈbɪtʃuˌeɪtɪd","extraExplanation":["这个词由 dis-（表示“去除、否定”）+ habituate（使习惯）构成，意思就是“从习惯中脱离”。日常英语里更常用的表达是 not used to / no longer accustomed to。","相关动词是 dishabituate（使不再习惯；使戒除某习惯），但在现代英语中都比较少见，常见替代说法有 wean (someone) off、break a habit。"]}
{"word":"dishabituating","summary":{"en":"Dishabituating means making someone stop being used to something—especially restoring a response after habituation in psychology.","zh":"Dishabituating 指让人（或动物）不再对某事“习惯化”，尤其在心理学中指让因习惯化而减弱的反应重新增强。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Psychology) Making a response become strong again after it has weakened through habituation (getting used to a repeated stimulus).","zh":"（心理学）使因“习惯化”（对重复刺激逐渐不再反应）而减弱的反应重新增强。"},"examples":[{"en":"A sudden loud sound can be dishabituating, so the animal starts reacting again.","zh":"突然的巨响可能会产生“去习惯化”效应，让动物再次出现明显反应。"},{"en":"The researcher added a new smell to create a dishabituating effect.","zh":"研究者加入一种新的气味来制造“去习惯化”的效果。"}]},{"partOfSpeech":"vt.","definition":{"en":"Gradually causing someone to stop being used to something; weaning someone off a habit or routine.","zh":"逐渐让某人不再习惯某事；帮助某人戒掉某种习惯或固定模式。"},"examples":[{"en":"They are dishabituating him from checking his phone every few minutes.","zh":"他们正帮助他改掉每隔几分钟就看手机的习惯。"},{"en":"Moving to a new schedule can be dishabituating at first.","zh":"换到一个新的作息一开始会让人不太适应（有“去习惯化”的感觉）。"}]}],"synonyms":["weaning (off)","breaking a habit","deconditioning","renewing responsiveness"],"phonetic":"ˌdɪs.həˈbɪtʃ.uˌeɪ.tɪŋ","extraExplanation":["“dishabituating”来自动词 dishabituate（使去习惯化/使改掉习惯）。在心理学实验里更常见，指用“新奇刺激”让已经习惯而反应变弱的对象重新出现反应；日常生活中也可泛指“让人不再习惯某事/改掉习惯”，但用法相对正式、偏学术。"]}
{"word":"dishable","summary":{"en":"Dishable means “suitable to be cooked or served as a dish,” usually describing food.","zh":"dishable 指“适合做成一道菜或端上桌成菜”，多用于形容食物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Suitable for being served as a dish; good to cook or present as a dish (often said of food).","zh":"（常形容食物）适合做成一道菜的；适合端上桌成菜的。"},"examples":[{"en":"These mushrooms are dishab le if you sauté them with garlic and butter.","zh":"这些蘑菇用蒜和黄油炒一炒就很适合做成一道菜。"},{"en":"The cook picked the smallest crabs because they were more dishable and easier to serve.","zh":"厨师挑了小一点的螃蟹，因为更适合装盘，也更容易上桌。"}]}],"synonyms":["suitable to serve","good for cooking","servable","presentable"],"phonetic":"/ˈdɪʃəbəl/","extraExplanation":["“dishable”在现代英语里很少见，更常用的表达是“good for cooking / good to serve / suitable to serve as a dish / presentable”。在菜谱、餐饮或较老的文字中偶尔能见到，用来强调“能端上桌成为一道菜”的感觉。"]}
{"word":"dishallow","summary":{"en":"“Dishallow” is usually a misspelling of **disallow**, meaning “not permit” or “reject/deny acceptance.”","zh":"“dishallow”通常是 **disallow** 的误拼，意思是“禁止/不允许”，也可指“拒绝接受/不予认可”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Often spelled **disallow**.) To not allow something; to refuse to permit it.","zh":"（常见拼写为 **disallow**。）不允许；禁止；不准许某事发生。"},"examples":[{"en":"The school disallows phones in class.","zh":"学校不允许在课堂上使用手机。"},{"en":"Some websites disallow certain usernames.","zh":"一些网站禁止使用某些用户名。"}]},{"partOfSpeech":"vt.","definition":{"en":"To reject or refuse to accept something (such as a claim, expense, or request).","zh":"拒绝接受（如报销、索赔、请求等）；不予认可。"},"examples":[{"en":"The company disallowed his travel expenses.","zh":"公司不予报销他的差旅费用。"},{"en":"The judge disallowed the evidence.","zh":"法官不采纳这项证据。"}]}],"synonyms":["forbid","ban","prohibit","deny","bar"],"phonetic":"/ˌdɪsəˈlaʊ/","extraExplanation":["“dishallow”不是常见标准拼写，通常是把 **disallow** 拼错了。正确拼写是 dis-（表示“否定/相反”）+ allow（允许）。","近义词：forbid（更强、更正式“禁止”）、ban（明令禁止）、prohibit（正式用语“禁止”）。日常写作中，disallow 常见于规则、政策、法律、报销/证据等语境。"]}
{"word":"dishallucination","summary":{"en":"A rare, informal term for realizing a hallucination isn’t real or for a hallucination fading.","zh":"一个较少见、偏非正式的词，指意识到幻觉不真实，或指幻觉逐渐消退。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare, nonstandard) The experience of realizing that a hallucination or vivid false perception is not real, or the process of a hallucination fading and being replaced by a more accurate sense of reality.","zh":"（罕见、非标准用法）意识到幻觉或强烈的错误感知并不真实的体验；或幻觉逐渐消退、被更符合现实的知觉取代的过程。"},"examples":[{"en":"After a few minutes, the dishallucination came suddenly—she recognized the voices were not real.","zh":"几分钟后，“去幻觉”的瞬间突然出现——她意识到那些声音并不真实。"},{"en":"The nurse stayed nearby to help him through dishallucination and to keep him calm.","zh":"护士待在旁边，帮助他度过“去幻觉”的过程，并让他保持镇定。"},{"en":"Good lighting and reassurance sometimes support dishallucination for people who are confused or sleep-deprived.","zh":"对一些困惑或缺觉的人来说，充足的光线和安抚有时能帮助幻觉消退、回到现实感。"}]}],"synonyms":["return to reality","reality check","the hallucinations subsided","regain reality testing"],"phonetic":"/ˌdɪs.həˌluː.səˈneɪ.ʃən/","extraExplanation":["这个词在主流英语词典里通常查不到，更像是由前缀 dis-（表示“消除、去除、反向”）+ hallucination（幻觉）临时造出来的词，常见于网络表达或少量心理健康相关讨论。正式写作中更常用的说法包括 “coming back to reality / regaining reality testing（恢复现实检验能力）/ the hallucinations subsided（幻觉减退）/ reality check（现实检验）”。","如果你是在特定文章、论坛或研究里看到它，含义通常依语境而定：要么强调“识别出那是幻觉”，要么强调“幻觉逐渐消失”。"]}
{"word":"disharmonic","summary":{"en":"Disharmonic means not harmonious—either unpleasant/mismatched in sound or style, or (in science) not harmonically related in frequency.","zh":"Disharmonic 指“不和谐的”：可指声音/风格不协调，也可指（科学中）频率之间不呈谐波关系。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not harmonious; lacking harmony or balance, often sounding unpleasant in music or seeming mismatched in style or effect.","zh":"不和谐的；缺乏协调或平衡的（常指音乐听起来刺耳，或风格/效果不搭）。"},"examples":[{"en":"The choir sounded disharmonic because everyone entered at a different time.","zh":"合唱听起来不和谐，因为大家进来的时间都不一样。"},{"en":"The bright neon sign looked disharmonic with the old stone building.","zh":"鲜亮的霓虹招牌和古老的石头建筑看起来很不协调。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Science, especially acoustics/physics) Describing vibrations or components that are not in simple harmonic relationships (i.e., not integer multiples of a fundamental frequency).","zh":"（科学，尤指声学/物理）指振动或成分不呈简单谐波关系的（即不与基频成整数倍关系）。"},"examples":[{"en":"The signal contains disharmonic components that create a rough, noisy tone.","zh":"这个信号包含非谐波成分，会产生粗糙、嘈杂的音色。"},{"en":"Engine faults can introduce disharmonic vibrations.","zh":"发动机故障可能会引入非谐波振动。"}]}],"synonyms":["dissonant","inharmonious","unharmonious","discordant","clashing"],"phonetic":"/ˌdɪs hɑrˈmɑnɪk/","extraExplanation":["“disharmonic”常见于音乐评论、声学/信号分析等语境；日常英语里更常用的近义词是“dissonant（不协和的、刺耳的）”或“inharmonious（不和谐的）”。","构词上：dis-（否定、相反）+ harmonic（和声的/谐波的）。因此它既可指“听感不和谐”，也可指“物理意义上的非谐波”。"]}
{"word":"disharmonical","summary":{"en":"Disharmonical means “not harmonious; discordant,” often describing sounds, relationships, or ideas that don’t fit well together.","zh":"disharmonical 表示“不和谐的、冲突的”，常用来形容声音、人际关系或观点彼此不协调。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not harmonious; lacking harmony; sounding unpleasant or conflicting.","zh":"不和谐的；缺乏协调的；听起来刺耳或互相冲突的。"},"examples":[{"en":"The disharmonical notes made the song hard to listen to.","zh":"那些不和谐的音符让这首歌很难听。"},{"en":"Their disharmonical opinions turned the meeting into an argument.","zh":"他们不一致（不协调）的观点把会议变成了争吵。"}]}],"synonyms":["disharmonious","discordant","dissonant","unharmonious","clashing"],"phonetic":"/ˌdɪs hɑrˈmɑnɪkəl/","extraExplanation":["“disharmonical”比较少见，更常用的是“disharmonious”或“discordant”。在音乐语境中也常见“dissonant”（不协和的）。","在技术/音乐理论里有时会用“disharmonic/inharmonic”来描述与基音谐波不成整数倍关系的频率成分；日常英语里一般不用“disharmonical”表达这个意思。"]}
{"word":"disharmonies","summary":{"en":"Disharmonies are conflicts or mismatches (and, in music, dissonant sounds).","zh":"Disharmonies 指各种不和谐与冲突；在音乐中也指不协和音。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"lack of harmony; disagreements, conflicts, or things that do not fit well together","zh":"不和谐；不一致；矛盾与冲突（复数）"},"examples":[{"en":"Disharmonies within the team slowed the project down.","zh":"团队内部的不和谐拖慢了项目进度。"},{"en":"The novel highlights the disharmonies between social classes.","zh":"这部小说强调了社会阶层之间的矛盾与冲突。"},{"en":"Their home life was marked by small disharmonies that built up over time.","zh":"他们的家庭生活充满了随着时间累积的小摩擦。"}]},{"partOfSpeech":"n.","definition":{"en":"(music) unpleasant combinations of sounds; dissonances","zh":"（音乐）不协和音；刺耳的和声（复数）"},"examples":[{"en":"The composer used disharmonies to create tension before the calm ending.","zh":"作曲家用不协和音制造紧张感，再引向平静的结尾。"},{"en":"The choir struggled with the disharmonies in the modern piece.","zh":"合唱团在这首现代作品的不协和音部分遇到了困难。"}]}],"synonyms":["conflicts","discord","friction","tensions","disagreements","dissonances"],"phonetic":"/dɪsˈhɑrməniz/","extraExplanation":["“disharmony”的词根是“harmony（和谐）”，前缀“dis-”表示“相反/否定”，所以“disharmonies”常用于比喻人际关系或社会现象中的“不协调、冲突”。","在音乐语境里，它更接近“dissonance（不协和音）”：故意制造“刺耳感/紧张感”，然后再解决到和谐（resolution），这是很多古典与现代作品常见的表达手法。"]}
{"word":"disharmonious","summary":{"en":"Disharmonious means not matching well or not sounding pleasant; lacking harmony.","zh":"disharmonious 指“不和谐/不协调”，可形容搭配不一致或音乐不协和、刺耳。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not pleasant together because parts do not match well; lacking harmony (in sound, color, style, opinions, relationships, etc.).","zh":"不和谐的；不协调的（指声音、颜色、风格、观点或关系等搭配在一起不顺畅、不一致）。"},"examples":[{"en":"The disharmonious colors in the room made it feel uncomfortable.","zh":"房间里不协调的颜色让人感觉不太舒服。"},{"en":"Their disharmonious opinions slowed down the decision-making.","zh":"他们不一致的意见让决策变慢了。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Music) Producing a harsh or unpleasant sound because notes do not fit well together.","zh":"（音乐）不协和的；刺耳的（指音符搭配不当，听起来不悦耳）。"},"examples":[{"en":"The disharmonious chords were used to create tension in the movie scene.","zh":"影片场景里用不协和的和弦来营造紧张感。"},{"en":"The singer struggled with the disharmonious accompaniment.","zh":"歌手在不协和的伴奏下演唱得很吃力。"}]}],"synonyms":["inharmonious","discordant","clashing","unharmonious","incongruous"],"phonetic":"/ˌdɪs.hɑrˈmoʊ.ni.əs/","extraExplanation":["词根拆解有助记忆：dis- 表示“否定/相反”，harmonious 表示“和谐的”，合起来就是“非和谐的”。","常见近义词：discordant（多用于声音/音乐，偏“刺耳、不协和”）、incongruous（更强调“格格不入、不相称”）。","搭配建议：disharmonious colors/sounds/relationship/opinions 等。正式写作里更常见，口语里也常用 “doesn’t go well together / doesn’t match”。"]}
{"word":"disharmonise","summary":{"en":"Disharmonise means to make something lose harmony or to clash/not match well.","zh":"disharmonise 指“使失去和谐/不协调”，也可指“彼此不和谐、相冲突”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something lose harmony; to cause parts, sounds, or relationships to clash or feel inconsistent","zh":"使失去和谐；使不协调；使发生冲突"},"examples":[{"en":"The new color scheme disharmonised with the building’s classic style.","zh":"新的配色与建筑的古典风格不协调。"},{"en":"His careless comment disharmonised the mood of the meeting.","zh":"他一句不经意的话破坏了会议的和谐气氛。"}]},{"partOfSpeech":"vi.","definition":{"en":"to be out of harmony; to clash or not match well","zh":"不和谐；不相配；相冲突"},"examples":[{"en":"The melody disharmonised with the accompaniment in several places.","zh":"这段旋律在好几处与伴奏不和谐。"},{"en":"Their goals disharmonised, so the partnership didn’t last.","zh":"他们的目标不一致，所以合作没能持续。"}]}],"synonyms":["clash","conflict","disrupt","throw off","jar","be out of tune","be out of sync"],"phonetic":"/dɪsˈhɑɹməˌnaɪz/","extraExplanation":["“disharmonise”更常见于英式拼写；美式英语里通常写作“disharmonize”。含义相同，只是拼写习惯不同。","该词相对正式、书面，日常口语中更常用“clash”“not match”“be out of sync”“throw off the balance”等表达。"]}
{"word":"disharmonised","summary":{"en":"Disharmonised means “not in harmony” or “made not to match/agree.”","zh":"disharmonised 表示“不和谐/不协调”，也可指“被弄得不一致”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not in harmony; lacking agreement, balance, or a pleasing match (in sound, parts, ideas, or relationships)","zh":"不和谐的；不协调的；不一致的（声音、部分、想法或关系等不匹配）"},"examples":[{"en":"The colors in the room looked disharmonised, so the space felt uneasy.","zh":"房间里的颜色看起来不协调，所以空间让人觉得不舒服。"},{"en":"Their goals became disharmonised after the company changed direction.","zh":"公司改变方向后，他们的目标变得不一致了。"}]},{"partOfSpeech":"v.","definition":{"en":"past form of “disharmonise”: to make something lose harmony or agreement; to cause mismatch or conflict","zh":"“disharmonise”的过去式/过去分词：使……不和谐；使……失去一致；造成不匹配或冲突"},"examples":[{"en":"The new schedule disharmonised the team’s routines and slowed progress.","zh":"新的排班打乱了团队的节奏，进度也变慢了。"},{"en":"Over time, stress disharmonised their communication.","zh":"随着时间推移，压力让他们的沟通变得不协调。"}]}],"synonyms":["discordant","incongruous","unbalanced","out of sync","at odds"],"phonetic":"/dɪsˈhɑrməˌnaɪzd/","extraExplanation":["“disharmonised”是英式拼写；美式更常见拼写是“disharmonized”。","这个词常用于音乐/设计/关系等语境：指“原本协调的元素被打散或变得不匹配”。在音乐里可指不协和、走音或配器不协调；在日常语境里多指计划、目标或关系“不一致”。"]}
{"word":"disharmonising","summary":{"en":"Disharmonising means making something less harmonious or causing disagreement or an unpleasant mismatch.","zh":"disharmonising 指使某事变得不和谐，或造成不一致、冲突与不协调。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"present participle of “disharmonise”: making something less harmonious; causing disagreement or an unpleasant mix of sounds, colors, ideas, etc.","zh":"“disharmonise”的现在分词：使（事物）变得不和谐；造成不一致、冲突或在声音/色彩/观点等方面不协调。"},"examples":[{"en":"The sudden change in lighting is disharmonising the overall mood of the scene.","zh":"灯光的突然变化正在破坏整个场景的氛围协调。"},{"en":"Harsh comments in meetings can be disharmonising for the whole team.","zh":"会议中的尖刻评论会让整个团队气氛变得不和。"},{"en":"Adding too many bright colors may be disharmonising the design.","zh":"加入太多亮色可能会让这个设计变得不协调。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common) describing something that creates disharmony or feels out of place.","zh":"（较少见）形容会造成不和谐、显得格格不入的。"},"examples":[{"en":"The disharmonising details distracted the audience from the main idea.","zh":"那些不协调的细节让观众偏离了主题。"}]}],"synonyms":["disrupting","unbalancing","clashing","discordant","causing conflict"],"phonetic":"/dɪsˈhɑrməˌnaɪzɪŋ/","extraExplanation":["“disharmonising”是英式拼写（-ise）。美式拼写更常见的是“disharmonizing”（-ize）。两者意思相同。","词根提示：dis- 表示“使相反/破坏”，harmonise/harmonize 表示“使和谐”。合起来就是“使不和谐”。","使用场景既可指“声音不协调”（音乐、发音），也常引申为“关系不和/团队不合/风格不搭”。"]}
{"word":"disharmonism","summary":{"en":"Disharmonism means a state of lacking harmony—conflict or mismatch between parts.","zh":"Disharmonism 指“不和谐的状态”，即各部分之间的冲突、不一致或不相容。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a lack of harmony; disagreement or incompatibility between parts (ideas, people, elements, etc.)","zh":"不协调；不和谐；（事物、人或观点之间的）冲突与不相容"},"examples":[{"en":"There was disharmonism between the team’s goals and the manager’s methods.","zh":"团队目标与经理的方法之间存在不协调。"},{"en":"The report describes disharmonism in the community caused by unfair policies.","zh":"报告描述了不公平政策导致的社区不和谐。"},{"en":"The new design created a sense of disharmonism with the building’s original style.","zh":"新设计与建筑原有风格不搭，产生了不协调感。"}]}],"synonyms":["disharmony","discord","incompatibility","dissonance","conflict"],"phonetic":"/dɪsˈhɑrməˌnɪzəm/","extraExplanation":["“disharmonism”是相对少见、偏书面/学术的词，更常见的表达是“disharmony”“discord”“lack of harmony”。写作时用它会显得正式，但在日常对话里不太常用。","构词法：dis-（否定、不）+ harmony（和谐）+ -ism（表示状态/倾向/现象）。因此它强调的是“一种不和谐的状态或现象”，常用于描述系统内部要素之间的失衡或矛盾。","在音乐语境中，人们通常说“dissonance（不协和音）”或“disharmony”，而不是“disharmonism”。"]}
{"word":"disharmonize","summary":{"en":"Disharmonize means to make something lose harmony or sound unpleasantly uncoordinated (especially in music).","zh":"Disharmonize 指使某事物失去和谐/协调，或（尤指音乐中）使声音不和谐、不协和。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make something lose harmony or balance; to cause parts to clash instead of working well together","zh":"使（某事物）失去和谐或平衡；使各部分产生冲突、不协调"},"examples":[{"en":"The sudden change in leadership disharmonized the team’s workflow.","zh":"领导层的突然变动使团队的工作流程变得不协调。"},{"en":"Harsh lighting can disharmonize the mood of an otherwise calm room.","zh":"刺眼的灯光会破坏原本宁静房间的氛围协调。"}]},{"partOfSpeech":"v.","definition":{"en":"(music) to make notes, voices, or sounds sound unpleasant together; to make something discordant","zh":"（音乐）使音符/声部/声音听起来不和谐；造成不协和"},"examples":[{"en":"The arranger disharmonized the melody on purpose to create tension.","zh":"编曲者故意让旋律不和谐，以制造紧张感。"},{"en":"If the choir isn’t listening closely, the voices may disharmonize.","zh":"如果合唱团不仔细聆听彼此的声音，声部可能会不和谐。"}]}],"synonyms":["disrupt","unbalance","throw off","clash","create discord","discordant"],"phonetic":"/dɪsˈhɑrməˌnaɪz/","extraExplanation":["“disharmonize”由前缀 dis-（表示“使相反/去除”）+ harmonize（使和谐）构成，含义直观：把“和谐”变成“不和谐”。该词相对不常用，日常表达中更常见的是 “create discord / throw off the balance / clash”。"]}
{"word":"disharmonized","summary":{"en":"“Disharmonized” means not in harmony, or made to become discordant.","zh":"“Disharmonized”表示“不和谐/不协调的”，也可指“被弄得不和谐”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not in harmony; lacking a pleasing match or agreement (in sound, color, style, relationships, etc.)","zh":"不协调的；不和谐的（指声音、颜色、风格、人际关系等不匹配、不一致）"},"examples":[{"en":"The disharmonized colors made the room feel uneasy.","zh":"这些不协调的颜色让房间感觉不舒服。"},{"en":"After the argument, the team felt disharmonized and unfocused.","zh":"争吵之后，团队变得不和谐、难以专注。"}]},{"partOfSpeech":"vt.","definition":{"en":"past form of disharmonize: to make something lose harmony or agreement; to cause discord","zh":"disharmonize 的过去式/过去分词：使……失去和谐；使……不协调；造成不一致"},"examples":[{"en":"The sudden tempo change disharmonized the piece.","zh":"突然的速度变化让这首曲子变得不和谐。"},{"en":"Poor communication disharmonized their working relationship.","zh":"沟通不良使他们的工作关系变得不协调。"}]}],"synonyms":["discordant","out of harmony","clashing","incongruent","out of sync"],"phonetic":"/dɪsˈhɑrmənaɪzd/","extraExplanation":["“disharmonized”常见于较正式或书面语境，尤其在音乐评论、设计/配色讨论、以及描述团队或人际关系“失去和谐”时。日常口语里更常用：out of sync, not in harmony, discordant, clash（颜色/风格冲突）。","构词上：dis- 表示“相反/去除”，harmonize 表示“使和谐”，disharmonize 就是“使不和谐”。"]}
{"word":"disharmonizing","summary":{"en":"Disharmonizing means causing a loss of harmony—making things clash rather than fit together.","zh":"Disharmonizing 指“造成不和谐”，让事物彼此冲突、不协调。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"present participle of “disharmonize”: making something lose harmony; causing parts, sounds, colors, or ideas to clash instead of fitting well together.","zh":"“disharmonize”的现在分词：使失去和谐；让各部分、声音、颜色或想法彼此冲突、不协调。"},"examples":[{"en":"Adding bright neon curtains is disharmonizing the room’s calm color palette.","zh":"加上亮色霓虹窗帘让房间原本宁静的配色变得不协调。"},{"en":"The editor worried that the new paragraph was disharmonizing the tone of the essay.","zh":"编辑担心新段落会破坏文章整体语气的和谐。"},{"en":"In music, one wrong note can feel like it’s disharmonizing the whole chord.","zh":"在音乐中，一个错音会让人感觉整组和弦都被弄得不和谐。"}]},{"partOfSpeech":"adj.","definition":{"en":"describing something that creates disharmony or clash.","zh":"形容某物会造成不和谐或冲突、不搭。"},"examples":[{"en":"The disharmonizing details distracted from the simple design.","zh":"这些不协调的细节分散了对简洁设计的注意力。"},{"en":"She avoided disharmonizing flavors and kept the dish balanced.","zh":"她避免味道互相冲突，让菜的口感更均衡。"}]}],"synonyms":["clashing","discordant","inharmonious","jarring","conflicting"],"phonetic":"/dɪsˈhɑrməˌnaɪzɪŋ/","extraExplanation":["构词提示：dis- 常表示“否定/相反/去掉”，harmonize 表示“（使）和谐/协调”。disharmonize 就是“使不和谐”；disharmonizing 是其现在分词，可用于进行时（is disharmonizing）或作形容词（disharmonizing details）。","使用场景：比起更常见的 inharmonious / clashing / discordant，disharmonizing 更像是强调“正在把原本的和谐弄乱”的动作或效果，常见于写作、设计、音乐评论等语境。"]}
{"word":"disharmony","summary":{"en":"Disharmony means a lack of agreement or peace, and in music it can mean clashing, tense sounds.","zh":"Disharmony 指不和、不一致；在音乐中也指不和谐音或紧张的音响效果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Lack of agreement, peace, or good relationships among people, ideas, or parts of a group; conflict or discord.","zh":"不和；不一致；（人际或群体中的）冲突、纷争。"},"examples":[{"en":"There was disharmony in the team after the new rules were announced.","zh":"新规定公布后，团队里出现了不和。"},{"en":"Disharmony between parents can affect a child’s sense of security.","zh":"父母之间的不和会影响孩子的安全感。"},{"en":"The report shows disharmony between what the company says and what it does.","zh":"报告显示这家公司言行不一致。"}]},{"partOfSpeech":"n.","definition":{"en":"In music, a combination of notes that sounds tense or clashes (often used as an effect, not always “wrong”).","zh":"（音乐）不和谐音；（音与音之间的）刺耳、紧张的效果（常用于表达情绪，并不一定是“错误”）。"},"examples":[{"en":"The composer used disharmony to create a feeling of fear.","zh":"作曲家用不和谐音营造恐惧感。"},{"en":"Some modern jazz includes deliberate disharmony.","zh":"一些现代爵士乐会刻意加入不和谐音。"}]}],"synonyms":["discord","conflict","tension","friction","strife"],"phonetic":"/dɪsˈhɑrməni/","extraExplanation":["“Disharmony”由前缀 dis-（表示“否定/相反”）+ harmony（和谐）构成，因此字面意思就是“非和谐”。在日常语境中常更偏向“关系不和、意见不合”；在音乐语境中则更接近“紧张的和声/不协和音”，有时用于艺术表达而非贬义。","近义词辨析：discord 更强调公开的争执或不合；conflict 更强烈，常指对立与冲突；tension 指“紧张气氛”，不一定爆发；disharmony 语气相对书面，强调“整体缺乏协调”。"]}
{"word":"Disharoon","summary":{"en":"Disharoon is mainly used as a surname (proper name), not a common English word with a fixed meaning.","zh":"Disharoon 主要用作英文姓氏（专有名词），并非有固定词义的常见英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a proper noun used as a family name (surname); not a standard English vocabulary word with a widely accepted dictionary meaning","zh":"专有名词：用作姓氏（家族名）；不是英语里常见、具有固定词义的词汇"},"examples":[{"en":"Ms. Disharoon will join the meeting at 3 p.m.","zh":"Disharoon 女士将于下午三点参加会议。"},{"en":"I saw the name Disharoon on the mailbox.","zh":"我在信箱上看到了 Disharoon 这个名字。"}]}],"phonetic":"ˌdɪʃəˈruːn","extraExplanation":["“Disharoon”在英语里更常见的用法是姓氏，而不是可解释为普通词义的单词；因此它的“意思”通常取决于具体家族、族源或姓名学（onomastics）背景。","如果你是在某篇文章、歌词、网络梗或特定社群里看到它，也可能是昵称、用户名或拼写变体；提供上下文（句子/出处/地区）我可以更准确判断它是否是某个短语、外来语音译或特定文化用法。"]}
{"word":"dishaunt","summary":{"en":"Dishaunt is a rare/archaic verb meaning “to discourage or intimidate.”","zh":"dishaunt 是一个罕见/古用动词，意思是“使泄气或使畏缩”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare/archaic) To discourage or intimidate; to make someone lose confidence.","zh":"（罕见/古用）使泄气；使畏缩；使失去信心。"},"examples":[{"en":"The constant criticism dishaunted her, and she stopped sharing her ideas.","zh":"持续的批评让她泄了气，于是她不再分享自己的想法。"},{"en":"He tried not to be dishaunted by the first failure.","zh":"他努力不因第一次失败而气馁。"}]}],"synonyms":["dishearten","discourage","daunt","intimidate","unnerve"],"phonetic":"/dɪˈdɔnt/","extraExplanation":["“dishaunt”在现代英语里非常少见，多被视为古用或拼写变体。实际写作与考试中更常用的是 **dishearten**（使沮丧/使灰心）或 **daunt**（使胆怯/使畏惧）。如果你是在文章里看到“dishaunt”，通常可以按“dishearten/daunt”的意思理解。"]}
{"word":"dishboard","summary":{"en":"“Dashboard” most commonly means a car’s instrument panel, and it also means an app/website screen that shows key information at a glance.","zh":"“Dashboard”常指汽车的仪表板，也可指软件/网站中用于快速展示关键数据的控制面板（数据看板）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A panel in a vehicle (especially a car) that holds the instruments and controls, such as the speedometer and warning lights.","zh":"（尤指汽车的）仪表板：放置车速表、指示灯和控制装置的面板。"},"examples":[{"en":"The warning light on the dashboard turned on.","zh":"仪表板上的警示灯亮了。"},{"en":"Please don’t put objects on the dashboard.","zh":"请不要把东西放在仪表板上。"}]},{"partOfSpeech":"n.","definition":{"en":"A screen in an app or website that shows key information at a glance (for example, charts, tasks, or sales numbers).","zh":"（软件/网站的）控制面板/数据看板：用来一目了然展示关键信息（如图表、任务、销售数据等）的页面。"},"examples":[{"en":"Check the dashboard to see today’s sales.","zh":"查看数据看板，看看今天的销售额。"},{"en":"The dashboard summarizes your account activity.","zh":"控制面板汇总了你的账户活动。"},{"en":"On the main dashboard, you can manage your projects.","zh":"在主控制面板上，你可以管理项目。"}]}],"synonyms":["instrument panel","control panel","console","panel","data dashboard"],"phonetic":"/ˈdæʃbɔrd/","extraExplanation":["你输入的“dishboard”通常是拼写错误，正确拼写是“dashboard”。","词源小知识：早期马车上有一块板用来挡住马蹄“dash”（飞溅、甩出的）泥水，因此叫“dash-board”，后来这个词沿用到汽车的仪表板；再引申到软件里“集中展示关键信息的面板”。"]}
{"word":"dishcloth","summary":{"en":"A dishcloth is a cloth used to wash dishes or wipe kitchen surfaces.","zh":"dishcloth 指洗碗布/抹布，用来洗碗或擦拭厨房表面。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A cloth used for washing dishes or wiping kitchen surfaces.","zh":"洗碗布；抹布（用来洗碗或擦拭厨房台面）"},"examples":[{"en":"Could you rinse the dishcloth and hang it up to dry?","zh":"你能把洗碗布冲一冲，然后挂起来晾干吗？"},{"en":"She wiped the counter with a clean dishcloth.","zh":"她用一块干净的抹布擦了台面。"}]}],"synonyms":["dish rag","washcloth (kitchen use)","cleaning cloth"],"phonetic":"/ˈdɪʃˌklɔθ/","extraExplanation":["英式英语里更常说“tea towel”（擦干碗盘的干布），而“dishcloth”通常指用来清洗、擦拭的湿布；美式英语中“dish towel”也常见，偏“擦干”用途。","使用建议：洗碗布容易滋生细菌，最好经常清洗、拧干并晾晒；也有人用海绵（sponge）或一次性厨房纸巾替代。"]}
{"word":"dishcloths","summary":{"en":"Dishcloths are kitchen cloths used to wash dishes or wipe surfaces.","zh":"dishcloths 指用于洗碗或擦拭厨房表面的抹布/洗碗布。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Cloths used for washing dishes, wiping counters, or cleaning in the kitchen (plural of “dishcloth”).","zh":"洗碗布；抹布（“dishcloth”的复数），用于洗碗、擦台面或厨房清洁。"},"examples":[{"en":"We keep dishcloths by the sink for washing plates and cups.","zh":"我们把洗碗布放在水槽旁，用来洗盘子和杯子。"},{"en":"Please replace the dishcloths every day so they don’t smell.","zh":"请每天更换洗碗布，这样它们就不会有味道。"},{"en":"She wiped the counter with one of the clean dishcloths.","zh":"她用一块干净的抹布擦了台面。"}]}],"synonyms":["dish rags","kitchen cloths"],"phonetic":"/ˈdɪʃˌklɔθs/","extraExplanation":["“Dishcloth”在美式英语里常指洗碗用的布；“tea towel / dish towel”更常指擦干碗盘的布（偏英式说法也常见）。在美国口语里，有时也会把它们都泛称为“kitchen towel”。","因为容易滋生细菌，很多家庭会频繁清洗或用热水/漂白剂消毒洗碗布；在日常交流中也常听到“change/replace the dishcloth”。"]}
{"word":"dishclout","summary":{"en":"A dialect/old-fashioned word meaning “dishcloth.”","zh":"方言/旧式用法，意思是“洗碗布（dishcloth）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cloth used for washing or wiping dishes; a dishcloth.","zh":"洗碗布；擦碗布（用于清洗或擦拭餐具的布）。"},"examples":[{"en":"She grabbed a dishclout to wipe the plates dry.","zh":"她拿起一块洗碗布把盘子擦干。"},{"en":"Rinse the dishclout and hang it up so it doesn’t smell.","zh":"把洗碗布冲干净并挂起来晾着，这样就不会有味道。"}]}],"synonyms":["dishcloth","dish rag","dish towel"],"phonetic":"ˈdɪʃ.klaʊt","extraExplanation":["“dishclout”是较少见的方言/旧式拼写，常见于苏格兰英语或英格兰北部等地区；现代更常用的词是“dishcloth”（美式/英式都常见）。","词源上可理解为“dish（碗盘）+ clout（布、破布）”。在一些方言里“clout”可指一块布或抹布。"]}
{"word":"dishcross","summary":{"en":"Dishcross refers to a market cross monument (notably in Halifax, England) and can also be a related place-name or surname.","zh":"Dishcross 指集市十字架纪念物（尤指英格兰哈利法克斯的 Dish Cross），也可作相关地名或姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a stone market cross (a kind of public monument), especially the medieval “Dish Cross” in Halifax, West Yorkshire, England; also used as a place-name or surname based on that landmark","zh":"（石制）集市十字架（公共纪念物的一种），尤指英格兰西约克郡哈利法克斯的中世纪“Dish Cross（集市十字架）”；也可作由该地标演变而来的地名或姓氏"},"examples":[{"en":"We met near the Dish Cross in the town center.","zh":"我们在市中心的 Dish Cross（集市十字架）附近见面。"},{"en":"The guide explained how the Dish Cross marked the old marketplace.","zh":"导游解释了 Dish Cross 如何标记过去的集市位置。"},{"en":"Her family name, Dishcross, likely comes from that area.","zh":"她的姓 Dishcross 很可能源自那个地区。"}]}],"synonyms":["market cross","stone cross"],"phonetic":"/ˈdɪʃˌkrɔs/","extraExplanation":["“Dish Cross”常被认为与中世纪英国城镇的集市文化有关：集市十字架通常位于市场中心，既是地标，也象征交易受到法律与教会秩序的保护。","拼写上有时写作两词（Dish Cross），也可能连写为一个词（Dishcross），连写形式更常见于姓氏或地址/地名记录中。"]}
{"word":"disheart","summary":{"en":"“Dishearten” means to discourage someone or to lose hope and courage.","zh":"“dishearten”表示让人灰心、泄气，或变得失去希望与勇气。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone lose hope, courage, or confidence; to discourage","zh":"使某人失去希望、勇气或信心；使灰心"},"examples":[{"en":"The repeated rejections disheartened her, but she kept applying.","zh":"一次次被拒让她很灰心，但她还是继续申请。"},{"en":"Don’t let one bad test score dishearten you.","zh":"别因为一次考试成绩不好就灰心。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become discouraged or lose heart","zh":"变得沮丧；泄气；失去斗志"},"examples":[{"en":"After the setback, he began to dishearten and stop trying.","zh":"遭遇挫折后，他开始泄气，不再努力。"}]}],"synonyms":["discourage","demoralize","dismay","depress","dispirite"],"phonetic":"/dɪsˈhɑrtən/","extraExplanation":["“disheart”本身不是常见的标准用法；更常见、也更自然的形式是 **dishearten**。","词源上，**hearten** 有“鼓舞、使振作”的意思；加上前缀 **dis-**（表示“相反/去除”）后，就变成“使失去勇气”。","常见搭配：**be disheartened by**（因……而灰心）、**feel disheartened**（感到灰心）。","写作/文学中常见表达：**lose heart**（丧气）与 **take heart**（振作）意思相对，可替换或对比使用。"]}
{"word":"dishearten","summary":{"en":"Dishearten means to discourage someone and make them lose hope or confidence.","zh":"dishearten 指使人气馁、灰心，失去希望或信心。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone lose confidence, hope, or enthusiasm; to discourage","zh":"使失去信心、希望或热情；使气馁"},"examples":[{"en":"The constant criticism disheartened her, and she stopped sharing her ideas.","zh":"持续的批评让她很气馁，于是她不再分享自己的想法。"},{"en":"Don’t let one failure dishearten you—try again tomorrow.","zh":"别让一次失败让你灰心——明天再试一次。"},{"en":"The team was disheartened by the last-minute goal.","zh":"球队因为对方最后一分钟进球而感到沮丧。"}]}],"synonyms":["discourage","dismay","demoralize","dispirit"],"phonetic":"/dɪsˈhɑɹtən/","extraExplanation":["“dishearten”由前缀 dis-（表示否定/去除）+ hearten（使振作、使鼓起勇气）组成，字面意思是“让人不再有勇气/心气”。常用于描述情绪或动力被打击：be disheartened by/at…（因……而气馁）。","语气比 “sad” 更强调“失去斗志/信心”。相近表达：discourage（更常用、更中性）、demoralize（更强烈，偏“士气被击垮”）。"]}
{"word":"disheartened","summary":{"en":"Disheartened means feeling discouraged and losing confidence or hope.","zh":"disheartened 指“灰心的、泄气的”，强调信心或希望受挫。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Feeling discouraged, disappointed, or having lost confidence and hope.","zh":"感到泄气的；沮丧的；失去信心与希望的。"},"examples":[{"en":"She felt disheartened after failing the exam, but she decided to try again.","zh":"考试不及格后她很泄气，但她决定再试一次。"},{"en":"Don’t be disheartened by criticism—use it to improve.","zh":"不要因为批评而灰心——把它当作改进的机会。"},{"en":"The team was disheartened when their best player got injured.","zh":"当队里最好的球员受伤时，全队都很沮丧。"}]}],"synonyms":["discouraged","downhearted","demoralized","dispiritied","crestfallen"],"phonetic":"/dɪsˈhɑr.tənd/","extraExplanation":["词源上来自“dis-（使相反）+ hearten（鼓舞、使振作）”，字面意思是“让人失去勇气”。在写作中常用来表达情绪上的“被打击到、失去斗志”，语气比 sad 更强调“士气/信心下降”。","常见搭配：feel/become disheartened（感到/变得灰心），disheartened by/at sth（因……而灰心）。相近词：discouraged（泄气的）、demoralized（士气低落的）；反义表达：heartened / encouraged（受到鼓舞的）。"]}
{"word":"disheartenedly","summary":{"en":"“Disheartenedly” means “in a discouraged or hopeless way.”","zh":"“disheartenedly”表示“灰心丧气地、沮丧地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a discouraged, sad, or losing-confidence way; without hope or enthusiasm.","zh":"以沮丧、灰心、失去信心的方式；没有希望或热情地。"},"examples":[{"en":"He looked at the rejection email disheartenedly and closed his laptop.","zh":"他沮丧地看着那封拒信邮件，然后合上了笔记本电脑。"},{"en":"\"I don’t think it will work,\" she said disheartenedly.","zh":"“我觉得这行不通，”她灰心地说。"},{"en":"The team walked off the field disheartenedly after the last-minute goal.","zh":"在最后一分钟丢球后，球队垂头丧气地走下了球场。"}]}],"synonyms":["discouragedly","despondently","dejectedly","sadly","with disappointment"],"phonetic":"/dɪsˈhɑr.tən.ɪd.li/","extraExplanation":["“disheartenedly”来自形容词“disheartened（灰心的）”加副词后缀“-ly”。“dis-”表示“使……失去/相反”，而“hearten”有“鼓舞、使振作”的意思，所以整体含义是“失去勇气/信心”。","这个词在口语中不算高频，更常见的表达是“sadly / discouragingly / with disappointment（失望地）”。写作中用“disheartenedly”会更强调“泄气、被打击后丧失信心”的感觉。"]}
{"word":"disheartener","summary":{"en":"“Disheartener” means something or someone that makes you feel discouraged or lose hope.","zh":"“disheartener” 指让人感到泄气、灰心或失去希望的人或事。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person, thing, or event that discourages someone or makes them lose confidence or hope","zh":"使人泄气的人、事物或事件；令人灰心的因素"},"examples":[{"en":"Repeated rejections can be a real disheartener for new writers.","zh":"反复被拒对新作家来说会非常令人泄气。"},{"en":"Cold rain on the day of the hike was a disheartener, but we went anyway.","zh":"徒步那天的冷雨很打击士气，但我们还是照样出发了。"}]}],"synonyms":["discourager","downer","demoralizer","confidence-killer"],"phonetic":"/dɪsˈhɑrtənər/","extraExplanation":["这个词比较少见，更常用的表达是 discourager（使人泄气的人/事）、downer（扫兴的事/人，口语）、demoralizer（使人丧失斗志的因素）或 simply “something discouraging”（令人沮丧的事）。","构词上：dis-（否定/相反）+ hearten（使振作、鼓舞）+ -er（表示“……的人/物”），字面意思就是“使人不再振作的人/物”。"]}
{"word":"disheartening","summary":{"en":"Disheartening means discouraging—something that makes you feel less hopeful or confident.","zh":"disheartening 指“令人灰心、令人沮丧的”，会让人感到不那么有希望或不那么有信心。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Making you lose hope, confidence, or enthusiasm; discouraging.","zh":"令人失去希望、信心或热情的；令人沮丧的、令人灰心的。"},"examples":[{"en":"It was disheartening to see how little progress we made after so much effort.","zh":"付出了那么多努力之后却发现进展很小，真让人灰心。"},{"en":"The disheartening news made the whole team quiet.","zh":"这个令人沮丧的消息让整个团队都沉默了。"}]}],"synonyms":["discouraging","demoralizing","dispiritng","disappointing","depressing"],"phonetic":"/dɪsˈhɑɹtənɪŋ/","extraExplanation":["词源上与 heart（心、勇气）有关：dis- 表示“去掉/相反”，dishearten 原意接近“使人失去勇气/信心”，所以 disheartening 就是“让人心气被打掉”的感觉。","常见搭配：disheartening experience/news/result（令人沮丧的经历/消息/结果）；It’s disheartening to + 动词（做某事令人灰心）。","语气区分：disheartening 更强调“让人泄气、看不到希望”；如果只是“难过”，更常用 sad；如果是“失望但未必灰心”，常用 disappointing。"]}
{"word":"dishearteningly","summary":{"en":"“Dishearteningly” means “in a discouraging or disappointing way.”","zh":"“dishearteningly”表示“以一种令人沮丧、令人灰心的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that makes someone feel discouraged, disappointed, or less hopeful.","zh":"以一种令人沮丧、灰心或失望的方式。"},"examples":[{"en":"Dishearteningly, the job offer was withdrawn at the last minute.","zh":"令人沮丧的是，那份工作录用在最后一刻被撤回了。"},{"en":"Dishearteningly, many people ignored the warning signs.","zh":"令人灰心的是，很多人无视了警告信号。"},{"en":"The team played well, but dishearteningly, they still lost by one point.","zh":"球队踢得很好，但令人泄气的是，他们仍以一分之差输了。"}]}],"synonyms":["discouragingly","depressingly","dismayingly","disappointingly","sadly"],"phonetic":"/dɪsˈhɑrtənɪŋli/","extraExplanation":["“dishearteningly”来自形容词“disheartening（令人灰心的）”，而“disheartening”来自动词短语“dishearten（使失去勇气/信心）”。常用于书面语或正式表达，语气比“sadly（难过地）”更强调“失去信心/动力”。","常见搭配：dishearteningly common（令人沮丧地普遍）、dishearteningly slow（慢得令人泄气）、dishearteningly low（低得令人灰心）。"]}
{"word":"disheartenment","summary":{"en":"Disheartenment means a strong feeling of discouragement—losing hope or confidence.","zh":"disheartenment 指强烈的灰心与沮丧，表现为失去希望或信心。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feeling of losing confidence, hope, or enthusiasm; discouragement","zh":"灰心；泄气；丧失信心（的情绪）"},"examples":[{"en":"After several job rejections, she felt deep disheartenment but kept applying.","zh":"在多次求职被拒后，她感到很灰心，但还是继续投递。"},{"en":"The team’s early mistakes caused disheartenment in the stands.","zh":"球队开局的失误让看台上的观众感到泄气。"},{"en":"He spoke honestly about his disheartenment and asked friends for support.","zh":"他坦诚地说出自己的沮丧，并向朋友寻求支持。"}]}],"synonyms":["discouragement","demoralization","despondency","dejection"],"phonetic":"/dɪsˈhɑrtnmənt/","extraExplanation":["“disheartenment”来自动词“dishearten”（使灰心），字面意思是“让心气散掉”。它比常见的“discouragement”更书面、更强调“被打击后心里失去勇气/热情”的感觉。","常见搭配：feel/experience disheartenment（感到灰心）；cause disheartenment（导致灰心）；a sense of disheartenment（一种灰心感）。"]}
{"word":"disheartens","summary":{"en":"“Disheartens” means “discourages” or “makes someone feel sad or less hopeful.”","zh":"“disheartens”表示“使人灰心/沮丧”，相当于“discourages”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make someone feel sad, disappointed, or less confident; to discourage","zh":"使（某人）沮丧、灰心、失去信心；使气馁"},"examples":[{"en":"The repeated delays disheartened the team.","zh":"一再的延期让团队感到灰心。"},{"en":"Don’t let one bad grade dishearten you.","zh":"别因为一次不理想的成绩就灰心。"},{"en":"She was disheartened by the lack of support.","zh":"缺乏支持让她感到沮丧。"}]}],"synonyms":["discourages","dismays","demoralizes","dispirit","depresses"],"phonetic":"/dɪsˈhɑɹtənz/","extraExplanation":["“dishearten”由 dis-（否定/去除）+ hearten（使振作、鼓舞）组成，字面感觉是“把心气儿拿走”，所以常用来表达精神上被打击、士气受挫。","常见搭配：be disheartened by…（因……而灰心）；dishearten someone（使某人灰心）。语气比 upset 更偏向“失去动力/信心”。"]}
{"word":"disheathing","summary":{"en":"Disheathing means pulling a blade out of its sheath; figuratively, it can mean revealing something sharp or threatening, like criticism.","zh":"disheathing 指“出鞘、拔刀”；也可比喻“亮出/揭露尖锐或带威胁的东西（如批评）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle) drawing a weapon or blade out of its sheath; unsheathing.","zh":"（现在分词）把武器/刀刃从鞘中抽出；出鞘。"},"examples":[{"en":"The knight paused, disheathing his sword only when the gate opened.","zh":"骑士停了一下，直到城门打开才拔出剑。"},{"en":"She heard the sound of a knife disheathing in the kitchen.","zh":"她听到厨房里刀出鞘的声音。"}]},{"partOfSpeech":"v.","definition":{"en":"(figurative) revealing or bringing out something hidden, especially something sharp, threatening, or powerful (such as criticism).","zh":"（比喻）揭露/亮出隐藏的东西，尤指尖锐、带威胁或很强的东西（如批评）。"},"examples":[{"en":"In the debate, he began disheathing harsh criticism of the policy.","zh":"在辩论中，他开始亮出对该政策的尖锐批评。"},{"en":"The article is disheathing old scandals that many hoped were forgotten.","zh":"这篇文章翻出了许多人希望被遗忘的旧丑闻。"}]}],"synonyms":["unsheathing","drawing (a sword)","pulling out","brandishing (sometimes)","revealing","unveiling"],"phonetic":"dɪsˈhiːðɪŋ","extraExplanation":["“disheath”由前缀 dis-（表示“去除/离开”）+ sheath（鞘）构成，字面意思就是“把刀从鞘里拿出来”。常见于文学、历史题材或奇幻作品中，因为与剑、匕首等意象强相关。","近义词里更常用的是“unsheathing/unsheathe”。“disheathing”也可写作动作描写（常带紧张、对抗的氛围）。"]}
{"word":"disheaven","summary":{"en":"A rare, literary verb meaning “to drive out of heaven” or “to deprive of heaven.”","zh":"一个罕见的文学动词，意思是“逐出天堂”或“剥夺进入天堂的资格/地位”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Archaic or literary) To drive out of heaven; to deprive of heaven or heavenly status.","zh":"（古语/文学用语）把……逐出天堂；剥夺其进入天堂或“天国般”地位。"},"examples":[{"en":"In some old poems, the proud angel is said to be disheavened for his rebellion.","zh":"在一些古诗中，傲慢的天使因叛逆而被说成“被逐出天堂”。"},{"en":"The novel uses “disheaven” figuratively, as if love could disheaven a person from their happiness.","zh":"这部小说把“disheaven”作比喻用法，好像爱情会把人从幸福里“逐出天堂”。"}]}],"synonyms":["banish","cast out","expel","deprive (someone) of heaven"],"phonetic":"/dɪsˈhɛvən/","extraExplanation":["“disheaven”非常罕见，带有强烈的宗教与诗歌色彩。前缀 dis- 常有“剥夺、否定、移除”的意思（如 disarm 解除武装），加上 heaven（天堂）就形成“剥夺天堂/逐出天堂”的含义。","多见于较早期或模仿古风的英语写作；现代英语更常用 cast out of heaven / banish from heaven / deprive of heaven 等表达。"]}
{"word":"dished","summary":{"en":"“Dished” usually means food was served onto plates, or (informally) someone was strongly criticized/defeated; it can also mean “concave/pressed in.”","zh":"“dished”常指“把食物盛好端上”；口语里也可指“把某人批得很惨/打得很惨”；还可作形容词表示“凹进去的、呈碟形的”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “dish”: to put food on plates and serve it.","zh":"“dish”的过去式/过去分词：把食物盛到盘子里并端上桌。"},"examples":[{"en":"She dished the rice into bowls and served everyone.","zh":"她把米饭盛进碗里，给大家端上。"},{"en":"The soup was already dished up when we arrived.","zh":"我们到的时候，汤已经分好了（装盘/盛好）。"}]},{"partOfSpeech":"v.","definition":{"en":"(Informal) Past tense/past participle of “dish”: to criticize, humiliate, or defeat someone decisively (often “dish out”).","zh":"（非正式）“dish”的过去式/过去分词：严厉批评、羞辱某人，或把对方打得很惨（常用 dish out）。"},"examples":[{"en":"He dished out harsh comments during the meeting.","zh":"他在会上抛出了很刻薄的评论。"},{"en":"Our team got dished in the final game.","zh":"我们队在决赛被打得很惨。"}]},{"partOfSpeech":"adj.","definition":{"en":"Made concave (curving inward), or pushed in like a dish; often used for metal, wheels, or surfaces.","zh":"呈凹形的；向内弯/被压凹的（常形容金属、轮毂或表面）。"},"examples":[{"en":"The old hubcap was dished and scratched.","zh":"旧轮毂盖凹了，还刮花了。"},{"en":"The table surface was slightly dished from years of use.","zh":"桌面因为多年使用有点凹陷。"}]}],"synonyms":["served","plated","portioned","doled out","criticized","humiliated","crushed","concave","hollowed"],"phonetic":"/dɪʃt/","extraExplanation":["“dish up”常指“把饭菜盛好端上来”，语气很生活化；“dish out”除了“分发食物”，也常引申为“抛出（批评/惩罚/称赞等）”。比如：dish out punishment（施加惩罚）、dish out advice（不停给建议）。","“get dished”表示“被狠狠教训/惨败”，在英式口语里更常见；美式里也能听到，但更常用 get crushed / get destroyed。"]}
{"word":"disheir","summary":{"en":"“Disheir” means to disinherit someone—to take away their right to inherit.","zh":"“disheir”指“剥夺某人的继承权”，相当于更常见的“disinherit”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To deprive someone of the right to inherit property, money, or a title; to disinherit.","zh":"剥夺（某人）的继承权；使（某人）失去继承资格（同 disinherit）。"},"examples":[{"en":"He threatened to disheir his son after a serious family dispute.","zh":"在一次严重的家庭纠纷后，他威胁要剥夺儿子的继承权。"},{"en":"In the novel, the uncle tries to disheir his niece to keep the fortune for himself.","zh":"在小说里，叔叔试图剥夺侄女的继承权，把财产据为己有。"}]}],"synonyms":["disinherit","cut off","deprive (someone) of an inheritance"],"phonetic":"/dɪsˈhɛr/","extraExplanation":["“disheir”在现代英语中较少见，更常用的是“disinherit”。在法律或文学语境里仍可能出现，带有较正式、古风的色彩。","词源上“dis-”有“取消、剥夺”之意，“heir”指“继承人”。把两部分合起来就是“取消某人的继承人身份”。","文学中常见于家族财产、贵族头衔与继承纠纷的情节（例如戏剧或19世纪小说里常写到“disheir an heir”之类的表达）。"]}
{"word":"dishellenize","summary":{"en":"Dishellenize means to remove or reduce Greek (Hellenic) influence.","zh":"dishellenize 指“去希腊化”，即移除或削弱希腊文化影响。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To remove Greek (Hellenic) influence from something; to make it less Greek in language, culture, or style.","zh":"去希腊化；削弱或移除某事物中的希腊（赫勒尼）文化、语言或风格影响。"},"examples":[{"en":"Some scholars argue that later writers tried to dishellenize the story by replacing Greek terms with local ones.","zh":"一些学者认为，后来的作者试图通过用本地词替换希腊词来让这个故事去希腊化。"},{"en":"The reform movement aimed to dishellenize religious practices and return to earlier traditions.","zh":"这场改革运动旨在使宗教实践去希腊化，并回归更早的传统。"}]}],"synonyms":["dehellenize","de-Hellenize","de-Grecize","de-Greek","dehellenise"],"phonetic":"/ˌdɪsˈhɛləˌnaɪz/","extraExplanation":["这个词比较罕见，多见于历史、宗教学、古典学与文化研究语境。构词法是 dis-（表示“去除、反向”）+ Hellenize（“希腊化”），Hellenize 源自 Hellenic（“希腊的”）。","常见的相关概念是“希腊化（Hellenization）”，指古代希腊语言与文化在地中海和近东地区的传播与影响；dishellenize 则强调“撤回/抵消”这种影响。","在学术写作里，它有时用于讨论文本翻译、宗教仪式、艺术风格或政治制度如何从“更希腊化”转向“更本土化/更传统化”。"]}
{"word":"dishelm","summary":{"en":"Dishelm is a rare word meaning to remove a helmet (or, less commonly, to remove/disable a ship’s helm).","zh":"dishelm 是个很少用的词，意思是“卸下头盔”（较少见也可指“拆除/使船失去舵控”）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare/archaic) To remove someone’s helmet (helm); to unhelm.","zh":"（罕见/古语）给某人卸下头盔（helm）；使其不戴头盔。"},"examples":[{"en":"The squire dishelmed the knight after the joust.","zh":"比武结束后，侍从为骑士卸下了头盔。"},{"en":"In the old tale, the warrior was dishelmed to show he came in peace.","zh":"在古老的故事里，战士被卸下头盔以表明他为和平而来。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Nautical, rare) To remove a helm (a steering handle) or make a vessel without effective steering.","zh":"（航海用语，罕见）拆除舵柄/舵；使船失去有效操控。"},"examples":[{"en":"The storm damaged the steering gear and left the boat effectively dishelmed.","zh":"暴风损坏了转向装置，使船几乎失去操控。"}]}],"synonyms":["unhelm","remove a helmet","take off a helmet","dehelm (rare)"],"phonetic":"/dɪsˈhɛlm/","extraExplanation":["“dis-”常表示“去除、反向”（如 disarm 解除武装、disengage 脱离），“helm”可指“头盔”或“舵/操舵装置”。因此 dishelm 的构词含义是“去掉头盔/去掉舵”。","该词在现代英语中非常少见；日常更常用的表达是 take off his helmet / remove the helmet，航海语境中可用 remove the helm 或 lose steering。"]}
{"word":"dishelmed","summary":{"en":"Dishelmed means having one’s helmet removed or being without a helmet; it can also figuratively mean being left unprotected.","zh":"dishelmed 指“摘下/没有头盔的”，也可比喻“失去保护、暴露无防”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Poetic or literary) Having your helmet removed; without a helmet.","zh":"（诗歌/文学用语）头盔被取下的；不戴头盔的。"},"examples":[{"en":"The knight rode into the hall dishelmed, showing his face in peace.","zh":"骑士不戴头盔进入大厅，以示和平并露出真容。"},{"en":"Dishelmed and weary, he bowed to the crowd.","zh":"他摘下头盔，疲惫地向人群鞠躬。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative) Stripped of protection or defense; left exposed.","zh":"（比喻）失去保护/防御的；暴露无遗的。"},"examples":[{"en":"Without his allies, he felt dishelmed in the debate.","zh":"没有盟友支持，他在辩论中感到毫无防护。"},{"en":"The company was dishelmed after the legal safeguards were removed.","zh":"法律保障被取消后，这家公司仿佛失去“头盔”般暴露在风险中。"}]}],"synonyms":["unhelmeted","bareheaded","unprotected","exposed"],"phonetic":"/dɪsˈhɛlmd/","extraExplanation":["“dis-”在这里表示“去掉/移除”（如 disarm 去武装、disrobe 脱衣）。因此 dishelmed 字面意思就是“去掉头盔的”。","该词较少用于日常英语，更常见于描写骑士、战争或中世纪氛围的文学语境中。现代口语里通常会说 without a helmet / bareheaded / unhelmeted。"]}
{"word":"dishelming","summary":{"en":"Dishelming means removing a helmet (an older/literary word).","zh":"dishelming 指“摘下头盔”，属于较旧或偏文学的用法。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"removing a helmet or head covering; unhelmeting (often used in older or literary writing).","zh":"摘下头盔或头部护具；使脱盔（多见于较旧或文学性的用法）。"},"examples":[{"en":"After the battle, the knight’s dishelming showed he meant peace.","zh":"战斗结束后，骑士摘下头盔，表示他愿意和平相处。"},{"en":"The guard ordered dishelming at the gate to reveal each traveler’s face.","zh":"守卫在城门口要求所有人摘下头盔，以便看清每位旅人的脸。"}]}],"synonyms":["unhelmeting","removing a helmet","taking off a helmet"],"phonetic":"/dɪsˈhɛlmɪŋ/","extraExplanation":["“dishelming”来自前缀 dis-（表示“去除、剥离”）+ helm（古义常指“头盔”）。因此它的核心意思就是“去掉头盔”。","现代英语里更常用的表达是 take off one’s helmet / remove one’s helmet。","学习者常把它和 disheveling（弄乱头发、衣着凌乱）混淆：两个词拼写相近，但含义完全不同。"]}
{"word":"dishelms","summary":{"en":"“Dishelms” means (rarely) removes a helmet, or figuratively removes someone’s protection or authority.","zh":"“dishelms”意为（罕见）摘下头盔，或引申为让某人失去保护/权威。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare, literary) To remove someone’s helmet; to unhelm.","zh":"（罕见，文学用语）给某人摘下头盔；使其不戴头盔。"},"examples":[{"en":"The knight dishelms and bows to the crowd.","zh":"骑士摘下头盔，向人群鞠躬致意。"},{"en":"After the battle, the soldiers dishelmed in silence.","zh":"战后，士兵们默默地摘下头盔。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Figurative, rare) To strip someone of protection, authority, or confidence.","zh":"（引申，罕见）剥夺某人的保护、权威或信心。"},"examples":[{"en":"The scandal dishelmed the leader, leaving him politically exposed.","zh":"这桩丑闻让那位领袖“失去护具”，在政治上暴露无遗。"},{"en":"Her harsh words dishelmed him, and he couldn’t answer.","zh":"她尖刻的话让他瞬间没了底气，一时答不上来。"}]}],"synonyms":["unhelm","deprive","strip","expose"],"phonetic":"/dɪsˈhɛlm/","extraExplanation":["“dishelms”通常是动词“dishelm”的第三人称单数（he/she/it dishelms）。这个词非常少见，多见于诗歌、历史题材或仿古文风的写作。","词根上可以理解为 dis-（去除）+ helm（头盔/护具）。注意不要与更常见的“dishevel(s)”（弄乱头发/衣服）混淆。"]}
{"word":"disher","summary":{"en":"A disher is usually a scooping tool used to portion food (often ice cream), and less commonly it can mean a person who serves food.","zh":"disher 通常指用于定量舀取食物的分份勺（常见于冰淇淋）；较少情况下也可指盛饭/分发食物的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a kitchen tool used to scoop and portion food, especially ice cream, mashed potatoes, or cookie dough","zh":"分份勺；定量勺（用于舀取并分配食物，尤指冰淇淋、土豆泥或饼干面团）"},"examples":[{"en":"Use a disher to make cookies the same size.","zh":"用分份勺可以让饼干大小一致。"},{"en":"The server used an ice-cream disher to scoop two balls of vanilla.","zh":"服务员用冰淇淋勺挖了两球香草味的。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who serves or hands out food (informal or workplace use)","zh":"分发/盛饭的人（较口语或工作场景用法）"},"examples":[{"en":"At the charity dinner, volunteers worked as dishers and servers.","zh":"在慈善晚宴上，志愿者负责盛饭和上菜。"},{"en":"The new disher needs to learn portion sizes.","zh":"新来的盛饭员需要熟悉分量标准。"}]}],"synonyms":["scoop","ice-cream scoop","portion scoop","server"],"phonetic":"/ˈdɪʃɚ/","extraExplanation":["在北美餐饮行业里，disher 常指“带弹簧手柄的定量冰淇淋勺/分份勺”。有时会按编号区分容量（例如 #16 通常表示每夸脱大约能分出 16 勺），用于控制份量与成本。"]}
{"word":"disherent","summary":{"en":"“Disherent” is an archaic verb meaning to disinherit someone.","zh":"“disherent”是一个古义动词，意思是“剥夺某人的继承权（=disinherit）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Archaic) To deprive someone of an inheritance; to cut someone off from inheriting property or rights.","zh":"（古义）剥夺某人的继承权；使某人失去继承财产或权利。"},"examples":[{"en":"In the old will, the father threatened to disherent his son if he married against the family’s wishes.","zh":"在那份旧遗嘱里，父亲威胁说如果儿子违背家族意愿结婚，就要剥夺他的继承权。"},{"en":"The novel’s villain tries to disherent his niece to keep the estate for himself.","zh":"小说里的反派想剥夺侄女的继承权，好把庄园据为己有。"}]}],"synonyms":["disinherit","disown (partly)","cut off (from an inheritance)"],"phonetic":"/ˌdɪsɪnˈhɛrɪt/","extraExplanation":["“disherent”是较少见的旧式拼写/用词，现代英语更常用 **disinherit**。在阅读古文本、法律/遗嘱相关的旧材料时可能会见到。","词根上与“inherit（继承）”相关；前缀“dis-”常有“否定、去除”之意，因此整体含义是“取消继承”。"]}
{"word":"disherison","summary":{"en":"“Disherison” means disinheritance: depriving someone of an inheritance or legal right.","zh":"“disherison”指“剥夺继承权/剥夺继承”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of disinheriting someone; the state of being deprived of an inheritance or legal right (especially property).","zh":"剥夺继承权；被剥夺继承（尤指财产或法律权利）的状态。"},"examples":[{"en":"In the will, the father ordered the disherison of his eldest son.","zh":"在遗嘱中，父亲规定剥夺长子的继承权。"},{"en":"The siblings fought in court over the alleged disherison.","zh":"兄弟姐妹因所谓的剥夺继承权而在法庭上争执不休。"}]}],"synonyms":["disinheritance","dispossession","deprivation"],"phonetic":"/dɪsˈhɛrɪsən/","extraExplanation":["“disherison”是较为少见、偏法律/文学语体的词，常出现在遗嘱、继承纠纷或较正式的叙述中。日常英语里更常用“disinheritance”或动词“to disinherit someone”。","词源上与“heir（继承人）”相关：前缀“dis-”有“否定、取消”的意思，因此整体含义是“取消某人的继承资格”。"]}
{"word":"disherit","summary":{"en":"“Disinherit” means to legally stop someone from inheriting your property or money after you die.","zh":"“Disinherit”指在法律上阻止某人在你去世后继承你的财产或金钱。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to officially prevent someone from receiving your money or property after you die","zh":"（在法律上）剥夺某人继承权；将某人从遗嘱中除名"},"examples":[{"en":"He threatened to disinherit his son if he didn’t stop gambling.","zh":"他威胁说如果儿子不戒赌，就要剥夺他的继承权。"},{"en":"She was disinherited after a family argument.","zh":"她在一次家庭争执后被剥夺了继承权。"},{"en":"Some parents disinherit children who marry against their wishes.","zh":"有些父母会因子女违背意愿结婚而剥夺其继承权。"}]}],"synonyms":["cut off","cut out of the will","exclude from a will"],"phonetic":"/ˌdɪsɪnˈhɛrɪt/","extraExplanation":["你输入的“disherit”通常是拼写错误；正确拼写是 **disinherit**。","词源提示：**dis-** 表示“取消、否定”，**inherit** 表示“继承”，合在一起就是“取消继承权”。","使用场景：这个词多出现在家庭、遗嘱、法律语境中，语气比较严肃。日常口语里也常用更直接的说法：*cut someone out of the will*（把某人从遗嘱里除名）。"]}
{"word":"disherited","summary":{"en":"Disinherited (often misspelled as “disherited”) means being refused an inheritance or having your inheritance rights taken away.","zh":"Disinherited（常被误拼为 disherited）指被拒绝继承、被剥夺继承权。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(adj.) Legally cut off from receiving an inheritance (money or property) from a parent or other relative.","zh":"（形容词）在法律上被取消继承权；被剥夺继承财产的资格。"},"examples":[{"en":"After the argument, he was disinherited and received nothing in the will.","zh":"争吵之后，他被取消继承权，在遗嘱里什么也没得到。"},{"en":"The disinherited son tried to rebuild his life on his own.","zh":"被剥夺继承权的儿子努力靠自己重新开始生活。"}]},{"partOfSpeech":"v.","definition":{"en":"(v.) Past tense/past participle of disinherit: to refuse to let someone (especially your child) inherit your money or property.","zh":"（动词）disinherit 的过去式/过去分词：剥夺（尤指子女）的继承权，不让其继承财产。"},"examples":[{"en":"She disinherited him because he had stolen from the family.","zh":"她因为他偷了家里的东西而剥夺了他的继承权。"},{"en":"He was disinherited for marrying against his parents’ wishes.","zh":"他因违背父母意愿结婚而被取消继承权。"}]}],"synonyms":["cut off","cut out (of the will)","dispossessed","written out (of the will)"],"phonetic":"/ˌdɪsɪnˈhɛrɪtɪd/","extraExplanation":["“disherited”在现代英语里更常见、也更标准的拼写是“disinherited”（来自动词 disinherit）。在学习和写作中建议使用 disinherited。","常见搭配：be disinherited；disinherit someone；be cut out of the will（被从遗嘱中除名，语气较口语）。"]}
{"word":"disheriting","summary":{"en":"“Disheriting” usually means disinheriting someone—formally cutting them out of your will so they won’t inherit your property.","zh":"“disheriting”通常指“disinheriting”：在遗嘱中把某人除名，使其不再继承财产。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Usually spelled “disinheriting”) Removing someone’s right to receive money or property from your will after you die.","zh":"（通常拼作“disinheriting”）在遗嘱中取消某人继承你财产/遗产的权利。"},"examples":[{"en":"She worried her father was disinheriting her after their argument.","zh":"她担心和父亲争吵后，父亲会把她从继承人里除名。"},{"en":"He threatened that he was disinheriting his son if he didn’t change his behavior.","zh":"他威胁说如果儿子不改行为，就要取消儿子的继承权。"},{"en":"The article explains how disinheriting a child can lead to legal disputes.","zh":"这篇文章解释了取消子女继承权可能引发法律纠纷。"}]}],"synonyms":["disinherit","cut out of the will","cut off"],"phonetic":"/ˌdɪsɪnˈherɪt/","extraExplanation":["“disheriting”更常见是拼写错误；标准形式是 disinherit（动词）/ disinheriting（现在分词/动名词）。","disinherit 通常出现在法律与家庭财产语境中：是否能“完全剥夺”继承权，取决于国家/地区法律。有些地方对配偶或未成年子女有“强制份额/最低保障”，不一定能在遗嘱中彻底排除。","语气与文化含义：在英语语境里，“disinherit someone”通常带有强烈的家庭冲突或价值观对立的暗示，写作中常用于戏剧化或严肃的家庭故事。"]}
{"word":"disheritment","summary":{"en":"Disinheritment means the legal act (or result) of cutting someone off from inheritance.","zh":"Disinheritment 指通过法律方式（或其结果）剥夺某人的继承权。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of legally preventing someone (usually a child or close relative) from receiving money, property, or a title after someone dies; the state of being disinherited","zh":"（通常指父母对孩子等近亲）通过法律方式剥夺其继承遗产或头衔的行为；被剥夺继承权的状态"},"examples":[{"en":"After years of conflict, the businessman announced his son’s disinheritment.","zh":"多年冲突之后，那位商人宣布剥夺儿子的继承权。"},{"en":"The lawyer explained that disinheritment usually needs clear wording in a will.","zh":"律师解释说，剥夺继承权通常需要在遗嘱中有明确表述。"}]}],"synonyms":["disinheritance","exclusion from inheritance","cutting off","disowning (informal, not always legal)"],"phonetic":"/ˌdɪsɪnˈherɪtmənt/","extraExplanation":["你输入的 **disheritment** 更常见的拼写是 **disinheritment**（或 **disinheritance**）。核心动词是 **disinherit**（剥夺继承权）。","这是一个偏法律语境的词：在英美文化中，是否能“完全剥夺继承权”会因地区法律而不同；但在日常英语里，它通常泛指“把某人从遗产继承人名单里排除”。"]}
{"word":"disheritor","summary":{"en":"A disheritor is someone who intentionally removes another person (often a child or heir) from inheriting money or property.","zh":"disheritor 指故意取消他人（常为子女或继承人）继承财产资格的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who disinherits someone (especially an heir), meaning they intentionally prevent that person from receiving an inheritance","zh":"剥夺他人继承权的人；取消继承人继承资格的人"},"examples":[{"en":"In the novel, the wealthy merchant became a disheritor after his son refused to follow the family business.","zh":"在小说里，那位富商因为儿子不愿接手家业而成了“剥夺继承权的人”。"},{"en":"The disheritor changed the will and left the estate to a charity instead.","zh":"剥夺继承权的人修改了遗嘱，改把遗产留给慈善机构。"}]}],"synonyms":["disinheritor","one who disinherits"],"phonetic":"/dɪsˈhɛrɪtər/","extraExplanation":["“disheritor”比较少见，更常用的是动词“disinherit”（剥夺……继承权）或名词“disinheritance”（被剥夺继承权/取消继承权）。","在英语文化与法律语境中，是否能“剥夺”继承权取决于具体国家/地区的继承法与遗嘱有效性（例如是否需要满足签署、见证、精神状态等要求）。学习时可把它理解为文学叙事或新闻报道里强调“做出剥夺决定的人”的用词。"]}
{"word":"disherits","summary":{"en":"Disinherit means to legally cut someone off from receiving an inheritance.","zh":"Disinherit 指用法律方式（多通过遗嘱）剥夺某人的继承权。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to officially prevent someone from receiving money, property, or an inheritance from you after you die","zh":"（通过遗嘱等）正式剥夺（某人）的继承权，使其在你去世后不能继承财产/遗产"},"examples":[{"en":"He decided to disinherit his son after years of conflict.","zh":"多年冲突之后，他决定剥夺儿子的继承权。"},{"en":"Some parents threaten to disinherit their children if they marry against the family’s wishes.","zh":"有些父母会威胁说，如果孩子违背家族意愿结婚，就要剥夺其继承权。"}]}],"synonyms":["cut (someone) out of the will","exclude from a will","cut off"],"phonetic":"/ˌdɪsɪnˈhɛrɪt/","extraExplanation":["你输入的“disherits”一般被认为是拼写错误，更常见的标准拼写是 **disinherit**（过去式/过去分词：disinherited）。","这是一个偏法律/家庭关系语境的词，常与 **will（遗嘱）**、**inheritance（遗产）**、**heir（继承人）** 等搭配。说话时注意语气：它往往带有强烈的情感冲突或家庭矛盾色彩。","常见近义表达：**cut (someone) out of the will**（把某人从遗嘱中除名）。"]}
{"word":"dishes","summary":{"en":"“Dishes” most commonly means (1) tableware like plates and bowls, or (2) prepared foods/individual dishes; it can also be a verb meaning to serve out food.","zh":"“dishes”最常见指（1）餐具（盘子、碗等），或（2）菜肴/一道道菜；也可作动词，表示盛出、分菜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plates, bowls, cups, and other items used for serving or eating food.","zh":"餐具（如盘子、碗、杯子等，用来盛放或食用食物的器皿）。"},"examples":[{"en":"Please put the clean dishes back in the cabinet.","zh":"请把干净的餐具放回橱柜里。"},{"en":"There are too many dishes in the sink.","zh":"水槽里有太多碗盘要洗。"}]},{"partOfSpeech":"n.","definition":{"en":"Food that is prepared in a particular way; a specific kind of food.","zh":"菜肴；一道菜（以特定方式烹饪的食物）。"},"examples":[{"en":"This restaurant serves spicy dishes.","zh":"这家餐厅提供辣味菜肴。"},{"en":"What’s your favorite dish?","zh":"你最喜欢的一道菜是什么？"}]},{"partOfSpeech":"v.","definition":{"en":"To serve out or distribute (food), often onto plates.","zh":"分菜；盛出（食物），通常盛到盘子里。"},"examples":[{"en":"She dished out soup for everyone.","zh":"她给每个人盛了一碗汤。"},{"en":"Can you dish the rice onto these plates?","zh":"你能把米饭盛到这些盘子里吗？"}]}],"synonyms":["tableware","plates","cookware","food","cuisine","serve"],"phonetic":"/ˈdɪʃɪz/","extraExplanation":["“dishes”是名词“dish”的复数。注意它有两个很常见的意思：1）“餐具”（do the dishes=洗碗、洗餐具）；2）“菜肴”（a dish=一道菜）。","动词用法常见搭配是“dish out”，表示“分发/盛出（食物）”。日常口语里“dish”还可引申为“八卦/内幕消息”（dish the gossip），但学习者可先掌握餐具和菜肴这两个核心含义。"]}
{"word":"dishevel","summary":{"en":"Dishevel means to make or become messy and untidy, especially hair or appearance.","zh":"dishevel 指使（或变得）凌乱不整，尤指头发或外表。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Of hair, clothing, or a person’s appearance) to make or become messy and untidy.","zh":"（指头发、衣服或外表）使凌乱；变得蓬乱。"},"examples":[{"en":"Her hair was disheveled by the wind.","zh":"她的头发被风吹得乱蓬蓬的。"},{"en":"He looked disheveled after working all night.","zh":"他熬了一整夜后看起来很邋遢、很凌乱。"},{"en":"She quickly tried to dishevel her neat bun to look more casual.","zh":"她赶紧把原本整齐的发髻弄乱，让自己看起来更随意。"}]}],"synonyms":["mess up","tousle","ruffle","unkempt (adj.)","rumple"],"phonetic":"/dɪˈʃɛvəl/","extraExplanation":["“dishevel”常用来描写外表“凌乱、蓬乱”的状态，语气比一般的“messy”更带有“头发散乱、衣着不整”的画面感。","词源上与法语有关，含有“把头发弄乱”的意思，因此最典型的搭配是 hair / clothes / appearance。","常见搭配：disheveled hair（蓬乱的头发）、look disheveled（看起来很狼狈/不修边幅）。"]}
{"word":"disheveled","summary":{"en":"Disheveled means looking messy and untidy, especially in hair or clothing.","zh":"disheveled 指（尤指头发或衣着）凌乱、不整洁的样子。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Messy and untidy, especially with hair or clothing looking not cared for.","zh":"（尤指头发或衣着）凌乱的、不整洁的，看起来没怎么打理。"},"examples":[{"en":"He arrived with disheveled hair and a wrinkled shirt.","zh":"他到的时候头发凌乱，衬衫也皱巴巴的。"},{"en":"After the long flight, I felt disheveled and exhausted.","zh":"长途飞行后，我觉得自己衣冠不整、筋疲力尽。"},{"en":"The child ran in, disheveled from playing outside.","zh":"孩子跑进来，因在外面玩得满身凌乱。"}]}],"synonyms":["messy","untidy","rumpled","unkempt","scruffy"],"phonetic":"/dɪˈʃɛvəld/","extraExplanation":["disheveled 常带有“刚经历了忙乱、奔波、睡醒或压力”的画面感，不只是“脏”，更多是“乱而不整”。","它常用于描写人物外表来暗示状态或情绪：紧张、疲惫、狼狈，甚至经历了某种变故（在小说和报道里很常见）。","词源上与法语有关，原意接近“把头发弄乱”，因此最自然的搭配是 disheveled hair / disheveled appearance。"]}
{"word":"disheveling","summary":{"en":"Disheveling means making (or being) messy and untidy, especially hair or clothing.","zh":"disheveling 指（使）变得凌乱不整，尤指头发或衣着。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"making someone’s hair, clothes, or appearance look messy and untidy","zh":"（使）头发、衣服或外表变得凌乱不整"},"examples":[{"en":"The wind was disheveling her hair as she walked home.","zh":"她走回家时，风把她的头发吹得凌乱。"},{"en":"He arrived late, disheveling his suit while rushing through the door.","zh":"他迟到了，冲进门时把西装弄得皱巴巴、乱糟糟的。"}]},{"partOfSpeech":"adj.","definition":{"en":"looking messy or untidy (especially hair or clothing)","zh":"凌乱的；不整洁的（尤指头发或衣着）"},"examples":[{"en":"She gave a disheveling laugh and tried to fix her hair.","zh":"她有些狼狈地笑了笑，试着把头发整理好。"},{"en":"He stepped out, disheveling and tired after the long flight.","zh":"长途飞行后他走出来时显得衣冠不整、很疲惫。"}]}],"synonyms":["messing up","rumpling","tousling","disordering","unkempt"],"phonetic":"/dɪˈʃɛvəlɪŋ/","extraExplanation":["词源上与法语有关，原意接近“把头发弄散/弄乱”。在英文里常用来描写“头发凌乱”“衣服皱乱”，带有一种“匆忙、疲惫、狼狈”的画面感。","常见搭配：disheveling hair（把头发弄乱）、disheveling clothes（把衣服弄乱）、look disheveled（看起来很凌乱）。"]}
{"word":"dishevelled","summary":{"en":"Dishevelled means messy and untidy, especially hair or clothes; it can also describe a confused or unsettled state.","zh":"dishevelled 指凌乱不整洁（尤指头发或衣着）；也可指思绪或情绪紊乱、不安定。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having hair or clothing that is messy and untidy, as if not combed or arranged.","zh":"（头发或衣着）凌乱的，不整洁的（像是没梳理或没整理过）。"},"examples":[{"en":"He arrived with dishevelled hair and a wrinkled shirt.","zh":"他到达时头发凌乱，衬衫也皱巴巴的。"},{"en":"After the long flight, everyone looked a bit dishevelled.","zh":"长途飞行后，大家看起来都有点邋遢凌乱。"},{"en":"She brushed her dishevelled bangs out of her eyes.","zh":"她把凌乱的刘海拨开，不让它挡住眼睛。"}]},{"partOfSpeech":"adj.","definition":{"en":"Mentally or emotionally unsettled; not well-organized or calm (less common, often used in writing).","zh":"（精神或情绪）不安定的，紊乱的（较不常见，多用于书面语）。"},"examples":[{"en":"He sounded dishevelled after the sudden bad news.","zh":"听到突如其来的坏消息后，他说话时显得有些慌乱。"},{"en":"Her thoughts were dishevelled, jumping from one worry to another.","zh":"她思绪纷乱，从一个担忧跳到另一个担忧。"}]}],"synonyms":["messy","untidy","unkempt","rumpled","tousled"],"phonetic":"/dɪˈʃɛvəld/","extraExplanation":["英式拼写多为 dishevelled；美式更常见 disheveled。两者意思相同。","这个词常用来描写“经历了某种折腾之后的凌乱感”，比如匆忙、旅行、争吵、刚醒来等，语气一般偏中性到略带负面。","词源上与“把头发弄乱、散开”有关，所以最常见的搭配是 dishevelled hair（头发凌乱）。"]}
{"word":"dishevelling","summary":{"en":"“Dishevelling” means looking untidy or making something look messy, especially hair or clothes.","zh":"“dishevelling”指（尤指头发或衣物）凌乱的，或指把……弄乱。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of hair, clothing, or appearance) messy and not neatly arranged; untidy.","zh":"（头发、衣着或外表）凌乱的；不整洁的。"},"examples":[{"en":"She arrived with dishevelling hair after the windy walk.","zh":"走了一段大风路后，她到达时头发乱蓬蓬的。"},{"en":"His dishevelling clothes made him look as if he had slept in the car.","zh":"他凌乱的衣服让他看起来像是在车里睡了一晚。"}]},{"partOfSpeech":"v.","definition":{"en":"the act/process of making something look messy; present participle of “dishevel.”","zh":"把……弄乱的动作/过程；“dishevel”的现在分词形式。"},"examples":[{"en":"Running through the rain was dishevelling her carefully styled hair.","zh":"在雨里奔跑把她精心打理的头发弄乱了。"},{"en":"He apologized for dishevelling the papers on her desk.","zh":"他为把她桌上的文件弄乱而道歉。"}]}],"synonyms":["messy","unkempt","tousled","rumpled","disordered"],"phonetic":"/dɪˈʃɛvəlɪŋ/","extraExplanation":["“dishevelling”更常见于英式拼写；美式通常写作“disheveling”。意思相同。","词源来自法语（与“头发蓬乱/散开”相关），因此常用来描写一种“刚经历了风雨、奔跑或劳累后”的凌乱状态，带有画面感。"]}
{"word":"dishevelment","summary":{"en":"Dishevelment means a messy, untidy state of hair, clothing, or appearance.","zh":"dishevelment 指头发、衣着或外表处于凌乱不整洁的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A state of having hair, clothes, or an appearance that is messy and untidy (as if not cared for or not arranged).","zh":"（头发、衣服或外表的）凌乱、不整洁的状态（像是没有打理或整理过）。"},"examples":[{"en":"She apologized for the dishevelment of her hair after the windy walk.","zh":"她为风中走了一段路后头发的凌乱向大家道歉。"},{"en":"His dishevelment made him look more tired than he really was.","zh":"他的衣着与外表的凌乱让他看起来比实际更疲惫。"}]}],"synonyms":["messiness","untidiness","unkemptness","disorder"],"phonetic":"/dɪˈʃɛvəlmənt/","extraExplanation":["“dishevelment”是较正式、偏书面用法的名词，日常口语里更常直接说“messy hair / messy clothes”或用形容词“disheveled”。","词根上来自“dishevel”（使……蓬乱、弄乱），常用来描写人物经历匆忙、风雨、熬夜或情绪低落后的外观，也常出现在小说描写中，用来营造“狼狈、疲惫、失序”的氛围。"]}
{"word":"dishevelments","summary":{"en":"“Dishevelments” means untidiness or messy signs in someone’s appearance, especially hair or clothes.","zh":"“dishevelments”指外表（尤指头发或衣服）的凌乱、蓬乱状态或凌乱之处。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a state of being untidy or messy in appearance (especially hair or clothing); signs of being disheveled","zh":"（尤指头发或衣着）凌乱、蓬乱的状态；蓬头垢面的样子"},"examples":[{"en":"After the long flight, she tried to smooth her hair, but the dishevelments were obvious.","zh":"长途飞行后，她想把头发理顺，但那种蓬乱还是很明显。"},{"en":"The novel describes him arriving at the door in rain-soaked dishevelments.","zh":"小说描写他浑身湿透、衣着凌乱地来到门口。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) messy details or parts of someone’s appearance; untidy elements","zh":"（复数）外表上各种凌乱之处；不整齐的细节"},"examples":[{"en":"She fixed the dishevelments of his collar and tie before the interview.","zh":"面试前，她整理了他衣领和领带的凌乱之处。"},{"en":"A mirror helps you notice small dishevelments you might miss.","zh":"镜子能帮助你注意到一些你可能忽略的小凌乱。"}]}],"synonyms":["messiness","unkemptness","disorder","tousle","shabbiness"],"phonetic":"/dɪˈʃɛvəlmənts/","extraExplanation":["“dishevelment(s)”来自动词“dishevel”（使……蓬乱），而“dishevel”源自法语词根，和“头发散开、衣服不整”的形象有关。这个词在叙事文学里常用来渲染人物的疲惫、慌乱或经历波折后的状态。"]}
{"word":"dishevels","summary":{"en":"“Dishevels” means “makes messy,” especially hair or appearance; it can also mean “disturbs” something in a figurative sense.","zh":"“dishevels”表示“使凌乱”，常指头发或外表；也可比喻“扰乱、打乱（计划/秩序）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make someone’s hair, clothes, or appearance look messy and untidy","zh":"使（头发、衣服或外表）凌乱；弄乱"},"examples":[{"en":"The wind dishevels her hair as she walks outside.","zh":"她走到外面时，风把她的头发吹乱了。"},{"en":"After the long flight, he looks tired and dishevelled.","zh":"长途飞行后，他看起来很疲惫、衣着也有些凌乱。"},{"en":"Don’t dishevel the papers—I’ve already sorted them.","zh":"别把这些文件弄乱——我已经整理好了。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative) to upset or disturb a calm state, plan, or order","zh":"（比喻）扰乱；打乱（平静、计划或秩序）"},"examples":[{"en":"The sudden news dishevels their careful plan.","zh":"这条突如其来的消息打乱了他们精心的计划。"},{"en":"A single mistake can dishevel the rhythm of a speech.","zh":"一个小失误就可能扰乱演讲的节奏。"}]}],"synonyms":["mess up","tousle","ruffle","muss","disorder","scramble"],"phonetic":"/dɪˈʃɛvəl/","extraExplanation":["“dishevels”是动词“dishevel”的第三人称单数形式（he/she/it dishevels）。过去式/过去分词常见为 dishevelled（英式拼写）或 disheveled（美式拼写）。","词源来自法语，原意与“弄乱头发”有关；因此在文学描写中常用来表现人物经历风雨、奔波或情绪动荡后的“狼狈/凌乱”形象。"]}
{"word":"dishevely","summary":{"en":"Dishevely means “in a messy or untidy way,” usually describing someone’s appearance.","zh":"dishevely 表示“凌乱地、不整洁地”，多用来形容外表状态。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a messy, untidy, or unkempt way (especially about hair, clothes, or appearance).","zh":"凌乱地；不整洁地（尤指头发、衣着或外表）。"},"examples":[{"en":"He walked in dishevely, with his shirt half untucked.","zh":"他衣衫半塞半露、凌乱地走了进来。"},{"en":"She laughed dishevely after running in the rain.","zh":"她在雨中跑过后，头发凌乱地笑了起来。"},{"en":"The children were dressed dishevely after the long trip.","zh":"长途旅行后，孩子们穿得很凌乱。"}]}],"synonyms":["messily","untidily","unkemptly","sloppily"],"phonetic":"/dɪˈʃɛvəli/","extraExplanation":["“dishevely”来自形容词“disheveled”（凌乱的），常用于描写人的外观：头发蓬乱、衣服皱巴巴，带有“刚睡醒/经历匆忙或混乱”的画面感。","词源上与法语词根有关，原意与“头发散乱”相关，因此它最自然的搭配也是hair/appearance/clothes 等。","日常写作中更常用“disheveled”（adj.）而不是“dishevely”（adv.）；比如更常说“disheveled hair/appearance”。"]}
{"word":"dishexecontahedroid","summary":{"en":"“dishexecontahedroid” is not a standard English word; it likely needs clarification or correction.","zh":"“dishexecontahedroid”不是标准英文单词；可能需要你补充上下文或更正拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"This does not appear to be a recognized English word or common phrase. It may be a misspelling, a random string, or a specialized term (e.g., a username, code, or coined word).","zh":"这看起来不是一个常见或可识别的英文单词/短语。它可能是拼写错误、随机字符串，或某个领域/个人自造的词（例如用户名、代码等）。"},"examples":[{"en":"I couldn’t find “dishexecontahedroid” in a dictionary—could you share the sentence where you saw it?","zh":"我在词典里找不到“dishexecontahedroid”——你能把它出现的句子发我吗？"},{"en":"If you meant a different word, try typing it again with spaces, like “dish …” or “hex …”.","zh":"如果你想查的是别的词，可以再输入一次，或加空格分开，比如“dish …”或“hex …”。"}]}],"phonetic":"N/A","extraExplanation":["你可以这样帮我确认你想查的词：\n1) 把它出现的完整句子/上下文贴出来；\n2) 说明来源（网页、游戏、论文、聊天、代码等）；\n3) 如果你是想输入多个词，请用空格分开；\n4) 告诉我你猜它可能包含哪些部分（例如 dish / hex / droid / account 等）。\n我也可以根据你想表达的中文意思，帮你找最接近的英文单词。"]}
{"word":"dishful","summary":{"en":"Dishful means the amount of food that fills a dish.","zh":"dishful 指“装满一盘/一碟的量”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A quantity of food that fills one dish; a dishful.","zh":"一盘（或一碟）的量；满满一盘（或一碟）的食物。"},"examples":[{"en":"Add one dishful of rice to the pot.","zh":"往锅里加一盘米饭的量。"},{"en":"He served each guest a dishful of noodles.","zh":"他给每位客人盛了一盘面条。"}]}],"synonyms":["plateful","serving","portion"],"phonetic":"/ˈdɪʃˌfʊl/","extraExplanation":["“dishful”是由“dish + -ful”构成的复合词，-ful 表示“……的量/装满……的容量”（如 spoonful“一勺的量”、cupful“一杯的量”）。它通常用于比较口语或描述性语境。","在现代英语中，“a dishful of ……”不算最常见的量词搭配；更常见的说法有“a plate of ……”（一盘……）、“a bowl of ……”（一碗……）、“a serving of ……”（一份……）。"]}
{"word":"dishfuls","summary":{"en":"Dishfuls means “several dish-sized amounts,” the plural of dishful.","zh":"dishfuls 指“几盘的量”，是 dishful（“一盘的量”）的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of dishful: an amount of food (or other substance) that one dish can hold; a dish-sized serving.","zh":"dishful 的复数：一盘（或一碟）所能盛下的量；按“一盘”计的份量。"},"examples":[{"en":"She brought out two dishfuls of rice for the family.","zh":"她端出了两盘饭给家人吃。"},{"en":"Add a few dishfuls of water to the pot and let it simmer.","zh":"往锅里加几盘水的量，然后小火慢炖。"},{"en":"We served dishfuls of salad at the picnic.","zh":"野餐时我们一盘盘地盛沙拉给大家。"}]}],"synonyms":["platefuls","servings","portions"],"phonetic":"/ˈdɪʃˌfʊlz/","extraExplanation":["“dishful”是由 dish（盘子）+ -ful（表示“装满……的量”）构成，和 spoonful（满一勺）、cupful（满一杯）类似。","“dishfuls”多用于口语或较生活化的写作，强调“大概一盘的量”，并不是非常精确的计量单位。"]}
{"word":"dishier","summary":{"en":"Dishier means “more attractive/good-looking,” an informal term especially common in British English.","zh":"Dishier 是 dishy 的比较级，表示“更好看、更有魅力”，多见于英式非正式表达。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"more physically attractive or good-looking (informal, especially British English).","zh":"更英俊／更漂亮、更有魅力（非正式用法，尤见于英式英语）。"},"examples":[{"en":"That actor looks even dishier in the new movie.","zh":"那个演员在新电影里看起来更帅了。"},{"en":"With that haircut, you’re definitely dishier than before.","zh":"换了那个发型，你明显比以前更好看了。"}]}],"synonyms":["more attractive","better-looking","handsomer","prettier"],"phonetic":"/ˈdɪʃiər/","extraExplanation":["“dishier”是形容词“dishy”的比较级，常见于英式口语里，意思接近“handsome / good-looking / attractive”。它带有轻松、带点调侃的语气，多用于评价人的外表或魅力。","用法上通常是“(even) dishier than … / look dishier”。在正式写作里更常用“more attractive / better-looking”。"]}
{"word":"dishiest","summary":{"en":"“Dishiest” means the most attractive or the most juicy/interesting (informal).","zh":"“dishiest”表示“最迷人/最好看”或“最劲爆、最有料”（非正式）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) The most physically attractive; the best-looking.","zh":"（非正式）最英俊/最漂亮的；最好看的。"},"examples":[{"en":"Everyone at the party agreed that Jordan was the dishiest person there.","zh":"派对上大家都同意乔丹是现场最好看的人。"},{"en":"That actor was voted the dishiest man of the year.","zh":"那位演员被评为年度最帅男星。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) The most interesting or juicy (often about news, gossip, or details).","zh":"（非正式）最劲爆的、最有料的（常指新闻、八卦或细节）。"},"examples":[{"en":"Tell me the dishiest part of the story—what happened after they left?","zh":"跟我说说这件事最有料的部分——他们走了之后发生了什么？"},{"en":"She saved the dishiest details for the end.","zh":"她把最劲爆的细节留到了最后。"}]}],"synonyms":["most attractive","best-looking","hottest","most handsome","most beautiful","juiciest","most interesting","spiciest"],"phonetic":"/ˈdɪʃiəst/","extraExplanation":["“dishiest”是形容词“dishy”的最高级（dishy → dishier → dishiest）。在英式英语里很常见，尤其表示“长得很迷人/很帅”。","“dishy”也可指“八卦很有料、很劲爆”，常和gossip/rumor/details等搭配。语气偏口语，不适合非常正式的写作。","注意别和“dish”（盘子/菜肴）或“delicious”（美味的）混淆；“dishy”在这里主要是“迷人/有料”的意思。"]}
{"word":"dishing","summary":{"en":"“Dishing” usually means serving food onto plates/bowls; informally, it can also mean gossiping or dishing out criticism/advice.","zh":"“dishing”通常指把食物盛到盘子/碗里；在口语中也可指八卦或“指点/批评（dish out）”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"serving food, especially by putting it onto plates or bowls","zh":"盛饭；把食物分到盘子/碗里（尤指上桌前分装）"},"examples":[{"en":"She’s dishing the soup into bowls for everyone.","zh":"她正把汤盛到碗里给大家。"},{"en":"We finished cooking, and now we’re dishing dinner onto plates.","zh":"我们做完饭了，现在开始把晚餐分到盘子里。"}]},{"partOfSpeech":"v.","definition":{"en":"(informal) talking about someone in a critical or gossiping way; revealing details (often used with “dish” or “dish it out”)","zh":"（非正式）八卦/说人坏话；爆料（常与 dish / dish it out 搭配）"},"examples":[{"en":"They were dishing about their coworkers during lunch.","zh":"他们午饭时在八卦同事。"},{"en":"He loves dishing out advice, even when nobody asked.","zh":"他很爱给建议（指手画脚），即使没人问。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of serving food","zh":"盛饭；分菜（这一行为）"},"examples":[{"en":"Dishing can be messy if the sauce is too thin.","zh":"如果酱汁太稀，盛起来会很容易弄得到处都是。"}]}],"synonyms":["serving","plating","portioning","gossiping","bad-mouthing"],"phonetic":"/ˈdɪʃɪŋ/","extraExplanation":["“dishing”最常见是动词 dish 的现在分词：在描述正在进行的动作时用（She is dishing…）。","在口语里，dish 也可指“八卦/爆料”，常见搭配有：dish about（八卦某人/某事）、dish it out（对别人很刻薄或总爱指点/批评）。","和食物相关的固定搭配：dish up（把食物盛出来、端上来，偏英式但美式也能理解）；dish out（分发食物/施加惩罚/大量给出）。"]}
{"word":"Dishley","summary":{"en":"Dishley is chiefly a proper noun: a place name in Leicestershire, England, and sometimes a surname from that place.","zh":"Dishley 主要是专有名词：英国英格兰莱斯特郡的一个地名，也可作源自该地的姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name in England (a small area/settlement near Loughborough, Leicestershire).","zh":"英国的地名（英格兰莱斯特郡拉夫堡附近的一个小区域/聚落）。"},"examples":[{"en":"Dishley is a small area near Loughborough in Leicestershire.","zh":"Dishley 是莱斯特郡拉夫堡附近的一个小区域。"},{"en":"We passed through Dishley on our way to Loughborough.","zh":"我们去拉夫堡的路上经过了 Dishley。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname), originally linked to the place name.","zh":"姓氏（源自地名的姓）。"},"examples":[{"en":"Her last name is Dishley.","zh":"她的姓是 Dishley。"}]}],"synonyms":["(place) Loughborough area","(surname) —"],"phonetic":"/ˈdɪʃli/","extraExplanation":["Dishley 主要作为专有名词使用，因此一般不写复数，也不用于普通“单词”那样的引申含义。","在英国，很多姓氏来自地名（表示“来自某地的人”），所以 Dishley 既可能指地点，也可能作为姓出现。"]}
{"word":"dishley","summary":{"en":"Dishley is usually a British place name (and sometimes a surname).","zh":"Dishley通常是英国地名（有时也作姓氏）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a place name in England (a small area near Loughborough, Leicestershire); also used as a family name (surname).","zh":"英国的地名（位于英格兰莱斯特郡拉夫堡附近的一小片区域）；也可作姓氏。"},"examples":[{"en":"He grew up near Dishley, just outside Loughborough.","zh":"他在拉夫堡郊外、靠近Dishley的地方长大。"},{"en":"The records list a John Dishley in the 1800s.","zh":"档案中记载19世纪有一位名叫John Dishley的人。"}]}],"synonyms":["(as a place name) Loughborough area","(as a surname) family name"],"phonetic":"/ˈdɪʃli/","extraExplanation":["“Dishley”更常见于英国地理与历史语境，例如“Dishley Grange”（迪什利庄园/农庄）常与18世纪农业改良者Robert Bakewell相关，他在当地推广了选择性育种（改良牲畜品种）。因此在历史、农业或家谱资料里可能会看到这个词。","如果你是在菜谱或餐饮语境里看到“dishley”，很可能是拼写错误（常见误写：dishly / dishes / dishy）。你可以把原句发我，我可以帮你判断具体意思。"]}
{"word":"dishlike","summary":{"en":"“Dishlike” means shaped like a dish—shallow and concave.","zh":"“Dishlike”表示“盘状的、碟形的”，通常浅而向内凹。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a dish in shape; usually shallow and concave (curving inward), like a bowl or plate.","zh":"像盘子一样的形状；通常指浅而凹的（向内弯曲），像碗或盘。"},"examples":[{"en":"The radar uses a dishlike antenna to focus signals.","zh":"这部雷达使用盘状天线来聚焦信号。"},{"en":"A dishlike depression formed in the ground after the heavy rain.","zh":"暴雨后地面出现了一个盘状的凹陷。"},{"en":"The sculpture has a dishlike center that collects water.","zh":"这件雕塑的中心是盘状的，可以积水。"}]}],"synonyms":["dish-shaped","concave","bowl-shaped","cupped"],"phonetic":"/ˈdɪʃˌlaɪk/","extraExplanation":["“dishlike”是由“dish（盘子）+ -like（像……一样）”构成的形容词，常用于描述“形状/轮廓”，尤其在科技与自然描写里常见，如“satellite dish（卫星天线）”那种向内弯曲的碟形。"]}
{"word":"dishling","summary":{"en":"Dishling is a rare word meaning a small dish.","zh":"Dishling 是一个少见的词，意思是“小碟子/小盘”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small dish; a little plate or bowl (rare/old-fashioned).","zh":"小碟子；小盘（较少见/偏旧式用法）。"},"examples":[{"en":"She placed the olives in a small dishling on the table.","zh":"她把橄榄放在桌上的一个小碟子里。"},{"en":"The cookbook suggests serving sauces in separate dishlings.","zh":"那本食谱建议把酱汁分别装在小碟子里。"}]}],"synonyms":["small dish","saucer","little bowl","small plate"],"phonetic":"/ˈdɪʃlɪŋ/","extraExplanation":["“dishling”里的后缀 -ling 常用于表示“较小的/小型的”（类似 duckling 小鸭、sapling 小树苗），所以 dishling 字面上就是“较小的 dish（盘/碟）”。","这个词在现代英语中非常少见；日常更常用 small dish, saucer, little bowl 等表达。"]}
{"word":"dishmaker","summary":{"en":"Dishmaker means a maker of dishware; less commonly, someone who makes/installs satellite dishes.","zh":"dishmaker 指餐具制造者/厂家；较少见时也可指制作或安装卫星天线的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or company that makes dishes (plates, bowls, or other dishware), usually in a factory or workshop setting","zh":"制作餐具（盘子、碗等）的个人或公司，通常指在工厂或作坊里生产的人/厂家"},"examples":[{"en":"The dishmaker supplies plates and bowls to local restaurants.","zh":"这家餐具制造商为本地餐馆提供盘子和碗。"},{"en":"She works as a dishmaker, shaping clay and glazing it before firing.","zh":"她做餐具制作工作：把陶土塑形、上釉，然后入窑烧制。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a person who makes or installs satellite dishes","zh":"（较少见）制作或安装卫星天线“锅”的人"},"examples":[{"en":"A local dishmaker came to install the satellite dish on the roof.","zh":"一位本地的卫星天线安装师来屋顶装“锅”。"}]}],"synonyms":["dishware maker","tableware manufacturer","potter","ceramist","satellite dish installer"],"phonetic":"/ˈdɪʃˌmeɪkər/","extraExplanation":["“dishmaker”不是特别常见的单词，更常见的表达有：\n- 制作餐具：potter（陶工）、ceramist（陶艺家）、tableware manufacturer（餐具制造商）、dishware maker（餐具制作者）\n- 卫星天线：satellite dish installer（卫星天线安装工）\n在不同语境里，“dish”可能指“餐具”，也可能指“卫星天线（像盘子一样的天线）”。"]}
{"word":"dishmaking","summary":{"en":"Dishmaking means the process of making a dish—usually cooking a prepared food, and less commonly making dishware like plates or bowls.","zh":"Dishmaking 指“制作一道菜”的过程（多用于烹饪），较少情况下也可指制作盘子、碗等餐具。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of making a dish (a prepared food), especially as part of cooking or recipe creation","zh":"做菜；制作一道菜的过程（多指烹饪或研发菜谱）"},"examples":[{"en":"Dishmaking takes practice, so start with simple recipes.","zh":"做菜需要练习，所以先从简单食谱开始。"},{"en":"Her dishmaking focuses on fresh vegetables and light sauces.","zh":"她的做菜风格以新鲜蔬菜和清淡酱汁为主。"},{"en":"We learned basic dishmaking skills in our beginner cooking class.","zh":"我们在初级烹饪课上学习了基础做菜技能。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of making dishes as objects (plates, bowls), especially in pottery or manufacturing (less common)","zh":"制作餐具（盘子、碗等）的过程（较少见，多用于陶艺或生产语境）"},"examples":[{"en":"The museum showed traditional dishmaking techniques in clay.","zh":"博物馆展示了传统的陶土制盘技法。"},{"en":"Industrial dishmaking uses molds to produce identical plates quickly.","zh":"工业化制盘会用模具来快速生产相同的盘子。"}]}],"synonyms":["cooking","food preparation","preparing a dish","recipe development","ceramics (dishware context)","pottery (dishware context)"],"phonetic":"/ˈdɪʃˌmeɪkɪŋ/","extraExplanation":["“dishmaking”是由“dish + making”组合而成的复合名词，但在现代英语中并不算常见。烹饪语境里更常用“cooking”“preparing a dish”“recipe development”；做陶艺/餐具语境更常用“pottery”“ceramics”“dish production”。因此你在写作时可以根据场景选择更自然的表达。"]}
{"word":"dishmonger","summary":{"en":"“Dishmonger” is a rare noun meaning either a seller of dishes/kitchenware or (more commonly in tone) someone who spreads gossip or scandal.","zh":"dishmonger 是较少见的名词：可指卖餐具的人，也可指散布八卦或丑闻的人（语气多带贬义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who sells dishes or household kitchenware (old-fashioned or rare).","zh":"卖碗碟、餐具或厨房用品的人（较旧式或少见用法）。"},"examples":[{"en":"In the old market, a dishmonger sold plates, bowls, and cups.","zh":"在旧集市里，有个卖餐盘、碗和杯子的餐具商贩。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who spreads gossip or scandal (using “dish” as slang for gossip).","zh":"散布八卦或丑闻的人（此处 dish 为“八卦/爆料”的俚语）。"},"examples":[{"en":"Ignore him—he’s a dishmonger who loves stirring up rumors.","zh":"别理他——他就是个爱搅动谣言的八卦散布者。"},{"en":"The columnist was criticized as a dishmonger rather than a serious reporter.","zh":"那位专栏作家被批评为“卖八卦的人”，而不是严肃的记者。"}]}],"synonyms":["gossip","rumor-monger","scandalmonger","fishmonger (related pattern)"],"phonetic":"/ˈdɪʃˌmʌŋɡər/","extraExplanation":["monger 表示“贩卖……的人”，常见于 fishmonger（鱼贩）、warmonger（战争贩子）。在 dishmonger 里，dish 可以指“餐具”，也可以指俚语里的“八卦/爆料”（to dish / dish the dirt）。因此第二个意思更偏贬义。","这个词在现代英语里不常见；如果你想表达“散布八卦的人”，更常用 gossip 或 rumor-monger。"]}
{"word":"dishmop","summary":{"en":"A dishmop is a tool used to wash dishes and clean sinks, usually a cloth or stringy mop head (sometimes with a handle).","zh":"dishmop 指洗碗和清洁水槽用的工具，通常是布条/棉线状的拖头（有时带手柄）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mop or bundle of absorbent material used for washing dishes or cleaning a sink (often a cloth or stringy mop head on a handle)","zh":"洗碗刷／洗碗拖把；用来洗碗或清洁水槽的吸水清洁工具（常为布条或棉线状的拖头，有时带把手）"},"examples":[{"en":"He grabbed the dishmop and scrubbed the greasy pan.","zh":"他拿起洗碗刷，用力刷那只油腻的锅。"},{"en":"Rinse the dishmop well and let it dry after you use it.","zh":"用完后把洗碗刷冲干净，并晾干。"}]}],"synonyms":["dishcloth","sponge","scrubber","scouring pad"],"phonetic":"/ˈdɪʃˌmɑp/","extraExplanation":["在美式英语里，dishmop 多指“带柄的洗碗拖把/刷子”（常见于清洁水槽、锅具），也可能泛指用来洗碗的一团布条或海绵状清洁物。不同地区更常用的说法还有 dishcloth（洗碗布）、sponge（海绵）、scrubber（百洁布/刷洗垫）。"]}
{"word":"dishome","summary":{"en":"“Dishome” is a rare/archaic verb meaning to force someone from their home or to lose one’s home.","zh":"“dishome”是一个罕见/古旧动词，意思是把人赶出家园或失去家园。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(rare/archaic) To drive someone away from their home; to make someone homeless or dispossess them.","zh":"（罕见/古旧）把某人赶出家园；使某人失去住所（使无家可归/被剥夺家园）。"},"examples":[{"en":"The war dishomed thousands of families.","zh":"战争使成千上万的家庭失去家园。"},{"en":"Many residents were dishomed by the flood.","zh":"许多居民因洪水而流离失所。"}]},{"partOfSpeech":"vi.","definition":{"en":"(rare/archaic) To lose one’s home; to be forced to leave home.","zh":"（罕见/古旧）失去家园；被迫离开家。"},"examples":[{"en":"After the fire, they dishomed and moved in with relatives.","zh":"火灾之后，他们失去住所，只好搬去和亲戚同住。"}]}],"synonyms":["displace","evict","uproot","make homeless","dispossess"],"phonetic":"/dɪsˈhoʊm/","extraExplanation":["“dishome”在现代英语中非常少见，更常见的表达是“displace”（使流离失所）、“evict”（驱逐）、“make (someone) homeless”（使无家可归）。","词形上由前缀“dis-”（表示“去除、使失去”）+ “home”（家）构成，因此字面意思就是“让（人）失去家”。","如果你是在聊天或作业里看到“dishome”，也有可能是拼写或分词问题（例如“dis-home”）。可以把原句发我，我能帮你判断更准确的意思。"]}
{"word":"dishonest","summary":{"en":"Dishonest means not truthful or fair, often involving lying, cheating, or deception.","zh":"dishonest 指不诚实、不讲真话或不公平，常涉及撒谎、作弊或欺骗。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not telling the truth; likely to lie, cheat, or deceive.","zh":"不诚实的；不讲真话的；可能撒谎、作弊或欺骗的。"},"examples":[{"en":"It’s dishonest to copy someone else’s homework and pretend it’s yours.","zh":"抄别人的作业却假装是自己的，这是不诚实的。"},{"en":"He was dishonest about how he broke the phone.","zh":"他对手机是怎么坏的这件事撒了谎（不诚实）。"},{"en":"The ad felt dishonest because it hid important information.","zh":"这则广告让人觉得不诚实，因为它隐瞒了重要信息。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not fair or trustworthy in business or behavior; involving cheating or fraud.","zh":"（做事或做生意）不公平、不可靠的；涉及作弊或欺诈的。"},"examples":[{"en":"The company was accused of dishonest practices.","zh":"这家公司被指控有不诚实（欺诈）的做法。"},{"en":"Dishonest dealings can ruin a person’s reputation.","zh":"不诚实的交易会毁掉一个人的名声。"}]}],"synonyms":["untruthful","deceitful","lying","fraudulent","misleading"],"phonetic":"/dɪsˈɑnɪst/","extraExplanation":["“dishonest” = dis-（否定）+ honest（诚实的）。常见搭配：dishonest about（对……不诚实）、dishonest with（对……不坦诚）、dishonest behavior/practices（不诚实的行为/做法）。","语气上，“dishonest”比“not honest”更正式、更带批评意味；如果想更委婉，可以说“not completely honest”（不完全坦诚）或“misleading”（有误导性）。"]}
{"word":"dishoneste","summary":{"en":"Dishonest means not honest—someone who lies, cheats, steals, or uses unfair methods.","zh":"Dishonest 指“不诚实的”，形容撒谎、欺骗、偷窃或使用不公平手段的人或做法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not honest; likely to lie, cheat, or steal","zh":"不诚实的；可能会撒谎、欺骗或偷窃的"},"examples":[{"en":"It was dishonest to copy someone else’s homework.","zh":"抄别人的作业是不诚实的。"},{"en":"A dishonest seller might hide problems with the product.","zh":"不诚实的卖家可能会隐瞒产品的问题。"},{"en":"She felt guilty because she had been dishonest about her age.","zh":"她因为在年龄上说了谎而感到内疚。"}]},{"partOfSpeech":"adj.","definition":{"en":"not fair or truthful (about actions, methods, or information)","zh":"不公平或不真实的（指做法、手段或信息）"},"examples":[{"en":"Using fake reviews is a dishonest marketing tactic.","zh":"使用虚假评价是一种不诚实的营销手段。"},{"en":"The report gave a dishonest picture of what really happened.","zh":"这份报告对真实发生的事情给出了不真实的描述。"}]}],"synonyms":["untruthful","deceitful","lying","fraudulent","unscrupulous"],"phonetic":"/dɪsˈɑnɪst/","extraExplanation":["你输入的“dishoneste”不是常见英文拼写；英文通常写作 **dishonest**。","构词提示：**dis-** 表示“否定/相反”，**honest** 表示“诚实的”，所以 **dishonest** 就是“不诚实的”。","常见搭配：dishonest person（不诚实的人）、dishonest behavior（不诚实的行为）、dishonest about something（在某事上不诚实）。文学或新闻中也常用来描述“失信/不正当”的做法：a dishonest government/official（不正直的政府/官员）。"]}
{"word":"dishonesties","summary":{"en":"“Dishonesties” means multiple acts of dishonesty—lies, cheating, or misleading behavior.","zh":"“dishonesties”指多次或多种不诚实行为，如说谎、作弊或误导他人的做法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"acts or statements that are not honest; lies, cheating, or other behavior meant to mislead people","zh":"不诚实的行为或言论；谎言、欺骗等用来误导他人的做法"},"examples":[{"en":"The report exposed several dishonesties in the company’s accounting.","zh":"报告揭露了该公司账目中的几处不诚实行为。"},{"en":"Even small dishonesties can damage trust in a relationship.","zh":"即使是小小的不诚实，也会损害关系中的信任。"},{"en":"He apologized for his dishonesties and promised to be transparent going forward.","zh":"他为自己的不诚实行为道歉，并承诺以后会更透明。"}]}],"synonyms":["lies","deceptions","falsehoods","cheating","fraud","misrepresentation"],"phonetic":"/dɪsˈɑnəstiz/","extraExplanation":["“dishonesties”是名词“dishonesty”的复数形式，强调“多次/多种不诚实的具体行为”。在日常英语中更常见的说法是用“dishonesty”（不可数，泛指不诚实这一品质）或用更具体的复数名词，如“lies / deceptions / acts of fraud”。","常见搭配：financial dishonesties（财务造假/财务不实行为）、minor dishonesties（小谎/小欺骗）、a pattern of dishonesties（一系列不诚实行为）。"]}
{"word":"dishonestly","summary":{"en":"“Dishonestly” means doing something in an untruthful or unfair way.","zh":"“dishonestly”表示以不诚实、不真实或不公平的方式做某事。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not honest; by lying, cheating, or hiding the truth.","zh":"不诚实地；用撒谎、欺骗或隐瞒真相的方式。"},"examples":[{"en":"He acted dishonestly during the exam by looking at someone else’s answers.","zh":"他在考试中不诚实，偷看了别人的答案。"},{"en":"The company dishonestly advertised the product as “100% natural.”","zh":"这家公司不诚实地把产品宣传成“100%天然”。"},{"en":"She felt hurt because her friend spoke dishonestly about what happened.","zh":"她很受伤，因为朋友对发生的事说了不实的话。"}]}],"synonyms":["untruthfully","deceitfully","fraudulently","cheatingly"],"phonetic":"/dɪˈɑnəstli/"}
{"word":"dishonestus","summary":{"en":"Dishonest means not truthful or trustworthy, or not sincere/genuine.","zh":"Dishonest 意为“不诚实的、不可信的”，也可指“不真诚的、虚伪的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not truthful or trustworthy; willing to lie, cheat, or steal.","zh":"不诚实的；不可信的；可能撒谎、欺骗或偷窃的。"},"examples":[{"en":"He was dishonest about how he got the money.","zh":"他对钱的来源不诚实。"},{"en":"Copying answers on a test is dishonest.","zh":"考试抄答案是不诚实的。"},{"en":"A dishonest seller might hide problems with a product.","zh":"不诚实的卖家可能会隐瞒产品的问题。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not genuine or sincere; meant to create a false impression (often about feelings, reasons, or behavior).","zh":"不真诚的；虚伪的（常指感情、理由或行为给人错误印象）。"},"examples":[{"en":"Her apology sounded dishonest.","zh":"她的道歉听起来不真诚。"},{"en":"He gave a dishonest excuse for being late.","zh":"他用一个不真实的借口解释迟到。"}]}],"synonyms":["untruthful","deceitful","lying","fraudulent","insincere"],"phonetic":"/dɪsˈɑnɪst/","extraExplanation":["“dishonestus”不是常见的英文单词，最可能是把“dishonest”（不诚实的）拼错了，或误把“dishonest + us”连在一起。英语里形容词通常不会以“-us”结尾来表示复数或“我们”。如果你想表达“我们是不诚实的”，可以说：“We are dishonest.”"]}
{"word":"dishonesty","summary":{"en":"Dishonesty means being untruthful—lying, cheating, or acting in a way that lacks honesty.","zh":"Dishonesty 指不诚实：说谎、欺骗或缺乏诚实的行为与习惯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or habit of lying, cheating, or being untruthful; lack of honesty","zh":"不诚实；说谎、欺骗的行为或习惯；缺乏诚实"},"examples":[{"en":"Dishonesty can destroy trust in a relationship.","zh":"不诚实会摧毁一段关系中的信任。"},{"en":"The company fired him for dishonesty on expense reports.","zh":"公司因他在报销单上弄虚作假而解雇了他。"},{"en":"Teachers often stress that even small acts of dishonesty can have serious consequences.","zh":"老师常强调，即使是小小的不诚实行为也可能带来严重后果。"}]},{"partOfSpeech":"n.","definition":{"en":"a specific dishonest act; a lie or deception (less common)","zh":"一次具体的不诚实行为；谎言或欺骗（较不常见）"},"examples":[{"en":"Her apology admitted several dishonesty in the story.","zh":"她的道歉承认了故事中有几处不实之处。"}]}],"synonyms":["untruthfulness","deceit","deception","fraud","cheating","lying","dishonorable conduct"],"phonetic":"dɪsˈɑnɪsti","extraExplanation":["更常见的表达是把它当作不可数名词（dishonesty），表示一种“品质/倾向”：例如 “Dishonesty is harmful.” 当你想强调“某一次谎言/欺骗”时，英语更自然的说法通常是用 countable 名词：a lie（一个谎言）, a deception（一次欺骗）, an act of dishonesty（一次不诚实的行为）。另外，第二个义项里把 dishonesty 当可数用法较少见，例句在正式写作中可能会改成 “several dishonest statements / several lies”。"]}
{"word":"dishonor","summary":{"en":"“Dishonor” means shame or loss of respect, or to cause someone/something to lose honor.","zh":"“dishonor”指耻辱、失去尊重；也可作动词表示使蒙羞、损害名誉。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Loss of honor or respect; a state of shame caused by doing something morally wrong or socially unacceptable.","zh":"失去荣誉或尊重；因做了不道德或不被社会接受的事而产生的羞耻状态。"},"examples":[{"en":"He felt deep dishonor after lying to his family.","zh":"他对家人撒谎后感到深深的羞耻。"},{"en":"In some cultures, bringing dishonor to the family is taken very seriously.","zh":"在一些文化中，给家族带来耻辱被看得非常严重。"}]},{"partOfSpeech":"vt.","definition":{"en":"To bring shame on someone or something; to damage their good name or reputation.","zh":"使某人或某事蒙羞；损害其名誉或声誉。"},"examples":[{"en":"The scandal dishonored the company’s reputation.","zh":"这桩丑闻让公司的名声蒙羞。"},{"en":"He said he would rather resign than dishonor his team.","zh":"他说他宁愿辞职也不愿让团队蒙羞。"}]}],"synonyms":["shame","disgrace","humiliation","stain","defile"],"phonetic":"/dɪsˈɑnɚ/","extraExplanation":["“dishonor”常见于较正式的语境（新闻、历史、法律、文学），语气比“shame/embarrass”更强，强调“名誉/道德层面”的污点，而不仅是“尴尬”。","近义词辨析：shame 常指“羞愧/羞耻感”（也可作动词“使羞愧”）；disgrace 强调“失去社会地位或尊重”；dishonor 更突出“荣誉被玷污”，常与 family, name, uniform, country 等搭配。","文学/文化用法：在历史或文学作品中，dishonor 常与“honor（荣誉）”成对出现，用来体现人物的道德选择与社会评价，例如“to die with honor rather than live in dishonor（宁死守荣，不苟且蒙羞）”。"]}
{"word":"dishonorable","summary":{"en":"Dishonorable means shameful or not worthy of respect; it can also specifically describe a serious punitive military discharge in the U.S.","zh":"Dishonorable 指“不光彩、可耻、不值得尊敬”的；在美国语境中也可特指“不名誉退伍”（一种严重的惩罚性退伍）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not deserving respect because it is morally wrong or shameful; lacking honor.","zh":"不光彩的；可耻的；不道德的；有损名誉的。"},"examples":[{"en":"He was discharged from the military for dishonorable conduct.","zh":"他因不光彩的行为被军队开除。"},{"en":"Lying to your friends may feel like a dishonorable act.","zh":"对朋友撒谎可能会让人觉得是一种可耻的行为。"},{"en":"The company was accused of dishonorable business practices.","zh":"这家公司被指控有不道德的商业行为。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Of a discharge from the U.S. military) Given as a punishment for serious wrongdoing; a type of discharge that brings strong social and legal consequences.","zh":"（指美国军队的“Dishonorable Discharge”）不名誉退伍；作为严重违纪的惩罚，伴随强烈的社会与法律后果。"},"examples":[{"en":"A dishonorable discharge can make it hard to get certain jobs.","zh":"不名誉退伍可能会让人难以获得某些工作。"},{"en":"He faced court-martial and received a dishonorable discharge.","zh":"他面临军事法庭审判，并被判不名誉退伍。"}]}],"synonyms":["shameful","disgraceful","unethical","ignoble","reprehensible"],"phonetic":"/dɪsˈɑnərəbəl/","extraExplanation":["“dishonorable”由前缀 dis-（否定）+ honorable（光荣的）构成，核心含义是“与荣誉相反”。常用于评价行为（dishonorable behavior/act）、动机（dishonorable motives）或手段（dishonorable means）。","在美国语境中，“dishonorable discharge”是一个固定搭配，特指最严重的一类惩罚性退伍决定（通常与军事犯罪相关）。日常写作中不要随意用于一般的“离职/解雇”，以免产生过强或不准确的法律/军事含义。","常见近义词：shameful（可耻的）、disgraceful（丢脸的）、unethical（不道德的）。反义词：honorable（光荣的）、respectable（体面的）。"]}
{"word":"dishonorableness","summary":{"en":"Dishonorableness means the state or quality of being dishonorable or shameful.","zh":"dishonorableness 指“缺乏荣誉与正直的不光彩状态/品质”，带有“可耻、失德”的含义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being dishonorable; lack of honor, integrity, or moral principle; a shameful character or action","zh":"不名誉；不光彩；不诚实/不正直的品质或行为（可指人的品格或某事的羞耻性）"},"examples":[{"en":"He was ashamed of the dishonorableness of his behavior.","zh":"他为自己行为的不光彩感到羞愧。"},{"en":"The public criticized the dishonorableness of the deal.","zh":"公众批评这笔交易不光彩。"},{"en":"She refused to join the plan because of its dishonorableness.","zh":"她拒绝参与这个计划，因为它不正当。"}]}],"synonyms":["dishonor","shamefulness","disgrace","infamy","baseness"],"phonetic":"/dɪsˈɑnərəbəlnəs/","extraExplanation":["“dishonorableness”是比较少见、偏书面/旧式的名词形式，更常见的写法是“dishonorableness”（美式）或“dishonourableness”（英式）。日常表达里，人们也更常用“dishonor”（名词）或“dishonorable behavior”（形容词+名词）来替代。","构词上：dishonorable（不光彩的）+ -ness（名词后缀，表示“……的性质/状态”）。"]}
{"word":"dishonorably","summary":{"en":"“Dishonorably” means “in a shameful or not honorable way,” and it can also mean “in a way that results in an official military dismissal as punishment.”","zh":"“dishonorably”表示“以不光彩/可耻的方式”，也可指“以不名誉（惩戒性）除役/退伍的方式”（军事语境）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is not honorable; in a shameful or disgraceful manner.","zh":"以不光彩的方式；可耻地；丢脸地。"},"examples":[{"en":"He was fired dishonorably after he lied to customers.","zh":"他因为对顾客撒谎而被不光彩地解雇了。"},{"en":"They acted dishonorably by breaking their promise.","zh":"他们违背承诺的行为很不光彩。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Military) In a way that involves being officially dismissed from the armed forces as punishment.","zh":"（军事）以被正式惩戒性开除军籍的方式；不名誉地（退伍/除役）。"},"examples":[{"en":"The soldier was discharged dishonorably for serious misconduct.","zh":"这名士兵因严重违纪而被不名誉除役。"},{"en":"He feared he would be sent home dishonorably.","zh":"他担心自己会被不名誉地遣返回家。"}]}],"synonyms":["shamefully","disgracefully","ignobly","unethically"],"phonetic":"/dɪsˈɑnərəbli/","extraExplanation":["“dishonorably”来自“dishonor（不名誉、羞辱）+ -ably（以……方式）”。日常语境里常用来评价行为“可耻”；在军事语境里常与“dishonorable discharge（不名誉除役）”搭配，含义更具体、更正式。","近义表达（语气由中到强）：shamefully（可耻地）, disgracefully（丢脸地）, unethically（不道德地）。常见搭配：act/behave dishonorably（行为不光彩）, be discharged dishonorably（被不名誉除役）。"]}
{"word":"dishonorary","summary":{"en":"Dishonorary means ‘bringing shame; not honorable,’ but it’s uncommon—dishonorable is much more common.","zh":"dishonorary 指“带来耻辱的、不光彩的”，但较少见；更常用的是 dishonorable。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Bringing shame or loss of respect; not honorable.","zh":"带来耻辱的；不光彩的；有损名誉的。"},"examples":[{"en":"Lying to the public was considered a dishonorary act.","zh":"对公众撒谎被认为是不光彩的行为。"},{"en":"He felt that quitting without notice would be dishonorary.","zh":"他觉得不打招呼就辞职会很丢脸、很不光彩。"}]}],"synonyms":["dishonorable","shameful","disgraceful","ignoble"],"phonetic":"/dɪsˈɑnəˌrɛri/","extraExplanation":["“dishonorary”在现代英语里比较少见，更常用的是“dishonorable”（不光彩的、可耻的）。如果你想表达“名誉性的（不领薪酬的/象征性的）”，正确词是“honorary”，不要和“dishonorary”混淆。","在正式或常见表达中，你可以用：dishonorable act（可耻的行为）、a disgrace（耻辱）、to bring shame on…（让……蒙羞）。"]}
{"word":"dishonored","summary":{"en":"“Dishonored” means having lost honor or respect, or it can be the past form of “dishonor,” meaning to shame or disrespect someone/something.","zh":"“dishonored”表示“名誉受损、蒙羞的”，也可作动词“dishonor”的过去式/过去分词，表示“使受辱、使名誉受损/不尊重”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"having lost respect, trust, or a good reputation; brought shame on","zh":"失去尊敬或信任的；名誉受损的；蒙羞的"},"examples":[{"en":"He felt dishonored after he broke his promise.","zh":"他违背了承诺后感到很丢脸。"},{"en":"The athlete was dishonored when they found he had cheated.","zh":"人们发现那位运动员作弊后，他的名誉受损。"},{"en":"In some stories, a dishonored family tries to regain its honor.","zh":"在一些故事里，蒙羞的家族会努力挽回名誉。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “dishonor”: to treat someone without respect, or to cause someone/something to lose honor","zh":"dishonor 的过去式/过去分词：使（某人/某事）受辱；不尊重；使名誉受损"},"examples":[{"en":"He dishonored the agreement by refusing to pay.","zh":"他拒绝付款，等于羞辱/违背了协议。"},{"en":"The official was dishonored by the scandal.","zh":"那位官员因丑闻而名誉扫地。"}]}],"synonyms":["disgraced","shamed","humiliated","discredited"],"phonetic":"/dɪsˈɑnərd/","extraExplanation":["“dishonored”常用于强调“名誉、尊严、信任”受损，语气比“embarrassed（尴尬）”更重，接近“humiliated（受辱）/disgraced（蒙羞）”。常见搭配：dishonored family/name/uniform（家族/名声/制服蒙羞）。","拼写提示：英式也常见作“dishonoured”。","在文学与叙事中，“honor（荣誉）/dishonor（耻辱）”常用来推动人物动机（复仇、赎罪、挽回声誉等）。"]}
{"word":"dishonorer","summary":{"en":"A dishonorer is a person who causes shame or damages someone’s honor or reputation.","zh":"dishonorer 指使人蒙羞、损害他人名誉或尊严的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who brings shame on someone or something; someone who behaves in a way that damages honor or reputation","zh":"使某人或某事蒙羞的人；损害他人或事物名誉、尊严的人"},"examples":[{"en":"He was seen as a dishonorer of the family name after the scandal.","zh":"丑闻之后，他被视为家族名声的玷污者。"},{"en":"She refused to work with a dishonorer of the team’s values.","zh":"她拒绝与破坏团队价值观的人共事。"}]}],"synonyms":["disgracer","shamer","defamer","wrongdoer"],"phonetic":"/dɪsˈɑnərər/","extraExplanation":["“dishonorer”由动词 dishonor（使蒙羞/不尊重）+ 后缀 -er（表示“做某事的人”）构成，语气较正式，常见于道德评价、法律/宗教或文学语境中。日常口语更常用 “someone who dishonors…” 或 “a disgrace”。"]}
{"word":"dishonoring","summary":{"en":"“Dishonoring” means showing serious disrespect that brings shame, or (in finance) refusing to pay a check or obligation.","zh":"“dishonoring”指严重不尊重而使人/事蒙羞；在金融语境中指银行拒付支票或票据。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to treat someone or something without respect, causing loss of honor or reputation; to bring shame on","zh":"不尊重某人/某事，损害其名誉或尊严；使蒙羞"},"examples":[{"en":"He was accused of dishonoring his family with his reckless behavior.","zh":"他因鲁莽的行为被指责让家人蒙羞。"},{"en":"Cheating on the exam dishonored the school’s values.","zh":"考试作弊损害了学校的价值观。"},{"en":"The scandal ended up dishonoring the entire organization.","zh":"这起丑闻最终让整个组织蒙羞。"}]},{"partOfSpeech":"v.","definition":{"en":"(of a bank) to refuse to pay a check, bill, or financial obligation","zh":"（银行）拒付支票、汇票或金融票据；退票"},"examples":[{"en":"The bank dishonored the check because there were not enough funds.","zh":"由于余额不足，银行拒付了这张支票。"},{"en":"If your account is overdrawn, the payment may be dishonored.","zh":"如果你的账户透支，这笔付款可能会被拒付。"}]}],"synonyms":["shaming","disgracing","humiliating","insulting","defiling","refusing payment","rejecting a check"],"phonetic":"/dɪsˈɑnərɪŋ/","extraExplanation":["“dishonoring”通常是动词dishonor的现在分词/动名词形式：\n- 现在分词：They are dishonoring the agreement.（他们正在违背/羞辱这项协议。）\n- 动名词：Dishonoring a promise can damage trust.（违背承诺会伤害信任。）\n在美式英语中也常拼作dishonor（英式：dishonour）。","情感与语域：在道德/人际语境里，dishonor语气较重，带有“羞辱、玷污名誉”的批评色彩；在金融语境里则更中性、偏正式（常见于银行或法律文件）。"]}
{"word":"dishonors","summary":{"en":"“Dishonors” usually means “brings shame on” or “treats with disrespect” (verb), and can also mean “acts of disgrace” (plural noun).","zh":"“dishonors”通常是动词，表示“使蒙羞/不尊重/做出有损名誉的事”；也可作名词复数，表示“耻辱、不光彩的行为或事件”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(verb) third-person singular form of “dishonor”: to bring shame on someone/something; to treat someone without respect; to do something that is morally wrong and damages a person’s reputation.","zh":"（动词）“dishonor”的第三人称单数：使……蒙羞/丢脸；不尊重；做出有损名誉、违背道德的事。"},"examples":[{"en":"He dishonors his family when he lies and cheats.","zh":"他撒谎和作弊，会让家人蒙羞。"},{"en":"The company dishonors its promise by refusing refunds.","zh":"这家公司拒绝退款，等于背弃了承诺、失信于人。"},{"en":"Some people feel it dishonors a tradition to change the ceremony.","zh":"有些人觉得改变仪式是在亵渎/损害传统。"}]},{"partOfSpeech":"n.","definition":{"en":"(noun, plural) acts or situations that cause shame; loss of respect or reputation.","zh":"（名词复数）不光彩的行为/事件；耻辱；名声受损。"},"examples":[{"en":"The scandal was one of the greatest dishonors in the team’s history.","zh":"这起丑闻是球队历史上最大的耻辱之一。"},{"en":"They spoke about the dishonors he brought upon his community.","zh":"他们谈到他给社区带来的耻辱。"}]}],"synonyms":["disgraces","shames","humiliates","discredits","betrays","violates"],"phonetic":"/dɪsˈɑnɚz/","extraExplanation":["“dishonor”在美式英语中也常拼作“dishonour”（英式拼法为“dishonour”）。","常见搭配：dishonor someone’s name/family（玷污某人的名声/家族名誉）、dishonor an agreement/contract（违背协议/合同，尤指不履行承诺）。"]}
{"word":"dishonour","summary":{"en":"Dishonour means disgrace or loss of respect, or to cause someone/something to be disgraced.","zh":"dishonour 指“耻辱、失去尊重/名誉受损”，也可作动词表示“使蒙羞、使受辱”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Loss of respect or a damaged reputation because of shameful behavior; a state of disgrace.","zh":"因可耻行为而失去尊重或名誉受损；耻辱、丢脸、失体面。"},"examples":[{"en":"He brought dishonour on his family by lying in court.","zh":"他在法庭上撒谎，给家人带来了耻辱。"},{"en":"In some stories, a knight would rather die than live in dishonour.","zh":"在一些故事里，骑士宁愿死，也不愿在耻辱中活着。"}]},{"partOfSpeech":"vt.","definition":{"en":"To make someone or something lose respect; to disgrace or shame.","zh":"使某人/某事失去尊重；使蒙羞、使受辱。"},"examples":[{"en":"She felt he had dishonoured the team by cheating.","zh":"她觉得他作弊让整个队伍蒙羞。"},{"en":"He refused to dishonour his promise.","zh":"他拒绝背弃（有辱于）自己的承诺。"}]}],"synonyms":["disgrace","shame","humiliation","infamy","dishonor"],"phonetic":"/dɪsˈɑnər/","extraExplanation":["英式拼写是 dishonour，美式更常写作 dishonor；两者意思相同。","在文学或历史语境中，dishonour 常与“荣誉（honour）/名誉（reputation）/羞耻（shame）”等主题相连，比如骑士精神、家族名声、社会礼仪等。","在现代日常英语里，谈“名誉受损”更常用 disgrace / shame / damage one’s reputation；dishonour 听起来更正式或更文学化。"]}
{"word":"dishonourable","summary":{"en":"“Dishonourable” means shameful or not deserving respect; it can also mean showing a lack of respect. (US spelling: “dishonorable.”)","zh":"“dishonourable”意为不名誉的、可耻的、不值得尊敬的；也可指对他人或传统等不尊重。（美式拼写：dishonorable。）"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not deserving respect; shameful or morally wrong.","zh":"不名誉的；可耻的；不道德的。"},"examples":[{"en":"It would be dishonourable to lie to your teammates.","zh":"对队友撒谎是可耻的、不名誉的。"},{"en":"He was criticized for his dishonourable behavior in the competition.","zh":"他在比赛中的不光彩行为受到了批评。"},{"en":"In many stories, a dishonourable person often loses trust quickly.","zh":"在许多故事里，不名誉的人常常很快失去他人的信任。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not showing the respect that someone deserves (often toward a person, tradition, or duty).","zh":"对（某人/传统/职责）不尊重的；有失敬意的。"},"examples":[{"en":"Speaking loudly during the ceremony was seen as dishonourable.","zh":"在仪式中大声说话被认为是不敬的行为。"},{"en":"She felt it was dishonourable to ignore the promise she had made.","zh":"她觉得无视自己许下的承诺是不光彩的。"}]}],"synonyms":["dishonorable","shameful","disgraceful","unethical","unscrupulous"],"phonetic":"/dɪsˈɑnərəbəl/","extraExplanation":["英式拼写为 dishonourable；美式更常写作 dishonorable。两者意思相同，只是拼写习惯不同。","honour/honor 常与“名誉、荣誉、道义”相关；dishonourable/dishonorable 常用于评价行为或品格，语气较强，带有道德批判。"]}
{"word":"dishonourableness","summary":{"en":"Dishonourableness means the quality of being dishonourable—unethical, dishonest, or bringing shame.","zh":"Dishonourableness 指“不名誉/不光彩”的品质或状态，即不道德、不诚实或带来耻辱。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being dishonest, unethical, or not deserving respect; lack of honor","zh":"不名誉；不光彩；不诚实或不道德的品质（缺乏荣誉感）"},"examples":[{"en":"He was ashamed of the dishonourableness of his actions.","zh":"他为自己行为的不光彩感到羞愧。"},{"en":"The report exposed the dishonourableness of the deal.","zh":"这份报告揭露了这笔交易的不道德之处。"}]},{"partOfSpeech":"n.","definition":{"en":"behavior that brings shame or disgrace","zh":"带来耻辱或丢脸的行为"},"examples":[{"en":"They condemned the dishonourableness shown during the competition.","zh":"他们谴责比赛中表现出的不光彩行为。"},{"en":"In the story, the villain’s dishonourableness leads to his downfall.","zh":"在故事里，反派的不名誉行为导致了他的覆灭。"}]}],"synonyms":["dishonor","disgrace","shamefulness","ignominy","lack of integrity"],"phonetic":"/dɪsˈɑnərəbəlnəs/","extraExplanation":["“dishonourableness”是英式拼写（honour）。美式更常写作“dishonorableness”（honor）。意思相同。","构词：dis-（否定）+ honour/honor（荣誉）+ -able（可……的）+ -ness（名词后缀）。整体表示“缺乏荣誉/不值得尊敬的状态”。","这个词在现代英语中相对少见，更常用的表达包括“dishonor”“disgrace”“shameful behavior”“lack of integrity”等。"]}
{"word":"dishonourably","summary":{"en":"Dishonourably means “in a shameful or unethical way,” often used in formal or military contexts.","zh":"dishonourably 表示“以可耻或不道德的方式；不光彩地”，常见于较正式或军事语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is morally wrong, shameful, or not deserving respect.","zh":"以不道德、可耻、令人不齿的方式；不光彩地。"},"examples":[{"en":"He cheated in the game and was removed dishonourably.","zh":"他在比赛中作弊，被不光彩地取消资格。"},{"en":"The company treated its workers dishonourably by lying about wages.","zh":"这家公司在工资问题上撒谎，以不光彩的方式对待员工。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Especially in military/formal contexts) In a way that causes someone to lose official honor or status, such as being dismissed in disgrace.","zh":"（尤用于军队/正式语境）以导致失去名誉或身份的方式；被耻辱性地（处分/开除）。"},"examples":[{"en":"He was discharged dishonourably after breaking the rules.","zh":"他因违反规定被耻辱性退役。"},{"en":"The officer acted dishonourably and faced a public hearing.","zh":"那名军官行为不光彩，面临公开听证。"}]}],"synonyms":["shamefully","disgracefully","unethically","ignobly"],"phonetic":"/dɪsˈɑnɚəbli/","extraExplanation":["英式拼写为 dishonourably；美式拼写更常见的是 dishonorably。两者意思相同。","词根提示：honour/honor（荣誉）+ dis-（否定）→ dishonour（不名誉、使蒙羞）+ -ably（以……方式）→ “以不名誉的方式”。","语域：日常生活中更常用 shamefully（可耻地）、disgracefully（丢脸地）；而 dishonourably 带有更强的“违背荣誉/操守”的色彩，常见于较正式的写作或报道。"]}
{"word":"dishonourary","summary":{"en":"“dishonourary” is not standard English; you probably mean “dishonorable/dishonourable,” meaning shameful or not honest/fair.","zh":"“dishonourary”不是规范英文；你多半想写的是“dishonorable/dishonourable”，意思是“不光彩的、不诚实/不公平的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Nonstandard) A common misspelling of “dishonourable” (BrE) / “dishonorable” (AmE): not honest or fair; causing shame or loss of respect.","zh":"（非标准拼写）常见的拼写错误，通常想写的是 “dishonourable”（英式）/ “dishonorable”（美式）：不诚实或不公正的；可耻的、丢脸的。"},"examples":[{"en":"It would be dishonorable to take credit for someone else’s work.","zh":"把别人的成果据为己有是可耻的。"},{"en":"They called the decision dishonorable because it betrayed the team’s trust.","zh":"他们说这个决定很不光彩，因为它辜负了团队的信任。"}]}],"synonyms":["shameful","disgraceful","unethical","unscrupulous","dishonest"],"phonetic":"/dɪˈzɑnərəbəl/","extraExplanation":["“dishonourary” 不是常见或规范的英文单词。多数情况下你想表达的是 **dishonorable/dishonourable**（“不光彩的；不诚实的”）。","拼写提示：**honorary** 是“名誉的”（如 *honorary degree* 名誉学位），而“dishonourary”并不是它的固定反义词。要表达“可耻的”，通常用 **dishonorable**（美式）或 **dishonourable**（英式）。","美式拼写常用 **honor / dishonor**（少一个 u），英式拼写常用 **honour / dishonour**。"]}
{"word":"dishonoured","summary":{"en":"Dishonoured means having lost honour or reputation, or it can be the past form of “dishonour” (to shame someone or break a commitment).","zh":"dishonoured 表示“蒙羞、名誉受损”，也可作动词 dishonour 的过去式/过去分词，表示“使受辱、损害名誉或违背承诺”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having lost respect, trust, or a good reputation; brought into shame or disgrace.","zh":"失去尊敬、信任或名誉的；蒙羞的；受辱的。"},"examples":[{"en":"He felt dishonoured when the team accused him of cheating.","zh":"当团队指责他作弊时，他感到受辱。"},{"en":"In the novel, the hero returns home dishonoured after the defeat.","zh":"在小说里，英雄战败后蒙羞回到家乡。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “dishonour”: to damage someone’s reputation or show them disrespect; to break a promise or commitment.","zh":"“dishonour”的过去式/过去分词：损害某人名誉或羞辱某人；违背承诺或义务。"},"examples":[{"en":"The newspaper dishonoured her by printing false claims.","zh":"这家报纸刊登虚假指控，损害了她的名誉。"},{"en":"He dishonoured the agreement and refused to pay.","zh":"他违背了协议，拒绝付款。"}]}],"synonyms":["disgraced","shamed","humiliated","discredited","disrespected"],"phonetic":"/dɪsˈɑnərd/","extraExplanation":["“dishonoured”是英式拼写（-our），美式通常写作“dishonored”（-or）。意思相同。","在较正式或文学语境中，dishonoured常带有“名誉受损、家族/群体蒙羞”的色彩；日常英语里更常用“disrespected”“shamed”或“lost face”（较口语、偏文化表达）。"]}
{"word":"dishonourer","summary":{"en":"A dishonourer is someone who causes disgrace or dishonor.","zh":"dishonourer 指带来耻辱、使人蒙羞的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who brings dishonor on someone or something; someone who disgraces another person, a group, or an idea","zh":"使（他人/事物）蒙羞的人；玷污名誉、带来耻辱的人"},"examples":[{"en":"He was called a dishonourer of the family name after the scandal.","zh":"丑闻之后，他被称为家族名声的玷污者。"},{"en":"The novel portrays him as a dishonourer who betrays his closest friends.","zh":"小说把他刻画成一个背叛挚友、令人蒙羞的人。"}]}],"synonyms":["disgracer","shamer","betrayer","wrongdoer"],"phonetic":"/dɪsˈɑnɚɚ/","extraExplanation":["“dishonourer”多见于英式拼写（honour）。在美式英语中更常写作“dishonorer”（honor）。两者意思相同，但这个词整体较少用，更常用的表达是“someone who dishonors…”或直接用“disgrace（使丢脸的人/事）”。"]}
{"word":"dishonouring","summary":{"en":"Dishonouring means showing disrespect, bringing shame, or failing to keep a promise or agreement.","zh":"dishonouring 指不尊重、使蒙羞，或违背承诺/协议（如违约）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"showing disrespect toward someone or something; treating them as not worthy of respect.","zh":"对某人或某事表示不尊重；以不配受尊重的方式对待。"},"examples":[{"en":"He felt she was dishonouring her parents by speaking to them that way.","zh":"他觉得她那样对父母说话是在羞辱（不尊重）他们。"},{"en":"Some people believe cheating in school is dishonouring the value of learning.","zh":"有些人认为考试作弊是在亵渎（不尊重）学习的价值。"}]},{"partOfSpeech":"v.","definition":{"en":"damaging someone’s reputation or good name; bringing shame on a person, group, or institution.","zh":"损害某人的名誉；使某人、团体或机构蒙羞。"},"examples":[{"en":"The scandal was seen as dishonouring the company.","zh":"这起丑闻被认为让公司蒙羞。"},{"en":"He worried his mistake was dishonouring his team.","zh":"他担心自己的失误让团队丢脸。"}]},{"partOfSpeech":"v.","definition":{"en":"breaking a promise, agreement, or duty; failing to keep one’s word.","zh":"违背承诺/协议/责任；食言。"},"examples":[{"en":"By dishonouring the contract, the supplier risked legal action.","zh":"供应商违约可能会面临法律诉讼。"},{"en":"She apologized for dishonouring her commitment to volunteer.","zh":"她为未能履行志愿服务的承诺而道歉。"}]}],"synonyms":["disrespecting","shaming","disgracing","betraying","violating","breaking (a promise)"],"phonetic":"/dɪsˈɑnərɪŋ/","extraExplanation":["“dishonouring”是动词dishonour/dishonor的现在分词或动名词形式。英式拼写常用dishonour（-our），美式拼写更常见dishonor（-or）；但含义与用法基本相同。","在“让某人蒙羞/不尊重”的含义上，语气通常较强，常用于正式或道德评价语境（如家庭、传统、组织声誉等）。","在“违约/拒付”的法律或金融语境中，也会用dishonour（如dishonour a cheque=拒付支票/退票），属于较正式用法。"]}
{"word":"dishorn","summary":{"en":"“Dishorn” means to remove an animal’s horns, especially cattle, mainly for safety.","zh":"“Dishorn”指给动物（尤指牛）去角，主要出于安全考虑。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove the horns from an animal (especially cattle), usually for safety","zh":"给动物（尤指牛）去角；把角割掉（多为安全起见）"},"examples":[{"en":"Some farmers dishorn calves to prevent injuries in crowded barns.","zh":"一些农场主会给小牛去角，以防在拥挤的牛棚里受伤。"},{"en":"The vet explained how to dishorn the animal as humanely as possible.","zh":"兽医解释了如何尽可能人道地为动物去角。"}]}],"synonyms":["dehorn","remove the horns (of)"],"phonetic":"/dɪsˈhɔrn/","extraExplanation":["“dishorn”多见于畜牧业语境，和更常见的“dehorn”意思相同。现代养殖会强调动物福利（animal welfare），因此常搭配“humanely（人道地）”“with pain relief（配合镇痛）”等说法。","在日常英语里不常用作比喻义；如果要表达“让某人失去威风/优势”，通常不会用“dishorn”，而会说“take the sting out of… / take away someone’s power/edge”等。"]}
{"word":"dishorner","summary":{"en":"Dishonor means to bring shame to someone (verb) or a state of shame/loss of respect (noun).","zh":"Dishonor 指“使（人/事）蒙羞”（动词）或“耻辱/失去尊重”（名词）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to damage someone’s reputation or dignity; to bring shame to someone or something","zh":"玷污（某人）的名誉或尊严；使（人/事物）蒙羞"},"examples":[{"en":"He felt he had dishonored his family by lying.","zh":"他觉得自己撒谎让家人蒙羞。"},{"en":"The athlete was accused of dishonoring the sport.","zh":"这名运动员被指责玷污了这项运动的名声。"}]},{"partOfSpeech":"n.","definition":{"en":"loss of honor or respect; shame","zh":"失去荣誉或尊重；耻辱"},"examples":[{"en":"For her, breaking a promise would be a dishonor.","zh":"对她来说，违背承诺是一种耻辱。"},{"en":"He resigned to avoid dishonor.","zh":"他辞职以避免蒙羞。"}]}],"synonyms":["shame","disgrace","humiliate","degrade","embarrass","stain (one’s) reputation"],"phonetic":"/dɪsˈɑnər/","extraExplanation":["“dishorner”不是常见标准拼写。你可能想查的是 **dishonor**（美式拼写）或 **dishonour**（英式拼写）。","如果你看到 **dishoner/dishonorer**，通常是非常少见的“施辱者/使人蒙羞的人”的意思，但日常英语更常用表达是：**someone who dishonors …** 或 **a person who brings shame**。","词根提示：**dis-** 表示“否定/相反”，**honor** 表示“荣誉”，合起来就是“使失去荣誉/带来耻辱”。"]}
{"word":"dishorse","summary":{"en":"“dishorse” is an archaic verb meaning to unhorse someone (knock or throw them off a horse).","zh":"“dishorse”是较古旧的动词，意思是使人落马（把人从马背上击落/弄下）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Archaic) To knock or throw someone off a horse; to unhorse.","zh":"（古旧用法）把某人从马背上击落；使落马（= unhorse）。"},"examples":[{"en":"The knight was dishorsed in the first charge.","zh":"那位骑士在第一次冲锋中就被击落下马。"},{"en":"In the story, the hero dishorses his rival with a single strike.","zh":"在故事里，英雄一击就让对手落马。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Rare) To remove from a horse; to cause someone to get off a horse.","zh":"（少见）使某人下马；把某人从马上带下。"},"examples":[{"en":"The guard dishorsed the messenger before questioning him.","zh":"卫兵让信使下马后才盘问他。"}]}],"synonyms":["unhorse","dismount","throw off (a horse)","knock off (a horse)"],"phonetic":"/dɪsˈhɔrs/","extraExplanation":["“dishorse”在现代英语里非常少见，常见的表达是“unhorse”或“knock/throw someone off a horse”。你更可能在骑士文学、历史小说或古风叙述中看到它。"]}
{"word":"dishouse","summary":{"en":"“Dishouse” is a rare, old-fashioned verb meaning to force someone out of a home (dispossess/evict).","zh":"“dishouse”是一个很少见、偏旧式的动词，表示把某人赶出家门/使失去住处（逐出、驱逐）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(rare/old-fashioned) To force someone to leave a house; to dispossess or drive out of a home.","zh":"（罕见/旧式）把某人赶出房子；使失去住处；逐出家门。"},"examples":[{"en":"The landlord threatened to dishouse the tenants if they didn’t pay.","zh":"房东威胁说如果房客不付钱，就要把他们赶出房子。"},{"en":"After the fire, many families were effectively dishoused for months.","zh":"火灾之后，许多家庭事实上有好几个月都无家可归。"}]}],"synonyms":["evict","dispossess","expel","oust","kick out"],"phonetic":"/dɪsˈhaʊs/","extraExplanation":["“dishouse”在现代英语里非常少见，多数学习材料与日常交流几乎不用。现代更常见的说法是：evict（依法驱逐房客）、kick out（口语“赶出去”）、make someone homeless / leave someone homeless（使某人无家可归）。","它容易被误看成“dish + house”（名词组合）或误写成“dish out”（分发/端出）。如果你想表达“分发、端出”，更可能要用“dish out”。"]}
{"word":"dishpan","summary":{"en":"A dishpan is a deep basin used for washing dishes, usually placed in a sink.","zh":"dishpan 指洗碗用的深盆/洗碗盆，通常放在水槽里使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a deep pan or basin used for washing dishes, usually in a sink","zh":"（通常放在水槽里用的）洗碗盆；洗碗用的深盆"},"examples":[{"en":"She filled the dishpan with hot, soapy water and started washing the plates.","zh":"她把洗碗盆装满热肥皂水，开始洗盘子。"},{"en":"We keep a plastic dishpan under the sink for cleaning up after big meals.","zh":"我们在水槽下面放了一个塑料洗碗盆，用来在大餐后清洗餐具。"}]}],"synonyms":["washbasin","basin","tub"],"phonetic":"/ˈdɪʃpæn/","extraExplanation":["“dishpan”在美式英语里比较常见，尤其是过去家里没有洗碗机或水槽较浅时，会用一个大盆来集中洗涮。现在也常用于露营、宿舍等临时或简易厨房场景。","常见搭配是“dishpan hands”，指长时间洗碗、接触热水和清洁剂导致的手部粗糙、发红、干裂。也可引申为“长期做家务劳作的手”。例如：She had dishpan hands from years of washing dishes."]}
{"word":"dishpanful","summary":{"en":"Dishpanful means the amount that fills a dishpan—a dishpan’s worth.","zh":"dishpanful 指“装满一个洗碗盆的量”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A quantity that fills a dishpan (a large pan used for washing dishes); a dishpan’s worth.","zh":"一洗碗盆的量；装满一个洗碗盆的数量。"},"examples":[{"en":"Add a dishpanful of warm water and a little soap to soak the plates.","zh":"倒入一洗碗盆温水，加一点肥皂来浸泡盘子。"},{"en":"They carried dishpanfuls of water from the pump to the kitchen.","zh":"他们从水泵那里一盆盆（洗碗盆那么多）地把水端到厨房。"}]}],"synonyms":["panful","basinful","bucketful (similar idea)"],"phonetic":"/ˈdɪʃˌpænˌfʊl/","extraExplanation":["“dishpanful”是复合词：dishpan（洗碗盆）+ -ful（表示“……的量/充满……”）。类似结构还有：handful（一把的量）、spoonful（一勺的量）、bucketful（一桶的量）。","这个词偏口语、偏乡村或较旧式的表达；现代更常说“a panful of water / a basinful of water”。"]}
{"word":"dishpans","summary":{"en":"Dishpans are large basins used for washing dishes (plural of dishpan).","zh":"dishpans 指洗碗用的大盆（dishpan 的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of dishpan) Large basins or tubs used for washing dishes, often in a sink or on a counter.","zh":"（dishpan 的复数）洗碗盆；洗碗用的大盆/水槽（常放在水槽里或台面上使用）。"},"examples":[{"en":"After the party, we filled two dishpans with soapy water and started washing glasses.","zh":"聚会后，我们装了两大盆肥皂水，开始洗玻璃杯。"},{"en":"The camping dishes were cleaned in dishpans outside the cabin.","zh":"露营用的餐具是在小木屋外用洗碗盆清洗的。"}]}],"synonyms":["washbasins","basins","tubs","washing-up bowls"],"phonetic":"/ˈdɪʃˌpæn/","extraExplanation":["“dishpan”在美式英语里带点老派、家庭生活的感觉，常见于较早的书写或口语；现在很多人更常说“basin / tub / sink”。在一些地区，“dishpan hands”还可指“因长时间洗碗而变粗糙的手”。"]}
{"word":"dishrag","summary":{"en":"A dishrag is mainly a cloth for washing dishes; informally it can also mean a weak person (often insulting).","zh":"dishrag主要指洗碗用的抹布；非正式地也可用来骂人懦弱（常带侮辱）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A cloth used for washing dishes and wiping kitchen surfaces; a dishcloth.","zh":"洗碗布；抹布（用于洗碗或擦拭厨房台面）。"},"examples":[{"en":"Rinse the dishrag after you wash the dishes.","zh":"洗完碗后把洗碗布冲洗干净。"},{"en":"She wiped the counter with a dishrag.","zh":"她用抹布把台面擦干净。"},{"en":"That dishrag smells—let’s put it in the laundry.","zh":"那块抹布有味道了——我们把它拿去洗。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal, sometimes offensive) A weak, timid person; someone seen as lacking courage or strength.","zh":"（非正式用法，有时带侮辱性）懦弱的人；被认为缺乏勇气或骨气的人。"},"examples":[{"en":"Don’t call him a dishrag—criticize the behavior, not the person.","zh":"别骂他是“懦夫”——批评行为，不要攻击人。"},{"en":"He was tired and stressed, not a “dishrag.”","zh":"他只是累了、压力大，并不是“没骨气的人”。"}]}],"synonyms":["dishcloth","rag"],"phonetic":"/ˈdɪʃˌræɡ/","extraExplanation":["“dishrag”在美式英语里更常指厨房清洁用的布，语气中性；用于形容人时属于比喻（像抹布一样软、没精神），带贬义，使用时注意场合与礼貌。","常见相关词：dishcloth（更常见、更中性）、rag（抹布/破布）、sponge（海绵）、scrub brush（刷子）。"]}
{"word":"dishrags","summary":{"en":"Dishrags are cloths used for washing dishes; informally, “a dishrag” can be an insult meaning a weak or spineless person.","zh":"dishrags 指洗碗布/抹布；口语里 “a dishrag” 也可作侮辱语，指软弱、没骨气的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cloth used for washing dishes or wiping kitchen surfaces; a dishcloth","zh":"洗碗布；抹布（用于洗碗或擦拭厨房台面）"},"examples":[{"en":"Can you rinse the dishrag and hang it up to dry?","zh":"你能把洗碗布冲一冲，然后挂起来晾干吗？"},{"en":"We keep a clean dishrag by the sink for quick spills.","zh":"我们在水槽旁放一块干净的抹布，方便随时擦掉溢出的水。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, insulting) a person seen as weak, helpless, or without courage","zh":"（非正式，侮辱性）懦弱无能的人；软弱的人"},"examples":[{"en":"He quit after one tough day, and they called him a dishrag.","zh":"他只经历了一天的困难就放弃了，他们就骂他是个懦夫。"},{"en":"Don’t let anyone treat you like a dishrag at work.","zh":"别让任何人在工作中把你当成软柿子。"}]}],"synonyms":["dishcloth","rag","cloth"],"phonetic":"/ˈdɪʃˌræɡ/","extraExplanation":["“dishrag”字面是“洗碗布”，引申义来自“湿软、没精神”的形象，比喻一个人没骨气或任人摆布。该用法带明显贬义，日常交流中容易冒犯他人，建议谨慎使用。"]}
{"word":"dishtowel","summary":{"en":"A dishtowel is a kitchen towel used to dry dishes or wipe surfaces.","zh":"dishtowel 指厨房里用来擦干餐具或擦拭台面的擦碗布/抹布。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a towel used in the kitchen for drying dishes, hands, or wiping surfaces","zh":"（厨房用的）擦碗布／抹布／擦手巾，用来擦干餐具、手或擦拭台面"},"examples":[{"en":"Can you dry the plates with a clean dishtowel?","zh":"你能用一条干净的擦碗布把盘子擦干吗？"},{"en":"She hung the dishtowel on a hook next to the sink.","zh":"她把擦碗布挂在水槽旁的挂钩上。"},{"en":"Wipe the counter with a dishtowel, then wash it.","zh":"先用抹布把台面擦一擦，然后把它洗干净。"}]}],"synonyms":["dish towel","kitchen towel","tea towel (BrE)"],"phonetic":"/ˈdɪʃˌtaʊəl/","extraExplanation":["“Dishtowel”在美式英语里很常见，也常写作“dish towel”。英式英语更常用“tea towel”，用途类似（厨房里擦干餐具或擦手），但并不一定和“tea（茶）”有关，更多是历史上家用织物的叫法。","日常使用上，如果用来擦生肉汁或清洁油污，最好用纸巾或专用抹布，并把dishtowel勤洗勤换，以避免细菌交叉污染。"]}
{"word":"dishtowels","summary":{"en":"Dishtowels are kitchen cloths used to dry dishes and hands.","zh":"dishtowels 指厨房里用来擦干餐具或手的擦碗布（复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Cloths used for drying dishes, glasses, and hands in the kitchen (plural of dish towel).","zh":"（dish towel 的复数）抹布/擦碗布；用于在厨房擦干餐具、玻璃杯或手的布。"},"examples":[{"en":"Please hang the dishtowels to dry after you use them.","zh":"用完擦碗布后请把它们挂起来晾干。"},{"en":"We keep clean dishtowels in the top drawer.","zh":"我们把干净的擦碗布放在最上面的抽屉里。"}]}],"synonyms":["dish towels","tea towels","kitchen towels"],"phonetic":"/ˈdɪʃˌtaʊəlz/","extraExplanation":["在美式英语里常说 dish towel（擦碗布）。在英式英语中更常见的说法是 tea towel，意思基本相同。也有人说 kitchen towel（但在某些地区也可能指厨房纸巾）。"]}
{"word":"dishumanize","summary":{"en":"“Dishumanize” means to treat people as if they are not fully human, denying their dignity and feelings.","zh":"“Dishumanize”意为把人当作不够“像人”的对象对待，否认其尊严与感受（常见写法为dehumanize）。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to treat a person or group as less than human; to deny or ignore their human qualities (such as dignity, feelings, and rights)","zh":"使（某人/某群体）非人化；把人当作“不是人”来对待，否认或忽视其人性（如尊严、感受与权利）"},"examples":[{"en":"Hate speech can dishumanize people and make violence seem acceptable.","zh":"仇恨言论会使人非人化，让暴力看起来变得“可以接受”。"},{"en":"The film shows how war can dishumanize both victims and soldiers.","zh":"这部电影展示了战争如何让受害者和士兵都被非人化。"},{"en":"We must not dishumanize refugees by reducing them to numbers.","zh":"我们不能用“数字”来简化难民，从而把他们非人化。"}]}],"synonyms":["dehumanize","demean","degrade","objectify","depersonalize"],"phonetic":"/dɪsˈhjuːməˌnaɪz/","extraExplanation":["“dishumanize”在现代英语中相对少见，更常见、标准的写法是“dehumanize”。两者意思基本相同：把人当成物品、动物或工具一样对待。","这是一个强烈的负面词，常用于讨论战争、种族歧视、仇恨言论、霸凌、极端政治宣传等话题。","常见搭配：dishumanize/dehumanize someone; dishumanize a group; dishumanizing language（非人化的语言）。形容词：dis/d ehumanizing；名词：dis/d ehumanization（非人化）。"]}
{"word":"dishumor","summary":{"en":"Dishumor means ill temper or a bad mood (mostly archaic/literary).","zh":"Dishumor 指坏脾气或心情不好（多为古旧/文学用法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"bad mood; irritability; ill temper (archaic or literary).","zh":"坏情绪；易怒；不快的脾气（古旧或文学用法）。"},"examples":[{"en":"He spoke in dishumor, answering every question too sharply.","zh":"他带着不快的情绪说话，每个问题都回答得很冲。"},{"en":"The delay put her in dishumor for the rest of the afternoon.","zh":"这次耽搁让她整个下午都心情不佳。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make someone annoyed or displeased; to put out of humor (rare, archaic).","zh":"使某人恼火；惹人不快（罕见、古旧）。"},"examples":[{"en":"The constant noise dishumored him and he left early.","zh":"持续的噪音惹得他心烦，他就早早离开了。"}]}],"synonyms":["ill humor","bad mood","irritability","annoyance","peevishness"],"phonetic":"/dɪsˈhjuːmər/","extraExplanation":["“dishumor”在现代英语里很少见，更常用的是“ill humor / bad mood / annoyance”。","这个词和早期“humor（体液/气质）”观念有关：古人认为人的情绪与体液平衡相关，因此“in good humor / in ill humor”之类的搭配在文学中更常见。","拼写上也可见“dishumour”（英式拼写更贴近“humour”）；但当代写作里一般不推荐使用这种古旧形式，除非在仿古或文学语境中。"]}
{"word":"dishumour","summary":{"en":"Dishumour means being in a bad mood, or causing someone to be in a bad mood.","zh":"dishumour 指“情绪不好/恼怒”，也可指“使某人情绪变差”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a bad mood; ill temper; a state of being annoyed or dissatisfied","zh":"坏情绪；不高兴；恼怒（的状态）"},"examples":[{"en":"He was in a state of dishumour after the long delay.","zh":"长时间的延误之后，他情绪很差。"},{"en":"Try not to take her dishumour personally—she’s just tired.","zh":"别把她的坏情绪当成针对你——她只是累了。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make someone feel annoyed or less cheerful; to put someone in a bad mood","zh":"使某人不快；让某人心情变差"},"examples":[{"en":"The rude comment dishumoured him for the rest of the afternoon.","zh":"那句无礼的话让他整个下午都心情不佳。"},{"en":"Don’t let small problems dishumour you.","zh":"别让小问题影响你的心情。"}]}],"synonyms":["bad mood","ill temper","irritation","peevishness","crossness"],"phonetic":"/dɪsˈhjuːmɚ/","extraExplanation":["“dishumour”在现代英语中比较少见，更常见的写法/用法是“dis-humor”（美式更少用）或直接说“bad mood / ill temper”。","构词上是前缀“dis-”（表示否定、相反）+ “humour/humor”。这里的“humour”是较旧的含义，指“情绪/脾气”，不只是“幽默感”。"]}
{"word":"dishware","summary":{"en":"Dishware means the dishes you eat and serve food with—plates, bowls, cups, etc.","zh":"Dishware 指用于盛放和食用食物的一套餐具，如盘子、碗、杯子等。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plates, bowls, cups, and other dishes used for serving and eating food (often made of ceramic, glass, or metal).","zh":"餐具；（用于盛放和食用食物的）盘子、碗、杯子等器皿（常见材质有陶瓷、玻璃或金属）。"},"examples":[{"en":"We bought new dishware for the holiday dinner.","zh":"我们为节日晚餐买了新的餐具。"},{"en":"This restaurant uses simple white dishware to make the food stand out.","zh":"这家餐厅用简洁的白色餐具，让食物更显眼。"},{"en":"Please handle the dishware carefully—it’s fragile.","zh":"请小心拿放餐具——它很容易碎。"}]}],"synonyms":["tableware","dinnerware","crockery"],"phonetic":"/ˈdɪʃˌwɛr/","extraExplanation":["“Dishware”通常是不可数名词（dishware is），用于统称一套餐具；如果要强调“几套”，常说 sets of dishware。","近义词对比：tableware（更广，含餐具+刀叉勺等餐桌用品）、dinnerware（更偏“正餐用的盘碗套装”，常指陶瓷）、crockery（英式用法更常见，常指陶瓷餐具）。"]}
{"word":"dishwares","summary":{"en":"“Dishwares” refers to dishware—plates, bowls, cups, and similar tableware, though the singular “dishware” is more common.","zh":"“dishwares”指餐具（盘、碗、杯等），但更常见的说法是单数“dishware”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plates, bowls, cups, and other tableware used for serving or eating food (more commonly said as “dishware,” often uncountable).","zh":"餐具；碗盘杯等用于盛放或食用食物的器皿（更常用“dishware”，常作不可数名词）。"},"examples":[{"en":"We bought new dishware for our apartment: plates, bowls, and mugs.","zh":"我们给公寓买了新餐具：盘子、碗和马克杯。"},{"en":"This dishwasher is safe for most dishware.","zh":"这台洗碗机对大多数餐具都安全适用。"}]}],"synonyms":["dishware","tableware","dishes","crockery"],"phonetic":"/ˈdɪʃˌwɛr/","extraExplanation":["“Dishware”在日常英语里更常见，通常作不可数名词（dishware），表示“一整套/一类餐具”。如果要强调“几套/不同种类的餐具”，可以用复数表达，但更自然的说法往往是：sets of dishware、types of dishware、different dishware designs。","“Dishware”偏家用餐具；更正式或更广义的词有“tableware”（餐具总称），更具体的还有“dishes”（盘碗等，口语常用，可数/复数常见）。"]}
{"word":"dishwash","summary":{"en":"Dishwash means to wash dishes; it can also mean the task of washing dishes.","zh":"dishwash 表示“洗碗/清洗餐具”，也可指“洗碗这项工作”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to wash dishes (plates, bowls, and utensils), usually after a meal.","zh":"洗碗；清洗餐具（盘子、碗、刀叉等），通常在饭后进行。"},"examples":[{"en":"I dishwash after dinner while my roommate dries the dishes.","zh":"我晚饭后负责洗碗，我室友负责把碗碟擦干。"},{"en":"He offered to dishwash so I could finish my homework.","zh":"他主动说要洗碗，好让我能把作业写完。"}]},{"partOfSpeech":"n.","definition":{"en":"the activity or job of washing dishes.","zh":"洗碗这件事；洗碗的工作。"},"examples":[{"en":"Dishwash is part of the closing routine in many restaurants.","zh":"在很多餐馆里，洗碗是打烊流程的一部分。"},{"en":"I don’t mind dishwash, but I hate taking out the trash.","zh":"我不介意洗碗，但我讨厌倒垃圾。"}]}],"synonyms":["wash the dishes","do the dishes","dishwashing"],"phonetic":"/ˈdɪʃwɑʃ/","extraExplanation":["“dishwash”在日常英语里不算最常见的说法，更自然的表达通常是“wash the dishes”（洗碗）或名词“dishwashing”（洗碗这件事/洗碗工作）。比如：I’m doing the dishwashing. / I need to wash the dishes.","与机器相关时更常用“dishwasher”（洗碗机）和“run the dishwasher”（启动洗碗机）。“dishwash”一般指手洗餐具，而不是用洗碗机。"]}
{"word":"dishwasher","summary":{"en":"Dishwasher usually means a dish-washing machine, and it can also mean a person who washes dishes as a job.","zh":"Dishwasher 通常指“洗碗机”，也可以指“洗碗工（职业）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A machine that washes dirty dishes automatically.","zh":"洗碗机；自动清洗餐具的机器。"},"examples":[{"en":"We put the plates in the dishwasher after dinner.","zh":"晚饭后我们把盘子放进洗碗机。"},{"en":"The dishwasher is running, so please don’t open it yet.","zh":"洗碗机正在运行，所以先别打开。"}]},{"partOfSpeech":"n.","definition":{"en":"A person whose job is to wash dishes, especially in a restaurant.","zh":"洗碗工；（尤指餐馆里的）负责洗碗的人。"},"examples":[{"en":"He worked as a dishwasher at a small café on weekends.","zh":"他周末在一家小咖啡馆当洗碗工。"},{"en":"The restaurant is hiring a dishwasher for the night shift.","zh":"那家餐馆在招聘夜班洗碗工。"}]}],"synonyms":["dishwashing machine","dish washer","dishwashing worker"],"phonetic":"/ˈdɪʃˌwɑʃɚ/","extraExplanation":["在美式英语里，dishwasher 很常用来指“洗碗机”。当指“洗碗工”时，常见于餐饮行业招聘或工作描述里；为了更明确，也可以说 dishwashing worker 或用更具体的职位名称（如 kitchen staff），但 dishwasher 仍是最常见、最口语化的说法。","相关搭配：load/unload the dishwasher（把餐具放进/从洗碗机取出）、run the dishwasher（启动洗碗机）、dishwasher detergent（洗碗机专用洗涤剂）。"]}
{"word":"dishwashers","summary":{"en":"“Dishwashers” is the plural of “dishwasher,” meaning either a dishwashing machine or a person who washes dishes as a job.","zh":"“dishwashers”是“dishwasher”的复数，既可指洗碗机，也可指以洗碗为工作的洗碗工。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a machine that washes dishes automatically","zh":"洗碗机（自动清洗餐具的机器）"},"examples":[{"en":"We bought a new dishwasher to save time after dinner.","zh":"我们买了一台新洗碗机，晚饭后可以省时间。"},{"en":"Please load the dishwasher and start it before you go out.","zh":"你出门前把洗碗机装好并启动。"}]},{"partOfSpeech":"n.","definition":{"en":"a person whose job is to wash dishes, especially in a restaurant","zh":"洗碗工（尤指在餐馆负责洗碗的人）"},"examples":[{"en":"He worked as a dishwasher in a small restaurant during college.","zh":"他大学期间在一家小餐馆当洗碗工。"},{"en":"The restaurant is hiring dishwashers for the evening shift.","zh":"这家餐馆正在招聘晚班洗碗工。"}]}],"synonyms":["dishwashing machine","dish washer","kitchen hand (job)","dishroom worker (job)"],"phonetic":"/ˈdɪʃˌwɑʃərz/","extraExplanation":["“dishwasher(s)”既可以指“机器”，也可以指“人”。在家居/电器语境里几乎总是指洗碗机；在餐饮招聘或后厨语境里常指洗碗工。","单数是 dishwasher；复数 dishwashers。日常口语里也常说“dishwasher”指代这台机器本身，例如：The dishwasher is running（洗碗机在运行）。"]}
{"word":"dishwashing","summary":{"en":"Dishwashing means washing dishes (a chore) and can also describe products used for washing dishes.","zh":"Dishwashing 指洗碗这项家务，也可作形容词表示“用于洗碗的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the activity of washing dishes, glasses, and cooking tools after eating or cooking","zh":"洗碗；清洗餐具（吃饭或做饭后把盘子、杯子、锅具等洗干净的活动）"},"examples":[{"en":"I’ll do the dishwashing if you dry and put everything away.","zh":"你来擦干并收起来的话，我来洗碗。"},{"en":"Dishwashing is my least favorite chore.","zh":"洗碗是我最不喜欢的家务。"}]},{"partOfSpeech":"adj.","definition":{"en":"related to or used for washing dishes","zh":"与洗碗有关的；用于洗碗的"},"examples":[{"en":"She bought new dishwashing gloves to protect her hands.","zh":"她买了新的洗碗手套来保护双手。"},{"en":"Use a mild dishwashing liquid to clean the pans.","zh":"用温和的洗洁精来清洗锅具。"}]}],"synonyms":["doing the dishes","washing dishes","cleaning up"],"phonetic":"/ˈdɪʃˌwɑʃɪŋ/","extraExplanation":["在美式英语里更常见的说法是：作名词用时说“doing the dishes”（洗碗这件事），作形容词用时常见搭配有“dishwashing liquid”（洗洁精）和“dishwashing detergent”（洗碗用洗涤剂）。另外，“dishwasher”指洗碗机，不是“洗碗的人”。"]}
{"word":"dishwashings","summary":{"en":"“Dishwashings” can mean the chore of washing dishes (less common) or, more often, the dirty water/leftovers from washing dishes.","zh":"“dishwashings”可指“洗碗这件家务”（较少见），更常指“洗碗产生的脏水/残渣”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or chore of washing dishes (less common; usually written as “dishwashing”)","zh":"洗碗这件事；洗碗的家务（较少见；更常写作 dishwashing）"},"examples":[{"en":"After dinner, the dishwashings are my responsibility.","zh":"晚饭后，洗碗这件事由我负责。"},{"en":"She finished the dishwashings before starting her homework.","zh":"她洗完碗才开始写作业。"}]},{"partOfSpeech":"n.","definition":{"en":"dirty water and leftover scraps from washing dishes; dishwater or kitchen slops (more specific and old-fashioned)","zh":"洗碗留下的脏水和残渣；洗碗水、厨房泔水（更具体，略旧式）"},"examples":[{"en":"Pour the dishwashings into the sink, not into the garden.","zh":"把洗碗水倒进水槽里，不要倒到花园里。"},{"en":"He carried a bucket of dishwashings out back.","zh":"他提着一桶洗碗水到后院去。"}]}],"synonyms":["dishwashing","washing up","dishwater","slops"],"phonetic":"/ˈdɪʃˌwɑʃɪŋz/","extraExplanation":["“dishwashing”更常见，通常作不可数名词，表示“洗碗这项家务”。“dishwashings”带复数形式时，常用来强调“洗碗产生的一桶桶脏水/残渣”等可分次数或可计量的东西，在较老的英语或乡村生活语境里更容易见到。"]}
{"word":"dishwater","summary":{"en":"Dishwater is the dirty water left after washing dishes; figuratively it can describe a dull, washed-out, grayish look.","zh":"Dishwater 指洗碗后留下的脏水；也可作比喻，形容暗淡、褪色、灰蒙蒙的外观。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Water that has been used for washing dishes, usually dirty and mixed with soap and food bits.","zh":"洗过碗盘后的脏水（常含洗洁精和食物残渣）。"},"examples":[{"en":"Pour the dishwater down the drain and rinse the sink.","zh":"把洗碗水倒进下水道，然后冲一下水槽。"},{"en":"The dishwater smelled terrible after the party.","zh":"聚会后，洗碗水闻起来很难闻。"}]},{"partOfSpeech":"other","definition":{"en":"(Figurative) Something that is very dull, weak, or dirty-looking—often used to describe a color or appearance.","zh":"（比喻）非常暗淡、无力或脏兮兮的样子——常用来形容颜色或外观。"},"examples":[{"en":"The sky turned a dishwater gray by late afternoon.","zh":"到傍晚时，天空变成了暗淡的“洗碗水灰”。"},{"en":"He wore a dishwater-colored shirt that looked washed out.","zh":"他穿了一件颜色发灰、很“洗碗水色”的衬衫，看起来很褪色。"}]}],"synonyms":["dirty water","wash water","gray (figurative)","dull (figurative)"],"phonetic":"/ˈdɪʃˌwɔtər/","extraExplanation":["“dishwater”作比喻时，常带有贬义，强调“灰、浑、没精神”的感觉。常见搭配包括“dishwater gray（暗灰）”。","你可能会见到固定说法“dishwater blonde”，指一种偏暗、没光泽的金发色（更接近“灰金/深金”），语气有时不太礼貌，用在描述别人外貌时要注意场合。"]}
{"word":"dishwaters","summary":{"en":"Dishwater is dirty water from washing dishes; informally, it can also mean very weak, unpleasant tea or coffee.","zh":"Dishwater 指洗碗用过的脏水；口语中也可比喻很淡、难喝的茶或咖啡。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Dirty water used for washing dishes (often with soap); the water left in the sink after doing the dishes.","zh":"洗碗用过的脏水（常含洗洁精）；洗完碗后水槽里留下的水。"},"examples":[{"en":"Please pour the dishwater down the drain.","zh":"请把洗碗水倒进下水道。"},{"en":"The kitchen smelled like dishwater after the party.","zh":"派对结束后，厨房里有一股洗碗水的味道。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, informal) A very weak, unpleasant-tasting drink—especially tea or coffee.","zh":"（比喻，非正式）很淡、难喝的饮料，尤指淡得像水的茶或咖啡。"},"examples":[{"en":"This coffee tastes like dishwater.","zh":"这咖啡淡得像洗碗水一样难喝。"},{"en":"He complained that the tea was basically dishwater.","zh":"他抱怨这茶几乎就是洗碗水。"}]}],"synonyms":["wash water","soapy water","dirty water","watery coffee","weak tea"],"phonetic":"/ˈdɪʃˌwɔtər/","extraExplanation":["“dishwater”通常作不可数名词；“dishwaters”较少见，多用于强调不同时间/不同桶里的多份洗碗水，或在文学中为营造画面感而用复数。","比喻用法带有明显的贬义，强调“又淡又难喝”。在更礼貌的场合，可以改说：watery coffee/tea（像水一样的咖啡/茶）、weak coffee/tea（很淡的咖啡/茶）。"]}
{"word":"dishwatery","summary":{"en":"Dishwatery means dull, weak, or bland—like dirty dishwater.","zh":"dishwatery 指“灰暗、无力、淡而无味”，带有像洗碗水一样的贬义比喻。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Dull, weak, or unpleasantly bland—like dirty dishwater; lacking freshness, color, or energy.","zh":"像洗碗水一样灰暗、淡而无味、没精神；缺乏新鲜感、色彩或活力。"},"examples":[{"en":"The coffee was dishwatery, so I added more grounds.","zh":"咖啡淡得像洗碗水，所以我加了更多咖啡粉。"},{"en":"He gave a dishwatery apology that didn’t sound sincere.","zh":"他道歉得软绵绵、淡而无力，听起来并不真诚。"},{"en":"The movie’s colors looked dishwatery on that old screen.","zh":"在那块旧屏幕上，这部电影的颜色显得灰灰的、很寡淡。"}]}],"synonyms":["watery","weak","thin","insipid","wishy-washy","dull"],"phonetic":"/ˈdɪʃˌwɔtəri/","extraExplanation":["“dishwatery”来自“dishwater（洗碗水）”的比喻：洗碗水往往浑浊、颜色发灰、味道很淡甚至令人不适，所以这个词常用来形容食物饮料“太淡”、表达/道歉“没诚意没力度”、色彩或文字风格“灰暗无亮点”。属于偏口语、带贬义的形容。"]}
{"word":"dishwiper","summary":{"en":"Dishwiper usually means a cloth used to wipe or dry dishes; the “person” meaning is rare.","zh":"Dishwiper通常指用来擦干或擦洗餐具的布；表示“擦碗的人”的用法较少见。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a cloth, towel, or sponge used to wipe dishes dry or clean them","zh":"用来擦干或清洁餐具的布、毛巾或海绵（擦碗布）"},"examples":[{"en":"Grab a clean dishwiper to dry the plates.","zh":"拿一块干净的擦碗布把盘子擦干。"},{"en":"This dishwiper smells bad—let’s wash it.","zh":"这块擦碗布有味道了——我们洗一下吧。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a person whose job is to wipe or dry dishes","zh":"（较少见）负责擦拭或擦干餐具的人"},"examples":[{"en":"In the old kitchen, a dishwiper stood by the sink all evening.","zh":"在那间老式厨房里，有个人整晚都站在水槽旁擦餐具。"}]}],"synonyms":["dishcloth","dish towel","kitchen towel","sponge"],"phonetic":"/ˈdɪʃˌwaɪpɚ/","extraExplanation":["“dishwiper”在现代英语里不算常用。日常更常说：dishcloth（擦碗布/抹布）、dish towel（擦碗毛巾）、sponge（海绵）。如果你指的是洗碗机，请用 dishwasher。"]}
{"word":"dishwiping","summary":{"en":"Dishwiping means wiping (often drying) dishes after washing them.","zh":"dishwiping 指洗完餐具后擦拭（常指擦干）碗盘的动作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of wiping dishes (removing water or food marks), especially after washing them; dish-drying by wiping","zh":"擦拭餐具的行为（去除水渍或残留物），尤指洗完后用布把碗盘擦干"},"examples":[{"en":"Dishwiping is part of our cleanup routine after dinner.","zh":"晚饭后，擦碗盘是我们清理流程的一部分。"},{"en":"I finished dishwiping and put the plates back in the cupboard.","zh":"我把碗盘擦干后，把它们放回橱柜里。"}]},{"partOfSpeech":"adj.","definition":{"en":"(less common) relating to wiping dishes; used like an adjective before a noun","zh":"（较少见）与擦拭餐具有关的；可作定语修饰名词"},"examples":[{"en":"Use a clean towel for dishwiping cloths.","zh":"擦碗布要用干净的毛巾或布。"}]}],"synonyms":["drying the dishes","wiping the dishes","dish-drying"],"phonetic":"/ˈdɪʃˌwaɪpɪŋ/","extraExplanation":["“dishwiping”是由 dish（餐具）+ wiping（擦拭）组成的复合表达，更常见的说法是“wiping the dishes / drying the dishes”。在日常英语里，人们也常说“do the dishes”（洗碗/收拾餐具），其中可能包含清洗、冲洗、擦干、收纳等步骤。"]}
{"word":"dishy","summary":{"en":"“Dishy” means (1) attractive/good-looking or (2) full of juicy gossip or revealing details.","zh":"“Dishy”可指（1）很有魅力/好看，或（2）八卦爆料多、细节劲爆。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) sexually attractive; good-looking (often used in British English).","zh":"（非正式）有性吸引力的；好看的（常见于英式英语）。"},"examples":[{"en":"She thinks the new actor is really dishy.","zh":"她觉得那位新演员真的很帅/很有魅力。"},{"en":"He’s dishy, but I don’t know anything about his personality yet.","zh":"他是挺有吸引力的，但我还不了解他的性格。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) full of interesting gossip or revealing details, especially about celebrities or private lives.","zh":"（非正式）八卦味十足的；爆料多的（尤指名人或私生活细节）。"},"examples":[{"en":"The interview had some dishy details about the band’s breakup.","zh":"这次采访爆出了一些乐队解散的八卦细节。"},{"en":"Tabloids love dishy stories.","zh":"小报很爱这种爆料型的八卦故事。"}]}],"synonyms":["attractive","good-looking","hot","cute","juicy","gossipy","revealing"],"phonetic":"/ˈdɪʃi/","extraExplanation":["“dishy”来自名词“dish”的俚语用法：把“dish”当作“吸引人的人/尤物”（类似“a dish”），再加上形容词后缀 -y 变成“dishy”。","在英美语境里它通常语气轻松、带点调侃；谈到外貌时可能有一点“物化”的味道，正式场合或不熟的人之间用要谨慎。","“dishy details / dishy gossip”常见于娱乐新闻、八卦栏目，语感接近“juicy”。"]}
