{"word":"disjasked","summary":{"en":"“disjasked” is not a recognized English word; it’s likely a misspelling (possibly “disguised” or “discussed”).","zh":"“disjasked”不是可识别的英语单词；很可能是拼写错误（可能想写“disguised”或“discussed”）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is likely a misspelling or a typing error.","zh":"不是标准英语单词；很可能是拼写或输入错误。"},"examples":[{"en":"I couldn’t find “disjasked” in a dictionary—did you mean “disguised” or “discussed”?","zh":"我在词典里找不到“disjasked”——你是不是想写“disguised（伪装的）”或“discussed（讨论过的）”？"}]}],"synonyms":["disguised","discussed","dispatched","disastrous"],"extraExplanation":["“disjasked”在常见英英/英汉词典中没有收录，通常表示拼写有误。","如果你能提供一句包含它的原句（或你想表达的中文意思），我可以更准确地判断你想写的是哪个词。","按字形最常见的可能目标包括：disguised（伪装的/乔装的）、discussed（讨论过的）、dispatched（派遣/发送的）、disastrous（灾难性的）。"]}
{"word":"disjasket","summary":{"en":"“disjasket” isn’t standard; it likely means “diskette” (a floppy disk).","zh":"“disjasket”不是标准用法；它很可能想写的是“diskette”（软盘）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely) a misspelling of “diskette,” a small removable computer storage disk (a floppy disk), especially common in the 1980s–1990s.","zh":"（可能）是“diskette”的拼写错误，指一种小型可移动的电脑存储磁盘（软盘），常见于20世纪80–90年代。"},"examples":[{"en":"My old computer files are still saved on a diskette.","zh":"我以前的电脑文件还保存在软盘里。"},{"en":"In the 1990s, people often carried diskettes to school or work.","zh":"在90年代，人们常常带着软盘去学校或工作。"}]}],"synonyms":["floppy disk","disk"],"phonetic":"/dɪˈskɛt/","extraExplanation":["“disjasket”不是标准英文单词。最接近、也最常见的可能是“diskette”（软盘）。","“diskette”也常被称为“floppy disk”。虽然现在几乎被U盘、云存储取代，但你仍可能在老电影、旧电脑资料或“保存”图标（软盘图标）里看到它的文化痕迹。"]}
{"word":"disjaskit","summary":{"en":"“disjaskit” isn’t recognized as a standard English word; it’s probably a misspelling.","zh":"“disjaskit”不是标准英语词汇；很可能是拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a made-up/brand name.","zh":"不是标准英语单词，可能是拼写错误，或是自造词/品牌名。"},"examples":[{"en":"I couldn’t find “disjaskit” in a dictionary—did you mean “diskette” or “disaster kit”?","zh":"我在词典里找不到“disjaskit”——你是不是想写“diskette（软盘）”或“disaster kit（应急包）”？"}]}],"synonyms":["diskette","disjunct","disaster kit","emergency kit"],"phonetic":"ˌdɪsˈdʒæskɪt","extraExplanation":["“disjaskit”看起来像把几个音或字母拼在一起的拼写错误。最接近的常见词可能有：\n- diskette（软盘，较老的计算机存储介质）\n- disjunct（语法/逻辑：分离的；不连贯的）\n- disaster kit / emergency kit（应急包/急救包）\n如果你能告诉我它出现的句子或领域（游戏、科技、医学等），我可以更准确判断你想表达的词。"]}
{"word":"disject","summary":{"en":"“Disject” means to scatter or break something into pieces; it’s a rare, literary verb.","zh":"“disject”意为“使四散/使碎裂”，是较少见、偏文学的动词。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to scatter or break into pieces; to disperse widely (often used in literary or formal contexts).","zh":"使散开；使碎裂；使四散（多用于文学或正式语境）。"},"examples":[{"en":"The storm disjected the leaves across the yard.","zh":"暴风把树叶吹得满院四散。"},{"en":"In the poem, the speaker tries to gather the disjected memories of childhood.","zh":"在诗中，说话者试图拾起童年那些散落的记忆碎片。"}]}],"synonyms":["scatter","disperse","shatter","fragment","strewn (as an adjective in context)"],"phonetic":"/dɪsˈdʒɛkt/","extraExplanation":["“disject”较少用于日常口语，更常见于文学评论或学术写作里，强调“把整体打散成碎片”。","常见相关表达是拉丁短语“disjecta membra”（意为“散落的肢体/残篇碎片”），常用来形容作品、思想或文献中零散的片段。"]}
{"word":"disjected","summary":{"en":"Disjected is an archaic/literary word meaning “dejected,” and more rarely “scattered or in fragments.”","zh":"disjected 是较古旧的文学用词，常指“沮丧的”，更少见时指“散落的、破碎的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic or literary) Dejected; sad and discouraged.","zh":"（古体或文学用语）沮丧的；灰心的；情绪低落的。"},"examples":[{"en":"After the loss, he walked home disjected and silent.","zh":"失利之后，他情绪低落、沉默地走回家。"},{"en":"She sounded disjected when her plans fell through.","zh":"当她的计划落空时，她听起来很沮丧。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) Scattered, broken apart, or disjointed; not in one whole piece.","zh":"（罕见）散落的；破碎的；支离破碎的；不成整体的。"},"examples":[{"en":"The archive contained disjected pages from several old journals.","zh":"档案里有几本旧期刊散落的页面。"},{"en":"He tried to rebuild the story from disjected bits of memory.","zh":"他试图用支离破碎的记忆片段重建那个故事。"}]}],"synonyms":["dejected","downcast","discouraged","dispirited","scattered","fragmented","disjointed"],"phonetic":"/dɪsˈdʒɛktɪd/","extraExplanation":["“disjected”来自较少见的动词 disject（意为“抛散、分开”），与更常见的 dejected（沮丧的）在现代英语里容易混淆。如今表达“沮丧”通常用 dejected、downcast、discouraged。","文学与学术语境中常见拉丁语表达 **disjecta membra**（字面“散落的肢体/碎片”），比喻“零散残篇、残存片段”，常用于谈论残缺文本、引文碎片或不完整的证据。"]}
{"word":"disjecting","summary":{"en":"“Disjecting” means scattering or breaking things apart; it’s a rare, literary/formal word.","zh":"“disjecting”表示“抛散、使分散/打散”，是较少见、偏文学或正式的用词。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"scattering or throwing things apart; dispersing (present participle of the rare verb “disject”).","zh":"把东西散开、抛散；使分散（罕见动词 disject 的现在分词）。"},"examples":[{"en":"The explosion was disjecting debris across the street.","zh":"爆炸把碎片抛散到街道各处。"},{"en":"In the storm, the wind kept disjecting leaves and dust into the air.","zh":"暴风雨中，风不断把落叶和尘土卷起吹散。"}]},{"partOfSpeech":"v.","definition":{"en":"breaking something into scattered pieces (often used in literary or formal writing).","zh":"把整体打散成零碎片段（多见于文学或正式文体）。"},"examples":[{"en":"The poet describes time as disjecting memories into fragments.","zh":"诗人把时间描写成把记忆打散成碎片。"}]}],"synonyms":["scattering","dispersing","spreading","splintering","throwing apart"],"phonetic":"/dɪsˈdʒɛktɪŋ/","extraExplanation":["“disject”很少在现代日常英语中使用，更常见的替代词有：scatter（撒开）、disperse（驱散/分散）、spread（扩散）、hurl/throw apart（抛散/扔开）。","词源来自拉丁语 disicere（dis- “分开” + iacere “投掷”），因此带有“把东西投出去并使其分开”的画面感。","相关常见拉丁短语：disjecta membra，字面是“散落的肢体/碎片”，在英语文学评论里常用来指“残存的片段（如残篇、断简）”。"]}
{"word":"disjection","summary":{"en":"“Disjection” means scattering or dispersion, often used in older or literary English.","zh":"“Disjection”指“散开、驱散、四散”，多见于较旧或文学性英语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of scattering or dispersing things; a state of being scattered","zh":"散开；驱散；（事物）四散的状态"},"examples":[{"en":"After the crash, there was a disjection of debris across the road.","zh":"碰撞之后，碎片散落在整条路上。"},{"en":"The storm caused the disjection of leaves and branches throughout the yard.","zh":"暴风雨把树叶和树枝吹得到处都是。"},{"en":"In older writing, “disjection” can describe ideas or memories scattered in the mind.","zh":"在较老的写作中，“disjection”也可形容思绪或记忆在脑海里零散分布。"}]}],"synonyms":["scattering","dispersal","dispersion","disintegration","fragmentation"],"phonetic":"/dɪsˈdʒɛkʃən/","extraExplanation":["“Disjection”是一个比较罕见、带有文学或古典色彩的词，现代英语里更常用scattering / dispersal / dispersion。","它来自拉丁语词根，含义与“throw apart（抛散、分开）”相关。你可能会看到相关的拉丁短语disjecta membra，意思是“散落的残片/残章”，常用来指作品或思想的零碎片段。"]}
{"word":"disjects","summary":{"en":"“Disjects” means “scatters/breaks apart” (rare, archaic form of the verb “disject”).","zh":"“disjects”意为“使四散/使破碎成片”（动词“disject”的罕见古体形式）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(rare/archaic) Third-person singular present of “disject”: to scatter, disperse, or break apart into separate pieces.","zh":"（罕见/古体）“disject”的第三人称单数现在时：使散开、使分散；使破碎成零散部分。"},"examples":[{"en":"The blast disjects the debris across the field.","zh":"爆炸把碎片四散抛到田野里。"},{"en":"A strong wind disjects the leaves into the street.","zh":"大风把树叶吹得散落到街上。"}]}],"synonyms":["scatters","disperses","strews","shatters","breaks apart"],"phonetic":"/dɪsˈdʒɛkt/","extraExplanation":["“disject”在现代英语里非常少见，更常见的替代表达是 scatter / disperse / break apart。","它常与拉丁语短语“disjecta membra”（意为“散落的肢体/残篇断简”）相关，用来比喻作品或信息被打散成零碎片段，常见于文学评论或学术写作。"]}
{"word":"disjeune","summary":{"en":"An archaic verb meaning “to have breakfast; to break one’s fast.”","zh":"一个古用动词，意思是“吃早餐；破斋”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Archaic) to eat the first meal of the day; to have breakfast; to break one’s fast.","zh":"（古用）吃一天的第一餐；吃早餐；结束禁食（破斋）。"},"examples":[{"en":"They rose early and disjeuned before riding out.","zh":"他们起得很早，出发前先用了早餐。"},{"en":"After the long fast, the travelers disjeuned with bread and tea.","zh":"长时间禁食后，旅人用面包和茶来破斋。"}]}],"synonyms":["have breakfast","eat breakfast","break one's fast","breakfast (as a verb)"],"phonetic":"/dɪsˈdʒuːn/","extraExplanation":["“disjeune”在现代英语里几乎不用，更多见于较早期文本。它与法语“déjeuner”（早餐/午餐，依地区而异）同源，核心概念都是“结束禁食”。现代英语通常用“have breakfast / eat breakfast / break one’s fast”。","阅读古典或历史题材作品时遇到该词，可以把它当作“to breakfast”的旧式说法来理解。"]}
{"word":"disjoin","summary":{"en":"Disjoin means to separate or disconnect something that was joined; it can also mean to form an “or” alternative in logic.","zh":"disjoin 指“使分开/断开连接”；在逻辑或语法中也可指用“或”把选项分成备选关系。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To separate or disconnect; to undo a joining so parts are no longer together.","zh":"使分开；使断开连接；把原本连在一起的东西分离开。"},"examples":[{"en":"The mechanic disjoined the hose from the engine to check for leaks.","zh":"修理工把软管从发动机上断开，检查是否漏油。"},{"en":"The two pieces look fused, but they can be disjoined with heat.","zh":"这两块看起来像焊在一起，但加热后可以分开。"}]},{"partOfSpeech":"vi.","definition":{"en":"To separate oneself; to become disconnected or to part company (less common).","zh":"（较少用）分开；脱离；不再相连或分道扬镳。"},"examples":[{"en":"After the meeting, the group disjoined and went home.","zh":"会后，大家散开回家了。"}]},{"partOfSpeech":"vt.","definition":{"en":"In logic or grammar, to separate items in a disjunction; to state alternatives using “or.”","zh":"（逻辑/语法）把事物用“或”分开列为备选项；构成“或”关系。"},"examples":[{"en":"The lawyer disjoined the options: pay the fine or go to court.","zh":"律师把选项用“或”分开：缴罚款，或者上法庭。"},{"en":"In formal writing, don’t disjoin two clauses with “or” unless they are true alternatives.","zh":"在正式写作中，除非确实是备选关系，否则不要用“or”把两个分句拆成“或”。"}]}],"synonyms":["separate","disconnect","detach","split","part","divide"],"phonetic":"/dɪsˈdʒɔɪn/","extraExplanation":["“dis-”表示“分开、否定”，“join”是“连接”。所以 disjoin 字面意思就是“把连接取消”。","现代日常英语里更常用的同义表达有：separate, disconnect, detach, split（视语境而定）。disjoin 更偏正式或学术/技术语境。","相关词：disjunction（“或”关系/析取）、conjoin（连接在一起）。"]}
{"word":"disjoinable","summary":{"en":"“Disjoinable” means able to be separated or disconnected.","zh":"“disjoinable”表示“能够被分开或断开”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be separated, disconnected, or taken apart; separable.","zh":"可分离的；可拆开的；可断开的。"},"examples":[{"en":"The two parts are disjoinable, so you can replace the broken piece easily.","zh":"这两个部件是可分离的，所以你可以很容易更换坏掉的零件。"},{"en":"In this design, the handle is disjoinable from the blade for safer storage.","zh":"这种设计里，手柄可以与刀片分离，便于更安全地收纳。"}]}],"synonyms":["separable","detachable","removable","disconnectable","divisible"],"phonetic":"/dɪsˈdʒɔɪnəbəl/","extraExplanation":["“disjoinable”由 disjoin（分开、断开）+ -able（能够……的）构成，常见于较正式或技术/法律语境。日常英语中更常用的替代表达包括：separable（可分离的）、removable（可拆卸的）、detachable（可拆开的）、disconnectable（可断开的，偏技术）。"]}
{"word":"disjoined","summary":{"en":"“Disjoined” means separated or disconnected; it can also be the past form of “disjoin.”","zh":"“disjoined”表示“分离的、不相连的”；也可作动词“disjoin”的过去式/过去分词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of things or parts) separated and no longer connected; not joined together.","zh":"（事物或部分）分离的；不相连的；脱开的。"},"examples":[{"en":"The disjoined pieces of the toy were scattered across the floor.","zh":"玩具分离的零件散落在地板上。"},{"en":"After the storm, several disjoined branches lay on the road.","zh":"暴风雨过后，路上躺着几根断裂分离的树枝。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense / past participle of “disjoin”: to separate or disconnect something that was joined.","zh":"“disjoin”的过去式/过去分词：使（原本连接的东西）分开；使脱离。"},"examples":[{"en":"The mechanic disjoined the two pipes to replace the damaged section.","zh":"修理工把两根管子拆开，以更换损坏的部分。"},{"en":"The committee disjoined the proposal into two smaller plans.","zh":"委员会把该提案拆分成两个较小的计划。"}]}],"synonyms":["separated","disconnected","detached","unlinked","parted"],"phonetic":"/dɪsˈdʒɔɪnd/","extraExplanation":["“disjoined”常见于比较正式或书面语；日常英语里更常说“separated / disconnected / taken apart”。","注意区分：\n- disjoined（分离的/被拆开的，偏“从连接状态被分开”）\n- disjoint（不连贯的、脱节的；也可指关节脱臼）\n- disjointed（表达或结构“支离破碎、不连贯的”，更常用）"]}
{"word":"disjoining","summary":{"en":"“Disjoining” means separating or disconnecting things (or, more formally, separating ideas/groups).","zh":"“Disjoining”指把东西分开/断开（也可更正式地指使想法或群体分离）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"separating things that were connected; making them no longer joined together","zh":"把原本连接在一起的东西分开；使不再相连"},"examples":[{"en":"The mechanic is disjoining the two pipes to replace the broken valve.","zh":"技师正在把两根管道分开，以更换坏掉的阀门。"},{"en":"By disjoining the cables, they stopped power from reaching the machine.","zh":"通过把电缆断开，他们阻止了电力进入机器。"}]},{"partOfSpeech":"v.","definition":{"en":"(more formal/technical) causing ideas, groups, or events to become separate or unrelated","zh":"（较正式/技术用法）使想法、群体或事件分离；使彼此不再相关"},"examples":[{"en":"The new policy is disjoining local teams from the central office’s control.","zh":"新政策正在让地方团队脱离总部的控制。"},{"en":"The editor avoided disjoining the main argument from its supporting evidence.","zh":"编辑避免让主要论点与支撑证据脱节。"}]}],"synonyms":["separating","disconnecting","unlinking","detaching","splitting"],"phonetic":"/dɪsˈdʒɔɪnɪŋ/","extraExplanation":["“disjoining”来自动词“disjoin”（dis- 表示“分开/否定” + join “连接”）。它比更常见的“separate / disconnect”更正式、偏书面或技术语境。","注意区分：disjoin（动词：使分开） vs. disjoint（形容词：不连贯的、脱节的）。例如：a disjointed story（一个不连贯的故事）。"]}
{"word":"disjoins","summary":{"en":"“Disjoins” means separates or disconnects things that are joined; in formal logic, it can mean linking alternatives with “or.”","zh":"“Disjoins”表示把连接在一起的东西分开或断开；在逻辑等较正式语境中，也可指用“or”表达备选关系。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(third-person singular of “disjoin”) to separate things that are joined; to disconnect or detach.","zh":"（“disjoin”的第三人称单数）把连接在一起的东西分开；断开、拆开。"},"examples":[{"en":"The mechanic disjoins the two pipes before replacing the valve.","zh":"修理工先把两根管子拆开，再更换阀门。"},{"en":"A simple pull disjoins the clasp and opens the bracelet.","zh":"轻轻一拉就能把扣子拉开，手链就打开了。"}]},{"partOfSpeech":"v.","definition":{"en":"(formal, logic/grammar) to express or treat ideas as separated alternatives (often using “or”).","zh":"（较正式；逻辑/语法）把观点表达为互斥或可选的“要么……要么……”关系（常用“or”）。"},"examples":[{"en":"In logic, the statement disjoins two possibilities with “or.”","zh":"在逻辑中，这个陈述用“or”把两种可能性并列为备选。"},{"en":"The rule disjoins the options: you can submit online or by mail.","zh":"这条规定把选项分开：你可以在线提交，或邮寄提交。"}]}],"synonyms":["separates","disconnects","detaches","splits","divides"],"phonetic":"/dɪsˈdʒɔɪnz/","extraExplanation":["“disjoin”较少用于日常口语，更常见的近义表达是“separate / disconnect / detach”。在法律或技术写作中会更常见。","与“disjointed（不连贯的/零散的）”同源；逻辑里的“disjunction（析取）”指用“or”连接的命题关系。"]}
{"word":"disjoint","summary":{"en":"Disjoint means “not connected or coherent,” and in math/logic it means “having no overlap.”","zh":"disjoint 表示“彼此不相连/不连贯”，在数学或逻辑中指“互不相交、没有重叠”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not connected or not fitting together; separate and not forming a whole.","zh":"不相连的；不连贯的；彼此脱节的，无法构成整体的。"},"examples":[{"en":"The report felt disjoint, as if different people wrote different sections without coordinating.","zh":"这份报告读起来很不连贯，像是不同的人各写各的部分却没有协调。"},{"en":"After the accident, his memories were disjoint and hard to piece together.","zh":"事故之后，他的记忆变得零碎脱节，很难拼凑起来。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Math/logic) Having no elements in common; not overlapping.","zh":"（数学/逻辑）互不相交的；没有共同元素的。"},"examples":[{"en":"Two sets are disjoint if they share no members.","zh":"如果两个集合没有任何共同元素，就称它们互不相交。"},{"en":"In the diagram, the two circles are disjoint and never overlap.","zh":"在图中，这两个圆彼此不相交，完全不重叠。"}]}],"synonyms":["separate","unconnected","disconnected","incoherent","disjointed","nonoverlapping"],"phonetic":"/dɪsˈdʒɔɪnt/","extraExplanation":["“dis-”表示“分开/否定”，“joint”来自“连接、关节”的意思，所以 disjoint 的核心感觉是“原本应连在一起的东西却没连上”。常见搭配：disjointed narrative（支离破碎的叙事）、disjointed conversation（断断续续/不连贯的对话）。","在日常英语里更常见的是 disjointed（不连贯的、零散的），语气比 disjoint 更口语化；但在数学/逻辑里更常用 disjoint。"]}
{"word":"disjointed","summary":{"en":"Disjointed describes something that is not smoothly connected—either in ideas (hard to follow) or in physical parts (separated).","zh":"disjointed 指“缺乏连接与连贯”，可形容思路/叙述跳跃难懂，或物理上分离、脱节。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not connected or not forming a smooth, logical whole; jumping from one idea or part to another.","zh":"不连贯的；不成整体的；东一块西一块的（思路或内容跳跃）"},"examples":[{"en":"His explanation was disjointed, so I couldn’t follow the main point.","zh":"他的解释很不连贯，所以我抓不住重点。"},{"en":"The movie feels disjointed, as if several scenes were missing.","zh":"这部电影给人感觉很割裂，好像缺了好几段情节。"},{"en":"She gave a disjointed account of what happened because she was still in shock.","zh":"她因为还处在震惊中，对发生的事说得断断续续、不太连贯。"}]},{"partOfSpeech":"adj.","definition":{"en":"Physically separated or disconnected; not joined together.","zh":"分离的；脱节的；不相连的（物理上）"},"examples":[{"en":"The disjointed pieces didn’t fit until we found the missing part.","zh":"这些分离的零件怎么也拼不上，直到我们找到了缺失的那一块。"},{"en":"A disjointed rail can cause serious accidents.","zh":"脱节的铁轨可能导致严重事故。"}]}],"synonyms":["incoherent","fragmented","disconnected","rambling","scattered"],"phonetic":"/dɪsˈdʒɔɪntɪd/","extraExplanation":["词源上来自 dis-（否定/分开）+ joint（连接处、关节），所以核心感觉是“没有被好好连接起来”。常用来形容：①文章/叙述/对话的逻辑不连贯；②组织、计划各部分彼此脱节。","近义词对比：disjointed（强调“缺乏连接与连贯”）；incoherent（更强调“表达混乱、难以理解”）；fragmented（强调“碎片化”，但不一定逻辑混乱）。"]}
{"word":"disjointedly","summary":{"en":"“Disjointedly” means “in a disconnected, unorganized way.”","zh":"“disjointedly”表示“以脱节、不连贯、缺乏组织的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a disconnected or uncoordinated way; not smoothly linked together (in speech, writing, actions, or ideas).","zh":"以不连贯、不协调的方式；（讲话、写作、行动或想法）彼此脱节、不顺畅地连接在一起。"},"examples":[{"en":"He explained the plan disjointedly, jumping from one idea to another.","zh":"他不连贯地解释计划，从一个想法跳到另一个想法。"},{"en":"The story is told disjointedly, so it can be hard to follow.","zh":"这个故事叙述得很零散，因此可能不太好理解。"}]}],"synonyms":["incoherently","unconnectedly","fragmentedly","unsystematically"],"phonetic":"/dɪsˈdʒɔɪn.tɪd.li/","extraExplanation":["“disjointedly”来自“disjointed”（不连贯的、脱节的）+ “-ly”（副词后缀），常用来描述表达方式：比如说话断断续续、观点缺乏组织，或叙事结构碎片化。","语感上它比“not clearly”更强调“各部分之间缺少连接”，不仅是不清楚，还可能是“拼不起来的碎片感”。"]}
{"word":"disjointedness","summary":{"en":"Disjointedness means a lack of connection or smooth flow, making something feel fragmented or hard to follow.","zh":"Disjointedness 指缺乏衔接与连贯，使内容显得零散破碎、不易理解。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The quality of being disjointed: lacking clear connection, smooth flow, or logical order; feeling broken into separate parts.","zh":"支离破碎（性）；缺乏连贯性、衔接不顺或逻辑不清的状态；给人零散分裂的感觉。"},"examples":[{"en":"Readers complained about the disjointedness of the plot and couldn’t follow the timeline.","zh":"读者抱怨情节很支离破碎，跟不上时间线。"},{"en":"The disjointedness of his speech made it hard to understand his main point.","zh":"他讲话缺乏连贯性，让人很难抓住重点。"},{"en":"The film’s disjointedness felt intentional, like a series of memories rather than one story.","zh":"这部电影的碎片感像是刻意为之，更像一连串回忆而不是一个完整故事。"}]}],"synonyms":["lack of coherence","incoherence","fragmentation","discontinuity","brokenness"],"phonetic":"/dɪsˈdʒɔɪntɪdnəs/","extraExplanation":["“disjointedness”来自形容词“disjointed”（不连贯的）+ 名词后缀“-ness”（表示“……的状态/性质”）。常用在写作、演讲、叙事结构、思维表达等语境中。","近义表达常见有：lack of coherence（缺乏连贯性）、fragmentation（碎片化）、discontinuity（不连续）。在文学与电影评论里，有时“disjointedness”也可能是艺术手法，用来表现记忆跳跃、创伤体验或意识流。"]}
{"word":"disjointing","summary":{"en":"“Disjointing” means separating or disconnecting parts (often at a joint), and less commonly making something feel disconnected or not coherent.","zh":"“disjointing”指把部分拆开或断开连接（常指在连接处），较少也可指让内容显得不连贯。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “disjoint”) separating something at a joint; disconnecting or taking apart so the parts no longer fit together.","zh":"（“disjoint”的现在分词）把某物从连接处拆开；使脱臼/断开；使各部分不再连接在一起。"},"examples":[{"en":"The mechanic is disjointing the pipe to replace a broken valve.","zh":"修理工正在把管道接开，以更换坏掉的阀门。"},{"en":"Be careful when disjointing the frame, or you may bend the metal.","zh":"拆开框架时要小心，否则你可能会把金属弄弯。"}]},{"partOfSpeech":"v.","definition":{"en":"(less common) making something feel disconnected, awkward, or not well organized.","zh":"（不太常见）使表达或结构显得不连贯、不自然、零散。"},"examples":[{"en":"Switching topics too quickly is disjointing the flow of your speech.","zh":"话题切换太快会让你的演讲变得不连贯。"},{"en":"The added scenes are disjointing the story instead of strengthening it.","zh":"新增的场景没有强化故事，反而让故事更零散。"}]}],"synonyms":["separating","disconnecting","taking apart","unfastening","disassembling"],"phonetic":"/dɪsˈdʒɔɪntɪŋ/","extraExplanation":["“disjointing”在日常英语里不算常用；更常见的说法是用动词“disjoint”或形容词“disjointed”（不连贯的）。","数学里更常见的是形容词“disjoint”（不相交的/不重叠的），例如“disjoint sets（不相交集合）”；这和“disjointing（正在拆开/使断开）”的用法不同。"]}
{"word":"disjointly","summary":{"en":"“Disjointly” means “separately, without connection,” and in math it can mean “without overlap.”","zh":"“disjointly”表示“彼此分离、互不相连地”，在数学中可表示“互不重叠地（不相交地）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that is separate and not connected; independently.","zh":"以彼此分离、互不相连的方式；独立地。"},"examples":[{"en":"The two teams worked disjointly, with little communication.","zh":"两个团队各自为政，几乎没有沟通。"},{"en":"These facts are presented disjointly, so the argument feels unclear.","zh":"这些事实被零散地呈现，所以论证显得不清晰。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Math/logic) In a way that has no overlap or shared members.","zh":"（数学/逻辑）以互不重叠、没有共同元素的方式。"},"examples":[{"en":"The sets are disjointly defined, so no element can belong to both.","zh":"这些集合被定义为互不相交，因此任何元素都不可能同时属于两者。"},{"en":"The events occur disjointly, meaning they cannot happen at the same time.","zh":"这些事件是互斥发生的，也就是说它们不可能同时发生。"}]}],"synonyms":["separately","independently","apart","disconnectedly","without overlap"],"phonetic":"/dɪsˈdʒɔɪntli/","extraExplanation":["“disjointly”来自形容词“disjoint”（分离的、不连贯的、数学上不相交的）+ 副词后缀“-ly”。在日常写作中更常见的是用“separately / independently / without overlap”来表达，除非你想要更正式或更偏学术的语气。","常见搭配：work disjointly（各自为政）、present ideas disjointly（观点表达得零散）、disjointly defined sets（互不相交地定义的集合）。"]}
{"word":"disjointness","summary":{"en":"Disjointness means being separate or having no overlap; in math, it means two sets/events share no common elements.","zh":"Disjointness 指彼此分离或不重叠；在数学中指两个集合/事件没有共同元素（互斥、不相交）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of being separate, not connected, or having no overlap","zh":"不相交；不重叠；彼此分离的状态"},"examples":[{"en":"There is a disjointness between what the company promises and what it delivers.","zh":"公司承诺的内容和实际交付之间存在脱节。"},{"en":"The disjointness of the two groups made cooperation difficult.","zh":"两组人彼此分离的状态让合作变得困难。"}]},{"partOfSpeech":"n.","definition":{"en":"(math/logic) the property of two sets or events having no elements in common","zh":"（数学/逻辑）互斥性；两个集合或事件没有共同元素的性质"},"examples":[{"en":"A and B have disjointness if they share no members.","zh":"如果集合A和B没有共同元素，它们就是不相交的。"},{"en":"To prove disjointness, show that no value can satisfy both conditions at the same time.","zh":"要证明互斥性，就要说明不存在任何值能同时满足两个条件。"}]}],"synonyms":["separation","disconnect","lack of overlap","mutual exclusivity","disjunction"],"phonetic":"/dɪsˈdʒɔɪntnəs/","extraExplanation":["“disjointness”来自形容词“disjoint”（不相连的、不相交的）+ 名词后缀“-ness”（表示“……的状态/性质”）。日常写作中，更常见的表达是“a disconnect (between A and B)”或“lack of connection”。在数学里则更常用“disjoint”（形容词）或“disjointness”（名词）。"]}
{"word":"disjoints","summary":{"en":"“Disjoints” means separates what is joined (sometimes causing a dislocation) or makes something feel disconnected and not coherent.","zh":"“disjoints”表示把连接的部分分开（也可指脱臼/错位），或使表达/结构变得支离破碎、不连贯。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to separate or disconnect parts that are joined; to take something out of alignment or out of its proper joint","zh":"使（连接的部分）脱开；使脱臼；使错位"},"examples":[{"en":"The fall disjoints his shoulder, and he can’t lift his arm.","zh":"那次摔倒使他的肩膀脱臼，他抬不起手臂。"},{"en":"Rough handling can disjoint the pipe from the fitting.","zh":"粗暴操作可能会让管子从接头处脱开。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something feel disconnected, incoherent, or not smoothly organized (often used in writing, speech, or storytelling)","zh":"使（表达/叙述/结构）支离破碎、不连贯"},"examples":[{"en":"Too many flashbacks disjoints the story and confuses readers.","zh":"太多倒叙会让故事变得不连贯，让读者困惑。"},{"en":"Stress sometimes disjoints his thoughts when he speaks.","zh":"压力有时会让他说话时思路断裂。"}]}],"synonyms":["disconnects","separates","unjoins","dislocates","throws out of joint","disrupts","fragmentes"],"phonetic":"/dɪsˈdʒɔɪnts/","extraExplanation":["“disjoints”通常是动词“disjoint”的第三人称单数（he/she/it disjoints），也可能是复数名词用法很少见。学习时可记词根：dis-（分开）+ joint（连接/关节），核心意思就是“把连接打断”。"]}
{"word":"disjointure","summary":{"en":"Disjointure is a rare noun meaning a break or lack of connection; historically it can also mean a joint dislocation.","zh":"Disjointure 是一个较少见的名词，主要指“脱节/断裂/不连贯”；较古老用法还可指“关节脱位”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a separation, break, or lack of connection between parts; a state of being disjointed","zh":"脱节；分离；不连贯（指各部分之间缺乏连接或出现断裂）"},"examples":[{"en":"There is a disjointure between what the policy promises and what people experience in daily life.","zh":"这项政策的承诺与人们的日常体验之间存在脱节。"},{"en":"The essay feels confusing because of the disjointure between its paragraphs.","zh":"这篇文章让人困惑，因为段落之间不连贯。"}]},{"partOfSpeech":"n.","definition":{"en":"a dislocation or disruption of a joint (an older, rare sense)","zh":"关节脱位；关节错位（较古老、较少见的用法）"},"examples":[{"en":"The old medical text describes a disjointure of the shoulder after a fall.","zh":"那本旧医书描述了跌倒后肩部关节脱位。"}]}],"synonyms":["disjunction","disconnect","separation","rupture","dislocation","lack of coherence"],"phonetic":"/dɪsˈdʒɔɪn.tʃɚ/","extraExplanation":["“disjointure”在现代英语中非常少见，更常用的替代词是“disjunction”（脱节/分离）、“disconnect”（断开/脱节）、“dislocation”（脱位/错位）或“lack of coherence”（不连贯）。","词形可以拆解理解：dis-（否定、分开）+ joint（连接、关节）+ -ure（名词后缀，表示结果/状态），整体意思就是“连接被打断后的状态”。"]}
{"word":"disjudication","summary":{"en":"“Disjudication” is a rare noun meaning a wrong judgment or misjudgment.","zh":"“disjudication”是一个罕用名词，意为“误判、判断失误”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) a wrong judgment; an act of judging something incorrectly.","zh":"（罕用）误判；判断错误的行为或结果。"},"examples":[{"en":"The committee’s disjudication led to an unfair decision.","zh":"委员会的误判导致了一个不公平的决定。"},{"en":"It was a simple disjudication based on incomplete information.","zh":"这只是基于信息不完整而产生的简单误判。"}]}],"synonyms":["misjudgment","error in judgment","wrong decision","misappraisal"],"phonetic":"/ˌdɪsˌdʒuː.dɪˈkeɪ.ʃən/","extraExplanation":["“disjudication”在现代英语中非常少见，更常用的说法是“misjudgment / misjudgement（误判）”或“error in judgment（判断失误）”。","词形上可理解为 dis-（表示“相反/不好”）+ judic-（与“判断、司法”有关，如 judge, judicial）+ -ation（名词后缀），整体表示“错误的判断”。在正式写作中通常建议改用更常见的词以避免读者困惑。"]}
{"word":"disjunct","summary":{"en":"“Disjunct” is mainly a grammar term for sentence-comment words like “fortunately” or “frankly.” It can also mean “separated/disconnected” (less common).","zh":"“disjunct” 主要是语法术语，指像 fortunately、frankly 这类对整句进行评论的“评注成分”。它也可指“分离的/不相连的”（较少见）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Grammar) Used to describe a word or phrase (often an adverbial) that comments on the whole sentence rather than linking ideas; a “sentence comment” like “fortunately,” “frankly,” or “in my opinion.”","zh":"（语法）指一个词或短语（常为副词/副词短语）用来评论整句话的态度、观点或说话方式，而不是连接句子内容；相当于“句子评注”如 fortunately, frankly, in my opinion。"},"examples":[{"en":"Fortunately, no one was hurt.","zh":"幸运的是，没有人受伤。"},{"en":"Frankly, I don’t agree with that plan.","zh":"坦白说，我不同意那个计划。"},{"en":"In my opinion, this book is worth reading.","zh":"在我看来，这本书值得读。"}]},{"partOfSpeech":"n.","definition":{"en":"A disjunct element in a sentence (especially an adverbial) that expresses the speaker’s attitude or comment on the statement.","zh":"（语法）句子中的“评注成分”（尤其是副词性成分），用来表达说话者对陈述内容的态度或评论。"},"examples":[{"en":"In “Sadly, they left early,” “sadly” is a disjunct.","zh":"在 “Sadly, they left early”（遗憾的是，他们早早离开了）里，sadly 是一个 disjunct。"},{"en":"Many disjuncts are placed at the beginning of a sentence.","zh":"许多 disjunct 常放在句首。"}]},{"partOfSpeech":"adj.","definition":{"en":"Separated; disconnected; not joined (less common in everyday English).","zh":"分离的；不相连的；不连接的（在日常英语中较少见）。"},"examples":[{"en":"The report described the two events as disjunct rather than related.","zh":"报告把这两件事描述为彼此分离、而非相关。"}]}],"synonyms":["sentence adverb","parenthetical","comment adverbial","disconnected","separate","unrelated"],"phonetic":"/dɪsˈdʒʌŋkt/","extraExplanation":["在英语语法里，disjunct 常和 conjunct 对比：conjunct（连接成分）用于衔接和组织信息（如 however, therefore, for example）；disjunct（评注成分）用于表达态度、立场或说话方式（如 fortunately, frankly, honestly）。","词源上 dis- 表示“分开/否定”，-junct 来自拉丁语“连接”。因此 disjunct 的核心感觉是“不连接在一起”，语法意义上就发展为“与句子内容不直接相连，而是对整句作评论”。"]}
{"word":"disjunction","summary":{"en":"Disjunction means either a separation or a choice, and in logic it specifically means “or.”","zh":"Disjunction 指“分离/脱节”或“二选一等选择”，在逻辑中专指“或（A 或 B）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A choice between two or more things; the act of separating or setting apart.","zh":"两者或多者之间的选择；分离、分开的行为。"},"examples":[{"en":"There is a disjunction between what he promises and what he actually does.","zh":"他承诺的事情和实际做的事情之间存在脱节。"},{"en":"The report shows a disjunction between the company’s values and its workplace culture.","zh":"报告显示公司价值观与职场文化之间存在不一致/脱节。"}]},{"partOfSpeech":"n.","definition":{"en":"(Logic/grammar) A connection that means “or,” where at least one of the parts is true (A or B).","zh":"（逻辑/语法）“或”的连接关系：A 或 B（通常表示至少一个为真）。"},"examples":[{"en":"In logic, “A or B” is a disjunction.","zh":"在逻辑中，“A 或 B”就是一个析取（disjunction）。"},{"en":"The sentence uses disjunction: “You can email me or call me.”","zh":"这句话使用了“或”的并列：你可以给我发邮件或给我打电话。"}]}],"synonyms":["separation","disconnect","gap","mismatch","either-or","alternation"],"phonetic":"/dɪsˈdʒʌŋkʃən/","extraExplanation":["在日常英语里，disjunction 常用来表示“脱节/不一致”（a disjunction between A and B），语气比 mismatch 更正式，常见于新闻、学术、职场写作。","逻辑里常见区分：inclusive or（包含或，至少一个为真）与 exclusive or（排他或，只能一个为真）。英语口语中的 or 有时靠语境决定是否“排他”。"]}
{"word":"disjunctions","summary":{"en":"Disjunction(s) means a separation or lack of connection, and in logic it means an “A or B” (OR) statement.","zh":"disjunction(s) 指“分离/脱节”，在逻辑中指“或（A OR B）”的命题形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of separating things or the state of being separated; a break or lack of connection","zh":"分离；脱节；断裂（事物彼此不相连的状态）"},"examples":[{"en":"There is a disjunction between what the company promises and what it delivers.","zh":"这家公司承诺的内容与实际交付之间存在脱节。"},{"en":"The sudden disjunction of the two groups made teamwork difficult.","zh":"两组人突然分开，使合作变得困难。"}]},{"partOfSpeech":"n.","definition":{"en":"in logic, an “either A or B” statement (A OR B), where at least one part is true","zh":"（逻辑）析取，“A 或 B”（A OR B）的命题形式，至少有一项为真"},"examples":[{"en":"In a disjunction like “It is raining or it is snowing,” the statement is true if either part is true.","zh":"在“在下雨或在下雪”这样的析取中，只要其中一部分为真，这个命题就为真。"},{"en":"The symbol ∨ is often used to show disjunction in formal logic.","zh":"在形式逻辑中，符号 ∨ 常用来表示析取。"}]},{"partOfSpeech":"n.","definition":{"en":"in grammar and writing, the use of “or” to connect alternatives","zh":"（语法/写作）用 “or” 连接备选项的表达方式"},"examples":[{"en":"The disjunction “tea or coffee” offers a choice.","zh":"“茶或咖啡”这种析取表达提供了选择。"},{"en":"Too many disjunctions can make a sentence feel unsure or messy.","zh":"句子里 “or” 太多会让语气显得不确定或凌乱。"}]}],"synonyms":["separation","disconnect","gap","break","division","OR"],"phonetic":"/dɪsˈdʒʌŋkʃən/","extraExplanation":["“disjunction” 来自拉丁语 dis-（分开）+ jungere（连接），字面含义是“把连接拆开”。因此它既可用于日常语境（表示“脱节/不一致”），也可用于逻辑学（表示“或”这种连接方式）。","逻辑里的 disjunction 通常指“包含性或”（inclusive OR）：A 或 B 至少一个为真即可为真；若强调“只能二选一”，英语常说 exclusive or，口语里也会用 either...or... 来表达更强的二选一感觉（但是否排他仍需看上下文）。"]}
{"word":"disjunctive","summary":{"en":"Disjunctive means “either/or”—separating options (especially in grammar and logic), and more broadly can describe writing or ideas that feel disconnected.","zh":"Disjunctive 指“要么/或者”的析取关系（常用于语法与逻辑，强调选项分离），也可泛指表达或思路不连贯、彼此分开的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Grammar/logic) showing separation or an “either…or” choice; expressing alternatives rather than combination.","zh":"（语法/逻辑）表示分离或“要么……要么……”的选择；强调替代关系而非并列/结合。"},"examples":[{"en":"In the sentence “You can call me or email me,” “or” is a disjunctive conjunction.","zh":"在句子“You can call me or email me”中，“or”是表示二选一的析取连词。"},{"en":"The rule is disjunctive: either you submit the form today or you lose your spot.","zh":"这条规则是析取式的：要么你今天交表，要么你就失去名额。"}]},{"partOfSpeech":"adj.","definition":{"en":"(More general) disconnected; not joined smoothly, so ideas or parts feel separate.","zh":"（更一般）不连贯的；衔接不顺，使观点或部分显得彼此分离。"},"examples":[{"en":"Her talk felt disjunctive, jumping from topic to topic without clear links.","zh":"她的演讲显得不连贯，在不同话题间跳来跳去，缺少清晰连接。"},{"en":"The movie’s disjunctive scenes were intentional, creating a dreamlike mood.","zh":"电影中刻意安排了分离式的场景，营造出梦境般的氛围。"}]}],"synonyms":["either-or","alternative","separating","disconnected","fragmented"],"phonetic":"/dɪsˈdʒʌŋk.tɪv/","extraExplanation":["“disjunctive”常见于逻辑学：与“conjunctive（合取的）”相对。合取强调“and（并且）”，析取强调“or（或者）”。","在英语语法里，“or”通常是最典型的 disjunctive（析取）连接词；在写作中使用 disjunctive 结构往往会让语气更像在提出选择、条件或对比。"]}
{"word":"disjunctively","summary":{"en":"Disjunctively means “in an ‘either/or’ way,” treating options as alternatives rather than combined.","zh":"disjunctively 指“以‘或/二选一（或多选一）’的方式”，把选项当作替代关系而不是并列关系。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that presents alternatives as separate options (using “or” rather than “and”).","zh":"以“或”的方式；把选择当作彼此分开的选项来表达（强调二选一/多选一，而非并列）。"},"examples":[{"en":"The contract lists the services disjunctively: you can choose A or B.","zh":"合同以“或”的方式列出服务：你可以选择A或B。"},{"en":"In everyday speech, people often use “or” disjunctively to show a choice.","zh":"在日常口语中，人们常用“or”来表示选择（即不同时成立）。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Logic/grammar) In a way that follows the logic of a disjunction—typically meaning at least one of the options is true.","zh":"（逻辑/语法）以析取（disjunction）的方式；通常表示至少有一个选项为真。"},"examples":[{"en":"The statement “P or Q” is interpreted disjunctively in formal logic.","zh":"在形式逻辑中，“P or Q”通常按析取来理解。"},{"en":"Some “or” sentences can be inclusive, depending on context, even when read disjunctively.","zh":"即使按析取来读，“or”句在语境中也可能是包容性的（可两者都成立）。"}]}],"synonyms":["alternatively","either-or (informal)","as an alternative"],"phonetic":"/dɪsˈdʒʌŋk.tɪv.li/","extraExplanation":["“disjunctively”来自形容词“disjunctive（析取的；用or连接的）”。在英语里，“or”既可能是排他性（A或B但不同时），也可能是包容性（A或B或两者都行）。而“disjunctively”常用来强调“把它当作or的两种/多种选项来理解”。","常见搭配：interpret/read/understand X disjunctively（把X按“或”的方式来解读）。在写法律条文、合同条款、规则说明时，这个词比较常见。"]}
{"word":"disjunctor","summary":{"en":"A technical term for an “or” connective (like “or” or the symbol “∨”) that links alternatives.","zh":"表示“或”的连接词/符号（如“or”或“∨”），用于连接备选项的术语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Logic/Linguistics) A word, symbol, or operator that joins alternatives in a disjunction; a disjunctive connective meaning “or.”","zh":"（逻辑/语言学）表示“或”的连接成分；用来连接备选项的析取连接词/算子。"},"examples":[{"en":"In logic, “∨” is the standard disjunctor, read as “or.”","zh":"在逻辑中，“∨”是常见的析取连接符，读作“或”。"},{"en":"In the sentence “Tea or coffee?”, “or” works as the disjunctor.","zh":"在句子“Tea or coffee?”里，“or”充当析取连接词。"},{"en":"The disjunctor links two choices without saying which one is true by itself.","zh":"析取连接成分把两个选项连接起来，但并不单独说明哪一个为真。"}]}],"synonyms":["disjunctive connective","disjunctive conjunction","logical OR","disjunction operator"],"phonetic":"/dɪsˈdʒʌŋktər/","extraExplanation":["“disjunctor”多见于逻辑学、形式语义学或语法学的术语体系，日常英语里更常直接说“or”或“disjunctive (conjunction/connective)”。","在形式逻辑里，析取（disjunction）常用符号“∨”表示；它的真假规则通常是：只要至少一个命题为真，整体就为真。要表达“二选一且不能同时成立”的“要么……要么……”，英语常用“either … or …”，逻辑上对应“exclusive or (XOR)”。"]}
{"word":"disjuncts","summary":{"en":"“Disjuncts” can mean (1) sentence-level comment words like “frankly” in grammar, or (2) the options joined by “or” in logic.","zh":"“Disjuncts”可指（1）语法中对整句作评论的离句成分，如 frankly；或（2）逻辑/语言学中由“or（或）”连接的各个备选项（析取支）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Grammar) a word or phrase that comments on the whole sentence (often expressing the speaker’s attitude), rather than linking to the grammar of the clause; also called a sentence adverbial.","zh":"（语法）离句成分：对整句进行评论或表达说话人态度的词/短语，通常不直接参与句子内部的语法结构；也常称“句子状语/评注性状语”。"},"examples":[{"en":"Frankly, I don’t agree with the plan.","zh":"坦白说，我不同意这个计划。"},{"en":"Luckily, no one was hurt in the accident.","zh":"幸运的是，事故中没有人受伤。"},{"en":"To be honest, I forgot your name.","zh":"说实话，我忘了你的名字。"}]},{"partOfSpeech":"n.","definition":{"en":"(Logic / linguistics) alternatives that are connected by “or”; the separate options in a disjunction.","zh":"（逻辑/语言学）析取支：由“or（或）”连接的备选项；析取式中的各个选项。"},"examples":[{"en":"In the statement “A or B,” A and B are disjuncts.","zh":"在“A 或 B”这个命题里，A 和 B 都是析取支（disjuncts）。"},{"en":"The sentence “tea or coffee” has two disjuncts.","zh":"“茶或咖啡”包含两个析取支。"}]}],"synonyms":["sentence adverbials","comment clauses","alternatives","options"],"phonetic":"/dɪsˈdʒʌŋkts/","extraExplanation":["在英语写作里，disjunct（离句成分）常用来表达说话人的态度、评价或信息来源，比如 frankly（坦白说）、fortunately（幸运的是）、probably（很可能）、in my opinion（在我看来）。它们往往可以放在句首、句中或句末，常用逗号与主句隔开。","不要把 disjunct 和 conjunct 混淆：conjunct（连接成分）主要用来连接上下文逻辑关系，如 however（然而）、therefore（因此）、for example（例如）。"]}
{"word":"disjuncture","summary":{"en":"Disjuncture means a gap or disconnect—a lack of smooth connection between things.","zh":"Disjuncture 指“脱节/不连贯”，即事物之间缺乏顺畅衔接的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a separation, gap, or clear lack of connection between things (such as ideas, groups, events, or time periods)","zh":"（事物之间的）脱节、不连贯、断裂；隔阂"},"examples":[{"en":"There is a disjuncture between what the policy promises and what people experience in daily life.","zh":"这项政策的承诺与人们的日常体验之间存在脱节。"},{"en":"The novel highlights the disjuncture between the city’s wealth and the poverty at its edges.","zh":"这部小说凸显了城市的富裕与边缘地区的贫困之间的断裂。"}]}],"synonyms":["disconnect","gap","mismatch","divide","rift"],"phonetic":"/dɪsˈdʒʌŋk.tʃɚ/","extraExplanation":["“disjuncture”较常见于学术写作（社会学、政治学、文化研究等），用来强调“结构性/系统性的不连续”或“彼此无法衔接”的状态，比“gap”更正式、更抽象。","词源上与“dis-（分开）”和“juncture（连接点、关节；接合处）”相关，可联想为“连接被打断”。","常见搭配：a disjuncture between A and B；cultural/political/economic disjuncture。写作中也常用更常见的替换词：disconnect, mismatch, gap, divide。"]}
{"word":"disjune","summary":{"en":"“Disjune” is a rare/old word meaning “to separate” or “separated; not connected.”","zh":"“disjune”是罕见/偏古旧的词，表示“使分离”，或“分离的；不相连的”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to separate; to disjoin (to break a connection or join).","zh":"分开；使脱离连接；使分离（=disjoin）。"},"examples":[{"en":"The report uses the term “disjune,” meaning to separate two ideas that were previously linked.","zh":"这份报告用到“disjune”一词，意思是把先前联系在一起的两个观点分开。"},{"en":"In older writing, some authors said the river disjuned the two villages.","zh":"在较早的写作里，有些作者会说这条河把两个村庄“disjuned（分隔开）”。"}]},{"partOfSpeech":"adj.","definition":{"en":"separated; disjoined (not connected).","zh":"分离的；脱节的；不相连的。"},"examples":[{"en":"His argument felt disjune, jumping from one point to another without a clear link.","zh":"他的论证显得很脱节，从一个点跳到另一个点，缺乏清晰联系。"}]}],"synonyms":["disjoin","separate","disconnect","divide","detach","disjoint"],"phonetic":"/dɪsˈdʒuːn/","extraExplanation":["“disjune”在现代英语中非常少见，通常被认为是古旧或非标准用法；更常见的是“disjoin”（动词：使分离）或“disjoint(ed)”（形容词：脱节的/不连贯的）。","不要把它和“disjunct”（逻辑/语法术语，表示“析取的/分离的”）混淆；日常写作里一般用“separate / disconnect / disjoin / disjointed”更自然。"]}

