{"word":"disk","summary":{"en":"Disk most commonly means a flat, round object, or a data-storage device/medium in computing; it can also be a verb meaning to save data to a disk.","zh":"disk常指“圆盘状物体”，也常用于计算机领域表示“磁盘/硬盘（存储设备或介质）”；作动词时可表示“把数据存到磁盘上”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A flat, round object or part, often circular and fairly thin.","zh":"圆盘；扁平的圆形物体（通常较薄）。"},"examples":[{"en":"The coin is a small metal disk.","zh":"硬币是一个小的金属圆盘。"},{"en":"The doctor talked about a disk in my spine.","zh":"医生提到我脊椎里的一块椎间盘。"}]},{"partOfSpeech":"n.","definition":{"en":"A device for storing digital data (especially a hard disk or solid-state drive); also, a removable circular medium like a CD/DVD (more common in older usage).","zh":"磁盘/硬盘等存储设备；也可指可取出的光盘（如CD/DVD，较偏旧用法）。"},"examples":[{"en":"Save the file to your hard disk.","zh":"把文件保存到你的硬盘里。"},{"en":"He installed the game from a disk.","zh":"他用光盘安装了那个游戏。"}]},{"partOfSpeech":"v.","definition":{"en":"To record, store, or save information on a disk.","zh":"把信息记录/存储到磁盘上。"},"examples":[{"en":"The system automatically disks the data every night.","zh":"系统每天晚上会自动把数据存到磁盘里。"}]}],"synonyms":["disc","plate","round","hard drive","storage device"],"phonetic":"/dɪsk/","extraExplanation":["拼写提示：英式英语更常写作“disc”，尤其指CD/DVD、唱片或体育用的“铁饼”；美式英语常用“disk”，尤其在计算机领域（hard disk）。不过现代用法里两者有时会混用，具体看地区与领域习惯。","医学里的“disk”常指“椎间盘”（intervertebral disk），是脊椎骨之间起缓冲作用的软组织。"]}
{"word":"disked","summary":{"en":"“Disked” usually means “saved/stored onto a disk” or “worked the soil with a disk harrow.” Less commonly, it can mean “disk-shaped.”","zh":"“disked”通常表示“保存/存储到磁盘”或“用圆盘耙翻耕土地”；较少情况下可表示“盘状的”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of “disk”: to save, store, or record data onto a computer disk (or disk storage).","zh":"“disk”的过去式/过去分词：把数据保存、存储或记录到（电脑）磁盘/磁盘存储中。"},"examples":[{"en":"The files were disked automatically at the end of the session.","zh":"会话结束时，文件被自动保存到磁盘中。"},{"en":"Make sure your work is disked before you shut down the computer.","zh":"关机前一定要确认你的工作已经保存到磁盘里。"}]},{"partOfSpeech":"vt.","definition":{"en":"past tense/past participle of “disk”: to break up soil and remove weeds using a disk harrow (a farm tool).","zh":"“disk”的过去式/过去分词：用圆盘耙（农具）翻耕、碎土或除草。"},"examples":[{"en":"The farmer disked the field before planting corn.","zh":"农民在种玉米前用圆盘耙翻耕了田地。"},{"en":"After the rain, they disked the ground to loosen the soil.","zh":"雨后他们用圆盘耙松土。"}]},{"partOfSpeech":"adj.","definition":{"en":"having a disk/disc shape; shaped like a round plate (less common).","zh":"盘状的；圆盘形的（较少见）。"},"examples":[{"en":"Some flowers have disked centers that attract insects.","zh":"有些花有盘状的花心，会吸引昆虫。"}]}],"synonyms":["saved","stored","recorded","backed up","harrowed","tilled"],"phonetic":"/dɪskt/","extraExplanation":["“disk”与“disc”常让人混淆：美式英语更常用 disk（尤其在计算机语境），英式英语更常见 disc（如 disc brake、music disc）。因此“disked”多见于美式或计算机/农业写作中。","农业里的 disk（动词）来自 disk harrow（圆盘耙）：一排排金属圆盘切入土壤，用来碎土、翻耕、抑草，为播种做准备。"]}
{"word":"diskelion","summary":{"en":"“Diskelion” is usually a misspelling or rare variant of “triskelion,” a three-armed/three-legged symbol used in art and heraldry.","zh":"“diskelion”通常是“triskelion”的误拼或罕见变体，指一种由三条支臂/三条腿构成的符号，常见于艺术与纹章。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rare or nonstandard form of “triskelion” (also “triskele”): a symbol made of three connected spirals or three bent legs radiating from a center, used especially in ancient art and heraldry.","zh":"“triskelion / triskele（旋臂三曲纹、三旋纹）”的罕见/非标准写法：一种由三个相连的螺旋或三条弯曲的腿从中心向外放射的图案，常见于古代艺术与纹章。"},"examples":[{"en":"The flag of the Isle of Man features a triskelion (sometimes misspelled as “diskelion”).","zh":"马恩岛的旗帜上有一个 triskelion（三曲腿纹章），有时会被误写成“diskelion”。"},{"en":"In museum labels, you may see the term “triskelion” for a three-spiral motif in Celtic design.","zh":"在博物馆说明牌上，你可能会看到 “triskelion” 用来指凯尔特风格中的三旋螺旋图案。"}]}],"synonyms":["triskelion","triskele","three-spiral symbol"],"phonetic":"/traɪˈskɛliən/","extraExplanation":["“diskelion”在英语里几乎不作为标准词条出现，多数情况下是对 **triskelion** 的拼写误差或少见变体。更常用、也更容易被读者理解的写法是 **triskelion** 或 **triskele**。","词源提示：**triskelion** 来自希腊语，含义与“三个腿/三条支臂”相关（tri- 表示“三”）。该符号常与马恩岛（Isle of Man）、西西里（Sicily）的纹章传统联系在一起。"]}
{"word":"disker","summary":{"en":"“Disker” is mainly an agricultural term meaning a disk harrow (or its operator), a tool used to break up and level soil.","zh":"“disker”主要是农业用语，指圆盘耙（或其操作人员），用于翻松并平整土壤。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a machine or tool with rotating disks used to break up and smooth soil in farming (often called a “disk harrow”); sometimes the person who operates it","zh":"（农业）圆盘耙；用旋转圆盘翻松、平整土地的农具（也可指操作它的人）"},"examples":[{"en":"The farmer hooked the disker to the tractor to prepare the field.","zh":"农民把圆盘耙（disker）挂到拖拉机上，准备整理田地。"},{"en":"After plowing, they ran the disker over the soil to break up clumps.","zh":"犁完地后，他们用圆盘耙把土块打碎。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) someone or something connected with “disks,” such as a disk maker/handler; use is uncommon and usually needs context","zh":"（较少见）与“disk（磁盘/圆盘）”相关的人或物，如制作、处理磁盘的人/设备；一般需语境说明"},"examples":[{"en":"He worked as a disker in a small computer repair shop (uncommon usage).","zh":"他在一家小电脑维修店做“磁盘处理”的工作（这种说法不常见）。"}]}],"synonyms":["disk harrow","harrow","cultivator"],"phonetic":"ˈdɪskər","extraExplanation":["“disker”在现代日常英语里不常见，农业语境更可能出现；更常用的说法是“disk harrow（圆盘耙）”。","英美拼写差异：美式更常写 disk，英式常写 disc（但在计算机领域两者用法也有固定搭配，如 disk drive）。"]}
{"word":"diskery","summary":{"en":"“Diskery” isn’t standard English; it’s probably a misspelling of “discovery” (finding something for the first time).","zh":"“diskery”不是标准英语词；很可能是“discovery（发现）”的拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “discovery.”","zh":"不是标准英语单词。很可能是“discovery”的拼写错误。"},"examples":[{"en":"I couldn’t find “diskery” in a dictionary—did you mean “discovery”?","zh":"我在词典里找不到“diskery”——你是不是想写“discovery”？"}]},{"partOfSpeech":"n.","definition":{"en":"(If you meant “discovery”) the act of finding something for the first time, or something that is found.","zh":"（如果你想写“discovery”）指“发现”的行为；或“新发现的事物/发现物”。"},"examples":[{"en":"The discovery of a new planet excited the scientists.","zh":"发现一颗新行星让科学家们很兴奋。"},{"en":"Making small discoveries while reading helps you learn faster.","zh":"阅读时做一些小发现会帮助你学得更快。"}]}],"synonyms":["discovery","finding","breakthrough","revelation"],"phonetic":"/ˈdɪskəri/","extraExplanation":["“diskery”看起来像把“discovery（发现）”中的字母顺序写错了。常见正确拼写：d-i-s-c-o-v-e-r-y。","如果你是想表达和“disk（磁盘/圆盘）”有关的意思，常见词有：disk/diskette（软盘，较旧）、disc（英式常见拼写，用于光盘/体育飞盘等）。"]}
{"word":"diskette","summary":{"en":"A diskette is an old removable storage disk (a floppy disk), mainly used with earlier computers.","zh":"diskette 指早期电脑使用的可拆卸存储介质——软盘。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, removable magnetic storage disk in a square plastic case, used mainly in older computers to store and transfer files (also called a “floppy disk”).","zh":"磁盘片；软盘：一种装在方形塑料壳内、可拆卸的磁性存储介质，主要用于早期电脑中存储和传输文件（也叫“软盘”）。"},"examples":[{"en":"I found an old diskette with my school essays on it.","zh":"我找到一张旧软盘，上面存着我以前的学校作文。"},{"en":"This program was distributed on diskettes in the 1990s.","zh":"这个软件在20世纪90年代是用软盘发行的。"},{"en":"Most modern laptops don’t have a diskette drive.","zh":"大多数现代笔记本电脑都没有软盘驱动器。"}]}],"synonyms":["floppy disk","floppy","3.5-inch disk"],"phonetic":"/dɪˈskɛt/","extraExplanation":["“diskette”在美式英语里常见于1980–1990年代的语境，指3.5英寸软盘最典型；更早还有5.25英寸的软盘。如今多为怀旧、博物馆/档案、或谈论旧系统（legacy systems）时使用。","词源上是“disk + -ette”（-ette有“较小的”之意），所以字面含义接近“小磁盘”。日常更口语、更常见的说法通常是“floppy disk”。","文化小知识：许多软件里的“保存”图标至今仍是软盘的形状，即使很多学习者从未真实用过软盘。"]}
{"word":"diskettes","summary":{"en":"“Diskettes” means floppy disks—small removable magnetic disks used to store files, especially in older computers.","zh":"“Diskettes”指软盘（软磁盘）——早期电脑常用的小型可移动磁性存储介质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, removable magnetic storage device (a “floppy disk”) used to store and transfer computer files, common in the 1980s–1990s.","zh":"一种小型可拆卸的磁性存储设备（“软盘/软磁盘”），用于保存和传输电脑文件，常见于20世纪80—90年代。"},"examples":[{"en":"She saved her thesis on a stack of diskettes.","zh":"她把论文存到一叠软盘里。"},{"en":"This old software came on three diskettes.","zh":"这款老软件是用三张软盘安装的。"}]}],"synonyms":["floppy disks","floppies"],"phonetic":"/dɪˈskɛts/","extraExplanation":["“Diskette”是“disk”的指小后缀形式（-ette），语气上有“小巧/轻便”的感觉。现在更常见的说法是“floppy disk”。","软盘在当时非常重要，但容量很小：常见的3.5英寸软盘大约只有1.44MB。","许多软件里的“保存”图标之所以长得像一个小方块，就是来源于软盘；即使软盘已淘汰，这个图标仍被保留。"]}
{"word":"Diskin","summary":{"en":"“Diskin” is usually a family name (surname) and is treated as a proper noun.","zh":"“Diskin”通常是姓氏，作为专有名词使用。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a surname (family name), most often used by people of Irish or Jewish heritage; it is a proper noun and is usually not translated.","zh":"姓氏（家族名），常见于爱尔兰或犹太裔人群；属于专有名词，通常不翻译。"},"examples":[{"en":"Ms. Diskin will lead today’s meeting.","zh":"Diskin 女士将主持今天的会议。"},{"en":"I found an article by Diskin in the library database.","zh":"我在图书馆数据库里找到了一篇 Diskin 写的文章。"},{"en":"Diskin is a common last name in some communities.","zh":"Diskin 在某些社群中是比较常见的姓氏。"}]}],"phonetic":"ˈdɪskɪn","extraExplanation":["“Diskin”主要作为人名使用，因此在写作中要注意大小写（首字母大写）。","来源上常见两条线索：一是英语/爱尔兰语背景的姓氏；二是在犹太社群中也可见到该姓氏。不同家族的具体起源可能不同。","如果你是在特定文本里看到“Diskin”（例如公司名、地名或产品名），可以把原句发我，我可以帮你根据语境判断它指的是什么。"]}
{"word":"diskindness","summary":{"en":"Unkindness means cruelty or a lack of kindness in behavior or attitude.","zh":"Unkindness 指行为或态度上的不友善、刻薄或残酷。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Commonly spelled: unkindness) The quality or act of being unkind; cruelty or lack of consideration.","zh":"（常见拼写：unkindness）不友善；刻薄；缺乏体贴的行为或态度。"},"examples":[{"en":"Her unkindness hurt him more than she expected.","zh":"她的刻薄比她想象的更伤人。"},{"en":"A little kindness goes a long way, and unkindness does too.","zh":"一点善意影响很大，刻薄也一样。"},{"en":"Please don’t repay kindness with unkindness.","zh":"请不要以怨报德（用刻薄回报善意）。"}]}],"synonyms":["cruelty","meanness","harshness","unkind act","callousness"],"phonetic":"/ʌnˈkaɪndnəs/","extraExplanation":["你输入的“diskindness”不是常见英语单词。最接近、最常用的词是 **unkindness**（不友善/刻薄）。\n\n构词提示：**un-** 表示否定（not），所以 **unkindness = not kind + -ness（名词后缀，表示“……的性质/状态”）**。","在文学或正式表达里，unkindness 常用来描述“言语或行为的冷酷、缺乏怜悯”，比单纯的“not nice”更有分量。","相关表达：**acts of unkindness**（不友善的行为），**thoughtless unkindness**（不经意的刻薄），**show kindness to…**（对……表示善意）。"]}
{"word":"disking","summary":{"en":"“Disking” usually means cultivating soil with a disk (disc) harrow; it can also refer to heavy disk read/write activity in computing.","zh":"“Disking”通常指用圆盘耙进行田地翻耕碎土整地；在计算机语境中也可指磁盘读写很频繁的情况。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of breaking up and smoothing soil using a disk (disc) harrow; cultivating a field with rotating metal disks","zh":"（农）用圆盘耙翻耕、碎土、整地的过程；圆盘耙作业"},"examples":[{"en":"After harvesting corn, the farmer did some disking to prepare the field for planting.","zh":"玉米收割后，农民用圆盘耙进行了碎土整地，为播种做准备。"},{"en":"Disking helps break up clods and mix plant residue into the soil.","zh":"圆盘耙作业有助于打碎土块，并把作物残茬混入土壤中。"}]},{"partOfSpeech":"v.","definition":{"en":"(present participle of “disk”) to cultivate land with a disk harrow; to work the soil with rotating disks","zh":"（“disk”的现在分词）用圆盘耙翻耕；用圆盘状耙片整地"},"examples":[{"en":"They’re disking the field this morning.","zh":"他们今天早上在用圆盘耙整地。"},{"en":"We finished disking and then planted soybeans.","zh":"我们整地完毕后就播种了大豆。"}]},{"partOfSpeech":"n.","definition":{"en":"(computing, less common) the activity of writing, reading, or storing data on a disk","zh":"（计算机，较少见）把数据写入/读取/存储到磁盘上的操作"},"examples":[{"en":"The slowdown was caused by heavy disking during the backup.","zh":"备份期间频繁的磁盘读写导致系统变慢。"}]}],"synonyms":["harrowing","cultivating","tilling","disk-harrowing"],"phonetic":"/ˈdɪskɪŋ/","extraExplanation":["在美式农业英语里，disking 很常见，指用“圆盘耙（disk/disc harrow）”对田地进行浅层翻耕与碎土。它通常在收割后、播种前进行，用来处理残茬、平整地表。","disk 和 disc 在现代英语里常可互换：计算机领域更常写 disk（硬盘），而表示圆形物体或工具时有时会见到 disc（如 disc brake）。但 disking 这个农业用法两种拼写体系里都能见到。"]}
{"word":"diskless","summary":{"en":"“Diskless” means a computer/device has no local disk storage and relies on a network or external storage.","zh":"“diskless”指设备没有本地磁盘存储，依赖网络或外部存储来启动和保存数据。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Computing) Not having a local hard drive or other disk storage; using a network or other external source to boot and store data.","zh":"（计算机）无本地硬盘或磁盘存储；通过网络或其他外部来源启动并存取数据。"},"examples":[{"en":"Our office uses diskless workstations that boot from the server.","zh":"我们办公室使用无盘工作站，从服务器启动。"},{"en":"A diskless system can be easier to manage because updates happen centrally.","zh":"无盘系统更容易管理，因为更新可以集中进行。"}]}],"synonyms":["disk-free","thin-client (related)","network-boot (related)"],"phonetic":"/ˈdɪskləs/","extraExplanation":["“diskless”常见于IT/企业环境，例如“diskless workstation（无盘工作站）”“diskless client（无盘客户端）”。它通常意味着：设备本地几乎不存数据，依赖网络启动（如PXE）和集中存储，因此便于统一维护与安全管控，但也更依赖网络与服务器的稳定性。"]}
{"word":"disklike","summary":{"en":"“Disklike” means flat and round, like a disk.","zh":"“disklike”表示“圆盘状的”，即扁平而圆，像圆盘一样。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape of a disk (flat and round).","zh":"圆盘状的；像圆盘一样（扁平而圆）。"},"examples":[{"en":"The microscope showed a disklike cell.","zh":"显微镜显示出一种圆盘状的细胞。"},{"en":"Saturn’s rings are made of many disklike pieces of ice and rock.","zh":"土星环由许多圆盘状的冰和岩石碎片组成。"}]}],"synonyms":["disk-shaped","disc-shaped","round","circular","flat"],"phonetic":"/ˈdɪskˌlaɪk/","extraExplanation":["“disklike”（也常写作“disk-like”）由“disk（圆盘）+ -like（像……一样）”构成，常见于科学写作（如生物、医学、天文、地质），用来描述形状。美式英语中常用拼写“disk”，英式英语中也常见“disc”。"]}
{"word":"disknow","summary":{"en":"Disknow is a rare/old verb meaning “to deny knowing or to refuse to acknowledge knowledge.”","zh":"Disknow 是一个罕见/古旧动词，意思是“否认知道、拒不承认了解”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Rare/archaic) To deny knowing; to refuse to acknowledge knowledge of something.","zh":"（罕见/古旧）否认知道；拒不承认自己了解某事。"},"examples":[{"en":"He disknowed the man when questioned by the police.","zh":"被警方询问时，他否认认识那个人。"},{"en":"She disknowed any involvement in the decision.","zh":"她否认自己参与了那项决定。"}]}],"synonyms":["deny (knowing)","disavow","repudiate","deny","disclaim"],"phonetic":"/dɪsˈnoʊ/","extraExplanation":["“disknow”非常少见，多见于较早的英语或仿古/文学化写法；现代英语通常用“deny knowing”“disavow”“repudiate”“deny”来表达。","词形上可理解为“dis-（否定）+ know（知道）”，意思就是“否认知道”。如果你是在现代语境（写作、考试、日常交流）中使用，建议改用更常见的表达以避免误解。"]}
{"word":"Disko","summary":{"en":"“Disko” is a less common spelling of “disco,” referring to a disco club/party or disco music and style.","zh":"“Disko”是“disco”的较少见拼写，可指迪斯科舞厅/派对，也可指迪斯科音乐与风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A spelling variant of “disco,” meaning a nightclub or party where people dance to recorded popular music (especially 1970s disco music).","zh":"“disco”的一种拼写变体，指迪斯科舞厅/夜店，或播放流行音乐（尤指20世纪70年代迪斯科音乐）供人跳舞的派对。"},"examples":[{"en":"Let’s go to a disko tonight and dance.","zh":"我们今晚去迪斯科舞厅跳舞吧。"},{"en":"They played classic disko hits from the 1970s.","zh":"他们播放了很多20世纪70年代经典的迪斯科金曲。"}]},{"partOfSpeech":"n.","definition":{"en":"Disco music; the disco style of popular dance music and culture.","zh":"迪斯科音乐；迪斯科风格的流行舞曲与文化。"},"examples":[{"en":"She’s really into disko and funk.","zh":"她特别喜欢迪斯科和放克。"},{"en":"The movie has a strong disko vibe.","zh":"这部电影有很强的迪斯科氛围。"}]}],"synonyms":["disco","dance club","nightclub","discotheque"],"phonetic":"/ˈdɪskoʊ/","extraExplanation":["“Disko”在英语里不如“disco”常见，更多见于一些欧洲语言（如德语、北欧语言）或为了营造复古/异国风格的品牌、活动海报用法。正式写作一般用“disco”。"]}
{"word":"diskography","summary":{"en":"A diskography is the complete catalog of a musician’s released recordings.","zh":"diskography 指音乐人已发行录音作品的完整目录／作品年表。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a complete list (catalog) of all the music recordings released by a singer, band, or composer","zh":"（歌手、乐队或作曲家）全部录音作品的完整列表／目录（作品年表）"},"examples":[{"en":"I’m listening to the band’s diskography in order, from their first album to the latest.","zh":"我按顺序听这支乐队的全部作品，从第一张专辑到最新一张。"},{"en":"Her diskography includes three studio albums and several live recordings.","zh":"她的作品目录包括三张录音室专辑和几张现场录音。"}]}],"synonyms":["catalog of recordings","recording catalog","complete works (recordings)"],"phonetic":"/dɪˈskɑɡrəfi/","extraExplanation":["diskography 常用于音乐语境，强调“发行过的录音作品清单”。对应词：bibliography（书目）、filmography（电影作品表）。","拼写上有 diskography / discography 两种形式：美式更常见 disk-，英式与音乐圈里也常见 disc-；含义相同。"]}
{"word":"diskophile","summary":{"en":"A diskophile is someone who loves and often collects records, especially vinyl.","zh":"diskophile 指热爱并常常收藏唱片（尤其黑胶）的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who loves, collects, or is very enthusiastic about recorded music—especially vinyl records (LPs, singles).","zh":"唱片爱好者；（尤指）黑胶唱片收藏/发烧友"},"examples":[{"en":"He’s a diskophile who spends weekends hunting for rare jazz LPs.","zh":"他是个唱片爱好者，周末常去淘稀有的爵士黑胶。"},{"en":"Many diskophiles prefer the warm sound of vinyl over digital streaming.","zh":"许多唱片发烧友更喜欢黑胶的温暖音色，而不是数码串流。"},{"en":"The café hosts a monthly meetup for local diskophiles to trade records.","zh":"这家咖啡馆每月举办一次本地唱片爱好者聚会，大家交换唱片。"}]}],"synonyms":["discophile","record collector","vinyl enthusiast","music lover"],"phonetic":"/ˈdɪskoʊfaɪl/","extraExplanation":["“diskophile”也常拼作“discophile”。在美式英语里“disk”更常见于“disk drive”等科技语境；在音乐语境中“disc”更常见，但两者都能见到。","词尾“-phile”来自希腊语，表示“爱好者/热爱……的人”，同类词还有“cinephile（电影迷）”“bibliophile（藏书家/爱书人）”。","这个词在唱片文化（尤其是黑胶复兴、二手唱片店与唱片集市）中更常用，带有一点“发烧友/圈内人”的味道。"]}
{"word":"diskos","summary":{"en":"Diskos is an ancient Greek word referring especially to the throwing disk used in athletics, and more generally to a disc-shaped object in classical contexts.","zh":"diskos 是古希腊语词，常指古希腊竞技中用于投掷的圆盘（铁饼的前身），也可泛指古典语境中的圆盘状物体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In ancient Greek athletics, a heavy circular disk thrown in a sport similar to the modern discus throw.","zh":"古希腊竞技中使用的投掷圆盘（类似现代的掷铁饼项目中的铁饼）。"},"examples":[{"en":"The athlete practiced throwing the diskos across the field.","zh":"运动员在场地上练习投掷 diskos（古希腊投掷圆盘）。"},{"en":"In the pentathlon, one event involved the diskos.","zh":"在（古希腊）五项全能中，有一个项目与 diskos 有关。"}]},{"partOfSpeech":"n.","definition":{"en":"A disk-shaped object; the Greek word for “disc” (used mainly in historical or classical contexts).","zh":"圆盘状物体；希腊语中“圆盘/盘”的意思（多用于历史或古典语境）。"},"examples":[{"en":"The museum label used the word diskos to describe the object’s shape.","zh":"博物馆的说明牌用 diskos 来描述该物体的形状。"}]}],"synonyms":["discus","disc","throwing disk"],"phonetic":"/ˈdɪs.kɑs/","extraExplanation":["diskos 来自古希腊语 δίσκος（diskos），本义是“圆盘、盘状物”。在古希腊运动中，它特指用于投掷的圆盘，是现代“discus（铁饼）”一词的来源之一。","古典艺术中最著名的相关形象是《掷铁饼者》（Discobolus，常译“掷铁饼者”），表现的就是运动员投掷 diskos 的瞬间。"]}
{"word":"disks","summary":{"en":"“Disks” is the plural of “disk,” meaning round flat objects, especially computer storage devices/media, and sometimes circular plates used in sports or machines.","zh":"“disks”是“disk”的复数，常指圆盘状物体，尤其是计算机存储设备/介质；也可指体育或机器中的圆盘状部件。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “disk”: flat, round objects; also the data-storage devices or their circular digital media (e.g., computer hard disks, floppy disks).","zh":"“disk”的复数：扁平圆盘状物体；也指数据存储设备或圆形存储介质（如硬盘、软盘等）。"},"examples":[{"en":"This computer has two hard disks.","zh":"这台电脑有两块硬盘。"},{"en":"The files are stored on external disks.","zh":"这些文件存放在外接硬盘里。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “disk”: circular plates used in sports or science (e.g., the discus in track and field, or a disk-shaped part in a machine).","zh":"“disk”的复数：体育或科学中的圆盘状物（如田径的铁饼，或机器中的圆盘零件）。"},"examples":[{"en":"Athletes practiced throwing the disks farther each week.","zh":"运动员每周练习把铁饼（圆盘）扔得更远。"},{"en":"The technician replaced two worn disks inside the device.","zh":"技术员更换了设备里两片磨损的圆盘零件。"}]}],"synonyms":["discs","platters","drives (computing)","storage devices"],"phonetic":"/dɪsks/","extraExplanation":["“disk”和“disc”在现代英语中常可互换，但有一些常见偏好：在美式英语里，计算机存储通常写作“disk”（hard disk, disk drive）；而在音乐、体育等语境常见“disc”（compact disc, discus/disc）。不过不同品牌/领域也会有例外。"]}
{"word":"Diskson","summary":{"en":"“Diskson” is not a common English word; it is most likely a name (usually spelled Dixon/Dickson) or a rare spelling of a place name.","zh":"“Diskson”不是常见英语词，更可能是姓名（常见为 Dixon/Dickson）或某个地名的少见拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname), most commonly spelled “Dickson” or “Dixon.”","zh":"姓氏（常见拼写为 Dickson 或 Dixon）。"},"examples":[{"en":"My teacher’s last name is Dickson.","zh":"我老师的姓是 Dickson。"},{"en":"In the credits, you’ll see the name Dixon.","zh":"在片尾字幕里你会看到 Dixon 这个名字。"}]},{"partOfSpeech":"other","definition":{"en":"a possible place name or uncommon spelling variant (for example, a variant of “Dikson,” a settlement in northern Russia).","zh":"可能是地名或较少见的拼写变体（例如 Dikson：俄罗斯北部的一个定居点）。"},"examples":[{"en":"The ship passed near Dikson in the Arctic.","zh":"那艘船经过了北极附近的 Dikson。"},{"en":"Some maps may show different spellings for the same place name.","zh":"有些地图会把同一个地名写成不同拼法。"}]}],"synonyms":["Dixon","Dickson","Dikson"],"phonetic":"/ˈdɪksən/","extraExplanation":["“Diskson”不是常见英语单词，更像是专有名词（人名/姓氏或地名）的拼写。最常见的相近形式是姓氏“Dixon / Dickson”。如果你是想查某个人名、品牌名或地名，告诉我上下文（在哪看到的、属于哪国语言/地区），我可以给出更准确的释义和用法。"]}
