{"word":"disna","summary":{"en":"“disna” is a Scottish dialect form of “doesn’t.”","zh":"“disna”是苏格兰方言里“doesn’t（does not）”的说法。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Scottish / Scots dialect) a common spoken form of “doesn’t” (does not).","zh":"（苏格兰英语 / 苏格兰语方言）口语中常用的“doesn’t / does not（不；不会）”的形式。"},"examples":[{"en":"He disna want to go out tonight.","zh":"他今晚不想出门。"},{"en":"It disna matter what they say.","zh":"他们怎么说都不重要。"},{"en":"She disna know the answer yet.","zh":"她还不知道答案。"}]}],"synonyms":["doesn't","does not"],"phonetic":"ˈdɪznə","extraExplanation":["“disna”主要见于苏格兰口语与文学对白（如小说里表现地方口音）。在标准书面英语中一般不用，正式写作建议用“doesn’t”。","结构上常见于：he/she/it disna + 动词原形（如 disna know / disna want）。否定含义与 doesn’t 完全一致。"]}
{"word":"disnatural","summary":{"en":"“Disnatural” is a rare, old-fashioned adjective meaning “unnatural” or “unnaturally unloving,” especially toward family.","zh":"“disnatural”是一个少见的古义形容词，表示“不自然/反常”，也可指“对家人缺乏应有亲情与责任”的无情之人。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(archaic) Unnatural; not in accordance with nature or what is normal/expected.","zh":"（古义/少用）不自然的；违背自然规律或常理的。"},"examples":[{"en":"Some old texts describe the illness as a “disnatural heat” in the body.","zh":"一些古老文本把这种病描述为身体里的“反常热”。"},{"en":"The writer called the silence between them disnatural, as if something human were missing.","zh":"作者称他们之间的沉默“不自然”，仿佛缺少了某种人性的东西。"}]},{"partOfSpeech":"adj.","definition":{"en":"(archaic) Showing an unnatural lack of affection or duty, especially toward one’s family (e.g., a “disnatural child”).","zh":"（古义/少用）缺乏自然的亲情或责任感的，尤指对家人不孝/无情的（如“冷酷无情的孩子”）。"},"examples":[{"en":"In the play, he accuses his son of being disnatural and ungrateful.","zh":"在这部戏里，他指责儿子冷酷无情、忘恩负义。"},{"en":"She feared the village would judge her as disnatural for leaving her parents behind.","zh":"她担心村里会因为她离开父母而说她“不孝、不近人情”。"}]}],"synonyms":["unnatural","abnormal","against nature","inhuman","heartless"],"phonetic":"/dɪsˈnætʃərəl/","extraExplanation":["“disnatural”在现代英语中非常少见，多见于早期现代英语或文学语境。日常表达通常用“unnatural”“abnormal”“against nature”，或表达“对家人无情”时用“heartless”“unnatural (to one’s parents/children)”。","词形上是前缀“dis-（否定/相反）”+“natural（自然的）”，因此核心感觉是“反自然/反常”。在旧文学里也常与家庭伦理（亲情、孝道、责任）连用。"]}
{"word":"disnaturalization","summary":{"en":"Disnaturalization means taking away someone’s citizenship, especially citizenship gained through naturalization.","zh":"disnaturalization 指剥夺某人的公民身份，尤其是撤销通过入籍（归化）获得的公民身份。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of taking away someone’s citizenship; the loss of citizenship (same idea as “denaturalization”)","zh":"剥夺某人的公民身份的行为或过程；丧失公民身份（含义接近 denaturalization）"},"examples":[{"en":"The lawyer challenged the government’s disnaturalization of her client in federal court.","zh":"律师在联邦法院对政府剥夺其当事人公民身份的行为提出了挑战。"},{"en":"Disnaturalization can leave a person without the legal rights that citizens have.","zh":"剥夺公民身份可能会使一个人失去公民享有的法律权利。"}]}],"synonyms":["denaturalization","revocation of citizenship","loss of citizenship"],"phonetic":"/diˌnætʃ(ə)rələˈzeɪʃən/","extraExplanation":["这个词在现代英语里非常少见，更常用的正式法律用语是 denaturalization（取消/撤销归化入籍资格）。如果你在文件或文章里见到 disnaturalization，通常就是在谈“撤销已获得的国籍/公民身份”，语域偏法律与历史。","在美国语境中，相关讨论常出现在移民法与国家安全、欺诈（例如申请入籍时提供虚假信息）等话题里。注意：撤销“归化入籍”（naturalization）与撤销“出生即有的国籍”在法律概念上不同，各国规定也不一样。"]}
{"word":"disnaturalize","summary":{"en":"Disnaturalize means to make something feel unnatural or to portray someone as not naturally belonging (rare).","zh":"disnaturalize 指使某事物显得不自然，或（较罕见）把某人描绘成不“自然”属于某处的人。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something seem unnatural or no longer natural; to strip away its “natural” character","zh":"使某事物显得不自然；使失去“自然”的特质"},"examples":[{"en":"Some critics say heavy editing can disnaturalize a writer’s voice.","zh":"一些评论家认为，过度修改会让作者的声音变得不自然。"},{"en":"When you remove all the local details, the story feels disnaturalized and less alive.","zh":"当你把所有本地细节都删掉时，故事会显得不自然，也不那么有生命力。"}]},{"partOfSpeech":"vt.","definition":{"en":"(rare) to treat someone as not belonging “by nature,” especially in social or political contexts; to cast someone as an outsider","zh":"（罕见）在社会或政治语境中把某人描绘成“不属于这里的人”，将其他者化/边缘化"},"examples":[{"en":"The rhetoric aimed to disnaturalize immigrant communities, as if they could never truly belong.","zh":"这种言辞试图把移民群体“他者化”，仿佛他们永远不可能真正属于这里。"},{"en":"Good reporting avoids language that disnaturalizes any group.","zh":"好的报道会避免使用让任何群体被“他者化”的措辞。"}]}],"synonyms":["make unnatural","de-naturalize","alienate","otherize (context-dependent)"],"phonetic":"/ˌdɪsˈnætʃ(ə)rəˌlaɪz/","extraExplanation":["“disnaturalize”在现代英语中非常少见，更常见的相关词是“denaturalize”（取消国籍/归化身份）和“de-naturalize”（使不再自然、去自然化）。学习时要注意：disnaturalize通常不指法律意义上的“撤销入籍”。","构词上：dis-（去除/反向）+ naturalize（使自然化/使成为自然的一部分）。在文学批评、社会评论里偶尔用来表达“让某事失去自然性”或“把某人从‘理所当然的归属’中排除”。"]}
{"word":"disnature","summary":{"en":"Disnature means to strip away natural qualities or (rarely, in literature) to reject someone as family.","zh":"Disnature 指使失去天性/自然特质；（罕见文学用法）也可指断绝亲属关系。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to make someone or something lose their natural character or qualities; to make unnatural","zh":"使（某人/某物）失去本性或自然特质；使变得反常、不自然"},"examples":[{"en":"Cruelty can disnature a person, making them act against their better instincts.","zh":"残酷会使一个人失去本性，让他们做出违背善良本能的事。"},{"en":"The long separation seemed to disnature their friendship.","zh":"长期分离似乎让他们的友谊变得不再自然、疏远了。"}]},{"partOfSpeech":"v.","definition":{"en":"(rare, literary) to treat someone as no longer part of the family; to reject or disown","zh":"（罕见，文学用法）把某人当作不再是家人；断绝关系、否认（子女等）"},"examples":[{"en":"In the old tale, the father threatened to disnature his son for dishonoring the family.","zh":"在那个古老的故事里，父亲威胁要因儿子败坏门风而与他断绝关系。"}]}],"synonyms":["make unnatural","deprive (someone) of their nature","distort","pervert","disown (family sense)"],"phonetic":"/dɪsˈneɪtʃər/","extraExplanation":["“disnature”是非常少见、偏古典/文学的词，现代英语里更常用 make unnatural, deprive of one’s nature, distort 或 disown（表示断绝关系）。","它由前缀 dis-（表示“剥夺、反向”）+ nature（天性/自然）构成。你更常见到的形式是形容词 disnatured（“失去天性/反常的”），常出现在较老的文学作品里。"]}
{"word":"disnatured","summary":{"en":"“disnatured” is an uncommon word meaning “unnatural” or “not true to one’s nature,” and rarely “to make something unnatural.”","zh":"“disnatured”是不常见的词，意思是“非自然的/不像本性的”，也可极少见地作动词表示“使变得不自然”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Uncommon) unnatural; not true to someone’s usual nature or character.","zh":"（不常见）不自然的；不像（某人）本性/一贯性格的。"},"examples":[{"en":"His gentle voice sounded disnatured, as if he were forcing himself to be angry.","zh":"他温和的声音听起来很不自然，仿佛他在逼自己生气。"},{"en":"The bright blue grass gave the scene a disnatured look.","zh":"鲜蓝色的草让这个场景看起来很不自然。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Rare) to change the nature of something; to make it unnatural.","zh":"（罕见）改变……的本性/性质；使……变得不自然。"},"examples":[{"en":"Harsh conditions can disnature a community’s traditions over time.","zh":"严酷的环境会随着时间改变一个社区的传统本色。"}]}],"synonyms":["unnatural","out of character","unlike oneself","strained","affected"],"phonetic":"/dɪsˈneɪtʃɚd/","extraExplanation":["“disnatured”在现代英语里非常少见，很多时候是拼写错误或误写。你可能想找的是：\n- **denatured**（/diːˈneɪtʃɚd/）：常用于化学/食品语境，指“使变性；使失去天然性质（如酒精加入添加剂变成不可饮用的‘变性酒精’）”。\n- **disenchanted / unnatural / out of character**：分别更常用来表达“幻想破灭”或“行为不像平时/不自然”。\n如果你告诉我它出现的句子/语境，我可以帮你判断最可能的目标词。"]}
{"word":"disnaturing","summary":{"en":"Denaturing means causing a protein/DNA to lose its natural structure and function (or making alcohol undrinkable).","zh":"Denaturing 指使蛋白质/DNA失去天然结构与功能（也可指把酒精处理成不可饮用）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(biology/chemistry) Causing a protein or DNA to lose its natural shape (structure) and therefore its normal function.","zh":"（生物/化学）使蛋白质或DNA失去其天然构型（结构），从而失去正常功能。"},"examples":[{"en":"Heat is a common denaturing agent for proteins.","zh":"加热是使蛋白质变性的常见因素。"},{"en":"Alcohol can be denaturing to many microorganisms because it damages proteins.","zh":"酒精会让许多微生物的蛋白质受损而“变性”，因此具有消毒作用。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle of “denature”: to change a biological molecule so it loses its natural structure and activity; also, to make alcohol undrinkable by adding chemicals.","zh":"“denature”的现在分词：使生物分子改变而失去天然结构与活性；也可指在酒精中加入化学物质使其不可饮用（变性酒精）。"},"examples":[{"en":"The lab is denaturing the enzyme to see how stable it is at high temperatures.","zh":"实验室正在让该酶变性，以观察它在高温下有多稳定。"},{"en":"Denaturing alcohol reduces the tax on industrial alcohol because it can’t be consumed as a drink.","zh":"把酒精做成变性酒精（不可饮用）可以降低工业酒精的税负，因为它不能当饮料喝。"}]}],"synonyms":["unfolding","altering","deactivating","inactivating"],"phonetic":"/diˈneɪtʃərɪŋ/","extraExplanation":["你写的 **disnaturing** 很可能是拼写错误；更常见、标准的形式是 **denaturing**（变性的/正在使……变性）。在科学语境中，“denature”非常常用，而“disnature”并不常见。"]}
{"word":"disner","summary":{"en":"“disner” is not a standard English word; it is most likely a misspelling of “Disney” (the entertainment brand/company).","zh":"“disner” 不是标准英语单词；最可能是把 “Disney（迪士尼）” 拼错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Likely a misspelling of “Disney,” the name of an American entertainment company and a family brand (films, theme parks, characters), originally founded by Walt Disney.","zh":"很可能是 “Disney” 的拼写错误：美国著名的娱乐公司与品牌（电影、主题乐园、卡通角色等），最初由华特·迪士尼创立。"},"examples":[{"en":"My kids love Disney movies.","zh":"我的孩子很喜欢迪士尼电影。"},{"en":"We’re planning a trip to Disneyland this summer.","zh":"我们计划今年夏天去迪士尼乐园。"},{"en":"Disney owns several major studios and TV networks.","zh":"迪士尼拥有多家大型电影公司和电视网络。"}]},{"partOfSpeech":"n.","definition":{"en":"Less likely: a misspelling of “designer,” meaning a person who designs things (clothes, buildings, graphics, etc.).","zh":"较不可能：可能想写 “designer”，指“设计师”，从事服装、建筑、平面等设计的人。"},"examples":[{"en":"She is a fashion designer.","zh":"她是一名时装设计师。"},{"en":"We hired a designer to redo our website.","zh":"我们请了一位设计师来重新做我们的网站。"}]}],"synonyms":["Disney","The Walt Disney Company","Disneyland","designer (if that was intended)"],"phonetic":"/ˈdɪzni/","extraExplanation":["“Disney” 通常作为专有名词使用：既可以指“华特·迪士尼（Walt Disney）”本人，也常用来指“华特迪士尼公司（The Walt Disney Company）”这个企业与品牌。日常口语里说 “a Disney movie / Disney characters” 很常见。","如果你想表达的是“设计师”，正确拼写是 “designer”。“disner” 在英语里不是标准单词。"]}
{"word":"disnest","summary":{"en":"Disnest means to drive an animal out of its nest or remove it from the nest.","zh":"disnest 指把动物从巢中赶出或使其离巢。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to remove (a bird or animal) from its nest; to drive it out of a nest","zh":"（把鸟或动物）从巢中赶出；使离巢"},"examples":[{"en":"The storm disnested the young birds, and a rescue group returned them to safety.","zh":"暴风雨把雏鸟从巢里掀了出来，救援组织把它们安置到安全的地方。"},{"en":"In older writing, hunters were said to disnest animals to capture them.","zh":"在较早的文字里，猎人常被写作“把动物赶离巢穴”以便捕捉。"}]}],"synonyms":["drive out","remove from the nest","evict"],"phonetic":"/dɪsˈnɛst/","extraExplanation":["“disnest”由前缀 dis-（表示“去除、使离开”）+ nest（巢）构成，属于较少见、偏文学或技术性的用词。日常英语更常用 drive out of the nest / remove from the nest。"]}
{"word":"disnew","summary":{"en":"“Disnew” isn’t an English word; it’s probably “Disney.”","zh":"“disnew”不是英语单词；很可能是“Disney”的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling of “Disney,” the name of a major American entertainment company and a common family name (as in Walt Disney).","zh":"不是标准英语单词。很可能是“Disney”的拼写错误；Disney 既是美国大型娱乐公司的名称，也常作为姓氏使用（如 Walt Disney）。"},"examples":[{"en":"I think you meant “Disney,” like Disney movies.","zh":"我猜你想写的是“Disney”，比如迪士尼电影。"},{"en":"We watched a Disney cartoon last night.","zh":"我们昨晚看了一部迪士尼动画片。"}]}],"synonyms":["Disney"],"phonetic":"/ˈdɪzni/","extraExplanation":["“Disney”通常读作/ˈdɪzni/，在日常语境里常指迪士尼公司、迪士尼电影/乐园等；也可以指“迪士尼风格的”（偏童话、温馨、适合家庭观看的感觉）。如果你想表达的是“this new”（这个新的），那需要分开写：this new。"]}
{"word":"Disney","summary":{"en":"Disney most commonly refers to the Walt Disney Company or its family-friendly, magical style; it can also refer to Walt Disney himself.","zh":"Disney通常指华特迪士尼公司或其“合家欢、梦幻”的风格；也可指创办人华特·迪士尼本人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The Walt Disney Company: a major American entertainment company known for animated films, theme parks, and media brands.","zh":"华特迪士尼公司：美国大型娱乐公司，以动画电影、主题乐园和媒体品牌闻名。"},"examples":[{"en":"Disney owns brands like Pixar, Marvel, and Lucasfilm.","zh":"迪士尼拥有皮克斯、漫威和卢卡斯影业等品牌。"},{"en":"Many families plan vacations to Disney theme parks.","zh":"很多家庭会计划去迪士尼主题乐园度假。"}]},{"partOfSpeech":"adj.","definition":{"en":"A Disney film, character, or style; often meaning something family-friendly, magical, or idealized.","zh":"迪士尼的电影、角色或风格；常指“适合全家观看、充满魔法、较理想化”的感觉。"},"examples":[{"en":"The movie has a very Disney ending—happy and hopeful.","zh":"这部电影的结局很“迪士尼”——快乐又充满希望。"},{"en":"Her dress looks Disney, like a princess costume.","zh":"她的裙子很“迪士尼”，像公主装一样。"}]},{"partOfSpeech":"n.","definition":{"en":"Walt Disney (1901–1966), an American animator and producer who co-founded Disney and helped shape modern animation.","zh":"华特·迪士尼（1901–1966）：美国动画师与制片人，联合创办迪士尼公司，对现代动画发展影响深远。"},"examples":[{"en":"Walt Disney helped popularize feature-length animated films.","zh":"华特·迪士尼推动了长篇动画电影的普及。"},{"en":"Disney’s early work includes Mickey Mouse and Silly Symphonies.","zh":"迪士尼早期作品包括米老鼠和《傻交响曲》系列。"}]}],"synonyms":["The Walt Disney Company","Disney Studios","Disney-style"],"phonetic":"/ˈdɪzni/","extraExplanation":["“Disney”既是公司/人名，也是一个常见的文化形容词：英语里会说“a Disney moment / a Disney ending”，表示像童话一样浪漫、梦幻、结局圆满（有时也带一点“过于美好、不够现实”的含义）。","文化提示：谈到作品时，“Disney”可指“迪士尼出品的动画/电影”，而“Disneyfied/Disneyfication”（较少见）常指把事物变得更商业化、童话化、适合大众消费。"]}
{"word":"disney","summary":{"en":"Disney usually refers to the American entertainment company/brand, and sometimes to its founder Walt Disney; it can also describe a cheerful, fairytale-like style.","zh":"Disney通常指美国娱乐公司/品牌迪士尼，有时也指其创办人华特·迪士尼；也可形容“童话感、合家欢、积极乐观”的迪士尼风格。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A famous American entertainment brand and company (The Walt Disney Company), known for animated films, TV, theme parks (like Disneyland/Disney World), and characters such as Mickey Mouse.","zh":"迪士尼：美国著名的娱乐品牌与公司（华特迪士尼公司），以动画电影、电视节目、主题乐园（如迪士尼乐园/迪士尼世界）以及米老鼠等角色闻名。"},"examples":[{"en":"My kids love Disney movies like The Lion King.","zh":"我的孩子们很喜欢《狮子王》这样的迪士尼电影。"},{"en":"We’re planning a trip to Disney World next summer.","zh":"我们计划明年夏天去迪士尼世界旅行。"},{"en":"Disney released a new animated film this year.","zh":"迪士尼今年推出了一部新的动画电影。"}]},{"partOfSpeech":"n.","definition":{"en":"Walt Disney (1901–1966), an American animator and entrepreneur who co-founded the Disney company.","zh":"华特·迪士尼（1901–1966）：美国动画制作人和企业家，迪士尼公司的共同创办人。"},"examples":[{"en":"Walt Disney helped shape modern animation.","zh":"华特·迪士尼推动并塑造了现代动画的发展。"},{"en":"Disney’s early cartoons were popular worldwide.","zh":"迪士尼早期的卡通在全球都很受欢迎。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to Disney’s style—family-friendly, magical, and optimistic (often used informally).","zh":"（非正式）“很迪士尼”的：指迪士尼式的风格——合家欢、充满魔法感、积极乐观。"},"examples":[{"en":"The ending felt very Disney—everyone was happy.","zh":"结局很“迪士尼”：所有人都很幸福。"},{"en":"They had a Disney-like wedding with a fairytale theme.","zh":"他们办了一场很“迪士尼式”的童话主题婚礼。"}]}],"synonyms":["The Walt Disney Company","Walt Disney","Disneyland","Disney World"],"phonetic":"/ˈdɪzni/","extraExplanation":["“Disney”在英语里常作为专有名词使用：可以指公司/品牌，也可指创办人华特·迪士尼。写作时通常大写。","在流行文化讨论中，你可能会看到派生词：\n- Disneyfied / Disneyfied：被“迪士尼化”，指把事物变得更商业、更安全、更童话化。\n- Disneyfication（迪士尼化）：同上，常用于文化批评语境。"]}
{"word":"Disney Cruise","summary":{"en":"a Disney-themed cruise vacation operated by Disney’s cruise line","zh":"迪士尼主题的邮轮度假旅行"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a cruise vacation operated by Disney Cruise Line, known for Disney-themed entertainment and family-focused activities","zh":"由迪士尼邮轮公司运营的邮轮度假，以迪士尼主题娱乐和亲子活动著称"},"examples":[{"en":"We booked a Disney Cruise for spring break.","zh":"我们为春假预订了一趟迪士尼邮轮之旅。"},{"en":"On a Disney Cruise, you can meet Disney characters and watch Broadway-style shows.","zh":"在迪士尼邮轮上，你可以和迪士尼角色见面，还能看百老汇风格的演出。"},{"en":"A Disney Cruise is popular with families traveling with young kids.","zh":"迪士尼邮轮很受带小孩出行的家庭欢迎。"}]},{"partOfSpeech":"phrase","definition":{"en":"(informal) a particular sailing or trip offered by Disney Cruise Line","zh":"（非正式）迪士尼邮轮公司提供的某一班次/某一趟航程"},"examples":[{"en":"Which Disney Cruise are you taking—Bahamas or Alaska?","zh":"你要坐哪一趟迪士尼邮轮——巴哈马还是阿拉斯加？"},{"en":"Our Disney Cruise leaves from Port Canaveral.","zh":"我们这趟迪士尼邮轮从卡纳维拉尔港出发。"}]}],"synonyms":["Disney Cruise Line","DCL","Disney vacation cruise","family cruise","themed cruise"],"phonetic":"ˈdɪz.ni kruːz","extraExplanation":["更正式的说法通常是 Disney Cruise Line（公司/品牌）或 a Disney cruise（一次旅行）。","在旅行语境里，cruise 指“邮轮旅行”，而 cruise line 指“邮轮公司/邮轮品牌”。","作为品牌相关用语，写作时常需首字母大写；口语里也常直接说 “a Disney cruise”。"],"etymology":"由专有名词 Disney（迪士尼）+ cruise（乘船巡游/邮轮旅行）构成；Disney Cruise Line（迪士尼邮轮公司）为迪士尼旗下邮轮品牌，1990年代末开始运营，因此该短语多用作品牌相关称呼。","mnemonic":["把它拆开记：Disney（迪士尼）+ Cruise（邮轮）＝“迪士尼主题的邮轮度假”。","联想“Cruise=“出”海旅行”：中文“出”与 cruise 开头的 /kruː/ 发音相近，帮助记住是“出海坐邮轮”。"]}
{"word":"Disney TV","summary":{"en":"Disney-related television content or brand.","zh":"迪士尼相关的电视内容或品牌。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"Disney’s television-related content or brand (such as TV channels, TV shows, or Disney’s TV division), often used as a casual label for family-friendly Disney programming.","zh":"迪士尼的电视相关内容或品牌（如电视频道、电视剧/综艺、迪士尼电视部门），常用来泛指偏家庭向、适合儿童的迪士尼电视节目。"},"examples":[{"en":"I grew up watching Disney TV after school.","zh":"我小时候放学后经常看迪士尼的电视节目。"},{"en":"The series first aired on Disney TV in the early 2000s.","zh":"这部剧在2000年代初最先在迪士尼的电视平台播出。"},{"en":"They want something like Disney TV—light, funny, and safe for kids.","zh":"他们想看那种像迪士尼电视节目一样的：轻松、好笑、适合孩子。"}]}],"synonyms":["Disney Channel","Disney television","Disney programming","Disney shows"],"phonetic":"/ˈdɪzni ˌtiːˈviː/","extraExplanation":["在不同地区，“Disney TV”可能具体指不同的频道或品牌（如 Disney Channel、Disney XD、Disney Junior 等）。","当人们说“like Disney TV”时，常带有风格含义：偏合家欢、积极、冒险或音乐元素多，内容更“安全/适龄”。","注意区分：Disney+ 主要是流媒体平台，不等同于传统“TV”，但日常对话中有时也会被泛称为“Disney TV content”。"],"etymology":"“Disney”来自华特·迪士尼（Walt Disney）及其公司名；“TV”是“television”的缩写。“Disney TV”多为口语/媒体用语，用来指迪士尼旗下电视内容或播出平台（如电视频道或电视部门）。","mnemonic":["记忆法：把它拆开——Disney（迪士尼）+ TV（电视）=“迪士尼的电视”。","联想：看到“TV”就想到“频道/节目表”，所以“Disney TV”就是“迪士尼的频道或节目”。"]}
{"word":"Disney World","summary":{"en":"A Disney theme-park resort in Florida; sometimes used for an unreal, fantasy-like place.","zh":"佛州的迪士尼主题度假区；也可比喻不真实、像童话的地方/氛围。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large Disney theme-park resort in Orlando, Florida, with multiple parks, hotels, and entertainment areas.","zh":"位于美国佛罗里达州奥兰多的大型迪士尼主题度假区，包含多个主题公园、酒店与娱乐区域。"},"examples":[{"en":"We’re going to Disney World during spring break.","zh":"我们春假要去迪士尼世界。"},{"en":"Disney World has four major theme parks, including Magic Kingdom and EPCOT.","zh":"迪士尼世界有四个主要主题公园，包括魔法王国和EPCOT。"},{"en":"She planned the whole Disney World trip months in advance.","zh":"她提前好几个月就把去迪士尼世界的行程规划好了。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) A place, situation, or atmosphere that feels unreal, idealized, or overly cheerful—like a fantasy.","zh":"（比喻）像童话一样不真实、过于理想化或过分欢乐的地方/氛围。"},"examples":[{"en":"Their office feels like Disney World—music, snacks, and constant celebrations.","zh":"他们的办公室像迪士尼世界——有音乐、有零食，还总在庆祝。"},{"en":"He expected the job to be Disney World, but it was stressful.","zh":"他以为这份工作会像迪士尼世界一样轻松美好，结果压力很大。"}]}],"synonyms":["Walt Disney World","Disney resort","Disney parks"],"phonetic":"/ˈdɪzni ˌwɝld/","extraExplanation":["易混：Disneyland（迪士尼乐园）最早在加州（Anaheim）开园；Disney World 通常指佛罗里达的 Walt Disney World Resort。","英语中常口语化省略为 “Disney World”，也有人说 “Walt Disney World”。在正式写作或官方场景里常用全称。"],"etymology":"源自迪士尼公司创始人 Walt Disney（沃尔特·迪士尼）的名字；全称为 Walt Disney World，于 1971 年在佛罗里达州开幕。“World”强调这是一个规模庞大的综合度假区，而不仅仅是一座单一公园。","mnemonic":["把 “World” 当成“一个完整的世界”：不只一个公园，还有酒店、购物区、交通系统等，所以叫 Disney World。","记忆对比：land=一块“地/园区”，world=一个“世界/度假区”，Disney World 通常更大。"]}
{"word":"Disney's America","summary":{"en":"a canceled Disney plan for a U.S.-history-themed park","zh":"迪士尼曾计划但最终取消的美国历史主题乐园项目"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A proposed (but never built) Disney theme park planned in the early 1990s, intended to present U.S. history and culture through attractions and shows, originally planned for Virginia.","zh":"一个在20世纪90年代初由迪士尼提出、但最终未建成的主题乐园计划，原拟在弗吉尼亚通过游乐设施与表演呈现美国历史与文化。"},"examples":[{"en":"Disney’s America was announced in 1993 but was later canceled after public controversy.","zh":"“Disney’s America”于1993年公布，但在引发公众争议后被取消。"},{"en":"Some critics argued that Disney’s America would turn serious history into entertainment.","zh":"一些批评者认为“Disney’s America”会把严肃历史变成娱乐消费。"}]}],"synonyms":["American history theme park","historical theme park","Disney theme park"],"phonetic":"ˈdɪzniːz əˈmɛrɪkə","extraExplanation":["文化语境：它常被用作讨论“历史的商业化/娱乐化”的案例——例如如何在尊重历史与吸引游客之间取得平衡。","背景补充：项目最初选址靠近马纳萨斯国家战场公园（Manassas National Battlefield Park）附近，引发对交通、环境影响以及对历史遗址不敬等担忧。最终迪士尼在1994年前后放弃该计划。"],"etymology":"源自专有名称：Disney’s（迪士尼的）+ America（美国）。该名称用于1990年代初迪士尼公司提出的历史主题公园项目名称，后因争议与规划问题而终止。","mnemonic":["把它拆开记：Disney’s（迪士尼的）+ America（美国）→“迪士尼版的美国（历史）主题”。","联想对比：Disneyland/Disney World 是“已经存在的乐园”，Disney’s America 是“听起来像乐园、但实际上没建成的计划”。"]}
{"word":"Disney-style","summary":{"en":"“Disney-style” means in the typical Disney look or storytelling style—bright, magical, and family-friendly; sometimes it also means unrealistically idealized.","zh":"“Disney-style”指典型的迪士尼风格——明亮、梦幻、适合全家；有时也指过度理想化、不够真实。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"In the style typical of Disney films or theme parks—family-friendly, colorful, magical, and emotionally uplifting.","zh":"迪士尼式的；具有迪士尼电影或乐园常见风格的——适合全家、色彩鲜明、充满魔法感，并且温暖励志。"},"examples":[{"en":"The movie has a Disney-style ending where love wins and everyone sings.","zh":"这部电影有一个迪士尼式的结局：爱战胜一切，大家还一起唱歌。"},{"en":"They designed the parade with Disney-style music and bright costumes.","zh":"他们用迪士尼式的音乐和亮眼的服装来设计游行。"},{"en":"Her illustration is Disney-style—big eyes, soft colors, and a sweet mood.","zh":"她的插画很迪士尼式——大眼睛、柔和配色、甜美氛围。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Sometimes critical) Overly neat, idealized, or simplified in a way that feels unrealistic or sentimental.","zh":"（有时带批评）过于美化、过于理想化或过度简化，以至于显得不真实或太煽情。"},"examples":[{"en":"The explanation felt a bit Disney-style and ignored the real problems.","zh":"这个解释有点“迪士尼式”，回避了真正的问题。"},{"en":"Their Disney-style romance doesn’t match how relationships work in real life.","zh":"他们那种迪士尼式的爱情，和现实中的关系运作方式并不相符。"}]}],"synonyms":["Disneyesque","fairy-tale-like","storybook","wholesome","family-friendly","feel-good","idealized","sentimental"],"phonetic":"/ˈdɪzni staɪl/","extraExplanation":["“Disney-style”常用来描述一种大众熟悉的叙事与视觉语言：善恶分明、结局圆满、音乐感强、角色可爱夸张（如大眼睛、圆润线条）。在口语或评论里，它既可以是中性/褒义（温暖、童话感），也可以是贬义（过度粉饰、太理想化）。","写作时可用连字符：Disney-style animation / Disney-style ending。若写成“Disneyesque”（也可写“Disney-esque”），语气更偏“……风格的/……味的”，常见于评论或艺术讨论。","迪士尼作品常借用经典童话与民间故事（如《灰姑娘》《白雪公主》）并进行改编，因此“Disney-style”有时也暗含“改编后更轻快、更适合家庭观看”的意味。"]}
{"word":"Disneyesque","summary":{"en":"Disneyesque means ‘like Disney’—magical and idealized, sometimes criticized as overly polished or unrealistic.","zh":"Disneyesque 意为“像迪士尼的”——梦幻、理想化；有时也带批评，指过于精致或不真实。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having a style or mood like Disney movies or theme parks—magical, cute, wholesome, and often idealized or sentimental.","zh":"具有迪士尼式风格或氛围的——魔幻、可爱、温馨，且常带有理想化或感伤的色彩。"},"examples":[{"en":"The town center looked Disneyesque at night, with twinkling lights and cheerful music.","zh":"夜晚的小镇中心看起来很“迪士尼风”，闪烁的灯光配上欢快的音乐。"},{"en":"Some critics say the film gives a Disneyesque view of history—too neat and optimistic.","zh":"一些评论家认为这部电影对历史的呈现很“迪士尼式”——过于工整、过于乐观。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Often mildly critical) Overly polished or family-friendly in a way that feels simplified, commercialized, or unrealistic.","zh":"（常带轻微批评）过于精致或“合家欢”，让人感觉被简化、商业化或不真实。"},"examples":[{"en":"The new waterfront is clean and safe, but it feels a bit Disneyesque.","zh":"新的滨水区干净又安全，但感觉有点过于“迪士尼化”。"},{"en":"He wanted a grittier ending, not something so Disneyesque.","zh":"他想要一个更写实、更有棱角的结局，而不是那么“迪士尼式”。"}]}],"synonyms":["fairy-tale-like","storybook","whimsical","idealized","saccharine"],"phonetic":"/ˌdɪzniˈɛsk/","extraExplanation":["“Disneyesque”来自“Disney + -esque”（表示“……风格的”）。常用于形容场景、氛围、叙事或审美：可以是夸赞“梦幻/童话感”，也可以是批评“过度美化/过度商业化”。","拼写有时也见“Disney-esque”（带连字符）。通常首字母大写，因为源自专有名词 Disney。"]}
{"word":"Disneyland","summary":{"en":"Disneyland is a Disney theme park (especially the original in California), and it can also mean a magical or unreal perfect place in a figurative sense.","zh":"Disneyland 指迪士尼主题乐园（尤指加州最早的那座），也可作比喻表示“梦幻、快乐或不太现实的完美之地”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a famous theme park created by Walt Disney, especially the original one in Anaheim, California; also used to refer to other Disney theme parks worldwide","zh":"迪士尼乐园：由华特·迪士尼创建的著名主题乐园，尤指美国加州阿纳海姆的第一座；也可泛指世界各地的迪士尼主题乐园"},"examples":[{"en":"We’re going to Disneyland this weekend.","zh":"我们这周末要去迪士尼乐园。"},{"en":"Disneyland in California opened in 1955.","zh":"加州的迪士尼乐园于1955年开园。"}]},{"partOfSpeech":"n.","definition":{"en":"a place or situation that feels magical, happy, or unreal—often used figuratively","zh":"（比喻）像梦幻乐园的地方/状态：让人感觉魔幻、快乐或不太真实的环境（常用于比喻）"},"examples":[{"en":"Living there felt like Disneyland—everything looked perfect.","zh":"住在那里感觉像在迪士尼乐园——一切看起来都很完美。"},{"en":"This job isn’t Disneyland; you still have to work hard.","zh":"这份工作不是“迪士尼乐园”；你还是得努力工作。"}]}],"synonyms":["Disney theme park","theme park","fantasyland (figurative)"],"phonetic":"/ˈdɪzniˌlænd/","extraExplanation":["“Disneyland”是专有名词，日常写作中通常首字母大写。口语里如果在同一语境中很明确，也有人会省略地点说“Disneyland”来指“加州迪士尼”。","常见搭配：go to Disneyland（去迪士尼）、a trip to Disneyland（去迪士尼的旅行）、the Happiest Place on Earth（宣传语：世界上最快乐的地方）。","文化用法：在比喻义中，“Disneyland”有时带一点“太理想化/不现实”的语气，比如“That’s not Disneyland.” 意思是“别想得太美”。"]}
{"word":"disneyland","summary":{"en":"Disneyland is a Disney theme park; it can also mean a magical or unreal place/situation in informal speech.","zh":"Disneyland指迪士尼主题乐园；口语中也可引申为“梦幻、像童话般或不太真实的地方/情境”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A theme park created by the Walt Disney Company, famous for Disney characters, rides, shows, and family entertainment.","zh":"迪士尼公司创办的主题乐园，以迪士尼角色、游乐设施、演出和家庭娱乐著名。"},"examples":[{"en":"We’re going to Disneyland this weekend.","zh":"我们这个周末要去迪士尼乐园。"},{"en":"Disneyland is known for its parades and fireworks.","zh":"迪士尼乐园以游行和烟火表演闻名。"}]},{"partOfSpeech":"n.","definition":{"en":"A place or situation that feels magical, joyful, or unreal—like a fantasy world (often used informally).","zh":"（非正式）像梦幻世界一样神奇、快乐或不真实的地方/情境。"},"examples":[{"en":"After I got the job offer, it felt like Disneyland.","zh":"拿到工作录用后，我感觉像在梦幻乐园一样不真实。"},{"en":"Don’t expect everything to be perfect—life isn’t Disneyland.","zh":"别指望一切都完美——生活不是梦幻乐园。"}]}],"synonyms":["theme park","amusement park","fantasy land"],"phonetic":"/ˈdɪzniˌlænd/","extraExplanation":["“Disneyland”最初专指1955年在美国加州阿纳海姆开幕的“迪士尼乐园”（Disneyland Park），后来也常被用来泛指世界各地的迪士尼乐园（如东京迪士尼乐园、巴黎迪士尼乐园、香港迪士尼乐园等）。","作为比喻时，“Disneyland”常带两种语气：一种是积极的“像童话一样美好”；另一种是带点批评或提醒，表示“过于理想化、不现实”。使用时可根据语境判断。"]}
{"word":"Disneyland Park","summary":{"en":"the original Disney theme park in Anaheim, California","zh":"位于加州阿纳海姆的迪士尼原创主题乐园"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"The original Disney theme park in Anaheim, California, opened in 1955; one of the two parks in the Disneyland Resort.","zh":"位于美国加利福尼亚州阿纳海姆的迪士尼原创主题乐园，1955年开园；是“迪士尼乐园度假区”内的两大园区之一。"},"examples":[{"en":"We spent the morning at Disneyland Park and watched the parade on Main Street, U.S.A.","zh":"我们上午在迪士尼乐园园区玩，并在“美国小镇大街”看了游行。"},{"en":"Tickets can be used to enter Disneyland Park or Disney California Adventure, depending on your reservation.","zh":"门票可用于进入“迪士尼乐园园区”或“迪士尼加州冒险乐园”，具体取决于你的预约。"},{"en":"Many visitors consider Disneyland Park the most classic Disney park experience.","zh":"很多游客认为这里最能代表“经典迪士尼乐园”的体验。"}]}],"synonyms":["Disneyland","Disneyland Resort","theme park","amusement park"],"phonetic":"/ˈdɪzniˌlænd pɑrk/","extraExplanation":["这是官方园区名（proper noun）。在口语中，人们常直接说“Disneyland”，但在购票、预约、地图与官网信息里常用全称“Disneyland Park”来明确指的是哪个园区。","它以“Lands（主题区域）”著称，如 Fantasyland、Tomorrowland、Adventureland 等，属于美国流行文化中极具代表性的主题乐园。"],"etymology":"由“Disneyland（迪士尼乐园）+ Park（园区/公园）”构成；用来区分同一度假区内的不同园区名称（例如与 Disney California Adventure 区分）。","mnemonic":["把 Park 理解成“园区”，用来“分园区”：Disneyland Park（经典那座）vs. 另一个园区。","记忆拆分：Disney + land（迪士尼的“世界/国度”）+ park（园区）。"]}
{"word":"disniche","summary":{"en":"“disniche” is not a standard English word; it’s likely a misspelling or a blend (e.g., Disney + niche).","zh":"“disniche”不是标准英语单词；更可能是拼写错误或混成词（如 Disney + niche）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is likely a misspelling or a made-up term.","zh":"不是标准英语单词，可能是拼写错误或自造词。"},"examples":[{"en":"I can’t find “disniche” in a dictionary—did you mean “Disney” or “niche”?","zh":"我在词典里找不到“disniche”——你是不是想写“Disney”或“niche”？"},{"en":"Please share the full sentence where you saw “disniche,” and I can help interpret it.","zh":"请把你看到“disniche”的完整句子发出来，我可以帮你判断它的意思。"}]}],"synonyms":["(if you meant) Disney","(if you meant) niche"],"phonetic":"ˈdɪsniːtʃ","extraExplanation":["“disniche”在常见词典与语料中并不常见。最可能的情况：\n1）把两个词拼在一起（如 Disney + niche），用于描述“迪士尼风格/受众的细分领域”。\n2）拼写错误：常见接近的词有 Disney（迪士尼）、niche（细分领域/小众市场）。\n如果你告诉我它出现的场景（社媒、游戏名、产品名、句子），我可以更准确地解释或给出对应的标准表达。"]}
{"word":"disnosed","summary":{"en":"“Disnosed” isn’t a standard English word; you probably mean “diagnosed” (past form of diagnose): to identify an illness or the cause of a problem.","zh":"“disnosed”不是标准英文词；你可能想写“diagnosed”（diagnose 的过去式/过去分词）：诊断疾病或判定问题原因。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Likely intended: “diagnosed”) to identify an illness, problem, or cause after examining the symptoms or evidence.","zh":"（可能想写：diagnosed）在检查症状或证据后，诊断（疾病）或判定（问题的原因）。"},"examples":[{"en":"The doctor diagnosed her with the flu.","zh":"医生诊断她得了流感。"},{"en":"He was diagnosed with diabetes last year.","zh":"他去年被诊断出患有糖尿病。"},{"en":"We diagnosed the computer problem as a loose cable.","zh":"我们判定电脑问题是因为电缆松了。"}]},{"partOfSpeech":"vt.","definition":{"en":"to analyze and find the exact nature of a difficult situation or problem so it can be fixed.","zh":"分析并找出棘手情况或问题的本质，以便解决。"},"examples":[{"en":"The team diagnosed why sales were dropping.","zh":"团队分析并找出了销量下滑的原因。"},{"en":"It’s important to diagnose the issue before making changes.","zh":"在做改动之前，先找出问题所在很重要。"}]}],"synonyms":["identify","determine","pinpoint","detect"],"phonetic":"/ˌdaɪəɡˈnoʊz/","extraExplanation":["“disnosed”不是常见英文单词，很可能是把“diagnosed”（diagnose 的过去式/过去分词）拼错了。","常见搭配：be diagnosed with + 疾病（被诊断患有……）；diagnose A as B（把A判定为B/认为A的原因是B）。"]}
{"word":"disnumber","summary":{"en":"Disnumber usually means “to misnumber,” and more rarely can mean “to remove from a counted group.”","zh":"disnumber 通常指“误编号”，较少见的用法是“从统计/名册中除去，使数量减少”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to number incorrectly; to misnumber (often used in editing, printing, or record-keeping)","zh":"把编号弄错；误编号（常见于编辑、印刷或记录场景）"},"examples":[{"en":"The pages were disnumbered after the file was exported, so Chapter 3 starts on the wrong page.","zh":"文件导出后页码被误编号了，所以第三章从错误的页码开始。"},{"en":"Please check the tickets—some of them may have been disnumbered during printing.","zh":"请核对一下票据——印刷时可能有一些被误编号了。"}]},{"partOfSpeech":"vt.","definition":{"en":"(rare/archaic) to take someone or something out of a counted group; to reduce a group’s number","zh":"（罕见/古语）把某人或某物从“计数的群体”中除去；使人数/数量减少"},"examples":[{"en":"The injury disnumbered him from the team for the rest of the season.","zh":"这次受伤使他在本赛季余下时间里被排除在队伍名单之外。"}]}],"synonyms":["misnumber","number incorrectly","mislabel (close in meaning)","renumber (related, not the same)"],"phonetic":"/dɪsˈnʌmbɚ/","extraExplanation":["“dis-”有“使相反/去除”的含义，“number”是“编号/数量”。因此 disnumber 最常见的学习用法是“把编号弄错（misnumber）”。","这个词在现代英语中不算常用；日常更常见的是 misnumber（误编号）或 number incorrectly（编号错误）。"]}

