{"word":"disubstituted","summary":{"en":"A chemistry term meaning a molecule (or ring) has two substituent groups attached in place of two original atoms (often hydrogens).","zh":"化学术语，指分子（或环）上有两个取代基，取代了原本的两个原子（常见为氢）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Having two substituent groups replacing two hydrogen atoms (or other atoms/groups) on a parent molecule or ring.","zh":"（化学）二取代的；指在母体分子或环上有两个取代基取代了两个氢原子（或其他原子/基团）。"},"examples":[{"en":"A disubstituted benzene ring can have ortho, meta, or para substitution patterns.","zh":"二取代苯环可能呈现邻位、间位或对位的取代方式。"},{"en":"In the NMR spectrum, the disubstituted alkene shows characteristic coupling between the double-bond hydrogens.","zh":"在核磁共振谱中，二取代烯烃会显示出双键氢之间特征性的偶合信号。"}]}],"synonyms":["di-substituted","doubly substituted"],"phonetic":"/ˌdaɪˈsʌb.stəˌtuː.tɪd/","extraExplanation":["“disubstituted”常用于有机化学命名与结构描述：di- 表示“两个”，substituted 表示“被取代的”。常见搭配有 disubstituted benzene（二取代苯）、disubstituted alkene（二取代烯烃）。","在芳香环上，二取代常进一步用邻/间/对（ortho/meta/para）说明两个取代基的相对位置。"]}
{"word":"disubstitution","summary":{"en":"Disubstitution means having (or making) two substitutions in a molecule, especially replacing two atoms/groups with two others.","zh":"disubstitution 指分子发生（或具有）两处取代，尤其是两个原子/基团被另外两个取代。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) the process or result of replacing two atoms or groups in a molecule with two other atoms or groups.","zh":"（化学）二取代：指在一个分子中有两个原子或官能团被另外两个原子或官能团取代的过程或结果。"},"examples":[{"en":"In aromatic chemistry, disubstitution often leads to several positional isomers.","zh":"在芳香族化学中，二取代常常会产生几种位置异构体。"},{"en":"The reaction produced disubstitution on the benzene ring rather than monosubstitution.","zh":"该反应在苯环上生成了二取代产物，而不是一取代产物。"}]}],"synonyms":["di-substitution","double substitution"],"phonetic":"/ˌdaɪˌsʌb.stəˈtuː.ʃən/","extraExplanation":["在苯环（二取代苯）里，两个取代基的位置关系常用邻位（ortho-，1,2-）、间位（meta-，1,3-）、对位（para-，1,4-）来描述；不同位置会影响产物的性质与反应选择性。","学术写作中也常见连字符写法“di-substitution”；描述产物时常用形容词“disubstituted”（二取代的），如“a disubstituted benzene”。"]}
{"word":"disulfate","summary":{"en":"Disulfate is a chemistry term for a compound/ion with two sulfate units, often the pyrosulfate ion S₂O₇²⁻.","zh":"disulfate 是化学术语，指含两个硫酸根单元的化合物/离子，常指焦硫酸根 S₂O₇²⁻。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound or ion containing two sulfate (SO₄) groups; often refers to the pyrosulfate ion, S₂O₇²⁻, formed when two sulfate units link together.","zh":"一种含有两个硫酸根（SO₄）基团的化合物或离子；常指焦硫酸根（pyrosulfate）S₂O₇²⁻，由两个硫酸根结构连接而成。"},"examples":[{"en":"Some salts contain the disulfate (pyrosulfate) ion, S₂O₇²⁻.","zh":"有些盐含有二硫酸根（焦硫酸根）离子 S₂O₇²⁻。"},{"en":"On heating, certain sulfates can form disulfates and release water.","zh":"加热时，某些硫酸盐会生成二硫酸盐并释放水。"}]}],"synonyms":["pyrosulfate","disulphate"],"phonetic":"/daɪˈsʌlˌfeɪt/","extraExplanation":["“disulfate”在一般英语中不算常用词，化学语境里更常见的是“pyrosulfate（焦硫酸盐/焦硫酸根）”。英式拼写有时写作“disulphate”。","词素理解：前缀“di-”表示“两个”，“sulfate”指“硫酸盐/硫酸根”。因此它字面意思就是“含两个硫酸根单元的（化合物/离子）”。","在不同教材或论文中，“disulfate”可能被用来泛指含两个硫酸根的结构，但若看到明确的化学式 S₂O₇²⁻，通常就是焦硫酸根。"]}
{"word":"disulfid","summary":{"en":"Disulfide means a compound or bond with two sulfur atoms linked (S–S), common in chemistry and biology.","zh":"Disulfide 指含两个硫原子相连（S–S）的化合物或“二硫键”，常见于化学与生物学。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound or group containing two sulfur atoms bonded together (S–S), often found in proteins and used in chemistry","zh":"含有两个硫原子相连（S–S）的化合物或基团（“二硫化物/二硫键”），常见于蛋白质与化学反应中"},"examples":[{"en":"Disulfide bonds help stabilize the shape of many proteins.","zh":"二硫键有助于稳定许多蛋白质的结构。"},{"en":"The lab tested the sample for disulfide compounds.","zh":"实验室检测了样品中的二硫化物。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or containing a disulfide bond (S–S)","zh":"与二硫键（S–S）有关的；含二硫键的"},"examples":[{"en":"Keratin is rich in disulfide linkages.","zh":"角蛋白富含二硫键连接。"},{"en":"The shampoo claims it can repair disulfide damage in hair.","zh":"这款洗发水宣称能修复头发中的二硫键损伤。"}]}],"synonyms":["disulphide","S–S bond","disulfide bond"],"phonetic":"/daɪˈsʌlfaɪd/","extraExplanation":["“disulfid”更常见是“disulfide”的拼写变体或拼写错误；标准英语拼写通常是 disulfide（美式/通用）或 disulphide（英式用 ph）。","在生物学里常说“disulfide bond（二硫键）”，它能把蛋白质链的不同部分“扣”在一起，影响折叠与稳定性；在头发护理语境中也常用来指头发内部结构中的二硫键。"]}
{"word":"disulfide","summary":{"en":"A disulfide is an —S—S— bond (or a compound featuring it), especially important in protein structure.","zh":"disulfide 指—S—S—二硫键（或含此结构的化合物），在蛋白质结构稳定中很重要。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical bond/link between two sulfur atoms (—S—S—), common in proteins and important for shaping and stabilizing their 3D structure","zh":"二硫键；由两个硫原子形成的化学键（—S—S—），常见于蛋白质中，用来帮助形成并稳定其三维结构"},"examples":[{"en":"Disulfide bonds help keep a protein’s shape stable.","zh":"二硫键有助于保持蛋白质结构的稳定。"},{"en":"Keratin in hair has many disulfide bonds, which is why hair can hold a curl after a perm.","zh":"头发中的角蛋白含有许多二硫键，这也是烫发后头发能保持卷度的原因。"}]},{"partOfSpeech":"adj.","definition":{"en":"containing two sulfur atoms or having a disulfide bond (often used in chemistry/biology)","zh":"含有两个硫原子（的）；具有二硫键（的）（常用于化学/生物学语境）"},"examples":[{"en":"This disulfide linkage can be broken by reducing agents.","zh":"这种二硫键连接可以被还原剂打断。"}]}],"synonyms":["disulfide bond","disulphide (BrE spelling)","disulfide bridge"],"phonetic":"/daɪˈsʌl.faɪd/","extraExplanation":["在生物化学里，“disulfide bond（二硫键）”常指蛋白质中两个半胱氨酸（cysteine）侧链之间形成的—S—S—键，也叫“二硫桥（disulfide bridge）”。它能提高蛋白质的稳定性，尤其在细胞外环境（更氧化的环境）中更常见。"]}
{"word":"disulfids","summary":{"en":"A disulfide is a compound or bond containing an —S—S— link between two sulfur atoms, common in chemistry and proteins.","zh":"disulfide 指含有—S—S—两个硫原子连接的化合物或键，常见于化学与蛋白质中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound or group that contains a bond between two sulfur atoms (—S—S—); often discussed in chemistry and biology (for example, in proteins).","zh":"含有两个硫原子之间（—S—S—）键的化合物或基团；在化学与生物学中常见（例如蛋白质中）。"},"examples":[{"en":"Disulfides are important in many industrial and biological processes.","zh":"二硫化物在许多工业和生物过程里都很重要。"},{"en":"A disulfide bond helps keep a protein’s shape stable.","zh":"二硫键有助于维持蛋白质结构的稳定。"}]},{"partOfSpeech":"n.","definition":{"en":"(especially in biology) a disulfide bond: the —S—S— link between two parts of a molecule, often between two cysteine amino acids in a protein.","zh":"（尤指生物学）二硫键：分子中两部分之间的—S—S—连接，常见于蛋白质里两个半胱氨酸之间。"},"examples":[{"en":"Heat can break some disulfide bonds in hair.","zh":"加热可能会破坏头发中的一些二硫键。"},{"en":"The enzyme reduces disulfides to thiols.","zh":"这种酶会把二硫键还原成硫醇。"}]}],"synonyms":["disulfide bond","disulphide (BrE)"],"phonetic":"/daɪˈsʌlfaɪd/","extraExplanation":["你输入的“disulfids”更常见的拼写是 **disulfides**（复数），单数是 **disulfide**。在英式拼写中也常见 **disulphide**（ph）。","在日常英语里这个词主要出现在理科/医学语境。最常听到的是 **disulfide bond（二硫键）**，它对蛋白质折叠与稳定性很关键；例如头发烫染会涉及二硫键的断裂与重新连接。"]}
{"word":"disulfiram","summary":{"en":"Disulfiram is a drug used to support treatment for alcohol use disorder by triggering an unpleasant reaction if alcohol is consumed.","zh":"Disulfiram（双硫仑）是一种戒酒辅助药物：若在服用期间饮酒，会引发不适反应。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medicine used to help treat alcohol use disorder by causing unpleasant symptoms (like nausea and flushing) if you drink alcohol while taking it","zh":"一种用于辅助治疗酒精使用障碍（酒瘾）的药物：服用期间若饮酒会引起不适反应（如恶心、潮红等）"},"examples":[{"en":"Disulfiram is sometimes prescribed to support recovery from alcohol dependence.","zh":"戒酒治疗中，有时会开具双硫仑来帮助巩固康复。"},{"en":"He avoided all alcohol because disulfiram can make you feel very sick if you drink.","zh":"他完全避开酒精，因为服用双硫仑后饮酒可能会让人非常难受。"},{"en":"Before starting disulfiram, the doctor explained the risks and asked about other medicines.","zh":"开始使用双硫仑前，医生解释了风险，并询问他是否在用其他药物。"}]}],"synonyms":["Antabuse"],"phonetic":"/daɪˈsʌl.fɪ.ræm/","extraExplanation":["双硫仑在英语里常被当作“戒酒辅助药”来提到，经典商品名是 Antabuse（安他布司）。","它的核心特点是“喝酒就难受”，因此更适合在有监督、动机较强、并且能严格避免酒精的人群中使用。","学习场景里要注意：很多食品/药品也可能含酒精（如部分漱口水、止咳糖浆、某些酱料或甜点），服药期间通常需要一并避免，具体以医生或药师指导为准。"]}
{"word":"disulfonic","summary":{"en":"Disulfonic describes a substance that has two sulfonic acid groups (–SO3H).","zh":"Disulfonic 指含有两个磺酸基（–SO3H）的物质或结构。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Having two sulfonic acid groups (–SO3H) in a molecule; related to a disulfonic acid or its salts/derivatives.","zh":"（化学）含有两个磺酸基（–SO3H）的；与二磺酸或其盐/衍生物有关。"},"examples":[{"en":"This dye contains a disulfonic group, so it dissolves well in water.","zh":"这种染料含有二磺酸基，因此在水中溶解性很好。"},{"en":"A disulfonic acid often forms highly water‑soluble salts.","zh":"二磺酸通常会形成高度易溶于水的盐。"}]}],"synonyms":["disulfonated","bis(sulfonic)","disulfonate (related form)"],"phonetic":"/ˌdaɪsʌlˈfɑnɪk/","extraExplanation":["“dis-”表示“两个”， “sulfonic”指“磺酸的”。所以 disulfonic 直译就是“含两个磺酸基的”。","磺酸基（–SO3H）很强极性，常让分子更亲水；因此含二磺酸基的染料、表面活性剂或中间体往往更容易溶于水。","常见相关名词：disulfonic acid（二磺酸）、disulfonate（二磺酸盐/二磺酸根）。"]}
{"word":"disulfoton","summary":{"en":"Disulfoton is a very toxic organophosphate insecticide.","zh":"Disulfoton 是一种毒性很强的有机磷杀虫剂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a highly toxic organophosphate insecticide (a pesticide) used mainly to kill insects on crops; now restricted or banned in many places because it is dangerous to humans and wildlife","zh":"一种高毒性的有机磷杀虫剂（农药），主要用于农作物害虫防治；因对人类和野生动物危害大，在许多地区已被严格限制或禁用"},"examples":[{"en":"Disulfoton has been restricted in many countries due to its high toxicity.","zh":"由于毒性很高，disulfoton 在许多国家已被限制使用。"},{"en":"Farm workers need strict safety protection if they handle disulfoton-containing products.","zh":"如果接触含有 disulfoton 的产品，农场工人需要严格的安全防护。"}]}],"synonyms":["organophosphate insecticide","pesticide"],"phonetic":"/daɪˈsʌlfoʊtɑn/","extraExplanation":["Disulfoton 属于“有机磷（organophosphate）”类农药，常见风险是通过吸入、皮肤接触或误食进入人体，影响神经系统。","在阅读农药或环境新闻时，你可能还会看到“cholinesterase inhibitor（胆碱酯酶抑制剂）”这一描述，用来说明它的作用机制；学习时记住它与“神经毒性风险”相关即可。","该词多用于农业、毒理学、环境与法规语境；日常英语对话中很少出现。"]}
{"word":"disulfoxid","summary":{"en":"“Dimethyl sulfoxide (DMSO)” is a powerful solvent; “sulfoxide” is the chemical class it belongs to.","zh":"“Dimethyl sulfoxide（DMSO）”是常用强溶剂；“sulfoxide”是它所属的化学类别（亚砜）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Dimethyl sulfoxide (DMSO): a clear liquid chemical (C₂H₆OS) used mainly as a strong solvent in laboratories and industry; it can also carry some substances through the skin, so it must be handled carefully.","zh":"二甲基亚砜（DMSO）：一种无色透明的化学液体（C₂H₆OS），主要用作实验室和工业中的强溶剂；它还能帮助某些物质透过皮肤，因此使用时需要特别小心。"},"examples":[{"en":"In the lab, we dissolved the sample in DMSO before testing it.","zh":"在实验室里，我们先把样品溶解在DMSO中再进行测试。"},{"en":"DMSO can carry other chemicals through your skin, so wear gloves.","zh":"DMSO可能把其他化学物质带入皮肤里，所以要戴手套。"}]},{"partOfSpeech":"n.","definition":{"en":"Sulfoxide: a type of chemical compound that contains a sulfur–oxygen (S=O) group; DMSO is a common example.","zh":"亚砜：一类含有硫-氧（S=O）基团的化合物；二甲基亚砜（DMSO）就是常见例子。"},"examples":[{"en":"DMSO is a sulfoxide widely used as a solvent.","zh":"DMSO是一种广泛用作溶剂的亚砜。"}]}],"synonyms":["DMSO","dimethyl sulphoxide (BrE spelling)"],"phonetic":"/daɪˈmaɪθəl sʌlˈfɑːksaɪd/","extraExplanation":["你输入的“disulfoxid”看起来像拼写误差。最常见的相关词是“dimethyl sulfoxide（DMSO，二甲基亚砜）”或更一般的“sulfoxide（亚砜）”。如果你想查的是“disulfoxide（某种含两个亚砜基的化合物）”，请告诉我具体上下文或化学名称。"]}
{"word":"disulfoxide","summary":{"en":"A (rare) chemistry term for a compound with two sulfoxide (S=O) groups.","zh":"（较少见的）化学词，指含有两个亚砜（S=O）基团的化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(chemistry) A compound that contains two sulfoxide groups (–S(=O)–).","zh":"（化学）含有两个亚砜基（–S(=O)–）的化合物。"},"examples":[{"en":"The researchers synthesized a disulfoxide to study how two sulfoxide groups affect solubility.","zh":"研究人员合成了一种二亚砜化合物，以研究两个亚砜基如何影响溶解度。"},{"en":"In the paper, the new disulfoxide showed higher polarity than the related sulfide.","zh":"在论文中，这种新二亚砜的极性比相关的硫醚更强。"}]}],"synonyms":["sulfoxide (general class term)","bis-sulfoxide"],"phonetic":"/daɪˈsʌl.fɑk.saɪd/","extraExplanation":["“disulfoxide”在一般英语与常见化学语境中并不常见；很多人其实想写的是 **dimethyl sulfoxide**（二甲基亚砜，简称 **DMSO**），一种常用溶剂与实验室试剂。","词形拆解：**di-** 表示“两个/双”，**sulfoxide** 指“亚砜”（含 S=O 的官能团）。如果你是在看某篇具体论文或产品名称，最好提供上下文以确认它指的是“含两个亚砜基的化合物”，还是误写了 DMSO。"]}
{"word":"disulfuret","summary":{"en":"A rare/old-fashioned chemistry term meaning “disulfide,” a compound with two sulfur atoms.","zh":"一个较少见/较旧的化学用语，意思是“disulfide（二硫化物）”，即含有两个硫原子的化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry, rare) a compound containing two sulfur atoms; a disulfide.","zh":"（化学，较少见）含有两个硫原子的化合物；二硫化物（disulfide）。"},"examples":[{"en":"In modern textbooks, the term disulfide is used more often than disulfuret.","zh":"在现代教材中，“disulfide（二硫化物）”比“disulfuret”更常用。"},{"en":"Some older sources may describe a metal disulfuret when they mean a metal disulfide.","zh":"一些较旧的资料里会用“metal disulfuret”来表示“metal disulfide（金属二硫化物）”。"}]}],"synonyms":["disulfide"],"phonetic":"/daɪˈsʌlfjʊrət/","extraExplanation":["“disulfuret”在现代英语里非常少见，通常出现在较旧的化学文献或受法语/德语影响的写法中。学习和写作时更推荐使用更标准、更常见的词：disulfide（如 iron disulfide）。","常见相关词：sulfide（二硫化物的一类：含硫化物离子或与硫相关的化合物）、disulfide bond（二硫键，蛋白质中常见）。"]}
{"word":"disulfuric","summary":{"en":"“Disulfuric” means ‘containing two sulfur atoms,’ often referring to compounds related to disulfuric acid (H2S2O7).","zh":"“disulfuric”意为“含有两个硫原子”，常指与二硫酸（H2S2O7）相关的化合物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Containing two sulfur atoms; especially used to describe acids or compounds related to disulfuric acid (H2S2O7).","zh":"（化学）含有两个硫原子的；尤指用于描述与二硫酸（H2S2O7）有关的酸或化合物。"},"examples":[{"en":"Disulfuric acid is also called pyrosulfuric acid.","zh":"二硫酸也叫焦硫酸。"},{"en":"The disulfuric anion can appear in reactions involving strong sulfuric acid mixtures.","zh":"在涉及浓硫酸混合物的反应中，可能会出现二硫酸根阴离子。"}]}],"synonyms":["pyrosulfuric (in the phrase “pyrosulfuric acid”)","disulphuric (British spelling)"],"phonetic":"/ˌdaɪsʌlˈfʊrɪk/","extraExplanation":["“dis-”是英语里常见的前缀，表示“两个/双”。“disulfuric”常见于化学命名，用来强调结构中有两个硫原子。","二硫酸（H2S2O7）常与“发烟硫酸（oleum）”联系在一起：发烟硫酸可以看作是硫酸（H2SO4）与三氧化硫（SO3）的混合物，其中会形成与二硫酸相关的成分。日常英语中很少使用，主要出现在化学教材与科研语境中。"]}
{"word":"disulphate","summary":{"en":"A chemistry term for a compound containing the disulfate (pyrosulfate) ion, S₂O₇²⁻.","zh":"化学术语：指含有二硫酸根/焦硫酸根离子 S₂O₇²⁻ 的化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) A salt or ester that contains the disulfate (pyrosulfate) ion, S₂O₇²⁻, formed by joining two sulfate groups.","zh":"（化学）含有“二硫酸根/焦硫酸根”离子 S₂O₇²⁻ 的盐或酯；该离子可看作由两个硫酸根单元结合而成。"},"examples":[{"en":"Potassium disulphate is also called potassium pyrosulfate.","zh":"焦硫酸氢钾（也常说“焦硫酸钾/二硫酸钾”）也叫 potassium pyrosulfate。"},{"en":"In the lab, disulphate salts are sometimes used to help dry or dehydrate materials.","zh":"在实验室里，某些二硫酸盐有时用于帮助干燥或脱水材料。"}]}],"synonyms":["disulfate","pyrosulfate"],"phonetic":"/daɪˈsʌlˌfeɪt/","extraExplanation":["“disulphate”是英式拼写；美式更常写作“disulfate”。","在许多教材与化学命名中，S₂O₇²⁻更常称为“pyrosulfate（焦硫酸根）”。与“sulfate（硫酸根，SO₄²⁻）”不同，它是两个硫酸单元缩合（脱去一分子水的概念）形成的结构。"]}
{"word":"disulphid","summary":{"en":"Disulphide (US: disulfide) refers to a compound or bond featuring an –S–S– link between two sulfur atoms.","zh":"Disulphide（美式：disulfide）指含有两个硫原子相连的 –S–S– 结构的化合物或键。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound or group that contains a disulfide bond (two sulfur atoms joined together, written as –S–S–).","zh":"含有二硫键（两个硫原子相连，写作 –S–S–）的化合物或结构。"},"examples":[{"en":"Some proteins are stabilized by disulphide bonds.","zh":"一些蛋白质会被二硫键稳定。"},{"en":"The lab analyzed the disulphide content of the sample.","zh":"实验室分析了样品中的二硫化物含量。"}]}],"synonyms":["disulfide","disulphide bond","disulfide bond"],"phonetic":"/daɪˈsʌl.faɪd/","extraExplanation":["你输入的“disulphid”更常见的完整拼写是 **disulphide**（英式拼写），美式通常写作 **disulfide**。","二硫键在生物学里很常见，尤其在蛋白质折叠中：它像“安全扣”一样把蛋白质链的不同部分固定在一起。"]}
{"word":"disulphide","summary":{"en":"A disulphide (US: disulfide) is a compound or bond containing an –S–S– link between two sulfur atoms.","zh":"disulphide（美式常写disulfide）指含有两个硫原子以–S–S–相连的化合物或键。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (or group in a larger molecule) that contains two sulfur atoms joined by a single bond (–S–S–).","zh":"二硫化物；含有两个硫原子并以单键相连（–S–S–）的化合物（或分子中的基团）。"},"examples":[{"en":"Disulphide bonds help stabilize the three-dimensional shape of many proteins.","zh":"二硫键有助于稳定许多蛋白质的三维结构。"},{"en":"The lab measured the amount of disulphide in the sample.","zh":"实验室测量了样品中二硫化物的含量。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to or containing a disulfide (–S–S–) bond.","zh":"与二硫化物（–S–S–）键有关的；含有二硫键的。"},"examples":[{"en":"The disulphide linkage can be broken by certain reducing agents.","zh":"某些还原剂可以断开二硫键连接。"},{"en":"They analyzed disulphide-rich proteins.","zh":"他们分析了富含二硫键的蛋白质。"}]}],"synonyms":["disulfide","disulphide bond","disulfide bond"],"phonetic":"/daɪˈsʌlˌfaɪd/","extraExplanation":["“disulphide”是英式拼写；美式更常写作“disulfide”。两者含义相同。","在生物化学里常说“disulfide bond（二硫键）”，尤其指半胱氨酸（cysteine）之间形成的S–S键，对蛋白质折叠与稳定性很重要。"]}
{"word":"disulpho","summary":{"en":"Disulpho- is a chemistry combining form meaning “having two sulpho (–SO3H) groups.”","zh":"disulpho- 是化学构词成分，表示“含有两个磺酸基（–SO3H）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(chemistry, combining form) containing two sulpho (–SO3H) groups; “di-” (two) + “sulpho-” (sulfonic acid group).","zh":"（化学，构词成分）表示“含有两个磺酸基（–SO3H）/磺基”的；由 di-（两个）+ sulpho-（磺酸基）组成。"},"examples":[{"en":"A disulpho dye is often more water-soluble because it has two sulpho groups.","zh":"二磺基染料通常更易溶于水，因为它含有两个磺酸基。"},{"en":"The report mentions a disulpho-substituted aromatic compound.","zh":"报告提到一种“二磺基取代”的芳香族化合物。"}]}],"synonyms":["disulfo-","disulfonated (related term)"],"phonetic":"/daɪˈsʌlfoʊ/","extraExplanation":["“disulpho-”常见于英式/较传统的化学命名或文献中；在很多现代英文材料里也会写作“disulfo-”，意思相同。","它多出现在染料、表面活性剂和有机化学命名中，用来提示分子上有两个 –SO3H（磺酸）相关的取代基，从而影响溶解性与酸性等性质。"]}
{"word":"disulphonate","summary":{"en":"A chemistry term for something with two sulfonate (–SO3−) groups, or the process of adding two such groups.","zh":"化学术语：指含有两个磺酸盐（–SO3−）基团的物质，或指引入两个该基团的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) A compound, ion, or salt that contains two sulfonate groups (–SO3−).","zh":"（化学）含有两个磺酸盐基团（–SO3−）的化合物、离子或盐。"},"examples":[{"en":"The dye is a disulphonate, so it dissolves well in water.","zh":"这种染料是二磺酸盐，因此在水中溶解性很好。"},{"en":"We prepared a sodium disulphonate to improve the compound’s solubility.","zh":"我们制备了二磺酸钠来提高该化合物的溶解性。"}]},{"partOfSpeech":"v.","definition":{"en":"(Chemistry) To add or introduce two sulfonate groups (–SO3−) into a molecule; to convert a substance into a disulphonate.","zh":"（化学）在分子中引入两个磺酸盐基团（–SO3−）；使某物成为二磺酸盐。"},"examples":[{"en":"Chemists disulphonated the aromatic ring under strongly acidic conditions.","zh":"化学家在强酸条件下对芳环进行了二磺化处理。"},{"en":"This step disulphonates the intermediate and makes it more water-soluble.","zh":"这一步会使中间体二磺化，从而让它更易溶于水。"}]}],"synonyms":["disulfonate","bis(sulfonate)"],"phonetic":"/daɪˈsʌl.fəˌneɪt/","extraExplanation":["“disulphonate”常见于英式拼写；美式更常写作“disulfonate”。两者意义相同。","词根提示：di- 表示“两个”；sulphonate/sulfonate 指“磺酸盐（含 –SO3−）”。在染料、表面活性剂与药物化学中常用二磺酸盐来提高水溶性。"]}
{"word":"disulphone","summary":{"en":"Disulphone is a chemistry term meaning a compound with two sulfone groups; it’s a less common spelling of disulfone.","zh":"Disulphone 是化学术语，指含两个砜基的化合物；是 disulfone 的较少见拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A chemical compound that contains two sulfone groups (–SO₂–); a less common spelling of disulfone (more common in American English).","zh":"含有两个砜基（–SO₂–）的化合物；“disulfone”的一种较少见拼写（美式英语更常用 disulfone）。"},"examples":[{"en":"Researchers prepared a disulphone to study how two sulfone groups affect a molecule’s stability.","zh":"研究人员合成了一种 disulphone，用来研究两个砜基如何影响分子的稳定性。"},{"en":"Some older papers use the spelling disulphone instead of disulfone.","zh":"一些较早的论文会用 disulphone 这种拼写，而不是 disulfone。"}]}],"synonyms":["disulfone"],"phonetic":"/daɪˈsʌlfoʊn/","extraExplanation":["“sulphone”是英式/传统化学文献中对“sulfone”的拼写；因此“disulphone”常见于英式或较旧的资料中，而现代美式写法多为“disulfone”。","在化学命名里，“di-”表示“两个”；“sulfone/sulphone”指含有 –SO₂– 的官能团，所以 disulphone 指含两个该官能团的结构类型，而不一定是某一种特定单一分子。"]}
{"word":"disulphonic","summary":{"en":"Disulphonic describes a chemical compound that has two sulfonic acid groups (–SO3H).","zh":"disulphonic 指含有两个磺酸基（–SO3H）的化合物（或与二磺酸相关）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Containing two sulfonic acid groups (–SO3H) in a molecule; related to a disulfonic acid or its derivatives.","zh":"（化学）指分子中含有两个磺酸基（–SO3H）；与二磺酸或其衍生物有关。"},"examples":[{"en":"This dye becomes highly water‑soluble because it has disulphonic groups.","zh":"这种染料因为含有二磺酸基而高度水溶。"},{"en":"The disulphonic acid derivative was used to improve the compound’s stability in solution.","zh":"这种二磺酸衍生物用于提高该化合物在溶液中的稳定性。"}]}],"synonyms":["disulfonic","bis(sulfonic)"],"phonetic":"ˌdaɪsʌlˈfɑːnɪk","extraExplanation":["“disulphonic”主要见于英式拼写；美式与现代化学文献中更常见拼写是“disulfonic”。两者意思相同，都是“含两个磺酸基/二磺酸相关”的形容词。","常出现在染料、表面活性剂和某些药物/材料化学中，因为引入磺酸基通常能显著提高水溶性与带电性。"]}
{"word":"disulphoxid","summary":{"en":"“Disulphoxide” is a rare chemistry term referring to a sulfoxide-type compound; it’s often seen as “disulfoxide” (sulf- spelling).","zh":"“Disulphoxide”是较少见的化学术语，指一类亚砜相关化合物；更常见拼写为“disulfoxide”（sulf-写法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) A compound containing the sulfoxide group (S=O) in a structure with two sulfur-containing substituents; more commonly spelled “disulfoxide,” and often encountered in specific chemical names rather than as a general everyday word.","zh":"（化学）含有亚砜基（S=O）的化合物结构（与两个含硫取代基相关）；更常见拼写为“disulfoxide”，通常作为具体化学品名称的一部分出现，而不是日常通用词。"},"examples":[{"en":"In the paper, the authors synthesized a new disulphoxide and tested its stability.","zh":"在论文中，作者合成了一种新的 disulphoxide，并测试了它的稳定性。"},{"en":"The term “disulphoxide” is rare in general English and appears mostly in chemical contexts.","zh":"“disulphoxide”在普通英语中很少见，主要出现在化学语境里。"}]}],"synonyms":["disulfoxide","sulfoxide (broader term)"],"phonetic":"/daɪˈsʌlˌfɑk.saɪd/","extraExplanation":["你输入的“disulphoxid”很可能是拼写未完成或少了结尾的 e（应为 disulphoxide）。另外，英式拼写常用 sulph-，美式与国际化学命名更常用 sulf-（例如 disulf-）。","在实际阅读中，你更常见到的是具体的亚砜名称，例如 dimethyl sulfoxide（DMSO，二甲基亚砜）。如果你告诉我你想表达的具体化学物质/上下文（论文句子、实验材料等），我可以帮你确认最准确的英文术语与写法。"]}
{"word":"disulphoxide","summary":{"en":"Disulphoxide is a rare technical chemistry term for a compound containing a disulfoxide (disulphoxide) group.","zh":"Disulphoxide 是较少见的化学术语，指含有二亚砜（disulfoxide/disulphoxide）结构的化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound that contains a disulfoxide group (two sulfur atoms connected together, each bonded to oxygen); often used as a technical name in chemistry.","zh":"（化）含有“二亚砜/二硫氧化物”结构的化合物（两个硫原子相连，并与氧原子成键的结构）；多用于化学专业语境中的名称。"},"examples":[{"en":"The reaction produced a disulphoxide as an oxidation product.","zh":"该反应生成了二亚砜（disulphoxide）作为氧化产物。"},{"en":"Disulphoxides are discussed mainly in advanced organic chemistry texts.","zh":"二亚砜通常主要在高等有机化学教材中讨论。"}]}],"synonyms":["disulfoxide","disulphoxide compound","sulfur oxide (general category)"],"phonetic":"/daɪˈsʌl.fɑːk.saɪd/","extraExplanation":["“disulphoxide”较少见，很多情况下你会看到拼写为 **disulfoxide**（美式更常见）或 **disulphoxide**（英式用 sulph-）。","化学上常见的是 **DMSO (dimethyl sulfoxide，二甲基亚砜)**；而“disulfoxide/disulphoxide”指的是不同结构的一类化合物名，不一定特指某一个单独物质。","如果你是在论文或实验记录里看到这个词，建议结合具体分子式/结构式确认它到底指哪一种化合物。"]}
{"word":"disulphuret","summary":{"en":"Disulphuret is an old term for a sulfur compound, especially a disulfide.","zh":"disulphuret 是旧式术语，指含硫化合物，尤指二硫化物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry, old-fashioned) A compound in which sulfur combines with another element, especially a disulfide (containing two sulfur atoms).","zh":"（化学，旧式用法）硫与另一种元素形成的化合物，尤指二硫化物（含两个硫原子）。"},"examples":[{"en":"In older chemistry books, “carbon disulphuret” often refers to carbon disulfide (CS₂).","zh":"在较早的化学书中，“carbon disulphuret”常指二硫化碳（CS₂）。"},{"en":"The mineral was described as a disulphuret of iron, meaning an iron sulfide.","zh":"该矿物被描述为“disulphuret of iron”，意思是铁的硫化物。"}]}],"synonyms":["disulfide","sulfide","(old spelling) disulphide"],"phonetic":"/daɪˈsʌlfjərət/","extraExplanation":["“disulphuret”是一种较古老的化学术语与拼写：其中“sulphur”是英式旧拼（美式多写作“sulfur”），“-uret”常见于旧译名/旧命名体系里，现代教材与论文通常改用“disulfide / sulfide”等更规范的术语。","阅读旧文献时常见搭配：carbon disulphuret（= carbon disulfide, CS₂）、disulphuret of iron（多指铁的硫化物，如FeS或FeS₂，需结合上下文判断）。"]}
{"word":"disulphuric","summary":{"en":"“Disulphuric” means ‘related to disulfuric (pyrosulfuric) acid, H₂S₂O₇.’","zh":"“disulphuric”表示“与二硫酸/焦硫酸（H₂S₂O₇）有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to disulfuric acid (H₂S₂O₇), also called pyrosulfuric acid; used in names like “disulfuric acid” or “disulfuric anhydride.”","zh":"与二硫酸（H₂S₂O₇，也称焦硫酸）有关的；常用于化学名称中，如“二硫酸/焦硫酸”。"},"examples":[{"en":"Disulphuric acid is an important component of oleum.","zh":"二硫酸（焦硫酸）是发烟硫酸（oleum）的重要成分之一。"},{"en":"In the lab, we discussed the disulphuric species formed under very dry conditions.","zh":"在实验课上，我们讨论了在非常干燥条件下形成的二硫酸相关物种。"}]}],"synonyms":["disulfuric","pyrosulfuric"],"phonetic":"/ˌdaɪsʌlˈfjʊrɪk/","extraExplanation":["“disulphuric”是英式拼写；美式与现代 IUPAC 更常用“disulfuric”。两者指同一概念。","二硫酸/焦硫酸（H₂S₂O₇）可看作由两分子硫酸脱水形成（常写作：2 H₂SO₄ → H₂S₂O₇ + H₂O），并常与“oleum（发烟硫酸）”相关。"]}
{"word":"disunified","summary":{"en":"“Disunified” means not united or coordinated; divided.","zh":"“disunified”表示不团结、不协调、分裂的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not unified; lacking unity or agreement; divided into separate parts or groups.","zh":"不统一的；缺乏团结或一致的；分裂的。"},"examples":[{"en":"The committee looked disunified after the vote, with members arguing in public.","zh":"投票后委员会显得不团结，成员们在公开场合争吵。"},{"en":"A disunified strategy confused the team and slowed progress.","zh":"不统一的策略让团队困惑，进展也变慢了。"},{"en":"The country appeared disunified, with different regions pushing opposite goals.","zh":"这个国家看起来分裂，不同地区推动着相反的目标。"}]}],"synonyms":["divided","fragmented","split","not united","discordant"],"phonetic":"/dɪsˈjuːnəˌfaɪd/","extraExplanation":["“dis-”常表示“否定/相反”（如 disagree 不同意），“unify”是“统一/团结”。因此 disunified 字面意思就是“没有统一起来”。","这个词常用于政治、组织、团队语境，强调“缺乏一致立场或协调行动”。写作中也常用同义表达：divided / fragmented / not united。"]}
{"word":"disuniform","summary":{"en":"“Disuniform” means not uniform—uneven or irregular in form or distribution.","zh":"“disuniform”表示“不均匀/不一致”，即形状或分布不统一、参差不齐。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"not uniform; lacking consistent form, pattern, or distribution; irregular or uneven","zh":"不均匀的；不一致的；形状、模式或分布不统一的"},"examples":[{"en":"The paint dried in a disuniform layer because the room was too cold.","zh":"因为房间太冷，油漆干后形成了不均匀的一层。"},{"en":"They noticed a disuniform distribution of light across the screen.","zh":"他们注意到屏幕上的光线分布不均匀。"}]}],"synonyms":["nonuniform","uneven","irregular","inconsistent"],"phonetic":"/ˌdɪsˈjuːnəfɔːrm/","extraExplanation":["“dis-”常表示“否定/相反”（如 dishonest 不诚实），所以 disuniform 字面意思是“非均匀的”。不过在现代英语里更常用的词是 nonuniform / uneven / irregular；disuniform 比较少见，更多出现在较正式或技术性的写法中（例如描述材料、厚度、分布等）。"]}
{"word":"disuniformity","summary":{"en":"Disuniformity means a lack of uniformity—things are uneven or inconsistent across an area or group.","zh":"disuniformity 指“不统一、不均匀或不一致”的状态，常用于较正式或技术语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"lack of uniformity; the state of being not consistent, not even, or not the same throughout.","zh":"不一致；不统一；不均匀（指整体不相同、不整齐或不一致的状态）。"},"examples":[{"en":"The disuniformity of the paint color is noticeable under bright light.","zh":"在强光下，油漆颜色的不均匀很明显。"},{"en":"Engineers measured disuniformity in the material to improve product quality.","zh":"工程师测量材料的不均匀性，以提高产品质量。"}]}],"synonyms":["nonuniformity","unevenness","inconsistency","irregularity"],"phonetic":"/ˌdɪsˌjuːnəˈfɔːrmɪti/","extraExplanation":["这个词比较少见，常见于技术、工程或学术写作中。日常英语里更常用的是“nonuniformity / unevenness / inconsistency”。","构词上：dis-（否定）+ uniform（统一/一致的）+ -ity（名词后缀），表示“缺乏统一性”的抽象名词。"]}
{"word":"disunify","summary":{"en":"Disunify means to make something—or for something—to stop being unified; it’s a rare word, and speakers often use divide or disunite instead.","zh":"disunify 指使（或变得）不再统一、发生分裂；这个词较少见，更常用 divide 或 disunite 等表达。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make something no longer unified; to separate or break into parts (rare/uncommon word)","zh":"使不再统一；使分裂、分开（较少见的用词）"},"examples":[{"en":"The scandal threatened to disunify the party just before the election.","zh":"丑闻在选举前威胁到让该党分裂。"},{"en":"If we disunify the team, we lose the advantage of working together.","zh":"如果我们让团队分裂，就会失去协作的优势。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become less unified; to break apart (rare/uncommon word)","zh":"变得不再统一；瓦解（较少见的用词）"},"examples":[{"en":"Under pressure, the coalition began to disunify.","zh":"在压力下，这个联盟开始瓦解。"}]}],"synonyms":["divide","disunite","split","fragment","break up"],"phonetic":"ˌdɪsˈjuːnəˌfaɪ","extraExplanation":["“disunify”由前缀 dis-（表示“否定、分开”）+ unify（统一）构成，语义很直观，但在日常英语里并不常用。更常见、更自然的表达通常是：disunite（使分离/使不团结）、divide（分裂）、split（分开）、fragment（使碎裂/使分裂）、break up（解散）。","使用场景上，它多见于需要强调“从统一状态被打破”的语境（如政治联盟、组织、团队、系统架构）。如果写作想更地道，优先考虑上面更常见的同义词。"]}
{"word":"disunifying","summary":{"en":"“Disunifying” means causing disunity—making a group less united; it can also be the -ing form of “disunify.”","zh":"“disunifying”指造成不团结、削弱统一；也可作“disunify”的-ing形式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"causing people or parts of a group to stop being united; making unity weaker (often used to criticize an idea, policy, or event)","zh":"使人或群体不再团结；削弱团结（常用来批评某种观点、政策或事件）"},"examples":[{"en":"The new rule was disunifying because it treated some workers unfairly.","zh":"这项新规定具有“离心/不团结”的效果，因为它对部分员工不公平。"},{"en":"Online rumors can be disunifying in a community during a crisis.","zh":"在危机期间，网络谣言会对社区产生分裂与不团结的影响。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “disunify”: to make a group no longer unified","zh":"“disunify”的现在分词：使（群体）不再统一、团结"},"examples":[{"en":"The speech was disunifying the audience instead of bringing them together.","zh":"那场演讲没有把听众凝聚起来，反而在使他们产生分裂。"}]}],"synonyms":["divisive","polarizing","fragmenting","splitting","disruptive"],"phonetic":"/ˌdɪsˈjuːnəˌfaɪɪŋ/","extraExplanation":["“disunifying/ disunify”在日常英语里比较少见，更常用、更自然的说法是“divisive（引发分裂的）”“polarizing（两极化的）”“fragmenting（使碎片化的）”。","构词提示：dis-（否定/相反）+ unify（团结、统一）。因此它的核心意思就是“让原本的统一被打散”。","写作场景：多用于政治、社会议题、组织管理等语境，带有评价色彩，通常暗示“这种做法不利于凝聚共识”。"]}
{"word":"disunion","summary":{"en":"Disunion means a lack of unity or harmony, and can also refer to the breakup of a union, especially politically.","zh":"Disunion 指不团结、不和谐；也可指（尤指政治上的）联盟解体或分裂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The state of not being united; disagreement or a lack of harmony within a group, country, or organization.","zh":"不团结；分裂状态；（团体、国家或组织内部的）不和与缺乏一致。"},"examples":[{"en":"Political disunion can make it hard to solve national problems.","zh":"政治上的不团结会让解决国家问题变得很困难。"},{"en":"The team’s disunion showed in the way they blamed each other after the loss.","zh":"球队的不团结体现在他们输球后互相指责。"}]},{"partOfSpeech":"n.","definition":{"en":"A breakup of a union, especially a political separation (less common).","zh":"（尤指政治上的）联盟解体；分离（较不常用）。"},"examples":[{"en":"Some leaders warned that disunion could threaten the stability of the region.","zh":"一些领导人警告说，联盟解体可能威胁该地区的稳定。"},{"en":"The speech argued that disunion would weaken the country’s influence abroad.","zh":"演讲认为，分裂会削弱国家在海外的影响力。"}]}],"synonyms":["division","discord","dissension","fragmentation","rift"],"phonetic":"/dɪsˈjuːnjən/","extraExplanation":["“dis-”是表示“否定/相反”的前缀（如 disagree 不同意、dislike 不喜欢），union 表示“联合/团结”。所以 disunion 字面就是“缺少联合”。","在美国历史语境中，disunion 常与南北战争前后关于“联邦是否分裂”的讨论相关；在文学与演讲中也常与 unity（团结）对比使用，强调共同目标的重要性。"]}
{"word":"disunionism","summary":{"en":"Disunionism is the belief or movement that favors breaking up a union, especially a country, by separation or secession.","zh":"Disunionism 指主张解体或分裂统一体（尤其国家）、支持分离或脱离的思想或运动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The belief or political movement that supports breaking up a union (especially a country), such as separating states or regions from the whole.","zh":"主张解体/分裂统一体（尤指国家）的思想或政治运动，例如支持某些州或地区脱离整体。"},"examples":[{"en":"In the 1800s, accusations of disunionism often appeared in American political debates.","zh":"在19世纪，“分裂主义”的指控常出现在美国政治辩论中。"},{"en":"The speech warned that disunionism could lead to violence and long-term instability.","zh":"这篇演讲警告说，分裂主义可能导致暴力和长期不稳定。"}]},{"partOfSpeech":"n.","definition":{"en":"The act, tendency, or policy of promoting separation from an existing union.","zh":"推动从既有联盟或统一体中分离的行为、倾向或政策。"},"examples":[{"en":"The government tried to curb disunionism by opening negotiations.","zh":"政府试图通过开启谈判来遏制分裂倾向。"},{"en":"Many citizens rejected disunionism and argued for reform within the system.","zh":"许多公民反对分裂做法，主张在体制内改革。"}]}],"synonyms":["secessionism","separatism","disunion","factionalism"],"phonetic":"/dɪsˈjuːnjəˌnɪzəm/","extraExplanation":["这个词在现代英文里相对少见，更常见的表达是 secessionism（分离主义）或 separatism（分裂主义）。在美国历史语境中，disunionism 常与内战前后关于“联邦是否会分裂（disunion）”的争论相关，带有明显的政治与历史色彩。"]}
{"word":"disunionist","summary":{"en":"A disunionist is someone (or something) that supports breaking up a political union or a country.","zh":"disunionist 指支持国家或政治联盟分裂/解体的人，或指具有分裂主义倾向的。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who supports the breaking apart of a country or political union (for example, wanting a state or region to leave the union).","zh":"主张国家或政治联盟分裂的人；主张脱离联邦/联盟的人。"},"examples":[{"en":"During the Civil War era, some newspapers called secessionists “disunionists.”","zh":"在美国内战时期，一些报纸把主张脱离联邦的人称为“disunionists（分裂主义者）”。"},{"en":"He was accused of being a disunionist because he argued the region should leave the country.","zh":"他因为主张该地区应脱离国家而被指责为分裂主义者。"}]},{"partOfSpeech":"adj.","definition":{"en":"Supporting the breakup of a country or political union; favoring disunion.","zh":"支持国家或政治联盟分裂的；主张解体/脱离的。"},"examples":[{"en":"The senator warned that disunionist ideas could weaken the nation.","zh":"这位参议员警告说，分裂主义的思想可能会削弱国家。"},{"en":"They rejected the disunionist movement and called for unity.","zh":"他们反对分裂主义运动，呼吁团结。"}]}],"synonyms":["secessionist","separatist","cessionist"],"phonetic":"/ˌdɪsˈjuːnjənɪst/","extraExplanation":["该词常见于美国历史语境，尤其是19世纪围绕“联邦是否应维持统一”的争论中。它与“secessionist（主张脱离联邦者）”意思接近，但disunionist更强调“反对维持联盟/统一”的立场。","词形结构：dis-（否定、分开）+ union（联合、联盟）+ -ist（……主义者/从事者）。在写作中常带有批评或指责的语气，需注意语境与立场。"]}
{"word":"disunions","summary":{"en":"Disunions means divisions or a lack of unity (often political separation), the plural of disunion.","zh":"disunions 是 disunion 的复数，表示不团结、分裂（常指政治上的分离或联合破裂）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A lack of unity or harmony within a group; division or disagreement.","zh":"（团体内部的）不团结；分裂；不和。"},"examples":[{"en":"Constant arguments led to disunion in the team.","zh":"不断的争吵导致团队内部不团结。"},{"en":"The community worked hard to heal the disunion caused by rumors.","zh":"社区努力修复谣言造成的分裂。"}]},{"partOfSpeech":"n.","definition":{"en":"(Often in politics) The act or state of separating into parts; a break in an alliance or union.","zh":"（常用于政治语境）分离；（联盟或联合的）破裂；分裂状态。"},"examples":[{"en":"Leaders feared that disunion would weaken the country.","zh":"领导人担心分裂会削弱国家。"},{"en":"Talk of disunion increased during the crisis.","zh":"危机期间，关于分裂的讨论增多了。"}]}],"synonyms":["division","discord","disagreement","split","separation","dissension"],"phonetic":"/dɪsˈjuːnjən/","extraExplanation":["“disunion”在美国历史语境中很常见，尤其与南北战争前后关于国家是否会“分裂（the Union）”的讨论有关；因此在演讲、社论、历史写作中常带有强烈的政治与情绪色彩。","形式上，你输入的“disunions”是复数，常用来强调“多处/多方面的分裂与不和”（例如不同地区、派系之间的分裂）。"]}
{"word":"disunite","summary":{"en":"Disunite means to cause a group to lose unity, or to become no longer united.","zh":"disunite 指使群体失去团结、产生分裂，或（自身）不再团结。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"To separate people or groups that were united; to break unity or harmony.","zh":"使（原本团结的个人或群体）分裂；破坏团结或和谐。"},"examples":[{"en":"The scandal disunited the team just before the final match.","zh":"丑闻在决赛前让球队产生了分裂。"},{"en":"We should discuss disagreements calmly so they don’t disunite the family.","zh":"我们应冷静讨论分歧，避免让家庭因此分裂。"}]},{"partOfSpeech":"vi.","definition":{"en":"To become separated or stop being united.","zh":"（自身）分裂；不再团结。"},"examples":[{"en":"After the leader resigned, the party began to disunite.","zh":"领袖辞职后，该党开始分裂。"}]}],"synonyms":["divide","split","separate","fragment","alienate"],"phonetic":"/ˌdɪs.juːˈnaɪt/","extraExplanation":["词源上由 dis-（否定、分开）+ unite（联合、团结）构成，意思直观：把“联合”变成“不联合”。","语体上比常见的 separate / divide 更正式一些；在新闻、政治、历史语境中更常见，如“disunite the nation（使国家分裂）”。","同义表达可根据语气选择：divide（分裂/制造分歧，常用于意见或群体），split（更口语、强调裂开成两部分或多部分），fragment（强调碎片化、分散成很多小部分）。"]}
{"word":"disunited","summary":{"en":"Disunited means not united—people in a group don’t agree or work together well.","zh":"disunited 指“不团结的”，强调群体内部缺乏共识与合作。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not united; lacking agreement or cooperation within a group.","zh":"不团结的；不一致的；内部缺乏合作的。"},"examples":[{"en":"The team became disunited after the argument.","zh":"争吵之后，这支队伍变得不团结了。"},{"en":"A disunited family may struggle to make big decisions together.","zh":"不团结的家庭可能很难一起做出重大决定。"},{"en":"The country looked disunited in the face of the crisis.","zh":"面对危机，这个国家显得不够团结。"}]}],"synonyms":["divided","split","fragmented","discordant","fractured"],"phonetic":"/ˌdɪsjuˈnaɪtɪd/","extraExplanation":["词形结构：dis- 表示“否定/相反”（如 dishonest 不诚实的），united 表示“团结的/联合的”，合起来就是“没有团结起来的”。","常见搭配：a disunited team/family/party/country（不团结的团队/家庭/政党/国家）。","语义提醒：disunited 通常强调“内部不一致、各自为政”，比 simply “not united” 更带有“分裂、缺乏共识”的语气。"]}
{"word":"disuniter","summary":{"en":"A disuniter is someone or something that breaks unity and causes division.","zh":"disuniter 指造成不团结、引发分裂的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person or thing that causes people to stop being united; someone who divides a group","zh":"使人不再团结的人（或事物）；分裂者"},"examples":[{"en":"The speaker was criticized as a disuniter who turned neighbors against each other.","zh":"那位演讲者被批评为分裂者，挑起邻里对立。"},{"en":"In a crisis, rumors can act as disuniters in a community.","zh":"在危机中，谣言可能成为社区的“分裂因素”。"}]}],"synonyms":["divider","source of division","troublemaker","splitter","agitator"],"phonetic":"/ˌdɪs.juˈnaɪ.tɚ/","extraExplanation":["“disuniter”由 dis-（表示“分开、相反”）+ unite（团结）+ -er（做某事的人/物）构成，是一个比较少见、带明显贬义的词。日常表达中更常用 divider / source of division / troublemaker 等。"]}
{"word":"disuniters","summary":{"en":"“Disuniters” are people or things that make a group lose unity and become divided.","zh":"“Disuniters”指使群体失去团结、产生分裂的人或事物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People or things that cause a group to split, argue, or lose unity; forces that create division.","zh":"使团体分裂、失去团结的人或事物；造成分化的力量。"},"examples":[{"en":"Online rumors can become disuniters in a community, turning neighbors against each other.","zh":"网络谣言可能成为社区的“分裂因素”，让邻里彼此对立。"},{"en":"The leader warned that prejudice and fear are powerful disuniters.","zh":"领导者警告说，偏见和恐惧是强大的分裂因素。"},{"en":"Instead of looking for disuniters, the team focused on shared goals.","zh":"团队没有去寻找“分裂者”，而是专注于共同目标。"}]}],"synonyms":["dividers","sources of division","divisive forces","splitters","disruptors"],"phonetic":"/dɪsjuːˈnaɪtər/","extraExplanation":["“disuniters”是由动词“disunite（使分裂）”加表示“做这件事的人/物”的后缀“-er”构成的名词复数形式（disuniter → disuniters）。这个词在日常英语中不算常见，更常见的说法有“divisive forces / sources of division / people who divide us”。在正式或修辞性的语境（演讲、评论文章）里更容易看到。"]}
{"word":"disunites","summary":{"en":"“Disunites” means ‘separates’ or ‘causes people/groups to stop being united.’","zh":"“disunites”意为“使不团结、使分裂/分开”，是“disunite”的第三人称单数形式。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to make people, groups, or parts stop being united; to separate or break into smaller parts","zh":"使（人、团体或部分）不再团结；使分裂；使分离"},"examples":[{"en":"The scandal disunites the party just before the election.","zh":"这场丑闻在选举前让该党内部分裂。"},{"en":"Poor communication can disunite a team that used to work well together.","zh":"沟通不良会让原本配合默契的团队变得不团结。"}]},{"partOfSpeech":"vi.","definition":{"en":"to become no longer united; to split apart","zh":"变得不再团结；分裂开"},"examples":[{"en":"When trust is lost, families sometimes disunite.","zh":"当信任失去时，家庭有时会分崩离析。"}]}],"synonyms":["divide","split","separate","fragment","alienate"],"phonetic":"/ˌdɪsjuˈnaɪts/","extraExplanation":["“disunites”是动词“disunite”的第三人称单数现在时（he/she/it disunites）。","词源上由前缀“dis-”（表示“分开、相反”）+ “unite”（联合）构成，含义直观：把“联合”变成“分开”。","使用场景多见于较正式的写作或新闻评论中；日常口语里也常用“divide”或“split up”表达类似意思。"]}
{"word":"disunities","summary":{"en":"“Disunities” means divisions or disagreements—either a general lack of unity or multiple specific points of conflict.","zh":"“disunities”指分裂与不和：既可泛指缺乏团结，也可指多处具体分歧。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"lack of unity or agreement within a group; division or conflict among people.","zh":"（团体内部）缺乏团结或一致；分裂、不和、内讧。"},"examples":[{"en":"Disunities in the team made it hard to finish the project on time.","zh":"团队内部的不和让项目难以按时完成。"},{"en":"The leader tried to reduce disunities by encouraging open discussion.","zh":"领导试图通过鼓励公开讨论来减少分裂与矛盾。"}]},{"partOfSpeech":"n.","definition":{"en":"separate instances or types of disagreement or division (plural use).","zh":"（复数用法）多种/多起不一致、分歧或分裂的情况。"},"examples":[{"en":"The report listed several disunities between the two departments.","zh":"报告列出了两个部门之间的几处分歧。"},{"en":"Their disunities were small at first, but grew over time.","zh":"他们起初的分歧不大，但随着时间推移逐渐扩大。"}]}],"synonyms":["division","discord","dissension","disagreement","conflict","fragmentation"],"phonetic":"/ˌdɪsˈjunəti/","extraExplanation":["“disunities”是名词“disunity”的复数形式。英语里更常见的是用不可数的“disunity”来泛指“缺乏团结”，而用“disunities”时通常强调“多处/多种具体分歧”。","常见搭配：political disunity（政治不团结）、internal disunity（内部不和）、disunity within/between...（在……内部/……之间的不一致）。"]}
{"word":"disuniting","summary":{"en":"“Disuniting” means breaking unity—separating people/things or causing division.","zh":"“disuniting”表示破坏团结、使分离或造成分裂。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of disunite) separating people or things that were united; causing a group to lose unity or agreement.","zh":"（disunite 的现在分词）使原本团结/结合的人或事物分开；使群体失去团结或一致。"},"examples":[{"en":"The scandal is disuniting the party ahead of the election.","zh":"丑闻正在使该党在选举前变得不团结。"},{"en":"Harsh words can be disuniting in a family.","zh":"刻薄的话会让家庭变得不和。"}]},{"partOfSpeech":"n.","definition":{"en":"(gerund) the act or process of breaking unity; separation or division.","zh":"（动名词）破坏团结的行为/过程；分裂、离散。"},"examples":[{"en":"Disuniting a team is easy; rebuilding trust takes time.","zh":"让团队分裂很容易；重建信任却需要时间。"}]}],"synonyms":["dividing","splitting (up)","fragmenting","tearing apart","causing a rift"],"phonetic":"/dɪs.juːˈnaɪ.tɪŋ/","extraExplanation":["“disunite / disuniting”在现代英语中不算常用，更常见的表达是“divide”“split up”“tear apart”“cause a rift”。在正式写作或政治/社会话题中，用“disuniting”可以强调“原本在一起的整体被破坏团结”。"]}
{"word":"disunity","summary":{"en":"Disunity means a lack of unity or agreement within a group—division that keeps people from working together.","zh":"Disunity 指团体内部缺乏团结或共识的状态，即分裂与不一致，导致无法协同。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Lack of unity or agreement within a group; division that prevents people from acting together.","zh":"（团体内部）不团结；分裂；缺乏一致性，导致无法齐心协力。"},"examples":[{"en":"Disunity within the team made it hard to finish the project on time.","zh":"团队内部的不团结让他们很难按时完成项目。"},{"en":"The leader tried to reduce disunity by encouraging open communication.","zh":"领导试图通过鼓励坦诚沟通来减少分裂。"},{"en":"Disunity in the community grew after the controversial decision.","zh":"有争议的决定之后，社区的分裂加剧了。"}]}],"synonyms":["division","discord","dissension","fracture","disagreement"],"phonetic":"/dɪsˈjunəti/","extraExplanation":["“dis-” 是常见前缀，表示“否定/相反/分开”。“disunity”= dis-（分开）+ unity（团结），因此核心含义是“不能形成一个整体”。","语气通常偏负面，常用于政治、组织、家庭或团队语境，强调“内部的矛盾、派系或意见不合”。","近义词侧重差异：division 常指“分裂/分割”（也可指地理或组织划分）；discord 强调“不和/争吵”；conflict 更强烈，表示“冲突”。“disunity”更强调“缺乏一致与凝聚力”。"]}
{"word":"disusage","summary":{"en":"“Disusage” means the stopping of use; disuse.","zh":"“disusage”指“停止使用；不再使用”（相当于 disuse）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the stopping of use; the condition of no longer being used (disuse).","zh":"停止使用；不再使用的状态（同 disuse）。"},"examples":[{"en":"The disusage of the old factory began after new safety laws were introduced.","zh":"新安全法规出台后，那座老工厂就开始停止使用了。"},{"en":"Over time, the disusage of these words made them sound old-fashioned.","zh":"随着时间推移，这些词不再使用，听起来就显得过时了。"}]}],"synonyms":["disuse","abandonment","discontinuation"],"phonetic":"/dɪsˈjuːsɪdʒ/","extraExplanation":["“disusage”是比较少见、偏正式的词，现代英语中更常用“disuse”。在学术写作或法律/行政语境里偶尔会看到，用来强调“停止使用/废止”的状态或过程。"]}
{"word":"disusance","summary":{"en":"“Disusance” is a rare/obsolete noun meaning “disuse,” the state of no longer being used.","zh":"“disusance”是罕见/陈旧名词，意思相当于“disuse（弃用）”，指不再被使用的状态。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare/obsolete) the state of not being used; disuse.","zh":"（罕见/陈旧用法）不再使用的状态；弃用。"},"examples":[{"en":"The word fell into disusance over time and is rarely seen today.","zh":"这个词随着时间推移被弃用，如今很少见到。"},{"en":"Some traditions slip into disusance when people move away from rural life.","zh":"一些传统在人们远离乡村生活后会逐渐被弃用。"}]}],"synonyms":["disuse","neglect","abandonment","obsolescence"],"phonetic":"/dɪˈzjuːzəns/","extraExplanation":["“disusance”在现代英语中非常少见，很多情况下会被当作拼写错误或不自然的造词。更常见、自然的表达是“disuse”（弃用、荒废）或“fall into disuse”（逐渐不用）。","容易混淆的词是“dissonance”（不和谐；不协和），拼写相近但意思完全不同：dissonance常用于音乐（不协和音）或心理/观点（不一致、冲突）。","如果你是在学术或历史文本里看到“disusance”，通常可按“disuse”理解；日常写作建议直接用“disuse”，更地道。"]}
{"word":"disuse","summary":{"en":"Disuse means a lack of use (noun) or the act of stopping using something (verb).","zh":"Disuse指“不再使用/长期不用”（名词），也可指“停止使用”（动词）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state of no longer being used; lack of use over time","zh":"不再使用的状态；长期不用"},"examples":[{"en":"The old train station fell into disuse after the new line opened.","zh":"新线路开通后，老火车站逐渐被弃用。"},{"en":"Some words have fallen into disuse, but you may still see them in classic books.","zh":"有些词已经逐渐不用了，但你仍可能在经典作品中看到。"}]},{"partOfSpeech":"v.","definition":{"en":"to stop using something; to cease to employ or practice","zh":"停止使用；不再采用或练习"},"examples":[{"en":"Many people have disused cash for daily payments and now rely on mobile apps.","zh":"许多人日常支付已经很少用现金，转而依赖手机应用。"},{"en":"After the injury, she disused her right arm for weeks.","zh":"受伤后，她有好几周都没怎么用右臂。"}]}],"synonyms":["neglect","nonuse","abandonment","discontinue","stop using"],"phonetic":"/dɪsˈjus/","extraExplanation":["“fall into disuse”是非常常见的固定搭配，意思是“逐渐被弃用/不再流行”。常用于谈论建筑、制度、习俗、词语等慢慢不再被使用。","注意拼写：disuse（不用/弃用）不要和 misuse（误用/滥用）混淆。前者强调“用得少或不用”，后者强调“用法不当”。"]}
{"word":"disused","summary":{"en":"“Disused” means something used in the past but not used anymore.","zh":"“disused”指“以前用过，但现在不再使用/已废弃的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"No longer used or no longer in use; unused, often because something has become old or replaced.","zh":"不再使用的；废弃的（常因过时或被替代）。"},"examples":[{"en":"They turned a disused factory into art studios.","zh":"他们把一座废弃的工厂改造成了艺术工作室。"},{"en":"A disused railway line runs behind the village.","zh":"村子后面有一条废弃的铁路线。"},{"en":"The old phone booth is disused now.","zh":"那座旧电话亭现在已经不用了。"}]}],"synonyms":["abandoned","unused","obsolete","out of use"],"phonetic":"/dɪsˈjuzd/","extraExplanation":["“disused”常用来形容建筑、设施、道路、线路等“曾经使用过、但现在停用”的事物，带有“被闲置/废弃”的感觉。","与“unused”相比：unused更强调“从没用过/未被使用”，disused更强调“以前用过、现在不用了”。","在城市更新与文学描写中常见：如“disused warehouses / tunnels / mills（废弃仓库/隧道/磨坊）”，常营造荒凉、衰败或怀旧的氛围。"]}
{"word":"disuses","summary":{"en":"“Disuses” is either (1) the verb form meaning ‘stops using,’ or (2) the plural noun meaning ‘cases/states of not being used.’","zh":"“disuses”既可作动词第三人称单数，表示“停止使用”；也可作名词复数，表示“闲置/不用的情况（多个）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to stop using something; to end a practice or habit","zh":"停止使用（某物）；不再沿用（做法或习惯）"},"examples":[{"en":"The company disuses the old software after the update.","zh":"更新之后，公司不再使用旧软件。"},{"en":"Over time, people may disuse words that feel old-fashioned.","zh":"随着时间推移，人们可能会不再使用一些显得过时的词。"}]},{"partOfSpeech":"n.","definition":{"en":"the state of not being used; lack of use over time","zh":"不再使用的状态；久置不用"},"examples":[{"en":"The building fell into disuse after the factory closed.","zh":"工厂关闭后，这栋楼逐渐被闲置。"},{"en":"Without practice, a skill can weaken through disuse.","zh":"如果不练习，技能会因久不使用而退化。"}]}],"synonyms":["abandon","discard","drop","cease using","neglect"],"phonetic":"/dɪsˈjus/","extraExplanation":["“disuses”可以是动词第三人称单数（He/She disuses...），也可以是名词复数（different disuses of old tools）。","重音通常在第二个音节：di-USE（/dɪsˈjus/）。"]}
{"word":"disusing","summary":{"en":"“Disusing” means no longer using something (the -ing form of “disuse”).","zh":"“disusing”表示“不再使用、停用”，是“disuse”的 -ing 形式。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of disuse) stopping the use of something; no longer using it.","zh":"（disuse 的现在分词）停止使用某物；不再使用。"},"examples":[{"en":"The company is disusing its old software and moving to a cloud system.","zh":"这家公司正在停用旧软件，转而使用云系统。"},{"en":"By disusing plastic bags, we can reduce waste.","zh":"通过不再使用塑料袋，我们可以减少垃圾。"}]}],"synonyms":["stopping using","phasing out","dropping","discontinuing"],"phonetic":"dɪsˈjus","extraExplanation":["“disuse”由前缀 dis-（表示“否定、去除”）+ use（使用）组成，意思是“停止使用”。“disusing”常见于较正式的书面语或说明文。","注意区分：disuse（停止使用/荒废）≠ misuse（误用、滥用）。","名词 disuse 也常见：“fall into disuse”（逐渐废弃、不再通行），如某些词语或习俗“逐渐不用了”。"]}
{"word":"disutility","summary":{"en":"Disutility means harm or negative usefulness; in economics, it is the negative satisfaction (dissatisfaction) caused by costs like effort, pain, risk, or inconvenience.","zh":"Disutility 指“负效用/不利影响”；在经济学中常指由努力、痛苦、风险或不便等造成的负面满足感（不满意）的衡量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A negative effect or harm; the opposite of usefulness or benefit.","zh":"负效用；不利影响；损害（与“有用/收益”相反）"},"examples":[{"en":"Long commutes create disutility because they waste time and increase stress.","zh":"长时间通勤会带来负效用，因为它浪费时间并增加压力。"},{"en":"The policy’s disutility to small businesses may outweigh its benefits.","zh":"这项政策对小企业造成的不利影响可能超过其好处。"}]},{"partOfSpeech":"n.","definition":{"en":"In economics, a measure of dissatisfaction or “negative utility” from something (such as pain, effort, risk, or cost).","zh":"（经济学）负效用：用来衡量由痛苦、努力、风险或成本等带来的“不满意/负的效用”的指标"},"examples":[{"en":"Working overtime can bring extra pay, but it also brings disutility from fatigue.","zh":"加班可能带来额外收入，但也会带来疲劳的负效用。"},{"en":"Economists sometimes model risk as disutility that people try to avoid.","zh":"经济学家有时把风险建模为人们想要避免的负效用。"},{"en":"The disutility of waiting in line makes customers less likely to return.","zh":"排队等待的负效用会让顾客不太愿意再来。"}]}],"synonyms":["harm","drawback","disadvantage","negative utility","dissatisfaction"],"phonetic":"/ˌdɪsjuːˈtɪləti/","extraExplanation":["“disutility”常见于经济学、公共政策与成本—收益分析中，表示除了金钱成本以外的“负面体验/代价”（如不便、时间损失、焦虑、疲劳）。","词根提示：dis-（否定/相反）+ utility（效用/有用性），直观理解为“负的效用”。","相关对比：utility（效用/满足感）；cost（成本，常偏金钱或资源）；disbenefit（不利后果，偏结果描述）。"]}
{"word":"disutilize","summary":{"en":"Disutilize means to stop using something or to make it no longer useful.","zh":"disutilize 指“停止使用某物”或“使某物失去用途”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to stop using something; to put something out of use","zh":"停止使用；使不再被使用"},"examples":[{"en":"After the new system launched, the company disutilized the old software within a month.","zh":"新系统上线后，公司在一个月内停止使用旧软件。"},{"en":"The city plans to disutilize several outdated machines to cut energy waste.","zh":"市政府计划停用几台过时的机器以减少能源浪费。"}]},{"partOfSpeech":"vt.","definition":{"en":"to make something useless or no longer useful","zh":"使变得无用；使失去用途"},"examples":[{"en":"Neglect can disutilize a tool just as quickly as heavy use.","zh":"忽视保养会像频繁使用一样迅速让工具失去用途。"},{"en":"Poor storage conditions disutilized many of the supplies.","zh":"不良的储存条件使许多物资变得无法使用。"}]}],"synonyms":["disuse","stop using","phase out","retire","decommission","render useless"],"phonetic":"/ˌdɪsˈjuːtəˌlaɪz/","extraExplanation":["“disutilize”很少见，属于较书面/生硬的构词（dis- + utilize）。日常英语里更常用：disuse（停止使用）、stop using（停止使用）、phase out（逐步淘汰）、retire（使退役/停用）、render useless（使无用）。","“disuse”通常强调“停止使用”的状态；“disutilize”有时也会被用来强调“使之失去用途/价值”，但在现代英语中不算常见。"]}
