{"word":"dit","summary":{"en":"“dit” is usually seen as the abbreviation DIT (Digital Information Technology) or, in French-style names, meaning “called/also known as.”","zh":"“dit”通常见于缩写DIT（数字信息技术），或在法语式姓名中表示“又名/被称为”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) Digital Information Technology; used mainly in school or workplace contexts, especially in course names, departments, or job titles.","zh":"（缩写）数字信息技术；多用于课程名称、部门或岗位名称等语境。"},"examples":[{"en":"She’s studying DIT at a technical college.","zh":"她在技术学院学习DIT（数字信息技术）。"},{"en":"He applied for a position in the DIT department.","zh":"他申请了DIT部门的职位。"}]},{"partOfSpeech":"v.","definition":{"en":"(v.) In names (from French), meaning “called” or “also known as,” used in genealogical or historical records.","zh":"（动词，用于姓名中，源自法语）表示“被称为/又名”，常见于家谱或历史记录。"},"examples":[{"en":"Jean Martin dit ‘Le Rouge’ appears in the record.","zh":"记录中出现了“Jean Martin，又名‘Le Rouge（红发/红脸者）’”。"},{"en":"The family used a dit name to distinguish different branches.","zh":"这个家族用“dit（又名）”来区分不同支系。"}]}],"synonyms":["also known as","alias","called"],"phonetic":"/dɪt/","extraExplanation":["在英语里，dit 不是常见的日常单词。你更可能在两类场景看到它：\n1）作为缩写 DIT（数字信息技术）；\n2）在法语背景的姓名写法里（尤其是加拿大法裔、法国旧档案），用“X dit Y”表示“X 被称为 Y/又名 Y”。这种 dit name 有点像外号或家族别名，用来区分同名的人或不同分支。"]}
{"word":"Dita","summary":{"en":"Dita is usually a woman’s first name, and it can also refer to the performer Dita Von Teese in pop-culture contexts.","zh":"Dita 通常是女性名字；在流行文化语境中也可指表演者 Dita Von Teese。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a feminine given name (a personal name), used in several countries.","zh":"女性名字（人名），在多个国家和地区使用。"},"examples":[{"en":"Dita is my cousin’s name.","zh":"Dita 是我表姐的名字。"},{"en":"In our class, Dita sits next to me.","zh":"在我们班里，Dita 坐在我旁边。"}]},{"partOfSpeech":"n.","definition":{"en":"a short form used to refer to the performer Dita Von Teese (an American burlesque dancer and model), especially in entertainment or fashion contexts.","zh":"在娱乐或时尚语境中，对表演者 Dita Von Teese（美国滑稽歌舞/新复古艳舞演员与模特）的简称。"},"examples":[{"en":"Have you seen Dita’s latest photo shoot?","zh":"你看过 Dita 最新的写真吗？"},{"en":"That look is very ‘Dita’—classic and glamorous.","zh":"那种风格很“Dita”——经典又华丽。"}]}],"phonetic":"/ˈdiːtə/","extraExplanation":["“Dita”作为人名在不同语言里来源不一：在一些地区它可作“Edith（伊迪丝）”的昵称；在波罗的海国家（如立陶宛）也有人将其与“Edita”等名字联系起来。作为专有名词时，常需根据上下文判断是普通人名还是指特定名人。"]}
{"word":"dita","summary":{"en":"“DITA” most commonly refers to an XML-based standard for technical documentation; “Dita” can also be a personal name.","zh":"“DITA”最常见指一种用于技术文档的 XML 标准；“Dita”也可以是人名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(technology) Darwin Information Typing Architecture: an XML-based standard for writing and managing technical documents in small reusable topics (often used for manuals and help systems).","zh":"（技术）DITA（Darwin Information Typing Architecture，达尔文信息类型架构）：一种基于 XML 的技术写作与内容管理标准，把文档拆成可复用的“主题（topics）”，常用于说明书、帮助文档等。"},"examples":[{"en":"Our software manual is written in DITA so we can reuse the same topics in different products.","zh":"我们的软件手册用 DITA 编写，这样可以在不同产品中复用同一套主题内容。"},{"en":"The team migrated from Word files to a DITA workflow to improve consistency.","zh":"团队从 Word 文档迁移到 DITA 工作流，以提高一致性。"},{"en":"DITA allows writers to publish the same content to PDF and web help.","zh":"DITA 让写作者可以把同一份内容发布成 PDF 和网页帮助文档。"}]},{"partOfSpeech":"n.","definition":{"en":"A given name (usually feminine), used in several cultures.","zh":"人名（多为女性名），在多种文化中使用。"},"examples":[{"en":"Dita introduced herself at the meeting.","zh":"Dita 在会议上做了自我介绍。"},{"en":"I met a designer named Dita in New York.","zh":"我在纽约认识了一位叫 Dita 的设计师。"}]}],"synonyms":["Darwin Information Typing Architecture"],"phonetic":"/ˈdiːtə/","extraExplanation":["在技术语境里，“DITA”通常指 IBM 在 2000 年代初推动的技术文档标准，核心思想是把内容模块化（topic-based authoring）并通过“映射（map）”组织成不同版本的输出。","日常对话中如果看到小写“dita”，也可能只是人名或用户名；是否是缩写，往往要看上下文（例如是否和 XML、manual、documentation 等词一起出现）。"]}
{"word":"dital","summary":{"en":"“Dital” is likely a misspelling of “digital,” meaning computer/internet-related or electronic.","zh":"“dital”很可能是“digital”的拼写错误，意思多为“数字的、与电脑/互联网相关的、电子化的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely intended) related to computers, the internet, or information stored/processed in electronic form.","zh":"（可能想写的是）数字的；与电脑、互联网有关的；以电子形式存储/处理信息的。"},"examples":[{"en":"Many schools now use digital textbooks instead of printed ones.","zh":"许多学校现在用数字教材代替纸质教材。"},{"en":"Please send me a digital copy of your ID.","zh":"请把你的身份证电子版发给我。"}]},{"partOfSpeech":"adj.","definition":{"en":"Using fingers or the sense of touch (common in phrases like “digital examination”).","zh":"手指的；触觉的（常见于如“digital examination（指检）”等表达）。"},"examples":[{"en":"The doctor performed a digital examination.","zh":"医生进行了指检。"}]}],"synonyms":["electronic","computer-based","online","digitized"],"phonetic":"/ˈdɪdʒɪtəl/","extraExplanation":["“dital”不是常见英文单词，最可能是“digital”的拼写错误：di-gi-tal（中间有“gi”）。","“digital”来自“digit”（数字/手指）。早期与“手指”有关；现代最常用含义是“数字化、电子化、与电脑相关”。","常见搭配：digital device（数码设备）、digital payment（电子支付）、digital footprint（数字足迹）、digital literacy（数字素养）。"]}
{"word":"ditali","summary":{"en":"Ditali is a small, short tube pasta often used in soups.","zh":"Ditali 是一种短小的管状意大利面，常用于汤品。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small, short tube-shaped pasta (an Italian word meaning “thimbles”), often used in soups.","zh":"一种很短的小管状意大利面（意大利语原意为“顶针”），常用于汤类。"},"examples":[{"en":"Ditali is often used in minestrone or pasta e fagioli.","zh":"Ditali 常用于意式蔬菜汤（minestrone）或豆子意面汤（pasta e fagioli）。"},{"en":"Add ditali to the soup and cook until tender.","zh":"把 ditali 加进汤里，煮到变软熟透即可。"}]}],"synonyms":["ditalini","small tube pasta"],"phonetic":"/diˈtɑli/","extraExplanation":["“ditali”来自意大利语，字面意思是“顶针”（复数形式）。在英文菜单或食谱里，它通常指这种短短的管状面。你也可能看到更常见的写法“ditalini”（指更小号的 ditali）。"]}
{"word":"ditalini","summary":{"en":"Ditalini is a small tube-shaped pasta commonly used in soups.","zh":"Ditalini 是一种常用于汤里的小管状意大利面。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A small, short, tube-shaped pasta (like tiny “thimbles”), often used in soups and pasta salads.","zh":"一种小而短的管状意大利面（像小“顶针”），常用于汤品或意面沙拉。"},"examples":[{"en":"I made minestrone soup with ditalini pasta.","zh":"我用 ditalini 小管面做了意式蔬菜汤。"},{"en":"Ditalini is great because it fits well on a spoon.","zh":"ditalini 很适合用勺子吃，因为它大小刚好。"},{"en":"For a quick lunch, mix ditalini with olive oil, tomatoes, and basil.","zh":"想做快速午餐，可以把 ditalini 和橄榄油、番茄、罗勒拌在一起。"}]}],"synonyms":["small tube pasta","ditali (larger size)"],"phonetic":"/ˌdiːtəˈliːni/","extraExplanation":["“Ditalini”来自意大利语，字面意思接近“小指套/小顶针”（ditale=指套，-ini=小的复数后缀），所以形状就是短短的小管。","在英文菜单或食谱里常直接写作 ditalini；它和 ditali（更大一号）是同一家族，适合做浓汤、炖菜或冷拌沙拉。"]}
{"word":"ditas","summary":{"en":"“Ditas” is usually a person’s name, not a common English word.","zh":"“Ditas”通常是人名，并非常见英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A personal name (given name or surname). It is not a common standard English vocabulary word.","zh":"人名（名字或姓氏）。它不是常见的标准英语词汇。"},"examples":[{"en":"Ditas introduced herself at the meeting.","zh":"Ditas 在会议上做了自我介绍。"},{"en":"I got an email from Ditas this morning.","zh":"我今天早上收到了 Ditas 的邮件。"}]}],"phonetic":"/ˈdiːtɑːs/","extraExplanation":["“ditas”在英语里不是常见词条，更常见的情况是：你可能想查的是“ditto”（表示“同上；也一样”）或“data”（数据）。如果你告诉我你看到它的句子/语境，我可以帮你判断具体是哪一个。","如果你是在东南亚语境（如菲律宾、印尼）看到 Ditas，它更可能是人名，因此英语里通常按专有名词使用并首字母大写：Ditas。"]}
{"word":"ditation","summary":{"en":"Dictation means speaking so someone can write, or a listening-and-writing test; it can also mean strict control or ordering.","zh":"Dictation 指“口述”或“听写”；也可指“专横的控制/强硬命令”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The act of speaking words aloud so someone else can write them down; also, a spoken test where you write what you hear.","zh":"口述（让别人把你说的话写下来）；也指“听写”（听到后写下来的测试）。"},"examples":[{"en":"The teacher gave us a dictation in class today.","zh":"老师今天在课堂上给我们做了听写。"},{"en":"Please speak slowly during the dictation so I can write everything down.","zh":"口述时请说慢一点，这样我才能把内容都写下来。"}]},{"partOfSpeech":"n.","definition":{"en":"Strong control or the act of giving orders in an unfriendly way (often used in the phrase “under the dictation of”).","zh":"专横的控制；强硬地下命令（常见于短语“under the dictation of”）。"},"examples":[{"en":"He acted under the dictation of his manager rather than making his own decisions.","zh":"他是在经理的强势指挥下行事，而不是自己做决定。"}]}],"synonyms":["transcription (test context)","dictating","command (control sense)"],"phonetic":"/dɪkˈteɪʃən/","extraExplanation":["“ditation”通常被认为是拼写错误，更常见的正确拼写是 **dictation**。","词根提示：**dict-** 来自拉丁语 *dicere*（说），也出现在 **dictate**（口述/命令）、**dictionary**（词典）等词里。"]}
{"word":"ditch","summary":{"en":"“Ditch” most commonly means a dug channel for water; informally it can mean to abandon or get rid of someone/something, and in aviation it means to make an emergency landing on water.","zh":"“ditch”最常见指“沟渠/壕沟”；口语里也可指“甩掉、抛弃”；在航空语境中指“飞机紧急迫降在水面”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A long, narrow channel dug in the ground, usually to carry away water or mark a boundary.","zh":"沟渠；壕沟（通常用于排水或作边界）。"},"examples":[{"en":"After the storm, the roadside ditch filled with water.","zh":"暴风雨过后，路边的沟渠里灌满了水。"},{"en":"The farmer dug a ditch to drain the field.","zh":"农民挖了一条沟来给田地排水。"}]},{"partOfSpeech":"vt.","definition":{"en":"To get rid of someone or something on purpose; to leave or abandon (often informal).","zh":"甩掉；抛弃；放弃（常为非正式用法）。"},"examples":[{"en":"He ditched his old phone when he bought a new one.","zh":"他买了新手机后就把旧手机扔掉了。"},{"en":"Don’t ditch your friends when things get difficult.","zh":"事情变难时别抛下朋友不管。"}]},{"partOfSpeech":"vt.","definition":{"en":"To land an aircraft on water in an emergency.","zh":"（飞机）紧急迫降在水面上。"},"examples":[{"en":"The pilot had to ditch the plane in the ocean after the engine failed.","zh":"发动机失灵后，飞行员不得不把飞机紧急迫降在海面上。"}]}],"synonyms":["trench","channel","abandon","dump","drop"],"phonetic":"/dɪtʃ/","extraExplanation":["“ditch”作动词表示“甩掉/抛弃”时语气偏口语，有时带负面评价，尤其指“抛下责任或朋友”。在学校语境里，ditch class 意为“逃课”。","“ditch”作名词的基本意象是“挖出来的长沟”，因此和 drain（排水）、trench（战壕/深沟）等词在画面感上相近，但 trench 往往更深、更像“壕沟/战壕”。","航空语境里的“ditch（迫降水面）”较正式，常见搭配是 ditch a plane / ditch in the sea。"]}
{"word":"ditchbank","summary":{"en":"A ditchbank is the raised edge of land next to a ditch.","zh":"ditchbank 指沟渠旁边隆起的地面（土埂/沟岸）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the raised edge of earth alongside a ditch (a long, narrow channel for drainage or irrigation)","zh":"沟渠旁边堆起或自然形成的土埂／沟岸"},"examples":[{"en":"Wildflowers grew along the ditchbank beside the road.","zh":"路边的沟岸上长满了野花。"},{"en":"The farmer repaired the ditchbank after heavy rain washed some soil away.","zh":"大雨冲走了一些泥土后，农民修补了沟岸。"}]}],"synonyms":["ditch bank","ditch side","ditch edge","embankment"],"phonetic":"/ˈdɪtʃˌbæŋk/","extraExplanation":["“ditchbank”多见于乡村、农田排水系统或道路排水沟的语境，强调“沟边的土坡/土埂”。有时也会写作两个词“ditch bank”。在不同地区，人们也可能用“ditch side / ditch edge / embankment”来表达相近意思。"]}
{"word":"ditchbur","summary":{"en":"“ditchbur” is not a recognized English word; it’s likely a typo or a name. Provide the sentence/context and I’ll help identify the intended word.","zh":"“ditchbur”不是常见英语词，可能是拼写错误或名称。把句子/上下文发我，我可以帮你判断原本想写的词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or a made-up/username form. You may have meant “ditch” (a trench; or to abandon), “ditcher” (a person who digs ditches), or “ditch bur” (two separate words).","zh":"不是标准英语单词。很可能是拼写错误，或是自造词/用户名。你可能想写的是“ditch”（沟渠；或“抛弃/甩掉”）、“ditcher”（挖沟的人），或把“ditch bur”当作两个词。"},"examples":[{"en":"I can’t find “ditchbur” in a dictionary—did you mean “ditch”?","zh":"我在词典里找不到“ditchbur”——你是不是想写“ditch”？"},{"en":"If you meant “ditch,” it can be a noun (a trench) or a verb (to abandon).","zh":"如果你想写“ditch”，它既可以作名词（沟渠），也可以作动词（抛弃/甩掉）。"}]}],"extraExplanation":["“ditch”在口语里常见的动词意思是“抛弃/摆脱（某人或某事）”，例如：ditch a bad habit（戒掉坏习惯）、ditch the meeting（不去开会）。如果你告诉我你看到“ditchbur”的句子或上下文，我可以更准确判断你想表达的词。"]}
{"word":"ditchdigger","summary":{"en":"A ditchdigger is someone who digs ditches, literally as a job; it can also be used informally to mean a hard-working person in a low-status role.","zh":"ditchdigger 指挖沟工（字面义）；也可非正式地比喻做辛苦、地位较低工作的基层劳动者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person whose job is to dig ditches (long, narrow holes in the ground), often for drainage, pipes, or cables.","zh":"挖沟工；挖壕沟的人（工作是挖掘用于排水、铺设管道或电缆等的狭长沟渠）。"},"examples":[{"en":"The ditchdigger opened a narrow trench so workers could lay the water pipe.","zh":"挖沟工挖出一条狭长的沟槽，好让工人铺设水管。"},{"en":"After the storm, the town hired a ditchdigger to improve drainage along the road.","zh":"暴风雨过后，小镇雇了挖沟工来改善道路旁的排水。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative, informal) Someone doing very hard, low-status, or repetitive work; a person at the bottom of a work hierarchy.","zh":"（比喻，非正式）做非常辛苦、地位较低或重复性工作的“苦力”；处于工作体系底层的人。"},"examples":[{"en":"He started as a ditchdigger and worked his way up to supervisor.","zh":"他从最基层的“挖沟工”做起，一路升到主管。"},{"en":"The novel portrays him as a ditchdigger with big dreams but few chances.","zh":"小说把他写成一个怀抱大梦想却机会很少的底层劳动者。"}]}],"synonyms":["trench digger","laborer","excavator operator"],"phonetic":"/ˈdɪtʃˌdɪɡɚ/","extraExplanation":["“ditchdigger”是由两个常见名词组合而成的复合词：ditch（沟）+ digger（挖掘者）。在英语里，这类复合词常用来直接说明职业或工具的用途。","在文学或新闻语境中，它有时被用来象征“体力劳动者/底层出身”，带有社会阶层与艰辛劳动的联想；使用时要注意语气，避免贬低他人。"]}
{"word":"ditchdigging","summary":{"en":"Ditch digging means digging trenches, and it can also metaphorically mean tough, low-status manual labor.","zh":"ditch digging 指挖沟/挖壕沟的工作，也可比喻辛苦、地位不高的体力劳动。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The activity or job of digging ditches (long, narrow trenches) in the ground, often for drainage, pipes, or cables.","zh":"挖沟（挖壕沟/沟渠）的工作或活动，常用于排水、铺设管道或电缆。"},"examples":[{"en":"The crew spent the morning doing ditch digging for the new water line.","zh":"施工队上午一直在为新的供水管线挖沟。"},{"en":"After the storm, there was a lot of ditch digging to improve drainage.","zh":"暴风雨过后，为了改善排水，需要挖很多沟渠。"}]},{"partOfSpeech":"n.","definition":{"en":"Informal: very hard, low-status, or repetitive physical work (used metaphorically).","zh":"非正式用法：指非常辛苦、地位不高或重复性强的体力活（比喻用法）。"},"examples":[{"en":"He started with ditch digging before he got an office job.","zh":"他一开始做挖沟这种苦力活，后来才找到办公室工作。"},{"en":"I don’t mind doing some ditch digging if it helps the team meet the deadline.","zh":"如果能帮助团队赶上截止日期，我不介意做些“苦力活”。"}]}],"synonyms":["trenching","excavation (general)","manual labor","grunt work (informal)","backbreaking work"],"phonetic":"/ˈdɪtʃ ˌdɪɡɪŋ/","extraExplanation":["“ditch-digging”常被当作一种带有社会阶层意味的比喻：代表“辛苦但不体面/不被重视”的体力劳动。英语里有时会说“go back to ditch-digging”，意思是“要是做不好/失败了就只能回去干苦力”。语气可能带轻视，使用时注意场合与尊重。"]}
{"word":"ditchdown","summary":{"en":"“ditchdown” is not standard; you likely mean “ditch” (abandon/leave) or a context-specific phrase involving a ditch.","zh":"“ditchdown” 不是标准用法；多半是想写 “ditch（甩掉/抛弃/离开）” 或与 “ditch（沟）” 相关的特定表达。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is usually a typo or an informal mash-up of “ditch” + “down,” and the meaning depends on context (often “to ditch” = to abandon/leave).","zh":"不是标准英语单词。通常是拼写错误或把 “ditch（甩掉/抛弃）” 和 “down” 拼在一起的非正式写法，具体意思要看上下文（多半接近 ditch = 甩掉/抛弃/离开）。"},"examples":[{"en":"I can’t find “ditchdown” in a dictionary—did you mean “ditch” (leave/abandon) or “ditch down” (pull over into a ditch)?","zh":"我在词典里查不到 “ditchdown”——你是想写 “ditch”（甩掉/抛弃/离开）还是 “ditch down”（把车靠边开进沟里/掉进沟里）？"},{"en":"He ditched his friends and went home early.","zh":"他甩下朋友，早早回家了。"}]}],"synonyms":["ditch","abandon","leave","drop","give up"],"phonetic":"/dɪtʃ/","extraExplanation":["“ditch” 在口语里很常见：ditch school/class = 逃课；ditch someone = 甩掉某人/放某人鸽子；ditch a plan = 取消计划。","如果你是在游戏/汽车语境看到的，可能想表达 “drive into a ditch（开进沟里/翻进沟里）” 或 “pull into the ditch（驶入路边沟/路肩）”。请把原句发来，我可以按语境给出最准确的释义和更自然的表达。"]}
{"word":"ditched","summary":{"en":"“Ditched” usually means “left/abandoned,” but it can also mean “ended up in a ditch” or “made an emergency landing on water.”","zh":"“Ditched”最常见意思是“甩掉、抛弃”；也可指“掉进沟里”或（航空）“水上紧急迫降”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “ditch”: to leave someone or something suddenly (often in a rude or selfish way); to abandon.","zh":"“ditch”的过去式/过去分词：突然离开某人或某事（常带不礼貌或自私的意味）；抛弃、甩掉。"},"examples":[{"en":"He ditched his friends to go to the party alone.","zh":"他为了一个人去参加派对，把朋友们甩了。"},{"en":"Don’t ditch your homework—you’ll regret it later.","zh":"别把作业丢一边不做——你以后会后悔的。"}]},{"partOfSpeech":"v.","definition":{"en":"to put into a ditch, or to force off the road into a ditch (often in accidents).","zh":"把……扔进沟里；（常指事故中）使……冲出路面掉进沟里。"},"examples":[{"en":"The car skidded on ice and ended up ditched by the side of the road.","zh":"车在冰面上打滑，最后冲到路边沟里了。"}]},{"partOfSpeech":"v.","definition":{"en":"(of a pilot/plane) to make an emergency landing on water.","zh":"（飞机/飞行员）在水上紧急迫降。"},"examples":[{"en":"The aircraft was ditched in the ocean after engine trouble.","zh":"飞机因引擎故障在海上紧急迫降。"}]},{"partOfSpeech":"adj.","definition":{"en":"left behind; abandoned (often used informally).","zh":"被丢下的；被抛弃的（常用于非正式表达）。"},"examples":[{"en":"I felt ditched when they left without telling me.","zh":"他们没告诉我就走了，我感觉被丢下了。"}]}],"synonyms":["abandoned","left","bailed on","dumped","deserted"],"phonetic":"/dɪtʃt/","extraExplanation":["口语里“ditch someone”语气通常偏负面，含“甩开/抛下”的感觉；如果只是“先走一步”，更中性的说法可以用 “leave” 或 “head out”。","“ditched”在新闻或航空语境中常指“水上迫降”，例如 “ditched in the Hudson River（哈德逊河迫降）”。"]}
{"word":"ditcher","summary":{"en":"A ditcher is usually a worker who digs ditches; informally, it can also mean someone who abandons others or (US) a student who skips school.","zh":"ditcher 通常指“挖沟工”；在非正式用法中也可指“把别人甩掉的人”，或（美式）“逃学/逃课的学生”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person whose job is digging ditches (long narrow trenches), especially for drainage, pipes, or cables","zh":"挖沟工；挖掘沟渠的人（常为排水、铺设管道或电缆而挖沟）"},"examples":[{"en":"The ditcher dug a trench along the road for the new water line.","zh":"挖沟工沿着公路挖了一条沟，用来铺设新的供水管线。"},{"en":"After the storm, the farmers hired a ditcher to improve drainage.","zh":"暴风雨过后，农民雇了挖沟工来改善排水。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) a person who leaves or abandons someone or something; someone who “ditches” others","zh":"（非正式）抛下别人或某事的人；甩掉他人的人"},"examples":[{"en":"Don’t be a ditcher—tell your friends if you can’t come.","zh":"别当“放鸽子的人”——如果你来不了，就告诉朋友。"},{"en":"He apologized for being a ditcher and leaving early without a message.","zh":"他为自己没说一声就提前离开、把大家丢下而道歉。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, chiefly US) a student who skips school; a truant","zh":"（非正式，主要在美国）逃学的学生"},"examples":[{"en":"The teacher reported two ditchers who missed class again.","zh":"老师报告说有两名逃学的学生又缺课了。"},{"en":"He got detention for being a ditcher during math period.","zh":"他因为数学课逃学而被留校。"}]}],"synonyms":["trench digger","excavator (worker)","truant (for skipping school)","deserter (informal sense)"],"phonetic":"/ˈdɪtʃər/","extraExplanation":["“ditcher”来自名词/动词 ditch（沟；挖沟；甩掉、抛弃）。日常口语里，ditch someone 常带有“让人失望、突然不见”的语气；而 “ditch class/school” 在美式英语中常指“逃课/逃学”。"]}
{"word":"ditchers","summary":{"en":"“Ditchers” usually means people who dig ditches, and informally it can mean people (often students) who ditch or skip something.","zh":"“ditchers”通常指挖沟的人；口语中也可指逃课或临时抛下/爽约的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who dig ditches (long narrow holes in the ground), often as a job","zh":"挖沟的人；挖排水沟/壕沟的工人"},"examples":[{"en":"The farm hired ditchers to clear the drainage channels before the rainy season.","zh":"农场雇了挖沟工人在雨季前清理排水沟。"},{"en":"A team of ditchers worked along the road to improve the water flow.","zh":"一队挖沟工沿着公路施工，以改善排水。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) people who abandon or leave someone or something—especially students who skip school","zh":"（非正式）逃离/抛下某事或某人的人；尤指逃课的人"},"examples":[{"en":"The teacher warned the ditchers that skipping class would hurt their grades.","zh":"老师警告那些逃课的人，缺课会影响成绩。"},{"en":"Don’t be a ditcher—tell your friends if you can’t make it.","zh":"别当“放鸽子”的人——如果来不了就告诉朋友。"}]}],"synonyms":["excavators","diggers","trenchers","skippers","truants"],"phonetic":"/ˈdɪtʃərz/","extraExplanation":["“ditcher”来自名词“ditch（沟；壕沟）”，原义与挖沟的工作有关。","在美式口语中，“to ditch class”常指“逃课”，因此“ditcher(s)”也可指“逃课的人”。在社交语境里，“ditch someone”是“甩开/抛下某人（不一起行动）”，语气通常偏负面。"]}
{"word":"ditches","summary":{"en":"“Ditches” most often means trenches in the ground (plural of ditch). As a verb, “ditch” can mean abandon (informal) or make an emergency landing on water (aircraft).","zh":"“ditches”最常见是“沟渠/壕沟”的复数。作动词时，“ditch”可表示“甩掉/抛弃”（口语），也可指飞机“在水面迫降”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A long, narrow trench dug in the ground, often used to carry away water (drainage) or mark a boundary.","zh":"沟渠；壕沟：在地面挖出的细长沟槽，常用于排水或作为边界。"},"examples":[{"en":"After the storm, the ditches along the road filled with water.","zh":"暴风雨过后，路边的沟渠都灌满了水。"},{"en":"Farmers dug ditches to drain the fields.","zh":"农民挖沟渠来给田地排水。"}]},{"partOfSpeech":"v.","definition":{"en":"To get rid of someone or something; to abandon or leave behind (informal).","zh":"甩掉；抛弃；丢下（非正式）。"},"examples":[{"en":"He ditched his old phone when he bought a new one.","zh":"他买了新手机后就把旧手机丢掉了。"},{"en":"Don’t ditch your friends when things get difficult.","zh":"遇到困难时不要抛弃朋友。"}]},{"partOfSpeech":"v.","definition":{"en":"To make an emergency landing on water (used about an aircraft).","zh":"（飞机）在水面迫降。"},"examples":[{"en":"The pilot had to ditch the plane in the ocean after the engine failed.","zh":"发动机故障后，飞行员不得不让飞机在海面迫降。"}]}],"synonyms":["trenches","channels","gutters","abandon","dump"],"phonetic":"/dɪtʃɪz/","extraExplanation":["“ditches”通常是名词复数，来自“ditch（沟渠）”。在口语里，动词“ditch”很常见，意思是“甩掉/不再要/逃课不去”。例如：ditch class = 逃课（美式口语）。","关于“水面迫降”的用法多见于新闻或航空语境：to ditch an aircraft/plane（让飞机在水面迫降）。"]}
{"word":"ditching","summary":{"en":"Ditching most commonly means giving up/abandoning something (often a class), and it can also mean an aircraft’s emergency landing on water.","zh":"“ditching”最常见指抛弃/放弃某事（常指翘课），也可指飞机在水面紧急迫降。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act of leaving or giving up something (often suddenly or intentionally).","zh":"（常指突然或有意地）抛弃、放弃某事的行为。"},"examples":[{"en":"She regretted ditching her math class because she fell behind quickly.","zh":"她后悔翘掉数学课，因为很快就跟不上进度了。"},{"en":"Ditching old habits takes time and practice.","zh":"改掉旧习惯需要时间和练习。"}]},{"partOfSpeech":"n.","definition":{"en":"skipping (a class or school) without permission; playing hooky.","zh":"（未经允许）翘课、逃学。"},"examples":[{"en":"The school has strict rules against ditching.","zh":"学校对翘课有严格规定。"},{"en":"He got in trouble for ditching class to go to the mall.","zh":"他因为翘课去逛商场而惹上麻烦。"}]},{"partOfSpeech":"n.","definition":{"en":"an emergency landing of an aircraft on water.","zh":"（飞机的）水上迫降。"},"examples":[{"en":"The pilot performed a controlled ditching after engine failure.","zh":"发动机故障后，飞行员进行了可控的水上迫降。"}]}],"synonyms":["abandoning","dropping","quitting","skipping (class)","playing hooky","water landing (aviation)"],"phonetic":"/ˈdɪtʃɪŋ/","extraExplanation":["“ditch”原意是“沟渠”。口语里“ditch (someone/something)”常带有“把……丢在一边”的感觉，例如 ditch class（翘课）、ditch a plan（放弃计划）。","航空语境中的“ditching”是专业用法，特指飞机在水面紧急降落；新闻报道或飞行安全材料中较常见。"]}
{"word":"ditchless","summary":{"en":"“Ditchless” means having no ditch, often implying poor drainage.","zh":"“ditchless”表示“没有沟渠/排水沟的”，常暗示排水条件差。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having no ditch (a long narrow channel or trench), especially describing a road, track, or area without drainage ditches.","zh":"没有沟渠的；无排水沟的（常用于形容道路、路基或场地没有排水沟）。"},"examples":[{"en":"They built a ditchless road, so heavy rain quickly flooded the shoulder.","zh":"他们修了一条无排水沟的道路，所以大雨很快淹没了路肩。"},{"en":"This ditchless field needs better drainage to protect the crops.","zh":"这块无沟渠的田地需要更好的排水来保护作物。"}]}],"synonyms":["unditched","without drainage ditches","without a ditch"],"phonetic":"/ˈdɪtʃləs/","extraExplanation":["“ditchless”不是常见日常词，更常见的表达是“without a ditch / without drainage ditches”或用“unditched”“without drainage”。","在工程或土地管理语境里（道路排水、农田排水）偶尔会用到，用来强调“缺少沟渠导致排水差”的问题。"]}
{"word":"ditchside","summary":{"en":"“Ditchside” means the side of a ditch, or something located beside a ditch.","zh":"“ditchside”指“沟边/沟渠旁”，也可作形容词表示“位于沟边的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the side or edge of a ditch (a long, narrow channel beside a road or field, often for drainage)","zh":"沟渠边、沟边（沟渠是路旁或田边常见的狭长凹槽，多用于排水）"},"examples":[{"en":"Wildflowers grew along the ditchside after the spring rain.","zh":"春雨过后，野花沿着沟边生长。"},{"en":"The bicycle slipped into the ditchside mud.","zh":"自行车打滑，陷进了沟边的泥里。"}]},{"partOfSpeech":"adj.","definition":{"en":"located beside a ditch; relating to the area next to a ditch","zh":"位于沟边的；与沟边区域有关的"},"examples":[{"en":"They found a ditchside path leading to the farm.","zh":"他们发现一条沿沟边通往农场的小路。"},{"en":"Ditchside vegetation helps prevent soil erosion.","zh":"沟边植被有助于防止水土流失。"}]}],"synonyms":["ditch edge","by the ditch","along the ditch","roadside ditch (context-dependent)"],"phonetic":"/ˈdɪtʃsaɪd/","extraExplanation":["“ditchside”是复合词（ditch + side），在英美乡村/郊区语境较常见，常用来描述道路排水沟旁的地带（例如杂草、泥、水洼、野花等）。","写作上也常用来营造“偏僻、质朴、未经修整”的环境氛围，比如描写乡间道路、农田边缘或小镇外的景象。"]}
{"word":"ditchwater","summary":{"en":"Ditchwater literally means dirty water in a ditch, and informally it can describe a very poor drink or something extremely dull.","zh":"Ditchwater字面是“沟渠脏水”，口语中也可形容饮料很差/很淡，或形容事物“无聊透顶”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Dirty, stagnant water found in a ditch (a long narrow channel by a road or field).","zh":"沟渠里的脏水、死水（常指路边或田边沟里的污浊积水）。"},"examples":[{"en":"After the storm, the ditch was full of brown ditchwater.","zh":"暴风雨过后，沟里满是棕色的沟渠脏水。"},{"en":"The boots were splashed with ditchwater along the roadside.","zh":"路边的沟渠脏水溅到了靴子上。"}]},{"partOfSpeech":"n.","definition":{"en":"Informal: something (especially a drink) considered very poor in quality, weak, or unpleasant.","zh":"非正式：指（尤指饮料）品质很差、很淡、很难喝的东西。"},"examples":[{"en":"This coffee tastes like ditchwater.","zh":"这咖啡难喝得像沟渠水。"},{"en":"He complained that the beer was basically ditchwater.","zh":"他抱怨这啤酒淡得跟沟渠水差不多。"}]},{"partOfSpeech":"adj.","definition":{"en":"Informal (often before a noun): extremely dull, boring, or uninteresting.","zh":"非正式（常作定语）：极其乏味的、无聊的、毫无趣味的。"},"examples":[{"en":"The lecture was ditchwater dull.","zh":"这堂讲座无聊透顶。"},{"en":"I’m sorry, but the book felt ditchwater to me.","zh":"抱歉，但这本书在我看来特别乏味。"}]}],"synonyms":["stagnant water","dirty water","slop (informal)","swill (informal)","watery (of drinks)","dull","boring"],"phonetic":"/ˈdɪtʃˌwɔtər/","extraExplanation":["“ditchwater”字面意思是“沟渠水”，因为沟里的水常常浑浊、停滞，所以在口语里引申为“又差又淡/难喝”的饮料，或用来强调“无聊到极点”（常见搭配：ditchwater dull）。这种用法在英式英语里更常见，但美式英语也能理解。"]}
{"word":"dite","summary":{"en":"“Dite” is a rare French-derived form meaning “called/known as,” used in historical name records to show an alias.","zh":"“dite”较少见，源自法语，表示“又名/被称作”，常见于历史或家谱姓名记录中标注别名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Rare in English; from French) “called; known as,” used after a person’s name to indicate an alias or another name they were known by.","zh":"（英语中较少见，源自法语）“又名；称为；被称作”，常放在人名后面表示别名或常用名。"},"examples":[{"en":"In old records you may see “Jean Martin dite Lefèvre,” meaning Jean Martin, called Lefèvre.","zh":"在旧档案里你可能会看到“Jean Martin dite Lefèvre”，意思是“让·马丁，又名（被称作）勒费弗尔”。"},{"en":"The family name changed over time, and some ancestors were recorded with a dite name.","zh":"这个姓氏随着时间发生变化，一些祖先在记录里带有 dite（别名）名字。"}]}],"synonyms":["also known as (aka)","called","known as","alias"],"phonetic":"/dit/","extraExplanation":["这是法语用法：阳性常写 dit，阴性写 dite（与被称呼的人性别一致）。在英语里多出现在家谱研究、历史文献、魁北克/法裔北美资料中，表示“某人又叫……”。如果你本来想查的是 diet（饮食/节食）或 date（日期/约会），告诉我语境我可以一起对比讲解。"]}
{"word":"diter","summary":{"en":"Dither means to hesitate or be indecisive, or the hesitation itself.","zh":"Dither 指（人）犹豫不决、拿不定主意，也可指这种犹豫的状态。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"to hesitate or have difficulty making a decision; to waver","zh":"犹豫不决；踌躇；拿不定主意"},"examples":[{"en":"Stop dithering and choose one option.","zh":"别再犹豫了，选一个吧。"},{"en":"She dithered for a moment before answering.","zh":"她回答前犹豫了一下。"}]},{"partOfSpeech":"n.","definition":{"en":"a state of hesitation or indecision","zh":"犹豫；迟疑不决的状态"},"examples":[{"en":"After some dithering, he finally agreed.","zh":"犹豫了一阵之后，他终于同意了。"},{"en":"The team’s dithering cost them time.","zh":"团队的犹豫让他们浪费了时间。"}]}],"synonyms":["hesitate","waver","vacillate","stall","drag one’s feet"],"phonetic":"/ˈdɪðər/","extraExplanation":["你输入的“diter”很可能是拼写错误，常见目标词是 **dither**（犹豫不决）。","**dither**在日常英语里带一点“磨磨蹭蹭、拿不定主意”的语气，比中性的“hesitate”更口语、更形象。"]}
{"word":"diterpene","summary":{"en":"A diterpene is a natural terpene compound with 20 carbon atoms (four isoprene units), common in plants, resins, and essential oils.","zh":"diterpene（二萜）是一类含20个碳原子（由四个异戊二烯单元组成）的天然萜类化合物，常见于植物、树脂和精油中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of natural organic compound made from four isoprene units (20 carbon atoms), often found in plants and some microorganisms and commonly appearing in resins, essential oils, and plant defense chemicals","zh":"二萜（类）：由四个异戊二烯单元组成（通常含20个碳原子）的一类天然有机化合物，常见于植物及部分微生物中，常存在于树脂、精油或植物防御化学物质里"},"examples":[{"en":"Some pine resins contain diterpenes that help protect the tree from insects.","zh":"一些松树树脂含有二萜类物质，能帮助树木抵御昆虫。"},{"en":"Researchers study diterpenes in medicinal plants to look for potential anti-inflammatory effects.","zh":"研究人员会研究药用植物中的二萜类物质，以寻找潜在的抗炎作用。"}]}],"synonyms":["diterpenoid"],"phonetic":"/daɪˈtɝːpiːn/","extraExplanation":["“terpene（萜）”是植物等生物产生的一大类化合物家族，常与气味（如精油香气）或防御作用有关；前缀“di-”表示“二/两倍”，在这里指二萜由4个异戊二烯（isoprene）单元组成（而单萜monoterpene为2个单元、倍半萜sesquiterpene为3个单元）。","二萜在生物化学与天然产物研究中很常见：例如某些树脂酸、以及咖啡和茶中提到的“cafestol/ kahweol（咖啡醇/卡维醇）”属于二萜类。"]}
{"word":"ditertiary","summary":{"en":"“ditertiary” (usually written “di-tertiary”) is a chemistry adjective meaning “having two tertiary groups/centers.”","zh":"“ditertiary”（更常写作“di-tertiary”）是化学形容词，意思是“含有两个叔（三级）基团/中心”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Having two tertiary groups or two tertiary substituents in a molecule; often written as “di-tertiary” (or abbreviated “di-tert-” / “di-t-” in names like di-tert-butyl).","zh":"（化学）含有两个叔（三级）基团或两个叔取代基的；常写作“di-tertiary”（在命名中常缩写为 di-tert- / di-t-，如 di-tert-butyl）。"},"examples":[{"en":"Di-tertiary alcohols can be more resistant to oxidation than primary alcohols.","zh":"二叔醇通常比一级醇更耐氧化。"},{"en":"The compound has a di-tertiary structure, with two tertiary carbon centers.","zh":"该化合物具有二叔结构，含有两个叔碳中心。"},{"en":"Di-tert-butyl ether is an example of a molecule with bulky tertiary groups.","zh":"叔丁基醚（di-tert-butyl ether）是含有体积很大的叔基团的分子例子。"}]}],"synonyms":["di-tertiary","di-tert- (in chemical naming)"],"phonetic":"/ˌdaɪˈtɝːʃiˌɛri/","extraExplanation":["“ditertiary”在一般英语里非常少见，更多出现在化学语境中，而且更常见的写法是带连字符的“di-tertiary”。","“tertiary（叔/三级）”在有机化学里常指“与三个碳原子相连的碳（叔碳）”或“第三等级的结构/官能团”。因此“di-tertiary”强调“有两个这样的中心/基团”。","如果你是在看化学品名称，常会遇到“di-tert-”这种缩写（tert- = tertiary 的缩写），例如“di-tert-butyl”。"]}
{"word":"dites","summary":{"en":"Diet means someone’s usual food, or a planned way of eating for health/weight; it can also mean to control what you eat.","zh":"diet 指日常饮食，也可指为健康/减重制定的饮食计划；作动词还表示控制饮食、节食。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person’s usual food and drink; what someone regularly eats.","zh":"（日常）饮食；一个人平时吃喝的东西。"},"examples":[{"en":"Rice is a big part of her diet.","zh":"米饭是她日常饮食中很重要的一部分。"},{"en":"Try to add more vegetables to your diet.","zh":"尽量在日常饮食中多加一些蔬菜。"}]},{"partOfSpeech":"n.","definition":{"en":"A planned way of eating, often to lose weight or improve health.","zh":"（为减肥或健康而制定的）饮食计划；节食。"},"examples":[{"en":"He started a low-sugar diet for his health.","zh":"为了健康，他开始了低糖饮食。"},{"en":"Many diets are hard to follow for a long time.","zh":"很多饮食法很难长期坚持。"}]},{"partOfSpeech":"vi.","definition":{"en":"To eat in a controlled way, especially to lose weight or improve health.","zh":"控制饮食（尤指为了减肥或改善健康）；节食。"},"examples":[{"en":"She’s dieting before the wedding.","zh":"她在婚礼前节食。"},{"en":"My doctor told me to diet and exercise more.","zh":"医生让我控制饮食并多运动。"}]}],"synonyms":["eating habits","meal plan","nutrition plan","restrict (food)"],"phonetic":"/ˈdaɪət/","extraExplanation":["你输入的“dites”在英语里不常见。很多学习者其实想查的是“diets”（diet 的复数名词，或 diet 这个动词的第三人称单数形式：He diets.）。如果你想查的是法语“dites”（“dire”的命令式/现在时形式，意为“你说/请说”），告诉我语境我也可以解释。"]}
{"word":"ditetragonal","summary":{"en":"Ditetragonal is a rare technical adjective used mainly in crystallography to describe certain tetragonal crystal forms/symmetry involving a “double” tetragonal feature.","zh":"Ditetragonal 是一个较罕见的技术性形容词，主要用于晶体学，指涉及“四方晶系”并带有“双重四方”特征的某些晶形或对称类型。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Crystallography) Describing a form or symmetry type related to a tetragonal crystal system, especially one involving a “double” tetragonal arrangement (as in the term “ditetragonal dipyramidal”).","zh":"（晶体学）指与四方晶系有关的晶形或对称类型，尤指包含“双重四方”特征的情况（如“二四方双锥形/ditetragonal dipyramidal”这一术语中）。"},"examples":[{"en":"Some minerals are classified by symmetry terms such as ditetragonal dipyramidal.","zh":"一些矿物会用对称性术语来分类，例如“二四方双锥形（ditetragonal dipyramidal）”。"},{"en":"In older crystallography texts, you may see the adjective ditetragonal used to describe specific tetragonal forms.","zh":"在较早的晶体学教材中，你可能会看到形容词 ditetragonal 用来描述特定的四方晶形。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare, technical) Having or involving two tetragonal (four-sided) parts or features.","zh":"（罕见，技术用语）具有或涉及两个四方（四边形/四边特征）部分或特征的。"},"examples":[{"en":"The author proposed a ditetragonal model, pairing two tetragonal units in a single structure.","zh":"作者提出了一个 ditetragonal 模型，把两个四方单元配对到一个结构中。"}]}],"synonyms":["tetragonal","ditetragonal dipyramidal (in context)"],"phonetic":"/ˌdaɪtɛˈtræɡənəl/","extraExplanation":["词缀提示：di- 表示“二、双”，tetragonal 表示“四方的/四边的”。因此 ditetragonal 字面上有“二四方/双四方”的意思，但它主要出现在晶体学的专门术语里（例如 ditetragonal dipyramidal，用来描述某类晶体对称性）。","使用场景：这是非常专业、较少见的词。日常英语中几乎不会用到；在阅读矿物学、晶体学或固体几何相关资料时更可能遇到。"]}
{"word":"ditetrahedral","summary":{"en":"“Ditetrahedral” describes a specific kind of symmetry related to tetrahedral forms, mainly in crystallography and molecular symmetry.","zh":"“Ditetrahedral”指一种与四面体相关的特定对称性，主要用于晶体学与分子对称性领域。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the symmetry of a ditetrahedron (a shape related to two interpenetrating tetrahedral forms), used mainly in crystallography and molecular symmetry.","zh":"具有“双四面体（ditetrahedron）”对称性的；主要用于晶体学和分子对称性描述。"},"examples":[{"en":"The molecule is classified as ditetrahedral in symmetry analysis.","zh":"在对称性分析中，这个分子被归类为双四面体对称。"},{"en":"Some crystals show ditetrahedral symmetry, which affects how they reflect light.","zh":"一些晶体呈现双四面体对称性，这会影响它们对光的反射方式。"}]}],"synonyms":["D2d (in symmetry notation)"],"phonetic":"/ˌdaɪˌtɛtrəˈhiːdrəl/","extraExplanation":["“ditetrahedral”属于非常专业的术语，常见于晶体学/群论中的点群命名（例如 D2d 常被称为 ditetrahedral）。在一般英语语境中很少使用，更多出现在学术论文、教材或结构分析报告里。"]}
{"word":"dithalous","summary":{"en":"Dithalous is a rare adjective meaning “having two thalli,” mainly in older botanical or biological writing.","zh":"dithalous 是一个很少见的形容词，主要见于较旧的植物/生物文献，意思是“具有两个叶状体（菌体）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, biology/botany) Having two thalli (two plant-like bodies), especially used when describing certain algae or lichens.","zh":"（罕见，生物/植物）具有两个“菌体/叶状体”（thallus）的；常用于描述某些藻类或地衣等。"},"examples":[{"en":"Some older descriptions call the species dithalous, meaning it has two distinct thalli.","zh":"一些较早的描述把这种物种称为 dithalous，意思是它有两个彼此分开的菌体（叶状体）。"},{"en":"The lichen was noted as dithalous in a historical field guide.","zh":"这株地衣在一本旧的野外指南中被标注为 dithalous（双菌体的）。"}]}],"synonyms":["dithallous","two-thallus"],"phonetic":"/ˈdaɪθələs/","extraExplanation":["这个词非常少见，你更可能在旧的分类学/植物学文献中看到。现代写法更常见的是 **dithallous**（同义，表示“有两个 thallus”）。","词源可拆为 **di-**（“两个”）+ **thallus**（“叶状体/菌体”，指不分根茎叶的植物体结构）。如果你是在论文或标本标签中见到它，建议核对原文是否其实是 *dithallous*。"]}
{"word":"dithecal","summary":{"en":"Dithecal means “having two thecae (two pollen sacs),” usually referring to an anther.","zh":"dithecal 指“具二药室/两个花粉囊的”，通常用于描述花药。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having two thecae (two pollen sacs), especially describing an anther in many flowering plants.","zh":"（植物学）具二药室的；有两个花粉囊的（多用于描述许多被子植物的花药）。"},"examples":[{"en":"Most typical angiosperm anthers are dithecal, with two pollen sacs on each side.","zh":"大多数典型的被子植物花药是二药室的，在两侧各有花粉囊。"},{"en":"Under the microscope, the anther’s dithecal structure becomes easy to identify.","zh":"在显微镜下，花药的二药室结构很容易辨认。"}]}],"synonyms":["bithecal","two-thecae","two-loculed (in context)"],"phonetic":"/daɪˈθiːkəl/","extraExplanation":["“theca”在植物学里常指“囊室/室”，与花药结构有关；“di-”表示“二”。因此 dithecal 直译可理解为“两个囊室的”。","该词多见于植物解剖学、分类学或实验报告中；日常英语里很少使用。"]}
{"word":"dithecous","summary":{"en":"Dithecous means having two thecae (two pollen sacs), usually referring to a two-lobed anther.","zh":"dithecous 指“二药室的/具两个花粉囊的”，通常用来描述具两室的花药。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having two thecae (two pollen sacs), especially describing an anther that has two pollen-containing lobes.","zh":"（植物学）二药室的；具两个花粉囊（两个药室）的，尤指花药具有两个含花粉的囊室/花粉室。"},"examples":[{"en":"Most flowering plants have a dithecous anther with two pollen sacs.","zh":"大多数被子植物的花药是二药室的，具有两个花粉囊。"},{"en":"In the diagram, the dithecous anther is shown as two lobes joined by connective tissue.","zh":"在图中，二药室花药显示为由连结组织连接的两个花药裂片。"}]}],"synonyms":["two-thecous"],"phonetic":"/daɪˈθikəs/","extraExplanation":["“theca”在植物学里常指花药中装花粉的“药室/花粉囊”。“di-”表示“两个”，所以“dithecous”字面意思就是“有两个theca（药室）”。","该词多见于植物形态学与解剖学教材或论文中，日常英语里很少使用。"]}
{"word":"ditheism","summary":{"en":"Ditheism is the belief in or worship of two gods.","zh":"Ditheism 指对两位神的信仰或崇拜。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the belief in, worship of, or acknowledgment of two gods (often seen as two chief or rival deities within a religion).","zh":"二神论；相信、崇拜或承认两位神（常指某宗教体系中两位主要或相互对立的神祇）。"},"examples":[{"en":"Some scholars describe certain ancient traditions as forms of ditheism rather than strict monotheism.","zh":"一些学者把某些古代传统描述为二神论，而不是严格的一神论。"},{"en":"In their myth, two gods share control of the world, which can be interpreted as ditheism.","zh":"在他们的神话里，两位神共同掌控世界，这可被解读为二神论。"}]}],"synonyms":["bitheism","two-god belief","(related) polytheism","(related) dualism"],"phonetic":"/ˈdaɪθiˌɪzəm/","extraExplanation":["词源：di-（“二、两个”）+ theism（“有神论/信仰神的体系”），来自希腊语 theos（“神”）。","用法提示：ditheism 常用于宗教学、历史或人类学语境，描述“有两位主要神祇”的信仰结构；与 polytheism（多神论）不同，后者强调“许多神”，而 ditheism 强调“两个”。","相关术语：bitheism 是较少见的同义词；dualism（二元论）多指“善恶/精神物质”等两种原则对立，不一定是“两位神”。"]}
{"word":"ditheisms","summary":{"en":"Ditheism means belief in or worship of two gods.","zh":"Ditheism 指相信或崇拜两位神祇的“二神论”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the belief in or worship of two gods, especially as a religious system (plural: ditheisms).","zh":"二神论；相信或崇拜两位神祇的宗教观（复数：ditheisms）。"},"examples":[{"en":"Some ancient religions can be described as forms of ditheism.","zh":"一些古代宗教可以被描述为二神论的形式。"},{"en":"The article compares monotheism, polytheism, and different ditheisms.","zh":"这篇文章比较了一神论、多神论以及不同的二神论。"}]}],"synonyms":["dual theism","belief in two gods"],"phonetic":"/ˈdaɪθiˌɪzəm/","extraExplanation":["“ditheism”由前缀 di-（“二、两”）+ theism（“有神论、信神的体系”）构成，常用于宗教学或思想史讨论，用来区分“一神论”（monotheism）与“多神论”（polytheism）。","它有时会与“二元论/善恶二元对立”（dualism）一起被讨论，但两者不完全相同：ditheism强调“两个神祇”，dualism更强调“两个对立原则”（不一定是两位神）。"]}
{"word":"ditheist","summary":{"en":"A ditheist is someone who believes in two gods.","zh":"ditheist 指“相信有两位神的二神论者”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who believes in, worships, or teaches the existence of two gods (ditheism).","zh":"二神论者；相信（或崇拜、主张）有两位神的信仰者。"},"examples":[{"en":"In the debate, she described herself as a ditheist rather than a monotheist.","zh":"在辩论中，她把自己描述为二神论者，而不是一神论者。"},{"en":"Some early writings accused certain groups of being ditheists because they spoke of two divine powers.","zh":"一些早期著作指责某些团体是二神论者，因为他们谈到两种神圣力量。"}]}],"synonyms":["ditheism follower","two-god believer"],"phonetic":"/ˈdaɪθiɪst/","extraExplanation":["“ditheist”来自“di-（二）+ theist（有神论者）”。它是比较少见的词，更常见的相关名词是“ditheism（二神论）”。","对比：monotheist（一神论者，信仰一位神）、polytheist（多神论者，信仰多位神）、atheist（无神论者）。在宗教研究或历史语境中，这些词常用于描述信仰体系的结构，而不一定带评价色彩。"]}
{"word":"ditheistic","summary":{"en":"Ditheistic means relating to belief in or worship of two gods.","zh":"ditheistic 指与“二神论”（相信或崇拜两位神）有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"believing in or worshipping two gods, often with the idea that they are the main or highest divine powers","zh":"相信或崇拜两位神（两个主要或至高神祇）的；二神论的"},"examples":[{"en":"Some scholars describe the tradition as ditheistic because it centers on two principal gods.","zh":"一些学者把这种传统描述为二神论的，因为它以两位主要神祇为核心。"},{"en":"In a ditheistic system, religious stories often explain how the two gods relate or compete.","zh":"在二神论体系中，宗教故事常常解释两位神之间如何互动或竞争。"}]}],"synonyms":["dual-theistic","two-god"],"phonetic":"/ˌdaɪθiˈɪstɪk/","extraExplanation":["词源：di-（“二、双”）+ theistic（“有神论的”，源自希腊语 theos“神”）。","辨析：ditheistic 强调“两个神”作为核心；polytheistic（多神论）强调“许多神”。它有时也会与“二元论/善恶二神对立”的观念一起被讨论，但并不必然等同于严格的“善恶对立”体系。"]}
{"word":"ditheistical","summary":{"en":"Ditheistical means “related to ditheism,” the belief in two gods.","zh":"ditheistical 指“二神论的”，与相信有两位神有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the belief in two gods (especially two equal or opposing deities).","zh":"与“二神论”有关的；指相信有两位神（常指两位地位相当或彼此对立的神祇）。"},"examples":[{"en":"Some scholars describe certain ancient religions as ditheistical because they center on two major deities.","zh":"一些学者把某些古代宗教描述为“二神论”的，因为它们以两位主要神祇为核心。"},{"en":"The story sets up a ditheistical conflict between a god of light and a god of darkness.","zh":"这个故事设置了一个“二神论式”的冲突：光明之神与黑暗之神对立。"}]}],"synonyms":["ditheistic","dual-deity","two-god"],"phonetic":"/ˌdaɪθiˈɪstɪkəl/","extraExplanation":["“ditheistical”是较少见的形式，更常见的是“ditheistic”（二神论的）。两者意思基本相同。","词源：di-（二）+ theism（有神论）+ -al（形容词后缀）。常见于宗教学、历史研究等较正式的语境。","注意区分：ditheism（二神论）强调“两位神”；dualism（二元论）更广，可指哲学上的二元对立（如心/物、善/恶），不一定是“两位神”。"]}
{"word":"ditheists","summary":{"en":"“Ditheists” means people who believe in or worship two gods.","zh":"“ditheists”指相信或崇拜两位神的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who believe in two gods (often two principal deities)","zh":"相信有两位神的人（通常指两位主要神祇）"},"examples":[{"en":"Some scholars describe certain ancient religions as having ditheists rather than strict polytheists.","zh":"一些学者把某些古代宗教的信仰者描述为“二神论者”，而不是严格意义上的“多神论者”。"},{"en":"In that community, a few ditheists worshiped a sky god and an earth goddess as the highest powers.","zh":"在那个群体中，一些二神论者把天神与地母视为至高的力量。"}]}],"synonyms":["two-god believers","adherents of ditheism"],"phonetic":"/daɪˈθiːɪsts/","extraExplanation":["“ditheists”是“ditheist”的复数形式；更常见的说法是“ditheist(s)”，而不是把它当作日常词汇频繁使用。","二神论（ditheism）常用于描述“两个主要神祇”的信仰结构；它与“一神论（monotheism）”不同，也不等同于“多神论（polytheism）”。有时学术讨论中会把它与“二元论（dualism）”并列提到，但二元论更强调善/恶、光/暗等对立原则，不一定是两位“神”。"]}
{"word":"dithematic","summary":{"en":"Dithematic describes a name built from two meaningful roots.","zh":"Dithematic 指由两个有意义的词根/词素组合而成的（尤指人名）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(especially of a personal name) formed from two meaningful elements or roots.","zh":"（尤指人名）由两个有意义的词素/词根组合而成的。"},"examples":[{"en":"Many Old English names were dithematic, made from two roots that expressed ideals like strength or peace.","zh":"许多古英语名字是二词根构成的（dithematic），由两个词根组合来表达力量、和平等理想。"},{"en":"The name “Frederick” is often analyzed as a dithematic name meaning “peace” + “ruler.”","zh":"“Frederick（弗雷德里克）”常被分析为二词根人名，含义可理解为“和平”+“统治者”。"}]}],"synonyms":["two-root","compound (name)","bimorphemic"],"phonetic":"/ˌdaɪθəˈmætɪk/","extraExplanation":["dithematic 常用于历史语言学/名学（onomastics，研究姓名的学科）。在日耳曼语族传统中很常见：人名往往由两个词素拼合而成，如表示“勇敢、荣耀、保护、和平、统治”等价值观。","与之相对的概念是 monothematic（单词根构成的名字）。有些名字在历史演变中会从二词根形式简化为单一形式或昵称。"]}
{"word":"dither","summary":{"en":"“Dither” means to hesitate and be unable to decide, or (less commonly) to fuss or move shakily from nerves.","zh":"“dither”指犹豫不决、踌躇不安；也可指因紧张而小幅度乱动或手忙脚乱。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to be unable to decide; to hesitate or act nervously because you are unsure","zh":"犹豫不决；踌躇；因不确定而手足无措"},"examples":[{"en":"Stop dithering and choose one option.","zh":"别再犹豫了，选一个吧。"},{"en":"She dithered at the door, unsure whether to knock.","zh":"她在门口踌躇不前，不确定要不要敲门。"}]},{"partOfSpeech":"n.","definition":{"en":"a state of indecision or nervous hesitation","zh":"犹豫不决的状态；踌躇不安"},"examples":[{"en":"After a brief dither, he agreed to go.","zh":"短暂犹豫之后，他同意去了。"},{"en":"The team fell into a dither and missed the deadline.","zh":"团队陷入犹豫不决，错过了截止日期。"}]},{"partOfSpeech":"vi.","definition":{"en":"to move or speak in a small, shaky, or fussy way (often from nerves or excitement)","zh":"（常因紧张或兴奋而）小幅度地乱动；结结巴巴地说"},"examples":[{"en":"The puppy dithered around my feet, excited for a walk.","zh":"小狗在我脚边来回乱动，兴奋地想去散步。"},{"en":"He dithered with the microphone, not sure how to start.","zh":"他摆弄着麦克风，不知道该怎么开场。"}]}],"synonyms":["hesitate","waver","vacillate","falter","stall","fuss"],"phonetic":"ˈdɪðɚ","extraExplanation":["“dither”在英式英语里很常见，带一点轻微的批评意味：不是严肃的“深思熟虑”，而是“拖拖拉拉、拿不定主意”。在口语中常和命令式一起出现：Don’t dither! / Stop dithering!","在文学或叙事描写中，作者用“dither”能迅速塑造人物的紧张与踌躇：角色在门口、电话前、决定关头“dither”暗示内心不安与缺乏果断。"]}
{"word":"dithered","summary":{"en":"“Dithered” usually means “hesitated/was indecisive,” and in graphics it can mean “processed with dithering to smooth tones.”","zh":"“dithered”通常指“犹豫不决/磨蹭”，在图像领域也可指“经过递色/抖动处理以让色调更平滑”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(past tense/past participle of “dither”) to hesitate or act nervously because you can’t decide what to do.","zh":"（“dither”的过去式/过去分词）因拿不定主意而犹豫不决；（因紧张）慌乱、磨蹭。"},"examples":[{"en":"I dithered for a minute before answering the email.","zh":"我回那封邮件前犹豫了一分钟。"},{"en":"She dithered at the door, unsure whether to go in.","zh":"她在门口踌躇不前，不确定要不要进去。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of an image or sound) processed using dithering—adding small patterns/noise to make colors or tones look smoother, especially with limited color depth.","zh":"（指图像或声音）经过“抖动/递色（dithering）”处理：加入细小的点状/噪声图案，让颜色或明暗过渡看起来更平滑（常见于色彩位数有限时）。"},"examples":[{"en":"The poster looks dithered because it was exported in a low-color format.","zh":"这张海报看起来有“抖动”颗粒感，因为它用低色彩格式导出了。"},{"en":"In old games, backgrounds were often dithered to imitate more colors.","zh":"在老游戏里，背景常用递色/抖动来“假装”有更多颜色。"}]}],"synonyms":["hesitated","wavered","vacillated","faltered","dawdled","indecisive","dithered (image: grainy/dithered)"],"phonetic":"ˈdɪðərd","extraExplanation":["在日常英语里，dithered 最常见是“犹豫了/拿不定主意了”。但在设计、印刷和计算机图像领域，dithered 常指“做了递色/抖动处理”。这种做法在早期显示器、老游戏、美术像素风里很常见，用点阵或噪声让渐变更像“平滑过渡”。"]}
{"word":"ditherer","summary":{"en":"A ditherer is someone who hesitates a lot and struggles to make decisions.","zh":"ditherer 指一个经常犹豫不决、很难做决定的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who hesitates too long or has trouble making decisions; someone who keeps wavering instead of acting.","zh":"一个总是犹豫不决、难以下决定的人；总在摇摆不定而不行动的人。"},"examples":[{"en":"Stop being such a ditherer and choose a restaurant already.","zh":"别再这么犹豫不决了，赶紧选一家餐厅吧。"},{"en":"As a ditherer, he often missed good opportunities because he waited too long.","zh":"他这个优柔寡断的人常常因为拖太久而错过好机会。"}]}],"synonyms":["hesitator","indecisive person","waverer"],"phonetic":"/ˈdɪðərər/","extraExplanation":["“ditherer”来自动词“dither”（犹豫、慌乱），加上表示“……的人”的后缀“-er”。在日常英语里它常带一点批评或不耐烦的语气。","常见搭配：a terrible ditherer（非常优柔寡断的人）；Don’t dither!（别磨蹭/别犹豫了！）"]}
{"word":"dithering","summary":{"en":"Dithering usually means delaying because you can’t decide; in computing, it’s a technique to smooth images/audio by mixing pixels or adding tiny noise.","zh":"dithering 通常指因拿不定主意而拖延；在计算机领域则指通过混合像素或加入细微噪声来让图像/音频更平滑的“抖动”处理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(uncountable) Indecision or nervous hesitation, especially when you delay making a choice.","zh":"（不可数）犹豫不决；（紧张、慌乱时的）踌躇拖延，迟迟下不了决心。"},"examples":[{"en":"Stop dithering and choose one option.","zh":"别再犹豫了，选一个吧。"},{"en":"The team lost time because of dithering over small details.","zh":"团队因为在小细节上反复犹豫而耽误了时间。"}]},{"partOfSpeech":"n.","definition":{"en":"(computing, uncountable) A method of mixing pixels or adding small noise to make digital images, video, or audio look/sound smoother, especially when colors or levels are limited.","zh":"（计算机/数码领域，不可数）抖动/抖色处理：通过混合像素或加入细微噪声，让受限的颜色/灰阶/音量看起来或听起来更平滑。"},"examples":[{"en":"Dithering can reduce visible color banding in gradients.","zh":"抖动处理可以减少渐变里明显的色带断层。"},{"en":"The software applies dithering when exporting to a lower color depth.","zh":"导出到较低色深时，软件会应用抖动处理。"}]}],"synonyms":["hesitation","indecision","wavering","vacillation","stalling"],"phonetic":"/ˈdɪðərɪŋ/","extraExplanation":["“dithering”来自动词 dither，日常最常见的意思是“犹豫不决、磨蹭”，语气通常带一点不耐烦：Stop dithering.（别磨蹭了。）","在图像/音频处理中，“dithering”是一个中性技术词：当设备或文件格式只能表示较少的颜色/音量等级时，用“抖动”来制造“更平滑”的视觉/听觉效果。常见搭配：apply dithering（应用抖动）、color dithering（抖色）、reduce banding（减少色带）。"]}
{"word":"dithers","summary":{"en":"“Dithers” means hesitates indecisively or fusses nervously; it can also refer to being in a nervous state (a dither).","zh":"“dithers”表示“犹豫不决、拿不定主意”，也可指“紧张慌乱地忙活”；名词用法 a dither 表示“慌乱/犹豫的状态”。"},"definitions":[{"partOfSpeech":"vi.","definition":{"en":"(present tense: dithers) to hesitate because you are uncertain; to be unable to decide quickly.","zh":"（现在时：dithers）犹豫不决；拿不定主意。"},"examples":[{"en":"She dithers over which college to choose.","zh":"她在选哪所大学上犹豫不决。"},{"en":"Don’t dither—press the button before the timer ends.","zh":"别犹豫——在计时结束前按下按钮。"},{"en":"He dithered for a moment, then agreed to go.","zh":"他犹豫了一下，然后同意去了。"}]},{"partOfSpeech":"vi.","definition":{"en":"to move or act in a nervous, confused way; to fuss.","zh":"（因紧张或慌乱）手忙脚乱；慌乱地忙活。"},"examples":[{"en":"The assistants dithered around, not sure what to do next.","zh":"助手们在周围慌乱忙活，不知道下一步该做什么。"},{"en":"Stop dithering and bring the forms to the front desk.","zh":"别瞎忙了，把表格拿到前台。"}]},{"partOfSpeech":"n.","definition":{"en":"a state of nervous confusion or indecision.","zh":"紧张的慌乱；犹豫不决的状态。"},"examples":[{"en":"In a dither, she checked her bag three times.","zh":"她慌慌张张地把包检查了三遍。"},{"en":"The team was in a dither after the sudden change of plan.","zh":"计划突然改变后，团队一时乱了阵脚。"}]}],"synonyms":["hesitate","waver","vacillate","fuss","fluster"],"phonetic":"/ˈdɪðər/","extraExplanation":["“dithers”既可以是动词第三人称单数（He/She/It dithers），也可能被当作动词一般现在时的用法来理解。写作中更常见的词形是动词原形 dither、过去式 dithered、现在分词 dithering。","常见搭配：dither over/about + 名词（为某事犹豫）；in a dither（慌乱地）。语气通常偏口语，带一点“磨蹭、优柔寡断”的批评意味。"]}
{"word":"dithery","summary":{"en":"Dithery means hesitant and unable to decide; it can also describe a speckled, grainy look in digital images caused by dithering.","zh":"dithery 指“犹豫不决、拿不定主意”（非正式）；也可指数码图像因抖动算法而呈现的点状颗粒感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"unable to decide quickly; hesitant and a little confused (informal).","zh":"（非正式）犹豫不决的；拿不定主意、略显慌乱的。"},"examples":[{"en":"I felt dithery in the interview and couldn’t choose the right words.","zh":"面试时我有点犹豫慌乱，选不出合适的措辞。"},{"en":"Stop being dithery—just pick a restaurant.","zh":"别再犹豫了——就选一家餐厅吧。"},{"en":"She gave a dithery answer when we asked about her plans.","zh":"我们问她计划时，她给了个吞吞吐吐、拿不准的回答。"}]},{"partOfSpeech":"adj.","definition":{"en":"(of an image or video) showing a grainy, speckled pattern caused by “dithering,” a technique used to imitate more colors or smoother shading with limited colors.","zh":"（图像/视频）呈现颗粒状、点状的“抖动/加网点”效果；由“dithering（抖动算法）”造成，用有限色彩模拟更多颜色或更平滑渐变。"},"examples":[{"en":"The background looks dithery because the file was saved with too few colors.","zh":"背景看起来有点颗粒点状，是因为保存时颜色数太少。"},{"en":"On older screens, gradients often become dithery.","zh":"在较老的屏幕上，渐变常常会变成点点颗粒的效果。"}]}],"synonyms":["indecisive","hesitant","uncertain","wavering","wishy-washy","grainy","speckled"],"phonetic":"/ˈdɪðəri/","extraExplanation":["“dithery”主要是口语/非正式用法，常带一点不耐烦或调侃的语气，比如对方磨磨蹭蹭、拿不定主意时会用。","在数码图像里，dither/dithering 指用小点的分布来“骗过”眼睛，让颜色过渡看起来更平滑；因此 dithery 描述的是那种点状、噪点般的视觉质感。"]}
{"word":"dithiobenzoic","summary":{"en":"Dithiobenzoic means “related to dithiobenzoic acid,” a sulfur-containing compound connected to benzoic acid chemistry.","zh":"dithiobenzoic 意为“与二硫代苯甲酸有关的/其衍生的”，用于描述与含硫苯甲酸体系相关的化学物质。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to or derived from dithiobenzoic acid (an organosulfur compound related to benzoic acid in which oxygen atoms are replaced by sulfur).","zh":"与二硫代苯甲酸有关的；由二硫代苯甲酸衍生的（属于有机含硫化合物，可理解为苯甲酸的“含硫对应物”）。"},"examples":[{"en":"The sample contained a dithiobenzoic acid derivative used as a chain-transfer agent.","zh":"该样品含有一种二硫代苯甲酸衍生物，用作链转移剂。"},{"en":"Researchers synthesized a dithiobenzoic compound to study sulfur-based reactivity.","zh":"研究人员合成了一种二硫代苯甲酸相关化合物，以研究含硫反应性。"}]}],"synonyms":["dithiobenzoate (related form)"],"phonetic":"/ˌdaɪθioʊbɛnˈzoʊɪk/","extraExplanation":["这是化学命名用语：前缀 di- 表示“两个”，thio- 表示“硫/以硫代替氧”，benzoic 表示“苯甲酸相关”。因此 dithiobenzoic 大致可理解为“二硫代苯甲酸的/含两个硫取代特征的”。","在文献中常见搭配包括 dithiobenzoic acid（二硫代苯甲酸）、dithiobenzoate（二硫代苯甲酸盐/酯）。这类物质在高分子化学（如 RAFT 聚合）里可能作为试剂或中间体出现。"]}
{"word":"dithioglycol","summary":{"en":"Dithioglycol is a chemistry term for a sulfur analog of ethylene glycol, often referring to a compound with two –SH groups used in synthesis.","zh":"dithioglycol 是化学术语，指乙二醇的含硫类似物，常用来指带两个 –SH 巯基、用于合成的化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a sulfur-containing analog of ethylene glycol; commonly used to refer to a small organic compound with two thiol (–SH) groups (often 1,2-ethanedithiol), used in chemical synthesis and as a strong-smelling reagent","zh":"“乙二醇”的含硫类似物；常用来指带有两个巯基（–SH）的小分子有机化合物（常指1,2-乙二硫醇），用于有机合成等化学用途，通常气味很重"},"examples":[{"en":"In the lab, dithioglycol is handled in a fume hood because its odor is very strong.","zh":"在实验室里，二硫代乙二醇通常要在通风橱中操作，因为气味非常刺鼻。"},{"en":"Dithioglycol can be used as a building block to make sulfur-containing molecules.","zh":"二硫代乙二醇可以作为“构建模块”用来合成含硫分子。"}]}],"synonyms":["ethanedithiol","1,2-ethanedithiol","dimercaptoethane"],"phonetic":"ˌdaɪθioʊˈɡlaɪkɔːl","extraExplanation":["词形拆解：di-（两个）+ thio-（硫）+ glycol（乙二醇/二元醇）。因此它字面意思是“有两个硫相关官能团的乙二醇类似物”。","化学名在不同资料中可能指向不同的具体结构（例如1,2-乙二硫醇等）；在阅读文献时最好结合分子式、CAS号或结构式确认具体所指。","注意安全：这类含硫试剂往往具有强烈气味并可能有刺激性/毒性；实际操作应遵循SDS与实验室规范。"]}
{"word":"dithioic","summary":{"en":"“Dithioic” is a chemistry adjective meaning “containing two sulfur substitutions,” especially in terms like “dithioic acid.”","zh":"“dithioic”是化学形容词，表示“有两个硫取代（两个硫相关位置）”，常见于如“二硫代酸”等术语。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Relating to a compound or functional group in which two oxygen atoms in an oxyacid (or related group) are replaced by sulfur atoms; used especially in names like “dithioic acid.”","zh":"（化学）指一种化合物或官能团：在含氧酸（或相关基团）中有两个氧原子被两个硫原子取代；常用于命名，如“二硫代酸（dithioic acid）”。"},"examples":[{"en":"The compound was identified as a dithioic acid derivative by spectroscopy.","zh":"通过光谱分析，该化合物被鉴定为二硫代酸的衍生物。"},{"en":"Dithioic groups often show strong affinity for certain metal ions.","zh":"二硫代基团通常对某些金属离子有很强的亲和力。"}]}],"synonyms":["dithio- (as a combining form)","sulfur-substituted (general)"],"phonetic":"/daɪˈθaɪoʊɪk/","extraExplanation":["“dithio-”来自希腊语：di-（二、两个）+ thio-（硫），字面意思是“两个硫”。因此 dithioic 常出现在系统命名里，提示结构中与“氧酸”相对应的位置有两个硫替代。","该词主要用于有机/配位化学与农药、橡胶助剂、金属捕集剂等相关文献中；日常英语几乎不用。"]}
{"word":"dithiol","summary":{"en":"A dithiol is a compound containing two –SH (thiol) groups.","zh":"dithiol 指含有两个 –SH（巯基/硫醇基）的化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound that has two thiol (–SH) groups in the same molecule","zh":"一种在同一分子中含有两个巯基（–SH）的化合物"},"examples":[{"en":"1,2-ethanedithiol is a common dithiol used in organic chemistry.","zh":"1,2-乙二硫醇是一种在有机化学中常见的二硫醇。"},{"en":"Dithiols can bind strongly to metals like gold through their –SH groups.","zh":"二硫醇可以通过其 –SH 基团与金等金属强烈结合。"},{"en":"Some dithiols have a strong odor, similar to other thiols.","zh":"一些二硫醇和其他硫醇一样，会有很强的气味。"}]}],"synonyms":["dimercaptan","dimer-capto compound","alkanedithiol"],"phonetic":"ˈdaɪoʊˌθaɪɔl","extraExplanation":["“dithiol”由前缀 di-（两个）+ thiol（硫醇）组成；因此字面意思就是“含两个硫醇基的化合物”。","在实验与材料科学中，二硫醇常用于“连接/螯合”金属离子或金属表面（例如金表面自组装单分子层），因为 –SH 与某些金属亲和力较强。","中文里常见译法有“二硫醇”；也可见到“二巯基化合物/二巯基醇”这种更强调 –SH（巯基）的说法。"]}
{"word":"dithion","summary":{"en":"“Dithion” is a rare chemistry term/word part pointing to compounds that contain two sulfur atoms, most often seen in names like dithionite.","zh":"“dithion”在化学中较少单独使用，多作为构词成分出现，提示结构中含两个硫原子，常见于 dithionite 等名称中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Chemistry) a rare term/combining form referring to a sulfur-containing group with two sulfur atoms, used in names of compounds such as dithionite and dithionic acid.","zh":"（化学）较少单独使用的术语/构词形式，指含有两个硫原子的含硫基团，常见于“dithionite（连二亚硫酸盐）”“dithionic acid（连二硫酸）”等化合物名称中。"},"examples":[{"en":"Sodium dithionite is often used as a reducing agent in dyeing.","zh":"连二亚硫酸钠常用作印染中的还原剂。"},{"en":"Dithionic acid is related to sulfur oxyacids in inorganic chemistry.","zh":"连二硫酸在无机化学中与多种含氧硫酸类相关。"}]}],"synonyms":["dithion- (combining form)"],"phonetic":"/daɪˈθaɪ.ən/","extraExplanation":["词形上常可拆为 di-（“两个”）+ thion（与“硫”相关，来自希腊语 theion，意为“硫磺”）。因此在化学命名里看到 dithion- 往往提示“含两个硫”的结构。","日常英语中几乎不会单独说 dithion；更常见的是它出现在完整化学名里（如 dithionite、dithionate）。"]}
{"word":"dithionate","summary":{"en":"Dithionate is a chemistry term for the ion/salt containing S₂O₆²⁻.","zh":"dithionate 指含有二硫酸根（S₂O₆²⁻）的离子或盐。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical ion or salt containing the dithionate group, S₂O₆²⁻ (derived from dithionic acid).","zh":"二硫酸盐；含有二硫酸根（S₂O₆²⁻）的离子或盐（源自二硫酸）。"},"examples":[{"en":"Sodium dithionate is a salt that contains the dithionate ion (S₂O₆²⁻).","zh":"二硫酸钠是一种含有二硫酸根（S₂O₆²⁻）的盐。"},{"en":"In this reaction, the dithionate ion stays in solution while other products precipitate.","zh":"在这个反应中，二硫酸根留在溶液中，而其他产物会沉淀。"}]}],"synonyms":["dithionate ion","S2O6^2-"],"phonetic":"/daɪˈθaɪəˌneɪt/","extraExplanation":["“dithionate”是化学术语：di- 表示“两个”，-thion- 与硫（sulfur）有关，-ate 常用于含氧酸根或其盐的名称。","二硫酸根 S₂O₆²⁻ 与“硫酸根（sulfate, SO₄²⁻）”“硫代硫酸根（thiosulfate, S₂O₃²⁻）”等名称容易混淆；学习时可重点记住它含有两个硫原子（S₂）。"]}
{"word":"dithionic","summary":{"en":"“Dithionic” is a chemistry adjective meaning “related to dithionic acid or dithionate salts.”","zh":"“dithionic”是化学形容词，表示“与连二硫酸或连二硫酸盐有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to dithionic acid (H₂S₂O₆) or to dithionate salts (S₂O₆²⁻) in chemistry","zh":"（化学）与连二硫酸（H₂S₂O₆）或连二硫酸盐（S₂O₆²⁻）有关的"},"examples":[{"en":"The sample contained a small amount of dithionic acid.","zh":"该样品中含有少量连二硫酸。"},{"en":"Dithionic compounds are discussed in advanced inorganic chemistry courses.","zh":"连二硫酸相关化合物常在高等无机化学课程中讨论。"}]}],"synonyms":["dithionate (related)"],"phonetic":"/ˌdaɪθiˈɑnɪk/","extraExplanation":["“dithionic”来自前缀 di-（“两个”）+ thio-（“硫”）+ -ic（形容词后缀），字面上可理解为“含两个硫的酸/酸根相关的”。","在实际英语中，“dithionic”多出现在学术写作、实验报告或化学品说明中；日常对话里几乎不会用到。"]}
{"word":"dithionite","summary":{"en":"Dithionite is a strong reducing chemical (often sodium dithionite) commonly used in textile bleaching/dyeing and in chemical reduction reactions.","zh":"dithionite 指一种强还原性化学物质（常见为连二亚硫酸钠），常用于纺织漂白/染整及各类化学还原反应。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (the dithionite ion, S2O4²⁻, or its salts) used mainly as a strong reducing agent, especially for bleaching and dyeing textiles and for reducing other chemicals in industry and labs","zh":"连二亚硫酸盐（含连二亚硫酸根 S2O4²⁻ 的化合物）或其盐类；主要用作强还原剂，常用于纺织品漂白/染整，以及工业与实验室中的化学还原反应"},"examples":[{"en":"Sodium dithionite is widely used to remove color from fabrics during textile processing.","zh":"连二亚硫酸钠广泛用于纺织加工中去除织物颜色（漂白）。"},{"en":"In the lab, dithionite can reduce certain metal ions to a lower oxidation state.","zh":"在实验室里，连二亚硫酸盐可以把某些金属离子还原到更低的氧化态。"},{"en":"The solution lost its reducing power because the dithionite decomposed in air.","zh":"由于连二亚硫酸盐在空气中分解，溶液的还原能力下降了。"}]}],"synonyms":["sodium dithionite","hydrosulfite","dithionite salt"],"phonetic":"/dɪˈθaɪəˌnaɪt/","extraExplanation":["“dithionite”这个词来自“di-（二）+ thionite（与含硫含氧阴离子相关的命名）”，指含有两个硫原子的连二亚硫酸根（S2O4²⁻）。最常见的是“sodium dithionite（连二亚硫酸钠）”。","它对水和空气相对不稳定，尤其在酸性条件下更容易分解并可能产生二氧化硫等刺激性气体；在实际使用中通常需要现配现用、密封保存，并注意通风与防护。","学习相关词汇时，可一并记：reducing agent（还原剂）、oxidation state（氧化态）、bleaching（漂白）、dyeing（染色）。"]}
{"word":"dithionous","summary":{"en":"“Dithionous” is a chemistry adjective meaning related to dithionous acid or dithionites, often implying a strong reducing (decolorizing) property.","zh":"“Dithionous”是化学形容词，表示与连二亚硫酸或连二亚硫酸盐有关，常带有“强还原/脱色”的含义。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Relating to dithionous acid or to compounds (dithionites) derived from it; commonly referring to substances containing the dithionite ion and used as reducing agents.","zh":"（化学）与连二亚硫酸（dithionous acid）或其衍生物（连二亚硫酸盐/亚连二硫酸盐，dithionites）有关的；常指含连二亚硫酸根并具有还原性的物质。"},"examples":[{"en":"Sodium dithionite is sometimes described as a dithionous reagent because it is a strong reducing agent.","zh":"连二亚硫酸钠有时会被称为“dithionous 试剂”，因为它是一种强还原剂。"},{"en":"In textile processing, dithionous compounds can be used to remove color from dyes.","zh":"在纺织加工中，dithionous 类化合物可用于使染料褪色。"}]}],"synonyms":["dithionite (related term)","reducing (context-dependent)"],"phonetic":"/daɪˈθaɪ.ə.nəs/","extraExplanation":["“dithionous”主要出现在较旧或较专业的化学语境中：连二亚硫酸（dithionous acid, H2S2O4）本身不太稳定，但它的盐类（dithionites，如 sodium dithionite，Na2S2O4）很常见，用作还原剂、漂白/脱色剂等。","现代资料里更常直接用“dithionite”来指代相关盐类与离子；“dithionous”多作为形容词修饰“acid / compounds / reagent”等。"]}
{"word":"dithymol","summary":{"en":"Dithymol is a rare chemistry term meaning a compound made from two thymol units.","zh":"dithymol 是较少见的化学用语，指由两个百里香酚结构单元组成的化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound formed from two thymol units (a “dimer” of thymol), sometimes mentioned in chemistry or pharmaceutical contexts","zh":"一种由两个百里香酚（thymol）结构单元结合形成的化合物（百里香酚的“二聚体”），多见于化学或药学语境"},"examples":[{"en":"The paper compares thymol and dithymol to see how dimerization changes antibacterial activity.","zh":"这篇论文比较了百里香酚和二百里香酚，以观察二聚化如何改变抗菌活性。"},{"en":"Dithymol is mainly encountered in research articles rather than everyday English.","zh":"“dithymol”主要出现在研究文章中，而不是日常英语里。"}]}],"synonyms":["thymol dimer","dimeric thymol (context-dependent)"],"phonetic":"/ˌdaɪˈθaɪmɔːl/","extraExplanation":["这个词在一般词典里不常见，更多属于化学命名用语。前缀 di- 表示“二、两个”，thymol 指“百里香酚”（常见于消毒、防腐相关讨论）。","在不同资料中，dithymol 可能指“由两个 thymol 片段构成的相关衍生物/二聚体”这一类结构；如果你有具体出处（论文标题、配方、CAS 号或上下文句子），我可以帮你核对它在那段文本中对应的确切化学名称与用途。"]}
{"word":"dithyramb","summary":{"en":"A dithyramb is an overjoyed, emotional piece of praise; historically, it was a Greek hymn to Dionysus.","zh":"dithyramb 指夸张热烈的颂词；历史上指古希腊献给酒神的合唱赞歌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A passionate, excited speech, poem, or piece of writing that praises someone or something in an exaggerated, highly emotional way.","zh":"（对人或事物）充满激情、夸张而高度情绪化的颂词；热烈赞美的演讲/诗文。"},"examples":[{"en":"The review was a dithyramb about the director’s genius.","zh":"那篇影评是一篇对导演天才的激情颂扬。"},{"en":"Her speech turned into a dithyramb praising the team’s “heroic” effort.","zh":"她的演讲变成了一篇颂词，称赞团队“英雄般”的努力。"},{"en":"He wrote a dithyramb to the city that raised him.","zh":"他写了一篇热情颂文献给养育他的那座城市。"}]},{"partOfSpeech":"n.","definition":{"en":"In ancient Greece, a choral hymn sung in honor of Dionysus (the god of wine and theater), often performed with strong emotion and music.","zh":"（古希腊）酒神狄俄尼索斯的合唱赞歌；常伴随音乐，情感强烈。"},"examples":[{"en":"Scholars link early Greek drama to ritual performances like the dithyramb.","zh":"学者认为早期希腊戏剧与酒神赞歌等仪式表演有关。"},{"en":"The chorus performed a dithyramb during the festival.","zh":"合唱队在节日期间演唱了酒神赞歌。"}]}],"synonyms":["panegyric","encomium","eulogy","paean","rhapsody"],"phonetic":"/ˈdɪθɚˌæm/","extraExplanation":["词源与文化背景：dithyramb 来自古希腊语 dithyrambos，最初指献给酒神狄俄尼索斯（Dionysus）的合唱赞歌。因为这种赞歌通常情绪高涨、语言华丽，后来在英语里引申为“夸张热烈的赞美”。","用法提示：现代英语中它常带一点“过度吹捧”的味道（略带讽刺或批评语气），尤其在评论、演讲或社交媒体夸赞中。","相关词：dithyrambic（adj. 颂扬的；极其热情的），常见搭配：a dithyramb about/over sb/sth。"]}
{"word":"dithyrambic","summary":{"en":"Dithyrambic means extremely enthusiastic, often overly praising; it can also mean related to ancient Greek ecstatic hymns (dithyrambs).","zh":"dithyrambic 指极度热烈、近乎夸张的赞美；也可指与古希腊酒神颂歌那种狂欢式赞歌有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"wildly enthusiastic, often in an overly praising or poetic way (sometimes suggesting exaggeration).","zh":"（赞美或情绪）极度热烈的；狂喜般歌颂的（有时暗示夸张）。"},"examples":[{"en":"The reviews were dithyrambic, calling the film “a masterpiece of our time.”","zh":"影评非常dithyrambic，称这部电影为“我们时代的杰作”。"},{"en":"He gave a dithyrambic speech about his mentor, praising her for every small success.","zh":"他对导师发表了一段dithyrambic的演讲，把每一个小成就都夸成了大功劳。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to a dithyramb: an ancient Greek hymn or choral song, especially one in honor of the god Dionysus (often intense and ecstatic).","zh":"与“酒神颂歌（dithyramb）”有关的：古希腊的赞歌或合唱诗，尤指献给酒神狄俄尼索斯的、情绪高亢而狂欢式的颂歌。"},"examples":[{"en":"The play opens with a dithyrambic chorus that celebrates wine and freedom.","zh":"这出戏以一段dithyrambic的合唱开场，歌颂美酒与自由。"},{"en":"Her poem uses dithyrambic rhythms to create a feeling of ecstatic celebration.","zh":"她的诗运用dithyrambic的节奏，营造出狂喜般的庆典氛围。"}]}],"synonyms":["rapturous","ecstatic","effusive","gushing","panegyric"],"phonetic":"/ˌdɪθəˈræmbɪk/","extraExplanation":["“dithyrambic”来自名词“dithyramb”（酒神颂歌）。在现代英语里，它常用于评论、演讲、媒体报道等语境，表示“热烈到近乎失控或不够客观的赞美”，有时带一点点讽刺意味。","搭配提示：dithyrambic praise（狂热的赞美）、dithyrambic reviews（吹捧式的评论）、dithyrambic language（夸张的颂词）。如果想表达更中性、稳重的“高度赞扬”，可用 glowing / enthusiastic / high praise 等。"]}
{"word":"dithyrambically","summary":{"en":"“Dithyrambically” means “with wildly enthusiastic, often over-the-top praise,” especially in a literary or emotional style.","zh":"“dithyrambically”意为“以狂热、情绪化、往往略显夸张的方式赞美/表达”，常见于文学或评论语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In an extremely enthusiastic, emotional, or “gushing” way; with wild praise.","zh":"以极其热情、情绪化、近乎“溢美”的方式；带着狂热的赞美。"},"examples":[{"en":"The critics wrote dithyrambically about the new novel, calling it a masterpiece before it even reached bookstores.","zh":"评论家对这本新小说大加赞美，甚至在它上架前就称之为“杰作”。"},{"en":"She spoke dithyrambically of her mentor, praising his kindness and brilliance.","zh":"她谈起导师时热情洋溢，称赞他的善良与才华。"}]},{"partOfSpeech":"adv.","definition":{"en":"(Literary) In a style like a dithyramb—rhapsodic, lofty, and sometimes overly ornate.","zh":"（文学）以类似“酒神颂歌”的风格：热狂抒情、语气高亢，有时也显得辞藻过盛。"},"examples":[{"en":"The poem turns dithyrambically toward the end, overflowing with lofty images and exclamations.","zh":"这首诗在结尾处转为热狂抒情，充满高昂的意象与感叹。"},{"en":"He describes the landscape dithyrambically, as if nature itself were divine.","zh":"他用热狂的笔调描写风景，仿佛自然本身具有神性。"}]}],"synonyms":["rhapsodically","effusively","ecstatically","enthusiastically","lavishly","exuberantly"],"phonetic":"/ˌdɪθəˈræmbɪkli/","extraExplanation":["“dithyramb”原指古希腊献给酒神狄俄尼索斯（Dionysus）的合唱颂歌，常带有狂喜、热烈、放纵的气氛。后来这个词引申为“热烈到夸张的赞美”。因此 ditherambically 常暗含“过度吹捧/夸赞”的语感，语境里有时带轻微讽刺。"]}
{"word":"Dithyrambos","summary":{"en":"Dithyrambos is an ancient Greek choral hymn to Dionysus, and by extension means extravagant, over-enthusiastic praise.","zh":"Dithyrambos 原指古希腊献给酒神狄俄尼索斯的合唱赞歌；引申为夸张而热烈的颂扬。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ancient Greece) A choral hymn or song performed in honor of Dionysus (the god of wine), often passionate and ecstatic in style.","zh":"（古希腊）为酒神狄俄尼索斯（Dionysus）而唱的合唱赞歌/颂歌，风格常常热烈、奔放、带有狂喜感。"},"examples":[{"en":"In classical Athens, a dithyrambos was performed at festivals celebrating Dionysus.","zh":"在古典雅典，dithyrambos 常在庆祝狄俄尼索斯的节日上演唱。"},{"en":"The chorus practiced the dithyrambos for weeks before the spring festival.","zh":"合唱队在春季节庆前排练 dithyrambos 好几个星期。"}]},{"partOfSpeech":"n.","definition":{"en":"(Figurative) Wildly enthusiastic, extravagant praise; a speech or piece of writing that praises someone or something in an over-the-top way.","zh":"（引申）热情到夸张的颂扬；过度吹捧的演讲或文字。"},"examples":[{"en":"The review was a dithyrambos about the director’s genius.","zh":"那篇影评简直是在对导演的天才进行夸张的吹捧。"},{"en":"His dithyrambos for the new product sounded more like advertising than analysis.","zh":"他对新产品的颂词听起来更像广告，而不是分析。"}]}],"synonyms":["dithyramb","panegyric","encomium","rhapsody"],"phonetic":"/ˈdɪθəˌræmboʊs/","extraExplanation":["“Dithyrambos”（希腊语 διθύραμβος）是英语“dithyramb”的来源；在英语里更常用的形式是“dithyramb”。","它与狄俄尼索斯崇拜、酒神节庆和合唱传统密切相关，后来在文学批评中常用来形容“情绪高涨、辞藻奔放、甚至有点失控的赞美”。","文学与思想领域中常提到“dithyrambic”（形容词）：意为“酒神式的、热情奔放的、夸赞过度的”。"]}
{"word":"dithyrambos","summary":{"en":"Dithyrambos is an ancient Greek choral hymn to Dionysus, and by extension it can mean wildly enthusiastic, possibly exaggerated praise.","zh":"Dithyrambos指古希腊献给酒神狄俄尼索斯的合唱赞歌；引申可指极度热烈、甚至略显夸张的赞美。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Ancient Greek) a passionate choral hymn sung in honor of Dionysus (the god of wine and theater); the original form behind the English word “dithyramb.”","zh":"（古希腊）献给酒神狄俄尼索斯的热烈合唱赞歌；是英语“dithyramb（酒神颂/狂热颂歌）”的源头形式。"},"examples":[{"en":"In some accounts, tragedy developed from the dithyrambos performed at Dionysian festivals.","zh":"一些说法认为，悲剧起源于酒神节上演唱的dithyrambos（酒神颂）。"},{"en":"The chorus sang a dithyrambos with energetic rhythm and ecstatic language.","zh":"合唱队用充满力量的节奏与近乎狂喜的语言唱起dithyrambos。"}]},{"partOfSpeech":"n.","definition":{"en":"(By extension, in English writing) an extremely enthusiastic poem, speech, or piece of praise, often so emotional that it can feel exaggerated.","zh":"（引申义，英语写作中）极度热情、甚至带夸张色彩的诗、演讲或赞美之词。"},"examples":[{"en":"His review turned into a dithyrambos about the director’s genius.","zh":"他的影评几乎变成了对导演天才的dithyrambos式狂热赞颂。"},{"en":"Try to balance admiration with evidence so your praise doesn’t sound like dithyrambos.","zh":"尽量让赞美有证据支撑、保持平衡，免得听起来像dithyrambos式的夸赞。"}]}],"synonyms":["dithyramb","hymn","ode","panegyric","eulogy"],"phonetic":"ˌdɪθɪˈræmbɑs","extraExplanation":["“dithyrambos”来自古希腊语 διθύραμβος，常与酒神狄俄尼索斯（Dionysus）崇拜和酒神节（Dionysia）相关，表演形式通常是合唱、舞蹈与强烈节奏结合，语气高亢奔放。","英语里更常见的形式是“dithyramb”（酒神颂/狂热颂歌）。在现代语境中，它常带一点语感：赞美得太热烈、太情绪化，可能显得夸张或不够客观。","文学与思想史中，古希腊诗人品达（Pindar）等与“dithyramb”体裁相关；后世也常用“酒神式/狄俄尼索斯式（Dionysian）”来形容其狂放、激情的审美气质。"]}
{"word":"dithyrambs","summary":{"en":"Dithyrambs are wildly enthusiastic (often overly praising) comments or writings; historically, they were ancient Greek hymns to Dionysus.","zh":"dithyrambs 指热烈到近乎夸张的赞美之词/文章；历史上也指古希腊敬奉酒神狄俄尼索斯的合唱赞歌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a wildly enthusiastic speech, poem, or piece of writing that praises someone or something in an over-the-top way","zh":"（对某人/某物）热烈到近乎夸张的赞美之词；颂歌式的吹捧文章/讲话"},"examples":[{"en":"The review was full of dithyrambs about the new restaurant.","zh":"那篇评论里满是对新餐厅的热烈（甚至有点夸张的）赞美。"},{"en":"He wrote dithyrambs about his favorite singer on social media.","zh":"他在社交媒体上写了很多对自己最喜欢的歌手的狂热赞美。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) a choral hymn sung in ancient Greece, especially in honor of Dionysus (the god of wine and theater)","zh":"（历史）酒神颂歌：古希腊合唱的赞歌，常用于敬奉狄俄尼索斯（酒神、戏剧之神）"},"examples":[{"en":"In class we read about the dithyrambs performed at Greek festivals.","zh":"课上我们读到了古希腊节庆中表演的酒神颂歌。"},{"en":"The play’s opening imitates the style of ancient dithyrambs.","zh":"这部戏的开场模仿了古代酒神颂歌的风格。"}]}],"synonyms":["panegyrics","eulogies","rhapsodies","encomiums"],"phonetic":"/ˈdɪθəˌræmz/","extraExplanation":["“dithyramb”原本是古希腊敬奉狄俄尼索斯的合唱赞歌，气氛热烈、节奏奔放。后来在英语里引申为“热情到夸张的赞美”，常带一点讽刺意味：暗示赞美可能过头、不够客观。","单数是 dithyramb；你给的 dithyrambs 是复数。写作/评论中常见搭配：dithyrambs about/over something（对……的狂热赞美）。"]}
{"word":"Dithyrambus","summary":{"en":"Dithyrambus is a (usually literary/academic) word for an ancient Greek hymn to Dionysus, and by extension any overly enthusiastic, extravagant praise.","zh":"Dithyrambus（多见于文学/学术语境）指古希腊祭祀酒神的合唱颂歌；引申为过度热烈、夸张的赞美之辞。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in ancient Greece) A choral hymn or song sung in honor of Dionysus, the god of wine, often lively and emotional.","zh":"（古希腊）酒神狄俄尼索斯的合唱赞歌/颂歌，通常热烈而富有激情。"},"examples":[{"en":"The professor played a recording of a dithyrambus performed for Dionysus.","zh":"教授播放了一段为狄俄尼索斯演唱的酒神颂录音。"},{"en":"In classical drama, the dithyrambus influenced the development of tragedy.","zh":"在古典戏剧中，酒神颂影响了悲剧的发展。"}]},{"partOfSpeech":"n.","definition":{"en":"A piece of speech or writing that is wildly enthusiastic, overly praising, or emotionally excited (often used critically).","zh":"（常带批评意味）热情过度、吹捧过火的演说或文字；狂热的颂词。"},"examples":[{"en":"His review turned into a dithyrambus, praising the film as if it were perfect.","zh":"他的影评几乎成了狂热颂词，把这部电影夸得完美无缺。"},{"en":"Try to avoid dithyrambus in formal writing; give evidence instead of excessive praise.","zh":"正式写作中尽量避免过度颂扬；要用证据代替夸张的赞美。"}]}],"synonyms":["dithyramb","panegyric","encomium","rhapsody"],"phonetic":"/ˈdɪθəˌræmbəs/","extraExplanation":["“Dithyrambus”来自希腊语 *dithyrambos*（酒神颂），后经拉丁语形式进入英语学术语境。现代英语更常见的拼写是 **dithyramb**；“dithyrambus”通常显得更古典、更学术。","在文学与批评中，这个词常用来暗示“赞美得太夸张、不够客观”，因此语气往往带一点讽刺或保留。"]}
{"word":"dithyrambus","summary":{"en":"Dithyrambus means an extremely enthusiastic (sometimes exaggerated) piece of praise; historically, it was a Greek choral hymn to Dionysus.","zh":"dithyrambus 指极其热烈（常带夸张）的颂扬文字/言辞；历史上也指古希腊献给狄俄尼索斯的合唱颂歌。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a passionate poem or speech praising someone or something, often in an exaggerated or very enthusiastic way","zh":"（对人或事的）热烈颂歌、赞美诗或颂辞；常带夸张的热情"},"examples":[{"en":"The article was a dithyrambus about the new movie, calling it “perfect in every way.”","zh":"那篇文章对新电影极尽颂扬，称它“各方面都完美”。"},{"en":"His speech turned into a dithyrambus praising the team’s “unmatched spirit.”","zh":"他的演讲变成了一篇颂辞，赞美球队“无与伦比的精神”。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) a choral song in ancient Greece, originally sung in honor of Dionysus, the god of wine and theater","zh":"（历史）古希腊合唱颂歌：最初用于敬奉狄俄尼索斯（酒神与戏剧之神）的合唱歌曲"},"examples":[{"en":"In class we read about the dithyrambus as an early form connected to Greek drama.","zh":"课堂上我们读到狄俄尼索斯颂歌，它与早期希腊戏剧形式有关。"},{"en":"The festival included a dithyrambus performed by a large chorus.","zh":"节庆活动中有一支大合唱团表演狄俄尼索斯颂歌。"}]}],"synonyms":["panegyric","eulogy","encomium","hymn (historical sense)","tribute"],"phonetic":"/ˌdɪθəˈræmbəs/","extraExplanation":["这个词在英语里较少见，更常见的对应词是 *panegyric*（颂辞/颂文）或形容词 *dithyrambic*（狂热赞美的）。","词源来自希腊语 *dithyrambos*。从“祭祀歌”发展到“热烈颂扬的文字/言辞”，所以在现代语境里常带一点“过度吹捧”的意味，语气可能含轻微讽刺。"]}
{"word":"diting","summary":{"en":"“Diting” most often refers to a Chinese mythical beast (linked with Dizang Wang); it is also a common misspelling of “dieting.”","zh":"“diting”多指中国神话/佛教传说中的神兽“谛听”，也常是“dieting（控制饮食/节食）”的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Diting: a mythical beast in Chinese Buddhist folklore, known as the mount/companion of Kṣitigarbha (Dizang Wang) and famous for its ability to “listen” and tell truth from lies.","zh":"谛听：源自中国佛教民间传说的神兽，常被说是地藏王菩萨（Kṣitigarbha）的坐骑/侍兽，以“善听辨真伪”（能听辨是非、真假）而闻名。"},"examples":[{"en":"In some stories, Diting helps Dizang Wang judge whether someone is telling the truth.","zh":"在一些故事里，谛听帮助地藏王分辨别人是否在说真话。"},{"en":"The name Diting is often linked to the idea of “listening carefully.”","zh":"“谛听”这个名字常和“认真倾听、明辨”联系在一起。"}]},{"partOfSpeech":"other","definition":{"en":"Common misspelling of “dieting” (trying to lose weight or eat in a controlled way).","zh":"常见误拼：dieting（节食/控制饮食，通常为了减重或更健康）。"},"examples":[{"en":"Did you mean “dieting”? Example: She is dieting to feel healthier.","zh":"你可能想写的是“dieting”。例：她在控制饮食，让自己更健康。"},{"en":"Many people start dieting after the holidays.","zh":"很多人会在假期后开始节食/控制饮食。"}]}],"synonyms":["Dizang’s mount","mythical beast","dieting (correct spelling)"],"phonetic":"/ˈdiːtɪŋ/","extraExplanation":["“谛听”在中文里常见写作“谛听”，也有人写作“地听”。它在《西游记》等相关语境里被提到，常被描绘为能辨别真伪、洞察人心的神兽。","如果你想表达“节食/减肥”，标准拼法是 dieting（/ˈdaɪətɪŋ/）；而 diting 更常被当作专名（谛听）或拼写错误。"]}
{"word":"dition","summary":{"en":"“Dition” alone is not a standard English word; it’s usually part of other words like “edition” or “condition.”","zh":"“dition”单独使用不是标准英文词，通常只是“edition”“condition”等词的一部分。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word by itself. You usually see this sound/spelling as part of other words (for example, in “edition” or “condition”). If you saw “dition” alone, it is likely a typo or an incomplete word.","zh":"“dition”本身不是标准英文单词。你通常只会在其他单词里看到这个拼写/读音（例如“edition”“condition”）。如果单独出现“dition”，多半是拼写错误或单词没写完整。"},"examples":[{"en":"I can’t find “dition” in the dictionary—did you mean “edition”?","zh":"我在词典里找不到“dition”——你是不是想写“edition（版本/版次）”？"},{"en":"The correct word is “condition,” not “dition.”","zh":"正确的词是“condition（条件/状况）”，不是“dition”。"}]}],"phonetic":"/ˈdɪʃən/","extraExplanation":["在英语里，很多以 -dition 结尾的词来自拉丁语词根（常和“说/宣告/给出”等概念有关），但“dition”并不作为一个独立词使用。常见相关词有：edition（版本/版次）、condition（条件/状况）、addition（增加/加法）、tradition（传统）、contradiction（矛盾/反驳）。如果你告诉我上下文句子，我可以帮你判断你想表达的是哪一个词。"]}
{"word":"Ditmars","summary":{"en":"Ditmars is most commonly a New York City place name (a Queens/Astoria area), and it can also be a surname.","zh":"Ditmars 最常见是纽约市的地名（皇后区阿斯托里亚一带），也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A neighborhood area in Astoria, in the borough of Queens, New York City (often referring to the Ditmars–Steinway area).","zh":"（专有名词）纽约市皇后区阿斯托里亚的一片社区区域（常指 Ditmars–Steinway 一带）。"},"examples":[{"en":"She moved to Ditmars because it’s quieter than other parts of Astoria.","zh":"她搬到 Ditmars，因为那里比阿斯托里亚的其他地方更安静。"},{"en":"Let’s meet near Ditmars Boulevard after work.","zh":"下班后我们在 Ditmars Boulevard 附近见吧。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname (family name), originally of Dutch/German background in the U.S.","zh":"（姓氏）Ditmars（在美国常见于荷兰/德语背景的家族姓）。"},"examples":[{"en":"His last name is Ditmars, and his family has lived in New York for generations.","zh":"他姓 Ditmars，他的家族在纽约生活了好几代。"}]}],"synonyms":["Ditmars–Steinway (area name)","Ditmars Boulevard (street name)"],"phonetic":"ˈdɪt.mɑrz","extraExplanation":["在纽约语境里，Ditmars 常常是“地点简称”，尤其指皇后区阿斯托里亚北部、靠近 Ditmars Boulevard/地铁 N 线终点一带。日常口语中，人们会直接说“in Ditmars”来表示住在那片区域。","地名 Ditmars 一般被认为与当地早期的荷兰裔家族/地主有关；很多纽约街区名都来自早期定居者或土地所有者的姓氏。"]}
{"word":"Ditmore","summary":{"en":"“Ditmore” is mainly used as an English surname and is not a common vocabulary word.","zh":"“Ditmore”主要用作英语姓氏，不是常见的英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname).","zh":"姓氏（家族姓）。"},"examples":[{"en":"Ms. Ditmore will lead today’s meeting.","zh":"Ditmore 女士将主持今天的会议。"},{"en":"My teacher’s last name is Ditmore.","zh":"我老师的姓是 Ditmore。"}]},{"partOfSpeech":"other","definition":{"en":"a given name used for a person (rare).","zh":"人名（较少见，可作名字使用）。"},"examples":[{"en":"Ditmore Johnson was mentioned in the local newspaper.","zh":"当地报纸提到了 Ditmore Johnson。"}]}],"phonetic":"/ˈdɪt.mɔr/","extraExplanation":["“Ditmore”多见于英语国家的人名系统中作为姓氏。它不是常见词汇，因此通常不翻译含义，而是按读音音译或直接保留拼写。","在正式写作中，作为姓氏时首字母大写：Ditmore；在按姓称呼时常用 Mr./Ms./Dr. Ditmore。"]}
{"word":"ditokous","summary":{"en":"Ditokous is a rare biological adjective meaning “twin-bearing,” producing two offspring at one birth.","zh":"ditokous 是个罕用的生物学形容词，表示“一次产生两个后代”，即“产双子/双胎的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare, biology) Producing or bearing two offspring at one birth; twin-bearing.","zh":"（罕用，生物学）一次分娩/产卵产生两个后代的；双胎的、产双子的。"},"examples":[{"en":"Some animals are more likely to have ditokous births under good nutrition.","zh":"在营养条件良好时，有些动物更容易出现一次产双子的情况。"},{"en":"The report describes a ditokous pregnancy (twins).","zh":"报告描述了一次双胎妊娠（产双子）。"}]}],"synonyms":["twin-bearing","twinning"],"phonetic":"/daɪˈtoʊkəs/","extraExplanation":["这个词非常少见，多用于学术语境。词源来自希腊语前缀 di-（“二、双”）+ -tokous（与“生产、分娩”有关）。在现代英语里，日常更常用 twin / twins 或 twin-bearing 来表达类似意思。","如果你是在文献里见到 ditokous，也可能与近形词混淆：例如 dystocous（难产的）或 dioecious（雌雄异株的）。可以把原句发我，我能帮你核对具体含义。"]}
{"word":"ditolyl","summary":{"en":"“Ditolyl” is a chemistry term meaning “having two tolyl (methyl-phenyl) groups,” mostly used in chemical names.","zh":"“Ditolyl”是化学术语，表示“含有两个甲苯基（甲基-苯基）”，主要用于化合物命名。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(chemistry) Containing two tolyl groups (methyl-phenyl groups); used in names of organic compounds.","zh":"（化学）含有两个甲苯基（甲基-苯基）的；常用于有机化合物命名。"},"examples":[{"en":"Ditolyl ether is an organic compound with two tolyl groups linked by an oxygen atom.","zh":"二甲苯基醚是一种有机化合物，由两个甲苯基通过一个氧原子连接。"},{"en":"The paper describes a ditolyl-substituted compound used in polymer research.","zh":"这篇论文描述了一种用于聚合物研究的二甲苯基取代化合物。"}]},{"partOfSpeech":"n.","definition":{"en":"A compound or substituent group described as “ditolyl” in chemical naming (less common as a standalone noun in everyday English).","zh":"（较少单独使用）在化学命名中被称为“ditolyl”的化合物或取代基。"},"examples":[{"en":"In the synthesis section, the authors added a ditolyl reagent to the reaction mixture.","zh":"在合成部分，作者将一种二甲苯基试剂加入反应混合物中。"}]}],"synonyms":["bis(tolyl)","di(p-tolyl) (context-specific)"],"phonetic":"/daɪˈtoʊlɪl/","extraExplanation":["“tolyl（甲苯基）”来自 toluene（甲苯）。在有机化学里，-yl 常表示“从某种分子去掉一个氢后形成的取代基”。因此 di- + tolyl = “两个甲苯基”。","“ditolyl”更常出现在专业化学语境（论文、材料科学、药物化学命名）中；如果你是在日常英语里看到 ditolyl，很可能是拼写误差或技术文本。"]}
{"word":"ditone","summary":{"en":"A ditone is a music interval of two whole steps, usually the major third.","zh":"ditone指由两个全音组成的音程，通常相当于大三度。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Music) An interval spanning two whole tones; in modern terms, usually a major third.","zh":"（音乐）两个全音构成的音程；按现代说法通常相当于“大三度”。"},"examples":[{"en":"From C to E is a ditone (a major third).","zh":"从C到E是一个ditone（大三度）。"},{"en":"The melody jumps by a ditone, making the line sound brighter.","zh":"旋律跳进一个ditone，让线条听起来更明亮。"}]},{"partOfSpeech":"n.","definition":{"en":"(Historical, music theory) In some older theories (e.g., Greek or medieval usage), a specific kind of major third based on tuning systems that count “two tones.”","zh":"（历史用法，乐理）在一些较早的理论（如古希腊或中世纪用法）中，指按特定调律系统计算的“两个全音”的大三度音程。"},"examples":[{"en":"In medieval writings, the ditone was contrasted with smaller, “imperfect” intervals.","zh":"在中世纪著作中，ditone常与更小的“未完全”音程作对比。"},{"en":"Depending on tuning, the ditone may not match the exact size of a modern equal-tempered major third.","zh":"由于调律不同，ditone的音程大小不一定与现代十二平均律的大三度完全一致。"}]}],"synonyms":["major third","interval of a third","two whole tones"],"phonetic":"/ˈdaɪtoʊn/","extraExplanation":["词源：来自前缀 di-（“二、两”）+ tone（“全音/音”），字面意思就是“两个全音”。","学习提示：别把 ditone 和 tritone（增四度/减五度，常被称为“魔鬼音程”）混淆；ditone通常更接近“明亮稳定”的大三度。"]}
{"word":"ditrematous","summary":{"en":"Ditrematous means “having two openings/pores,” mainly used in zoology or biology.","zh":"ditrematous 意为“具有两个开口/孔的”，主要用于动物学或生物学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Biology, zoology) Having two openings, pores, or apertures.","zh":"（生物学/动物学）具有两个开口、孔或孔隙的；双孔的。"},"examples":[{"en":"Some marine organisms are described as ditrematous because they have two distinct openings.","zh":"有些海洋生物被描述为 ditrematous，因为它们有两个明显分开的开口。"},{"en":"In older zoology texts, the species was classified as ditrematous based on its body structure.","zh":"在较早的动物学文献中，该物种因其身体结构而被归类为 ditrematous（双孔的）。"}]}],"synonyms":["two-pored","two-opening","biporous"],"phonetic":"/daɪˈtrɛmətəs/","extraExplanation":["这是一个非常少见、偏学术的词，主要出现在生物学/动物学描述中。词根来自希腊语：di- 表示“二”，trema 表示“孔/洞”，-ous 表示“具有……性质的”。","如果你是在论文或标本描述里看到它，也可能是某个更常见术语的拼写变体或误拼。常见相关词根：tremat-（孔、开口），以及 trematode（吸虫，字面义“有孔的动物”）。"]}
{"word":"ditremid","summary":{"en":"“Ditremid” isn’t a standard word; you may mean “detriment” = harm or damage (often in “to the detriment of”).","zh":"“ditremid”不是标准英文；你可能想写“detriment”，意为“损害/不利”（常用于“to the detriment of”）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Not a standard English word.) If you meant “detriment,” it means harm or damage—something that makes a situation worse.","zh":"（不是标准英文单词。）如果你想写的是“detriment”，意思是伤害、损害——使情况变得更糟的事物。"},"examples":[{"en":"Smoking is a detriment to your health.","zh":"吸烟对健康有害。"},{"en":"The long delay was a detriment to the project.","zh":"长时间的延误对项目不利。"}]},{"partOfSpeech":"phrase","definition":{"en":"“to the detriment of” means “in a way that harms or weakens.”","zh":"“to the detriment of”表示“以伤害/削弱……为代价；对……不利”。"},"examples":[{"en":"He worked so much that it was to the detriment of his family life.","zh":"他工作太多，以至于损害了家庭生活。"},{"en":"They focused on speed to the detriment of quality.","zh":"他们只追求速度，结果牺牲了质量。"}]}],"synonyms":["harm","damage","disadvantage","injury"],"phonetic":"/ˈdɛtrəmənt/","extraExplanation":["“detriment”常见于较正式的书面语或新闻报道中，日常口语里也可以用“harm”“damage”来表达类似意思。","如果你告诉我你想表达的句子或上下文，我也可以帮你确认“ditremid”最可能是哪一个正确单词（例如：determined / detriment / trimmed 等）。"]}
{"word":"Ditremidae","summary":{"en":"Ditremidae is a scientific family name for certain marine fishes (ditremids).","zh":"Ditremidae 是某些海水鱼类的科级科学名称（双鳍鱼类）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific family name for a small group of marine ray-finned fishes (the ditremids), used in biological classification","zh":"（生物分类学）鱼类的一个科名：Ditremidae（拟双鳍鱼科/双鳍鱼科，常称“ditremids（双鳍鱼类）”），指一小群海水辐鳍鱼"},"examples":[{"en":"Ditremidae is a family name used in fish taxonomy.","zh":"Ditremidae 是鱼类分类学中使用的一个科名。"},{"en":"The paper compares Ditremidae with related fish families from the North Pacific.","zh":"这篇论文把 Ditremidae 与北太平洋的相关鱼类科进行比较。"}]}],"synonyms":["ditremids","a fish family (taxonomic family)"],"phonetic":"/daɪˈtriːmɪdiː/","extraExplanation":["词尾 -idae 常见于动物分类学里，表示“科”（family）。例如：Felidae（猫科）、Hominidae（人科）。","这是一个拉丁化的科学名称，日常英语里更常见的是说“a fish family”或直接用更具体的属/种名；在阅读学术文章或物种名录时更常遇到。"]}
{"word":"ditremidae","summary":{"en":"Ditremidae: a scientific (taxonomic) name for a family of North Pacific marine fishes.","zh":"Ditremidae：一个分类学名称，指主要分布于北太平洋的海水鱼类“科”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family of marine ray-finned fishes found mainly in the North Pacific (often called ditremid fishes).","zh":"鲈形目的一科海水辐鳍鱼（主要分布于北太平洋一带），常称“二孔鱼科/ditremid fishes”。"},"examples":[{"en":"Some coastal surveys in Japan list Ditremidae among common nearshore fish families.","zh":"在日本的一些近岸调查中，二孔鱼科（Ditremidae）常被列为常见鱼类家族之一。"},{"en":"The paper compares feeding habits of species in Ditremidae and related groups.","zh":"这篇论文比较了二孔鱼科（Ditremidae）物种与相关类群的摄食习性。"}]}],"synonyms":["ditremids","ditremid fishes"],"phonetic":"/daɪˈtrɛmɪdi/","extraExplanation":["这是一个生物分类学名（科名）。在英文里通常用于学术或科普语境，写法多为首字母大写的拉丁化名称：Ditremidae。","词形上以 -idae 结尾的词在动物分类中通常表示“科”（family），如 Felidae（猫科）、Canidae（犬科）。","发音以英语读法为主；在学术交流中也常直接按拉丁学名的英语习惯读出。"]}
{"word":"ditrichotomous","summary":{"en":"A rare technical adjective meaning “trichotomous twice”: splitting into three parts and then into three again.","zh":"一个罕见的技术形容词，意为“二重三分”：先分成三部分，再各自分成三部分。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare, technical) Describing a branching pattern or division that is trichotomous twice—i.e., it splits into three parts, and then those parts split into three again (a two-level “three-way” branching).","zh":"（罕见、技术用语）描述一种“二重三分”的分枝或划分方式：先分成三部分，然后各部分再分成三部分（两层的“三叉式”分枝）。"},"examples":[{"en":"Some early botanical descriptions mention ditrichotomous branching in certain algae.","zh":"一些早期的植物学描述会提到某些藻类具有 ditrichotomous（二重三分式）分枝。"},{"en":"The diagram shows a ditrichotomous pattern: three main branches, each dividing into three smaller ones.","zh":"这张图展示了 ditrichotomous 模式：三条主枝，每条再分成三条小枝。"}]}],"synonyms":["trichotomous (more common)","repeatedly trichotomous"],"phonetic":"/ˌdaɪtraɪˈkɑːtəməs/","extraExplanation":["这个词非常少见，多出现在较老的生物学/植物学文字里。构词上可拆成：di-（二、两次）+ tri-（三）+ -chotomous（“分割/分叉”的形容词形式）。","在现代写作中，更常见的表达是 trichotomous branching（“三叉分枝”）或“repeatedly trichotomous”（“反复三叉”）。如果你是想表达“二分法的”，通常用 dichotomous。"]}
{"word":"ditriglyph","summary":{"en":"A ditriglyph is a pair of triglyph blocks placed together in a Doric frieze.","zh":"ditriglyph 指多立克柱式饰带上并排出现的两块“三槽板”（双三槽板）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a set of two triglyphs (three-grooved blocks) placed together in a Doric frieze, often used to help fit the spacing of columns and decorative elements","zh":"（多立克柱式檐部饰带中的）双三槽板；指并排放置的两块三槽板（每块有三条竖向凹槽），常用于调整柱间距与装饰布局"},"examples":[{"en":"In some Doric temples, a ditriglyph appears near a corner to solve a spacing problem.","zh":"在一些多立克神庙中，角部附近会出现双三槽板，用来解决间距不协调的问题。"},{"en":"The architect used a ditriglyph to keep the rhythm of the frieze even.","zh":"建筑师用双三槽板来保持饰带节奏的均匀。"}]}],"synonyms":["double triglyph"],"phonetic":"/daɪˈtrɪɡlɪf/","extraExplanation":["这个词属于古典建筑术语：triglyph（“三槽板”）是多立克柱式（Doric order）檐部frieze（饰带）上重复出现的竖向凹槽装饰块。ditriglyph中的di-表示“两个”。它常与“角部三槽板问题”（corner triglyph problem）相关：为了让饰带在角部看起来更协调，有时会调整三槽板与metope（间壁板）的比例与位置。"]}
{"word":"ditriglyphic","summary":{"en":"A rare architecture term meaning “having two triglyphs per interval” in a Doric frieze.","zh":"一个较少见的建筑术语，指多立克饰带中“每个间隔有两块三槽板（二三槽板式）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Architecture) having two triglyphs (three-grooved blocks) in each interval of a Doric frieze; relating to a spacing scheme where two triglyphs appear between columns.","zh":"（建筑）二三槽板式的；指多立克柱式檐部的饰带（frieze）中，每个间隔出现两块三槽板（triglyph）的布局；也可泛指与这种柱距/饰带分格相关的。"},"examples":[{"en":"In a ditriglyphic arrangement, you may see two triglyphs between adjacent columns on the frieze.","zh":"在二三槽板式布局中，你可能会在相邻两根柱子之间的饰带上看到两块三槽板。"},{"en":"Some reconstructions describe the temple’s façade as ditriglyphic, based on measurements of the entablature.","zh":"一些复原研究根据檐部的尺寸，将这座神庙的正立面描述为二三槽板式的。"}]}],"synonyms":["Doric (contextual)","triglyph-related"],"phonetic":"/ˌdaɪtraɪˈɡlɪfɪk/","extraExplanation":["这个词非常少见，主要出现在古典建筑史或考古/复原的专业语境里。triglyph（“三槽板”）是多立克柱式（Doric order）饰带上的典型构件，看起来像三条竖向凹槽；“di-”表示“两个”，所以 ditriglyphic 强调“每个间隔有两块三槽板”。","相关常见词：triglyph（n. 三槽板）、Doric（adj. 多立克式的）、frieze（n. 饰带）、entablature（n. 檐部）。"]}
{"word":"ditrigonal","summary":{"en":"Ditrigonal describes a crystal form with “double trigonal” symmetry—often looking hexagonal but organized as two sets of three.","zh":"Ditrigonal 指具有“**双三方**”对称的晶形：外观常似六边形，但结构上按两组三方重复排列。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(crystallography/mineralogy) Having **ditrigonal symmetry**—a six-sided (hexagonal-looking) form where the faces or edges are arranged in two repeating sets of three, giving a “double trigonal” pattern.","zh":"（晶体学/矿物学）具有**双三方对称**的：外形看似六边形，但面或棱按两组三个重复排列，呈“两个三方”交替的图样。"},"examples":[{"en":"Quartz crystals can show a **ditrigonal** outline on some faces under certain growth conditions.","zh":"石英晶体在某些生长条件下，某些晶面可能呈现**双三方**的外轮廓。"},{"en":"The diagram labels the form as a **ditrigonal dipyramid** rather than a simple hexagonal dipyramid.","zh":"图示把该晶形标注为**双三方双锥**，而不是简单的六方双锥。"}]}],"synonyms":["ditrigonal (crystal symmetry term)","trigonal (related symmetry family)","hexagonal-looking (informal description)"],"phonetic":"/daɪˈtrɪɡənəl/","extraExplanation":["“di-”表示“两/双”，“trigonal”表示“三方/三角（对称）”。因此 ditrigonal 直译为“**双三方**”。","它常用于晶体形态学（如 *ditrigonal dipyramid* 双三方双锥、*ditrigonal prism* 双三方棱柱）。外观可能近似六方，但严格对称性与“纯六方（hexagonal）”并不完全相同。","如果你是在读矿物学或晶体学资料，ditrigonal 往往用于描述“面数/面组的排列方式”和“对称操作”，而不是日常几何里的普通“六边形”。"]}
{"word":"ditrigonally","summary":{"en":"“Ditrigonally” means “with ditrigonal (modified trigonal) symmetry,” mainly used in crystallography and mineralogy.","zh":"“ditrigonally”指“以二三角（改型三方）对称的方式”，主要用于晶体学与矿物学语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that has ditrigonal symmetry (a crystal form that is basically trigonal but with each side of the triangle split into two, giving a slightly six-sided outline).","zh":"以“二三角（ditrigonal）对称”的方式；指一种基本为三方对称、但每个三角形边被“分成两段”，外形常呈轻微六边形轮廓的晶体/形态特征。"},"examples":[{"en":"Under the microscope, the crystal appears ditrigonally etched rather than perfectly hexagonal.","zh":"在显微镜下，这个晶体的蚀刻纹理呈二三角式，而不是完美的六边形。"},{"en":"The surface grows ditrigonally when impurities disrupt the usual symmetry.","zh":"当杂质扰乱常见对称性时，表面会以二三角式的方式生长。"}]}],"synonyms":["with ditrigonal symmetry","in a ditrigonal manner"],"phonetic":"/daɪˈtrɪɡənəli/","extraExplanation":["“ditrigonal(二三角)”常见于晶体学/矿物学描述，尤其是石英（quartz）的晶面、蚀刻坑（etch pits）或生长纹理。它不是日常英语词汇，多用于专业论文、图谱说明或实验记录。","理解小提示：tri- 表示“三”，而 di- 可理解为“每一边出现两段/成对的特征”，因此整体看起来像“三方对称 + 轻微六边形化”的效果。"]}
{"word":"Ditrocha","summary":{"en":"Ditrocha (more commonly “ditrochee”) is a poetic metrical unit made of two trochees.","zh":"Ditrocha（更常见写法为 ditrochee）指诗歌格律中由两个扬抑格组成的节奏单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Poetry) a metrical foot (or small metrical unit) made of two trochees: / ˈ— ˘ | — ˘ / (four syllables total, with stress on the 1st and 3rd syllables).","zh":"（诗歌）双扬抑格：由两个“扬抑格（trochee）”组成的音步/节奏单位，共四个音节，第1和第3个音节重读。"},"examples":[{"en":"In scansion, some lines can be divided into a ditrochee plus other feet.","zh":"在诗行格律分析中，有些诗行可以切分为一个双扬抑格再加上其他音步。"},{"en":"The word “merry-go-round” is often scanned like a ditrochee (MER-ry | GO-round).","zh":"“merry-go-round”常可按双扬抑格来划分（MER-ry | GO-round）。"}]}],"synonyms":["ditrochee","ditrochaic foot"],"phonetic":"/daɪˈtroʊkiː/","extraExplanation":["“Ditrocha”较少见，更常见的形式是“ditrochee”（名词）或“ditrochaic”（形容词，如 ditrochaic meter）。","词源上，“di-”表示“两个”，“trochee”来自希腊语，指一种“重读+轻读”的节奏单位。文学研究与诗歌格律分析（scansion）里更可能遇到这个词。"]}
{"word":"ditrocha","summary":{"en":"Ditrocha (more commonly spelled ditrochee) is a poetry term for a metrical unit of two trochees: / u / u.","zh":"Ditrocha（更常写作 ditrochee）是诗歌格律术语，指由两个扬抑格组成的节奏单位：/ u / u。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Poetry) a metrical unit made of two trochees in a row: stressed–unstressed–stressed–unstressed ( / u / u ).","zh":"（诗歌格律）“双扬抑格”（两个扬抑格连在一起）：重读–轻读–重读–轻读（/ u / u）。"},"examples":[{"en":"In some English verse, a line may open with a ditrochee to create a strong, marching rhythm.","zh":"在一些英文诗里，诗行可能以“双扬抑格”开头，营造有力、行进感的节奏。"},{"en":"Try clapping the pattern / u / u to feel how a ditrochee moves.","zh":"试着按 / u / u 的节奏拍手，感受“双扬抑格”的律动。"}]}],"synonyms":["ditrochee","double trochee"],"phonetic":"/daɪˈtroʊki/","extraExplanation":["“ditrocha”在英语里非常少见，常见的标准写法是 **ditrochee**，也可以说 **double trochee**（双扬抑格）。如果你是在读诗歌格律（meter / scansion）的资料，很可能就是这个术语的拼写变体或误拼。","扬抑格（trochee）的基本节奏是“重-轻”（/ u），例如（仅作节奏示意）**TA-ble**、**GAR-den** 这类重音在前的两音节词常被用来帮助理解。把两个扬抑格连起来就是 / u / u。"]}
{"word":"ditrochean","summary":{"en":"Ditrochean describes a poetic rhythm made of two trochees (stressed–unstressed, twice).","zh":"Ditrochean 指由两个扬抑格（重读+轻读，重复两次）构成的诗歌节奏。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(In poetry) having or made of two trochees; a rhythm pattern with two stressed–unstressed beats in a row ( / ˘ | / ˘ ).","zh":"（诗歌格律）由两个“扬抑格”（重读+轻读）组成的；具有连续两个重—轻节奏的（/ ˘ | / ˘）。"},"examples":[{"en":"The line begins with a ditrochean rhythm: “Garden shadows…”","zh":"这一行以二扬抑格的节奏开头：“Garden shadows…”（花园的影子……）"},{"en":"In some songs, a ditrochean beat can sound like a steady marching pulse.","zh":"在一些歌曲里，二扬抑格的节拍听起来像稳定的行进脉搏。"}]}],"synonyms":["ditrochaic","trochaic (in rhythm)"],"phonetic":"/ˌdaɪˈtroʊkiən/","extraExplanation":["“ditrochean”主要用于英语诗歌格律分析，比较书面/学术。它来自 di-（“两个”）+ trochee（扬抑格：重读在前、轻读在后）。","扬抑格（trochee）和抑扬格（iamb：轻读+重读）常被对比：trochee 更像“DUM-da”，iamb 更像“da-DUM”。二扬抑格就是连续两次“DUM-da”。"]}
{"word":"ditrochee","summary":{"en":"A poetic meter unit: two trochees in a row (/ u / u).","zh":"诗歌格律中的音步：两个扬抑格连在一起（/ 轻 / 轻）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a metrical foot in poetry made of two trochees (four syllables total), usually stressed–unstressed / stressed–unstressed ( / u / u ).","zh":"（诗歌格律）二扬抑格：由两个扬抑格组成的音步，共四个音节，常见节奏为“重—轻 / 重—轻”（/ u / u）。"},"examples":[{"en":"In some English poems, a line may use a ditrochee to create a strong, marching rhythm.","zh":"在一些英文诗中，一行可能用二扬抑格来营造强烈、行进般的节奏感。"},{"en":"The phrase “Never, never” can be read as a ditrochee when spoken with stress on the first syllable of each word.","zh":"短语“Never, never”如果每个词的第一个音节都重读，可以读作一个二扬抑格。"}]}],"synonyms":["double trochee","trochaic dipody"],"phonetic":"/daɪˈtroʊki/","extraExplanation":["这是一个比较少见、偏专业的格律术语，常用于诗歌分析（prosody）。理解它的关键是先认识“trochee（扬抑格）= 重读 + 轻读”，而“ditrochee（二扬抑格）”就是把两个扬抑格连在一起。","在实际英文诗里，节奏不一定严格完全符合 /u/u，因为自然语音会有轻微变化；分析时通常看“主要重音”的位置。","相关术语：iamb（抑扬格，u/），spondee（扬扬格，//），dactyl（扬抑抑，/uu）。"]}
{"word":"ditrochous","summary":{"en":"Ditrochous describes a poetic rhythm made of two trochees (stressed–unstressed, twice).","zh":"ditrochous 指由两个扬抑格（重读-轻读，重复两次）构成的诗歌节奏。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Poetry, meter) Made up of two trochees (two “stressed–unstressed” feet), often referring to a short line of verse.","zh":"（诗歌/格律）由两个“扬抑格”（重读-轻读音步）组成；常用来形容由两组重读-轻读节奏构成的短诗行。"},"examples":[{"en":"The chant sounds ditrochous: DUM-da DUM-da.","zh":"这句吟唱听起来是二扬抑格：重-轻 重-轻。"},{"en":"In some children’s rhymes, you can find simple ditrochous lines.","zh":"在一些儿歌/童谣里，你能找到简单的二扬抑格诗行。"},{"en":"The poet used a ditrochous beat to keep the rhythm brisk and catchy.","zh":"诗人用二扬抑格的节拍，让节奏轻快、朗朗上口。"}]}],"synonyms":["trochaic dimeter","ditrochaic"],"phonetic":"/daɪˈtroʊkəs/","extraExplanation":["“trochee（扬抑格）”指一个音步里先重读后轻读（DUM-da）。ditrochous 就是“两组 trochee”，节奏可写成：DUM-da | DUM-da。","在英语格律中，这种结构有时也会与“trochaic dimeter（扬抑二音步）”联系在一起；不同书籍的术语用法可能略有差别，但核心都是“两段扬抑节奏”。"]}
{"word":"ditroite","summary":{"en":"Detroit most commonly refers to the U.S. city in Michigan; rarely, it can mean a “strait” in older English.","zh":"Detroit最常指美国密歇根州的城市；在较旧英语中极少也可指“海峡”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Detroit: a major city in the U.S. state of Michigan, known historically as a center of the American auto industry (e.g., Ford, General Motors).","zh":"底特律：美国密歇根州的重要城市，历史上以美国汽车工业中心而闻名（如福特、通用汽车）。"},"examples":[{"en":"Detroit is located near the U.S.–Canada border, across the river from Windsor, Ontario.","zh":"底特律靠近美加边境，隔着河与加拿大安大略省的温莎相望。"},{"en":"Motown music became famous worldwide and is closely connected to Detroit’s cultural history.","zh":"摩城（Motown）音乐闻名全球，与底特律的文化历史密切相关。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a narrow passage of water connecting two larger bodies of water; a strait.","zh":"（较少见）连接两片较大水域的狭窄水道；海峡。"},"examples":[{"en":"The ship entered the detroit that linked the bay to the open sea.","zh":"那艘船驶入连接海湾与外海的海峡。"},{"en":"In older texts, “detroit” can appear as a common noun meaning “strait.”","zh":"在较老的文本中，“detroit”有时会作为普通名词出现，意思是“海峡”。"}]}],"synonyms":["Motor City (nickname)","Motown (nickname)","strait (for the rare common-noun sense)"],"phonetic":"/dɪˈtrɔɪt/","extraExplanation":["你输入的“ditroite”看起来像是“Detroit”的拼写误差（正确拼法：Detroit）。","“Detroit”这个地名来自法语“détroit”（意为“海峡”），因为当地与水道地理环境有关（例如底特律河一带）。","在英语里，“Detroit”通常指城市；作为普通名词表示“海峡”的用法很少见，多出现在较旧或特定体裁的英语文本中。"]}
{"word":"dits","summary":{"en":"“dits” is the plural of “dit,” meaning either brief news/info notes (informal) or short “dot” sounds in Morse code.","zh":"“dits”是“dit”的复数：可指（非正式）新闻/信息短条，也可指摩尔斯电码中的短音（点）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) short pieces of information or brief news notes, especially in journalism.","zh":"（非正式）简短的信息/新闻小条，尤指新闻写作中的短讯、简报。"},"examples":[{"en":"The reporter sent a few dits to the editor before the deadline.","zh":"记者在截稿前给编辑发了几条短讯。"},{"en":"The magazine’s back pages are filled with celebrity dits.","zh":"那本杂志的后几页满是名人小道短讯。"}]},{"partOfSpeech":"n.","definition":{"en":"the plural of “dit”: a short signal sound (a “dot”) in Morse code.","zh":"“dit”的复数：摩尔斯电码里的短音（相当于“点”/dot）。"},"examples":[{"en":"In Morse code, the letter E is one dit.","zh":"在摩尔斯电码中，字母E是一个短音（dit）。"},{"en":"Practice the dits and dahs slowly at first.","zh":"一开始先慢慢练习短音（dits）和长音（dahs）。"}]}],"synonyms":["briefs","news bites","snippets","items"],"phonetic":"/dɪts/","extraExplanation":["“dit”在英语里常见于两种语境：\n1）新闻/编辑圈：指很短的新闻条目或信息片段（类似“短讯”“简报”）。\n2）摩尔斯电码：用“dit”表示短音（点），用“dah”表示长音（划）。\n口语里看到“dits”通常是“dit”的复数，也可能是特定圈内用法。"]}
{"word":"ditsier","summary":{"en":"“Ditsier” means “more ditzy,” describing someone as even more scatterbrained or silly.","zh":"“ditsier”表示“更ditzy（更迷糊/更傻气）”，形容人更健忘、走神或不太靠谱（多为口语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"comparative form of “ditzy”: more silly, scatterbrained, or not paying attention (often used humorously, but it can sound insulting).","zh":"“ditzy”的比较级：更傻气的、更迷糊健忘/不专心的（常带玩笑语气，但也可能显得冒犯）。"},"examples":[{"en":"I’m even ditzier before my morning coffee—I keep forgetting my keys.","zh":"我早上没喝咖啡前更迷糊——老是忘带钥匙。"},{"en":"That question wasn’t ditzier; it was actually thoughtful.","zh":"那个问题一点也不更傻，相反还挺有想法。"}]}],"synonyms":["more scatterbrained","more absent-minded","more airheaded","more spacey","more distracted"],"phonetic":"/ˈdɪtsiər/","extraExplanation":["“Ditsier”通常是把形容词“ditzy”变成比较级（ditzy → ditzier），表示“更……”。属于非正式口语用法。","这个词有时带贬义，尤其用来形容女性时可能显得刻薄或带刻板印象；在正式场合或不熟的人面前建议换成更中性的说法，如“more absent-minded（更健忘/更走神）”“more distracted（更分心）”。"]}
{"word":"ditsiest","summary":{"en":"“Ditsiest” means “the most ditsy”—the most scatterbrained or silly (informal).","zh":"“ditsiest”表示“最迷糊/最傻乎乎的”，口语用法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Superlative form of “ditsy”: the most silly, scatterbrained, or absent-minded (often used about a person, especially in casual speech).","zh":"“ditsy（迷糊的/傻乎乎的）”的最高级：最迷糊的、最健忘散漫的（多形容人，口语用法）。"},"examples":[{"en":"Of all the characters in the show, she’s the ditsiest, but she has a good heart.","zh":"在这部剧的所有角色里，她最迷糊，但人很善良。"},{"en":"I felt like the ditsiest person in the room when I forgot my own phone number.","zh":"我忘了自己的手机号，感觉自己成了屋里最迷糊的人。"}]}],"synonyms":["most scatterbrained","most absent-minded","most forgetful","silliest"],"phonetic":"ˈdɪtsiɪst","extraExplanation":["“ditsy / ditsiest”语气偏口语、带一点贬义或调侃，容易显得不尊重；在正式场合或对不熟的人慎用。","常见搭配：feel/seem/look ditsy（感觉/显得很迷糊）。也可用更中性的说法：forgetful（健忘的）、absent-minded（心不在焉的）、scatterbrained（注意力不集中的）。","词形：ditsy（原级）→ ditsier（比较级）→ ditsiest（最高级）。"]}
{"word":"ditsy","summary":{"en":"Ditsy means pleasantly silly or absent-minded—often forgetting small things or not paying attention.","zh":"ditsy 指（人）有点傻气、迷糊健忘，通常是轻微、口语化的说法。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Silly and scatterbrained in a light, harmless way; often forgetting things or not paying attention.","zh":"（多指人）傻乎乎、迷迷糊糊的；有点健忘、注意力不集中（通常带轻微、无伤大雅的意味）。"},"examples":[{"en":"I’m being a bit ditsy today—I left my keys in the fridge.","zh":"我今天有点迷糊——竟然把钥匙放进冰箱了。"},{"en":"He’s kind and funny, but sometimes he can be a little ditsy.","zh":"他很善良也很幽默，但有时会有点迷迷糊糊的。"}]}],"synonyms":["absent-minded","scatterbrained","forgetful","spacey","giddy"],"phonetic":"/ˈdɪtsi/","extraExplanation":["“ditsy”多用于口语，语气可能是开玩笑、亲昵，也可能带一点轻微的贬义（暗示不够认真或不够聪明）。对陌生人或正式场合使用可能显得不礼貌。","这个词在英语里常（但不应当）用来刻板地形容女性。更中性、更礼貌的替代说法有：“absent-minded（心不在焉）”“forgetful（健忘）”“scatterbrained（注意力分散）”。"]}
{"word":"ditt","summary":{"en":"“ditt.” is an informal abbreviation meaning “same as above.”","zh":"“ditt.”是非正式缩写，表示“同上”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Abbrev., informal) Used in lists or notes to mean “the same as above” or “same as previously mentioned.”","zh":"（缩写，非正式）在清单或笔记中表示“同上”“同前”“同样”。"},"examples":[{"en":"Address: 12 Oak St. / Billing address: ditt. (same as above).","zh":"地址：橡树街12号／账单地址：ditt.（同上）。"},{"en":"Monday: math homework; Tuesday: ditt.","zh":"周一：数学作业；周二：同上。"}]}],"synonyms":["ditto","same as above","same as before"],"phonetic":"/ˈdɪtoʊ/","extraExplanation":["“ditt.”常见于手写记录、表格或老式办公文书里，是“ditto”的缩写，用来避免重复书写。正式写作中更常用“same as above / same as before”。","“ditto”来自意大利语，进一步可追溯到拉丁语词根，含义与“说过的、上述的”相关。"]}
{"word":"dittamy","summary":{"en":"Dittamy (also spelled dittany) is an aromatic herb—especially the Cretan plant used in traditional medicine; the name can also refer to other plants in different places.","zh":"dittamy（亦作 dittany）指一种芳香草本植物，尤指克里特岛的药用香草；但在不同地区也可能指其他植物，因此需注意歧义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fragrant herb (Origanum dictamnus), native to Crete, traditionally used in folk medicine and sometimes as a flavoring","zh":"（克里特）白鲜香草；一种芳香草本植物（学名 Origanum dictamnus），传统上用于民间药用，有时也用于调味"},"examples":[{"en":"In Greek tradition, Cretan dittamy was gathered from rocky cliffs and valued as a healing herb.","zh":"在希腊传统中，克里特白鲜香草常从岩壁上采集，被视为疗伤草药。"},{"en":"Some herbal teas list dittamy as an ingredient for its aromatic taste.","zh":"有些花草茶会把白鲜香草列为配料，因其香气风味。"}]},{"partOfSpeech":"n.","definition":{"en":"another plant sometimes called “dittany,” especially Dictamnus albus (also known as burning bush)","zh":"另一个有时也被称为“dittany（白鲜）”的植物，尤指白鲜属植物 Dictamnus albus（亦称“燃烧荆棘/火焰灌木”）"},"examples":[{"en":"Be careful with common names: “dittany” can refer to different species in different regions.","zh":"要注意俗名差异：在不同地区，“dittany/白鲜”可能指不同的植物。"},{"en":"The garden label used “dittany,” but the plant was actually Dictamnus albus.","zh":"花园标签写着“dittany”，但那株植物其实是 Dictamnus albus。"}]}],"synonyms":["dittany","Cretan dittany","dittany of Crete","Origanum dictamnus","burning bush (for Dictamnus albus)"],"phonetic":"ˈdɪtəni","extraExplanation":["“dittamy / dittany”在英语文学里很有名的一处来源是维吉尔《埃涅阿斯纪》（Aeneid）：女神维纳斯用“克里特白鲜香草（dittany of Crete）”为埃涅阿斯疗伤，因此这个词常带有“治愈、神奇草药”的文学联想。","词形来源与“Crete（克里特）”有关：常见搭配是 dittany of Crete / Cretan dittany，用来强调指的是克里特岛那一种。日常语境中如果只是写 dittany，可能会引发物种歧义，最好配合学名或产地说明。"]}
{"word":"dittander","summary":{"en":"Dittander is an uncommon word for a pungent mustard-family herb (often pepperwort, *Lepidium*).","zh":"Dittander 是一个不常见词，指一种带辛辣气味的十字花科草本植物（常指椒草属 *Lepidium* 的 pepperwort）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a pungent-smelling herb in the mustard family (especially **pepperwort**, genus *Lepidium*), once used in cooking and traditional remedies","zh":"一种带辛辣气味的十字花科草本植物（常指胡椒草/椒草属 *Lepidium*，英文也常叫 pepperwort），过去曾用于烹饪与民间疗法"},"examples":[{"en":"In old herbals, **dittander** was described as a sharp-tasting plant used to flavor food.","zh":"在一些古老的本草书中，dittander 被描述为一种味道辛辣、可用来调味的植物。"},{"en":"The riverbank was covered with wild **dittander** and other mustard-family plants.","zh":"河岸上长满了野生的 dittander 以及其他十字花科植物。"}]}],"synonyms":["pepperwort","perennial pepperweed","Lepidium (genus)"],"phonetic":"/ˈdɪtændər/","extraExplanation":["这个词在现代英语里很少见，主要出现在植物学、老菜谱、草药书或文学描写中。","不同地区的英语使用者可能把不同的 *Lepidium*（椒草属）植物叫作 dittander，因此更准确的识别往往需要具体的拉丁学名或当地常见名（如 pepperwort / perennial pepperweed）。"]}
{"word":"dittanies","summary":{"en":"“Dittanies” is the plural of “dittany,” an aromatic medicinal herb name (often Cretan dittany).","zh":"“Dittanies”是“dittany”的复数，指一种（或一类）芳香的传统药草名（常指克里特白藓）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of dittany: a name used for certain aromatic plants traditionally valued in herbal medicine, especially Cretan dittany (Origanum dictamnus) and sometimes “burning bush” (Dictamnus albus).","zh":"dittany 的复数：指某些芳香植物的统称，传统上用于草药/药用，尤指“克里特白藓”（Origanum dictamnus），有时也指“白鲜/燃烧灌木”（Dictamnus albus）。"},"examples":[{"en":"In the old herb book, dittanies were listed as plants used for healing.","zh":"在那本古老的药草书里，dittanies 被列为用于疗愈的植物。"},{"en":"The tea was flavored with dried dittanies and other mountain herbs.","zh":"这杯茶用晒干的 dittanies 和其他山地香草调味。"}]}],"synonyms":["dittany","Cretan dittany","herb","medicinal herb"],"phonetic":"/ˈdɪtəni/","extraExplanation":["“dittany”在英语里不是单一物种的固定称呼：最常见、最有名的是克里特岛的“Cretan dittany”（Origanum dictamnus，牛至属的一种芳香草本）；但在一些语境里也可能指“Dictamnus albus”（常被称为白鲜或“burning bush”，其挥发油在炎热条件下可能被点燃，因此得名）。读到该词时，最好结合文本背景判断具体所指。","文学/古典背景：在维吉尔《埃涅阿斯纪》（Aeneid）中，女神维纳斯用“dittany”来医治埃涅阿斯的伤口；因此该词在文学里常带有“神奇疗愈、古老药草”的联想。"]}
{"word":"dittany","summary":{"en":"Dittany is a fragrant mint-family herb, especially Cretan dittany, known from traditional medicine and classical literature as a healing plant.","zh":"Dittany 指一种芳香的薄荷科草本（尤指克里特白鲜/克里特牛至），在传统草药与古典文学中常与“疗愈”联系在一起。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a fragrant plant in the mint family, traditionally used in herbal medicine; it can refer to either \"Cretan dittany\" (Origanum dictamnus) or \"false dittany\" (a related herb used similarly).","zh":"一种带香味的薄荷科植物，传统上用于草药/民间疗法；既可指“克里特白鲜/克里特牛至”（Origanum dictamnus），也可泛指外观或用途相近、被称作“假白鲜”的草本植物。"},"examples":[{"en":"The tea contained dittany, which gave it a warm, herbal smell.","zh":"这款茶里加了白鲜草（dittany），闻起来有温暖的草本香气。"},{"en":"In old herbals, dittany was described as a plant used to support healing.","zh":"在早期的草药书里，白鲜草常被描述为用来帮助恢复与疗养的植物。"}]}],"synonyms":["Cretan dittany","wild marjoram (related)","origanum (genus term)"],"phonetic":"/ˈdɪtəni/","extraExplanation":["“dittany”在英语里最常见的文化背景来自古希腊与克里特岛：Cretan dittany（克里特白鲜/克里特牛至）在传统传说与草药记载中常被赋予“疗愈”的形象。","文学与经典出处：在维吉尔《埃涅阿斯纪》（Aeneid）中，女神用dittany治疗埃涅阿斯的伤口；因此它在英文文学里有时会带一点“神奇药草/治愈之草”的联想。","注意辨析：不同地区对“dittany”的指代可能不完全一致（有时也会指另一种被称为“false dittany”的植物）。阅读或购买草药产品时，最好查看学名以免混淆。"]}
{"word":"dittay","summary":{"en":"“Dittay” is not standard English; it’s usually a misspelling/phonetic spelling of “ditto,” meaning “same as above / me too.”","zh":"“dittay”不是标准英语，通常是“ditto”的误拼或拟音写法，表示“同上/我也是/一样”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard/rare) A misspelling or phonetic spelling of “ditto,” used to mean “the same as what was just said/written.”","zh":"（非标准/少见）常被当作“ditto”的拼写或拟音写法，表示“同上/我也是/和刚才一样”。"},"examples":[{"en":"A: I’m tired.  B: Dittay (= ditto).","zh":"A：我累了。B：Dittay（= ditto，我也是/同感）。"},{"en":"In a list, some people write “dittay,” but “ditto” is the correct form.","zh":"在清单里有人写“dittay”，但正确写法是“ditto”。"}]},{"partOfSpeech":"other","definition":{"en":"(Meaning of “ditto”) Used to avoid repeating the same word(s), especially in lists, forms, or casual replies.","zh":"（“ditto”的含义）用于避免重复相同内容，常见于清单、表格或随口回应中。"},"examples":[{"en":"Name: Alex.  Address: 10 Pine St.  Phone: ditto (same as above).","zh":"姓名：Alex。地址：松树街10号。电话：ditto（同上）。"},{"en":"A: I love that movie.  B: Ditto!","zh":"A：我很喜欢那部电影。B：我也是！（Ditto!）"},{"en":"She ordered tea, and I ordered ditto.","zh":"她点了茶，我也点了一样的。"}]}],"synonyms":["ditto","same","same here","me too"],"phonetic":"ˈdɪtoʊ","extraExplanation":["“ditto”在英语里更常见、更正式正确；“dittay”不是标准拼写，写作、考试、工作邮件中建议避免。","口语里表示“我也是/同感”时，较自然的替代说法还有：“Same here.” “Me too.” “I feel the same.”"]}
{"word":"ditted","summary":{"en":"“Ditted” is a rare/nonstandard form meaning “said/repeated” or “sang” in an old-fashioned way; in modern writing it’s often a typo for another word.","zh":"“ditted”是罕见/非标准用法，可指“重复说/唱”，但现代写作中常是误拼（如 edited、dotted、dittoed）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"A rare or nonstandard past tense/past participle of “dit” (not commonly used in modern English). It can mean “said/repeated (a short phrase)” or “sang/chanted (a short simple tune).”","zh":"“dit”的一种罕见或非标准过去式/过去分词（现代英语中几乎不用）。可表示“说了/重复了（短语）”或“唱了/哼唱了（简单短曲）”。"},"examples":[{"en":"He ditted the same line again and again under his breath.","zh":"他小声一遍又一遍地重复那一句话。"},{"en":"The children ditted a simple tune as they walked.","zh":"孩子们一边走一边哼唱一段简单的曲子。"}]}],"synonyms":["repeated","said","chanted"],"phonetic":"/ˈdɪtɪd/","extraExplanation":["“ditted”在现代英语里非常少见，很多时候是拼写错误或输入法误打。你可能想写的是：\n1) edited（编辑过的）\n2) dotted（点缀/标点过的，比如 dotted line 虚线）\n3) dittoed（照搬/同样写了）\n如果你把原句发我，我可以帮你判断最合适的词。"]}
{"word":"Ditter","summary":{"en":"Ditter is a rare/dialect word meaning “to tremble or shiver,” and sometimes “a nervous, shaky state.” In most modern contexts, you’ll more often see dither.","zh":"Ditter 是较少见的方言用法，意思是“发抖、颤抖”，有时也指“紧张慌乱的状态”。现代语境中更常见的是 dither。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Dialect/rare) to tremble or shiver; to shake slightly, often from cold or fear.","zh":"（方言/少见）发抖；颤抖（常因寒冷或害怕而轻微抖动）。"},"examples":[{"en":"In the icy wind, the child began to ditter.","zh":"在刺骨的风里，孩子开始发抖。"},{"en":"She dittered with nerves before speaking in public.","zh":"她在公开发言前紧张得发抖。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare) a nervous, shaky state; confusion caused by worry.","zh":"（少见）紧张发慌的状态；因担心而产生的慌乱。"},"examples":[{"en":"Don’t get into a ditter—take a breath and try again.","zh":"别慌成一团——深呼吸，再试一次。"}]}],"synonyms":["tremble","shiver","shake","quiver"],"phonetic":"ˈdɪtər","extraExplanation":["“ditter”在现代标准英语里非常少见，更常见、也更标准的拼写通常是“dither”。“dither”既可指“犹豫不决”，也可指“发抖”。如果你是在书里或影视字幕里看到“ditter”，它很可能是方言拼写或作者为了口语/地域感而采用的变体。"]}
{"word":"Dittersdorf","summary":{"en":"Dittersdorf is best known as the name of Karl Ditters von Dittersdorf, an Austrian Classical-era composer; it can also be a surname.","zh":"Dittersdorf最常指奥地利古典时期作曲家卡尔·迪特斯·冯·迪特斯多夫；也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper name) Karl Ditters von Dittersdorf (1739–1799), an Austrian composer and violinist of the Classical period.","zh":"（专有名词）卡尔·迪特斯·冯·迪特斯多夫（1739–1799），奥地利古典时期的作曲家与小提琴家。"},"examples":[{"en":"We listened to a symphony by Dittersdorf in our Classical music unit.","zh":"在古典音乐单元里，我们听了一首迪特斯多夫的交响曲。"},{"en":"Dittersdorf is less famous than Mozart, but his music was widely performed in his time.","zh":"迪特斯多夫不如莫扎特有名，但在他那个时代作品演出非常广泛。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname; someone with the family name “Dittersdorf.”","zh":"姓氏：姓“Dittersdorf（迪特斯多夫）”的人。"},"examples":[{"en":"Professor Dittersdorf will give a talk on eighteenth-century opera.","zh":"迪特斯多夫教授将做一场关于18世纪歌剧的讲座。"}]}],"synonyms":["Karl Ditters von Dittersdorf"],"phonetic":"/ˈdɪtərzˌdɔrf/","extraExplanation":["“Dittersdorf”常指作曲家全名 Karl Ditters von Dittersdorf，其中 “von” 表示贵族或出身地相关的称号；在英语资料里有时会简写为 Dittersdorf。","他属于“古典主义时期”（与海顿、莫扎特同一大时代），以交响曲、歌剧与协奏曲等作品著称；学习音乐史时常作为“同时代但较少被大众记住的作曲家”来对照理解。"]}
{"word":"dittied","summary":{"en":"“Dittied” is usually a misspelling of “dirtied,” meaning “made dirty; became dirty.”","zh":"“dittied”通常是“dirtied”的误拼，意思是“弄脏了/变脏了”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense / past participle of “dirty”: made something unclean or messy; became unclean.","zh":"“dirty”的过去式/过去分词：把……弄脏；变脏。"},"examples":[{"en":"The kids dirtied (sometimes misspelled “dittied”) their shoes in the mud.","zh":"孩子们在泥里把鞋子弄脏了（有时会误拼成“dittied”）。"},{"en":"His shirt was dirtied by coffee spills.","zh":"他的衬衫被咖啡洒出来弄脏了。"}]}],"synonyms":["soiled","stained","messed up","grimed","smudged"],"phonetic":"/ˈdɝtid/","extraExplanation":["“dittied”在现代英语中非常少见，日常写作里几乎总是拼作“dirtied”（dirty 的过去式/过去分词）。如果你是在作业、邮件或文章里看到“dittied”，多半是拼写错误。","英语里“dirty”的规则变化是：dirty → dirties → dirtied → dirtying（y 变 i 再加 -ed）。"]}
{"word":"ditties","summary":{"en":"“Ditties” means short, simple songs.","zh":"“ditties”指短小、简单的歌曲（小曲）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"short, simple songs (often light, cheerful, or informal); plural of “ditty.”","zh":"小曲；短歌（通常轻快、非正式）；“ditty”的复数。"},"examples":[{"en":"The old radio played cheerful ditties from the 1950s.","zh":"那台老收音机播放着20世纪50年代的轻快小曲。"},{"en":"She hummed a few silly ditties while cooking dinner.","zh":"她做晚饭时哼了几段滑稽的小调。"},{"en":"Street musicians often use familiar ditties to attract a crowd.","zh":"街头音乐人常用大家熟悉的小曲来吸引人群。"}]}],"synonyms":["short songs","tunes","little songs","songs","melodies"],"phonetic":"/ˈdɪti/","extraExplanation":["“ditty”常带有“轻松、随口哼唱、内容不复杂”的感觉，有时也会略带俏皮或不太严肃的语气。它比“song”更强调短小、简单。","词源上与古法语/中古英语中表示“说、唱”的词有关，后来逐渐固定为“短小的歌”。"]}
{"word":"ditting","summary":{"en":"“Ditting” is not standard English; it’s usually a misspelling, commonly of “sitting” or “ditching.”","zh":"“ditting” 不是标准英语，通常是拼写错误，常见目标词是 “sitting” 或 “ditching”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most often a misspelling or typo (the intended word depends on context).","zh":"不是标准英语单词；通常是拼写错误（具体想表达哪个词要看上下文）。"},"examples":[{"en":"“Ditting” isn’t a common English word—did you mean “sitting” or “ditching”?","zh":"“ditting” 不是常见英语单词——你想写的是 “sitting（坐着）” 还是 “ditching（抛弃/甩掉）” 吗？"},{"en":"If you share the full sentence, I can tell you the correct spelling and meaning.","zh":"如果你把完整句子发出来，我可以帮你判断正确拼写和意思。"}]}],"phonetic":"/ˈdɪtɪŋ/","extraExplanation":["最常见的可能：\n- 你想写 **sitting**（坐着；/ˈsɪtɪŋ/）——比如 *I’m sitting here.*\n- 你想写 **ditching**（甩掉/抛弃；也可指“挖沟”；/ˈdɪtʃɪŋ/）——比如 *He’s ditching school.*\n\n把你看到或想写的原句贴出来，我就能精确判断。"]}
{"word":"Dittman","summary":{"en":"“Dittman” is mainly used as a surname (a last name).","zh":"“Dittman”主要用作姓氏（人的姓）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A family name (surname), most often of German origin. It refers to a person’s last name rather than a common English vocabulary word.","zh":"一个姓氏（家族姓），多见于德语背景。它表示人的“姓”，不是常见的英语词汇。"},"examples":[{"en":"Dr. Dittman will lead today’s seminar.","zh":"Dittman 博士将主持今天的研讨会。"},{"en":"My neighbor’s last name is Dittman.","zh":"我邻居的姓是 Dittman。"}]}],"synonyms":["Dittmann (variant spelling)"],"phonetic":"/ˈdɪtmən/","extraExplanation":["“Dittman / Dittmann”多被认为是德语姓氏的英语拼写形式之一；在英语语境中通常只当作专有名词使用（首字母大写）。","如果你在文章或字幕里看到“Dittman”，它通常指某个人、作者、角色或品牌名称，而不是一个可查到固定词义的普通单词。"]}
{"word":"Dittmer","summary":{"en":"Dittmer is most commonly used as a German-origin surname.","zh":"Dittmer最常见的用法是一个源自德语地区的姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), originally from German-speaking regions.","zh":"一个姓氏（家族姓），源自德语地区。"},"examples":[{"en":"Ms. Dittmer will present the report at today’s meeting.","zh":"迪特默女士将在今天的会议上汇报。"},{"en":"I found an article written by Dittmer in the university database.","zh":"我在大学数据库里找到一篇由迪特默撰写的文章。"}]}],"synonyms":["(surname)"],"phonetic":"/ˈdɪtmər/","extraExplanation":["“Dittmer”通常被视为德语姓氏，在英语语境中多用于指代个人或家族姓名，而不是一个常见的普通词汇。","英语里谈到姓氏时，常用表达包括：the Dittmer family（迪特默一家）、Mr./Ms. Dittmer（迪特默先生/女士）。"]}
{"word":"ditto","summary":{"en":"“Ditto” means “the same,” used to show you agree or to avoid repeating information.","zh":"“Ditto”表示“同样/同上”，可用于表达“我也是/同感”，或在书写中避免重复。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"the same as what was said before; used to avoid repeating something","zh":"同上；同前（用于避免重复）"},"examples":[{"en":"A: I’m tired.  B: Ditto.","zh":"甲：我累了。乙：我也是（同感）。"},{"en":"On the form, she wrote “ditto” instead of repeating her address.","zh":"在表格上，她写了“ditto”来避免重复填写地址。"}]},{"partOfSpeech":"n.","definition":{"en":"something repeated from an earlier item, especially in writing or lists","zh":"重复项；（尤指清单或书写中的）“同上”内容"},"examples":[{"en":"The next three entries were all dittos.","zh":"接下来的三项都是“同上”。"},{"en":"Please don’t use dittos in official documents—write the full information.","zh":"正式文件里请不要用“同上”，要把信息完整写出来。"}]}],"synonyms":["same here","me too","likewise","the same"],"phonetic":"/ˈdɪtoʊ/","extraExplanation":["“ditto”常见于口语对话，表示“我也是/同感”。语气通常较轻松，也可以带一点幽默。","在较正式的写作或表格中，有时用来表示“同上”，但许多正式场合更推荐把信息写全，避免歧义。","来源上，它来自意大利语 ditto，原意接近“已说过的/同上”。"]}
{"word":"dittoed","summary":{"en":"“Dittoed” means “said the same thing” or “copied exactly,” as the past tense of “ditto.”","zh":"“dittoed”是“ditto”的过去式，表示“我也一样/同上（附和）”或“照抄/复制”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense of “ditto”) said or wrote the same thing as someone else; repeated or echoed an earlier statement.","zh":"（“ditto”的过去式）表示“同上/我也一样”；重复或附和别人刚说/刚写的话。"},"examples":[{"en":"“I’m exhausted.” “Dittoed,” he said, meaning he felt the same way.","zh":"“我累坏了。”他回答“dittoed”，意思是他也有同感。"},{"en":"Several comments were dittoed in the meeting, so no one added new ideas.","zh":"会上好几条意见被“dittoed”（照说/附和）了，所以没人补充新想法。"}]},{"partOfSpeech":"vt.","definition":{"en":"(past tense of “ditto”) copied exactly; duplicated (often information, text, or a document).","zh":"（“ditto”的过去式）照抄；复制（常指信息、文字或文件）。"},"examples":[{"en":"She dittoed the address from the email into her notes.","zh":"她把邮件里的地址照抄到笔记上。"},{"en":"The form was dittoed for all new employees.","zh":"这份表格为所有新员工都复制了一份。"}]}],"synonyms":["echoed","repeated","seconded","agreed","copied","duplicated"],"phonetic":"/ˈdɪtoʊd/","extraExplanation":["“ditto”常见于口语，意思是“我也是/同上”。在书面场合（尤其正式写作）通常用更明确的表达，如：“I agree.” “Same here.” “Me too.”","历史上“ditto”也用于文件里表示“同上”（代替重复的词/数字）。现在在表格或正式文件中更常见的替代写法有“same as above / same”。"]}
{"word":"dittoes","summary":{"en":"“Dittoes” is the plural of “ditto,” meaning extra copies, repeated “same as above” marks, or (informally) repeated “same here” responses.","zh":"“Dittoes”是“ditto”的复数，可指额外副本/复印件、表格中表示“同上”的重复符号或条目，也可非正式指重复的“我也是/同感”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of “ditto”) additional copies of the same document or thing.","zh":"（“ditto”的复数）同一文件或物品的额外副本；复印件。"},"examples":[{"en":"Please bring three dittoes of the form for the meeting.","zh":"请带三份这份表格的副本来开会。"},{"en":"The teacher handed out dittoes of the worksheet to the class.","zh":"老师把练习单的复印件发给全班。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural of “ditto”) repeated “same as above” marks or repeated items in a list or record.","zh":"（“ditto”的复数）表示“同上/同前”的重复符号或重复条目（常见于表格、清单、账本）。"},"examples":[{"en":"The old ledger uses dittoes instead of rewriting the same address.","zh":"那本旧账本用“同上”符号代替重复写同一个地址。"},{"en":"In the table, dittoes show that the value is the same as the row above.","zh":"在表格里，“同上”符号表示该数值与上一行相同。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, from “ditto”) repeated expressions meaning “same here / me too.”","zh":"（非正式，用自“ditto”）重复说的“我也是/同感”。"},"examples":[{"en":"“I’m tired.” “Ditto.” (Sometimes people joke and say “dittoes.”)","zh":"“我好累。”“我也是。”（有时人们开玩笑也会说“dittoes”。)"}]}],"synonyms":["copies","duplicates","repeats","same","me too"],"phonetic":"/ˈdɪtoʊz/","extraExplanation":["“ditto”常见于口语表示“我也是/同感”，也常见于表格或旧式文书中，用符号（如同上引号）表示“同上”。“dittoes”是它的复数形式；口语里也有人为了搞笑或强调，用复数说“dittoes”，但更自然的说法通常还是单数“ditto”。"]}
{"word":"dittogram","summary":{"en":"A dittogram is an accidental repeated word or syllable in a text.","zh":"dittogram 指文本中误写/误印造成的重复字或重复音节。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A word or syllable that is mistakenly written or printed twice; a duplication error in a text (especially in copying or typesetting).","zh":"（尤指抄写、排版中的）误写或误印的重复字/重复音节；文本中的重复错误。"},"examples":[{"en":"The editor found a dittogram where “the” was printed twice: “the the.”","zh":"编辑发现了一个重复错误，把“the”印成了“the the”。"},{"en":"In old manuscripts, dittograms were common because scribes copied lines by hand.","zh":"在古手稿中，抄写员手工抄写时常会出现误写重复（dittogram）。"}]}],"synonyms":["duplication (error)","repetition (error)","scribal duplication"],"phonetic":"/ˈdɪtəˌɡræm/","extraExplanation":["这个词多用于校勘学、手稿研究、文本批评等领域，属于比较“书面/学术”的用语。日常英语更常说“a repeated word”或“duplication error”。","词源上，ditto 表示“同上/同样”，加上 -gram（与“写下的东西”有关），整体强调“写出来的重复”。"]}
{"word":"dittograph","summary":{"en":"A dittograph is an accidental duplication in a text, such as a repeated word or line.","zh":"dittograph 指文本中因误抄或误打而出现的重复内容（如重复的词或句）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a duplicated letter, word, or phrase in a text, usually caused by a copying or typing error (especially when copying manuscripts).","zh":"（文本中的）重复字母、重复词或重复短语，通常由抄写或打字错误导致（尤见于手稿抄写）。"},"examples":[{"en":"The editor marked the repeated word as a dittograph and removed it in the final version.","zh":"编辑把那个重复的词标注为“dittograph（重复误写）”，并在定稿中删掉了。"},{"en":"In the manuscript, a dittograph appears where the scribe accidentally wrote the same line twice.","zh":"在这份手稿里，有一处重复误写：抄写员不小心把同一行写了两遍。"}]},{"partOfSpeech":"v.","definition":{"en":"to make or introduce an accidental duplication in a text (less common).","zh":"（较少用）在文本中误加重复内容；造成重复误写。"},"examples":[{"en":"While transcribing quickly, she inadvertently dittographed a phrase.","zh":"她快速誊写时不小心把一个短语重复写了一遍。"}]}],"synonyms":["duplication","accidental repetition","repetition error"],"phonetic":"/ˈdɪtəˌɡræf/","extraExplanation":["这个词主要用于“文本校勘/手稿研究（textual criticism）”语境：学者比较不同抄本时，会把“dittograph（重复误写）”当作常见抄写错误之一来记录与纠正。","词源上，dittograph 来自希腊语前缀 ditto-（“双、重复”）+ -graph（“写”）。日常写作里更常用的说法是 “accidental repetition / duplication”。"]}
{"word":"dittographic","summary":{"en":"“Dittographic” describes an unintentional repetition in a text (a copying/writing error).","zh":"“Dittographic”指文本中因抄写/书写失误造成的无意重复。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to an accidental repetition of letters, words, or lines in writing or copying (a copying error called “dittography”).","zh":"（文本抄写或书写中）与“误重复”有关的；指不小心把字母、单词或整行重复写/抄了一遍的（称为 dittography 的错误）。"},"examples":[{"en":"The editor noted that the doubled word was a dittographic error in the manuscript.","zh":"编辑指出，手稿里那个重复的词是一个“误重复”（dittographic）的抄写错误。"},{"en":"In the printed text, the repeated line looked dittographic rather than intentional.","zh":"在印刷文本中，那一行的重复看起来更像是误重复（dittographic），而不是作者有意为之。"}]}],"synonyms":["repetitive (by error)","duplicated","redundant (accidentally)"],"phonetic":"/ˌdɪtəˈɡræfɪk/","extraExplanation":["“dittographic”常见于文本校勘（textual criticism）、古籍整理、抄本研究等领域。它来自“dittography”（误重复），意思是抄写者的视线跳回到相同或相近的词/行，导致把内容多抄了一次。","它常与相反类型的错误对比：haplography（误脱漏/漏写），即本应写两次或有两段相近内容，却只写了一次或漏掉了一段。"]}
{"word":"dittography","summary":{"en":"Dittography is an accidental repetition in writing or copying (or the repeated text itself).","zh":"dittography 指书写/抄写时不小心重复写了内容的错误（也可指重复出来的那段文字）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An unintentional writing or copying error where a letter, syllable, word, or phrase is repeated.","zh":"（抄写/誊写时的）重写误字：不小心把字母、音节、单词或短语重复写了一遍的错误。"},"examples":[{"en":"The editor noticed a dittography in the manuscript: the word “the” appeared twice.","zh":"编辑在手稿里发现了一个重写误字：“the”被写了两遍。"},{"en":"When copying quickly, scribes sometimes made errors like dittography or omissions.","zh":"快速誊写时，抄写员有时会出现重写误字或漏写等错误。"}]},{"partOfSpeech":"n.","definition":{"en":"The repeated portion itself (the duplicated letters/words) caused by such an error.","zh":"（由此类错误造成的）重复部分：被重复写出来的那段文字。"},"examples":[{"en":"Please delete the dittography at the end of the sentence.","zh":"请把句末那段重复的文字删掉。"},{"en":"The teacher circled the dittography and asked the student to rewrite the line.","zh":"老师圈出了重复部分，让学生重写这一行。"}]}],"synonyms":["duplication error","repetition error","scribal repetition"],"phonetic":"/ˌdɪtəˈɡræfi/","extraExplanation":["词源提示：dittography 来自希腊语前缀 ditto-（表示“两次/重复”）+ -graphy（书写）。它常见于文本校勘、手稿研究、抄写错误分析等语境。","相关对比：haplography（漏写/少写）指应该写两次却只写了一次；dittography 则相反，是不该重复却写了两次。"]}
{"word":"dittoing","summary":{"en":"“Dittoing” means repeating the same thing or expressing “same here/me too.”","zh":"“dittoing”表示重复同样的话，或用“ditto”表达“我也一样/同感”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"repeating what someone else has said or written; saying the same thing again (often to avoid repeating details).","zh":"重复别人说过或写过的话；表示“同样如此”（常用于避免重复细节）。"},"examples":[{"en":"I’m dittoing what Maya said: we should start earlier next time.","zh":"我重复一下玛雅的话：下次我们应该更早开始。"},{"en":"The second report is basically dittoing the first one.","zh":"第二份报告基本上是在重复第一份报告。"}]},{"partOfSpeech":"v.","definition":{"en":"showing agreement by saying “ditto,” meaning “same here/me too.”","zh":"用“ditto”表示赞同，意思是“我也一样/同感”。"},"examples":[{"en":"“I’m exhausted.” “Dittoing that—I didn’t sleep much either.”","zh":"“我累坏了。”“我也一样——我也没怎么睡。”"},{"en":"Everyone was praising her work, and he kept dittoing them.","zh":"大家都在夸她的工作，他也一直附和说“同感”。"}]}],"synonyms":["repeating","echoing","copying","seconding","agreeing","concurring","same here"],"phonetic":"/ˈdɪtoʊɪŋ/","extraExplanation":["“ditto”比较口语、偏非正式，常见于对话、聊天或会议里表示“同上/我也一样”。正式写作中更常用：I agree / likewise / the same applies.","在表格或清单里，ditto也可表示“同上”，但现在更常见写法是用“same as above”或直接复制粘贴，避免歧义。"]}
{"word":"dittologies","summary":{"en":"“Dittologies” are instances of repeating the same idea unnecessarily (or, in manuscripts, accidental duplication).","zh":"“dittologies”指不必要的同义重复（也可指手稿抄写中的误重复）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the unnecessary repetition of the same idea using different words; redundancy (a rhetorical or stylistic repetition).","zh":"用不同词语把同一意思重复表达；赘述、语义重复（修辞或写作中的重复）。"},"examples":[{"en":"The editor cut several dittologies to make the paragraph clearer.","zh":"编辑删掉了几处赘述，让段落更清晰。"},{"en":"Saying “each and every” can be a small dittology in formal writing.","zh":"在正式写作中，“each and every” 可能算是一种小小的语义重复。"},{"en":"His speech was emotional, but it contained some dittologies that weakened the message.","zh":"他的演讲很有感染力，但有些赘述削弱了信息的力度。"}]},{"partOfSpeech":"n.","definition":{"en":"(textual criticism) an accidental duplication of words or lines in a manuscript caused by copying mistakes.","zh":"（文本校勘/抄写学）因抄写错误导致的词语或句行的重复。"},"examples":[{"en":"The scholar noted a dittology where a whole line was copied twice.","zh":"学者指出有一处抄写错误：整行被重复抄了一遍。"},{"en":"When copying by hand, dittologies and omissions were common.","zh":"手抄时代，重复抄写和漏抄都很常见。"}]}],"synonyms":["redundancies","repetitions","tautologies","pleonasms"],"phonetic":"/dɪˈtɑlədʒiz/","extraExplanation":["“dittology”较少见，更多出现在修辞学、编辑与文本校勘领域；日常写作里更常用“redundancy / repetition”。","词源上与“ditto（同上）”有关，核心概念就是“把同样内容再来一次”。"]}
{"word":"dittology","summary":{"en":"Dittology means an unnecessary repetition of the same word or phrase, usually considered an error in writing or editing.","zh":"Dittology 指不必要地重复同一词或短语，通常被视为写作或编辑中的错误。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rhetorical or writing style mistake: repeating the same word or phrase unnecessarily (often by accident).","zh":"（修辞/写作中的）赘重复述：不必要地重复同一个词或短语（常常是无意的错误）。"},"examples":[{"en":"In his draft, the phrase “in my opinion” appears twice in one sentence—a small dittology.","zh":"在他的草稿里，“in my opinion”在同一句里出现了两次——这是个小小的赘重复述。"},{"en":"Editors removed several dittologies to make the paragraph clearer and tighter.","zh":"编辑删掉了几处赘重复述，让段落更清晰、更精炼。"}]}],"synonyms":["redundant repetition","unnecessary repetition","tautology (related)","repetition error"],"phonetic":"/dɪˈtɑlədʒi/","extraExplanation":["该词源自希腊语：*ditto-*（“两次/重复”）+ *-logy*（“说/词语”相关），在英语里多用于写作、编辑与修辞学语境。","它通常指“无意的重复错误”，不同于为了强调而有意重复（如修辞手法 *repetition* 或 *anaphora*）。日常写作中常见于改稿时复制粘贴、或口语转写时不小心重复。"]}
{"word":"ditton","summary":{"en":"Ditton is mainly used as a surname or an English place name, not a common everyday vocabulary word.","zh":"Ditton 主要作为姓氏或英国地名使用，并非常见的日常英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname)","zh":"（人名）姓氏"},"examples":[{"en":"Ms. Ditton will lead the meeting today.","zh":"Ditton 女士今天将主持会议。"}]},{"partOfSpeech":"other","definition":{"en":"a place name in England (seen in names like Thames Ditton or East Ditton)","zh":"（地名）英国的地名（常见于 Thames Ditton、East Ditton 等）"},"examples":[{"en":"They live near Thames Ditton, southwest of London.","zh":"他们住在伦敦西南的泰晤士迪顿（Thames Ditton）附近。"}]}],"phonetic":"ˈdɪtən","extraExplanation":["“ditton”在现代英语里不是常见的普通词汇；你可能想查的是“ditto”（表示“同上/同样”，常用于口语或清单里）。如果你想要“ditto”的词条，我也可以按同样格式给你。"]}
{"word":"dittos","summary":{"en":"“Dittos” is the plural of “ditto,” meaning repeated items or a playful “same here / I agree.”","zh":"“Dittos”是“ditto”的复数，表示“同上/重复项”，也可指口语里俏皮的“我也是/同感”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of “ditto”) things that are exactly the same as what was just said or written; repeated items","zh":"（“ditto”的复数）与前面所说或所写完全相同的内容；重复项"},"examples":[{"en":"Please bring two pens, two notebooks, and two dittos of the same form.","zh":"请带两支笔、两本笔记本，以及同一份表格的两份复印件。"},{"en":"In the list, the clerk wrote “ditto” and then several dittos to avoid repeating the same word.","zh":"在清单里，办事员写了“ditto”，然后又写了好几个“dittos”，以避免重复同一个词。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) repeated expressions meaning “same here / I agree,” especially used playfully in messages","zh":"（非正式）重复的回应，表示“我也是 / 同感 / 赞同”，常用于聊天中带点俏皮"},"examples":[{"en":"“I miss you.” “Dittos.”","zh":"“我想你了。” “我也是。”"},{"en":"Everyone said they were tired—lots of dittos in the group chat.","zh":"大家都说自己累了——群聊里满是“我也是”。"}]}],"synonyms":["same","me too","likewise","the same as above"],"phonetic":"/ˈdɪtoʊ/","extraExplanation":["“ditto”来自意大利语 detto，意思是“（前面）说过的”。在英文里常见于清单、表格、票据等，用来表示“同上/同前”，避免重复书写。口语里也能当轻松的回应（类似“same”），但正式写作中一般用“same”或直接重复内容更清楚。"]}
{"word":"ditty","summary":{"en":"A ditty is a short, simple, often cheerful song or poem.","zh":"ditty 指短小简单、常较轻松愉快的歌或小诗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A short, simple song or poem, often light and cheerful.","zh":"短小、简单的歌或小诗，常常轻松愉快。"},"examples":[{"en":"He hummed a little ditty while washing the dishes.","zh":"他一边洗碗一边哼着一首小曲儿。"},{"en":"The commercial used a catchy ditty that stayed in my head all day.","zh":"那则广告用了一个很洗脑的小调，我一整天都忘不掉。"}]},{"partOfSpeech":"n.","definition":{"en":"Something written in a simple, song-like style (sometimes used humorously or a bit dismissively).","zh":"（常带调侃或轻视）用简单、像歌谣一样的方式写成的文字或作品。"},"examples":[{"en":"She wrote a playful ditty about office life.","zh":"她写了一首关于办公室生活的俏皮小诗。"},{"en":"He called the poem a “little ditty,” but it was actually quite moving.","zh":"他称那首诗为“一个小打油诗”，但其实很感人。"}]}],"synonyms":["tune","jingle","little song","song","verse"],"phonetic":"/ˈdɪti/","extraExplanation":["“ditty”常用来指轻快、容易记的“小调/小歌”，语气通常友好随意；但在某些语境里也可能带一点“不过是个小玩意儿”的轻描淡写。","词源上与古法语/中古英语中表示“说、讲”的词有关，后来逐渐专指简短的歌曲。","近义表达（语气相近但不完全相同）：tune（曲调，较中性）、jingle（广告短歌/叮当小调，常用于商业）、song（泛指歌曲，范围更大）。"]}
{"word":"dittying","summary":{"en":"“Dittying” means lightly singing or humming, or making up a simple little song.","zh":"“Dittying”指轻快地哼唱，或随口编出简单的小曲。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"singing or humming in a light, simple way; making up little songs (present participle of the rare verb “to ditty”).","zh":"轻快地哼唱；即兴编出小曲（较少见动词 ditty 的现在分词）。"},"examples":[{"en":"She walked home dittying a tune she’d heard on the radio.","zh":"她一边走回家一边轻轻哼着电台里听到的旋律。"},{"en":"He sat by the window, dittying softly to pass the time.","zh":"他坐在窗边，轻声哼唱来打发时间。"}]}],"synonyms":["humming","singing","warbling","whistling","crooning (softly)"],"phonetic":"/ˈdɪtiɪŋ/","extraExplanation":["“Dittying”来自名词 ditty（“小曲、短歌”）。把名词当动词用（to ditty）带有文学/诗意色彩，日常英语里更常用 sing, hum, whistle, make up a song 等说法。","在文学语境中，“dittying”常给人一种轻松、随意、甚至有点童谣般的氛围，强调“随口哼唱”的感觉，而不是正式演唱。"]}
{"word":"Dituri","summary":{"en":"Dituri is usually a surname (a family name), not a common English vocabulary word.","zh":"Dituri 通常是姓氏（人名的一部分），不是常见的英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A surname (family name), often of Italian origin; used as a person’s last name (e.g., Joseph Dituri).","zh":"一个姓氏（家族姓），常见于意大利语背景；用作人的姓（例如 Joseph Dituri）。"},"examples":[{"en":"Joseph Dituri is a researcher known for underwater habitat projects.","zh":"Joseph Dituri 是一位以水下栖居项目闻名的研究者。"},{"en":"In the article, Dituri said the experiment lasted several weeks.","zh":"在那篇文章中，Dituri 说这项实验持续了好几个星期。"}]}],"phonetic":"/dɪˈtʊri/","extraExplanation":["“Dituri”不是常见的英语词汇，通常作为专有名词（姓氏）出现，因此一般不翻译；写作时首字母大写：Dituri。","英语里提到外国姓氏时，常直接保留原拼写；如果需要中文呈现，媒体有时会按读音音译，但音译形式可能不统一。"]}
{"word":"Ditzel","summary":{"en":"“Ditzel” is mainly used as a surname (family name).","zh":"“Ditzel”主要用作姓氏（家族名）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A family name (surname).","zh":"（人名）姓氏：Ditzel（迪策尔/迪采尔，音译）"},"examples":[{"en":"Ms. Ditzel will speak at the meeting today.","zh":"Ditzel 女士今天将在会议上发言。"},{"en":"I found an email from Alex Ditzel in my inbox.","zh":"我在收件箱里看到一封来自 Alex Ditzel 的邮件。"}]}],"synonyms":["(as a surname) no direct synonyms"],"phonetic":"ˈdɪtsəl","extraExplanation":["“Ditzel”在英语里主要作为专有名词（姓氏）使用，本身通常没有可查的通用词义。","它常见于德语背景的姓氏中，可能与德语姓氏拼写（如 Dietzel / Dietz 等）有关；具体家族来源需要结合个人或族谱信息确认。","作为姓氏使用时，首字母要大写（Ditzel）；除非特指某个品牌/公司/地名，否则一般不加冠词。"]}
{"word":"ditzier","summary":{"en":"“Ditzier” means “more ditzy”: more scatterbrained or silly in an absent-minded way.","zh":"“ditzier”表示“更ditzy”：更迷糊、更心不在焉、显得有点傻气。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"comparative of “ditzy”: more silly, scatterbrained, or not paying attention in a way that seems unintelligent","zh":"“ditzy”的比较级：更傻气/更迷糊、更心不在焉，给人不太聪明或不够认真之感"},"examples":[{"en":"After pulling an all-nighter, I felt even ditzier than usual in class.","zh":"熬了个通宵后，我在课上觉得自己比平时更迷糊。"},{"en":"He sounded ditzier on the phone because he was rushing and not thinking clearly.","zh":"他在电话里听起来更糊涂，是因为他很赶、没想清楚就说了。"}]}],"synonyms":["more scatterbrained","more absent-minded","more airheaded","more spacey"],"phonetic":"ˈdɪtsiɚ","extraExplanation":["“ditzy/ditzier”多用于口语，带一点贬义或调侃意味，可能让人觉得被轻视；有时也会被用来贴标签（尤其对女性），因此在正式场合或不熟的人面前要谨慎使用。","词源上属于较新的美式俚语（大约20世纪后期流行）。更中性的表达可用 “absent-minded（健忘/心不在焉）” 或 “distracted（分心）”。"]}
{"word":"ditziest","summary":{"en":"“Ditziest” means “most ditzy”—the most silly or scatterbrained (informal).","zh":"“ditziest”表示“最迷糊/最傻乎乎的”（非正式）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Informal) Most ditzy: seeming silly, scatterbrained, or not thinking seriously; often used humorously but can sound insulting.","zh":"（非正式）最“迷糊/傻乎乎”的：显得有点蠢萌、心不在焉、没太认真思考；常带玩笑语气，但也可能显得不礼貌。"},"examples":[{"en":"Of all the characters, he’s the ditziest, but he’s also the most kind-hearted.","zh":"在所有角色里，他最迷糊，但也最心地善良。"},{"en":"That was the ditziest mistake I’ve made all week—I put the milk in the cupboard.","zh":"那是我这周最离谱的迷糊错误——我把牛奶放进了橱柜。"},{"en":"She didn’t mean to be rude; she just sounded a bit ditziest when she forgot everyone’s names.","zh":"她不是故意无礼；只是忘了所有人的名字时听起来有点最迷糊。"}]}],"synonyms":["most scatterbrained","most absent-minded","most silly","most airheaded (informal)"],"phonetic":"/ˈdɪtsiɪst/","extraExplanation":["“ditziest”是形容词“ditzy”的最高级形式：ditzy → dizzier/ditzier（都有人用）→ ditziest。拼写上常见“ditzier/ditziest”，表示更/最迷糊。","这个词语气很口语化，常用于轻松调侃；但在评价他人（尤其是女性）时可能带刻板印象或贬义，正式场合建议用更中性的词，如“absent-minded（健忘/心不在焉）”“scatterbrained（心思散乱）”。"]}
{"word":"ditzy","summary":{"en":"“Ditzy” means silly and absent-minded, often implying someone (especially a woman) is not very serious or smart.","zh":"“Ditzy”指傻乎乎、迷糊健忘的，常含有（尤其对女性的）不够认真或不聪明的暗示。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Silly and absent-minded in a way that seems harmless (often said about a woman); not thinking seriously.","zh":"傻乎乎、迷糊健忘的（多用来形容女性），给人“不太认真/不太动脑”的感觉。"},"examples":[{"en":"I don’t mean to be rude—she’s just a little ditzy sometimes and forgets names.","zh":"我不是想没礼貌——她有时候就是有点迷糊，会忘记别人的名字。"},{"en":"He thought the character was ditzy at first, but she turned out to be very capable.","zh":"他一开始觉得那个角色傻傻的，但后来发现她其实很能干。"}]}],"synonyms":["silly","scatterbrained","absent-minded","airheaded","spacey"],"phonetic":"/ˈdɪt.si/","extraExplanation":["“ditzy”在语气上常带一点轻蔑或刻板印象，尤其容易被用来评价女性的“傻白甜/不聪明”。在正式场合或不熟的人面前，使用时要谨慎，以免冒犯。","更中性、礼貌的替换说法包括：forgetful（健忘的）、scatterbrained（心不在焉的）、absent-minded（心不在焉的）、not very focused（不太专注）。"]}
