{"word":"DIU","summary":{"en":"DIU is usually an initialism whose meaning depends on context; Diu (capital D) is also a place name in India.","zh":"DIU 通常是需看上下文的首字母缩写；Diu（首字母大写）也可指印度的地名“第乌”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An initialism (said as separate letters) that can stand for different names or technical terms; the exact meaning depends on the context (for example, a university name or a device/unit name).","zh":"一个按字母逐个读出的缩写（首字母缩略词）；具体指什么要看上下文（例如某所大学、某种设备/单元等）。"},"examples":[{"en":"In the report, DIU stands for “Digital Interface Unit.”","zh":"在这份报告里，DIU 指的是“数字接口单元（Digital Interface Unit）”。"},{"en":"Please define DIU the first time you use it in your email.","zh":"你在邮件里第一次写到 DIU 时，请先把全称写出来。"}]},{"partOfSpeech":"n.","definition":{"en":"Diu: a coastal town/region in western India (often written with only the first letter capitalized: Diu).","zh":"第乌（Diu）：印度西部的沿海城镇/地区（常写作首字母大写：Diu）。"},"examples":[{"en":"They traveled from Gujarat to Diu for a weekend by the sea.","zh":"他们从古吉拉特邦到第乌去海边过周末。"}]}],"synonyms":["initialism","acronym (general)","abbreviation"],"phonetic":"diː aɪ ˈjuː","extraExplanation":["“DIU”在英文里不是一个单一固定词义的常用词，而是“缩写/代号”。写作时通常需要在第一次出现时标注全称（例如：Digital Interface Unit (DIU)），否则读者很难判断指的是哪一个机构或术语。","如果你指的是学校名称（如某些地区常见的 Daffodil International University）或某个特定领域（军事、工程、学术等）里的 DIU，可以告诉我上下文，我可以给出更精确的释义与例句。"]}
{"word":"diumvirate","summary":{"en":"Duumvirate means shared rule by two people, especially two leaders; historically, it refers to a Roman office held jointly by two officials.","zh":"duumvirate 指两人共同掌权（常指两位领导者共同执政）；在历史上也指古罗马由两名官员共同担任的官职或这对官员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group or partnership of two leaders who share power or control.","zh":"由两位领导者共同掌权或共同控制的二人领导集团（或搭档）。"},"examples":[{"en":"After the election, a duumvirate emerged to run the party together.","zh":"选举之后，一个二人领导集团出现，两人共同管理该党。"},{"en":"The company was effectively led by a duumvirate of the CEO and the CFO.","zh":"这家公司实际上由CEO和CFO组成的二人领导搭档在领导。"}]},{"partOfSpeech":"n.","definition":{"en":"In ancient Rome, the office or authority held by two officials (called duumvirs), or the pair of officials themselves.","zh":"（古罗马）由两名官员（称为duumvir）共同担任的官职/权力，或指这对官员本身。"},"examples":[{"en":"In some Roman towns, local administration was managed by a duumvirate.","zh":"在一些罗马城镇里，地方行政由二人官职体系来管理。"},{"en":"The inscription names the duumvirate who oversaw the public works.","zh":"铭文中提到负责公共工程的那对二人官员。"}]}],"synonyms":["co-leadership","partnership","two-man rule","dual leadership"],"phonetic":"/duˈʌmvərət/","extraExplanation":["拼写提示：更常见、标准的拼写是 **duumvirate**（含两个u），你写的 *diumvirate* 多半是误拼或较罕见的变体。","词源：来自拉丁语 **duo**（二）+ **vir**（男人/公民、政治人物），本义是“二人共治”。在英语里常用来比喻现代政治或组织中的“两人共同掌权”。"]}
{"word":"diunsaturated","summary":{"en":"Diunsaturated means “having two double bonds,” especially in fats or hydrocarbons.","zh":"diunsaturated 指“含有两个双键的（不饱和的）”，多用于脂肪或烃类等化学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry, of a fat or hydrocarbon) having two carbon–carbon double bonds; a type of polyunsaturated compound.","zh":"（化学，指脂肪或烃类）含有两个碳—碳双键的；属于多不饱和化合物的一种。"},"examples":[{"en":"Linoleic acid is a diunsaturated fatty acid with two double bonds.","zh":"亚油酸是一种二不饱和脂肪酸，含有两个双键。"},{"en":"Diunsaturated fats are generally more reactive than monounsaturated fats.","zh":"二不饱和脂肪通常比单不饱和脂肪更容易发生反应。"},{"en":"The label lists a small amount of diunsaturated fat in the oil.","zh":"标签显示这种油含有少量二不饱和脂肪。"}]}],"synonyms":["dienoic","polyunsaturated (broader term)"],"phonetic":"ˌdaɪʌnˈsætʃəˌreɪtɪd","extraExplanation":["“di-”表示“二/两个”，“unsaturated”指“含有双键、未被氢完全‘饱和’”。因此 diunsaturated 字面意思就是“含两个双键的不饱和”。","在营养学中更常见的说法是用更具体的术语：monounsaturated（单不饱和，一个双键）与 polyunsaturated（多不饱和，两个或更多双键）。在很多教材里，“二不饱和”常被视为 polyunsaturated 的一个子类。","拼写上有时也会写作“di-unsaturated”。如果你是在论文或产品标签里看到的，这通常是较专业/较少见的用法。"]}
{"word":"diuranate","summary":{"en":"Diuranate is a uranium-containing chemical salt (with two uranium atoms), used mainly in uranium processing.","zh":"Diuranate 指一种含铀的化学盐（含两个铀原子），主要用于铀的加工处理。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (a salt of diuranic acid) containing two uranium atoms; diuranates are used in uranium processing and can appear as yellow powders, such as ammonium diuranate.","zh":"一种含有两个铀原子的化合物（双铀酸的盐）；双铀酸盐常用于铀的加工处理，常见为黄色粉末，例如“双铀酸铵”。"},"examples":[{"en":"Ammonium diuranate is a yellow precipitate that can form during uranium extraction.","zh":"在铀的提取过程中，可能会生成黄色沉淀——双铀酸铵。"},{"en":"The report mentioned diuranate compounds as intermediate products in refining.","zh":"报告提到双铀酸盐化合物是精炼过程中的中间产物。"}]}],"synonyms":["diuranate salt","ammonium diuranate (specific type)"],"phonetic":"/daɪˈjʊrəˌneɪt/","extraExplanation":["“di-”表示“两个”，“uranate”指“铀酸盐”。在核燃料工业语境中，你可能会看到 ammonium diuranate（双铀酸铵，缩写 ADU），它常被视为从含铀溶液中沉淀出来的中间产物之一。","学习时注意：日常英语里很少用到 diuranate，这个词多出现在化学、材料或核工程文献中；在普通新闻中更常见的是 yellowcake（黄饼，指铀矿加工得到的浓缩物），但 yellowcake 并不等同于某一种特定的“diuranate”。"]}
{"word":"diureide","summary":{"en":"Diureide is a chemistry term for a compound with two ureide (urea-like) groups.","zh":"Diureide 是化学术语，指含有两个 ureide（类似尿素结构）基团的化合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound that contains two ureide (urea-like) groups; often used in chemistry to describe substances such as allantoin.","zh":"（化学）含有两个“脲基/脲化物（ureide，类似尿素的基团）”的化合物；常用于描述某些物质（如尿囊素 allantoin）这一类结构。"},"examples":[{"en":"Allantoin is sometimes described as a diureide in older chemistry texts.","zh":"在较早的化学文献中，尿囊素（allantoin）有时被描述为一种 diureide（双脲类化合物）。"},{"en":"The paper discusses the synthesis of a diureide derived from an organic acid.","zh":"这篇论文讨论了一种由有机酸衍生的 diureide（双脲类化合物）的合成。"}]}],"synonyms":["di-ureide compound","double ureide","(related example) allantoin"],"phonetic":"/daɪˈjʊr.i.aɪd/","extraExplanation":["“di-”表示“两个/双”，而“ureide”指含有类似尿素（urea）的结构单元。因此 diureide 通常是结构性术语：强调分子里有两个 ureide 相关基团，而不一定指某一个固定的单一物质。","你可能在生物化学或护肤成分中见到相关概念：尿囊素（allantoin）常被称作某种酸的“diureide”，并广泛用于护肤品配方中（作为舒缓、保护皮肤的成分之一）。"]}
{"word":"diureses","summary":{"en":"Diuresis means increased urination or increased urine production (a medical term).","zh":"Diuresis 指“利尿/尿量增多”，属于医学用语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Medical) increased production and passing of urine; frequent urination caused by the body getting rid of excess water and salts.","zh":"（医学）利尿；排尿量增加（身体排出多余水分和盐分而导致的尿量增多/排尿更频繁）。"},"examples":[{"en":"The doctor monitored her urine output to see whether diuresis was occurring.","zh":"医生监测她的尿量，以判断是否出现利尿。"},{"en":"Caffeine can cause mild diuresis in some people.","zh":"咖啡因可能会让一些人出现轻度利尿。"},{"en":"After receiving the medication, he experienced diuresis and needed to use the restroom more often.","zh":"用药后他出现利尿，上厕所更频繁了。"}]}],"synonyms":["increased urination","increased urine output","polyuria (related, often implies abnormally high urine volume)"],"phonetic":"/ˌdaɪjʊˈriːsɪs/","extraExplanation":["“diureses”是“diuresis”的复数形式，表示“多次/多种利尿现象”或“不同患者的利尿情况”。日常与医学写作中更常见的是单数“diuresis”。","常见搭配：induce diuresis（诱导利尿），promote diuresis（促进利尿），osmotic diuresis（渗透性利尿），post-obstructive diuresis（解除梗阻后的利尿）。","注意区分：diuresis（尿量增加的现象/过程）≠ diuretic（利尿剂，药物/物质）。"]}
{"word":"diuresis","summary":{"en":"Diuresis means increased urination (more urine output).","zh":"Diuresis 指“利尿/尿量增加”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"increased production and passing of urine (pee) by the body, often caused by drinking more fluids, medicines, or certain health conditions","zh":"利尿；排尿增多（尿量增加），常由喝水增多、药物或某些健康状况引起"},"examples":[{"en":"Caffeine can cause mild diuresis, so you may need to use the bathroom more often.","zh":"咖啡因可能引起轻度利尿，所以你可能会更常上厕所。"},{"en":"The doctor monitored diuresis to see whether the treatment was removing excess fluid.","zh":"医生监测利尿情况，以判断治疗是否在排出多余体液。"}]}],"synonyms":["increased urination","increased urine output","polyuria (related, more general term)"],"phonetic":"/ˌdaɪ.jəˈriː.sɪs/","extraExplanation":["“Diuresis”常见于医学语境，指“尿量增加”这一现象本身；而“diuretic”是“利尿剂/利尿的（药）”。","词源来自希腊语，含义与“通过尿排出”有关。临床上会记录“尿量（urine output）”来评估是否存在水肿、脱水或肾功能问题。"]}
{"word":"diuretic","summary":{"en":"“Diuretic” means something (often a medicine) that increases urination or has a urination-increasing effect.","zh":"diuretic 指“利尿剂”或“利尿的”，即使排尿增多、帮助排出多余水分的东西/作用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A substance (medicine, food, or drink) that makes you urinate more, helping the body get rid of extra water and salt.","zh":"利尿剂；（药物、食物或饮品）使人排尿增多，帮助身体排出多余水分和盐分的物质。"},"examples":[{"en":"The doctor prescribed a diuretic to reduce the swelling in her legs.","zh":"医生开了利尿剂来减轻她腿部的肿胀。"},{"en":"Coffee can act as a mild diuretic for some people.","zh":"对一些人来说，咖啡可能有轻微的利尿作用。"},{"en":"If you take a diuretic, follow your doctor’s advice and drink water appropriately.","zh":"如果你在服用利尿剂，请遵医嘱并适量补充水分。"}]},{"partOfSpeech":"adj.","definition":{"en":"Causing increased urination; having the effect of making the body produce more urine.","zh":"利尿的；促使排尿增多的。"},"examples":[{"en":"This tea has a diuretic effect, so don’t drink too much before bed.","zh":"这种茶有利尿作用，所以睡前别喝太多。"},{"en":"Some medications are diuretic and may lower blood pressure.","zh":"一些药物具有利尿作用，可能会降低血压。"}]}],"synonyms":["water pill","diuretic drug","natriuretic"],"phonetic":"/ˌdaɪjəˈrɛtɪk/","extraExplanation":["在医学语境中，diuretic 常指“利尿药”，用于治疗高血压、心力衰竭、水肿等；常见类型包括 thiazide diuretics（噻嗪类）、loop diuretics（袢利尿剂，如 furosemide/呋塞米）、potassium-sparing diuretics（保钾利尿剂，如 spironolactone/螺内酯）。","学习搭配：take a diuretic（服用利尿剂）、prescribe a diuretic（开利尿剂）、a diuretic effect（利尿作用）。日常语境里也会说某些饮品“act as a mild diuretic（有轻微利尿作用）”。","词源提示：来自希腊语前缀 dia-（“通过”）+ ourein（“排尿”），字面意思接近“让尿液通过/排出”。"]}
{"word":"diuretical","summary":{"en":"“Diuretical” means having a diuretic effect—causing increased urination.","zh":"“diuretical”表示“利尿的”，即会促进排尿增多。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Causing the body to produce more urine; relating to a diuretic effect.","zh":"利尿的；会促进身体排出更多尿液的；与利尿作用有关的。"},"examples":[{"en":"Caffeine has a mild diuretical effect for some people.","zh":"咖啡因对一些人有轻微的利尿作用。"},{"en":"The doctor warned that the medicine could be diuretical and lead to dehydration.","zh":"医生提醒这种药可能有利尿作用，导致脱水。"}]}],"synonyms":["diuretic","water-releasing","urine-promoting"],"phonetic":"/ˌdaɪjəˈrɛtɪkəl/","extraExplanation":["“diuretical”在现代英语中较少见，更常用的是“diuretic”（既可作形容词也可作名词，如 a diuretic drug / take a diuretic）。写作或日常交流时，通常建议用“diuretic”更自然。","常见搭配：diuretic/diuretical effect（利尿作用）、diuretic medicine/drug（利尿药）、fluid loss（体液流失）、dehydration（脱水）。"]}
{"word":"diuretically","summary":{"en":"“Diuretically” means “in a way that increases urine production.”","zh":"“diuretically”表示“以利尿的方式（增加尿量）”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that causes increased urine production (a diuretic effect).","zh":"以利尿的方式；具有促进排尿、增加尿量作用地。"},"examples":[{"en":"Caffeine can act diuretically, so drink water if you have a lot of coffee.","zh":"咖啡因可能会起到利尿作用，所以如果你喝很多咖啡，记得补充水分。"},{"en":"The doctor said the medicine works diuretically to reduce swelling.","zh":"医生说这种药通过利尿作用来减轻水肿。"}]}],"synonyms":["with a diuretic effect","diureticly (rare/nonstandard)"],"phonetic":"/ˌdaɪ.jəˈrɛt.ɪ.kli/","extraExplanation":["“diuretically”多用于医学/健康语境，日常口语里更常说 “has a diuretic effect / makes you pee more（让你更想上厕所）”。","词形拆解：diuretic（利尿的/利尿剂）+ -ally（以……方式）。对应名词是 “diuretic（利尿剂）”，形容词是 “diuretic（利尿的）”。"]}
{"word":"diureticalness","summary":{"en":"“Diureticalness” means the degree of having a diuretic effect (increasing urine production); it is rare, and “diuretic effect/activity” is more common.","zh":"“diureticalness”指“利尿性/利尿程度”（促进排尿）；该词较少见，更常用说法是“diuretic effect/activity”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or degree of being diuretic; a tendency to increase urine production (a rare, nonstandard noun).","zh":"利尿性；促进排尿的性质或程度（较少见、非标准的名词用法）。"},"examples":[{"en":"Researchers measured the diureticalness of the herbal extract in lab animals.","zh":"研究人员在实验动物身上测量这种草本提取物的利尿性。"},{"en":"If a drink has strong diureticalness, you may need to use the restroom more often.","zh":"如果一种饮料利尿性很强，你可能会更频繁地上厕所。"},{"en":"The report compares the diureticalness of two medications at the same dose.","zh":"该报告比较了两种药物在相同剂量下的利尿性。"}]}],"synonyms":["diuretic effect","diuretic activity","diuretic property","diuresis (medical)"],"phonetic":"/ˌdaɪjəˈrɛtɪk(ə)lnəs/","extraExplanation":["“diureticalness”由 diuretic（利尿的）+ -al（形容词后缀）+ -ness（名词后缀）构成，但在现代英语里非常少见。更自然、常用的表达通常是“diuretic effect”（利尿作用）、“diuretic activity”（利尿活性）或直接说“how diuretic it is”（有多利尿）。","在医学语境中，diuretic 常指“利尿剂”（一种药物），而在日常语境中也可描述咖啡因等成分“有利尿作用”。使用时注意区分“a diuretic (n.)”与“diuretic (adj.)”。"]}
{"word":"diureticly","summary":{"en":"“Diuretically” means “in a way that causes increased urination.”","zh":"“Diuretically”表示“以导致尿量增加（利尿）的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that increases urine production; with a diuretic effect (often used in medical or health contexts).","zh":"以利尿的方式；具有利尿作用地（多用于医学或健康语境）。"},"examples":[{"en":"Caffeine acts diuretically in some people, especially if they are not used to it.","zh":"咖啡因在一些人身上会产生利尿作用，尤其是平时不常摄入的人。"},{"en":"The doctor explained that the medication works diuretically to reduce fluid buildup.","zh":"医生解释说，这种药通过利尿作用来减少体液潴留。"}]}],"synonyms":["diuretic-like","as a diuretic","in a diuretic manner"],"phonetic":"ˌdaɪjəˈrɛtɪkli","extraExplanation":["“diureticly”较少见，更常见、也更标准的拼写是“diuretically”。在正式写作（医疗报告、科普文章）中建议用“diuretically”。","“diuretically”常见于讨论咖啡因、酒精、某些降压药（利尿剂）以及“water pills（水丸）”等话题；日常口语中人们更常说“it makes you pee more（让你更想上厕所）”。"]}
{"word":"diuretics","summary":{"en":"Diuretics are medicines or substances that increase urination to remove extra fluid and salt from the body.","zh":"Diuretics 指利尿剂：促进排尿，帮助排出体内多余水分和盐分的药物或物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Substances (often medicines) that make the body produce more urine, helping remove extra water and salt; used to treat conditions like high blood pressure or swelling (edema).","zh":"利尿剂；（常指药物）促进身体产生更多尿液，帮助排出多余水分和盐分；常用于治疗高血压或水肿等。"},"examples":[{"en":"The doctor prescribed diuretics to reduce the swelling in her legs.","zh":"医生开了利尿剂来减轻她腿部的肿胀。"},{"en":"Some people take diuretics for high blood pressure, but they should follow medical advice.","zh":"有些人会用利尿剂治疗高血压，但应遵循医生建议。"}]}],"synonyms":["water pills","diuretic drugs"],"phonetic":"/ˌdaɪ.jəˈrɛtɪks/","extraExplanation":["“Diuretics”是“diuretic”的复数形式。口语里也常听到“water pills”（水丸/利尿药）这个说法，但在医疗语境中用“diuretics”更正式。","常见类型包括噻嗪类（thiazide）、袢利尿剂（loop diuretic）和保钾利尿剂（potassium-sparing）。不同类型作用部位和副作用不同，用药需遵医嘱。","日常饮品里也有轻度利尿作用的成分，例如咖啡因（caffeine）；但它们不等同于药物利尿剂。"]}
{"word":"Diuril","summary":{"en":"Diuril is a brand-name diuretic medicine (chlorothiazide) used to remove excess fluid and lower blood pressure.","zh":"Diuril 是氯噻嗪的商品名，属于利尿药，用于排出多余体液并常用于降血压或减轻水肿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand name for chlorothiazide, a thiazide diuretic medicine used to help the body remove extra water and salt (often for high blood pressure or swelling).","zh":"（商标名）氯噻嗪（chlorothiazide），一种噻嗪类利尿药，用于帮助身体排出多余水分和盐分（常用于高血压或水肿等）。"},"examples":[{"en":"The doctor prescribed Diuril to help reduce fluid retention.","zh":"医生开了 Diuril 来帮助减轻体液潴留（水肿）。"},{"en":"Diuril is a diuretic, so it may make you urinate more often.","zh":"Diuril 是利尿剂，所以可能会让你更频繁地排尿。"}]}],"synonyms":["chlorothiazide","diuretic"],"phonetic":"/ˈdaɪjʊrɪl/","extraExplanation":["Diuril 是药品商品名（brand name），在医学语境中更常见；日常英语里通常会说 “a diuretic（利尿剂）” 或直接使用通用名 “chlorothiazide（氯噻嗪）”。","与药物相关的英文表达常见搭配：be prescribed Diuril（被开具 Diuril）、take Diuril（服用 Diuril）、reduce swelling/fluid retention（减轻水肿/体液潴留）。","用药信息需以医生/药师指导为准；这里仅解释词义与用法。"]}
{"word":"diurn","summary":{"en":"Diurn (rare) means “of the day; daily,” similar to diurnal.","zh":"diurn（罕见）意为“白天的；每日的”，相当于 diurnal。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(rare) happening during the day; daily; diurnal.","zh":"（罕见）白天发生的；每日的；昼行性的（同 diurnal）。"},"examples":[{"en":"The poet described the town’s diurn noise and its quiet nights.","zh":"诗人描写了小镇白日的喧闹与夜晚的宁静。"},{"en":"Some insects follow a diurn pattern, resting at night and feeding in daylight.","zh":"有些昆虫遵循昼行模式：夜里休息，白天觅食。"}]}],"synonyms":["diurnal","daily","daytime"],"phonetic":"ˈdaɪɝn","extraExplanation":["“diurn”多见于较旧的文学或学术写作中，可视为“diurnal”的缩略/变体，用来表达“白天的、每日的”。在现代英语里更常用“diurnal”（如：diurnal rhythm 昼夜节律、diurnal animals 昼行性动物）。","词源来自拉丁语“diurnus”（daily，每日的），与“diary（日记）”同源，都带有“每日/日常记录”的概念。"]}
{"word":"Diurna","summary":{"en":"Diurna is uncommon in English; it most often appears in “Acta Diurna,” meaning Roman daily public records/announcements. In Spanish/Italian, diurna means “daily/daytime” (feminine form).","zh":"Diurna 在英语中不常单独使用，多见于“Acta Diurna”，指古罗马的每日公告/记录。在西班牙语/意大利语中，diurna 表示“每日的/白天的”（阴性形式）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Latin/loanword, usually seen in the phrase “Acta Diurna”) “daily (records),” referring to public daily notices—sometimes described as an early Roman “newspaper.”","zh":"（拉丁语借词，多见于短语“Acta Diurna”）“每日的（记录）”，指古罗马的每日公告/公报，有时被称为早期的“报纸”。"},"examples":[{"en":"In ancient Rome, the Acta Diurna posted daily announcements for the public.","zh":"在古罗马，Acta Diurna 会张贴每日公告供公众阅读。"},{"en":"Some historians call the Acta Diurna a kind of early newspaper.","zh":"一些历史学者把 Acta Diurna 称作一种早期的报纸。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Spanish/Italian) feminine form of “diurno/diurno”: daily; of the daytime.","zh":"（西班牙语/意大利语）“diurno/diurno”的阴性形式：每日的；白天的。"},"examples":[{"en":"La temperatura diurna es más alta que la nocturna. (Spanish)","zh":"白天的气温比夜间更高。（西班牙语）"},{"en":"Attività diurna: a daytime activity. (Italian)","zh":"Attività diurna：白天的活动。（意大利语）"}]}],"synonyms":["Acta Diurna","public notices","daily bulletin","diurnal"],"phonetic":"/daɪˈɝːnə/","extraExplanation":["在英语里“diurna”本身很少单独使用，最常见是作为固定搭配“Acta Diurna”的一部分出现。这个短语字面意思是“每日记录/每日公告”，常被用来类比“最早的公共新闻发布”。","如果你是在生物学或日常英语里想表达“昼行的/白天活动的”，更常用的英语词是 **diurnal**（而不是 diurna）。"]}
{"word":"diurna","summary":{"en":"Diurna is a Latin-based term meaning “active during the day,” and in older zoology it could also refer to day‑flying butterflies as a group.","zh":"Diurna 是源自拉丁语的词，意思是“白天活动的（昼行性）”；在较早的动物学中也可指“昼行性蝴蝶”的统称。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(taxonomy, from Latin) Active during the day; diurnal.","zh":"（分类学用语，源自拉丁语）白天活动的；昼行性的。"},"examples":[{"en":"Many butterflies are diurna, feeding and mating in daylight.","zh":"许多蝴蝶是 diurna（昼行性）的，会在白天取食和交配。"},{"en":"The field guide notes this species is diurna rather than nocturnal.","zh":"野外指南指出这种物种是 diurna（昼行性）的，而不是夜行性的。"}]},{"partOfSpeech":"n.","definition":{"en":"(zoology, older usage) Day‑flying butterflies as a group.","zh":"（动物学旧称）指昼行性蝴蝶（作为一个类群/统称）。"},"examples":[{"en":"In older books, butterflies were sometimes divided into Diurna and Nocturna.","zh":"在较旧的书里，蝴蝶有时被分为 Diurna（昼行性）和 Nocturna（夜行性）。"}]}],"synonyms":["diurnal","day-active"],"phonetic":"/daɪˈɝːnə/","extraExplanation":["“diurna”来自拉丁语 diurnus，意思是“每日的、白天的”。在现代英语里更常见的对应词是 **diurnal**（昼行性的）。","在生物分类的旧体系中，Diurna 曾被用来指“白天活动的鳞翅目昆虫（尤其是蝴蝶）”，属于历史用法；现代分类更常用更具体的类群名称（如某些蝴蝶科/亚科），或直接用 diurnal 描述活动时间。"]}
{"word":"diurnal","summary":{"en":"Diurnal means “of the day”: active in the daytime or relating to daily (day–night) cycles.","zh":"Diurnal 指“白天的”：白天活动的，或与每日（昼夜）周期变化有关的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Active during the daytime rather than at night; happening in the day.","zh":"（活动或发生）在白天的；昼行性的。"},"examples":[{"en":"Humans are generally diurnal, while many owls are nocturnal.","zh":"人类通常是昼行性的，而许多猫头鹰是夜行性的。"},{"en":"We saw a diurnal lizard sunbathing on the rock.","zh":"我们看到一只昼行性的蜥蜴在岩石上晒太阳。"}]},{"partOfSpeech":"adj.","definition":{"en":"Related to the day or happening every day, especially in a daily cycle (e.g., temperature changes).","zh":"与白天有关的；每日的（常指周期性的日变化，如温度）。"},"examples":[{"en":"Deserts often have large diurnal temperature changes—hot days and cold nights.","zh":"沙漠的日变化温差常常很大——白天很热，夜晚很冷。"},{"en":"The plant’s flowers open and close with a diurnal rhythm.","zh":"这株植物的花朵会随昼夜节律开合。"}]}],"synonyms":["daytime","daily","day-active"],"phonetic":"/daɪˈɝːnəl/","extraExplanation":["“diurnal”来自拉丁语 diurnus，意为“白天的、每日的”，与“day（日）”同源。","常见对比词：nocturnal（夜行性的）。在科学写作里也常用来描述“日变化/昼夜节律”（diurnal cycle / diurnal rhythm）。","在文学或正式文体中，diurnal 有时可含“日常的、每天反复的”之意，但现代英语里更常用于生物学与气象学语境。"]}
{"word":"diurnality","summary":{"en":"Diurnality means being active mainly in the daytime, or having a daily (24-hour) daytime-related rhythm.","zh":"Diurnality 指主要在白天活动的习性（昼行性），也可指与白天相关的日变化/24小时节律。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the pattern of being active mainly during the daytime (especially in animals).","zh":"（尤指动物）昼行性；主要在白天活动的习性。"},"examples":[{"en":"Many birds show diurnality, searching for food in daylight.","zh":"许多鸟类具有昼行性，会在白天觅食。"},{"en":"Compared with owls, most songbirds have strong diurnality.","zh":"与猫头鹰相比，大多数鸣禽的昼行性更明显。"}]},{"partOfSpeech":"n.","definition":{"en":"the daily cycle or rhythm that repeats every 24 hours; a daytime-related daily pattern (used in biology and medicine).","zh":"昼夜节律中的“日周期/24小时周期”；与白天相关的每日规律（生物学、医学用语）。"},"examples":[{"en":"Researchers measured the diurnality of hormone levels across the day.","zh":"研究人员测量了激素水平在一天中的日变化规律。"},{"en":"Exposure to morning light can strengthen diurnality in sleep–wake patterns.","zh":"早晨的光照可以增强睡眠—觉醒模式的日间规律性。"}]}],"synonyms":["daytime activity","diurnal pattern","diurnal rhythm"],"phonetic":"/ˌdaɪ.ɚˈnæl.ə.t̬i/","extraExplanation":["“diurnality”来自拉丁语 diurnus（“白天的、每日的”）。常与 nocturnality（夜行性）对比使用；也会和 crepuscular（晨昏活动的）一起出现，用来描述动物在一天中何时最活跃。","相关词形：diurnal（adj. 昼间的/昼行的）。例如：diurnal animals（昼行性动物）；diurnal variation（昼变化）。"]}
{"word":"diurnally","summary":{"en":"Diurnally means “during the day” or, in formal contexts, “every day.”","zh":"diurnally 意为“在白天（非夜间）地”，在较正式语境中也可指“每天地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that happens during the day (not at night).","zh":"在白天进行地；非夜间地。"},"examples":[{"en":"Some flowers open diurnally and close at night.","zh":"有些花白天开放，夜晚闭合。"},{"en":"The desert temperature changes diurnally, so mornings can feel cool.","zh":"沙漠气温会在一天之内（日间）变化，所以早晨可能会觉得凉。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that happens every day; daily.","zh":"每天地；日常地。"},"examples":[{"en":"The sensors record water levels diurnally to track trends.","zh":"传感器每天记录水位以追踪趋势。"},{"en":"Diurnally, he reviews his schedule before starting work.","zh":"他每天都会在开始工作前查看日程。"}]}],"synonyms":["during the day","by day","daily","every day"],"phonetic":"/daɪˈɝːnəli/","extraExplanation":["“diurnally”来自拉丁语 *diurnus*（“白天的/每日的”）。它常见于较正式或学术语境（如生物学、医学、气象学）来描述“日间活动”或“昼夜节律中的白天部分”。日常口语里更常用：*during the day*（在白天）或 *daily*（每天）。","学习提示：如果你想表达“昼夜变化规律”，常与 *diurnal cycle*（昼夜循环）或 *diurnal variation*（日变化）搭配。相对词是 *nocturnally*（夜间地）或 *at night*（在夜里）。"]}
{"word":"diurnalness","summary":{"en":"Diurnalness means the quality of being related to daytime activity or a daily (24-hour) pattern.","zh":"Diurnalness 指与白天活动有关的特性，或“以一天为周期”的日变化规律。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality or state of being active in the daytime (rather than at night)","zh":"（生物或人的）昼行性；白天活动的特性"},"examples":[{"en":"Many birds show diurnalness, searching for food in daylight and resting at night.","zh":"许多鸟类具有昼行性，白天觅食，夜晚休息。"},{"en":"As a student, her diurnalness increased once she stopped staying up late.","zh":"作为学生，她不再熬夜后，白天更有精神（昼行性更明显）。"}]},{"partOfSpeech":"n.","definition":{"en":"the quality of happening or changing over a day; a daily pattern","zh":"日变化；以一天为周期发生或变化的特性"},"examples":[{"en":"The diurnalness of temperatures is clear in deserts: hot days and cool nights.","zh":"沙漠气温的日变化很明显：白天热、夜晚凉。"},{"en":"Researchers tracked the diurnalness of the plant’s leaf movement.","zh":"研究人员追踪了这种植物叶片运动的日变化规律。"}]}],"synonyms":["diurnality","daytime activity","daily cycle","diurnal cycle"],"phonetic":"/daɪˈɝːnəl.nəs/","extraExplanation":["“diurnalness”不算常用词，更常见的名词是“diurnality”（昼行性）或“daily cycle/diurnal cycle”（日周期/日变化）。形容词“diurnal”更常见，如：diurnal animals（昼行性动物）、diurnal temperature variation（日温差/日变化）。","“diurnal”源自拉丁语 diurnus（“白天的、每日的”），和“day（日）”同源。对应的反义概念常见为“nocturnal（夜行性的）”。"]}
{"word":"diurnals","summary":{"en":"“Diurnals” usually means day-active animals; “diurnal” also means happening during the day or relating to daily cycles.","zh":"“diurnals”通常指昼行性动物；“diurnal”也可表示白天发生的或与每日/昼夜周期相关的。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) Animals or creatures that are active during the day rather than at night.","zh":"（复数名词）昼行性动物；白天活动而不是夜间活动的动物。"},"examples":[{"en":"Many birds are diurnals, while owls are nocturnal.","zh":"很多鸟类是昼行性动物，而猫头鹰是夜行性动物。"},{"en":"In this forest you’ll spot more diurnals in the morning than after sunset.","zh":"在这片森林里，早上比日落后更容易看到昼行性动物。"}]},{"partOfSpeech":"adj.","definition":{"en":"(adjective, base form: diurnal) Happening in the daytime, or relating to daily cycles.","zh":"（形容词，原形：diurnal）白天发生的；或与“每日周期”有关的。"},"examples":[{"en":"The desert has a large diurnal temperature range.","zh":"沙漠的昼夜温差很大（每日温差范围大）。"},{"en":"They recorded diurnal changes in light and humidity.","zh":"他们记录了光照和湿度的日变化。"}]}],"synonyms":["day-active animals","diurnal animals","daytime-active species"],"phonetic":"/daɪˈɝːnəl/","extraExplanation":["“diurnals”在日常英语里不如“diurnal animals（昼行性动物）”常见；很多情况下会用“diurnal”作形容词来表达同样意思。","常见对比词：nocturnal（夜行性）、crepuscular（晨昏活动的，如黄昏/黎明时最活跃）。","“diurnal”也常用于科学语境，表示“每日的、昼夜循环的变化”，例如 diurnal cycle（昼夜周期）、diurnal variation（昼夜变化/日变化）。"]}
{"word":"diurnation","summary":{"en":"Diurnation is a rare noun meaning a one-day (day–night) cycle, sometimes referring to daily rotation in scientific contexts.","zh":"Diurnation 是一个较少见的名词，指一昼夜（昼夜循环）的周期；在科学语境中有时指每日自转。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the daily cycle or a period of one day; sometimes used in science to mean “daily rotation” (especially the Earth’s rotation that causes day and night)","zh":"一昼夜的周期；一天的时段；（科学语境中）也可指“昼夜自转”，尤指地球自转导致昼夜更替"},"examples":[{"en":"Some animals adjust their behavior to the diurnation of light and darkness.","zh":"一些动物会根据光明与黑暗的一昼夜周期来调整行为。"},{"en":"Scientists compare temperature changes across a single diurnation.","zh":"科学家会比较一个昼夜内的气温变化。"}]}],"synonyms":["diurnal cycle","day-night cycle","daily cycle"],"phonetic":"/ˌdaɪərˈneɪʃən/","extraExplanation":["“diurnation”非常少见，更常用的表达是“diurnal cycle”（昼夜周期）或“day-night cycle”（昼夜循环）。在地球科学里，如果你想强调“自转”，也常写作“Earth’s rotation”或“diurnal rotation”。","词源上与拉丁语“diurnus”（每日的、白天的）有关，同根词包括“diurnal”（昼行性的/日间的）。"]}
{"word":"diurne","summary":{"en":"Diurne means “day-active” or “occurring in the daytime,” especially in scientific contexts.","zh":"diurne 指“昼行/白天活动的；发生在白天的”，多用于科学语境，常见同义词为 diurnal。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Active during the day; happening in the daytime (used especially in biology/zoology).","zh":"（尤用于生物/动物学）昼行性的；白天活动的；发生在白天的。"},"examples":[{"en":"Most squirrels are diurne, so you usually see them in daylight.","zh":"大多数松鼠是昼行性的，所以你通常在白天能看到它们。"},{"en":"The study compared diurne and nocturnal animals in the same habitat.","zh":"这项研究比较了同一栖息地中的昼行性动物和夜行性动物。"}]}],"synonyms":["diurnal","daytime","day-active"],"phonetic":"/daɪˈɝn/","extraExplanation":["“diurne”在现代英语中比较少见，更常用的是“diurnal”。两者意思基本相同，常见于动物学、生态学等较正式的写作中。","词源上与拉丁语“dies”（白天、日子）有关，因此和“diary（日记）”“daily（每天的）”在词根意义上有联系。"]}
{"word":"diurnule","summary":{"en":"A rare word meaning a small book for daily prayers (a kind of diurnal).","zh":"一个罕见词，指用于每日祈祷的袖珍祈祷书（diurnal 的一种）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Rare) A small prayer book used for the daily offices (regular daily prayers) in some Christian traditions; a type of diurnal.","zh":"（罕用）一种用于日课（每日固定祈祷）的袖珍祈祷书；相当于 diurnal（祈祷书的一种）。"},"examples":[{"en":"She carried a diurnule so she could say the daily prayers while traveling.","zh":"她带着一本 diurnule，这样旅行时也能做每日祈祷。"},{"en":"The monastery library has a diurnule alongside larger breviaries.","zh":"修道院图书馆里既有 diurnule，也有更大部头的日课书（breviary）。"}]}],"synonyms":["diurnal (prayer book)","breviary","prayer book"],"phonetic":"/daɪˈɝn.juːl/","extraExplanation":["这个词在现代英语里非常少见，更多见的是 diurnal（名词：日课祈祷书）或 breviary（更常用、范围更广的“日课书/祈祷书”）。","词源上与拉丁语 diurnus（“每日的、白天的”）有关，因此含义和“每日祈祷/日课”紧密相连。"]}
{"word":"diurnus","summary":{"en":"Diurnus is a Latin word meaning “daily” or “of the day,” and it mainly appears in English through related words like diurnal.","zh":"Diurnus 是拉丁语，意为“每日的/白天的”，在英语中多通过 diurnal 等相关词出现。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Latin) daily; happening during the day; “of the day.” (Rare in modern English; more often seen in related words like “diurnal.”)","zh":"（拉丁语）每日的；白天发生的；“属于白天/当天的”。（现代英语中很少直接用，更常见于相关词如 diurnal。）"},"examples":[{"en":"The Latin adjective diurnus means “daily” or “of the day.”","zh":"拉丁语形容词 diurnus 的意思是“每日的”或“属于白天的”。"},{"en":"In English writing, you’re more likely to meet diurnal than diurnus.","zh":"在英语中，你更可能见到 diurnal，而不是 diurnus。"}]}],"synonyms":["daily","diurnal"],"phonetic":"/daɪˈɝːnəs/","extraExplanation":["diurnus 是拉丁语词，来自表示“白天/日子”的词根（与 day 的概念相关）。它常作为理解英语派生词的“词源线索”，例如：diurnal（白天的/昼行性的）、diary（日记，原义与“每日记录”有关）。","在生物学里常说 diurnal animals（昼行性动物），对应 nocturnal（夜行性的）；这些都比直接使用 diurnus 常见得多。"]}
{"word":"diuron","summary":{"en":"Diuron is a herbicide (weed killer) used in agriculture and land management.","zh":"Diuron（敌草隆）是一种用于农业和土地管理的除草剂（杀草剂）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical herbicide used to control weeds and grasses, especially in crops and non-crop areas (a substituted urea herbicide).","zh":"敌草隆；一种化学除草剂，用于防除杂草和禾本科草类，常用于农作物地和非农用地（取代脲类除草剂）。"},"examples":[{"en":"Diuron is used to prevent weeds from growing in some agricultural fields.","zh":"敌草隆用于在一些农田里预防杂草生长。"},{"en":"Because diuron can persist in soil, farmers must follow label instructions carefully.","zh":"由于敌草隆可能在土壤中残留较久，农户必须严格按照标签说明使用。"}]}],"synonyms":["herbicide","weed killer","substituted urea herbicide"],"phonetic":"/daɪˈjʊrɑn/","extraExplanation":["“Diuron”是一个化学品名称，常见于农业、园艺、环境科学与法规文件中，而不是日常口语。","它属于“取代脲类（substituted urea）”除草剂，主要通过抑制光合作用来杀草（因此常与水体污染、对藻类/水生生物的影响等环境议题一起出现）。","不同国家/地区对敌草隆的使用限制不同；阅读产品标签、遵守当地法规与安全防护要求很重要。"]}
{"word":"diurons","summary":{"en":"Diuron is a weed-killing herbicide; “diurons” is its plural form.","zh":"Diuron 是一种用于除草的化学除草剂；“diurons”是其复数形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical herbicide used to kill weeds, especially in agriculture and industrial areas (plural: diurons).","zh":"一种化学除草剂，用于杀死杂草，常见于农业或工业用地（复数：diurons）。"},"examples":[{"en":"Diuron is used to control weeds in some crops and non-crop areas.","zh":"Diuron 用于控制一些作物地和非作物区域的杂草。"},{"en":"The label explains how much diuron to apply and when to apply it.","zh":"产品标签会说明 diuron 的用量以及施用时间。"}]}],"synonyms":["herbicide","weed killer"],"phonetic":"/ˈdaɪ.jʊ.rɑn/","extraExplanation":["“diuron”是常见的农药/除草剂名称，属于专有化学名词，日常英语里不算高频词，更多出现在农业、环境科学、产品说明书和法规文件中。","如果你看到的是“diurons”，通常只是复数形式，表示不同批次/种类/用量的 diuron，或在文献中泛指该物质的使用情况。"]}
{"word":"Diushambe","summary":{"en":"Diushambe is an uncommon spelling of Dushanbe, the capital of Tajikistan.","zh":"Diushambe 是杜尚别（Dushanbe，塔吉克斯坦首都）的不常见拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A less common spelling of **Dushanbe**, the capital city of Tajikistan (in Central Asia).","zh":"**杜尚别（Dushanbe）** 的一种不常见拼写：塔吉克斯坦（中亚）的首都。"},"examples":[{"en":"She flew to Diushambe (Dushanbe) for a research project in Tajikistan.","zh":"她飞到 Diushambe（杜尚别）去塔吉克斯坦做研究项目。"},{"en":"Some older maps use the spelling Diushambe, but most English sources write Dushanbe.","zh":"一些较老的地图会写 Diushambe，但大多数英文资料写 Dushanbe。"}]}],"synonyms":["Dushanbe"],"phonetic":"/duːˈʃɑːnbeɪ/","extraExplanation":["“Diushambe”多见于旧式转写或不同语言体系的拼写差异；现代英语中更标准、也更常见的写法是 **Dushanbe**。","“Dushanbe/Diushambe”源自波斯语/塔吉克语词根，意思与“星期一”有关（历史上因周一集市而得名）。"]}
{"word":"diuturnal","summary":{"en":"Diuturnal means “lasting a very long time,” and it is a formal, rare adjective.","zh":"diuturnal 表示“持续很久、长期的”，是较正式且少见的形容词。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"lasting for a very long time; long-continued (formal, rare).","zh":"持续很久的；长期的（正式用语，较少见）。"},"examples":[{"en":"After years of diuturnal conflict, both sides were exhausted.","zh":"经过多年的长期冲突，双方都筋疲力尽。"},{"en":"The judge mentioned the diuturnal nature of the dispute in the final decision.","zh":"法官在最终裁决中提到这场纠纷的长期性。"},{"en":"He built his reputation through diuturnal effort rather than sudden luck.","zh":"他是靠长期努力而不是一时的运气建立起声誉的。"}]}],"synonyms":["long-lasting","long-term","prolonged","enduring","persistent"],"phonetic":"/daɪˈjuːtɝːnəl/","extraExplanation":["“diuturnal”较少用于日常口语，更常见于法律、学术或写作中，用来强调“持续时间很长”。日常表达里通常用 long-lasting / long-term / prolonged。","词源来自拉丁语 diuturnus（意为“长久的”），与 endure（忍受/持续）这类“持续”的概念相近。"]}
{"word":"diuturnity","summary":{"en":"Diuturnity means lasting a very long time; long duration (formal).","zh":"diuturnity 指“持续很久、长期”，语气较正式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a very long duration; the state of lasting for a long time (often used in formal or academic writing).","zh":"长期；持久（多用于正式或学术语境）。"},"examples":[{"en":"The diuturnity of the conflict exhausted both sides.","zh":"这场冲突的长期持续让双方都筋疲力尽。"},{"en":"Researchers studied the diuturnity of immunity after vaccination.","zh":"研究人员考察了接种疫苗后免疫力的持久性。"},{"en":"Her success came from diuturnity—steady effort over many years.","zh":"她的成功来自持久的努力——多年如一日的坚持。"}]}],"synonyms":["longevity","duration","persistence","endurance","continuity"],"phonetic":"/ˌdaɪjuːˈtɝːnəti/","extraExplanation":["“diuturnity”是偏罕见、较书面的词，常见于法律、历史、医学或学术写作中；日常英语更常用“long duration / longevity / lastingness”。","词源来自拉丁语“diuturnus”（意为“长久的、持久的”），因此带有一种正式、偏“书面抽象名词”的语气。"]}

