{"word":"Diwali","summary":{"en":"Diwali is the Festival of Lights, a major Indian festival symbolizing light and goodness.","zh":"Diwali 是“灯节/排灯节”，印度重要节日，象征光明与善战胜黑暗与恶。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A major Hindu festival (also celebrated by some Jains, Sikhs, and Buddhists) known as the “Festival of Lights,” usually held in October or November, celebrating the victory of light over darkness and good over evil.","zh":"排灯节（Diwali）：印度重要的节日，也有耆那教、锡克教和部分佛教群体庆祝；通常在10月或11月，以“灯节”闻名，象征光明战胜黑暗、善战胜恶。"},"examples":[{"en":"During Diwali, many families light small oil lamps and decorate their homes.","zh":"排灯节期间，很多家庭会点燃小油灯并装饰家里。"},{"en":"My coworkers wished me a happy Diwali and shared sweets at the office.","zh":"同事们祝我排灯节快乐，还在办公室分享了甜点。"},{"en":"Cities often look brighter at night during Diwali because of candles and fireworks.","zh":"排灯节时因为蜡烛和烟花，城市夜晚常常显得更明亮。"}]}],"synonyms":["Festival of Lights","Deepavali"],"phonetic":"/dɪˈwɑːli/","extraExplanation":["“Diwali”也常写作“Deepavali”，源自梵语“dīpāvali”，意思是“灯的行列/灯串”。不同地区会把节日与不同故事联系起来：例如在很多北印度传统中常与《罗摩衍那》中罗摩回归、民众点灯相迎相关；在一些地区也与财富与丰收、敬奉女神拉克什米（Lakshmi）等习俗相关。","英语里常见搭配：happy Diwali（排灯节快乐）、Diwali lights（排灯节彩灯/灯饰）、Diwali sweets（排灯节甜点）。在跨文化交流中，称它为“Festival of Lights”有助于不熟悉背景的人快速理解。"]}
{"word":"diwan","summary":{"en":"Diwan can mean (1) a government council/office, (2) a poetry collection in Arabic/Persian-related traditions, or (3) a long low sofa/bench.","zh":"Diwan 可指（1）政府议事机构/官署，（2）阿拉伯—波斯等传统中的诗集，（3）靠墙的长低沙发/坐榻。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in some Middle Eastern and South Asian contexts) a government council, administrative office, or the room where officials meet; by extension, a state bureau or department.","zh":"（在一些中东和南亚语境中）政府的议事机构、行政机关或官员开会的厅室；引申为政府部门/官署。"},"examples":[{"en":"She works at the provincial diwan that handles public records.","zh":"她在负责公共档案的省政府官署（diwan）工作。"},{"en":"The petition was submitted to the diwan for review.","zh":"请愿书被递交到议事机构（diwan）审议。"}]},{"partOfSpeech":"n.","definition":{"en":"a collection of poems, especially in Arabic, Persian, Turkish, or Urdu traditions (often by a single poet).","zh":"（尤指阿拉伯语、波斯语、土耳其语或乌尔都语传统中的）诗集（常为同一位诗人的作品汇编）。"},"examples":[{"en":"In class we read poems from Hafez’s diwan.","zh":"课上我们阅读了哈菲兹诗集（diwan）里的诗。"},{"en":"The library acquired a rare diwan manuscript.","zh":"图书馆新购入了一部稀有的诗集手稿（diwan）。"}]},{"partOfSpeech":"n.","definition":{"en":"a long, low sofa or bench, often placed against a wall (common in Middle Eastern-style interiors).","zh":"（常见于中东风格室内的）靠墙的长而低的沙发/坐榻。"},"examples":[{"en":"Guests sat on the diwan and drank tea.","zh":"客人们坐在坐榻（diwan）上喝茶。"},{"en":"The room had cushions arranged along a wooden diwan.","zh":"房间里在木质坐榻（diwan）上摆着一排靠垫。"}]}],"synonyms":["council","bureau","chancery","poetry collection","anthology","divan"],"phonetic":"/dɪˈwɑn/","extraExplanation":["“diwan”源自波斯语与阿拉伯语系统，历史上常指君主或政府的“档案/财政/行政机构”，在奥斯曼帝国等语境里也可指“御前会议/议事厅”。因此在阅读历史或新闻时，它可能更接近“官署/委员会”，而在文学语境中则多指“诗集”。","同一个词在不同地区会有不同拼写与转写（如 divan/diwan）。在英语里，“divan”更常指“沙发/坐榻”，而“diwan”在学术或地区语境中更常见于“官署/诗集”的意义。"]}
{"word":"diwani","summary":{"en":"Diwani is an ornate Ottoman calligraphy style used especially in official and palace writing; it can also describe things related to that script.","zh":"Diwani 指一种华丽的奥斯曼书法体，常用于官方与宫廷书写；也可作形容词表示“与该字体相关”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a style of Ottoman Turkish calligraphy known for flowing, highly decorative letters, often used for official documents and palace writing","zh":"一种奥斯曼土耳其书法风格，笔画流畅、装饰性强，常用于官方文件与宫廷书写"},"examples":[{"en":"The invitation was written in Diwani script with elegant curves and dense lines.","zh":"请柬用迪瓦尼体书写，线条优雅、结构紧密。"},{"en":"In the museum, we saw Diwani calligraphy on old Ottoman decrees.","zh":"在博物馆里，我们看到了写在奥斯曼旧诏令上的迪瓦尼体书法。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to the Diwani calligraphic style","zh":"与迪瓦尼体（书法风格）有关的"},"examples":[{"en":"She practices diwani lettering to improve her control of curves and spacing.","zh":"她练习迪瓦尼体字形，以提高对曲线与字距的控制。"}]}],"synonyms":["Ottoman calligraphy","Arabic calligraphy (broad)","calligraphic script"],"phonetic":"/dɪˈwɑːni/","extraExplanation":["“Diwani/迪瓦尼体”源自奥斯曼帝国的“Dîvân（宫廷/官署）”，因为这种字体常用于政府文书与宫廷通信。它以连绵的线条、装饰性与较强的防伪效果著称（不易被随意仿改）。","学习时可把它与更“端正清晰”的书法风格对比理解：Diwani更偏装饰与艺术表达，阅读难度通常更高。"]}
{"word":"diwans","summary":{"en":"“Diwans” is the plural of “diwan,” meaning a long low couch, a government council/office, or a collection of poems (depending on context).","zh":"“Diwans”是“diwan”的复数，可指长而低的长榻/沙发、政务机构/官署，或诗集（视语境而定）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of diwan) a long, low couch or bench—often placed against a wall and used for sitting or reclining, especially in South Asian and Middle Eastern homes.","zh":"（diwan 的复数）长而低的沙发/长凳，常靠墙摆放，用于坐卧，常见于南亚与中东家庭。"},"examples":[{"en":"They sat on the diwans and drank tea while talking.","zh":"他们坐在长榻上喝茶聊天。"},{"en":"The guest room had cushions arranged along the diwans.","zh":"客房里靠着长榻摆了许多靠垫。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural of diwan) an official council or government office/department in some Middle Eastern and South Asian contexts.","zh":"（diwan 的复数）在部分中东与南亚语境中指“政务会议/官署/政府部门”。"},"examples":[{"en":"Petitions were sent to the diwans for review.","zh":"请愿书被送到官署审阅。"},{"en":"He worked in one of the diwans responsible for finance.","zh":"他在负责财政的一个政府部门任职。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural of diwan) a collection of poems, especially in Persian, Arabic, or Urdu literary traditions.","zh":"（diwan 的复数）诗集（尤指波斯语、阿拉伯语或乌尔都语传统中的诗歌汇编）。"},"examples":[{"en":"She studied classic diwans in her literature course.","zh":"她在文学课上研读经典诗集。"},{"en":"The library displayed several diwans by famous poets.","zh":"图书馆展出了几部著名诗人的诗集。"}]}],"synonyms":["couches","benches","sofas","councils","offices","poetry collections"],"phonetic":"/dɪˈwɑn/","extraExplanation":["“diwan”一词来源于波斯语 dīvān，并在阿拉伯语与奥斯曼土耳其语等语境中广泛使用，因此它既可能指“官署/议政机构”，也可能指“记录在册的文书/诗歌汇编”。后来在家居文化中又引申出“靠墙的长榻/坐卧用的低沙发”。","读文学时常见搭配：a diwan of + poet（某诗人的诗集）。读旅行/家居描写时，“diwan”更常指长榻。"]}
{"word":"diwata","summary":{"en":"A Filipino mythological nature spirit or deity—often a guardian of places like forests, mountains, or waters.","zh":"菲律宾神话中的自然神灵/守护神，常守护森林、山岳或水域等地点。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Filipino mythology) a nature spirit or deity, often associated with forests, mountains, rivers, or the sea; sometimes described as a fairy-like guardian.","zh":"（菲律宾神话中）“迪瓦塔/天女/精灵”一类的自然神灵或守护神，常与森林、山川、河流或海洋相关，有时带有“仙子/精灵”般的形象。"},"examples":[{"en":"Local stories say a diwata protects the forest and the animals in it.","zh":"当地传说说，有位 diwata 守护森林和其中的动物。"},{"en":"Some hikers leave a small offering to show respect to the diwata of the mountain.","zh":"有些登山者会留下小供品，以表示对山中 diwata 的敬意。"},{"en":"The novel uses the diwata as a symbol of nature’s power and mystery.","zh":"这部小说把 diwata 用作自然力量与神秘感的象征。"}]}],"synonyms":["deity","nature spirit","guardian spirit","fairy","nymph"],"phonetic":"/diˈwɑːtə/","extraExplanation":["“Diwata”来自东南亚受印度文化影响的词源系统，常被认为与梵语/巴利语的“devatā（天神、神灵）”有关。在菲律宾（尤其是维萨亚地区及民间叙事中）它可能指更接近“自然精灵/守护灵”的存在，形象与职能会因地区与故事而变化。","英语语境中通常保留原词 diwata，用来指“菲律宾本土神话中的灵体/神祇”，避免直接翻成 fairy（仙子）或 goddess（女神）而造成文化误读；更稳妥的译法是“自然神灵/守护灵”。"]}

