{"word":"DIX","summary":{"en":"“Dix/DIX” is most often a proper name (surname/place/institution), sometimes an acronym, and occasionally the French word for “ten.”","zh":"“Dix/DIX”多见于专有名词（姓氏/地名/机构名），有时是缩写，也可能是法语中“十”的意思。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name or place name (proper noun) used in English, e.g., in names of people, towns, or institutions","zh":"（专有名词）在英语中用作姓氏或地名，例如人名、城镇名或机构名中的“Dix”"},"examples":[{"en":"John A. Dix was an American politician in the 1800s.","zh":"John A. Dix 是19世纪的美国政治人物。"},{"en":"She was stationed near Fort Dix in New Jersey.","zh":"她曾驻扎在新泽西的迪克斯堡（Fort Dix）附近。"}]},{"partOfSpeech":"other","definition":{"en":"(often written DIX) an abbreviation/acronym whose meaning depends on the field; you usually need surrounding context to know what it stands for","zh":"（常写作 DIX）缩写/首字母缩略词，具体含义取决于领域；通常需要上下文才能确定代表什么"},"examples":[{"en":"In this document, DIX refers to a specific internal system.","zh":"在这份文件里，DIX 指的是一个特定的内部系统。"},{"en":"Can you tell me what DIX stands for in this report?","zh":"你能告诉我这份报告里的 DIX 代表什么吗？"}]},{"partOfSpeech":"other","definition":{"en":"the French word for “ten,” sometimes seen in English contexts (menus, labels, language learning)","zh":"法语里“十”的意思；有时会出现在英语语境中（菜单、标签、语言学习等）"},"examples":[{"en":"The sign says “dix,” which means ten in French.","zh":"牌子上写着“dix”，在法语里意思是十。"},{"en":"I learned to count: un, deux, trois … dix.","zh":"我学会了数数：un, deux, trois …… dix（十）。"}]}],"synonyms":["(proper name) none","(French ‘dix’) ten"],"phonetic":"/dɪks/","extraExplanation":["在英语里看到“DIX/Dix”时，最常见的是专有名词（姓氏、地名、机构名）或缩写。若是“法语的十”，法语发音更接近 /dis/（末尾的 x 不像英语那样读 /ks/），但在英语环境里人们也可能按英语习惯读成 /dɪks/。","“Fort Dix”是美国新泽西州的一个军事基地名称；因此在新闻或个人经历中常会出现“Dix”。","如果你是在某篇文章/报告/软件界面里看到 DIX，把那句话或所在领域（医疗、IT、金融等）发我，我可以帮你更准确地判定它的全称。"]}
{"word":"dix","summary":{"en":"“Dix” is most commonly the French word for “ten,” and it can also be a surname in English.","zh":"“dix”最常见是法语里“十”的意思，也可作为英语中的姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"the French word for the number “ten.”","zh":"法语中表示数字“十”。"},"examples":[{"en":"In French, “dix” means ten.","zh":"在法语里，“dix”表示“十”。"},{"en":"She can count: un, deux, trois … dix.","zh":"她会数数：一、二、三……十（法语：un, deux, trois … dix）。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname), seen in names like “Dorothy Dix.”","zh":"姓氏（如“Dorothy Dix”中的 Dix）。"},"examples":[{"en":"His last name is Dix.","zh":"他姓 Dix。"},{"en":"Dorothy Dix was a famous pen name used for advice columns.","zh":"Dorothy Dix 是一个著名的笔名，常用于建议专栏。"}]}],"synonyms":["ten (meaning)","French: dix (spelling)"],"phonetic":"/dɪks/","extraExplanation":["“dix”的发音在法语里会随语境变化：单独说或句末常读作 /dis/；在“dix amis（十个朋友）”这类连音场景中，常读作 /diz/。不过在英语语境里，人们通常按字母拼写读作 /diks/（尤其当它是姓名或品牌/缩写时）。","如果你是在学法语数字：dix（10）、onze（11）、douze（12）。在法语里它属于基础词汇，但在英语中通常只在法语课、菜单、地名/人名里看到。"]}
{"word":"dixain","summary":{"en":"Dizain (often misspelled as “dixain”) means a ten-line stanza or poem.","zh":"dizain（常被写成“dixain”）指“十行诗节/十行诗”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a ten-line stanza or poem (especially in French poetry); a poetic form with ten lines, often with a set rhyme scheme","zh":"（诗歌）十行诗节；十行诗（尤指法语诗歌中的一种固定诗体），常带有特定押韵格式"},"examples":[{"en":"The poet wrote a dizain to capture a brief moment of grief and hope.","zh":"诗人写了一首十行诗，来捕捉短暂的悲伤与希望。"},{"en":"In the anthology, each section begins with a dizain as an opening epigraph.","zh":"在这本文集中，每一部分都以一首十行诗作为开篇题词。"}]}],"synonyms":["ten-line stanza","ten-line poem","decastich"],"phonetic":"/dɪˈzeɪn/","extraExplanation":["“dixain”更常见的拼写是 **dizain**（也写作 *dizain/dizaine*），源自法语，和法语里的“十（dix）”有关。","不同传统的押韵方式不完全一致；学习时可把它先理解为“**十行的诗节/诗**”，再根据具体作品去看它的押韵与格律要求。"]}
{"word":"dixenite","summary":{"en":"“dixenite” is not a recognized common English word; it’s likely a misspelling or a proper/rare name.","zh":"“dixenite”不是常见英语词；更可能是拼写错误或专有/罕见名称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries. It may be a misspelling or a very rare/proper name.","zh":"这不是常见词典里的标准英语单词；可能是拼写错误，或是非常罕见/专有名词。"},"examples":[{"en":"I can’t find “dixenite” in standard English dictionaries—did you mean a different word?","zh":"我在常见英语词典里找不到“dixenite”——你是不是想写别的词？"},{"en":"If you tell me the sentence you saw it in, I can help identify the correct spelling and meaning.","zh":"如果你把它出现的句子发给我，我可以帮你确认正确拼写和意思。"}]}],"phonetic":"/ˈdɪksəˌnaɪt/","extraExplanation":["从拼写来看，它可能是你听写/打字时的误拼。常见的相近词可能有：\n- dysentery（痢疾）：发音和拼写与“dixenite”不太像，但有时听感会被误记。\n- dixie（迪克西，美国南方的俗称）+ 其他后缀：如果是人名、地名、品牌名或游戏/小说里的专有名词，也可能查不到。\n\n请你提供：1）它出现的上下文句子；或 2）你想表达的中文意思；或 3）你听到的读音（大概即可）。我就能更准确地给出正确词条。"]}
{"word":"Dixfield","summary":{"en":"Dixfield is the name of a town in Oxford County, Maine, USA.","zh":"Dixfield 是美国缅因州牛津县的一个城镇名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A town in Oxford County, western Maine, in the United States.","zh":"美国缅因州西部牛津县（Oxford County）的一个城镇。"},"examples":[{"en":"Dixfield is a small town in western Maine.","zh":"Dixfield 是缅因州西部的一个小镇。"},{"en":"She drove through Dixfield on her way to the mountains.","zh":"她去山里时开车经过了 Dixfield。"}]}],"synonyms":["(no direct synonyms; proper place name)"],"phonetic":"/ˈdɪksfiːld/","extraExplanation":["Dixfield 是专有名词（地名），日常英语中通常不翻译，但在中文语境里会说明它位于“缅因州牛津县”。","这种以 “-field” 结尾的地名在英语里很常见，常带有“田野、开阔地”的历史含义；不过具体到 Dixfield，更多是作为固定地名使用，而不是按字面直译。"]}
{"word":"Dixiana","summary":{"en":"Dixiana is a proper name often used for U.S. places or entities, typically evoking “Dixie” (the American South).","zh":"Dixiana多为美国的专有名称（地名/机构名等），常带有“Dixie（美国南方）”的联想。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(proper noun) A name used for places, businesses, or estates in the United States (e.g., communities or neighborhoods) that are often associated with “Dixie,” meaning the American South.","zh":"（专有名词）美国的一些地名、企业名或庄园名（如某些社区/地区）所用的名称，常与“Dixie（美国南方）”的意象相关。"},"examples":[{"en":"She grew up near a small community called Dixiana.","zh":"她在一个叫Dixiana的小社区附近长大。"},{"en":"The old mill site is marked on the map as “Dixiana.”","zh":"那处旧磨坊遗址在地图上标注为“Dixiana”。"}]}],"synonyms":["Dixie (related term)"],"phonetic":"/ˌdɪksiˈænə/","extraExplanation":["“Dixiana”通常可理解为由“Dixie（美国南方的俗称）”+ “-ana（常用于构成地名/名称的后缀）”拼成的名称，因此常带有“南方/迪克西地区”的文化联想。","在历史语境中，“Dixie/南方意象”有时会与美国内战、奴隶制等复杂议题相连；遇到具体地名或机构名时，建议根据当地历史背景来理解其含义与使用场景。"]}
{"word":"Dixie","summary":{"en":"“Dixie” most commonly refers to the southern United States, and it can also mean a song titled “Dixie,” an old slang term for a $10 bill, or a female name.","zh":"“Dixie”最常指美国南方；也可指歌曲《Dixie》、旧俚语“十美元纸币”，或女性名字。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the southern United States (especially the states that seceded in the Civil War); often used in a nostalgic or cultural sense","zh":"美国南方地区（尤指南北战争中脱离联邦的州）；常带怀旧或文化色彩"},"examples":[{"en":"He grew up in Dixie and still speaks with a Southern accent.","zh":"他在美国南方长大，现在仍带着南方口音。"},{"en":"The band played music associated with Dixie traditions.","zh":"乐队演奏了与美国南方传统相关的音乐。"}]},{"partOfSpeech":"n.","definition":{"en":"a famous American folk song often called “Dixie” (linked historically to the Confederate South)","zh":"一首著名的美国民歌《Dixie》（历史上常与邦联南方联系在一起）"},"examples":[{"en":"Some people recognize the tune of “Dixie” immediately.","zh":"有些人一听就能认出《Dixie》的旋律。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, historical) a ten-dollar bill","zh":"（非正式、较旧用法）十美元纸币"},"examples":[{"en":"He slipped a dixie into the tip jar.","zh":"他往小费罐里塞了一张十美元。"}]},{"partOfSpeech":"n.","definition":{"en":"a female given name or nickname","zh":"女性名字或昵称（Dixie）"},"examples":[{"en":"Dixie is her stage name.","zh":"Dixie 是她的艺名。"}]}],"synonyms":["the South","the American South","Southern states"],"phonetic":"/ˈdɪksi/","extraExplanation":["“Dixie”在美国文化中常与“旧南方（Old South）”意象相关：乡村音乐、南方口音与传统生活方式等。但它也与奴隶制与邦联历史有复杂关联，因此在某些语境（活动、标志、歌曲演出）可能引发争议或让人不适。使用时最好考虑场合与听众。","词源说法不一：常见解释之一是与路易斯安那早期发行的印有法语“dix（十）”的纸币有关；后来“Dixie”逐渐被用来指代美国南方。"]}
{"word":"dixie","summary":{"en":"“Dixie” usually means the U.S. South (especially the old Confederacy) and can also refer to the song titled “Dixie.”","zh":"“Dixie”通常指美国南方（尤指旧邦联地区），也可指歌曲《Dixie》。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the southern part of the United States, especially the states that were part of the Confederacy during the American Civil War (often used in a historical or cultural sense)","zh":"（美国）南方地区，尤指在南北战争期间属于邦联的各州（常用于历史或文化语境）"},"examples":[{"en":"She grew up in Dixie but moved north for college.","zh":"她在美国南方（Dixie）长大，但上大学后搬去了北方。"},{"en":"The book explores music traditions in Dixie.","zh":"这本书探讨了美国南方（Dixie）的音乐传统。"}]},{"partOfSpeech":"n.","definition":{"en":"a famous minstrel song from the 1800s often associated with the U.S. South; sometimes treated as an unofficial anthem (the title is “Dixie”)","zh":"一首19世纪著名的吟游表演歌曲《Dixie》，常与美国南方联系在一起；有时被视为非正式的“南方颂歌”"},"examples":[{"en":"The band played “Dixie,” which sparked a debate about its historical meaning.","zh":"乐队演奏了《Dixie》，这引发了人们对其历史含义的讨论。"},{"en":"In some places, people avoid the song “Dixie” because of its connection to slavery-era entertainment.","zh":"在一些地方，人们会避免演唱《Dixie》，因为它与奴隶制时期的表演娱乐有关联。"}]}],"synonyms":["the South","the American South","the Deep South (sometimes)"],"phonetic":"/ˈdɪksi/","extraExplanation":["“Dixie”常被认为与“Mason–Dixon line（梅森—迪克森线）”有关：这条线在历史上被用来象征美国北方与南方的分界，因此“Dixon”演变为更口语化的“Dixie”。","需要注意语感：在现代美国语境中，“Dixie”有时会让人联想到邦联、奴隶制和种族议题；有些人把它当作传统南方文化符号，也有人觉得它带有冒犯或不合时宜的历史负担。使用时应看场合与受众。","文学与文化中常见：例如歌曲《Dixie》在《乱世佳人》（Gone with the Wind）等作品或相关时代题材中常被提及/使用，用来营造“旧南方”的氛围。"]}
{"word":"Dixiecrat","summary":{"en":"A Dixiecrat was a Southern Democrat in 1948 who split from the Democratic Party to oppose federal civil-rights policies and support segregation.","zh":"Dixiecrat 指1948年从民主党分裂出来、反对联邦民权政策并支持种族隔离的南方民主党人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member or supporter of the Dixiecrats, a short-lived U.S. political movement (1948) of Southern Democrats who broke from the Democratic Party to oppose federal civil-rights policies and support racial segregation.","zh":"迪克西克拉特党（“南方民主党人”）成员或支持者：指1948年美国南方部分民主党人短暂分裂成的新政治派别，反对联邦民权政策并支持种族隔离。"},"examples":[{"en":"In 1948, some Southern Democrats became Dixiecrats after the party backed civil-rights measures.","zh":"1948年，民主党支持一些民权措施后，部分南方民主党人转而成为“迪克西克拉特党人”。"},{"en":"The term “Dixiecrat” is often used in history classes when discussing segregation-era politics.","zh":"在讨论种族隔离时期的政治时，历史课上常会用到“Dixiecrat”这个词。"}]}],"synonyms":["States’ Rights Democrat","States’ Rights Party supporter"],"phonetic":"/ˈdɪksiˌkræt/","extraExplanation":["“Dixiecrat”来自“Dixie（美国南方的俗称）+ Democrat（民主党人）”。该派别正式名称是“States’ Rights Democratic Party（州权民主党）”。","他们在1948年推出候选人斯特罗姆·瑟蒙德（Strom Thurmond），主张“州权”并反对联邦推动的民权改革；这一立场与维护种族隔离密切相关。","“Dixiecrat”如今多用于历史语境，带有明显的政治与种族议题色彩；在写作或讨论中需要注意语境与受众感受。"]}
{"word":"dixiecrat","summary":{"en":"A Dixiecrat was a Southern segregationist Democrat, especially associated with the 1948 States’ Rights Democratic Party.","zh":"Dixiecrat指主要与1948年“州权民主党”相关的南方民主党种族隔离主义者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member or supporter of the Dixiecrats, a short-lived political group (1948) of white Southern Democrats who opposed civil-rights policies and supported racial segregation","zh":"“迪克西克拉特党”（1948年短暂存在）的成员或支持者：一批主要来自美国南方的白人民主党人，反对民权政策并支持种族隔离"},"examples":[{"en":"Some Southern politicians ran as Dixiecrats in 1948 to protest the Democratic Party’s civil-rights platform.","zh":"1948年，一些南方政客以“迪克西克拉特党人”的身份参选，以抗议民主党支持民权的政纲。"},{"en":"Historians often cite the Dixiecrats as an early sign of the political realignment in the American South.","zh":"历史学家常把迪克西克拉特党人视为美国南方政治版图重新排列的早期信号。"}]}],"synonyms":["States’ Rights Democrat","segregationist (historical context)","Southern Democrat (historical context)"],"phonetic":"/ˈdɪksiˌkræt/","extraExplanation":["“Dixiecrat”是“Dixie（美国南方的俗称）+ Democrat（民主党人）”的合成词。该组织正式名称常译为“州权民主党”（States’ Rights Democratic Party）。","这一词与美国种族隔离历史密切相关，带有明确的政治与种族议题语境；在写作或讨论中通常用于历史/政治分析。","相关历史人物常被提及的有Strom Thurmond（斯特罗姆·瑟蒙德）。1948年他们推举他参选总统，以反对联邦层面的民权推进。"]}
{"word":"Dixiecratic","summary":{"en":"Dixiecratic means “connected with the Dixiecrats,” a 1948-era Southern breakaway group of Democrats opposing federal civil-rights efforts; it can also mean a supporter of that movement.","zh":"Dixiecratic 指“与迪克西克拉特派有关的”；迪克西克拉特派是1948年前后从美国南方民主党分裂出来、反对联邦民权政策的政治团体；也可指该派支持者。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Dixiecrats—a breakaway group of Southern Democrats in the U.S. (especially in 1948) who opposed federal civil-rights policies and supported racial segregation.","zh":"与“迪克西克拉特”（Dixiecrats）有关的——指美国南方民主党人在1948年前后分裂出来的团体，他们反对联邦民权政策并支持种族隔离。"},"examples":[{"en":"Some historians describe the 1948 campaign as a Dixiecratic revolt against Truman’s civil-rights proposals.","zh":"一些历史学家把1948年的竞选描述为对杜鲁门民权提案的“迪克西克拉特式”反叛。"},{"en":"The article traces how Dixiecratic politics shaped voting patterns in the Deep South.","zh":"这篇文章追溯了“迪克西克拉特式”的政治如何影响美国南方腹地的投票模式。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who supports or identifies with the Dixiecrats and their political stance.","zh":"支持或认同“迪克西克拉特”及其政治立场的人。"},"examples":[{"en":"In that election, a small number of Dixiecratics refused to back the national Democratic ticket.","zh":"在那次选举中，一小部分迪克西克拉特派拒绝支持全国民主党候选人组合。"},{"en":"He was labeled a Dixiecratic by opponents because of his strong states’ rights rhetoric.","zh":"由于他强烈鼓吹“州权”，对手给他贴上了“迪克西克拉特派”的标签。"}]}],"synonyms":["Dixiecrat (adj./n.)","States’ Rights Democratic (historical)","segregationist (context-dependent)"],"phonetic":"ˌdɪksiˈkrætɪk","extraExplanation":["“Dixiecrat”来自“Dixie（美国南方的俗称）+ Democrat（民主党人）”。最常指1948年成立的“州权民主党”（States’ Rights Democratic Party），候选人是斯特罗姆·瑟蒙德（Strom Thurmond）。","这个词带有明确的历史与价值判断色彩，常用于讨论美国种族隔离、民权运动与政党重组等议题；在现代语境中使用时，通常需要交代历史背景以避免误解。"]}
{"word":"Dixieland","summary":{"en":"Dixieland most commonly means a lively early jazz style from New Orleans; it can also mean the American South in a broader sense.","zh":"Dixieland最常指起源于新奥尔良的早期、节奏欢快的爵士风格；也可泛指美国南方地区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A style of early jazz music that developed in the southern U.S. (especially New Orleans), known for lively rhythm and group improvisation, often featuring trumpet/cornet, clarinet, and trombone.","zh":"迪克西兰爵士乐：一种起源于美国南部（尤其是新奥尔良）的早期爵士风格，以活泼节奏和集体即兴演奏为特色，常见乐器有小号（或短号）、单簧管和长号。"},"examples":[{"en":"We listened to a Dixieland band at the street festival.","zh":"我们在街头节日上听了一支迪克西兰爵士乐队演奏。"},{"en":"Dixieland jazz often sounds cheerful and energetic.","zh":"迪克西兰爵士通常听起来很欢快、有活力。"}]},{"partOfSpeech":"n.","definition":{"en":"A general (and sometimes old-fashioned) term for the American South.","zh":"（较笼统、带年代感的说法）美国南方地区。"},"examples":[{"en":"The story is set in Dixieland in the early 1900s.","zh":"故事背景设定在20世纪初的美国南方。"}]}],"synonyms":["traditional jazz","New Orleans jazz","the American South","the South"],"phonetic":"/ˈdɪksiˌlænd/","extraExplanation":["“Dixieland”与“Dixie”相关，常用来指美国南方文化意象；但在美国语境里，“Dixie”也可能让人联想到内战时期的邦联（Confederacy）及相关争议。因此在正式写作或敏感语境中，若只是表达“美国南方”，也可以用更中性的说法如 “the American South”。","音乐语境下，“Dixieland”通常指“traditional jazz（传统爵士）”或“New Orleans jazz（新奥尔良爵士）”的一类风格；常见曲目有《When the Saints Go Marching In》等。"]}
{"word":"dixieland","summary":{"en":"Dixieland most commonly refers to an early New Orleans jazz style; it can also mean the American South (sometimes with nostalgic overtones).","zh":"Dixieland最常指一种早期新奥尔良爵士风格；也可指美国南方（有时带怀旧色彩）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A style of early jazz, often played by small bands with lively, upbeat melodies and group improvisation; strongly associated with New Orleans.","zh":"一种早期爵士乐风格，常由小乐队演奏，旋律活泼明快，并常见合奏式即兴演奏；与新奥尔良密切相关。"},"examples":[{"en":"We listened to a Dixieland band at the New Orleans jazz festival.","zh":"我们在新奥尔良爵士节听了一支迪克西兰爵士乐队演出。"},{"en":"The clarinet and trumpet traded solos in a classic Dixieland sound.","zh":"单簧管和小号轮流独奏，呈现出典型的迪克西兰风格。"}]},{"partOfSpeech":"n.","definition":{"en":"A nickname for the Southern United States (especially the former Confederate states); sometimes used in a nostalgic way.","zh":"美国南方（尤指曾属于邦联的州）的别称；有时带有怀旧色彩。"},"examples":[{"en":"He wrote songs about life in Dixieland.","zh":"他写了些关于“迪克西兰”（美国南方）生活的歌曲。"},{"en":"The term “Dixieland” can sound old-fashioned or romantic in some contexts.","zh":"“Dixieland”这个词在某些语境里听起来有点旧式或带浪漫怀旧意味。"}]}],"synonyms":["traditional jazz","New Orleans jazz","the American South","the South"],"phonetic":"/ˈdɪksiˌlænd/","extraExplanation":["“Dixieland”里的“Dixie”常指美国南方，但这个称呼与美国内战、奴隶制历史等议题有复杂关联。在现代语境中，有些人会觉得它带有怀旧甚至美化旧南方的意味；谈到地域文化时可视场合改用更中性的说法，如“the American South”。","作为音乐术语时，“Dixieland jazz”通常较为中性，指20世纪早期的新奥尔良/传统爵士风格（常见小号、单簧管、长号等）。"]}
{"word":"Dixielander","summary":{"en":"A “Dixielander” is either a person from the U.S. South (“Dixie”) or a musician associated with Dixieland jazz.","zh":"“Dixielander”可指美国南方（Dixie）的人，也可指与迪克西兰爵士乐相关的乐手或人士。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person from the U.S. South (often called “Dixie”), especially in a traditional or old-fashioned sense","zh":"（传统或略带旧式说法）美国南方（“Dixie”地区）的人；南方人"},"examples":[{"en":"Her grandfather was a proud Dixielander who never missed a local parade.","zh":"她的祖父是个自豪的南方人，从不错过当地的游行。"},{"en":"The novel is set in Georgia and follows a young Dixielander during the Civil War era.","zh":"这部小说以佐治亚州为背景，讲述了一位年轻南方人在美国内战时期的经历。"}]},{"partOfSpeech":"n.","definition":{"en":"a musician who plays Dixieland jazz, or someone associated with Dixieland jazz culture","zh":"迪克西兰爵士乐（Dixieland jazz）的演奏者；与该爵士风格相关的人"},"examples":[{"en":"The band hired a Dixielander to add a classic New Orleans sound.","zh":"乐队请来一位迪克西兰爵士乐手，为音乐增添经典的新奥尔良风格。"},{"en":"He became known as a Dixielander after years of playing trumpet in jazz clubs.","zh":"他在爵士俱乐部吹了多年小号后，成了知名的迪克西兰爵士乐手。"}]}],"synonyms":["Southerner","Dixie native","Dixieland jazz musician","Dixieland player"],"phonetic":"/ˈdɪksiˌlændɚ/","extraExplanation":["“Dixie”常指美国南方，历史上与南北战争、邦联（Confederacy）等话题有关，因此在某些语境下可能带有政治与历史敏感性。现代英语中，描述“美国南方人”更中性常用的说法是“Southerner”。","“Dixieland”也是一种早期爵士乐风格，起源与新奥尔良密切相关；因此“Dixielander”在音乐语境里通常更中性，指演奏这种风格的人。"]}
{"word":"dixies","summary":{"en":"“Dixies” usually means the American South (plural of “Dixie”), and it can also mean disposable paper cups (plural of “Dixie cup”).","zh":"“Dixies”通常指美国南方（“Dixie”的复数），也可指一次性纸杯（“Dixie cup”的复数）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of “Dixie”) the southern United States, especially the states historically associated with the Confederacy; the American South (informal, sometimes sensitive).","zh":"（“Dixie”的复数）美国南方，尤指历史上与邦联（南北战争时期）相关的州；美国南部（非正式，用法有时较敏感）。"},"examples":[{"en":"Many traditional folk songs from the Dixies are still performed today.","zh":"许多来自美国南方（Dixies）的传统民谣至今仍在演出。"},{"en":"She grew up in the Dixies but moved north for college.","zh":"她在美国南方长大，但上大学时搬去了北方。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural of “Dixie cup”) disposable paper cups (from the brand name “Dixie,” often used as a generic term).","zh":"（“Dixie cup”的复数）一次性纸杯（源自品牌名“Dixie”，常被泛指为纸杯）。"},"examples":[{"en":"Please put some water out with a few Dixies for the guests.","zh":"请给客人准备些水，再放几个一次性纸杯（Dixies）。"},{"en":"They stocked up on Dixies for the picnic.","zh":"他们为野餐备了很多一次性纸杯。"}]}],"synonyms":["the South","the American South","Southern United States","Dixie cups","paper cups"],"phonetic":"/ˈdɪksi/","extraExplanation":["“Dixie”常被用来指“美国南方”，词源常与“Mason–Dixon Line（梅森—迪克森线）”相关：这条线历史上被视为南北分界的象征之一。","“Dixie”也与歌曲《Dixie》（19世纪中期流行）及邦联象征联系紧密，因此在一些语境中可能引发对奴隶制与种族历史的联想；写作或公开场合使用时要注意语气与受众。"]}
{"word":"Dixil","summary":{"en":"“Dixil” isn’t a common English dictionary word; it’s likely a name or a misspelling.","zh":"“Dixil”不是常见的英语词，可能是专有名词或拼写误写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most likely a proper name (e.g., a person/company/product) or a misspelling of another word.","zh":"不是常见的英语词；更可能是专有名词（人名/品牌/产品名等）或其他单词的拼写错误。"},"examples":[{"en":"I couldn’t find a dictionary definition for “Dixil,” so it may be a brand or a name.","zh":"我在词典里找不到“Dixil”的标准释义，所以它可能是品牌名或人名。"},{"en":"Could you share the sentence where you saw “Dixil”? Context can help identify what it means.","zh":"你能把看到“Dixil”的句子发出来吗？上下文有助于判断它的意思。"}]}],"phonetic":"ˈdɪksɪl","extraExplanation":["“Dixil”在常用英语词典中不常见。最常见的可能是拼写相近词：\n1) **dixit**（常见于学术/法律引文，来自拉丁语，意为“某某说过”）；\n2) **Dixie**（对美国南方的俗称，带历史与文化色彩，使用需注意语境）。\n如果你告诉我它出现的领域（药名/软件/游戏/书名/公司名）或给出原句，我可以更准确解释。"]}
{"word":"dixit","summary":{"en":"A “dixit” is an authoritative (often dogmatic) statement, or more rarely a quoted saying.","zh":"“dixit”指权威性的（常带武断意味的）说法；较少用时也可指引语/名言。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an authoritative statement or opinion, often accepted because it comes from an expert or powerful person (sometimes implying it is accepted without enough proof)","zh":"（权威人士的）武断断言；权威说法（常含“未经充分论证就被接受”的意味）"},"examples":[{"en":"The policy was followed as a dixit from the chairman, not as a result of debate.","zh":"这项政策被执行只是因为主席的权威说法，而不是讨论的结果。"},{"en":"In class, students shouldn’t treat the textbook as pure dixit; they should ask why.","zh":"在课堂上，学生不该把教材当作绝对权威的说法；他们应该追问理由。"}]},{"partOfSpeech":"n.","definition":{"en":"a quoted saying; the words someone is said to have spoken (formal or rare)","zh":"引语；据说某人讲过的话（正式或较少用）"},"examples":[{"en":"The article begins with a famous dixit attributed to the scientist.","zh":"这篇文章以一句据说出自那位科学家的名言开头。"}]}],"synonyms":["dogma","assertion","pronouncement","edict","maxim"],"phonetic":"/ˈdɪksɪt/","extraExplanation":["“dixit”来自拉丁语，意思是“他说/她说”（过去时）。在英语里常见于短语“ipse dixit”（意为“他自己说的”），用来讽刺或批评一种论证：仅因为权威人物说过，就被当作真理。"]}
{"word":"dixits","summary":{"en":"“Dixits” means authoritative statements (often unsupported) or, less commonly, commands.","zh":"“dixits”指（常无证据支撑的）权威式断言；较少见时也可指命令/指示。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"authoritative statements or pronouncements, especially ones given without proof or explanation","zh":"（常指缺乏证据或解释的）权威式断言；武断宣称"},"examples":[{"en":"The report was full of official dixits but offered little data.","zh":"这份报告满是官方式的断言，却几乎没有数据支撑。"},{"en":"Don’t accept his dixits—ask for evidence.","zh":"别轻信他的武断说法——要他拿出证据。"}]},{"partOfSpeech":"n.","definition":{"en":"orders or commands, especially from someone in authority (less common)","zh":"（较少见）命令；指示（尤指来自权威人士）"},"examples":[{"en":"Employees followed the manager’s dixits without question.","zh":"员工毫不质疑地执行经理的指示。"}]}],"synonyms":["pronouncements","assertions","dicta","decrees","edicts"],"phonetic":"/ˈdɪksɪts/","extraExplanation":["“dixit”源自拉丁语，字面意思是“他说”（he said）。英语里常见搭配是“ipse dixit”，意思是“他本人说的就算数”，用来批评某人只凭权威或身份下结论、不给理由。","“dixits”是“dixit”的复数形式，表示多条断言/多项指示。在现代英语中，这个词偏书面或学术语境。"]}
{"word":"Dixmont","summary":{"en":"Dixmont is mainly a French place name (a commune in Yonne, France), and it can occasionally be used as a surname.","zh":"Dixmont 主要是一个法语地名（法国约讷省的市镇），偶尔也可作姓氏。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A small commune (town/village) in the Yonne department of Bourgogne–Franche-Comté, north-central France.","zh":"法国中北部勃艮第-弗朗什-孔泰大区约讷省的一个小市镇（乡镇/村镇）。"},"examples":[{"en":"Dixmont is a commune in the Yonne department in France.","zh":"Dixmont 是法国约讷省的一个市镇。"},{"en":"She traced her family roots back to Dixmont.","zh":"她把家族根源追溯到 Dixmont。"}]},{"partOfSpeech":"other","definition":{"en":"A French place name that may also appear as a surname in some contexts.","zh":"一个法语地名；在某些语境中也可能作为姓氏出现。"},"examples":[{"en":"The document lists a witness named Dixmont.","zh":"文件中列出一位证人，姓 Dixmont。"}]}],"phonetic":"/diksˈmɑ̃/","extraExplanation":["“Dixmont”是法语地名，英文学术/新闻资料里通常按法语读法或近似读法来读。若你其实想查的是英语动词“dismount”（下马/下车/从…下来），拼写不同，但发音和字形容易被混淆。"]}
{"word":"Dixmoor","summary":{"en":"Dixmoor is the name of a village in Illinois, near Chicago.","zh":"Dixmoor 是美国伊利诺伊州、靠近芝加哥的一个村庄名称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A village in Cook County, Illinois, United States (in the Chicago metropolitan area).","zh":"美国伊利诺伊州库克县的一个村庄（位于芝加哥大都会区）。"},"examples":[{"en":"Dixmoor is a small village south of Chicago.","zh":"Dixmoor 是芝加哥以南的一个小村庄。"},{"en":"She works in Chicago but lives in Dixmoor.","zh":"她在芝加哥工作，但住在 Dixmoor。"}]}],"phonetic":"/ˈdɪksˌmʊr/","extraExplanation":["“Dixmoor”是专有名词（地名），通常不翻译；中文常直接音译或保留英文写法。","它属于芝加哥都会区的一部分，日常用法多出现在地址、新闻、通勤与地方行政等语境中。"]}
{"word":"Dixon","summary":{"en":"Dixon is most commonly a surname, and it can also be a given name or a place name.","zh":"Dixon 最常见是姓氏，也可作名字或地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), common in English-speaking countries","zh":"狄克森：常见于英语国家的姓氏"},"examples":[{"en":"My teacher’s last name is Dixon.","zh":"我老师的姓是 Dixon（狄克森）。"},{"en":"The article was written by Sarah Dixon.","zh":"这篇文章由 Sarah Dixon 撰写。"}]},{"partOfSpeech":"n.","definition":{"en":"a given name (first name), less common than the surname","zh":"狄克森：人名（名字），作为名较少见"},"examples":[{"en":"Dixon introduced himself at the meeting.","zh":"Dixon 在会议上做了自我介绍。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name used for several towns/cities (for example, Dixon, California in the U.S.)","zh":"狄克森：地名，可指多个城镇/城市（如美国加州的 Dixon）"},"examples":[{"en":"They drove through Dixon on their way to Sacramento.","zh":"他们去萨克拉门托的路上开车经过了 Dixon。"},{"en":"Dixon is a small city with a quiet downtown.","zh":"Dixon 是一座小城市，市中心很安静。"}]}],"phonetic":"/ˈdɪksən/","extraExplanation":["“Dixon”在美国文化中常让人联想到“Mason–Dixon Line（梅森—狄克森线）”，这是18世纪测量出的边界线，后来常被用来象征美国南北方的分界。","有些品牌或机构名字里也会出现Dixon（例如铅笔品牌“Dixon Ticonderoga”），但它们通常是专有名词，不改变拼写。"]}
{"word":"Dixonville","summary":{"en":"Dixonville is mainly a U.S. place name used for several small communities.","zh":"Dixonville 主要是美国的地名，用于几个小型社区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name in the U.S. (used for several small communities, such as Dixonville, Pennsylvania; also used for local areas in some other states)","zh":"美国的地名（用于几个小型社区，例如宾夕法尼亚州的 Dixonville；在其他州也可能有同名地点）"},"examples":[{"en":"She grew up near Dixonville, Pennsylvania.","zh":"她在宾夕法尼亚州 Dixonville 附近长大。"},{"en":"Dixonville is a small place, so services can be spread out.","zh":"Dixonville 是个小地方，所以各种服务点可能比较分散。"}]},{"partOfSpeech":"other","definition":{"en":"a proper noun used as a location label in addresses, maps, or local organizations","zh":"作为专有名词，用于地址、地图或本地机构名称中的地点标识"},"examples":[{"en":"The package was sent to Dixonville, PA 15734.","zh":"包裹寄到了宾夕法尼亚州 Dixonville，邮编 15734。"},{"en":"He volunteers with a Dixonville community group.","zh":"他在一个 Dixonville 的社区团体做志愿者。"}]}],"phonetic":"/ˈdɪksənˌvɪl/","extraExplanation":["“Dixonville”通常不是常见词汇，而是地名（专有名词）。因为美国可能存在多个同名地点，理解时最好结合州名/邮编/县名（例如 “Dixonville, PA”）来确认具体指哪里。","构词上可拆为 “Dixon + -ville”。“-ville” 源自法语，常见于英语地名，表示“城镇/聚落”。"]}
{"word":"dixy","summary":{"en":"“Dixy” is usually a misspelling of “Dixie,” a nickname for the Southern United States, sometimes used as an adjective meaning “Southern.”","zh":"“dixy”通常是“Dixie”的拼写错误；“Dixie”是美国南方的昵称，也可作形容词表示“南方的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A nickname for the Southern United States, especially the states that were once part of the Confederacy.","zh":"（专有名词）美国南方地区的昵称，尤其指曾属于南部邦联（Confederacy）的州。"},"examples":[{"en":"They grew up in Dixie and later moved to New York.","zh":"他们在美国南方（Dixie）长大，后来搬去了纽约。"},{"en":"The book explores music traditions in Dixie.","zh":"这本书探讨了美国南方地区的音乐传统。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Adjective, often capitalized) Related to the Southern U.S.; Southern.","zh":"（形容词，常大写）与美国南方有关的；南方的。"},"examples":[{"en":"He has a strong Dixie accent.","zh":"他有很浓的美国南方口音。"},{"en":"They served classic Dixie food at the festival.","zh":"节日上他们供应了经典的南方食物。"}]},{"partOfSpeech":"other","definition":{"en":"A common misspelling of “Dixie.”","zh":"“Dixie”的常见拼写错误。"},"examples":[{"en":"Did you mean “Dixie” (D-I-X-I-E)?","zh":"你是不是想写“Dixie”（D-I-X-I-E）？"}]}],"synonyms":["the South","the Southern U.S.","Southern"],"phonetic":"/ˈdɪksi/","extraExplanation":["“Dixie”在美国文化中有时带有历史与政治敏感性，因为它常与南部邦联、内战历史以及后来对邦联符号的争议联系在一起。有些人把它当作地域文化称呼（如音乐、饮食），也有人会因其历史联想而避免使用。具体语境很重要。","著名歌曲《Dixie》（19世纪中期流行）曾被视为南方象征之一，因此在影视、文学或音乐语境里也会出现。"]}
