{"word":"DIY","summary":{"en":"DIY means doing projects yourself instead of hiring someone, often for home repair, crafts, or building.","zh":"DIY指不请他人、自己动手完成项目，常见于家装维修、手工制作或搭建等。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"to make, repair, or decorate something yourself instead of paying a professional","zh":"（不请专业人士）自己动手制作、修理或装饰"},"examples":[{"en":"I’m doing a DIY bookshelf this weekend.","zh":"我这周末要自己动手做一个书架。"},{"en":"DIY home repairs can save money, but be careful with electricity.","zh":"自己动手修房子可以省钱，但碰到电路要小心。"}]},{"partOfSpeech":"n.","definition":{"en":"the activity or hobby of making, building, or fixing things yourself","zh":"自己动手制作/修理的活动；手工改造（爱好）"},"examples":[{"en":"DIY is popular with people who enjoy working with their hands.","zh":"喜欢动手的人当中，DIY很受欢迎。"},{"en":"She learned basic DIY from online videos.","zh":"她通过网课视频学会了一些基础的DIY。"}]}],"synonyms":["do-it-yourself","homemade","self-made","handmade"],"phonetic":"/ˌdiː.aɪˈwaɪ/","extraExplanation":["“DIY”是“do-it-yourself”的缩写，常见于家居装修（DIY home improvement）、手工艺（DIY crafts）、电子/改装（DIY electronics）等领域。","在北美口语里也常说“a DIY project”（一个DIY项目）或“DIY it”（自己弄）。"]}
{"word":"Diya","summary":{"en":"Diya most commonly means a small South Asian oil lamp, and it is also used as a personal name.","zh":"Diya 最常指南亚的陶制小油灯，也可作为人名使用。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small oil lamp (often made of clay) used in South Asia, especially during festivals and religious ceremonies","zh":"（南亚常见的）小油灯、陶灯；常用于节日与宗教仪式"},"examples":[{"en":"We lit diyas around the house for Diwali.","zh":"排灯节时，我们在房子周围点起了许多陶灯（diyas）。"},{"en":"She placed a diya by the doorway as a welcome sign.","zh":"她在门口放了一盏陶灯，表示欢迎。"}]},{"partOfSpeech":"n.","definition":{"en":"a given name (used for girls and sometimes boys), common in India and nearby regions","zh":"名字（常见于印度及周边地区，多用于女孩，也可用于男孩）"},"examples":[{"en":"Diya is named after the lamp symbolizing light.","zh":"Diya 这个名字取自象征光明的灯。"},{"en":"Diya introduced herself to the class.","zh":"Diya 向全班做了自我介绍。"}]}],"synonyms":["oil lamp","clay lamp"],"phonetic":"/ˈdiːjə/","extraExplanation":["“Diya（陶灯）”在印度文化中常象征光明战胜黑暗、善战胜恶。排灯节（Diwali）期间，人们会点亮很多 diya 来庆祝与祈福。","英语里也常写作 diyaa / diya lamp；当作外来词使用时，通常不翻译，但在解释时会说“a small clay oil lamp”。"]}
{"word":"Diyarbakir","summary":{"en":"Diyarbakır is a major city in southeastern Turkey, known for its historic walls and rich multicultural heritage.","zh":"迪亚巴克尔是土耳其东南部的重要城市，以历史城墙和多元文化遗产著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large city in southeastern Turkey, known for its historic black basalt city walls and as a major cultural center for Kurds in Turkey.","zh":"土耳其东南部的一座大城市，以黑色玄武岩城墙等历史遗迹闻名，也是土耳其库尔德文化的重要中心之一。"},"examples":[{"en":"Diyarbakır is famous for its ancient city walls made of black basalt.","zh":"迪亚巴克尔以黑色玄武岩建成的古城墙而闻名。"},{"en":"She traveled to Diyarbakır to learn more about Kurdish culture and local history.","zh":"她去迪亚巴克尔旅行，想更多了解库尔德文化和当地历史。"}]}],"synonyms":["Diyarbakır (also spelled Diyarbakir)"],"phonetic":"/ˌdiːjɑːrˈbɑːkɪr/","extraExplanation":["“Diyarbakır”在土耳其语中常被解释为“迪亚尔（Diyar）+巴克尔（bakır，铜）”，有“铜之地/铜的地区”之意（带有历史与民间语源色彩）。","这座城市在历史上非常重要，罗马、拜占庭以及伊斯兰诸帝国时期都有深厚遗产；其城墙与城门被认为是中东地区保存较好的城市防御体系之一。","在一些语境中你也可能看到它的库尔德语名称“Amêd/Amed”。在讨论政治、族群与文化议题时，名称选择可能带有身份与立场意味，写作时可依据场合采用更中性的表述或加注说明。"]}
{"word":"Diyarbekir","summary":{"en":"Diyarbekir is an older spelling of Diyarbakır, a major city in southeastern Turkey.","zh":"Diyarbekir 是 Diyarbakır（土耳其东南部重镇）的一种旧拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(also spelled Diyarbakır) A large city in southeastern Turkey, historically an important cultural and regional center.","zh":"（亦拼作 Diyarbakır）土耳其东南部的一座大城市，历史上是重要的区域与文化中心。"},"examples":[{"en":"Diyarbekir (Diyarbakır) is known for its massive black basalt city walls.","zh":"Diyarbekir（Diyarbakır）以其巨大的黑色玄武岩城墙而闻名。"},{"en":"Many historical accounts mention Diyarbekir as a key city in Upper Mesopotamia.","zh":"许多历史记载提到 Diyarbekir 是上美索不达米亚地区的重要城市。"}]}],"synonyms":["Diyarbakır"],"phonetic":"/diˌjɑr.bəˈkɪr/","extraExplanation":["“Diyarbekir”是英语/历史文献中较常见的旧拼写；现代土耳其语标准写法为“Diyarbakır”（含土耳其语字母“ı”，不带点）。","该地位于底格里斯河（Tigris）流域附近，历史上在不同帝国与族群的统治与迁徙中频繁出现，因此在历史、旅行写作与学术著作里常见到不同拼写。","在阅读旧书或历史资料时，看到“Diyarbekir”通常可以直接对应到今天地图上的“Diyarbakır”。"]}
{"word":"Diyari","summary":{"en":"Diyari refers to an Aboriginal people of South Australia and their traditional language.","zh":"Diyari 指南澳大利亚的迪亚里原住民族群及其传统语言（迪亚里语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an Aboriginal Australian people of South Australia, traditionally from the area around Cooper Creek and nearby regions.","zh":"迪亚里人：澳大利亚原住民群体之一，传统上居住在南澳大利亚的库珀溪（Cooper Creek）及周边地区。"},"examples":[{"en":"The Diyari are one of the Aboriginal peoples of South Australia.","zh":"迪亚里人是南澳大利亚的原住民群体之一。"},{"en":"Researchers recorded stories and songs from Diyari elders.","zh":"研究者记录了迪亚里长者的故事与歌谣。"}]},{"partOfSpeech":"n.","definition":{"en":"the traditional language spoken by the Diyari people (often called the Diyari language).","zh":"迪亚里语：迪亚里人传统使用的语言。"},"examples":[{"en":"Diyari is studied in Australian linguistics and Aboriginal language programs.","zh":"在澳大利亚语言学与原住民语言项目中，人们会研究迪亚里语。"},{"en":"Some community projects work to support the learning of Diyari.","zh":"一些社区项目致力于支持迪亚里语的学习与传承。"}]}],"synonyms":["Dieri (variant spelling)"],"phonetic":"/diˈjɑri/","extraExplanation":["“Diyari”常见于人类学、语言学与澳大利亚原住民研究语境中，既可指“族群”，也可指“语言”，需要根据上下文判断。","在英文资料里也可能见到不同拼写（如 Dieri 等），多与早期记录方式、转写系统差异有关；现代用法通常更尊重社群自称与当代拼写。","涉及原住民族群与语言时，写作中常使用更具体、尊重的表达（如 “the Diyari people / the Diyari language”），并注意来源与语境。"]}
{"word":"DIYer","summary":{"en":"A DIYer is someone who prefers to make or fix things themselves rather than hiring a professional.","zh":"DIYer指喜欢自己动手制作或维修东西、而不是请专业人士的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who does home repairs, crafts, or projects by themselves instead of paying a professional","zh":"自己动手做家居维修、手工或各种项目的人（不请专业人士）"},"examples":[{"en":"As a DIYer, she built her own bookshelf from scratch.","zh":"作为一个DIY爱好者，她从零开始做了一个书架。"},{"en":"Many DIYers watch online tutorials before fixing a leaking faucet.","zh":"很多DIY玩家会先看线上教程，再去修漏水的水龙头。"}]}],"synonyms":["do-it-yourselfer","home improver","maker"],"phonetic":"/ˌdiː.aɪˈwaɪ.ər/","extraExplanation":["“DIYer”来自DIY（do-it-yourself，自己动手做）+ -er（表示“做某事的人”）。常见于日常口语和社交媒体，也常写作“DIY-er”。","语气通常是中性或偏积极，暗示动手能力强、爱学习、省钱或享受自己完成项目的成就感。","相关词：DIY（名词/形容词）、do-it-yourself（形容词）、handy（adj. 手巧的）、home improvement（家装/家居改造）。"]}

