{"word":"dizain","summary":{"en":"Dizain most commonly means a ten-line poem or stanza; less commonly, it can mean a set of ten items.","zh":"dizain 最常指“十行诗/十行诗节”；较少见时也可指“十个一组”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A poem or stanza of ten lines, often with a set rhyme pattern.","zh":"十行诗（或十行诗节）；通常有固定的押韵格式。"},"examples":[{"en":"She wrote a dizain to describe the quiet of winter mornings.","zh":"她写了一首十行诗来描写冬日清晨的宁静。"},{"en":"In class, we compared a sonnet (14 lines) with a dizain (10 lines).","zh":"课堂上，我们比较了十四行诗（14行）和十行诗（10行）。"}]},{"partOfSpeech":"n.","definition":{"en":"A group or set of ten items (less common usage).","zh":"十个一组；十件一套（较少见的用法）。"},"examples":[{"en":"The old text mentions a dizain of candles used in the ceremony.","zh":"那本旧文献提到仪式中使用了一组十支蜡烛。"}]}],"synonyms":["ten-line stanza","decastich"],"phonetic":"/dɪˈzeɪn/","extraExplanation":["词源来自法语 dizaine（“十个、一组十个”），与 Latin/法语中表示“十”的词根相关。英语里它多用于诗歌术语，指“十行的诗节/短诗”。","在英语诗歌传统中，dizain 不是像 sonnet 那样人人熟悉的固定体裁，但在文艺复兴时期及后来的仿法诗体中会出现；常见搭配是 “a dizain stanza”（十行诗节）。"]}
{"word":"dizaine","summary":{"en":"Dizaine means a group of ten, and it can also mean a ten-line French-style stanza/poem.","zh":"dizaine 指“一组十个”，也可指法语传统中的“十行诗节/十行短诗”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group or set of ten things; a “tenner.”","zh":"一组（或一套）十个；“十个一份”。"},"examples":[{"en":"The shells were sold in a dizaine at the market.","zh":"这些贝壳在市场上按十个一份出售。"},{"en":"She counted the buttons in dizaines to keep track quickly.","zh":"她把纽扣按十个一组来数，方便快速统计。"}]},{"partOfSpeech":"n.","definition":{"en":"(literature, especially French) a ten-line stanza or short poem consisting of ten lines.","zh":"（文学用语，尤指法语传统）十行诗节；由十行组成的短诗/诗节。"},"examples":[{"en":"The poem is written as a dizaine, with ten carefully patterned lines.","zh":"这首诗写成了“十行诗”的形式，十行结构安排得很讲究。"},{"en":"In class we compared a sonnet to a French dizaine.","zh":"课堂上我们把十四行诗和法语的十行诗节作了比较。"}]}],"synonyms":["group of ten","set of ten","ten (as a set)","tenner","decade (sometimes, but not always exact in style)"],"phonetic":"/dɪˈzeɪn/","extraExplanation":["“dizaine”源自法语，字面意思是“十个一组/十来个”。在现代英语里比较少见，更多出现在讨论法国诗歌形式或带法语风格的写作中。","发音上常见的英语读法接近“di-ZAYN”，重音在后半部分。"]}
{"word":"dizdar","summary":{"en":"Dizdar is a historical term for an Ottoman fortress or castle commander/keeper.","zh":"Dizdar 是一个历史用语，指奥斯曼帝国时期的要塞/城堡指挥官或守卫官。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A commander or keeper of a fortress or castle, especially in the Ottoman Empire.","zh":"（历史）城堡/要塞的指挥官或守卫官，尤指奥斯曼帝国时期的要塞官。"},"examples":[{"en":"In Ottoman records, the dizdar was responsible for guarding the fortress and its weapons.","zh":"在奥斯曼帝国的档案中，dizdar 负责守卫要塞及其武器。"},{"en":"The traveler wrote that the dizdar controlled who could enter the castle gates.","zh":"这位旅行者写道，dizdar 掌管谁可以进入城堡大门。"}]}],"synonyms":["castellan","fortress commander","governor (of a fortress)"],"phonetic":"ˈdɪzˌdɑr","extraExplanation":["该词常见于巴尔干与奥斯曼历史语境。通常指一座要塞的驻防长官，职责可包括防务、军械管理与城门出入管控等。","词源上常被认为与土耳其语（奥斯曼土耳其语）有关，亦可能受波斯语词形影响；英语中多见于历史研究、旅行记或地区史料译文。"]}
{"word":"dizen","summary":{"en":"Dizen means (in older/literary English) to dress up or decorate, often in a showy or excessive way.","zh":"dizen 是较古老/文学性的词，表示给……打扮或装饰，常暗含“花哨、过度”的意思。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Archaic) To dress up or decorate (someone or something), often in an excessive or showy way.","zh":"（古语）给……打扮/装饰（常带“过分、花哨”的意味）。"},"examples":[{"en":"She was dizened in ribbons and lace for the parade.","zh":"为了游行，她被用丝带和蕾丝打扮得花里胡哨。"},{"en":"The room was dizened with cheap ornaments.","zh":"房间里堆满了廉价装饰品，显得俗气。"}]},{"partOfSpeech":"vt.","definition":{"en":"To make something look more attractive by adding decorations; to bedeck.","zh":"用装饰让……看起来更漂亮；点缀。"},"examples":[{"en":"They dizened the hall with flowers before the ceremony.","zh":"仪式前他们用花把大厅装点起来。"},{"en":"A tree dizened with lights stood by the window.","zh":"窗边立着一棵挂满灯饰的树。"}]}],"synonyms":["dress up","decorate","adorn","bedeck","bedizen"],"phonetic":"/ˈdaɪzən/","extraExplanation":["“dizen”在现代英语中很少用，更多见于文学或带复古语感的写作；日常表达通常用“dress up / decorate / adorn”。","语气上常带轻微贬义：暗示装饰得过多、显得俗艳（showy/tawdry）。"]}
{"word":"dizened","summary":{"en":"Dizened means showily dressed up or decorated, often in a cheap or tasteless way.","zh":"dizened 指打扮或装饰得花哨，常带廉价、俗气的感觉。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"dressed up in a showy, often cheap or tasteless way; overly decorated","zh":"（常指）打扮得花哨但廉价/俗气的；过度装饰的"},"examples":[{"en":"She arrived in a dizened hat covered with feathers and glitter.","zh":"她戴着一顶缀满羽毛和亮片的俗艳帽子来到现场。"},{"en":"The room looked dizened with too many ornaments on every shelf.","zh":"房间里每个架子都摆满装饰品，显得过度装点、很花哨。"}]}],"synonyms":["gaudy","tawdry","tacky","overdecorated","flashy"],"phonetic":"/ˈdɪzənd/","extraExplanation":["“dizened”来自动词“to dizen”（给……打扮/装饰），常带贬义：不是“精致优雅”的打扮，而是“用力过猛、看起来廉价或俗气”的装饰。","语体上偏书面或文学描写，日常口语里更常用的表达有“overdressed”“gaudy”“tacky”。"]}
{"word":"dizening","summary":{"en":"Dizzying means causing dizziness or being so rapid/high/intense that it feels overwhelming.","zh":"Dizzying 指“使人头晕的”，也可形容“快得/高得/强烈到令人应接不暇的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Making you feel as if everything is spinning, or causing loss of balance; dizzy.","zh":"使人头晕的；让人感觉天旋地转的。"},"examples":[{"en":"The spinning ride was dizzying, so I had to sit down afterward.","zh":"那个旋转项目太让人头晕了，所以结束后我得坐下来休息。"},{"en":"The heat and lack of water became dizzying by noon.","zh":"到中午时，炎热和缺水让人开始头晕。"}]},{"partOfSpeech":"adj.","definition":{"en":"So fast, high, or complex that it feels overwhelming or hard to keep up with.","zh":"（速度/高度/信息量）快得/高得/复杂得让人应接不暇的；令人目眩的。"},"examples":[{"en":"She achieved dizzying success in just a few years.","zh":"她在短短几年内就取得了令人目眩的成功。"},{"en":"The stock price rose at a dizzying speed.","zh":"股价以令人目眩的速度上涨。"},{"en":"We climbed to a dizzying height and could see the whole city.","zh":"我们爬到一个令人眩晕的高度，可以俯瞰整座城市。"}]}],"synonyms":["disorienting","vertiginous","overwhelming","rapid","staggering"],"phonetic":"/ˈdɪziɪŋ/","extraExplanation":["你输入的“dizening”更常见的拼写是 **dizzying**（来自动词 *dizzy* + -ing）。如果你想表达“让人头晕/目眩”的意思，建议用 **dizzying**。"]}
{"word":"dizenment","summary":{"en":"“dizenment” isn’t a standard word; you likely mean “disenchantment” (loss of belief/admiration).","zh":"“dizenment” 不是标准单词；你可能想写 “disenchantment”（幻灭、失去信心/崇拜）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Nonstandard spelling) “dizenment” is not a recognized English word. It is most likely a misspelling of “disenchantment,” meaning the feeling of losing belief in something you once admired or trusted.","zh":"（非标准拼写）“dizenment” 不是规范英语单词。它很可能是 “disenchantment” 的拼写错误，意思是对曾经崇拜或信任的事物失去幻想/信心的感觉。"},"examples":[{"en":"I couldn’t find “dizenment” in a dictionary—did you mean “disenchantment”?","zh":"我在词典里找不到“dizenment”——你是不是想写“disenchantment”？"},{"en":"After the scandal, many people felt disenchantment with the leader.","zh":"丑闻之后，很多人对那位领导产生了幻灭感/失望感。"}]}],"synonyms":["disillusionment","disappointment","disaffection","letdown"],"phonetic":"/ˌdɪsɪnˈtʃæntmənt/","extraExplanation":["“disenchantment” 常用于谈论：对政治、制度、偶像、工作、爱情等“从幻想到清醒”的心理变化，语气通常比一般的 disappointment（失望）更深，带有“原来我被骗了/想错了”的感觉。","如果你能提供一句包含 “dizenment” 的原句（或你想表达的中文意思），我也可以更准确地判断你要找的词是否是 “dismantlement / disenchantment / dizziness”等。"]}
{"word":"dizens","summary":{"en":"“Dizens” is a rare/archaic form of “dizen,” meaning to dress up or decorate something in a showy way.","zh":"“dizens”是罕见/古语形式，来自“dizen”，意思是把人打扮得花哨或装饰点缀某物。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Archaic) to dress someone up or make something look fancy, often with showy decorations.","zh":"（古语）给某人打扮；把某物装饰得很花哨、很醒目。"},"examples":[{"en":"The actor was dizened in bright ribbons for the parade.","zh":"游行时，那位演员被打扮得系满了鲜亮的丝带。"},{"en":"The old boat was dizened with flags to welcome the visitors.","zh":"那艘旧船挂满旗子作为装饰来欢迎来访者。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Less common) to adorn or embellish something; to decorate.","zh":"（较少见）装饰；点缀。"},"examples":[{"en":"Shop windows were dizened for the holidays.","zh":"商店橱窗为节日做了装饰。"},{"en":"She dizened the room with wildflowers from the field.","zh":"她用田野里的野花点缀了房间。"}]}],"synonyms":["adorn","decorate","embellish","deck out"],"phonetic":"/ˈdaɪzən/","extraExplanation":["“dizens”通常是动词“dizen”的第三人称单数（he/she dizens）或非常少见的复数形式；在现代英语中这个词很少使用，多见于文学或历史语境。","学习时要注意它很容易与“dozens”（许多、几十个）混淆：dozen /ˈdʌzən/，dozens = many; dizen /ˈdaɪzən/，dizen = dress up/decorate。"]}
{"word":"Dizney","summary":{"en":"Disney: a famous American entertainment brand/company; also the surname of its founder, Walt Disney.","zh":"Disney：著名的美国娱乐品牌/公司；也可指其创办者华特·迪士尼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Disney (often misspelled as “Dizney”): the name of a major American entertainment company and brand known for animated films, theme parks, and characters like Mickey Mouse.","zh":"迪士尼（常被误拼为“Dizney”）：美国著名的娱乐公司与品牌，以动画电影、主题乐园及米老鼠等角色闻名。"},"examples":[{"en":"We watched a Disney movie after dinner.","zh":"晚饭后我们看了一部迪士尼电影。"},{"en":"They’re planning a trip to Disney World.","zh":"他们正计划去迪士尼世界旅行。"}]},{"partOfSpeech":"n.","definition":{"en":"Walt Disney: the American filmmaker and entrepreneur who co-founded the Disney company and helped shape modern animation.","zh":"华特·迪士尼：美国电影人和企业家，迪士尼公司的联合创办者，对现代动画发展影响深远。"},"examples":[{"en":"Walt Disney created Mickey Mouse with his team.","zh":"华特·迪士尼和他的团队一起创作了米老鼠。"}]}],"synonyms":["The Walt Disney Company","Disney World","Disneyland"],"phonetic":"/ˈdɪzni/","extraExplanation":["“Dizney”不是标准拼写；正确写法是“Disney”。在英文里它是专有名词，通常首字母大写：Disney。","“Disney”也常作形容词用在口语中（更准确说是名词作定语），如“a Disney princess / Disney music”，表示“迪士尼风格/出自迪士尼”。拼写在正式写作中很重要，因为它是品牌名（商标）。"]}
{"word":"dizoic","summary":{"en":"Dizoic describes an organism—especially a parasite—that lives in or depends on two different animal hosts during its life cycle.","zh":"dizoic 指（尤指寄生生物）在生命周期中需要或依赖两种不同动物宿主的类型。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(biology) Living in or on two different animals (hosts) during its life cycle; requiring two hosts.","zh":"（生物）在生命周期中寄生或生活于两种不同动物（宿主）上；需要两个宿主完成生活史。"},"examples":[{"en":"The parasite is dizoic, developing in a snail first and later in a fish.","zh":"这种寄生虫是二宿主型的，先在蜗牛体内发育，之后再转到鱼体内。"},{"en":"Some dizoic worms alternate between an intermediate host and a final host.","zh":"一些二宿主型蠕虫会在中间宿主与终宿主之间交替生活。"}]}],"synonyms":["heteroxenous","digenetic","two-host"],"phonetic":"/daɪˈzoʊɪk/","extraExplanation":["词源上可拆为 di-（“二、两个”）+ -zoic（与动物生命有关，来自希腊语 zōion “动物”）。","该词较少见，更常见的近义术语是 heteroxenous（异宿主的）或 digenetic（需要两个宿主/两阶段宿主的，具体用法取决于学科与作者）。"]}
{"word":"dizygotic","summary":{"en":"Dizygotic means fraternal—twins from two separate fertilized eggs.","zh":"dizygotic 指“二卵/异卵”的：由两个分别受精的卵子发育而成的（fraternal）双胞胎。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of twins) developing from two separate eggs (two zygotes) fertilized at the same time; also called fraternal.","zh":"（双胞胎）由两个不同的卵子（两个合子）在同一次妊娠中分别受精并发育而成的；也称为“异卵/二卵（双胞胎）”，即“fraternal”双胞胎。"},"examples":[{"en":"Dizygotic twins can be the same sex or different sexes.","zh":"二卵（异卵）双胞胎可能是同性别，也可能是不同性别。"},{"en":"Unlike identical twins, dizygotic twins do not share exactly the same genes.","zh":"与同卵（identical）双胞胎不同，二卵（异卵）双胞胎并不拥有完全相同的基因。"}]}],"synonyms":["fraternal (twins)","non-identical (twins)","binovular (twins)"],"phonetic":"/ˌdaɪzəˈdʒɑtɪk/","extraExplanation":["词源小提示：di- 表示“二/两个”，zygote 表示“合子（受精卵）”。所以 dizygotic 字面意思就是“两个合子形成的”。","对比记忆：monozygotic = 同卵/同合子（identical twins，同一个受精卵分裂）；dizygotic = 异卵/二合子（fraternal twins，两个卵子分别受精）。","常见搭配：dizygotic twins（二卵双胞胎）、dizygotic pregnancy（二卵妊娠）。在日常英语里，医生和大众更常说 fraternal twins。"]}
{"word":"dizygous","summary":{"en":"Dizygous means formed from two separate fertilized eggs, especially describing fraternal (non-identical) twins.","zh":"Dizygous 指由两个分别受精的卵形成的，常用于描述异卵（非同卵）双胞胎。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Genetics/biology) Formed from two separate fertilized eggs; not from the same zygote. Commonly used to describe fraternal (non-identical) twins.","zh":"（遗传学/生物学）由两个分别受精的卵形成的；不是由同一个合子形成的。常用来形容异卵（非同卵）双胞胎。"},"examples":[{"en":"Dizygous twins usually share about 50% of their genes, like ordinary siblings.","zh":"异卵双胞胎通常共享大约50%的基因，和普通兄弟姐妹差不多。"},{"en":"The study compared dizygous and monozygous twins to separate genetic and environmental effects.","zh":"该研究比较了异卵和同卵双胞胎，以区分遗传与环境的影响。"}]},{"partOfSpeech":"adj.","definition":{"en":"Relating to the production of two zygotes, especially in the context of multiple pregnancy.","zh":"与产生两个合子有关的（尤指多胎妊娠的语境中）。"},"examples":[{"en":"A dizygous pregnancy can occur when two eggs are released and fertilized in the same cycle.","zh":"当同一周期排出两个卵子并分别受精时，可能出现异卵妊娠。"}]}],"synonyms":["fraternal (twins)","non-identical (twins)","binovular (twins)"],"phonetic":"/daɪˈzaɪɡəs/","extraExplanation":["“di-”表示“二、双”，“zygous”来自“zygote（合子）”。因此 dizygous 字面意思就是“两个合子形成的”。","日常英语里更常见的说法是 fraternal twins（异卵双胞胎）；在医学、遗传学论文或检测报告中更常用 dizygous（与 monozygous“同卵”相对）。"]}
{"word":"dizz","summary":{"en":"“Dizz” is an informal/rare spelling of “dizzy” (feeling lightheaded or spinning).","zh":"“dizz”是“dizzy（头晕、眩晕）”的非正式/少见拼写，正式场合建议用“dizzy”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"informal spelling/short form of “dizzy”; feeling like your head is spinning or that you might lose balance.","zh":"“dizzy（头晕的）”的非正式拼写/缩写；感觉天旋地转、站不稳。"},"examples":[{"en":"I stood up too fast and felt dizz for a moment.","zh":"我起身太快，一下子有点头晕。"},{"en":"That ride made me dizz.","zh":"那个游乐设施把我转得头晕。"}]}],"synonyms":["dizzy","lightheaded","giddy"],"phonetic":"/ˈdɪzi/","extraExplanation":["“dizz”并不是标准拼写，更常见、最推荐的写法是“dizzy”。在正式写作、考试或工作邮件中请用“dizzy”。","如果你想表达“嘲讽/贬低某人”，英语里常用的是“diss”（来自 disrespect），不是“dizz”。"]}
{"word":"dizzard","summary":{"en":"“Dizzard” is a dialect spelling of “gizzard,” meaning a bird’s muscular stomach (often chicken gizzards as food).","zh":"“dizzard”多为“gizzard”的方言拼写，指鸟类的砂囊/鸡胗，常指作为食物的鸡胗。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Dialect, nonstandard) A gizzard (the muscular part of a bird’s stomach, especially a chicken’s).","zh":"（方言/非标准用法）砂囊；鸡胗（鸟类胃部用来磨碎食物的肌肉部分，尤指鸡的）。"},"examples":[{"en":"In some Southern recipes, people fry chicken dizzards with onions.","zh":"在一些美国南方食谱里，人们会把鸡胗（dizzards）和洋葱一起油炸。"},{"en":"He ordered a basket of fried dizzards at the diner.","zh":"他在小餐馆点了一篮炸鸡胗。"}]}],"synonyms":["gizzard"],"phonetic":"/ˈdɪzərd/","extraExplanation":["“dizzard”多见于口语或地区拼写（尤其在美国南方一些地方），标准拼写通常是“gizzard”。写作或正式场合更建议用“gizzard”。"]}
{"word":"dizzardly","summary":{"en":"“dizzardly” is not standard; it’s probably meant to be “dizzily” (in a dizzy or confused way).","zh":"“dizzardly” 不是标准拼写；多半想表达 “dizzily”（眩晕地/迷糊地）。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"(Nonstandard) Likely a misspelling of “dizzily,” meaning in a way that shows dizziness or confusion; with a spinning, unsteady feeling.","zh":"（非标准用法）很可能是 “dizzily” 的拼写错误，意思是“眩晕地；头昏眼花地；迷迷糊糊地”，带有天旋地转、不稳或困惑的感觉。"},"examples":[{"en":"After the ride, she walked dizzily toward the bench.","zh":"坐完那个项目后，她头晕晕地走向长椅。"},{"en":"He looked around dizzily, trying to find the right door.","zh":"他迷迷糊糊地环顾四周，努力找对门。"}]}],"synonyms":["dizzily","unsteadily","groggily","lightheadedly"],"phonetic":"/ˈdɪzəli/","extraExplanation":["“dizzardly” 不是常见或标准的英文单词。你可能想写的是：\n- **dizzily**（更常用，表示“眩晕地/摇摇晃晃地”）\n- **dizzyingly**（更强调“令人眩晕地/令人眼花缭乱地”，常用于夸张表达，如 *dizzyingly tall* “高得让人眩晕”）\n如果你告诉我句子原文，我可以帮你判断最合适的词。"]}
{"word":"dizzen","summary":{"en":"Dizzen (also spelled dizen) means to dress someone up or decorate something in a showy way, and it’s mostly archaic or dialect.","zh":"dizzen（也写作 dizen）指把人打扮得花哨或把事物装饰得醒目，多为古语或方言用法。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Archaic or dialect) to dress up in fancy or showy clothes; to deck out.","zh":"（古语或方言）把……打扮得花哨/华丽；装扮、盛装。"},"examples":[{"en":"She dizzened the children in bright ribbons for the holiday.","zh":"为了过节，她给孩子们系上鲜艳的丝带，把他们打扮得漂漂亮亮。"},{"en":"The shop window was dizzened with flowers and colorful lights.","zh":"橱窗用鲜花和彩灯装点得很醒目。"}]},{"partOfSpeech":"vt.","definition":{"en":"to adorn or decorate something so it looks more attractive (sometimes with a hint of “overdone”).","zh":"装饰、点缀（有时带“装得过头/过于花哨”的意味）。"},"examples":[{"en":"He dizzened his speech with jokes to keep everyone awake.","zh":"他在演讲里穿插笑话来提神。"},{"en":"The hall was dizzened for the wedding, though some thought it was too much.","zh":"大厅为婚礼装饰得很华丽，不过也有人觉得有点过了。"}]}],"synonyms":["dizen","deck out","dress up","adorn","decorate","embellish"],"phonetic":"/ˈdɪzən/","extraExplanation":["“dizzen”更常见的拼法是 **dizen**。它在现代英语里很少用，多见于苏格兰/英格兰北部方言、旧文学或为了营造古风的写作中。","语感上常带一点评价：不仅是“打扮/装饰”，还可能暗示“刻意弄得很花哨”。"]}
{"word":"dizzied","summary":{"en":"“Dizzied” means made dizzy (physically unsteady) or, figuratively, overwhelmed/confused; it can also describe someone who feels dizzy.","zh":"“dizzied”表示“使人头晕/眩晕”，也可比喻“使人迷糊或不知所措”，还可作形容词表示“头晕的”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(past tense/past participle of “dizzy”) to make someone feel as if they are spinning, unsteady, or about to faint.","zh":"（dizzy 的过去式/过去分词）使人感到头晕、眩晕、站不稳或快要昏倒。"},"examples":[{"en":"The long ride on the winding road dizzied me.","zh":"在弯弯曲曲的路上坐了很久的车，把我弄得头晕。"},{"en":"She was dizzied by the smell of paint in the small room.","zh":"小房间里的油漆味让她感到眩晕。"}]},{"partOfSpeech":"vt.","definition":{"en":"(figurative) to confuse or overwhelm someone, especially with too much information, speed, or excitement.","zh":"（比喻）使人迷糊、困惑或不知所措（常因信息太多、节奏太快或太兴奋）。"},"examples":[{"en":"He was dizzied by all the numbers and deadlines.","zh":"一堆数字和截止日期让他头昏脑胀。"},{"en":"The sudden attention from social media dizzied her at first.","zh":"社交媒体上突然涌来的关注一开始让她有点发懵。"}]},{"partOfSpeech":"adj.","definition":{"en":"feeling dizzy; having been made unsteady or confused.","zh":"头晕的；被弄得眩晕或迷糊的。"},"examples":[{"en":"After standing up too fast, he felt dizzied for a moment.","zh":"站起来太快后，他一瞬间感到头晕。"},{"en":"I walked out into the bright sun, a little dizzied.","zh":"我走到刺眼的阳光下，有点晕。"}]}],"synonyms":["made dizzy","lightheaded","giddy","confused","overwhelmed"],"phonetic":"/ˈdɪzid/","extraExplanation":["“dizzied”常见于被动或描述状态（如“was dizzied”或作补语），强调“已经被弄晕/被弄懵”的结果状态。","注意区别：dizzying（令人眩晕的/让人眼花缭乱的）强调“让人产生眩晕的特性”；dizzied 强调“人已经产生眩晕的状态”。"]}
{"word":"dizzier","summary":{"en":"“Dizzier” means “more dizzy,” either physically (lightheaded/spinning) or figuratively (more confusing).","zh":"“dizzier”表示“更头晕/更眩晕”，也可引申为“更令人迷糊、更难理清”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"More dizzy: feeling more unsteady, lightheaded, or as if the room is spinning (comparative form of “dizzy”).","zh":"更头晕的／更眩晕的：比之前更站不稳、更轻飘飘，或感觉天旋地转（“dizzy”的比较级）。"},"examples":[{"en":"I felt dizzier after I stood up too fast.","zh":"我站起来太快之后觉得更头晕了。"},{"en":"The higher we climbed, the dizzier I became.","zh":"我们爬得越高，我就越觉得头晕。"},{"en":"This medicine makes me a little dizzier than usual.","zh":"这药让我比平时更有点头晕。"}]},{"partOfSpeech":"adj.","definition":{"en":"More confusing or hard to follow (comparative form of “dizzy,” used figuratively).","zh":"更令人迷糊的／更让人难以理清的（“dizzy”的比较级，引申用法）。"},"examples":[{"en":"The plot gets dizzier near the end, with too many sudden twists.","zh":"结尾处情节更让人迷糊了，突然反转太多。"},{"en":"The schedule became dizzier once meetings started changing every hour.","zh":"一旦会议每小时都在变，日程就更乱更难跟上了。"}]}],"synonyms":["more lightheaded","more unsteady","more confused","more disoriented"],"phonetic":"/ˈdɪziər/","extraExplanation":["“dizzier”是形容词“dizzy”的比较级：dizzy → dizzier → dizziest。拼写变化规则：以辅音字母+y结尾时，变比较级把y变成i再加-er。","日常表达里，“feel dizzy / feel dizzier”很常见；如果是在描述病症或安全问题（如突然头晕、胸痛、昏厥），英语语境中通常建议及时就医或寻求帮助。"]}
{"word":"dizzies","summary":{"en":"“Dizzies” is an informal way to say “dizziness,” and it can also be the verb form of “dizzy” (makes someone dizzy).","zh":"“dizzies”可作口语表达，表示“头晕/眩晕感”，也可作动词“dizzy”的第三人称单数（使人头晕/迷惑）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A feeling of dizziness; moments when you feel lightheaded or like things are spinning.","zh":"（非正式）头晕；眩晕感；感觉天旋地转的时刻。"},"examples":[{"en":"I stood up too fast and got the dizzies.","zh":"我站起来太快，一下子就头晕了。"},{"en":"After the ride, she had the dizzies for a few minutes.","zh":"坐完那个游乐设施后，她有几分钟都觉得眩晕。"}]},{"partOfSpeech":"v.","definition":{"en":"Third-person singular form of “dizzy”: to make someone feel dizzy or confused (often in passive forms like “be dizzied”).","zh":"“dizzy”的第三人称单数：使人头晕或（引申）使人迷惑（常见于被动结构，如 be dizzied）。"},"examples":[{"en":"The spinning lights dizzies some people.","zh":"旋转的灯光会让一些人头晕。"},{"en":"All the numbers dizzies him when he tries to budget.","zh":"他一做预算，那些数字就把他搞得很迷糊。"}]}],"synonyms":["dizziness","lightheadedness","vertigo","spin"],"phonetic":"/ˈdɪzi/","extraExplanation":["“the dizzies”更像口语/俚语说法，常见于轻松的日常对话里；更正式的表达通常是 “dizziness” 或 “a dizzy spell（一次眩晕）”。","形容词是 “dizzy（头晕的）”，常用搭配：feel dizzy（觉得头晕）、get dizzy（变得头晕）、make me dizzy（让我头晕）。"]}
{"word":"dizziest","summary":{"en":"“Dizziest” is the superlative of “dizzy”: the most dizzy (physically) or the most confusing/overwhelming.","zh":"“dizziest”是“dizzy”的最高级：表示“最头晕的（生理）”或“最令人迷惑/眼花缭乱的（比喻）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Feeling very dizzy or lightheaded; having the strongest feeling of spinning or losing balance.","zh":"非常头晕的；最晕、最站不稳的。"},"examples":[{"en":"After the long ride, I felt the dizziest when I stood up too fast.","zh":"长途乘车后，我站起来太快时感觉最头晕。"},{"en":"This was the dizziest moment of the whole day, so I sat down and drank water.","zh":"这是我一整天里最头晕的时候，所以我坐下来喝了点水。"}]},{"partOfSpeech":"adj.","definition":{"en":"Most confusing, overwhelming, or hard to follow (often about plans, numbers, or busy situations).","zh":"最令人迷惑的；最让人眼花缭乱的（常指计划、数字或忙乱的场景）。"},"examples":[{"en":"The dizziest part of the lesson was all the new grammar rules at once.","zh":"这节课最让人眼花缭乱的部分是一下子出现了很多新语法规则。"},{"en":"The dizziest schedule is the one with too many meetings in one day.","zh":"最令人晕头转向的日程就是一天里安排了太多会议的那种。"}]}],"synonyms":["most lightheaded","most woozy","most confused","most overwhelming"],"phonetic":"/ˈdɪziəst/","extraExplanation":["“dizziest”是形容词“dizzy”的最高级（dizzy → dizzier → dizziest）。既可以指身体上的眩晕，也可以比喻“信息太多、节奏太快”导致的“头昏眼花”。","健康提示：如果你经常感觉dizzy/dizziest，或伴随胸痛、持续呕吐、说话困难、单侧无力等症状，应尽快就医。"]}
{"word":"dizzily","summary":{"en":"“Dizzily” means “in a dizzy, spinning way,” describing how someone feels or moves.","zh":"“dizzily”表示“头晕地/眩晕地”，用来描述一个人感觉或行动的方式。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a dizzy way; feeling or moving as if the world is spinning, often from illness, fear, excitement, or standing up too fast.","zh":"头晕地；眩晕地；（常因生病、害怕、兴奋或起身过快而）感觉或行动像天旋地转。"},"examples":[{"en":"She stood up too quickly and walked dizzily to the sofa.","zh":"她起身太快，头晕目眩地走到沙发边。"},{"en":"He looked down from the high bridge and laughed dizzily, a little scared.","zh":"他从高桥上往下看，带着一点害怕地晕乎乎地笑了。"},{"en":"The music and lights made the crowd sway dizzily.","zh":"音乐和灯光让人群晕眩地摇摆。"}]}],"synonyms":["unsteadily","giddily","lightheadedly"],"phonetic":"/ˈdɪzəli/","extraExplanation":["“dizzily”是副词，来自形容词“dizzy（头晕的/令人眩晕的）”。常与walk/stand/sway/laugh/look等动词搭配。","区分：dizzily（头晕地）强调人的状态；“dizzying”（令人目眩的）形容事物让人晕，比如“a dizzying height（令人眩晕的高度）”。"]}
{"word":"dizziness","summary":{"en":"Dizziness is the feeling of spinning, unsteadiness, or being about to faint; it can also mean mental confusion in a figurative sense.","zh":"dizziness 指眩晕、站不稳或快要昏倒的感觉；也可比喻精神上的迷惘与晕头转向。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A feeling that you are about to fall, that the room is spinning, or that you cannot keep your balance.","zh":"头晕；眩晕（感觉要摔倒、天旋地转或难以保持平衡）。"},"examples":[{"en":"I felt dizziness when I stood up too quickly.","zh":"我站起来太快时感到头晕。"},{"en":"Her dizziness went away after she drank some water and rested.","zh":"她喝了点水并休息后，头晕就好了。"},{"en":"If you have dizziness with chest pain, seek medical help right away.","zh":"如果头晕同时伴有胸痛，请立刻就医。"}]},{"partOfSpeech":"n.","definition":{"en":"A state of confusion or being overwhelmed, as if your thoughts are spinning.","zh":"（比喻）迷惘；晕头转向（好像思绪在打转、被事情压得喘不过气）。"},"examples":[{"en":"In the dizziness of the moment, he forgot her name.","zh":"在那一瞬间的慌乱与迷惘中，他忘了她的名字。"},{"en":"The sudden changes left me in a dizziness of emotions.","zh":"突如其来的变化让我情绪上晕头转向。"}]}],"synonyms":["lightheadedness","vertigo","giddiness"],"phonetic":"/ˈdɪz.i.nəs/","extraExplanation":["“dizziness”是不可数名词（uncountable）用法很常见：have dizziness / feel dizziness。日常口语里也常说“feel dizzy”（dizzy 是形容词，意为“头晕的”。）","常见相关说法：lightheadedness（偏“发飘、轻飘飘的头晕”，常因低血糖、脱水、久站等）、vertigo（更偏“旋转性眩晕”，感觉周围在转）。如果你在医学语境中看到这些词，侧重点略有不同。","搭配：dizziness when standing up（起立时头晕）、cause dizziness（引起头晕）、dizziness and nausea（头晕恶心）。"]}
{"word":"dizziness and tinnitus","summary":{"en":"feeling unsteady/spinning plus ringing sounds in the ears","zh":"头晕/眩晕与耳鸣同时出现的症状组合"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a combination of two symptoms: feeling unsteady or like the room is spinning, and hearing ringing/buzzing sounds in the ears","zh":"两种症状同时出现：头晕/眩晕（感觉不稳或天旋地转）以及耳鸣（耳朵里听到嗡嗡/铃声等声音）"},"examples":[{"en":"After the long flight, she felt dizziness and tinnitus, so she went to a clinic.","zh":"长途飞行后她出现头晕和耳鸣，所以去诊所看了看。"},{"en":"If you have dizziness and tinnitus with sudden hearing loss, seek medical help quickly.","zh":"如果头晕和耳鸣伴随突然听力下降，应尽快就医。"}]},{"partOfSpeech":"n.","definition":{"en":"a feeling of spinning, lightheadedness, or being unsteady","zh":"头晕；眩晕；轻飘飘或站不稳的感觉"},"examples":[{"en":"The heat and lack of water caused dizziness.","zh":"高温和缺水引起了头晕。"},{"en":"He sat down because he suddenly felt dizzy.","zh":"他突然感到头晕，于是坐了下来。"}]},{"partOfSpeech":"n.","definition":{"en":"a ringing, buzzing, or hissing sound in the ears that other people cannot hear","zh":"耳鸣（他人听不到的耳内嗡嗡声/嘶嘶声/铃声等）"},"examples":[{"en":"Tinnitus can get worse after loud concerts.","zh":"耳鸣可能在听完很吵的演唱会后加重。"},{"en":"She described her tinnitus as a high-pitched ringing.","zh":"她形容自己的耳鸣像高频的铃声。"}]}],"synonyms":["vertigo","lightheadedness","ear ringing","ringing in the ears"],"phonetic":"/ˈdɪzinəs ænd tɪˈnaɪtəs/","extraExplanation":["这两个词常用于就医描述症状。dizziness 可能指“头昏（lightheadedness）”或“眩晕（vertigo）”；tinnitus 常被理解为“耳朵里有声音但外界没有”。如果症状突然出现、很严重，或伴随听力下降、胸痛、说话含糊、肢体无力等，应及时就医。"],"etymology":"dizziness 来自形容词 dizzy（头晕的）+ 名词后缀 -ness（表示“状态”）。tinnitus 来自拉丁语 tinnire，意为“叮当作响、发出铃声”。","mnemonic":["dizzy 听起来像“晕兮兮”，-ness 表示“这种状态”→ dizziness＝头晕这种状态。","tinnitus 里有 tin（罐头/金属）+（像）响声：想象金属“叮叮”响→ 耳朵里叮叮响＝耳鸣。"]}
{"word":"dizzy","summary":{"en":"Dizzy means feeling a spinning sensation or losing balance; it can also mean overwhelming/confusing because there’s too much.","zh":"dizzy 表示“头晕、眩晕、站不稳”，也可引申为“令人眼花缭乱、让人不知所措”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Feeling as if you might faint or lose balance; having your head spinning.","zh":"头晕的；眩晕的（感觉要晕倒或站不稳，天旋地转）。"},"examples":[{"en":"I stood up too fast and felt dizzy.","zh":"我站起来太快，感觉头晕。"},{"en":"The heat made him dizzy, so he sat down and drank water.","zh":"高温让他头晕，所以他坐下来喝了点水。"},{"en":"If you feel dizzy, don’t drive—rest for a while.","zh":"如果你觉得头晕，就别开车——先休息一会儿。"}]},{"partOfSpeech":"adj.","definition":{"en":"Making you feel confused or overwhelmed because there is too much to understand or choose from.","zh":"令人眼花缭乱的；让人迷糊的（信息或选择太多而不知所措）。"},"examples":[{"en":"The website has a dizzy number of options.","zh":"这个网站的选项多得让人眼花缭乱。"},{"en":"She looked at the dizzy schedule and didn’t know where to start.","zh":"她看着那份让人发懵的日程表，不知道从哪开始。"}]},{"partOfSpeech":"adj.","definition":{"en":"Causing a spinning or whirling movement.","zh":"旋转的；使人（或物）打转的。"},"examples":[{"en":"We watched the dizzy spinning ride at the amusement park.","zh":"我们看着游乐园里那种转得让人发晕的项目。"},{"en":"The dancer’s dizzy turns amazed the audience.","zh":"舞者快速旋转的动作让观众惊叹。"}]}],"synonyms":["lightheaded","giddy","woozy","disoriented","overwhelming"],"phonetic":"/ˈdɪzi/","extraExplanation":["“dizzy”既可以形容身体不适（最常见），也常用于比喻“多到令人应接不暇”。比如 a dizzy height（令人眩晕的高度）强调高度带来的恐惧或不适。","常见搭配：feel dizzy（感到头晕）、get dizzy（变得头晕）、make someone dizzy（让某人头晕）、dizzy spell（短暂眩晕）。如果症状严重或持续，英文里也常建议 seek medical help（就医）。"]}
{"word":"dizzy spell","summary":{"en":"a brief episode of dizziness","zh":"短暂的头晕发作"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a short period when someone suddenly feels dizzy or lightheaded","zh":"一阵（短暂的）头晕或眩晕"},"examples":[{"en":"I had a dizzy spell when I stood up too quickly.","zh":"我站起来太快时突然一阵头晕。"},{"en":"She sat down for a minute because she felt a dizzy spell coming on.","zh":"她感觉头晕要来了，就坐下休息了一会儿。"},{"en":"If the dizzy spells keep happening, you should see a doctor.","zh":"如果这种头晕反复出现，你应该去看医生。"}]}],"synonyms":["bout of dizziness","episode of dizziness","vertigo","lightheadedness","faintness","giddiness"],"phonetic":"/ˈdɪzi spɛl/","extraExplanation":["在日常英语里，“dizzy spell”通常指突然、短时间的头晕感。它不一定等同于“vertigo（眩晕）”：vertigo 更强调“天旋地转/在转”的感觉；而 dizzy spell 也可以只是“发飘、站不稳、眼前发黑”的轻度头晕。","常见搭配：have a dizzy spell（突然头晕一次）、get dizzy spells（经常头晕）、a dizzy spell came over me / came on（头晕突然袭来）。"],"etymology":"“dizzy”来自古英语，表示“头晕的、眩晕的”；“spell”在这里不是“拼写/咒语”，而是“（一段）时间、一次发作”，常用于描述短暂的经历或症状（如 a coughing spell 一阵咳嗽）。","mnemonic":["把 spell 记成“某种状态的一段时间”：a dizzy spell = “头晕的一小段时间”。","联想中文“发作”：spell 在很多搭配里就像“一阵/一次发作”（coughing spell 一阵咳嗽）。"]}
{"word":"dizzying","summary":{"en":"Dizzying means causing dizziness, or being so extreme (high/fast/many) that it feels overwhelming.","zh":"Dizzying 指让人头晕的，也可指高得/快得/多得令人目眩、难以应付的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Making you feel as if you might lose balance or that everything is spinning; causing dizziness.","zh":"让人头晕的；使人感觉站不稳、天旋地转的。"},"examples":[{"en":"I felt dizzying spells when I stood up too quickly.","zh":"我站起来太快时会感到一阵阵头晕。"},{"en":"The dizzying motion of the boat made her nauseous.","zh":"船的摇晃让她头晕恶心。"}]},{"partOfSpeech":"adj.","definition":{"en":"So high, fast, or extreme that it makes you feel overwhelmed or amazed.","zh":"（高度、速度、程度等）令人目眩的；高得/快得/多得让人不知所措的。"},"examples":[{"en":"They climbed to a dizzying height above the city.","zh":"他们爬到了城市上方令人目眩的高度。"},{"en":"The company grew at a dizzying pace.","zh":"这家公司以惊人的速度增长。"},{"en":"She faced a dizzying array of choices.","zh":"她面对着多得让人眼花缭乱的选择。"}]}],"synonyms":["vertiginous","staggering","overwhelming","bewildering"],"phonetic":"/ˈdɪziɪŋ/","extraExplanation":["“dizzying”既可描述真实的身体感觉（头晕），也常用于比喻：数量太多、变化太快、差距太大，让人“脑子转不过来”。常见搭配有：dizzying height（令人目眩的高度）、dizzying pace（惊人的速度）、dizzying array/range（眼花缭乱的种类/范围）。"]}
{"word":"dizzyingly","summary":{"en":"“Dizzyingly” means “in a dizzy-making way,” or more generally “extremely/overwhelmingly.”","zh":"“dizzyingly”表示“令人眩晕地”，也可引申为“极其、惊人到让人难以消化”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that makes you feel dizzy or as if you might fall (often from height, speed, spinning, or strong emotion).","zh":"以让人头晕、眩晕或仿佛要站不稳的方式（常因高度、速度、旋转或强烈情绪）。"},"examples":[{"en":"The view from the cliff was dizzyingly high.","zh":"从悬崖上看下去，高得让人眩晕。"},{"en":"She climbed the stairs dizzyingly fast.","zh":"她上楼梯快得让人眼花缭乱。"},{"en":"He fell in love dizzyingly quickly.","zh":"他爱得快得让人晕头转向。"}]},{"partOfSpeech":"adv.","definition":{"en":"To an extremely great degree; so much that it feels overwhelming or hard to process.","zh":"极其；高得/多得令人难以承受或难以消化（带有“让人发懵”的感觉）。"},"examples":[{"en":"Tickets were dizzyingly expensive.","zh":"票价贵得让人发懵。"},{"en":"The company grew dizzyingly fast in just a year.","zh":"那家公司在短短一年内以惊人的速度增长。"}]}],"synonyms":["vertiginously","overwhelmingly","extremely","incredibly","staggeringly"],"phonetic":"/ˈdɪziɪŋli/","extraExplanation":["“dizzyingly”来自形容词“dizzy”（头晕的）+ 副词后缀“-ly”。它既可以字面指身体眩晕，也常用来夸张强调“高得吓人/快得惊人/多得惊人”，语气比“very”更强，带一点“让人招架不住”的感觉。"]}

