{"word":"DJ","summary":{"en":"DJ: a person who plays/mixes recorded music for an audience; also used as a verb meaning to do that work.","zh":"DJ：为听众播放/混音录制音乐的人；也可作动词，表示“当 DJ、播放/混音音乐”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who plays recorded music for an audience, especially on the radio or at parties/clubs; also someone who mixes music (often live).","zh":"DJ（唱片骑师/音乐播放者）：为听众播放录制音乐的人，常见于电台、派对或夜店；也指（常现场）混音、串歌的人。"},"examples":[{"en":"The DJ played a mix of hip-hop and pop.","zh":"DJ 播放了一段嘻哈和流行音乐的混音。"},{"en":"We hired a DJ for the wedding reception.","zh":"我们为婚礼晚宴请了一位 DJ。"},{"en":"She’s a radio DJ on weekends.","zh":"她周末在电台当 DJ。"}]},{"partOfSpeech":"v.","definition":{"en":"to work as a DJ; to play and/or mix recorded music for an audience.","zh":"当 DJ；为听众播放和/或混音音乐。"},"examples":[{"en":"He DJs at a local club on Friday nights.","zh":"他每周五晚上在本地一家夜店当 DJ。"},{"en":"I’m DJing at my friend’s birthday party.","zh":"我在朋友的生日派对上当 DJ。"}]}],"synonyms":["disc jockey","radio host","club DJ","selector"],"phonetic":"/ˌdiːˈdʒeɪ/","extraExplanation":["“DJ”是“disc jockey”的缩写：disc 原指黑胶唱片，jockey 原意是“骑手”，这里引申为“熟练操控的人”。虽然现在多用数字音乐，不一定真的用唱片，但“DJ”这个称呼保留下来了。","在不同场景里，DJ 的侧重点不同：电台 DJ 更像主持人+选曲；夜店/派对 DJ 更强调节奏控制、串歌（mixing）和带动气氛。"]}
{"word":"dj","summary":{"en":"“DJ” is short for “disc jockey”: someone who plays (and often mixes) recorded music for an audience; it can also be used as a verb meaning “to perform as a DJ.”","zh":"“DJ”是“disc jockey”的缩写：指为观众播放（常常也会混音）录制音乐的人；也可作动词，表示“当DJ/打碟”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who selects and plays recorded music for an audience, especially on radio, at parties, or in clubs (short for “disc jockey”)","zh":"（电台或派对、夜店等场合）播放并挑选音乐的人；DJ（disc jockey 的缩写）"},"examples":[{"en":"The DJ played dance music all night.","zh":"DJ 整晚都在放舞曲。"},{"en":"She works as a DJ on a local radio station.","zh":"她在本地电台当 DJ。"},{"en":"We hired a DJ for the wedding.","zh":"我们为婚礼请了一个 DJ。"}]},{"partOfSpeech":"v.","definition":{"en":"to perform as a DJ; to play and mix recorded music for an event or audience","zh":"当 DJ；在活动或场合中播放并混音（录制的）音乐"},"examples":[{"en":"He DJs at a club every weekend.","zh":"他每个周末都在一家夜店打碟。"},{"en":"Can you DJ at my birthday party?","zh":"你能来我的生日派对当 DJ 吗？"}]}],"synonyms":["disc jockey","radio host","club DJ","selector"],"phonetic":"/ˌdiːˈdʒeɪ/","extraExplanation":["“DJ”来自“disc jockey”。早期的“disc”指黑胶唱片（唱片），后来也包括CD和数字音乐。","书写上常用大写“DJ”；口语里可直接说“a DJ”。当作动词时常写作“DJ”或“DJing”（如：He is DJing tonight）。","相关词：DJ set（DJ 表演/一场打碟）、DJ booth（DJ 台）、mix（混音）、remix（重混音）、playlist（播放列表）。"]}
{"word":"Djagatay","summary":{"en":"Djagatay is an older/variant spelling of Chagatai, referring either to the Chagatai Turkic literary language or to Chagatai (son of Genghis Khan) and the Chagatai Khanate.","zh":"Djagatay 是 Chagatai 的一种较旧/变体拼写，可指察合台语（突厥语文学语言），也可指成吉思汗之子察合台及其相关的察合台汗国。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(variant spelling) Chagatai: a medieval-to-early modern Turkic literary language once widely used in Central Asia.","zh":"（拼写变体）察合台语：中世纪至近代早期在中亚广泛使用的一种突厥语文学语言。"},"examples":[{"en":"Some older books spell the language as Djagatay, but today Chagatai is more common.","zh":"一些旧书把这种语言拼作 Djagatay，但如今更常见的写法是 Chagatai。"},{"en":"He studied Chagatai (Djagatay) texts to understand Central Asian history.","zh":"他通过研读察合台语（Djagatay）的文献来了解中亚历史。"}]},{"partOfSpeech":"n.","definition":{"en":"(historical) Chagatai (also spelled Djagatay): the second son of Genghis Khan; his name is also used for the Chagatai Khanate.","zh":"（历史）察合台（亦拼作 Djagatay）：成吉思汗的次子；其名也用于指察合台汗国。"},"examples":[{"en":"Chagatai (Djagatay) ruled territories in Central Asia after the Mongol Empire expanded.","zh":"蒙古帝国扩张后，察合台（Djagatay）在中亚地区统治过一段时期。"},{"en":"The region became known as the Chagatai Khanate, named after Djagatay.","zh":"该地区后来被称为察合台汗国，以 Djagatay 命名。"}]}],"synonyms":["Chagatai","Jagatai","Chaghatay"],"phonetic":"/ˌdʒɑːɡəˈtaɪ/","extraExplanation":["“Dj-”这种写法多见于旧式转写系统，用来表示类似英语 /dʒ/ 或 /tʃ/ 的音；现代英语学术写法通常用 **Chagatai**。","在文学史上，察合台语是中亚重要的书面语之一；著名诗人阿里·希尔·纳瓦伊（Ali-Shir Nava'i）常被视为用察合台语写作的代表人物。"]}
{"word":"djagatay","summary":{"en":"Djagatay is an uncommon spelling of Chagatai, referring to a Central Asian historical realm or its classical Turkic literary language.","zh":"Djagatay 是 Chagatai（察合台）的不常见拼写，可指中亚历史政权或其古典书面突厥语。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A less common spelling of **Chagatai**, referring to (1) the historical **Chagatai Khanate** in Central Asia, or (2) the **Chagatai language**, a classical literary Turkic language used in Central Asia.","zh":"一种较少见的拼写形式，对应 **Chagatai（察合台）**，可指（1）中亚历史上的 **察合台汗国**，或（2）曾在中亚使用的古典书面突厥语——**察合台语**。"},"examples":[{"en":"Some books use **Djagatay** as an older spelling of **Chagatai**.","zh":"有些书会用 **Djagatay** 作为 **Chagatai** 的较旧拼写。"},{"en":"He is studying literature written in **Djagatay/Chagatai**.","zh":"他在研究用 **Djagatay/Chagatai（察合台语）** 写成的文学作品。"}]}],"synonyms":["Chagatai","Chaghatai","Jagatai (variant)"],"phonetic":"/ˈtʃæɡəˌtaɪ/","extraExplanation":["“Dj-”这种写法常见于某些旧式转写系统，用来表示接近英语 /dʒ/（如 j 的音）的读法；现代英语资料里更常见拼写是 **Chagatai**。","“察合台语”在中亚有重要文学传统，最著名的作家之一是阿里·希尔·纳瓦伊（Ali-Shir Nava'i）。"]}
{"word":"djagoong","summary":{"en":"“djagoong” is an older Indonesian/Malay spelling for “jagung,” meaning corn/maize.","zh":"“djagoong”是印尼语/马来语中“jagung”的旧式拼写，意思是玉米。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Indonesian/Malay, older spelling) corn; maize.","zh":"（印尼语/马来语，旧式拼写）玉米。"},"examples":[{"en":"In older Indonesian texts, “djagoong” means corn (modern spelling: jagung).","zh":"在较旧的印尼语文本里，“djagoong”指玉米（现代拼写：jagung）。"},{"en":"We bought djagoong at the market to make grilled corn.","zh":"我们在市场买了djagoong（玉米）来做烤玉米。"}]}],"synonyms":["corn","maize"],"phonetic":"/dʒəˈɡuŋ/","extraExplanation":["“djagoong”多见于早期/殖民时期与荷兰语拼写习惯影响下的旧式印尼语罗马字。旧拼写常用“dj”表示现代印尼语字母“j”的音（类似英语的 /dʒ/），因此“djagoong”≈现代拼写“jagung”。","在现代印尼语/马来语学习或旅行场景中，更常见与更标准的写法是“jagung”。"]}
{"word":"Djailolo","summary":{"en":"Djailolo is a variant spelling of Jailolo, a place in North Maluku, Indonesia.","zh":"Djailolo 是 Jailolo 的一种拼写变体，指印度尼西亚北马鲁古省的一个地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A place name: an older/alternative spelling of Jailolo, a town and district in West Halmahera, North Maluku, Indonesia.","zh":"地名：Jailolo（贾伊洛洛/雅伊洛洛）的旧式或另一种拼写；位于印度尼西亚北马鲁古省西哈马黑拉地区的城镇与行政区。"},"examples":[{"en":"Djailolo is often written today as Jailolo on modern maps.","zh":"在现代地图上，Djailolo 常写作 Jailolo。"},{"en":"He traveled through Djailolo to explore Halmahera’s coastal villages.","zh":"他途经 Djailolo，去探访哈马黑拉岛的沿海村落。"}]}],"synonyms":["Jailolo"],"phonetic":"/dʒaɪˈloʊloʊ/","extraExplanation":["“Dj-”这种拼写常见于较早期的荷兰语/殖民时期罗马字转写方式；在一些旧文献或老地图中会看到 Djailolo，而当代印尼语更常用 Jailolo。","Jailolo 位于“香料群岛”（马鲁古群岛）区域附近，这一带在历史上与丁香、肉豆蔻等香料贸易有关；因此在历史读物、旅行写作中可能会出现这个地名。"]}
{"word":"Djaja","summary":{"en":"Djaja is mainly an Indonesian personal name, often linked to “jaya” (“victorious, glorious”).","zh":"Djaja 主要是印尼人名，常与“jaya”（“胜利的、光荣的”）有关。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a personal name (given name or family name), most commonly found in Indonesia; it is often related to the Indonesian word “jaya,” meaning “victorious / glorious.”","zh":"一个人名（名字或姓氏），在印度尼西亚较常见；常与印尼语“jaya”（意为“胜利的/光荣的”）相关。"},"examples":[{"en":"Mr. Djaja is our new math teacher.","zh":"Djaja 先生是我们的新数学老师。"},{"en":"Her last name is Djaja.","zh":"她的姓是 Djaja。"}]}],"synonyms":["Jaya (related spelling/variant)"],"phonetic":"/dʒɑːˈdʒɑː/","extraExplanation":["“Djaja”里的“Dj-”常见于较早期的印尼拼写方式：过去用“dj”来表示现在的字母“j”的发音。因此你有时会看到“Djaja”与“Jaya”在含义或来源上有关联（通常带有“胜利、荣耀”的意象）。在英文语境里，它一般被当作专有名词（人名）使用，而不是普通词汇。"]}
{"word":"Djajapura","summary":{"en":"Djajapura is an older spelling of Jayapura, the capital city of Indonesia’s Papua Province.","zh":"Djajapura 是 Jayapura（查亚普拉）的旧拼写形式，指印度尼西亚巴布亚省省会城市。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an older spelling of Jayapura, a city in eastern Indonesia (Papua Province) on the north coast of New Guinea; it is the provincial capital.","zh":"Jayapura（查亚普拉）的旧拼写形式：印度尼西亚东部巴布亚省的一座城市，位于新几内亚岛北海岸，是该省省会。"},"examples":[{"en":"Older maps may label the city as Djajapura, but today it is usually written as Jayapura.","zh":"一些旧地图可能标注为 Djajapura，但如今通常写作 Jayapura。"},{"en":"He flew to Djajapura (Jayapura) to start his research in Papua.","zh":"他飞往 Djajapura（Jayapura）开始在巴布亚的研究。"}]}],"synonyms":["Jayapura"],"phonetic":"/ˌdʒaɪəˈpʊrə/","extraExplanation":["“Djajapura”常见于较早的英语/荷兰语转写体系；现代更通行的写法是“Jayapura”。","这座城市在历史上也曾被称为“Hollandia”（荷属时期的名称），后来名称与拼写随着印尼语正字法和政治历史变迁而调整。"]}
{"word":"Djakarta","summary":{"en":"Djakarta is an older spelling of Jakarta, the capital of Indonesia.","zh":"Djakarta 是雅加达（Jakarta，印度尼西亚首都）的旧拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an older spelling of **Jakarta**, the capital city of Indonesia (used especially in older English texts and some historical contexts).","zh":"**雅加达**（Jakarta）的旧拼写形式：印度尼西亚首都（多见于旧英文资料或历史语境）。"},"examples":[{"en":"The conference was held in **Djakarta** in the 1960s.","zh":"这场会议在20世纪60年代于**Djakarta（雅加达）**举行。"},{"en":"In older documents, you may see **Djakarta** instead of **Jakarta**.","zh":"在较旧的文件中，你可能会看到用 **Djakarta** 来代替 **Jakarta（雅加达）**。"}]}],"synonyms":["Jakarta"],"phonetic":"/dʒəˈkɑːrtə/","extraExplanation":["“Djakarta”是历史上较常见的拉丁字母拼写，受到荷兰语/旧式印尼语拼写习惯影响（如用“dj”表示类似今天印尼语“j”的音）。后来印尼语拼写改革后，更常用现代写法“Jakarta”。在当代英语与国际新闻中通常写作“Jakarta”。"]}
{"word":"djalmaite","summary":{"en":"“Djalmaite” is a rare, largely historical mineral name, mainly seen in older geology/mineralogy sources.","zh":"“djalmaite”是一个罕见且偏历史的矿物名称，主要出现在较老的地质/矿物学资料中。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Rare, geology/mineralogy) A historical or little-used mineral name for a uranium-bearing oxide mineral reported from Brazil.","zh":"（罕见，地质/矿物学）一种历史上或较少使用的矿物名称，指在巴西有报道的含铀氧化物类矿物。"},"examples":[{"en":"The old report listed djalmaite among the uranium minerals found in the region.","zh":"那份旧报告把 djalmaite 列为该地区发现的含铀矿物之一。"},{"en":"In modern references, djalmaite is rarely used; the mineral may be discussed under other names.","zh":"在现代资料中，djalmaite 很少使用；这种矿物可能会以其他名称来讨论。"}]}],"synonyms":["uranium oxide mineral","uraninite (often discussed in related context)"],"phonetic":"/dʒɑlˈmaɪt/","extraExplanation":["这个词在日常英语里几乎不会出现，主要见于较老的矿物学/地质学文献或矿物名录。","矿物名称在不同年代可能经历更名、合并或被更常用的标准名称取代；如果你是在论文、标本标签或数据库中看到 djalmaite，建议同时核对其产地、化学组成与现代通行名。"]}
{"word":"Djambi","summary":{"en":"Djambi is the older spelling of Jambi (a province and city in Sumatra, Indonesia).","zh":"Djambi 是 Jambi（印度尼西亚苏门答腊岛的占碑省与占碑市）的旧式拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an older (Dutch-influenced) spelling of Jambi, a province and capital city on the island of Sumatra in Indonesia","zh":"“Jambi（占碑）”的旧式（受荷兰拼写影响）写法，指印度尼西亚苏门答腊岛上的占碑省及其首府占碑市"},"examples":[{"en":"Djambi is an older spelling; today it is usually written as Jambi.","zh":"Djambi 是较旧的拼写；如今通常写作 Jambi。"},{"en":"The book mentions trade routes through Djambi in Sumatra.","zh":"这本书提到苏门答腊的 Djambi（占碑）一带的贸易路线。"}]}],"synonyms":["Jambi"],"phonetic":"/ˈdʒɑːmbi/","extraExplanation":["“Dj-”这种拼写常见于荷兰殖民时期对印尼地名的转写：在荷兰语中“dj”常用来表示英语里的 /dʒ/（类似“j”音）。因此 Djambi 与 Jambi 指的是同一地名，只是时代/拼写体系不同。"]}
{"word":"djasakid","summary":{"en":"“djasakid” is not a standard English word; it’s likely a typo or a name/ID.","zh":"“djasakid”不是标准英文单词；更可能是拼写错误或名字/ID。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a recognized English word. It is likely a typo, a username, or random letters. If you meant a real word, please resend the correct spelling or provide a sentence.","zh":"这不是一个常见或可辨识的英文单词，更可能是拼写错误、用户名或随机字母。若你想查某个词，请提供正确拼写或给出句子语境。"},"examples":[{"en":"“djasakid” doesn’t appear in standard English dictionaries—could it be a misspelling?","zh":"“djasakid”在常见英文词典里找不到——会不会是拼错了？"},{"en":"If you paste the full sentence, I can guess the intended word and explain it.","zh":"如果你把完整句子贴出来，我可以帮你推测你想写的词并解释。"}]}],"extraExplanation":["你可以检查几种可能：\n1）是否想输入某个英文单词（例如键盘误触导致多打/少打字母）；\n2）是否是人名、网名、游戏ID、品牌名；\n3）如果你记得发音或看到它的上下文（前后几个词），发给我，我可以根据语境推断最可能的目标词并给出释义、例句和近义词。"]}
{"word":"djave","summary":{"en":"“Djave” is likely a misspelling of “déjà vu,” meaning a feeling that something happening now has happened before.","zh":"“djave” 很可能是 “déjà vu（似曾相识）” 的拼写错误，意思是觉得正在发生的事以前发生过。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"It looks like “djave” is not a standard English word; you may mean “déjà vu,” the feeling that you have experienced the present situation before.","zh":"“djave” 不是标准英语单词；你可能想写的是 “déjà vu（似曾相识）”，指觉得眼前的情景以前经历过。"},"examples":[{"en":"This conversation is giving me déjà vu—I feel like we’ve had it before.","zh":"这段对话让我有种似曾相识的感觉——我觉得我们以前聊过。"},{"en":"When I walked into the room, I had a strange sense of déjà vu.","zh":"我走进房间时，突然有一种奇怪的似曾相识感。"}]},{"partOfSpeech":"n.","definition":{"en":"A repeated or very familiar experience; something that feels like it has happened before (often used informally).","zh":"（非正式）重复发生或非常熟悉的经历；让人觉得“又来了、又发生过”的事情。"},"examples":[{"en":"Another delay at the airport—déjà vu.","zh":"机场又延误了——真是“又来这一套”。"},{"en":"It’s déjà vu all over again: the same mistake, the same excuse.","zh":"这简直是“历史重演”：同样的错误，同样的借口。"}]}],"synonyms":["familiar feeling","feeling of recognition","sense of repetition"],"phonetic":"/ˌdeɪʒɑː ˈvuː/","extraExplanation":["“déjà vu”来自法语，字面意思是“已经看过”。英语里常直接借用这个词组（有时不写重音符号，写作 deja vu）。","发音里常见的 /ʒ/ 音类似汉语拼音里“日/zh”之间的摩擦感，可把它想成英文单词 measure 里的 “s” 音。"]}
{"word":"djebel","summary":{"en":"Djebel means a mountain or hill, especially in North Africa or the Middle East, and is often used in place names.","zh":"djebel 指（尤指北非或中东的）山或丘陵，也常用于地名中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a mountain or hill, especially in North Africa or the Middle East; often used in place names.","zh":"（尤指北非或中东的）山、丘陵；也常用于地名中。"},"examples":[{"en":"The village sits at the foot of a djebel in northern Algeria.","zh":"这个村庄坐落在阿尔及利亚北部一座山脚下。"},{"en":"We crossed the rocky djebels before reaching the coast.","zh":"我们翻越了岩石嶙峋的群山，才到达海岸。"},{"en":"In some maps, “Djebel” appears as part of a mountain’s name.","zh":"在一些地图上，“Djebel”会作为山名的一部分出现。"}]}],"synonyms":["mountain","hill","jebel","mount"],"phonetic":"/dʒəˈbɛl/","extraExplanation":["“djebel”常见于英文对北非、马格里布地区（如阿尔及利亚、突尼斯、摩洛哥）地理或历史的描写中，是从阿拉伯语 جبل（jabal，意为“山”）借入的拼写形式之一；也常写作“jebel / gebel”。在阿拉伯语地名里，你可能会看到如“Djebel X”（X山）的结构。"]}
{"word":"djebels","summary":{"en":"Djebels means mountains/rocky hills, especially in North Africa.","zh":"Djebels 指（尤指北非的）山岳、岩石山丘。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Mountains or rocky hills, especially in North Africa (plural of djebel).","zh":"（尤指北非的）山岳、岩石山丘；“djebel”的复数。"},"examples":[{"en":"The hikers crossed the djebels before reaching the desert plain.","zh":"徒步者在到达沙漠平原前翻越了那些山岳。"},{"en":"In older travel writing, the Atlas djebels are described as wild and rugged.","zh":"在较早的游记中，阿特拉斯山脉常被描写为荒野而崎岖的群山。"}]}],"synonyms":["mountains","hills","rocky hills","ranges","massifs"],"phonetic":"/dʒəˈbɛlz/","extraExplanation":["“djebel / djebels”多见于描写北非（如阿尔及利亚、突尼斯、摩洛哥）的英语/法语地理与旅行文字。它来自阿拉伯语“jabal”（山）。因此它带有明显的地域与历史语境（殖民时期地名拼写影响），在现代英语里更常直接说 “mountains / hills” 或使用具体山名。"]}
{"word":"djehad","summary":{"en":"“Djehad” is a less common spelling of “jihad,” meaning a struggle or effort—often spiritual or moral, and sometimes (contextually) armed struggle.","zh":"“Djehad”是“jihad”的较少见拼写，基本义为“奋斗/努力”，常指精神与道德层面的自我修炼，也可能在特定语境中指武装斗争。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an alternative spelling of “jihad”; in Islam, a “struggle” or “effort,” especially a moral or spiritual struggle, and sometimes used to mean an armed struggle (often inaccurately simplified in media as “holy war”).","zh":"“jihad”的另一种拼写；在伊斯兰传统中指“奋斗、努力”，尤其是道德或精神层面的自我修炼；有时也指武装斗争（媒体中常被过度简化为“圣战”，但并不等同）。"},"examples":[{"en":"Some writers spell it “djehad,” but “jihad” is more common in English.","zh":"有些作者会拼作“djehad”，但英文里更常见的写法是“jihad”。"},{"en":"In many contexts, jihad refers to an inner struggle to live ethically.","zh":"在很多语境中，jihad指的是一种内在的挣扎与努力，去更有道德地生活。"},{"en":"Be careful with the word: its meaning depends on religious, historical, and political context.","zh":"使用这个词要谨慎：它的含义取决于宗教、历史与政治语境。"}]}],"synonyms":["jihad","struggle","effort","campaign"],"phonetic":"/dʒɪˈhɑːd/","extraExplanation":["“Djehad”多见于早期或特定体系的转写方式（把阿拉伯语/波斯语等音译成拉丁字母），现代英语最常用拼法是“jihad”。","在伊斯兰教义中，“jihad”的核心含义是“努力/奋斗”。不少学者会区分“更大的奋斗”（指自我修养、克制欲望等精神与道德层面的努力）与“更小的奋斗”（可能涉及外在冲突）。不同传统与语境解读会有差异。","在新闻与政治语境中，该词有时被极端组织挪用或被外界单一化解读；写作或翻译时建议根据具体语境明确所指，避免以偏概全。"]}
{"word":"djelab","summary":{"en":"“djelab” isn’t a recognized English dictionary word; it likely refers to a name or “DJ lab.”","zh":"“djelab”不是常见的英语词典词条；更可能是名称或“DJ lab”的写法。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a misspelling, a username/brand name, or a proper noun (e.g., a company, app, or person’s name).","zh":"不是标准英语单词；更可能是拼写错误、用户名/品牌名或专有名词（如公司、应用或人名）。"},"examples":[{"en":"I couldn’t find “djelab” in an English dictionary—do you mean “DJ lab” (a music/recording lab)?","zh":"我在英语词典里找不到“djelab”——你是不是想写“DJ lab”（与音乐/录音相关的实验室或工作室）？"},{"en":"Can you share a sentence or a link where you saw “djelab”?","zh":"你能给我一个包含“djelab”的句子或你看到它的链接吗？"}]}],"extraExplanation":["“djelab”看起来像由“DJ + lab”拼在一起：DJ 指唱片骑师/打碟者，lab 常指实验室、工作室或创作空间。但如果它是品牌名/平台名/人名，就不会有固定的词典释义。","如果你告诉我它出现的语境（音乐、科技、社交媒体、学校课程等），我可以帮你判断它到底指什么，并给出更准确的解释和用法。"]}
{"word":"djelfa","summary":{"en":"Djelfa is a city in Algeria (and sometimes refers to the province of the same name).","zh":"Djelfa 是阿尔及利亚的一座城市（有时也指同名的省份）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Djelfa is a city in central Algeria, and the capital of Djelfa Province.","zh":"Djelfa（杰尔法）是阿尔及利亚中部的一座城市，也是杰尔法省的省会。"},"examples":[{"en":"Djelfa is located south of Algiers on the high plateau region.","zh":"Djelfa 位于阿尔及尔以南的高原地区。"},{"en":"She traveled through Djelfa on her way to the Sahara.","zh":"她在前往撒哈拉的路上经过了 Djelfa。"}]},{"partOfSpeech":"n.","definition":{"en":"Djelfa can also refer to Djelfa Province, an administrative region of Algeria.","zh":"Djelfa 也可指“杰尔法省”，即阿尔及利亚的一个行政区。"},"examples":[{"en":"Djelfa Province has several towns and rural communities.","zh":"杰尔法省下辖多个城镇和乡村社区。"}]}],"phonetic":"/ˈdʒɛlfə/","extraExplanation":["“Djelfa”常见于法语转写体系（阿尔及利亚曾长期受法语影响），因此拼写以“Dj-”开头；在英文资料中也可能看到“El Djelfa”（带定冠词的写法）。","这是专有名词（地名）。在写作中第一次出现时可加上国家/省份信息帮助读者定位，例如：“Djelfa, Algeria”。"]}
{"word":"djellab","summary":{"en":"Djellaba (often spelled djellaba) is a traditional North African long, loose robe, often with a hood.","zh":"Djellaba（常见拼写为 djellaba）指北非传统长袍，宽松、较长，常带兜帽。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long, loose robe (often with a hood) traditionally worn in Morocco and other North African countries","zh":"（北非，尤指摩洛哥）传统长袍，通常宽松、长及脚踝，常带兜帽"},"examples":[{"en":"He wore a white djellaba to stay cool in the heat.","zh":"他穿了一件白色的djellaba（传统长袍）来在炎热中保持凉爽。"},{"en":"In the market, you can buy djellabas in many colors and fabrics.","zh":"在集市上，你可以买到各种颜色和面料的djellaba。"}]}],"synonyms":["djellaba","jellaba","robe"],"phonetic":"/dʒəˈlɑːbə/","extraExplanation":["更常见的拼写是 **djellaba**（也可写作 **jellaba**）。你输入的 **djellab** 可能是拼写简写或变体，但在英语词典与旅游/文化语境中通常用 *djellaba*。","djellaba 常与 **kaftan/caftan（长袍）** 一起被提到，但两者不完全相同：djellaba 在摩洛哥等地更典型，常见特征是宽松剪裁与（有时）兜帽，用途从日常穿着到较正式场合都有。"]}
{"word":"djellaba","summary":{"en":"A djellaba is a traditional North African (especially Moroccan) hooded robe.","zh":"djellaba 是北非（尤其摩洛哥）传统的连帽长袍。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long, loose outer robe with a hood, traditionally worn in Morocco and other parts of North Africa","zh":"（北非、尤指摩洛哥）传统连帽长袍；宽松外袍"},"examples":[{"en":"He bought a wool djellaba in the medina to wear on cool evenings.","zh":"他在老城区买了一件羊毛djellaba，凉爽的夜晚穿。"},{"en":"In Morocco, you may see people wearing a djellaba for daily life or for prayer.","zh":"在摩洛哥，你可能会看到人们日常生活或礼拜时穿djellaba。"}]}],"synonyms":["jellaba","hooded robe","traditional robe"],"phonetic":"/dʒəˈlɑːbə/","extraExplanation":["“djellaba”常见拼写也有 jellaba。它源自阿拉伯语（在北非方言中常用），是很有代表性的马格里布（北非西部）服饰之一。","文化上，djellaba 既可以是日常穿着，也可用于较正式或宗教场合；材质会随季节变化（如冬天较厚的羊毛、夏天较轻薄的棉麻）。","不要把 djellaba 和“kaftan/caftan（开夫坦）”混为一谈：两者都是长袍类服饰，但 djellaba 的“连帽（hood）”特征更典型，且与摩洛哥日常街头文化联系更紧密。"]}
{"word":"djellabah","summary":{"en":"A traditional hooded robe worn in North Africa, especially Morocco.","zh":"北非（尤指摩洛哥）常见的传统带兜帽长袍。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A long, loose outer robe with a hood, traditionally worn in North Africa (especially Morocco).","zh":"（北非，尤指摩洛哥）传统的长袍外衣，宽松，通常带兜帽。"},"examples":[{"en":"He bought a djellabah in the Marrakech market to wear in the evening chill.","zh":"他在马拉喀什的集市买了一件djellabah，用来在傍晚变冷时穿。"},{"en":"Many Moroccan men wear a djellabah for daily life and for religious occasions.","zh":"许多摩洛哥男性在日常生活和宗教场合都会穿djellabah。"}]}],"synonyms":["jellaba","hooded robe","Moroccan robe"],"phonetic":"/dʒəˈlɑːbə/","extraExplanation":["“Djellabah”（也常拼作 jellaba）是借自阿拉伯语的词，指马格里布地区常见的罩袍式服装。它的兜帽在沙漠或多风环境中很实用，可遮阳、防风、防尘。","与它容易混淆的词：kaftan/caftan（更广义的长袍，常见于多地文化与时尚语境），以及abaya（多指阿拉伯半岛常见的黑色长袍）。在北非语境中，djellabah更具“摩洛哥/马格里布传统长袍”的指向。"]}
{"word":"djellabas","summary":{"en":"Djellabas are long, loose, often hooded North African robes (plural of djellaba).","zh":"Djellabas 指北非传统的长款宽松（常带兜帽）外袍，是 djellaba 的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plural form of “djellaba”: long, loose, hooded outer robes traditionally worn in North Africa (especially Morocco, Algeria, and Tunisia) by men and women.","zh":"“djellaba”的复数：北非（尤其摩洛哥、阿尔及利亚、突尼斯）传统穿着的长款、宽松、常带兜帽的外袍，男女皆可穿。"},"examples":[{"en":"In the market, you can see locals wearing djellabas in many colors.","zh":"在集市上，你会看到当地人穿着各种颜色的djellabas（长袍）。"},{"en":"They bought two djellabas as souvenirs from Morocco.","zh":"他们从摩洛哥买了两件djellabas（长袍）当纪念品。"}]}],"synonyms":["robes","traditional robes","kaftans (similar, not identical)"],"phonetic":"/dʒəˈlɑːbəz/","extraExplanation":["“djellaba”源自阿拉伯语语境，常见于马格里布地区（日常穿着与节庆场合都可能出现）。它通常是长及脚踝的外袍，传统款式常配兜帽；材质可从轻薄棉麻到冬季更厚的羊毛。英文里也常见单数 djellaba、复数 djellabas。"]}
{"word":"Djeloula","summary":{"en":"Djeloula is a proper noun used as the name of a place in Algeria.","zh":"Djeloula 是专有名词，通常用作阿尔及利亚某地的地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a town/commune in Algeria (a proper place name).","zh":"杰卢拉（阿尔及利亚的一个城镇/市镇，专有地名）。"},"examples":[{"en":"Djeloula is located in Algeria.","zh":"Djeloula 位于阿尔及利亚。"},{"en":"He traveled from Algiers to Djeloula for work.","zh":"他为了工作从阿尔及尔前往 Djeloula。"}]}],"phonetic":"/ˌdʒɛluːˈlɑː/","extraExplanation":["“Djeloula”通常是北非（尤其是阿尔及利亚）常见的地名拼写之一；在英语语境中多作为专有名词使用，不像普通词汇那样有可扩展的词义。","地名在英语里一般不加冠词（不说 *the Djeloula*），除非特指某个机构或地理实体的常规用法（如 *the Sahara*）。"]}
{"word":"Djemas","summary":{"en":"“Djemas” isn’t standard English; it likely means “jamas” (informal) = pajamas.","zh":"“Djemas”不是标准英文；很可能指口语“jamas”＝睡衣（pajamas）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"“Djemas” is not a standard English word. It is most likely a misspelling of “jamas” (informal), meaning pajamas—clothes worn for sleeping.","zh":"“Djemas”不是标准英文词。它很可能是口语拼写“jamas”的误写，意思是“睡衣”（pajamas）。"},"examples":[{"en":"I’m going to put on my jamas and go to bed.","zh":"我要换上睡衣去睡觉了。"},{"en":"The kids were already in their jamas after the bath.","zh":"孩子们洗完澡就已经穿上睡衣了。"}]}],"synonyms":["pajamas","pyjamas","jammies"],"phonetic":"/ˈdʒæməz/","extraExplanation":["“jamas”是“pajamas/pyjamas”的口语缩写拼写之一，也常见更可爱的说法“jammies”。美式英语里更常写“pajamas”，英式英语常写“pyjamas”。","如果你指的是专有名词（人名、地名、品牌）“Djemas”，请告诉我它出现的句子或语境，我可以按正确含义解释。"]}
{"word":"Djerba","summary":{"en":"Djerba is a Mediterranean island in Tunisia, and the name can also refer to the island’s main town/region in travel use.","zh":"Djerba 指突尼斯的地中海岛屿“杰尔巴岛”，在旅游语境中也可指岛上的主要城镇/区域。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An island off the coast of Tunisia in the Mediterranean Sea, known for its beaches, traditional villages, and historic Jewish and Amazigh (Berber) heritage.","zh":"突尼斯外海的地中海岛屿，以海滩、传统村落以及犹太与阿马齐格（柏柏尔）文化遗产闻名。"},"examples":[{"en":"Many travelers visit Djerba for its warm weather and sandy beaches.","zh":"许多旅行者到杰尔巴岛（Djerba）是为了温暖的天气和沙滩。"},{"en":"Djerba is often described as one of Tunisia’s most relaxing island destinations.","zh":"杰尔巴岛常被形容为突尼斯最适合放松的海岛目的地之一。"}]},{"partOfSpeech":"n.","definition":{"en":"A main town/area on the island of Djerba (often used to refer to the island region as a whole in travel contexts).","zh":"杰尔巴岛上的主要城镇/地区名称（在旅游语境中也常泛指整个岛区）。"},"examples":[{"en":"Our hotel is in Djerba, about a short drive from the local market.","zh":"我们的酒店在杰尔巴岛（Djerba）上，离当地市场开车不远。"},{"en":"Flights to Djerba are common during the tourist season.","zh":"旅游旺季时，前往杰尔巴（Djerba）的航班很常见。"}]}],"synonyms":["Jerba"],"phonetic":"/ˈdʒɝːbə/","extraExplanation":["“Djerba”也常见拼写为“Jerba”。它在历史上是地中海贸易与文化交流的一部分，因此岛上能看到北非、阿拉伯、地中海与犹太社群传统并存的痕迹。","如果你在阅读旅游文章或新闻报道里看到“Djerba”，通常指的是“杰尔巴岛”这个目的地；在航班或酒店信息中，有时会把它当作一个地区/城市名来用。"]}
{"word":"djerib","summary":{"en":"Djerib is a land-area unit used mainly in Afghanistan; its exact size varies, but it’s often treated as about 2,000 m².","zh":"Djerib是主要用于阿富汗的土地面积单位；具体大小因地区与时期而异，但常被粗略视为约2,000平方米。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a unit of land area used in Afghanistan (and historically in parts of Central/South Asia), often treated as roughly about 2,000 square meters, though the exact size can vary by region and time.","zh":"（主要用于阿富汗、亦见于中亚/南亚历史用法的）土地面积单位；常被粗略视为约2,000平方米左右，但各地与不同时期的具体大小可能不同。"},"examples":[{"en":"The farmer said his family owned five djeribs of land.","zh":"那位农民说他家拥有五“杰里布”（djerib）的土地。"},{"en":"Aid reports sometimes convert djeribs into hectares to make comparisons easier.","zh":"援助报告有时会把djerib换算成公顷，以便比较。"}]}],"synonyms":["jerib","land measure","area unit"],"phonetic":"/ˈdʒɛrɪb/","extraExplanation":["“djerib”也常拼作“jerib”，源自波斯语/达里语等语境中的度量单位名称。","由于各地标准不完全一致，阅读资料时最好查看该文件是否给出换算（例如换算成公顷hectare或英亩acre），以免误解土地规模。"]}
{"word":"djersa","summary":{"en":"“djersa” is not a recognized English word; likely a name, typo, or non-English term.","zh":"“djersa”不是可识别的英语词；很可能是名字、拼写错误或非英语词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username, a brand name, or a word from another language.","zh":"不是标准英语单词。可能是拼写错误、用户名、品牌名，或来自其他语言的词。"},"examples":[{"en":"I couldn’t find “djersa” in an English dictionary—could it be a name or a typo?","zh":"我在英语词典里找不到“djersa”——它会不会是名字或拼写错误？"},{"en":"If you tell me where you saw “djersa,” I can help figure out what it means.","zh":"如果你告诉我你在哪里看到“djersa”，我可以帮你推断它的意思。"}]}],"phonetic":"/ˈdʒɝsə/","extraExplanation":["“djersa”看起来不像英语常见拼写组合。你可以提供更多信息（例如：出现在歌词/游戏/社交媒体/一段句子里，或者你想表达的原词是什么），我就能更准确地判断：是否为拼写错误（如 people/jersey/diverse 等）、专有名词，或外来词的转写。"]}
{"word":"djibbah","summary":{"en":"Djibbah is a traditional loose outer robe (a kind of jubbah/jibba) worn in parts of Africa and the Arab world.","zh":"Djibbah 指一种传统的宽松长外袍（类似 jubbah/jibba），常见于非洲部分地区及阿拉伯世界。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a long, loose outer robe (often traditional in parts of North and West Africa and the Arab world), typically worn by men; a type of jubbah/jibba.","zh":"（传统服饰）一种宽松的长外袍，常见于北非、西非及阿拉伯地区（多为男性穿着）；也可指 jubbah/jibba 这一类长袍。"},"examples":[{"en":"He arrived wearing a white djibbah and leather sandals.","zh":"他穿着一件白色的 djibbah（长袍）和皮凉鞋到达。"},{"en":"In some communities, the djibbah is worn for prayers and formal events.","zh":"在一些社群中，djibbah 常用于礼拜或正式场合。"}]}],"synonyms":["jubbah","jibba","djellaba","robe"],"phonetic":"ˈdʒɪbə","extraExplanation":["“djibbah”多见于英语对外来词的转写，拼写也常见 jubbah / jibba / djellaba 等变体（不同地区与语言来源会影响拼法）。一般指宽松长袍这一类传统服饰；具体款式、是否带帽、面料与用途会因国家与族群而不同。"]}
{"word":"Djibouti","summary":{"en":"Djibouti is a country in the Horn of Africa; it can also refer to its capital city.","zh":"Djibouti 指非洲之角的国家“吉布提”，也可指其首都“吉布提市”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A country in the Horn of Africa on the Red Sea, bordered by Eritrea, Ethiopia, and Somalia.","zh":"吉布提（非洲之角国家），位于红海沿岸，与厄立特里亚、埃塞俄比亚和索马里接壤。"},"examples":[{"en":"Djibouti is a small country with a strategically important port.","zh":"吉布提是一个国家面积不大但港口具有重要战略意义的国家。"},{"en":"Many ships pass near Djibouti through the Bab el-Mandeb Strait.","zh":"许多船只会经过吉布提附近的曼德海峡。"}]},{"partOfSpeech":"n.","definition":{"en":"The capital city of the country of Djibouti.","zh":"吉布提市（吉布提的首都）。"},"examples":[{"en":"I flew into Djibouti for a short business trip.","zh":"我飞到吉布提市出差了几天。"},{"en":"Djibouti has modern buildings near the harbor.","zh":"吉布提市在港口附近有一些现代化建筑。"}]}],"synonyms":["Republic of Djibouti","Djibouti City"],"phonetic":"/dʒɪˈbuːti/","extraExplanation":["“Djibouti”是专有名词，首字母大写。既可指“国家”，也可指“首都吉布提市”；写作时可根据语境判断。","美式发音常读作 /dʒɪˈbuːti/，重音在第二音节（boo）。拼写里有两个“i”，容易漏写最后一个。","在文化与地理背景上，吉布提因靠近曼德海峡、连接红海与亚丁湾而常被提到；同时它也是多语言国家，常见语言包括法语和阿拉伯语。"]}
{"word":"djibouti","summary":{"en":"Djibouti is both a country in the Horn of Africa and the name of its capital city.","zh":"Djibouti 既指非洲之角的国家“吉布提”，也指其首都“吉布提市”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a country in the Horn of Africa, on the Red Sea and the Gulf of Aden; its capital city is also called Djibouti","zh":"吉布提：位于非洲之角、濒临红海与亚丁湾的国家；其首都也叫吉布提市"},"examples":[{"en":"Djibouti is a small country in the Horn of Africa with a strategically important port.","zh":"吉布提是非洲之角的一个小国，拥有具有战略意义的港口。"},{"en":"My friend works in Djibouti City, the capital of Djibouti.","zh":"我的朋友在吉布提的首都——吉布提市工作。"}]},{"partOfSpeech":"n.","definition":{"en":"the capital and largest city of Djibouti (the country)","zh":"吉布提市：吉布提（国家）的首都和最大城市"},"examples":[{"en":"We had a long layover in Djibouti before continuing our trip.","zh":"我们在吉布提市长时间转机，然后继续旅行。"},{"en":"Djibouti is hot and dry for much of the year.","zh":"吉布提市一年中大部分时间炎热干燥。"}]}],"synonyms":["Republic of Djibouti (official name)","Djibouti City"],"phonetic":"/ˌdʒɪbəˈuːti/","extraExplanation":["“Djibouti”既可以指国家，也可以指首都（Djibouti City）。写作时如果担心读者混淆，可以用“Djibouti (the country)”或“Djibouti City”来明确。","英文里它通常重读在最后一音节：dih-buh-OO-tee。"]}
{"word":"Djilas","summary":{"en":"Djilas usually refers to Milovan Djilas, a Yugoslav dissident and writer, and sometimes to his idea of the communist “new class.”","zh":"Djilas通常指南斯拉夫异见者兼作家米洛凡·吉拉斯，有时也指他提出的共产主义“新阶级”理论。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Milovan Djilas (1911–1995), a Yugoslav (Montenegrin) politician, writer, and later a famous dissident who criticized communist rule.","zh":"米洛凡·吉拉斯（1911–1995），南斯拉夫（黑山）政治人物与作家，后来成为著名的持不同政见者，批评共产主义体制。"},"examples":[{"en":"Milovan Djilas broke with Tito’s government and became one of the best-known critics of Yugoslav communism.","zh":"米洛凡·吉拉斯与铁托政府决裂，成为最知名的南斯拉夫共产主义批评者之一。"},{"en":"In class we discussed Djilas as an example of an insider who later opposed the system.","zh":"课堂上我们讨论了吉拉斯，作为“体制内部人士后来反对体制”的一个例子。"}]},{"partOfSpeech":"n.","definition":{"en":"(By extension) Djilas’s influential idea of the “new class,” meaning a privileged ruling group formed by party officials in communist states.","zh":"（引申义）吉拉斯提出的“新阶级”观点：在共产主义国家中由党内官员形成的、享有特权的统治群体。"},"examples":[{"en":"Djilas argued that a “new class” of party elites controlled wealth and power.","zh":"吉拉斯认为党内精英构成了掌控财富与权力的“新阶级”。"},{"en":"Some writers compare modern political elites to Djilas’s “new class.”","zh":"一些作者把现代的政治精英与吉拉斯所说的“新阶级”作比较。"}]}],"synonyms":["Milovan Djilas","Đilas"],"phonetic":"/ˈdʒiːlɑːs/","extraExplanation":["“Djilas”也常写作“Đilas”（带斜杠的拉丁字母Đ/đ），来源于南斯拉夫地区的拼写习惯；英文资料里多用Djilas来代替该字母。","他最广为人知的著作之一是《The New Class》（《新阶级》），在冷战语境下影响很大，常出现在政治学、历史与苏联/东欧研究的阅读书目中。"]}
{"word":"djin","summary":{"en":"A djinn (also spelled jinn) is a supernatural spirit in Arabic/Islamic folklore, often linked to magic and wish-granting stories.","zh":"djinn（也写作 jinn）指阿拉伯／伊斯兰民间传说中的精灵或灵体，常与魔法与“许愿”故事相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Arabic and Islamic folklore) a supernatural spirit that can be good, evil, or neutral; often said to be able to change shape and influence humans.","zh":"（阿拉伯与伊斯兰民间传说中的）精灵／灵体；可善可恶或中立，常被认为能变形并影响人类。"},"examples":[{"en":"In the story, a djinn grants the traveler three wishes.","zh":"在故事里，一个 djinn 给了旅人三个愿望。"},{"en":"She warned him not to trust the djinn’s promises.","zh":"她警告他不要相信 djinn 的承诺。"},{"en":"Many tales describe djinn living in deserts or abandoned places.","zh":"许多传说描写 djinn 住在沙漠或荒废之地。"}]}],"synonyms":["jinn","genie (common but not exact)","spirit","demon (sometimes, depending on the story)"],"phonetic":"/dʒɪn/","extraExplanation":["“djin”通常是“djinn / jinn”的另一种拼写或误拼。更常见的英文拼写是 **jinn**（更常用）或 **djinn**（更贴近阿拉伯语音译）。","词源来自阿拉伯语 **jinn**（الجن），与“隐藏、看不见”的概念相关。它不是等同于“genie（神灯精灵）”，但现代英语里常因《一千零一夜》等改编作品而产生联想。","文化上，“jinn/djinn”在伊斯兰传统中是与人类不同的一类受造物；在英文文学与流行文化里，常被用作“神秘、危险、强大但难以捉摸的力量”的象征。"]}
{"word":"djinn","summary":{"en":"A djinn is a supernatural spirit from Middle Eastern/Islamic folklore, often imagined as invisible or shape-shifting and sometimes linked with wish-granting.","zh":"djinn指源自中东/伊斯兰民间传说的超自然精灵/灵体，常被想象为隐形或能变形，有时与“许愿”联系在一起。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In Middle Eastern and Islamic folklore) a supernatural spirit being, often described as invisible or able to change shape; sometimes said to grant wishes or influence humans for good or evil.","zh":"（中东与伊斯兰民间传说中的）精灵/灵体；常被描述为隐形或能变形的超自然存在；有时被说成能实现愿望或影响人类（可善可恶）。"},"examples":[{"en":"In the story, a djinn appears from a lamp and offers three wishes.","zh":"在故事里，一个djinn从灯里出现，并提供三个愿望。"},{"en":"Some tales describe djinn as tricksters who test human character.","zh":"有些传说把djinn描写成爱捉弄人的存在，用来考验人性。"},{"en":"She read a novel where the djinn could take many forms.","zh":"她读的一本小说里，djinn可以变成多种形态。"}]}],"synonyms":["jinn","jinni","genie (popularized, not always accurate)"],"phonetic":"/dʒɪn/","extraExplanation":["“djinn”是阿拉伯语复数形式（单数常写作“jinni”），英语里也常把“djinn”当作可数名词使用（a djinn / two djinn）。","在伊斯兰传统中，djinn被认为是与人类不同的一类受造物；在英语流行文化中常与“genie（灯神）”形象混合，但“genie”更偏向童话化、许愿型的改写。","常见拼写变体有“jinn / djinn / djin”。文学与流行文化中常见于《一千零一夜》相关改编作品。"]}
{"word":"djinni","summary":{"en":"A djinni is a supernatural spirit from Arabic/Islamic folklore; it’s also a common spelling variant of “genie.”","zh":"djinni指阿拉伯/伊斯兰民间传说中的精灵/灵体；也常作为“genie”的另一种拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(in Arabic and Islamic folklore) a supernatural spirit that can be good, evil, or neutral; often imagined as living in a separate, unseen world and sometimes interacting with humans.","zh":"（阿拉伯与伊斯兰民间传说中的）精灵/灵体；可能善良、邪恶或中立，通常被认为生活在看不见的世界里，有时会与人类互动。"},"examples":[{"en":"In the story, a djinni tempts the traveler with a dangerous bargain.","zh":"在故事里，一个djinni用危险的交易诱惑旅人。"},{"en":"Many folktales describe djinnis as powerful beings with their own rules and societies.","zh":"许多民间故事把djinni描述为强大的存在，它们有自己的规则与社会。"}]},{"partOfSpeech":"n.","definition":{"en":"a spelling variant of “genie,” especially in translations and fantasy literature.","zh":"“genie”的另一种拼写（常见于译本与奇幻文学中）。"},"examples":[{"en":"Some books spell it “djinni” to emphasize its Middle Eastern origin.","zh":"有些书把它拼作“djinni”，以强调其中东文化来源。"}]}],"synonyms":["genie","jinni","djinn"],"phonetic":"/dʒɪˈni/","extraExplanation":["“djinni”来自阿拉伯语“jinn”（精灵/灵体）的相关形式。与迪士尼式“许愿神灯”形象不同，传统语境里djinn更复杂：既不一定善，也不一定恶，常被描写为拥有自由意志的存在。","在伊斯兰文化中，“jinn（精灵）”在经典与民间叙事里都有出现。学习和使用这个词时，若在严肃宗教或文化语境中，尽量避免把它简单等同于“会实现愿望的精灵”，以免产生误解。"]}
{"word":"djinns","summary":{"en":"“Djinns” means multiple djinn—supernatural beings from Islamic/Middle Eastern tradition, often called genies in English.","zh":"“Djinns”指多个djinn：源自伊斯兰/中东传统的超自然存在，英文里常被称为genies。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Spirits or supernatural beings in Islamic and Middle Eastern folklore (plural of “djinn”); sometimes translated as “genies.”","zh":"（“djinn”的复数）精灵/神灵一类的超自然存在，源自伊斯兰与中东民间传说；有时译作“神灯精灵/妖灵”。"},"examples":[{"en":"In the story, travelers fear that djinns live in the empty desert ruins.","zh":"在故事里，旅人害怕荒废的沙漠遗迹中住着djinns。"},{"en":"Many people know djinns from folktales, but the idea also appears in religious traditions.","zh":"很多人从民间故事里认识djinns，但这一概念也出现在宗教传统中。"},{"en":"He joked that stress had released a thousand djinns in his mind.","zh":"他开玩笑说压力像在他脑子里放出了上千个djinns。"}]}],"synonyms":["genies","jinns","spirits"],"phonetic":"/dʒɪnz/","extraExplanation":["“djinn / jinn”源自阿拉伯语（جنّ），在伊斯兰文化中是与人类不同的一类受造物，并不一定是“满足愿望”的形象。西方流行文化常把它等同于“genie（神灯精灵）”，但传统叙述里djinns也可能善良、中立或危险。","拼写上：djinns、jinns 都能表示复数；单数常见 djinn 或 jinn。"]}
{"word":"djinny","summary":{"en":"“Djinny” is a nonstandard spelling of “djinn/jinni,” meaning a genie-like spirit from Middle Eastern folklore.","zh":"“djinny”通常是“djinn/jinni”的非标准拼写，指中东民间传说中的“精灵/神灵”一类存在。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a nonstandard spelling of “djinn/jinni,” meaning a genie or a spirit in Islamic and Middle Eastern folklore (often imagined as a powerful supernatural being).","zh":"“djinn/jinni”的非标准拼写，指“精灵/神灵/妖灵”（源自伊斯兰与中东民间传说中的超自然存在，常被想象为很强大的灵体）。"},"examples":[{"en":"In the story, a djinn grants the traveler three wishes.","zh":"在故事里，一个djinn（精灵）满足了旅人三个愿望。"},{"en":"Some books spell it as “djinn,” while others use “jinni.”","zh":"有些书写作“djinn”，也有些写作“jinni”。"}]}],"synonyms":["djinn","jinni","jinn","genie (common but not identical)"],"phonetic":"/dʒɪn/","extraExplanation":["“djinny”在英语中不算常见或标准拼写，更常见的是 djinn（复数常写 djinn）或 jinni（复数 jinn）。如果你是在小说、游戏或同人作品里看到“djinny”，通常就是作者在用变体拼写来营造异域感。","djinn 来自阿拉伯语 جِنّ‎ (jinn)。在传统文化里，jinn 不等同于童话里温和的“精灵”，形象更复杂：可能善良也可能危险；有的传说认为它们有自由意志。","现代英语里，“genie（神灯精灵）”的形象多受《一千零一夜》与影视作品影响，常和 djinn/jinni 混用，但在文化背景上 djinn/jinni 更贴近伊斯兰世界的“jinn”概念。"]}
{"word":"djins","summary":{"en":"“Djins” means “djinn/jinn” in plural: supernatural spirits from Islamic and Middle Eastern folklore.","zh":"“djins”是“djinn/jinn”的复数：指伊斯兰与中东民间传说中的超自然精灵。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"supernatural spirits in Islamic and Middle Eastern folklore; the plural of “djinn” (also spelled “jinn”), often imagined as powerful beings that can help or harm humans.","zh":"伊斯兰与中东民间传说中的超自然精灵；“djinn / jinn”的复数，常被想象成有强大力量、可能帮助也可能伤害人类的存在。"},"examples":[{"en":"In the story, the traveler meets djins in the desert at night.","zh":"在故事里，旅人夜里在沙漠中遇见了djins（精灵）。"},{"en":"Some tales describe djins as invisible beings that live alongside humans.","zh":"一些传说把djins描写成与人类并存、但看不见的存在。"},{"en":"The author uses djins to create a mysterious, magical atmosphere.","zh":"作者用djins来营造神秘、魔幻的氛围。"}]}],"synonyms":["djinns","jinn","genies (related, but not identical)"],"phonetic":"/dʒɪnz/","extraExplanation":["“djins”在英语里较少见，更常见的复数写法是“djinns”或“jinn”。“genie（精灵/神灯精灵）”是相关但更偏西方改写后的形象，和原本伊斯兰传统中的“jinn/djinn”不完全相同。","词源来自阿拉伯语“jinn（جنّ）”。在传统宗教语境里，jinn被视为一种受造物，并不等同于童话里的“许愿精灵”。","文学与流行文化中常借用djinn/jinn来塑造异域、神秘的氛围；阅读时可根据作品语境判断是宗教概念还是奇幻设定。"]}
{"word":"Djokjakarta","summary":{"en":"Djokjakarta is an old spelling of Yogyakarta (Jogja) in Indonesia.","zh":"Djokjakarta 是印度尼西亚日惹（Yogyakarta／Jogja）的旧拼写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an older spelling of Yogyakarta (a special region and city on the island of Java, Indonesia).","zh":"日惹（Yogyakarta，印度尼西亚爪哇岛上的一个特区与城市）的旧拼写。"},"examples":[{"en":"Djokjakarta is an older spelling you may see in historical texts about Java.","zh":"在一些关于爪哇的历史资料里，你可能会看到用 Djokjakarta 这种旧拼写。"},{"en":"Today, most maps and news use Yogyakarta (or Jogjakarta).","zh":"如今，大多数地图和新闻会使用 Yogyakarta（或 Jogjakarta）。"}]}],"synonyms":["Yogyakarta","Jogjakarta","Jogja"],"phonetic":"/ˌdʒoʊɡdʒəˈkɑːrtə/","extraExplanation":["“Djokjakarta”主要出现在较早期的英文/荷兰语罗马字转写中；后来更常见的形式是“Jogjakarta”，而官方与国际上更普遍使用的是“Yogyakarta”。","之所以会有不同拼法，和殖民时期的拼写体系（尤其荷兰语影响）以及印尼语拼写改革有关。"]}
{"word":"DJS","summary":{"en":"DJS most commonly means the plural of DJ (disc jockeys). In some contexts, it may be an organization abbreviation.","zh":"DJS 最常见是 DJ（打碟者/唱片骑师）的复数；在某些语境下也可能是某个机构名称的缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"plural of DJ: people who play and mix recorded music, especially at clubs, parties, radio, or events.","zh":"DJ 的复数：指在俱乐部、派对、电台或活动中播放并混音音乐的人（唱片骑师/打碟者）。"},"examples":[{"en":"The club hired three DJS for the weekend.","zh":"这家俱乐部周末请了三位 DJ。"},{"en":"Many DJS post their mixes online to build an audience.","zh":"很多 DJ 会把混音发到网上来积累听众。"},{"en":"At the wedding, the DJS took requests from guests.","zh":"在婚礼上，DJ 会接受宾客点歌。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation that can refer to different organizations depending on context (for example, some places use DJS for a government or school office name).","zh":"缩写：在不同语境下可能指不同机构名称（例如某些地区用 DJS 代表某个政府部门或学校办公室）。"},"examples":[{"en":"Please check with DJS before submitting the form.","zh":"提交表格前请先和 DJS 确认。"},{"en":"In this document, DJS refers to a local agency name.","zh":"在这份文件中，DJS 指的是一个本地机构名称。"}]}],"synonyms":["DJs","disc jockeys"],"phonetic":"ˈdiːˌdʒeɪz","extraExplanation":["英语里更常见的写法是“DJs”（只把 j 小写），因为 DJ 来自 “disc jockey”。全大写 “DJS” 也可能是某些组织的正式缩写；需要结合具体文本（公司/学校/政府文件）才能确定含义。"]}
{"word":"DJT","summary":{"en":"DJT usually refers to Donald J. Trump or the stock ticker DJT (Trump Media & Technology Group).","zh":"DJT通常指唐纳德·J·特朗普，或指股票代码DJT（特朗普媒体与科技集团）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Donald J. Trump,” the 45th and 47th President of the United States; often used in news, social media, and political discussions.","zh":"“Donald J. Trump（唐纳德·J·特朗普）”的缩写；常见于新闻、社交媒体与政治讨论中。"},"examples":[{"en":"Some headlines use “DJT” to refer to Donald J. Trump in a shorter way.","zh":"有些新闻标题会用“DJT”来简写指代唐纳德·J·特朗普。"},{"en":"People argued online about what DJT said during the speech.","zh":"人们在网上争论DJT在演讲中说了什么。"}]},{"partOfSpeech":"other","definition":{"en":"a U.S. stock ticker symbol for Trump Media & Technology Group (the company behind Truth Social).","zh":"美国股市代码（股票代码），指 Trump Media & Technology Group（特朗普媒体与科技集团，Truth Social 的母公司）。"},"examples":[{"en":"DJT rose after the company released a major announcement.","zh":"公司发布重大消息后，DJT 股价上涨。"},{"en":"I’m not giving financial advice, but you can look up DJT on most stock apps.","zh":"我不是在提供理财建议，但你可以在大多数股票App里搜索DJT。"}]}],"synonyms":["Donald J. Trump","Trump","ticker: DJT","Trump Media & Technology Group"],"phonetic":"/ˌdiː dʒeɪ ˈtiː/","extraExplanation":["“DJT”属于缩写/首字母词，常见读法是把字母逐个读出来（D-J-T），而不是读成一个单词。","在不同语境中“DJT”可能指人名或股票代码；阅读时可通过上下文判断：政治新闻/评论更可能是指特朗普本人，财经语境（价格、涨跌、股票、ticker）更可能是指股票代码。"]}
{"word":"dju","summary":{"en":"“dju” isn’t a common English word; it’s usually a context-dependent abbreviation or a typo.","zh":"“dju”不是常见英语词；通常是依语境而定的缩写或拼写错误。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; usually seen as an abbreviation, username, or a typo (often for “DJ,” “did you,” or “do you”). Meaning depends on context.","zh":"不是标准英语单词；多见于缩写、网名/用户名或拼写错误（常被当作“DJ”“did you”“do you”的误写）。具体含义取决于上下文。"},"examples":[{"en":"I saw “dju” in a chat message, but it wasn’t clear what it meant.","zh":"我在聊天里看到“dju”，但不清楚它是什么意思。"},{"en":"Do you mean “DJ” (a music disc jockey) instead of “dju”?","zh":"你是不是想写“DJ”（唱片骑师/打碟的人），而不是“dju”？"}]}],"synonyms":["DJ (possible intended form)","abbr. (context-dependent)"],"phonetic":"/diː dʒeɪ/","extraExplanation":["“dju”本身在常见英文字典里没有固定词义。网络语境中可能是随手敲错、也可能是特定圈子/学校/组织的缩写（acronym）。如果你把它放进一句完整的话里（或告诉我它出现的平台/主题），我可以更准确判断。","如果你原本想查的是“DJ”，它读作 /diː dʒeɪ/，常指“打碟/放歌的人（disc jockey）”。"]}
{"word":"Djuka","summary":{"en":"Djuka is mainly used as a South Slavic personal name or nickname.","zh":"Djuka 主要用作南斯拉夫地区的人名或昵称。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A personal name (usually a male given name or nickname) used in some South Slavic languages (e.g., Serbian/Croatian).","zh":"（人名）在一些南斯拉夫语言中使用的名字，常见为男性名或昵称（如塞尔维亚语/克罗地亚语）。"},"examples":[{"en":"Djuka is my grandfather’s nickname.","zh":"Djuka 是我爷爷的昵称。"},{"en":"In the story, Djuka helps the main character find his way home.","zh":"在故事里，Djuka 帮主角找到回家的路。"}]}],"phonetic":"/ˈdʒuːkə/","extraExplanation":["“Djuka”常被视为对“Đuka/Đuro/Đorđe”等名字的昵称或变体，具体来源因地区与家庭习惯而异。","拼写里的“Dj”常用来表示类似英语“judge”开头的 /dʒ/ 音；在一些正字法里也会用字母“Đ/đ”表示相近的音。"]}
{"word":"djuka","summary":{"en":"Djuka usually refers to the Ndyuka people (a Maroon group in Suriname/French Guiana) or their creole language.","zh":"Djuka 通常指恩迪尤卡人（苏里南/法属圭亚那的马龙族群）或他们的克里奥尔语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of the Ndyuka (also spelled Djuka) Maroon people of Suriname and French Guiana.","zh":"恩迪尤卡人（也拼作 Djuka）的成员；该族群是苏里南与法属圭亚那的马龙人（逃离奴役后形成的社群）。"},"examples":[{"en":"The Djuka are one of several Maroon communities in Suriname.","zh":"Djuka（恩迪尤卡人）是苏里南数个马龙社群之一。"},{"en":"She is Djuka and grew up along the Tapanahoni River.","zh":"她是 Djuka（恩迪尤卡）人，在塔帕纳霍尼河沿岸长大。"}]},{"partOfSpeech":"n.","definition":{"en":"the Ndyuka (Djuka) language, an English-based creole spoken mainly in Suriname.","zh":"恩迪尤卡语（也称 Djuka 语）：主要在苏里南使用的一种以英语为基础的克里奥尔语。"},"examples":[{"en":"He can speak Djuka at home and Dutch at school.","zh":"他在家说 Djuka（恩迪尤卡语），在学校说荷兰语。"},{"en":"This story was recorded in Djuka and later translated into English.","zh":"这个故事先用 Djuka（恩迪尤卡语）记录，后来翻译成英语。"}]}],"synonyms":["Ndyuka","Aukan","Ndyuka language"],"phonetic":"/ˈdʒuːkə/","extraExplanation":["“Djuka”更常见于较早或外来文献的拼写；在语言学与当代写法中更常用“Ndyuka”。","“Maroon（马龙人）”指在美洲殖民时期逃离奴役、在雨林或偏远地区建立自治社群的非裔群体；苏里南的马龙社群较为著名。"]}
