{"word":"dl","summary":{"en":"“dl/DL” is a common abbreviation meaning “download,” and it can also mean “driver’s license,” depending on context.","zh":"“dl/DL”常见是“download（下载）”的缩写，也可能指“driver’s license（驾照）”，要看语境。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(abbr.) short for “download”; to copy data (like a file, app, or video) from the internet onto your phone or computer.","zh":"（缩写）“download（下载）”的简写；把网络上的文件、应用或视频等复制到你的手机或电脑里。"},"examples":[{"en":"Where can I dl the app?","zh":"我在哪里可以下载这个应用？"},{"en":"I’ll dl the PDF and send it to you.","zh":"我会把这个 PDF 下载下来并发给你。"}]},{"partOfSpeech":"other","definition":{"en":"(abbr.) “DL” can also mean “driver’s license” in everyday English.","zh":"（缩写）“DL” 在日常英语里也常指 “driver’s license（驾照）”。"},"examples":[{"en":"Do you have your DL with you?","zh":"你带驾照了吗？"},{"en":"You’ll need a valid DL to rent a car.","zh":"租车需要有效的驾照。"}]}],"synonyms":["download","get (a file)","save"],"phonetic":"/ˌdiːˈɛl/","extraExplanation":["“dl/DL”在不同领域含义不同，常见还有：dL（deciliter，分升，容量单位；多见于医学化验如 mg/dL）、DL（deep learning，深度学习）、DL（down-low，口语指“低调/不公开地”做某事，特定语境可能涉及隐私与性取向话题，使用需谨慎）。","在短信、聊天语境里，“dl”更像非正式写法；在正式写作中建议写全“download”或用更清晰的表达（如 “download the file”）。"]}
{"word":"DLA","summary":{"en":"DLA is usually an abbreviation, most commonly for the U.S. Defense Logistics Agency.","zh":"DLA 通常是缩写，最常见指美国“国防后勤局”（Defense Logistics Agency）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Defense Logistics Agency,” a U.S. Department of Defense organization that supplies the military with equipment, fuel, food, and other materials","zh":"“Defense Logistics Agency（国防后勤局）”的缩写；美国国防部下属机构，负责为军队提供装备、燃料、食品等物资保障"},"examples":[{"en":"The DLA manages large contracts for military supplies.","zh":"DLA 负责管理大量军需物资的合同。"},{"en":"The company became a vendor for the DLA.","zh":"这家公司成为了 DLA 的供货商。"}]},{"partOfSpeech":"other","definition":{"en":"a less common abbreviation that can mean different things depending on the field (for example, in business or tech)","zh":"较不常见的缩写；在不同领域里可能代表不同含义（例如商业或科技语境中）"},"examples":[{"en":"In this report, DLA refers to a specific internal process.","zh":"在这份报告里，DLA 指的是某个内部流程。"},{"en":"Ask what DLA stands for in this context.","zh":"最好先问清楚在这个语境下 DLA 代表什么。"}]}],"synonyms":["Defense Logistics Agency"],"phonetic":"/ˌdiː ɛl ˈeɪ/","extraExplanation":["“DLA”通常按字母逐个读作 “D-L-A”。它不是一个固定词义的普通单词，而是缩写/首字母词，最常见的指美国的 Defense Logistics Agency。","如果你是在特定文章、课程或行业材料里看到 DLA，建议把那一句或段落发来，我可以帮你判断它在该语境中的准确含义。"]}
{"word":"DLC","summary":{"en":"DLC most commonly means “downloadable content,” extra game content you download after release; it can also mean “Data Link Control” in networking.","zh":"DLC最常见指游戏的“可下载内容”，也可指网络通信中的“数据链路控制”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"downloadable content; extra digital material (such as new levels, characters, missions, or cosmetics) added to a video game after release, usually downloaded from the internet (sometimes free, often paid).","zh":"（游戏）可下载内容；指游戏发售后通过网络下载的额外数字内容（如新关卡、角色、任务或外观等），可能免费，也常需付费。"},"examples":[{"en":"This game has a lot of DLC, including new story missions.","zh":"这款游戏有很多DLC，包括新的剧情任务。"},{"en":"The DLC adds two new characters and a new map.","zh":"这个DLC增加了两个新角色和一张新地图。"},{"en":"I’m waiting for a sale before I buy the DLC.","zh":"我在等打折再买DLC。"}]},{"partOfSpeech":"n.","definition":{"en":"(computing/telecom) Data Link Control; a set of rules or procedures for reliable data transfer at the data-link layer.","zh":"（计算机/通信）数据链路控制；指在数据链路层用于可靠传输数据的一套规则或过程。"},"examples":[{"en":"The protocol includes DLC functions to reduce transmission errors.","zh":"该协议包含DLC功能以减少传输错误。"},{"en":"DLC helps manage frames and acknowledgments between devices.","zh":"DLC有助于在设备之间管理帧与确认信息。"}]},{"partOfSpeech":"n.","definition":{"en":"(biology) DLC (often written dlc); a gene name in fruit flies, short for “Drosophila light chain.”","zh":"（生物）DLC（常写作dlc）；果蝇中的基因名称，源自“果蝇轻链”（Drosophila light chain）的缩写。"},"examples":[{"en":"The paper discusses mutations in the dlc gene.","zh":"这篇论文讨论了dlc基因的突变。"}]}],"synonyms":["add-on","expansion","expansion pack","extra content"],"phonetic":"/ˌdiː.ɛlˈsiː/","extraExplanation":["在游戏语境里，DLC 常与“扩展包/资料片（expansion）”“季票（season pass）”“皮肤（skin）”“微交易（microtransactions）”一起出现：expansion 往往内容更大、像大型追加章节；season pass 通常是一次购买、未来分批获得多个DLC。购买前可以留意它是“剧情内容”还是“纯外观”。"]}
{"word":"DLCU","summary":{"en":"DLCU is usually an initialism whose meaning depends on context; common uses include Data Link Control Unit (engineering/transport) and Door Lock Control Unit (automotive).","zh":"DLCU通常是首字母缩略词，含义依语境而定；常见用法包括数据链路控制单元（工程/交通）与车门锁控制单元（汽车）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation used in engineering/transport contexts for “Data Link Control Unit,” a device/module that manages data-link communication.","zh":"（工程/交通领域）“Data Link Control Unit”的缩写，指用于管理数据链路通信的设备/模块。"},"examples":[{"en":"The technician replaced the DLCU to restore stable communication between the control system and the sensors.","zh":"技术人员更换了DLCU，以恢复控制系统与传感器之间的稳定通信。"},{"en":"Check the DLCU status before troubleshooting the network issue.","zh":"在排查网络问题前，先检查DLCU的状态。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation in automotive contexts for “Door Lock Control Unit,” the module that controls a vehicle’s door-lock system.","zh":"（汽车领域）“Door Lock Control Unit”的缩写，指控制车辆门锁系统的控制模块。"},"examples":[{"en":"If the remote key doesn’t lock the doors, the DLCU may be faulty.","zh":"如果遥控钥匙无法锁车，DLCU可能出了故障。"},{"en":"The mechanic tested the DLCU wiring for loose connections.","zh":"技师检测了DLCU的线束是否有松动接触。"}]},{"partOfSpeech":"other","definition":{"en":"a less common initialism whose meaning depends on the organization or field (e.g., the name of a unit/department in a school or company).","zh":"较不常见的首字母缩略词，含义取决于具体机构或领域（例如学校/公司某个部门或项目名称）。"},"examples":[{"en":"In this document, DLCU refers to the training unit responsible for onboarding.","zh":"在这份文件中，DLCU指负责入职培训的部门。"},{"en":"Could you tell me what DLCU stands for in your company’s handbook?","zh":"你能告诉我在你们公司的员工手册里DLCU代表什么吗？"}]}],"synonyms":["initialism","abbreviation"],"phonetic":"/ˌdiː ɛl siː ˈjuː/","extraExplanation":["“DLCU”通常作为首字母缩略词（initialism）使用，最常见的读法是按字母读：D-L-C-U。","它不像“DLC（downloadable content，可下载内容）”那样在大众语境中固定含义，因此看到DLCU时最好结合上下文（汽车、航空、IT、机构文件等）确认。","如果你把出现DLCU的原句/领域发我，我可以帮你锁定最准确的释义。"]}
{"word":"DLE","summary":{"en":"DLE is an abbreviation most commonly meaning Dual-Language Education or Digital Learning Environment; the exact meaning depends on context.","zh":"DLE是一个缩写，最常见指“双语教育（Dual-Language Education）”或“数字化学习环境（Digital Learning Environment）”；具体含义取决于上下文。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(education) Abbreviation for “Dual-Language Education,” a program where students learn content in two languages (often English and another language) to build bilingualism and literacy.","zh":"（教育）“Dual-Language Education”的缩写，指用两种语言（常见为英语+另一种语言）教授课程内容的项目，目标是培养双语能力与读写能力。"},"examples":[{"en":"Our school offers DLE in English and Spanish starting in kindergarten.","zh":"我们学校从幼儿园开始提供英语和西班牙语的DLE双语项目。"},{"en":"DLE programs often aim for students to become fluent in both languages.","zh":"DLE项目通常希望学生能同时流利掌握两种语言。"}]},{"partOfSpeech":"n.","definition":{"en":"(tech/education) Abbreviation for “Digital Learning Environment,” meaning an online platform or system used for teaching and learning (for example, a learning management system).","zh":"（科技/教育）“Digital Learning Environment”的缩写，指用于教学与学习的线上平台或系统（例如学习管理系统）。"},"examples":[{"en":"Please upload your homework to the DLE by Friday.","zh":"请在周五前把作业上传到DLE平台。"},{"en":"The new DLE makes it easier to share class materials.","zh":"新的DLE让分享课程资料更方便。"}]},{"partOfSpeech":"n.","definition":{"en":"(other fields) An initialism used for different phrases depending on the industry (for example, certain company names, departments, or technical terms). Meaning depends on context.","zh":"（其他领域）在不同行业中可能代表不同词组（例如公司名、部门名或技术术语）。具体含义需要结合上下文判断。"},"examples":[{"en":"In this document, DLE refers to a specific internal team.","zh":"在这份文件里，DLE指的是一个特定的内部团队。"},{"en":"Could you clarify what DLE stands for in your email?","zh":"你能说明一下在邮件里DLE代表什么吗？"}]}],"synonyms":["dual-language education","digital learning environment","initialism","abbreviation"],"phonetic":"/ˌdiː ɛl ˈiː/","extraExplanation":["“DLE”通常读作三个字母的首字母缩略词（initialism），写作全大写。不同机构会用它指不同概念，因此最可靠的方法是查看文件开头的定义、课程说明或询问对方“DLE stands for what?”。","在教育语境里，“Dual-Language Education（双语/沉浸式双语教育）”是非常常见的含义；在学校技术语境里，“Digital Learning Environment（数字化学习环境/学习平台）”也很常见。"]}
{"word":"dle","summary":{"en":"“DLE” is usually an abbreviation; common meanings include “Digital Learning Environment” (education) and “discoid lupus erythematosus” (medicine).","zh":"“DLE”通常是缩写；常见含义包括“Digital Learning Environment（数字化学习环境）”（教育）和“discoid lupus erythematosus（盘状红斑狼疮）”（医学）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(abbr.) A written abbreviation for several different things; its meaning depends on the context (field, country, sentence).","zh":"（缩写）可代表多种不同含义，具体意思取决于语境（领域、国家、句子）。"},"examples":[{"en":"In some schools, DLE means a Digital Learning Environment (an online platform for classes).","zh":"在一些学校里，DLE 指 Digital Learning Environment（数字化学习环境/线上学习平台）。"},{"en":"The report uses many abbreviations like DLE, so check the glossary first.","zh":"这份报告用了很多像 DLE 这样的缩写，所以先查看术语表/词汇表。"}]},{"partOfSpeech":"n.","definition":{"en":"(medicine) DLE: discoid lupus erythematosus, a type of lupus that mainly affects the skin.","zh":"（医学）DLE：discoid lupus erythematosus（盘状红斑狼疮），一种主要影响皮肤的红斑狼疮类型。"},"examples":[{"en":"The dermatologist mentioned DLE after examining the skin lesions.","zh":"皮肤科医生检查皮损后提到了 DLE（盘状红斑狼疮）。"}]}],"synonyms":["abbreviation","initialism","acronym"],"phonetic":"/diː ɛl iː/","extraExplanation":["“dle”本身不是常见英语单词，更常见的是大写形式 “DLE” 作为缩写。你如果能提供一句话（上下文），我可以帮你确定它具体代表什么。","有时 “dle” 也可能是拼写没打全或打错了，比如想输入 “idle”（空闲的/闲置的）或其他词。"]}
{"word":"DLG","summary":{"en":"DLG is an abbreviation most commonly meaning “dialogue/dialog,” and in some technical contexts it can mean “digital logic gate.”","zh":"DLG 是缩写，最常见表示“dialogue/dialog（对话/台词）”，在部分技术语境中也可指“digital logic gate（数字逻辑门）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “dialogue” (also spelled “dialog”); used in scripts, subtitles notes, or game/app file names to mean spoken lines or conversational text","zh":"“dialogue / dialog（对话、台词）”的缩写；常见于剧本、字幕标注或游戏/软件文件名，表示角色说的话或对话文本"},"examples":[{"en":"The editor fixed the DLG timing so the lines match the actors’ lips.","zh":"剪辑师调整了对话（DLG）的时间点，让台词和演员口型对上。"},{"en":"Please translate the DLG for Scene 3 into Chinese.","zh":"请把第3场的台词/对话（DLG）翻译成中文。"},{"en":"The folder “DLG” contains all the character conversations.","zh":"“DLG”文件夹里包含所有角色对话内容。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation used in some technical contexts for “digital logic gate” (a basic building block in electronics/computing)","zh":"在部分技术语境中表示“digital logic gate（数字逻辑门）”，是电子与计算机中的基础电路单元"},"examples":[{"en":"In this circuit, each DLG takes two inputs and produces one output.","zh":"在这个电路里，每个数字逻辑门（DLG）接收两个输入并产生一个输出。"},{"en":"We modeled the DLG behavior using simple truth tables.","zh":"我们用简单的真值表来建模数字逻辑门（DLG）的行为。"}]}],"synonyms":["dialogue (abbr.)","dialog (abbr.)"],"phonetic":"ˌdiː ɛl ˈdʒiː","extraExplanation":["“DLG”是缩写，离开上下文可能有多种含义。最常见的（在影视/字幕/游戏本地化里）通常指“对话/台词”。如果你能告诉我它出现的领域（比如聊天、游戏文件、课程、公司名），我可以帮你确定最准确的意思。"]}
{"word":"DLI","summary":{"en":"DLI most commonly means the U.S. Defense Language Institute; in other contexts it can stand for different terms, so you need the surrounding context.","zh":"DLI最常见指美国国防语言学院；在其他语境中也可能代表不同缩写，需要结合上下文判断。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Defense Language Institute: a U.S. military school where service members (and some civilians) study foreign languages, best known for DLI in Monterey, California.","zh":"（美国）国防语言学院：美军的外语培训机构（也有少量文职人员），最有名的是加州蒙特雷的DLI。"},"examples":[{"en":"She’s studying Arabic at DLI in Monterey.","zh":"她正在蒙特雷的DLI学习阿拉伯语。"},{"en":"After basic training, he was sent to DLI for Korean.","zh":"基础训练后，他被派去DLI学习韩语。"}]},{"partOfSpeech":"other","definition":{"en":"DLI (various fields): an abbreviation used by different organizations/industries for different phrases (for example, a government department name or a business metric). The exact meaning depends on context.","zh":"DLI（多领域缩写）：不同机构/行业用DLI代表不同词组（例如某个政府部门名称或商业指标），具体含义取决于语境。"},"examples":[{"en":"In this report, DLI refers to a performance index, not a school.","zh":"在这份报告里，DLI指的是一个绩效指数，不是学校。"},{"en":"Ask what DLI stands for in their document, because it can vary.","zh":"最好问清楚他们文件里的DLI代表什么，因为可能不一样。"}]}],"synonyms":["Defense Language Institute (when referring to the school)"],"phonetic":"/ˌdiː ɛl ˈaɪ/","extraExplanation":["在口语里，DLI通常逐字母读作“D-L-I”。在美国军事或语言学习语境中，最常见的指代是Defense Language Institute。不同地区/行业也可能把DLI当作本地机构名或专业术语缩写，所以看到DLI时，最可靠的方法是先看标题、机构名称或第一次出现处是否有全称（full form）。"]}
{"word":"dlice","summary":{"en":"“Dlice” is likely a misspelling of “slice”: a thin piece of something, or the act of cutting into thin pieces; it can also mean a share/portion, or a curving spin shot in sports.","zh":"“dlice”很可能是“slice”的拼写错误：指薄片，或切成薄片的动作；也可指“一份/一部分”，在运动中还可指“切削球”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Usually spelled “slice.”) A thin, flat piece cut from something, especially food (like bread or cake).","zh":"（通常拼作“slice”。）从某物上切下的薄片，尤指食物（如面包、蛋糕）。"},"examples":[{"en":"Could I have a slice of pizza?","zh":"我可以要一片披萨吗？"},{"en":"She cut the cake into eight slices.","zh":"她把蛋糕切成了八片。"}]},{"partOfSpeech":"vt.","definition":{"en":"To cut something into thin, flat pieces.","zh":"把某物切成薄片。"},"examples":[{"en":"Slice the tomatoes and add them to the salad.","zh":"把番茄切片，然后加到沙拉里。"},{"en":"He sliced the bread with a sharp knife.","zh":"他用一把锋利的刀切面包。"}]},{"partOfSpeech":"n.","definition":{"en":"A share or part of something (often used with “of”).","zh":"（常与“of”连用）一份；一部分。"},"examples":[{"en":"Everyone wants a slice of the market.","zh":"每个人都想分到市场的一杯羹。"},{"en":"This job gives me a slice of real experience.","zh":"这份工作让我获得一部分真实的经验。"}]},{"partOfSpeech":"n.","definition":{"en":"A shot in tennis or other sports that curves sideways because of spin (also called “slice shot”).","zh":"（网球等）由于旋转而向侧面弯曲的击球（也叫“切削球/切球”）。"},"examples":[{"en":"His slice made the ball skid low after it landed.","zh":"他的切削球让球落地后贴地滑行。"}]}],"synonyms":["piece","portion","cut","sliver"],"phonetic":"/slaɪs/","extraExplanation":["“dlice”不是常见英文单词，最可能是把“slice”里的 s 打错了。","“a slice of …”既可以表示“某物的一片”，也常用于比喻，表示“分到的一份利益/机会”（类似中文“一杯羹”）。"]}
{"word":"DLitt","summary":{"en":"DLitt (often written D.Litt.) means Doctor of Letters, a high-level doctorate in the humanities, sometimes honorary.","zh":"DLitt（常写作 D.Litt.）指 Doctor of Letters（文学博士/文科高等博士），属于人文学科的高等级博士学位，有时也为荣誉学位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an abbreviation for Doctor of Letters (D.Litt.), a high-level academic doctorate in the humanities (such as literature, languages, history, or philosophy), sometimes awarded as an honorary degree","zh":"Doctor of Letters（文学博士/文科高等博士，常写作 D.Litt.）的缩写；属于人文学科（如文学、语言、历史、哲学等）的高等级博士学位，有时也作为荣誉学位授予"},"examples":[{"en":"She received a D.Litt. for her contributions to literary studies.","zh":"她因对文学研究的贡献获得了 D.Litt.（文学博士）学位。"},{"en":"His name appeared as “Prof. James Lee, D.Litt.” in the program.","zh":"节目单上写着“James Lee 教授，D.Litt.”。"},{"en":"The university awarded her an honorary D.Litt.","zh":"这所大学授予她荣誉 D.Litt.（荣誉文学博士）。"}]}],"synonyms":["D.Litt.","Doctor of Letters","Litt.D."],"phonetic":"/ˌdiːˈlɪt/","extraExplanation":["D.Litt. 常见于英式与英联邦高校体系中，既可能指“研究型高等博士”（通常高于 PhD，需以大量已发表成果申请），也可能指“荣誉博士”（honorary degree），具体含义要看学校与语境。","写法上常见 D.Litt.（带点）或 DLitt（不带点）；在姓名后作为头衔/学位后缀使用，例如 “A. Smith, D.Litt.”。在美国语境中更常见的对应写法是 “Litt.D.” 或直接写 “Doctor of Letters”。"]}
{"word":"DLL","summary":{"en":"DLL usually means “dynamic-link library,” a Windows file that provides shared code/resources for programs.","zh":"DLL 通常指“动态链接库”，是在 Windows 中为程序提供可共享代码/资源的文件。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(computing) A dynamic-link library: a file (usually in Microsoft Windows) that contains code and resources a program can use while it runs.","zh":"（计算机）动态链接库：一种文件（常见于微软 Windows），里面包含程序在运行时可调用的代码和资源。"},"examples":[{"en":"The app won’t start because a required DLL file is missing.","zh":"这个应用无法启动，因为缺少一个必需的 DLL 文件。"},{"en":"Windows loads the DLL when the program needs that feature.","zh":"当程序需要某个功能时，Windows 会加载相应的 DLL。"},{"en":"Update the software to get the latest DLL version.","zh":"更新软件以获取最新版本的 DLL。"}]}],"synonyms":["dynamic-link library","shared library"],"phonetic":"/ˌdiː.ɛlˈɛl/","extraExplanation":["DLL 是 Dynamic-Link Library 的缩写，常见扩展名为 .dll。它把常用功能“打包”成可共享的模块，多个程序可以复用，从而节省磁盘空间、便于更新。","在 Windows 中，DLL 往往与系统组件或软件一起安装；若 DLL 版本不匹配，可能出现“缺少 DLL / 找不到入口点”等报错。","安全提醒：不要随便从不明网站下载“缺失的 DLL”，可能夹带恶意软件。更安全的做法是通过软件官方安装包、系统更新或正规修复工具来解决。"]}
{"word":"DLO","summary":{"en":"DLO is an abbreviation with meanings that change by context (often finance/business).","zh":"DLO 是一个缩写，含义随语境变化（常见于金融/商务）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation used for different phrases depending on context (commonly seen in business/finance or online communities).","zh":"一个缩写，具体含义取决于语境（常见于商业/金融或网络社群）。"},"examples":[{"en":"What does DLO mean in this report?","zh":"这份报告里的 DLO 是什么意思？"},{"en":"In this company, DLO refers to a specific department name.","zh":"在这家公司里，DLO 指的是某个部门名称。"}]},{"partOfSpeech":"other","definition":{"en":"(finance) Direct Loan Origination: the process/system of creating and issuing loans directly (often used by lenders or banks).","zh":"（金融）Direct Loan Origination（直接贷款发起/放款发起）：指机构直接创建并发放贷款的流程或系统。"},"examples":[{"en":"The bank upgraded its DLO platform to speed up approvals.","zh":"这家银行升级了 DLO 平台，以加快审批速度。"},{"en":"She works in DLO, helping review loan applications.","zh":"她在 DLO 相关岗位工作，负责审核贷款申请。"}]},{"partOfSpeech":"other","definition":{"en":"(business/operations) a short form for a role or team name, such as District/Division Liaison Officer, used inside some organizations.","zh":"（商务/运营）某些组织内部对岗位或团队名称的简称，例如 District/Division Liaison Officer（地区/部门联络官）。"},"examples":[{"en":"Please contact the DLO for coordination with local offices.","zh":"请联系 DLO，协调各地办公室的工作。"}]}],"synonyms":["abbrev.","acronym","initialism"],"phonetic":"/ˌdiː ɛl ˈoʊ/","extraExplanation":["“DLO”不是一个固定的单词，更像“缩写/首字母简称”。不同公司、行业、社群会给它不同释义。你可以把它出现的完整句子或所在领域（例如：银行系统、公司组织架构、游戏/社交平台）发我，我可以帮你锁定最准确的意思。"]}
{"word":"DLP","summary":{"en":"DLP most commonly means Data Loss Prevention (information security), and it can also mean Digital Light Processing (projection/display technology).","zh":"DLP 最常见指数据防泄露（信息安全领域），也可指数字光处理（投影/显示技术）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Data Loss Prevention) A set of tools and policies that help stop sensitive information (like customer data or company secrets) from being leaked, stolen, or shared improperly.","zh":"（数据防泄露）一套工具与管理策略，用来防止敏感信息（如客户数据、公司机密）被泄露、被盗或被不当分享。"},"examples":[{"en":"Our company uses DLP to prevent employees from emailing customer lists outside the organization.","zh":"我们公司使用 DLP 来防止员工把客户名单通过邮件发到公司外部。"},{"en":"The DLP system flagged the file because it contained passport numbers.","zh":"DLP 系统标记了这个文件，因为里面包含护照号码。"}]},{"partOfSpeech":"other","definition":{"en":"(Digital Light Processing) A display/projection technology that uses tiny mirrors to create images, commonly found in some projectors and TVs.","zh":"（数字光处理）一种显示/投影技术，通过微小反射镜成像，常见于一些投影仪和电视。"},"examples":[{"en":"This classroom projector is a DLP model, so the image looks bright and sharp.","zh":"这台教室投影仪是 DLP 机型，所以画面看起来明亮清晰。"},{"en":"Some people notice a “rainbow effect” on certain DLP projectors.","zh":"有些人会在某些 DLP 投影仪上注意到“彩虹效应”。"}]}],"synonyms":["Data Loss Prevention","Digital Light Processing"],"phonetic":"ˌdiː ɛl ˈpiː","extraExplanation":["在职场英文里，如果你在邮件安全、合规（compliance）、信息安全（security）语境看到 DLP，几乎总是指 Data Loss Prevention。常见搭配：DLP policy（防泄露策略）、DLP alert（告警）、endpoint DLP（终端防泄露）、cloud DLP（云端防泄露）。","在影音/硬件评测语境里，DLP 通常指 Digital Light Processing（投影技术）。与 LCD projector（液晶投影）、LCoS 等技术经常被放在一起比较。"]}
{"word":"DLS","summary":{"en":"DLS is an acronym with several possible meanings; common ones include Digital Learning System, Document-Level Security, and Dynamic Lighting System.","zh":"DLS 是一个多义缩写；常见含义包括“数字化学习系统”“文档级安全”“动态照明系统”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation (initialism) for many different phrases; the exact meaning depends on the context (field, company, or country).","zh":"缩写（首字母缩略词）；具体含义取决于语境（行业、公司或国家）。"},"examples":[{"en":"What does DLS stand for in this document?","zh":"这份文件里的 DLS 是什么意思？"},{"en":"In tech, DLS can mean different systems depending on the product.","zh":"在科技领域里，DLS 可能指不同的系统，取决于具体产品。"}]},{"partOfSpeech":"n.","definition":{"en":"(education/tech) Digital Learning System: an online platform used to deliver lessons, assignments, and learning resources.","zh":"（教育/科技）数字化学习系统：用于提供课程、作业和学习资源的在线平台。"},"examples":[{"en":"Our school uses a DLS to post homework and grades.","zh":"我们学校用数字化学习系统发布作业和成绩。"},{"en":"The teacher uploaded the video to the DLS.","zh":"老师把视频上传到了学习系统里。"}]},{"partOfSpeech":"n.","definition":{"en":"(security/IT) Document-Level Security: rules that control who can access specific documents or records.","zh":"（信息安全/IT）文档级安全：控制谁能访问特定文档或记录的权限规则。"},"examples":[{"en":"We enabled DLS so only managers can open salary files.","zh":"我们启用了文档级安全，只有经理能打开薪资文件。"},{"en":"DLS helps protect sensitive documents from unauthorized users.","zh":"文档级安全能帮助保护敏感文件，防止未授权用户访问。"}]},{"partOfSpeech":"n.","definition":{"en":"(automotive/engineering) Dynamic Lighting System: a lighting setup (often in cars) that adjusts automatically to improve visibility.","zh":"（汽车/工程）动态照明系统：会自动调整以提升可视性的照明系统（常见于汽车）。"},"examples":[{"en":"The DLS turns the headlights as you steer around a curve.","zh":"车辆转弯时，动态照明系统会让车灯随方向转动。"},{"en":"With DLS, the lights adapt to speed and road conditions.","zh":"有了动态照明系统，灯光会根据车速和路况自动调整。"}]}],"synonyms":["initialism","abbreviation"],"phonetic":"/diː ɛl ɛs/","extraExplanation":["DLS 通常读作字母音（D-L-S）。因为它是缩写，单独出现时很难确定含义：最可靠的方法是看它出现的领域（教育、IT 安全、汽车等）、同段落的关键词，或直接问“DLS stands for what here?”。"]}
{"word":"DLTU","summary":{"en":"DLTU is an acronym; it often appears as a mistaken form of DLUT (Dalian University of Technology).","zh":"DLTU是一个首字母缩写；它常见于把DLUT（大连理工大学）写错的情况。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(acronyms) A set of initials that may be used to refer to an organization or name; in many contexts online, people use it to mean “DLUT” (Dalian University of Technology).","zh":"（缩写）一组首字母缩写，可能用来指某个机构或名称；在很多网络语境中，人们用它来指“DLUT”（大连理工大学）。"},"examples":[{"en":"I saw “DLTU” in the bio—do you mean DLUT (Dalian University of Technology)?","zh":"我在简介里看到“DLTU”——你是想写DLUT（大连理工大学）吗？"},{"en":"She graduated from DLUT, but someone typed it as “DLTU” by mistake.","zh":"她毕业于大连理工大学（DLUT），但有人把缩写误打成了“DLTU”。"}]}],"synonyms":["DLUT"],"phonetic":"ˌdiː ɛl tiː ˈjuː","extraExplanation":["更常见、规范的英文缩写是 **DLUT**（Dalian University of Technology），对应中文校名 **大连理工大学**（位于辽宁大连）。你输入的“DLTU”很可能是字母顺序写反了。","如果你指的是别的“DLTU”（例如某个项目、课程、组织或游戏里的缩写），告诉我它出现的上下文句子，我可以按语境给出准确释义。"]}
{"word":"DLUPG","summary":{"en":"DLUPG is not a standard English word; it’s likely a context-specific abbreviation.","zh":"DLUPG 不是标准英语单词；更可能是依语境而定的缩写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An initialism/abbreviation with no widely recognized standard meaning in general English; its meaning depends on the context (e.g., a company name, project code, school course code, or online username).","zh":"一个缩写/首字母缩略词，在一般英语中没有公认的固定含义；具体意思取决于语境（例如公司名、项目代号、课程代码或网名）。"},"examples":[{"en":"What does DLUPG stand for in this document?","zh":"在这份文件里，DLUPG 代表什么？"},{"en":"I saw “DLUPG” in a chat—can you share the full sentence or the topic?","zh":"我在聊天里看到“DLUPG”——你能提供完整句子或话题吗？"}]}],"synonyms":["initialism","abbreviation","acronym"],"phonetic":"/ˌdiː ɛl juː piː ˈdʒiː/","extraExplanation":["像 DLUPG 这类全大写字母组合，通常是“首字母缩写”（initialism）。很多缩写只在特定领域才有意义（例如某个学校、公司内部系统、游戏公会、技术项目）。","如果你把它出现的场景（例如一句完整英文、截图、所属领域：学校/游戏/编程/金融等）发我，我可以更准确判断它可能的全称与含义，并给出合适的翻译。"]}
