{"word":"DN","summary":{"en":"“DN” is an initialism with several meanings; most commonly it means “Distinguished Name” in LDAP. In texting it can mean “do not,” and in some slang it can be a crude meme.","zh":"“DN”是缩写，含义因语境而异：最常见是 LDAP 中的“Distinguished Name（可分辨名称）”；短信聊天里可表示“do not（不要）”；在部分网络俚语中也可能指粗俗梗。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(initialism) A short form used in different fields; most commonly “Distinguished Name,” the unique identifier for an entry in LDAP/directory services (often written like a path of attributes).","zh":"（首字母缩略词）在不同领域使用的缩写；最常见指“Distinguished Name（可分辨名称）”，用于 LDAP/目录服务中唯一标识某个条目的名称（常写成由属性组成的层级字符串）。"},"examples":[{"en":"In LDAP, the DN tells you exactly where the user account is located in the directory.","zh":"在 LDAP 中，DN 会告诉你用户账号在目录里的准确位置。"},{"en":"Please send me the DN of that group so I can check its permissions.","zh":"请把那个组的 DN 发我，我好查看它的权限。"}]},{"partOfSpeech":"other","definition":{"en":"(informal, texting) “DN” can mean “do not.”","zh":"（非正式，短信/聊天）“DN”有时表示“do not（不要/不）”。"},"examples":[{"en":"DN reply after 10 p.m.—I’m asleep.","zh":"晚上十点后不要（DN）回复——我睡了。"},{"en":"DN open this file unless you trust the source.","zh":"除非你信任来源，否则不要（DN）打开这个文件。"}]},{"partOfSpeech":"other","definition":{"en":"(slang, vulgar) In some online contexts, “DN” is used as a setup for a crude joke (“deez nuts”). Use with caution.","zh":"（网络俚语，粗俗）在一些网络语境里，“DN”可能是粗俗玩笑的铺垫（指“deez nuts”）。谨慎使用。"},"examples":[{"en":"He typed “DN” to bait people into a joke.","zh":"他打“DN”是为了引人接那个玩笑。"},{"en":"That “DN” meme is rude in most situations.","zh":"那个“DN”梗在大多数场合都挺不礼貌的。"}]}],"synonyms":["Distinguished Name (LDAP)","do not (informal)"],"phonetic":"ˌdiːˈɛn","extraExplanation":["“DN（Distinguished Name）”常见于 IT/网络管理与身份认证系统。典型格式如：CN=Alice Smith,OU=Users,DC=example,DC=com；其中 CN=常用名，OU=组织单位，DC=域组件。DN 的顺序与层级结构有关，通常从具体对象到域名逐层展开。","如果你告诉我 DN 出现的上下文（聊天、游戏、公司 IT、医学等），我可以帮你确定最可能的意思。"]}
{"word":"dn","summary":{"en":"“DN” is a context-dependent abbreviation, commonly meaning domain name, distinguished name (LDAP), do not, or day/night.","zh":"“DN”是依上下文变化的缩写，常见含义包括域名、LDAP 的可分辨名称、do not（不要）、以及 day/night（白天/夜间）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation for “domain name” (the human-readable address of a website, like example.com).","zh":"“domain name（域名）”的缩写（网站的可读地址，如 example.com）。"},"examples":[{"en":"Please check the DN before you buy the hosting plan.","zh":"在购买主机方案前，请先确认域名（DN）。"},{"en":"Our DN is easy to remember.","zh":"我们的域名（DN）很容易记。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “distinguished name” in computing (LDAP/identity systems), meaning a full unique name that identifies a user or object in a directory.","zh":"在计算机领域（LDAP/身份目录系统）中，“distinguished name（可分辨名称）”的缩写，指用于唯一标识目录中用户或对象的完整名称。"},"examples":[{"en":"The admin asked for the user's DN in LDAP.","zh":"管理员要了该用户在 LDAP 里的 DN（可分辨名称）。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “do not,” used in notes or informal writing.","zh":"“do not（不要/不）”的缩写，用于笔记或非正式写法。"},"examples":[{"en":"DN enter this room.","zh":"不要（DN）进入这个房间。"},{"en":"DN forget to lock the door.","zh":"别（DN）忘了锁门。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “day/night,” used in schedules or labels.","zh":"“day/night（白天/夜间）”的缩写，用于排班或标签。"},"examples":[{"en":"This medication is marked DN for day/night use.","zh":"这款药标注 DN，表示白天/夜间使用。"}]}],"synonyms":["domain name","distinguished name","do not","day/night"],"phonetic":"/ˌdiːˈɛn/","extraExplanation":["“DN”不是一个固定只代表一种意思的词，常见于缩写环境。最可靠的判断方法是看上下文：网站/网络相关多半是 domain name；公司账号/目录服务相关多半是 LDAP 的 distinguished name；便签/提醒里可能是 do not；排班/标识里可能是 day/night。","如果你告诉我你在哪看到“dn”（聊天、作业、电脑设置、医学/药品标签等），我可以帮你锁定最准确的含义与更自然的例句。"]}
{"word":"DNA","summary":{"en":"DNA is the molecule that carries genetic information; it can also mean someone’s or something’s core character (figuratively).","zh":"DNA 指携带遗传信息的分子；也可比喻某人或某事物的核心特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Deoxyribonucleic acid; the chemical in living things that carries genetic information and determines many traits (like eye color).","zh":"脱氧核糖核酸；存在于生物体内、携带遗传信息并决定许多性状（如眼睛颜色）的化学物质。"},"examples":[{"en":"Your DNA is inherited from your parents.","zh":"你的 DNA 是从父母那里遗传来的。"},{"en":"Scientists can study DNA to understand diseases.","zh":"科学家可以研究 DNA 来了解疾病。"},{"en":"A DNA test can help identify a person.","zh":"DNA 检测可以帮助确认一个人的身份。"}]},{"partOfSpeech":"n.","definition":{"en":"A person’s or organization’s essential character or “core identity,” often shaped by history and culture (figurative use).","zh":"（比喻）个人或组织的本质特征/“核心基因”，常由历史与文化塑造。"},"examples":[{"en":"Innovation is part of the company’s DNA.","zh":"创新是这家公司 DNA 的一部分（公司的核心特质之一）。"},{"en":"Kindness is in her DNA.","zh":"善良仿佛写在她的 DNA 里（她天性善良）。"}]}],"synonyms":["genetic material","genes (related)"],"phonetic":"/ˌdiːˌɛnˈeɪ/","extraExplanation":["DNA 常被简称为三个字母分别读：\"D-N-A\"。在日常语境里，人们也会用 \"in the DNA\" 来比喻“深植于本性/文化中”。","文学与新闻写作中常用这种比喻来强调某种特质非常根本、很难改变，例如：\"It’s in the nation’s DNA.\"（这是这个国家根深蒂固的特质。）"]}
{"word":"Dnaburg","summary":{"en":"“Dnaburg” is likely a proper name or a misspelling/variant (possibly related to the historical place name “Dünaburg”).","zh":"“Dnaburg”很可能是专有名词，或是拼写/转写变体（可能与历史地名“Dünaburg”有关）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare or nonstandard word in modern English; most likely a proper name (e.g., a surname or a place name) rather than a common vocabulary item.","zh":"现代英语中很少见或不规范的词；更可能是专有名词（如姓氏或地名），而不是常见词汇。"},"examples":[{"en":"I couldn’t find “Dnaburg” in standard English dictionaries; it may be a name or a spelling variant.","zh":"我在标准英语词典里找不到“Dnaburg”；它可能是一个名字或拼写变体。"},{"en":"If “Dnaburg” is a place, check the original source for capitalization and spelling.","zh":"如果“Dnaburg”是地名，建议核对原文的大小写和拼写。"}]}],"synonyms":["Dünaburg","Daugavpils"],"phonetic":"ˈdə.nə.bɝɡ","extraExplanation":["“Dnaburg”很可能是拼写误差或转写差异。一个较接近的历史地名是 **Dünaburg**（德语名），指今天拉脱维亚的 **Daugavpils**（道加瓦皮尔斯）。在不同语言/字符集转写时，ü 有时会变成 u、或被省略，导致多种拼写。","如果你能提供它出现的上下文（句子、国家/地区、人物/地点类型、原文语言），我可以更准确判断它是哪个专名，或给出更可靠的读音与含义。"]}
{"word":"DNB","summary":{"en":"DNB is an abbreviation; most commonly “Do Not Bend” on mail, but it can also refer to Dun & Bradstreet or India’s medical DNB qualification.","zh":"DNB是缩写；最常见指邮政上的“请勿弯折”，也可能指邓白氏（Dun & Bradstreet）或印度医学DNB专科资格。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an abbreviation meaning “Do Not Bend,” used on envelopes or packages to tell handlers not to fold or crease them.","zh":"缩写，表示“请勿弯折/请勿折叠”，常见于信封或包裹上，用来提醒搬运或投递人员不要折弯。"},"examples":[{"en":"Please write “DNB” on the envelope so the photos don’t get creased.","zh":"请在信封上写“DNB”，这样照片就不会被折出痕迹。"},{"en":"The document was marked DNB because it contained certificates.","zh":"这份文件标注了DNB，因为里面有证书。"}]},{"partOfSpeech":"other","definition":{"en":"Dun & Bradstreet, a company known for business credit reporting and related data services (often written as D&B).","zh":"邓白氏（Dun & Bradstreet），一家以企业信用报告和商业数据服务闻名的公司（也常写作D&B）。"},"examples":[{"en":"Our supplier asked for our DNB (Dun & Bradstreet) profile before signing the contract.","zh":"供应商在签合同前要求查看我们的邓白氏（DNB）资料。"},{"en":"The bank checked the company’s DNB data as part of the risk review.","zh":"银行在风控审核中查看了公司的邓白氏数据。"}]},{"partOfSpeech":"other","definition":{"en":"Diplomate of National Board, a postgraduate medical qualification in India (commonly written as DNB).","zh":"印度“国家医学委员会专科文凭”（Diplomate of National Board），一种医学研究生/专科资格。"},"examples":[{"en":"She is preparing for the DNB entrance exam in India.","zh":"她正在准备印度的DNB入学考试。"},{"en":"He completed his DNB in pediatrics.","zh":"他完成了儿科的DNB专科培训/资格。"}]}],"synonyms":["Do Not Bend","D&B","Dun & Bradstreet"],"phonetic":"/diː ɛn biː/","extraExplanation":["“DNB”是缩写，含义高度依赖场景：快递/邮政里最常见的是“Do Not Bend”；商业与金融语境中可能指邓白氏（Dun & Bradstreet）；在印度医疗教育体系里则常指医学专科资格“Diplomate of National Board”。如果你告诉我出现的场景（邮件、合同、简历、考试等），我可以帮你锁定最准确的意思。"]}
{"word":"DNC","summary":{"en":"DNC most commonly means the Democratic National Committee in U.S. politics; in other contexts it can be a field-specific abbreviation.","zh":"DNC 最常见指美国政治中的“民主党全国委员会”；在其他语境也可能是行业缩写，需看上下文。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the Democratic National Committee: the main organization that plans and supports the Democratic Party in the United States (e.g., elections, fundraising, messaging).","zh":"美国民主党全国委员会：负责统筹与支持美国民主党的主要组织（如选举、筹款与对外传播）。"},"examples":[{"en":"The DNC announced new rules for the presidential primary debates.","zh":"民主党全国委员会（DNC）公布了总统初选辩论的新规则。"},{"en":"She works for the DNC as a communications staffer.","zh":"她在民主党全国委员会担任传播/公关工作人员。"}]},{"partOfSpeech":"other","definition":{"en":"in general/business writing, an abbreviation that can vary by field; you should check the document for its specific meaning.","zh":"在一些通用或行业文件中，DNC 也可能是不同领域的缩写；需要结合上下文确认具体含义。"},"examples":[{"en":"In this report, DNC refers to 'do not contact.'","zh":"在这份报告里，DNC 指的是“不要联系（do not contact）”。"}]}],"synonyms":["Democratic National Committee"],"phonetic":"/ˌdiː en ˈsiː/","extraExplanation":["在美国政治语境里，DNC 最常见的含义就是“民主党全国委员会”。它属于政党组织层面的机构，主要负责全国性的竞选支持、资源整合与党内规则制定等；但它不是政府部门。","容易混淆的对应缩写是 RNC（共和党全国委员会）。在新闻里看到 DNC/RNC 往往是在谈两党全国层面的组织与选举动向。"]}
{"word":"DNCRI","summary":{"en":"DNCRI is not a common English word; it’s most likely an acronym whose meaning depends on context.","zh":"DNCRI 不是常见英语单词；更可能是一个缩写，具体含义需要语境才能确定。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An acronym/initialism that is not a standard, widely recognized English word; its meaning depends on the specific field (e.g., a company name, a program, a technical system, or an internal code).","zh":"一个不属于常见英语词汇的缩写（首字母缩略词）；其含义取决于具体语境（例如公司名、项目名、技术系统或内部代码）。"},"examples":[{"en":"I saw “DNCRI” in the document, but there was no explanation for what it stands for.","zh":"我在文件里看到“DNCRI”，但没有说明它代表什么。"},{"en":"Could you tell me what DNCRI means in this report (industry, country, or full name)?","zh":"你能告诉我在这份报告里 DNCRI 是什么意思吗（行业、国家或全称）？"}]}],"synonyms":["acronym","initialism","abbreviation"],"phonetic":"/ˌdiːˌɛnˌsiːˌɑːrˈaɪ/","extraExplanation":["像 DNCRI 这种全大写的形式，通常是“首字母缩写”。在英语里它可能读成逐个字母（D-N-C-R-I），也可能在特定机构里有固定读法。","如果你把它出现的句子、所在领域（例如金融/医疗/科研/政府/公司内部）、或它可能的全称发我，我可以帮你准确还原它的含义，并给出更自然的英文用法。"]}
{"word":"Dnepr","summary":{"en":"Dnepr is another spelling of the Dnieper, a major river in Eastern Europe.","zh":"Dnepr 是 Dnieper 的另一种拼写，指东欧重要河流第聂伯河。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a major river in Eastern Europe that flows through Russia, Belarus, and Ukraine into the Black Sea (often spelled “Dnieper” in English).","zh":"第聂伯河（东欧重要河流，流经俄罗斯、白俄罗斯和乌克兰，注入黑海；英文也常拼作 Dnieper）。"},"examples":[{"en":"Kyiv stands on the banks of the Dnepr.","zh":"基辅位于第聂伯河畔。"},{"en":"The Dnepr has been an important trade route for centuries.","zh":"几个世纪以来，第聂伯河一直是重要的贸易通道。"}]}],"synonyms":["Dnieper"],"phonetic":"/ˈniːpər/","extraExplanation":["“Dnepr”多见于俄语/乌克兰语的音译或旧式英文拼法；现代英语更常用“Dnieper”。","在历史与文学语境中，第聂伯河常被视为乌克兰的重要象征之一；在新闻报道中也常因地区政治与水资源、航运等议题被提及。"]}
{"word":"Dneprodzerzhinsk","summary":{"en":"Dneprodzerzhinsk is the former (Soviet-era) English name of a Ukrainian city now called Kamianske.","zh":"Dneprodzerzhinsk 是乌克兰城市 Kamianske 的旧称（多见于苏联时期与旧英文资料）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(proper noun) A former name of a city in central Ukraine, now officially called Kamianske.","zh":"（专有名词）乌克兰中部一座城市的旧称，现官方名称为 Kamianske（卡缅斯克）。"},"examples":[{"en":"He was born in Dneprodzerzhinsk, which is now called Kamianske.","zh":"他出生在 Dneprodzerzhinsk（第聂伯捷尔任斯克），这座城市现在叫 Kamianske（卡缅斯克）。"},{"en":"The factory town of Dneprodzerzhinsk was an important industrial center in the Soviet period.","zh":"在苏联时期，Dneprodzerzhinsk 这座工厂城市是重要的工业中心。"}]}],"synonyms":["Kamianske","Dniprodzerzhynsk"],"phonetic":"/dniˌproʊdʒɚˈʒɪnsk/","extraExplanation":["该地名常见多种拼写与转写：Dneprodzerzhinsk（英语常见旧拼法）、Dniprodzerzhynsk（更接近乌克兰语的转写）、Dneprodzerzhynsk 等。","2016 年乌克兰“去共产主义化”（decommunization）过程中，该市更名为 Kamianske。旧名中的 “Dzerzhinsk” 来自苏联时期人物 Felix Dzerzhinsky（费利克斯·捷尔任斯基）。","在阅读历史资料或人物传记时，你可能会同时看到旧名与新名；写作时可用“formerly Dneprodzerzhinsk, now Kamianske（旧称……，现为……）”来避免混淆。"]}
{"word":"Dnepropetrovsk","summary":{"en":"Dnepropetrovsk is the former name of the Ukrainian city now officially called Dnipro.","zh":"Dnepropetrovsk 是乌克兰城市 Dnipro（第聂伯罗）的旧称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Older name) a major city in central Ukraine; today it is officially called Dnipro.","zh":"（旧称）乌克兰中部的一座重要城市；现官方名称为 Dnipro（第聂伯罗）。"},"examples":[{"en":"My grandfather studied in Dnepropetrovsk in the 1970s.","zh":"我祖父在 20 世纪 70 年代曾在第聂伯罗彼得罗夫斯克求学。"},{"en":"Many maps now label the city as Dnipro instead of Dnepropetrovsk.","zh":"现在很多地图把这座城市标为 Dnipro，而不是第聂伯罗彼得罗夫斯克。"}]}],"synonyms":["Dnipro","Dnipropetrovsk"],"phonetic":"/ˌnɛproʊpɪˈtrɔvsk/","extraExplanation":["“Dnepropetrovsk”是俄语/苏联时期常见的英文转写形式，名字来源于第聂伯河（Dnieper/Dnipro）以及苏联政治人物彼得罗夫斯基（Petrovsky）。","2016 年乌克兰在“去共产主义化”背景下将城市正式更名为“Dnipro”。在新闻、旅行信息和当代语境中，使用“Dnipro”更合适；“Dnepropetrovsk”多见于旧资料、历史叙述或老一辈用法。","英语里同一地名可能有多种拼写（如 Dnepropetrovsk / Dnipropetrovsk / Dnipro），常因不同语言来源（俄语 vs. 乌克兰语）和转写体系而变化。"]}
{"word":"Dnestr","summary":{"en":"Dnestr is the Dniester River, an important river in Ukraine and Moldova flowing to the Black Sea.","zh":"Dnestr 指德涅斯特河（Dniester River），流经乌克兰与摩尔多瓦，注入黑海。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a major river in Eastern Europe that flows through Ukraine and Moldova to the Black Sea; also spelled “Dniester.”","zh":"德涅斯特河：东欧一条重要河流，流经乌克兰与摩尔多瓦，最终注入黑海；也常拼作 “Dniester”。"},"examples":[{"en":"The Dnestr River forms part of the border between Moldova and Ukraine.","zh":"德涅斯特河构成了摩尔多瓦与乌克兰边界的一部分。"},{"en":"Some English maps label it as the Dniester rather than the Dnestr.","zh":"一些英文地图把它标为 Dniester，而不是 Dnestr。"}]}],"synonyms":["Dniester","Dniester River"],"phonetic":"/ˈdniːstər/","extraExplanation":["“Dnestr”是较少见的英文转写形式，更常见的拼法是“Dniester”。在历史与新闻语境中，这条河有时会与“Transnistria（德涅斯特河沿岸地区/德涅斯特河左岸地区）”一起出现，因为该地区的名称与这条河有关。"]}
{"word":"DNHR","summary":{"en":"DNHR most commonly means “Do Not Hire/Do Not Rehire,” an internal HR note that someone should not be hired again.","zh":"DNHR 最常见指“Do Not Hire/Do Not Rehire（不予录用/不再录用）”，是人事系统中的内部标记。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(abbr.) “Do Not Hire / Do Not Rehire”: a note or status used by some employers to indicate a person should not be hired again.","zh":"（缩写）“Do Not Hire / Do Not Rehire”：一些雇主在人事系统中使用的标记，表示该人员不应被录用或再次录用。"},"examples":[{"en":"His profile was marked DNHR after repeated no-shows for scheduled shifts.","zh":"他多次排班却不到岗，档案因此被标记为 DNHR。"},{"en":"The recruiter said the system shows DNHR, so they can’t move forward with the application.","zh":"招聘人员说系统显示 DNHR，所以无法继续推进这份申请。"},{"en":"She asked HR to review the DNHR status because she believed it was a mistake.","zh":"她要求人力资源复核 DNHR 状态，因为她认为那是误标。"}]}],"synonyms":["DNH","DNR","not eligible for rehire"],"phonetic":"ˌdiː en eɪtʃ ˈɑːr","extraExplanation":["DNHR 常见于北美职场的人事/招聘语境，多出现在内部 HR 系统、背景备注或招聘流程中；并非正式法律术语，具体含义会因公司政策而异。","有些公司会用类似标记（如 DNH、DNR、Not eligible for rehire）。如果你是在邮件或表格里看到 DNHR，最好向对方确认其准确含义与适用范围。"]}
{"word":"DNI","summary":{"en":"DNI most commonly means “Do Not Interact” online; it can also mean “Director of National Intelligence” in the U.S. government.","zh":"DNI最常见指网络上的“不要互动”；也可指美国政府的“国家情报总监”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Internet slang) “Do Not Interact.” A note someone posts to tell certain people not to reply, message, follow, or engage with them online.","zh":"（网络用语）“不要互动”。用于提示某些人不要在网上回复、私信、关注或与其交流。"},"examples":[{"en":"My bio says DNI if you’re here to argue in bad faith.","zh":"我的简介写了：如果你是来恶意争辩的，请不要互动（DNI）。"},{"en":"They added a DNI list to reduce harassment.","zh":"他们加了一个“DNI名单”来减少骚扰。"},{"en":"If you’re uncomfortable, you can DNI and block them.","zh":"如果你觉得不舒服，你可以写DNI并把对方拉黑。"}]},{"partOfSpeech":"other","definition":{"en":"(U.S. government) “Director of National Intelligence,” the head of the U.S. intelligence community.","zh":"（美国政府）“国家情报总监”，美国情报体系的最高负责人。"},"examples":[{"en":"The DNI testified before Congress about the report.","zh":"国家情报总监（DNI）就这份报告在国会作证。"},{"en":"The DNI coordinates across multiple intelligence agencies.","zh":"国家情报总监（DNI）负责协调多个情报机构。"}]}],"synonyms":["Do Not Interact","do not engage","do not reply","DNF (Do Not Follow)"],"phonetic":"/ˌdiː ˌɛn ˈaɪ/","extraExplanation":["在社交媒体上，DNI常见于个人简介或置顶帖，通常后面会跟条件（例如“DNI if you hate X / if you support Y”），语气从“设定边界”到“带立场的排除”都有。遇到DNI一般表示对方不希望你互动；是否尊重对方边界、或直接拉黑/绕开，取决于平台文化与具体语境。","注意：在不同圈子里，DNI也可能被写成“DNI/DNF”（Do Not Follow）或与“BYF”（Before You Follow）一起出现，用来说明互动规则。"]}
{"word":"DNIC","summary":{"en":"DNIC usually means “diffuse noxious inhibitory controls,” the body’s ability to dampen pain in one area when another painful stimulus is present.","zh":"DNIC通常指“弥散性有害刺激抑制控制”，即当身体某处出现疼痛刺激时，另一处的疼痛可能被抑制的能力。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"an acronym for “diffuse noxious inhibitory controls,” a pain-science concept describing how a painful stimulus in one area can reduce pain sensation in another area (the body’s natural pain-inhibition system).","zh":"“Diffuse Noxious Inhibitory Controls（弥散性有害刺激抑制控制）”的缩写，指疼痛科学中的一种现象：身体某处的有害/疼痛刺激会抑制另一处的疼痛感受（人体的自然镇痛/疼痛抑制系统）。"},"examples":[{"en":"Researchers tested DNIC by applying a cold-water stimulus and measuring how it changed pain responses elsewhere.","zh":"研究人员通过施加冷水刺激来测试DNIC，并测量它如何改变身体其他部位的疼痛反应。"},{"en":"Reduced DNIC function is often discussed in studies of chronic pain.","zh":"在慢性疼痛研究中，经常会讨论DNIC功能减弱的问题。"}]}],"synonyms":["conditioned pain modulation (CPM)","endogenous pain inhibition"],"phonetic":"/ˌdiː en aɪ ˈsiː/","extraExplanation":["DNIC多见于医学、神经科学与疼痛研究论文里，日常对话中很少用。很多新文献也会用CPM（conditioned pain modulation，条件性疼痛调制）来指代非常接近的概念。","在写作中，首次出现通常写全称并在括号里标注缩写：diffuse noxious inhibitory controls (DNIC)。之后才单独用DNIC。"]}
{"word":"Dnieper","summary":{"en":"The Dnieper is a major river in Eastern Europe, especially important in Ukraine.","zh":"第聂伯河是东欧的重要河流，在乌克兰尤为关键。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a major river in Eastern Europe that flows through Russia, Belarus, and Ukraine to the Black Sea (often written “the Dnieper” in English).","zh":"第聂伯河（东欧主要河流之一；流经俄罗斯、白俄罗斯和乌克兰，注入黑海；英文常写作 the Dnieper）。"},"examples":[{"en":"Kyiv is located on the Dnieper River.","zh":"基辅位于第聂伯河畔。"},{"en":"The Dnieper flows south toward the Black Sea.","zh":"第聂伯河向南流入黑海。"},{"en":"In history books, you may read about battles and trade routes along the Dnieper.","zh":"在历史书里，你可能会读到沿着第聂伯河发生的战役和贸易路线。"}]}],"phonetic":"/ˈniːpər/","extraExplanation":["“Dnieper”是英语里对该河的常见名称；中文通常译为“第聂伯河”。它在乌克兰的地理与历史文化中非常重要，基辅等城市都与其密切相关。阅读新闻或历史材料时，常见搭配是“the Dnieper (River)”。"]}
{"word":"Dniester","summary":{"en":"Dniester: a major river in Eastern Europe flowing to the Black Sea.","zh":"Dniester：东欧的重要河流，流向黑海。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a major river in Eastern Europe that flows through Ukraine and Moldova to the Black Sea","zh":"德涅斯特河（东欧大河），流经乌克兰和摩尔多瓦，最终注入黑海"},"examples":[{"en":"The Dniester River forms part of the border between Moldova and Ukraine.","zh":"德涅斯特河构成了摩尔多瓦与乌克兰边界的一部分。"},{"en":"Many towns along the Dniester depend on the river for water and farming.","zh":"德涅斯特河沿岸的许多城镇依赖这条河获取用水并发展农业。"}]}],"synonyms":["Dniester River"],"phonetic":"/ˈniːstər/","extraExplanation":["“Dniester”常见于地理、历史与新闻语境，尤其涉及摩尔多瓦境内的德涅斯特河沿岸地区（如“Transnistria/德涅斯特河沿岸地区”）。","该河名称在不同语言中有不同写法：英语常用 Dniester，乌克兰语为 Dnister（第聂斯特），俄语为 Dnestr（德涅斯特）。"]}
{"word":"Dniren","summary":{"en":"“Dniren” is not a standard English word; it’s likely a typo or a name.","zh":"“Dniren”不是标准英文单词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a typo or a name/username.","zh":"不是标准英文单词，可能是拼写错误，或是人名/用户名。"},"examples":[{"en":"“Dniren” doesn’t appear in standard English dictionaries.","zh":"“Dniren”在常见英文词典里找不到。"},{"en":"Did you mean “dinner” or “driven”?","zh":"你想表达的是“dinner（晚餐）”还是“driven（被驱动的/过去分词）”？"}]}],"phonetic":"/ˈdɪnər/","extraExplanation":["如果你是在学英文词汇，可能是拼错了。最常见的接近词有：\n- dinner /ˈdɪnər/：晚餐\n- driven /ˈdrɪvən/：drive 的过去分词（被驱动的；有干劲的）\n也可能是专有名词（名字、游戏ID等）。\n把它放进一句完整的句子里，我可以更准确判断你想表达的词。"]}
{"word":"Dnitz","summary":{"en":"“Dnitz” is usually a misspelling of “Dönitz,” especially referring to Karl Dönitz, a WWII-era German naval leader.","zh":"“Dnitz”通常是“Dönitz”的误拼，尤其常指二战时期的德国海军人物卡尔·邓尼茨。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A misspelling or simplified spelling of “Dönitz,” most often referring to Karl Dönitz (1891–1980), a German naval commander in World War II who briefly became the head of Germany at the end of the war.","zh":"“Dönitz”的常见误拼或简化拼写，通常指卡尔·邓尼茨（Karl Dönitz，1891–1980），二战时期德国海军将领，并在战争末期短暂成为德国的领导人。"},"examples":[{"en":"I think “Dnitz” is meant to be “Dönitz,” the German admiral in WWII history.","zh":"我觉得“Dnitz”应该是指“Dönitz”，二战历史中的那位德国海军将领。"},{"en":"The book mentions Dönitz’s role in the German navy.","zh":"书里提到了邓尼茨在德国海军中的角色。"}]},{"partOfSpeech":"n.","definition":{"en":"A surname (family name), typically of German origin, sometimes written without the umlaut as “Donitz.”","zh":"一个姓氏（家族姓），多为德语来源，有时会把变音符号省略写成“Donitz”。"},"examples":[{"en":"Her last name is Donitz, spelled without the umlaut.","zh":"她的姓是Donitz，拼写时没有用变音符号。"}]}],"synonyms":["Dönitz","Donitz","Doenitz"],"phonetic":"/ˈdɜːnɪts/","extraExplanation":["德语字母“ö”在英语资料里常被简化为“o”（如 Dönitz → Donitz），也可能在快速输入时进一步误写成“Dnitz”。如果你是在历史语境中看到这个词，几乎都在指 Karl Dönitz。","发音提示：德语“ö”的音在英语里不完全对应，英语环境下常近似读成“UR/ER + nits”的感觉。正式写作建议用 “Dönitz” 或常见替代拼写 “Doenitz/Donitz”。"]}
{"word":"DNL","summary":{"en":"DNL most commonly means “Day–Night Level,” a 24-hour noise metric that weights nighttime noise more heavily.","zh":"DNL最常见指“昼夜等效噪声级”，一种24小时噪声指标，会对夜间噪声加权处理。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Day–Night Level) a standard measure of environmental noise over 24 hours, with nighttime noise counted as louder to reflect how it disturbs sleep.","zh":"（昼夜等效噪声级）一种衡量24小时环境噪声的标准指标；夜间噪声会被“加权”算得更大，以反映其对睡眠的干扰。"},"examples":[{"en":"The airport’s expansion plan must show that nearby neighborhoods won’t exceed 65 dB DNL.","zh":"机场扩建方案必须证明附近社区的昼夜等效噪声级不会超过65分贝（DNL）。"},{"en":"Residents complained that the new flight path increased the DNL at night.","zh":"居民抱怨新的航线让夜间的DNL上升了。"}]},{"partOfSpeech":"other","definition":{"en":"(Less common, context-dependent) an abbreviation used in specific workplaces or systems (for example, “do not load/list”), meaning depends on the organization.","zh":"（较少见，强依赖语境）在某些单位/系统里使用的缩写（如“不要加载/不要列入”之类），具体含义取决于所在组织。"},"examples":[{"en":"This file is marked DNL in the system, so it won’t be processed automatically.","zh":"这个文件在系统里被标注为DNL，所以不会被自动处理。"},{"en":"If you see DNL on the report, ask the team what it stands for here.","zh":"如果你在报告上看到DNL，最好问一下团队在这里它代表什么。"}]}],"synonyms":["day–night average sound level"],"phonetic":"/ˌdiː ɛn ˈɛl/","extraExplanation":["在环保、城市规划、航空噪声评估等领域，DNL（Day–Night Level）非常常见：它把一天的噪声平均化处理，并对夜间（通常指晚10点到早7点）的噪声额外加权（常见做法是加10分贝惩罚），因为夜间更容易影响睡眠。","如果你看到的DNL出现在公司流程、软件界面或表格栏位里，它也可能是内部缩写（例如“Do Not Load/Do Not List”等）。这种用法没有统一标准，需要结合上下文确认。"]}
{"word":"DNR","summary":{"en":"DNR most commonly means “Do Not Resuscitate” (a medical order). It can also mean “Department of Natural Resources” (a government agency).","zh":"DNR最常见指医疗上的“不复苏指令（Do Not Resuscitate）”；也可指政府机构“自然资源部/自然资源局（Department of Natural Resources）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(medical) A written order meaning “Do Not Resuscitate”: if a person’s heart stops or they stop breathing, medical staff should not perform CPR or other life-saving resuscitation.","zh":"（医疗）“Do Not Resuscitate”的缩写，意为“不要复苏/不进行心肺复苏”：当患者心跳或呼吸停止时，医护人员不实施CPR等抢救复苏措施。"},"examples":[{"en":"He has a DNR on file at the hospital.","zh":"医院里有他备案的DNR（不复苏指令）。"},{"en":"The nurse asked the family to confirm whether the patient has a DNR order.","zh":"护士询问家属是否确认患者有DNR不复苏指令。"}]},{"partOfSpeech":"n.","definition":{"en":"(government) Department of Natural Resources: an agency that manages parks, wildlife, water, forests, and other natural resources (common in U.S. states).","zh":"（政府机构）自然资源部/自然资源局：负责公园、野生动物、水资源、森林等自然资源管理的机构（常见于美国各州）。"},"examples":[{"en":"You may need a permit from the DNR to hunt in this area.","zh":"在这个地区狩猎可能需要向DNR申请许可证。"},{"en":"The DNR issued a warning about wildfires.","zh":"DNR发布了有关野火的警报。"}]}],"synonyms":["Do Not Resuscitate (medical)","no code (informal, medical)","Department of Natural Resources (government)"],"phonetic":"/ˌdiː ɛn ˈɑr/","extraExplanation":["在医疗语境中，DNR属于“预先医疗指示/临终医疗决策”的一部分，不等同于“放弃治疗”。它通常只针对心跳/呼吸停止时是否进行CPR；其他治疗（止痛、抗生素、供氧等）可能仍会进行，具体以文件内容和当地法规/医院政策为准。","口语里读作逐个字母（D-N-R）。看到在不同场景（医院文件、政府公告、狩猎/钓鱼规定）出现时，可用上下文判断是“医疗指令”还是“自然资源部门”。"]}
{"word":"DNS","summary":{"en":"DNS is the system (or the settings/servers) that turns domain names into IP addresses so you can reach websites and online services.","zh":"DNS 指域名系统（或相关的服务器/设置），作用是把域名转换成 IP 地址，从而访问网站和网络服务。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Domain Name System: the system that translates human-readable domain names (like example.com) into IP addresses used by computers and networks.","zh":"域名系统：把人类可读的域名（如 example.com）转换为计算机和网络使用的 IP 地址的系统。"},"examples":[{"en":"If the DNS is down, you might not be able to open websites even though your internet is working.","zh":"如果 DNS 挂了，即使网络连接正常，你也可能打不开网站。"},{"en":"Your computer asks a DNS server for the IP address of a domain name.","zh":"你的电脑会向 DNS 服务器查询某个域名对应的 IP 地址。"}]},{"partOfSpeech":"n.","definition":{"en":"A DNS server or DNS settings: the specific servers or configuration used to resolve domain names.","zh":"DNS 服务器 / DNS 设置：用于解析域名的具体服务器或配置。"},"examples":[{"en":"Try changing your DNS to 8.8.8.8 to see if the problem goes away.","zh":"可以试试把 DNS 改成 8.8.8.8，看看问题是否消失。"},{"en":"Our company uses internal DNS for services inside the network.","zh":"我们公司在内网服务上使用内部 DNS。"}]}],"synonyms":["Domain Name System","name server","DNS server"],"phonetic":"/ˌdiː en ˈes/","extraExplanation":["DNS 常被比喻成“互联网电话簿”：你输入域名，DNS 帮你找到对应的“号码”（IP）。","实际访问中常见流程是：先查本机/路由器缓存 → 再问递归解析器（如运营商或公共 DNS）→ 需要时再去问权威 DNS（管理该域名记录的服务器）。缓存能加速访问，但也会导致“刚改了域名解析却还没生效”的现象。","常见记录类型：A/AAAA（指向 IPv4/IPv6）、CNAME（别名）、MX（邮件）、TXT（验证/反垃圾等）。"]}
{"word":"DNX","summary":{"en":"DNX is an initialism with meanings that depend on context; in some trading systems it can mean “Did/Do Not Execute.”","zh":"DNX 是一个依语境而定的缩写；在某些交易系统中可指“未执行/不要执行（Did/Do Not Execute）”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"An abbreviation/initialism for “D, N, X,” used in different fields with different meanings (most often read letter-by-letter).","zh":"缩写/首字母词（逐字母读作 D-N-X），在不同领域有不同含义。"},"examples":[{"en":"I saw “DNX” in the log, but the meaning depends on the system we’re using.","zh":"我在日志里看到“DNX”，但具体含义要看我们使用的系统。"},{"en":"Before you use DNX, check what it stands for in your company’s documentation.","zh":"在使用 DNX 之前，先查清楚它在你们公司文档里代表什么。"}]},{"partOfSpeech":"other","definition":{"en":"(Finance/trading, in some systems) “Did Not Execute” or “Do Not Execute,” meaning an order was not carried out (or should not be carried out).","zh":"（金融/交易，在某些系统中）“Did Not Execute / Do Not Execute”，表示订单未成交（或不应执行）。"},"examples":[{"en":"The status changed to DNX, so the trade didn’t go through.","zh":"状态变成 DNX，所以这笔交易没有成交。"},{"en":"Mark it DNX if the order must not be executed automatically.","zh":"如果订单不能自动执行，就把它标记为 DNX。"}]}],"synonyms":["initialism","abbreviation"],"phonetic":"/diː ɛn ɛks/","extraExplanation":["“DNX”不是一个固定的通用英语单词，更像是行业或公司内部的缩写。不同平台/团队对 DNX 的定义可能不同。","在阅读或写作中遇到 DNX，最稳妥的做法是：查看上下文（交易系统、技术日志、产品文档等）或直接询问提供该缩写的人。"]}
