{"word":"DOC","summary":{"en":"“Doc” is an informal word meaning either “doctor” or “document,” and it can also mean “to document.”","zh":"“doc”是非正式用法，可指“医生”或“文件/文档”，也可作动词表示“记录/写成文档”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A doctor; especially a medical doctor.","zh":"（非正式）医生；尤指医学博士/医师。"},"examples":[{"en":"Ask your doc if this medicine is safe with your other pills.","zh":"问问你的医生，这个药和你正在吃的其他药一起用是否安全。"},{"en":"I have a checkup with the doc tomorrow.","zh":"我明天要去找医生体检。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) A document (a written or digital file).","zh":"（非正式）文件；文档（纸质或电子文件）。"},"examples":[{"en":"Please upload the doc and share the link.","zh":"请上传这个文档并分享链接。"},{"en":"I’ll send the doc as a PDF.","zh":"我会把文件以PDF形式发给你。"}]},{"partOfSpeech":"v.","definition":{"en":"To document something; to record or describe it clearly in writing.","zh":"记录；写成文档；为……做说明/留档。"},"examples":[{"en":"Make sure to doc the changes you made to the code.","zh":"一定要把你对代码做的改动记录下来。"},{"en":"We need to doc the meeting decisions for everyone.","zh":"我们需要把会议决定整理成文档让大家都看到。"}]}],"synonyms":["doctor","physician","document","file","record","document (verb)"],"phonetic":"/dɑk/","extraExplanation":["“doc”常见于口语和网络/工作场景，是“doctor”和“document”的缩写；具体含义要看语境。","在职场软件里（如Google Docs、Word），“doc”常指“文档”；在医疗语境里更常指“医生”。","动词用法“to doc”多见于技术团队或办公室口语，比较随意；更正式的表达是“document”。"]}
{"word":"doc","summary":{"en":"“Doc” is an informal word meaning a doctor, or a shortened form of “document.”","zh":"“doc” 是非正式用语，常指“医生”，也可作“document（文档）”的缩写。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A doctor, especially a medical doctor; also used as a friendly form of address or nickname.","zh":"（非正式）医生（尤指内科/医学博士）；也可作友好的称呼或绰号。"},"examples":[{"en":"I’ve got an appointment with the doc tomorrow.","zh":"我明天要去看医生。"},{"en":"Thanks, Doc. I feel a lot better now.","zh":"谢谢你，医生。我现在感觉好多了。"},{"en":"Everyone on the team calls her Doc because she studied medicine.","zh":"队里的人都叫她“Doc”，因为她学过医学。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, shortened) A document, especially in digital or office contexts.","zh":"（非正式缩写）文件、文档（常用于电脑或办公语境）。"},"examples":[{"en":"Can you send me the doc as a PDF?","zh":"你能把那份文档以 PDF 发给我吗？"},{"en":"I saved the doc on the shared drive.","zh":"我把文件存到共享硬盘里了。"}]},{"partOfSpeech":"vt.","definition":{"en":"(less common) To deduct money (especially pay) as a penalty; variant of “dock.”","zh":"（较少见）扣除（工资/款项），作为惩罚；为 “dock” 的变体用法。"},"examples":[{"en":"They doc your pay if you arrive late.","zh":"你迟到他们会扣你工资。"}]}],"synonyms":["doctor","physician (more formal)","document (in office/tech contexts)","file"],"phonetic":"/dɑk/","extraExplanation":["“doc” 是非常口语的缩写：在医院或日常对话里多指 doctor；在职场/电脑里常指 document（比如 Word 文档）。正式写作中一般写全称 doctor / document。","大写 “Doc” 常见于人名或称号（如某些电影/小说角色的绰号），带一点亲切或幽默的语气。","表示“扣工资/扣款”时，更常见和更标准的拼写是 “dock”。"]}
{"word":"doc-mac","summary":{"en":"“Doc-mac” is usually an informal nickname (“Doctor Mac”) or a tech label meaning “docs for Mac.”","zh":"“doc-mac”通常是非正式外号“Doc Mac（Mac 医生）”，或技术场景中表示“Mac 相关文档/给 Mac 用的说明”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(informal) A nickname or form of address meaning “Doctor Mac,” usually for a doctor whose name is Mac/Mc… (e.g., MacKenzie, McDonald).","zh":"（非正式）“Doc Mac”的称呼或绰号，通常指姓氏以 Mac/Mc 开头的人（如 MacKenzie、McDonald）且其身份是医生。"},"examples":[{"en":"Everyone in the clinic calls him Doc Mac because Dr. McDonald has been there for years.","zh":"诊所里大家都叫他 Doc Mac，因为 McDonald 医生在那儿很多年了。"},{"en":"Doc Mac, could you take a look at this X-ray?","zh":"Doc Mac，你能帮我看看这张 X 光片吗？"}]},{"partOfSpeech":"other","definition":{"en":"(computing, informal) A label that can mean “Mac documentation” or “docs for Mac,” often used as a folder name, tag, or project label (not a fixed dictionary word).","zh":"（计算机领域，非正式）可能表示“Mac 的文档/给 Mac 用的说明文档”的标签，常见于文件夹名、标签或项目名称（不是固定的词典词条）。"},"examples":[{"en":"I saved the installation notes in the doc-mac folder.","zh":"我把安装说明保存在 doc-mac 文件夹里了。"},{"en":"Check the doc-mac section for macOS-specific steps.","zh":"去看 doc-mac 部分，那里有针对 macOS 的步骤。"}]}],"synonyms":["Doc Mac","Doctor Mac","Mac docs","macOS documentation"],"phonetic":"/dɑk mæk/","extraExplanation":["“doc-mac”并不是一个非常固定的英语词汇，更像是人名外号（Doc Mac）或技术场景下的自定义命名（如文件夹/标签）。如果你告诉我它出现的句子或场景（医院对话？GitHub 项目？文件名？），我可以帮你确定最准确的含义与用法。"]}
{"word":"docce","summary":{"en":"“Docce” is not a common English word; it’s usually Italian for “showers.” If you meant an English word, it may be a typo.","zh":"“docce”不是常见英文；通常是意大利语，意思是“淋浴/淋浴间”。如果你想查英文词，可能是拼写写错了。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; it is most likely a misspelling or a word from another language (often Italian).","zh":"不是标准英语单词；很可能是拼写错误或来自其他语言（常见于意大利语）。"},"examples":[{"en":"I can’t find “docce” in an English dictionary—did you mean “doc” or “dodge”?","zh":"我在英语词典里找不到“docce”——你是不是想写“doc”或“dodge”？"}]},{"partOfSpeech":"n.","definition":{"en":"(Italian) “docce” means “showers” (plural of “doccia”), used when talking about bathrooms or facilities.","zh":"（意大利语）“docce”意思是“淋浴/淋浴间”（“doccia”的复数），常用于谈论浴室或设施。"},"examples":[{"en":"The gym has lockers and docce.","zh":"这家健身房有储物柜和淋浴间。"},{"en":"We need more docce at the campsite.","zh":"营地需要更多淋浴设施。"}]}],"synonyms":["showers (Italian meaning)"],"phonetic":"/ˈdɔtʃeɪ/","extraExplanation":["在英语学习语境中，如果你本来想查的是英文单词，最常见的可能是：\n- doc（n.）医生；（文件）document 的简称\n- dodge（v.）躲开；避开\n- Dolce（adj./n.，借用词）“甜的/甜美的”（多见于音乐术语，如 dolce sound）\n你可以告诉我你的句子或上下文，我就能帮你确定你想要的词。"]}
{"word":"Docena","summary":{"en":"“Docena” is Spanish for “dozen” (twelve items).","zh":"“docena”是西班牙语，意思是“一打”（十二个）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Spanish) a dozen; a group of twelve items.","zh":"（西班牙语）一打；十二个（一组）"},"examples":[{"en":"I bought a docena of eggs at the market.","zh":"我在市场买了一打鸡蛋。"},{"en":"The bakery sells cookies by the docena.","zh":"那家面包店按“一打”来卖饼干。"}]}],"synonyms":["dozen","twelve"],"phonetic":"/doʊˈseɪnə/","extraExplanation":["“Docena”是西班牙语名词，来自拉丁语 *duodecim*（十二）。在美国一些西语环境（如拉美杂货店、市场、烘焙店）里，你可能会听到店员用“por docena”（按打、每打）来报价。正式英文写作中通常直接用“dozen”。"]}
{"word":"docent","summary":{"en":"A docent is usually a museum guide who explains exhibits; in some countries it can also mean a university lecturer.","zh":"docent 通常指博物馆/美术馆的讲解员；在某些国家也可指大学讲师。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who guides visitors in a museum, art gallery, or historic place and explains the exhibits","zh":"（博物馆/美术馆/历史遗址的）讲解员；导览员"},"examples":[{"en":"The docent explained the painting’s symbols in simple terms.","zh":"讲解员用简单的话解释了这幅画里的象征意义。"},{"en":"Ask a docent if you have questions about the exhibition.","zh":"如果你对展览有问题，可以问讲解员。"}]},{"partOfSpeech":"n.","definition":{"en":"a teacher or lecturer, especially at a university (used in some countries)","zh":"（某些国家用法）大学讲师；授课教师"},"examples":[{"en":"In some European universities, a docent may teach and supervise research.","zh":"在一些欧洲大学里，docent 可能负责授课并指导研究。"},{"en":"She was promoted from assistant to docent after publishing her work.","zh":"她发表研究成果后，从助理晋升为讲师（docent）。"}]}],"synonyms":["guide","museum guide","tour guide","lecturer (in some contexts)"],"phonetic":"/doʊˈsɛnt/","extraExplanation":["“docent”在美国最常见的语境是博物馆/美术馆的志愿者或工作人员讲解员，强调“带领参观并解说”。","词源来自拉丁语 *docere*（教、讲授），所以也发展出“大学讲师”的意思；但这一学术头衔在不同国家制度不一，日常英语里不如“lecturer/professor”常用。","相关词：guided tour（导览）、museum guide（博物馆导游）、curator（策展人/馆员，负责展品与策展，不一定带团讲解）。"]}
{"word":"docents","summary":{"en":"“Docents” most commonly means museum or site guides who lead educational tours; less commonly it can mean university teachers in older/formal usage.","zh":"“docents”最常指博物馆/景点的讲解员、导览员；较少见的用法是在较旧或正式语境中指大学教师。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A guide (often a volunteer or trained staff member) who gives educational tours and explanations in a museum, gallery, historic site, zoo, etc.","zh":"（博物馆、美术馆、历史景点、动物园等的）讲解员；导览员"},"examples":[{"en":"The museum docents lead free tours every afternoon.","zh":"博物馆的讲解员每天下午都会带免费导览。"},{"en":"Ask a docent if you want to learn more about this painting.","zh":"如果你想更了解这幅画，可以问讲解员。"}]},{"partOfSpeech":"n.","definition":{"en":"People who have authority, expertise, or who teach in a college or university (a less common meaning in modern everyday English).","zh":"（较少见）大学里有资格教学或有学术权威的人；教师/讲师"},"examples":[{"en":"In some older texts, “docents” refers to university teachers.","zh":"在一些较旧的文本里，“docents”指大学教师。"}]}],"synonyms":["guides","tour guides","museum guides","volunteers (in museums)"],"phonetic":"/ˈdoʊsənts/","extraExplanation":["“docent”在美国最常见的语境是文化机构的“志愿者讲解员/导览员”。很多机构会培训docents，让他们用适合大众的方式讲故事、介绍背景。","词源上与拉丁语 docere（“教”）有关，所以在部分欧洲学术体系里也可指有教学资格的人；但在日常美式英语里一般不要用它来指大学老师。"]}
{"word":"docentship","summary":{"en":"Docentship means the position or rank of a university docent, often in European academic systems.","zh":"Docentship 指大学“docent”的职位或头衔/资格，常见于欧洲学术体系。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The position or rank of a docent (a university teacher/researcher, often below full professor).","zh":"讲师/副教授等“docent（大学任教或研究人员）”的职位或头衔（常低于正教授）。"},"examples":[{"en":"After several years of research, she applied for a docentship in the department.","zh":"经过几年的研究后，她申请了系里的docentship（讲师/副教授资格或职位）。"},{"en":"In some European systems, a docentship can be an important step toward a professorship.","zh":"在一些欧洲的学术体系中，docentship可能是迈向教授职位的重要一步。"}]}],"synonyms":["lectureship","academic appointment","docent position"],"phonetic":"/ˈdoʊsəntˌʃɪp/","extraExplanation":["“docentship”主要出现在欧洲（尤其是北欧、德语区等）的高等教育语境中，但各国含义不完全一致：有时指一种“资格/认证”（如证明具备独立科研与授课能力），有时更接近具体“职位/头衔”。因此翻译成“讲师”“副教授”或“讲师资格”要结合国家与学校制度判断。","词源上，docent与拉丁语 docere（教）有关；-ship 常表示“身份、职位或状态”（如 friendship 友谊、leadership 领导地位），所以 docentship 就是“docent 的身份/职位”。"]}
{"word":"docere","summary":{"en":"Docere is a Latin verb meaning “to teach,” often seen in academic mottos and in the roots of words like doctor and doctrine.","zh":"Docere 是拉丁语动词，意为“教；教导”，常见于学术校训中，也是 doctor、doctrine 等词的词源之一。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Latin) to teach; to instruct; to show someone how to do something.","zh":"（拉丁语）教；教导；指导某人如何做某事。"},"examples":[{"en":"The university motto includes “docere,” meaning “to teach.”","zh":"这所大学的校训里包含“docere”，意思是“教”。"},{"en":"In Latin class, we learned that docere is the verb behind the idea of education.","zh":"在拉丁语课上，我们学到 docere 这个动词与“教育”的概念有关。"}]}],"synonyms":["teach","instruct","educate"],"phonetic":"/doʊˈkɛreɪ/","extraExplanation":["“docere”是拉丁语动词，常见于校训、学术徽章或古典语境中；在日常英语里通常不会直接当作普通动词使用。","它是许多英语词的词源之一：doctor（本义与“教导者”相关）、doctrine（教义/学说）、docent（讲解员/导览员）、docile（原义有“易受教”之意，后来多指“温顺/听话”）。"]}
{"word":"Docetae","summary":{"en":"Docetae are followers of Docetism, who believed Jesus’ physical body and suffering were only an appearance.","zh":"Docetae 指幻影说（Docetism）的信徒，认为耶稣的肉身与受难只是表象而非真实。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural noun, historical Christianity) Members or followers of Docetism—an early Christian belief that Jesus’ physical body and suffering were only an appearance, not truly real.","zh":"（复数名词，基督教历史用语）幻影说（Docetism）的信徒；一种早期基督教观点，认为耶稣的肉身与受难只是“看似如此”，并非真实发生。"},"examples":[{"en":"Some early church writers argued strongly against the Docetae.","zh":"一些早期教会作家强烈反对幻影说信徒（Docetae）。"},{"en":"The dispute with the Docetae shaped debates about Jesus’ humanity.","zh":"与幻影说信徒的争论影响了有关耶稣“人性”的讨论。"}]}],"synonyms":["Docetists","followers of Docetism"],"phonetic":"/dɑˈsiːtiː/","extraExplanation":["“Docetae”来自希腊语词根 dokein（意为“看起来、似乎”）。在英语宗教史著作中常用来指代主张耶稣只是“表象成肉身”的群体。此词较为罕见，现代更常见的说法是 Docetists（幻影说者/幻影论者）。","拼写提醒：如果你想表达更常用的英文词，通常写作 Docetists；“Docetae”多见于较古典或学术性的语境。"]}
{"word":"docetae","summary":{"en":"Docetae = early Christians who believed Jesus’ physical body and suffering were only an appearance (Docetism).","zh":"Docetae＝早期基督教中信奉“幻影说”（认为耶稣肉身与受难只是表象）的一派人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(historical) A group of early Christians who followed Docetism, the belief that Jesus’ physical body and suffering were only an appearance, not truly real.","zh":"（历史）幻影说派/信奉幻影说的人：早期基督教中的一支，主张耶稣的肉身与受难只是“看起来像”，并非真实发生。"},"examples":[{"en":"Some church writers argued strongly against the Docetae in the second century.","zh":"一些教父作家在公元二世纪强烈反对幻影说派（Docetae）。"},{"en":"To understand the Docetae, it helps to know the early debates about Jesus’ humanity and divinity.","zh":"要理解幻影说派（Docetae），了解早期关于耶稣“人性与神性”的争论会很有帮助。"}]}],"synonyms":["Docetists","followers of Docetism"],"phonetic":"/dɑːˈsiːtiː/","extraExplanation":["“Docetae”来自希腊语词根 *dokein*（“似乎、看起来像”）。它是复数形式，指一群人；单数可见于拉丁化写法如“Docete(s)”或用更常见的现代术语“Docetist”（幻影说者）。","该词多见于神学史、教会史写作中，属于较学术、历史语境的用词；日常英语中更常用“Docetism / Docetist”。"]}
{"word":"docetaxel","summary":{"en":"Docetaxel is a chemotherapy medicine used to treat several types of cancer.","zh":"Docetaxel（多西他赛）是一种用于治疗多种癌症的化疗药物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemotherapy drug (a taxane) used to treat several cancers by stopping cancer cells from dividing","zh":"一种化疗药物（紫杉烷类），用于治疗多种癌症，通过阻止癌细胞分裂来起作用"},"examples":[{"en":"Docetaxel is commonly used in treatment plans for breast cancer.","zh":"多西他赛常用于乳腺癌的治疗方案中。"},{"en":"Some patients receive docetaxel together with other medicines.","zh":"有些患者会将多西他赛与其他药物联合使用。"},{"en":"The nurse monitored her closely during the docetaxel infusion.","zh":"护士在多西他赛输注过程中密切监测她的情况。"}]}],"synonyms":["Taxotere","taxane (drug class)"],"phonetic":"/ˌdoʊsɛkˈtæksəl/","extraExplanation":["“Docetaxel”中文常译为“多西他赛”。它属于“taxane（紫杉烷）”类抗癌药，和“paclitaxel（紫杉醇）”是近亲药物。","这是处方药且必须由肿瘤科团队评估与使用。学习该词时更常见的搭配有：docetaxel infusion（多西他赛输注）、docetaxel-based regimen（以多西他赛为基础的方案）、side effects（副作用）等。","在真实语境中，人们也常用商品名“Taxotere”指代该药，但不同国家/地区的药品名称与可用性可能不同。"]}
{"word":"Docetic","summary":{"en":"Docetic means “related to Docetism,” the belief that Jesus only seemed to be human and to suffer physically.","zh":"docetic 指“与幻影说有关的”，即认为耶稣只是看似具有人身并经历肉体受苦的观点。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the belief (Docetism) that Jesus only seemed to have a physical human body and to suffer, rather than truly being human in the flesh.","zh":"与“幻影说（Docetism）”有关的；指一种早期基督教观点：认为耶稣只是“看起来”有真实的人类肉身与受苦，而非真正以肉身为人。"},"examples":[{"en":"Some early Christian writers argued strongly against docetic ideas.","zh":"一些早期基督教作者强烈反对带有幻影说色彩的观点。"},{"en":"The letter was written to correct docetic teachings about Jesus’s humanity.","zh":"这封书信旨在纠正有关耶稣人性的幻影说教导。"}]}],"synonyms":["Docetist","phantom-body (in context)","illusory (in context)"],"phonetic":"/doʊˈsiːtɪk/","extraExplanation":["“Docetic”来自希腊语 dokein（意为“似乎、看起来”），因此它强调的是“表象/看似如此”。","在宗教史与神学研究中，“Docetism（幻影说）”常被归入早期教会所反对的思想之一，因为它会削弱“道成肉身”（耶稣真正成为人、真实受苦）的教义重点。"]}
{"word":"docetic","summary":{"en":"“Docetic” means relating to Docetism—the belief that Jesus only appeared to have a physical body and to suffer.","zh":"“docetic”指与“幻影说（Docetism）”相关：认为耶稣的肉身与受苦只是表象。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Docetism, an early Christian belief that Jesus only seemed to have a physical human body and to suffer, rather than truly being physically human.","zh":"与“幻影说（Docetism）”有关的；指一种早期基督教观点：耶稣只是“看起来”有真实的人类肉身与受苦，并非真正以肉身为人。"},"examples":[{"en":"Some scholars describe this text’s portrayal of Jesus as docetic.","zh":"一些学者将这段文本对耶稣的描写称为“带有幻影说倾向（docetic）”。"},{"en":"The church rejected docetic interpretations because they denied a fully human incarnation.","zh":"教会反对幻影说式的解读，因为那否认了“道成肉身”中的完全人性。"}]}],"synonyms":["Docetist","illusory (in theological discussion)"],"phonetic":"/doʊˈsiːtɪk/","extraExplanation":["“docetic”来自希腊语词根 dokein（意为“看起来、似乎”）。它常见于宗教学、神学与古代教义史的讨论中，用来评价某段文本或某种基督论是否把耶稣的受难与肉身性表达成“只是表象”。","注意：它通常是学术/历史语境的描述性术语，不等同于日常用语中的“装出来的/假的”。"]}
{"word":"Docetically","summary":{"en":"“Docetically” means “in a Docetic manner,” relating to the idea that Christ’s physical humanity and suffering were only an appearance.","zh":"“Docetically”意为“以幻影说的方式/从幻影说角度”，指把基督的肉身与受难看作仅是表象的观点或解读。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a Docetic way; according to Docetism (the belief that Jesus’s human body and suffering were only apparent, not real).","zh":"以“幻影说（Docetism）”的方式；按照幻影说的观点（认为耶稣的肉身与受难只是表象，并非真实）。"},"examples":[{"en":"Some early critics said the poem presents Christ docetically, as if pain never truly touched him.","zh":"一些早期批评者说这首诗以“幻影说”的方式呈现基督，好像痛苦从未真正触及他。"},{"en":"The historian warns against reading the gospel accounts docetically, ignoring their emphasis on real suffering.","zh":"这位历史学者提醒不要用“幻影说”的角度去解读福音书叙述，从而忽视其中对真实受难的强调。"}]}],"synonyms":["in a Docetic way","from a Docetic perspective","apparently (in context)"],"phonetic":"/doʊˈsɛtɪkli/","extraExplanation":["“docetically”来自“Docetism（幻影说）”。词根与希腊语 dokein（意为“看起来、似乎”）有关，所以这个词常出现在宗教史、神学、教会论战和文学批评中，用来指一种“把肉身当作表象”的解读方式。","该词非常少见；在一般英语写作里，更多会用形容词“Docetic”或短语“in a Docetic way / from a Docetic perspective”。"]}
{"word":"docetically","summary":{"en":"“Docetically” means “in a Docetic (Docetism-related) way,” referring to the belief that Jesus only seemed to have a physical body and suffering.","zh":"“docetically”指“以幻影说（Docetism）相关的方式”，即认为耶稣只是看似有肉身与受难。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to Docetism (the belief that Jesus only seemed to have a physical body and to suffer, rather than truly having a human body).","zh":"以“幻影说（Docetism）”的方式；与幻影说有关地（指认为耶稣只是“看似”有肉身、受难，而非真正具有人性肉身）。"},"examples":[{"en":"Some early Christian writers argued against those who spoke docetically about Jesus’ suffering.","zh":"一些早期基督教作家反对那些以“幻影说”的方式谈论耶稣受难的人。"},{"en":"The text can be read as docetically influenced, because it avoids describing a real physical death.","zh":"这段文本可被解读为受“幻影说”影响，因为它回避描写真实的肉身死亡。"}]}],"synonyms":["in a Docetic way","in a Docetist way"],"phonetic":"/doʊˈsɛtɪkli/","extraExplanation":["“docetically”非常少见，主要出现在宗教史、神学或早期基督教争论的学术写作中。更常见的相关词是形容词“Docetic”（幻影说的）以及名词“Docetism”（幻影说）。","词源提示：Docetism 来自希腊语 dokein（“似乎、显得”）。因此 docetic/docetically 的核心意思是“看似如此，而非真实如此”。"]}
{"word":"Docetism","summary":{"en":"Docetism is the theological view that Jesus only appeared to be human and to suffer physically, rather than truly becoming human.","zh":"幻影说是一种神学观点，认为耶稣只是表面上像人并受苦，而不是真正成为人并经历真实的肉身受难。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Christian theology, usually considered a heresy) the belief that Jesus Christ only seemed to have a physical human body and to suffer, rather than truly becoming human and truly suffering.","zh":"（基督教神学中，通常被视为异端）幻影说：认为耶稣基督只是“看起来”有真实的人类肉身与受苦经历，而非真正成了人、真正受苦。"},"examples":[{"en":"Many early church writers rejected Docetism because it denied that Jesus truly suffered and died.","zh":"许多早期教会作家反对幻影说，因为它否认耶稣真实受苦并死亡。"},{"en":"In class we compared Docetism with the doctrine of the Incarnation (God becoming human).","zh":"课堂上我们把幻影说与“道成肉身”（上帝成为人）的教义作了比较。"}]}],"synonyms":["phantomism (rare)","the doctrine of appearance (descriptive)"],"phonetic":"/doʊˈsiːtɪzəm/","extraExplanation":["“Docetism”来自希腊语词根 dokein，意为“看起来/似乎”。因此它的核心不是说“耶稣不存在”，而是强调耶稣的肉身与受难只是表象。","在早期基督教争论中，许多主流神学家认为：如果基督不是真正的人，就无法真正经历人的痛苦与死亡，也就会影响“救赎”与“复活”的意义。因此幻影说常被归为早期异端之一。","相关概念：与之常被对比的是“道成肉身（Incarnation）”与“基督既完全为神也完全为人”的教义；有时也会与某些诺斯替（Gnostic）思想背景一起被讨论。"]}
{"word":"docetism","summary":{"en":"Docetism is the theological idea that Jesus only appeared to be human and to suffer physically, rather than truly being human.","zh":"Docetism（幻影说）是一种神学观点，认为耶稣只是表面上像人、像在肉体上受苦，并非真正为人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Christian theology) The belief that Jesus only seemed to have a real human body and to suffer physically, but was actually purely divine (not truly human).","zh":"（基督教神学）幻影说：认为耶稣只是“看起来”有真实的人类身体并经历肉体痛苦，但实际上完全是神性、并非真正为人。"},"examples":[{"en":"Some early Christian writers argued against Docetism because it denied Jesus’ real humanity.","zh":"一些早期基督教作家反对幻影说，因为它否认耶稣真实的人性。"},{"en":"In a church history class, we learned how Docetism shaped debates about the nature of Christ.","zh":"在教会历史课上，我们学习了幻影说如何影响关于基督本性的争论。"}]}],"synonyms":["phantomism (rare)","appearance-only view (descriptive)"],"phonetic":"/doʊˈsiːtɪzəm/","extraExplanation":["“Docetism”来自希腊语 *dokein*（意为“看起来、似乎”）。它常与早期基督教中关于“耶稣既是神又是人”的讨论相关。主流基督教传统通常把它视为异端，因为如果耶稣并未真正成为人、也未真正受苦与死亡，那么“受难与救赎”的意义会被削弱。","学习时可以把它和更常见的主题词一起记：*incarnation*（道成肉身）、*crucifixion*（钉十字架）、*heresy*（异端）、*orthodoxy*（正统）等。"]}
{"word":"Docetist","summary":{"en":"A Docetist is someone (or something) connected to Docetism, the belief that Jesus only seemed to have a real human body and real physical suffering.","zh":"Docetist 指“幻影说”相关的人或观点：认为耶稣的肉身与受苦只是看起来如此，并非真实成了人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who believes in Docetism—the idea that Jesus Christ only seemed to have a real human body and real physical suffering, rather than truly becoming human","zh":"主张“幻影说”（Docetism）的人：认为耶稣基督只是“看起来”有真实的人体与肉身受苦，而并非真正成为人"},"examples":[{"en":"Some early Christian writers criticized the Docetists for denying Jesus’s full humanity.","zh":"一些早期基督教作家批评幻影说者否认耶稣完整的人性。"},{"en":"The textbook explains how the church argued against Docetist ideas.","zh":"教材解释了教会如何反驳幻影说的观点。"}]},{"partOfSpeech":"adj.","definition":{"en":"relating to Docetism or to the belief that Christ’s physical body and suffering were only an appearance","zh":"与幻影说有关的；指认为基督的肉身与受苦只是表象的"},"examples":[{"en":"The letter may be read as a response to Docetist teaching.","zh":"这封书信可能被解读为对幻影说教导的回应。"},{"en":"Scholars debate whether certain passages show a Docetist influence.","zh":"学者们讨论某些段落是否显示出幻影说的影响。"}]}],"synonyms":["Docetism believer","proponent of Docetism"],"phonetic":"/doʊˈsiːtɪst/","extraExplanation":["“Docetist”来自希腊语词根 dokein（意为“似乎、看起来”）。它常用于研究早期基督教思想史的语境。主流基督教传统通常把幻影说视为异端，因为它被认为削弱了“道成肉身”（God truly became human）这一核心信条。"]}
{"word":"docetist","summary":{"en":"A Docetist is a follower of Docetism, believing Christ only seemed to have a physical body and suffering.","zh":"Docetist 指“幻影说”的信奉者：认为基督的肉身与受难只是表象。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who believes in Docetism—the view that Jesus Christ only seemed to have a real physical body and to suffer, rather than truly being physically human.","zh":"幻影说（Docetism）的信奉者；认为耶稣基督只是“看起来”拥有真实肉身并受苦，而非真正具备肉体人性的观点。"},"examples":[{"en":"Some early church writers argued strongly against the Docetists.","zh":"一些早期教会作家强烈反对幻影说信奉者。"},{"en":"A Docetist might claim that Christ’s suffering was only an appearance, not a physical reality.","zh":"幻影说信奉者可能会主张：基督的受难只是表象，而非真实的肉体经历。"}]}],"synonyms":["follower of Docetism","Docetism adherent"],"phonetic":"/ˈdoʊsətɪst/","extraExplanation":["“Docetist”来自“Docetism（幻影说）”。该词根源与希腊语 dokein（意为“看起来/似乎”）有关，因此核心含义是“只是显得如此”。","在早期基督教历史中，幻影说常被归为“异端”立场之一，因为它否认或弱化了耶稣真实的肉身与真实受苦，这与主流教义中强调的“道成肉身”相冲突。","在学术写作或宗教史语境里更常见；日常英语中很少使用，通常出现在神学、宗教学、古代教会史的讨论中。"]}
{"word":"Docetistic","summary":{"en":"Docetistic means “related to Docetism,” the belief that Jesus only seemed to have a real body; it can also describe any view that treats physical reality or suffering as unreal.","zh":"Docetistic 指“与幻影说有关的”：认为耶稣只是看似有肉身；也可泛指把肉身现实或痛苦当作不真实的观点（常带批评）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Docetism, the early Christian belief that Jesus only seemed to have a physical body and to suffer, rather than truly being human.","zh":"与“幻影说”（Docetism）有关的；指一种早期基督教观点：认为耶稣只是“看起来”有肉身并受难，而不是真正具有人性与真实受苦。"},"examples":[{"en":"Some writers described the group’s teachings as docetistic because they denied that Jesus truly suffered.","zh":"一些作者把该团体的教义描述为 docetistic（带有幻影说色彩），因为他们否认耶稣真的受苦。"},{"en":"The council rejected docetistic interpretations of the incarnation.","zh":"该会议否定了对“道成肉身”的 docetistic（幻影说式）解释。"}]},{"partOfSpeech":"adj.","definition":{"en":"More generally, seeming spiritual or unreal in a way that denies the reality of the body, pain, or material life (often used critically).","zh":"更广义地：带有“否认肉身/痛苦/物质生活真实存在”的倾向；常带批评意味。"},"examples":[{"en":"The novel criticizes a docetistic spirituality that ignores everyday suffering.","zh":"这部小说批评一种 docetistic（否认现实苦难的）灵性观，忽视了日常的痛苦。"},{"en":"His comments felt docetistic, as if real lives were just ideas.","zh":"他的评论显得很 docetistic（过于“只讲观念”），仿佛真实人生只是理念。"}]}],"synonyms":["docetic"],"phonetic":"/ˌdoʊsəˈtɪstɪk/","extraExplanation":["词源提示：docetistic 来自 Docetism，源于希腊语 dokein（意为“似乎、看起来”）。因此它的核心含义是“看似有、其实没有/不真实”。","使用场景：它多用于神学、宗教史、思想史的学术讨论；在日常英语里很少见。写作中偶尔会被借用来批评“脱离现实、把肉身与苦难当作不重要”的观点。","相关词：docetic（更常见的形容词形式，含义相同）；Docetism（名词，幻影说）。"]}
{"word":"docetistic","summary":{"en":"Docetistic means “related to Docetism,” the belief that Jesus only appeared to have a real human body.","zh":"docetistic 指“与幻影说有关的”，即认为耶稣只是表面上像有真实肉身。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to Docetism, an early Christian belief that Jesus only seemed to have a physical body and to suffer, rather than truly being human in the flesh.","zh":"与“幻影说（Docetism）”有关的；指早期基督教的一种观点，认为耶稣只是“看起来”有肉身并受难，而非真实以血肉之躯为人。"},"examples":[{"en":"Some scholars describe certain second-century writings as having a docetistic view of Jesus’ suffering.","zh":"一些学者认为某些二世纪文献对耶稣受难持有“幻影说式（docetistic）”的看法。"},{"en":"The author criticizes docetistic ideas and insists that Christ truly became human.","zh":"作者批评“幻影说式”的观念，并坚持基督确实成为人。"}]}],"synonyms":["docetic"],"phonetic":"/ˌdoʊsəˈtɪstɪk/","extraExplanation":["词源来自希腊语 dokein（“似乎、看起来”）。在宗教史与神学讨论中较常见；日常英语里很少用。","常见相关词：Docetism（n. 幻影说）、docetic（adj. 与 docetism 有关的）。docetistic 与 docetic 意思接近，但 docetic 更常见。"]}
{"word":"Docetists","summary":{"en":"Docetists are followers of Docetism, an early Christian belief that Jesus only seemed to have a physical body and to suffer physically.","zh":"Docetists 指奉行“幻影说”的人，即早期基督教中认为耶稣的肉身与受难只是表象、并非真实物质经历的一派。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who follow (or are associated with) Docetism—an early Christian belief that Jesus’s physical body and suffering were only an appearance, not truly physical.","zh":"奉行（或与）幻影说（Docetism）有关的人；一种早期基督教观点，认为耶稣的肉身与受难只是“看起来如此”，并非真实的物质经历。"},"examples":[{"en":"Some early church writers argued strongly against the Docetists, insisting that Jesus was truly human as well as divine.","zh":"一些早期教会作者强烈反对幻影说信徒，坚持耶稣既真实为人，也真实为神。"},{"en":"In a survey of early Christianity, the Docetists are often mentioned alongside other disputed movements.","zh":"在关于早期基督教的概览中，幻影说信徒常与其他有争议的思潮一同被提及。"}]}],"synonyms":["followers of Docetism","Docetist (singular)"],"phonetic":"/doʊˈsiːtɪsts/","extraExplanation":["“Docetists”是复数形式；单数为“Docetist”。该词来自希腊语词根“dokein”（意为“看起来、似乎”），因此中文常译为“幻影说/假象说”相关。","在基督教历史语境里，这一观点常被主流教会视为“异端”，相关讨论多见于早期教父著作与基督论（关于基督是谁的教义）争辩中。"]}
{"word":"Docetize","summary":{"en":"A rare verb meaning to treat something as only seeming to be real (Docetic), or to promote Docetism in theology.","zh":"一个罕见动词：把事物解释为“只是看似真实”（幻影说式），或在神学中宣扬/采取“幻影说（Docetism）”。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Rare, usually in theology) To interpret something in a “Docetic” way—treating a person or event as only seeming to be real or physical rather than truly real.","zh":"（罕见，多用于神学）以“幻影说/道西派（Docetism）”的方式来解释——把某人或某事看作只是“看起来真实/有形”，而非真正真实或具肉身。"},"examples":[{"en":"Some critics say the film docetizes suffering by turning it into a beautiful image instead of showing its reality.","zh":"一些评论者说这部电影把苦难“幻影化”（docetizes），把它变成美丽的画面，而不是呈现它的真实。"},{"en":"The scholar argues that this reading docetizes the story and removes its human, physical stakes.","zh":"那位学者认为这种解读把故事“幻影化”（docetizes），抹去了其中人的、身体层面的真实利害关系。"}]},{"partOfSpeech":"vi.","definition":{"en":"(Rare, theology) To promote or adopt Docetism (the belief that Christ only seemed to have a physical body).","zh":"（罕见，神学）宣扬或采取“幻影说/道西派”（认为基督只是“看似”有肉身）。"},"examples":[{"en":"In the early church debates, some groups were accused of docetizing.","zh":"在早期教会的争论中，一些团体被指责在宣扬幻影说（docetizing）。"},{"en":"The author warns against docetizing when discussing the incarnation.","zh":"作者在讨论“道成肉身”时提醒不要走向幻影说（docetizing）。"}]}],"synonyms":["(theology) adopt Docetism","treat as mere appearance","spiritualize (in a critical sense)"],"phonetic":"/ˈdoʊsɪˌtaɪz/","extraExplanation":["“docetize”非常少见，多见于学术写作或批评性语境。它来自“Docetism（幻影说）”，词根与希腊语 *dokein*（“似乎、看起来”）相关，因此常带有“把真实当成表象/削弱真实肉身性”的批评意味。","如果你原本想查的是“doctitize/doctorize（篡改、擅改文件）”或“document/documentize（文档化）”，告诉我上下文句子，我可以帮你确认正确拼写与词义。"]}
{"word":"docetize","summary":{"en":"“Docetize” means to treat Christ’s humanity as only seeming (a Docetist interpretation).","zh":"“docetize”指用“幻现说”的角度解读基督的人性，认为其肉身与受苦只是表象。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Theology) To interpret or present Christ’s humanity as only seeming or illusory; to adopt or promote a Docetist view (Docetism).","zh":"（神学）以“幻现说”（Docetism）的方式解释或呈现基督的人性，认为耶稣的肉身与受苦只是“看起来如此”；采用或宣扬幻现说观点。"},"examples":[{"en":"Some critics argue that the novel docetizes Jesus by treating his suffering as symbolic rather than fully human.","zh":"一些批评者认为这部小说把耶稣“幻现化”，把他的受苦当作象征，而不是完整的人类经验。"},{"en":"Early church writers opposed any teaching that docetized the incarnation.","zh":"早期教会作家反对任何把“道成肉身”解释成幻现的教导。"}]}],"synonyms":["take a docetic view","promote Docetism","interpret docetically"],"phonetic":"/ˈdoʊsəˌtaɪz/","extraExplanation":["“Docetize”来自“Docetism（幻现说）”。该词源头可追溯到希腊语 *dokein*，意为“看起来像、似乎”。在早期基督教思想史中，幻现说通常被视为偏离正统的观点：它认为耶稣并非真正具有人类肉身或真实受苦，而只是“显得”像人一样。","这个词在现代英语里非常少见，多出现于神学、宗教史或学术讨论中。日常表达中更常用“take a docetic view / promote Docetism（采取/宣扬幻现说观点）”。"]}
{"word":"docga","summary":{"en":"“docga” is not a recognized standard English word; it likely needs context or correct spelling.","zh":"“docga”不是标准英语词，可能需要语境或更正拼写。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"No standard English word found. It may be a misspelling, a username, a brand name, or an acronym.","zh":"未发现标准英语单词。它可能是拼写错误、用户名、品牌名或缩写。"},"examples":[{"en":"I couldn’t find “docga” in a dictionary—could you share the sentence you saw it in?","zh":"我在词典里找不到“docga”——你能把它出现的句子发我吗？"},{"en":"If you meant “doc,” that usually means a doctor or a document.","zh":"如果你想写的是“doc”，通常表示“医生”或“文件”。"}]}],"phonetic":"/ˈdɑkɡə/","extraExplanation":["“docga”本身不像常见英语词。为了帮你准确解释，我需要更多信息：\n1）你是在什么句子/语境里看到的？\n2）它是大写（如 DOCGA）还是小写（docga）？\n3）你想表达的可能是哪个词（例如 doc、dog、docs、Dodga 等）？\n把原句贴出来，我可以判断它是否是缩写、拼写错误，或特定领域术语。"]}
{"word":"dochmiac","summary":{"en":"A classical Greek metrical foot/rhythm used especially in tragedy to convey intense emotion.","zh":"古希腊诗歌（尤指悲剧）中用于表达强烈情绪的一种音步/韵律。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(In classical Greek poetry) a metrical foot or rhythm used especially in tragedy to express strong emotion, often scanned as ⏑ — — ⏑ — (with variations).","zh":"（古希腊诗歌中）一种韵律格/音步，尤见于悲剧，用来表达强烈情感，常见格律可读作 ⏑ — — ⏑ —（也有变体）。"},"examples":[{"en":"The chorus shifts into a dochmiac rhythm when the scene becomes frantic.","zh":"当场景变得紧张狂乱时，合唱队的节奏转为 dochmiac 韵律。"},{"en":"Students often meet the term “dochmiac” while reading Greek tragedy and studying meter.","zh":"学生在阅读希腊悲剧、学习格律时常会遇到“dochmiac”这个术语。"}]}],"synonyms":["dochmius","dochmiac meter"],"phonetic":"/doʊkˈmaɪ.æk/","extraExplanation":["“dochmiac”属于古典学/格律学术语，主要用于分析古希腊戏剧（尤其是欧里庇得斯、索福克勒斯等作品）中的合唱段落与抒情段落。它常与“情绪激烈、焦虑、哀痛、惊恐”等戏剧氛围联系在一起。","也常见拼写与相关词：dochmius（名词，指该音步本身）、dochmiac meter（短语，指“dochmiac 格律/韵律体系”）。","在现代英语写作中，这个词多出现在学术语境（诗歌格律、古典文学研究），日常对话里很少使用。"]}
{"word":"dochmiacal","summary":{"en":"Dochmiacal describes something in, or like, the ancient Greek dochmiac meter—often irregular and emotionally charged.","zh":"Dochmiacal 指与古希腊“dochmiac”格律有关的，常带不规则、情绪强烈的节奏感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the *dochmiac* meter (a rhythm used especially in ancient Greek tragedy, often to express strong emotion or agitation).","zh":"与“dochmiac（多赫米亚格）韵律/格律”有关的（古希腊悲剧中常用的一种节奏形式，常用来表现激动、慌乱等强烈情绪）。"},"examples":[{"en":"The chorus shifts into a dochmiacal rhythm when the tension peaks.","zh":"当紧张感达到顶点时，合唱队转入了 dochmiacal（多赫米亚格）节奏。"},{"en":"Her analysis explains why the poet chose a dochmiacal pattern for the scene of panic.","zh":"她的分析解释了诗人为什么在恐慌场景中选择了 dochmiacal 的格律。"}]},{"partOfSpeech":"adj.","definition":{"en":"(by extension) having an irregular, disturbed, or highly emotional rhythm or movement.","zh":"（引申）节奏不规则、紊乱的；带有强烈情绪波动的（常形容节奏/韵律/表达）。"},"examples":[{"en":"The speech has a dochmiacal feel—broken, urgent, and emotional.","zh":"这段演讲带有 dochmiacal 的感觉——断裂、急促而情绪强烈。"},{"en":"The music becomes almost dochmiacal as the character loses control.","zh":"当角色失控时，音乐变得几乎是 dochmiacal 式的紊乱节奏。"}]}],"synonyms":["dochmiac","metrical","rhythmic","irregular","agitated"],"phonetic":"ˌdɑkˈmaɪ.ə.kəl","extraExplanation":["“Dochmiacal”来自“dochmiac”，指古希腊诗歌与戏剧中的一种格律（常见于悲剧合唱/抒情段落）。它常被用来表现人物惊惧、悲痛、焦躁等强烈情绪，因此现代评论里也会引申为“情绪激烈、节奏紊乱”的风格描述。","这是比较学术、文学评论语境中的词，日常英语里很少用。更常见的替代说法包括：irregular rhythm（不规则节奏）、agitated tone（激动的语气）、frantic cadence（慌乱的节奏）。"]}
{"word":"dochmiasis","summary":{"en":"Dochmiasis is an older medical term for hookworm infection (hookworm disease).","zh":"Dochmiasis 是“钩虫病/钩虫感染”的较旧医学用语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a hookworm infection; disease caused by hookworms (especially Ancylostoma species) living in the intestine","zh":"钩虫病；由钩虫（尤指十二指肠钩虫等）寄生在肠道引起的感染/疾病"},"examples":[{"en":"The doctor considered dochmiasis after finding severe anemia and a history of walking barefoot in contaminated soil.","zh":"医生在发现严重贫血并了解到患者曾赤脚接触受污染土壤后，考虑可能是钩虫病（dochmiasis）。"},{"en":"In older medical texts, dochmiasis is discussed alongside other intestinal parasite infections.","zh":"在较早的医学文献中，dochmiasis 常与其他肠道寄生虫感染一起讨论。"}]}],"synonyms":["hookworm disease","hookworm infection","ancylostomiasis"],"phonetic":"/doʊkˈmaɪəsɪs/","extraExplanation":["“dochmiasis”是较旧/较少见的医学用词，来源与钩虫的旧属名“Dochmius”有关；现代英语更常用 hookworm disease 或 ancylostomiasis。","钩虫感染常见传播途径是幼虫从受污染的土壤经皮肤进入人体（例如赤脚行走），可导致缺铁性贫血、乏力等症状。"]}
{"word":"dochmii","summary":{"en":"“dochmii” is not recognized as a standard English word; it likely needs context or a corrected spelling.","zh":"“dochmii”不是标准英语词汇；很可能需要上下文或正确拼写才能确定意思。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling, a username, a brand name, or a word from another language.","zh":"不是标准英语单词。可能是拼写错误、用户名、品牌名，或来自其他语言的词。"},"examples":[{"en":"I can’t find “dochmii” in major English dictionaries—could you share the sentence where you saw it?","zh":"我在主要英语词典里找不到“dochmii”——你能把看到它的句子发我吗？"},{"en":"Did you mean “doc” (short for doctor/document) or “dachshund” (a dog breed)?","zh":"你是想写“doc”（doctor/document 的缩写）还是“dachshund”（腊肠犬）吗？"}]}],"extraExplanation":["我需要更多上下文才能准确判断“dochmii”的意思：\n1）你在哪里看到的（网页、游戏、歌曲、聊天）？\n2）能提供包含它的完整句子吗？\n3）你想表达的是哪种意思：人名/昵称、品牌、外语词，还是英文拼写？\n\n如果你能告诉我以上信息，我可以帮你确认正确拼写、发音与含义。"]}
{"word":"dochmius","summary":{"en":"A metrical foot from Ancient Greek poetry, especially in tragedy, linked to intense emotion and an irregular rhythm.","zh":"古希腊诗歌（尤指悲剧）中的一种格律音步，常与强烈情绪与不规则节奏相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Prosody) A metrical pattern (foot) used in Ancient Greek poetry—especially Greek tragedy—often associated with emotional intensity; it is commonly described as having a “limping” or irregular rhythm compared with more regular meters.","zh":"（诗体学）古希腊诗歌中的一种格律（音步），尤常见于希腊悲剧；常用来表达强烈情绪，节奏相较规则格律更显“不整齐/踉跄”。"},"examples":[{"en":"In discussions of Greek tragedy, the dochmius is often mentioned as a meter that signals agitation or grief.","zh":"在讨论希腊悲剧时，dochmius 常被提到是一种用来暗示焦躁或悲痛的格律。"},{"en":"The chorus shifts into dochmius to heighten the sense of panic on stage.","zh":"合唱队改用 dochmius 来加强舞台上的惊惶感。"}]}],"synonyms":["Greek meter","metrical foot (contextual)","tragic meter (contextual)"],"phonetic":"/ˈdɑkmiəs/","extraExplanation":["Dochmius 源自希腊语 *dochmios*（意为“倾斜的、歪斜的”之类的概念），因此常被解释为带有“跛脚/不稳”的节奏感。","它并不是日常英语词汇，主要出现在古典文学、诗律（meter/prosody）研究或翻译评论中。不同学者对它的音节结构会有更细的标注方式，但对学习者来说，抓住“悲剧中用于强烈情绪的特殊格律”这一点最实用。"]}
{"word":"dochter","summary":{"en":"“Dochter” is Dutch for “daughter.”","zh":"“dochter”是荷兰语的“女儿”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Dutch) a daughter; a female child in relation to her parents.","zh":"（荷兰语）女儿；相对于父母而言的女性孩子。"},"examples":[{"en":"In Dutch, “dochter” means “daughter.”","zh":"在荷兰语里，“dochter”意思是“女儿”。"},{"en":"They have one son and one daughter (een zoon en een dochter).","zh":"他们有一个儿子和一个女儿（een zoon en een dochter）。"},{"en":"My daughter is studying in Amsterdam.","zh":"我的女儿在阿姆斯特丹读书。"}]}],"synonyms":["daughter"],"phonetic":"/ˈdɔxtər/","extraExplanation":["“dochter”是荷兰语常用词，对应英语的“daughter”。它和德语“tochter”是同源词，和英语“daughter”也有历史上的亲缘关系。","发音提示：中间的“ch”在荷兰语里常是喉部摩擦音（有点像清喉音），不像英语里的/tʃ/（如“chair”）。不同地区口音会有差异。","如果你是在英文语境里看到“Dochter”，也可能是姓氏或品牌名；但作为普通词时，它通常就是“女儿”。"]}
{"word":"Docia","summary":{"en":"Docia is mainly used as a female personal name, sometimes a nickname for Theodosia.","zh":"Docia 主要用作女性人名，有时是 Theodosia 等名字的昵称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a female given name (a personal name), sometimes used as a nickname for names like Theodosia.","zh":"女性名字（人名）；有时也用作 Theodosia 等名字的昵称。"},"examples":[{"en":"Docia is my great-grandmother’s name.","zh":"Docia 是我曾祖母的名字。"},{"en":"People called her Docia for short, but her full name was Theodosia.","zh":"大家简称她为 Docia，但她的全名是 Theodosia。"}]}],"synonyms":["Theodosia (related name)","Doshia (variant spelling)"],"phonetic":"/ˈdoʊʃə/","extraExplanation":["“Docia”在英语里主要作为人名使用，不是常见的普通词汇。读音在不同家庭/地区可能不完全一致；如果你是从电影、书或某个地区听到的，也可能会有不同读法。","在美国南部或较早期的家谱记录中偶尔能见到这个名字；有时被认为与“Theodosia”这类名字有关，用作昵称或简写。"]}
{"word":"docibility","summary":{"en":"Docibility means being easy to teach or train; teachability and willingness to accept guidance.","zh":"Docibility 指“易教性/可训练性”，即容易被教导并愿意接受指导。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being easy to teach, train, or guide; teachability; willingness to be led or corrected","zh":"易教性；可训练性；（愿意被引导或纠正的）顺从、听从"},"examples":[{"en":"A good mentor looks for curiosity and docibility, not perfection.","zh":"好的导师寻找的是好奇心和易教性，而不是完美。"},{"en":"The puppy’s docibility made basic training quick and enjoyable.","zh":"这只小狗很容易训练，所以基础训练进行得又快又愉快。"},{"en":"In a new job, docibility can help you learn the team’s routines faster.","zh":"在新工作中，易教性能帮助你更快学会团队的工作流程。"}]}],"synonyms":["teachability","tractability","trainability","compliance","amenability"],"phonetic":"/ˌdɑsəˈbɪləti/","extraExplanation":["“docibility”在现代英语中比较少见，更常用的表达是“teachability”（易教性）或“willingness to learn”（愿意学习）。","词源来自拉丁语“docilis”（意为“容易教的”），与“docile”（温顺的、易管教的）同源。注意：用于形容人时，“docile/docibility”有时会带有“过于顺从”的语气；在职场或学习语境中，建议用更中性的“teachability”。"]}
{"word":"docible","summary":{"en":"“Docible” is a rare/old-fashioned adjective meaning teachable or gently obedient; today “docile” is much more common.","zh":"“docible”是一个罕见/旧式形容词，意为“可教的、温顺的”；现代英语更常用“docile”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare/archaic) Easily taught, guided, or managed; teachable; obedient in a gentle way.","zh":"（罕见/古义）容易被教导、引导或管理的；可教的；温顺的。"},"examples":[{"en":"The old text described children as “docible,” meaning they were easy to teach and guide.","zh":"那篇旧文把孩子形容为“docible”，意思是他们容易被教导和引导。"},{"en":"In modern English, people usually say “docile” instead of “docible.”","zh":"在现代英语里，人们通常说“docile”，而不是“docible”。"}]}],"synonyms":["docile","teachable","tractable","compliant"],"phonetic":"/ˈdɑsəbəl/","extraExplanation":["“Docible”在现代英语中几乎不使用，多见于早期书面语或词典条目。日常表达建议用更常见的“docile”（温顺的、易管教的）或“teachable”（可教的）。","词源上与拉丁语 docēre（教导）有关，因此它的核心含义更偏“可教、易被引导”。"]}
{"word":"docibleness","summary":{"en":"Docibleness means being easy to teach or guide; a willing, teachable attitude.","zh":"Docibleness 指“易于教导、乐于受教”的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being easy to teach, guide, or manage; willingness to learn and follow instruction","zh":"温顺可教；易于教导、引导或管理的特质；愿意学习并接受指导"},"examples":[{"en":"Her docibleness made the training program go smoothly.","zh":"她的温顺可教让培训进展得很顺利。"},{"en":"The teacher appreciated the class’s docibleness and curiosity.","zh":"老师很欣赏这个班既好教又充满好奇心。"},{"en":"He succeeded not only through talent but also through docibleness.","zh":"他的成功不仅靠天赋，也靠愿意学习、接受指导。"}]}],"synonyms":["teachability","tractability","docility","compliance","amenability"],"phonetic":"/ˈdoʊsəb(ə)lnəs/","extraExplanation":["“docibleness”比较少见，更常用的是“docility”（温顺、驯服、易管理）或“teachability”（可教性、易学性）。在写作里，“docibleness”常强调“愿意被教、愿意学”，语气通常比“docility”更正面。","词源上与“docile”同源，来自拉丁语 docilis（可教的），与“doctor”（老师、博士，原义与“教导”有关）同根。"]}
{"word":"Docila","summary":{"en":"Docile means calm, gentle, and easy to control or train.","zh":"Docile 指“温顺、温和、易管教/易控制的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Easy to manage or control; calm and willing to obey.","zh":"温顺的；易管教的；听话的（容易被管理或控制，性格平和、愿意服从）"},"examples":[{"en":"The dog is gentle and docile with children.","zh":"这只狗对孩子很温和、很温顺。"},{"en":"She was not the docile student the teacher expected.","zh":"她并不是老师以为的那种听话学生。"},{"en":"Docile animals are easier to train.","zh":"温顺的动物更容易训练。"}]}],"synonyms":["gentle","meek","obedient","pliant","submissive"],"phonetic":"/ˈdɑːsaɪl/","extraExplanation":["你输入的“Docila”更像是西班牙语/葡萄牙语里的阴性形式（docila），意思与英语的 docile 基本相同。英语中标准拼写是 **docile**（形容人或动物“温顺、易管教”）。","发音提示：docile 在美式英语里常读作 /ˈdɑːsaɪl/，注意第二个音节类似“sile”。在不同地区也可能听到 /ˈdɑːsəl/ 之类的读法。","语感小提示：docile 通常是中性或偏褒义（温和好相处），但用在人身上有时带一点负面含义，暗示“过于顺从、缺乏主见”。"]}
{"word":"docile","summary":{"en":"Docile describes someone or an animal that is calm, easy to control, and willing to be guided or taught.","zh":"Docile 指（人或动物）温顺、易控制、愿意受引导或受教。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"easy to manage; calm and willing to be guided or controlled","zh":"温顺的；易管教的；听话的"},"examples":[{"en":"The once wild puppy became docile after a few weeks of training.","zh":"那只原本很野的小狗训练了几周后变得很温顺。"},{"en":"She remained docile during the long flight, quietly reading her book.","zh":"长途飞行中她一直很安静温和，默默看书。"}]},{"partOfSpeech":"adj.","definition":{"en":"willing to accept being taught or led; obedient in a learning or social setting","zh":"（在学习或社会情境中）愿意受教的；顺从的"},"examples":[{"en":"The instructor preferred docile students who followed safety rules.","zh":"教练更喜欢遵守安全规则、愿意配合的学员。"},{"en":"He was docile in class, but he asked sharp questions after the lecture.","zh":"他在课堂上很配合，但讲座结束后会提出很犀利的问题。"}]}],"synonyms":["gentle","meek","obedient","submissive","pliant"],"phonetic":"/ˈdɑːsəl/","extraExplanation":["“docile”常用来形容动物或人的性格与行为，语气通常是中性到偏正面（温和、好带），但用于形容人时有时也会带一点负面暗示：过于顺从、缺乏主见。具体褒贬取决于语境。","词源来自拉丁语 docilis（“易于教导的”），与 “docent / doctrine / doctor”（教导、学说、博士/医生原义为“教师”）同源，核心概念与“可被教导”有关。"]}
{"word":"docilely","summary":{"en":"“Docilely” means behaving in a quiet, obedient, easily controlled way.","zh":"“docilely”表示以温顺、听话、容易被控制的方式行事。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a quiet, obedient, and easily controlled way; submissively.","zh":"温顺地；听话地；顺从地（指安静、容易被管控的方式）。"},"examples":[{"en":"The child sat docilely while the teacher explained the rules.","zh":"老师解释规则时，孩子温顺地坐着听。"},{"en":"The horse walked docilely beside its handler.","zh":"那匹马顺从地走在牵马人身旁。"},{"en":"He nodded docilely, even though he disagreed inside.","zh":"他表面顺从地点头，尽管内心并不同意。"}]}],"synonyms":["obediently","submissively","meekly","compliantly","tractably"],"phonetic":"/ˈdoʊsəli/","extraExplanation":["“docilely”来自形容词“docile（温顺的、易管教的）”。在英语里它通常是中性描述（如动物、学生“很听话”），但用在成年人身上有时带一点负面含义，暗示“过于顺从、缺乏主见”。","常见搭配：sit/stand docilely（温顺地坐/站着），follow docilely（顺从地跟随），nod/smile docilely（顺从地点头/微笑）。"]}
{"word":"docilities","summary":{"en":"Docilities means multiple instances or examples of docility—being easy to teach, manage, or control.","zh":"Docilities 指“docility（温顺、易教、易管束）”的复数，表示多种或多次体现出来的温顺与可教性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural of docility) the quality of being easy to teach, manage, or control; willingness to be guided.","zh":"（docility 的复数）温顺、易于教导或管束；愿意接受引导的特质。"},"examples":[{"en":"The trainer valued the dogs’ docilities, especially their calm response to new commands.","zh":"训犬师很看重这些狗的温顺特质，尤其是它们对新指令的冷静反应。"},{"en":"Different students show different docilities in the classroom—some need more patience and support.","zh":"课堂里不同学生表现出不同程度的“易教性”——有些需要更多耐心和支持。"}]}],"synonyms":["tractability","meekness","compliance","submissiveness"],"phonetic":"/doʊˈsɪləti/","extraExplanation":["“docility”常用于描述动物或人的“易教、易管理”，语气比“obedience（服从）”更强调“可教性/可塑性”，不一定意味着被动屈从。","用于谈论人时要注意语境：在某些场合称某人“docile”可能带有“过于顺从、缺乏主见”的负面含义。"]}
{"word":"docility","summary":{"en":"Docility means being easy to control or teach; gentle obedience.","zh":"docility 指“温顺/驯服/顺从”，强调容易被管理或教导的温和服从。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"willingness to be controlled or taught; being quiet, obedient, and easy to manage.","zh":"温顺；驯服；顺从（愿意被管理或教导，安静听话、好管教）。"},"examples":[{"en":"The horse’s docility makes it a good choice for beginners.","zh":"这匹马很温顺，适合初学者。"},{"en":"Teachers appreciated her docility in class, but they also encouraged her to speak up.","zh":"老师们欣赏她在课堂上的顺从和安静，但也鼓励她多表达自己的想法。"},{"en":"Docility can be helpful for learning, but it shouldn’t mean losing your voice.","zh":"温顺有助于学习，但不应意味着失去自我表达。"}]}],"synonyms":["obedience","submissiveness","meekness","tractability","compliance"],"phonetic":"/ˈdɑːsɪləti/","extraExplanation":["“docility”常与动物训练、课堂管理、职场服从等语境相关。它通常偏中性或褒义（“好管理、好教”），但在谈到权力关系时也可能带一点贬义，暗示“过度顺从、缺乏主见”。","词源来自拉丁语 *docilis*（“可教的”），同根词包括 **docile**（温顺的；易教的）以及 **docent**（讲解员/导览员，源于“教导”之意）。"]}
{"word":"Docilla","summary":{"en":"Docilla is mainly used as a rare female given name rather than a standard English word.","zh":"Docilla 主要作为较少见的女性名字使用，而不是常见英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a rare feminine given name (proper noun). It is not a common standard English vocabulary word; it is usually used as a personal name.","zh":"一个较少见的女性名字（专有名词）。它不是常见的英语词汇，通常作为人名使用。"},"examples":[{"en":"Docilla moved to Chicago for graduate school.","zh":"Docilla 去芝加哥读研究生了。"},{"en":"I met Docilla at a community volunteer event.","zh":"我在一次社区志愿活动中认识了 Docilla。"}]}],"synonyms":["(proper name; no true synonyms)"],"phonetic":"/doʊˈsɪlə/","extraExplanation":["“Docilla”在英语语料里并不常见，更多见于人名或家族/宗教命名传统。","它可能与拉丁语词根 *doc-*（与“teach/learn（教/学）”相关）有关，类似于“docile（温顺的、易教的）/doctrine（教义）”等词；在一些语言中也可能被当作“Docila/Docilla”的变体拼写。","如果你是想查拼写相近的词：**docile**（温顺的、易教的）、**Drusilla**（常见女性名）、或 **Priscilla**（常见女性名），我也可以一起对比解释。"]}
{"word":"Docilu","summary":{"en":"Docile: calm, obedient, and easy to control or teach.","zh":"Docile：温顺、听话、容易管教或训练。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Likely intended: **docile**) easy to control or teach; calm and not likely to argue or fight.","zh":"（很可能是想写：**docile**）温顺的；容易管教或训练的；不爱争斗的。"},"examples":[{"en":"The dog is gentle and docile, so it’s good with children.","zh":"这只狗很温顺，所以很适合和孩子相处。"},{"en":"She has a docile attitude in class and follows instructions well.","zh":"她在课堂上态度很配合，很好地遵守指示。"},{"en":"The teacher prefers docile students, but also wants them to think independently.","zh":"老师喜欢听话的学生，但也希望他们能独立思考。"}]}],"synonyms":["obedient","meek","pliant","submissive","tractable"],"phonetic":"/ˈdɑːsəl/","extraExplanation":["“Docilu”不是常见英文单词；最接近、最常用的拼写是 **docile**。","**docile** 常用于描述动物或人“好管、好带、较少反抗”。注意语气：形容人时有时可能带一点贬义，暗示“太顺从、缺乏主见”。"]}
{"word":"docimasia","summary":{"en":"Docimasia means a test or assay, especially a medical/forensic test; historically it can refer to the lung-floating test used to judge live birth.","zh":"docimasia 指“检验/试验/鉴定”，尤用于医学或法医学；历史上也可特指判断是否活产的“肺浮试验”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a test or assay used to examine or prove something, especially in medicine or forensic science.","zh":"（尤指医学或法医学中的）检验；试验；鉴定（用于检查或证明某事）"},"examples":[{"en":"The lab performed a chemical docimasia to confirm the presence of toxins.","zh":"实验室进行了化学检验，以确认是否存在毒素。"},{"en":"In older medical texts, docimasia is described as a way to evaluate bodily tissues through testing.","zh":"在较早的医学文献中，“docimasia”被描述为通过检验来评估身体组织的方法。"}]},{"partOfSpeech":"n.","definition":{"en":"(forensic, historical) a test used to determine whether a newborn breathed (and therefore was born alive), often by checking whether the lungs float in water.","zh":"（法医学/历史用法）新生儿“肺浮试验”等：用来判断婴儿是否曾呼吸（从而推断是否活产），常见方法是观察肺在水中是否漂浮。"},"examples":[{"en":"The report mentioned lung docimasia, noting whether the lungs floated during the examination.","zh":"报告提到了肺浮试验，并记录了检查时肺是否漂浮。"},{"en":"Today, such docimasia is discussed mainly as a historical forensic method.","zh":"如今，这类检验多作为历史性的法医学方法被讨论。"}]}],"synonyms":["assay","test","examination","analysis","forensic test"],"phonetic":"/ˌdoʊsɪˈmeɪʒə/","extraExplanation":["词源提示：docimasia 来自希腊语词根，含义与“检验、试验、鉴定”相关。它在现代英语中较少见，多出现在医学、病理学或法医学的专业/历史语境中。"]}
{"word":"docimasies","summary":{"en":"“Docimasies” means laboratory tests or assays (plural), especially for metals or ores.","zh":"“docimasies”指（复数）实验室检验/化验，尤指对金属或矿石的试金与鉴定。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"tests or assays, especially laboratory tests used to examine the quality or composition of metals, ores, or other materials","zh":"（尤指在实验室里进行的）检验、化验；（特别是对金属、矿石等的）试金、鉴定"},"examples":[{"en":"The lab performed several docimasies to confirm the ore’s gold content.","zh":"实验室进行了多次试金检验，以确认矿石的含金量。"},{"en":"Early chemists relied on docimasies to judge whether a metal sample was pure.","zh":"早期的化学家依靠各种化验来判断金属样品是否纯净。"}]}],"synonyms":["assays","tests","analyses","examinations"],"phonetic":"/ˈdɑsəˌmeɪziz/","extraExplanation":["“docimasies”是较少见的复数形式，单数为“docimasy / docimasy（试金法、检验法）”。词源来自希腊语，核心含义是“检验、测试”。在现代日常英语中更常用的词是“tests / assays / analyses”。"]}
{"word":"docimastic","summary":{"en":"Docimastic describes technical testing of ores/metals, especially assaying for content and purity.","zh":"docimastic 指与矿石/金属的专业检验有关，尤指测定含量与纯度的“化验/火试金”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(technical) Related to testing or analyzing ores, metals, or minerals—especially by an assay (a method used to measure metal content and purity).","zh":"（技术用语）与矿石、金属或矿物的检验/分析有关，尤指用“火试金/化学分析”等方法进行的含量与纯度测定。"},"examples":[{"en":"The lab uses docimastic methods to determine the gold content of the ore.","zh":"实验室使用与金属测定相关的检验方法来确定矿石中的含金量。"},{"en":"A docimastic report showed the sample had low copper purity.","zh":"一份金属测定报告显示该样品的铜纯度较低。"}]}],"synonyms":["assay-related","analytical","testing","metallurgical"],"phonetic":"/ˌdoʊsɪˈmæstɪk/","extraExplanation":["词源来自希腊语词根，意为“检验、试验、证明合格”。因此它多出现在冶金、矿业、地质与分析化学等专业语境中。","在现代英语里它非常少见；更常见、更通用的表达是 assay (n./v.)（测定/化验）或 analytical testing（分析检测）。"]}
{"word":"docimastical","summary":{"en":"Docimastical means “related to testing or assaying (especially minerals) to judge quality.”","zh":"docimastical 指“与检验/化验（尤指矿物试金）以判断品质有关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to testing or examining something to judge its quality, especially by assay or chemical analysis (often used in mining, metallurgy, or scientific contexts).","zh":"（尤指通过化验或化学分析来）检验、鉴定品质的；与试金/测定有关的（多见于采矿、冶金或科学语境）。"},"examples":[{"en":"The lab performed a docimastical analysis of the ore to estimate its gold content.","zh":"实验室对矿石进行了与化验有关的分析，以估算其含金量。"},{"en":"In older mining texts, docimastical methods were essential for deciding whether a vein was worth working.","zh":"在较早的采矿文献中，与鉴定相关的方法对判断矿脉是否值得开采至关重要。"}]}],"synonyms":["assay-related","analytical","testing","evaluative"],"phonetic":"/ˌdoʊkɪˈmæstɪkəl/","extraExplanation":["这个词非常罕见，多见于较旧或较专业的英语文献（如冶金、矿物学）。现代写作里更常用 assay（化验/试金）, analytical（分析的）, testing（测试的）, evaluative（评估的）等词来表达类似意思。","词源来自希腊语 dokimazein（意为“检验、试验、证明”）。因此它的核心语感是“通过测试来判定品质/真伪/价值”。"]}
{"word":"docimasy","summary":{"en":"Docimasy is a rare word meaning a test or assay, especially in older medical/forensic contexts (notably tests about whether a newborn had breathed).","zh":"Docimasy是个较少见的词，意为“检验/化验”；常见于较旧的医学或法医学语境中（尤其指判断新生儿是否呼吸过的检验）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A test or examination to check something’s quality or authenticity; an assay (often used in medical or scientific contexts).","zh":"用于检验某物质量或真伪的测试；（尤用于医学或科学语境的）检验、化验。"},"examples":[{"en":"The lab performed a docimasy to confirm the composition of the sample.","zh":"实验室进行了docimasy（检验）以确认样本的成分。"},{"en":"In older medical writing, docimasy could refer to various tests used to verify a diagnosis.","zh":"在较早的医学文献中，docimasy可指用于核实诊断的多种检验方法。"}]},{"partOfSpeech":"n.","definition":{"en":"(Forensic medicine, historical) A specific test used to determine whether a newborn had breathed (for example, the lung flotation/hydrostatic test).","zh":"（法医学，历史用法）用于判断新生儿是否曾呼吸过的一种特定检验（例如“肺浮试验/水试验”）。"},"examples":[{"en":"The textbook mentioned lung docimasy as a historical method in infant death investigations.","zh":"教材提到“肺docimasy（肺浮试验）”是婴儿死亡调查中的一种历史方法。"},{"en":"Today, such docimasy is discussed mainly for its historical role and limitations.","zh":"如今，这类docimasy主要因其历史作用与局限性而被讨论。"}]}],"synonyms":["assay","test","examination","analysis","verification"],"phonetic":"/ˌdɑsəˈmaɪzi/","extraExplanation":["该词较少见，多出现在医学/法医学史或较旧的学术写作中。词源来自希腊语 *dokimasia*，意为“检验、试验”。","法医学中的“肺浮试验（lung hydrostatic test）”曾被用来推断新生儿是否呼吸：若肺组织能浮起，可能提示曾吸入空气；但该方法受腐败、复苏操作等因素影响，现代通常不会单独依赖它下结论。"]}
{"word":"docimology","summary":{"en":"Docimology is the study of exams, grading, and how fair and reliable assessment results are.","zh":"Docimology 指研究考试与评分的学科，关注评估结果的公平性与可靠性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the study of testing and grading, especially how exams are designed, scored, and how fair or reliable the results are","zh":"测验与评分学；研究考试与评定方式的学科，尤其关注试题设计、评分方法，以及结果的公平性与可靠性"},"examples":[{"en":"Docimology looks at whether an exam truly measures what students have learned.","zh":"测验与评分学会研究一场考试是否真的测量了学生所学的内容。"},{"en":"Researchers in docimology compare different grading methods to reduce bias.","zh":"测验与评分学的研究者会比较不同的评分方式，以减少偏差。"}]}],"synonyms":["educational assessment","testing and evaluation","assessment science","psychometrics"],"phonetic":"/ˌdoʊsəˈmɑlədʒi/","extraExplanation":["词源上与希腊语中“测试/考验”（dokim-）相关，现代多用于教育测量与评估领域，讨论“信度”（结果是否稳定一致）与“效度”（是否测到该测的能力/知识）等问题。","该词在日常英语中较少见，更常见的表达是 educational assessment（教育评估）、testing and evaluation（测试与评估）、psychometrics（心理测量学，范围更广）。"]}
{"word":"docious","summary":{"en":"“Docious” is a very rare adjective meaning “easily taught/docile,” and it’s most often recognized as the playful ending in “supercalifragilisticexpialidocious.”","zh":"“docious”非常罕见，可表示“容易教导/温顺听话”；更多时候人们是因为“supercalifragilisticexpialidocious”这个俏皮长词而认识它。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Very rare) easily taught; willing to learn; docile.","zh":"（非常罕见）容易教导的；好学的；温顺听话的。"},"examples":[{"en":"The puppy was surprisingly docious and learned “sit” in a day.","zh":"这只小狗出奇地听话，一天就学会了“坐下”。"},{"en":"She’s docious in class—she listens carefully and improves quickly.","zh":"她在课上很“好教”——听得认真，进步很快。"}]},{"partOfSpeech":"other","definition":{"en":"Used mainly as a playful ending in made-up words, especially in “supercalifragilisticexpialidocious.”","zh":"主要作为俏皮的词尾出现在自造词中，尤其见于“supercalifragilisticexpialidocious（超级无敌霹雳好）”。"},"examples":[{"en":"People sometimes joke by adding “-docious” to the end of a long word.","zh":"人们有时会开玩笑，把“-docious”加在长词后面。"}]}],"synonyms":["docile","teachable","obedient","tractable"],"phonetic":"/ˈdoʊʃəs/","extraExplanation":["“docious”本身几乎不作为独立词使用；你更常见到的是著名歌曲/电影《Mary Poppins（欢乐满人间）》里的超长词“supercalifragilisticexpialidocious”。这个词是刻意“编出来的”，用来表达“好得难以形容”。","从构词感觉上看，“-docious”常让人联想到 docile（温顺的、易教的）或 -ous（形容词后缀，表示“……的”），所以偶尔有人把它拿来当作幽默的词尾。学习时把它当作“趣味/文化梗”即可。"]}
{"word":"docity","summary":{"en":"“Docility” means being easy to teach or manage; gentle and obedient.","zh":"“Docility”表示“容易教导/管理、温顺顺从”的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Docility: the quality of being easy to teach, manage, or influence; a calm, obedient willingness to follow guidance.","zh":"Docility：温顺；驯良；（人或动物）容易管教、容易引导的特质。"},"examples":[{"en":"The trainer praised the dog’s docility during the first lesson.","zh":"训练师称赞这只狗在第一节课里的温顺。"},{"en":"Her docility in meetings sometimes made others think she agreed, even when she didn’t.","zh":"她在会议上表现得很顺从，有时会让别人以为她同意了，即使她并不认同。"},{"en":"Teachers value docility, but they also encourage students to think independently.","zh":"老师欣赏学生的温和好教，但也会鼓励学生独立思考。"}]}],"synonyms":["obedience","submissiveness","tractability","meekness"],"phonetic":"/dəˈsɪləti/","extraExplanation":["“docity”在英文里不是常见标准词，日常写作与词典中一般找不到。你很可能想写的是“docility”。","“docility”来自拉丁语词根 *doc-*，与“teach（教）”有关（同源词：doctor, doctrine, docile）。它常用来描述动物的“温顺好训练”，也可形容人的“温和顺从”。在描述人时，语气可能偏中性或略带批评（暗示缺少主见）。"]}
{"word":"dock","summary":{"en":"“Dock” most commonly means a place where boats stop, and it can also mean to bring a boat to that place; it can also mean to reduce pay.","zh":"“dock”最常指“码头”，也可作动词表示“（船）靠岸/停泊”；另外还可指“扣（工资）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a structure (often along a river or harbor) where boats/ships load, unload, or are tied up","zh":"码头；船只停靠、装卸货物的地方"},"examples":[{"en":"The ferry leaves from the dock every 30 minutes.","zh":"渡轮每 30 分钟从码头出发一次。"},{"en":"They waited for him at the dock with flowers.","zh":"他们拿着花在码头等他。"}]},{"partOfSpeech":"n.","definition":{"en":"a platform inside a court where the defendant sits during a trial (BrE more common; in AmE it’s understood but less common)","zh":"（法庭）被告席（英式英语更常见；美式英语也能理解但不太常用）"},"examples":[{"en":"He sat in the dock while the judge read the verdict.","zh":"法官宣读判决时，他坐在被告席上。"}]},{"partOfSpeech":"v.","definition":{"en":"to bring a ship or boat to a dock; to tie it up at a dock","zh":"（使船只）靠码头；停泊"},"examples":[{"en":"The captain docked the ship carefully.","zh":"船长小心地让船靠上码头。"},{"en":"We docked at noon and started unloading cargo.","zh":"我们中午靠岸，开始卸货。"}]},{"partOfSpeech":"vt.","definition":{"en":"to take away part of something, especially pay; to reduce","zh":"（尤指工资）扣除；减少"},"examples":[{"en":"They docked his pay for being late.","zh":"他迟到了，他们扣了他的工资。"}]}],"synonyms":["pier","wharf","berth","moor","deduct"],"phonetic":"/dɑk/","extraExplanation":["名词 dock（码头）在日常英语里非常常用；动词 dock 也常见于旅行/航运语境（dock the boat）。","“扣工资”的 dock 常与 pay / wages 连用：dock someone’s pay（扣某人的工资）。语气偏正式或偏公司制度用语。"]}
{"word":"dock sb. of the pleasure of childhood","summary":{"en":"deprive someone of something they should be able to enjoy","zh":"剥夺某人本应享有的快乐或权益"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to deprive someone of something enjoyable or valuable (a formal use: “dock someone of something”)","zh":"剥夺某人（本应享有的）某种快乐/权益（较正式用法：dock sb. of sth.）"},"examples":[{"en":"Long hours of test prep can dock children of the simple pleasure of childhood.","zh":"长时间的应试训练可能会剥夺孩子们童年里简单的快乐。"},{"en":"The policy docked many students of time for play and rest.","zh":"这项政策剥夺了许多学生玩耍和休息的时间。"},{"en":"Don’t dock your kids of curiosity by correcting them too harshly.","zh":"别用过于苛刻的纠正来剥夺孩子的好奇心。"}]}],"synonyms":["deprive","rob","deny","take away","strip","withhold"],"phonetic":"/dɑk/","extraExplanation":["更常见的搭配是 dock sb. of sth. 或 dock sth. from sb.（较正式/书面）。在日常口语里，通常会用 deprive sb. of sth. / take away / rob sb. of sth. 来表达。","你给的短语里 the pleasure of childhood 指“童年应有的快乐与体验”（如玩耍、好奇心、无忧无虑等），常见于教育、社会议题写作。"],"etymology":"“dock”原意与“截短、剪掉尾巴/一部分”有关，后来引申为“扣减、剥夺”（如 dock pay 扣工资）。因此 dock sb. of sth. 带有“把该有的一部分拿走”的感觉。","mnemonic":["把 dock 想成“扣掉/剪掉一截”：dock = 扣减 → dock sb. of sth. = 从某人那里“扣掉”某种东西。","联想“扣工资”dock pay：能扣工资，就能“扣走/剥夺”别的东西。"]}
{"word":"dock sb.'s wages","summary":{"en":"deduct money from someone’s pay","zh":"从某人的工资中扣钱"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to reduce (someone’s) pay by taking money away, usually as a punishment or to cover a cost","zh":"扣（某人）的工资；从工资中扣钱（通常作为惩罚或用于抵扣费用）"},"examples":[{"en":"The company docked his wages for being late three times in one week.","zh":"他一周迟到三次，公司就扣了他的工资。"},{"en":"They threatened to dock her wages if she didn’t return the missing equipment.","zh":"他们威胁说如果她不归还丢失的设备，就要扣她的工资。"},{"en":"Some employers dock wages to cover uniform costs, but rules vary by place.","zh":"有些雇主会从工资里扣制服费用，但各地规定不一样。"}]}],"synonyms":["deduct","withhold pay","reduce pay","take out of someone's pay","make a pay deduction"],"phonetic":"/dɑk ˈsʌmˌbɑdiz ˈweɪdʒɪz/","extraExplanation":["语气与语用：这句话常用于正式/劳动场景，带有“惩罚、处罚”的感觉；日常更中性的说法可以用 “deduct from someone’s pay”。","注意搭配：常见结构是 “dock someone’s wages (by $X / for something)”；例如 “dock his wages by $50” 或 “dock his wages for lateness”。","文化/法律提示：在一些地区，随意扣工资可能违法或需要书面同意（如最低工资、工时、罚款扣薪等规定）。学习表达时可理解其含义，但现实中常涉及劳动法规。"],"etymology":"“dock”原义有“剪短、截去（如剪短动物尾巴）”的意思，后来引申为“从应得的东西里扣掉一部分”，用于工资时就是“扣薪”。","mnemonic":["把 dock 想成“刀咔(doi-ka)”一刀“咔”掉一截：工资被“咔”掉一部分=扣工资。","联想“剪短尾巴(dock a tail)”→“剪掉一部分钱(dock wages)”。"]}
{"word":"dock with","summary":{"en":"connect or come alongside for transfer, especially for ships or spacecraft","zh":"（尤指船只/航天器）与……对接或靠泊以便转运"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"to connect to or come alongside another vehicle or structure, especially a spacecraft or ship, so that people or goods can move between them","zh":"（尤指航天器或船只）与……对接/靠泊，以便人员或货物互通"},"examples":[{"en":"The capsule will dock with the space station tomorrow morning.","zh":"飞船返回舱将于明天早上与空间站对接。"},{"en":"At sunset, the ferry docked with the pier and passengers got off.","zh":"日落时分，渡轮靠泊码头，乘客下船。"},{"en":"Our ship docked with the supply barge to take on fuel.","zh":"我们的船与补给驳船靠泊以加油。"}]},{"partOfSpeech":"phrase","definition":{"en":"to join or link one thing with another (more general, often in technical or system contexts)","zh":"（更泛指）把……与……连接/接入（常用于系统、设备等语境）"},"examples":[{"en":"This adapter lets the old device dock with a modern laptop.","zh":"这个转接器能让旧设备接入现代笔记本电脑。"},{"en":"The app is designed to dock with your calendar and email.","zh":"这个应用被设计为与日历和邮件系统联动连接。"}]}],"synonyms":["connect with","link up with","join with","dock alongside","couple with","mate with","rendezvous with"],"phonetic":"/dɑk wɪð/","extraExplanation":["在航天英语里，“dock with”常指两艘航天器通过对接机构连接并密封（sealed），以便宇航员在舱段之间转移。类似的词还有“berth”（靠泊/系泊，常用于机器人臂把飞行器“抓住并停放”）。","在港口语境里，“dock with”多见于口语或叙述；更常见的表达是“dock at (a pier/port)”。如果强调“和另一艘船并靠”，也会说“dock alongside”。"],"etymology":"“dock”原指“码头/船坞”，来自中古英语，和“停靠、入坞”相关；后来引申为“（船）靠泊”，再扩展到航天领域的“（飞行器）对接”。“dock with”就是“与……靠泊/对接”。","mnemonic":["把它想成“dock（码头/停靠）+ with（和……一起）”：两者“靠在一起”就能“对接/靠泊”。","联想中文“对接”：对=相对着，接=接上；“dock with”就是“对着并接上”。"]}
{"word":"dock-tailed","summary":{"en":"Dock-tailed means an animal’s tail has been cut short (docked).","zh":"dock-tailed 指动物的尾巴被剪短（断尾/截尾）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of an animal, especially a dog or horse) having a tail that is cut short (docked).","zh":"（指动物，尤指狗或马）尾巴被剪短的；断尾的（已截尾的）。"},"examples":[{"en":"The dock-tailed dog wagged its short tail excitedly.","zh":"那只断尾的狗兴奋地摇着短尾巴。"},{"en":"Some breeds are traditionally shown as dock-tailed, though rules vary by country.","zh":"有些品种在传统上会以断尾的形象参展，但各国规定不一。"}]}],"synonyms":["bobtailed","docked","short-tailed"],"phonetic":"ˈdɑkˌteɪld","extraExplanation":["“Dock”作动词有“截短、修剪”的意思；在“dock-tailed”里指“把尾巴剪短”。“docking tails（断尾）”在一些地方曾是传统（如工作犬避免受伤、或出于审美），但也涉及动物福利争议，很多国家/地区对非医疗目的断尾有严格限制或禁止。写作时可用更中性的表达如“a dog with a docked tail（尾巴被截短的狗）”。"]}
{"word":"dockage","summary":{"en":"Dockage means a deduction from payment (or the impurity amount) when goods—especially grain—contain foreign material or fail quality/weight standards.","zh":"Dockage 指因货物（尤指谷物）含杂质或不达标而产生的扣款；也可指谷物中的杂质含量。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a deduction (a fee or amount taken off) from a payment or price because goods are damaged, dirty, underweight, or not meeting quality standards.","zh":"（货款中的）扣减额；扣款（因货物受损、有杂质、短重或不达标而从应付款中扣除的金额）。"},"examples":[{"en":"The elevator applied dockage because the wheat contained too many weed seeds.","zh":"粮库因为小麦里杂草籽太多而扣了款（dockage）。"},{"en":"After inspection, the buyer calculated the dockage and paid the reduced total.","zh":"检验后，买方算出扣款金额，并按扣后的总价付款。"}]},{"partOfSpeech":"n.","definition":{"en":"the amount of foreign material (such as chaff or dirt) separated from grain during cleaning and grading.","zh":"（谷物清理分级时分离出的）杂质含量；杂质。"},"examples":[{"en":"The lab report listed the dockage at 1.2%.","zh":"化验报告显示杂质（dockage）为 1.2%。"},{"en":"Lower dockage usually means cleaner grain and a better price.","zh":"杂质越少，谷物越干净，价格通常越好。"}]}],"synonyms":["deduction","discount","shrinkage","penalty","impurities"],"phonetic":"/ˈdɑkɪdʒ/","extraExplanation":["“Dockage”在北美农业与谷物贸易里很常见，常见于收购站（elevator）、检验报告和合同条款中：既可以指“杂质比例”，也可以指因此产生的“扣款金额”。具体计算方式会因作物、等级标准与合同约定而不同。","不要把它与“dock”（码头/停靠）混淆；两者拼写相近但词源和含义不同。"]}
{"word":"dockages","summary":{"en":"Dockages are either docking fees at a port or deductions for impurities in grain.","zh":"dockages 指码头停靠费，或指谷物因杂质而产生的扣量/扣重。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Fees or charges paid for the use of a dock or wharf (for example, when a ship docks).","zh":"码头使用费；停靠费（船只靠泊码头时支付的费用）。"},"examples":[{"en":"The port increased dockages for cargo ships during the busy season.","zh":"在旺季，港口提高了货船的停靠费。"},{"en":"Dockages and storage fees are listed separately on the invoice.","zh":"发票上把停靠费和仓储费分别列出。"}]},{"partOfSpeech":"n.","definition":{"en":"Amounts deducted from the weight or price of grain because of impurities (such as chaff, weed seeds, or damaged kernels).","zh":"（谷物的）杂质扣量；扣重（因夹杂物、碎粒等而从重量或价格中扣除的部分）。"},"examples":[{"en":"The buyer measured dockages before setting the final price for the wheat.","zh":"买方在确定小麦最终价格前先测定杂质扣量。"},{"en":"Higher dockages can lower a farmer’s profit.","zh":"杂质扣量越高，农民的收益可能越低。"}]}],"synonyms":["docking fees","wharfage","port charges","deductions","impurity deduction"],"phonetic":"/ˈdɑkɪdʒ/","extraExplanation":["“Dockage”有两个常见专业含义：港口/航运中的“码头费用”和粮食交易中的“杂质扣量”。在农业语境里，它通常是不可数名词，但在一些报告或合同中也会看到复数形式“dockages”，用来表示不同批次或不同项目的扣量/扣费。"]}
{"word":"docked","summary":{"en":"“Docked” most often means “brought to a dock and tied up,” and it can also mean “had pay/points reduced” or “connected to a docking station.”","zh":"“Docked”最常见指“（船只）靠岸停泊”，也可指“被扣工资/扣分”，或“（设备）接入扩展坞/底座”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Past tense/past participle of “dock”) to bring a ship or boat to a dock (a wharf) and tie it up.","zh":"（dock 的过去式/过去分词）使（船只）靠岸停泊在码头并系好。"},"examples":[{"en":"The ferry docked at 8:15 a.m., and passengers got off quickly.","zh":"渡轮在早上 8:15 靠岸停泊，乘客很快下船。"},{"en":"We watched the cargo ship docked beside the pier.","zh":"我们看着货船停泊在码头旁。"}]},{"partOfSpeech":"v.","definition":{"en":"(Past tense/past participle of “dock”) to take away part of someone’s pay, points, or time as a penalty or adjustment.","zh":"（dock 的过去式/过去分词）扣除（工资/分数/时间）作为惩罚或调整。"},"examples":[{"en":"His pay was docked for arriving late three times.","zh":"他因迟到三次被扣了工资。"},{"en":"The teacher docked two points for missing units.","zh":"老师因为缺少单位扣了两分。"}]},{"partOfSpeech":"v.","definition":{"en":"(Past tense/past participle of “dock”) to connect a device to a docking station (often for charging or data).","zh":"（dock 的过去式/过去分词）（把设备）接入底座/扩展坞（常用于充电或传输数据）。"},"examples":[{"en":"I docked my laptop to use the bigger monitor.","zh":"我把笔记本接入扩展坞来用更大的显示器。"},{"en":"The tablet is docked overnight to charge.","zh":"平板电脑夜里接在底座上充电。"}]},{"partOfSpeech":"v.","definition":{"en":"(Less common) to cut something short, especially an animal’s tail.","zh":"（较少见）截短（尤指动物的尾巴）。"},"examples":[{"en":"The puppy’s tail was docked before it was adopted.","zh":"那只小狗被领养前尾巴被截短了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Tied up at a dock; moored.","zh":"停靠在码头的；系泊的。"},"examples":[{"en":"The docked boat rocked gently in the water.","zh":"停靠的船在水里轻轻摇晃。"}]}],"synonyms":["moored","berthed","tied up","deducted","reduced","penalized","connected"],"phonetic":"/dɑkt/","extraExplanation":["“docked”既可以是动词（dock 的过去式/过去分词），也常用作形容词表示“停靠着的”。语境很重要：在工作/学校里常见的是“扣工资/扣分”，在科技语境里常见的是“把设备接入扩展坞/底座”。","英美文化中，“dock someone’s pay”带有正式或管理语气；更中性也可以说“deduct from someone’s pay（从工资中扣除）”。"]}
{"word":"docken","summary":{"en":"“Dock(en)” in English is usually “dock”: to moor/stop a ship, to connect a spacecraft/device, or to subtract pay as a penalty; “dock” can also be a pier/loading area.","zh":"英语里通常用 “dock”（而不是 docken）：可指船只靠泊、飞船/设备对接，也可指扣工资（处罚）；“dock” 也可作名词表示码头/装卸平台。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"(Nonstandard in English) likely a misspelling of “dock” or “docking.” In English, we usually say “to dock” (a ship/spacecraft) or “to dock something.”","zh":"（英语里不常用）很可能是把 “dock / docking” 拼成了 “docken”。英语通常说 “to dock”（船/飞船靠泊、对接）或 “to dock something”（把……靠泊/对接/扣除）。"},"examples":[{"en":"Did you mean “dock the boat” or “docking”?","zh":"你是想说 “dock the boat”（让船靠码头）还是 “docking”（靠泊/对接）吗？"},{"en":"The spacecraft will dock with the station tomorrow.","zh":"飞船明天将与空间站对接。"}]},{"partOfSpeech":"v.","definition":{"en":"to dock: to bring a ship into a dock/harbor so it stops there; to connect (a spacecraft) to a station; to attach a device to a docking station.","zh":"dock（动词）：（船只）靠码头/停泊；（航天器）对接；（设备）插入/连接到扩展坞（底座）。"},"examples":[{"en":"The captain docked the ship carefully.","zh":"船长小心地把船靠好码头。"},{"en":"Please dock your laptop and connect the monitor.","zh":"请把笔记本接到扩展坞上并连接显示器。"},{"en":"The shuttle docked with the ISS.","zh":"航天飞机与国际空间站对接。"}]},{"partOfSpeech":"n.","definition":{"en":"a dock: a platform/area where ships load and unload; also, the place a ship is tied up.","zh":"dock（名词）：码头；装卸平台；（船只）停靠处。"},"examples":[{"en":"They waited at the dock for the ferry.","zh":"他们在码头等渡轮。"},{"en":"Cargo is loaded at the dock.","zh":"货物在装卸平台装载。"}]},{"partOfSpeech":"vt.","definition":{"en":"to dock (pay/time): to take away part of someone’s pay or time as a penalty; a dock can also mean this reduction.","zh":"dock（扣除工资/时间）：因处罚而扣工资或扣时间；dock 也可指这种扣减。"},"examples":[{"en":"They docked his pay for being late.","zh":"他迟到，他们扣了他的工资。"},{"en":"She got a dock in pay this month.","zh":"她这个月被扣了一部分工资。"}]}],"synonyms":["moor","berth","tie up","connect","attach","deduct"],"phonetic":"/dɑk/","extraExplanation":["“docken”更像是德语的动词形式（如“docken an”=对接/靠泊）。如果你是在英文语境里看到“docken”，大概率是拼写错误，建议改用“dock / docking”。","常见搭配：dock at (the pier/harbor)（在……靠泊）；dock with (a station)（与……对接）；docking station（扩展坞/底座）。"]}
{"word":"docker","summary":{"en":"Docker is a container platform for packaging and running apps consistently; in tech talk it can also be used as a verb meaning “to containerize with Docker.”","zh":"Docker 是用于一致地打包和运行应用的容器平台；在技术语境中也可作动词，表示“用 Docker 容器化”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A popular platform for building, shipping, and running applications in containers (lightweight, isolated environments that include the app and its dependencies).","zh":"一个用于构建、分发并运行“容器化”应用的平台（容器是轻量、隔离的运行环境，包含应用及其依赖）。"},"examples":[{"en":"We use Docker to package the web app so it runs the same on every computer.","zh":"我们用 Docker 打包这个网页应用，这样它在每台电脑上运行都一样。"},{"en":"Install Docker Desktop if you want to run containers on Windows or macOS.","zh":"如果你想在 Windows 或 macOS 上运行容器，可以安装 Docker Desktop。"}]},{"partOfSpeech":"v.","definition":{"en":"To run or package (software) using Docker containers.","zh":"用 Docker 容器来运行或打包（软件）。"},"examples":[{"en":"Let’s Docker this service before deploying it to the cloud.","zh":"在把这个服务部署到云端之前，我们先把它用 Docker 容器化。"},{"en":"They dockerized the app to make deployment faster.","zh":"他们把应用容器化（dockerize），让部署更快。"}]}],"synonyms":["container platform","containerization tool","Docker engine","dockerize (verb)"],"phonetic":"/ˈdɑkər/","extraExplanation":["“Docker”原本是“码头工人/装卸工”的意思（docker），Docker 的图标是一只驮着集装箱的鲸鱼，用“集装箱”类比容器：标准化、可搬运、到哪都能跑。","学习时常见搭配：Docker image（镜像：打包好的模板）、container（容器：运行中的实例）、Dockerfile（构建镜像的脚本）、registry（镜像仓库，如 Docker Hub）。"]}
{"word":"dockerize","summary":{"en":"Dockerize means to package and run software using Docker containers (or to move a project toward Docker-based workflows).","zh":"dockerize 指用 Docker 容器来打包并运行软件，或把项目迁移到基于 Docker 的开发/部署流程。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to package an application (and its dependencies and settings) into a Docker image and make it run as a Docker container","zh":"把应用程序（以及依赖与配置）打包成 Docker 镜像，并让它以 Docker 容器方式运行"},"examples":[{"en":"We dockerized the API so it runs the same on every developer’s laptop.","zh":"我们把这个 API dockerize 了，这样每个开发者的笔记本上运行效果都一样。"},{"en":"The team is dockerizing the legacy app to simplify deployment.","zh":"团队正在把旧系统 dockerize，以简化部署。"}]},{"partOfSpeech":"v.","definition":{"en":"to start using Docker in a project or workflow (more generally: to move a system toward Docker-based development/deployment)","zh":"（更泛指）在项目或工作流程中开始使用 Docker；把系统迁移到以 Docker 为基础的开发/部署方式"},"examples":[{"en":"After a few outages, they decided to dockerize their development environment.","zh":"经历几次故障后，他们决定把开发环境 dockerize（改用基于 Docker 的方式）。"},{"en":"We’re gradually dockerizing our build process.","zh":"我们正在逐步把构建流程 dockerize。"}]}],"synonyms":["containerize","package into a Docker image","run in a container","migrate to Docker"],"phonetic":"/ˈdɑkəˌraɪz/","extraExplanation":["“dockerize”是软件工程里的新造词（动词化），由“Docker + -ize”组成，意思是“使……变成/采用 Docker 的形式”。在正式写作中，有时也会用“containerize（容器化）”来表达更通用的概念（不局限于 Docker）。"]}
{"word":"Dockerized","summary":{"en":"“Dockerized” means an app or service has been set up to run in Docker containers for consistent deployment and execution.","zh":"“Dockerized”指应用或服务已被配置为在 Docker 容器中运行，以便更一致地运行与部署。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Packaged and set up to run inside a Docker container (so it can be deployed and run consistently across different computers or servers).","zh":"被打包并配置为在 Docker 容器中运行的（因此能在不同电脑或服务器上更一致地部署与运行）。"},"examples":[{"en":"We dockerized the web app so the whole team can run it the same way.","zh":"我们把这个网页应用做成了 Docker 化，这样整个团队就能用同样的方式运行它。"},{"en":"The service is fully dockerized and ready for deployment.","zh":"这个服务已经完全 Docker 化，可以部署了。"}]},{"partOfSpeech":"v.","definition":{"en":"Converted into a Docker-based setup (often meaning the build, dependencies, and startup commands are defined in a Dockerfile and related configs).","zh":"转换为基于 Docker 的方案（通常指用 Dockerfile 等配置定义构建、依赖与启动方式）。"},"examples":[{"en":"After we dockerized the database, onboarding new developers became much faster.","zh":"在我们把数据库 Docker 化之后，新人入职配置环境快了很多。"},{"en":"Is the project dockerized, or do I need to install the dependencies locally?","zh":"这个项目 Docker 化了吗，还是我需要在本地安装依赖？"}]}],"synonyms":["containerized","packaged for Docker","Docker-based"],"phonetic":"/ˈdɑkərˌaɪzd/","extraExplanation":["“dockerized”来自动词“dockerize”（把……容器化 / Docker 化）。技术语境里常说“dockerized app/service”。也常见近义表达：containerized（容器化，范围比 Docker 更广）。","写法上多见小写“dockerized”；严格来说“Docker”是品牌名，但在工程对话中常被当作通用动词使用。"]}
{"word":"dockerizes","summary":{"en":"“Dockerizes” means “makes an app run in a Docker container” (dockerizes = containerizes with Docker).","zh":"“dockerizes”表示“把应用做成可在 Docker 容器中运行的形式”（即用 Docker 进行容器化/制作镜像）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(third-person singular of “dockerize”) to package and configure an application so it can run in a Docker container.","zh":"（“dockerize”的第三人称单数）把应用程序打包并配置为可以在 Docker 容器中运行。"},"examples":[{"en":"Our CI pipeline dockerizes the web app on every push.","zh":"我们的 CI 流水线在每次提交时都会把这个 Web 应用 dockerize（容器化）。"},{"en":"She dockerizes the service so everyone can run it the same way.","zh":"她把这个服务 dockerize（容器化），让每个人都能用同样的方式运行。"}]}],"synonyms":["containerizes","packages","encapsulates"],"phonetic":"ˈdɑkəˌraɪz","extraExplanation":["“dockerize / dockerizes”是技术圈常用动词，来自产品名 Docker（常大写）。含义接近“把某个程序做成可在容器里运行的版本”，通常涉及编写 Dockerfile、设置镜像依赖与启动命令。中文里常说“容器化”“做成 Docker 镜像”。"]}
{"word":"dockerizing","summary":{"en":"Dockerizing means packaging an app into Docker containers so it runs consistently across environments.","zh":"Dockerizing 指把应用打包进 Docker 容器，让它在不同环境中一致运行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The process of packaging an application and everything it needs (code, runtime, libraries, settings) into a Docker container so it can run consistently across different computers and environments.","zh":"将应用及其运行所需的一切（代码、运行时、依赖库、配置等）打包到 Docker 容器中的过程，以便在不同电脑和环境中一致运行。"},"examples":[{"en":"We’re dockerizing the web app so it runs the same on every developer’s laptop and on the server.","zh":"我们正在把这个网页应用进行 Docker 化，这样它在每位开发者的笔记本和服务器上都能同样运行。"},{"en":"After dockerizing the project, deployment became much easier.","zh":"把项目 Docker 化之后，部署变得容易多了。"}]},{"partOfSpeech":"v.","definition":{"en":"(Present participle/gerund of “dockerize”) Packaging an application into Docker containers.","zh":"（dockerize 的现在分词/动名词）把应用打包成 Docker 容器。"},"examples":[{"en":"Dockerizing our service requires writing a Dockerfile and choosing a base image.","zh":"要把我们的服务 Docker 化，需要编写 Dockerfile 并选择一个基础镜像。"},{"en":"She’s dockerizing the API to simplify testing in CI.","zh":"她正在把 API Docker 化，以简化 CI 中的测试。"}]}],"synonyms":["containerizing","containerization","packaging into containers"],"phonetic":"/ˈdɑkərˌaɪzɪŋ/","extraExplanation":["“dockerizing / Docker 化”是软件工程领域的口语化用法，更正式的说法常见为 “containerizing（容器化）”。","常见搭配：dockerize an app/service；Dockerfile（构建说明书）；image（镜像）；container（容器）；docker-compose（多容器编排）。"]}
{"word":"dockers","summary":{"en":"“Dockers” can mean dock workers, Docker software containers, or the Dockers pants brand, depending on context.","zh":"“dockers”可指码头工人、Docker 软件容器，或 Dockers 裤装品牌，需看语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(usually plural) People who work at a dock, loading and unloading ships; dock workers.","zh":"（通常用复数）码头工人；在港口装卸货物的工人。"},"examples":[{"en":"The dockers unloaded the containers early in the morning.","zh":"码头工人一大早就开始卸集装箱。"},{"en":"The strike by the dockers stopped shipping for two days.","zh":"码头工人罢工导致航运停了两天。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural) Software containers made with Docker, used to package and run applications.","zh":"（复数）Docker 容器；用 Docker 打包并运行应用程序的容器。"},"examples":[{"en":"We deploy our app using Docker containers on the server.","zh":"我们用 Docker 容器把应用部署到服务器上。"},{"en":"These dockers make it easier to run the same program on different computers.","zh":"这些 Docker 容器让同一个程序在不同电脑上运行更方便。"}]},{"partOfSpeech":"n.","definition":{"en":"(often capitalized) A brand name for casual khaki-style pants.","zh":"（常大写）Docker’s：一种休闲卡其裤品牌/风格的裤子。"},"examples":[{"en":"He wore Dockers to the office with a button-down shirt.","zh":"他穿着 Dockers 配衬衫去上班。"}]}],"synonyms":["dock workers","longshoremen","Docker containers","containers"],"phonetic":"/ˈdɑkərz/","extraExplanation":["“dockers（码头工人）”来自 dock（码头）+ -er（做某事的人）。“docker”指在码头工作的人，因此复数 dockers 很常见。","“Docker（容器）”是一个产品名（Docker, Inc. 相关），在技术语境里人们常说 “Docker containers”。口语里也可能把容器直接称为 “dockers”，但更标准的说法是 “containers”。","“Dockers（裤子）”通常指 Levi’s 旗下的 Dockers 品牌，很多时候用大写。语境不同意思差很多：港口/劳工→码头工人；IT/部署→容器；服装/穿搭→裤子品牌。"]}
{"word":"docket","summary":{"en":"“Docket” usually means a court schedule or case record, and it can also mean an agenda or to-do list; as a verb, it means to officially record something (especially a court case).","zh":"“docket”常指法院的案件排期表或案卷记录；也可指议程/待办清单；作动词时表示（尤指法院）把事项正式登记在案。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a list or schedule of cases to be heard in a court; also, a court file or record for a case","zh":"（法院的）案件排期表；（也可指）案件卷宗/案卷记录"},"examples":[{"en":"Our case is on the court’s docket for next Monday.","zh":"我们的案子排在下周一的法院审理日程上。"},{"en":"The clerk updated the docket with the new hearing date.","zh":"书记员把新的开庭日期更新到排期表里。"}]},{"partOfSpeech":"n.","definition":{"en":"a list of things to do or matters to be dealt with, especially in a meeting or organization","zh":"（会议/组织的）议程；待处理事项清单"},"examples":[{"en":"Budget cuts are at the top of today’s docket.","zh":"预算削减是今天议程的首要议题。"},{"en":"We have three items left on the docket.","zh":"我们的待办事项还剩三项。"}]},{"partOfSpeech":"vt.","definition":{"en":"to enter or record a case or document on an official list, especially in court","zh":"（尤指在法院）把案件/文件登记在案；记入案卷"},"examples":[{"en":"The appeal was docketed on Friday.","zh":"这份上诉在周五已登记立案。"},{"en":"The motion must be docketed before the judge can review it.","zh":"动议必须先登记入卷，法官才能审查。"}]}],"synonyms":["schedule","calendar","agenda","case list","register","record"],"phonetic":"/ˈdɑkət/","extraExplanation":["“docket”常见于法律英语：on the docket（在审理/议程中）、off the docket（不再排期/撤下议程）、docket number（案号/卷宗号）。","词源上与“document（文件）”同源，核心意思是“把事项/文件记录在官方清单里”，所以既可指“清单/排期”，也可作动词“登记在案”。"]}
{"word":"docketed","summary":{"en":"“Docketed” means officially recorded/entered into a court’s docket (case list), or the act of recording it.","zh":"“Docketed”指案件或文件被正式登记入法院案卷（待办清单）中，或指将其登记入案的动作。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"officially entered into a court’s (or other authority’s) list of cases to be dealt with; recorded as a matter for consideration","zh":"（案件或事项）被正式登记到法院（或其他机构）的案卷/待办列表中；立案并记录在案"},"examples":[{"en":"The case was docketed on Monday and assigned a hearing date.","zh":"该案件在周一立案登记，并被安排了开庭日期。"},{"en":"Your motion has been docketed, so the judge can review it.","zh":"你的动议已登记入案，因此法官可以进行审查。"}]},{"partOfSpeech":"vt.","definition":{"en":"to officially record or enter (a case, motion, or document) into a docket; to list for future action","zh":"（将案件、动议或文件）正式登记入案；列入待处理清单"},"examples":[{"en":"The clerk docketed the appeal as soon as it arrived.","zh":"上诉材料一到，书记员就立即登记入案。"},{"en":"We docketed the filing and sent a confirmation number.","zh":"我们已将提交材料登记入案，并发送了确认编号。"}]}],"synonyms":["recorded","entered","filed","logged","registered"],"phonetic":"/ˈdɑkətɪd/","extraExplanation":["“docket”在法律语境里指“案卷登记册/待审案件列表”。因此 “docketed”常见于法院通知、律师函或系统状态更新中，含义接近“已受理并录入系统”，但不一定表示“已开庭”或“已裁决”。在美国法律英语中还常见搭配：docket number（案号）、docket entry（案卷记录条目）、be docketed（被立案登记）。"]}
{"word":"docketing","summary":{"en":"Docketing means officially recording a case, document, or deadline on a docket (an official list), especially in legal settings.","zh":"Docketing 指把案件、文件或截止日期等正式登记到案卷/清单中，尤用于法律语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of entering a case, document, or task into an official list (a “docket”), especially in a court or office system","zh":"（将案件、文件或事项）登记入案卷/清单的行为或过程；尤指法院或办公室系统中的“立案/登记”"},"examples":[{"en":"The clerk is responsible for docketing new cases as soon as they are filed.","zh":"书记员负责在新案件提交后尽快进行立案登记。"},{"en":"A small mistake in docketing can delay the hearing date.","zh":"登记入案卷时一个小错误就可能导致开庭日期延后。"}]},{"partOfSpeech":"v.","definition":{"en":"entering a case, document, or task into an official docket or tracking system","zh":"把案件、文件或事项录入案卷或跟踪系统；进行登记/立案"},"examples":[{"en":"The paralegal is docketing the deadlines for the appeal.","zh":"法务助理正在把上诉的截止日期录入系统。"},{"en":"Please confirm you have docketed the motion and served the other party.","zh":"请确认你已将该动议登记入系统，并已送达对方。"}]}],"synonyms":["filing","recording","logging","registering","entering (into a system)"],"phonetic":"/ˈdɑkətɪŋ/","extraExplanation":["“Docket”在美式法律语境里指法院的案件清单/案卷日程（也可泛指任何需要跟踪的事项清单）。因此“docketing”常出现在法律助理、书记员、律所行政等岗位的工作描述中，核心是“记录+跟踪截止日期（deadlines）”。","常见搭配：docketing clerk（立案/登记员）、docketing system（案卷管理系统）、docketing errors（登记错误）、docket the case/motion（登记案件/动议）、docket the deadline（登记截止日期）。"]}
{"word":"dockets","summary":{"en":"“Dockets” usually means court case lists/schedules, or brief file records; it can also be the verb meaning “to record or enter into a docket.”","zh":"“dockets”通常指法院案件清单/开庭排期或文件简要记录；也可作动词，意为“登记入案、记入清单/案卷”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a list or schedule of cases to be dealt with in a court, or the set of cases waiting to be heard","zh":"（法院的）案件清单、开庭排期表；（待审理的）一批案件"},"examples":[{"en":"The judge reviewed the day’s dockets before court began.","zh":"法官在开庭前查看了当天的案件排期表。"},{"en":"The court’s dockets are crowded this month.","zh":"这个月法院的待审案件很多。"}]},{"partOfSpeech":"n.","definition":{"en":"a brief written record, label, or note attached to a file or document (often used in offices and law)","zh":"（常用于办公室或法律场景的）文件标签、简要记录、案卷摘要"},"examples":[{"en":"Each folder had a docket with the client’s name and date.","zh":"每个文件夹上都贴有写着客户姓名和日期的标签。"},{"en":"Please check the docket for the tracking number.","zh":"请查看记录单上的追踪号码。"}]},{"partOfSpeech":"v.","definition":{"en":"to make a brief note of something and add it to a list or file (especially in legal or office work)","zh":"（尤指法律或行政工作中）把……登记/记入清单或案卷；给文件加注简要说明"},"examples":[{"en":"The clerk docketed the motion as soon as it arrived.","zh":"书记员一收到动议就立刻登记入案。"},{"en":"We docketed the complaint under a new case number.","zh":"我们把这份投诉按新的案号登记。"}]}],"synonyms":["calendar (court)","schedule","case list","case log","register","record","file"],"phonetic":"/ˈdɑkɪts/","extraExplanation":["在美国法律语境中，court docket（法院案卷/排期）非常常见：既指“某天要审哪些案”的排期表，也可以泛指“这个法院积压/待审的案件”。动词 docket 常见于正式书面语，表示“登记入案、立案并记录”。"]}
{"word":"dockhand","summary":{"en":"A dockhand is a dock worker who handles cargo and other tasks at a harbor.","zh":"dockhand 指在港口码头从事装卸和其他码头工作的工人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A worker at a dock or harbor who loads and unloads ships, moves cargo, and helps with other waterfront tasks.","zh":"码头工人；在港口/码头装卸货物并处理其他码头工作的工人。"},"examples":[{"en":"The dockhands unloaded crates of fruit from the ship at dawn.","zh":"天一亮，码头工人就开始从船上卸下一箱箱水果。"},{"en":"A dockhand guided the truck driver to the correct loading bay.","zh":"一名码头工人引导卡车司机到正确的装货区。"}]}],"synonyms":["dockworker","longshoreman","stevedore"],"phonetic":"/ˈdɑkˌhænd/","extraExplanation":["“dockhand”常用于港口与航运语境，指在码头一线做体力与操作性工作的人员（如装卸、系缆、搬运、引导车辆等）。在美式英语里也常被更泛用的词替代，如“dockworker”或“longshoreman”（偏正式/工会语境，常指沿海港口装卸工）。"]}
{"word":"dockhands","summary":{"en":"Dockhands are workers at a dock or port who handle cargo, especially loading and unloading ships.","zh":"Dockhands 指在码头或港口负责货物装卸与搬运的工人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Workers who load, unload, and handle cargo at a dock or port; dockworkers.","zh":"在码头或港口装卸、搬运和处理货物的工人；码头工人。"},"examples":[{"en":"The dockhands unloaded crates of fruit from the ship at dawn.","zh":"天一亮，码头工人就开始从船上卸下一箱箱水果。"},{"en":"Dockhands worked quickly to keep the port running smoothly.","zh":"码头工人动作迅速，确保港口运转顺畅。"}]}],"synonyms":["dockworkers","longshoremen","stevedores"],"phonetic":"/ˈdɑkˌhændz/","extraExplanation":["“Dockhand”由 dock（码头）+ hand（帮手/工人）构成，hand 在这里表示“从事体力或技术工作的工人”，类似用法还有 farmhand（农场工人）、deckhand（船员/甲板工）。","在文学和影视中，dockhands 常用来营造港口氛围：忙碌、粗犷、充满货物与船只往来的场景。"]}
{"word":"dockhead","summary":{"en":"“Dockhead” is most commonly a place name (notably in Glasgow, Scotland). As a general vocabulary word, it’s rare/nonstandard.","zh":"“Dockhead”最常见是地名（尤其指苏格兰格拉斯哥一带）。作为普通词汇则较罕见/不标准。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Proper noun) A place name, especially Dockhead, a small area/neighborhood in Glasgow, Scotland.","zh":"（专有名词）地名，尤指英国苏格兰格拉斯哥的 Dockhead（一个小区域/街区）。"},"examples":[{"en":"She grew up in Dockhead before moving to the city center.","zh":"她在 Dockhead 长大，后来搬到市中心。"},{"en":"The walking tour passes through Dockhead and nearby historic streets.","zh":"徒步导览会经过 Dockhead 以及附近的一些历史街区。"}]},{"partOfSpeech":"n.","definition":{"en":"(Rare/Nonstandard) A person connected with a dock (for example, someone working around docks).","zh":"（罕见/不标准用法）与码头有关的人（例如在码头附近工作的人）。"},"examples":[{"en":"In old notes, he’s described as a dockhead who knew every ship in the harbor.","zh":"在旧笔记里，他被描述为一个“dockhead”，熟悉港口里的每一艘船。"}]}],"synonyms":["(place name) district","(rare sense) dockworker"],"phonetic":"/ˈdɑkˌhɛd/","extraExplanation":["“dockhead”在现代英语里并不是常见词，更常见的是作为地名（如格拉斯哥的 Dockhead）。如果你是想查侮辱性的俚语，很多人会把它误写/误听成“dickhead”（非常粗鲁的骂人话），使用时要特别谨慎，正式场合应避免。","如果你告诉我你看到它的句子或语境（比如在哪本书/哪段对话里），我可以更准确判断这里的意思。"]}
{"word":"dockhouse","summary":{"en":"A dockhouse is a building by a dock used for dock operations, storage, or administration.","zh":"dockhouse 指码头边用于装卸管理、存放或办公的建筑物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a building on or near a dock where dock work is managed or where goods and equipment are stored (often a small office, shed, or warehouse by the water)","zh":"码头边的建筑物（常指用于管理装卸、存放货物或设备的办公室/棚屋/仓库）"},"examples":[{"en":"The crew met in the dockhouse before starting the morning shift.","zh":"早班开始前，工人们在码头房集合。"},{"en":"The paperwork for the shipment is kept in the dockhouse office.","zh":"这批货运的文件存放在码头房的办公室里。"}]}],"synonyms":["dock office","dockside warehouse","pier shed","boathouse"],"phonetic":"/ˈdɑkˌhaʊs/","extraExplanation":["“dockhouse”不是非常常见的标准词汇，更常见的写法是分开写“dock house”，或根据具体功能用更明确的词：如“dock office（码头办公室）”“warehouse（仓库）”“shed（棚屋）”“pier building（码头建筑）”。在港口/航运语境中使用会更自然。"]}
{"word":"docking","summary":{"en":"Docking means bringing a ship/vehicle into a dock, connecting devices (often via a docking station), joining spacecraft in space, or (less commonly) reducing pay as a penalty.","zh":"Docking 指船只/交通工具靠泊或进坞、设备对接（常通过扩展坞/底座）、航天器在太空对接，或（较少见）作为惩罚扣减工资。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of bringing a ship, boat, or aircraft into a dock (a place to tie up or load/unload)","zh":"（船只、船舶或飞机）进坞、靠码头的行为或过程"},"examples":[{"en":"The captain handled the docking smoothly despite the strong wind.","zh":"尽管风很大，船长还是很平稳地完成了靠泊。"},{"en":"Docking takes extra time when the tide is low.","zh":"潮位低的时候，靠泊会花更多时间。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of connecting one device to another, especially for charging or data transfer (often in a docking station)","zh":"（设备）对接、接入；尤其指放入底座进行充电或数据传输"},"examples":[{"en":"Place the tablet in the docking station to charge it.","zh":"把平板放到底座上充电。"},{"en":"The laptop supports one-cable docking for power and video.","zh":"这台笔记本支持“一线对接”，同时供电和输出视频。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of joining two spacecraft together in space","zh":"（航天器）在太空中对接"},"examples":[{"en":"The crew prepared for docking with the space station.","zh":"机组人员准备与空间站对接。"},{"en":"Successful docking is a key step in many space missions.","zh":"成功对接是许多航天任务的关键步骤。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of reducing something as a penalty, especially reducing pay (pay docking)","zh":"（作为惩罚）扣减；尤指扣工资"},"examples":[{"en":"The company threatened docking for repeated lateness.","zh":"公司警告说屡次迟到会被扣工资。"},{"en":"Docking someone’s pay may be illegal in some situations.","zh":"在某些情况下扣工资可能是违法的。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle of “dock”: to bring a vehicle/ship/aircraft in to stop at a dock; or to connect devices/spacecraft; or to reduce pay as a penalty","zh":"“dock”的现在分词：使（船/车/飞机）靠泊或入坞；使设备/航天器对接；或作为惩罚扣减（工资等）"},"examples":[{"en":"They are docking the ferry at Pier 7.","zh":"他们正在把渡轮停靠在7号码头。"},{"en":"I’m docking my phone to the speaker for music.","zh":"我把手机接到底座音箱上放音乐。"}]}],"synonyms":["berthing","mooring","tie-up","connection","linking","attachment","pay cut","deduction"],"phonetic":"/ˈdɑkɪŋ/","extraExplanation":["“Docking station”常译为“扩展坞/底座”，在电脑领域很常见，指一个底座让笔记本或平板“一插就连”电源、显示器、网线、USB等。","“Pay docking”在口语里能听到，但在劳动法语境下较敏感；不同地区对“扣工资”的合法条件规定不同。"]}
{"word":"dockings","summary":{"en":"“Dockings” most often means multiple acts of docking—ships or spacecraft coming alongside and attaching/parking at a dock or station; in science it can also mean molecular docking attempts/results.","zh":"“Dockings”最常指多次靠泊/对接——船只或飞船在码头/空间站旁停靠并连接；在科研语境中也可指（多次）分子对接的尝试或结果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the acts or processes of docking (bringing a ship, spacecraft, or vehicle to a dock or station and attaching/parking it there)","zh":"（船只、飞船或车辆）靠泊/对接/停靠的行为或过程（复数）"},"examples":[{"en":"The harbor handled three dockings before noon.","zh":"港口中午前处理了三次靠泊。"},{"en":"The astronauts practiced emergency dockings in the simulator.","zh":"宇航员在模拟器里练习紧急对接。"}]},{"partOfSpeech":"n.","definition":{"en":"in science, attempts to fit one molecule to another (for example, a drug to a protein) using “docking” methods","zh":"（科学）分子对接：用“对接”方法尝试让一个分子与另一个分子匹配（如药物与蛋白质）"},"examples":[{"en":"The paper compared different dockings of the drug to the target protein.","zh":"论文比较了该药物与靶蛋白的不同对接结果。"}]},{"partOfSpeech":"v.","definition":{"en":"present participle form of “dock”: attaching or bringing something to a dock/station; sometimes used as a noun in informal writing","zh":"“dock”的现在分词形式：使……靠泊/对接/停靠；在非正式用法中也可作名词指“对接/靠泊这件事”"},"examples":[{"en":"They are docking the ferry at Gate 4.","zh":"他们正在把渡轮停靠在4号登船口。"}]}],"synonyms":["berthings","moorings","dockings (space: rendezvous and docking)","attachments"],"phonetic":"/ˈdɑkɪŋz/","extraExplanation":["“dockings”通常是名词复数，表示多次“靠泊/对接”。在航天语境里更常说“dockings”（多次对接）。","在生物/化学论文中，“dockings”常指多次计算或多种姿势（poses）的“分子对接结果”，属于专业用法。","词根 dock 原意与“码头/船坞”有关，所以在交通与航海语境中最直观；引申到航天“对接”也很常见。"]}
{"word":"dockization","summary":{"en":"“Dockerization” means turning an application into a Docker container so it runs reliably in different environments.","zh":"“Dockerization”（Docker 化）指把应用做成 Docker 容器，以便在不同环境中稳定一致地运行。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(tech) The process of packaging an application into a Docker container so it can run consistently across different computers or servers.","zh":"（科技）将应用程序打包成 Docker 容器的过程，使其能在不同电脑或服务器上更一致地运行。"},"examples":[{"en":"We finished the dockerization of the web app and deployed it to the cloud.","zh":"我们完成了这个网页应用的 Docker 化，并把它部署到云端。"},{"en":"Dockerization helps the team avoid “it works on my machine” problems.","zh":"Docker 化能帮助团队避免“我电脑上能跑”的问题。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) The state of an app or service being containerized and managed with Docker tools.","zh":"（非正式）指某个应用或服务已经被容器化，并使用 Docker 工具进行管理的状态。"},"examples":[{"en":"After dockerization, local setup became much simpler for new developers.","zh":"完成 Docker 化后，新开发者的本地环境搭建简单多了。"}]}],"synonyms":["containerization","containerizing","packaging into a container"],"phonetic":"/ˌdɑːkəraɪˈzeɪʃən/","extraExplanation":["“dockization”更常见是拼写错误，标准写法通常是“dockerization”。它来自产品名 Docker + 后缀 -ization（表示“……化/……的过程”）。","在招聘或技术文档里也常见同义表达：containerization（容器化）。但 containerization 更泛指各种容器技术；dockerization 特指用 Docker 来做。"]}
{"word":"dockize","summary":{"en":"“dockize” usually means “dockerize”: package an app to run in a Docker container.","zh":"“dockize”通常指“dockerize”：把应用打包成可在 Docker 容器中运行。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"(Commonly written as “dockerize”) to package an application so it can run inside a Docker container, usually by creating a Dockerfile and building an image.","zh":"（常写作“dockerize”）把应用打包成可在 Docker 容器中运行的形式，通常包括编写 Dockerfile 并构建镜像。"},"examples":[{"en":"We dockerized the web app so it runs the same on every server.","zh":"我们把这个 Web 应用 dockerize 了，这样它在每台服务器上运行都一致。"},{"en":"After you dockerize the project, deploying to the cloud becomes easier.","zh":"项目 dockerize 之后，部署到云端会更容易。"}]}],"synonyms":["dockerize","containerize","package into a container"],"phonetic":"/ˈdɑkəˌraɪz/","extraExplanation":["“dockize”并不是常见标准拼写；技术语境里更常见的是 **dockerize**（来自产品名 **Docker** + 后缀 **-ize**，表示“使……化/使成为……”）。","在工程沟通中，如果你看到“dockize”，通常可以把它理解为“dockerize”，但在正式文档、代码注释、简历中建议使用更通行的拼写 **dockerize** 以避免歧义。"]}
{"word":"dockland","summary":{"en":"A dockland is a city area with docks and port buildings, often an old waterfront that may be redeveloped.","zh":"dockland 指城市中的码头区/港口区，通常有码头与仓库，如今也常指改造后的旧港滨水区。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an area of a city where docks and warehouses are located, used for loading/unloading ships (often a redeveloped waterfront area today)","zh":"（城市的）码头区、港口仓储区；靠近码头和仓库的区域（如今也常指改造后的滨水区）"},"examples":[{"en":"Many old docklands have been turned into offices, apartments, and museums.","zh":"许多旧码头区已被改造成办公室、公寓和博物馆。"},{"en":"The dockland area was once full of cranes and cargo ships.","zh":"这片码头区曾经到处都是起重机和货船。"}]}],"synonyms":["docklands","the docks","port area","harbor area","waterfront"],"phonetic":"/ˈdɑkˌlænd/","extraExplanation":["“dockland(s)”在英式英语中更常见，常用复数“docklands”来指一整片港口相关区域。比如伦敦的“London Docklands”是很有名的城市更新案例：旧港区在20世纪后期逐步转型为金融、住宅与公共空间（如金丝雀码头 Canary Wharf 一带）。在美式英语里也能用，但更常见的近义说法是“the docks / the waterfront / the port area”。"]}
{"word":"Docklands","summary":{"en":"Docklands are areas around docks; today they’re often redeveloped waterfront districts. It can also be a proper place name (e.g., London Docklands).","zh":"Docklands 指码头周边的港区/仓储区，如今常被改建为滨水新区；也可作地名（如伦敦Docklands）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a waterfront area with docks (places where ships load and unload), often including warehouses and nearby industrial buildings; today many docklands are redeveloped into offices, housing, and entertainment areas","zh":"港区；码头区（船只装卸货的地方及其周边仓库、工业建筑；如今许多港区已改建为办公、住宅与休闲区）"},"examples":[{"en":"The city turned its old docklands into a lively waterfront with parks and restaurants.","zh":"这座城市把旧港区改造成热闹的滨水区，有公园和餐馆。"},{"en":"Many families moved into apartments built on the former docklands.","zh":"许多家庭搬进了建在旧码头区上的公寓。"}]},{"partOfSpeech":"n.","definition":{"en":"(often capitalized) a specific district named “Docklands,” such as London Docklands or Melbourne Docklands","zh":"（常大写）名为“Docklands”的特定地区，如伦敦Docklands或墨尔本Docklands"},"examples":[{"en":"She works in Docklands and commutes by train every day.","zh":"她在Docklands上班，每天坐火车通勤。"},{"en":"London Docklands changed dramatically after large redevelopment projects.","zh":"伦敦Docklands在大型改造项目后发生了巨大变化。"}]}],"synonyms":["dock area","harbor district","waterfront district","port area"],"phonetic":"ˈdɑkˌlændz","extraExplanation":["“Docklands”常让人联想到英国的 London Docklands：这里原本是繁忙的港口与仓储区，二战后及集装箱运输兴起后逐渐衰落；20世纪后期开始大规模更新改造，形成金融与商务区（如金丝雀码头 Canary Wharf）以及住宅与公共交通建设。","拼写与用法提示：当指“码头区/港区”这一类区域时可用小写 docklands；当指某个正式命名的地区（地名）时常用大写 Docklands。"]}
{"word":"docklands","summary":{"en":"Docklands refers to a city’s dock/port area, often a redeveloped waterfront district (e.g., London Docklands).","zh":"Docklands 指城市的港口码头区，常特指由旧港区改造而成的滨水新区（如伦敦 Docklands）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(often capitalized) The area of a city where docks and ports are located, especially a redeveloped waterfront district that used to be for shipping.","zh":"（常大写）城市中有码头与港口的区域；尤指由旧港口/货运区改造而成的滨水新区。"},"examples":[{"en":"London’s Docklands was once full of warehouses, but it’s now a modern business and residential area.","zh":"伦敦的Docklands过去到处是仓库，如今已成为现代化的商务与居住区。"},{"en":"They took a walk along the Docklands to see the river and the new buildings.","zh":"他们沿着Docklands散步，看河景和新建的楼群。"}]}],"synonyms":["dock area","port area","harbor district","waterfront district"],"phonetic":"/ˈdɑkˌlændz/","extraExplanation":["“Docklands”在英语里常见作地名或地区名称（例如 London Docklands、Melbourne Docklands）。作为普通名词时也可指“港区/码头区”，但现实中更常用于描述“旧港区再开发”的城市更新区域。","词形上虽然是复数形式（-s），但常当作一个整体地名来用：the Docklands is/are… 两种在实际语境中都能见到；以地名整体概念时更常用单数 is。"]}
{"word":"docklike","summary":{"en":"Docklike means resembling a dock, especially in shape or function.","zh":"docklike 指“像码头的”，尤指外形或用途相似。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a dock (a structure by the water where boats load/unload), especially in shape or function.","zh":"像码头的；具有码头特征的（尤指外形或用途像供船只停靠、装卸的设施）。"},"examples":[{"en":"The building’s long, flat platform gave it a docklike appearance.","zh":"那栋建筑又长又平的平台让它看起来很像码头。"},{"en":"They built a docklike walkway so kayaks could pull up easily.","zh":"他们建了一条类似码头的栈道，方便皮划艇靠岸。"}]}],"synonyms":["dock-shaped","pierlike","wharf-like","harborlike"],"phonetic":"/ˈdɑkˌlaɪk/","extraExplanation":["“docklike”由名词 dock（码头/船坞）+ 后缀 -like（“像……一样的”）构成，常用于描述“外形、结构或用途”与码头相似的事物。","注意 dock 也可指（动物的）尾巴或（给马/狗）剪尾，但“docklike”在一般语境下最常见的是“像码头的”这一含义。"]}
{"word":"dockmackie","summary":{"en":"“dockmackie” is most likely a name/handle rather than a common English word.","zh":"“dockmackie”更可能是名字/账号名，而不是常见英文词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English dictionary word. It most likely functions as a proper name (a surname, place name, brand, or username) made from “dock” + “Mackie.”","zh":"不是标准英语词典词汇。更可能是专有名词（姓氏、地名、品牌或用户名），由“dock”与“Mackie”组合而成。"},"examples":[{"en":"The email address uses “dockmackie” as a username.","zh":"这个邮箱地址把“dockmackie”用作用户名。"},{"en":"I couldn’t find “dockmackie” in a dictionary; it may be someone’s name.","zh":"我在词典里找不到“dockmackie”；它可能是人名。"}]}],"synonyms":["(none—proper name/username)"],"phonetic":"/ˌdɑkˈmæki/","extraExplanation":["“dock”在英语里常见意思包括：①码头/船坞（名词）；②停靠、使船靠岸（动词）；③（英式法庭用语）被告席（名词）。","“Mackie”常见为姓氏（如人物名、品牌名等）。如果你告诉我它出现的句子/上下文（例如一段对话、文章或网站），我可以更准确判断它指的是什么。"]}
{"word":"dockman","summary":{"en":"A dockman is a man who works at a dock, often loading/unloading ships or helping manage cargo.","zh":"dockman 指在码头工作的男性工人，常从事船舶装卸或货物相关工作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a man who works on a dock (the area by a harbor/river where ships load and unload), often handling cargo or helping with ship operations","zh":"码头工人（在港口/河边的码头工作的人，常负责装卸货物或协助船只作业）"},"examples":[{"en":"The dockman helped unload crates from the ship.","zh":"码头工人帮忙把箱子从船上卸下来。"},{"en":"After the storm, the dockmen worked all night to secure the boats.","zh":"暴风雨过后，码头工人整夜加固船只。"}]}],"synonyms":["dockworker","dockhand","stevedore","longshoreman"],"phonetic":"/ˈdɑk.mən/","extraExplanation":["“dockman”比较传统，也带有性别含义；现代更常用更中性的说法如 “dockworker” 或 “dockhand”。","相关职业词：stevedore（装卸工，尤指专门装卸船货的人），longshoreman（美国英语中常指港口装卸工；在一些语境下与 dockworker 接近）。"]}
{"word":"dockmaster","summary":{"en":"A dockmaster manages dock operations and assigns berths for ships.","zh":"dockmaster 指负责码头运营并为船只分配泊位的管理人员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person in charge of a dock or harbor area, responsible for managing berths (where ships tie up), supervising loading/unloading, and coordinating dock operations.","zh":"码头主管；负责管理码头/港区的人，安排船只靠泊、监督装卸并协调码头运作。"},"examples":[{"en":"The dockmaster assigned our ship a berth near the warehouse.","zh":"码头主管把我们的船安排在仓库旁边的泊位。"},{"en":"If you need to refuel or unload cargo, check in with the dockmaster first.","zh":"如果你需要加油或卸货，先去找码头主管报到。"}]}],"synonyms":["harbormaster","wharfinger","port officer"],"phonetic":"/ˈdɑkˌmæs.tɚ/","extraExplanation":["在英文港口语境里，dockmaster 常见于商港、游艇码头（marina）或渡轮码头等场景，工作内容通常包括：分配泊位、协调拖船/引航、管理码头安全与通行、处理进出港手续等。不同地区也可能用 harbormaster（港务长/港口主管）表示更偏“整个港口”层级的管理者。"]}
{"word":"docks","summary":{"en":"“Docks” most often means harbor dock areas (piers/wharves). It can also be the verb “docks” (reduces pay/points, or a ship/spacecraft arrives and connects).","zh":"“docks”最常指港口的码头区域（栈桥/码头一带）。也可作动词“docks”（扣工资/扣分，或船只停靠、航天器对接）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural noun) Areas at a harbor where ships load/unload goods or where boats are kept; the piers/wharves and the waters beside them.","zh":"（复数名词）港口中船只装卸货物或停泊的区域；包括码头/栈桥及其旁边水域。"},"examples":[{"en":"The fishermen returned to the docks before sunset.","zh":"渔民在日落前回到了码头。"},{"en":"Security cameras watch the docks at night.","zh":"夜里监控摄像头会监视码头区域。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb, third-person singular) To reduce or take away part of someone’s pay/points as a penalty.","zh":"（动词第三人称单数）因惩罚而扣减工资/分数等。"},"examples":[{"en":"The company docks his pay for repeated lateness.","zh":"公司因他多次迟到而扣他的工资。"},{"en":"Some teachers dock points for missing citations.","zh":"有些老师会因为缺少引用而扣分。"}]},{"partOfSpeech":"v.","definition":{"en":"(verb, third-person singular) To bring a ship or spacecraft to a dock, pier, or another vehicle and connect/park it there.","zh":"（动词第三人称单数）使船靠岸/停泊；使航天器与空间站等对接。"},"examples":[{"en":"The ferry docks at Pier 7 every hour.","zh":"渡轮每小时在7号码头停靠一次。"},{"en":"The capsule docks with the space station automatically.","zh":"返回舱会自动与空间站对接。"}]},{"partOfSpeech":"n.","definition":{"en":"(plural noun) Dock plants (a common name for certain leafy plants, often considered weeds).","zh":"（复数名词）酸模/羊蹄等“dock”植物（常见的植物俗名，有时被当作杂草）。"},"examples":[{"en":"Wild docks grow along the edge of the field.","zh":"野生的酸模长在田地边上。"}]}],"synonyms":["piers","wharves","harbor area","berths","moors"],"phonetic":"/dɑks/","extraExplanation":["“the docks”常指“港口码头一带（工作区/装卸区）”，比单说“a dock”更有“整片码头区域”的感觉。","动词“dock”表示“扣（工资/分数）”在职场和学校里很常见，语气偏正式；口语里也会说“take money off”或“mark down（扣分）”。","与“dock”相关的近义词小区别：pier（伸入水中的栈桥/码头）、wharf（供船靠泊装卸的码头，常偏商业/货运）、harbor/port（更大的“港口/港湾”概念）。"]}
{"word":"dockside","summary":{"en":"“Dockside” means at/near a dock, or the dock area itself by the water.","zh":"“dockside”指“在码头边/靠近码头的”，也可指“码头边那一带区域”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"At or near a dock (the area by the water where ships load and unload).","zh":"在码头边；靠近码头的（船只装卸货物的临水区域）。"},"examples":[{"en":"We had dinner at a dockside restaurant and watched the boats.","zh":"我们在码头边的餐馆吃晚饭，还看着船只来来往往。"},{"en":"Dockside workers were unloading boxes from the ship.","zh":"码头工人正在从船上卸下箱子。"}]},{"partOfSpeech":"n.","definition":{"en":"The area by the docks; the waterfront near where ships are tied up.","zh":"码头边的区域；靠泊船只的滨水地带。"},"examples":[{"en":"The dockside was crowded with tourists and street vendors.","zh":"码头边挤满了游客和街头小贩。"},{"en":"Police set up a barrier along the dockside.","zh":"警方在码头边设置了隔离带。"}]}],"synonyms":["waterfront","waterside","harborside","quayside"],"phonetic":"/ˈdɑk.saɪd/","extraExplanation":["“dockside”常用于港口城市语境，既可描述地点（dockside café/warehouse），也可指港口的那一带区域。英式与美式英语都常见；更正式或更常见的近义表达还有“waterside / waterfront”（但不一定强调“码头装卸区”的功能）。","在文学或影视中，“dockside”常营造一种海港氛围：咸湿的海风、汽笛声、装卸货物的忙碌与旅人出发/归来的场景。"]}
{"word":"docksides","summary":{"en":"“Docksides” can mean areas next to docks, or (often capitalized) a classic boat-shoe style.","zh":"“docksides”既可指“码头边/港口边的区域”，也可指（常大写）经典的船鞋/帆船鞋款式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the area next to a dock (the waterfront beside where ships or boats are tied up); plural form of “dockside”","zh":"码头旁边的区域（船只停靠的水边）；“dockside”的复数"},"examples":[{"en":"The docksides were crowded with workers unloading containers.","zh":"码头边挤满了正在卸货的工人。"},{"en":"We walked along the docksides to watch the fishing boats return.","zh":"我们沿着码头边散步，看渔船返航。"}]},{"partOfSpeech":"n.","definition":{"en":"(often capitalized) a type of casual leather boat shoe, associated with “Dockside(s)” style","zh":"（常写作大写）一种休闲皮质船鞋/帆船鞋，常被称为“Dockside(s)”风格"},"examples":[{"en":"He wore Docksides with chinos for a relaxed weekend look.","zh":"他穿着Docksides配卡其裤，周末风格很轻松。"},{"en":"These docksides are comfortable and work well in warm weather.","zh":"这双docksides很舒服，适合暖和的天气穿。"}]}],"synonyms":["waterfront","wharfside","harbor area","quayside","boat shoes"],"phonetic":"/ˈdɑkˌsaɪd/","extraExplanation":["“dockside”字面意思是“码头的一侧/旁边”，常用于描写港口、海运、渔业等场景。复数“docksides”多指多个码头区域。","“Docksides”也常被用来指一种“帆船鞋/船鞋”款式（如Sperry等品牌的经典鞋型），在美国常与preppy（学院风）或海边休闲穿搭联系在一起。"]}
{"word":"dockwork","summary":{"en":"Dockwork means the manual and logistical work done at docks, especially loading, unloading, and handling cargo.","zh":"dockwork 指在码头进行的工作，尤其是装卸与处理货物等港口作业。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Work done at a dock/harbor, especially loading and unloading ships and handling cargo.","zh":"码头工作；（尤指）在港口装卸船货、搬运与处理货物的工作。"},"examples":[{"en":"He found steady dockwork at the port after finishing school.","zh":"他毕业后在港口找到了一份稳定的码头工作。"},{"en":"Dockwork can be physically demanding and often starts very early in the morning.","zh":"码头工作体力消耗很大，而且常常一大早就开始。"},{"en":"A strike brought much of the dockwork to a halt, delaying shipments.","zh":"罢工使许多码头工作停摆，导致货运延误。"}]}],"synonyms":["dock work","longshore work","stevedoring","cargo handling","port work"],"phonetic":"/ˈdɑkˌwɝk/","extraExplanation":["“dockwork”常见于英式英语语境，也可写作“dock work”。在美式英语里更常说“longshore work / longshoring”，而负责装卸的工人叫“longshoreman”（或更中性地说“dockworker / longshore worker”）。","历史上码头工人群体与工会运动关系密切，所以在新闻或纪实作品中，“dockwork”有时会与“strike（罢工）”“labor union（工会）”“shipment（货运）”等词一起出现。"]}
{"word":"dockworker","summary":{"en":"A dockworker is someone who works at a port, especially loading and unloading ships and cargo.","zh":"dockworker 指在港口/码头工作的人，尤指装卸船货、处理货物的码头工人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who works at a dock or port, especially loading and unloading ships and handling cargo","zh":"码头工人；港口工人（尤指装卸货物、处理船运货物的人）"},"examples":[{"en":"Dockworkers unloaded containers from the ship all night.","zh":"码头工人整晚都在从船上卸下集装箱。"},{"en":"The port hired more dockworkers during the busy season.","zh":"在繁忙季节，港口雇用了更多码头工人。"},{"en":"A strike by dockworkers delayed deliveries to several cities.","zh":"码头工人罢工导致多个城市的货物配送延误。"}]}],"synonyms":["longshoreman","stevedore","port worker"],"phonetic":"ˈdɑkˌwɝkɚ","extraExplanation":["在美式英语里，dockworker 常与 longshoreman（码头装卸工）意思接近；longshoreman 更偏传统/行业用语，常出现在工会、劳资谈判或新闻报道中。","由于码头工作常与工会（union）和罢工（strike）等社会议题相关，新闻里出现 dockworkers 时，往往在谈港口运力、供应链（supply chain）或劳资争议。"]}
{"word":"dockworkers","summary":{"en":"Dockworkers are people whose job is to load and unload cargo at a dock or port.","zh":"Dockworkers 指在港口或码头从事货物装卸与搬运工作的工人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"People who load, unload, and handle cargo at a dock or port; people whose job is to work on the waterfront moving goods.","zh":"码头工人；在港口/码头装卸、搬运和处理货物的工人。"},"examples":[{"en":"The dockworkers unloaded the containers from the ship before sunrise.","zh":"码头工人在日出前把集装箱从船上卸下来。"},{"en":"Dockworkers went on strike to demand safer working conditions.","zh":"码头工人举行罢工，要求更安全的工作环境。"},{"en":"During the holiday rush, ports hired extra dockworkers to speed up deliveries.","zh":"节日旺季时，港口雇了更多码头工人来加快配送。"}]}],"synonyms":["dockhands","longshore workers","stevedores","port workers"],"phonetic":"/ˈdɑkˌwɝkɚz/","extraExplanation":["“dockworkers”是复数形式，单数是“dockworker”。在新闻里也常见更正式的说法“longshore workers / longshoremen（码头装卸工）”。","在一些国家/地区，码头工人常由工会组织（如美国的ILWU、ILA等），因此在劳资谈判、罢工、港口供应链新闻中经常出现这个词。"]}
{"word":"dockyard","summary":{"en":"A dockyard is a place where ships are built and repaired, often a large shipyard with docks.","zh":"dockyard 指建造与维修船只的场所，常为带船坞设施的大型造船厂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place (usually by the sea or a river) where ships are built, repaired, and maintained; a shipyard, often with docks and workshops","zh":"造船厂；船坞（通常靠海或河边，用于建造、维修和保养船只的地方，常包含码头与车间）"},"examples":[{"en":"The navy sent the damaged ship back to the dockyard for repairs.","zh":"海军把受损的军舰送回船坞进行维修。"},{"en":"He works in a dockyard, checking equipment and safety procedures.","zh":"他在造船厂工作，负责检查设备和安全流程。"},{"en":"The old dockyard has been turned into a museum and shopping area.","zh":"那座老船坞被改造成了博物馆和购物区。"}]}],"synonyms":["shipyard","naval yard","boatyard"],"phonetic":"/ˈdɑkˌjɑrd/","extraExplanation":["“dockyard”在英式英语里较常见，尤其用于指海军或大型港口的船舶建造与维修基地；美式英语更常说“shipyard”。","构词上是 dock（船坞/码头）+ yard（场地/工场），所以它强调“有船坞设施的作业场”。"]}
{"word":"dockyardman","summary":{"en":"A dockyardman is a person who works in a dockyard/shipyard, typically on shipbuilding or ship repair.","zh":"dockyardman 指在船坞/造船厂工作的工人，常与造船或修船有关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A worker employed at a dockyard (a shipyard), especially one involved in building, repairing, or maintaining ships and related equipment.","zh":"在船坞/造船厂（尤其是海军船坞）工作的工人，通常从事造船、修船或维护船舶及相关设备。"},"examples":[{"en":"My grandfather was a dockyardman who repaired naval ships during the war.","zh":"我祖父曾是船坞工人，在战争期间维修海军舰船。"},{"en":"The dockyardmen worked long shifts to finish the ship’s repairs on time.","zh":"船坞工人加班加点，按时完成船只维修。"}]}],"synonyms":["dockyard worker","shipyard worker","shipwright","yard worker"],"phonetic":"/ˈdɑkˌjɑrdˌmæn/","extraExplanation":["“dockyardman”在现代日常英语中不算常见，更常见的说法有“dockyard worker”“shipyard worker”“shipwright（造船工/船匠）”。在英国英语和与海军相关的语境中更容易见到“dockyard”这个词。"]}
{"word":"dockyards","summary":{"en":"Dockyards are port areas with facilities for building and repairing ships.","zh":"Dockyards 指港口中用于建造和修理船只等作业的船坞区/造船厂。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"large areas by the water where ships are built, repaired, loaded, or maintained; the shipbuilding/ship-repair facilities of a port","zh":"船坞区；造船厂（靠水的大型区域，用于建造、修理、装卸或维护船只的港口设施）"},"examples":[{"en":"The city’s dockyards used to employ thousands of shipbuilders.","zh":"这座城市的造船厂过去雇用了成千上万的造船工人。"},{"en":"After the storm, several boats were taken to the dockyards for repairs.","zh":"暴风雨过后，有几艘船被送到船坞区维修。"},{"en":"Tourists can walk along the old dockyards and learn about the port’s history.","zh":"游客可以沿着旧船坞区散步，了解这座港口的历史。"}]}],"synonyms":["shipyards","boatyards","harbors","ports"],"phonetic":"/ˈdɑkˌjɑrdz/","extraExplanation":["“dockyard”在英式英语里很常见，常指港口里与造船、军舰维护相关的设施与区域；在美式英语中也用，但有时更常见的说法是“shipyard”（造船厂）。","历史上英国有著名的“Royal Dockyards（皇家船坞）”，与海军发展、殖民贸易和工业革命密切相关，因此在历史题材小说或纪录片里常出现。"]}
{"word":"docmac","summary":{"en":"“docmac” is usually a name/handle; it isn’t a common dictionary word. Meaning depends on context (Doc + Mac, or document + Mac).","zh":"“docmac”通常是名字/网名，并非常见词典词。含义取决于语境（Doc+Mac，或 document+Mac）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English dictionary word. It is most often seen as a name, nickname, username, or brand (e.g., “Doc Mac” = a doctor or teacher with the surname Mac/Mc…, or a handle like “docmac”).","zh":"不是标准英语词典词。它最常见于人名、昵称、用户名或品牌（例如“Doc Mac”可指姓 Mac/Mc… 的医生/老师，或网名“docmac”）。"},"examples":[{"en":"Ask DocMac if he can look at my knee pain this week.","zh":"问问 DocMac 这周能不能帮我看看膝盖疼。"},{"en":"My username on the forum is docmac.","zh":"我在论坛上的用户名是 docmac。"}]},{"partOfSpeech":"other","definition":{"en":"(In some contexts) a shortened label meaning “document on Mac” or “Mac document,” used informally in notes, file names, or tech chats.","zh":"（在某些语境中）可能是“Mac 上的文档 / Mac 文档”的简写，用在随手笔记、文件名或技术聊天里。"},"examples":[{"en":"Save it as docmac_final.pdf so we know it’s the Mac version.","zh":"把它存成 docmac_final.pdf，这样我们知道这是 Mac 版本。"}]}],"synonyms":["Doc Mac","doc-mac"],"phonetic":"/ˈdɑkˌmæk/","extraExplanation":["“Doc”在英语里常作口语缩写，来自 doctor（医生/博士），也可指“某个领域很懂的人”。“Mac”常见于姓氏（Mac/Mc 开头的苏格兰、爱尔兰姓），也常指苹果电脑 Mac。具体含义高度依赖你看到它的场景。"]}
{"word":"Docoglossa","summary":{"en":"Docoglossa is an older zoological term for a group of limpets defined by a particular radula (scraping “tongue”) type.","zh":"Docoglossa 是一种较旧的动物学术语，指按特定“齿舌（刮食舌）类型”划分的一类帽贝等软体动物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Zoology) A former taxonomic group (or the limpets within it) characterized by a “docoglossan” radula (a particular tongue-like scraping organ used for feeding).","zh":"（动物学）一种旧式分类名称（或指其中的帽贝类群），其特征是具有“docoglossan 型齿舌”（一种用于刮食的舌状器官）。"},"examples":[{"en":"In older malacology texts, some limpets were placed in Docoglossa based on their radula type.","zh":"在较早的软体动物学文献中，一些帽贝会因齿舌类型而被归入 Docoglossa。"},{"en":"The paper compares docoglossan and rhipidoglossan radulae to discuss how different snails feed.","zh":"这篇论文比较了 docoglossan 与 rhipidoglossan 型齿舌，以讨论不同螺类的取食方式。"}]}],"synonyms":["docoglossans","docoglossan limpets"],"phonetic":"/ˌdoʊkəˈɡlɑsə/","extraExplanation":["这是一个偏“历史用法/专业用语”的词，多见于软体动物学（尤其是帽贝、海螺等）和“齿舌（radula）形态”相关讨论。现代分类体系中更常用更新的分组名称，但在阅读老教材或比较齿舌类型时仍可能遇到。","词源上常被解释为来自希腊语词根，glossa 表示“舌”（对应齿舌的形象比喻）；整体含义与“某种舌/齿舌类型”相关。"]}
{"word":"docoglossa","summary":{"en":"Docoglossa is a zoological term (often used in older taxonomy) for certain limpets/primitive marine snails defined by a particular type of radula (tongue-like feeding organ).","zh":"Docoglossa 是一个动物学术语（多见于较旧分类），指一些以特定“齿舌”类型为特征的帽贝/原始海洋腹足类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a scientific term for a group of primitive marine gastropods (often “true limpets”) characterized by a distinctive rasping tongue (radula) type called a docoglossan radula.","zh":"一个科学术语，指一类较原始的海洋腹足类（常指“真正的帽贝/真帽贝类”），其特征是具有一种特殊类型的齿舌（radula），称为“梁舌型/Docoglossan”齿舌。"},"examples":[{"en":"In some older classifications, true limpets were placed in Docoglossa because of their radula structure.","zh":"在一些较早的分类体系中，真帽贝类因为齿舌结构而被归入 Docoglossa。"},{"en":"The paper compares feeding marks made by docoglossan limpets on algae-covered rocks.","zh":"这篇论文比较了梁舌型帽贝在覆藻岩石上取食留下的痕迹。"}]}],"synonyms":["docoglossans","true limpets","Patellogastropoda (modern classification, related)"],"phonetic":"ˌdoʊkəˈɡlɔsə","extraExplanation":["这是一个偏旧的分类名称，现代分类更常用“Patellogastropoda（帽贝总目/帽贝类）”等更细化、基于系统发育的分类。你在较老的动物学教材或文献中更容易看到 Docoglossa。","词源上常被解释为来自希腊语 glossa（“舌头”），用来指腹足类的“齿舌（radula）”；该类群名称与其齿舌上牙齿排列形态有关。"]}
{"word":"docoglossan","summary":{"en":"A rare zoological term for something related to (or a member of) the docoglossate group of marine snails, such as limpets.","zh":"一个较少见的动物学术语，指与盾舌类（Docoglossa）海生腹足动物（如帽贝）有关的，或指其成员。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Zoology) Relating to the Docoglossa (also called docoglossate gastropods), a group of marine snails such as limpets.","zh":"（动物学）与“舌齿目/盾舌类（Docoglossa）”有关的；指一类海生腹足类软体动物（如帽贝等）。"},"examples":[{"en":"Some limpets are described in older books as docoglossan gastropods.","zh":"在较旧的书里，一些帽贝会被描述为 docoglossan（盾舌类的）腹足动物。"},{"en":"The paper compares docoglossan feeding structures with those of other snails.","zh":"这篇论文把 docoglossan（盾舌类）的摄食结构与其他蜗牛作比较。"}]},{"partOfSpeech":"n.","definition":{"en":"A docoglossan animal; a member of the Docoglossa (e.g., certain limpets).","zh":"盾舌类动物；舌齿目（Docoglossa）的成员（如某些帽贝）。"},"examples":[{"en":"In that classification, the docoglossans are discussed before the other gastropods.","zh":"在那种分类法中，docoglossans（盾舌类）会先于其他腹足类被讨论。"}]}],"synonyms":["docoglossate","patellid (in some contexts)","limpet (broader/common)"],"phonetic":"/ˌdoʊkəˈɡlɑːsən/","extraExplanation":["这是一个相当冷僻、偏“旧式分类学”的术语，常见于19—20世纪早期的动物学/贝类学资料。现代文献里更常见的说法可能会直接用“limpets（帽贝）”或使用更新的分类框架（因为分类会随研究而调整）。","词源上可拆作 doco-（与“梁/条状”相关的希腊语词根）+ glossa（“舌头”）。它和齿舌（radula，软体动物用来刮食的“舌状齿带”）的形态研究有关，因此多出现于解剖结构或进化比较的语境。"]}
{"word":"docoglossans","summary":{"en":"Docoglossans are marine mollusks (often limpets) traditionally grouped together for their distinctive scraping radula.","zh":"Docoglossans 指传统分类中一类海洋软体动物（常指帽贝等），以其独特的刮食用齿舌为特征。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a member of a group of marine mollusks (especially limpets) traditionally classified in the order Docoglossa, known for having a distinctive scraping tongue (radula).","zh":"（传统分类中）属于“舌齿目（Docoglossa）”的一类海洋软体动物成员（尤指帽贝/匙贝类），以其用于刮食的特殊“齿舌（radula）”而闻名。"},"examples":[{"en":"Some docoglossans use a tough radula to scrape algae off rocks.","zh":"一些舌齿目动物会用坚韧的齿舌把岩石上的藻类刮下来。"},{"en":"Limpets are often discussed as classic examples of docoglossans in older textbooks.","zh":"在较早的教材里，帽贝常被当作舌齿目动物的典型例子来讨论。"}]}],"synonyms":["docoglossans (plural)","limpets (related, not exact)"],"phonetic":"/ˌdoʊkəˈɡlɑsənz/","extraExplanation":["“docoglossans”是复数形式，单数是“docoglossan”。这个词在现代生物分类中较少用，因为分类体系有调整；你可能会在旧版动物学/软体动物学资料里见到。","词源可拆为 doco-（与“梁/横木”之类的形状意象有关）+ -glossan（与“舌”相关，源自希腊语 glōssa/glōtta“舌头”），指它们的“齿舌”形态特征。"]}
{"word":"docoglossate","summary":{"en":"Docoglossate is a rare zoology term meaning “having a docoglossan (limpet-type) radula; related to Docoglossa.”","zh":"Docoglossate 是一个罕见的动物学词，指“具有盾舌型（帽贝类）齿舌的；与盾舌类相关的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Zoology) Having a “docoglossan” radula (a type of tooth-bearing tongue) typical of limpets; relating to the group Docoglossa/Patellogastropoda.","zh":"（动物学）具有“盾舌型/盾舌类（docoglossan）齿舌”（一种带齿的舌状器官，典型见于帽贝等）的；与盾舌类（Docoglossa/Patellogastropoda）相关的。"},"examples":[{"en":"Some limpets are described as docoglossate because of their distinctive radula.","zh":"一些帽贝因其独特的齿舌而被描述为 docoglossate（盾舌型）。"},{"en":"In older zoology texts, docoglossate species are contrasted with rhipidoglossate species.","zh":"在较早的动物学文献中，docoglossate（盾舌型）物种常与 rhipidoglossate（扇舌型）物种作对比。"}]}],"synonyms":["docoglossan","limpet-type (context)"],"phonetic":"/ˌdɑːkoʊˈɡlɔːseɪt/","extraExplanation":["词源提示：docoglossate 来自希腊语词根，gloss- 表示“舌”。它多见于分类学或形态学描述，尤其讨论软体动物（腹足纲）“齿舌（radula）”的类型。日常英语中几乎不会用到。","相关词：docoglossan（更常见的对应形容词/名词，用来指“盾舌型的；盾舌类个体”）。"]}
{"word":"docosane","summary":{"en":"Docosane is a 22-carbon alkane (C₂₂H₄₆), a waxy hydrocarbon found in petroleum and waxes.","zh":"Docosane（二十二烷）是含22个碳的烷烃（C₂₂H₄₆），一种常见于石油与蜡中的蜡状烃类。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a waxy hydrocarbon (an alkane) with 22 carbon atoms (chemical formula: C₂₂H₄₆), found in some petroleum products and natural waxes","zh":"二十二烷：一种含有22个碳原子的烷烃（化学式：C₂₂H₄₆），常见于部分石油产品与天然蜡中，质地偏蜡状"},"examples":[{"en":"Docosane is an alkane with 22 carbon atoms.","zh":"二十二烷是一种含有22个碳原子的烷烃。"},{"en":"In the lab, docosane can be used as a reference compound in chromatography.","zh":"在实验室里，二十二烷可用作色谱分析中的参比化合物。"},{"en":"At room temperature, docosane is typically a solid because it has a long carbon chain.","zh":"在室温下，二十二烷通常为固体，因为它的碳链较长。"}]}],"synonyms":["n-docosane","C22H46","n-paraffin (C22)"],"phonetic":"/ˈdoʊkəˌseɪn/","extraExplanation":["“docos-”来自希腊语，表示“二十二”；后缀“-ane”表示“烷烃”（只含单键的饱和烃）。因此 docosane 直译就是“二十二碳的烷烃”。","在有机化学命名中，它也可写作 n-docosane（强调“直链/正构”，不是支链异构体）。"]}
{"word":"docosanoate","summary":{"en":"A chemical term for a salt or ester made from docosanoic (behenic) acid.","zh":"化学术语：二十二烷酸（山嵛酸）的盐或酯。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a salt or ester of docosanoic acid (behenic acid), a 22‑carbon saturated fatty acid.","zh":"二十二烷酸（山嵛酸）的盐或酯；指由这种22个碳的饱和脂肪酸形成的化合物。"},"examples":[{"en":"In the lab report, the product was identified as a docosanoate ester.","zh":"在实验报告中，该产物被鉴定为一种二十二烷酸酯（docosanoate ester）。"},{"en":"Some cosmetics use long‑chain fatty acid derivatives such as docosanoate to change texture.","zh":"一些化妆品会使用像二十二烷酸盐/酯这类长链脂肪酸衍生物来改变质地。"}]}],"synonyms":["behenate","docosanoic acid ester","docosanoic acid salt"],"phonetic":"/ˌdoʊkəˈsænoʊ.eɪt/","extraExplanation":["“docos-”表示“22”（源自希腊语），“-anoate”常用于命名脂肪酸的盐或酯（相当于“……酸根/……酸酯”）。因此 docosanoate 字面意思就是“二十二烷酸的盐或酯”。","在成分表或化学文献中，你也可能看到更常见的同义形式 behenate（山嵛酸盐/酯），因为 docosanoic acid 也叫 behenic acid。"]}
{"word":"docosanoic","summary":{"en":"Docosanoic means “related to behenic acid,” a 22-carbon saturated fatty acid.","zh":"docosanoic 指“与山嵛酸（二十二烷酸）有关的”，它是一种含22个碳的饱和脂肪酸。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to docosanoic acid (behenic acid), a saturated fatty acid with 22 carbon atoms.","zh":"与二十二烷酸（山嵛酸，一种含22个碳原子的饱和脂肪酸）有关的。"},"examples":[{"en":"Docosanoic acid is found in small amounts in peanut oil.","zh":"二十二烷酸在花生油中含量很少。"},{"en":"Some cosmetics use docosanoic derivatives to improve texture.","zh":"一些化妆品会使用二十二烷酸的衍生物来改善质地。"}]}],"synonyms":["behenic (in “behenic acid”)","C22:0 (nutrition shorthand)"],"phonetic":"/ˌdoʊkəˈsænoʊɪk/","extraExplanation":["“docos-”来自化学命名，表示“22”（二十二个碳）；“-anoic”表示来自烷烃（alkane）的羧酸（carboxylic acid）。因此 docosanoic 指“22碳的饱和羧酸”。","在日常英语中更常见的叫法是 behenic acid（山嵛酸）。你也可能在营养或护肤成分表里见到它的盐或酯类（derivatives）。"]}
{"word":"docosapentaenoic","summary":{"en":"Docosapentaenoic means “related to DPA,” a 22-carbon fatty acid with five double bonds (an omega-3 in nutrition contexts).","zh":"docosapentaenoic 指“与DPA（二十二碳五烯酸）有关的”，即一种22个碳、5个双键的脂肪酸（营养学中常归为Ω-3）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to a fatty acid that has 22 carbon atoms and five double bonds (often abbreviated as DPA), found in some fish oils and in the human body.","zh":"（化学/营养）二十二碳五烯酸的；指一种含22个碳原子、5个双键的脂肪酸（常缩写为DPA），存在于某些鱼油中，也可在人体内发现。"},"examples":[{"en":"Docosapentaenoic acid (DPA) is an omega-3 fatty acid found in some seafood.","zh":"二十二碳五烯酸（DPA）是一种存在于某些海产品中的Ω-3脂肪酸。"},{"en":"The study compared levels of docosapentaenoic acid in blood samples before and after supplementation.","zh":"这项研究比较了补充前后血样中二十二碳五烯酸的水平。"}]}],"synonyms":["DPA-related","of docosapentaenoic acid"],"phonetic":"/ˌdoʊˌkoʊsəˌpɛn.tə.ɪˈnoʊ.ɪk/","extraExplanation":["“docosa-”常表示“22个碳原子”（源自化学命名习惯）；“penta-”表示“五”；“-enoic”表示“含双键的不饱和羧酸”。所以这个词从结构上就能读出“22碳、5个双键的脂肪酸”。","营养学里常见的相关缩写：DPA（docosapentaenoic acid，二十二碳五烯酸）、DHA（二十二碳六烯酸）、EPA（二十碳五烯酸）。日常语境中更常看到“DPA”而不是完整形容词“docosapentaenoic”。"]}
{"word":"docquet","summary":{"en":"Docquet is an archaic spelling of “docket,” meaning a brief label/summary attached to a document (and, less commonly, the verb ‘to label or docket’).","zh":"Docquet 是 “docket” 的古老拼写，指附在文件上的简短标签/摘要（较少也作动词，表示加注摘要或登记）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Archaic spelling of “docket”) a brief written note or label attached to a document, summarizing what it is about (often used in legal or official contexts).","zh":"（“docket”的古老拼写）附在文件上的简短说明或标签，用来概括文件内容（常见于法律或公文语境）。"},"examples":[{"en":"The clerk tied a small docquet to the bundle of papers to show the case number.","zh":"书记员在那捆文件上系了一张小签条（docquet），标明案件编号。"},{"en":"Please add a docquet stating the date and subject of the letter.","zh":"请加一张docquet，注明这封信的日期和主题。"}]},{"partOfSpeech":"vt.","definition":{"en":"(Archaic) to add a brief summary or label to a document; to docket.","zh":"（古义）给文件加上简要摘要或标签；把……登记在案。"},"examples":[{"en":"The letters were docqueted and filed in chronological order.","zh":"这些信件被加注摘要（docqueted）后按时间顺序归档。"},{"en":"The court docqueted the complaint for review.","zh":"法院将起诉书登记并加注要点以便审阅。"}]}],"synonyms":["docket","label","tag","note","endorsement","filing note"],"phonetic":"/ˈdɑkɪt/","extraExplanation":["“docquet”主要见于旧式英式法律/行政文书，是“docket”的变体拼写。现代英语里几乎都写作“docket”。","词源上与“document（文件）”相关的用法环境很接近：用于给文件做“简要说明/登记”，方便查找与管理。"]}
{"word":"DOCS","summary":{"en":"“Docs” is an informal plural meaning either documents or doctors, depending on context.","zh":"“docs”是非正式复数，可指“文件/资料”或“医生”，具体看上下文。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"documents (informal): written or digital papers that give information or proof","zh":"文件；资料（非正式）：提供信息或证明的纸质或电子材料"},"examples":[{"en":"Please upload the docs before the deadline.","zh":"请在截止日期前上传文件。"},{"en":"I saved all the project docs in a shared folder.","zh":"我把所有项目资料都保存在共享文件夹里。"}]},{"partOfSpeech":"n.","definition":{"en":"doctors (informal): medical doctors, especially when speaking casually","zh":"医生（非正式）：口语里对医生的称呼"},"examples":[{"en":"The docs say you should get more rest.","zh":"医生说你应该多休息。"},{"en":"Ask the docs if this medicine has side effects.","zh":"问问医生这种药有没有副作用。"}]}],"synonyms":["documents","papers","files","paperwork","doctors","physicians"],"phonetic":"/dɑks/","extraExplanation":["“docs”常见于工作/网络语境，是“documents”的缩写（比如Google Docs里的“Docs”也指文档工具）。在医疗语境里，“the docs”可能指“医生们”。判断含义通常看上下文：和“upload / file / folder / paperwork”搭配多半是“文件”；和“hospital / clinic / medicine / diagnosis”搭配多半是“医生”。"]}
{"word":"Docs","summary":{"en":"“Docs” usually means documents or documentation; informally it can also mean doctors.","zh":"“Docs”通常指文件或（软件/产品）文档；口语中也可指医生们。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Documents; written or digital papers that give information, proof, or instructions.","zh":"（复数）文件；用于提供信息、证明或说明的纸质或电子资料。"},"examples":[{"en":"Please upload the required docs before Friday.","zh":"请在周五前上传所需文件。"},{"en":"Keep your travel docs in a safe place.","zh":"把你的旅行证件放在安全的地方。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) Documentation: written instructions or reference materials for a product, system, or software.","zh":"（非正式）文档/说明书：产品、系统或软件的说明与参考资料。"},"examples":[{"en":"The API docs explain how to authenticate.","zh":"API 文档解释了如何进行身份验证。"},{"en":"Check the docs if you get an error message.","zh":"如果出现报错信息，请查阅文档。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal) Doctors (especially in a group).","zh":"（非正式）医生们（尤指一群医生）。"},"examples":[{"en":"The docs will see you now.","zh":"医生们现在会给你看诊。"},{"en":"Ask the docs whether this medicine is safe for you.","zh":"问问医生们这种药对你是否安全。"}]}],"synonyms":["documents","papers","files","documentation","manuals","guides"],"phonetic":"/dɑks/","extraExplanation":["“Docs”最常见是“documents（文件）”的口语/书面简写；在科技领域也常专指“documentation（文档/说明书）”。在医疗语境里，“docs”也可以指“doctors（医生们）”，但更偏口语。"]}
{"word":"docs","summary":{"en":"“Docs” is an informal plural meaning either “documents” or “doctors,” depending on context.","zh":"“docs”是非正式复数，根据语境可指“文件/文档”或“医生”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"documents; written or digital files, especially official ones (informal plural).","zh":"文件；文档（非正式复数，尤指正式文件或资料）"},"examples":[{"en":"Please upload the docs before the meeting.","zh":"请在会议前上传这些文件。"},{"en":"I lost the travel docs, so we can’t board the flight.","zh":"我弄丢了旅行证件/文件，所以我们不能登机。"}]},{"partOfSpeech":"n.","definition":{"en":"doctors (informal plural).","zh":"医生（非正式复数）"},"examples":[{"en":"The docs told him to rest for a week.","zh":"医生让他休息一周。"},{"en":"If your symptoms get worse, call the docs.","zh":"如果症状加重，就联系医生。"}]}],"synonyms":["documents","paperwork","files","doctors","physicians"],"phonetic":"/dɑks/","extraExplanation":["“docs”是口语缩写，来自“documents”或“doctors”。在邮件、聊天、工作沟通里更常见；在正式写作中通常写全称。","在不同语境里意思很容易区分：和“upload / file / PDF / contract”等搭配多半是“文件”；和“hospital / clinic / symptoms / prescribe”等搭配多半是“医生”。"]}
{"word":"Doctor","summary":{"en":"A “doctor” is usually a medical professional, but it can also mean someone with a doctorate (PhD). As a verb, it means to alter something—often dishonestly.","zh":"doctor 通常指“医生”，也可指“博士（博士学位持有者）”。作动词时表示“篡改/伪造（多含贬义）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person trained and licensed to treat illness and injuries; a medical professional.","zh":"医生；受过专业训练并有执照为人治疗疾病和伤害的医护人员。"},"examples":[{"en":"I need to see a doctor about this cough.","zh":"我需要因为这个咳嗽去看医生。"},{"en":"The doctor told me to rest and drink more water.","zh":"医生告诉我要休息并多喝水。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who has the highest university degree (a doctorate), such as a PhD; also used as a title “Dr.”","zh":"博士；拥有最高学位（博士学位）的人；也可作头衔“Dr.”使用。"},"examples":[{"en":"She is a doctor of history (a PhD in history).","zh":"她是历史学博士。"},{"en":"Dr. Chen will speak at the conference tomorrow.","zh":"陈博士明天将在会议上发言。"}]},{"partOfSpeech":"v.","definition":{"en":"To change something in order to trick people or to improve it in a dishonest way (often used with “up”).","zh":"篡改；伪造；（常与“up”连用）用不诚实的方式改动以欺骗他人或让其看起来更好。"},"examples":[{"en":"Someone doctored the photo to hide the mistake.","zh":"有人篡改了照片来掩盖错误。"},{"en":"He doctored up the report before handing it in.","zh":"他在交报告前把报告“加工”得更好看。"}]}],"synonyms":["physician","medical doctor","Dr.","surgeon","PhD","doctored"],"phonetic":"/ˈdɑktər/","extraExplanation":["在英语里，“doctor”最常指“医生”，但也可以指“博士”。在大学或正式场合，PhD等博士学位持有者有时也会被称为“Doctor/Dr.”。","“Dr.”是“Doctor”的缩写，写在姓氏前面（Dr. Smith）。是否用“Dr.”取决于语境与对方偏好；在医疗场合通常默认指医生。","动词doctor（篡改）带有负面含义，常见搭配：doctor the evidence（篡改证据）、doctor a photo（修/改照片）。"]}
{"word":"doctor","summary":{"en":"“Doctor” most commonly means a medical doctor; it can also mean someone with a doctorate, and as a verb it can mean to alter or tamper with something.","zh":"“doctor”最常指“医生”；也可指“博士”；作动词时可表示“改动/修理”，有时含“篡改、动手脚”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who is trained and licensed to treat illness and injuries; a physician","zh":"医生；医师（受过专业训练并有执照，负责诊断与治疗疾病/伤病的人）"},"examples":[{"en":"I need to see a doctor about this cough.","zh":"我需要因为这次咳嗽去看医生。"},{"en":"The doctor prescribed medicine and told her to rest.","zh":"医生开了药，并让她多休息。"}]},{"partOfSpeech":"n.","definition":{"en":"a person who has the highest university degree (a doctorate), such as a PhD","zh":"博士；拥有最高学位（博士学位）的人（如 PhD）"},"examples":[{"en":"Her sister is a doctor of history.","zh":"她姐姐是历史学博士。"},{"en":"Ask your professor—she’s a doctor in her field.","zh":"问问你的教授——她是该领域的博士。"}]},{"partOfSpeech":"vt.","definition":{"en":"to change, repair, or alter something, often in order to improve it, sometimes dishonestly","zh":"篡改；修理；改动（常为“使更好”，有时含“不诚实地动手脚”的意思）"},"examples":[{"en":"Someone doctored the photo before posting it online.","zh":"有人在把照片发到网上之前篡改过。"},{"en":"He doctored the recipe to make it less spicy.","zh":"他改了下配方，让它不那么辣。"}]}],"synonyms":["physician","medical doctor","Dr.","surgeon","PhD","tamper with","alter","modify"],"phonetic":"/ˈdɑktər/","extraExplanation":["在英语里，“doctor”既可以指“医生”，也可以指“博士”。在校园语境中，人们常用“Dr. + 姓”称呼有博士学位或医学博士的人；但在医院里，“doctor”通常就是指医生。","动词“to doctor”在新闻或法庭语境里常带负面含义，接近“tamper with（动手脚/篡改）”，如“doctor the evidence（篡改证据）”。"]}
{"word":"doctor food label","summary":{"en":"a physician; also to alter something (sometimes to falsify or tamper with)","zh":"医生；也可指对某物进行改动（有时含“篡改/造假”）"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a medical professional who diagnoses and treats illness","zh":"医生；医师（诊断并治疗疾病的专业人士）"},"examples":[{"en":"I need to see a doctor about this cough.","zh":"我需要因为这个咳嗽去看医生。"},{"en":"The doctor prescribed some medicine.","zh":"医生开了一些药。"}]},{"partOfSpeech":"n.","definition":{"en":"a person with the highest university degree (a doctorate), such as a PhD","zh":"博士（拥有博士学位的人，如 PhD）"},"examples":[{"en":"She is a doctor of history.","zh":"她是历史学博士。"},{"en":"He earned his doctorate in engineering.","zh":"他获得了工程学博士学位。"}]},{"partOfSpeech":"vt.","definition":{"en":"to change something in order to deceive people; to falsify or tamper with","zh":"篡改；伪造；做手脚（为欺骗他人而改动）"},"examples":[{"en":"Someone doctored the food label to hide the real sugar content.","zh":"有人篡改了食品标签来掩盖真实的含糖量。"},{"en":"The photo was doctored before it was posted online.","zh":"这张照片在发布到网上之前被修过（做过手脚）。"},{"en":"It’s illegal to doctor documents.","zh":"篡改文件是违法的。"}]},{"partOfSpeech":"vt.","definition":{"en":"to add something to food or drink to improve it or change its taste","zh":"给（食物/饮料）加料；调制（使味道更好或改变口味）"},"examples":[{"en":"He doctored the soup with extra garlic.","zh":"他在汤里加了更多大蒜来调味。"},{"en":"You can doctor instant noodles with vegetables and an egg.","zh":"你可以给方便面加蔬菜和鸡蛋来升级一下。"}]}],"synonyms":["physician","medical doctor","doctorate holder","falsify","tamper with","alter","manipulate","adulterate","spike","season"],"phonetic":"/ˈdɑktɚ/","extraExplanation":["在“food label（食品标签）”语境里，doctor 最常见的意思是“篡改/伪造”（负面、通常违法），比如改成分表、营养成分或日期。","doctored photo / doctored evidence 也很常见，表示“被修过、被动过手脚的照片/证据”。"],"etymology":"源自拉丁语 doctor（“教师、学者”），来自 docēre（“教”）。后来在英语中常指“医生”，也引申出动词含义：对某物“处理/调制”，再进一步也可指“做手脚、篡改”。","mnemonic":["把 doctor 联想成“动手处理”：既可以是好事（给汤里加料 doctor the soup），也可以是坏事（篡改标签 doctor the label）。","doc- 让人想到 document（文件）：doctor documents = 对文件做手脚。"]}
{"word":"doctor in charge","summary":{"en":"the doctor responsible for decisions and care","zh":"负责决策和治疗的医生"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"the main doctor responsible for a patient’s care, or the doctor who leads a medical team/department","zh":"主治医生；负责人医生（负责某位病人或某个医疗团队/科室的主要医生）"},"examples":[{"en":"Please ask the doctor in charge about the treatment plan.","zh":"请向负责医生咨询治疗方案。"},{"en":"The doctor in charge will decide whether you can be discharged today.","zh":"负责人医生会决定你今天能否出院。"},{"en":"She is the doctor in charge of the emergency department tonight.","zh":"她今晚负责急诊科。"}]}],"synonyms":["attending physician","physician in charge","head doctor","chief physician","lead physician"],"phonetic":"/ˈdɑk.tɚ ɪn tʃɑrdʒ/","extraExplanation":["常见近义表达：in American English，医院里也常说“attending physician（主治医生）”“physician in charge（负责人医生）”。在不同国家/医院制度中，具体头衔可能不同，但这句话的核心含义是“谁来负责、谁作最终决定”。","用法提示：通常说“the doctor in charge (of …)”；也可用作定语：“the doctor-in-charge”（更像头衔/职位写法）。"],"etymology":"源自英语短语结构“in charge（负责）”，整体意思是“负责的医生”。在医院语境中常用于指对病人或科室负主要责任的医生。","mnemonic":["把它拆开记：doctor（医生）+ in charge（负责）= 负责的医生。","联想中文“负责人/主治”——看到 in charge 就想到“管事的、拍板的”。"]}
{"word":"Doctor of Dental Surgery","summary":{"en":"a dentistry doctorate (often U.S.) that qualifies one to practice as a dentist","zh":"（常见于美国的）牙科博士学位，具备牙医执业资格"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A professional doctoral degree in dentistry, especially in the U.S., qualifying someone to practice as a dentist.","zh":"（尤指美国的）牙科专业博士学位，取得后具备作为牙医执业的资格。"},"examples":[{"en":"She earned a Doctor of Dental Surgery (DDS) and opened a clinic downtown.","zh":"她获得了牙科博士（DDS）学位，并在市中心开了一家诊所。"},{"en":"The job posting requires a Doctor of Dental Surgery and a state license.","zh":"该职位要求具备牙科博士学位并持有州执照。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who holds this degree; a dentist (used as a title after a name).","zh":"持有该学位的人；牙医（常用作姓名后的头衔）。"},"examples":[{"en":"Michael Chen, DDS, will see you at 3 p.m.","zh":"Michael Chen 牙科博士（DDS）将在下午3点为您看诊。"},{"en":"Ask your Doctor of Dental Surgery about whitening options.","zh":"关于美白方案，请咨询你的牙科博士（DDS）。"}]}],"synonyms":["DDS","dentist","dental surgeon","Doctor of Dentistry"],"phonetic":"ˌdɑktər əv ˈdɛntəl ˈsɝdʒəri","extraExplanation":["在美国，DDS（Doctor of Dental Surgery）与 DMD（Doctor of Dental Medicine）在执业资格上通常等同，课程要求也基本一致；不同学校历史传统不同而使用不同学位名。","实际行医通常还需要通过国家/州的考试并取得执照；仅有学位不一定代表可立即在某地执业。"],"etymology":"源自拉丁语 doctor（“教师/博士”）与英语 dental（来自拉丁语 dens “牙”）以及 surgery（经由法语，源自希腊语 cheirourgia “手工操作/外科”）。作为学位名称在英语世界（尤其美国）中固定化使用，并常缩写为 DDS。","mnemonic":["把它拆开记：Dental=“牙”，Surgery=“外科/手术”，合起来就是“做牙科治疗的博士”。","联想缩写 DDS：D=Doctor（博士），D=Dental（牙），S=Surgery（外科）。"]}
{"word":"Doctor of Laws","summary":{"en":"a (often honorary) doctorate related to law","zh":"与法律相关的博士学位（常为荣誉学位）"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a doctoral degree in law, often awarded as an honorary degree; abbreviated as LL.D.","zh":"法学博士学位（常为荣誉学位）；缩写为 LL.D."},"examples":[{"en":"The university awarded her a Doctor of Laws for her work in human rights.","zh":"大学因她在人权领域的贡献授予她法学博士（荣誉）学位。"},{"en":"His biography notes that he received a Doctor of Laws from his alma mater.","zh":"他的传记中提到，他从母校获得了法学博士学位。"}]}],"synonyms":["LL.D.","doctorate in law","law doctorate"],"phonetic":"/ˌdɑktər əv lɔz/","extraExplanation":["在英语国家语境里，Doctor of Laws 常见于“荣誉学位”（honorary degree），用于表彰在法律、公共服务、政治或社会正义方面有重要贡献的人；也有少数学校将其作为研究型法学博士学位授予。","不要与 J.D.（Juris Doctor，职业法律学位）混淆；J.D. 通常是律师执业前的主流学位，而 LL.D. 更常见于荣誉称号或更高层级的法学博士体系。"],"etymology":"源自拉丁语 Legum Doctor（意为“法律之博士”）。缩写 LL.D. 中的双写 L 来自 legum（lex“法律”的复数属格），表示“诸法/法律（复数）”。","mnemonic":["把 Laws 理解为“法律（复数）”：Doctor of Laws ≈ “法律方面的博士”。","LL.D. 记忆：两个 L 像“两部法律/很多法律”，提示它来自拉丁语的“法律（复数）”。"]}
{"word":"Doctor of Medicine","summary":{"en":"a professional degree for physicians","zh":"医生的专业学位"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a professional doctoral degree for physicians; also used as a title indicating someone is trained and licensed to practice medicine","zh":"医学博士（医生的专业博士学位）；也可作头衔，表示受过医学训练并获得行医资格的人"},"examples":[{"en":"She earned her Doctor of Medicine degree and started her residency in pediatrics.","zh":"她获得了医学博士学位，并开始了儿科住院医师培训。"},{"en":"His business card lists him as John Smith, M.D.","zh":"他的名片上写着 John Smith，医学博士（M.D.）。"}]}],"synonyms":["M.D.","medical degree"],"phonetic":"/ˌdɑk.tɚ əv ˈmɛd.ɪ.sɪn/","extraExplanation":["常见缩写：M.D.（美国等地区常用）。","在美国，“Doctor of Medicine (M.D.)”是行医的专业学位；获得学位后通常还需完成住院医师培训（residency）并通过执照考试才能独立行医。","不同国家/地区的医学学位体系不完全相同：有些地方常见 MBBS/MBChB 等本科-专业路径；中文里常把 M.D. 译作“医学博士”，但它不一定等同于研究型 Ph.D.。"],"etymology":"源自拉丁语：doctor（“教师/学者”，后来引申为“医生”）+ medicina（“医学/治疗艺术”）。在英语中逐渐固定为医学领域的专业博士学位名称。","mnemonic":["把 M.D. 记成“Medical Doctor”的首字母，看到名片上的 M.D. 就联想到“医生”。","Medicine = med + icine，可联想“med（医疗）”→“医学/治疗”。"]}
{"word":"Doctor of Philosophy","summary":{"en":"a research doctorate (PhD)","zh":"研究型博士学位（PhD）"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"The highest university degree in many fields, earned by doing advanced study and original research; usually written as PhD.","zh":"（许多学科中的）最高等级大学学位，通过高阶学习与原创研究获得；通常写作 PhD。"},"examples":[{"en":"She earned a Doctor of Philosophy in chemistry.","zh":"她获得了化学博士（PhD）学位。"},{"en":"A Doctor of Philosophy program often requires writing a dissertation.","zh":"博士（PhD）项目通常需要撰写论文（dissertation）。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who holds this degree; a PhD.","zh":"拥有该学位的人；博士（PhD）。"},"examples":[{"en":"He is a Doctor of Philosophy who researches climate policy.","zh":"他是一位研究气候政策的博士。"},{"en":"The lab hired several Doctors of Philosophy as senior researchers.","zh":"实验室聘用了几位博士作为高级研究员。"}]}],"synonyms":["PhD","doctorate","doctoral degree","research doctorate"],"phonetic":"ˌdɑk.tɚ əv fəˈlɑsə.fi","extraExplanation":["虽然包含 Doctor 一词，但 Doctor of Philosophy 通常不是“医学博士”。在英语里，PhD 也常被称为 doctorate / doctoral degree。","称呼上，有些国家/机构会用 Dr. + 姓氏称呼 PhD 持有者；也有地方更偏好直接用姓名或用 PhD 作为头衔后缀（如 “Li Wei, PhD”）。具体取决于文化与场合。"],"etymology":"源自拉丁语表达，意为“哲学的博士”；其中 philosophy 来自希腊语 philosophia，字面是“爱智慧”。现代大学中用来泛指研究型博士学位，不仅限于哲学学科。","mnemonic":["把它拆开记：Doctor（博士）+ of + Philosophy（爱智慧/学问）。这里的 Philosophy 更像“学术研究”，所以“PhD”=“研究型博士”。","联想缩写：P(h)D 里有 D=Doctor（博士），所以看到 PhD 就想到“博士学位”。"]}
{"word":"doctor of philosophy","summary":{"en":"A Doctor of Philosophy (PhD) is an advanced university degree for original research in many fields (not only philosophy).","zh":"Doctor of Philosophy（PhD）是以原创研究为核心的高阶学术学位，涵盖许多学科，并不只限于哲学。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"(PhD) The highest common academic degree awarded by universities for advanced study and original research in a subject.","zh":"（PhD）大学授予的常见最高学术学位之一，通常代表在某一领域完成高阶学习并做出原创研究。"},"examples":[{"en":"She earned a Doctor of Philosophy in chemistry after defending her dissertation.","zh":"她在完成论文答辩后获得了化学博士（Doctor of Philosophy）学位。"},{"en":"A Doctor of Philosophy degree often requires several years of coursework and research.","zh":"博士（Doctor of Philosophy）学位通常需要数年的课程学习与研究。"},{"en":"He is a Doctor of Philosophy candidate studying education policy.","zh":"他是研究教育政策的博士（Doctor of Philosophy）候选人。"}]}],"synonyms":["PhD","doctoral degree","doctorate"],"phonetic":"/ˌdɑk.tɚ əv fəˈlɑs.ə.fi/","extraExplanation":["“Doctor of Philosophy”常缩写为“PhD”或“DPhil”（少数学校如牛津更常用DPhil）。这里的“philosophy”源自希腊语“爱智慧”，并不表示一定是“哲学专业”；理工、社科、人文等许多学科的博士都叫PhD。","英语里“doctor”既可指“医生”，也可指“博士学位持有人”。在校园或学术场合，PhD可以被称为“Doctor”，但在医疗场景中通常指医生；为了避免误会，常说“a PhD”或“a doctoral degree”。","常见相关表达：doctoral program（博士项目）、dissertation/thesis（博士论文，英美用法略有差异）、defend one’s dissertation（论文答辩）、ABD（All But Dissertation，课程等完成但论文未完成）。"]}
{"word":"Doctor of Science","summary":{"en":"An advanced doctoral degree in scientific fields, sometimes also used as an honorary doctorate.","zh":"科学领域的高级博士学位，有时也指荣誉博士。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"An advanced doctoral degree awarded for high-level research or significant contributions in scientific fields; often abbreviated as ScD or DSc, depending on the institution.","zh":"理学博士（科研领域的高级博士学位），通常授予在科学领域有高水平研究或重要贡献的人；常缩写为 ScD 或 DSc（因学校而异）。"},"examples":[{"en":"She earned a Doctor of Science in biomedical engineering after years of research.","zh":"她在多年研究后获得了生物医学工程方向的理学博士学位。"},{"en":"At this university, the Doctor of Science is awarded for an exceptional body of published work.","zh":"在这所大学，理学博士通常授予发表成果特别突出的研究者。"}]},{"partOfSpeech":"phrase","definition":{"en":"In some contexts, an honorary doctorate given to recognize outstanding scientific achievement (not necessarily based on completing a standard doctoral program).","zh":"在某些情况下，指授予杰出科学成就的荣誉博士（不一定基于完成常规博士培养项目）。"},"examples":[{"en":"The institute awarded him an honorary Doctor of Science for his contributions to climate research.","zh":"该研究所因他对气候研究的贡献授予他荣誉理学博士。"}]}],"synonyms":["ScD","DSc","science doctorate","doctoral degree in science"],"phonetic":"/ˌdɑk.tɚ əv ˈsaɪ.əns/","extraExplanation":["不同学校对 ScD/DSc 的定位不完全相同：有的把它作为与 PhD 并列或更偏“资深/成果导向”的研究型博士；也有的主要用于荣誉学位。求职或申请时最好查看授予机构的官方说明。","中文里常译作“理学博士”。在英美体系中，它与 “Doctor of Philosophy (PhD)” 都是博士学位，但名称强调领域与传统不同。"],"etymology":"源自拉丁语传统：doctor 意为“教师/学者”，science 来自拉丁语 scientia（“知识”）。作为学位名称，强调以科学研究与学术贡献为核心的“博士”称号。","mnemonic":["把它拆开记：Doctor = 博士；Science = 科学/理学 → “科学的博士”= 理学博士。","看到缩写 ScD/DSc，可以联想：S = Science（科学），D = Doctor（博士）。"]}
{"word":"Doctor's degree","summary":{"en":"the highest academic degree level (research or professional)","zh":"最高层级的学位（研究型或专业型）"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"the highest level of academic degree, usually earned through advanced study and research (or professional training), such as a PhD, MD, or EdD","zh":"博士学位：最高层级的学位，通常通过高级学习与研究（或专业训练）获得，例如 PhD、MD、EdD 等"},"examples":[{"en":"She earned a doctor’s degree in chemistry and now runs a research lab.","zh":"她获得了化学博士学位，现在负责一个研究实验室。"},{"en":"In many universities, a doctor’s degree requires writing and defending a dissertation.","zh":"在许多大学里，博士学位需要撰写并答辩论文（dissertation）。"},{"en":"He’s considering a professional doctor’s degree like an MD rather than a PhD.","zh":"他在考虑读 MD 这类专业博士学位，而不是 PhD。"}]}],"synonyms":["doctoral degree","doctorate","PhD","doctoral qualification"],"phonetic":"/ˈdɑk.tɚz dɪˈɡriː/","extraExplanation":["常见类型：PhD（研究型博士，偏学术与科研）；Professional doctorate（专业博士，偏职业资格与实践，如 MD 医学博士、JD 法学博士、DPT 物理治疗博士、EdD 教育博士等）。不同国家/学校对名称与要求可能不同。","日常表达中也常说 “doctoral degree”。在美国语境里，“doctorate”也可直接指博士学位（例如: earn a doctorate）。"],"etymology":"“doctor”源自拉丁语 doctor，意为“老师、学者”（来自 docere “教”）。在中世纪欧洲大学体系中，“doctor”逐渐成为最高学术头衔之一；“degree”来自拉丁语 gradus “等级、阶梯”，表示学位的层级。","mnemonic":["把 doctor 记成“导师/博士”，degree 记成“学位/等级”，合起来就是“博士+学位”。","联想“读到最高一层：学位阶梯（degree/gradus）最顶端就是博士”。"]}
{"word":"doctor's degree","summary":{"en":"the highest-level graduate degree (a doctorate)","zh":"博士学位（最高层级学位）"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"An advanced university degree awarded after graduate-level study and original research or professional training; a doctorate (such as a PhD or an MD).","zh":"博士学位；完成研究生阶段深入学习与研究（或专业训练）后授予的最高层级学位（如 PhD 或 MD）。"},"examples":[{"en":"She earned a doctor’s degree in psychology after five years of research.","zh":"她经过五年的研究，获得了心理学博士学位。"},{"en":"Many university professors have a doctor’s degree.","zh":"很多大学教授都拥有博士学位。"},{"en":"He decided to pursue a doctor’s degree to deepen his expertise.","zh":"他决定攻读博士学位，以加深自己的专业能力。"}]}],"synonyms":["doctoral degree","doctorate","PhD","DPhil"],"phonetic":"/ˈdɑk.tɚz dɪˈɡri/","extraExplanation":["更常见的说法是 doctoral degree 或 doctorate；doctor’s degree 也能用，但在学术写作中不如前两者正式。","英语里 doctor 既可指“医生”，也可指“博士”。因此 doctor’s degree 指“博士学位”，不是“医生的学位”。","常见类型：PhD（研究型博士）、EdD/DBA（专业/应用型博士）、MD（医学博士，更多对应医生的专业学位）。不同国家体系略有差异。"],"etymology":"“doctor”源自拉丁语 doctor（“老师、学者”），来自动词 docere（“教”）。后来“doctor”也用于表示获得最高学位的人；“degree”来自拉丁语 gradus（“台阶、等级”），引申为“学位等级”。","mnemonic":["把 doctor 记成“博士/医生”，但和 degree（学位）连用时，意思固定为“博士学位”。","联想：doctorate 里有 -ate，像“达到一个级别”，对应“最高学位层级”。"]}
{"word":"doctor-like","summary":{"en":"“Doctor-like” means behaving or seeming like a doctor—professional, clinical, and focused on health matters.","zh":"“doctor-like”指“像医生一样的”，强调专业、临床式、关注健康/诊疗的风格。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like a doctor in manner, appearance, or behavior; professional, clinical, and focused on health or treatment.","zh":"像医生一样的；（举止、外表或说话方式）很专业、很“诊疗式”、偏临床风格的。"},"examples":[{"en":"Her doctor-like tone made everyone take the symptoms seriously.","zh":"她那种医生般的语气让大家都认真对待这些症状。"},{"en":"He gave me a doctor-like look and asked detailed questions about my sleep.","zh":"他用一种医生般的眼神看着我，还详细问了我的睡眠情况。"},{"en":"The report was clear and doctor-like—short, factual, and calm.","zh":"这份报告很清晰，很有医生风格——简短、客观、冷静。"}]}],"synonyms":["clinical","professional","medical","businesslike","matter-of-fact"],"phonetic":"/ˈdɑk.tɚˌlaɪk/","extraExplanation":["“doctor-like”是由“doctor + like”构成的复合形容词，常用连字符（-）连接，尤其在名词前作定语时更常见：a doctor-like manner。放在系动词后也可以不加连字符：His manner was doctor like（较少见）。","语气上通常强调“专业/临床/冷静”，有时也可能带一点“过于冷淡、只讲事实”的暗示，具体取决于语境。"]}
{"word":"doctor-patient disputes","summary":{"en":"conflicts between doctors and patients, sometimes involving complaints or legal action","zh":"医生与患者之间的矛盾争议，可能涉及投诉或诉讼"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"conflicts or disagreements between a doctor (or hospital) and a patient (or the patient’s family), often about diagnosis, treatment, costs, communication, or medical responsibility; sometimes involving complaints or legal action.","zh":"医患纠纷；医生（或医院）与患者（或家属）之间的矛盾或争议，常涉及诊断、治疗、费用、沟通或医疗责任，有时会升级为投诉或诉讼。"},"examples":[{"en":"The hospital set up a mediation office to handle doctor-patient disputes quickly.","zh":"医院设立了调解办公室，以便快速处理医患纠纷。"},{"en":"Clear communication can prevent many doctor-patient disputes.","zh":"清晰的沟通可以预防许多医患纠纷。"},{"en":"The case became a serious doctor-patient dispute and was taken to court.","zh":"该事件升级为严重的医患纠纷，并被诉至法院。"}]}],"synonyms":["medical dispute","healthcare dispute","doctor-patient conflict","medical conflict","patient complaint","medical grievance","malpractice dispute"],"phonetic":"ˈdɑktər ˈpeɪʃənt dɪˈspjuːts","extraExplanation":["常见搭配：resolve/settle doctor-patient disputes（解决医患纠纷）；doctor-patient dispute resolution mechanism（医患纠纷解决机制）；cause/trigger a dispute（引发纠纷）；medical malpractice dispute（医疗事故/医疗过失纠纷）。","语体提示：在新闻、政策、学术语境中常见；日常口语也可说 “conflicts between doctors and patients”。"],"etymology":"由“doctor-patient（医患）”这一复合修饰语 + “disputes（争议/纠纷）”构成；dispute 源自拉丁语 *disputare*（“讨论、辩论”），后来常指“争执、纠纷”。","mnemonic":["把它拆开记：doctor-patient = “医生—病人”，disputes = “纠纷/争执”，合起来就是“医患纠纷”。","dis-（分开、对立）+ put（放/摆）→ 彼此对立地“摆出观点”，就会产生 dispute（争议）。"]}
{"word":"doctoral","summary":{"en":"“Doctoral” most commonly means “related to a doctorate/PhD,” describing study, degrees, or research at the highest university level.","zh":"“doctoral”最常见意思是“与博士学位/博士（PhD）相关的”，用于描述最高学位阶段的学习、学位或研究。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a doctorate (the highest university degree), or to doctoral study and research.","zh":"与博士学位（大学最高学位）有关的；与博士阶段学习和研究有关的。"},"examples":[{"en":"She is doing doctoral research in psychology.","zh":"她正在进行心理学博士阶段的研究。"},{"en":"He applied to several doctoral programs in engineering.","zh":"他申请了好几个工程学的博士项目。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who holds a doctorate (less common in everyday American English).","zh":"博士学位获得者（在日常美式英语中较少这样用）。"},"examples":[{"en":"The conference brought together doctoral and master’s graduates.","zh":"这次会议汇集了博士和硕士毕业生。"}]}],"synonyms":["PhD (as an adjective in context, e.g., PhD program)","postgraduate (broader)","academic (broader)"],"phonetic":"/ˈdɑktərəl/","extraExplanation":["“doctoral”最常见的用法是形容词，通常搭配：doctoral degree（博士学位）、doctoral program（博士项目）、doctoral student/candidate（博士生/博士候选人）、doctoral dissertation/thesis（博士论文）。","美式英语里更常说“PhD student/candidate”来指“博士生/博士候选人”。把“doctoral”当名词表示“博士（人）”较少见，常用“doctor”或“PhD holder”。","词源上来自拉丁语“doctor”（老师、学者）相关形式；学术语境中更正式。"]}
{"word":"doctoral degree","summary":{"en":"the highest university-level academic qualification, usually requiring advanced study and original research","zh":"最高层级的大学学位，通常需深造并完成原创研究"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"the highest university degree, usually involving several years of advanced study and original research","zh":"博士学位；大学中最高等级的学位，通常需要多年深造并完成原创研究"},"examples":[{"en":"She earned a doctoral degree in computer science.","zh":"她获得了计算机科学博士学位。"},{"en":"A doctoral degree often requires writing a dissertation.","zh":"博士学位通常需要撰写学位论文（博士论文）。"},{"en":"He’s applying to programs that lead to a doctoral degree.","zh":"他正在申请可获得博士学位的项目。"}]}],"synonyms":["doctorate","PhD"],"phonetic":"/ˈdɑk.tɚ.əl dɪˈɡriː/","extraExplanation":["在美国英语里，doctoral degree 常见类型包括 PhD（哲学博士，偏研究）和 professional doctorate（职业博士，如 MD 医学博士、JD 法学博士、EdD 教育博士等）。不同国家/体系对“博士”的培养与称呼可能略有差异。","口语里也常说 doctorate 或 simply a PhD（当指 PhD 时）。注意：不是所有 doctoral degree 都叫 PhD。"],"etymology":"doctor 来自拉丁语 doctor，原意是“教师、学者”；-al 表示“……的”。degree 来自拉丁语 de-（向下）+ gradus（步、等级），引申为“等级、学位”。合在一起指“博士层级的学位”。","mnemonic":["doctor 最初是“教书的人”，读到最高层次、能做原创研究并指导别人，就像“博士/导师”。","degree 有“等级”的意思：doctoral degree = 博士这一“等级”的学位。"]}
{"word":"doctoral student","summary":{"en":"a graduate student working toward a doctorate, especially through advanced research","zh":"攻读博士学位、以科研为主的研究生"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a student who is studying for a doctoral degree (PhD or another doctorate), usually doing advanced coursework and original research","zh":"攻读博士学位的学生（如PhD或其他博士学位），通常需要完成高阶课程并进行原创研究"},"examples":[{"en":"She is a doctoral student in computer science, focusing on natural language processing.","zh":"她是计算机科学的博士生，研究方向是自然语言处理。"},{"en":"As a doctoral student, he spends most of his time reading papers and running experiments.","zh":"作为博士生，他大部分时间都在读论文和做实验。"},{"en":"The lab is hiring a doctoral student to help with data analysis.","zh":"该实验室正在招聘一名博士生协助数据分析。"}]},{"partOfSpeech":"n.","definition":{"en":"(in some countries or contexts) a graduate student enrolled in the highest university degree program, sometimes called a PhD student","zh":"（在某些国家或语境中）就读于最高层级研究生项目的学生，也常被称为PhD学生"},"examples":[{"en":"In the U.S., a doctoral student may teach undergraduates as a teaching assistant.","zh":"在美国，博士生可能会以助教身份给本科生上课。"},{"en":"The conference offers travel grants for doctoral students.","zh":"该会议为博士生提供差旅资助。"}]}],"synonyms":["PhD student","doctorate student","graduate researcher","doctoral candidate"],"phonetic":"/ˈdɑk.tər.əl ˈstuː.dənt/","extraExplanation":["英美大学里，“doctoral student”通常包含：课程学习（coursework）、资格/综合考试（qualifying/comprehensive exam）、论文提案（proposal）、博士论文（dissertation）与答辩（defense）。","在英式英语环境中也常说“PhD student”或“doctoral candidate”（通常指通过资格考试、进入论文阶段的人）。不同学校对“candidate”的定义可能不同。"],"etymology":"“doctoral”来自拉丁语 doctor（原意“教师”），经由中世纪拉丁语 doctoralis（“与博士/博士学位相关的”）；“student”来自拉丁语 studere（“学习”）。合起来表示“攻读博士学位的人”。","mnemonic":["把“doctoral”联想到“doctor（博士/博士学位）+ -al（……的）”，所以是“博士相关的学生”。","记忆搭配：doctoral student ≈ PhD student（读博的人）。"]}
{"word":"doctoral thesis","summary":{"en":"the main research paper required for a PhD","zh":"获得博士学位所需的主要研究论文"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a long, formal research paper written as the main requirement for a doctoral (PhD) degree, presenting original research and arguments","zh":"（博士学位的）博士论文；为获得博士（PhD）学位而撰写的长篇、正式的研究论文，通常包含原创研究与论证"},"examples":[{"en":"She defended her doctoral thesis in front of a committee.","zh":"她在委员会面前进行了博士论文答辩。"},{"en":"His doctoral thesis explores how urban design affects public health.","zh":"他的博士论文研究城市设计如何影响公共健康。"},{"en":"Writing a doctoral thesis can take several years.","zh":"撰写博士论文可能需要好几年。"}]}],"synonyms":["PhD dissertation","dissertation","doctoral dissertation","thesis"],"phonetic":"/ˈdɑk.tɚ.əl ˈθi.sɪs/","extraExplanation":["英美学术语境里，“doctoral thesis”和“PhD dissertation”常被交替使用，但不同学校/国家的习惯不完全一致：在美国一些院校更常说 dissertation；在英国一些院校更常说 thesis。保险表达：问导师或看本校研究生院的官方用词。","常见搭配：write/submit a doctoral thesis（撰写/提交博士论文）, defend one’s thesis（论文答辩）, thesis committee（论文委员会）, thesis advisor/supervisor（导师）, thesis statement（论文核心论点/主张：多用于本科/硕士写作语境）。"],"etymology":"“doctoral”来自拉丁语 doctor（老师、学者），表示“博士的”；“thesis”来自希腊语 thesis，原意为“放置、提出”，引申为“论题、论点”，后来指为学位而写的正式研究作品。","mnemonic":["把 thesis 记成“题（th-）+ 思（-sis）”：论文就是围绕一个“题”展开的“思考/论证”。","doctoral = doctor（博士）+ -al（……的）：博士的论文 = 博士论文。"]}
{"word":"doctoral-preparatory","summary":{"en":"A descriptive adjective meaning “meant to prepare for PhD-level study.”","zh":"形容词：指“为攻读博士（PhD）做准备的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Designed to prepare someone for doctoral (PhD) study; intended as training or coursework before entering a doctorate program.","zh":"为攻读博士（PhD）做准备的；用于在进入博士项目前进行训练或学习的。"},"examples":[{"en":"She enrolled in a doctoral-preparatory program to strengthen her research skills before applying for a PhD.","zh":"她参加了一个博士预备项目，在申请博士前提升自己的研究能力。"},{"en":"The university offers doctoral-preparatory courses in academic writing and statistics.","zh":"这所大学提供博士预备课程，例如学术写作和统计学。"}]}],"synonyms":["PhD-prep","pre-doctoral","predoctoral","doctoral-track (context-dependent)"],"phonetic":"/ˌdɑk.tɚ.əl prɪˈpɛr.ə.tɔr.i/","extraExplanation":["“doctoral-preparatory”多用于学术与招生语境，常修饰 program / courses / track / training 等名词，强调“为进入博士阶段做准备”，不等同于“博士阶段的（doctoral）”。","英语中这种复合形容词常用连字符连接（doctoral-preparatory），尤其在名词前作定语时更常见；放在名词后也可不加连字符（例如：The program is doctoral preparatory.），但实际写作里连字符形式更常见。"]}
{"word":"doctorally","summary":{"en":"“Doctorally” means “in a doctoral/PhD-related way,” usually in academic contexts.","zh":"“doctorally”常指“以博士层级/与博士学位相关的方式”，多用于学术语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to a doctorate (PhD or other doctoral degree) or doctoral-level work.","zh":"以博士（PhD 或其他博士学位）或博士层级的方式；在博士研究/训练层面上。"},"examples":[{"en":"She is trained doctorally in clinical psychology, so she focuses on research methods and ethics.","zh":"她在临床心理学方面接受过博士层级的训练，所以很重视研究方法和伦理。"},{"en":"The program prepares students doctorally through advanced seminars and independent research.","zh":"该项目通过高级研讨课和独立研究来进行博士层级的培养。"}]},{"partOfSpeech":"adv.","definition":{"en":"With the authority or perspective of a doctor (less common; often sounds formal or academic).","zh":"以医生/博士的权威或视角（较少见；多用于正式或学术语境）。"},"examples":[{"en":"He spoke doctorally about the risks, using careful, professional language.","zh":"他以一种很“医生式/权威式”的口吻谈到风险，措辞谨慎而专业。"}]}],"synonyms":["at the doctoral level","as a doctoral student","PhD-level","academically"],"phonetic":"/ˈdɑk.tər.ə.li/","extraExplanation":["“doctorally”来自形容词“doctoral（博士的）”+ 副词后缀“-ly”。在现代英语里，它最常见于学术场景，用来强调“博士层级的训练/研究方式”。在日常口语中，人们更常说“at the doctoral level”或“as a PhD student/researcher”。"]}
{"word":"doctorate","summary":{"en":"A doctorate is the highest university degree, or the period of study and research to earn it.","zh":"doctorate 指博士学位，也可指攻读博士的学习与研究过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the highest level of academic degree awarded by a university (such as a PhD or an EdD).","zh":"博士学位；大学授予的最高等级学位（如 PhD、EdD 等）。"},"examples":[{"en":"She earned a doctorate in chemistry and now works in drug research.","zh":"她获得了化学博士学位，现在从事药物研究。"},{"en":"After finishing his doctorate, he became a university professor.","zh":"完成博士学位后，他成为了一名大学教授。"},{"en":"It can take four to six years to complete a doctorate, depending on the program.","zh":"完成博士学位通常需要四到六年，取决于项目。"}]},{"partOfSpeech":"n.","definition":{"en":"the study and research required to earn a doctoral degree (often used in phrases like “do a doctorate”).","zh":"攻读博士的过程；为获得博士学位所进行的学习与研究（常用于 “do a doctorate” 等表达）。"},"examples":[{"en":"He decided to do a doctorate abroad to broaden his research experience.","zh":"他决定去国外攻读博士，以拓展研究经验。"},{"en":"During her doctorate, she published two papers in major journals.","zh":"在攻读博士期间，她在重要期刊上发表了两篇论文。"}]}],"synonyms":["doctoral degree","PhD","doctor’s degree"],"phonetic":"/ˈdɑk.tɚ.ət/","extraExplanation":["在英语里，doctorate 指“博士学位”这个层级，也常指“攻读博士”的过程。常见搭配：earn/get a doctorate（获得博士学位）、pursue a doctorate（攻读博士）、hold a doctorate（拥有博士学位）。","doctorate 与 PhD 的关系：PhD（Doctor of Philosophy）是最常见的一种博士学位类型，但 doctorate 的范围更广，还包括 EdD（教育学博士）、MD（医学博士，专业学位）、JD（法学博士，专业学位）等。不同国家/学校对这些学位的定位与培养方式可能不同。","发音提示：很多学习者会把重音放错。美式英语通常重读第一个音节：DOC-tuh-rit。"]}
{"word":"doctorates","summary":{"en":"“Doctorates” is the plural of “doctorate,” meaning the highest-level academic degrees (like a PhD).","zh":"“Doctorates” 是 “doctorate” 的复数，指博士等最高层级的学位（如 PhD）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the highest university degrees, usually earned through advanced study and research (e.g., PhD, EdD, MD)","zh":"博士学位（通常指通过高等学习与研究获得的最高级大学学位，如 PhD、EdD、MD 等）"},"examples":[{"en":"Many university professors have doctorates in their fields.","zh":"许多大学教授都拥有本专业的博士学位。"},{"en":"She earned two doctorates—one in education and one in psychology.","zh":"她获得了两个博士学位——一个教育学博士，一个心理学博士。"}]}],"synonyms":["PhDs","doctoral degrees","terminal degrees"],"phonetic":"/ˈdɑk.tɚ.əts/","extraExplanation":["“Doctorate” 是可数名词，单数为 a doctorate，复数为 doctorates。常见搭配：earn/get a doctorate（获得博士学位），hold a doctorate（拥有博士学位），pursue a doctorate（攻读博士学位）。","英美语境里，PhD（Doctor of Philosophy）是最常见的研究型博士学位；MD 通常是医学职业学位（在不同国家制度中定位不完全相同），日常交流里说 someone has a doctorate 往往强调“博士层级的学位”，不一定意味着此人是医生。"]}
{"word":"doctorbird","summary":{"en":"A Jamaican hummingbird, especially the red-billed streamertail.","zh":"牙买加的一种蜂鸟，尤指红嘴长尾蜂鸟（streamertail）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of hummingbird native to Jamaica, especially the red-billed streamertail, known for its long tail feathers and quick, hovering flight","zh":"一种原产于牙买加的蜂鸟，尤指“红嘴长尾蜂鸟”（streamertail），以细长尾羽和悬停飞行著称"},"examples":[{"en":"On our trip to Jamaica, we saw a doctorbird hovering over hibiscus flowers.","zh":"我们去牙买加旅行时，看到一只doctorbird在木槿花旁悬停。"},{"en":"The doctorbird is famous for the male’s long, ribbon-like tail feathers.","zh":"doctorbird因雄鸟像丝带一样的长尾羽而闻名。"},{"en":"In local art, the doctorbird often symbolizes Jamaica’s natural beauty.","zh":"在当地艺术中，doctorbird常象征牙买加的自然之美。"}]}],"synonyms":["streamertail","red-billed streamertail","Jamaican hummingbird"],"phonetic":"/ˈdɑk.tɚˌbɝd/","extraExplanation":["“doctorbird”是牙买加常见的英文俗名，通常指“红嘴长尾蜂鸟”（red-billed streamertail）。名称据说与它细长的尾羽有关，看起来像旧时医生（或“巫医/草药医生”）的黑色燕尾服外套；不同来源的解释略有差异，但都强调它独特的“长尾”。","它是牙买加的国鸟之一（常被称为“国鸟”），在旅游宣传、纪念品与民间文化中很常见。正式生物学名称常见为 Trochilus polytmus（红嘴长尾蜂鸟）。"]}
{"word":"doctordom","summary":{"en":"Doctordom means the world, profession, or community of doctors.","zh":"doctordom 指“医生的世界/行业/群体（医师界）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the profession, community, or collective world of doctors (medical practitioners); the realm of doctors as a group","zh":"医师行业；医生群体（医生的“圈子/世界”）"},"examples":[{"en":"In doctordom, new guidelines can change everyday practice quickly.","zh":"在医生圈里，新指南可能很快就会改变日常诊疗方式。"},{"en":"She became well known in doctordom for her work on infectious diseases.","zh":"她因研究传染病而在医师界广为人知。"}]}],"synonyms":["medical profession","medical community","physicians (as a group)","medicine (as a profession)"],"phonetic":"/ˈdɑktərdəm/","extraExplanation":["“doctordom”较少见，常用于较正式或带一点幽默/评论的语境，类似“officialdom（官僚体系/官场）”这种构词方式。","后缀“-dom”表示“领域、状态或群体”（如 kingdom 王国，freedom 自由，officialdom 官场），所以 doctordom = “医生的领域/群体”。"]}
{"word":"doctored","summary":{"en":"“Doctored” usually means altered—often falsified—to mislead; it can also mean medically treated.","zh":"“doctored”通常指被改动（常为误导而篡改/伪造）；也可指接受医疗处理（尤指动物）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"changed or manipulated (often a document, photo, or data) to mislead or hide the truth; falsified.","zh":"（常指文件、照片或数据）被篡改的；被伪造的；被动过手脚的（常含误导之意）。"},"examples":[{"en":"The reporter suspected the image had been doctored.","zh":"记者怀疑这张图片被动过手脚。"},{"en":"They found doctored records in the company’s files.","zh":"他们在公司的档案里发现了被篡改的记录。"},{"en":"The video looked real, but it was doctored to change the timeline.","zh":"视频看起来很真实，但它被剪改过以改变时间线。"}]},{"partOfSpeech":"adj.","definition":{"en":"treated with medicine or given medical care (especially for an animal).","zh":"（尤指动物）接受治疗的；被用药处理的。"},"examples":[{"en":"The rescued dog was doctored and then adopted.","zh":"那只获救的狗接受了治疗，后来被领养了。"},{"en":"The vet doctored the horse’s injured leg.","zh":"兽医治疗了那匹马受伤的腿。"}]},{"partOfSpeech":"v.","definition":{"en":"past tense/past participle of “doctor”: to change, adjust, or repair something (sometimes dishonestly).","zh":"“doctor”的过去式/过去分词：修改、处理或修理某物（有时带不诚实的意味）。"},"examples":[{"en":"Someone doctored the numbers before the report was sent.","zh":"在报告发出前，有人把数字动了手脚。"},{"en":"He doctored the old bike so it could run again.","zh":"他把那辆旧自行车修修补补，让它又能骑了。"}]}],"synonyms":["falsified","tampered (with)","altered","manipulated","edited"],"phonetic":"/ˈdɑktərd/","extraExplanation":["“doctor”除了名词“医生”，也常作动词表示“处理/修理/改动”。在新闻与法律语境里，doctored 常带明显负面含义，强调“为误导而篡改”（如 doctored photo/record/evidence）。在日常口语中也可中性表示“修修补补、稍作改造”，但要看上下文。","常见搭配：doctored photo（被修/被篡改的照片）、doctored evidence（被伪造/被篡改的证据）、doctored records/data（被篡改的记录/数据）。"]}
{"word":"doctoress","summary":{"en":"“Doctoress” is an old-fashioned word meaning a female doctor; modern English usually says “doctor.”","zh":"“doctoress”是“女医生”的过时说法；现代英语通常直接说“doctor”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(archaic) A female doctor; a woman who is a doctor.","zh":"（过时用法）女医生；女性医生。"},"examples":[{"en":"In older novels, you may see the word “doctoress,” but today we usually just say “doctor.”","zh":"在一些较老的小说里你可能会看到“doctoress”，但现在我们通常只说“doctor”。"},{"en":"The newspaper introduced her as a “doctoress,” a term that sounds old-fashioned now.","zh":"报纸把她介绍为“doctoress”，但这个词现在听起来很老派。"}]}],"synonyms":["female doctor","woman doctor","physician"],"phonetic":"/ˈdɑktərɪs/","extraExplanation":["“doctoress”是在英语里用 -ess 构成“女性职业/身份”的旧式说法（如 actress, waitress）。现代英语更强调职业称呼的性别中立，因此一般不用“doctoress”，直接说 doctor 或 physician。使用“woman doctor / female doctor”也可以，但通常只有在性别信息与语境相关时才需要特别说明。"]}
{"word":"doctorette","summary":{"en":"A dated, sometimes offensive word meaning “a woman doctor.”","zh":"一个过时且有时带冒犯的词，意思是“女医生”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(dated, sometimes offensive) A woman doctor; a female physician (often used in a patronizing way).","zh":"（过时，且有时带冒犯）女医生；女医师（常带轻视或居高临下的语气）。"},"examples":[{"en":"The old newspaper referred to her as a “doctorette,” even though she was a fully qualified surgeon.","zh":"那份老报纸称她为“doctorette（女医生）”，尽管她是一名完全合格的外科医生。"},{"en":"Please don’t call her a doctorette—she’s Dr. Chen.","zh":"请不要叫她doctorette——她是陈医生。"}]}],"synonyms":["woman doctor","female doctor","physician","doctor"],"phonetic":"/ˌdɑk.təˈrɛt/","extraExplanation":["“doctorette”由“doctor + -ette”（表示“小的/女性的”后缀，如“kitchenette”）构成。在现代英语里，这种把职业名词加“-ette”来强调“女性/较小”的说法常被认为带有贬低或不专业的意味，因此在正式场合应避免。","更自然且尊重的说法是“doctor / physician”或直接用“Dr. + 姓”。如果需要强调性别（很多时候并不需要），可用“woman doctor / female doctor”，但也可能显得刻意。"]}
{"word":"doctorfish","summary":{"en":"Doctorfish is a tropical surgeonfish, known for sharp spines near its tail.","zh":"Doctorfish指一种热带刺尾鱼（外科医生鱼），以尾部附近的锋利硬刺著称。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a type of tropical marine fish (a kind of surgeonfish), especially the doctorfish found in the Atlantic and Caribbean; it often has sharp spine-like structures near its tail.","zh":"一种热带海水鱼（刺尾鱼/“手术鱼”的一种），尤指大西洋与加勒比海的“doctorfish（外科医生鱼）”；其尾部附近常有锋利的刺状结构。"},"examples":[{"en":"We saw a school of doctorfish grazing on algae near the reef.","zh":"我们看到一群doctorfish在珊瑚礁附近啃食藻类。"},{"en":"Be careful when handling a doctorfish—it can cut you with the spine near its tail.","zh":"抓拿doctorfish时要小心——它尾部附近的尖刺可能会划伤你。"}]}],"synonyms":["surgeonfish","Atlantic surgeonfish"],"phonetic":"/ˈdɑːktərˌfɪʃ/","extraExplanation":["“doctorfish”常被认为是“surgeonfish（刺尾鱼）”的俗名之一，名称里的“doctor/外科医生”与它尾柄两侧像手术刀一样的硬刺有关（许多刺尾鱼都有这种结构）。","在不同地区，“doctorfish”有时也会被用来泛指某些刺尾鱼，因此在科普或学术语境里更常用具体物种名或“surgeonfish”。"]}
{"word":"doctorfishes","summary":{"en":"Doctorfishes = more than one doctorfish (a tropical surgeonfish/tang).","zh":"Doctorfishes 是 doctorfish 的复数，指多条“医生鱼”（一种热带刺尾鱼/倒吊类）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of doctorfish: tropical reef fish (a kind of surgeonfish/tang) found especially in the Atlantic and Caribbean.","zh":"doctorfish 的复数：一种生活在热带珊瑚礁（尤其是大西洋与加勒比海）的鱼类，属于刺尾鱼/“海医生鱼”（surgeonfish/tang）的一类。"},"examples":[{"en":"Doctorfishes often graze on algae along the reef.","zh":"Doctorfishes 常在珊瑚礁边啃食藻类。"},{"en":"We saw a school of doctorfishes near the shallow coral garden.","zh":"我们在浅水珊瑚花园附近看到一群 doctorfishes。"}]}],"synonyms":["surgeonfishes","tangs"],"phonetic":"/ˈdɑktərˌfɪʃɪz/","extraExplanation":["“doctorfish”是俗名（common name），不同地区可能指不同的刺尾鱼类；在西大西洋常指 Acanthurus chirurgus（英语也常叫 doctorfish 或 surgeonfish）。","它们尾柄两侧通常有像“手术刀”一样锋利的骨刺，因此很多相关鱼类统称 surgeonfish（“外科医生鱼”）。"]}
{"word":"doctorhood","summary":{"en":"Doctorhood means the status or condition of being a doctor.","zh":"Doctorhood 指“作为医生的身份或状态（阶段）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the state, rank, or period of being a doctor; the professional status of a physician (or sometimes a person with a doctoral degree)","zh":"医生（或博士）的身份/地位；行医（或取得博士学位后）的状态或时期"},"examples":[{"en":"After years of training, she finally entered doctorhood and began treating patients on her own.","zh":"经过多年培训，她终于成为医生，并开始独立接诊。"},{"en":"He spoke about the responsibilities of doctorhood, especially the duty to do no harm.","zh":"他谈到医生身份所承担的责任，尤其是“不伤害”的义务。"},{"en":"In the memoir, doctorhood is described as both a privilege and a burden.","zh":"在这本回忆录里，“做医生”既被描述为一种特权，也是一种负担。"}]}],"synonyms":["being a doctor","medical career","the medical profession","doctoring"],"phonetic":"/ˈdɑk.tɚ.hʊd/","extraExplanation":["“doctorhood”比较少见，更多时候会用：the medical profession（医学/医疗行业）、being a doctor（当医生）、doctoring（行医）。","后缀 -hood 表示“身份、状态、时期或群体”，常见于：childhood（童年）、motherhood（母职/母性）、brotherhood（兄弟情谊/兄弟会）。因此 doctorhood 直观意思就是“医生的身份/阶段”。"]}
{"word":"doctorial","summary":{"en":"Doctorial means relating to a doctor, especially a PhD or a doctoral degree, but it is uncommon; “doctoral” is usually preferred.","zh":"doctorial 指与“医生/博士（尤其是博士学位）”有关，但较少用；通常更推荐用 doctoral。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a doctor or doctors, especially to an academic doctor (PhD) or the degree of doctor.","zh":"与“博士/博士学位”或“医生”有关的；尤指与博士（PhD）或博士学位相关的。"},"examples":[{"en":"She is finishing her doctorial research in sociology.","zh":"她正在完成社会学方向的博士研究。"},{"en":"He wore doctorial robes at the graduation ceremony.","zh":"他在毕业典礼上穿着博士礼袍。"}]}],"synonyms":["doctoral","doctorly"],"phonetic":"ˌdɑkˈtɔriəl","extraExplanation":["“doctorial”在现代英语中比较少见，更常用、更自然的说法是“doctoral”（如：doctoral degree / doctoral program / doctoral dissertation）。在正式写作里通常建议用“doctoral”，除非你引用的原文或特定文体明确用“doctorial”。","容易混淆的词：medical（医学的、医疗的）主要指医疗领域；doctorial/doctoral更偏“博士学位/博士身份”或“医生这一称谓”的关联，语境不同。"]}
{"word":"doctorial tutor","summary":{"en":"a tutor/mentor connected to PhD-level study","zh":"与博士（PhD）学习相关的导师/辅导者"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A tutor or instructor who is a doctoral student or who provides support at the PhD (doctoral) level, especially in a university setting.","zh":"博士生助教/导师，或提供博士（PhD）层次学术辅导的人，常见于大学环境。"},"examples":[{"en":"My doctoral tutor helped me shape my research question and reading list.","zh":"我的博士导师帮我完善研究问题和阅读书目。"},{"en":"The department assigned a doctoral tutor to guide new students through their first year.","zh":"学院安排了一位博士导师来指导新生度过第一年。"}]},{"partOfSpeech":"phrase","definition":{"en":"A tutor responsible for doctoral students’ academic progress and mentoring (common in some university systems).","zh":"负责博士生学业进展与学术指导的导师（在某些高校体系中较常见）。"},"examples":[{"en":"You should meet your doctoral tutor at least once each semester to review your progress.","zh":"你应该每学期至少见一次博士导师来回顾进展。"}]}],"synonyms":["PhD tutor","doctoral mentor","PhD mentor","academic mentor","graduate tutor","research mentor"],"phonetic":"/ˈdɑk.tɚ.əl ˈtuː.t̬ɚ/","extraExplanation":["你输入的“doctorial”在现代英语中很少用；更常见、最自然的表达是“doctoral tutor”。","不同国家/学校对该称呼的含义不完全一致：有的指“博士生本人担任的辅导老师”（类似graduate teaching assistant），有的指“负责指导博士生的导师/学术顾问”。写作时可以用更明确的说法，如 “PhD supervisor”（论文导师）或 “PhD tutor/mentor”（学术导师/指导老师）。"],"etymology":"“doctoral”来自拉丁语 doctor（老师、学者）发展出的学位用法，表示“博士层级的”；“tutor”来自拉丁语 tutor（监护人、指导者），后来在英语里常指“辅导者/导师”。两者组合即“博士层级的导师/辅导者”。","mnemonic":["doctoral = doctor（博士/博士学位）+ -al（形容词后缀）→ “博士层级的”。","tutor 记成“图（t）+导（tutor像‘导师’）”：tutor = 导师/辅导老师。"]}
{"word":"doctorially","summary":{"en":"“Doctorially” means “in a doctor-like or medically related way,” and more rarely “in a way related to a doctoral degree.”","zh":"“doctorially”表示“像医生/与医学有关地”，较少见也可指“与博士学位相关地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to a doctor or medical practice; as a doctor would.","zh":"以医生/医学的方式；像医生那样。"},"examples":[{"en":"She spoke doctorially, using calm medical terms to explain the treatment.","zh":"她用医生式的语气说话，用冷静的医学术语解释治疗方案。"},{"en":"He nodded doctorially and told the patient to rest and drink water.","zh":"他像医生那样点点头，嘱咐病人休息、多喝水。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to a doctoral degree (PhD, etc.); as part of doctoral status or work.","zh":"以博士（学位）相关的方式；就博士身份/研究而言。"},"examples":[{"en":"Doctorially, her research focuses on early childhood language development.","zh":"从博士研究角度来说，她的研究关注幼儿语言发展。"},{"en":"The topic was discussed doctorially rather than practically.","zh":"这个话题被以偏学术（博士式）的方式讨论，而不是从实际角度。"}]}],"synonyms":["medically","clinically","professionally","as a doctor would","academically (in some contexts)"],"phonetic":"/ˌdɑkˈtɔriəli/","extraExplanation":["“doctorially”比较少见，更常见的说法是“medically”（医学上/在医疗方面）或“like a doctor”（像医生一样）。如果想表达“与博士学位有关”，也有人用“doctorally”（同样较少见）。","词尾“-ly”常把形容词变成副词，表示“以……的方式”。这里来自“doctor”/“doctoral”。"]}
{"word":"doctoring","summary":{"en":"“Doctoring” can mean medical treatment/practice, or (more often) altering something—sometimes dishonestly; it’s also the -ing form of the verb “doctor.”","zh":"“Doctoring”可指行医/医疗；也常指对某物动手脚、篡改（多带不诚实意味）；同时也是动词“doctor”的-ing形式。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"The practice of treating sick or injured people (medical care).","zh":"行医；医疗（对病人或伤者的治疗与照护）。"},"examples":[{"en":"She considered a career in doctoring because she likes helping people.","zh":"她考虑从事行医工作，因为她喜欢帮助别人。"},{"en":"In rural areas, doctoring can include both clinic work and home visits.","zh":"在农村地区，行医可能既包括诊所工作，也包括上门看诊。"}]},{"partOfSpeech":"n.","definition":{"en":"The act of altering something to change how it looks or works—often in a dishonest way (to doctor).","zh":"篡改；伪造；动手脚（为改变外观或效果，常带有不诚实的意味）。"},"examples":[{"en":"The report showed signs of doctoring before it was submitted.","zh":"报告显示在提交前被动过手脚。"},{"en":"He was accused of doctoring the photos to hide the damage.","zh":"他被指控篡改照片以掩盖损坏情况。"},{"en":"Be careful—some online reviews involve doctoring to mislead customers.","zh":"要小心——一些网评可能经过“动手脚”来误导消费者。"}]},{"partOfSpeech":"v.","definition":{"en":"Present participle/gerund of “doctor”: treating someone medically or altering something (often dishonestly).","zh":"“doctor”的现在分词/动名词：给人看病；或（常指不诚实地）篡改某物。"},"examples":[{"en":"He spent the afternoon doctoring injured animals at the shelter.","zh":"他下午在收容所给受伤的动物治疗。"},{"en":"They were caught doctoring the numbers in the spreadsheet.","zh":"他们被抓到在表格里篡改数据。"}]}],"synonyms":["medical practice","medical care","tampering","falsifying","manipulating"],"phonetic":"/ˈdɑktərɪŋ/","extraExplanation":["“doctor”作动词时有两条常见路线：一是“给……治病”（中性/正面）；二是“对……动手脚、篡改”（多为负面语境）。因此“doctoring”在不同场合可能语气差很多，要靠上下文判断。","名词“doctoring”在“行医/医疗”这个义项里比较书面或较少见；日常更常说“medical practice / medical care”。","与“篡改”相关的近义表达包括：tampering（动手脚）、falsifying（伪造）、manipulating（操纵/加工，语气可中性或负面）。不同词的“恶意/违法”程度不同。"]}
{"word":"doctorization","summary":{"en":"Doctorization is a rare noun meaning either (1) making someone a doctor/turning a field more doctor-like, or (2) doctoring—dishonestly altering something (especially records).","zh":"Doctorization 是较少见的名词，可指（1）使人成为医生/让某领域更“医生化”，也可指（2）篡改、伪造（尤指记录）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the act or process of making someone into a doctor or giving something a “doctor-like” status (rare usage)","zh":"使某人成为医生／赋予“博士或医生”身份的行为或过程（较少见的用法）"},"examples":[{"en":"In some older writings, “doctorization” refers to the formal training that turns a student into a doctor.","zh":"在一些较旧的文字里，doctorization 指把学生培养成医生的正规训练过程。"},{"en":"The article discussed the doctorization of the profession—how it became more regulated and credential-based.","zh":"那篇文章讨论了该职业的“医生化”——它如何变得更受监管、更依赖资格证书。"}]},{"partOfSpeech":"n.","definition":{"en":"the act of doctoring—changing or manipulating something (especially a document, data, or a product), often in a dishonest way (rare; more common: “doctoring”)","zh":"篡改、伪造或动手脚的行为（尤指文件、数据或产品；常带不诚实含义；较少见，更常用 doctoring）"},"examples":[{"en":"The investigation found doctorization of the financial records.","zh":"调查发现财务记录被篡改。"},{"en":"Any doctorization of the evidence could lead to serious legal trouble.","zh":"任何对证据的篡改都可能导致严重的法律问题。"}]}],"synonyms":["doctoring","falsification","tampering","professionalization","credentialing"],"phonetic":"/ˌdɑk.tə.rəˈzeɪ.ʃən/","extraExplanation":["“doctorization”在现代英语里非常少见，通常会用更自然的表达来替代：\n- 表示“篡改”：更常说 doctoring（the doctoring of records / doctored evidence）。\n- 表示“成为医生/博士”或“职业化”：更常说 medical training, professionalization, credentialing，或在学术语境用 doctoral training。"]}
{"word":"doctorize","summary":{"en":"Doctorize means to tamper with or falsify something, or to adulterate a product; it can also (less commonly) mean to treat medically.","zh":"Doctorize 指篡改/伪造（文件、数据等）或掺假（食品、产品）；较少情况下也可指治疗。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to change, falsify, or tamper with something (such as a document, photo, or data), often to make it misleading or dishonest","zh":"（常指不诚实地）篡改、伪造、动手脚（如文件、照片、数据等）"},"examples":[{"en":"Someone had doctorized the report to hide the company’s losses.","zh":"有人篡改了报告，以掩盖公司的亏损。"},{"en":"The image looked real, but it had been doctorized.","zh":"这张图片看起来很真实，但其实被修过（动过手脚）。"}]},{"partOfSpeech":"vt.","definition":{"en":"to add something to food, drink, or a product—often secretly—so it becomes different or unsafe (for example, to dilute or adulterate it)","zh":"（常指暗中）掺入、掺假、掺杂（使食物/饮料/产品变质或不安全）"},"examples":[{"en":"The milk was doctorized with water to increase profits.","zh":"牛奶被掺了水以增加利润。"},{"en":"They warned travelers not to buy doctorized alcohol.","zh":"他们提醒旅客不要买掺假的酒。"}]},{"partOfSpeech":"vt.","definition":{"en":"(less common) to treat or give medical care to someone","zh":"（较少用）给……看病、治疗"},"examples":[{"en":"The field medic doctorized the injured soldiers as best as he could.","zh":"战地医护尽力为受伤的士兵治疗。"}]}],"synonyms":["doctor","tamper with","falsify","manipulate","adulterate","dilute"],"phonetic":"/ˈdɑktəˌraɪz/","extraExplanation":["“doctorize”在现代英语里不算常用，更常见的说法是“doctor”（篡改）或“tamper with”“falsify”“adulterate”。","它通常带明显的负面含义：暗示为了欺骗或牟利而“动手脚”。在正式写作中，谈文件/数据常用“falsify”；谈食品/药品掺假常用“adulterate”。"]}
{"word":"doctorless","summary":{"en":"“Doctorless” means ‘without a doctor’ or ‘lacking doctors/medical care.’","zh":"“doctorless”意为“没有医生的；缺乏医生或医疗照护的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Without a doctor; lacking medical care or access to a doctor.","zh":"没有医生的；缺乏医生或医疗照护的。"},"examples":[{"en":"In some remote villages, people can be effectively doctorless for months.","zh":"在一些偏远村庄里，人们可能几个月都处于“没有医生可看”的状态。"},{"en":"After the clinic closed, the neighborhood became doctorless at night.","zh":"诊所关门后，这个社区在夜间就变成了“缺乏医生”的地方。"}]},{"partOfSpeech":"adj.","definition":{"en":"Not having a doctor as part of a team, service, or organization.","zh":"（团队/机构/服务）没有配备医生的。"},"examples":[{"en":"The event provided first aid but was doctorless, so serious cases were sent to the hospital.","zh":"活动现场提供急救，但没有配备医生，因此严重情况会被送往医院。"},{"en":"They run a doctorless hotline that gives general health advice, not diagnoses.","zh":"他们运营一条不配备医生的热线，只提供一般健康建议，不做诊断。"}]}],"synonyms":["without a doctor","lacking doctors","underserved","medically underserved"],"phonetic":"/ˈdɑktɚləs/","extraExplanation":["“doctorless”较少见，多用于强调“缺乏医生/医疗资源”的处境，常见于公共卫生、乡村医疗或医疗服务不足的语境。","词缀“-less”表示“没有……的/缺乏……的”，类似的词有：homeless（无家可归的）、jobless（失业的）、childless（无子女的）。","实际写作中，有时也会用更常见的表达：without a doctor / lacking doctors / no doctor available。"]}
{"word":"doctorlike","summary":{"en":"“Doctorlike” means “like a doctor” in behavior, tone, or style.","zh":"“doctorlike”表示“像医生一样”的行为、语气或风格。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having qualities typical of a doctor; behaving in a professional, medical, or clinically calm way.","zh":"像医生的；具有医生典型特质的；表现得很专业、医学化或冷静客观的。"},"examples":[{"en":"She spoke in a doctorlike tone, calm and reassuring.","zh":"她用一种很“医生式”的语气说话，冷静而让人安心。"},{"en":"His doctorlike attention to detail made the patient feel safe.","zh":"他像医生一样注重细节，让病人觉得很安心。"}]}],"synonyms":["doctorly","clinical","professional","medical"],"phonetic":"ˈdɑktərˌlaɪk","extraExplanation":["“doctorlike”由 doctor + 后缀 -like 组成，-like 表示“像……一样/具有……特征”。这个词不算高频，更常见的表达有 “like a doctor”, “doctorly”（较书面/较少见）, 或 “clinical”（偏“冷静客观/临床式”的语气）。"]}
{"word":"doctorly","summary":{"en":"“Doctorly” means doctor-like—showing a doctor’s professional manner or authority; it can also mean “in a doctor-like way,” though it’s uncommon today.","zh":"“doctorly”意为“像医生的”，指带有医生的专业作风或权威感；也可作副词表示“以医生般的方式”，但如今不太常用。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Like a doctor; showing the manner, authority, or professional knowledge associated with a medical doctor (often used humorously or in older writing).","zh":"像医生的；带有医生式的（权威、专业、作风等）（常带幽默感或偏旧式用法）。"},"examples":[{"en":"He gave me a very doctorly explanation of my symptoms.","zh":"他用一种很“医生式”的方式向我解释了我的症状。"},{"en":"She nodded in a doctorly way and told me to rest more.","zh":"她很“医生式”地点点头，然后叫我多休息。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a manner like a doctor; in a professional or authoritative way (uncommon).","zh":"以医生般的方式；以一种专业或权威的方式（不常见）。"},"examples":[{"en":"He spoke doctorly, as if he were certain about the diagnosis.","zh":"他说话很“医生口吻”，好像对诊断非常确定。"}]}],"synonyms":["doctor-like","medical","professional","clinical","authoritative"],"phonetic":"/ˈdɑk.tɚ.li/","extraExplanation":["“doctorly”在现代英语里比较少见，更常见的表达是“medical”“doctor-like”“professional”“clinical”等。","它常用于描述“语气/态度”而不一定指真正的医生，有时带一点调侃意味：像医生那样一本正经、讲专业术语、给建议等。","词形来自“doctor + -ly”。这里的“-ly”可以构成形容词（如“manly”阳刚的），也可以构成副词（如“slowly”慢慢地），所以“doctorly”两种词性都可能出现。"]}
{"word":"doctors","summary":{"en":"“Doctors” most commonly means medical doctors; it can also mean people with doctorate degrees (PhDs).","zh":"“doctors”最常指“医生”，也可指“博士（拥有博士学位的人）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"medical professionals who treat people who are sick or injured (plural of “doctor”).","zh":"医生；医师（“doctor”的复数）：为生病或受伤的人提供诊断与治疗的医疗专业人员。"},"examples":[{"en":"The doctors at the hospital worked all night to save the patient.","zh":"医院里的医生们通宵工作来抢救病人。"},{"en":"Many doctors recommend regular exercise and enough sleep.","zh":"许多医生建议规律运动并保证充足睡眠。"}]},{"partOfSpeech":"n.","definition":{"en":"people who have the highest university degree (a doctorate), such as a PhD; used as a title (plural of “doctor”).","zh":"博士；拥有博士学位的人（如 PhD）；也可作头衔（“doctor”的复数）。"},"examples":[{"en":"The conference invited doctors from many universities to speak.","zh":"会议邀请了来自许多大学的博士来演讲。"},{"en":"Two doctors of philosophy led the research team.","zh":"两位哲学博士带领了研究团队。"}]}],"synonyms":["physicians (medical)","medical doctors","MDs","PhDs (academic, informal)"],"phonetic":"/ˈdɑk.tɚz/","extraExplanation":["在日常英语里，“doctor”最常指“医生”。当指“博士”时，常出现在学术语境中（例如：a doctor of physics）。有时用作称呼（Dr. Smith），一般写作“Dr.”。","复数“doctors”通常表示“多位医生/博士”。如果你想表达“去看医生”，更常见的说法是“go to the doctor”或“see a doctor”。"]}
{"word":"Doctors Without Borders","summary":{"en":"An international medical humanitarian aid organization.","zh":"国际医疗人道救援组织。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"An international medical humanitarian organization that provides emergency aid in conflict zones, during epidemics, after natural disasters, and where health care is lacking.","zh":"一个国际医疗人道主义组织，在战争冲突、传染病暴发、自然灾害等紧急情况下，以及医疗资源匮乏地区提供救援与医疗服务。"},"examples":[{"en":"Doctors Without Borders set up a field hospital after the earthquake.","zh":"地震后，无国界医生搭建了一个野战医院。"},{"en":"She donated to Doctors Without Borders to support medical care in war zones.","zh":"她向无国界医生捐款，支持战区的医疗救助。"}]}],"synonyms":["Médecins Sans Frontières","MSF"],"phonetic":"/ˈdɑk.tɚz wɪˈðaʊt ˈbɔr.dɚz/","extraExplanation":["常见缩写：MSF（来自法语名 Médecins Sans Frontières）。新闻报道和学术写作中经常先写全称，再在括号里标注缩写：Doctors Without Borders (MSF)。","它是独立的非政府组织（NGO），以医疗中立、紧急救援为核心原则；1999年获得诺贝尔和平奖。","写法提示：在英语中通常大写每个实词（Doctors Without Borders），属于专有名词；口语中也有人说“MSF”。"],"etymology":"源自组织的英文名称“Doctors Without Borders”，对应法语名“Médecins Sans Frontières（MSF）”，直译为“没有国界的医生”，强调跨越国界提供医疗援助的理念。","mnemonic":["把“without borders”理解成“无国界/不受边界限制”，联想中文常用译名“无国界医生”。","记缩写 MSF：M=Medical（医疗），S=Sans（没有，法语），F=Frontières（边界）。"]}
{"word":"doctorship","summary":{"en":"“Doctorship” is a rare noun meaning the role or tenure of being a doctor; in older usage it can also mean “doctorate.”","zh":"“Doctorship”是较少见的名词，指担任医生的身份/职位或任期；较旧用法中也可指“博士学位（doctorate）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the position, role, or period of serving as a doctor (a physician or someone addressed as “Doctor”)","zh":"医生（或被称为“Doctor”的人）的职位、身份，或担任医生的时期"},"examples":[{"en":"During his doctorship at the rural clinic, he treated many families who had never seen a specialist.","zh":"在乡村诊所担任医生期间，他为许多从未见过专科医生的家庭看病。"},{"en":"Her doctorship brought heavy responsibility, especially during the flu season.","zh":"她的医生身份带来沉重责任，尤其在流感季节。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a doctoral degree; the status of having the title “Doctor” (similar to “doctorate”)","zh":"（罕见）博士学位；拥有“Doctor”头衔的身份（类似 doctor ate）"},"examples":[{"en":"In older writing, you may see “doctorship” used where today we would say “doctorate.”","zh":"在较早的写作中，你可能会看到用 doctorship 来表达今天常说的 doctorate（博士学位）。"}]}],"synonyms":["doctorate","medical practice","position as a doctor","physicianship (rare)","doctorhood (rare)"],"phonetic":"/ˈdɑk.tɚ.ʃɪp/","extraExplanation":["“doctorship”在现代英语中很少用，常见替代表达是：medical practice（行医/医疗工作）、position as a doctor（医生职位/身份），或在学位意义上用 doctorate（博士学位）。","结尾“-ship”常表示“身份/职位/状态/任期”，如 friendship（友谊）、leadership（领导力/领导层）、membership（会员身份）。因此 doctorship 直观上就是“医生这一身份/职位”。"]}
{"word":"doctress","summary":{"en":"“Doctress” means a female doctor; it’s an older, less common term today.","zh":"“doctress”指女医生；如今多为较旧、较少用的说法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A female doctor (especially a physician); a feminine form of “doctor,” now often considered old-fashioned.","zh":"女医生（尤指内科医生）；“doctor”的阴性形式，如今常被认为有些过时。"},"examples":[{"en":"The novel introduces a doctress who treats poor families in the city.","zh":"小说中介绍了一位为城市贫困家庭看病的女医生。"},{"en":"In modern English, many people would simply say “doctor,” not “doctress.”","zh":"在现代英语里，很多人会直接说“doctor”，而不会说“doctress”。"}]}],"synonyms":["female doctor","woman doctor","physician"],"phonetic":"/ˈdɑktrəs/","extraExplanation":["“doctress”在19世纪到20世纪早期的英语里较常见，用来强调医生的性别。当时很多职业名词会用“-ess”（如 actress）来标记女性。","现代英语更倾向使用不标性别的职业称呼（gender-neutral），因此通常说“doctor”即可；若必须说明性别，可说“female doctor”，但在许多语境中也可能显得多余或不自然。","在阅读较老的文学作品、历史材料或带有时代风格的写作中，你可能会看到“doctress”，它往往带有一种“旧时代/维多利亚时期”的语感。"]}
{"word":"doctrina","summary":{"en":"Doctrina is a Latin/Spanish term meaning “doctrine” (a system of teachings or beliefs) and, more broadly, “instruction/education.”","zh":"Doctrina 是拉丁语/西班牙语词，常指“教义/信条”，也可泛指“教导、教育”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a doctrine; a body of teaching or beliefs (often used as a Latin or Spanish word in academic, religious, or historical contexts).","zh":"教义；一套教导或信条（常作为拉丁语或西班牙语词在学术、宗教或历史语境中使用）。"},"examples":[{"en":"In medieval texts, “doctrina” often refers to religious teaching.","zh":"在中世纪文本中，“doctrina”常指宗教教导。"},{"en":"The philosopher discussed how doctrina shapes moral behavior in a community.","zh":"这位哲学家讨论了教义（doctrina）如何塑造社群的道德行为。"}]},{"partOfSpeech":"n.","definition":{"en":"instruction; education; the act or practice of teaching (common in Latin usage).","zh":"教导；教育；教学行为或实践（拉丁语用法中较常见）。"},"examples":[{"en":"The manuscript praises doctrina as the path to wisdom.","zh":"手稿称赞“doctrina”（教育/教导）是通往智慧之路。"},{"en":"Good doctrina requires patience and clear explanations.","zh":"良好的“doctrina”（教学）需要耐心与清晰的解释。"}]}],"synonyms":["doctrine","teaching","instruction","creed","tenets"],"phonetic":"/dɑkˈtriːnə/","extraExplanation":["“Doctrina”源自拉丁语，和英语 doctrine（教义/主义）、doctrine of law（法律原则）、indoctrinate（灌输）同源，核心含义是“教导、教训、成体系的信念”。","在英语文章里出现“doctrina”时，往往是为了保持原文风格（如引述拉丁文、神学或中世纪文献），或在讨论西班牙语语境（如宗教教育、殖民史）时使用。","文学/经典语境中，拉丁文作者常用“doctrina”表达“学识、学问、教化”，有时带有“受过良好教育的修养”之意。"]}
{"word":"doctrinable","summary":{"en":"“Doctrinable” means teachable—able or willing to accept instruction or training.","zh":"“Doctrinable”表示“可教的、乐于受教的”，指容易接受指导或训练。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"able to be taught or instructed; teachable; receptive to instruction","zh":"可教的；可受教的；容易接受教导的"},"examples":[{"en":"Young children are often more doctrinable than adults because they are open to new ideas.","zh":"小孩子通常比成年人更“doctrinable”，因为他们更愿意接受新观念。"},{"en":"A good student is curious, patient, and doctrinable.","zh":"一个好学生应当好奇、有耐心，并且乐于受教。"}]}],"synonyms":["teachable","coachable","trainable","instructable","receptive"],"phonetic":"/ˈdɑk.trə.nə.bəl/","extraExplanation":["这个词比较少见，语感上接近 *teachable*（可教的）或 *docile*（温顺、易管教的）。它来自 *doctrine*（教义/学说/教导）+ *-able*（“能够……”）。在现代英语里更常用 *teachable*、*coachable*、*trainable*。","在语义上它有时带一点“接受某种观念/信条灌输”的色彩（尤其在宗教或意识形态语境），使用时注意场合，避免让人感觉是在暗示“易被洗脑”。"]}
{"word":"doctrinaire","summary":{"en":"Doctrinaire means overly rigid and theory-bound, refusing practical or opposing viewpoints.","zh":"Doctrinaire 指过分教条、拘泥理论，不顾现实或不愿接受不同观点。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Of a person or idea) too rigidly fixed on a set of beliefs or theories, and unwilling to consider practical realities or other viewpoints.","zh":"（指人或观点）教条主义的；过分拘泥于理论或信条的，不愿考虑现实情况或不同意见。"},"examples":[{"en":"The manager’s doctrinaire approach ignored what customers actually wanted.","zh":"经理的教条式做法忽视了顾客真正想要的东西。"},{"en":"We need flexible solutions, not doctrinaire rules that never change.","zh":"我们需要灵活的解决方案，而不是永远不变的教条规则。"}]}],"synonyms":["dogmatic","rigid","ideological","inflexible","uncompromising"],"phonetic":"/ˌdɑk.trəˈner/","extraExplanation":["“doctrinaire”常带负面色彩，强调“只讲理论/原则，不管现实效果”，常用于政治、教育、管理、宗教等语境。","词源上与“doctrine（教义、信条）”有关：doctrinaire 指“按教条行事的人/方式”。相近词：dogmatic（武断的）、rigid（僵化的）；反义倾向：pragmatic（务实的）、flexible（灵活的）。","文学/评论写作中常用来批评某种立场“高举原则却缺乏人情或现实判断”，例如：a doctrinaire critic（教条的评论家）。"]}
{"word":"doctrinairism","summary":{"en":"Doctrinairism means rigid, impractical adherence to doctrine or theory.","zh":"doctrinairism 指拘泥理论与教条、缺乏务实性的“教条主义”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Often critical) rigid or overly theoretical attachment to doctrines or principles, especially in a way that ignores practical realities.","zh":"（常含贬义）教条主义；过度拘泥于理论或原则，尤其指忽视现实可行性。"},"examples":[{"en":"Her proposal was criticized for doctrinairism because it ignored how people actually live.","zh":"她的提案被批评为教条主义，因为它无视人们真实的生活方式。"},{"en":"Doctrinairism can make good intentions fail when conditions change.","zh":"当环境变化时，教条主义会让善意的目标也难以实现。"}]}],"synonyms":["doctrinarism","dogmatism","rigidity","orthodoxy","ideology (context-dependent)"],"phonetic":"/ˌdɑk.trəˈner.ɪz.əm/","extraExplanation":["这个词较少见，更常见的是 doctrinarism 或 doctrinaire（形容人“教条的、空谈理论的”）。它源自法语 doctrinaire，历史上常用来指只会讲原则、却缺乏现实操作感的人或思想。","语感上它通常带批评意味：不是“有原则”，而是“死守原则到不近人情或不切实际”。"]}
{"word":"doctrinal","summary":{"en":"Doctrinal means related to a doctrine or established system of beliefs/teachings, often in religion, politics, or law.","zh":"doctrinal 指“与教义/信条/学说体系有关的”，常用于宗教、政治或法律等正式语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to a doctrine: a set of beliefs or teachings, especially in religion, politics, or law.","zh":"与教义/信条有关的；指一套信仰或教导（尤指宗教、政治或法律领域）。"},"examples":[{"en":"The debate was about doctrinal differences between the two churches.","zh":"这场辩论讨论的是两座教会之间的教义差异。"},{"en":"The group’s doctrinal position was written clearly in its founding document.","zh":"该团体的教义/信条立场在其创立文件中写得很清楚。"}]}],"synonyms":["dogmatic","ideological","theological"],"phonetic":"/dɑkˈtraɪnəl/","extraExplanation":["“doctrinal”常见于较正式的语境，尤其是宗教研究、政治思想与法律/政策讨论中。它通常强调“与某套既定教义或原则体系有关”，语气比“theoretical（理论的）”更偏向“信条/教条层面”。","词根提示：doctrine（教义/学说）+ -al（形容词后缀），表示“属于……的/与……相关的”。常见搭配有 doctrinal dispute（教义争端）、doctrinal statement（教义声明）、doctrinal purity（教义纯正）。"]}
{"word":"doctrinal-historical","summary":{"en":"An adjective describing something that combines doctrine (formal beliefs) with a historical perspective on how those beliefs developed.","zh":"形容把教义（正式信念体系）与其历史发展视角结合起来的。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to (1) doctrines or formal systems of beliefs and (2) the historical development or study of those beliefs over time—often used in theology, religion, philosophy, or law.","zh":"与（1）教义/信条等正式信念体系以及（2）这些信念在历史中的发展与研究相关的——常用于神学、宗教、哲学或法律语境。"},"examples":[{"en":"The course offers a doctrinal-historical overview of early Christian beliefs.","zh":"这门课从教义与历史的角度概述早期基督教信仰。"},{"en":"Her paper takes a doctrinal-historical approach rather than a purely sociological one.","zh":"她的论文采用教义—历史的研究路径，而不是纯粹的社会学视角。"},{"en":"The book explains the doctrinal-historical roots of the debate on religious freedom.","zh":"这本书解释了关于宗教自由争论的教义—历史渊源。"}]}],"synonyms":["theological-historical","doctrinal and historical","historical-theological","doctrinally oriented"],"phonetic":"/ˌdɑkˈtraɪnəl hɪˈstɔrɪkəl/","extraExplanation":["“doctrinal-historical”多见于学术写作，强调把“教义内容（doctrinal）”和“历史演变（historical）”结合起来看：既关注某一信条/主张是什么，也关注它如何在不同时期形成、被解释、被争论与被制度化。","该词常用于“doctrinal-historical approach/analysis/overview（教义—历史研究方法/分析/概述）”。在中文里常译作“教义史的”“教义与历史相结合的”。写作时也可不用连字符，写成“doctrinal and historical”，语气更口语、更松。"]}
{"word":"doctrinalism","summary":{"en":"Doctrinalism means an excessive or rigid focus on doctrine, especially in religious belief and teaching.","zh":"Doctrinalism 指对教义（尤指宗教信条）的过度或僵化强调，常带批评意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Strong emphasis on formal doctrines (especially in religion), sometimes to the point of being rigid or overly theoretical.","zh":"对（尤指宗教）教义的强烈强调；有时指过于僵化、过分理论化的教义至上倾向。"},"examples":[{"en":"Some critics say the movement slipped into doctrinalism and lost touch with everyday needs.","zh":"一些批评者说，这个运动陷入了教义至上，逐渐脱离了日常需求。"},{"en":"He rejected doctrinalism and focused on compassion in practice.","zh":"他反对教义主义，更强调在实践中体现慈悲。"}]},{"partOfSpeech":"n.","definition":{"en":"A way of thinking or teaching that treats correct doctrine as the main test of truth or membership.","zh":"一种思维或教学方式：把“教义是否正确”当作判断真理或群体归属的主要标准。"},"examples":[{"en":"Doctrinalism can create divisions when minor differences become major tests of loyalty.","zh":"当细微差异被当成忠诚度的大考验时，教义主义可能造成分裂。"},{"en":"The community valued discussion, but it tried to avoid doctrinalism.","zh":"这个社群重视讨论，但也尽量避免陷入教义至上。"}]}],"synonyms":["dogmatism","doctrinaire attitude","orthodoxy (sometimes)","rigidity"],"phonetic":"/ˌdɑkˈtraɪnəˌlɪzəm/","extraExplanation":["“doctrinalism”常见于宗教研究、神学讨论和社会评论中，语气往往带有批评意味：强调“信条/教义的正确性”多于强调实践、经验或伦理关怀。","词形来源于 doctrine（教义、信条）+ -al（形容词后缀）+ -ism（主义/倾向）。在英语语境里，-ism 常暗示一种立场或倾向，有时会带“过度化”的评价。"]}
{"word":"doctrinalist","summary":{"en":"A doctrinalist is someone who rigidly supports or follows a set of doctrines, often in religion or politics.","zh":"doctrinalist指严格支持或遵循某套教义/教条的人，常用于宗教或政治语境，语气往往偏批评。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who strongly supports, teaches, or strictly follows a set of official doctrines (especially in religion, politics, or law).","zh":"教义主义者；（尤指在宗教、政治或法律中）强烈支持、宣讲或严格遵循一套官方教义/教条的人。"},"examples":[{"en":"Some critics said he was a doctrinalist who cared more about the party line than real-world results.","zh":"一些批评者说他是个教义主义者，比起现实效果更在意党的路线。"},{"en":"In the debate, doctrinalists argued for strict adherence to traditional teachings.","zh":"在辩论中，教义主义者主张严格遵循传统教义。"}]}],"synonyms":["doctrinaire","dogmatist","ideologue","fundamentalist"],"phonetic":"/dɑkˈtraɪnəlɪst/","extraExplanation":["“doctrinalist”在现代英语中不算常见，更常见的相关词有“doctrinaire”（常带贬义，指死守教条、不顾实际的人）和“doctrinal”（形容词：教义的、教条的）。","语境上常见于宗教神学讨论、政治意识形态争论或法律解释（强调既有原则/学说）中；语气往往偏批评，暗示“过于僵化”。"]}
{"word":"doctrinality","summary":{"en":"Doctrinality means being strongly centered on doctrine or official teachings, often in religion, politics, or theory.","zh":"Doctrinality 指“以教义/官方学说为中心”的特质，常用于宗教、政治或理论讨论中。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being doctrinal; a strong focus on formal religious, political, or academic doctrines (official teachings)","zh":"教义性；（对宗教/政治/学术）教义或官方理论的强调、依附"},"examples":[{"en":"Some critics say the report values doctrinality over real-life results.","zh":"一些批评者认为这份报告过于强调教义性，而忽视了现实成效。"},{"en":"The debate shifted from practical concerns to questions of doctrinality.","zh":"辩论从实际问题转向了关于教义性的讨论。"}]}],"synonyms":["doctrinalism","orthodoxy","dogmatism","doctrinism"],"phonetic":"/ˌdɑk.trəˈnæl.ə.ti/","extraExplanation":["“doctrinality”在现代英语中相对少见，更多见于神学、宗教学、思想史或批评性写作中，用来讨论某个体系或观点是否“以教义为中心/以教条为准”。","语气常带中性到批评色彩：强调条文与正统（doctrine）可能意味着更少的灵活性或更少对现实处境的关注。","常见相关词：doctrinal（adj. 教义的/教条的）、doctrine（n. 教义；学说）、orthodoxy（n. 正统）、dogmatism（n. 教条主义）。"]}
{"word":"doctrinalization","summary":{"en":"Doctrinalization is the process of making something into an official or rigid doctrine.","zh":"Doctrinalization 指把某事物变成官方或僵化的教义/信条的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of turning an idea, practice, or policy into an official doctrine (a fixed set of beliefs), often making it more rigid or formal","zh":"把某种观点、做法或政策“教义化/教条化”的过程；使之成为官方或固定的信条，通常也会让其更僵化、更正式"},"examples":[{"en":"Some critics argue that the doctrinalization of the movement made it less open to new ideas.","zh":"一些批评者认为，这场运动的教义化使它更不愿接受新观点。"},{"en":"The report warns against the doctrinalization of workplace rules that should stay flexible.","zh":"报告警告不要把本应保持灵活的职场规定教条化。"}]}],"synonyms":["dogmatization","codification","institutionalization","orthodoxization"],"phonetic":"/ˌdɑk.trə.nə.ləˈzeɪ.ʃən/","extraExplanation":["“doctrinalization”常见于学术或评论语境（政治学、宗教学、社会运动研究等）。它强调从“讨论中的观点/实践”变成“被规定必须遵守的信条或正统”的转变，因此常带有批评色彩，暗示僵化、排他或不容异议。","词形上：doctrine（教义/信条）→ doctrinal（教义的）→ doctrinalize（使教义化）→ doctrinalization（名词：过程）。在日常英语中，这个词相对少见，更常见的近义表达是“dogmatization（教条化）”或“institutionalization（制度化）”，但后者不一定带“信条/正统”的含义。"]}
{"word":"doctrinalizing","summary":{"en":"“Doctrinalizing” means presenting ideas as fixed doctrine—often in a rigid, dogmatic way.","zh":"“doctrinalizing”指把观点当作不可质疑的教义来宣讲，常含“教条化、僵化”的批评意味。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(present participle of “doctrinalize”) teaching or presenting ideas as a fixed doctrine (a set of official beliefs), often in a rigid way.","zh":"（doctrinalize 的现在分词）把观点当作固定教义来宣讲或包装，常带有僵化、教条化的意味。"},"examples":[{"en":"Some critics argue the training is doctrinalizing politics instead of encouraging open discussion.","zh":"一些批评者认为这项培训是在把政治教条化，而不是鼓励开放讨论。"},{"en":"The speaker kept doctrinalizing complex issues into simple rules.","zh":"演讲者不断把复杂问题教条化成简单规则。"}]},{"partOfSpeech":"v.","definition":{"en":"(less common) turning something into an official doctrine or formal set of beliefs.","zh":"（较少见）使某事变成正式教义或成体系的信条。"},"examples":[{"en":"Over time, the movement began doctrinalizing its original values into a strict code.","zh":"随着时间推移，这个运动开始把最初的价值观教义化，变成一套严格准则。"}]}],"synonyms":["indoctrinating","dogmatizing","preaching","institutionalizing (beliefs)"],"phonetic":"ˈdɑk.trə.nəlˌaɪ.zɪŋ","extraExplanation":["“doctrinalizing”在日常英语里不算常见，更多出现在学术、宗教研究、政治评论等语境中，常带批评色彩，暗示“把问题说得像不可质疑的教条”。","词根来自“doctrine（教义/信条）”，后缀“-ize”常表示“使……化/使成为……”。相关词：doctrinal（教义的）、doctrinaire（教条主义的/教条主义者，常含贬义）。"]}
{"word":"doctrinally","summary":{"en":"“Doctrinally” means “in terms of doctrine/official teaching,” and sometimes “in a rigid, overly theoretical (doctrinaire) way.”","zh":"“doctrinally”意为“在教义/官方教导层面上”；有时也指“教条式地、过于拘泥理论地”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to doctrines (official teachings or beliefs), especially in religion, law, or a political system.","zh":"以教义（官方教导/信条）的方式；在宗教、法律或政治体系中，涉及教义或原则地。"},"examples":[{"en":"Doctrinally, the church teaches that forgiveness is essential.","zh":"在教义上，教会教导宽恕是必不可少的。"},{"en":"The two schools are doctrinally different even if they share similar practices.","zh":"这两个学派即使实践相似，在教义上也不同。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a rigid or strictly theoretical way, focused on formal principles rather than practical reality.","zh":"教条式地；拘泥于理论或正式原则，而非现实操作地。"},"examples":[{"en":"Doctrinally correct answers don’t always solve real-world problems.","zh":"教条上正确的答案并不总能解决现实问题。"},{"en":"He argued doctrinally, without considering what would work in practice.","zh":"他以教条式方式辩论，没有考虑实际可行性。"}]}],"synonyms":["theologically","dogmatically","in theory","ideologically"],"phonetic":"/ˌdɑk.trəˈnaɪ.kli/","extraExplanation":["“doctrinally”来自“doctrine（教义/信条/学说）+ -al（形容词后缀）+ -ly（副词后缀）”。常见搭配：doctrinally sound（教义上站得住脚）、doctrinally correct（教义上正确）。","语境上多见于宗教写作（theologically/doctrinally）、法律或政策讨论（doctrinally consistent），也可能带有批评意味，接近“dogmatically（武断地/教条地）”。"]}
{"word":"doctrinarian","summary":{"en":"Doctrinarian means someone (or something) rigidly devoted to a doctrine, often in an impractical way.","zh":"doctrinarian 指（人或做法）拘泥于某套信条或理论、过于僵化，常带批评意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who follows a set of beliefs or theories in a very strict way, often without being flexible or practical.","zh":"教条主义者；死守某套信条或理论的人（常指不够灵活、不够务实）。"},"examples":[{"en":"He’s a doctrinarian who refuses to change his mind, even when the facts are clear.","zh":"他是个教条主义者，即使事实很清楚也拒绝改变想法。"},{"en":"The team needed practical solutions, not a doctrinarian argument.","zh":"团队需要务实的解决方案，而不是教条式的争论。"},{"en":"She warned that being a doctrinarian can make you ignore real people’s needs.","zh":"她提醒说，做事太教条可能会让你忽视真实的人们需求。"}]},{"partOfSpeech":"adj.","definition":{"en":"Strictly following or promoting a fixed doctrine or theory; rigid and not practical.","zh":"教条的；拘泥于固定信条或理论的（常含“不切实际、过于僵化”的意思）。"},"examples":[{"en":"Their approach felt doctrinarian and out of touch with everyday life.","zh":"他们的做法显得很教条，脱离日常生活。"},{"en":"He gave a doctrinarian lecture that left no room for questions.","zh":"他做了一场教条式的讲座，几乎不给提问的空间。"}]}],"synonyms":["dogmatist","ideologue","purist","hard-liner","rigid"],"phonetic":"/ˌdɑk.trəˈner.i.ən/","extraExplanation":["“doctrinarian”来自“doctrine”（教义/信条/学说）。语气多为批评：强调“过度依赖理论、缺少弹性与现实感”。","与“idealistic（理想主义）”不同：doctrinarian 更强调“死守一套原则/理论”，不太在乎情境变化。","常见搭配：a doctrinarian stance/attitude（教条立场/态度），doctrinarian politics（教条政治）。近义词：dogmatist（教条主义者，常更强调“武断”）。"]}
{"word":"doctrinarianism","summary":{"en":"Doctrinarianism means rigidly following a doctrine or theory, often ignoring practical reality.","zh":"doctrinarianism 指教条主义：僵硬地遵循某种教义或理论，常忽视现实与实际需要。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A rigid, theory-driven approach to politics, religion, or ideas, where fixed doctrines are followed even when reality or practical needs suggest flexibility.","zh":"教条主义；以理论或教义为中心、过度僵化的思想或做法，即使现实与实际需要要求变通也坚持不改。"},"examples":[{"en":"Many voters were frustrated by the party’s doctrinarianism and wanted more practical solutions.","zh":"许多选民对该政党的教条主义感到沮丧，更希望看到务实的解决方案。"},{"en":"In the debate, her doctrinarianism made it hard for her to accept evidence that challenged her beliefs.","zh":"在辩论中，她的教条主义让她很难接受会挑战自身信念的证据。"},{"en":"The organization moved away from doctrinarianism and focused on helping people on the ground.","zh":"该组织逐渐摆脱教条主义，转而专注于一线的实际帮扶。"}]}],"synonyms":["dogmatism","ideological rigidity","rigidity","orthodoxy (often in a critical sense)"],"phonetic":"/ˌdɑktrəˈnɛriəˌnɪzəm/","extraExplanation":["词源上与 doctrine（教义/学说）有关，常带批评意味：不是在说“有原则”，而是在说“死守原则、忽视现实”。","在政治与思想评论中常见：doctrinarianism 往往与 pragmatism（务实主义）形成对比。","相关词：doctrinaire（教条主义者，名词/形容词），dogmatism（武断/教条，更强调自以为绝对正确的态度）。"]}
{"word":"doctrinarily","summary":{"en":"“Doctrinarily” means “in a way related to doctrine or official teachings,” often in religious or formal academic contexts.","zh":"“doctrinarily”表示“在教义/学说或官方原则层面上；以教义相关的方式”，常见于宗教或较正式的学术语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to doctrine (official teachings), especially religious doctrine; according to established teachings.","zh":"以教义的方式；与（尤指宗教）教义相关；按照既定教义。"},"examples":[{"en":"The two groups agree morally, but they differ doctrinarily.","zh":"两个团体在道德上看法一致，但在教义上存在分歧。"},{"en":"The policy is not doctrinarily required, but some churches encourage it.","zh":"这项做法并非教义上必须，但一些教会会鼓励这样做。"}]},{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to doctrine in any field (for example, law or politics); in terms of official principles or a formal set of beliefs.","zh":"（广义）在原则/学说层面；就官方原则或正式信条而言（如法律、政治等）。"},"examples":[{"en":"Doctrinarily, the party supports free trade, though members disagree in practice.","zh":"在原则层面，该党支持自由贸易，但在实践中成员意见不一。"},{"en":"The court’s view doctrinarily follows earlier cases.","zh":"从法理（原则）上看，法院的观点遵循了早期判例。"}]}],"synonyms":["doctrinally","theologically","in doctrine","in principle","officially"],"phonetic":"/ˌdɑk.trəˈner.ə.li/","extraExplanation":["“doctrinarily”来自“doctrine（教义/学说）+ -ary（形容词后缀）+ -ly（副词后缀）”。它更常见于宗教写作、神学讨论或较正式的学术/法律语境中。日常英语里，人们常用“in doctrine / doctrinally / in terms of doctrine”来表达类似意思。"]}
{"word":"doctrinarism","summary":{"en":"Doctrinarism means rigid adherence to a doctrine, often ignoring practical realities.","zh":"doctrinarism 指对某种教义/理论的僵化坚持，常忽视现实与效果。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strong, often rigid tendency to follow a doctrine (a set of beliefs or theories), sometimes without enough attention to practical reality or new evidence.","zh":"教条主义；拘泥于某种教义/理论的一种倾向（常带贬义），有时不顾现实情况或新证据。"},"examples":[{"en":"Critics said the policy was driven more by doctrinarism than by what worked in practice.","zh":"批评者说这项政策更多是被教条主义推动，而不是基于实际有效的方法。"},{"en":"In the debate, her doctrinarism made it hard to compromise.","zh":"在辩论中，她的教条主义让人很难达成妥协。"},{"en":"The movement lost support when doctrinarism replaced open discussion.","zh":"当教条主义取代开放讨论时，这个运动失去了支持。"}]}],"synonyms":["dogmatism","rigidity","ideological rigidity","orthodoxy"],"phonetic":"/ˌdɑkˈtrɪnəˌrɪzəm/","extraExplanation":["“doctrinarism”通常用于批评某人/某派别“只讲原则与理论、不看现实”，常见于政治、宗教、意识形态、学术争论等语境。语气多为负面，暗示缺乏灵活性与务实精神。","词形上来自 doctrine（教义/学说）+ -ar- + -ism（主义/倾向）。在表达上，doctrinarism 比 “belief in a doctrine” 更强调“僵化、教条化”的态度。"]}
{"word":"doctrinarity","summary":{"en":"Doctrinarity means rigid, often impractical adherence to a doctrine or theory.","zh":"Doctrinarity 指对某套教义或理论僵化、往往不切实际的坚持（多为贬义）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being doctrinaire; rigidly following or promoting a set of doctrines or theories, often without considering practical realities","zh":"教条性；（不顾现实地）僵化遵循或宣扬某套教义/理论的特质"},"examples":[{"en":"The committee’s doctrinarity made it difficult to compromise, even when new evidence appeared.","zh":"委员会的教条性让妥协变得很难，即使出现了新证据也是如此。"},{"en":"Critics argued that the policy was driven more by doctrinarity than by the needs of ordinary people.","zh":"批评者认为，这项政策更多是由教条主义推动，而不是出于普通人的需求。"}]}],"synonyms":["dogmatism","doctrinaire attitude","rigidity","ideological rigidity"],"phonetic":"/ˌdɑk.trəˈnɛr.ə.ti/","extraExplanation":["“doctrinarity”在现代英语中比较少见，更常用的表达是“doctrinaire attitude”（教条式态度）或“dogmatism”（教条主义）。","词源上与“doctrine”（教义、信条、学说）和形容词“doctrinaire”（教条主义的）相关；语气通常偏负面，暗示缺乏灵活性与务实精神。"]}
{"word":"doctrinary","summary":{"en":"Doctrinary means “related to doctrine,” often with a sense of being rigid or overly theoretical; rarely, it can mean a doctrinaire person.","zh":"doctrinary 指“与教义/信条有关”，常带“拘泥教条、过于理论化”的含义；少数情况下也可指“教条主义者”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a doctrine (a set of beliefs or teachings), especially in a way that is strict, theoretical, or focused on principles rather than practical results.","zh":"与（某一）教义/信条/学说有关的；（尤指）拘泥于教条的、偏重理论而不顾实际的。"},"examples":[{"en":"The debate became doctrinary, with people repeating principles instead of discussing real solutions.","zh":"这场辩论变得很教条化，人们反复强调原则，却不谈真正的解决办法。"},{"en":"Some critics call the policy doctrinary because it ignores local conditions.","zh":"一些批评者认为这项政策过于教条，因为它忽视了当地情况。"}]},{"partOfSpeech":"n.","definition":{"en":"A person who is strongly devoted to a doctrine; a doctrinaire (rare).","zh":"固守教条的人；教条主义者（较少见）。"},"examples":[{"en":"He was seen as a doctrinary who refused to compromise.","zh":"他被视为一个拒绝妥协的教条主义者。"}]}],"synonyms":["doctrinal","doctrinaire","dogmatic","ideological"],"phonetic":"/ˈdɑːktrəˌnɛri/","extraExplanation":["“doctrinary”在现代英语里不如“doctrinal”（中性：与教义/学说有关）和“doctrinaire”（多为贬义：教条主义的/教条主义者）常见。写作时如果想表达“中性关联”，更常用doctrinal；想表达“死守理论、不顾现实”，更常用doctrinaire。"]}
{"word":"doctrinate","summary":{"en":"Doctrinate means to strongly instill beliefs in someone, often in a way that discourages independent thinking.","zh":"Doctrinate 指对他人强力灌输信念或观点，常暗示不鼓励独立思考。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to teach someone a set of beliefs or ideas very strongly, often so that they accept them without questioning","zh":"对某人进行（教条式的）灌输；强力灌输一套信念或观点，常带有让人不加质疑地接受的意味"},"examples":[{"en":"The group tried to doctrinate new members through daily lectures.","zh":"这个团体试图通过每天的讲座来对新成员进行思想灌输。"},{"en":"Some parents worry that schools will doctrinate children politically.","zh":"一些家长担心学校会对孩子进行政治灌输。"},{"en":"He was doctrinated to believe that outsiders were dangerous.","zh":"他被灌输要相信外人很危险。"}]}],"synonyms":["indoctrinate","brainwash","condition"],"phonetic":"/ˈdɑk.trə.neɪt/","extraExplanation":["“doctrinate”通常带有负面或批评色彩，强调“灌输、洗脑式教育”，与较中性的“teach（教）/educate（教育）/instruct（指导）”不同：后者更强调帮助理解与思考。","词根“doctrine”意为“教义、信条、学说”。因此“doctrinate”常用于宗教、政治、极端组织或宣传语境中，表达把某种“固定教条”强加给他人。","常见搭配：doctrinate someone into (doing) something（灌输使某人接受/去做某事）；be doctrinated to do something（被灌输要做某事）。"]}
{"word":"doctrine","summary":{"en":"Doctrine means an authoritative set of beliefs or guiding principles, often in religion, politics, or government policy.","zh":"Doctrine 指一套具有权威性、系统性的信条或指导原则，常用于宗教、政治或政府政策语境。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a set of beliefs or teachings that a religion, political group, or organization says are true and important","zh":"（宗教、政治团体或组织的）教义；信条；（被视为重要且正确的）一套主张"},"examples":[{"en":"The church’s doctrine teaches forgiveness and compassion.","zh":"教会的教义教导人要宽恕并富有同情心。"},{"en":"Different political parties follow different doctrines about the role of government.","zh":"不同政党对政府角色有不同的政治信条。"}]},{"partOfSpeech":"n.","definition":{"en":"an official principle or policy used to guide decisions, especially in government, law, or the military","zh":"（尤指政府、法律或军事领域的）官方原则；政策方针；指导思想"},"examples":[{"en":"The country announced a new foreign-policy doctrine.","zh":"该国宣布了一项新的外交政策方针。"},{"en":"Military doctrine influences how an army trains and fights.","zh":"军事 doctrine 会影响军队如何训练和作战。"}]}],"synonyms":["teaching","belief system","creed","dogma","principle","policy"],"phonetic":"/ˈdɑk.trɪn/","extraExplanation":["“Doctrine”常带有“权威性、体系化”的感觉，通常是由宗教机构、政府或组织提出并推广的；如果只是个人观点，更常用“belief/opinion/idea”。","在英语里，“doctrine”既可指宗教教义（如 Christian doctrine），也常见于政治与国际关系语境（如 Monroe Doctrine、Truman Doctrine），表示一套对外政策原则。"]}
{"word":"Doctrine of the Mean","summary":{"en":"Confucian and general principle of balanced moderation and avoiding extremes.","zh":"强调平衡适度、避免极端的儒家思想与处世原则。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A key Confucian teaching that emphasizes balance, harmony, and acting appropriately in each situation—avoiding extremes—so one can cultivate moral character and social order.","zh":"儒家重要思想，强调中正平和、因时制宜地把握分寸，避免走极端，以修身并促进社会和谐。"},"examples":[{"en":"In Confucianism, the Doctrine of the Mean encourages people to avoid extremes and act with proper measure.","zh":"在儒家思想中，“中庸之道”鼓励人们避免极端，做事有分寸。"},{"en":"The manager tried to follow the Doctrine of the Mean by balancing efficiency with compassion.","zh":"经理试图践行“中庸之道”，在效率与体恤之间取得平衡。"}]},{"partOfSpeech":"phrase","definition":{"en":"More generally, a principle of moderation: choosing a balanced position between two extremes.","zh":"（引申）“适度”“折中”的原则：在两个极端之间选择较为平衡的做法。"},"examples":[{"en":"As a doctrine of the mean, her parenting style avoids both strict control and total freedom.","zh":"作为一种“适度”的原则，她的育儿方式既不极端控制，也不完全放任。"},{"en":"Their policy is a doctrine of the mean between rapid growth and environmental protection.","zh":"他们的政策是在快速发展与环境保护之间的折中方案。"}]}],"synonyms":["moderation","the golden mean","the middle way","balance","temperance","equilibrium"],"phonetic":"/ˈdɑk.trɪn əv ðə ˈmin/","extraExplanation":["在英语里它常用作对《中庸》这部经典及其思想的译名；作为引申义时，更多指“避免走极端、追求平衡”的生活/处世理念。","相关表达：golden mean（亚里士多德提出的“黄金中道”，并非同一体系，但都强调避免极端）；the Middle Way（常用于佛教语境，也可泛指折中之道）。"],"etymology":"源自《礼记》中的《中庸》（常译为 The Doctrine of the Mean）。“中”有“恰当、居中、不偏不倚”之意，“庸”可指“常、用、平常之道”，合起来强调在不同情境中把握恰当的度。","mnemonic":["记忆：Mean = “中间/平均”。Doctrine of the Mean = “关于‘中间那条路’的学说”。","联想“中庸”：中=不偏；庸=常道/常用之道 → “不走极端的常用之道”。"]}
{"word":"doctrine of the mean","summary":{"en":"balanced moderation; avoiding extremes","zh":"保持平衡与适度、避免走极端"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a Confucian idea that the best way to live is to stay balanced and moderate, avoiding extremes, and to act appropriately in each situation","zh":"（儒家）“中庸之道”：主张保持平衡与适度、避免极端，并在具体情境中做出恰当行为的思想"},"examples":[{"en":"In Confucian philosophy, the doctrine of the mean encourages people to avoid extremes and keep inner balance.","zh":"在儒家哲学中，“中庸之道”鼓励人们避免极端，保持内在的平衡。"},{"en":"She tried to follow the doctrine of the mean by speaking calmly and finding a middle ground.","zh":"她试着遵循中庸之道，冷静表达并寻找折中方案。"}]},{"partOfSpeech":"phrase","definition":{"en":"more generally, the principle that a moderate or middle course is best","zh":"（泛指）“走中间路线/适度原则”：认为适中的做法通常最好"},"examples":[{"en":"His leadership style reflects a doctrine of the mean: steady changes rather than sudden reforms.","zh":"他的领导风格体现了适度原则：循序渐进的改变，而不是突然改革。"},{"en":"In debates, a doctrine of the mean can help people compromise instead of arguing to extremes.","zh":"在辩论中，适度原则能帮助人们妥协，而不是走向极端争执。"}]}],"synonyms":["moderation","the middle way","golden mean","balance","temperance"],"phonetic":"/ˈdɑk.trɪn əv ðə miːn/","extraExplanation":["在中文语境里，它通常特指《中庸》（四书之一）及其思想：强调“不过不及”、情绪与行为的恰当分寸，以及与人、与社会关系中的和谐。","英语里也可能被误解为“平均值（mean）”，但这里的 mean 是“中间、适度”，不是数学意义的“平均数”。"],"etymology":"“doctrine”来自拉丁语，意为“教导/学说”。“the mean”在这里指“中间/适度”。作为固定说法常用来翻译儒家概念“中庸”（Zhongyong），也可泛指“中道、适度”。","mnemonic":["把 mean 记成“中间值/中道”，联想中文“中（middle）+庸（ordinary/moderate）= 中庸”。","doctrine=“教义/学说”，所以整体就是“中道的学说”。"]}
{"word":"doctrines","summary":{"en":"“Doctrines” means official or accepted sets of beliefs/teachings, or formal principles (often in religion, politics, or law).","zh":"“doctrines”是doctrine的复数，指被认可的一套信条/教义/学说，或（法律/政策中）指导决策的正式原则。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A set of beliefs or teachings that a group (especially a religion, political party, or school of thought) accepts as true.","zh":"（尤指宗教、政党或思想流派的）一套被接受为真理的信条、教义、学说。"},"examples":[{"en":"Different religions have different doctrines about life after death.","zh":"不同宗教对死后世界有不同的教义。"},{"en":"The party’s doctrines shaped its policies on education and healthcare.","zh":"该政党的学说影响了它在教育与医疗方面的政策。"}]},{"partOfSpeech":"n.","definition":{"en":"In law or public policy: an official principle or rule used to guide decisions.","zh":"（法律/公共政策中）用于指导裁决或决策的正式原则、规则。"},"examples":[{"en":"The doctrine of self-defense can justify using force in certain situations.","zh":"在某些情况下，“正当防卫原则”可以成为使用武力的正当理由。"},{"en":"Courts debated the doctrine’s limits in recent cases.","zh":"法院在近期案件中讨论了该原则的适用边界。"}]}],"synonyms":["teachings","beliefs","tenets","principles","creed"],"phonetic":"/ˈdɑk.tɹɪnz/","extraExplanation":["“doctrines”是“doctrine”的复数形式，表示多条教义/信条/原则。","语感上，doctrine 往往比 belief（信念）更“系统化、成体系、带权威性”；比 idea（想法）更正式、更强调被传授与遵循。","常见搭配：religious doctrines（宗教教义）、political doctrines（政治学说）、legal doctrine（法律原则/法理）。"]}
{"word":"doctrinism","summary":{"en":"Doctrinism means rigid adherence to doctrine, often criticized as inflexible or impractical.","zh":"Doctrinism 指对教义/原则的僵化坚持，常带有不够灵活或不够务实的批评意味。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A strong belief in fixed doctrines (official teachings or principles), often implying a rigid or overly theoretical way of thinking.","zh":"教条主义；对既定教义/原则的强烈依赖（常含“僵化、过于理论化”的意味）。"},"examples":[{"en":"His approach to policy was criticized as doctrinism rather than practical problem-solving.","zh":"他的政策方法被批评为教条主义，而不是务实地解决问题。"},{"en":"Doctrinism can make people ignore new evidence that challenges their beliefs.","zh":"教条主义会让人忽视挑战既有信念的新证据。"}]}],"synonyms":["dogmatism","doctrinaire thinking","orthodoxy (often context-dependent)"],"phonetic":"/ˈdɑk.trəˌnɪz.əm/","extraExplanation":["“doctrinism”由“doctrine（教义/原则）+ -ism（主义、倾向）”构成，常用于批评语境，强调“死守原则、缺乏弹性”。","相关词：doctrinaire（adj./n.）更常见，指“教条的/教条主义者”；在学术或政治评论中，你更常见到“doctrinaire thinking / doctrinaire approach”。"]}
{"word":"doctrinist","summary":{"en":"A doctrinist is someone who follows doctrines very strictly, often too rigidly.","zh":"doctrinist 指严格甚至僵化地遵循某套教义或理论的人，常带贬义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who strongly believes in and follows a set of doctrines, often in a rigid or inflexible way","zh":"教条主义者；强调并死板遵循某套教义/理论的人（常含贬义）"},"examples":[{"en":"Some critics called him a doctrinist because he refused to compromise on policy.","zh":"一些批评者称他是教条主义者，因为他在政策上拒绝妥协。"},{"en":"In fast-changing situations, a doctrinist mindset can slow down good decisions.","zh":"在快速变化的情况下，教条式的思维可能会拖慢正确决策。"}]}],"synonyms":["doctrinaire","dogmatist","purist","ideologue"],"phonetic":"/ˈdɑk.trə.nɪst/","extraExplanation":["“doctrinist”在现代英语里不算常见，更常见的近义词是“doctrinaire”（教条主义的/教条主义者）或“dogmatist”（武断者）。","词根来自“doctrine”（教义；学说；原则）+ “-ist”（表示“从事者/信奉者”的后缀）。在政治、宗教或学术讨论中，通常带有“过于僵化、不顾现实”的评价色彩。"]}
{"word":"doctrinization","summary":{"en":"Doctrinization means the process of teaching or imposing a set of beliefs, often in a one-sided way (similar to indoctrination).","zh":"Doctrinization 指灌输某种信条/教义的过程，常带“单向灌输”的含义（与 indoctrination 类似）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the process of teaching a set of beliefs (a doctrine) to someone, especially in a strong or one-sided way; indoctrination","zh":"（向他人）灌输一套信条/教义的过程，尤指强势或单向的灌输；思想灌输"},"examples":[{"en":"Some critics said the training program felt like doctrinization rather than open discussion.","zh":"一些批评者说，这个培训项目更像是思想灌输，而不是开放讨论。"},{"en":"Parents worried that the class encouraged doctrinization instead of critical thinking.","zh":"家长担心这门课鼓励的是灌输，而不是批判性思维。"},{"en":"The report warned against political doctrinization in public schools.","zh":"报告警告要防止公立学校中的政治灌输。"}]}],"synonyms":["indoctrination","brainwashing","dogmatization"],"phonetic":"/ˌdɑktrənaɪˈzeɪʃən/","extraExplanation":["“doctrinization”在英文里不如“indoctrination”常用；两者意思很接近，但“indoctrination”更常带有明显的负面色彩（暗示不允许质疑、压制不同观点）。","拼写上也常见英式变体“doctrinisation”。写作中如果想表达更常见、更自然的用法，通常选“indoctrination”。"]}
{"word":"doctrinize","summary":{"en":"Doctrinize means to indoctrinate—teach beliefs in a forceful or systematic way.","zh":"doctrinize 指“灌输教义/观念”，多含强迫或系统灌输的批评意味。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to teach or promote a set of beliefs (a doctrine), especially in a persistent or systematic way; to indoctrinate","zh":"灌输（某种教义/信条）；（尤指系统地、反复地）使人接受某套观念；洗脑（含贬义）"},"examples":[{"en":"Some critics said the course was designed to doctrinize students rather than encourage independent thinking.","zh":"一些批评者说，这门课的目的在于灌输观念，而不是鼓励独立思考。"},{"en":"The group tried to doctrinize new members with long meetings and strict rules.","zh":"该团体试图通过长时间会议和严格规定来给新成员灌输教义。"}]}],"synonyms":["indoctrinate","brainwash","propagandize","inculcate"],"phonetic":"/ˈdɑk.trə.naɪz/","extraExplanation":["“doctrinize”比较少见，日常英语里更常用“indoctrinate”（灌输/洗脑）或“teach”“promote”（更中性）。","词根来自“doctrine”（教义、信条）。在新闻或评论写作中，它往往带有“把单一观点强加给别人”的批评意味。"]}
{"word":"doctrinized","summary":{"en":"Doctrinized means “indoctrinated” or “made rigidly doctrinal.”","zh":"doctrinized 指“被灌输（教条）”或“变得教条化”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(past tense/past participle of doctrinize) To teach someone a set of beliefs in a strong, systematic way; to indoctrinate.","zh":"（doctrinize 的过去式/过去分词）以强烈、系统的方式灌输一套信条或观点；使被教条化（即“灌输/洗脑”）。"},"examples":[{"en":"New members were doctrinized through weekly classes and reading assignments.","zh":"新成员通过每周课程和阅读任务被系统灌输这些信条。"},{"en":"The training program doctrinized recruits into the organization’s worldview.","zh":"该培训项目把组织的世界观灌输给新招募的人。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having been shaped or controlled by rigid doctrine; strongly doctrinal (often with a negative tone).","zh":"被教条塑造或控制的；带有强烈教条色彩的（常含贬义）。"},"examples":[{"en":"His answer sounded doctrinized rather than thoughtful.","zh":"他的回答听起来更像是教条式的背诵，而不是经过思考。"},{"en":"The discussion became doctrinized, leaving little room for questions.","zh":"讨论变得教条化，几乎不给提问留下空间。"}]}],"synonyms":["indoctrinated","brainwashed","conditioned","doctrinaire","dogmatic"],"phonetic":"/ˈdɑk.trəˌnaɪzd/","extraExplanation":["“doctrinized”在现代英语里不算常见，更常见的表达是“indoctrinated”（被灌输）或“doctrinaire”（教条主义的）。在学术或批评语境中，用“doctrinized”往往强调某人的语言/思维像“被训练出来的标准答案”，缺少独立判断。"]}
{"word":"doctrinizing","summary":{"en":"“Doctrinizing” means indoctrinating—teaching beliefs as unquestionable truth, often in a critical sense.","zh":"“doctrinizing”指“灌输思想/教条化”，把某种信念当作不可质疑的真理来教给别人，常带批评意味。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"teaching someone a set of beliefs as if they are unquestionably true; trying to shape opinions by repeated instruction (often used critically).","zh":"把一套信条当作绝对真理来灌输；通过反复教导来塑造他人观点（常带批评意味）。"},"examples":[{"en":"The program was accused of doctrinizing students instead of teaching them to think critically.","zh":"这个项目被指责是在给学生灌输思想，而不是教他们批判性思考。"},{"en":"Some parents worried that the class was doctrinizing rather than presenting multiple viewpoints.","zh":"一些家长担心这门课是在灌输某种立场，而不是呈现多种观点。"}]},{"partOfSpeech":"v.","definition":{"en":"speaking or writing in a very dogmatic way, as if your opinions are the only correct ones.","zh":"以武断的口吻讲话或写作，仿佛自己的观点才是唯一正确的。"},"examples":[{"en":"He kept doctrinizing about politics at dinner, so people changed the subject.","zh":"他在晚餐时一直武断地谈政治，于是大家换了话题。"}]}],"synonyms":["indoctrinating","brainwashing","preaching","inculcating","dogmatizing"],"phonetic":"/ˈdɑk.trəˌnaɪ.zɪŋ/","extraExplanation":["“doctrinizing”是动词“doctrinize”的现在分词/动名词形式，常见于进行时（is doctrinizing）或作名词使用（Doctrinizing is harmful）。","在美式英语中更常见的近义词是“indoctrinating（灌输）”。“doctrinize”较书面、较少用，且通常带负面评价。","英式拼写有时写作“doctrinising”。"]}
{"word":"doctrix","summary":{"en":"Doctrix is an old-fashioned word meaning a female doctor or learned woman.","zh":"Doctrix 是一个古旧词，指女医生或博学的女性。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(archaic) A woman who is a doctor or a learned teacher; the female form of “doctor.”","zh":"（古旧用法）女医生；女教师/女学者（“doctor”的阴性形式）。"},"examples":[{"en":"In older texts, a learned woman might be called a doctrix.","zh":"在较早的文献里，博学的女性有时会被称为 doctrix。"},{"en":"The term doctrix is rare in modern English and is mostly seen in historical writing.","zh":"doctrix 在现代英语中很少使用，多见于历史性写作。"}]}],"synonyms":["woman doctor","female doctor","doctor (modern neutral use)"],"phonetic":"/ˈdɑk.trɪks/","extraExplanation":["doctrix 来自拉丁语系的阴性后缀 -trix（表示“女性的……者”，如 aviatrix“女飞行员”、executrix“女遗嘱执行人”）。现代英语中更常用中性词 doctor，而不特别区分性别，因此 doctrix 带有明显的时代感与文献色彩。","在当代语境中，如果想表达“女医生/女博士/女教师”，通常直接用 doctor，并在需要时用 woman/female doctor 来说明；在正式写作中也更符合性别平等与现代用法。"]}
{"word":"doctus","summary":{"en":"Doctus is a Latin-derived adjective meaning “learned/erudite,” used mainly in scholarly or classical contexts.","zh":"Doctus 是源自拉丁语的形容词，意为“博学的/有学问的”，主要用于学术或古典语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Latin; used in English mainly in scholarly contexts) learned; well-educated; erudite.","zh":"（拉丁语；英语中多见于学术语境）博学的；受过良好教育的；有学问的。"},"examples":[{"en":"In the preface, the author praises a doctus reader who notices subtle references.","zh":"在序言中，作者称赞一位能注意到微妙典故的博学读者。"},{"en":"The phrase doctus vir is often translated as “a learned man.”","zh":"短语 doctus vir 常被翻译为“博学之士”。"}]}],"synonyms":["learned","erudite","scholarly","well-read"],"phonetic":"/ˈdɑk.təs/","extraExplanation":["doctus 是拉丁语形容词，来自动词 docēre（“教”）。它与英语的 doctor（最初指“教师、学者”，后来常指“医生”）同源。","在现代英语里，doctus 很少单独当作日常词使用，更多出现在拉丁引文、学术写作或古典研究中，用来营造“古典/书卷气”的语感。"]}
{"word":"docu","summary":{"en":"“Docu” is an informal short form meaning either a documentary (especially in phrases like “docu-series”) or documentation in tech/work contexts.","zh":"“docu”是非正式缩略语：可指“纪录片/纪录剧集”等，也可在技术或职场语境中指“文档/说明资料（documentation）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(informal) A documentary (film/TV program), especially in compounds like “docu-series” or “docu-drama.”","zh":"（非正式）纪录片（电影/电视节目），常用于合成词如“docu-series（纪录剧集）”“docu-drama（纪录剧情片）”。"},"examples":[{"en":"We watched a docu about ocean pollution.","zh":"我们看了一部关于海洋污染的纪录片。"},{"en":"She’s working on a new docu-series for Netflix.","zh":"她正在为奈飞制作一部新的纪录剧集。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, workplace/tech) Documentation; written instructions or reference material.","zh":"（非正式，职场/科技）文档；说明书；参考资料（documentation）。"},"examples":[{"en":"Check the docu before you change the settings.","zh":"改设置前先看看文档。"},{"en":"The API docu is pretty clear.","zh":"这个 API 文档写得挺清楚。"}]},{"partOfSpeech":"other","definition":{"en":"Used as a prefix meaning “documentary” (e.g., docu-film, docu-series).","zh":"用作前缀，表示“纪录片/纪录性的”（如 docu-film, docu-series）。"},"examples":[{"en":"It’s a docu-drama based on real events.","zh":"这是一部根据真实事件改编的纪录剧情片。"}]}],"synonyms":["documentary","documentation","docs"],"phonetic":"/ˈdɑkju/","extraExplanation":["“docu”多见于媒体标题或口语中，是“documentary”的缩略说法；正式写作里通常直接用“documentary”。","在职场或技术语境中，“docu”也可能是“documentation”的简写，常出现在聊天、工单、代码评审评论里。具体含义要看上下文。"]}
{"word":"docudrama","summary":{"en":"A dramatized retelling of real events, combining documentary facts with drama.","zh":"把真实事件戏剧化呈现的作品，兼具纪录片与剧情片元素。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A movie, TV show, or radio program that tells a real historical event or real people’s story using dramatic scenes, actors, and dialogue (often mixed with some documentary material like interviews or narration).","zh":"（电影/电视/广播）纪实剧情片：以真实历史事件或真实人物为基础，用演员表演、剧情化场景与对白来讲述故事（常会夹杂旁白、采访等纪录片元素）。"},"examples":[{"en":"The series is a docudrama about the rescue mission, based on eyewitness accounts.","zh":"这部剧是一部关于救援行动的纪实剧情片，依据目击者的证词改编。"},{"en":"Some viewers forget that a docudrama may invent dialogue to make the story flow.","zh":"有些观众会忘记：纪实剧情片为了叙事顺畅，可能会虚构对白。"}]}],"synonyms":["dramatized documentary","fact-based drama","historical docudrama"],"phonetic":"/ˈdɑkjuˌdrɑmə/","extraExplanation":["“docudrama”由“documentary（纪录片）+ drama（剧情/戏剧）”合成，常见于电视台或流媒体制作，用来在“真实性”和“戏剧性”之间取得平衡。","观看或讨论纪实剧情片时，常会提到“based on true events（根据真实事件改编）”“dramatic reconstruction（戏剧化重现）”。如果你需要严格事实核查，可以再对照新闻报道、史料或纯纪录片。","相关词：documentary（纪录片，偏事实呈现）、biopic（人物传记片，通常更偏电影叙事）、reenactment（再现/重演，常指某些片段的表演重构）。"]}
{"word":"docudramas","summary":{"en":"Docudramas are dramatized films or TV programs based on real events.","zh":"Docudramas 指以真实事件为基础、用戏剧化方式呈现的影视作品（纪录剧情片）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A type of TV show or movie that tells a real historical event using dramatic storytelling, often mixing factual details with acted scenes and dialogue.","zh":"一种以真实历史事件为题材、用戏剧化方式呈现的影视作品，常把事实细节与表演情节、对白结合起来。"},"examples":[{"en":"The channel aired docudramas about famous court cases.","zh":"这个频道播出了有关著名法庭案件的纪录剧情片。"},{"en":"Some docudramas change small details to make the story more dramatic.","zh":"有些纪录剧情片会改动一些细节，让故事更有戏剧性。"}]},{"partOfSpeech":"other","definition":{"en":"The plural form of “docudrama.”","zh":"“docudrama（纪录剧情片）”的复数形式。"},"examples":[{"en":"I’ve watched several docudramas this week.","zh":"我这周看了好几部纪录剧情片。"}]}],"synonyms":["docudrama series","dramatized documentary","fact-based drama"],"phonetic":"/ˈdɑkjuˌdrɑməz/","extraExplanation":["“docudrama”是“documentary（纪录片）”和“drama（剧情片/戏剧）”的合成词。它通常会保留真实人物与事件的框架，但用演员再现关键场景；因此可能出现“基于事实（based on true events）”但细节被艺术化处理的情况。","与“documentary”相比：docudrama更像“剧情片”，常有更强的情节推进与情绪渲染；与“biopic（传记片）”相比：docudrama更强调“事件”与“社会议题”，不一定只聚焦一个人的一生。"]}
{"word":"docufiction","summary":{"en":"Docufiction is a genre that blends real documentary material with fictional storytelling.","zh":"Docufiction 指把真实纪实材料与虚构叙事手法融合的体裁。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A genre or style that mixes documentary facts (real people, events, records) with fictional storytelling techniques (invented scenes, dialogue, or narration).","zh":"一种把纪实素材（真实人物、事件、档案）与虚构叙事手法（编造的场景、对白或叙述）混合在一起的体裁或写作/拍摄方式。"},"examples":[{"en":"The film is docufiction: it uses real interviews but adds staged scenes to tell a clearer story.","zh":"这部电影是“纪实虚构”：它使用真实采访，但也加入摆拍场景来把故事讲得更清楚。"},{"en":"Her docufiction book is based on her family history, with some imagined dialogue.","zh":"她的纪实虚构作品以家族史为基础，但加入了一些想象的对白。"}]}],"synonyms":["docudrama","documentary fiction","semi-documentary"],"phonetic":"/ˌdɑkjuˈfɪkʃən/","extraExplanation":["“docufiction”由 documentary（纪录片/纪实）+ fiction（小说/虚构）合成，常见于电影、电视与非虚构写作领域。","它通常不是“骗你当真”，而是用虚构手法帮助呈现真实：例如重现场景、补足当事人无法提供的对话、或用更强的叙事结构连接事实材料。","相关概念对比：docudrama（纪实剧情片，偏“戏剧化再现真实事件”）；mockumentary（伪纪录片，常带讽刺/喜剧性）。","较知名的例子（电影）常被提到如 Abbas Kiarostami 的《Close-Up》（1990），以真实案件为基础并让当事人参与重演。"]}
{"word":"document","summary":{"en":"Document most often means an official written record or a computer file; as a verb, it means to record something carefully as evidence.","zh":"document 最常指“文件/正式记录”或“电脑文档”；作动词时指“把事情详细记录下来作为凭证”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A piece of written, printed, or digital information that records something or gives official information.","zh":"文件；文书；（书面/印刷/电子）记录某事或提供正式信息的资料。"},"examples":[{"en":"Please bring a photo ID and any other required documents.","zh":"请带上带照片的身份证件和其他所需文件。"},{"en":"This document explains the company’s safety rules.","zh":"这份文件说明了公司的安全规定。"}]},{"partOfSpeech":"n.","definition":{"en":"A specific text file created on a computer (for example, a Word or PDF file).","zh":"（电脑里的）文档；（如 Word 或 PDF 等）文本文件。"},"examples":[{"en":"I saved the document as a PDF and emailed it to my teacher.","zh":"我把文档保存成 PDF 并发邮件给老师了。"},{"en":"The document is in the shared folder.","zh":"文档在共享文件夹里。"}]},{"partOfSpeech":"vt.","definition":{"en":"To record something carefully in writing, photos, or video so it can be used as evidence or a clear record.","zh":"记录；记载；（用文字/照片/视频等）把事情详细记录下来，以便作为证据或清楚的凭证。"},"examples":[{"en":"The journalist documented the events with interviews and photos.","zh":"这名记者用采访和照片记录了这些事件。"},{"en":"We need to document the problem before we fix it.","zh":"我们需要先记录这个问题，再去修复。"}]}],"synonyms":["file","record","paper","form","certificate","documentation"],"phonetic":"/ˈdɑkjəmənt/","extraExplanation":["名词 document 常见于正式场合：official documents（官方文件）、travel documents（旅行证件）。口语里也常说 paperwork（手续/一堆文件）。","动词 document 强调“留下可核查的记录”。在工作场景中常搭配：document changes（记录变更）、document decisions（记录决定）、document evidence（记录证据）。","词源提示：来自拉丁语 documentum，和 doc-（teach/教）同源，最初有“证明/例证、用来说明的材料”的意思。"]}
{"word":"Document Against Payment","summary":{"en":"shipping documents are released only after payment is made","zh":"付款后才交付装运单据的贸易结算方式"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"a trade payment method where the exporter’s bank releases shipping documents to the importer only after the importer pays (usually immediately, “at sight”).","zh":"一种国际贸易付款方式：进口商付款后（通常为即期付款），出口方银行才把提货等装运单据交给进口商。"},"examples":[{"en":"We accepted Documents Against Payment to reduce the risk of non-payment.","zh":"我们接受付款交单，以降低不付款的风险。"},{"en":"Under D/P terms, the buyer must pay before getting the bill of lading.","zh":"在D/P条款下，买方必须先付款才能拿到提单。"},{"en":"The contract states: payment by Documents Against Payment at sight.","zh":"合同写明：即期付款交单。"}]}],"synonyms":["D/P","cash against documents","documents for payment"],"phonetic":"/ˈdɑkjəmənts əˈɡenst ˈpeɪmənt/","extraExplanation":["常见缩写：D/P。中文常译为“付款交单”。","核心逻辑：银行不替买方“担保付款”，只负责“控制单据”。买方付了钱，才能拿到提单等单据去提货。","对比：D/P（付款后交单）通常比D/A（承兑交单，先承兑后付款）对卖方更安全；但仍存在风险，例如货物到港后买方拒付，卖方可能需要改卖或退运。","常见搭配：D/P at sight（即期付款交单）；D/P after sight（见票后若干天付款交单，较少见）。","相关场景词：collection（托收）、remitting bank（寄单行）、collecting/presenting bank（代收/提示行）、bill of lading（提单）。"],"etymology":"源自贸易金融用语：Documents（单据）+ Against（以……为条件/以……交换）+ Payment（付款），字面即“以付款为条件交单”。在跟单托收（collection）业务中常用，与D/A相对。","mnemonic":["把“Against”记成“以……为交换条件”：Documents against Payment＝“单据换钱”。","联想中文缩写：D/P≈“Document/Payment”→“付钱才给单据”。"]}
{"word":"document case","summary":{"en":"A holder or organized set for papers, especially for carrying or filing.","zh":"用于携带或归档整理纸质文件的文件包或成套材料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A container (often a thin briefcase or folder) used to carry, store, and protect papers such as contracts, certificates, or reports.","zh":"用于携带、收纳并保护文件（如合同、证书、报告等）的文件包/文件夹式公文包。"},"examples":[{"en":"She put the signed contract in a document case to keep it from getting wrinkled.","zh":"她把签好的合同放进文件包里，防止起皱。"},{"en":"Please bring your passport and copies of your documents in a document case.","zh":"请用文件包带上护照和文件复印件。"},{"en":"The document case has separate pockets for receipts and letters.","zh":"这个文件包有分隔口袋，可以放收据和信件。"}]},{"partOfSpeech":"n.","definition":{"en":"A set of documents organized together for a particular purpose (especially in legal or administrative work).","zh":"（尤指法律或行政工作中）为某一事项整理归档的一套材料/案卷文件。"},"examples":[{"en":"The lawyer reviewed the document case before the hearing.","zh":"律师在听证会前审阅了案卷材料。"},{"en":"We need to complete the document case for the visa application.","zh":"我们需要把签证申请的整套材料整理齐全。"}]}],"synonyms":["folder","briefcase","portfolio","file","case file","document holder","paperwork","dossier"],"phonetic":"/ˈdɑːkjəmənt keɪs/","extraExplanation":["日常生活中更常用的是 briefcase（公文包）或 folder（文件夹）。document case 往往强调“专门装文件、较薄、用于保护纸张”。","在法律/行政语境里，如果说 a case file / case documents 更自然；document case 也可能被理解为“某个案子的文件材料”。"],"etymology":"复合词：document（文件）+ case（盒/包/套；也可指“案件/案卷”）。因此既可指“装文件的包”，也可在特定语境里指“文件案卷”。","mnemonic":["把它拆开记：document=文件，case=盒/包/套 → “装文件的套子/包”。","联想中文“文件袋/文件包”：case 就像“袋子/盒子”，用来把文件“装起来、保护起来”。"]}
{"word":"document transmission","summary":{"en":"the sending or transfer of documents, especially in a formal or secure way","zh":"文件的发送或转交过程，常指较正式或强调安全的传输"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"the process of sending or transferring documents (paper or digital) from one person or place to another","zh":"文件传输；把文件（纸质或电子）从一个人/地点发送到另一个人/地点的过程"},"examples":[{"en":"For security reasons, we use encrypted document transmission for all contracts.","zh":"出于安全原因，我们对所有合同都使用加密的文件传输。"},{"en":"Document transmission can be done by email, fax, or a secure online portal.","zh":"文件传输可以通过电子邮件、传真或安全的在线平台完成。"},{"en":"Please confirm receipt after the document transmission is complete.","zh":"文件传输完成后，请确认已收到。"}]}],"synonyms":["document transfer","file transfer","document delivery","records transmission","data transfer"],"phonetic":"/ˈdɑkjəmənt trænzˈmɪʃən/","extraExplanation":["在职场/IT语境里，document transmission 常强调“传输渠道与安全性”（如加密、权限、审计记录）。","与 delivery 相比，transmission 更偏“传输过程/通道”（尤其是电子传输）；与 sharing 相比，更偏正式、可追踪、合规。"],"etymology":"由 document（文件，源自拉丁语 documentum“证据、教导”）+ transmission（传送，源自拉丁语 transmittere“送过去、传递”）组合而成，现代多用于商务与信息技术语境。","mnemonic":["把 transmission 联想成“传+输”：文件传过去、输到对方那边＝文件传输。","document 像“档（document）”，transmission 像“传（trans-）送（-mission）”，合起来就是“档案传送”。"]}
{"word":"document-free","summary":{"en":"Document-free means paperless or not requiring documents; it can also mean having no documents with you.","zh":"document-free 指“无纸化/不需提交文件的”，也可指“身上未携带证件/文件的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Not requiring paper documents or official paperwork; paperless.","zh":"不需要纸质文件或正式文书的；无纸化的。"},"examples":[{"en":"This airport offers document-free boarding for passengers who use the app.","zh":"这座机场为使用应用程序的乘客提供无证件（无纸质文件）登机服务。"},{"en":"The bank promoted a document-free loan process, but you still needed to verify your identity.","zh":"银行宣传贷款流程“免文件”，但你仍然需要核验身份。"}]},{"partOfSpeech":"adj.","definition":{"en":"Having no documents with you (often used in travel or immigration contexts).","zh":"身上没有携带证件或文件的（常用于旅行或移民语境）。"},"examples":[{"en":"He arrived at the border document-free and could not enter.","zh":"他到达边境时身上没有证件，因此无法入境。"},{"en":"If you travel document-free, you may face delays or be refused service.","zh":"如果你出行不带证件，可能会遇到延误或被拒绝服务。"}]}],"synonyms":["paperless","no-paperwork","cashless-and-paperless (contextual)","without documents (contextual)"],"phonetic":"/ˈdɑk.jə.mənt friː/","extraExplanation":["“document-free”常见于广告或政策说明里，表示流程尽量不收/不交纸质材料（paperless）。但在现实中通常仍需要某种形式的身份核验（例如电子证件、短信验证码或人脸识别）。","写法上多用连字符作形容词（document-free process / document-free service）。在句子里也可写作“document free”，但在正式文案中连字符更常见、更清晰。"]}
{"word":"document-like","summary":{"en":"“Document-like” means resembling a formal document in style or layout.","zh":"“document-like”指在风格或排版上像正式文件一样（正式、结构化、信息导向）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling a document in style or format; formal, structured, and information-focused (often like a report, memo, or official paper).","zh":"像文件一样的；在风格或格式上类似正式文件的（通常像报告、备忘录或公文那样正式、结构化、以信息为主）。"},"examples":[{"en":"The website has a document-like layout with headings, numbered sections, and footnotes.","zh":"这个网站的版式很“文件化”，有标题、编号章节和脚注。"},{"en":"Her writing felt document-like—clear and organized, but not very personal.","zh":"她的写作风格很“文件式”：清晰、有条理，但不太个人化。"},{"en":"Please keep the tone document-like for the policy draft.","zh":"请把政策草案的语气保持得像正式文件一样。"}]}],"synonyms":["formal","report-like","official-looking","text-heavy","structured"],"phonetic":"/ˈdɑkjəmənt laɪk/","extraExplanation":["“document-like”是由名词 document + 后缀 -like 组成的复合形容词，常用连字符（-）连接，尤其在放在名词前作定语时更常见：a document-like format。","语感上它通常强调“正式、结构化、客观”，有时也暗示“缺少情感或叙事性”。在工作写作中，这种风格往往是优点；在创意写作或个人表达中可能被认为太生硬。"]}
{"word":"document-style","summary":{"en":"“Document-style” means formatted to look like a traditional document (pages, margins, headings), often used in writing and software.","zh":"“Document-style”指以传统文档方式排版（页面、页边距、标题等），常用于写作与软件排版场景。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Computing, writing) formatted like a traditional document (with pages, margins, headings), rather than like plain text or a web page.","zh":"（计算机/写作）以传统“文档”方式排版的（有页面、页边距、标题等），不同于纯文本或网页式排版。"},"examples":[{"en":"Please export the report in a document-style PDF with page numbers.","zh":"请把报告导出为文档式的 PDF，并加上页码。"},{"en":"The editor lets you switch from web-style layout to document-style layout.","zh":"这个编辑器可以让你从网页式布局切换到文档式布局。"}]},{"partOfSpeech":"n.","definition":{"en":"a document-style format or layout; a way of presenting content that looks like a document.","zh":"文档式格式/版式；一种让内容呈现为“文档外观”的方式。"},"examples":[{"en":"Use document-style for formal submissions.","zh":"正式提交请使用文档式格式。"},{"en":"I prefer document-style because it’s easier to print.","zh":"我更喜欢文档式，因为更容易打印。"}]}],"synonyms":["document-format","print-style","page-layout style","report-style"],"phonetic":"/ˈdɑkjəmənt staɪl/","extraExplanation":["“document-style”常见于软件与排版语境（如 word processor、PDF、LaTeX、Markdown 的某些导出模式）。它用连字符连接，表示两个词共同修饰后面的名词：document-style layout / document-style PDF。也可写作“document style”（不加连字符），但在作定语时加连字符更清晰。"]}
{"word":"documentable","summary":{"en":"“Documentable” means “able to be documented or proven with records or evidence.”","zh":"“documentable”表示“有据可查、可被记录并用证据证明的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Able to be documented; able to be supported with written records, evidence, or clear proof.","zh":"可被记录/存档的；有据可查的；能够用书面材料或证据证明的。"},"examples":[{"en":"The expenses must be documentable with receipts.","zh":"这些费用必须能用收据证明。"},{"en":"We need a documentable reason for the schedule change.","zh":"我们需要一个有据可查的理由来说明为什么要改日程。"},{"en":"Only documentable outcomes will be included in the report.","zh":"只有可核实、可记录的结果才会写进报告里。"}]}],"synonyms":["verifiable","provable","supportable","substantiated","traceable"],"phonetic":"/ˈdɑk.jə.mən.tə.bəl/","extraExplanation":["“documentable”常见于商业、审计、法律、研究等语境，强调“可追溯、可核查”的证据链（例如收据、合同、邮件记录、实验数据）。","词尾“-able”表示“能够……的”。因此documentable直译就是“能够被document（记录/证明）的”。它比“recordable（可录下/可记录）”更强调“有证据可证明”。"]}
{"word":"documental","summary":{"en":"“Documental” is a rare English adjective meaning “related to documents” (often in legal/academic use). In everyday English, “documentary” is usually the word you want.","zh":"“Documental”在英语中较少见，多作形容词，指“与文件有关/以文件为证据”（常见于法律或学术语境）。日常英语里通常应使用“documentary（纪录片/纪实的）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Rare) Relating to documents or written records; based on documents as evidence.","zh":"（较少用）与文件/文书记录有关的；以文件作为证据的。"},"examples":[{"en":"The lawyer presented documental evidence to support the claim.","zh":"律师提交了文件证据来支持该主张。"},{"en":"The museum keeps a documental archive of the city’s history.","zh":"博物馆保存着这座城市历史的文献档案。"}]},{"partOfSpeech":"adj.","definition":{"en":"(In some contexts, especially outside everyday English) Similar to “documentary”: showing real events or facts.","zh":"（在部分语境中，尤非日常英语）近似“documentary（纪录片/纪实的）”：展示真实事件或事实的。"},"examples":[{"en":"They preferred a more documental style, with interviews and real footage.","zh":"他们更偏好一种更纪实的风格，用采访和真实影像来呈现。"}]}],"synonyms":["documentary","evidentiary","archival","recorded"],"phonetic":"/ˌdɑk.jəˈmɛn.təl/","extraExplanation":["在标准日常英语里更常用的是 **documentary**（纪录片；纪实的）。**documental** 在英语中较少见，但在法律/学术语境里可见，如 **documental evidence**（书证/文件证据）。","如果你是从西班牙语/葡萄牙语的 **documental** 直接输入，它通常对应英语 **documentary**。例如：*un documental* → *a documentary*。"]}
{"word":"documentalist","summary":{"en":"A documentalist is a professional who organizes documents and helps others find information efficiently.","zh":"documentalist 指从事文献与文件整理、管理并提供信息检索与支持服务的专业人员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a specialist who organizes, manages, and helps people find information in documents (such as reports, manuals, or records), often in libraries, archives, or companies","zh":"文献资料员；文献整理与信息检索人员（负责整理、管理并协助查找各类文件与资料，常见于图书馆、档案馆或企业）"},"examples":[{"en":"The company hired a documentalist to organize research reports and make them easy to search.","zh":"公司聘请了一位文献资料员来整理研究报告，并让检索更方便。"},{"en":"As a documentalist, she helps engineers find the latest standards and technical manuals.","zh":"作为文献资料员，她帮助工程师找到最新的标准和技术手册。"}]}],"synonyms":["information specialist","librarian","archivist","records manager","document controller"],"phonetic":"/ˌdɑːkjəˈmɛntəlɪst/","extraExplanation":["“documentalist”在英式/国际语境中较常见，尤其在欧洲的机构里；在美国更常用的近义称呼有“information specialist”“librarian（偏图书馆）”“archivist（偏档案）”“records manager（偏企业记录管理）”。","该词与法语“documentaliste”有关，职业内涵常包含“信息组织 + 信息检索 + 知识服务”，不一定只做“文件保存”，也常参与给员工提供资料支持。"]}
{"word":"documentarian","summary":{"en":"A documentarian is a person who makes documentaries about real life.","zh":"documentarian指“制作纪录片、记录现实生活的人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A filmmaker or journalist who makes documentaries (nonfiction films, TV programs, or audio) to show real events, people, or issues.","zh":"纪录片导演／纪录片创作者（制作非虚构的影片、电视节目或音频，呈现真实的人、事或议题）。"},"examples":[{"en":"The documentarian spent months interviewing residents after the hurricane.","zh":"这位纪录片创作者在飓风之后花了好几个月采访居民。"},{"en":"She is a documentarian known for films about social justice.","zh":"她是一位以拍摄社会正义题材闻名的纪录片导演。"},{"en":"As a documentarian, he tries to let people speak for themselves.","zh":"作为纪录片创作者，他尽量让受访者自己发声。"}]}],"synonyms":["documentary filmmaker","documentary director","nonfiction filmmaker","filmmaker","journalist"],"phonetic":"/ˌdɑk.jə.mɛnˈtɛr.i.ən/","extraExplanation":["“documentarian”常用于电影与媒体语境，强调以纪实方式记录现实世界的人物与事件。与“documentary filmmaker”意思接近，但“documentarian”更像一个身份称呼，带有创作者/记录者的职业气质。","纪录片常涉及“客观记录”与“作者观点”的平衡；因此一些语境里会讨论documentarian的伦理责任，比如是否干预事件、如何保护受访者隐私等。"]}
{"word":"documentarians","summary":{"en":"“Documentarians” are people who make documentary films or programs.","zh":"“Documentarians”指制作纪录片的人（纪录片创作者/制作人）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who makes documentary films or programs (someone who records real life to inform or tell true stories).","zh":"纪录片导演／纪录片制作人（通过真实素材记录现实、传递信息或讲述真实故事的人）。"},"examples":[{"en":"Many documentarians focus on social issues like education and healthcare.","zh":"许多纪录片创作者关注教育、医疗等社会议题。"},{"en":"The film festival invited documentarians from around the world to discuss their work.","zh":"电影节邀请了来自世界各地的纪录片制作人分享他们的作品。"},{"en":"Documentarians often spend months building trust with the people they film.","zh":"纪录片创作者常常花几个月与拍摄对象建立信任。"}]}],"synonyms":["documentary filmmaker","documentary director","filmmaker","nonfiction filmmaker"],"phonetic":"/ˌdɑkjəˈmɛnˌtɛriən/","extraExplanation":["“documentarian”在英语里常指纪录片创作者（尤其是导演或主要创作人员），比“documentary filmmaker”更强调记录真实、调查与叙事的工作方式。","复数“documentarians”表示“多位纪录片创作者”。有时也可用来泛指新闻调查或影像记录领域中以事实为核心的人。"]}
{"word":"documentaries","summary":{"en":"“Documentaries” means nonfiction films or TV programs about real life, the plural of “documentary.”","zh":"“documentaries”指“纪录片”，即以真实生活为内容的非虚构影视作品，是“documentary”的复数。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Films or TV programs that present real events, real people, or real issues (often to inform or educate).","zh":"纪录片：以真实事件、人物或议题为内容的电影或电视节目（通常用于介绍事实或教育观众）。"},"examples":[{"en":"I like documentaries about nature and wildlife.","zh":"我喜欢关于自然和野生动物的纪录片。"},{"en":"We watched a documentary on climate change in class.","zh":"我们在课堂上看了一部关于气候变化的纪录片。"},{"en":"This documentary tells the story of a small town after the earthquake.","zh":"这部纪录片讲述了地震后一个小镇的故事。"}]}],"synonyms":["nonfiction films","documentary films","factual programs"],"phonetic":"/ˌdɑk.jəˈmɛn.təriz/","extraExplanation":["“Documentaries”是“documentary”的复数形式。单数：a documentary；复数：documentaries。","词源上与“document（文件/记录）”同源，核心概念是“基于记录与证据来呈现真实”。","常见搭配：a nature documentary（自然纪录片），a historical documentary（历史纪录片），a documentary series（纪录片系列），a documentary filmmaker（纪录片导演）。","与“movie/film”相比，documentary更强调“真实素材、采访、资料画面”；但也有“docudrama（纪实剧情片）”会加入戏剧化的重现。"]}
{"word":"documentarily","summary":{"en":"Documentarily means “by means of documents/records” or “in a documentary style,” depending on context.","zh":"Documentarily 可表示“以文件/记录为依据地”，也可表示“以纪录片风格地”，具体看语境。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that relates to documents or written records; using documents as evidence.","zh":"以文件/书面记录的方式；以文件作为证据地。"},"examples":[{"en":"The claim must be supported documentarily, not just by personal stories.","zh":"这项主张必须有文件证据支持，而不只是个人叙述。"},{"en":"The museum can documentarily prove the painting’s ownership history.","zh":"博物馆可以用文件资料证明这幅画的所有权历史。"}]},{"partOfSpeech":"adv.","definition":{"en":"In the style of a documentary (film or TV program).","zh":"以纪录片的风格；像纪录片一样地。"},"examples":[{"en":"The story is told documentarily, with interviews and real footage.","zh":"这个故事以纪录片方式讲述，包含访谈和真实影像。"}]}],"synonyms":["in writing","with documentation","on record","in a documentary style"],"phonetic":"/ˌdɑkjəˈmɛntriəli/","extraExplanation":["“documentarily”在日常英语中不算常见，更常用的说法是用短语替代：比如“with documentation / in writing / in a documentary style”。在法律、学术或档案语境里，它更可能表示“有文件可证明/以文件为依据”。"]}
{"word":"documentarist","summary":{"en":"A documentarist is a person who makes documentaries; “documentarian” is more common.","zh":"documentarist 指“纪录片制作者/纪录片导演”；更常用的说法是 documentarian。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A person who makes documentaries (nonfiction films or TV programs about real people, events, or issues).","zh":"纪录片制作者；纪录片导演（拍摄以真实人物、事件或议题为主题的非虚构影片或节目的人）。"},"examples":[{"en":"She is a documentarist who focuses on environmental stories.","zh":"她是一位专注于环保议题的纪录片制作者。"},{"en":"The documentarist spent months interviewing local residents.","zh":"这位纪录片导演花了几个月采访当地居民。"},{"en":"As a documentarist, he tries to show facts clearly while respecting his subjects.","zh":"作为纪录片创作者，他努力清晰呈现事实，同时尊重被拍摄者。"}]}],"synonyms":["documentarian","documentary filmmaker","documentary director","filmmaker"],"phonetic":"/ˌdɑkjəˈmɛntərɪst/","extraExplanation":["“documentarist”在英语中存在，但更常见、更自然的说法是“documentary filmmaker”（纪录片电影人）或“documentarian”（纪录片工作者/纪录片导演）。在正式写作或影展语境里，“documentarian”出现频率更高。","词源上与“documentary（纪录片）”同源，后缀“-ist”常表示“从事某领域的人”（如 artist, novelist）。在语感上，“documentarist”略偏书面或较少用。"]}
{"word":"documentary","summary":{"en":"“Documentary” most commonly means a factual film/program; it can also describe something supported by documents (e.g., documentary evidence).","zh":"documentary 最常指“纪录片”；也可作形容词表示“有文件依据的/由文件构成的”（如 documentary evidence）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a film or TV/radio program that presents real events, real people, and factual information (often to inform or educate).","zh":"纪录片；以真实事件、人物和事实信息为内容（常用于介绍、教育或记录）的电影/电视/广播节目。"},"examples":[{"en":"We watched a documentary about ocean pollution in class.","zh":"我们在课堂上看了一部关于海洋污染的纪录片。"},{"en":"The documentary follows the daily life of a small farming community.","zh":"这部纪录片记录了一个小型农耕社区的日常生活。"}]},{"partOfSpeech":"adj.","definition":{"en":"based on or consisting of official documents or written records.","zh":"文件的；基于（或由）官方文件、书面记录构成的。"},"examples":[{"en":"The lawyer asked for documentary evidence to support the claim.","zh":"律师要求提供书面/文件证据来支持该主张。"},{"en":"There is little documentary proof of the event.","zh":"关于这件事几乎没有文件证据。"}]}],"synonyms":["nonfiction film","doc (informal)","factual program"],"phonetic":"/ˌdɑk.jəˈmɛn.tər.i/","extraExplanation":["“documentary（纪录片）”作为名词最常见；作为形容词多见于正式语境，尤其是法律或学术写作里，例如“documentary evidence（书面/文件证据）”。","词源来自“document（文件、记录）”，核心含义是“用记录来呈现事实”。纪录片也可能带有作者观点，但通常强调基于真实材料（采访、档案、实地拍摄等）。"]}
{"word":"documentary evidence","summary":{"en":"written or recorded proof","zh":"书面或记录性证据"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"written or recorded proof used to support a claim, especially in legal, academic, or official contexts (for example, documents, emails, contracts, certificates, or archives).","zh":"用于支持某项主张的书面或记录性证据，尤用于法律、学术或官方场景（如文件、邮件、合同、证书、档案等）。"},"examples":[{"en":"The judge asked for documentary evidence to confirm the payment.","zh":"法官要求提供书面证据来确认付款。"},{"en":"Her documentary evidence included emails and bank statements.","zh":"她的书面证据包括电子邮件和银行对账单。"},{"en":"The historian relied on documentary evidence from the 18th century.","zh":"这位历史学家依靠18世纪的档案文献作为证据。"}]}],"synonyms":["written evidence","documented proof","paper trail","records","documentation"],"phonetic":"/ˌdɑkjəˈmɛntri ˈɛvɪdəns/","extraExplanation":["常与 testimonial evidence（证人证言）、physical evidence（物证）对比：documentary evidence 强调“看得见的文字/记录”。","在法律语境中常指可提交法庭或机构审查的材料，如合同、发票、公司记录、聊天记录（截图/导出记录）等。"],"etymology":"documentary 来自 document（文件、文献）+ -ary（“与……有关的”）；evidence 来自拉丁语 evidens（“清楚可见的、明显的”）。组合起来强调“以文件/记录形式呈现的证据”。","mnemonic":["把它拆开记：document（文件）+ evidence（证据）=“文件形式的证据”。","联想中文“书证/文书证据”：凡是能“拿出纸面或记录”的证明材料，多半就是 documentary evidence。"]}
{"word":"documentary film","summary":{"en":"A nonfiction film that records and explains real life.","zh":"记录并呈现现实生活的非虚构影片。"},"definitions":[{"partOfSpeech":"phrase","definition":{"en":"A movie (or long video) that presents real people, events, and issues, aiming to inform or record reality rather than tell a fictional story.","zh":"纪录片：以真实人物、事件和议题为内容，主要用于记录与传播信息，而不是讲虚构故事的影片。"},"examples":[{"en":"We watched a documentary film about ocean pollution in class.","zh":"我们在课堂上看了一部关于海洋污染的纪录片。"},{"en":"The director spent three years making the documentary film and interviewing local residents.","zh":"导演花了三年时间制作这部纪录片并采访当地居民。"},{"en":"Many documentary films use real footage and a narrator to explain the background.","zh":"许多纪录片会使用真实影像和旁白来解释背景。"}]}],"synonyms":["documentary","nonfiction film","doc"],"phonetic":"/ˌdɑkjəˈmɛntri fɪlm/","extraExplanation":["有时也说 documentary（口语里常缩写为 doc）。documentary film 更正式；documentary movie 也常见，意思基本相同。","纪录片并不一定“完全客观”：会通过选材、剪辑、配乐与叙述角度表达观点，但素材通常基于真实人物与事件。"],"etymology":"“documentary”来自拉丁语词根 documentum（“证据、教导”），与动词 document（“记录、证明”）有关；documentary film 指“以记录/证明为目的的电影”。","mnemonic":["把 documentary 理解为“document（文件/记录）+ -ary（……的）”，即“用影像做记录的”。","联想中文“纪录片”里的“纪/录”，都强调“记录真实”。"]}
{"word":"documentary-style","summary":{"en":"“Documentary-style” describes something presented in a realistic, documentary-like way.","zh":"“documentary-style”指以纪录片般的方式呈现，突出真实与纪实感。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Made or presented like a documentary: realistic, factual-seeming, and often using interviews, real locations, or a “camera observing” feeling.","zh":"纪录片风格的：像纪录片一样呈现，强调真实感与纪实感，常见采访、真实场景或“镜头在旁观察”的效果。"},"examples":[{"en":"The film is documentary-style, with handheld camera shots and interviews.","zh":"这部电影是纪录片风格的，有手持镜头和采访片段。"},{"en":"They used a documentary-style approach to tell the story of the community.","zh":"他们用纪录片式的方式讲述这个社区的故事。"},{"en":"Her documentary-style writing focuses on real people and everyday details.","zh":"她的纪实写作风格关注真实的人和日常细节。"}]}],"synonyms":["documentary-like","realistic","observational","cinéma vérité–style","nonfiction-style"],"phonetic":"/ˌdɑkjəˈmɛntri staɪl/","extraExplanation":["“documentary-style”常用来形容影视、广告、短视频、写作或播客的呈现方式，强调“像真实记录一样”。它不一定表示内容百分之百真实，也可能是“伪纪录片/拟纪录片”（mockumentary）的表演与叙事手法。","常见搭配：documentary-style footage（纪录片式影像）、documentary-style interview（纪录片式采访）、documentary-style narration（纪录片式旁白）、documentary-style storytelling（纪录片式叙事）。","近似概念区分：documentary-style（纪录片风格，强调形式与质感） vs. documentary（纪录片，强调作品类型）。"]}
{"word":"documentation","summary":{"en":"Documentation means written explanations/instructions, official proof papers, or the act of recording information.","zh":"documentation 可指说明/使用文档、用于证明的正式材料，或记录信息的过程。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Written information that explains how something works or how to use it (especially for software, machines, or processes).","zh":"说明某物如何运作或如何使用的书面资料（尤指软件、机器或流程的使用说明/文档）。"},"examples":[{"en":"The app’s documentation includes a quick-start guide and FAQs.","zh":"这款应用的文档包含快速入门指南和常见问题解答。"},{"en":"Good documentation makes it easier for new team members to learn the system.","zh":"好的文档能让新成员更容易上手这个系统。"},{"en":"Please update the documentation when you change the API.","zh":"当你修改 API 时，请同步更新文档。"}]},{"partOfSpeech":"n.","definition":{"en":"Official papers or records used as proof or support for something (e.g., identity, travel, a claim).","zh":"用于证明或支持某事的正式文件或记录（如身份证明、出行材料、申诉材料）。"},"examples":[{"en":"You’ll need documentation to prove your address.","zh":"你需要提供文件来证明你的住址。"},{"en":"She submitted documentation for her insurance claim.","zh":"她提交了理赔所需的证明材料。"}]},{"partOfSpeech":"n.","definition":{"en":"The process of recording facts or events in a careful, organized way.","zh":"把事实或事件以严谨、有条理的方式记录下来的过程。"},"examples":[{"en":"Accurate documentation of meetings helps prevent misunderstandings.","zh":"准确记录会议内容有助于避免误解。"},{"en":"The project requires documentation of all test results.","zh":"该项目要求记录所有测试结果。"}]}],"synonyms":["docs","manual","instructions","guide","records","paperwork","evidence"],"phonetic":"/ˌdɑk.jə.mɛnˈteɪ.ʃən/","extraExplanation":["在科技语境里，documentation 常被简称为 docs，通常指“使用说明、开发者文档、API 文档、README、教程”等；更偏向“解释与指导”。而 documents 更常指一般的“文件/文书”，不一定是说明用途。","常见搭配：documentation page(s)（文档页面）、documentation site（文档站点）、user documentation（用户文档）、technical documentation（技术文档）、supporting documentation（证明材料）、keep documentation up to date（保持文档更新）。"]}
{"word":"documentation-related","summary":{"en":"“Documentation-related” means connected to documentation work (writing/maintaining manuals, guides, records, etc.).","zh":"“documentation-related”指与文档工作相关（编写/维护手册、指南、记录等）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Connected to creating, organizing, updating, or using documents that explain how something works (such as manuals, guides, requirements, policies, or technical notes).","zh":"与编写、整理、更新或使用说明性文档有关的（如手册、指南、需求、政策或技术说明）。"},"examples":[{"en":"Documentation-related tasks include updating the user guide and fixing broken links in the wiki.","zh":"与文档相关的任务包括更新用户指南以及修复维基里的失效链接。"},{"en":"We delayed the release because of a documentation-related issue: the installation steps were incomplete.","zh":"我们推迟了发布，因为出现了一个与文档相关的问题：安装步骤不完整。"}]},{"partOfSpeech":"adj.","definition":{"en":"(In workplaces) Involving paperwork or official records rather than hands-on work.","zh":"（职场中）涉及文书材料或正式记录的，而不是实际动手操作的。"},"examples":[{"en":"The role is mostly documentation-related, so you’ll spend a lot of time writing reports.","zh":"这个岗位主要是文书相关的，所以你会花很多时间写报告。"},{"en":"He prefers fieldwork, not documentation-related duties.","zh":"他更喜欢外勤工作，不太喜欢文书类的职责。"}]}],"synonyms":["documentation","doc-related","paperwork-related","records-related","writing-related"],"phonetic":"/ˌdɑk.jə.mənˈteɪ.ʃən rɪˈleɪ.tɪd/","extraExplanation":["“documentation-related”是由名词documentation（文档/文书工作）+ related（相关的）组成的复合形容词，常用连字符连接，尤其在名词前作定语（如 documentation-related issue）。在口语或较随意的写作中也可能写成 documentation related，但在正式写作里加连字符更清晰。"]}
{"word":"documentational","summary":{"en":"“Documentational” means related to documentation or record-keeping, especially in formal/technical contexts.","zh":"“documentational”表示“与文档资料/记录保存有关的”，多用于较正式或技术性的语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Related to documentation; involving the creation, use, or management of written records and supporting materials (often in technical, legal, or administrative contexts).","zh":"与“文档/文件资料”有关的；涉及编写、使用或管理书面记录与支持材料的（常见于技术、法律或行政语境）。"},"examples":[{"en":"The team has strict documentational requirements for every software release.","zh":"团队对每次软件发布都有严格的文档资料要求。"},{"en":"We keep documentational evidence to show how the decision was made.","zh":"我们保留文件资料证据来说明决策是如何做出的。"}]}],"synonyms":["documentation-related","documentary (in the sense of written evidence)","record-keeping","administrative","paperwork-related"],"phonetic":"/ˌdɑkjəmenˈteɪʃənəl/","extraExplanation":["“documentational”在日常英语中不算常见，更常用的是“documentation (n.)（文档资料/文件）”或形容词“documentary（纪录的/记录性的）”“documentation-related（与文档相关的）”。","在法律或合规场景里，你也会看到更固定的搭配，如“documentary evidence（书面证据）”。不要把“documentational”与“documentary（纪录片的/记录性的）”混淆：前者偏“文档与资料体系”，后者更偏“记录事实、像纪录片那样”。"]}
{"word":"documentations","summary":{"en":"“Documentation(s)” means written documents that explain or prove something, and it can also mean the work of creating and keeping such records.","zh":"“Documentation(s)”指用于说明或证明的文档/资料，也可指编写与整理保存这些资料的工作。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Written materials (manuals, guides, records, or official papers) that explain how something works or provide proof/information about something.","zh":"（说明书、指南、记录或官方文件等）用于解释事物如何运作或提供证明/信息的书面资料。"},"examples":[{"en":"Please read the documentation before installing the software.","zh":"安装软件前请先阅读说明文档。"},{"en":"The company asked for documentation of your identity and address.","zh":"公司要求提供身份证明和住址证明文件。"},{"en":"Good documentation makes a product easier to use.","zh":"好的文档能让产品更容易使用。"}]},{"partOfSpeech":"n.","definition":{"en":"The act or process of creating, organizing, and keeping records or written explanations.","zh":"编写、整理并保存记录或说明资料的过程。"},"examples":[{"en":"Clear documentation helps teams work faster and avoid mistakes.","zh":"清晰的文档编写有助于团队更快协作并避免错误。"},{"en":"She is responsible for the project’s documentation.","zh":"她负责这个项目的文档工作。"}]}],"synonyms":["documents","paperwork","records","manuals","guides"],"phonetic":"/ˌdɑk.jə.mənˈteɪ.ʃən/","extraExplanation":["“documentation”通常是不可数名词（uncountable），表示“文档/资料”整体概念时更常用：the documentation。","“documentations”在日常英语里不太常见；多见于强调“多套/多份不同的文档”时，或在某些法律/官僚语境中。技术写作中一般仍倾向用“documentation”（不可数）或说“documents / manuals / guides”。"]}
{"word":"documented","summary":{"en":"“Documented” means recorded or supported by written proof; it can also mean described in detail in writing.","zh":"“documented”指“有记录/有凭证、可查证的”，也可指“被详细文字记载或说明的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Written down, recorded, or shown with proof (for example, in papers, photos, or official records).","zh":"有文字记录的；有凭证的；被证明并记录在案的。"},"examples":[{"en":"The case is well documented, with emails and receipts.","zh":"这个案件证据记录充分，有电子邮件和收据。"},{"en":"Keep a documented history of the repairs.","zh":"保留一份维修记录（有书面凭证的记录）。"}]},{"partOfSpeech":"adj.","definition":{"en":"Described in detail in writing (such as in a report, book, or software notes).","zh":"被详细记载/说明的（如在报告、书籍或软件说明中）。"},"examples":[{"en":"Her life is documented in several biographies.","zh":"她的一生被多本传记详细记载。"},{"en":"This feature is documented in the user guide.","zh":"这个功能在用户指南里有说明。"}]}],"synonyms":["recorded","written","verified","substantiated","well-attested"],"phonetic":"/ˈdɑkjəˌmɛntɪd/","extraExplanation":["“documented”常用来强调“有证据支撑、可查证”，在学术写作、新闻报道、法律语境里尤其常见。","常见搭配：well-documented（证据充分的/记录详实的）、documented evidence（书面/记录在案的证据）、documented history（有据可查的历史）。"]}
{"word":"documenter","summary":{"en":"A documenter is someone who documents information or writes documentation, especially for projects or products.","zh":"documenter 指记录信息的人，或负责撰写（项目/产品）说明文档的人。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who records information, events, or evidence in an organized way (for example, by writing reports, taking photos, or keeping notes)","zh":"记录者；撰写/整理记录的人（例如写报告、拍照或做笔记来保存信息与证据）"},"examples":[{"en":"As the project’s documenter, Maya wrote weekly summaries and kept all meeting notes.","zh":"作为项目的记录员，Maya 每周写总结并保存所有会议记录。"},{"en":"The human-rights group sent a documenter to collect witness statements.","zh":"该人权组织派了一名记录者去收集证人陈述。"}]},{"partOfSpeech":"n.","definition":{"en":"a creator who produces documentation—especially manuals, guides, or online help for software or products","zh":"（尤指软件/产品）文档编写者；说明文档作者"},"examples":[{"en":"We need a documenter to update the API guide before release.","zh":"我们需要一位文档编写者在发布前更新 API 指南。"},{"en":"Good documenters explain steps clearly and include examples.","zh":"优秀的文档作者会把步骤讲清楚，并配上示例。"}]}],"synonyms":["recorder","chronicler","note-taker","technical writer","documentation writer"],"phonetic":"/ˈdɑːkjəˌmɛnɚ/","extraExplanation":["“documenter”在日常英语里不如“documentarian（纪录片导演/纪录片工作者）”或“technical writer（技术写作/技术文档作者）”常见；在职场语境中更常指“负责写文档、做记录的人”。","在影视语境里，如果你想表达“拍纪录片的人”，更自然的说法通常是“documentarian”或“documentary filmmaker”。"]}
{"word":"documenters","summary":{"en":"“Documenters” are people who record and organize information or evidence; it can also mean documentary makers.","zh":"“documenters”指记录、整理信息或证据的人；也可指纪录片创作者。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"people who record, describe, or provide proof of something (by writing, photographing, filming, or collecting evidence)","zh":"记录、描述或提供某事证据的人（通过写作、拍照、拍摄或收集资料等）"},"examples":[{"en":"Good documenters keep clear notes so others can understand what happened later.","zh":"好的记录者会把笔记写清楚，方便别人以后理解发生了什么。"},{"en":"The project needs documenters to photograph each step of the process.","zh":"这个项目需要记录人员把流程的每一步都拍下来。"}]},{"partOfSpeech":"n.","definition":{"en":"people who make documentary-style records, especially documentary filmmakers or creators","zh":"纪录片式记录的创作者，尤指纪录片制作者（纪录片导演/拍摄者等）"},"examples":[{"en":"Many documenters focus on local communities and everyday stories.","zh":"许多纪录片创作者会关注本地社区和日常故事。"},{"en":"The festival invited documenters to share how they filmed in difficult conditions.","zh":"电影节邀请纪录片创作者分享他们如何在艰苦条件下拍摄。"}]}],"synonyms":["recorders","note-takers","archivists","scribes","documentarians"],"phonetic":"/ˈdɑkjəˌmɛntɚ/","extraExplanation":["“documenter”比较直观，强调“记录/整理资料的人”。在影视语境里，更常见、更正式的词是“documentarian”（纪录片工作者）。日常工作语境（项目、研究、会议记录）里，“documenter(s)”也会用来指负责整理文档、写记录的人。"]}
{"word":"documenting","summary":{"en":"Documenting means recording information or events in writing (or other evidence) to create a clear, usable record—often for proof or instructions.","zh":"Documenting 指把信息或事件记录下来（文字或其他证据），形成清晰可用的记录，常用于证明事实或编写说明。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"the act of writing down information to create a clear record (notes, reports, instructions, evidence, etc.)","zh":"把信息写下来以形成清晰记录的行为（如笔记、报告、说明、证据等）。"},"examples":[{"en":"She is documenting the meeting so everyone can remember the decisions.","zh":"她正在记录会议内容，好让大家记住做出的决定。"},{"en":"Documenting your symptoms can help the doctor understand what’s happening.","zh":"记录你的症状可以帮助医生更好地了解情况。"}]},{"partOfSpeech":"v.","definition":{"en":"recording events or facts with proof (photos, sources, data) to show something is true","zh":"用证据（照片、来源、数据等）记录事实或事件，以证明某事属实。"},"examples":[{"en":"The journalist is documenting the damage with photos and interviews.","zh":"记者正在用照片和采访记录损害情况。"},{"en":"Researchers are documenting changes in the climate over time.","zh":"研究人员正在记录气候随时间的变化。"}]},{"partOfSpeech":"v.","definition":{"en":"writing instructions or explanations for how something works, especially in work or technology (documentation)","zh":"编写说明或解释来描述某物如何运作，尤指工作或技术领域（文档/说明文档）。"},"examples":[{"en":"He’s documenting the software so new users can learn it quickly.","zh":"他在编写软件说明文档，让新用户能更快上手。"},{"en":"We spent the afternoon documenting the new process step by step.","zh":"我们花了一下午把新流程一步一步写成文档。"}]}],"synonyms":["recording","writing down","logging","noting","capturing","reporting"],"phonetic":"/ˈdɑkjəˌmɛntɪŋ/","extraExplanation":["“documenting”是动词“document”的现在分词/动名词形式：\n- 现在进行时：She is documenting…（她正在记录…）\n- 动名词作名词用：Documenting takes time.（做文档/记录很费时间。）","在职场与技术语境里，“documenting”常指把流程、需求、API、操作步骤写成可复用的说明文档（documentation），强调“让别人也能看懂并照做”。"]}
{"word":"documentize","summary":{"en":"“Documentize” means to write something up and turn it into formal documentation; it’s less common than “document.”","zh":"“documentize”指把内容写成正式文档/记录，但比“document”更不常用。"},"definitions":[{"partOfSpeech":"vt.","definition":{"en":"to create written records of something; to put information into documents (often used in business or technical contexts).","zh":"把某事写成记录；把信息整理成文件（常见于商务或技术语境）。"},"examples":[{"en":"Please documentize the meeting notes and upload them to the shared drive.","zh":"请把会议记录整理成文件并上传到共享盘。"},{"en":"We need to documentize the process so new team members can follow it.","zh":"我们需要把流程文档化，方便新成员照着做。"}]}],"synonyms":["document","record","write up","put into writing"],"phonetic":"/ˈdɑk.jə.mən.taɪz/","extraExplanation":["“documentize”在现代英语里不算常见，更自然、标准的说法通常是“document”（动词：记录/写成文档）或“document something”。在职场英语中也常用“document the process / document the decision”。","词尾“-ize”常表示“使……成为/使……化”，所以“documentize”字面意思接近“使之成为文档”。但因为“document”本身已经能表达这个动作，“documentize”听起来会偏“官样/生硬”。"]}
{"word":"documentor","summary":{"en":"A “documentor” is someone (or sometimes a tool) that records and organizes information as documentation.","zh":"“documentor”指负责记录并整理信息、形成文档的人（有时也可指记录工具）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person (or sometimes a tool) that documents something by recording information, evidence, or events","zh":"记录者；（有时指工具）用于记录信息、证据或事件的人/物"},"examples":[{"en":"She worked as a documentor for the research team, writing clear notes after every interview.","zh":"她在研究团队担任记录员，每次访谈后都会写清晰的记录。"},{"en":"In the project, one student was the documentor who kept track of decisions and changes.","zh":"在这个项目里，有一名学生负责当记录者，追踪所有决定和变更。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a writer or creator who documents real life (similar to a documentary filmmaker or journalist)","zh":"（较少见）记录现实生活的创作者（类似纪录片导演或记者）"},"examples":[{"en":"As a documentor of urban history, he collected photos and stories from longtime residents.","zh":"作为城市历史的记录者，他收集了老居民的照片和故事。"}]}],"synonyms":["documenter","recorder","scribe","note-taker","archivist"],"phonetic":"/ˈdɑk.jə.mɛn.tɚ/","extraExplanation":["“documentor”在现代英语里不算常见，更常见的说法是“documenter”或“documentation specialist”。在职场语境中，“documentor”有时会出现在流程管理、软件开发或合规领域，用来指负责撰写与维护文档的人。","词根来自“document”（文件；记录）+ “-or”（表示“做某事的人/物”）。"]}
{"word":"documents","summary":{"en":"“Documents” most often means files/papers used as records or proof; it can also be the verb “to document” (to record).","zh":"“documents”多指用于记录或证明的文件/文档；也可作动词“记录、存档”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Plural of document) written or printed papers, or digital files, that give information or serve as proof/records.","zh":"（document 的复数）文件；文档；资料：用于提供信息或作为证据/记录的纸质材料或电子文件。"},"examples":[{"en":"Please upload the required documents before Friday.","zh":"请在周五之前上传所需文件。"},{"en":"Keep these documents in a safe place for future reference.","zh":"把这些资料放在安全的地方，以备日后查阅。"}]},{"partOfSpeech":"v.","definition":{"en":"To record something in writing, photos, video, or data so it can be used as evidence or a clear record.","zh":"记录；将……存档：用文字、照片、视频或数据把事情记录下来，作为证据或清晰的记录。"},"examples":[{"en":"The journalist documents events as they happen.","zh":"记者会把事件发生的过程记录下来。"},{"en":"Be sure to document your expenses for the trip.","zh":"务必记录这次旅行的花费。"}]}],"synonyms":["papers","files","records","documentation","certificates"],"phonetic":"/ˈdɑk.jə.mənt/","extraExplanation":["在日常英语里，document（名词）既可指“纸质文件/证件”（如 passport、contract），也常指“电子文档”（如 Word document、PDF）。在工作场景中，documents 常泛指“一套材料/一叠文件”。","注意重音差异：名词 document 重音通常在前（DOCK-yuh-ment），动词 document 重音通常在后（dok-yuh-MENT）。这能帮助你听懂别人说的是“文件”还是“记录”。","常见搭配：supporting documents（证明材料）、identity documents（身份证明文件）、official documents（官方文件）、document a process（记录流程）、documented evidence（有记录的证据）。"]}
{"word":"documentum","summary":{"en":"Documentum is a well-known enterprise document/content management platform (a product name).","zh":"Documentum是知名的企业文档/内容管理平台（产品名称）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a brand name for an enterprise content management (ECM) and document management software platform used to store, organize, secure, and manage business documents and records (originally by Documentum, later part of EMC, and now under OpenText).","zh":"Documentum（产品名）：一种企业内容管理（ECM）/文档管理软件平台，用于存储、组织、保护并管理企业文档与记录（最初为Documentum公司产品，后并入EMC，现归OpenText旗下）。"},"examples":[{"en":"Our company uses Documentum to manage contracts, invoices, and compliance records.","zh":"我们公司用Documentum来管理合同、发票和合规记录。"},{"en":"The team migrated thousands of files into Documentum to centralize access control.","zh":"团队把成千上万的文件迁移到Documentum里，以集中管理访问权限。"}]}],"synonyms":["ECM platform","document management system","content management system"],"phonetic":"/ˌdɑkjəˈmɛntəm/","extraExplanation":["Documentum通常出现在IT/企业软件语境中，更像“产品/平台名称”而不是普通词汇。日常写作里常写作Documentum（首字母大写）。","在企业里它常与“records management（档案/记录管理）”“workflow（工作流）”“compliance（合规）”“repository（内容库）”等词一起出现。"]}

