{"word":"DOD","summary":{"en":"DOD most commonly means the (U.S.) Department of Defense; it can also mean ‘due on delivery’ in some business contexts.","zh":"DOD最常指（美国）国防部；在部分商业语境中也可指“货到付款”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(especially in the U.S.) the Department of Defense; the government department responsible for the armed forces and national defense.","zh":"（尤指美国）国防部；负责军队与国家防务的政府部门。"},"examples":[{"en":"The DOD announced a new cybersecurity policy.","zh":"美国国防部（DOD）公布了一项新的网络安全政策。"},{"en":"She works for the DOD as a civilian analyst.","zh":"她以文职分析员的身份在国防部（DOD）工作。"}]},{"partOfSpeech":"other","definition":{"en":"In business or documents, short for ‘due on delivery’ (payment must be made when goods are delivered).","zh":"（商业/单据中）“货到付款”的缩写，表示货物送达时必须付款。"},"examples":[{"en":"The invoice is marked DOD, so please pay the driver when the package arrives.","zh":"发票上标注为DOD，所以包裹到达时请当场付款给送货员。"}]}],"synonyms":["DoD","Department of Defense","U.S. Department of Defense","due on delivery"],"phonetic":"/ˌdiː.oʊˈdiː/","extraExplanation":["“DOD”通常写作“DoD”（大小写混用），在美国语境里最常指 U.S. Department of Defense（美国国防部）。在非美国语境或不同领域中也可能有别的含义；读到缩写时最好结合上下文（如政府、军事、合同条款等）判断。"]}
{"word":"DoD","summary":{"en":"DoD most commonly means the U.S. Department of Defense; less commonly, it can mean “day of death.”","zh":"DoD最常指美国国防部；较少见时也可指“死亡日期”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(U.S.) Department of Defense: the federal government department responsible for the U.S. military and national defense.","zh":"（美国）国防部：负责美国军事与国防事务的联邦政府部门。"},"examples":[{"en":"The DoD announced new cybersecurity guidelines for contractors.","zh":"美国国防部（DoD）发布了针对承包商的新网络安全指南。"},{"en":"She works on a DoD-funded research project.","zh":"她在一个由美国国防部资助的研究项目中工作。"}]},{"partOfSpeech":"n.","definition":{"en":"(Less common) Day of death: a shortened note used in records or timelines to mean the date someone died.","zh":"（较少见）死亡日期：在记录或时间线中用于表示某人去世日期的缩写。"},"examples":[{"en":"The biography lists his DoB and DoD.","zh":"这本传记列出了他的出生日期（DoB）和死亡日期（DoD）。"}]}],"synonyms":["U.S. Department of Defense","Defense Department"],"phonetic":"/ˌdi oʊ ˈdi/","extraExplanation":["“DoD”最常见的用法是指美国“Department of Defense”，通常出现在新闻、政策文件、军工与网络安全相关语境中。","作为“死亡日期”时，DoD常与DoB（date of birth，出生日期）并列出现，多见于族谱、档案、简历时间线或历史资料。"]}
{"word":"dod","summary":{"en":"“DoD” most commonly means the U.S. Department of Defense; “dod” can rarely mean a small bob/nod in older or dialect use.","zh":"“DoD”最常指美国国防部；“dod”在较旧或方言用法中也可指轻轻上下点动/点头。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the U.S. Department of Defense (an acronym used in news, government documents, and everyday conversation in the U.S.)","zh":"（美国）国防部（常见缩写，用于新闻、政府文件与日常语境）"},"examples":[{"en":"The DoD announced a new policy on cybersecurity.","zh":"美国国防部（DoD）宣布了一项新的网络安全政策。"},{"en":"She works for the DoD as a civilian engineer.","zh":"她在美国国防部（DoD）工作，是一名文职工程师。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a quick bob or nod; a small movement up and down (often seen in some dialects or older writing)","zh":"（较少见）快速的点头/上下轻轻一动；小幅度上下摆动（多见于方言或较旧的用法）"},"examples":[{"en":"He gave a little dod of his head and walked on.","zh":"他轻轻点了点头，然后继续走。"}]}],"synonyms":["Department of Defense","U.S. Pentagon"],"phonetic":"/diː oʊ diː/","extraExplanation":["在美国语境中，DoD 几乎总是指 Department of Defense（国防部），写作常用大写 “DoD”。在正式写作里通常第一次会写全称，后面再用 DoD。"]}
{"word":"Dodd","summary":{"en":"Dodd is most commonly a surname; less commonly, it can be a place name.","zh":"Dodd 最常见是姓氏；较少见时也可作地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname); also used as a given name in some cases","zh":"姓氏；有时也可用作名字"},"examples":[{"en":"Dr. Dodd will see you at 3 p.m.","zh":"Dodd 医生会在下午三点见你。"},{"en":"Her last name is Dodd.","zh":"她的姓是 Dodd。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name in English-speaking regions (less common)","zh":"地名（在英语地区较少见）"},"examples":[{"en":"They hiked near a hill known locally as Dodd.","zh":"他们在当地被称为 Dodd 的山丘附近徒步。"}]}],"phonetic":"/dɑd/","extraExplanation":["“Dodd”在英语里最常见是姓氏。它可能源自中世纪英语的昵称或短名（与“Dod/Dodd”这类名字形式有关），后来固定为家族姓。不同家族的来源未必相同，因此具体家族的词源需要结合族谱或地区记录。","作为地名时，常见于英国等地的地形称呼或局部地名用法；如果你指的是某个具体地点或人物（例如文学作品、历史人物），告诉我上下文我可以更精准解释。"]}
{"word":"dodd","summary":{"en":"Dodd is most commonly a surname; in formal documents, DoDD can mean “Department of Defense Directive.”","zh":"Dodd 最常见是姓氏；在正式文件中，DoDD 也可表示“国防部指令”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a family name (surname), most often seen as a last name in English-speaking countries","zh":"姓氏（英语国家常见的家族姓）"},"examples":[{"en":"My teacher’s last name is Dodd.","zh":"我老师的姓是 Dodd。"},{"en":"Ms. Dodd will lead the meeting today.","zh":"Dodd 女士今天将主持会议。"}]},{"partOfSpeech":"other","definition":{"en":"an abbreviation for “Department of Defense Directive” (DoDD), used in U.S. military/government documents","zh":"“Department of Defense Directive（国防部指令）”的缩写（DoDD），用于美国军方/政府文件"},"examples":[{"en":"This policy is described in DoDD 5100.01.","zh":"这项政策在 DoDD 5100.01 中有说明。"},{"en":"The report references several DoDD documents.","zh":"报告引用了几份 DoDD 文件。"}]}],"phonetic":"/dɑd/","extraExplanation":["“Dodd”单独出现时，最常见是姓氏。你也可能在新闻里看到“Dodd-Frank Act（多德-弗兰克法案）”，这是美国2010年金融监管改革法案的简称，其中的“Dodd”来自参议员Christopher Dodd 的姓。","如果你看到的是全大写或带点的缩写（如 DoDD），通常是在军事/政府语境中，指“国防部指令”。"]}
{"word":"doddard","summary":{"en":"Doddard is mainly used as a surname (last name).","zh":"Doddard 主要用作英文姓氏（人的姓）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A family name (surname). It is not a common modern English vocabulary word, and it is usually used as a person’s last name.","zh":"一个姓氏（家族姓）。它通常不是常见的英语词汇，多用作人的姓。"},"examples":[{"en":"Ms. Doddard will lead the meeting today.","zh":"Doddard 女士今天将主持会议。"},{"en":"I saw the name Doddard on the office door.","zh":"我在办公室门上看到了 Doddard 这个名字。"}]}],"phonetic":"/ˈdɑdərd/","extraExplanation":["“Doddard”更可能是专有名词（姓氏）。如果你是在阅读中遇到它、或想查词义但觉得不对劲，也有可能是拼写误差（例如更常见的姓氏“Goddard”）。","作为姓氏时，它通常不需要翻译“意思”，而是保持原拼写；中文里多音译或直接保留英文。"]}
{"word":"doddart","summary":{"en":"Doddart is most commonly a British-origin surname; more rarely it may appear as a UK place name in older sources.","zh":"Doddart 最常见是源自英国的姓氏；较少情况下在旧资料中也可能作为英国地名出现。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), originally from Britain; used to refer to people with the last name Doddart.","zh":"多达特（姓氏）：源自英国的姓，用来称呼姓 Doddart 的人。"},"examples":[{"en":"Dr. Doddart will give the opening talk.","zh":"Doddart 医生将做开场演讲。"},{"en":"I met someone named Doddart at the conference.","zh":"我在会议上遇到一位姓 Doddart 的人。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a place name in the UK (seen in some older records and local references).","zh":"（较少见）英国的地名（在一些较旧的记录或地方引用中可见）。"},"examples":[{"en":"The old map marks a small area labeled “Doddart.”","zh":"那张旧地图标出一个标为“Doddart”的小地方。"}]}],"synonyms":["(as a surname) family name","last name"],"phonetic":"/ˈdɑdɑrt/","extraExplanation":["“Doddart”多见于英语世界的姓氏。英语里姓氏常来自职业、地名或祖先名字的变体；在历史拼写尚未统一的时期，同一个家族姓氏可能出现不同拼法（例如 Dod(d)art / Doddard 等），所以在档案或族谱里可能会看到相近形式。","如果你指的是著名人物：化学家 Sir J. Fraser Stoddart 的姓是“Stoddart”，与“Doddart”只差一个字母，容易混淆。"]}
{"word":"dodded","summary":{"en":"“Dodded” usually means “hornless (polled),” especially in older or dialect farm English; it can also be the past form of “dod,” meaning to cut something short/trim off.","zh":"“dodded”多指（旧式/方言农事用语中）“无角的、去角的（polled）”；也可作动词 dod 的过去式/过去分词，表示“剪短、削去”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of an animal, especially cattle or sheep) having no horns; hornless; polled.","zh":"（尤指牛、羊等）无角的；去角的（= polled）。"},"examples":[{"en":"The farmer keeps a few dodded cattle because they’re safer to handle.","zh":"农场主养了几头无角牛，因为更安全、好管理。"},{"en":"A dodded ram is less likely to injure other animals in the pen.","zh":"无角公羊不太容易在圈里伤到其他动物。"}]},{"partOfSpeech":"vt.","definition":{"en":"Past tense/past participle of \"dod\": to cut something short or blunt; (dialect) to remove or trim off horns or a top part.","zh":"“dod”的过去式/过去分词：把……剪短、削钝；（方言）把角或顶部部分剪掉/去掉。"},"examples":[{"en":"They dodded the branches back to keep the hedge neat.","zh":"他们把枝条剪短，让树篱整齐。"},{"en":"In older farm writing, you may see “dodded” used for animals that had their horns removed.","zh":"在较早的农事文字里，你可能会看到用 dodded 表示“被去角的”动物。"}]}],"synonyms":["hornless","polled","dehorned (context-dependent)","trimmed (for the verb sense)"],"phonetic":"/ˈdɑdɪd/","extraExplanation":["“dodded”不算现代日常英语高频词，更常见于英式方言（尤其苏格兰、英格兰北部）或较老的农业语境。现代更常用的对应说法是 polled（天生无角）或 dehorned（人工去角）。","注意不要和 doddered（老态龙钟、步态蹒跚的）混淆；doddered 的词源和含义都不同。"]}
{"word":"dodder","summary":{"en":"“Dodder” is a parasitic plant with thread-like stems; as a verb/adjective, it means to move or act unsteadily, often used (sometimes rudely) about elderly people.","zh":"“dodder”既指菟丝子（一种细茎寄生植物），也可作动词/形容词表示蹒跚不稳或迟缓健忘（形容老人时可能不礼貌）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a yellow or orange parasitic plant with very thin, thread-like stems that wraps around other plants and takes nutrients from them","zh":"菟丝子；一种黄色或橙色的寄生植物，茎细如线，会缠绕在其他植物上并吸取养分"},"examples":[{"en":"Dodder wrapped around the tomato plants like tangled orange threads.","zh":"菟丝子像纠结的橙色细线一样缠在番茄植株上。"},{"en":"Because dodder is parasitic, it can weaken the host plant over time.","zh":"因为菟丝子是寄生植物，时间久了会削弱寄主植物。"}]},{"partOfSpeech":"vi.","definition":{"en":"to move unsteadily or weakly, as if you might fall","zh":"蹒跚；摇摇晃晃地走，像随时会跌倒一样"},"examples":[{"en":"After getting up too fast, he doddered to the kitchen for a glass of water.","zh":"他起身太快，便摇摇晃晃地走到厨房去倒水。"},{"en":"The exhausted hiker doddered down the last part of the trail.","zh":"精疲力尽的徒步者蹒跚着走完了最后一段山路。"}]},{"partOfSpeech":"vi.","definition":{"en":"to act in a slow, uncertain, or forgetful way (often used about elderly people, sometimes disrespectfully)","zh":"（常指老年人）举止迟缓、犹豫或健忘地行动（有时带不尊重的语气）"},"examples":[{"en":"The movie portrays him as a doddering old man, which some viewers find unfair.","zh":"电影把他刻画成一个糊涂迟缓的老人，有些观众觉得不公平。"},{"en":"Try not to use “doddering” to describe real people—it can sound rude.","zh":"尽量不要用“doddering”来形容现实中的人，因为听起来可能很无礼。"}]},{"partOfSpeech":"adj.","definition":{"en":"moving or acting in a weak, unsteady way","zh":"蹒跚的；虚弱不稳的"},"examples":[{"en":"He gave a doddering step and grabbed the railing.","zh":"他踉跄了一步，赶紧抓住栏杆。"},{"en":"The novel describes a doddering figure crossing the street at dusk.","zh":"小说描写了一个蹒跚的身影在黄昏时过街。"}]}],"synonyms":["(plant) Cuscuta","(move unsteadily) totter","stagger","wobble","teeter","(slow/forgetful, often negative) senile"],"phonetic":"/ˈdɑdɚ/","extraExplanation":["“dodder”（名词，菟丝子）是一类寄生藤本植物的统称，常见于花园或农田，会像“细线”一样缠绕在寄主植物上。英语里也常把它比喻成“纠缠不清的东西”。","动词/形容词的“dodder/doddering”多用于描述步态不稳或精神状态迟缓。用于形容人时可能带有贬义或年龄歧视色彩，更中性的说法可以用 “unsteady,” “frail,” “shaky,” 或 “slow-moving”。"]}
{"word":"dodder-laurel","summary":{"en":"Dodder-laurel is a parasitic, threadlike vine in the laurel family that twines around other plants.","zh":"dodder-laurel 指桂科的寄生细丝状藤蔓，常缠绕其他植物生长。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a parasitic, threadlike vine (genus Cassytha, in the laurel family) that twines around other plants and steals water and nutrients.","zh":"菟丝桂（寄生藤本植物；桂科无叶、细丝状藤蔓，缠绕其他植物吸取水分与养分）。"},"examples":[{"en":"Dodder-laurel wraps tightly around shrubs and slowly weakens them.","zh":"菟丝桂会紧紧缠绕灌木，逐渐削弱它们。"},{"en":"In coastal habitats, dodder-laurel often grows over low bushes and grasses.","zh":"在海岸栖地里，菟丝桂常常覆盖在低矮灌木和草本植物上。"}]}],"synonyms":["Cassytha","love vine"],"phonetic":"/ˈdɑdɚ ˈlɔrəl/","extraExplanation":["“Dodder-laurel”之所以叫这个名字，是因为它外形像“dodder（菟丝子属，Cuscuta）”那样呈细丝状、会寄生缠绕；但它并不属于旋花科的菟丝子属，而通常指桂科的Cassytha属（如Cassytha filiformis）。因此中文资料里有时会与“菟丝子/菟丝”混淆。","在自然描写或园艺语境中，它常被提到是“会覆盖、缠绕、夺取养分”的寄生藤；如果你在读植物志或生态文章，看到它与“coastal scrub（海岸灌丛）/heath（荒原灌丛）”等栖地一起出现很常见。"]}
{"word":"dodder-like","summary":{"en":"Dodder-like means resembling dodder—thin, threadlike, twining (often parasitic) vines; more rarely, it can mean shaky or unsteady like someone who dodders.","zh":"Dodder-like 指“像菟丝子一样”的：细丝状、缠绕（常带寄生感）的藤蔓；较少见时也可指像蹒跚的人一样步态摇晃。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Resembling dodder (a thin, threadlike, twining parasitic vine), especially in appearance or growth habit.","zh":"像菟丝子（一种细如丝线、缠绕生长的寄生藤）一样的；指外形或生长方式相似。"},"examples":[{"en":"The fence was covered with dodder-like strands that wrapped around every stem.","zh":"栅栏上覆满了菟丝子般的细丝状藤蔓，缠住了每一根茎。"},{"en":"A dodder-like vine climbed over the shrubs and weakened them.","zh":"一种菟丝子似的藤蔓爬满灌木，使它们变得衰弱。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Rare) Resembling a person who “dodders”; shaky or unsteady in movement.","zh":"（少见）像“蹒跚而行的人”一样的；步态摇晃、不稳的。"},"examples":[{"en":"After standing up too fast, he took a few dodder-like steps.","zh":"他起身太快后，走了几步像蹒跚一样不太稳。"},{"en":"The character’s dodder-like walk showed his age.","zh":"这个角色蹒跚的步态显示出他的年迈。"}]}],"synonyms":["threadlike","stringy","twining","vine-like","parasitic (context-dependent)","wobbly (rare sense)","unsteady (rare sense)"],"phonetic":"/ˈdɑdɚ laɪk/","extraExplanation":["“dodder”在植物学里指菟丝子（Cuscuta），细长如线、没有明显叶绿素，常缠绕在其他植物上吸取养分；因此“dodder-like”常用来形容“细丝状、缠绕、依附/寄生”的外观或状态。","第二个含义来自动词/形容词“dodder/doddering”（蹒跚、摇晃），但“dodder-like”用来形容步态较少见；更常见的说法是“doddering (old man)”或“unsteady/wobbly steps”。"]}
{"word":"doddered","summary":{"en":"“Doddered” usually describes someone very old and weak or forgetful; it can also mean “walked unsteadily.”","zh":"“doddered”通常指人年老体弱或健忘糊涂；也可指“蹒跚地走”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Old and weak in body or mind (often used to describe an elderly person who is unsteady or forgetful).","zh":"（常指老人）年老体弱、行动不稳或精神衰退（如健忘、糊涂）的。"},"examples":[{"en":"The doddered man walked slowly with a cane.","zh":"那位年迈体弱的老人拄着拐杖慢慢走。"},{"en":"She worried people would see her as doddered just because she asked the same question twice.","zh":"她担心别人会因为她同一个问题问了两遍，就把她看作老糊涂了。"}]},{"partOfSpeech":"v.","definition":{"en":"To walk with short, weak, unsteady steps; to totter.","zh":"蹒跚而行；摇摇晃晃地走。"},"examples":[{"en":"He doddered across the room to answer the door.","zh":"他摇摇晃晃地穿过房间去开门。"},{"en":"The child doddered a few steps and then sat down.","zh":"孩子踉踉跄跄走了几步就坐下了。"}]}],"synonyms":["frail","tottering","unsteady","senile (often offensive)","wobbly"],"phonetic":"/ˈdɑdɚd/","extraExplanation":["“doddered”既可以是形容词（表示“年老体弱/老糊涂的”），也可以是动词dodder的过去式/过去分词（表示“蹒跚而行”）。在现代英语里，形容人的用法更常见。","语气提醒：用“doddered / doddering”描述老人有时带一点贬义或不尊重的感觉。更中性、礼貌的表达可以用“elderly,” “frail,” “unsteady,” “having memory problems”等。"]}
{"word":"dodderer","summary":{"en":"A “dodderer” is someone who is very unsteady and slow, especially an elderly or frail person.","zh":"“dodderer”指行动不稳、迟缓的人，尤其指年老或体弱的人，常带贬义。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who moves or acts slowly and weakly, often because they are old or feeble","zh":"行动迟缓、步履蹒跚的人（常因年老或身体虚弱）"},"examples":[{"en":"The neighborhood kids teased him as a dodderer, but he was still sharp-minded.","zh":"附近的孩子嘲笑他是个步履蹒跚的老头，但他头脑依然清楚。"},{"en":"He feared becoming a dodderer who needed help with everything.","zh":"他害怕自己会变成一个事事都需要人帮忙的蹒跚老人。"}]}],"synonyms":["old-timer","weakling","geezer (informal, often rude)","codger (informal)"],"phonetic":"/ˈdɑdɚɚ/","extraExplanation":["“dodderer”通常带有贬义或嘲讽色彩，用来评价某人“老态龙钟、没精神”。在正式或更尊重的语境中，可以用“an elderly person”或“a frail older adult”。","词根来自动词“dodder”（摇摇晃晃地走）。在文学或影视描写里，它常用来营造某人衰老、无力甚至有点可笑的形象，因此使用时要注意礼貌与语气。"]}
{"word":"dodderers","summary":{"en":"“Dodderers” means old people who move unsteadily, often with a slightly insulting tone.","zh":"“Dodderers”指步履蹒跚的老人，常带一点贬义或不友善的语气。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"an old person who walks in a weak, unsteady way; often implying frailty or forgetfulness","zh":"（常带贬义）步履蹒跚、行动不稳的老人；也常暗示年老体弱或糊涂健忘"},"examples":[{"en":"The narrow stairs were difficult for dodderers to climb safely.","zh":"狭窄的楼梯让步履蹒跚的老人很难安全上下。"},{"en":"The comedy made the grandparents look like dodderers, which some viewers found unkind.","zh":"那部喜剧把祖父母塑造成糊涂蹒跚的老人，让一些观众觉得不太友善。"}]}],"synonyms":["old-timers","geezers","elderly people","older adults","seniors"],"phonetic":"/ˈdɑdərər/","extraExplanation":["“dodderers”是“dodderer”的复数。语气通常带有不尊重或刻薄的感觉，描述年长者时更礼貌的说法有“elderly people / older adults / seniors”。","词根来自动词“to dodder”，意思是“摇摇晃晃地走、颤巍巍地动”，常用来描写因年老或虚弱而步伐不稳。"]}
{"word":"doddering","summary":{"en":"“Doddering” means very unsteady in walking, usually because of old age; it can also (often rudely) suggest an old person is mentally confused or slow.","zh":"“doddering”指（通常因年老）走路摇晃不稳；也可（常带贬义）指老人反应迟钝、糊涂。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"shaking and unsteady when walking, especially because someone is old or weak","zh":"（走路）摇摇晃晃、不稳的（尤指因年老或身体虚弱）"},"examples":[{"en":"The doddering old man crossed the street slowly with a cane.","zh":"那位步履蹒跚的老人拄着拐杖慢慢过马路。"},{"en":"She gave her doddering grandfather an arm to hold.","zh":"她让步履不稳的祖父挽着她的胳膊。"}]},{"partOfSpeech":"adj.","definition":{"en":"very old and seeming mentally slow or confused (often used in a rude or unkind way)","zh":"老糊涂的；年迈而显得反应迟钝或糊涂的（常带不礼貌或刻薄意味）"},"examples":[{"en":"It’s unfair to call him doddering—he just forgot one name.","zh":"叫他“老糊涂”不公平——他只是忘了一个名字而已。"},{"en":"The story features a doddering king who relies on others to decide everything.","zh":"故事里有一位老糊涂的国王，什么事都依赖别人做决定。"}]}],"synonyms":["unsteady","shaky","tottering","feeble","frail"],"phonetic":"/ˈdɑdərɪŋ/","extraExplanation":["“doddering”来自动词“dodder”，原意有“摇摇晃晃地走、蹒跚”的感觉。形容人时，既可指身体不稳，也常被用来暗示“年老糊涂”。在日常交流中，第二种用法可能带有贬义；如果想更礼貌，可以说“elderly and unsteady / having some memory problems”。"]}
{"word":"dodders","summary":{"en":"“Dodders” most commonly means parasitic plants (plural of dodder). “To dodder” also means to walk unsteadily, especially due to age or weakness.","zh":"“Dodders”通常指菟丝子等寄生植物（dodder 的复数）。“to dodder”也可作动词，表示因年老或虚弱而步履蹒跚。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a parasitic plant (dodder) with thin, thread-like stems that wraps around other plants and takes nutrients from them; plural form of “dodder.”","zh":"菟丝子（寄生植物）：茎细如线，会缠绕在其他植物上并吸取养分；“dodder”的复数。"},"examples":[{"en":"Dodders can weaken crops by stealing water and nutrients from the host plants.","zh":"菟丝子会从寄主植物那里夺取水分和养分，从而削弱农作物。"},{"en":"We found dodders tangled around the wildflowers along the fence.","zh":"我们发现篱笆旁的野花上缠着一团团菟丝子。"}]},{"partOfSpeech":"vi.","definition":{"en":"to walk in a weak, unsteady way; to totter (often used for very old people).","zh":"蹒跚而行；步伐虚弱不稳（常用于形容老人）。"},"examples":[{"en":"The old man doddered across the street with a cane.","zh":"那位老人拄着拐杖蹒跚地穿过马路。"},{"en":"After the long hike, I doddered back to the car, exhausted.","zh":"长途徒步后，我筋疲力尽，步履蹒跚地回到车旁。"}]}],"synonyms":["totter","stagger","shuffle","parasitic vine"],"phonetic":"/ˈdɑdər/","extraExplanation":["“dodder（菟丝子）”在植物学里很常见：它几乎没有叶绿素，靠“缠绕+吸取寄主养分”生存，所以常被视为农田或园艺中的有害寄生杂草。","动词“dodder”描写的是“摇摇晃晃、脚步不稳”的走路方式，带一点形象化的画面感；用于人时语气通常中性或略带怜悯，但用在他人身上时注意场合，避免显得不礼貌。"]}
{"word":"doddery","summary":{"en":"Doddery describes someone—usually elderly—who is weak, shaky, and unsteady.","zh":"Doddery 形容（通常是老人）虚弱、发抖、走路不稳的样子。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a person, usually elderly) weak and unsteady, especially in movement; shaky and slightly confused.","zh":"（多指年长者）虚弱摇晃的；步伐不稳的；有点糊涂的。"},"examples":[{"en":"A doddery old man walked slowly across the street with a cane.","zh":"一位步履蹒跚的老人拄着拐杖慢慢走过马路。"},{"en":"She sounded doddery on the phone, forgetting what she had just said.","zh":"她在电话里听起来有点糊涂，刚说过的话又忘了。"}]}],"synonyms":["frail","shaky","unsteady","wobbly","feeble"],"phonetic":"/ˈdɑdəri/","extraExplanation":["“doddery”常带一点不太礼貌或略带嘲讽的语气，用来形容老人“老态龙钟、摇摇晃晃”。写作或正式场合可用更中性的说法，如“frail（虚弱的）”“unsteady（不稳的）”“elderly（年长的）”。","词源上与动词“dodder（摇晃、蹒跚）”相关，形象地描写走路不稳、身体发抖的样子。"]}
{"word":"doddie","summary":{"en":"“Doddie” is usually a personal nickname/name; in Scottish English it can also mean a hornless cow.","zh":"“Doddie”通常是人名/昵称；在苏格兰英语中也可指“无角牛”。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a nickname or given name (often for Dorothy or for someone named Dod/Dodson); also used as a personal nickname in Scotland","zh":"昵称或名字（常见于 Dorothy 的昵称，或与 Dod/Dodson 等名字相关）；在苏格兰也常用作个人昵称"},"examples":[{"en":"Her friends call her Doddie, but her full name is Dorothy.","zh":"朋友们叫她 Doddie，但她的全名是 Dorothy。"},{"en":"In the rugby community, Doddie is remembered as a beloved figure.","zh":"在橄榄球圈里，Doddie 被视为一位深受喜爱的人物。"}]},{"partOfSpeech":"n.","definition":{"en":"(Scottish English, informal) a hornless cow or bull; an animal with short or missing horns","zh":"（苏格兰英语，非正式）无角的牛；角很短或没有角的家畜"},"examples":[{"en":"They kept a few doddies on the hill farm.","zh":"他们在山地农场养了几头无角牛。"},{"en":"That calf is a doddie—no horns at all.","zh":"那头小牛是无角的——完全没有角。"}]}],"synonyms":["Dorothy (as a source name)","nickname","(Scots) polled (hornless)"],"phonetic":"/ˈdɑdi/","extraExplanation":["“Doddie”在苏格兰语境里很有辨识度：它既可能是人名/昵称，也可能是方言词。著名人物包括苏格兰前橄榄球运动员 Doddie Weir（多迪·威尔），他的慈善基金会 “My Name’5 Doddie” 用于支持渐冻症（MND/ALS）相关研究与患者。","苏格兰方言里的 “doddie” 与 “dodded”（去角的/角短的）有关，因此可指“无角牛”。在正式英语写作中较少见，多出现在地方口语、乡村生活描写或文学方言中。"]}
{"word":"doddies","summary":{"en":"“Doddies” is a dialect plural meaning hornless cows, and sometimes short/stubby people or things.","zh":"“doddies”是方言複數，主要指無角的牛；有時也指矮胖或短粗的人/物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(dialect, UK/Scotland) Hornless cattle; cows without horns (plural of “doddy”).","zh":"（英國/蘇格蘭方言）無角的牛；沒有角的母牛（“doddy”的複數）。"},"examples":[{"en":"The farmer keeps a few doddies because they’re easier to handle.","zh":"農夫養了幾頭無角牛，因為比較好管理。"},{"en":"In some places, hornless cows are called doddies.","zh":"在有些地方，無角的母牛會被叫作 doddies。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, dialect) Short, stubby people or things (plural of “doddy”).","zh":"（非正式/方言）矮胖、短粗的人或東西（“doddy”的複數）。"},"examples":[{"en":"He joked that the small stools were “little doddies.”","zh":"他開玩笑說那些小凳子是「矮矮短短的小東西」。"},{"en":"The boots looked like doddies next to the tall ones.","zh":"那些靴子跟高筒靴比起來，看起來又短又笨重。"}]}],"synonyms":["hornless cows","polled cattle","stubbies"],"phonetic":"ˈdɑdi","extraExplanation":["「doddies」多見於英國北部、蘇格蘭等地的方言用法；在標準英語裡更常說 hornless cows 或 polled cattle。","若你是在特定文本、地名、品牌或人名裡看到 Doddies（首字母大寫），也可能是專有名詞；你可以貼出句子，我能幫你判斷語境。"]}
{"word":"dodding","summary":{"en":"“Dodding” is a rare dialect word meaning “nodding/bobbing up and down.”","zh":"“dodding”是较少见的方言用词，意思是“轻轻点动/上下摇摆”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Dialect, mainly British/Scottish) moving up and down in short, gentle motions; nodding or bobbing.","zh":"（方言，主要见于英式/苏格兰用法）上下轻轻地动；点头或摆动（如头、花朵、物体）"},"examples":[{"en":"The old man walked along, his head dodding with each step.","zh":"老人走着走着，头随着每一步轻轻地点动。"},{"en":"The flowers were dodding in the wind.","zh":"花在风里轻轻摇摆。"}]},{"partOfSpeech":"v.","definition":{"en":"The -ing form of the dialect verb “dod”: to nod or bob up and down.","zh":"方言动词 dod 的 -ing 形式：点头；上下摆动、轻轻晃动"},"examples":[{"en":"He sat there, dodding his head as if he might fall asleep.","zh":"他坐在那儿，头一点一点的，好像快要睡着了。"},{"en":"A lantern was dodding on its hook as the cart rolled over stones.","zh":"马车在石子路上颠簸，灯笼挂在钩子上晃来晃去。"}]}],"synonyms":["nodding","bobbing","bouncing lightly","dipping"],"phonetic":"/ˈdɑdɪŋ/","extraExplanation":["“dodding”在现代英语里比较少见，多出现在英格兰北部/苏格兰等地区的方言或文学描写中，意思接近“bobbing / nodding（轻轻上下晃动）”。","学习时容易和更常见的“doddering（步履蹒跚、老态龙钟的）”混淆：两者拼写和声音相近，但“doddering”强调走路不稳或衰老，“dodding”更像“点头/摆动”。"]}
{"word":"doddle","summary":{"en":"“Doddle” usually means something very easy (BrE: “a doddle”), and it can also mean to stroll or move slowly.","zh":"“doddle”通常指“非常简单的事”（英式用法：a doddle），也可作动词表示“慢悠悠地走/闲逛”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a task or thing that is very easy to do","zh":"非常容易做的事；轻而易举的任务"},"examples":[{"en":"The test was a doddle—I finished in ten minutes.","zh":"考试太简单了——我十分钟就做完了。"},{"en":"Once you learn the pattern, the rest is a doddle.","zh":"一旦你学会这个规律，剩下的就轻松搞定。"}]},{"partOfSpeech":"vi.","definition":{"en":"to move slowly and without hurry; to stroll","zh":"慢悠悠地走；闲逛"},"examples":[{"en":"We doddled along the beach after dinner.","zh":"晚饭后我们在海滩上慢慢散步。"},{"en":"Stop doddling and come inside—it's getting cold.","zh":"别磨磨蹭蹭的，进来吧——天要冷了。"}]}],"synonyms":["a piece of cake","easy","simple","walk slowly","stroll","amble"],"phonetic":"/ˈdɑdəl/","extraExplanation":["“a doddle”更常见于英式英语（BrE），表示“很简单、轻松”。美式英语里更常用“a piece of cake”。","动词“doddle”表示“慢吞吞地走/闲逛”也偏英式；口语里有时带一点“别拖拉”的语气（如 Stop doddling）。"]}
{"word":"Dodds","summary":{"en":"Dodds is most commonly a surname (family name).","zh":"Dodds 最常见的用法是英文姓氏（家族姓）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), used to refer to a person or family with that last name.","zh":"（姓氏）Dodds，用作人的英文姓或家族姓。"},"examples":[{"en":"Ms. Dodds will lead the meeting today.","zh":"Dodds 女士今天将主持会议。"},{"en":"The Dodds family moved to Chicago last year.","zh":"Dodds 家去年搬到了芝加哥。"}]}],"synonyms":["Dodd","Dodson"],"phonetic":"/dɑdz/","extraExplanation":["“Dodds”通常是英语国家中的姓氏，常见于英国（尤其苏格兰、英格兰北部）以及北美。它有时被认为与较早的姓名/昵称“Dodd”有关，属于从个人名字发展成姓氏的类型。","在正式写作中，作为姓氏一般首字母大写：Dodds。复数或“某某一家”也常写作 the Dodds family；表示“Dodds家的（某物）”可写作 Dodds’s 或 Dodds’（不同风格指南略有差异）。"]}
{"word":"Doddsville","summary":{"en":"Doddsville is a U.S. place name, referring to a small community (such as one in Mississippi).","zh":"Doddsville 是美国的一个地名，常指一个小型社区（如密西西比州的 Doddsville）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a place name (proper noun), used for one of several small communities in the United States (for example, in Mississippi).","zh":"（专有名词）地名；在美国用于指称若干个名为 Doddsville 的小社区（例如密西西比州）。"},"examples":[{"en":"I grew up near Doddsville, Mississippi.","zh":"我在密西西比州的 Doddsville 附近长大。"},{"en":"Doddsville isn’t a big city—it’s a small community.","zh":"Doddsville 不是大城市，而是一个小社区。"}]}],"phonetic":"/ˈdɑdzvɪl/","extraExplanation":["“Doddsville”里常见的后缀 -ville 来自法语，意思是“城镇/聚居地”，在美国地名中很常见（如 Clarksville）。整体通常表示“Dodd 家族（或名为 Dodd 的人）建立/相关的城镇”。","由于美国可能有不止一个地方叫 Doddsville，写作或查地图时最好加上州名（例如 Doddsville, MS）以避免混淆。"]}
{"word":"doddy","summary":{"en":"“Doddy” is a rare dialect word meaning “hornless/stumpy,” especially of cattle, and can also be a playful nonstandard spelling of “daddy.”","zh":"“Doddy” 是较少见的方言词，常指（牛等）无角/矮短；也可能是把 “daddy（爸爸）” 写得更口语可爱的非标准拼写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(dialect, chiefly Northern England/Scotland) short, stumpy, or without horns (said of animals, especially cattle).","zh":"（方言，主要用于英格兰北部/苏格兰）矮短的、秃的；（尤指牛等）无角的。"},"examples":[{"en":"A doddy calf may have no horns at all.","zh":"一头 doddy 小牛可能完全没有角。"},{"en":"In some dialects, “doddy” can describe a stumpy little animal.","zh":"在一些方言里，doddy 可以用来形容矮墩墩的小动物。"}]},{"partOfSpeech":"n.","definition":{"en":"(dialect) a hornless cow or calf.","zh":"（方言）无角的母牛或小牛。"},"examples":[{"en":"The farmer kept a few doddies in the field.","zh":"农夫在田里养了几头无角牛。"}]},{"partOfSpeech":"n.","definition":{"en":"(informal, nonstandard spelling) sometimes used as a playful/baby-talk spelling of “daddy.”","zh":"（非标准拼写）有时被当作 “daddy（爸爸）” 的逗趣/儿语式写法。"},"examples":[{"en":"The child called his father “doddy” when he was little.","zh":"孩子小时候会叫他爸爸 “doddy”。"}]}],"synonyms":["hornless","polled","stumpy","daddy (playful spelling)"],"phonetic":"/ˈdɑdi/","extraExplanation":["“doddy”不是现代标准英语里的常用词；你更常见到的是“daddy”。如果你是在聊天、歌词或方言故事里看到“doddy”，它可能是（1）北英格兰/苏格兰方言里“无角的（牛）/无角牛”，也可能是（2）把“daddy”写得更可爱、更口语的变体。","发音上它通常和“daddy”非常接近，所以在口语里不容易区分，主要靠语境判断。"]}
{"word":"doddypoll","summary":{"en":"Doddypoll is an old-fashioned insult meaning a foolish or stupid person.","zh":"doddypoll 是古旧的骂人词，意思是“傻瓜、笨人”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a foolish or stupid person; a simpleton (old-fashioned).","zh":"傻瓜；笨人；头脑简单的人（古旧用法）。"},"examples":[{"en":"Don’t be a doddypoll—read the instructions first.","zh":"别当傻瓜——先把说明读一遍。"},{"en":"In old writing, a character might be mocked as a doddypoll for making obvious mistakes.","zh":"在较早的作品里，人物犯了明显错误时，可能会被嘲笑为“笨蛋”。"}]}],"synonyms":["fool","idiot","simpleton","dummy"],"phonetic":"/ˈdɑːdiˌpɑːl/","extraExplanation":["更常见的拼写是 doddipoll / dodepoll（你的 doddypoll 属于变体或误拼），在现代英语中非常少见，带有强烈的“古旧、戏谑/辱骂”色彩。","词源上通常被解释为与“笨（dolt-like）”之类的含义相关，poll 在古英语里可指“头、脑袋”（也见于 poll tax、pollute 无关）。因此可理解为“笨脑袋”。","写作时更自然的现代替代词有: idiot, fool, dummy, simpleton（语气从强到弱不等，需注意礼貌场合避免使用）。"]}
{"word":"Dode","summary":{"en":"“Dode” is an archaic form meaning “died.” In modern English, use “died.”","zh":"“dode”是古语，意思相当于“died（死了/去世了）”。现代英语通常用“died”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(Archaic) past tense of “die”; means “died.”","zh":"（古语）“die”的过去式；意思是“死了/去世了”。"},"examples":[{"en":"He dode in battle, and his name was remembered for years.","zh":"他战死沙场，他的名字多年被人记得。"},{"en":"Many dode of the plague in that town.","zh":"那座城里有许多人死于瘟疫。"}]}],"synonyms":["died","perished","passed away"],"phonetic":"/doʊd/","extraExplanation":["“dode”主要出现在中古英语/早期英语文本或仿古、诗歌风格中；现代英语一般不用它，而用“died”。如果你是在现代文章里看到“dode”，也可能是拼写错误（常见误写为“dodo”或“died”），需要结合上下文判断。"]}
{"word":"dode","summary":{"en":"“dode-” is a word part meaning “twelve,” seen in terms like dodecagon and dodecahedron.","zh":"“dode-”是表示“十二”的构词成分，常见于 dodecagon、dodecahedron 等词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a word part (combining form) meaning “twelve,” used in some scientific and math terms","zh":"词根/构词成分，表示“十二”，常用于数学与科学术语中"},"examples":[{"en":"A dodecagon is a shape with twelve sides.","zh":"dodecagon（十二边形）是一种有十二条边的图形。"},{"en":"A dodecahedron has twelve flat faces.","zh":"dodecahedron（十二面体）有十二个平面。"},{"en":"In chemistry, “dodecyl” refers to a group with twelve carbon atoms.","zh":"在化学中，dodecyl（十二烷基）指含有十二个碳原子的基团。"}]}],"synonyms":["duodec-"],"phonetic":"/doʊd/","extraExplanation":["“dode-”来自希腊语 dōdeka（十二）。英语里更常见的完整形式是 dodeca-（如 dodecahedron、dodecagon）。单独写成“dode”比较少见，多数情况下是非正式缩写或拼写不完整。","如果你是想查某个具体单词（例如 dodeca-、dodge、dodo），可以告诉我上下文句子，我可以帮你确认正确拼写与意思。"]}
{"word":"dodeca","summary":{"en":"Dodeca- is a prefix/combining form meaning “twelve,” used mainly in technical words (especially geometry).","zh":"dodeca- 是表示“十二”的前缀/构词成分，主要用于技术词汇（尤其是几何学）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a word part (prefix/combining form) meaning “twelve,” used in scientific and geometric terms","zh":"表示“十二”的词根/构词成分，常用于科学与几何等术语中"},"examples":[{"en":"A dodecagon is a shape with twelve sides.","zh":"dodecagon（十二边形）是一种有十二条边的图形。"},{"en":"A dodecahedron has twelve faces.","zh":"dodecahedron（十二面体）有十二个面。"},{"en":"In chemistry, you may see dodeca- in names related to groups of twelve.","zh":"在化学中，你可能会在与“十二个一组”相关的名称里看到 dodeca-。"}]}],"synonyms":["twelve-","duodeca-"],"phonetic":"/ˌdoʊˈdɛkə/","extraExplanation":["dodeca- 来自希腊语 dōdeka，意思是“十二”。它多见于较正式、学术或技术词汇中（尤其是几何学与命名法）。","相关常见词：dodecagon（十二边形）、dodecahedron（十二面体）。也可能见到近义构词 duodeca-（同样表示“十二”，多用于较传统/拉丁化的科学命名）。"]}
{"word":"dodecade","summary":{"en":"Dodecade means a set of twelve things (and, rarely, a period of twelve years).","zh":"dodecade 指“十二个一组”（较常见），也可罕见地指“十二年”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group or set of twelve things; a “dozen.” (A less common, more formal word.)","zh":"十二个一组；一打。（较少见、较正式的用法）"},"examples":[{"en":"The museum displayed a dodecade of ancient coins, each from a different city.","zh":"博物馆展出了一组十二枚古币，每枚来自不同的城市。"},{"en":"She bought a dodecade of roses for the ceremony.","zh":"她为仪式买了一打玫瑰。"}]},{"partOfSpeech":"n.","definition":{"en":"(rare) a period of twelve years; a span of twelve years.","zh":"（罕见）十二年；为期十二年的一段时间。"},"examples":[{"en":"Over the past dodecade, the town has changed rapidly.","zh":"在过去的十二年里，这座小镇变化很快。"}]}],"synonyms":["dozen","set of twelve","collection of twelve"],"phonetic":"/ˈdoʊdəkeɪd/","extraExplanation":["“dodecade / dodecad”来自希腊语词根：dōdeka-（十二）。在现代英语中更常用的是“dozen（十二个）”。当你想让表达更书面或更“古典”时，才可能会遇到“dodecade”。"]}
{"word":"dodecadrachm","summary":{"en":"A dodecadrachm is an ancient Greek silver coin worth twelve drachmas.","zh":"dodecadrachm 指古希腊面值为十二德拉克马的大型银币。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large ancient Greek silver coin worth twelve drachmas.","zh":"一种古希腊的大型银币，面值相当于十二德拉克马（drachmas）。"},"examples":[{"en":"The museum displayed a dodecadrachm from Hellenistic Egypt.","zh":"博物馆展出了一枚来自希腊化时期埃及的十二德拉克马银币。"},{"en":"Collectors value the dodecadrachm for its weight and detailed design.","zh":"收藏家看重十二德拉克马银币的重量和精细的纹饰。"}]}],"synonyms":["ancient Greek coin","silver coin"],"phonetic":"/ˌdoʊdɪˈkædrəm/","extraExplanation":["该词由 dodeca-（十二）+ drachm（德拉克马，古希腊货币单位）构成，常见于钱币学（numismatics）与古代史语境。","不同城邦与不同时期的“德拉克马”重量标准会有差异，因此 dodecadrachm 的实际重量可能因发行地与年代而不同。"]}
{"word":"dodecafid","summary":{"en":"“Dodecafid” is not a standard English word; it likely refers to a “dodeca-” (twelve-) word such as “dodecahedron” or “dodecaphonic.”","zh":"“dodecafid”不是标准英语单词；它很可能是与“dodeca-（十二）”相关词（如“dodecahedron”或“dodecaphonic”）的误拼。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word in common dictionaries. It is likely a misspelling or a rare/technical term. People often intend a word related to “dodeca-” (meaning “twelve”), such as “dodecahedron” (a 12-faced solid) or “dodecaphonic” (12-tone music).","zh":"这不是常见词典里的标准英语单词，可能是拼写错误或极少见的专业用语。很多人想写的是与“dodeca-（十二）”相关的词，比如“dodecahedron（十二面体）”或“dodecaphonic（十二音体系的）”。"},"examples":[{"en":"I couldn’t find “dodecafid” in a dictionary—did you mean “dodecahedron”?","zh":"我在词典里找不到“dodecafid”——你是不是想写“dodecahedron（十二面体）”？"},{"en":"If you meant music theory, you might be looking for “dodecaphonic.”","zh":"如果你指的是乐理，你可能想找的是“dodecaphonic（十二音体系的）”。"}]}],"phonetic":"/ˌdoʊdɛkəˈfɪd/","extraExplanation":["“dodeca-”来自希腊语，表示“十二”。常见相关词：\n- dodecahedron：几何中的“十二面体”（最常见）\n- dodecagon：十二边形\n- dodecaphonic / twelve-tone：十二音（勋伯格等作曲家相关）\n如果你告诉我它出现的句子/领域（数学、化学、音乐等），我可以更准确判断你想查的词。"]}
{"word":"dodecagon","summary":{"en":"A dodecagon is a 12-sided polygon.","zh":"dodecagon 指“十二边形”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a polygon (flat shape) with twelve sides and twelve angles","zh":"十二边形；有十二条边和十二个角的多边形"},"examples":[{"en":"A regular dodecagon has 12 equal sides and 12 equal angles.","zh":"正十二边形有12条相等的边和12个相等的角。"},{"en":"The designer used a dodecagon shape for the fountain’s base.","zh":"设计师把喷泉的底座做成十二边形。"}]}],"synonyms":["twelve-sided polygon","12-gon"],"phonetic":"/ˈdoʊdɛkəˌɡɑn/","extraExplanation":["词源：来自希腊语 dōdeka（十二）+ gōnia（角）。所以字面意思是“十二个角的图形”。","补充理解：regular dodecagon 指“正十二边形”（边和角都相等）；与之相对的 irregular dodecagon 是“不规则十二边形”。","在数学/几何里常见：dodecagon 属于 polygon（多边形）的一种；可以类比 pentagon（五边形）、hexagon（六边形）、octagon（八边形）。"]}
{"word":"dodecagonal","summary":{"en":"Dodecagonal means “having 12 sides/angles,” like a dodecagon.","zh":"dodecagonal 指“十二边/十二角的”，即“十二边形的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having twelve sides or angles; relating to a twelve‑sided shape (a dodecagon).","zh":"十二边形的；有十二条边或十二个角的；与十二边形有关的。"},"examples":[{"en":"The plaza is dodecagonal, with twelve equal sides.","zh":"这个广场是十二边形的，有十二条相等的边。"},{"en":"We used a dodecagonal frame to support the sculpture.","zh":"我们用一个十二边形框架来支撑这座雕塑。"}]}],"synonyms":["twelve-sided","twelve-angled"],"phonetic":"/ˌdoʊdɪˈkæɡənəl/","extraExplanation":["词源小提示：dodeca- 表示“十二”（源自希腊语），-gonal 与“角/边”有关（如 pentagonal 五边形的、hexagonal 六边形的）。所以 dodecagonal 直观上就是“十二边/十二角的”。","在日常生活中更常见的对应名词是 dodecagon（十二边形）。在建筑、设计、几何题中更容易遇到 dodecagonal。"]}
{"word":"dodecaheddra","summary":{"en":"“Dodecahedra” is the plural of “dodecahedron,” a solid with 12 faces (often pentagons in the regular form).","zh":"“dodecahedra”是“dodecahedron（十二面体）”的复数，指有12个面的立体（正十二面体的面通常是五边形）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Likely misspelling) The plural of “dodecahedron”: a 3D shape with 12 flat faces.","zh":"（可能拼写有误）“dodecahedron（十二面体）”的复数：一种有12个平面的三维立体。"},"examples":[{"en":"The dice in the set include cubes and dodecahedra.","zh":"这套骰子里既有立方体，也有十二面体。"},{"en":"In geometry class, we learned that regular dodecahedra have 12 pentagon faces.","zh":"在几何课上，我们学到正十二面体有12个五边形面。"}]}],"synonyms":["dodecahedron (singular)","12-faced solid","Platonic solid (regular dodecahedron)"],"phonetic":"/ˌdoʊdɪkəˈhiːdrən/","extraExplanation":["你写的 **dodecaheddra** 更常见的正确拼写是 **dodecahedra**（复数）；单数是 **dodecahedron**。","词源来自希腊语：**dodeca-** 表示“十二”，**-hedron** 表示“面/底面”。","正十二面体是“柏拉图立体”之一（五种规则凸多面体之一），在数学与科普文本中很常见。"]}
{"word":"dodecahedra","summary":{"en":"Dodecahedra are 12-faced 3D solids (plural of dodecahedron).","zh":"Dodecahedra 指十二面体（dodecahedron 的复数），是一种有12个面的三维立体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of “dodecahedron”: a 3D solid with 12 flat faces, usually 12 pentagons (common in geometry and 3D modeling).","zh":"“dodecahedron”的复数：一种有12个平面的三维立体，通常由12个五边形面组成（常见于几何与3D建模）。"},"examples":[{"en":"In geometry class, we learned that dodecahedra have 12 faces.","zh":"在几何课上，我们学到十二面体（dodecahedra）有12个面。"},{"en":"Some tabletop dice are shaped like dodecahedra.","zh":"有些桌游骰子是十二面体形状的。"}]}],"synonyms":["dodecahedrons","12-faced polyhedra"],"phonetic":"/ˌdoʊ.dəˈkiː.drə/","extraExplanation":["“dodeca-”来自希腊语，表示“十二”；“-hedron”表示“面”。所以 dodecahedron 字面意思就是“十二个面”的立体。","日常生活里最常见的例子是12面骰子（D12），常用于桌面角色扮演游戏等。"]}
{"word":"dodecahedral","summary":{"en":"“Dodecahedral” describes something shaped like a 12-faced solid (a dodecahedron).","zh":"“dodecahedral”指“十二面体的”，形状像有十二个面的立体（十二面体）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having twelve flat faces; shaped like a dodecahedron (a 12-faced 3D solid).","zh":"十二面体的；有十二个平面的；呈十二面体形状的。"},"examples":[{"en":"The sculpture has a dodecahedral shape, with twelve identical faces.","zh":"这座雕塑呈十二面体形状，有十二个相同的面。"},{"en":"Scientists sometimes model molecules using dodecahedral structures.","zh":"科学家有时会用十二面体结构来建模分子。"}]}],"synonyms":["twelve-faced","dodecahedron-shaped","polyhedral (broader)"],"phonetic":"/ˌdoʊˌdɛkəˈhiːdrəl/","extraExplanation":["“dodeca-”来自希腊语，意思是“十二”；“-hedral”与“面（face）”有关，所以 dodecahedral 字面意思就是“有十二个面的”。","常见相关词：dodecahedron（十二面体，名词）；dodecahedral symmetry（十二面体对称性，常用于数学、物理、化学与建筑/设计语境）。","在文学或艺术写作中，这个词通常用来营造“几何感、理性、冷静、精密”的氛围，但在日常口语里很少使用。"]}
{"word":"dodecahedric","summary":{"en":"An adjective meaning “dodecahedron-shaped” or “having twelve faces.”","zh":"形容词：表示“十二面体的/有十二个面的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a dodecahedron; having the shape or structure of a solid with 12 flat faces (often pentagons).","zh":"与十二面体有关的；呈十二个平面面的立体形状（常见为正五边形面）的。"},"examples":[{"en":"In geometry class, we built a dodecahedric model out of paper.","zh":"在几何课上，我们用纸做了一个十二面体形状的模型。"},{"en":"The game uses a dodecahedric die with twelve numbered faces.","zh":"这个游戏使用一种十二面体骰子，上面有十二个编号的面。"}]}],"synonyms":["dodecahedral","twelve-faced"],"phonetic":"ˌdoʊdɪkəˈhiːdrɪk","extraExplanation":["词源上可拆为希腊语：dodeka-（十二）+ hedra（面/座）。在英语里更常见的形容词是 dodecahedral；dodecahedric 也能用，但较偏学术或技术语境（几何、晶体学、建模等）。"]}
{"word":"dodecahedron","summary":{"en":"A dodecahedron is a 3D shape with 12 faces, most often the regular one with 12 pentagons.","zh":"dodecahedron 指有12个面的三维立体，最常见的是由12个五边形组成的正十二面体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A three-dimensional solid with 12 flat faces; in geometry, it most commonly refers to a regular dodecahedron, which has 12 identical pentagonal faces.","zh":"一种有12个平面的三维立体；在几何学中通常指“正十二面体”，其12个面都是相同的五边形。"},"examples":[{"en":"In geometry class, we built a paper dodecahedron with twelve pentagonal faces.","zh":"在几何课上，我们做了一个有十二个五边形面的纸质十二面体。"},{"en":"A regular dodecahedron is one of the five Platonic solids.","zh":"正十二面体是五种柏拉图立体之一。"}]}],"synonyms":["twelve-faced polyhedron","regular dodecahedron"],"phonetic":"/ˌdoʊdɪˈkæhiːdrən/","extraExplanation":["词源来自希腊语：dōdeka（十二）+ hedra（座、面），字面意思是“十二个面”。","在古希腊哲学中（如柏拉图传统），十二面体常被赋予象征意义，有时被用来代表“宇宙/天界”的整体结构；现代数学与科学中则主要作为几何对象来研究与应用。"]}
{"word":"dodecahedron-shaped","summary":{"en":"Dodecahedron-shaped describes something shaped like a 12-faced geometric solid (often with pentagon faces).","zh":"dodecahedron-shaped 用来形容“像十二面体一样”的形状（常见为五边形面组成）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having the shape of a dodecahedron (a solid with 12 flat faces, usually pentagons).","zh":"呈十二面体形状的（十二个平面面组成的立体，通常每个面是五边形）。"},"examples":[{"en":"The museum displayed a dodecahedron-shaped lamp made from brass.","zh":"博物馆展出了一盏黄铜制作的十二面体形灯。"},{"en":"Some dice used in role-playing games are dodecahedron-shaped.","zh":"角色扮演游戏里有些骰子是十二面体形的。"}]}],"synonyms":["dodecahedral","12-sided (informal)","twelve-faced (formal)"],"phonetic":"ˌdoʊdɪˈkæhiːdrən ʃeɪpt","extraExplanation":["“dodecahedron”源自希腊语：dōdeka（十二）+ hedra（面/座）。在几何里，最常见的是“正十二面体”（regular dodecahedron），它属于柏拉图立体之一，每个面是相同的正五边形。","写作上也常见类似结构：cube-shaped（立方体形的）、sphere-shaped（球形的）、pyramid-shaped（金字塔形的）。"]}
{"word":"dodecahedrons","summary":{"en":"Dodecahedrons are 3D shapes with 12 faces.","zh":"dodecahedrons 指“十二面体”，一种有12个面的立体形状。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a three-dimensional solid with 12 flat faces (usually 12 pentagons in the regular form)","zh":"十二面体；一种有12个平面的立体（规则十二面体通常由12个五边形面组成）"},"examples":[{"en":"In geometry class, we built paper dodecahedrons to study faces, edges, and vertices.","zh":"在几何课上，我们做了纸质十二面体来学习面、棱和顶点。"},{"en":"Some tabletop dice are dodecahedrons with numbers 1–12.","zh":"有些桌游骰子是十二面体，上面标着1到12。"}]}],"synonyms":["dodecahedra","12-sided solid","regular dodecahedron"],"phonetic":"/ˌdoʊdɪˈkæhiːdrən/","extraExplanation":["“dodecahedron”来自希腊语：dōdeka（十二）+ hedra（座/面），字面意思就是“有十二个面”。","在数学里最常见的是“规则十二面体”（12个全等正五边形面），它是五种“柏拉图立体”之一，常出现在几何、模型制作、建筑与游戏骰子（d12）中。","复数通常写作 dodecahedrons；在较学术或更传统的写法中也会见到 dodecahedra。"]}
{"word":"dodecahydrate","summary":{"en":"A dodecahydrate is a hydrate containing 12 water molecules per formula unit (·12H2O).","zh":"dodecahydrate 指每个化学式单位含12个结晶水分子（·12H2O）的水合物。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound that contains twelve molecules of water of crystallization for each formula unit (written as ·12H2O)","zh":"（化学）十二水合物：每个化学式单位含有12个结晶水分子（常写作·12H2O）"},"examples":[{"en":"Washing soda is sodium carbonate dodecahydrate (Na2CO3·12H2O).","zh":"洗涤碱是碳酸钠十二水合物（Na2CO3·12H2O）。"},{"en":"When heated, a dodecahydrate may lose water and change its mass.","zh":"加热时，十二水合物可能失去结晶水，从而改变质量。"}]}],"synonyms":["hydrate (specific type: 12-hydrate)","12-hydrate"],"phonetic":"/ˌdoʊdɛkəˈhaɪdreɪt/","extraExplanation":["“hydrate（水合物）”指晶体里固定比例的“结晶水”；前缀“dodeca-”来自希腊语，表示“十二”。所以 dodecahydrate 直译就是“带12个结晶水的水合物”。","在实验或工业中，是否带结晶水会影响称量（摩尔质量）、溶解度与储存稳定性；写配方或计算时要注意是否是无水物（anhydrous）还是某种水合物。"]}
{"word":"dodecahydrated","summary":{"en":"Dodecahydrated means a substance contains 12 water molecules (as crystal water) per formula unit.","zh":"dodecahydrated 指某物质每个化学式单位含有12个结晶水分子（十二水合状态）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Containing twelve molecules of water of crystallization in each formula unit; also written as “dodecahydrate” (the compound) or “dodecahydrated” (describing it).","zh":"（化学）每个化学式单位含有12个结晶水分子的；也常写作“dodecahydrate（十二水合物，指物质）”，而“dodecahydrated”多用来形容“处于十二水合状态”。"},"examples":[{"en":"Copper(II) sulfate can exist in different hydrated forms; a dodecahydrated salt would contain 12 water molecules per formula unit.","zh":"硫酸铜可以有不同的水合形式；若为十二水合（dodecahydrated）的盐，每个化学式单位会含有12个水分子。"},{"en":"The lab report noted that the sample became less dodecahydrated after heating, suggesting it lost water of crystallization.","zh":"实验报告指出样品加热后不再那么“十二水合”，说明它失去了结晶水。"}]}],"synonyms":["dodecahydrate (related form)","12-hydrated (less common)"],"phonetic":"/ˌdoʊˌdɛkəˈhaɪdreɪtɪd/","extraExplanation":["“dodeca-”来自希腊语，表示“十二”。“hydrate / hydrated”与水合有关，常用于描述晶体里固定比例的结晶水（water of crystallization）。","在化学命名中，常见的名词形式是“dodecahydrate（十二水合物）”，而“dodecahydrated”更像形容词，用来修饰“salt / compound / crystal（盐/化合物/晶体）”。例如：a dodecahydrated crystal（十二水合晶体）。"]}
{"word":"dodecamerous","summary":{"en":"Dodecamerous means having parts arranged in twelves, especially in flowers.","zh":"dodecamerous 指结构（尤指花部）以12个为一组（或12的倍数）排列。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany/Zoology) Having flower parts or other structures arranged in groups of twelve (12), or in multiples of twelve.","zh":"（植物学/动物学）十二基数的；花部或其他结构以12个为一组（或12的倍数）排列的。"},"examples":[{"en":"A dodecamerous flower has twelve petals, twelve stamens, or other parts in sets of twelve.","zh":"dodecamerous 的花通常有12片花瓣、12枚雄蕊，或其他花器官以12为一组。"},{"en":"The species is described as dodecamerous in the floral diagram.","zh":"在花图式（floral diagram）中，这个物种被描述为 dodecamerous（十二基数）。"}]}],"synonyms":["twelve-parted","12-merous"],"phonetic":"/ˌdoʊdɪˈkæmərəs/","extraExplanation":["词源：dodeca- 表示“十二”（来自希腊语 dōdeka），-merous 表示“……部分的/……基数的”（与“部分/段”有关）。合起来就是“十二部分的”。","这是一个偏学术/专业的形态学术语，常见于植物分类学、花部结构描述中；日常英语里很少用。","相关术语：trimerous（三基数）、tetramerous（四基数）、pentamerous（五基数）。这些词都用来描述花瓣、萼片、雄蕊等器官的“基数/数目模式”。"]}
{"word":"dodecanal","summary":{"en":"Dodecanal is a 12‑carbon aldehyde used mainly in fragrances and flavorings.","zh":"Dodecanal（十二醛）是一种含12个碳的醛类化合物，主要用于香精和食品香料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound (an aldehyde) with 12 carbon atoms, used especially in fragrances and flavorings; also called lauraldehyde or 1-dodecanal.","zh":"一种含12个碳原子的醛类化合物，常用于香精与食品香料中；也称为“月桂醛”或“1-十二醛”。"},"examples":[{"en":"Dodecanal is often added to perfumes to create a fresh, citrus-like note.","zh":"十二醛常被加入香水中，用来营造清新、带柑橘感的香调。"},{"en":"In the lab, they identified dodecanal as one of the aldehydes in the sample.","zh":"在实验室里，他们鉴定出十二醛是样品中的一种醛类物质。"}]}],"synonyms":["lauraldehyde","1-dodecanal","dodecyl aldehyde"],"phonetic":"/doʊˈdɛkəˌnæl/","extraExplanation":["“dodec-”来自希腊语，表示“十二”，对应分子中有12个碳原子；“-anal”是有机化学命名中表示“醛（aldehyde）”的一种词尾。","在香精行业中，十二醛常用于提供“清新、皂感、柑橘样”的前调效果；不同配方与浓度会让气味表现差异很大。"]}
{"word":"dodecane","summary":{"en":"Dodecane is a 12-carbon alkane (C12H26), a colorless liquid used in petroleum-related applications and as a lab solvent/reference material.","zh":"dodecane 指十二烷（C12H26），一种12个碳的烷烃，无色液体，常用于石油相关应用以及实验室溶剂/参考物质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a colorless liquid hydrocarbon (C12H26), part of the alkane family, found in petroleum and used as a solvent and in laboratory testing","zh":"十二烷（C12H26），一种无色液态烃，属于烷烃类，存在于石油中，常用作溶剂及实验室测试用标准物质"},"examples":[{"en":"Dodecane is often used as a reference fuel in combustion experiments.","zh":"十二烷常被用作燃烧实验中的参考燃料。"},{"en":"The chemist dissolved the sample in dodecane to run the test.","zh":"化学家把样品溶解在十二烷中进行测试。"}]}],"synonyms":["n-dodecane","alkane"],"phonetic":"/ˈdoʊdɪˌkeɪn/","extraExplanation":["“dodec-”来自希腊语，表示“十二”；“-ane”是烷烃命名后缀，表示只含单键的饱和烃。","在化学中，十二烷常作为“非极性溶剂”的代表之一；在材料、燃烧、以及萃取等实验中会见到。"]}
{"word":"dodecanedioic","summary":{"en":"A chemistry adjective describing a 12‑carbon, two‑carboxyl (dioic) structure, most often in “dodecanedioic acid.”","zh":"化学形容词，指“12个碳+两个羧基（二元酸）”的结构，最常见于“dodecanedioic acid（十二烷二酸）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a molecule (especially an acid) that has a 12‑carbon chain with two carboxyl (–COOH) groups; typically used in the term “dodecanedioic acid.”","zh":"（尤用于“dodecanedioic acid”一词中）指具有12个碳的碳链并带有两个羧基（–COOH）的分子/酸。"},"examples":[{"en":"Dodecanedioic acid is used to make certain polymers and coatings.","zh":"十二烷二酸可用于制造某些聚合物和涂层。"},{"en":"The report lists dodecanedioic compounds as intermediates in nylon production.","zh":"报告把十二烷二酸类化合物列为尼龙生产中的中间体。"}]}],"synonyms":["dodecanedioic acid (related term)","DDDA (abbr., in chemistry)"],"phonetic":"/ˌdoʊdəˌkænˌdiˈoʊɪk/","extraExplanation":["这个词在日常英语中很少单独出现，最常见搭配是“dodecanedioic acid（十二烷二酸）”。","词素提示：dodeca- 表示“十二”，-di- 表示“两个”，-oic 常见于羧酸命名中（如 benzoic acid 苯甲酸）。"]}
{"word":"Dodecanese","summary":{"en":"The Dodecanese is a group of Greek islands in the southeastern Aegean Sea.","zh":"多德卡尼斯群岛是位于爱琴海东南部的一组希腊岛屿。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a group of Greek islands in the southeastern Aegean Sea, near the coast of Turkey","zh":"（希腊）多德卡尼斯群岛：位于爱琴海东南部、靠近土耳其海岸的一组希腊岛屿"},"examples":[{"en":"Rhodes is the largest island in the Dodecanese.","zh":"罗德岛是多德卡尼斯群岛中最大的岛屿。"},{"en":"We took a ferry between several Dodecanese islands.","zh":"我们乘渡轮在几座多德卡尼斯群岛的岛屿之间往返。"}]}],"synonyms":["the Dodecanese Islands"],"phonetic":"/ˌdoʊdə.kəˈniːz/","extraExplanation":["“Dodecanese”源自希腊语，字面意思是“十二个岛”（dodeca- = 十二，-nese/nesos 与“岛”有关）。英语中常指这一地区整体，而不一定严格限定为恰好12座岛。","历史上该地区因地处要冲，长期在不同势力间更迭；现代作为希腊的一部分，旅游、航运与中世纪遗迹（如罗德岛的骑士团建筑）较为知名。"]}
{"word":"Dodecanesian","summary":{"en":"Dodecanesian means “from or related to the Greek Dodecanese islands,” and it can also mean a person from those islands.","zh":"Dodecanesian 指“多德卡尼斯群岛（希腊）相关的”，也可指“多德卡尼斯群岛的人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to the Dodecanese, a group of Greek islands in the southeastern Aegean Sea (near Turkey).","zh":"与多德卡尼斯群岛（希腊东南部爱琴海、靠近土耳其的一组岛屿）有关的；多德卡尼斯群岛的。"},"examples":[{"en":"Rhodes is the largest Dodecanesian island.","zh":"罗德岛是多德卡尼斯群岛中最大的岛屿。"},{"en":"She studies Dodecanesian history and culture.","zh":"她研究多德卡尼斯群岛的历史与文化。"}]},{"partOfSpeech":"n.","definition":{"en":"a person from the Dodecanese islands.","zh":"多德卡尼斯群岛的人；来自多德卡尼斯群岛的居民。"},"examples":[{"en":"Many Dodecanesians moved abroad during the 20th century.","zh":"20世纪有许多多德卡尼斯群岛居民移居海外。"},{"en":"He is a Dodecanesian from Kos.","zh":"他是来自科斯岛的多德卡尼斯群岛人。"}]}],"synonyms":["Dodecanese (attributive)","Greek (broader)"],"phonetic":"/ˌdoʊdəˌkɑːˈniːʒən/","extraExplanation":["“Dodecanese /ˌdoʊdəˈkɑːniːs/”来自希腊语：dōdeka（十二）+ nēsos（岛），字面意思是“十二岛”。不过在现代用法中，“多德卡尼斯群岛”并不只严格指12个岛，而是一个历史与行政上的群岛名称。","形容词更常见的写法是 “Dodecanese” 作定语（如 Dodecanese islands），或 “Dodecanesian” 作形容词/名词。日常英语里也常见 “Dodecanese” 直接当形容词使用（如 Dodecanese cuisine）。"]}
{"word":"dodecanesian","summary":{"en":"Dodecanesian means “of the Dodecanese (Greek islands)” or “a person from the Dodecanese.”","zh":"Dodecanesian 指“多德卡尼斯群岛的”，也可指“多德卡尼斯群岛人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to the Dodecanese, a group of Greek islands in the southeastern Aegean Sea (near the coast of Turkey).","zh":"与“多德卡尼斯群岛”（希腊东南爱琴海、靠近土耳其海岸的一组岛屿）有关的；多德卡尼斯群岛的。"},"examples":[{"en":"Rhodes is a major Dodecanesian island with a long medieval history.","zh":"罗德岛是多德卡尼斯群岛中的主要岛屿之一，拥有悠久的中世纪历史。"},{"en":"We tried Dodecanesian food, including fresh seafood and local cheeses.","zh":"我们尝了多德卡尼斯群岛的食物，包括新鲜海鲜和当地奶酪。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from the Dodecanese islands.","zh":"多德卡尼斯群岛人；来自多德卡尼斯群岛的人。"},"examples":[{"en":"Many Dodecanesians have family connections in both Greece and abroad.","zh":"许多多德卡尼斯群岛人和希腊本土及海外都有亲属联系。"}]}],"synonyms":["Dodecanese (adj./n., common alternative)","Aegean (broader, less specific)"],"phonetic":"/ˌdoʊdɪkəˈniːʒən/","extraExplanation":["“Dodecanesian”来自“Dodecanese（多德卡尼斯群岛）”。词源与希腊语有关：dōdeka（十二）+ nēsos（岛），意思是“十二岛”。历史上该地区因地理位置重要，曾经历奥斯曼、意大利等势力统治，二战后并入希腊。"]}
{"word":"dodecanoic","summary":{"en":"“Dodecanoic” means “having a 12‑carbon chain,” most often referring to dodecanoic acid (lauric acid).","zh":"“dodecanoic”意为“具有12个碳原子的直链结构”，最常用于指十二烷酸（也叫月桂酸）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a chemical compound that has 12 carbon atoms in a straight chain; most commonly used in the term “dodecanoic acid” (also called lauric acid).","zh":"（化学）指含有12个碳原子直链结构的；最常见于短语“dodecanoic acid”（十二烷酸，也叫月桂酸）。"},"examples":[{"en":"Dodecanoic acid is a fatty acid found in coconut oil.","zh":"十二烷酸（dodecanoic acid）是一种存在于椰子油中的脂肪酸。"},{"en":"The lab compared dodecanoic acid with shorter-chain acids to see how melting points change.","zh":"实验室把十二烷酸与更短碳链的酸作比较，以观察熔点如何变化。"}]}],"synonyms":["lauric (in “lauric acid”)","C12 (informal scientific shorthand)"],"phonetic":"/ˌdoʊdɛkəˈnoʊɪk/","extraExplanation":["“dodeca-”来自希腊语，表示“十二”；“-oic”常用于命名羧酸（carboxylic acids）或与其相关的形容词形式。","在日常英语中很少单独说 dodecanoic，通常直接说 dodecanoic acid（十二烷酸/月桂酸）。","月桂酸（lauric acid）常见于肥皂、清洁产品和部分化妆品配方中，因此在成分表或科研文章里更容易遇到这个词。"]}
{"word":"dodecanoyl","summary":{"en":"Dodecanoyl means the C12 fatty-acid acyl group (lauroyl), or describing compounds that contain it.","zh":"dodecanoyl 指 C12 脂肪酸的酰基（=月桂酰基），也可作形容词表示“含该基团的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Chemistry) An acyl group derived from dodecanoic (lauric) acid, with the structure C11H23CO–, used to describe molecules that contain this 12‑carbon fatty-acid chain.","zh":"（化学）十二烷酸（又称月桂酸）衍生的酰基，结构为 C11H23CO–；用于描述含有该 12 碳脂肪酸链的化合物。"},"examples":[{"en":"Dodecanoyl chloride is often used to attach a C12 fatty chain to an alcohol or amine.","zh":"十二烷酰氯常用于把一条 C12 脂肪链连接到醇或胺上。"},{"en":"The peptide was modified with a dodecanoyl group to increase its lipid affinity.","zh":"该肽通过引入十二烷酰基来提高其亲脂性。"}]},{"partOfSpeech":"adj.","definition":{"en":"Describing something that contains or is modified by a dodecanoyl (lauroyl) group.","zh":"（作定语）形容含有或被十二烷酰基（=月桂酰基）修饰的。"},"examples":[{"en":"They tested dodecanoyl derivatives for antibacterial activity.","zh":"他们测试了十二烷酰基衍生物的抗菌活性。"},{"en":"A dodecanoyl side chain can make a compound more hydrophobic.","zh":"十二烷酰侧链会使化合物更疏水。"}]}],"synonyms":["lauroyl","dodecanoyl group"],"phonetic":"/ˌdoʊdɪˈkænɔɪl/","extraExplanation":["“dodecanoyl”常见于有机化学与生物化学命名：它表示“来自十二烷酸的酰基（R–CO–）”，与“dodecanoic acid（十二烷酸/月桂酸）”对应。","同义词“lauroyl（=月桂酰基）”在配方化学、表面活性剂、脂质与药物修饰（提高疏水性/膜亲和性）等语境中更常见。"]}
{"word":"dodecant","summary":{"en":"A rare word meaning a twelfth part; also used in astrology for one of twelve subdivisions within a zodiac sign.","zh":"较少见的词，意为“十二分之一”；在占星中也指星座内部再细分出的十二个分区之一。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"one of twelve equal parts of something; a twelfth part","zh":"十二等分之一；一份（占整体的十二分之一）"},"examples":[{"en":"The circle was divided into twelve dodecants.","zh":"这个圆被分成了十二个等份（每一份称为 dodecant）。"},{"en":"In some old systems, each dodecant represented one-twelfth of the whole.","zh":"在一些古老体系里，dodecant 表示整体的十二分之一。"}]},{"partOfSpeech":"n.","definition":{"en":"in astrology, one of the twelve subdivisions of a zodiac sign (each sign is divided into 12 smaller parts)","zh":"（占星）黄道十二宫中某一宫位的十二分区之一（每一宫再细分为12段）"},"examples":[{"en":"Some astrologers interpret a sign’s dodecants for extra detail in a chart.","zh":"一些占星师会解读某个星座的 dodecants，以获得更细的盘面信息。"},{"en":"A zodiac sign can be broken into twelve dodecants of 2.5 degrees each.","zh":"一个星座（30度）可以再分成十二个 dodecants（每个2.5度）。"}]}],"synonyms":["twelfth","one-twelfth","duodecimal part"],"phonetic":"/doʊˈdɛkənt/","extraExplanation":["这个词比较少见，常见于较旧的数学/占星文本。词根 dodeca- 来自希腊语，表示“十二”；-cant 与“分段/部分”的含义相关，因此整体就是“十二分之一（或十二等分之一段）”。","在占星语境中，dodecant 也常被称为“duodecatemoria（十二分度法）”的分段概念，用来把每个30度的星座再细分，以做更细的象征性解读。"]}
{"word":"dodecapartite","summary":{"en":"“Dodecapartite” describes something arranged or divided into exactly twelve parts.","zh":"dodecapartite 用来形容“恰好由十二部分组成/被分成十二部分”的事物。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"divided into twelve parts; consisting of twelve sections.","zh":"分成十二部分的；由十二个部分/章节组成的。"},"examples":[{"en":"The report is dodecapartite, with one chapter for each month of the year.","zh":"这份报告由十二个部分组成，每个月对应一章。"},{"en":"They designed a dodecapartite schedule to cover all twelve teams evenly.","zh":"他们设计了一份十二分制的赛程安排，以便均匀覆盖全部十二支队伍。"}]}],"synonyms":["twelve-part","divided into twelve parts","consisting of twelve parts"],"phonetic":"/ˌdoʊdɛkəˈpɑrtaɪt/","extraExplanation":["词源：来自希腊语词根 dodeca-（“十二”）+ partite（“分部分的/分开的”）。常见于较正式或学术语境，用来强调“恰好分成十二份”。","近义表达更常用：divided into twelve parts / twelve-part / consisting of twelve parts。"]}
{"word":"dodecapetalous","summary":{"en":"Dodecapetalous means “having twelve petals,” mainly used in botanical descriptions.","zh":"dodecapetalous 指“有十二片花瓣的”，主要用于植物学描写。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having twelve petals (used mainly in botany to describe a flower).","zh":"（主要用于植物学）有十二片花瓣的；十二瓣的。"},"examples":[{"en":"The botanist described the specimen as dodecapetalous, with a neat ring of twelve petals.","zh":"植物学家将该标本描述为 dodecapetalous（十二瓣的），花瓣整齐地围成一圈。"},{"en":"In the field guide, a dodecapetalous flower is listed as a useful identification clue.","zh":"在野外图鉴中，“十二瓣的花”被列为一个有用的辨识线索。"}]}],"synonyms":["twelve-petaled","12-petaled"],"phonetic":"/ˌdoʊˌdɛkəˈpɛtələs/","extraExplanation":["这个词较少见，多出现在学术或科普语境中，尤其是植物形态描述。","词源可拆解为希腊语成分：dodeca-（十二）+ petalous（有花瓣的）。在阅读植物学资料时，常会遇到类似结构的词，如 pentapetalous（五瓣的）、polypetalous（多瓣的）。"]}
{"word":"dodecaphonic","summary":{"en":"Dodecaphonic describes twelve-tone music that uses all 12 chromatic notes in an organized row, avoiding a traditional key.","zh":"dodecaphonic 指“十二音体系的”，用半音阶12个音按音列组织音乐，避免传统调性中心。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a method of composing music using all twelve notes of the chromatic scale in a fixed order (a “tone row”), so no single note feels like the main key.","zh":"（音乐）十二音体系的；指用半音阶的十二个音按固定顺序（“音列/音列主题”）组织音乐，使作品不强调传统调性的中心。"},"examples":[{"en":"The piece uses a dodecaphonic tone row instead of a traditional melody.","zh":"这首作品用十二音音列来组织材料，而不是传统旋律。"},{"en":"Some listeners find dodecaphonic music challenging because it avoids a clear key center.","zh":"有些听众觉得十二音音乐难听懂，因为它刻意避免清晰的调性中心。"}]}],"synonyms":["twelve-tone","serial (in music)","atonal (related)"],"phonetic":"/ˌdoʊˌdɛkəˈfɑnɪk/","extraExplanation":["“dodeca-”来自希腊语，意为“十二”；“-phonic”与“声音/音”有关。dodecaphonic 常用来描述 20 世纪作曲家阿诺德·勋伯格（Arnold Schoenberg）发展并推广的“十二音技法”（twelve-tone technique），也常与 “serial/serialism（序列主义）”一起出现。","学习时可记常搭配：dodecaphonic music（十二音音乐）、dodecaphonic technique（十二音技法）、dodecaphonic row / tone row（十二音音列）。文学或评论中也会用它来暗示“现代主义、抽象、理性结构强、对传统和声的反叛”等气质。"]}
{"word":"dodecaphonically","summary":{"en":"“Dodecaphonically” means “using the twelve-tone method in music composition.”","zh":"“dodecaphonically”指“以十二音作曲法来创作/组织音乐”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a way that uses the twelve-tone (dodecaphonic) method of composition, where all 12 notes of the chromatic scale are treated as equally important, usually organized as a tone row.","zh":"以十二音（十二音体系）作曲法的方式；在这种方法中，半音阶的12个音被视为同等重要，通常通过“音列（tone row）”来组织。"},"examples":[{"en":"The composer wrote the piece dodecaphonically, building every theme from a single tone row.","zh":"作曲家以十二音方式创作这首作品，把所有主题都建立在同一个音列之上。"},{"en":"The melody sounds less “singable” because it is organized dodecaphonically rather than around a key.","zh":"这段旋律听起来不太“好唱”，因为它是以十二音方式组织的，而不是围绕某个调性。"}]}],"synonyms":["twelve-tone","serially","in a twelve-tone manner"],"phonetic":"/ˌdoʊdəˌkæfəˈnɪkli/","extraExplanation":["“Dodecaphonically”来自 Greek 前缀 dodeca-（十二）+ phone（声音）。它常出现在音乐评论、理论写作中，用来说明作品的写作方法，而不是描述“风格好不好听”。","与之相关的核心概念是 tone row（音列/序列）：作曲者先确定12个不同音高的排列，然后通过转位、逆行、倒影等变化来发展音乐。","常被提到的作曲家包括 Arnold Schoenberg、Alban Berg、Anton Webern（第二维也纳学派）。"]}
{"word":"dodecaphonism","summary":{"en":"Dodecaphonism is a musical composing technique that organizes all 12 chromatic notes into a tone row and avoids a traditional key center.","zh":"dodecaphonism 指“十二音体系”，把半音阶十二个音组织成音列进行创作，并避免传统的调性中心。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A method of composing music using all twelve notes of the chromatic scale in a fixed ordered pattern (a “tone row”), so no single note sounds like the main key.","zh":"十二音体系：一种作曲方法，把半音阶的十二个音按固定顺序组成“音列（tone row）”来发展音乐，使音乐不以某个音为中心（不强调传统调性）。"},"examples":[{"en":"We studied dodecaphonism in a unit on twentieth-century classical music.","zh":"我们在二十世纪古典音乐单元里学习了十二音体系。"},{"en":"In dodecaphonism, the composer often transforms the tone row by inversion or retrograde.","zh":"在十二音体系中，作曲家常把音列进行倒影（inversion）或逆行（retrograde）等变化。"}]}],"synonyms":["twelve-tone technique","twelve-tone method","twelve-tone serialism"],"phonetic":"/ˌdoʊdɛkəˈfoʊnɪzəm/","extraExplanation":["“Dodeca-”来自希腊语，意思是“十二”；“-phon-”与“声音/音”有关，所以字面意思是“十二个音的体系”。","十二音体系常与作曲家阿诺德·勋伯格（Arnold Schoenberg）及其学生（如贝尔格 Berg、韦伯恩 Webern）联系在一起，是无调性音乐发展中的重要方法。","学习时可以顺带记几个常见相关词：tone row（音列）、serialism（序列主义，范围更广）、atonal（无调性的）。"]}
{"word":"dodecaphonist","summary":{"en":"A dodecaphonist is a musician or composer who uses twelve-tone composition.","zh":"dodecaphonist 指使用十二音（十二音列）技法进行创作的作曲家或音乐家。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a composer or musician who writes or uses twelve-tone (dodecaphonic) music, where all 12 notes of the chromatic scale are treated with equal importance","zh":"十二音技法作曲家；十二音音乐的创作者/使用者（把半音阶的12个音视为同等重要）"},"examples":[{"en":"Arnold Schoenberg is often called a leading dodecaphonist of the 20th century.","zh":"阿诺德·勋伯格常被称为20世纪重要的十二音作曲家。"},{"en":"Some listeners find dodecaphonist works challenging at first, but they can be rewarding with repeated listening.","zh":"有些听众一开始觉得十二音作曲家的作品难以理解，但反复聆听会很有收获。"}]}],"synonyms":["twelve-tone composer","twelve-tone musician","serialist (broader)"],"phonetic":"/ˌdoʊdəˈkæfənɪst/","extraExplanation":["“Dodecaphonist”来自希腊语词根：dodeca-（十二）+ phon-（声音/音）。它通常和“twelve-tone / dodecaphonic”连用，用来描述一种20世纪兴起的作曲方法：作曲时会先设定一个包含12个不同音高的“音列（tone row）”，再通过倒影、逆行、移调等方式发展音乐。","在音乐史语境里，这个词常与“第二维也纳学派（Second Viennese School）”相关，例如勋伯格（Schoenberg）、贝尔格（Berg）、韦伯恩（Webern）。日常英语中该词比较少见，多出现在音乐理论、乐评或学术写作里。"]}
{"word":"dodecaphony","summary":{"en":"Dodecaphony is a 12-tone method of composing music using all 12 chromatic notes in a set order, avoiding a single key center.","zh":"Dodecaphony（十二音技法）是一种以固定音列使用半音阶12个音、避免调性中心的作曲方法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a system of musical composition using all 12 notes of the chromatic scale in a fixed order (a “tone row”), with no single note treated as the home key","zh":"十二音技法；一种作曲方法：把半音阶的12个音按固定顺序组成“音列”，避免任何一个音成为主音或调性中心"},"examples":[{"en":"Schoenberg developed dodecaphony to move away from traditional major and minor keys.","zh":"勋伯格发展十二音技法，是为了远离传统的大调和小调体系。"},{"en":"The piece uses dodecaphony, so the melody may sound less “singable” than tonal music.","zh":"这首作品使用十二音技法，所以旋律可能听起来不像调性音乐那样“好唱”。"},{"en":"In class, we analyzed a dodecaphony tone row and its inversions.","zh":"课上我们分析了一个十二音音列及其倒影形式。"}]}],"synonyms":["twelve-tone technique","twelve-tone method","serialism (broader)"],"phonetic":"/ˌdoʊˌdɛkəˈfoʊni/","extraExplanation":["“Dodecaphony”来自希腊语：dodeca-（十二）+ -phony（声音）。常与“twelve-tone technique（十二音技法）”互换使用。","它常见于20世纪现代主义音乐，尤其与作曲家 Arnold Schoenberg（阿诺德·勋伯格）以及他的学生 Alban Berg、Anton Webern（第二维也纳乐派）相关。","学习相关概念时常会遇到：tone row（音列）、prime（原形）、inversion（倒影）、retrograde（逆行）、retrograde inversion（逆行倒影）。"]}
{"word":"dodecarch","summary":{"en":"A dodecarch is one of twelve rulers or leaders who govern together.","zh":"dodecarch 指十二位共同执政的统治者/领导者之一。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a ruler or leader who is one of a group of twelve (or who governs with eleven others as part of a “twelve-person rule”).","zh":"十二执政者之一；（与其他十一人共同）组成“十二人统治/执政”体系的统治者或领导者。"},"examples":[{"en":"In the legend, the city was governed by twelve dodecarchs who shared power.","zh":"在传说中，这座城市由十二位十二执政者共同治理、分享权力。"},{"en":"The historian described each dodecarch as having authority over a different district.","zh":"这位历史学家描述说，每位十二执政者都负责管理不同的区域。"}]}],"synonyms":["member of a council of twelve","one of twelve rulers","archon (general: ruler)"],"phonetic":"/ˈdoʊdɪkɑrk/","extraExplanation":["“dodecarch”来源于希腊语词根：dodeca-（十二）+ -arch（统治者/领袖，与 monarch 君主、oligarch 寡头同源）。它在现代英语里非常少见，多出现在历史、神话或仿古写作中，用来表达“十二人共治”或“十二位统治者之一”的概念。","读到以 -arch 结尾的词时，可以联想到“统治/领导”：monarch（君主一人统治）、patriarch（族长/家长式领袖）、oligarch（少数人统治的寡头）。这样能更快抓住词义。"]}
{"word":"dodecarchy","summary":{"en":"Dodecarchy means government by twelve people.","zh":"dodecarchy 指“十二人统治/十二人政体”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a form of government or rule by twelve people (a council of twelve)","zh":"十二人统治；由十二人组成的统治集团（或十二人议会）"},"examples":[{"en":"After the revolution, the city was briefly governed by a dodecarchy of twelve elders.","zh":"革命之后，这座城市曾短暂由十二位长者组成的十二人统治集团治理。"},{"en":"The novel imagines a dodecarchy that makes all major decisions by vote.","zh":"这部小说设想了一个以投票方式做出所有重大决定的十二人统治体制。"}]}],"synonyms":["rule of twelve","council of twelve","duodecarchy (rare variant)"],"phonetic":"/ˈdoʊdɛˌkɑrki/","extraExplanation":["这个词很少见，多出现在历史写作、政治学讨论或文学作品里，用来强调“权力由十二人共享/分掌”。","词源可拆解为希腊语 dōdeka（十二）+ -archy（统治、政体），类似构词还有 monarchy（君主制）、oligarchy（寡头政治）。"]}
{"word":"dodecasemic","summary":{"en":"“Dodecasemic” is a rare adjective meaning “having twelve meanings/senses.”","zh":"“dodecasemic” 是一个很少见的形容词，意思是“具有十二种含义/义项的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Linguistics; very rare) having twelve distinct meanings or senses; twelve‑meaning; extremely polysemous.","zh":"（语言学；很少用）具有十二种不同含义/义项的；“十二义”的；高度多义的。"},"examples":[{"en":"In the article, the author jokingly calls the verb “run” almost dodecasemic because of its many senses.","zh":"在那篇文章里，作者开玩笑说动词 run 几乎是“dodecasemic（十二义）”，因为它的义项太多。"},{"en":"A dodecasemic term can confuse learners unless each meaning is taught with clear context.","zh":"如果不在清晰语境中逐一教学，“dodecasemic（十二义）”的词会让学习者感到困惑。"}]}],"synonyms":["polysemous","highly polysemous","many-sensed"],"phonetic":"ˌdoʊdəkəˈsiːmɪk","extraExplanation":["这个词非常少见，多见于学术或玩笑式的造词。构词法：dodeca-（十二）+ sem(e)（“意义/语义单位”的词根，见于 semantic）+ -ic（形容词后缀）。","更常用、更自然的表达是 polysemous（多义的）或 highly polysemous（高度多义的）；也可以说 a word with many senses（有很多义项的词）。"]}
{"word":"dodecastylar","summary":{"en":"Dodecastylar describes a flower that has twelve styles (a technical botany term).","zh":"Dodecastylar 指花具有十二个花柱（植物学术语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Having twelve styles (the slender parts of a flower’s pistil that connect the ovary to the stigma).","zh":"（植物学）具十二个花柱的；有十二条花柱的（花柱是连接子房与柱头的细长部分）。"},"examples":[{"en":"In this description, the flower is noted as dodecastylar, meaning it has twelve styles.","zh":"在这段描述中，这朵花被标注为 dodecastylar，意思是它有十二个花柱。"},{"en":"The botanist compared the dodecastylar specimen with related species that have fewer styles.","zh":"植物学家将这株具十二花柱的标本与花柱较少的近缘物种进行比较。"}]}],"synonyms":["twelve-styled","dodecastylar"],"phonetic":"/ˌdoʊdəkəˈstaɪlər/","extraExplanation":["这是一个非常少见的植物学形态词，常见于学术描述或分类检索表中，而不常用于日常英语。","词源结构：dodeca- 表示“十二”（同 dodecagon 十二边形），-stylar 来自 style（花柱）。"]}
{"word":"dodecastyle","summary":{"en":"Dodecastyle describes a classical building façade with twelve columns across the front.","zh":"dodecastyle 用于描述古典建筑正面一排有十二根柱子的柱式。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(architecture) Having twelve columns on the front of a building or portico (especially a classical temple).","zh":"（建筑）指建筑或柱廊正面有十二根柱子（尤指古典神庙的正立面）。"},"examples":[{"en":"A dodecastyle temple typically has twelve columns across its front.","zh":"dodecastyle 神庙通常指正面一排有十二根柱子。"},{"en":"The guide described the main portico as dodecastyle, emphasizing its grand scale.","zh":"导游说主柱廊是 dodecastyle，强调了它的宏伟尺度。"}]}],"synonyms":["twelve-columned","duodecastyle","dodekastyle"],"phonetic":"/ˌdoʊdɪˈkæstaɪl/","extraExplanation":["词源上，dodeca- 来自希腊语，表示“十二”；-style（更常见写作 -stylos / -style）与“柱子/柱式”相关。该词多用于古典建筑分类中，用来按正面柱数描述神庙（如 tetrastyle 四柱、hexastyle 六柱、octastyle 八柱等）。","拼写上也可能见到 dodekastyle 或 duodecastyle（同义变体），但在一般英语中都属于较少见的专业词。"]}
{"word":"dodecastylos","summary":{"en":"A rare botanical term meaning “twelve-styled,” describing a flower with twelve styles.","zh":"一个较少见的植物学术语，意为“十二花柱的”，用于描述具有十二个花柱的花。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(botany) Having twelve styles (the stalk-like parts of a flower’s pistil), or relating to a flower/plant with twelve styles.","zh":"（植物学）具十二个花柱的；或指具有十二个花柱的花/植物。"},"examples":[{"en":"In an older botanical description, the flower is noted as dodecastylos, meaning it has twelve styles.","zh":"在较早的植物志描述中，这种花被记为 dodecastylos，意思是它有十二个花柱。"},{"en":"The botanist compared the dodecastylos form with flowers that have fewer styles.","zh":"植物学家把具十二花柱的类型与花柱较少的花进行比较。"}]}],"synonyms":["dodecastylous","twelve-styled"],"phonetic":"/ˌdoʊdɪˈkæstɪloʊs/","extraExplanation":["这个词很少见，更多时候你会看到形容词形式 dodecastylous（同义：twelve-styled）。","词源来自希腊语：dodeca-（十二）+ stylos（柱、杆；在植物学里指“花柱”）。常见于较旧的拉丁化分类描述或植物形态学记录中。","如果你是在某篇论文或标本标签上看到 dodecastylos，它通常是在强调“花柱数量”这一鉴别特征。"]}
{"word":"dodecastylous","summary":{"en":"A rare botanical adjective meaning “having twelve styles.”","zh":"一个少见的植物学形容词，表示“具十二个花柱的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Botany) Having twelve styles (slender stalks in a flower’s pistil, connecting the ovary to the stigma).","zh":"（植物学）具十二个花柱的（花柱是雌蕊中连接子房与柱头的细长部分）。"},"examples":[{"en":"The description notes a dodecastylous flower, meaning it has twelve styles.","zh":"描述中提到这种花是 dodecastylous 的，意思是它有十二个花柱。"},{"en":"In some botanical keys, being dodecastylous helps distinguish similar species.","zh":"在一些植物检索表中，“具十二花柱”这一特征可帮助区分相似物种。"}]}],"synonyms":["twelve-styled","having twelve styles"],"phonetic":"/ˌdoʊdɛkəˈstaɪləs/","extraExplanation":["这是一个很少见、偏专业的植物学形容词，常见于植物分类描述（flora、taxonomic description）中。","词源可拆解为 dodeca-（十二）+ stylous（与 style/花柱有关），用来精确描述花的雌蕊结构。日常英语中几乎不会用到。"]}
{"word":"dodecasyllabic","summary":{"en":"Describes a verse line that has twelve syllables.","zh":"用于描述每行有十二个音节的诗行（十二音节格律）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(of a line of verse) having twelve syllables.","zh":"（指诗行）有十二个音节的；十二音节诗行的。"},"examples":[{"en":"Many French classical poems are written in dodecasyllabic lines.","zh":"许多法国古典诗歌使用十二音节诗行写成。"},{"en":"The poet chose a dodecasyllabic meter to create a smooth, formal rhythm.","zh":"诗人选择十二音节格律来营造流畅、正式的节奏。"}]}],"synonyms":["twelve-syllable","alexandrine (often in French verse)"],"phonetic":"/ˌdoʊdɛkəsaɪˈlæbɪk/","extraExplanation":["“dodeca-”来自希腊语，表示“十二”（如 dodecagon 十二边形）；“syllabic”与“音节”有关。合起来就是“十二音节的”。","在诗歌里，dodecasyllabic 常用来描述一种诗行长度（每行12个音节），常见于法语诗的 alexandrine（亚历山大诗行）。英语里也会用，但更常见的是谈 iambic pentameter（五步抑扬格）。"]}
{"word":"dodecasyllable","summary":{"en":"A dodecasyllable is a twelve-syllable word or line of verse; it can also mean “having twelve syllables.”","zh":"dodecasyllable 指“十二音节词/十二音节诗行”，也可作形容词表示“有十二个音节的”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a word or line of verse that has twelve syllables","zh":"（词或诗行）由十二个音节组成的；十二音节词/诗行"},"examples":[{"en":"The poet wrote several dodecasyllables to create a slow, formal rhythm.","zh":"诗人写了几行十二音节诗句来营造缓慢而庄重的节奏。"},{"en":"Try counting: if the line has twelve syllables, it can be called a dodecasyllable.","zh":"试着数一数：如果这一行有十二个音节，就可以称为十二音节诗行。"}]},{"partOfSpeech":"adj.","definition":{"en":"having twelve syllables (describing a word or a line of verse)","zh":"（形容词）有十二个音节的（用于描述词或诗行）"},"examples":[{"en":"A dodecasyllable line can sound more expansive than a shorter line.","zh":"十二音节的诗行听起来往往比短诗行更舒展。"},{"en":"In this poem, each stanza begins with a dodecasyllable opening line.","zh":"这首诗里，每一节都以一个十二音节的开头诗行起笔。"}]}],"synonyms":["twelve-syllable line","alexandrine"],"phonetic":"ˌdoʊdɛkəˈsɪləbəl","extraExplanation":["“dodeca-”来自希腊语，表示“十二”（如 dodecagon 十二边形）；“syllable”指“音节”。因此 dodecasyllable 字面意思就是“十二个音节”。","在诗歌里，十二音节诗行在法语传统中很常见，常被称为“alexandrine（亚历山大诗行）”。英语诗歌更常见的是 iambic pentameter（五音步/约十音节），所以 dodecasyllable 更偏文学术语，用于讨论诗的格律与节奏。"]}
{"word":"dodecatemoria","summary":{"en":"An astrological “twelfth-parts” method that divides each zodiac sign into twelve 2.5° sections for detailed interpretation.","zh":"占星术中的“十二分法”：把每个星座分成十二个2.5度的小区段，用于更细致的解读。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"In astrology (especially Hellenistic/traditional astrology), a technique that divides each zodiac sign into twelve equal parts (2.5° each), assigning each part to a sign; used for fine-grained chart interpretation.","zh":"（占星术，尤指希腊化/传统占星）一种把每个黄道星座分成十二等份（每份2.5度）并分别对应到某个星座的技法，用于更细致地解读星盘。"},"examples":[{"en":"Some traditional astrologers use dodecatemoria to add detail to a planet’s position within a sign.","zh":"一些传统占星师会用 dodecatemoria 来细化行星在某个星座内部的位置解读。"},{"en":"In her notes, he calculated the Moon’s dodecatemoria before interpreting the chart.","zh":"在他的笔记里，他先计算月亮的 dodecatemoria，再进行星盘解读。"}]}],"synonyms":["twelfth-parts","duads (astrology)","dodecatemory (variant spelling)"],"phonetic":"/ˌdoʊ.də.kəˈtɛm.ə.ri.ə/","extraExplanation":["词源来自希腊语：dōdeka（十二）+ meros（部分/份额）。复数常见为 dodecatemoria。","它也常被称为“十二分法/十二分度”（有时对应英文 twelfth-parts 或 duads）。在现代日常英语中几乎不使用，主要出现在占星学文献与讨论中。"]}
{"word":"dodecatemorion","summary":{"en":"A traditional-astrology term for the “twelfth-part” subdivision (2.5°) of a zodiac sign, used for more detailed chart interpretation.","zh":"传统占星术术语，指把每个星座再按“十二分”（每份2.5度）细分，用于更精细的星盘解读。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Astrology) One of the 12 equal subdivisions of a zodiac sign (each 2.5°), used in some traditional/Hellenistic astrology; also the system/practice of interpreting these subdivisions.","zh":"（占星术）黄道十二宫中某一宫位的十二等分之一（每份2.5度），用于某些传统／希腊化占星体系；也可指用这些分段进行解读的方法。"},"examples":[{"en":"In some forms of Hellenistic astrology, each sign has a dodecatemorion that adds extra nuance to a chart reading.","zh":"在某些希腊化占星体系中，每个星座都有“十二分宫”（dodecatemorion），用来为星盘解读增加细节。"},{"en":"The astrologer calculated the dodecatemorion of the Moon to refine the interpretation.","zh":"占星师计算月亮的十二分宫位置，以细化解读。"}]}],"synonyms":["twelfth-part","duad","dwad","dodekatemorion"],"phonetic":"/ˌdoʊˌdɛkəˈtɛməriən/","extraExplanation":["词源来自希腊语：dōdeka（“十二”）+ meros（“部分”），字面意思就是“十二分之一”。","在技术细节上，它通常把每个星座的30度再分成12段，每段2.5度；在一些传统体系里，会把落入的“十二分段”对应到另一个星座（类似“宫中之宫”的概念），用来补充性格或事件判断。","这是相对小众、偏古典的术语；现代大众占星更常见的说法可能是“十二分盘/十二分宫（duads/dwad）”。"]}
{"word":"dodecatemory","summary":{"en":"Dodecatemory is a rare astrology term meaning a “twelfth-part” subdivision of a zodiac sign.","zh":"Dodecatemory 是一个较少见的占星术术语，指把星座/宫位按“十二分法”进行细分的单位。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Astrology, mainly historical) A “twelfth-part” division of a zodiac sign; one of 12 equal subdivisions used in some Hellenistic/medieval techniques to add detail to a planet’s position.","zh":"（占星术，主要为历史用法）黄道十二宫中某一宫位的“十二分法/十二分度”；把一个星座等分为12份的细分单位，用于更细致地解读行星位置。"},"examples":[{"en":"In Hellenistic astrology, some practitioners calculate the dodecatemory to refine a planet’s meaning.","zh":"在希腊化占星术中，有些从业者会计算 dodecatemory（十二分法）来细化行星含义。"},{"en":"The text explains how each sign can be split into twelve dodecatemories.","zh":"这本书解释了如何把每个星座分成十二个 dodecatemories（十二分段）。"}]}],"synonyms":["dodecatemorion","dodecatemoria","twelfth-part (astrology)","dwadashamsha","dvadasamsa"],"phonetic":"/ˌdoʊdɛkəˈtɛməri/","extraExplanation":["“dodecatemory”在现代英语里比较少见，更常见的拼写是 **dodecatemoria**（复数）或 **dodecatemorion**（单数），来源于希腊语 *dōdeka*（十二）+ *meros*（部分）。","在一些占星传统中，它也会和梵文体系的 **Dwadashamsha / Dvadasamsa（十二分盘/十二分法）**类比讨论，但具体算法与用法可能因流派而异。"]}
{"word":"Dodecatheon","summary":{"en":"Dodecatheon most commonly means the “shooting star” wildflower; more rarely, it refers to the twelve Olympian gods in Greek mythology.","zh":"Dodecatheon最常指“流星花/射星花（shooting star）”这种野花；较少情况下也指希腊神话的奥林匹斯十二主神。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of wildflowers commonly called “shooting stars,” known for their backward-bent petals and star-like shape (in modern botany, often treated as part of the primrose genus, *Primula*).","zh":"一种野花属名，俗称“流星花/射星花（shooting star）”，特点是花瓣向后翻卷、形似星星（现代分类中常并入报春花属 *Primula*）。"},"examples":[{"en":"In spring, the meadow is dotted with Dodecatheon, the pink “shooting star” flowers.","zh":"春天时，草地上点缀着朵朵Dodecatheon，也就是粉色的“流星花”。"},{"en":"The trail guide points out Dodecatheon growing in moist, shady areas.","zh":"步道导览手册指出Dodecatheon常生长在潮湿、阴凉的地方。"}]},{"partOfSpeech":"n.","definition":{"en":"(literary or rare) the “twelve gods” of Greek mythology, especially the twelve Olympian gods.","zh":"（文学或较少用法）希腊神话中的“十二神”，尤指奥林匹斯十二主神。"},"examples":[{"en":"The poem invokes the Dodecatheon as witnesses to the hero’s oath.","zh":"诗歌召唤Dodecatheon作为英雄誓言的见证者。"},{"en":"In older writings, “Dodecatheon” may refer to the twelve Olympians as a group.","zh":"在较早的著作中，“Dodecatheon”有时用来统称奥林匹斯十二主神。"}]}],"synonyms":["shooting star (flower)","twelve Olympians","the Olympian gods"],"phonetic":"/ˌdoʊdɪkəˈθiːən/","extraExplanation":["词源来自希腊语：*dōdeka*（十二）+ *theoi*（诸神）。因此它既可指“十二神”，也被林奈等早期植物学者借来为一种花命名，带有“如神祇/如星辰般夺目”的意象。","分类学小提示：你可能在新一些的植物志中看到它被写作 *Primula*（报春花属）中的一个类群（如 *Primula* sect. *Dodecatheon*），但在园艺与常用语境里仍常称 Dodecatheon。"]}
{"word":"dodecatheon","summary":{"en":"Dodecatheon is a flowering plant (shooting star) with petals that sweep back like a star.","zh":"Dodecatheon 指一种“流星花”，花瓣向后翻卷，形似星星。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of flowering plants commonly called “shooting stars,” known for their backward-swept petals and star-like shape","zh":"一种开花植物属，常见英文俗名为“shooting star（流星花）”，花瓣向后翻卷，形状像星星"},"examples":[{"en":"In spring, dodecatheon blooms in moist meadows with bright, nodding flowers.","zh":"春天时，dodecatheon 常在潮湿的草地开花，花朵鲜艳且下垂。"},{"en":"The garden’s dodecatheon looked like tiny shooting stars above the leaves.","zh":"花园里的 dodecatheon 看起来像叶片上方的小流星花。"}]}],"synonyms":["shooting star","Primula (modern classification)"],"phonetic":"/ˌdoʊ.də.kəˈθiː.ən/","extraExplanation":["“Dodecatheon”来自希腊语：dōdeka（十二）+ theoi（神），意思是“十二神”。早期的命名者可能觉得这种花很“神圣/像星星”，因此用了与希腊神话相关的名字。","日常英语中更常听到它的俗名 shooting star（流星花）。在现代植物分类里，它常被并入报春花属（Primula），但在园艺和旧资料中仍常用 dodecatheon。"]}
{"word":"dodecatoic","summary":{"en":"“Dodecanoic” means related to dodecanoic acid (lauric acid), a 12‑carbon saturated fatty acid.","zh":"“Dodecanoic” 指与十二烷酸（月桂酸）有关，它是一种含 12 个碳的饱和脂肪酸。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a 12‑carbon (C12) saturated fatty acid; most commonly used in the term “dodecanoic acid” (also called lauric acid).","zh":"与含 12 个碳原子（C12）的饱和脂肪酸有关；最常见于短语 “dodecanoic acid”（十二烷酸，也叫月桂酸）。"},"examples":[{"en":"Dodecanoic acid is also known as lauric acid.","zh":"Dodecanoic acid 也被称为 lauric acid（月桂酸）。"},{"en":"Coconut oil contains a high amount of dodecanoic acid.","zh":"椰子油含有较高比例的 dodecanoic acid（十二烷酸）。"}]}],"synonyms":["lauric (acid)","C12:0"],"phonetic":"/ˌdoʊdəˈkænoʊɪk/","extraExplanation":["你输入的 “dodecatoic” 很可能是拼写错误；标准拼法通常是 **dodecanoic**（如：dodecanoic acid）。在化学与营养学语境里，它指的是 C12:0 的饱和脂肪酸——十二烷酸（常名：月桂酸）。","这个词多出现在专业文本（化学、生物、营养标签）中，日常英语里更常直接说 **lauric acid**。"]}
{"word":"dodecatyl","summary":{"en":"Dodecatyl means “having a 12‑carbon alkyl group (C12H25–),” often seen in chemical names like dodecyl sulfate.","zh":"dodecatyl 指“含有十二碳烷基（C12H25–）的”，常见于如十二烷基硫酸盐等化学名称中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"a chemical group (alkyl substituent) with 12 carbon atoms, usually written as C12H25–; often the same as the lauryl group derived from dodecane","zh":"（化学）十二碳的烷基取代基，通常写作 C12H25–；常与由十二烷衍生的“月桂基（lauryl）”含义相近"},"examples":[{"en":"Dodecatyl groups are common in surfactants because they help dissolve oils.","zh":"十二烷基常见于表面活性剂中，因为它有助于溶解油脂。"},{"en":"The formula C12H25– indicates a dodecatyl substituent.","zh":"式子 C12H25– 表示一个十二烷基取代基。"},{"en":"Sodium dodecatyl sulfate (SDS) is widely used in laboratories.","zh":"十二烷基硫酸钠（SDS）在实验室中用途很广。"}]}],"synonyms":["dodecyl","lauryl","C12 alkyl"],"phonetic":"ˌdoʊdɪˈkætɪl","extraExplanation":["“dodecatyl”来自数字前缀 dodeca-（十二）+ -yl（表示有机化学中的“烷基/取代基”）。在化学命名里，它强调“作为侧链/取代基有12个碳”，而不是指完整分子本身（完整分子常叫 dodecane：十二烷）。","实际使用中你更常见到相关词：dodecyl / lauryl（十二烷基/月桂基）。例如：sodium dodecyl sulfate（SDS，十二烷基硫酸钠）也常被写作 sodium lauryl sulfate（SLS）。"]}
{"word":"dodecatylic","summary":{"en":"“Dodecatylic” describes something that contains or relates to a 12‑carbon alkyl (dodecyl) chain.","zh":"“dodecatylic”指含有或与十二碳烷基（十二烷基）链有关。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Chemistry) Having a 12‑carbon alkyl chain; related to the dodecyl (C12H25–) group.","zh":"（化学）具有12个碳的烷基链；与十二烷基（C12H25–）有关。"},"examples":[{"en":"This surfactant contains a dodecatylic chain that helps it dissolve oils.","zh":"这种表面活性剂含有十二碳（dodecatylic）链，有助于溶解油脂。"},{"en":"Replacing an octyl group with a dodecatylic group often increases hydrophobicity.","zh":"把辛基换成十二碳烷基（dodecatylic）通常会增强疏水性。"},{"en":"The sample showed a dodecatylic substituent in the spectra.","zh":"光谱显示样品中有一个十二碳烷基（dodecatylic）取代基。"}]}],"synonyms":["dodecyl","lauryl"],"phonetic":"/ˌdoʊdəkəˈtɪlɪk/","extraExplanation":["“dodecatylic”由前缀 dodeca-（十二）和化学后缀 -yl（表示烷基/取代基）相关构成，常见更通用的说法是 dodecyl；在表面活性剂与有机合成语境中更常见。","相关词：dodecane（十二烷，C12H26），dodecanoic acid（十二烷酸/“月桂酸” lauric acid）。在命名中，-yl 通常表示“作为取代基的烃基”，而不是完整的烷烃分子。"]}
{"word":"dodecene","summary":{"en":"Dodecene is a 12‑carbon alkene (C12H24), often referring to isomers such as 1‑dodecene.","zh":"dodecene（十二烯）是含12个碳的烯烃（C12H24），常指包括1-十二烯在内的多种同分异构体。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound: an alkene (a hydrocarbon with one C=C double bond) that has 12 carbon atoms, with the general formula C12H24; it can exist as different isomers (for example, 1-dodecene).","zh":"一种化学化合物：含有一个碳碳双键（C=C）的烯烃，具有12个碳原子，通式为 C12H24；可有不同的同分异构体（如1-十二烯）。"},"examples":[{"en":"1-Dodecene is a type of dodecene used in making detergents and other chemicals.","zh":"1-十二烯是一种十二烯，常用于制造洗涤剂和其他化学品。"},{"en":"In the lab, we identified dodecene by its alkene reaction pattern.","zh":"在实验室里，我们通过它的烯烃反应特征鉴定出十二烯。"}]}],"synonyms":["1-dodecene","dodecylene"],"phonetic":"/ˌdoʊdɪˈsiːn/","extraExplanation":["“dode-”来自希腊语，表示“十二”；“-ene”表示“烯烃（含双键）”。因此 dodecene 字面意思就是“十二碳的烯烃”。","十二烯不是单一结构：双键位置不同会形成不同异构体（如 1-dodecene、2-dodecene 等），它们性质相近但并不完全相同。"]}
{"word":"dodecennial","summary":{"en":"“Dodecennial” means occurring every twelve years or relating to a twelve-year period.","zh":"“dodecennial”表示“每十二年发生一次”或“与十二年周期有关”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Happening every twelve years; relating to a twelve-year period.","zh":"每十二年一次的；与十二年周期有关的。"},"examples":[{"en":"The census is dodecennial in some places, meaning it happens every twelve years.","zh":"有些地方的人口普查是每十二年一次的，也就是“dodecennial”。"},{"en":"They planned a dodecennial review of the policy to match long-term trends.","zh":"他们计划每十二年对政策进行一次审查，以配合长期趋势。"}]}],"synonyms":["twelve-year","every twelve years","duodecennial"],"phonetic":"/ˌdoʊdɪˈsɛnɪəl/","extraExplanation":["词源上，dodecennial 来自拉丁语：dodec-（十二）+ -ennial（与“年/多年周期”相关）。在正式或学术语境中更常见，日常英语里往往会说 every twelve years 或 a twelve-year cycle。"]}
{"word":"dodecuplet","summary":{"en":"A dodecuplet is a group or unit of twelve, often used in more formal contexts such as poetry, music, or technical descriptions.","zh":"dodecuplet 指“十二个组成的一组/一个单位”，多用于较正式的语境，如诗歌、音乐或技术性描述。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A group of twelve people or things.","zh":"十二个（人或物）组成的一组；十二人/十二件（事物）组合。"},"examples":[{"en":"The flowers grew in dodecuplets around the garden path.","zh":"这些花沿着花园小路成十二株一组地生长。"},{"en":"The orchestra performed a passage built on dodecuplets of notes.","zh":"乐团演奏了一段以十二个音符为一组构成的乐句。"}]},{"partOfSpeech":"n.","definition":{"en":"In poetry or music, a unit of twelve lines, beats, notes, or other repeated elements.","zh":"（诗歌或音乐中）由十二行、十二拍、十二个音符等构成的单位/段落。"},"examples":[{"en":"The poet organized the poem into dodecuplets to create a steady rhythm.","zh":"诗人把诗分成十二行一组，以营造稳定的节奏。"},{"en":"The composer experimented with dodecuplets to vary the phrasing.","zh":"作曲家用十二个音符/节拍为一组来变化乐句。"}]}],"synonyms":["group of twelve","set of twelve","dozen (less formal)"],"phonetic":"/doʊˈdɛkjəplət/","extraExplanation":["“dodecuplet”由拉丁语词根组成：dodeca- 表示“十二”（同源词如 dodecagon“十二边形”），-plet/-plette 表示“一组/一套”（如 couplet“两行对句”、triplet“三个一组”）。","这个词在日常英语里很少见，更常用于较正式或技术性的语境（例如文学分析、音乐理论、数学/几何的描述）。日常表达通常会说 “a group/set of twelve”。","发音提示：重音通常落在第三音节 “CUP” 上：do-de-CUP-let。"]}
{"word":"dodecyl","summary":{"en":"Dodecyl refers to a 12‑carbon alkyl group (C12H25–), commonly seen in detergents and surfactants.","zh":"dodecyl 指“十二烷基”（C12H25–），常见于洗涤剂和表面活性剂等化学名称中。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to a chemical group with 12 carbon atoms (C12H25–), often found in detergents and surfactants","zh":"与“十二烷基”有关的；指含有12个碳原子的烃基（C12H25–），常见于洗涤剂与表面活性剂中"},"examples":[{"en":"Sodium dodecyl sulfate (SDS) is a common detergent used in laboratories.","zh":"十二烷基硫酸钠（SDS）是一种在实验室中常用的洗涤剂。"},{"en":"The dodecyl chain helps the molecule mix with oils and fats.","zh":"十二烷基链能帮助分子与油脂更好地混合。"}]},{"partOfSpeech":"n.","definition":{"en":"a 12-carbon alkyl group (C12H25–) used as part of a larger chemical name","zh":"十二碳的烷基（C12H25–）；常作为更长化学名称的一部分使用"},"examples":[{"en":"In the formula C12H25Cl, the C12H25– part is a dodecyl group.","zh":"在化学式 C12H25Cl 中，C12H25– 这一部分就是十二烷基。"}]}],"synonyms":["lauryl"],"phonetic":"/ˈdoʊdəsəl/","extraExplanation":["“dodec-”来自希腊语，表示“十二”。在有机化学命名中，12个碳的直链烷烃叫“dodecane（十二烷）”，而从十二烷上去掉一个氢得到的取代基就是“dodecyl（十二烷基）”。","你可能在“SDS-PAGE”里见过SDS（十二烷基硫酸钠）：其中“dodecyl”这段碳链让分子一端“亲油/疏水”，而带电的硫酸根一端“亲水”，因此它能把油脂或蛋白质“拉开并分散”。"]}
{"word":"dodecylene","summary":{"en":"Dodecylene is a twelve‑carbon alkene (C12H24) mainly used as an industrial chemical feedstock.","zh":"Dodecylene（十二碳烯）是含12个碳的烯烃（C12H24），主要用作工业化工原料。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical (an alkene) with twelve carbon atoms, formula C12H24; used as an industrial raw material (for example, to make surfactants and other chemicals).","zh":"十二碳烯（一种烯烃），化学式 C12H24；常作为工业原料（例如用于制造表面活性剂等化学品）。"},"examples":[{"en":"The lab stored dodecylene in a tightly sealed bottle because it is a volatile hydrocarbon.","zh":"实验室把十二碳烯密封保存，因为它是一种易挥发的烃类。"},{"en":"In industry, dodecylene can be processed into ingredients used in detergents.","zh":"在工业上，十二碳烯可以进一步加工成洗涤剂中的成分。"}]}],"synonyms":["dodecene","C12 alkene"],"phonetic":"ˌdoʊdəˈsaɪliːn","extraExplanation":["“dodec-”表示“十二”，而“-ene”常用于表示“烯烃”（含有碳碳双键的烃）。","“dodecylene”并不总是指单一结构：在实际应用中，它可能指一类具有相同分子式但双键位置不同的同分异构体混合物，因此不同来源的产品性质可能略有差异。"]}
{"word":"dodecylic","summary":{"en":"“Dodecylic” means ‘related to a 12‑carbon (dodecyl) chain,’ mainly used in chemistry.","zh":"“dodecylic”意为“与十二烷基（12个碳的碳链）有关”，主要用于化学语境。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to a dodecyl group (a 12‑carbon chain) in organic chemistry; used to describe compounds that contain or are derived from a C12 chain.","zh":"（有机化学）与“十二烷基”（含12个碳的碳链）有关的；用于描述含有或源自C12碳链的化合物。"},"examples":[{"en":"Dodecylic compounds are often used in surfactants for soaps and detergents.","zh":"含十二烷基的化合物常用于肥皂和洗涤剂中的表面活性剂。"},{"en":"The label mentioned a dodecylic sulfate, which helps the product foam.","zh":"标签上提到“十二烷基硫酸盐”，它能帮助产品起泡。"}]}],"synonyms":["dodecyl","lauryl (related term)"],"phonetic":"ˌdoʊdəˈsɪlɪk","extraExplanation":["“dodecylic”主要出现在化学/材料/日化配方语境中，日常英语里很少单独使用；更常见的是相关词：dodecyl（十二烷基）、dodecyl sulfate（十二烷基硫酸盐）、dodecylbenzene sulfonate（十二烷基苯磺酸盐）。","词根提示：dodec- 来自希腊语表示“12”，-yl 表示烃基（基团），-ic 常见于形容词或“某种酸/性质”的描述。","如果你看到 “dodecylic acid”，通常指“十二烷酸（lauric acid，月桂酸）”，常存在于椰子油、棕榈仁油等中。"]}
{"word":"dodecylphenol","summary":{"en":"Dodecylphenol is an industrial chemical: a phenol with a 12‑carbon (dodecyl) side chain.","zh":"dodecylphenol（十二烷基苯酚）是一种工业化学品：在苯酚结构上带有 12 碳的十二烷基侧链。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a chemical compound: a phenol (an aromatic ring with an –OH group) that has a dodecyl (12‑carbon) alkyl chain attached; used mainly as an industrial intermediate (for example, to make surfactants, resins, and additives).","zh":"一种化学化合物：在苯酚（带有—OH 的芳香环）上连接了一个十二烷基（12 个碳的烷基）侧链；主要作为工业中间体使用（例如用于制造表面活性剂、树脂和各类添加剂）。"},"examples":[{"en":"Dodecylphenol is often used to manufacture surfactants for industrial cleaning.","zh":"十二烷基苯酚常用于制造工业清洗用的表面活性剂。"},{"en":"The lab labeled the bottle as dodecylphenol and stored it in a chemical cabinet.","zh":"实验室把瓶子标注为“十二烷基苯酚”，并存放在化学品柜中。"}]}],"synonyms":["alkylphenol","dodecyl phenol","C12 phenol"],"phonetic":"/doʊˌdɛsəlˈfiːnɔːl/","extraExplanation":["词源拆解有助于记忆：dodecyl- 表示“十二个碳的烷基链”（类似 dodecane=十二烷）；phenol 指“苯酚”。合起来就是“带十二碳烷基取代的苯酚”。","它属于“烷基苯酚（alkylphenols）”这一类化学品。实际应用中常见的是作为原料去合成更复杂的产品（如某些非离子表面活性剂）。","作为化学品名词，它多见于工业、材料、环境或安全数据表（SDS）语境；具体危害与法规要求会随具体异构体、纯度与用途而变。"]}
{"word":"dodekastyle","summary":{"en":"Dodekastyle describes a classical building front that has twelve columns in a row.","zh":"dodekastyle 指古典建筑正面（或柱廊）一排有十二根柱子的“十二柱式”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Architecture) having a row of twelve columns, especially on the front of a classical building.","zh":"（建筑）十二柱式的；（尤指古典建筑正面）有一排十二根柱子的。"},"examples":[{"en":"The temple’s façade is dodekastyle, with twelve columns across the front.","zh":"这座神庙的正面是十二柱式的，前方横排十二根柱子。"},{"en":"In his notes, the historian describes the entrance as dodekastyle and richly decorated.","zh":"在笔记中，这位历史学家把入口描述为十二柱式，并且装饰华丽。"}]},{"partOfSpeech":"n.","definition":{"en":"a building front (or portico) characterized by twelve columns in a row.","zh":"（建筑正面或柱廊的类型）以一排十二根柱子为特征的结构/样式。"},"examples":[{"en":"The guide pointed out the dodekastyle of the main entrance.","zh":"导游指出主入口采用了十二柱式的柱廊。"}]}],"synonyms":["twelve-columned (architecture)","dodecastyle"],"phonetic":"ˌdoʊdɛkəˈstaɪl","extraExplanation":["“dodeka-”源自希腊语，表示“十二”；“style”在建筑语境里与“柱式/柱列”相关（可理解为“有多少根柱子的一排”）。","这种词多见于古典建筑描述中，和常见的“hexastyle（六柱式）”“octastyle（八柱式）”同一套命名方式。"]}
{"word":"dodgasted","summary":{"en":"“Dodgasted” is an informal, dialect word meaning extremely surprised or shocked (often spelled “doggasted”).","zh":"“dodgasted”是一个非正式/方言用词，表示“非常吃惊、震惊”（更常见拼写为“doggasted”）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Informal, dialect) Extremely surprised or shocked; astonished.","zh":"（非正式/方言）非常吃惊的；震惊的；目瞪口呆的。"},"examples":[{"en":"I was dodgasted when I heard the news.","zh":"听到这个消息时，我震惊得说不出话来。"},{"en":"She looked dodgasted, like she couldn’t believe what she’d just seen.","zh":"她看起来目瞪口呆，好像不敢相信刚刚看到的东西。"},{"en":"We were all dodgasted by how quickly things changed.","zh":"事情变化得太快，我们大家都很震惊。"}]}],"synonyms":["astonished","shocked","stunned","aghast","speechless"],"phonetic":"/ˈdɑːɡæstɪd/","extraExplanation":["“dodgasted”并不是标准英语里的常见拼写，更常见的是 **doggasted**（同样偏口语/方言），意思接近 **astonished / shocked / aghast**。在正式写作中建议用 **astonished** 或 **shocked**。","这个词带有强烈的口语色彩，常用于讲故事、幽默表达或模仿地方口音的对话里。不同地区/作者可能会用不同拼写来体现口音，因此你可能会在小说对白或社交媒体里见到它。"]}
{"word":"Dodge","summary":{"en":"“Dodge” means to quickly move to avoid something, or to avoid dealing with a question or responsibility; as a noun, it can mean a quick evasive move or a trick.","zh":"“dodge”指迅速闪躲以避开某物，也可指回避问题/责任；作名词可指闪避动作或用来逃避的花招。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to move quickly to avoid someone or something (often by stepping aside or ducking)","zh":"迅速躲开（人或物）；闪避（常指侧身、低头等动作）"},"examples":[{"en":"He dodged the ball and it flew past him.","zh":"他闪开了球，球从他身边飞过去。"},{"en":"She dodged out of the way of the bicycle.","zh":"她赶紧闪到一边，避开了自行车。"}]},{"partOfSpeech":"v.","definition":{"en":"to avoid dealing with something (a question, responsibility, or rule), often in a dishonest or indirect way","zh":"回避（问题、责任或规则）；躲闪（常带“不直接面对/不诚实”的意味）"},"examples":[{"en":"The politician dodged the question during the interview.","zh":"那位政客在采访中回避了这个问题。"},{"en":"Don’t dodge your responsibilities—finish the project.","zh":"别逃避你的责任——把项目完成。"}]},{"partOfSpeech":"n.","definition":{"en":"a quick movement to avoid something, especially a hit","zh":"（尤指为躲开攻击而做的）闪避动作"},"examples":[{"en":"With one quick dodge, he avoided the punch.","zh":"他一个迅速的闪避，躲开了那一拳。"}]},{"partOfSpeech":"n.","definition":{"en":"a clever trick or method used to avoid something or to deceive","zh":"（为回避或欺骗而用的）花招；诡计；伎俩"},"examples":[{"en":"Calling in ‘sick’ was his usual dodge to skip work.","zh":"打电话说“生病了”是他逃班的惯用伎俩。"}]}],"synonyms":["avoid","evade","duck","sidestep","swerve","dodge"],"phonetic":"/dɑdʒ/","extraExplanation":["“dodge”常见搭配：dodge a question（回避问题）、dodge responsibility（逃避责任）、dodge a bullet（字面“躲开子弹”，引申为“侥幸躲过一劫”）。","语气区别：表示身体动作时较中性；表示回避问题/责任时常带负面评价，暗示不坦诚或不正面应对。","专有名词：Dodge 也是美国汽车品牌（道奇）。在句子里通常大写：He drives a Dodge."]}
{"word":"dodge","summary":{"en":"“Dodge” means to avoid something—either by quick movement (physical) or by avoiding a duty or question (more indirect).","zh":"“dodge”表示“避开”：可以是身体上迅速闪躲，也可以是抽象地回避问题、责任等（常带不坦率的意味）。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"to move quickly to avoid someone or something; to evade","zh":"迅速闪开以避开（人或物）；躲避"},"examples":[{"en":"He dodged the ball and it flew past his shoulder.","zh":"他闪开了球，球从他肩旁飞了过去。"},{"en":"She dodged through the crowd to catch the train.","zh":"她在人群中穿梭躲闪，赶去搭火车。"}]},{"partOfSpeech":"v.","definition":{"en":"to avoid doing something (often a duty, question, or responsibility), especially in a dishonest or indirect way","zh":"（常指以不诚实或迂回方式）逃避（职责、问题、责任）"},"examples":[{"en":"The politician dodged the question instead of answering it directly.","zh":"这位政客没有正面回答，而是回避了这个问题。"},{"en":"He tried to dodge his chores, but his parents noticed.","zh":"他想逃避家务，但父母发现了。"}]},{"partOfSpeech":"n.","definition":{"en":"a quick movement to avoid something; an act of dodging","zh":"闪避动作；躲闪"},"examples":[{"en":"With a quick dodge, she avoided the cyclist.","zh":"她一个快速闪避，避开了骑车的人。"}]},{"partOfSpeech":"n.","definition":{"en":"a trick or method used to avoid something unpleasant, or a clever but slightly dishonest tactic","zh":"（为避开麻烦的）花招；小伎俩（略带不光明正大之意）"},"examples":[{"en":"That’s just a dodge to delay paying the bill.","zh":"那只是拖延付账的花招。"}]}],"synonyms":["avoid","evade","sidestep","duck","swerve"],"phonetic":"/dɑdʒ/","extraExplanation":["“dodge”既可以指身体上的“闪躲/躲开”（很具体、动作感强），也常用来指“回避问题或责任”（更抽象、带一点不坦率的语气）。","常见搭配：dodge a ball/punch（躲开球/拳头），dodge a question（回避问题），tax dodge（避税手段，常带负面含义）。"]}
{"word":"dodged","summary":{"en":"“Dodged” means “avoided”—either by quickly moving out of the way, or by evasively avoiding a question, duty, or contact.","zh":"“dodged”表示“躲开/回避”：既可指身体上的闪躲，也可指对问题、责任或联系的敷衍回避。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “dodge”: to move quickly to avoid something (like a hit, danger, or an obstacle).","zh":"“dodge”的过去式/过去分词：迅速闪开以躲避某物（如攻击、危险或障碍物）。"},"examples":[{"en":"He dodged the ball just in time.","zh":"他及时闪开，躲过了球。"},{"en":"She dodged a cyclist on the sidewalk.","zh":"她在人行道上闪开，避开了一位骑车的人。"}]},{"partOfSpeech":"v.","definition":{"en":"Past tense/past participle of “dodge”: to avoid answering, dealing with, or taking responsibility for something (often seen as dishonest or evasive).","zh":"“dodge”的过去式/过去分词：回避回答、处理或承担责任（常带有“躲闪、敷衍”的负面意味）。"},"examples":[{"en":"The politician dodged the question.","zh":"那位政治人物回避了这个问题。"},{"en":"He dodged responsibility and blamed someone else.","zh":"他逃避责任，把错怪到别人身上。"},{"en":"She dodged my calls all week.","zh":"她一整周都在躲我的电话。"}]}],"synonyms":["avoided","evaded","sidestepped","ducked","shirked"],"phonetic":"/dɑdʒd/","extraExplanation":["“dodge”既可以表示身体上的“闪躲”，也常用于抽象意义的“回避”。在新闻与职场语境里，常见搭配是“dodge a question / dodge responsibility”。","语气差别：用于“回避”时往往暗示不正面回应；如果只是礼貌地不谈某事，更中性可以用“avoid (the topic/question)”。"]}
{"word":"dodgeful","summary":{"en":"“Dodgeful” means tricky or evasive (often in an old-fashioned/literary way).","zh":"“dodgeful”指狡猾、爱回避的（多为较古旧或文学用法）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(Archaic or literary) full of dodges; tricky or evasive in a way that avoids a clear answer or direct action.","zh":"（古旧或文学用语）充满花招的；狡猾而善于闪避的（用回避、推脱来不正面回应或行动）。"},"examples":[{"en":"The witness gave a dodgeful reply that avoided the question.","zh":"证人给了一个闪烁其词的回答，避开了问题。"},{"en":"Don’t be dodgeful—just tell me the truth.","zh":"别耍滑头了——直接告诉我真相。"}]}],"synonyms":["evasive","tricky","shifty","slippery","sly"],"phonetic":"/ˈdɑdʒfəl/","extraExplanation":["“dodgeful”由动词“dodge”（躲闪、回避）加后缀“-ful”（充满……的）构成，常见于较旧的英语或文学语境；现代日常英语里更常用“evasive / slippery / tricky / shifty”等。"]}
{"word":"Dodgem","summary":{"en":"Dodgem means a bumper car (often used in the plural: dodgems), especially in British English.","zh":"Dodgem 指“碰碰车”（常用复数 dodgems），尤见于英式英语。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small electric car in an amusement park that you can drive and bump into other cars (often plural: dodgems; also called a bumper car)","zh":"（游乐场里的）碰碰车（常用复数 dodgems；也叫 bumper car）"},"examples":[{"en":"The kids spent an hour on the dodgems at the fair.","zh":"孩子们在庙会的碰碰车上玩了一个小时。"},{"en":"Be careful—dodgems are meant to bump, but you can still get hurt.","zh":"小心点——碰碰车就是用来互相撞的，但还是可能受伤。"}]}],"synonyms":["bumper car","autoscooter"],"phonetic":"/ˈdɑdʒəm/","extraExplanation":["“dodgems”更常见于英式英语；在美式英语里更常说“bumper cars”。","“Dodgem”最早是早期碰碰车/游乐设施的品牌名，后来在一些地区被泛化为这种项目的通称；当作品牌时可大写。"]}
{"word":"dodgem","summary":{"en":"Dodgem means a bumper car at an amusement park (especially in British English).","zh":"Dodgem 指游乐园的“碰碰车”（尤其常见于英式英语）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a small electric car at an amusement park that you drive and bump into other cars for fun; a bumper car (often used in British English).","zh":"（游乐园里的）碰碰车；（常见于英式英语）"},"examples":[{"en":"The kids spent an hour riding the dodgems at the fair.","zh":"孩子们在游乐场玩了一小时碰碰车。"},{"en":"We kept crashing into each other on the dodgems and laughing.","zh":"我们在碰碰车上不停撞来撞去，笑个不停。"}]},{"partOfSpeech":"n.","definition":{"en":"(Dodgem) a trademark name that became a common word for bumper cars in some places.","zh":"（Dodgem）商标名；在一些地区被泛化为“碰碰车”的通用说法。"},"examples":[{"en":"The sign said “Dodgem Cars,” but everyone just called them dodgems.","zh":"牌子上写着“Dodgem Cars”，但大家都直接叫它们“dodgems”。"}]}],"synonyms":["bumper car","bumper cars"],"phonetic":"/ˈdɑdʒəm/","extraExplanation":["“dodgem”主要是英式用法；美式英语里更常说“bumper car(s)”。","在英国及部分英联邦地区的游乐场/集市（fairground）里，经常会看到“dodgems”这个项目名称。"]}
{"word":"dodgems","summary":{"en":"Dodgems are bumper cars at a fair or amusement park (mainly British English).","zh":"dodgems 指游乐场或集市上的“碰碰车”（主要为英式英语用法）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(British English) Bumper cars: small electric cars at an amusement park or fair that people drive and intentionally bump into each other.","zh":"（英式英语）碰碰车：游乐园或集市里的一种小型电动汽车项目，游客驾驶并故意互相撞击。"},"examples":[{"en":"The kids spent half an hour on the dodgems at the fair.","zh":"孩子们在集市上的碰碰车里玩了半个小时。"},{"en":"We queued for the dodgems after the roller coaster.","zh":"坐完过山车后，我们排队去玩碰碰车。"},{"en":"He kept laughing every time our dodgems crashed.","zh":"每次我们的碰碰车撞在一起，他都笑个不停。"}]}],"synonyms":["bumper cars","bumper cars ride"],"phonetic":"/ˈdɑdʒəmz/","extraExplanation":["“dodgems”主要用于英国等地的英语；在美式英语里更常说“bumper cars”。","这个词常见于游乐场/嘉年华（fair, funfair, amusement park）的语境；有时也会写作“Dodgems”，源于早期的商品名/招牌用法。"]}
{"word":"dodgen","summary":{"en":"“Dodgen” is mainly used as a surname; it’s also commonly a misspelling of “dodge.”","zh":"“Dodgen”主要用作姓氏；也常见为“dodge”的误拼。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), seen in some English-speaking contexts","zh":"（专有名词）姓氏，在一些英语语境中可见"},"examples":[{"en":"Ms. Dodgen will lead the meeting today.","zh":"Dodgen 女士今天将主持会议。"},{"en":"I found an article written by Dr. Dodgen.","zh":"我找到一篇由 Dodgen 博士写的文章。"}]},{"partOfSpeech":"other","definition":{"en":"a nonstandard spelling; often a typo for “dodge” (to avoid or evade something)","zh":"（非标准拼写）常见为 “dodge”（躲开/避开）的误拼"},"examples":[{"en":"If you meant “dodge,” you can say: “He dodged the ball.”","zh":"如果你想写的是 “dodge”，可以说：“He dodged the ball.”（他躲开了球。）"},{"en":"She tried to dodge the question.","zh":"她试图回避这个问题。"}]}],"synonyms":["(for dodge) avoid","evade","sidestep"],"phonetic":"/ˈdɑdʒən/","extraExplanation":["“Dodgen”在常用英语词典里通常不作为普通词条出现，更常见的是姓氏拼写（专有名词）。","如果你是想表达“躲避/闪开/回避”，标准拼写是“dodge”。你也可以把你的原句发我，我帮你确认最合适的词。"]}
{"word":"dodger","summary":{"en":"A dodger is usually someone who avoids duties or payment in a sneaky way; it can also mean a member of the Los Angeles Dodgers baseball team.","zh":"dodger 通常指用不光彩的方式逃避责任、工作或缴费的人；也可指美国职棒洛杉矶道奇队的队员/球员。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a person who avoids something (such as responsibility, work, or paying money) in a dishonest or sneaky way","zh":"（常带贬义）逃避者；（用不正当方式）躲避责任/工作/缴费的人"},"examples":[{"en":"The government is trying to crack down on tax dodgers.","zh":"政府正试图严厉打击逃税者。"},{"en":"He’s a draft dodger, according to the old rumors.","zh":"按老传闻说，他是个逃避服兵役的人。"},{"en":"Don’t be a responsibility dodger—own your mistake.","zh":"别当逃避责任的人——要为自己的错误负责。"}]},{"partOfSpeech":"n.","definition":{"en":"a player or a member of the Los Angeles Dodgers (a U.S. Major League Baseball team)","zh":"洛杉矶道奇队（美国职棒大联盟球队）的球员或队员"},"examples":[{"en":"She’s been a Dodgers fan since childhood, so she follows every Dodger game.","zh":"她从小就是道奇队球迷，所以每场道奇队比赛都会关注。"},{"en":"A Dodger hit a home run in the ninth inning.","zh":"一名道奇队球员在第九局打出本垒打。"}]}],"synonyms":["evader","shirker","avoider","cheat"],"phonetic":"/ˈdɑdʒɚ/","extraExplanation":["“dodger”来自动词 dodge（躲开、闪避），常用于固定搭配：tax dodger（逃税者）、fare dodger（逃票者）、work dodger（偷懒/躲工作的人）、draft dodger（逃避兵役的人）。语气通常不太正面。","英国文学里《雾都孤儿》（Oliver Twist）中的角色 “the Artful Dodger（机灵鬼道奇）” 很有名，使得 dodger 带有“狡黠、会躲会骗”的联想。","棒球队名 Los Angeles Dodgers 源自早年纽约街头电车很多，行人需要“dodge”电车；因此 Dodgers 大致有“善于躲避的人”的历史背景。"]}
{"word":"dodgeries","summary":{"en":"“Dodgeries” means dishonest tricks or shady practices.","zh":"“Dodgeries”指不正当的手段、欺骗性的花招或勾当。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"dishonest or tricky actions; shady schemes or practices (plural of “dodgery”).","zh":"欺骗或狡猾的行为；不正当的手段、花招（“dodgery”的复数）。"},"examples":[{"en":"The investigation uncovered years of financial dodgeries.","zh":"调查揭露了多年来的财务欺诈手段。"},{"en":"People were tired of the company’s dodgeries and wanted transparent rules.","zh":"人们厌倦了公司的那些小动作，想要透明的规则。"}]}],"synonyms":["tricks","shady dealings","schemes","fraud","misconduct","chicanery"],"phonetic":"/ˈdɑdʒəriz/","extraExplanation":["“dodgeries”来自“dodge”（躲闪、回避），加上名词后缀“-ery”，常用来表示某类行为或做法，因此“dodgery / dodgeries”带有“靠躲避规则、钻空子”的负面含义。","这个词比较偏英式/较正式或文学语境；日常更常见的说法有“tricks / shady dealings / misconduct / fraud”等。"]}
{"word":"dodgers","summary":{"en":"“Dodgers” most often refers to the Los Angeles Dodgers (an MLB baseball team). It can also mean the plural of “dodger”: people who avoid responsibility, or (BrE) advertising leaflets.","zh":"“Dodgers”最常指美国职棒球队“洛杉矶道奇队”。它也可以是“dodger”的复数：指逃避责任的人，或（英式）传单/宣传单。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(proper noun) A Major League Baseball (MLB) team based in Los Angeles, California: the Los Angeles Dodgers.","zh":"（专有名词）美国职业棒球大联盟（MLB）位于加州洛杉矶的球队：洛杉矶道奇队。"},"examples":[{"en":"My family watched the Dodgers game on TV last night.","zh":"我家昨晚在电视上看了道奇队的比赛。"},{"en":"He’s a huge Dodgers fan and wears their cap everywhere.","zh":"他是超级道奇队球迷，到处都戴着他们的帽子。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “dodger”: people who avoid something (like work, duty, or taxes) by escaping or making excuses.","zh":"“dodger”的复数：指通过躲避或找借口来逃避某事（如工作、责任或缴税）的人。"},"examples":[{"en":"The teacher warned that class dodgers would lose participation points.","zh":"老师警告逃课的人会被扣课堂参与分。"},{"en":"Tax dodgers may face serious penalties.","zh":"逃税者可能会面临严重处罚。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “dodger”: a printed advertisement sheet (a flyer/leaflet), especially in British English.","zh":"“dodger”的复数：传单、宣传单（尤用于英式英语）。"},"examples":[{"en":"Someone handed out dodgers outside the subway station.","zh":"有人在地铁站外发传单。"},{"en":"The café put dodgers on car windshields to advertise a sale.","zh":"那家咖啡馆把宣传单夹在车挡风玻璃上宣传促销。"}]}],"synonyms":["Los Angeles Dodgers","evaders","skivers","shirkers","leaflets","flyers"],"phonetic":"/ˈdɑdʒərz/","extraExplanation":["“Dodgers”最常见的指代是MLB球队“Los Angeles Dodgers（洛杉矶道奇队）”。队名源于早期在纽约布鲁克林时期的绰号，和当时街头电车较多、人们需要“躲电车（dodge trolleys）”有关。球队后来迁到洛杉矶，但仍保留这一名称。"]}
{"word":"dodgery","summary":{"en":"Dodgery means dishonest trickery or shady behavior, especially used to avoid rules or responsibility.","zh":"Dodgery 指不诚实的耍花招或暗箱操作，尤其是为了逃避规则或责任。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"dishonest or tricky behavior used to avoid rules, duties, or blame; cheating or deception","zh":"用来逃避规则、责任或追责的不诚实/耍花招行为；欺骗；舞弊"},"examples":[{"en":"The investigation found evidence of accounting dodgery.","zh":"调查发现了做账造假的证据。"},{"en":"People were angry about the dodgery behind the contract.","zh":"人们对合同背后的暗箱操作感到愤怒。"},{"en":"No amount of legal dodgery can hide the truth forever.","zh":"再多的法律钻空子也无法永远掩盖真相。"}]}],"synonyms":["trickery","deception","fraud","shadiness","underhandedness"],"phonetic":"/ˈdɑːdʒəri/","extraExplanation":["“dodgery”多见于英式英语，语气偏口语/新闻评论，常用于批评“耍花招、钻空子、暗箱操作”。","词根与动词“dodge”（躲闪、躲避）有关，隐含“通过躲避责任或规则来达到目的”的意味。"]}
{"word":"dodges","summary":{"en":"“Dodges” usually means “avoids/evades” (he/she/it dodges), and it can also be the plural noun meaning “evasive tricks.”","zh":"“dodges”通常指“（他/她/它）躲避、回避”，也可作名词复数，表示“躲闪的花招/迂回手段”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"(verb, third-person singular of “dodge”) to avoid something (a hit, a question, a duty) by moving quickly or by using an excuse; to evade.","zh":"（动词，dodge 的第三人称单数）通过迅速闪开或找借口来躲避、回避（打击、问题、责任等）；逃避。"},"examples":[{"en":"He dodges the reporter’s questions by changing the topic.","zh":"他通过转移话题来回避记者的问题。"},{"en":"She dodges the ball and keeps running.","zh":"她闪开球，继续跑。"},{"en":"The company dodges responsibility for the mistake.","zh":"这家公司逃避对该错误的责任。"}]},{"partOfSpeech":"n.","definition":{"en":"(noun, plural of “dodge”) clever tricks or evasive actions used to avoid trouble or responsibility.","zh":"（名词，dodge 的复数）为躲避麻烦或责任而用的花招、迂回手段。"},"examples":[{"en":"Everyone saw through his dodges and asked for a clear answer.","zh":"大家都看穿了他的花招，要求他给出明确答复。"},{"en":"No more dodges—just tell me the truth.","zh":"别再耍花招了——直接告诉我真相。"}]}],"synonyms":["evades","avoids","sidesteps","ducks","eludes","skirts"],"phonetic":"/dɑdʒɪz/","extraExplanation":["“dodge”常见两种核心感觉：①身体动作上的“闪躲”（dodges the punch/ball）；②谈话或责任上的“回避/逃避”（dodges the question/blame）。英语里这两种用法都很常见。"]}
{"word":"Dodgeville","summary":{"en":"Dodgeville is a city in southwestern Wisconsin, USA.","zh":"Dodgeville（道奇维尔）是美国威斯康星州西南部的一座城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A city in Iowa County, in southwestern Wisconsin, USA.","zh":"美国威斯康星州西南部（艾奥瓦县）的一座城市：道奇维尔。"},"examples":[{"en":"Dodgeville is about an hour west of Madison, Wisconsin.","zh":"道奇维尔位于威斯康星州麦迪逊以西大约一小时车程。"},{"en":"We stopped in Dodgeville on our way to the Driftless Area.","zh":"我们在去无冰川区（Driftless Area）的路上在道奇维尔停了一下。"}]}],"phonetic":"/ˈdɑdʒvɪl/","extraExplanation":["“Dodgeville”是专有名词，通常不翻译；在中文语境里多用音译“道奇维尔”。","这座城市历史上与19世纪的铅矿开采有关，也常被视为前往威斯康星州西南部乡村与公园（如Governor Dodge State Park）的一处交通与服务中心。"]}
{"word":"dodgier","summary":{"en":"“Dodgier” means “more dodgy”: more suspicious or less reliable (informal).","zh":"“dodgier”是“dodgy”的比较级，表示更可疑或更不可靠（非正式）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Comparative form of “dodgy”: more suspicious, dishonest, or likely to cause problems (informal).","zh":"“dodgy”的比较级：更可疑的、不老实的，或更可能出问题的（非正式）。"},"examples":[{"en":"This website looks dodgier than the last one—don’t enter your card details.","zh":"这个网站看起来比上一个更可疑——别输入你的银行卡信息。"},{"en":"He started giving dodgier excuses when we asked about the missing money.","zh":"当我们问起丢失的钱时，他开始找更可疑的借口。"}]},{"partOfSpeech":"adj.","definition":{"en":"More unreliable or of poorer quality (informal).","zh":"更不靠谱的；质量更差的（非正式）。"},"examples":[{"en":"My phone signal gets dodgier in the subway.","zh":"我在地铁里的手机信号更不稳定。"},{"en":"The second-hand car seemed dodgier after a week of driving.","zh":"这辆二手车开了一周后看起来更不靠谱了。"}]}],"synonyms":["sketchier","shadier","more suspicious","less reliable"],"phonetic":"/ˈdɑdʒiɚ/","extraExplanation":["“Dodgy / dodgier”在英式英语里非常常见，语气偏口语，常用来形容“看起来不太对劲、可能有猫腻”的人/事/地方/交易。美式英语里也能听到，但更常用的替代说法有：sketchy, shady, suspicious。","拼写提示：比较级一般是 dodgy → dodgier（y 变 i + er）。最高级是 dodgiest。"]}
{"word":"dodgiest","summary":{"en":"“Dodgiest” means the most suspicious, unsafe, or unreliable (informal).","zh":"“dodgiest”意为“最可疑/最不安全/最不可靠的”（非正式用语）。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Most suspicious or possibly dishonest; seeming risky or untrustworthy.","zh":"最可疑的；可能不诚实的；让人觉得有风险或不可信的。"},"examples":[{"en":"That’s the dodgiest email I’ve ever seen—don’t click the link.","zh":"那是我见过最可疑的邮件——别点那个链接。"},{"en":"He made the dodgiest deal in the parking lot and then disappeared.","zh":"他在停车场做了最可疑的一笔交易，然后就消失了。"}]},{"partOfSpeech":"adj.","definition":{"en":"Most unsafe or likely to cause trouble (about a place, situation, or plan).","zh":"最不安全的；最可能惹麻烦的（多指地点、情况或计划）。"},"examples":[{"en":"This is the dodgiest part of town at night, so let’s take a taxi.","zh":"晚上这里是城里最不安全的地段，所以我们坐出租车吧。"},{"en":"Using that old ladder is the dodgiest idea—please don’t.","zh":"用那把旧梯子是最危险的主意——千万别。"}]},{"partOfSpeech":"adj.","definition":{"en":"Most unreliable or poor in quality; likely to break or not work well.","zh":"最不可靠的；质量最差的；很可能坏掉或不好用的。"},"examples":[{"en":"My phone has the dodgiest battery—it dies in an hour.","zh":"我手机电池最不行——一小时就没电。"},{"en":"We stayed in the dodgiest hotel, and the shower barely worked.","zh":"我们住了最差劲的酒店，淋浴几乎不能用。"}]}],"synonyms":["sketchiest","shadiest","fishiest","most suspicious","most unreliable","most unsafe"],"phonetic":"ˈdɑdʒiəst","extraExplanation":["“dodgiest”是形容词“dodgy”的最高级形式（dodgy → dodgier → dodgiest），语气偏口语、非正式，英式英语里尤其常见。美式英语里更常用的近义表达是“sketchiest / shadiest”。","它既可以指“人/行为很可疑”（可能不诚实），也可以指“地方/状况不安全”或“东西质量差、不可靠”。要根据上下文判断是哪一种。"]}
{"word":"dodgily","summary":{"en":"“Dodgily” means “in a suspicious or dishonest way.”","zh":"“dodgily”表示“以可疑或不诚实的方式”。"},"definitions":[{"partOfSpeech":"adv.","definition":{"en":"In a suspicious or dishonest way; in a way that seems not legal, safe, or trustworthy.","zh":"以可疑或不诚实的方式；以看起来不合法、不安全或不可靠的方式。"},"examples":[{"en":"He was acting dodgily, so I didn’t trust his story.","zh":"他的行为很可疑，所以我不相信他的说法。"},{"en":"The contract was written dodgily, with important details missing.","zh":"这份合同写得很不靠谱，缺了很多重要细节。"},{"en":"They bought the phone dodgily, without any receipt.","zh":"他们买那部手机的方式很可疑，连收据都没有。"}]}],"synonyms":["suspiciously","shadily","sketchily","dishonestly"],"phonetic":"/ˈdɑːdʒɪli/","extraExplanation":["“dodgily”来自形容词“dodgy”（英式口语更常用），表示“可疑的、不可靠的”。在美式英语里，人们更常说“in a suspicious way / in a shady way / kind of sketchy”，而“dodgily”本身相对少见。","语气与场景：常用于非正式语境，带有“让人起疑、可能有猫腻”的判断；可以形容人的行为、交易方式、文件条款等。","相关词：dodgy（adj. 可疑的/不稳妥的），shady（adj. 不光彩的），sketchy（adj. 可疑的/粗略的），fishy（adj. 可疑的）。"]}
{"word":"dodginess","summary":{"en":"Dodginess means the quality of being suspicious/dishonest or unreliable/unsafe.","zh":"Dodginess 指“可疑/不诚实”或“不可靠/不安全”的特质。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the quality of being dishonest, suspicious, or likely to involve cheating or illegal activity; shadiness","zh":"不诚实、可疑或可能涉及欺骗/违法的特质；“不靠谱/很黑”的感觉"},"examples":[{"en":"The contract had a lot of dodginess, so we asked a lawyer to review it.","zh":"这份合同很可疑，所以我们请律师复核。"},{"en":"I felt some dodginess around the deal and decided to walk away.","zh":"我觉得这笔交易不太对劲，就决定不做了。"}]},{"partOfSpeech":"n.","definition":{"en":"the quality of being unreliable, unsafe, or not working well","zh":"不可靠、不安全或运作不佳的特质；“不稳/不安全”的状态"},"examples":[{"en":"The elevator’s dodginess made everyone take the stairs instead.","zh":"电梯看起来不太安全，大家都改走楼梯了。"},{"en":"There was some dodginess in the data, so the results weren’t trusted.","zh":"数据里有些不可靠的地方，所以结果不被信任。"}]}],"synonyms":["shadiness","sketchiness","suspiciousness","unreliability","seediness"],"phonetic":"/ˈdɑdʒinəs/","extraExplanation":["“dodginess”来自口语形容词“dodgy”（可疑的/不靠谱的）+ 名词后缀“-ness”。在英式英语里很常见；美式英语也能理解，但更常用的近义表达包括“shadiness / sketchiness / unreliability”。","语气通常偏口语，带有主观判断：说某事有“dodginess”往往表示“我觉得不对劲，所以不信/不做”。"]}
{"word":"dodging","summary":{"en":"“Dodging” means avoiding something—by quick movement or by evading questions or responsibility.","zh":"“dodging”表示“躲闪/躲开”，也可指“回避问题或推卸责任”。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"avoiding something by moving quickly to the side, or by taking action to escape it (present participle of “dodge”).","zh":"（dodge 的现在分词）躲闪；躲开；用动作或手段避开某事。"},"examples":[{"en":"She kept dodging the ball during practice.","zh":"练习时她一直在躲闪球。"},{"en":"He’s been dodging my questions all week.","zh":"他一整周都在回避我的问题。"}]},{"partOfSpeech":"n.","definition":{"en":"the act or habit of avoiding something, especially responsibility, blame, or direct answers.","zh":"（尤指）推脱、回避（责任、指责或直接回答）的行为或习惯。"},"examples":[{"en":"The manager was tired of the constant dodging and wanted a clear plan.","zh":"经理厌倦了不断的推脱，只想要一个明确的方案。"},{"en":"There was no dodging the fact that the project was late.","zh":"项目延期这个事实无法回避。"}]},{"partOfSpeech":"adj.","definition":{"en":"evasive; trying to avoid giving a clear answer or taking responsibility.","zh":"闪烁其词的；回避的；不愿明确表态或担责的。"},"examples":[{"en":"His dodging replies made people suspicious.","zh":"他闪烁其词的回答让人起疑。"},{"en":"Stop with the dodging behavior and tell me the truth.","zh":"别再回避了，告诉我真相。"}]}],"synonyms":["avoiding","evading","sidestepping","ducking","skirting"],"phonetic":"/ˈdɑdʒɪŋ/","extraExplanation":["“dodge”既可指身体上的“躲闪”（如躲球、躲拳），也常用于口语中指“回避问题/责任”。因此“dodging questions”通常不是真的躲开问题，而是用含糊、转移话题等方式不正面回答。","常见搭配：dodge a ball/punch（躲球/躲拳），dodge a question（回避问题），dodge responsibility（推卸责任），tax dodging（逃税，语气较负面）。"]}
{"word":"Dodgson","summary":{"en":"Dodgson is a British surname, best known as Lewis Carroll’s real last name.","zh":"Dodgson 是一个英国姓氏，最知名的用法是指刘易斯·卡罗尔的真实姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A British surname; most famously the real last name of the writer Lewis Carroll (Charles Lutwidge Dodgson).","zh":"一个英国姓氏；最著名的是作家刘易斯·卡罗尔（本名 Charles Lutwidge Dodgson）的真实姓氏。"},"examples":[{"en":"Lewis Carroll’s real name was Charles Lutwidge Dodgson.","zh":"刘易斯·卡罗尔的真实姓名是查尔斯·路特维奇·道奇森（Charles Lutwidge Dodgson）。"},{"en":"In some biographies, Dodgson is used when talking about the author’s private life, and “Lewis Carroll” when discussing his books.","zh":"在一些传记中，谈到作者的私人生活会用“Dodgson”，而讨论他的作品时则用“Lewis Carroll”。"}]}],"synonyms":["Lewis Carroll (pen name)"],"phonetic":"ˈdɑdʒsən","extraExplanation":["“Dodgson”和笔名“Lewis Carroll”的区分有助于理解：许多学术或传记写作会用本名（Dodgson）指代他作为数学家、摄影师、牛津教职员等身份的生活面，而用笔名指代《爱丽丝梦游仙境》等文学作品的作者身份。","文学关联：他最著名的作品是《Alice’s Adventures in Wonderland》（1865）与《Through the Looking-Glass》（1871）。"]}
{"word":"dodgy","summary":{"en":"Dodgy means suspicious or unreliable; it can also mean risky/unsafe, evasive, or not working well (often about health or a body part).","zh":"Dodgy 指“可疑、不可靠”；也可指“有风险/不安全”“闪烁其词”或“状况不佳（常指身体或部位）”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"(informal) Dishonest, suspicious, or not reliable; not to be trusted.","zh":"（非正式）不老实的；可疑的；不可靠的，不值得信任的。"},"examples":[{"en":"That website looks dodgy—don’t enter your credit card details.","zh":"那个网站看起来很可疑——别输入你的信用卡信息。"},{"en":"He was selling “new” phones really cheaply, but the whole deal felt dodgy.","zh":"他在很便宜地卖“新”手机，但整笔交易让人觉得不靠谱。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) Risky or unsafe; likely to cause problems.","zh":"（非正式）有风险的；不安全的；容易出问题的。"},"examples":[{"en":"It’s a dodgy neighborhood at night, so take a taxi.","zh":"那一带晚上不太安全，所以坐出租车吧。"},{"en":"The ladder is dodgy—be careful climbing it.","zh":"这梯子不太牢靠——爬的时候小心点。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) Evasive or unclear; avoiding a direct answer.","zh":"（非正式）闪烁其词的；含糊其辞的；回避正面回答的。"},"examples":[{"en":"When I asked where the money went, he gave a dodgy answer.","zh":"我问钱去哪儿了，他给了个含糊的回答。"}]},{"partOfSpeech":"adj.","definition":{"en":"(informal) Not working well; weak or in poor condition (often about health or a body part).","zh":"（非正式）状况不佳的；不好使的；（常指身体/健康）不太好的。"},"examples":[{"en":"My knee has been dodgy since that old injury.","zh":"自从那次旧伤以后，我的膝盖一直不太好。"},{"en":"The car’s engine is a bit dodgy, so I don’t drive it far.","zh":"这车的发动机有点不给力，所以我不敢开太远。"}]}],"synonyms":["sketchy","shady","suspicious","unreliable","fishy","unsafe","evasive"],"phonetic":"ˈdɑːdʒi","extraExplanation":["“dodgy”常见于英式英语、澳大利亚英语等口语里，美式英语也能听懂，但更常用的近义表达有：“sketchy / shady / suspicious / unreliable”。","语气通常偏负面，表示“让人不放心、可能有猫腻”。在英美影视或犯罪小说里，经常用来形容“来路不明的交易、可疑的人或地方”。"]}
{"word":"Dodi","summary":{"en":"Dodi is usually a person’s name or nickname; in some contexts it specifically refers to Dodi Fayed.","zh":"Dodi 通常是人名或昵称；在某些语境中也特指多迪·法耶兹（Dodi Fayed）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"a male given name or nickname (often a short form of names like Doron or other local forms, depending on the language and culture).","zh":"男性名字或昵称（常见于不同语言与文化中，可能是某些名字的简称，如 Doron 等，具体取决于地区与背景）。"},"examples":[{"en":"Dodi is my cousin’s nickname at home.","zh":"Dodi 是我表哥在家里的昵称。"},{"en":"I met someone named Dodi at the conference.","zh":"我在会议上认识了一个叫 Dodi 的人。"}]},{"partOfSpeech":"other","definition":{"en":"Dodi (often referring to Dodi Fayed), an Egyptian film producer who became widely known in the UK for his relationship with Diana, Princess of Wales.","zh":"Dodi（常指 Dodi Fayed），埃及电影制片人；在英国因与威尔士王妃戴安娜（Diana）的恋情而广为人知。"},"examples":[{"en":"The documentary mentioned Dodi Fayed and Princess Diana.","zh":"那部纪录片提到了多迪·法耶兹和戴安娜王妃。"},{"en":"Some news articles refer to him simply as Dodi.","zh":"一些新闻文章会直接称他为 Dodi。"}]}],"synonyms":["nickname","given name","proper name"],"phonetic":"/ˈdoʊdi/","extraExplanation":["“Dodi”在英语里通常被当作专有名词（人名）使用，因此不像普通词汇那样有固定、统一的词义；理解时主要依赖语境（是在说某个人，还是在提到历史人物 Dodi Fayed）。","在西方媒体语境中，单独写“Dodi”时，有时默认指 Dodi Fayed；写作更正式时常用全名以避免歧义。"]}
{"word":"Dodie","summary":{"en":"Dodie is usually a female given name or nickname (often for Dorothy), and it can also refer to the singer-songwriter Dodie (Dodie Clark).","zh":"Dodie 通常是女性名字或昵称（常见为 Dorothy 的简称），也可指创作歌手 Dodie（Dodie Clark）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a given name or nickname (usually for a girl or woman), often used as a short, friendly form of names like Dorothy.","zh":"女性名字或昵称，常作为 Dorothy 等名字的亲昵称呼或简称。"},"examples":[{"en":"Dodie is short for Dorothy in some families.","zh":"在一些家庭里，Dodie 是 Dorothy 的简称。"},{"en":"Dodie introduced herself with a smile and shook my hand.","zh":"Dodie 微笑着自我介绍，并和我握手。"}]},{"partOfSpeech":"n.","definition":{"en":"(often capitalized) a person’s name; for example, “Dodie” can refer to the British singer-songwriter Dodie Clark (stage name: Dodie).","zh":"（常大写）作为人名使用；例如 “Dodie” 也可指英国创作歌手 Dodie Clark（艺名：Dodie）。"},"examples":[{"en":"I’ve been listening to Dodie’s songs while studying.","zh":"我学习时一直在听 Dodie 的歌。"},{"en":"Dodie released several popular indie-pop tracks online.","zh":"Dodie 在网上发布了多首受欢迎的独立流行歌曲。"}]}],"synonyms":["Dorothy (related full name)","nickname (general category)"],"phonetic":"/ˈdoʊdi/","extraExplanation":["“Dodie”在英语里更常见于口语和亲密场合（家人、朋友之间）的称呼，带有可爱、亲切的感觉。","它不是一个固定“必须对应”的全名：除了常见的 Dorothy，也可能只是独立取名或家族习惯用的昵称。读到文学作品或影视剧里时，多半只需要把它当作人物名字理解即可。"]}
{"word":"dodipole","summary":{"en":"A dipole is something with two opposite poles/charges, especially in physics, or a two-part antenna in electronics.","zh":"dipole 指“有两个相反的极/电荷的系统（偶极子）”，也可指电子学中的“两段式天线（偶极天线）”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(Physics) A system with two equal and opposite charges or magnetic poles separated by a small distance; also the object or field produced by such a pair.","zh":"（物理）偶极子：由相等且相反的电荷或磁极在很小距离内分离形成的系统；也可指由这对极产生的物体或场。"},"examples":[{"en":"A water molecule has an electric dipole because oxygen pulls electrons more strongly than hydrogen.","zh":"水分子有电偶极子，因为氧原子比氢原子更强地吸引电子。"},{"en":"In chemistry, dipole moments help predict how molecules interact.","zh":"在化学中，偶极矩有助于预测分子如何相互作用。"}]},{"partOfSpeech":"n.","definition":{"en":"(Electronics) An antenna made of two conductive elements aligned in a straight line (often called a dipole antenna).","zh":"（电子）偶极天线：由两段导体在一条直线上排列组成的天线（常称“dipole antenna”）。"},"examples":[{"en":"A simple dipole antenna can receive FM radio signals.","zh":"一个简单的偶极天线可以接收调频广播信号。"},{"en":"He built a dipole for his ham radio setup.","zh":"他为自己的业余无线电设备制作了一个偶极天线。"}]}],"synonyms":["dipole antenna (electronics)","two-pole system (general description)"],"phonetic":"ˈdaɪˌpoʊl","extraExplanation":["你输入的“dodipole”在英语里不常见，最可能是拼写误差，常见词是 dipole。","词源提示：di- 表示“两个”，-pole 表示“极”。所以 dipole 直观上就是“两极”的意思。","常见搭配：electric dipole（电偶极子）、magnetic dipole（磁偶极子）、dipole moment（偶极矩）、dipole antenna（偶极天线）。"]}
{"word":"dodkin","summary":{"en":"“Dodkin” is not a common English vocabulary word; it is usually a proper name (surname).","zh":"“Dodkin”不是常见英语词汇；通常是专有名词（姓氏）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A rare word in modern English; most often seen as a family name (surname) or place/name label rather than a common vocabulary word.","zh":"现代英语中很少见；最常见用法是作为姓氏或地名/名称标签，而不是常用词汇。"},"examples":[{"en":"I found “Dodkin” listed as a surname in old records.","zh":"我在旧档案里看到“Dodkin”被列为一个姓氏。"},{"en":"Ms. Dodkin will join the meeting tomorrow.","zh":"Dodkin 女士明天会参加会议。"}]}],"synonyms":["(as a surname) none"],"phonetic":"/ˈdɑːdkɪn/","extraExplanation":["“dodkin”并不是常见的标准英语单词，所以如果你是在阅读或听写中遇到它，很可能是：\n1）人名/姓氏（Dodkin）；\n2）拼写听错或打错。\n\n如果你能提供一句原文或语境（例如你在哪看到的、前后句是什么），我可以帮你判断它更可能是哪个词。常见的相近词包括：\n- docking（靠岸；对接；剪短尾巴）\n- bodkin（锥子/大别针；古义为匕首一类的小尖器）\n- Dodgson / Dodkin（可能的人名变体）"]}
{"word":"dodlet","summary":{"en":"“Dodlet” is not a standard English word; it’s likely a misspelling (often of “doodle”) or a name.","zh":"“dodlet” 不是标准英语词，通常是拼写错误（常见可能是 “doodle”）或人名/网名。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It is most likely a misspelling or a name/username; the intended word may be “doodle” or another similar-looking word.","zh":"不是标准英语单词。很可能是拼写错误，或是人名/网名；你可能想写的是 “doodle（涂鸦）” 或其他外形相近的词。"},"examples":[{"en":"I can’t find “dodlet” in a dictionary—did you mean “doodle”?","zh":"我在词典里查不到 “dodlet”——你是不是想写 “doodle（涂鸦）”？"},{"en":"If you tell me the sentence you saw it in, I can help identify the correct word.","zh":"如果你把它出现的句子发给我，我可以帮你判断正确的词。"}]}],"phonetic":"/ˈdɑdlət/","extraExplanation":["“dodlet” 这种形式很像拼写打错了（例如漏了字母、按键误触）。最有效的办法是：把你看到它的原句/上下文贴出来，或告诉我你想表达的中文意思（比如“涂鸦”“小水滴”“小鸭子”等），我就能更准确地给出正确单词与用法。"]}
{"word":"dodman","summary":{"en":"Dodman is a rare dialect word for “snail,” and it is also a surname.","zh":"Dodman 是一个较少见的方言词，意为“蜗牛”，也可作姓氏。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(dialect, chiefly Northern England) a snail.","zh":"（方言，主要见于英格兰北部）蜗牛。"},"examples":[{"en":"There are dodmen on the garden wall after the rain.","zh":"雨后花园的墙上有蜗牛。"},{"en":"As a child, he used to collect dodmen in a jar.","zh":"他小时候常把蜗牛捡起来装进罐子里。"}]},{"partOfSpeech":"n.","definition":{"en":"a family name (surname): Dodman.","zh":"姓氏：Dodman（多德曼）。"},"examples":[{"en":"Dr. Dodman published a study on animal behavior.","zh":"Dodman 医生发表了一项关于动物行为的研究。"}]}],"synonyms":["snail"],"phonetic":"/ˈdɑdmən/","extraExplanation":["“dodman”不是现代标准英语里的常用词，更常见于英国乡村/地区性用法；在日常英语里通常直接说“snail”。","作为姓氏时首字母大写（Dodman），读音通常与普通名词相同。"]}
{"word":"dodo","summary":{"en":"A dodo is an extinct, flightless bird; informally it can also mean a foolish person.","zh":"dodo 指已灭绝的不会飞的渡渡鸟；口语中也可指“笨蛋、傻瓜”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"A large, flightless bird that lived on Mauritius and became extinct in the late 1600s; it is often used as a symbol of extinction.","zh":"渡渡鸟：一种曾生活在毛里求斯的大型不会飞的鸟，已于17世纪后期灭绝；常被用作“灭绝”的象征。"},"examples":[{"en":"The dodo became extinct after humans arrived on the island.","zh":"人类来到岛上后，渡渡鸟就灭绝了。"},{"en":"The dodo is often mentioned in books to remind people about protecting wildlife.","zh":"书里常提到渡渡鸟，用来提醒人们保护野生动物。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) A stupid or foolish person.","zh":"（非正式）笨蛋；傻瓜。"},"examples":[{"en":"I felt like a dodo for forgetting my keys again.","zh":"我又忘带钥匙，感觉自己像个笨蛋。"},{"en":"Don’t be a dodo—check the instructions first.","zh":"别犯傻——先看看说明书。"}]}],"synonyms":["(bird)","(informal) fool","idiot","dummy"],"phonetic":"/ˈdoʊdoʊ/","extraExplanation":["“dodo”这个词最早来自葡萄牙语或荷兰语的说法，可能与“傻、笨拙”有关，因此后来也发展出“笨蛋”的口语用法。","在英语文化里，dodo 常与短语“as dead as a dodo（彻底消失/绝迹）”相关联。","文学中最著名的出场之一是《爱丽丝梦游仙境》（Alice’s Adventures in Wonderland），书里有一个名叫 Dodo 的角色。"]}
{"word":"dodoes","summary":{"en":"“Does” is the third-person singular form of “do,” and it can also mean female deer (plural of “doe”).","zh":"“does”是“do”的第三人称单数形式；也可指“母鹿”（doe）的复数。"},"definitions":[{"partOfSpeech":"v.","definition":{"en":"Third-person singular present form of “do,” used as a main verb or as an auxiliary to form questions and negatives.","zh":"“do”的第三人称单数现在时形式，可作实义动词，也常作助动词用于疑问句和否定句。"},"examples":[{"en":"She does her homework every night.","zh":"她每晚都做作业。"},{"en":"Does he like coffee?","zh":"他喜欢咖啡吗？"},{"en":"He doesn’t know the answer.","zh":"他不知道答案。"}]},{"partOfSpeech":"n.","definition":{"en":"Plural of “doe” (a female deer).","zh":"“doe”（母鹿）的复数。"},"examples":[{"en":"In the evening, the does came out to feed.","zh":"傍晚时，母鹿出来觅食。"},{"en":"The park has several bucks and does.","zh":"这个公园里有几只公鹿和母鹿。"}]}],"synonyms":["performs","completes (context-dependent)"],"phonetic":"/dʌz/","extraExplanation":["“dodoes”一般不是标准英文单词，常见情况是拼写错误：你可能想写“does”，或是在输入“do/does”时不小心重复了“do”。","注意发音：动词/助动词“does”通常读 /dʌz/（类似“duhz”），不是 /duːz/。","助动词“does”用于一般现在时、主语是 he/she/it 或单数名词：Does she…? She doesn’t…；而 I/you/we/they 用“do”。"]}
{"word":"dodoism","summary":{"en":"Dodoism is a rare, humorous noun meaning being obsolete or clinging to outdated ways—like the extinct dodo bird.","zh":"dodoism 是一个少见的幽默名词，指“像灭绝的渡渡鸟一样过时/被淘汰”，也可指固守陈旧做法的倾向。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(humorous, rare) The state or idea of being like a dodo—obsolete, out of date, or headed for extinction.","zh":"（幽默、少见）“渡渡鸟式”的状态或观念——指过时、被淘汰，或走向消亡。"},"examples":[{"en":"Some people call printed phone books “dodoism” in the age of smartphones.","zh":"在智能手机时代，有人把纸质电话簿称为“dodoism”（过时的东西）。"},{"en":"If we don’t update our skills, we risk dodoism in a fast-changing job market.","zh":"如果不更新技能，在快速变化的就业市场里就可能陷入“dodoism”（被淘汰）。"}]},{"partOfSpeech":"n.","definition":{"en":"(humorous) A preference for clinging to old ways even when they no longer work well.","zh":"（幽默）即使旧方法不再好用，仍偏要固守旧做法的倾向。"},"examples":[{"en":"His refusal to learn the new system felt like pure dodoism.","zh":"他拒绝学习新系统，简直就是十足的“dodoism”（顽固守旧）。"}]}],"synonyms":["obsolescence","outdatedness","extinction (figurative)","being out of date"],"phonetic":"/ˈdoʊdoʊˌɪzəm/","extraExplanation":["“dodoism”来自 dodo（渡渡鸟）+ -ism（表示“主义/倾向/现象”的后缀）。渡渡鸟因在17世纪灭绝而在英语文化中常被当作“灭绝、落伍、被时代淘汰”的象征，因此这个词多用于讽刺或自嘲，并非正式学术术语。","文化联想：在《爱丽丝梦游仙境》中有“Dodo（渡渡鸟）”这个角色，但“dodoism”并不是书中固定用语；它更常见于现代口语或写作里，用来形容“像渡渡鸟一样过时/注定消失”的事物或态度。"]}
{"word":"dodoisms","summary":{"en":"Dodoisms are humorous odd habits/sayings, or (by extension) outdated ideas or practices.","zh":"Dodoisms 指带幽默感的古怪习惯/说法，也可引申为过时的观念或做法。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"odd or silly sayings, habits, or “rules” associated with someone (often used humorously).","zh":"（常带幽默）指某人古怪、滑稽的言论、习惯或“规矩”。"},"examples":[{"en":"His emails are full of little dodoisms—funny made-up words and odd expressions.","zh":"他的邮件里满是些“dodoisms”——搞笑的自造词和奇怪的说法。"},{"en":"The family still laughs about Grandpa’s dodoisms at the dinner table.","zh":"一家人到餐桌上还会笑起爷爷那些古怪又可爱的口头禅。"}]},{"partOfSpeech":"n.","definition":{"en":"old-fashioned or outdated ideas, practices, or beliefs (suggesting they should be “extinct,” like the dodo).","zh":"过时的观念、做法或信条（暗示像渡渡鸟一样“该绝迹”）。"},"examples":[{"en":"Some people consider strict dress codes at work to be dodoisms.","zh":"有些人认为职场严格的着装规定是过时的做法。"},{"en":"We should update these policies and drop the dodoisms.","zh":"我们该更新这些政策，把那些过时的东西去掉。"}]}],"synonyms":["quirks","oddities","eccentricities","old-fashioned notions","outdated practices","anachronisms"],"phonetic":"ˈdoʊdoʊˌɪzəmz","extraExplanation":["“dodoism(s)”不是特别常见的标准词，更像是带玩笑意味的造词或修辞用法：dodo（渡渡鸟，已灭绝）+ -ism（表示“主义/作风/习惯”的后缀）。因此它既可以指某人的“怪癖/口头禅”，也可以讽刺“过时该淘汰的做法”。","在阅读中如果看到复数 dodoisms，通常就是“许多怪癖/许多过时做法”的意思；是否带贬义要看上下文语气。"]}
{"word":"Dodoma","summary":{"en":"Dodoma is the capital city of Tanzania in central Tanzania.","zh":"Dodoma 是坦桑尼亚位于中部的首都城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"the capital city of Tanzania, located in the center of the country.","zh":"多多马（Dodoma）：坦桑尼亚的首都，位于该国中部。"},"examples":[{"en":"Dodoma is the capital of Tanzania.","zh":"多多马是坦桑尼亚的首都。"},{"en":"The government moved many official functions to Dodoma.","zh":"政府将许多官方职能迁到多多马。"},{"en":"Dodoma has a drier climate than coastal cities like Dar es Salaam.","zh":"与达累斯萨拉姆等沿海城市相比，多多马的气候更干燥。"}]}],"phonetic":"/doʊˈdoʊmə/","extraExplanation":["“Dodoma”是专有名词，通常不加冠词（不说 *the Dodoma*）。","坦桑尼亚历史上长期以达累斯萨拉姆（Dar es Salaam）为主要行政与经济中心；后来为了更居中、便于全国治理，逐步将首都职能转向多多马。","在新闻或正式文本中，你可能会看到“in Dodoma”表示“在（坦桑尼亚首都）多多马”。"]}
{"word":"dodoma","summary":{"en":"Dodoma is the official capital city of Tanzania.","zh":"多多马是坦桑尼亚的官方首都城市。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Dodoma: the official capital city of Tanzania, located in the central part of the country.","zh":"多多马：坦桑尼亚的官方首都，位于该国中部。"},"examples":[{"en":"Dodoma is the official capital of Tanzania.","zh":"多多马是坦桑尼亚的官方首都。"},{"en":"Many government offices are in Dodoma, while Dar es Salaam remains a major business center.","zh":"许多政府机构设在多多马，但达累斯萨拉姆仍是重要的商业中心。"}]}],"synonyms":["Tanzania’s capital (Dodoma)"],"phonetic":"/doʊˈdoʊmə/","extraExplanation":["“Dodoma”是地名（专有名词）。坦桑尼亚在1970年代决定把首都从沿海的达累斯萨拉姆迁至更居中的多多马，以促进内陆发展；不过在现实生活中，很多商业与港口活动仍集中在达累斯萨拉姆。"]}
{"word":"Dodona","summary":{"en":"Dodona is an ancient Greek oracle site in Epirus, sacred to Zeus.","zh":"Dodona（多多那）是古希腊伊庇鲁斯地区著名的神谕圣地，奉宙斯为主神。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient Greek sanctuary in Epirus famous for one of Greece’s oldest oracles, where people sought messages from Zeus (often interpreted from sacred oak trees).","zh":"多多那：古希腊伊庇鲁斯地区的一处著名圣地，以最古老的神谕之一闻名；人们在此向宙斯求问，神谕常被说是通过圣橡树等方式解读。"},"examples":[{"en":"In Greek mythology, pilgrims traveled to Dodona to ask Zeus for guidance.","zh":"在希腊神话中，朝圣者会前往多多那向宙斯求取指引。"},{"en":"The historian mentioned Dodona alongside Delphi as a major center of prophecy.","zh":"这位历史学家把多多那与德尔斐并列，称它们是重要的神谕中心。"}]}],"synonyms":["the Oracle of Dodona"],"phonetic":"/doʊˈdoʊnə/","extraExplanation":["“Dodona”常见于文学或历史写作中，用来营造古典、神秘的气氛。英语里也常写作“the Oracle of Dodona（多多那神谕）”。","与德尔斐（Delphi）不同，多多那的神谕传统常被描述为与“圣橡树”有关：风吹树叶的声音、悬挂的器物声等被解读为神意（不同作者说法略有差异）。"]}
{"word":"dodona","summary":{"en":"Dodona is an ancient Greek oracle site, associated especially with Zeus.","zh":"Dodona是古希腊的神谕圣地，尤其与宙斯相关。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"An ancient Greek sanctuary and oracle in Epirus (northwestern Greece), famous for divination connected with Zeus (and later Dione).","zh":"多多那（Dodona）：古希腊伊庇鲁斯地区（希腊西北部）的圣地与神谕中心，以与宙斯（后来也与狄俄涅）相关的占卜闻名。"},"examples":[{"en":"In Greek mythology classes, Dodona is often introduced as one of the oldest oracles in Greece.","zh":"在希腊神话课上，多多那常被介绍为希腊最古老的神谕之一。"},{"en":"The traveler visited Dodona to learn how people once sought guidance from the gods.","zh":"那位旅行者参观多多那，了解古人如何向诸神寻求指引。"}]}],"synonyms":["the Oracle of Dodona","Dodonaean oracle"],"phonetic":"/doʊˈdoʊnə/","extraExplanation":["“Dodona”在英语里多作为专有名词使用，通常无需加冠词；但在讲“神谕/圣地”时也会说the oracle/sanctuary of Dodona。","多多那的占卜传统常与“神圣的橡树”联系在一起：古人会解读树叶的沙沙声、青铜器的回响等作为神意的 संकेत。","在文学与文化语境中，Dodona常被用来象征“古老的预言之地”或“向神明求问的传统”，有时会与更著名的Delphi（德尔斐）并列比较。"]}
{"word":"Dodona-related","summary":{"en":"“Dodona-related” means connected with Dodona (a famous ancient Greek oracle site), and sometimes figuratively means “oracular/cryptic.”","zh":"“Dodona-related”表示“与多多那（古希腊著名神谕圣地）有关的”，也可引申为“神谕般、隐晦难解的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"connected with Dodona, an ancient Greek religious site famous for the Oracle of Zeus (e.g., its oracle, priests, rituals, or myths).","zh":"与多多那（Dodona，古希腊著名的宙斯神谕圣地）有关的（如其神谕、祭司、仪式或神话）。"},"examples":[{"en":"The museum displays Dodona-related inscriptions dedicated to Zeus.","zh":"博物馆展出了献给宙斯的多多那相关铭文。"},{"en":"Her paper examines Dodona-related rituals of listening to the sacred oak.","zh":"她的论文研究了与聆听神圣橡树有关的多多那相关仪式。"}]},{"partOfSpeech":"adj.","definition":{"en":"about or similar to the style of speech associated with oracles—mysterious, indirect, or hard to interpret (used figuratively, less common).","zh":"（引申，较少见）指类似神谕式的表达：神秘、含糊、难以解读。"},"examples":[{"en":"His Dodona-related answer was so vague that no one knew what he meant.","zh":"他那种“神谕式”的回答太含糊了，大家都不知道他到底在说什么。"},{"en":"The novel uses Dodona-related hints instead of clear explanations.","zh":"这部小说用的是神谕式的暗示，而不是清楚的解释。"}]}],"synonyms":["Dodonan (rare)","of Dodona","oracular (figurative)","cryptic (figurative)"],"phonetic":"/doʊˈdoʊnə rɪˌleɪtɪd/","extraExplanation":["“Dodona（多多那）”位于古希腊伊庇鲁斯（Epirus）地区，是最古老的神谕中心之一，主要崇拜宙斯（Zeus）。传统说法中，人们通过聆听神圣橡树的树叶声、或青铜器碰撞声来“解读”神意，因此它常被用来联想到含蓄、难解的神谕式表达。","写作中更常见的形式是“Dodona-related”（连字符形容词）或直接用“of Dodona / at Dodona”。作为引申义时，也可用“oracular（神谕般的）”“cryptic（隐晦的）”更直观。"]}
{"word":"Dodonaea","summary":{"en":"Dodonaea is a botanical genus of shrubs/trees commonly called hopbush.","zh":"Dodonaea 指车桑子属，一类常被称为 hopbush 的灌木或小乔木属名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of shrubs or small trees (in the soapberry family) commonly called hopbush; some species are used in landscaping and traditional medicine.","zh":"（植物）车桑子属：无患子科的一属灌木或小乔木，英文常称 hopbush（霍布什/假啤酒花灌木）；部分种类用于园林绿化及传统用药。"},"examples":[{"en":"Dodonaea viscosa (hopbush) is often planted as a hardy hedge in dry climates.","zh":"车桑子属的黏车桑子（Dodonaea viscosa，hopbush）常被用于干旱气候中的耐旱绿篱。"},{"en":"In some regions, Dodonaea shrubs are valued because they tolerate wind, salt, and poor soil.","zh":"在一些地区，车桑子属灌木因耐风、耐盐、耐瘠薄土壤而受到重视。"}]}],"synonyms":["hopbush"],"phonetic":"/ˌdoʊdəˈniːə/","extraExplanation":["“Dodonaea”是拉丁化的属名，来源于16世纪佛兰德斯植物学家 Rembert Dodoens（拉丁名 Dodonaeus）的姓氏，用来纪念他的植物学贡献。","常见种 Dodonaea viscosa 的英文俗名 hopbush 与“hop（啤酒花）”有关：它的纸质翅果/蒴果外形让人联想到啤酒花球果，但它并不是啤酒花。"]}
{"word":"dodonaea","summary":{"en":"*Dodonaea* is a plant genus (often called hopbush), referring to shrubs or small trees in warm climates.","zh":"*Dodonaea* 是一种植物属名（常称 hopbush），指生长在温暖地区的灌木或小乔木。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of shrubs or small trees in the soapberry family, common in warm regions; many species are called hopbush (especially *Dodonaea viscosa*).","zh":"一种无患子科的灌木或小乔木属，多见于温暖地区；其中许多种常被称为“hopbush（啤酒花灌木）”，尤其是 *Dodonaea viscosa*。"},"examples":[{"en":"In dry coastal areas, *Dodonaea* is often planted as a hardy windbreak.","zh":"在干燥的海岸地区，*Dodonaea* 常被种作耐风的防风林。"},{"en":"The garden label read “*Dodonaea viscosa* (hopbush).”","zh":"花园的标签写着“*Dodonaea viscosa*（hopbush，啤酒花灌木）”。"}]}],"synonyms":["hopbush","hop bush"],"phonetic":"/ˌdoʊdəˈniːə/","extraExplanation":["这是一个植物学属名，常以斜体书写并首字母大写（*Dodonaea*）。在日常英语里更常见的是通用名 hopbush/hop bush（多指 *Dodonaea viscosa*）。","属名 *Dodonaea* 源自16世纪佛兰德斯植物学家 Rembert Dodoens（也写作 Dodonaeus）的姓氏，是植物命名中常见的“以人物命名”方式。"]}
{"word":"Dodonaeaceae","summary":{"en":"Dodonaeaceae is an older/alternative plant family name for the group containing Dodonaea, now commonly included in Sapindaceae.","zh":"Dodonaeaceae 是包含 Dodonaea 的一个旧/替代植物科名，现代多并入无患子科（Sapindaceae）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant family name (an older or alternative classification) referring to the group that includes the genus Dodonaea (hopbush); in many modern systems these plants are treated as part of the soapberry family (Sapindaceae).","zh":"（植物）无患子科的一个旧称或替代分类名，指包含“车桑子属/多多奈亚属（Dodonaea，hopbush）”等的类群；在许多现代分类系统中通常并入无患子科（Sapindaceae）。"},"examples":[{"en":"In older botanical references, Dodonaea may be placed in the family Dodonaeaceae.","zh":"在较早的植物学资料中，车桑子属（Dodonaea）可能被归入 Dodonaeaceae 科。"},{"en":"Many modern textbooks now treat Dodonaeaceae as part of Sapindaceae.","zh":"许多现代教材如今把 Dodonaeaceae 视为无患子科（Sapindaceae）的一部分。"}]}],"synonyms":["Sapindaceae (in modern classification)"],"phonetic":"/ˌdoʊ.doʊˌneɪˈeɪ.si.iː/","extraExplanation":["这是一个较少见、偏“旧分类”的科名：你在近年的英文植物志或数据库里更常看到的是 **Sapindaceae（无患子科）**，而 Dodonaeaceae 往往被当作同物异名或已并入的分类。","词根来自属名 **Dodonaea**（hopbush，常见中文名“车桑子/三翅果”等因地区而异），属名据说与古希腊多多那（Dodona）神谕地相关（学术命名常借用古地名/典故）。"]}
{"word":"dodonaeaceae","summary":{"en":"Dodonaeaceae is a botanical family name (often treated today within Sapindaceae) that includes the genus Dodonaea (hopbush).","zh":"Dodonaeaceae 是一个植物科名（现代常并入无患子科 Sapindaceae），包含黄杨叶木属 Dodonaea（hopbush）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a plant family that includes the hopbush (genus Dodonaea); in many modern classifications these plants are treated as part of the soapberry family (Sapindaceae).","zh":"（植物）黄杨叶木科/车轴草科（Dodonaeaceae）：包含黄杨叶木属（Dodonaea，如 hopbush）的植物类群；在许多现代分类中常被并入无患子科（Sapindaceae）。"},"examples":[{"en":"Dodonaea viscosa (hopbush) was traditionally placed in the family Dodonaeaceae.","zh":"黄杨叶木（Dodonaea viscosa，hopbush）传统上被归入黄杨叶木科（Dodonaeaceae）。"},{"en":"Some textbooks list Dodonaeaceae, while newer sources treat it as a group within Sapindaceae.","zh":"一些教材会列出黄杨叶木科（Dodonaeaceae），而较新的资料常把它视为无患子科（Sapindaceae）中的一个类群。"}]}],"synonyms":["Dodonaea group (within Sapindaceae)","Sapindaceae (modern classification, broader)"],"phonetic":"/doʊˌdoʊniˈeɪsiˌi/","extraExplanation":["这是一个较少在日常英语中出现的拉丁化植物学名词，常见于分类学、植物志或园艺资料中。","词形来源：以黄杨叶木属名 Dodonaea 为基础，加上植物科名常用后缀 -aceae（表示“……科”）。","分类学会随研究更新而调整：在现代系统分类中，Dodonaeaceae 常被当作无患子科（Sapindaceae）的一部分来处理，因此不同资料可能出现两种写法。"]}
{"word":"Dodonaean","summary":{"en":"Dodonaean means “connected with Dodona, the ancient Greek oracle,” often used in literary contexts to suggest mysterious prophecy.","zh":"Dodonaean意为“与古希腊多多那神谕有关的”，常用于文学语境，带有神秘、预言式的意味。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"relating to Dodona (an ancient Greek sanctuary and famous oracle in Epirus), or to its way of giving prophecies","zh":"与多多那（古希腊伊庇鲁斯地区的圣地与著名神谕）有关的；具有多多那神谕风格的（常指含蓄、象征性预言）"},"examples":[{"en":"In Greek literature, a Dodonaean oracle often speaks through signs rather than clear answers.","zh":"在希腊文学中，多多那的神谕常通过征兆而不是明确答复来传达信息。"},{"en":"The poet describes a Dodonaean voice whispering through the leaves.","zh":"诗人描写一种“多多那式”的声音从树叶间低语。"}]}],"synonyms":["Dodonian","oracular","prophetic"],"phonetic":"/ˌdoʊdəˈniːən/","extraExplanation":["“Dodonaean”源自古希腊的Dodona（多多那）。那里供奉宙斯（Zeus），以神谕闻名：人们会通过聆听圣橡树叶沙沙声、铜器回响等方式解读“预言”。因此在英文里它常带有文学色彩，用来营造神秘、预兆式（而非直白）的气氛。","在文学与学术写作中，你也可能见到同义/近形词“Dodonian”（更常见），意思基本相同。"]}
{"word":"dodonaean","summary":{"en":"An adjective meaning “of or related to Dodona,” especially its famous ancient Greek oracle.","zh":"形容词：指“与多多那有关的”，尤指古希腊多多那著名的神谕。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Dodona, an ancient Greek sanctuary and oracle (especially the Oracle of Zeus at Dodona) famous for prophetic messages associated with an oak tree.","zh":"与多多那（Dodona，古希腊著名的宙斯圣地与神谕所）有关的；指多多那神谕的（尤指与神圣橡树相关的预言）。"},"examples":[{"en":"The poem uses a Dodonaean oak to suggest an ancient, mysterious source of prophecy.","zh":"这首诗用“多多那的橡树”来暗示一种古老而神秘的预言来源。"},{"en":"In her novel, the hero seeks a Dodonaean answer to his doubts.","zh":"在她的小说里，主人公想从“多多那神谕”中找到对自己疑虑的答案。"}]}],"synonyms":["Dodonian","oracular","prophetic"],"phonetic":"/ˌdoʊdəˈniːən/","extraExplanation":["“Dodonaean”来自“Dodona（多多那）”，位于古希腊伊庇鲁斯（Epirus）地区，是最古老、最有名的神谕中心之一。传说人们通过聆听神圣橡树叶子的沙沙声、或铜器碰撞的回响来解读宙斯的旨意。这个词在英语里多见于文学、历史或带古典气息的描写，用来营造“古老的神谕/预兆/预言”的氛围。"]}
{"word":"dodonaena","summary":{"en":"Dodonaea (often spelled this way, not “dodonaena”) is a plant genus known as hopbush.","zh":"Dodonaea（常见拼法；“dodonaena”多为误拼）是一个植物属，常称啤酒花灌木/假木。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a genus of shrubs and small trees (often called hopbush) found mainly in warm regions; some species are grown as ornamental plants or used for hedges.","zh":"假木属（常称“啤酒花灌木/假木”）的一类灌木或小乔木，主要分布在温暖地区；部分种类用于观赏或作绿篱。"},"examples":[{"en":"Dodonaea is commonly planted as a drought-tolerant hedge in dry climates.","zh":"假木常被种作耐旱绿篱，适合干燥气候。"},{"en":"Some coastal gardens use Dodonaea for windbreaks because it is hardy.","zh":"一些海边花园会用假木作防风林，因为它很耐环境。"}]}],"synonyms":["hopbush (common name)"],"phonetic":"/ˌdoʊdəˈniːə/","extraExplanation":["“Dodonaea”常被误拼为“dodonaena”。它来自希腊语地名“Dodona（多多那）”，多多那是古希腊著名神谕圣地；18世纪的植物学命名常借用古典地名/神话典故。","在园艺语境中，你可能更常看到通俗名“hopbush（啤酒花灌木）”。不同地区对同一植物的中文名也可能不同，若你指的是某个具体物种，可以提供完整学名（如 Dodonaea viscosa）以便更准确释义。"]}
{"word":"Dodonean","summary":{"en":"“Dodonean” means “connected with Dodona,” a famous ancient Greek oracle.","zh":"“Dodonean”指“与多多那有关的”，多多那是古希腊著名的神谕圣地。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Dodona, an ancient sanctuary and famous oracle of Zeus in Epirus (northwestern Greece).","zh":"与多多那（Dodona）有关的；指古希腊伊庇鲁斯地区著名的宙斯神谕圣地。"},"examples":[{"en":"The poem describes a Dodonean oak whose leaves whisper prophecies.","zh":"这首诗描写了一棵多多那的圣橡树，树叶低语着预言。"},{"en":"Scholars discuss Dodonean rituals in early Greek religion.","zh":"学者们讨论早期希腊宗教中的多多那仪式。"}]}],"synonyms":["Dodona-related","oracular (context-dependent)"],"phonetic":"/ˌdoʊdəˈniːən/","extraExplanation":["“Dodonean”来自地名 Dodona（多多那）。在古希腊传统里，多多那是最古老的神谕中心之一，人们认为神意会通过圣橡树的沙沙声、铜器的回响等方式被“听见”。因此在文学中，Dodonean 常带有“神谕的、预兆的、神秘而古老的”联想。","文学/典故提示：英语文学里偶尔会把“Dodonean oak（多多那的橡树）”当作象征意象，用来暗示预言、启示或古老权威。"]}
{"word":"dodonean","summary":{"en":"Dodonean means “of Dodona (an ancient Greek oracle)” and, in literature, “prophetic or oracular.”","zh":"Dodonean 指“与古希腊多多那神谕有关的”，文学上也可引申为“预言性的、神谕般的”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Dodona, an ancient sanctuary and oracle in Epirus (northwestern Greece), famous for divination.","zh":"与多多那（Dodona）有关的；多多那神谕/圣地的（古希腊伊庇鲁斯地区著名的占卜中心）。"},"examples":[{"en":"The poem mentions a Dodonean oracle that speaks through rustling leaves.","zh":"这首诗提到多多那的神谕，会通过树叶的沙沙声说话。"},{"en":"Scholars study Dodonean rituals to understand early Greek religion.","zh":"学者研究多多那的仪式，以理解早期希腊宗教。"}]},{"partOfSpeech":"adj.","definition":{"en":"(Figurative, literary) Prophetic or oracular; sounding like a mysterious prediction.","zh":"（比喻/文学用法）预言性的；带有神谕般神秘预告意味的。"},"examples":[{"en":"His Dodonean warnings made everyone uneasy, as if fate had already decided.","zh":"他那神谕般的警告让大家不安，仿佛命运早已注定。"},{"en":"The novel’s opening lines have a Dodonean tone—dark, cryptic, and foretelling trouble.","zh":"小说开头带有神谕般的语气——阴暗、晦涩，预示着麻烦将至。"}]}],"synonyms":["oracular","prophetic","Delphic"],"phonetic":"/dɑˈdoʊniən/","extraExplanation":["“Dodonean”源自古希腊的多多那（Dodona），被认为是最古老的希腊神谕中心之一，常与宙斯（Zeus）崇拜相关。传说人们会通过聆听圣橡树树叶的沙响、或观察祭器等方式来“解读”神意。因此在英文文学里，Dodonean 有时可引申为“像神谕一样含混而预示未来的”。"]}
{"word":"Dodonian","summary":{"en":"Dodonian means “of or relating to Dodona,” the ancient Greek oracle; rarely, it can mean a person from Dodona.","zh":"Dodonian 指“多多那的/与多多那有关的”（古希腊神谕圣地）；少见时也可指“多多那人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Dodona, an ancient Greek sanctuary and oracle (especially associated with Zeus) in Epirus.","zh":"与多多那（Dodona）有关的；多多那的（古希腊伊庇鲁斯地区的圣地与神谕中心，尤与宙斯相关）。"},"examples":[{"en":"The Dodonian oracle was considered one of the oldest in Greece.","zh":"多多那的神谕被认为是希腊最古老的神谕之一。"},{"en":"In some myths, priests interpreted Dodonian messages from the rustling of oak leaves.","zh":"在一些神话中，祭司会通过橡树叶的沙沙声来解读多多那的神谕信息。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Dodona (rare).","zh":"多多那人（较罕见的用法）。"},"examples":[{"en":"A Dodonian might have traveled to other Greek cities for trade or festivals.","zh":"多多那人可能会前往其他希腊城邦进行贸易或参加节庆活动。"}]}],"synonyms":["of Dodona","oracular (context-dependent)"],"phonetic":"/doʊˈdoʊniən/","extraExplanation":["“Dodonian”来自“Dodona”（多多那），位于古希腊西北部伊庇鲁斯地区，是著名的神谕圣地之一。传统上与宙斯（Zeus）和狄俄涅（Dione）有关。文献中常提到通过“神圣橡树”的树叶声、以及青铜器回响等方式来解释神意。","在英语里，“Dodonian”多见于历史、古典学、神话或文学语境，用来营造“古老神谕/预言式”的氛围。"]}
{"word":"dodonian","summary":{"en":"Dodonian means “connected to Dodona,” the famous ancient Greek oracle site; more rarely, it can mean a person from Dodona.","zh":"Dodonian指“与多多那有关的”（古希腊著名神谕圣地）；较少也可指“多多那人/来自多多那的人”。"},"definitions":[{"partOfSpeech":"adj.","definition":{"en":"Relating to Dodona, an ancient Greek sanctuary in Epirus famous for the Oracle of Zeus (and later Dione).","zh":"与多多那（Dodona）有关的；指古希腊伊庇鲁斯地区著名的宙斯神谕圣地（后来也与狄俄涅相关）。"},"examples":[{"en":"In some classical texts, a “Dodonian oak” is linked to the oracle at Dodona.","zh":"在一些古典文本中，“多多那的橡树”常与多多那神谕联系在一起。"},{"en":"The poet uses Dodonian imagery to suggest prophecy and mystery.","zh":"诗人借用多多那意象来暗示预言与神秘。"}]},{"partOfSpeech":"n.","definition":{"en":"A person from Dodona (rare in modern usage).","zh":"多多那人；来自多多那的人（现代用法较少）。"},"examples":[{"en":"The historian refers to the Dodonians as local people who served the sanctuary.","zh":"历史学家把“多多那人”称作服务于神庙的当地居民。"}]}],"synonyms":["Dodonaean","Dodonean (variant)"],"phonetic":"/doʊˈdoʊniən/","extraExplanation":["“Dodonian”源自地名Dodona（多多那），在古希腊文化中以“神谕”闻名。传说神谕会通过圣橡树树叶的沙沙声、青铜器的回响等方式传达，因此在文学里常被用来象征预言、神秘的指引或古老权威。","也常见拼写变体：Dodonaean（更常见于学术或古典语境）。"]}
{"word":"dodos","summary":{"en":"“Dodos” is the plural of “dodo” (an extinct flightless bird) and can also mean outdated or useless people/things in informal English.","zh":"“dodos”是“dodo（渡渡鸟）”的复数；口语中也可比喻“过时或无用的人/事物”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"Plural of dodo: a large, flightless bird that lived on the island of Mauritius and became extinct in the late 1600s.","zh":"dodo（渡渡鸟）的复数：一种曾生活在毛里求斯岛的大型不会飞的鸟，17世纪末灭绝。"},"examples":[{"en":"Scientists study dodos to understand how human activity can cause extinction.","zh":"科学家研究渡渡鸟，以了解人类活动如何导致物种灭绝。"},{"en":"In the museum, we saw pictures and models of dodos.","zh":"在博物馆里，我们看到了渡渡鸟的图片和模型。"}]},{"partOfSpeech":"n.","definition":{"en":"(Informal) People or things that are outdated, slow, or no longer useful.","zh":"（非正式）指过时、反应慢或已经不再有用的人或事物。"},"examples":[{"en":"Some people think printed maps are dodos now that we have GPS.","zh":"有些人觉得在有GPS之后，纸质地图已经成了“过时货”。"},{"en":"The company replaced its old computers—those dodos couldn’t run new software.","zh":"公司换掉了旧电脑——那些“老古董”跑不动新软件。"}]}],"synonyms":["extinct birds (literal)","dinosaurs (figurative)","relics","has-beens","old-fashioned things"],"phonetic":"ˈdoʊdoʊz","extraExplanation":["“dodo”最常见的文化含义和“灭绝”联系很强，所以在比喻用法里常用来形容“已经被时代淘汰的东西”。","渡渡鸟因缺乏天敌而不怕人类，加上栖息地破坏与外来动物影响，最终在17世纪后期灭绝；它常被用作环保与物种保护的象征。"]}
{"word":"dodrans","summary":{"en":"Doldrums means a slump or low-mood period, and it can also mean the calm, windless zone near the equator in sailing.","zh":"Doldrums 指低迷/停滞期；也可指航海中的赤道无风带。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a period of low activity, sadness, or lack of progress; a slump or rut","zh":"低迷期；停滞期；情绪或事业的萎靡状态"},"examples":[{"en":"After the holidays, I always fall into the doldrums for a week or two.","zh":"假期过后，我总会低迷一两周。"},{"en":"The company has been in the doldrums since sales dropped last year.","zh":"自从去年销量下滑后，这家公司一直处于低迷状态。"}]},{"partOfSpeech":"n.","definition":{"en":"(nautical) an area near the equator with little wind, where sailing ships may be slowed or stuck","zh":"（航海）赤道附近的无风带（旧时帆船可能因此减速或受困）"},"examples":[{"en":"The ship was trapped in the doldrums, with the sails hanging limp.","zh":"船困在无风带里，帆软塌塌地垂着。"},{"en":"Sailors feared the doldrums because the wind could disappear for days.","zh":"水手害怕无风带，因为风可能好几天都不来。"}]}],"synonyms":["slump","rut","blues","stagnation","downturn"],"phonetic":"/ˈdoʊldrəmz/","extraExplanation":["你输入的“dodrans”很可能是拼写误差；常见对应词是 **doldrums**（复数形式使用）。","“doldrums”原本指赤道附近的无风带，后来在日常英语中常用来比喻“情绪低落、工作学习缺乏动力、事情停滞不前”。","搭配提示：常说 **be in the doldrums**（处于低迷/停滞状态）、**fall into the doldrums**（陷入低迷）。"]}
{"word":"dodrantal","summary":{"en":"“dodrantal” is not a standard English word; it’s likely a misspelling or a proper name.","zh":"“dodrantal”不是标准英语单词；更可能是拼写错误或专有名词。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word. It may be a misspelling or a name/term from a specific context.","zh":"不是标准英语单词，可能是拼写错误，或来自特定领域/语境的名称或术语。"},"examples":[{"en":"I can’t find “dodrantal” in an English dictionary—could you check the spelling?","zh":"我在英语词典里找不到“dodrantal”，你能确认一下拼写吗？"},{"en":"Did you mean “deodorant” or “detrimental”?","zh":"你想说的是“deodorant（除臭剂）”还是“detrimental（有害的）”吗？"}]}],"extraExplanation":["“dodrantal”看起来像拼写接近但不正确的单词。你可以：\n1）提供一句包含它的原句（我就能根据上下文推断）；\n2）说明它出现的领域/平台（比如游戏ID、药品名、品牌名、小说人名等）；\n3）核对是否想写：\n- deodorant（除臭剂）\n- detrimental（有害的，不利的）\n- dominant（占主导的）\n- dorsal（背部的；背侧的）\n把原句发我，我可以帮你锁定最可能的目标词并给出详细释义与用法。"]}
{"word":"dods","summary":{"en":"“dods” most commonly means the plural of DOD (the U.S. Department of Defense); a rare dialect use is a form of the verb “dod” meaning “to bob up and down.”","zh":"“dods”最常见是DOD（美国国防部）的复数；少见的方言用法中也可作动词“dod”的形式，表示“上下轻晃/起伏”。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"(plural) Abbreviation for “DOD,” meaning the U.S. Department of Defense.","zh":"（复数）“DOD”的缩写，指美国国防部。"},"examples":[{"en":"Several DODs reports were released about cybersecurity this year.","zh":"今年发布了几份美国国防部（DOD）的网络安全报告。"},{"en":"The contractor works with different DODs offices in Washington, D.C.","zh":"这家承包商与华盛顿特区不同的国防部部门合作。"}]},{"partOfSpeech":"v.","definition":{"en":"A rare/dialect form of “dods” as the third-person singular of “dod,” meaning to move up and down quickly (to bob).","zh":"一种少见/方言用法，“dod”的第三人称单数形式，意为快速上下摆动（轻轻点动、晃动）。"},"examples":[{"en":"In the wind, the small boat dods on the waves.","zh":"风里，小船在浪上上下起伏。"}]}],"synonyms":["Department of Defense (U.S.)","the Pentagon (informal, sometimes used for DOD)"],"phonetic":"/ˌdiː oʊ ˈdiːz/","extraExplanation":["“DOD”在美国英语中常读作字母缩读（D-O-D）。写作“DODs”通常表示“多个DOD相关单位/部门/机构”，或在口语/非正式写法中表示“DOD的复数”。如果你指的是别的含义（比如拼写想写的是“does / dots / gods”），告诉我上下文我可以更准确解释。"]}
{"word":"Dodson","summary":{"en":"Dodson is mainly an English-origin surname; it can also be a rare first name or a place name.","zh":"Dodson主要是英源姓氏，也可作较少见的名字或地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname) of English origin.","zh":"（英源）姓氏：多德森。"},"examples":[{"en":"Lewis Carroll’s real name was Charles Lutwidge Dodgson.","zh":"《爱丽丝梦游仙境》作者刘易斯·卡罗尔的本名是查尔斯·路特维奇·道奇森（Dodgson）。"},{"en":"Ms. Dodson will lead the meeting today.","zh":"多德森女士今天将主持会议。"}]},{"partOfSpeech":"n.","definition":{"en":"a given name (first name), uncommon today.","zh":"名（名字）：较少见。"},"examples":[{"en":"Dodson is occasionally used as a first name in the U.S.","zh":"在美国，“Dodson”偶尔也会被用作名字。"}]},{"partOfSpeech":"n.","definition":{"en":"a place name (used for some towns/areas, especially in the United States).","zh":"地名：用于一些城镇或地区名（尤见于美国）。"},"examples":[{"en":"They drove through Dodson on the way to the lake.","zh":"他们去湖边的路上经过了一个叫Dodson的地方。"}]}],"synonyms":["(no direct synonyms; it is a proper name)"],"phonetic":"/ˈdɑdsən/","extraExplanation":["“Dodson”常见于英语世界的姓氏，通常被认为源自中古英语的人名或绰号（如“Dod/Dodd”），再加上表示“……之子”的后缀“-son”，整体含义可理解为“Dod（或Dodd）的儿子”。在实际使用中，它多作为姓出现，也可能出现在地名中。"]}
{"word":"Dodsworth","summary":{"en":"Dodsworth is a surname and the title of Sinclair Lewis’s novel (and its film adaptation).","zh":"Dodsworth 既是一个姓氏，也指辛克莱·刘易斯的小说《Dodsworth》（及其电影改编）。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), most commonly found in English-speaking countries.","zh":"一个姓氏（家族姓），常见于英语国家。"},"examples":[{"en":"Her last name is Dodsworth.","zh":"她的姓是 Dodsworth。"},{"en":"Mr. Dodsworth will speak at the meeting today.","zh":"Dodsworth 先生今天会在会议上发言。"}]},{"partOfSpeech":"n.","definition":{"en":"the title of a well-known American novel (1929) by Sinclair Lewis, also adapted into a famous film (1936); it is often used to refer to that story or its main character.","zh":"美国作家辛克莱·刘易斯（Sinclair Lewis）1929年的小说《Dodsworth》（《道兹沃斯》）；也可指其1936年的著名电影改编版，或该故事/主角本身。"},"examples":[{"en":"We read Dodsworth in class to discuss marriage and social change.","zh":"我们在课上读《Dodsworth》，用来讨论婚姻与社会变化。"},{"en":"Dodsworth (1936) is considered a classic film adaptation.","zh":"1936年的电影《Dodsworth》被认为是经典改编作品。"}]}],"phonetic":"/ˈdɑdzwɝθ/","extraExplanation":["《Dodsworth》常被视为对20世纪早期美国中上阶层生活与价值观的观察：主角（Sam Dodsworth）退休后与妻子前往欧洲旅行，故事聚焦婚姻张力、身份焦虑与“新旧观念”的碰撞。","作为专有名词（姓名/书名/片名），Dodsworth 在句首以外也通常要大写。"]}
{"word":"dodunk","summary":{"en":"“dodunk” isn’t standard English; it most likely refers to “dunk” (a basketball dunk or dipping food into a drink/sauce).","zh":"“dodunk”不是标准英语；多半指“dunk”（篮球扣篮或把食物蘸入饮料/酱汁）。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"Not a standard English word; most likely a misspelling or a casual typing of “do dunk” (meaning to dunk something, especially in basketball).","zh":"不是标准英语单词；很可能是拼写/输入错误，想表达“do dunk”（做一次扣篮或把东西浸一下）。"},"examples":[{"en":"I think you meant “dunk,” like “He can dunk a basketball.”","zh":"我觉得你想写的是“dunk”，比如：“他能扣篮。”"},{"en":"Do you mean “do a dunk” in a game?","zh":"你是指在比赛里“做一次扣篮”吗？"}]},{"partOfSpeech":"v.","definition":{"en":"(Likely intended: dunk) To jump and force the ball down through the basket in basketball.","zh":"（可能想写：dunk）在篮球中起跳把球从篮筐上方直接扣进。"},"examples":[{"en":"He dunked the ball with one hand.","zh":"他单手把球扣进了。"},{"en":"She practiced her vertical jump so she could dunk.","zh":"她练习弹跳，想要能扣篮。"},{"en":"That dunk changed the energy of the whole game.","zh":"那次扣篮改变了整场比赛的气势。"}]},{"partOfSpeech":"v.","definition":{"en":"(Likely intended: dunk) To dip food into a drink or sauce briefly.","zh":"（可能想写：dunk）把食物短暂地浸到饮料或酱汁里。"},"examples":[{"en":"He dunked his cookie in milk.","zh":"他把饼干蘸进牛奶里。"},{"en":"Dunk the bread in the soup before you eat it.","zh":"吃之前把面包在汤里蘸一下。"}]}],"synonyms":["slam dunk","jam (basketball)","dip (food)"],"phonetic":"/dʌŋk/","extraExplanation":["“dodunk”在英语里不常见，也不是主流词典收录的标准词。最可能的目标词是“dunk”。如果你是在某个游戏ID、品牌名、或特定社区/方言里看到“dodunk”，告诉我上下文（句子或截图），我可以更精准判断含义。"]}
{"word":"Dodwell","summary":{"en":"Dodwell is most commonly a surname; less commonly it can be a UK place name.","zh":"Dodwell 最常见的是英文姓氏；较少情况下也可作英国地名。"},"definitions":[{"partOfSpeech":"n.","definition":{"en":"a family name (surname), originally from England; used to refer to people with this last name","zh":"姓氏（家族名）；源自英格兰的姓，用来指姓 Dodwell 的人"},"examples":[{"en":"Dr. Dodwell will speak at the conference tomorrow.","zh":"Dodwell 博士明天将在会议上发言。"},{"en":"I found a book by Dodwell in the library catalog.","zh":"我在图书馆目录里找到一本作者为 Dodwell 的书。"}]},{"partOfSpeech":"n.","definition":{"en":"(less common) a place name in the UK, used in names of local areas or properties","zh":"（较少见）英国的地名，用于某些地区或地产名称"},"examples":[{"en":"They drove past Dodwell on their way to the village.","zh":"他们去村子的路上开车经过 Dodwell。"}]}],"phonetic":"/ˈdɑd.wɛl/","extraExplanation":["“Dodwell”也常出现在历史与商业语境中：例如 17–18 世纪有学者 Henry Dodwell（1641–1711，神学与历史研究者）。此外，近代亚洲贸易史中也出现过以 Dodwell 命名的英商公司（如 “Dodwell & Co.”），在旧资料里可能会见到。具体指代需要结合上下文（人名/公司名/地名）。"]}
{"word":"Dody","summary":{"en":"“Dody” is usually used as a person’s name, not a standard English word.","zh":"“Dody”通常是人名用法，并非标准英语词汇。"},"definitions":[{"partOfSpeech":"other","definition":{"en":"A personal name (given name or nickname). It is not a common standard English vocabulary word; it’s usually used as someone’s name (e.g., “Dody” as a nickname).","zh":"人名（名字或昵称）。它不是常见的标准英语词汇，通常作为某人的名字来使用（例如把“Dody”当作昵称）。"},"examples":[{"en":"Dody is my classmate from Indonesia.","zh":"Dody 是我来自印度尼西亚的同学。"},{"en":"Please ask Dody to call me when he’s free.","zh":"请让 Dody 有空时给我打电话。"}]}],"synonyms":["(as a name) Dodi","(as a name) Doddy"],"phonetic":"/ˈdoʊdi/","extraExplanation":["“Dody”更常见于人名/昵称场景，不同国家和家庭可能有不同来源与拼写（如 Doddy、Dodi 等）。如果你是在文章里看到 “Dody”，也有可能是拼写错误或误读，常见的易混词包括：daddy（爸爸）、dodie/Dodie（人名）。如果你能提供完整句子，我可以帮你判断具体含义。"]}

